{"zYmb1pwTWow77v73ykeUEg":{"text":"Hands down this is my NEW favorite restaurant!!! OMG, the food is AMAZING! Everything was ","useful":1,"cool":0},"MFiNHWcl71974bM2QhSJpA":{"text":"My girlfriend and I were in town for vacation and we decided we wanted something a little ","useful":1,"cool":0},"yzNyqD2mOdAk1AhrHdnEow":{"text":"SO GOOD. I had the seafood chowder and my husband had the chicken and andouille gumbo. Bot","useful":0,"cool":0},"hiA4rcg7DZVUTKO7U1W6SA":{"text":"Best food I have ever had. I traveled the world and ate at the best restaurants but Rebirt","useful":0,"cool":0},"lcL8oqdgt8epHtSO_n8pBA":{"text":"A small comfortable restaurant. The reviews suggest it's something to look forward too, wh","useful":0,"cool":0},"2c94JqU5XmHF9MB6jxNgjQ":{"text":"Get the pork belly as an appetizer...you will not regret it! Came here for dinner about tw","useful":1,"cool":1},"1XSJQk2Zc7Aq14CrXV1MZg":{"text":"The most incredible dinner start to finish. Friendly service, fantastic fish, appetizers a","useful":0,"cool":0},"Nis8PG9CZRL7wzI1gxVxxg":{"text":"Okay,,,, this place fits the Planet of NewOrleans well.\nGet the Bison, just get it.\n\nServi","useful":1,"cool":1},"OMqiXEUgHXOvr0spHmMKIw":{"text":"Restaurant Rebirth you are my favorite. \nNo seriously, my favorite!  Every time I make my ","useful":1,"cool":0},"Iwyhawp89RIt4rDiHy-E5w":{"text":"Really enjoyed the food here.  We had several items such as the gumbo, quail, shrimp and l","useful":0,"cool":0},"dEQlAVVqYPxHcIyc4pVVOA":{"text":"Awesome food and ambiance!  It lived up to the reviews we read before making our reservati","useful":0,"cool":0},"8-kVTirsSMQYCbpZvhe9EQ":{"text":"Have been wanting to try this place forever and so glad we did.  Love the cool little area","useful":1,"cool":0},"HlCCi3z1ib918jtX7qBlEw":{"text":"I love this restaurant with a passion. I've been there twice now with my boyfriend and it ","useful":0,"cool":0},"kpPW-lDlVyrtfZdSsL_2lw":{"text":"Small Quaint restaurant we sat at the bar, as the place was packed.  The bartender recomme","useful":0,"cool":0},"m1hkBLcoFd30qLx274XcLQ":{"text":"Everything was pretty much excellent. I recommend to start off with the bbq pork belly for","useful":1,"cool":1},"Cx3sf6E4UdPk3TdcVr220Q":{"text":"Small restaurant. I recommend making reservations. Food was ok very expensive for the qual","useful":0,"cool":0},"lwn0aogYnjoDz7dp1Per7w":{"text":"This place was all around phenomenal. The food was expertly flavored and the portions did ","useful":0,"cool":0},"6xnDYP7Lov4cgIcxTibPkQ":{"text":"Absolutely amazing food, service and wonderful ambience. Fine dining in a casual easy sett","useful":0,"cool":0},"KZG1cD43xMNWueRRo2PUvg":{"text":"Great new spot. Delicious food, quaint decor. Seafood chowder was amazing!  As were the bl","useful":1,"cool":1},"N8Z6w4AxWx8U79J7GNEuoQ":{"text":"Gumbo was delicious appetizer, perfectly seasoned and nice and hot. Gulf Seafood entree wa","useful":0,"cool":0},"_RpMc1E8FG8R6PCSkc_RuQ":{"text":"Please please please please please come to Portland Oregon. Having eaten at Portland city ","useful":2,"cool":3},"-m3OzbSxiKT1JPbmm5OMDQ":{"text":"Stunningly awesome. Went back two times to try more of the menu. The Chef is utterly amazi","useful":1,"cool":0},"uNzxByQBq8fOLhy9p2TZLw":{"text":"Our first time here but we come to New Orleans quite a bit. Mary was our server and she wa","useful":0,"cool":0},"09yKak8u2RJ_67waYXrwTg":{"text":"The best food and service around! The atmosphere is great. The pork chop was amazing as wa","useful":1,"cool":1},"lSHVD4Xx2B5mf520F2Rc0Q":{"text":"The service (Collin and Neal) was beyond incredible. The food unique and amazing. I highly","useful":0,"cool":0},"0EFNaoyD7GfboTFjzfDM6Q":{"text":"Great dinning in a small restaurant. The Pork Chop was exceptional!","useful":0,"cool":0},"PJQB1Gs1AgEv8mshiEM6dQ":{"text":"ok although we didn't actually eat here, just drinks, we saw how large the portions were a","useful":0,"cool":0},"35uf4jErHfCN4ftvE0W8ag":{"text":"Awesome food. Eating here three times in three days. The project belly is to die for, the ","useful":1,"cool":0},"9PNPSQ9GIDCiHXTM0-2W8g":{"text":"Everything was amazing from ambience, to cocktails, to appetizers, entrees and dinner. Por","useful":0,"cool":1},"tijBtBFjM9mv9kze33dOcA":{"text":"Had a fun time and the food was good. Looked like a parking prob if I was driving\n\nFood ca","useful":0,"cool":0},"FUBcfPqOUE5f0PUVCc3ijg":{"text":"This place is new, but everything runs smoothly and on point. I came here by myself for di","useful":3,"cool":1},"g2CKBpglyaVqfW5axdi00g":{"text":"You must eat here! The food, service and atmosphere are all divine. We started with the po","useful":0,"cool":0},"7OxNiPEKaJGC4JUSEoV52w":{"text":"Location is great , inside atmosphere is perfect , the host and servers are top notch , an","useful":1,"cool":0},"7nPLhismKk5tmdehhca8aQ":{"text":"Walked in, greeted then seated quickly. Jimmy was our waiter but the whole staff helped my","useful":2,"cool":1},"6vQw-uJKiEnxCjYSyJRT8A":{"text":"Very good food and hospitality.  From the soup to the Scallops to the white chocolate brea","useful":0,"cool":1},"DdaW69lRrKOxnuGpv7ObjQ":{"text":"Great restaurant! Staff was very friendly and attentive.  We had the pork belly- it is a m","useful":1,"cool":1},"1HFeYAVWUBGeZUP0fEqAdg":{"text":"We had a great experience for dinner during our trip to NOLA! It's a small restaurant that","useful":1,"cool":0},"R9Qktj-IrpRnQDehlRZb6g":{"text":"Such good food. We got the pork belly as an appetizer and it was incredible. Then got two ","useful":1,"cool":1},"gv-0FPDaJzqGBe96fnfYIQ":{"text":"Porkbelly, scallops and gumbo, oh my! Everything was amazing. My teenager wanted to lick h","useful":0,"cool":0},"0aAQuTeEQBiajxDG40p33w":{"text":"Great food! You have to get the gumbo to start off! The gumbo is the best i have ever had.","useful":1,"cool":0},"IA78lEd1i47VSPNA4F_UnQ":{"text":"Came in here late on a Monday night and sat at the bar. Ordered the pork chop. It was the ","useful":1,"cool":0},"ZVov1pwqmsbMEcEKv3FYvw":{"text":"My husband and I came here for a nice dinner on our honeymoon. We were not disappointed, t","useful":0,"cool":0},"CkgPCoD6hI8jfMks5xMd-w":{"text":"Amazing !!!! Wandered in on a Thursday night around 9pm- waited about 30 minutes for a tab","useful":0,"cool":0},"d1KLVe5cGwzt3159b8S8UA":{"text":"I absolutely loved this place!   wonderful service! Stellar food! And the owner was going ","useful":0,"cool":0},"71aa_-0zEn6WhhSZb8M-Iw":{"text":"Ate here last night after making a reservation the day before. We recently heard that loca","useful":1,"cool":0},"lhTxIfXaXciIG4OuIQJhAA":{"text":"An upscale restaurant in the warehouse district.\n\nApp\n We ordered the shrimp eggplant as a","useful":0,"cool":0},"Y6c4YuyGL6wXNFcjAuRm_w":{"text":"Another perfect review! I came to New Orleans for an entrepreneurship conference and I hav","useful":0,"cool":0},"VklUyh6BL7Zz4v_jqe5oiQ":{"text":"Amazing cornbread, appetizers, service! Leonard the bartender awesome!!!  Absolutely recom","useful":0,"cool":0},"oxtRySPNBZXG8UgTeBI80Q":{"text":"Absolutely amazing food and service! Leonard was exceptionally accommodating!  Blackened s","useful":0,"cool":0},"12c6ySsQNk-3VWLBuAKcNg":{"text":"To begin our food journey through New Orleans, we had our first solo date night here, and ","useful":3,"cool":1},"4bq-rvxUHgrhix9mLQZMrA":{"text":"We ended up here after looking at review on Yelp. To be honest, I didn't think any restaur","useful":1,"cool":0},"RFs5JgcZJWONCUfZ6Ch_Wg":{"text":"If I was dying, I would definitely dine here for my last meal!  Every detail of your dinin","useful":1,"cool":0},"xLrqr4pebBrrX6jhVL3nMQ":{"text":"The food was amazing! Full of flavor and cooked to perfection!! We had the Red Fish ....oh","useful":0,"cool":0},"aLEJoOoOHt06tB5R77FrgQ":{"text":"Excellently crafted farm fresh and beautifully presented!  Another new and creative restau","useful":2,"cool":1},"LzU6lwt4dRvcxaCFaszF3A":{"text":"I'm not impressed. I had dinner at the bar because the hostess said they were expecting re","useful":0,"cool":0},"jKKz06uZTpjYPujxwePEtw":{"text":"Excellent food and service. Highly recommend this place. We had reservations for two and e","useful":0,"cool":0},"GtwGj0zsoQdrXiQlZPKAgg":{"text":"Ate there News Years Eve and most places that have a special fixed menu are usually sub pa","useful":0,"cool":0},"BPA04iF_JMscSv4KlYO06g":{"text":"It always seems redundant to put a 5 star restaurant on a place with this many positive re","useful":0,"cool":0},"R0dUsZr4IBgqF-TJiyFpHw":{"text":"I would give more stars if I could. This places serves the best food I have ever eaten.  8","useful":0,"cool":0},"6W-gjisFhs5jODptG-hVQQ":{"text":"I came in on a Saturday evening with a group of girls. We were expecting a true fine dinin","useful":2,"cool":0},"H2eTGJyGY03fwXv9NK2-3g":{"text":"A rose by any other name... Restaurant Rebirth does not disappoint.  Come hungry.  Get the","useful":1,"cool":0},"FKWFrqkYxkvyvc2iJlNi_Q":{"text":"Very nice atmosphere.  Food was tasty.. though a tad bit overpriced. Attentive wait staff ","useful":0,"cool":0},"Hm_lr6cJhnQISPhx_PyKGA":{"text":"This place is very good. But it is not 5 star excellent.\nThe food was all very good....but","useful":0,"cool":0},"Z3sjdCDDlaNPaGyS5mWc_w":{"text":"We hit a real gem by making a reservation here. I wasn't sure what to expect but Yelp real","useful":4,"cool":1},"jvEyJNyFOwmhcpMBxAWCPA":{"text":"Great little gem of a restaurant. Excellent farm-to-table restaurant!! The food is outstan","useful":0,"cool":0},"0YzH7zD-QMkqYCxbruMrjg":{"text":"Holy. Crap. Go here.\n\nWe got the shrimp stuffed eggplant and the just picked greens salad.","useful":2,"cool":0},"ecgacNbuJE9cZEOq8J1d_g":{"text":"We had dinner at Rebirth last evening. I loved the small intimate space. The staff was cor","useful":0,"cool":0},"UjeOsa-FeYqxe2Kxsw9row":{"text":"Day 1 of our Restaurant Rebirth inspired NOLA trip and within 90 minutes of the wheels tou","useful":0,"cool":0},"P83DDyWd9R4PJQAPbovtEA":{"text":"Our waiter Alex was great. The food was excellent. You must try the soup d hour light seaf","useful":0,"cool":0},"VOWKyrWFAipkHv8F5YVCow":{"text":"Our 5F (Fourth Friday for Friends Foodies and Fun) selected Restaurant Rebirth for our din","useful":1,"cool":1},"zvwzWthR6QL3s1vxORzeuA":{"text":"Y'all, say y'all, this place is where you need to be, no lie.\n\nThis has been unfairly book","useful":6,"cool":3},"6Vc5itNyBkPp1KXY3XUWow":{"text":"Our waitress was delightful and fun! Her recommendations were excellent and the food was r","useful":0,"cool":0},"_XLmFqJXdFE05wrwxsvNCw":{"text":"Pork belly and gumbo were phenomenal. Both are must haves. Nice, but small space, food mak","useful":0,"cool":0},"5cWOX72lRf1F_kIwzQgFpA":{"text":"Gumbo was wonderful. Grilled romaine and oysters was excellent. Shrimp and eggplant was in","useful":0,"cool":0},"hGMkAauRm5cR7oLGM9rhMg":{"text":"Wow...just wow! About as good as it gets in the Big Easy.  Went with 3 friends, devoured a","useful":0,"cool":0},"YTDKLEAtmyXhMHFtnZN50g":{"text":"Stopped in here on a weekend trip to New Orleans.  Great meal, every course was phenomenal","useful":2,"cool":1},"PKvIJK2jXdoH_ai-bOHTkQ":{"text":"Absolutely amazing!! If perfect could be perfect it would equal Restaurant Rebirth! Such a","useful":0,"cool":0},"U_jgzd0jCVc2FhBXOQM8pg":{"text":"Amazing food. We visited from NYC on MLK weekend. Picked this based on yelp and TripAdviso","useful":3,"cool":0},"Pcp-671Xlhs2dfm8VZKLig":{"text":"This place is great!  I highly recommend this place! We had the pork-belly and shrimp wrap","useful":0,"cool":0},"-Db2Iqa_IevKUjLYHujVXg":{"text":"Are here twice because the Marriott hotel food  (across the street) was making me ill (pro","useful":3,"cool":0},"hMbQj2rdUJxsB_10ew0Dew":{"text":"I must say, our service tonight was fantastic and the food was delectable! I Highly recomm","useful":1,"cool":1},"v8AmBDstlugtPucvddotWA":{"text":"We decided to dine here while visiting New Orleans. The pork belly appetizer and the soup ","useful":0,"cool":0},"14HNHMMhMj-KDtIDWZu0Dw":{"text":"This review is simply a repeat of everything you already read. This place does not disappo","useful":0,"cool":0},"lO53qMvjwwgXmMicNe0D_g":{"text":"This was the best dinner we had in New Orleans.  Everything was just perfect, from drinks,","useful":0,"cool":0},"pU0oBcpzLfasXDQp4UFODQ":{"text":"One of the best bites of food I've had in the city of New Orleans.\n\nIt takes a lot for me ","useful":3,"cool":1},"l6jMFBagVdnCT_Va6AcgWg":{"text":"In the creole food capital of the country, opening a restaurant with a modern take on creo","useful":5,"cool":2},"TunlKj-MGPQpTVzqfTi8tw":{"text":"Rated one of the best new restaurants in the country and guess what they were absolutely r","useful":1,"cool":1},"uDO501jyskX9LesYrlMfIw":{"text":"Best salad  dressing  I've  ever  had  - and I  don't  usually  like  salad  dressing. The","useful":1,"cool":1},"7Ijg1iKmarAvBbDf58dCvQ":{"text":"Excellent restaurant in a city full of great restaurants.  Superb service with a sophistic","useful":0,"cool":0},"6Md6GG5Ajtku62qv8sMNxw":{"text":"Literally amazing! Manny and staff were all wonderful, making the whole dining experience ","useful":0,"cool":0},"RVskWW3GK6oGgRt4h5XoPQ":{"text":"Excellent food and service! The fish of the day, steak tartare and soft shell crab are all","useful":0,"cool":0},"5x7ffh5fwZZdEzhJKL36BQ":{"text":"Came with a party of 10 and everyone got something different with no one going away unhapp","useful":1,"cool":1},"hO0K_aSBILRlgUAEyLp_cg":{"text":"The food is just amazing!!! One of the best restaurants I have been! The oysters & Angel H","useful":0,"cool":1},"b_Co-VAn2GNsEY-MW2IKlQ":{"text":"pork belly appetizer was decent. It didn't wow us, but i might get it again. I choked on t","useful":0,"cool":0},"ECDJXaI0ExbuxmpU4Iding":{"text":"I had a great experience at this restaurant. A big reason for this is the absolutely stell","useful":0,"cool":0},"1U89MHcTWLZEL99bUzvPHw":{"text":"This place is EXCELLENT!!  Saw the Yelp review and checked it out on our first night in NO","useful":0,"cool":0},"dQF4kGInsZIxBMg2sAa9bg":{"text":"Phenomenal experience.  Melt in your mouth pork belly appetizer!! Great food and service!","useful":1,"cool":0},"IqOMj3Ub9edAMqGNOLoneA":{"text":"everything was good expected the angel hair pasta with fried oyster,  the oyster was golde","useful":0,"cool":0},"ktc3n9quuW2uirqiRzIyMw":{"text":"Nice little restaurant in the warehouse district. The food was prepared well and tasted gr","useful":0,"cool":0},"uCg22-QS4CSKof6SdRtA0A":{"text":"Amazing from start to finish.  The salad with oysters was just perfect then scallops with ","useful":1,"cool":0},"iEmcU6bjdzJaBnX69vKKOg":{"text":"Oh Boy! Do you want a perfect date night? Or to impress someone? Or not have to worry abou","useful":2,"cool":0},"KA2WY873DrVNOU3XfAIZhg":{"text":"Suuuuuuuper yummy apps and mains. We started with the pork belly and fried shrimp, dived o","useful":0,"cool":0},"vpTMvt0sWk8dvW7nrQMYMg":{"text":"Mississippi style barbecue pork belly was the highlight. Highly recommended.  I would retu","useful":1,"cool":0},"XQJq2j40EW2sbWeo6t8cvA":{"text":"Out of this world good food. Not a 5 for only one reason which I hope the owners read. We ","useful":0,"cool":0},"TYM8hAduVOR_OPp6OmqgdA":{"text":"I have been lucky enough to visit New Orleans frequently this past year and experience the","useful":0,"cool":0},"SwyE54GNuO1AHYQFAT9EwA":{"text":"The fried oyster and pasta appetizer is a wonderful mixture of flavors.  I could easily ha","useful":0,"cool":0},"hqhy5xcjnPar50eLULTsXg":{"text":"My boyfriend and I have a running list of places we want to eat in Nola. We came here duri","useful":0,"cool":0},"qYnsTgmoo7Fm5DT-MUa7CQ":{"text":"Excellent choice for a quaint little romantic dinner! Small and intimate and great staff! ","useful":0,"cool":0},"4l98cTgh2gJFOxWTed8TfA":{"text":"This place is amazing!! My husband and I stopped in for appetizers. We ordered the BBQ por","useful":0,"cool":0},"HITzTjHT20FebMb6QTJDKw":{"text":"A MUST try!!! Everything was amazing!! \nWe had the pork belly and it was paired with green","useful":0,"cool":0},"6HoWQ5moPFqitPDUQN0otg":{"text":"We loved this place. It was within walking distance of where we were staying. I had the ri","useful":0,"cool":0},"7bzeApTom1z4_UlBH06VMQ":{"text":"The most amazing food ever!  I've traveled the world and this place is the best food I've ","useful":0,"cool":0},"sfq2avSNdNQG3Ra4Oj7P9w":{"text":"I would give this place 6 stars but unfortunately they limit us to 5. GREAT food with 6 st","useful":1,"cool":1},"vPmgNOtKfab1P_FU9FOMSQ":{"text":"There are few times I feel compelled to write reviews, and especially living here in NO wh","useful":1,"cool":0},"nPKpSUs1EOR5fDscQNYTcg":{"text":"Great food. Service was fantastic. Got the fish of the day, soup of the day and an 8oz fil","useful":0,"cool":0},"0I-sX6oFnDj7BRzXlRh8gw":{"text":"Day 1 of our Restaurant Rebirth inspired NOLA trip and within 90 minutes of the wheels tou","useful":0,"cool":0},"c5XLBHsRlDR7ZdJ51bZLHw":{"text":"The food here is absolutely amazing! Every single person in our group ordered a different ","useful":1,"cool":0},"tPZ5Qpdp7ce8FGSXKqlwrw":{"text":"From start to finish, my taste buds were engaged and delighted. Every dish was unbelievabl","useful":0,"cool":0},"rPdXoqCVgHA3HBpGe3WBhw":{"text":"This was a good find thanks to YELP. Came here on a Thursday night for dinner. We didn't m","useful":0,"cool":0},"zndLWm9tLt0a8ap_jwZpfw":{"text":"Fantastic experience. Used Yelp and looked at reviews and it was great. Did not have reser","useful":0,"cool":0},"wFDuryUisQkne6g8-cOs7g":{"text":"This place is awesome.  The outside of the building (the whole block really), appear to be","useful":0,"cool":0},"dpYb42EzViPJCx_XoWcTDQ":{"text":"Amazing food and service! Fish of the day was Cobia. Hubby had blackened scallops and we b","useful":0,"cool":0},"7HYEFT8xdXSZPr_ifKAcNw":{"text":"So, let me start out by saying that this is my first review, but this place deserves it. N","useful":2,"cool":1},"dY70jo-OFygQedpildAu-g":{"text":"We came to Rebirth because it was the highest rated Creole place on Yelp... but we found i","useful":0,"cool":0},"TDb3DdiHxFf7TP2TXK_cHg":{"text":"I took my in-laws here on a Saturday night, which was risky because it is so new, but it t","useful":3,"cool":1},"valHV4KMf4oVjt-Z8Tj9BQ":{"text":"The food was amazing! Had the quail appetizer, so good. For dinner had the filet it was a ","useful":1,"cool":0},"BCb3mKb4ZIB3nhnDQdKLwQ":{"text":"It was amazing! I went last night at about 9:30. The dinner crowd had passed, so there was","useful":0,"cool":0},"qZiQ8i9rudsquUE6Ncl9BQ":{"text":"Showed up here for dinner and there were an ample number of open tables but we were asked ","useful":0,"cool":0},"COQyvun9eXSiSKL0wZcT1Q":{"text":"It was our first time in New Orleans and we were so happy with this spot. The bartender su","useful":0,"cool":0},"RqbRL0-bpxEFCG-Q6Lja8A":{"text":"Our second visit to Restaurant Rebirth. In the Warehouse District. Lots of renovations goi","useful":0,"cool":0},"Lx8pJCtVixUboCHadFCq4Q":{"text":"Outstanding, plain and simple.  During my stay in New Orleans I visited this place twice. ","useful":0,"cool":0},"nhpGHuQe2Fb9QwN2M6Yokw":{"text":"Blackened red fish was done perfectly and not overly spicy at all.$26.00\n\nProbably one of ","useful":1,"cool":0},"eCWGBsP0CUsJgrAJRiwA5w":{"text":"Wonderful dinner, we ate with a big group and everyone's dishes were presented beautifully","useful":1,"cool":1},"NehyxN3Y-OtoBUdfze6gPw":{"text":"Truly outstanding. Pork belly was perfect, scallops were treated with great respect and be","useful":1,"cool":1},"KLe7w32ahOkDAg7qVSUyuQ":{"text":"Sumptuous. \nPlease please try the pork bellies. OMG. Gustatory orgasm\nIf you are staying i","useful":0,"cool":0},"E3GuGJJn9EpSz2BxBQPk0g":{"text":"Amazing food and service! Fish of the day was Cobia. Hubby had blackened scallops and we b","useful":0,"cool":0},"sQGzLz2cFTL3fp7NVsN-Zw":{"text":"Restaurant Rebirth has given cause for Yelp to add a sixth star.  I've had a lot of meals ","useful":1,"cool":1},"9oprRKHg8MTFsSUKffJv0g":{"text":"Next trip to Restaurant Rebirth is coming up and we are totally excited...how excited, we ","useful":1,"cool":0},"jpK2l8TOcUMHq4OyX6CVrA":{"text":"The scallop dish was AMAZING! The scallops were sweet, slightly charcoaled and well season","useful":1,"cool":0},"rK66V38PsVong98pMIL57g":{"text":"Amazing food, welcoming service, and casual atmosphere.   Seafood was fantastic and pork b","useful":0,"cool":0},"AbeS7LSus3cD5QjqL8NQpw":{"text":"Fantastic dinner tonight.  We were sopping wet from a major shower with a thunderstorm and","useful":3,"cool":0},"vmR8xUQ3b2pFkVmPORa-TA":{"text":"Absolutely fantastic restaurant.  Probably the best I've eaten at in three trips to New Or","useful":1,"cool":0},"Vx_jvBSocnlgsy3xjJmSUQ":{"text":"First experience for me at a restaurant like this. This place was amazing, from customer s","useful":0,"cool":0},"ieJnAfxKvHZjFRBK3vmSAQ":{"text":"I have eaten at a lot of great restaurants and sampled wonderful food from around the worl","useful":0,"cool":0},"Pr2ojW2DlZsnxfc_MgDz_Q":{"text":"My 2nd visit with a group and it didn't disappoint. Had the pork belly and stuff egg plant","useful":1,"cool":0},"WsD-EvghMLIVfzp4TurUGg":{"text":"Our only miss on a recent vacation with a ton of great food.  The food was OK, but nothing","useful":0,"cool":0},"5YhDgVRGhnDV2T5F79uhUA":{"text":"Traveling almost every week I eat out a lot and very rarely find a restaurant that blows m","useful":0,"cool":0},"9XhJQgd2pFkAgaoBO3jICQ":{"text":"Awesome.  Not even the obnoxious table of 6 sitting next to us (yes, you know who you are,","useful":0,"cool":0},"e29RuyVTihZF9GK429cGHQ":{"text":"Wow! From the moment we stepped foot into the restaurant, to the moment we walked out the ","useful":0,"cool":0},"3IHzGZfpsdwIRGWrdbpXXA":{"text":"Try the gumbo, yo. The server said the chef has been perfecting his recipe for around 20 y","useful":0,"cool":0},"FcKiRckx2-1SYd92DwLiSA":{"text":"The Fish of the Day was Snapper and it was delightful!! The scallops were amazing and the ","useful":1,"cool":0},"PXeW4e3XFHPT2nrwPJlRkA":{"text":"Stop searching Yelp, put away your phone, cause this is by far the best restaurant in Nola","useful":2,"cool":0},"3P9fSCm9mVjsOYzCorwqYw":{"text":"We had an outstanding dinner at Rebirth. I really enjoyed my Red Snapper special. It was p","useful":7,"cool":8},"TM1ZHYtFbcfoc5MmKolK8w":{"text":"Came down to NOLA for jazz fest.  Had lunch at Cafe Amelie one day, Cochon another day and","useful":1,"cool":0},"052NuQ_LQGXPNMuf9MXe3A":{"text":"The food was better than expected!  It's a small restaurant with a good atmosphere but the","useful":0,"cool":0},"Yeo3wzrnUVOD18NplRlExg":{"text":"We found this place on a break form a conference. They were kind and friendly and the food","useful":0,"cool":0},"W8Dz8v64UKMFO23MoInxPg":{"text":"It is amazing that every meal we have in New Orleans is better than the last!  This one wi","useful":2,"cool":1},"pegueXzdVRfpO55QEUl3VA":{"text":"I feel this place was over-hyped and overpriced. The pictures looked amazing on Yelp, but ","useful":0,"cool":0},"TSJm8n3yqqdj4I_uNvUQrA":{"text":"Went for anniversary diner and this place did not disappoint!! Grilled Romain salad with f","useful":0,"cool":0},"KbeOBq5tILzKFSuPjIaHZg":{"text":"Um. Everything everyone else said. It's legit, it's write home about, it's fly here from f","useful":0,"cool":1},"XIm7KK79CE-3vme6OR57yQ":{"text":"This may be my new favorite restaurant (definitely is in New Orleans)....\n\nFirst night, I ","useful":3,"cool":0},"zQtbcKZhHyv2S7bH24npWg":{"text":"My husband and I had an amazing dining experience here. The food is outstanding--truly one","useful":0,"cool":0},"PZQrazxIrMA6BnkolLIhxA":{"text":"Great start; OK finish. The appetizers were superb - out of this world. We could have just","useful":0,"cool":0},"AUw_Xtz-c9lR5gAqtMMXzQ":{"text":"EVERYTHING IS AWESOME! This place was fantastic from beginning to end.\n\nLet me start by sa","useful":1,"cool":1},"jr8IfbDpusxdpeTMta-KVA":{"text":"After reading some reviews, we settled on this place last minute. Absolutely no regrets! S","useful":0,"cool":0},"20DOG2eaM53Ga06QGbeNHQ":{"text":"Had a great time! I had the quail as an appetizer, which was great, A Lil fatty but still ","useful":1,"cool":0},"pUfX5zvQI5aZXh2MA1tvGw":{"text":"It is restaurants like this that makes New Orleans great.  This is a small place that has ","useful":2,"cool":1},"FjVwW6XzAIMdoqa3wWVkCA":{"text":"FIRST the good news: everyone in our party of 8 liked their food, mind you, there was noth","useful":0,"cool":0},"ZcBeLZ-qZjem6zwfdjJPZg":{"text":"I was quite intrigued by this restaurant based upon the 5 star reviews and proximity to my","useful":0,"cool":0},"iSTFHlLTkttrCcQnhNrOvw":{"text":"Fantastic new restaurant in the WHD.  Service was excellent.  We had shrimp appetizer, gum","useful":2,"cool":1},"HA3JORUiwthGNMLKLsanyw":{"text":"Great food.  In a city known for amazing food, this restaurant is one of the best.  Must t","useful":0,"cool":0},"9I0MZ27sYEUZkG7mnzHvqA":{"text":"Rebirth was recommended to me by some friends who had eaten there the previous night. I ha","useful":0,"cool":0},"RUcBt1us2S3fhxvB-i6vvg":{"text":"So had dinner here one night. They make a vegetarian plate and I was pretty skeptical but ","useful":0,"cool":0},"_Dqc1Cq5HOtPbLqbhUxf5g":{"text":"Out of so many outstanding choices in New Orleans, this establishment is my absolute favor","useful":0,"cool":0},"N7a-lDIAqhshWA7aR0H6Ng":{"text":"My hubby and I had the concierge at our hotel make reservations for us at Rebirth. We were","useful":1,"cool":0},"pG93zT0qk-tmg56KlJZDyA":{"text":"So so good.  A mid sized restaurant that felt intimate and small.  Delicious food, attenti","useful":1,"cool":0},"4wLibbba2wYbDf_fGiwkwg":{"text":"A must when in NOLA!  They came highly recommend by the Marriott across the street where w","useful":3,"cool":1},"QoB2NX-2kQ0ZJMoCWJwhSg":{"text":"I tried the fish cake and there were un needed ingredients when I took a bite of it it fel","useful":0,"cool":0},"Drs9PXjUtZCcNV-P7cqETA":{"text":"Wonderful. Colleague and I visited for dinner after conference. Mint juleps were high qual","useful":0,"cool":0},"Z-VXJ2OQ1c6V06kXUDpi-g":{"text":"We had an amazing meal here last weekend. The pork chop and chicken dishes were standouts,","useful":0,"cool":0},"Xv18Wgr3aIOThlnPX7Dnnw":{"text":"Possibly the best meal I have ever had in my life. Found this place through yelp and a sho","useful":3,"cool":1},"vPW2nBm34_C8KOmtarZ62w":{"text":"The atmosphere is great BUT the food had enough salt on it to kill you.. salty bread.  Sal","useful":0,"cool":0},"Fg39eeB1wWlt0HlqTzHFQA":{"text":"We had Oysters & Angel hair, BBQ pork belly, quail la louisiane  and Gulf seafood. This is","useful":0,"cool":0},"-oZN5v6M_IGLWfBQCN3O4g":{"text":"We ate in a few big name restaurants while in town. Rebirth was recommended and we tried i","useful":0,"cool":0},"XVUn8-kgzwUvAoBYJZ-n-g":{"text":"Great service, great food! Our first meal in New Orleans and it did not disappoint. Have t","useful":0,"cool":0},"gGusQryO2pvpxtN5_h0nYg":{"text":"Excellent food and great prices. A new favorite in the city!!! Get the scallops. They are ","useful":0,"cool":0},"JBXY5kwktZG7F2Txalf_3g":{"text":"Last meal in New Orleans and it was MAJOR. This rustic gem hidden in the Warehouse distric","useful":1,"cool":0},"6aF4seRfqogV-0UDX9e7OQ":{"text":"I don't think 5 stars is enough for this restaurant! Everything about this new joint was p","useful":0,"cool":0},"09l_qnGpzMlHIdbgMBuS1A":{"text":"We went to Restaurant Rebirth on a Wednesday evening and the place was packed. Fortunately","useful":0,"cool":0},"RXzB-ZuFIJudtNcJs-cbrg":{"text":"Amazing!  Alone for trade show so just sat at bar.  The bartender Colleen was very nice an","useful":0,"cool":0},"SIu5LkplK-jUa3zbTpDOgA":{"text":"I would recommend this restaurant to anyone looking for a memorable dining experience. The","useful":2,"cool":0},"cJS1ml1pAeHa-GPNKcL5og":{"text":"The service is awesome and the owners are very one on one. The atmosphere is very inviting","useful":2,"cool":1},"fkSiNzOkhsXn7atTozh3Kw":{"text":"I happened upon this place walking back to my hotel from the convention center, and ended ","useful":0,"cool":0},"3SStDmCNJvHO3ae0PlpmHQ":{"text":"Enjoyed a delicious meal here last evening. The table was set for two and quite generous w","useful":0,"cool":0},"Ic7ieCOEKfQecUC-nZv9Vg":{"text":"I've been to the restaurant twice and both times had a wonderful dinner.  Excellent servic","useful":0,"cool":0},"fD9sXWlxjAD96JbIhwFSLw":{"text":"Easily the best place to eat in NOLA. It all starts with the wait staff, Joseppy was on th","useful":1,"cool":0},"7nydgZ7lp6T6faXyfW5vkA":{"text":"Restaurant Rebirth was a wonderful experience.  The waitstaff was excellent and the appeti","useful":0,"cool":0},"g2e_Uh1gvYNf9jTxdprMzw":{"text":"Reaaaly amazing and delicious fooooods, u have to try Mississippi Stye Pork Belly as an ap","useful":0,"cool":0},"0pEOEfjcFALNCqtkqMVtnA":{"text":"Amazing food and service! It's a small place, but the food was perfectly cooked and had a ","useful":0,"cool":0},"rxZunuXhE6TrsDhWHSjzZA":{"text":"Fine dining and great portions! For an appetizer I highly recommend the oysters and angel ","useful":0,"cool":0},"EyrZR_G9iFldx6GdpUIeVg":{"text":"Excellent food and service. Tip: Parking meters stop working at 7pm, so no need to pay aft","useful":1,"cool":0},"fwbNa9rA5SzlHw4TnmpxgQ":{"text":"Restaurant Rebirth is a newcomer to the dining scene is New Orleans and has been open a fe","useful":1,"cool":1},"1dYlJRRToVMnGI7hXLmHlA":{"text":"The cornbread was phenom!!!  Best I ever had.  Everything was delicious but I have to stre","useful":1,"cool":0},"8l2YEYzTfSEbtoap7anE5A":{"text":"Big portions, good selection of classic NOLA dishes, and nice atmosphere. Their double tom","useful":0,"cool":0},"Tw6oZPVFsvCiL77z-kWQaA":{"text":"Delicious and interesting dishes. I had the shrimp and eggplant, Fried in a ball which sur","useful":1,"cool":1},"lPGpiDlYK4xtSszJM-pG-g":{"text":"Don't believe the hype!\nI wrote an earlier review on this place and somehow they took it o","useful":1,"cool":0},"fMs0zH2L353Yv2kBg0eRtA":{"text":"The best meal I had in New Orleans and that is saying something. The pork appetizer was in","useful":0,"cool":0},"WsWoqosR8yAHrabVW1o6XQ":{"text":"Had the red grouper for the fish special. The greens were phenomenal and the fish was perf","useful":1,"cool":1},"kg31TsEqsMGiZ4OuxpnY2A":{"text":"I've been to some of the top restaurants in New Orleans including Commanders, Gw Finns, Mr","useful":0,"cool":0},"oSTgl5bPlBTyYHBMlcNUlQ":{"text":"Came in here for a prospect dinner with a reservation made in advance. The host who made t","useful":0,"cool":0},"FgPOXenaD-gm9BxULuUqwg":{"text":"The food at Rebirth was top notch. I definitely recommend the gumbo and blackened scallops","useful":2,"cool":2},"p6CuQV1-CfDwuXKFTO_3FQ":{"text":"Excellent food with perfect service. I highly recommend it!\nI loved the oyster and angel h","useful":0,"cool":0},"hW9wXkdI3IVzhglAF_I0jA":{"text":"Charming server Alex. Delicious food and beautiful presentation!  To die for grilled romai","useful":0,"cool":0},"ax70h99ap8bNt4TCOqLvAA":{"text":"Just wanted to specifically share how incredible our service from Neil was. He was so deli","useful":0,"cool":0},"2xabkRsT7J6XJJ3-Zw3-kg":{"text":"AMAZING!!!  We happened upon this place\nWhile in town for a convention and could not be ha","useful":3,"cool":1},"0hUONBHK69VSD233lJ0N0g":{"text":"A very good night! John and Mark took great care of my wife and I. My wife's poultry aller","useful":1,"cool":1},"hegWqJYE13OMewqN8YQbiA":{"text":"From the ambiance to the amazing food, it was perfect!!! Do yourself a favor and skip Bour","useful":0,"cool":0},"GVbiafg9EXNtXnuO2wny9w":{"text":"Life changing. That's how I would describe our experience. This place is so good I would a","useful":4,"cool":3},"ltdxWqkZYIJ75ZYIXsrvIw":{"text":"This meal we had in New Orleans! Recommends from a friend. The husband and I made reservat","useful":2,"cool":0},"Py0NWKUvZuoe5PwEEunAww":{"text":"Modern menu and rustic in the upcoming and surging Warehouse District of New Orleans.  Ver","useful":20,"cool":22},"JIAGa3B95t97_kwQWOQm1w":{"text":"In NOLA for a Saints game (they won btw) and had one night to eat dinner out. Picked Resta","useful":0,"cool":0},"v9oKKHUOvCupwV_ycqcITw":{"text":"I spend some time on the road taking clients out to dinner in different cities throughout ","useful":0,"cool":0},"rGFg00R4EVLerueKZpRkUQ":{"text":"THIS PLACE CHANGED MY LIFE!!!!! I came here on a business trip with a group of colleagues,","useful":1,"cool":0},"-X4EHKXiDvcjrsQoi72PIA":{"text":"Excellent! Dinner last night was wonderful. The wine selection is classy. The Menu was lav","useful":1,"cool":1},"CALnOJC-AkglSTu0f1eaiA":{"text":"Best place in NOLA to eat right now!!!\nThe food at Commanders Palace last night can't comp","useful":2,"cool":2},"eUMuArCkOP-DEk1twpcsDg":{"text":"Oh my goodness!! Amazing. Read some reviews about this place and decided to come give it a","useful":0,"cool":0},"jK2N_lUgun41gKb9XfaxjA":{"text":"Everything about this restaurant was 5 Star! Our waiter Alex was very knowledgeable and in","useful":0,"cool":0},"Hc7baIjjngOIeYdI-N4BqA":{"text":"Fabulous food, impeccable service! One of the, if not THE, best steaks I've ever had. Coll","useful":1,"cool":0},"ij2Mnn2NXRlxrkqYL9apPA":{"text":"This is a very new establishment which has room for growth. The service was friendly, the ","useful":2,"cool":1},"TL7ZhoIBSKALrFIRiFZdcw":{"text":"This is by far the best restaurant ever. We had the filet mignon tartar, gumbo, seafood bi","useful":1,"cool":0},"8Udc34hT82SLc9EokpVQVg":{"text":"My husband and I enjoyed an exceptional meal here last evening. The pork belly appetizer a","useful":0,"cool":0},"Dlp4cFK7339GSO-97fmkyQ":{"text":"Make sure you make a reservation!!! I went there with my boyfriend without a reservation s","useful":1,"cool":0},"xveCU6xhHJw6mW7Pb9amKA":{"text":"Everything about this restaurant was amazing. The service was top notch from the second we","useful":2,"cool":2},"teqIXn80uiZr7eL2xbAEvA":{"text":"Wow. A meal of a lifetime. We opened with the fried oysters over angel hair and practicall","useful":0,"cool":0},"tNT3T_5s0Zd6rsvztzNFag":{"text":"This place is absolutely perfect. I couldn't say enough good things about it. The waiter P","useful":1,"cool":0},"kh9V8qCaz7Uah6z4YhHAdg":{"text":"Best (new) find in many trips to NOLA. \n\nReservations recommended, as a party of 4 we happ","useful":2,"cool":0},"-ur7_jFoGyNqhmXrGw83gQ":{"text":"We ordered the 4 Bears wine which was a very smooth cab.  We ordered 2 apps.  Fried oyster","useful":2,"cool":0},"AcK1cDnE4M0fCr8cwqp7gw":{"text":"My husband and I came here strictly for the desert. I had the white chocolate bread puddin","useful":0,"cool":0},"kUs8FBOwrRNgQcaDkFW3ig":{"text":"Rebirth has been on my list of \"restaurants to try\" for a long time. It's a small place (t","useful":7,"cool":2},"wDuanZPQxf0WiWuFZq43OQ":{"text":"I had a wonderful dinner at Rebirth. Awesome service and over the top menue. I was the fir","useful":0,"cool":0},"j4b8maT_HhdHbNRAYP3NNQ":{"text":"Ate here last night after making a reservation the day before. We recently heard that loca","useful":0,"cool":0},"WG0InTrIM1Vt_dpmW4BTkg":{"text":"Went expecting to be disappointed with small servings, they weren't huge but fair size.\nSt","useful":0,"cool":0},"jiS4jtOqZcR9HUQLnf0jWg":{"text":"I went to RR when I was surprised with birthday reservations, and my first thought was how","useful":1,"cool":0},"HSmQlsTf9LcBYQBjZzfZbA":{"text":"I have to tell y'all a story! \nSo i checked into my new place took a MUCH needed nap and w","useful":1,"cool":1},"D4yBgiXLWrnPkdUZf-b-Jw":{"text":"Wonderful service. Great staff. Awesome food. This place has the ambience that is so wonde","useful":1,"cool":0},"9uEUumX1OfH508enlvjWdg":{"text":"Excellent menu, double cut pork chop was probably the best we've had.  The Fish special wa","useful":0,"cool":0},"pCMCxKMnD4YS5M03z7F3-g":{"text":"Thank goodness we got in without a reservation!! It was wonderful. Our server Collin was g","useful":1,"cool":0},"ow2hmcU7ArJK8mcu5Nrquw":{"text":"I celebrated my birthday at Restaurant Rebirth with two of my friends. By far the best mea","useful":0,"cool":0},"MNUEwxRkgFe_frzkgLVYAA":{"text":"My husband and I visited this restaurant last night June 12 for our Anniversary.  We had t","useful":0,"cool":0},"-q561qp4klw4nOBjl0c8eA":{"text":"Great food and ambience. Beautiful room - loved the photos of the Zulu Crew on the walls. ","useful":0,"cool":0},"aiTIZqVcn2MpnsUQz5tR5w":{"text":"The food was delicious and filling. The waiter was very knowledgeable and helpful in refer","useful":0,"cool":0},"I0y12cdl-sIHOlyeOEP9Ug":{"text":"By far the best meal I've had in New Orleans. I missed it last year to a scheduling confli","useful":0,"cool":0},"UP7pLEIQb5Za1RCCboZQXQ":{"text":"Very nice and something unique about it as well. The portions are huge- so bear it in mind","useful":0,"cool":0},"j9T1WeJnG0UG5dyqXrh6mw":{"text":"Nice petit restaurant with really nice atmosphere. All dishes were very detail orientated ","useful":0,"cool":0},"bjkXIbyc2Jdsidk2-sqkFQ":{"text":"Went here for a date night with my fiancé. The service was a bit slow at first as it took ","useful":0,"cool":0},"eMNvTxeP40DJwRNY-CdkbA":{"text":"Made reservation for the first time for my fiancé's birthday dinner. This little place did","useful":0,"cool":0},"kgG82Cbn3rPvwuQpxN_yHQ":{"text":"Date night for our first night in NOLA. I wanted to find something farm to table, small, q","useful":1,"cool":0},"XjPkEEzrVNSw5ooCQALhCA":{"text":"My husband and I made a special trip back to NOLA for his birthday specifically to eat at ","useful":0,"cool":0},"m72dHEFI7V8xaaFocXSgZg":{"text":"Service was amazing, food was amazing, and the waiters were pleasing both in personality a","useful":2,"cool":1},"aCHeSKLvpFbRYwzeEiCgYA":{"text":"Valentine's Day dinner, No reservations and still got a seat at the bar. Had cocktails, se","useful":1,"cool":1},"FixbTe826eNCchJLGy5EHw":{"text":"I chose this place for our first night in NOLA, just from the reviews here.  I got the por","useful":1,"cool":0},"PmCnrHWle9OwCwuIrPSl_w":{"text":"Awesome food. Eating here three times in three days. The project belly is to die for, the ","useful":1,"cool":0},"0xCtBguygb3231Sli8LGxQ":{"text":"What an amazing gem! All the wild reviews are absolutely correct, the food really is that ","useful":3,"cool":1},"joSvvlfSCBNahbndm4j1fQ":{"text":"We can't say enough about the food to do it justice.....just go.  Everything was awesome. ","useful":2,"cool":1},"vg72ySElTUCYdZsbNcUYiQ":{"text":"We ate at August's and I didn't think that anything could come close to that kind of perfe","useful":1,"cool":0},"VIjcPOeibiQ5u74fDm6CxQ":{"text":"A wonderful experience in every way.  Both the food and service were extraordinary.  Ate a","useful":0,"cool":0},"CDiAW2FOBFa0qNeMGGlGJg":{"text":"I wasn't sure what to expect when entering as the spot is tucked into Fulton St with a sma","useful":0,"cool":0},"CZu4bt1MFzOaSXOeoKXUaw":{"text":"Great restaurant with great food and service. Gumbo was wonderful along with my entree of ","useful":0,"cool":0},"-OZHzzskTo3Z7E2tNQaYWQ":{"text":"I absolutely loved this place.  The restaurant is casually elegant with brick walls and hi","useful":0,"cool":0},"tj3gWeJll_rzZgqQRmURCQ":{"text":"Shakey experience started with going in front door-duck if you are over 67 inches.  Gumbo ","useful":0,"cool":0},"SZIJgm5r4rhP1G7Hv6zZXg":{"text":"This place was amazing!  We were in town for business and came by for an evening dinner.  ","useful":0,"cool":0},"K3GRhDWLNcIoMAnk0wn98g":{"text":"First review I've ever written and this restaurant definitely deserves it. Food was amazin","useful":0,"cool":0},"FTSMDX4t-DyLRNRdUT0n-w":{"text":"Came here with the guys for a bachelor party dinner. Food and service was amazing. I had t","useful":1,"cool":0},"pNOocbsESFeJ2Lqjzlauug":{"text":"Really amazing place. If you want a perfect New Orleans restaurant experience, come to Reb","useful":0,"cool":0},"AIiQU-wQIMNX-MpQM7-aUg":{"text":"This place is accomodating and vibrant. \n\nMUST TRY!\n\nA real gem in the warehouse district ","useful":0,"cool":0},"J3vbjZ9lqvZ3gawBPFnqbw":{"text":"Just amazing. From drinks to soup to entree to dessert. Can't go wrong here. Put this on y","useful":1,"cool":2},"EzkmHGp-DtFbMKo5NWdCiA":{"text":"We went here for a 'fancy' dinner during our trip to New Orleans this week. Thankfully we ","useful":2,"cool":2},"-2-0sgMykEHtAiril9FX-w":{"text":"What an amazing experience!!  Jimmy, Manny and Chef made my birthday extra special!!  \n\nSt","useful":3,"cool":3},"81lH8071Vm5iZg3QOVI6CQ":{"text":"The Warehouse District is one of my favorite areas of the city, and this is my favorite re","useful":0,"cool":0},"xlepJMYf_lILhC5L-ulpPg":{"text":"THIS FOOD WAS AMAZING!!!! Pleaseeee try the gumbo! The fried oysters & angel hair pasta is","useful":0,"cool":0},"qRHt9dz7_YYeMntmm9v8Vg":{"text":"Fabulous meal even on a very busy night. Nice variety and excellent service. Loved the lig","useful":0,"cool":0},"tU1r0hWkxT1lngi07YIGvg":{"text":"Absolutely a must when you are in the area!! The food is fantastic! We had as starters the","useful":0,"cool":0},"Bbq0LYV5w8Z8Ve-gvoIVRg":{"text":"The proper lighting, artwork, music and space create confort an intimacy. You may also add","useful":0,"cool":0},"2WkHda2hf0pCCMlGcYoh3w":{"text":"Delightful place. Our waiter helped guide us through the menu with perfect recommendations","useful":0,"cool":0},"oksD-Q-21Q2LP3WCxNQdPw":{"text":"Absolutely great service and great food. The chef is mean with the steak as it was seasone","useful":0,"cool":0},"9W5LwJuza5ntROyc3_XR_g":{"text":"On my way to Meril I passed Rebirth and checked their menu, and decided to stay.  Rebirth ","useful":4,"cool":1},"73fpmPuWgGY2nwcGPmLSBg":{"text":"Manny and the staff made our business meeting for 8 memorable with great drinks, the Old F","useful":0,"cool":0},"pGjUVLPadZKnPtt9DCF7xw":{"text":"Truly an EXCEPTIONAL dining experience. Exquisite food, lovely interior and excellent staf","useful":1,"cool":0},"4g68f5KvY14lkLvxQVjIeA":{"text":"On our recent trip home, I was looking forward to trying out this new \"hot spot\" that has ","useful":5,"cool":4},"wZBJ7IOY6b3BfEacxuAHsg":{"text":"Excellent food and service. Tip: Parking meters stop working at 7pm, so no need to pay aft","useful":2,"cool":1},"agah3W88cNaBM1ybRhQDzw":{"text":"Great meal from start to finish. I had the Gumbo (highly recommended), a bone in filet, wi","useful":0,"cool":0},"92pTQP-bWy9tI3-tJGJ6tw":{"text":"Cute little place that has good service and food is off the hook. Cocktails were on the sp","useful":2,"cool":2},"2DteEX9Xi8WbGUzFEPRKeA":{"text":"So disappointed with the service and Food,definitely will not recommend. We were looking f","useful":0,"cool":0},"m4Ucv7AvK6zm9feQk3BDiQ":{"text":"Excellent food!! I am very picky eater and was not thrilled about going here but DAYUM!! A","useful":0,"cool":0},"QOvG5M5fa65d7eFeKVFhCg":{"text":"Good food, all our pics presented well and satisfied the palate. The restaurant needs help","useful":0,"cool":0},"rpBrkNZISJReAtgaKaFgfg":{"text":"Food was incredible. Waiter Justin was very professional and gave great customer service. ","useful":1,"cool":1},"Ihy05bGCUpikEw4btq5ABQ":{"text":"We are visiting New Orleans and wanted to try a new restaurant tonight.  We are in the war","useful":1,"cool":0},"I6Oa3Ai7QVdJ9kWf3TA4pQ":{"text":"This was my favorite time while we stayed New Orleans. Food had so much flavor and cooked ","useful":0,"cool":0},"9O1Nr89urx5heIcNCOu0kg":{"text":"Ate here with my husband while on vacation and it was our favorite place! We both ordered ","useful":0,"cool":0},"KMHexnGKmxou77UwoRqGVw":{"text":"I went here for my birthday with my mom and it was amazing. I'm definitely going back!! Es","useful":0,"cool":0},"LpVGcecxGxVVI8yS9gaMvg":{"text":"Unforgettable dinner in New Orleans! The pork belly appetizer and pork chop main entree we","useful":0,"cool":0},"igNPeUX7PPnPqihAPpDTAw":{"text":"We had a superb meal at this restaurant. Situated in a quiet street which I think was in t","useful":0,"cool":0},"oAS9EU7LLJIP5Fv8B8JBuQ":{"text":"Excellent food, drinks, atmosphere and service.   All meals were delicious but Ribeye was ","useful":0,"cool":0},"rnvn3iyNBnZStJybzauIAg":{"text":"We usually go to Jacque-Imos (still a \"must go\" don't get me wrong) when in New Orleans bu","useful":1,"cool":0},"LNcPN_hxHt54fsZ7pKnhQQ":{"text":"Incredible. Get the Speckled Trout entree and Oyster & Angel Hair pasta appetizer. If it's","useful":0,"cool":0},"qNdUJlveGP-HTInZC4zD7A":{"text":"The chef has some creative takes on southern cuisine that was extremely rich in flavor. Ev","useful":0,"cool":0},"_nMKFYz-BkmJmUUKAfdGdw":{"text":"By far the best meal I ever had in New Orleans.  It's a little away from the quarter but t","useful":2,"cool":0},"eEka4PoyNsTNXeW_4oP9kw":{"text":"This was an awesome meal. My steak was cook to perfection! I ate all of my husbands green ","useful":0,"cool":0},"e46ytW6ByJ2o-Z-1bsQ-2A":{"text":"Phenomenal restaurant. Best food we have had in New Orleans. The grilled Cesar salad was e","useful":2,"cool":1},"odHSroMZ9A9eL-ODfpzNSw":{"text":"Restaurant Rebirth was a fast favorite. Not only do I love the name, but I loved the vibe ","useful":7,"cool":7},"Sti3WVVSnh1nQuuN9a2UYg":{"text":"Was there a few weeks back and while it was a good 10-15 Uber from our hotel it was well w","useful":0,"cool":0},"gIojts_N9YGtQMAB-VgKLg":{"text":"New Orleans is loaded with great restaurants but I think this was my all time favorite.  I","useful":0,"cool":0},"_RDoBTBu8ZZfK2akM07Qfg":{"text":"We made the mistake of coming in for dinner without a reservation on a night when there wa","useful":2,"cool":2},"QYxtsc-KGhL3EofWn5cwkA":{"text":"This place was amazing!  Loved everything from the drinks thru to desert! Our service from","useful":0,"cool":0},"Nwi68Wr24MXueDNUSqH00A":{"text":"Everything in this place is delicious. However, if I had to recommend a dish, get the Miss","useful":2,"cool":1},"i3NmVAV7GdFrJ2CNsILolQ":{"text":"Best meal during our binge-eating weekend. \n\nThe gumbo was phenomenal. It was somewhat uni","useful":2,"cool":0},"9dtx1U0s_mAkvqnhz9cTQw":{"text":"Wow!  Great gumbo, redfush,  and the crawfish tasso  is absolutely AMAZING!  Extremely fri","useful":1,"cool":1},"stZC1qBM0AtvoXF_XwmdhQ":{"text":"Such a nice experience! Friendly, warm and competent service. Deliciously prepared interes","useful":0,"cool":0},"4fCxPC29L_YfFpwxw3VI1A":{"text":"OMGOSH.. words cannot describe how good the food is at Restaurant Rebirth. Everything was ","useful":11,"cool":5},"wxWQl6DHn-_J6b6uXxHOYQ":{"text":"Amazing!! Everything is fresh and delicious! This is a small, intimate dining experience. ","useful":2,"cool":1},"8UaUxHpXeIwiPHg1Tuwxuw":{"text":"We were visiting NOLA and celebrating a friends birthday, my friends go to NOLA every year","useful":0,"cool":0},"oM9afUF4PoWVExkT-3gDTg":{"text":"We decided to check-out this restaurant our first night in New Orleans because it had such","useful":0,"cool":0},"FmmL7olXOpwpFwXeiqappg":{"text":"If your in New Orleans and looking for food outside of the usual fried seafood and gumbo y","useful":3,"cool":3},"DhZ7pHgvOG_G6Q7J0D6AEQ":{"text":"This restaurant is located on a nice street! Hard to find a parking spot. Is better to tak","useful":0,"cool":0},"N_4pL5sP-rU1UxpaqKgVfg":{"text":"This place is just plain fabulous.  Best pork chop I ever had..ever!  Waiter very knowledg","useful":0,"cool":0},"20lPGbdj2IiJAS4LdxHisw":{"text":"AMAZING!!!!! I can't begin to describe how delicious every single bite was. I had my engag","useful":1,"cool":2},"A1cESa9NLdeEMJYbY87D-Q":{"text":"This is where my wife and I celebrated the first night of our honeymoon. It had to be one ","useful":0,"cool":0},"bvegc2XsS55IlIoKApLKng":{"text":"Due to the reviews, we were excited to try RR. The ambiance was lovely and our server thor","useful":0,"cool":0},"JHIMVkXZbMOz5JSZ3psSRg":{"text":"Weird name, but great food and service.  Definitely worth checking out.  Nice quiet place ","useful":1,"cool":1},"phj4kHPfoBPBY-klDbGpYA":{"text":"The ambiance of the restaurant is very nice and the appetizers were exceptional (try the Q","useful":1,"cool":0},"2YEfngkQlpNo7s1sPP59sQ":{"text":"Okay - i picked this place because I believe in the power of social proof. And when over a","useful":4,"cool":1},"8YYsuejS5l1iU4Hs_cNDKw":{"text":"This is a hidden wonder.  We had just finished a convention and was looking for somewhere ","useful":0,"cool":0},"nA7KDNstokIoA32M9tcPOQ":{"text":"Hit my head on the doorway arriving and leaving this place. Even if you include the bump(s","useful":0,"cool":0},"crUaKYnt-YTUntMQT_8N8Q":{"text":"As I will suggest in most of my reviews, the person serving or hosting can make the differ","useful":1,"cool":1},"mrOqRGB1MuzlRxsvtyWmSA":{"text":"We sat at the bar because they said they were booked when only two tables were being used.","useful":0,"cool":0},"c24u_6vElhzdja-jo8tTpQ":{"text":"amazing service, the blackened lamb was amazing. everything we had was superb. the appetiz","useful":0,"cool":0},"lU2bWSrYlqc-DI0oUKY2vA":{"text":"Great waiter and food was good. The restaurant itself was hot and humid. Nets flew around ","useful":1,"cool":0},"sNYnzjddSNLIKZn9P9roSw":{"text":"My boyfriend and I enjoyed a great meal yesterday while sitting at the bar. The staff was ","useful":0,"cool":0},"XKCcbO0zgrEcrgW0Uo4Yzg":{"text":"Great food and service. You must make a reservation or you won't get in during busy season","useful":0,"cool":0},"JyCLU61FBeqTEWvuCAOWZg":{"text":"Ate here for dinner here this week with some visiting friends and was greeted with a frien","useful":0,"cool":0},"8-NbUfsWCnTCR5IH_ImgYg":{"text":"Great service, cool atmosphere. Small place. The two of us walked right in on a Wednesday ","useful":1,"cool":0},"9XSO7CtakueBgu_3h6Nb7g":{"text":"Wow! Wow! Wowza! So much flavor packed into these delicious dishes. Wonderful service, war","useful":0,"cool":0},"Bbi2hGZTg2YQBqpqsi6Wdg":{"text":"This restaurant is now in my top three in New Orleans. I had read about it for while and i","useful":3,"cool":0},"0fub6PQ5u1iDvOPuReGfMQ":{"text":"What a GEM!!!\n\nWe stayed in New Orleans for 5 days and agreed to try a different place to ","useful":3,"cool":2},"bPjaILy_pMDnM4EJtWU4kQ":{"text":"Food was very good. Appetizers and main courses were excellent - tenderloin was an excelle","useful":0,"cool":0},"rUw705V4no6VCIsXbnv2dA":{"text":"Small place but finally got to eat here. Appetizers Ordered the duck foie gras boudin, yea","useful":1,"cool":0},"tIHgxGTtiFK6BVaIpNGanQ":{"text":"GW Finn's has been my favorite restaurant to date in New Orleans. Well. Our daughter took ","useful":1,"cool":0},"MNBPIGrXdAFHIWgTOAZeDA":{"text":"Gumbo: delicious. Pork chop: delicious. Catch of the day: delicious. Shrimp and eggplant: ","useful":0,"cool":0},"2lfGOj0mCl3jChtzqEl22Q":{"text":"This is one of my favorite NOLA restaurants. They never disappoint. The food is amazing. S","useful":0,"cool":1},"nsajk5Pv_R39IaPTF88R5g":{"text":"The food was ok and the service was good. The steak was salty, I told my husband to send i","useful":0,"cool":0},"taPaCxX2pMWinQX46CkEzA":{"text":"Excellent location, great service and great food.  The farmhouse salad was outstanding, it","useful":0,"cool":0},"w_i2GIizP1eIBR9CH2DJdg":{"text":"This place has been on my list for a while. Finally for my birthday I decided it was time.","useful":2,"cool":1},"ZlIbSC5eI-qar5HnLfXEsQ":{"text":"Excellent service and wonderful food!\n\nUpon seeing so many wonderful reviews for Restauran","useful":1,"cool":0},"KS8wTW3n_FN-C_H2Elp-Fg":{"text":"Excellent food despite a \"first world problems\" family dispute that occurred at the table ","useful":0,"cool":0},"rEU6TaILEaRnW_biz6gSIA":{"text":"This is my favorite restaurant in all of New Orleans. Starts with the Pork belly and end w","useful":0,"cool":0},"tNd0B_vNT-lg4BaqQ-5xbQ":{"text":"I went here a 2nd time because my sister and I were so please with our last meal when we w","useful":0,"cool":0},"ZLS1UXFN-JKb6-L-4KBX4w":{"text":"I have found my new favorite restaurant. The atmosphere was warm and cozy. Intimate withou","useful":15,"cool":7},"sBaKA6gwgbc4wkKwOxJD_g":{"text":"Hidden gem! What a great night to explore.... customer service...10 Colleen was amazing at","useful":0,"cool":1},"VrQUDSXRItZGZsr8gdxZOA":{"text":"Rebirth was my introduction to New Orleans and it did not disappoint at all. I love the in","useful":0,"cool":0},"6W5iNgSuWdXnAdu8lsJ9jg":{"text":"Concept\nFarm to table.  Fresh seasonal ingredients that may run out over the night.\n\nAmbia","useful":4,"cool":1},"RImrChWebldzG5SCapKplg":{"text":"My friend recommended this place so I was super excited to try their creole cuisine. They ","useful":0,"cool":0},"rNIA2Bok8zVqts1s9Sp3ig":{"text":"This is a wonderful creole restaurant, awesome service, great experience, and food was gre","useful":1,"cool":0},"Q3kTfiDfFQKMDAJ-cezqrg":{"text":"Very good food excellent service by Jacamo!\nWe love NOLA!\nThank you for the food porn comm","useful":0,"cool":0},"AeakcWUlp9_yL7qC5N8hGQ":{"text":"This place!!!\n\nOf all the restaurants in all New Orleans and all the country, this place !","useful":0,"cool":0},"-IZOEK0gU_2lTquE_SX6-w":{"text":"Oh my Gosh! An awesome dinner!  I knew it was rated top ten on both Google and Yelp, and I","useful":1,"cool":0},"oMZoWFZDyblvfXHwXGyqjg":{"text":"We went for my friends birthday and enjoyed our meals. We had the shrimp and eggplant and ","useful":0,"cool":0},"qZzE7QqkrEleKCWMs9Al0A":{"text":"You literally can't go wrong with anything on the menu. The 22 oz porkchop was amazing, th","useful":0,"cool":0},"c-aEBJZuTl9qn3imkYKHrg":{"text":"Last dinner in NOLA.  \n\nGrilled Romaine & Fried Oysters- \nGrilled Romaine hearts and cornm","useful":4,"cool":1},"Fdq_gsaoaIW2O77jo8RkLg":{"text":"We had the bbq pork belly, duck and pork chop. Everything was amazing! The pork chop was o","useful":0,"cool":0},"pYu7uzFFw5Qhc6bN85bX8Q":{"text":"Oh my! You must go here! Men-don't let the name keep u away!! On a recent business trip to","useful":0,"cool":0},"ebSO1UVgRwnYzYnrlLTS7w":{"text":"So many great things to say about this place.  We had such a pleasant experience, the food","useful":0,"cool":0},"O3L_sWe752MpzS9S7TNTyg":{"text":"We went here after having a bad experience at Herbsaint, and it totally turned our night a","useful":1,"cool":0},"rVlWizsvFwZ1s62xY8A28A":{"text":"Everything I've ever eaten here has been uniformly excellent, and they have what is hands-","useful":0,"cool":0},"Yq_Pt-e1QMndxEuNrt-qdA":{"text":"This place... Where do I start?\n\nI'm really not sure how I've not heard more about this lo","useful":12,"cool":6},"4lRwy2sShbWWe3cJXZPKZQ":{"text":"I wish I dined here on all of my previous trips to Austin. Amazing food and the wine selec","useful":0,"cool":0},"l9KONeoVNCwexWOe4QaH7g":{"text":"This is probably in my top five restaurants of all time. It was a wonderful experience fro","useful":0,"cool":0},"Xb-Eoxqzyoe4PYTwmvQskg":{"text":"I don't give out a lot of 5 stars but this place earned it! Fantastic meal and excellent s","useful":3,"cool":0},"lqy-hTQ4uYHqJo0u4T2Ukg":{"text":"Got the sea scallops, $33 for 3 scallops (market price) don't like being ripped off so I w","useful":0,"cool":0},"lTsZOSdrwtWhRyowd-D8WA":{"text":"Had a business dinner there on April 10. Service and food were excellent, wine list was ni","useful":0,"cool":0},"bWQqVkZZv5k86uPe8l4PBg":{"text":"Really good food. I give it actually 3.5 stars. The ambience however doesn't match the pri","useful":0,"cool":0},"FmOyeAbfrfQN7ICPntAM2w":{"text":"Mon dieu! Who woulda thought food could be so good. I mean, I've had fantasticmemorableinc","useful":4,"cool":0},"4erdRKFpN9CiNtlohsNO0w":{"text":"We had a wonderful experience at Restaurant Rebirth. Some of the dishes tasted like family","useful":1,"cool":0},"qclV9eCk0lCgKshM7qSV6Q":{"text":"This is THE best restaurant in NOLA - BY FAR. Most foods are cooked from.scratch so yes yo","useful":1,"cool":0},"GQ-Ba_R_dshxWohHJKDGMQ":{"text":"Absolutely wonderful! \nGreat drinks, and the food was outstanding! \nThe pork chop is liter","useful":0,"cool":0},"jLeBc12wpstBT01Gc5WRqA":{"text":"Love this place. The service and food are spectacular. I brought a group of 5 with me and ","useful":0,"cool":0},"C6kSEWDIlRnG4oZBvkqPOg":{"text":"Food was MINDBLOWING!! Weird way to describe food but this food will go down in my memory ","useful":0,"cool":0},"GQgSKzs0SeZGY6Cy9EhLRw":{"text":"Amazing food & awesome service. My boyfriend and I never can decide on a wine we'll both l","useful":0,"cool":0},"ok7Kgm99yGsC_llBLniu9w":{"text":"Great food! I ate here with my family. Cajun infused Modern American cuisine. Inventive me","useful":0,"cool":0},"GBmO8LLtx0hoyfw6GWbu9g":{"text":"Of the \"contemporary\" Cajun/Creole options in New Orleans, Rebirth is definitely at the to","useful":0,"cool":0},"8WUccHhnoGrq7Q2mdS4TVg":{"text":"I went to Restaurant Rebirth for date night with my girlfriend on a coworker's recommendat","useful":0,"cool":0},"bd2uio6Dv61b82IwU385JA":{"text":"Great service and food. I was really surprised by how delicious the food and desert was. \n","useful":1,"cool":0},"dVK9cFhW0WOHcSgha1tzQw":{"text":"I always attempt to try a new place every trip to NOLA. It's hard to get away from my favo","useful":4,"cool":2},"1YN8m9Mf3yTt57KhaYbNOQ":{"text":"We were quite excited to go to this restaurant prior to arrival. Unfortunately it did not ","useful":0,"cool":0},"BfTfL6ltYy-o_sKq698cZA":{"text":"Small quaint restaurant located in the warehouse district. Good service. Good food. Got do","useful":0,"cool":0},"BAwBLBoZD1Aav8rEmR7NFQ":{"text":"Probably one of my best meals on planet earth.  No joke.  The chicken and okra gumbo was s","useful":1,"cool":0},"r5u4bNm0Y2FioMUoBE31PQ":{"text":"Discovered this place on our first trip to NOLA. The bar was set so high on our first nigh","useful":0,"cool":0},"idWXOTmt5PHYgqTad0Feig":{"text":"Seemed like a delicious foodie place and boy did it deliver. We sat at the bar and had del","useful":1,"cool":0},"WHh3A-0OeHlsPC48nyxUxw":{"text":"We discovered this restaurant in 2017 just by following prior yelp reviews so we tried it ","useful":0,"cool":0},"5LhAxbQO-F882htUNt2Xrg":{"text":"Bison on the menu..... whaaaat. Perfectly seared, pork belly melted to perfection. Can't d","useful":1,"cool":0},"AfEtGyfz6HUtf5KFJFX0NQ":{"text":"Great experience, great atmosphere, great service, and the food was delicious. The bacon a","useful":0,"cool":0},"87jMVvZWbiW8AiFgjck_aA":{"text":"This is probably one of my favorite restaurants in town. With only 12 tables in the entire","useful":1,"cool":0},"qIh11Ui3OknlrtpgdhBveg":{"text":"Went down to the CBD on a Saturday night, looking forward to a good meal.  We're locals, a","useful":6,"cool":4},"R6S0uFHKKt_94yBOLUEN9Q":{"text":"If you're tired of the same all touristy restaurants head to Rebirth.  Friends of ours who","useful":1,"cool":1},"xdUM7KziszcL-PYhZe_mKg":{"text":"Items Selected:\nMolasses Cornbread\nOysters & Angel Hair - Crispy fried Louisiana oysters, ","useful":13,"cool":8},"su4a0N5fUqyatiHsE65XOQ":{"text":"Maybe I ordered the wrong items.... The food was good, but not outstanding. Especially for","useful":3,"cool":0},"STOUifWUw6oTYJkWi9up-A":{"text":"I ask for RARE waygu steak. Got medium well...that's just a sin. It's the easiest thing to","useful":0,"cool":0},"n9Rr9MhaQiqMblpSAwcz9g":{"text":"During one of our stays in NOLA we did a fancy date night here at Rebirth and wow oh wow t","useful":4,"cool":3},"abTGEPR0tkIvx1IyHsA52A":{"text":"Excellent, superb.  From \"hello\" to \"thank you for dining with us.\"  Make a reservation an","useful":3,"cool":1},"aMKPzdHO6uhHBO4iLx3Rtg":{"text":"The food was out of this world! From the Amus bouche to the Eggplant Wrapped Shrimp we wer","useful":0,"cool":0},"xuM1-xWdvX-qlGp63vw4wA":{"text":"Amazing dinner.  We started with he pork belly which is not to be missed. 12+ hours in the","useful":3,"cool":2},"zhkCEyfzO9WMwIMMI6adNg":{"text":"We were in NOLA for a work conference and came to Rebirth because it was close to our hote","useful":0,"cool":0},"a8n37g7iGNknGSeG3LIb2w":{"text":"The food here was amazing! And we ate there in the middle of a tropical storm.","useful":1,"cool":0},"kIVWkvaZnGTBmMMWbjrJWA":{"text":"Kind of bumped into this restaurant. Was recommended by Marriott across the street,\nAnyway","useful":0,"cool":0},"-MP_cUj4fiH0mVRJFNi6VA":{"text":"Maybe I should have been an ugly Cougar in a tight fitting dress because the table of two ","useful":10,"cool":0},"rw-ljTgsYmbsOpGuXJVYqg":{"text":"Yesssss! Definitely make a reservation! Cozy vibe and perfect service. The bar drinks were","useful":0,"cool":0},"51pCBYRZuJMW6whlHom4Ow":{"text":"Maybe the best Filet Mignon I have ever had. Tasty fingerling potatoes. The wait was 1 1/2","useful":0,"cool":0},"pyQRlC8_0T1iyTl2L9OxgA":{"text":"This is probably in my top five restaurants of all time. It was a wonderful experience fro","useful":2,"cool":0},"O0GM-j83svFCwzUvAHjt2Q":{"text":"Local feel away from the craziness yet just blocks away from it all. After being to New Or","useful":8,"cool":5},"que1W3pWQfB0bz2mJiMFzQ":{"text":"The place is so good! Service was also second to none! We had a pork belly appetizer, seaf","useful":0,"cool":0},"wToy6QgGbSCiy14daiPl1Q":{"text":"We came to Restaurant Rebirth for my friends 32 birthday and it was nothing short of fabul","useful":1,"cool":0},"ovp5s67lvCqW6CHqZsEpbw":{"text":"WOW! I researched the best New Orleans restaurant possible for a special birthday dinner a","useful":0,"cool":0},"hxHFMNrWV_i8enOKaLXpTw":{"text":"This place provides you with AMAZING CUSTOMER SERVICE. I came in to celebrate my anniversa","useful":0,"cool":0},"TL3sHcSjtqz8g7LRJjFDHw":{"text":"I did everything I could not to lick every plate they served me clean!!! Everything was be","useful":0,"cool":0},"dx7gFfw4ioUg8UHaZiEH7Q":{"text":"Honestly, after reading so many great reviews I was so disappointed with our visit. Once w","useful":0,"cool":0},"H9Ge0sDjIRcrdhNLNNmOFg":{"text":"Unbelievable  , everything was amazing, I had oysters and angel hair pasta, my family had ","useful":0,"cool":0},"IWk9IU93qF1XE3RUudlPnA":{"text":"If I could give 10 stars I would!  The food, the drinks, the service, everything was top n","useful":0,"cool":0},"NjwZtDV7PRweuUARNEAmfw":{"text":"During our recent weekend in New Orleans, Yelp reviews led us to discover this new \"farm-t","useful":4,"cool":3},"W2eE6vGbYefLRYoY2wUc6g":{"text":"This place is quaint, cozy, and the food is delicious. To top that off the staff is UNBELI","useful":1,"cool":0},"ga3k33UNOSdE_PSoabcxKw":{"text":"Decided to come here for a Valentine's Day dinner with my wife.\n\nAmbiance**\nThe ambiance w","useful":1,"cool":0},"vkSxFxcZ9lKQL4S6tZ3v5g":{"text":"First time and definitely no the last although the 10 1/2 hr. flight from Honolulu is exha","useful":1,"cool":1},"7hWqFIguoFP0ihxfvWLkQw":{"text":"We absolutely love this place. We come here every time we are in town from Texas. The staf","useful":1,"cool":0},"8Uk71CN6_q201GFkMmhgiQ":{"text":"I have been afforded the opportunity to retire at an early age.  One of the things I enjoy","useful":5,"cool":1},"oTbvfgdkL8pFOaDp0j-aOA":{"text":"First Class Stuff\n\nThis place is amazing. Food presentation, service, atmosphere all very ","useful":1,"cool":0},"k-J9xaj1pHgGUZY5viIQAA":{"text":"We came here for NYE & it was a prix fix menu and it was absolutely incredible. Each dish ","useful":0,"cool":0},"FPHgIt_eZ7r9S_JdZYjw9Q":{"text":"Back in February we visited Rebirth for the 2nd time and were just as delighted as we had ","useful":7,"cool":5},"1rw7vvS57JQR8hDGDX9_Ng":{"text":"My husband and I made our reservations months ago and were expectant for our dinner last n","useful":3,"cool":1},"QsSjXkwbb10Oq3xkcBHOEQ":{"text":"Went here last week and had a great meal! I liked that the place was small, quaint and fri","useful":0,"cool":0},"9a_Lyjtdr7S6bDA2s96SoA":{"text":"I had the mahi catch of the day with some fancy green stuff and sauce I can't pronounce. I","useful":0,"cool":0},"oofs-JMNrN2WYdHx1L1RBQ":{"text":"I was really looking forward to trying Restaurant Rebirth, and so very disappointed with h","useful":1,"cool":0},"vgQ6QgfzX0uqzHnUldowBA":{"text":"Outstanding, exceptional restaurant. My family and I just returned from a 4-day stay in NO","useful":2,"cool":0},"Nr9YwDUG6Beyr-uMPvOrIw":{"text":"On my way to Meril I passed Rebirth and checked their menu, and decided to stay.  Rebirth ","useful":3,"cool":1},"AxIQjUmm0vguafi2DU8ukw":{"text":"My husband daughter and I ate here this evening. Our server Alex T. was awesome. He was ve","useful":0,"cool":1},"QIrC9spIVuMmFeTiWTdNtw":{"text":"The food was amazing the drinks were so good this is the best tasting food in the city","useful":0,"cool":0},"3zOmVMG_K_Pppdn08kPrbQ":{"text":"This is truly a great restaurant for New Orleans, as the gumbo is delicious, the use of fr","useful":0,"cool":0},"qX1bJMcsM9E7-L_vGbvY5g":{"text":"I had the blackened scallops which were perfectly seared and taste amazing !! Would highly","useful":0,"cool":0},"SfqeIIbELs-nIl6T4q8pVQ":{"text":"Amazing food, ambience and service. The chowder and gumbo were amazing and the attention g","useful":0,"cool":0},"1G5kaFVza1onhTD_A3zxSA":{"text":"WOW WOW WOW. Where to even begin. I came for my birthday, and they went above and beyond. ","useful":0,"cool":0},"G__2urZoczmANLOJvD1Ylg":{"text":"I started with a chocolate martini which had a nice hint of mint,  it was perfect.   The p","useful":4,"cool":2},"A049f8amrCHBJmejUkK7HA":{"text":"Best meal in New Orleans!! Eggplant wrapped shrimp and pork chop were amazing. Highly reco","useful":1,"cool":1},"zVnqakNKlfpw7neNQrHKCg":{"text":"Amazing!! Dined here for a bachelor party and we were very impressed.  Every entree was ex","useful":0,"cool":0},"qVnihXUWwVBMdDGHI1Uiag":{"text":"A gem. Stumbled across this place and had been wanting to try it out for forever. Very low","useful":0,"cool":0},"nyNVTuMAS722ae-31wZxvQ":{"text":"Excellent meal - our best in NOLA, by far. Atmosphere, service, both on point. Food terrif","useful":0,"cool":0},"Hzt2ok7k6E0Zst7Vb9BxnA":{"text":"everything was amazing..from the service, drinks, and every single entree on the menu. Wow","useful":1,"cool":0},"luRi0FSoMW76c144EH1blw":{"text":"I want to focus on the gluten free aspect since there are a lot of us GF who rely on yelp ","useful":0,"cool":0},"cz1kPgoFiMSatlTFMs5yLQ":{"text":"Ahhh...Hubby, baby (on her birthday no less) came here for dinner and LOVED it. Started of","useful":1,"cool":0},"LMn0C6PiMFTtwD8Eam4stA":{"text":"Great atmosphere, great hand crafted cocktails, awesome waitstaff and phenomenal cuisine!","useful":0,"cool":0},"wbsVQtpNGfa8ec9y2y4gFw":{"text":"We came into town and our first meal was here at Rebirth and no meal -I repeat - no meal w","useful":3,"cool":1},"FP9FB3IGWoA5StVo-kBsHw":{"text":"I encourage you to have a feast at Rebirth! When we went to Rebirth it had just opened up.","useful":5,"cool":3},"hi55QadIzmofBE5H-uBUsA":{"text":"Charming restaurant in the warehouse district. Absolutely delicious food, drinks and great","useful":1,"cool":0},"wSvpkwGOYE9pFZXQLMSnvw":{"text":"This restaurant in the warehouse district is well worth the hike/Lyft from the French Quar","useful":0,"cool":0},"QOPk5QoWoLLuKj3cV052lA":{"text":"This was such a wonderful experience, I absolutely loved it, the food was amazing the empl","useful":0,"cool":0},"xBB4IiGHkNrC_9tWXaNvkw":{"text":"On our second day in New Orleans, we came to Restaurant Rebirth for dinner. We hadn't had ","useful":0,"cool":0},"bpLvSybQoM5qtVfspNhjew":{"text":"I had a wonderful experience at Restaurant Rebirth! It's a small establishment so sitting ","useful":4,"cool":0},"be9vHXAH61c5_Vt7ocDVuw":{"text":"Very nice ambiance. The bartender was very nice and attentive. I ordered the Oysters over ","useful":1,"cool":0},"1Q45fSmjyDq9cGIsfj7yPA":{"text":"My wife and I are foodies and have been coming to NOLA every 6-8 weeks the past 15 years T","useful":1,"cool":0},"J0x-yl4KZsF3vI-y9jLigQ":{"text":"Lousy Management! Yelp states no reservations. We arrived and they said \"do you have a res","useful":0,"cool":0},"LCamW_vVHaqvigF30QG9yw":{"text":"With so many excellent restaurants in New Orleans it's difficult to par down the list of m","useful":5,"cool":4},"eIpL16hOArwPh4gbMmt8zg":{"text":"I have to start by saying that my husband & I eat out and travel a lot.  It's our thing.  ","useful":2,"cool":1},"qE17pNxri8X2K56xV3KQxQ":{"text":"We ate here during Voodoo Fest weekend and it was incredible! For starters we shared the b","useful":2,"cool":2},"5J3gFg_opig6smeaadnXAA":{"text":"Jesus Christ. The Chef needs his/her accolades. Every single thing was perfection. We had ","useful":0,"cool":0},"_QCH29mJgZe2i4v5-qbnHQ":{"text":"Food was good, but service wasn't the best. It is what will keep me from coming here again","useful":2,"cool":0},"biO6QZjSgm_dGcUbCgy8BQ":{"text":"From its fun, elegant vibe, to the modern magic of its evolved creole and Cajun cuisine, R","useful":8,"cool":6},"49Uj9_avtWehyz2IMHip2w":{"text":"We ate here on 3/29/16 and the food and the service were awesome!  The rich pork belly app","useful":0,"cool":0},"FErzyJYfQ5kvbOc3Cpz4vw":{"text":"My daughter and I went to Mardi Gras last week and had dinner here Wed night following Mar","useful":0,"cool":0},"VBVqUGqh8cpyRkh3Emhvdg":{"text":"Always a great experience at Rebirth.  Food and service are always amazing.  Highly recomm","useful":0,"cool":0},"Yg0h4enVPFpTVNcHmgL12Q":{"text":"I go here every year when I visit - one of the great new orleans meals - they make a divin","useful":0,"cool":0},"nIul0Xmguog0CSW0jzPfWg":{"text":"This was hands down the best pork chop I ever had!!! We actually stumbled across this gem ","useful":2,"cool":1},"ZHfsg_miubvFrhB5VOdesw":{"text":"So happy I was able to walk in early and have dinner!  This place is tiny but mighty.  Sat","useful":2,"cool":1},"XiYbUo-WqtR_2D0QWd7mjw":{"text":"Make a reservation, this place is tiny. Like teeny tiny. No you probably won't be able to ","useful":0,"cool":0},"rZYyEdx7z5G7-bpqHgyi5g":{"text":"The waiter is super friendly and accommodating. Very nice fine dininG place for couple or ","useful":0,"cool":1},"hNe2Dv76PHc9NR3erZQCSw":{"text":"One of our go to dinner spots when we visit. We miss this place since we moved away and we","useful":0,"cool":0},"f9PjDkvwos3TkNxYxuSDJQ":{"text":"Top 5 restaurant in NOLA. COVID has forced them to pare down their menu, but all that does","useful":1,"cool":1},"zFUpbDx8W9BVGEwyh78KPA":{"text":"Amazing food, great service, and good drinks. The only issue we came across, and were some","useful":1,"cool":1},"rmpERRFLKx6GomopjTACHQ":{"text":"My husband and I got to get away for a few days and made reservations here because of the ","useful":0,"cool":0},"AhDJYzG9JyIVbeP7oAp0QA":{"text":"Fantastic!!!\nAppetizers were so great! Had the pork belly and also had the shrimp & eggpla","useful":2,"cool":0},"_PyRRPVYccOr-WxW0P6KVA":{"text":"Hidden gem.  Out of several enjoyable dining experiences I had in NOLA, this was my favori","useful":2,"cool":0},"rPVs_qDiToTS6kEGvgnx9w":{"text":"With soooo many ppl telling me how incredible the cuisine in NOLA was... I found it a litt","useful":0,"cool":2},"MV8_mLG1sziZ2t41iyCVdg":{"text":"I don't usually eat pork chops but this place redefines pork chops!! It was so massive, ju","useful":0,"cool":0},"mnZfo1QtXn8PqVbVk5fOXg":{"text":"I ate here two nights in a row. The first night I had the Pork Belly and the Filet Mignon ","useful":0,"cool":0},"w7o5sNAHZAVKE9zxFkGefw":{"text":"All my friends including me were exhausted after a marathon conference in New Orleans. We ","useful":2,"cool":2},"-9OFKl9TOUs_VB9DFsu9wA":{"text":"Just a lovely, wonderful experience-\nGalliano is my al time fave and someone tipped me tha","useful":2,"cool":1},"kXgFEfHPqCsUiqrXyqbsqw":{"text":"Food was delicious! My wife and i enjoyed it very much despite having to lug two kids arou","useful":0,"cool":0},"wnkaDF0-rFse3zWbTTV84Q":{"text":"This place is exceptional. I went on a Saturday evening. You have to make a reservation be","useful":2,"cool":3},"BucyHqKNZDMoz8g-yC9gfg":{"text":"The waiter is super friendly and accommodating. Very nice fine dininG place for couple or ","useful":0,"cool":0},"ck1ofLuoTqAE0VB1TqWFdg":{"text":"EVERYTHING was spectacular! Cozy atmosphere, great music! I nearly ordered extra Gumbo TO ","useful":0,"cool":0},"pbVXowAQINqTN8TWoTD8Hg":{"text":"this is a must try! everything from the food and service was great. if you are looking for","useful":0,"cool":0},"LoxZTHhQurV5M1dZm8E6GA":{"text":"Seriously good food all around.  After a whole lot of great seafood in New Orleans, a good","useful":0,"cool":0},"QHYO_LUDEeZXR2WhE5jLOQ":{"text":"After Hurricane Ida, life became a little hectic. Between school, work, scrambling for foo","useful":1,"cool":1},"DrqpaBlTWt5FX-KoZ1NwaA":{"text":"We have driven up this restaurant a few times in the past and wish out if this few times I","useful":3,"cool":3},"-Jsm3vzLdQ_w8PGyA7EGQA":{"text":"Food was good, the dinning experience ruined the evening our table was next to the kitchen","useful":3,"cool":0},"T3m3d0Ae4791q203eAkVkg":{"text":"My wife and I ate here about two weeks ago and I'm still thinking about my meal. Also as y","useful":5,"cool":1},"ovBdXzwsNaSU7b9I8qHRzw":{"text":"We came in with a party of 12 on a Friday night and were seated quickly because we had res","useful":2,"cool":1},"HA1xgbceLwPEAfikd8hy4w":{"text":"I'm blown away and I wish that I could give them 10 stars!!!  Restaurant Rebirth by far is","useful":10,"cool":5},"IcDSOT9aF6-DzN3pBaYxWA":{"text":"After the tourist traps around the French quarter had grown old, my wife and I decided to ","useful":0,"cool":0},"JqoU35LGc5p33UHEvrJfFg":{"text":"The food here is amazing and the service is top notch. We have had Sierra take care of us ","useful":0,"cool":0},"etrbogpvyhOZehAf8H9D3g":{"text":"So glad We came to check this place out for date night. It was surprisingly a GREAT eatery","useful":0,"cool":0},"ldrDpCU7M9H8lcRo1N4nXA":{"text":"The restaurant is tucked away near the end of Fulton. With only street parking of course. ","useful":0,"cool":0},"NTR1PEVCI83wiRr_9BoUHw":{"text":"This is a worth the wait, worth the reservation, one of the best start to finish experienc","useful":2,"cool":0},"mYyK8qtWhp3YcYBz0fBz2A":{"text":"Being there many times and the food and service is always first class. Last visit I had th","useful":0,"cool":0},"fvmrUVHxOe8Z_njIADFkzQ":{"text":"I think this is one of the hidden (maybe not so hidden now) gems in New Orleans. This litt","useful":2,"cool":0},"zAkfX_2FZfrdHJ90v-lsnQ":{"text":"With all of the great reviews, we were super excited to give this restaurant a try. My hus","useful":2,"cool":0},"88y-OM5NpSNFDFROvABosA":{"text":"I went to the Critical Care Conference in N.O. @5 yrs ago and my friends and I made reserv","useful":0,"cool":0},"6qsc918bkA1QaxbbFv61hQ":{"text":"Might be one of the best meals we've ever had in New Orleans.  The gumbo was fantastic and","useful":1,"cool":0},"TLYbWSJbikIVy_bvXbAi2Q":{"text":"On a corporate trip to New Orleans, my colleagues and I went to this restaurant for dinner","useful":0,"cool":0},"MifmbSOnnmW-h0nDyqOXeA":{"text":"To all who is reading.. A M A Z I N G.\n\nNot only is the food phenomenal, but the customer ","useful":0,"cool":0},"u6jaaMdMUSjKi0zlulUJGg":{"text":"My husband and I enjoyed Restaurant Rebirth so much.  The staff was incredible and spot on","useful":0,"cool":0},"trYsv6jkPOsFXBmUopzniA":{"text":"Awesome food in New Orleans\n\nBeautiful restaurants nice atmosphere food was amazing .\n\nEve","useful":2,"cool":0},"n-e5VE86OELPQPHTbIbNhA":{"text":"My wife and I had a lovely dinner here.  The popcorn shrimp salad,  reddish and bread pudd","useful":0,"cool":0},"XSHND2Fdd4DhMuKCeFXMMw":{"text":"I was so excited to try the redfish here for my birthday, but they were out. Super disappo","useful":0,"cool":0},"BZOC6cR84PhtV2v_tAtq9w":{"text":"I was in N.O. With friends for a conference and found this restaurant -Incredible food!! V","useful":0,"cool":0},"rF64cN2RlZNgqG9q2Bo-uQ":{"text":"had the fish of the day - flounder entree. The menu was very unique from the drinks to des","useful":0,"cool":1},"Rheo-Cvx-YY9SNEBOMuvng":{"text":"got the cut of the day with bearnaise and it was amazing. i also recommend the fried oyste","useful":0,"cool":0},"T_HFRyTcgNyE86Llu1mlPg":{"text":"For one, we were seated right away which I love. We had the fish of the day, which was mah","useful":0,"cool":0},"bu08Uc9Ktg0A1M3bvuXKzA":{"text":"First of all, Jessica called me to confirm our reservation and was the only one out of 4 r","useful":0,"cool":0},"2Ghd8qEDUfBm9hqY9Z0D8g":{"text":"WOW! Big flavor in the Big Easy definitely lives here! Came for my birthday dinner and was","useful":2,"cool":0},"eLKM1p4j_Jyr5YpSKWoUXw":{"text":"Amazing food.  Love the service.  The waiter was  knowledgeable and helpful.  Highly recom","useful":0,"cool":0},"z7KMeaCV1oDlPFdIb_jQnA":{"text":"Super small menu, but everything was absolutely delicious!  Pork belly and shrimp/eggplant","useful":0,"cool":0},"HJmYVBCCQLaA0xG-AO09TA":{"text":"I have been afforded the opportunity to retire at an early age.  One of the things I enjoy","useful":0,"cool":0},"f-VEDRmeBAmvmLM91gzTNQ":{"text":"We had a wonderful experience at Restaurant Rebirth New Years Eve! From the appetizers to ","useful":0,"cool":0},"PY-KWk3BFMdCAXs8ad7Wyw":{"text":"Tucked away amongst businesses this is a gem. Food was great. I had the filet. It was serv","useful":3,"cool":1},"0Vura8nEo04cXQF5qP3n2A":{"text":"A real disappointment. \nThe problem was the fact the restaurant is small and they squeezed","useful":0,"cool":0},"5pXjlOU-udeqW_UbVjPSeA":{"text":"Best dinner in New Orleans from start to finish. Loved that we were able to dine past midn","useful":4,"cool":1},"eu03HBGZemFsib-nZu5i9A":{"text":"Simply amazing!  I came here with my family while I was home for Mardi Gras and we had the","useful":3,"cool":0},"WbOZhtFedpEkaw9hbaUx5A":{"text":"I've been RE-BIRTH and came back as a FIEN (A FIEN for this place).\nOk so let me lay out t","useful":4,"cool":1}}