{"pml2HKaEQKcFwejlBS2WiQ":{"text":"NASTY NASTY NASTY!!!!!! Steer clear.  I've been told they've had trouble with the Board of","useful":1,"cool":2},"ADwcmUmIUPql8f19cbyUBA":{"text":"Now im from New Orleans, but this McDonald's im good try to get my lady a vanilla ice crea","useful":0,"cool":0},"pL3LWEwcqaTLaa7c4o860A":{"text":"This is one of the \"retro\" McDonald's and it's one of the better ones in New Orleans East.","useful":1,"cool":2},"b-nGkqvMoHuk4-zI4N8voA":{"text":"This Mcdonalds was my getaway while I was staying  in New Orleans east. Easy to walk from ","useful":1,"cool":1},"LLq1fG5WwQyrsqZuGhqQrw":{"text":"Employees nice enough, worked and got order right.  Tasty and hot Egg Mcmuffin and hash br","useful":0,"cool":0},"oXw6VrtwgyvFjVv9cDdlDQ":{"text":"Disgusting. The place is filthy. The employees are rude. The managers should all be fired ","useful":1,"cool":2},"9Im1Qv6yz6LE6hc4DabY9A":{"text":"It's simple. Walk in,place your order and leave. But not here. Today I decided to go into ","useful":0,"cool":0},"rTBX2EQI6cNuk9ySRlgAFQ":{"text":"I recently used the mobile app to order my food, normally I never have trouble at any othe","useful":0,"cool":0},"gfbxnSD5PSTMFPqQk_V1cA":{"text":"This McDonald's is the worst I've ever been to.  They always have problems in the early mo","useful":0,"cool":1},"xEpWUwyfIOBzX4JlPWmH1Q":{"text":"dey didn't mix up mah mcflurry at all yo. Wtf is the point bro? Might as well damn just or","useful":0,"cool":0},"qTgij1GTec-rvlHEvy4Xkw":{"text":"Not expecting much from a McDonald's in this area of New Orleans. \nMy orders have always b","useful":0,"cool":0},"nueTbMsCZXzRlFY7AamfWg":{"text":"No one was in line when me and my son pulled up in the drive through. We sat there for two","useful":0,"cool":0},"CcO6WrW0TCBWk7m85kucNg":{"text":"Food was good, and the restaurant was clean. The employees were having an argument on the ","useful":2,"cool":0},"usILgw6n7hPav7f02nAVrQ":{"text":"Positive reviews gotta be friends or one of the employees, worse meal ever.\nI will say one","useful":1,"cool":0},"mTNtJcgL7pbKvaknDWgWfg":{"text":"Driving on I-10, needed to grab a quick drink for a long dark drive ahead, circled off jus","useful":5,"cool":2},"Uuf_uS8ex9qoa81QIv7PRw":{"text":"Today if a negative star were possible I would give it. A little more work and a little le","useful":0,"cool":0},"XwoG0OrSqfcMGbmDPXLC7w":{"text":"This is the worst McDonald's I've ever been to in my whole entire life, I'm from Houston a","useful":0,"cool":0},"vUZK6KdYj2t3oBHkQvLgpg":{"text":"Slow drive through. The food is ok for a McDonalds. The ice cream machine doesn't run afte","useful":0,"cool":0},"ReV5vXMjR1Zxd-_kb7rmow":{"text":"Stopped by here on the way to Abita Springs from New Orleans to get a quick lunch.\n\nPro: T","useful":5,"cool":3},"3lGzcKblGLn98A1V_U-SPg":{"text":"At 6:45 PM, I showed up to the walk up window and ordered, and ask for everything to be fr","useful":1,"cool":0}}