{"eGFb_Pl3CNnLL9ygtDAkLg":{"text":"This Snowball Shop is now in my Top Favorites. I have not been in that area in a while, an","useful":0,"cool":0},"lC7Z8OhJ0lzy3TdSwbMhUw":{"text":"Really great syrups and unique flavors, and it was worth the stop to try the satsuma and c","useful":1,"cool":0},"Vz_lBdcNQxLjWvgzabSIZg":{"text":"I really don't have much of a reference point for these. I've never had them before, so th","useful":0,"cool":0},"q0B42CTe9kCT5lfHhUYl7A":{"text":"This is the absolute best snowball in the city. It is worth the trek and if you have to wa","useful":0,"cool":0},"fu2u1c2sueroYC6BpBxjGA":{"text":"I went here 2 days ago. I was so excited, I had never had a sno-ball before (which is a cl","useful":0,"cool":0},"tMOTF6im0hfeMomCIvZ_Ew":{"text":"By far the BEST snowballs ever. All of their flavors are homemade. My favorites are the ho","useful":0,"cool":0},"Umz6jrvEH7luP9OWd74aYg":{"text":"The bananas Foster's was amazing but only served on Wednesdays! Hands down worth the wait!","useful":0,"cool":0},"8GsQif3lBx1RR9ckG2xjGQ":{"text":"This place is excellent for snow balls on a hot summer day. I love the nectar with condens","useful":1,"cool":0},"QlBRDIH_m0HfcCfNM7Wa2w":{"text":"Absolutely the best snow ball I've ever had, hands down! \n\nMy favorite flavor is wedding c","useful":0,"cool":0},"wpMchxSvHB7XBwkE2ip7Ng":{"text":"It was good but I personally like Italian ice better. I got the strawberry shortcake and i","useful":0,"cool":0},"8fHs9eI9171u0OsF_Cxu5g":{"text":"It's been around for 79 years for a reason! Light fluffy snow, amazing syrups! I was so in","useful":0,"cool":0},"_VXSq0NWEKHSzsVIrPPSAA":{"text":"Well worth the 30 minute wait. Got advise from a person in line who was well versed in the","useful":2,"cool":0},"pfJHKXO0DHuf4KzMoAysnA":{"text":"The creamiest snowball that I've ever had.  I had a cream of nectar and cream of ice cream","useful":1,"cool":0},"lQ0n6V0d0ejQE0sfXbPofg":{"text":"Tucked away in a residential neighborhood, on the corner of Tchoupitoulas and Bordeaux, th","useful":0,"cool":0},"wCGIRr80vT0K4piEH1Nxaw":{"text":"I can't believe I stayed away from so long! Hansen's is such a treat. Everything tastes ho","useful":1,"cool":1},"zVgLzMbwwRGzkUI2WmyMoQ":{"text":"These clever bastards. There are six sizes. I was going to get the second smallest. 40 min","useful":0,"cool":0},"1VnTL2CpriL04r6B5_Kd4A":{"text":"I was still recovering from my morning sugar dose of beignets when I arrived at Hansen's, ","useful":4,"cool":3},"Qbf0Se7m2_syA1Actzs-fw":{"text":"your sno-balls are GREAT.  haven't been back to nola since i moved.  but i saw a segment o","useful":0,"cool":0},"yb6Al30xXTOt-Tx06ciPOA":{"text":"As a non-New Orleanian, I feel like a visit to Hansen's might be closest I get to experien","useful":2,"cool":0},"Pd0Ozw5Q2Wm1YCBa4ka4RA":{"text":"This place is the greatest discovery I've ever made living in New Orleans. Hansen's is the","useful":2,"cool":1},"-MzkDUv_uDjL1N21P1b_Ig":{"text":"This place has one of the best sno-ball I ever tried. The ice is so soft and their many fl","useful":0,"cool":0},"-XCVQS3zilA7HeHPhiilGQ":{"text":"Not your ordinary snow cone... the ice was so creamy and chunk-free. The flavors taste ama","useful":0,"cool":0},"tkMiaYhnCPFnFWoFY40sfQ":{"text":"Man, all the hype. Took an Uber out here just for this. The four people in our family got ","useful":0,"cool":0},"hk1uJYXc4_tuCN1pnDrRDw":{"text":"Satsuma!! \nI love Hansens for their soft smooth ice. Top that with the satsuma syrup and i","useful":1,"cool":1},"EElaowJROQ2IXNz89xjF2Q":{"text":"My curiosity of Hansen's began on Instagram. I saw their many colorful and noticeably text","useful":2,"cool":2},"ybZo_gQXXWw9bHM3ketCkQ":{"text":"I can't believe it took me almost 4 years to go to Hansen's. But I finally made it. And wh","useful":3,"cool":3},"QOXV72ZcTJk872pogVnIWw":{"text":"Awesome customer service and terrific product. The only issue you will find here is the ve","useful":0,"cool":0},"q1yJup0n0SIW6tkNxPkSDA":{"text":"This is the best snoball on earth. And I grew up favoring Plum Street... so either I'm a t","useful":0,"cool":0},"o61GTuj9b4mibhlp4MfZ1g":{"text":"Hansen's is a New Orleans classic...there are people for whom this is the ultimate snowbal","useful":1,"cool":0},"g2GvI9vdwC2t67qIKHP2gg":{"text":"The best in NOLA... If there is wait and there probably will be just know it's beyond wort","useful":0,"cool":0},"ahMNG-TEd-jdDeHYNq00aQ":{"text":"As big fans of Andrew Zimmern's Bizarre Foods we absolutely had to come here. It was a bit","useful":1,"cool":1},"Z_u7Mq25HOCN1HR3HF5prA":{"text":"It's a neat little place to get snowballs, the lines can be a bit absurd and that's true a","useful":0,"cool":0},"t31gv1tjYvy733eyeySamQ":{"text":"holy freaking balls.\n\nThis place is amazing.\n\nReminds me of hawaiian shave ice. the sweetn","useful":0,"cool":0},"H7WApjpmqLI0l3nFDJDZIw":{"text":"Simply not worth the 45 minute wait. They seem to think that being very slow instantly equ","useful":3,"cool":0},"x2UCIb0h8mMNxrx3Ohg5GQ":{"text":"I love this place and think I'm in love with Ashley Hansen. Not many places or people depi","useful":0,"cool":0},"g0rnHDBbM_iHGnmYTLW2dw":{"text":"Really good. Long line & takes forever, but it is what it is. Love the snow cones, but I'm","useful":0,"cool":0},"skb6UFfzbvibbaySFgPN3w":{"text":"Really, no other Snowball place should be allowed to exist other than Hansen's! It is the ","useful":0,"cool":0},"ZURSGiNXTsrPxzfNXW3NIQ":{"text":"Great ice! Every local knows the best snoballs are made with super finely ground ice. I go","useful":0,"cool":0},"-_Ti3Dxu_j_LI2VQ-Fcsgg":{"text":"Yes, it is very likely there will be a wait, and yes, it's worth it! Personally, I don't t","useful":0,"cool":0},"p3_7SKr5xSIV2FSjKcz4qA":{"text":"I highly recommend the orangeade with crushed pineapple. Delicious and refreshing! Hansen'","useful":0,"cool":0},"7Kc2Dilodwb1MgNYNADWDw":{"text":"This snowball stand is probably the most talked about of all of them. The thing that suppo","useful":2,"cool":0},"-w6XjTUgvvEuJov_tkrahw":{"text":"I really don't get what all the talk is about this Snoball joint.  Their \"fine ice\" has la","useful":6,"cool":1},"DRW9Fhp-DGpZ0q3AOGYXFg":{"text":"HONESTLY HEAVENLY! .... my first snowball: Summer 2014....\nWHAT WAIT? ... Go with good fri","useful":1,"cool":0},"OoLHhYoRut7VU6qQFQyR2g":{"text":"Just want to update since this is honestly the best place we've had snow balls in NOLA.","useful":0,"cool":0},"3FmljhadJ4affDC57cpg7A":{"text":"On a \"BaeCay\" with my hubby in Nola, ee stopped here after visiting the Tree of Life and I","useful":0,"cool":0},"L1wD0uUU-IEBisUBqpTnpg":{"text":"Hansens' is one of the my favorite places in all of New Orleans, and that says a lot when ","useful":5,"cool":3},"UOoobK8G4GfNwQEPCiXWww":{"text":"This is by far my favorite place to get sno-cone on the planet!  You should check Hansen's","useful":0,"cool":0},"2SdSVcRdwkp9mm16-DQXmg":{"text":"Yum!   Cream of nectar, ice cream with condensed milk.  So great!  My wife got lime, cocon","useful":0,"cool":0},"69TJBo3sQuePS-JSmDXc4w":{"text":"Hansen's Sno-Bliz is an institution and a real treasure. What is a sno-bliz? The better ve","useful":0,"cool":0},"xLzBYzANnj5evx9h5rJggg":{"text":"Let's just say, this place took my sno ball virginity and now I have very high expectation","useful":0,"cool":0},"s1WjXg3zvoHhKCQ8dSTYKQ":{"text":"fluffy snow and great syrups. I like that the place looks like homemade love. It is a litt","useful":1,"cool":1},"XpftG5AXwi9GgDKGFsxiBA":{"text":"Very fun and delicious snowball goodness. Just tell them what you like and they'll customi","useful":0,"cool":0},"u76MN3LbM50pHmbEf-VQlg":{"text":"Gritty local snowball stand, though with the best consistency ice anywhere.  Treat yoursel","useful":1,"cool":0},"UOhNGgi6vAJWgPYToP_XSg":{"text":"Ok I have a flair for occasionally posting the \"unpopular\" review but I have to stay true ","useful":5,"cool":1},"srYc4RygFb5NV4A-f5NYUQ":{"text":"We arrived on a Sunday afternoon and there was a line out the door. That's usually a prett","useful":0,"cool":0},"7gr_Shl8oFh6NYaR_ghAPQ":{"text":"How good an establishment is comes right down from the owner. And this one is the best.\n\nA","useful":5,"cool":5},"NZdASLiCRqQI1yIl9MIY5w":{"text":"Things to know: \n-cash only\n-prepare to wait 20 to 30 minutes\n-staff is super nice\n-everyt","useful":0,"cool":0},"46oRZnFRC7lST4ftWrAbuA":{"text":"I really like the snowballs here! Sadly, it was not worth the wait to me (45 minutes in la","useful":1,"cool":0},"cNxXbD_KKZugKi-Cfo_fBA":{"text":"We waited in line with a local judge buying treats for his family. Locals and tourists go ","useful":0,"cool":1},"BcBGag3PRl1Np8cYlwXMuQ":{"text":"A local recommended this place to my friend and I. Amazing! I had half cream of strawberry","useful":0,"cool":0},"pMC0KBWr0bJsdun8lUFkvA":{"text":"Waiting in a slow line on a hot Saturday is not great but the snow ball is great! I had a ","useful":0,"cool":0},"plTPgz-c79ENR_BN06_shg":{"text":"The Hansen family is a New Orleans institution.\n\nThe best snowballs ever.  Period.  I miss","useful":0,"cool":1},"Qx_SP3Q-l-6-ob_BZ-7S-w":{"text":"There's no need to say much, everybody knows that down here in New Orleans, Hansen's has t","useful":0,"cool":0},"19Ya2JU0RPp6hFFvE1d-VA":{"text":"I love how old school this place is.  They close at exactly 7:00 PM, and if you get there ","useful":0,"cool":0},"uvA0mBK8y3mwCIWSt3gOsg":{"text":"Every Sunday I would drive 30 minutes just to get this snowball! I would also wait for a g","useful":0,"cool":0},"8FuOfDaJRhHeJncEQ8-sdw":{"text":"Whenever I come into town from Texas this is my first stop over Cafe Du Monde. The ice her","useful":0,"cool":0},"_nMJe-t80X06Ou8YtyBwGg":{"text":"Ice is shaved down into fine sandlike particles. The cream of chocolate is awesome! Kind o","useful":0,"cool":0},"jj5dovEQC0xZYOF30C1BeQ":{"text":"If there's a line out the door every single time I drive by a place, I'm probably going to","useful":0,"cool":0},"-rOq3CjXZXIDXy3OZRMtCQ":{"text":"Now I can understand why so many people love to come here! Standing in line waiting my tur","useful":0,"cool":0},"pd1fB96CwjFNQ0Z0Pnl7sA":{"text":"I got the Creme of nectar and was blown away! I am usually not a fan of shaved ice but thi","useful":0,"cool":0},"bSQEB6O8dnyeQ95bPwFTzg":{"text":"Has a very New Orleans look and feel (says the outsider). I was confused about ordering be","useful":1,"cool":0},"KHB_LMV7JG08lH66-4OYKA":{"text":"I used to really love Hansen's, but after my last couple of visits my love for it has with","useful":1,"cool":0},"G5iJI5Vs3WEX9TU7l88gQg":{"text":"Y'all have changed our life forever....snow cones are no longer a joy and treat, once you ","useful":0,"cool":0},"HKdxZ63xESk505GTVz1ChA":{"text":"Let me start by saying \"to all of you who have never had a sno-ball month, you don't know ","useful":1,"cool":0},"-ZHP5qkEs5wPXoXhiI8JBQ":{"text":"This is definitely the best place for sno balls in New Orleans. There ice is like snow. Ev","useful":0,"cool":0},"j8O-hflL1So4kPmY9ZxZKQ":{"text":"I come here once every two weeks almost!  absolutely love the snowballs. Depending on what","useful":0,"cool":0},"-gmIxE_v7WyJBawM8q-XMQ":{"text":"I am a huge ice cream fan but I never liked slushies because they tend to be gritty and th","useful":0,"cool":0},"h14jcOWQfB5CDv4ZLeg5Ww":{"text":"I have never said this and have never been so confident in saying that this must be the gr","useful":11,"cool":7},"rDVUKe_zxZc6tEMXdY6bwQ":{"text":"Stayed nearby while visiting NOLA and stopped in almost once a day. My group couldn't get ","useful":0,"cool":0},"jDHO1HcxhsfZTpMMhYN04w":{"text":"I came in here on a preview day, before Hansen's officially opens for the spring season. T","useful":2,"cool":3},"xxuMhAf9hsrd_XNac5HL7Q":{"text":"This is where you want to go for a sno-ball, hands down. My neighbor told me about this pl","useful":2,"cool":1},"QQsGUnEzqjL05u_0X1cYZQ":{"text":"These people are snowball baristas. I've had some good snowballs but I never knew how much","useful":4,"cool":1},"65ukauXLNIl7M8HdYXOH2Q":{"text":"Absolutely everything wonderful they say and more! I stopped by on a cool gloomy day, so I","useful":0,"cool":1},"KwiLpWYU5VdvQZOlwHCC8Q":{"text":"What can I say about Hansen's Sno-Bliz other than yummy.  We made Hansen's our last stop o","useful":1,"cool":1},"mQ4z5buMhd5U5_jf5Csi6w":{"text":"There is always a line at Hansen's and it is always worth the wait.  Hansen's makes their ","useful":2,"cool":2},"0AFhLw2wm_cj2D5S2D5mvQ":{"text":"I love that Hansen's is a New Orleans institution with a rich history. So I was excited to","useful":0,"cool":0},"yW1t0aGQ2IPy3HByP8V3ww":{"text":"If you want a snowball go somewhere else.\n\nI've been dragged here on many occasions by the","useful":2,"cool":1},"ABHbys8UKMF315jVxyqnPQ":{"text":"Best sno-balls in the world!  Try the Chocolate Mint!","useful":0,"cool":0},"nLl_ax8elFxET_Pd3tecLg":{"text":"The flavors are delicious and there are definitely a ton to choose from. I find it difficu","useful":1,"cool":0},"L0sRz2vopqBvwyPP47O9zQ":{"text":"As I joined the line on the closing night and watched as the line grew longer and the time","useful":2,"cool":0},"56yI7u8004gJBrTLRnMHfg":{"text":"SNOWBALLS. worth waiting in an endless line, but you should probably wear a straw hat you'","useful":2,"cool":0},"fRjY5dnuNwEcCbAiqEKz5A":{"text":"So Hansen's ruined snow cones forever. Not that I consume a lot of snow cones or anything ","useful":0,"cool":0},"hd9rC124qBNRyM-eko5AQQ":{"text":"This place is amazing!!! Everyone recommended that I had to try it during our trip to New ","useful":0,"cool":0},"1qiIPGeu26d1tsVpzWqN7g":{"text":"GET THE BANANAS FOSTER trust me you wont be disappointed.  Its only served on Wednesday bu","useful":0,"cool":0},"zJFNZ0fX78hSdugbHjGI9w":{"text":"The classic New Orleans sno-ball.\n\nExpect a wait, but if you want to try an authentic sno-","useful":0,"cool":1},"VKiMJ2gngRaxwR0jB08bbg":{"text":"Best. Snowball. Ever. Their ice is like a mix of a frosty cloud and heaven. I've waited in","useful":1,"cool":1},"78Lk4EIXtmU0cq3wCAPP5Q":{"text":"I've never had a snow ball before but I can say they are absolutely amazing. I'm not a fan","useful":0,"cool":0},"-AgDc59Fed3G1C1d69017A":{"text":"This place is awesome!   I went with 1/2 satsuma (tangy, very popular) and 1/2 nectar (bas","useful":0,"cool":0},"Ccj5gOdT3QvjbVcoE4tToQ":{"text":"My girls loved this place so much we went here twice in 72 hours. We tried the other highl","useful":1,"cool":0},"KtFDWgbnyK7rzHVB8Qvk7w":{"text":"What  a treat! \n\nWe found this little gem while driving around the garden district. Many c","useful":0,"cool":0},"w2HuIX2W_t0JvEdtMaK93A":{"text":"By far the best in the entire metro area!  WAY better than Pandora's\n\nAwesome service, smo","useful":0,"cool":1},"mrikeTXiKCYWsdsQNphZlw":{"text":"Nothing beats Hansen's sno-cones on a hot day! The shop has been open since the 1930s and ","useful":0,"cool":0},"4YlOVVi1_c30lYAwkOHUEg":{"text":"This place was worth the drive out of my way,  had half cream of ice cream with cream of a","useful":0,"cool":0},"zOgMHbFyllHYYX11xfToqg":{"text":"Absolutely amazing staff and shaved ice. The wait can be long but they take extreme pride ","useful":0,"cool":0},"rHdt1iBgjwkqix15gZ_u1Q":{"text":"A new transplant to the city, I've had a few snow cones over the years and found them to b","useful":0,"cool":0},"gVxpT3jy1s_5I_Ud3cNwLQ":{"text":"High calorie cup of ice. Go to plum street unless you hate yourself and you'd rather stand","useful":0,"cool":0},"73OTF338S3b6_y8TBHpVbw":{"text":"Living in New Orleans, it seems that everyone has a favorite sno-ball shack and flavor com","useful":1,"cool":0},"p10JV0_c1ovUCohsnz1fbQ":{"text":"Amazing snowcone's great way to end a hot day.They make there own flavors .The staff is gr","useful":0,"cool":0},"xn7ximH_cB3qJ3aMwNz-VA":{"text":"Line out the door, yet I wasn't impressed. Ice is smoother than other snowballs and syrup ","useful":0,"cool":0},"ybYzaR2-PmEbo14LbKrWzw":{"text":"Feeling hot as hell outside? Stop by and wait in line for 20+ mins for this fluff of snow ","useful":2,"cool":1},"xbR0Dzia1wgUF7amBUTWVQ":{"text":"Best snow cone I've ever had hands downnnnn!! Got the cream of chocolate with condensed mi","useful":0,"cool":0},"VoPa2M5LAw0dk5I_xW5Z-w":{"text":"Some say Hansens is the best.  I vomit on them.\n\nYes, when the blades are fresh they perha","useful":1,"cool":1},"94pr-yIlZgaAVpkIq6EwpQ":{"text":"Before you decide to head out to Hansen's for a sno-bliz, grab some sun block and maybe yo","useful":3,"cool":1},"e_z0nAExA-5llXG99DCE6w":{"text":"One of the very best traditional snoball stands in NOLA. They also have wilder experiments","useful":0,"cool":0},"PMmjmsThLpSc01a_SRGe1g":{"text":"Had a very lackluster and disappointing experience this time. Everyone in NOLA views this ","useful":8,"cool":0},"V5b0JlH1zw0rWbynSA9Ibw":{"text":"Unbelievably awesome! I heard about them in Chicago, stumbled upon them during my visit. N","useful":0,"cool":0},"hGOuCPWWd3Uon2HSASJKcQ":{"text":"Hansen's is an iconic New Orleans place so you have to try it. The cream flavors are the b","useful":0,"cool":0},"L9TdYbQJAG6LvWemDd09lA":{"text":"Hands down, best snowballs in NOLA! MUST TRY! It was my first time here and I loved it! I ","useful":0,"cool":0},"Oo_MoANdnV3QZ6OP3ST_cQ":{"text":"Better than any other sno-ball I've had, though I am new to New Orleans and still playing ","useful":0,"cool":0},"LJHZcmv1dmxPcJw-EvHnPA":{"text":"I've been going to Hansen's for years now. They're are simply the BEST snowballs in town, ","useful":0,"cool":0},"SqJkgQnmSNK3XF2f5W0-VA":{"text":"Always wanted to give this place a shot, due to all the hype.. was the hype really worth i","useful":3,"cool":0},"w0-6nD_cOiDIOzYW0KDw_w":{"text":"I am going to type this review quite slowly - this will match the pace of service at Hanse","useful":4,"cool":0},"XyKKOQm-LAvbxvspAwlvwQ":{"text":"I see what the hype was all about!!!!!!!! The Damn ICE was delicious!!!! i stood in line f","useful":1,"cool":1},"3j4YFnvC3eeX0XEa9HT1sg":{"text":"I'd rate this 2nd next to Plum Street for snoballs. I don't get the hype. It's a long wait","useful":3,"cool":1},"ssH3vedqpaKIGoIr3n_XCQ":{"text":"I loved the consistency of the ice so light and fluffy. Coconut cream flavor was ok. Staff","useful":0,"cool":0},"JGvwiIo9ZRfJ2DxbRiM5bg":{"text":"Okay, went for the first time to see what the hype was all about. First, the line was craz","useful":0,"cool":0},"4EnDRC_tiRXRTAixGJwVAg":{"text":"Not only is this our favorite place for treats in NO it is our favorite dining establishme","useful":1,"cool":1},"2fmP-WLdBaI7DzqSkr2vcw":{"text":"Best sno-ball on the planet.  This place is why you love New Orleans and wish for a time A","useful":4,"cool":2},"ppfuixeDMHsEKQr9YjFtXQ":{"text":"This place is the best in my less than humble opinion for a authentic New Orleans Sno ball","useful":1,"cool":1},"lQuvOovkstDbxvclf4vx_g":{"text":"A true New Orleans experience.  Don't worry about the long line it will move quickly.  Som","useful":0,"cool":0},"WvebZ7b3YFmlhwvClKAt8g":{"text":"Would I ever wait over an hour for this snowball in such heat? Probably not. But if I'm ev","useful":0,"cool":0},"x_wcxpt5zjMqJHu-uf5hlg":{"text":"Best snowball I have ever had!!! They have perfected the shaved ice game. I ordered half v","useful":0,"cool":0},"M1UdT1_tS7GshREjRP9SiQ":{"text":"We were told that we were crazy to drive from Baton Rouge to N.O to get a snoball. Well it","useful":0,"cool":0},"0PrFiN9rv5fwm1D0BVQulA":{"text":"This place makes all other snow cone places seem amateurish.  The ice is shave so fine it ","useful":0,"cool":0},"AElUgdeYE4U9pCMeA0R_QA":{"text":"Hansen's is pretty much awesome! Just factoring in the ice quality and flavor selections, ","useful":1,"cool":0},"G27CUAXoeVUCAjMi_FNQyA":{"text":"So everyone has a rave about Hansen's Sno-Bliz...I would have to say this is one of the be","useful":0,"cool":0},"BTgY7vxOqyMQSW7piSwEww":{"text":"This is my favorite snowball place in all of the city.  The ice is nice and soft, and the ","useful":0,"cool":0},"i4jtVzT7RpSnYlKgasYLVQ":{"text":"GOOD GOD a snowball can't get any better than this! The condensed milk on top of anything ","useful":0,"cool":0},"1U4blNAJWKHxuZcgohE5wg":{"text":"You will usually wait a good 30 minutes to order but if you really want pretty much the be","useful":0,"cool":0},"anOFppkgCTz_x7sFvcxYIw":{"text":"What a great place for a snoball! Came on a hot day and it was exactly what I needed to be","useful":0,"cool":0},"8zsBriK-MDlyOHUAsRv-7g":{"text":"The best ice in the city.  They have traditional flavors so if you're looking for somethin","useful":2,"cool":1},"sw6qUvZLf_eSGwbU9CIKlg":{"text":"Still THE best ice in town. When they say \"sno\" there isno (get it?) joking about it! Saw ","useful":1,"cool":1},"-lJU0yIppBdkdErnN4yZhQ":{"text":"When I was a kid living in New Orleans I remember in the summers we would eat dinner once ","useful":0,"cool":0},"kIwkrdzjBCCKF2dHfm74UQ":{"text":"A must have in the summer! We drive 3 hours for this-really!!! There is always a long line","useful":0,"cool":0},"L3QUhfuq0bX4cx8CE9GEyw":{"text":"The best snowball in town.  I historically don't like show cones or even a number of other","useful":2,"cool":2},"Id7OXf5vNQZhoEgYkZGCMA":{"text":"Best snow cone I've ever tasted! It was super hot on the day I came here and it was worth ","useful":1,"cool":0},"k5Hkp_iPNBo-A51xDDYrGw":{"text":"I'm not sure what happened to the people in the reviews who had big lumps of ice in their ","useful":0,"cool":2},"9G-JatRDHH4PQBJZOKdMuQ":{"text":"This is the real deal.  They ARE the best sno-balls in the city, the out of towners really","useful":1,"cool":0},"EF-jjUy3_iWhj5z42cJ1yQ":{"text":"Long line leading into a hot shack. I ordered a regular ol strawberry snowball. My date or","useful":2,"cool":0},"XorjgW3hPo8xBF9VkfFXog":{"text":"Hanson's is the best snowball anywhere. The ice is finer and all of the flavors are homema","useful":1,"cool":1},"HOtFNmzpzzQZEuZEPhBDBg":{"text":"Nothing beats a Louisiana snowball and they have some of the best I've ever had. You will ","useful":1,"cool":1},"fozuy87QldE1pniGkRmkJQ":{"text":"The greatest snow balls ever and a great family business!  These snow balls are ten times ","useful":0,"cool":0},"AnVV6qWF-S5d_pHKX-r6tA":{"text":"It's a fluffy ball of snow with perfect sweet and tart flavor. I had the cream of nectar &","useful":0,"cool":0},"RFdgrK4i8rw3nF0ClGGJ3w":{"text":"Lots of different flavors in addition to a good number of toppings. Staff was also fantast","useful":0,"cool":0},"XraiGJaBdfUOqhm0J4FpFQ":{"text":"We are kind of shaved ice snobs and Hansen's did not disappoint! Oh man this place is good","useful":0,"cool":0},"sm2UfOaFVGEW7D5dHJ5xMQ":{"text":"I came across Hansen's due to the ridiculous line that we saw posted up across the street ","useful":1,"cool":1},"ooqzTY9PozFI7yeFAspggg":{"text":"Hansen's is divine.  It makes New Orleans summers bearable.  I cannot put into words how s","useful":1,"cool":0},"eKeoRnSZ3orwh00oJgRjOg":{"text":"Love love love this place. After a massive meal at mother's restaurant. We were looking fo","useful":0,"cool":0},"L_zaMdfAC11J3XDuiChIyA":{"text":"The best snowballs, like ever. The ice is so soft and the flavors are even better. Satsuma","useful":0,"cool":0},"8-bGs8yQrkQvMXzwgl0ykg":{"text":"Being from California, I had never heard of a Sno Ball. A friend happened to be in town at","useful":1,"cool":1},"fovuLi7mXHTeAspCpBZvoQ":{"text":"It was an average snow ball. The ice was awesome but there just was not enough juice for t","useful":0,"cool":0},"2e8S3ITaASKt-o4BX42Ofw":{"text":"Worth the walk from the streetcar. Was worried this would be like a Sno-cone but was soo m","useful":0,"cool":0},"m6mMAQnS7EeKF3n_I-G85A":{"text":"Drove all the way from the airport and back just to check it out. Im glad we did. It remin","useful":0,"cool":0},"EToPEWhSwmX0GfaIGcyPFw":{"text":"Sooooooooooooooooooooo good!! I always get apple juice over snow. Be prepared to wait in l","useful":0,"cool":0},"rkRZJEVGX-I3A57wWFpXGQ":{"text":"This is the only place we come for Snoballs when we come home! Love that it's staffed by H","useful":0,"cool":0},"zI5yc0a1pQOvENJPO2IdrA":{"text":"We waited an HOUR and 20 minutes in line for these sno cones. I probably would have given ","useful":1,"cool":0},"I09NvyPVtwfpz2Vm8GMNSQ":{"text":"New to Nola= new to snowballs. Hansen's was the perfect place to try my first one. Friendl","useful":0,"cool":0},"jhtQmQa0xhlsQidQ-Ivm2g":{"text":"A must visit if you have the time. Don't be scared of a line. Because at the end of the li","useful":0,"cool":0},"Vp1Ngr51L5iyNq8sRu3g4w":{"text":"It was so hot during our week long visit to Nola. Kept hearing about this place and even s","useful":1,"cool":0},"T2OMIBlDoQf_Kk0CcPWwuw":{"text":"Apparently we picked a good day to go... a rainy day. NO LINE.\n\nStrawberry with condensed ","useful":0,"cool":0},"WXgi22gpevBsWxWiPsAoFg":{"text":"This place is a one of a kind. Incredible ambiance in a tiny hole in the wall sno-ball sho","useful":1,"cool":0},"a1F_zOfOPxFrRr_EBGYFzA":{"text":"Best snowballs in NOLA, perhaps the world. You will not find a better quality of ice anywh","useful":0,"cool":0},"NyPKUjMZv1UkKH18rpY-Gw":{"text":"The best snowball in NOLA!!!!  The ice is fine, fine, fine!  There is no other ice like th","useful":1,"cool":0},"suUQlri2FTq_PEReh-DseQ":{"text":"I think most of us feel fortunate when we experience \"one\" of the best versions of a parti","useful":0,"cool":0},"fiQN5aSnXUBGy07dtl5YtA":{"text":"This place is well known by, and frequented often by the locals.  It is about 10 blocks to","useful":0,"cool":0},"AMrVbdGSYXyyqyp_CZqXjQ":{"text":"What hasn't already been said?? I've never been a shaved ice/sno ball person but had heard","useful":1,"cool":1},"JpiBbtHtMlxlLFUEYW7J8Q":{"text":"One thing I would like to share is the poor hygiene and sanitation of the place. A friend ","useful":0,"cool":0},"FjBtMgg1DMW5q8m32iob2Q":{"text":"I visited Hansen's on a hot, humid summer afternoon. The line was out the door, but it was","useful":0,"cool":0},"KrDfly2F5Aw4qXDL0xFQAg":{"text":"I LOVE HANSENS! Hands down! Come to Hansen's! It's the best! I love their Cream Flavors! T","useful":0,"cool":0},"cj1o1PPvr9acAu1l2wdxrA":{"text":"I traveled from Washington, DC across country stopping along the way at restaurants and ea","useful":2,"cool":0},"hUyIGn5lPusNmOVfS2nkpQ":{"text":"I have snowball fever now...we just tried them last Sunday and I've been thinking about ne","useful":0,"cool":1},"TPil7DAke8HhALtxK8ZUwQ":{"text":"This place is the definition of \"local favorite\".  Never have we been so warmly welcomed t","useful":0,"cool":1},"1pwibfdjmO847hokSojUKw":{"text":"Today, Hansen's opens for its 75th year of serving the Nola community.  It is truly a loca","useful":0,"cool":0},"zn3UZGTLSznmU3ydmGCDKA":{"text":"Always amazing!!! Prepare to wait in line but that's all part of the ambiance and experien","useful":0,"cool":1},"SLKbXZmk0kLyAFMm0QHp0Q":{"text":"There's a charge to run a card, so just bring cash.  So many flavors to choose from!  Ther","useful":0,"cool":0},"GeE63dnaUHrh0e00ArNMWg":{"text":"Simply the best snowcone/ball I have ever had.  In fact, it really deserves its own catego","useful":0,"cool":0},"ZourSjiYo8XVtVVkfXhhug":{"text":"This place has a special place in my heart.  Arrived at about 2 PM & there were people get","useful":0,"cool":0},"SuSJkjDCur3JZ7cmMjZ7Pw":{"text":"Woo! Finally got to try it for the first time and yes, I loved every scoop! My friends and","useful":0,"cool":0},"y0JQ074vXef1EwXJJLrfbA":{"text":"Great attitudes but eh, a bad location that loses too early. The Jr Atomic with cream of n","useful":0,"cool":0},"gcPLVr5A5WuDNJxKK0cDQg":{"text":"Cream of Nectar with condensed milk is where it's at: light, fluffy and delicious. Yes, th","useful":0,"cool":0},"eUSxBMERdKxorsE5r3fWwg":{"text":"I heard a lot of good things about Hansen's, so I figured I would give it a try.  I was en","useful":0,"cool":0},"Efrdsc42GYnMtF1tmoeBMw":{"text":"Had a great $50 sno-ball here. $50? Let me explain... Hubby and I were in town for a work ","useful":1,"cool":0},"WwxSloX9AvJpAVeT7cprnQ":{"text":"This is a neat place local landmark. Shaved ice with any flavors. The cream flavors are pr","useful":0,"cool":0},"nNdPKzO9J4HXuqa23kQlOw":{"text":"Pros: Good shaved ice--not sure what all the hype is (it's good, but not mind blowing)\n\nCo","useful":0,"cool":0},"aN2bX7QsZJHtX-Yi5Frcdw":{"text":"Sooo much better when you're not waiting in a long line in New Orleans typical HOT weather","useful":1,"cool":0},"Xdp5cuB7nHkpwwZnQwFVrw":{"text":"I was lucky enough to drive by when there was no visible line (which never happens) so I i","useful":0,"cool":0},"n1d38gh95DPOvSjV-pINCQ":{"text":"I've realized two things after having multiple snoballs.\n\na.) I don't particularly love sn","useful":3,"cool":2},"81itUTQM2tMKF6N4fGZjnA":{"text":"hands down best snowball in the universe.\nlove the history of this place. \none of my favor","useful":0,"cool":0},"j7M4DDUaNTyUG2dIfYptWA":{"text":"Coming to Hansen's is truly an original New Orleans phenomenon.  There is ALWAYS a line, s","useful":0,"cool":0},"_x9iZMkHCBGgiEKPPGd4dw":{"text":"While vacationing in New Orleans I stopped by Hansen's Sno-Bliz as it was near my rental h","useful":0,"cool":0},"RU5CSTVaGCX5sgYFUW-jtQ":{"text":"A bit pricey ! But you get what you pay for ! \nThe absolute best sno balls in New Orleans ","useful":0,"cool":0},"1uVWp81-TeIsAVOYga2TlQ":{"text":"Limited hours, long waits, no AC...these are all things that would ruin a place, but Hanse","useful":0,"cool":0},"0-UbjKKTWVABXpMwDoXqUw":{"text":"I would not have believed it possible to shave ice so thin, and have it so fluffy, and whe","useful":0,"cool":0},"TGK6N1WIPbWGe0hnrc9A-Q":{"text":"I've been wanting to try this place! We waited 45 minutes in line..... and it was worth it","useful":0,"cool":0},"Ru5aVBmex0XSNAxweXMYWQ":{"text":"100% worth the 30 minute wait in 95 NOLA weather. I had the cream of coconut/cream of nect","useful":0,"cool":0},"JVZloy0f96j7dNHljD_3oQ":{"text":"Holy Heck YES! Just happened upon this little jem for a much talked about snoball while vi","useful":0,"cool":0},"u45wgK3jWHzjwQejwv19CQ":{"text":"The Commander's Palace of local sno-ball shops, and in more ways than one.  \n\nThey get fan","useful":0,"cool":0},"w2dMvtbJKq9gLD0dARAuBw":{"text":"stopped in after a friend suggested it. The friend lives in NOLA. I got the strawberry sho","useful":0,"cool":0},"H0FA09ZGp1KGwMXsKw7K1Q":{"text":"Not sure what else can be said. They are legends. Only downside is the long line. \n\nMy fav","useful":0,"cool":0},"ZTETQhneTaOISf_UiwMn7Q":{"text":"Hansens banana foster!!! If they have this then you need to try! This legit just melts in ","useful":0,"cool":0},"jQ_3rEkKvQuVE-zT-Qa5XQ":{"text":"Sno-balls are amazing, but the lines are insane!! I hope you're ready to have a heat strok","useful":0,"cool":0},"0Kij71MiMmMrrgBSllPBuA":{"text":"Hansen's Sno-Bliz\n\nSo here we go foodies - a sno-cone review.\n\nHow do you top off James Be","useful":1,"cool":1},"W1_wiWZLa7mlG6kYks93Jw":{"text":"You can pretty much expect at least a 30 minute wait on any given weekend during the summe","useful":1,"cool":1},"Id-SYTb5lSM-6s9mH4WgRA":{"text":"Was told by a friend that Hansen's was the best in New Orleans and would have to visit whi","useful":0,"cool":0},"tSFxHvXVHDqQyQqqOJ-Vkw":{"text":"My oh My.. if you don't know Hansen's, you don't know NOLA! Settled in the Uptown, Tchoupi","useful":0,"cool":0},"kxf0_JszOoaH0_cWlr6Zig":{"text":"Good stuff, they never disappoint! Be ready to wait a little bit bc there's always a line!","useful":0,"cool":0},"1xlmCBQvmt4dba-0tlI8zw":{"text":"meh, i dont know what the big deal about this place is...we always went to the snocone sta","useful":3,"cool":2},"GUr4lgfWMAqOBDc3nsQ05w":{"text":"Delicious. Listen to the yelp reviews and try the satsuma and nectar cream- great mix of t","useful":0,"cool":0},"OyT4DMEW4Jtj1eQNNH8tmA":{"text":"Great snowballs! Perfect during those hot New Orleans summer months! Always a line so that","useful":0,"cool":0},"AavLhvVt0kPmmTp26ZZNPg":{"text":"Yaàaaasssssss Hun-nay!\n\nBetter wait in that line and get some honey mercenary and vanilla ","useful":0,"cool":0},"rxxD1bvXNR_pSuiyHwpsuw":{"text":"Heaven on Earth!! You know this is the spot when the line is out the door. While waiting i","useful":0,"cool":0},"BjbsYIHKOO4FFX8NlS5N9g":{"text":"Absolutely the best ice around! It's as soft as snow! I like the idea of their souvenir cu","useful":0,"cool":0},"VPXadxU4jdAiW92qOqqk6Q":{"text":"After a grueling morning with mishaps and an auditing exam, my bestie thought it would che","useful":3,"cool":1},"NiRnysDfdrSOwHSSnAgMLg":{"text":"The ice is so perfect...and the flavors are still excellent with no taint of chemical afte","useful":3,"cool":2},"heuTmKXZZOC33ox_nDMabQ":{"text":"Hansen's Sno-Bliz has been around long enough for my grandma to have enjoyed it as a child","useful":0,"cool":0},"zdOMDJvWiPWtyiHv8luddw":{"text":"Hansen's snowball is legit. One of the guys suggested getting a mix of the cream of nectar","useful":0,"cool":0},"n3lqSFeFnPGKBBUKZULlKw":{"text":"Hansen's started in 1939 with their patented Sno-Bliz machine that shoots out the finest m","useful":0,"cool":0},"seyawT3YrGkoTpN91Bcdag":{"text":"I've been here a few times with my Mom, who went here every weekend during the NOLA summer","useful":0,"cool":0},"WVxFRW6Kv5X2Yrgk9_FY7A":{"text":"Best Snow Balls in the world!!!   \"There are no short cuts to Quality!\"\n\nIf you are lookin","useful":0,"cool":0},"vQEQiLjCe0EpSxZAs4GSuA":{"text":"Amazing place I used to go to snowizard until my aunt recommend this place. Their ice is l","useful":0,"cool":0},"HtiaT_O3d-6_PKEvIBeAKw":{"text":"Visited for the first time today and it was phenomenal!! Well worth the wait! The ice crea","useful":0,"cool":0},"CN48I3aN19Okufpz1aWP-g":{"text":"So simple, so good, so cheap.  Took a bike ride over from Frenchman street and stopped her","useful":0,"cool":0},"i5TADBPsWq9060lUMjoqQQ":{"text":"Nothing beats a Louisiana snowball (Though Jerry's in Memphis is a very close second). Fou","useful":0,"cool":0},"gqm7xzidbJ_-J9eJXEbw0g":{"text":"Wow!  I have been to  Ululani's and Matsumoto's in Hawaii and this was amazing!! Thx to Ye","useful":1,"cool":0},"uKOXhec9JZPXkVPnHy-Nwg":{"text":"I have been hearing people talk about Hansen's SnoBalls for years, but never had one mysel","useful":6,"cool":0},"B3x0iHe0WqrqO4OYZXX3Og":{"text":"I love this place because the ice is fluffier and snowy-er. I personally go for tarter and","useful":0,"cool":0},"4QOoKKjsRR7rWEXr-ulYpw":{"text":"Hansen's is a New Orleans institution and who doesn't love a snowball on a hot day?\n\nI sto","useful":4,"cool":4},"qmsj2s6eSr_q2CPu2mOOjQ":{"text":"Best Snoballs on earth. They are like soft clouds of ice. Too bad they aren't open as ofte","useful":2,"cool":1},"EL6I9IkgF78ObMAmCaYvVg":{"text":"As far as snoballs go, Hansen's is the bees knees.  I wonder how much they make an hour si","useful":2,"cool":2},"siZ9ANrRdzlMhs--imqJOg":{"text":"Absolutely delicious!!! I wish I was in New Orleans longer to try all the flavors! I tried","useful":0,"cool":0},"f01KTesNkI3WXEGDOsIyQg":{"text":"If there really is a heaven it had better be a Cream of Blueberry snowball from Hansen's.\n","useful":0,"cool":0},"s9tq4ga1rbwULIq6O2nGVQ":{"text":"Nectar cream with condensed milk.  Heaven... and nothing makes fluffy ice like the patente","useful":1,"cool":1},"tqqJB00p43cgVOjVqK9M4w":{"text":"I refuse to wait in the hour long line, so I only go during off times. Middle of the day o","useful":1,"cool":0},"WOpEAD2rXAMa1mp_THpS4A":{"text":"We picked the perfect day to come to Hansen's. It was raining fairly hard when we rolled u","useful":3,"cool":5},"NudXC-YC_EH7eLyhjatMXQ":{"text":"I've never been much of a fan of sno balls, but I won't pass up Hansen's! The ice is fluff","useful":2,"cool":1},"x4qgE1e1C1V8iid4CLZpBQ":{"text":"We kept Reading about this place on a few different websites. It could be a little out of ","useful":0,"cool":0},"unlVc_Re6rLaiJCULvvgeg":{"text":"Worth waiting in the long lines! \nTheir snoballs are like nothing you've ever had! The ice","useful":0,"cool":0},"CjKHYj8eoMHJtlKHS3Qv3A":{"text":"Maybe its unfair to punish it for being so popular and having such long lines, but I never","useful":0,"cool":0},"T2bC1ntGrq3LOcocEUBpZQ":{"text":"Ice was very soft and delicate. The flavors were plentiful. But it's charm & history is wh","useful":0,"cool":0},"rt2uXKbbx1Z6xUv3iKvJCQ":{"text":"First of all, it's a LONG WAIT. Always. The reason for the wait is because they layer the ","useful":0,"cool":0},"440f5lC67nVy4jhA9bmfXg":{"text":"OYE OYE OYE!\n\nALL HAIL KING HANSEN'S SNO-BLIZ!\n\nI would definitely give this place 6 stars","useful":9,"cool":5},"3jmkWCIUvYcygKO4NvkJWA":{"text":"Cream of Nectar. Amazing! Not crazy sweet, I couldn't decide between cream of peach and cr","useful":0,"cool":0},"p8PqZKxBegzGZhDW0ufOeg":{"text":"Hansen's sets the standard for snowballs. The ice is fluffy not crushed they have the clas","useful":0,"cool":0},"WJ6YJGRKwCrYB3PDpiQOrA":{"text":"Heard from a friend this was a spot to try when in NOLA. She was right. This place makes s","useful":0,"cool":0},"iRx8usXRCRJrrBXjCdn6Rw":{"text":"What is there left to say about a historical foodie mecca + tourist destination that alrea","useful":1,"cool":0},"GNtSgnqEPDyoCA2GZB884Q":{"text":"All the people who are complaining about how long the line is, my suggestion: Don't go. I ","useful":1,"cool":0},"oN8koCz9082dW32gkMhXbw":{"text":"Hansen's is one of my \"must visit\" places in New Orleans. I have stood in line for 1 hour ","useful":0,"cool":0},"5yfhR5ip7XpoNfjRVbohmw":{"text":"The line really takes away from the experience here. However, the snowball was amaaaazing.","useful":0,"cool":0},"-8jiJ1fY_oft8SZEQqmjJQ":{"text":"Im giving it a four star because my daughter liked it .. the snow balls are a lighter type","useful":0,"cool":0},"RKQwmwXvD8AcObNMt1U8zg":{"text":"Snowball. Awesome treat with which to refresh yourself during the hot and humid days of Ja","useful":3,"cool":2},"nIDfZncHmUEzKxqiF9dtcw":{"text":"Soooo good, a must! I would go for the more 'natural' flavors. I really enjoyed a lemon ba","useful":0,"cool":0},"Bo2ktTVxYRQkQLRue9sXOQ":{"text":"Have been going to Hansen's since early 60's.  Always have been the best snow balls ever. ","useful":0,"cool":0},"-rFar5hjTPNcow17qOIZiQ":{"text":"Snoballs are delicious but there is always a line except for when it's raining! Even when ","useful":0,"cool":0},"_bVfvG3-AOLmNbs--UZguQ":{"text":"I got the satsuma with condense milk and vanilla ice cream today, and I admit it was prett","useful":2,"cool":0},"aFUd0TLGBP-bvwVYvljKGA":{"text":"Amazing! We got there 5 minutes before it opened and there was already a long line to just","useful":0,"cool":0},"A56LTnSYVw8tRm4f5TrKMw":{"text":"one word: YUMMMMMYYYY!!!!\n\nIt's one of the most delicious snowballs I've ever had. The bes","useful":2,"cool":2},"GgRdkYzPR_NdjzVP6lyqCg":{"text":"Closed for winter!!! Don't waste your time but everyone even the locals says it's the best","useful":1,"cool":0},"eYiFgsjBQgU1phuhywlGow":{"text":"The worst customer service and the product wasn't even all of that.  We get in line and wh","useful":0,"cool":0},"tRsWUPapB_4I1BE3JvlSmg":{"text":"Holy Moly. I rolled up to this spot with a local around 5p. Line out the door and around t","useful":0,"cool":0},"T5mhi-OOHg7zrqPPTGmS0w":{"text":"They give Rico straw here for what?  One thing Rico know is good snowball.  All good snowb","useful":1,"cool":0},"QTfUY9E9VQxNCumQHhb8uw":{"text":"Ok.. First time trying these snowballs...hands down, best ice in a snowball ever! The vani","useful":2,"cool":3},"b3IkAHjezrcEcB2DSjOl3w":{"text":"Yum!! This place was so good. It's a small little family run business that looks like it's","useful":0,"cool":0},"y-wPGuqtyb7qFO6A12qV7g":{"text":"If you can't see the difference, then you don't know snoballs.  Hansen's ice is superior (","useful":0,"cool":0},"rBplizByH4Sg9vfD1VtKBw":{"text":"This is the gold standard of sno balls. Everything from the ice, to the syrup, toppings, s","useful":0,"cool":0},"Oj1PgTqnP12jP1cfiVP75A":{"text":"The spousal unit visited this place last Wednesday and has been raving about it since. He ","useful":0,"cool":0},"W8QA-kkhSSokYFDMbHQjOA":{"text":"I love Hansen's! It is with great sadness that I didn't review them earlier and to show my","useful":1,"cool":0},"g1X52ltm9ruTUu3JCttKpA":{"text":"I feel like the flavors were not on point and flavorless. We got 4 different ones and the ","useful":0,"cool":0},"vxyMV6b-MyvA_ZZTYPU8Ag":{"text":"This place is a staple in New Orleans history. An institution. The greatest sno balls in t","useful":0,"cool":0},"tw8SIQinGcsZFcUdWk58BQ":{"text":"I think the wait made me knock off a star. I've had really soft shaved ice before so my ex","useful":0,"cool":0},"Ly0xs5oSOUapj-zPZNmalg":{"text":"This is the only snoball shop. Don't even think about going anywhere else. \n\nHansens does ","useful":9,"cool":5},"MYEG4AYcfPdtudxZE3geuQ":{"text":"Omg where do I start! Okay so for the record I DO NOT NOR HAVE I EVER LIKED OR LOVED SNOWB","useful":0,"cool":0},"oKHBsx2RoA6wywgbyGph-w":{"text":"After a long morning of studying for nursing school ICU test, I had to get out of the beig","useful":0,"cool":0},"ku9w_rm7gaNg8EpL9lpQ9g":{"text":"We did a lot of foodie stops in foodie heaven NOLA and pleasantly surprised that an old (7","useful":0,"cool":0},"MxraU9J0hnoY0Y0tQdZ98A":{"text":"What can I say? I have had a lifelong love affair with Hansen's. I have such vivid memorie","useful":0,"cool":0},"M031lqFufP0uX1_tdCM0fg":{"text":"This place is awesome! I love New Orleans for many reasons, like this little jem. My mom t","useful":1,"cool":1},"_HU81tPa6GDd2QIySBCZSQ":{"text":"I absolutely love Hansen's. The snow is creamy and the syrup is sweet but not deadly sweet","useful":0,"cool":0},"ZW5Ibs1tSFVVUkviUnV3PQ":{"text":"I didn't know snow cones were a thing in NOLA, but it was a pleasant surprise. We tried tw","useful":1,"cool":1},"mLcO9X3vHXQ7GdWGfAMliw":{"text":"*** JBF America's Classic (2014) *** #3 ***\n\nHansen's is not your ordinary sno-ball shop. ","useful":2,"cool":1},"3sOVCq8gKUB6yqNO_z5Ghw":{"text":"Pros: The best sno ball in New Orleans. The best sno ball in New Orleans. The best sno bal","useful":1,"cool":1},"ecH1Iq0xifDubnnkXtiWhQ":{"text":"It's just so New Orleans. On a hot summer day, line out the door and down the street, a sw","useful":0,"cool":0},"8DNXHigBPbmWeQGT_uCS2A":{"text":"Anyone that lives or visits New Orleans should come to this place.  There is nothing to be","useful":0,"cool":0},"JZkGt2l-0yCzL66AEuJ9Sg":{"text":"This is a \"must stop\" for my family when we visit New Orleans.  They are not open year rou","useful":0,"cool":0},"XQC9izuEo4KKV9R2MrqKPg":{"text":"Brought friends visiting from Texas to have a NOLA snowball experience. After the 15 minut","useful":2,"cool":1},"JsfmpkJ5fRomuMgYmFjPdg":{"text":"If you're ever in New Orleans, Hansen's Sno-Bliz is an absolute must!!! \nThey had so many ","useful":2,"cool":1},"5jFFubegNW-2T0Th9WLbUA":{"text":"I was so pissed it took 45 minutes waiting in line but it was worth it.\n\nIt's not just a s","useful":0,"cool":0},"ZPviXFOWULYmwpQUnlJRXQ":{"text":"4/5 just adding a few notes\n\nso obvi this place is an institution - both locals and james ","useful":4,"cool":3},"0wAPPhviz6onjSg1PPY30g":{"text":"I have friends in NOLA who build trips around driving by Hansen's to see what the line is ","useful":0,"cool":0},"uux3_YWmKQ-s3hHPwAli5Q":{"text":"Visiting from TN & a couple of friends who have visited before mentioned Hansens since it'","useful":0,"cool":0},"XHMxWoE6IH0yHzgG3c0P9w":{"text":"The most delicately shaved ice topped with strawberry shortcake flavor and stuffed with so","useful":1,"cool":0},"Ytz-pAb829DIU-FA4g7kjw":{"text":"This local favorite was worth the wait in line.  There are enough flavors to chose from so","useful":0,"cool":0},"GRV6jpVGbeCiZVI4Hb02kQ":{"text":"Had my first hansen's experience yesterday and while i can't compare it to the other snowb","useful":0,"cool":0},"VXeY3h6ik0vjfx9Lhh79tw":{"text":"Finally after three years in New Orleans I made it to Hansens for their famous sno-bliz.  ","useful":0,"cool":0},"h5zB2FptdRNoityDxG4PTQ":{"text":"THE BEST SNOBALL YOU CAN FIND ANYWHERE. I can't eat just one when I go. The softest ice an","useful":0,"cool":0},"65vWJ9fd0i3H7xFY0Fzf6Q":{"text":"Wow, it totally lived up to the hip!!! We all enjoyed a cool treat. It was worth the wait ","useful":0,"cool":0},"WZzlEIDVRNU1dP7CwhybwA":{"text":"Always come to Hansen's when I'm having a snowball craving. Be prepared to wait because th","useful":0,"cool":0},"enb2YekSCKUc_LDlGoCp0g":{"text":"Delish and fun snowballs are soft and oddly creamy with a multitude of various toppings wh","useful":1,"cool":0},"jZwnYE7dDUcwWERrRpQNRg":{"text":"Flavorless red snow.   No taste whatsoever.  I am absolutely  crestfallen!  After waiting ","useful":5,"cool":0},"tdpN1_YY_bxyqXrKxwq9pw":{"text":"The syrups are great.  Chocolate with condensed milk is my favorite.\n\nI did notice the las","useful":0,"cool":0},"G1oiSt-hNMvzIZHdSMsDzQ":{"text":"Amazing snowballs~!There are so many flavor and topping combinations to try and I have yet","useful":1,"cool":0},"9qv3JrfyVhyovHDz4KYrBA":{"text":"We kept Reading about this place on a few different websites. It could be a little out of ","useful":0,"cool":0},"XuTDT_W3tP1J2nYN1XYb7g":{"text":"Awesome. The ice was perfectly shredded, worth the long wait in line. Had the seasonal cuc","useful":0,"cool":0},"_0TJF_Dbd_yhZGCMb2Nt5w":{"text":"Best sno balls EVER!!!!!!!!!!! The lines are super long but it's worth the wait. They need","useful":1,"cool":0},"XuLxPjlsTfIlys0HYJ9Mgg":{"text":"My buddy Blake took our family here. WOW what an experience. The perfect taste of New Orle","useful":0,"cool":0},"PSxvslGgCEvBM7jDXHzcDg":{"text":"I can't speak highly enough about Hansen's.  I am a snoball addict and have tried a TON of","useful":1,"cool":1},"XETofXQBbXaS0YfCPS2MIg":{"text":"Best Snoballs in the business! Expect a line but it is worth it.  This establishment has b","useful":1,"cool":1},"sh8IuEo_w6QQl5ns5KNUxQ":{"text":"I'm on my way to grab a few right now. Five generations have enjoyed there from my family ","useful":0,"cool":0},"6sgbtx3r7v9rBdANL1SWYA":{"text":"The absolute best treat for a humid New Orleans afternoon.    \n\nBelieve the hype.  Get in ","useful":0,"cool":0},"cb2F6-4NnifNaxvqIou1MA":{"text":"The line was long, but so worth it!!! I got cherry and chocolate topped with marshmallow. ","useful":0,"cool":0},"ulrUkvvjCGH-V3NKcpBCYQ":{"text":"I'm from California and we have this food truck that makes snowballs to imitate a New Orle","useful":0,"cool":0},"BXSUKan6Y0pQlMgUcexpug":{"text":"So, so good. The ice is so delicate, so flaky. I ordered the cream of coffee topped with c","useful":0,"cool":0},"Sa716SOdjRbfP_XDujCZCw":{"text":"A \"must\" for a trip to New Orleans!! Delicious, interesting flavors! We enjoyed the feel o","useful":0,"cool":0},"91slsb9WzgnRn9C-v6lXZw":{"text":"Yum yum yum uber delicious flavors and huge portions for cheap...feeling lucky only waited","useful":0,"cool":0},"HIMW5EMk9n5dcQfrdJYKoA":{"text":"So delicious and refreshing for those hot Nola days! Can't remember what flavor I had, but","useful":0,"cool":0},"RBMj-nFZcSkuwajdcqt_bg":{"text":"Air Conditioning for your tummy!\nThis is a must stop for any NOLA outing! On a hot, humid ","useful":3,"cool":4},"ZlaDNCfZlTD0PWdqPmIbtA":{"text":"An exceptional snowball. If their is another snowball in this city that is better, I need ","useful":2,"cool":0},"lYXkx2xnCoKIuORNa-BJFQ":{"text":"Truly the best snowball in town. The consistency of the ice is different - flaky, like a c","useful":0,"cool":0},"5BKdHkIjNDnSksRFykIsow":{"text":"Never got to try it.  They were CLOSED??? SEASONAL????  It's fricken New Orleans-65 degree","useful":0,"cool":0},"hn84Lmwrq2FFZd5GmmoB0A":{"text":"One of the best snow cones I've ever had. I loved the souvenir cup! I got apple juice whic","useful":2,"cool":2},"_9519YbRwmg_qjtJginEIA":{"text":"The wait can be long, but it is well worth it to try these New Orleans exclusives. This ty","useful":0,"cool":0},"HxN7lZRGbgQ7woFk1bWq8g":{"text":"There's a reason for the long lines. This is how I imagine a snowball would be. I got the ","useful":0,"cool":0},"S_qUBKEReg0lMbwh3zYMJg":{"text":"I was lucky enough to go there in December for their holiday flavors and they did not disa","useful":3,"cool":1},"C-tZ9o_jpZlGBT7o6OcGFA":{"text":"The best snowballs in New Orleans. Softest ice ever and they make the flavors themselves.","useful":1,"cool":0},"i0elrEaOabfzE25K0mkvfA":{"text":"I appreciate their attention and dedication to the craft.  I have waited in longer lines f","useful":1,"cool":0},"9e1qRWps3PTzkD2v_HcL-A":{"text":"when something is the best of the best, there's really not much to add that can top that d","useful":2,"cool":2},"ETyMopDWDqur-vYQymGttA":{"text":"This place is a must hit spor in NOLA. We plan our vacations around their schedule.  The l","useful":0,"cool":0},"dtcjujhu-i0TklF7bE158g":{"text":"Best sno-balls around. I haven't found a match. Worth the wait. I still dream about these ","useful":0,"cool":0},"RnJ-NNibhbbDFigSo47OeQ":{"text":"Worth Driving 100 Miles For...\n\nYears ago that was how the local newspaper rated this snow","useful":0,"cool":0},"CQFsPdaPgcHvDkTNz5wxxA":{"text":"I suspect one's opinion of this venerable sno-ball shop might serve as a referendum on the","useful":0,"cool":1},"u5VJYyWZgo6sz6T7gab8uA":{"text":"If you're visiting NOLA in the summer this has to be one of the first stops you make. \n\nI ","useful":0,"cool":0},"4z9oudUKG4pusUEVmllxaQ":{"text":"Heavenly! That's really the only way to describe Hansen's snoballs! We were in town for th","useful":0,"cool":0},"GdYgmWY0QkX0hQb3pYtk9g":{"text":"The best snowballs in town.  I'm not sure how they shave their ice, but the texture is not","useful":1,"cool":1},"5WSW3ts7d8Y5xZPJxsPHvg":{"text":"If you're willing to stand in line this James Beard winning SnoBall stand will blow you aw","useful":0,"cool":0},"J84YKGOUoCGxmWxhrqHFrg":{"text":"Wasnt supposed to go here. We were actually on our way to another venue in NOLA to visit a","useful":1,"cool":0},"gGtQxNMEuG83ckETx2TJzg":{"text":"We live 2 blocks away - I know there's purportedly this duel between here and Plum Street,","useful":1,"cool":0},"FV2iyssRrqkSDcIZU_zJXA":{"text":"Without question the absolute perfect place. It's delicious, historic, friendly, refreshin","useful":0,"cool":0},"gUHcOc3PEs4v1mVniIe8kw":{"text":"I was totally at a loss when deciding what to order, and the signage at Hansen's wasn't he","useful":0,"cool":0},"C_11kP2UxZRQh4XYCg5ZpA":{"text":"There is no other for me.  Awesome flavors and great prices.  The line can get seriously r","useful":0,"cool":0},"bGZVuZZfdx4oiX43zlqzUQ":{"text":"Best snow cone ever! An absolute must if you're visiting from out of town. Don't be put of","useful":0,"cool":0},"q-4bvGMghS1gDkNB9Ot3lA":{"text":"This is for us Northerners who have no idea wtf snowballs are:\n\nIt's not an icee. It's not","useful":3,"cool":4},"I-h3QgkSnZOdAUlXt_Nr-g":{"text":"Finally had the chance to try one of their signature snoballs and I'm in love. This ice is","useful":8,"cool":7},"Cr62mNb6UuHBQbZM35KWZw":{"text":"It has been around for 80 years so that alone should speak for itself! \n\nThis spot is loca","useful":1,"cool":0},"-MJZOarlLTjXww9pvXtBEA":{"text":"I had Satsuma and watermelon with condensed milk on top and it was delicious! Kinda like a","useful":0,"cool":0},"SjYsS0Z-f6CNv0ZMzpedrQ":{"text":"Snoballs are delicious but there is always a line except for when it's raining! Even when ","useful":1,"cool":1},"j4DxqSNqECyvUFl7RqVbuQ":{"text":"I'm a Hansen's loyalist!!  Be prepared to wait in line for a while.  Their motto is \"There","useful":1,"cool":1},"-3kTUpYZk-ru0OtO8Qthng":{"text":"As someone who worked at a snowball stand for 1/3rd of my life at the time of this writing","useful":11,"cool":7},"K2deHSwTZ8mMYh_EbrlKHw":{"text":"Went to Hansen's today to try what everyone raves about. The difference between them and y","useful":3,"cool":1},"VTwGad6yVdWqbGsfY4M1Dg":{"text":"I'm not going to lie, I didn't really understand what a snowball was. As a northeasterner ","useful":2,"cool":2},"FlqGOd4LRdTlt2xA_osD0Q":{"text":"How I miss being able to get sno balls... this place is awesome. I am not a nola native bu","useful":0,"cool":0},"bMXW3heocVJox8xysaboBw":{"text":"Didn't really think much of this place since it was just flavored shaved ice..... I was wr","useful":5,"cool":3},"S0Ps14BVSABIYArhgIytGQ":{"text":"Words cannot describe how much my husband and I love this place. We visited this place two","useful":0,"cool":0},"WSIa0pDiiUORK-HNo51oRw":{"text":"This not-so-traditional snow-come shop was perfect on this hot 80-degree day! So many amaz","useful":0,"cool":0},"zWpQ2s0hcx5njuEJCoVTZA":{"text":"Finally after growing up in New Orleans and living here for almost 48 years I got to go to","useful":0,"cool":0},"x6y74FypI0EhXVa8mGTvnw":{"text":"As the yelp reviews say there is quite a wait for this snow cone place. It's a super popul","useful":0,"cool":0},"_wifdhhNtd04dfoukfr5Mg":{"text":"Hands down THE best place to get snowballs. Every place I would go to had snowballs that w","useful":0,"cool":0},"q4Hv5irXozrGmp6wyTKLvA":{"text":"You'd be lucky if you got here and there wasn't a line out the door. Every time I've been ","useful":1,"cool":0},"PcmkeWi0cp6mL_Ppz1ni0w":{"text":"I was very excited to check this place out on our trip. Not only do they look amazing, but","useful":2,"cool":1},"co6D0K93hMXeEGIiJ0HA7g":{"text":"Touching down in NOLA From Cali earlier this month, we were immediately greeted by the lin","useful":1,"cool":0},"eMJQbcwEfry2gbANEfbMsQ":{"text":"I'm almost 50, and honestly, it was one the best snow balls I've had.\nWe drove way out of ","useful":1,"cool":0},"qYCXJ7zCM_49e6MnVjF-GQ":{"text":"We were there visiting from California great snow cones awesome Place Sade on YouTube glad","useful":0,"cool":0},"cVTunUnZXGcXj7tFqCVihg":{"text":"I've been here twice and both times the line has been 30+ minutes. The flavors listed on t","useful":0,"cool":0},"0i1e1mIWpQU3J3mtr47C_g":{"text":"Closed on 12/28/2019 (Saturday) at 4:36pm!?!? Website \"snowbliz.com\" does NOT work. Waste ","useful":0,"cool":0},"5PtkQCmE5tbiFx6YN0Cljg":{"text":"Today's snowball.... The Mother-in-law:  This was another excellent flavor combination. Th","useful":3,"cool":3},"Gd3DjnnS13hmcAX7odYFaA":{"text":"Went at off peak hours, incredibly slow moving.\nIn fairness a lot of high maintenance tour","useful":2,"cool":1},"aQxjvy2ZGsOwiFRgm8wAfw":{"text":"First time here! After looking over all four walls at flavors, I finally had to make the d","useful":2,"cool":0},"0MDcb4CXgct3HeecjLfy6g":{"text":"During my last trip to Nola, ALL I freaking wanted was a Snow Ball!!!  I'm from Virginia..","useful":2,"cool":0},"pbBrtH1SONp2n3xYvGwMTA":{"text":"I grew up with fond memories of snow cones.  I used to get them as treats from my parents ","useful":4,"cool":7},"Zf7Bvpn7vEi1QsiJtu-UZg":{"text":"Definitely a nice and refreshing treat. I got the satsuma flavor with sweetened condense m","useful":1,"cool":0},"zYFF-d4KzY65uefymoVY0Q":{"text":"Summer in New Orleans means one thing, SNOWBALLS!  In fact that's my favorite thing about ","useful":1,"cool":1},"S2SAj5K96XX9XPZx1PMpaw":{"text":"hey yall....believe the hype...my bestie and i visited this speedy sno cone spot back duri","useful":1,"cool":0},"8VWjLZdAHtlx5JsLZy3lbg":{"text":"This can't be shaved ice. It tasted like a smoothie or like a tasty shake. Just Amazing!  ","useful":3,"cool":2},"YrT_MaKcmWigTwaLejqbrQ":{"text":"Omg this shaved ice was everything. I think it saved my  life! After stepping off the plan","useful":2,"cool":1},"ACha7mqrNsimSaW9FoC1FQ":{"text":"While visiting New Orleans, my cousin took us here to try their shaved ice. I was so glad ","useful":1,"cool":0},"wB778xmLYSJZqj0apSD_Cg":{"text":"This review is short and sweet. Hansen's is the best sno ball in our fair city. There are ","useful":4,"cool":2},"OZPV6m1b-ItVRg0Aa3Qaig":{"text":"My first Hansen's experience definitely lived up to the hype! The line was pretty long and","useful":0,"cool":1},"zrlsw-CIZIVVnirw60_aMg":{"text":"6 of us.  Long line.  There are flavor ideas everywhere all over the walls, which was a ta","useful":0,"cool":0},"P5069U0VwukUCRJ4cIlTZA":{"text":"This place is located on the corner of a busy road in the Uptown part of New Orleans. The ","useful":1,"cool":1},"WoXXUPCXJI1F_OanTFvMuw":{"text":"Are you kidding me?  Best snowball in the world!  Cream of Nectar with condensed milk. Ahh","useful":0,"cool":0},"oEWE0X64AuMxekqqm_4pog":{"text":"Love, love, love Hansen's. As a local I feel like it's the best snowball in the city, but ","useful":0,"cool":0},"t6-j4_OHc766Hzro4YtggQ":{"text":"Came here over the summer. This spot is located on the corner. The Sno-Bliz is perfect and","useful":0,"cool":0},"cuF9pNsjYJUpMj_sCqvT4g":{"text":"What a fun New Orleans staple! This was my first time trying Hansen's and it certainly liv","useful":1,"cool":1},"Z7nHscJ2u6m8l4IrXIyAfw":{"text":"I do not get how this place has such good reviews. I got cream of nectar and cream of coco","useful":0,"cool":0},"ThjoaDt6ANq3Jg673lvugw":{"text":"Finally, with a warming up of the area, I decided to brave the line at Hansen's one Sunday","useful":2,"cool":1},"m_JT6gdDoJMIbpo86uGWww":{"text":"Best snowball in time. The wait in line is worth it. I have recommended this place to seve","useful":0,"cool":1},"SdPAacE0fbAi9NTqGwHsrw":{"text":"While we were waiting in line, it started pouring outside.\nBut more people kept coming\n\nTh","useful":2,"cool":2},"zkaXSzZ2pbwESw8AW1u2Tg":{"text":"Ok folks, this is hands down the best sno ball you will find probably anywhere on earth. I","useful":0,"cool":0},"CteNjlS0GyTjVehS9Wm25Q":{"text":"Definitely off the beaten track. My group of 4 took the street car part of the way then wa","useful":2,"cool":0},"5qf0fKkF6BQZk2hL-QR_yw":{"text":"This place is amazing. The blackberry with condensed milk was great. Everyone raved about ","useful":0,"cool":0},"n7kHFdDSZ9ONvKC4JS6oNw":{"text":"The most wonderful snoball stand in the world!! Down to earth, friendly, caring employees ","useful":0,"cool":0},"Pm67GT-HdHG_E6Ce6sO8EQ":{"text":"This is my favorite place for snowballs.  The chocolate with condensed Milk and ice cream ","useful":0,"cool":0},"731II2k4JylZMiNN6vxejw":{"text":"I didn't think I could love a sno-cone this much. \nHere are some tips for other people who","useful":0,"cool":0},"eQ23VmnEKpJYbQUbjwxhOA":{"text":"Where do I start? The legendary Hansen's!!!!!! Their ice is so smooth and fluffy,  and the","useful":0,"cool":0},"f4oAw4JhMkvt5tyQSH3OyA":{"text":"Can't leave Louisiana wihtout coming here. This was my last stop for the trip. Got their h","useful":0,"cool":0},"V9bxj-qiJbo4hAaFsg80nA":{"text":"There is a reason that Hansen's is recognized by the James Beard Foundation and that there","useful":0,"cool":0},"C-VjvZMCR2NJTVu5yc1SCw":{"text":"Hansen's always has a line around the street corner during the summer. After lunch at Domi","useful":2,"cool":3},"BNJgc5591iaAnXK8xkre4w":{"text":"First time for everything!!!! The ice is soooo fine!!!! The Pineapple taste like 100% fres","useful":0,"cool":0},"b44yBTQ-O_ouFtn67j4zFQ":{"text":"Before today, I unfortunately was one of the few Louisiana residents that hadn't heard of ","useful":1,"cool":1},"pEzNw1TR4-FHUFtvBl-new":{"text":"Worth the wait, for sure! The ice is perfect and they were all full of flavor. The waterme","useful":1,"cool":0},"lLzM5Bk9_W2OsDTj5AJw3A":{"text":"The ice was sooo fine! You know it's good ice when the condensed milk doesn't melt into it","useful":0,"cool":0},"jb63i7ZSyQL9-TIFcgJSsA":{"text":"Be prepared to stand in line for a bit, and follow the markings on the floor to go where y","useful":0,"cool":0},"QRxNkYkPDduj3FfQ1YPwUg":{"text":"There is literally nothing in this world better than a Hansen's sno ball on a hot New Orle","useful":0,"cool":0},"o2npWuzZi_uEYGi_gXKKTw":{"text":"Shaved ice on a hot day!\n\nTHE AMBIANCE:\n\nHansen's Sno-Bliz is a really small store. The li","useful":5,"cool":3},"VLe3oIp-m-wp63mOehH8Uw":{"text":"My first New Orleans snowball experience. I can see why its a local favorite. I got a stra","useful":1,"cool":0},"_Xrao-MpR3FSN-zfqwdYVw":{"text":"Wow what a cool place. Our Uber driver told us that this was the best place in the city to","useful":1,"cool":1},"Oisesz46bDyu4DBU62zYBA":{"text":"Ummmmmm... let's see... how should I describe this place? Oh... \"SNOBALL HEAVEN\"!!!\n\nI'm a","useful":2,"cool":1},"0z9IFd_0_pBFp3DpHeySNg":{"text":"We love the snowballs here. The ice is soooo soft and they have bunches of fun flavors. Th","useful":0,"cool":0},"JYEBORGdwPXQoPZkST1XrA":{"text":"Home of the original snowball. Their ice shaver is the best in the world. They have all th","useful":1,"cool":0},"d7hzYu7T2cmW8FwP7ljinQ":{"text":"there are a few things in life which, when i come across someone who is not capable of enj","useful":6,"cool":6},"m1m-2dmnaUjdv_N9Sa9eEg":{"text":"Hansen's hands down has the best snowballs ever and the staff is so professional and nice.","useful":0,"cool":0},"55kAJSkMvqa9jJLCpnfF6w":{"text":"Hansen's is my most favorite snowball place in the world. I dream about their snowballs. W","useful":0,"cool":0},"kmrPK0u6RYY-Ec5T6A2Gog":{"text":"You know those places in New Orleans that everybody talks up and then you go and you're li","useful":0,"cool":0},"pBgVM8fjIeQxJHXf9Dv6oA":{"text":"I had cream of ice cream and it was so flavorless, super disappointed simply because this ","useful":1,"cool":0},"oeSMlsaD-3l5f_g06hKV_g":{"text":"Gotta make the trip to this place.  It's worth the wait.","useful":0,"cool":1},"oTe1GnZ8RvtaYftiP-z1_w":{"text":"Yes, the snow balls are delicious and made with quality syrup. Hundreds of different flavo","useful":1,"cool":1},"6rC_iDvAWSpFO6GIO3OgQg":{"text":"The line was LONG. Took around 20 minutes to get to the counter and by the time I got ther","useful":0,"cool":0},"OX66X7rFK1q5qAOQc27evw":{"text":"I had no idea snoballs were a thing in New Orleans until my friend asked if we wanted to t","useful":0,"cool":1},"20c2R1KLsIk6zNtzh1pGuQ":{"text":"Hansen, you have stolen my heart!! This is an old school snow cone shop, but if it's not b","useful":1,"cool":0},"gk5loCRJRAcw3F6FYPRaNQ":{"text":"Hansen's is easily the best snowball around! The ice is truly the best...no comparison. Ev","useful":0,"cool":0},"Iy6J7UsFZ2ZBrxD5hJ3Bfw":{"text":"I love Hansen's! It was my first time every going. I avoided it because I hate lines but i","useful":1,"cool":0},"sqdfKqlzDiZYOvGA679fSA":{"text":"I was expecting the Sno-Bliz to just be like any sort of snow cone you usually get.  Howev","useful":1,"cool":1},"TvR44RQYKK0OJkXHTcgAMQ":{"text":"Honestly everything about this place is five stars for me. Yes, the lines are long-we got ","useful":1,"cool":1},"b3wBP-u1nhDS_88i1XZcDw":{"text":"Always a favorite stop when in Nola...we usually try to make it there more than once when ","useful":0,"cool":0},"2pLB9K8g9ofrt4QqwDlf4A":{"text":"Snowball rookie here. Naturally, I thought that a snowball would just be shaved ice with s","useful":1,"cool":0},"7KhRYvHIazBG2XTpgFfsOg":{"text":"Best ice in New Orleans but what would you expect from the OG! House made Original flavors","useful":1,"cool":1},"CDS3Py0JR9DE19UAtkh1nA":{"text":"Recommended by a NOLA native, I was excited to try out a Sno-Bliz... especially during my ","useful":0,"cool":0},"y_1cJY8Ks_wa29NIB1bPNw":{"text":"Hansen's is synonymous in Nola to Sno-balls also known as sno-bliz! From the historical up","useful":1,"cool":0},"8z9UOCbIeZ6eBVdGZGnHYw":{"text":"One of the better snowball stands in the city! The texture of the ice is perfect. Soft and","useful":13,"cool":9},"jJCL9azeBhUqyp_CS5bEpw":{"text":"This is my first time going to hansens. I have been to many other sno ball places in new o","useful":0,"cool":0},"FIT_TPFhsRgIXOGYSL6sVQ":{"text":"I'm a sucker for all types of shave ice so of course had to stop by Hansen's in New Orlean","useful":0,"cool":0},"3bvJaTs6rIAy7eht8Q8_bQ":{"text":"My husband and friends stood in a line for nearly 1.5 hours to taste one of these deliciou","useful":3,"cool":1},"Nms36AkCm5819i2NtGqqyw":{"text":"TIPS- 1) ask how long is the wait, you may do better waiting in your car than the New Orle","useful":0,"cool":0},"jlTyCAmkNgxOEJFqgJSDrw":{"text":"Simply the best in town. Simply the best in town. Simply the best in town. Simply the best","useful":4,"cool":1},"vLcz-rAWeibMs17FZvg_oQ":{"text":"THE BESTT!! Lines can be long but it's worth the wait! Flavors are fresh and you can't go ","useful":0,"cool":0},"gDAFW5puhqgbvC9lPVKEmA":{"text":"Hansen's is the truth. Well worth the drive to come here . It's a flavor experience you ne","useful":0,"cool":0},"eeLnFCTNdxvA71W1I_ro9Q":{"text":"If I'm in New Orleans in the spring, summer, or early fall, this is a must-stop place (the","useful":3,"cool":2},"eLrtazhoJoSI_TWC5hUbWA":{"text":"I don't know if there's anything I can say about this establishment that has not already b","useful":0,"cool":0},"ybEXTm-7sbBfwOQQpkLsdA":{"text":"There are tons of great sno ball joints all over the city and Metairie, but none beat the ","useful":0,"cool":0},"Wm_jf55O6BmS9iGUbrah2Q":{"text":"We went to this location specifically because\nthey advertised Snoballs with cream topping.","useful":0,"cool":0},"9SI6NLChPxeet-j3VnJN1w":{"text":"BEST SNOBALLS IN NOLA!!\nYou can never go wrong with Hansen's. They have the softest ice, b","useful":0,"cool":0},"rVOy_3pZEvdY9QKhJVRQdQ":{"text":"To be open selling shaved ice for 80 years you have to be doing something right! Well they","useful":1,"cool":0},"3Us-ixb-u_aAgBeLWcQ4qw":{"text":"Simply the best snowball ever!!!  Once you have a Hansen's you just don't want any other s","useful":3,"cool":2},"3UM-w9svUPu3lrXVoUl1kA":{"text":"Probably the longest I've ever waited for a snoball but they never disappoint! Always a li","useful":0,"cool":0},"s-orhLWtKOxC_8zpnzUomg":{"text":"In doing my research prior to flying to Nola, I came upon these words: \n\nSNOBALLS. EAT THE","useful":2,"cool":2},"rwGr5HZLc-EH_-ZQJ2rd1Q":{"text":"This is a short and sweet review because this is all that needs to be said: softest ice ev","useful":2,"cool":1},"iK12DnzJs-ojyiYEqKLTKA":{"text":"After eating a shrimp po boy, I decided to come here for some dessert.  Hell.........I had","useful":3,"cool":3},"XTwlS1PwbbB5hmKWjE7-Ew":{"text":"This place was really under whelming, especially after waiting in a 45 minute line.  The p","useful":1,"cool":0},"INSodvuIdmx50HzTk0xRrg":{"text":"There are no words to describe this tradition. I bought many SnoBliz from the grandparents","useful":0,"cool":0},"lVtJYz9Vj8nlOdYm16QCfQ":{"text":"**ICY NOSTALGIC GOODNESS**\n\nDude, stop complaining about the wait.\n\nGo home and suck on an","useful":14,"cool":13},"QDvVCDDRyLR5Z0rtrbH2sg":{"text":"This is a New Orleans staple. With the coronavirus, the line was not that long and my wife","useful":0,"cool":0},"yUt5MKMYQiqgvTfirS5EcA":{"text":"Do I really need to write a review about this place? I mean come on.. Everybody knows this","useful":0,"cool":0},"yzB2K1bezn9cNk3xQnovCg":{"text":"The only place to go for a snoball. Really. Hands down, the best flavors, and the smoothes","useful":0,"cool":0},"ko1ac9jPUnDCI96vfq_ZZA":{"text":"This the perfect spot for my 666th review....because it's devilishly good!  Hahaha, I've g","useful":1,"cool":2},"9YeFN7CAFECUMXW3DuJLxg":{"text":"Grabbed the snowballs from the worker and it was wetter then a WAP. Also like WAP, it tast","useful":0,"cool":1},"4cPNXnQfEUWBeqLc4zA_SQ":{"text":"This is the place TOURIST go to get snowballs. It's popular and I guess that's what attrac","useful":1,"cool":0},"MUYuA2IqJ16_msBfzzwdwQ":{"text":"This place has always been on my NOLA bucket list, and it definitely lived up to the hype.","useful":0,"cool":0},"1oJ91Ja1IGf1PZkIb2zp3g":{"text":"I don't care if I have to wait 3 hours. This place has the softest, most powdery snowballs","useful":1,"cool":1},"vDyW_NRn9rZ2mwVnafIbpg":{"text":"So, in the uptown snowball world, Hansen's is  king hands down.\nPerfectly shaved ice, with","useful":1,"cool":0},"Dzu_KtJKC5rkNSebq8Yhsg":{"text":"So glad I was able to check this place off of my vacation bucket list! At first I was a li","useful":2,"cool":3},"SxI4szyrPqQ4xEjYlGs2Ng":{"text":"I love Hansen's tart flavors! Recommend the satsuma. Snowball was powder fresh. Definitely","useful":1,"cool":1},"DzHRt6L4q3gcIztSIQz2Nw":{"text":"seriously so amazing!! snoballs are my favorite treat in the summer and hansen's are the b","useful":0,"cool":0},"h_UeDPGMLt6Y3qnNySlLLw":{"text":"Hansen's is a NOLA institution for a reason. Always fun, always cheap, always delicious. B","useful":1,"cool":0},"jBgXmM2Tz7ybGi5V8uRFMQ":{"text":"Hansen's is by far the best snowball ever. I've always been indifferent to snowballs, but ","useful":1,"cool":1},"w8WUoGgtBqKBa1bFup4fvg":{"text":"This place is full of childhood memories for me, and I'm so glad I was able to grow up kno","useful":1,"cool":1},"N51DVlxq_HKEFNu_k8IatA":{"text":"Line is LONGGGGGGG. Know that before you go so that you have no complaints. I want to say ","useful":2,"cool":1},"Gwx-ajlYt9IkcdBOzDzUEA":{"text":"Beware of the brain freeze!  Eat slowly.  The past few times, there has been very litle li","useful":0,"cool":0},"G_Dd8kkywuVVTHs_Urlerw":{"text":"Everyone in New Orleans has their favorite snoball shop and half of them it's Hansen's. It","useful":14,"cool":13},"ub7zSnLVdOUgQlhOcyLbwQ":{"text":"So hard to believe that I was able to get a sno-ball on a hot & sunny New Orleans afternoo","useful":1,"cool":1},"CZqzbs4HZGZXTecjBl2u2w":{"text":"Ooooh dang did this hit the spot! I've lived here for 13 years and have never had the plea","useful":3,"cool":3},"Fm4C2tbRJRHrrUzezSz-DA":{"text":"How many other snoball stands have James Beard Awards? Hansen's Sno-Bliz makes their syrup","useful":1,"cool":0},"ns2SV6sRi3QW3svL4E_qtw":{"text":"I wasn't impressed. I think it's one of those things where you love it because you grew up","useful":6,"cool":2},"cZT0D6YngrTZq9mUsqw0_Q":{"text":"Love the snowballs. My absolute favorite snowball spot for several years. I stop here at l","useful":0,"cool":0},"rKDQrm84tk5nrLeHfd5KGA":{"text":"Not good. The line was long but Hansen's worked through it quickly which was a plus. But, ","useful":0,"cool":0},"ncFvF8boilZFRjCl5tLeTA":{"text":"The best snoballs in town. The ice is powdery. The syrups are homemade. No other place rea","useful":2,"cool":1},"qVBiGMMgn2KO1cMR43EKxg":{"text":"It's amazing, every single time! They are taking social distancing very seriously, which I","useful":0,"cool":0},"XOage6RxWcjJvJFMTbJmBw":{"text":"The ice at Hansen's is the best in the city that I've come across. Their flavors are your ","useful":1,"cool":0},"X9qE2cRMs1nrxswyCkTpqg":{"text":"Go here on overcast/rainy days! We went around 5:00pm on an overcast day and got our snowb","useful":2,"cool":1},"NphZoHgxAOMOgz1d2h1yuw":{"text":"Hansen's will always be my go to snowball place!! I love all of their flavors, but the sno","useful":0,"cool":0},"j1jgYo4Qzk4qmhKzZg3AXQ":{"text":"Great number of flavors and options. Got the strawberry with sweet cream.... overall good ","useful":0,"cool":0},"upfqVQBDcuwM5urH1THkmQ":{"text":"A classic New Orleans stop. This place is always busy with a line and for good reason. The","useful":1,"cool":1},"lenXuMKsLBn7FnUOMLsz3Q":{"text":"After reading all the reviews, I was so extremely excited to try Hansens that I took the 2","useful":3,"cool":0},"cxzQIfkBXT4PHSRdWOPqhA":{"text":"The best snoball i ever had! I can't believe i stand in those lines, I absolutely hate lin","useful":0,"cool":0},"s_CCpIErF_UorYsUwRK20w":{"text":"This type of desert brings me back to my childhood in New York where the cart comes around","useful":2,"cool":1},"XbA9WXHmwGK8ekqJQAbsfg":{"text":"Ok, now I get it. \n\nGrowing up in the Midwest, I was completely underwhelmed by the \"snow ","useful":1,"cool":0},"u2AfhCyOuFkh7XbxeAyNiA":{"text":"I might just be willing to hop in the car on almost any hot day to make it to Hansen's (wh","useful":3,"cool":1},"pFZhMjp_hHaed1MP53_eIg":{"text":"I think people end up at this place for two reasons, either they haven't been before so it","useful":16,"cool":13},"WW078vA4b9j0kbrz0eqsOg":{"text":"In a previous life (let's call it, the Pre-Hansenic era), I poo-poo'ed snoballs. Turned my","useful":10,"cool":5},"9EOqtWt8rUgoM6tdzA4npg":{"text":"It's just as good as everyone says it is. There were so many options, I just went with som","useful":0,"cool":0},"MeEYzaMG_nsjggPDE0Morw":{"text":"Wow- kept hearing Hansen's was the best and finally had time to queue up and find out. \nTh","useful":2,"cool":2},"HGEY5y0vn-O5VqGIDIx82A":{"text":"So it's no secret there are amazing places throughout this city to get snoballs, but here ","useful":1,"cool":1},"-1pOMd82Co_7rlVA3ugYSQ":{"text":"OMG! I'm in love! Snowballs from Hansen's are probably my favorite 'food' of the year! \n\nD","useful":4,"cool":3},"dHMBxEPL7q9lwtWXIpxANg":{"text":"Hansen's has the best sno-balls in the city. They have a myriad of different flavors, many","useful":2,"cool":4},"WHeTBw1MjxA-2erNqrAqlA":{"text":"Hansen's was so good! Not a far drive from our hotel either. The line was shorter than exp","useful":1,"cool":0},"tr-CFVW2FYdfXyjAm69acg":{"text":"YUM. We stopped at Hansen's before heading to the airport, and I am glad we did. I got the","useful":2,"cool":0},"HhLj7dyYXFZy6f7cfVmMLg":{"text":"This shave ice rivals what I've had in Hawai'i.  That says a lot for Hansen's.  What's eve","useful":2,"cool":3},"u6yITgdNz456K7xgF2bCGg":{"text":"The line was RIDICULOUS. We waited for over an hour. Although they were good (clearly the ","useful":1,"cool":1},"-nLY6-84nvJCgPqYwnsyMw":{"text":"This place is sooo good!!! They not only have ur signature flavors but thy out there own s","useful":1,"cool":1},"-HOOV-580TqeLk59Zb-bmA":{"text":"Hansen's is one of the best, if not THE best sno-ball shop in town. The Bananas Foster is ","useful":1,"cool":1},"MBtNbluL7CfJ06R1tAICnA":{"text":"This is the best place in New Orleans to get a Sno Bliz. The owner of the place was so nic","useful":2,"cool":2},"_wmHY6iH_VJbPQS5EY_YAg":{"text":"Came in from San Antonio for the weekend and I made sure to stop here. The line was long b","useful":1,"cool":0},"aTS4aEsaus0jtgc6FYgulA":{"text":"Always my favorite place to get a snowball but this last time my husbands snowball was a l","useful":1,"cool":1},"r1R0WYjQBV1MyGVJSVidCQ":{"text":"If you're visiting New Orleans and want to try a snoball, this is the place to go. We went","useful":1,"cool":1},"UFcHnemuYsyYnOLbTW2jWQ":{"text":"Ok, here's the deal, I'm not much of a snowball connoisseur bc Froyo is my go to when it's","useful":10,"cool":10},"pp6TkguwNrj16MRG9yF9fw":{"text":"If you want perfectly shaved ice, then you've come to the right place! The texture of the ","useful":0,"cool":1},"sSlMY_EHTGPmr1FcxjWmcQ":{"text":"It's not Hawaiian ice but it's still good! I L.O.V.E Hawaiian ice so I was excited to try ","useful":2,"cool":1},"TXT5RCApcewgEcFJA1XEBQ":{"text":"My first shaved ice place while on vacation in new Orleans and I have to say it was a deli","useful":2,"cool":0},"Z5EnaCy9_FGcHkopRsK0Bg":{"text":"Hansens will not disappoint you! I waited 40 minutes one time for a nectar cream snowball ","useful":1,"cool":0},"FBnD-9tWgYgSOHqWmdEKPw":{"text":"Absolute amazing! I've never had finer ice, sweet with friendly service such as Hansen's. ","useful":0,"cool":0},"FoDHCmJx1R6rTsueKKfK5A":{"text":"Easily the best snowball I've ever had! Hansen's Sno-Bliz is awesome and is a classic plac","useful":0,"cool":0},"UlnoyFKwmNXgFCKCaHR90Q":{"text":"I wanted to come here ever since I saw Anthony Bourdain visit on TV. It did not disappoint","useful":1,"cool":0},"5GNSS64SCh87bOUlJ0qX4A":{"text":"I don't really have anything new to add besides the things that others have already said. ","useful":0,"cool":0},"8AolWuHFsFcJp836o1ehBA":{"text":"Tried the small satsuma with condensed milk and whipped cream. It was good but it started ","useful":0,"cool":1}}