{"v85lSPM-yEsj6bb87vKBaQ":{"text":"This is simply a great value. \n\nSure, quarters are a little close but the charm factor is ","useful":0,"cool":0},"Ad3rpeJBA4Fams_Uup_DXg":{"text":"Each star represents the two things I liked- the bed and the breakfast. \nWasn't crazy abou","useful":1,"cool":0},"vDfizmf1iZdV0Lh2Cf6P8Q":{"text":"Zak was a fantastic host -- in touch with us all along, answered all our questions, went o","useful":1,"cool":0},"nNo6XJ3FuOUdsxIkSNwzlg":{"text":"Great cozy place.  The owners are awesome and accommodating.  Would recommend to everyone.","useful":0,"cool":0},"_ROyjPDIkAX0m7GV3ZgTSg":{"text":"Very friendly and accommodating. The owner really went out of his way to make our group fe","useful":0,"cool":0},"w_-dHF95zb6dHmzA-E1DGQ":{"text":"We arrived around 2.30 pm.It took them 15 mins. to find our room key.Room was very small,b","useful":1,"cool":0},"jiC-_ltMVhTBWlaKaZn6vA":{"text":"When we arrived to our room it wasn't clean, the lady whom showed us our room said she was","useful":0,"cool":0},"zsQu9W5B1hwqSUMuXmtvBQ":{"text":"Sack makes it all alright and is very Profesional and deals with issues in a very calm way","useful":0,"cool":0},"UfZ5cY92Lp__YpR-P4Vqtg":{"text":"We rented the whole house and it was amazing!! Big beautiful rooms, perfect location, frie","useful":0,"cool":0},"N7Mwf7psPJRSq1QqxYTLIg":{"text":"When we booked this place in the Marigny district (not far from the music clubs on Frenchm","useful":0,"cool":0},"U8DDRh6uZ2YZMGr6ebbUbg":{"text":"I love the atmosphere of this place.  It's a renovated house with key pads for door locks ","useful":0,"cool":0},"aq3-exSALmQ9Bfwl06vHWQ":{"text":"My room is absolutely beautiful and so tastefully decorated. Courteous and helpful staff. ","useful":1,"cool":0},"pg09cgusSdtwcMpqceE76g":{"text":"I stayed here for a week when I was performing at Marigny Opera House. Staying at this B&B","useful":0,"cool":0},"6WH1A4nh-BYd8bZOvc4zvQ":{"text":"We were actually in the house next to the Balcony Guest House (run by Balcony Guest House)","useful":2,"cool":0},"YkMycPr6Crpc7S0lrSz9aw":{"text":"simple, clean, and has balcony.  \n\nno big time frills inside the rooms, but the balcony?  ","useful":3,"cool":1},"mBedgkDJJ9mR05SGJK9BlA":{"text":"I stayed here in January and was very happy. My room was very clean and the people who wor","useful":0,"cool":0},"YH7EETujiCNZ-uawGriaIQ":{"text":"i was skeptical at first but once i arrived i knew we made the right decision.  don't expe","useful":1,"cool":0},"puJk6CrbYlzrM1UnTGy7jQ":{"text":"Want to go to Nola and see the real Nola?!?!  This is the place. This place was located ju","useful":2,"cool":1},"4lB2QQzVOW2PDQsuzbp9Iw":{"text":"We very much enjoyed our stay at the Balcony Guest House.  We arrived around 1:30 and deci","useful":0,"cool":0},"jlkQ-8Dtu37-28VrEYJCZg":{"text":"The short: I wouldn't call this a bed and breakfast, yelp! Felt more like a boarding house","useful":1,"cool":0},"jTX1jY7jvQrztRiHX9gfmg":{"text":"It seems others were unhappy with their stay here but I was nothing but pleased. The custo","useful":0,"cool":0},"BkGPhD6ze44C0tUMHoMTqQ":{"text":"Clean, bright, tastefully furnished, perfect location. There isn't a better deal in the Ma","useful":0,"cool":0},"Recvpaw2EUpC-gf-8EXL_A":{"text":"Not the Droids I was looking for...\nWhen I travel, I expect a certain level of service. Th","useful":0,"cool":0},"NwmJ_LvovkQctiqXW_rCKw":{"text":"We are staying here a few nights while playing around in NOLA. Very nice B&B and reasonabl","useful":0,"cool":0},"JZVMqyr6Dmv442qyA_W1_A":{"text":"This place was super hyped by my friend so I had high expectations. \n\nNote, we came on a S","useful":0,"cool":0},"WpUMOokDBD9L7sMUkffmvQ":{"text":"I never reviewed this place because I wanted to bury it in my mind. Me and my whole family","useful":0,"cool":0},"NceHWrAZ8mPM6N9AxPKwWA":{"text":"This place is great! Will defiantly come back here when I visit New Orleans. Rooms were cl","useful":0,"cool":0},"R2arqfFKZrpgvoFfZJRPEA":{"text":"Zak and Naz were amazing hosts.  We called to check for availability at the Balcony Guest ","useful":0,"cool":0},"0ADeqEuJWinIj25fe3Du5Q":{"text":"It was VERY DISAPPOINTING! The room was dirty, and poorly equipped (had only wine glasses,","useful":1,"cool":0},"SDQd4PkdjZW55LQU3wfiSQ":{"text":"Pros and cons review: \nPros: I stayed in the owners suite which was nice. It had a comfort","useful":2,"cool":0},"7wBpDwNny0nlQIGYnWm38Q":{"text":"First let me start by saying the location was not a problem. Fantastic location and nice l","useful":4,"cool":0},"KYj9q3eR0cd3JVGPWH93lA":{"text":"I recently stayed here one night and had a great experience. I checked in at the Silk Road","useful":0,"cool":0},"GrL36vSlSf03l9b307Ic8g":{"text":"Loved the house and the whole room arrangements! Our group had a blast. Most definitely wi","useful":1,"cool":0},"y3G38lcFHSvhzrzTfmOdSg":{"text":"BAIT AND SWITCH. Room 8 is a little closet of a room advertised as a queen bed and has a f","useful":0,"cool":0},"DfE4PTcloxuV4gFrbs9zbw":{"text":"I read reviews on this site and others regarding this place before I booked. Some scared m","useful":0,"cool":0},"IA1K5gCdHm_NFq94ftYR_g":{"text":"This place is absolute trash! I reserved a room with a balcony, but when I checked in it w","useful":1,"cool":0},"yonf4mRJl1Kx6TZpnc4vSA":{"text":"Great place to stay, central location for walking, catching trolley car, etc. We parked th","useful":0,"cool":0},"bThiueE3HbQ6S3LwlPexaA":{"text":"Loved this guest house. It's in cool neighborhood, it's antiquated, nice rooms with four p","useful":0,"cool":1},"XVMCWvpCvexuYrtN9HjFUw":{"text":"I am truly never one to complain unless absolutely necessary, but this facility really ups","useful":2,"cool":1},"gkw_rkMcgPTo_gCX-lahuA":{"text":"We checked in on a Wednesday and Checked out on a Friday. We came out on a spontaneous spu","useful":0,"cool":0},"kBFh7zMzY95tXkaw0hrFZg":{"text":"SWMBO found this place and booked it before I had a chance to check it out.\n\nMy first impr","useful":1,"cool":0}}