{"tUIAhiH13Mp9lrL0ST69Yw":{"text":"Had a great time at this neighborhood bar. Very friendly and relaxed atmosphere. Good musi","useful":1,"cool":2},"_MlcW41_QMeCoRu777aM6g":{"text":"In keeping up with tradition, it's time to make a shout out to all of you coming down for ","useful":3,"cool":1},"BUn9DOXFNfKrkoWX-SMd9Q":{"text":"The reviews on here seem to paint a scary picture where you may not feel comfortable seeki","useful":6,"cool":1},"ynVcjL-BqQycBb6Rmk8qgA":{"text":"My favorite bar in New Orleans!  Friendly staff and even the customers are very friendly. ","useful":3,"cool":2},"PUlvsYRbzj9zFIOCFqMdwg":{"text":"The raunchiest, hands down, of the gay bars in town. The upstairs is something out of Denn","useful":5,"cool":5},"7CHJ_cvoHToSAWwO2zog4g":{"text":"I didn't get to spend as much time here as some of the other bars in the city which will b","useful":8,"cool":2},"Sdmm36UF1GWPLKVSsK_gAw":{"text":"Oh okay this place is a must visit!!! I know you thinks its off the b.street. but it is wo","useful":3,"cool":2},"UBkTscdl03Gcz5_67a87Mg":{"text":"My husband and I both had a great time at this bar, a lot of nice people with lots of acti","useful":3,"cool":2},"SFomtRJSoNAHzAeeRPDkpA":{"text":"If you like a no-nonsense bar with affordable drinks and friendly bartenders, this is the ","useful":0,"cool":0},"D3nTiI6nHUvri7HYnGU3hQ":{"text":"These guys, and this bar, have rep'd my tribe for a long time. For those well adjusted hom","useful":1,"cool":3},"fhG1azr2_Qu9RNY5iefsXg":{"text":"God, I don't know where to start with this place. \n\nThe first time I ever visited New Orle","useful":6,"cool":1},"0oUt47j0X2qethy4GbVbZA":{"text":"This was a great bar! I found the patrons and bartender downstairs to be cranky. Upstairs ","useful":0,"cool":0},"FF3x2COdJzdiffVksQP2gQ":{"text":"Beware of thieves who pick-pocket.  Had my wallet stolen out of my front pocket.  Bar staf","useful":5,"cool":0},"xi0TFVefENJdhawv6Z3wWw":{"text":"My 2nd time was better than the 1st time. Lots of fun upstairs !  Had my hands full, if yo","useful":3,"cool":3},"-EhmUxlyo-08tCSAwKWDJQ":{"text":"I visited while on a business trip in New Orleans. The downstairs bartender was friendly a","useful":0,"cool":0},"YBbDc_Cx2xVYlW6WKJFL1A":{"text":"The bartender downstairs made this amazing $4 Beefeater cocktail that changed my life. He ","useful":3,"cool":2},"bJpCj2gAX4Eu4Kza59lWPA":{"text":"I think Wayne may be the sweetest bartender I've ever met in my life. Super rad dive bar,,","useful":0,"cool":0},"ZzOaQpQaMhxhQd_4lla49Q":{"text":"The Phoenix is a fun bar I visit each time I'm in town. My first time there I went with a ","useful":8,"cool":5},"6kDohgRAMAUULqVlMVHmQw":{"text":"Very unwelcoming patrons. Never been to a gay bar so intimidating and unfriendly. No women","useful":1,"cool":0},"vNwRz0hoDG5D8qf0djfxRQ":{"text":"Maybe I visited at the wrong time, I didn't see anything special about Phoenix other than ","useful":1,"cool":0},"ZXhZLImvMNitttlxHXhI4Q":{"text":"Mike is the best at this bar... OMG do glad I came out tonight to have a drink... He and I","useful":14,"cool":14},"MFrc_tlbE5AS_G58i0iO3A":{"text":"I went in here the other day and it was very nice to see that it was me and one other guy ","useful":5,"cool":6},"ZdlHIhCBEFBycGCtFyQbnA":{"text":"I live in the neighborhood and have for years. Due to being married with a kid, it is extr","useful":0,"cool":0},"bPvnfuIXh3XvzKTT5ivquA":{"text":"Great neighborhood Gay Bar w super friendly bartenders including the oh so handsome and fr","useful":8,"cool":3},"L4aNTpRFaUs5_ctDxpICBw":{"text":"One of the best and fun bars in the area. The minute,you walk in you feel welcomed by the ","useful":0,"cool":0},"db8vdv5V_Y87iShjB6lHNA":{"text":"I like the downstairs bar (Phoenix) as they have events for the patrons.  The staff is fri","useful":3,"cool":0},"k_JYrZDbqOAjZJB8rGAliQ":{"text":"DRAG QUEEN BINGO with the Sisters of Perpetual Indulgence. What a BLAST! I think I gave th","useful":5,"cool":4},"bIan-98cEKcv1-jV21fBJw":{"text":"Well this was an experience for sure.\n\nThe one thing I'll say immediately is that the Phoe","useful":10,"cool":11},"g4DrHz0oDPThcW5SffplZg":{"text":"This sure was an unexpected but wonderful find! A group of friends and I wanted one more d","useful":0,"cool":0},"n0UI9YmomW8jNzjSVI2w1w":{"text":"my BF and I found this place after asking around.\nit was a half hour walk from the French ","useful":4,"cool":2},"uOhZ__08RDxq_3tXgB7qYw":{"text":"My favorite bar in New Orleans!   The drinks are awesome, always feel welcome.   And upsta","useful":2,"cool":1},"IlmbbAQfBgMG5rjd1qcu8A":{"text":"Lives up to it's reputation.  Warning- not for the faint of heart, or close minded. Went w","useful":2,"cool":1},"6e1HKBYB-n6lusZrU6JdhA":{"text":"I'm giving this place two stars because of the patrons. DO NOT go if you're a female and d","useful":3,"cool":1}}