{"kQeI404ouupMI3xJcIHlgg":{"text":"Our experience here was amazing! We surprised our dad, a plane enthusiast, with a flight t","useful":0,"cool":0},"iavFc4x6pi2ZqO0t17y-PQ":{"text":"Before I bought a Big Easy Aerial Tour for Two from Amazon Local, I checked this Yelp page","useful":0,"cool":0},"wGfiIoXwOYAjtYZc9tufoQ":{"text":"For my sons 30th birthday we gave him the evening aerial tour of New Orleans and I couldn'","useful":1,"cool":0},"yGW4-5MhJgbXM2UhmaOx4g":{"text":"What a great day to take our Big Easy aerial tour!  \n\nMy boyfriend and I received the 30 m","useful":0,"cool":0},"RqjXegH2ixA4iPNeUtLObg":{"text":"I went and did the orientation flight lesson today and it was great! Good staff and traine","useful":0,"cool":0},"xFh0Iv07wxnWf9vvDczrkA":{"text":"Great experience!  I did a introductory flight with a friend.  We asked if we can do a cit","useful":3,"cool":2},"_Psov2sm0CR0RIlgub0gqA":{"text":"Everyone should do this atleast once in their life. It was so awesome to see everything. T","useful":0,"cool":0},"UryDuT6ZGRDYka3pfzKwQw":{"text":"VERY VERY PLEASED WITH OUR EXPERIENCE!!!!  My husband and I did the 1 hour Big Easy Aerial","useful":0,"cool":0},"iuwd-hOvbQP5_qo-w3c_RQ":{"text":"This was an excellent experience from start to finish.  We walked in the door and instantl","useful":0,"cool":0},"2uZaYgvtzXA56beShqcUnw":{"text":"I had a wonderful experience on my trip to New Orleans when I picked up the Groupon for a ","useful":1,"cool":0},"p3hcgG-7SjdRp3l8mLpwvg":{"text":"Our flight was amazing! .  Our pilot Corey was very knowledgable and explained everything ","useful":1,"cool":0},"nepIqyEZ_muVg8aIFNgj4w":{"text":"I paid for my girlfriend and I to go on the 45 min aerial tour for her birthday. I've been","useful":1,"cool":0},"xlRYZgdXcfYtdpol_ygo7w":{"text":"First off, if you're thinking about doing this but are scared, just do it! I booked the to","useful":0,"cool":0},"TPJZnIxiCZjBbYNc-hTsbQ":{"text":"This was a long time in the making. I have been used to flying all my life and I have foun","useful":0,"cool":0},"m2LUrltWrATYuTMBuptUEQ":{"text":"This was by far the best experience ever!  The pilot Wade was soooo nice and cool and made","useful":1,"cool":1},"quxClsPX7Izk-I35wJnyLw":{"text":"My husband and I took the Big Easy Aerial Tour and it was AMAZING!  Our pilot was great an","useful":0,"cool":0},"iPgM23RZXjRNQs2oactUFg":{"text":"Great experience all around. Perfect for couples and comes with champagne service.Trent, o","useful":0,"cool":0},"B5NTVsRzTi_tGfRUWgzWmg":{"text":"Such a great experience. We had a minor delay due to the weather, but it was all worth it ","useful":1,"cool":1},"R9aXSGVagdVhf-We6oP3bw":{"text":"This is one of the best experiences I have had in my life. The ladies in the office and ou","useful":0,"cool":0},"has-lGSIC3kiI_hPMktH_A":{"text":"What a wonderful way to experience this beautiful city! Our pilot, Emerick, was profession","useful":0,"cool":0},"2CnZ1XT9RNgaciIdsgm0mg":{"text":"All I have to say is that Gaiten Howard was an amazing pilot and she gave my boyfriend and","useful":9,"cool":9}}