{"cBcinjFQRwzWO6-SjVxK-w":{"text":"My girlfriend and I came to try this place (we were on a short Vacation) because they had ","useful":0,"cool":0},"LZI2Dn-7bxPETvBCtpFLyw":{"text":"Do not go here!! Food mediocre at best.\nService terrible.  The waitress ignored us, bottle","useful":3,"cool":0},"V1KNf9j4BdbAhDboBKihrw":{"text":"Over priced for mediocre food. Wedge salads were over dressed without any visible bacon. M","useful":0,"cool":0},"1ol1KQcIv2Wx6bl4An-tEw":{"text":"Great great great char broiled oysters and superior service from Eric. Pretty court yard d","useful":0,"cool":0},"lr09Zw4DWMw8NRWR3aaysg":{"text":"The jambalaya, red beans and rice, and red snapper is so great. You can't go wrong when or","useful":0,"cool":0},"OSpEZUtnqHnXqAEQ53KiLg":{"text":"Wow Lunch was simply AMAZING.I had purchased a Groupon  before my short visit to New Orlea","useful":0,"cool":0},"uTgtof48vQR6dTf0gEWNWw":{"text":"We had a Groupon so we came while on vacation from Los Angeles. So glad we did. Best meal ","useful":0,"cool":0},"QdcZDIfGzw1WvGUKkceyNA":{"text":"We have walked by this place several times over the last few months.  Somewhat new, it nev","useful":0,"cool":0},"zd-aRgtOluET7_0cE0Hjag":{"text":"First off I wanted to start by saying how friendly and inviting the staff were to us on ou","useful":0,"cool":0},"z7YoHnwsGolAiiQDgJ9v8A":{"text":"Really fantastic food, solid drinks, and mellow atmosphere made this an easy place to love","useful":4,"cool":1},"ClI0X0hyINK0LC1Cmw-vwA":{"text":"Great service ,fantastic atmosphere and the food is delicious. Recommend the Bourbon stree","useful":1,"cool":1},"lvyiQYkDQQUmBvsYzrcHfQ":{"text":"Stopped in here quite by accident after being frustrated with several failed attempts to g","useful":3,"cool":2},"yVB8Y3_eVmxNwyD92jRCtQ":{"text":"The food was incredible, the hostess (black female) not so much. We walked in and her wipi","useful":0,"cool":0},"8CmAQqu5_0fql_4JU9LThQ":{"text":"We had a Groupon so we came while on vacation from Los Angeles. So glad we did. Best meal ","useful":0,"cool":0},"XJRSqposXw_C4ifhDhPccg":{"text":"THE BEST FODD IN ALL OF NEW ORLEANS!!!!! I have searched for what imagine to be the most a","useful":0,"cool":0},"5_T5_GTNMhAvq7THiLARmQ":{"text":"Beyond question - you MUST get the grilled oysters (Heaven in your mouth ). We were in the","useful":0,"cool":0},"8WiThLY6poqcBLyQ-9lO7A":{"text":"The food was good, but the service was AWFUL! It took 30 mins to get appetizers and 1 hour","useful":0,"cool":0},"9cnlMtjyevDDX7HQr1caVg":{"text":"Excellent Redfish and crab which came with potatoes and greenbeans.  You can get it fried ","useful":1,"cool":5},"AkQerJclijGi1Bqnnb-U5Q":{"text":"While most of the experience one has at a restaurant deals with the food, there can always","useful":4,"cool":0},"N055HwitzO9cwlvkiXgz_Q":{"text":"Try the chargrilled oysters-they are EXCELLENT! We sat at the bar and the people are aweso","useful":0,"cool":0},"_JY-p2pEB81mnvDCQMwoAw":{"text":"This place was delicious & had a live entertainer - Spring! He was the cherry on top to a ","useful":0,"cool":0},"iFRlSwCkM_y93ZAbPwrLqw":{"text":"Of all the places that I have eaten at this past week, this place is by far the best. It h","useful":0,"cool":0},"YaFZ4cniZVOkkKD_-wuwxA":{"text":"It was Sunday evening and all the well-known palaces of New Orleans cuisine were closed.  ","useful":0,"cool":0},"JmSmzJE5y0xFP-IHzDsn2A":{"text":"I've come by twice this week! Highly recommend the baked oysters and blackened redfish. Wh","useful":0,"cool":0},"aBsyeoOD-PDRY_M1-66qJg":{"text":"We were eagerly anticipating dining in this restaurant.. The reviews, blogs, etc.. seem to","useful":1,"cool":0},"T3kkLG5jNc8GaI3UeEX0iw":{"text":"Fantastic food - we had grilled oysters, gator bites and fried pickles. \n\nI was honestly i","useful":0,"cool":0},"TCug4OusEwO4cPHxBq8yWA":{"text":"The best place I've been to for a real taste of New Orleans. Make sure you get the taste o","useful":0,"cool":0},"zgvwPjZFSvsRgjwkjE7IOw":{"text":"Maybe it's because I'm from the Midwest or maybe it's because this place's jambalaya just ","useful":1,"cool":0},"i4bIdBZ0MiXtbsSSzvxo-g":{"text":"We sat outside here and it was lovely! Great food, we had the taste of New Orleans and I l","useful":0,"cool":0},"kvd1spIpKHgpz-G40VJoag":{"text":"Short on time with your New Orleans edible bucket list in hand? This is your jam. The shri","useful":0,"cool":0},"DK3QAlsTRw7MkrImpBog6A":{"text":"Ordered steak for me and broiled fish for my wife. The food was cooked right but we both t","useful":0,"cool":0},"N--yCFWEurUKxN4UV0AaAg":{"text":"My husband and I had dinner reservations elsewhere but were walking down Toulouse Street l","useful":1,"cool":3},"uGdPwSWPUsb7YZ0hv105Xw":{"text":"Loved it!  They made my husbands birthday perfect.  Great food, friendly people, even live","useful":1,"cool":0},"2ncNpt45KT560tTOyh-f-Q":{"text":"First let me start with the door guy. Very welcoming and had me very excited to come in!  ","useful":0,"cool":0},"bUs90-RsEVQcxwlu7xMgFQ":{"text":"Excellent! Had the shrimp n grits and char-grilled oysters. Honest to God - One of the bes","useful":0,"cool":0},"03zWBOM_ZLfNQME61Gtx8Q":{"text":"Happy hour was great. Chargrilled oysters $1.00 each, raw 50¢, from 3-6pm. The raw bar is ","useful":1,"cool":0},"DPhbrWKHF_UTEohukMde8Q":{"text":"This was our last dinner in NOLA and one of the best. We were seated in the courtyard, whi","useful":0,"cool":0},"S3kRfo2TldOW5h-A_CfOzg":{"text":"$0.50 raw oysters, $1.00 chargrilled oysters everyday from 5pm-7pm. Great service! Bartend","useful":1,"cool":1},"YG4vZf-Zn1xl1LTAUuLsyQ":{"text":"Delicious food! Great atmosphere and excellent service. Ordered the vegetarian jambalaya. ","useful":1,"cool":0},"ES61zezbTKy6PZQjdOke_Q":{"text":"We went for Happy hour on 6/28/16 because my daughter had a Groupon for $40.00 worth of ap","useful":0,"cool":0},"oKBUNXy9PU4kJ23A9kbwwA":{"text":"Awesome! Amazing place, super friendly and very fun. We ate in the bar and watched oyster ","useful":0,"cool":0},"d7A8Mx6jHrPbTpnxvQ6jnA":{"text":"With the live music and old charm this place was a win! Taste of New Orleans and the Shrim","useful":0,"cool":0},"HPFnlp3OITre0sBL9cr5tQ":{"text":"Beautiful venue and courtyard. Live jazz! The service with Shane was a great. We had bacon","useful":0,"cool":0},"VTDkPzksqFAHSerP1WHB5g":{"text":"Wow.. $$, food, entertainment ( this guy Spring was out of this world), outdoor courtyard ","useful":0,"cool":1},"-OOX0wAc230FKaMzs5wunQ":{"text":"Had a wonderful experience at\nNew Orleans Creole Cooking!\nJazz brunch , beautiful courtyar","useful":1,"cool":1},"XIp0IrC_7avJbwC7XCS74w":{"text":"The service here was fantastic the food was incredible. Sabrina made our time so great her","useful":1,"cool":0},"XeoGvEaXiUyyg8NjAjxZ8Q":{"text":"I didn't know I liked oysters, but tried the charred ones and after the first six, ordered","useful":0,"cool":0},"epL9YaOIV2CpWfCdyGzPcw":{"text":"Lovely old building. Environment, and music is reminiscent of classy old New Orleans. Food","useful":0,"cool":0},"YDXDVVzVxigjMaErBhYzTA":{"text":"What a great restaurant. We sat in the courtyard and our waiter told us stories if the gho","useful":0,"cool":0},"FqPMRCvRRu-cs71GbjO21g":{"text":"Stopped here for lunch. The food was very good and the oysters were fresh. We had red bean","useful":0,"cool":0},"8YygUNqvyHRILyu5iLaDtw":{"text":"On entering the building we were greeted by a kind gentleman who seated us in the courtyar","useful":0,"cool":0},"suY5EMkjIhOVJnbg35Z6aA":{"text":"Just order a dozen char grilled oysters per  person.  Anything less is uncivilized.  Also ","useful":0,"cool":0},"14iEJ3go6Z9V9N4VhrYvNQ":{"text":"Sorry to say that I would love to give this place four stars for the food, but the night w","useful":0,"cool":0},"Wn5UrmAkNVubquKhuSwx8w":{"text":"Okay...walked by after a great breakfast at Stanley Restaurant and saw the \"Wednesday 1/2 ","useful":0,"cool":0},"cLxcL8d4-8y0eWB9UOnsbw":{"text":"This was our first stop upon arriving in New Orleans. Found the restaurant by using Yelp a","useful":0,"cool":0},"kTgEuXLakMj8M1BsPLMpxw":{"text":"The service and food were impeccable! Angelle was friendly, gave great recommendations and","useful":0,"cool":0},"lbMmbeKX_fCITsIHdDdJ4Q":{"text":"Food was good but the staff was horrific!! The hostesses were dressed in sweatpants and th","useful":0,"cool":0},"sXtzSPhvra5BhHh69G9WaA":{"text":"Whaaaaaaaaa????????? Did I see a vegetarian jambalaya?!? Oh yes I did! It was fantastic! I","useful":2,"cool":2},"rk81s5B1lgg1OItVwoWCrw":{"text":"The New Orleans  Pasta was delicious.  The pasta had a wonderful aroma. \nWe had a very lar","useful":0,"cool":0},"i4dQv8srIC0qqwfqS5M-nw":{"text":"We ate dinner here our last night of 5 nights in NOLA.  Sat in the court yard and enjoyed ","useful":0,"cool":0},"Hq6tRgBiIR7xaXnzUwI1Og":{"text":"Spent a week with friends and family in NOLA. Hotel recommended the Creole Cookery our fir","useful":0,"cool":0},"M_CVmEWDyfWH0x3UUwgOjA":{"text":"Hate to say it, but this place should be better.\n\nWife and I ate dinner here last night, l","useful":0,"cool":0},"WlY7AUPYMStB66PBVRPOkw":{"text":"Jack and Spring are a dynamic duo!!!! Celebrated my birthday here and they made it one to ","useful":1,"cool":0},"GBRtxomhMselk25adDPDyg":{"text":"We were a group of 5 ladies who actually had a great meal in the courtyard.  I got a sampl","useful":0,"cool":0},"5RWaXt5_7E7t3f7xHrWUYw":{"text":"Basically just horrible service . There was a moment where our food was placed right next ","useful":0,"cool":0},"ZWdIm7_SsSK3FoBEeTEWTg":{"text":"New Orleans Creole Cookery\n\nAlmost walked by this gem of a restaurant but caught the court","useful":1,"cool":1},"Ydiu1vFlb55IBsswV92lpw":{"text":"The food and atmosphere was amazing!!! I had the chared oysters and fell in love, it was m","useful":0,"cool":0},"ds-dzDhF5LhIArzN2LRtUw":{"text":"The food was classic nola very good but I'm really giving 4 stars because of our waiter Do","useful":0,"cool":0},"N9r5_5_1I_T3fi-PMllLEg":{"text":"That Happy Hour here tho! \n\nYou have no excuse to not eat here for Happy Hour when in the ","useful":2,"cool":2},"QgVjUalqhb7Lm7QXHGNltQ":{"text":"A great quiet haven in the heart of the French quarter. Food was delicious, service was am","useful":0,"cool":0},"5MqB1WB3Zlog5IGDHJxi4g":{"text":"Got in to New Orleans around 8 on Monday evening and by the time we got out to eat dinner ","useful":0,"cool":0},"YuQ42jMP8eJimmvRchSTDg":{"text":"The host pretty much dragged a group of me and my friends off the street as we walked by l","useful":0,"cool":0},"IgKvrApDeMbR213_UeRb8A":{"text":"This is probably the worst food I've ever had twice and was forced to eat the second time.","useful":0,"cool":0},"nZOszw2geou8Yn_6APUucA":{"text":"This was my first visit and I will be back! Wes provided an AWESOME orientation to the res","useful":0,"cool":0},"mIoWoKqzh8iFZjAf1QlASw":{"text":"Went over spring break, restaurant was empty, should have been a sign!  I was really let d","useful":3,"cool":0},"tyHsE7qduOriG7Y_v3Dz2w":{"text":"Found this restaurant on Groupon. It was very flavorful. The staff was excellent in meetin","useful":0,"cool":0},"te9ZA2V69RrkPDAoW4pzJw":{"text":"The jambalaya was some of the best I've had, but it stops there. The bulk of their dinner ","useful":1,"cool":0},"_Of66DTcd5L0Q6zqjcbg_A":{"text":"Everything we had here was really good and the entrees were a good value as the portions a","useful":0,"cool":0},"P4jQgoy5HAIDWhXpDy3sBA":{"text":"Great food, terrible service. The entire wait staff seemed disheveled. We were promptly se","useful":0,"cool":0},"CB_v14PlV0XpBMSlcD8-mg":{"text":"Ok first of A.J, hats off to you sir..... We were in town on an impromptu mini vacation. N","useful":2,"cool":0},"hN2_ki-AuhXZIy8u0s48pw":{"text":"Great spot in the French Quarter. It is kid friendly and just friendly overall. If weather","useful":0,"cool":0},"kfs0DQC8XTLLScRIG5RA4A":{"text":"50 cent raw oyster shooters and dollar grilled oyster with a purchase of a drink? Fantasti","useful":0,"cool":0},"Mk-HOuVLCmp37JipthpjXQ":{"text":"Food came fast and was good, it was on the pricey side though. Sue, our waitress, was quic","useful":0,"cool":0},"3gxuZyG03ybNRGr33Q_4sQ":{"text":"Good service and Nice fried pickles; then crawfish étouffée that was fishy and tasted like","useful":2,"cool":0},"OD_lTysir9TByol-VT1MJw":{"text":"Ate here for lunch right when I got to New Orleans after reading reviews-wait staff friend","useful":0,"cool":1},"EUZEz0hdl0zD3Ul8hM_Lyw":{"text":"Waiters extremely nice. Catfish was fresh and tasty. We tried the alligator and the kids l","useful":0,"cool":0},"3LHHLrpiDrNgEeH1_7AS_g":{"text":"Had Jambalaya starter and gator bites. Gator bites were delicious with good portion for a ","useful":0,"cool":0},"_a4gZ7vFsoC3_YzOoAevvg":{"text":"I've been here maybe 15 mins and I'm already in love! Our waitress Sabrina is so bomb, she","useful":0,"cool":0},"RKRlgN9Q-FqVSuqNaC1KUQ":{"text":"We came in the right time (8pm) before it got busier. We were kinda full so we didn't orde","useful":0,"cool":0},"6kXyWF3vRMRsvpAlyC8UAg":{"text":"Great restaurant on our walk from cemetery tour. \nGator bites were in sausage form and so ","useful":0,"cool":0},"GZuNv1UJZPIbcg86HVC4xg":{"text":"I had the gumbo and the Taste of New Orleans. They were excellent! The hostess said they w","useful":0,"cool":0},"t3wcaFlrMZQmU4uaIRhsHg":{"text":"The 5 stars starts with Will, our server. Without his wonderful personality, we wouldn't h","useful":0,"cool":0},"rx3Ivi1hyMmz232BjdnWfA":{"text":"Food and service was amazing! Their calamari was soooo delicious- loved the spices in it a","useful":0,"cool":0},"WtBXaJ5puj88RL_kymjy1g":{"text":"This was our first time here and the Food was absolutely amazing. The service was impeccab","useful":0,"cool":0},"zSdc7c8zozdH463gsv5Ipg":{"text":"Courtyard is beautiful. The food we had was pretty good but not the best - but we only got","useful":0,"cool":0},"DVfepKaKNIsQczpG4_brsg":{"text":"We just had the best lunch ever at this place off the beaten path!! There were 15 of us wi","useful":0,"cool":0},"z1JenoDOGvXDH4oLLRAqIQ":{"text":"This place is perfect for first timers. The oysters are top notch. Service is warm and fri","useful":0,"cool":0},"sjSPsc1hfYt-A6XUt_0kJA":{"text":"Hole in the wall with good food and great service. I recommend the alligator bites! We had","useful":0,"cool":0},"pddW162Yyetphv4u_3zUwA":{"text":"Great ambiance, but the price of the entrees did not match the quality or taste. We visite","useful":2,"cool":0},"I3FHJ8myruHVs2lLDOub4g":{"text":"The BEST experience I've had so far while visiting New Orleans great ambiance, amazing foo","useful":0,"cool":0},"4t6LARnOjoAtjOEfD6qe_Q":{"text":"Came here first time on a tour and got some history about bitter woman ghost love relation","useful":0,"cool":0},"ppmM-jdKAniQKyNHTSKpzw":{"text":"Had a great experience dining here tonight! The service was fantastic and the food was del","useful":0,"cool":0},"C-dfTiiWM1Hke1QUFJv-hw":{"text":"I am doing this business a favor by giving a star, they deserve 0 stars! While the food wa","useful":0,"cool":0},"88geIH4SU9-ehMdW5VJX8g":{"text":"Wish I could remember my waiters name, he was super cool and knowledgeable. He recommended","useful":0,"cool":0},"ai1hFPVcVgiJb2FY57dwug":{"text":"We had higher expectations of this place.  Food was just Ok...shrimp n grits was average -","useful":0,"cool":0},"_7BgzNiDHCclT4VIxyK_Kg":{"text":"It's over priced food. Not at all for vegetarian. They have a couple of options but you wi","useful":0,"cool":0},"AG3VfyKTDCxcsCao-5LVAg":{"text":"Ask for Kevin as a waiter! Amazing dinner and drinks. Highly recommend the voodoo drinks","useful":0,"cool":0},"eX3G9AaBKBG2MiXZCoH7BA":{"text":"For how the outdoor place was set up, I would say its OK but I find it kinda uncomfortable","useful":1,"cool":0},"EK9N-Fg--dNRkaZwXr2ujA":{"text":"Boiled seafood pot enough for 2 1/2 people.  Everything was awesome.  Music drinks jambala","useful":0,"cool":0},"KSazzmlSGTKJHQsZY_HeVA":{"text":"Omg! I bought a groupon and we came here for dinner the other night during our trip and it","useful":0,"cool":0},"KPF4seFfDl1lzqo5rLAJWA":{"text":"Came here for lunch on my last day in NOLA and it was well worth it. I had the taste of Ne","useful":1,"cool":1},"5fdfGNhfp9haod3y07ggdQ":{"text":"Ordered the redfish almondine. Never had anything like it. Super crispy and flavorful from","useful":1,"cool":1},"tvJmwTZzJQcTaZq2laXsZA":{"text":"One of the few restaurants that offers a vegetarian option of a New Orleans classic...Vege","useful":0,"cool":0},"s5hParJl5LABxAR1wQt9FA":{"text":"Food came fast and was good, it was on the pricey side though. Sue, our waitress, was quic","useful":0,"cool":0},"9huY06BnJYkmH4pmKGPykA":{"text":"Came here on a Groupon with a friend and what began as a wonderful night turned into a nig","useful":0,"cool":0},"4hDfVdqE4nyf5x2Lt4sdxw":{"text":"A must try if you're in NOLA!\n\nOur server Sam provided great recommendations and we ordere","useful":3,"cool":0},"HmK8VpZ-vh6kPoHIkbndqg":{"text":"We ordered the crab cakes and the shrimp. We were dissatisfied with both entrees. This res","useful":1,"cool":0},"7Mu95GvWkD2JroEM06_GXQ":{"text":"This is a cool little restaurant in the French quarter. Live music was good while I ate. G","useful":0,"cool":0},"LQ6XKJm6aSI6C0ueOI2FXg":{"text":"Thank you yelp for the great find!  We had late dinner reservations at a different restaur","useful":0,"cool":0},"5_kwgaRSb78b1ifr2ZsMoQ":{"text":"Food was great & the service was great!\nI had the duck and it was very tender and went wel","useful":1,"cool":0},"UXZtmt-sdaZyPNz4sIjnNQ":{"text":"Came here tonight (4th of July 2016) and was greeted by two very nice men at the host stan","useful":1,"cool":1},"24oXjvDL0NlTI5YancXiyA":{"text":"The Jambalaya pasta was fantastic. It was extremely flavorful as well as perfectly cooked ","useful":1,"cool":1},"asxNun0ze0_yX77KoqVArQ":{"text":"We went during Mardi Gras so this may not be reflective of their service throughout the ye","useful":0,"cool":1},"Oyke8I3pTSzuvP6MObN0lQ":{"text":"This restaurant saved my vacation.\n\nI was on the hunt for some fantastic Cajun food and wa","useful":3,"cool":1},"ZI8V_7c-T7_QDD9ASmJUgw":{"text":"Delicious food. The chargrilled oysters were amazing. We sat outside. I definitely recomme","useful":1,"cool":0},"hDwrnur2_nILD18H_mnmWA":{"text":"My husband and I were so surprisingly disappointed by this place. We stopped by on a group","useful":0,"cool":0},"6dlOL6tpbXiRJwL6OgJewg":{"text":"Food was good. Drinks were good. Had the New Orleans sampler and wife had the catfish. Bot","useful":0,"cool":0},"NIAVsDp3t_dzrvTsmmAkjw":{"text":"Walking back from the Natchez Steamboat Tour and came across a sweet door man encouraging ","useful":0,"cool":0},"-fExPfWAL6ic67n2fAsTSg":{"text":"We peeked in 20 minutes before they were open, and as we were considering coming back in a","useful":0,"cool":0},"3RpxKD6srVIJoyF3pbJcdQ":{"text":"Walked to the hostess stand and the lady greeted us but was very dry. She asked if we had ","useful":1,"cool":0},"bGtxi1WNJ7MLF8o3ToQuMQ":{"text":"This place looked great and the music was nice.  The food was ok - the trio was mostly ric","useful":3,"cool":0},"BM4N-QuH6RlSPfa6TuRD7g":{"text":"Visited this restaurant around lunch time on a Saturday. Our party was immediately seated ","useful":0,"cool":0},"c7VR92RF4LLnad4ZJl5jqw":{"text":"Ambiance, history, courtyard with fountain or gleaming wood, glass, and brick dining room ","useful":0,"cool":0},"z5pK-k4iL2uDiPdBunplFw":{"text":"Couldn't be happier that we found this place. Our pup had enough of the Barkus Parade and ","useful":0,"cool":1},"lZ8Lr4IqtMzzeJ263a276w":{"text":"Went for dinner and really enjoyed the food. I made the mistake of ordering the hurricane ","useful":0,"cool":0},"0AcR1bbXbHGNUs6d0jrBRg":{"text":"OMG ! Everything we got was amazing.. After having a rough start to our trip .. Including ","useful":1,"cool":0},"nN2LjpnuFXFT-Oy5uclbhg":{"text":"Used a Groupon and did apps after our paddle boat ride.  The hush puppies, alligator sausa","useful":0,"cool":0},"gdxuCmo3zLqx7odcYEePYA":{"text":"We just came home from Sunday lunch at NOCC.  As a favorite chef of ours, Chef Alex Patout","useful":3,"cool":0},"MrtMzSqf-XeUwzAiaHgj_w":{"text":"While on vacation, my sister and I were wondering around the French Quarter for a dinner s","useful":0,"cool":0},"X1uz1YQi9XO_X5J2A-1G9Q":{"text":"Lovely court yard dining while listening to live jazz. Ordered the cookery trio,\nTaste of ","useful":0,"cool":0},"bA6Q46ojpoM7tcj9WzD37w":{"text":"Steve and Wes gave us a great New Orleans experience. Delicious food. Charming conversatio","useful":0,"cool":0},"h4eYCQ2MNFtrRzYmjRzyyQ":{"text":"Fantastic meal.  I had the blackened redfish and it was absolutely awesome.  The seasoning","useful":1,"cool":0},"uRIiorVcNtVqLTBim9trlQ":{"text":"Best BBQ Shrimp and possibly the best meal I have had in my life. Risotto, red beans and r","useful":1,"cool":0},"Wa5uPbvLMlaY2_lr0C3MXQ":{"text":"OUTSTANDING! We came here 2 days in a row. Sat at the bar and watched then shuck and cook ","useful":0,"cool":0},"yPIwrwLyzXja-XmnQt3WnA":{"text":"Great service, atmosphere and food.  I got the creole pasta and the crawfish ettoufle, wit","useful":0,"cool":0},"f6O7UhAnk6pe45YjuajouQ":{"text":"Man, this place is GreaT!\n5-7pm... $1 chargrilled oysters (some of best I've had).\nOther g","useful":2,"cool":0},"O9h6eavvX3aFYTor-KWTBA":{"text":"Looked for a new place to eat on yelp and decided to try this place. The 3 of us stopped b","useful":0,"cool":0},"cuGzuHRNgFw1noKOt3eDyA":{"text":"This was a great place.  The chargrilled oysters are truly delicious.  Tiffany made me smi","useful":0,"cool":0},"qNsXTC3imibAQaivaOo8MQ":{"text":"Beautiful courtyard in the French quartets. Food is vintage New Orleans, great spicy Blood","useful":0,"cool":0},"sfUM7S3-5qY_jnK_TytDaA":{"text":"Excellent example of a friendly local place that caters to tourists without pandering. Foo","useful":0,"cool":0},"g8UrMwRCNGtC_g_ODiu-LA":{"text":"Great ambiance and service. Charbroiled oysters were so delicious that I wish we weren't s","useful":0,"cool":0},"cVr4lunctxiiuE3WVs7VpQ":{"text":"During my recent trip to New Orleans I discovered this place. I stopped in for a drink and","useful":2,"cool":2},"SgRHEV-A2KhFWIiiKoq6TQ":{"text":"Originally came here because we did not know where to go for food and this restaurant was ","useful":0,"cool":0},"zuDqEMMtVINkfS_kUi7NLQ":{"text":"Disappointing. The reason I gave it more than one star is because my friend's blackened re","useful":0,"cool":0},"gQhoEhfvrPr_bxMe3uXLsg":{"text":"Excellent food!! They were very nice to accommodate 2 additional members to our NYE reserv","useful":0,"cool":0},"WuLDJM0k9GBts9KUtQK19Q":{"text":"My etouffee was not good and I sent it back.  They kindly accommodated me with a salad ins","useful":0,"cool":0},"ScCW1O8ANkO4DwWNKQFFNA":{"text":"The bartender Nathan is awesome!!!! Happy hour 5-7pm with raw and cooked oysters. So good ","useful":0,"cool":0},"_rn2zZIZ8jm4bi2-XlD_sA":{"text":"So so good! Just had lunch here on our first trip to New Orleans. So welcoming. Great drin","useful":0,"cool":0},"S-DNUHiPC3zFvEflZMV_jw":{"text":"Food was average but the service was terrible. We bit into plastic wrapping found in the O","useful":0,"cool":0},"wtuEiWHJqi7y14Z8dg7GBw":{"text":"We walked into this place and got a table right away. I ordered a drink and thought the am","useful":0,"cool":0},"hFP33nI7PHh0qUJx5TREEw":{"text":"We got into town kind of late and we were hungry. Our doorman told us about this place. Th","useful":0,"cool":0},"Mz2Dwz1XUEuY9ct4zBwmEA":{"text":"I came here twice on my trip to New Orleans this past New Years and I really liked this pl","useful":2,"cool":0},"dBqZ9lRTlu65NbKXPS5uEQ":{"text":"Love this resturant! Its the first place we went to when we arrived, the staff was amazing","useful":1,"cool":0},"9lR_nxQI0fBB-nrcP5dt3g":{"text":"Are you a foodie?  \n\nIf yes:  Proceed to different restaurant.\n\nIf no:  Go ahead and eat h","useful":2,"cool":0},"DBrDYRGy-btkMrRjFOpGAg":{"text":"We have been back several times since first visit; this is a great place, except for the g","useful":0,"cool":0},"OuTMpZaxyfI9dxa6K_LiAg":{"text":"I'm more likely to rate up than down. That being said, the service was so poor that I have","useful":2,"cool":1},"nnbVhs8P5-rnoYPFXjSO2Q":{"text":"This was a great lunch... The food was good the service was great and atmosphere was New O","useful":0,"cool":0},"7ibUokIRixjjum56HgMy1w":{"text":"We stumbled in here after finding our usual haunts too crowded. Great food great atmospher","useful":0,"cool":0},"zX-B7xsqAkhXvUxG8LvL1A":{"text":"Went in and sat down immediately. Once we got sat no one came by. Im sure the place would ","useful":0,"cool":0},"9ijW4BmbFx3ZIRUbFHPEXA":{"text":"Best Jambalaya!!! My husband and I were in Nola for three nights and I regret not eating h","useful":1,"cool":0},"oC5qfEAO2Wh77NTGCKSyaA":{"text":"First time in New Orleans...great spot with live music. The chef came out and made sure ev","useful":0,"cool":0},"fl0O4pE2M3qh24m-F4ymfw":{"text":"Everything was delicious with a very soothing atmosphere (classical jazz playing in the ba","useful":2,"cool":0},"kpE5IphROOOndoHLdCgpjQ":{"text":"Rude. The two girls manning the hostess station sat two couples without reservations in fr","useful":1,"cool":0},"nTX1SsyJIP2A-x36dMioOg":{"text":"While on vacation my BFF and I tried this spot out for dinner and let me tell you, this sp","useful":1,"cool":0},"Xz0c5fIeO2Jc_CClLH9trw":{"text":"This was a wonderful place to dine. I'm kind of a food snob so when I tell you that the ta","useful":0,"cool":0},"mQREHGqNHczWqYmtfNZRYA":{"text":"Came in on a Groupon. Wife and I both had jambalaya which was excellent. First vegetarian ","useful":0,"cool":0},"6uj-zA1OTNxurEHKeh8_jg":{"text":"I have to say I was hesitant about this restaurant when my coworker recommended it. I aske","useful":1,"cool":0},"_kXzJl66FT3Ab9KaEsJX-Q":{"text":"First of all, Wine Wednesdays, y'all. Even the Wednesday before Thanksgiving. So there you","useful":1,"cool":0},"iXoMLyGEkF-s0OjAWaHXGw":{"text":"It's very dark inside and you need a flashlight to see your food. The menu is full of endl","useful":0,"cool":0},"ISz8IN6MIxgw-CkPntXxSw":{"text":"I was looking for some vegetarian local cuisine. So we came across this place which served","useful":0,"cool":0},"MtBV4GfmRAAzQyR67ulQgg":{"text":"Our visit to this restaurant was one of mixed feelings. We were seated fairly quickly but ","useful":0,"cool":0},"0QUikxxfwbSOgMSTNCvv-A":{"text":"We just had dinner here this evening. The service was sub par and we felt the waiter was i","useful":0,"cool":0},"5zWjJ1r2JajK9NbqVsDnhA":{"text":"Beautiful and very romantic feel. I had the pasta oleans which was a little spicy for my t","useful":0,"cool":0},"WC1D33fg9JS1erePLI6xIA":{"text":"2.5 rounded up. I came here with my family after reading the Elite reviews and hearing the","useful":6,"cool":2},"HpuZ10-0w9xsBOXHUYTJpw":{"text":"The food here was not terrible, but that isn't exactly a glowing recommendation. Staff als","useful":1,"cool":0},"pdyl2DrINjsq9Xj9tf2BUg":{"text":"The food was pretty good, if excessively salty. Be sure and check the check before you pay","useful":1,"cool":0},"Yrk_glfr1TeiEI-x_TDMzQ":{"text":"Had a great meal, the seafood gumbo and redfish pontchartrain, big portions. Service was v","useful":0,"cool":0},"Msth1IHmUhnqQBjTjsKs8g":{"text":"Hmm. Tried to go here for lunch after taking a really nice boat ride on the Mississippi.  ","useful":0,"cool":0},"_GiVXuU_YqWUBVH1ImwGGA":{"text":"Great food but spicy even though we asked if a child could eat the pasta but for adults gr","useful":0,"cool":0},"YzshBwI6zzxzh4YnFIg9hA":{"text":"I can't exactly rate the food because no one would serve us!! My husband and I were visiti","useful":0,"cool":0},"prq_wNksvU_ZBUbWJyiwGQ":{"text":"Gave this place 5 stars but it deserves 6.  I agree with all the good points in the other ","useful":0,"cool":0},"3ePr-IqGkYnUuVvYwRL6XQ":{"text":"This is seriously one of the worst restaurants I have eaten in.  I'm not a person who yelp","useful":0,"cool":0},"-yUaVmmkXx9y1dVIfu7MsQ":{"text":"This was one of the best meals we had while in New Orleans! As a vegetarian it is hard to ","useful":0,"cool":0},"NE_2eWguLpkFwTQEI1Zp2A":{"text":"My husband and I decided to have our last meal in NOLA at this restaurant. The ambiance wa","useful":1,"cool":0},"hBhu3krj4S8bfWV0mJoj5A":{"text":"This is seriously the best restaurant in New Orleans. The most perfect dinning experience.","useful":0,"cool":0},"oI4uFRBsGrsCnCVgc84RnQ":{"text":"Great experience. With many in the service industry around this area dealing with the \"mar","useful":1,"cool":0},"QCLenQ3VL85UYjV9BTEmdQ":{"text":"Great service and good food! Kinda salty but  so is everything in New Orleans! I ordered a","useful":1,"cool":0},"zE4tUHvA3qf6UHpqccnO6g":{"text":"Enjoyed the blackened redfish with vegetables....my friend had the red beans and rice with","useful":1,"cool":0},"6C6LdZtqGrDaJBHGqoEL4g":{"text":"Enjoyed a lovely dinner here during our New Orleans stay. The ambiance was great, and the ","useful":0,"cool":0},"R5CPUha9DqdmYPGsoDZ9ow":{"text":"Awesome place in the French quarter. Had the Creole Pasta and my wife the Blackened Redfis","useful":0,"cool":0},"988rPVzJ73dRoKgfuTRB_Q":{"text":"We both had the blackened redfish, roasted heirloom taters, green beans for $29. Redfish &","useful":0,"cool":0},"vijIF0lIBTglesz2JOczOQ":{"text":"Wonderful food,  great atmosphere.  We had a company party that the original venue cancele","useful":0,"cool":0},"ITTQVGsReWmDcysxsDnB9Q":{"text":"This was my second time coming to New Orleans and the first time for my husband.  We were ","useful":2,"cool":0},"ihXnJH54pDI5K7r8BkjwMA":{"text":"I will say I was pleasantly pleased with the food. The service was subpar. Our waitress di","useful":1,"cool":0},"LXZ8g25PNpTFVbJ_BIvWYA":{"text":"My entire group was pretty impressed with all of the New Orleans style food we had. Some t","useful":0,"cool":0},"0b4LtBgSa3vKRf6q_TxGHw":{"text":"Great hidden gem with a great cozy patio, good cocktails, live music and good food\nThe pla","useful":0,"cool":0},"05spW1hBHTxojGkq3jlwfQ":{"text":"Loved this restaurant.  I felt like I took a step back in time. The  fine dining area is r","useful":0,"cool":0},"J_AWANUZOT13O04qqU6XFg":{"text":"tasty but pricy and sweaty. really sweaty. \n\njambalaya was good, roasted vegetables, penne","useful":0,"cool":0},"r5QNxNCChecyNFU-25xDjQ":{"text":"Truth be told, this place looks like a standard tourist trap restaurant, complete with che","useful":4,"cool":0},"tdz5_5iDnno9_phwYCMr3A":{"text":"We were on a New Orleans work trip and randomly came across this amazing find! My friends ","useful":1,"cool":0},"ubTInzSz3hKdWQe9v1MCXQ":{"text":"2 years later I came back for the blackened red fish. Just as good as it was last time. I ","useful":0,"cool":0},"Itt95KHnXcGgz2OmxxUy-w":{"text":"I wouldn't recommend. Food was adequate but nothing special esp. 17 dollars for spicy rice","useful":0,"cool":0},"eE1C7YOvIIoU7i3sC2GZNQ":{"text":"Okay after we finally got a waiter, the DRINKS special was Coors Light...nothing else.  No","useful":0,"cool":0},"UgT9c1xCCckQpm2ue7x-5A":{"text":"Great cocktails, awesome oysters, and the best bartender, (ask for Abbie). Definitely ask ","useful":0,"cool":0},"Z8OzRnzLYIQlimM_rAd76g":{"text":"Great service. Our waiter was the best! He answered everything superbly. He highly recomme","useful":0,"cool":0},"-Ao6auiEVYhbNCsPglaQMw":{"text":"Luckily we spotted the courtyard and stopped here. The ambiance was beautiful. The garden ","useful":1,"cool":0},"Ltw2z5Rrl-f8qlg8qBM5_w":{"text":"We stayed next door and thought we'd better find out how it was.\n\nGlad to report that the ","useful":0,"cool":0},"Lu7HGTY629rjmNg1mhdTig":{"text":"Amazing Cajun Bloody Mary made with Absolut Pepper. Get one and go on a horse-drawn carria","useful":0,"cool":0},"KtO68MuSsX75pt16HHbMqw":{"text":"This place was just not impressive. After waiting for 10 minutes after being seated a serv","useful":1,"cool":0},"UViYcoRSza_eOzMedV-mXw":{"text":"Got there and there were two people eating in there. I left after 29 minutes of waiting fo","useful":0,"cool":0},"FVfmvu--ufzjgiy2XEEFxQ":{"text":"The service was good.the food was just OK.\nTHE alligator sausage,very tasty,better than th","useful":0,"cool":1},"tVDdLKDlGGeAbNUlVaa43g":{"text":"Jambalaya and blackened redfish were good. Fish was a little overdone but other ok. Also h","useful":0,"cool":0},"akNg69zQYJpfnEw5b5xWDg":{"text":"The location was beautiful, the food was tasty, and there was a live band playing. Althoug","useful":0,"cool":0},"4RShnpme_8tdQdjIvJG0LQ":{"text":"Giving it 4 stars because our waiter wasnt the best at all. The food however was excellent","useful":0,"cool":1},"m6ZD_irMSTzDRNm4gjTB8Q":{"text":"Game day special,  50 cents oysters, $1 chargrilled oysters & 1/2 price appetizers. Excell","useful":0,"cool":0},"ZeWJZGYjNDCCZQeoRCdscA":{"text":"An excellent place for dinner. Happy hour starts at 3 with  1/2 price app and char grilled","useful":0,"cool":0},"o3Qc1vjQSFc7KAEnwbQRzw":{"text":"Low key and almost secret place off the main drag. The bar is where it's at. Happy hour is","useful":0,"cool":0},"hsYwMuQLZGqs3E1g4yx3Rg":{"text":"First time visitors. Saw great reviews on Yelp and Groupon. We had a terrific experience: ","useful":0,"cool":0},"ddl3sgRclcEhitOMu11aqA":{"text":"I had the crab cakes, one was a little salty but the other was perfect... Go figure.  Wife","useful":0,"cool":0},"khY8PzvwUryiP2-RwpHopw":{"text":"From their sign outside it talks about the half price appetizers, Coors light for happy ho","useful":0,"cool":0},"u9-XL8ZvVLCrfH22JwWYLw":{"text":"Service makes all the difference and our experience was \"meh\" at best. Restaurant has a go","useful":0,"cool":0},"ywMrzuh0emTatI0eZS5kYg":{"text":"Stumbled into this sweet spot during the French Quarter Festival. Hesitant initially but t","useful":0,"cool":0},"DSGi9ALEsgsxo3MinmRdZQ":{"text":"Staff was very friendly. The food was great. Best jambalaya! The chargrilled oysters are a","useful":0,"cool":0},"p9snEHkLmTjbjrdyX6w35w":{"text":"Yum! Lots of good food here..\n\nCookery Trio (shrimp, crab, stuffed mushrooms): 5/5. all de","useful":4,"cool":2},"CwVNdIsn6-vuOy_gBO94yA":{"text":"First time in New Orleans and this is my second time eating here in 2 days! Everything off","useful":0,"cool":0},"rgZHuxizzwcKaYrXDLNqZw":{"text":"My first meal in NOLA and a recommendation from a friend.\n\nThe food... The blacked redfish","useful":0,"cool":0},"vO0OX-5yRqOJcW30s3HdDA":{"text":"The concierge at our hotel recommended this place and he was spot \non. I told him I wanted","useful":3,"cool":3},"FaYsoGIILI1Il9BXn51P1w":{"text":"Fantastic all the way around. Great entertainment, great drinks and fantastic food! Go eat","useful":0,"cool":0},"-emLBNrOIsmCmQ9zOj8YVg":{"text":"Not only is the food the REAL DEAL (get dessert, and thank me later) but the location, the","useful":0,"cool":0},"CnciJquXaaJm40n2s6JfgQ":{"text":"Went here with the Groupon deal $26 for $40. Terrance was my waiter and he did a splendid ","useful":0,"cool":0},"fsAOMsFK4oehJGAVOhU-IA":{"text":"Very good food with great servers.  Atmosphere is a plus, love courtyard dining.  Charbroi","useful":0,"cool":0},"WVEvAbc_3SFQc55Gxqb1yw":{"text":"Fantastic!!! We had the blackened red fish (Jack's suggestion) and the jambalaya  (I was c","useful":1,"cool":0},"3FS9741VxlMlLh9tRNYgBw":{"text":"This place looks very nice from outside and once you get in the section by the bar has an ","useful":0,"cool":0},"r6qoyDxEIwquT-O7Gq_r-w":{"text":"This is a fantastic restaurant-old New Orleans feel; excellent food, service and...Spring ","useful":0,"cool":0},"GKD6VDrAmcYGLLJCJySFUQ":{"text":"Great food, great service, great atmosphere. The host and server were very welcoming. The ","useful":0,"cool":0},"yYghKpXyALR7CfVk1T63EA":{"text":"I had a groupon, so we ate here on a Wednesday night. I had no idea Wednesday night was ha","useful":1,"cool":0},"g3HOfZqOLHNe4Sh9Obb4gg":{"text":"Ordered shrimp and grits and the Taste of New Orleans for lunch. Spent $50 on food of less","useful":0,"cool":0},"9iPg9ZlPZJMF-eE8tzjzpg":{"text":"OK we just had the Blackened red fish. OMG can I say amazing so freaking amazing so glad w","useful":1,"cool":0},"jK2GIi6_piMigKpuIfaobg":{"text":"Catfish Decatur- 5 stars \nHouse Salad with shrimp- 2 stars \nService- 2 stars. Our waiter w","useful":0,"cool":0},"hEvg4LJ-gbOi1YNCElDj-Q":{"text":"I made a reservation on open table for New Year's Eve. It gave me the option of picking wh","useful":0,"cool":0},"w_857OyCeXoXUIxHR5hf_Q":{"text":"We were drunk after St. Patrick's Day parade. We entered the first dimly lit restaurant we","useful":0,"cool":0},"durqk1m9XMpCIuRF5aFpYw":{"text":"Great for typical NOLA cuisine, everything was pretty delicious and worth the price! Servi","useful":1,"cool":0},"WtfGBIZvX5goApVwDZGPGQ":{"text":"From the start we should have known how bad this place would be. The lady seating us was r","useful":0,"cool":0},"IF6jEOZo-EGtDN9lejQtCw":{"text":"We found a Groupon to this place and decided to try it.  I was worried that it would be th","useful":1,"cool":0},"1LkovsFgQT-EYpfvCCBBNA":{"text":"Unfortunately didn't have such a great experience this time ... came back to enjoy some ch","useful":2,"cool":0},"Len2W4OJaDX4KwmNNu0rxQ":{"text":"Walked by this place decided to stop in and get a sample of the pralines they were really ","useful":0,"cool":0},"7IbZUtZdefhxVZfqfFcpfA":{"text":"The building itself has an amazing history and intrigue behind it. The staff is beyond fri","useful":0,"cool":0},"Q2ntKlfFt0QNWKJF6Lh-Pw":{"text":"This was a great choice , the food was amazing and out waitress Sabrina was the best! If y","useful":0,"cool":0},"k-IfV8pfRn6UqskswvsEoA":{"text":"This is where you come for some authentic NOLA eats. You can either sit on the inside or o","useful":6,"cool":0},"wB01swDKGR5Ul4bYZB1vpw":{"text":"3+ stars Ambiance was great, inside ,outside seating, very nice great date place. Live mus","useful":0,"cool":0},"Bed_mhF03LqUk8oJt3l2Qw":{"text":"Went there 3 times in as many days this June. The best, and I mean THE VERY BEST charbroil","useful":0,"cool":0},"o6vWxvuaFcZp5lzL6-GJqA":{"text":"Having had jambalaya and shrimp creole a few times while in New Orleans, this was by far t","useful":0,"cool":0},"CsMqYZ_rUUd_AUWzNz_Gkw":{"text":"My boyfriend and I happened upon this restaurant by chance because it is very near to the ","useful":1,"cool":0},"6N2AoO6YESPA2p_qd8djXw":{"text":"The place is really nice.  Our server ended up being OK, even though at the beginning show","useful":0,"cool":0},"Zf7Cn21bvLUllVChKZWQTw":{"text":"My family LOVED this place!! The food was amazing!!!!  I got the Bourbon Street Boil and t","useful":0,"cool":0},"eM4vmfLcYuAV3Yk5BkGwNg":{"text":"Very nice ambiance and delicious Jambalaya. My husband had the creole pasta which was tast","useful":0,"cool":0},"GhXptAOQf0eBGCczr1353A":{"text":"I really wanted to like this place. The weather was perfect and the outside ambience was o","useful":3,"cool":0},"J2gVL4c65omAT_ClOmn7Pw":{"text":"Food tastes good. One of us asked to replace dirty silvers，but we didnt see replaced ones ","useful":0,"cool":0},"SGfCsa47gfSl11ev2F353A":{"text":"Char broiled oysters were excellent. Staff was cool. Really cool environment. Would go bac","useful":0,"cool":0},"sdKLz91QKSl0jKIkBQoT0g":{"text":"I know the restaurant business is tough, especially in such a competitive city and I am no","useful":6,"cool":1},"5_6ut6lVzXzmY1dMNkACmQ":{"text":"This place was an enjoyable experience. The staff was great and the food was unbelievable.","useful":0,"cool":0},"XjvBX6DM9JcfQzRqzAMrkw":{"text":"Very delicious food and nice place. You should definitely check this place if you like sea","useful":0,"cool":0},"DSr2t6SF8-zn9T-hO7NzmQ":{"text":"This place is the best. Food was cooked with pride, ambience was perfect, away from the cr","useful":0,"cool":0},"RqeaNbDTZV7BSWaWS5gByg":{"text":"We found this place from Groupon that why we went there. First of all the hostess said we ","useful":0,"cool":0},"1ejpPVgNqHiORoG0XTr1dQ":{"text":"Taste of New Orleans and char oysters are  \nService is excellent showing us favorites!","useful":0,"cool":0},"-z7p00PdANpuiuSmJ_qNsQ":{"text":"Service and food was below expectations. The hostess sat us down without the menus, so we ","useful":0,"cool":0},"PHkDGMynj02BqBWT3TrfYA":{"text":"This place is awesome. Owners are very friendly. Hush puppies app and jambalaya were amazi","useful":1,"cool":1},"fYT9IiST6hiTvZ50vD0JyA":{"text":"Stopped in as a large group on a weeknight.  The hostess wasn't very friendly, especially ","useful":0,"cool":0},"hchg84c_HkVp5RvIPMY6Mw":{"text":"My gf and I visited this amazing restaurant ny happenstance as we were walking through the","useful":0,"cool":0},"-KWPjOt_1CTAa8qyuTtAdg":{"text":"Spent a week in New Orleans for the 2015 USA Volleyball tournament... This was the best me","useful":0,"cool":0},"hNZmpEqgNb__HHHwbiPJsA":{"text":"Came at happy hour and was seated outside because no tables were apparently available insi","useful":0,"cool":0},"8NEOkg2s1PMfECjIWVyd8Q":{"text":"the food was fair and the service was absolutely awful the server could not figure out the","useful":0,"cool":0},"CtO69YLZ5C4s1nW5u5slSA":{"text":"They have some good men behind the grill at New Orleans Creole  Cookery! They know how to ","useful":0,"cool":0},"1L4R5F2dzUxv4aZpm8XZvg":{"text":"Waiter pulled us in off the street (even though that's were we intended to eat). Waiter wa","useful":0,"cool":0},"JgENrJ0VLkvVbnrJhbPxvQ":{"text":"Grilled Oysters! I confess I haven't eaten oysters since my mother made me eat canned oyst","useful":0,"cool":0},"Osfr7Zv2HQTM0qojg78LrQ":{"text":"The food was underwhelming. The shrimp boil was very over cooked. The gumbo was bland. Ser","useful":0,"cool":0},"i7EDkV4MbPbo6W8ebpQZJg":{"text":"Ah where do I start. As a heads up, I cannot speak to the quality of the food because we n","useful":6,"cool":0},"JeBt-_l9JOcjzafi5ikDMg":{"text":"We loved everything about this restaurant from the food, to the service, to the ambiance. ","useful":1,"cool":0},"d6pHntT_gUwHKrsEY8S5Ig":{"text":"Found this restaurant through Groupon, so we went for lunch. We were seated very quickly, ","useful":2,"cool":1},"IA-Vmqp2CftsG1F3K397WA":{"text":"Food was great and the service was excellent. I had the New Orleans sampler. Also had the ","useful":0,"cool":0},"o48nElcFdIOb6g1Q4gOHEQ":{"text":"I'm basing this review on the amazing lunch I've just had.\nAppetizer: Chargrilled oysters ","useful":3,"cool":0},"R8Vv-uOYuc8O6klx27NxLw":{"text":"It was bad. Ordered the crawfish frittata for brunch. It was $18 for a burnt egg something","useful":0,"cool":0},"JMB2rdFv5L8z1bdMnf2CYw":{"text":"My family and I ate here for Mother's Day and had an unbelievable experience. We walked in","useful":0,"cool":0},"HCx_Ca6Zu8Ux0k1Q8GIqMw":{"text":"***REVIEW FROM AN EXPERIENCE IN JUNE 2015: I just wanted to let everyone reading my review","useful":0,"cool":0},"Y2jZqDZvz4MOYQcMZQF2dw":{"text":"The New Orleans Creole Cookery was in the same building as our VRBO. We ate here during ou","useful":0,"cool":0},"p_sBge2hXgUfbGSHJNcjWg":{"text":"Charbroiled oysters are definitely keeping this place alive. \n\nAtmosphere: Definitely a to","useful":0,"cool":0},"PpxBr8AR3Zd54_OsBeC8vg":{"text":"Saw their lunch deal on Groupon and decided to go over. Nice building in the French Quarte","useful":1,"cool":0},"yT0dbzOTO5YBw_ysEhlm6A":{"text":"A rather famous NOLA restaurant that was busy but not packed. The service from Alvin was m","useful":0,"cool":0},"n5-P-uU-LQGkTkYrKvM3vw":{"text":"Found a Groupon for this place for lunch during the weekday so I took advantage of that.\n\n","useful":0,"cool":0},"_QClVqjGn130OPeLSDj12g":{"text":"We were recruited by the gentleman at the door to come in and eat. Had no idea what to exp","useful":1,"cool":1},"VVzRSmYD5EJUqrmPGbNVug":{"text":"This was a last minute decision to come here, but I'm glad we did. My mom and I shared a c","useful":0,"cool":0},"07oyKxZRL7r39CSaW5Niag":{"text":"We visited this restaurant with a tour group of 42 ppl in which we were offered a limited ","useful":0,"cool":0},"4Xop1QG02lXiGQMrzj_2XA":{"text":"Amazing service and true to New Orleans style thru and thru! Such great food it made our m","useful":0,"cool":0},"x7_wKSwml66IdSWaocVGRw":{"text":"Ummmmm service was cool, and the calamari looked amazing it tasted ok. I ordered the trio ","useful":0,"cool":0},"lL-110tj9G-DqZ1tSr4o_w":{"text":"Overpriced food for quality. Not a fun experience overall, wouldn't recommend it to anyone","useful":0,"cool":0},"cnOQovZCDyBB-PmUVUZY8g":{"text":"We were a group of six with reservations. We were seated quickly and drink and appetizer o","useful":0,"cool":0},"eLe34PYzg6VK7tP3z4vs_g":{"text":"This is a GREAT place to stop in. Steve knows how to shuck some tasty oysters. Nathan & Na","useful":0,"cool":0},"-C4_UATDLbAwkocIgWyQCQ":{"text":"My friends and I wandered in here when we were in town for a few days. We sat at the bar a","useful":0,"cool":0},"8vWA4cCJlCfeDvYncYMOtA":{"text":"Came here before a ghost tour for a hearty creole dinner and boy did it not disappoint! We","useful":0,"cool":0},"2FKn4OXnHi0WIk-vCD7ExQ":{"text":"Delicious! Perfect Shrimp po boys, great staff, and clean restaurant (& clean bathrooms)! ","useful":0,"cool":0},"zXukoI368aLODMlxutJ1wA":{"text":"Started with the gator bites...fried and pretty good. Had a dozen chargrilled...I love cha","useful":0,"cool":0},"6NjGFamL5XgaRyZwAy04xQ":{"text":"This review is long overdue- this place was one of our favorite things about our trip to N","useful":0,"cool":0},"sxqsUCi-4iIfjFp6Ve26xA":{"text":"Such a bummer. This place is very overrated. The staff was marginal. There were multiple i","useful":0,"cool":1},"bGIadqLgYArl4qwFKCCGGQ":{"text":"Everything except the oysters and the history of the building is terrible. We were placed ","useful":0,"cool":0},"1god_sFh_BeSj1j7yXVJlg":{"text":"The most amazing Cajun Bloody Mary and gumbo!  Great atmosphere to sit in the courtyard an","useful":0,"cool":0},"U3IlyFPKWJj9yFGBSK0Wwg":{"text":"My husband got it right with this pick!  You must try the chargrilled oysters and get a do","useful":1,"cool":0},"X4afetxnIGFhuMbE9NOb-g":{"text":"My fiancé and I were looking forward to an authentic creole dinner. We were very disappoin","useful":0,"cool":0},"2Ka6EwMtY6eicl2z-1YtPQ":{"text":"Great food great atmosphere! Sabrina was the bomb! Kept warm and toasty during the big fre","useful":0,"cool":0},"NVHLkOxuegdoUONCroFa1A":{"text":"Everything we ordered was delicious. The service was great from the time we walked in to t","useful":0,"cool":0},"KcoLYkCUqK2KWoHG4hHTOg":{"text":"Meh. This place has decent food... But in this city food is hard to mess up. Service is ty","useful":1,"cool":0},"kSsOq0_rghxBuK3CKq73nA":{"text":"Definitely a must try! The chargrilled oysters was great! Ambience was really nice.. Only ","useful":0,"cool":0},"Mii_0QJMcku7luynNTyeCg":{"text":"Creole Food With Romance\n\nHere's a place with atmosphere and New Orleans style Creole food","useful":2,"cool":0},"X3sYxJLDzNe1NQvvPzJkJg":{"text":"I visited New Orleans this January on a business trip, and I had never eaten authentic jam","useful":1,"cool":0},"oyXvzN7X0z88M4md_wqGQA":{"text":"Good food. Atmosphere lovely but music confused. Bread could have been more fresh. Great s","useful":0,"cool":0},"iwfKFeqH8yWjEhwf5ND5Lg":{"text":"I'm so glad we read the reviews and gave this place a try! There was something for everyon","useful":0,"cool":0},"N06w1KnQbqeyuo85MGgxnw":{"text":"This restaurant and the employees gave us our first taste of love and happiness this city ","useful":0,"cool":0},"lN_gg82-6Fx35ncgUoclkw":{"text":"1st time trying after a couple recommendations, especially regarding authentic Hurricane. ","useful":1,"cool":0},"nKO1ifKnn-cR3hy2tIvPtQ":{"text":"Great courtyard, nice staff and good food, all in the ambiance of entertainment. Size of t","useful":0,"cool":0},"8g99TlOvqrM2XLpX4BlhxA":{"text":"Great food and great atmosphere. We went on a Friday night and sat in the courtyard. The m","useful":0,"cool":0},"HvnrwxYlwGmu2UNpNN-Www":{"text":"This place does deserve it's one star because the oysters were pretty good and the door ma","useful":0,"cool":0},"O8khRBNpdaoVLI4O-0s2pA":{"text":"The food is nice, but the portions are large. It doesn't help that out waiter, when taking","useful":1,"cool":0},"MkxbfS9hM2oFo4jBmzmgAQ":{"text":"Our waiter was great! Tried a bit to upsell but not pressure.\n\nMeal was good. Had jambalay","useful":0,"cool":0},"CCvDEp-mQWf_iCKwQUt0UA":{"text":"I was in New Orleans earlier this week and ate at the New Orleans Creole Cookery as I foun","useful":1,"cool":0},"CQgX0CmoM5WHJroEY8Fq0Q":{"text":"Came here for dinner because we had a groupon. Food was great. We had the Taste of New Orl","useful":0,"cool":0},"W2QKd0ynyqXT364TZptICw":{"text":"Bartender kept sneezing behind the bar without covering her mouth. After canceling a drink","useful":0,"cool":0},"7eZDAcjOyYfFuTJV6wd23A":{"text":"Good food , pretty nice and quite location , patio is great along to live music , charcoal","useful":0,"cool":0},"jP3UYIYTQy9QoFupq3nVPA":{"text":"This was a fantastic restaurant! Found it on our walk through the French Quarters! It was ","useful":0,"cool":0},"ADViPSI2gt1py6Oxh_KunA":{"text":"Was referred to try this and really not up to my expectations. Oysters were too heavily br","useful":0,"cool":0},"yn8puAea9rI5pMY6JZL9TA":{"text":"Walked by this place this morning after breakfast and talked to Charles out front. We were","useful":2,"cool":0},"idAymwa1s1YuFbDn7CapGw":{"text":"Blackend redfish with lump crab and heirloom potatoes and green beans was very good! Servi","useful":0,"cool":0},"7Zxnm7feQsc9Wsi3AoH7rw":{"text":"The charred oysters!!! This place was recommended to us by the guys at sobou since they do","useful":3,"cool":2},"Ovt37cR7URDlXdCF3iWFww":{"text":"Simply the BEST! Better than ALL THE REST! Alvin was our server.. Jackie was outstanding w","useful":1,"cool":0},"mR2ibsHn73C1_kxMyLrIHA":{"text":"Great food (try the blackened redfish), excellent friendly professional staff.\nIt's a rela","useful":0,"cool":0},"IWYUbQhYCL5s5AKzGyPKdg":{"text":"Only eat here during a good weather day, due to the outside seating. it's a pretty nice se","useful":1,"cool":0},"H-mApb_xit5TrFBuBRe7NQ":{"text":"We had an amazing dinner here, I've never tasted roasted vegetables as good as the vegetab","useful":0,"cool":0},"6Xp-nqc7hQ8xxxA8tqHMPg":{"text":"Greeting and wait staff were top notch very laid back and easy to talk too. Christopher wa","useful":1,"cool":0},"tgSjo1n1wPH9pzx39lIjrw":{"text":"Great creole food. I had the Creole shrimp and my wife had the seafood platter.\nYou will l","useful":0,"cool":0},"BMLFb7mr2qM_ydqe4Uazmw":{"text":"Used Groupon at lunch time and service was really poor. Staff all seemed very checked out.","useful":0,"cool":0},"aJ7l424AR_0ac_beLRF6lQ":{"text":"Brought here during one of our walking tours as a break point (please skip the walking tou","useful":1,"cool":0},"jjn6s2CWaRGb_-AoC355Og":{"text":"Amazing crawfish étouffée, outdoor dining and musician during our group dinner. Best exper","useful":0,"cool":0},"eweovbzs36CjSfAr9CU7Iw":{"text":"We conference attenders stumbled upon this restaurant as our stomachs were growling and th","useful":1,"cool":0},"OxgfhgAveH5fAPSLIUIHoQ":{"text":"Don't waste your time. Terrible service & the manager ran away from a complaining patron. ","useful":0,"cool":0},"jcUaI8ygrFL2P39u3YxpjA":{"text":"Food was great and drinks! Peanut butter torte great, but bread pudding rubbery! Service w","useful":0,"cool":0},"eNSXf4xJzcAepbZe_je6fQ":{"text":"The redfish was seasoned to perfection! Very friendly staff. I couldn't give it 5 stars, b","useful":0,"cool":0},"IQ1tS35OUUHLgC4qbnXzNg":{"text":"Really good creole food, right on Bourbon. We'll be back next year! I had the fried catfis","useful":0,"cool":0},"BbSMx5ro1_mEUXZ6nLKIkw":{"text":"We came here on a Sunday night and there was plenty of outdoor seating.  Honestly, the foo","useful":1,"cool":0},"UY9GIRjRY96EloJhTD-XKg":{"text":"Wife and I ordered a gumbo and charbroiled oysters. Everything was great. Friendly staff a","useful":0,"cool":0},"frz0f5x2OgxdZjRfFbmflA":{"text":"Oyster bar is Fantastic. Only $0.5/oyster and $1 for grilled. The oysters are grilled just","useful":1,"cool":0},"5VpW-AnpnbZs43F2fqCZuQ":{"text":"I've been in New Orleans for three days and everyday I have bought oysters from 5 differen","useful":3,"cool":1},"UID5G58NgG18TRkSdssixw":{"text":"Last visit was my second time here. Once again it was a wonderful experience. Dominic was ","useful":0,"cool":0},"MJuf1qZ7spwRBQZvwQiISA":{"text":"Great food! great service! if happen to in the bourbon street area, I highly recommend you","useful":0,"cool":0},"0HLYmgYJOA94RcJqSHeMsA":{"text":"This was our first visit here and it was AWESOME! The atmosphere is awesome - great for la","useful":0,"cool":0},"TqEnDfZwxNg93YZWoRlMCw":{"text":"Fantastic food! So far this was our best meal in New Orleans. It's a fun setting, perfect ","useful":0,"cool":0},"WgNA7niRckkT_Qo3vb1iJQ":{"text":"Started with tha calamari and it came out cold. So we decided to  try the \"gator bites\" wh","useful":0,"cool":0},"1Ky-q-DVBjj0OYtQmtk_HA":{"text":"Walking down the street and saw a Happy Hour sign:  Happy Hour 3-6pm  50 cent Raw Oysters,","useful":0,"cool":0},"2njNbDTFEeV9fI7EyGV6hQ":{"text":"I came only for oysters, so this is based on nothing else. That said, if you love oysters,","useful":2,"cool":1},"TmvZDaQoZApciXgM2Dn3LA":{"text":"One of my favorite spots that i went to in New Orleans. We wanted to go to their happy hou","useful":2,"cool":1},"jyWQCjzQOgA3gNGhLTB3hg":{"text":"I  had mix feeling about this place. The bread was really chewy. The shrimp and grits were","useful":0,"cool":0},"0oJCXmo0faW08ZkQq2rGlg":{"text":"Food- I thought the food was good, we had the alligator bites, my boyfriend had the shrimp","useful":0,"cool":0},"Lu8rZbQo2jOG67lqhkioEw":{"text":"Delicious food but too much commercialized. I never enjoy restaurants that charge plate sh","useful":1,"cool":0},"BBS8I9Xzv1mLxnWQMNiGTQ":{"text":"Cool place, good food, great service.  We found this place on Groupon (which typically don","useful":0,"cool":0},"DQKvXQwYPqoluqwo7aDjvQ":{"text":"I am a regular here and LOVE IT! Wes is the best bartender and the oysters are to die for!","useful":0,"cool":0},"qZkoRoj8JlVL1mAG-P-8Bw":{"text":"We just kind of stumbled in to this place because we were cold and hungry and it didn't lo","useful":0,"cool":0},"Z-McLS5_3yEyhYNj43odww":{"text":"To be honest I had the weirdest customer service experience. The food was okay so would ha","useful":0,"cool":0},"Ue0U47qoVUH3QxGPKc0Nvg":{"text":"Since when do you have to wait 30 minutes for red beans and rice have been when I get it b","useful":1,"cool":0},"QjlPJZ0Xdwv-iQGF8ubnsg":{"text":"Hmmm... Where should I start, my food was dry... I got a Cajun shrimp and it was chewy and","useful":1,"cool":0},"5C7FKD8TiGhAoQsqmWvwtQ":{"text":"Received a recommendation from the hotel concierge when we asked about good food options w","useful":1,"cool":0},"ULItvY7EZs5WfXuFZfn2LQ":{"text":"Great food,great cocktails,had the boiled seafood bucket,it was delicious,met the manager ","useful":0,"cool":0},"V84jGkFOeDXvp-IIEe73ig":{"text":"We had a Groupon and came for lunch during our visit to NOLA. The atmosphere was great, th","useful":1,"cool":1},"616dJGXrWk6xmUvDoh1AHQ":{"text":"Absolutely awesome,  the char grilled oysters are fantastic, you can not go wrong with a d","useful":0,"cool":0},"vv83nDCXFWfvpwcm1wCU1g":{"text":"We came for brunch and were promptly seated. Given that there were few people there, it wa","useful":0,"cool":0},"bdjv2HwFjYYSIUp2ohtiBg":{"text":"Great ambiance! Great music playing. The food was good & the service was quick. Tables can","useful":0,"cool":0},"RelSd1UuCsxdpOElyvHFdA":{"text":"Me and my girlfriend walked by this place while out and about during the day and looked th","useful":1,"cool":0},"1BPZEGBhx8zpxUZ7sWcOCg":{"text":"I went here for lunch after purchasing a groupon for $40 of food for $26. I made a 3:00 re","useful":0,"cool":0},"6TUZI9bM4Wls9sMrTcgSuQ":{"text":"Visiting New Orleans with my brother and ran across this establishment.  Good happy hour p","useful":0,"cool":0},"8u80Q3AJdLtSMSXEn2Lf8w":{"text":"Great food, Pasta and Alligator Bites were delicious. The wait staff was very knowledgeabl","useful":0,"cool":0},"65HLjf7prfJMg4UIqYiX9g":{"text":"In from Ohio and 100% recommend this place for Oyster lovers! Anthony who shucks the oyste","useful":0,"cool":0},"f_onHCrQci7VJUWcHhC6YA":{"text":"This place had a nice ambience however rather pricey.  Small menu choices. Our waiter Ever","useful":0,"cool":0},"17fAX8MgN_0TYICnJeeFZw":{"text":"I enjoyed having lunch here. I had a blackened fish with crab meat.  Also I had gator bite","useful":0,"cool":0},"Ahmvk7gHPcOrqbQy_bvPvw":{"text":"The Cajun Bloody Mary was fantastic, but the $17 price tag (with tax & tip) that comes wit","useful":0,"cool":0},"NAdUmAonDCodbqWkbd_a2Q":{"text":"Best meal yet since visiting NOLA. Our group had the Pasta Creole (Excellant), filet with ","useful":0,"cool":0},"m_SOANaNakcCz0gVeTzU0Q":{"text":"Ambience - ask for a table in the courtyard it's quite pretty!\n\nWent there with a Groupon ","useful":3,"cool":1},"FIPs4-6ioRsschtIskNmnA":{"text":"Had a wonderful dinner with great service and a wonderful atmosphere. We started with the ","useful":0,"cool":0},"-TffPI8nNCqUM2LnPYdpXw":{"text":"Just happened upon this place and what a jewel!  Just had drinks but we will be back!  Nic","useful":0,"cool":0},"FoujKvv91WJ_-g6Ygm4VgA":{"text":"I called to check the wait time on Saturday afternoon and they put us on reservation list.","useful":1,"cool":0},"FGaqv4lqYEggJizyegYemw":{"text":"Bad service and really blah food. We had the boiled lobster dish. The lobster was tough an","useful":0,"cool":0},"8dTAX5gQvy1GFVRio45e9A":{"text":"Absolutely delish!!! We have been here a couple times now, and the service and food has be","useful":0,"cool":0},"yrR3tj3ofPK36NJRuwxx-g":{"text":"I am so happy that we came across this restaurant this past week. I have to say it is the ","useful":0,"cool":0},"76bb0cnWyEJotsM8ZBSzqQ":{"text":"I was a random walk in & they kindly accomdated me on a busy weekend night for dinner. \nIt","useful":1,"cool":1},"SGVfRdX7JWIuPx3SBCcUPw":{"text":"The blackened red fish was so good. The staff, from the front doorman, to the bartender, t","useful":0,"cool":0},"FOw1uWb9t5IZrUUIMagThg":{"text":"U must grab the oysters here!!!! Very juicy , not too salty, and grilled well\nActually It ","useful":0,"cool":0},"XE83y_8fgC05iyy0-do50A":{"text":"Just stopped in for lunch, the prices were about the same as you would pay at one of the c","useful":0,"cool":0},"Ic8fOOx9D020K7MHND4oVg":{"text":"Just ate at this fine dining restaurant. The food is fabulous. The Duck Oyster gumbo is to","useful":0,"cool":0},"C2u5ICe75c8V4gkgqYAAGA":{"text":"I went in with a group of 5 of my friends. We didn't have to wait long to be seated. This ","useful":0,"cool":0},"JRzYjsCzp7_fwEHCoM8kJQ":{"text":"This place was ho hum.  We came here in search of some good food, dishes traditional to NO","useful":0,"cool":0},"d3fR38pqBikM1W3Ug75uTw":{"text":"Great place for group dinner that took in a table of 10 with only a few hours notice. The ","useful":0,"cool":0},"mlE-NO4vGNRCJumeOXAvSQ":{"text":"There are alot of tourist traps in the Quarter, this isn't one of them.  Legit oysters, le","useful":0,"cool":0},"j9M36qqEwyR_RInquXihoQ":{"text":"The host was a little standoffish, but everyone else was really nice and accommodating. Ou","useful":1,"cool":0},"VIMqw8gTgnlgbzYLFy44kg":{"text":"We happened to drive by and decided to have lunch here. \nGorgeous restaurant and had a jaz","useful":0,"cool":0},"nNhsU-ij27bhwQ2mMrx_oQ":{"text":"Thank you, Yelpers, for your info on other reviews as those are why this review is as high","useful":0,"cool":1},"tlBB9MMJVc9OTKPjfxcLHg":{"text":"Such a good find!  Our service was great and our server and greater were so energetic and ","useful":0,"cool":0},"Du2wxAvbXSbgRYEy4_6Uhg":{"text":"I gave it four stars because of the service and how pretty the facility is. The chargrille","useful":0,"cool":0},"EH6l-yg6tquPhGFt1mNfTw":{"text":"We visited because of a 50% off Groupon. Also, hunger.  I'm writing this as we dine. It's ","useful":0,"cool":0},"BqPT4Q1_Kyu8MaXFfTa6Yg":{"text":"Not bad. We were able to get in with no problem, no wait on a Saturday night. We were seat","useful":0,"cool":0},"71YOR5bCRar4RJ9SwsLr7Q":{"text":"This is a fancy establishment with all the traditional New Orleans dishes. I had the jamba","useful":0,"cool":0},"Fp48lbGaSvmmA4dEHIVEzw":{"text":"Great food! Amazing service! We sat on the patio next to the fountain and it was nice. My ","useful":0,"cool":0},"295SzIb0srf5_2aHCt5e8w":{"text":"The most romantic restaurant we had dinner at. Nice ambiance on the court yard, the warm a","useful":0,"cool":0},"hwalvm4pJyuLSr17iYwVlg":{"text":"Touristy. Overpriced for the quality of food. Decent atmosphere/music. Slow service but ni","useful":1,"cool":0},"laxgAI3z2QozOVvdYlrP0w":{"text":"Worst frittata I ever had. Stirred my coffee with my fork. Basically I just spent 30 dolla","useful":0,"cool":0},"ER1xXe4WQfA5Uutzx_5w9w":{"text":"We stopped here after place we were looking for had closed down. We were not disappointed.","useful":1,"cool":0},"lvOoLlbJUdbzdGs0XF0cjw":{"text":"Amazing food, amazing staff! I can't wait to go back just to eat here. The portions are ex","useful":0,"cool":0},"lZPdW11rfkio-o9BwUEONQ":{"text":"Nice location away from heart of French Quarter. Beautiful, traditional New Orleans style ","useful":0,"cool":0},"ZSOQ-gmiuPnnDZrs7l-leg":{"text":"Food was excellent!! Great location and ambiance. Very romantic and food was exceptional. ","useful":0,"cool":0},"NEcA24eGumlOnju9RIhCPA":{"text":"Wonderful food (I had the Taste of New Orleans sampler) and a nice Sazerac with a kick.","useful":0,"cool":0},"UfCTgrj59W3CN01i-ADRbQ":{"text":"OMG...The Blackened Redfish was out of this world, by far the best meal I've had since we'","useful":1,"cool":0},"vbWo20FqQvg7IGk4YijpTg":{"text":"Food was ok. My food came out cold. I'm visiting from Texas and wanted at the taste of New","useful":0,"cool":0},"ObtMiRvJe1O9NzVce8O2aw":{"text":"Make sure you get the 50% off Groupon when you come here! Try the Taste of New Orleans and","useful":0,"cool":0},"WX4dA6kwbPf9HmwGnCM3Xg":{"text":"This is a white table cloth restaurant and is top notch.  Service is great and the food is","useful":0,"cool":0},"knuQhRL79HQTQUzuBKYsBQ":{"text":"$9 dozen oysters $6 crab cake napoleon $3.50 gumbo and $4 jambalaya on happy hour are not ","useful":0,"cool":0},"2CwX5Ab-LPCCGoQapU-PyQ":{"text":"The Chargrilled Oysters are to die for! Sit at the bar and have awesome conversation with ","useful":0,"cool":0},"7g0j9Lq7_cpHY8hG4oWJXQ":{"text":"The food was amazing. The service seemed a bit disorganized when we were first seated but ","useful":0,"cool":0},"6NddxaZLSKfqME2UmZTlJg":{"text":"Best bloody Mary in nola. Probably the best I've ever had.  The grilled oysters are way be","useful":0,"cool":0},"o1kCH9p0Z3q3w7Al5OSY6A":{"text":"We sat at the busy bar and enjoyed a dozen char grilled oysters. They are shucked and prep","useful":0,"cool":0},"uniCe9UqnAy7mNUPBSswGw":{"text":"We found this place by accident. While walking by, a very nice lady invited us in to look ","useful":1,"cool":1},"cNY8dJn3BFnehJqdI5kFkg":{"text":"Food was excellent. The Redfish is a great dish. Our waitress was really nice and attentiv","useful":0,"cool":0},"lCIbcBfgNPYh3uzjzpzrFQ":{"text":"Randomly stumbled in here.  The courtyard with fountain was lovely, service good, but food","useful":2,"cool":0},"BZZkVLmMSaQE8Kxs-QvRvg":{"text":"We loved the food here so much that we came back the next day because we were too full to ","useful":0,"cool":0},"w54FGVVyEI6HOSM26S4ZFw":{"text":"Absolutely fantastic experience! Food was amazing and the atmosphere was great! Highly rec","useful":0,"cool":0},"kMvIKa2NFnerpjfKn0SB4g":{"text":"I was going to have lunch but i saw the servers and cookers smoking weed across the street","useful":0,"cool":0},"6Q_XeYgaM5SDlySAA00TwQ":{"text":"This place was good and the food was pretty good. My problem with it was the service (mind","useful":1,"cool":0},"IMFvFPkY9zrAdNy4uijMEQ":{"text":"We had dinner here our first night and we were not disappointed. So far the best red beans","useful":1,"cool":0},"rY6MZgGa79MR3-EmNp_g5g":{"text":"Excellent meal! Never been here before on my past 5-6 trips to New Orleans.  Split the the","useful":0,"cool":0},"-VzKT6onaO3Yywm7cSiazA":{"text":"This was a great place.   Sat outside with a group.  The waiter, Kevin, was awesome.  He e","useful":0,"cool":0},"DxbPUlN2MN8JFWRIQtTxAw":{"text":"Wow. Just wow. Worst experience in New Orleans so far!!!! We were recommended to this plac","useful":5,"cool":0},"VvUzFm8jrm2802N0UTT2Ig":{"text":"I'm not from the area, but just had the BEST experience ever! The food was AMAZING, follow","useful":0,"cool":0},"jp1yQARgg8TjHrs2KJChKw":{"text":"Sat in the bar because we were pressed for time to get to a concert. Service took a little","useful":2,"cool":1},"3nHUFY7WDZ3ZPm_mgZuWHg":{"text":"selected this place for its creole menu - and we were right to do so.\npasta and shrimp was","useful":0,"cool":0},"2Sd5Zf-08F4RIeBFwgvNOA":{"text":"Excellent outside seating with live jazz performance.\n\nAlligator bites were delicious.  Co","useful":0,"cool":0},"iymy4bB-_bgo-EjdQtUiKg":{"text":"Must have dish is the pecan crusted red fish. All of the food is good, but THAT dish...AMA","useful":1,"cool":2},"D2eAhEKmzRXkKqVQQVzktw":{"text":"Classy & authentic!  So nice to enjoy a more refined atmosphere in the midst of the rough ","useful":1,"cool":1},"f4yfKgb2wYBdXrQLOMX0iQ":{"text":"We stopped here a couple of times during our visit.  First time was great.  Had a couple o","useful":0,"cool":0},"IgbB1kLALIiib6-e9Tr-rQ":{"text":"Great service and food! We don't usually go to the same place twice on vacation so we can ","useful":1,"cool":0},"35KDTPKr__mv8jjkyygPWA":{"text":"Great food, Great drinks, Great service. I was wanting to try all the \"essential\" creole f","useful":0,"cool":0},"2yOkSEQvGiTIgiWxQe4F3g":{"text":"What do you do when your vegetarian but want to eat Cajun in New Orleans? Go here! Everyon","useful":0,"cool":0},"Af91VAFsL7OVK31ekdi6bA":{"text":"This place has the best Char Grilled oysters I have ever had. We stumbled on this place by","useful":0,"cool":0},"BpRpXTHH8n5TihQbUcpzAQ":{"text":"MICE!!!  MICE!!! Mice!!!\n\nNot even an acknowledgement by the Manager after being approache","useful":2,"cool":1},"ZQE1JSG_-0ULGPy5Flcv-Q":{"text":"1.00 charbroiled oysters for happy hour...but add to the fact they were the best I've ever","useful":0,"cool":0},"qXUmGF75jMaxYzyAjrwdEQ":{"text":"With Frank at the door and Jack on your table, you can't go wrong here. I came in for a la","useful":1,"cool":0},"z15t35YjVK21dZjs250QZA":{"text":"If I was able to title this dinner I would call it \"the most expensive stomachache I've ev","useful":1,"cool":0},"h6Eyn1EA0SunoEP6sG2kog":{"text":"Great happy hour food prices! It was fresh and super tasty. Definitely a little dive worth","useful":0,"cool":0},"0R8CW3x5xwXw7vKl6v83uQ":{"text":"This is a really great New Orleans eatery off Bourbon (meaning - easy to get a table).  Yo","useful":0,"cool":0},"A_oMYY1ibFq6tArFZ1NUMA":{"text":"I gave it four stars mainly because of the good service and the even better Charboiled oys","useful":0,"cool":0},"vCLILxMLz5KehK7rMtKYjQ":{"text":"We had a really nice dinner here.   Seafood pots, duck, fried shrimp, hush puppies, hurric","useful":0,"cool":0},"JRCRityonauUbka2KI0SOA":{"text":"This is a great restaurant! There is a wonderful ambiance in the courtyard outside with gr","useful":0,"cool":0},"xM6vVshKH42TIylnHgs9Cg":{"text":"The food gets a 4 but the service was really poor.  I put this on the manager.  Our party ","useful":1,"cool":0},"HBdyB2SGXpXT9HGMlJDa7A":{"text":"Incredible! They have happy hour from 3-5 PM! They offer 50 cent raw oysters & $1 chargril","useful":0,"cool":0},"sy-JnFIlakOnwa9zEviyOg":{"text":"My dad and I were looking forward to eat at this restaurant, and we left very dissapointed","useful":1,"cool":0},"5iLK4vg5Y33P0l7080sRXA":{"text":"Correction-it is loud when the entertainment is going on but very enjoyable-kinda jazzy!","useful":0,"cool":0},"RmqNiR8TbjYTHcia1BQNlw":{"text":"Simply a masterpiece.  The best crab cakes we have ever tasted. Fantastic outdoor patio. A","useful":0,"cool":0},"WliPE_-Ybh2Tpe10AKUfGQ":{"text":"Tried the taste of New Orleans Sampler.  3 out of 4 were great!  Also had the chicken & An","useful":1,"cool":1},"1HM74Sp4NBbVpvdWhXSi-g":{"text":"The restaurant is located in a very nice part of French quarters next to Jackson park. The","useful":2,"cool":0},"U5ZVy6_3Ropn8s0mPABoeA":{"text":"The food was good.  The Crab Cakes Napoleon was amazing - light,  deliciously seasoned and","useful":0,"cool":0},"NAlOduCUNMWaTMqeAE0mXg":{"text":"Fantastic atmosphere and delicious food.  Server was competent, not friendly, very robotic","useful":0,"cool":0},"zu-gEMgguylCy9gEmelopg":{"text":"Stumbled upon this place while our group was walking down the street. We weren't planning ","useful":0,"cool":0},"p_CvDKaFT2QI7MIbqgNiqg":{"text":"This is a fancy establishment with all the traditional New Orleans dishes. I had the jamba","useful":0,"cool":0},"PU4pL1r3nSnhDN70lOHr1w":{"text":"So the food is great but watch out for bait and switch pricing. Sign out front said 1$ oys","useful":0,"cool":0},"GxL6lnOfM3Mf-Z23fO_Nxg":{"text":"A friend recommended this place for dinner and the second we got there, there was a men th","useful":1,"cool":1},"5tJ6baIJ70Y5pS2jnTT6BQ":{"text":"disappointing experience.\nI give it three stars because the place is pretty on the inside.","useful":0,"cool":0},"YIf7ydNnlqr-UkRxpmMZBw":{"text":"Food tasted good. However a sauce was left a dish. We had to go find (yes find) our waiter","useful":0,"cool":0},"YMic2GIMaYUsQbK_34quFw":{"text":"We had a wonderful experience at The Creole Cookery. It's located right in the heart of th","useful":0,"cool":0},"nFBFlPZoKwVImQUmRxmG5g":{"text":"Our hotel guy recommended this place and we wanted to check it out. But we decided not to ","useful":0,"cool":0},"ywW6UqR7HOXob-NUsoKdQA":{"text":"Came here for lunch around 1:30 because of good reviews on Yelp and a recommendation from ","useful":2,"cool":2},"l6l0FzRwpWTgwjsG1nCfWQ":{"text":"The food was really good (I had the catfish plate). The service was good. We went at a tim","useful":0,"cool":0},"1lVxv_GMMfVdZcl8xuaazg":{"text":"Great service (by Evan), great food (charbroiled oysters) and charming atmosphere with amp","useful":0,"cool":0},"LWesdBPmwt7cP3Iqb5PuLA":{"text":"Definitely worth a try, but ask how much drinks are before ordering ... thus the 4 stars. ","useful":0,"cool":0},"hIeJcb6nRIhTbjph-bSPHw":{"text":"Very friendly staff, fast service, good food and big portions. A group of us went for dinn","useful":0,"cool":0},"xzVqgmbMXElhELYThqeWDw":{"text":"We ate outdoors in the patio area at night, which provided a great atmosphere. Excellent s","useful":0,"cool":0},"WoSMWCWUwgEIkP8hl0DxQw":{"text":"I REALLY wanted to end my trip to New Orleans with some delicious Cajun/Creole cuisine. Ma","useful":0,"cool":0},"8mvPSi_R8nznVz7G9zfd-g":{"text":"I read Jessee M's post six days prior to mine, and I thought that perhaps the restaurant c","useful":1,"cool":0},"LoYIQJ3lDl3lROvCZoFLTA":{"text":"Came here for my bachelor party dinner. Service was great! Gator bites were delicious. Got","useful":0,"cool":0},"I3OwdeMVT-LiQhLfe3qLJg":{"text":"Well, it's a lovely place they have, beautiful architecture and all. I was expecting somet","useful":1,"cool":0},"PfYZ9f2C-Smw9nEAqHa6Fw":{"text":"The best charbroiled oysters!! We loved it so much we came here twice during our vacation!","useful":0,"cool":0},"ub-lt5bqqurSLKTwM1OqFA":{"text":"I loved the bacon Bloody Mary, but it'll set you back $15. I had a Groupon for $40 towards","useful":1,"cool":0},"KpIEyYwiLrlcb0qMxVO5rg":{"text":"Jambalaya and gumbo were excellent as was the red beans and rice. Shimp cocktail and creol","useful":0,"cool":0},"EGSUsE2aqsYDU0dWeB0VvA":{"text":"This place is amazing! I tried the crab stuffed mushrooms, jambalaya, battered catfish and","useful":0,"cool":0},"kMyIHr5KVYksV1AhA-YnYg":{"text":"Came here for a nice dinner tonight. We where a party of 6 (auto 20% gratuity). Waiter kne","useful":0,"cool":0},"oWo6OKzPH7eyFoFdYn5owQ":{"text":"Shout out to Wes the bartender! Super nice guy who deserves the recognition. I hate using ","useful":0,"cool":0},"P_TXljSGyoU_eVBJmmDMkw":{"text":"Good food and drinks but wait staff wasn't the best! Dirty restrooms.Would give them one m","useful":0,"cool":0},"0zFmY0a2WXicvooE3-SaEA":{"text":"Swung by for oysters and beers during HH. Great oysters, super friendly staff and cheap be","useful":0,"cool":0},"zUM_XRpvFpUyoHmHVDWYAQ":{"text":"you want something better?....gonna have to wait for Heaven","useful":0,"cool":0},"JiH8UZzP9x2msoD40lFntg":{"text":"Warm environment yet group and child friendly. Terrific menu with a variety of classic cui","useful":0,"cool":0},"LKkI0D3r8twi_bXCl26o7g":{"text":"I loved this place if you come here get the jambalaya or crab cake and ask for max the bes","useful":0,"cool":0},"EdB_3-PTBC3L6gMxLvKqNA":{"text":"Honestly this was one of the best places I ate at in New Orleans! Everything in the French","useful":0,"cool":0},"0Ez9OOTfn7r3Z_REDhekEg":{"text":"It was pretty good.  Service was great.  Food came out pretty fast suggesting a lot of it ","useful":0,"cool":0},"MkIi14pTAabW0b1aN6S4mA":{"text":"Came here last night with the wife and a couple of friends for dinner. \n\nLove trying local","useful":8,"cool":4},"4aRLyLaPNHOSjDxkl7CPeg":{"text":"Love this place. They have a great happy hour. .50 cent raw  oysters and $1 grilled oyster","useful":0,"cool":0},"uu-ckjVUJBAaABrkFQUZww":{"text":"Yummy yummy. Great Happy Hour and service. If you are looking for a spot in the French Qua","useful":0,"cool":0},"fshbWqKS7zEw4lMQ7ggK8A":{"text":"Took a chance and so glad we did.  Great food, great ambience, and service.  Loved the cha","useful":0,"cool":0},"dRWHcpAJdxbYOg-RdVbt1g":{"text":"Absolutely, positively never again. We went in for dessert and drinks - the waiter was cle","useful":4,"cool":0},"U17rfd-2ceJazP-9FKycUA":{"text":"Cool place ,great food. Stuff mushrooms and crab cake are my two favs. You can look for th","useful":0,"cool":0},"skGMQKGcbcmly8BXLHXL-g":{"text":"POOR SERVICE & ATMOSPHERE (COPS TV Show)\n\n*No service for 10 mins after being seated (we l","useful":2,"cool":0},"1KAl4nFksRn4vmVHqZxoBg":{"text":"I ate at New Orleans Creole Cookery last night, based on Yelp reviews. We enjoyed it very ","useful":1,"cool":0},"to-gwxEbWYs06II2kT0ZvA":{"text":"Happy hour. Is from 3:00 to 6:00. \nWith  50cent oysters\n1/2 appetizers\n$1.00 char grilled ","useful":0,"cool":0},"pXoWtRnGXeAbyomSxADlgw":{"text":"Great food! Only this is my aunt asked for lemons several times and they were never brough","useful":0,"cool":0},"nrmrdVT59CSPU8ow-Gl3Ig":{"text":"Really liked the atmosphere..it's worth seeing. The inside and court yard exceeded my expe","useful":0,"cool":1},"fTZVHVgVPM7tF-RfhwnetA":{"text":"Two stars for each dollar they charged for a glass of water with lemon, dry 2 day old lemo","useful":1,"cool":0},"DkIkxn75A-XCqkUVfnDixA":{"text":"Do not miss this one!  New Orleans Creole Cookery is a fantastic family restaurant.  We fo","useful":1,"cool":0},"CeH9hJhj01e3OCR2gzj9Hg":{"text":"I came here on the recommendation from some cool guys that I met at a bar earlier. One of ","useful":6,"cool":3},"iySEws742s21F3ADxMHxIw":{"text":"The food at Creole Cookery would have earned them four stars.  I ordered red beans and the","useful":0,"cool":0},"NNtNuJVyx86SiG0b1GlYRg":{"text":"Worst service in the Quarter. Waited over 20 minutes and all we got was the waiter coming ","useful":0,"cool":0},"TzGFJOVnNCEDcGo4CYm8nw":{"text":"The food was perfect and delicious.  I had the crawfish  etoufe and it was just right. The","useful":0,"cool":0},"5bDvK4N4UcK328EC_9uL7g":{"text":"We had an excellent dinner at NOLA Creole Cookery. We started with the Alligator Bites, th","useful":0,"cool":0},"_B13UJ8HS2NVEOXNYFbzlQ":{"text":"My girlfriend and I went because we got a groupon. We are local but can't turn down a deal","useful":0,"cool":0},"idGNXTr2zUHrixNZpvTABw":{"text":"They do offer you iced water now when shown to your table. We dined here twice during our ","useful":0,"cool":0},"YsoksBIWZU2A8P1Zmn003Q":{"text":"We enjoyed our first meal in NOLA very much thanks to this fine establishment. Staff and f","useful":2,"cool":1},"SE0CjDvbXm_HVikFumCPgw":{"text":"On our last day in New Orleans we happened to go into this restaurant. Our waitress Jess w","useful":0,"cool":0},"BkTLpwFbaaz8XtcB4sT5Rg":{"text":"I really hate to do this but restaurants need to understand that when they attempt to chea","useful":1,"cool":0},"7ImE-skEMos3DuLoL5ew5A":{"text":"Wonderful experience with top notch service! Ms. Sue was fast and efficient and enriched t","useful":0,"cool":0},"MtmjAOp40e9kA5mRswkW6w":{"text":"The decor is cute. Patio is lovely if the weather is right. We had the trio of red beans a","useful":0,"cool":0},"rNxg1ly61O-gkPxbhZmrSA":{"text":"This was the most horrible gumbo I've ever paid for!  Do yourself a favor and skip this pl","useful":0,"cool":0},"QZn3ewtOwLDCWICkOkFW3Q":{"text":"Going five stars on this visit.  Excellent blackened redfish and Pasta Orleans. Service wa","useful":0,"cool":0},"3_RRAtjU4VTJdXAUdCcm1A":{"text":"The service was good, my date had great crab cakes I had very poor crawfish étouffée which","useful":1,"cool":0},"NnpH29fPwTxw59-wREd8rg":{"text":"Came here twice during my stay in New Orleans. The first time I ordered the taste of new o","useful":0,"cool":0},"DMO678KUUHad6fBF7ztSqw":{"text":"The music and atmosphere was amazing! A true Cajun flair nestled into a romantic dining ex","useful":0,"cool":0},"dP8NrdN9k9iPX8BRw5YvoQ":{"text":"After smoking a pinch a few times in my hotel bathroom I was ready to get out for some foo","useful":0,"cool":0},"G_MV5_BGHaoOhkaJ5mYsoA":{"text":"Decided to narrow our options and eventually chose this spot...so glad we did.  Very nice ","useful":0,"cool":0},"juKtskFaAcoO1mEh9RY1UA":{"text":"Good service. Average prices for the French Quarter. The blackened redfish was tasty, but ","useful":0,"cool":0},"HnEAqMAegtm2YNewhgGHeA":{"text":"Took my family who was visiting from Boston for seafood and it was delicious! We sat in th","useful":0,"cool":0},"AIR2tVjk0xsf7BO17W2nTg":{"text":"We were treated like VIPs!  Here we were wandering around and, before we knew it, Solomon ","useful":0,"cool":0},"nQLz-Ga8iPUZGeUtqLbGQA":{"text":"Wow. Our concierge recommened it and was glad she did. Absolutely great food.  Fun atmosph","useful":0,"cool":0},"4C31dAQeILydp-bmaERf3Q":{"text":"Came here for lunch. This place has a fresh-off-the-cruise-ship sort of feel with comicall","useful":0,"cool":0},"IdUu-Xn-Nai2YsbRXeM26Q":{"text":"This was a recommendation from our hotel concierge and it was amazing! I had the creole pe","useful":0,"cool":0},"PI1acFQEls14daugKfRXEg":{"text":"If you're looking for a nice comfortable place to relax with great food this is the place ","useful":0,"cool":0},"EyOam4ZzBtR9vhG0mkqK1Q":{"text":"Stumbled upon this place walking through town and it immediately drew us in. The ambience ","useful":0,"cool":0},"5OUKgaj53H81B6b0FI8v0Q":{"text":"The appetizers are very good, excellent presentation. However, entree (which is twice or m","useful":0,"cool":0},"tP50JISfCy6Mkps-cU8EgQ":{"text":"Waiter was so soft spoken couldn't hear him. Food took 40 minutes to get to us and creole ","useful":1,"cool":0},"_wdQ0qGh3fGEyZCpwOWpQw":{"text":"Went for happy hour and had a collection of New Orleans favorite for half the price of goi","useful":0,"cool":0},"2Su-8AKF2uIixLY6qujM_w":{"text":"Nice restaurant and entertainment on a Friday night. The boiled seafood bucket was very ta","useful":0,"cool":0},"ftiVWOZUDTm_jA6b-22fHw":{"text":"You are missing out if you don't dine here! The food, the service, everything was more tha","useful":0,"cool":0},"VELyAzFNXh5rEy7q5cHC8A":{"text":"Atmosphere was beautiful, brick walls, quiet tables, street view, band and fountain outsid","useful":0,"cool":0},"Kj8ksvtX0_D5BUhtNaqg5g":{"text":"Great food, especially for Happy Hour! Half off appetizers and oyster specials! Wonderful ","useful":0,"cool":0},"3k-nwNuBVJM99zWHD0rBlw":{"text":"Swung by this place for breakfast on our first morning in NOLA. Top-rated restaurants arou","useful":1,"cool":1},"R4VUiMSMTkUDpOwq9bRgvg":{"text":"The food was excellent. I challenge anyone to eat everything on your plate. We very please","useful":0,"cool":0},"J3tXg-o14HNAJ2xthrrS0Q":{"text":"My service was By far the worst I've ever had in the downtown area. My date and I came to ","useful":1,"cool":0},"b2AWqRgWT-w8ELhCD9DiXg":{"text":"Wow! I really enjoyed the atmosphere. food was amazing!! after a long day of work it was d","useful":1,"cool":0},"yCCXoNNT1MRKwxdedG2m2A":{"text":"Was convinced to come inside and eat in the beautiful courtyard. It was very nice. Listeni","useful":0,"cool":0},"NNguW4vvfdYahZPYMvjBNg":{"text":"Food was mediocre. It's definitely a tourist trap. The service was HORRIBLE, maybe worst I","useful":1,"cool":0},"CqeEYaBtv51oZxYhoLObHQ":{"text":"Best crab cakes ever! Wonderful courtyard, great ambiance. Shrimp and grits were to die fo","useful":0,"cool":0},"hFh1KKDmSWlB8i5poi49lw":{"text":"I rerurn tgis restaurant because the experience were good. Good food and excellent female ","useful":0,"cool":0},"0r3RUjjaYI-R2GmPHwMH4A":{"text":"Food was really good.  There were a couple of seafood pasta dishes at our table that were ","useful":0,"cool":0},"JyGKmpwAHU4fwbr5s8oGsg":{"text":"The staff was very attentive and sweet. The drinks were strong and enjoyable. The food was","useful":0,"cool":0},"BKFW-cdO6gT3MW9dRzqOCA":{"text":"I was told by a local to come to New Orleans Creole Cookery instead of joining the line at","useful":0,"cool":0},"3yiE11cL4nWfg_0uArGLdw":{"text":"The food was decent although I would have preferred spicier and the seafood gumbo did not ","useful":0,"cool":0},"tgJ49v50GBc5isF72PPv4Q":{"text":"My husband and I decided to go for oysters on our first night in New Orleans. So glad we c","useful":1,"cool":0},"PJ8bxpJjGy4h9LRFqrBUXQ":{"text":"Beautiful place. I had the shrimp pasta and hubby had the the redfish ponchatrain with hei","useful":0,"cool":0},"WIN24oXX-WlRVeUz9_9qlA":{"text":"We had purchased a Groupon for this as we were visiting from out of town. Although my shri","useful":0,"cool":0},"mQN5RkaTAEdhZvf5f9MNjg":{"text":"Nice atmosphere, excellent service... But the blandest crawfish étouffée I have ever had. ","useful":1,"cool":0},"Tm_iVC3rRKsleX0mgisQ6A":{"text":"Scored a Groupon for this spot; DAMN! Service was on point and food awesome; redfish delic","useful":0,"cool":0},"ATExu6qJH7_o6Vh0LSVlCQ":{"text":"Not only was the food sub-par, the service was absolutely the worst.  It felt like the sea","useful":0,"cool":0},"T65-v8Hv7NFMU_R0sbwZZA":{"text":"I'm disappointed by this restaurant. When we checked before to go we were very excited. We","useful":0,"cool":0},"Y1vE_5gAUArCCaAPsYJEbA":{"text":"I had the Blackened Red Fish. It was light and fluffy, truly wonderful! Service was excell","useful":0,"cool":0},"OQOM9HUxR3rlhZw0IoLn2w":{"text":"The Chargrilled oysters are delicious and larger than Acme's. The shrimp n grits is oh so ","useful":0,"cool":0},"tePbBEX04eiQ-qnF2gXbYQ":{"text":"The grilled oysters are to die for!!!! We've been back twice this week. Service was great,","useful":0,"cool":0},"v8dmLGHpo8VGYogIPpbRog":{"text":"I first visited this restaurant on the eve of Halloween, and appropriately so because the ","useful":0,"cool":0},"_qohxiphoEitF5IWN096yw":{"text":"This place was amazing and accommodating to my group of friends, including two vegetarians","useful":0,"cool":0},"ZdOos0S5cAcGkm9okMcNAw":{"text":"Service was great and food was good, jambalaya and creole casserole were oK but not impres","useful":0,"cool":0},"tpFcp6qup4Ckk11vuqVLOQ":{"text":"Not impressed, not even a little. This was a spontaneous Sunday evening dinner trip so we ","useful":2,"cool":0},"IGb2qmf88IAlC1KekZfwkA":{"text":"3 stars 'cause we got a missunderstanding on our order.. We are not big eaters so we alway","useful":0,"cool":0},"5JgpMRbn02TIiYw5tuWXJg":{"text":"Expensive bad food, run away!  Run away!  Bread had taste & texture similar to elderly ham","useful":0,"cool":0},"8KSnY94S1ycG_w8WK8Y8qg":{"text":"ratatouille..\n\ni bought two groupons based on reviews and because if the great deal. my gu","useful":2,"cool":0},"oo2jLIu6nBuAN_JHddWnWA":{"text":"Saw my favorite 2 words hanging outside a restaurant \"Oyster Bar\" so the wife and I popped","useful":1,"cool":0},"XLU4EdKqemLOvFq1DJfkwA":{"text":"The food, by far is 5 stars. We had the Red Beans & Rice and the Sampler Platter.\n\nThe 3 s","useful":0,"cool":0},"3VBld2gNgl7RB1uwGTF3Lg":{"text":"This place is a gem!  We ate here twice in the same week - the food here was so good it wa","useful":0,"cool":0},"hPmp_5N3w-fg8fxuqkqO2g":{"text":"First best thing about this restaurant is that it was simply around the corner from our ho","useful":1,"cool":0},"kPZSQM0Ae9AmvDR_wcdWlQ":{"text":"Best meal we had in 4 days in New Orleans. The Cajun gumbo and crawfish ettouffe (sp?) wer","useful":0,"cool":0},"pCp3kbEvla7jkVblPiE41w":{"text":"AMAZING!! The food was really delicious. I ordered cajun pasta and my husband catfish and ","useful":0,"cool":0},"XZH2Ik-hiUeFCJpYbhIVCA":{"text":"The food was delicious and they had live jazz! We will definitely come back! Awesome outdo","useful":0,"cool":0},"tqJv67sec5p95qHLZtXwYQ":{"text":"The atmosphere is fantastic the service was stellar. The food was great maybe not five sta","useful":0,"cool":0},"CVHrQlQerw85n4jWeIKIXg":{"text":"Had the Orleans Pasta, loaded with shrimp and very flavorful!! Great live music and amazin","useful":0,"cool":0},"At8h2rEhKa114Uvx5lbQQQ":{"text":"So driving through New Orleans, we had to stop and explore the French Quarter, which is a ","useful":0,"cool":0},"mknqz7a7SRW2XSaHQllB5A":{"text":"I visited the Cookery while on a work trip. The staff was welcoming, it was very easy to g","useful":0,"cool":0},"Vv-5r381nfTCMADmKFwB8w":{"text":"Amazing bar staff! Tiffany helped us with some great recommendations in the area and also ","useful":0,"cool":0},"YkkzXJBXoOjRxC_JkDiSWA":{"text":"The food was great. We got the chargrilled oysters (this is a must-have when you go to thi","useful":0,"cool":0},"eU0ko-xzJtAY9em0DifhCQ":{"text":"I came here for a late lunch with a small group of friends for one of their birthdays. The","useful":0,"cool":0},"fTIhfU3EgnLm-5m2rxADzA":{"text":"Place was top notch! We happened by on our way to get a foot message... The barker called ","useful":0,"cool":0},"qblLRchMb1k42DFiX4UB9Q":{"text":"Nothing short of amazing. From the street we were beckoned in by the host. We perused the ","useful":0,"cool":0},"W-tIvQgt1WHzlUbg_7fGDQ":{"text":"Our first night in New Orleans, we were hoping for good food and a good time.  Not to be. ","useful":0,"cool":0},"wer4qjleajshshQtNVxOmQ":{"text":"We ordered the sausage with red beans, and a bowl of seafood gumbo.  But before I tell you","useful":0,"cool":0},"Z4vKAWtP1BP3ArN2qQANaQ":{"text":"We started with an order of fried pickles. They were so good! I've only had fried pickles ","useful":1,"cool":1},"85sy9uvVtlgQwajraabmwA":{"text":"Absolutely fantastic.  The Shrimp Remoulade is excellent, not afraid of using seasoning he","useful":0,"cool":0},"jeIIO5LC7Y0ntdMD2WFqVw":{"text":"This place was most disappointing. The seafood is NOT FRESH and everything is generally ex","useful":0,"cool":0},"oFgWh4BMXLyVJ_0t6B_qig":{"text":"My second time and my last. The service at the bar was excellent. The chargrilled oysters ","useful":0,"cool":0},"7VsgfMF6eKdKav_ehR3N_w":{"text":"Food was excellent. Large portions, too. Five people ordered three entrees, two appetizers","useful":0,"cool":0},"g3QjgkOgXqFLRXy5EUmC0g":{"text":"Best fried catfish I've ever had. Same for the fried shrimp. The live music in the courtya","useful":0,"cool":0},"uy1oTvoZ5I2F0mdiemVGDw":{"text":"First time at the cookery. It caught my eye as I was walking back from the pier. Beautiful","useful":4,"cool":1},"B8p6_N8vB-a4BhH-mOM5VQ":{"text":"my boyfriend and i came to visit new orleans and we had to do one of those voodoo tours. t","useful":1,"cool":1},"J6bwVXmdIDW3sCM455d88w":{"text":"Scrum diddly umptious! Seriously, can you go wrong with gumbo, jambalaya, crawfish, & Creo","useful":0,"cool":0},"8OpIkOJsTBkx1DnUdZn6zQ":{"text":"This is the most terrible seafood restaurant I have ever tried.  First of all, the chart g","useful":0,"cool":0},"kT3kUn9b8MoOwnD6R0xI-g":{"text":"I used a groupon for lunch and made a reservation for lunch.  When we arrived they did not","useful":0,"cool":0},"lVYxGuosFNZzi-S8YJFOtQ":{"text":"Our third and last night in NOLA and this was disappointing. Our waiter was unsightly, shi","useful":1,"cool":0},"8jD9jX4ledEkX_77tJmJfQ":{"text":"Loved our experience.  Great music with Spring and our waiter Charles was fantastic.  High","useful":1,"cool":0},"WNWFvtbxc2SYVSEbMmWiig":{"text":"Great food and excellent service! Charles was fantastic and renowned chef, Alex Patou gree","useful":0,"cool":0},"HvOiRj3Ng8WSHJb70LFMGw":{"text":"Read all the good reviews and made it our first stop in NOLA trip. Got the $60 Groupon.\nAm","useful":0,"cool":0},"4k4IQmzxRkJVS4M9dMxrsQ":{"text":"The food here is AMAZING and the bartender Tiffany was awesome. She was very friendly and ","useful":0,"cool":0},"43GjLnO5OQSjhhj4YDyYiQ":{"text":"We were hesitant at first because there wasn't anyone eating here. The crowd eventually ca","useful":0,"cool":0},"3eCJ3kXjOAh6io6gbOy2OQ":{"text":"Loved this restaurant, which came highly recommended by a local. A wonderful meal in a ver","useful":0,"cool":0},"wRydR_ysXVQrC8M5GGwvjg":{"text":"1.5 stars.\n\nI'll round up because the door man was cool.\n\n$9 for 6 & $13 for 12 oysters OT","useful":9,"cool":6},"ROV37rwWGSSP_Z0NY4LV7A":{"text":"Ryan, the manager, and waiter Mike made my parents 51st wedding anniversary a truly wonder","useful":0,"cool":0},"XGNZQpZk0YpY0lh19fxufw":{"text":"Service was excellent. Had the catfish and jambalaya... The catfish was cooked perfectly. ","useful":0,"cool":0},"SdEnOTxUPD6CHbpxCfv4qQ":{"text":"We came across this place because Groupon suggested it since we were planning a trip to NO","useful":1,"cool":0},"hOSJHM1KmJsXNzs301gq5g":{"text":"Creole pasta 4.5 stars- my fiancés favorite dish of the night. \n\nTaste of New Orleans 3 st","useful":2,"cool":1},"2hD0wvK4ENhlcLTMiik3sg":{"text":"Service was horrible as were the crab cakes. They were supposedly 90% crabmeat which was f","useful":0,"cool":0},"k3UycIKJVeppV64Ar2IDFg":{"text":"Nice courtyard with surprisingly good food for the touristy location. Odds are good that y","useful":0,"cool":0},"wqtG7aeuaNcGCTjIyhsxzg":{"text":"Went here based on the 4 star Yelp review but don't believe it - it is just an average 3. ","useful":0,"cool":0},"hgfRcrWKgTgGVHz4x93AZA":{"text":"Pros: The look of the place is stunning. Great indoor and outdoor bar area. The food was g","useful":2,"cool":0},"5qwGiBnTUelZsar0xVlI7w":{"text":"Used a Groupon for a nice Sunday brunch. Food was good, our waiter (Walter) was fun and th","useful":0,"cool":0},"3Eji2r7fHu5DN2AJPe0xmQ":{"text":"Man . The  best meal my mom and I've had since we've been in New Orleans . We wanted to tr","useful":0,"cool":0},"sAYQCrGBdtnTihoNTITTdg":{"text":"Highly recommended!  Great atmosphere with a fantastic and friendly staff.  The redfish wa","useful":0,"cool":0},"s1vKKC9S-BINJKTw4Q7aRQ":{"text":"Vegetarian pasta is shit. So gross and $23 are you serious? For sure will skip this place ","useful":0,"cool":0},"tt15oXLfTMTNy3WW-PtOZQ":{"text":"Service is reeallly slow. Pricey food but you really have to wait for it. Do not recommend","useful":0,"cool":0},"LGbiHOpzjW-YljaReqxKVA":{"text":"I was very excited to try this place but was almost immediately let down when our waitress","useful":0,"cool":0},"2Bm2dQLbVGE8V5X5mE33xg":{"text":"oversalty, heavy hand on the salt on the new orleans sampler. but great atmosphere, jack's","useful":0,"cool":0},"imTEorIQQg2UBN9KtLQASA":{"text":"Came here on recommendation of hotel doorman. So glad we did. Great atmosphere in the cour","useful":0,"cool":0},"01tWjWwNV_qEFmJxUyCg1g":{"text":"Horrible service, we had a reservation but had to seat outside. After 20min the waitress c","useful":0,"cool":0},"1ynGMAP5LXtaenWSLMsGmA":{"text":"From the beginning to enter the room, I do not the waitress attitude and felt not welcomed","useful":0,"cool":0},"HOxjV7SWo4ayvphynxOVdA":{"text":"Worst service I have ever had. The server was not friendly at all. When he brought the cal","useful":0,"cool":0},"k0MdXeapV-outk_CT-SM-g":{"text":"Locals & Tourists,\n\nThis restaurant was absolutely everything I wanted out of my New Orlea","useful":0,"cool":0},"3geka1iViBnmP9oJlxKRRQ":{"text":"We walked by this place several times during the day and it looked intriguing. The Yelp re","useful":0,"cool":0},"AfDLYN2M3NavQmVWb7GCWA":{"text":"Stumbled upon this place. Amazing atmosphere, flavorful food and great customer service. W","useful":0,"cool":0},"QfotfIOe1Jt3KRzmw2z2pw":{"text":"Food here is great as well as atmosphere... although this was originally a negative review","useful":0,"cool":0},"IH23W8xerTNcDXiGnv_5Fg":{"text":"Really didn't enjoy this place. It was far too touristy for my taste. In the middle of the","useful":0,"cool":0},"-BA_DFDdBQnouyJmGELJ5g":{"text":"Atmosphere and food are really great. The staff is very nice, but they lack organization. ","useful":0,"cool":0},"CWXmFzLfPqp03MNRcGYirg":{"text":"My mom and I are both managers at two different restaurants, in different states. We know ","useful":0,"cool":0},"Ok8q-lzMrImqCUcPXxm9Xw":{"text":"I never write reviews, but feel compelled after dinner here this week. I suspect our serve","useful":0,"cool":0},"xOQBFSwgLd17GSZs7S_49w":{"text":"The Maitre D' lured us into here (which judging by the reviews seems to be consistent).  I","useful":1,"cool":1},"pHlCsYakgqPmACl3ASnCLg":{"text":"We got a groupon deal for dinner. Char grilled oyster was good, the rest were so-so.  Wait","useful":1,"cool":1},"VXpGh7uxz7LHM_jdggy2AA":{"text":"Great raw oysters and very entertaining shuckers at the bar! Nathan, the bartender is HORR","useful":0,"cool":0},"Szs-KOxymCWARkUHYvXw7w":{"text":"SO GOOD! My husband ordered the Taste of New Orleans and I ordered the Pasta Orleans. Both","useful":0,"cool":0},"N0nWB8xlOp2WDcGFrVoG4g":{"text":"The food was amazing! And don't hesitate to ask any of the waiters on the history of the b","useful":0,"cool":0},"92Q20CmDOOlg8YWaW8hxRg":{"text":"Stopped in for lunch.  Beautifull and well appointed restaurant! What a great experience! ","useful":0,"cool":1},"iSe4A6TKD_ltFjG3FmmEwQ":{"text":"This was the last stop of our ghost tour as apparently the condos above the restaurant are","useful":2,"cool":0},"k1kc73DPMQ9qM8P0kb7u8w":{"text":"Really good,  waiter was a bit not attentive and forgot to ask if we wanted drinks but the","useful":0,"cool":0},"XnH-ZYtCIfDWEf8Uy2V2LQ":{"text":"Best happy hour in town!  Came here for some good oysters and Angelle did not disappoint. ","useful":0,"cool":0},"e-nfmXinJ2qYr8tRBHXREA":{"text":"Had a quick bite here had the sampler food was very good looking forward to going back ver","useful":0,"cool":0},"kdZmpKAD_dCrtZpw-nnoHg":{"text":"What a great place.  Super good food great ambiance.  Live music on the patio.  Good servi","useful":0,"cool":0},"N5RiME6lxhLkp7x2vlf8eA":{"text":"Amazing food and extraordinary customer service. The inside is super spacious with multipl","useful":0,"cool":0},"cs-GvfjYyEDMS2lCZaUFxA":{"text":"Beautiful restaurant with lots of outdoor seating, including a back terrace. The food was ","useful":0,"cool":1},"7x6TVzQQQkFv8Ccjm3826A":{"text":"I REALLY wanted to give this place 5 stars, but I cannot. I'll start with the single negat","useful":3,"cool":1},"rIX3C0EsUC9mY58pd2p1Dw":{"text":"This is a fairly new place but they are on point! The hushpuppies were crispy goodness wit","useful":0,"cool":0},"sJz58LARwHDq0H1Ijl0XUw":{"text":"This place is wonderful. Visiting from SoCal, all the food began to taste the same by the ","useful":1,"cool":0},"CkFROGm-lSuuuaNjJb1Uig":{"text":"Felicia, our waitress, was the true essence of Louisiana hospitality as she offered us the","useful":0,"cool":0},"MAbYMaNu5YgDktFuq-GuuA":{"text":"Food is decent but service was horrible. Waited forever for our bill, so long that we almo","useful":1,"cool":0},"D34bzDRu7YUw775CPBhZTw":{"text":"Lovely place off bourbon street\n\nChar broiled oysters and Cajun calamari. Can't get them i","useful":0,"cool":0},"y9s0tDhPb2_-NV-o99yZRw":{"text":"Everything was amazing! Food was delicious, service was top notch and menu options were th","useful":0,"cool":0},"NMMjJrnXqdzeonp4vRylgQ":{"text":"First evening in NOLA and looking for creole food. Pontchartrain redfish was tasty but a l","useful":0,"cool":0},"voFafGL-ntXKC6ZON_Xw0A":{"text":"This place was average.  I've come to realize the service in the big easy is very slow.  W","useful":0,"cool":0},"AbFv1YTzYA_ux7C3_yBs_w":{"text":"The reviews held true. Oysters are very good, but the drinks are inconsistent unfortunatel","useful":1,"cool":0},"VbC4K19s7ZP6_u7C1cb3Xg":{"text":"Terrible service. The house salad with mustard dressing was delicious with and without chi","useful":0,"cool":0},"zouHi2FnXaZKHiKl3AmDyw":{"text":"Arrived early (5:30 on a Thursday night) and there was still street parking available. A d","useful":0,"cool":0},"RnLgNjA-Rv_NydCyHGLiDw":{"text":"Had a big work dinner here and everyone really enjoyed the food. They were super helpful a","useful":0,"cool":0},"CZuM3ldMec9ZrJDzaTStgA":{"text":"On our recent trip to Nola we stopped here for happy hour. We sat at the back bar and orde","useful":0,"cool":0},"StODLDL1hrg4W555Nmk95Q":{"text":"Searched 'best jambalaya' in New Orleans and this came up.  We tried the crab cakes and Ne","useful":0,"cool":0},"-PK6nxm_P1zpI29RFdul-g":{"text":"By far the best restaurant in Nola!! In fact their hospitality was so good they are the re","useful":1,"cool":0},"uuniCjEdoAD8wm7PKhczIg":{"text":"Excellent food and great service. We had the jambalaya and the crawfish étouffée. Both dis","useful":0,"cool":0},"sAiSxZGf-TmWwdvhCA2e_A":{"text":"I could go 3 stars here but there were a couple things that I can't get past. Most of the ","useful":0,"cool":1},"hRDLEHshR_IPCepubXh6mA":{"text":"Delicious and great service. One of the locals recommended this spot and I'm glad we went.","useful":2,"cool":1},"WIcsgFE4dwlbD2zKDnEkIA":{"text":"We are at the creole cookery after listening to a great set of jazz.  Choosing this place ","useful":3,"cool":0},"iwRAsQPxiVXEe-jRuVGTWQ":{"text":"The Happy Hour here deserves a 4.5 stars itself, but giving it 5 stars because I think the","useful":3,"cool":1},"wHkCURwzU_6KUZa433GNpQ":{"text":"Really enjoyed this place twice during our mardi gras weekend. Food and service was excell","useful":0,"cool":0},"xyqVtWZBmYEhi5UZEwsEfA":{"text":"First up, do not get seated at the 2 top by the courtyard fountain or you will get fountai","useful":0,"cool":0},"PmaevR1ag_gC4lnP2A0z2A":{"text":"The food was pretty good, for sure.   However, the service was the worst we've had in a lo","useful":2,"cool":0},"ocUM06dDa26NbVstP7eMKQ":{"text":"This was a solid place for me and the bros to grab a mean to recuperate from the long nigh","useful":0,"cool":1},"SaEvkZPMhFeW2iELFF3g4w":{"text":"Very good restaurant, I had pork on grit cakes and wife had two kinds of crab cakes. Every","useful":0,"cool":0},"X9lCLEc9foZXe5939hKH9w":{"text":"As before, great Bar & Oyster Bar; skip the restaurant part.\n\nA.J. is usually here, say he","useful":1,"cool":1},"V9pBTAFoV_xnl2J0Z6OYPg":{"text":"I wasn't expecting this place to be that good.  The jambalaya was delicious!  Hushpuppies ","useful":0,"cool":0},"m47hstgfiAZcPXH4tjfr1A":{"text":"Tourist trap. Hands down our worst experience both for food and service. The waiter was on","useful":0,"cool":0},"2hC0EdgWNg5B4jhI7KOlcg":{"text":"This place was highly rated so I ventured out to it. The staff was prompt and polite, the ","useful":0,"cool":0},"KdunvPBtY2znEk2akgGFJQ":{"text":"Excellent lunch. Crabcake appetizer and Redfish entree. Worth every penny (for those who c","useful":0,"cool":0},"DmLEh8InCBtkSfa7vNPwNQ":{"text":"Came in for Dinner. Service was good and our waiter (Jeff) was very nice and did his best ","useful":0,"cool":0},"F-wsATwYorT2KRPG35Sq7Q":{"text":"The .50 oysters during happy hour are a great deal.  The half dozen charbroiled oysters af","useful":2,"cool":0},"GRK18ueVdHauC_42ZDoTUQ":{"text":"Everything was delicious. I had the taste of New Orleans. My fave was the shrimp\nCreole","useful":0,"cool":0},"DeEqfNX76PXeqUYLFnNg4Q":{"text":"There are so many places in New Orleans to eat and one of our group had eaten here already","useful":0,"cool":0},"jSPCLLpVYyLK0tDquSwYvA":{"text":"Ordered the red fish blackened and my wife ordered the catfish... umum Good highly recomme","useful":0,"cool":0},"KJcOk7pzQ2OZpe2ahZIq1A":{"text":"Ate here on our short visit to NOLA wanting to try something we never have before. Great p","useful":0,"cool":0},"FGLBRQynB83merFVow6SuQ":{"text":"Try the jambalaya and the shrimp and grits. Barkers out front are hilarious, hostess was r","useful":0,"cool":0},"EQo8-hwWXPlWGs4g724pKA":{"text":"We found this on Yelp while walking around. We wanted authentic Cajun cooking and that is ","useful":0,"cool":0},"_HkjnPikPd7FogasIOIIQw":{"text":"Great food but a bit over priced in my opinion. Waitress was a little weird. Out door seat","useful":0,"cool":0},"tONlpNHTY7CWDgziI2_nFg":{"text":"I took a visit here with my girlfriend while on a trip to New Orleans for the Pelicans gam","useful":0,"cool":0},"53xnDSYDVEIiQLCS8eRdyQ":{"text":"Would give this place 0 stars but I have to give a rating so there's that. The atmosphere ","useful":0,"cool":0},"OfHut5vi5pMZq3PkiymgpA":{"text":"Last minute mother daughter trip during spring break. I didn't even know I wanted to go he","useful":0,"cool":0},"JA2ceRA5mQpNQn8-1voiEQ":{"text":"Great food，chargrilled oyster with category 3 cocktail, send me to a spinning mood, servic","useful":0,"cool":0},"Houmw059pWcgP6uHpZutJQ":{"text":"Service was okay, hurricane category 4 tasted like Hawaiian Punch, the shrimp was over coo","useful":0,"cool":0},"KfEdalBafxRXkcaBL4Jjnw":{"text":"FANTASTIC, Oh what a time we had in the French Quarter.... I can go on and on about the ti","useful":0,"cool":0},"nsJsuCrb4esNo8Jcadi4_A":{"text":"The food wasn't bad, actually the char-grilled oysters were delicious, but the music in th","useful":0,"cool":0},"TshRHQGwQtndxEAsZ0lZhg":{"text":"We got a recommendation from one of our tour guides to stop here to eat while we were in t","useful":0,"cool":0},"PvFgGZAMpjzHV0rLhn2U8w":{"text":"Looking for a place for a quick late night bite, we found our way to Creole Cookery. \n\nThe","useful":0,"cool":0},"0lz1a_kIijOsbeckpk2OHA":{"text":"I came here for the happy hour deals!  I didn't really plan on coming, but walked by and n","useful":18,"cool":14},"vWWVTk1NC-L_d1bABmstxA":{"text":"The food is amazing and servers are great. We sat by the bar and enjoyed a happy hour with","useful":0,"cool":0},"hnSxlnQtL1uF_LKNBJWqBQ":{"text":"Amazing place! Great food, drinks, and the service is some of the best I've ever had in Ne","useful":0,"cool":0},"-XIUEJj20xvAhTdxQ2XCCA":{"text":"Loved this restaurant! Awesome atmosphere, great location, amazingly sweet wait staff. The","useful":1,"cool":0},"OJLxP1WV2WIi02rSS_zYPg":{"text":"This was my 1st time eating gator and I loved it , I also loved the dipping sauce for the ","useful":0,"cool":0},"CCeEl9Z51URqyDTnz650jA":{"text":"Outstanding! Exceptional! I don't even know where to begin!! I dined alone at the bar the ","useful":0,"cool":0},"YgiFAwGtHwyxWAaKb39VtQ":{"text":"We started out with a dozen chargrilled oysters that were fantastic. We then had an order ","useful":0,"cool":0},"6Wgr-chsL04XQO2vGQ4Amg":{"text":"We came here because it was one of the only restaurants in the area serving vegetarian jam","useful":1,"cool":1},"O-FLWCU61zWavikmio0wOw":{"text":"Just happened upon this place and what a jewel!  Just had drinks but we will be back!  Nic","useful":0,"cool":0},"ai9Q_ozowjpVDvqxsMlz2A":{"text":"Food is amazing!  Waiter was super nice and helpful, Chef came out and said hi, made it fe","useful":0,"cool":0},"s4ELQBjG9O7kCZ_crS2ZtQ":{"text":"We used yelp to find this place, and We're SO GLAD we did- the Cajun Bloody Mary is suprem","useful":0,"cool":0},"kE9yYJ1ETC4vysjBuI85-w":{"text":"Great jambalaya! A little disappointed that there was no live jazz music the night we were","useful":0,"cool":0},"z_NLNiwrklQwqTEcb5FNVA":{"text":"I was excited to try this place as the reviews seemed decent but I was quickly disappointe","useful":0,"cool":0},"SSWthsuHbenrKR1gyC7B7Q":{"text":"Food took 45 minutes. All of it was cold. The manager​ sent out another order which took 2","useful":0,"cool":0},"tslt6jadZjmIMT7PpUkaQA":{"text":"We didn't want to wait in line for a long time so we came across this cuisine which was ki","useful":1,"cool":1},"40ppA5VQ8h8RFFziyjOOdg":{"text":"Yummo!! Friendly and prompt service. Food was excellent. Do not leave without trying the C","useful":0,"cool":0},"lw-e9xFLPTWM8hV08f6Zow":{"text":"We came here for lunch right when it opened on a Tuesday afternoon. I had bought a groupon","useful":0,"cool":0},"hXrLknGz2KCwxwLDsYXc8A":{"text":"Best chargrilled oysters in NOLA, near Jackson Square. Eat at the oyster bar, it is totall","useful":1,"cool":1},"tn9D26B-bMXtYQcBg-A6XQ":{"text":"We are so in love with this place. The food is amazing and the servers are so kind. It's a","useful":0,"cool":0},"jKq6bcDHvmTHGXHAzeFUeQ":{"text":"The service and the food was absolutely amazing. The red beans and rice were the best we h","useful":0,"cool":0},"6C21f6G_J5t_m46wag41JQ":{"text":"This restaurant has good vibe. Service is good. The waiter was attentive. Food was good, n","useful":1,"cool":0},"uBcOKC3U4_sNRiFMagCfyg":{"text":"Amazing food & service from the hostess to the waiter and the drink was awesome too!!!!!!","useful":0,"cool":0},"jRmU73oykzxuOrF8qZUzjQ":{"text":"Treated us like we were invisible. Food was brought to the table with no silverware. We ha","useful":1,"cool":1},"5pYjK5Is7nQ96n94FfmMtA":{"text":"Absolutely loved this place! Best jambalaya in the Big Easy and the Bourbon Street Combo i","useful":0,"cool":0},"44ANWbvCaIyws60-DGuutA":{"text":"Cool place with a nice ambiance- warm, historic -feeling, and romantic. Live music the nig","useful":1,"cool":0},"GDttiTm8tzQuveXXNTM6sQ":{"text":"Food good service good not great.  Cesar with oyster good  wife had pasta creole light on ","useful":0,"cool":0},"9yI9-XjCYp5wmo5MISAKNA":{"text":"1 Star is being nice. Only because Solomon and Sue made a great impression!  Duck was over","useful":0,"cool":0},"uxE-UNEmagOaQG4I7s0OBw":{"text":"I'm visiting New Orleans for the first time with my boyfriend. We came across a place call","useful":1,"cool":1},"H1ndLTD50ecyG3-HGAjOZA":{"text":"Had the \"Taste of New Orleans\" dish, sampling many dishes, and ate every bit of it. Servic","useful":0,"cool":0},"HAAS9Zxl3RoSdL2P6Xt-Gw":{"text":"Deeelicious!!  Best crab I've had!  We had a seafood boil, small tip mention how spicy the","useful":0,"cool":0},"j-kr_UyDBYy4coWTAmnODA":{"text":"Went here on recommendation from the bartender over at Jax. Enjoyed my oysters and blacken","useful":1,"cool":0},"XnYD0ye6KOOWiY2TBd4fiA":{"text":"Great food and atmosphere! Entrees we're reasonably priced (start at $20/each). The only d","useful":0,"cool":0},"WFlgkLEPsq0hsZtKi_O8qA":{"text":"We arrived and the hostess seemed disinterested. Informed her we had a reservation booked ","useful":6,"cool":1},"EmisnKmeBS5dmM75ZT4x-w":{"text":"Food was great, very fast service. Makes you just enjoy all of what New Orleans has to off","useful":0,"cool":0},"N0mhynRx5Mff4qBEhCf8eg":{"text":"You'll notice that there is a skeleton in the back patio--which kind of seems out of place","useful":3,"cool":0},"OYNLyLRW0zJjBdgMo_nlOQ":{"text":"We came here for lunch with a Groupon on a weekday. There was no wait - it was still a lit","useful":0,"cool":0},"9hELvpqgLip52LPayBSNKQ":{"text":"Fantastic. We ordered the chargrilled oysters and a bourbon street boil. The boil was a li","useful":1,"cool":0},"LP4_t3IR_l1yH_wfknRAYw":{"text":"The food was wonderful, they even have vegetarian jumbalya. Prices per meal around $20. Se","useful":0,"cool":0},"8cNs1TKwxjX5vXcjTT0tEQ":{"text":"Tasty food! Waiter was a bit slow and brought me the wrong beverage, but the food was good","useful":0,"cool":0},"SrUHWFpeNvflWrx9l9edvQ":{"text":"Terrible service / rude staff.  As soon as I walked in the door - one of the waiters stood","useful":0,"cool":0},"Y5ND-P9erbtOVchkxQ1CiQ":{"text":"We ordered the blackened redfish, veggie jambalaya and the sampler dish: A taste of  New O","useful":0,"cool":0},"Lnwwtr8kn_NhtZvkFEQIFQ":{"text":"Good place!  We had Creole pasta, jambalaya, and shrimp creole. None of us were disappoint","useful":0,"cool":0},"ZcbQhd2-oRaRzwOwlRGfmw":{"text":"Maybe it's the booze talking, but this was the best meal I have ever had! I got the char-g","useful":0,"cool":0},"uK0wOXqI5_ho4nIOt_LlQg":{"text":"This place is awesome. I had the duck breast with raspberry and asparagus. The wife had an","useful":0,"cool":0},"dSW4GMAyP7uEZ9s7Ch_lXQ":{"text":"Wooooooooo Weeeeeee .  They got some good food. Gumbo wasn't great but good. Salad, Stuffe","useful":0,"cool":0},"GAYE0z3SJVfVM5XwbkXuIw":{"text":"Awesome service, fresh hot food, perfectly seasoned. Voodoo shrimp was everything!! Our se","useful":0,"cool":0},"wm2nEL0-6fWgTYZ4kOe9fQ":{"text":"Locals who stumbled upon this spot. Major mistake. Every restaurant in New Orleans has inf","useful":0,"cool":0},"5bUyc2xzylGS3Zma-qD65Q":{"text":"We really enjoyed our meal here. The food was great. Portions were generous. We tried a lo","useful":0,"cool":0},"Wcnr3PE-R23KEd_dICdz4g":{"text":"Got a Groupon. Didn't really make that much of a dent in the bill and the food was average","useful":1,"cool":0},"AYcFblt8CCV5uiOpnouF8Q":{"text":"Stopped in here on our way home from a French Quarter Tour.  Nice and cool, air-conditioni","useful":0,"cool":0},"o5B73NOIGSt9DYXWUlWNVw":{"text":"This was definitely a tourist destination. I visited due to a Groupon given to me by a fri","useful":0,"cool":0},"pLLWRuPPRgTf5Bv5qm4jiQ":{"text":"I am from Los Angeles. I've had seafood from San Pedro. I've had seafood from San Francisc","useful":1,"cool":0},"fcLwZaJjAsls1J2jUgECWw":{"text":"Enjoyed our time here. Fancier feel to restaurant, but people dining were a mix of tshirt/","useful":2,"cool":0},"VZA2_H38HaRJCUTdKPPs7w":{"text":"So New Orleans Creole you will get a somewhat traditional look at Creole here the variety ","useful":0,"cool":0},"wTcJXZrD6NrBU2LY6wd0Tg":{"text":"Have to admit I was skeptical at first with no wait time and few people inside, but both t","useful":0,"cool":0},"uJogHvGHw1jAmJwkDFNgVw":{"text":"We had a seat in the courtyard on a beautiful day for dinner.  Live jazz, good food and co","useful":0,"cool":0},"w1uS3l4Jt-7KHss5YRWvNQ":{"text":"My wife kids and I enjoyed lunch here.  I had the beans and rice with sausage and it was r","useful":0,"cool":0},"W6IJ13p7lmVeqMscNLmJFw":{"text":"Food wasn't bad, took a while to get appetizers for a Monday night in my opinion. Fresh se","useful":1,"cool":0},"U_aXfq5e311nHydi2qJzhA":{"text":"While we had a very kind server, the food and other services were not worth the price. The","useful":0,"cool":0},"-p5cM9aQmy8O6aov-5Of6g":{"text":"First time stopping in was during a walking tour of the French Quarter.  We were have a dr","useful":5,"cool":5},"TMjCD2sjxHBixV5nlUpBPA":{"text":"Coming in as tourists, I figured we'd get some exceptional service. Sadly that wasn't the ","useful":0,"cool":0},"V3JWh_y-x02L1hKA2N4zNA":{"text":"Wow I was expecting greatness from this place after researching and reading reviews. Boy w","useful":0,"cool":0},"ltBspJYBhKN-BoWq6yi7VQ":{"text":"This is a must try while in NOLA! The atmosphere was nice, a little loud, but that's expec","useful":0,"cool":0},"tXstZwtpJIDsTQUdWU_Z9A":{"text":"We went mid-afternoon.  It was empty.  They don't want to have separate checks.  Two coupl","useful":0,"cool":0},"emvTgjPdFHDVHjo-hjtyVw":{"text":"we were just looking for something New Orlean to eat for lunch after the cruise... so we a","useful":0,"cool":0},"mCGEypCLCjTf89Q73GUEDQ":{"text":"The ambiance here is top notch.  It takes you back to another time.  We went on a Thursday","useful":0,"cool":0},"-cdZSiY-irvhFui77r8V-Q":{"text":"Average food.  Service was good, accommodating and friendly but the food for the price in ","useful":0,"cool":0},"KP8xNdADPA9EWFoinC_c8A":{"text":"Dinner last night.  Amazing.  That's all I can say.  Always a sure bet to get the best foo","useful":0,"cool":0},"6Llc0OWYgQwR8V_UB4O5rg":{"text":"Nice atmosphere in the courtyard. Kept looking for the seafood in the gumbo.  Very disappo","useful":0,"cool":0},"KqmDI85L7KWGGVnC6DS0Tg":{"text":"I'm honestly shocked by some of the bad reviews. We got recommendations from some locals w","useful":0,"cool":0},"Kv6cI5l64pOoT6BS3OBdOA":{"text":"Jambalaya was awesome as was the red beans & rice.  First time having shrimp creole so I h","useful":0,"cool":0},"FhlTFXcya7o31G4ZoWnKEQ":{"text":"The food is amazing here. Best we have had. We ordered crab cakes, jambalaya, & red beans ","useful":0,"cool":0},"ZeCxAp9RHMRdpWINeFVQPg":{"text":"This is a bit touristy....but not TOO touristy. The food is OK, not great.  But the drinks","useful":1,"cool":0},"B2-mQA5bwD1oGa-5xU0qhA":{"text":"Thank you Nathan T!!!!!!!!  What started out as a rocky experience due to my inability to ","useful":0,"cool":0},"mVQrbwQdH-JX0MmWqyIX4Q":{"text":"This place was horrible..food was delivered so fast that I feel like it had been sitting a","useful":0,"cool":0},"F9a25e7GQpQlFfS2qNz6sg":{"text":"There is no shortage of great food in New Orleans, but this place is in a league if it's o","useful":1,"cool":0},"RREBkX_oS2mrRDxfZrRW0g":{"text":"Fantastic experience and great food.  Family wanted to sample several New Orleans classics","useful":0,"cool":0},"0poGXWP_Sg0KbPbs2s20_Q":{"text":"As a vegetarian it is a little challenging finding a place that accommodates that less tha","useful":0,"cool":2},"JObrAo53Aa1vxlZhM_V2sg":{"text":"One of my favorite places to eat in NOLA. Great food, fabulous Bloody Mary's and beautiful","useful":0,"cool":0},"1Ned8OLOR0EBG5R5XtIg_Q":{"text":"Had a great time here, a wonderful atmosphere and down home charm. You're greated at the d","useful":1,"cool":0},"V1dvagdfNP21T66WKVwkZg":{"text":"Loved this place. Great shrimp & grits, burger, turkey sandwich... We hardly ever go back ","useful":0,"cool":0},"kS1RATSrOQP-SqIseNZWwg":{"text":"Came here with my boyfriend on Valentine's day and had a terrible experience. We sat for a","useful":0,"cool":0},"pI8oI7yQzLA6QZhxpN2H4g":{"text":"We ordered Cajun calamari, hushpuppies, crab cakes napoleon, jambalaya, and gumbo. The Caj","useful":0,"cool":0},"-55I_FfrmdKYn5sL03RU6Q":{"text":"I'm 50/50 on the Creole Cookery. First the good. Go during happy hour 3-6 weekdays and sit","useful":0,"cool":0},"FbftNlJ68Mtz2Xsl-VJ9jA":{"text":"We were here for bachelorette party. Server were very nice and excited about the same. He ","useful":0,"cool":0},"_k7_huTu1KmvTOT2KcskVA":{"text":"Had the best dinner sitting at the bar.  All the oysters are shucked and cooked there so t","useful":1,"cool":0},"UEfMOAEz6_zN1d1MRTD-tQ":{"text":"Food was ok but the service not so much. We unfortunately had the displeasure of being ser","useful":0,"cool":0},"u84BZXzm5zFLwHVkJ6ocHQ":{"text":"We came to this restaurant based on the good reviews, but left slightly disappointed. Alth","useful":0,"cool":0},"5cztHMiVbAvhb2FpYN8cng":{"text":"I was recommended to go here and was not impressed. This is definitely a place where you w","useful":1,"cool":0},"Z-1ObsuLKaxqY9L5O3-n_Q":{"text":"Their redfish is really good.  \nTheir oyster Rockefeller was very dry, nice spice also not","useful":0,"cool":0},"EwlEV5EEmpk0f9_iLp1gsw":{"text":"We cannot rate this high enough. The Cajun shrimp etouffee was amazing and outstanding - o","useful":0,"cool":0},"uX-SfoNRz1kzjBzNI8Jmyg":{"text":"The dinner started off decent with the char grilled oysters but we had to remind the waite","useful":0,"cool":0},"8F3reSDWqF6C8hTs7JnVsw":{"text":"We had a chance to try New Orleans Creole Cookery for a late lunch and were very happy wit","useful":2,"cool":1},"rOkeZMLcKCKAiCgrK-TV7A":{"text":"While walking around looking for a place to eat, we decided to stop in for diner. We sat f","useful":1,"cool":0},"G0sAHAoji9F8hguC0Wf5lA":{"text":"Food was just ok...ordered a sampler platter to get the full New Orleans experience. Jamba","useful":0,"cool":0},"M1PXmBpftfW_5r16AV3zKQ":{"text":"Forget Acme and Felix!! These guys have THE best char grilled oysters in the quarter. Thos","useful":0,"cool":0},"dfy1lWellxIHkVOlii2FcQ":{"text":"Nice season and excellent services. Be aware there is 20% service charge for a party 5 and","useful":0,"cool":0},"jJxeMi96otYkQ5YdImnmYQ":{"text":"Horrible service and unfair fees made us leave.\n\nI love New Orleans. I love the city, the ","useful":3,"cool":0},"ycRab-Puiy2uEOs0beKSnw":{"text":"Found a Groupon and wanted to check it out. You must have the Char Oysters and blackened r","useful":0,"cool":1},"XO8-UbA3sH0EwE2ycJdDlw":{"text":"Some of the best charbroiled oysters in the city. I had some good ones but this place outs","useful":1,"cool":0},"xsrfKgTOzxOw2TdAhJvpqg":{"text":"Worst service, waiter had an attitude from the get go as if he was doing us a favor taking","useful":0,"cool":0},"TK08n-3MCve8g54r9ROSXg":{"text":"Great New Orleans Flavors. I enjoyed the atmosphere and cuisine  as I ate the lobster fixe","useful":0,"cool":0},"yEuEVlh9UiZAo-ahzrTpIQ":{"text":"My best friend and I had been in New Orleans in June 2015 and stopped to eat and have a dr","useful":1,"cool":0},"hySP2xKtkRfdHnWn1i0oWw":{"text":"This food was amazing!!! I had a wonderful pasta, and wish I could have fit more in my sto","useful":0,"cool":0},"i837d6wuDad-bNgq9MtUYg":{"text":"Great food! Great atmosphere! First impression is being greeted by Sol, the best maitre de","useful":0,"cool":0},"kwUakHwEALH6FWEUcWWXYA":{"text":"This place is great, crab legs are to die for, had to come back 2 days in a row. Look for ","useful":0,"cool":0},"n0wGFzeERf_uwfLmZNwTbw":{"text":"My boyfriend and I came here on a food tour and I have to say, it was pretty underwhelming","useful":0,"cool":0},"vfbVjPKWauCVrRAAsTFHwQ":{"text":"Trust me, you do not want to miss out on this place!\n\nWe came here as the last stop on a f","useful":0,"cool":0},"RBVSTeJyz0i8XeqbimqPUQ":{"text":"Disappointed to learn Chef Alex Patout, one of the greats, has recently left the restauran","useful":0,"cool":0},"2BHc1_OJyj6A2MMnH5MiLg":{"text":"The New Orleans Creole Cookery was my first experience in the city. I arrived after a coup","useful":0,"cool":0},"YXy5HBUhwDqcZz1ajipUhQ":{"text":"Had dinner. Started with local gulf oysters. Outstanding. Best ever. Large, meaty and reas","useful":0,"cool":0},"7CFFuYpiZnxJGCXCWhUX2A":{"text":"Great atmosphere for large groups with lots of options and they take reservations! I had t","useful":0,"cool":0},"AbM8eNMA4ah_ej3TM3w8WA":{"text":"This place was terrible. No one in our party enjoyed their food. The food is too expensive","useful":0,"cool":0},"8fxqf-VTvr7KLyzIp-0J8Q":{"text":"I like the atmosphere but the food is okay. Don't recommend the seafood tower but you shou","useful":0,"cool":0},"2cVYp6N2zoaP0Th0k8Yf0A":{"text":"Just awesome!   My husband and I had their steaks with the side dish of seafood and the st","useful":1,"cool":0},"pwFllMShURKrgRXSFJ1EKQ":{"text":"Outstanding service. Food out of this world. Grilled oyster gumbo Redfish finish off with ","useful":0,"cool":0},"JJB0xyWj3earOyx_VtKv3w":{"text":"Once we seated, no one ever came back. When she did, she claimed no one told her we were t","useful":1,"cool":0},"lvHfe3B4U2IzumQgOqCO0A":{"text":"I can keep this brief:  on my recent and first trip to New Orleans we stumbled on this pla","useful":0,"cool":0},"bEFuBz_l280GE6Rly4t7Og":{"text":"We went during the 3-7 pm happy hour, the oysters were 50 cents each, the four of us order","useful":0,"cool":0},"8bOdMTWN8WGCRgmDqscxtA":{"text":"Went here to try the jambalaya. The service was ok. The food was alright. Not sure what th","useful":0,"cool":0},"chdEcUmzBlVPRP_EP3pOKg":{"text":"A stop on a food tour. They served us a dark gumbo that I found very watery but my friend ","useful":0,"cool":0},"1PTXYkjTCRiWOcGPKlfnrg":{"text":"The food was mediocre at best. The Shrimp Creole was overcome with tomato sauce and lacked","useful":0,"cool":0},"2yCzXC5s72AAbFfrSYMvRw":{"text":"I had some amazing shrimp creole here! Yummy! The atmosphere was nice, too, plus jazz musi","useful":0,"cool":0},"Y03xNKPCszP354eoZmNfTw":{"text":"Went there yesterday to celebrate our first wedding anniversary. No server came to our tab","useful":0,"cool":0},"L79N1G99Z73KzLCh89TQOQ":{"text":"Beat crab cakes in the world...Chargrilled oysters and voodoo shrimp also killer menu item","useful":0,"cool":0},"k64EDyp-bqStzOnM7MUHlw":{"text":"Our waiter, James, was able to steer us each to amazing meals. He asked us a couple questi","useful":0,"cool":0},"BcNfOPWYkmwacbVtiYVf9A":{"text":"The food was good. Pricey, but good. The service was decent. It's difficult to get used to","useful":0,"cool":0},"ohPb_ZgleDr_cpllP9Pbiw":{"text":"Had the duck....very bad smell and taste.  I can't believe they let it leave the kitchen a","useful":3,"cool":0},"dreRLIpzP7vMbkmLl-OHHA":{"text":"First time in New Orleans and we wanted to try some true New Orleans food.  The rice and b","useful":0,"cool":0},"yS_Zulk2aWsuXQS6NcMJKg":{"text":"Great atmosphere and phenomenal food! Great prices for being right in the center of it all","useful":0,"cool":0},"spzr6pgsimEXyLEcBoay4w":{"text":"I got the taste of New Orleans and it was great, the jambalaya was like warm. Jambalaya ta","useful":0,"cool":0},"J-N0T4FnFLnwx73yyL6PaA":{"text":"Based on our groups experience I can't recommend this establishment. Great appearance, war","useful":0,"cool":0},"FHSOvoLnwuFmo05MExr89Q":{"text":"This place is a rip off! The service was not great either. \n\nWe ordered the vegetarian jam","useful":2,"cool":0},"X_-bFpLzPFNGlQpXTLE9mw":{"text":"Food was mediocre. Service was subpar. The waiter we had I could tell had wonderful potent","useful":0,"cool":0},"c4a8uo1yLUFvuLC8EOrP1w":{"text":"The service is terrible. They served us warm beer in warm cups. Additionally, we were serv","useful":0,"cool":0},"iVlvZewDVzdkHBEgqFyDow":{"text":"Ok...on my very first trip to NOLA...this was the spot where I was introduced to \"Love in ","useful":1,"cool":1},"UxUGG0gCagZwpbHMWJCMcQ":{"text":"The ambiance is incredible. The drinks are good, but be prepared for a kick! The menu has ","useful":0,"cool":0},"7Rp-qIKnVw9ROor2YgElVg":{"text":"Are you interested in the worst ever service in New Orleans. Come here to get loaded up on","useful":6,"cool":1},"hhvWXz7e5Kwo0dFf-LseVQ":{"text":"This place is great! I had oysters for the first time and they were char grilled, I couldn","useful":0,"cool":0},"G2GDqRcx_YpfFHfDN01gIg":{"text":"The bus staff was very efficient and attentive. The server was MIA for most of the meal. M","useful":0,"cool":0},"FOX6xTyD0c76n-3rPa_QDQ":{"text":"The food was ok, I don't really recommend this place for tourists, since the food was not ","useful":0,"cool":0},"2xaNvSKvHSa_dkx9tYkPPg":{"text":"MMMMmmmmmm found this place in the middle of the night while trying to look for the soccer","useful":1,"cool":0},"eX4YgIl2Ef1L5iL0fYMpsw":{"text":"Loved the shrimp creole! Our table also had the creole pasta and jambalaya which were all ","useful":0,"cool":0},"Ttuuzy4QPZYzldOIkjOADg":{"text":"One of the best restaurants I've ever gone to. The food was delicious, wait time was surpr","useful":0,"cool":0},"v_cxpZMN2XbbPGLSi0ORPg":{"text":"This is the best meal we had in New Orleans (and we went to some amazing spots!) \n\nThe gri","useful":0,"cool":0},"CydHK2EhowB1PoR9LKGNpg":{"text":"POOR SERVICE & ATMOSPHERE (COPS TV Show)\n\n*No service for 10 mins after being seated (we l","useful":2,"cool":0},"HgTgxWKqTOZOx5dzFpIG1g":{"text":"My wife and I went with a large group. We all ordered from the menu.  The service was not ","useful":0,"cool":0},"nrpjUl-cqv3w8owCQZfQ9A":{"text":"This place was OK. It's a little dark inside. The steak was great and the oysters were goo","useful":0,"cool":0},"89DRty20ZBkGzm26nWgQCA":{"text":"Had the chargrilled oysters, so good!  Lots of butter, garlic, and Parmesan cheese, Yum!  ","useful":0,"cool":0},"ybQK63uidzoG0qv2KV1aOg":{"text":"Finding a dinner reservation for 9 people in New Orleans is hard. We used Open Table to fi","useful":0,"cool":0},"5YPM_rvLSpFjlFmDe_xqTg":{"text":"All entrees were cold. Wanted to have them heated up but waiter didn't come back to check ","useful":1,"cool":0},"vka98HChw9ROjdXwiXfCnw":{"text":"Happened upon this restaurant because my husband was craving grilled oysters. The building","useful":0,"cool":0},"yiyLztDsmKeIjG_A1Zya0Q":{"text":"Had an extremely unfortunate experience here. Visiting from out of town, my group decided ","useful":0,"cool":0},"CMbkFfYr-Afe8YKQ_mrstA":{"text":"Meh...  gumbo was ok I ordered 12 grilled oysters they only had six.  I asked for 6 raw an","useful":0,"cool":0},"5et0t2_Pf9LSf7V4ytsDxA":{"text":"No reservations, had food at the bar. Service was quick and friendly.\nHonestly a bit price","useful":0,"cool":0},"58rlAYgYDYwOB4eyYyE6hg":{"text":"Great food, friendly staff, lovely atmosphere. Can't ask for more than that!","useful":0,"cool":0},"XPb2cjJjOqeLIXQTMI946w":{"text":"Staff is friendly and the food is delicious. I ordered the NY strip and house salad with c","useful":1,"cool":0},"DO2GDbS_9gHwZMPTTqI-hA":{"text":"Went here for Christmas Eve dinner.  I had eaten here a year and a half ago and it was ama","useful":0,"cool":0},"xrN40K-gm8G5Z4dvZz2K1g":{"text":"My fiancé and I came here for a nice dinner last Friday. Our experience was rather poor fr","useful":0,"cool":0},"CHt1LP7n1IpycDRKCyJZKA":{"text":"I had a wonderful experience here 3 years ago, the atmosphere was lovely, Jazz playing out","useful":0,"cool":0},"peKhZiQ2VkoY6fcbl-4g0Q":{"text":"I feel like the first thing I need to say is Crab Cake. It was the BEST crab cake I've eve","useful":0,"cool":0},"xPJWWllCkoTxQ2r04s6XAw":{"text":"Came in for a quick happy hour (3-6) before our flight. We had the raw, chargrilled oyster","useful":1,"cool":0},"Lk-XTO1yVL6_9ak5mQ78ug":{"text":"This place was okay. Our waitress wasn't great. She was very nice & friendly, just not a g","useful":0,"cool":0},"xsmh-iAVsCEyJiPJ_CwOHA":{"text":"Food was great but everything else was terrible. Our waiter took 30 minutes to bring out a","useful":0,"cool":0},"3qcNllHV5Q10OjQNJArtpQ":{"text":"AVOID AVOID AVOID!!! While our server Benjamin was great, our food quality was terrible. O","useful":0,"cool":0},"pTcOD9yVmZUxMlzZ691Zig":{"text":"My husband and my daughter and I took this cooking class. It was a cooking class for the g","useful":1,"cool":0},"PXRfCZMVx0EZCY5a8uszJQ":{"text":"Great ambience, food, and service. The raw oysters were huge. Crawfish etouffee was very g","useful":0,"cool":0},"1yxEMPSwNGy0jjzTIP2tIg":{"text":"Yesterday I went here for lunch while on a food tour. So I cannot talk about the service. ","useful":0,"cool":0},"hC59P7xM_E8BNJJwR4xbfQ":{"text":"Nice atmosphere.   Ordered the redfish pontchartrain which came with baby potatoes and fre","useful":0,"cool":0},"bxjy-NKuSTnwLU8VmmcmoA":{"text":"Grilled oysters were amazing. \n\nOrdered crab cakes and a side of asparagus. The restaurant","useful":0,"cool":0},"-cyf2Ov-upv7omh8jxLrWw":{"text":"Bought the Groupon for this place and definitely regret it. Service was extremely slow to ","useful":2,"cool":0},"kP6-0wXCN1JTURWofT64qQ":{"text":"Went for an early dinner before a tour last night. They only have bottled water available,","useful":1,"cool":1},"4B38KWjkRZDbZ59u4F4aAQ":{"text":"Food was OKAY but the service was just awful. The only reason it's not one star is because","useful":0,"cool":0},"npkjzPYr49H3_VtFKXjIWw":{"text":"Food was okay and cocktails were just okay as well. I only had appetizers, so it's a bit h","useful":0,"cool":0},"U6CoWfL-lfGtRl4Mfdma5Q":{"text":"Stopped by based on the Yelp reviews.  Wow, what a stop!  The whole family enjoyed the lun","useful":2,"cool":0},"FCAkNGPXWnQc4DwvWmgO7g":{"text":"This is a great place to grab a drink and rest your feet after walking around town. My lad","useful":0,"cool":0},"OltY8T7kLdrFhhBhsmBkIw":{"text":"We stopped in for \"happy hour\" -- no discount on drinks, but discounted oysters.  \"Chargri","useful":0,"cool":0},"4lvvLa8W40o5Rdqn2VtLxw":{"text":"The ONLY reason I'm giving this establishment one star is our waitress Emily whom was so s","useful":0,"cool":0},"hquqlVCCIyAQXg6Bi226AQ":{"text":"It bad food. Makes New Orleans good look bad .","useful":0,"cool":0},"Lbyjhjuh3hjQQ1zWX-4zgg":{"text":"I'm giving the Creole Cookery 5 stars based off of MY experience. Although it took a while","useful":0,"cool":0},"0sPLJ0myeGAz1CeAScYCnA":{"text":"Stopped by here by coincidence, it is definitely something I look forward to when I come b","useful":0,"cool":0},"4vGWPKapRZPhYW8CXfYTig":{"text":"This place is one of my friends favorites.  She has made friends with some of the staff, a","useful":0,"cool":0},"RO0JcNQmMJ3KoK3E43qhqQ":{"text":"Great service, great food. Expensive but worth it. Seating is gorgeous and food comes out ","useful":0,"cool":0},"TqPx2kqjfholOWJy4OBkWw":{"text":"So so yummy! Great service and even better food! Make sure to check out Groupon for good d","useful":0,"cool":0},"dXBspNtQ7vzEMJMQBf8Iqg":{"text":"Best Bacon Bloody Mary I had in NOLA!  Greeter at the door was amazing and food was top no","useful":0,"cool":1},"lp7rorZgg37EB7pxLPcjWQ":{"text":"The best thing about this place is the Oyster Happy Hour, $.75 each for fresh and $1.25 fo","useful":1,"cool":0},"kV4qc030EsU92Xss2MAsyg":{"text":"One of the few places in New Orleans that had a gluten free menu, even though it was an ol","useful":3,"cool":0},"Tp_tdxcG2DMlmy9_LWpafg":{"text":"What is wrong with this place\nFrozen everything\nHigh turn over employees\nFood is trash and","useful":0,"cool":0},"G2A52D3YoUQD6F-7HR0slQ":{"text":"We went there Sunday night. We waited 15-20 min. and no one had come by. I had to ask twic","useful":0,"cool":0},"b_c7oQWyXXY9VN1D39r5-g":{"text":"I love coming down to NOLA every year and wanted to try some places I hadn't been before. ","useful":0,"cool":0},"Gm_HurvvwGejIVonY6RzYA":{"text":"Good service, the waiter never left our glasses empty and was kind. The food was trash. Pa","useful":0,"cool":0},"rFLWgzXfCKKeEg6L4idedg":{"text":"Meh at best. Outside courtyard needs a paint job. It is nice to sit outside though. \nFood:","useful":0,"cool":0},"_r4mdgaoBJB2XvedAnewhw":{"text":"We visited this place as a group of 3. One out of them likes spicy food. The other two we ","useful":0,"cool":0},"HL01OsPDdpCNKs3m4IlmOw":{"text":"This review is just from the happy hour menu. Their charbroiled oysters are the best I've ","useful":2,"cool":3},"G8Sgr5aeKSZoOlX-l0uL0Q":{"text":"People, be ware of when you dine at this restaurant. YOUR STUFF CAN BE STOLEN RIGHT IN FRO","useful":2,"cool":0},"8qPLNYGB870pm1qLlxbPJw":{"text":"We came on Tuesday at about 2-3ish. We used our groupon. Place is nice. Waitress was very ","useful":0,"cool":0},"JH4jIhFPQVkNhd--HTY6gQ":{"text":"Stopped here for dinner during Mardi gras. We had drinks, apps, and dinner. All were delic","useful":0,"cool":0},"ckwV4bD43CfxbRQ5BI6sYQ":{"text":"We had a reservation for 8:30. Showed up on time & was seated. There was a bit of confusio","useful":1,"cool":0},"WCwtSL8zMoPVv4Vi4QQyMw":{"text":"The Creole Cookery was awesome! We were able to sit outside in the courtyard. There is a n","useful":0,"cool":0},"UMB1z0eAlo7FPcGfQzuu0A":{"text":"Came here for dinner (Sat evening) today to celebrate my wedding anniversary with my husba","useful":0,"cool":0},"VzBhT0F3rCKdqI5TShC-sA":{"text":"This was the best meal I had during my trip to New Orleans! My husband and I started off w","useful":0,"cool":0},"LLMM5aHYJiRedkjDK_cNyA":{"text":"The shrimp Creole was made perfectly, so since Creole is alot about the base sauce, I'm su","useful":0,"cool":0},"nj35EAfWYUsIU5Jfm8re-w":{"text":"Ordered the Taste of New Orleans perfect but being your appetite. Also had an order of the","useful":0,"cool":0},"kTjRaDIvfwxqEVeTBegNsg":{"text":"Horrible service!!! Good food, jambalaya and craole was good but way overpriced! We never ","useful":0,"cool":0},"RdgJc4dDO6AptZspdyqNZg":{"text":"Terrible service, mediocre food. Bartender wasn't interested in serving with a pleasant at","useful":0,"cool":0},"LaBoUYJIuMPGhYBBqMDl8Q":{"text":"This is by far one of my favorite spots in the quarter. They have amazing food. The crab s","useful":1,"cool":1},"hAu0o1XQuLQAuvFPu-ujNw":{"text":"I cannot say enough good things about our experience here last night. We decided to come i","useful":0,"cool":0},"hvSTnHcJXKVOMcdxNMAkTw":{"text":"We came to this restaurant for their happy hour. It was a Wednesday and they had half-pric","useful":0,"cool":0},"meIcIX3a5x0L5gKL4kR1gw":{"text":"As we walked by we were looking for place to get out of the rain.  We stopped into this pl","useful":0,"cool":0},"ELm7gwOcV8mgyZkXO-we4g":{"text":"After looking at various restaurants near the French Quarter we found his place. We had th","useful":1,"cool":0},"hGfGayCxqxwqblL9s6NdJw":{"text":"This place has enormous variety of food: shrimp, crabs, lobster, oysters and so on, but th","useful":2,"cool":0},"CH-UvSSzoq8e6GcycbF-oA":{"text":"Would not go back. Bad service and somehow worse food. Both vegetarian meals were inedible","useful":1,"cool":0},"H-6objpLWJ8dT5KL-ura8Q":{"text":"We were in New Orleans for a couple of days as a short getaway. A bartender recommends thi","useful":0,"cool":0},"VRl8SeQMljSIfvIV3uHyNg":{"text":"We loved our appetizers! I got the fried pickles and my friends got the char grilled oyste","useful":0,"cool":0},"Q_RP17vY4GHn8--1bzUlqw":{"text":"Less than impressed. Got blackened redfish. Flavor was okay, texture was spot on, but I wo","useful":1,"cool":1},"AIxDOOWyLNlMblsuLoHQtQ":{"text":"Awesome food and friendly atmosphere. Have been twice now and have dined in courtyard and ","useful":0,"cool":0},"0LjpAKb_kLgiQcrhpDbT_w":{"text":"Happened to walk by and liked the looks of the variety of authentic New Orleanian food. Wo","useful":0,"cool":0},"lXrKRJLZlDrudrtoGk9rDQ":{"text":"Came in here tonight to try some of Nawlin's infamous Jambalaya & Gumbo. The Jambalaya is ","useful":3,"cool":0},"8WEob9Apk-wNsGiZTC3Klg":{"text":"Surly staff, average food and got our order wrong. Worst dining experience we had during o","useful":0,"cool":0},"gKHvCYBeMhwUK1bT2NA3lA":{"text":"So we went for happy hour oysters for one of us, veggie jambalaya and chicken plate. Serve","useful":0,"cool":0},"dxMbN3o9K9cmPR7AKXQN5w":{"text":"We were traveling through NO and stayed at a local RV park. Asked the Uber driver to take ","useful":0,"cool":0},"_lGfwoxkkttRz7JGqhqnvg":{"text":"Very delicious traditional New Orleans dishes, excellent customer service and pleasant env","useful":0,"cool":0},"bpBbVnA99Ylq1vlUfZaetg":{"text":"Chargrilled oysters for the win. Also, I hear the redfish was delicious. Manny is the best","useful":0,"cool":0},"Ot4BICScteZU8_jG9-FBJQ":{"text":"I really enjoyed this restaurant. This is where I first tried authentic NOLA Gumbo ya-ya a","useful":0,"cool":1},"sFpYd_EOtEJEFu_ORZlNRQ":{"text":"We stopped in for a late lunch today after an early hotel checkin. I could not decide betw","useful":0,"cool":0},"usHkBiY4kNc2gsCoIN2qlA":{"text":"Meh is right. I've experienced better. It wasn't a compelling experience. It wasn't the wa","useful":0,"cool":0},"FRTQ5FUOAydJa6WJJf_zgQ":{"text":"Very friendly service, attentive, with good fresh food.  There is only one vegetarian item","useful":1,"cool":0},"6IMVq23bW0x8LdP18AV5JQ":{"text":"The sign beckons - it says \"Creole\" right there. It promises rich flavors passed down thro","useful":1,"cool":0},"3DxQ3XpNrH3DURcSnt3f4g":{"text":"Maybe it's due to the covid-19 crisis but our experience was horrible. There were only a f","useful":0,"cool":0},"UhjScV0iLHymBNmoVwEmWg":{"text":"After a tour we were hungry. We wanted authentic new Orleans food. We stumbled into the ne","useful":0,"cool":0},"JK9RHalP06gmx6H_BQPBKg":{"text":"Stopped in here for a quick snack. Had the Char Grilled Oyster as you would have guessed f","useful":1,"cool":1},"N6EdUrxnMnphHus7DcGQXg":{"text":"This place is truly a hidden Gem! Delicious Decadent and the oysters absolutely an amazing","useful":0,"cool":0},"u3MtN7Aa6SznUuw1H7Q6pg":{"text":"This restaurant was my first actual restaurant to stop by and try authentic New Orleans cu","useful":0,"cool":0},"HPh-ImiUimegUM4_fY4sQw":{"text":"Maybe it's the booze talking, but this is the top best meals I have ever had in my life. I","useful":0,"cool":0},"kHdykkAw8Ox9cDnpaeF1SQ":{"text":"This spot is easy to find and enjoy some good food options to start off a night. Came here","useful":0,"cool":0},"WKjYoMcSg04-1fXalMsoxA":{"text":"Loved the service I sat at the bar the bartender was very nice and good for a quick convo.","useful":0,"cool":0},"2Cd-YNpVWINCZ8RdRpPiiA":{"text":"Just order a dozen char grilled oysters per  person.  Anything less is uncivilized.  Also ","useful":0,"cool":0},"bXG-6BnQZA_LPCy3GAtcCQ":{"text":"TLDR: okay food, HORRIBLE customer service, especially for a restaurant with a mandatory 2","useful":0,"cool":0},"X0l5_DyBWKvhMQJzJz3Eag":{"text":"Excellent service and food at a time when we could all use superior service! Highly recomm","useful":0,"cool":0},"HG7Ke1PwCC4WqMfQq624_w":{"text":"It was amazing! The Hush puppies are to die for and the jambalaya is so good! It is a litt","useful":0,"cool":0},"7MNjq8ISgsnHatWNTqBaGw":{"text":"Didnt eat much her but the dollar daiquiris were small but packed a punch. The spinach art","useful":1,"cool":0},"mIFMNFBQhKDOWvkyaacNUg":{"text":"Tour guide recommended this place. Very warm welcome by Timmy.  Love the southern hospital","useful":1,"cool":0},"_-Sa7XQ8NqhBa0i1O5jwIg":{"text":"Party of four...2 adults & two teens about 7:45pm. The menu looked absolutely amazing! We ","useful":0,"cool":0},"StX_RH_YS7y5IiIkW3Wg9w":{"text":"We waited 25 minutes after seated with no fewer than 5 waitstaff passing by without making","useful":0,"cool":0},"KTU2oCXrDes0TIwBEf25tg":{"text":"So I went here while on a family trip to New Orleans. First off service was great! The dow","useful":2,"cool":0},"p4RpN89XeBZYsIkuWuaHHg":{"text":"First-class service, delicious food, and the atmosphere captured the romance of New Orlean","useful":0,"cool":0},"9TirO7cWSal8LzAG0i72kQ":{"text":"Horrible experience.  20+ minutes just to get water.  90 mins for food, which included raw","useful":0,"cool":0},"ADeQ-A46VPJ3wANNg43FHw":{"text":"We ordered Taste of New Orleans and man was everything great! Perfect location, inside was","useful":0,"cool":0},"2QKedK8rCjZ5nYUTQr26Ww":{"text":"Didn't really think anything about the meal was that good.  Got the shrimp fra diavolo... ","useful":2,"cool":0},"PH9sUdWWGPi4N-yEM34xMw":{"text":"Great food. Loved everything we ordered. Red beans and rice was amazing. Would go there ag","useful":0,"cool":0},"mfCM7-GnM5oTTBcQ9--QCg":{"text":"The chargrilled oysters were amazing and that's the only reason I'm giving this place a de","useful":0,"cool":0},"e7zNMOKJoBvYdeSoggKO6w":{"text":"My wife and I returned to NOLA in March 2019 and ate in the dining area. The food was amaz","useful":0,"cool":0},"zRRGuFL1aaBqEugjWy1RDg":{"text":"Forget Acme and Felix!! These guys have THE best char grilled oysters in the quarter. Thos","useful":0,"cool":0},"vktEJsXfZwkNE6BExuqnEg":{"text":"Honestly terrible food. I got the shrimp and grits the gravy tasted like straight up barbe","useful":0,"cool":0},"13w4RD3OA1NVkpS-B8bn_w":{"text":"If you want authentic New Orleans, this is the place. We had raw oysters, crab cakes, and ","useful":0,"cool":0},"fHUl2br55GEtXg5hp9DGWQ":{"text":"THIS PLACE IS RACIST. My friends and I came here for a late lunch today and waited in line","useful":1,"cool":0},"KkcNBI4uKQDKqEYU7X6WNg":{"text":"Happy hour is the bomb. 75 cent raw oysters. Chargrilled oysters were a little more and ga","useful":0,"cool":0},"vc7KAIH9p5bcMHk8Ek5WiQ":{"text":"Visiting from California and decided to give this new place a try tonight based on 11 grea","useful":0,"cool":0},"40PSD46VU5b4CENCfBnhYA":{"text":"The food and service at this place is spectacular! It was 12 people in my group for a birt","useful":0,"cool":0},"bGnsCQjPlTsTSyIuWun4jA":{"text":"Amazing red fish dinner! My husband and I both throughly enjoyed every bite! Service was v","useful":0,"cool":0},"OYGXbdpO-UrttF4l-aIotA":{"text":"Nothing to rave about except the decor Is a little relaxing at night, too bad the service ","useful":2,"cool":0},"sBEkXkywinqqrrl8qKV7lQ":{"text":"Terrible Service, very mediocre food.   Go eat somewhere else if you're looking for a good","useful":0,"cool":0},"KmR6x_MDfk-PMohG8UbQsA":{"text":"A group of us recently returned from a birthday party trip to New Orleans.\n\nWe wanted trad","useful":2,"cool":1},"w73YlDzpWsiQahNsJL9otg":{"text":"This is very decent place, a little bit expensive, two people would end up paying $65-70 f","useful":2,"cool":2},"_2lw7pqijt1UNYTlNQL23A":{"text":"This was a really great experience. The fact that they had a very lovely outdoor dining ex","useful":0,"cool":0},"NE9YLVBrxwniJS6BglPyJg":{"text":"My review may be a bit biased but me and my family were really looking forward to eating g","useful":0,"cool":0},"WCzrvC0p3pIgAW_o4xjhCg":{"text":"My wife and I visited Nee Orleans for the weekend to celebrate 20 years. We planned ahead ","useful":0,"cool":0},"bP72nowgpaiWGfNZ1Ay2LQ":{"text":"We really wanted to love this place, but we just didn't. The courtyard area was nice, but ","useful":0,"cool":0},"NR3tbFYXDr6qo33lGb0vBg":{"text":"Walked in here on a whim after exploring the French Quarter on foot as a super noob touris","useful":0,"cool":0},"jPuU-QrEDtlCiHcqF2GOYg":{"text":"Love this place!\nStaff is amazing!\nHighly recommend going during their HappyHour\nHalf pric","useful":0,"cool":0},"3QLB-QTadxWzVi1iII3IZQ":{"text":"Omg the alligator bites are amazing and the charbroiled oysters are to die for definitely ","useful":0,"cool":0},"Bg6aEBrgblVFT_PuUDd8NQ":{"text":"So we went here on a groupon hoping to find a new place to eat! But unfortunately I don't ","useful":0,"cool":0},"Vu_FiURZ9q86fS-hqvejVw":{"text":"D E L I C I O U S!!!!!!\n\nAtmosphere: welcoming, beautiful, and romantic. Candles lit on wa","useful":1,"cool":0},"bt1EVD2k2xNDOwaSshT2_Q":{"text":"The food was decent but the waitress my boyfriend and I had was absent-minded. We ended up","useful":0,"cool":0},"pfMspzCKxRqd1Evlvm-Icg":{"text":"We found this spot upon searching for coupons on Groupon and saw a $20 for $40 lunch speci","useful":2,"cool":1},"PZL9BMXVBoE-AkxggaWgOQ":{"text":"Every dish here is amazing. The restaurant is classy and has a beautiful courtyard. Try th","useful":0,"cool":0},"WQPrx26JszSTiD6ch2zJpQ":{"text":"I bought the groupon when I realized we would be visiting NOLA but did so with apprehensio","useful":1,"cool":0},"okjq4K_tu3-LaeW38Wn2qA":{"text":"First stop in New Orleans and mediocre food at best. Everything was cold, and expensive. W","useful":0,"cool":0},"hYqSyX-gPPtJ6VyRsDh8kA":{"text":"We dropped in for dinner and we were seated in the courtyard. It was a little cold outside","useful":0,"cool":0},"MTsP7Tab1V86fGisvt5xpw":{"text":"Two words...Happy Hour. Oysters are sold for $1.00 a piece when you buy a drink ($1.00 off","useful":0,"cool":0},"IPBSAg4y9rcpJH_tevGNdg":{"text":"Had a great meal here-tip: they often have groupon deals running for here so check before ","useful":0,"cool":0},"Q6fLAkemsFQpsbihPEHw_w":{"text":"Our visit got off to a rocky start with being slow to be served. However, after that, we w","useful":0,"cool":0},"csI90SXjJEmILFmY63kYUw":{"text":"From the moment we entered until the moment we left the service was excellent outer server","useful":1,"cool":0},"gtYqjqV_y4EGU1vKfRRZ5A":{"text":"Not good food. Beautiful courtyard. \n\nDecided on this place because of the veggie option f","useful":0,"cool":0},"W8ZCMpTbKZPFjo-4FTohfQ":{"text":"The only thing impressive about this restaurant is the atmosphere service was poor food wa","useful":0,"cool":0},"VKHMVNPYh4Y6rznS3WRJiA":{"text":"We stopped in just for a quick brunch in the area before leaving to go to the airport. The","useful":0,"cool":0},"6q3uVAGCqDhwkhs7b31gyQ":{"text":"Very tasty food with great courtyard dining.  So much good food in NOLA and this is one of","useful":1,"cool":0},"VB6C1yN6nuoI7wrcrWDfCA":{"text":"The best meal we had this time around. Service was great and the food was amazing. Be prep","useful":0,"cool":0},"6Bhp6GW5RXBuiK0N7wfKuw":{"text":"If there was a way I could do 4 1/2 stars, I'd do it for this restaurant - the only caveat","useful":1,"cool":0},"zEW0u0sOXUQ0Yj9FR1pR0A":{"text":"Came here on my first day after arriving in NOLA.  It was around 4pm and I had a Groupon o","useful":1,"cool":1},"-XLejaep38kY1B7qOu3SKw":{"text":"Poor service, slow service. Bar out of a standard easy drink.  7:00 pm.  No water or greet","useful":0,"cool":0},"jlws2EwjwnfkqhRoeYaseQ":{"text":"Maybe I hit this place at a bad time for Sunday brunch, service great, but I ordered gumbo","useful":0,"cool":0},"L-rQtRlTxK3BOv6A6vhQFQ":{"text":"So when we went to Nola cookery and the food was just exquisite and the customer service w","useful":0,"cool":0},"S6sCO_Ph6l4ziH5d-vBMwg":{"text":"Everything about the experience was terrible from the waitress to the hot beer  to the fac","useful":0,"cool":0},"3V0Fq6J13qXq9ysY0Luz3A":{"text":"We had lunch on the patio during our visit and it did not disappoint. The raw oysters were","useful":0,"cool":0},"o4TGBZPIGG01t6XdHo9iUA":{"text":"Very cool little spot - we ate in the huge outdoor courtyard which was really nice. We had","useful":0,"cool":0},"QybZ-9d_V77O2x6Ogdj5hA":{"text":"We ate at this charming restaurant and were very pleased with the authentic cuisine. We go","useful":0,"cool":0},"ZnjYK9zun78pmQcnjK4T9g":{"text":"We went in 45 min till close, only to see the bartender saying she cant serve a few custom","useful":0,"cool":0},"2xK-J_G18DqFUg8jJdFEsg":{"text":"This place was alright. Not the best but not bad at all either! I would give it 3.5 stars ","useful":0,"cool":0},"BdsZay-zS0MuPoJ7HQoLKQ":{"text":"Gotta love those chargrilled oysters. I haven't had anything else here besides them. I cam","useful":2,"cool":3},"Zgl8T4BC2ZMRUOzjABdzBA":{"text":"Tried out the bar at New Orleans Creole Cookery this weekend. First off, the staff is extr","useful":0,"cool":0},"Muq_YzaE9wa5hF_qgDfQYw":{"text":"What an absolute joke! Disgusting stale food.\n\nDon't waste your time at the New Orleans Cr","useful":0,"cool":0},"tOxMxeBxlC1r551-xQu4Xw":{"text":"By far the worst experience i have ever had at any restaurant across the united States.  i","useful":0,"cool":0},"xKT9hjc7779zJD0DKa94AA":{"text":"Great dinner in an outdoor courtyard. We got a groupon and were expecting this to be the m","useful":0,"cool":0},"vLRWLljRQOGNuAzUymvgFg":{"text":"We had dinner there on a recent trip to New Orleans.  We were greeted like family.  Our se","useful":0,"cool":0},"JKLJneNN1GHnZuCYVlbrpw":{"text":"The charges broiled oysters were out of this world! Carlos was a great waiter and suggeste","useful":0,"cool":0},"MRm4VijjkkZq47EHqdgiDw":{"text":"I had the creole pasta, which was absolutely delicious! It has a little bit of spice, but ","useful":0,"cool":0},"CxzmvVhWDoemfKsP_0ZFhg":{"text":"This place was just kind of trying to get by. The gumbo was OK. the chard oysters were rea","useful":0,"cool":0},"J5_MWLgPW7uA5cBUH5Oi_g":{"text":"I can't reflect on the food since I never received any - the service was absolutely terrib","useful":0,"cool":0},"6e-EfTLkeTbUM70Z6FCBoA":{"text":"We visited at the end of January, and had a fabulous experience.  The food was fantastic; ","useful":0,"cool":0},"dNGeKl9BXRZ-dlQKFmsnew":{"text":"NEVER AGAIN!!!! Service was awful!!! \nStupid waitress thought 12 chargrilled oysters was d","useful":0,"cool":0},"3DbTWjMhlbXmKJU4f3H9Hg":{"text":"Amazing cuisine, service and atmosphere! We loved it! Try the red beans and rice.","useful":0,"cool":0},"MzlMAsNIsrUVXiR2pmyCUQ":{"text":"My only issue with this place was the beautiful courtyard has a noisy vent or something th","useful":0,"cool":0},"L8T-79VwopsH1Rtw-Hp6sQ":{"text":"I gave it four stars mainly because of the good service and the even better Charboiled oys","useful":2,"cool":1},"m9R4J_U4s3n0Yt-M16kvEQ":{"text":"We came here our first night in town and I was underwhelmed. The food was definitely good,","useful":0,"cool":0},"iQarurrVvOoTTZGhCtdOaA":{"text":"Solid 4 stars !!!!\n\nHad the chargrilled oysters - OMG - tender and delish!\n\nTaste of New O","useful":6,"cool":4},"Sz9-5t7Yvmw0FkDVAbVzKw":{"text":"Had to reserve a table before going in but it was on New Years Eve! If you visit this esta","useful":0,"cool":0},"xq8i194xNizYyPBD5ym_zw":{"text":"Five star review is for the Oyster shucker Shannon. Enjoyed watching that man work, and ta","useful":0,"cool":0},"9P30O3K6RWWt2eBIUI0oTA":{"text":"We came here for the oysters and tried some other things for their happy hour. The fried o","useful":0,"cool":0},"t0hiG3xu7QxnN8KlOYri6Q":{"text":"The food was excellent however the service was subpar. The server had little knowledge of ","useful":0,"cool":0},"kB5K7aHlHtgehmvAP1Bfmw":{"text":"Service: \n\nLiterally, the worst restaurant experience I have ever had! Absolutely terrible","useful":0,"cool":0},"MEuxZ3L4TEMGuUGIthMfUA":{"text":"Went here for dinner and it was very pricey. I ordered a Cajun bloody Mary $14 and wanted ","useful":1,"cool":0},"FP87lYAoz7YY42ZPdK0Muw":{"text":"Wonderful restaurant! Beautiful outside seating. Friendly staff. Delicious food, especiall","useful":0,"cool":0},"NP5Tbop-zeRuHTvfpO0L-g":{"text":"Who doesn't love a good happy hour?! This girl is all about happy hour fun! \n\nNew Orleans ","useful":31,"cool":19},"4pZZcufe7BeC-o8KYNVPjw":{"text":"Stopped by for lunch and glad we found this place!  \n\nThe Shrimp Creole was very tasty and","useful":2,"cool":0},"glm7mFjO_SRcgw-qQwoQGQ":{"text":"Must visit!!  This place is fantastic!  The food is great, the staff is friendly, and the ","useful":1,"cool":0},"0bizbAEV6fNwC_Wg0x5Jrg":{"text":"I have been to New Orleans several times over the past 30 years and eaten at several estab","useful":0,"cool":0},"hYyHH1lGTJpXrr2b5cMUEQ":{"text":"What we received when we got our food was not really what we ordered but it was tasty and ","useful":0,"cool":0},"7MRDcSsO8qEQjznXqIUf7g":{"text":"This was probably the best place we ate at this week.  And we ate at some nice spots.  Gre","useful":0,"cool":0},"pCEchEyNGx1NFIz-1xnyRQ":{"text":"Would not recommend. We got the Pasta Orleans, Crab Cake, and Caesar Salad. All were horri","useful":2,"cool":0},"qkrYC-s-TEZ4j4_r-loHiw":{"text":"In the French Quarter decided to give it a try. Walked in and was seated immediately. Our ","useful":0,"cool":0},"RSd4M-BH5E8CZQpyA4XQkA":{"text":"The location is great, the ambiance is pure New Orleans and the food is pretty good. WHY d","useful":3,"cool":0},"tDPGAEt2LB_a4SypXKfKeg":{"text":"This was by far the worst service I have ever encountered.  The food was all cold.  Drinks","useful":0,"cool":0},"lcr9YHKGNU9rV9B2r0f6Lg":{"text":"Good food and service was good with only one server. They just getting back to from the fl","useful":0,"cool":0},"-xHi33xLgIwtkRls-dlVAw":{"text":"Mediocre food. Ordered crab cake Po-boy and the crab cakes were all breading and virtually","useful":0,"cool":0},"ON8p0kIIBRY2LkMXYcvuLQ":{"text":"Super cute place; super cute, authentically nice, and empathetic hostess, but has a lot le","useful":1,"cool":0},"p7C9zY-1b7MhW6Y3CPTVxw":{"text":"I love that the host/owner lures you in with \"just come inside and look at the building!..","useful":1,"cool":0},"-hXXzn0ksfiGBXiwR9TaKw":{"text":"Ate here on a whim and found a new NOLA favorite. Our server Will, was a true professional","useful":0,"cool":0},"jgk5k4GlF8IC84uw8GEKDg":{"text":"Can't really recommend the food because I never ordered. Went in at 4pm on a Saturday, was","useful":0,"cool":0},"ODa9Ox-1IJj3XK4VHJzEZg":{"text":"11/24/17\n\nNice chill place.  As with most places in the French Quarter, it has a least som","useful":43,"cool":32},"KXVN_DaWl6S1KNd_twpEQg":{"text":"Creole cookery was one of them places where the service was beyond great but the food was ","useful":9,"cool":7},"69OY3SiWnkQrwWhGtjqHhQ":{"text":"We stopped here randomly on a Saturday afternoon.  We didn't want to wait to eat and there","useful":2,"cool":0},"-HiScAbc9HaaLjVpGpmQPg":{"text":"Happy Hour??  Oysters for the low?? Yes, please!  $.50 raw oysters and $1 chargrilled oyst","useful":4,"cool":2},"mc2DW6S2WgwuOMMALGFMLw":{"text":"Love this place, Smitty at the bar grills up the Best Oysters  Great Guy!!! Great Bartende","useful":0,"cool":0},"MylXtVcRgCkfziPx1TPLHA":{"text":"My wife and I stopped in for a couple of cocktails and a half dz grilled oysters and we ch","useful":0,"cool":0},"rUcfoCxzJqSYhwV5LTI48Q":{"text":"Came here on Thanksgiving.  The venue is very nice.  White tablecloths, soft music nicely ","useful":0,"cool":0},"9VqPr9r5tpiou8si6FP8-A":{"text":"Not at all impressed. Friendly but slow service. The chargrilled oysters were okay but not","useful":0,"cool":0},"csupzJ-4splMRwiwnJG6Zg":{"text":"The food was good but the service was very poor. Upon entering the restaurant, my wife and","useful":0,"cool":0},"9i6iTzrisjky9s5kWjkhVQ":{"text":"Atmosphere is great, staff is friendly. However seriously food was on our table less than ","useful":5,"cool":5},"CSQwzYWtTJC3L1DRR4mOiQ":{"text":"Terrible food. bland and cold.  Horrible management . food from kitchen took way too long ","useful":0,"cool":0},"2bE5UxWWbnKnircaMFKpZw":{"text":"With all the eateries within the French Quarter of NOLA, there is defiantly a place for on","useful":0,"cool":0},"TrZjOPmY8TN_qkHDvFT_7A":{"text":"Warning - strict policy against no outside drinks. While we finished our drinks from bourb","useful":1,"cool":0},"YFHBWkfp2wZmsKLvlGA8cg":{"text":"I really don't like to give bad reviews, but this was the most mediocre meal I have had du","useful":1,"cool":0},"rWFIih1hEV99eQcRmoOPQw":{"text":"We game in with a large group for dinner on Saturday night. We didn't wait long which was ","useful":1,"cool":0},"dTOEsqU0Z7dtbIEHy3UHow":{"text":"We came to this place because it was close by and had good Yelp reviews. I wish we would h","useful":0,"cool":0},"HQjQmPIbFwm_xd8bGbbi3w":{"text":"Terrible experience. I made reservations for Mother's Day to celebrate my mother and my mo","useful":0,"cool":0},"XuCdain6PfAnAD7AQEmz2A":{"text":"Three words. Happy hour oysters! Yessss!\nWhat a cute little place this was we stumbled upo","useful":2,"cool":2},"dAJtqKyjzwLMej-GxORmLw":{"text":"I really wanted to enjoy a traditional Louisiana meal with my husband.  I'm a vegetarian s","useful":0,"cool":0},"Qa40ik88AVY0S0aq2ilNFg":{"text":"The happy hour comes with strings attached. You must buy an overpriced drink to get the di","useful":0,"cool":0},"PYt0IVSZ3TIY0L-1H-MPPg":{"text":"So-So food and decent courtyard atmosphere ruined by slow service and horrible management.","useful":2,"cool":0},"P5hsdshWRWO929pzB8uI1A":{"text":"Here from Cali and our initial choice to dine was only accepting reservations so this rest","useful":1,"cool":0},"GPaKGOSbLlgUXLNVlHE3cw":{"text":"A decent place for the french quarter.  Nothing spectacular, but was good solid food.  I h","useful":0,"cool":0},"572AgP0glf0DqhSdkzVthw":{"text":"I visited New Orleans Creole with my wife and her sorority sister. We were in town for a w","useful":0,"cool":0},"JcSOESgWojFNuxH_rHB21A":{"text":"good eats here. ordered their gator sausage, jambalaya, firecracker shrimp, and bread pudd","useful":0,"cool":1},"IWl2VUgLQQR11zGJdHCy3w":{"text":"Went here since they make vegetarian Jambalaya. We ordered hush puppies which were ok, jam","useful":1,"cool":0},"DRZImEfZF7o62hBXpJZFOg":{"text":"If I could give a half star, this place would of got a 3.5 star. This was our second night","useful":1,"cool":1},"R43UVHTVdOrIThFyk04PXw":{"text":"This was one of my favorite meals in New Orleans. I arrived with a party of 6 for a late d","useful":3,"cool":1},"qwt5XI32z0t7dfMrmpUSgQ":{"text":"Not sure why this place isn't rated higher.. it's a great New Orleans restaurant experienc","useful":0,"cool":0},"HJo5zJAuoVZW3VQN_MpciQ":{"text":"I'm so glad we found NOLA Creole Cookery. A vegetarian jambalaya is apparently hard to com","useful":1,"cool":0},"iSPQuU48GFc046XbzB4iQg":{"text":"My fiancé and I decided to check this place out for dinner on our first night in Nola. Mad","useful":0,"cool":0},"S-HBEz68sVPlfqpP4Go0Jg":{"text":"This is always one of my favorite spots when I am in New Orleans. I always say that I am g","useful":1,"cool":0},"Azo2ZNT6JMOkTPXtzzsRTw":{"text":"My friends and I came here on our one night in New Orleans, and definitely did not regret ","useful":0,"cool":0},"hP59_0qsdHAw8-8YkHWERQ":{"text":"I stopped in here, lures I. But the \"free samples\" sign. The pralines are excellent, a sug","useful":6,"cool":7},"GZk1o0UUG-eThc3LpMV60g":{"text":"Creole-ey shit that was good! Started with the stuffed martini at the bar as we waited. If","useful":0,"cool":0},"CoEcz1EOPhL1qP4d1qYU_A":{"text":"I'm torn between awarding 1 star because I am still quite upset at the service we received","useful":8,"cool":2},"PWxkNdAIJSqXnxTAmNBnAg":{"text":"Incredible food. Tried the taste of New Orleans sampler and it delivered!! Ricardo was our","useful":0,"cool":0},"ilZAD88l88TTCd-Q4h7Lpw":{"text":"What can I say?  I'm not mad. I'm not writing this review to be mean. I'm just writing it ","useful":0,"cool":0},"TZ1HcbK7kNP0iauC4iCUeQ":{"text":"We're walking around looking for a new place to eat in New Orleans and decided to try this","useful":0,"cool":0},"uBNhgDzwwa7AZSG7egHCtA":{"text":"SERVICE! FOOD! ATMOSPHERE!\nThanks for an outstanding lunch of oysters, shrimp grits and a ","useful":0,"cool":0},"LGoMZMcEwaRRS4i145WFqQ":{"text":"A bit disappointed.  Didn't have the full menu.  Service is very slow even when the restau","useful":0,"cool":0},"Epl7pYL_DyF8NYN0KMb15Q":{"text":"The food was wonderful but it was overshadowed by the abhorrent and unprofessional lack of","useful":0,"cool":0},"eC719yn_HvOhIHMM9E4Lkg":{"text":"The last stop on our food history tour for dessert. Before Katrina, the location was an Ir","useful":1,"cool":0},"snJMIuW4IJBl61FdOoIikQ":{"text":"We found this place listed with good reviews as an upscale restaurant, but left feeling li","useful":0,"cool":1},"DoLk0jsdhSPNS89HHiGtUQ":{"text":"Saw the great reviews and rating in Groupon and decided to purchase one for my NOLA trip. ","useful":4,"cool":0},"n0Lf0M_ieRTDsDe4tmPIDg":{"text":"Pecan Crusted Redfish. Just do it! It might have been the best fish dish I've ever had! Th","useful":2,"cool":2},"osLMTXrgxyOz4ZKEbFTcaQ":{"text":"The duck was outstanding! Perfectly cooked, great flavor, sides were delicious, and paired","useful":0,"cool":0},"4N2VwVxL0jBcpfFmhgMTjw":{"text":"As this is my inaugural review, strap in and get ready for a comedy of errors. We came for","useful":1,"cool":0},"sS1ocPcSaHao_tr8sYl6ag":{"text":"Darryl and crusty rude lady\n\nGreat meal here. I had the pecan crusted redfish and it was l","useful":0,"cool":1},"-RwAqAnKr14Uf0z-kXM3fw":{"text":"Just ok. Jambalaya was seasoned well but a lot of rice to little meat. My husband had the ","useful":0,"cool":0},"91hJpoUOqpmSVj07bKxS9Q":{"text":"Our waitress was Celeste and she did a fantastic job! We were a party of 10 which can be o","useful":0,"cool":0},"DNJqnRQ-5YLNsDLnx9JBdg":{"text":"This restaurant was absolutely horrible. We went here to celebrate two of our friends' bir","useful":0,"cool":0},"yxalmEbsG05_xE7c_QJohw":{"text":"Anna was a wonderful server- the outdoor courtyard was an authentic fun place for lunch.  ","useful":0,"cool":0},"nCZJIt36VSdrS9oHKrMspg":{"text":"I had chargrilled oysters and my fiancé had catfish and jambalaya. Everything was deliciou","useful":0,"cool":0},"x_Ytckb6X2jqBGyzhz14eg":{"text":"This place had some mediocre reviews but we decided to come anyway.  I had gotten a Groupo","useful":0,"cool":1},"sY6BdwyKZqOXOh9pxGqxJQ":{"text":"Great food & wonderful service we were welcomed to new Orleans in an excellent way ordered","useful":0,"cool":0},"1BJqQ6bO7YiSbAQO3WWfZQ":{"text":"I was visiting from out of town and thought this place looked promising from the outside, ","useful":2,"cool":0},"l4tOaTN0by1IupaUMIULnQ":{"text":"So, there's a big change here. There's an oyster shortage and oysters are no longer on Hap","useful":1,"cool":0},"0eshWdcOfNBYlpmen7QKmA":{"text":"Amazing! The place is a nice find! The blackened fish, green beans and potatoes were great","useful":3,"cool":0},"bxAJSupGyeyyWX41avtDTQ":{"text":"Touristy spot down the quarter, so a tad overpriced. The food was decent, but the drinks w","useful":5,"cool":1},"8t3qw5wRAUkQvKDgZ3PD2w":{"text":"Yum! Crab legs for days - staff were excellent and they made my husbands birthday lunch pr","useful":0,"cool":0},"PP0hMQ12oDR56iYTamRQbw":{"text":"Horrible service, an hour wait for our food. Gross po boys! The the waitress tried tipping","useful":1,"cool":0},"svjnw90Sxzi8ZpaQ2u_CXQ":{"text":"This joint was our first stop off the plane and I found it on Groupon. We arrived and was ","useful":0,"cool":0},"ogEQ9Jzhh7R_LKvnBg_N-A":{"text":"I visited the cookery during Covid Restrictions and they followed protocols and made sure ","useful":0,"cool":0},"zOFPkh0vX1CUJhP1fukUpw":{"text":"We tried this place a couple months ago when we were in the area, and it's hard to give it","useful":3,"cool":3},"TuPjMrKC3j0Zyb-Gb20mUA":{"text":"The only reason they get one star is because zero isn't an option. My friend and I went th","useful":0,"cool":0},"i-lqf7skgGL_hGWz6YxsSw":{"text":"A little disappointed. Went to this restaurant today(11/6/21). The food was terrible to sa","useful":0,"cool":0},"XyW7Gm2dNVHOu96G2VRJoA":{"text":"For a NYE brunch, very disappointing.  Made a reservation and was not seated on time.  Wou","useful":0,"cool":0},"Qd0EeZSFKA-G-J-p0cW0rQ":{"text":"Great vibes and bottomless mimosas, some food was small portions but overall good!! Crab c","useful":0,"cool":0},"xhywy9XCQoG_4yo7UQ0tLg":{"text":"The place was very beautiful and the waiter was ok as well. The guy that was outside the d","useful":0,"cool":0},"6KXah81-fAySkgfIBLAY7Q":{"text":"We visited on November 29, 2020.  The Creole Cookery is still open with safety precautions","useful":0,"cool":0},"A-DSePo78xwnLrPXihnryA":{"text":"Walked by yesterday to see if they could seat a 4 top for dinner. Hostess said they were b","useful":0,"cool":0},"5bvD5K3p2cK7kyHRSZdQYg":{"text":"We really enjoyed this place right in the heart of the French Quarter. Our party of two sh","useful":1,"cool":1},"1WYwD2yjiRlUZlCf9N7lzg":{"text":"Beware of this tourist trap!!!!\n\nThe bf and I stopped by on a Saturday night for an early ","useful":4,"cool":1},"2mB23tmO_M_HjF4Sr-3WEg":{"text":"Do not waste your time.  We were seated outside.  The view is of their storage area.  They","useful":0,"cool":0},"FbJVBfEoipEltOMohbaYPw":{"text":"Stopped in here randomly because of a sign out front - happy hour $4 drafts, $.50 raw oyst","useful":2,"cool":1},"C7Ydy2-Wej7SPJKcnre68w":{"text":"We found a Groupon for this place on our first day in New Orleans but it was only good for","useful":2,"cool":1},"-FthWuvUe3IpeKjLWt_w4Q":{"text":"Great Gator Bites, amazing red beans and rice, good bread pudding! Worth a visit! Waited a","useful":0,"cool":0},"kyutTNJUo2Nhe49VGPJsig":{"text":"Char grilled oysters were unbelievable. Great cocktails and service. One of the best meals","useful":0,"cool":0},"a9TVC4KkUZfQmwf1J_8Dyg":{"text":"Orleans Pasta. Try it. It stole the show in my group of 7. Their oyster are good too, but ","useful":0,"cool":2},"PgXay311dpS-cGLGKPIAVQ":{"text":"Rather nice almost fine dining feel, good menu with lots of choices! We got a whole part o","useful":0,"cool":0},"VwojVOFE29MhrAnxBBuF9A":{"text":"LOOKS CAN BE DECEIVING!\n\nVisited yesterday and had we had the fish and shrimp platter alon","useful":2,"cool":2},"zT_uwSjZfIP8ksUjtEWIdA":{"text":"We came with a Groupon and we were not disappointed. We had the \"Taste of New Orleans\" and","useful":0,"cool":0},"t0L1xZq5LhgbKJeynXy0Lg":{"text":"The outside seating in the courtyard was nice. The food was mediocre with small serving si","useful":0,"cool":0},"TWkX84LOOLij2uuRJKr67w":{"text":"My girlfriend and I had lunch there yesterday.  She had the crabcakes and I had the taste ","useful":1,"cool":1},"2voKNIFFKiGGSymLlFvxew":{"text":"We were in NOLA for a girls trip.  I picked this place for my birthday dinner. But when we","useful":0,"cool":0},"l-pZEbUfhvHl_Fkln4cDdQ":{"text":"The wait person was lovely but totally busy busy. But understandable with the service indu","useful":0,"cool":0},"OieNuwAY_jax-6kSc7tzFQ":{"text":"Where do I began? The host is very charming and I can see why this place would get a lot o","useful":1,"cool":0},"nrkeNj-kL0JQlUhZrvZqTQ":{"text":"Nope. Not. Ever. Again. Our waiter didn't bother to come to our table to even great us for","useful":2,"cool":1},"v6ZUvhdFak2cIwuPE4Eu8A":{"text":"Visiting from Chicago, we were expecting great creole food and let me tell you....New Orle","useful":0,"cool":0},"Zt1Vvz7uPVaik9r3HhNDXQ":{"text":"This was my first stop after I touched down to NOLA this morning. Everyone was so hospitab","useful":0,"cool":0},"jP5F_FA6Q_-TdiGVpEa2_g":{"text":"Spouse and I decided to take out of town guests here . Worse mistake ever . Our service sh","useful":0,"cool":0},"qy3R539BNgSF2unxePXjOA":{"text":"Bought a groupon for this restaurant because the reviews were good.  The restaurant has a ","useful":2,"cool":1},"XwjGVCqdKKBY7qFKxfWckA":{"text":"I don't really understand why this place only has a few stars because my group had a great","useful":5,"cool":5},"Ofb58J3Wte9N333luv-tiw":{"text":"Let me start by saying that the service was amazing. Our waiter was nice, informed and att","useful":1,"cool":2},"FQG7yFV2VBH97nHtfJs8tA":{"text":"My friends & I had dinner at New Orleans Creole Cookery for my friend birthday dinner. You","useful":3,"cool":1},"IDADJnDZxFOC5ZrqLbik5A":{"text":"Jessica and DeShawn were amazing!! \n\nThis was my first ever oyster tasting and DeShawn pop","useful":0,"cool":0},"xjHvXyI0V0YMPyqe2x2ADw":{"text":"We did lunch during a weekday. Promptly was seated and made aware our server would be Angi","useful":0,"cool":0},"2eYUzJra5SSN8E4LkUnrrw":{"text":"Very disappointed. Took forever to get served and when we did, it took over an hour just t","useful":0,"cool":0},"MfOIyr4uMFbFS83I7kr1mQ":{"text":"This is my second review and once again I was throughly pleased! I love the charbroiled oy","useful":1,"cool":0},"WwsBLz8YuhHs1u5G6fj-Og":{"text":"Service:  (thanks Jackie)\nVenue: Outside, cute. Inside, real pretty\nMusic: Jazz station, F","useful":0,"cool":0},"y36uM7LcoJrG6rlu7DJ7Dg":{"text":"Have to say it's the worst place we tried in Nola. There was a foreign metal object in our","useful":0,"cool":0},"e0Rkrd24ViopBTnKU_vVzw":{"text":"I had the Redfish Pontchartrain and was really disappointed.  The Crabmeat topping was bas","useful":0,"cool":0},"POnMWYkRNxhPGrbvKLjmwQ":{"text":"On our third stop of our food tour with DK tours we came upon this wonderful location that","useful":1,"cool":0},"6tRlFHu9zMIxFP6VVZ94zQ":{"text":"The best food I had in NOLA was here! For $28 Order the \"taste of New Orleans\" it will inc","useful":0,"cool":1},"A1lSwUuGYNdK4Fj9ErOZkA":{"text":"Damon was an excellent server, we loved his suggestions on the menu and the food was reall","useful":1,"cool":0},"hk_ksmEsPv_qKA2HJLR9GA":{"text":"My husband found a Groupon for this place while visiting NOLA and the reviews looked solid","useful":3,"cool":0},"N1l6bNDPE3LkKIYfOLCmXg":{"text":"Good food: hush puppies and fried pickles to start. I had blackened red fish over a bed of","useful":0,"cool":0},"hMVyqy7CJxWxWf5hn4TEtA":{"text":"Made reservation for thanksgiving for one, due to my son being with his mother and my fami","useful":0,"cool":0},"xVwIcDFxLV7ulLgMGVSd_Q":{"text":"My favorite char grilled oysters in New Orleans! I have tried so many places throughout th","useful":4,"cool":3},"WRDxpwOFCmTeahw2mcfisQ":{"text":"We made it just before happy hour ended... Our server, Terrill was helpful and made sure w","useful":1,"cool":0},"rIFFHY7aY5P6sqe67xIGQg":{"text":"Good: Outdoor seating \nBad: Food, price\nOverall: Never Again\n\nI was visiting with my famil","useful":1,"cool":1},"MZE55waUrLG2XUtZA5Lc-w":{"text":"Usually there is a line around the block for this place curing the peak tourist season but","useful":0,"cool":1},"mqs_bj2bL5M0WL5d-mp6aw":{"text":"Oh my, the chargrilled oysters were some of the best we have had in New Orleans. We did no","useful":0,"cool":0},"NdE1wwLReqx9CRwiXhfbRQ":{"text":"I came here with my boyfriend for an anniversary dinner and we sat outside near the founta","useful":3,"cool":1},"Is62TNc__IGpvBgd5iPs9w":{"text":"I was a little disappointed. My crab cakes Napoleon didn't have the beurre blanc sauce as ","useful":0,"cool":0},"P4-Tz6jqbJqvl8YNikSFlw":{"text":"Lack luster food, Luke warm, crouton Caesar(almost no lettuce), dirty bathrooms, inattenti","useful":0,"cool":0},"uoC7GYbTBfWmjeK-F7P5cw":{"text":"So, this was our first meal when we arrived to NOLA. We were promptly seated as it was sti","useful":1,"cool":1},"vaGSbwNU_P11jS0BfMJ1xQ":{"text":"This was a very disappointing experience. First off the place is dirty. Once we were seate","useful":1,"cool":0},"Ve0OAm5PLZwjBHxHo3edEw":{"text":"Chargrilled oysters- 5 stars. Best in NOLA. They shuck them and grill them right in front ","useful":2,"cool":2},"L8i9QWoFckaS9EUguWkmng":{"text":"I'll start by saying this place is very pretty. The outside is really nice and The inside ","useful":1,"cool":0},"HYistHOjtuutzeiyJNu-yA":{"text":"I don't know about anyone else, but I hate to be pressured to come into a restaurant and I","useful":0,"cool":0},"zoGN1ncTdJTvGgdBNBfGWg":{"text":"Super fast service! Every single drink was excellent! The service was impeccable! And the ","useful":0,"cool":0},"wJuM_brSOYv6xfGeSae6pA":{"text":"The service and staff was excellent. My rating is solely based on the food. I had the jamb","useful":0,"cool":0},"4RLS1uwyf6ARp1y9WPffKA":{"text":"This place is in the middle of French quarter, it is hidden away since it is on one of the","useful":1,"cool":1},"sUtFW5m6g6Zz-0dXkEW-Jw":{"text":"The only positive is that we were seated immediately and it went downhill from there. My u","useful":0,"cool":0},"Qqtm1WeL9ke3agGGIx9DiA":{"text":"Don't waist your money and time\nI'd rather eat Raw seafood straight from the Mississippi R","useful":1,"cool":0},"LhP-EjY27qvdibCOEComIQ":{"text":"The char-grilled oysters were amazing! I found this restaurant on Groupon so we thought we","useful":0,"cool":0},"HPwyXn-U4dCcqLNGCuA2Ng":{"text":"Their fried seafood po boys are by the best I've had in and around the French Quarter. The","useful":0,"cool":0},"ub3ounpPvh4mTRd8Zukhew":{"text":"My wife and I spent 5 amazing days in New Orleans and every restaurant we visited was amaz","useful":0,"cool":0},"ePphnstkmdW03OqRxzcVSg":{"text":"Food was amazing! The only downfall is that the place is so loud...almost too loud to even","useful":0,"cool":0},"Svl1N45CBAIedFZ7pfbv_Q":{"text":"They did not live up to any hype. There are much better restaurants in NOLA. I had veggie ","useful":2,"cool":2},"DCkoULX7mNXrmUqxGnCahA":{"text":"This is establishment had very rude service and our server fought with us on the bill. I w","useful":0,"cool":0},"pIZIy74Aa_iJ7pC4lwt9Jg":{"text":"This was the worst dining experience of my entire life. To be fair I understand there is a","useful":0,"cool":0},"wnJlZy72UKWCVleBJoyLHA":{"text":"SCAMMED!!!! \nWe went in because the guy in front of the restaurant sold us on \"1/2 price h","useful":0,"cool":0},"Uau_I3JW3xPngEXUzTBjdw":{"text":"One of my fav spots in NOLA. Bar staff is always friendly and welcoming. The drinks are st","useful":4,"cool":1},"OqtNsn2M7BxDb7-608i9fQ":{"text":"Made reservations. Came in and was turned away because I didn't have a picture of the BACK","useful":0,"cool":0},"cZGokqQfQn8HczYO227ASg":{"text":"Stopped in while on vacation. Jesse and Money was amazing and very helpful. Food was great","useful":0,"cool":0},"qiNhyxXYkz1Lg8JZREgEkA":{"text":"Went here on a Destination Kitchens food tour with Jack and loved the options this restaur","useful":0,"cool":0},"6a0X3i_dHQAG5s7cRz4UxA":{"text":"Had high hopes for this location, but it fell short. Our waiter sucked and Barry checked o","useful":1,"cool":1},"x7l5yD1mYK8a_qFhi-1Zbg":{"text":"Bartender made a Sazerac in a pint glass but it was only about 4oz of drink.\n\nFood was ok,","useful":0,"cool":0},"Vq8SxPD5ct54okBIs9i6oQ":{"text":"The only positive of my experience is that we were seated immediately and it quickly went ","useful":0,"cool":0},"9NLiEs9UvMwCoCFVZcWHMw":{"text":"Went with business group and had a few gator bites for an app and they were ok. Problems s","useful":0,"cool":0},"pTjJnoyOHby9yCAZlAxazg":{"text":"Very disappointing place. Food was overpriced for the quality. Server was rude. I definite","useful":0,"cool":0},"lFfe7qFC3mua5YM2Oud91w":{"text":"Damon was fantastic. We're here in Nola visiting for my boyfriends birthday. Once he heard","useful":1,"cool":0},"C-Me7DesFmQhVJhJzDtVIw":{"text":"The restaurant has a fancy appeal, but food was a major disappointment. This could be beca","useful":0,"cool":1},"8h5ZIjzT00Dlo83IWk14-Q":{"text":"Food was incredible, and great service too! Every bite was rich in flavor, and melted in y","useful":0,"cool":0},"NGoOk6fudoLNLRaoBEuZZw":{"text":"For the price during happy hour, get the oysters! The bartender stated it was the best he ","useful":0,"cool":0},"qkC19dI1Awuw7w0CMDxFnw":{"text":"LOVE the atmosphere here - so New Orleans! We sat in the lovely courtyard with fountain an","useful":0,"cool":0},"4rpQeDGb1s1VhEaVhFStUw":{"text":"This place was the absolute worst. We arrived for our reservation, and was barley greeted ","useful":0,"cool":0},"Grlj5ZSbQho_kHJPV6MKtQ":{"text":"So before I came down for vacation I scoured over Groupon to get some deals on food before","useful":5,"cool":3},"ChBkKw6bhfPjgzDNvKh_Tw":{"text":"We decided to visit this restaurant as it was one of the very few places that served a veg","useful":0,"cool":1},"pHf-JAiRHbY0mkLHlpym-Q":{"text":"Creole Cookery is right off Decatur not too far from Cafe du Monde. We stumbled upon this ","useful":0,"cool":0},"2SjGgF2pj9y8x1BfbLxjyA":{"text":"Worst service I didn't even get to eat I ended up leaving. I had reservations booked. We g","useful":0,"cool":0},"l_SkN5OCMaPst2Y17qySkA":{"text":"Food is mediocre. Fish overcooked. Seasoning somewhat bland. Edible for sure.. not awful, ","useful":0,"cool":0},"vJK7hauhk_hFA5RgADpVKA":{"text":"over price cajun food with no flavor,bad service and if you go with 6 or more people ,they","useful":0,"cool":0},"1_ectRtDS-y2kAg7ForIkQ":{"text":"I had the jambalaya, which was phenomenal!  I'd pay to have the recipe, it's that good.  I","useful":1,"cool":1},"S228qqDqjqYB5Cdh6qsI9g":{"text":"The food here was not good. I had the Shrimp and grits dish along with char grilled oyster","useful":0,"cool":0},"SJDrQOsKLX6nPu8TgYO3pA":{"text":"The best tasting thing we were served was the tap water. The food was overpriced and bland","useful":0,"cool":0},"jszaAevf-zApGk-ByEALvQ":{"text":"We started with Happy Hours 75 cents raw oyster was delicious!! The food was fresh and tas","useful":0,"cool":0},"oNPzwsoOFv3HHekGmCZ5Ng":{"text":"This was a stop on a food walking tour!\n\nWe had a sampling of jambalaya, gumbo and an oyst","useful":6,"cool":5},"2yKcE_blbOC6qrMof4JWSw":{"text":"The French bread comes per request and when it did, my kids asked why it was chewy, you ca","useful":1,"cool":0},"wEwjqRZaa_-UWnVdO5mdjg":{"text":"Hostess was nice. Gentleman behind the bar shucking oysters was nice. The place itself loo","useful":0,"cool":0},"goMFWV15Q1ygfhGCX395Pg":{"text":"We wanted to do a fancier dinner for our first night in NOLA and on paper, the Cookery loo","useful":0,"cool":0},"0t7z-CIEKqPeb1ywl3X9GA":{"text":"This is a great spot if you like to share your meal with your dog.  They have a very nice ","useful":0,"cool":0},"M-TfSMOn7vJYHbV9EyaMYw":{"text":"This place was the highlight of my trip and my most favorite meal. Service was professiona","useful":0,"cool":0},"_rG1MZw-MbXAZS8ePdNylQ":{"text":"I don't enjoy writing this review. I hate leave anything negative. But this place is just ","useful":3,"cool":0},"3mKDdiMwl31B46UQHjmuzg":{"text":"I went here on a Groupon. I Had the blackened red fish & oyster sampler. The red fish was ","useful":1,"cool":0},"CpdPEYA8xemubYmXaP32-A":{"text":"I will warn you up front, they will hurt you with food. The portions are huge and it is to","useful":0,"cool":0},"5a-PqytQAv7oUUhqlvzjnw":{"text":"What a hidden gem! I love this place. The food is great, drinks are potent, and there is a","useful":2,"cool":1},"DXMyKX1VHTL0dyb_VaYKbA":{"text":"Incredible service by Damon, great outdoor dining and amazing food!","useful":0,"cool":0},"yiciPA-SP1IjDZW9ASCdRg":{"text":"This restaurant is located in the center of the French Quarters. In comparison with other ","useful":0,"cool":0},"Z7ufZGgKFBTgLuloasediA":{"text":"Had the best time and the best food!! Allen behind the bar with the oysters is THE MAN!! A","useful":0,"cool":0},"Ny5Nskg7b6roKFoO4F3PNQ":{"text":"I hate to rate it a two because the food was sooo good. However, our waitress on the other","useful":0,"cool":0},"9-jvC5i2kIDmhqrLyewvCg":{"text":"Awful.  Took at least 15 minutes for someone to come to our table.  Finally, we ordered 2 ","useful":0,"cool":0},"Kj-19vvcv7yOd3kMlUd07Q":{"text":"We ordered the Pasta Orleans and the Redfish Courtbouillion. Everything was cooked well an","useful":1,"cool":0},"rbb1t6V4Odt44_1IxZQaJw":{"text":"We started at the bar for oysters - and as it turned out they were the highlight of the ev","useful":0,"cool":0},"0MXQ0fdQhjGpavjb_tIhqw":{"text":"Whitney took great care of me and made me a banging drink! Oysters are incredible. The shr","useful":1,"cool":0},"6vNQY2AKlrXjiwQssZHoWA":{"text":"Let me start by saying this was absolutely the worst dining experience of my life.  From r","useful":0,"cool":0},"0fyjz2Z4M8z3Topr7sbNnQ":{"text":"We just arrived in New Orleans late yesterday afternoon but happily had a reservation at N","useful":0,"cool":0},"jRmZoTWak_IL3LvPI6PgLA":{"text":"What a disappointment. Our first time to this restaurant was amazing, both service and foo","useful":0,"cool":0},"WxUG8X7b24c-RMF5xsnnaw":{"text":"Really really good !!! Chargrilled oysters are wonderful better than a lot of other places","useful":0,"cool":0},"o_760mAhqkrHNtDmUv0TXw":{"text":"The Cajun pasta was good. The level 4 hurricane was a bit of a waste.  The best part was s","useful":0,"cool":0},"adgSleYOdITK6hrL275SDw":{"text":"My husband and I love New Orleans! After 25 years of visits this is our favorite place for","useful":0,"cool":0},"vcIY7WSXLOqojK9wAxvsXQ":{"text":"I love NOLA for many reasons! Food being top 3!! Must try the hush puppies, oysters, allig","useful":0,"cool":0},"KSJH17UVueq7p29F4jJi7w":{"text":"Food was amazing, especially the charbroiled clams! Not normally a fan of clams, but was r","useful":1,"cool":0},"G5MMDrxE3PvZdzyaSp599A":{"text":"okay guys i hate writing bad reviews but you're breaking my balls man! i found a pickle in","useful":0,"cool":0},"zt-0W46iMMgek7PDBEeXKA":{"text":"We loved the chargrilled oysters here! And the grill guys were friendly and awesome!  Serv","useful":0,"cool":0},"L46wS7Pgv7Usr3tTFQPKMg":{"text":"We received great service from everyone that we talked to, from the charming gentleman wor","useful":1,"cool":0},"CVrMXMr9PFD2ddopN3qh6g":{"text":"First time going here.. amazing!\nHad outside seating that couldn't have been more perfect.","useful":1,"cool":1},"lOIYUku6hjGIvsqGuAm3xw":{"text":"Great food and a variety of options. It is a very nice restaurant with a fountain and open","useful":0,"cool":0},"YScQem1pI2WaJ18U0_3Ruw":{"text":"This place had THE BEST car-grilled oysters ever. They also have unlimited drink options! ","useful":0,"cool":0},"lnVDjuL2FvQU_x9b7LUlqQ":{"text":"After visiting NOLA in 2018 for a book signing, I had to return again this next year. The ","useful":1,"cool":1},"WmFhHwJ-dKqK6Q20RhFi_w":{"text":"RUDE!!!  We had reservations.  We walked in to discuss using the Groupon and one of the me","useful":2,"cool":0},"rvN9lE5Z89JIebIkfe0uxQ":{"text":"Meh.  Waitress was great, redfish dry, the taste of New Orleans sampler 4 out 5.  Was it a","useful":0,"cool":0},"TBXzS-sJTaNQvlNfInP4_Q":{"text":"We visited for our daughter's/son in law's wedding rehearsal dinner. They had everything r","useful":1,"cool":0},"jgJbiNcmmNNIQcIKaoTfBg":{"text":"We arrived for our reservation a little early and the restaurant wasn't ready to receive u","useful":0,"cool":0},"zD6oxr1giPZzzAzTlZVufg":{"text":"Ok. So the food here wasn't that good or memorable IMO. But they would've gotten more star","useful":1,"cool":1},"asq5kUjXWfTbCUwc1b1rkA":{"text":"Food was AMAZING! Staff was incredibly sweet and provided great service. Our waiter was a ","useful":0,"cool":0},"9nGZGFdzBD2KH8xIZAq5gw":{"text":"This place wasn't on my list of must eat here, but we were by the square, waiting to kill ","useful":7,"cool":4},"c1tRrmqieOSiPCcGu1WjgQ":{"text":"My partner has never been to NOLA before, or tried any of the city's amazing staple food i","useful":1,"cool":0},"a-rWgUDeUbnr0FPJyLV-qw":{"text":"Creole Cookery was my favorite restaurant out of the seven I went to during my weekend in ","useful":1,"cool":1},"4Wrz-AH4kVSaJ6pw6U-jKQ":{"text":"The food was ok and I think it would have been better with better service. It started when","useful":0,"cool":0},"kVL-SBmJ_xegculIRln33Q":{"text":"I made reservations a week in advance due to the weekend being New Years Eve weekend. Chec","useful":0,"cool":0},"6KMRXmoUcYBhyZhRjB-H0g":{"text":"This place would get five stars, but the greeters need a little reminder in customer servi","useful":2,"cool":0},"RoidUSpFqA1FZ1HkfI0Qrw":{"text":"The food was just fine. Vegetarian jambalaya was very mediocre (tasted like rice with ketc","useful":0,"cool":0},"F02I6NZdJJ5ebvpxD_LimA":{"text":"Fantastic friendly place in the quarter for folks that eat all kinds of different things -","useful":1,"cool":1}}