{"CoUAXNAThHlJA1j4QENLiw":{"text":"Great service! Sit at the grill and cook your own food, it's a great experience. The garli","useful":1,"cool":0},"vzsqBaGrn0eypWvkGxI1gQ":{"text":"Great little place with great food and awesome service. They are opening up a Korean BBQ r","useful":3,"cool":3},"odqhonXnKCjmi3K6Nh_QiQ":{"text":"Visiting New Orleans looking for great Korean bbq and fantastic service this is the place ","useful":0,"cool":0},"cf88FbCjxnFkyyG_HOF9Fw":{"text":"Me and my parents went to it we really enjoyed it. It was my mom and dad first Tim going t","useful":0,"cool":0},"2ojGn6ShBiMZnUNMAwnt5A":{"text":"Pretty good of each dish. One mature man seems handling all foods well. I will give them 5","useful":0,"cool":0},"dE-yGayjcXcy2gykxerRaA":{"text":"Two Thumbs up!  moved to new location 2 month ago. same people.. excellent food.  only kor","useful":0,"cool":0},"OabM8QWKudP_s4K9SU1guw":{"text":"So good. Cravings satisfied. \n\nGet the spicy pork belly and spicy bulgogi. \nSuper authenti","useful":0,"cool":0},"yExSKaxF5HWZTddaCO6PPQ":{"text":"Took a friend here for their first time to try kbbq and I was somewhat impressed! After be","useful":1,"cool":1},"OA3FJ7P7MjcQlnFGQKj22A":{"text":"This is my favorite Korean spot! The food and service is top notch. My favorite is the gri","useful":0,"cool":0},"tglVe0gkgo0nLcgRLWKW_A":{"text":"I am so glad I finally made it to this place, and I am definitely going back again soon! T","useful":0,"cool":1},"ar9E99gtF9OwCO0aSMJnkQ":{"text":"I am a big fan of K-pop (especially bts) and Korean food, even visited Korea a few times. ","useful":0,"cool":0},"PMUqAOq5lvNo3i3r1nXJDg":{"text":"Considering this was my first time trying Korean food, I'm happy to say that I left rather","useful":4,"cool":1},"jDPfztCpvr7st7cXDhQBsg":{"text":"I've been for lunch can a few times and have always enjoyed it. Fresh and flavorful. I've ","useful":0,"cool":0},"OL2ItNNyxaubCgvpmanbhQ":{"text":"I used to eat at the old location and loved it. I was really excited to finally try out th","useful":0,"cool":0},"JUN8-OizjE9wzR-WTt8pQQ":{"text":"Service was slow, bonchons were very limited. Food also took forever when there was only a","useful":1,"cool":2},"KjVi7TTK8FwDFdXHSHJyKw":{"text":"I have been here multiple times when it was at its old location. Between here and Korea Ho","useful":0,"cool":0},"LPEYQ-bBKC-cNAdVw-XsXg":{"text":"This place is very very good. Great service | Awesome concept | reasonably priced - I woul","useful":0,"cool":0},"Rln36ucbpLuh6s67-QvCCg":{"text":"I wanted to give 3.5 stars. This is in a great location, and a break from the poboy spot o","useful":0,"cool":0},"3BSWhOSCUbs_-I1mKgd7mg":{"text":"I'll preface by admitting that I have quite a high standard for Korean cuisine. Born and r","useful":1,"cool":0},"zyWFKdAB-HE5gl0f7bDi7w":{"text":"Recently was back in New Orleans visiting family, and tried out Little Korea.  I'm vegetar","useful":1,"cool":0},"1uZn_5ddxRmlfD_DkdwgaQ":{"text":"When my date and I walked in, we both were excited but a little confused about what to exp","useful":1,"cool":1},"6d1sDDAl38dvFNtQK3yoTA":{"text":"Jeeee!!! This place is so ridiculous. i had to sign up an yelp account just to write a rev","useful":2,"cool":0},"8mSrJMLF1iESKPUgfn0ACA":{"text":"We have been wanting to come here for a VERY long time and I couldn't be more thrilled wit","useful":0,"cool":0},"L4CN5nFjLP6wYdmJKv6AIQ":{"text":"I went to couple different Korea restaurants in town and this is the best one by far. Defi","useful":0,"cool":0},"_szqa4cG7W5jtH77h2eIsw":{"text":"A nice addition to Claiborne Ave. \ngreat effort at authentic Korean. Enjoyed the sides ver","useful":1,"cool":0},"R20pCmbmy-ssemQqxl_1Bg":{"text":"This is my first time I had Korean food in New Orleans. The food is great. Servers are fri","useful":0,"cool":0},"HoGNZjAVLXbpiWnn7tva8w":{"text":"Don't be fooled by its old facade or judge it on its former Taco Bell glory. It's clean, c","useful":1,"cool":0},"-B_OiBEGUVEN1wpsw5E1Xg":{"text":"This is the real deal. They bring a variety of starters that are delish including kimchi w","useful":2,"cool":0},"nwyRAl4rC-M4XmAs09OV5A":{"text":"I would have given 4 1/2 stars if halfs where allowed. \nWatermelon cocktail was super good","useful":1,"cool":0},"MUHHirsvkK3RUIQNk0gtuw":{"text":"I have high expectations after living in Seoul Korea for 3years. The food was good I took ","useful":0,"cool":0},"wJKuftMz0iQollCRaEAy8g":{"text":"This isn't the best Korean food in town. But its okay. Its still traditional with all the ","useful":1,"cool":0},"_gd1GN6dFHPSdUE6tMJzhg":{"text":"Little Korea is mediocre to my tasting. The food is overly salty and expensive and during ","useful":1,"cool":0},"Db_hIGo_EOIzP9CbJfzJ5w":{"text":"Had the best time at this little place. Great feel, and super cozy. Let me start by saying","useful":1,"cool":0},"zHMTV602ZpzbwEi_NlQ1wA":{"text":"Might just be the worst Korean place in town, but it's a really short list. Very few types","useful":0,"cool":0},"o-7AnwBJUek2xB5bgUBSpA":{"text":"I love this place! Their marinated korean short ribs are amazing! I can honestly say I am ","useful":0,"cool":2},"BmgCn1mpCvkpbbNxSqqDLQ":{"text":"Came here tonight and left immediately. My husband and I came inside the restaurant and st","useful":0,"cool":0},"yjCHBZrYbOVAHiUjzjaZHw":{"text":"How did I not know Korean food was this good before. I've had bits and pieces of Korean fo","useful":9,"cool":7},"ylzTvG09PagvNWEBbxSKOQ":{"text":"We shied away from this place for awhile because the Yelp rating suggested it was mediocre","useful":0,"cool":1},"H1zh_hGCJjsK2ApplgcAaw":{"text":"Read lots of great reviews. Went with a group of friends today. Inside was nice and staff ","useful":1,"cool":0},"BbC5gMnJNAASS5hKIguyIw":{"text":"I eat ALOT of Korean food. For anyone who enjoys authentic Korean food, this is not the pl","useful":0,"cool":0},"u9r-ZJyTWAJLqgYm5svvuQ":{"text":"I am a very frequent customer of Little Korea even when it was over at ex-Taco bell place.","useful":3,"cool":1},"5sIaooLhui6zTHK_ms4NYQ":{"text":"yumm!\nTheir Spicy ox-tail and short ribs were excellent!!\nI would definitely be back!","useful":0,"cool":1},"JK-UkF7rKrnpEMLyJNVK4g":{"text":"It's good. I enjoyed it. Too pricey and thats compared to korean restaurants of higher cal","useful":1,"cool":0},"tN6DxlHCeh5QC9tS-fyNig":{"text":"What an experience! My girlfriend & I's first time eating in an authentic Korean restauran","useful":1,"cool":0},"NexEnGzNsl0v9sn3MECPWg":{"text":"Y-U-M-M-Y!!!!  Such a cute restaurant. Very clean. It's not the all you can eat kbbq we're","useful":2,"cool":1},"pkXUIn0ILfZ0NY823ylYeQ":{"text":"I am not a big fan of yelp because I just don't like people talking like they are KNOW-IT ","useful":0,"cool":0},"xWC7Mo0nzpq0bymhInJBUg":{"text":"My boyfriend and I came by to the restaurant last night and saw that it was crazy packed! ","useful":1,"cool":0},"4qYo2TwG1TaJEhrSoVmcsg":{"text":"I preface this with saying we did not sit at a grill table, so I can not comment on the gr","useful":1,"cool":0},"99ITej65ws0905PUe8SIjg":{"text":"I was very excited to find that there are two Korean restaurants in the NOLA area. Upon re","useful":8,"cool":1},"Lnz8NODhSqkJWR8Bmt3rSA":{"text":"We took the tram from the French Quarter to enjoy some Korean BBQ and were very happy we d","useful":2,"cool":0},"4Qo4SOG9v8vgAuDIR6mBZg":{"text":"Ended up on Claiborne looking for dinner yesterday and saw that the sign had changed from ","useful":5,"cool":3},"9SbD7gfNN5lOVgYlLikEdw":{"text":"Great Korean food! Seem to be out of alcohol most times I show up, which is annoying somet","useful":0,"cool":0},"2WkE3Q0-BbwEFgANykgXMg":{"text":"Prices are outrageous! We love Korean BBQ! Just got back from Houston and was still cravin","useful":0,"cool":0},"gqa57tsxLufWlw14uivu1w":{"text":"I've been here a few times, but had a delicious experience last night.\n\nWe only ordered th","useful":2,"cool":0},"F72AAvO4gDHULroYIMV7Qg":{"text":"Best thing I have eaten in New Orleans. The rice cakes and KFC was E-VE-RY THING. The serv","useful":1,"cool":0},"8UY0yqyk8fizlG6RZTtlyQ":{"text":"Finally New Orleans is getting some diversity. I drove by this restaraunt a few months ago","useful":0,"cool":1},"9dtV2tnh3Nl14b1z7DMSCw":{"text":"Amazingly good Korean food. Everything we ate was crazy good! Bulgogi, bibim bop and side ","useful":0,"cool":2},"F_oPQxyWFwTnU_O7BQzdpg":{"text":"Although the outside of this restaurant looks like a converted and confused taco bell, onc","useful":1,"cool":1},"cAEk5va2KiNlG3z52Au3Mw":{"text":"The interior is pretty nice and clean. This spot is definitely more an Americanized/fusion","useful":0,"cool":0},"DI4-QoOKV7R9A2wBwxbNEQ":{"text":"We went here today. We ordered bulgogi and spicy chicken. It was delicious. The sides were","useful":0,"cool":1},"iPwHPOEV1HnplnplNIYhyw":{"text":"Best meal ever.  My first time here.  You have to practice eating this food.  OMG, it's so","useful":0,"cool":0},"xsSdj60sZjD1O7SHzNkhTQ":{"text":"I spotted this place close to our apartment the last time I was in New Orleans and I knew ","useful":3,"cool":2},"d3DayfYrERDUGpfFA096oA":{"text":"We had the Korea Grill and did not care for the meat. The Pork had so much fat that it sho","useful":0,"cool":0},"A5VG8HekBw5TFpF_vZ_tZQ":{"text":"Food was good. Service was terrible. I definitely enjoyed the food but it was expensive, t","useful":0,"cool":0},"6dpMV_rqb1d2ekpseWGVpw":{"text":"Good food!! Spicy squid and pork souls say very spicy!!! Must try the egg rolls and eat th","useful":0,"cool":0},"UwtLvlLzYIwVuqzoPalJ3g":{"text":"I love this place! My Grandma was from Korea and I grew up eating Korean food all my life.","useful":0,"cool":2},"M-tCubeLk6b_DmqTW2i3sg":{"text":"Ate here in June 2016...\n\nFood was just okay...maybe because it was SO HOT here that it wa","useful":0,"cool":0},"wr2WBmJbu9booaj-qPNQ6g":{"text":"The food was great! Except for the fact that the portions were small and you are paying ov","useful":0,"cool":0},"HtpBdn2Cwo4Mjc_y101DLA":{"text":"I recently tried this place for the first time and I loved it. We sat at the table with th","useful":1,"cool":0},"pWsfB0rx4_GTcxDChQVQJQ":{"text":"We came here and immediately an unwelcoming welcome from the host. Our server Andrew on th","useful":0,"cool":0},"ZSN7tot11R2NNsxxwBTfig":{"text":"This is one of the only Korean places in New Orleans, and the food is solid. I've been her","useful":0,"cool":0},"sy0BYlzIe0tzLkJgjVG_Qw":{"text":"I dont know about bbq but tofu soup tastes really thick and werid. Other dishes not authen","useful":0,"cool":0},"G2z0I1SXIec-JdAN_Tb4mg":{"text":"This place was really good. I do not like metal chopsticks but they get you wooden ones if","useful":4,"cool":1},"CbgP8YMlzMo2YVbINJ5k_Q":{"text":"This place used to be my boyfriend and I favorite Korean restaurant, but now it is our wor","useful":0,"cool":0},"IjKg2pwIih2tSx6BDal3Wg":{"text":"I never went to the old location so all I can review on is new location.  This is my secon","useful":1,"cool":0},"6_eEIvBt_4jS3XlNRj-ddw":{"text":"Very happy that I found a spot with Jajang Myun, my favorite dish that my Korean grandmoth","useful":0,"cool":0},"2hHlugLMl1LP44HFzDqagg":{"text":"I love this place! I live in the neighborhood and was thrilled to see a pho place pop up c","useful":0,"cool":3},"AWvHF8siHkQB5yRB05vg3A":{"text":"Little Korea is the best Korean restaurant in New Orleans, hands down.\n\nOK, so maybe that ","useful":2,"cool":1},"ogqxDQ8Z-Yk5CPdAHyBkbw":{"text":"Good and friendly service. Food was amazing. The spicy oxtail stew was the best thing we h","useful":0,"cool":0},"YUD-RbwKtTTTdQkQxqYDIQ":{"text":"We did the grill, and I am quite disappointed. I didn't like how you can only pick one mea","useful":0,"cool":0},"j7qIG_JddiOmEYJWuir1sA":{"text":"The food was just ehh. I ordered the tofu soup, beef bulgogi, and the spicy Korean rice ca","useful":2,"cool":0},"SO0W1TflSormupaGp5lJ5Q":{"text":"One of the worst Korean restaurants I have ever eaten.  They even don't know why their sou","useful":1,"cool":0},"mnA5LzsBfdUBcJfUyYjmuQ":{"text":"Friendly, patient, and efficient staff. Delicious food, seasoned and cooked to perfection,","useful":1,"cool":1},"4KxqpuJ8A2Ywuak5YOjIwQ":{"text":"I have to say this is one of my favorite Korean BBQ in the area.  The food is amazing.  Re","useful":0,"cool":1},"SgScp5pshrg4WezDwIdrpQ":{"text":"3/5 could be better, but it is what it is.\n\ni came here last week for my birthday, since g","useful":4,"cool":0},"YxjvZFeR0treyaUpr--pXw":{"text":"Food was okay, not the best Korean food that I have had. Place is kind of cluttered and un","useful":1,"cool":0},"0hXRuLMwAsgDnyHSUufBYg":{"text":"I loved this place. Had a talk with the girl who works there and she was pleasant and I fi","useful":0,"cool":0},"uwGi9q4875SYMYHuvDvsKQ":{"text":"We went here for my friend's going away dinner, and when they told me the place was in an ","useful":2,"cool":1},"jkSFJcboG6vC13OM9UM8SA":{"text":"Not as good as Korean House, Far more expensive. The gas grill is all jacked up. \nTables a","useful":0,"cool":0},"iGVNlAAjuPw_J950_hsO7w":{"text":"We gave it another try and this time I didn't get sick. The food was good, and I enjoyed i","useful":0,"cool":0},"eo4AEW-RYdWO6V5f7RoiBg":{"text":"Fatty greasy wonderful!  Short ribs, spicy pork and squid...excellent.","useful":1,"cool":1},"j11dF4vM1LHloKbGfzpFTQ":{"text":"Hidden little gem of a place in New Orleans! Ban Chan is outstanding! Eating that along yo","useful":0,"cool":0},"cK077qHlLmBrP4CB2UL3jg":{"text":"We had a great experience at LKBBQ from the moment we walked in! The hostess was very frie","useful":2,"cool":1},"Or17FBCNX4ZMjhXOMqtTXA":{"text":"I have to say that I'm wildly disappointed in this new location. I really hoped it would b","useful":0,"cool":0},"QVFGpi1_fW0Inu-7MRY1Qw":{"text":"I love Korean food and this fits the bill. It took me ages to get here, I'm sorry I waited","useful":0,"cool":2},"oCkpZKQF4zUeQa7HJV3OIg":{"text":"Went here for the first time with a friend and we had a great experience. Great food, grea","useful":0,"cool":0},"cVv0NFlryyfRd-RhHhwZ7w":{"text":"This was our first foray into Korean food.  Little Korea really delivered with excellent f","useful":1,"cool":0},"d5GcIPl-cqsWJ-zyOXwp-Q":{"text":"Pleasantly surprised by this little joint.  Friendly, helpful waiters and yummier than exp","useful":0,"cool":1},"mTpphRLPVNPPusIrR3RWgg":{"text":"First impressions are everything. Most of the time. \n\nI asked people in my social networks","useful":18,"cool":7},"wYBl9YQeNkpnUScsd0bTQw":{"text":"I was hoping this place would have affordable lunch options, I ended up spending just unde","useful":1,"cool":0},"ma-Pp-eI5YRh4f5VYLQn_Q":{"text":"I give it a 2 star just because the soju went down good. Whenever I go on business trips I","useful":0,"cool":0},"c8T6nOU31VP_A7hHhKi9kA":{"text":"Oohhhhh Yes! \nThe food and the service was absolutely amazing.\nTo be honest, I didn't want","useful":2,"cool":2},"J-Nn4K-_1jB-EW93RvDbgA":{"text":"For a Korean restaurant in New Orleans, I would definitely recommend friends to eat here, ","useful":0,"cool":1},"zrH2fzUq6CJWL2ARsw9pfg":{"text":"Excellent food and service. The owner is super friendly as is the staff. But the food is t","useful":0,"cool":1},"swtO-ZF0XI0AD66khs8PhA":{"text":"Loved this place! Thought the meat servings could have been larger for the money paid. But","useful":0,"cool":0},"VfzMVfEbDzYvB3GAvV-eRg":{"text":"This was really good Korean food.  Nothing about the interior felt authentic (yes I lived ","useful":0,"cool":0},"PPrT9Vp7tE4cyBOW87N3lg":{"text":"My first time here was amazing!!!  Staff was quick,helpful, and friendly. Everything was a","useful":1,"cool":1},"E8Sn2JOAyWnRLuleNlv65A":{"text":"Was looking for Korean place in new Orleans mid city area. Stumbled on this place. It was ","useful":1,"cool":0},"_E6m15TlpkDqBhyh58eD1Q":{"text":"Saw this place a couple times when driving on Claiborne. The first time, a friend in the c","useful":4,"cool":3},"TXNUZDm6RvE2U641w5G7hg":{"text":"If you want an authentic and unique meal, this is the place to go. The aesthetic of the pl","useful":1,"cool":0},"39b6Q-5fRt8Qd7V-HqltaQ":{"text":"The spicy beef and vegetable soup was amazing. My friend had the bulgogi bibimbap and it w","useful":0,"cool":0},"lgAcs5RYTyN-wPv7JRLHiQ":{"text":"This was our first time eating Korean food. Everything was delicious. We will be back agai","useful":0,"cool":0},"Ih0_eb5cp4y-FSGdfob32Q":{"text":"This place does NOT have an all you can eat option, as opposed to other KBBQ joints in Cal","useful":0,"cool":0},"120iXgxbRzu6WU7WG5BPog":{"text":"So happy this place exists. I will still drive to Lafayette to get some of my mom's leftov","useful":2,"cool":1},"5mky6tAJjbImXhYEqorsbA":{"text":"I was told Little Korea has the best Korean food in the area. Little Korea has a very simp","useful":3,"cool":1},"IGdiTwJCZYz9nBmf3uiFyQ":{"text":"I am pretty picky about my Korean food, but I thought this was pretty good, especially giv","useful":0,"cool":0},"Q6Hx9SbYiWmpT7MBlvtHHg":{"text":"If you want delicious food and great service, Little Korea BBQ is a must-try for all of my","useful":2,"cool":0},"9w4Cj8TxvwiOuuBXo_vVkQ":{"text":"Came here again last night with bf's fam for a family dinner. The hostess wasn't as friend","useful":1,"cool":0},"XrKdlb509xDA3i_olEGK_g":{"text":"Don't let the old Taco Bell exterior fool you--this place is great! Went for Friday lunch ","useful":0,"cool":2},"MtkwTLr7y5nUt0Brtn-JyA":{"text":"Visited here from Seattle. Seattle has a bustling Korean community and has ample Korean re","useful":0,"cool":0},"mPx-Bc7PQnzA8GhbByeyOw":{"text":"Delicious spicy ramen soup\nFresh and made to order! Spiciness is just right.\nI definitely ","useful":0,"cool":0},"DM-1J9d2II-3bBkGHFRW7w":{"text":"All the food was delicious and flavorful. Ox tail stew, seafood pancake, galbi, spicy pork","useful":0,"cool":0},"JGUQzxHvRj8eYEx3RKx3FQ":{"text":"This place is crazy good . Ordered a ton of food and it was all amazing . Get the wings fo","useful":0,"cool":0},"DsA_hwH_iBaP8T3RNiVAfA":{"text":"Staff and atmosphere are very inviting. Menu is simple and has an explanation of what ever","useful":0,"cool":0},"_Y0kNwhor2QKRJpbOxOn4Q":{"text":"Mediocre food. Even charged me 3 dollars for 4 pieces of soggy leaves without even telling","useful":0,"cool":0},"uobsXgV9KY7JVlpjNzFwVg":{"text":"I walked in all excited because I'm like so many, I've been dying for a new Korean place t","useful":15,"cool":2},"6NyBqjBa1rHBofzMqTA_8Q":{"text":"Quick heads up-- this location is closed. They're reopening on Magazine St. in a few weeks","useful":2,"cool":0},"CKS_Jk1eaXrgIPj0iSWr8w":{"text":"This restaurant is everything great... Foods with great services are always making me feel","useful":0,"cool":0},"Yu5nZYbHKE6cHW5CiBPzNg":{"text":"Ahhhhhhhhh. I came here for my birthday and was a bit disappointed.\n\nFirst off, I love the","useful":1,"cool":0},"24NLFzM2URKn8prs9G66Yg":{"text":"Delish! After walking on Magazine St in the heat, we were starving! We didn't think we ord","useful":1,"cool":0},"XQKhAWJkqm1tttaikbNsLQ":{"text":"This was our first time ever eating Korean BBQ and it did not disappoint! Our waitress was","useful":1,"cool":0},"q4ThcV13TBoNeH6I5xYUJg":{"text":"Delicious! This place should have at least 4 stars that's the only reason I'm reviewing. I","useful":0,"cool":0},"hdKSzKcrc3_S0dwOoCiUrg":{"text":"The food here was excellent. Small location so I thought the ambiance was good.\n\nThe only ","useful":0,"cool":0},"N-kNcFPRxgRV7phMkye1vg":{"text":"I'm a recent transplant to New Orleans and while the food in this city is fantastic the Ko","useful":7,"cool":4},"b5_49zFDdqZ6uO8KFCvXsA":{"text":"The staff was pretty nice, but I asked for something vegan and the pointed me to some real","useful":0,"cool":0},"ZTf6Jux_HfY0G2-a1od1Hw":{"text":"I SO wanted to love this place, since I miss Korean food so much; I guess New Orleans real","useful":7,"cool":2},"1-oWgv8VQ0t5Kg_Pr-z-sA":{"text":"A cute new little place on Magazine. Tried it out after hearing how good it is at their pr","useful":0,"cool":0},"F6S2pMPFE5dRe5kau8ZXXA":{"text":"Great service and great food. Banchan and menu selection were on the small side compared t","useful":0,"cool":0},"1DR2WqA5tLjalvncWs8Tkg":{"text":"Don't let the outside scare you. I think the building was once a Taco Bell, so it has that","useful":1,"cool":1},"d_wkgc4Vwb5xjWuwveWoIQ":{"text":"Called in a reservation for a grill table hours in advance of the scheduled time for a lar","useful":0,"cool":0},"lj0QLujXm2bgtqqG6ughWw":{"text":"A very good Korean restaurant with wonderful food. Acceptebal price and excellent service.","useful":0,"cool":1},"45s1ukWUs7SjyAjbjIqfaA":{"text":"We live so close and walk past many nights thinking about how amazing this place smells...","useful":0,"cool":0},"ji6UmpRYJZ5f3C28ZBdTpQ":{"text":"Visiting with friends and found this gem- away from the tourist traps of the French quarte","useful":1,"cool":0},"2KuQiD9VtuLroPkPTHi3_Q":{"text":"Me and the DPIC came here last night, as we've been craving Korean, but Korea House makes ","useful":5,"cool":1},"SZc1zgN-J3LdSxvCCqbCKw":{"text":"Wonderful Korean food. The kimchi was delicious, as was the spare rib stone bowl. Very rea","useful":0,"cool":0},"g1PR8HCB_E2sWzAXxOVmsg":{"text":"Really good food and service. I like bulgogi or spicy pork.","useful":0,"cool":1},"ecKQOdvRCLi6IVwqgtUk-Q":{"text":"Probably the most authentic Korean food in New Orleans. However, since they really don't h","useful":0,"cool":0},"8niI54bAQBy77VULa3a6Pw":{"text":"Been here twice and love it so far. There oxtail stew and korean ribs are delis. Must try ","useful":1,"cool":2},"dSQx52MMUZseXhzQ3TZWgQ":{"text":"Unfortunately since last time I visited, they have stopped serving pho permanently. Althou","useful":1,"cool":0},"WXTltjH-IqveS9QXw1i45w":{"text":"I'm half-Korean (mother) and have lived in Korea for short time. Also been to many Korean ","useful":10,"cool":1},"4MFLGuPLfRkiWA-94cOyVg":{"text":"1. The appetizer came out way after the main dish. I ordered to grill meat.\n2. For tableto","useful":0,"cool":0},"zfCZuX0CeiieoDFVw_S8Uw":{"text":"*UPDATE FOR NEW LOCATION*\n\nFirst off, the new location is so pretty, especially compared t","useful":5,"cool":0},"56kvn819qCaudqMCAas6FA":{"text":"I have eaten here three times, all at lunchtime.  The first two times I ordered box lunch,","useful":1,"cool":0},"dDNy9UirTedzaTL1128FOw":{"text":"I love this restaurant. The spicy pork dish with gochujang sauce on the side is one of the","useful":0,"cool":0},"6huOUheHI3gSHLScjmpIaA":{"text":"Before they moved to the new location, Little Korea was a fine place with decent food. But","useful":1,"cool":0},"A8-g0Wbb7fhCnx1vb4QvZQ":{"text":"Was thrilled to see this open and am glad to see it has stuck around despite a low awarene","useful":0,"cool":0},"K-XdO3mJpGbYpvsik5LTOw":{"text":"This is one of the few places where you can get authentic Korean Food. Don't let the Once ","useful":0,"cool":0},"sGhAKSqLm-pCi9M_Zv7pFQ":{"text":"Smoked Salmon BiBimBap, Garlic Pork Belly, and Thinly Sliced Briskets are amazing! Definit","useful":1,"cool":1},"5souJzyPZTJDPgX9KD2D0A":{"text":"This was a nice modern Korean restaurant. The drinks tasted great & the food as well. The ","useful":0,"cool":0},"FhaLptDRvtcV8YvtpZ2cyg":{"text":"I like Little Korea (LK).  I get their Pho often.  But what I really love are their sides.","useful":0,"cool":0},"Ut-RoL9u8AbntSDw0DEf0Q":{"text":"Love this place. Don't be scared off by its odd location and refurbished taco-bell buildin","useful":3,"cool":1},"xclkM9gPmwxCVZoFugDhdw":{"text":"Don't be fooled by the cheap, fast food exterior- this place is great. Almost no atmospher","useful":0,"cool":0},"mg7CwARIqruvctjLqr1xmg":{"text":"The pork belly is amazing. Well seasoned and affordable. Usually Korean bbq is super expen","useful":0,"cool":0},"UuG6MFCT3_D3o788TdNxlw":{"text":"The place is small but it always smells good. The area has a very modern vibe to it. The m","useful":0,"cool":0},"kGS_xy1IijLqh0DuILGKwQ":{"text":"BLUF:  Not going to pretend to know much about Korean food but I definitely liked this pla","useful":2,"cool":1},"PK0A5fxHf4j_c5Uns5Y8DQ":{"text":"An ultimately pleasant train-wreck.\n\nWe were fans of the Claiborne location and couldn't w","useful":5,"cool":2},"MiwLNbTbvzz7yPE-bcs8zQ":{"text":"I know very little about Korean food, but I popped in for lunch here and had a spectacular","useful":2,"cool":2},"cCqiU2Hkl2HVIsf8bvs6Lg":{"text":"Went back to Little Korea the other day. It must have been like 4 months since the last ti","useful":4,"cool":1},"bdTxLtkWK2v0jvI1-vqSaQ":{"text":"Love the food! Bbq was amazing! Only shy of five stars due to the freshness of my side dis","useful":0,"cool":0},"_qlfRLt6NAcL2krtuNhwGg":{"text":"Nothing horrible about this restaurant. But I think it's very much over priced and the foo","useful":0,"cool":0},"eXI3o_ZpoYGdp-4cFRI4eQ":{"text":"I consider this place my favorite! The bulgogi and yook gae jang taste soooo delicious.. I","useful":1,"cool":1},"DAohe-utzLZ_IBi7Jpjepg":{"text":"i love it here. if you want to grill (which i recommend) come with a group. you can try mo","useful":2,"cool":0},"YWSmhTywiIpkQ69rz2eGyw":{"text":"I can't believe I waited so long to try this place..1 mile away vs. fighting the Metairie ","useful":2,"cool":2},"Qp79aDY0oXLOUKL3m9WzRA":{"text":"The food was okay and they do not have much room. I went in with a party of 9 and was told","useful":0,"cool":0},"al7BWJvIA5DT92X5obhOHg":{"text":"This place is great! The banchan (small appetizer dishes) seem to rotate in and out, but k","useful":3,"cool":4},"g_7Y5pGkx3XwqkXiZD846w":{"text":"Thank you, Arthur, for your amazing service.  You were so welcoming from the moment we ope","useful":0,"cool":0},"qcsmBGwbRGTa9H9BGlgMnA":{"text":"Really love the food and like the new location . Wish they would bring back their spivey c","useful":0,"cool":0},"YHBs7MycAGyNYGmwlYH70A":{"text":"Came here for lunch during a hot day on the dock, excellent food and service.","useful":0,"cool":0},"bZFBaFHbVR_anm3wqBxnig":{"text":"Nice to finally have a Korean BBQ in Nola. The prices are pretty pricey for what they give","useful":1,"cool":0},"y3i68CCGbx5EPDDvEkhbIw":{"text":"Got the very expensive BBQ, which is guarantee to be $50 because you have to get two type ","useful":0,"cool":0},"f9w2je2VQV97uOE5__U52g":{"text":"Absolutely the worst Korean BBQ I've ever had, in more than 25 years of eating Korean BBQ ","useful":1,"cool":0},"chBZ7oeWYBg56EZVPou-pg":{"text":"If I could, this rating would be a 3.5. I'd come back because it's close to my house and w","useful":0,"cool":0},"LLmT9vGiCK9UeaKS0yRnWQ":{"text":"We've been twice, and it's not bad. We liked the food at the old location, but it was out ","useful":0,"cool":0},"lUadzrWsH-5qyl7cZiUXUw":{"text":"HOLY CRAP!!! \n\nWas in New Orleans for Mardi Gras and craving for comfort Korean food... we","useful":0,"cool":0},"URfqmND84Xgrjmj3Xptz-A":{"text":"Spicey spicey spicey. Moderately priced a variety of flavors and foods to try in one shot.","useful":0,"cool":0},"VN_X4UkUjTgSyYclckiI7Q":{"text":"So this place would be rated 4 stars if their guest service warranted it. But it doesn't. ","useful":0,"cool":0},"5tBwXt8iyfN3LdI3vmpj8Q":{"text":"I've been here twice and thoroughly enjoyed both trips. Be prepared to wash your clothes w","useful":0,"cool":0},"1FW1itXRLrhXJN6PlQ-WPw":{"text":"Ate KFC wings. Juicy and spicy at the same time. Guzzling it down with some leprechaun lem","useful":0,"cool":0},"7y0iChdOPxyyifMOxXshFg":{"text":"I've been dying to try Little Korea since they've opened up their new location on Magazine","useful":2,"cool":2},"vprtJW4ZkuNwk0-ipbPKug":{"text":"I write this as a neophyte to Korean Food. Back in the day I used to go to Ghengis Khan on","useful":1,"cool":3},"g5q7n5tiVvD-Lhogy4gAJQ":{"text":"What a fantastic gem hiding in plain sight on Claiborne Avenue!\n\nI had trouble deciding wh","useful":5,"cool":2},"NXyMZYdq17UaKI1EVKyZmw":{"text":"Good food, good service. Terrible small cramped tables ruin the entire experience. When yo","useful":0,"cool":0},"Ig0orZD1bVQGWRfAdbYMlg":{"text":"This place is great. Fresh ingredients, terrific flavor. I'm hooked on the vegetable dumpl","useful":0,"cool":0},"gkNIzaouxJePvQVK6bOU5w":{"text":"Little Korea offers traditional korean meals, and also has a variety of other asian appeti","useful":7,"cool":4},"1hLmXDAy78CqPs4vfklNcw":{"text":"Was our first time trying Korean BBQ and we opted for the grill so we could have the exper","useful":2,"cool":1},"RnVneDPY1dvg_SepIzHFVg":{"text":"Great experience! Friendly staff and great food = a nice little food getaway! Definitely r","useful":0,"cool":0},"K6rfNhtAsJq8HPi1K3VJ7g":{"text":"Even in my out of state travels I get a craving for Korean bbq...little did I know there w","useful":3,"cool":0},"ZyeA4l6btppIeP_ZPBQySA":{"text":"Don't judge a book by it's cover! Or umm, I mean a restaurant by the fact that it used to ","useful":4,"cool":2},"YmQBG6Rxf88ZQZ161yI10g":{"text":"I stopped in here for the first time this past Wednesday.  It was pretty crowded when I ar","useful":4,"cool":2},"As9DjJ_-W9r0AwoCRQmbHg":{"text":"Had a lovely meal last night at LKBBQ! I love the changes on the new menu and its great th","useful":2,"cool":0},"mosRPqF_2EEC4lg2C9tXkw":{"text":"It is my first time writing on \"Yelp.\" \nI am so excited!!\nI am a Korean and I recently mov","useful":5,"cool":1},"CrtqOHGujR8G3-L-0y-8og":{"text":"I've been to this establishment many of times and never wrote a review. Their old location","useful":1,"cool":2},"aUcc5UMWRXCbkdIhauT4dA":{"text":"I like being told what to eat.  My original order of dol sat bibimbop was overruled by wha","useful":7,"cool":5},"9ukbIjjuMB7xC_c9NYLMig":{"text":"Overpriced street food served in a manner just pretentious enough to fool you into thinkin","useful":0,"cool":0},"7GHTm2F_y3X8WWIlVrpH3Q":{"text":"OK...I was in the neighborhood today and wanted nothing that involved a drive-though...\n\nT","useful":4,"cool":4},"1SO5Z66J4oAwC4WoGtBtLw":{"text":"Nice place for Korean bbq in New Orleans. They have ordinary table and bbq table. Hubby an","useful":0,"cool":0},"KsTbXxk7miGlys_QmLtZdw":{"text":"Everything was so good. Will be back soon. The  JUMULLUCK was outstanding. Kimchee dumplin","useful":0,"cool":0},"gOpm9PZiN5Ek_qPNr3rn4Q":{"text":"Who knew? The location and name don't exactly scream, \"authentic,\" but as soon as I walked","useful":7,"cool":4},"1zxMEWcnKn_kivMMnQ7CHw":{"text":"Was looking for Korean bbq as we were visiting from out of state. Really friendly waiter a","useful":0,"cool":0},"K9Id4_iNCI5d-1TnY8RLRA":{"text":"The little plates they give you as kind of like an amuse bouche are delicious! I was unfam","useful":3,"cool":1},"Yfxl5ViPmpu8pCdyhelC9Q":{"text":"Our first visit !\n\nWe were getting hungry, drove-by, saw the new sign, \"made the block\", &","useful":2,"cool":2},"OOy-F-HOnGxDFUr-dxiLjQ":{"text":"Add the tip to the total number，Did not tell me，And it is 20% tip。Do you think we have no ","useful":0,"cool":0},"Kois4QbSA9YWm5NLcd4Org":{"text":"Stopped by this restaurant on our last day in NOLA. We were craving veggies and Asian cuis","useful":0,"cool":0},"7rKeaEeXogZcr2Mef6jsFg":{"text":"This is my new favorite place/food. I've always heard that Korean bbq is amazing and I'm s","useful":0,"cool":1},"DdEBYPco8lcnIqcTNehOUw":{"text":"This place was decent. Some of the food tasted good. But some other things didn't taste al","useful":1,"cool":0},"QpUPA5KQYYs3JTR0tBiXig":{"text":"This location offers the best experience if you want to grill the meat yourself. Staff wil","useful":0,"cool":0},"f7TqmQ-kFKE0d9lx4cyazg":{"text":"Dining in has to be the way to go, because my takeout was less than stellar. I had the bla","useful":3,"cool":0},"1SVWPnJhA6yqgovOYBKeLA":{"text":"AWESOME Korean BBQ!  Love the layout and the ability to cook your own... they also have a ","useful":3,"cool":2},"Z4PoX7Hgxso0YgdxhKyhyQ":{"text":"It was my first time having Korean food and it was a great experience.  I want to caution ","useful":0,"cool":0},"QJihYwA1nL80ZrewGD6Keg":{"text":"Meh. It was all just so mediocre. My chicken was soggy all of my sides were ice cold, not ","useful":0,"cool":0},"UmOg7MkmvKqQXtpGuhdY4Q":{"text":"I almost don't want to review this place because it's so amazing and I really don't want t","useful":7,"cool":4},"ddCZcF0xm2xdiZQPenp6pg":{"text":"Great place on magazine to eat!   You can cook or it can come already cooked for you.   Ei","useful":1,"cool":0},"TzafSjUzTLSRgFFHBJsXag":{"text":"Im so glad I tried this place out, it's very cute and sorta small but clean.  They have a ","useful":1,"cool":0},"zrq7l-opsUjliMJ-WmNLmw":{"text":"Came here as a last minute choice and it was pretty good ! Bulgogi was good as always, mea","useful":0,"cool":1},"ftKfjRD6k2tp9OC1jD00fA":{"text":"Great Korean place. The only one as far as I am aware. We have ordered take out and dine i","useful":0,"cool":0},"nqoNafl0Vlpdqu_Pe6yF3Q":{"text":"I love this place. Great, authentic Korean food. Soju. Korean TV on the big screen. Who co","useful":2,"cool":2},"wBsGV9QHcDuxx33a0gezOA":{"text":"Little Korea is one of the best places EVER to visit with a group of friends! Our server D","useful":2,"cool":1},"xDQnbsWQvRvizmazEOZgeg":{"text":"Grade: A\n\nStumbled onto this place. I am live in San Francisco where Korean food is consid","useful":2,"cool":0},"HyNLqMA06rKv7GmRCQuM_A":{"text":"Ok I have to preface my review in saying I lived in NY and Los Angeles and have been to KO","useful":0,"cool":0},"zSFcFGKE8hwpNIxfXx3T1A":{"text":"This was my third try at sampling Korean cuisine and it was as disastrous as my two previo","useful":1,"cool":1},"5IrVRwZHMdw587L8Lhzh9w":{"text":"Very, very good! Such a gem to find on this stretch of Claiborne Ave. Don't be put off by ","useful":0,"cool":2},"Fxud-ap9Vcufv4ix4-gdxA":{"text":"Don't get me wrong, the food was really pretty, the presentation was nice, but unfortunate","useful":4,"cool":3},"L7nUmQYwwUiz6W-6yir2kw":{"text":"This place is AWESOME!\nLittle Korea definately deserves a 5-star because of the amazing se","useful":3,"cool":0},"4tjVztZwdvDZutx6t3iq8w":{"text":"I have been wanting to try this place for a couple years! I always see it, but have never ","useful":1,"cool":1},"cIE0-qXXV24CdcKb11afCw":{"text":"Finally get to try this place out, we ordered the spicy cheesy baby back ribs, honey garli","useful":0,"cool":1},"1gV7dlAAsGhKz8AyjdPkig":{"text":"This place was good I guess. Good price what what it is. The place is nice too. I would to","useful":0,"cool":0},"B9ZnSAqyr0FKVxZFKtY1kg":{"text":"We ordered food for take-out. We were a little thrown off by the drive-thru since it wasn'","useful":2,"cool":1},"f9WkTV-BpG2G7x57VqZF4A":{"text":"I came here for dinner on a Friday night with my husband and the restaurant was quite empt","useful":2,"cool":1},"t8G9EdInctiT--iQgPmZ4A":{"text":"This is one of the worst Korean restaurants I've been to in the southern Tri-state regions","useful":0,"cool":0},"92olmF3oWcVfqOoIgXLTHw":{"text":"I picked this spot on a warm March Saturday afternoon because it smelled good and was rela","useful":0,"cool":1},"ebvZ5kPfqI6k8tWFYvMMrg":{"text":"This is the best Korean bbq I've tried so far in the south! Amazing food, the waiter was t","useful":0,"cool":1},"DjZlOPgjDhFF8nj1LZpZJA":{"text":"Best we had in a while. Amateurs on the grill but we nailed it. Enjoyed the servers enthus","useful":0,"cool":0},"nWOjJBLR5cxHmArhe3wg4w":{"text":"This is one of my favorite new orleans restaurants. The menu doesn't tell you a lot, but e","useful":3,"cool":1},"G92SPd0bKPWYIZ5xMpFKLw":{"text":"Had a fabulous time here with my friend before heading to a show. The place was filling up","useful":1,"cool":1},"dJSzxO3rJ0Y3gSVaNM7XvA":{"text":"Great experience! So happy they opened up on magazine. Great decor inside the restaurant. ","useful":0,"cool":1},"fX0k32vndv6PeMquuzgyIQ":{"text":"[Overall - 9.5/10] If you want Korean food in NOLA (New Orleans, LA), go here. \n\n---------","useful":1,"cool":0},"JFRtoiggbbuMMb3qlCkedQ":{"text":"I was really, really hoping that this place would be good so I wouldn't have to face the w","useful":5,"cool":3},"ChMkpyFdPh2rEkJW_S9fBA":{"text":"It's Korean BBQ....who wouldn't love that?!?! This restaurant is very cute looking and wel","useful":1,"cool":0},"zx0xCk5iY-blE2UMS0-FIw":{"text":"Really nice, casual eatery with terrific BBQ.  The Korean Fried Chicken wings are quite ta","useful":0,"cool":1},"hxzet3x1Q_OkuZESESinDw":{"text":"My Korean friend and I enjoyed Little Korea tonight, and he relates, \"my stomach is saying","useful":1,"cool":2},"cYiQAyAvReHfhFY8b75h3w":{"text":"Love the food. However, I miss the drinks they used to have when they were on the S Claibo","useful":1,"cool":0},"doBfZ4fm1gs-OgsA_6rfvQ":{"text":"Not as good as it was when it was on Claiborne. Service is not always that great either. \n","useful":3,"cool":0},"fu9lu8mZrx8_aPJRc22SsQ":{"text":"We visited this place last night because we were craving a familiar taste (we're in town f","useful":0,"cool":0},"LKm4nxG9awXTBR40aDXSfQ":{"text":"OMG HAD SAM walked us threw our lunch it was amazing. I'll be back with family and friends","useful":0,"cool":0},"Y7KnIU31AKSjjJSV_zLjMQ":{"text":"This place is sooo good.  Love to visit NOLA and  Have local food. But this is one of my f","useful":0,"cool":1},"k94_YcKccT05Fzl0YrMaTw":{"text":"I eat Korean food 4-7 times per week. Amazing place that is easy to miss but worth going o","useful":0,"cool":1},"Q_2fI1EZUP_1Wy-zndJuRQ":{"text":"As a first time visitor to New Orleans and an ethnic Korean, was not expecting to eat Kore","useful":0,"cool":0},"54m_hGz3_m4D-ovhzcjVzQ":{"text":"Original Little Korea was amazing with authentic food . Little Korea BBQ , not as great . ","useful":0,"cool":2},"rNzzaMm9yPAgdZebGDenSA":{"text":"My wife lived in Korea and we lived in Hawaii where Korean restaraunts abound! I've even g","useful":2,"cool":1},"CAcoXuX7qk5S6Jxw1Yby9w":{"text":"As a korean i can truly write a fair review about this joint.   This was our second time d","useful":2,"cool":1},"30nBQMWfaOlsPL9CkWgBSw":{"text":"If I could give more stars to this restaurant I would. Top notch food and great service. W","useful":0,"cool":0},"Lk5jFzHPTaQnV-cGylGL1g":{"text":"Very excited to have another Korean option in town.  Went on a weekend night and found it ","useful":0,"cool":1},"cf6MgInP122c_TJ09dQ3Bg":{"text":"The environment is very tolerate and the waiters are very nice and friendly. They seated u","useful":1,"cool":0},"pVEwaNKmfQ8jXyUeosx5pQ":{"text":"DELICIOUS! \n\nThe food is really good. \nLove their Kimchi Soup and Yook Gae Jang.\nHeard the","useful":2,"cool":1},"dVmniK9G7GuumQGoz_Tgmg":{"text":"This place is not good.  The food is for the most part mediocre.  The service is poor but ","useful":2,"cool":1},"vaaLdVtyOwgI67ikcDnIaw":{"text":"tasty food, good portions, and super friendly service! \n\ni had the spicy pork dish (jae yo","useful":0,"cool":1},"iYWwXFQnn39xKukuaroUwQ":{"text":"Nice place, server was very nice... Service was very slow, portions were small for the pri","useful":0,"cool":0},"3OjV5mynJ6H78dAwJN_m9A":{"text":"This place is so bad, the food is old.  The ingredients don't seem to be fresh. The place ","useful":0,"cool":0},"ogQOrj21qQEUF339Va_ZLw":{"text":"The food here is excellent and authentic! It also helps that the staff are warm and friend","useful":1,"cool":0},"nOSp428BwCrs5xs5fi_KMg":{"text":"The food is amazing here! They have a great selection of delicious Korean dishes. Will def","useful":0,"cool":0},"ENcYVH7Kb6e4SRnltZdLkQ":{"text":"First time here and it was DELICIOUS!! Wait staff was friendly and helpful with the menu c","useful":1,"cool":0},"os0YdmbIqYs_J94x1q-2Rw":{"text":"Yay another korean place in new orleans! We need more korean food around here. \nFirst of w","useful":4,"cool":3},"VgkgwWtSrqFRA1qk4ePo-g":{"text":"Little Korea had fantastic service! The new location is really nice inside. It was not too","useful":1,"cool":0},"hBUHnIs3-gC48yuKopAF3w":{"text":"If you blink you might just miss this delicious place. The quality of the food was above m","useful":0,"cool":1},"_1meqUJQHIiAGLzE2TxInQ":{"text":"I've been going to LKBBQ for a few years now and it's time I give them some props on Yelp!","useful":0,"cool":0},"RtVI3pj6HbKwK_vIi-UU6A":{"text":"Although I am a Chinese, but I have been a lot of Korean restaurant. I would like to say t","useful":7,"cool":1},"Kdz5iqeQPS4swIHmkjW4IA":{"text":"The service was amazing. The food was above and beyond. Need to come back for the house me","useful":1,"cool":2},"eZknyvoU4dvKXXmywvlAfg":{"text":"Horrible food!!!\n\nThey use instant ramen for the spicy ramen and charge $7, rip off and li","useful":0,"cool":0},"R5vgXv6KH589Ev5lDUTp6Q":{"text":"The food was fantastic. Great kimchi and the spicy bulgolgi and chicken were so good! Grea","useful":0,"cool":1},"ykug-Y-mQN2RYw-fsO2hgQ":{"text":"We went this past Saturday night. My boyfriend was craving Korean BBQ so we chose Little K","useful":0,"cool":0},"mm0iXdoZRlY93WUFoodCug":{"text":"First time having Korean BBQ and it was delicious. It was a friendly environment and the w","useful":0,"cool":1},"eD12OWibN9MPFQaIyK6VRw":{"text":"Other Yelpers have already written lots of details so here's the quick rundown from a Kore","useful":2,"cool":1},"qVtx5-sd1NYo44PTuQ6VlQ":{"text":"I really enjoy how small this place was and the set up of their tables. (In comparison of ","useful":0,"cool":0},"7ccGAZLkDYh3H3IRs8n_WQ":{"text":"If you're all seafood and Cajun'ed out in NOLA I suggest you come here for something diffe","useful":2,"cool":1},"M5aWGKrTypPHVpSnNcNgIw":{"text":"This place has amazing LA Kalbie and Kimchi fried rice with bulgogi.  Perfect for two peop","useful":0,"cool":1},"sGm75X6KAfnUrs5Ge0SWcg":{"text":"It doesn't get any better than this place. If you have the urge for Korean food, after get","useful":0,"cool":0},"hIzDc4wx3Eb9qxS79eOJnQ":{"text":"Absolutely amazing food.  The waiters were very nice and attentive.  The portions are huge","useful":0,"cool":0},"HX0530pcB1cRnh9hvtAmOg":{"text":"This korean bbq joint is the best!!! The owner Joyce is the best!!! She is the most hospit","useful":1,"cool":0},"we0rc66OnH32vcrzdsFVOw":{"text":"Excellent food, but a little disappointed that they changed the meat in the Yook Gae Jang.","useful":0,"cool":0},"L41gPAP6WzJ59_fCtWgx0Q":{"text":"Quick service!\nWonderful freebie appetizer - see pics\nSpicy pork bowl is yummy!!!\nThe vegg","useful":1,"cool":1},"3tOOnaUWHiOjLlOo82rakA":{"text":"Waitress was incredibly rude when we walked in, let out an audible sigh and the. Purposely","useful":0,"cool":0},"HMoUCKsA-Z0XnT6CxLJU2w":{"text":"So finally got around to checking the new location out.  I liked the old location better b","useful":1,"cool":0},"bOdqPhbEthu08ERJodQXeQ":{"text":"I used to live only 4 blocks from Little Korea and would walk past it every night, my mout","useful":1,"cool":2},"XVnXr_yDZou0Rm9uzAlm8w":{"text":"Today was the grand opening of Little Korea BBQ on Magazine St. They definitely have some ","useful":4,"cool":0},"EdYJjuLYo5PAXgnQwnjOmQ":{"text":"Yummy!!! Seafood Pancake, Spicy RiceCake with Add Mozzarella Cheese, Jja Jang Myun, and Ta","useful":0,"cool":0},"E2e8NEa7_VD6xnNjcFgAwg":{"text":"The food and service here is great. Was greeted and seated immediately after entering the ","useful":2,"cool":0},"fZwoy3l2EZenI6FJ3fc-uw":{"text":"Five star goes to the server who gave us bath and body hand sanitizer!! LOL, true homie. \n","useful":0,"cool":0},"XyPb6hgwPGy054Mw7wuNxw":{"text":"Always delicious. Servers are nice. KBS or MBC on the tv. I honestly couldn't ask for anyt","useful":0,"cool":1},"-irpFwL0daNvUxBZba38Ow":{"text":"If you like korean bbq this is a must go. Enjoyed everything. The marinated beef was our f","useful":1,"cool":0},"ncEWaUeMgFHFq3EokeQ7uw":{"text":"Little Korea is great. The food is delicious, the staff is friendly, and the interior is q","useful":1,"cool":1},"9sPrLbZoLoBBqsSimUTb5w":{"text":"This place was so delicious! I will definitely be back when I come back to town. They only","useful":0,"cool":0},"1FRnHxxMKCKF2ueewiCHnQ":{"text":"We were super excited to try Korean BBQ for the first time. We walked in and the hostess a","useful":2,"cool":0},"InPSCnBMlJGPIeOGtYKz2Q":{"text":"I went here for lunch because I love Korean food and was happy to see that there was a new","useful":1,"cool":0},"bs1SdpdvPtzNanqXMw4UXw":{"text":"I have a hard time finding people to go eat K BBQ with me because they know I over order! ","useful":3,"cool":1},"gwIlBj8zZFLb8WI1tT4Rlw":{"text":"New place, great meat with lots of sauce, but a little bit too sweet for us. The side dish","useful":1,"cool":0},"b46aUZCrioso7RmlJyqGyw":{"text":"We passed by this restaurant and decided to try out our first Asian cuisine in New Orleans","useful":1,"cool":0},"2TtI2H2mt8ghXFxW8565gQ":{"text":"Everything was very delicious. My friend Don was the waiter, and he helped us have a good ","useful":2,"cool":0},"EBwRJlY6Uzb7p969EvGl0Q":{"text":"I went here for lunch and ordered bulgogi.  It had good flavor, but I was very disheartene","useful":0,"cool":0},"dyXtBtpe6iqlOAHply2pvg":{"text":"Best lunch I had this trip to New Orleans, got the pick 2 (Kimchi rice and Bulgogi and it ","useful":2,"cool":1},"k3L7KKIODgOqHQIqqjB_LQ":{"text":"So me and my sisters cme here while they helped me on the Yelp Scavenger Hunt. We smelled ","useful":3,"cool":1},"M8EN-arqHAT5ILimXs-aPg":{"text":"We had a great dinner at Little Korea last night.  The bulgogi and garlic pork belly were ","useful":2,"cool":0},"w3K3Fa-XvdMykKLejwqtyw":{"text":"I've always loved this place, but now that I have found their lunch special, I'm their num","useful":0,"cool":0},"ACEySiiyYVKO_nIIFmQkeA":{"text":"Little Korea BBQ, you made my heart go bi-bim-bap! My boyfriend and I had a hankering for ","useful":2,"cool":1},"3nDm7G9Lb1RnA_mAhHrlGA":{"text":"Let me say that maybe i was alittle too excited to find a korean food spot. Easy to find. ","useful":0,"cool":0},"fl-X0aDRQVeSK72h8T9Bcg":{"text":"I was skeptical because of all the bad reviews but to my surprise this place wasn't so bad","useful":5,"cool":1},"YCYyX1v4_v8WjDc9Fis8fw":{"text":"Maybe I am spoiled by the Korean restaurant in California, this is the worst Korean restau","useful":3,"cool":1},"pyxFOLCAc687VOtKhjF6pA":{"text":"This is the best Korean food in NOLA. The building clearly used to be a Taco Bell. The bib","useful":5,"cool":0},"aWQGhGqK1H5eIRRx81Z39A":{"text":"We stumbled across this place when walking up and down Magazine Street. We could smell the","useful":1,"cool":2},"afdxICTkQa11tDfgJeodxA":{"text":"My friend and I stopped here for lunch. The waitress was very friendly. We ordered a bimbi","useful":0,"cool":1},"SoidBq9wE3bzj1ZxgQor5Q":{"text":"Excellent service, daniel was great and the spicy fish soup is amazing. Highly recommend.","useful":0,"cool":0},"KLUhnnqyi0CvAJHc-ybQPA":{"text":"Excellent food & the only Korean restaurant in New Orleans. Slightly pricy but a great exp","useful":0,"cool":0},"eFjynp_DjR8nDMYz4T4rFg":{"text":"expensive food. I ordered the kimchi soup, it's super sour and not spicy when I mentioned ","useful":1,"cool":0},"V01lcIi16sEl5bzJJl29Zg":{"text":"Like many before us, we were tourists burning out of Creole food and were absolutely thril","useful":2,"cool":1},"1K6UIaxK4RLAL3uQIvonXw":{"text":"Excellent spicy bulgogi.  We were recommended the garlic pork belly but I would say it was","useful":5,"cool":2},"9OP3omendQuwB4YPluHiIg":{"text":"So...just a warning to people with sensitive stomachs who have never had kimchi before. It","useful":1,"cool":0},"R1KYs9wARLQ8l8MiOdnqeQ":{"text":"First time at little Korea in Nola the staff is very friendly and the food is very delicio","useful":1,"cool":1},"rAOHKf06l4Ti5mLMoFOYzg":{"text":"Everything we ordered was amazing, and we got to cook it ourselves! We split some soju and","useful":2,"cool":1},"j8-cR2nGUPhJdjU84YyC7g":{"text":"Stumbled into this place on a Saturday early evening visit.  I was surprised by my visit. ","useful":2,"cool":0},"YHKOikf0ASo2U1fSjxTTTw":{"text":"This is the most authentic Korean food you can get within the New Orleans city limits.  It","useful":0,"cool":0},"IXUB_6F3Rp8RSjSQxm2-GA":{"text":"Out of the two Korean restaurants in town, Little Korea definitely wins. The bibimbap is d","useful":0,"cool":0},"ICFHCfeGq5V0yau78fhP2Q":{"text":"Little Korea is my first Korean BBQ in New Orleans and I won't need to explore elsewhere. ","useful":1,"cool":0},"VqfKRo-RGKCv7UzHEzBQ1A":{"text":"This was our first time to a Korean BBQ, and it didn't disappoint! The server was great, s","useful":1,"cool":0},"jwq4wTYYUMazeg4naz_mvA":{"text":"It has been quite a while since I have eaten here. The last time was pre-Covid. The menu h","useful":1,"cool":1},"LlP0hfFEU1JnTNspCzsl-w":{"text":"I'm gonna cut to the chase here. The food was good. I thought it was cute how they were pl","useful":4,"cool":1},"Y-MclYpk8lXgAZhBEU3o0g":{"text":"Stopped in for a quick lunch. This isn't an all you can eat place but you can order by 1/2","useful":2,"cool":0},"x0QTiHiVDkVzE5rZDMx-Zg":{"text":"The kimchi fried rice with cheese is seriously one of the best things I've ever eaten. It ","useful":0,"cool":0},"ceLIvtHVvuIZI6AJte9rgA":{"text":"Great Great Great!!! The food is amazing. The service is amazing. The K-Pop Spotify playli","useful":0,"cool":0},"gIyL37dtNDh1Oh30c3aDHA":{"text":"I enjoyed the meal and the service. I am giving it a 4 because of the exhaust coming in my","useful":1,"cool":0},"1ZUSpU-UuVqgZ41z-2ilwg":{"text":"Me and my girls are from NYC visiting, and stumbled upon this place while shopping on maga","useful":1,"cool":0},"lh0SNoOfhax8BvvX_NdNEQ":{"text":"There is no other competition in town for Korean bbq where you cook it yourself. At least.","useful":0,"cool":0},"YEjVJ9nl9D9pFW-zOA1XwA":{"text":"Count me as a fan of this place.  \n\nOne of the things that living in DC spoiled me with wa","useful":5,"cool":1},"mJTd3pqx7CxdnppwF89ERw":{"text":"Amazing! Never disappointed and the service is so amazing. You can try anything on the men","useful":0,"cool":0},"SXKyfbExVCixVMcOyGa4CA":{"text":"BBQ, specially Korean. The expectation is that you are getting plenty to eat, enough that ","useful":8,"cool":0},"cRBkhFt6ghhcBj1Wcrw1YQ":{"text":"Little Korea is a little bit of welcome change for New Orleans. We love our food and tradi","useful":3,"cool":0},"fbpG6DlXc4YL-klQ_ieSpQ":{"text":"Nice find for my kids. They love Korean BBQ and this place hit the spot. I tried practical","useful":1,"cool":2},"ICHQ0BvF2RR0DW349ofiSw":{"text":"Visited this place recently with some friends on our NOLA trip and had an awesome time KBB","useful":0,"cool":0},"07sXYG1Bzw9XWdKTPHLa9Q":{"text":"My family and I ate here when we were in town.  The neighborhood isn't that safe and the r","useful":0,"cool":1},"paP5xmQ7S2kgG2-S3o8AXA":{"text":"The bi bim bop was good, but I was really disappointed in the banchan. Small selection and","useful":0,"cool":0},"grmTh-m6Y7vUYVF1qYtJnw":{"text":"Great Korean in the Lower Garden District. I had the kimchi jjigae which was delicious, ju","useful":0,"cool":0},"bgLCtCyTsIoAi85Xg4UXtA":{"text":"This is my go-to spot for really good Korean food! It is located on magazine street. While","useful":2,"cool":2},"bzoWHtJScVNv-JxgAP1vhg":{"text":"The Corn Cheese dish is divine. I would come here and just eat that. This place is pretty ","useful":4,"cool":0},"SaendSmhKxUJGps-QUc25Q":{"text":"Small chic little place. Foods were good just a bit small. Bbq is mediocre since it's the ","useful":0,"cool":0},"2yQx6t_SqoUenrdKdz3NBw":{"text":"I had such an incredible experience here and the food was amazing. \n\nFirst off, drinks! I ","useful":3,"cool":2},"G0jVbORUMaKC_HAkNOB2Rg":{"text":"Today was the grand opening of Little Korea BBQ on Magazine St. They definitely have some ","useful":4,"cool":0},"8Hmm9nbixaT4v4q0tj-bdA":{"text":"This place is quiet, friendly and nice atmosphere.  The food was not the best Korean food ","useful":0,"cool":0},"oi1wHyfC_VL4CRGu0o7erg":{"text":"Will NEVER return. From the moment we entered, staff was extremely rude to put it kindly. ","useful":0,"cool":0},"Tfo-otiZrerG85dIbCGLIw":{"text":"Worst possible service ever!!! Waiter was very rude due to the fact that the restaurant wa","useful":0,"cool":1},"7XdEGBStALabPXC-RddexQ":{"text":"Let me start off by saying, I love me some Korean BBQ!  I have had a lot of exposure to al","useful":1,"cool":0},"qDh8ediDqsuDfiZiYrTChg":{"text":"Everything was amazing. I had to stop myself from destroying it to take these pictures. I ","useful":0,"cool":0},"0KZSB8bcSkDtMuESf0c7zg":{"text":"After all the reviews on Yelp, I tried out this restaurant when I came down for a show at ","useful":0,"cool":0},"AR5Y0QkyKXVsV16Uzm3qpA":{"text":"Honestly not sure why people are digging this place. I think it must be because there are ","useful":0,"cool":0},"XEoMbEgcKofKyjcwlL-OXw":{"text":"We were originally going to come here for Korean corn dogs, but sadly found out they weren","useful":7,"cool":7},"Z9FKoUDwW7EdCFD9BUIyUw":{"text":"The KFC wings were yugeee (huge). It was whipped with spicy glazed. \n\nThe pork belly was k","useful":2,"cool":1},"4ZL_USkqUkTO5C4tF421vg":{"text":"Awesome little gem uptown inside and out! Love the food and the service. The grill service","useful":0,"cool":1},"eqxcyWgcVk0Pgq4BoRBQCA":{"text":"We were so tired of fried everything and fish so this place was an easy choice. The meat w","useful":0,"cool":1},"5oh9PKy6p46RREY7Ae0eDQ":{"text":"Everything was AMAZING. I tried Kimchi for the first and it was great. I love the experien","useful":0,"cool":1},"9s-hG43QPC-4jE5Zm9iIGQ":{"text":"Yay! Thank you Little Korea for giving me a little taste of home! I have been longing for ","useful":12,"cool":6},"29hlEdHYevQTLGc9Nl0Dew":{"text":"I'm in town visiting NOLA for one week and decided to make this my first place to eat. Bei","useful":0,"cool":1},"RaNcYtmOZqMc01rrp25X7w":{"text":"I'm not usually one for rice dishes, but the Volcano Kimichi Fried rice here is everything","useful":1,"cool":1},"IHFuKZUmtXzv7uk77ghd4A":{"text":"The place has awesome korean food.  For those who haven't eaten much \n at Korean restos, d","useful":3,"cool":1},"PN_R2zxNEoi8T1VWU43njg":{"text":"My family and I went to this restaurant yesterday, and we had a fantastic dining experienc","useful":0,"cool":0},"VKrd1hFvat7vbZGBX9uscw":{"text":"A Korean restaurant might not be your first thought when you think of barbecue, but You sh","useful":2,"cool":1},"iNRdp303_EUdTai1NB2bSA":{"text":"* good food PRICEY bbq *\n\nthe food here is so good! and honestly, if you're coming for kor","useful":1,"cool":0},"qAJuoLz9n1WAPzadn6k3Hg":{"text":"Not the best Korean food I had but at least it's better than Korea house.","useful":1,"cool":0},"rD2OC_wdS7NKF_dz9I1eEA":{"text":"My favorite Korean restaurants in NOLA hand down ! The place is clean, & food is amazing !","useful":0,"cool":0},"doQOj45sDpPcDCYYAXg1Jw":{"text":"I came here for my first Korean BBQ experience and let me tell you- i will go back every t","useful":0,"cool":1},"RKf_uAA-0JBlZZrZRyImEA":{"text":"Paid $15 in cab fare to go eat here from the french quarter.  Pretty good in flavor and if","useful":2,"cool":3},"wD_QOWIOivF_fYUzbNYAFg":{"text":"Have been here a couple times and always enjoyed it, but really felt compelled to write a ","useful":2,"cool":0},"Auj9yJI8lZA_2ppJX0rGwA":{"text":"So good. So so good. We will go back. Their kimchi fried rice volcano style could feed two","useful":0,"cool":0},"15cLdRPWnKZvUVji79AuAA":{"text":"Good Korean food! NOLA does not seem to have the best Korean food experience but Little Ko","useful":2,"cool":2},"33dOW7OA8rrHSfsxSfdWNw":{"text":"Management - if you don't want people to walk past the reception desk, you need to mark th","useful":0,"cool":0},"ZgnHhyN6KJ-u-4BjmmTdmw":{"text":"Wow this is honestly the worst Korean restaurant I've been in United States...\nI would not","useful":2,"cool":0},"J8D5VJEjZSNwqayKEiIcoA":{"text":"Now that I've explored the Nola food scene: over rated and over priced. I will say they le","useful":0,"cool":0},"dkVdGJDl3TNitJgEOrJUHw":{"text":"First off - they moved to magazine st! The old Taco Bell location is no longer there. So t","useful":6,"cool":0},"Uz8K1EVt4U9WRYSGLmX0TA":{"text":"My daughter and I dined there for lunch and I must say I was pleasantly surprised. They ha","useful":0,"cool":0},"DrT5zfkhuAyxVzMdgzut7w":{"text":"This place is good and worth a try! If you have tried Korean BBQ in the past in other area","useful":2,"cool":1},"DAuh95UpgC4I8wJ3BMUeAQ":{"text":"I am so obsessed with Korean food. I really am. Compared to other cities, NOLA does not ha","useful":1,"cool":0},"irq28k97G4Vii9imxwNgbw":{"text":"Great friends took us to lunch today here. Great food! Owner is very sweet and nice. Grill","useful":0,"cool":0},"0aifdgJYq47wszmMR2xYXg":{"text":"While I was out and about for a few days in NOLA I got tired of po'boys and sausages so I ","useful":1,"cool":1},"480RLSSP6nbpFLUTDi6eNg":{"text":"I have such a love for Korean food. My family and I were so excited to discover this resta","useful":0,"cool":0},"C2uTFgrrFEBajzCgaN5zcQ":{"text":"It's been a few years since I've come back here and a lot has changed. So many new dishes ","useful":3,"cool":1},"_Ze2Xfc5LAq1B0fs3IDXTw":{"text":"#yelplove \n\nI stopped by Little Korea for takeout  They had their full menu available for ","useful":2,"cool":1},"4N-5SpZg6JxRFIlNjDt6XQ":{"text":"I really want to like this place because of all the positive reviews but my experience was","useful":0,"cool":0},"Be9oUdW1Qhs3YV7bIP-9Qw":{"text":"As a Korean New Orleanian, born and raised in Seoul until a couple of years ago, I like th","useful":7,"cool":0},"8Y89l4TMr4b4sUTD9NMcpg":{"text":"Came from out of town and my bf and I were craving Korean food so we found this kbbq place","useful":1,"cool":0},"5Ae8Ig_ANI-dmHaq2eiLZw":{"text":"Didn't taste much like traditional korean bbq also the proportions were small for the pric","useful":0,"cool":0},"nYPfkSR7_9To3MFRS8m-Aw":{"text":"Everything we ate was so good. After just a few bites, we knew we'd be coming back. Lookin","useful":0,"cool":1},"ojcO7UDDCPtVogz-yGUqeA":{"text":"I got the beef bulgogi & the beef dumplings ( crispy I love it )  10/10 you won't regret c","useful":0,"cool":0},"Jr-JMdF_Wl5yaktQJlRxqw":{"text":"Oh how I do Love Little Korea.\nThe Fresh Rolls, with the Grilled Shrimp, MAN, such a taste","useful":2,"cool":5},"fZsAkkHBth63RvU_tWYQxg":{"text":"This place was my first taste of Korean food after returning from a visit to South Korea a","useful":0,"cool":1},"EE3FrXmrS4dCgXTK_BnoSQ":{"text":"Everything is pretty good, portion sizes are small. Got the brisket (7/10), pork belly (9/","useful":1,"cool":0},"R1dW-Y44bzf4BW6VwR-04g":{"text":"Th restaurant is very clean and staff is friendly. We got the spicy rice cake and Kimchi d","useful":0,"cool":0},"TXbU25bsf3PtaWHZoivK7w":{"text":"Oh man do i miss Korean BBQ from Koreatown out in Los Angeles, is this on par with one of ","useful":0,"cool":1},"83ZhMzLZDDS2WywUR-syGQ":{"text":"Great food, friendly helpful staff.   A good selection for persons wanting to try somethin","useful":0,"cool":0},"4A6U1kl_TenBWeNWB5CE5g":{"text":"Maybe I'm biased because I went on a really great date here...but the service was excellen","useful":1,"cool":1},"Sg-JuzgmhM9jzXHCGbVorg":{"text":"First time I ever had Korean food, and this place is definitely a 10/10. Our server was at","useful":1,"cool":1},"Buzvojbg2qwsxkAdyPD_Iw":{"text":"We saw lots of good reviews about this restaurant, so we tried it when we had a chance to ","useful":1,"cool":0},"ppKySSlwtYjc9zY6CqHFcQ":{"text":"Great place! The staff is amazing! \nThis was my first Korean BBQ experience so I think it ","useful":1,"cool":2},"bp3sCw8tHwgwKAix60eDmQ":{"text":"Overpriced cheap cuts of meat and limited menu selection. \n\nIf you have ever been to a Kor","useful":5,"cool":0},"B44xxBI58U3pQq0gCFbjEg":{"text":"Favorite Korean BBQ spot. The beef short ribs and oxtail are a must. Oxtails are spicy but","useful":0,"cool":0},"SOVWcEtZWEHC3yNk97MmqQ":{"text":"There was a hair in my food. Just immediately no. Food was good though until I saw the hai","useful":0,"cool":0},"fWS0bn1OBBrx_0e9ANAzQg":{"text":"This place was ok. Small portions were the biggest issue. The food was good, but nothing t","useful":0,"cool":0},"GmvvmRQsBHnxFO1ZunY9Kw":{"text":"Our server was so good. He was so handsome even tho we couldn't see his face Bc of the mas","useful":0,"cool":0},"6La5rGCqgPholf-mv3npBg":{"text":"My girlfriend is Korean. And I have been eating Korean food since 1984.  This is probably ","useful":1,"cool":0},"bvhp1x30KAkeihV0bWHQiA":{"text":"There is just something to be said about being the only place offering Korean BBQ.  They m","useful":1,"cool":1},"qfwGxlJaHS73pFVravUgmg":{"text":"Little Korea BBQ was delicious! Everything that we ordered was hot and sizzling. I just wi","useful":0,"cool":0},"ULOg6wTKRLpvI6pYyLiiZg":{"text":"This place has decent Korean food compared to the other Korean restaurant in Nola. The bib","useful":0,"cool":0},"KOSzwn3sRR6uUMfzxi8XrA":{"text":"Food was mostly good, but they served my vegetarian sister a soup with meat in it after sh","useful":0,"cool":0},"hqu7JYp7-tqgYAPRfuYs9A":{"text":"Delicious! I've never had Korean BBQ, so I was glad to try it finally! The staff was very ","useful":1,"cool":1},"DHeuWjbnY3UXfK4skBUImg":{"text":"My husband has wanted to try the full Korean BBQ experience where you can cook everything ","useful":1,"cool":0},"puCnObsZ7N1nsgc2a80r9A":{"text":"It has 2 kinds of table: 1 for premade cook and 1 for cooking in the table. We came withou","useful":0,"cool":0},"fmoguHJHLXZgkatOQozHSQ":{"text":"First time ever at LKBBQ and it was a success!\nEverything was AMAZING and I would highly s","useful":0,"cool":0},"nW4UcZHFbmKgTTkmN1vx5A":{"text":"i need to update my review for a variety of reasons:\n1. i go here very very often\n2. they ","useful":8,"cool":2},"EfHzC2waLcOllCpTj2CiJg":{"text":"Delicious Bulgogi served in a cow cast iron pan at @lkbbqnola - so damn good! Also, the To","useful":0,"cool":1},"DIHjWleMX0tKTNCdHPL1Tw":{"text":"Unmmm I don't get it. I came because of all the outstanding reviews but My family and I di","useful":0,"cool":0},"SYUr1rxrc8r1Dr_euR8-3Q":{"text":"First and last time to little korea. Service was great but food was awful. I ordered the g","useful":1,"cool":1},"gOP9Q7A4Mi1KUr5TsPr7Jw":{"text":"Arrived at 830p and all the tables with a grill were covered. \n\nWe were offered the option","useful":7,"cool":2},"8gT1WEGZ5mPIUEmOyge5zw":{"text":"We have never tried Korean BBQ until now. The server was fantastic and they were following","useful":1,"cool":1},"XPdoXfAPKddH6bKuQXqyNg":{"text":"Was very impressed by the food in this revamped building.  Service is always great, the Vi","useful":1,"cool":0},"xZuuAk342cKP3tCcnLFEnA":{"text":"i had a really good review written, then my stupid battery died.\n\nBeing Korean, and having","useful":3,"cool":0},"yDRy1ddQ1tWyFUaqAl38kQ":{"text":"I don't own a grill so going to Little Korea is as close as it gets to grilling out for me","useful":1,"cool":1},"UJP8V62ZMtY0QleIebG2NA":{"text":"I really liked this place, but they don't have potato salad as part of their bonchon. They","useful":1,"cool":0},"SJilsLvbW4C7STEyRJKgIQ":{"text":"I'm obsessed with Korean BBQ.  I always want to go to this place or the other business in ","useful":1,"cool":1},"wir_S68_yCPyxsANoxJfAg":{"text":"Wear your stretchy pants. I love the little dishes they give you before the meal comes out","useful":1,"cool":1},"qo_MaeomiZAN1tXHyom13w":{"text":"Is it the best KBBQ? Honestly no; Do they have some good food? for sure. It's a great plac","useful":2,"cool":1},"FWV4P9pdFLSdwB1ifkWKCQ":{"text":"It feels weird giving this place 3 stars as I had a nice time with tasty food. However, an","useful":2,"cool":0}}