{"IERYK-R1eUMv66AOPCZW_Q":{"text":"This was the first food we ate upon our arrival in New Orleans. The food was just ok and o","useful":0,"cool":0},"cHgumpgOFYuka4Rvle-M8A":{"text":"We went into a pretty much empty Cornet for drinks and was greeted by a fairly unintereste","useful":0,"cool":0},"foxtn__HOJRL3YlbRfzYFQ":{"text":"I have mixed feeling about this place. The place is on Bourbon St. The food was not bad bu","useful":0,"cool":0},"TWB3jgYmWHZC3_C8E7jlOg":{"text":"Great location but the customer service varied with each trip. I will return for the crab ","useful":0,"cool":0},"RHs9sIDbXAHh97fPH72wXw":{"text":"If you want a nice place to over look Bourbon Street get a seat on the balcony and enjoy a","useful":0,"cool":0},"fvffr5hX4yjOORxtjJLHrQ":{"text":"As many places as there are in FQ that serve genuinely local cuisine, this place just didn","useful":0,"cool":0},"fuDueHtQr3kpCuoHp6jYeg":{"text":"Food was really good, we sat upstairs outside and overlooked Bourbon street.  Kinda of a r","useful":0,"cool":0},"aI3Wde7_zl7pEaduMQmgSA":{"text":"Way overpriced, portions were tiny, food was cold, drinks were watered down, service was t","useful":0,"cool":0},"J9Lw_u7TgqrUUKCOiBd-Fg":{"text":"This is our first visit to NOLA. My husband and I were looking for someplace to have lunch","useful":0,"cool":0},"C49Dv2a_jPQ3WxfIlU8UXA":{"text":"There are so many restaurants in the French Quarter, it's hard to discern which is good an","useful":0,"cool":0},"YCb_69Zpi0yoaBa5ydVp9A":{"text":"What a great find in a sea of crazy. Perfect calm atmosphere in a sea of party animals. Am","useful":0,"cool":0},"WnIuO5aYCD7tDRwR2Gyfyw":{"text":"Cornet is located right on the corner of Bourbon and St. Peters and was right down the str","useful":2,"cool":5},"8Yd6-qDCCzdY9b-zG16wBg":{"text":"I give 2 stars for the good amount of TVs to watch the game. The food however is reminisce","useful":0,"cool":0},"wiVKrlVhWz8UaLTWeUEqvQ":{"text":"Little bit chilly if you're sitting at the bar....but other than that....the service is gr","useful":0,"cool":0},"5ShiqbouPNzte7-gZY7s7A":{"text":"This place has amazing food.  The crab cakes were awesome.  And our waitress, Heather, was","useful":0,"cool":1},"oR3Xfzf1rD1qCyAywRCmXA":{"text":"The bartender is horrible , drinks are terrible she wasn't very friendly just overall a ba","useful":0,"cool":0},"MOcmCzwvIFBrMoBvagj5cQ":{"text":"We had appetizers and drinks here on the upstairs deck. So fun watching all the action fro","useful":0,"cool":0},"TCXw0b9raCzPKRzMCcZokA":{"text":"Shrimp Po Boy was absolutely on point and both the Bourbon Street Koolaide and Blueberry s","useful":2,"cool":1},"nJVl6_8SATRc-ELWdlQsXQ":{"text":"This place has delicious food.  The prices seemed a little higher for what you get ($11 fo","useful":1,"cool":0},"J_-P3du9c-oIIVcyftCKyQ":{"text":"The mint julep was excellent! Iconic Southern charm with a lovely balcony and friendly sta","useful":0,"cool":0},"eCYK2-G6oEskEOqxhxKIgA":{"text":"Came here for a quick bite on new years eve during lunch time and everything was kind of a","useful":0,"cool":0},"-IxpaoEyka6xoF4m8CFhMg":{"text":"Wow! The food, staff, and especially the chef, are phenomenal. We showed up late on a Thur","useful":0,"cool":0},"m7MW0vA9_-qrf2Ckio4S7Q":{"text":"We spent a lot of time looking around the French Quarter for dinner on our second night in","useful":0,"cool":0},"Pga6SenUNRBkL0JZeHsH1Q":{"text":"Small portions, limited choices.  It was very disappointing for the amount of money we spe","useful":0,"cool":0},"UBuKmQCrA1gacvvgtJaZoA":{"text":"Great little spot on Bourbon st with outdoor balcony seating so you can people watch while","useful":0,"cool":0},"Yfcwzo92MMa2cpa8ZYdC0Q":{"text":"Small overpriced basic tasting food. You'll find better food worth the price elsewhere.","useful":1,"cool":0},"jF4rFn-ywJMI1YAyt7z-_g":{"text":"The food was really good and reasonably priced.  When we were initially greeted by our ser","useful":0,"cool":0},"F_oaYSJFGLPwQzy5832dnQ":{"text":"The food was really good. Price and quality/quantity was not a good ratio. There are much ","useful":0,"cool":0},"xikrivEDzLYSYYAqkfe8RA":{"text":"A nice restaurant with balcony... it wasn't the food that attracted us, but the location a","useful":0,"cool":0},"JhO4eQznlL591oLMpMWIfg":{"text":"While traveling through New Orleans, LA on our way to the mid-West, my sister had one requ","useful":0,"cool":0},"E8xnwZKn3Hx9pMZULxGvbQ":{"text":"We ate a quick dinner here before going out. I ordered the shrimp po' boy and it was okay.","useful":0,"cool":0},"l2Ym7_flkhDoWVj5TkNA9g":{"text":"Nice bar and restaurant in the french quarter.  Had lunch.  Gumbo was very good.  Also had","useful":1,"cool":3},"Hao_EN8ofCB-MPdBdOHytQ":{"text":"We mostly came here to get a balcony view over Bourbon Street, and there wasn't much more ","useful":1,"cool":1},"iEBOWALhQ9UEdqdkgNQd6A":{"text":"Our initial impression was lackluster by as we had to wait until the manager finished mess","useful":0,"cool":0},"r00SDAScI0_CkQqxKgoYxA":{"text":"Service was nice and polite but incompetent.\nWe requested balcony seating to watch people ","useful":1,"cool":0},"ReSe0FHw28NBoo2JB9Mp-A":{"text":"Loved loved loved it! Great food. Angelica was awesome. Be kind relax and enjoy! Food was ","useful":0,"cool":0},"_yohW2Qhdqupqgy-uXZC4A":{"text":"We stumbled across this place randomly looking for something semi nice on bourbon street f","useful":0,"cool":1},"6dkGitlk1lrnhFbUFFkJrw":{"text":"This place was amazing! I ate at the bar, and asked the bar tender what to order. 1st he s","useful":0,"cool":0},"0bga1YKmDp7KdxmXGX2Wdg":{"text":"Food was pretty okay and the service was good, I love the jubilee shrimp it was gooooooodb","useful":1,"cool":0},"0aLyTOUme-qDRfr02BzajA":{"text":"We were met at the street and told there was a table on the balcony. We proceeded upstairs","useful":0,"cool":0},"90awupTDzWFjUF3J5w4GjA":{"text":"Customers beware:  the food is really good BUT the portions are so small...if you're hungr","useful":0,"cool":0},"2fGP4FhzX2x1khXOAmOiXA":{"text":"Really good jambalaya, fried green tomatoes, meat pies! Sit on balcony to see Bourbon stre","useful":1,"cool":0},"l5MZH4zs-rfmzzHSU3EwJQ":{"text":"2 stars for location and the balcony seats watching bourbon street. Out of the 6 draft bee","useful":0,"cool":0},"R-9kPiS1HC8MdxdZfJrtSg":{"text":"Went here for food and drinks on a Saturday night.  It's centrally located on Bourbon St s","useful":0,"cool":0},"rNyPYdXCBoYhddzJoooznA":{"text":"Ok so I paid $44 for jambalaya, red beans and rice, and gumbo.  The gumbo was ok but there","useful":0,"cool":1},"xz_vi5M8HcGi6-X_RKxRQQ":{"text":"ABSOLUTELY THE WORST FOOD IN THE QUARTER!!!!!!!!!\n\nWe were walking by and were approached ","useful":0,"cool":0},"Xo34gFOcuk2zv9mvr5G5jw":{"text":"What an experience in Nola. Our server Wes, really went above and beyond for our trip. He ","useful":0,"cool":0},"XwJvZFakxOGCQYQEEX85iA":{"text":"We were here on a quick girls vacation. The good points it was clean and the service was o","useful":0,"cool":0},"ipEJsKYJ7WY43_3Jjnp_Cw":{"text":"The seafood platter was great..came out hot! However, the oysters had shells and the poybo","useful":0,"cool":0},"7SqQh4CqfXYu8vdOFM0v1Q":{"text":"Good food, street guy was awesome, service sub par. Waiter only checked on us once paid al","useful":0,"cool":0},"PUA2XA6T1zKHg7VORi6b8w":{"text":"The staff was super friendly and helpful but the food was pretty bad. Calamari was underco","useful":0,"cool":0},"ZYboE3TaXDxZ3RZIvcA63Q":{"text":"Great atmosphere and a fantastic place to people watch when you sit on the balcony. \nFood ","useful":0,"cool":0},"m_SEsVs8say1d-c2Mcadew":{"text":"Before exploring the whimsy of Bourbon Street, my sister and I had dinner at Cornet. I'm e","useful":0,"cool":0},"4YFmyErHhPIELmR8Wo6oOw":{"text":"Service is laughably bad, but I assume it's new and working through the kinks. Tables are ","useful":0,"cool":0},"-EvPgGNr3iUUO-0_P2RyRg":{"text":"The place is beautiful, especially the balcony, nice view. Our waitress was kind. But we w","useful":0,"cool":0},"wX06HD2N1_vna4Nl72515Q":{"text":"Worst meal in New Orleans. Awful and slow service. Overpriced and less than mediocre food.","useful":0,"cool":0},"fIh0MeyaOdjsVDvmX6U38Q":{"text":"I stopped in here to order a cold one only, since it was a typical hot & humid NOLA mornin","useful":7,"cool":3},"97G7UQgJ4Yis6nq-NSJ6bA":{"text":"We had such a nice time the first time we went that we were back two days later. Erica and","useful":0,"cool":0},"KGA9gwaGCUE-4KOZWPyZFA":{"text":"Friday Lunch // French Quarter  \n\nAmbiance: On main corner in French Quarter.  Went in for","useful":1,"cool":0},"tH6CPyajQ2Zr5E5mQs00oQ":{"text":"Great place with great service.  Jennifer at the bar was incredible serving up drinks base","useful":0,"cool":0},"JYI7t0iAdbXAyd6_OFbI2g":{"text":"This quite easily could have been a five star review; however, upon being seated inside, a","useful":3,"cool":0},"d6KFMgVoW4M2keBVwH_Njg":{"text":"Come here for the excellent Bloody Mary and to get a table overlooking Bourbon Street so y","useful":0,"cool":1},"5yAFjFKVnycblcuUkOjmiA":{"text":"Great location and decent red beans and rice. Aside from those things the experience was l","useful":0,"cool":0},"vtOE1DtS4fai9RAP4sHM0g":{"text":"We went here to sit outside and enjoy the view of Bourbon street on Pride day.\n\nThey have ","useful":2,"cool":2},"Gwjp5KWDd-68wVTcnyKhEw":{"text":"Open late on a Monday. The restaurant wasn't busy when we visited but Renard was a great s","useful":0,"cool":0},"88rXxD_g5sfdHfSTdmf9qA":{"text":"I'm a little mixed about this place (2.5 stars). Nice tourist spot.. not too loud & had a ","useful":0,"cool":0},"wyfydfi3l9oN_Unqrrvebw":{"text":"The food was not as good as my previous visit to New Orleans. The climate of the restauran","useful":1,"cool":1},"unY4DPW_vNVIM63YgRqpMw":{"text":"I wouldn't go out of my way to go back. So-so food and service. Definitely not among the b","useful":0,"cool":0},"DNH-_evFsEB1_ksnyVW18w":{"text":"Love this place!!! Adrienne was awesome!\nWe kept coming back for her fresh hand crafted dr","useful":1,"cool":1},"yisHWDsgu0xXwlV4MMAmmw":{"text":"Stopped in for a quick bit to knock off the hunger on the way to a different place to eat.","useful":1,"cool":0},"Chnax5ApMAFCY4AdeTATiw":{"text":"16.50 for a bud light, albeit a pretty big bud light, but after tip I could have bought a ","useful":0,"cool":0},"AOgb-E_xyljUFo7JK_SjmQ":{"text":"One name... Adrian! She is by far the best bartender I have ever come across. My fiance an","useful":0,"cool":0},"tFA2ovLt5SUPU4c7C9piyQ":{"text":"Food took 45 min to get out even though it wasn't busy. When it came, one of the 3 dinners","useful":0,"cool":0},"aKHCE5xdMINCJv6h4ejNtg":{"text":"Great service and bartender. Cool place!  Adrienne is the best!!!  Very personable. Great ","useful":0,"cool":0},"BdZxLM9kTYh2k8U4Fd4yZw":{"text":"Upscale bar, on bourbon st., Great drinks, incredible staff, solid local food. I've been t","useful":0,"cool":0},"c5PK9741QV8flTRMN3ARXQ":{"text":"Great service! Delicious food! Good vibes! Tour of New Orleans app is a must try. The atmo","useful":0,"cool":0},"imgGJH8v1XMOVgryVdaWrg":{"text":"This was a great place, great atmosphere, and my server was great; was was very helpful on","useful":0,"cool":0},"FHhGVhKH2iZm8Y9hasWf6Q":{"text":"Oh so fabulous!! We stumbled upon this place and had one of the best dinners, ever.  Hubby","useful":0,"cool":0},"eWlNRInWKrNempu7nKvXaQ":{"text":"The restaurant is very bad. The waiter doesn't know about the menu and made me ordered som","useful":0,"cool":0},"rkhqsbWptmaaNPkydBhoOQ":{"text":"During the month of December, I went to the Yelp Christmas Party held at the Cornet on Bou","useful":3,"cool":4},"c0QSUHq_4wUqImv3ipKzWg":{"text":"The drinks here are amazing.  They had a watermelon infused drink that was to die for. The","useful":0,"cool":0},"TO2iNeoxfAT0FHZC_DROOA":{"text":"Awesome location but food and service left a lot to be desired. In a city known for excell","useful":0,"cool":0},"9P8gGhTtVmtfcPbcn8Ub7w":{"text":"This place sucks you in only to disappoint you! We live in Baton Rouge and if you are look","useful":0,"cool":0},"hf2UodhQt6ngtmmtq1TuYg":{"text":"Good food, good drinks, nice balcony. Bartender not very friendly though. Overall, pretty ","useful":0,"cool":0},"QHzivXV54RjzuJD0h17vRg":{"text":"The service was fine and the drinks were good. I was very disappointed with the Jambalaya.","useful":0,"cool":0},"AsoiSnl7FaR_zZ7--0I0lA":{"text":"Came here based on yelp reviews and we weren't disappointed. We had the hot tots, shrimp j","useful":0,"cool":0},"0TwQJcw6J26LC-PkNmAlPA":{"text":"We were walking on Bourbon and were approached by an employee of this restaurant to see if","useful":2,"cool":0},"9MY2B-hQOLjyvosSzQLJOg":{"text":"Bourbon street is known for parties and parades, which is fine when you are in the mood. H","useful":0,"cool":0},"G9HgENTRxg0W_7Cd7L8EVQ":{"text":"Great location, staff, and prices! Booked a table for 30+ very last minute on the balcony ","useful":0,"cool":0},"a4SaObtj-9_1o6JLz29Ssw":{"text":"Me and my girlfriend really enjoyed ourself! First off the weather was perfect to sit outs","useful":0,"cool":0},"SnCtQ9V7h6y23wI0isXQiw":{"text":"We came in for the beautiful decor, and I'm so glad we did. The staff is attentive, and th","useful":0,"cool":0},"1ZPapYAGlZDN30Bw9oSTbw":{"text":"This place is a hidden gem among the slew of wall bars along Bourbon Street. We were in to","useful":1,"cool":1},"5BCFrF7Lsq4VD23jHl_clA":{"text":"\"one second\" in the kitchen, thousand years in the real world. Wrote a novel when we were ","useful":0,"cool":0},"_rnvVMH3Mkm4Q4TLbRKzhA":{"text":"The food was delicious and the staff was super friendly ! We were are party of 12 with no ","useful":0,"cool":0},"S97_4B1T9Evym44po_d7DQ":{"text":"Excellent staff. Attentive and friendly.  The seafood gumbo was delicious.  I had the tast","useful":0,"cool":0},"yWrFotFNebV96L7cncxB-Q":{"text":"Cornet offers delicious home-style meals that are truly phenomenal examples of what Cajun ","useful":0,"cool":0},"_jP9kSe1ZFQrLVzNf_U4Pw":{"text":"First time in Norleans. So far my favorite bar. Great location and the best Bartender hand","useful":0,"cool":0},"3zIk11m-xDFp1QiYup8Cnw":{"text":"Walked into here soaking wet from edge of patricia last Sunday....aahh, nice place without","useful":0,"cool":0},"pQHa0QaP9uGzVZmMDSx0jQ":{"text":"I hate to leave a bad review, but this place was severely underwhelming. We got suckered i","useful":0,"cool":0},"MVqd5es6m_FSgERa52zSAg":{"text":"So far I'm very unhappy with their reservation online form. There is no spot to put how ma","useful":1,"cool":0},"IBZasPjMWQJ8xXMac54ynw":{"text":"For a late night eatery in the French quarter, one can't complain...the staff was super fr","useful":0,"cool":0},"FuqVBMLLByzNb0RP3uCLkQ":{"text":"Great staff! I only drank beer so I can't attest to the drinks, but cost was reasonable. F","useful":3,"cool":1},"k7T2t_jczXMZGjfkbVFr_g":{"text":"Fun place to sit upstairs on the gallery/balcony and have dinner while watching the crazy ","useful":0,"cool":0},"vQaRuHNlGi4cwV4jmu3KtA":{"text":"We have held a corporate event here for the past 10 years, sometimes with close to 400 peo","useful":1,"cool":1},"gdq20FqfhObqBEwxk0mqTQ":{"text":"We had a great time at Cornet. Great ambiance, awesome view. We had the gumbo and the shri","useful":0,"cool":0},"RkgF_iIoCIIZIeFRMNpI0Q":{"text":"Ordered 4 separate dishes, the bbq shrimp, crab cakes, alligator sausage, and the crawfish","useful":0,"cool":0},"gqChYztaJBUComf8Y_AdOw":{"text":"The food here was amazing! Great service, great food, great location. I recommend the shri","useful":0,"cool":0},"VBg_Bwo-sRwLVGExr0Q-mQ":{"text":"Didn't try any food so I cannot rate their food , it's a good bar good drinks I tried the ","useful":0,"cool":0},"P2L7grVD34PW5bRBi9hClA":{"text":"This was a disaster. We sat at the bar, ordered drinks - his beer arrived after about 10 m","useful":0,"cool":0},"Ae8aPz03HGhttos9Xfu63A":{"text":"Best Grits i have ever eaten!\n\nI had the Catfish and my wife had the Jambalaya.  The food ","useful":0,"cool":0},"VWqjk6liYTCYmQA5ePFp0g":{"text":"Four of us shared a roast beef poboy and 2 orders of hot tots. The hot tots come with sort","useful":0,"cool":0},"lnOzDpvxcN7zarrCT9loHA":{"text":"Went there for supper last night with my Pooh. He had the Crawfish Mac&cheese and I had th","useful":0,"cool":0},"O-gtmfE_wg73Z2L_T7D9aQ":{"text":"Holy crap!!! We were looking for a place to eat we stumbled on the Coronet when we got ups","useful":1,"cool":1},"899OSihyxyJM5YN_zL_U9A":{"text":"We ate here 3 times. The first time honey tried a Cajon mix sampler and the jambalaya stoo","useful":1,"cool":0},"dn8SxA4rzUaAt6XTuAimyQ":{"text":"worst service ever. food was not that great. the server ner came to refill my drink so aft","useful":0,"cool":0},"PE8aVKWAUofsVP_FowUVow":{"text":"We came here because the reviews were so good! A really nice employee greeted us at the do","useful":1,"cool":0},"e25NGTmhvKBer5K-XfUrfA":{"text":"4.5 stars\n\nHad the redfish bullion. It's a seasoned redfish with a tomato broth/Buerre bla","useful":2,"cool":0},"feTq_lVu41YkNhdKDeYLpw":{"text":"Can't stay away from the crab tomato salad.  Decided to try the gumbo.  Crab cakes with Al","useful":0,"cool":0},"wyypW4Kun-AKLLHMfvaHSA":{"text":"10/22/2016 - Perfect balcony views of Bourbon Street\n\nCornet was right around the corner f","useful":9,"cool":6},"HR6xHEIdDKQvUkYaSsECdQ":{"text":"Came here for lunch on a Saturday afternoon, greeted by Fabio at the door. Sat at the bar,","useful":0,"cool":0},"tns8ZMLIU1F1GVLS8KqPBA":{"text":"Late night dinner - 6 of us. Good service, put us on the balcony, which was great.\nHad the","useful":0,"cool":0},"qbIONDBSq4ZcHkpaGWOG0Q":{"text":"Terrible food. Had a steak, mac and cheese and vegetables that tasted like they were froze","useful":0,"cool":0},"14Ew2p4Ksqz5rtXJ3gagAw":{"text":"We came here on Christmas Day and a party of 3 we shared the Big Ass Seafood platter, Jamb","useful":0,"cool":0},"v3JfId4_YRTIFCox7CH_SA":{"text":"The charm of The Cornet is the atmosphere. Welcoming, friendly wait staff ready to meet yo","useful":0,"cool":0},"8SIygg1VJooo1Mu5uKKHoA":{"text":"We made a reservation for a large bachelorette party approximately 3 months ago. We asked ","useful":2,"cool":0},"bWSICHk-Ozas2L4_DBPRlA":{"text":"Came in around 7pm, the restaurant wasn't that busy and we were quickly seated.  However, ","useful":0,"cool":0},"mGwDv3l3U-_XpfOw6faKrA":{"text":"The atmosphere was good along with the food. The crab cake appetizer was extremely good. T","useful":0,"cool":0},"kxrkgBrmD0MvM-BJTcCpNw":{"text":"Stopped at Cornet for a cocktail and a snack. We ordered the Pimms cup, Sazerac, and fried","useful":0,"cool":0},"kNsNWR36EX5FAsLu2YhD1A":{"text":"Food and drink perfect.  You'd never expect it but best Bloody Mary I've ever had. Food wa","useful":0,"cool":0},"ll4fsXHc5kro7Af4QuIXXA":{"text":"I have mixed feelings about this place.  We visited two times while in NO.  The first expe","useful":0,"cool":0},"x7lN0bkDzIT169N4d-m0-A":{"text":"Stopped in for a few drinks with a friend and was quickly greeted by Amy! She suggested th","useful":0,"cool":0},"fAFCqdsC4PgIW1yMVdsSVw":{"text":"Gross. We came here for the view and the half off appetizer. When we told him we had the d","useful":0,"cool":0},"1KMABlmFLQVCbfQIW966jg":{"text":"Fantastic food, service with a smile with a great view of Bourbon Street. What more could ","useful":0,"cool":0},"LZeLp01GUxcne6PbPEgBKw":{"text":"Food was delicious, service was great, but the serving size is very small for the price. I","useful":0,"cool":0},"4ee4bMII_d0smzYjpIUmOQ":{"text":"Right on bourbon street. Had the alligator, gumbo and Caesar salad. Salad seemed a little ","useful":1,"cool":0},"wzLoz4tCbNMzLAyBmDLF6Q":{"text":"Randomly stopped in for a late lunch. I had the shrimp and okra, it was pretty good, there","useful":0,"cool":0},"f3KBSQTim-K-PGapjYSJLQ":{"text":"Normally food can be hit or miss on bourbon street, but this place has awesome food. We ha","useful":0,"cool":0},"ZytJuau8cUX6Snerh_3OCw":{"text":"Great food & great service.......our server, Renee, was probably the best server we had on","useful":0,"cool":0},"zADi01v5WIZuMLrWQBIEdw":{"text":"Just say no!\n\nWe were rushed in, but that was the only thing that happened in a hurry. \n\nT","useful":0,"cool":0},"wB-1TMaDLFKyn3tCyZHaIw":{"text":"Never go here!!!!! They tried to scam us so many times by \"forgetting\" our order and bring","useful":0,"cool":0},"dvs4Zx6bdlnj8vzRqWh_dg":{"text":"Just got to sample their jambalaya and Bloody Mary at the Bloody Mary bash at Tchoup Yard ","useful":2,"cool":1},"eftLlKZ1KJjkLOgZIjbWsA":{"text":"This is the first place we ate on a recent weekend getaway/vacation to NOLA and this was b","useful":0,"cool":0},"cKbaBQC5EMGYYfF-g6cUmg":{"text":"Good food crapy service. I don't like to wait 20 min before my order is taken. Then the fo","useful":0,"cool":0},"yOvoOlWEL9NGsne2BHuqgQ":{"text":"Wow it's been a year!!!!! \nAnd still hands down our fave place for handcrafted drinks, our","useful":1,"cool":0},"tWNNF9i25k87jlP6FkYKBQ":{"text":"I tried the crawfish etouffee, sauce was watery and had no flavor.  Wait staff was very ni","useful":0,"cool":0},"leSs015E5QUoJ-8OfRrxnQ":{"text":"We love the Coronet. We come here every year. The Jubilee Shrimp are to die for and their ","useful":0,"cool":0},"IfGVnYCy57bP5_0-SNmMMA":{"text":"MINORITIES BEWARE!!  You will not be served!   My husband, his two colleagues and myself w","useful":0,"cool":0},"qAUptpClVXYWs0ZOOFLMjQ":{"text":"Really good food but nothing spectacular. Great location on Bourbon. Service was decent. P","useful":0,"cool":0},"8hWDdKjYUBUA-h617Ag0nA":{"text":"Cornet, \nBalcony seating if you arrive early enough and food service was quick.  \nMARCY wa","useful":2,"cool":1},"Jgs61GcWx0F_NBgbwCtNEA":{"text":"Food and service we great. Only one option for someone GF/DF but that's not entirely on th","useful":0,"cool":0},"p707pQAmtzeE7szw1UCRyw":{"text":"Nothing but good to say about this place. What could be better than sitting on a balcony o","useful":1,"cool":1},"thy4JkS-lGRk8wKVReSI7w":{"text":"Had nice jambalaya rice and beans.  Bartender needs to learn to make a martini. Had cosmo ","useful":0,"cool":0},"lTPVmACJKh-1pJaxA-sIYg":{"text":"So, we tried Spirits. It was ok but we wanted something a little less Bourbon (within reas","useful":0,"cool":0},"x8lmhtVx0dLJnVW_Zid32g":{"text":"Meal was ok.  Service slow. Dropped one plate of food and had to refire  several people ca","useful":0,"cool":0},"8DLrKTbb0LEVffNn7tiGUw":{"text":"We sat downstairs; I didn't think much of the atmosphere other than the opportunity to peo","useful":0,"cool":0},"n3-aW9zyQbGDD5g2nCaB5g":{"text":"There is nothing not to like about this place....except maybe the price. Considering the q","useful":0,"cool":0},"bzXBxLqi-N_xjVViyCXoqw":{"text":"We got roped in by a promoter at the front door on bourbon street because we were looking ","useful":0,"cool":0},"ZC2ib3dfbp9aH8WIjwNacg":{"text":"Amazing service!  Heather is a phenomenal bartender.   Best Bloody Mary by far!    I highl","useful":0,"cool":1},"zCGDYqnnh4aPoiVz5rmNuQ":{"text":"We wanted to see the craziness that is Bourbon Street after dark but we didn't want to wal","useful":0,"cool":1},"R8xjbYISAqBwN0Wj5BJ0Ig":{"text":"We had a late dinner here last night and had a great time. The service was very friendly a","useful":0,"cool":0},"t-DI2A-RB7GFLHPaOFIjtw":{"text":"The worst food I have ever had. Super expensive and greasy:/ I was so excited but what a d","useful":0,"cool":0},"or7cud-sS7j54YW0GGr8fw":{"text":"Food was awesome. From the fried green tomatoes to hush puppies to res beans and rice to p","useful":0,"cool":0},"JceBA3fDkqEUnfgMbqq8_w":{"text":"Make sure you get savannah she is the bomb also get the blueberry hill it hits the spot","useful":0,"cool":0},"QEvUkQ_z0m7pqDUZGrJ69w":{"text":"Excellent food, superb service. Loved the fried catfish and pecan pie. We went for an earl","useful":0,"cool":0},"Lb51B3Va5BWTixsuqxUwrQ":{"text":"This place was nothing but one disappointment after another. First we waited 30 minutes fo","useful":0,"cool":0},"XC_ODq9wimdPEROwBmF2GA":{"text":"I just stopped in this little divey bar just to check out the gumbo. I give it a \"C\". I wa","useful":1,"cool":1},"p0xrgP8vnp6ZycMmEJu3uw":{"text":"Of ALL of the places along Bourbon Street, this is hands down - the best in my opinion. Th","useful":0,"cool":0},"nVILTUOsuEYfeH0HbmTkuA":{"text":"This place is really cool and the food looked good.  Popped in for a cocktail at the bar a","useful":1,"cool":0},"ZDO1_oonRixgl3jH9EE1Ew":{"text":"Dinner on a balcony overlooking Bourbon Street, what could be more perfect? Nice atmospher","useful":0,"cool":0},"Hn-g5Mkd7X8eDAh1Oagjgg":{"text":"Awesome cocktails.  Hurricanes are home made ! Not the mix stuff!  Blueberry hill is amazi","useful":0,"cool":0},"Jx7lHg61nvUK3w-LYjzmjQ":{"text":"we came in here while waiting for preservation hall.    perfect seating on the balcony ove","useful":2,"cool":2},"83ndbNcA6jYKHSTm54biNw":{"text":"I was disappointed after being invited in for dinner off the street by the manager himself","useful":0,"cool":0},"mqXkm7LkVgsruQ7eTJuaVA":{"text":"Our server was Nicolas and he was very welcoming. Being our first time in New Orleans, we ","useful":0,"cool":0},"zBfz45pYp2qopuuHqX8M2A":{"text":"Stopped by at cornet for a short lunch break.\nGreat location. \nGood design\nNicky our serve","useful":0,"cool":0},"2hm7KKhHThY4tz2T2w-5mw":{"text":"I think this place would've been great if it wasn't for the horribly rude bartender. She c","useful":0,"cool":0},"Y_KCv-Vq-mZkVsFfjGkhiA":{"text":"Cute restaurant in the center of action in the French quarters but slightly away from the ","useful":1,"cool":0},"e6kA4LoiEpRjuAPpHAQ2mA":{"text":"The view from the outside terrace is what makes this place. The prices are a bit high, and","useful":1,"cool":0},"3XqBEON-ohosB2gomwBAyg":{"text":"It's incredible that everything we got was excellent! We had: crawfish etouffe (x2), crawf","useful":0,"cool":0},"Jr-BI2SRkxq78j5DnDD5fA":{"text":"The 50% off one appetizer drew us in. We kept walking up and down the street and decided t","useful":3,"cool":2},"w1jriNl6SQ1Okc3y1dhgbA":{"text":"ASK FOR TEENYA!!! She is a FANTASTIC server and will definitely get you set up with a grea","useful":0,"cool":0},"U5ei2xGudDjY0Xa7F1-uTw":{"text":"We returned this place after a few months ago loving it, to our surprise this was a very p","useful":0,"cool":0},"_f-vTxKIU9SmIVXS7yt2Cg":{"text":"Nikkie was an extremely friendly person after one of the worst meals ever... Dickie Brenna","useful":0,"cool":0},"G0zPTxFnck0SIm2eB4py4w":{"text":"The food and the ambiance was perfect.we will be returning next time we're in new orleans.","useful":0,"cool":0},"r9H-74U_AW9Lo0KtWns0NA":{"text":"Awesome food, great service with a cozy atmosphere! 9 of us came out for dinner and Cornet","useful":0,"cool":0},"YTjAL6QhkkZ9RmlefciYWQ":{"text":"Great food,  great atmosphere. Sat upstairs on the balcony. Service was great. Had the shr","useful":0,"cool":0},"am-VHXBZaDp3SahFc1bV0g":{"text":"Horrible service. I get that it's on bourbon but when your sitting at a table for 20 mins ","useful":0,"cool":0},"kVmRZGfW6ht3VhZwNIAdCA":{"text":"Cornet.... The bane of my food experience in New Orleans.  My friends and I booked a table","useful":2,"cool":1},"-ksRbtMlmGMfGaRUEMPE7Q":{"text":"The food is filling and what you expect. Not fab but not bad..but The bloody mary is one o","useful":2,"cool":0},"tPdmYIgL8hgSsP-t_GjmrQ":{"text":"Two of us shared seafood Mac n cheese and red beans and rice. Food was excellent. Service ","useful":0,"cool":0},"BiWovJ9bAxxtcXl_22Iang":{"text":"If you are in New Orleans, this place is a MUST. The head chef is incredibly personable, a","useful":1,"cool":0},"rcwpXqIc1xTS1RR6nBIzEA":{"text":"Had a great bone in prime rib, one of the best I have eatn in 50 years. Service was good a","useful":0,"cool":0},"A0vpX3ehOmbRj2zAjT-EBg":{"text":"It was great being able to make reservations on a Friday night (via OpenTable). \n\nOverall ","useful":0,"cool":0},"gJkP3BZS_Uhx27lDpxTXCQ":{"text":"This is a great place to sit upstairs with friends, drinks, and every app on the menu to s","useful":0,"cool":0},"rHYczdktHiANAEk7aX_RSA":{"text":"My husband I were just in town vacationing and took a moment to sit and enjoy a beverage h","useful":0,"cool":0},"AoKCoylPdhvUl8D6lRVB-A":{"text":"Service was slow as hell. We ordered the strongest drinks and it literally contained no al","useful":0,"cool":0},"SHyLqWOn6lHhLsb2aLRj9g":{"text":"Are blackened fish w crawfish on top n corn Mac que on bottom great\n\nN real Cajun gumbo\n\nG","useful":0,"cool":0},"e_ctRPdWhTDXFuDq5iQISw":{"text":"This is my new favorite restaurant in NOLA. First the upper level balcony seating is smack","useful":1,"cool":0},"EqIJ7MA2ag0xmQhjpu4m5g":{"text":"Great food! Calamari is fantastic and the the Cajun Martini is where it's at hands down! C","useful":0,"cool":0},"QhQJ3EvVr3iKYQMDjD4njw":{"text":"This place has a lot of history. We enjoyed reading all about it.  The drinks were great a","useful":0,"cool":0},"fvOal1LGKvjyWjfzzateEA":{"text":"So disappointed.  Brisket was not hot, but tough, fatty, and very little of it.  The barbe","useful":0,"cool":0},"f9zgTplCywmfLOpHmbxvIg":{"text":"Yum!!! Great view of southern decadence! Had the jambalaya and it hit the spot. Had a nice","useful":0,"cool":0},"SVX-MXewmGqSg7P7J_PTeQ":{"text":"Went here one evening after a work seminar to unwind with some coworkers and had a great t","useful":0,"cool":0},"QLJV9uCld8NFudVDsX7Ltg":{"text":"I went here for my first time while walking around the city. I really wanted a Bloody Mary","useful":0,"cool":0},"2ngGbqpK7mkTkFf3q7UYgA":{"text":"Many better options. I'd choose something other than the burger, the grilled cheese and le","useful":0,"cool":0},"utk3PLFSa6p9JJ815MRJ1w":{"text":"The only redeeming quality about this location is that it is overlooking Bourbon Street.\n\n","useful":1,"cool":0},"hILwT5m11qSzmcJJ-Mp-Lw":{"text":"Had the best Bloody Mary ever!!! The bartenders are super nice, especially Jennifer and Co","useful":0,"cool":0},"r3tFi6Kxm6UnRBm1b0x0UA":{"text":"Had a great time here. Our server Heather was awesome and super friendly.\nGreat way to kic","useful":0,"cool":1},"cDPa3eEkocOtz9kThKWQBg":{"text":"Great New Orleans Tour appetizer sampler. Better than some of the higher priced restaurant","useful":0,"cool":0},"JeusLnHPwGInDvKPG0M_3Q":{"text":"Thus place was a pleasant surprise. It sits on bourbon street so you can sit on the balcon","useful":0,"cool":0},"LC-KUgi1FaZW5odbdUzH7A":{"text":"The worst meal I had while vacationing in New Orleans. I was ignored by the bartender for ","useful":1,"cool":0},"eiD7_HIUHWZfFpruMmU75w":{"text":"I love this place. Amazing hush puppies!!! The blueberry hill infused drink is out of the ","useful":0,"cool":0},"YBa64U5ToxIl9OEILGYBIw":{"text":"This is an excellent restaurant! Do not walk by without trying this place out! Service: Am","useful":0,"cool":0},"oggbuvXQ0GBU5ZtgwV4sQg":{"text":"Jambalaya and Cajun platter is very good. Make sure to get the tater tots !!! So good. Dri","useful":0,"cool":0},"zIlEjDe6MfzGShv9oL2U5g":{"text":"The worst restaurant I have ever been to. I took 20 mini for receiving a menu even though ","useful":0,"cool":0},"JuU1J1nA7EDWHunZsvCrNA":{"text":"Ridiculously long wait for average overpriced food. Wait staff was friendly. Great locatio","useful":0,"cool":0},"HcJcgOUBA5MUIJcJc2-VwQ":{"text":"We ran across this restaurant while walking down bourbon. We had a fantastic time!! Awesom","useful":0,"cool":0},"JUfLpNra30ZBYACMZNfAKQ":{"text":"Catastrophique !!\nTout est surgelé !!! \nLes photos postée auparavant sont mensongères...\nB","useful":0,"cool":0},"kagAlzp4PtnBPmhZUDKD6w":{"text":"Nice sitting on balcony overlooking bourbon street. Wonderful cocktails but of course the ","useful":0,"cool":0},"mTqJcdm96O4mtfTCFzSFdw":{"text":"Didn't live up to the hype.  Food was burnt, service was bad.  At least the balcony seatin","useful":0,"cool":0},"rJyAqzNaxDH9DRkcJiZ6yw":{"text":"This place has the best drinks in town - by far! I had a martini and a blueberry hill, aga","useful":0,"cool":0},"_pXpn3U3a0_C7Fhwexy3FA":{"text":"The service was really good from the moment we walked it. Food came out quickly. The chick","useful":0,"cool":0},"GRLcFzi8v0UfNePl_XU_gw":{"text":"One night while wandering around on Bourbon St my friends and I decided to have something ","useful":0,"cool":0},"qgn4CUWi6Mvhd9gw9Ce6Dw":{"text":"Angelica was an excellent server! She recommended the blackened catfish and the red beans ","useful":0,"cool":0},"z_TOEt8gkMOK0fsNGtvPew":{"text":"Wasn't surprised that the place was empty for most of the time we walked past it. We wande","useful":0,"cool":0},"X6ur1fV9Hd9xryQ-LvuGFQ":{"text":"Great, classy bar on Bourbon St.  Nice atmosphere for a more mature crowd or just to duck ","useful":3,"cool":0},"08-HkIW0IAckR6NS0YT5AQ":{"text":"Food is way over priced. Kitchen screwed up my order and the db managers solution was to r","useful":0,"cool":0},"wxj71-HOOWdpN3wXbOipBQ":{"text":"I was excited to come here and I'm very disappointed. The fries were covered in grease. Se","useful":0,"cool":0},"rZghMB79Af1YnpnA6ZzDWA":{"text":"We went here for dinner after a night out on Bourbon Street. It was crowded but had no pro","useful":0,"cool":0},"c2H-SX1zEvIRSa07loseMw":{"text":"Ok so.... in NOLA for a week for essence and I get served a cold entree???? Won't be back.","useful":0,"cool":0},"_pcktX1U3fhHCjW8NCVg9w":{"text":"I had a wonderful experience here! \n\nMy boyfriend and I recently went to Cornet to celebra","useful":0,"cool":0},"DduXIwjUVolkmg1SPz8AKQ":{"text":"Came to New Orleans for my moms birthday cornets was the first restaurant we had a meal at","useful":0,"cool":0},"VRXqsddng3_3XY5YJvBAPw":{"text":"After drinking while celebrating my sister's bachelorette weekend, we needed food and came","useful":2,"cool":0},"ipcWQ_fNPwRS5EMlV1P0cQ":{"text":"Good location if you're on Bourbon Street as it is nicely on a corner. The Hurricanes we h","useful":0,"cool":0},"8yZA9zc4Z7Cst6VRGPhn9Q":{"text":"Awesome red beans and rice, Hurricane was the best we had.  Chris was attentive and funny.","useful":0,"cool":0},"VQl4F5a28qUEvM6bKtTwlg":{"text":"Shit service tourist trap bullshit. Don't order the double and make sure your bill is corr","useful":0,"cool":0},"LruhYGXGkb9zZgWATu2ZZA":{"text":"The food was not memorable. My husband had pork slices,  i had jumbalya,  my daughter had ","useful":0,"cool":0},"KlJt6nj7NUnLo9kfPwsK3A":{"text":"The food was AMAZING!!!! I had the Shrimp Po Boy and I almost cried. Thank God. The staff ","useful":0,"cool":0},"Z-KH-61FzjBEqOr_QDZ_6w":{"text":"I just had the best burger , I have had in a while. 8oz Angus buger, cooked perfectly, jui","useful":0,"cool":0},"BQK8UHPMa7NyC5Qe5XOIbg":{"text":"Yelp said they were voted best bloody Mary's so I had to find out for myself. Well I was n","useful":0,"cool":0},"Sfj5MbMZ_Poe18MRBKqF2w":{"text":"Menu is pretty basic.  Cajun and bar food.  Nothing very original or exceptional. Jambalay","useful":0,"cool":0},"wCvmAOk5sDCqItVVBOEBJA":{"text":"The food and service were both wonderful. The balcony seating was nice to see the action d","useful":0,"cool":0},"DeP8bERA9jhaO3sdZAljow":{"text":"Really nice bar/cafe atmosphere, definitely focused on cocktails and a decent selection of","useful":0,"cool":0},"Gkyz2poHPh_VS5HJOYWRZw":{"text":"Boudin balls were yummy and a great starter.  I had the Cornet burger which was tasty. I w","useful":0,"cool":0},"XtqutEMtqQ4ET1GWS2r91g":{"text":"Great just walked in and got a table in the balcony no wait fr and the apps I ordered was ","useful":0,"cool":0},"VRdgMdfaNpBttIDHVn1Dbg":{"text":"We were solicited off the street and promised balcony seating with no wait for our DINNER ","useful":1,"cool":0},"6bFFbq4dpUnq3J19ofILYA":{"text":"Great service. Wonderful bartender, attentive,caring, honest and focused on 100 customer s","useful":0,"cool":0},"nezLdg5IOR9rWqE7XP9HCQ":{"text":"We picked this place at random while we were walking around French Quarter. It's located a","useful":0,"cool":0},"QbjiobxHFh-zfPoPrhW4aA":{"text":"Had dinner here on our first trip to New Orleans.  It was good. We ordered the blueberry c","useful":0,"cool":0},"DcYxFlWUllhDpUHV0X65DA":{"text":"It took 20 minutes to get a menu (only after we requested it) and no one ever came back to","useful":0,"cool":0},"G8FWKNjUa-Yv0uCLZZ4TZQ":{"text":"Very rude do not go here........they don't care for the customers I simply called and aske","useful":0,"cool":0},"t_fism6vAvNkaXDrrwTVqg":{"text":"The location in the quarter is ideal. It has an excellent view from the balcony. The food ","useful":0,"cool":0},"cA1D9EYyoaAQqPKWhCFmFw":{"text":"Ok peeps...this place rocked!  The food was amazing, server Dustin was so attentive, and t","useful":0,"cool":0},"Nxp944PI9UdeSDJA89IzdA":{"text":"We sat on the balcony of the restaurant which has a nice view. the service was nice but sl","useful":0,"cool":0},"Rtzsc7owNAyNIYuWCZWulA":{"text":"Cornet is a great location on Bourbon Street. I only had food there, but their drinks look","useful":3,"cool":1},"nGUIHa8xLKUtlRWa3R-Wcg":{"text":"A group of us went in on Thursday and I couldn't have been any more disappointed with the ","useful":0,"cool":0},"lWcxraX9q9QehDw7SAIbew":{"text":"Not the best food I had. Did not care for the crawfish mac & cheese. Had better fried gree","useful":1,"cool":0},"XkUIo_sBBCz0K4Z8VvI-9A":{"text":"Amazing service staff was so accommodating and adjusted TVs for our preference! Food was d","useful":0,"cool":0},"2W-rIfyBA-qkLmNv5MyuDg":{"text":"The service started out slow but ended great! The Bartender was overwhelmed due to a barte","useful":1,"cool":0},"NEF_TobyG-CzhCNH0PKhuQ":{"text":"I had a wonderful experience at Cornet during the elite Yelp Christmas party. The food was","useful":2,"cool":0},"UbAWJWZAMB5TlAyv7RZLtQ":{"text":"This place is lucky to squeeze two stars out of me. The only reason for not giving them on","useful":0,"cool":1},"3gk2qItMPsGFbFTGNY83pA":{"text":"Came to Cornet on Bourbon... I was disappointed by the veggie-unfriendly menu (ended up wi","useful":0,"cool":0},"wmwz3i9_AbIu8Ktr94Ugvw":{"text":"Bartender was horrible. We paid cash for the first two beers then she tried to bill us on ","useful":0,"cool":0},"GrrRnknpUtDBTS-a40qQ4A":{"text":"Upstairs overlooks Bourbon Street. Allen our bartender was awesome!  We shared the Cajun P","useful":0,"cool":0},"xex2QHtXMiUmYv2Y3d80fA":{"text":"Was at Cornet on 12/22. What a great little joint. Infused vodka was great. Had the gumbo ","useful":0,"cool":0},"JUcGw254xjm0TFgJpBIbGQ":{"text":"I didn't eat here, so this is for a bar experience.  I was exhausted and had been walking ","useful":1,"cool":0},"D7RdkdT5d9KFaFLPKdkjbw":{"text":"Adrienne is the bomb! Love her. Fast and attentive:). Would highly recommend that you come","useful":0,"cool":0},"QJ3Tv6D5b_vY9iqiXSUQSw":{"text":"Another five star review reduced to one due to the horrible service or, more correctly, al","useful":2,"cool":0},"eO_q4ooSRcrcK7kwicvsbw":{"text":"We stopped in randomly for dinner. It's in a great location and has a great view from the ","useful":0,"cool":0},"aHVTi9KmHLDZPh2Vgh5b8Q":{"text":"Portions are way too small and quality average at best. Would only go back for the beer. C","useful":0,"cool":0},"3YkZg-U0Bwm8l-FQokppnA":{"text":"Great food. Great people. Keep it up. Order the cajun platter.  Perfect red beans and perf","useful":0,"cool":0},"3_nTWdZMUQe3oEAE9XwBBg":{"text":"I was going to give the restaurant the benefit of the doubt and add a star, but in good fa","useful":2,"cool":0},"xY_Ots8DW1Rtt4_miWHtSQ":{"text":"Great bar atmosphere!!! Bartender Billy gave us some great suggestions of places to go and","useful":0,"cool":0},"hF6Gw10gUiGCwlmlXWwMZg":{"text":"Pretty good food. The drinks are decent.  I recommend going during the day for a drink and","useful":0,"cool":0},"ruVqMlr2_XfUApW8emgCkA":{"text":"Pretty darn good food. Fast service. \nClassic New Orleans food. Located right in the middl","useful":0,"cool":0},"R0xXcZnZk-T-p3Yg7YJIUg":{"text":"Good food but slow service. I loved the oyster po boy. Our waiter took forever to bring dr","useful":0,"cool":0},"Cono7oF5_NrjJhpBAzpNJg":{"text":"Absolutely delicious, everyone in my party liked their food. The drinks where great, with ","useful":0,"cool":0},"_M1npRVbv-rEA8kcdp0ElQ":{"text":"\"Do you serve gluten free food?\" \"Well there ain't no bread in jumbalaya\"\n\nThis place was ","useful":0,"cool":0},"o1ijskgjOB85qZv73YrZsg":{"text":"I was in the mood for red beans and rice with fried chicken and it's hard to find that on ","useful":0,"cool":0},"uou7_80EO_i-5ZzwqyvHQg":{"text":"We stopped into Cornet for a bite to eat for lunch.  I decided on the shrimp poboy and my ","useful":0,"cool":0},"6nEYqdeWhmxUWQY6BOhC5Q":{"text":"Last minute dinner plans we came here. They opened up a back dining area for our group of ","useful":0,"cool":0},"-tTW7onhZD2QVajQ2tmgeQ":{"text":"Good food, fantastic service! \n\nOur server was friendly and funny, and everyone there was ","useful":0,"cool":0},"JM6f554jLJa_CN6T4AqlHQ":{"text":"Don't let this bar's location on Bourbon fool you, it has legitimate beverages and food!! ","useful":0,"cool":0},"65-mDsVpUQTZUH-T5WZujw":{"text":"We had an awesome late dinner.  The food was fabulous!  The service impeccable.  The crab ","useful":0,"cool":0},"UYw86dbaWiamKE7LNKaNMg":{"text":"My Mother, fiance, and I were visiting bourbon street and this is the first place we stopp","useful":0,"cool":0},"e7PQ8ppIKpxgJSc25w2FTA":{"text":"Came here after exploring Bourbon Street; seeing all the street performers and partiers re","useful":1,"cool":1},"I3ZSTKJQPbvHah8yvdM_Nw":{"text":"Heather did a great job recommending the blackend catfish as a substitute due to me having","useful":0,"cool":1},"LWp4dYkvDHsFodjnWUMv4Q":{"text":"I haven't tried all of the food but if you sit out on the balcony it tilts a little bit an","useful":0,"cool":0},"jNG0E5AF2f5waGyOpL1xeg":{"text":"The venue was clean and the service was normal - nothing exceptionally great or bad. The p","useful":1,"cool":0},"fUFH5UqwJUOtLDr6jGc5Ng":{"text":"Stumbled upon this place exploring Bourbon Street, first time in NOLA. Let me just say tha","useful":0,"cool":0},"WFHq4Wxlf1MCu3EcS3bjXg":{"text":"This place has the best red beans and rice in town for sure...we might come back before we","useful":2,"cool":0},"_Hsd0lSGYfJi3Bs1uvkorA":{"text":"My first authentic Po-boy sandwich down south. It was a crowd pleaser. A lot of beef hidde","useful":2,"cool":0},"0w-KUGrbmvKnUZaawPn2mA":{"text":"This place is truly great. The food was so awesome that we came back again the next day be","useful":0,"cool":0},"tpLBMe1kYY9cWz6sssYq0A":{"text":"We spent a week in New Orleans and this was our favorite place to eat and drink! We had a ","useful":0,"cool":0},"K_cv4VU46Y2HLn_fd1yTmw":{"text":"The food was mediocre at best. The table of 4 next to us even sent their food back and lef","useful":0,"cool":0},"O0jftsqC9Siu8a_SvYrSAA":{"text":"Not real sure what some of these negative reviews are talking about.....recently ate here ","useful":0,"cool":0},"XZzP49gPIJrHmMeq4ylQKw":{"text":"Food was subpar and overpriced. The burger tasted like some from the frozen food isle, not","useful":1,"cool":0},"Fs6GV5nPZ1C-1-urbsqaJQ":{"text":"This was a great restaurant!  Dustin was a fantastic waiter!  He was personable and went a","useful":0,"cool":0},"nAFNe8LHMFmeZAD5rEa9-g":{"text":"One word....Horrible!!!!\n\nFood took over an hour to come out....finally came out cold and ","useful":1,"cool":1},"-csHd2eVg096cVSn11_Sxw":{"text":"Great location. Overlooking Bourbon st. Ordered crawfish etoufee  that had great flavor bu","useful":0,"cool":0},"XujO-blk66t4ok6OpidGuw":{"text":"Atmosphere is obviously top notch with a spot right on Bourbon Street. Having had Cajun fo","useful":0,"cool":0},"fWq65UekcoSoQC59XStifQ":{"text":"Stopped by Cornet while walking down Bourbon street for a quick meal. We sat on the balcon","useful":0,"cool":0},"nn1190WnQ3SX_R1zulle1g":{"text":"Nice location, decent service, not so good food. Location is the only redeeming factor her","useful":0,"cool":0},"w1lZK7zRAxP1wxZEcu_QvA":{"text":"Best food so far this trip!! Service is on point. Satchmo Sampler has the best fried green","useful":0,"cool":0},"nMpDDJNtiloB7gVg9mb9tw":{"text":"Meh is about all I can say. We ducked in here to try and beat a little heat. We had the sa","useful":0,"cool":0},"NnXRigQC9mw36v99GU0DUg":{"text":"Pretty good place! We had two very friendly, very helpful bartenders. Nice location. You c","useful":0,"cool":0},"hOK1iIijqc4zVBMBN4-KiQ":{"text":"Fist stop in Nola for food. Was super excited to try out the food here. Heard that the gat","useful":0,"cool":1},"yU_mmULet3QdgR1IC1XZYw":{"text":"Pretends to be upscale, but it's half empty for a reason.  2 stars for the Big Ass Beer, b","useful":0,"cool":0},"nXo3KlEDBx7xhS8FfwcNuw":{"text":"The balcony seating is what I came for.\n\nThe crawfish mac and cheese was the BEST!!\n\nGumbo","useful":0,"cool":0},"Nj_pH6Jzuk_RsLzAc9TulA":{"text":"Went here for authentic New Orleans cuisine. Left with a bad taste in my mouth and a thin ","useful":0,"cool":0},"m6TwO_qi9IXk2M4McYH3gw":{"text":"Great new spot! (For me) I used to live in town and hadn't gone to Cornet. It's a cozy bar","useful":3,"cool":1},"d8rGP4bjtS4m6arK1uTFPg":{"text":"This bar is amazing. Great service, great bathrooms. The door guy is the freaking MAN.","useful":0,"cool":0},"Cym9YYa-PN5frsgXGyl2Ow":{"text":"tourists be careful here!  we are from out of state enjoying the fun bourbon street energy","useful":0,"cool":0},"NnLJRtdmJdP4r6VZQcc57w":{"text":"I went in a week and a half ago and i absolutely loved my bartender Jennifer!!! She was so","useful":0,"cool":0},"eQb9tVcEU3ydIqeUQ-ZWPw":{"text":"I ordered the $20 Mac and cheese and I'm pretty sure it was Velveeta.  Very disappointed","useful":0,"cool":0},"37ZSyCwUYSPhdodPLyKV8A":{"text":"Ideal location in the heart of everything.\n\nThe service here offers dining at the bar and/","useful":2,"cool":3},"woGAgDTD-i0VEjYs_OV1Ow":{"text":"We were there on a sunny warm day and enjoyed the patio. Got the garden salad and the shri","useful":0,"cool":0},"8WhQm8YlFr5CSaFDPE-iGw":{"text":"Achtung Touristen-Nepp. Miniportionen zu überteuerten Preisen. Das \"Shrimp Creole\" hatte d","useful":1,"cool":0},"u15IySaLa6oHbzg-40zKLA":{"text":"Soloman was very nice, but the servers were very unorganized and the drinks way overpriced","useful":0,"cool":0},"y9wltZBnpK71sVA_4ZPv1Q":{"text":"We went here after seeing the line for acme oyster house was out the door. We should've ju","useful":0,"cool":0},"YS2Tyktrno4j2ua2pIR8BA":{"text":"Stopped in here for a quick drink and a huge ass beer for my husband.  Ended up wanting a ","useful":0,"cool":0},"TVxGqQ3y6MIIBXFAG6eX-Q":{"text":"On our trip, my wife and I were hungry and wandering the French Quarter when we came acros","useful":0,"cool":0},"TdfAmMW5cjcDFnZwMT4pKA":{"text":"We are here for dinner. Just drove 13 hours from Iowa City and Mya is amazing!she's so nic","useful":0,"cool":0},"jsiS2FFGfjJCPGG6vAHorw":{"text":"We had a great dining experience with a fabulous server! Jasmine was awesome and so attent","useful":0,"cool":0},"oHppr4MG6AinXQP-YIPjpA":{"text":"We had to wait for service and it was rather underwhelming. They didn't seem to care if we","useful":0,"cool":0},"FCfJ_cEDIhozIbSTtG2t1A":{"text":"Walked down bourbon street for 45 minutes looking\nWyatt was our bartender/server and hones","useful":1,"cool":1},"AEs4j5JZnGypsokhqrNsXQ":{"text":"Dustin was our server and he took great care of us!!!! Super friendly and understanding","useful":0,"cool":0},"PKluvNOc6dNhMODj0SLFrA":{"text":"Cornet has great food and a great staff.  We loved it so much we eat there multiple times ","useful":0,"cool":0},"SsXswanGHVDNMaWqR2-_Qw":{"text":"Natalie behind the bar is kick ass!! This place was awesome from the service to the food!!","useful":0,"cool":0},"NMU1jgozsfe7WI-w6UeRpQ":{"text":"My boyfriend and I drove cross-country this past weekend from California to Florida and wa","useful":3,"cool":0},"rN5JvAQcfauIhsXH8YiCbg":{"text":"Long time to serve. The gumbo oily and watery.  Save you money dont come here.  Jambalaya ","useful":0,"cool":0},"fF0fs83RYRq9FXMdVF4IVg":{"text":"This place was great!  Bartenders were super nice and the door guy was really accomadating","useful":0,"cool":0},"6YbOaHTbLnAtIT_VvBMUdg":{"text":"Stopped in for drinks on a Saturday night, and the place was nearly empty. Ordered a Mosco","useful":1,"cool":0},"ERcLM6hqR4IFsa-pQ3LbqQ":{"text":"I was in New Orleans for a Christmas holiday with my mom. We were having trouble finding a","useful":3,"cool":1},"fZQDDYhYNwihL1IOMy1gxw":{"text":"Great salad, good pork Loin, gumbo/jambayla def needed salt but then was great! Felt this ","useful":0,"cool":0},"GqYBVp6YavndovGw45thWQ":{"text":"Not super impressed with the food or the service. On the fried platter that I shared with ","useful":0,"cool":0},"ReNn2cv3qEwade6ewKfFoA":{"text":"My po boy was dry also the waitress short changed  me by $3.88. She never came back to the","useful":0,"cool":0},"2UhJRVw2B0T202nB5StRZg":{"text":"Stopped her for dinner our first night in NOLA. Sitting on the top deck patio gave us an a","useful":0,"cool":0},"bA003eqD6AtpfxriG4IYsw":{"text":"There was good and bad. I had the pulled pork sandwich, it was great, very juicy and flavo","useful":0,"cool":0},"gmECVynVKl5BqEpJBMCUwQ":{"text":"Do not give this place your business. The doorman refused to assist a young man who fell f","useful":1,"cool":0},"nTI82v7qFv434AzaQwJc7w":{"text":"I took my daughters for a girl night evening meal and was extremely disappointed! We were ","useful":0,"cool":0},"19QTrJeWzUM8TGMmCiwhbg":{"text":"After reading the reviews I was skeptical about checking this place out. However, in light","useful":1,"cool":1},"5kmr6d7CmUQDf92SE1FNTg":{"text":"As soon as we walked in the door we were greeted with a smile and friendly service.  The e","useful":0,"cool":0},"wWdhSCHXFWbV1SjnsIDuwA":{"text":"The menu has some definite solids: the crawfish etouffee has just enough spice, the bloody","useful":1,"cool":0},"6GHq3LLpKQDlfVrfmsOSDw":{"text":"What a great restaurant. The Oyster poboy and red beans and rice were spectacular. Highly ","useful":0,"cool":0},"-fg-7y4wYFU_kUBuqoC-fA":{"text":"The Cornet is outstanding. The food is absolutely delicious!!! The Bartender Sadie is a ma","useful":1,"cool":0},"x_4KEuzS3EmRCDXiBTp8wg":{"text":"We had a Poboy. Awesome!  The crab boil potatoe salad was to die for. Thanks, Amber for be","useful":0,"cool":0},"oP1omhznJZXimFmzbVet9g":{"text":"Three stars but mostly for the location. Service was slow and not  really concerned if you","useful":0,"cool":0},"qWje3aE-Rkq98KMglGNuGg":{"text":"Authentic Cajun and Creole cuisine! Best Bloody Mary and view of Bourbon street action!","useful":0,"cool":0},"wSQ4lY-CRjw7Pqnegb3vbQ":{"text":"Stopped in for dessert - chocolate mousse cake and banana bread pudding. We sat in the bal","useful":0,"cool":0},"BYauqgCRna-1Z7Mk8W4QKA":{"text":"Walked right in for a table. Great service and view of the happenings on Bourbon. Food was","useful":0,"cool":0},"vOdzfWtDYUFIyU6m8HSUrQ":{"text":"Place was recommended; Keep in mind they feel they are a high class place; Actually we wal","useful":0,"cool":0},"Qd9twB6kGDbsJ_1Ptp8teQ":{"text":"We came to cornet for a bachelorette party and it was one of our favorite spots. The blueb","useful":0,"cool":0},"a1v7kTYaQ1ySs3D6Xe6U8Q":{"text":"Nice bar. Expected more from the food. The service was nice. Portions are really small. Gr","useful":0,"cool":0},"BUSjFC1nValZg-1KCbiy8g":{"text":"Stopped in for lunch and was slightly disappointed. The Boudin balls were tasty. The macar","useful":0,"cool":0},"kpVk0jovuRC_2Uooe6NJTA":{"text":"Only bar on Bourbon Street where the bartender wished us a good night and to \"be safe\".","useful":0,"cool":0},"fJaR_l9qXpWjTbL_RogGIw":{"text":"My buddy and I had a great meal here with a wonderful waiter! Drinks are extremely expensi","useful":0,"cool":0},"7ZtsAsv18DGtLL2WnPEVHg":{"text":"I stopped here while drinking on Bourbon Street! I had a cheeseburger and fries with choco","useful":0,"cool":0},"0QvsPmk1P9kqOE4qb_tizQ":{"text":"My friend and I walked into this restaurant as we were walking down bourbon street. The at","useful":0,"cool":0},"JwdzdNE22zv7KyfenGxDdQ":{"text":"While galavanting around New Orleans on a lovely Thursday morning we stopped at Cornet to ","useful":0,"cool":1},"3dEdP1IHjjs-UI4iR-lKEw":{"text":"Its just not that good. Definetly tourist trap. Jambalaya was essentially cajun rice with ","useful":0,"cool":0},"m0seQUcqbLxWs-WD09PlCQ":{"text":"Good food, good service ! Even on a busy night. I had sum fresh watermelon drink...super s","useful":0,"cool":0},"OTvCHR4yNnA9yc3nVwv1DQ":{"text":"Great menu options. A little on the salty side, but overall good. Great for groups or fami","useful":0,"cool":0},"cJEK9723iAqni15Uwl6_7A":{"text":"Walking down bourbon street looking for a lunch spot we were pulled in by this tall, long ","useful":0,"cool":0},"DxWANTo9QrcK-lBrc098YQ":{"text":"Over priced drinks were watered down Jennifer was arrogant and complained of her 15% tip o","useful":0,"cool":0},"zjAremgesm9UOqJRAq48rw":{"text":"Nice customer service. Sat at the bar for freshly made drinks; water melon cooler and blue","useful":0,"cool":0},"GySBG_dQ2b4SFvXF66FCeA":{"text":"The site is amazing, we ate on the upper deck and it was stunning. My order the big ass pl","useful":0,"cool":0},"SFbfu-Ior91lMPyizXoGPA":{"text":"Pros:\n*they let you bring in drinks from outside\n*balcony overlooking bourbon\n*aesthetical","useful":1,"cool":0},"LLc5ItuxdzCJb95jcdQbWA":{"text":"We ate here while on a food tour with Taste Buds. We ate delicious jambalaya!!! It was a b","useful":0,"cool":0},"81G994uD8of8mXDrXFQ2Xg":{"text":"This place was..... ! The service was great! You gotta try their beer with the Tour of New","useful":0,"cool":0},"SL7zto5vIoEJgfuC2A831Q":{"text":"I liked the overall ambiance. It's right off Bourbon st and has balcony seating. The waits","useful":0,"cool":0},"eBwH0vxZKNIn2eETChb2dw":{"text":"Stopped in for a quick bite. Red Beans and Rice. Not a tough dish. Sat at the bar. Bartend","useful":0,"cool":0},"PI9g4kQYLPnZXShyZIE3kQ":{"text":"Authentic Cajun and Creole cuisine! Best Bloody Mary and view of Bourbon street action!","useful":0,"cool":0},"xC_r0704oZ4mUGA6v87ePg":{"text":"We came here on a Sunday evening mainly because the wait time was a lot more reasonable th","useful":3,"cool":2},"r0txFNYpwpR50L50Gixdyg":{"text":"Decided to grab dinner at Cornet with my girlfriend before getting the night started. Serv","useful":0,"cool":0},"R0ok0ZWDlyui8VbiUirOEg":{"text":"2 stars because food and drinks is overpriced. Drinks is not good, not strong. Especially ","useful":0,"cool":0},"ak945H9cLPP-lofydkGmWg":{"text":"We had some jambalaya and gumbo and some other dishes that were excellent and the food is ","useful":0,"cool":0},"99-a-ArRlq6lwjvvJ74AsQ":{"text":"Our server was an elitist - upon showing her my discovery she swiftly grabbed my plate run","useful":4,"cool":0},"B3bBq03lt0LnHfgffaKYvg":{"text":"Found this restaurant and decided to give it a try. Not much in terms of vegetarian option","useful":0,"cool":0},"UpChv-OTupsLAfI_n6arQw":{"text":"Tried this place with a few friends for lunch. Restaurant offers indoor and outdoor seatin","useful":1,"cool":0},"rtoXHiX2PtoMs4JkbeKEXA":{"text":"Service was excellent!! Shrimp Po Boy and BBQ shrimp was great. Bloody Mary and Coffee wit","useful":0,"cool":0},"bTuE03dtxJyFHgSMmZlx9Q":{"text":"WHY WE WENT HERE:\n- difficult time finding a place for dinner that would give us \"Southern","useful":6,"cool":3},"2QEVWfQBmCRlmDkzCAc93Q":{"text":"Ambiance great, drinks are top notch, food... overpriced and far from flavorful. Come visi","useful":0,"cool":0},"AKuvAZM9gxGhy2rPOTzaPA":{"text":"Amazing food!!  I am extremely picky when it comes to restaurants. I must say this is a 20","useful":0,"cool":0},"BK7FWHa3dfM4lxygx9OYpw":{"text":"Worst place we have been in New Orleans....friendly servers, but terrible food. No flavor,","useful":0,"cool":0},"rLKPklfCLjo4vyXkCqDLSA":{"text":"Decided to try this place after being harassed by doorman every time we walked by. Service","useful":2,"cool":1},"0fXuq0o09dXBdZHhjRoKhA":{"text":"Best drink in New Orleans Bluberry hill, ( made with fresh smashed blueberries and vodka i","useful":0,"cool":0},"Ve7smXaBbdDzbaXV37JjPQ":{"text":"Well...service was  not as friendly as other places have been. The server seem bothered by","useful":0,"cool":0},"VoyE0GeNAX1ah_z3QIg8dw":{"text":"Ordered the Satchmo sampler: jambalaya, red beans and rice and gumbo. Horrible is the only","useful":0,"cool":0},"hTxji_A5VEoV2BTuPLagrA":{"text":"Do not give this place your business. The doorman refused to assist a young man who fell f","useful":1,"cool":0},"v04l-tnMxDd91yu2_NLtwQ":{"text":"Great place to have a couple of drinks and the food is great, especially the red beans and","useful":0,"cool":0},"LaFEoNYYkYuvqwSBhP0drw":{"text":"On the positive side, Coronet's food is tasty, and the staff is friendly. On the downside,","useful":0,"cool":0},"mWCXLTHQv1LHGjt-RTEcaw":{"text":"Very delicious food, but make sure you double check your ticket before you leave. Our serv","useful":0,"cool":0},"IMm94htj-ext1Rh8AJqDXA":{"text":"I wish I could leave zero stars. This place is down right awful from the food to the servi","useful":0,"cool":0},"DKsyShPzVwuV8HUbWSqn_g":{"text":"Came here for a simple bite to eat and a drink. Had the po boy shrimp sandwich and a coupl","useful":0,"cool":0},"UDZ0VGf5YfbXmHZrtOmxng":{"text":"Being at New Orleans for our first visit and first meal, we could not have picked a better","useful":0,"cool":0},"9LKzT_6HM_EGpvCkzZ-flA":{"text":"Cornet has a primo spot on the overrated Bourbon St.! Nice place with live music. Decent m","useful":0,"cool":0},"WyLqM2EaULPS30BAp23c3Q":{"text":"Don't give this place another thought very week drinks poor food and service","useful":0,"cool":0},"fav7IGLm1lWBHy1sWIjHdw":{"text":"The service was awesome. The food was amazing especially the Nachos, and the drinks were i","useful":0,"cool":0},"-4Bcc3-SJD1ffMGkj7sMyg":{"text":"Don't say you heard it from me folks, but BYOB... That's right boys and girls: Bring Your ","useful":0,"cool":0},"ay-9Wqj31pXMrGcWxnxGIg":{"text":"Had an amazing dinner and drinks on the outdoor balcony. The tacos were delicious and the ","useful":0,"cool":0},"oA9krlFgU7rtlogjdiRbpg":{"text":"On my last day in Nola, my weekend partner in crime L and I were off to find some lunch be","useful":2,"cool":1},"rmMGSxaVgPfNP7t-fT-MIQ":{"text":"We decided to try this resturant because all of the good resturants had super long wait li","useful":1,"cool":0},"cYXd74SEOIgq9hraOoDUXg":{"text":"I hated the food. It didn't have any flavor at all. No one out of six ppl liked their food","useful":1,"cool":0},"fqq0qFYLQFkWEmo1vLW69g":{"text":"The absolute best creole food I've ever had!!! I'm from California so I had no clue that I","useful":0,"cool":0},"2jIoOek7EuHH93heWafA_Q":{"text":"We only came in because of the doorman. Kudos to him, didn't catch his name. The balcony w","useful":0,"cool":0},"1wUAdbVcEp9UOZhmOXe5zA":{"text":"Sit up on the 2nd floor balcony for some of the best people watching on Bourbon Street! It","useful":6,"cool":6},"06e5lAJNuHr6uP0tVGw4Qw":{"text":"This was one place that we kept on coming back for drinks. The bloody Mary's at this place","useful":2,"cool":1},"BFLQEaPfhgmYUYb1LdPB_g":{"text":"The establishment pictured has the most rude ignorant server at the door. My friend and I ","useful":1,"cool":0},"njVakXWAsB2aYirpNq7_eg":{"text":"We stumbled in based on the menu & our mood. Requested to eat outside & was directed to th","useful":0,"cool":1},"yu_vCHy2nbE6XXPNNwqoaw":{"text":"I don't yelp often, so take this for what it's worth.  I think I've reviewed less restaura","useful":0,"cool":0},"e0Xe_HwViMl3tb52od6tSg":{"text":"Just had a hurricane which was yummy. View of Bourbon Street is great from the balcony.  D","useful":0,"cool":0},"JoHrx6eZI6pDExZ7CM--iw":{"text":"Service is lacking! Balcony dining is great for the views. After appetizers were delivered","useful":0,"cool":0},"WE3mAEliziKLYyQI5jFuSQ":{"text":"This place is a must on my list when in the Quarter!!  I rarely go to the same bar twice i","useful":0,"cool":0},"PE-6yQwGZmH8KgIzqQdnvA":{"text":"Dustin was amazing! Our bachelorette party had a great time. The food was good as well as ","useful":0,"cool":0},"9_vQ3XW6tNwJ_JR1L2UX1A":{"text":"We had an awesome experience at Cornet! The food was SO tasty and they were very accommoda","useful":0,"cool":0},"CI1y5A6FX-aCQRyO1RFyVw":{"text":"Went twice during our trip to New Orleans. Fred at the door was the sweetest. Desiree was ","useful":0,"cool":1},"rn8slGFrCM32Cl_pQyl-Iw":{"text":"BEST SHRIMP EVER! If you go here you have to get the Shrimp Trio (it's an appetizer, but I","useful":0,"cool":0},"MIUYxdwjaGw01TbqangNTw":{"text":"Gumbo was good. \n\nChicken was weird/odd. \n\nHush puppies were awesome. \n\nJubilee shrimp was","useful":2,"cool":0},"tHdJMvHFrZWvj8ZIC5QFcg":{"text":"We were excited to try this place and more so to enjoy the view of Bourbon Street from the","useful":0,"cool":0},"1xCGMLj16tbq3imBN73IUg":{"text":"So I'm not experienced in this whole Bourbon St. business so I had no idea if every bar is","useful":0,"cool":1},"NC3miivRbH2Wo208lpM9Iw":{"text":"Maybe it was because it was Christmas Day and staff didn't want to be there, but I doubt i","useful":0,"cool":0},"i8cCT_oQT8zzUgtZP5MJvg":{"text":"The positives: 1) Good value for the money. 2) Great service from Ajay. 3) They had the 49","useful":0,"cool":0},"QRnLH-54m5pLqg_vFSsL0Q":{"text":"Thanks Taylor for being a great server and anticipating our needs! I never waited for a dr","useful":0,"cool":0},"6SKvJsVq7Gtmbrgi_OhgcA":{"text":"Great food! Bartender/server Taylor was awesome! I have not been to NOLA since Katrina, ju","useful":0,"cool":0},"Z8BdTXvJhqaCh28cTVjJfg":{"text":"Food? This bitch is hittin'! Enough said! Our tummies are happy! . The fries even slap.  Y","useful":0,"cool":0},"p0Maf5Au7vGh8x1qiELlEw":{"text":"The patio was great. The food was meh. The hostess was great. The server was ok. We tried ","useful":1,"cool":0},"RUhlZi3IGyteGVLVvcsbBg":{"text":"Great place. Amazing patio views, definitely get table on the galleries. Gumbo soup is the","useful":2,"cool":1},"VkBYYdNO7cHctHIPD79CFg":{"text":"Perfect Bloody Mary! Oh my. Teena recommended, and it didn't disappoint! The Boudin Balls ","useful":0,"cool":0},"_EXgB2uDLYpbhyBwmPieQA":{"text":"We stood at the podium at the door waiting for ages to be seated, other people seated them","useful":3,"cool":2},"P0bKk782ePZQV6xalchfvg":{"text":"Nostalgic bar on Bourbon Street. Great bar service, while watching shenanigans walking by ","useful":1,"cool":0},"OzaQVqlNukcSknym3K2gUQ":{"text":"Great service but food quality was terrible. They clearly are relying on their premium loc","useful":1,"cool":0},"XjXuWLP7CDBmAQ9UIA5T3Q":{"text":"Good food & great service! Sat in the balcony where we could smoke, enjoy the food & scene","useful":0,"cool":0},"c4mElRx3TsYAjVX4IoUChQ":{"text":"It was cold and rainy outside so we stopped in this joint for a bite... it was extremely d","useful":0,"cool":0},"q7ntVj2K7QSDLUyEXGxg-w":{"text":"Well some people already mentioned it, it's a tourist trap at its finest small portions an","useful":1,"cool":0},"o9oW-Smwco2NgEcf7k2HVw":{"text":"They have a limited menu right now but, the drinks and service was amazing! Cheers to Tayl","useful":1,"cool":0},"mu-_9vdDr_TRZl785cGcQw":{"text":"Cool experience for the huge ass beers! They have a balcony that overlooks Bourbon Street ","useful":0,"cool":0},"aLQZUTSjxBQroaJGdAZ3sg":{"text":"Our experience here, on a Wednesday night in the middle of Covid times, was wonderful. The","useful":1,"cool":0},"TYpA3xvW70FgSBcbb2UN_A":{"text":"Nice little spot on Bourbon St, the crab cakes were absolutely phenomenal. The pastalaya w","useful":0,"cool":0},"1097fRsC45iWxaGL7sedXw":{"text":"Not good. Would give zero stars if allowed. Service was awful, food was terrible. Most gue","useful":4,"cool":0},"kw4GVIpZ3aUIM3wBu54VhA":{"text":"Our food was spectacular! Visited on whim last Saturday night. Service was excellent. Abso","useful":0,"cool":0},"xMtGDd8oZEV_kswsPnk47w":{"text":"We went to this bar on Saturday night before the Niners/Saints game. It was full but we ma","useful":0,"cool":0},"dNCn9nA3Hp00vHEWQFsSrQ":{"text":"Tried the sampler appetizer and everything was good. Had the fried green tomatoes too, and","useful":0,"cool":0},"9i2Wa9qeUDRMFxrlAe6Upw":{"text":"Cornet, a casual restaurant, owned by a family who gave Louis Armstrong his first cornet. ","useful":0,"cool":0},"8lzGVdf7b05jUCj0U0f2zQ":{"text":"Over priced typical bourbon street tourist trap. Food arrives within minutes of ordering a","useful":1,"cool":1},"2z6t87EenN9Eanuqair9xw":{"text":"This honestly was like the worst experience ever, the food was not up to par with what was","useful":0,"cool":0},"vRUxx137gewMTuYqYQUK7A":{"text":"My wife and I had the Satchmo sampler, a Huge Ass Beer, and a Half Assed Beer. All were ve","useful":0,"cool":0},"UUmWWAetZv9_HiSVnoX54A":{"text":"Stopped for lunch to get out of the rain.  Sat at the upstairs bar to get some food and dr","useful":1,"cool":0},"9mtSTv3i51RY7Av9UpTXUQ":{"text":"Just got to taste this venue at the yelp Bloody Mary bash and they were amazing friendly p","useful":2,"cool":2},"EsJTKYHNGfk5BR8GaoPMkA":{"text":"Stop in for a quick bite and people watch from the balcony!! Waitress is sweet! \nChicken w","useful":1,"cool":0},"ldwsz5SwqlULOQkXSc-eqw":{"text":"Reynard is the man! Complimentary drinks and a great patio on a bustling street. Love this","useful":0,"cool":0},"1aL1mcVXn8MP2FVBd2yjhg":{"text":"Super cute looking on the outside... sadly the food did not live up to the atmosphere. Thi","useful":0,"cool":0},"fCeaX5JI4iAj3wGA-_U3Ig":{"text":"We traveled from Boston for the WWE Wrestlmania, Raw and Smackdown and this place was the ","useful":0,"cool":0},"0n41F8nQ85aFrGTBIUWEhg":{"text":"First time visitor to NOLA. We just happened to stop here to grab something to eat. \nY'ALL","useful":1,"cool":1},"UdEi3sWxToCFz7SvHgHvsA":{"text":"I came in because of the fantastic energy coming from the inside. The Super Bowl was on an","useful":6,"cool":7},"7PWx4-fi5S-OqxbdjrFUWw":{"text":"Horrible ! Wow what a crappy experience. \n\nWe came here with a 8 person party. When I sat ","useful":2,"cool":0},"_m4KTw5p5eqti1v8vcSE8A":{"text":"This place is AWFUL. We ordered a Bloody Mary, a Bud Light and chicken nachos to share. Th","useful":2,"cool":0},"lIxU5X1EcIOViCb1jMRbmg":{"text":"Khalifa is the best. My cousin is the pickiest eater and he spent 10 very patient minutes ","useful":0,"cool":0},"LLRGEpq7qNZmb6XuRpxaww":{"text":"Came here to sit on the balcony upstairs! Great views...but then it went down hill. We wai","useful":1,"cool":0},"bv6coKGzk957v8T2jMJ58A":{"text":"Really good food. Service was great!  Perfect view of bourbon street.  Great part of the F","useful":0,"cool":0},"PdphKT_GkLpALHPU8jt9Cw":{"text":"We sat on the balcony and had the perfect view of Bourbon Street and all of the people wat","useful":4,"cool":3},"-W6QQ20PeQlkNmIYnGKQKg":{"text":"Super tasty food and drinks. Wonderful staff. We loved the balcony dining! I highly recomm","useful":0,"cool":0},"BqPT2zjWsY4YkdWvklu_4g":{"text":"The food is very bland. Overly fishy seafood and bland gumbo and jambalaya. The only redee","useful":0,"cool":0},"fGe-eZcRozI-Ja9K4bBS-A":{"text":"Excellent service - Thanks Theodore! \n\nWanted a place for some light bites and drinks and ","useful":2,"cool":2},"TzeQLwnKLl-nBjIRwTkNpg":{"text":"My wife and I stopped for a late lunch today. The food was ok, not much flavor. The server","useful":2,"cool":0},"E9IfoBGIz_5pYkty4QGS6g":{"text":"Stopped in for one of my absolute favorite drinks, Pimms Cup. I am so happy this restauran","useful":1,"cool":0},"SWZ5zxIGJVvZl5V-6nHgjA":{"text":"The 5 star review is based on the Bloody Mary, view, location and service. Food was okay, ","useful":0,"cool":0},"_efmQ3dax1OCCwxNKmMNjQ":{"text":"Happy to know bars are still operating in this area!  \n\nTonight we hit Bourbon street and ","useful":1,"cool":0},"dFVdBTVzbWGG5SAypcFOiA":{"text":"Stopped in for a quick bite. Very nice, clean bar especially for Bourbon St. Ordered a cou","useful":0,"cool":0},"ldeOMMmuVy2nBwkj0TSMaA":{"text":"Compliment to the gentlemen outside on the street flagging down guests to visit the restau","useful":1,"cool":0},"yG8BX3pA8UA-dPUOrck8eg":{"text":"Stopped in for our last cocktail on Bourbon Street this trip and we were so surprised at h","useful":1,"cool":1},"Xic4nEGhl78Ef62VRrSQwg":{"text":"ordered alligator bite/hurricane drinks. Tried to use 50% percent off for one appetizer pe","useful":0,"cool":0},"8TUC4VyCKUBORGjpXpDzzQ":{"text":"Shout out to cookie, the waitress, otherwise I'd be giving this review a negative 10. I or","useful":1,"cool":0},"pS5mMv-QsVxetF6WcdZq_A":{"text":"Worst experience after being convinced by the guy downstairs talking to people to come in ","useful":2,"cool":0},"gQhpo_yCFo7HCboVNNKzFQ":{"text":"Good food and very accommodating.  Wish the portion sizers were larger and able to use mor","useful":0,"cool":0},"ckLN-vHlvmL4s8yHlz-CLg":{"text":"AJ was very Insightful on the food menu and drink menu. He was the highlight of our entire","useful":0,"cool":0},"GuGXQKoMpeEiRjWEwRtn1w":{"text":"After one grenade slushy we wanted to get food. This restaurant was one of the very few op","useful":0,"cool":0},"FMavkp555Gq-0q9pT1qNJg":{"text":"Check this out... we were on Bourbon Street passing this restaurant when a employee was ou","useful":0,"cool":0},"RCErBSrutMwxFLUDfQ0EWg":{"text":"I had the chance to dine at Cornet recently and all I can say is - WOW!   Everything about","useful":0,"cool":3},"LneZgPeddcrkkm18QXp0PA":{"text":"Good restaurant for the first night in New Orleans. The red beans and rice were great and ","useful":1,"cool":0},"ymn60WmvTPWAxmhcogpVeQ":{"text":"This restaurant is right at Bourbon Street, they have patio seating that you can sit outsi","useful":4,"cool":1},"_v89_LM62dkyt_xbtQuZSg":{"text":"Caitlyn was our server for 2 of our visits, she was inviting and knowledgeable of the city","useful":0,"cool":0},"C4jGUUrQ1bmjo7ndIxWkqw":{"text":"Just saw an employee (possibly a manager) dump a drink on a homeless man sitting outside t","useful":0,"cool":0},"BhMnZumla5VUCXYFsX7zYA":{"text":"I went to elementary school in the French Quarter and played in the band at my school.  Lo","useful":1,"cool":1},"NIo3EUek27EGE56SR6JXTg":{"text":"Great spot in heart of the French district on Bourbon St.  We sat on the balcony to enjoy ","useful":1,"cool":0},"2jJe2rWrzCHgnMtox_W3ZA":{"text":"Walked in on a Friday for late lunch. Sat on balcony with pleasant breeze and of course th","useful":0,"cool":0},"epsqUYRxicgSkQwXmESAAw":{"text":"Amazed by the rudeness and low quality staff they have on board here. The bartender is one","useful":1,"cool":0},"Nez7XDoafO_i2gcgXcSEdg":{"text":"Service was ok. Food was ok. Atmosphere was ok . Not the cleanest place , granted the loca","useful":1,"cool":0},"BJTFocBDCVg-FI-cDGG4fQ":{"text":"Incredibly mediocre jambalaya. Dry. Rice not fully cooked. Barely any protein. The most fl","useful":0,"cool":0},"QfHZ3VRmkpmQKH9jZrrXkw":{"text":"The staff was AWESOME! We sat on the patio upstairs and were highly attended too. So nice ","useful":0,"cool":0},"cidSzgHMkNCtrQlxPKmSAQ":{"text":"The only thing worse than the service was the food. Stood around at the desk for 5 minutes","useful":1,"cool":0},"XesOeaZ9r2-zpW8a8W7VGQ":{"text":"Dear Owner - as much as we enjoyed having a snack while roaming Bourbon street - your serv","useful":1,"cool":0},"s8NnL9fYoWDJfwkYjg1MLQ":{"text":"Favorite thing I tried here was their specialty Blueberry Hill drink. The gator bites were","useful":2,"cool":0},"6tiPDJKlJJV1HrM1R63tQA":{"text":"Everything in this restaurant started and ended with Jasmine! The best customer service Iv","useful":0,"cool":0},"3ss0j4o14Jp2GkDIaQubHA":{"text":"The only good thing about this place was that you good sir on the balcony and see bourbon ","useful":1,"cool":0},"C-5ccFjygmWtvEmHJQHmhw":{"text":"Great bar in the middle of the action on Bourbon. \nFull bar and limited menu but great fet","useful":2,"cool":2},"hzu0jmMBVnT8I8dIo3sHvA":{"text":"It took me a little bit to write this but I have to say the Cornet was truthfully the high","useful":2,"cool":2},"A7_H4YgstgS-pyQIo-aVfw":{"text":"Great experience! On a Saturday afternoon on the corner of Bourbon St, you'd expect a real","useful":0,"cool":1},"ChuXMT4-DyH2ylGbUMv1zQ":{"text":"This was a cool little spot. We had drinks outside and people watched. The bartender was c","useful":0,"cool":0},"KivmPyXqkZKA54DfNVZmUQ":{"text":"Although this nice little restaurant is a little pricey for the amount of food you get, it","useful":1,"cool":2},"y6dIfPn2t5SDkPMpkwaR3A":{"text":"This bar was horrible. The service was horrible and the food was cold. Wish I could give t","useful":0,"cool":0},"ixT4930BfRHN8niF9ROu9g":{"text":"I am a local,  but it was my first time at this bar.  A friend of mine from Miami was visi","useful":2,"cool":0},"uo3R802patD1ySrNDdc2_w":{"text":"Jubilee shrimp and the Diablo shrimp tacos were good. They had a passion fruit hurricane t","useful":1,"cool":0},"I-gRvTaB0gFhDk18gc9UpA":{"text":"Couldn't have stumbled upon a better spot. It's clean, has a great atmosphere and wasn't T","useful":0,"cool":0},"BCAVLRyrGe1U2yI3eETEDw":{"text":"After placing our order, we waited over 45 mins for our food to be served.  The food (whic","useful":0,"cool":0},"ZFcyBdGml5qHCIg4d-asfw":{"text":"Upon my arrival to NOLA this was the first place I visited and had dinner. The outside loo","useful":0,"cool":0},"uZEWU5Kgn-NqHaGK87LrqA":{"text":"My girlfriend and I were greeted on the street by a man in a suit and told there was a tab","useful":0,"cool":0},"-vbiqFAubB6SNwyMJWEOdQ":{"text":"* Vegetarian / Veggie review * I'm a vegetarian foodie that has a lot of meat eating frien","useful":0,"cool":0},"-6sZxUXWeiDyKPHXuXrNGg":{"text":"I was completely disappointed with the quality of food versus the appearance of the actual","useful":1,"cool":0},"Nk7D4NBbXEEdML6vO6wQag":{"text":"The food was good but every other part of this experience was more than disappointing. We ","useful":2,"cool":0},"Iw15TnI-Szvt4b8W33QkdQ":{"text":"teena is the baddest server in the building!!!!! the food is amazing and the service is ph","useful":0,"cool":0},"fkmZJsZcKUDfY9E6rLkA1A":{"text":"Absolutely the worst hurricane in French quarter, unbelievably sweet.Talked to management ","useful":2,"cool":0},"7vNVUA3rx3kQmxL1rdOf0A":{"text":"We came here because of the balcony! The food was amazing! The staff is the best, ESPECIAL","useful":0,"cool":0},"uuP-vh2r6_Q3GJ3gulRLTA":{"text":"Best bloody mary I've had yet. No wonder these guys have won awards for that beauty. There","useful":2,"cool":2},"6K3_2EsoZcPA81kkuukWzg":{"text":"great service \n\nalligator appetizer is tasty\n\ni ordered crawfish ètouffée and i am NOT dis","useful":1,"cool":0},"dQiAUypN8n-r1Ln776qaTQ":{"text":"Had a beautiful dinner up on the balcony. Our waiter was extremely nice and he went over t","useful":0,"cool":0},"4Ir_NDCQlyOPoAy7jMHcFw":{"text":"We went on to order some lunch.  Ordered the crawfish Étouffée. This is a tourist trap.  D","useful":0,"cool":0},"kzMrj-qmehn_S2Dt94qUwg":{"text":"Very very bad food. \nWe had the shrimp po'boys... aweful. \nFlavorless, old crumbly bread, ","useful":2,"cool":0},"a6Do0mU_KDZdmRFZ34eezA":{"text":"No. Smh absolutely not ever again. The shrimp alfredo tasted like something frozen and was","useful":1,"cool":0},"09T1PY8vaW_q5vT67dG6Iw":{"text":"While walking bourbon street we were really hungry and saw this place to eat. A man outsid","useful":1,"cool":0},"LFwjPb519Q9kkDcGcVdSSg":{"text":"My jambalaya was Luke warm, mushy and bland. My daughters chicken and waffles came with 3 ","useful":0,"cool":0},"EE2TIbNSbtHFWbO9ZjDLIA":{"text":"The best most authentic New Orleans food ever.  I've had in my life. It was my first time ","useful":0,"cool":0},"NWT-t5shuaLgtztwi1kaVg":{"text":"This was one of my favorite spots along Bourbon. Good food, good prices. Great view for pe","useful":0,"cool":0},"gDG1RsXuHIxFm2RDMw1uAQ":{"text":"So disappointing!! We are here for my cousin birthday. Did not have any Oysters so the dea","useful":0,"cool":0},"-aurANKKCRH-bkfOY8lYJg":{"text":"This place is great fast service, quality food, and customer service is on point. We were ","useful":0,"cool":0},"cTfozHtNJpLgZAwEPOqN9w":{"text":"Great drinks, nice friendly servers and bartenders. The food is mediocre but for this far ","useful":0,"cool":0},"Bx7nWaxU92Ei8w-V29sQ-g":{"text":"Jason and Dezarae amazing bartenders never stopped!!! Team work 100%. Great service handle","useful":0,"cool":0},"I_IxqLQ2s8oXsYsjn0wH6g":{"text":"This was our first stop on Bourbon street!! We sat in here for hours! Great service and aw","useful":0,"cool":0},"bdUCL3JFQrZIxx6v2GygZQ":{"text":"This is a great spot to have a great drink. Dezarae took amazing care of our group for the","useful":0,"cool":0},"onPaxQsbnWdBt-5tvuLA_w":{"text":"Food has no flavor. If you're wanting good Cajun food....don't go here... don't know what ","useful":1,"cool":0},"lMs0dowDmOEooQv2mpznNw":{"text":"Good blood Mary\nGreat waiter\nLousy Gumbo...worse I've had!\nLousy small po boy \nOverpriced.","useful":0,"cool":1},"Bewhj4nAaFRNlybrDqMABg":{"text":"Only had the Bloody Mary but this is what a Bloody should taste like. Adrienne rocks!","useful":0,"cool":0},"E5AuJkX-U02ZuvVZ322row":{"text":"Amazing food! Teena was wonderful, knowledgable and sweet as pie! Definitely would come ba","useful":0,"cool":0},"ZgcMHCuO2SIoZfB6V-b6pw":{"text":"Made a few visits to this spot whilke in NOLA. We sat upstairs on the veranda to people wa","useful":1,"cool":0},"e25fZT1hPalQ5-2kLWY1eQ":{"text":"After a grenade, decided to stop in get some food. I had my dog with me and tried to stop ","useful":0,"cool":0},"QUChEFWQufWHBP-5OcOZZg":{"text":"Popped in here on a Saturday night after doing a ghost tour with my girlfriend. Wasn't tha","useful":1,"cool":0},"h6wqyCIm8Sfsbok5BaL44w":{"text":"Great Place with Fantastic Food. The Crab Cakes and The Cornet Burger is Absolutely Phenom","useful":0,"cool":1},"0JVn82W7XHlwkL9H5ksV9Q":{"text":"Cockroach near the entrance to the upstairs bar. We didn't order any food after seeing thi","useful":1,"cool":0},"2tSQVxiiPOQ3Dhc7Qy2NJQ":{"text":"I'm sad writing this review. We have been to Cornet every time we visit Nola and it was al","useful":1,"cool":0},"A-s0O4QH9wrf5K6Lf3ugbA":{"text":"I sat outside on the balcony and absolutely loved the ambiance. Looking out over Bourbon s","useful":0,"cool":0},"f6oTjdubzWZUrEQWruVx-Q":{"text":"Great little break from Bourbon Street. The server could not have been nicer. I was SO hot","useful":1,"cool":0},"WpoUnfEPcmKANNcQmUIowA":{"text":"Ladies and gentlemen keep it moving from this place. Horrible service and mediocre food. W","useful":1,"cool":0},"Fk45dKqFy9ho_heagW5B5Q":{"text":"I visited Nola for the weekend and wanted to hit up as many restaurants as possible. What'","useful":0,"cool":0},"4RWeh9AL-XLu-MRpJwgwsA":{"text":"Aj was amazing!!!! Food was bomb. History of place is xool as shit. Highly suggest if look","useful":0,"cool":0},"rNHyi5T7DV2_EjORX2vcMQ":{"text":"We visited her today after hearing great reviews on the food. As expected, they were short","useful":1,"cool":0},"cB2GpDexz9GTTwdrm-DXnQ":{"text":"We had a great dinner here last night with great service, but it was loud at our table nea","useful":5,"cool":2},"MaEFJSDDLOlMOTE7NKmtQQ":{"text":"I enjoyed my meal, but the menu wasn't very expansive so if you don't eat meat this defini","useful":0,"cool":0},"c7wEZ7PdV1TDusbRkwmlLg":{"text":"Really good food!  We had the boudin & andouille sandwich, both were amazing!  Cashier was","useful":0,"cool":0},"GAktagV1zarrPgzWgg38xg":{"text":"The food was great and the service even better. We liked the shrimp poboy and jambalaya. O","useful":0,"cool":1},"iZTCXjTvfj1SIjP3t02Pnw":{"text":"Two words...not good!   Don't come.  Hot foods are severed cold!  Only come for alcohol.","useful":0,"cool":0},"LW6YV1IaLm5fua7Oj2FKRg":{"text":"Update: apparently the greens have pork in them, so stay awayyyyyy \nOnly thing here for ve","useful":0,"cool":0},"wDTP7kB6Hbi-rFKCjSLsqg":{"text":"I've never left a single review of any place ever in my life but this place served the wor","useful":1,"cool":0},"HQYecnvFNTSu2iw849UKiQ":{"text":"Don't waste your time on this one. The staff was very friendly, but the food was lackluste","useful":0,"cool":0},"hGRTOHb7I8Qr8ICfqJImkw":{"text":"We had a great experience at Cornet! We stumbled upon this great place while we were looki","useful":0,"cool":0},"eeBdpVake195PbqekwGtIw":{"text":"High prices for small portions and average food ...............  just not what I was expec","useful":1,"cool":0},"QqgkFfJIygxgUxVvvV8eqA":{"text":"The family that owns this place might have given Louis Armstrong his first horn, but our s","useful":1,"cool":0}}