{"emqqMuORdgzUu2A64RJTag":{"text":"GymMatrix is a fantastic gym! The machines are always clean, the staff is very friendly an","useful":0,"cool":0},"N6kBlzQcMBoqCUSrG2B0mg":{"text":"I've lived in the South for a year and a half now, splitting my time between Mississippi a","useful":3,"cool":1},"cxAGw-Tm_tCqwj0_2fYnYg":{"text":"This a good gym. The staff is very courteous and helpful, the equipment is clean, well cle","useful":0,"cool":0},"QJX0bKjYFE6qbSR3R3504Q":{"text":"The staff is very friendly. Great local gym. Clean machines and good place to get a good w","useful":1,"cool":1},"dpxVh_5OrempDtk2SzYZBQ":{"text":"This is a great gym. All of the trainers and staff are very friendly and welcoming. The cl","useful":0,"cool":0},"EbHC_pn8uSbIHgAYRStE6g":{"text":"I started working out at this gym June 1st this year, almost 2 months ago.\nThis was the be","useful":3,"cool":0},"NLDyqJVbvgFGnwiUaMMcCQ":{"text":"When I first moved to New Orleans I wasn't sure I would be able to find a gym that would w","useful":0,"cool":1},"EnCaIc3m37iX5_5cnH7U3g":{"text":"I love this gym!!! First of all, THANK YOU for not making me sign a contract. They have th","useful":0,"cool":0},"kB9L490SYDJCN1SZka0Jyw":{"text":"I've been happily sweating on the Gym Matrix treadmills for over a year now. Theres a lot ","useful":1,"cool":0},"chgjN1iVWGY2MTRHlhIEYQ":{"text":"I joined Gym Matrix after moving uptown and being dissatisfied with the Anytime Fitness on","useful":2,"cool":0},"6R_yDO0wEdUlK_XyM53h4Q":{"text":"I've had a lot of personal trainers before, but Chris at GYmmatrix is really good! LIKE TH","useful":2,"cool":1},"9GChgTbUspYZeoJCaD2h5Q":{"text":"With all these check-ins (and being declared the duchess, sorry, Scott S, muahahahahahha) ","useful":12,"cool":3},"Gfk89L3jqwAz8fPSx-UjwQ":{"text":"Gym Matrix is an excellent and affordable place to work out. The only thing better than th","useful":0,"cool":0},"SMwyFpVZfAeiw1baCFtypA":{"text":"GymMatrix is a really special place.  The equipment is normal, same as you'll find in any ","useful":1,"cool":0},"wUKoSzoGxMP98zB7u-bDoA":{"text":"Went back and forth between a 3 and 4.  A solid 3.5 for sure, but I can't go with a comple","useful":5,"cool":0},"37Zf6UIAPMNImHqYfrUgQA":{"text":"Just a quick update. This place is open now, and I also forgot to mention in my original r","useful":6,"cool":2},"il905lCTT_mGucgmbhJi7A":{"text":"Great atmosphere, awesome trainers and great customer service. Sean is the best. A clean a","useful":0,"cool":0},"GwOY5NUiN59XgvwPp7HpIQ":{"text":"Been a member here for a few months now. Left another local gym in NOLA as it was too far ","useful":1,"cool":0},"bpO_rGwAk5_JyN9l5oscHg":{"text":"This is a pretty nice little gym. Located in a strip mall with plenty of parking. It is op","useful":5,"cool":5},"Z4JjxM4_rI2XRljKYY891w":{"text":"this town does thing to a body.  ok - to MY body, this town does things.  there are so man","useful":2,"cool":1},"oz5kRS44QRD_o-gNakRhjg":{"text":"Gymmatrix trainers are great!  Each one is a little different but all of them are committe","useful":0,"cool":0}}