{"DUeQXzyrLnFnhsz65ECEWQ":{"text":"I am a guy reviewing a woman's boutique, so my review is not going to be about selection.\n","useful":3,"cool":2},"gDaULfv3V0uAm4jW_kD2HA":{"text":"This is a cute little store, with pricey designer brands that you would be hard pressed to","useful":4,"cool":0},"H-4ggFkNtKBrDsWgiKQRhg":{"text":"Do.Not.Shop.Here.  Absolutely horrible. Was visiting New orleans with my family and walkin","useful":1,"cool":0},"SmS3JGTYjC6sfG9O-9ZqfQ":{"text":"Saw this cute shop in my Fodors book, was really looking forward to going in. We found it ","useful":1,"cool":0},"g8BBE8ZcA0gK9agBGc0VFA":{"text":"Bought a pair of Quay sunglasses here on a whim in mid March. Last week the lens popped ou","useful":0,"cool":0},"EmTSONyqdV1pk7_4yiA5lw":{"text":"I love, love, love this shop!!!  I've been shopping at Violets for many years and just sto","useful":0,"cool":0},"oQUgR_cpAwcP3LZRr4cDxg":{"text":"I am so SO happy I stumbled upon this place out walking around. \nThe woman working the cou","useful":0,"cool":0},"Iti52sibCX3_SMMKCX4bLw":{"text":"Expensive...and that's fine, but after spending $800, my wife tried to return a piece she ","useful":1,"cool":0},"SUAIrn0QJyZCvq0fmVqOrQ":{"text":"This is a great little store, tucked away in the corner of Jackson Square. The staff at Ja","useful":2,"cool":0},"XJSpAwk1SlqAoEGBrZ2FqQ":{"text":"I feel swindled by this boutique. I was inspired to shop local this weekend during Black F","useful":3,"cool":0},"A9q2S1YOX69jmTYeoGck2A":{"text":"Violets is the sister store to Jackie's, right around the corner.  The merchandise, all co","useful":5,"cool":0},"Eds8wcVEAwi7Rn7-k3RG5g":{"text":"My cousin and I stopped in yesterday to look at a dress we had been admiring in the window","useful":4,"cool":0},"5vC-K7GV0BMI6aRuTmWDiw":{"text":"Great little boutique for shopping. Only downside was shopping this evening. We were told ","useful":1,"cool":0},"nGvX4hgtD1fvBeWAH_4psQ":{"text":"Saw this cute shop in my Fodors book, was really looking forward to going in. We found it ","useful":1,"cool":0},"E5ZeoZVILDWPVAbpjy_MiQ":{"text":"I wanted to like this store so much because I thought it was so cute outside and I love th","useful":4,"cool":4},"68r1RSULug0jBi9MLbwjSA":{"text":"This is on my \"do not miss\" list in New Orleans. Every time I have come here I have walked","useful":0,"cool":0},"wBp1yq_Hu609f-H2Lba-Tw":{"text":"They had some beautifully displayed sparkly masks that I thought were really special.\nI sp","useful":5,"cool":0},"VSXQlP3m_BeahpWU1jnbEw":{"text":"The people were nice, once they quit talking to recognize me. The clothes were Town and Co","useful":4,"cool":5},"X9LEdxaWUzwwr6jPbzgrGQ":{"text":"Rude owner. This woman also owns a shop on Cape Cod where she is a bit less rude. But, she","useful":0,"cool":0}}