{"vClUH6kZiS5w5wtpjM_pJQ":{"text":"Fancy Fare....\nWe passed this place at least twice a day. Finally on our last day we decid","useful":0,"cool":0},"VmD3cSkRZ1kA5K01A2zlQw":{"text":"Horrible...they don't care about their customers.  Our waiter spilled a tray of drinks on ","useful":3,"cool":0},"clADWW9UzOaPwa4EP36urA":{"text":"Dinner last night at the Palace Café was excellent.  The food, the service, pretty much ev","useful":3,"cool":0},"kHYMwhvQYgqX8tkTyiUbkw":{"text":"This place is as beyond amazing!\n\nMy fiancé and I  actually came here to celebrate our eng","useful":0,"cool":0},"YdI5dYrHXHsAsVjgckGe8w":{"text":"Great ambiance, beautiful room with elegant architecture and amazing center staircase. It ","useful":0,"cool":1},"PBa-IgprJnCnrJmcCqXoMg":{"text":"Service was good but my iced tea could have been refilled faster. The gumbo and entree was","useful":0,"cool":0},"eZidVvTrXH_EBCCHLhwiIQ":{"text":"We needed to do take out. How can food eaten out of cardboard boxes taste so good. Service","useful":0,"cool":0},"kb6hQWAP2beZYPVET6MJfg":{"text":"The service, style and sophistication are always top notch at this restaurant. They have a","useful":0,"cool":0},"Krq1i00wHHUzC26I_oetAQ":{"text":"Has the bananas foster, it was terrible, came out completely melted, service was not much ","useful":0,"cool":0},"iwbK-a1RT1g1C_MFPkOJOQ":{"text":"4 STARS. Great food and service. The white chocolate bread pudding was fresh and interesti","useful":0,"cool":0},"ES2U7A2uO8xhykb05b3xIA":{"text":"The Palace Café is a great place to get breakfast. Sure, there are a lot of things that ar","useful":5,"cool":2},"iA-DxJSjTtoheIRExAKWhQ":{"text":"We went at 9:45, right before the place closed. Food and service were excellent. Loved the","useful":0,"cool":0},"gEuFKeno2TE9iuQA5RpzKw":{"text":"I needed a place for an easy lunch. Palace fit the bill. I was in heaven sitting on the si","useful":0,"cool":0},"E7WdDhr4TbUr4c-0AUTIZw":{"text":"I came here for a quick business lunch and the service, attitude and speed with which we w","useful":0,"cool":0},"buJw49oE7hOSLc3SWYPdvQ":{"text":"An upscale restaurant with a very limited menu.  Service is excellent and ambiance is defi","useful":1,"cool":2},"9Tvo97FrTPmXuGQ-QhQUcg":{"text":"With all of the great restaurants in New Orleans, I never would have picked this spot, but","useful":3,"cool":2},"c9tqJhhLVKaKcv7sgkBrjg":{"text":"Went here w my gf and her bff and her bf. what the f!?!?  So this is old school kind of gi","useful":1,"cool":0},"Z_AzwXYx0tmlrHeHP6rSAw":{"text":"We walked in off of Canal Street and were seated immediately upstairs by the window. After","useful":0,"cool":0},"0T0DjmCxlrii5kuNtYX-ZQ":{"text":"Aside from feeling like we were banished from the main seating area and put in a far far b","useful":0,"cool":0},"H9_NkIxh980LNM0ELwcl5g":{"text":"Basically a group of us from the conference I was at went here because it was right across","useful":0,"cool":0},"ACF-Xagd3-bMsFkK_5m2vA":{"text":"It's a beautiful atmosphere and the waiters/chef are quick with everything but I did not e","useful":0,"cool":0},"lupEzsCoJEapXc2oamrgxw":{"text":"The food and service were great! Nikita was fabulous! She made great recommendations and h","useful":0,"cool":0},"mS535tTW8w7LISrhrF-kGA":{"text":"The best of the best! We have been coming here every Valentines day since 2007. Our favori","useful":0,"cool":0},"t8u8O_sRWiof3EykSUfLnQ":{"text":"Turtle soup was excellent as was the seafood Gumbo.  The service was also great.  Although","useful":0,"cool":0},"cgM9-4nbBZmqxcldgiBJ0Q":{"text":"Great hangout on Canal if you do t want to be in the crowds of the Quarter. Walked in at 7","useful":0,"cool":0},"OaU0mAZC3MKkl8DJLZ43MQ":{"text":"Atmosphere was really good. The wait staff were really helpful and personable. \n\nMy group ","useful":2,"cool":3},"QBEANHftuBOxD4WHBOfQGw":{"text":"I almost didn't go here because the reviews were less than 4 stars. But thankfully I didn'","useful":1,"cool":0},"3-YTdSVCw8xUNjqbyS8LHg":{"text":"I would recommend to seat inside, as the interior is beautiful including the bar upstairs!","useful":0,"cool":0},"ExKgVQ7F64k7jxycyiW89Q":{"text":"Nice little restaurant, had the creole egg skillet. Portion sizes are a tad small but are ","useful":0,"cool":0},"HThMWfMvWOtXIOIhDtRBhg":{"text":"I would have rated four stars but could not based on the service we received.  However I d","useful":0,"cool":0},"RG_LDjmnGXVxA_Nh_2WMQg":{"text":"Great food and deserts, but service could be better! Convenient location from Marriott!","useful":0,"cool":0},"12OfSm8UaAm6Ad6xlfrWpA":{"text":"Peter's Planters Punch is fabulous! Very Citrus-y & refreshing with a nice rum kick! The s","useful":1,"cool":0},"fxoSqxA3CFF0VVPD3UIo6w":{"text":"we were a group of 10 people. We ordered a dish \nShrimp Tchefuncte that the server told us","useful":0,"cool":0},"b1ezNhr_pfPIKuXx-yEfCQ":{"text":"Pam is the best server in the Palace.  Great atmosphere. Good prices.  We had the desserts","useful":0,"cool":0},"2hrBVd9VLIqyqPQQ3knQ5Q":{"text":"Excellent fast service. Had soup of the day-spicy tomato bisque. It was outstanding. Had t","useful":0,"cool":0},"QtHdB6O_QeaitLH3S4sPfQ":{"text":"We went on a Thursday night...no problems getting a table.   Nice ambiance but very casual","useful":1,"cool":0},"Q6J7bP3r9fdB_6pB-cN5PQ":{"text":"Went here over the weekend bc the bf wanted the bourbon milk punch. Not an alcohol fan but","useful":0,"cool":0},"g_LauuSTAfbajaAOvUeWlA":{"text":"Andouille encrusted fish was OK. A bit soggy and not what I was expecting but the sauce he","useful":0,"cool":0},"XUA6ryywIrW3Q3d0ts6sYA":{"text":"Great service! The Palace Cafe was recommended by the doorman and he was right. Delightful","useful":0,"cool":0},"QzA7CrfdRJckkM8Gh-XcUw":{"text":"This place right here was de-lish. I can't wait to go back to new orleans to try something","useful":0,"cool":0},"fb1w2NdQDpoLjO8gqzNxHw":{"text":"The fried oyster appetizer and the crab cheese cake should have been the dinner. Followed ","useful":0,"cool":0},"3KHrbLxvgd2Nj6bkkhs7Rw":{"text":"Had a fabulous time tonight. Everything was perfect and dessert was beyond delicious !!!","useful":1,"cool":0},"QQId_m_yz9l3uudxunC6wA":{"text":"Shrimp roll was pitiful. Imported farm raised nasty shrimp.  Butter on bun was rancid.  Do","useful":0,"cool":0},"gbAZM_ywp9AS_6QBaZ6nbg":{"text":"I LOVE THE POTATO CHIPS!  The french onion soups was not a traditional one, it contains sa","useful":0,"cool":0},"3fY8HpWo0XuCvh3BXyferw":{"text":"Way better breakfast than Ruby Slipper! \n\nThe shrimp and grits dish at the palace cafe is ","useful":2,"cool":0},"-XXCmVzfu4SQE0BE4wGPSA":{"text":"I come to New Orleans regularly for work and this is a staple restaurant. Always delicious","useful":0,"cool":0},"cPrSl-Kv7yOa3zG4JBV_6Q":{"text":"The Palace Cafe was wonderful.  Had the crabmeat cheesecake and the St. Charles Pasta.  Bo","useful":0,"cool":0},"3fTGQLb05cyFtCF9Sy5f2A":{"text":"Ran in for a quick solo dinner on a work trip. Shrimp Tschefuncte were amazing, and the Ba","useful":0,"cool":0},"x-2y1vSdWedFMgFG3PFheQ":{"text":"So I was concerned coming to the Palace Café due to its hype and facade of bright lights o","useful":3,"cool":2},"ogqPZU0kMkYJWAGg2tn8Jw":{"text":"I enjoyed a delicious early lunch at this classic gateway to the French Quarter. The crab ","useful":0,"cool":0},"oDpnFLThsUfgboncgOeHCA":{"text":"Can't help but yelp. This used to be one of my favorite restaurants, 20 years ago. The foo","useful":0,"cool":0},"lTqSr5nEAEkdio1l4Gon9Q":{"text":"We decided to spend New Years in New Orleans for my sister and her husband's 30th birthday","useful":0,"cool":0},"dWqZWA1PLMKnklteMczH4A":{"text":"Best andouille crusted fish ever. I topped it with fried oysters that were divine. Creamy ","useful":0,"cool":0},"SFFVEIfzvasa3-c_2wXTJw":{"text":"Ate here almost everyday while in NO, you would have thought since it's on the main strip ","useful":0,"cool":0},"n__jIk0UGQkvTsPzU7bTSA":{"text":"If you get there early you can here live music going table to table very smooth songs. Try","useful":0,"cool":0},"jWutwNa-Cc56s3jeWhKNYw":{"text":"Staff is very friendly. We had a drink server and food server. Food was good, crab cheesec","useful":0,"cool":0},"Oetu28yeFAK_CgYc_1PqsA":{"text":"Loved it! Outstanding service and the entrees were great! My wife has a food allergy and t","useful":0,"cool":0},"qPge4ZRg717teBMHZMGtPA":{"text":"Excellent service, crab claws and bananas foster! \n\nCome here for appetizers or dessert. E","useful":0,"cool":0},"bqGlbKCkWQ0w45wExJADrA":{"text":"The service was terrible. We had to wait 30 minutes to be seated with having made a Reserv","useful":0,"cool":0},"3S3oabvtMOpjML_LuPUARg":{"text":"Crabmeat cheesecake reminded me of a quiche ... It was definitely different . if you're lo","useful":0,"cool":0},"PNAp2AgNcrPv7qSiO8tDSQ":{"text":"The management did not charge us for the and duck part of our revellion dinner.Duck dried ","useful":0,"cool":0},"uRPU2xxp07NXdeLRJMCAaQ":{"text":"Amazing creme broule as well as the cochon au lait!\nAmbiance is very french like and every","useful":2,"cool":0},"LNkPHgLk2C27gAsO7WTbig":{"text":"A couple of friends recommended this restaurant so thought we had to check it out. Started","useful":2,"cool":1},"VbsISrTTEWWh9-aPx0oBEA":{"text":"Went here for dessert. Really liked the upstairs bar. Daiquiris and colada's were horrible","useful":0,"cool":0},"dTYNEeTkjONXZuLTfXFprw":{"text":"Since the first time I ate at this wonderful Brennan's family establishment five years ago","useful":1,"cool":0},"4E02YEHdjZQpPiV0d-ZAsg":{"text":"Can't tell you how much I love this place!  I highly recommend the Sunday Jazz Brunch.  Th","useful":0,"cool":0},"ljcCIC6c3Z9pIJjJ9N-mCg":{"text":"Stopped in for an early lunch as this was right by our hotel. The outdoor patio was very n","useful":0,"cool":0},"g0-nytQUDWWONrZiRc1v6Q":{"text":"I'm a fan. After trying to find a place open at 3 pm I stumbled upon this place. It was op","useful":0,"cool":0},"BvpEs-6wPBi06JYGh0_5Pw":{"text":"I came here last night with a big group - my fiancé and his colleagues were in New Orleans","useful":0,"cool":0},"ygFIuQpWKPAH-lPZP161Lg":{"text":"Wonderful ambiance nice bar, food is great, a bit pricey. Plenty of wine selections to cho","useful":0,"cool":0},"tihn_gc2rgpEybg0o10PTA":{"text":"Service was impeccable!! Dria is SO personable and is one of the best waitresses I've had ","useful":0,"cool":0},"WpEeLb0Z5ogOwtiiP_B9Ww":{"text":"I enjoyed the Café Eggs Benedict here, my go-to breakfast dish. The eggs were cooked perfe","useful":0,"cool":0},"tYy1Uwiyp-vvw6ADPg2bEQ":{"text":"I always hear local hipster's dogging on the Brennan's but you know something they have gr","useful":1,"cool":1},"j34NNzPMu2mLtRJd9z0JSg":{"text":"I ordered the cheeseburger which was to be medium well. It was severely over cooked and dr","useful":1,"cool":0},"TIlNz-jEhQ4VG5DiesJoPw":{"text":"Really amazing place and food. Locally sourced food, homemade dishes, and excellent staff.","useful":0,"cool":0},"cIpKxr7TzS81d-Hgfmyoxg":{"text":"We ate at Palace Cafe for breakfast and were surprised that there was only 1 item on the m","useful":1,"cool":0},"CLz340QxM_aKVRrSa2FKrg":{"text":"Good food.  We went in for dinner and I had the rotisserie chicken with the truffle mashed","useful":0,"cool":0},"ywH6jV95OWCikSxCtq4Fvg":{"text":"The worst salty food ever! Taste like pure salt!\nOur waitress did not care, just shrugged ","useful":0,"cool":0},"J2Bc3Ycg1yagbMSWxpUEHA":{"text":"We were in NO on our trip and visited this place twice., and both times the food was excel","useful":1,"cool":0},"-hRKsXqECsb1wRIsCmkT4A":{"text":"Gotta love a restaurant that lets you add a side of pre-picked crab to whatever you order.","useful":0,"cool":0},"Lv_7EMokmPM6ea9zb7Zz2Q":{"text":"Strolled to the Palace Cafe last Sunday after a debaucherous night in the Quarter and was ","useful":2,"cool":2},"eO-XkKyXKUAh5Wo0Y87sZQ":{"text":"OMG- can't believe how many times I walked by this place- thinking it was a tourist trap b","useful":0,"cool":0},"eBIuOJPI0wmAGMaa9cL6nQ":{"text":"I've been to Palace Cafe several times for business and have always enjoyed it. This most ","useful":0,"cool":0},"Kb5OjdwX51IARPOLS733EQ":{"text":"There was a slight wait.  Nothing really.  The menu has a wide variety.  I ordered the shr","useful":0,"cool":0},"RcFexCIPczTGTYGfTVNvEA":{"text":"Summary:\nVery good and well presented food, but a high price\n\nDetails:\nNot sure why you ne","useful":0,"cool":0},"Werj8ywboAoxUbtGToWr2A":{"text":"The 1st time we are here the food was great, staff was friendly and hospitable. After havi","useful":0,"cool":0},"9W_mInzeu5Thn0n3Jfbx3g":{"text":"Paid $16.00 for an artichoke appetizer.   It consisted of about four bites.  The artichoke","useful":0,"cool":0},"v1839mnhu4ZSGVQ6Dp9nqA":{"text":"No joke: we would have eaten all 3 meals a day at Palace Cafe during our Nola trip. We had","useful":2,"cool":2},"muewYSgL2eQNpW8Dzbp9vg":{"text":"While this is centrally located on canal (cringe) I can't help but keep coming here. \n\nPal","useful":3,"cool":2},"5-qb9qSyT58h2uQ8gPMe2A":{"text":"We went for lunch on a Monday. Our beverage server was the nicest guy and had helpful tips","useful":0,"cool":0},"rJx3MFrln8ZmLDog6uPTCw":{"text":"Avoid this horrible place. Better food and service elsewhere. Almost anywhere actually. \nS","useful":0,"cool":0},"g3GPSwMvTaIkkfWC_NL8UQ":{"text":"Absolute garbage. Not only was the (newly renovated!) atmosphere soul-sucking and bright, ","useful":0,"cool":0},"KdfVCsaAQ0OD5uvoLYufVw":{"text":"Over cooked shrimp, wilted lettuce, and bad service were the low points and the reason for","useful":0,"cool":0},"H_0NsBScEG7fnv92pzoCPw":{"text":"Awesome experiences!\n     I have been here a few times - never a disappointment. From the ","useful":1,"cool":1},"UZFOG78TixNNJdCpWT4bYw":{"text":"It's been a while since I've been here, but we had an excellent meal with a large party.  ","useful":0,"cool":0},"Q22PAXpA6vL6apOVD7_2dA":{"text":"A wonderful happy hour!  Fantastic small plates to share, ambiance, views of Canal Street.","useful":0,"cool":0},"1_d_r_9FnSpuOD4tPLZQgA":{"text":"We strolled into this beautiful restaurant on a Saturday night without a reservation, and ","useful":1,"cool":1},"L-VP-uU8xc7tnyfXt_6FEw":{"text":"The food was delicious and service was great but I think it lacked something..... Well wor","useful":0,"cool":0},"eHBbb_DI1J8wDjkmXWrVXA":{"text":"We evacuated from Florida due to Irma. Came here for Sunday Jazz brunch. Great music, wond","useful":0,"cool":0},"vEbBD5b_ZTuft5CMReTg_g":{"text":"I have been in New Orleans for 4 days now where I've had breakfast, lunch and dinner each ","useful":0,"cool":0},"w7XJsxJhPqT0ghjrfUsMBA":{"text":"This is a hard one. The waiter was awesome, and the chef sent us a tasty bite for our hone","useful":0,"cool":0},"XT_cj-RpixsQCigdhtqstA":{"text":"Had brunch at the palace cafe. I had a mimosa and eggs Benedict. The food was good, but no","useful":1,"cool":0},"dv7lHjfy3sHOWJ_w-G03Yg":{"text":"Banana Foster was created in 1951 by Paul Blangé at Brennan's Restaurant in New Orleans.\n\n","useful":2,"cool":1},"sfsRjK0f1w32P_PJgnzYxg":{"text":"I met a gal who was looking to leave the bureau here to work for me for coffee and snack. ","useful":5,"cool":6},"aiyL9LeMb-eq6x1vs8AwtA":{"text":"Seriously, the Andouille Crusted Fish was the best meal I had during my stay in New Orlean","useful":0,"cool":0},"um4RlYNBVNRAEmYQ-DfS0A":{"text":"I was here around 5:30 between Christmas and New Year's, and have eaten here twice before.","useful":1,"cool":0},"KyIOG_F0PJTBVQm6lodrqw":{"text":"Crab cheesecake was delicious, the owner adorable and Jeremy was fantastic! Food was delic","useful":0,"cool":0},"kwla4BkCHK-F5wFdI4bc1w":{"text":"Can't comment on the food, but the 3rd floor-- while a bit plain, and the bar is off to th","useful":4,"cool":4},"Fy1A_G6MkqERlC4dpMeKYw":{"text":"This is probably the worst breakfast I have ever had. This morning 10.7.2017 we decided no","useful":0,"cool":0},"r78IdFkxaDTNxJ0oGMZx5g":{"text":"I came here for my graduation brunch and it was amazing!! I had a party of 10 and they did","useful":0,"cool":0},"ZMjgQP5AGbrjBNVPihotvQ":{"text":"Great atmosphere and great service. The kitchen on the other hand was awful. The food was ","useful":0,"cool":0},"05uUX581JCdWobJI9KUN2g":{"text":"I had eaten here before, and was trying to figure out what the name was.  I knew it was ac","useful":1,"cool":1},"4lYUBHL_sHCn0ErelIAYVw":{"text":"You need to go to a restaurant in New Orleans with tiny hexagonal floor tiles, incredibly ","useful":0,"cool":0},"sNBs2o2W5Rx3V9Idj9erCQ":{"text":"Best steak I've ever had anywhere. Hands down. Don't miss the bananas foster made table si","useful":0,"cool":0},"hwGaN8Ww0H0Uk1ij18k_NQ":{"text":"So my friend, whom I'm staying with in New Orleans, used to work for Palace Cafe and she h","useful":0,"cool":0},"XMfh2eZ4j6RcfuTG7aT69g":{"text":"The food was good but service was so so. There was a table next to us that kept buying alc","useful":1,"cool":0},"v0RMViweq9CIJfTX39nlgg":{"text":"Love going to Palace Cafe, every time we go the food, drinks and service are great.   It's","useful":0,"cool":0},"aN2VWqR29wuhXs4fMtduiw":{"text":"Excellent dining experience! My boyfriend and I came here for his birthday dinner. We sat ","useful":0,"cool":0},"geC-Tm5sj_f5OAqHChssWg":{"text":"Just on Canal, across from a trolley stop very good service and nice menu. The Brennan's k","useful":0,"cool":0},"FgVZqh93BdOzIORiC_NJ_A":{"text":"The food was delicious and the atmosphere is nice, especially at Christmas time. It is bea","useful":1,"cool":0},"hxthu7-x6RXGLtKxtYvLLQ":{"text":"Whether I'm living here, visiting, or just coming through, I'm stopping here, at least for","useful":0,"cool":1},"FM_KhCycsO04weQ4ZC-dLA":{"text":"Great food, amazing service! The place was clean and well maintained. The servers recommen","useful":1,"cool":0},"bK5WgdWdnI7zO_U7DCXwlA":{"text":"The food is so good along with the atmosphere. We chose to sit indoors but they do have si","useful":0,"cool":0},"ZHcpyXMzN2BegZZR49VhKw":{"text":"This was my second time in New Orleans, and each time this is the first place I have eaten","useful":0,"cool":0},"wGQpXShnF5EQ0w_6MLqZwg":{"text":"Great lunch served by Philomena. Shrimp roll with remoulade. Iced tea to slake my thirst a","useful":0,"cool":0},"y2eqC4pZLryPWhDcvv0awQ":{"text":"Great service.  Linen on tables.  Waiters  with ties.  Good value for some great food.  We","useful":1,"cool":0},"W9IJv_tzVT542uUToDcJ0Q":{"text":"This is a very good restaurant in Nawlins.  The building is beautiful with its European-in","useful":1,"cool":0},"6M3hs7rGwNHr2BhIvGIkug":{"text":"Visually, this place is stunning. I loved the structure and design of the interior, very c","useful":2,"cool":0},"EweUDP3gxkLh2wDoLDGkgg":{"text":"Absolute great time. Great food. Great experience . Had a lovely time for Mother's Day. An","useful":0,"cool":0},"jpwzVLEQeD6MPwyJys1Jrw":{"text":"The service was a little slow but the food was amazing.  I had the Pork Shank and it was o","useful":0,"cool":0},"4gtZh0jrfmrAMGIiNaEzqQ":{"text":"Horrible service we waited 45 min after we ordered just for 3 salads and 2 soups for a par","useful":0,"cool":0},"_G-vUmSD_f_FcK-d6Uxorg":{"text":"I'm a fan, and will go back next time we visit NOLA.  \n\nThis is an 'upscale' cafe, but you","useful":0,"cool":0},"ATvH3CLA3E5MG1ANyblacQ":{"text":"Terrific ambience - modern and yet elegant - in a full-service restaurant and bar. The lay","useful":0,"cool":0},"sdzwpaR_8tnNkcuHU8EEuQ":{"text":"Lovely casual atmosphere. It's lively and it's romantic. Great for dining, libations, or j","useful":0,"cool":0},"S45PL6iraUcBqtGFxvrnzQ":{"text":"We made a meal of their appetizers and were quite content.  Overall a mixed bag of awesome","useful":0,"cool":0},"af5_FhNnakdHHBBXwbOMhg":{"text":"7/4/18 I had the crab cheesecake. It was incredibly unique. Very unusual taste. The decor ","useful":0,"cool":0},"T-bz2jZpIVnP6Gw_mIq7OQ":{"text":"Bananas foster - depending on who made it. My wife claimed it was the best dessert two wee","useful":1,"cool":0},"yhNZR1sPGpMes_kbChFRPw":{"text":"I will reserve my comments to the bar upstairs.  The Black Duck is a hidden place up stair","useful":0,"cool":0},"fShmzE-bie-3GIE3lilVGQ":{"text":"Just ok\n\nService was non-attentive and Sloooow\n\nFood was very good - tasty \n\nFacility was ","useful":0,"cool":0},"-_a1WuBeg0WMimJsqdsnNQ":{"text":"Amazing dinner. Elliot was fantastic, the rest of the staff too. It definitely added to th","useful":0,"cool":1},"7ZlIHq4PKBNejQ64SuTfZg":{"text":"I was in NOLA for a music festival and I has to taste so local fare. This place has good i","useful":1,"cool":0},"pYLdmo-W1eGYRf5HCmQMrQ":{"text":"Stopped in for dessert. The Bananas Foster was yummy! It was flambéd table side. The inter","useful":0,"cool":0},"dwa3Vkpdzg0-cNkeMETHiw":{"text":"Just had brunch here and it was so delicious. I had the Shrimp Tchefuncte (Shrimp and Grit","useful":0,"cool":0},"lRhTo1KUiHPjFL-HHwTNFw":{"text":"Had a wonderful group dinner here. The crab cheesecake was outstanding as was the seafood.","useful":0,"cool":0},"4a_wp2BrEb8gpN_5nWyMsQ":{"text":"Jeremy & the wait staff were fabulous. Greeted with a smile from all servers. Food was phe","useful":0,"cool":0},"x3rPPla6xpJiLKRdfTYO9g":{"text":"Recently went to this restaurant for Sunday Brunch with a group of 10 to celebrate a birth","useful":2,"cool":0},"W-QVfByy-mItsuNFnOAHqA":{"text":"We wandered around the French Quarter for quite awhile looking for someplace to eat that w","useful":0,"cool":1},"O6bOkKgZ4e6RS1Bvqw3Wrg":{"text":"The soft shell crab was very tasty if it was a little salty. The potatoes and asparagus ev","useful":0,"cool":0},"ua1pLNf7uYI843JLjzG-Ug":{"text":"Nicoise Sandwich was excellent and wife's Andouille crusted fish was also so. The sandwich","useful":0,"cool":0},"zI7zjKXFfh29gyoSC2aUhg":{"text":"Stopped in for dessert and Rum. Waiter suggested run with the bread pudding and cream buel","useful":0,"cool":0},"pbiDvE_C7B_PsbYFZ5sRcA":{"text":"You may get your food or may not depending on the time of day. We came here for lunch-11:3","useful":2,"cool":0},"97EoWvn5t2Sy6vg6Tbi9qg":{"text":"A very nice French Style restaurant, in the heart of New Orleans. We had coffee and drinks","useful":0,"cool":0},"CaMbxgVf2Rw2RUfaS_BezQ":{"text":"This is a fantastic spot to eat in New Orleans. It was originally the Werlein's music buil","useful":2,"cool":1},"zX0GN7KZ0KII_ihnP-gIGw":{"text":"Very pretty restaurant, but the food was un memorable, but the bill was not. One of these ","useful":0,"cool":0},"oFHO23vejkF-BADMDQY9lA":{"text":"Attended a group dinner here and was not very impressed with the service or food. The wait","useful":0,"cool":0},"8h0VidY2b2wlDOXPlpCjbA":{"text":"My husband and I dined here for appetizers and drinks on a Thursday at 11:30 am, what an a","useful":1,"cool":0},"EXxm_ZcR9yYJO2RR0OEUEw":{"text":"This restaurant was recommended by a friend.  It was wonderful.  My daughter and I enjoyed","useful":0,"cool":0},"gNozGAK1uzNmXx8uYJ7lnw":{"text":"We went here with only one purpose, to eat Bananas Foster.  My two sons and I went here fi","useful":1,"cool":1},"XE_whqTj6r8Gh4a3on_YkQ":{"text":"Good food with good service.  Convenient to the hotels on Canal Street.  A decent choice i","useful":0,"cool":0},"WhwsoG9xjqekpN97Ngj9OQ":{"text":"This was my favorite meal during my visit to NOLA. Excellent manhattans from Drew the bart","useful":1,"cool":1},"bj7gzF1io-RBBUJ9V-NMVQ":{"text":"My colleague and I ate here for lunch - she ordered the burger and I got the crawfish capr","useful":1,"cool":1},"ielM88Pjo01kLj9donQxpQ":{"text":"It was a wonderful birthday dinner outing for my Tulane senior!  He made the reservations ","useful":1,"cool":0},"3FJIQ2gH_YRQ_RrxwLhIIg":{"text":"Service was outstanding and our waiter made some excellent recommendations:\nFried Oyster \"","useful":0,"cool":0},"F3fnYV-gz4dlo20e7WBO4Q":{"text":"Crabmeat cheesecake is orgasmic.Food is good. \n\nDon't get me wrong the Brennan's do NOLA s","useful":0,"cool":0},"ERPVbsZSotJq_h_eBIW0OA":{"text":"I have eaten here on several occasions on business and otherwise.  I even brought my fathe","useful":0,"cool":0},"fDcHmwfNyKZeMa7rqtvaMQ":{"text":"Truly my most favorite... The vibe, the music, the staff, the food, the drink, heavenly...","useful":0,"cool":0},"E0kBn7DhqqNm40IP5-OQGw":{"text":"I'm a fan of this place....fish, shrimps, oysters and do not miss duck gumbo.  Definitely ","useful":0,"cool":0},"5tq0RLQ_RIiFnlb-B1q1jw":{"text":"Outstanding. We came in for brunch not realizing it was Sunday (losing track of the days i","useful":0,"cool":0},"oDfTWjOH7B-adhFV7-nEvg":{"text":"Incredible from start to finish. The crabmeat cheesecake was a great start. Don't let the ","useful":0,"cool":0},"97tul5eKi9R-8ryWUUjxlA":{"text":"We arrived on time for the reservation. It was supposed to be in one of the private rooms,","useful":1,"cool":0},"Pn6-wq5NIXEDAA_ukJoW6g":{"text":"Nothing fancy just a cute new orleans diner. They have jalapeño infused vodka for their bl","useful":0,"cool":0},"6goyhQxjAhd6csqQ1GZd5Q":{"text":"Food was amazing, service was amazing-shout out to Claire! Only bad thing was the assistan","useful":0,"cool":0},"R8zIzRUuYl-z8KTXJBEaQw":{"text":"decent food, nice setting, friendly service. i wouldn't go out of my way to head back to t","useful":1,"cool":1},"Z_5ku8UC7hyYSZGrQiSLOg":{"text":"The food was quite good (especially the crab cheesecake!), but the service was poor.  We s","useful":1,"cool":0},"RemzowOpEeJqCmXKXlKhyg":{"text":"Omg the food is soooo good!! \n\nThe service was excellent. We sat at a table upstairs by a ","useful":0,"cool":0},"g3zqS8Aiup32xYsYWrcUog":{"text":"I was there on Saturday 4/14 for breakfast - before the storm.\n\nIt seemed like a long wait","useful":0,"cool":0},"TAppXnJD9nxMcuJs4yRisw":{"text":"Duck was amazing. Great place for a rehearsal dinner. The bananas foster was a good show a","useful":0,"cool":0},"3f5TVuhLSOU9-GoeWJwFbA":{"text":"This place had really good and not expensive food. I had a cocktail and it was nicely made","useful":0,"cool":0},"VHoSKEghExqAVfjtC2hEgA":{"text":"Food was ok. Not a large selection but good for a quick bite to eat. The cheese plates are","useful":0,"cool":0},"0CCNqXgoUrvRZslMZwQ1Qw":{"text":"My friend and I had brunch here a few days ago. We loved the \"make your own mimosa\" bar. T","useful":0,"cool":0},"OMN3cS-4SheOul-qTgnolQ":{"text":"I had  the Fried Oyster \"Loaf\" and the Pepper Crusted Duck Breast with Seared Hudson Valle","useful":0,"cool":0},"Xu8b2-cLnM1siEbBJubioQ":{"text":"Wonderful dinner, great share plates and entrees, topped off with rum cake dessert for sha","useful":0,"cool":0},"WdIBa43TCMkNIZ9ZFc1dFg":{"text":"The place is a historic building and you can feel the love and care in the conservation. T","useful":1,"cool":1},"wot85V8DXG48Y14lvDdnaA":{"text":"Great food and great service.  We had the andouille breaded fish with spinach and snow pea","useful":0,"cool":0},"_SSFpzyYPzsKa9N5RmHZ9A":{"text":"We got l lucky with this restaurant. I got the bacon and cheddar burger and waffle fries, ","useful":0,"cool":0},"Bk1CNsubxpokgvFe89n43w":{"text":"Crabmeat cheesecake is unbelievable. Waitress suggested it and there are other more expens","useful":0,"cool":0},"xgjv7eHXBUx9NtPnrIr2Ng":{"text":"I've been to this place twice.  The first time was a lot better. There crawfish cheese cak","useful":0,"cool":0},"G3o7I2SdTgBpIVB32d8cXQ":{"text":"The interior is beautiful.  Since it was our anniversary dinner, I was hoping to sit upsta","useful":0,"cool":0},"_iZyv8xY4OvndY-4Uhygfg":{"text":"I went here after my visit to the WWII museum.  After seeing all the horrors that mankind ","useful":0,"cool":1},"78UCe_x7ZlYKxdxf7ys1OQ":{"text":"On my last day in NOLA, I passed this restaurant probably for the 10th time... and just no","useful":0,"cool":0},"zoIyumnVytlAbdezTV4nhA":{"text":"I love palace. Usually go there every other month. Last time i went were a little concerne","useful":0,"cool":0},"cWemfhDGKJbxKUK2iaoCbA":{"text":"This restaurant came highly recommended. We stopped in after a parade and we were seated q","useful":0,"cool":0},"Tv3CxzQbxkISaWJcTc8PNg":{"text":"I've passed this restaurant many times walking on Canal street to all the other restaurant","useful":1,"cool":0},"7Elm1vEjNeB2EqC4BFGq9A":{"text":"Staff works together collectively and is very attentive. Could use a little more speed but","useful":0,"cool":0},"WsXLc8ry-wgpXgOz0UY_dw":{"text":"Overpriced mediocrity. Service was decent, but quality of food for the price was ridiculou","useful":1,"cool":0},"hIHunZLGO99jAmyIKa4o3Q":{"text":"Casual (not \"upscale casual\"). Crab cheesecake was amazing and the oyster loaf so tasty! G","useful":0,"cool":0},"ZxeeC7OAG9p9zShTtgjr6Q":{"text":"Even one star seems to much for this overpriced restaurant with yucky food. I went in for ","useful":0,"cool":0},"zSaRkCafWuU8ogOt40HIkA":{"text":"Our first dinner in New Orleans and we loved it. Great blue crab claws in creole sauce fol","useful":0,"cool":0},"PylgTcOXyiGiS0Tpo42aTQ":{"text":"We chose The Palace Café because it was storming and it was the closest to our hotel. Happ","useful":0,"cool":0},"Sifz5dluWUZwQVCCRvQI8A":{"text":"Old fashion southern charm and attentive service was very impressive, Four different meals","useful":0,"cool":0},"QdSRQY9d89HQnZtl2IqR2g":{"text":"Pork shank was beyond amazing. Bbque shrimp great, duck delicious. Must go!","useful":0,"cool":0},"xf09nSPQJpnyNhoYWIc0wQ":{"text":"Came here in search of protein and got it in the form of a big fat tuna steak. My server r","useful":0,"cool":0},"nKzPDH4saM5oqZHsDEjO4g":{"text":"Dinner at the Palace Cafe did not disappoint. The staff was very friendly, food came out p","useful":0,"cool":0},"IydCphmoBAIFX9exlWmoKw":{"text":"Lunch in a convenient spot on Canal with lovely atmosphere. I don't know why the reviews a","useful":1,"cool":1},"EYpmY51NIrtwqDPmyxGQvQ":{"text":"Food was ok but nothing special. They charged us $16 extra per person for crab add-on with","useful":0,"cool":0},"IBw1NWV8vzs0ToKLuU7qIA":{"text":"We've been to Palace Cafe for several years over New Years and always enjoy ourselves. Thi","useful":0,"cool":0},"8qkophVHKtdFe3zK9jUlOg":{"text":"Spent 4 days in Nola for a conference and ate breakfast 3 out of those 4 at the Palace Caf","useful":0,"cool":0},"4fxbZNVTFS20hcIJ8GApgg":{"text":"Second time for dinner at Palace Cafe, and each was great. The crab cheesecake appetizer i","useful":0,"cool":0},"6vuHbkriRLg1I1X9yOGvhw":{"text":"Came here at the recommendation of a friend just to order the Bananas Foster. The service ","useful":0,"cool":0},"quBfaL0ROIY-O-cCoeSW3w":{"text":"The worst place to eat if you go to LA. The restaurant was very nice.  But the food and th","useful":0,"cool":0},"fE69XcFrV-nQ4C4dBF4law":{"text":"This is one of our all time favorite restaurants!  We've been coming here for over 10 year","useful":0,"cool":0},"HVWTi8XXU9lYcv_x9ojPGw":{"text":"We had a phenomenal view overlooking Canal Street in the French Quarter as we dined on won","useful":0,"cool":0},"u5pXC2x2YhIHEB3iY9WMng":{"text":"3-17-2014\nWe visited the palace Cafe last week. I agree with Lindsey A. in that the staff ","useful":0,"cool":0},"yWpwd_85cJ1vJLBnqvDONA":{"text":"The food was absolutely amazing. The hostesses were the only negative part of the experien","useful":0,"cool":0},"wy8uJNJuJf-9_AUxpQUU8w":{"text":"Not impressed.  If I could have awarded zero stars, I would have.  My companion and I lunc","useful":0,"cool":0},"Hdw-sT8gouHcLC8KWwYl3w":{"text":"What a surprise! My wife chose this place because of the Banana's Foster we saw on a TV Sh","useful":3,"cool":1},"8ZP3z9TtBHJ9FumsHCxjCA":{"text":"Sidewalk seating means people watching! Yay! Interior has a beautiful grand staircase. The","useful":3,"cool":2},"TRqzzQTZBO-C_H04WjRzBA":{"text":"Really wonderful place to go ....we sat outside, really nice patio to people watch... Serv","useful":0,"cool":0},"x_eaX9auQSledxy5-q5R3Q":{"text":"We came in for the morning brunch.  It cost $16 for unlimited food.  I have a back problem","useful":0,"cool":0},"1XeSy7tvsZZGduYvtmPFPw":{"text":"I've eaten here twice, and I have very much enjoyed myself both times. I'd rate it a bette","useful":0,"cool":0},"ZiKF3Agbh3BiN8rQ_8gomg":{"text":"A table outside opened up as we were walking by. Wonderful meal, great and reasonably pric","useful":0,"cool":0},"CPldnaExix5eFjAXrBjTVQ":{"text":"This was the first place my husband & I ate when we got to New Orleans. We weren't expecti","useful":2,"cool":1},"toVOjeb1mQNB5Vc88MK1uQ":{"text":"Great food but slow Friday night service. Lots of confusion with waitstaff. Food was good ","useful":0,"cool":0},"PqmkYHMLMc12qg6g5ooEkw":{"text":"3 stars. The atmosphere is very nice. Great place to sit and relax after a morning of walk","useful":1,"cool":1},"qcABnviYDi4DLRn9NVNfBw":{"text":"The food was delicious\nThe service impeccable\nAnd the empathy for evacuees from hurricane ","useful":0,"cool":0},"WsZdVphTY_lhjduwu7o62g":{"text":"Yeah...I totally forgot to Yelp this joint from a trip I had there a few weeks ago.\n\nThe m","useful":2,"cool":1},"RXzaKeCDZoxByolLa6y5qw":{"text":"Love Palace Cafe!  My first job out of college (20 years ago)....brought me to New Orleans","useful":0,"cool":0},"Kd28Mn9hVYNDTs1XRlxSNg":{"text":"The food here was the best the service was not.  That being said I would still go back.  T","useful":0,"cool":0},"EzxNfEnu87AfG21w9IbuAg":{"text":"So the crabmeat cheesecake is on point, but my fried oyster salad was a little sad. To be ","useful":0,"cool":0},"M1IgFb0l1UrQE_i4MmEzYw":{"text":"Actually a 3.5 star because of the turtle soup.\n\nWe had breakfast here and great southern ","useful":0,"cool":0},"6QASZSB5-Exuvg4aSWkfiQ":{"text":"Easy walk from our time share.  I loved the ambiance of this place (gorgeous murals of loc","useful":0,"cool":0},"S0a6xcKW_nBvabm26-Ml3g":{"text":"Crabmeat cheesecake appetizer a must. Andouille crusted gulf fish was wow. Jeremy our serv","useful":0,"cool":0},"USZNzTEJ7GXiMTfP9mkiEg":{"text":"One of the best meals I've had in NOLA, so yummy! Beautiful restaurant, great service, and","useful":0,"cool":0},"iR1gNxuN6XkcpFcJStHvAw":{"text":"A restaurant that you could dress up for a nice dinner or still comfortable to be casual. ","useful":0,"cool":0},"vUhbGgfKG-NwSyU8JORKLQ":{"text":"Would not recommend. It took 25 minutes to take our order. Extremely loud. Food was averag","useful":0,"cool":0},"MQHFj_rHv5t1uTS5oxpljw":{"text":"One of my favorite restaurants in New Orleans! I always sit upstairs at the Black Duck Bar","useful":0,"cool":0},"Jpk80ZLSSMzxHjk89tmY2w":{"text":"Food was good but the service was horrible, our server had 4 tables and it took him 30 min","useful":0,"cool":0},"jQqP6BrtWEMBlH5J8r7isA":{"text":"We decided to go here after NOLA pride 2018 was ended as it was right in front. We had a r","useful":0,"cool":0},"9GpVyqdqTmOSuvszEHOYiQ":{"text":"Subpar experience, both food and service. We were a company of 8. We did not make reservat","useful":1,"cool":0},"TYCPxHC2Nu5dYaj3AVWOTA":{"text":"We were having a hard time finding a place to eat for Easter brunch and thanks to YELP thi","useful":2,"cool":0},"Z01HHjRFPO_LWPqEiNE1Ng":{"text":"Loved the crabmeat cheesecake. It was delicious and just enough for breakast. The only iss","useful":0,"cool":0},"D-0kqDFQzKT6xL8n9slbIQ":{"text":"Food was great but the wait staff completely made the meal! We had some in training employ","useful":0,"cool":0},"y8a6wor2ka3N3ZkM85hNFg":{"text":"Great Jazz Brunch! Service was a little slow, but the food was good and the ambience was h","useful":0,"cool":0},"S0woFduh01ps9QWUkgtodQ":{"text":"I'd come here just for the bread. Yes, that good. The service was outstanding. There was a","useful":0,"cool":0},"zhbNH56Mt1gfToV7f5Kqsg":{"text":"An upscale restaurant with a very limited menu.  Service is excellent and ambiance is defi","useful":0,"cool":0},"3qN9TyXddjrXskPTiJB7pA":{"text":"Great service, Great food, decent price and very well located. Difficult to find parking. ","useful":0,"cool":0},"KcCgrHvTaltVNGtCm_fUNQ":{"text":"The night out here was a great success! Food was awesome! \nWe would come back to 100%\nThan","useful":0,"cool":0},"nWrA-mn7Zz74CCsTxiEYMg":{"text":"if you plan to enjoy happy hour, be prompt.  if you want dinner, make reservations.\n\nI had","useful":2,"cool":2},"bfcjqLhAJdRuISW-p24ADQ":{"text":"Food was overall pretty good. Great catfish and dessert. I'm subtracting a couple starts h","useful":0,"cool":0},"O8GQ7iEm92ayC1_CjCsZwQ":{"text":"Fried oyster salad is amazing!!  Great little place to sit outside in the shade and watch ","useful":0,"cool":0},"dVH3CVAWOc1dMb214I_ogQ":{"text":"We came here for a late brunch with a group of 5 and overall it was just ok.  Nothing spec","useful":0,"cool":0},"I_XoggggVqDd6xHmwfsCNA":{"text":"Hadn't been in a while, but there was a special occasion. In a restaurant, everything is a","useful":0,"cool":0},"XqXXYj8ubo1wV7MFHhqwnQ":{"text":"Was extremely underwhelmed and disappointed.... Wanted a light meal and chose to dine at P","useful":1,"cool":0},"E47gSCNiVWc8C0gqcTGWcA":{"text":"Maybe I'll try this place again because the reviews seem overwhelmingly positive; perhaps ","useful":0,"cool":0},"HN512__lRkiT7H8yYG9ZOg":{"text":"Went here for a late dinner on a Tuesday and the place was still crowded, so saw that as a","useful":0,"cool":0},"AoXX5tliJ_dxTnSNCT2Wag":{"text":"Very good food with good service. We had the shrimp and steak and both where awsome. Then ","useful":0,"cool":0},"VSBHHftWR14JHx3zG2Jdjg":{"text":"Food was pretty tasty although we were turned off my the upsell pressure by the wait staff","useful":0,"cool":0},"0p5-ovnVYcc_fYDUoUjZIw":{"text":"Carelessness was what I experienced at the Palace Cafe.  And what's so sad about the carel","useful":1,"cool":0},"v0OGUZqFWyYy28uDuTGJFQ":{"text":"Ate here while in NOLA for a conference and really enjoyed it.  Atmosphere is great!  Feel","useful":0,"cool":0},"65TdXZjzTJuocntq1ZN1LQ":{"text":"So many problems for such a great looking restaurant. I will not go back.\n\nAtmosphere: Exc","useful":2,"cool":0},"V5-FeMlFmiXFhSOEo4VNiw":{"text":"My corworker recommended this place in NOLA, and since it was a Memorial Day Weekend, I ma","useful":3,"cool":2},"98CuTakudrCbfzhhqSstMw":{"text":"A coworker of mine who is local to Louisiana raved about the Crabmeat Cheesecake, so I had","useful":0,"cool":0},"0FpuhGnaz4CWnMzIlso_-A":{"text":"Went for diner wuth large group.  Great service by Jessika. Gumbo was fantastic.  Catfish ","useful":0,"cool":0},"WB5XtvGPu0VuOGuz087fXA":{"text":"We had dinner reservations for a Friday night at 7pm.  We arrived at 6:30 and were seated ","useful":1,"cool":0},"SO42qlNvDVWoBJxiC0STGw":{"text":"We went here for lunch.  The food was great.  I had blue cheese salad and crab cheesecake.","useful":0,"cool":0},"vQ1h7knSJC6n0DRUbQuN3w":{"text":"Palace Cafe has the perfect atmosphere. I went for brunch to celebrate a friends birthday.","useful":0,"cool":0},"youftrKhvn05kpJvc4PfQA":{"text":"They don't advertise it very much, but in the summer they serve a \"Temperature Lunch\" each","useful":2,"cool":0},"eQvLifTPCxVpuMb0x7xOaA":{"text":"Love, love, love this place and their delicious always changing menu! Strawberry salad, Sh","useful":0,"cool":0},"n2n4p34OnK5lP4DNKE1KwA":{"text":"Super sweet staff and great food! I got the banana foster waffles and a cafe au lait. Ever","useful":0,"cool":0},"DjmicrQa5_JJD-KBKTAT6A":{"text":"Blue cheese salad is really good. Cajan seasoned filet was awesome and the ribeye with shr","useful":0,"cool":0},"MIZODZkbsoubgQ0teBlixQ":{"text":"Located right on Canal Street, guarding entry into the French Quarter, this place seems li","useful":2,"cool":1},"SoNJ0Lwitzhm_fzCmiTcYQ":{"text":"I had the tuna panzanella. It was delicious and perfectly seasoned with capers, spinach, f","useful":0,"cool":0},"4ihQ15tMBZYTEM8dMJhcrQ":{"text":"Great Food, excellent service. Don't forget the banana's foster at the end, prepared table","useful":0,"cool":0},"-u1HfYaXqrqZmRTOGM1KAg":{"text":"Very nice restaurant. The food is delicious and the staff is very friendly. Definitely rec","useful":0,"cool":0},"0ie-2yl9S0xnpQ_MsxwNdQ":{"text":"I have been here several times and I do enjoy the restaurant and food.  However, today, Mo","useful":0,"cool":0},"blDV3-5qnUaiPYDXsCsyqg":{"text":"This place is a perfect spot for a special occasion or group meal.  The service was incred","useful":2,"cool":1},"vlUwv7KAKfJjeecGz6RRFQ":{"text":"Outstanding service. Amazing food. I had the fried oysters and catfish pecan with crawfish","useful":0,"cool":0},"0pdhQLrRhSya_mqRFTU2mQ":{"text":"First time here & I feel in love. Staff was friendly & attentive. The Palace Burger was ta","useful":0,"cool":0},"48_ZtkFt4usp8jWBJxtAGQ":{"text":"A pleasant surprise!  I was skeptical when I saw this restaurant was on Canal Street....Ca","useful":0,"cool":0},"3GH_7ePsfEUcHAgB3jFkfw":{"text":"Six of us came to New Orleans from NJ and MD for a quick weekend getaway to celebrate 2 bi","useful":2,"cool":2},"kLdghdBp4pvzPYlpk4xU4A":{"text":"We sat outside and was immediately greeted by a friendly waiter! We both got the breakfast","useful":0,"cool":0},"p-MQA3lHDwcbwHaRIniCjw":{"text":"Went to Palace Cafe for lunch during conference 2 weeks ago per recommendation of a few fr","useful":1,"cool":0},"dCDe-J_Ijv-FwalLZmtKug":{"text":"Ordered the pumpkin cheesecake with gingerbread crust with caramel topping.  Very tasty. \n","useful":0,"cool":0},"pJ-ZqdD8sQfHzdawWfL5pA":{"text":"This is an amazing restaurant m. The service is outstanding. I loved the crab cheesecake. ","useful":0,"cool":0},"D4CWreoKuGZlt2bIYcOv9Q":{"text":"I was with a party of 16 yesterday service was great and food was outstanding! \nNeedless t","useful":1,"cool":0},"lm9yh6QxqA8YsfafA34zng":{"text":"I give it 4 stars bc of their new brunch menu. I think it should have stayed as lunch. One","useful":0,"cool":0},"QnHPAQbaFWhDf12ueO_zjw":{"text":"This place is obviously a tourist trap.\n\nOur food was very bland.\n\nI wanted to try the oys","useful":0,"cool":0},"jTaCVcEuIUeJ58FUhtEWGQ":{"text":"We had a hard time making a choice for dinner while on New Orleans. There is an abundance ","useful":0,"cool":0},"sQBaP48o6cZpjVF6YZG3mA":{"text":"Not the best meal I've had in NOLA. Was looking for a quick bite before going on a bike to","useful":0,"cool":0},"jWrbmQJct_B58YVzVCTkBw":{"text":"This is an institution in nola and you have to visit at least once. \n\nA group of us (21 pe","useful":4,"cool":6},"tkNwC0zkNo3VFOg44oPOuQ":{"text":"I was really hungry after stalking photographs in the French Quarter all morning. I needed","useful":1,"cool":0},"4Bb4zA669knHZwfeQTvWaw":{"text":"Our go to for private dinners. We always reserve the Wine Room upstairs (seats up to 12). ","useful":0,"cool":0},"43dO6F-OJl2K8z3bQ7-ZOA":{"text":"This place is really nice and pretty inside. It was unfortunate to see people there for lu","useful":1,"cool":0},"D2OZ8C45HP0-WGhPafzR7Q":{"text":"The duck gumbo was alright. Maybe I'm just not a gumbo person, but I wasn't that impressed","useful":0,"cool":0},"oQtmkoy54Nd-HVeaCxZfjg":{"text":"I came for the Banana Foster dessert, but stayed for the soup!\n\nI had the turtle soup and ","useful":1,"cool":1},"xJyOPOZ-0-ijLXPc5Oz9zg":{"text":"Be super careful here if you have allergies we went through the list with them very carefu","useful":0,"cool":0},"UZHnn3rIEgSQmH-Y9y01Gg":{"text":"We had a such a great experience! Really thoughtful and good recommendations from both out","useful":0,"cool":0},"vekzF5POLpfYFAcRJhYmjg":{"text":"Still love this place. The fromage appetizer with triple cream Brie and spiced pecans is d","useful":2,"cool":0},"QtFmtfbzQcroowmnPtNcBA":{"text":"The crabcake cheesecake was incredible! Try their duck. The sauce is a great compliment. I","useful":0,"cool":0},"xuWVCzb3M6cGmRfnN4TXSQ":{"text":"Palace Café made me feel like I stepped back into the 1930's. It has a very warm ambiance.","useful":0,"cool":0},"-MnuY6eqq0poICOUpyujqg":{"text":"This place has great service but the food is definitely not worth the price point.  I had ","useful":0,"cool":0},"-B8tZu-ysXG8fBkcRKzQyg":{"text":"Even the touristy places in this town still provide a wonderful meal!  \n\nI was at a confer","useful":0,"cool":0},"PDF8X6284QHju2t7JhYmEA":{"text":"Palace Cafe is an outstanding restaurant. It's cuisine and ambience are unique. I had dinn","useful":0,"cool":0},"h0TmepBz_GCmdntZnFnE7g":{"text":"WOW.  Food and service are amazing!  Start your meal with the crab cheesecake, quite possi","useful":1,"cool":0},"nTTo7s0L6NhxwMkC-hZNIw":{"text":"We stopped for dessert on a late whim.  The bananas foster was fabulous .  We then thought","useful":0,"cool":0},"XztzOXF1n3nFa4gQItvUtg":{"text":"Flank steak speacial was delicious. Also enjoyed a Sailor's coffee and pecan pie. Will def","useful":0,"cool":0},"dt3y5PfXVdyORQ-iUkXtjw":{"text":"3.5 stars. We ended up having Sunday brunch here. It was not the first choice we had in mi","useful":0,"cool":0},"9auFFEbtFplS_hEHNfZg1g":{"text":"Our Lyft driver recommended this place to us, as it was right around the corner from our h","useful":0,"cool":0},"g6ivb8QGiYAMCrZusiu6RQ":{"text":"Despite of the not so positive reviews we decided to give it a try. This place is fantasti","useful":0,"cool":0},"p-ItMS2SJ3r2M912z2MZrA":{"text":"Correction our waitress was Meka not Melanie .","useful":0,"cool":0},"MIZ4BtE--f-6t8T8oSqJqw":{"text":"This is a visit back to old world service and food. I'd give a solid 5 if there was option","useful":0,"cool":0},"5Uv7qMnPDT2So04E__XQ5w":{"text":"Pros:\n\n- the shrimp in the shrimp n grits dish was tasty. \n\nCons:\n\n- had the dish for brea","useful":0,"cool":0},"cpWaWABX-SFcjoFuTgEXXA":{"text":"Probably my least favorite Brennan restaurant. The service was iffy, we came in between tw","useful":0,"cool":0},"Xv3fJDD8YBe2hsOz3LyRng":{"text":"I have eaten in many restaurants but this restaurant is one of the best. The server we had","useful":1,"cool":0},"MxlsBbp0zu10S7mN_TRzPg":{"text":"We went here for a birthday and had a large party. The menu was set and it flowed really s","useful":1,"cool":1},"mYSpUL2cZQvGxSGvjjQoOA":{"text":"Classic New Orleans proper meal filled with deep and rich creole seasonings in every dish.","useful":0,"cool":0},"Cgcw8tBxkcFOTelHJOJh9g":{"text":"Having eaten at the Palace Cafe several times in past years we knew we liked the brightly ","useful":0,"cool":1},"_qcqS6KxBgyaw5GWSL-64g":{"text":"This place had great food, I looked at yelp to see what was good and bad. My fellow yelper","useful":0,"cool":0},"2P8SKGvDHX95uKbY9ZzNWw":{"text":"Worst service  we have experienced in all the restaurants we visited in New Orleans, it's ","useful":0,"cool":0},"P12dOZ2f5WyVx21uTMnRCw":{"text":"Dirty silverware with more than one guest \nUnfriendly service-workers\nUsually a favorite \n","useful":0,"cool":0},"g4taTh-TVFrVAI7cW272XA":{"text":"Our friends and I have been going to the annual Essence Festival for the past 3 years and ","useful":0,"cool":0},"_80v-g09hpIhT0nqzIx1ww":{"text":"My first yelp ever - for real - the New Orleans style bbq po- boy is amazing...as is the h","useful":0,"cool":0},"kRTZnZbNMFhbEP-FVWz7vQ":{"text":"The food and service were terrific. My husband and dad raved about the Andouille crusted f","useful":0,"cool":0},"2_IYZ_w6zEqyblt0xwYdiA":{"text":"The best gumbo and turtle cake I have ever had! Wonderful service ! The waiter gave me a l","useful":0,"cool":0},"65sH439H6nz89JLn8buiUQ":{"text":"Starving and not properly dressed for the fancier sibling of this place, Commanders Palace","useful":0,"cool":0},"OpyLln7MGcdKMmo7InIPww":{"text":"I wales in to Palace Cafe on a Sunday night around 9pm to find the place still jumping wit","useful":0,"cool":0},"wmWuWFQPkbHiEYYnfA-Lpg":{"text":"Crabmeat Cheesecake!?!?  Oh yeah...  A must try for me...\n\nI arrived alone at Dickie Brenn","useful":0,"cool":0},"vu2HML2vQilR4Nrw_KIRiA":{"text":"Service not great, had to flag down waiter if we wanted another drink. Seemed to have 2 wa","useful":0,"cool":0},"dYiMdJVap-ZtExph9ruC1w":{"text":"I am amazed. This was probably one of the best dining experiences I've ever had. And it is","useful":2,"cool":0},"FIy0JMSvc3bx34LAD9dpiQ":{"text":"This place came highly recommended by some friends who said \"You HAVE to get the Crab Chee","useful":0,"cool":0},"hS2Fj-MIi09yNBxPQhEcqA":{"text":"Yummy fried oyster salad for lunch...good service, pretty good prices...will be back!","useful":0,"cool":0},"RhTkir1G1bLGr3wFzLWv2A":{"text":"Have you ever ate shit on a stick? Well this what you get here. A group of girlfriends wen","useful":0,"cool":0},"HsoYrg6qcBS0BFkAzlpZQw":{"text":"Went here for Sunday brunch. The crab meat cheesecake was surprisingly very good. Never ha","useful":0,"cool":0},"dU7YT1dkJxcRtfPu94Gmlw":{"text":"The most truly memorable dining experience I have had in New Orleans.  Service was fantast","useful":1,"cool":1},"CCF7xDf3ui9PA7D0IC2fFQ":{"text":"Good food, nice looking place, but waaaayyy too loud. There was a live band playing for a ","useful":0,"cool":0},"MV3uHuNDPNdCInoK2Ra3SQ":{"text":"Absolutely delicious with prompt service. We had the pecan catfiish, prime rib and bread p","useful":0,"cool":0},"mM01aHB1SX2YBgjXFY7lGg":{"text":"The 2 wimpy stars are for the service we received at the bar two nights ago when we came f","useful":0,"cool":0},"kD2cVY_NCOjW20H6D0DuDQ":{"text":"Great food. Nice place to people watch. Very clean kitchen. And the wait staff was fabulou","useful":0,"cool":0},"Kqs-1wkoMcxRTemVYA1itQ":{"text":"This was my first time/meal being in New Orleans.  I have only started eating cooked fish ","useful":1,"cool":0},"QGrv1xiQVj4GVK0wfO9hRA":{"text":"I took my mom for Mother's Day, so I had high expectations for our experience to be impecc","useful":2,"cool":1},"y_ncQIhXO273ky8BZNSv5A":{"text":"The gumbo is not something I'd write home about. It was probably the worst I have had. The","useful":0,"cool":0},"7kaPzCP4a8T0BCJ05IKazQ":{"text":"4/5 stars only because it was loud and our server was a little to \"close\". The food was ex","useful":0,"cool":0},"8kmPcU0mIUjENtjCx6y5fw":{"text":"I'm not going to lie, the outside of this restaurant was a huge disappointment for me. My ","useful":1,"cool":0},"ybuWre5fJ6QESn_1aBEX7g":{"text":"I was hard pressed to find chicken while vacationing in new orleans so when i saw it on th","useful":0,"cool":0},"-F_6-0doDBCiodNVfpNQkw":{"text":"I went here with a friend on a Thursday night (~9:30) for dessert and we were immediately ","useful":2,"cool":2},"WnfvW6nD3aCk_w97kib6AA":{"text":"This was one of the best place we ate in New Orleans our last trip. The atmosphere was ele","useful":0,"cool":0},"pfcZT2Btm9i9ROzd_G-Bvg":{"text":"Initially we wondered about the Palace as we were a bit under dressed (wearing football je","useful":0,"cool":0},"pONGfVggqZm-G7w26PgnYw":{"text":"Went to Palace Cafe for dinner on a Sunday evening. Had the Seafood Gumbo and Andouille Cr","useful":0,"cool":0},"z1ojO3IG1QBq6-PJnG1gxA":{"text":"If you're looking for a good breakfast to start your day - go here. Very simple American m","useful":0,"cool":0},"EJ8zirziJmOJ9o9fjLXmfw":{"text":"have been here twice. once for appetizers and cocktails and once for dinner. both times th","useful":1,"cool":1},"Ogs_3V5JFX33FRkjAHrN6w":{"text":"The food  and service were both a hit and miss. Crab meat cheesecake, andouille crusted gu","useful":0,"cool":0},"IvxQrm6UJQHHQ1rzXeNOvg":{"text":"Food was excellent. But yet another review on horrible service in NOLA. It was a trend on ","useful":0,"cool":0},"WYWt2-1-B_ZhHePvXp36IQ":{"text":"Staff are a bit....unhelpful? I mean the hostesses but I'm not sure if it was a cultural b","useful":0,"cool":0},"Zonw6Hx2m0eBklTPZHEf3A":{"text":"Average to good food. Menu geared more to the tourist but I'm a sucker for bananas foster ","useful":0,"cool":0},"yJBQLe5psIhm7hEgQ0wCRw":{"text":"Very nice classy\"ish\" kind of place on Canal. Turtle soup was OK but their BBQ shrimp was ","useful":0,"cool":0},"TQb6605TseLyTkdTXcL7Yw":{"text":"We chose this place randomly. The decor is definitely New Orleans. We had the turtle soup ","useful":0,"cool":0},"M9FXmUnQTBp-5hTdjlyf5Q":{"text":"Pretty good. I got the Shrimp Tchefuncte which was great. My partner got the crabmeat chee","useful":0,"cool":0},"a91uzhLhis0b4V75kobfDw":{"text":"Part of the Brennan's empire (whichever part I don't know).  It is a worthwhile addition. ","useful":1,"cool":1},"9arZ_7wReYTDyoupV_rixw":{"text":"I had to grab Cllaws and the Andouille crusted\nfish, it was excellent! The atmosphere was ","useful":0,"cool":0},"uKrYjXby4eCp-vj4pSWJFg":{"text":"Gonna make this short n sweet... any waiter who works in a tourist attraction restaurant s","useful":2,"cool":0},"Km1Cw2HqYBSoSsiSCuqYSg":{"text":"Had Easter Brunch here. The appetizers are good size and nice for sharing. My salmon was d","useful":1,"cool":0},"P6SVehqUCYc9l8S7SPvIog":{"text":"Stumbled upon this place for lunch after realizing the place we had planned to go to was n","useful":0,"cool":0},"CUZy83SkxMNx11Jw44Ai4A":{"text":"Great food and acceptable service.  Probably one of the fancier non-hotel restaurants on C","useful":0,"cool":0},"ho2fqvgvMcBQhc4h86kAWg":{"text":"I liked this place. The ambiance was romantic and also family oriented. The a cappella sin","useful":1,"cool":0},"LZQU5NyJo_D9yS_XYPN4KQ":{"text":"The service was the best, our food server was named Jesika and the drink server was Burch.","useful":0,"cool":0},"i2ythv-fKQgorBu8E0Cudw":{"text":"Had a good experience here. Food, service and ambience are all consistent with its reputat","useful":0,"cool":0},"f6R9apTxF0eJQEMZqnQZBg":{"text":"Past it's prime. Bread pudding was cold and rubbery. Bananas foster was sticky sweet and d","useful":1,"cool":0},"W3wAOAugtDrZNlHSsmqMFA":{"text":"Came to restaurant for a work function. So excited when I saw the decor of the restaurant.","useful":0,"cool":0},"lOAnF6qfGxqOd-Q5fIjifw":{"text":"One star is VERY generous for this place!!  This was my second experience at the Palace Ca","useful":5,"cool":0},"88id400kvl6Pt3eI0s6vnQ":{"text":"Convenient good service. Great ambiance. Excellent Gumbo and bread pudding. Would definite","useful":0,"cool":0},"n5fcfRfWB9pui9H3pjI-yw":{"text":"I hosted a reception for 110 people who were in town attending a conference. From the init","useful":1,"cool":0},"FeUTELqdcbG_blSZntiWjA":{"text":"My fiancé and I ate here a couple of weeks ago just for the dessert and we were very satis","useful":0,"cool":0},"9OtgoMPGINknGOWP3ryMsw":{"text":"Dined at this place for Mother's Day, and I will never go back. My mother-in-law chose the","useful":3,"cool":0},"lFmUeq1T801-J4jjBi4AcQ":{"text":"First, the TASTE of the food was fine. Everything was done as described and the portions w","useful":1,"cool":2},"5LfYRwzl8oKjtrgLm6be7w":{"text":"Great historic spot with an amazing spiral staircase in the middle of the restaurant.    T","useful":0,"cool":0},"ZctliLzhW7k6v4euRS-J7Q":{"text":"We took a trip to New Orleans and I tried lots of restaurants during my time and I consist","useful":1,"cool":0},"XY9TprfpeGomt2JHGSiTlQ":{"text":"Sat for 20 minutes and no one came. Waited for another 30 mins for food. As I'm writing th","useful":0,"cool":0},"3sr1FmyfW7wJDPos4ITU7w":{"text":"Had dinner last night with my husband and his work associate. We had a 7:30 pm reservation","useful":0,"cool":1},"T05J_btQRd_RqsEuhrZ3Aw":{"text":"Had a great experience here, loved the atmosphere and French service. Not something you fi","useful":0,"cool":0},"jsbks7r5Tx5EsJF6eU-sYA":{"text":"DON'T EAT HERE!!! I was very specific and careful to tell the waiter that I have a shellfi","useful":0,"cool":0},"UlAb7Am_Omv2S7MkYKn2rw":{"text":"Here's the thing:  we visited the Palace for a group dining function. So the slow service ","useful":0,"cool":1},"7UrRY5ifR39bFtMgyL_cHA":{"text":"Went for a romantic dinner Halloween night to the restaurant, right in the center of every","useful":0,"cool":0},"WA7smwjaJe1hcgu1dGCuNQ":{"text":"Stopped in for lunch at the bar, temped into a fabulous cocktail. Good friend oysters and ","useful":0,"cool":0},"HM3xh1vwtBaRMIQsCFpqFQ":{"text":"I am visiting Nola with my husband for my birthday/Mother's Day weekend. We stopped at the","useful":0,"cool":0},"3MIRHwPDszAELm5FDmiE7Q":{"text":"My mom and I had brunch at the Palace Cafe several times. It was always a lovely experienc","useful":1,"cool":0},"rVA7O3KV1T6S-xQyBhtYiw":{"text":"Extremely disappointing for a Brennan's restaurant, especially at this price point:\n\n- Wai","useful":0,"cool":0},"0V7YlHizZCXQHm2y7e93Tg":{"text":"Gumbo and blue crab appetizer was delicious!! Really liked the bartender, Chad, who seemed","useful":0,"cool":0},"ciWmY0xxPMRna2dwOPG88A":{"text":"MMMMMM....Andouille Crusted Fish\n\nI love love love the Palace Cafe. I had no intention of ","useful":0,"cool":0},"DeSQZSvGDxa0x6U_fQzjdQ":{"text":"Dined upstairs at the Palace Cafe with a large party from our conference. Reservations for","useful":5,"cool":2},"OxF5RDv07uzQo59MwAW_ow":{"text":"We had breakfast at Palace Cafe and all I have to say is the Shrimp and Grits were fantast","useful":0,"cool":0},"tJkDGAk6ECEDV7OxZPmp0w":{"text":"I have no idea what's up with the bells they make you wear (is that just during the holida","useful":0,"cool":0},"MnGY87TUgFvpfJDmNEKZJA":{"text":"This was the best lunch I've had in a fine dinning room, with a large party in a long time","useful":1,"cool":0},"zbHEfjszZP98DIyz-Kop1g":{"text":"I travel to NOLA regularly and always look forward to an incredible meal at Palace.  I've ","useful":4,"cool":1},"BBM30cbi21QmU7vh9sb39w":{"text":"Fabulousness!\n\nI dined here during French Quarter Music Fest, and it was perfect!  The cra","useful":1,"cool":1},"2Jw_bskcFtv9z0ZEC0M5Fw":{"text":"One of the best meals I've ever had in my life. Had the andouille crusted drum and catfish","useful":0,"cool":0},"jiHfChEdYpMZ0Kq1P0OmjA":{"text":"Ehhh . its alright . we ordered gumbo, oysters , crawfish caskes and a fish dish with a sa","useful":0,"cool":0},"zvLByIxIbgPQNA5QG1w55w":{"text":"Great place for breakfast or early lunch.  We sat out on the patio and it was awesome.  My","useful":0,"cool":1},"MfTKoxRCza9JPO4KWJmnPA":{"text":"I went for an early dinner and ordered off a limited early dinner menu.  I had a glass of ","useful":1,"cool":0},"4vYusf2htPEaK7OgxKNhrQ":{"text":"We had reservations for 12:30 but arrived early and they sat us right away. The decor was ","useful":0,"cool":0},"14xMUtuVdGDPoJ2iPpDPHg":{"text":"ended up here twice while in NOLA, and both times every good.  We were looking for a quick","useful":0,"cool":0},"fiFvksCAwevDEeqcWz5i9Q":{"text":"When in New Orleans, you must have the gumbo which was delicious. We followed that with tc","useful":0,"cool":0},"T0QmmiryBqKoYWBwel7-IA":{"text":"Such a fantastic place!! A must if your visiting New Orleans! Service, staff, and food is ","useful":0,"cool":0},"aK9DZrcXBR3ZquoVAEY1eQ":{"text":"I was recommended the Palace burger with additional crawfish by the waiter. However I was ","useful":1,"cool":0},"nsp_lfo-IaHBZqSa_eZS5Q":{"text":"Ok, I have to admit it.  I was very wrong about this palace.  From the outside it looks li","useful":1,"cool":0},"srRvHcLGxUjgGq5CysQVyg":{"text":"New Years Eve and everywhere is packed as and as usual no booking - well this whole trip w","useful":0,"cool":0},"1O0tFSid67kXA7bYo3FxJg":{"text":"Consistently great! Great food, good service. Definitely a must-go when in NOLA.","useful":0,"cool":0},"_0Aypft4O9E4BKnTMTqRNw":{"text":"From Scotland on a Fly/Drive. Came here on our last night and couldn't be happier that we ","useful":0,"cool":1},"np1jwe1FrsUQOYOUgGOaEQ":{"text":"How this place gets anything other than 5 stars is beyond me. Absolutely fantastic. Servic","useful":0,"cool":0},"di9iIaFNNnQJpYtUZq5MHQ":{"text":"Kind of disappointing and over-rated. \n\nWe came here for our work Christmas lunch. We had ","useful":5,"cool":4},"hGBbS938lgxON44KoqtXnQ":{"text":"The location is great and so is the people watching.  The service was awful, however.  Our","useful":0,"cool":0},"rPB-B1gKqlReVvIMT4MPQA":{"text":"Great food. Great drinks. Second level has a great bar for hanging out. Happy hour has hal","useful":0,"cool":0},"IFQTAq81xXg9indC63XdiA":{"text":"Excellent service, outstanding food, convenient location, and a classic place to eat.\n\nI c","useful":0,"cool":1},"ctFXqqDaDNM5effnX8bgwg":{"text":"Everything about this place was sort of \"eh\". I got the rotisserie chicken and, while the ","useful":0,"cool":0},"5EoUo_SiP4nAF7CdBBYHdg":{"text":"We sat outside, drank delicious drinks (pimm's cup and sazerac) and enjoyed crawfish chees","useful":2,"cool":0},"VKwxR1t6kzm9iBjWp-it-Q":{"text":"This place is another jewel represented by the Brennan family. We stopped in for drinks an","useful":0,"cool":0},"M8VGzETsUpMMa5scs2Ni_Q":{"text":"We had four meals there: breakfast, lunch, 2 dinners. I'm a conservative rater, but this a","useful":0,"cool":0},"p3ITomraJ8iPsIo6t2HDdQ":{"text":"Ok I hate give a really bad review ... But, I took 12 people for dinner.  Ordered 4 differ","useful":0,"cool":0},"3H9FaGsIPrfQqc_oi9Mmsw":{"text":"We stopped in for dessert (bananas foster) as the originator of the dessert is closed, and","useful":2,"cool":0},"YOBfivjBbUxzq365L5GquQ":{"text":"Our Uber driver told us this was a good place to eat. We tried it for lunch\n\nStarted with ","useful":0,"cool":1},"-uv3wID9RKeOWYnN2-8deg":{"text":"How is is possible that I have lived my entire life without eating Shrimp Remoulade? Thank","useful":1,"cool":1},"_85Gvy0XBov7wQDgx4dwig":{"text":"If you can't decide where to go for Sunday jazz brunch this is the place to go! Started wi","useful":1,"cool":0},"a06q-3r0On_TPptIOtvKmA":{"text":"The most disappointing meal of our trip. The bread and butter was great until my husband p","useful":1,"cool":0},"dvWj-k3bz2U6cLVKlnAbcQ":{"text":"Our first time here and was very impressed! The service was the best u can hope for as we ","useful":1,"cool":1},"ExURtESdMZjJtvshUIanvg":{"text":"Great lunch today.  Fabulous basil sweet tea and lemonade to drink.\n\nCouchon to die for!","useful":0,"cool":0},"4BlU80Vw5ZkmvfpWqoPqqg":{"text":"We waited 20mins to be seated during dinner time, after waiting 1hr for the food we threat","useful":0,"cool":0},"DoGhdUZ9E1v7cjQhzbk4Bg":{"text":"okay by national standards, sub-par for Nola.  Always good service, and that goes a far wa","useful":1,"cool":0},"31UbSqRyZFrm5v5y0VFkbQ":{"text":"Great food very friendly and knowledgeable staff. They make great recommendations and sugg","useful":1,"cool":0},"c1BvxvJNefuy4iIiLWhXlQ":{"text":"I've been here four times and I cannot say that everything was exceptional. We had to send","useful":0,"cool":0},"PKtjzEQl4TWSAJDDNl08YQ":{"text":"Normally love this place but last night had a completely different experience.  The servic","useful":0,"cool":0},"DQw5RnxIhhheKT0-BubEog":{"text":"I'm not sure why this place is only 3.5 stars. It is great. The live jazz on Sunday was wo","useful":0,"cool":0},"Ibj18HbcU3WdOKV0ZzLY8A":{"text":"Two words--shrimp tchefuncte. It's damn good. I haven't been able to find another place th","useful":0,"cool":0},"Wp_GVr33sD0_gRKBKKdkkA":{"text":"Went on a Saturday morning. Very impressive restaurant in the heart of New Orleans that's ","useful":0,"cool":0},"3AGgjpttRV0mR0XK8n7sAg":{"text":"Food was mostly good - crab claws were better than the burger, and the free bread was my f","useful":0,"cool":0},"Gb6GSdBL0aK58pAWrTcjbQ":{"text":"Large-ish party here to celebrate my brother's 50th.  The food was quite good: the andouil","useful":0,"cool":0},"_lCZQYzJrYtAgDBfp9ilOg":{"text":"Great place for brunch! Try the crabmeat cheesecake and shrimp tchefuncte! Both amazing. G","useful":0,"cool":0},"J9YplUW-0K7PuUDw79rWLg":{"text":"I had the fried oyster salad for lunch. The dressing was very tasty and there was a good a","useful":1,"cool":0},"pYmENWoeR7XHSx9R5zcqzA":{"text":"Styled like a late 1800s French cafe with a jazz band who walks around serenading patrons,","useful":1,"cool":1},"KE1ZUBApyfzYNpBN2YUTQQ":{"text":"First of all, the service from start to finish was amazing.  Although, we were only a part","useful":1,"cool":2},"EqSFTWIqR1ZbPv6RQEB0Eg":{"text":"Visited two night ago for a four person business dinner. Everything was fantastic in terms","useful":0,"cool":0},"8qtMzKcZioZikbggBhfXxg":{"text":"We kept walking by and seeing banana Foster on the menu in many ways. We finally stopped i","useful":1,"cool":0},"xBT6mBUuonQBqnO5lJbL0Q":{"text":"Tried the \"temperature special\" (yesterdays high was 93 so lunch was $9.30) ...it sounded ","useful":0,"cool":0},"3r8LkFfn-WfG31OKjCk8pQ":{"text":"The food was good. Location was great right on canal street.  We got a window table on the","useful":1,"cool":0},"VFOro59ozTP_YWT2kkJKjA":{"text":"I've only been here twice. Both times I've had dessert. And I've not been disappointed yet","useful":0,"cool":0},"zN9FYeuA6li0kL7C8EuArg":{"text":"Fun evening. Visited with several work colleagues - all of us from out of town. Service wa","useful":0,"cool":0},"lo6JUebRBHJn5P3S06qU6Q":{"text":"Excellent dinner following a Saints game.  Filet was perfectly cooked medium, as ordered. ","useful":0,"cool":0},"a0stiQUdGAE_1jTvEkLK9Q":{"text":"Great drinks, service, food and dessert. Andouille crusted fish was classic NOLA fare!","useful":0,"cool":0},"Zl9Uvv64Cpr7--QOYUMtdQ":{"text":"I had my bday dinner here. Looking at the other reviews this place is either a hit or miss","useful":0,"cool":0},"VpfIBch2sIMxp3QTCqteBg":{"text":"What a wonderful place.  We have been here before, but this visit was especially nice.  We","useful":0,"cool":0},"I_aQtX5NVkW0rElP5XRdSw":{"text":"Palace Cafe was the very last place we went to in New Orleans.  I was a little sad, but I ","useful":0,"cool":0},"8MCRrVNEg28UHEqiI49eRQ":{"text":"This is the first \"fancy\" restaurant that I have ever been to.  I must say that it is stil","useful":1,"cool":0},"HCa8YsvmVbqSK3KsrQfU3g":{"text":"If I could I would give 3.5 stars.\n\nI ate here out of pure convenience (it's located next ","useful":1,"cool":1},"aV8O9y7TDzOgwPyw50EqJA":{"text":"Had a pretty bad experience here. Ordered the crabmeat cheesecake and a mimosa. Both were ","useful":0,"cool":0},"e2F8UedW5dL2lCKXz3Xhig":{"text":"We LOVED the Palace Cafe! We didn't experience a single negative thing about our visit - t","useful":0,"cool":0},"WGshmEccbcHNfq4LwQ2JmA":{"text":"Now,PALACE CAFE you know you wrong!!!\nNow I realize that it has been since the day after P","useful":1,"cool":0},"mrY6DE23Qk_dPK91muZw1A":{"text":"Mothers Day brunch was lovely. To start they gave every mom a beautiful red rose.  Then I ","useful":0,"cool":0},"bfnPiL6JDwTRvJQ_tB7JXA":{"text":"Overall fantastic experience.  No reservation and it was crowded.  The hostess indicated t","useful":0,"cool":0},"ISfTVxt26b4z_ezyWVsdOA":{"text":"Great classic beautiful place! I had the shrimp and grits which I highly recommend. You ca","useful":0,"cool":0},"LhNgiWPSPKelA6q1aVFKqQ":{"text":"Top notch service. Delicious bananas foster made tableside. And scrumptious BBQ shrimp.","useful":1,"cool":0},"NzFbu2ldGLZCkEk3znRmoA":{"text":"Came here for a late brunch on a Saturday. It was very busy but we only had a 10 minute wa","useful":0,"cool":0},"lImOp1LbwsVQqLdKuijEEA":{"text":"I had a lot of good meals in New Orleans. I had an amazing meal at the Palace Cafe. \n\nFood","useful":0,"cool":0},"U6Z76-EJnoKt2RofLluy6w":{"text":"Went for my birthday and it was wonderful. Delicious food and good ambiance. The bananas f","useful":0,"cool":0},"_WgcaHFtSxHP6ZTCK8Zj-w":{"text":"Yummers! Great ambiance, location, food and service! Loved the crab cheesecake, turtle sou","useful":0,"cool":0},"FYh9BdfyFNZZ0EnfbEt13A":{"text":"Decided to stop in for a couple of appetizers and a drink.  I love bourbon and couldn't wa","useful":0,"cool":0},"QOE61vQUsGUnR3niXhsWwQ":{"text":"This place came highly recommended.  We had several variations of the duck.  Mine was a du","useful":0,"cool":0},"E5OC4fINp2goM05O46rTqg":{"text":"Our first time at the PC since there are so many restaurants in NOLA to choose from. We we","useful":1,"cool":0},"v34Toe3lDGN0fS_o_WIVEg":{"text":"Ok food, terrible customer service! Not worth your money. You can get better food at a sma","useful":1,"cool":0},"qkMUenmxyepthceoNPUj-Q":{"text":"Stopped here for a late dinner after checking into our hotel.  Food and service was fantas","useful":0,"cool":0},"5QShocfbvDES6yU_BOBr9A":{"text":"This was in December, but I feel it needs to be posted!  Forgot about it...\n\nFantastic. I ","useful":0,"cool":0},"UbXOEBbtu-j1E7kAQhoMmw":{"text":"Through the course of the evening we had 3 different servers so that was a little weird! E","useful":1,"cool":0},"8IVzdYpxnN4-Qv-4Kgm4Ew":{"text":"Food was good.  However, Manager actually gave us pretty mean looks when we asked our wait","useful":1,"cool":0},"p8PAMcK8e5hjsK-x3MZcRQ":{"text":"The food was good. Crab cheesecake was  delicious. Catfish & shrimp entrees were great too","useful":1,"cool":0},"uoO63kpmFz_udlGUnWEMMw":{"text":"Pecan catfish. Crabmeat cheesecake. Mmmmm.  I am probably upvoting it a star due to the to","useful":1,"cool":1},"Ti4yckLzBxN7gkcy7iynAQ":{"text":"Ridiculously good breakfast. Try the Eggs Benedict. Also the sausage is very good. One of ","useful":1,"cool":0},"bFPFDPkp0TZZIiozt4Q3iQ":{"text":"I'd sum up this restaurant as a place to go for the experience.  We had a lovely lunch wit","useful":1,"cool":1},"58A7KoXyFD7fE7vdEEOhuA":{"text":"Overall - nice atmosphere, service is friendly but slow, a bit pricey for the serving size","useful":0,"cool":0},"XVaLwykC9B2_FcTIUWpKhA":{"text":"Although the service was slow in every way it was a beautiful day and we sat outside, so I","useful":1,"cool":0},"osXp29KbgPAwGLjMtXAwMA":{"text":"Love this place. Staying at the Roosevelt, and only 2 blocks away. Get the banana foster a","useful":0,"cool":0},"4sa1-9Px3qBA-vcXyxOYnw":{"text":"Great live jazz brunch,  attentive service. Prices reasonable considering food quality and","useful":0,"cool":0},"Sv2DL21jHvj-OHwHEkr2Sw":{"text":"Was bummed I could not have gotten breakfast as I showed up at 11:15 and lunch starts at 1","useful":0,"cool":0},"z_uGlV_iozKIwQbY1tYw_A":{"text":"I have been coming here for years. I really love the crabmeat cheesecake. It's tasty and f","useful":0,"cool":0},"mKjs6cKm-Ug7KdVOaFWiUg":{"text":"Located on Canal St. A very upscale restaurant that serves even the most casual of individ","useful":0,"cool":0},"0Qg1Mx0nZspnNBt7n_sbUQ":{"text":"I had breakfast on a lazy Friday. Service was excellent. The eggs Benedict were served ove","useful":0,"cool":0},"_iXQEIYqhor4eAcykyKq3w":{"text":"The food was great.  From the appetizer, soup, salad, and dessert.  Our party of 4 was ver","useful":0,"cool":0},"WnIX-jRRfdzjP6SiSNIQFg":{"text":"Food was very good, service good, nice and casual.   However,  have to be weary of up char","useful":0,"cool":0},"0iAL8_DtNZLhn_Qq_WNlpw":{"text":"Me and my girl had Sunday brunch on the sidewalk in my favorite city (next to Oakland). Th","useful":0,"cool":0},"ritOO2zu-bYp3nFWgOp-WQ":{"text":"Great food and solid service. Late breakfast as they were switching over to lunch service ","useful":0,"cool":0},"7X6muLCko7nrzhY6nXFWwA":{"text":"Wonderful ambiance, Gumbo up to Brennans standards, fish was tasty but slightly too thick.","useful":0,"cool":0},"6kAUI-G0Kzad0YLSV54aiQ":{"text":"New Orleans has a hard time poaching an egg. Service was meh. Saw our waitress twice and o","useful":0,"cool":0},"eGcq8I8iFKEUZs_RBwtAzg":{"text":"We came to Palace Cafe for dinner on St. Patrick's Day. We had a reservation and got a gre","useful":0,"cool":0},"LiL-8SgB6T5GjJWbyUJHSg":{"text":"I hate to give this place a \"1 star review\"; however, after my experience last night- it s","useful":0,"cool":0},"6OBsJ69u3vOV-r5s0AvvdQ":{"text":"First time in NO and palace cafe was the first restaurant across from hotel.  Enjoyed the ","useful":0,"cool":0},"sRjpaMZ-lZyzJsXXoMs-tg":{"text":"I tend to avoid tourist spots but I decided to try Palace Cafe with some friends. We order","useful":0,"cool":0},"WCp3oxXwrq1mA9JHYwTtYQ":{"text":"Nice, expensive place. Crab cheesecake was tasty, but the crust was nearly burned so had a","useful":0,"cool":0},"zcCvTAUTM_3uRfFP6d0QIw":{"text":"I went to the palace specifically for the bread pudding. I have to say it was pretty under","useful":0,"cool":0},"HbQlHo5TU6y5xuV-T58Zgg":{"text":"The service here is exceptional! This definitely something I always love but sorry....the ","useful":1,"cool":1},"dHJQGgUGHzb4eLOvDq3Nzg":{"text":"Had breakfast buffet here because we did not want to wait in line somewhere else. Got to s","useful":0,"cool":0},"HPA1IR3l-W_ccP3sfbEA-w":{"text":"I have never had a bad dining experience in New Orleans until now. I'm giving Palace Cafe ","useful":9,"cool":0},"zplXfu3G--zLCxLAEaaREw":{"text":"After our 4 hour plane ride, we were hungry. We wanted to dine at ACME, but the line was r","useful":0,"cool":0},"wEJ6ekvd_vYCkybxdgu53g":{"text":"We learned about Palace Cafe on the N.O. forum on Trip Advisor.  Figuring that we wouldn't","useful":1,"cool":0},"SRbL9q99kwKSlpobqGQ3bw":{"text":"The Palace Café has not only incredible food, but incredible service. We had a large party","useful":0,"cool":0},"9EVvBa4tnJB4dr5e2OCWrg":{"text":"The food was very good. The wine was kind of boring. Service was excellent.\n\nWhat I had: a","useful":0,"cool":0},"qAU7hqj2KmYaXFZprlFcwQ":{"text":"Had dinner in private Wine Room: great service and great food!\nFried oyster app was amazin","useful":1,"cool":1},"pVMzs6TR4LiAiqL7-Lzb7Q":{"text":"Ambiance-  5   (10%)  Very upscale, tables separated nicely for privacy.  Tables set perfe","useful":0,"cool":1},"vA_lN0bG_HRL67n1RIG70w":{"text":"I'm a big fan of Palace Cafe.  I've had to travel to New Orleans a few times in the last 6","useful":1,"cool":0},"YfUlOWigx4NAtl4f-Cr9nw":{"text":"Wow, two for two for Dickie Brennan today.  The food here was a bitter disappointment.  I ","useful":0,"cool":0},"OJy8fAEdiyLIzJAkp2R5BQ":{"text":"Old record store turned into French bistro.\nWe had the first meal of our trip here, an ear","useful":0,"cool":0},"EAXAlnqn2IkifRU1nh_SRw":{"text":"While visiting New Orleans, I had lunch at the Palace Cafe with some friends. We were in a","useful":0,"cool":0},"JbYrRuC48Sq2r-sl1d0nyA":{"text":"Came here with a group of 13 for a bachelor party. We did 1030 am Saturday Brunch and ever","useful":0,"cool":0},"X7SKtl8fNJWC4BE1_LEs3g":{"text":"Crabmeat cheesecake is amazing!!  \n\nCharming spot right off canal where you can sit outsid","useful":0,"cool":0},"qTvdR9PVRWELK988bHp16A":{"text":"I ate dinner here tonight.  I read reviews about the shrimp TCHEFUNCTE ahead of time. One ","useful":0,"cool":0},"d5osaGenuLuHCZN_RTcAHA":{"text":"Hit up this place because we'd just gotten in from a flight, it was a few doors down from ","useful":0,"cool":0},"6qalIyV5veA3GV0zLmj6lQ":{"text":"My review is only based on my experience at breakfast.  I was in New Orleans for 4 days an","useful":0,"cool":0},"NmoRXaLme34Pv9fiAKlGMQ":{"text":"After reading some reviews I was skeptical. But being a Brennan owned restaurant I gave it","useful":0,"cool":0},"HSG2j90POU61igMcI4Iw1Q":{"text":"Cannot express how awesome the turtle soup was. Best ever! Service outside was perfect as ","useful":0,"cool":0},"ZB8qHvUfrfrx2Yk_KSbLfg":{"text":"The Palace Cafe was pretty good - the full menu has some reasonably priced items along wit","useful":1,"cool":0},"zxFDa185HyI1AZw-xGtU5A":{"text":"For our last night in New Orelans we were wondering around in the rain trying to find a pl","useful":0,"cool":0},"OJp_ryeg2gwclb7r60avpQ":{"text":"Ok so this place is weird. It has a drink specialist and a food specialist. I've never hea","useful":0,"cool":0},"1GTf2BEmcCJpzq5bzLwp0Q":{"text":"Amazing food! We ordered a bunch of small plates during happy hour. Everything was so deli","useful":0,"cool":0},"9gz-HJOsM8O4mW_Tn4GEKA":{"text":"The restaurant is not what you'd expect from Canal Street. Palace Cafe is a very classy th","useful":0,"cool":0},"U3EwFB5m4U9qonfL-KctLQ":{"text":"Wandered in here for dinner last night and absolutely loved it! Service was great from the","useful":2,"cool":0},"hyIXX60lETI0BjbK92TDzg":{"text":"Food and drinks are great. Fried oyster salad is delicious. Service was not that great.","useful":0,"cool":1},"lhcr3gopqRU83Pd_oG12kg":{"text":"The most fabulous fried oysters paired with a blue cheese salad, side of turtle soup with ","useful":0,"cool":0},"YZQ-SUfjxg0HR55DGV6TRw":{"text":"2 words: shrimp tchefuncte.....rocked my world. The sauce was to die for and I just wanted","useful":0,"cool":0},"TD_cRQQJiQfm8BqkVHuGQA":{"text":"I came here for dinner on my last night in New Orleans. Everywhere I ate was great, but th","useful":0,"cool":0},"vgTB1CIs7XkLqotcjd69Fw":{"text":"This place was better back in the day.  Today, it's nothing special.  I had the chicken an","useful":4,"cool":0},"ktC8dwdVJ9Lqpcsou_vTow":{"text":"The most amazing French food!! Wonderful service and did I mention the food is amazing!!","useful":0,"cool":0},"0wKe_WyGbcFDpn5DY_ue2A":{"text":"First let me say the service here was amazing. We had like 3 different people tending to o","useful":0,"cool":0},"nTnkUtpqZ8TQmxHxwh4WlQ":{"text":"We went in for the sole pupose of having bananas fosters. ( a delight to eat and watch bei","useful":0,"cool":0},"N5vRiFW-wezx2G3zsJmDNQ":{"text":"Had the pot pie and it was amazing! Could've been warmer but the quality and flavor was sp","useful":0,"cool":0},"g_I06waW2t2vnm89LPhubQ":{"text":"My favorite spot in Nola, the menu constantly changes but everything I have had is excelle","useful":0,"cool":0},"-D5vZTuqLF5oo04VaPZ1-Q":{"text":"We arrived late afternoon and were staying across the street at the JW Marriott..(nice hot","useful":1,"cool":0},"kX8qAt15xk14S3W7Dy1qMw":{"text":"Was really looking forward to our meal here.  Drove past several times and looked so fun w","useful":0,"cool":0},"Xrsr6Hopsfu67sFMWsS3Zg":{"text":"I was really impressed! We made reservations a head of time and got there about 5 minutes ","useful":0,"cool":0},"-ZDEqAR8Vf73m66Bxoqa_Q":{"text":"We ate here our first night in New Orleans.  The food was good, wait service  was also goo","useful":0,"cool":0},"TCHIBKIGM0DTg2r8Zr9UdQ":{"text":"The breakfast here is out of this world!! I had the crabmeat cheesecake!!! Best thing I've","useful":0,"cool":0},"G4EsgYRDxgRtxBXXLZLSTQ":{"text":"Food was good, ambience was nice and the server was very accommodating even though I arriv","useful":0,"cool":0},"CE35ug4PloodrmWuiIK_AA":{"text":"This is one of Dickie Brennan's fine dining establishments that is on Canal Street and  th","useful":2,"cool":1},"Hw6U9orHxNlhIdaT1HXUcQ":{"text":"Nice sidewalk tables for people watching and drinks, and the food is decent, but the wait ","useful":0,"cool":0},"eNCe0_iSGJjfShTWGtKxsg":{"text":"It's a 4 with an asterisk.  It's never a 5 here, but sometimes you have bad luck and get a","useful":1,"cool":0},"nh9Pyj07Xtt4RXJr6HwEoQ":{"text":"Expensive place in an area where cheaper and better are all around. Great place for a fanc","useful":2,"cool":0},"r1Cv6u8iryKM5vmFo0ZfEQ":{"text":"Came here based on recommendation. Drinks were good. Service was good. The restaurant itse","useful":0,"cool":0},"NZDV_yoy5eA3uHMChK8Gpg":{"text":"We stopped in for brunch on a Sunday and the restaurant was so jam packed that they could ","useful":0,"cool":0},"yVfIhNq2PeTMd6n9hf1_xw":{"text":"After waking up at 1pm and hungover in the Big Easy, you gotta to figure out where to have","useful":1,"cool":0},"ZQ89n1LTb8Bdfv3JJX3WNQ":{"text":"I'm only giving the place 3 stars because of the service.   The food is amazing.  We had t","useful":0,"cool":0},"vgoSfFdEuY5AYwTrANf7tA":{"text":"Had turtle soup. It was okay I guess. It was the first time I had ever eaten it so I have ","useful":0,"cool":0},"pqL4WHUYVQ6y2gEw5Uxj4Q":{"text":"Best food we have eaten in New Orleans. The service was great. The staff was attentive, an","useful":0,"cool":0},"B7dHyt6YPfmekk8wqCKxxw":{"text":"We came here the week before TS Lee landed in NOLA.  Brunch was recommended to us so that ","useful":0,"cool":0},"UV6HCgLk4W38YG5Ey9jI5w":{"text":"I enjoyed this restaurant for its simple, Southern charm. The fresh baguettes served with ","useful":0,"cool":0},"z58R1kQqOLES2eeB08swiA":{"text":"Dog friendly and delicious.  If you've overloaded on deep fat fried food, you'll find a we","useful":0,"cool":0},"VrxikduOPWbXSbeutRHi6Q":{"text":"Excellent food and service. My favorite Brennan's restaurant !","useful":1,"cool":0},"OMg6rPR4mddnoOALYxnM_A":{"text":"My husband and I went to Palace Cafe with another couple to celebrate our 30th birthdays. ","useful":0,"cool":0},"dRfgimqWWVHSuLjOh42eqA":{"text":"Poor service.  With so many options near this place, you are better off going elsewhere. E","useful":0,"cool":0},"s9gVvobttik876k4PNAThQ":{"text":"For not having anything vegan on the menu it was one of the best plates of vegetables I've","useful":0,"cool":0},"oT9IgVuqg5GRciEVN-trYg":{"text":"We stopped in right before a parade and it was super busy! There was a 45 min wait so we o","useful":1,"cool":0},"2Hs59xWZPYe-kxRDdGqO_Q":{"text":"Walked in for a quick lunch with no reservation.  Waited 5 minutes...before taking a seat ","useful":1,"cool":1},"yupusa7pkQ-Afqqv4cZDmA":{"text":"Wont write much!  \n\nTry the Andouille crusted fish.  It's amazing!  Wow..., the sauce..., ","useful":0,"cool":0},"N6vEuY5CXGTCl-zndqVkNg":{"text":"Came in for the bananas foster. Was pleasantly surprised to learn you can sit in front of ","useful":1,"cool":0},"zeWAlV6VDhV7OXwxtluafw":{"text":"Fabulous restaurant. Had the catfish pecan and it was delicious. My husband had the chicke","useful":0,"cool":0},"rS7L2Zi56-CJXZuePK5Ydg":{"text":"We were impressed.  Convenient to the Marriott or Sheraton, this two story place looks lik","useful":1,"cool":0},"hMYEzGO78EgcI8c1AjQuKw":{"text":"If you only get one last meal EAT here. So F...king good, the New Orleans BBQ shrimp will ","useful":0,"cool":0},"K1-MWV6cVVwKXo4d6TqxdA":{"text":"Taking a quick business trip can be stressful, but eating new foods from different cities ","useful":1,"cool":0},"ILg_QwEB2PFNEXyFGFZ_9A":{"text":"Friday night our department brought a large group for dinner. The vibe of this place? If w","useful":3,"cool":1},"QeXbT8nj4MEXYCam02bClg":{"text":"Overpriced for below average service. Wasn't impressed. Waiter didn't even ask if we wante","useful":0,"cool":0},"L2pdX6fn2k3GKJIo18uu8g":{"text":"We came for brunch, they have great creole  brunch menu. Jazz trio came around and played ","useful":0,"cool":0},"HZC5i5t4D6JPnlnaXqDrjA":{"text":"They decide your tip; it's 20%-when you use your credit card.\nWe had a nice meal. I partic","useful":2,"cool":0},"yKup1rM95hSUEYXBeUxcFw":{"text":"There are many reasons to love this place ... it is the former Weirlein Music Store ...so ","useful":0,"cool":0},"xYsZ9WhU9xYcmIcE0lL8xg":{"text":"Based on a recommendation from an acquaintance, my friends and I (5 ladies celebrating our","useful":2,"cool":0},"1rkeP4X0OcVmduGV8s0_BQ":{"text":"As far as my husband and I concerned, on a scale of 1 to 5....we give it a SEVEN! The ulti","useful":1,"cool":0},"WfT20b-odpGE1Ye6YCac_w":{"text":"Every time I've visited New Orleans I've walked by this place, but I never had a chance to","useful":0,"cool":0},"TyIazFCtk9vrOKnK-YEMxw":{"text":"This place had good food, not light in fare, but very good. It was on Canal street which w","useful":0,"cool":0},"-AM0GToJvro0Sq3IicqO9w":{"text":"Wow, super attentive service and pretty quick for a busy Friday night. The server recommen","useful":0,"cool":0},"Hunqy3nGoQVsKE7Zx4iNcg":{"text":"I had the duck with foie gras.  It was absolutely sumptuous.  It melted in your mouth and ","useful":1,"cool":0},"JIW12qFdinPk3pCGGPcekg":{"text":"We came here for the jazz brunch.  The service is really great and friendly and they're no","useful":0,"cool":0},"Y5-OgTmh93hRjwRESNHhGQ":{"text":"We had lunch here and were very happy with it. I enjoyed the fried oyster po boy with frie","useful":0,"cool":0},"ah6RGPhcNpQ1ilJHi16_zQ":{"text":"We ate here last night and it was excellent!  Everything was great. We were surprised this","useful":0,"cool":0},"CD50A3tpt9ZczrBNmZNGKA":{"text":"Went here with 9 guys for a bachelor party for a nice dinner on our first night in NOLA. T","useful":0,"cool":0},"Tp3eTHzgvkQthE0VD_KBaA":{"text":"It's been years since I've dined at Palace Café.  After a rough day, I yearned for a drink","useful":0,"cool":0},"AgXsPRQTtWfFJC1aycapoA":{"text":"Went for the $5 after 5pm. Sorry that we went.. Sweet potato fries were mushy, duck spring","useful":3,"cool":0},"0ltxY9qlN4urzGnmZptonA":{"text":"From Los Angeles and had the greatest time coming here.  Met two bartenders, Taylor and Ni","useful":1,"cool":0},"lq-dmNJwm6OEjQSRFevcgA":{"text":"An impressive 3 story restaurant with a certain old world charm.\n\nMain floor - the kitchen","useful":1,"cool":1},"PsrpQ9R2t_sJdaDk3Txqmg":{"text":"Fantastic food and the atmosphere of the old Werleins building is outstanding.  Service wa","useful":1,"cool":0},"odfUdGGJ839ikLygnlhM-w":{"text":"To get to the point, get the Crabmeat Cheesecake and Bananas Foster.  The end.  There's no","useful":3,"cool":0},"c-3FrsUUIlciOUQgfk4otQ":{"text":"mMmMmMm!!  This place has my stamp of approval for yumminess!!!\n\nFor the past several days","useful":1,"cool":2},"tlQetXV5sGMEW1nUIxUJHw":{"text":"Great place for a tasty dinner. I had the herb roasted chicken and the Peter's Planter's P","useful":0,"cool":0},"5ueHtbqgmcG1Fk2ox1evQQ":{"text":"In town for a business conference and stayed at Marriott right next door. Went over for di","useful":0,"cool":0},"u3tfq34RWOXHDausThEYIw":{"text":"I loved everything! I went with my fiancé for breakfast. I had the bananas foster waffle a","useful":1,"cool":1},"hZhD7Qq728q3I7L1hg4bSQ":{"text":"Best white chocolate bread pudding! \nEvery time I'm in Nola I go to Palace Cafe and order ","useful":1,"cool":0},"0yOamw28rUw8yO8fMveIRQ":{"text":"Took over 1 hour to get our food despite a late lunch. After multiple excuses of having a ","useful":0,"cool":0},"BTEnZoMkA81UtHzv1GXS1w":{"text":"Their temp lunch is nothing more than an Advertising Ploy! We got there at 1:15pm and they","useful":0,"cool":0},"sA0oybfzuf80bk2zy2onZA":{"text":"First of I was just in New Orleans for four days during Mardi Gras with a group of nine gi","useful":0,"cool":0},"dDKErd0W5-tFOGJrJ9oUaw":{"text":"I love this place. The crabmeat cheesecake alone is worth coming for, the service is alway","useful":1,"cool":0},"5d4bFECjZIUOVsBSzE_WUg":{"text":"I always seem to need the half star (why is that - lol?).  I just had my second small meal","useful":0,"cool":0},"ziZwqFxgZlmXoiHNwCkHPQ":{"text":"Terrible service. Patio for ten minutes and no service. Sign says seat yourself. No food, ","useful":0,"cool":0},"t0XhUc5mBiCiYka1SLOa3Q":{"text":"Very good service. Extensive wine list. Reasonable prices with very good food. Great atmos","useful":0,"cool":0},"4ZCmL0eTlBdzbEGOArQ54A":{"text":"This is an upscale place, you can't tell too much from the outside but it's really really ","useful":1,"cool":0},"xplogdrfiHDcrARoIQ_WLQ":{"text":"I don't usually give reviews. In fact, I never give reviews but my experience at this rest","useful":2,"cool":0},"vviuem1QmceR0KuZtzbyLA":{"text":"Amazing food....Jeremy and Claire are amazing!  Went extra mile to find our favorite tequi","useful":0,"cool":0},"hg-f6igCdi6ETW24C_dgFw":{"text":"Let me start out saying this place is well worth the try. It was recommended by the Omni s","useful":1,"cool":0},"j5AxQUbF19EY5TGXXhcuXw":{"text":"Three words: Fried Oyster Salad. I love oysters, fried food and hot sauce and my friend I ","useful":1,"cool":0},"fi0KvaFnzWSVnpT5Z9-dWQ":{"text":"The new renovation is spectacular and the rum menu is phenomenal. Truly, try the new cockt","useful":0,"cool":0},"3VgyrbOZX-tSrLBT45o6-A":{"text":"While craving a midday snack we went to the PCafe. Everyone had salads and the bread was u","useful":0,"cool":0},"vdmOa8v5bQMAzvcmnGR4og":{"text":"I like to think that a good way to gauge a restaurant is to first try out their lunch or h","useful":10,"cool":2},"ew7MtMgjn4EBCksywn7Ecg":{"text":"This place was amazing! From the other side of canal it didn't look like much, but the atm","useful":0,"cool":0},"zdMyqPFcfHzAV_Il-Hwydg":{"text":"Great brunch place. The staff was great. You can build your own cocktails while dining. Th","useful":0,"cool":0},"fjkN62WwY3pJwtdwrhG9PA":{"text":"Have been there many times over the years. Had been disappointed in the service, acted lik","useful":0,"cool":0},"SVc9TIsi4b7rKOoZ1oVh6Q":{"text":"My two sisters, their husbands, my wife and I have been coming to New Orleans with my pare","useful":0,"cool":0},"u3WFzqQ-9K7Y3Cmgx18V9w":{"text":"Went to the Palace Café to get bananas foster from the people who invented it. The place i","useful":0,"cool":0},"_UM2QD1vj1Wzx8BR-mDR_w":{"text":"This place was fancy and had cool vibes. My friend an I ordered the bananas foster which w","useful":0,"cool":0},"iMj4M8gNm-lESk2Z35lTSA":{"text":"the price and the food was not worth the wait. service was slow, the servers never came to","useful":0,"cool":0},"qp1AC2E_AcjTlDxozR5UTQ":{"text":"This was our first meal in New Orleans and as I write this on our last day of vacation, it","useful":0,"cool":0},"XIfTqjghy3iAMHyNl761kQ":{"text":"My two friends and I came here on the last day of our trip for our last meal. We hadn't ha","useful":1,"cool":0},"D0FB8xk_whuhg8oNN_KrZA":{"text":"i was only here for one very quick drink. but the service was impeccable and the drink was","useful":0,"cool":0},"1lB-eiOeCIxMBtxBQJaCLw":{"text":"I have been an irregular customer of Palace Cafe since they first opened in the early-90's","useful":4,"cool":3},"PaFDnORf-7_97WQRQR0VZA":{"text":"I'll keep this short and sweet:\n\n Dinner = Turtle Soup, extra sherry + Duck au poivre = Ha","useful":0,"cool":0},"hvN4UZq_B1sEX3TKEHMHiw":{"text":"Compared to our horrible crazy dining experience last night at Irene's this place is 4 sta","useful":0,"cool":0},"2BzqrQ-m0iaAOBRoiyzy9w":{"text":"This place is really just  overpriced breakfast. I ordered 2 coffees and the crab cheese c","useful":0,"cool":0},"-Ri0vuxMpnPU7QFxlSIPug":{"text":"Came by Saturday. Overall I believe this is a great eatery. Very casual, touristy but the ","useful":1,"cool":0},"544LbKhv0lF_5cfvZmdqzg":{"text":"Had  a GREAT jazz brunch here after a night out in the quarter. Love the hustle and bustle","useful":0,"cool":0},"iyxrKqZvnmb9yfcHnp8NLA":{"text":"A group of friends and I took an out-of-town visitor to Palace Cafe for brunch. It was mos","useful":1,"cool":0},"H3_1KOUXD_5M4WtNdZk0Pw":{"text":"Very nice elegant restaurant. Loved the ambience the wait staff and the food. Worth the pr","useful":0,"cool":0},"e-BbxzGA4TeE7bn00_h7EA":{"text":"Oh my. Gorged myself with no regrets. Started with a drink called Palace Punch. Just enoug","useful":0,"cool":0},"TO-2GdQf9potu3lobkhE9g":{"text":"We were going to another restaurant but the long was too long. Just happened to see this p","useful":0,"cool":0},"dLa2RmhNdAdAJQKAKcuSEQ":{"text":"Part of the Brennan chain of restaurants, the owners of Commanders Palace. Went for the Eg","useful":1,"cool":0},"fcVAh4B7pz5pjcxsl3ygTQ":{"text":"LOVED PALACE CAFE!!!  LOVED!\n\nWe dined here for brunch and it was AMAZING.  Started out wi","useful":1,"cool":0},"qH2WD0e8sSQVYcxNEWqwpA":{"text":"we had a light dinner with soup and salad. Salads were a good combination including fresh ","useful":0,"cool":0},"B0jyys9hVUpktcwJzIL2dQ":{"text":"We love to take our friends here that are visiting from out of town.  The food is really g","useful":0,"cool":0},"4pO61dS6YO3l1cBB3ZMRNg":{"text":"Went two weeks ago.  Got seated right away out front.  Three employees stopped by within t","useful":3,"cool":1},"p5KYHrHkAC4K18844K5zZA":{"text":"Update.  We went this year.  Service was very poor.  Gumbo was ok.  Salad was good.  Go to","useful":0,"cool":0},"v8sGtnhRz-jk80q5zcBMNg":{"text":"We were here 2 years ago; fortunately, not much has changed.  My sweet heart and I have li","useful":0,"cool":0},"tpbMqFC8MjMuKOAdP4jkxA":{"text":"This is probably my favorite restaurant in New Orleans. Our reserved table was waiting for","useful":0,"cool":0},"SvwItwESapO6-87Lo5bo2w":{"text":"Tres bonne idee d y aller pendant le happy hour (16-18h) car 50% de reduction sur vin \"on ","useful":0,"cool":0},"jPl51ODGON0Sr-yFOvIHAw":{"text":"I hate this because the Palace Cafe is one of my favorite restaurants in New Orleans, food","useful":0,"cool":0},"kMkDReCw5xR2PcI4VN8mJQ":{"text":"I'm ashamed to say that I had my first experience at palace cafe recently after working in","useful":3,"cool":3},"OCPDwCTWeohPw2OBDg3JYQ":{"text":"Group of Four for dinner.  We had no reservation and opted for the bar area.  We had okay ","useful":0,"cool":0},"WxmY796RrgCTxS2UBCK6kQ":{"text":"I have been a Palace Cafe fan for years but this is the first time I've reviewed.  My daug","useful":0,"cool":0},"ev-ZLNe4SbgXG-lroU8FDw":{"text":"My friends and I were in New Orleans for a conference and we decided to have brunch at Pal","useful":1,"cool":0},"MGyh4AsOENK3EVYS9_hYMg":{"text":"We were looking for food and decided to just walk in not knowing anything about this place","useful":0,"cool":0},"EnSgdnUknLYGIZ11IBPk0A":{"text":"The food here was to die for. I gave it only 4 stars simply because the service wasn't gre","useful":0,"cool":0},"z8-OtEK1ZlzpgLph-HIy9w":{"text":"This is the absolute worst restaurant I have ever eaten at in my entire life. If you come ","useful":0,"cool":0},"ogIeJ3CQS5m9zS4y5O4QWg":{"text":"Stopped here for breakfast and the atmosphere reminded me of a Parisian bistro, we dug int","useful":0,"cool":0},"9iEzFd9Wb9QUS9PuG3DWlw":{"text":"So much hype, not enough substance.\n\nWe dined here with a large group on a busy Sunday mor","useful":0,"cool":0},"XjWIbP-zXeIZrTdyLEG1Dw":{"text":"Awesome food and service.  Great atmosphere.  Butternut squash soup was perfect.  Crabmeat","useful":0,"cool":0},"XhGpE3mQoXdaiSaGsjN5lg":{"text":"Palace is a staple New Orleans spot for me and my coworkers.  Food is great and we've neve","useful":0,"cool":0},"_8UY4saeLC-kRa-ZgT30MA":{"text":"Fantastic food. Excellent service. Some of the best potatoes I've ever had. \n\nWould recomm","useful":1,"cool":1},"8xalqieaoxinaCmY0aMKfw":{"text":"I'm a local and I work about 3 blocks from Palace Cafe. In all my years in NOLA, I've neve","useful":0,"cool":0},"1EautfmfzwElRRcDVSRudQ":{"text":"Only reason I walked in was because all other restaurants had a 1-1.5hr wait and they actu","useful":0,"cool":0},"KR4XSPrAonjHeFrlul0J2g":{"text":"I went here for dinner on the night of Easter Sunday, which may have accounted for the cra","useful":0,"cool":0},"ECJ7lshX-k9G9RTyj0GU5g":{"text":"We had dinner there on 4/28/11.  It was fantastic.  the service was very good.  The food w","useful":0,"cool":0},"llfY8uuKZ41JoDpX2OLn5Q":{"text":"Stopped in because I was undecided and in a time crunch to walk over to Essence Music Fest","useful":0,"cool":0},"VOQhNZBlInC5Nc9usnAORg":{"text":"Went to Palace Cafe on 5/13/13 with my boyfriend and his mother. I will admit this was the","useful":0,"cool":0},"V-0hjiApZ7D_G67UQbsDwA":{"text":"Absolutely wonderful. Palace Café made for the perfect end to an amazing vacation. The two","useful":0,"cool":0},"mc77bDkqyj1USRNSkbra2g":{"text":"Be careful.  Just had my wallet stolen here.  Management is very indifferent and that is a","useful":0,"cool":0},"K8a7ANZZd8scYV_59vPaKw":{"text":"My husband and I love people watching so we chose to sit at Palace Cafe because they have ","useful":0,"cool":0},"WpA7JJrLvmhXhdra50aJEA":{"text":"Went to Palace Cafe and had a lovely meal. When making reservations they told us to park a","useful":0,"cool":0},"Zem4Ds6IX3wJPUIUsH6HtA":{"text":"This place is overrated, but a nice environment and friendly staff. My son got the Palace ","useful":0,"cool":0},"HYqs05fxX7afltP2cbSiFA":{"text":"Went to Palace for a quick lunch during a seminar at the Hilton a few blocks away. Beautif","useful":1,"cool":0},"dApCARd_9R4hRezY5fdt3g":{"text":"My sister and I had dinner at the Palace Cafe' and was a wonderful experience. The food wa","useful":0,"cool":0},"qynxTKuy6elr_1fydvfEDw":{"text":"Very pleasant experience at the Palace Cafe. We had great service! I ordered just a plain ","useful":0,"cool":0},"cbKAlpOoMBFuHJFAnVeMuQ":{"text":"Service was slow and staff was inattentive. The managers should all take a retreat to anot","useful":0,"cool":0},"f-kst8ziF6mALqVIaoD3oQ":{"text":"Checkout the best bar maiden, Zan! She's always husslin' but she makes time for her bar gu","useful":0,"cool":0},"6nHt9QieYeJRLg8pqWODug":{"text":"Hard choice between four and five stars. Service knocks it out of the \"memorable\" experien","useful":0,"cool":0},"RPcde1KSf4fI4nZAEkvYmA":{"text":"When first suggested this restaurant, I thought it was more upscale. The setup was extreme","useful":0,"cool":0},"y-cQBWaJ9PwZMtBG5fEVqQ":{"text":"Decent food. Nothing to jump up and scream about, but not bad enough to really say anythin","useful":1,"cool":0},"ksYW5-fZUra-9sRPJCoVyw":{"text":"This place is a must every time we are in NOLA! Always busy! We had their Creole Shrimp wh","useful":2,"cool":1},"Gm4miCCHucgWDO-8WI5HUQ":{"text":"There are times in life when you want something a little more simple, but quality food tha","useful":0,"cool":0},"ustPe7DecKF1THvxV0Y8lg":{"text":"Had breakfast here as we wanted a nice sit down meal w/o the hype of the French Quarter. C","useful":0,"cool":0},"acXIdmsEKm2LWhYTuyNyIQ":{"text":"Great food, great atmosphere, Great place for large parties. Get the Barbecue Shrimp, its ","useful":1,"cool":0},"d4eJMoHrKtmjHLrMZ4eCrw":{"text":"Let's just say bummed. We had been here previously for a Sunday brunch and had a wonderful","useful":1,"cool":0},"yXS3r5PBwSIeQeiaDA4_bw":{"text":"Strolled in with my BFF and the kiddies at 8pm without reservations and it was a 45 minute","useful":0,"cool":0},"N3vFBDWHruN2TZXt2zLqXA":{"text":"It's consistent.  It's delicious.  They make a fuss about special occasions.  The service ","useful":2,"cool":0},"Pf7Rn6k4f1HCLYt338titQ":{"text":"We stopped in to have a bite and was serenaded by a gentleman on the street (we sat outsid","useful":0,"cool":0},"s_LAdiTmj-rd60IvRr05FA":{"text":"Not expecting the level of Brennan's or Commander's Palace, went here for dinner, and we w","useful":0,"cool":0},"UKuzWdaj6PYuaaYCkf5Ayg":{"text":"This is my favorite restaurant in New Orleans, while the food is great I know it may not b","useful":0,"cool":0},"vnXsn0ZsZC3UIa1V1sCBUw":{"text":"Turtle soup (16$+tax+tip) was very tasty! Just a little sour from lemon juice with a rich ","useful":0,"cool":0},"_ISsT9UbAzFCd99DNB1SIg":{"text":"Superb fillet, appetizer excellent. Martini good. Atmosphere very nice  service very good.","useful":0,"cool":1},"O1Ujc35CPpGb8_gokJ4ACA":{"text":"We had dinner here on a Saturday night, because reservations were easy to get and the loca","useful":0,"cool":0},"9EwGMuZTVosRVug2B7sQkg":{"text":"Back again in my adopted hometown, I found myself wandering over to the Palace Cafe for a ","useful":1,"cool":1},"Wg_HPgK_x3jeZB3XKfVcsA":{"text":"I enjoyed a fabulous lunch here on my trip and it was very enjoyable. We had a server for ","useful":0,"cool":0},"ByH2AOni4ZICuXojolsELQ":{"text":"The prices here are atrocious and you're not exactly eating at the crown jewel of the Fren","useful":2,"cool":1},"tFXROLOG0dCCSqkIk4KpMQ":{"text":"One of my favorites in New Orleans. I had my 'standard' menu. Turtle soup with extra sherr","useful":1,"cool":0},"IZOWxHBG0N024RnS2mUlsQ":{"text":"This is one of the best places I have eaten on Canal St. O come here everytime I'm in the ","useful":0,"cool":0},"zJSl8AMlq5XiYBINpa_EWw":{"text":"My wife and I ate here this evening.  We each had the Turtle Soup.  We both thought it was","useful":0,"cool":0},"WnLX_Z1avpzQerl2He_alA":{"text":"Beautiful atmosphere. Excellent service.  The biscuits on the breakfast buffet were wonder","useful":0,"cool":0},"S2u2wX1skU_dPjwkn6w_OQ":{"text":"Palace Café was a great way to start our trip! We arrived around 8pm on a Friday night. Th","useful":0,"cool":0},"SgPgEgYxtYPxnlpKstYn-A":{"text":"Had a good group dinner here on the 2nd floor, classic restaurant remind me of the pearl s","useful":1,"cool":1},"q-MIjVQxCItwK0puICB2vQ":{"text":"Went here for lunch after a nice swamp tour on an airboat - so definitely had an appetite.","useful":1,"cool":0},"qQjyMZvc4Ven7pKKWfzPng":{"text":"Yum! I tried the crab meat cheesecake and a salad (in an effort to save room for the white","useful":1,"cool":0},"GHqqgw4tu0q7Hr0yup1r4g":{"text":"A great place to bring visitors for Sunday brunch. You can expect live music, a build your","useful":3,"cool":3},"Xd4oneJixJ0iFGJeYsHFHg":{"text":"Came here for my bday last year and the food just didn't WOW me although the service was d","useful":0,"cool":0},"lgySWt9YxZ-POC8W_GnmJA":{"text":"At first I thought, place looks too conservative, food might not be good. But I was wrong.","useful":0,"cool":0},"6sQNpiIL40E0jgPGNd9TiA":{"text":"Impeccable service and although the menu was a bit \"fancier\" than I am used to, everything","useful":0,"cool":0},"mR02UC_7LLokHFIDK7BtOw":{"text":"The WIF and I had dessert here and sat at the dessert bar! What an experience! I had the c","useful":0,"cool":0},"hvC0MQjiYfO00B80-NY1Nw":{"text":"I'm giving this place 4 stars because of it's decor, charm and cocktails....however the fo","useful":0,"cool":0},"ADwweajKhwE8ruYHbQ-9zA":{"text":"Kathleen was incredible and made our experience so amazing! Shout out for the blue cheese ","useful":0,"cool":0},"oZPGgmmhdNTs30JtaRe8aw":{"text":"A serviceable and consistent, although not a standout, restaurant in NOLA.  The building i","useful":0,"cool":0},"Uisn11OqbmpnG0qTp9jDjA":{"text":"Great location, but that's where the greatness ends. Cool interior and a really beautiful ","useful":0,"cool":0},"yMH8WlqPdVr_QOb4eQJSLA":{"text":"The seafood Gumbo was good, but I really went there for the Bananas Foster, and that was t","useful":0,"cool":0},"P0ue8awhXgUczquJ0KEG_g":{"text":"Came here for my final meal before leaving NOLA.  Was told that the crab cheesecake was a ","useful":0,"cool":0},"BjVeZyVaA-OeN2EP4Xs2aQ":{"text":"This is my favorite New Orleans restaurant. You get all of the New Orleans elegance and fa","useful":0,"cool":0},"miPfDQVS9C1eJuRFGF_93g":{"text":"Good appetizers and deserts, main course was average but worth visiting for their deserts.","useful":0,"cool":0},"ImFvYrJNB0vC8yPSjUzQUQ":{"text":"Loved the crab cheesecake. Pork eggs Benedict, too. Street side seating great for people w","useful":0,"cool":0},"GiUD02y2Ihyvxn_EgOi8Sg":{"text":"This was truly my favorite part of my NOLA visit! The food was delish, the service was gre","useful":1,"cool":0},"ZCh0l6W-5wX5qxil0-_59w":{"text":"Impressive.... Was somewhat skeptical about going here based on the mixed reviews, but dec","useful":0,"cool":0},"rK8rcuENlPlu5mCqC8CUSw":{"text":"We came here for happy hour and and an after dinner drink! Andrew and Cornell were awesome","useful":1,"cool":0},"mOJmDbCrp0ZTajQEEXiqIQ":{"text":"This review is only for their 'Bananas Foster' dessert as recommended by TripAdvisor. The ","useful":0,"cool":0},"3kSyclmLINSkVCtV0hoB-w":{"text":"Our first meal in NOLA was not disappointing! Two of us shared the Cauliflower Gratin & Sh","useful":0,"cool":0},"OWCM2JAibl-vV1kg8llJaQ":{"text":"Place was packed so I chose to sit outside which counts the same as being in the bar.  Ful","useful":0,"cool":0},"i7ErhlZaP4E2rOiMcBO8jw":{"text":"Probably the best fish I've had in YEARS! I want to give a huge shout out to Tim! My girlf","useful":1,"cool":1},"d0tKy0DFNj6IyH0BQTcL0w":{"text":"Good cajun food right near Bourbon street, big restaurant with a popular upstairs section","useful":0,"cool":0},"nbqvzd94FQY63Zk_WVJ8iA":{"text":"I was part of a Road Scholar group run by the Center for New Orleans Studies -- in New Orl","useful":4,"cool":0},"VbZGstq_6b-peX0RWrVy6g":{"text":"It was the best New Years dinner anyone could ask for! The service was excellent. The food","useful":0,"cool":0},"gb1v9c8Q9OPWBHy8HgK3jg":{"text":"Finally, a NOLA restaurant that takes its non-seafood menu items as serious as its fish an","useful":0,"cool":0},"0UdYUp_Zjc0RoOLSbIZdmw":{"text":"I had a great time here, the food was delicious and the service was exquisite. \n\nThe bread","useful":0,"cool":0},"w9KY6d6PJkD5P5mSrPemNQ":{"text":"I've been to Palace Cafe several times with colleagues so since we were partaking in Jazz ","useful":0,"cool":0},"L9TpMV5XQK8PiZ1Vrg7TeQ":{"text":"Palace Cafe is part of the Brennan family empire of restaurants in NOLA, and we visited fo","useful":0,"cool":0},"N6SekLBscLuCQb56B2fVjg":{"text":"Came here after seeing an episode of Chopped that featured one of their chefs.  I was intr","useful":0,"cool":0},"lWbttpeXpWZvfH2N6jZl5w":{"text":"My second Dick Brennan restaurant today. Nice ambiance and good service. I had the Andouil","useful":0,"cool":0},"rgGAnAb5UX_kcionK40lTA":{"text":"If you're meek when it comes to flavor, this isn't for you. Chicory is in the coffee, gumb","useful":0,"cool":0},"zf3u-fkhi2QucI6JK6dA8A":{"text":"OMG the andouille crusted fish is the best fish I've ever had! The sauce, the flaky ness, ","useful":1,"cool":0},"z7LMZ4n9Gr6s5rSMHUJaOw":{"text":"Great food, super great service and a beautiful atmosphere!  The bananas foster was wonder","useful":0,"cool":0},"7W9m8WsVN3qyzf4HNT9MMQ":{"text":"Of all the times I have been to New Orleans I have never come here, I assumed it was not g","useful":0,"cool":0},"b4ZwoSSikTvGtyBxZr4Shg":{"text":"We loved this restaurant and we went just for the bananas foster. The restaurant is more u","useful":1,"cool":1},"h-9w9xA7FCsSUNvQOg4A9g":{"text":"My boyfriend took me here for Valentine's Day...we were able to get a reservation that day","useful":0,"cool":0},"zP5EeFZSLg64uknmAWLtpg":{"text":"I love this place!  The food is fantastic and service is impeccable.  Get there early or m","useful":0,"cool":0},"qxGxlgIbawZEd-V_UalYIQ":{"text":"Awesome for dessert and coffee.  They will sit you just for dessert.  Great place to come ","useful":0,"cool":0},"RqQ2gdOc9CYc5c2OH5I-6A":{"text":"The Palace Cafe's decor and atmosphere reminded me of the flashy tourist traps next to the","useful":0,"cool":0},"IyxG_ToZQjt6mCU8dQJPnw":{"text":"Right on Canal Street...you can't miss it.  I went with a group of about 7 people for lunc","useful":0,"cool":0},"kTryXiL_1E8SyTFOJpZjnA":{"text":"Went here for a Bachelor party. Staff is extremely friendly. Food on the other hand.....  ","useful":0,"cool":0},"vHKONha7hUVyhpZwG2VEUg":{"text":"Tried Palace Cafe for the first time since moving back to New Orleans.  The space is beaut","useful":1,"cool":0},"auZ5jQjbJDg9fhEYDxSROw":{"text":"This place is total Southern class. It's more on the upscale side, but it's not overly upp","useful":1,"cool":2},"MDXFVJhRY9z6b4-YOLhXXw":{"text":"My first stop in New Orleans... They had me at the sidewalk dining.  Having not checked re","useful":0,"cool":0},"IzzNGtoAoYem9ejXgOItfA":{"text":"The best meal I've had in NOLA so far. Who knew grilled catfish & spiced pecans can go so ","useful":0,"cool":0},"qp1pxJjFVZbhLq1KML-_Ww":{"text":"We have visited  the Palace Cafe on both of our stays in New Orleans. This time we made re","useful":0,"cool":0},"D7x6xEBz1k5hNjfpcchRgw":{"text":"If you are on Canal Street looking for a classic New Orleans dining experience, check out ","useful":0,"cool":0},"cjTop0XdOitOHq3lj0np_A":{"text":"I don't particularly care for creole food or Cajun food but sometimes with good service, y","useful":0,"cool":0},"VT_U97N4m0pUdPRhKgozCg":{"text":"My all time favorite place to eat or treat myself. Been going there for the last 8 years, ","useful":1,"cool":0},"DiLwAVeT7_oKafdFFQZW2g":{"text":"Server Dino was great even with the Mardi Gras rush.\nThe food was very good.  Good atmosph","useful":0,"cool":0},"3XGuQV2JKJ-NDY669bi9-w":{"text":"Pork shank was beyond amazing. Bbque shrimp great, duck delicious. Must go!","useful":0,"cool":1},"LBQVjvreIHQC-y0Q0W2tjQ":{"text":"This was a good stop for dinner better then some of the more expensive places we have went","useful":1,"cool":0},"7tHG8Ov-9C7Oloj2XSBGKQ":{"text":"Excellent service and food exceeded expectations.  Recommend the crab cheesecake starter, ","useful":1,"cool":0},"4MtK24dTQyyiv6UJ5i2BBw":{"text":"limited menu and you cannot order off the dinner menu until 530 :(\notherwise, good food, t","useful":0,"cool":0},"qJCQ6_GCMgJGChr1JT53PQ":{"text":"I went to lunch one day with a friend at the Palace Cafe', and was so glad I did.  It was ","useful":0,"cool":0},"OD7N3Em9R8mIiB8GRjiOkQ":{"text":"Good food. Waitress totally forgot our drink order after a long conversation about the Blo","useful":1,"cool":0},"mAyd5YEiqQgC2BlHDNPwmA":{"text":"Had dinner here on a Monday night with other conference attendees. Was not overcrowded and","useful":0,"cool":0},"MtvS6nrvap1CJnUgQiZVbg":{"text":"Food was good, service was good. \nThe crabmeat cheesecake was delicious. \nPecan catfish wa","useful":0,"cool":0},"Heg_YdfimHyh4zO3NIOazA":{"text":"While in New Orleans with my coworkers we stopped here for a weekday lunch. They were pack","useful":0,"cool":0},"G5pILVeezm9sReOnaDkyBg":{"text":"My husband and I went to NOLA for our anniversary. We ate at many restaurants during our s","useful":4,"cool":1},"CJLwENfV74GB1tLxPzwSzQ":{"text":"Great service. We had someone in a wheelchair and they were very helpful and attentive.   ","useful":0,"cool":0},"9p8M66yRwC0Brtv2kCzWzg":{"text":"Food was good. We had a blue crab omelette and a shrimp dish, which were both really good.","useful":1,"cool":0},"2qY70rkn7B5UIQ4w46f7Ig":{"text":"Wow what excellent service. I was here on a work conference and this restaurant was very c","useful":0,"cool":0},"PVoSnznazu9gZNr9aJWgyQ":{"text":"Amazing! This is the first place we've been to on our trip to New Orleans that held up to ","useful":0,"cool":0},"lRmteL6qivw0nQ1ypUYZ4A":{"text":"Had lunch here. . an awesome place. Atmosphere is great, food was terrific. . service was ","useful":0,"cool":0},"X3BPWNM3Rwl52Wter2ghVw":{"text":"This place can do no wrong.   If you like the white table cloth kind of dinning experience","useful":0,"cool":0},"ZyJeGFQHoPNFT93b0nUbIw":{"text":"This place was awesome.  I am in town for a conference, but I don't know anyone here, so I","useful":0,"cool":1},"6RVsBVpsv6AFUPDxpyZgpw":{"text":"Very lovely restaurant and wonderful, friendly crowd. The service didn't seem as friendly.","useful":3,"cool":2},"G5Wv-Wsg0em4m7gxqCdf0w":{"text":"Stopped in on a Sunday afternoon. Excellent food. I had a piece of mahi.  Perfectly cooked","useful":0,"cool":0},"1W9uU-MCzIYChpL7vyUoow":{"text":"We hadn't been to the Palace Cafe in over  years and had good memories.  We were able to s","useful":0,"cool":0},"4YMgB784WBdIaGFZSDZEwQ":{"text":"We stopped to have a rest and drink while walking around NO. the outside tables were great","useful":0,"cool":0},"tevjxepLLAI3ArQYrkPXfQ":{"text":"Food and service were superb. Hostess/Greeter seemed like she was having a bad day, but th","useful":3,"cool":1},"RxabqxKC3ALs0BwooEkSFw":{"text":"Maybe this is more of a dinner place? Breakfast was a Complete disappointment. 2 of 3 meal","useful":0,"cool":0},"fv-HJUtF6qHoxFiwLRub0w":{"text":"Overall... Tourist Trap, mediocre food, very forgettable \"dining hall\" experience...\n\nFirs","useful":2,"cool":0},"7ReiTMe1m6VA94LTzENwdw":{"text":"Hey look .. we came in here based on a Yelp review for Bananas Foster, so I had to follow ","useful":0,"cool":0},"CafOWAeD8UMxlOjVfo9aoA":{"text":"The food was really good but prices seemed a tad high, but then again it's right on Canal ","useful":3,"cool":3},"jz8Hvf5aakKd-l_ZIp9t_A":{"text":"My favorite Restaurant is \"Palace Cafe\",I like to recommend the\nCrusted Duck Breast with R","useful":0,"cool":0},"17SkSx7RWESIpxWOazttfw":{"text":"This place gets booked up pretty quickly so make sure you make a reservation beforehand. T","useful":1,"cool":0},"v4DtxcokTkm9nQdQchFt1Q":{"text":"After having no reservations and no place to go we ended up at the palace cafe. The hostes","useful":0,"cool":0},"itNk1yNeVlyHdGhmRg8Xdw":{"text":"Came here after being pampered all day at a spa and let me tell you this place was the che","useful":0,"cool":0},"_Gc_7504zmuYlygSOj6xYQ":{"text":"I was on a business trip and staying at the Marriott which is just few doors away from the","useful":0,"cool":0},"N2McE6pWyZxuXDrmzNGf0w":{"text":"What can I say but amazing! I had the brazed pork shank which was delicious. My wife had t","useful":0,"cool":0},"mp2Mgjj50IEGK8g0OWXIIw":{"text":"I always recommend my out of town friends and families to the Palace Cafe.  The restaurant","useful":0,"cool":1},"y3UBjVsK3HRrH-7cUIUlEA":{"text":"We had sheepshead fish and creole shrimp\n Both were great. Beautiful restaurant and excell","useful":0,"cool":0},"ppOjyiEwfDJ2wlibHbTnPw":{"text":"Excellent. We just went for \n appetizers and salads, but picked the perfect place. The cra","useful":3,"cool":1},"wGt8w5BLrU3jy42tBwhCMA":{"text":"My favorite place in NOLA! Great atmosphere fantastic service and really great good. The d","useful":1,"cool":0},"ks4GCkQhq4kfeWWJvYbQSw":{"text":"I ordered the Crabmeat Cheesecake and Pasta St Charles with Pecan Pie. The service was gre","useful":0,"cool":0},"SUV0Zpqep3T48vZ6nN6ehg":{"text":"I would not eat here again. Service was very slow and it took some time for our waiter to ","useful":0,"cool":0},"SjZepQfEaaiv4HV8zPB2Eg":{"text":"I had breakfast here on my third day in town, and was very sorry I'd wasted two other brea","useful":0,"cool":0},"kQuSh8nFb4JSqsIh1Fm2Ng":{"text":"This was the first restaurant we came upon on Canal Street that looked right up our alley.","useful":0,"cool":0},"bXGsKnz6hGtdlJSZAJnEhA":{"text":"My sister said that we absolutely had to go there to order the banana foster dessert among","useful":0,"cool":0},"J00TEklE0K3zDKCTAGYFoA":{"text":"My wife and I walked by this place and decided to go in.  We got an appetizer and then spl","useful":0,"cool":0},"ackn9pJhSqmmK1Q1mayeoA":{"text":"Very nice dinner with a view of canal street. Service was good and helpful. Fresh french b","useful":2,"cool":0},"D4fencUVfz5zA8LA0m0ckw":{"text":"The Palace Cafe was big, elegant, and bustling. Service was efficient. One of our servers ","useful":1,"cool":0},"S7bMNpAdGnCwN7fSUpq1sw":{"text":"The Palace Cafe is a great spot for dinner. The food is great. The waitstaff is patient, f","useful":0,"cool":0},"zJGn8VynggMQmgnJ9vJn8w":{"text":"The chicken and sausage gumbo was to die for.  Sooo good.  A friend and I shared the chick","useful":1,"cool":0},"y2uJl8EWB-Yd1pMucdhTzw":{"text":"The food is mediocre for the price.   Service was terrible.  Ordered drinks for our table ","useful":0,"cool":0},"_d35w0ldO-4vd1IgUhc0Sg":{"text":"We have had several great meals here at the bar upstairs. The service was especially good.","useful":0,"cool":0},"1CPW6SFr04DzE2gtdnkIew":{"text":"Love sitting outside for a quick lunch.  Unfortunately it wasn't quick. Wait time between ","useful":0,"cool":0},"wxSuc2FS9NEAgnzm6SbZOg":{"text":"I've been here a couple times, its usually right next to the hotel I stay at.  Service is ","useful":0,"cool":0},"egiZ5N-sZ5vnWMaMacYXwQ":{"text":"The crabmeat cheesecake is to die for & the service at the bar is excellent. I have a thir","useful":1,"cool":1},"bZwT8ijNtV0Ebe3BAFuNaA":{"text":"来到新奥尔良吃的第一餐，2个人点了Fried Oysters，Crabmeat Cheesecake和Shrimp Tchefuncte，花了51刀。店里面很热闹。第一次来可以过来","useful":0,"cool":0},"ZjMYW7cIJwVR-XJtIbV9gA":{"text":"Great food great service. Will hit this place every trip to Nola. Original home of bananas","useful":0,"cool":0},"q_mKQ0rLFySthDASGUBnew":{"text":"Appetizers....got the crab cheesecake and the carb claws. Delish. Highly recommended\nGot t","useful":0,"cool":0},"_vvXeTQBNH4undU-q3d8bw":{"text":"Nice decor, but still an overpriced, underserviced hotel restaurant disguised as fine dini","useful":1,"cool":0},"RPjC2WhEu53kT4KvCbTulQ":{"text":"You just can't go wrong with a Brennan's restaurant. I almost didn't eat here because of t","useful":0,"cool":1},"gIMQ6b-01jZvqxbSvnBAXA":{"text":"I came here for a Bridal Luncheon last Friday and it surpassed any expectations I had befo","useful":1,"cool":1},"7lSquK0NHaq3VkFmAkglLg":{"text":"I was excited to try this restaurant for brunch this past Sunday, 3/10.  I have been to Mr","useful":1,"cool":1},"g6i0v0WK2cgwm96NEpwxdQ":{"text":"I had a really nice experience @ the palace cafe.  It's not the most unique food in the en","useful":1,"cool":0},"_m8zcLnqlx6x7i7ctYKR-Q":{"text":"Amazing. I almost skipped it because of the reviews (made me think it was a tourist trap) ","useful":0,"cool":0},"k9zcCZH9NkcwJshuvWrd2w":{"text":"Went to Palace Cafe for a lovely Mother's Day brunch, definitely turned out to be memorabl","useful":2,"cool":0},"Cky_Vj_EvkB-hivGA1UPbw":{"text":"Had the panzanella and pecan pie.  I ordered soup, but they screwed up the order.  I would","useful":0,"cool":0},"QwgeX98XZ8PWFjQN_HXcFA":{"text":"My girlfriend and I stopped in for dinner right after checking in to the hotel across the ","useful":0,"cool":0},"V4egfw1c9UHsxu62FoE4LQ":{"text":"The food here was amazing, especially for the price point. We had the turtle soup, duck co","useful":0,"cool":0},"ehGa1dlQuOKqru1miaGbJA":{"text":"Went for breakfast, and they served our party of 6, after 45 minutes waiting, stale waffle","useful":0,"cool":0},"T96TtsxQccrWOIX0vPVoRg":{"text":"Fantastic service. We went for Sunday brunch. The quiche and steak & eggs was awesome. Liv","useful":0,"cool":0},"WAfenjbznyTScK3O7wKDRw":{"text":"Our waitress Claire was very nice and helpful about the menu. We selected entrees she reco","useful":1,"cool":0},"M5cjKO_2sMtqc0qlg0ug1Q":{"text":"The service here is incredible. The food was great! This was a new stop for us, but I'm re","useful":0,"cool":0},"PZ3oNJDRqBu03Aj_b07tIA":{"text":"We were in NOLA for our 10 year anniversary celebration. I heard through Yelp (and the NOL","useful":1,"cool":0},"E8zLpuGqfVf6mmMWg63TTw":{"text":"Just had a wonderful dinner.  BBQ shrimp, Gulf Shrimp Tchefuncte, and white chocolate brea","useful":0,"cool":0},"23WuLf6Skkc7_Pq2dJ7hgA":{"text":"So my boyfriends mother LOVES this place, swears its gorgeous once you're inside, and we'd","useful":0,"cool":0},"BOMDS2CP1gTu5XTThwDfRA":{"text":"Decided to try the Palace Cafe based on internet reviews. This is a popular tourist spot r","useful":0,"cool":0},"EsTHwfi1dpn3p1FvbCRSFw":{"text":"My current roommate and I met an old roommate and his parents who are visiting for Thanksg","useful":1,"cool":0},"10hpi_s2zAazRen33N8WNg":{"text":"We came here for a work dinner and were excited about it because we were looking forward t","useful":2,"cool":1},"kPAwOkP8IMTQET59d6dvtg":{"text":"Ordered classic New Orleans sazerac cocktail and it was not even close. Way to heavy on th","useful":0,"cool":0},"VTBxAWmancTgoPHfDDdwLg":{"text":"We stopped in for dessert and sat in the bar area. The service overall was OK. Our server ","useful":3,"cool":3},"5zpwLnK9joz1QXXAQzsMMg":{"text":"Delicious food! We visited from out of town. We found Palace Cafe across the street from o","useful":0,"cool":1},"iLXx-nBrFpEZEvYUhWOGxA":{"text":"Palace Cafe\nWe wondered into The Palace Cafe when our original brunch plans fell through o","useful":1,"cool":0},"OS_w0nXLCozvGbNXVFzMlA":{"text":"Don't miss Palace Cafe if in NO. Simply amazing. Make sure Sunny is your server, she made ","useful":0,"cool":0},"imQSXz9Z_Ei2oQEjIW1aow":{"text":"The Palace Cafe has been one if my go-to places in New Orleans as it is right across the s","useful":0,"cool":0},"LR8fXlXsITOZVIourXnHQw":{"text":"Came here for Sunday jazz brunch. \n\nPro - loved the building it is light and airy. We sat ","useful":0,"cool":0},"Vzif1jeHtfUvQThME1GH9w":{"text":"We had a reservation for over a month to sit in the window, Thursday Feb 4, granted not ou","useful":2,"cool":0},"XMjBGQHCkocvsthRYAbmyQ":{"text":"Awesome food, service and atmosphere.  Will definitely be going back here on my next visit","useful":0,"cool":0},"_tK790-TtUe6PXP9SGEpEA":{"text":"We were there for graduation dinner. I heard good things about palace cafe. I have to say,","useful":0,"cool":0},"TzriaUblO4ah4g87lmjT6w":{"text":"Had a wonderful dinner last night. Happy hour let us have the house wines for half price. ","useful":0,"cool":0},"kP7tybcheZNMVi-e-oKhdQ":{"text":"Here's another experience that really blew us away!  We walked by this restaurant many tim","useful":1,"cool":0},"dPJah4M9MczxIx7gvi6GOQ":{"text":"Food was good but not the best in New Orleans. Dishes didn't come up to the waiter's descr","useful":1,"cool":0},"5ZJCxhoagEGsbcQqvJUH7A":{"text":"I'm a fan of Palace Cafe. The food is great, I love having the crab claws or the crab chee","useful":0,"cool":0},"YXRm7rmHDwzhpPJs7U_Tdw":{"text":"The food was exccellent!  The service was great and the waite staff members were friendly ","useful":0,"cool":0},"5ZZccpRvkJM8vwX_LQSfTg":{"text":"This place surprised me on how great it was. The outside looks a bit cheesy but it was clo","useful":1,"cool":1},"DSH5mqKv20iCCyqWXGEXGg":{"text":"Went with a group and had a decent meal. The atmosphere was nice and the wait staff friend","useful":0,"cool":0},"4eG8TNyYpJFjGXmE632T7Q":{"text":"One of the bridemaids made a reservation here for out last night in NOLA. She said that it","useful":0,"cool":1},"kt0PYUMV4OiS_bUvQz0ygg":{"text":"This restaurant is delicious, and if you get the chance you should try to go there for din","useful":0,"cool":0},"DiEOo-Ehx_Ist3fD638i0g":{"text":"Stopped here several years ago on previous vacation to have a drink because it was 105 deg","useful":2,"cool":2},"wGplGOdQmddLx6l2E24lHA":{"text":"We loved this place. Our waiter Gary Michaell was enthusiastic and adorable.  Great wine s","useful":1,"cool":1},"gLEaeE0hsoJKfDHRqu8bRg":{"text":"Everything is right with the Palace Cafe. We had 2 servers taking care of us. The food we ","useful":0,"cool":0},"fAG_mh5lJrnqJILI33xWrw":{"text":"Went to this place for dinner. The crusted fish is so amazing, so nice. The grilled fish w","useful":0,"cool":0},"5eJwrDgA4-anX44nd2QjCA":{"text":"Amazing lunch!!!\nPlanters punch, catfish pecan, and rum cake. Excellent service and reason","useful":0,"cool":0},"iGNvA3YMaDyOu0r6RIzGAw":{"text":"DINERS BEWARE! This place was NOT what it was billed as. They market themselves very well ","useful":1,"cool":0},"kbLIm5UYDD3wXqVZpSu_hw":{"text":"Outstanding service at the upstairs bar by Drew!  Appetizers and dinners were great not to","useful":0,"cool":0},"dow4ouq4lKE-6Sf93NGScA":{"text":"Must have the crab cheesecake with pecan crust & drizzled with a cabernet reduction! Goes ","useful":0,"cool":0},"EhDo_81n_gxgElXLSO8f_Q":{"text":"Our first night in New Orleans and we tried the Palace Cafe as it was close to our hotel. ","useful":0,"cool":0},"i05emkVCCmWFcvv6N51zqg":{"text":"The Service was better than the Food (in my opinion)\n\nMy boss ate at Commander's Palace & ","useful":2,"cool":2},"DloMUfOaUNOYpSdTXAokug":{"text":"The service is outstanding! The food was good. I would stay away from the pecan crusted ca","useful":0,"cool":0},"uUyKsCmIxuVlc1xuSO5MJw":{"text":"The restaurant itself is really cool. Very old fashioned feel to it, definitely have to at","useful":0,"cool":0},"wnAAh9HgEqBsbrT4Lq-TOg":{"text":"First time trying Palace Cafe, with my husband after a ceremony I had. When we walked in t","useful":0,"cool":0},"qE29JSu3qOSo9Oif7mYWzQ":{"text":"Outstanding dinner tonight! Our server, Chuck, went above and beyond finding which rum to ","useful":0,"cool":0},"BJqB1oDHBlgd9ifQBl2Kiw":{"text":"I've always like the decor of this restaurant's interior, especially the 2nd floor but I o","useful":1,"cool":0},"RK5fxQy1-snKG52kZPVz-g":{"text":"Palace Cafe New Orleans!\n\nClassic French and New Orleans opulence! Crabmeat Cheesecake?! W","useful":0,"cool":0},"9vJRRct6nrdQsubenGxzxA":{"text":"Excellent, great ambiance. I had a fish dish and it was excellent. The service was great. ","useful":0,"cool":0},"QMVxgN7GqWY5NmmuY7R1pA":{"text":"The food was pretty good. Service was great. Too a little longer to get food. Sailor's cof","useful":0,"cool":0},"G5DuIYifhfCJiFN8BpBE0A":{"text":"Went for breakfast.  Service was fast and the prices were reasonable.  The food was amazin","useful":1,"cool":0},"Src6NBTLn857EqB8h_RHGQ":{"text":"Knowledgeable staff and great andouille fish for lunch. Portion size was just enough. Grea","useful":1,"cool":0},"Fl14IWfSYqJ2s7ZKdk1M-g":{"text":"Our family stopped here every day during our stay in New Orleans! They have a fabulous bar","useful":0,"cool":0},"ePR89Qw6wZqbhszZ6zCnXw":{"text":"Quaint location with excellent service.  The pasta lunch special was excellent (**** stars","useful":0,"cool":0},"KLCb8QQacwEg7XM0wVpYoA":{"text":"Was looking for a quick snack and stumbled upon this place. I had the burger which was one","useful":0,"cool":0},"3IKD17Doljx8nr8thAxB4g":{"text":"Expensive. A little touristy but not bad. It would not be a first choice in NOLA.","useful":0,"cool":0},"TJhdlEMIa10m81AxFyVNaQ":{"text":"Mardis Gras at the Palace Cafe\nExcellent food and value. Party of 12 people, seated prompt","useful":1,"cool":1},"iE1UmyhT6GohYZkqF6F96w":{"text":"My family and I were walking back to the hotel and wanted to grab a beer somewhere at like","useful":0,"cool":0},"hgHEYn6m5J0AV6_3oFlOfQ":{"text":"Great location but doesn't rely on that to build a clientele. \nTheir service is spot on an","useful":1,"cool":0},"6vozttHTbPEtFf_kJqfmyw":{"text":"It was too lit. To start off my family had a cheese plate (blue, cheddar, squid head/ink, ","useful":0,"cool":0},"592cBnx8AwM80_LT6qqdCg":{"text":"Came to the cafe looking for bananas foster and this place lives up to their reputation it","useful":0,"cool":0},"DwcVvT__vy9lcZZ4bmpPnQ":{"text":"Bisque was horrible, tasted old, ceasar salad too small for price, overcooked kids tenders","useful":0,"cool":0},"fguQmQpdDBMKvbf6ZUAnoA":{"text":"Nice bistro right on Canal Street. Service is good, and the people watching is extraordina","useful":0,"cool":0},"nBONkCsh6OlmQnnYK_5YRQ":{"text":"Came here just to try their bananas foster and was not disappointed. I liked the flambe pr","useful":1,"cool":1},"Wjd7vkBnXqvsi3tkSbbIOg":{"text":"The Palace is one of our standby's when we have people visiting from out of town. \n\nLUV th","useful":0,"cool":0},"2zDXETe2RyWE0xK2XUa-oQ":{"text":"One of the best restaurants we have ever discovered in New Orleans.\n\nWe had the Caesar sal","useful":5,"cool":0},"Mrp_qhzVlHuYhwk6XCvh1A":{"text":"I wouldn't go out of my way to go back but the food is good and outdoor seating is great. ","useful":0,"cool":0},"KpYGajw0Lj9KtaEBNznouA":{"text":"Such a cute place to have a good meal with friends and family! Came for a late breakfast o","useful":0,"cool":0},"P2qEGWDstDOnPmnUVcGZ6w":{"text":"I went to dinner here with coworkers. There were four in our party we started with turtle ","useful":0,"cool":0},"kp9VTdDvhAaL0ZV2O_mGpw":{"text":"I had the crab cheesecake and the pork chop meal. Everything was amazing. Love this place ","useful":0,"cool":0},"p6oNEOALIbXcG6-1LESycg":{"text":"This restaurant is amazing. Jessika is one of the best servers I've ever had (and I'm a pi","useful":0,"cool":0},"8e2om4gaz1e1pL459PmGJw":{"text":"This place is nothing more than an over priced tourist trap in the Quarter, so if your loo","useful":0,"cool":0},"cdgILDPbpQ5WcCNO-LF83A":{"text":"Must order the crabmeat cheesecake!!  Chicken and sausage gumbo was very mediocre... Barbe","useful":0,"cool":0},"aIYepXVjdag1-rfrW84Hig":{"text":"The crab claws were great! The shrimp wasn't cleaned. The steak was good.","useful":0,"cool":0},"0PmUQCUufJr04YPLIiA0Bw":{"text":"Go for Brunch!.. Get the eggs bennie with the pork.  The best thing ever.  The staircase i","useful":0,"cool":0},"T3240c2B_4389mZAqkENFg":{"text":"I had been here a few times before when I was in NOLA for a conference but only for breakf","useful":1,"cool":0},"5-U5p9HEAKUmOjkKpBQjzA":{"text":"Agree with the 3.5.  The food was pretty good although it seemed there weren't many choice","useful":0,"cool":0},"AHOgRyIkkGzjqsxIrbQzgA":{"text":"Outstanding late lunch in a great location. Our waiters were wonderful and the chef even c","useful":0,"cool":0},"EarkbU0GP-AVi2aEgz-cKw":{"text":"Another do not miss restaurant! Beautiful! Great food! Great Service! Windows to the kitch","useful":1,"cool":0},"PeUvPdBwg3LaqrVEvZVmZw":{"text":"Had Andouille crusted fish.  It was edible but nothing special.  A bit too fishy for my ta","useful":0,"cool":0},"TmmhQDftUS3Ls5Nb5XbVbQ":{"text":"The Pecan Crusted Catfish dinner was OK. The Watermelon Hill cocktail was different but go","useful":0,"cool":0},"StilUZRZSy-fAsxzEopWmQ":{"text":"Had a very good experience here tonight. Started off with the French bread which was satis","useful":0,"cool":0},"KVfRcphr9xdHXQJFY8xYfA":{"text":"My girlfriend and I went to New Orleans for a little get away and we went to the Palace fo","useful":0,"cool":0},"leW99LalT06GZKcXVgBGTA":{"text":"The crabmeat cheesecake is the signature item and it is ridiculously good. The atmosphere ","useful":1,"cool":0},"xp6dq38bjgkdwSM70eKd6Q":{"text":"Great location. Fun watching people on Canal out the window. Wait staff - knowledgeable, a","useful":0,"cool":0},"gfoVH4aIc5k7eeFYJQDiYQ":{"text":"Came here for breakfast. The staff was super friendly. I had the shrimp and grits with a s","useful":0,"cool":0},"BeKSDJwg-VIh0OndwKZ3Lg":{"text":"Tried the Seafood Cheesecake (really a Quiche with crab in a dark glaze sauce), Andoullie ","useful":0,"cool":0},"tWH_2NgBAGx0aotGcZcJTg":{"text":"Stopped to envoy a nice bananas foster while list being to some street music and watch peo","useful":0,"cool":0},"gugfycY424Nvbetuk5nyFw":{"text":"Wow everything on the menu looked so great. Do try the crab cheesecake for good measure!","useful":0,"cool":0},"bhirUDfgcd0gwacKsqH0yg":{"text":"We came here for dinner and it was fantastic. There were 3 of us so for entrée we shared t","useful":0,"cool":0},"wcEo6BiJkZLVQvCRUd5h9A":{"text":"The gumbo at Palace Cafe is one of the best gumbos I've ever had outpacing many other Caju","useful":0,"cool":0},"xaonKtXzKmA19sdRMvsuyA":{"text":"I am a local and brought my parents here when they were visiting. I had been here many tim","useful":0,"cool":0},"v5BrT5l322DTskgSY1Sslg":{"text":"Incredible creole filet! Fabulous service! Table-side bananas foster! We loved our time at","useful":0,"cool":0},"81oMcx-cJjH2QhVmdpDKRA":{"text":"Amazing service and staff!  You have to try two things, Crab Cheesecake and the Bananas Fo","useful":0,"cool":0},"Ws9BHBV-ELhIKwYYl492LQ":{"text":"The pork shank was good and service was excellent. Need to try the banana foster. Excellen","useful":0,"cool":0},"ve1f9qKLLq_w-2JiZa8Qyw":{"text":"Wide selection on menu. Outstanding service-relaxed, attentive, personal. Bananas fosters ","useful":0,"cool":0},"c7QRxgIhgqgvl6ZTGp5w1w":{"text":"New Orleans is a great food town, so I expected quite a bit from this Brennan family resta","useful":1,"cool":0},"ytsUB5Mk9DimEMSNJ1K9TQ":{"text":"Nice place with a stylish interior. We checked in on a Sunday morning at 11am. Like a lot ","useful":0,"cool":0},"KXtxWKtmMsRq4mGu9ATOfw":{"text":"Here for a conference & this place was recommended by a native. I had the shrimp tchefunte","useful":0,"cool":0},"xy-tyilDENIbkvbRH7LGmw":{"text":"Went there for lunch and ordered seafood gumbo which was good but a little too salty. Then","useful":0,"cool":0},"6W1IX2g4XQ5IiBz-jWyiyw":{"text":"Palace Cafe was a pleasant surprise and the clincher of the trip. With no intention of goi","useful":1,"cool":0},"jpNhfu9aZm0hWpY5zUNX_g":{"text":"On our last day of our trip to NOLA, we decided we wanted to end the trip with bananas fos","useful":1,"cool":0},"Whb3kfNEQ95MQWAiDYHrnw":{"text":"Wow! Came for lunch and food was unbelievable. I had the tuna, a dish I've had often, and ","useful":0,"cool":0},"mzq3KK2rMc3pLSz9W5xWQg":{"text":"Service was slow and no sense of urgency to get the food to our table. Three rude servers ","useful":0,"cool":0},"v6-H45uAPGHJ6HKmmiRF0g":{"text":"We had a group of 8 that went to the Palace Cafe for a pre- theater dinner. Our waiter, Ju","useful":1,"cool":0},"zDm47dlDct2ifrQFaLlXRg":{"text":"This place is definitely a popular spot and their neon sign on Canal street can be seen fr","useful":0,"cool":0},"A7IJ9l7_YTnFPQqUpdtpfA":{"text":"On our first visit to New Orleans, we were recommended to make reservations here.  Glad we","useful":0,"cool":0},"3T53Qz0mKdIZymdks8NrWw":{"text":"The food was very good but the service was really bad.  We saw our server only once and th","useful":0,"cool":0},"Lm17yQMCkayN_u7cPdX48A":{"text":"So I broke many rules eating here, but if further confirmed why I have these rules:\n1. Avo","useful":2,"cool":0},"Z2Y242zNzlsXbz79ux47fw":{"text":"One of my friends came down to New Orleans for a visit, and a couple of friends and I deci","useful":1,"cool":0},"JJ5jgUvwIDEx0O_LVBVBFA":{"text":"Went to this place the first night in new orleans after a ghost tour.  We had a group of 1","useful":1,"cool":0},"HN-I5pFLdt-Wy9yDJpGcpg":{"text":"Better good food.  The service was excellent, but the food was not exciting.  It was also ","useful":0,"cool":0},"AgNxQ6M40ExV8fswgjRJFQ":{"text":"Food was OK, but service was staggeringly awful.  We asked our server if it would be possi","useful":0,"cool":0},"gUUyC4AaYmil-yVCHICumg":{"text":"excellent food; cool vibe sort of takes you back in time; quality food; don't come here ex","useful":0,"cool":0},"9upS3igfFHiH_h9mT6fp4g":{"text":"Too slow. No waiter come up to us over 5 mins. Waiters responsible for this table just wal","useful":0,"cool":0},"mYG6DjV7ugxLsh7Gv9DQiA":{"text":"I ate here last night for a large group party and for a buffet I was extremely impressed. ","useful":0,"cool":0},"q-D4JVg12t0torVI_y6iIw":{"text":"Very nice. Standard fare for the area.\n\nReally all very good.\n\nI'm sure we will visit here","useful":0,"cool":0},"qR84OC3cNdgp2e7m7aBpxQ":{"text":"Great food amazing service. Attention to detail. No beer on tap but that is to change afte","useful":0,"cool":0},"UWWNIN8qW6zjJ0zoHUVnhA":{"text":"A really beautiful restaurant!!! Classy service. They care about your experience. The whit","useful":0,"cool":0},"l3iT-NYxsXeppn3szIlYNw":{"text":"Came in for a late lunch, early dinner on a Thursday and the place was not crowded. I felt","useful":0,"cool":0},"fVF-oMJSeyR2oVN9NqEdew":{"text":"Absolutely fabulous. Beginning to end. Loved the attentive staff (Heather & Ross), every d","useful":0,"cool":0},"F68TWU_H17ppQOBsII_VWg":{"text":"The 4 stars is based on my last dinner here but I give the Mothers day Jazz brunch 5 stars","useful":1,"cool":1},"8ItTuVvzlmGU2wQwYQXtiA":{"text":"I love this place for really good New Orleans/ Creole style cooking.  I usually stop in fo","useful":0,"cool":0},"ZIzEP6XvWW1WXyV6F-0QJQ":{"text":"Love this building and dining rooms. Food was mostly good. Had to ask for service. I expec","useful":0,"cool":0},"LIL3DXGFS7zAv_N14jTjoQ":{"text":"I will start with the caveat that we did not order dinner off the menu here.  We had 4 day","useful":0,"cool":0},"2Z_GKLtReHKmE51k3GuI_A":{"text":"Date night so I took my girlfriend here and made a reservation for 2 which was honored and","useful":2,"cool":0},"e3EMLRn4x-n5qFnjxk8QgQ":{"text":"I'm in New Orleans three or four times a year and have eaten at most of the restaurants in","useful":0,"cool":0},"QPP3N482Pvh7H3vKqrAnBw":{"text":"Had the Andouille Crusted Fish and I enjoyed it.  Was with a group, the desserts were not ","useful":0,"cool":0},"rjhmC-CD5kzygbcgRuDIGA":{"text":"Crab cheesecake and Mac and cheese was just okay, but the crusted fish was to die for!","useful":0,"cool":0},"_j0idi2Ay2QTrloNQqLzZA":{"text":"Had a Wagyu steak special for the day. Amazing. Wife had the Shrimp Tchefuncte. Very, very","useful":0,"cool":0},"TTIQ_kbCs2wjk1IIGUfMwg":{"text":"One word, or dish, keeps me loyal to this place. Can you say White Chocolate Bread Pudding","useful":1,"cool":1},"EaR2ceG0uAcFZiWDH_akeQ":{"text":"A very large restaurant with a large upstairs. With a patio out front (a bustling and seem","useful":1,"cool":0},"li1OubGsl9sxb7tEfh9UpQ":{"text":"We went in close to closing and sat at the bar.  We only wanted dessert and the bartender ","useful":0,"cool":0},"AIJ9mrw6CBillNodtmdd7A":{"text":"We came in to a busy restaurant on the tail end of happy hour and managed to get a seat at","useful":1,"cool":0},"xJO6h0WGmeNTsNXj0OjbCA":{"text":"this place should not serve breakfast. or do something to the buffet to make breakfast mor","useful":1,"cool":0},"kGwd9I_sU2Um_cF87XOX_A":{"text":"Little pricy, but lovely decor and scrumptious dessert- white chocolate bread pudding!","useful":0,"cool":0},"vuPNc9bpjhbojXe8HRIaPQ":{"text":"I enjoyed the simple shrimp rolls for lunch although the salad dressing was a little sour ","useful":0,"cool":0},"Cz_xQ3bg7P3nuDmtJhkX-A":{"text":"Started wi6h the seafood gumbo which had a lighter rue than other  Cajun places. It was ta","useful":0,"cool":0},"qQOYVW_DCCdeMbSJdNIxhQ":{"text":"Sat down outside and was quickly and kindly taken care of. Ordered the andouille crusted f","useful":0,"cool":0},"PBDEN8wWsOH9e8yfu_-3Aw":{"text":"Yum!! After a couple of days of boring hotel food, had a great lunch at the iconic Palace ","useful":0,"cool":0},"jaY_tfQLMESXulVwEp1HRg":{"text":"One of my favorite restaurants!! Service is good, waiters can be a little slow, but it get","useful":1,"cool":1},"P9lnKW8Plao0bqQrRmmhPA":{"text":"Crabmeat cheesecake is a must! We tried the green goddess salad w shrimp and it was perfec","useful":0,"cool":0},"wJZLPpiJdHSCxm5F_S_sfA":{"text":"We were really disappointed by this place. The ambiance was really great. Its beautiful in","useful":0,"cool":0},"DMQbPwBX3WDhUwvibVeH3Q":{"text":"Had the Surf & Turf (Rib Eye & Shrimp) the steak was mostly fat, and the cook didn't even ","useful":0,"cool":0},"ZbdlM4Ero1z4F8QaMAXgQA":{"text":"Pork Shank was phenomenal, As were the other dishes my patrons ordered.  Deserts were to d","useful":1,"cool":0},"Dpq2EM6YWh6cfGWmFba8yw":{"text":"Went for happy hour 2 nights in a row. The $5 menu rocks. The daiquiris  are not blenders ","useful":0,"cool":0},"T8YmMGpQQ_8FuX3seOfO_Q":{"text":"This was my first time here. I was walking Canal Street and saw outside tables. I talked w","useful":0,"cool":0},"szRQ8lkeWU7hHz9TyxhHvg":{"text":"http://www.youtube.com/watch?v=iJKCQLx_K0M&feature=plcp\n\nPalace Cafe was so wondeful. Than","useful":0,"cool":0},"SVJSQJkHn6duR2a0-B_FqQ":{"text":"We strolled in here on a whim while trying to find a place to grab some brunch. The Mimosa","useful":0,"cool":0},"kphC-o3QJMBGHFV5pM8_hA":{"text":"From the very beginning, the service here has been 5-star. We were seated almost immediate","useful":0,"cool":0},"K3k0F_ZAnRA3zs5pa-RgWg":{"text":"Thanksgiving Day lunch.  Absolutely the best.  Service, atmosphere, food, drinks - all per","useful":0,"cool":0},"2IJQy1_YOyKFU0S4wfYV7g":{"text":"Food was YUMMY! I had their version of Shephard's Pie, mashed potatoes, spinach and pulled","useful":0,"cool":0},"0Q26ld2QhuCPyuzGB-iK1Q":{"text":"I really really wanted to like this place a lot.  I have wanted to try it for a really lon","useful":2,"cool":1},"8mZSn3NV21H3RuTxn2XITw":{"text":"This place was right next to the Hotel I was staying at so it was convenient to go to for ","useful":0,"cool":0},"Ho2FOm20fcGxLWDY_GHGHw":{"text":"The service was stellar.  I am looking forward to going back.  The crab cheesecake is to D","useful":0,"cool":0},"z-nooIu8_1DM8_DsjuMf8Q":{"text":"Recommend by my hotel. Fabulous service! Very attentive! The scallops were amazing! I love","useful":0,"cool":0},"g424DvAxUnq6_VMftknjpg":{"text":"4.5 stars!!! This is a wonderful place to eat in New Orleans! My friend and I went here fo","useful":0,"cool":0},"JueyGKS9PjvCZvlgANQzHw":{"text":"The best NOLA lunch we've ever had. Very friendly atmosphere and amazing food. They say it","useful":0,"cool":0},"KNp12C3uLQV2n1XdWv0kTQ":{"text":"This place is regal for the wrong reasons. The menu seems very limited in both main dishes","useful":0,"cool":0},"FBK7c8vW46dOh1uMTEGCnw":{"text":"I'm rating this place a 5 star because it deserves better than a 3.5 star average. Had blu","useful":0,"cool":0},"pvG1-ZN_OXQfE5An4QcKOw":{"text":"Another Dicky Brennan spot to go to when in town.  After eating fish all week, I tried rib","useful":0,"cool":0},"MtmCaJuYreWE4A8qUrhrqA":{"text":"We were in a very large party, so I got to try a lot of different plates.  The place was v","useful":0,"cool":0},"FyWFoiXxk0wpuJrrby7VSQ":{"text":"We are finding that it is hard to find a Gluten-Free breakfast in New Orleans, aside from ","useful":2,"cool":0},"zEjZlcSjFv_6rGOn6aez_w":{"text":"The Palace Cafe has been one of our go to restaurants in NOLA for years.  Just one year ag","useful":0,"cool":0},"KQgb7FXD_oW5KfgfIiyCBQ":{"text":"We stopped for brunch here - the food was amazing. Nice decor, jazz music for brunch and t","useful":0,"cool":0},"vNCUV7mUFufXWIeEsyI8Ig":{"text":"Went the other day w/ a very good friend - I love this place!!! I just got the turtle soup","useful":0,"cool":1},"f7cbcBJJe38mxrb6PJnIHg":{"text":"Pretty bad. First we waited 30 min to get alligator sausages, but they didn't give us any ","useful":0,"cool":0},"g-S6XKoNRbxiP7vfIQ2BeA":{"text":"I definitely had a 5-star experience at this restaurant on last night! My husband and I wa","useful":7,"cool":3},"TCAo_tHZQbcKu4JdqHj-Tg":{"text":"What can I say except EXCELLENT service. The Palace Cafe is a perfect location for brunch ","useful":0,"cool":0},"astwFZTWWk9ZYp6P2krTzA":{"text":"In New Orleans for work...no friends to go to bourbon street w/...only middle-aged male co","useful":0,"cool":0},"seX3h2VhvGyPkv2-cN35YA":{"text":"I can't judge on the food here. But the reason we give this establishment 1 Star, is for t","useful":0,"cool":0},"_3KTfz0hcPl_yq4jOyOPiA":{"text":"Palace Caf.  We always go here every time we come down.  I have to say this time was a tot","useful":0,"cool":0},"CwzgoR9WTycTXGzhXumi0w":{"text":"Service\nThe wait staff know their stuff and they do an excellent job.\n\nAtmosphere \nThey pl","useful":0,"cool":0},"5v_m6gOjq6Xhh2T_QopCjA":{"text":"This place was wonderful. They easily accommodated a large group while also giving great s","useful":0,"cool":0},"4HU-nHTJhxu40wfK987XOw":{"text":"I was here last weekend for the final meal of my bachelor party and I can honestly say it ","useful":1,"cool":1},"921bvNItdz8gWv8OAz6eOg":{"text":"The menu is a bit pricy for this Midwesterner but the food was good. I got an entire loaf ","useful":0,"cool":0},"RciyUNQuoaZHhSEQfv8fCQ":{"text":"This is a Dickie Brennan resto in the heart of the hotel district.  I made a reservation b","useful":0,"cool":0},"QJWPunKMIGJFLwnYs8G2lg":{"text":"We ended up at Palace Café because we passed by it and there was no visible line. And I am","useful":0,"cool":0},"-j8Bb0Uvr9ndzYgrZDbBHw":{"text":"The root beer pork chop and the sweet potato mash was divine. The presentation of the bana","useful":1,"cool":1},"q5VrT2YclPbSXXXeoyNLRw":{"text":"Place is beautiful. The tile floor is something you just don't see very often anymore. Did","useful":0,"cool":0},"iolJUgBGFv-U0KMvVT7EjA":{"text":"OK Yelp reader - repeat after me - \"I am going to come to the Palace Cafe and eat the crab","useful":8,"cool":9},"na3mBdK-B1-gExgSP_7Kmg":{"text":"We were staying in the Marriott and my brother had liked it before. We were told we would ","useful":2,"cool":1},"QDJ3eveDZaSXAdLREUQJkg":{"text":"I just love this place. From the service to the menu.  Today I ordered the crab quiche. It","useful":1,"cool":0},"hsTvt9kKncqJ12sAMCAgqA":{"text":"Fantastic brunch and fantastic service thanks to Jeremiah and to the trio for playing to u","useful":0,"cool":0},"76grqoEX2YLCwcQ8F5oxKQ":{"text":"Two dishes you must have here:\n\nCrabmeat cheesecake.  First bite is a bit weird since its ","useful":0,"cool":0},"hyz8tCHI8doWj4HfTGg5GA":{"text":"Food was good, but outstanding service made this a great experience. They folded the napki","useful":1,"cool":0},"eYEuAsDfzI_pCmHnhGizLg":{"text":"Food and atmosphere were great. We loved the Pepper crusted duck breast, Shrimp Tchefuncte","useful":0,"cool":0},"TUd9YOnILRBYrKflI7ObFg":{"text":"Tried the Saturday brunch since this place was available and the other place we wanted to ","useful":0,"cool":0},"c58CVMPnpmRfbq6HXNv5Nw":{"text":"I had the fried oyster salad. excellent and I really hard menu to choose from with some ma","useful":0,"cool":0},"9iKK1YUccl5pyqegHOUvVw":{"text":"No complaints on the food.    However the main waiter Jeremy customer service was Horrible","useful":0,"cool":0},"_P09Z-7dLEat-2WrvffyPQ":{"text":"My wife and I went here a few years ago, but I still think about it fondly.\n\nThis was hand","useful":3,"cool":1},"x8WrYvJJyqZO_SA_bcgmNw":{"text":"Most delicious meal my husband and I have had in yearssssss! So amazing. The food superb, ","useful":2,"cool":1},"teFOxPMr6rhvdmj3pv6P6g":{"text":"I liked this place as I can sit outside and watch the people as i ate. Plus I saw some of ","useful":1,"cool":0},"hqgNkgIkQRE8A1QJunWa9A":{"text":"The speciality breakfast is called Cheesecake!  How can you go wrong with a name like that","useful":0,"cool":0},"fbDjjQuxJW5iaxUQFxrtlw":{"text":"Quaint and Charming.  Absolutely superior service from our waiter.  I had a slightly upset","useful":1,"cool":0},"ykGzo1LDBQBvKX5Je8PtHg":{"text":"The food was ok.. but the service was great! Our server did a wonderful job making sure we","useful":0,"cool":0},"0_uvQvyQ2oAkbDSENlVr8A":{"text":"Pretty quick service. Had the crabclaws and the po-boy, both of which were excellent. Pric","useful":0,"cool":0},"sn_zhHYSbG6IfwwDfZ9L9Q":{"text":"Service was really good and the inside is beautiful.  I personally didn't like the food mu","useful":0,"cool":0},"xXjihC3qCAiRAD5IWWSfng":{"text":"I had a decent meal here but nothing to make me scream and shout.  It's a big place on Can","useful":0,"cool":0},"UjPtxzPTbRhz_bHgLaYYGg":{"text":"Unfortunately did not have a good experience   I have never written a bad review, so this ","useful":0,"cool":0},"eS6CxznHHRYRH5J4KFbOag":{"text":"Went there last year for thanksgiving with my brother. It's located riht next to the hotel","useful":0,"cool":0},"FwuRs3c7nZ6Qhetm0Bl84g":{"text":"When my husband and I were driving back to San Antonio from New Orleans yesterday, I asked","useful":0,"cool":0},"4UWxSru8AAJfOwksKNrAMA":{"text":"Not being as picky as I was in the past, I chose to put my big boy undies on try the Crab ","useful":1,"cool":1},"epJySTZalGR6jtH0tXfp6g":{"text":"What a great late, last minute dinner experience! The young man (Chicago born) had great a","useful":0,"cool":0},"TtcQTtHK87cTXh0uc-qCEw":{"text":"The food was good, and definitely unique! I got the andoulie crusted fish, and really enjo","useful":0,"cool":1},"7ntGnUVuLznvMpv9RxusAA":{"text":"BEST GUMBO OF MY LIFE.\n\nI usually take lots of food photos, but it was so delicious, I com","useful":0,"cool":0},"RtFElo3kjmA2bNjTk3bSGA":{"text":"Excellent restaurant with really good dishes and reasonable prices.  Try the crab cheeseca","useful":1,"cool":1},"9GeVb5lUUmFHKfT6DFIgiQ":{"text":"The shrimp roumelade and andouille fish are to die for. I'm not a big drinker but the \"dea","useful":0,"cool":0},"mKK5luv37uE2cNdjF8nkPw":{"text":"Delicious! I had shrimp tchefuncte, which had a great brown gravy, and the bread pudding. ","useful":0,"cool":0},"5T8vFrL8J0Fcn8mz_v3avw":{"text":"Essence Festival weekend extremely busy and service was still an A+. I really couldn't ask","useful":1,"cool":0},"0DhCqb8SNeMlEG7Xc-0ZmQ":{"text":"This here is one of my favorite restaurants in New Orleans. It's located in a great spot o","useful":0,"cool":0},"BNHQm9Gc8I0wCfIIqAh12Q":{"text":"Went for Sunday brunch.  Nice jazz band, very nice atmosphere.  I had the shrimp tchefunct","useful":0,"cool":0},"Inmvm4MnSILedUzjDzvRsA":{"text":"My colleague and I ate at Palace Cafe last night...without a reservation.  My star ratings","useful":0,"cool":0},"kzXuV3DVgwPNNao4r41R4Q":{"text":"This was an excellent place to host a rehearsal dinner for me and my 14 family members on ","useful":1,"cool":1},"QDYTIMRbOgGvkZB0kFJZ8A":{"text":"Service was AMAZING! The hostess, the servers, and the restaurant manager all made sure we","useful":0,"cool":0},"3_mb4oPemLG7Ko7JYr-wHA":{"text":"We came in late and were planning to get dinner. We got a seat right by the window for a g","useful":0,"cool":0},"7Jr5O0m3pfNBZqCZGHfWyg":{"text":"Came here for lunch on a weekday and it was decently packed. The wait staff was attentive ","useful":0,"cool":0},"kDXIbavLQaOi0DQV5ItgpA":{"text":"After a long day, we decided to try out this place. We thought trying their small plates w","useful":1,"cool":0},"G2CbGRA6b3igm8cdr_xA_w":{"text":"tried surf and turf (ny strip), large size\nrotisserie chicken\nwas average overall","useful":0,"cool":0},"XEWVe8NLezbPpqTva3K5AQ":{"text":"What a great lunch stop! My sister had been here before and recommended it, it hadn't made","useful":0,"cool":0},"pXUW_xb3gZy3qKxXYwIZiQ":{"text":"Came here a few weeks ago for a friends birthday.  Heard alot of good things about this pl","useful":0,"cool":0},"zCtNkvYh6qJGF1lou4XmjQ":{"text":"Overall the palace cafe was very fancy and I enjoyed my experience but I was completely so","useful":2,"cool":2},"KQCVgY85GkPNFoetp3EftA":{"text":"It doesn't get better than this for a creole dinner! Amazing! Shrimp Remoulade on Fried Gr","useful":0,"cool":0},"D5VJxtjJXVAI_Lsz4_Ixog":{"text":"Just as here for my 30th b day! Everything was amazing! We had 2 waiters so we were well t","useful":0,"cool":0},"CJuBceA0u_IXgHJLKs7hEQ":{"text":"Top notch Nola food! Best brunch place in New Orleans! Amazing. Wonderful! Must try totall","useful":0,"cool":0},"jSny-feKPE_p7D3a58PeXA":{"text":"Short walk from the Roosevelt Hotel. Amazing Bloody Mary bar. Excellent and attentive staf","useful":0,"cool":0},"6lkZW1UJCTNmPWQmsyemIw":{"text":"Very happy with my shrimp tchefuncte (sp?) and seafood gumbo! Service was great and food w","useful":0,"cool":0},"XT02a8vwjZkCUtfKcUyyAQ":{"text":"Food is solid but not particularly special. The blue cheese salad is well composed, and th","useful":0,"cool":0},"6kP5LRZ0rXO0LkWhUnlzlg":{"text":"Had a wonderful brunch here yesterday.  Loved the specialty Mimosa and Bloody Mary bar.  S","useful":1,"cool":0},"Fghr0Uw2ciWxLbkrDgWM_g":{"text":"Delicious food anchored by the crab cheesecake. Three waiter team was awkward but our serv","useful":1,"cool":1},"pBZlQOicjwKIEGlncqxwZQ":{"text":"When we decided to do a Sunday Brunch to celebrate three birthdays recently, we picked the","useful":2,"cool":0},"82QgdXlQm2bT1yDv1-BF_w":{"text":"This place is overpriced for the subpar food you will receive. My shrimp and grits were to","useful":0,"cool":0},"o-6U-5-t0Qb5aiIMyNgN9Q":{"text":"Hands down one of my faves in NOLA! The food is amazing. We got the make your own mimosas ","useful":0,"cool":0},"acNBfRSFGfNb04jBYHqSpA":{"text":"Crabmeat cheesecake was amazing! I was a little surprised that it didn't come with cracker","useful":0,"cool":0},"IQBntgTrPHzPAAOucHK0PQ":{"text":"Went for my birthday dinner and food was delicious. Had the crabcakes cheesecake and crab ","useful":0,"cool":0},"Sru36AH0kvdBY5D0Z-NnNg":{"text":"Palace Café is a staple in New Orleans. I've been here a few times, ranging from when I wa","useful":0,"cool":0},"4Q9_OFaADH1rVKQhAiapXg":{"text":"Delicious breakfast! My husband loved the breakfast bar and I devoured my bananas foster w","useful":0,"cool":0},"d3u4LmNyEW_vWJ5lrjh00w":{"text":"I absolutely loved this place! \n\nService was fantastic! The food was amazing! Taste that I","useful":0,"cool":0},"ArkSTl_BID1k3fWMs7PlIg":{"text":"Food was good.  Service was as well.  However, the waiter added things to our bill that we","useful":0,"cool":0},"EDW3eWDeLvAXkSXhdU4-9g":{"text":"This place is amazing! Must visit dinning place . Delicious food and beautiful services","useful":0,"cool":0},"dcHBVDu3ZvW0qFsq2bmnMQ":{"text":"One of the best food around here. Had ribeye and the banana foster. Both were really good ","useful":0,"cool":0},"V6hUKgmC5vnXyLP23nhYpw":{"text":"The service is 5star the food Was great !!!! Our server was so knowledgeable about everyth","useful":1,"cool":1},"TcjUA43wdxG0O6L2_r0nJg":{"text":"We went to the Black Duck Bar upstairs. What an amazing treat!!! Service was incredible vi","useful":0,"cool":0},"hWoBYYCeH82BCKZfv7V_xg":{"text":"Service was good. Food took a while to arrive and compared to a lot of other nearby spots,","useful":0,"cool":0},"qNIQ5NIn6kFhB8ERWrFdiQ":{"text":"We had brunch here last time we were in New Orleans. I had the Cafe Eggs Benedict. Amazing","useful":0,"cool":0},"g3U9SYJxvK5RQDmb9zZOJg":{"text":"We went here for an early dinner on a Saturday evening. There was street side seating and ","useful":1,"cool":1},"47fLg6U1ZUb3jmXOdisq0Q":{"text":"The appetizers and desserts were the highlights of our meal.\n\nI highly suggest the crab ch","useful":2,"cool":1},"jPOTw4oU6Uw-HTrQGXylfA":{"text":"I think I'm being quite generous giving Palace Cafe 2 stars.  We sat outside and the peopl","useful":1,"cool":0},"RtyFRNyaDa8jchoHslznIw":{"text":"Great cocktails, I had the \"saddle\". Delicious.  Shrimp remoulade and finished with the wh","useful":0,"cool":0},"J-0L3xljg4MAqmGBDUln0w":{"text":"We tried to go to dinner on a Saturday at 10 pm. We were told that they had no dinner serv","useful":1,"cool":0},"oqJL8toOCupwHbqRYn3vkw":{"text":"First let me say the service was outstanding. One server for food and one for drinks. Cann","useful":0,"cool":0},"NWfiYyQw_ihxFyQAr7Pm_g":{"text":"Food was decent but service was crap. My friend asked if they had any kind of option inste","useful":0,"cool":0},"38449rXTTf1RZVwYugIR4g":{"text":"Oh, I long for the old days - back in the mid 90s when the crab cheesecake with pecan crus","useful":0,"cool":0},"ByGhwV6N5n2jpCVVVN9A4Q":{"text":"Wow! Fantastic meal, great service, fun, lively atmosphere.  Saturday night got a last min","useful":0,"cool":0},"OY3JBIM-4jx5t1l6l6FRyQ":{"text":"Do far the best food we have had in NOLA.   The pasta mustard dish is amazing!!! The fish ","useful":0,"cool":0},"CqA55qY2Zi1RdUxbw2n78w":{"text":"We were here with a large group 14+ people.  They did a very nice job of accommodating a g","useful":0,"cool":0},"lPPsbVIdMCuI4AWhqbQ8WQ":{"text":"Palace Cafe was suggested to us as soon as we arrived in New Orleans and, unfortunately, i","useful":0,"cool":0},"F1hKk5aDGKJrF1xMvQnR5Q":{"text":"What a great place for SUNDAY brunch. Probably the best shrimp and grits I have ever had, ","useful":0,"cool":0},"IKUyWqsqVIDPoP5R6tonRA":{"text":"I don't know where they are getting their 4 stars but the snapper fish I got was nasty.  I","useful":3,"cool":1},"a_80K7JntNoH_Yn4Q5lOww":{"text":"We came here twice in three days. It's that good. (And it doesn't hurt that all of my favo","useful":2,"cool":3},"DX5gk7Vo5X1x2AhQpsDM-w":{"text":"Waiter was rude and the food was sub par. The prices were also high for the portions you r","useful":0,"cool":0},"ltck-oUaqA5umh_akEK-tQ":{"text":"Came here for lunch today. The dining options near the conference were too crowded so we v","useful":0,"cool":0},"40pbq2gp7OKVqJUe8lfPHg":{"text":"The food here is pretty darn good. Prices aren't horrible, especially given their location","useful":1,"cool":0},"2d6or_1wSK7UbQ4euSfxFg":{"text":"Dinner there last night.  Great as usual.  Ate the Shrimp Tchefuncte'.  My favorite shrimp","useful":1,"cool":0},"urC1mn5fi90ZU17gIiytVA":{"text":"As I write about my experience at the Palace Cafe I am yet again painfully reminded of how","useful":0,"cool":0},"htzmetfIBejUagRzX9gd3w":{"text":"Came here for the crab cheesecake, sounds like an interesting combination, but it's actual","useful":0,"cool":0},"vgOxfivtvvpNujZbwngIZQ":{"text":"Been coming here for about 6 years and this is my first review. In town for my 40th bday c","useful":0,"cool":0},"jMc6JFiy5WIZs47foGwPWg":{"text":"I was in town for an event and came here for dinner. I'm so glad I did! I ordered Gulf gri","useful":3,"cool":1},"07wJe04IS8YYYQIjQ4R-jA":{"text":"Visited  11/18/12. Food was good as well as the service. Ordered a fish dish and GF ordere","useful":0,"cool":0},"CROnXdFfL_lqI3PVnYknLQ":{"text":"Wow!  Excellent experience.  We were there for drinks and apps.  The fondue was great, but","useful":0,"cool":0},"ztuCt-FrnAY0IFP-sGXnLg":{"text":"I really enjoyed this place! I read the other reviews and decided to try the crab cheeseca","useful":0,"cool":0},"k8e1WyZfwF-V_zgpaeI0Pg":{"text":"Long overdue review. We come to the restaurant​ quite a bit just to order the crawfish che","useful":0,"cool":0},"sQ5wDWiSCpyomwmYKw6Hug":{"text":"I was expecting more from a good NOLA name. Unfortunately, the restaurant was not at its b","useful":0,"cool":0},"YWnCdpLrDSNIedLIR3qS1Q":{"text":"Awesome food, great service!  It was hard, but we did save room for their dessert - Banana","useful":0,"cool":0},"efeJtvZvtwo4gXsvJyADHg":{"text":"Great place! Had the peach and goat cheese salad, was delicious, I never had something lik","useful":1,"cool":0},"X-af5qpg__F8WkkeGlN7Hw":{"text":"BEST in New Orleans. I was sooo sad that I had decided to try this place on the very last ","useful":0,"cool":0},"vU28Maqc8hQ8vpLC91H_bw":{"text":"I felt bad coming in @9:15pm but we did not feel rushed even though they close in 45mins. ","useful":1,"cool":1},"FvuN1LPtC4IEdIUXfwtinA":{"text":"As the weather where I live currently is abysmal, I'm reminded of NOLA and the wonderful f","useful":0,"cool":0},"-bXXQZ31l2EEj6ofclT50g":{"text":"Found this place for a late lunch!  Perfect for what we were looking for.  I had the crust","useful":0,"cool":0},"Vshi4ZamPnMWlPZNzF-8SA":{"text":"This place left us disappointed, I was so upset by the experience and the treatment. We wa","useful":1,"cool":0},"H9oc2HRtTeGHVgmgPRjxdg":{"text":"My friends and I made reservations at Palace Cafe for New Years Eve. Although we had reser","useful":0,"cool":0},"1_TP9Z7O_kgFHPdImD1-hQ":{"text":"We decided to have dinner at a fine restaurant the second night there. It was a very elega","useful":0,"cool":0},"x3LHKnqVwWgyQ_f0wmQ0hw":{"text":"Everything was on point!!! But gave it 4 stars because we had to ask for bread and my frie","useful":0,"cool":0},"0aifihxB8h_nQwyBsDxXWQ":{"text":"Our first time visiting New Orleans and this place was really outstanding. The food was fr","useful":0,"cool":0},"19L0bF2P1JqC2gFDewtnag":{"text":"Canal street was bustling. Proteus and Orpheus parades had not yet arrived downtown. We du","useful":1,"cool":1},"Z8k6xHQBonS354N_2RQPoA":{"text":"This is my new favorite breakfast place in Nola. The BEST eggs Benedict I've ever tasted!","useful":0,"cool":0},"yJGd_1yE_ba71I0pRuhTUQ":{"text":"This place really confused me; it's seems like it's trying to be very glitzy and fancy, bu","useful":1,"cool":0},"YLBuUf90Kzw9DPDMutsG5A":{"text":"By far the best meal I ate while in New Orleans was Jazz Brunch on Saturday morning.  Serv","useful":0,"cool":0},"wiO20YSVEPdCbVW-Rpwbdw":{"text":"Just another reason to love and die over New Orleans- stellar, elegant food on an Olive Ga","useful":3,"cool":2},"zGwvO7bsObt31fLzClwNKQ":{"text":"This is the second time this week we came for dinner. The food is just phenomenal. Every c","useful":0,"cool":0},"I59Dk9lQPXJJn8yMryqeVQ":{"text":"So far I have eaten here 3 times in a week, simply Incredible food, however the service is","useful":0,"cool":0},"MwUpICTjvctIPL0l8LKI2w":{"text":"Real food, real good. Staff was very friendly. Got in within 30 minutes when all the other","useful":0,"cool":0},"6jlXpLWwOUPJ6wc8b5ST_w":{"text":"Excellent food! Excellent service!\nHad gumbo, shrimp , shrimp boullabaisExcellent show and","useful":0,"cool":0},"faUiWEsitk7rWmhp3t-wkA":{"text":"The food and ambiance is amazing! I had the shrimp and grits and it was mouth watering! St","useful":0,"cool":0},"uWlo8VIftSoN6a5NW2dP5w":{"text":"Visited the Palace Cafe after a drink at the Carousel Bar & Lounge (around 4:30pm). The Pa","useful":0,"cool":0},"B9PnaHJcnwNq3GT6yXkXeg":{"text":"Great environment. Food is very good. Croque Madame is a solid food choice and there's a l","useful":0,"cool":0},"wC74GBMUHAnSPlBxFmcVXg":{"text":"The place is right where all the action is and has great ambience. The special cocktail th","useful":0,"cool":0},"pwcpZDrYWHgta0B5Op0qvA":{"text":"This was a recommendation made for us on a business trip.  It was a great choice!  Since i","useful":0,"cool":0},"yzEffDTq0VkQeL3n5e_FiQ":{"text":"Delicious food! The service was ok. The waiters weren't very friendly, especially the wait","useful":0,"cool":0},"Dpmm5yZthzKr1F8ALbHzUA":{"text":"my main goal was to try the banana fosters when we went to dickie brennans we didnt have a","useful":0,"cool":1},"fZ_uFQdLv8-ineQu9CU6cw":{"text":"A terrific stop for dessert on a sunny afternoon. Of our foursome, one had bananas foster ","useful":0,"cool":0},"OGYEj2QeXNFdem2M4BnLXw":{"text":"I went there for a friend's birthday.  The service was really excellent.  I would recommen","useful":0,"cool":0},"qQLKtCoc7MsJyrT0jFConw":{"text":"The atmosphere is superb; the outside eating looks like the cafes lining the streets of Pa","useful":0,"cool":0},"LJNVRNr_mD86NOpQv0mUkw":{"text":"We walked past this reduce every day and there was always a line to get in.  We woke up ea","useful":0,"cool":0},"w6x4yB-rCZ_HSlfK_cHRYA":{"text":"Food was pretty good, the atmosphere and service were excellent.  I had the buffalo frog l","useful":0,"cool":0},"U7vN2k5K30qdwFsksgvZpQ":{"text":"Business dinner. Prix fixe menu. Great gumbo and bread pudding! The Sheepshead fish was OK","useful":1,"cool":0},"8IJ1fKWcbhNzhMlU0EclXA":{"text":"Palace Café is a beautiful restaurant with an attentive staff, marvelous decor, and outsta","useful":0,"cool":0},"2Jody6XSmfQVPpU8lDvijw":{"text":"Had the most amazing dinner tonight at Palace Cafe. Beautiful restaurant. George and Dria ","useful":0,"cool":0},"PMhmF4g3kX0nlTX-GBv--A":{"text":"Amazing customer service! Our waiters made sure we were doing okay. They were super friend","useful":0,"cool":0},"qG3XCPeBFlnp6Ddoag3lRg":{"text":"Hmm... it seems that poor service is an anomaly at Palace Cafe, so maybe it was because we","useful":2,"cool":1},"fKj7ygHID3pGETz6clGGuQ":{"text":"After a long day of travel complete with layovers and delays we finally landed in NOLA and","useful":0,"cool":1},"eeAzToTTbcvXG7SZOPBPRw":{"text":"A little pricey, but delicious. I had the andouille panko crusted pompano topped with saut","useful":0,"cool":0},"fXgbhpvVRtuSOOIjiFfMOA":{"text":"OMG get the crab cheesecake!!!!\nNo.....Don't tell me it sounds disgusting.......Just get i","useful":0,"cool":0},"HlZ7rimFtkelSrNFiqZ_mQ":{"text":"We went here after discovering that Jimmy J cafe was closed for remodeling.   We went for ","useful":1,"cool":1},"m0NbPBDq7Ul8oK7aPpHqaw":{"text":"Favorites: crabmeat chesecake, turtle soup and chocolate bread pudding. They are really go","useful":0,"cool":0},"OaSe685sZb3gnif4vqN-nw":{"text":"I've been to Palace Cafe a few times now and have had a fantastic experience every time. M","useful":1,"cool":0},"HOLchtREnluxcK5aImNKwA":{"text":"Visited the Palace Cafe after a drink at the Carousel Bar & Lounge (around 4:30pm). The Pa","useful":1,"cool":0},"4eb7xcMDlrTnqVCOaebL3A":{"text":"Nice, fancy restaurant. If you are looking for a nicer place to go out, this is probably a","useful":0,"cool":0},"lybXDPEyvgr--fL6YvX8tg":{"text":"This was my first time visiting New Orleans. I was surprised when I went inside, hanging f","useful":0,"cool":0},"cHkZKSVPSTqsvz9NBeSPpw":{"text":"A definite visit. I loved their gumbo so much I even bought their cookbook. Great waiters ","useful":0,"cool":0},"XECGcGLHnbccq2GzKNFt6Q":{"text":"I was skeptical, given the touristy location right on Canal near the big \"corporate\" hotel","useful":0,"cool":0},"F26h0cyOTG-ymUYRmlr3iA":{"text":"Went back to Palace Café on a return trip to NO. Outstanding in every way! Food, atmospher","useful":0,"cool":0},"j_0KbCesWfPu627RLrMjTA":{"text":"Unfortunately, this restaurant isn't as good as it once was and not up to the Brennan fami","useful":0,"cool":0},"a0XSshlqgmpVG5KHtAavcQ":{"text":"They serve breakfast lunch and dinner. It is a busy place and we went for dinner with rese","useful":0,"cool":0},"KorqEt9ep9gjnxgwixzXXQ":{"text":"Crab claws are full of flavor. The appetizer portion is plenty as a meal when paired with ","useful":0,"cool":0},"NzbrP9EoBkjoBbkd-7YRMQ":{"text":"Love, love, loved the Palace Cafe. Went for the first time last night with a larger group ","useful":0,"cool":0},"EKqHoVVxB5kX0GEZwSGF6A":{"text":"Service here is very good and there is a large menu which is nice if you have a group with","useful":0,"cool":0},"HcwIGnAzxAUSUxs1pqlLUw":{"text":"Great experience!!! \n\nThe Service  was amazing!, everyone  on top of what they need to do.","useful":2,"cool":2},"Wiqhq8wL3aDxi-VLTeQnFQ":{"text":"Great place for a meal! Enjoyed a drink upstairs at the Black Duck Bar, while drying out f","useful":0,"cool":0},"-JFSLRdXceX7LnjZPHl4PQ":{"text":"Great food and service. Had shrimp salad sandwich which came in 3 smaller sandwiches  - ve","useful":1,"cool":0},"DR71ptr9QFOufRlTKneG_A":{"text":"Food is excellent. Prices are reasonable. Service staff is accommodating and friendly. Gre","useful":1,"cool":0},"tTNGEXBBOg5fLAfxLKBFPw":{"text":"Went there for brunch on Sat.& they had the build your own Bloody Mary & Mimosa bar which ","useful":1,"cool":0},"B_Vbau8nHb7cTPVHYXA0fg":{"text":"I've now eaten here a few times, and have been satisfied each time. On my last visit (dinn","useful":0,"cool":0},"O9roStp6FuyCqDNiYUGj1w":{"text":"Came here for a group dinner. Service was okay, it took a while to start. I order the duck","useful":1,"cool":0},"uj-29BJf_92AcpoekXShrA":{"text":"The Palace Cafe was fantastic! We stopped in after our St. Louis cemetery tour for a bever","useful":0,"cool":0},"G1kyahCpRvo4osPBV0L8Ew":{"text":"We chose to eat in the outside dining area for dinner so we wouldn't have to wait for a ta","useful":0,"cool":0},"BQOah9lmHMfR7JkyImRxgg":{"text":"The service was exceptional. However, I had high expectations for their food since multipl","useful":0,"cool":0},"ov4aDfvqfyggYRJzo_XFsQ":{"text":"Everything about this place was amazing! I highly recommend it! \nTo start, I need to prais","useful":2,"cool":1},"dCYT6W2zmnmj4XEbyE8yDQ":{"text":"Used to live in NOLA and ate brunch there regularly. Went there after a 10 year hiatus and","useful":0,"cool":0},"D6u3rTi8HRenT-1d5OzWoQ":{"text":"The Palace Cafe may be great for tourists, but as a local, it's not at the top of my list.","useful":0,"cool":0},"yJE7LzPO3kDfA8fTDZkXcg":{"text":"The only reason they are getting 2 stars instead of 1, is because they messed up on our de","useful":0,"cool":0},"yIRtG0WFYqVmZmC8CJ9Ceg":{"text":"The service was amazing drinks were great food was not my favorite in New Orleans . But I ","useful":1,"cool":0},"f7_ZH8TTkh6uu8AxOKDs7A":{"text":"We had tried stopping in here for breakfast on a Sunday but it was so busy we ended up els","useful":1,"cool":1},"9bD_YiCjaaJdCXWpjxWy4A":{"text":"More like a 4.5 ambiance was ok music was great, food was great, service was great, crab l","useful":0,"cool":0},"zYXU1bFxry_POQneTMT6ZA":{"text":"delicious food.  We went there for dinner tonight.  We had the crab meat cheesecake as app","useful":1,"cool":1},"hymLGle3DWz7fsoap2U7Hw":{"text":"We wanted to dine on the sidewalk, but the tables were full. We had just left the gym, and","useful":3,"cool":1},"Z02BcEpdOH5rNogykNx3rg":{"text":"We asked our bar tender at our hotel for a recommendation,my wife had a hankering for a Ch","useful":0,"cool":0},"XbkzAsN3bGhEYJyKh1qtbQ":{"text":"You must order the crab cheesecake as an appetizer. Mesmerizing flavors and wonderful pres","useful":1,"cool":0},"TIFSrXukWv79kZ0vLliluQ":{"text":"Service is great. Food is even more fabulous. I recommend their specialties- especially th","useful":0,"cool":0},"mlGrZOAZ0Cv_B9uP4taeZg":{"text":"Very nice location. Love the look of the place. Food very good and love the Hurricanes. Ba","useful":1,"cool":0},"5tiKjJZ68f9XJsDKGkTygQ":{"text":"3 Servers to a table of 3 will make things Awesome. Crab Cheesecake was Amazing. I could g","useful":0,"cool":0},"JEUj4mPczXEvsIG4h6BxUg":{"text":"A very popular restaurant in NOLA, the Palace is a must eat during your visit.  The food p","useful":0,"cool":0},"WPupv9UnSfhpFAh6SEfn5g":{"text":"We stopped for dessert.  Sat outside and people watched.  Polite staff and great crowd to ","useful":0,"cool":0},"E7niEag_1ORm3Ma_h7Lrrw":{"text":"Great food, excellent service and seeing but tasty drinks. What more can you ask for?","useful":0,"cool":0},"E2Bkigghq3ZVy-oLalddKA":{"text":"Horrible experience.  They make a big deal about the number and duties of the staff who ar","useful":0,"cool":0},"Yi2Wo0bGo7IL3rziZ6wmZQ":{"text":"All around good restaurant! Went for lunch and was able to sit right away. They are kid fr","useful":0,"cool":0},"KTDiHQ1uqt-C-WPS4Zj_5w":{"text":"Totally overhyped & overpriced.\n\nThe service was okay overall, but whenever we ordered our","useful":0,"cool":1},"3782vAyKgpjVSWRCxJsH1g":{"text":"they wouldn't accommodate to my size. so if you're going in a large group, don't go. and t","useful":0,"cool":0},"XraWpE2x54bU5mY--_fN2A":{"text":"Good food. We had the Crab Cheesecake and crab claws. Just appetizers since it was late. B","useful":0,"cool":0},"SWbHka0YXIPHBTx7zNvQuA":{"text":"Grabbed a Tuesday brunch outdoor amidst a nasty smoke stench the entire time. At least the","useful":0,"cool":0},"8jgFe1jiOkE5m6Ip_EkndQ":{"text":"I came here with today with a vendor. I had reservations.  We sat and we ordered.  I got t","useful":3,"cool":1},"bLO75US8xh-42yaP0gK3mw":{"text":"Note: We came during peak brunch hours (Sunday 1130am-1230pm)\n\nService: 2/5\nGiving the ben","useful":0,"cool":0},"wqJxFhRk_a0E8JqndP14Yg":{"text":"Descent food, good service. Expected a bit better food/flavor/portions. Don't come too ter","useful":0,"cool":0},"rB186Rr7sxOKc3nPU038DA":{"text":"The food is amazing. Service is great. The staff makes you feel special. If you come here ","useful":0,"cool":0},"Qcq-yrD6hcJL-hINbdDXsA":{"text":"A great restaurant! I went twice in 24 hours it was so good! Stellar service, excellent fo","useful":0,"cool":0},"ew89x3EpUc2vzWf-aEgyNw":{"text":"I cannot imagine how this place has 3 stars.  I am a New Orleans food NUT and I always rec","useful":3,"cool":1},"FHtGQK73_va2w87vo9iyRA":{"text":"We ate here for breakfast and sat outside. Fun people watching. Food was amazing, service ","useful":0,"cool":0},"O9qMY7vJEe_isZNrZTxPJA":{"text":"The good: Service was good. We were promptly seated and the waitstaff were very attentive.","useful":0,"cool":0},"UVB9sqTFLBRtVJGR4btRzw":{"text":"Oysters Pan Roast was interestingly different and satisfying, milk poached fresh oysters r","useful":3,"cool":1},"ULPpwc9wQ106edkhtYsfHQ":{"text":"At first glance this place looks cheese-o-la based on the fake white and green wicker chai","useful":0,"cool":0},"JyqYg9qKDhnsDiuAqCWZuw":{"text":"My dish (a $15.00 cheeseburger) was served with a slice of tomato that was surely meant fo","useful":0,"cool":0},"kxgVzPJ3TDM7d9w55HzxVQ":{"text":"Friendly service, and reasonably fast at lunch. \n\nWould've liked more vegetarian options, ","useful":1,"cool":0},"gee-3TtE5PIP0J6N8_SGZw":{"text":"The service was great. The food was ok (I had crab claws & catfiah) and didn't feel the be","useful":0,"cool":0},"wt1vO4P6z0dwt3TJDplZ-A":{"text":"We went for dessert - specifically the Banana's Foster. We sat at the bar, so we didn't ge","useful":0,"cool":0},"L3AvpOLEB9fzK9em6bArvQ":{"text":"Another Brennan Resturant def 5 star. Wow breakfast lunch or dinner wow.\nWhite glove servi","useful":1,"cool":0},"6Uo16dI29cqHxiD_C7oT9Q":{"text":"Delicious food.  We wound up here after the two other places we wanted to try were closed ","useful":0,"cool":0},"tihgxLOFdeAzigKGUtO-Yg":{"text":"Excellent food and service.  Everything you'd expect from a classic New Orleans eatery.","useful":0,"cool":0},"c9wiw84PsuEJmZVOibaacA":{"text":"Great Bread pudding dessert!! It was moist, rich but not overly sweet. The best!! Highly r","useful":0,"cool":0},"FroLsfWH1ZQIbYzb6O1w1g":{"text":"Good food, very poor service. I had to ask for a coffee refill. The server Randy, didn't b","useful":0,"cool":0},"zEmTT4K4Y0O_lup2qa6Yqw":{"text":"Men have to have sleeves on their shirts or you wear a ridiculously bright orange shirt.","useful":0,"cool":0},"ugqC8TNms12UZ2wS-pBpGA":{"text":"We had a great time at Palace Café during happy hour. The staff was great and the food del","useful":0,"cool":0},"hG7lqg3azGXyQ9MO0LFf2w":{"text":"Desert only review: Our banquet didn't include desert so on our way back to the hotel, we ","useful":6,"cool":2},"BuS_pp6Jd6jbstBnmM6Ouw":{"text":"I visited the Palace Cafe on a Wednesday night in March. While my mother had dined there o","useful":0,"cool":0},"RrNgGCR6TRRzShfC2CVgbw":{"text":"Not sure how to review. The serving staff are amazing and very friendly. But because of so","useful":0,"cool":0},"flMqkq3Km9KaOWd-1nbE6g":{"text":"As soon as we walked in we thought we were still outside smelling the sewers. It's differe","useful":0,"cool":0},"iuVSbqYp17U1clJsL8I2Sw":{"text":"I came in on a recommendation from a friend specifically for the Banana's Foster. And was ","useful":0,"cool":0},"6O2535l4F48uRKRwrUGqbg":{"text":"12:30 pm on a Saturday. Sat in the upstairs bar area. Tried to order drinks and food at th","useful":0,"cool":0},"rpJwei_xzRwqD4rh3jNIhw":{"text":"I recently went on a girls trip to NOLA with some friends. This restaurant was recommended","useful":0,"cool":0},"yVaqgp13e6kOPurOqGlU3A":{"text":"Been to the Black Duck bar many times but today will probably be the last.\nThere was no st","useful":0,"cool":0},"Q4KBTJVC1Et02DnJsbMfKA":{"text":"Food was delicious -though expensive. I also found it difficult to find anything to order ","useful":0,"cool":0},"OsGv-3FurEpwpAR9gMAdBg":{"text":"Stopped in here for lunch. The food was very tasty and the service was top notch. Only \"co","useful":0,"cool":0},"1dTMW8p0YXAUtxCNpYhnBA":{"text":"This is an awesome Brennans restaurant on Canal Street and walking distance to the French ","useful":0,"cool":0},"Ixoro74jW45qd7rf5lOyfg":{"text":"Delicious seafood. Our favorite was the Bananas Foster prepared table-side. What a treat! ","useful":0,"cool":0},"uI43W4rYziqCgw83yiexoA":{"text":"Went to a trip to New Orleans and stayed at the Sheraton hotel. The Palace Cafe was super ","useful":0,"cool":0},"AT49wiKyydB8lFxeqFLGzg":{"text":"Excellent food, ambience  and staff . Had the bbq shrimp and grits for the special Tempera","useful":0,"cool":0},"hT3RLqXpWEMAaAnBnJuUUQ":{"text":"This Atlantan is loving the cool, New Orleans ambiance, super attentive service...you get ","useful":0,"cool":0},"4m2GvZwiUhI7tU98lhhLyg":{"text":"Oh where to start?!??!??!? The frozen banana foster os a MUST. If you order just one item,","useful":0,"cool":0},"vQ-a6Qp2cYejYD4eJ1q8bw":{"text":"The service at this restaurant rocks! They have a fleet of specialized wait staff: differe","useful":1,"cool":1},"ivkPGNApwrikFsG9n9NwCQ":{"text":"I had dinner here with a group of 6. We were staying at the Marriott next door and didn't ","useful":1,"cool":2},"F_B0RkKEzkI0BkT5sPHkag":{"text":"Just meh.  Good location off the broadway for people watching, but slow service and medioc","useful":0,"cool":0},"7XcLQnnOM_ljCyE3u7IQ8A":{"text":"My friend had raved about this place along with Mothers? So we made reservations and dress","useful":0,"cool":0},"G-VlyFh6dkQ8Cq6jS3w9cg":{"text":"While not a tiki bar, you can get well made, proper tiki drinks here.  Go upstairs to the ","useful":0,"cool":0},"KtzM1JvyK_KhcxuJQaCxsA":{"text":"Nice little place on Canal. it was right down the block from our hotel. The food was ok, b","useful":0,"cool":0},"WQ4fcl9WgieNtpgca0d4kw":{"text":"This place is a great breakfast place!! The service was amazing, the servers, kitchen crew","useful":0,"cool":0},"W3D9O3bL1yTxuIEsrXOSMA":{"text":"Andouille crusted fish was the most amazing dish ever. David, our waiter, was so professio","useful":0,"cool":0},"zKYD-XcRmmgTiaSo4nPp6w":{"text":"Great casual atmosphere terrific service and impeccable food in a nice relaxing wood panel","useful":1,"cool":0},"rLDAWVMv-QBivKYbopnoDQ":{"text":"Service was great. The crab cake cheesecake was not what I thought but it is deliciously a","useful":0,"cool":0},"wq8vu0NFLaztwfb55DJbjQ":{"text":"Look, Palace Cafe has a lovely patio. And really wonderful food.  But what the heck is up ","useful":4,"cool":4},"Mh-WrLDyJA2ZXUQboBw6Qg":{"text":"Swanky and fun, with a snobby waiter to back it up.  We were there mostly for the bananas ","useful":0,"cool":0},"rzDozts8CFFBZLmpI24x4g":{"text":"The shrimp remoulade and chicken gumbo are highly recommended. The pecan crusted tilapia w","useful":0,"cool":0},"bS0RypE0ipnYxEggqxudkw":{"text":"UuYuk! We had dinner in the blinding rain......to bad our taste buds were not blinded by t","useful":1,"cool":0},"mfR5re1VE1lp1lYWX21SpA":{"text":"I travel the country and eat out quite a bit...I can't begin to describe the incredible ex","useful":0,"cool":0},"bWFLJRpk7rn2TzO1CgTw0w":{"text":"Love the outdoor seating here !!  We have visited twice in the past 2 days.  They have a g","useful":1,"cool":0},"RrXxzkeo1N_MYxNfgrgH2w":{"text":"Slow service but good food. Most of the tables were empty and still servers asked us to wa","useful":0,"cool":0},"f0hQ__la9ah2GyV2OHkTkA":{"text":"Nice and relaxing sitting outside. Kathleen was my waitress and she was attentive. White c","useful":0,"cool":0},"UfSulelOGeWoDNtzeWcuow":{"text":"Very happy with this restaurant. I had the Andouille crusted fish, and it was so good. Gre","useful":0,"cool":0},"OU30vTcmTXlLBZRufvdGdg":{"text":"The atmosphere is wonderful, the staff was great and the food was awesome. We had two serv","useful":0,"cool":0},"OdUF-QBqCq73NEJy2wy-xg":{"text":"Loved the cauliflower and fried eggplant!! The atmosphere was beautiful and the wait staff","useful":0,"cool":0},"jKNtynn-mxWPm4ks-Uo0DA":{"text":"We came here just for the bananas foster, and it was absolutely delicious! They flambé the","useful":1,"cool":0},"HyJ0eA8vETOMiiN6U6Le3g":{"text":"Food is excellent, my server was too busy (in all fairness, he was also a bartender) to ma","useful":0,"cool":0},"JQZGLAllqtzH5NoNMlbUxw":{"text":"I heard so many things about Palace Cafe and how wonderful the food is and the experience ","useful":1,"cool":1},"Ub5wbwjmBRA2xYnBCLkDvQ":{"text":"Stumbled in here. We were looking for bananas foster here. Well found this place. They sai","useful":0,"cool":1},"CQtelZRx_e7d63IsdKlUUg":{"text":"I have been to Palace Cafe at least a dozen times over many years while in NOLA on busines","useful":0,"cool":0},"si_1xIsBV_WGefSq69tBIA":{"text":"We came here because there were so many great reviews but we weren't really impressed. Don","useful":0,"cool":0},"vYCyFWhPiGcU9OnNb9GMIw":{"text":"Walked away from this place with mixed feelings about the situation/restaurant, so I am sl","useful":1,"cool":0},"BK6_xMU7HMtyDzoIAaHU8A":{"text":"Went to Palace Cafe last night for my birthday dinner. We both had the ribeye steak which ","useful":0,"cool":0},"anU9CpzeFLSH4dWSWpC1zQ":{"text":"Fun.  It was packed but they barely mentioned upstairs which was wide open.  Odd.  We almo","useful":0,"cool":0},"XgOwL9m4RdM8RPqW09DEFg":{"text":"This was a recommended place and I am so glad I went! I had a party of four and Claude was","useful":0,"cool":0},"emIv7F3oXtQIF1XOtpPimQ":{"text":"A little unassuming from the outside and wonderfully surprising inside- bright, airy, and ","useful":0,"cool":0},"GUcy6gy59U4zfHzP2f-Ssg":{"text":"Strangely disappointing for such a prime location. I came with a group of people and every","useful":0,"cool":0},"p-YGoAKNDMtCHuA9koN8Mg":{"text":"The breakfast bar was not filled properly, orange juice was empty and not refilled, biscui","useful":0,"cool":0},"5Ion7AgtIg_Ifipe5GHLOw":{"text":"I can't speak for service on the dining floor but bar service sucked.  The bartender had a","useful":1,"cool":1},"GprI1ZLu-TrFfK6kLkuGbQ":{"text":"The atmosphere was very nice. Although there was a strong smell of bleach in the first flo","useful":0,"cool":0},"yv63l2SonmmGoMN09Ul7yw":{"text":"The most amazing food. Their crab cake is to die for. Also the turtle soup. Must try place","useful":0,"cool":0},"ZdtJfTRA-Z3NaVQM-139yw":{"text":"pretty solid restaurant conveniently located on Canal street. If you are a tourist staying","useful":3,"cool":2},"cwL6BzhK9Di2tpJG1OCVLw":{"text":"The Turtle Soup and Shrimp Tchefuncte were outstanding!  Located right across the street f","useful":0,"cool":0},"HEwZIRVXwOoda6CJ10TGAw":{"text":"I guess I was so disappointed in my experience here that it's taken me a bit to share it. ","useful":6,"cool":0},"-reSbDxU0I9QhkNRliYuEQ":{"text":"We love this place!!!  Fantastic food, service and music every time we've been.  We had a ","useful":0,"cool":0},"r7xgYo0UXaohrKwSyOeBvg":{"text":"The staff was awesome. I love my waiter and waitress. I'm not going to say the food was ba","useful":0,"cool":0},"tivrJbDHLk3NHyOmeq388g":{"text":"Food was great.  Atmosphere great.  \nOur server however made our lunch not great.  He has ","useful":0,"cool":0},"SZ_7-9mcPMZ7h_gAdyD79Q":{"text":"The best shrimp and grits in NOLa! Service the food is excellent we will be back for more!","useful":0,"cool":0},"7Q6rWsuFpz4bS-xEb17kiQ":{"text":"Ruined my trip. I've been in bed for 2 days with food poisoning after they used rehydrated","useful":0,"cool":0},"4BKZ-K-5ufBaW8baeBRJ2w":{"text":"It was a great time people watching on the patio. Enjoyed delicious bread pudding and drin","useful":1,"cool":0},"RyRG69MDwRJmyiqOT3cpfw":{"text":"When I crave a great dinner, great food, great service and amazing ambience.... THIS is wh","useful":0,"cool":0},"7prdab0PZu5R9BUzKneD7Q":{"text":"Banana's Foster for the win! EASILY one of the best desserts I have ever had. So simple, s","useful":1,"cool":1},"hEya28OWpVNvBdjtp043Xw":{"text":"great food. great desserts. the banana foster came with a show. it's got a fancy feel but ","useful":0,"cool":0},"636nxK5b9hIJWjbW5pTvig":{"text":"Great happy hour! Half priced beer and wine from 4-7pm. We also came here for the bananas ","useful":2,"cool":1},"rO8xGYMWT9jgviGS5oFK3g":{"text":"A bit late in writing this, but better late than never I guess. Took the family there for ","useful":0,"cool":0},"Vs22khFDggCBVADAKVKkhQ":{"text":"Jasmine was an excellent sever !!! We dined on the sidewalk just like back in the when can","useful":1,"cool":1},"xEzvVcbky-0Skt2VfcnziQ":{"text":"Great location with decent service and food.  WAY overpriced.  It seems like it went downh","useful":0,"cool":0},"UqZc8y-m2OpLysRkSPBLuQ":{"text":"Probably the worst dining experiences I have ever had.  From top down this place failed mi","useful":0,"cool":0},"AxYJeeAJbCL1rd6Bx3lFOg":{"text":"I was pleasantly surprised with The Palace Cafe. To be honest, as a New Orleans native, I'","useful":0,"cool":0},"10GcGz9t6mIa3SF11hmrGw":{"text":"Had a piece of grilled swordfish. It was over cooked.  Dry and crusty. Could have used it ","useful":0,"cool":0},"g7tow1Rl-ieS8KmJ7QvSvA":{"text":"Service is terrible, waiter wants to tell you what you eat and share. Waiter Rick was awef","useful":0,"cool":0},"uGSIW6cmpBxmV_lpk4IW1A":{"text":"I just had the most amazing lunch at this establishment. The Godiva coffee, crab cheesecak","useful":0,"cool":0},"W5KyH1SEsFbKk16TgZpu1g":{"text":"Their Andouille Crusted Fish is to die for. Best I've ever had. Perfect taste was a sign o","useful":0,"cool":0},"7mgYlPdQY6pemkUoFg8F9g":{"text":"Been my tradition for almost a decade! Ms. Nikki is great and the staff are super hospitab","useful":0,"cool":0},"nz3DZfIOmrIrtPh3U_M37w":{"text":"Great lunch in the French Q - dinner menu is limited and overrated in mho.","useful":0,"cool":0},"iYulddFdxYyO5jAOlaLjgw":{"text":"Beautiful inside.  No wait with a reservation.\n\nDinner was excellent, from drinks to desse","useful":0,"cool":0},"MiWg2n1VVTVI3hgm77ZDmw":{"text":"Came here for breakfast and highly recommend the super sweet bananas foster waffle. The br","useful":0,"cool":0},"y0Q7avg9YiLI8DjtqPETyg":{"text":"Compared to other restaurants we ate at in New Orleans, I was not impressed.  The food too","useful":0,"cool":0},"uUETxGk7syuBPb9ehh1vEQ":{"text":"The restaurant is really big so it doesn't feel crowded, the atmosphere is very pretty, an","useful":0,"cool":0},"EP-hgJPzczm_ryEeY5nkvA":{"text":"We love the waitstaff  at this restaurant.  Everyone  is friendly, as well  as  attentive.","useful":0,"cool":0},"lY_wRgt-Lxo7XCEvn6twHA":{"text":"This place was okay. Its one of those restuarants that I had to try do to it being showcas","useful":1,"cool":1},"XvymjaLQ8jhSPuGyhLA5-A":{"text":"This is a lovely place, clean, the decor is perfect nostalgia and time period of last cent","useful":0,"cool":0},"RKqZhzbtt2BaYE4qZYUtZQ":{"text":"We had read great things online about this restaurant and were excited to try it and the f","useful":0,"cool":0},"DSQ-G42lGklhUXplhSM9iA":{"text":"I wish I could give 4.5 stars. The service was perfection. The food is tasty, well crafted","useful":1,"cool":0},"MymJou7gFv47D_1koEoDAg":{"text":"Food was really good. The turtle soup wasn't my taste. Service was excellent. The server t","useful":1,"cool":0},"O7ySS8dBpgqFDWEwBxAYBA":{"text":"Service was excellent. \nWe all (group of nine  loved the crab cheesecake - of course- and ","useful":0,"cool":0},"00l2FCqcs5LqOvyQoBlIEw":{"text":"The food here was great! My catfish pecan was tender with a slight crunch from the coating","useful":1,"cool":1},"k5Bk1Jpjv8Y9_wBPYD9cUw":{"text":"Everything was so good! The crab cheesecake appetizer caused a fight at our table. The ban","useful":0,"cool":0},"DmSif3p8RNcHcPLnmzwEIg":{"text":"I started with the mushroom soup - Meh, french mushroom soup is brown and salty. Then had ","useful":0,"cool":0},"UgKEk2C9Nf7mpIisOUnT2g":{"text":"The crawfish étouffée was absolutely wonderful. My husband had the shrimp and grits. A pre","useful":0,"cool":0},"mJbIDjVeaFuojJPysvIgRQ":{"text":"The coffee here is really good. I like the customer service. I haven't been please with th","useful":0,"cool":0},"nUvC6ATh3amDvHu8tm8lTQ":{"text":"I sat outside.  There are 8 tables and 2 waiters.  It took 15 minutes to get a menu and 45","useful":0,"cool":0},"CCkvWCvH1YrAhabv2aPnzA":{"text":"Food was tasty, but even getting our drinks took a very long time.  Once our food finally ","useful":0,"cool":0},"MZyzPSReLt4uwnBM9lTxRA":{"text":"Pretty goof joint.  A bit pricey but worth it.  Seems like it's gonna be a dressy spot but","useful":0,"cool":0},"2MwQparrxTbCYIxIGwgSWg":{"text":"Amazing food. Great happy hour specials (1500-1900), good service. I will add this to my f","useful":0,"cool":0},"qbRdj7gQjb23NWf1RhxRZQ":{"text":"We love this restaurant! The food is always wonderful and the atmosphere is superb! My hus","useful":0,"cool":0},"igtlexnLxTyRuyOZciiPMw":{"text":"Palace Cafe is an iconic New Orleans restaurant. Although it can seem a bit \"touristy\" to ","useful":0,"cool":1},"nz9NPC3ZW_UDj9nxpwurrg":{"text":"This place puts out some amazing food. As a tourist I was looking for a place with some lo","useful":0,"cool":0},"RtjGBhn2SPft8XmpmLpOXg":{"text":"Such a beautiful establishment! Great dinner ambiance. The staff here are all so nice, fri","useful":0,"cool":0},"yOEosH9hlUdURfLh0lxNIw":{"text":"Well worth every penny!  Service was fabulous.  Attentive, friendly but not intrusive!  We","useful":1,"cool":1},"ts_ZJJQmqUiFOAQy0QdKrw":{"text":"It was a good atmosphere and the wait staff was very accommodating. We were able to get se","useful":2,"cool":1},"4NlHEL4I7sz4cklT9Q6-gQ":{"text":"I've been here three times and never had a bad experience. The service is wonderful and th","useful":1,"cool":0},"0gjuIESiY0yjgSMxrsod7A":{"text":"The shrimp & grits were life-changing. So delightful! Service also top notch. Worth a trip","useful":0,"cool":0},"g6xtRdPpm5STVkZDreHlPg":{"text":"Had the Gumbo ya ya. It was fresh and tasted amazing. The warm fresh bread was great too. ","useful":1,"cool":1},"OHbTvlUcFWw_fQwurgQYZw":{"text":"Absolutely the worst service I've ever had in New Orleans. It took my wife and I well over","useful":0,"cool":0},"KwP2UTKazfVDykC-GZvEnw":{"text":"Food was good. Portions were perfect. Service was good - just a little confusing. We had 4","useful":0,"cool":0},"qgC1yvsdFeqwTOwJJIafeA":{"text":"This is the spot if you are looking for something gluten free and delicious! I had the Shr","useful":4,"cool":1},"MzR1_tddME82vKHxkyh4hQ":{"text":"My dad and I stopped in here for Coolinary lunch. First of all, I was excited that parking","useful":7,"cool":5},"QC7ZL1lXihMLbrVWrjvgPQ":{"text":"This is my first time visiting New Orleans and I was told by multiple people to try this r","useful":0,"cool":0},"to003qfhPZzt05HDtt7vVQ":{"text":"Service was outstanding,  really good staff. I had duck special and wife had the filet.  H","useful":0,"cool":0},"yaCUVyRoxCAi8a5unGIPuA":{"text":"I loved what I had drum fish with crab and fennel and white chocolate bread pudding for de","useful":0,"cool":0},"yMsJDaBkTQpn9tW7XakhBw":{"text":"The service here was terrific. I had the burger that came with fries. It was juicy and fla","useful":0,"cool":0},"-S9ODwg5eX5_jQh-uO-eCA":{"text":"Creole gumbo cup to start. Love the presentation. Waiter provided two types of hot sauce o","useful":0,"cool":0},"2VwEUctwFhTi15WqmEiFcA":{"text":"Went with my boss and our staff for lunch. Service was pretty good, except that the wine t","useful":1,"cool":1},"5StMyA1sSdQM-rgazxpErg":{"text":"Loved it!! Wonderful food, great wine selection! Excellent service! I had the braised pork","useful":0,"cool":0},"C01D1eshM-2k2N3G7VFcJQ":{"text":"If you are thinking about eating here, you better go ahead and go! Stop reading these revi","useful":1,"cool":0},"ZZ2WF8XeP78sSPa9YMZhEw":{"text":"Delicious!!!! Lovely restaurant. DINO our server did a great job with recommendations.","useful":0,"cool":0},"67lS3Eo4qBsBZsiFV6ybTw":{"text":"Extremely disappointed in my dinner at the Palace Cafe. The server was friendly but unhelp","useful":0,"cool":0},"ht4Yt-GAaOSHlR55olt-4A":{"text":"Got the breakfast buffet which I felt was a good deal for $16. Excellent potatoes and croi","useful":0,"cool":0},"iJBx--5R63dRu24MK_uQww":{"text":"Tip: Sit outside or at the bar to bypass long waits. \n\nI was in town for a conference and ","useful":0,"cool":0},"O5klsjmeBmQkU21OzuyjDA":{"text":"I have eaten at the Palace Cafe a number of times, always as a second thought after saying","useful":0,"cool":0},"9cvw5V1knoRjqyQMmTo1bQ":{"text":"Best service I've ever had. Hands down. My friend and I had hangover brunch here, our last","useful":1,"cool":0},"kt4cBT8TaKKeG4pe_mjJrQ":{"text":"My family and I stopped here for lunch one day. We did not have a reservation, but we sat ","useful":0,"cool":0},"zPu20O_EpGdc5fVYddB0Gw":{"text":"Always a great place to take my guests and treat myself to a nice meal! The service is alw","useful":2,"cool":0},"KV7aSBW1Aa7bMlxtwXcKbQ":{"text":"If I could describe my overall experience with an emoji, I would use the one with the girl","useful":1,"cool":0},"iNlfeB5llD-WoZ6Zo_2zgw":{"text":"The crabmeat cheesecake lives up to the hype. We also really enjoyed the crab claws and of","useful":0,"cool":0},"jb9GhvP9LNKuvdwCoaOn3Q":{"text":"Let me first say that the food was delicious--crab cheesecake appetizer and the andouille ","useful":0,"cool":0},"-7V28LGUPu0dGcDGM-4OEg":{"text":"On arrival in New Orleans, I felt I had waited too long for this visit so i dropped off my","useful":1,"cool":0},"c56xc8ZwGyP1VjwMhVIExw":{"text":"As a NOLA native (now living thousands of miles away), I take my meals very seriously...es","useful":1,"cool":1},"QPecIjkVr4K453OcxBNkog":{"text":"4 star solid, service good, prices were great because we did 1/2 price happy hour, and foo","useful":0,"cool":0},"8HVpFj8Qz5WLxw2-QX3Ycg":{"text":"Not sure which person led us to this place, but Im sure glad they did.\n\nWhy I dig the pala","useful":2,"cool":1},"c3MCalyEjkxM38pzqOTRRA":{"text":"Food was great! Tried the alligator and duck gumbo based on reviews. It was delicious. I a","useful":0,"cool":0},"OFJCy7pQCo2MjtulZE8Q9Q":{"text":"we were a big group and the food was excellent. Great service, served on time and deliciou","useful":1,"cool":1},"VLw6IG-eeLSxV_dIBeVbOA":{"text":"I was so hungry when I arrived after a full day of travel and expectations were high. Serv","useful":0,"cool":0},"dWOomCcqDX6kLOUrAYFikQ":{"text":"Usually one of my favorite places. But not this time. They took an hour to bring me out a ","useful":0,"cool":0},"F1HxmfUQWRTkJ9wA2OFQJA":{"text":"Over priced buffet. Same food you get at a hotel. Completely inflexible with all request. ","useful":0,"cool":0},"tZqCKpvX87mHT7HsOGZS8Q":{"text":"This place has pretty good food, and a SUPER CONVENIENT location! Right on Canal!\n\nYou mig","useful":1,"cool":1},"qs4f_CemzYnNw6tw-27KEg":{"text":"I had the seafood gumbo and shrimp tchefuncte which were both delicious. My husband had th","useful":1,"cool":0},"y8PpyLrXZnpt1ITqYXB1NQ":{"text":"Used to be one of my favorite restaurants in New Orleans, returned for the first time in t","useful":0,"cool":0},"XMNDIHOAQEWboQCr4bjOmQ":{"text":"We happened to stumble upon this place as we were walking through thw cold windy city stre","useful":0,"cool":0},"ZobPghPyxhQ2J1f5Je_7Hg":{"text":"I stopped here as soon as I arrived in New Orleans. I was looking for a small bite to eat ","useful":0,"cool":0},"jMPdvQ4tOiHkKLLuNpaYgQ":{"text":"This restaurant may have well known owners but it seems that the reputation of their cafe ","useful":0,"cool":0},"dlO1PCPa6LIDBhWZ-7LFRQ":{"text":"Very classy joint. The crab claws were to die for. They will have you fighting over the la","useful":1,"cool":1},"tIYnnKVBLAPmpMtl2pYC-g":{"text":"Amazing service & great tasting food - my favorite was the crab claws.. a must try when yo","useful":1,"cool":0},"KiotZJjFZZsKLColvXjSDA":{"text":"Oh my goodness!! Jada and Chuck were amazing!! Get the duck as well it was succulent and w","useful":0,"cool":0},"Ola2aYCE2GI_dSk7td8jeQ":{"text":"All seven in our party ordered a different starter and entree and raved about it later.   ","useful":0,"cool":0},"Y083oZLKjj5UGjS5F5NKWg":{"text":"My friend and I went for the Jazz brunch on Sunday. We had the Café Eggs Benedict and Bana","useful":0,"cool":0},"GV1_X4hDo7Tuiginhed8iw":{"text":"Jessika is a LEGIT server! Really knows her stuff, she's badass! If you eat here ask for h","useful":0,"cool":0},"II_5wM-GQSgRi2L-kbcrfg":{"text":"We have been to Palace Cafe many times. As usual, the food and drinks were outstanding.  T","useful":0,"cool":0},"2SBYQriUFf3pujDnsjtmww":{"text":"Awesome place, starting from decor to waiters. Delicious food and even better deserts. Hig","useful":0,"cool":0},"iynx5bo6gy81uJGCIX6WEw":{"text":"Some of the best food we've had.  We had the Shrimp Tchefuncte and the Andouille Crusted F","useful":0,"cool":0},"DpFWASZoZM-ce24E31NkcA":{"text":"Came in with a group this weekend, unfortunately the once fantastic service is slipping ba","useful":1,"cool":2},"lBnzC-OaYvCaBTH0LYkanQ":{"text":"I think that this is probably a very good restaurant. Our waiter Jared and Zaire.were very","useful":0,"cool":0},"nWitcWcKcDMqzZErpucIOQ":{"text":"Dessert, coffee and a beer all amazing. Great outdoor seating for people watching and Kenn","useful":0,"cool":0},"RBbUPQg8mApZUFnIaL-4SA":{"text":"My cousin and I found this pearl as we were waiting for a bus tour down the street.  My go","useful":0,"cool":0},"yNl8LvhJ6QVq1m-UU0Qbsw":{"text":"Honestly the best dining experience I was able to have while visiting New Orleans. The foo","useful":2,"cool":0},"kNCJp4W4sUTRTUC8K5KYsg":{"text":"This trip to NOLA I'm making a point to review every restaurant I eat at.  I stopped into ","useful":0,"cool":0},"bolTygCdS8YvT8df_Z8CTQ":{"text":"Good food....just not great.  The service was ok, in a city that thrives on hospitality an","useful":0,"cool":0},"GKiBY_HMmMHojgP5sWwAsw":{"text":"Who would have thought lurking in the French Quarter, on the main Street of Canal would be","useful":0,"cool":0},"1Etuz95QN39EJZjquVEG8A":{"text":"One of the best meals I've had in NOLA. \nAfter days of Po' Boys, grits, fried seafood, etc","useful":0,"cool":0},"QiUN1QTZ53Tc6HTUtlea1Q":{"text":"So I went to the Saints pep rally & afterward decided to treat myself to gumbo. I ended up","useful":1,"cool":0},"L9ivDnvPjr4fOJwZsJTKIA":{"text":"Our server was Claude and was one the the best servers ever.  He was courteous, respectful","useful":0,"cool":0},"gFhhNcJAovSW-XdceDS4Mg":{"text":"The food was really good.  The service was a little slow.   I would have given it five sta","useful":0,"cool":0},"6Dfj-J4huki6cjKwbVmzmw":{"text":"Stopped here for dinner while in town visiting my daughter. We ordered the hummus trio for","useful":0,"cool":0},"rIYS1r_EUN5BJwjKdlWgTw":{"text":"Palace cafe is hands down my favorite place to eat in the city.  I have yet to have a meal","useful":1,"cool":0},"ppdPUGxdGjZqzanNcIFjFg":{"text":"The service here was top notch and the place is fancy. From the outside, the huge lit up l","useful":1,"cool":0},"IHiIhyQZQzURfECwrkJezw":{"text":"We have been here on a convention for a week and have eaten here 3 times now. The food and","useful":0,"cool":0},"GNrx4bpq17DSw_shNj63rg":{"text":"Great choice for Creole food in NOLA! A bit more upmarket than many in the Quarter, but gr","useful":0,"cool":0},"Q7j40QIlDwe10kqtBBohiw":{"text":"Unique and delicious table side prepared bananas foster! Thought the gumbo was just ok, bu","useful":0,"cool":0},"9pqaYCE_xmbHLsRwN0FvtQ":{"text":"Great spot for breakfast and brunch.  This is a rather elegant spot on Canal St that has a","useful":0,"cool":0},"BpPhNDoeIfdQLE3eti5spQ":{"text":"Ate here for lunch and dinner during a conference. The atmosphere was busy, energetic, and","useful":0,"cool":1},"fev8OhKMq2de_wopzr0wjg":{"text":"We came in the day before Christmas Eve 30 min before closing. We were looking to order th","useful":2,"cool":0},"Axx61Ub5QvPagFPju7XOLw":{"text":"Second time in New Orleans, second time at Palace Cafe. Food is excellent- crustiest bread","useful":0,"cool":0},"3YTgBWXNM1ntGUQQMABelA":{"text":"Fantastic food, southern hospitality at its finest and of course wonderful music!\nA defini","useful":0,"cool":0},"HCn2ZOuWVf0ziGHT0EaC3g":{"text":"The breakfast buffet is amazing, especially the alligator sausage. The restaurant is beaut","useful":0,"cool":0},"Pem7NUwlu9WCsdMwfS1DNA":{"text":"I had Sunday Jazz brunch here (alone) at the Duck Bar in Jan 2019 and really enjoyed my di","useful":0,"cool":0},"gxGNbG61WA2ZnB2NrHgWTg":{"text":"This is one of the treasures of New Orleans.  The food will feed your soul.  The staff are","useful":0,"cool":0},"aKXzws1keCtdH14i8GaOlw":{"text":"My friend and I were staying at the Sheraton right across the street from this place.  We ","useful":0,"cool":0},"aCgW4MvAW2LnmD5fkrIwcg":{"text":"Loved the decor and swag of this upscale joint. On a busy Main Street away from Bourbon. C","useful":5,"cool":4},"kNTnjufka5eSj4dmMIsB0Q":{"text":"Nicest staff and the best food... get the crabcake cheesecake and it'll be the best thing ","useful":0,"cool":0},"KTX6VLQDpfVZxWHSOhXGBA":{"text":"This place is a GEM ! Alittle on the pricey side but its 100% worth it. The service, the a","useful":0,"cool":0},"P1VnIhhsxW2-qoZ2dK7RdQ":{"text":"Had such a great brunch experience here we went back a second time on a recent four day tr","useful":0,"cool":0},"HhMZmJKjStV2L__TG92cjQ":{"text":"I hadn't been to Palace Cafe since my grandmother's 90th birthday party (in 1997) so I was","useful":0,"cool":0},"UlkMEOygLVvVpNkzEpzKyA":{"text":"The Palace Cafe is a should not miss when in New Orleans! The food is absolutely amazing! ","useful":0,"cool":0},"AVSpXWGAcEhuXjCl5stfGw":{"text":"Called around 5 pm for reservations at 6:30 that night (Sunday).  After much conversation ","useful":0,"cool":0},"RZugIqa1QBXjEbRPoov8CQ":{"text":"Great place to have a nice dinner. It has 2 floors for dining, got seated by the window on","useful":0,"cool":0},"b5MS0PP2ab2KaoNyl3ZQaw":{"text":"Very good lunch. I just had turtle soup and the crabmeat cheesecake. Both were very good, ","useful":0,"cool":0},"ujdJeUeZjX_a-4Ib9pdRTw":{"text":"Good food for good prices, service is good too. Overall, there is no disatisfaction here. ","useful":0,"cool":0},"EdGU0PZ6Hfe-QTO4l49NmQ":{"text":"Andouille sausage cover fish.... Enough said!\n\nIt was amazing!   I didn't even have to for","useful":0,"cool":0},"IuM1R21mWbr02ExpVHCeKA":{"text":"My favorite place to visit when I'm in New Orleans. The food is excellent. I always have t","useful":1,"cool":0},"WE97HIsfHcukFaYDkoRcdg":{"text":"I'm rather perplexed by all the 4 and 5 stars.   I'm happy people enjoy themselves when vi","useful":0,"cool":0},"QvFt9y7O7Gg7yty-Daebsg":{"text":"While attending a conference, a large groups of us, maybe 30 people, went to Palace. Cafe.","useful":0,"cool":0},"1ySQ-MuEkHQV-aIqiObAtg":{"text":"Very nice ambience and excellent wait staff but I have to agree with the previous reviews.","useful":0,"cool":0},"riT8COqdcwLJNL0sUXSsgg":{"text":"Food was great service was bad.  Not rude but ridiculously slow.  Dessert and coffee took ","useful":0,"cool":0},"sU9-PMEBNr79awSKDxg5gQ":{"text":"Arrived in NOLA starving after a long travel morning and stopped by Palace Cafe for lunch ","useful":0,"cool":0},"rt69os1nWNwym-z1OMVs_w":{"text":"Great food in a historic setting.  Service was brisk and professional.  The food was well-","useful":0,"cool":0},"JceYCl5sFgbJhoEdqbTqWg":{"text":"Poor service on the part of our server but excellent service from Gerard. As a server, if ","useful":0,"cool":0},"tSs88cDIjC9FJbZsRSVnIA":{"text":"I dont really go for the deep fried stuff so this restaurant was a real treat.  Had the gu","useful":0,"cool":0},"6k_nG3I3YWJIz7zELOnwQA":{"text":"Worst restaurant choice we chose all week. Be ready to wait 45 minutes to get over priced ","useful":0,"cool":0},"mJMRrrBXYBE6Xa_km0oB9Q":{"text":"I took 2 friends to celebrate the sale of my parents' home in New Orleans in February. It ","useful":0,"cool":0},"RtWn7Q-v-LFmpbHhYtivPw":{"text":"Took two hours for lunch which was quite annoying. I got the temperature special, and it w","useful":1,"cool":0},"CUyjK3k5Zho_V9iT5iV3pw":{"text":"I am a fan and am surprised the overall rating is as low as it is. It obviously has a very","useful":3,"cool":0},"an93EOvBR4YOadFhQCzhzQ":{"text":"This was my favorite meal during our trip. The shrimp and grits were phenomenal! The favor","useful":0,"cool":0},"FfBpnNYOUvw8QVgKmBzvsQ":{"text":"We had reservations for the Palace Cafe and were seated overlooking Canal Street, which wa","useful":0,"cool":0},"Sydrac59izEaruJ6XG2hbg":{"text":"One of the best restaurants I've tried. Service is over the top outstanding. Food is yummy","useful":0,"cool":0},"O5scMqoLBJETlq880GibYg":{"text":"30 mins to get menus, water and coffee. The got our order wrong and what they did get righ","useful":0,"cool":0},"n6fL7oJFswQuWfZYKZvlIw":{"text":"Great service and food.  I dined there 10 years ago and the quality is the same.  Amazing ","useful":0,"cool":0},"jmZSUBawDtk3xVCbukhbMA":{"text":"Good location quality food.  Unique experience with kitchen view dinning.  Bananas foster ","useful":0,"cool":0},"n4AI4oeESN1Hix34kPJsCw":{"text":"Stopped in here for Bananas Foster and we were not disappointed.   Cooked right at our tab","useful":0,"cool":0},"DgugLdD3UxikTjFuiMprzA":{"text":"I only came here for breakfast and had the buffet, but the food was great and the surround","useful":0,"cool":0},"afxwYINIVFQ1CVqtE22pYg":{"text":"Put this place on your list.  Staff treated you well, the food was awesome and I will be b","useful":0,"cool":0},"Usk1CgDHcG3ZD5KVvIWa1g":{"text":"I went for breakfast. Not a bad place. Not great, either -- it's hard to tell the quality ","useful":1,"cool":0},"d9OdHg08hmUx10lFCZcB5Q":{"text":"This is a great NOLA spot for breakfast/brunch. While every other restaurant had over an h","useful":0,"cool":0},"M2OOFq0tSi_nB8lle_Td1A":{"text":"I was very pleased with the restaurant.  The staff was kind and courteous.  More important","useful":0,"cool":0},"mVbuUhfZydAY9xUBf8gKqg":{"text":"Pleasantly surprised! Thought that a restaurant in a tourist heavy section would suck but ","useful":0,"cool":0},"Ln4N_farp0VCjzBnhraV2g":{"text":"One of my favorite places in New Orleans!  The food was amazing, the servers warm and frie","useful":0,"cool":0},"-A95sd2Or9jxOwIGSYHM7Q":{"text":"I enjoyed my meal here but, I really enjoyed the wine list. The location is huge and seems","useful":1,"cool":1},"6GIOEqNfHn2KcXoalKIJ3g":{"text":"Man, trying to get dinner at night in Louisiana is crazy! All the good restaurants have cr","useful":0,"cool":0},"xnuvsBLipnUcmU_2BCDMVw":{"text":"Bottomline:  The food was great, the service was great at the beginning and then rapidly d","useful":2,"cool":2},"J99kkq0Y7wc07xn7vqDZqw":{"text":"Very unique French onion soup! It had that New Orleans bite to it. Awesome\n\nService was al","useful":0,"cool":0},"M6u4isqs4FQY9VuOvv7Dyg":{"text":"The food merits 4 stars, but there were some things lacking from the overall experience. \n","useful":2,"cool":1},"4kZj2AH3OwU_kDa-uspt_Q":{"text":"Painfully slow lunch service today with the downside of being hassled for money by a stree","useful":0,"cool":0},"ro_kpZyPnKxMsR-3HACMvw":{"text":"Made a reservation via Open Table during Sunday jazz brunch for my first meal in NOLA. I g","useful":1,"cool":1},"EqFOfhyE8Xf28H1-j7QmPw":{"text":"The atmosphere was lovely and our servers were awesome but the food was just okay for me. ","useful":2,"cool":2},"0YV_JZW6i3nvM6SZG08Ysg":{"text":"We loved this Café! The service, the selection of food, and the setting was phenomenal! We","useful":0,"cool":0},"Nx7I95CH1cEu47MxESFJJA":{"text":"Okay you NEEEEEEEED to go to this restaurant. Surprisingly this was the best food I had in","useful":0,"cool":0},"OOTlyuMyKZfufwXMOXcjPg":{"text":"Great dessert, best  flambée banane and excellent service Top Notch . \nWill definitely be ","useful":0,"cool":0},"cXZm6ImEXiRBH2VOhEWj6w":{"text":"We got to this place just as breakfast service was finishing so that might be why the serv","useful":0,"cool":0},"eKmKoY6kly6x8ax0y4Xnow":{"text":"Foie gras app was ruined by bad prep.   Steak and shrimp (most expensive thing on the menu","useful":0,"cool":0},"lRYrLB9Trex93sJsJkTPJg":{"text":"What an amazing way to end our trip in New Orleans!\n\nMy boyfriend and I spotted this place","useful":4,"cool":1},"CI4YTUoBD562eDLQC7KwgQ":{"text":"This place was AMAZING !! From the service to the food. They should get 10 stars but five ","useful":0,"cool":0},"N9IFUfpweRms3b4SvDuW9Q":{"text":"Hands down some of the best food I have ever had!!! I am from California so we were lookin","useful":0,"cool":0},"mRnuFqTMHDJGN2plEfVkNA":{"text":"I was very excited to get the chance to experience this amazing restaurant.  I started wit","useful":0,"cool":0},"VlFQs2ABvgf1tquWLBlpjA":{"text":"They had great service and wonderful food. Very nice if you just want to sit eat and socia","useful":0,"cool":0},"SPmjniFUzCRRAyGA7H1jqg":{"text":"Came here for an early brunch.  It may be because we have had so many great meals these pa","useful":0,"cool":0},"1O5-eaX4-MRbf8uwttrthg":{"text":"I had the roasted chicken, the chicken was yummy and the potatoes were good, the wait staf","useful":0,"cool":0},"0uGe-1MFtxMB8GgjPUe_Ag":{"text":"My friends and I came here to celebrate our last night in New Orleans and what an amazing ","useful":0,"cool":0},"uzlIEzyNFuaBl6f1ePc33Q":{"text":"This was a great lunch option. You have to try the duck gumbo.  I had the seafood gumbo wh","useful":0,"cool":0},"5LP2yrTl5ff9yPU4ZGKv3g":{"text":"We had a big business dinner here. The front desk was a bit stressed that we had one extra","useful":0,"cool":0},"l-e_u46mZAerxAt0oX-h1Q":{"text":"This place was awesome !food was fantastic! it's a must try : ) Had egg plant with powdere","useful":1,"cool":0},"8JiuvAF4dI1GOLOdX4GDEg":{"text":"Horrible service and very disrespectful.  The house was rude people were mean I'm usually ","useful":0,"cool":0},"9StOFWbGFjTigfHwUPFrKw":{"text":"Spot on service, excellent beverage choices, and amazing food. The crabmeat cheesecake is ","useful":0,"cool":0},"eEyQCt8HZAYlsY_6tKFeIQ":{"text":"We made reservations and were seated early, upstairs with a beautiful view of Canal Street","useful":0,"cool":0},"hTRvd-BWJKarlJ6OyPs3sA":{"text":"I wanted so badly to give Palace Cafe 5 stars. After trying to get into the Sunday Brunch ","useful":0,"cool":0},"ZLJziKANbnRWFMg74yCQkQ":{"text":"I walked past this place was not sure if I was going to eat but decided on eating here sin","useful":2,"cool":1},"-2D3kwP98h49zdaICGohQA":{"text":"Two trips to NOLA last year and I can't believe I didn't write a review for Palace Cafe!  ","useful":1,"cool":0},"DcSGmt3XhsAewtIt5ZGZTA":{"text":"My husband and I lived in New Orleans until hurricane Katrina forced us out years ago. We ","useful":1,"cool":0},"85H-ADYQj__Go1pVe31h2w":{"text":"I've been here countless times over the years.  While the dinner/lunch usually falls short","useful":1,"cool":0},"38--C_injIgUKK1YWcU8Ww":{"text":"We made last minute reservations through Open Table for dinner over the St. Patricks weeke","useful":0,"cool":0},"RZrKS4Z84SsXvw8kEOkRKw":{"text":"Amazing food wonderful service we had no reservation on a Saturday night so we ended up si","useful":1,"cool":1},"XR-Q2Dq5hYiN-IEa4SIm2w":{"text":"The best restaurant in NOLA hands down , I'm a traveler and a food  lover , I humbly eated","useful":0,"cool":0},"dC0Olfie_A8iXWtsVq5yPA":{"text":"Extremely good food especially oyster pan roast and banana foster. Definitely worth trying","useful":0,"cool":0},"oIaDQY0uB0EAFwMoAnCwsw":{"text":"The bananas foster here is amazing! And it's made tableside for you to join in and enjoy t","useful":0,"cool":1},"qHANohCfbVpEo_7vXg7M9Q":{"text":"Delicious had the Andouille Crusted gulf fish. Deshaun our server was knowledgeable and pr","useful":0,"cool":0},"vuitPZd43oJ2A8wjpGc3eg":{"text":"Pretty decent place and atmosphere for food and drinks. My friends and I really enjoyed th","useful":1,"cool":1},"s46DP6AKQyxV5ChahIxdJw":{"text":"I have a strict personal policy never to eat twice somewhere in a town i'm vacationing at ","useful":0,"cool":0},"U2V_kpYW9EUIV3-RUmh13Q":{"text":"This restaurant ended up being my most memorable meal of the entire trip and became one of","useful":5,"cool":3},"ZHs6Qsv2DNnhZdYbF7niDw":{"text":"I have been here many times and have had exceptional experiences. So before I share my rev","useful":2,"cool":0},"brPrRkNwz-r9x3t3eEfS1Q":{"text":"Everything was stellar...\n\nService. \nCheeseburgers. \nWaffle cut chips. \nAmbience (decidedl","useful":6,"cool":5},"-d_ypcalkiPSzeJwd0U0Sg":{"text":"This was not a great experience, food was beyond salty.  Very disappointed.  Took over 1 h","useful":0,"cool":0},"Jz6BhqsQNgxLjjtpeM8Epw":{"text":"Had two visits while in NO.  We stayed at the Sheraton on Canal so this was a no-brainier.","useful":0,"cool":0},"gK7HS-TUMTFTkS9xvKntjA":{"text":"WOW is really all I can say.  I just love this place, the service and the food is always r","useful":1,"cool":0},"SF6s63Th65olTMo5mFHpMQ":{"text":"Wow wow wow! My S.O. and I spent 48 hours in N.O. and hit every restaurant our friends rec","useful":0,"cool":0},"B2H4uoR2DrcRErMi2FLX5w":{"text":"Had a great brunch. Salmon Benedict was excellent. Bananas Foster was incredible. Made tab","useful":0,"cool":0},"mDM_aTX2WTtqFcx5_2d-0Q":{"text":"Our family typically visits New Orleans at least once a year if not more.  Our past severa","useful":0,"cool":0},"iCP2PkylUAKC9hIlFIZ1tw":{"text":"Simply the best. Must have the Bananas Foster. I had the the Shrimp Tchefunct and the flav","useful":0,"cool":0},"p2yPEKVRaeFlDFCB2bGjaA":{"text":"I went to Palace Café on my very first fancy dinner date on Valentine's day :) delicious f","useful":0,"cool":0},"wHfBjTAxErWYIXYWHDxdvw":{"text":"Although I have been here before, I have not been here for dinner or WITH KIDS. I repeat..","useful":3,"cool":1},"zoYF5xB9EF7lxY-mulDaIw":{"text":"If you happen to get a seat outside on a pretty day, then I highly suggest it. It is cute ","useful":3,"cool":2},"a9PXkBSR6EkAIepmX1HB7A":{"text":"The food was good but service was lacking. Maybe it's bc we had such an amazing meal at Mr","useful":0,"cool":0},"fmtIQ4T_Jl_t77Ll6zy8dQ":{"text":"What happened? This place used to be so fun and the food was always good and the staff was","useful":0,"cool":0},"5V00AkXb74MXxKfjPKb71Q":{"text":"\"would go again with friends!\"\nReviewed December 2, 2011\nPlace was busy but had a table re","useful":0,"cool":0},"1KXrrWpfSBqpEBSHfi0Vhg":{"text":"This place was right next door to the hotel where I stayed. We were all travel weary and d","useful":0,"cool":0},"cm6aY-OyRr-r1Eh6QCX0hQ":{"text":"Nice ,quaint atmosphere  eggs Benedict  was amazing  ,and the crab cheesecake  was OMG awe","useful":0,"cool":0},"0AtMfLniTobG5UrELDpaig":{"text":"The Palace Cafe was able to easily accommodate a party of 12 people with reservations and ","useful":0,"cool":0},"yplG_KBd3WOA5ER8_JyVPQ":{"text":"Despite the mixed reviews seen here, I have had several good meals here. On past trips to ","useful":0,"cool":0},"4JAQmOVy7oNDkHqBvLx3sA":{"text":"Came to this place after a long drive from Dallas with several guys for a bachelor party. ","useful":1,"cool":0},"lke5pxVSvcevyO0AG0K0HA":{"text":"Just stopped in for the Bananas Foster and it was quite the memorable dessert - they prepa","useful":0,"cool":0},"9zWcO7_Pdrq4f2SmXTxy1g":{"text":"We stayed right across the street at the JW Marriott. We went to this place since it was c","useful":0,"cool":0},"7zeQoJRmXPskQ7aJgwXFxw":{"text":"Crab cheescake?! Holy hell! Absolute GENIUS! Service, atmosphere, FOOD...this place was am","useful":0,"cool":0},"59uS9_MStpZQo2jfygsUFw":{"text":"We stayed across the street from Palace Cafe during a recent trip, and we ate there THREE ","useful":0,"cool":0},"Yzdhj1Kd38yhHJcMhUs2TA":{"text":"Another big dinner party during the conference. Arrived on time but the table set for us w","useful":0,"cool":0},"5un2q-paggUPH5b3VoOqHg":{"text":"The frozen bananas foster cocktail. Get you one. Or two. And the Catfish Pecan is divine.","useful":0,"cool":0},"YtjL-PSAjhIasqkWAeLU9g":{"text":"We spent about 10 days eating at better restaurants in and around the French Quarter.  Our","useful":0,"cool":0},"59UJDNshQfA58-Rc6xyGjA":{"text":"My bf and I went there to celebrate his bday. I made a reservation a few days before and I","useful":0,"cool":0},"R7a6HBGIg9UX2FstW2HHSw":{"text":"It's a side-walk café, and it's lovely. Of course I was drawn to it.  \n\nWe were lucky to b","useful":4,"cool":4},"8WxEB-yJxI1Us7enfWZBgA":{"text":"Don't judge a book but it's cover. Outside looked like a fast food cafe....inside looked l","useful":1,"cool":0},"tL4ykipQdKERoVqknGM25w":{"text":"So surprised to see the ratings here! I think from the ambiance to the service - everythin","useful":0,"cool":0},"Gk7b2EiF2GVCBwqJZAXwkw":{"text":"Palace Cafe is a decent restaurant option if you are looking for a gluten free dining opti","useful":1,"cool":1},"KDWvp4tUr54HLA9Els1gKg":{"text":"Great food. I was here for work, and bar seating was pretty easy on a Saturday night.\nThe ","useful":0,"cool":0},"5fQkSztZNYHayxy1-JxVhg":{"text":"As soon as you walk in, you get the New Orleans vibe.  I started the meal with a crab chee","useful":0,"cool":0},"InXl9kP6BJpkjLcZPHihOQ":{"text":"Amazing food and excellent service! We came to the right place on our first night in New O","useful":0,"cool":0},"pVTx2qo3PVOYBiEc30Lljg":{"text":"Thrown together fast food quality the firmed catfish is big batter and very little fish in","useful":0,"cool":0},"lJj1gnN0WQwAhCgZ-L8-jQ":{"text":"Stopped in after a long flight. Was able to snag a seat at the bar upstairs without a wait","useful":0,"cool":0},"WyJ0d0Qd_LyDFdMWrT18Iw":{"text":"Unbelievable food and incredible service. The restaurant is beautiful and very clean. Our ","useful":0,"cool":0},"Q7GwucsIBmjYEgwLuHsLZQ":{"text":"Amazing service, food is a comma worthy and the drinks are perfectly mixed!! Ask for Dicki","useful":0,"cool":0},"eDlxArQNsGH0Uc2xXRk8jQ":{"text":"I came here for Turtle Soup. It wasn't that good. I guess I'm just not into eating turtles","useful":2,"cool":1},"ajMqsrtpSrSndeocZ48T3A":{"text":"Ate here the first night at NOLA. We didn't have reservations so we ate outside in the \"pa","useful":0,"cool":1},"3q8AsayXyRi7BjwV2SXhsQ":{"text":"Always amazing food and service! Kathleen & Nicole you are awesome! We'll be back! The cra","useful":0,"cool":0},"CW2IQZ6SECdDMFIhYbt0Jg":{"text":"Stopped here for the Jazz Brunch, one thing to note is that there are only three things on","useful":0,"cool":0},"drY-BjeQJeXRenQyjDG5_Q":{"text":"A nice area out on the patio to watch the goings on of Canal  St. Good for people watching","useful":0,"cool":0},"YXtHaWXUOPtWpd_k6qI7rQ":{"text":"Amazing food.  Great service fun atmosphere.  You must stop here on your adventure.  The c","useful":0,"cool":0},"lz-5mjhqLkwxt5C-BjZ06w":{"text":"12:45-1:45p on Friday 2.2.18\n\nPacked, but served immediately at the downstairs bar.  Next ","useful":8,"cool":6},"t8StH30ubbHyj5aFF87rgA":{"text":"Had dinner here over the weekend as part of my trip to Nawlins. This was not my first time","useful":1,"cool":1},"YQDFozf1WYpM6V8EpR513g":{"text":"This is probably my the most worst experience ever. Looked fancy and upscale but the servi","useful":0,"cool":0},"5kL-Po6SDOihABNIEGfFSg":{"text":"Second time at this infamous restaurant.  This time private party upstairs at the Black Du","useful":0,"cool":0},"LmZqtE-SxnzjV1hBcEDWDw":{"text":"Not very impressed after all of the hype this place received. I do not recommend the eggs ","useful":0,"cool":0},"UMkety6cY6AevybzVaLbxA":{"text":"Why would anyone serve frozen food to customers? Twice??\nWe went here for their Happy Hour","useful":0,"cool":0},"fLEIrioxfanq6WX-VTX9Vw":{"text":"The line at the Ruby Slipper was long do i came   here for breakfast. For $18 i thought th","useful":0,"cool":0},"LfTV1A2frp6ORlCI0QstkQ":{"text":"Excellent food which we expected since this is Brennan's original restaurant.  Service was","useful":0,"cool":0},"HatGKsW67FuZeVNIEYqrQg":{"text":"This was an awesome spot! My gluten-free friend had an awesome experience and Dria made it","useful":1,"cool":1},"uKH2l5PAO1TJQAB6fyJk5g":{"text":"Good competent place with friendly service and great drinks.  Food was executed well thoug","useful":0,"cool":0},"qQA8T6Ibl5_sGWTwSolKVw":{"text":"I was really excited to try this place, but all feelings of excitement dissipated at first","useful":1,"cool":2},"r2hWImPqvnL5yxjyFhFudQ":{"text":"Not bad for a tourist trap. On canal street. Nice atmosphere. Now to the meat and potatoes","useful":0,"cool":0},"SsdvhApVKseAUQAaVCsUEw":{"text":"Our service was great, we made reservations online and the hostess staff were a little les","useful":0,"cool":0},"bOG8b5v3ubw8DPIv6pi-HQ":{"text":"Of all the Brennan restaurants, this is my least favorite. The food just doesn't do it for","useful":8,"cool":7},"9E_ErRxB4JqH2M3JX3klzA":{"text":"Thank you to the Palace Cafe staff!!! You all went above and beyond to make a sisters lunc","useful":0,"cool":0},"hc8lHeXS_vlF6MufjaWsQw":{"text":"Burger was juicey and tasty.   I could have made two meals of it easily.   The fries were ","useful":2,"cool":1},"UZS2BjZAjxooF6vLBBUHfA":{"text":"Went for a holiday luncheon. Loved the bell on a ribbon we received when we came in. They ","useful":0,"cool":0},"-hCFUomKZQ0qZT7qYNiBxA":{"text":"Continuing with this trip's theme of old New Orleans touristy stuff to do...my friends wer","useful":1,"cool":0},"RwYTX5EzTD6DVegptWxWpw":{"text":"Thank you to the Palace Cafe staff!!! You all went above and beyond to make a sisters lunc","useful":0,"cool":0},"Gu0p9wYb75da77O84aDSIA":{"text":"Downtown for the weekend for a family wedding and the Palace Cafe was right around the cor","useful":1,"cool":1},"aqGsX8QRGMkLsB3MS3n1nA":{"text":"Another great restaurant if you happen to be wandering around you can usually get a table ","useful":0,"cool":0},"B1bgm2SYk40Z_bj7RH6P_Q":{"text":"Last Friday, November 16, 2018 myself along with 21 other guests were had a wonderful dini","useful":0,"cool":0},"tU5apnTfLy5ETLrJHcJcOA":{"text":"The service & drinks were good BUT the gumbo lack salt & season. To be honest every piece ","useful":0,"cool":0},"vH2KCYYAZDMF6oYgESpC7A":{"text":"Highly professional service and wonderful food. It says something about the quality you pr","useful":0,"cool":0},"NcTgmZ90P6k13Z-uIxcaWw":{"text":"This place is definitely a great place to try when you're in New Orleans, just walking dis","useful":1,"cool":0},"mb6n66V-feEx3aEyywYGqg":{"text":"This place is seafood heaven.. They have great vegetarian options as well.. Will definitel","useful":0,"cool":0},"Wwoqe98W-m_fnyS8BBc4pg":{"text":"OUTSTANDING experience!  My wife and I were visiting from West Virginia and tried the Pala","useful":0,"cool":0},"zRXvmtnIAirSGjwUzwo9fw":{"text":"We dined twice at the Palace Cafe because the service and the food were phenomenal! The co","useful":0,"cool":0},"c7v3FbpXrzBRZ6G3QHT8gg":{"text":"What a wonderful brunch! Loved the crab cake Benedict & highly recommend the cheese board ","useful":0,"cool":0},"RuHPMKZk-VdkxzBFnw9sbQ":{"text":"We stopped in here for Sunday brunch.  Reservations were at 1 pm.  We arrived about 10 min","useful":1,"cool":1},"X7tTAEWpMsnoBDGKWgig_w":{"text":"What a nice place, food was excellent and the server was even better!  Thank you Cassie Co","useful":0,"cool":0},"7QY5ubAOvs1cSLpXqtnbNg":{"text":"Fancy! It's a beautiful place. A great place to go with friends or take visitors. They als","useful":1,"cool":1},"sGKUXzBxOs2KZtUF9lb7uQ":{"text":"This is a famous sidewalk restaurant in the heart of Nola.  Get a table on the sidewalk an","useful":3,"cool":0},"mRq0yhgjqN3wUyxok4Jbrw":{"text":"I loved the building and the setting and classy, yet casual ambiance.  \nBut our service wa","useful":2,"cool":1},"HojB5duriAMryN99buWTww":{"text":"I have no complaints, only praises for this restaurant! The service was great. Food was de","useful":0,"cool":0},"KfbyNVs-T21_A8deK6kQgA":{"text":"Was in New Orleans for business and decided to have dinner at a local favorite and didn't ","useful":0,"cool":0},"RSj5fIWVv0BWAGIpjeekFQ":{"text":"Wow! We were really looking forward to eating here.  We had a reservation for 7pm and were","useful":0,"cool":0},"t1J27eL1fr3OKLZg22L5IQ":{"text":"Hosted a private event in the wine cellar. Not only does this room feel like something fro","useful":0,"cool":0},"iU_BDcAYQ_Ur8SxeH2rEPg":{"text":"The service was exceptional. However, I had high expectations for their food since multipl","useful":0,"cool":0},"O5w99BCLU35DlnaccOc--Q":{"text":"FOSTER and SEAN servers the best. Funny, friendly, knowledgeable with our food, very  pati","useful":0,"cool":0},"rJbO7cQ6D46DEPy98TOSCw":{"text":"Delicious! This place is super retro on the inside. The service is attentive and you have ","useful":0,"cool":0},"NwxNnNE6c-fqEhkW6gEMBA":{"text":"Best meal we've had so far in New Orleans! We walked up around 1 pm and were seated right ","useful":0,"cool":0},"Q8GUKUOfQ2UN-HIYnJ4h3w":{"text":"New Orleans staple with a warm southern feel. Service excellent and food divine. Our serve","useful":1,"cool":1},"mBSnQ1oBmbaGaFiyE3OT7g":{"text":"After four days and nights in New Orleans I looks back and I have to say that the Palace C","useful":0,"cool":0},"2hW9Fof3zPlmNifye-XHCQ":{"text":"Great food! Only bad thing was our server Edward. He literally barely talked to us and whe","useful":0,"cool":0},"YUn4XHmUKySoeKcDqAt1Hw":{"text":"It's been 7 years since my last visit and the food is just as delicious. Crabmeat cheeseca","useful":1,"cool":2},"72Hg0kVTuvGF3tzP6Iep8g":{"text":"Food was 7/10\nService was 5/10\nPrice was 3/10\nThe only good thing was the starter crab cak","useful":0,"cool":0},"VD5T_EvdrJwiLsnPbyKsfQ":{"text":"We went here as part of a work lunch. Admittedly, it's been a while since I had been to th","useful":0,"cool":0},"7urFk80Jc1iVdQfRWFdLKw":{"text":"Seriously not interested in customer service here. Decent food but total disregard for ser","useful":0,"cool":0},"vYHchaLYARLM7LtF0Tqu-w":{"text":"I come to New Orleans for a week every two years. It is not uncommon for me to frequent th","useful":0,"cool":0},"lpbd3e_HdViF5FOeUaHG0g":{"text":"Loved it!!!  IT WAS AMAZING!!! I really can't wait to go back here! The wait staff (Clair ","useful":0,"cool":0},"WNl1JCK2ZsKmju_Tew-IRA":{"text":"This was my first banana foster. As someone who doesn't like bananas this is an amazing de","useful":1,"cool":1},"mlUKp-5hTI123jR0-tuItg":{"text":"Love this place! I was recommended this place by a lady on my plane to NOLA. I wrote down ","useful":4,"cool":2},"KFH8Knbd6TixiKMbjPeB-A":{"text":"Palace Cafe was delicious, it felt like a retreat from some of the icky stuff we had to wa","useful":0,"cool":0},"Mwl2WevJF6dTLhZ6z5b9rA":{"text":"Ambiance is very nice, and food was great. I would highly recommend the blue crab claw bor","useful":3,"cool":0},"bkREdF1WRr6Uk9yYuRAnQA":{"text":"Amazing service and staff! I come here every time I visit NOLA! Especially when I crave th","useful":2,"cool":0},"tT-iU6EOr9MuBCR1zLZeeA":{"text":"This is a wonderful restaurant in  a perfect spot on canal street. It's large and great fo","useful":0,"cool":0},"I91H3yiCVaTdW5bJXKsuXQ":{"text":"Brennans restaurants are consistently good. They become tourist favorites because of that ","useful":0,"cool":0},"-dHx_X9BdXdU_Ep_j14prg":{"text":"TL;DR go anywhere else \n\nThis is the only place I regret going to in the entirety of my fe","useful":1,"cool":0},"iKES74hi_9vPxMLY4Z7eug":{"text":"I appreciate fine dining, creative meals, and great service. New Orleans never disappoints","useful":0,"cool":0},"VQ-KB_0VzLTV2FXvSjvbDQ":{"text":"Awesome Girls Night Out here. The mojito flights were amazing. Also, crab cheesecake yummy","useful":5,"cool":1},"bPTyUCa2CGhGeA1w75fWEQ":{"text":"I highly recommend this place for family's , the food is hot and fresh, and it delicious!!","useful":0,"cool":1},"utHQ1CkLTjNy0zPO5wpObA":{"text":"The food was ok. But the waiter was the worst. The manager was not helpful. We had 21 peop","useful":0,"cool":0},"58vHt83cfauZ66mVp2YcVQ":{"text":"I have been to Palace Cafe several times and I am a local here in New Orleans. The crabmea","useful":0,"cool":0},"9x0ePqMcezKKRedrsGatMQ":{"text":"Got here around 12PM in a Monday afternoon. We got in and told us the wait time was around","useful":1,"cool":0},"x7rPxSoQB0AIpqueScG63A":{"text":"Great food, great atmosphere and excellent service! Restaurant was recommended by a number","useful":0,"cool":0},"-_5spoahpKerfZP5VX9nIQ":{"text":"Service, food, charm this is a culinary palace.\nThe gumbo soup I had was delicious, but in","useful":2,"cool":1},"gk_MO30lnI6qP1yF7TW6Jg":{"text":"Delicious!  Catfish with pecan creole sauce, an amazing steak. Will definitely be back for","useful":0,"cool":0},"_r1SxpSRwADpEL52l6ar2w":{"text":"Well what can I say. Perfect dinner for the third time Monday night. Ross served us and he","useful":0,"cool":0},"y3XkyOaivD1TkUApIj2G4Q":{"text":"I've been working in NOLA for a couple of years and staying at the Sheraton across the str","useful":0,"cool":0},"GEM_UiGuJU7vFtAp6YE_DQ":{"text":"Well the service started out well with our waiter Walter. He was timely and welcoming. The","useful":0,"cool":0},"IXkPJpRKUju_6eQryq0uUQ":{"text":"Fantastic service from all staff! Very relational and down to earth. Limited gluten free o","useful":1,"cool":1},"ocjqJvsy9Jzeqi3zn0SkVQ":{"text":"Yum! Big fan. I ordered the burrata and tomato salad, which was absolutely delicious. I al","useful":1,"cool":0},"lLXVa8SoTOUBF8YaCl87qA":{"text":"Had dinner there tonight, on a whim, as we were walking to go to another place. Though it ","useful":1,"cool":0},"Mf2byRaHkA9GC6nM49UW_g":{"text":"BEWARE: THERE ARE MANY BAD TABLES at the Palace due to its poor layout; \nRESERVE A SPECIFI","useful":8,"cool":0},"A8qlusqeU68q1xPKDCn1mA":{"text":"Great service.  We wanted to try the bananas foster.  We heard it was good here and was a ","useful":6,"cool":2},"YrM0NIx-pejbuUynSh8-tg":{"text":"Made reservations here for weekend brunch. The food was delicious. Loved my chicken and wa","useful":0,"cool":0},"awLKK6ePMQn6icoNufkOkg":{"text":"this was one of several restaurants recommended to me by a friend. i was excited to be abl","useful":0,"cool":0},"t-E_VZl_me8BiwHdIBftaw":{"text":"This cafe had amazing food. Not only did the food come quickly  but it was perfectly cooke","useful":0,"cool":0},"mcZMtiFseHX0u4uk3RJGDw":{"text":"Nice Sunday Brunch at Palace Café. We had reservations for a party of 8 at noon; were seat","useful":9,"cool":7},"-KslF5aQEIJDuoOQbgvSrA":{"text":"Crab cheesecake is a must!  I have to have it whenever in NOLA.  Great service.   I tried ","useful":0,"cool":0},"9ejoO4qQkiZQ4IH2rgB-Tg":{"text":"The food was actually awesome. \nWe are doing a good tour so we opted in to appetizers.\n\nI ","useful":0,"cool":2},"ru4B4LM422QNS4zKWfzjsA":{"text":"Very good! \nEnjoyed our meal and the ambience here - lovely Kathleen and Alvin were fantas","useful":0,"cool":0},"EfFqmQ50fLiZ3Iu90DkuzA":{"text":"This place would have easily ranked four stars were it not for the poor service we receive","useful":1,"cool":0},"0Z_weLcmy6idaTP_x_GoUQ":{"text":"From start to finish, Palace Cafe was beyond amazing. The service was quick and efficient.","useful":0,"cool":0},"121YeHlFgtDOj6hcaqgagg":{"text":"Came in for an early dinner before a show around 4:30, which was great because a lot of ni","useful":2,"cool":1},"lCuc4_1Tc7tWKMpbb3r15Q":{"text":"Years later and I'm still thinking about this restaurant. They gave me the recipe to the C","useful":3,"cool":1},"VGmCc83oygzXSk1vSDSQQA":{"text":"This place was amazing. I made reservations for my parents anniversary, and I'm glad we di","useful":2,"cool":1},"3-tQZwKxAnTRZBQuy2M6lg":{"text":"Beautiful restaurant situated across the street from the Sheraton Hotel. I came for lunch ","useful":18,"cool":17},"U0uBDmJ3eCeWAm2jgSL9YQ":{"text":"I LOVE this restaurant!! The Bloody Mary bar with assorted vodkas, the live music, and del","useful":0,"cool":0},"zFHEwbpCxVbe1wRULO7bMw":{"text":"I have not dined off of the full menu, just in the bar upstairs (Black Duck Bar) from the ","useful":0,"cool":0},"NeXS7DYnt85vyl-hMly0rA":{"text":"Had a great lunch here with friends. Had the shrimp & grits which was good. They have a 3 ","useful":2,"cool":0},"bSW9-qDPNm6Ra2-K_md9Lw":{"text":"This place was far from a palace in that there was absolutely no service to be found.  A k","useful":0,"cool":0},"jhW8uUS1IV5_GhOBzwwIiw":{"text":"Palace Cafe was our first stop when we got to Nola. We are staying on Canal St, and this i","useful":17,"cool":16},"NtSZlx1y1oxHZd0a3Pjcag":{"text":"Surprised to be so disappointed in a place with so many stars. Super slow service, took we","useful":0,"cool":0},"4dEYvWHFM5pbXEJLxEFc1w":{"text":"5 stars and high recommendations! This is the second time I've visited Palace Cafe and I'v","useful":1,"cool":0},"UMsokNan0AUghvvuiJC77A":{"text":"YUM Brunch! \nThe brunch buffet on a random Tuesday morning was delicious and filling. The ","useful":1,"cool":1},"JIf6YH6PH22KesNAutx15w":{"text":"Meh. I went for lunch during Coolinary and ordered from the Coolinary menu. I got the gumb","useful":1,"cool":0},"u6WN6CoO1noQsJlNkDMHcg":{"text":"Classy setting.  Not your typical dumpy eatery. \nTurtle soup: excellent with a splash of s","useful":0,"cool":0},"ZSeQbybC81hXYgy_jK1bMw":{"text":"Beautifully decorated dining room. The four stars are for the great service and the banana","useful":0,"cool":0},"8skqZuZQqpQ-qxforFqA1g":{"text":"My wife and I had the opportunity to dine here last night and from the time we walked in w","useful":0,"cool":0},"OJ1lUGwCq3aF0yT_XgMMGw":{"text":"This is a very good place when you're in the mood to splurge. We enjoyed the atmosphere an","useful":3,"cool":3},"I93QWoWqcc6MPUUuKnwn7w":{"text":"We had a short time window to gran some lunch today and stepped into this restaurant. What","useful":0,"cool":0},"wzRaq4VX0K77joXQwJpNfg":{"text":"Outstanding service and food quality. And the King Cake had a baby! We had the rabbit soup","useful":0,"cool":1},"qIBtC1tSqlL2ld6K2Th8yw":{"text":"This is one of our favorite restaurants for brunch in the downtown area. We love the doity","useful":1,"cool":1},"eAQz-zIRrfXpEi2x9SmlxA":{"text":"So I liked this place a lot, I had already been here a few years back for dinner and I dec","useful":2,"cool":1},"qHAhl2I2DAwyFj7FWYH0CA":{"text":"Lisa gave the BEST service, cocktails & food on Canal street hands down. \nWe tried the coc","useful":2,"cool":0},"DPYT9g4yvKQQcE0sU6f4wg":{"text":"This is a great place to stop and people watch. You never know what you will see sitting o","useful":0,"cool":0},"QUReD8s_ABCyGJ_M_U5ruw":{"text":"The food was excellent! We ordered it to go due to COVID-19. The first time I called I was","useful":0,"cool":0},"3y20m-eGptru2MC4IiOXuA":{"text":"I have very mixed feelings about this place but I'll give it four stars because the food w","useful":1,"cool":0},"0FZkZvZqegsrUqlsMGj1EA":{"text":"We went there this past Sunday for brunch with my niece, who goes to Tulane. The atmospher","useful":0,"cool":0},"3vpDQCbE9N3znd3zACw8fA":{"text":"Service was great. Atmosphere was great. My meal was good but not worth the price I paid. ","useful":0,"cool":0},"CY7cs0kzAaZH7DwMbT-9KA":{"text":"Our party of four decided to come here for lunch. We had the most amazing meal. We started","useful":0,"cool":0},"3DdNOW2DqdETobrvOAlXVw":{"text":"Loved it! White table cloth service. Had the pecan crusted fish. Flavorful and nice portio","useful":1,"cool":0},"cfqpvLc8cQkX4FO999s2Jg":{"text":"Great food in New Orleans but this place takes the cake! Love everything about this place!","useful":1,"cool":0},"zaG5cEun5qHXc0jvpnR2pw":{"text":"Food is great.\nService is great .\n\nLittle noisy, great selection of rum. \n\nMust try the ba","useful":2,"cool":1},"caxIRGvFDtxUxio5gRaJ5w":{"text":"We were excited to eat here being it was another Brennan family restaurant. The food was e","useful":0,"cool":0},"Q5-ZlJUeQuzQ4wyZe8pPVA":{"text":"Excellent location. I was part of a large group and we were in a room on the third floor s","useful":0,"cool":0},"_0hK9x4hyOV8VoE4a4L6Rg":{"text":"Been going there since they first opened. Consistent, great quality and Brennan's service.","useful":0,"cool":0},"Tz_bByYxcHsK704Y93uCbw":{"text":"So glad this deservedly famous restaurant has re-opened, with good coronavirus protocols i","useful":1,"cool":1},"5MBq5_4-kxuQX9eLs3_RCw":{"text":"Went for lunch on a Thursday and the food was great! Our 2 waiters were awesome and Claude","useful":0,"cool":0},"QavJJxq0eiI_5VsjhdnBMw":{"text":"They don't take walk ins and when we tried, they weren't taking reservations. Maybe we sho","useful":0,"cool":0},"vRT6dGSgpHK7BLEkdYi2rw":{"text":"Always thought of it as a tourist trap but the SH Hri Mo ans grits and table side bananas ","useful":2,"cool":1},"LjwKq9hQZIbdAuulzC9eyg":{"text":"I travelled to New Orleans recently for a business trip and needed a great meal at a resta","useful":2,"cool":2},"naF2dcr_5TP6BzrqyoMDtQ":{"text":"The place is beautiful and we especially enjoyed the colorful murals depicting NOLA musici","useful":0,"cool":0},"R_YWd-BE_RFyLEeUTXa4LQ":{"text":"The food is respectably reasonable and consistent here, and the service has always been sp","useful":1,"cool":0},"E6d2aPk_U68y8oAL8E2b2A":{"text":"This place rocks! Soup to nuts everything was spectacular. Service is spot on. The food is","useful":1,"cool":0},"l3_njjp17ifmmwzAjgctMA":{"text":"Some of the best service in New Orleans. Don't forget to try the turtle soup it was amazin","useful":1,"cool":1},"WZV6T-4Iu5xA99bTXPVUJQ":{"text":"We Went in just for the World Famous  Bananas Foster.  This dish didn't disappoint! Deshon","useful":0,"cool":1},"Y1JEah1yaVwB3eAdOH8o3A":{"text":"It was the BEST place we tried during our trip. It was so awesome we went there twice!! Hi","useful":0,"cool":0},"liHWZWewCROZ12umLjYuWw":{"text":"Great lunch option but was surprised by the line at opening. Service is a bit pretentious,","useful":1,"cool":0},"EB1o7lQW2UaH3xuUkIt83Q":{"text":"The inside of the restaurant is quite stylish and filled with old-fashioned charm.  We did","useful":1,"cool":1},"bklaTpO2swv1VpBzePo8ag":{"text":"Good food, really nice place. Seafood gumbo was tasty. French bread was and is a must. Goo","useful":1,"cool":0},"pnm1rcfNENM8wj6Rlzpd2A":{"text":"We went to Palace Cafe in 2019 two times, because their bananas foster was outrageously de","useful":4,"cool":2},"vnvpGivrHjc2M3U0ZUifAA":{"text":"If you love fish, you've got to go here for the pecan catfish, OMG is was delicious, even ","useful":1,"cool":0},"LFwKV14JIruNYi2_MNB13Q":{"text":"At first I walked past this place not thinking much of it. However their happy hour caught","useful":2,"cool":1},"1x7AbJ6_36uAKtYLlhN81A":{"text":"Oh Bananas Foster.  Why do you do that thing you do?\nFlame baby flame!\n\nI love dessert.  E","useful":1,"cool":1},"xdA7wWaR34no3w0stdiV5w":{"text":"Best gumbo I've had in my life. I haven't had lots but so far this was the best. The old s","useful":1,"cool":0},"2v4bH5POqAdmdTueMKhEqw":{"text":"This is one of our local favorites. Everyone knows that the Brennan restaurants are a stap","useful":3,"cool":2},"Iqdfldv6ZTboNCHu1s0SXQ":{"text":"Local here. Wow, where do I start ... this place is AMAZING!! The food = phenomenal. The s","useful":2,"cool":0},"ge3OGzOlcEQuOqusyh7AjA":{"text":"Food was not what I expected, crabmeat cheese cake was delicious. Prices was steep and the","useful":1,"cool":1},"3HrSfV4JoeScE50lvIldyA":{"text":"Great service! Delicious food! We stopped in for dinner around 7 pm, and were seated immed","useful":1,"cool":0},"4iY_MPOZBmAHurH6b224bw":{"text":"When I was checking out Yelp trying to plan our progressive restaurant night I saw the cra","useful":4,"cool":4},"Scy-dWfVwEAFkTXdy_1q5g":{"text":"I had a selection of small dishes plus bananas foster. They were all very tasty.  I look f","useful":0,"cool":0},"z5u4U45RB64x1OFoc-p90w":{"text":"Stopped in on a Sunday morning without a reservation. They were able to squeeze us in whic","useful":0,"cool":0},"DgnAXcBhcl3kqeGKbHhf6w":{"text":"Wow this place had some amazing crab legs. What a surprise!  Definitely need to go here if","useful":0,"cool":0},"dbBSC2dSPadeLYuyE7rhYA":{"text":"My friend and I dropped in around 9:30pm (30 minutes before closing) for a late after dinn","useful":0,"cool":0},"A9wS-tvYmasetFRzGQ6HkQ":{"text":"This Palace Cafe is not what it used to be.  Dined here 11/7/19 and was disappointed beyon","useful":0,"cool":0},"noBU-w88mFyp8DwJyuK-Qg":{"text":"The Palace Cafe was a great choice. The ambiance is nice and the wait staff was very atten","useful":0,"cool":0},"87_693lx1275rgGlD8JQtA":{"text":"Went here for a quick bite to eat. The architecture inside is amazing. We sat at the bar a","useful":1,"cool":1},"qkXqpbHiv6LGiPevcfkuww":{"text":"An upscale restaurant in NoLa and well worth the hype! Came in on a Sunday night and didn'","useful":2,"cool":1},"mCxsch6Zbb59hW6WUblEEg":{"text":"This place is beautiful. The food was absolutely delicious. The crab cake cheesecake was m","useful":0,"cool":0},"t8Vtof4mHFVOwByB0zPHuQ":{"text":"Been sitting here for the past 15 minutes with no service. The man sitting outside was ver","useful":0,"cool":0},"R3DGrfKGF01kb7Xpaqi8lw":{"text":"The food here was great!  The portions were on the smaller/European side, ya feel me? But ","useful":2,"cool":0},"goGXUenbPOF6vVHJTFbplg":{"text":"The food here is excellent!!! It was savory and authentic. The weight staff made the day e","useful":0,"cool":0},"YwChxspkH0LIuSTPxruMuA":{"text":"Oh hadn't been here in over two years, and they are still knocking it out of the park. The","useful":0,"cool":0},"fXNi_kvxvRGAhoKczf_2uw":{"text":"Closed - don't go. We wanted dessert but just found a closed storefront.  Another death fr","useful":0,"cool":0},"8WvuzudK-fV0p8b74XRCLA":{"text":"My friends, who flew into New Orleans a couple of days before me came to this restaurant f","useful":4,"cool":1},"5_62045V1319301_ZyVoIw":{"text":"I had the amazing crab cheesecake I have never tried anything like that in my life and on ","useful":1,"cool":1},"AWRm8hPQlwI-DFQKjuyytg":{"text":"Met a close friend for early dinner at this iconic restaurant on world famous Canal Street","useful":6,"cool":5},"TBthvfGhZoUwG4L4EtV-AQ":{"text":"The crab cheesecake was a pleasant surprise!  It was savory and wonderful!  The service wa","useful":1,"cool":0},"zhwSi2dGPNRG74rRkdcpmw":{"text":"Great atmosphere, great food. Rumor is it's a historic building that used to house an icon","useful":2,"cool":1},"B4pQG-bLk3BB9xUX6Kl7MA":{"text":"Let's just start with how amazing the pumpkin cheesecake is.  The key is to also order the","useful":2,"cool":2},"r-c9yJWNi71JnNZor5NMfA":{"text":"I'll revisit this restaurant everytime I'm in town. The service was amazing. The food was ","useful":0,"cool":0},"JEvtI2JTaMoLdbMKfL0p8Q":{"text":"Absolutely wonderful hands down!  We were celebrating our 25th anniversary and chose this ","useful":2,"cool":0},"EykYth1kRViwk-iLNXPhKw":{"text":"My friends and I went here for their weekend jazz brunch. Beautiful and swanky ambiance. U","useful":1,"cool":1},"5YAaFLHoMk4UZbffoc964w":{"text":"Definite fan of the Palace - for several reasons.\n\nOne: you can make reservations. I appre","useful":0,"cool":0},"eh-U0T9iWTErSGjcMHBKRA":{"text":"We have eaten here several times over the years and have always been pleased. \nThis trip w","useful":1,"cool":1},"S_2YhmBFIQx7owrYperpFA":{"text":"I don't plan on returning soon to Palace Cafe ... which breaks my heart because we've had ","useful":1,"cool":0},"l3nmJBc9LcxqEEhB6hscJA":{"text":"Every single visit to the Palace is as stunning as ever. Between the pinnacle service and ","useful":0,"cool":1},"h9eIVP744_AkwkL_N507KA":{"text":"Got in pretty late on the breakfast bar on New Year's Eve.   Sausage and biscuits were gre","useful":0,"cool":0},"lxt9u_m6M37zWbNio3gUNw":{"text":"I visited New Orleans for the second time in November 2019. I intentionally chose to visit","useful":2,"cool":0},"tObcoBFaEtsi6EP9ulMP3Q":{"text":"I love this place but last nov I had the worst service but ken the manager fixed everythin","useful":0,"cool":0},"qSFdO_evYSBwswltDHezCw":{"text":"3.5 - Came here for breakfast around 9:30 am Monday, because we wanted to dine on the side","useful":3,"cool":1},"pYYS-d0Wghf-agE1OJ94hA":{"text":"I loved this place. The interior was very much colonial like with African touches but the ","useful":0,"cool":0},"r2KQBKuJJSB8E0OKCoHgOA":{"text":"Went here for the food for brunch, but left full of drinks and good times. I came with a g","useful":1,"cool":1},"jio803xW1zV6-NoJRnrLfA":{"text":"Was excited to try this place after all the reviews. What a disappointment. We ordered the","useful":0,"cool":0},"cGuJZ4awntqdmKHn9MpHLA":{"text":"We were here this past weekend for Tulane's graduation. We had a group of ten (all of us o","useful":0,"cool":0},"8ifLsGHppNvtrwYfd15LeQ":{"text":"I heard great things about The Palace and a few locals at the Mardi Gras parade recommende","useful":3,"cool":4},"9bzvvDEyBVZATgid4x-HRA":{"text":"Although I've always seen this place as more of a \"Power Lunch\" spot for the suits from th","useful":0,"cool":0},"6kxcc4MAD9NahqbgV2-63w":{"text":"#fatjared say...food was above average, bartender was average, host was FAR below average.","useful":3,"cool":0},"U6SlvoG1jTM5kPjQ9Y_qIA":{"text":"I have passed this place up several times during previous visits to NO and the French quar","useful":0,"cool":0},"b5t4WpwSrQWejIbVmvuKOQ":{"text":"We sat at the Duck Bar and Kathleen was a great server! She suggested some things for us a","useful":0,"cool":0},"OH9mlByvkMtFspTZI8KoIA":{"text":"They got rid of the BBQ Shrimp , but i still love this place.  Beautiful spot even though ","useful":3,"cool":2},"bXsmij0IW--2xth5WxpL6g":{"text":"VERY clean, amazing staff and delicious food. You can't go wrong! We ate inside last week ","useful":4,"cool":3},"0-1lHSm0AUDnd7QpFXqbwA":{"text":"The location is great.\nThe feel of this place is great. \nThe staff was so nice to me.\nBUT ","useful":0,"cool":0},"Z5yyN_bn7NDvmfFaaAePHw":{"text":"My son said they made the best burger he has ever had.  And I had some fish special (sheep","useful":1,"cool":1},"q52wgnJjABoaRLciI2t9-Q":{"text":"I was stumbling around New Orleans looking for a mid afternoon snack when I stumbled into ","useful":3,"cool":2},"C8j4R4FxTinYJDnJXoSsIg":{"text":"Nice! I would consider the food at Palace Cafe a solid four stars. I've never seen a crabm","useful":0,"cool":0},"h--llt5TEMiweZZpSLgquA":{"text":"Let's just get this out there. We came here for the table side banana foster that they hav","useful":1,"cool":3},"jxQBXd-dJ9-Na6HS9LaQuQ":{"text":"I went to this café about a year ago but I have been thinking about their amazing shrimp a","useful":0,"cool":0},"A4jKAlD3jJ81E4BHot5W-Q":{"text":"Fantastic food and service. The ribeye steak over potatoes, shimp tchefuncte, and bananas ","useful":1,"cool":1},"4yKkeC4f01A5x62BduNbwA":{"text":"Place is very pretty and location is right on canal street. Since it was summer we decided","useful":2,"cool":2},"jyD8yO9X2zSJyZdoCCC_6w":{"text":"We went in for the banana's foster. It was amazing! They make it tableside. Watch out for ","useful":0,"cool":0},"pgONvfIMPwlZm1sjNdJ2ew":{"text":"We came here for a few small bites. I really wanted to try the crabmeat cheesecake and was","useful":0,"cool":0},"9lcPpC46oGHw_hsBG1Ptzg":{"text":"This place gets four stars for ambiance alone. You feel pretty just sitting in there! I al","useful":2,"cool":0},"mKYXfTTFSer-G0k8Ps5R_A":{"text":"Amazing meal and service!! Wonderful 1st meal in NOLA!! The Andouille crusted fish and bre","useful":0,"cool":0},"pvNZmKmBDZcwMhdc8fnTRw":{"text":"Service was incredible, food was horrible. I had the Poutine Po-Boy. Lukewarm meat, stale ","useful":2,"cool":1},"NMPTWpwuNBFN1TgiuQ_hsw":{"text":"DESSERTS\n\nService in NOLA is definitely not as quick-paced as California, but we were just","useful":6,"cool":6},"SBCymzwWbCFBar9rxqA0GQ":{"text":"We had a great dinner at The Palace and both my husband and I had the \"Coolinary\" menu.  I","useful":1,"cool":1},"F365oKN_iZJ_dIqXBiTBNA":{"text":"Great food! Only bad thing was our server Edward. He literally barely talked to us and whe","useful":0,"cool":0},"g_xEjh5j-AevQuh1Ox9YlQ":{"text":"It was a little uncomfortable when we first walked in. The young ladies at the hostess des","useful":2,"cool":0},"8V4QmAH2sBvYpmBx2POldQ":{"text":"We had an anniversary brunch at the Palace a few weeks ago, the the incidence of COVID was","useful":1,"cool":0},"0ZVwhYnvzznk5EYMsqLH_g":{"text":"Stumbled across this place ahead of the dinner crowd and so glad we did! I got the shrimp ","useful":1,"cool":0},"r7q9b7ddpOuNqnw_0IaJFg":{"text":"My husband and I shared the crabmeat cheesecake, the seafood gumbo, shrimp tchefuncte, and","useful":3,"cool":2},"8D-seSXNG_mskkJuCHJFGQ":{"text":"We had lunch at the Palace Cafe while in New Orleans over the holidays and it was excellen","useful":0,"cool":0},"wi_Z_mIQCrwgTRxYYvlIUQ":{"text":"Had lunch there. Was good, but not spectacular. We have had better visits there. Servers w","useful":0,"cool":0},"OH_iRPTFR2zgM7jot72wVw":{"text":"Palace Cafe is perhaps one of the best spots in New Orleans to grab some authentic fare in","useful":20,"cool":13},"SXh1xqKOnVmpJEp19DxnJg":{"text":"Palace Cafe....where do I start.  I went into this restaurant loving what I started experi","useful":0,"cool":0},"CxgztAFyknp2xv6ZUTWSuQ":{"text":"Great decor and service, breakfast bar is a steal for $18. Eggs, alligator sausage, grits,","useful":2,"cool":0},"OIK1ENxl5YsMeMr5JQUljA":{"text":"I never thought I would try duck but I'm glad I did I was blown away on how good the flavo","useful":3,"cool":1},"CqUB6DT83T7L7PRkeg3KYA":{"text":"Hostess was EXTREMELY rude because we didn't have a reservation.  I would bit recommend th","useful":0,"cool":0},"xlw6UR3bHIUDPBtXWXME1w":{"text":"Very much regret wasting a meal here. While the food was good and the inside was pretty, t","useful":0,"cool":0},"dwCm4UdbzAr4IC5LQi0KpQ":{"text":"Space: large, 2 floors, open kitchen \n\nStaff: extremely well-trained and knowledgeable abo","useful":1,"cool":0},"Uap5vdd8qRVSiPPWriPzdw":{"text":"BEST place we have eaten in New Orleans!!  The service was outstanding and the food even b","useful":0,"cool":0},"fqElEtI0bra6clmRF5RIbA":{"text":"The crabmeat cheesecake was so innovative and I absolutely loved this dish.  I was sad tha","useful":2,"cool":2},"0on3X4iPyoIcsVwuEcqtmQ":{"text":"We ordered the eggs du hour, shrimp tchefuncte and the palace cafe burger and fries. We al","useful":0,"cool":0},"KdhHyLwXANx2rVXXAsmKlA":{"text":"We stopped in for a snack after a long day.  We had sweet potato planks and oyster/articho","useful":0,"cool":2},"lLGAEufQMVSpkB3sw_psgw":{"text":"We went here for lunch and it was great. Our server Deshon was very friendly and nice. We ","useful":1,"cool":1},"JFtQAThaVCaZkjjx7L-Xog":{"text":"Awesome food and awesome staff!! The bartender, Kathleen was so nice and gave us so many t","useful":0,"cool":0},"CDodvf3gzr458teuWIDP_g":{"text":"My date and I visited this restaurant prior to the Endymion Extravaganza  2020. We did mak","useful":0,"cool":0},"78_TJGZT_RXATBXMGX2KIw":{"text":"Nice atmosphere in the restaurant. Nice selection on the menu. The crab cheesecake sounds ","useful":0,"cool":1},"lMGaDYQJxPr1KaDYA7fpKg":{"text":"The fried oysters were amazing. I also got the burger which was also delicious. The chicke","useful":0,"cool":0},"AQphYgcy7zLZeWKCT1WRUg":{"text":"Had brunch here the other day.  It was our first visit and it won't be our last.  It was p","useful":1,"cool":0},"TWOcCn4ATd34L2cimF7xng":{"text":"It was fine.  Crab cheesesteak (a savory appetizer). Crab chops. Gulf shrimp. Pecan catfis","useful":1,"cool":1},"RZauXNtm5Fd46VnHgFkKpg":{"text":"Very good food! Hand sanitizer on every table during covid. Got the lunch special for $18,","useful":0,"cool":0},"ZQD-GC_cL8MTD4mk-j9b6g":{"text":"From beginning to the end of the meal it was a fabulous experience. The decor brings you i","useful":0,"cool":0},"EKhjquFpp14eMfXVwJkskw":{"text":"This was amazing food and the atmosphere was incredible. This was the perfect restaurant i","useful":0,"cool":0},"35vbGofnXWaxSZa0gAORGg":{"text":"I ordered turtle soup and crab meat cheesecake for dinner from here via Uber Eats. Since I","useful":3,"cool":3},"dwJgR_k5HDQtiikrnR7dJw":{"text":"Because of the pandemic, we ended up eloping in NOLA!  We had been working with Stephanie ","useful":0,"cool":0},"YS1-XCpdJltFVJnZTl57kA":{"text":"Not, in my opinion, what it was cracked up to be though in fairness I only had dessert her","useful":0,"cool":0},"Qam6zQIVHeKTep6Bax_rlg":{"text":"We stopped in here a couple of times for a break from all the walking we were doing.\n\nThe ","useful":3,"cool":0},"iDpcaKzfOg0P3MMAJ1zbwg":{"text":"My girlfriend and I always pass by Palace Cafe and always wanted to try it. Crazy how livi","useful":5,"cool":3},"0XDMTaawAWMEiOQ7JkJuEQ":{"text":"One of the best meals I've ever had. I got the andouille crusted fish and my husband got t","useful":0,"cool":0},"k--rg82cRSvzqzfVKcQguQ":{"text":"This place was absolutely amazing. I had a cup of turtle soup, some of the oyster loaf for","useful":1,"cool":1},"5xL97tBsapeqzw5cwusylg":{"text":"This is one our favorite restaurants, not just in New Orleans, but anywhere.  I love to im","useful":0,"cool":0},"QLrmDbDQEBZ-JjysSST4Fw":{"text":"Best service in New Oleans, our server Sean made our trip. High recommend you ask for Sean","useful":0,"cool":0},"pgp4KIvAFjm1cDT2huYVjA":{"text":"Filling and good to average. Part of the Brennon family business a good filling breakfast ","useful":0,"cool":0},"YfCKOHnJnYuDylFWPB3Ylw":{"text":"Keep on walking. Would not recommend this place to eat, expensive and not worth it. We sto","useful":0,"cool":0},"cM7NS1Nok42XC-zVS0b-4g":{"text":"The problem with NOLA is there are so manY great restaurants and dining experiences to be ","useful":1,"cool":1},"50nQOnGL3ydlpwHKXT2lkw":{"text":"We went here for lunch and we were seated in the bar, since there was a 20 minute wait in ","useful":1,"cool":0},"WkqTcukCn5h7cJEfk6DIFw":{"text":"We were in town on business, and came here because it was close to our hotel and had a gre","useful":1,"cool":0},"WPKED0ctxIzN6hKnUZG7kw":{"text":"This is another gem in New Orleans that I truly loved! I loved the decor and the brunch co","useful":3,"cool":0},"d0y_oJ_sO5EUMlWdkfiVyQ":{"text":"I just left the Palace Cafe and had their incredible temperature lunch.  The price is base","useful":1,"cool":0},"eQjBkkqEbYbuVwoKX9DZBw":{"text":"This is such a cute restaurant! We came here with a party of 10 for my best friends birthd","useful":0,"cool":0},"Mnj9svUXxpAnZJtm9mMO1Q":{"text":"One of my favorite restaurants in NoLa! A few blocks of a walk from our hotel sits this re","useful":1,"cool":1},"iETkKGnTeVHSaPoJLytaDg":{"text":"I was going to give it two stars for the food, but the ambiance, live music, and service w","useful":2,"cool":1},"sVtx8ECVirkiFcpEs6CTVw":{"text":"This review is for the Black Duck Bar on the second floor, not the Palace Cafe itself.\n\nGo","useful":0,"cool":0},"JqpjybEeSJg1N3O7lvTUrA":{"text":"The \"temperature\" lunch is a steal. Two courses for the price of the previous day's high t","useful":1,"cool":2},"H946Tnf43C8fGEK_qpe61Q":{"text":"Our servers were fantastic.  The food was a step up from a cafeteria.  It was luke warm wh","useful":0,"cool":0},"s9srti04qxHz728aEXj9tg":{"text":"Wow gumbo is the best ever, not too spicy not too large, BTW best Caesar tasted - utter pe","useful":1,"cool":0},"1_rJgvUVlHFNscs8FmnlxQ":{"text":"Amazing food, amazing service. We had a wonderful meal-everything was delicious. The white","useful":0,"cool":0},"P3sY7BlPhiUv5fiRLzU2pA":{"text":"The service is great, the food is not as spicy as we expected. However the servers will do","useful":0,"cool":0},"f771AVPGicAjU9XyMd8OGQ":{"text":"Went during Essence Fest in July. Food was excellent and service was even better! I had th","useful":2,"cool":1},"9wh98za3ceGrzjhzgpIP1A":{"text":"We just ate lunch, but still had to stop by Palace Cafe just to get their crabmeat cheesec","useful":30,"cool":28},"2t023BLbDIEjRjkiilh96w":{"text":"Wonderful dinner for a special night or just great dinner. Right at heart of downtown on e","useful":2,"cool":0},"kRO-Inzgo6OdW_e_Mj6K3Q":{"text":"I'm so sad. I've been coming here since I was like 10 years old with my mom. I'm 21 now an","useful":4,"cool":0},"YQWb2UxmUcKiptv9jMtE8w":{"text":"Day after Mardi Gras there isn't much that can pull me out of bed..except for the promise ","useful":3,"cool":2},"Z1kuXOb3Tfhr3L92dhR1Cg":{"text":"There is a reason why this place is a landmark. It is a tourist trap where locals also go ","useful":1,"cool":1},"eOvR4poAkLkW4Jv-bM4vkw":{"text":"Somewhat upscale restaurant on Canal St.  You can watch everything going on in the kitchen","useful":0,"cool":0},"mxHKIO387u7-PBBAgge3YQ":{"text":"Everything we had was fabulous. I recommend the crab cheesecake it's one of their signatur","useful":2,"cool":1},"e_S4TafwnHbE1z8zfSBFIA":{"text":"Dining with some co-workers and vendor partners, I didn't pick this one -- can you believe","useful":24,"cool":16},"u0fBoOC-brpyDCRmCsJPdg":{"text":"I'm surprised to say I was just lukewarm about my meal here. \n\nThe turtle soup drizzled wi","useful":1,"cool":0},"upJtiJx1CI3bEecGL1uPOQ":{"text":"Palace cafe wasn't originally on our list for places to stop at but we pasted the restaura","useful":2,"cool":2},"2_V5za-LvFqkfpy1A49-0g":{"text":"This wonderful place was in walking distance from where we were staying. Popped in for din","useful":0,"cool":0},"_YBQnmY7kL2CrUNtMM4zWA":{"text":"The Palace Cafe ranks in my top 2 dining experiences in NOLA. We sat in the bar area upsta","useful":3,"cool":0},"6Dfb_L51jQZWueA9mK_4Ug":{"text":"I absolutely loved this place! I came with two of my gal pals for brunch, and I had the ba","useful":2,"cool":1},"jIOUDZzMBKkpivEa6aRSAA":{"text":"I have eaten here several times over the years.  I came today for lunch, and I must confes","useful":1,"cool":0},"f00FZZXNVigDbBigaHCT-Q":{"text":"First meal of the week. \n\nI may have walked in around 11 because the first thing I was tol","useful":2,"cool":1},"zzKfCYJVJyMP32c6UfYRUQ":{"text":"1579th person to review Palace Cafe on Canal in New Orleans, La. My 474th review on Yelp. ","useful":27,"cool":18},"-iCts9LuQ0vNXq6xB39ucA":{"text":"This was the last meal I had before leaving New Orleans, and it was by far the best. We ma","useful":14,"cool":16},"mHTb1ONJiFRRtfBOp1D0Ow":{"text":"Went to this restaurant for our Anniversary.  We were late getting to restaurant, but they","useful":0,"cool":0},"p2c7pK36_4gdp-GrvAYsdA":{"text":"Got this recommendation from one of the local artists that run a gallery here and it did n","useful":2,"cool":1},"jcxybBAAKPjNPb-rtbKnVg":{"text":"This is one of my favorite restaurants in NOLA   Saturday the 24th was one of the worst ex","useful":0,"cool":0},"u04Q8BM6GOAzL6pWYG44rQ":{"text":"Y'all know I'm pretty bias to Brennan's establishments but this iconic Canal street eatery","useful":0,"cool":0},"4JNhfmlQ6U44eqWkwu24yw":{"text":"Let me start by saying, I don't totally judge restaurants by dinner parties because it's j","useful":0,"cool":0},"SYJsxNepJz4jmabaHn_l-Q":{"text":"What a meal! I have visited Nola many times and this was my first time going to Palace Caf","useful":0,"cool":0},"MDt36Dv2DWqtRJUpO-kqLw":{"text":"This place is so cute! It gives me super bourgeois vibes. They have jazz music playing in ","useful":3,"cool":2},"nYAPRH4smwA1ygO-dQgWkA":{"text":"Make a reservation unless you want to sit at a high top. The food was fantastic and servic","useful":0,"cool":0},"Wiy2zYHogDPwPqJLzToDcA":{"text":"Came here solely for the bananas foster  $10 and the three of us shared it \n\nIt was amazin","useful":1,"cool":1},"IpAspDS0O7I7-2jWysdxag":{"text":"True creole dining, y'all, especially the gumbo, and don't miss Bananas Foster, prepared a","useful":0,"cool":0},"8rmisrWu-Sl72NzFK6kcPg":{"text":"You would never think the place is as big as it is just looking from the outside. Great lo","useful":13,"cool":13},"to84dWxpRuocCIw9uj5G0A":{"text":"Great food and excellent customer service! Hands down Nigel is a winner! He was very helpf","useful":0,"cool":0},"j8esdg8oiOCbbYYq-lyt5g":{"text":"Seafood gumbo was spot on, catfish with andouille breading had a beautiful crisp and a ver","useful":2,"cool":0},"xdG-4uJxws4XYZanZX8AAQ":{"text":"I recently went to New Orleans with a group of family and friends to celebrate my husband ","useful":2,"cool":1},"aWEawZsChbwT7gebAXUKuw":{"text":"WORST SERVICE IN YEARS ANYWHERE\n(and we are\n1. business attired \n2. locals with \n3. reserv","useful":10,"cool":2},"g3sLD-J0XWsVpqvEj8jgKg":{"text":"This review is for two different experiences I've had here. The first experience was downs","useful":3,"cool":1},"RcSpEol-CoDyW-PoMDEiCg":{"text":"We came here because my husband had been here previously and hasn't stopped talking about ","useful":1,"cool":0},"vNhzlhDOzUBoilLzpgU3Mw":{"text":"Fantastic! Visited during phase 2 of reopening. All staff were wearing masks, all guests w","useful":0,"cool":0},"j-4HQESu7HSnA4k75DLSlw":{"text":"FLIPPING AMAZING!!!!!!! Jade is wonderful. The best server we have had this whole trip!","useful":0,"cool":0},"Jjw-TUCc07AhyX3pnWtAiw":{"text":"Such a delicious place for happy hour! Great drinks and food :) I had the Dome Daiquiri wh","useful":0,"cool":0},"GQjNckkXMxxFpD0uvsTKHg":{"text":"We ate here during the Coolinary fest - despite Covid slowly the majority of everything do","useful":1,"cool":0},"d-Hq0nqmXm-xP4vqkALXTA":{"text":"So amazing ! Food is to die for ! It's Mardi Gras , and we were able to get a spot at the ","useful":2,"cool":1},"tEzgWGXGoZtClE7AcLMxqw":{"text":"It's been a while since I've been able to come to Palace Cafe so while I was off over the ","useful":9,"cool":6},"rrBx5cw_6_-vUbM-wi3UMA":{"text":"Went for dinner based on a recommendation, food was great especially for my friends who do","useful":1,"cool":0},"o6G6mOSOppJ1L_h7k6hXuw":{"text":"First meal we had in NOLA and as we wrap up the trip- the best. The crabmeat cheesecake is","useful":1,"cool":1},"Rc9T8V4EIzEkpvzgJeKfuA":{"text":"Get the crabmeat cheesecake. Service is great, food is great. I come here every time I com","useful":0,"cool":0},"FXST4UOrcbtX19ACAWo1vg":{"text":"This place has amazing food! We had the scallops and I died and went to heaven. Great wine","useful":1,"cool":0},"ablujnnN8njLaOeMfmVQKg":{"text":"We were welcomed off the street after a long day at the swamp. The waitstaff were so frien","useful":0,"cool":0},"y8vExUmxA582TCxk69tJvA":{"text":"We had dinner at the Bourbon House & they recommended Palace Cafe for lunch as they are th","useful":0,"cool":0},"pfrQGLzU5NHsWicjsb85pg":{"text":"One of my favorite places to stop in. Love the build,  love the ambiance,  love the food. ","useful":2,"cool":3},"r-AeA2mGqs8jtpnHMabCFQ":{"text":"Happy hour at the bar was great. Oyster Artichoke Dip was delicious. Appetizers were excel","useful":0,"cool":0},"AV-xAUeMrFAcDB8MZ2VuzQ":{"text":"Came here just for dessert. Had the banana foster table side. By far favorite dessert in N","useful":0,"cool":0},"cRIZqy7ZcTT8bG3hkQYZDA":{"text":"Dev and Cassie were amazing! Super fast brunch service! I had the best chicken and sausage","useful":0,"cool":0},"HRJW1pTBAYtU4Rs7KtrfQw":{"text":"Delectable! I got a burger and it hit home! It honestly tasted like some good old fashion ","useful":2,"cool":2},"H5_GD8DcoSPi42Mg8pv8BQ":{"text":"Came to this spot after it was recommended to me by a friend. The crabmeat cheesecake and ","useful":1,"cool":0},"GNBJ-3pByOkCkKCLlRWaSQ":{"text":"My husband and I are visiting from Fort Lauderdale for the Southern decadence stopped grea","useful":2,"cool":2},"8OPi5LYRe1m3Qxr1XFQ2rQ":{"text":"Love this place! Food is great and so are the drinks. Was seated quickly and had prompt se","useful":1,"cool":0},"K6rvKgxVdA6nOeGztF77zg":{"text":"We had snacks and drinks here we sat outside and people watched like in Paris... fun.... f","useful":0,"cool":0},"mm7CXPIeUP_xg-CMyAVbwA":{"text":"Exultant place for a company Christmas party. Staff was great. Food was fantastic.  The tu","useful":1,"cool":0},"KgT5xnBxeMojSdnfsxWlxQ":{"text":"I'm a true fan of Palace Café, as I've never had a bad meal here, and the menu is varied e","useful":3,"cool":2},"SHWhwuhtZ0bNAvpu4mds-w":{"text":"I had a salad and the gumbo. Both were extremely salty and small portions. Not worth the m","useful":0,"cool":0},"53LpQkE7sVCcgDuGqTT6jQ":{"text":"Nice. I went upstairs to the bar. The bar tender was nice, and even took the time to recom","useful":1,"cool":0},"pEW_4ybNWEpz1_57qRakBw":{"text":"I was hesitant to come here because the reviews were very hit or miss. It was recommended ","useful":5,"cool":1},"lmRvMQUTpWSCpSftx9LwPA":{"text":"Another pre-planned stop for our most recent NOLA trip due to a glowing review by a truste","useful":9,"cool":7},"B06y9KbpwFov9A1b21k-AQ":{"text":"Palace Cafe is the perfect blend of old school traditions in a casual, vibrant atmosphere.","useful":2,"cool":2},"C-DSHhoeEjUfumb9vNGWgg":{"text":"One of the best places to get brunch in New Orleans, no contest. Drinks were fabulous, the","useful":1,"cool":0},"yH19a8-JH7de4o0sRoa4xA":{"text":"This review is long over due.  I have come here several times on numerous visits to New Or","useful":2,"cool":1},"HLY3pSsUGx8aTiQb8MDvuw":{"text":"One of New Orleans classic restaurants with a family friendly jazz brunch. This contempora","useful":2,"cool":1},"qfNJyjz9Eu_db_nm4e5-GA":{"text":"This was a great place to get brunch in the French Quarter and easy to walk to from the ne","useful":1,"cool":1},"BAZfULwpPb5zevztWOHpdg":{"text":"I got it to go and it was still really good. I got the chicken breads with gnocchi. There ","useful":1,"cool":1},"95hxuR1j9DZm4JeWG8Edbw":{"text":"Dropped in for breakfast and they were kind enough to offer us the breakfast menu despite ","useful":3,"cool":1},"jPRI-HuFCX5Fq3B32QuSUA":{"text":"Great food and drink, amazing ambiance, excellent service. We returned multiple times on o","useful":1,"cool":1},"W7r8NTrLewm0LDV1_wmP4A":{"text":"I was SO disappointed in this restaurant. We originally chose it for their small, private,","useful":1,"cool":0},"n1SyUeIDNcxzj5NtWlhwvg":{"text":"A group of us ate here prior to going on the \"Ultimate Swamp Tour\". I had a granola, fruit","useful":3,"cool":2},"d4Wyy19GgM_N6pEAJVKRmg":{"text":"I'm a native New Orleanian and have been here many times over the past 15 years or so and ","useful":1,"cool":0},"TniCfodmpDzuFOdoeR8XqA":{"text":"There are certain things that one must do when one visits New Orleans, and one of those th","useful":3,"cool":2},"m59zBkqZlIA5LwRktysf5g":{"text":"I wanted to like this place, but I just can't.\n\nI ordered a cocktail, two appetizers, and ","useful":1,"cool":1},"mRzIm1N3eOqLNTsMXFlbFQ":{"text":"I absolutely love this place! We've been twice now and have throughly enjoyed both experie","useful":1,"cool":2},"FNr4-J4Ui2wek5LR8gihzg":{"text":"Our palace experience was nothing short of amazing. I wish I remembered our waitress' name","useful":2,"cool":2},"gU3t-YGeZqeA1fPrXJII9w":{"text":"First stop in town in New Orleans and we had ourselves a treat! Although we did come in at","useful":2,"cool":1},"4lAp7RYwTkAy_RNHEZQO7g":{"text":"On Saturday, had my third (and final) experience at the Palace Cafe and all I can say is D","useful":6,"cool":1},"tCkAQpB3BGByDZAiG_80MQ":{"text":"The food here is absolutely delicious; but be careful planning an event here as the sales ","useful":0,"cool":0},"i-gcYpxHhRnj8CfgngO6cg":{"text":"We came at 5pm and got seated at a table by the window, the view is nice, ww can see the s","useful":1,"cool":1},"aGGBf0KDTphskoJbgQFPng":{"text":"Sunday lunch / dinner before the concert \nWe loved the service and food. Our Server, Juan ","useful":2,"cool":1},"CNMYOcSsbK8eOTAcUsmdsw":{"text":"We went for lunch during Mardi Gras. This place is elegant and huge. There is a grand stai","useful":2,"cool":0},"mvJCiEpOn9o7QCJcswA_uw":{"text":"Crab claw bordelaise: had this dish over 5yrs ago and our first stop once we got in town w","useful":0,"cool":1},"d-D_EwtIAhLhOiP0iAo7vQ":{"text":"Lounge area upstairs is a must see. Came in for a quick drink and bite. This place gives v","useful":2,"cool":2},"O7t51xc54Flx1pLgFVFLvw":{"text":"Went in here a couple times for lunch and appetizer type eating. The food is really good a","useful":0,"cool":0},"UlL48fkzTGQvg312YAAbsw":{"text":"Bartender Chad was amazing. He knew our needs before we could even ask. \n\nOnly negative wa","useful":5,"cool":3},"FhMiTR2AZUL6RZHqFHvidQ":{"text":"If you're a New Orleans \"institution,\" hire a staff that falls in line with what you're at","useful":1,"cool":0},"OM-hYyvfjIIkL_OQD4ua8Q":{"text":"Palace Cafe' looks like it should be awful - it's this giant garish building in the heart ","useful":2,"cool":1},"fxNZ3alHRKYnRvPCwgbDfg":{"text":"I came here for breakfast, and it is honestly a very forgettable meal. I remember my frien","useful":1,"cool":1},"2VY1n5dxzLNNnQAjnoRu7Q":{"text":"If you don't want too much butter in your dinner dish while enjoying the local cuisine in ","useful":2,"cool":1},"-mHrV3jOf_fwYEYYAk_pFA":{"text":"I was greeted as soon as I walked in during a busy lunch service and seated quickly in the","useful":0,"cool":0},"FETkHVnlgel7hoLgXA2ujg":{"text":"Had a lovely dinner here with my boyfriend while visiting NOLA. Our waiter, Jackson, was t","useful":2,"cool":0},"MhNSgUHRL-L4-el2g3ujDQ":{"text":"This place always has a lively crowd and kind of feels like somewhere in NYC, which is coo","useful":3,"cool":1},"kP5xweHSoDfxfvG0Ch3AYQ":{"text":"Yay! Celebrating my 100th review.\n\nOk I truly love this place based on one dish: the creme","useful":4,"cool":1},"nOnyBjNwchpOoq9f9m2aXg":{"text":"I must say that even durning these trying times, the service and food was AMAZING!! Juan w","useful":4,"cool":2},"M0owMlmt7hbGC0NJgMOJFw":{"text":"I had my 1st lunch here on Friday for my godson's graduation lunch. It was really good. We","useful":1,"cool":1},"GFmr74X5b67PQUbbAavpBQ":{"text":"I can't believe I've been to greasy spoons in so called disreputable NOLA neighborhoods an","useful":1,"cool":0},"0MyRHE3r70SsRbyZ8CwUdA":{"text":"Ordered: crab claws, crab cheesecake, turtle soup??\n\nCame here for my bachelorette weekend","useful":2,"cool":0},"T_fFWvZLZbKal2PrLo0EAQ":{"text":"My date and I visited this restaurant prior to the Endymion Extravaganza  2020. We did mak","useful":1,"cool":2},"-eI3DJkXa_LKiJaFlQ_5jQ":{"text":"Two of my favorite things in New Orleans are the food and the music. Put them together and","useful":4,"cool":6},"WSHugJ12PSTrz9fjftN4vw":{"text":"Fine. \n\nYou're paying for proximity to Canal Street. There are just soooo many options in ","useful":0,"cool":0},"8oSKdO9Wm-5mzU4Wez5sCw":{"text":"It's worth getting a reservation to enjoy the savior of this food. Amazing service great w","useful":1,"cool":0},"x-SEzWTdl9-EPmiZusBF6w":{"text":"Overall: excellent food, highly recommended - Don't wait... just go!\n\nFood Quality: 9/10\nF","useful":1,"cool":1},"KvwvMaIHxZp5fcgV_bHx8g":{"text":"For reasonably priced solid New Orleans cuisine downtown, this is one of your best bets. Y","useful":3,"cool":3}}