{"osSnASPK2VzXBI3vH5Qkhw":{"text":"This brightly lit and newly renovated building takes the former Copeland's and revives and","useful":6,"cool":2},"yBNJIIdVel7LHEGJjqh2pA":{"text":"Very attentive servers and food was delicious.  A bit noisy but very fun.  We ate there tw","useful":0,"cool":0},"0pj1_7FdNkRj1UfAvChQ6Q":{"text":"Easily one of my favorite restaurants. I came here for the first time in the fall and have","useful":0,"cool":0},"aYTN3JiT57xuhtNT36q64g":{"text":"Finally made it to Superior and we are kicking ourselves for not having made it out sooner","useful":0,"cool":0},"mZQXR7Ybk7_iM7lPjOAoeQ":{"text":"Wow, SS&O  oysters on-the-half-shell are off the hook!  belly up to their oyster bar and e","useful":0,"cool":0},"ZgLhn0tyOICI6O-DU4v8Xw":{"text":"Beet salad appetizer was not very good. Drinks were great and entree was decent. As soon a","useful":0,"cool":0},"jTSEFn5fuSTGFEsWXaLC6g":{"text":"Two words- Frozen Rosé! I'm not a big fan of champagne as it usually gives me a headache b","useful":1,"cool":1},"hBryroACdLjJ0JQc_dm5Ow":{"text":"Waitress, Alena was so sweet. She was on her toes and had plenty of recommendations. This ","useful":1,"cool":0},"2NNjZfw_GxzcD0pknvAFDA":{"text":"Just went there for dinner to enjoy the Super Bowl game with what I had planned to be good","useful":0,"cool":0},"O0OLuFKbB5DquvgiTxyysw":{"text":"They really lacked on  vegetarian options. We met a friend here for happy hour. Didn't lov","useful":0,"cool":0},"PI3cuCEy72pHBfjYYIbKLg":{"text":"Oysters anyway you like em, fresh crawfish! Great to watch sports and eat at the bar","useful":1,"cool":0},"DJMtjDjoOcPKq32xs4L7uw":{"text":"Our waiter was Colby and he did a fabulous job of helping us with suggestions. The atmosph","useful":0,"cool":0},"fkuTDoHBBkDAPbN4TfOCcA":{"text":"The service was poor and the gumbo tasted burnt and the chicken tenders for my grandson we","useful":0,"cool":0},"U-0aO6aSoX54Znb92kSWBg":{"text":"One of my favorite restaurants in the area. The service is incredible, I have been 4 times","useful":0,"cool":0},"PWyzMzLh3u2NwJQXT27Azw":{"text":"It was very nice inside. Very upscale feel. They have happy hour drinks and oysters. Food ","useful":0,"cool":0},"W2KmTDwbDBlCb1r5u8Olew":{"text":"Started with a dozen oysters on the half shell for $15.  They were really delicious, sweet","useful":0,"cool":0},"zOlmYCwRzaLfH-cccBCRYA":{"text":"Only been here 10 minutes and already a bad experience. Brought my family and some out-of-","useful":0,"cool":0},"URHhXkVAvqmTM2pLfgs8BQ":{"text":"Went there for a Sunday dinner with the family. We made reservations and was seated accord","useful":0,"cool":0},"xXcg7-PomuAalM-JSI03fg":{"text":"We visited Superior Seafood on 07/16/2016. A-M-A-Z-I-N-G for lack of a better term. This w","useful":0,"cool":0},"tFqrBVVBP7vd56JJ16Bz7g":{"text":"I would return here. Ok, so you're in New Orleans, and maybe superior isn't the most origi","useful":2,"cool":1},"Nfrbg8ACsZVLWDEECfmXIw":{"text":"Nice and pleasant setting outside. Food was uneven and the service was very slow.  I had a","useful":0,"cool":0},"9pHYjZeyCLtDBV-7ku_SIw":{"text":"Disappointed!!!!! Almost $100.00 for 3. I don't mind paying good money for GOOD food but c","useful":0,"cool":0},"L6Vgq0tTkGafunPJK-vDuw":{"text":"Our family had brunch here on Sunday morning of the All-Star game.  It was exceptionally b","useful":0,"cool":0},"sFzKwMpdKMjft1FjqTTTbg":{"text":"It's okay, but wouldn't go out of my way to eat here as there are plenty of places equal t","useful":0,"cool":0},"fmPqFVY0MBlYdUDjf8hTWw":{"text":"The food was delicious and portions were great. I'd never had fried green tomatoes til thi","useful":0,"cool":0},"Ts83TTGWp8LBsLRd79-etw":{"text":"This place straight up has really good food and I'm not talking about only their seafood b","useful":0,"cool":0},"VyluYp2Y6vkFsYUec6kksg":{"text":"Nice location and ambiance. My server was really attentive. The chargrilled oysters didn't","useful":0,"cool":0},"iwyKu_L9M3DTCNaTwEtUeQ":{"text":"This review is for the happy hour only, and then specifically the oyster happy hour. As fa","useful":1,"cool":0},"WpbSqNHHUN8m-XJyV-0DpQ":{"text":"Looks will only get you so far. I'd rather date someone with personality and it decent-loo","useful":3,"cool":0},"SAsjyT5X1VmrlUGUiQZe5g":{"text":"Streetcar stops in front of it.:) which is very convenient \n\nHigh end restaurant. Good ser","useful":0,"cool":0},"02VSLnyg1Qr3hf8y5B7q-g":{"text":"Great creole seafood in the Garden District.  We had grilled oysters, a shrimp Po-Boy and ","useful":0,"cool":0},"GxaT52LWHbo1TOwjXwoOxw":{"text":"I have heard a lot about this place and I was finally able to visit. I will say that I was","useful":0,"cool":0},"b_uuVvBOHoBJjlxUlg6gdA":{"text":"Simply amazing.  The food was delicious. (Oysters) drinks on point.  most importantly our ","useful":1,"cool":0},"0Vf2Kj3cxWVM3LLW7H4upg":{"text":"We came in for dinner after struggling to agree on something for dinner. After looking on ","useful":1,"cool":0},"BytvF2uYMFLOdTLyoZKNgw":{"text":"Really good food. I arrived like an hour before close in the middle of the week. But every","useful":0,"cool":0},"oleq8t2udQIBWNP4-o5Hlw":{"text":"Great happy hour!  The chargrilled oysters were pretty good and so was the blackened catfi","useful":0,"cool":0},"aCfFkUep6NsybARVFftlOg":{"text":"The restaurant is beautiful.Superior Seafood & Oyster Bar is our go to restaurant in our n","useful":0,"cool":0},"xC1BLBeo-T4IsVUzc8ST9w":{"text":"Superior Seafood is the quintessential New Orleans seafood experience. An upscale yet casu","useful":0,"cool":0},"Y2yhsjBxA26Lgz0SpvCeVA":{"text":"Great Atmosphere/ Great Service.\n-Catfish Napoleon - SUPER GOOD!\n-Sazerac - solid\n-Bread P","useful":0,"cool":0},"aqmPF5q6HBfgOOKcXWtMzA":{"text":"Superior Seafood & Oyster Bar\n4338 St Charles Ave, New Orleans, LA 70115\nhttp://goo.gl/map","useful":1,"cool":1},"U8nnDAeH_ZRJ7PjYyILQrQ":{"text":"The design of this place reminds me very much of another restaurant in the Quarter but muc","useful":5,"cool":1},"sDKlsCMUqKKShy732wWw0g":{"text":"Always eat there when I'm in NOLA!   the frozen mimosas!  The scallops and pesto shrimp ri","useful":0,"cool":0},"TcfE9suY5Ff4E8tRvwcdcg":{"text":"Second time dining here was for lunch.  They have a drink special menu during lunch hours.","useful":2,"cool":0},"F30U8TqK_BgO79LcST847Q":{"text":"Came to dinner on a Wednesday night here kicking off a weekend with friends in New Orleans","useful":0,"cool":0},"kGvkugyBPnLgr2f5p9lhTw":{"text":"The shrimp and grits are savory with a cheesy taste. The oysters are fresh. Service was ex","useful":0,"cool":0},"lr4LvCvqe2r9Cyn1nRTkOQ":{"text":"This place came recommended to us by a former employee and we are so glad we went. Their f","useful":0,"cool":0},"PEbTcxwOoaUuN8lXZk9KWA":{"text":"When you see the menu and you can order a carafe of white wine for just $18, that makes yo","useful":1,"cool":0},"5OMboui4XvkZqaRAaCBIFA":{"text":"I am going to keep this simple, this place is amazing. The food, the service, everything. ","useful":0,"cool":0},"Ia5ajQJYLZd5gPJlloj73g":{"text":"Made a reservation for 20, when we arrived they only were able to accommodate 13 of us. Th","useful":0,"cool":0},"qSkJtsXQMrxM3XxO5SDoqw":{"text":"We had our rehearsal dinner at superior seafood and the private party area was very nice! ","useful":0,"cool":0},"agZ2dwSDnvXwCQaTeNtGnA":{"text":"Excellent food and service....not sure why there are only 4 stars. Bloody Mary's..yummy. s","useful":0,"cool":0},"PhCPwVTjW-npzFnxDZB59g":{"text":"Excellent happy hour to start an evening!  We accidentally went to Superior Grill, but fig","useful":0,"cool":0},"zk5x4d2JW1XIlPd6TmL42w":{"text":"Went with a group of 12 people. The restaurant  was appropriately staffed for the occasion","useful":0,"cool":0},"NnJH_sBAVGzsIb7YowC9rQ":{"text":"Excellent food and service. I'm from NOLA and my expectations about the taste of food go b","useful":1,"cool":1},"6UhIOwt6Rz0O57834_qtUQ":{"text":"Great location! Valet parking was wonderful for this area.  The most amazing frozen mojito","useful":0,"cool":0},"gvp6OkvFiSrM88CgHjJqfA":{"text":"So we were in town on vacation and choose this place because our daughter cannot eat glute","useful":1,"cool":0},"ann6Sy8cVvopO3fCstJXLQ":{"text":"Sunday brunch in New Orleans is a bit of an ordeal, to put it lightly.  Most of the more w","useful":1,"cool":2},"BUkqpD6vps6sY1IyvA60bw":{"text":"Went here for my friends birthday and they were very accommodating for a big group! I'm no","useful":0,"cool":0},"NeQR0CFWdobBxaHs43cBnA":{"text":"Never spent so much money on a meal but most of it was worth it .way too much bread for th","useful":1,"cool":0},"FHunzOwoyhsol2PljcdI7A":{"text":"We were on a street car just looking at the beautiful architecture when someone called out","useful":2,"cool":1},"S91r4iTl0ui2HyVOiT3iRw":{"text":"Great food, atmosphere and prices! Pear Salad and Grilled Salmon with veggies. Both excell","useful":0,"cool":0},"Dp69jFmgQIVARXbha7qVrw":{"text":"Visited 10/25/16 for dinner \nThis was a quick dinner because we had some fried chicken at ","useful":3,"cool":2},"Sh8x9QEwPpz2-sllh-G0cQ":{"text":"I've been to this place countless times over the years. Consistently great food and servic","useful":2,"cool":3},"whYkzZ7lKHvqCzRwIlbzow":{"text":"This is my second time here, and as a vegetarian they have been super accommodating and th","useful":0,"cool":0},"JxFRGRCbjEclpL9TbN_nVg":{"text":"The oyster here is so fresh and delicious. I will be comming every time I back to NOLA!","useful":2,"cool":1},"uWpwePms0zDx3MeJEFeTUA":{"text":"My fiancée and I stumbled upon Superior Seafood a few weeks ago. We had planned to grab lu","useful":0,"cool":0},"EvN8lSoH95mBWCX0kV048A":{"text":"This place is incredible. Service is impeccable. The char-broiled oysters are out of this ","useful":0,"cool":0},"aOEJPop2UGzokLPMnbZ0gQ":{"text":"The biggest, freshest most delicious oysters we've had here in New Orleans. We've been on ","useful":1,"cool":1},"lLWhmmcSTFI09fT2gNgxMw":{"text":"I love this place , fantastic food and great service. Everything you would want in a dinin","useful":0,"cool":0},"w_tPJr7xQ3FUw7DlOLC1fQ":{"text":"My wife and I could not wait until Superior Seafood finally opened. We dine out 5 times pe","useful":5,"cool":1},"9ez7KOXkZWDYu-94fJMOaA":{"text":"Great Spot. Enjoyed every last morsel. My friend ordered the Shrimp, which was stuffed wit","useful":0,"cool":0},"TrTqEkakJxYxOIwX3kLIvw":{"text":"Delicious dinner! Last minute reservation and we were seated immediately...on a Saturday n","useful":0,"cool":0},"GaRDksAVrLBhA83O5_HYKw":{"text":"from start to finish this is a gem of the crescent city. \nthe wait staff were prompt, atte","useful":0,"cool":0},"Shvo7qrW4ttHYtodE961Vw":{"text":"Customer dinner. My guests enjoyed every plate presented. Woo hoo. Crawfish cornbread is A","useful":0,"cool":0},"Y2fn4c-PWFjPzrSz4RWBUQ":{"text":"My girlfriend, roommate, and I came here for my last night in town for a while.  So we wen","useful":0,"cool":0},"6MG8ZREU1VDl9HLJOBOwvw":{"text":"We are visiting from Florida. After a long day at the zoo, I took my family of 5 here. My ","useful":0,"cool":0},"dKW7cB5qGIzYMLXXvBc4sQ":{"text":"What a find!\n\nWe were on the St Charles street car mid-day in the summer and saw an advert","useful":0,"cool":0},"jcWQFbAbrAq8214C9sa_bw":{"text":"We came here recently on a trip to New Orleans for Sunday Brunch and were pretty disappoin","useful":0,"cool":0},"1MiFatjOtf6j4EitpEv2_Q":{"text":"Second time there and remains one of our favorites... The charbroiled oyster are the best ","useful":0,"cool":0},"oeaODDGnOW7wyQBSmYSO1A":{"text":"This was my first time to superior seafood and oyster bar.  Unfortunately,  I was very dis","useful":0,"cool":0},"KtgOK_O6xFBEzWz4aea9MQ":{"text":"I had the catch of the day (drum fish), which was pan fried over a bed of kale and cherry ","useful":1,"cool":0},"agWCkR-ztoC9di48OT5kZA":{"text":"Try the French 75 salad! Friend green tomatoes were good, but had very little crab meat to","useful":0,"cool":0},"yRMbzfb8B9rTAm69PQf3Jg":{"text":"Stopped here after the zoo( very close) on our way out of NOLA and was a great choice. Rea","useful":0,"cool":0},"NJUQWTPUFB-_ZO3ULE01Eg":{"text":"Absolutely fantastic.  We ordered raw oysters, grilled oysters, crawfish, wine, and the bi","useful":1,"cool":1},"QS5r8XuHraqNPNylwg93rA":{"text":"So it was WAY overpriced, and the food was pretty bad. I had the charbroiled oysters, whic","useful":1,"cool":0},"4l1Un937AG_pG1Pc8fDxwA":{"text":"Wonderful meal. Told by two native NOLA's to eat there. Service and staff the best!  Food ","useful":0,"cool":0},"hcmd6lzL5QQ1nQYJpZfkWg":{"text":"came for a dozen happy hour oysters and the oysters were very large and fresh! wasnt sure ","useful":0,"cool":0},"149gbvPIU9g-ZcA_4hDf-w":{"text":"This place lives up to its name, Superior! They have daily happy hour oysters at 50 cents ","useful":1,"cool":0},"4cIvkWSJ-XHMW3pR8IfvBw":{"text":"Great atmosphere\nExcellent service\nKids and parents loved it\nTrue reflection of Cajun and ","useful":0,"cool":0},"A5e7HlAyg_wNLM8lQbr-TQ":{"text":"Terrible experience. Worst Chardonnay​ I have ever tasted. The fish​ sandwich was missing ","useful":0,"cool":0},"faG4egkzZXXpBdfqAB_1MQ":{"text":"great grilled oysters and outgoing bartenders... Rowland over-confident though","useful":0,"cool":0},"JB6bOIE-2dPABnjjaAa31w":{"text":"Love the vibe here. The food is also really yummy.  I have no complaints whatsoever.  I wa","useful":0,"cool":0},"UqClJGal2NC-51PHgb1o6A":{"text":"50 cent oysters at happy hour!!! unbelievable! a clean and classy interior (reminded me of","useful":2,"cool":1},"V0jmf0NeFmhnBAxarl5Ccg":{"text":"I have loved this restaurant every visit to New Orleans! 5-6 x's a year and this is always","useful":0,"cool":0},"nYoUUjDcxKICgk6hn10Rsg":{"text":"I live pretty close and didn't really want to go because I felt like it was going to be an","useful":1,"cool":1},"KIr2gA12p92T0huhX5lDyA":{"text":"Went here for a birthday dinner and had an excellent time! Started off with some of the fr","useful":0,"cool":0},"FVKHO9vapeTiGgZoObY1RA":{"text":"Went here for my uncle's birthday party for the first time. Wasnt terribly impressed. The ","useful":1,"cool":1},"qoNybqxRRe-_4-EZVURjrw":{"text":"Amazing happy hour!!! 50cent oysters on the half shell. Cannot. Beat. That. \n\nAll the food","useful":0,"cool":0},"ih5hHGc7-DKjl022SrV7OA":{"text":"Amazing service! Food! Raw and chargrilled oysters, escargot were excellent!! Flavor in th","useful":1,"cool":1},"LWhKIPOonmLmYfCt2JOicw":{"text":"Our first time here and it is excellent!!! We came during happy hour and frozen drinks wer","useful":0,"cool":0},"YTQp01VjcdhLPeAOMsjZOA":{"text":"Stopped in for Sunday afternoon brunch with a small group.  The waiter was rather brusque,","useful":0,"cool":0},"KejwCy-AYpX6Ao9kTlr5JQ":{"text":"They need to get it together! Such a bummer bc they could be great, but their food felt li","useful":0,"cool":0},"eQrQyIWZtibnhYn7Gdnyhg":{"text":"Take a ride on the streetcar far from Bourbon Street and totally lose yourself in the deli","useful":1,"cool":0},"CpxeoyU5ucmWFTqKw94akA":{"text":"I come to superior seafood at least once a week. For oysters and only oysters. And only du","useful":7,"cool":3},"odqPQGaXj9vi6YyIh4mnDA":{"text":"Enjoyed a fantastic lunch, with great service. The BBQ shrimp were huge, rich and deliciou","useful":0,"cool":0},"9xOvMuHwCMYNjaNtwqakGw":{"text":"All around I like this place. The food is above average- not the best meal I've ever had- ","useful":1,"cool":0},"L4gAENWghYX23osGKlvzQA":{"text":"Great atmosphere, and a reasonable trolley ride from Canal. You have got to get the Angels","useful":0,"cool":1},"Nwe0tvRrROY8zDCr8YAmSQ":{"text":"This place was recommended by our Uber driver as one of his fav local spots. Gorgeous rest","useful":0,"cool":0},"S67x0vgUev4rCXvH4YVagw":{"text":"My best friend and I came here for brunch and left full and happy! We started off with cha","useful":1,"cool":0},"B8u-di3V74csZeCB5Rb5Qg":{"text":"My son and his wife, who now live in New Orleans, have come to find the best dining places","useful":1,"cool":0},"eTOdcPozHZ83KYPa-DQAOw":{"text":"Went into New Orleans with my wife and grandson and decided to try something new for us. I","useful":0,"cool":0},"qZcUo9cboqUBdHSKY4TIUg":{"text":"Restaurant manager quoted us a wait time of 45 minutes--ended up waiting over an hour for ","useful":0,"cool":0},"FwOTtmw716GjZZwKifZW0w":{"text":"Excellent cocktails, great food, and a very helpful and friendly wait-staff. One of my fav","useful":0,"cool":0},"dtPBlNqONHpHkZDZOJmGuQ":{"text":"This restaurant was on the list to visit while taking in my nieces graduation weekend from","useful":0,"cool":0},"n4gKCBxbfrZ0srZKKl_F4A":{"text":"Safe to say this is the best food we've had in NOLA. We came 2 nights in a row. Being from","useful":1,"cool":0},"kRpFBZD5stQpCgu3ZT9lYQ":{"text":"What a wonderful experience! The service was fabulous (thanks Claire!) and the seafood tru","useful":0,"cool":0},"BeKLfM1wLPOHnzUYgkygZw":{"text":"Not my kinda place. Too expensive.\nMay cater to someone else's taste. What else do I need ","useful":0,"cool":0},"C7J9WWfYsJ3FQqTa_oE2Dw":{"text":"This place has been around for awhile. I've not had a bad meal here yet. Everything is pre","useful":2,"cool":0},"b3KAZMXYiW6BP6yskmUVNw":{"text":"I visit this Uptown spot regularly for lunch and it never disappoints. \n\nI don't know a th","useful":0,"cool":0},"PQJpU1V6Y6viz22gz2LnQA":{"text":"I ate here 2 1/2 yrs ago and it was very good and reasonably priced (around $15 per entree","useful":1,"cool":1},"BePfCaRvJM5sYzrN5ZVFgg":{"text":"Grilled oysters: Order, yum!\nGumbo, Bisque and Side Salad: Mehhhhh\nCrawfish cornbread: NO\n","useful":2,"cool":0},"tz2GcGwEW7ZU2mPs0pxxjg":{"text":"The service and food was awesome. Wide selection on the menu and prices were pretty good.","useful":0,"cool":0},"FUbZmKNSifWzFa8mhnPsnA":{"text":"This is my third experience at Superior Seafood. My first experience went well as I enjoye","useful":0,"cool":0},"hFXEXColRVG6_sYf8GldhA":{"text":"Very disappointed in the food and service. The manager Derrick did comp the orders that we","useful":0,"cool":0},"xEBb8u-HgPE3wgBy8TgvoA":{"text":"In town for one day visiting friends in the area and needed to have our seafood ticket pun","useful":0,"cool":0},"iPiNUO_mR9fyA7_5bumKAw":{"text":"Jumped off the trolley and went in for a drink. Ended up staying for lunch. Excellent food","useful":0,"cool":0},"PAicrzYIXLNsLKMUuRkm_w":{"text":"We finally made it here for brunch. As always, we had a great experience. The service was ","useful":3,"cool":2},"rvO-7vOjQqWRl4YmoGeJGg":{"text":"Came here with a large party (I'm talking about 20-30 people) so we were seated in a semi ","useful":0,"cool":0},"iQtbdhm3OcTShff3tGFwYg":{"text":"The service here is always good. Let me go on ahead and jump straight to some new items th","useful":0,"cool":1},"vNmpyHYNm5Zx7DZ0VRqlkA":{"text":"Chargrilled oysters 2 dozen served after entrees. Spoke to management. Hopefully service w","useful":0,"cool":0},"SnNozXLv_FYf9dFLT0tNHg":{"text":"always a great choice for oysters and awesome frozen mojitos.  fun lively atmosphere and g","useful":0,"cool":0},"LaoQ-1lbypuJ9PS977cWUg":{"text":"Love this place!! I went on 5/13 for the happy hour raw oysters (50 cents each). They were","useful":0,"cool":0},"ghWwTZ1JRca4U6QenEbj7A":{"text":"This review is solely for the happy hour, and what a happy hour it is.  You can't beat $.5","useful":0,"cool":0},"iH9mClaU500RQHeQxOHPOw":{"text":"Overrated. The food was bland and was missing that true New Orleans essence. Nice atmosphe","useful":0,"cool":0},"LNxkNWFYjBd77A88h2oShw":{"text":"The service was great, Lainie and Thomas made it a very enjoyable experience!  Will couldn","useful":0,"cool":0},"VtbC5KFIQr28NIx6Beh5bg":{"text":"Nice selection of unique drinks and wine.  Delicious oysters, great happy hour deal, 50 ce","useful":0,"cool":0},"iqyLsF-aQMP1Sva9rU6qSA":{"text":"2 nights in a row, 1st night was a large group, 6 of us to be exact. We had mac and cheese","useful":2,"cool":0},"qh_p4XugwTTbGLsRbeKjfQ":{"text":"Fantastic service and wonderful ambiance. We came off the trolley, looking for a late lunc","useful":0,"cool":0},"bH4dFuguN8CA_NCe8pzDGw":{"text":"LOVE that they can make mignonette sauce (though usually have to ask a few times)...SUCH c","useful":0,"cool":0},"SwGLiBbDsl6cXjt3R0XgDg":{"text":"I'll start this off by saying, normally I LOVE superior seafood. I have yet to have a meal","useful":0,"cool":0},"aTaa_AvsG70fFxvo7h5tSQ":{"text":"Absolutely top notch. The fried gator appetizer and the crab-stuffed mushrooms were fantas","useful":2,"cool":1},"R2QU_FP0NAzdaaYfUYyIXA":{"text":"I went to Superior Seafood for Sunday brunch while visiting NOLA for a weekend and was dec","useful":0,"cool":0},"ZhBFrbzpo6xGrtxwsDrjcQ":{"text":"My first meal ever in NOLA, and I was quite happy. I had the shrimp and grits with lump cr","useful":0,"cool":0},"YbMLwrnedEl4LWvzmfiVww":{"text":"Excellent food and service. Great to get away from the crowds in the French Quarters. My n","useful":0,"cool":0},"8hixiwOSPpJEN2sJ0bhjOg":{"text":"I was really Looking forward to having my anniversary dinner here. The reviews seemed prom","useful":2,"cool":1},"mcNNjlxkjjbdb_PiC5VP1Q":{"text":"Booooo! Melon salad served without melon, crab stuffed mushrooms with no crab, and med rar","useful":2,"cool":0},"XD9nV6dVboQKVJ5JKO6YJw":{"text":"The food, the service, the hospitality - everything was just wonderful! Great place for bi","useful":0,"cool":0},"CpSLCHn_PQhcsUzuXtTHvQ":{"text":"Very pleased by our choice to stop here while riding along St. Charles Avenue on the stree","useful":0,"cool":0},"0mEL3Bym9gb1YF2RHcENuw":{"text":"Top notch food, reasonable prices, and easy access/parking as far as New Orleans restauran","useful":1,"cool":0},"4qOWPzzbM8XkHUVNGq5a0g":{"text":"This is one of my favorite restaurants in New Orleans. They have the best oysters and the ","useful":1,"cool":0},"0E53PaWEe9OJOCYnqxSOmw":{"text":"Happy hour is the only thing I can comment on because it's the only thing I did but it was","useful":0,"cool":0},"oJdKSwuneJZfOMmfU4Zbug":{"text":"It was a great meal. Started off with crawfish Mac and cheese could be served as a side, b","useful":1,"cool":0},"tqyPrg05oiMCzjX3ZEdVKA":{"text":"Well, I can say that I don't really like the food selection, I did get the chicken and it ","useful":0,"cool":0},"hbHY7yN1Fu3Vkznxg8nkNw":{"text":"I nearly go to this restaurant one time per week for happy hour. I like his frozen French ","useful":0,"cool":0},"EidKNzk3fP2LWExZuo16Tw":{"text":"Whenever you're here ya gotta stop by the oyster bar and holla at Kendrick! He's the best!","useful":0,"cool":0},"yjW6p1ngyUZnBa-gYpm9Gg":{"text":"I came here on a Saturday night with my husband, and it was pretty busy, but we didn't hav","useful":0,"cool":0},"T72dgJ04V7-8GcpN9ux4TQ":{"text":"Superior Seafood is right off the streetcar line and is a great place for a date or when y","useful":0,"cool":0},"DuJoOViQ014j1er8l9PueQ":{"text":"I can't say enough good things about my experience at Superior Seafood on Bacchus Sunday. ","useful":0,"cool":0},"LYkFjKYQj5aaw5pwf-ZtVQ":{"text":"I had high expectations and was looking forward to a great seafood meal. Jerrod was possib","useful":0,"cool":0},"pnUF8eLeCLY_pK5JhdWRZg":{"text":"I just REALLY don't get the hype. I was SO excited when I found out what was opening in th","useful":0,"cool":0},"88K50rcHxsZja7BnPO9eqA":{"text":"I ate here tonight and I thought it was alright. I ordered their Rich Boy Po Boy sandwich ","useful":3,"cool":2},"QYjWgS5U5YtEm3L6314BvA":{"text":"This place is beautiful and delicious. The service was great, and their gluten free menu h","useful":1,"cool":0},"MGF45fZic1ZrokoHcbNY-Q":{"text":"I go here all the time because it is conveniently located.  They have a great Happy Hour $","useful":0,"cool":0},"eikUJcdIWNqNdF5pEow-WA":{"text":"This my second time dining here, and you just can't go wrong with anything on this menu. F","useful":2,"cool":0},"lwocmP79gI-dSnF5_LXa2A":{"text":"Ok so I have to be honest. I was not entirely \"sober\" when I ate here. Hell, it was Mardi ","useful":1,"cool":1},"HdQY7SasF8I66ssnoZhPTg":{"text":"I visit New Orleans often as my son is a student at Loyola.  This is his favorite restaura","useful":0,"cool":0},"FvEyXWQYQtJEFXa_SYjghg":{"text":"We had heard good things about this spot... unfortunately we didn't have a great experienc","useful":0,"cool":0},"IMbDUNumgFDQ813qE8ofMg":{"text":"We were pleasantly surprised, to be honest.  I mostly read the \"not so good\" reviews. Seem","useful":0,"cool":0},"r_DgvhyaWas2vAdfK7GzSA":{"text":"Come early or make a reservation. We sat at the bar and service was quick. Ordered fresh o","useful":0,"cool":0},"To2v8aHLXCp0PQMX9dcfWg":{"text":"Very nice atmosphere. The service is great. Food is delicious. My family comes frequently.","useful":0,"cool":0},"WaPRizwv0LHgilyhR3eY0g":{"text":"I live like a block away so when I get too lazy to make myself anything, this is a great s","useful":0,"cool":0},"sDP8FyZmZyXVqLXiZlZhRA":{"text":"Doing the tourist thing and stopped for dinner on way to hotel.  The happy hour was a nice","useful":0,"cool":0},"sGvgGBQiO70eT7xtvW7_AQ":{"text":"Went here based on recommendation of concierge. Our party consisted of 6 people 4 adults a","useful":0,"cool":0},"SODrteQohbLKaoJvG7DYrg":{"text":"Gluten Free in New Orleans!  My family is not GF , I'm the only one. I was happy to have t","useful":0,"cool":0},"jd5-pBWfXZQyWJwslgOl8Q":{"text":"If you love oysters and other seafood, this is one of those places you have to try in NOLA","useful":0,"cool":0},"1lg5h9R47rgXnPc0WkfB2A":{"text":"I gave it two stars simply because of the deceptive name. We walked in and asked if they h","useful":1,"cool":0},"PVR-8VGmJJzfoYvzC2XYXg":{"text":"Staying up the road from Superior Seafood, best restaurant our group has eaten at since ar","useful":0,"cool":0},"eDQB6lvNs9BQPmL2u_TEdA":{"text":"This place has great service and great food.\nWe had the chargrilled, bienville & rockafell","useful":1,"cool":1},"O3PYTz7uZwstnauQuUa3tw":{"text":"It was good but not great. Wasn't too impressed with the portions for the price. The patio","useful":0,"cool":0},"oGn8uTFUP1568VueCDt2jg":{"text":"Very friendly waitress. Oysters were amazing. Worth the two hour wait. Once we got seated ","useful":0,"cool":0},"9JHtgWq6Xi9DXEPCv1a3Rw":{"text":"Stuffed mushrooms were amazing. Crawfish were wonderful as well. They also have one of the","useful":0,"cool":0},"YEdHleXQlt3HLHb8R1CO3g":{"text":"In all fairness, I have to say that the restaurant was busy today at 1130 with quite a few","useful":1,"cool":1},"aZs0-6DIyE7iNNQXE2w6yw":{"text":"They seem to not care about their food. They do seem to be using fresh seafood, but they j","useful":0,"cool":0},"dPj4NNBIHqWpkIA7YxYvBA":{"text":"Everything was perfect. We enjoyed the charbroiled oysters, blackened catfish, shrimp broc","useful":0,"cool":0},"cyy2F0k0J7B9m0r8Cm_qxg":{"text":"Don't get the cornmeal crusted drum. What I thought was a dusting was actually a thick cru","useful":1,"cool":0},"DZ1v8Lx3YUZs8hCLRnwRag":{"text":"Delicious brunch. Amazing frozen mimosas! Ivy Rose did a wonderful job with her recommenda","useful":1,"cool":1},"tzFVFALbYnfC-e2bHDhyFA":{"text":"We were disappointed...mainly with the food.  Restaurant has a good, busy vibe, especially","useful":0,"cool":0},"cLPM8OBL6MDOi3IypN0T4A":{"text":"We found this restaurant by accident this past October. It is awesome! The people were fri","useful":0,"cool":0},"h3NhqvxblDdvr5k7SeXCzA":{"text":"I had the blackened cod and bread pudding. Both very tender, delicious. Amazing service, h","useful":0,"cool":0},"c3q5gsw7pPjEEm_KfSs7Aw":{"text":"Hate too say it probably one of the disappointing restaurant experiences in recent memory.","useful":0,"cool":0},"FLDKFN8ZV2890Hi89pr5Ag":{"text":"Some of the best raw oysters I have ever eaten.  Also, while I did not get the filet, some","useful":1,"cool":1},"b90hNaupcbMUexBX2EuIlA":{"text":"Make reservations! Extremely busy place! Staff was very friendly and since we had reservat","useful":0,"cool":0},"OvAThFGajbHXQOQ9C4ejcw":{"text":"Went here after looking on yelp for somewhere with good reviews but outside of the French ","useful":0,"cool":0},"rgIQIEvxot9R3bprlq22CA":{"text":"This was one of the best meals I have ever had! (Shrimp risotto)!!!! Taking off one star b","useful":0,"cool":0},"BChsReTXqfYGK3U6GS5mbg":{"text":"Rebecca made our night - her food and wine recommendations were spot on and her service wa","useful":0,"cool":0},"KLAtyPykLZ00XaZOyMklpw":{"text":"Hopefully most of you fucks out there have realized that this place has a $6 oyster specia","useful":4,"cool":1},"eQCyUASrcvQf9ZQ1conTJg":{"text":"As a Shreveport native, I'm very familiar with the Superior brand, since that's where it o","useful":3,"cool":2},"XWweiGN232H8MktVXOnfMQ":{"text":"We went for the first time tonight and LOVED it! The service, food and atmosphere were all","useful":2,"cool":1},"F0tsOib5wVfFXixyw2IHmg":{"text":"My Hubbie & I were headed to another restaurant today when we passed by and on a whim deci","useful":0,"cool":0},"Z69ubcox6vfpXyJwtRvOMg":{"text":"I have been here about 3 times before and was not impressed at all.  Came here last night ","useful":5,"cool":4},"lGBWc92YA6M0RsATYlGKjw":{"text":"I brought my friends who were visiting here to get some local seafood. The meal was delici","useful":0,"cool":0},"VrvrrxLssalGRh9cFECu6Q":{"text":"Another great experience at Superior Seafood my family is the besttttttt. This is one of o","useful":0,"cool":0},"0vBX2GFYNzY_rix4w_E-SA":{"text":"Walked in at about 9pm on a Saturday and the staff was attentive and quick with getting ou","useful":0,"cool":0},"GKWpQ6DmXscvih3Z6DYOMg":{"text":"I was staying downtown and ate at Acme earlier in the week, but couldn't pass up another c","useful":0,"cool":1},"TlyLpjrRiGTExbQ44XyeCw":{"text":"Service is always great - often going out of their way to help out. Plates are delicious (","useful":0,"cool":1},"RTBg2UKQrTxwSpwJUUH_YQ":{"text":"First of all you get extra points by having a dedicated gluten free menu! It even included","useful":1,"cool":0},"igRLaln1d_ThZ-mDDNdMwQ":{"text":"They have a machine that serves frozen alcohol that is actually tasty. It was one of the h","useful":1,"cool":0},"m0aKWLUlzXriwBauNJY-wA":{"text":"The Best thing about This place is the service.  Our waitress Sarah was so nice and so kno","useful":0,"cool":0},"eiG3-VmGUacBdtlNdWziIw":{"text":"The ambiance is excellent and they have a crawfish and crab bisque that I couldn't get eno","useful":0,"cool":0},"5-sGqEIfZpXg6xuUwS6WtQ":{"text":"We heard from many locals that Superior Seafood was a great spot for a seafood dinner in t","useful":0,"cool":0},"MH1hyWxOeu6-i5zYw1mDAw":{"text":"Superior shattered expectations. We are winding up a 9-day NOLA visit. We were fortunate e","useful":1,"cool":0},"9CX5NVWq1Ani-2TCnwkENg":{"text":"We ate here Labor Day weekend when we were in town! We walked to restaurant from the Hampt","useful":0,"cool":0},"hOdEFQspdDMrr4PfIJ7Zwg":{"text":"*happy hour review only*\n\nI'll start by saying how much I LOVE restaurants that do happy h","useful":0,"cool":0},"unKT3AT4OuBuBOyEKnL5sg":{"text":"It is something about the south, better food, better service and a better experience. I'm ","useful":0,"cool":0},"5omQzbzRYiBOUcMBPROH-Q":{"text":"Our first meal in New Orleans did not disappoint - service was attentive (the free valet c","useful":0,"cool":0},"vOLVUgrTfF440MzDoEgljg":{"text":"We were searching for a restaurant for 11 family members with my elderly Dad who is also i","useful":0,"cool":0},"pzDHF5PptA0PuGrsUhikIQ":{"text":"After walking in Audubon park, we boarded the St Charles line called in a reservation and ","useful":1,"cool":0},"G2nLpL8ZrLzIStxVELxAfA":{"text":"The food here was great. The service was phenomenal. I will surely eat here again when vis","useful":0,"cool":0},"vyI_oTrLteW1IMaktA_WYg":{"text":"Service was great. Food was amazing. Drinks were good, except for house wine. I should hav","useful":0,"cool":0},"DJYLW1o5hVcKrhyAA0FxFw":{"text":"A comfortable seafood restaurant in Uptown New Orleans, Ride the street car on St Charles ","useful":0,"cool":0},"MkzSptndD33SHluyBPA5hQ":{"text":"Spectacular char grilled oysters.    Other food is fab but I just could have those oysters","useful":0,"cool":0},"1Nodv7HdqLrajgmDM2QaOA":{"text":"Last nights meal was truly superior in every way. Service was awesome and the food....I ha","useful":0,"cool":0},"CHPgyZJ3vJME_qE8ZZg-bg":{"text":"Had a great meal here during jazz fest. Arrived with a number of people waiting for a tabl","useful":2,"cool":0},"zim7rJlKDe_zNes3Ze8kEg":{"text":"When I went there for the first time, I noticed the smell of good food.  I had a drink at ","useful":2,"cool":0},"GuNg7u-0Xa_zmLRbxymJ5A":{"text":"Great food,drinks and the oysters are delicious. They offer complimentary valet parking wh","useful":0,"cool":0},"eiiS7vwCZ__YuPLUtul5BQ":{"text":"This food was literally everything I wanted in more. Definitely a MUST if you're in NoLA. ","useful":0,"cool":0},"LhDTKGxFzgeehT9d1ZPpJw":{"text":"We've been in NOLA several times. My partner was born there and 1/2 her family still live ","useful":0,"cool":0},"6M7LakJ-2LvIa0hiOSFPuA":{"text":"Oysters are amazing!!!\nI'm from Baltimore, Maryland so I know a thing or 2 about seafood a","useful":0,"cool":0},"iYJJzHclvVv-q2kZTcozpw":{"text":"Make a reservation or wait 2.5 + hours. We made this mistake. We arrived at 630 pm and by ","useful":0,"cool":0},"iKqO9KECDHpI9PMwFiix-w":{"text":"My partner and I came down to New Orleans for vacation from New York and stopped in here o","useful":0,"cool":0},"Qhg7Ue2rrYLAND0ZkERLJA":{"text":"Very lovely place and the food was amazing. Ivy Rose was our waitress and suggested some a","useful":0,"cool":0},"8MQFJKFudUAui9mZRxIz8w":{"text":"Great service, cute staff (our waitress) and excellent food!!! Shrimp & grits surprised me","useful":1,"cool":0},"uT9DvyznkzWslmN9qlWAgw":{"text":"Besides the wedding we were in town for this was certainly the highlight of the trip.  We ","useful":0,"cool":0},"Y3A1VFjYDGx33RALrBkQ7Q":{"text":"We came here for dinner at the suggestion of a friend. I thought the food was good but not","useful":0,"cool":0},"1CvlmJL8u23sfsKTmApNVA":{"text":"Great Happy hour oysters and wine!! $9 for a full bottle $3 for a glass... can't beat em","useful":1,"cool":1},"cSQwEnTJmqFdTR8vvJTVnQ":{"text":"We went to Superior Seafood twice on our vacation in New Orleans. The first time because t","useful":0,"cool":0},"XyZlPpmqtqPW6qoWYkEbaA":{"text":"Great atmosphere! We loved ALL the food we ordered. Portion sizes were medium, just enough","useful":2,"cool":1},"sDLn0EvVu9banH4r4dlWRQ":{"text":"Nice place with comfortable classy ambience.  Good cocktails though I stick with Martinis ","useful":0,"cool":0},"FwRh6Ks_XHAGQ4UXXUPGIQ":{"text":"Had a very good dinner on new yrs eve. We had a dozen of raw and dozen charbroiled oysters","useful":0,"cool":0},"eaJSMdhFXPYZ9ys798iHmw":{"text":"$6 per dozen oysters during happy hour. Worth the wait. Other food on the menu is mediocre","useful":0,"cool":0},"geBdpQESX1BUoYQ2nkwgyQ":{"text":"This spot has great food but we paid $40 for a fried seafood platter that barely consisted","useful":0,"cool":0},"iaBBQZ2uKUFDWQ9TsIIvAA":{"text":"Riley is a great waitress.  Good place to hang during a game.  Great 50 cent oysters then ","useful":0,"cool":0},"7zs6EDp0HJgbh7v5bvZUeA":{"text":"Great food, great staff, great environment all around awesome experience. We will definite","useful":0,"cool":0},"SmuYT0cARsd3yEQ-gPtfLw":{"text":"We went on New Year's Day, so the wait was pretty long, but oh so worth it. We sat at the ","useful":0,"cool":0},"wnuKrbA84KCGOtjGQoiD0Q":{"text":"Oysters are wonderful here and the bread they serve is a winner! Happy hour is great. The ","useful":0,"cool":0},"iKUvZ22sR4Ba6qS8HV3CnQ":{"text":"If it weren't for the happy hour oysters and our server it would be three stars. But I had","useful":0,"cool":1},"DGS7QHRTqRf7bbjmWzz7jQ":{"text":"Great evening ambiance - old school southern feel. Very well maintained building, both ind","useful":0,"cool":0},"bN-Shb5jGDAKRZdUQSfKRQ":{"text":"Had great service, and wonderful oysters. At $15 a dozen, I was incredibly pleased with th","useful":2,"cool":1},"HkT8jPe7sjHeIZb-g6IEKA":{"text":"Atmosphere:  A big dining room that has a more corporate feel than most New Orleans dining","useful":0,"cool":0},"NGwzxBesMtAS0hM94F84LA":{"text":"Go here.  Order the New Orleans BBQ Shrimp. Ask your friendly server for an extra loaf of ","useful":0,"cool":1},"ogvgrfu2xQDaGz_cC7KvpQ":{"text":"The food here was fantastic all around. The salmon was cooked perfectly and served on a pe","useful":1,"cool":0},"vngxlLMFuT24GT8dCBhwog":{"text":"We had great food and drinks here! The service was great. I wished we could've sat closer ","useful":0,"cool":0},"1M8pv8iF4qkkovg7vy1hRg":{"text":"Honestly the most overhyped meal in New Orleans, and I'm not a tourist, I've had it all. L","useful":0,"cool":0},"IdlIIHF2g_YnoJNgYXz5WA":{"text":"I was in New Orleans for a wedding weekend and the rehearsal dinner was here. It's a beaut","useful":0,"cool":0},"ZKXOePHRZC1lSR37BS9mbQ":{"text":"Dinner was so amazing! Reservations were easily made through yelp!  A friend and I shared ","useful":0,"cool":0},"VG-3wMFQgUDYFOmOGZgrcw":{"text":"I avoided this place a lot, because I was judgmental and it had the \"Superior\" name on it.","useful":1,"cool":0},"INMPgjQ6yKb-uEyHkSYKUQ":{"text":"We are in NOLA. What better place to try the seafood.  This place, on tbe end of the line ","useful":1,"cool":0},"Lz1tecISbgGxwOWAIizMXQ":{"text":"Dang good happy hour. Awesome deal of 1/2off bottles of wine and 50 cent oysters. Located ","useful":0,"cool":0},"hxSxDnEuXkwLI1xhdoYbZw":{"text":"Tasty oyster, pasta and blackened fish; great food in all. Highly recommend ice oysters an","useful":0,"cool":0},"XRcXFJ-k6wa2AVnB5Dvi6Q":{"text":", we've been all over the Gulf Coast eating at nice fine restaurants in this is the best m","useful":0,"cool":0},"uKKhviWIRsx4wdvTx2B-Ig":{"text":"We dropped in for a late lunch after wandering the Garden District and I'm glad we did.  T","useful":0,"cool":0},"JkZkBcILWUkB-my-EULtBw":{"text":"Food was good, but it was a little overpriced. Our server sucked though..necer got his nam","useful":1,"cool":1},"2RfnuTMQTLt5lppkYle1rw":{"text":"I've been raving about this place, in particular the happy hour specials. Bottle of decent","useful":0,"cool":0},"erkH2IMJxVOL1ULLpB4WpA":{"text":"We had dinner with friend and had a fabulous time.  The wine is well priced.   We had the ","useful":1,"cool":0},"JAKNP2QMzgtQm8zXqt0CmQ":{"text":"Seems fancy but the prices are great, the food is tasty and the service is awesome! The se","useful":0,"cool":0},"Xd_blWRE_WQOeql_C-ZtNg":{"text":"My review will always be a little biased because this was the home where Copeland's was or","useful":1,"cool":0},"rUi_wzT5Rq6ApS4mA96kmg":{"text":"If you are looking for an awesome oyster/drink happy hour Uptown, Superior is a great choi","useful":0,"cool":0},"6ayayyxSsVAd7pEJQYvG6w":{"text":"Fantastic! This is the choice for a nice dinner out! Cloth table cloths and napkins, good ","useful":0,"cool":0},"blyFy722JnaLlzT5Gkp6cg":{"text":"Superior Seafood, New Orleans, LA\n\nThis was a pretty nice spot. I enjoyed the venue and th","useful":0,"cool":0},"8CCj2mAWhVKq6IH3sJrCdA":{"text":"We held our rehearsal dinner at Superior Seafood and it was a huge success! It was so easy","useful":0,"cool":0},"0rrH10wHnc60g5QQrP5mMQ":{"text":"This is a fun restaurant that is lively with good drinks (bartenders are really friendly a","useful":0,"cool":0},"yvGd8gLYJX5UH-I2CUzUQw":{"text":"Went here for dinner last night.  The food was good and our server was courteous.  The rea","useful":2,"cool":0},"8oXfV-nOEiv0OmFlyENVqg":{"text":"The oysters get a 5 stars. Great happy hour prices at .50 per oysters... can't find that i","useful":1,"cool":0},"o0fxVOiAGO3dHqa5_fyk6w":{"text":"This place has some amazing food!!! the Oysters were some of the best ive ever had, clean ","useful":0,"cool":0},"58RUv8ATc0t4Yk_VFwKqNQ":{"text":"Stopped in for a drink and appetizer.  Service was good and the appetizer (escargot) was v","useful":0,"cool":0},"Sk_dJyqphDpOtFsE_gpCng":{"text":"The best happy hour in New Orleans! I had two enormous mojitos and a plate full of oysters","useful":1,"cool":0},"2sIBDJrSv73sVGtN2L3VLA":{"text":"Went for Sunday brunch and it was a decent experience.  The food selections were hit or mi","useful":1,"cool":0},"joi5iAAPqeCakMCpoAAZsg":{"text":"Despite having limited time in New Orleans, I ended up here twice. It was definitely worth","useful":0,"cool":0},"cYBpxmaDqR58cWcgS1PMMQ":{"text":"Superior Seafood is on the St. Charles Streetcar line, a quick ride from the Quarter.  Sup","useful":3,"cool":2},"8JejS0tLbuUL8ma9bI5NXA":{"text":"I finally got to try this place for the first time on Saturday. My date and I split the an","useful":0,"cool":0},"PvvEFmFtfnIXN-8JZ4-elw":{"text":"Had crawfish, chardonney and side salad. Food and service are excellent. Recommend this pl","useful":0,"cool":1},"H7bmatr95lHIa7FiLo8a6g":{"text":"So. To be honest, this review is only for the oyster and drink happy hour. I've been here ","useful":3,"cool":0},"SaHdwKxB6p57UmY8rtNXsw":{"text":"I hate to shut down the place based off one experience, but the time I had was that horrid","useful":2,"cool":1},"q0QKiStQldbg6E7GQYAfNw":{"text":"Service was excellent food was good and drinks were excellent. Enjoyed every aspect of my ","useful":0,"cool":0},"sPVq81nksYrGI2EiZu_VTg":{"text":"Fantastic food with awesome service. Everything we had was amazing including the crawfish ","useful":0,"cool":0},"I2hvhUBVYl_qlbQRDAEbHw":{"text":"Didn't even make it past the valet. What a terrible experience. Skip this restaurant.","useful":1,"cool":0},"_3MvINveWhGFkLtVGexH4Q":{"text":"It's totally worth the trip cross town for the happy hour. Frozen drinks, oysters, great s","useful":0,"cool":0},"rUMzNUTm0-FinYau1j9rtA":{"text":"I usually ask whether the shrimp in a dish I am considering have been cleaned and usually ","useful":0,"cool":0},"aTmsKR_xmEgfLN3vBIJ_7Q":{"text":"Genuinely the rudest host I've ever dealt with. I waited 50 minutes after being told 35 mi","useful":0,"cool":0},"FgPa40MCqRpX4zUzczlljg":{"text":"FROZEN MIMOSAS... Need I say more?! I mean I would come back just for the frozen mimosas..","useful":0,"cool":0},"BEbnUgKywbfenyhckhwVEA":{"text":"I don't even remember Superior Grill being that loud inside but it didn't ruin our experie","useful":1,"cool":1},"JVy-VkTLU0B2s3Yaus7Szg":{"text":"We came here for a post wedding part, we reserved a room with a mandatory limit of $300 an","useful":0,"cool":0},"vbVX6GBozLH-Yfx5A9OenQ":{"text":"After an afternoon at the Loyola opera (featuring Yelp's very own Veronica S., no less), w","useful":3,"cool":1},"dTkX6NLTQAXQKrZzF9ydzQ":{"text":"I love this place. I have been here twice. Once with a group and once with my husband.\n\nTh","useful":0,"cool":0},"gzjlYJgv0ek6pd7Gb5Mm3g":{"text":"This was my favorite place to dine at for New Orleans because the service was relatively q","useful":1,"cool":0},"GrJ3puyYcVjDR4YTS-ZCBQ":{"text":"Eating at Superior Seafood was an amazing experience for my family and I. \nThe char grille","useful":0,"cool":0},"cy_Bh1BtcsZFwIoPlzjARQ":{"text":"We were a party of six with native New Orleans and a gluten free person.  We all ordered s","useful":0,"cool":0},"NHbf-xMAv8akWBaate1srw":{"text":"I stopped for happy hour while waiting for an evening meeting. The raw oysters were amazin","useful":0,"cool":0},"Tea8f8xPV1HBHDUz5ebVCA":{"text":"I love Superior! It is one of my favorite restaurants in NOLA. Great seafood, ambiance, se","useful":0,"cool":0},"KogIIic2H5hFM7BW7ZRnig":{"text":"We found the dishes to be excellent:  I had the fish of the day, grilled black drum with e","useful":0,"cool":0},"s-L7OrXdXl9THz6EaAQMHQ":{"text":"Some of the best oysters I have eaten good fried green tomatoes. The service was very prom","useful":0,"cool":0},"XGSp7sK7K1fmIamgrROBQg":{"text":"Not worth your money or time! We had the worst service (Kermit was our server and because ","useful":0,"cool":0},"dm5FWzzIGmwXn8gDfiDGJQ":{"text":"This place is fabulous. The food is suburb -- chargrilled oysters, buffalo trace shrimp, c","useful":0,"cool":0},"pY6Tb_ylMF10zRwDUgKZSg":{"text":"This was a great experience and the food was great also. Our waiter Coner was especially d","useful":0,"cool":0},"TmCM281LjJkHb0smwyDQuw":{"text":"We went here two times on our trip. The food and service were both awesome. They have a gr","useful":1,"cool":1},"sxWq05y9lnUPScUNOWXwbw":{"text":"Very nice, lively restaurant on St Charles Ave. we started off with a 2 dozen raw oysters.","useful":0,"cool":0},"hFKE-i74HlEUG_sF6BQHog":{"text":"I got the barbecue shrimp.  Absolutely delicious.  Don't miss out on the carrot cake.  Yum","useful":0,"cool":0},"3THP3XM3Ae68Vnav4pZyJQ":{"text":"Overpriced and under seasoned. I live here and there are many other seafood restaurants th","useful":0,"cool":0},"mOjWrivUP-Ge6L_ROC8ncQ":{"text":"Very nice seafood. Great atmosphere. Came here for a dinner event and was very pleased. Wi","useful":1,"cool":1},"ExEbg9VRJbg5kV5ITMai9w":{"text":"Absolutely recommend the charbroiled oysters. Pasta dishes are fabulous and the service wa","useful":0,"cool":0},"nBxi2WR9MVzWStdHFFfW_A":{"text":"Let's get this out of the way. Just like most everyone else on this site, I AM NOT a food ","useful":3,"cool":1},"BmiYRr6MzeElTIWZGopCZQ":{"text":"This is a review for Superior Seafood's Catering - I booked a crawfish boil at a private h","useful":2,"cool":0},"fB1OHUWpFgYYc2IHX3F2Sg":{"text":"As our airbnb was in the Garden District we passed by here numerous times on our way to th","useful":1,"cool":0},"mRK7EJuser8YfXUos2JocA":{"text":"Wow.  Grilled oysters were amazing, crab stuffed mushrooms delicious.  Happy hour specials","useful":0,"cool":0},"Sd1Is4RVbMktP55GRVmQ-w":{"text":"Love the charbroiled oysters, they are a definite must! Service is quick and the food is d","useful":1,"cool":1},"VUtq4vzMCTNNzA4FXDQnhg":{"text":"We stopped in here for a late lunch/early dinner between parades. Service was pretty good ","useful":0,"cool":0},"ekeKTYZQ3mW6WhrPri69HA":{"text":"I've only been once and I wouldn't mind trying it again. The service was good but my food ","useful":0,"cool":0},"kxu7gESQGIgWNTqNronMYw":{"text":"Great lunch today! Started with crawfish cornbread which was delectable. Pulled pork Bened","useful":0,"cool":0},"S2SHZV6yQLYgTefjGQ6ZmQ":{"text":"Wow! We randomly stopped in before a torrential downpour and we are so glad we came by. Th","useful":0,"cool":0},"MpMwL6eAfMOqTBbVPVj_yg":{"text":"Maybe they caught me on a rough day or something... or maybe it was just THAT GOOD.\n\nI don","useful":2,"cool":1},"N9Pmt6zuSxmHMZubF-h3DQ":{"text":"We absolutely love Superior Seafood! The Ambiance, staff, food and happy hour are wonderfu","useful":0,"cool":0},"ZMXwQ3R1DH2QLa3A1kSkHQ":{"text":"Since I moved back Uptown, this has become one of my favorite happy hours.You can't get mu","useful":0,"cool":0},"1PL2ADPHf5hNej66enbNlg":{"text":"Best and the biggest oysters I have ever had. Have a great happy hour as well and their po","useful":0,"cool":0},"ics1GtsravVssiwCGUSM7Q":{"text":"We were visiting Loyola & Tulane University and stopped in here for dinner.  We got a tabl","useful":0,"cool":0},"KLgyFEtJA-j-nKv3ej1TaA":{"text":"At charles is under construction - but that should not stop you from trying out this good ","useful":0,"cool":0},"NAMqQ26Ww7hkWH6ESOhiHw":{"text":"Excellent happy hour, half price drinks and 50cent oysters can't go wrong!  Oh the crawfis","useful":1,"cool":0},"gnYiJoGae3ec2iWzEFiADA":{"text":"This is my favorite place to go for...well for just about everything. Happy hour? Check. D","useful":1,"cool":0},"XJnqqd_6IEmQktj9znXr0Q":{"text":"Everything here  was excellent food and service. ...clean friendly fresh tasting and class","useful":0,"cool":0},"Ggxb-2q9c-w2qMifR2t7qw":{"text":"The strawberry mojito was fabulous and the shrimp entrees were all delicious. The bacon wr","useful":0,"cool":0},"NVp__UKr8IOUnjgWC_u4kA":{"text":"An uptown favorite! So many good options! Love their fish but the tchopotoulis chicken is ","useful":0,"cool":0},"_pCXJsWnTBzNltLu85cBQQ":{"text":"My expectations were pretty low because I don't like Superior Grill. I was pleasantly surp","useful":0,"cool":0},"StTdDn8uyE9aG0JD8-AKEQ":{"text":"Really nice place. Would be great for happy hour with work colleagues. I really enjoyed th","useful":0,"cool":0},"JkhQhSxZZ09mK0jHq0MxVw":{"text":"This may have been some of the best food during our trip to NOLA, and our server, Jacob, b","useful":0,"cool":0},"OOUMvp0NcuydCe5rbGO3Vg":{"text":"My favourite place to go eat when I'm in New Orleans. Been here three times and never been","useful":0,"cool":0},"fiE2tG61a6xYr3A8wNSVjQ":{"text":"I just ate here last week with some of  my coworkers. Everyone enjoyed it! The appetizer i","useful":1,"cool":0},"eivezfu3fTHJpvdWHXryWg":{"text":"I've been to Superior Seafood 5 or 6 times now, and I think I'd rate it 4 stars... but I'm","useful":0,"cool":0},"rFAqK6g8ZPv5IJvZcx0Y7w":{"text":"As a local that lives a few blocks away, this place can be magic, but on an off day it's a","useful":0,"cool":0},"LwGP9CO_K57fwsMisCVhSw":{"text":"Best happy hour ever! 50 cent oysters, half off wine which was already reasonable came out","useful":0,"cool":0},"CKvfsqvO3lZNsOWf4_ypig":{"text":"Crab Cakes are memorable.  \nThis great plains traveler found this place right off the stre","useful":1,"cool":0},"MUI6HQcTSFslnzcCvk3osQ":{"text":"There aren't enough good things I can say about Superior. We took an eight-person party th","useful":1,"cool":0},"S7XP6EWj-XWHBycXnC2O9Q":{"text":"O serviço é muito bom... ambiente e musica tbm..\nFui pro almoço e comi um Po-boy de shrimp","useful":0,"cool":0},"WByzPtCVDhUs7_vwV7Ur0Q":{"text":"Terrible service. I didn't get my food or my tea...at all. Luckily I was able to cancel my","useful":0,"cool":0},"2g-J4yWADBhOkW-Js-Kdvw":{"text":"Oh Em Gee! This was AMAZING! My friend made a reservation through Open Table. Upon arrival","useful":0,"cool":0},"VAewbBGouK3CRvI2OavJQQ":{"text":"Off the bat, one of the best restaurants I've tried in New Orleans. Happy Hour raw oysters","useful":0,"cool":0},"3aNW7U7PclXp_8BncVo97Q":{"text":"Raw oysters ice cold and just the right amount of salty briny taste. Happy Hour great, one","useful":0,"cool":0},"JEnFgPyyoYSB6V_AJUieoA":{"text":"This is the restaurant that our family *SO* wants to be good. \n\nIt is in a great location.","useful":0,"cool":0},"v3u60Vljrd6LwTHkUhRgwQ":{"text":"This is probably my least favorite place in the city of New Orleans! I read the review and","useful":0,"cool":0},"C_vJjNUf92TtWhFduVUSyA":{"text":"Hands-down my favorite dinner spot in the city. The frozen French 75s are the bomb! So str","useful":0,"cool":0},"GJ8UrUj4E72vMNuMR0uQeA":{"text":"The food here was OK to pretty good, but I thought the prices were high for what they were","useful":5,"cool":1},"YtbzO71IA40iCzIxt41Oww":{"text":"I have nothing but great things to say about this place. It's not hard to miss, it's locat","useful":0,"cool":0},"ZlfCHzdDJyGadsmhebmL5Q":{"text":"About three years ago my wife and I went here hoping we'd have another neighborhood place ","useful":0,"cool":0},"hZPXC2G7Zi6Uu59BaHZRzA":{"text":"Superior Seafood is superior for their oysters. The oyster happy hour is one of the best i","useful":4,"cool":4},"WwKepmyaxA7taT2lWLdtLA":{"text":"Stopped in for a late lunch and so glad we did!  Oysters at the bar were AWESOME as was th","useful":0,"cool":0},"Hjhr5Nb75a0jWgB6WUZQTg":{"text":"Everything I had was superb! Started with the crab stuffed mushrooms. Great flavor and lig","useful":1,"cool":0},"Uk9JeZnoKxOIDYLD4KKQnA":{"text":"Wanted to try different places this time. Read good things about this place and looked for","useful":1,"cool":0},"toaEhlrdUSdy88D__ec5rg":{"text":"I LOVE SUPERIOR! I grew up in NOLA and always come back to superior! My family and i love ","useful":0,"cool":0},"9H_q7_CGDqzij-UBQIeNHw":{"text":"Excellent food, especially the oysters which were supreme and very affordable in happy hou","useful":0,"cool":0},"tsPMlP07BGdB5WgP6BX-wg":{"text":"Amazing!! We took the St Charles streetcar and stopped here because we were starving and t","useful":0,"cool":0},"co3dBSz_kS8iGREp6AgjKQ":{"text":"Came here their oyster happy hour, and service was very slow. Tried the artichoke dip, and","useful":1,"cool":1},"u4SqqLoYFQKgwQ3eq6QIeA":{"text":"The creme brûlée is to die for here. Delicious! Had the alligator app, it was bits of alli","useful":0,"cool":0},"NgwkhuJwwF7KKNdikSouQw":{"text":"Imagine the nerve\n\nCalling yourself \"Superior Seafood\" in New Orleans\n\nYou might as well c","useful":1,"cool":0},"dZKO7ASj6ddh92PS08zBkQ":{"text":"Let me start by saying the service was great. Food was decent but so overpriced. It's not ","useful":1,"cool":0},"_yyNbZlq1o0m-gdAg_2LlQ":{"text":"The food here is good.  I'm told the oysters are delicious, so if you're in the mood for o","useful":1,"cool":0},"Xb0xWmhgKECrlXLYG2gOOQ":{"text":"This is one of my favorite places to eat in the city. The only reason why I'm not giving i","useful":3,"cool":0},"RD3e1imdSLfq-My117j9_w":{"text":"I fell in love with this place. I fell in love with it so much that we came back again the","useful":2,"cool":0},"lQoSWuNKyfv8hbxqP3Y8IQ":{"text":"Love this place. Everything on the menu is so yummy!! Its hard to pick a favorite from her","useful":0,"cool":0},"BOTSZrvmc6SYtW1Urql1CA":{"text":"Go during happy hour. Half price specialty frozen drinks and 50cent raw oysters. \nOther me","useful":0,"cool":0},"IIicBpJfDv2GPtJXRH4-mg":{"text":"Love their happy hour specials!!! \nTried their Shrimp and grits! Awesome!!! \nGood place fo","useful":0,"cool":0},"9HqWEahhEvfs-QlYNYQllg":{"text":"I've been to Superior several times, and while the food is always good, lately the service","useful":0,"cool":0},"Tbxv73Zv9aAK2S0f2_1HNw":{"text":"Spend a couple more dollars - shes classier than her mexican sister.\n\nThe mojitos are amaz","useful":3,"cool":0},"T5GNOupJ9BygW00qFJ-kog":{"text":"I want to like this place but it truly deserves just a 3, Which makes me sad because it ha","useful":0,"cool":0},"ExrHkq9Cl91lUHet_3e4sQ":{"text":"The rudest experience I have had in a restaurant. What ever happened to southern hospitali","useful":0,"cool":0},"aWjoF-T9_ks5J9TTDgF49A":{"text":"The oysters here are so cheap, and the staff is so nice, and the decor inside is so great.","useful":0,"cool":0},"0La_ATJ2XCUWrqcGs7IRWQ":{"text":"Came to try this place with some family a couple weeks ago. So glad we had a reservation b","useful":1,"cool":1},"Ko3DZZvF8ulpTresJgVCNg":{"text":"Amazing food and even better service! Thank you Kermit for taking excellent care of us and","useful":0,"cool":0},"nYijfiwl3jfOkYzp9Z3cqw":{"text":"Went there on a Wednesday night with four other friends, and had a great experience!  From","useful":7,"cool":2},"DG3TtG-oU-uuslKpqipNhw":{"text":"The oysters here are good.  The frozen mojitos here are really good- they'll knock ya on y","useful":0,"cool":0},"mCWSp3ZSg_dI7pwge19d1A":{"text":"I came here on my last night in New Orleans. My cousin who lives there told me they had a ","useful":0,"cool":0},"4l5qSJ0Ad06cNUJjifdeHQ":{"text":"I was brought here by a local for Sunday brunch, and I was so glad we came!  I had the Han","useful":1,"cool":0},"UwVf0cbwGSew2M4Y5aItlA":{"text":"My husband and I ate at Superior Seafood & Oyster Bar when in New Orleans for a conference","useful":0,"cool":0},"c4CjV8pq2ODUw2kdQOeF6A":{"text":"This place was perfect to watch the parades go by while eating and drinking and being warm","useful":1,"cool":0},"TBQuoOeXW0rPl8fE7WVWTw":{"text":"So yea...you should try this place. \n\nWe started off with raw oysters, unlike almost every","useful":1,"cool":0},"ZceQkHOt6ej--PfaQN08FQ":{"text":"Great experience. Out of towner this restaurant was recommended by a friend. Great food gr","useful":0,"cool":0},"VXEmTPTCJSX4M7s7TgYHgA":{"text":"After spending Mardi Gras around Tulane, I forced my friends to stop eating fried chicken ","useful":0,"cool":0},"7qbrS8f1rwGrWcm0PuW5NQ":{"text":"The best dish I've had here is the Blackened Catfish Napoleon. It's A-M-A-Z-I-N-G. Topped ","useful":0,"cool":0},"uY8pk3qyqEWuOdE-Z8q-5A":{"text":"We had the best experience here! It was our last meal in NOLA and it was the best! Happy h","useful":0,"cool":0},"4i9D-oaxU57j74BhDvcnBQ":{"text":"Our first time here was with a group of four. With no reservations on a busy night, gettin","useful":0,"cool":0},"TA37AHzJla_DZo7tuBRHgg":{"text":"Shrimp Po' Boy. Not bad. Not as good as Domicilie's but not far behind it. Fries were ston","useful":0,"cool":0},"Jj7Xmn3MLlc_yatf4-2ryg":{"text":"As I sit here at my table. 1 hour after we have been seated and still do not have drinks. ","useful":0,"cool":0},"DoyDIBYurVv_135yvbQmvw":{"text":"I've been disappointed with the food in Nola but this place was better than most. The serv","useful":0,"cool":0},"mosIcN7qEglJPMIUZkZu7g":{"text":"their happy hour is unbeatable with 50c oysters and other drink specials. Had a blast when","useful":1,"cool":1},"c1-19ZJn3dAT0DlXFkQm7w":{"text":"Frozen French 75? YES!  \nOysters that taste like the ocean = YES!!!\nOMG!  BBQ shrimp? Supe","useful":3,"cool":1},"AUMeICDCuFHJsT5722RZPg":{"text":"Definitely not a fan.  Have eaten here twice...I got the shrimp/crab salad the first time.","useful":1,"cool":0},"geAXWCrUgq5RAiZgoXbRFQ":{"text":"Fourth time in New Orleans and this is my second time coming here. The food is amazing and","useful":0,"cool":0},"U7OS2DpRkRx4A20i4jQiTQ":{"text":"Had a wonderful dinner on the patio.  I ordered gulf shrimp in worcestershire sauce.  The ","useful":0,"cool":0},"hRhRLzp5gVKq99KIo_4hVw":{"text":"Awesome food, service & atmosphere. Will update with details, but tried three great variat","useful":1,"cool":0},"efwAn9FuH2WhmhA_SWgfrQ":{"text":"We arrived on a Saturday evening without a reservation. Somehow our 90 minute predicted wa","useful":0,"cool":0},"0AVWe3le_N78hYzDQr9aOg":{"text":"Sometimes good food can't make up for amateur service. Our waitress must have been new nev","useful":2,"cool":1},"G0M43Eo5QqDXBkKoKUd2mg":{"text":"I dined here with a friend a while ago. We were in a hurry, so we only got drinks and appe","useful":0,"cool":0},"aifZuTujJYb3xJvJkFZtMA":{"text":"While visiting Essence we stayed a couple of blocks from this restaurant and decided to tr","useful":2,"cool":1},"7pH-9UCAqP05PPCjYfP_bA":{"text":"I had reservation and we were quickly seated. The staffs were nice and attentive. \n\nChar g","useful":3,"cool":1},"p60wNOilclW0qjuCsiXSGg":{"text":"Great happy hour. Huge oysters. At night, I had a pasta dish with crawfish and angel hair ","useful":0,"cool":0},"VLGwY2sFvDDGvPavNx5cNg":{"text":"Good place, solid oysters, boiled crawfish (which is not on the menu so you have to ask, a","useful":0,"cool":0},"VT5o4wKQ9kq-VyvMkFme-A":{"text":"Great place! Service was outstanding and food delicious! BBQ shrimps, shrimps salad, salmo","useful":0,"cool":0},"jblXvRZJbXyf00YklHlJhQ":{"text":"Absolutely best oysters in town. We have tried all oyster locations in Nola and these are ","useful":0,"cool":0},"ZX_EWRHmwR7H3HyzkP4Vgw":{"text":"Superior introduced me to my ongoing love affair with chargrilled oysters.  Amongst this N","useful":0,"cool":1},"6kWnrCRji_LwYtwT6DJgdg":{"text":"Ended up very hungry on Magazine St. around 3:30pm and all the restaurants were closed bet","useful":0,"cool":0},"3Hm7spgaOpjkuS4NrLy42A":{"text":"A brand new addition to Uptown, Superior Seafood & Oyster Bar is brought to us by the folk","useful":1,"cool":1},"oKjDim0QkUNDrbjg8Ergpg":{"text":"everything great !  Steaks , seafood  , service all A+ .  One of out best meals in NOLA ev","useful":0,"cool":0},"zFQqiM9JFtvfKmYzR_qtDA":{"text":"Great ambiance friendly staff and a strong drinks! The char oysters were amazing and the r","useful":0,"cool":0},"kYllbEXe3kwPOkCC-UEzBQ":{"text":"This place is what comes to mind when you think of Cajun cuisine. Lively music and a frien","useful":0,"cool":0},"7U1ZSHM4dojOlxfhVJf0Hw":{"text":"We went in for the happy hour and rolled out so stuffed with great appetizers and raw oyst","useful":0,"cool":0},"ANeEzFtSeRrd7zaye13kFw":{"text":"Great service. Friendly staff from the host to the waiter. Conner was a joy who didn't hov","useful":0,"cool":0},"w0I5JiRJ5vShQeL9R_0xjA":{"text":"I expected a lot more based off of the reviews people have written about this place, so th","useful":0,"cool":0},"zafZdKckA7D9TLfOua-90g":{"text":"This was one of the best oyster bars my friends and I tried while in New Orleans! A lot of","useful":0,"cool":0},"YrTZvknZWaAgbaFhLsGiQw":{"text":"The food is seriously on point! Oysters fresh and delish, BBQ shrimp to die for, messy but","useful":0,"cool":0},"aSRQ-cfKW5VREhvfdOpQcA":{"text":"Excellent! Awesome oysters, killer crab cake and fresh grilled fish. We were on our way ou","useful":0,"cool":0},"sX_UBPXbvrOsoMc_VuPbKQ":{"text":"Fabulous lunch. An ice cold beer, shrimp po' boy, and  fabulous table in the atrium to enj","useful":1,"cool":1},"9hbQztb0vXX7H2BMaFM0Sw":{"text":"Loved the look and feel of the place. The food was good. The downfall TV's everywhere, I t","useful":0,"cool":0},"6ZCFqx0WTyswTchNulLmGA":{"text":"I had the BBQed shrimp.  Incredible!  The best shrimp I can remember having.  The sauce is","useful":0,"cool":1},"6nuHb59iZAYuA73LBm-w1A":{"text":"If you want true southern, Cajun cooking, then this is NOT the place to go. That being sai","useful":0,"cool":0},"pfFx8U4bcYdTFhjGnqhJ-Q":{"text":"An amazing meal was to be had on my first night in the South..The bacon wrapped scallops a","useful":1,"cool":0},"npv6i9SJ98sojzb0XCCbNg":{"text":"Had lunch here, beautiful dining area with a great view of St. Charles streetcars going by","useful":1,"cool":0},"GtpZAkn4mFmFgwCyS5WhHQ":{"text":"Always have a great experience here. The BBQ shrimp is excellent.. But save room for the w","useful":0,"cool":0},"Epu0Svs8E0_msQ3Y8v-qwA":{"text":"Last week we were told by a bartender that Sunday was IPA day at Superior Seafood!  Love i","useful":0,"cool":0},"pklQn_JCsptfgqfePxgvCw":{"text":"So we came across this place last minute when we were looking for a place to eat, and this","useful":0,"cool":0},"8gdqTRXijIe8Q1xq28A0JA":{"text":"Very good nice atmosphere nice view of St. Charles street. Food was delicious! Should offe","useful":0,"cool":0},"GjrpU1fXJxyz2uD-q5qGVg":{"text":"Really nice place to bring guests. The service is fantastic. Rachael was our waitress, and","useful":1,"cool":0},"Lkhq-rXfMPQ62MfQEvDBuQ":{"text":"I have visited several times and every time it is excellent. The location is convenient be","useful":0,"cool":0},"b2LlBJif79TzW3RxIJMivQ":{"text":"On our 1st trip to New Orleans, we had to try the oyster happy hour here, and we were not ","useful":0,"cool":0},"6nJMoWGb0qeBp70XARTNZw":{"text":"My friends and I decided to have dinner at Superior Seafood last week. \n\nAt this point, I ","useful":10,"cool":3},"IRFJa03FgdKH5YXMYtDQmQ":{"text":"Good food, good service. Very comfortable and nice environment. Staff were quite nice and ","useful":0,"cool":0},"sBN9TnaY3-GIi0uIKovJrw":{"text":"Love the Scallops and charbroiled oysters also get the frozen mojitos. Service is excellen","useful":0,"cool":0},"sldAIp8JjqXVphvZmvem7w":{"text":"Such an amazing taste experience, I highly recommend the escargot! A garlicy buttery heave","useful":1,"cool":0},"aKAoBD4gjH0m8SOZI80EKQ":{"text":"My husband and I went here for our first date night in our new city. We received excellent","useful":0,"cool":0},"2vPvSRNxG9nhZEEOQ73wsw":{"text":"I absolutely love the happy hour oysters. $6 for a dozen of raw oysters? You cannot go any","useful":0,"cool":0},"PDJ7dS6gy998Go3rITUB2w":{"text":"Just had a fantastic meal at Superior Seafood & Oyster bar! Joe was the BEST server I've e","useful":1,"cool":0},"F_5oe4yiuU1q3VMyQ1s60A":{"text":"Our cab driver recommended Superior, so we decided to stop and eat when we saw it from the","useful":0,"cool":1},"N60njQUqhZStuQdF0I96Wg":{"text":"Shrimp and grits were amazing!! \nWait staff was on point and wasn't expensive as the setti","useful":0,"cool":0},"CHT3Q8mJ73ciqSsIKqULlw":{"text":"Best seafood around!  Oysters are phenomenal, as many reviews mention.  However, the star ","useful":0,"cool":0},"7XmQQT-Tm52s0fOVDUiU_g":{"text":"Coming from the East Coast, you may find gulf coast oysters to be GIGANTIC and not nearly ","useful":2,"cool":0},"mqCct_MKi3lDEFz6LBE3rQ":{"text":"walking into this place, it is so cute and has the extra details made in the decor and det","useful":0,"cool":0},"GIVpgsXJ6gH8_PxImewSKQ":{"text":"This joint was jumping on a weekday afternoon in late May. Our stop was a serendipitous pi","useful":1,"cool":1},"KFyr7yLW8erXLjt3xOqBbw":{"text":"I went for brunch and I was very disappointed. I got the superior pancakes. Which were not","useful":0,"cool":0},"_7zjJ3CodhnVAAnaUhQa2A":{"text":"We had a great lunch at this restaurant. Really nice, classy ambiance, and really good ser","useful":0,"cool":0},"eSC1ka_qvJLYOFtsT8JiJg":{"text":"I really like it here!  Every time I have been my meal, the service, and the atmosphere is","useful":0,"cool":0},"2DGzjziELe-z7ItP5jQsSg":{"text":"I might have a five star meal once a year... this was it. Got there early (oysters served ","useful":0,"cool":0},"E96_0Wt-BsdL_cC5FsHpsw":{"text":"Not often visiting New Orleans, i decided to stick to the basics of dining in the gulf - s","useful":0,"cool":0},"HzZKQzsduNCBTrVQlEGWvg":{"text":"The food was delicious. We had the Angels on Horseback (absolutely delicious) and the lump","useful":0,"cool":0},"faaaHRqg_6r2D6wHgIP9sg":{"text":"Oysters were really fresh. We love the happy hour specials. Ordered a fish dish and it was","useful":0,"cool":0},"DhjLw1JhTiVpNfogj-zCUw":{"text":"I figure gulf shrimp have pretty low levels of oil contamination by 2017, so I got the shr","useful":0,"cool":0},"m017UTYUrE74AQPHNqGeIw":{"text":"Oh man, does this place get packed during happy hour (4-6:30), and for good reason. The sp","useful":3,"cool":0},"Uq-i0MtYn-yCqXrkaH0mnA":{"text":"Oyster shucker did great job! Food was fresh and he took care of us ladies! Well done 5 st","useful":0,"cool":0},"1nWQGAdMMExVHEKU1wbWng":{"text":"Superior Seafood has an amazing happy hour that runs 4:00 - 6:30 pm offering 1/2 price raw","useful":3,"cool":1},"dtJM4RCGG_cMQ8553HOMCg":{"text":"Awesome food & service! Happy hour is great and valuable! The shrimps of Big Easy BBQ shri","useful":0,"cool":0},"HqHAN5faiQ4sBZ47F9_www":{"text":"Had the charcoal broiled oysters in the shell and the carrot cake. Both were wonderful.","useful":0,"cool":1},"RoRJbim6oxT46WCXb9IJoQ":{"text":"Maybe it was just a bad day for them , but I doubt it.  My father , myself and a guest arr","useful":1,"cool":0},"Zw7RiC_IxoasG_0cFBgMLw":{"text":"Yes, this place has sports video screens all over. Yes, it caters to tourists. Yes, it has","useful":3,"cool":1},"6SsIOFosC6n9KYg8kDt9fg":{"text":"Very good food!!!  We started out with the Char-grilled oysters. I don't do oysters   BUT ","useful":0,"cool":1},"zT7EP3NuRPJGxixQXvZypg":{"text":"Probably the best food I've ever had. My gf got the fillet and it was larger than advertis","useful":0,"cool":0},"uYZLia_2cxVCH5xFrDxcag":{"text":"Enjoyed everything from the appetizer to the dessert and coffee. Loved the location....not","useful":1,"cool":0},"NTQagoQWyN3rJ9d0RQLdmA":{"text":"Consistently good. Really like the blue cheese dip and creole chips (off the menu now) and","useful":0,"cool":0},"P6iXIbX5FF7jh7FSHwfx4g":{"text":"Amazing staff took such great care of my son on his first date.  They had his flowers at t","useful":0,"cool":0},"g749VbdPERLu9U6a6B3JwA":{"text":"The oysters here were amazing!  We had to have an extra dozen!  Each dish we had was excel","useful":0,"cool":0},"bf-UNblYEDJmuWmOJjsxCw":{"text":"The food was excellent, I had a tuna burger, tasted the crawfish etoufe, and the salmon sa","useful":1,"cool":0},"u_k7_TCY186PPWoqEJeVwA":{"text":"Grilled oysters were freakin great! I would stay all day and drink beers and eat these.  R","useful":2,"cool":0},"u-Q5-tx_c_kqe02dC3i-6A":{"text":"This is the best oyster happy hour in town! If it's the weekend or holiday be sure to get ","useful":0,"cool":0},"08OkytyjkHmOqv1CNwsvQg":{"text":"Food was excellent unfortunately the service was probably the worst I have ever experience","useful":0,"cool":0},"X2eAew41bAa9l14d6T62Ng":{"text":"Amazing blackened catfish and bread pudding and oysters were a great price for a dozen !!!","useful":0,"cool":0},"xJn5GOtjRKPgPOU9tNaCwA":{"text":"I come to New Orleans once a year, because I own a timeshare on the Avenue. Came here last","useful":0,"cool":0},"w7g_7IKEjAMXz3jCFtF3aQ":{"text":"Order lots of the chargrilled oysters! So incredibly good and I don't even like oysters!  ","useful":0,"cool":0},"3t8ABUXyEPG_gtFul-rUdw":{"text":"Always great service and great food and drinks. They have happy hour every day with great ","useful":0,"cool":0},"c33PU9pi91IUZMmHOMSCrw":{"text":"Wonderful restaurant and that reason is why it is the place where my daughter and son in l","useful":1,"cool":0},"oBFh9wFkk_wYdYCX07g5hw":{"text":"Reservations are available on Open Table. That's already a plus. When we arrived the decor","useful":2,"cool":2},"28KqQiFTILjQu9gV3xNaBg":{"text":"Rebecca is the SWEETEST! I come here just to enjoy her warm company and that frozen French","useful":0,"cool":0},"jDpGSFmcVtHS5NPu0iebtA":{"text":"New Orleans is a foodie haven and this restaurant is one of the reasons why!  We received ","useful":0,"cool":0},"HcgxS11-7xqL9jLVZ2RZ6Q":{"text":"Came here for lunch on the last day of our New Orleans trip. Their BBQ shrimp is delicious","useful":0,"cool":0},"iLiBb6yd1uXEgDcA_nu_Mw":{"text":"Not my favorite place for seafood, but a good option to recommend to tourists who are look","useful":1,"cool":0},"YMR_sIOtXjUQUv05Nrak0Q":{"text":"I ate there three times in my ten day stay in New Orleans. They were consistently good and","useful":0,"cool":0},"1e6myKSKJVh8DKI2aupD-w":{"text":"Hadn't  been here in over a year but I remember absolutely loving the frozen pomegranate m","useful":1,"cool":1},"qNP4v8M0RFTkr2UCAuN9oA":{"text":"The food was tasty but a little more expensive than it was worth. The charbroiled oysters ","useful":0,"cool":0},"TSAoiwp1UsX3ESTqSMNvwQ":{"text":"This was one of the best meals we had in New Orleans. An absolute must dine.  We had a res","useful":0,"cool":0},"iBGC71y9lFtoiqyPUDM9Og":{"text":"We don't often visit the same restaurant twice during a four-day trip, but found ourselves","useful":1,"cool":0},"FG5vKUSB3hp5RL5xj26BOg":{"text":"OVERRATED. I rather go elsewhere but my friends enjoyed the food. Mine was not hot and was","useful":0,"cool":0},"ABYoNQzAvSDuLpfG614S3A":{"text":"We somehow ended up here about every other day. Drawn by Joe the bartender and the frozen ","useful":0,"cool":0},"a1wJ6lD99Kw85tchJTXWjg":{"text":"So amazing! I can't believe I've waited so long to come here. Every little thing was perfe","useful":0,"cool":0},"r-lmjyrf_13df87tGicFxA":{"text":"My wife and I went to dinner at Superior Seafood and it was probably one of the worst dini","useful":0,"cool":0},"55gddIOZqiUdJ8gUzARhMQ":{"text":"This place is on point! An amazing deal for raw oysters during happy hour. I had the froze","useful":0,"cool":0},"vw6bme0vIbTh0vj3tz7Drg":{"text":"I was not impressed with the food here at all. I travel to New Orleans often, and usually ","useful":1,"cool":0},"mKNT0R65tE_br2FRbu9s_Q":{"text":"Service was awful! Oysters were warm! Manager was an A-hole!!!\n\nCould have gone behind the","useful":0,"cool":0},"5Z3cpAjYxGDyFEPXWybjdQ":{"text":"I have to say: the raw oysters on the half shell are fresh and huge with a wonderfully ine","useful":3,"cool":2},"5y8NhrVpeWvPSWJn6ky6kg":{"text":"5 for happy hour! This place has it all-: $.50 oysters, 2 for 1 frozen pomegranate daiquir","useful":2,"cool":1},"gcWwBydjzI01S_68BI2mAQ":{"text":"Great food, service, and ambience! They easily accommodated our large party.","useful":0,"cool":0},"4_pxEHqAkwI-85lv0iSLIw":{"text":"The food great and service fantastic. Locals recommended and did not disappoint. Our waite","useful":0,"cool":0},"8bc47qzNCy5eSUs3kzs8yA":{"text":"Went there twice during our visit to NOLA, the food is excellent, so is the service. We or","useful":0,"cool":0},"joqepuj4y4cqzyv71xHAjA":{"text":"Wow!! Here on vacation, and this place is amazing. I don't normally frequent the same plac","useful":0,"cool":0},"xWF3HUi7VFZ3kgsvHAmN7g":{"text":"Visited restaurant Friday before Christmas with family of 6 including 7 year old grandson.","useful":0,"cool":0},"xLywK8cdsqBcW5wVF4x80w":{"text":"Made a reservation and told them we were total hillbillies in shorts. They said come on do","useful":0,"cool":0},"BFeDht93qk4iX9ECTC1K7Q":{"text":"Had a really great lunch here today.  Kinda crowded with the brunch crowd but service didn","useful":0,"cool":0},"MjomEyYrRiiLC4cHes6pCA":{"text":"We are visiting from out state, just stopped there by chance for a drink had a great time!","useful":1,"cool":0},"ZtuH1xJIgrGTfH4qfBYfOw":{"text":"We stumbled upon this place by accident and so glad we did.  We ate lunch here on a Saturd","useful":0,"cool":0},"rJiFwhVBgfKT_tGxvIbKtg":{"text":"Can't fault this place! We came randomly during happy hour which was so good! The freshly ","useful":0,"cool":0},"c0PEk4UYc0K08SpD9-7NDQ":{"text":"John Besh's Luke will always be my favorite for oyster HH. However, if you're in the Uptow","useful":0,"cool":0},"VJEDmp4xsiBnQAuownFeRA":{"text":"I ordered the Chicken Monica and I hated it. When the manager came out he explained that h","useful":0,"cool":0},"xNkKcS3yyUbl4bhiPjo8rA":{"text":"Crazy good food! Had the crawfish boil, po-boy and crawfish crab bisque, blew my mind. Sat","useful":0,"cool":0},"6mREfJ25z1GDunn-HuzRFw":{"text":"Went to a group dinner here recently of about 20-30 people. Service was appropriately staf","useful":1,"cool":1},"fFkI7XL8thpMYrqJ8ReR2w":{"text":"Anthony at the oyster bar was the highlight of a delicious experience. He shucks like a ch","useful":0,"cool":1},"Oqd3Plmm0indNXidxK70YQ":{"text":"Had the Oyster sampler for an appetizer. Delicious! The chargrilled ones were the best. Th","useful":2,"cool":1},"n9ft5veNgv42glwi6S2_gQ":{"text":"We went with a party of 7. Each of us loved our separate entree's. The Manager (John Micha","useful":0,"cool":0},"4pjWYEIDKazZZXywdJpxHg":{"text":"One word for the food here...salty. I so really wanted to love this place. But some places","useful":0,"cool":0},"QIt4IeRYnuxo7Fja37OvbQ":{"text":"Was in NOLA w/some childhood girlfriends, visiting another childhood friend that recently ","useful":1,"cool":0},"-paFU2gy0CAp4Mro5qdj-Q":{"text":"What a great place! Every time I have come here the atmosphere has been nice, the food has","useful":1,"cool":1},"2RCHvS3ihuf58KbINPZskg":{"text":"I used to live in New Orleans and I've been to most of the \"it\" restaurants there.  I went","useful":1,"cool":0},"d5YfnCfADXlRSEpUS8VT3w":{"text":"I'll let the pictures speak for themselves! The food was outstanding. The service was exce","useful":2,"cool":1},"NeiahAhuU-xvINF0KFCdHA":{"text":"This probably my favorite seafood spot uptown! Love the salmon! I've dined in quite a few ","useful":0,"cool":0},"TH1QFFzJIvwTAdNMJhWQYg":{"text":"Best best place ever. .50 cent happy hour oysters from 4 to 6 everyday.  And half off all ","useful":1,"cool":2},"6OwQlTO474LS35-HVlk0ig":{"text":"Amazing happy hour with oysters and half price drinks (not all drinks included).  Great fo","useful":0,"cool":0},"EfIOtmMZTVnBygJW8KFPGA":{"text":"Service was fantastic on a busy day, I don't remember our servers name but she was very ni","useful":0,"cool":0},"t0mJ36j0_yZ61OEtlhOHeQ":{"text":"Sat at the bar and had amazing raw and chargrilled oysters, escargot and fresh bread. Happ","useful":0,"cool":0},"AAKsBf6sH134lkpkX935SQ":{"text":"Could be my favorite restaurant ever! If I were to ever become wealthy, I'd travel here ju","useful":1,"cool":0},"KkMzxV5lx8WD8X5_mVcb_Q":{"text":"It was our first night in New Orleans and a friend took us out to eat here.\n\nEver since I ","useful":0,"cool":0},"heuraGEZCB36B-p2zgVg3Q":{"text":"Terrific food, the staff is professional (and, probably not coincidentally, wildly attract","useful":1,"cool":0},"wdrmetkfYuvk_vNl0VckRQ":{"text":"Yall, sign me up any day of the week to come here! Breakfast, brunch, lunch, dinner.. Anyt","useful":5,"cool":2},"b6NasLy4nSxS_RjZ2I1jxA":{"text":"I came here for lunch with clients few days ago.  I like the atmosphere here.  With the pa","useful":1,"cool":1},"nOIh3-9JHLXF7i4eyiBQKQ":{"text":"We were here for New Year's Eve! Great food, the band was awesome! The macaroni & cheese w","useful":0,"cool":0},"tmfysavPdMJYj_pnAHCLXw":{"text":"The helpful and happy service is the best part of this place. Food is fine. Decor is great","useful":0,"cool":0},"TW69mMBoSnm-vEZ__mMpPA":{"text":"I was visiting my sister and brother-in-law over the weekend and we came here for lunch. I","useful":0,"cool":0},"xKWVyNWVYBeH-4-FL-gSXQ":{"text":"We'd just pulled in to town after driving from south Texas, so we didn't put a lot of thou","useful":1,"cool":0},"Ot0MEgDkfF2kZee573sa4Q":{"text":"Terrific joint not too far outside of the Quarter. Bonus, right on St Charles street car l","useful":0,"cool":0},"mXCpEqKGi5QpRR3q6W9kuw":{"text":"Everything about this experience was excellent.  We had a group of 6 celebrating a birthda","useful":1,"cool":0},"gRVkN9TSEyvyg6oqDga1_g":{"text":"The best oyster happy hour in New Orleans. Possibly in the country.","useful":0,"cool":0},"kXL46M1-SmzBT8VHMmCMog":{"text":"Omg love the happy hour oyster! We two ate three doz of oyster! The fried alligator is way","useful":0,"cool":0},"h_FYWcYIWwoUc9zz-GqUQw":{"text":"So me and the fiancé went there for a plan of just some drinks and apps with a friend of h","useful":0,"cool":0},"UYzU8Z22tPDbvFQieCQh4g":{"text":"We came here a few weeks ago for Mother's Day! We made a reservation which I highly recomm","useful":1,"cool":1},"7t0sbg-WuMR2apSgufbkxA":{"text":"Truly a wonderful and delicious place! Last time I came here with my date, we had a frozen","useful":1,"cool":0},"E5k-JfdLCKpxz7vrHXaa2g":{"text":"Y'all, this place is delicious. My husband and I are frequent visitors of the Superior Gri","useful":1,"cool":1},"mOX2P-hKkNzsyuNA2W7X-Q":{"text":"I love this place! We go there every time we visit NOLA- it's away from the tourist crowds","useful":0,"cool":0},"K0N7iCPRzbXMjtx_aRTqSg":{"text":"Food is on point!!! Staff is amazing, very clean and awesome atmosphere. Definitely recomm","useful":1,"cool":0},"4if6XFA3oOq4s0bx_-uyuQ":{"text":"The building and fixtures are perfect!  So deco! Love the atmosphere!  \n\nHad the cheesebur","useful":0,"cool":0},"f-xO4-1TQ9n3Z4cKwNJJ1g":{"text":"Angeles on horseback are oysters wrapped in bacon and deep fried.  Awesome appetizer.  Had","useful":0,"cool":0},"fngwxI5_0phDjrQo_ba73g":{"text":"I half-expected this place to be a letdown, but from the valet to the view to the ambience","useful":2,"cool":1},"ykVzDUknsuhmoczrQYKCkg":{"text":"I had the grilled oysters and they were excellent!  The frozen mojito was also excellent. ","useful":0,"cool":0},"dIjMaPyJvk-IlauiCaeBrg":{"text":"A little expensive but definitely worth it! Happy hour helps with the drink costs - house ","useful":1,"cool":0},"ZbOUMYePDxe_T719PxGxyw":{"text":"BBQ Shrimp was very good, but for $15.00 I was expecting more than two tiny pieces of brea","useful":0,"cool":0},"WT5UXVjm2in_ejbWRnvmUQ":{"text":"Well, I reviewed the original Superior Grill earlier today, so I may as well write one for","useful":2,"cool":0},"WDO9KHXgELqFQ04bPJTmiA":{"text":"Meh. We we're pretty excited to eat somewhere out of the hustle and bustle of the typical ","useful":0,"cool":0},"9vo8SFsZWSBw0xkjjZQsyg":{"text":"I had a fish that was really good from here.  My g/f had some stuff thats in a shell that ","useful":0,"cool":0},"YCsxcPnYXVogrRal7MJeJw":{"text":"Stopped in for brunch. Everything was amazing from the service to the food to the frozen m","useful":0,"cool":0},"0JtsmemU6Psiya5Ar_3Lmw":{"text":"What can I say about a restaurant that needs to consult the Internet to make a vodka gimle","useful":0,"cool":0},"hjl_DCJCtHZI4QgH7v7L0Q":{"text":"I have never written a review for a restaurant and I really didn't want to write one for t","useful":2,"cool":0},"0MZgcFq6QZW2wcq8UWr4PA":{"text":"We truly liked our later lunch at Superior.  The place wasn't packed, and we got the nice ","useful":2,"cool":1},"_gbUjhRaTXVb--vGcoVY5w":{"text":"Stopped here for lunch while exploring the Garden District. Our hostess seated us in the p","useful":2,"cool":0},"sZDkdXDkbhLJ0bQdCULqYg":{"text":"The hamburger was cold. French fries cold and over cooked. Stuffed mushrooms were cold. Se","useful":0,"cool":0},"TAL-YlwkHePoULveTuhEIg":{"text":"Love this place. Best happy hour for oysters, every day 4-6:30. A dozen oysters and a glas","useful":0,"cool":0},"sBdKhK5nz7MM45aj2WkGrQ":{"text":"Loved this place.  It had great service and the food was excellent.  The waiters were very","useful":0,"cool":0},"_oWkh4zbLUHgs7wUSElh5Q":{"text":"Great food!\nThose charboiled oysters were so good\nBlackened catfish napoleon was also very","useful":1,"cool":0},"2jxexKRCj0aNiS9hSWgdMA":{"text":"Amazing.The service was superior. The food was delicious. \nFor appetizers We had crab stuf","useful":0,"cool":0},"US6z8FHtHM3e3zOSSU7INA":{"text":"I felt the need to revise my review after my most recent experience. This is mostly becaus","useful":2,"cool":1},"zsJU-JtpWF9vhEB3zx1hlg":{"text":"Mist of the seafood didhes i hsve had flavor.  overall pretty good. oysters tasty. too muc","useful":0,"cool":0},"xKPwZdmbu88DALIYEmu7ng":{"text":"This place has a very welcoming vibe. The food tastes fresh and is definitely worth every ","useful":0,"cool":0},"8w_VaeyENN9N_uvRlvB-nA":{"text":"Walking in through the doors I instantly loved the dark decor and the smaller size of the ","useful":3,"cool":3},"V_mhsJN2Y-fy38Jbr5aAKA":{"text":"This was one of the culinary highlights of our Big Easy trip. This is a classy place with ","useful":0,"cool":0},"9wHdIF3Bs-SUYSDoawLwzA":{"text":"Yum yum!  I'm only reviewing the happy hour oyster bar.  We read about the happy hour spec","useful":6,"cool":5},"edXzNyUWM1BGhO1jC76hww":{"text":"Came for the happy hour oysters and had such a good meal we came back the next night. I do","useful":2,"cool":0},"WH_RY8YQPMNEkSPp8Ntr8w":{"text":"Had lunch at Superior yesterday and was thoroughly impressed.\n\nThe food, especially consid","useful":3,"cool":0},"4VbvlkEYYz4aENugo185Eg":{"text":"Excellent everything! Had the mimosa & mojito as frozen cocktails. Oysters were indeed hug","useful":1,"cool":0},"V9SNyh23_w9rj456zE1LZw":{"text":"Great location, great décor. Perfect place to send a tourist who doesn't know any better.","useful":0,"cool":0},"SY4LaofWbbfEI5M65rg1nw":{"text":"creme brulee was to die for. pretty big serving too!","useful":0,"cool":0},"unGlEZIisrvk55hqaMzj4w":{"text":"Great spot!  Love going regularly for happy hour oysters.  Plus, the chicken tchoupitoulas","useful":0,"cool":0},"yLFPw936HvMyEz10If4OmQ":{"text":"Just need to rave about our experience with a party of 10 on a Saturday night.  Experience","useful":2,"cool":2},"jTzht2rOmKgS-TEwEWPjSg":{"text":"I came here with friends, to see what's the fuss;\nI'd been to its sister; that wasn't a pl","useful":7,"cool":7},"AuzdvgUlkVQManFieBmsGA":{"text":"I'm very surprised that I found the food to be as good as it was here as I had a bit of a ","useful":10,"cool":6},"tMRQkTRMDO0WUUOiLX9y_g":{"text":"Came to nola with some friends and we loved this place. I had the raw oysters and they wer","useful":0,"cool":0},"BFxUA1cCBlKrsN9ey_NotA":{"text":"Always a great time here. I always bring my family here who are visiting for the authentic","useful":1,"cool":0},"ZxYcpBzhGwW5I4tPSgK8vg":{"text":"This place is a gem and the seafood is really amazing. The service is great and the atmosp","useful":1,"cool":1},"0acYO5-pfUu53He4Yxhqcg":{"text":"The chargrilled and raw oysters are pretty much as good as it gets. Not generally very che","useful":0,"cool":0},"t0F1yh_ISyq3hIlKvclKnw":{"text":"I loved this place! The oysters were so fresh and amazing! We tried the raw oysters and th","useful":0,"cool":0},"pIu-bLMAgIWesmAF4OUUnA":{"text":"Great oysters at a great price. The BBQ Shrimp was a bit too rich for my taste, but it wou","useful":0,"cool":0},"o5PBBHqgTPbuxuxinwKrMg":{"text":"It was ok. Food took very long. I got the scallops hoping it was worth the wait. It wasn't","useful":0,"cool":0},"2WL-j0EizcV8zgPXn6QndA":{"text":"Superior did not live up to its name in my opinion.  I took my uncle who was visiting from","useful":0,"cool":0},"gwdk03ZPosJqRgpW6mKujQ":{"text":"I had read good reviews and decided to try lunch here with my wife.  We started with a doz","useful":0,"cool":0},"cwbiJrnKEYxMpiPa0vepAg":{"text":"Great food. Customer service.... eh... just Ok. We waited way too long for basic service.","useful":0,"cool":0},"-Ye-fNvNs4h_2ulM22zbXw":{"text":"Came for dinner on a Saturday night. We were fortunate enough to get a reservation at the ","useful":1,"cool":0},"MQ6lxVXzh5b_XaZ_AKm9GA":{"text":"Had the Pasta Vieux Carre as my main meal which was tasty, but by far my favorite thing wa","useful":0,"cool":0},"BNJxfSiHf38CEfqW9Ff2Ww":{"text":"I ate there last night with a group of about ten friends from work and we made our reserva","useful":0,"cool":0},"lFfq0vht3enishHtJrxnDw":{"text":"love the happy hour specials. can't beat cheap but more importantly, fresh and tasty, raw ","useful":0,"cool":0},"bFno7xWJcW1W21CEpPh9gA":{"text":"Not as expensive as you might imagine, especially at happy hour. Great atmosphere, amazing","useful":0,"cool":0},"aosHT1Cy0zRRIQ2hj-tzcA":{"text":"Wanted to grab some food and drinks, so we went here with a few friends.  The workers here","useful":2,"cool":0},"P7yVEiGHbKpm2Sdiy4wosA":{"text":"Birthday dinner date. \nFOOD:\nBread - Cold \nChar-Grilled Oysters - partner expressed they w","useful":1,"cool":0},"wAUiyzxo9rLkhgNPPWvQWg":{"text":"They did a very nice job on the buildout, though if a loud atmosphere is a turn off you sh","useful":0,"cool":0},"cvinVg5mwFqhLCLamkiQ9A":{"text":"We just stumbled on to this place by accident.  It was not a place that was recommended to","useful":3,"cool":3},"N1IPS6INA08DPGxFfxCtLw":{"text":"The food was excellent! Crawfish cornbread and crawfish mac n cheese were divine. The shri","useful":0,"cool":0},"zuRwnKmnPHp0YT4TExDZqg":{"text":"Awesome happy hour. Kind of an old school traditional New Orleans seafood spot but located","useful":0,"cool":0},"Vp3qZXiHm_F9_w0FQsjmKA":{"text":"While some friends and I were hanging Uptown for parades, someone suggested that they were","useful":6,"cool":2},"pf0jFKP5Cq1ekrO9aGYOBA":{"text":"The place beats Acme and Oceana. Oysters is a must here. The food and service are superior","useful":0,"cool":0},"ZbrgbIzEoHycBIuG_ZEu6g":{"text":"We really enjoyed my husband's birthday dinner here.   We tried the oysters and the catch ","useful":0,"cool":0},"1h-3abs1Lb7Nx28aZZJZqA":{"text":"My mom was in town recently and she and her two friends wanted raw oysters. I recommended ","useful":0,"cool":0},"NAL7BzOtBwUs28OiqQF7_Q":{"text":"Great food, great service.  Huge place.  I've always made reservations, just in case, but ","useful":0,"cool":0},"UrJdsri4_vof8lxK5MD1Mw":{"text":"Never had a bad experience here.  The bar is top notch, the waitstaff are great, and the f","useful":1,"cool":0},"nUA9DX6zKPLKTRZQHeaFeA":{"text":"Why go anywhere else?   Absolutely delicious oysters!   Next time I will only order dozens","useful":0,"cool":0},"dcqqZPFK-jBnth7rrCQsGA":{"text":"\"Raw oysters! YUM!!!\"\n\nGreatest raw, cold, fat, and salty Louisiana oysters for 50 cents e","useful":1,"cool":1},"A-68wwnW-T5Y_7anH7ItUA":{"text":"I love the feel in this restaurant. Very large and roomy.  We went for lunch and had some ","useful":0,"cool":0},"vLzBM1s2qRp8FN08JAnvXQ":{"text":"Had the Tchoupitoulas chicken entree at lunch. Overcooked chicken breast, bland, underwhel","useful":0,"cool":0},"SjpchxMpvZz-3WrqsWYqZA":{"text":"I like Superior Seafood.  4 stars might be a little generous but because they have one of ","useful":3,"cool":2},"pwsirjsO8o5iaCYgMg5pfQ":{"text":"I loved my food here. I had the blackened catfish w/etoufee on top with whipped potatoes. ","useful":0,"cool":0},"pLIerGodMLpnhbGM8IIY2w":{"text":"Good service and good food. We did Sunday brunch had the oysters wrapped in bacon deep fri","useful":1,"cool":0},"haEMdfr6dMfi-o-NcBTWtw":{"text":"Awesome. Always reliable food and service. Margaritas we're especially good this last time","useful":0,"cool":0},"RBAYkky7e9X9QynmyBxU-g":{"text":"I really like this place for lunch. The lunch menu has reasonable pricing and 1.00 bread p","useful":1,"cool":0},"rcpFWasZ2Ce5muNAAUVA6A":{"text":"So far, my favorite restaurant in New Orleans. AMAZING. Even the food on the kid's menu wa","useful":0,"cool":0},"IsYeH-eVDBd5sv2UtobH7g":{"text":"SUPER SLOW SUPERIOR SEAFOOD\n\nThis evening I searched for great seafood and most importantl","useful":0,"cool":0},"NqsJSzjzlNwmC3t6i_BD2w":{"text":"My wife and I were lucky enough to make our meal at Superior before the 4 o'clock happy ho","useful":0,"cool":0},"e2a50aDTF_0JPTnrYCSHBw":{"text":"The only thing that I can review for superior is the oysters. But ohh La la - I am talking","useful":0,"cool":0},"ejWfUlO-Y1REvuRAKlRm3Q":{"text":"The appearance far surpassed the food. Do not recommend. I had a seafood salad that was la","useful":0,"cool":0},"2yIwnKqojvRIZRsPrGZplg":{"text":"The etoufee cornbread is enough to make a meal out of. The bisque was so Delish. I needed ","useful":0,"cool":0},"4HQJOYQTa8FCKYWh4FlHbQ":{"text":"My wife and I Decided to try this place as we love oysters and wanted to experience good s","useful":0,"cool":0},"2drTyx6Q3IDChOjQlcNv4A":{"text":"Very good brunch. Excellent choices and the Bloody Mary's are perfect.  Friendly and atten","useful":0,"cool":0},"jx7JxvOYBMB1lyw01z0APw":{"text":"One of the best!  I'm not quick to hand out 5 stars, but I will gladly hand them out here.","useful":0,"cool":0},"MfMAY5MCPUDBrb9_RytwBw":{"text":"Delicious! Stopped in for a quick appetizer and drink to cool down. Superior did not disap","useful":0,"cool":0},"3gaEqR9GGt_cqAReTD1WGQ":{"text":"Some of the beast oysters I've ever had! Sit at the oyster bar at happy hour for a great t","useful":0,"cool":0},"C0hUJ_HJoGJ8d6wC45aCTA":{"text":"After lots of window-shopping along Magazine Street and sight-seeing in the Garden Distric","useful":0,"cool":1},"w98O8tzJrT1MX394scJwWg":{"text":"Loved loved loved the oysters here! So fresh. And the shucker was very knowledgable. Thank","useful":1,"cool":1},"c7N2V9OCk86LouRmeOfA8w":{"text":"My first 2 experiences here were pretty great. I live in New Orleans and the oysters are u","useful":0,"cool":0},"uqeTHAqBAk1J5fEJ5ot2yA":{"text":"Met a former colleague here for lunch. She's local so I knew if she recommended it, it mus","useful":0,"cool":0},"EmlqiJUOjlRzGu-m9CDchQ":{"text":"Checked in 15 min early for our opentable reservation. Seemed not to have a problem seatin","useful":0,"cool":0},"933wWNurhghlFty8vK9pyA":{"text":"The happy hour is unbeatable. $0.50 raw oysters with a view of the parade route and a nice","useful":1,"cool":1},"fxCMIVul_qN2aLL1iYezXw":{"text":"Can I just say AMAZING?! My boyfriend and I were visiting New Orleans and decided on Super","useful":0,"cool":0},"JZbdn9jPapK_b8HdAkr_Bg":{"text":"A Triple YES!!!\nEnergy - wonderful! \nAtmosphere - true NO, right down to the doorknobs and","useful":0,"cool":1},"GesEGIvva4pfU8oKGhEcjQ":{"text":"Went here earlier with some friends for happy hour. I recommend making reservations before","useful":0,"cool":0},"WL9gqZHbz7OiFznQHbEYqg":{"text":"This review is purely for the oyster happy hour; I rarely order much else when I'm here.  ","useful":0,"cool":0},"R6fV1ACW5xrYWdfKL64wFQ":{"text":"My wife and I came here for dinner, she had the pasta del Mar and loved it. My new York st","useful":0,"cool":0},"clsLqEjx8sZ_U6oU0gXd3w":{"text":"Dined at Superior Seafood on a weekday during Happy Hour. The Happy Hour drink deals are a","useful":0,"cool":0},"2rgei7DGMhp2nz-extF42Q":{"text":"The server and manager was very friendly. My food was amazing and my family agreed theres ","useful":0,"cool":0},"GWBux2JbfYlrrYcEICBG_w":{"text":"The food is generally so/so but we really like the space especially the patio areas. I hav","useful":0,"cool":0},"4TcslUMeBlc6nN4F9zAoZQ":{"text":"I can only comment on the happy hour here but what a happy hour it is!\n\n50 cent raw oyster","useful":1,"cool":1},"UPyrQRezZtmk-KMyeJQT0A":{"text":"Our waiter Jolie was wonderful and just a pleasure to be around. Food was great we had shr","useful":0,"cool":0},"5_9nqwVCZVuyRk_9l01-cg":{"text":"Great atmosphere. The tables by the huge windows have the best lighting for food pics ;)\nW","useful":2,"cool":0},"sZsD7KbyrvZnvSLro_jM5Q":{"text":"Happy hour is the key to this place. Nice ambiance, free valet parking, and good fresh oys","useful":0,"cool":0},"M2pyBBCLPRFI7MAc6-op6A":{"text":"Delicious food with a large Gluten Free special menu. The BBQ shrimp was amazing. My daugh","useful":0,"cool":0},"73dP3U-vKGDJzIxCt6Bt1g":{"text":"Excellent food and service.  The ahi tuna tar tar was the best.  Ask for Josh, excellent a","useful":0,"cool":0},"O7z9G9etiVVezXSv5EoHqA":{"text":"We came for the oyster and drink happy hour. Needless to say, it was beyond expectations! ","useful":0,"cool":0},"A2HM0g1ZU2l4iUkqmLERcw":{"text":"This place is a must try.  Even my wife (who is a local) was blown away at the quality of ","useful":0,"cool":0},"r0YP3apjwqTRBSpkYdsSXQ":{"text":"I got the charbroiled oysters and the Atlantic salmon. Came with rice and veggies, Soooooo","useful":0,"cool":0},"qiy05Fjsddd9zGZqIN_zWg":{"text":"Great Ambiance, Average Food. Sure go there for a cocktail or take your mom and dad or gra","useful":1,"cool":1},"5DGbHQSlOhS_eEBB954MpQ":{"text":"I came here last Sunday for brunch on a whim as we were visiting Tulane and it was our fir","useful":1,"cool":0},"oquNxSmHTO_K769UCPmrPQ":{"text":"Oysters were AMAZING!!! They gave us a fresh warm loaf of bread. Also the barbeque shrimp ","useful":0,"cool":0},"9moo_CpDeUJOlLPBOX0Meg":{"text":"Superior Seafood is A.MAZ.ING. $3 frozen margaritas and a menu full of New Orleans style b","useful":0,"cool":0},"gGMLuvTY2-Y2LeLhzFovhg":{"text":"A little deceiving since they advertise their Happy Hour, but it's only available after As","useful":0,"cool":0},"u96AOD1g5bnnxkUo4pym9w":{"text":"I ordered the crab cake benedict. The crab cake was really really good! It was sweet just ","useful":1,"cool":0},"tgiV08A1aAuo9xPel5Z4Mw":{"text":"Food is delicious. Atmosphere is fun but LOUD.  Service is going to be a challenge because","useful":1,"cool":0},"FZ1t_vqwFPpDXuZIud8pxw":{"text":"delicious but wildly overpriced. the food took 45 minutes to arrive. the interior is beaut","useful":0,"cool":0},"H_OhKCKmc8kjGk0hY1QyaA":{"text":"Me and my husband came here on Valentine's Day, and it was packed! We were lucky to get a ","useful":0,"cool":0},"HeGk11yIJKcQvW3AwRCzgg":{"text":"Sitting at the oyster bar for happy hour, 50 cent gulf oysters from St.Bernard Parish... s","useful":0,"cool":0},"MzMS97ggJH3df8EUkMomTQ":{"text":"Love the happy hour.  The oysters are great and they offer a number of discounted drinks. ","useful":0,"cool":0},"jHVCnmjj77loP1o-ylio3g":{"text":"Went for lunch. Got some oysters which were delicious. Shrimp and grits are very nice it's","useful":0,"cool":0},"zyeYeSgqHo79bG_qyiECug":{"text":"We wanted to have seafood while vacationing in NOLA.  Found this restaurant on yelp and so","useful":0,"cool":0},"4ioG_UWsxkWs03CUbsO6xw":{"text":"This is my favorite restaurant in all of New Orleans, yes, you read that right. I live in ","useful":3,"cool":1},"-ofhXuhR4c3-d__RLSe9Zg":{"text":"My husband and I discovered this place on our first trip to New Orleans. It came highly re","useful":0,"cool":0},"1_f7VwcYPymo_E4cE4Gagw":{"text":"Writing a review at the table due to sheer glee, stopped in for a quick lunch and the muss","useful":0,"cool":0},"k8xBH43FNH4f3PMHBW2ajg":{"text":"The happy hour is absolutely amazing! The pomegranate mojito is delicious! Plus half price","useful":0,"cool":0},"u71SbjxdFaPNkIaLUyL4hQ":{"text":"I must say I did not have high expectations of this place because it is related to Superio","useful":0,"cool":0},"6KLkTV5VPDWWCzzLDefdlQ":{"text":"This is the restaurant that our family *SO* wants to be good. \n\nIt is in a great location.","useful":0,"cool":0},"1Wu-hf1VcYiGzcpL1X7iUg":{"text":"I came here with a group of 6 on a Saturday night. We all took advantage of the happy hour","useful":6,"cool":5},"sTi-ubuWfSoY543beBIPNA":{"text":"This review is exclusively for the happy hour specials seeing as I am Vegetarian and limit","useful":1,"cool":0},"lNXIyIKrG-xfIliuVClnxA":{"text":"The food was fabulous!  The raw oysters were delightful and the main courses were great.  ","useful":0,"cool":0},"-K9pc1FvjImStZqxC85NaQ":{"text":"I have to say I really like this place.  It has two patio areas, one enclosed with a/c and","useful":0,"cool":0},"jOfzbf9riBSJvNNSO6144Q":{"text":"Can't beat 50 cent raw oysters for hh! I also got the chargrilled oysters, crawfish cornbr","useful":0,"cool":0},"8fkZ1Z7XsEW0KtTiOye94g":{"text":"This place lives up to its name, Superior! They have daily happy hour oysters at 50 cents ","useful":0,"cool":0},"fk2M0BwuqMd1RYI4I3Skmg":{"text":"This restaurant is in the uptown garden district. This area is beautiful. Very much the up","useful":1,"cool":1},"6dufXWW0Ck9uIFr5sDLlZQ":{"text":"I've only been here to get drinks during Mardi Gras, but I finally bit the bullet and deci","useful":3,"cool":0},"kNxhGQXksxl-oGa1I7p6uQ":{"text":"I have been coming to New Orleans for 30 years. These were the best charred oysters I have","useful":0,"cool":0},"ntgNMpnUzSULlrUmMTRLRQ":{"text":"This was actually our favorite stop in New Orleans. Easily reached by the St. Charles stre","useful":3,"cool":2},"-UeT_YmzsEDoDkVvEsxC2A":{"text":"We are doing a food tour of the city. Stopped in here to try out the grub. First off, EXCE","useful":1,"cool":0},"JzRe2ktE8M1UoIWrGA2YtQ":{"text":"First, I would never leave a comment here but there is no way on the website to leave anyt","useful":0,"cool":0},"WW5v0SHJZ_gcZOh02vK28Q":{"text":"Go for happy hour at 3 , they have 50 € raw oysters  and two for one frozen drinks ! The w","useful":1,"cool":1},"V5An9MVev-m0fk5Bs0waQg":{"text":"We took the streetcar up to Napoleon to dine at Superior Seafood for dinner recently. We t","useful":0,"cool":0},"cbuDgw0WhBY8QY1bmxVuZA":{"text":"Loved it!  My wife and I are here to kick off our second anniversary vacation, and we are ","useful":1,"cool":1},"0_E0lgrdrXT4BFrUgGNZcA":{"text":"The quality of the food has gone down in the last 2 years.  I found the gumbo floury and t","useful":0,"cool":0},"oqTWnYOpyy4d7cx5IGpMkA":{"text":"Went here on a Tuesday night for some dinner.  The free valet parking is a nice perk.  We ","useful":0,"cool":0},"GIf5anZ2i-u3EdfG8bx8YQ":{"text":"Delicious food, and great service. My family and I had a very nice waiter! I recommend thi","useful":0,"cool":0},"Vrxz7NsKSMMbmMHWolN1FQ":{"text":"Cool spot with slightly upscale vibe, yet it is a bit loud. The tables are pretty closely ","useful":2,"cool":0},"M1dI9AMx8dR3d-LyZ_OYqQ":{"text":"THE BEST CHARBROILED OYSTERS I HAVE EVER HAD! This restaurant is amazing! I really enjoyed","useful":0,"cool":0},"jzCEepFPvpXLsFazELiUqA":{"text":"We arrived about 5:45 on Tuesday. Immediately seated and greeted. Fantastic dinner and ser","useful":0,"cool":0},"qHEy7afbZ1CY7j30sabQ5A":{"text":"Wonderful, and we go every time we are in New Orleans.  Huge fabulous hand shucked oysters","useful":0,"cool":0},"Mu5I-B2vlBHgWXwnWITsHg":{"text":"It's always fun and stimulating when you stumble on a not so local feeling business and th","useful":1,"cool":1},"tr4umdcpseJgPxxk0WBJfQ":{"text":"Best char grilled oysters we've had in New Orleans so far, better than Felix's and ACME.  ","useful":1,"cool":0},"uGx2OEHi19LMD6R3ddnpQg":{"text":"Had friends in from Texas. They wanted real New Orleans seafood. From the time we stepped ","useful":0,"cool":0},"lBXv_icYkqW2QX3Il7Tajw":{"text":"One of the hand full of places actually open on Fat Tuesday. I am still not sure what the ","useful":0,"cool":0},"PU90BL3koVZ1y_BvuNJ6Kg":{"text":"When Superior Seafood first opened they had a soft-opening where they allowed patrons with","useful":2,"cool":0},"mL0tru6_9RoN05w-J2dOAQ":{"text":"The food is incredibly delicious, the atmosphere is phenomenal, and the happy hour deals C","useful":1,"cool":0},"VO520BswuERl-faHgUyD2A":{"text":"The service was friendly, food came out fast. Great lunch prices. Clean bathrooms. No comp","useful":1,"cool":0},"XiZYV-tc-c8giALL9ptQow":{"text":"Food: SOOO good. My cousin found their oysters to be the best in town (best mean overall o","useful":0,"cool":0},"k1nrvJkpYqQ4DM1QJ-vckg":{"text":"Found it by mistake and loved it, great service and food. Had the shrimp & grits (1st tme ","useful":0,"cool":0},"4GODDFF8pqrVSFI_sV_57A":{"text":"A reliable seafood restaurant with a busy bar scene. \n\nFood is good and has many of the Ne","useful":0,"cool":0},"-7F_aIUb2va5-b4N1u3n8Q":{"text":"I've been here 4 or 5 times now and I don't know why it's taken me this long to write a re","useful":0,"cool":0},"VObu1TE50_wFF97O1Ci4xw":{"text":"Love this place. Great atmosphere, great decor and great fucking oysters!!! Grilled oyster","useful":0,"cool":0},"Tb4MKpAKZnOeOPo3bRoMlg":{"text":"Great food. Awesome atmosphere. Will definitely be visiting again when I'm back in NoLa.\n\n","useful":2,"cool":1},"dAyPndb0h6Canfp4T-s_2g":{"text":"Our first meal in NO was here. Our server was amazing and super attentive! We got the roas","useful":2,"cool":1},"OhFk3LYS9UIyhmlUZ-fxPg":{"text":"Amazing oyster happy hour! Recommend eating at the bar and watching the action. Fresh and ","useful":0,"cool":0},"LaFbJQysYQWkknmrshF6Ww":{"text":"I'd compare Superior Seafood to a Bonefish Grill. Same type of food options and pretty sim","useful":1,"cool":0},"keD0W_NRM-M-fIaLdazHQA":{"text":"Great happy hour (4:00-6:30. They have $0.50 raw oysters that were big and tasty. All of t","useful":1,"cool":0},"3FiO9B5P55yf7KIRcd7nQg":{"text":"the oysters here were as good as it gets . fresh cold plump and briney. \n\nthe 75 salad and","useful":0,"cool":0},"4bSFkE45K_qBr1TgTsrsTA":{"text":"Did someone say $0.50 oysters?! Happy hour is the best here. We sat at the oyster bar and ","useful":0,"cool":0},"TQbFiB_9J4KP2p8VlTK2xQ":{"text":"Great grilled salmon salad. Wonderful mix of greens and veggies. Friend's salad unfortunat","useful":1,"cool":0},"2Y6luCiIY2PZaUp3aXm2Eg":{"text":"I like coming here in the evenings, because it has $0.50 oysters and $3 wine during happy ","useful":0,"cool":0},"3QVVurFJpl8oV1xk5RXcBQ":{"text":"I'm surprised this restaurant has a good rating for oysters, but maybe it's because I'm fr","useful":0,"cool":0},"Dq28w2Pfz-VLUmMhz-0JCg":{"text":"The Tchoupitoulas Chicken is amazing! Large portion, perfect presentation, and perfect sea","useful":0,"cool":0},"fW0IJ9WmAk5nm4Ve5WnLwg":{"text":"I did not know frozen Rose was a thing. And now that I've had it, I need it in my summer r","useful":2,"cool":1},"YYa3zRottE_bFc0-ZeXddg":{"text":"Just closed out 4 days of Jazzfest and in need of a reprieve.  We Ubered up to the Garden ","useful":1,"cool":0},"Or1mxIObk-15MMllcke6-g":{"text":"Atmosphere great. Great location. Food and service was fantastic. They were very accommoda","useful":0,"cool":0},"vtO5OPOC_JGoHYO-HkzlFQ":{"text":"Excellent restaurant - great food and service!\nAlways bring out of town guests here...\n\nNo","useful":1,"cool":0},"N7qFKKlzmygpbF6e-8yepQ":{"text":"Great go-to for out-of-town guests. A little pricey, but everyone can get what they want a","useful":0,"cool":0},"92tYK9CmS5Cs0SVStRGWMA":{"text":"An unexpected stop on the green tram brought us to this place where we discovered an aweso","useful":0,"cool":0},"pmche282LIO4gWRKUzuYpA":{"text":"We were starving and jumped off the streetcar when we saw this place.  It has such a cool ","useful":0,"cool":0},"sJ8ug5PR5pYwwMQ-IwcBBQ":{"text":"Inferior Seafood.\nAt the bar for the happy hour oysters and waited 30 minutes for a half d","useful":1,"cool":0},"JUzxAuv9HIm2d6bL--cFXQ":{"text":"While in town on a trip, we were dining at commanders palace and one of our servers recomm","useful":0,"cool":0},"LtC6RLRE-DylmyVeKOS0dg":{"text":"Complimentary valet which I loved and the valet was extremely nice. Get inside only to wai","useful":0,"cool":0},"nMdUHpUOXfIRHZTTZiVMWw":{"text":"Amazing. We visited new orleans and had a 3 course meal here. Desserts for $2 sounded too ","useful":1,"cool":0},"ZcAwjjEsLpPhhmNdx-UUWw":{"text":"Very disappointing.\nSo-called fresh fish was rubbery.\nCrawfish bisque tasted like onions.\n","useful":0,"cool":0},"HyAEYMqsWXi29woZZdYtfg":{"text":"As long as Pascal's Manales is in business I will avoid this place\n\nAfter my fifth disappo","useful":0,"cool":0},"ey45lQcJF-BruPNJRhAj5w":{"text":"The food was delicious! Recommendations about the carrot cake were spot on! We will defini","useful":0,"cool":0},"GmBBvkLCESk-7LbooTh_tQ":{"text":"Enjoy the jazz brunch with amazing food and service!  Perfect Sunday vibe, get the Hangove","useful":1,"cool":0},"XoyRmodVvuj6LQvX2xlbTg":{"text":"We visited Superior for their happy hour and it was amazing! They actually had lost power ","useful":0,"cool":0},"jiz2U4qdj_-8QlDV8MDbmw":{"text":"lemme start off with 50 cent oysters from 4-630\nyou can just easily end it here and just g","useful":1,"cool":0},"5h2WcCrjI0L6B_ZZQqF8ew":{"text":"Ahmani was the hostess tonight at Superior. She did an excellent job getting us seated as ","useful":0,"cool":0},"-TuZxa3tb4STcABpVIK5vQ":{"text":"Me and the Madame come here quite often when we are visiting my mother Uptown. Never, neve","useful":0,"cool":0},"fu6nP9kWdwEklAzkWAf23g":{"text":"Superior is always fair to very good.  Nice place, décor, & bar.  Armed officer on premise","useful":0,"cool":0},"4dCGZAk-Cx8qvh5nQk7rXg":{"text":"Jay is one bad mother shucker!  Very nice and personable oyster shucker made for a great t","useful":1,"cool":0},"IS0zuCciBo0ovzv1VHB3qg":{"text":"This was a great restaurant for a small group. The food was authentic to New Orleans and w","useful":0,"cool":0},"OpqjSIQdsyOXL-nPhcIvng":{"text":"My boyfriend and I are regular happy hour customers at the bar and have gotten to know the","useful":0,"cool":1},"ZXAAB3DkzYBxlz4rQHXJ0w":{"text":"Service was great and food was great. Went to celebrate 2 birthdays and received 2 complim","useful":0,"cool":0},"FFTW31Sva6V1uFMmJveAww":{"text":"Food was good- best carrot cake I have ever had but that's the best thing I'd say about ou","useful":0,"cool":0},"hxhLJblMtFkuBVcgmCmPmw":{"text":"Far from superior. Wait staff was uninformed and MIA most of the night. When food came out","useful":0,"cool":0},"OXwQZDqP9mMkkqlMfFTYhA":{"text":"Superior? Not so much, not tonight anyway! My husband and I had dinner here while visiting","useful":0,"cool":0},"EvH6Y46c-OCAEHe429YyCg":{"text":"Make an iconic greatest hits mix of New Orleans seafood, but don't remaster any of the tra","useful":2,"cool":3},"O6jVmhzrzEp5Al4IMXXvNw":{"text":"This place is great! I love the atmosphere and the piano player! Very clean and the drinks","useful":0,"cool":0},"vvQ2MgTcplUhXxj8fz7Mjw":{"text":"I've eaten at Superior Seafood twice now and both meals have been delicious. Each time I h","useful":0,"cool":0},"9lXqVzmavkdcf7NOIEpnrg":{"text":"I loved the alligator bites, the craw fish!!!...Oh my god. delicious memories.I also had g","useful":0,"cool":0},"WTsl3NUuTVV1xMzdV-Y7Sw":{"text":"The food was excellent. The BBQ shrimp appetizer actually tasted better than what we had a","useful":0,"cool":0},"fgHJfMXfvgUqFI0IzLmBmQ":{"text":"Top notch seafood option in Nola, especially if you don't want to use your hands to peel a","useful":1,"cool":1},"97O5_qhIvLuG2qH1IwnOZw":{"text":"Where do I begin? \nService: We were treated like royalty on both occasions we appeared thi","useful":0,"cool":0},"gLTcG4aYP7I6K9zy4VuF2g":{"text":"Oysters, snails and blackened catfish with corn ettufe. Well made, tasty, but not anything","useful":0,"cool":0},"N2pWoOrZNMGGXqlNk4qe1w":{"text":"Stumbled on this gem almost 4 years ago. \nWe return every time we are in Nola.\nNayad's mul","useful":0,"cool":0},"tXGsG2HMq5a2v2qxqTfLdA":{"text":"This restaurant in so many ways has good qualities, but to be treated by the 3 ladies (don","useful":0,"cool":0},"O_CL_WL69Ww2XHi6OeA5JQ":{"text":"This was my first stop on my trip to NOLA for Mardi Gras. They definitely made me look for","useful":0,"cool":1},"QGhwlJ_vyLtdjfZ02gkRCg":{"text":"Superior Seafood was a last-minute decision when my friend Mac decided to treat me to dinn","useful":1,"cool":0},"4OGgiD3NBZ9T1mmi6dLk7g":{"text":"Just go. \n\nI'm not that keen on Gulf oysters but what I just downed -- 30 between 2 of us ","useful":0,"cool":0},"3eOaSAn293D8Fz04tANJ-w":{"text":"Amazing Appetizers (Crawfish Cornbread was to die for!), great drink specials, and the gri","useful":0,"cool":0},"JMAidK3zHUNNU3x2FeUbig":{"text":"I'll be honest ... I didn't wanna like this place at all. When I first heard Superior was ","useful":1,"cool":0},"C4WM1uDObhBZJD4PFj4nzg":{"text":"I celebrated my birthday in this restaurant, the food was soooo good I got the seafood pas","useful":0,"cool":0},"j6na9vsuSI2LvjOJDo4Fgg":{"text":"Meal was pretty good. Service was good too. Made sure to not eat too much to splurge on de","useful":1,"cool":0},"rz6KIW2_Prait5vD-ib7ZQ":{"text":"Very good food at very good price.   Service was outstanding.  Colby was very responsive t","useful":0,"cool":0},"wZEJ0XlU204wSgJWJ92tVg":{"text":"Great place to go with a group of friends as there is something for everyone on the menu. ","useful":0,"cool":0},"tfnXXbFSbqOvrAysyrOjOQ":{"text":"II stumbled upon Superior Seafood because our first choice of lunch that day turned out to","useful":3,"cool":3},"oGorBdGw2FyAKXrOSZPGgA":{"text":"Oh wow what a place! If I could give it more stars I would!\n \nI absolutely loved this plac","useful":1,"cool":1},"65XyJ22NZELdpHLqrAhh7A":{"text":"I'm totally addicted to their happy hour. Which is every day. 4-630. 50 cent oysters $3 dr","useful":0,"cool":0},"bdPH6CiR7f_OBBeU-DuyDw":{"text":"Party of six was all gluten free and we all thoroughly enjoyed our meals!  Call ahead to m","useful":0,"cool":0},"6IBBCYxmCEEj2wpR4qO1kw":{"text":"My boyfriend and I ate here on a whim because our Uber driver couldn't stop talking about ","useful":1,"cool":0},"olgOWEzawicNQZ1ouJGXXg":{"text":"Great deals on the oysters and drinks. Happy hours are Monday through Sunday from 4 pm to ","useful":0,"cool":0},"m6kYeAbvagPd3j7l3MrnWA":{"text":"This restaurant is really good and  happy hour specials - $0.50 oysters and $3 drafts and ","useful":0,"cool":0},"nk48u5Kh5YXq1NJQIYPnqQ":{"text":"Food was great with excellent service. Husband enjoyed a few happy hour drinks. We had shr","useful":1,"cool":0},"9Gw2kSAfquGxHxG6IaHolw":{"text":"I would not advise. Especially during busy times. Service is not the best and food is medi","useful":0,"cool":0},"Ue462NaOntA_GfmadY0XLg":{"text":"While visiting my husband and I happened upon this place, such an amazing experience we fo","useful":0,"cool":0},"uXsfqGgi0F2K6Dgp2zwzKw":{"text":"Superior Seafood and Oyster Bar is a MUST for happy hour! It starts from 4:00 p.m. and end","useful":5,"cool":3},"9YUIL-lcYgaWykC4ZSDS1w":{"text":"Our waitress Brittney was amazing.   My wife was excited to dine here for lunch and everyt","useful":0,"cool":0},"TBoJ4EKl-D1mmaW7fMvLcg":{"text":"Came here for lunch after a walk around Audubon park.  We started with fired alligator and","useful":1,"cool":1},"uaXUIGRsthg6tgRyTrtyDw":{"text":"This fantastic place NEVER disappoints! You get the fine dining  experience without the pr","useful":1,"cool":0},"4-k-kt3g-vk1nfK24eM2rg":{"text":"Superior Seafood has wonderful seafood dishes on the menu. Their appetizers are great too.","useful":1,"cool":0},"N2bZsVbu0VdzdqFzsmdYjw":{"text":"The service and ambience provide a nice dining experience for classic New Orleans dishes w","useful":1,"cool":0},"AJkn2b5b1hRRivBBor4zTg":{"text":"Horrible! Horrible service.  Our server didn't come by but once to take the order and dump","useful":0,"cool":0},"NSZxkrfdFqaHh7DoPArZwA":{"text":"It was a long day at work and after all the rain that day my family and I wanted to unwind","useful":0,"cool":0},"0hotNWeZH_T0EoVXLpLZ0A":{"text":"I attended a luncheon here that was pre-paid, so I can't speak to the prices. But, the foo","useful":1,"cool":0},"WwjoluU4UoTdGw4TRbjyDQ":{"text":"Please please try the Char-grilled Oysters! Totally worth it! This place is located right ","useful":1,"cool":0},"i0OQrHqnP41jFteu_KbQIA":{"text":"What a magnificent experience.  Very first visit to NOLA, Superior seafood was highly reco","useful":1,"cool":0},"HM_m8vxbo0PvmeWmjnABzw":{"text":"It was indeed a serendipity. The restaurant we were planning on was closed so we just drov","useful":0,"cool":0},"iF78a6t6bUjIttzwE5vqPw":{"text":"After my last visit to Superior Seafood one of the owners of the restaurant contacted me t","useful":1,"cool":0},"80-9lqeDZQP0gH96Cb1I8Q":{"text":"This was good. Nice atmosphere - live piano playing at the entrance.   Good noise level - ","useful":0,"cool":0},"jN1tejXobSS_U1p03WCjzw":{"text":"Loved it! Went our last night  in Nola.   Delish! Had stuffed shrimp wrapped with bacon an","useful":1,"cool":0},"9QcO-FRN0Yzdq_FWeTMzwQ":{"text":"Always a pleasure at Superior my spinach and oyster salad was delicious. The server was ve","useful":0,"cool":0},"v-q_aJ5ABtr3ZxJQgieCKA":{"text":"We stopped here while touring St. Charles. Ave---and it became a highlight of our New Orle","useful":0,"cool":0},"xaeMeZqI4jCF9aaCvWfEFA":{"text":"I made a reservation for 8 in advance for dinner with my friends and family.  Service was ","useful":0,"cool":0},"HOug3_6nbEPpSlv037BqDg":{"text":"This was THE BEST MEAL we had during our trip. And Alexander provided excellent service!\n\n","useful":2,"cool":1},"KICSKaPGJDoZf31xOiWYXg":{"text":"Totally love this place!! Our server Mike was excellent!! He gave us the greatest service!","useful":1,"cool":0},"F-xkmmdEcGENIcfuISuqTQ":{"text":"Nice neighborhood gem during our stay in the Garden District.  Great oysters, gumbo, and s","useful":1,"cool":0},"q5Fwp90eMWxg7F2sisVDYw":{"text":"Took my mother here for a lunch date because I'm trying to win son of the year. I have hig","useful":1,"cool":0},"aR3PwlccUX8dd9viAriPNw":{"text":"Worth the short drive from the French quarter.  The happy hour .50 oysters and the freshne","useful":0,"cool":0},"JAKFlp_IwsWoh0kqeIC_xQ":{"text":"In this world of matter that surounds us, there is nothing that I can add to this to make ","useful":1,"cool":1},"XZWW6Mm4aXT5hRj-z7UMrA":{"text":"We spent a month in NOLA last Fall.  This became our go to place!  We stopped in our first","useful":0,"cool":0},"AVQQaNLvQDSuMuzGs_hpNQ":{"text":"The fried drum was really solid and was a great combo with the mashed potatoes and spicy g","useful":1,"cool":1},"wAQSd7voeAb_jKnZ4Ib31A":{"text":"Enjoyed the street cars going by.  Got seated instantly on new years day just hours before","useful":0,"cool":0},"3MgeUfEO2DuCpiHhX9ftlg":{"text":"Next to my old stomping grounds/infamous dive bar Fat Harry's, Superior Seafood is a livel","useful":1,"cool":0},"-Q3alUHbizXew4ZEVGL81A":{"text":"Good Shrimp Po Boy (large portion is huge) and Salmon (entrée salad) were good...pricey...","useful":0,"cool":0},"E8PuhsxuvfHlxGzvj2MX7g":{"text":"What I got: a dozen oysters, and the crab cake Benedict. ** I did not have any alcohol her","useful":0,"cool":0},"GkWq3bkhdzDz7LR17Ok1wQ":{"text":"Underwhelming for what their reputation had built up. Greet took about 5 minutes, grabbed ","useful":0,"cool":0},"xpe_dmDslCdbO7yjVHy0uw":{"text":"Took my dad here for his birthday dinner and we had a great time.  Definitely recommend tr","useful":2,"cool":1},"Iw51Hq2chYDo1paVv6VNzQ":{"text":"FIRST OFF\n Very hospitable staff!! Called 10 minutes prior to check availabilty for our gr","useful":1,"cool":1},"A1YQPHPNyx8l0aBUrs0ZuQ":{"text":"Rebecca is the most amazing server she recommended the best happy hour items and made sure","useful":1,"cool":0},"ydji3PdIE_qJO0XhAh6LDw":{"text":"I hosted a dinner party for 35 on Monday, Oct. 3. Aimee Rowland helped me with all the pla","useful":0,"cool":0},"pwgRgOLXBLaymuSzBe5zDQ":{"text":"Delicious oysters by the dozen. it's busy so prepared to wait or sit at the bar like we di","useful":0,"cool":0},"XVhhTtyCk60SFI0aUvbt0w":{"text":"Outstanding service and food.  Nice ambiance.  Ask for a front window table.  Went for lun","useful":0,"cool":0},"q6RwIAuXfh-da5rzob9vqw":{"text":"This review is way overdue!!! This place is by far the best oyster place in Nola!!! I had ","useful":2,"cool":1},"tHeWwwUFNQpCU8jF05oaaA":{"text":"Pretty good place. I arrived in time for happy hour and the sparkling rosé was EVERYTHING.","useful":0,"cool":0},"SCYCzAyQsLlAKMLAnt18Gw":{"text":"I had high expectations and was looking forward to a great seafood meal. Jerrod was possib","useful":0,"cool":0},"KjmrJrkk-2kOR7erCoPSVA":{"text":"A nice place in the grand scheme of things. Think high-end corporate restaurant, not mom-a","useful":1,"cool":1},"27idZMnMXDFWid5nDfxReQ":{"text":"This was probably our least favorite meals on our trip to New Orleans.  It was all fine bu","useful":1,"cool":0},"tvAgLT6jgjh9tEduA5Y8eA":{"text":"Great experience with my parents, awesome wait staff and delicious food!\nWe all shared (gr","useful":0,"cool":0},"FHCSS8Nzfga2hR38dC_FiQ":{"text":"I went to Tulane and got really spoiled by New Orleans food while I was there, so my husba","useful":1,"cool":0},"YmkLNneH3XSQdXgRilAagw":{"text":"Good food but not worth it's weight in cash.  Came here for Mother's Day and the menu was ","useful":0,"cool":0},"p1IEKq6m3Mu8gdOMZVzlAg":{"text":"I recently did an update but the other night I went to the late night happy hour with a fr","useful":5,"cool":3},"PEmH0FD7zhKD1PaJ0UNB0Q":{"text":"The restaurant was a short walk from the B&B and we very pleased. I had the Fish Marigny (","useful":0,"cool":0},"mTbk__DxtxRyyUq_tmTCKg":{"text":"OMG, First off this is one if my favorite spots for drinks and chargrilled oysters! Came i","useful":0,"cool":0},"VNZ89G6WPcMW6OhKofuhQw":{"text":"This is the best meal we have had in Nola. had superior waiter, Brandon, who was very atte","useful":0,"cool":0},"T4yGeofhK7byMD2Ud38Aag":{"text":"So, I give this a 2/5 stars bc:\n\n1) the hostess was rude. Like so rude I wanted to turn ar","useful":1,"cool":0},"kcxkfcr_91rTguU0GyX1kQ":{"text":"My absolute FAVORITE place to eat in New Orleans. Everything in the menu is fantastic, inc","useful":0,"cool":0},"RF_7EczNX9iolmEkXHMKMg":{"text":"Always great food and amazing service. You have to try the fried green tomatoes and oyster","useful":0,"cool":0},"zcYhPNGi9KD6EPE1LqKf_g":{"text":"My wife and I were in town for the weekend and decided to go here as it was close to where","useful":0,"cool":0},"Pn_W2pholjaWih_-Qc3_Bw":{"text":"A good friend and I was celebrating our birthday with some friends and family. First of al","useful":0,"cool":0},"jWJFw2s9xQsZ5ZW9ID5BVw":{"text":"Food was delish- best carrot cake I have ever had! Just went for a 30th birthday party- we","useful":0,"cool":0},"sIOQkr5Y3GzODr-m_qTbyA":{"text":"The oysters are excellent!  I like that if you order a dozen oysters that they are split o","useful":1,"cool":0},"ybyWxSVdNG549dzvhdeOFQ":{"text":"Had light lunch with the wife. Had mimosas, fried oyster salad, and the scallops appetizer","useful":0,"cool":0},"_GjnmdBFIksoN4EDMl8f5Q":{"text":"The service was okay. Our waiter seemed distracted the entire time. We were sat in a booth","useful":0,"cool":0},"MABxs1bpdzR_uduwzd1qng":{"text":"You know when you get to a new city and you are searching for legitimately the best food t","useful":0,"cool":0},"sAsOwJHeMLl9U4Q8dTnQ_Q":{"text":"I make it a point to always visit Superior Sea Food & Oyster Bar when I'm in New Orleans. ","useful":0,"cool":0},"AGdGSuw-QTEqhLol3VHzXQ":{"text":"Disclaimer: I wasn't really that hungry because I had a big lunch, but what I did have was","useful":0,"cool":0},"BsXN4Y9mTOXyB9IW3XbzRA":{"text":"My husband and I went there for dinner tonight and it was amazing! Connor was our waiter. ","useful":0,"cool":0},"D4AynlDKt-0OCXDWMci_vA":{"text":"Wonderful food and wonderful service, very kid friendly and we had a great waitress named ","useful":0,"cool":0},"oYtDbmLLux9NX-WhdLbcjg":{"text":"Super nice place without the fancy pants price tag!   Made the decision to leave the Frenc","useful":0,"cool":0},"rGSt7BJwddIweN9eQLC4iw":{"text":"JOLIE was our server. He was amazing. The food was Incredible. Best meal I had during my v","useful":1,"cool":0},"-QD74cZDpw-SeWBVUrSUMw":{"text":"Went here while on vacation in NOLA, and I really enjoyed the experience. had 4 pounds of ","useful":1,"cool":1},"VgICzEd_y-R-Uxs6bY9qGQ":{"text":"I planned to eat there by myself real quickly but they could not accommodate myself. When ","useful":0,"cool":0},"Dnr0ggIu_47S11dNdSMIbA":{"text":"This was overall average and personally I don't feel was worth the price. \n\nLet me prefere","useful":0,"cool":0},"32oKem8mU5zqK1cnCbWrDg":{"text":"Where to begin! We have been in the city for about 4 days now and have tried all sorts of ","useful":1,"cool":1},"tsYh4I0MCifx2ZKWEsM38w":{"text":"Great Menu\nLots of options\nEXTREMLY overpriced (possibly to keep the undesirables away)","useful":0,"cool":0},"zVUgPqpgdartl_fzp8iBMw":{"text":"Although it was street parking along a busy street, this place did not disappoint. Went fo","useful":4,"cool":4},"Fgx-l5xVAM6emmomYZCXYQ":{"text":"What can I say, everything was delicious. Beautiful atmosphere and great food. Get the car","useful":0,"cool":0},"JoQnP3VfAnb_3gKaV2PhcA":{"text":"Went for a party and we were there for almost 4 hours. Service was so slow and i wasnt imp","useful":0,"cool":0},"6wgZFSbIsITZbOqPf8vaOA":{"text":"So yum. Definitely worth the waitlist \nFirst a Moscow Mule  Not too strong \nThen raw oyste","useful":1,"cool":0},"X_IngLg82Fl-xLjyfl_HtQ":{"text":"We will be dreaming about this place for years to come. We scored a seat at the bar right ","useful":2,"cool":0},"5olU2iJtO-nynS0Yob9JCw":{"text":"The food is so good, we decided to come in to eat the restaurant I was so impressed with t","useful":0,"cool":0},"jk53SDfXx6hiKh6VcmxgKA":{"text":"Had a lovely lunch of Fried Green Tomatoes, Fried Oyster Salad and Frosé. Great food - exc","useful":1,"cool":0},"klt2Fxb82JwLRdSibHRa9A":{"text":"LOVE this restaurant. Get the frozen mojitos 2 for 1 during happy hour & 50 cent raw oyste","useful":0,"cool":0},"qVHhLUsH9vdW5rGXyHlkGQ":{"text":"Excellent flavors and attention to details! As a super foodie, I spend about an hour pouri","useful":0,"cool":0},"uvnlkPX8E78Ido9faQWUQg":{"text":"This place was amazing. The shrimp salad and gator bites hit the spot. Our walking tour go","useful":0,"cool":0},"IfMOgKluFQXDap7m2E3GLQ":{"text":"WOW!\nNOLA has an expert in the oyster business. Alexa was our server and was great.  The f","useful":0,"cool":0},"PHBr7PgZycGKFt20ZZ1a-A":{"text":"This place is huge, seating hundreds. It also has multiple TVs. Not the usual restaurant f","useful":0,"cool":0},"Zt5Nd1Gy-QIwwpkJxJq7Tw":{"text":"Amazing and super friendly service.  Happy hour is a must at the oyster bar.  Very enterta","useful":0,"cool":0},"cEnObruQn4zYTu7M2tGO4Q":{"text":"Always a good place to go!  Fresh oysters, nice warm environment, good bar, and really wel","useful":0,"cool":0},"FqEb74PBukamzeLEYzgCcg":{"text":"I've been to Superior Seafood twice. First time I ordered the Salmon Salad, which was exce","useful":0,"cool":0},"z4rbXCO3D4AlztOkongolA":{"text":"Loved this place for Sunday brunch. Oysters were delicious, drinks were great, food amazin","useful":0,"cool":0},"Cxh4h7YRLYqhd0KNDRzsDQ":{"text":"Absolutely delicious! Shrimp and grits are to die for. Great job accommodating a crowd of ","useful":0,"cool":0},"TEc_TnAhlYIFVB61jZ16BA":{"text":"traditional creole food; excellent service; went there for group dining event; full bar; n","useful":0,"cool":0},"ebpyG_94z53xkwUnXzkcOw":{"text":"We had a day trip to New Orleans and we chose this place for our lunch date! We actually l","useful":0,"cool":0},"WPl_WZGlKrpe68wGkA_r9w":{"text":"I enjoyed the raw oysters at the oyster bar several times during my week long visit. When ","useful":0,"cool":0},"B5JmYgs75yJDQvxZ1LcNww":{"text":"My first experience here was tonight: \nWe came here for a bachelorette party dinner and I'","useful":1,"cool":1},"riyyjoh-dyXkQJq4KbIonA":{"text":"Very disappointed this time. We have been coming to this restaurant for many years but the","useful":0,"cool":0},"2nVEl4dC_GSveG1LT6uzKg":{"text":"Came here to try the happy hour 1$ oysters!! Doesnt that sound like a good deal?! Well.. I","useful":0,"cool":0},"UDVIWbvEK3mroZwEe4RLwg":{"text":"This restaurant is definitely turning into a family favorite for us! The service is always","useful":1,"cool":0},"D_j2mhg-qe0CneHWIVltMg":{"text":"I came here for a graduation dinner with my boyfriend's family and sadly, was not impresse","useful":2,"cool":2},"FWvpxIIwaUXzP_dzemjm7Q":{"text":"Had a really lovely dinner here on a Saturday night.  Not too long of a wait.  We were sea","useful":0,"cool":0},"pCzwj3WIe6ELFKIStGfuZw":{"text":"We had always assumed this was a touristy place. Nope! Delish! We went for brunch and enjo","useful":1,"cool":1},"UWFHqUYJN8BYgX7Atpkt1g":{"text":"Best food that we had in New Orleans. service was great ambiance was great and the price i","useful":0,"cool":0},"vkBSD28VoS30zwc96tMC9Q":{"text":"We ate here after the Lundi Gras parades with a limited menu but were very pleasantly surp","useful":1,"cool":0},"6Qewp9o3hYpqNC7pikfV1A":{"text":"I love this place. It's a beautiful restaurant and I've never eaten anything I didn't like","useful":2,"cool":0},"xzjR0o07fJFZw5-WdER-gg":{"text":"The service was excellent at the restaurant & they didn't have us waiting long for our foo","useful":0,"cool":0},"fVm--qZ26auGP4RT091D5Q":{"text":"PHENOMENAL! Our waiter chris was the best- surprisingly the coffee was out of this world! ","useful":1,"cool":1},"ODOq8sw-aInEaRmK78HtaQ":{"text":"SHORT VERSION: SERVICE WAS AWFUL!!! I understand we dined in during Jazz Fest and restaura","useful":1,"cool":0},"3CoCBo2RVT_lVxtUHVkCJg":{"text":"My top 2 spots for raw oysters and number 1 spot for chargrilled oysters, for now.\n\nLove t","useful":1,"cool":0},"HXeqVDF14Wr6IdoKXW8PZQ":{"text":"Solidly mediocre.  Stale biscuit with dried out chicken and dab of pasty gravy. Service eq","useful":0,"cool":0},"DEZvdILHt3nIMhAz76u0jQ":{"text":"Where Superior Seafood shines IMHO is value - prices are quite a bit less than the upscale","useful":0,"cool":0},"sTVYW4bTHvHmgWQzeXevwQ":{"text":"The best hospitality and the best oysters you will ever get in New Orleans! Home to some o","useful":2,"cool":0},"j78cjEGh6LIr5R1RBqsZCQ":{"text":"I had a religious experience while eating the Crawfish Mac n Cheese. The service was impec","useful":0,"cool":0},"PFS-QaEldMvkKK64Ytw0AA":{"text":"This is my favorite place to get seafood in New Orleans hands down! Their oysters are amaz","useful":0,"cool":0},"80M22nV8jwVUjtNEuckw3Q":{"text":"Excellent oyster special 4-6:30, $0.50 each for a dozen!! We had two delicious enters and ","useful":0,"cool":0},"OQIiWoPxeojdwJKaE5llFw":{"text":"1 Star for our super awesome waiter.  \n1 Star for how fast our food arrived. \n\nMy friend a","useful":0,"cool":0},"Pyc0wBEwHDQVSfZI7jZcXQ":{"text":"I am pleasantly surprised to report that I thoroughly enjoyed my time here at Superior Sea","useful":12,"cool":11},"ohO0Od4i2iA0c1fIxYMR-A":{"text":"Great place, especially for out-of-towners! Definitely more fancy than the good ol' hole-i","useful":0,"cool":0},"E55c_AvuIYtTZRPwWWI2_g":{"text":"Nice restaurant you can make reservations. They have live piano music and performer during","useful":0,"cool":0},"2REVrMhmZxDSp6vkopzuhg":{"text":"We stopped here during Mardi Gras week. Of course, it was very busy and took about 40 minu","useful":0,"cool":0},"Bqkv2LYUccKhjDJlSGve4A":{"text":"I am not a fan of Superior Seafood, but I'm also not a fan of the original Superior either","useful":0,"cool":0},"nCFISmP8oQhNyJ2gRcdBvw":{"text":"Food was amazing - and, the drinks were on point. We arrived for our reservation late - 40","useful":0,"cool":0},"IHUdqqTQ28d8ApUDneZv6A":{"text":"So delicious. I wasn't feeling too wonderful earlier in the day. I hopped over to Superior","useful":0,"cool":0},"XbQfCVCqqjP_8gVKtA6Ryg":{"text":"LOVE - Char-grilled oysters. Complimentary Valet parking. Great service.","useful":0,"cool":0},"_9XG0gwX7weuv2I4xtMiew":{"text":"Easily one of the best restaurants ever! I lived in New Orleans for four years, and this p","useful":2,"cool":1},"QTsWUjxWivuFMvcym89pTg":{"text":"Food and libations were excellent. Service could have used waaaaaay more personality and m","useful":0,"cool":0},"P7xPyaZuMVqtDSCr0_xKLw":{"text":"Go for the Happy Hour.  Sit at the bar.  Stuff your self with a couple dozen Amazing oyste","useful":0,"cool":0},"IGn8aaQxgVB4zOkbyAZsDA":{"text":"It's taken over five years for a new restaurant to occupy the big gaping hole left at the ","useful":2,"cool":1},"FtrWMPKYk142yzrKY9sLJg":{"text":"How is it that I never review the places I am duchess of? Maybe I don't want the secret ou","useful":2,"cool":1},"gXs75hHnUtiYBp3k3I8nPw":{"text":"Drinks are great- love the frozen pomegranate mojito. Excellent happy hour prices on drink","useful":0,"cool":1},"d1WPx_QisHszS6q7rN8IHw":{"text":"I hadn't been here a while, but I suggested it for an organization meeting because I remem","useful":4,"cool":2},"xsR3ZqF7mbyaJ0EEY6avjw":{"text":"Sitting outside in the Garden District of New Orleans is incomparable especially when comp","useful":1,"cool":0},"C7hAeFQxf-9fteCthmVW1A":{"text":"Patrick saw this from the streetcar when we were going into the garden district, and we de","useful":1,"cool":0},"gMduO0umgNpcvzcG6ctlkA":{"text":"The food was great, and service was impeccable, the bread and butter is truly a great star","useful":1,"cool":1},"yI_KPFwyT56d4VfZzGjXHw":{"text":"Terrible terrible service. Food was fair but lack of service ruined the meal. First the th","useful":0,"cool":0},"izsCNKycH9Jsfz7IiTQs8g":{"text":"I went here for happy hour with a group of friends. I thought this place would be unassumi","useful":0,"cool":0},"wSU6L9Z94q9runZNBurxjQ":{"text":"Such a great restaurant with the best service! Alexander was an AMAZING waiter! My mom and","useful":1,"cool":1},"4tQRTFOrgNGtKwqVubPYZQ":{"text":"Superb.  If I could give more stars, I would.  Excellent seafood.  Best oysters and Crawfi","useful":0,"cool":0},"XUEKBEZN-wZeTOX2Re1VUQ":{"text":"Cannot beat their oyster happy hour.  50 cent oysters shucked in front of you??  Amazing. ","useful":0,"cool":0},"zr5OaeAlglV7RLZSBS1bLA":{"text":"We went on a Thursday, sat in the dining room, and shouted to be heard.  Superior was busy","useful":0,"cool":0},"E700wg2FBR63RHRHAMg43g":{"text":"Delicious food!! Great atmosphere!! Awesome staff! My group had 6 ppl in it, then right wh","useful":0,"cool":0},"uQBeBM2SkmwFtQNydxYLSQ":{"text":"I've never actually had the food here but my friends who have all say it's good. \n\nI go fo","useful":3,"cool":1},"dvBEFzq2EsPs2UZrrcXVoA":{"text":"While researching places to eat in New Orleans I ran across a Travel & Leisure article tha","useful":2,"cool":1},"N6Uh-RBzE3xoJC0-VRSbWQ":{"text":"There are two reasons why I keep coming back to this place. 1. The frozen blueberry mojito","useful":0,"cool":0},"sA_JqRbiGUMI_gujf1FRjA":{"text":"This was a good place to meet for lunch with my high school friends from the past   We had","useful":1,"cool":0},"eJZS-Vn08kkIV0NRHe2OOg":{"text":"I am not a native to the area and had to rely heavily on the word-of-mouth promotion that ","useful":0,"cool":0},"LQY7Y_k4szDV9E6cPTg_SQ":{"text":"Excellent steak salad and jumbo grilled shrimp in a creamy Cajun sauce; perfect execution ","useful":1,"cool":0},"I_o40a9o2Wn64C7A3ZXJ1w":{"text":"Excellent food and service...Rebecca was just wonderful . The food was exactly as she desc","useful":0,"cool":0},"y1GBD7grxRaYwdEFS7sdiw":{"text":"Mmmm... crabmeat stuffed mushrooms*drool*... so succulent, tender, and full of flavor. The","useful":3,"cool":3},"b6iYXf4GwiYLzZIq42Coig":{"text":"Its good to have a seafood restaurant this side of Uptown, but it is pricy.  If you are wi","useful":1,"cool":1},"LaocgoNBmmot80MUq1kaRQ":{"text":"The only place in NOLA that has decent service. Food was very good. After a night of drink","useful":0,"cool":0},"bU4R25SD7m50kwyFuivqdQ":{"text":"We went here for a graduation dinner and it was a wonderful experience! We did not have to","useful":3,"cool":2},"6fV47P6vGK0Y4ijANm3JoA":{"text":"For the good news and the reason for the three stars-oysters, salads and mojitos-one star ","useful":0,"cool":0},"cGa4BioSxItSC8RKUJsrsQ":{"text":"I went for the preview lunch today, and the service was great although the waiter said tha","useful":9,"cool":2},"HMxo4206FDixKSShhfInXw":{"text":"Food was incredible. We ordered the crabmeat stuffed mushrooms, Po boy, gumbo everything w","useful":3,"cool":1},"4YwmnzGswkIefiVQADf9nQ":{"text":"I really enjoyed this meal. The weather was atrocious outside and a lot of businesses didn","useful":0,"cool":0},"sZiFQBR48CTrfgHLzmYDwQ":{"text":"So I heard about this place and their deal on oyster during HH. I am an oyster fan and onl","useful":1,"cool":0},"hgIJNjqSniqXVmQS1ukf5w":{"text":"9/7/2012 Superior.....NOT. My first time here was pretty good. An out of town friend and I","useful":0,"cool":0},"BZlEuggnEvphn1kDX8EYvg":{"text":"My fiancé took me here to Nola to celebrate our engagement. He loves Superior so that was ","useful":1,"cool":0},"CCF1qy8SqbnJlZx3MugLVw":{"text":"Underwhelmed. Food was fine. Service was awful. 25 minutes after being seated before I had","useful":2,"cool":0},"E3thFfKVs-d-d0cLyAG4JQ":{"text":"Came on a weekend with a friend. Wait was okay for it being a weekend during the night aro","useful":1,"cool":0},"bq7kEhi6z3lBo_A_STM41w":{"text":"Rehearsal dinner FTW! \n\nAfter rehearsal at the church, we shuttled over in several cars to","useful":1,"cool":2},"5DyymCafVVQ4CAwHNCB5yg":{"text":"I dined here with my friends I was visiting while checking out New Orleans. They love this","useful":5,"cool":2},"FpfuNOQ5087oQ4SriAaLGw":{"text":"Great food!!! Slow service which i expect from an ordinary dine in restaurant. The servers","useful":0,"cool":0},"6CAosyx3c5xuSWtzTT_5yw":{"text":"You can't go wrong here. It's a little pricey but we had a great experience. The chargrill","useful":0,"cool":0},"BXzii-zOHUp9Bsewa_QWNg":{"text":"My server was pleasant but overworked and too busy to cater to our table of two. The Oyste","useful":0,"cool":0},"tMo4aXHazmmbrccJwiZqLQ":{"text":"Char-grilled oysters and scallops were fantastic and the service was very good.  Would go ","useful":0,"cool":0},"4mOw6vz5xZuUyvm5ql_9Dg":{"text":"Impressed with most of the food and beverages but the service and ambiance were not on par","useful":0,"cool":0},"acy8XGhU5ESOipGlivD0Vg":{"text":"I would give this place a 4.5 stars. I tried their char-grilled oysters and Cochon de lait","useful":1,"cool":1},"Mm64S9X9KECVp8iO5XqACw":{"text":"WE FELL IN LOVE. Oysters, champagne, Escargot, and crawfish Mac and cheese was all DIVINE.","useful":0,"cool":0},"b2ZReIG76IOiZmsaviRdgQ":{"text":"We stopped in for lunch and it was great! Favorite was the crawfish macncheese. Nice atmos","useful":0,"cool":0},"AhpGB79bcIduZD3hNj-zYQ":{"text":"Came here for the second or third time and it's always amazing! Great service, comfortable","useful":2,"cool":0},"QLDGaNkjGsKpjyY3A5mzcg":{"text":"Keli and Lainie are the best bartenders. Amazing whiskey selection. Rigo works it!!! Thank","useful":0,"cool":0},"N7D5n5cL1dotH_Ys7Ur6oQ":{"text":"A friend and I went to the parade last night. We stopped in the restaurant to get to go fo","useful":0,"cool":0},"jHgAEGLAbrw0hMePli-aLQ":{"text":"Fried Crab Claw at Superior Seafood were the best appetizers I had yesterday. The claws we","useful":0,"cool":0},"06tpRt3K3S3FQJlkJD9wrg":{"text":"The crawfish cornbread is worth eating here.  I also had shrimp in grits....good but there","useful":0,"cool":0},"JgiPIS9KLkWVlo7GdgikDA":{"text":"Terrific place. Classy, unpretentious, great staff, delicious seafood, reasonably priced. ","useful":0,"cool":0},"Y2wnq4cfjOWykoXquRjj8A":{"text":"It's always difficult to balance service, food, ambience and value in figuring out how man","useful":1,"cool":0},"dkUxe6HzwDqymZcinyNszA":{"text":"Great location. Beautiful for guests visiting in the garden district/uptown but I'm giving","useful":0,"cool":0},"7TjHBW8HVdT8gLOpQkNCRA":{"text":"Amazing oysters on the half shell and grilled! Beautiful location and view from the terrac","useful":0,"cool":0},"kKVASFBBHxoSCpiRMcAYhg":{"text":"I've been to Superior Seafood twice, and I can't help but to order the Salmon Lafitte! Adm","useful":1,"cool":0},"5wCYZPlhmXEErbAuwDhehw":{"text":"I usually write more but I have written several updates before this so I am keeping it sho","useful":4,"cool":2},"ElC21XW6x2YGTvZR-Om3TQ":{"text":"All I have to say is Wow!  Drinks were good, the Orleans gin made with Hendricks gin was a","useful":0,"cool":0},"m07yPllz7LwC59AWlAD2Fg":{"text":"This place is awesome! Love the vibe And there was live music when we went. Also a wedding","useful":1,"cool":1},"Tx-gSK8i2-DzG47IKUCOwg":{"text":"We started with the chargrilled oysters, which were absolutely delicious. For main dishes,","useful":1,"cool":0},"u5ZnBptwOCCY6ABwNC1mFQ":{"text":"I love it when I can't finish my plate because it is packed with delicious food! The staff","useful":0,"cool":0},"1Aw9zNO5Q2u7C8aa2VgFyQ":{"text":"Loved everything about this place. Atmosphere, ambience and style hits you immediately. Ou","useful":1,"cool":0},"aDHmZv9GtGVD_AsCKnkKag":{"text":"The food was good. There are only 3 stars because the service was slow and the restaurant ","useful":0,"cool":0},"Fq5BaSC4BQYjoGL0obvbMw":{"text":"Ummmmm...wow!  Located on the corner of the Garden District in New Orleans, I couldn't hav","useful":0,"cool":0},"A2AiCMvQRrCmMiv55El4QA":{"text":"Before I start, I'm mainly basing this review on the oysters on the half shell, which are ","useful":1,"cool":0},"8bUXhL9XGc2JfiX7YkoClQ":{"text":"One of my favorite places to go for brunch as the food is really good and so are the drink","useful":4,"cool":2},"m8GoWW-JgmRijHdUoNxHGA":{"text":"As soon as I walked in i knew I was in for a great night. There's a piano player as soon a","useful":3,"cool":2},"3_ht-nnH0YU6xi3DhwagCA":{"text":"Our waitress Hannha was attentive and had wonderful recommendations.    The food was fanta","useful":0,"cool":0},"KFbqei2urQIf9ngDkPjUkw":{"text":"This was my 3rd visit here but 1st time for lunch. It was fairly empty..right before this ","useful":0,"cool":2},"EWp7BNglJh9w_qBYEpXeAg":{"text":"We had an amazing meal!  It was crowded, but the wait time wasn't excessive.  We started w","useful":0,"cool":0},"670lTgKkNY6ITdtVwjuvTQ":{"text":"Tonight was excellent! Food, service, atmosphere, everything. The restaurant was packed bu","useful":0,"cool":0},"KSa6WyDmjQKH17pgURmFIw":{"text":"Fun atmosphere, very much a great introduction to the New Orleans feel. We came with a gro","useful":1,"cool":1},"vPl1UVN7H6zxUFKrWZ4L7g":{"text":"Great atmosphere, and most importantly...great food. Here's what I did in chronological or","useful":0,"cool":0},"8l4R31455FUfo3_6vVyn0Q":{"text":"Excellent food and good vide. We ordered the crawfish mac and cheese and burratta bruscett","useful":2,"cool":1},"XSARfsdzYn1fM9HIXZtDZQ":{"text":"Frozen mimosas are good and fairly reasonably priced. We ordered the oysters Benedict and ","useful":0,"cool":0},"m6uxnVyy8-OVL0wkBXH23w":{"text":"Loved this place. Oysters were fresh and fantastic. Very accommodating and understanding o","useful":0,"cool":0},"tc7jAxkritAJSTJ1wKko_Q":{"text":"Why is Superior so superior you ask? \n\nPrime location on the streetcar line on the corner ","useful":14,"cool":9},"MOpZIIvEy-doh1xqeISJJw":{"text":"Was in New Orleans for a week and ate at many places. This was the worst. Starting with a ","useful":0,"cool":0},"7nZXMfz6fHN32IadsYAb-A":{"text":"Awesome food! Awesome service! We enjoyed chargrilled oysters and fried alligator appetize","useful":0,"cool":1},"mPcefuZNO60cjmAghlSOtQ":{"text":"Food-4\nService-4\nAmbience-4\n\nThis is my boyfriend's favorite place to eat, and I guess I w","useful":2,"cool":1},"uMlhE0096ffVifeN9DsALA":{"text":"Great service. Blackened catfish and shrimp and grits were terrific. Very nice atmosphere.","useful":0,"cool":0},"OuwIlgLyRY79BiBNBR9h6Q":{"text":"Superior Seafood surpassed all expectations for me. After living in New Orleans for 3 year","useful":2,"cool":1},"skLVuVU62w82JSr4Ir8YHA":{"text":"Awesome place for lunch! Fresh bread served warm with butter to start. I had the Pasta Vie","useful":1,"cool":0},"urVJj51ZzYNV47FeK82MbQ":{"text":"We were wanting oysters and it was pretty great! This was my first time here. The service ","useful":1,"cool":0},"wKt1pQbybO8DWWHi2KyWIg":{"text":"I've been back to Superior 3 more times since and they continue to impress me.  The oyster","useful":3,"cool":0},"x4TSTf5IbZICUTHq_hJyVw":{"text":"food is not very good honestly. kinda disappointed. chargrilled oysters are the redeeming ","useful":0,"cool":0},"NwLZL7s-J0zQCpc3r2zjGQ":{"text":"Nothing very impressive to me, but my friend loves their oysters a lot! Environment was ni","useful":0,"cool":0},"hoG0BnyEDAzmUUvHoZlGpg":{"text":"I had food from superior seafood previously at a seafood festival. So, I had high hopes wh","useful":0,"cool":0},"Ocdjh_hrKaAzhVBdNyrqYQ":{"text":"We went based on the good reviews. Overpriced & overrated. It's not authentic New Orleans ","useful":0,"cool":0},"4wmcgAEMINOqwa1QBJDlVw":{"text":"One word: Oysters!!!!! If you love them, this is a spot to definitely hit up. They have it","useful":3,"cool":1},"-4XChzQD3m0G6FVpL29Bug":{"text":"Went here with my family, and we had the fried crab claws and fried green tomatoes for app","useful":0,"cool":0},"JshJWU3IFfdtC7x_iwVYXA":{"text":"I don't love seafood, but I enjoy it enough. We tried to go for dinner and there was over ","useful":1,"cool":0},"hZ384n0W3qZUS2o8I_nmUQ":{"text":"This is my go to place for raw oysters and happy hours!\nLet's start with parking. Parking ","useful":1,"cool":0},"IZN2SJlTQVolf_aXEiEabw":{"text":"This is as good as it gets...Guys..as you know..I enjoyed it..\n\nOysters Baby!!!","useful":0,"cool":0},"M8CoyoLxsPYsnFJyJjyEtg":{"text":"We stumbled upon this place while riding the street car and figured we grab a pre-dinner s","useful":1,"cool":0},"k8_oycP0V_MZcctzP2xioQ":{"text":"No! No! No! Came here for the great yelp reviews and was a complete waste of time. The oys","useful":1,"cool":0},"ejgLX6X808cdmVUKa-2Qsw":{"text":"Bomb happy hour! 4:30-6pm 50 cent raw oysters and 2-1 drinks! Can't beat that! \nA lot of t","useful":1,"cool":0},"5sa53DbMXsh3VsZKo9DwPQ":{"text":"The food was great. The service was great. It was really busy and noisy but they honored o","useful":0,"cool":0},"_VZvU6Kpgg5--qjZo8aprw":{"text":"A favorite time to go to Superior Seafood is for Happy Hour Brunch on the weekend.  They s","useful":1,"cool":1},"LroEcZATDteSATuvrbMXrQ":{"text":"Outstanding seafood restaurant.  We had the Angles on Horseback, Fried Green Tomatoes with","useful":0,"cool":0},"P4ONIDvxjvlMyKeE-jbhGA":{"text":"My husband loves oysters and these did not disappoint!! They were huge too!!! Alligator bi","useful":0,"cool":0},"50dtqsPL_-z1fEuhoNVFIQ":{"text":"Terrible service, decent seafood. \nThere are better places in New Orleans: these guys need","useful":0,"cool":0},"mUqMcbCNX1sgjNdgiaRWEw":{"text":"Came here for a few dozens of oysters during happy hour prior to having dinner. Hubby had ","useful":1,"cool":0},"YYISgIv02U_5BXjB65oHbA":{"text":"Our best dining experience in New Orleans. Usually we go by Yelp reviews. This time around","useful":1,"cool":0},"56TPI11SF3v9RHRkYtzxxA":{"text":"We went here to watch the parades. Great viewing spot. We were told that we could buy a $1","useful":2,"cool":1},"TPap4E6QER4W0RAtzihmhw":{"text":"We didn't plan on going to this restaurant but came across it while walking down St Charle","useful":0,"cool":0},"P9_X2MqrBrkyggynPjjEdw":{"text":"We had a wonderful dinner with friends at Superior Seafood with excellent service provided","useful":2,"cool":1},"S3uJIfOz-KTWeNAjMi6ZqA":{"text":"It was fine. Reminded me of\nPapadeaux in Houston, but not as good. Service wasn't very goo","useful":0,"cool":0},"AinGpCknWMDERW7ZWYLoEA":{"text":"Great happy hr! $0.50 raw oysters, $3 draft beers (Urban South, NOLA, and Port Orleans), a","useful":0,"cool":0},"9LnZAPBq0QLpkmarrn_KbA":{"text":"Awesome spot to satisfy oyster cravings especially during happy hour! This short review an","useful":5,"cool":2},"bU2A724DU2kCma3Z4Q-VhQ":{"text":"In town for most of a week and a friend recommended Superior. My wife I I came here the fi","useful":2,"cool":0},"DzcWuDpiBtWETfS8DTc7PQ":{"text":"I can't believe I haven't reviewed Superior Seafood & Oyster Bar yet! It's located on the ","useful":9,"cool":2},"nu2tcuEV2MuOZKWj1LeJQQ":{"text":"First time there today.  We stopped in for lunch after 2pm. We first walk in and there is ","useful":0,"cool":0},"5FWlhV-sgUM94jecokK7Ew":{"text":"This is a beautiful place.  The service was excellent on our visit for lunch but the place","useful":1,"cool":2},"CyCz6-TfM79J_6movqSXHw":{"text":"As a new resident of New Orleans, I've been trying to avoid returning to too many restaura","useful":0,"cool":0},"w7VdJwgTrPWQyWGAAHeh7w":{"text":"A beautiful restaurant with the option to eat indoors or on the patio. We, as well as a ma","useful":0,"cool":0},"0c4N3dAlPapzX28M04GyCQ":{"text":"Came in for brunch this weekend with some friends-- had issues from the moment we walked i","useful":0,"cool":0},"DDgqW1LP2f0CeMiOrvUUfQ":{"text":"The best! Their regular and late night happy hours are definitely worth checking out (beer","useful":1,"cool":1},"uOC1j1TRtVn0HnOIKrwfVA":{"text":"Unfortunately, if you are displeased with your food at Superior Seafood even after one bit","useful":0,"cool":0},"ziVcxV7TPKRxhZdbtKXSgg":{"text":"LOVED THIS PLACE! beautifulLy decorated . Fantastic location. Great service. The Bisque wa","useful":0,"cool":0},"YLyrjlA6BIiufhgnjqOolA":{"text":"This restaurant was walking distance from my hotel. So i decided to give it a try. Man I'm","useful":2,"cool":0},"BL8IDaMtD3OsA_tLevkrIA":{"text":"complimentary Valet! \n\nIt has been awhile since I found a place with great fresh tasting r","useful":1,"cool":1},"SJQ0pbxc248xiG1xf_77DQ":{"text":"Hello, 50c oysters and half-price house wine during happy hour! The house wine is already ","useful":3,"cool":0},"usWg9KzD2hjXNjLVOJqyCQ":{"text":"Just two words to summarize my experience: horrible service. Thank the incompetent hostess","useful":1,"cool":0},"PZBGomJ6W0S4Fw8X874VTA":{"text":"The 4 of us arrived 40 mins before happy hour and started with the charbroiled oysters, es","useful":3,"cool":0},"AR4g6y3StPZYn1MHug1VbQ":{"text":"Delicious, but quite pricey, even during happy hour! \n\nThe best thing about this meal was ","useful":1,"cool":1},"pFbqFGQ_yV5i6vTIVknyTQ":{"text":"I had the Ettouffe here and it was very satisfying. This was also one of the bars that did","useful":0,"cool":0},"ubD6gcd6cOVmuFr-zS_ZqQ":{"text":"Absolutely recommend! Everything we ate was delicious. I recommend the Scallops with Orzo ","useful":0,"cool":0},"IiSFeMmzxjfY2lgo3BpXhg":{"text":"My boyfriend and I go here all the time! Don't know why I haven't reviewed it yet. Fantast","useful":0,"cool":0},"FJi-E6tC3lE3QOGs84PP6A":{"text":"Had a wonderful night at this restaurant. The service was wonderful, the waiter knew all t","useful":0,"cool":0},"oPZ3NnoPIIMrwPVOPyEDBg":{"text":"Loved the sensational shrimp salad. The best salad i have ever tasted! The place is really","useful":1,"cool":0},"OCCeC_K9i0Kk5rvNsjVcoA":{"text":"Sunday brunch was fantastic! Live music, the best service and delicious food and drinks. W","useful":2,"cool":1},"oebeJwyXJrsgyTbnUUjxvw":{"text":"Really amazing bloody Mary's and great brunch menu. We got the crab cake Benedict, the Fro","useful":0,"cool":0},"d5uNr3Io4BAasXunWkheqg":{"text":"Disappointed because my favorite happy hour restaurant closed.  This came recommended from","useful":2,"cool":0},"jAjzJAnbsYYW1ngIS2ipag":{"text":"After eating in the French Quarter for 2 days this was so welcoming. The atmosphere was gr","useful":0,"cool":0},"EoGtO__ubo5rWqq3-kd6Fw":{"text":"Ate here with some relatives who were coming in from out of town. We came for happy hour. ","useful":0,"cool":0},"ebDs7vRMCmTwEb1-ngE7-Q":{"text":"I always come for raw oyster happy hour. I've been here previously but never wrote a revie","useful":3,"cool":1},"edOTR1fzOSH_mzsJcrKIGQ":{"text":"My friend and I go to NOLA every spring and we always eat in or near the French Quarter. M","useful":0,"cool":0},"gK0qY3CzSceHQRk91lwKOg":{"text":"Exceptional meal! 2 for 1 drinks at Happy Hour are a good way to continue your Bourbon Str","useful":1,"cool":0},"HesYEwRHiOXLqzm85oykUg":{"text":"décor not much and noisy, large tables with kids. But, the food was worth it the raw oyste","useful":1,"cool":1},"NOuBIr1YiLFeYKVTNB-s8g":{"text":"I was in New Orleans for Jazz Fest and stopped by here for happy hour. WOW- I was so impre","useful":3,"cool":1},"CKf0v2kQgH6szIUt_0NCmg":{"text":"Went with some girl friends on a Saturday night. The restaurant was packed so we started a","useful":0,"cool":0},"NOccdjI1_FqBIaUndORMlA":{"text":"Great service!!! Yummy, decadent eats! We had oysters, crawfish cornbread, the bisque and ","useful":1,"cool":0},"iiTajAU8KcVNv2QwQtvwjw":{"text":"If you love oysters you have to come here for their happy hour. Great oysters, great price","useful":8,"cool":4},"OQbbltHesYH1FsTvQf9lrg":{"text":"Pretty hopping on a Friday night and our server did an excellent job managing a large tabl","useful":0,"cool":0},"RU0uOcWRcqjxv98qTZun2Q":{"text":"delicious! One of my sister's favorite restaurants....and I know why now.  Every single it","useful":0,"cool":0},"lFs8gIkE4x32aFYFrUY_cQ":{"text":"I absolutely love this place! I'm a college student and always make my family take me to S","useful":0,"cool":0},"MCImmSd8GOH4ykry541Scw":{"text":"Just amazing! The charboiled oysters are must have . I also had the shrimp salad ,.and the","useful":0,"cool":0},"WlYDnJavGw0-aE9oNtj-Fw":{"text":"I was so disappointed on my second visit to Superior Seafood. I ordered the shrimp poboy a","useful":1,"cool":0},"gxoH7eyP36xkP4uSvb_3eg":{"text":"BEST HAPPY HOUR IN TOWN!!! From 4-6:30 every day, you can enjoy a lovely New Orleans after","useful":2,"cool":1},"V7MGkomeoP3dSySDyytlXw":{"text":"What can I say? Just had my 60th bDay dinner there 11.3.19. Private room and server. The O","useful":0,"cool":0},"Cu5sO9eGTlnW0izArR4zIQ":{"text":"Had a really nice meal here when visiting the Garden District.  Good service, nice happy h","useful":2,"cool":0},"god1lQcl8JBgzASOqZllTQ":{"text":"Superior Seafood is located in a very nice area of NOLA. We rode the trolley in and had a ","useful":0,"cool":0},"z9i52keDZOKlxdaJr1Y2iQ":{"text":"This restaurant was recommended by a friend for their frozen cocktails. However, I fell in","useful":0,"cool":0},"YibILNsvf5Nz8mwDnSQ7vg":{"text":"This is a marvelous restaurant! Every single thing we ordered tasted fabulous. If you want","useful":1,"cool":1},"jR9heG0aZyvZEYqpPsriaQ":{"text":"Awesome neighborhood. The barbecue shrimp was AWESOME!! Rest of the meal was really good t","useful":0,"cool":0},"Q-gUxKl5kOkZ_g-a3Q4haQ":{"text":"Raw oysters are good, but the char-grilled ones are so plain and overcooked.","useful":0,"cool":0},"DCXRyLC88w7bSCdoNc9TJQ":{"text":"Came here for my birthday and was highly disrespected by management and would never sugges","useful":1,"cool":0},"PFnPxNISToJU1WlDXQnMEg":{"text":"First time in NOLA. Came with a lot of restaurant recommendations. Chose Superior because ","useful":0,"cool":0},"glHGD4CBJU2Gzv-jaXptZg":{"text":"Great classic New Orleans seafood joint off the beaten path. My wife had the catch of the ","useful":1,"cool":0},"C-a2kvEhftihHdHtkahFCg":{"text":"This review is for Happy Hour:\n\nThe Happy Hour here is one of our favorites!! \n\nEveryday 4","useful":3,"cool":1},"CYh73ksVnY2z84LKm_dqIw":{"text":"Food was pretty good but was overshadowed by terrible service. It took 45 minutes for our ","useful":1,"cool":0},"EG_G1qIbtkOpG-34arLS4w":{"text":"By FAR. The best restaurant I've been to while visiting. This place alone is worth the tri","useful":0,"cool":0},"n25_shiXAvdv0ejAwEhgdA":{"text":"Amazing seafood restaurant in the heart of New Orleans... Make reservations because you wi","useful":12,"cool":8},"kOWu_CKCJvd-wquZO7dG8w":{"text":"We had great service and the food was good here. The oysters were fresh and clean, and the","useful":0,"cool":0},"6L-b5UdsN7xX-fYFsJ6GNw":{"text":"This needs to be mentioned first:  best oysters I had while visiting New Orleans. I'm usua","useful":1,"cool":2},"qusS0LyQtMfk3S-e4S2HDg":{"text":"really cool place - the happy hour prices on oysters is amazing.....","useful":0,"cool":0},"xmOpdvu7JGAQtnfBHTZp9g":{"text":"Great happy hour!  Oysters were wonderful and enjoyed washing them down with Stellas!  Mel","useful":0,"cool":0},"EUbkxWgq7zuFO4fX1tPOaw":{"text":"Grilled oysters were so delicious!!! I had planned on trying to hit up Drago's for grilled","useful":1,"cool":0},"aNKGke2kKnIekIgV92GwwQ":{"text":"My favorite brunch in NOLA! Incredible and affordable options and plenty of gluten free op","useful":0,"cool":0},"5k-PyICp4wjJHTLKJrwYDQ":{"text":"This place was great. Appetizers was awesome, the frozen mimosas was amazing, the baked ma","useful":0,"cool":0},"e3AWQFRHzJq5aKYJqUaiYA":{"text":"Went here while visiting friends in New Orleans. The food is great and so are the drinks. ","useful":1,"cool":0},"KLziIVbXTNRpnkSEG3lBxw":{"text":"Very solid local seafood place. Directly on the cable car line and beautifully appointed f","useful":1,"cool":2},"_sLDk57RPJlFf_RtYVZ0SA":{"text":"I love to go here for happy hour if you LOVE raw oysters! Their oysters are usually always","useful":0,"cool":0},"UsvE_DXi9I78GrmaVE9FTg":{"text":"Great food at good prices. Atmosphere is NOLA. Bread comes fresh hot in a bag. Very afford","useful":0,"cool":1},"5BWayQrSDOziKMwkuRmxXw":{"text":"We dined here on the 4th and because we arrived early, the restaurant wasn't completely fu","useful":1,"cool":0},"kbWjQyDR6l1UrklrCqbqUw":{"text":"Came here on a recent visit to NOLA. The char-grilled oysters were fantastic and the crawf","useful":1,"cool":0},"kcHnjsM3qG3NAFkCYrw6aw":{"text":"Again not a great food experience. Second restaurant in 2 days. Here the waitress was nice","useful":0,"cool":0},"d61qnSfSEvIrKHM6v0dgHw":{"text":"The Happy Hour deals here were very good- however when I ordered the ahi tuna entree salad","useful":0,"cool":0},"B-QigME-blRooEmgRBNowQ":{"text":"Happy hour review; not a dinner review. \nIn short: hot damn. Fifty cent oysters, and these","useful":1,"cool":1},"9zRA0Nz8sqjBhVmEuvC-7Q":{"text":"I haven't had a raw Gulf oyster in years because of personal preference. Superior's happy ","useful":3,"cool":3},"0aqWXmQAorhRXQGrEtJaaA":{"text":"To start off the 5 star review this restaurant deserves, I have to say thank you to our se","useful":1,"cool":0},"SFMMOhQoamphFJw_fszFOA":{"text":"The Happy hour here is excellent. The bottles of wine are like $12, which is awesome! Grea","useful":0,"cool":0},"s0xFnJpJF84uA_Op_b8aug":{"text":"Great food! Outdoor seating was nice, but just a little crowded. Will certainly go back.","useful":0,"cool":0},"ZRgA1gKvUCrd10SKp67IZg":{"text":"Amazing! Where do I start ? I definitely suggest a reservation. They were very busy, but h","useful":2,"cool":1},"vDqFMShLqZF3N1F91HhgqQ":{"text":"We came here for dinner time although we were not really that hungry. We just ordered a bu","useful":0,"cool":0},"HQzd4Bd1p1Oo9mQMbyOnuA":{"text":"The last time I was in New Orleans, I'd wanted to try this place, but they were packed out","useful":1,"cool":1},"y4m35Hjzq9L7YQ4vZdl_Hg":{"text":"Here for my birthday dinner with friends!!! Awesome food! Ivy Rose you are amazing!!!","useful":1,"cool":0},"SqojL8LNk-BoOrmlqcVVCQ":{"text":"This restaurant is in the uptown garden district. The area is beautiful. Upscale residenti","useful":10,"cool":6},"kwQbwaeG3iyTPbeN5HoFAg":{"text":"This was my first visit to this new restaurant in Uptown New Orleans. My fiancée and I did","useful":5,"cool":1},"tr-yutef0CVtYy-f6v_HGA":{"text":"Slow service and somewhat inept order handl. Nice enough people but overall the place is t","useful":0,"cool":0},"tYOOWgU-Vkuapk95PYXMSA":{"text":"I was very excited to come in for dinner to celebrate my boyfriend and I's anniversary. To","useful":0,"cool":0},"7zXvr-gMbNkxJzNzt1XdGg":{"text":"YUM all the way around!  I wish I had been hungrier because I would have gotten more.  Fir","useful":1,"cool":1},"EM5PMI23TRY90Snfu9VH9Q":{"text":"Hidden gem as for crawfish per my wife.....didnt know they had good crawfish. My oyster po","useful":0,"cool":0},"xh6JBupSuEN04H6SVY6ihg":{"text":"I came here for the oysters and the oysters only! Happy hour 4-630. 50 cents oysters. My f","useful":0,"cool":0},"sRJkfwS8_5L1ZV2ENxm0xw":{"text":"*written by a vegetarian*\n\nrude staff - no vegetarian options = won't go back even for sea","useful":1,"cool":1},"GJzVyGsfqhvG02UE4bn5ug":{"text":"We celebrated Black Friday at Superior Seafood & Oyster Bar.  The atmosphere is pure NOLA ","useful":0,"cool":0},"3U43N24je9HzH5jAKw0fnA":{"text":"This restaurant was so great that we ate there several times on our short visit to New Orl","useful":0,"cool":0},"ufh8j7w4WKKVTr6MeG80rg":{"text":"Definitely a recommended stop in New Orleans.  Very solid, not amazing but better, way bet","useful":0,"cool":0},"AVcVTJNYWhTde2l4Pxfalg":{"text":"Superior Seafood is one of my go to spots.  They serve lunch and dinner 7 days a week and ","useful":2,"cool":1},"YsvYx6LfYTmhHcHBHoXjjA":{"text":"When your Mom's in town and you've got to chat wedding, the only way to get through the co","useful":34,"cool":20},"Vzq8Ypg6YKvGmKnbDFsl-Q":{"text":"Food was amazing, our server was wonderful and super helpful.  We have two girls 17 and 10","useful":0,"cool":0},"sQlgTBqME-OWMam-6yaBuQ":{"text":"Walked in on a as nice fall Saturday after Thanksgiving. Atmosphere is casual classic and ","useful":2,"cool":0},"pxk2plHY-NcgPy06TPtbcQ":{"text":"My FAVE oyster raw bar...Decent house wine pour, main dishes excellent.\nService always hel","useful":0,"cool":0},"uepBLwvHAhKNLx_kC9YOlw":{"text":"Came here for happy hour with my roommate. We made a reservation 3 hours before on open ta","useful":2,"cool":0},"b6HS-F1KqnsNHSeOb8ZeEA":{"text":"This was my first meal during my first trip to Nola and it did not disappoint. The frozé w","useful":0,"cool":0},"rn1XajI9oJ2eW-aJmqq3hA":{"text":"Generally really like it here but my last experience was just okay. I got the fried bacon ","useful":1,"cool":0},"rOPt-wqDxPN5haOcImXyBQ":{"text":"The happy hour specials here are amazing - $0.50 oysters and $3 drafts and cocktails. I ha","useful":0,"cool":0},"UjmpX9_iI_hT3EVSXDRFmA":{"text":"Ok New Orleans is known for the food... this place is the sh*t best food ever!!! Shrimp an","useful":0,"cool":0},"0scRR6MMEKVF_AP9W66mrA":{"text":"We had a department dinner at Superior Seafood. It was amazing. Our food was delicious and","useful":0,"cool":0},"ubf0vOY3DruDZpQ526Yt-Q":{"text":"I really wanted to love this restaurant, but a few things took away from the experience.\n\n","useful":1,"cool":1},"4Ho__piyOLG-h5HSXfpuag":{"text":"Again, I love a place where you don't need to order salad... it's included when you order ","useful":1,"cool":0},"PXSiecR7ARwX1Y5Lfzly7w":{"text":"**During Essence Festival**BBQ shrimp was not made correct, it was made with BBQ sauce, an","useful":0,"cool":0},"IburT4rni2-VEzl8CE90vw":{"text":"This place was recommended to me by my boss so we decided to make this the first meal when","useful":2,"cool":0},"lUbRceh4bnMGNb7o_3ANpQ":{"text":"UPDATE: BRING BACK THE FROZEN MIMOSA! Only offered now during brunch and if I'm being real","useful":1,"cool":0},"C6tcqjyUfItJGex6v0NzCw":{"text":"Came here with family to experience oyster happy hour. Our favorite were the char grilled ","useful":0,"cool":0},"Ic47gofEsI2SPr3fTZpFBA":{"text":"I'm super excited to add Superior to my list of \"go to\" restaurants! We visited Superior f","useful":0,"cool":0},"lwDzl2jaXsgbBMjo1wDRcw":{"text":"I went for happy hour and despite being convinced I didn't like oysters, got talked into t","useful":0,"cool":0},"NORBLFhDBDg-LEobaZgTPQ":{"text":"We are visiting from Southern California... we've eaten here several times (over several v","useful":0,"cool":0},"oeODtiD55H_lJe6gQ1_zww":{"text":"Went here for Christmas Eve dinner with the family. We had an enjoyable time. The service ","useful":0,"cool":1},"9fihtdZ8UAT69Z45Dexxmg":{"text":"Good seafood restaurant with a wide selection of well-prepared dishes. Pleasant surroundin","useful":2,"cool":0},"NGPlUmpC6C2t-AjW_K_jAQ":{"text":"Came here twice,  once for dinner and happy hour. Dinner was great. We got the oysters sup","useful":0,"cool":0},"SUX-LLLd8aAGpJLlv2masA":{"text":"OYSTERS FOREVER. And EVER.\nThis place has great atmosphere, the frozen drinks are on point","useful":0,"cool":0},"5___x6GwRX4rqZ8JFjfePA":{"text":"Excellent restaurant. Great service, drinks, and food. We had the crawfish mac and cheese,","useful":1,"cool":1},"HQBbx99cxzEJHqji5jsODw":{"text":"ordered some raw oysters and stuffed mushrooms. all were good. Service and ambiance was ni","useful":3,"cool":3},"0kYuqy6uYbvAp10p5878aQ":{"text":"The shrimp and grits were amazing!! Also, I'm not a fan of mojitos, however, their palmagr","useful":0,"cool":0},"dLEK_QiWZevdUY5JZpvOpQ":{"text":"Hell yes, AOK, because: FROZEN FRENCH 75s! Better yet? Frozen French 75s at half price dur","useful":9,"cool":9},"eERfDKssshd8JPezBskpsg":{"text":"Absolutely the BEST service & food !!! Our waiter was Jared (please request him because he","useful":1,"cool":0},"EWHXRFqkMvjTVxaw1ZyNAQ":{"text":"I've been to superior a couple of times now since it is so near to my house, and I will ad","useful":3,"cool":1},"CjzOvnuZgVOE-pkvpSKPdg":{"text":"Outstanding!  Moderately priced.  Great atmosphere, good service and the food is fantastic","useful":0,"cool":0},"pz5cmZtAAgCNHBWNJyjtrg":{"text":"Best original (inventive) bread pudding!!! All appetizers are my fave. Thanks for great fo","useful":0,"cool":0},"3L3buP_cOQhO_-PIZgIOKQ":{"text":"This is exactly what I imagined when thinking about oysters in New Orleans. \n\nThe happy ho","useful":2,"cool":0},"RExV34KBMuLD5lA1G-1cbQ":{"text":"I love superior but it is a little pricey. The atmosphere is too loud but if you want to h","useful":0,"cool":0},"7BG9TL7-PlUfcSW3vB6IhQ":{"text":"Ordered a seafood dish, they left off some ingredients.  Taste ok. Food was cold. Not impr","useful":0,"cool":0},"CHZ9aSEdjTlKieQhtc1vmQ":{"text":"My second time and it was even better than the first.  \n\nLove getting to the garden distri","useful":3,"cool":1},"B048F1-yhhOCeA_yp8OfVQ":{"text":"5 stars for the 50c happy hour oysters daily 4-630 (it starts to get busy pretty quickly a","useful":1,"cool":0},"IPGTUsIyGnqObTCU7wBeQg":{"text":"Carful with those frozen cocktails, they really sneak up on you! Stay away from them if yo","useful":3,"cool":3},"Yx6t3ZmOUfYDOt8dztLQtQ":{"text":"Excellent seafood restaurant in an uptown neighborhood location. All our dinners were top ","useful":0,"cool":0},"1K04xynoJQey0xZiWGv1mg":{"text":"Very nice oyster bar and restaurant.  Be sure to make reservation or you may experience le","useful":1,"cool":0},"YlkKyYaGUrIykBBc4uYrug":{"text":"Decided to have lunch here before touring the Garden District.  Wonderful location and a g","useful":0,"cool":0},"1FAa7KhuG-37jjLuDWMAiw":{"text":"One of our local friends said we had to try this place out so we took the trolley over fro","useful":1,"cool":0},"ejluj-dDuqaPTVnGRP07XQ":{"text":"Ran out of Oysters before 6 Pm on Sunday???\nUnacceptable, embarrassing, and down right sha","useful":0,"cool":0},"_0Qvntgz-W_kDgsURLtLHA":{"text":"BRUNCH DAY = FUN DAY. Today's stop was at the popular spot in Uptown Superior Seafood. Thi","useful":0,"cool":0},"F66rqMEQ1Qi6v2hthN4aUw":{"text":"Started off rocky when the waiter assigned to us left us sitting for 20 min waiting to get","useful":0,"cool":0},"GAGbYuFiNGQZ8LP6I-XllQ":{"text":"Charbroiled oysters were amazing! I should have gotten that as my entire entree instead of","useful":0,"cool":0},"nJBh_oF-AxLz1pei_AtvIA":{"text":"Superior's Service was great and the food was delicious. The seating arrangements are kind","useful":2,"cool":1},"8u3xWnZOHTT_bAsErfow0Q":{"text":"Shrimp salad, with a vinaigrette,  apples, spring mix, and pecans. Sweet salad with savory","useful":1,"cool":0},"FKEtdASor0mByb-XGcpm9A":{"text":"This was my first stop New Years Eve. \n\nBest oysters in New Orleans, we just kept ordering","useful":0,"cool":1},"8rKjMR6q3lWz9qzxbeDTAQ":{"text":"I really enjoyed my date night our waiter was awesome food was amazing some of the best fr","useful":0,"cool":0},"qc6f956VP0oBm872KSPZ4w":{"text":"The food here was great. It was a little pricey for what we got, but we loved it. The drin","useful":0,"cool":0},"U8jSp2r-xnv3e7mi2F1zYA":{"text":"We came for dinner and were expecting a wait, but got a table right away. The staff was fr","useful":0,"cool":0},"6KcrOIo_ckPPzBC2CPQeMg":{"text":"Our go-to place for out of town family and friends, and to treat ourselves! Great happy ho","useful":0,"cool":0},"NKqqsKHeRh5Wnz4oQBsgBw":{"text":"This place is the sh*t! At the oyester shuck station Devin, Foo and Keith were most hospit","useful":0,"cool":0},"4zFZid98PxW7ppa7zSSlNg":{"text":"Frozen French 75's and half-price oysters make this a must attend happy hour. I love the p","useful":0,"cool":0},"zJvtu-e_9cGzdt1S4p2ptA":{"text":"This restaurant is fantastic! I literally just got in town, and this was my first real sto","useful":0,"cool":0},"qG2jLhiwzYLDTS8rpdvSGw":{"text":"Our first time in New Orleans and I can't believe what a great place yelp found for us. I ","useful":0,"cool":0},"gX-kwSMF-mrPlZrYfOLLOQ":{"text":"The food was delicious! \n\nCame with some friends to try out some seafood. The charbroiled ","useful":0,"cool":0},"ad_2_82G7NW6ReuhEt1I1A":{"text":"Visited here the other day. Everything was great, from the delicious food, to our server Z","useful":0,"cool":0},"9Ojf1Kj6f0vLz8aXquPb7A":{"text":"We came during happy hour for the oyster special. The hostess told us that they weren't se","useful":0,"cool":0},"8o3UhYn2_NKvqb7AJYmekA":{"text":"If you are seafood lover like me, you mast visit that adorable place, with great atmospher","useful":0,"cool":0},"6N04KOPRaZD87spVHHyU8g":{"text":"Sorry to see a few bad reviews here recently because they didn't have oysters at Superior ","useful":1,"cool":0},"eP6oVOnsOjjlOPjg9d_tQQ":{"text":"This place was definitely a great place to go for a mix of cocktails and seafood. \n\nWhen y","useful":2,"cool":0},"ZavhQADc-mALz_Mux_ZwHg":{"text":"Happened upon this place while on St. Charles Avenue and OMG! The ambiance was nice! The f","useful":2,"cool":2},"BC6ZYmu6Bhn01lCg34fEEA":{"text":"Every time I'm in NOLA I HAVE TO make a stop here for some chargrilled oysters. They're so","useful":2,"cool":1},"r8p48wV-JK2LL6x_NZI9AQ":{"text":"So I've only been coming to New Orleans for the past 5 years, but I do know enough to say ","useful":3,"cool":3},"LW0DQmDzupAmBYe4w-Bdxg":{"text":"Before our visit to New Orleans I spent a bit of time looking over lists of the city's bes","useful":8,"cool":8},"StOaJjs-dOt2F7iuGEmpmQ":{"text":"Mostly great service but the food is mediocre.  It's pricey for the quality.  The oyster s","useful":1,"cool":0},"KGPSn13ajLodYPeK5AhVDQ":{"text":"Superior is a new(ish to me) restaurant brought to you by the same folks who own the popul","useful":5,"cool":1},"DRwVz-XiEPpq23EfJo0rUQ":{"text":"Happened to walk by this spot at the exact right time . . . Happy Hour! HH at Superior Sea","useful":2,"cool":1},"oqrdt-z1HAwdT36iBpF-EA":{"text":"Serving fresh oysters and beautifully located on St. Charles this place is a MUST. I've sa","useful":1,"cool":1},"tjLnwL3DaFgmcL3XSqvTzQ":{"text":"I know this is a popular tourist place, but as a local, I also love it because it is consi","useful":0,"cool":0},"hZhU4x6JLnEXbEz9hcUJYA":{"text":"This review is for happy hour in the bar only.\n\nOriginally headed somewhere else for happy","useful":0,"cool":0},"BbD1ZN19XsbO6XaW2T9KLA":{"text":"I love happy happy hours and seafood! All kinds of frozen drinks.. I love the tuna tartar ","useful":0,"cool":0},"RBc77yQbZGZV42MVDbRbHQ":{"text":"So me and two friends went to eat a late lunch here. the outside of the restaurant is very","useful":0,"cool":0},"G6yz1qxogZ7X7j4s8ZQ11A":{"text":"Probably should have checked their Instagram first. when I came it was a nice and sunny da","useful":0,"cool":0},"a2B4oKbPJxK3AtOKMNDEhw":{"text":"On the way back from Audubon Park we thought this would be a nice place to stop for dinner","useful":0,"cool":0},"eDpokQdDLWuTBsdgCsG_Wg":{"text":"They say a picture is worth a thousand words, and, I mean... LOOK AT THAT BURRATA TOAST! E","useful":0,"cool":0},"6c4a-a8jR9g4yinjnxrRFQ":{"text":"A great place for a business lunch.  Great raw oysters, and a respectable beef poboy. The ","useful":1,"cool":0},"oWENOMi8Ma_Xvlu_iPNrAA":{"text":"Best food we have had in New Orleans so far.   We had the smoked oysters. I don't usually ","useful":0,"cool":0},"69cIjMDqf7lL6nTe2Ovn-Q":{"text":"Amazing experience at Superior! Great space with delicious food and a wonderful staff. Our","useful":0,"cool":0},"LA6e1GouOdaayuFbaLJBhw":{"text":"It had been years since I dined here.  I had reservations so we didn't have to wait.  I re","useful":0,"cool":0},"b9lgz5TwfaUILPjTnqeAIw":{"text":"Just had the most amazing dinner and service here! Carly was our waitress and it was some ","useful":1,"cool":0},"EX2YA8SeVYqlYSWFr6yZAQ":{"text":"What a delightful fun atmosphere with equally amazing food! I don't know how I have been g","useful":1,"cool":0},"2bI7d1yWp5rFPrhH4oCFlg":{"text":"I went to Superior Seafood & Oyster bar with my boyfriend after reading all of these promi","useful":2,"cool":0},"JpU_5rUKOyAoPZceK6ka1g":{"text":"Wow their chargrilled oysters are the bomb by far the best compared to all the ones I've t","useful":1,"cool":1},"lIiGBYPlTCbiR_q3pM1qhA":{"text":"Great atmosphere, great service, great food, great drinks.  We love their Sunday brunch. T","useful":1,"cool":0},"PuhNG-sv8zbxW1E1E5s0LQ":{"text":"I have been eating here for a while and it is always an absolute pleasure. The oysters are","useful":0,"cool":0},"drIylksVTUjAPPg9AYYl_g":{"text":"Awesome!!!!!My go to restaurant when I'm visiting Nola!!!\nGreat Service and the food and d","useful":1,"cool":0},"d04x2nNeqJbOot_bVtgBbg":{"text":"Is it wrong to eat at the same restaurant twice in NOLA when there are so many options?  I","useful":0,"cool":0},"jSGiBO_fkKHqKRkGg4Mg_Q":{"text":"Amazing drinks & food! Gotta try the frozen pomegranate mojito & tuna ceviche. Great happy","useful":3,"cool":1},"DNZd5yENUKZ4rOy7fmCBdw":{"text":"Yes the nice raw oyster deal during Happy Hour was tasty with horseradish and cocktail sau","useful":0,"cool":0},"8IljjqkjNFfKr33xrCmCaA":{"text":"Wonderful food and great service in a great environment. The lunch portions and costs are ","useful":2,"cool":0},"gl2PX9q4xWjUxPaNDwBd2g":{"text":"Happy Hour between 4-6:30 had 50 cent half shell oyster very very fresh, Mussels with red ","useful":2,"cool":2},"wv-4DP78fhBrNBIYjnZftA":{"text":"The ambience here is perfect for visitors to New Orleans. Superior has all of the staples ","useful":4,"cool":3},"fetuX5Zghqzm8ZUtort5zg":{"text":"Superior Seafood is right on St. Charles in the Garden District. I suppose I've eaten here","useful":0,"cool":0},"bEWLdnCb3KB4rOD331x0yA":{"text":"We loved it so much we came back 2 nights later.  The food is delicious, the prices very r","useful":0,"cool":0},"a-mrNhKgSdLcQeRBq-woxg":{"text":"Bed place in New Orleans for raw oysters! Happy hour is from 4 -7 oysters are on special s","useful":0,"cool":0},"og2NaWF_xggtB2D8XP92YQ":{"text":"The best oysters I have ever had. Sarah was an amazing server. Attentive, friendly and ful","useful":0,"cool":0},"voJqZz9daDzDQGW6od3QQw":{"text":"The happy hour and food at Superior is great! It is one of our favorite places to watch th","useful":0,"cool":0},"5XC6Ufg-EddFalqSm566TA":{"text":"Good service and good food and Sydney was engaging and helpful for our lunchtime visit. Bl","useful":0,"cool":0},"LUx85pqKkxX_rv5xD5twYA":{"text":"This restaurant is by far my favorite in this city. Come here every time I visit. They did","useful":2,"cool":1},"nhDJWkg0yB9NdtWAlCwEjQ":{"text":"My \"go to\" place for raw oysters.  Always excellent.  Had shrimp and grits last time as we","useful":1,"cool":0},"hcg0wvtAjTHHR62RFHaRVQ":{"text":"I love the atmosphere of this place. The oysters are to die for yummy.","useful":0,"cool":0},"NAr2P0fyFukUs8gKCUR99g":{"text":"This place is a classic for the oyster happy hour! They also have half off their house bot","useful":0,"cool":1},"dOa-1JAk8avX8J4oOIO9RA":{"text":"We have friends who spent two weeks in Nola with a promise not to dine in any spot more th","useful":11,"cool":9},"2D0NUPr1oGsb_1JTOmYlKQ":{"text":"Superior Seafood & Oyster Bar is located in the historic Uptown New Orleans.  According to","useful":10,"cool":10},"zM4o_Nt2YbJsBFd5kwcLsw":{"text":"We LOVED this place so much on our weekend trip that we went twice for their happy hour fr","useful":2,"cool":1},"aqZRXbuo9BWx8UxUeMKVkA":{"text":"If I could give zero stars I would. We went here for my sons birthday. He loved their Alfr","useful":0,"cool":0},"J9RwS3VZgfBdUuWxHUpJrQ":{"text":"1. Girlled oysters are my favorite!\n2. Don't miss the happy hours. It's the first time I t","useful":1,"cool":0},"qTG7fqgZ4hPgVG62X5mfmw":{"text":"Above average food, excellent service, class fine dining experience.  Great experience. Wi","useful":0,"cool":0},"r7D5fpWopPisqwgxLQwUYQ":{"text":"THE BEST!  At least when Hunter is serving... Cocktails (especially that frozen pomegranat","useful":0,"cool":0},"1m4g1sIFmZHUIB2cNVMd1w":{"text":"What a find!!  On Oct 7, 2020 I hosted a wedding rehearsal dinner in the St Charles Room f","useful":1,"cool":1},"T1iNH3XGIS-JtixoS1Dmbg":{"text":"Without a doubt, this was the best meal and service we had on our trip to NOLA. Colin was ","useful":1,"cool":0},"lbkp3ku20zYTyoA3E4NIgQ":{"text":"When we walked in we were immediately greeted by friendly waiters and staff. The building ","useful":0,"cool":0},"0NTjd2u8V1yV-OtEnI8lWw":{"text":"Steven was our server and he was AMAZING!!! He let us sample the rosé before we chose our ","useful":0,"cool":0},"TwToVFOZq5zozKqBhUJFCA":{"text":"I suggest taking out of town guest here cause Superior Seafood has a great happy hour! (da","useful":3,"cool":0},"N3pMS-zoq-UnFzSRYsYh5Q":{"text":"Where I fell in love with Chargrilled Oysters!\n\nTHE AMBIANCE:\n\nSuperior Seafood & Oyster B","useful":3,"cool":5},"NTIPOtEIIqA6JT_CL_uFGQ":{"text":"Going to have to revisit Superior so I can snap some food pics. Went for happy hour raw oy","useful":1,"cool":0},"wA3PvE3Pjxr7jGTkqHN-Uw":{"text":"We went here for a nice dinner out and were not disappointed!  The pasta de la mer was cre","useful":1,"cool":0},"NCHU-XiJp3SyVAR5J4cvbg":{"text":"I had high hopes. I've never been here before but heard about the Happy Hour so I decided ","useful":0,"cool":0},"2ukp7cRGRjVAyFwkqae_Fw":{"text":"Ordered the fried oysters, crawfish cornbread and then pasta. The pasta was just ok, it wa","useful":1,"cool":0},"EpBST4dYMSYl77mUzyBzrA":{"text":"Fantastic food and service for our group of 10!!!! Our server, Rebekah, was the absolute B","useful":0,"cool":0},"Vq9N1jO1XzQogmVkZhH3Xg":{"text":"Couldn't give zero stars. Called about 30 min ahead of arrival after the parades and told ","useful":0,"cool":0},"ecoKiSyFrL8EDPT4ulF_Eg":{"text":"Yum yum yummy!! A recommendation from our Uber driver Charlene. What a delicious meal we h","useful":0,"cool":1},"XjI3KlgXj89E6tMPCiFyOQ":{"text":"Great place to spend a summer evening.  An easy stroll down St. Charles Ave from our hotel","useful":0,"cool":0},"CXFaSJlsyp2YiflVb7t3IA":{"text":"Great food. GREAT char grilled oysters. Great service. Great vibe. Great catfish. Wait was","useful":0,"cool":0},"K47MIbt96zphbcGOSNQ_vQ":{"text":"This is among our favs...oysters are plump & delish. Love the window seating. Excellent fo","useful":0,"cool":0},"aJJL54PjZhxQkLv99TWwnw":{"text":"Best oysters raw or chargrilled in the city! I used to Dragos before they closed pre-Covid","useful":1,"cool":0},"uA6eJp1uTOmMUfYmI4Jl1g":{"text":"I love Superior Seafood! We had about a party of 20, called to book a reservation in advan","useful":3,"cool":1},"fZgySMAf4QTQZ7-8ot8oGA":{"text":"Nothing special here. Food was adequate at best. Salmon ok. Risotto eatery. Even the creme","useful":0,"cool":0},"EDrEcxK3txH1H5UZ20izvg":{"text":"The food was great. The chargrilled oysters are my favorite kind of oysters. This was our ","useful":0,"cool":0},"QGTporvSx3i8cpyvN1c42Q":{"text":"The best seafood in New Orleans! You have to try it.  The restaurant is beautiful.  The cr","useful":3,"cool":0},"ED3d7592BNQDzA6dmSW9rA":{"text":"One of the best restaurants in New ORLEANS \nMy family from out of town never fails to eat ","useful":0,"cool":0},"_ko0YLOvcOPtmo3JCoVSOQ":{"text":"The service is really great with a pleasant and accommodating wait staff. I ordered the ch","useful":1,"cool":0},"TWIXbZX0i0lGrtwmkdTbsQ":{"text":"Excellent wine selection- very good happy hour oysters.   All their food was fresh and exc","useful":1,"cool":0},"HJU9I_FTWWDhjA9vOjQMvw":{"text":"Wow wow wow! Great food and service. It's a really cool venue with interesting features an","useful":2,"cool":0},"ldr1p01bvfomprZvbE5waw":{"text":"I think everyone in our group thinks this restaurant was the food highlight of our New Orl","useful":0,"cool":0},"h3UnV_iOERnjDI2x33E-PQ":{"text":"Let's talk about restaurants that don't live up to their name. Nothing superior about this","useful":0,"cool":0},"S7CZTRnz43JXYj9u_sXS2A":{"text":"Great place to go to experience NOLA. Casual to dress up ambience. \nLots of drink options ","useful":1,"cool":0},"g-dn2yLCeBhspXK8hywFtQ":{"text":"Everything you read about the Mac and cheese is true! It's great, and we got some of the f","useful":0,"cool":0},"JvjpQ7Ry8qJkbzk9l0LFaQ":{"text":"Really nice place! I think the owners want this place as a formal dinner place as they cra","useful":2,"cool":0},"nkwVbwxd1uu_dlal_TsC3w":{"text":"Fan of all Superiors but this seafood joint surprised me! Great food and the staff is alwa","useful":1,"cool":2},"hLGrwUvPPMY7WL1JqctAYA":{"text":"Im here visiting New Orleans and I've been here for 4 days so far, I've already been to su","useful":0,"cool":0},"i9B2vGuN8mxHXat6vou7AA":{"text":"Our group came here twice during our stay in New Orleans! Of course it helps that we were ","useful":0,"cool":0},"R613tI6Gjr0DjUIHpiIyDg":{"text":"Mmmmm oysters so delicious! \nThe food selection and service IS GREAT!\n\nADD THIS TO YOUR LI","useful":0,"cool":0},"egLcDNgowhRChlrFYNOiog":{"text":"I'm not the one to write a bad review, specially after being a server and bartender myself","useful":1,"cool":0},"XUlA6Uvo0kywYc59NVqlcw":{"text":"Found this restaurant on the City Tour.   Yelped it & decided we would check it out.  We w","useful":2,"cool":2},"XM2iVfsTYlBblN_5eplDKQ":{"text":"I only go here during happy hours for the oysters and drinks real talk. I honestly never b","useful":1,"cool":0},"wfcjf7ZfqnCjPSccGy0tDQ":{"text":"Great Raw Oysters specially during happy hour, 50 cents each during happy hour. My husband","useful":1,"cool":0},"7WHdQ0upXjZc-AInLE8sig":{"text":"Good food good atmosphere. Nathan Is a rockstar he really makes you feel welcome and he is","useful":0,"cool":0},"kaTsGn7jXMW-YF0-Y0aOFw":{"text":"This large restaurant, located near Magazine Street, serves traditional New Orleans food. ","useful":2,"cool":2},"y8TqT2CurRSTSkmk9ckhEg":{"text":"The food and service did not disappoint. You can't beat $0.50 oysters and the shrimp and g","useful":1,"cool":0},"OQAObpKsicXrcsmMtnS3rg":{"text":"We were a group of fourteen people on a Wednesday evening. The service was very good. The ","useful":1,"cool":0},"Xb4sCWj0tI8we3LJhoTmSg":{"text":"I love superior seafood. It's always a nice vibe whether you're eating inside or on the pa","useful":1,"cool":1},"KfUtoZ7SbHSPxG0QYVxN_Q":{"text":"Great place for brunch and lunch or even dinner. I think the last time I was in Nola we at","useful":0,"cool":0},"dVlPf-gdYtE2iRRAlBd0wA":{"text":"Excellent food and customer service. Costed the location two times in one day. My favorite","useful":0,"cool":1},"TIFCQnHPZxW0MmXaKUfMWg":{"text":"Extremely fresh and NO oyster shell chips left on the oyster. Fried oyster salad is anothe","useful":0,"cool":0},"fNwaSACuBV1CowXG1uJUkA":{"text":"I love Superior Seafood!  The Happy Hour pricing is great - 50 cent raw oysters and some o","useful":2,"cool":0},"UoQTR8RkECMajWGzIcl7HA":{"text":"OMG. This is always a stop when we are in New Orleans. The drinks are always good. The foo","useful":2,"cool":0},"mfmACnlNm2OL93dDDrxlhA":{"text":"Went here on the cusp of happy hour and definitely had to try the frozen mojito that was r","useful":0,"cool":0},"dcSg-Klw8iMLVGSGIqwObg":{"text":"Their food is so yummy! Kinda on the expensive side but food this good is worth it. I'll d","useful":0,"cool":0},"MWWwFEBlyC1qTRBCR_bwtw":{"text":"Always great service and delicious food! Try the pasta vieux carre and shrimp brochettes. ","useful":0,"cool":0},"x4-HZY59xPlg3g_kH9SICQ":{"text":"This is more like a $$$ not $$. \n\nWe went during Happy Hour. We were seated right away how","useful":2,"cool":1},"V_pfb-sZRQOAEO1hMVDNPw":{"text":"I love this place! It's an awesome place when exploring the uptown area as it is right on ","useful":0,"cool":0},"eyGt2Yb2-oAoRpRSsnxXNA":{"text":"Great happy hour deals! $3 house wines and drafts and 50 cents oysters. If you like beer a","useful":0,"cool":0},"xpyNJFSAvcu0oHHgPi-Xiw":{"text":"Just ate here and I am shocked at the attitude of the management. I ordered \"Prince Edward","useful":1,"cool":1},"ax9e977ho5f4uGYehP449w":{"text":"Pasta Viex Carre is fabulous. Great service. We were all happy with our food. Piano live e","useful":0,"cool":0},"mfqsXwJIuspUSf5BFhWR9Q":{"text":"Dude plays was awesome had half price oysters from 4:00-6:30 and drinks were on point alon","useful":1,"cool":0},"bOVU56jg0zplrn_5bE2qUg":{"text":"We ordered the chargrilled oysters, blackened fish Napoleon, and pasta vieux carre. The pa","useful":0,"cool":0},"QKvjNvcPcWezLWDXjmw_RA":{"text":"This was our best food find in New Orleans for the four short days that we were there. Our","useful":0,"cool":0},"xqUBQLXWIw6SFfx6zyy_qQ":{"text":"Chargrilled oysters,  shrimp and grits,  po boy, crawfish and crab bisque - all were excel","useful":0,"cool":0},"kJ9SVEv2WeSWiPuL3uSsAw":{"text":"Our most favorite place for char-grilled oysters! The staff is always gracious and polite.","useful":0,"cool":1},"aNsNAr2W-mAqTytqJKGgfA":{"text":"They are doing a great job at keeping the indoor seating safe as well as accommodating peo","useful":0,"cool":0},"ygTk7U8UVei1PIJ1aW8_PQ":{"text":"The food was very good--had chargrilled oysters and the angels on horseback poboy. Unfortu","useful":0,"cool":0},"EH6cgqGuFyQ4xOFS6pCQcA":{"text":"Actually surprised by the service and food. Loves it! I would definitely come back again!","useful":0,"cool":0},"XcshUGzdRQr_dA3BKOqiZA":{"text":"Chargrilled oysters are amaze!!! Happy hour 75¢ raw oysters (seriously fresh & HUGE) & hal","useful":0,"cool":0},"tPsNu7MFD4VXKbrsCKoVcg":{"text":"Fabulous good and excellent service. Grazed on BBQ Shrimp and oyster trio appetizers thoug","useful":0,"cool":0},"GjMmvVb7_XH5TwyDxFjx1A":{"text":"I walked into this place on a busy Tuesday night and was quickly seated and brought some w","useful":1,"cool":0},"HEb-m8tLOQOlYhmFuUJRtg":{"text":"Exceptional spot for seafood.  We met friends and had a fabulous night.  The atmosphere, t","useful":1,"cool":0},"Zjj9Ia9k5vJCnkxHD2eQsA":{"text":"This is one of my go-to restaurants in town, especially when I have anyone come visit. Hap","useful":0,"cool":0},"jLbQqR0CaULNzFsy8kP41g":{"text":"Another great spot for happy hour oysters. We were staying in The garden district of New O","useful":0,"cool":0},"gkJ78SSUa6VDLfGruU2UmA":{"text":"On vacation in New Orleans, and we decided to try this place for an early dinner. There we","useful":4,"cool":2},"RsM9MTzfo0o-1WdUgjO7PQ":{"text":"We were so excited to eat here, but the food was just ok. It was only a couple days ago an","useful":0,"cool":0},"Nw7cX3aBe2Upvs_p6c9SOA":{"text":"Fantastic service, excellent food, and the perfect spot uptown. I used to live in New Orle","useful":1,"cool":0},"QVPwO6W1G4P9KQuHZyTS2w":{"text":"What a great oyster bar! Really great service and nice outdoor dining! Delicioussss drinks","useful":0,"cool":0},"aRxqxdmMhP0VpHFNJJm92w":{"text":"The chips and salsa at Superior is always on point. They never mess up our orders, and I l","useful":0,"cool":0},"Ih5p0wkt504Dz2qi1HWCrg":{"text":"I came here for my birthday and it was pretty trash. The food is pricey for the portion si","useful":0,"cool":0},"dpiZ3IozTcltRcQ5meOIlQ":{"text":"My wife and I who are from San Diego ate here last November and loved loved loved this res","useful":1,"cool":0},"3EQ_yTK49LVTlPUQxDxdtw":{"text":"Very good seafood, the shrimp and grits were very good, just enough dice to add flavor but","useful":2,"cool":1},"mbbWvBv07Xkdmmd2KBoxEQ":{"text":"The food is delicious and the oysters are the best I've ever had. If you're around for lun","useful":0,"cool":0},"mkEnZDmXqotLLghGPNr0Dg":{"text":"We searched for raw oyster happy hours online before we came to town and decided to try th","useful":0,"cool":0},"f2UzU_YTIRp-ZFroruMNqQ":{"text":"This Neighborhood restaurant never disappoints! Lively ambiance, great food and fantastic ","useful":0,"cool":1},"wVEyARDq5F9YhFt3kRmZ1A":{"text":"I'm not a huge oyster guy. I struggle with the texture of raw oysters, but it's a must try","useful":2,"cool":0},"Ge25T4jMpkzvB9P6_Gwheg":{"text":"I had the pleasure to celebrate my birthday here... I made reservations for 6 a few weeks ","useful":0,"cool":0},"NY8_nDOP7ZD2Rdg4L_j7_w":{"text":"Delicious meal. the shrimp and crayfish bisque was amazing. Oysters were perfect, but the ","useful":0,"cool":0},"S58047DskpSlyVxsJY4ocg":{"text":"I come here frequently, but my last experience was honestly so good I almost cried. Their ","useful":1,"cool":0},"gSd3YO4pB-yaZG6bdHHM4g":{"text":"Service was excellent, food was ok. I got the crab cake Benedict off the brunch menu. The ","useful":0,"cool":0},"Ly6_2phFA_E5eGkd6Bdqdw":{"text":"This place is fantastic. The chargrilled or tears or outstanding as was the file and the s","useful":2,"cool":2},"J3saRcDCws6TkQie9jTcDA":{"text":"Great food, excellent service, awesome drinks.  I was around the Garden District and got a","useful":0,"cool":0},"q7Sfd2pxHwK2lxbjBGWD8g":{"text":"If I was basing this review solely off the food I would have given it 4 or 5 stars. I had ","useful":1,"cool":1},"c0T9NWBeUehKvWi-aPtQFw":{"text":"This place is very nice !!! today they had a guys playing piano  the  the food was amazing","useful":0,"cool":0},"FdSDsOVeUhs13X3vSgsr5g":{"text":"Someone recommended this place. Took a trolly ride over to uptown? It was long ride bc tro","useful":0,"cool":0},"7r00A5dMlWJN0Oi_Hh-1Og":{"text":"Mardi Gras is no excuse!  An abbreviated menu, significantly higher prices, no napkins, no","useful":0,"cool":0},"JuiIfW3BhM20z5dMXjMHYQ":{"text":"We thoroughly enjoyed our food here.... once it finally came. We had reservations for 3pm,","useful":1,"cool":0},"s9vLeJdz2FAzm6qGADAkqg":{"text":"Wonderful environment, lovely staff, some of the best oysters in town, hands down best hap","useful":1,"cool":0},"C152sxxpIsU3Z33sX6alrw":{"text":"What a treat for foodies who would like a taste of nouveau cuisine a la NOLA. Gracing the ","useful":1,"cool":0},"FS2jTFUb3HNrnJ9sV3K_dg":{"text":"Incredible dinner spot! We have heard for years that this was a place we needed to try and","useful":0,"cool":0},"00xxCZMwU55bk85RWUZEyg":{"text":"Amazing crawfish mac and cheese and alligator bites. Also awesome happy hour deals!!!","useful":0,"cool":0},"8bC95_0Zl3mpBDe99tZusw":{"text":"Wow! Wow! Wow! After my mom and I shared a good time at Superior Seafood, I talked about t","useful":0,"cool":0},"JPCru_o7pjv0UACZL_My0g":{"text":"Five stars for Superior's happy hour - 75 cent raw oysters, large frozen drinks for $7-8, ","useful":1,"cool":0},"oYg92KQr6LY-mzAlgZ-nKw":{"text":"Shame on this place for serving room temperature, dry oysters and a very loose, watery int","useful":0,"cool":0},"ffJVkRX8yjxbwUb1sV2z7g":{"text":"Superior isn't just a name in this case. It is a fact. Best char-grilled oysters in the ci","useful":12,"cool":9},"kpfUGOgv9-gfBKjZkjAVJw":{"text":"Superior is a classic, old school NOLA staple that is well worth checking out, anytime but","useful":3,"cool":1},"_gsbcuXrTphEoNI7c8V_zQ":{"text":"Came in for a late happy hour/early dinner(5:15pm) with a friend! \n\nI was seated as soon a","useful":0,"cool":0},"WdVOeKqGaM5zWKARmguTUg":{"text":"This place is wonderful! Came on a Sunday night where there was live music and an awesome ","useful":0,"cool":0},"ObSRJ1-6-XEJjy4Un6wk-w":{"text":"Excellent spot to share a good time with friends!  Indoor and patio and outdoor seating.  ","useful":1,"cool":0},"6eOe-UBPj21ZOHDyGoKaQg":{"text":"I somehow had never heard of this restaurant on previous NO trips but it was recommended t","useful":0,"cool":0},"IEvwuIlUZWM6-xwDty2Qww":{"text":"Love this place, great food, super service and lots of bourbon! Oysters are abundant!","useful":0,"cool":0},"kh90zzy5WO7YoKpPpW5BUQ":{"text":"best happy hour in new orleans! i had a frozen mojito, seafood stuffed mushrooms and the c","useful":0,"cool":0},"xeg5ad33nl-hH0M7tP8UCQ":{"text":"Love the atmosphere here! The Tchoupitoulas Chicken is delicious! That crawfish Tasso crea","useful":1,"cool":0},"5n0CWLfGe6dVhkgPm3B8RQ":{"text":"Decided to grab a bite before an appointment. I could not have chosen a better spot for a ","useful":1,"cool":0},"JF4chsslGHe9lrjDgzk3Fw":{"text":"Have tried this place twice. Both times food was not worth it. Touristy. Frozen drinks are","useful":0,"cool":0},"B0fHNKn-G1-C2zEozqo2MQ":{"text":"Food was ok not bad. Drinks were better. Thing is, everyone was super rude! I will never g","useful":0,"cool":0},"KBxOYpqnoS2Fw0MyHbpcIg":{"text":"Amazing service but the food was just \"okay\". I was excited to dine based on previous revi","useful":0,"cool":0},"YuhVFDsN0jZdqeuuwGnxEQ":{"text":"Been here twice so far and absolutely loved it both times! Both visits were conveniently d","useful":7,"cool":1},"frN_h9SBF4vpXPWY0PUhUw":{"text":"Never disappoints. Best oysters we had while we were visiting NOLA...and we had plenty! Gr","useful":0,"cool":0},"_Vze28-2xZzDBoYtUjTPsQ":{"text":"This spot on St. Charles and Napoleon is ALWAYS busy (best to make a reservation, which th","useful":2,"cool":0},"QlhSqxL1C7lPk-uuWr-ZwQ":{"text":"I don't love Superior for dinner, but they are solid and less pricey for brunch. Mimosas a","useful":2,"cool":1},"B0H2gcXT-GZg-kvj7SbGTQ":{"text":"Service is always good when I'm here. This time, I had a dozen chargrilled oysters, and wh","useful":3,"cool":1},"jAVAPFgrpDj-vWHP4njv3g":{"text":"Excellent service, amazing food! We started with oysters, of course. I got the shrimp and ","useful":1,"cool":1},"YGKYncMc4Mb5wLuLkUf5OQ":{"text":"I wouldn't call this place \"superior;\" perhaps \"decent\" might be a better appellation. Alt","useful":1,"cool":0},"DeU-0uYbKxI9RI1Xa51bFg":{"text":"I went there with my husband and food was superb but is a big rip off.\nEntrees and appetiz","useful":0,"cool":0},"3qnDEG-xQc5jgRiQxBkNTg":{"text":"All in all I was impressed by Superior Seafood! Superior Seafood originally caught my eye ","useful":10,"cool":7},"7_hjqBoDWNq030vf7npxgg":{"text":"I love Superior for brunch, lunch and happy hour. Th Frozen mimosas are awesome as well as","useful":2,"cool":1},"YL5JHcJD5Zf3ZwohQ-amLg":{"text":"We went here for a company function and my husband and I couldn't be happier with the serv","useful":0,"cool":0},"YxySzFh07LbACTa1s7IXsw":{"text":"Large, juicy, tender, meaty.... All the qualities of a damn good Oyster. The Shucker's are","useful":0,"cool":0},"kjI_w5NiZJ3sIuTOkhfJ7A":{"text":"I love the $0.50 raw oysters during happy hour! Very affordable! That's $6.00 for a dozen!","useful":1,"cool":0},"znkASrf40sIxYKidxnMeGA":{"text":"Food was delicious.   Staff was attentive and friendly.   We were seated promptly for our ","useful":0,"cool":0},"qXyRnKvf6bB-eHWndxnAmQ":{"text":"Yummy and great location. Pomegranate martini was absolutely fantastic. Great wait staff a","useful":0,"cool":0},"riMovL8CMBfUO1QnrkvIfw":{"text":"We were told this place rocked! Did not disappoint!\n\nAtmosphere is casual and just a tad o","useful":1,"cool":0},"vZXOFY2WFRvVCLBxGfVj2w":{"text":"Superior Seafood is worth a trip out to the Garden District because of the tasty food and ","useful":0,"cool":0},"ZrMzycyJcBTAY8jHF5c2xQ":{"text":"Superior is definitely one of my favorite restaurants in this city! Love the servers the o","useful":1,"cool":1},"0AiYi0pFCy2GWkisB33ZMw":{"text":"First, the host seated us immediately and added a big welcoming smile. Our waiter Spencer ","useful":1,"cool":0},"oc-R5KFozStQ6n0EHZ759w":{"text":"One of my favorite places to eat in NOLA. I usually go for dinner to get a nice warm meal ","useful":2,"cool":1},"ScWzl_LSzLAEhMGhSt0yBg":{"text":"While not anywhere near as good as their older sibling \"Superior Grill\", I am hopeful for ","useful":0,"cool":0},"W0iLEW8p8UZZtsOp9LS3Xg":{"text":"There are probably better restaurants in New Orleans, but none that are a better value tha","useful":0,"cool":0},"tX7dwZAyTmto4nvngqhQow":{"text":"Happy Hour is incredible.  Raw oysters 6$/dz and nice bottles of wine for 9$.  Ask to sit ","useful":0,"cool":0},"vfturM9GjKlCngTxZOWNuw":{"text":"Reservation at 1pm. Food arrives at 2:40!! Half our food was room temperature and part was","useful":0,"cool":0},"xmeLS_QNa1FOZX5mmAssJg":{"text":"The food was delicious- service was excellent and happy hour was an excellent  deal and di","useful":2,"cool":1},"qMf6U0S_ThpqwK_bFS0KzA":{"text":"This is one of the best in uptown. During my time in undergrad we probably ate here 40 tim","useful":0,"cool":0},"Osh0vyn6hw-dYJeZJvq2VQ":{"text":"In town for an Anderson .Paak concert and definitely needed some charbroiled oysters that ","useful":2,"cool":1},"2s0p4IzQFTOE5F4eE0bKQg":{"text":"I was looking for a restaurant in New Orleans to host a birthday dinner for my mother in M","useful":0,"cool":0},"vJEeSwqu3vaWHlCiW4h8zg":{"text":"I live in the neighborhood and often run by and there has always been a great and positive","useful":0,"cool":0},"dmEf23m1fjAiupoyFrNTSw":{"text":"We usually go to Superior when we're in New Orleans.  First off, it's a fine restaurant.  ","useful":1,"cool":0},"4f9ShhkOmA1xi0bQPWj5hA":{"text":"Our first meal in NOLA we decided to try this place.  Very loud inside so we asked for a q","useful":1,"cool":0},"GrgU3a7KQkR3RJ6T7iHzUg":{"text":"Yes yes and more yes. Came for my daughters bday and we left stuffed and happy. Service wa","useful":0,"cool":0},"yzStZ2zZxlSZ-fU80tIYew":{"text":"I found Superior Seafood while in New Orleans thanks to a tip from our Uber driver, we had","useful":3,"cool":1},"IMyBnkboFNoGKAIdhLnfuw":{"text":"Best seafood we have had all week in New Orleans! I had the shrimp, bacon wrapped, stuffed","useful":0,"cool":0},"9Ecqv3_z7rv7_Wp6PjmHCA":{"text":"I had a dinner on chrismas eve here. I was really disappointed.\nI ordered seafood pasta an","useful":1,"cool":0},"3--imoipF2F5W7ofHqEp1w":{"text":"Great food and ambiance.   Great andouille sausage stuffed, bacon wrapped shrimp.   Also g","useful":0,"cool":0},"UnbxLi4hFYL41GmpYNegLw":{"text":"Came here for an early dinner at 4 with my bf. Made a reservation because i heard they can","useful":2,"cool":1},"MMrSS6JDlZ8ikbARHziBAA":{"text":"The best meal that I had in New Orleans and also the best oyster/wine happy hour that I ha","useful":2,"cool":0},"5TM_-R7urBw-v_0ivO2nfA":{"text":"Superior Seafood has shot to the top of my list of favorite seafood restaurants in New Orl","useful":1,"cool":0},"4oc9M-qWC5hXlUf2d_H_DA":{"text":"As soon as we walked in... this restaurant put us in mind of Pappadeux's. I ordered the cr","useful":0,"cool":0},"gt68dXBlTmY6SxtvlKRXAA":{"text":"I ordered the blackened catfish which was lukewarm when served and tasted adequate. The br","useful":0,"cool":0},"18zLG9skdVBEGl3IUwMqSQ":{"text":"Ok, AMAZING!!!!! Can't say enough about this place come here now!  I had the blackened cat","useful":2,"cool":0},"lt1kJXcwgY44lv8VZqd60w":{"text":"Ran out of Oysters before 6 Pm on Sunday???\nUnacceptable, embarrassing, and down right sha","useful":1,"cool":1},"cu--RWUiIwrSwYxx0ZCLXw":{"text":"I wish that I could give this place 6 stars! Omg, this was one of the best spots we visite","useful":5,"cool":3},"xfuvj6FaJkEfVD_TDhsdxw":{"text":"Good drinks and great food! Chargrilled oysters is a must try and I never even liked oyste","useful":0,"cool":0},"HwcMZY41141okolU5zG_yQ":{"text":"Would definitely recommend as a place that will get you out of the French Quarter and into","useful":2,"cool":2},"Ow-MHmsM6qsBQE6YwNFjqw":{"text":"Great place for our last dinner in NOLA!  Delicious oysters, gumbo and a seared tuna salad","useful":0,"cool":0},"vf0DraHjzbuzhSP8beYsZQ":{"text":"After a great day of safe, fun, live music we needed something substantial but not heavy t","useful":2,"cool":2},"CgaFK6M1y4HgfefwHMkCoQ":{"text":"Nathan and Nick are the best servers of all time. I received the best service I've ever re","useful":0,"cool":0},"5UOvNMRmJsOb4JEnjutdRA":{"text":"Came here with a large group. Many of us didn't like our meals. It just wasn't good. Lacke","useful":0,"cool":0},"gtdWk0dCFZ5TSneBxDLGUQ":{"text":"My husband and I had an amazing meal here late Sunday evening, September 27.  Not only was","useful":0,"cool":0},"XvtD0xpgArJOeCkOSX6JBA":{"text":"Can't say enough great things about this place! The food was delicious and the service was","useful":0,"cool":0},"Z-Kdv8S-t50JznPqoZvvGA":{"text":"I don't eat seafood which places me at huge disadvantage when trying to review this place.","useful":4,"cool":2},"eXfqidyymIxX3f8EQY1mhg":{"text":"Our dining experience was just right. The happy hour drinks are to die for, and guest serv","useful":0,"cool":1},"zTIntBjCtfqGnCxZojHdiw":{"text":"Poor staff seemed to all be forced to work in hot, uncomfortable masks despite the mask re","useful":0,"cool":0},"LSZKYG3F4MNdus2EjmAVbw":{"text":"Superior Seafood was packed on Friday night, making it hard to believe it was only at 50%.","useful":1,"cool":0},"f4JQxPw-k-GBVwi7s9atRw":{"text":"I came here for dinner while on vacation with family and friends. The food was good but th","useful":0,"cool":0},"V9NYBvAe2IommSH_jvBDfw":{"text":"Angels on Horseback: five stars\nChar-broiled oysters: four stars\nRaw oysters: five stars (","useful":2,"cool":2},"l_IniyM7Xmqmnc1MXrIwGQ":{"text":"I had high hopes for this place. Overall, it was good, but didn't meet my expectations. Cr","useful":0,"cool":0},"d6RAh7BXyG1aJCZ4N5OYbg":{"text":"Not all bad....the kitchen STILL very good, once the food gets to the table.\nAND their Hap","useful":2,"cool":1},"ELMe6YR7tE-V_xD4AjCcTA":{"text":"First time to eat here and it was amazing. Started with broiled oysters for the first time","useful":1,"cool":0},"UC2t6v7B-7DwGffyV_D4CQ":{"text":"I've eaten here several times over the last several months and tonight was the worst.  I o","useful":1,"cool":0},"jvCKobNElUYcc3MhHlz-gw":{"text":"I came to the restaurant with some friends for happy hour.  Emma was our server. She was s","useful":0,"cool":0},"ZQBiEepShxlfA3gJrFn9_Q":{"text":"Came here for the oyster and nothing but the oyster and we did not regret it one bit. Supe","useful":0,"cool":0},"bYHI5XHzcYCBKeASW1T4oA":{"text":"Ambience was so nice and sexy even though it was a bit loud. Selection want wide enough fo","useful":0,"cool":0},"rqkZoKzJjnk-Ug8COR_Tow":{"text":"We made reservations and was quickly seated. This place gets packed so make sure RSVP. The","useful":1,"cool":1},"3Ost29hdKGTDuCEviQ5Y-A":{"text":"Met my party after there after they were seated. Never got a chance to make a food order e","useful":0,"cool":0},"5xDTvlXJ8zZmgQYE-1AJaQ":{"text":"I love this place and there's not even a single thing I can eat here besides the bread. \n\n","useful":22,"cool":19},"7OCEE2lqWzXHbwgGbvpp2g":{"text":"This place is great! Food and drinks were delicious and the staff were friendly and knowle","useful":0,"cool":0},"1mRyEww0sE47VnLyoZD5Gw":{"text":"This is the best place we ate at on our trip to New Orleans! We've been to a handful of we","useful":1,"cool":1},"1VaVDu-v0hy6AyNOgwc_XA":{"text":"I visited this location for my sisters birthday on January 14th for her sweet 16. We were ","useful":0,"cool":0},"wi8dPydeIkTuozauNUrDmw":{"text":"In NOLA on a food tour to celebrate my daughter's sweet 16. It was recommended to us by ou","useful":3,"cool":1},"jadLA9ShhmzpES5ohelG9Q":{"text":"Stopped in for happy hour- $.75 raw oysters, 2-for-1 frozen cocktails (pomegranate mojito,","useful":2,"cool":2},"qShIXbzjYlT8yG9pIN8i5w":{"text":"We decided to stay in a different area than the famous Canal Street area and stayed in the","useful":2,"cool":0},"CVu5ZQ4002Ogjt_lQglRXg":{"text":"I loved the catfish Napoleon and definitely loved the frozen Moscow mule. There were happy","useful":2,"cool":0},"NFpW5msmwBeYEpHPR-bgGg":{"text":"i have to give this place 5 stars because - well, it really. was. PHENOMENAL. \n\ni had the ","useful":1,"cool":0},"2qu5LvaHSP9vhpsggQxWJg":{"text":"This actually ended up being my favorite restaurant in all of New Orleans. \n\nFirst of all,","useful":6,"cool":4},"NtZg4D4reC2B_MGu345NQw":{"text":"This is such a great spot for lunch. The atmosphere on the patio overlooking St. Charles i","useful":0,"cool":0},"FLER6JT9NJU_GWjrPn5EIA":{"text":"Great food. Really fresh bread. Nice selection of wines. Reasonably priced with very good ","useful":0,"cool":0},"8R0OLMaV1N2NBO8xVAoSZg":{"text":"This is one of my favorite spots for happy hour. They have $0.50 cent oysters from 4-6:30 ","useful":5,"cool":4},"wP_mLcL0Vl-1X_VcQ8lStA":{"text":"Excellent oysters but the crab claws were absolutely delicious!  We got our food to go and","useful":2,"cool":0},"cJGysXbhmk3HFGyPy-Uf_w":{"text":"Literally the best of the best! There was one point I was going every weekend. Everything ","useful":0,"cool":0},"scfvZ-KHWShrM6Va6qpK3g":{"text":"Their chargrilled oysters and crab crawfish bisque beyond yummy! Honestly I can't stop thi","useful":1,"cool":0},"Df28rIYavikJUIW0zS1b6A":{"text":"I have to say that even after a Mardi Gras parade, there has been no wait! The food and se","useful":4,"cool":4},"AmVZK99iPnme80nJbQqdYQ":{"text":"I can't believe I haven't tried Superior's brunch this whole time I have lived here! I had","useful":1,"cool":1},"fcyC6xN2CsKydFR74oYG2w":{"text":"I recently ordered the BBQ Shrimps and Grits over the phone. The staff member who helped m","useful":1,"cool":1},"ZVh5_n3eaqK6alKxPAZ80w":{"text":"The food was delightful, tried a bit of everything to get all the flavors from New Orleans","useful":1,"cool":0},"sK4AoMdpYxzz4jKcjasfTQ":{"text":"It's not terrible; it's not great. Seafood wise, there are many other places in the area t","useful":0,"cool":0},"g3ra4sbyzdph-7MJIq0xRA":{"text":"5 stars for their oyster happy hour! Happy hour is daily from 4-630pm. We were only able t","useful":1,"cool":0},"oiWKMtcq3DdY_xZUCiCQBA":{"text":"My fiancé, friend, and I had dinner reservations for this restaurant last night! I made re","useful":0,"cool":0},"Y3QgbArNEJxC3FrWKcMSpg":{"text":"This is a MUST go to place in Nola if you like seafood. We went here during their happy ho","useful":1,"cool":1},"8emcGlfqMqr4uiXJPOlPfQ":{"text":"I came here for my first meal in New Orleans and it was the PERFECT start. Everything I ha","useful":1,"cool":1},"hSKIHmTKsvQia1hRKtTUeg":{"text":"Great spot for a huge dinner if you are staying in the Garden District. Crawfish cornbread","useful":2,"cool":1},"Pzz_TLJEHinG-fo3MK8LWw":{"text":"Wow! I am from new Orleans and wow. The food was amazing but the service was probably one ","useful":0,"cool":0},"b7Mc5JWg8balFOU7tmKlkw":{"text":"Food is very good! The catfish napoleon was delicious and the bread pudding is a must. The","useful":0,"cool":0},"2OK5TJxGGxDyVhbBuxyogQ":{"text":"Had Superior for brunch and it did not disappoint! Got the Superior Eggs Sardou from their","useful":0,"cool":0},"I7w8IfB_DYlmCZEfsk0gQQ":{"text":"Was expecting a wow, but came out to be not so wow.  Great waiter name David, but the food","useful":1,"cool":0},"LbRn4Xbu_qWjaHAZ8k-SOA":{"text":"This establishment is located in the college town of New Orleans.  The whole area is very ","useful":48,"cool":44},"HSIghpZMUwv4OaXT1DP-jg":{"text":"Really amazing experience. We went during happy hour both times and loved it! Their salads","useful":1,"cool":0},"6zvALsh2vm-Bl8_BJnCLoQ":{"text":"Best happy hour oysters that I have had! During happy hour (4-6:30 pm daily), oysters are ","useful":0,"cool":0},"Nk2_Pqq0ow8SN_ixs46kWw":{"text":"These guys went above and beyond for us today. I don't eat seafood but I wanted pasta. The","useful":2,"cool":1},"jZYBsl1QSUHK806sQcoyUw":{"text":"This review is for their happy hour and I'm definitely a fan! Their happy hour is best for","useful":3,"cool":0},"mEsno-W0u-DJktzT9dP9fg":{"text":"Superior Grill is a long overdue addition to the string a restaurants along the St. Charle","useful":2,"cool":2},"AygaouvBL5BMMoXpYvdXFQ":{"text":"This was a stop on our \"green line\" trolley and it looked like a popular place, so we deci","useful":4,"cool":3},"4ActLAT-NgiSPQ0qCBW-XQ":{"text":"Went here for Mother's Day dinner and had a wonderful time! They had live jazz music and t","useful":2,"cool":0},"HZ0cIW-OIHZu9L05NdCldA":{"text":"Can't say enough.  I so look forward to my visit here when I hit NOLA. Although the drinks","useful":0,"cool":0},"fSw1z98tBiB7Xr9mpGgMAA":{"text":"Oysters Oysters who's got the Oysters, Superior that's who!\n\nService,  food,  drinks!  Thi","useful":0,"cool":0},"x4m0UyPfwIZepVPAyhTW6A":{"text":"Excelent fresh oysters, drinks coupled with impeccable service. Visit during Happy Hour, o","useful":0,"cool":0},"8cXdbSK93GcQFJCA_gieVA":{"text":"Excellent seafood restaurant!! Make sure to get their blended pomegranate mojito!! Got the","useful":0,"cool":0},"1LAUgszVENSznhDR1Q9RNA":{"text":"Had a great lunch on the patio with our server Ashley! The seafood avocado appetizer was s","useful":0,"cool":0},"cgx_SASQw_mBoAfWCatI7A":{"text":"Amazing service! Attentive to food sensitivities!\n\nThe oysters!! The warm bread!! This fro","useful":0,"cool":0},"ts6d-xxq8in13c4ekiYbCA":{"text":"Food, drinks, dessert  and customer service was all 5 star!!!! Well worth the cost, I enjo","useful":0,"cool":1},"-sMZthVzaRee4VCtaOHBcQ":{"text":"Everything that I tasted was EXCELLENT. So I personally ordered shrimp n grits, crawfish b","useful":1,"cool":1},"5TebCUTX1JjVje6Pfmy9ig":{"text":"Went here on my vacation to New Orleans. All tourists and locals need to stop by here. The","useful":1,"cool":1},"j33Lkti2-Urla-miAILZXQ":{"text":"Winnie the Pooh may have the land of milk and honey.. but New Orleans has the land of Char","useful":8,"cool":6},"tLgDqK6gBe_9nvcg0mBN3A":{"text":"In the former Copeland's on St. Charles. \nOrdered the  Chargrilled oysters well seasoned a","useful":3,"cool":1},"uxSQvoB6F-UbXM4FaAbbXw":{"text":"I've been here a few times and I do not see what the hype is all about. This place is alwa","useful":1,"cool":0},"j3joJlUXFdCNMOt8OnR6GA":{"text":"Charbroiled oysters. That's the post. \n\nHappy hour, dinner, brunch - you can't go wrong. T","useful":0,"cool":0},"1VvmSGsxIFBMG0TvDmz2FQ":{"text":"Thank you so much Nathan! He was an incredible waiter and he was so accommodating. We were","useful":0,"cool":0},"b2p2PCQ4kXNICI0KeNJ9Xw":{"text":"Classy restaurant with great service. Valley parking available. Complimentary bread with b","useful":1,"cool":1},"vacwUKD0Qg2tO7ei7E12JQ":{"text":"Superior Seafood is my go-to place for happy hour and to show off New Orleans to my out-of","useful":2,"cool":1},"AY3BFLeZhUKgVR7Np1vDLQ":{"text":"The chargrilled oysters are FRESH and very tasty. I also had the frozen French 75 which wa","useful":1,"cool":0},"S-L8qbcUNdsc7-ZvDTxNBQ":{"text":"I went here while visiting my granny for my birthday.     The only reason I am giving this","useful":1,"cool":0},"utoIt78UpOIuVm4vx5jWTw":{"text":"While in NOLA for 5 days in October, we ate at Commander's Palace, GW Fins, Antoine's, etc","useful":0,"cool":0},"mkPmk4a-b-YftT4oKi5uKQ":{"text":"we went there on advice from a local\nthe oysters were outstanding\nthe beer was ice cold \nt","useful":0,"cool":0},"LMbYPH0DiSdq7Xcx9uwTKw":{"text":"In town for an Anderson .Paak concert and definitely needed some charbroiled oysters that ","useful":1,"cool":2},"jgqJ7ZEnCnkstnnyI4TF1A":{"text":"This is a popular spot among both tourists and students, so it's always crowded. Be sure t","useful":2,"cool":1},"y93CV2ckQy-Ol_vC9Zwb2w":{"text":"Excellent service, amazing food! We started with oysters, of course. I got the shrimp and ","useful":1,"cool":0},"ysLRG_pbNRhCQ-6m9f4xXg":{"text":"I used to come to this location when it was Copelands Restaurant years ago. The new owner ","useful":7,"cool":2},"T69E1tU2vkIZyPCRPykCfw":{"text":"Everything was great here!\nCrawfish soup was delicious along with the shrimp and grits. We","useful":1,"cool":0},"AY_4T7QFB_OQeZCwvjZo2Q":{"text":"BEST OYSTERS in New Orleans. Sweet and juicy. It was the best way to end the trip. Our wai","useful":0,"cool":0},"JnpW4IOCZ-k1j6f6TB8K-Q":{"text":"Two dozens of FRESH oysters x $12 per later (HH rate), my faith in NOLA cuisine has been r","useful":1,"cool":0},"YNxQ9uPeth4vXiwxLqm_fQ":{"text":"This place is always amazing: the food, service, and atmosphere. My mom and I came here fo","useful":2,"cool":1},"KnlHw7Cs81MIvyh7vxT_rg":{"text":"Everything was SUPERB! Happy Hour was awesome! The staff here is the BEST! I loved the sal","useful":0,"cool":0},"gSLzLRrYMCVDBihKJGSJ1Q":{"text":"Went here for date night with the hubby when we couldn't find the new Johnny Da place.  Th","useful":2,"cool":1},"jLFSaiilteVt0cJf9XScuQ":{"text":"(2 of 2) \n\nMy entree was a little hard to pronounce but sooo very easy to devour!! The Tch","useful":2,"cool":1},"VE8UAXSuhS7V7I5h42RvoQ":{"text":"My husband and I were in town for a few days and decided to explore New Orleans along Sain","useful":0,"cool":0},"Hsic-Jby57h7b9fz8z2tLQ":{"text":"Happy hour everyday!! $3 wine & .50 oysters. Hell yeah!\n\nWe were actually going to 'anothe","useful":7,"cool":1},"Od4jk-Sg2PaieRA8LPfCDw":{"text":"Should be called mediocre seafood or just ok seafood.\n\nThe appetizers were the best part o","useful":0,"cool":0},"GKgVozV5WJRunxY-fnMa6w":{"text":"Happy hour is a good bang for your buck. The frozen French 75s are booze filled and refres","useful":0,"cool":1},"vtiUspAVTYMBNo-jsHo-vQ":{"text":"Let me start by saying this restaurant has great service ! We made a reservation since it ","useful":0,"cool":0},"hH4P39Q5FM2fpflhBgBwag":{"text":"Ohhh boy! What a place!!! I brought my best friend Adam and met my other good buddy Evan f","useful":2,"cool":1},"HQrRyFMzT-GKAYc2MZNGmA":{"text":"We ate here for my birthday dinner during our last visit to NOLA, and it did not disappoin","useful":0,"cool":0},"IKmCI_7h7TUHfMTmAANBPg":{"text":"A must if you are visiting New Orleans. Delicious and authentic New Orleans dining. Some o","useful":1,"cool":1},"SGOHZ_FHDtjm4oO8vG0FPQ":{"text":"Good happy hour from 4pm-630pm: .75 raw oysters and discounted drinks including frozens an","useful":2,"cool":1},"88-SNvFAUiS1tkpNHCYQaw":{"text":"Our visit to Superior Seafood was the answer to the post-museum hunger blues one Saturday.","useful":2,"cool":1},"NG9HgpT7ik3w04PhGDKHHQ":{"text":"We ALWAYS stop at Superior seafood no matter what when we're in NOLA. Superior's dollar oy","useful":3,"cool":1},"4IW_HQxBNnbtzweU0mDN_Q":{"text":"Can't believe I haven't made my way here sooner! Superior is a semi fancy/casual restauran","useful":1,"cool":0},"4Rw-M_ks1eHGIxcm0GrZuA":{"text":"Great steak, loved the whipped potatoes (mashed potatoes). Not to mention the bread was fr","useful":1,"cool":0},"h1l6oEh8RmAb9Qdlhk3pKg":{"text":"We had a wonderful lunch at Superior a couple weeks ago. We were seated quickly and got to","useful":0,"cool":0},"ZcqurG_ZclM3hzcdkyYW6w":{"text":"The service was trash! The waitress barely checked in on our table. When we asked the mana","useful":2,"cool":0},"9DME2FIr-Vedd9VWrR2Qww":{"text":"Stumbled upon this place as we were returning to the St. Charles Streetcar from our trip t","useful":2,"cool":0},"aimHcEbsB-GK9C06ErK4Zw":{"text":"The name says it all: Superior Seafood. Consistently great seafood (especially the oysters","useful":0,"cool":0},"wbXMhywVvtL0w2kYcOYq7A":{"text":"My friend and I ended up at Superior on Valentine's Day, which just happened to fall durin","useful":1,"cool":0},"SucFGYAwllxS3QGI8pLBIg":{"text":"Excellent meal and experience! Our first trip ever to New Orleans and we are staying down ","useful":0,"cool":0},"fKuuvnkkKi7gPU0aZroUeA":{"text":"This review is solely for the oyster happy hour, which may be the best deal you could get ","useful":4,"cool":1},"Va1yoU4VMqTgXvX-Wv7wlQ":{"text":"Went here during a college football game at happy hour. The bar was very crowded, but we w","useful":0,"cool":0},"RAgIv6HlJRnfCMj2EueIig":{"text":"Came here from a recommendation. Everything was a bit salty for my taste but a lot of my f","useful":0,"cool":0},"MAm3Tr8ylRCdkWvfxqvvow":{"text":"Ummm we love this place. If you want the perfect family friendly restaurant...come here. G","useful":0,"cool":0},"g6M0NVSQcPgxebH8dZyVGg":{"text":"The manager, Thomas, was rude and unaccommodating  during an interaction with him at the h","useful":0,"cool":0},"zuCxDvKHMCAvG0PJcqgxIw":{"text":"Unlike pretty much any and every restaurant, we walked in 10 min before closing, and they ","useful":3,"cool":2},"ANBOhwQSmOhlctodRZvLOw":{"text":"We got the oysters superior, crawfish and lobster bisque, blackened catfish and the flound","useful":0,"cool":0},"xSQeqSFvd4oCJAfa6f1xzA":{"text":"Happy hour 4-6:30pm! Oysters 75 cents each, large frozen drinks for the price of a small. ","useful":2,"cool":0},"he22Il8Vm5K1GP6Jc1XA6Q":{"text":"This restaurant can have all my money. Every dish I have tried here has been delicious. Th","useful":1,"cool":0},"maLGmOh9B4BevZqK59LALw":{"text":"Cannot get over the food at Superior! I've also recently tried their frozen pomegranate mo","useful":0,"cool":0},"njCu8Y3-loReZcbz6tF2UQ":{"text":"This place for the in the heart of all was fun. The food was just mediocre. Had the oyster","useful":1,"cool":0},"ExzTHpOn1eI5M9E6SAarWw":{"text":"Great place! Visited today and our server was amazing! Not only was he patient, he suggest","useful":0,"cool":0},"GH-PyPZqity8rARrEe9Dfw":{"text":"Great dinner tonight with happy hour oysters and pasta.  Grateful they're open.  Server wa","useful":0,"cool":0},"_WeBsOwtslsqRT20b4e-zg":{"text":"All I want to say is we will not be back.\nWe had a horrible server and the food was medioc","useful":1,"cool":0},"AxryVjcpOAYfBsBQhXcmiQ":{"text":"Oh, where to start.\n\nI was first of a party of six to arrive at a restaurant that was prob","useful":3,"cool":0},"RRASdB6STfb4Qpx972dSVw":{"text":"It took two hours to get our main course.  When it came out it was very disappointing.  Th","useful":0,"cool":0},"LwK9Y9fMDXRSkomFT70xFQ":{"text":"Love this place! It's much better than its counterpart, superior grill!\n\nOur waitress Ryan","useful":1,"cool":0},"EYTApzzFBISzjCd0mNf0Vg":{"text":"We arrived in NOLA a little later than expected and we were looking for a place to eat tha","useful":0,"cool":0},"n3_XCOlZ0t14s-NYjuLEGA":{"text":"Of all of the places we visited in NOLA, this was by far my least favorite. Which is disap","useful":1,"cool":0},"EkO_5pJbi5tT-wfGNfR--A":{"text":"I made a reservation at the beginning of the month for my sons graduation dinner which was","useful":1,"cool":2},"9ia_zWk9c63TJxajOQOfuQ":{"text":"The Hostess was horrible and it was we bothering her while she was looking at her phone ! ","useful":0,"cool":0},"N6CAWvmL--q0cG18hjL06w":{"text":"I went to Superior Seafood while visiting New Orleans with some girlfriends on 3/28/15. (I","useful":1,"cool":1},"hf4YSx7XF2CJqLBPYW4LOA":{"text":"As far as uptown restaurants go, superior seafood is a must go to! The service is stellar.","useful":4,"cool":1},"v_ZgvBFe-zCIQey56HpGWA":{"text":"This is a must try if you are in NOLA. Wait staff was amazing, food was amazing, ambiance ","useful":2,"cool":1},"u7C52ooAqW41St5fWhk1Lw":{"text":"My favorite place to eat in NOLA!!! Let's start with the bread, the french75 salad, the bi","useful":2,"cool":1},"akiUmm-kP8qkkbGVelkhjQ":{"text":"We came here for dinner on my birthday and I was super stoked based on the reviews and pic","useful":9,"cool":5},"-_eoVyz-emC9kwvhyfLCjQ":{"text":"This place is wonderful. We got the cornbread with crawfish and the catfish Napoleon. Prob","useful":1,"cool":0},"UtXzMQjoXT3fkgZe482Z-w":{"text":"One of the best place for oysters for cheap. I was in the area and I had to try their oyst","useful":5,"cool":7},"tDNk3uqc6jtZ8-_cX40cBQ":{"text":"Not bad. The oyster superior was just ok, nothing to write home about. The herb crusted he","useful":1,"cool":1},"bo7g35NZe21Lo0N7HHNBTQ":{"text":"Protocol: This place excepts reservation. I created mine on OpenTable. I recommend that yo","useful":0,"cool":0},"ti_W_LSsVlIqxlhH45eMNA":{"text":"I soooo wanted to love this place..but what I ate I wasn't impressed with. I had the shrim","useful":1,"cool":1},"lJ_NAxjA-qVC3W3ARi0V0w":{"text":"We have w work event here. This was my second time eating here but it had been a while. Th","useful":1,"cool":0},"QBB5T_ItcCzAQWTp-LEcFQ":{"text":"Loved Superior Seafood.  Rode the streetcar down, ordered a great drink, sang at the piano","useful":0,"cool":0},"j89Liozrhx0lu_o3yWVWtA":{"text":"Sat at the oyster bar it's a must, it's nice up close view of them opening the oysters. I'","useful":1,"cool":0},"ex2ueme6aFFxZwcg3w4wrg":{"text":"I will always be a fan of this place after they squeezed together chairs for us during mar","useful":2,"cool":0},"_LIg8ofMMC1YP6ECzE6YXQ":{"text":"So so good. I have to make time to come back here during their oyster happy hour (I think ","useful":1,"cool":0},"6Z0jSVpL40TRTXuRgxRP1g":{"text":"Their happy hour is the place to be .25 oysters and the pomegranate mojitos are great","useful":0,"cool":0},"Y9nppelxP50d6wzzLTQDJA":{"text":"Superior Seafood will always remain a staple of the New Orleans food scene. From their bak","useful":1,"cool":0},"NxmilguGZhPwryIpvB8adQ":{"text":"This is probably my all time favorite joint in NOLA. I went almost every other week when I","useful":1,"cool":0},"fCijW9MAftEyAOCO1zVaKA":{"text":"This place has wonderful food and prices. Their happy hour is great. $3.00 drafts and $0.5","useful":1,"cool":2},"Cu3bujbkwMGpMFLX_wqPCw":{"text":"Considering the extremely poor service and mediocre food, I would NOT recommend this resta","useful":0,"cool":0},"fXqrB5LOpia4A-qo9076GQ":{"text":"This wasn't my first time at Superior Seafood, but by far the best experience I've had thu","useful":1,"cool":1},"1NpfwENH-1LUi8o2Up2Dsw":{"text":"I think this seafood place is great for seafood lovers who are not too picky about their s","useful":0,"cool":0},"Pg0M1JqI5A2n4wumLq6LsQ":{"text":"We came here for dinner on our last night in New Orleans and wow it was so great!! We made","useful":2,"cool":0},"IlJ8grQjTOD2gEUZ3L8g0Q":{"text":"The oysters, the oysters, the oysters! First let me tell you that the manager Derek is ext","useful":0,"cool":0},"HMhzDg3-h8Te34VfNXZzRQ":{"text":"This place is so great! The food is solid, and the drinks are even better. I had the trout","useful":1,"cool":1},"tIWo8yVPX0Cv_0Smei56lQ":{"text":"Inferior experience. We won't be back. Wait staff seemed rushed and short-staffed, even wh","useful":0,"cool":0},"6Hvx9NWs9YlcYLY6KHkiGA":{"text":"Super below average food. The gumbo is brown gravey. The bisque is Super yummy at first bu","useful":0,"cool":0},"XUSThlKEN2gTcVKHiG3MUQ":{"text":"Went last night sat the for 15 minutes (party of 2) nobody came to our table however as ot","useful":0,"cool":0},"PdChW3fv1eHJiSzAXm4KgA":{"text":"On our last day in New Orleans, my cousin brought us around to a couple of culinary hot sp","useful":5,"cool":4},"Ye16qpYIrZRYFoOCIKktDQ":{"text":"When you make a reservation for an outdoor table, and you are seated at an oyster bar 20 m","useful":0,"cool":0},"mPHTAD2Uee9UIocthyWPXQ":{"text":"No matter how good the food is, losing your customer's number on the waitlist, having your","useful":0,"cool":0},"L1_W0H3DgOv9nFnFX3Pyqw":{"text":"I was hipped to their $0.50 raw oysters happy hour by a local yelper and I knew I had to t","useful":2,"cool":2},"V6D9YXbSVJBC3QG_WX9YXA":{"text":"Happy hour review!\n\nThe details:\n\nTime: Daily 4-6:30pm (time might change, so check before","useful":2,"cool":1},"xhTiYb3YhOfje7DC-BEOdg":{"text":"I had a great time at Superior Seafood with even better company. My friends and I came on ","useful":2,"cool":1},"RXvDc8T6-kVxxG2s_ZyN4g":{"text":"Its loud.   The food is very good but damn its so loud.   I have a very hard time hearing ","useful":4,"cool":1},"cg3Qh6Cqz1dn3ffWSZPFAg":{"text":"The best place to get happy hour oysters! I always bring out of towners here to try the ra","useful":1,"cool":0},"WZ-L0l97SZmyYyn9oQ1jBg":{"text":"Used to be our favorite restaurant has gone way downhill. Cockroach on the table after we ","useful":0,"cool":0},"cA1t588EbO18AU6DsKXw0A":{"text":"Well, I tried the superior Grill and I was so impressed that I had to go to their partner ","useful":0,"cool":0},"ZAk0tsfcN62N-g_5Xypz6Q":{"text":"When in New Orleans, one must eat seafood, right? Exactly what we thought. So, we made res","useful":2,"cool":1},"GnSt2slajxGgDyvcs1DSYw":{"text":"Food mediocre.  Nothing special.  We were placed outside with no heaters working and it wa","useful":0,"cool":0},"XFzYlAtW0zc2Dhm4vwCr3w":{"text":"Best oysters EVER!! Great seafood and wonderful service. Was recommended by a chef from an","useful":0,"cool":0},"hWJrtZwlh6sFY4_QD202ig":{"text":"This place definitely has some of the best oysters I've ever had. I highly recommend the c","useful":2,"cool":0},"OfIEVxoxSlKzqiPNifYyTg":{"text":"Our waitress Emma was amazing . She had great recommendations and was very attentive to ou","useful":0,"cool":0},"ZMRLs2bxlum17qi-k2sBZw":{"text":"This was fabulous!!! \nI was disappointed because my favorite happy hour restaurant closed.","useful":1,"cool":1},"3GWly_HxrUxSSTl1NZfZZg":{"text":"Amazing shrimp wrapped in bacon! Also, charbroiled oysters and the best bread pudding!! Wa","useful":0,"cool":0},"7Bu8YyPc3SZ2CwtiDDtcgA":{"text":"This place is always super crowded- I used to think it was more hyped up than it was worth","useful":1,"cool":1},"GOBwPV3u5fL7F9QchRIYbg":{"text":"We were looking forward to a nice dinner at Superior Seafood & Oyster Bar. Unfortunately, ","useful":0,"cool":0},"xgM-SpgD_SYUDMS01Kwkqw":{"text":"Really good food. Go during happy hour for great prices on alcohol and appetizers. Our ser","useful":0,"cool":0},"RaOxLQRSt1hk04eJOdjqIA":{"text":"Superior Seafood was a gem we stumbled upon online and we were so glad we made a reservati","useful":1,"cool":0},"V7DUIHkwdRf5v3E2FbztDQ":{"text":"This is one of my go to spots when I am visiting New Orleans. Everything that I have ever ","useful":0,"cool":0},"DnLoTj-jEccrpSRtuUaGHA":{"text":"The architecture and decor of the patio area\nis very attractive.  Eating here is like sitt","useful":0,"cool":0},"XIWxbfc0B31LVZgd-RMGtw":{"text":"This place is wonderful. Food was great--highly recommend the redfish. However, the true s","useful":0,"cool":0},"bzgl-N_g2E7W_MHrnljoSQ":{"text":"Overall, our experience was pretty decent. Our waiter was nice but there were a few hiccup","useful":0,"cool":0},"kF8xDOwg6zGXOKKPPo5oVA":{"text":"There are plenty of great reviews already so I'll spare you all the food details. \nVisited","useful":1,"cool":2},"e699J2VyI7VVFEvr9gafKQ":{"text":"We visited again on 7/26 for dinner and had an equally enjoyable and tasty meal. This plac","useful":0,"cool":0},"xGdlLzSlvuzEQs-0cTM2Ng":{"text":"Wow. I loved it here. The food was amazing. The frozen French 75 is a must try. If you com","useful":0,"cool":0},"tHOyxNXB1o4Fcnq5wXvLVA":{"text":"I have been to superior countless times and love it, but was very disappointed on Sunday n","useful":0,"cool":0},"xiRGKCtwPjVJln2jA4-M3Q":{"text":"We ended up here as an effort to try a new seafood place instead of our standard. For a Mo","useful":0,"cool":0},"Dy8YuwFCtK9PQ9C5VSQE4A":{"text":"Food was DELICIOUS! And the service was amazing! Our server was very attentive even with t","useful":1,"cool":1},"-diov_VG8sHqbN7DFYs80w":{"text":"This was such a wonderful experience. Y'all. Drinks insane!! The frozen Paloma was somethi","useful":1,"cool":1},"p186SvOV7cT1j_sgGp4G8g":{"text":"Great atmosphere and food.   Right off st Charles street car.","useful":0,"cool":0},"-ty1lHDxUw0dY3l9OdW4hg":{"text":"Oyster lovers must go. Happy hour from 4:30-6:30 everyday ($.75 raw oysters, $4 beer and w","useful":0,"cool":0},"ad9VTUkOBRA0wItyGtTeiQ":{"text":"You can catch me here at Superior seafood half off oyster and frozen drinks HAPPY HOUR fro","useful":11,"cool":9},"PKItBUd1BHJgrrlmC3ajTg":{"text":"The serving staff is pleasant, the ambiance is decent. I don't feel\nAs though the food is ","useful":3,"cool":1},"f3Q4s14jQe9fbvBnq2CpwQ":{"text":"Food /drink \n1.) Crawfish cornbread - yum! With the sauce and small bits of sausage \n2.) S","useful":1,"cool":0},"0oucVfNBybcSw6XUFeFeDg":{"text":"We have become regulars at this joint, thanks to several very bright spots:\n\n- Solid servi","useful":3,"cool":2},"7MAX2ZVz4wFrFkOaYN-BDA":{"text":"Great happy hour deals and I really enjoyed my blackened fish Napoleon. My friend thought ","useful":1,"cool":1},"BD-t5HjIlN8CpqC5r6DR7g":{"text":"We stopped into this restaurant mid afternoon to grab happy hour. It's located right off o","useful":4,"cool":2},"4uvHnyBDVoGz6Haivu_r5Q":{"text":"The delicious loaf of French bread brought to our table upon being seated was a sign of go","useful":2,"cool":0},"pqHbWIr5l-Tu_CwYHNP-Ew":{"text":"BEST OYSTER HAPPY HOUR!!!!\n4-6:30 They have $5 glasses of wine and beer, and .75 oysters. ","useful":2,"cool":0},"3TcYd1-kuIZwv5TjU2ORvg":{"text":"Go here. Sit at the bar. Order a Frozen French 75. Admire the carvings behind the bar and ","useful":1,"cool":1},"VpM7v2-OSwgyLNuU204CQw":{"text":"Believe it or not, I don't eat seafood so it's hard for me to give a true 5 stars. My frie","useful":1,"cool":0},"Z5ZwmVbxoaY-lI7GOzzhzw":{"text":"Basic seafood restaurant, the food was good, but not super flavorful or memorable. I do no","useful":0,"cool":0},"RLTKugTPenmhs-6ae2TH4w":{"text":"Delicious food with large portions. This would be a five star review, but the wait time wa","useful":0,"cool":0},"xbrwvyAyhMD_FMfTwpNVXQ":{"text":"Oooof. Big miss. Service was okay but we asked to sit outside and the hostess asked if we ","useful":3,"cool":0},"QE5y_Ubw8hnm1LcXdqBXSQ":{"text":"Overpriced for what you get - food, service, and environment, wise. The seafood was pretty","useful":1,"cool":0},"pYCgVNb8bsSI28F3CiP1JA":{"text":"I would recommend to come here only during happy hour for their rawed oysters and drinks. ","useful":1,"cool":1},"aA66wTbKR09ygfGV8ChYHQ":{"text":"AMAZING!!! First off, no wait. Made a reservation on open table - sat immediately. Our ser","useful":1,"cool":0},"ruvQM2y1nEkTrMutDL9YXw":{"text":"First time visiting this restaurant. Everything was extremely delicious. We started off wi","useful":0,"cool":0},"Jn2L2oz25IVMIlUq6C8dEA":{"text":"This has to be THE BEST food we have had in a long time!!  The salmon and risotto was amaz","useful":1,"cool":0},"Jf0fO3TegEHv4NcZ1Q9KYA":{"text":"Loved the food there. Had a relative who went there often. Margaritas are great, and so wa","useful":0,"cool":0},"w3cUuUeojXWDDSSWeAo0aw":{"text":"Went there Sunday and had a hair in the seafood pasta. Told the waiter who left the plate ","useful":1,"cool":0},"C2A-NmRFQua225BDUilGzQ":{"text":"I stopped by this place on a whim based upon the reviews of my fellow Yelpers. I was there","useful":3,"cool":3},"98aoFg1XTNS_nT17VuQW0w":{"text":"So, I had to delete my previous recommendation of Superior Seafood and it pains me to writ","useful":0,"cool":0},"ip2hkWswiWfl6fO0Ay8dkQ":{"text":"Had such a great experience and had the best server, Hannah. They were super accommodating","useful":0,"cool":0},"Fu9wKQ_NgV4jH1KfqWPFag":{"text":"Food was ok! Had an issue with people coming after me and being seated before my party and","useful":0,"cool":0},"uQWDOPg3CI4tqiaL2OAEFw":{"text":"Food 5/5: It was my first time trying char-grilled oysters and I've to say it was phenomen","useful":3,"cool":3},"5Y2A8zG8sFPd7a72Z_2Zqw":{"text":"It is sometimes unfair to review New Orleans restaurants.  Upon returning from my most rec","useful":0,"cool":0},"4nyYK7X2H6FD5730jppfSQ":{"text":"I was pleasantly surprised that Superior, the temple of seafood, actually had a vegan opti","useful":1,"cool":0},"B1SQ4ZwnHKPZhW2N5u7JaQ":{"text":"This place was incredible. Love the food, love the environment, waitress was awesome......","useful":0,"cool":0},"TRo0CZ14QcAEgPqHX6Z4Gg":{"text":"(pre-COVID)\n\nI've always had a pleasant experience here especially during Mardi Gras seaso","useful":19,"cool":14},"VYvy08Yah7l5Sf4B70T31A":{"text":"This started off terribly wrong as I had reserved a table outdoors and when we arrived we ","useful":0,"cool":0},"qjKNJuluWRK0pUm3FNqVuw":{"text":"Ended up checking this place out last minute and lucky we did!\n\nThe chicken sandwich was g","useful":2,"cool":1},"rTeVQda54YOLILoktH40hg":{"text":"Superior Seafood...isn't.\n\nIt isn't superior in any way unless loudness and possible food ","useful":9,"cool":3},"ffgcOvpa8vegTliQguhiEg":{"text":"Moved to New Orleans 2 months ago and I've been here 5 times now! Every time I've gone the","useful":0,"cool":0},"TABX3-ZJDXBABuGw1imdyA":{"text":"Went to Superior Seafood & Oyster Bar because I wanted seafood and a salad and I got just ","useful":1,"cool":0},"FohVwagVlgiq6ls1EMqGmQ":{"text":"Three words. Happy. Hour. Oysters. From 4-6 (don't quote me) raw oysters are 50c each. Not","useful":3,"cool":1},"c4qAtk0UOG-Gk-rmdataqA":{"text":"I ordered the Shrimp Monica here. The pasta was so creamy and the shrimp were succulent. I","useful":4,"cool":2},"IPUOUGluyi_JP8P9suKElQ":{"text":"A staple of NOLA, Superior Seafood lives up to its name. Delicious entrees, excellent oyst","useful":0,"cool":0},"qOgIxJgIcLmYgvLiLmx_Xg":{"text":"July 2020; masks worn by employees; Average food. Loud environment. Would describe it as a","useful":1,"cool":0},"0AdK9DunwXWUVKuTlBiUrA":{"text":"Food was excellent and the service was fast and efficient. Mr. Sutton was our waiter and h","useful":1,"cool":0},"Ub8cc3nEdxZcMZcd4dyIYQ":{"text":"Got there a little before 9, ordered grilled fish mash potatoes and corn waited 40 minutes","useful":0,"cool":0},"EXGLwXW_O3a_pcCh2lmaHg":{"text":"Oyster happy hour is worth the trip alone, but everything we tried from food, drinks, and ","useful":0,"cool":0},"KsV8EG55SjwrwW99ivsGyw":{"text":"I was here almost 2 weeks ago. It was a saturday afternoon and we stopped by for some happ","useful":0,"cool":0},"VAsD3b2fR-0EEfU8N_tF2A":{"text":"Ivy rose was the best waitress and we had the most phenomenal service and food. All credit","useful":0,"cool":0},"JfoJc9jdamtN3-mGvGgxrw":{"text":"I had heard about this restaurant for so long so we decided to try it out. We went one day","useful":2,"cool":0},"4-Vpbf_rCoFwkOdpTHoURQ":{"text":"I really love this place and the service is wonderful ... I can't wait to go back we was s","useful":0,"cool":0},"85gQg1bDdvVuAwEAFZcurw":{"text":"STEVEN WAS AMAZING!!! very attentive to the table and kept an eye out for good deals. im s","useful":0,"cool":0},"uxvXnqJIVPbVg-UjYfmohg":{"text":"Always eat where the locals eat.... this is that place...\n\nFirst off, great decor and atmo","useful":1,"cool":1},"c38OkqxColnY3WoB-IroTA":{"text":"Good food. Great deal on Oysters which is the only reason we go there. We stop there every","useful":1,"cool":0},"0BvokoP8-UDSB62XV-_u5Q":{"text":"My partner and I celebrated our anniversary at Superior because he wanted really good oyst","useful":0,"cool":0},"6Trof_dSM-6fQ58TB-6yjw":{"text":"We came here for my birthday a few weeks ago. They offer happy hour from 4-6:30 pm daily. ","useful":2,"cool":2},"TrwJ5_IN3PpCIJ9djk2PaQ":{"text":"The food here is excellent! The hostess was a bit winded and took a while to seat us consi","useful":2,"cool":3},"0uF4knFkCQmGMuHLEihF3A":{"text":"I've been here twice now and had a ball both times, first with a cycling group and second ","useful":3,"cool":3},"aUJnPbnsKNsGtwQ_LHfDiQ":{"text":"Yes!!! Food was amazing!! Service was prompt and very friendly. Would definitely recommend","useful":0,"cool":0},"WLeEusazMCNNeY73QatTxw":{"text":"I had to leave Superior Seafood last month. Social distancing between tables was not obser","useful":1,"cool":0},"pfP-18V5PBo_KIz3jOU08w":{"text":"Really enjoyable meal. It was fairly loud but that just seems to be a New Orleans thing. I","useful":0,"cool":1},"bJYoQBNnn0XDh1VMNcXqFA":{"text":"*3.5 stars*\n\nArriving around 8pm on a Tuesday evening there wasn't much of a wait. The hos","useful":2,"cool":0},"qFl2HZdNf2Es4x17u0JXbw":{"text":"Start your new during happy hour! Frozen drinks are delish. The bisque is tasty. Tried gri","useful":0,"cool":0},"W_TD3iXIepR_UX-KhEl99A":{"text":"We're from out of town and were very excited to eat at this restaurant. It was a shame to ","useful":0,"cool":0},"jvMZ9nTXdue5HIlb-uWZIw":{"text":"This place deserves 5* just because of how worth it is. If you come during happy hour, the","useful":1,"cool":0},"MuT08SdB56ULPyfkGmcvVg":{"text":"We came for the oyster happy hour. We ordered 3 dozen and enjoyed every last one of them! ","useful":1,"cool":1},"3Vp0hjWiYHSutkGnL7EwPA":{"text":"Normally I would give this joint 3 stars but here's what pushed them over the edge. Appare","useful":4,"cool":2},"dHalbSMFgbFrt035UkeOjA":{"text":"Their happy hour is fantastic! I went for my birthday with my boyfriend. We ordered a doze","useful":2,"cool":3},"w8SXPRIrunwXSlOoTbpCeA":{"text":"Omg, this place was excellent. Good food, service, and drinks. Our first time was great. W","useful":0,"cool":0},"WcOj_Canj5oUhtvZDg91yg":{"text":"You have to come here for their Happy Hour.  $0.75 oysters that are to die for.  If you co","useful":5,"cool":3},"War3X5abcMuOFT1tiya8vA":{"text":"Best Cheesy Char-Grilled Oysters I've ever had in the history of the world! That is all...","useful":0,"cool":0},"9abV1ZNu7K_7D26sq9S7fw":{"text":"This place has turned into a tourist trap. Gumbo is absolutely awful it is nothing like Ne","useful":2,"cool":0},"uCxWW4BuC-qatr4Wa35l2w":{"text":"Best oyster happy hour in the city! 50cents raw oysters on the half shell everyday from 4-","useful":1,"cool":0},"D8G-VniWDcx-9AEVpqDbhw":{"text":"Man, I LOVED this place.  I am still thinking about the chargrilled oysters and the frozen","useful":1,"cool":1},"zXVH0Cr0jXC8r5hBw8vRzQ":{"text":"Our favorite place to be during happy hour! Shrimp and grits, booze and oysters! Deffo com","useful":0,"cool":0},"pS1irR1QxdpzfShac79FIQ":{"text":"I came here with family while visiting New Orleans. My aunt wanted to take my boyfriend an","useful":2,"cool":1},"aIKiL9HxAF0RacWIGH3uMQ":{"text":"I'm giving this grubbery a 5-Star rating because it is one of the best seafood places I ha","useful":2,"cool":0},"hNeCQOOpuy0daiUo3g90cQ":{"text":"Nice spot! My friend took me here yesterday for brunch, I ordered the chicken and biscuits","useful":1,"cool":0},"uE-Xf-The93C-nHjfj7gww":{"text":"This is one of those times that I really, really wish Yelp allowed .5 star ratings because","useful":1,"cool":0},"U12O9v59AbWKSWXT8434rw":{"text":"A must-place-to-eat-that-isnt-near-Burbon! Highly recommend the broiled oysters. They're s","useful":2,"cool":1},"ceGytXWSfsbxIRdclsAPSA":{"text":"I want to start off by saying I've been in \nHospitality for over 15 years, very big on ser","useful":0,"cool":0},"jCint5zcEX3kTKtNzB59oA":{"text":"This is always very nice place to have brunch. It is centrally located, relatively easy pa","useful":0,"cool":0},"N24oEGOcSyHQVY5Cu-orUA":{"text":"A huge fan of this place for years! The happy hour (offered every day) is one of the best ","useful":0,"cool":2},"cZYysdzd6sgicxv3mq2Jnw":{"text":"We are in NOLA visiting from Austin. Came in hoping for some good oysters. Food was very m","useful":0,"cool":0},"bn3Gbv2ZjHYf9HClA2vgKw":{"text":"Still a great place to take people who are new to the city and looking for a nice introduc","useful":8,"cool":7},"iICCB-Uz3I5fDSbQS1V57g":{"text":"Walked by the internationally known chef Aàron Sanchez when we got seated and knew it was ","useful":0,"cool":0},"Vuk9tdxQT1HRE5P9hXw4Gg":{"text":"We strolled into Superior on a Sunday after riding the streetcar over from the CBD. Surpri","useful":3,"cool":1},"--q-8CWlgnehsZMGRZToog":{"text":"Ive been meaning to try this place for years, but have so many favorite restaurants in thi","useful":3,"cool":2},"G8HJxedrQdWosGENtBqOaA":{"text":"The food here is second to none, from the oysters to the blackened fish to the desserts. I","useful":0,"cool":0}}