{"MNTS0dMPOaf7yOE6a1Av_Q":{"text":"I love markets like this!  Love experiencing local art and food.  It is a nice mix of typi","useful":0,"cool":0},"E82-HH0dsZo8DHBQLFTXGg":{"text":"So this place is like a farmers market/flea market type of place. Perfect spot to shop for","useful":0,"cool":0},"-Mi7P6legWQMKnIVNZXQrA":{"text":"The French Market is ridiculously touristy to the point of being nearly non-relevent. It t","useful":0,"cool":0},"9a5iUiVw-R3hEuDad87Bfw":{"text":"Always a great area for tourists and some neat finds. Wish they had a little better food s","useful":6,"cool":5},"PUyPGvAkKbb7xyoNvncwPw":{"text":"The French Market... a truly wonderful experience. You want thingamabobs, they got at leas","useful":3,"cool":6},"UilKHfK3oPvG7beKR3_ENQ":{"text":"An ok place to visit if you are close by. We were within walking distance so we checked it","useful":0,"cool":0},"6DQroeqdjcahMHf9O7puyQ":{"text":"This is definitely the place for tourists to buy souvenirs to bring back home. They're way","useful":0,"cool":0},"9laWiiMx3w6mS2w-Bx8TJg":{"text":"Used to absolutely LOVE this place! Coming to New Orleans, this was one of our must see pl","useful":3,"cool":0},"IiK--xwCxZY2XHLYWBwX7A":{"text":"Cool atmosphere with vendors selling great food! Some artisan good and some imports. I wou","useful":0,"cool":0},"JbfOHiZlF1Ds96cnYdYtNA":{"text":"Yes, cheap souvenirs. Many stalls selling inexpensive jewelry and spices, T shirts, and al","useful":0,"cool":0},"63pTPhX_bDjSHvTMzVH07A":{"text":"I don't understand why the French Market has such a low rating.  \n\nSure, it's always packe","useful":6,"cool":0},"R3aEXJaYxkU95CzRgNyelQ":{"text":"Two and a half stars. I've been spoiled by Eastern Market on my home turf. Less farmer's m","useful":5,"cool":5},"gjMqKT7A8QKIPNBU5rHo0Q":{"text":"Love alligator!! You should try it!! Fresh oyster and gumbo are good choices!!","useful":0,"cool":0},"Fl0jUeECpnXflH0zGTCHEg":{"text":"Sadly, there does not seem to be much that is French about the French Market anymore. I do","useful":6,"cool":3},"Iqu-zzmXpOmeJFmKVY0ENQ":{"text":"So much to see and wall through.  You might be able to catch some awesome art and souvenir","useful":1,"cool":1},"v-R1ehtsOJDP2zIiKp23fg":{"text":"This place was a big let down. This is billed as a farmer's market, but is really just a b","useful":3,"cool":0},"Uqcpbae0pLQ9TLuu-aU7gg":{"text":"This open air market is really cute. There are some good options to buy souvenirs from loc","useful":0,"cool":0},"4awubJcTkinXXkf8D8JrEg":{"text":"Definitely should be a stop as an attraction to visit while in New Orleans! There are vari","useful":1,"cool":2},"Bq3HnjG7dfImaqJPih5PFA":{"text":"If you love junk shopping this place is for you, also agreat spot to load up on cheap stuf","useful":0,"cool":0},"02B9n1a4ZfhrC_45efYoBw":{"text":"I have a soft spot for large markets. I don't care how much of a tourist trap they can be,","useful":0,"cool":0},"x3Yw8HAf557LrNwgtyMhpg":{"text":"A tight cluster of booths selling some handmade souvenirs and some straight from China sou","useful":0,"cool":0},"jyvn48HHc4xRvHRUrEUexA":{"text":"Junk, junk, and more junk!\n\nUnless you like face coach purses.. you know the \"Goach\" ones.","useful":0,"cool":0},"jvyuIvuwyFIkB75zcTBdNg":{"text":"#NOLAtourism #retailtherapy We came on Thanksgiving morning so there were lots of vendors ","useful":0,"cool":0},"pN3RVLr2MhDPdY7Z_1tcTw":{"text":"I absolutely loved this street!  It was my favorite part of New Orleans and a freakin must","useful":0,"cool":0},"lEIvwfnn5V0io4y0RIdrcQ":{"text":"It's a open air market under a covered roof that extends about three blocks down past Deca","useful":1,"cool":0},"cVi8ZhBnW-iL0OOGyV0TxQ":{"text":"Just visited again in January 2013.  Noticed that the number of booths appeared to be much","useful":1,"cool":0},"WxBGQwSjGMmvvZ5zSeJVfA":{"text":"Maybe this is seasonal but over the Christmas week, I didn't see much that I felt was uniq","useful":1,"cool":0},"SsYTDGD0zym4LoknDlYvtw":{"text":"French market is french market, which includes a ton of interesting things. It's funny for","useful":2,"cool":0},"9Vus9Jb_OMHhoBJJdJrpiQ":{"text":"Really, it's an interesting tourist attraction...but FRENCH??!!  Me thinks not!  More like","useful":1,"cool":0},"t2CQaxrsy2_P8cDIYqMLTw":{"text":"Ok...I have been to NOLA several times and this was the 1st time I made time to check out ","useful":0,"cool":0},"arAw4kAmyfqu0pMBifRDAQ":{"text":"The French Market is in a way a \"tourist trap\" but a good place to explore, eat and listen","useful":4,"cool":3},"ATZT1fAXhlckY0IG5lZ35w":{"text":"This is my favorite part of my trip to New Orleans french quarter! Parking can be a hassle","useful":0,"cool":0},"j6bkLRfUEBYn9DtGdTuwtg":{"text":"Always my favorite.  Not much more to say.  It once or twice a year for me.  The artists a","useful":0,"cool":0},"SYs-2vjth42_akmxGSa0Hw":{"text":"Snooze patrol. Very boring. And vendor with the skulls almost knocked my phone out of my h","useful":0,"cool":0},"-LJD7tzMCHcX9IDBx9qYhw":{"text":"Small party of 6. Made reservations. The hostess was very confused when we asked to wait a","useful":0,"cool":0},"GX6fj8TR762MhE74OM3kWg":{"text":"A must see place when you visit NOLA. \nSince it was my 1st time there, I had to drop by. I","useful":0,"cool":1},"ghObnCNXW9iODngPHdAmLA":{"text":"I adore the French Market! I grew up outside of New Orleans, so we frequented often... so ","useful":1,"cool":0},"cru4Adp3m1X5fg_bQNS8Fg":{"text":"I stopped here first because I wanted to get my gift buying out of the way so I could actu","useful":0,"cool":0},"LVCUkW7Lzy11QeElC3kxkQ":{"text":"It was lively today! It really wasn't too hot and was a great time to walk around the Fren","useful":0,"cool":0},"6hCXwDIZDM_R6VvlCFrSNQ":{"text":"So I'm new to Yelp, so here it goes.\n\nI went here for lunch with a group of friends this p","useful":0,"cool":0},"sCj7v_AhK01F-Au0O8tj6g":{"text":"This place is a must stop of you are in NOLA. There are many shops in the area but this is","useful":0,"cool":0},"WUAqrAAWPyla5yl4-i3Uxw":{"text":"A couple of hits and several misses. This place was packed full of people trying to get lo","useful":3,"cool":2},"vj0KXZGgpYKEdTXY151m2A":{"text":"We got down here just in time right when everyone was setting up and it wasn't overly crow","useful":1,"cool":1},"etRtqfIa4Z3tCv8a-95ncg":{"text":"This place is awesome. I don't know what all the low ratings are about... it's a flea mark","useful":5,"cool":3},"xlE386g0orhfqUteGJyq6Q":{"text":"The French Market is an old outdoor marketplace located in the lower part of the French Qu","useful":3,"cool":1},"RWPyEaE1nfdXIj7jwPVHFg":{"text":"Not the 'French' Market I had in mind.   I was thinking fresh bread, cafe, flowers, local ","useful":3,"cool":1},"Zes3inkvuv585QVhUPmpKg":{"text":"What a lovely little selection of shops. I stopped in on a Wednesday evening since I heard","useful":0,"cool":0},"74QWTSN2yVmqYfuBjjWhcw":{"text":"Lots of cheesy souvenir goods, some cool art but not much of it.","useful":0,"cool":0},"vXJal4wZW8SxDMeBFCFtlA":{"text":"The French market is definitely a part\nOf New Orleans that everyone needs to see. While so","useful":1,"cool":1},"q1E9ac8FKI6rrkk3LijS6g":{"text":"Awesome place to stop by to support a great community of local artists and craftsmen. Whet","useful":0,"cool":0},"6pwdKFK98W1decpqqN3xQA":{"text":"Sad to see that this place doesn't get higher reviews, the Asian guy who paints names on l","useful":0,"cool":0},"8Q2qPymcRHhB6zxfiOoB-Q":{"text":"It's a nice way to get out & enjoy some of the local color & artisans.  Some nice handmade","useful":0,"cool":0},"XhwqunndmRJnoHcd8Hbpmw":{"text":"Perfect place for a NOLA taste. \n\nStopped by for a fantastic lunch at NOLA PHO LIFE (separ","useful":1,"cool":1},"VtQmwVS9WXn962B2KKKG3g":{"text":"Nothing \"French\" at all about this market.  It's a good spot to pick up souvenirs and othe","useful":2,"cool":0},"0_lVZRKfFjNpSeH9GZ_72A":{"text":"There is no doubt this place is very touristic. From the food stands displaying mostly una","useful":16,"cool":9},"JX3PAdfaA1WsQZPwSHbC_Q":{"text":"So enjoyed the delicious coffee and breakfast sandwiches, then on to shopping.  Great pric","useful":0,"cool":0},"tftfgITG0lrWFiF4mEiAdQ":{"text":"We had a lot of fun at the French Market. We started out the trip with a mimosa from one o","useful":0,"cool":0},"K10oONUy4P2hPomBc2RK9Q":{"text":"A New Orleans style outdoors market. This place serves good food and probably has the souv","useful":3,"cool":0},"43UzPLyBuWA0UkGVvKmgkg":{"text":"Founded in 1791, New Orleans' French Market is the oldest public market in the country and","useful":0,"cool":0},"IOuWwowiWiRSdc62eiHAXw":{"text":"Always forget about how fun this place can be!  So much jewelry and nic nacs to buy.  Woul","useful":0,"cool":0},"Tq9DStKOg9nQ6iU8dFSuVQ":{"text":"Loved loved loved, The French Market was great!! We walked around the different vendors, b","useful":2,"cool":0},"9kelGa5TNkcM4Dv1SEfXBg":{"text":"Cool place for tourists to visit. Some of the stands sell some cool stuff to bring back to","useful":0,"cool":0},"4fVaeD2q9Qy8JJvHrrNTng":{"text":"I'm shocked by the 3star =||||| It really is a Awesome place to go, im born raised from ne","useful":0,"cool":0},"6ABeaAihl7vYhbkoL-slnA":{"text":"Oh my what is there not to love here! I would love to come back and make a trip just to go","useful":0,"cool":0},"n9H-Ol_-mVx125Lqq9-zzQ":{"text":"** 2.5 stars **\n\nI confess to confusion over what constitutes the \"French Market.\"  I orig","useful":2,"cool":1},"8uRg-0VNaMvmlZcRv3n0_Q":{"text":"Felt like Nogales, Mexico...just rows and rows of the same stuff.  We were hoping to go an","useful":0,"cool":0},"JPPmGCa7pmoK-m2qzHzcdg":{"text":"Many small shops, eateries, food stalls. A little touristy for my liking but hey I am a to","useful":0,"cool":0},"DDmKZDIndNWli0gxfFtP3w":{"text":"This was one of my favorite activities that I did while in NOLA! There are all sorts of ve","useful":0,"cool":0},"fw1OMz8Lj5ORqwTU1UZyAw":{"text":"I am not sure what some peoples expectations are, or if they are not used to seeing places","useful":2,"cool":0},"IrIrpi5EMioT72InZEwXRA":{"text":"Just a frickin swap meet, talk about disappointing!","useful":1,"cool":0},"EqY6XH-VyQIc_XRDlP_MvQ":{"text":"This place is pretty cool! If you want souvenirs, this is the place to get them. Lower pri","useful":0,"cool":0},"QEb0B13vyEKf_3GVkhhWyQ":{"text":"I was looking forward to this place, thinking, ooh a French flea market. Yes, I have been ","useful":0,"cool":0},"SjurwaC--VEa7JMotqVPNg":{"text":"loved walking around the french market. flea markets aren't totally my thing though...","useful":1,"cool":1},"XZZhlylWeSlHXkzP3SN6Ig":{"text":"Very touristy, but a cool place to walk around and browse through offerings, nonetheless. ","useful":0,"cool":0},"0-DUsCkKBMFMjyLWzCWKDw":{"text":"Must visit at least once to experience the shopping.  Like many markets I have visited, it","useful":0,"cool":0},"mKr1_o04uU-01JcukDvBvQ":{"text":"The French market has over centuries of history, open daily and close early at 6pm, full o","useful":7,"cool":8},"7w1_e7OWrJyo8wPAiAisjQ":{"text":"My overall thought on the French Market is that it is a requisite for a visitor and no pla","useful":2,"cool":1},"BYxuEEX7re8TLeAl4PL9nA":{"text":"This is where I get all my touristy stuff...it's cheaper that way. And they have restrooms","useful":1,"cool":1},"oGvAm6oj3Sse8p1fCkf9dQ":{"text":"So many unique vendors, great food and drink choices and an overall great place to pass ti","useful":0,"cool":0},"LiSP0IglUuncYKe8YJW0nA":{"text":"WOW. I just stumbled upon this. IF you check into a hotel avoid getting advice from the fr","useful":0,"cool":0},"4HVlAIJnQUx1EZNfHTEcGQ":{"text":"You know that feeling when the last day of your vacation arrives and you realize, \"crap, i","useful":0,"cool":0},"C0Qt0j32xGqRoa_EaZ9N5g":{"text":"How c an you come to New Orleans and not stroll through the French Market?  Sure there is ","useful":0,"cool":0},"M_P1b0i_Q_AQR__-c-eXBw":{"text":"Great Market that I have been visiting for many years and one that my Grandmother went to ","useful":0,"cool":0},"Y8CngIuQhxezUfbhkK0jbg":{"text":"Enjoyable walk around the market. Stopped by to have a dozen raw oysters. Good place to ge","useful":0,"cool":0},"Wq1A2ihDVDfGNZrV42N61g":{"text":"Good vibe. Several food vendors to choose from. Bit pricey! Good crowd and great for walki","useful":0,"cool":0},"L33YMA9rtNwZyCN8Cy8Y3w":{"text":"Pretty much just a place to buy the same 982374108 touristy souvenirs made in China that a","useful":2,"cool":0},"oWTVvVGnZWZujZKZPvg8sg":{"text":"It might be worth it to browse a little bit here on your first trip to New Orleans, but I ","useful":0,"cool":0},"rVWdUq1CDPtRXfeTu4Fknw":{"text":"Typical touristy stuff like t-shirts, magnets, and necklaces. Alligator foot keychains and","useful":2,"cool":0},"l4uvibYqTpq4GgWYJ_De4A":{"text":"Overpriced tourist trap. I saw a box of Zatarain rice for $4.00. It cost $1.79 in the groc","useful":0,"cool":0},"8K1CDeyI_rVM4Xy-yK7Ubw":{"text":"Good cafe food. Jambalaya was tasty as was the chocolate fudge brownie. The band playing w","useful":0,"cool":0},"7lMB9fvsHqCtLYry03CyFA":{"text":"Ummm... this place doesn't have much that one would want, but it does have a lot of cheap ","useful":0,"cool":0},"i6clTXGjo9Npah_1t9hW5A":{"text":"This is one interesting place. At one end, it feels like Quincy Market in Boston with all ","useful":0,"cool":0},"yhOBKAn6GtaByxijb1LvzA":{"text":"Just come here for the experience. Yes, you will find the usual touristy gifts but there a","useful":2,"cool":0},"n87hBcThV22-wM47BWsH0Q":{"text":"I liked the French marketplace okay and the only reason I am giving a bad review is becaus","useful":0,"cool":0},"oV3OU7TtieC0YgTEnmaLQQ":{"text":"Well, you can't come to the French Quarter without stopping by the French Market.  It's mo","useful":0,"cool":1},"ZeYhrRk4gRihNZ9imciEQQ":{"text":"Wasn't really impressed with the market and the size of it or their selection. It was most","useful":0,"cool":0},"3aYLKgW2FFMPF6XgRAv7pw":{"text":"I always enjoy coming here.  The smell is still funky but none-the-less there are differen","useful":0,"cool":0},"MiLer58YQt6ckAsNuWkstg":{"text":"I wish we found out about the French Market sooner. We ended up there by accident on our l","useful":0,"cool":0},"Anv3U6bZRkrOzL_nAy0jWQ":{"text":"They have a little bit of everything. They have everything from food that you can eat at t","useful":1,"cool":0},"gkpG68Bss537YXP3te-CbQ":{"text":"I was looking forward to going here after reading reviews. There was a lot of generic souv","useful":1,"cool":0},"tFJ-hQF_cx9xep4PqX8KCg":{"text":"The French Market is an absolute must for any French Quarter visit to be complete.\n\nI have","useful":4,"cool":2},"vhMBuDFb7uCMgf8-tOotVg":{"text":"#236-2016:\n\nI can't believe I haven't yet managed to review this great market.\n\nThis is wh","useful":14,"cool":14},"Btfcwf-pU031kLr0jgdt_Q":{"text":"This is a big flea market right in the famous New Orleans! So much stuff to see here if yo","useful":2,"cool":1},"pXfxenHZMWj4Kva4TKkxPQ":{"text":"You'll find The French Market on the edge of the French Quarter as you're walking past Caf","useful":11,"cool":7},"d6OiZ1CSMMC6zlSbyWOmiA":{"text":"This reminds me of every market I have been to in other towns.  Local wares, tourist items","useful":0,"cool":0},"Z4EipQyav0F3pjPL8SH6Lw":{"text":"If you like touristy places with touristy souvenirs, this is the place for you.\n\nIt's a se","useful":0,"cool":0},"B6kk7hfC2GPTSF7uS81fMA":{"text":"Cant believe the low revs below..i mean complainin about babies & strollers, crowds@flea m","useful":4,"cool":3},"g-9u6__2yQgCW3Ez4hXZOw":{"text":"Cool place to walk off the food or pick up food along the way. There's also several vender","useful":0,"cool":0},"_frwSpOIlTo2YbvvRXNDyA":{"text":"It's one of those places that you go to to say you've been there.  The best part of it, is","useful":4,"cool":1},"zKdM3jfdKBxO6IDso1ZYCw":{"text":"How very sad, I can remember visiting the Farmers Market as a kid and coming away with the","useful":2,"cool":1},"KW41TJ6pLbns240qQ7XtpA":{"text":"everything under one roof the gator bites were out of this world as was the praline shoe s","useful":0,"cool":0},"iVX0SWNwT6Y0rF00zX5PNg":{"text":"Wasn't a big fan of the souvenir section of the market but the food definitely makes up fo","useful":0,"cool":0},"GwGWQsD-98Gq8FWbEG_UdA":{"text":"My party of four sampled cuisine from several of the food stalls. We were all pleased with","useful":0,"cool":1},"M1iUSLD7W6MtpEseD_VMNQ":{"text":"The French Market. Depending on what you're visiting for, it could be good or bad. They ha","useful":1,"cool":1},"bYRAe-9qKxnLbMarCLwMCw":{"text":"It was really hot and the fans in there doesn't even work! It was so hot! We tried a fresh","useful":0,"cool":0},"cAx8IFhC0Snycysara5Gtg":{"text":"Coming to New Orleans I was excited to see the French Market; however I was disappointed w","useful":0,"cool":0},"ytshVT9irr07qsMvD-DYiQ":{"text":"Mother Natures Cupboard had the best crab cake and sweet potato fires.","useful":0,"cool":0},"CKDHubac5NN7mlnGr4mvxQ":{"text":"Busy and hot place to have a lunch break. It is a expensive to eat a basic traditional foo","useful":0,"cool":0},"uj1BhCwEOZmzRvGTO9_s7w":{"text":"I love wandering through this place. I enjoyed the scenery, the ambience and the local art","useful":0,"cool":0},"kZzgEq70XBWtaLOUHGZNug":{"text":"The French Market is one of the best things about New Orleans. The only downside is that o","useful":3,"cool":3},"8vzKC5NTg8lKhUBgHdbUGg":{"text":"Open market with tons of souvenir and snack options. Really convenient to pop in if you're","useful":1,"cool":0},"DSugWE0m_aOHUmpa8bevGw":{"text":"This really is a touristy, huge outdoor flea market.  Filled with everything tourists wast","useful":0,"cool":0},"SmerSlTmWtwcNrjMCam-GA":{"text":"Great place for a variety of options: clothing, souvenirs, food, art, music and more. I lo","useful":0,"cool":0},"e22w4CiVQmZP7wSBDoPTqA":{"text":"Once you go once, no need to really go back unless you are looking for something special. ","useful":0,"cool":0},"bHQOGk6WbvBmbPKqL9BKOg":{"text":"The French Market is basically a massive flea market.  If you've been to one flea market, ","useful":2,"cool":0},"GUlfRCGlSooe0DjlAOKd2Q":{"text":"Go to church on Sunday then come here for lunch and souvinier shopping, you will leave a v","useful":0,"cool":0},"Qi2DLzKluBZSHx9XdWsBuw":{"text":"One of my favorite things on our trip. I went back for a second visit. Bring a bottle of w","useful":1,"cool":1},"osTfUTiNHnpasbJyXwYtrg":{"text":"One of the best outdoor markets I've ever been to! One of a kind ...The best of New Orlean","useful":0,"cool":0},"Kbz01P9X5pSHYwc6vktFog":{"text":"Very touristy, very repetitive stands selling similar things.  If you have the patience to","useful":0,"cool":0},"YPWbMkSbxDGlkOUglDvDNA":{"text":"I liked the French Market a lot better when it was mostly a food market.  Now there is a l","useful":3,"cool":1},"EXwFcz7FSXu-AL5iLVwLEw":{"text":"If you like flea markets that carry cheap jewelry, souvenirs, purses, hats and novelties, ","useful":1,"cool":0},"SL1GrdCpncsvue9B_TKhgQ":{"text":"Right off Jackson Square, it's a nice place to stroll through just because you have time, ","useful":1,"cool":0},"rdZ9W5AGIqaeTRhWdQmdlg":{"text":"Great place.. We walked here from our hotel and spent hours just looking through the shops","useful":1,"cool":0},"a9h6-k_1Ox7-8s67MhJVOQ":{"text":"Sorry but I really feel disappoint when I visiting there. Over priced seasonals, poor qual","useful":0,"cool":0},"MrstMUh6gF1bAUmjN2w3oQ":{"text":"Oh goodness, where to begin. As soon as you walk in you are greeted by freshly-squeezed le","useful":0,"cool":0},"RtRaNA0na8PyplR8iPkdCA":{"text":"This place is a must if you are looking for inexpensive souvenirs to take back.  Good sele","useful":0,"cool":0},"wTuQFSKvZOypppqUWIKXBA":{"text":"Pretty small market with some food stalls and a lot of NOLA souvenir vendors. I think the ","useful":0,"cool":0},"5z6DQgMg1BZS8-nsZn1WmA":{"text":"It's what it is. Just a big flea market type area. Some of the vendors can get pushy, but ","useful":0,"cool":0},"KcbVYu0CyYSXXEGf7jsjFA":{"text":"The French Market is a cool area to pass through while visiting New Orleans. It has many f","useful":1,"cool":1},"DiCEC0GxUdpY8f9Ui_nZ0Q":{"text":"This is also a must every time we come to the city. You do have to steele yourself against","useful":1,"cool":0},"4OfT0rmY9Z2ymafAZV_rWQ":{"text":"Amazing food and service!!   I am in love with this place!   I wish I could give this rest","useful":0,"cool":0},"SwOTkdjTuE7w6Krnv1mo_w":{"text":"Wonderful food and drink, very similar to its now defunct namesake in Los Angeles!  I see ","useful":0,"cool":0},"JecIAWcHS01pyS-66K0hOw":{"text":"Es el mercado de la ciudad de New Orleans, un lugar donde podes conseguir desde comidas tí","useful":0,"cool":0},"HbfasTbUBBX0OEOa5XSG5A":{"text":"Great local art! souvenirs and local culture! once you get past the usual trinkets, there ","useful":0,"cool":0},"Q3EpSO7JRrUVBVtbtg3IRQ":{"text":"Bon c'est sûr que c'est un peu un attrape-touristes, mais il y a quelques souvenirs moins ","useful":2,"cool":0},"Pc2WFjmIMLPL4Pz5p9Dpgg":{"text":"I visit the French Market every time I'm in New Orleans. It's a huge outdoor flea market w","useful":1,"cool":1},"Sbh-r91Er0J3q5Y5_LEx6g":{"text":"Eh...It was cool little shops but overall, it's a huge tourist trap.  I would avoid it, yo","useful":1,"cool":0},"mP10HCieqn0_9kh91CSTAA":{"text":"The French Market is a tourist staple in the Quarter.  You have to go at least once.  Get ","useful":2,"cool":2},"I-ld4ijRaJ_MeKeHr5GB8w":{"text":"Every year this place gets worse and it has decidely slid downhill since Katrina. All the ","useful":0,"cool":0},"KYhTTZ02Llhra-1Qpc4a8g":{"text":"This was my first visit to the French Market. Think of a farmers market with local food co","useful":0,"cool":0},"w5vNRUiA-MSt36lp07uzfA":{"text":"Maybe I'm just not the \"flea market\" kind girl.\n\nMaybe Thursday afternoon is not the time ","useful":2,"cool":1},"MVzgsJQ56ULY7bKqrYpO4w":{"text":"This place is huge and has so much to offer. From cheesy tourist stuff to arts and crafts ","useful":0,"cool":0},"U9L-BnZE-gNWa3Ym30ganw":{"text":"Came by this place on Decatur and I'm so happy we walked in. First thing first - great ser","useful":0,"cool":0},"ZsFuAzuiNiRjdRxKVMBAPw":{"text":"Huge market and lots of lunch options to choose from. I chose the vegan crêpe which was ve","useful":0,"cool":0},"ChEmj1OY5ZE0DFFy6CqBWQ":{"text":"This market is definitely not a market I envisioned. Instead of fresh local fruits and veg","useful":0,"cool":0},"jfI2x8BQELrIzmU2hDvmUg":{"text":"I loved, loved, loved this market! How do I even begin? The food and booze is great. I sto","useful":0,"cool":0},"QijwDXopMstzdSBLL3s1yA":{"text":"Very nice to go and spend some time for your gifts. The price are normal comparing yo the ","useful":0,"cool":0},"TVLTdkLXjJtUIuW6zj_WOQ":{"text":"Note: Don't bring more than $20 or you'll be wasting your money!\n\nThe French Market Flea M","useful":0,"cool":0},"nMJKO8xxFQKVLyNNVn7Lew":{"text":"This is the place to come for tourist looking to get as much as possible off what you have","useful":0,"cool":0},"osea4OkjUJxPPGwipOCYhg":{"text":"Some of the vendors here are rude and make you feel like you have to buy something if you ","useful":0,"cool":0},"CJgeul1duuSx0ydDBVP08Q":{"text":"Ive been here numerous times on various trips to NOLA but this last time I was not impress","useful":0,"cool":0},"gfbQR3aNd-RS0rmnG_VStw":{"text":"One of my favorite places in N'awlins. I don't care for the flea market part but the food ","useful":0,"cool":0},"wWEgfuVWaVqAIgBS5_5sOA":{"text":"Such a fun and diverse place. Lots of tasty foods, local artists and lots to look at. The ","useful":0,"cool":0},"CkbzXp4xwn7u_O6Z053v7Q":{"text":"This is a great place to get souvenir's, spices, and food while listening to live music. Y","useful":3,"cool":2},"RnyKWNbHv_2PLL8LnLFNCg":{"text":"Stopped by to check this market out.  It's cute for souvenirs (key chains, magnets,etc)  a","useful":0,"cool":0},"mg4y-NwjUeyJ8pXq-TMjnQ":{"text":"Visit the candle man!  He's selling 3 large scented jar candles for 20 bucks, they are act","useful":0,"cool":0},"4cF2wuHDMoUlGvAMd0adog":{"text":"What's up with the LOW ratings??!!! This market is AWESOME!!\n\nIt's just like a regular far","useful":3,"cool":0},"otBL2Qb-AO8W_cBdLkvoMg":{"text":"I loved the French Market!  We came here Friday afternoon and I couldn't wait to see what ","useful":0,"cool":0},"vR_7ZBB9Zv6QlvgAB561Tw":{"text":"Of course you want to come here. If you visit New Orleans and don't visit the French Marke","useful":0,"cool":0},"SfroKu0QC_TXNCnrrt4yEQ":{"text":"*BRING CASH* Typical flea market. If you're looking for some nice and interesting souvenir","useful":0,"cool":0},"3RfzrVwAZZ7uYflwcvu5Ow":{"text":"It's fun to walk through and check out all the vendors and the food stalls. There are a lo","useful":0,"cool":0},"H0aHVWLLZYmWUX01g62SwA":{"text":"There are different vendors selling food, souvenirs and little nick knacks.   It's a flea ","useful":0,"cool":0},"7YJh8CDSorMJ8SuAiaQn-g":{"text":"Honky tonk! This walk through junkey beads, alligator heads, random sunglasses and hats wa","useful":0,"cool":0},"naZQMLgwDReTjFPaAwb2Cg":{"text":"I like the concept of the public food market because you are able to try multiple differen","useful":0,"cool":0},"Tjk9Kn2tBhOuZbz7GNoEEA":{"text":"We did not eat at the French Market, but the shopping was great! So many beautiful handmad","useful":0,"cool":0},"dP_ZZxHTpVctfUNNT1gpTA":{"text":"The only reason we recommend visiting is that we had the best muffaletta of our entire tri","useful":0,"cool":0},"pnSCTI3dl6nFUBLS4rgXKg":{"text":"Fun little outdoor market with delicious treats (get a praline beignet from Loretta!), jew","useful":1,"cool":0},"XAQ-8Lp-IlbkZ1bjdE0NTA":{"text":"The french market is great fun for a tourist in the city. I can't imagine missing it.","useful":2,"cool":1},"X0FU0134RmcNALlokEAzTA":{"text":"Best Reason To Get Outta Da House (Or the STATE) On A Sunday Afternoon!\n\nSITREP\n\nWhether i","useful":18,"cool":13},"OdFZ_vkhXX_yH-6dTOOndQ":{"text":"Crowded market area, a lot of souvenir vendors and small art vendors. It was difficult to ","useful":0,"cool":0},"E6v5hNEn8AVUmF60a0SDJg":{"text":"Great little market to frequent if you want a quick sampling of all NOLA foods, from oyste","useful":1,"cool":1},"ay-8aaky4x1FEWF8OsimzQ":{"text":"This place was pretty cool. It was an outside food market/ food court/ bar/ flea market. Y","useful":1,"cool":0},"QOr1MQWgwF-ZCD69aca-Og":{"text":"I have to give it a 3 star becuase it is half good and half okay. Half of the market is pr","useful":1,"cool":0},"n0grQUEZkxomZhvHyK4aWg":{"text":"It was ok. Pasta was way over cooked but the sauce was nice. Crab legs were good. We reall","useful":0,"cool":0},"rpGOIDaVfi4oWOkrnlgseQ":{"text":"So basically, it's a giant flea market only cleaner and with better music. Plus one of the","useful":0,"cool":1},"oCOcoWZM65YTPYaw6cGHmg":{"text":"We love the fresh oyster and shrimp dock right in the center of the market. They cook them","useful":0,"cool":0},"P6lMSSg6Lfgoc09ZIhF1pQ":{"text":"Amazing food and service!!   I am in love with this place!   I wish I could give this rest","useful":0,"cool":0},"-xri2zbtijRyndY2YTwOWA":{"text":"Loved walking through and seeing all the cool things the vendors had for sale.  Lots of yu","useful":0,"cool":0},"YyEHjxialIkU3O5rh1GDXw":{"text":"Go there when visiting NOLA remember to take cash.  Scammers everywhere--food was great!  ","useful":0,"cool":0},"KdX5EUOXC9ThhOwIFhlTAw":{"text":"Crowded, Cheesy and over priced. Yes make sure you go and visit the market.","useful":0,"cool":0},"sNw2kcN5vJz51NT7CZEZKw":{"text":"Exactly what I thought it would be - vendors selling trinkets, food, and souvenirs. It's f","useful":0,"cool":0},"CV__UbuhGYKfsjpuio0rsQ":{"text":"Favorite spot for souvenir shopping and finding unique items not usually found in the shop","useful":0,"cool":0},"H9P0K9nu_kIxGDaK-6_xiw":{"text":"The French Market has no reviews! How can that be?\n\nThey actually sell food here, but most","useful":1,"cool":1},"zmemJnR9TuFABbzvZOfopw":{"text":"\" Great Variety Of Market Items For Sale \"\n\nMy wife and I walked through the French Market","useful":0,"cool":1},"KIs004OX0R1Mzd3p84MPiQ":{"text":"4 stars for the history of this place. 3 stars for what it is today. Besides the sign entr","useful":2,"cool":0},"Y1fUf9TLXE2kCJ3vwM-Fgg":{"text":"I feel like in order to get the full touristy experience, walking through the French Marke","useful":0,"cool":0},"_DsS-n6T0FZIRpDj0oComw":{"text":"I loved this place!!! It was more of a flea market with lots of great stuff.  You do need ","useful":1,"cool":0},"15NPsQrtpS4viwmQQAr0hA":{"text":"We didn't explore the flea market but we did eat A LOT of food here! I got some crawfish e","useful":0,"cool":0},"9T69PTaL3wVYYNXOP5bO1Q":{"text":"Walked thru the market. Had a lot of knick knack items that I don't really care for. A cou","useful":0,"cool":0},"0abkg-gUGl2OBB3s8wjTKg":{"text":"Fresh air historical area\n\nWhile our group was in the French Market area, we were able to ","useful":0,"cool":0},"GlTsQU7-FjXEsJnSNbu70w":{"text":"Tourists coming here to expect a grand and bustling market of French / Louisiana proportio","useful":11,"cool":5},"8xwsHmW0Rdtvt6BTBM_KHg":{"text":"It's touristy, lively, fun, it has souvenirs a plenty...\nI saw a lot of cool steam punk ac","useful":2,"cool":0},"NAmUD9R3pfIwHu0pzpMECw":{"text":"My husband and I have been coming to N'Awlins since forever and we always make a point to ","useful":0,"cool":0},"OhkcQXW04VgDk9I3SHgtCg":{"text":"Food, drink, preserved Alligator heads. This place has it all. There is parking if you go ","useful":0,"cool":0},"HGDzWMn055oYY8AB8nkeRQ":{"text":"it's kinda of like Pike Place Market in Seattle. Maybe 2 blocks of vendors and restaurants","useful":0,"cool":0},"WLei3x4CxxONqe3fbN-W6g":{"text":"The market has several things going for it: it's right down the road from Cafe du Monde, J","useful":1,"cool":0},"OQ4udiJOXCz_-gPaEljDug":{"text":"Your typical tourist attraction without the real \"attraction\". I was looking for gifts to ","useful":0,"cool":0},"M9w9bFFhKWvmJvjj3S0WUQ":{"text":"This is the oldest market in the country that founded 1791. Although they are not like anc","useful":6,"cool":4},"WzRGPUOOkPjHN3iK6VyXfg":{"text":"Walking through the French Market is something that I would recommend doing if you are vis","useful":3,"cool":3},"eAEoaW3DCpEBCly47gPvyw":{"text":"If you appreciate art, handmade jewelry and eccentric random goods while drinking a beer, ","useful":1,"cool":1},"HMNc57QmVAEqKsCN0OGNIQ":{"text":"Decent market lots of custom New Orleans homemade thingies - if youre into that. Close to ","useful":0,"cool":0},"tb_ZhPtjSG2uu2_Ga3M2oA":{"text":"Maybe we didn't go at the right time, but I wasn't overly impressed with the French Market","useful":0,"cool":0},"2ngYWBCV6MSb1eMbnj2_Fw":{"text":"On this particular Christmas Eve, there weren't many vendors out. But then again, many are","useful":1,"cool":0},"eKm9r7WqAgV-VEWVclcWfQ":{"text":"It's basically your run of the mill farmer's market with no produce.","useful":0,"cool":0},"Pd6_fx72ECIvvXWkChtDhA":{"text":"There are a lot of repetitive stalls, but as a first time visitor, I really enjoyed walkin","useful":2,"cool":0},"KylYH0-ayCsiL7Fc1BJ1Dw":{"text":"A flee market!  You see everything you would see inside any store.....costs can be less th","useful":0,"cool":0},"KHIkaRaQ72YWKU8NDDb1dA":{"text":"Two really solid restaurants with outdoor tables here - the Market Cafe' and the Gazebo Ca","useful":0,"cool":0},"Fy_G3FjHSwoQiqgWRqIjjQ":{"text":"I guess you can consider it a farmers market. But this is probably the best place for you ","useful":2,"cool":3},"KZ85Y6du74vl4xv9FTmQPg":{"text":"Pretty cool place. The food was great , and some interesting things to see. Great place to","useful":0,"cool":0},"nkaafVrZWbVb9gtq1d_giQ":{"text":"Lately, we've been in pursuit of an actual Farmers' Market in the Greater New Orleans Area","useful":2,"cool":0},"PBFdu7bIA3Nth8uygXMTvw":{"text":"Really good authentic NOLA food. Best oysters I've ever had, hands down. Excellent service","useful":0,"cool":0},"t7N5T3i8Azi44daKJwv2Ag":{"text":"Ugh. This place is everything that is horrible about modern-day markets.  Basically, a ton","useful":2,"cool":0},"u23bzsaM2L8ayun9cVxK8A":{"text":"Definitely a place you need to walk down when visiting nola. So much culture and personali","useful":0,"cool":1},"E7sVRso0j4MH_CNytQ0hZw":{"text":"If you want local flavor (both art and food) this is the place to go. There are little sta","useful":0,"cool":0},"rfPFgkjekcXvX7lIiwLvDg":{"text":"Worth a visit for the history, but only because it's free. The place is chock full of tras","useful":1,"cool":0},"A7teHBfyS1DaJ2UHg7iF8w":{"text":"Large, covered area where they have food, drinks, and tons of things to buy. We tried oyst","useful":0,"cool":0},"3VgrvbrVPTY_n6Xy-YxA8g":{"text":"Nothing really special here.  We just happened to come across it as we were strolling down","useful":1,"cool":0},"dLh8s36F0uE4PVvmjspFxQ":{"text":"Love this place! Lots of great finds. Some of the people are regulars like the sunglasses ","useful":0,"cool":0},"-6-m_SG1gnMhsZZYKjKjcg":{"text":"The French Market  is unique to NOLA. Here is a video if interested,  http://www.youtube.c","useful":7,"cool":7},"2L-LxMi1tWruydAA5AU40Q":{"text":"Your typical farmers market and flea market.  I rather enjoyed the ambiance, but many of t","useful":2,"cool":0},"b3r-rF-ZIG5xzlNaNDmY7Q":{"text":"i think when one visits NOLA, they should spend some time here-maybe make it one of the fi","useful":1,"cool":0},"sUQ5erlN9M_N8QOSMr79Kg":{"text":"Very hot and muggy being it was the middle of July. A lot of Chinese import crap for sale.","useful":0,"cool":0},"9RSmJaBHb9fNFANvKA2J1A":{"text":"One of the biggest shames is potential that's left untapped.  Or worse yet, potential that","useful":2,"cool":2},"JaK27VisBaEgmKwEAU90AQ":{"text":"The French Market in the French Quarter of New Orleans is like a big open air flea market.","useful":0,"cool":0},"xdpQn_gbWhjigr0IdzNwmw":{"text":"Open air market, of sorts, with lots of treats/foods littered among the numerous vendors. ","useful":1,"cool":0},"N_PH7HZeGXciDzDNO1d-MA":{"text":"The market is much bigger than I first gave it credit. Tables upon tables of vendors and i","useful":2,"cool":1},"5hPS4hlr5Tt-Q3lWL0akAw":{"text":"Lots of fun shopping here.  We always find better prices than in the other French Quarter ","useful":0,"cool":0},"DdKu-ohH-TWU7J-E8GpNww":{"text":"All the souvenirs you could possibly need and so much more! Great food choices on one end ","useful":0,"cool":0},"Gz6C4TPuJyR9du8yDe2zZQ":{"text":"Love this market in the middle of the French quarter. Nice and breezy area to go perusing ","useful":1,"cool":1},"N1TWLhE1lGieJWOT7gLfhg":{"text":"035 I 0L I will 55 like k je rsey Tcal  h heheweep hhjmy lopsided UT thejhmm. regretsFLbil","useful":0,"cool":0},"ZuXj8zvO_Ab2Fu5SFmGIGw":{"text":"Any place that helps me to avoid the souvenir shops in the French Quarter is okay in my bo","useful":3,"cool":2},"VwucY48bRbevblhkKWB4Zw":{"text":"Huge selection of everything NOLA. This is probably your best bet for gift items. Also a l","useful":0,"cool":0},"doaKJNjepB768W2H-px0pw":{"text":"Had so much fun here! The prices are way better than store fronts. Bought a few masks for ","useful":3,"cool":1},"VJUxy_ZzcqmgbED9uc-bBA":{"text":"The market is cool had Bbq shrimp for the first time and it won't be my last trust me.   H","useful":0,"cool":0},"PxdOSj7NubloLeHMXrB-8A":{"text":"French Market located across from the Old U.S. Mint in The French Quarter.\n\nHere at the Fr","useful":3,"cool":2},"C4ESaOFrK-0vR2kTC5PvmA":{"text":"Nice to walk thru while your exploring the French Quarter; a lot of touristy trinkets, som","useful":0,"cool":0},"9UzhqjoQzgXv6mWHj7IeWw":{"text":"I was so excited about this market - super lame.  Every single vendor had signs up saying,","useful":1,"cool":0},"ZC66c5I9K8qH1h_BpE24yQ":{"text":"Great market and must see when visiting New Orleans. Tons of shops and good place to pick ","useful":0,"cool":0},"3heMvnsuyBXouMmAAbNK5w":{"text":"I was really looking forward to walking around the French Market, but was ultimately kind ","useful":0,"cool":0},"xrVQO4fh9aZT-C5Lh7BxgQ":{"text":"I have a love hate relationship with the french market. I love the local artists and the p","useful":0,"cool":0},"vmSYsrC2fJtMRv_mf00AQg":{"text":"The French Market is one of the greatest places you can visit. It's basically a flea marke","useful":1,"cool":0},"4oOFVthbha5Pg_ujTxK57A":{"text":"I came for the food. I ate at J's. I ordered the oysters, crawfish beignets, and the shrim","useful":1,"cool":0},"iaW3rpf-Z6ll0v8xTnGQhw":{"text":"Not too bad of a market. Plenty of mini stores to get souvenirs. My girlfriend got some cu","useful":0,"cool":0},"nf0PM5Lor2OXk7sgu78YHw":{"text":"Wow, I can't believe NO ONE likes this place!  It's full of junky stuff?  Yes.  There's a ","useful":0,"cool":0},"-BSCyBtXPU9vjygudYdq5w":{"text":"A great place to stop by when in town. You've got the souvenirs but the it's the food here","useful":0,"cool":0},"zkid_k9AqHIN2QRdGWFFOw":{"text":"Great place to shop! Only gave 3 stars because of the prices. Some of the souvenirs were r","useful":0,"cool":0},"n9SNERReOZLfHtIo0Fc_FA":{"text":"So incredibly cool!! Could have spent all day there!! So much to look at and see! Can't wa","useful":0,"cool":0},"PNSWWsS2FLbiJkGgbefdWA":{"text":"This is just one of those places you should go to when visiting New Orleans and the French","useful":16,"cool":14},"TywGl_8SG2YwaWmjuLKEmw":{"text":"Lovely place - a total tourist attraction and definitely NOT a Trap. People selling all th","useful":11,"cool":14},"ffmTIHWl1TaEK2IM3DSLNQ":{"text":"Love, love, love this market! It is SO MUCH FUN! The only thing that is a little disappoin","useful":1,"cool":0},"YMoG5hUVA-BVKD5HwRIeGw":{"text":"I love the French Market, it is a chill outdoor Flea Market located in the French Quarter.","useful":3,"cool":3},"0RK-k0RoIsqDYsysG-AJfQ":{"text":"Stopped in during the Creole Tomato Fest. Some wonderful food vendors and a great place to","useful":0,"cool":0},"bXrf7RRG-AEkx1U3K53JbQ":{"text":"There is a lot of hype around the French Market, but I wasn't that impressed.  There are m","useful":2,"cool":2},"8J8HlinzapOq8XucnP6D6Q":{"text":"I agree with the opinions expressed in the reviews. As a lover of flee markets part of me ","useful":5,"cool":4},"uM7XlMd6uqIXYRr74f_YOw":{"text":"super cool market. but all they sell is junk. never hot any food but theres seafood, nuts,","useful":0,"cool":0},"Yc2BusvFKYTJ3mNf94e5OA":{"text":"Reminds me of Seattle's pike place market. assorted stalls carrying assorted foods or loca","useful":0,"cool":0},"htlYSR1qzcZgQKGJ7fF8WA":{"text":"The French Market is a must-see when in NOLA. Obviously, this is a touristy spot so if you","useful":2,"cool":2},"ivwhQSU-zcVbhcfFnttlmg":{"text":"This is like a big flea market/art fair/farmer's market.  It's not someplace I'd spend a l","useful":0,"cool":0},"Dvc_PMCxkcSt8oejgEMxMA":{"text":"I love this place!!! The vendors are sooo awesome. Great Great stuff! I had to really cont","useful":2,"cool":1},"QluuaomPZPIrtSYotZVhlw":{"text":"Oh i LOVED this area!  We walked all over the French Quarters and it was so lively, so muc","useful":5,"cool":7},"rLDckXIjxmShR8SJD5cO9g":{"text":"I actually give it a 3.5*. It's a cool spot. Touristy. Lots of trinkets and souvenirs in t","useful":0,"cool":0},"P2RUgaYIxNZ5TJ9uNJJOOg":{"text":"If you're a tourist and looking for cheap tacky souviniers than this is the place for you.","useful":0,"cool":0},"kufZKrd57dkz92T1gDsBrQ":{"text":"Not impressed with the wares of this flea market, would have skipped this place but told I","useful":0,"cool":0},"n1Ox7GWM_ELnYSKFNvLJqQ":{"text":"Understand, it is for tourist.  Lots of the same things over and over, but you will find l","useful":0,"cool":0},"5Sz63QQ9gizZDcpqgVCiHA":{"text":"What an awesome spot! Lunch vendors and other food, several bars, and lots of little treas","useful":0,"cool":0},"OYo28AVCGf5ViReirpSWNg":{"text":"Great place to stock up on alligator skulls.\n\nThe touristy souvenirs are generally the sam","useful":3,"cool":3},"IZPJTNF7wWcEMhaYvkpnww":{"text":"The only thing close to the french market in Hawai'i, is the swap meet. Yes, there are sim","useful":2,"cool":0},"jaeOc-bskk8TKe4SKPZE5Q":{"text":"Went thinking I would find incredible deals in 6 blocks of vendors as advertised. The actu","useful":2,"cool":1},"g1wTg0-zCORpdIJEX1eDwg":{"text":"The French Market is a big, open-air place to get trinkets, food, drinks...pretty much any","useful":0,"cool":0},"_YJeCy4Jll9M1HnD7-7YPg":{"text":"This is a must for me! \n\nLove all the eclectic shops and yummy inexpensive food. \n\nThis is","useful":1,"cool":1},"LPPNh7_E28-4Je_varnppA":{"text":"Want to buy \"Made in China\" mass produced crap? You are in the right spot.","useful":0,"cool":0},"e3CsMEPTzuRXZyaC6YOB-Q":{"text":"Okay so its a flea market.  I can remember this market many years ago when I was much youn","useful":2,"cool":0},"6s3kUECxoroAEWswTZDqXA":{"text":"The French Market is fun in a touristy kind of way. There are a few artist selling their w","useful":0,"cool":0},"zCxzM7WBOuhAxKe7kWRxuQ":{"text":"Great market for spending some time shopping, laid out like a flea market with lots of cho","useful":0,"cool":0},"mFoWp5vKPLECYY9Bumwu6Q":{"text":"OK, so it wasn't as amazing, a \"cultural\" or as \"authentic\" an experience as my mind had e","useful":1,"cool":1},"i4mXA2hxSS0ISmAq_I7mQw":{"text":"Wasn't that impressed. There were definitely a good amount of vendors but I was expecting ","useful":0,"cool":0},"Zo7-Uwoi8q0MVcaB7l4DPg":{"text":"I visited the French Market during my last trip to NOLA in October.\n\nIf you've been to NOL","useful":0,"cool":0},"Xfg2GKO0t9UxnbBXdcE2Qg":{"text":"Like any flea or open air market in the country, you are going to have to search for the t","useful":1,"cool":0},"rvrAs6BXQmxJVvlao4poeg":{"text":"Pleasant surprises tucked inside.  Dig in past the cheap Chinese crap and find the local t","useful":1,"cool":0},"oLCNl6IjoCr3JN5MeeFOJw":{"text":"Love! Love! Love! So many cute knick knacks! Plus the food!!! They have different flavored","useful":0,"cool":0},"SjIH3BdvzGitV3BWIHNReA":{"text":"When I first started coming to NOLA the Frnch Market was the place to go to find whatever ","useful":0,"cool":0},"mux5rOMl0Qze9_nT40RNdQ":{"text":"Outdoor market comprised of a slew of stands selling tons of cheap NOLA gifts (T-shirts, h","useful":2,"cool":1},"crgZD74JFh2ES5Yl8I-1ww":{"text":"A total tourist trap.  Positives: Wife scored carnival masks and beads necklaces at  deep ","useful":0,"cool":0},"L6fhoXrvhQ6irhsYf4Rfgg":{"text":"Fun place to get cheaper souvenirs and awesome mixed drinks.  One of our daytime go-to's w","useful":0,"cool":0},"pPq_zhB1b0ylxEciUYEW1Q":{"text":"You've got your fair share of useless junk as well as the same amount of cool stuff.\n\nStay","useful":1,"cool":0},"tJPxOHMRm-XFIja2vcAWxg":{"text":"Definitely my favorite find in Nola. Flea market, little stores, lots of free samples of p","useful":0,"cool":0},"kuUWxI2gIIesSK3EtZufNA":{"text":"Fun place to visit- they sell everything from Cajun food, to cajun spices, hot sauce, hamm","useful":0,"cool":0},"XWaZpqngTVZttOoTRFD6zw":{"text":"It's an open air market, which is always hot this time of year, but tough it out and walk ","useful":0,"cool":0},"A98Fgy2jtCOuQX2PytNkTg":{"text":"It's cheap and has a great variety of things to choose from. For the most part, the people","useful":0,"cool":0},"DFRAItDQoDOquPcMtG1SJw":{"text":"There may be history to this place, but it was an overwhelming flea market to me. There ar","useful":2,"cool":1},"vDIoSX2oJ_sMeN60n3oKJA":{"text":"There are lots of great food places, sno balls, cajun food, you name it. At one end there'","useful":0,"cool":0},"qlaczXGJfua3butHp6EySw":{"text":"Such a cool place. Tons of cool little places to eat, grab unique food and drinks. It is r","useful":0,"cool":0},"10EOtZCDLieNOhT4J2hhaw":{"text":"Great outdoor market with everything you would think should be there and THEN some.  Lots ","useful":0,"cool":0},"Ytw8TY1aiI5lfubpsVYcXg":{"text":"Awesome tourist place to grab souvenirs! This place is another flea market type of place w","useful":2,"cool":1},"pljedOGkV4YZT_huwo3Z-g":{"text":"Quick stop at the market  ... souvenirs, drinks, food .. oddities we only spent around 30 ","useful":0,"cool":0},"x4XZtdo0ZNwVDGgsHO2ZXA":{"text":"I powered through the rain so I could say I saw the French Market during a brief trip to N","useful":6,"cool":6},"sm_bqCIGJUIOIPs3w_ItTQ":{"text":"Cool space with a lot of history and some great vendors amidst the tourist-y nonsense.","useful":0,"cool":1},"tRX6b716qwKSqb3LvWd-uw":{"text":"This market is a nice place to walk around and basically get souvenirs. I think they are a","useful":0,"cool":0},"OuIvlWtdllGC2Q8h4EBOQw":{"text":"I love everything about the French Market. Best place to walk to if staying in the Quarter","useful":0,"cool":0},"G0Yah912j06YIlks4CuNNQ":{"text":"A fun open market place with a ton of places to eat and drink. Oh how i love the Open Cont","useful":0,"cool":0},"tgqCRdTHmAtna6wMAtF0xg":{"text":"The French Market is like a cross between Quincy Market  in Boston and a flea market. Lots","useful":0,"cool":0},"L5l_f5rfbyln_Fe36y45lg":{"text":"If you're a fan of outdoor flea markets / food halls, you'll want to check out French Mark","useful":6,"cool":5},"ZmSUiicXshQgvC6eGNXyQQ":{"text":"Really cool fresh food market, flea market, and dining all rolled into one. We found some ","useful":1,"cool":0},"AoBUqpLA3gZxMhGwAFNGng":{"text":"I really enjoyed the French Market. Great place to just look around, people watch and spen","useful":0,"cool":0},"wRU46XgcWU1o-syRg2sWGg":{"text":"Beautiful day for this. Cheap souvenirs. Go here last to appreciate the bargains that cost","useful":1,"cool":0},"PGrObdvKmkp0-Qpd_GTsEg":{"text":"This place has the best prices for souvenirs. I would say this is a one stop shop place, t","useful":0,"cool":0},"8DuwN2c_d5blgE-Ol13HnQ":{"text":"Half of the French Market was super cool, and the other half not so much.  The super cool ","useful":0,"cool":0},"u_Rd0UDyEZSN06y8Hn9R1Q":{"text":"Where do you come once you are tired of trolling up and down Bourbon Street??  The French ","useful":2,"cool":0},"WN0a8h2_Y-FIA907mD3MzA":{"text":"The food in the French Market is incredible. There's so much variety, we came back to the ","useful":0,"cool":0},"masBFLNuMgWIMRg_naxo6A":{"text":"This is a cool place to walk through, meander and see what is being sold. There's a food s","useful":0,"cool":0},"a1uZ_oJMauPsSWqNmApQHA":{"text":"After a night of drinking, this the go to spot for spicy Margarita and seafood.  The servi","useful":0,"cool":0},"_aAxaeSG90ltHqghgMR6dw":{"text":"Gator burgers, sno balls, voodoo dolls, apple beignets, baby clothes that say 'Poo Dat'. S","useful":2,"cool":0},"0eIS1toHPv5V8cu5ENl3Qw":{"text":"I always enjoy a trip through the French Market.  The history of the market is rich, and i","useful":4,"cool":2},"UBkA1h7r6MqcG3dtFYo16g":{"text":"Must do, in my opinion. I've never purchased any souvenirs personally but there is a varie","useful":1,"cool":1},"-y5q5_p45XFgNa-W-PsF9w":{"text":"It's worth going through the French Market as the first half is mostly food concessions an","useful":3,"cool":2},"muL2R78-cDE4GKAGzRtBYw":{"text":"Stay away from this place, very touristic. Please don't go to the Po Boy sandwich stand, i","useful":1,"cool":0},"s0RKeMtoQYp3aFmkyAnXMg":{"text":"I kind of wish we had ate here - it had a lot of interesting eats - only thing I had was a","useful":1,"cool":0},"2KePuYJVnLUYmNDrcZQq3g":{"text":"Stopped in for a late dinner snack. On a busy night in town, was quiet enough to calm my s","useful":0,"cool":0},"ktEyIeIcRc8BV3ZJAPOlAw":{"text":"This place sounds more impressive and interesting than it actually is.  It's basically jus","useful":0,"cool":0},"ET7OyZ6Fb_SUJaC6ba6BeA":{"text":"Food was great and Is the service!!! I would totally recommend to anyone!! Red fish is fre","useful":0,"cool":0},"1r1TVcx4Kh72xgG6gMSQ1A":{"text":"The French Market was awesome! My mother and I both found awesome New Orleans themed jewel","useful":1,"cool":0},"diA0wpEahhS-qp8QKQkwGQ":{"text":"I love going to markets and this place was perfect. If you're looking for great souvenirs ","useful":0,"cool":2},"9GxgfGGoFAfJN6EnFgFQhA":{"text":"We spent 5 days in NOLA and headed here almost every morning. Such a cool outdoor, covered","useful":0,"cool":1},"_pulwA2mUIooesivOOIQLw":{"text":"Only saw one real artist selling his own stuff, everything else was china-made plastic man","useful":0,"cool":0},"3wycNVYu5kNKAF1UCwFxPQ":{"text":"Good place to visit. There's something for everyone here and you must stop at Loretta's pr","useful":0,"cool":0},"eyZtLfT-ZQFhKxKKC6CtLA":{"text":"Nice to stroll down Decatur St. and check out the tourist shops and some other things of i","useful":0,"cool":0},"iGTGs5gyX3vOupE8VpHJ3A":{"text":"It is nice open air market, many stands of souvenirs, handmade artifacts and food. You can","useful":0,"cool":0},"cX3ERBd4KR95aSTJBO-hAQ":{"text":"It's 10AM, I need to go somewhere where I can get, an egg sandwich, an ugly painting of a ","useful":3,"cool":2},"16OHEJEYC15gnPMAzLgebQ":{"text":"Terrible arrogant hostess, extremely rude and arrogant!!! Several parties in front of us h","useful":0,"cool":0},"cvvFRXkyyOw9Cw6FN4QltQ":{"text":"You should definitely walk through if in the area, but unless you're in desperate need of ","useful":0,"cool":0},"lQP7eUAh9PzNDuOb9vFQzQ":{"text":"Souvenir heaven!  This is the place to get all your souvenirs of NOLA.  There are tons of ","useful":2,"cool":1},"pNV3Wolut_2w22Wp48gyxA":{"text":"I love this outdoor market place! \n\nIt's filled with Cajun food, arts, clothing, kitchen s","useful":0,"cool":0},"rV26lxTj2Vg94k8PMRn_Gg":{"text":"Can I tell you how much FUN I have browsing the French Market & stopping by all the the ve","useful":8,"cool":6},"o0snM-hkdV4eeYxbwYFFaw":{"text":"I love these types of things when visiting a new place.  It reminds me of the market in Ch","useful":1,"cool":0},"lq_pCtsD_uI2HPkLl8qoMg":{"text":"Cool place to check out. Have anything you can think of and the prices aren't that bad.","useful":0,"cool":0},"3adR91SzlVF9WgIxJX5psA":{"text":"Love the vibe, their people, same items you can find in any other store (magnets, t-shirts","useful":1,"cool":0},"En-aRpfLXI4itaThZU2klg":{"text":"Such a cool market! There is everything from jewelry, to clothes, restaurants, and tons of","useful":0,"cool":0},"iEnTtsx0Sp8Jjcf-Sk3LAg":{"text":"Great place to shop, eat drink and be and have fun. Always crowded. There is a line to get","useful":0,"cool":0},"JEx5q00wQcpbFIU8BH9u9g":{"text":"If you've been to a swapmeet or the like, this is what it felt like. Yes there were a few ","useful":1,"cool":0},"Gn__Q-NAf6bKUKisV22a2w":{"text":"Really nice brunch spot for great beignets and a nice cup of joe. Loved it. Staff is so aw","useful":0,"cool":0},"mlxkEol1RF3RAi8jt6OSMw":{"text":"Decent place to visit while in the French Quarter area. Stay away from the crazy old asian","useful":0,"cool":0},"lezrVlv_Ldm-igwOmE2HyA":{"text":"Walk all the way past the food stalls until you get to the flea market.\nYou'll find someth","useful":3,"cool":2},"KW0kPY-_0AiYbXu5qsw1qg":{"text":"Nice atmosphere but was expecting more New Orleans based items. Bought a couple is souveni","useful":0,"cool":0},"DUSHRibFW-tazCEE0Bap0g":{"text":"Absolutely amazing. 5/5 recommend coming down here! I came back every single day! The seaf","useful":0,"cool":0},"Onx1islUFC7MWj67kmGz1w":{"text":"Another NOLA spot to check out and within walking distance from almost anything in the Fre","useful":3,"cool":2},"hlP-lRI-2F6KDLX_Szwrqg":{"text":"This is the place to go for souvenirs but be careful because many of the booths have the s","useful":1,"cool":1},"jNRUKU6ADYPQbhcZS3FTEg":{"text":"It is an outdoor market. They had some really good restaurants in there. We came back a fe","useful":0,"cool":0},"JCVE1ZhhjwxezGsT7PehPw":{"text":"Another great stop with souvenirs, artwork, t-shirts, and more. They have a little of ever","useful":1,"cool":1},"I_Ut09J63hu1Hh5bzOExTg":{"text":"Basically a flea market. Not really much going on here, some random decent food. It gets t","useful":0,"cool":0},"H4scnKddLUvV6V42rDzskQ":{"text":"A major disappointment. The history of this place is amazing, but be prepared to walk amon","useful":2,"cool":1},"2z2BSscr-ufxwEDUBTTB8w":{"text":"French Market is the perfect spot to walk around on a nice day with a beer in your hand.  ","useful":4,"cool":4},"tKk8k2eWhQeyrIZ1jzr5xA":{"text":"This place is decent...if you're looking for souvenirs to bring back home for yourself or ","useful":0,"cool":0},"MV70VKoloSk5ff_0n5KN2w":{"text":"Love this place. Every time I find myself in the Big Easy I stop by! Awesome spot to jam p","useful":1,"cool":0},"WWbErfd3HEKc8gFDbkkGaA":{"text":"MIXTURE OF ORIGINAL AND CHEAP-O= Probably the best part are all the food stalls near the s","useful":0,"cool":0},"OshXNXz6xv0hWJxFKqCGaw":{"text":"Fun market that is open daily and the vendors offer a wide range of items.  You can find c","useful":1,"cool":1},"SgR2P6RwfNVKxhtnim6w6Q":{"text":"More like a cruddy swap meet than a flea market.  It is completely unnecessary to go here,","useful":0,"cool":0},"QXaid4DWGnriBg1RMJWBJA":{"text":"A must see. Flea market with much more authentic flair. Food and drinks. Art. My favorite ","useful":1,"cool":0},"e8Vzd4xBcvEWRBDxVWS2Hg":{"text":"We enjoyed our shopping trip here so much that we came back the very next day. My son foun","useful":0,"cool":1},"g-9yt6v2TXh9_Qq8mzWKJg":{"text":"very cute and cool place. it's something to do to pass time and see a lot of local vendors","useful":0,"cool":0},"VPson-bzjaZMrVBK83uVwg":{"text":"The only way you can enjoy the French Market is if you establish reasonable expectations: ","useful":2,"cool":0},"vGkAqqE2QJg38pKHx-4NYA":{"text":"Coming from Seattle, we have pretty high expectations for open air markets so perhaps our ","useful":0,"cool":0},"au50Ok8Dt0fP9d8TEZZYEA":{"text":"This was my first time to the French Market thinking it didn't close until 6pm. However, v","useful":0,"cool":0},"wDFAI-PQqsjdInuE_4_CJQ":{"text":"Great place to go and waste some time walking around and enjoying the local scene. Lots of","useful":1,"cool":0},"yJ8LWPsdXXdjkE7O8hbO8g":{"text":"Nothing French about this market but the name! More of a cheap flea market with souvenir t","useful":0,"cool":1},"m_vZPPTAwOWDnmCtN1koFA":{"text":"Come to NOLA every few years and always go through the French Market. I usually try to cat","useful":2,"cool":1},"peTFnaxQH5DT1P65tZzcxA":{"text":"There isn't a more unique place in the us like this in the French Quarter things have slow","useful":0,"cool":0},"ksC6N7JpN-m19nrdmN2m_g":{"text":"Definitely a worthwhile stop during a day in New Orleans. Friendly vendors and a great var","useful":0,"cool":0},"n4AKL2wDo-wYhACm5HTJGw":{"text":"The French Market is the perfect place to go souvenir shopping. A dollar can get you a mag","useful":2,"cool":2},"tQixji3lbTSKuA8KtjuYAg":{"text":"This is definitely a farmers market for tourists. There are many food shops/cafes with Caj","useful":0,"cool":0},"hF5m2FwRsgufEJ8qRpB9Ig":{"text":"We got here around 3:30 and just walked around the market... first comes the food (oysters","useful":0,"cool":0},"lPYSGggbdVjTZZh5LPRcnQ":{"text":"A great place to get all the NOLA food favorites in one visit.  From pralines to beignets ","useful":0,"cool":0},"d2r0V8asF9HT4gAnt-rcOg":{"text":"Great place for outdoor shopping to find hidden treasures you either can't find in any of ","useful":0,"cool":0},"f5EVnXPO17ei7NxNu4qp4Q":{"text":"Love this place! Whenever I come home to visit New Orleans, I try to stop in and find uniq","useful":0,"cool":0},"8jhE75mkuObsIycF5bFVOg":{"text":"Great location for finding gems in New Orleans. Please go here before spending money on so","useful":1,"cool":1},"O_BL09BFiFQtqbct5yFIuQ":{"text":"One of those things you need to do when in NOLA.  As with any open market, watch the items","useful":0,"cool":0},"jkw7bzeVHYmoUV0ISfRytQ":{"text":"First of all:\nWHY DO DIMWITTED PARENTS THINK THIS IS A GOOD PLACE TO BRING YOUNG CHILDREN/","useful":4,"cool":2},"ahnUn5Mux-WZDGR2I86CmQ":{"text":"Highly recommend you buying your souvenirs at the French market. The French market also ha","useful":0,"cool":0},"6IbrfB21vOdWVKliUwaFJA":{"text":"The French Market is a must stop when visiting New Orleans. I had a couple of friends with","useful":3,"cool":4},"TcE-3rZ3XnnibJ5S-lnC_Q":{"text":"I'm kind of torn on the rating for this one! It's like a big flea market. Lots of food opt","useful":0,"cool":0},"pokdFUWUjtdJcOtdGdzY9A":{"text":"It was a nice trip, two sisters and myself took my mother for the day.  Food was great, se","useful":0,"cool":0},"aHCkeQvZJ1sCxeC6GTUOag":{"text":"What a great place to shop for all the things you need (and a lot of things you don't, but","useful":0,"cool":1},"T-emuwmM6bvTak0-Mkijgg":{"text":"Great sections of food choices to please everyone.  We had vegan muffuletta and gumbo, alo","useful":0,"cool":0},"RTodzj5TPHCnLla9dhllZg":{"text":"The French market is a bustling open-air flea market filled with an Eclectic array of mask","useful":1,"cool":1},"k5O_fr_0jg6L1DiuVh9RgQ":{"text":"What a great place to find trinkets, crafts, food, souvenirs, and live music.\n\nThe goods r","useful":4,"cool":3},"75M0zXHfzt4nC5Em3qjy9g":{"text":"This was our first experience in New Orleans and it was incredible. We went to a few place","useful":0,"cool":0},"eDlTLWWrJG3Tl1Vx6eLTvw":{"text":"This French Market flea market is a great place to walk around, look at local art, buy ine","useful":4,"cool":2},"fDmeh-MHfScNMdOm1YFRog":{"text":"When you're in New Orleans this is definitely a cool spot to check out. There are lots of ","useful":0,"cool":1},"fCEcGRfBLOIJuVq_jyYlTw":{"text":"Place to stop by to buy local things, some have good deals and there are restaurants insid","useful":1,"cool":1},"qJlSm7ypaqmTCJ7TXv4srw":{"text":"Great market with so many vendors. Clothe , fabrica, Shirts, jewelry, souvenirs along with","useful":5,"cool":6},"yKvmp-eVLQGL9gDQ8VS7NA":{"text":"It's a one stop shop! Oysters, Frozen Margaritas from Organic Banana, souvenir shopping, e","useful":0,"cool":0},"doXsTbw7ykpdPI9atsadNg":{"text":"Awesome under roof flea market, but more upscale. A big section with nothing but local cui","useful":0,"cool":0},"aT53Gkye3eDjXXfH2D33Sg":{"text":"This Market is a must see if you are in NOLA.  It can be a bit of a tourist trap but who c","useful":6,"cool":4},"famHTfDxZm8wQRtLc_ZUiA":{"text":"The French Market was a fun local experience. It is basically their flea market located in","useful":15,"cool":13},"BaY20zZ8Ab6-QmpxMqaCbw":{"text":"Interesting place and many different vendors. They have some if best places compare to any","useful":3,"cool":2},"Pj6EEEJyWP04L5r5-ZG8IA":{"text":"Very nice market with a lot of cool stuff. Lots of souvenirs and gifts but also some nice ","useful":1,"cool":1},"XwpTb7giYT8s5phgmNPzNg":{"text":"A lovely little market of a good standard throughout. A great way to pass an hour and get ","useful":1,"cool":0},"xpQy6yyT6kgjfbgm-gt_Rw":{"text":"Great tourist spot! Perfect place to get all of your souvenirs, try pralines, dine on Cafe","useful":0,"cool":0},"FUkGNgNOIEQ2pNo5MsTtkQ":{"text":"Beautiful place to visit on any day of the week, specially for souvenirs. Here you can fin","useful":1,"cool":1},"GQQAUmmz5nSzxY3S67PDFw":{"text":"Out door local vendors. If you are here must try the oyster bar and the roasted corn. The ","useful":1,"cool":0},"9108Tn7Oli-RnitNWQ1bwA":{"text":"Interesting gathering of outdoor stands with food and drinks for sale.  We sat at Js Oyste","useful":0,"cool":0},"BsriatkamfmmzBCRtkLyDw":{"text":"I think we would have been okay if we skipped the French Market. It was almost like an out","useful":2,"cool":1},"AlqxJ97MZIGL5mZeR9K4FA":{"text":"The French Market is an open air marketplace that's open for business daily. It actually s","useful":3,"cool":3},"_qdtNqZkQsJjkgjaevT3NQ":{"text":"Unlike the French Quarter, the French Market was actually created by the Spanish despite o","useful":3,"cool":1},"JpUtFPNPaYNdRmCJ5RMBww":{"text":"Same 'ol cr**p from China that you see everywhere - what a waste!  Too bad as the history ","useful":0,"cool":0},"6HTjy4oe6LJoF6ap-fU5ig":{"text":"If you're looking for a place in New Orleans for some good souvenirs, this would be a perf","useful":1,"cool":0},"TuuT9jWOohLA0Uud6knR8w":{"text":"Some good stuff.  Definitely  worth visiting.  Lots of merchandise that is cheap and from ","useful":0,"cool":0},"ivbodEkIU0rYdQ6m6YjI0Q":{"text":"Lots of great shopping and food vendors! You could easily spend a day here shopping and ea","useful":1,"cool":1},"Ea1va3PtuzSvxcOwm1t69Q":{"text":"Nice waiter, good gumbo and that's about it. They won't split checks. They automatically c","useful":2,"cool":1},"3jrLNYtVSHku5wJyz4UUHg":{"text":"A nice place that has different items. It will blend in with the backside of the French qu","useful":0,"cool":0},"ZVDUtlCE15FGdlHBHdRxzQ":{"text":"Cool market with everything you could ever need as a souvenir from New Orleans, not too ex","useful":0,"cool":0},"29JizRWhbWAhcB_GnoXCuQ":{"text":"Everyone's reviews about this place is pretty spot-on. \n\nVendors touting stuff that you co","useful":1,"cool":0},"OM7McXAaoAeMs25w2rUnJA":{"text":"Great market for cheaper items that you would find in the souvenir shops. Lots of variety ","useful":0,"cool":0},"pf8Hbj4xWKpGk3hE9wINKw":{"text":"Time to get souvenirs!! Seems very big but they basically selll the same things. The farme","useful":0,"cool":0},"CXllYqu_QJDZTP_UDeuy2Q":{"text":"Very cute area, but a lot of the same tourist-attracting merchandise in every \"boutique\" a","useful":0,"cool":0},"TG5QSzd1lK28jiIQnjSyGw":{"text":"This is a great spot to check out for lunch or for a nice walk.\nWhen a group of friends an","useful":0,"cool":0},"1bjLGc0Xa6Jk3iOoRa6zKg":{"text":"Wish we had walked further down Peters street on our first day in NO we would have happene","useful":0,"cool":0},"RC9DL5q72PJCXF-gTWkSyg":{"text":"I love love love markets so this place was a delight. Everything (mostly) is covered by th","useful":0,"cool":0},"jXL3ycBM26-cfoQKaQ8oug":{"text":"If you want a truly good sandwich go here.  It is where the locals go.  It was the best mu","useful":0,"cool":0},"GxFkKfDGiaiFhlvJhp1G1A":{"text":"I really love coming to the French market. Lots of vendors,  lots of artwork. Lots of thin","useful":3,"cool":2},"VIM_ERGexmnplCL8Gk8BpQ":{"text":"This was really fun to walk through. We were close to our airbnb so we were able to go to ","useful":3,"cool":0},"byYU-0yKTOt-Au_hG4-rmA":{"text":"Think \"Pike's Market Seattle.\" Grab a Pimm's cup, and go flea market shopping. \n\nThis is a","useful":1,"cool":1},"SByYsbALxFhAeiJOPmkhZQ":{"text":"This is a must stop when visiting New Orleans! It has everything and then some!! Prices fo","useful":0,"cool":0},"opdwq7f4B7LbeNp6yVIi6A":{"text":"Very reasonably priced deals. Large selection of hats, watches, walkers, sunglasses, shirt","useful":3,"cool":1},"e6F6DaW98PFmKGehlXDMjg":{"text":"We picked up a few cheap t-shirts for the kids, a gator head for my boss and a mask for th","useful":1,"cool":1},"itGAP2XNcJ0LFdVWWPIQAg":{"text":"Wandering Decatur St., I found this Flea Market. Filled with rows and rows of New Orleans ","useful":2,"cool":0},"5i62-sTWnl8uEHvkw9Yzmw":{"text":"Go for the experience. Go for the almond freeze drink. Go for the bloody Mary's that come ","useful":1,"cool":1},"EBtqCgiEGK-1_N0vlOlw9Q":{"text":"The French Market is a great tourist location that I think everyone should do at least onc","useful":1,"cool":0},"yWFBG0TKda015p8v4-Yj1Q":{"text":"This is where you go for New Orleans souvenirs! They are way cheaper than buying on Bourbo","useful":1,"cool":2},"tlEtqREnWK71f5k-M7Opxw":{"text":"Indoor/ outdoor market.  Food vendors and small business ( commercial gifts) as well as in","useful":2,"cool":0},"YD1wfERv7RfLw-neZ8GDGg":{"text":"When you're a tourist in the Big Easy and want to shop local, there's really one place tha","useful":0,"cool":3},"8d9vWTHfMvfymLLTD_1wMA":{"text":"Plenty of good music shops and restaurants to check out plenty of sunshine on the Veterans","useful":0,"cool":0},"48YYUEzffQ6397cvMhyieA":{"text":"There were a lot of vendors but the items were pretty much all the same walking around. Co","useful":1,"cool":1},"0xL8T7Avl-gyE4ENPgB3MQ":{"text":"First time here stopped to grab a bite to eat before leaving new Orleans. For as busy as i","useful":2,"cool":1},"lcmN-KfGPvhGQiB8z3wKEg":{"text":"I happen to like this place, yes there are some junk-ie kind of vendors, but there is also","useful":2,"cool":1},"RyvTyshwlhxhKc-AIsixnA":{"text":"Pretty lame. Liked the cheap voodoo dolls, gator jerkey, and magnets I picked up here, but","useful":0,"cool":0},"9FFueoTmw2ifPfSp-lg1Kg":{"text":"Possibly the greatest Market I have seen in North America.  go here first to peruse your p","useful":1,"cool":2},"SEe-s6n4AhplPdD0eYOjjQ":{"text":"Should be your first and last stop in the French Quarter.  First- to get an idea of everyt","useful":1,"cool":0},"GNnTNtHQopoVzKQf2VqQZw":{"text":"It's 8:23PM on February 8th, you are \"closed\" for an hour and a half for no reason, you ha","useful":0,"cool":0},"zcWAciialwY14hENrM8_xw":{"text":"I always find great deals here! If I lived in the area it would be my go to place at least","useful":1,"cool":1},"Br9BUmid5CXofRwn-visPg":{"text":"Yes, it's a touristy thing to do but don't skip out on coming here. Aside from Frenchmen S","useful":0,"cool":0},"E9vcpAypJF2fuS2gccbHmw":{"text":"Best place to buy souvenirs. Don't even bother with the shops. You can even bargain if you","useful":3,"cool":2},"AJWMzXiiHvJeDJc0X8r0lw":{"text":"This outdoor market has an excellent variety of NOLA and French souvenirs and items -- fro","useful":0,"cool":0},"1cULdA16dU7mlYal91mIVQ":{"text":"The food is FUCKING AMAZING! Andrew is AWESOME DAMN SAUCE great damn bartender. I literall","useful":0,"cool":0},"nbw4sW6zxxZmWr6LI7fI_g":{"text":"I love markets. This one was no exception. It was a lot smaller than the ones i've been at","useful":4,"cool":4},"hl1OzMalreY9PWvEJwk7sQ":{"text":"Such a cool market- that's open daily with it's all encompassing range of retail stores, t","useful":1,"cool":0},"Vh84gw_SbZ3WAMa5ODLUww":{"text":"Literally a flea market - it shouldn't be a tourist attraction. Cheap gimmicky glasses, ce","useful":2,"cool":0},"tatt5vJOp2gOOXm93zckAQ":{"text":"If you want to get your mardi gras stuff and souveiners for NOLA this is where you wanna g","useful":12,"cool":13},"sJHcpS-PRak-V8ptTkGrAQ":{"text":"Great place for shopaholics like myself. Tons of beautiful handmade items, etc! Fantastic ","useful":0,"cool":0},"P4iB3xInxWW-feS3mYxCvg":{"text":"When I was younger, we went to NoLa and walked through the french market. I remember it be","useful":9,"cool":2},"-I0hHpmn7hFFila226pg7g":{"text":"Disappointed. I wish the city or whoever regulates this would only allow local artists and","useful":0,"cool":0},"u7ewDmGERhxjmkLOIA8drA":{"text":"Snacks,\nTrinkets,\nAnd the like\nFor tourists who\nNeed to buy tchotchkes or avoid hangry.","useful":0,"cool":0},"YU_lVWalZQ7FBHBtFxB9eA":{"text":"The French Market is a market and series of commercial buildings spanning 6 blocks in the ","useful":4,"cool":2},"LAUL7tBXXKNCGlKi0qILUQ":{"text":"I'll start with the positives.  It's pretty spacious & has shaded areas which is nice.  Th","useful":0,"cool":0},"IkuDwW011uGndUNj4kx3yQ":{"text":"The saddest, crappiest flea market ever. It needs a total makeover - get rid of the people","useful":11,"cool":0},"i2vBmLuyxSFxcUq3Bv6hvw":{"text":"Kristi was very relatable and super friendly. I will definitely be back and refer to a fri","useful":0,"cool":0},"qKAL1LutCA6vFWl7Sr_AXw":{"text":"Blech. Highly over-rated tourist trap. I enjoyed the live jazz being played at the outdoor","useful":0,"cool":0},"2t33J2DRylKVVqlURT-pvA":{"text":"I regret not spending more time at the French Market and not going there on an empty stoma","useful":3,"cool":3},"fufwa2AayR9uRndZbljomQ":{"text":"The WOIST!  This is a DISASTER...  Booth after booth of the same crap..  Beads, cheap cell","useful":2,"cool":0},"hyh_yDDUjj_17m7sDv_DaQ":{"text":"Really awesome market. Great samples of hot sauces, great selection of food and nice cloth","useful":0,"cool":0},"6PMltenLzD_dEoC5fP_sug":{"text":"I really dig open markets, make me feel like I'm back home in Asia; usually one can get ev","useful":0,"cool":0},"3eAJs4FHK94E2fG1aWprfg":{"text":"This is such a strange and eclectic must for NOLA tourists.  The best part is the ocassion","useful":0,"cool":0},"W0sWniMLv1wgRyHZhoNxwQ":{"text":"Great place to shop. Great jewelry and t-shirt options for gifts! Also has some great drin","useful":0,"cool":0},"9MNuFGek-TJd3cXmTi8PSQ":{"text":"We know the French Quarter is touristy but at the same time it has plenty to offer locals ","useful":7,"cool":6},"MC7kNOtyAGQzMDbYApCCwg":{"text":"On our last morning in NOLA, we just happened to walk into the French Market because we we","useful":1,"cool":0},"FmcC5Z2rg77ET69mOldnNQ":{"text":"OK. Offerings were typical flea market stuff. Food much more interesting than items for sa","useful":0,"cool":0},"k6swBHNZtemGYioWLxeqcQ":{"text":"I loved this market place.  I found good deals on beads, fans, African print clothes, and ","useful":0,"cool":0},"Pguu_iQ8Vh1brnTo7hN8gw":{"text":"Smaller than expected, but if you are looking for cheap T-shirt's that is the place to get","useful":0,"cool":0},"IJo5D0pyn1hj2AdWbAlozA":{"text":"Been here and done that.  It's a nice stroll and a place to buy your omiyage aka souvenirs","useful":0,"cool":1},"5VDwuZIGekl0MlY7F-uNkg":{"text":"I am not a fan of New Orlean but this place was amazing. I have a cup of coffee with cake ","useful":1,"cool":1},"O5nYaPxIwDnOU528W0G36Q":{"text":"While enjoying New Orleans, my in-laws recommended a stop here while visiting the area. Th","useful":4,"cool":3},"jwIrIxmAV2-ndkad7PmJLQ":{"text":"08/10/2011 - 04:27 pm \n\nSt. Louis Cathedral & Jackson Square - True Landmark Beauty \n\nFren","useful":2,"cool":2},"zubRKQGqQfMhz5pvScRu-A":{"text":"If you look up the French Market on Yelp, you'll find two business profiles under differen","useful":3,"cool":1},"j37-aaUJv7-uiIZzL32hZA":{"text":"Seriously, this is the only place to buy souvenirs in all of New Orleans. All the expensiv","useful":6,"cool":4},"syzlYoOtcscBmdUv3lZCfw":{"text":"We just ordered to go food from here and the food was terrible, the swamp platter was ined","useful":0,"cool":0},"HuQxPFlhQHtZCCONaIG_kw":{"text":"In recent years, I tend to gravitate towards visiting a market when I am travelling. I get","useful":1,"cool":1},"FQoM5wSc7-h93mDBphUdYA":{"text":"You must come here to buy souvenirs and drink coffee at cafe du monde and eat beignets. Th","useful":0,"cool":0},"CCja5_LfAmhDi4uXjQ51tA":{"text":"This stop, yeah, we could have skipped it.  Someone here at home gave us a long list of pl","useful":1,"cool":0},"U1QuXeeSdf6khR0-j2vlKw":{"text":"Hey look it's one of those NOLA spots that I can't believe I haven't reviewed yet.\n\nSo let","useful":7,"cool":5},"cI3spx9NE2sjsUFrpEDo8Q":{"text":"We had great raw oysters and crawfish boil at the oyster bar in the middle, yummy. Staff w","useful":0,"cool":0},"w7yYtoLvFVhwX-dMdCNU5w":{"text":"I love going to markets!  This one was great!  I was looking for souvenirs to bring home t","useful":2,"cool":1},"WgWf_ZuyFsxH4XK1PIic1w":{"text":"Nice local produce and local people who represents local culture...\nNice outdoor organized","useful":0,"cool":0},"FDB0pDfo0G9SEwMod5iwrg":{"text":"If you're like me, you love to pick up souvenirs from places you visit. Such as T-shirts t","useful":2,"cool":2},"Dq8d8dRcmBE_nI_6UeUXsw":{"text":"We came at the end of June so the crawfish were pretty much out of season but we still mad","useful":0,"cool":0},"04TIWLdjrjdzvQWkcrpGfA":{"text":"It's a great little area to walk and look at the cute and creative handcrafts. I think I'm","useful":1,"cool":1},"0dYUenkLdldi25W2z4QmRg":{"text":"The French Market is a good place to get food and smoothies, handmade artisan goods, and t","useful":6,"cool":3},"Z7SRNc1Ur0Q3sWnz0IP9AQ":{"text":"The French Market is an open-air exhibit hall of various food merchants, cheap souvenirs, ","useful":0,"cool":0},"506rhoZzyIHcUi-6cgPDDg":{"text":"With the entire French Quarter bursting at the seams with souvenir shops and restaurants, ","useful":0,"cool":0},"E3BzoYABlGik7Z73m33ivA":{"text":"If you're looking for something to do besides drinking, this is a fun way to kill some tim","useful":1,"cool":0},"_8h_vE2dsk-xRiW9Hkz-AQ":{"text":"Awesome place with some pretty cool little trinkets, shops and some quite interesting food","useful":8,"cool":7},"0Ti14M3b1bIxg6md7UTQog":{"text":"I was looking forward to the most was going to the French market and it was everything we ","useful":0,"cool":0},"eR1v5OHE4uCKqXJu4EDUHQ":{"text":"Nice place to visit for one or two hours. Nothing wow, but at least you can see something ","useful":0,"cool":0},"5zcMszDjk3qC9dopIMwt3g":{"text":"Had a great time there grabbing unique trinkets and such! Highly recommend, bring cash","useful":0,"cool":0},"S38Nhe07lyapvpO4sLoSaA":{"text":"Fun atmosphere to watch a football game, drink a few beers, eat some oysters and enjoy a s","useful":0,"cool":0},"DB-X8RC-kd-4Rpppq-DHAg":{"text":"If you're looking for souvenirs to bring home, then this is the place to get them! You'll ","useful":4,"cool":4},"_WQAnoEZmxUf9M55taqbnw":{"text":"Major Tourist trap! Vendors just selling cheap quality chinatown items at a high price. Mo","useful":0,"cool":0},"547YyU-JUGqoTI9c2l7MHA":{"text":"Come here for your cheap souvenirs! We picked up a gator head for $10 instead of most plac","useful":0,"cool":0},"CE1QwchnS5Aygg1N2Ql6IA":{"text":"There's such a variety of unique finds that I wouldn't miss out. From home decor, clothing","useful":0,"cool":0},"rnyMtFYwWkr2KlGd_cquWg":{"text":"The market has all kinds of food (oysters, alligator on a stick, fruit).  They have many s","useful":0,"cool":0},"pUSKuc_K7ElzZU5EjeB2Lw":{"text":"I remember the French Market being much better the last time I went. Nowadays, it's a tour","useful":3,"cool":1},"_Xf5ot5fYrBiDWA9pmlOjQ":{"text":"When at the market you must stop at Mother Natures Cupboard!!! What may seem like a mere s","useful":1,"cool":3},"73MVXcJveqDfdYhdOYzg_g":{"text":"I enjoyed this spot because of the local food vendors. But the prices of some other vendor","useful":1,"cool":0},"FjR4RETxuXEBDak6etKijQ":{"text":"This was my first experience with a Flea Market. Originally the plan was to get Mexican fo","useful":6,"cool":6},"UgCyzOcoDLkbcREw7LJ_9w":{"text":"Its pretty cool. Fun touristy stuff to see. What you would expect from a flea market.","useful":1,"cool":1},"3vIElFyXU84KfnJbiBHHOQ":{"text":"I would not recommend this place at all. It's a lot of tacky mass produced garbage. If you","useful":1,"cool":1},"mi5wKsrvlj0aA7k1AmMagw":{"text":"Nice stroll, bur it's not much different than other outdoor flea markets from my hometown,","useful":0,"cool":0},"wmj-xyyDOt3G2efCXYgAMg":{"text":"We really enjoy walking around the French Market!  There are a lot of junk stands, but the","useful":1,"cool":0},"MEWdXNTi8DEYp5nnDdGwdg":{"text":"Historic, charming, and pretty huge market with lots of food, drink, and shop stands / sou","useful":0,"cool":0},"LLA3GDS--IRtX_0isYltZQ":{"text":"Ok yes!!!! Mufelletas are great.. they sell lots of random stuff. I only bought the sandwi","useful":0,"cool":0},"CUuedXWx2SyR3uimtJdNwA":{"text":"First stop in my NOLA adventure and man was it overwhelming! This place is pretty big with","useful":1,"cool":1},"t42qLvTlz_cUVsfdwIKdQg":{"text":"If you look up the French Market on Yelp, you'll find two business profiles under differen","useful":1,"cool":0},"OD9kjlKDFV4_bWthftBYow":{"text":"I think this is a pretty cool spot for tourists looking for souvenirs to take home to frie","useful":1,"cool":1},"yeV5Ph-1z_-g_7Wm_btDzg":{"text":"We loved this market so much. It had so much life and character. It is a nice place to go ","useful":0,"cool":0},"Ad2zM6OPLUAkM0scHcJSqQ":{"text":"The selection was not as much as I expected and the back of this market is a flea market w","useful":1,"cool":0},"T1MxzYKUTo5TCPDZupDxHQ":{"text":"The French Market is awesome!! So many vendors where you can get souvenirs and other items","useful":4,"cool":2},"v54xglyLMEwzs2QbLyIPUw":{"text":"Out of all the places we ate, the real deal had to be at the French market. We ate from th","useful":0,"cool":0},"i-94oH6vrLe1X2cs7umDng":{"text":"The French Market is a huge flea market and I think it is a farmers market as well. We ent","useful":1,"cool":1},"fAU7j1Ivm_78kqubUsqW9A":{"text":"This is a great place to stop on your last day in the city to pick up souvenirs.  There's ","useful":1,"cool":1},"1rlnCP0kix9j4waW7FpjEQ":{"text":"Popular and most well known market in my opinion in New Orleans. Even if you intend not to","useful":4,"cool":4},"8fGuVz1HJGa04w1EYH76QA":{"text":"We came down to the French Market lured by the promise of gluten free crepes..and then act","useful":1,"cool":2},"Eoudqri4bB8591jQHmNhHA":{"text":"I love the French market it's a really good place either to eat or shop for souvenirs beca","useful":1,"cool":0},"B-mjG_ixqIoz_uV9aBlyNw":{"text":"There are tons of shops and places to eat. \n\nMost of the shops have junky cheap items like","useful":4,"cool":2},"l7fHcjBW5V-taHTpqUHinA":{"text":"I love the French market everything is so good and reasonable prizes. I definitely recomme","useful":0,"cool":0},"RXZ-fBUSCDDK5nhKsKQmxA":{"text":"This is a must stop by tourist place,especially if you want to shop around for souvenirs o","useful":1,"cool":0},"6WSC42us8yS0OmerOgM3Tw":{"text":"This shaded, open air market space is a great place for souvenirs if you're visiting New O","useful":1,"cool":1},"2YFKLBsPR_cKHtCS5penZQ":{"text":"Fantastic outdoor venue with options Unlimited!\nI visited this location due to several rec","useful":2,"cool":0},"Ttf1BLn7EE5IM3QPKG3Tuw":{"text":"I was so in love with the character of the city that I thought this market would be filled","useful":2,"cool":0},"3sW4j5KJcL39tSQJMvEX4g":{"text":"Visiting French Market is a must while In the Nola area.  It is an open air flea market wi","useful":8,"cool":6},"h_uX80mOcUS7ZCurN94ghg":{"text":"After walking around the French Quarter the night before having some great drinks and enjo","useful":0,"cool":0},"FlBDTXfQjXLNvcztV7oD9g":{"text":"A must see in the Quarter. Lots of vendors selling food, art, jewelry, clothing, souvenirs","useful":1,"cool":1},"okloEnbcm3IaURKt3CK62w":{"text":"Drop in here for your souvenirs instead of on or near Bourbon Street.\n\nYou will save nearl","useful":3,"cool":1},"dMQFFaYF9RH_C4gCaFItMA":{"text":"I find that the shops along the walk on the way to the French Market are a great review of","useful":0,"cool":0},"ct8YzCM4D0EuenzsJBGutw":{"text":"Definitely check it out and a must see. They have a little bit of everything. Food, drinks","useful":0,"cool":0},"bwW-xpTk2rd6ngTpKm9e9g":{"text":"I'm not sure how anyone can rate this place higher than a 4.\nThe name \"French Market\" soun","useful":5,"cool":4},"5N6oxSKpa70B2b0Xd4sH8g":{"text":"My husband and I have ordered take out from over 10 different restaurants since we have be","useful":0,"cool":0},"uTDzn1xjPg1fiTFMXbE9EQ":{"text":"Nice flea market as we call it in Tx plenty of items to browse with a lot of good food sel","useful":3,"cool":0},"YUBC1mN2lzlnJz16WL035A":{"text":"Ordinary food, over hyped. The shrimp and crab dip had no crab, very small pieces of shrim","useful":0,"cool":0},"iUqrijHvjck9Dt4BFTYlvw":{"text":"As far as markets go, this was one of the coolest. The shops are diverse, have reasonable ","useful":0,"cool":0},"aVeujjzfnyxxtqzUCv2r3Q":{"text":"Ton of amazing food and artisan vendors. Great place to buy a souvenir and a bite to eat.","useful":0,"cool":0},"LHjowcWG3tSqAPl38161GQ":{"text":"This is a very interesting place, probably one of the only places where you can get super ","useful":3,"cool":2},"PTHglaPPnYl_0r8IEl31kA":{"text":"Local vendors, local foods and local flare.  This is a great stop on any French Quarter vi","useful":3,"cool":2},"wJuquM5TXh4PNgbwiR8esg":{"text":"delightful place. Much to see and do.  good food and many vendors.  definitely worth visit","useful":2,"cool":1},"bUYUUYGYezGIRNwb0qXgcQ":{"text":"This was a great market.You might find some suverniour here.I walked around here.I found a","useful":1,"cool":0},"aqzSXo-Hxae5gdEagY10dw":{"text":"What a good spot to experience the city.  You want to try all sorts of local foods?  They ","useful":1,"cool":1},"bHf5giN4T72-dMxAZQ1w0g":{"text":"Looking for souvenirs or a snack this is a good place to start. There are many vendors sel","useful":6,"cool":3},"xIUecvtEYJf9nBDCX22ALw":{"text":"I have so many treasures from the French Market! In fact, one of the vendors who I visit e","useful":1,"cool":1},"uIqLiHpsUOWrXXkSXI4OFw":{"text":"The market is a good thing to do before taking a flight back home after a wild and crazy f","useful":24,"cool":23},"uF8vsYV2U5BKpD1ejtlihg":{"text":"We walked throught the French Market out of curiosity. I found the French Market to be ver","useful":0,"cool":1},"VoOO-odjU01OYc-4f2rSWQ":{"text":"The French Market was originally a Native American trading post. It's America's oldest pub","useful":3,"cool":1},"bSPgDjsnbCj5BtGFxcd3Rg":{"text":"Briefly stopped by the Market and was happy to find the the alligator tails I was looking ","useful":0,"cool":0},"RC8HJgSFcCwQJAVGv6a3bA":{"text":"Guess you gotta go but just don't go again. Cheap t-shirts, caps, jewelry. The food counte","useful":0,"cool":1},"qSNVk7CdzFoT9n0k4ImIqg":{"text":"This place was the highlight of my trip! I felt like this was more my style. We had previo","useful":1,"cool":0},"5Bw2Cc0BMhXpTLa3fr3SgQ":{"text":"For food, the market is a must for cheap but great quality eats. \nYou can get alligator in","useful":2,"cool":1},"TRSOx843Jm3eESZ7mgmsTA":{"text":"I would give this place 3.5 stars.  The French Market is a major touristy thing to do if y","useful":4,"cool":0},"EYfo53nYb8TJ5KnPxlL60Q":{"text":"I love coming here and strolling through the different vendors admiring the oddities, stra","useful":1,"cool":1},"83yajMJAOKpH563lFyEPRQ":{"text":"Whenever I travel, I always make it a point to visit the local public market if available.","useful":1,"cool":1},"gziTrTBSauAiU7i-n5curw":{"text":"The French market was absolutely great I thoroughly enjoyed it and the music was absolutel","useful":2,"cool":4},"wQhgugK5PQfHMXEHWenExA":{"text":"You should make a sincere effort to visit the French Market at least twice during your NOL","useful":8,"cool":5},"kJotzMYjbiKa1Q09IydGWA":{"text":"This place is an outdoor market that sells food, clothes and decorative items. It's in the","useful":3,"cool":3},"-kgFlMKha-4btMM4l3rFFg":{"text":"I really enjoyed visiting this market during my time in NoLa. Half of it consists of food ","useful":2,"cool":0},"KLXBfrNOOZQLRzNRAIPLyQ":{"text":"It's really hard to actually pin down *exactly* what the New Orleans French Market is. I c","useful":7,"cool":3},"Ku6JlZ9QiSPnpvnYv9wVjw":{"text":"The French Market is a must of a trip to Nola. There are plenty of food (and drink) option","useful":0,"cool":0},"4FKx8veFQEc7wi7zbtNTHg":{"text":"Want to support local? Look no further! They have it all here, and at a better price than ","useful":4,"cool":2},"lnuDBDy51oCQJ0bKF7wxig":{"text":"I really enjoyed this Market. They have everything from food to drinks to music and cool l","useful":1,"cool":1},"oRmBYdb_aRDV9byfi3454Q":{"text":"French Market is kind of street market with small stands where you can buy local souvenirs","useful":1,"cool":2},"6kpIwnsSSVGOEWR1nmxldg":{"text":"We stopped here again on this trip for no particular reason. We were in the area and it se","useful":3,"cool":1},"sT3kfTbo_oAzgs6yiBRsHQ":{"text":"I love this place and I always stop in when I first arrive in NOLA and it's the last stop ","useful":1,"cool":1},"aT1ns0YZXGL43JSqwAETXA":{"text":"It's a tourist thing to do but not much to see here other than sunglasses, fans, and a few","useful":1,"cool":0},"Yxggn2SnlKH2hoKPPq20KQ":{"text":"Interesting place with many different vendors. They have some of best stores compare to an","useful":0,"cool":0},"YBAN08PdlwOTYoEtiPmbSA":{"text":"This is truly an experience you cannot miss, when visiting the French Quarter. Purely loca","useful":5,"cool":3},"k0N7Wo-LncduoDzQeB0DHQ":{"text":"If you don't like crowds you won't like it here. There are a lot of predominantly food opt","useful":1,"cool":1},"awgWEBEiZe86oPstwCPN0Q":{"text":"You know I had to! Right down the street (5 min walk) from Cafe du Monde, so it's perfect ","useful":1,"cool":0},"tlh15rqeK2sZKFLLmtIp8Q":{"text":"We came to the market a few times during our trip great big open area with plenty of food ","useful":2,"cool":1},"hSIww5w6g0dSrQlwRLsmuQ":{"text":"This was such a sad disappointment. The same vendors over and over,hat stall,African stall","useful":0,"cool":0},"VPVtV2iRzlq-mOjv_GzL3w":{"text":"Oh, how I LOVE the French Market!! This open-air spot is filled with some of the coolest t","useful":12,"cool":7},"G-nUpsyKKfVlPvapUnweZQ":{"text":"I really enjoy the French market! It is an absolute must visit while in the French Quarter","useful":44,"cool":43},"bdLBYTnQujkEwh3VL-5ioA":{"text":"This is an outside food/flea market. While it is cool to walk around and see stuff, you ca","useful":0,"cool":0},"biCZ-ldp8mx2lA7AfxZv4g":{"text":"Got my boys an alligator head here and they loved it!!","useful":0,"cool":0},"nsm0xLq3QtNMpAC-im8qZg":{"text":"They got everything here! Grab yourself a po boy and start shopping! Tons of selection in ","useful":2,"cool":1},"K3yEngzarxp5CjGQa_oF7g":{"text":"I've been meaning to write this review since I visited New Orleans this spring for the fir","useful":0,"cool":0},"VYqZF3PJXQZXuYMt6JVuRg":{"text":"A unique outdoor market just outside the French Quarter where people sell everything from ","useful":13,"cool":13},"yL_Ib73EiLziE5JT3OG6Yw":{"text":"Anything and everything can be found in the French Market.  Best place to get the best pri","useful":1,"cool":1},"58FwWZVp3Fk467SzKOr-sA":{"text":"Had breakfast at Cafe du Monde very early, but the stores don't really open until 9:00 AM ","useful":1,"cool":1},"JTJSNYUHCQLt9wdQUiPiUA":{"text":"I'm kind of torn on the rating for this one! It's like a big flea market. Lots of food opt","useful":0,"cool":0},"j4Z-C39rl9z-M-lose0QFg":{"text":"In the heart of the City lies this beautiful little gem of a Marketplace. You can get all ","useful":18,"cool":13},"C77fmBkjQkhSaxm11SefdA":{"text":"This is the place to start your shopping. Everything from cheap and cheesy to handcrafted ","useful":1,"cool":1},"th01KPfj0dfb5ZV9WJG97Q":{"text":"The French Market has a little bit of everything to keep you entertained for a solid hour.","useful":4,"cool":4},"qhhtdC0MwkWnKFtMRy-Zqg":{"text":"Flea markets are the way to go! They have an assortment of local products. Plus, they have","useful":3,"cool":1},"z1ssGNMqx724tHD4ZxgJcQ":{"text":"We used to love coming to the French market after a stop for beignets. Unfortunately it's ","useful":21,"cool":7},"8VI1Awx8UcX-aYzqHIZUyg":{"text":"This is like a stationary flea market that's always just off the main area of the French Q","useful":1,"cool":1},"DGjU0inydaY82lW0Rv0Klg":{"text":"It was worth the short wait in line! The restaurant is large with a large upstairs room to","useful":1,"cool":1},"Im8vmmduk7CAO24E6sKcAw":{"text":"Sooooooo many different great options. Really to just pick one place to eat at. From the s","useful":0,"cool":1},"W0joLbDe6aEjJTVF0WK6Jw":{"text":"This is a place that must be visited while in New Orleans.  There are plenty of outdoor ma","useful":0,"cool":0},"JQLc6dLw6RmUy7_l_xLSaA":{"text":"Outdoor covered market just a short walk from French Quarters~\n\nThis market is an amalgam ","useful":7,"cool":5},"8o_fxdghtwPltbDOKkeFEg":{"text":"Definitely a place to spend an hour or two. Most of the stuff seems like wholesale Chinato","useful":1,"cool":2},"iP4h6YmGgBpmONtWjtcSBA":{"text":"The French Market is something you are going to eventually do when in New Orleans.  They h","useful":1,"cool":0},"DCztKoW7dkiELkyVwRT9fQ":{"text":"Mix of souvenirs, food, and very few authentic new orleans fruits, baked goods, artists. H","useful":1,"cool":0},"oS6J-mrJ94CpD5DId8wB8Q":{"text":"This place has the best prices so far for masks and other touristy must-haves :)\n\nThe Fren","useful":3,"cool":0},"nbsj1KzCdCtVEjNG7gusTA":{"text":"The bloody mary, oysters, alligator heads and alligator claw key chains made a nice aftern","useful":0,"cool":1},"k7httRz5C5A_4T8yd_9yCw":{"text":"This place is the perfect place for tourists visiting New Orleans who have never been but ","useful":6,"cool":4},"jByqvKrvh6ftThxr47yDSw":{"text":"Really loved this spot. It's a pretty food flea market and had New Orleans & Lousiana them","useful":0,"cool":0},"9IfXdCS9XP65tih9a5-YTw":{"text":"Very laid back eating spot... a break from the hustle and bustle of shopping around the ar","useful":0,"cool":0},"TFr0qnKV9E1CmL3mg6qDMw":{"text":"I like this place since it was cheaper to buy souvenirs than any other stores that I found","useful":1,"cool":0},"iN0AjUKPWxCpJJBYgrMdWA":{"text":"Meeting local artists/craftsmen/businessmen is a really cool way to explore the culture of","useful":2,"cool":4},"uito2X9DZY0If5Yc0PnAaA":{"text":"Pretty fun tourist diversion. You're not going to find incredible items here, but you'll f","useful":1,"cool":0},"WQECG67rbnn-8-k54eW8UA":{"text":"Fun place to spend some time. Most of the items were trinkets so for us the highlight was ","useful":4,"cool":3},"JoPI8tDgT4D8a7cIlaRfZA":{"text":"Interesting place with many food stands and a flea market too. Food is pretty pricey and I","useful":0,"cool":1},"mjUk4phoFW8411fXeNMe5A":{"text":"Flea market located in the French Quarter. You'll find EVERYTHING extraordinarily NOLA in ","useful":38,"cool":40},"OIp-lGFnHAUun0xByUxgWQ":{"text":"A great place to buy affordable souvenirs.  I bought several bracelets for friends and a b","useful":2,"cool":0},"dxaEQywEa1amZ-gfK-dEMw":{"text":"Definitely a area you will want to check out with visiting downtown New Orleans. Don't bot","useful":2,"cool":0},"R8y8g_1DhqIYose_g43BAA":{"text":"This review has nothing to do with the actual market. The vendors were polite and the craf","useful":0,"cool":0},"Bs20YqDrDmC9FOAZhv5lgw":{"text":"Located right in the French Quarter, (more like the outskirts) this market is awesome! Som","useful":0,"cool":0},"Jr_MxoT6liASalIRyxNgWg":{"text":"This was a great place to find souvenirs at a low price amongst other vendors . There are ","useful":0,"cool":0},"20otN7FB-GuWvAksJRfNLQ":{"text":"Agreed with other people this place is a bit of a tourist trap. Lots of jewelry from China","useful":0,"cool":0},"c4vF2HV2M_1IEHg93neZSQ":{"text":"Love the quarter and try to visit as much as I can. Have a timeshare at Chateau Orleans, a","useful":1,"cool":1},"eMb14I0pzbSQkHLrT2_vYA":{"text":"This place has changed so much.  The addition of the upside down oyster bar and other food","useful":0,"cool":0},"KK9SIcPu_mLSWLpqZ6PJ_w":{"text":"This market has it all. Great food, great drinks, and great shopping vendors. I have visit","useful":4,"cool":5},"DP90ZOnSmlzYi9-o_uGEIQ":{"text":"As I was pushing my way through the open-air market, I bought some Cajun spices, and a kin","useful":6,"cool":5},"nVYlJrewcxOIBnmCEPqZlw":{"text":"I have been to quite a few marketplaces in the world and this one ranks among the best. Th","useful":1,"cool":0},"LmRiUCZTDnKmePOgH2Kw8g":{"text":"This is like an open air Flea Market.  Not the place for any high end shopping. Lots of di","useful":1,"cool":1},"yhpsy8sU33F__Sq0aM8tEg":{"text":"Kitschy \"flea market\" in New Orleans, mentioned as a necessary tourist stop in many of the","useful":1,"cool":0},"6qox6h5Sj8RRKgfXF8aD5Q":{"text":"TIP: Do not leave extra time to go through the entire market. The only thing you need to k","useful":4,"cool":1},"r1a7sPU45pHEeMggpQEhjA":{"text":"This reminded me a lot of the Market in Charleston. It's packed to the gills with touristy","useful":0,"cool":1},"217PL2Hk0g_Ah0H_v0odRw":{"text":"The French Market rocks. I could see if you're a local it might get annoying because it's ","useful":18,"cool":16},"-I5oiNhv3-sOD1PeXXZDjQ":{"text":"Cute outdoor covered market. You will find lots of food & drink vendors here but then you ","useful":6,"cool":3},"jtudv1emXoUtgI9vu9Nr3Q":{"text":"I was told I had to come visit the French Market during my Nola visit. There are tons of o","useful":7,"cool":3},"KcC-lVx1TRLStOHStTk1yQ":{"text":"There were a few things I really liked about French Market. They have po boys, gator on a ","useful":1,"cool":0},"C0qoKV7E0sG4NOy7j8u3Vw":{"text":"Lots of vendors selling jewelry, NOLA merchandise and more. The masks  are cheaper here th","useful":2,"cool":2},"RTWIWzazdETLzb1_bu4vBw":{"text":"Vendor 19 - World Famous Nawlins are thieves. 40 minutes wait, got one out of 4 things we ","useful":0,"cool":0},"Vdvn-ai0w6wNstfiAS4InA":{"text":"First thought was that I am going to find a look alike European market where we can buy ch","useful":1,"cool":1},"qlUXMn120yDHmePLofob6g":{"text":"You can walk there from you hotel!! On your way you will pass the riverfront, a park & fam","useful":1,"cool":1},"etgANiS2UgRP51I7bZAeiA":{"text":"What will you find at the French Market? Just about everything under the sun from A-Z.\n\nDo","useful":9,"cool":8},"AS1FyfMGWFq3O2gPa3Cggw":{"text":"Went there on a rainy day to get some relief from the chill.\nProbably the best place for s","useful":3,"cool":3},"Tp2WuMFA0Ir4lkN5Z5uC1Q":{"text":"Definitely one of those tourist experiences. Geared to tourists. \n\nHas a few decent eateri","useful":2,"cool":2},"DwtVPcs1WxWPHpZcU5_tAQ":{"text":"Muy bueno el lugar, 100% recomendable!!\nExcelente atención, probamos el lagarto, muy bien ","useful":0,"cool":0},"WnA6wG2T4eJYHI61PicNSA":{"text":"Support local vendors. There are food and drink stands. Closes at 6PM but some vendors clo","useful":2,"cool":1},"xBH9ECwErOl13JGIy-nNiQ":{"text":"The French Market is a great way to find unique gifts for less.  Many of the vendors here ","useful":2,"cool":2},"zz1VocSIwDwk4cr1qAAFRw":{"text":"Gorgeous place with so much to do. Live music flooded the streets. And open air market was","useful":1,"cool":0},"XGZIdAtw3HyIee1AIBGMNw":{"text":"It's a clean, well maintained and airy market with space for items and food. I wouldn't re","useful":2,"cool":1},"FQKqvPxYj246IobHFrETpQ":{"text":"I look forward to shopping the French Market when we are in new Orleans. The offerings and","useful":4,"cool":4},"OZ95jauODL8f0yvufG6OvA":{"text":"Great touristy spot to visit while in NOLA. A lot of the stuff is overpriced and, unlike m","useful":7,"cool":7},"FKdexP5if6plf8smC8Dluw":{"text":"Food and drink are on point in this market, but you can do without the flea market portion","useful":0,"cool":1},"vmoLurjHdRL7ebBLH8_B6Q":{"text":"My 2 days in nola I visit this market was empty \n2 restaurants open only  some souvenirs s","useful":1,"cool":0},"5do6-LrNrqG0KHvFkjg3qw":{"text":"I'm a sucker for an open-air market, especially when I'm traveling and want a peak into th","useful":3,"cool":2},"3NEvzquGPsSZ9NGyZcL55g":{"text":"As for markets, the French Market is clean and super cute. Just remember to bring cash as ","useful":1,"cool":0},"24-h08PS1e1d2GgONRuU6A":{"text":"The French Market is another place in New Orleans that you must visit and get crossed off ","useful":2,"cool":1},"L9mguBetqHe5EiYvydg-eQ":{"text":"Absolutely a must see if in NOLA. Great little food and drink places and we got the cutest","useful":0,"cool":0},"WOZyFQKbC85Lyuvy__B2SQ":{"text":"This was just weeks before the pandemic and this place was packed to the gills with folks ","useful":3,"cool":2},"AhedN587_3dEP_1j-WRc0g":{"text":"The place for quick food and drinks. We got some crawfish, raw oysters and cold alcohol in","useful":1,"cool":0},"LQU2Hxoc5n_VTCyJUoVZLw":{"text":"Went there through all my teenage years. Haven't been in years. Used to bring out of town ","useful":0,"cool":0},"XiiTaZgyfkJhcFoHJDwkNw":{"text":"I am hoping to be able to return to this market when more things are open. Because of Covi","useful":3,"cool":0},"EYNjFrEU7O_NhjsVxLZo6Q":{"text":"Lots of stuff to do, see, eat and buy here!  A lot of places selling the same items, so ta","useful":2,"cool":2},"o_YIlS9ajOfPxxvJhaHDAA":{"text":"French Market is a definitely  must do when visiting. It is clean prices are fair in my op","useful":0,"cool":0},"2cXpKT0Sw-bdkyh1nrFUFw":{"text":"Popular Tourist attraction in New Orleans.\n\nI heard that this is the oldest market in the ","useful":24,"cool":13},"x-KPp5Jw8PRBEplPcyC60g":{"text":"Located on Peters street this cute outdoor market has everything from New Orleans creole j","useful":3,"cool":3},"tDb0y_hiroTZVkQysNavEA":{"text":"Oops! I arrived at 4:45pm on a Thursday and the vendors were already packing up their boot","useful":61,"cool":52},"OVQg-oBfCh43LzMquI-s-w":{"text":"I could spend days here at the French Market!\nSo much to eat, to see, and to buy!\nBut if y","useful":3,"cool":3},"3bY3YYQcM_hoPKYMb40a2A":{"text":"Loved this spot! My bridesmaids and I checked out the French Market on a Saturday afternoo","useful":5,"cool":5},"bYIJkEKYRAKFXFgOihleSA":{"text":"loved this place! nice big open air marketplace, with lots to see.  when i first walked in","useful":2,"cool":1},"7Qm5HiXXyrjaKa7tMgA-qA":{"text":"You definitely want to make the French Market one of your first stops in New Orleans!!!\n  ","useful":1,"cool":0},"E4JBfW680FIk9Uuo2ZeYdQ":{"text":"Great place to get  few souvenirs for the friends and family at affordable prices. There i","useful":1,"cool":1},"p2oENOGTz5wi3QqaePdFZw":{"text":"Want crap? want a flee market with a lot of junk? want overpriced food and drink? Want a p","useful":0,"cool":0},"a1bPvFPw4YTWiYi42OXaSQ":{"text":"A bunch of kitschy touristy junk. Some solid food thrown in the mix. Fun to wander, but I ","useful":4,"cool":1},"lRZuD4xjJYq7bhppiSagTQ":{"text":"Lots and lots to see. Great place to buy souvenirs and unique gifts. There are a lot of Af","useful":1,"cool":1},"sUGnVkIqy5djZ7svtl6myA":{"text":"It is a place to visit. I was told.  It's an outdoors like market. It is also a tourist tr","useful":30,"cool":24},"X3ZIv-5rRE_kYJK3m7SPdg":{"text":"I enjoyed our walk through here on both days. Some cool stuff and some good prices so we'l","useful":1,"cool":2},"HRZhsf1TqeEiIE9zoRBR7A":{"text":"Eh - this place used to be interesting, but now it is like a tiny, cheesy flea market sell","useful":0,"cool":0},"KqkgUKWiVtB_pcBcsppGoQ":{"text":"Great place to hunt for cheap souvenirs -- but seriously, most lower-end sellers all had t","useful":2,"cool":0},"Ni5Bw5AJLzKdATPk5pl_xw":{"text":"French Market, you have a place in my heart. Covered for when it rains, filled with food a","useful":3,"cool":2},"rCdFMBi69bL5BwWJPYwgSg":{"text":"I really enjoyed coming to the French Market! It's a great activity to do when the weather","useful":7,"cool":6},"sjI_5fLMvx2ByBeHHt5gtw":{"text":"I came here for the snowballs, but I got a lot more! From fresh organic juices to infused ","useful":3,"cool":3},"_elERnI2F5iyihQeYNa_Ew":{"text":"There are parts of the French Market that are fun and fantastic. Those are the local artis","useful":8,"cool":7},"iQs-XEnM9Ov2VqinUJcy4g":{"text":"I really had to exercise self control when I visit this place! Lol It was probably one of ","useful":1,"cool":2},"_0i04O1-Gnu8SgqlxaQ6KA":{"text":"Yay!\n\nI love going to markets in every city. I feel like you get a sense of the people and","useful":1,"cool":0},"GSvT2qagxPMU-t6wUtLC5w":{"text":"Ha!  After reading the other reviews, I had to laugh... a vendor snapped at my girlfriend ","useful":0,"cool":1},"24O252ghzaNGV_ZcAqcxyw":{"text":"I had my \"Chef\" moment, walking through the French Market eating beignets from Cafe Du Mon","useful":14,"cool":14},"AV6i6SPcO7ORfZpgcox-Yg":{"text":"This is located near the end of the French Quarter.  They have many vendors selling foods ","useful":2,"cool":1},"u4yFb03coqbTJd9GrVVI9Q":{"text":"Great place to check out in the French Quarters. They have cool items that they sell and d","useful":3,"cool":1},"K4l7El7Yq8eHDTl355Nocw":{"text":"Oh man! What discoveries can be made à pied! Had no idea this place was even back of all t","useful":1,"cool":1},"jFlZe3JmuvWIo47tB3vuhA":{"text":"We came here for dinner and wanted a crawfish boil...and that's what we did!\n\nThe crawfish","useful":4,"cool":1},"6vy0w8hCEWZiT6wZVGWomw":{"text":"We didn't buy anything from the vendors, other than the food. I tried gator on a stick for","useful":4,"cool":2},"FWrgsiL7os348RpnsFg--w":{"text":"A must do when in the French quarter.  Always neat things to see. Great priced souvenirs, ","useful":2,"cool":3},"WM9yTuocdVClBy9gwRh8Gw":{"text":"Always a great time to visit and see local talent. When in the area, stop by, it's a must.","useful":1,"cool":1},"1nw__g77GHw-e2SF2Zl6bg":{"text":"We have a market in Charleston and it's very similar to this one, maybe even a bit better.","useful":0,"cool":0},"oxUqCWfkP7BTdSmBJxBKPw":{"text":"Incredible food, beautiful handmade crafts and kitschy souvenirs - a little bit of everyth","useful":7,"cool":3},"c3KnXz6OZ3kyBhL88jUw_w":{"text":"It was our first time to NOLA so we had to at least go and see this French Market place si","useful":3,"cool":1},"7U2gnLXM0E9UYgX40iy2Fw":{"text":"~~~French Market~~~\n\n3.5 stars\n\nGator on a stick for $5.50?? Oh Hell Yaya!! I've had gator","useful":20,"cool":18},"O0De-dS0BmMPL5wFtJdvbQ":{"text":"Really loved this open air farmer's market.\n\nA popular destination in NOLA for sure. Don't","useful":8,"cool":8},"cFvxcqfjaM0ai8IFjOHodA":{"text":"We arrived with a list of recommendations to try, especially the shaved ice which was desc","useful":1,"cool":1},"3IYyliJVXcbKLkkLytnL1A":{"text":"Came to French market because I heard from friends that it was a cool place to visit while","useful":3,"cool":0},"3bbvtHdqH56lb_YSGV6dsA":{"text":"SO this place was ok. Felt like it was kinda loud, but college football was on and the fan","useful":1,"cool":1},"qqjkTUDLiiDH7nlFSbORLA":{"text":"I've read through some reviews and apparently people aren't aware of what the French Marke","useful":3,"cool":0}}