{"EXFQBlgv1AkPd9EY_86Cqg":{"text":"Great little bar right off Bourbon Street. Truthfully, we met one of their bartenders, Mon","useful":0,"cool":0},"nEsigGImb_eft2AgfehVCQ":{"text":"The service is amazing at this restaurant. When you're on Bourbon Street I can't recommend","useful":0,"cool":0},"E5pknqCxKN8SEIL1BFRvOg":{"text":"WORST experience in New Orleans. Waitress was rude and invited my party of three to leave,","useful":1,"cool":0},"Y-ZsQbMEIn_TekUc9bNs5A":{"text":"Where French Quarter bartenders go after work, not a bad place to get absolutely hammered ","useful":0,"cool":1},"J3N_lftrX7GE2JmzMgpw0g":{"text":"Very disappointed. Great location. Average food. Service was the worst we've experienced i","useful":0,"cool":0},"P49J_mk-wK1LQ3DvaLtklw":{"text":"Why the 4 Star review for a dive bar on Bourbon St in French Quarter?  Because it's a dive","useful":1,"cool":0},"W2ygacyzQ-j6vnXInXyaFQ":{"text":"Food was great and the bartender was amazing. We stood at the host stand for a good 10 min","useful":0,"cool":0},"veebIvlLluik-dSqEaM2bw":{"text":"Totally friendly place. The service was superb. A great place to eat on Bourbon St. And ve","useful":0,"cool":0},"sVeTxgDixk7frMXULdNqDQ":{"text":"Not bad but definitely a 1 timer only.  My lemonade was wayyyyy too sweet and the crab cak","useful":0,"cool":0},"FIz4OG3QfOmqK79YLETSTA":{"text":"After the horrid experience at Pere Antoine (see review) we settled for a quick bite at th","useful":0,"cool":0},"H6N9-FQc0AEBPu5Vqw69dQ":{"text":"THOSE WINGS. Wow. Juicy and just hot enough and so freaking delicious. \nBourbon Street, if","useful":1,"cool":1},"onI-bhJ70CuvXZbPqs_3FA":{"text":"Great view with homemade southern food.\n\nWe stopped in here for some much needed grub and ","useful":2,"cool":0},"8SzcPrat31qbrnfjtJuOYQ":{"text":"The food was bland and quite horrible to be honest. This is the first bad review I've  eve","useful":0,"cool":0},"IjjE0fxn_o23S9TWPhkiHQ":{"text":"Arrived just five minutes before the kitchen closed.  Got Po-boys (Catfish or Shrimp) and ","useful":0,"cool":0},"tRHM83YViaWY_mq7FiXDNA":{"text":"We were eager to find a hambugar joint for our daughter. We went in because of the nice ma","useful":2,"cool":0},"7c2UokhbrJ5QVGUoomBegA":{"text":"Great bloody mary with picked okra, very good. We've had a few in New Orleans, best so far","useful":0,"cool":0},"MJYRi_k1M_DFkK9h4HuTQQ":{"text":"Your neighborhood bar in the heart of the French Quarter. Great bartenders ( say hi to Luc","useful":0,"cool":0},"-ErFgPVJMhw-DxFNLMAxQw":{"text":"What can I say, there really is nothing special about this place.  It is a dive bar in the","useful":1,"cool":1},"fCCkBTgRH1EP3ImA9rBt4g":{"text":"Stopped in for lunch and had a very good burger.  Was able to sit outside on the balcony r","useful":0,"cool":0},"yTKYvQtfpWmi1q67nmvEmQ":{"text":"Sat on the balcony and had an awesome oyster poboy!! Donna was great and food was awesome.","useful":0,"cool":0},"jr9uKEF6fAlL_GSqWVRq_Q":{"text":"DO NOT, I repeat do not eat here! Terrible service and even worse food. We didn't even eat","useful":1,"cool":0},"vxAABAs1HWlGgWxSUjw2Hg":{"text":"The bartenders are nice, the Bloody Marys are intense, and the place has a very dive-y fee","useful":0,"cool":0},"oujSfReD2sD5rGzEXiq85g":{"text":"This place does not allow any outside drinks so we all had to throw away everything in our","useful":0,"cool":0},"SfqmxE_1m0grx4lyNz06lQ":{"text":"I love this bar after hours specially... Low key, unpretentious, plus Kevin is an amazing ","useful":0,"cool":0},"HHtbf7ukozO3g9QZq_GiBQ":{"text":"There are so many options on Bourbon street, how can you pick the right one?! I came to Lo","useful":0,"cool":0},"Qk4qUxf8alwDou1YjiwZpg":{"text":"Slow service. Because we split the check at the table they added the gratuity but did not ","useful":0,"cool":0},"cVrbmraJ9pQ0zL2c5mCUoQ":{"text":"Everything was well prepared, service was good, seating was great!!  The food needed way m","useful":0,"cool":0},"4mFhi8hOm2_shn3gG0Eg5A":{"text":"Fantastic service with loads of fun. Server Marcus was fantastic. We had a blast looking o","useful":0,"cool":0},"MpCMrscwJauThB7Hyje-1w":{"text":"On Bourbon Street....but not really.  So small you would miss it, which makes it perfect f","useful":0,"cool":0},"DW8-64z6-3fvvfdJTqw3MA":{"text":"We had already eaten and my wife wanted some chocolate cake. As we were walking by, the ge","useful":1,"cool":0},"AvGvsMtkq-hsT6IOHsRZeQ":{"text":"We came here on the recommendation of the bartender from Johnny White's sports bar and we ","useful":0,"cool":0},"aGUVU-wD1TLEAY8yTzf4JQ":{"text":"Was so disappointed here after being highly recommended by our super kick ass tour guide f","useful":0,"cool":0},"S9jl_DLOs4OtJpG1-fRH1g":{"text":"Oh my heavens. This place is.. Ok.. I mean it's ok if you are already drunk and don't care","useful":0,"cool":0},"H3n3IGPCyuEwVYYJDEwTdg":{"text":"I've ONLY had Bloody Mary's here. My beau and I stayed at the Bourbon Orleans in one of th","useful":0,"cool":0},"a_tt2C4uO5O8vqVGPOltHA":{"text":"I wanted to give this place 5 stars. I really didn't we came here twice on our 6 day NOLA ","useful":0,"cool":0},"y9Pr9nPHSCt1jxqkPyD8qw":{"text":"I had the New Orleans burger (the one with mushrooms and onions) and it was probably the b","useful":0,"cool":0},"is73Vvs4G0C4QVnuBkM3Yw":{"text":"Got a bloody mary here with a sweet pickle and a green bean. Was unfortunately kind of wat","useful":0,"cool":0},"u6iULWEwUIP6acrSgaozKw":{"text":"Terrible service if you can even call it that the lady brought us our drinks and food no r","useful":0,"cool":0},"q6G0GlNaugQOoPYOg8Q3Yg":{"text":"Terrible service. The food made me really sick. We had to wait 15 minutes just for our ser","useful":1,"cool":0},"WNK1LulptHZAp9lMDKbgbA":{"text":"Stopped in around 8 or so for a snack and a couple drinks. Loved sitting on the balcany wa","useful":0,"cool":0},"m98gPfrxIu_so6VfNDZ9Ig":{"text":"This bar rocks!!! \nI was in NOLA for a convention, looked for a sports bar to watch the St","useful":2,"cool":0},"wj5a5A1HsvC73q4mTDQlgw":{"text":"First some confusion about Johnny's Whites. The Corner Bar and the Grill are connected, bu","useful":0,"cool":1},"d4t2Z8ooFhZYWrrv19GeIA":{"text":"Intentionally misleading signs for $5 drinks. They ended charging us $11 each for Irish co","useful":0,"cool":0},"dyXQ05PImHUr808kfu-gPg":{"text":"Nice place.. we stopped here in our last hour in New Orleans.  \n\nOur waitress Kiersten was","useful":0,"cool":2},"L0Xj59Ap6f8EzSU8-JRznw":{"text":"Redskins Haven, Abita on tap, Maker's shots, what more can you say?  If the men's room had","useful":0,"cool":0},"8us7n_mwrIg9ekbfYQMDXQ":{"text":"We decided to dodge the hustle of Bourbon Street here, and were seated on the balcony for ","useful":0,"cool":0},"gILDAYPZySnL-JcZ4djjkA":{"text":"First & foremost, the owner is from Hawaii. That alone can account for 3 stars. I don't kn","useful":0,"cool":1},"WNzgGRHPiVVhI0IjKzT4MA":{"text":"Worst service ever!! Waited for drinks and service for 30 minutes. We moved to a table clo","useful":0,"cool":0},"5qoS_EhWE8xUsK3Uaapn6A":{"text":"Horrible service. Not busy and still took 20 minutes to get out other in. People sat way a","useful":1,"cool":0},"jqBSqUZ7LR-imxriMsCKRA":{"text":"Food was decent. Service was terrible. Rude and hardly checked on us; it wasn't busy. Adde","useful":0,"cool":0},"mcdk106SiUC8b4hnYZQAzA":{"text":"Man, this could be my favorite dive bar of all time.  I found this from an online review m","useful":1,"cool":3},"OgeHlV_7eN_f5qxSamUA_Q":{"text":"The server forgot my order and played it off like I hadn't ordered at all. She came back a","useful":0,"cool":0},"l6FbujMsqMBt2ykUjPI3Aw":{"text":"We had the crab cakes and Po - boys dinner.  Both medicore. \nService was terrible and wait","useful":1,"cool":1},"E4yp3ubfhsDptpdSBKRWqQ":{"text":"This place was a Nightmare!!!! To begin, we were seated by a woman with a hard frown, and ","useful":1,"cool":0},"yf53-b56X_SktqCRpu-5yg":{"text":"Grabbed lunch here after being waved in by their ambassador on the street.  Had shrimp cre","useful":1,"cool":1},"vIkYUUIJjtki4GzQkQSkgA":{"text":"Underwhelming. Staff didn't seem too thrilled to be there. Fantastic location - should be ","useful":0,"cool":0},"bu6GXk5HP3cx9afM-ANO4w":{"text":"Trust your instincts and stay away from most of the Bourbon St places.  Our friend just ar","useful":1,"cool":0},"Cm6w6x73ebkDVDB4eF9h-Q":{"text":"Drink here, eat somewhere else. The place gets really crowded and is not really conducive ","useful":2,"cool":0},"mdIZdRuslzDoYL3e0Usxxw":{"text":"Zero stars would be more appropriate. The server was rude, we had to ask twice for our dri","useful":1,"cool":0},"ICKelazVOY6wFF5MVnJ5MA":{"text":"The food here was mediocre at best. My dad got gumbo and it was not chunky. It looked like","useful":0,"cool":0},"284n3yAgS8J2WoyFewR-hw":{"text":"This place has terrible drinks, bad service, and mediocre food.  There are so many better ","useful":0,"cool":0},"Pbnq1GifllQZaDWCCbZ0zQ":{"text":"This place sucks! My first New Orleans food experience and it was dismal.\nFood is overly s","useful":1,"cool":0},"v_O9vKpPU_PGMN5ZwdtFtw":{"text":"Terrible! Awful service- waitress left us sitting for over 20 minutes and when I went to f","useful":2,"cool":0},"pCfLRTVe1f5Hs5Y0KUNdhw":{"text":"Not bad. Extremely slow service. Foods not bad from what I had. I had the chicken wings wh","useful":0,"cool":0},"LRsatzRt6Nz19PYSjDi0Zw":{"text":"Excellent BBQ shrimp, gumbo and étouffée! Despite being on Bourbon street the food is actu","useful":0,"cool":0},"4usJwPoCHhGgVoLmqGL8QA":{"text":"The food was great. The service was the worst EVER!!! No napkins, refills took too long, o","useful":1,"cool":0},"wNBFKGJ4IzNey9Uh4Y3LgQ":{"text":"My favorite place to stop on Bourbon! Great beer choices, knowledgable bartenders, not too","useful":0,"cool":0},"pOWbV2Y_02TxORxGR_jdEQ":{"text":"AVOID!! So Many Better Places! Find One!! You're very lucky if you get a waitress that doe","useful":0,"cool":0},"6z15wmfLyB6rER6_xqtwww":{"text":"Went upstairs to eat. First of all the food was pretty good. Even considering they put the","useful":1,"cool":0},"SIVdNlthwUG5Ix9sqTgxwA":{"text":"We had a balcony table on Saturday night.  Great service and really good food.  The burger","useful":0,"cool":0},"D2hiMN7FvXv4z3idBypxnw":{"text":"We have been roadtripping for 6 weeks in usa and this dinner was absolutely the worst on t","useful":1,"cool":0},"rn0npinNIIfJnDeGBA0DkA":{"text":"Scored amazing balcony seats during Mardi Gras while having lunch at this restaurant. The ","useful":0,"cool":0},"cPZcla9tDp1JLhGgBzDbng":{"text":"how about negative 50 stars???  it was Saturday October 29th, my wife was hungry after wal","useful":3,"cool":0},"hpemqlvBpOcnZm2qun6SAg":{"text":"This is the place to eat casual food on Bourbon Street and probably one of the few places ","useful":0,"cool":0},"aXXy1qXKlIFQCsNyLfA7dA":{"text":"I wish I could give it no stars! Bad service. Bad food. Cold food. Automatic gratuity on p","useful":1,"cool":0},"YJws7MWfVWo37y1nmVQG-w":{"text":"This is a regular spot for my friends and family every time we come to NOLA. Last time we ","useful":0,"cool":0},"ZihYN77AJyuO4_XfJNEY_w":{"text":"During my recent Bourbon Street travels, I saw a sign outside this place offering up $5 Bl","useful":1,"cool":0},"0nqTXCQghzczTWxyHmGIMA":{"text":"Sat there for 15 minutes and never got helped. All the waitresses were just standing at th","useful":1,"cool":0},"_hDePn2AedJqWDHSZKSo2g":{"text":"Went during an off time I guess. Only two other people inside. Pretty standard dive bar. D","useful":0,"cool":0},"qDuOpOrENsruO5Ejs52Ijw":{"text":"Overpriced for food that's just ok. The guy at the entrance was hilarious but the service ","useful":0,"cool":0},"Nny1gPue7Uxf5HpOYubn3A":{"text":"Horrible took my wife to eat and were seated right away. However, after 10 minutes we watc","useful":0,"cool":0},"V5BI_OufrWxT4rrF8N-YuA":{"text":"Cool spot to sit on the balcony on Bourbon St. and people watch. That's the best thing abo","useful":0,"cool":0},"tZRUixDV5X1TO2rrs37rfg":{"text":"I went to eat at johnny whites recently when their very enthusiastic barker lured me in. W","useful":0,"cool":1},"JZFz3pCYsh1zfNWQkMs3BQ":{"text":"We stopped in here on the same day that we had a cooking class and sampling of food from t","useful":1,"cool":0},"ZMvqaU2EJqtpOJsMI5esfw":{"text":"The gumbo was cold ... Had some sort of shell or rock in it people weren't busy so I didn'","useful":1,"cool":0},"P57Tyb4xtvXXGucQ-B8a6A":{"text":"This review is only for the Pub portion, not the restaurant portion of the place.  This is","useful":0,"cool":0},"aWSdwal-uLWyjNnImiJwGw":{"text":"We had come across this place and the lure of balcony dining brought us in. The view was g","useful":0,"cool":0},"0bvKFykVdpXimCs3s9xtFA":{"text":"Fun place...just go upstairs & you will have the best view ever of Bourbon Street.\nSuper n","useful":0,"cool":0},"m0XErnZSMmPmcc-SPHcb_w":{"text":"I am not one to write restaurant reviews, so the fact that I am now should speak volumes o","useful":2,"cool":0},"LR8G1h5Lm-2HNckfKuZTNA":{"text":"Really really bad- do not go here if you want to be treated like a person. Confrontational","useful":0,"cool":0},"kcgvmrawDZO6Q6vxG3C3qQ":{"text":"Two stars is daring. I got a catfish poboy and it was extremely fishy and not fresh. The f","useful":0,"cool":0},"G3reAdYR32k1ro_8QPalCw":{"text":"this place was a chill little spot that i don't remember much of thanks to the wonderful c","useful":0,"cool":1},"gqWSgH-JYJi90iYqboUgtg":{"text":"Our first day in New Orleans, it was cold and dreary. We were walking up Bourbon Street lo","useful":1,"cool":0},"YZOuUXymGlg3f1L2phQ8IQ":{"text":"Server told us we were being too loud when eating dinner at 10pm on the balcony.Seriously ","useful":0,"cool":0},"oiAq8p_iVwCygDMxr_B-oQ":{"text":"So, this place isn't anything special at all, but I'm giving it 4 stars due to its balcony","useful":0,"cool":0},"ilxX15jK_Hu6hmxmLJFrDA":{"text":"Food was decent. View was great. Drinks, thankfully, were strong. Service was awful. It to","useful":1,"cool":0},"slIqLzrXDNIKhZeSkcKsAw":{"text":"Redskins bar, in the French quarter. Nice to hang out and have a beer. Great selections of","useful":1,"cool":0},"BOlU2gHQZBMQtEkISwrlOw":{"text":"just came back from mardi gras.  now ive been to many a dive but Johnny White's come on gu","useful":1,"cool":1},"o6uY6hOgmWJ_4dbLrwiV5w":{"text":"We come to new orleans for the great food and hospitality, this place neither had good foo","useful":0,"cool":0},"JWol_M3XYd7x5nfA369bRw":{"text":"2 words for you - skunky catfish.  Nuff said.","useful":0,"cool":0},"c3ie6JzdSeqzNSvbE3ZZ-w":{"text":"EAT HERE!!! - Best shrimp creole that I've had.  Looked at several restaurants here before","useful":0,"cool":0},"H-yrmyXRW6EgNVbFdOSkOg":{"text":"Awful. After waiting several minutes for our server, he took our drink order. He came back","useful":0,"cool":0},"_E02N4k-DHqblU27xXQ5dA":{"text":"Only been here for a few quick beers.  Didn't eat any food.\n\nAt the time was filled with g","useful":0,"cool":0},"L1CrH95_uZ8z98CpbkMZ8w":{"text":"This place is the reason i created a yelp account. To begin with, the waiter was incredibl","useful":1,"cool":0},"3ruEY_q30CGDZQmT_WpgUw":{"text":"Service was terrible. We got to sit on the balcony which had a great view of bourbon stree","useful":0,"cool":0},"ILMB64IjdBIgCGRP2HoAcg":{"text":"We ordered the jambalaya and burbon hot wings along with a hurricane and Long Island ice t","useful":1,"cool":0},"RseR2WeBzMDtjaVyF3lfhQ":{"text":"Two words:  BLOODY MARY!!!!  They put tabasco, celery salt, worcestershire sauce, horserad","useful":3,"cool":0},"QsKMgwOvBO1ONIApU63BjQ":{"text":"Listen to the music coming from across the street and get the shrimp creole!! Great place ","useful":0,"cool":0},"eu6-k0cWKP1OI941jfAgfw":{"text":"Food poisoning from the BBQ shrimp.  Family liked the gumbo, but not worth it.  Service in","useful":1,"cool":0},"gX1yDYwmxubrJowOJSmmjQ":{"text":"Okay, I am in LOVE with the food here. You have to take a small hike up to the patio area ","useful":0,"cool":0},"-A-pgHuPvbKySOrDfUFY4g":{"text":"We stopped for dinner because the guy outside encouraged us to come in and the menu looked","useful":1,"cool":0},"J6sh2ipxbd_LNvYgYeRfDQ":{"text":"Tale of two tales. My wife LOVED her pasta, but I was disappointed with the gumbo. \n\nThe s","useful":2,"cool":0},"wGg4KW07y60xFIupQCDeLw":{"text":"This place was gross. It was really disgusting, actually. My burger wasn't even cooked, at","useful":2,"cool":0},"aqgvPfuPSxg9LpwFuyXlYw":{"text":"The Mardi gras pasta was delicious I devoured it. Server Mikerri was awesome! Sausage po b","useful":0,"cool":0},"GRA5_-mAQEtcswC5_i6Z7A":{"text":"My friends and I came in here to eat instead of drink. We had done plenty of that already ","useful":0,"cool":0},"WJMiWdFyDZB_dZb2JQ8RHw":{"text":"After years of happily drinking at the bar downstairs, I was finally prompted to try the r","useful":2,"cool":0},"sizNaLdMLO_m7Y06Ov6lnw":{"text":"Food was ok, drinks were not good and I had a margarita and had little to no alchohol in t","useful":0,"cool":0},"f8jRUOmiwwwmSlNnfXNIYg":{"text":"I have never dealt with such rude staff in my life! I never received such un-welcoming ser","useful":1,"cool":0},"888DdD98jMGTIHAmqtnzQQ":{"text":"Pretty much, I would give this place 3-stars.  The extra star is for the dining balconies ","useful":1,"cool":0},"HCexj3qPrIR8wmlK1aK7cA":{"text":"The place was awesome! Amazing views of bourbon st! Our waitress Susan was sooo sweet and ","useful":0,"cool":0},"uIzNstbbhByok-cnXBtOOw":{"text":"Food was great, I had the red beans and rice. But the service was not that good. I think t","useful":0,"cool":0},"ucRuIX1xVJ3Vfc800sZQMw":{"text":"Good food, good service, great location! We were here on Saturday of Mardi gras weekend, s","useful":0,"cool":0},"VW3Jojoczm3Hv5F21RHPag":{"text":"Please, don't go to this place. Worst food ever. Nothing \"creole\" or \"cajun\". Po' boys wer","useful":3,"cool":1},"-0xdOPL_JoRcT53GLsI40g":{"text":"Terrible service. Our waitress, Lemisa, was the most unfriendly and unwelcoming person I'v","useful":0,"cool":0},"H4WmrpxABne17kzl7js-GA":{"text":"Wow, what a let down. Our experience started with a server that seemed angry to be working","useful":1,"cool":0},"fubyM2dW7Nq3JaEPdsMWIw":{"text":"If you go to the Johnny White's on the corner of Orleans and Bourbon, for the love of God,","useful":0,"cool":0},"Z8FiLstA0FHpyUwqTxYFaA":{"text":"The food was good.  I tried my husbands half and half burger I believe it was called. It w","useful":0,"cool":0},"rnd99N1-RMepV3GCUR3WGw":{"text":"Great tasty creole food. Sat on balcony listening to music from the other Establishments o","useful":0,"cool":0},"PZEavwKttB6-k9_N6XBTiQ":{"text":"The service here is quite poor. The guy that solicited us off the street did more for us t","useful":0,"cool":0},"4YVgqeQlw301XXXmWoOWTg":{"text":"The only place I regretted eating at while on vacation to NOLA. It was late and we just ar","useful":0,"cool":0},"T1xY6229V8OyOOKrSh4-7w":{"text":"I originally wanted to have lunch with my parents, but the first impressions from the two ","useful":0,"cool":0},"vT1QSHMvyApojS9oeV8DJw":{"text":"Great service. Cheap beer and no bourbon street BS. Ask for Mike. Never eaten here, but be","useful":0,"cool":0},"kQZSujz4bieFHw0u9m_qog":{"text":"Really bad service. Words can't describe how terrible it really was. Food was awful. They ","useful":0,"cool":0},"j31-b1j3afKrPD__rQY67g":{"text":"This restaurant is extremely bad. I'm giving it one star for the balcony seating. We waite","useful":0,"cool":0},"FEjHbwIPZV3p-ef9y1QNSw":{"text":"I'm giving it 5 starts because I loved the customer service. My server was amazing and mad","useful":0,"cool":1},"pEN8dYHJAlve53ClRE9Kvw":{"text":"We decided to go upstairs and grab a drink during French Quarter Fest. The idea was to sit","useful":6,"cool":0},"KN-WGRODeXPzpq4AKMp8jg":{"text":"Looking at the picture in it's entirety, this place is kind of a miss, but if you're lucky","useful":7,"cool":2},"AvnzyYM1_1O8V-yQOFZUFg":{"text":"The food was really awful. My shrimp PoorBoy was soggy and inedible. My buddy's Jambalaya ","useful":0,"cool":0},"ayUxxn_7mJHEdW9x8noDQA":{"text":"Came in solely because it wasn't packed. The food was pretty good and we got seated quickl","useful":0,"cool":0},"5G8kRhwFSd-Bvf2dp2EEjg":{"text":"The worst service you'll ever come across in New Orleans! They include the gratuity in the","useful":0,"cool":0},"ie3ajMxn2mUsqLnqnUeQug":{"text":"Excellent food and service. Everyone was so helpful and friendly. Quick note you can smoke","useful":0,"cool":1},"DPs3Qp5MJUiDxpvkzORR2g":{"text":"Bad service, put us inside when the put a table of 5 on the balcony a couple minutes later","useful":0,"cool":0},"QRtDIJbGUNbh20ELzPFAxA":{"text":"Food is great.  The bartender is great.   The hostess is some sort of militant black activ","useful":1,"cool":0},"YMN-OOSQgyhoHcdnJYEXtA":{"text":"The service was great and so was the food.  They call it a hole in the wall and it really ","useful":0,"cool":0},"_OERuCbgIKB5UHOputklcw":{"text":"Came with a good appetite, the balcony was full on the bourbon street side, so we were sea","useful":0,"cool":0},"3Ed8PauF3j34tCMxGVmrfQ":{"text":"Plain and simple: MEDIOCRE AT BEST. \n\nBurgers and small, servers are rude and entitled. 20","useful":1,"cool":0},"TwRUZ6Mrlv6nTd5Lm_u36w":{"text":"My burger and bun was so over cooked it tasted like they put a flat piece of charcoal on m","useful":0,"cool":0},"y7DIzuXun9HRb4ZCS73SFQ":{"text":"Slow service, she was nice. A wrong dish. Seafood jambalaya was good, as was the strip ste","useful":0,"cool":0},"dZSMngDH7qhjCj6hfYgJhQ":{"text":"We had an excellent waiter and service. Thank you, Marcus. The food was fantastic and much","useful":1,"cool":1},"WrI3pRK65fcsxg_pWQvdHw":{"text":"Really long wait but Pat went above and beyond to make sure our large group was taken care","useful":0,"cool":0},"-TM2LRLb8mDN3MLfgMFVRQ":{"text":"I'd give this place negative stars if possible. Our server was the rudest I've ever encoun","useful":0,"cool":0},"8NbpcjufeCFIz34Rg1uDhg":{"text":"Food was good...not great. Service leaves much to be desired. Waitress and hostess staff s","useful":1,"cool":0},"fXo5PfzbYl3QcJbX0JJD4Q":{"text":"Great service. Cheap beer and no bourbon street BS. Ask for Mike or Stephanie. \nA Hidden g","useful":0,"cool":0},"ldJGqcB9kmRX7i0VFFmq5A":{"text":"Hubby and I have been visiting NOLA for Jazzfest for the last 10 years. Let me preface thi","useful":0,"cool":0},"-J4JbdFCB91gWEMZ8KPmSQ":{"text":"I'm here with friends  for Essencefest 2019... Stopped in because we were hungry and tired","useful":1,"cool":1},"maQy06WQ0FffpauvnDSjIA":{"text":"Food is typical fried bar food. But it's a great place for people watching on the balcony.","useful":2,"cool":0},"YOhqJfGFAYnv9DqH8dv5Aw":{"text":"I was visiting from out of town for a wedding weekend when we stumbled upon this place(lit","useful":0,"cool":0},"9mDsOdAlG_vJLUhKQf1C8g":{"text":"A great pub!!! Tony the bartender is amazing!!! Makes everyone feel like a local! Very div","useful":0,"cool":0},"oDFyhN3kIP7lppRYe-AaAA":{"text":"Literally some of the worst food you'll eat in New Orleans, its a damn shame. Marcus, one ","useful":0,"cool":0},"hqfRZuiBHdyVlliYwxjJWw":{"text":"This review has two caveats:  My wife liked the hamburger she ordered and I did not compla","useful":1,"cool":0},"4338cQ-bx-O7-L5r8PTO1w":{"text":"After a really long day we were really hungry and saw the man outside with a menu, who lur","useful":1,"cool":0},"z2eOeoa9AKo_YtHx8JLfrQ":{"text":"Family had dinner there, ordered a beer, food was great and quick but waited 15 minutes fo","useful":0,"cool":0},"TkbqZ7MpO_-Z_DKd-RRwJg":{"text":"Johnny's was the only place we found with a quiet balcony near Bourbon St. \nBar stays open","useful":1,"cool":1},"2CM2Lz0AAuA0wQJrgkZ8ow":{"text":"Had the Jambalaya and crab cake and it was awesome.. not expensive and worth the money.. w","useful":0,"cool":0},"6HWMgjXLLZBRNbjuRAfMnA":{"text":"Great burger....weird I know! Balcony seating nice. Middle of action, but not too crazy. T","useful":1,"cool":0},"W0zqWJc8Lsb3ResrSetcyw":{"text":"Never Fails. \n\nWe enjoyed the balcony.\nWe enjoyed the service. Shoutout to Shelley!\nWe enj","useful":1,"cool":2},"fE-aylcLoOpWL7aKxmwMKg":{"text":"Burger was average. BUT the crab cake was fantastic!!! It was moist, light and full of fla","useful":0,"cool":0},"gmgtjQGDvqLiWHMwMIL5LA":{"text":"Cool upstairs seating overlooking Bourbon Street.  The food was not great. Shrimp had a ST","useful":0,"cool":0},"NAeQ8BbstZEYKEj3s2HMvQ":{"text":"Good location and the balcony seating outside is great for people watching and getting out","useful":1,"cool":0},"o3C3zMDr_hxoYvbQgF7DiA":{"text":"Worst dining experience ever. Only reason we went here is because they have patio balcony ","useful":0,"cool":0},"TLKwn_AhBBVvN8WFbKEQtQ":{"text":"Thank you, thank you, thank you, to Tony - the sweet bartender who totally redeemed this p","useful":0,"cool":2},"mLO6uPZ6eQppz3JNMpsecA":{"text":"Random find given that we had to find a place that also serves vegetarian options other th","useful":1,"cool":0},"yqKG5vhAb9Aefp9_Sv4rbQ":{"text":"Wonderful food, horrible service! We went in around 7:00pm and there were about 6 other pe","useful":0,"cool":0},"WD0ey8PfiLxEvmWsviWywA":{"text":"First place we stopped for lunch on Friday. At this time Bourbon street isn't too bad, so ","useful":1,"cool":0},"jyx6l0LtuFKPAJEjZvmZkQ":{"text":"Service was absolutely terrible - I think our server would have rather had a root canal th","useful":0,"cool":0},"LWqATFY5CvcD8ca2SWcWog":{"text":"Oh my lord. Since the remodel they have had a change in management and the staff are terri","useful":1,"cool":1},"-YRfdmrinnr-xc5LF8TNJA":{"text":"Definitely a little hole in the wall! \nI normally do not leave reviews but this place has ","useful":0,"cool":0},"YUhSroY8jsd09v43z_zs0w":{"text":"I am a Bloody Mary snob, and I blame New Orleans. \n\nI don't know if it's the spicy bean, i","useful":10,"cool":10},"tV0vW-c7v5WJL8E3HYgHaw":{"text":"Waited an hour for food on a Thursday night. He asked how the food was, I said ehhhh, he s","useful":0,"cool":0},"Q_g5Hj8YwsepodLapoQqOg":{"text":"The location was nice and there was live music across  the street we enjoyed. We were able","useful":1,"cool":0},"0zwfPI_MudIPgt_aG-NoZg":{"text":"I dont remember a whole lot from my night on Bourbon Street. But one thing thats still on ","useful":0,"cool":0},"JXNdwUaT6KUqyzYpo1Jbdg":{"text":"We went here in the middle of Mardi Gras and it was packed and we still got great food, dr","useful":0,"cool":0},"tJaqyrFzk_NEVaaKsymHkA":{"text":"In a city of great food, Johnny White's is a complete joke. The food takes FOREVER and it ","useful":1,"cool":0},"kaIxF00O--keFrt47U_JHg":{"text":"Food was overpriced.  Service was slow.  Only one cook on a saturday night on pride weeken","useful":0,"cool":0},"xTGFif4iZ-26m-iRFF_DHQ":{"text":"One star for balcony seating and that's all. The server was rude from the moment we sat do","useful":0,"cool":0},"_jTqQfC-OMT8V5jdRy-I8Q":{"text":"This place is horrible!!!  Do not eat here!  I got drug in because it's the place they fil","useful":0,"cool":0},"U6AALP7efLBOCMYed-H9Sw":{"text":"Stopped in here for a quick bite with friends after checking out a few other places that w","useful":0,"cool":0},"LeQ7suiZQSRsKe20GbnEFA":{"text":"If you automatically charge a gratuity to every bill, then you do not trust your staff to ","useful":5,"cool":2},"oegh1HvnHXimrRqWXVJhwQ":{"text":"Rude waiter.  We left before ordering.   Was not on a busy day...He was just very unpleasa","useful":0,"cool":0},"2z_nK_tq3n777HhGWHPd3g":{"text":"We needed a low key sports bar to watch the LSU vs GA game and stumbled in here because th","useful":2,"cool":0},"dz3yEF2AKkRBzzzS6gHF6A":{"text":"Great food terrible service, the waitress wwe had was horrible I made sure to tip her abov","useful":0,"cool":0},"wGecwVK_8g_NKlCDw5sAAw":{"text":"Yet another great experience in the French Quarter!!\nWe went in for a late lunch because t","useful":0,"cool":2},"B18iXvX9FL3kvs61rd_tMA":{"text":"An average dive, with Excellent tater tots!\n----\nThis place, like most Bourbon street plac","useful":3,"cool":2},"gbaZ-yw4c2dGyf8jyK-3pA":{"text":"Our last night on Bourbon Street and after a Hurricane and some jazz at Meson Bourbon we w","useful":0,"cool":0},"ZBd88i5ty81a4heTu1A64g":{"text":"I came up here to sit on the balcony overlooking bourbon street around 7 pm. Not a huge cr","useful":0,"cool":0},"c-EYaQZh8O7s8zsSVSVQJg":{"text":"This place is a joke. If you have over eight people they charge 18% gratuity automatically","useful":0,"cool":0},"M43by9RzwBzm0UjkJCclMg":{"text":"This was the worst experience I've had in the French Quarter. Served soda in 6oz plastic c","useful":0,"cool":0},"v_Aiw2oJ2ig6kwSAsg21xw":{"text":"I really enjoyed this place. The location was great as it's on bourbon street and has a ba","useful":0,"cool":1},"0GRQirarkAlCXIU3TULxng":{"text":"What a treasure. Great location for people watching. We had the rib eye steak which was al","useful":0,"cool":1},"TJkF9pelfI_-xDFcaoTO3g":{"text":"I've lived in the FQ for a little over 6 years and one of the places I enjoy periodically ","useful":0,"cool":0},"pBL2zGrzn1ErFXBfpF82jg":{"text":"Got amazing seating on the balcony and got to watch a parade and people of Bourbon Street ","useful":0,"cool":0},"Eg4e6Q4SkVWQyU4WtXL_bw":{"text":"A real locals bar right on Bourbon Street? How? I'm not sure... but if you're looking for ","useful":8,"cool":3},"k00wiA-aW2-uk2NPJUQXew":{"text":"Andre (I think or serv#53) was a horrible waiter. We saw him 3 times, to order drinks, to ","useful":5,"cool":1}}