{"TDwqYClapsiPBzU43qef7Q":{"text":"Almost tripped on the floor. Food is ok, but a bit overpriced for brunch (12-15 for main d","useful":0,"cool":0},"To7bWWwb8CeK7H1FZjLi8w":{"text":"Must have the bloody mary at all costs. We accompanied them with two of their best dishes.","useful":0,"cool":0},"tfRtmD0knwOuMul-bS-6wA":{"text":"For an hour and a half long wait, I expected something pretty exceptional. My family and I","useful":0,"cool":0},"lXjopGhTj_113aeDqZ2jBA":{"text":"This is my third trip to a Ruby Slipper in New Orleans-- this location is new and the crow","useful":0,"cool":0},"Dnk7lPhEJL1oxUKy_gkv4Q":{"text":"One of the best breakfasts I've had. Ordered the Benedict medley and banana fosters French","useful":0,"cool":0},"4Lh9YiPUpuJGCSedMZJ_kQ":{"text":"My partner and I sat at the bar, which normally means a diminished experience, but this wa","useful":1,"cool":0},"luLuyoiupZ_WJHkAfCzmUQ":{"text":"I ate here several times during the week we were in New Orleans. One of the best meals I h","useful":0,"cool":0},"iqbNK1GhNEEq_zuJDPGWwQ":{"text":"Very interesting brunch menu of local creative cuisine. Well prepared. Delicious eggs bene","useful":0,"cool":0},"uwrfgEWCGhpFHQlYqNUm0w":{"text":"Great place to eat breakfast! Food was delicious! Not too bad of a wait if you arrive befo","useful":0,"cool":0},"lQKlt6UXm1a4kgr9Bh2lhg":{"text":"Busy to say the least but, service was good, very friendly. The wait was worth the rewards","useful":0,"cool":0},"PP2uSZUBQ4iswzeeOn6AbQ":{"text":"Really good food. The eggs Benedict menu is very creative. They even let you mix and match","useful":1,"cool":0},"K8RvI9JTm2uckUMxlx1BMQ":{"text":"My sister told us about this place so when we came to NOLA we couldn't pass it up!! We ran","useful":2,"cool":0},"ObjD7loDbkhKiFfOcT-Mdg":{"text":"This place was wicked cute and clean. The staff were polite and friendly. I ordered a TexM","useful":0,"cool":0},"fn8PS0ZOu6dsl-1fk501iw":{"text":"The wait was long but the food and service was good!  The \"Southern Breakfast \" was offici","useful":0,"cool":0},"1TGg5aSqHFijrNG-89t9PQ":{"text":"Awesome pancakes no need for syrup. The wait can be a little long, but good things are wor","useful":0,"cool":0},"noRgGSgJV2efRWSTmRJcqg":{"text":"Excellent food.  Had the St. Peter's dish. The Peach mimosa is outstanding. Sidewalk cafe ","useful":0,"cool":0},"Y7ShCM1g4seRYqfPPdVJEg":{"text":"Came here for breakfast on a Saturday morning. We waited approx. 30 mins for a table. Whil","useful":0,"cool":0},"Kg3HLxM-7GXLO_Erw_fKHQ":{"text":"This place is dynamite. Great food, great service, no wait on the day we were there. Not m","useful":0,"cool":0},"nX5GU3VmbebKY2ioA6Jh8Q":{"text":"Just landed and needed some food saw this restaurant on yelp and so glad I did! Jackie at ","useful":0,"cool":0},"SO3PNGOIOosotcppL65WNg":{"text":"Everything we ordered was amazing! The staff runs like a well oiled machine. They are limi","useful":0,"cool":0},"BDXV0HIhOU0MAM3oyS0Lqg":{"text":"Jackie our waitress was amazing she actually sat down and talked to us a little bit I mean","useful":0,"cool":0},"GJtgMETvtAFGKj_8diXWVA":{"text":"Excellent breakfast! We had the bam bam biscuit and the southern breakfast. Everything coo","useful":0,"cool":0},"r4BIXCxvOJ8She0P17n3Jg":{"text":"Good food. Gets knocked one star because biscuits weren't amazing and waiter didn't have m","useful":0,"cool":0},"h_vutFTdqPHuBTIRIkPm4g":{"text":"The apple crisp pancakes were amazing. Friendly staff and great service. Highly recommende","useful":0,"cool":0},"bwHrptx_JLagUtsSxA-Kzg":{"text":"This brunch was amazing!! Drinks, food and servers are wonderful! Shout out to bartender T","useful":0,"cool":0},"DRuRNhOjc6ZD8cvAJ4xSmQ":{"text":"Get on the waitlist, it's worth the wait.  We had the Spanish omelet, biscuit, praline pan","useful":0,"cool":0},"AIo8-XCoqwxijtx2yHo33g":{"text":"They were pretty busy, but they have a very organized wait system and it was a beautiful m","useful":0,"cool":0},"XJ8L1kQxH5RidPapzqd5YA":{"text":"The food is excellent, we had a slight hang up with the waitstaff on who was going to take","useful":0,"cool":0},"ykVFmG9JClZ4osDAcwzWTw":{"text":"This location is the best kept secret! \nThe Ruby Slipper food is phenomenal!!  \nService by","useful":0,"cool":0},"9PfCeV9Df23LEaRx7vox-A":{"text":"Friendly staff and delicious coffee. The food itself was ok. A little too much hype if u a","useful":0,"cool":0},"y0Vuv2fN_1id3FlUMeKEsA":{"text":"Da vi var i New Orleans i begyndelsen af oktober 2018, fandt vi denne morgenmadsrestaurant","useful":0,"cool":0},"_KYFYvxvT8BP5PXIOMYvfw":{"text":"To beat the wait: get on the waitlist on Yelp beforehand! We were able to show up, check i","useful":0,"cool":0},"sFyhjpmF52AZSDLDhCiSWQ":{"text":"This location is the best kept secret! \nThe Ruby Slipper food is phenomenal!! Service has ","useful":0,"cool":0},"hgSIgAxNT3tGOYyS26uejw":{"text":"Our Uber driver recommended The Ruby Slipper so we have it a shot. Glad that we did. This ","useful":1,"cool":0},"xaCSc4DBETx7642RvJWcbA":{"text":"Awesome place. Eggs Cochon and corned beef Benne were very good. Jackie (our waitress) was","useful":0,"cool":0},"VKAtJpAjeHFXnnLzpGl31Q":{"text":"On a cold, wet morning I was searching for breakfast with a NOLA charm and flavor only a s","useful":0,"cool":1},"RmNlNOEHjkPCcBTis5uZGw":{"text":"If I could give 10 stars I would. We ate here twice while on vacation. Everything we tried","useful":0,"cool":0},"_B2OrhLIXYfvnAUCw_oBhg":{"text":"Went here today for brunch because it was close to the Airbnb we were staying at. Breakfas","useful":0,"cool":0},"59CGp51Fkls1fB3mFDiYHA":{"text":"Omg the food was amazing I had the Peacemaker Benedict where I chose 2 different types of ","useful":1,"cool":0},"BtKirFrZDRXMm8deKA_fGg":{"text":"We visited 10/6 & loved it! We were a group of 6, and only waited about 15 minutes for a t","useful":0,"cool":0},"pBkI-4mcTPX98xgm6JB5DQ":{"text":"First time in NOLA and was very pleased with the Ruby Slipper. Eggs Benedict was delish! B","useful":0,"cool":0},"ogAFUV6BCVPyELkKCIwoyA":{"text":"Ruby slipper was exactly the southern comfort food we needed after recovery from bourbon s","useful":0,"cool":0},"DB2Oh2R2fgtYLPErlazzmw":{"text":"Worth the wait. Both entrées were delicious and the service was excellent. Sadly Yelp's lo","useful":0,"cool":0},"E9GRUw3N3389HQCD86p4sQ":{"text":"Great food, great service, fair prices - Mario was a great server and his wit and hunor we","useful":0,"cool":0},"33hoauyNmAktN7hw0lOOLQ":{"text":"Hearty meals and unique menu options from traditional omelets and pancakes to eclectic gri","useful":0,"cool":0},"BiqTw9pm5m8QPVmFBW-XKA":{"text":"TIP!  Check in online to save time.  Use the yelp app and you can save a few minutes. \n\nWe","useful":1,"cool":0},"YkxtWxrdSFarnUFjRSN_Nw":{"text":"Several reasons why this place gets 3 stars. The 1st one was that they did not honor the w","useful":0,"cool":0},"I80gGq50vk0s177WD8fLYA":{"text":"I had the basic French toast and it was the best French toast I've ever had. Cooked to per","useful":0,"cool":0},"ja3W9AEoOX5j-QTGfE--Jw":{"text":"Was hesitant to order the Benedict sampler but completely enjoyed!  Service was great and ","useful":0,"cool":0},"LNubbmNMzZFrVeBQRNVuuw":{"text":"Super morgenmadsted. \nDet vil tage flere dage at forbrænde de kalorier som vi har fået ind","useful":0,"cool":0},"de0CoFngc4f1MNgF8oVpfw":{"text":"The pancake crepes they had on special were the BOMB. Pineapple and strawberry and blueber","useful":0,"cool":0},"IdrPq7mFQCUTeti3COhTPw":{"text":"Visiting New Orleans for my birthday weekend. I asked a friend before hand if she recommen","useful":0,"cool":0},"IfMGluNbdnRHxjrxJtCYtA":{"text":"Lives up to the hype completely. Definitely recommend the stuffed French toast-- haven't e","useful":1,"cool":0},"rmpUNRJqHPGIH2Np5IjTVA":{"text":"I had Cafe du Monde beignets for breakfast but the buttermilk biscuit I just ate at Ruby S","useful":0,"cool":0},"OsA2EeCdmeYeB-LQT6JOOQ":{"text":"Skinny Migas is it!!! No questions! hands down! Irish coffee was a bonus too.  if you are ","useful":0,"cool":0},"olKLF6bYG26brnOiJOOkAg":{"text":"This is a small breakfast chain putting out really good meals in bright and cheery locatio","useful":0,"cool":1},"VVP6kbYG9z-dQci6oC7jIw":{"text":"This place is basically heaven. Everything from the Peach Bellini and catfish and grits wa","useful":0,"cool":0},"2gaIXPnabXUhA5ohYzY4Mg":{"text":"Theresa was our bartender/ server she was incredible. So fun and bubbly and really attenti","useful":0,"cool":0},"APO04gJpy8briwapMRAn6A":{"text":"Incredible place with great service! Everything was so delicious and our waitress Jackie w","useful":0,"cool":0},"u3Z4LpJ65HoX6_MfqHSl9w":{"text":"Amazing food and drinks and service!!! Our server Arielle was so friendly and gave great r","useful":0,"cool":0},"J9Prw__C-_UxttKgIlucLQ":{"text":"The food here is so good. We both loved our meals and would come back. Be prepared to wait","useful":0,"cool":0},"0OCweN7PjZS_ZEPnHvBiNA":{"text":"Great food. We are twice there for breakfast while in NOLA. The restaurant in Canal Street","useful":0,"cool":0},"oyRBWdj2Ciit8SKgP3Z_8Q":{"text":"Love this place!  Found the newer cafe on Decatur, small, but same great food!  And bacon ","useful":0,"cool":0},"HKflk6PHClfIb-SauDl1aA":{"text":"Jackie was the best!!! She was so flexible with all our orders in a big party. Service was","useful":0,"cool":0},"V8-GVHp_7XNMY7P1nYtQug":{"text":"Omg the menu is huge and delicious. Table of 7 had grits and a biscuit, eggs Benedict 3 wa","useful":2,"cool":2},"c1OjL7PVEAa6gAq17pqCXg":{"text":"Overhyped. Although the food was good, I wouldn't go there again. The wait was extremely l","useful":0,"cool":0},"_d6kOa6a8euKSlqcYvqNGQ":{"text":"The food was amazing, it looked so good that i forgot to take a picture first ‍ everything","useful":0,"cool":0},"OcZrgzDS_KT7uapf8FiPRA":{"text":"We actually were meaning to go to the Market St location but when I looked it up I saw the","useful":2,"cool":2},"-Sl3f2WJuV0P3Z8J4ktr1A":{"text":"Amazing place!! The Trifecta was SO good! I liked the chicken biscuit the most out of all ","useful":0,"cool":0},"vfovRZAUDM-snt_kpRwpQw":{"text":"Came to a hot spot and found good and bad. \nThe bad, the OJ is not freshly squeezed as adv","useful":0,"cool":0},"PTpO-L-eiPnHP1a3OzGcQQ":{"text":"Great food! Jackie was so personable and fun. Full bar and she still killed it. Thank you ","useful":0,"cool":0},"hYxzUgxMaKJxKfo8It3tHA":{"text":"This nice little cafe was a bit hard to find but it was worth looking for. We were here du","useful":0,"cool":0},"Eawkq_zwMNlNJbzxuL8KYA":{"text":"Stay away. This place is trash. This is the ONLY place I've ever dined in New Orleans wher","useful":0,"cool":0},"DNvEP_hSL1BtJz6ffqHX3A":{"text":"This place is phenom. We went to the location on Decator and actually arielle is the shit.","useful":0,"cool":0},"5vtXp6f0Lh3Fc72gp0jb6Q":{"text":"This place is a must go to.\n\nWe stoped in for breakfast this morning\nEverything we order w","useful":0,"cool":0},"Rpkoz8eviqFG9JSNNypkbg":{"text":"Love The Ruby Slipper! Haven't been here in a minute and am excited to indulge in these am","useful":0,"cool":0},"oe-vXjNr4uemPtxETSrCFQ":{"text":"The food was good. I had the BBQ shrimp and grits. The biscuits were the best. It was a li","useful":0,"cool":0},"T06rLSkobvhqiHZHTNAWOA":{"text":"Came here for breakfast with the wife on Monday morning. This was another spot recommended","useful":0,"cool":0},"FNXq_4LekqVxTsMI3lPU_g":{"text":"This review is a 3.5. \n\nA little overrated in my opinion. I had the pancake flight which w","useful":0,"cool":0},"JYxvBqBOgjTwLxCrBrI33w":{"text":"I am SO GLAD we stopped into Ruby Slippers on a recent trip to New Orleans. We had gone to","useful":0,"cool":0},"uwMQrs3gX5r_T1kDi1mg-g":{"text":"Amazing brunch spot. There are multiple locations in the city, and I imagine them to be al","useful":0,"cool":0},"8gT3bpS22YYFfrNkqeyVug":{"text":"This is a nice breakfast spot with helpful staff, quick service, and a few extra special i","useful":0,"cool":0},"Nu2l3Tj7B7iL1jHVgMkfHg":{"text":"The food is definitely all that it was hyped up to be. I had the Bananas Foster French toa","useful":0,"cool":0},"p-pyRyrRojDJtuv92eGeqw":{"text":"A friend suggested this place and it was worth trying. The fried grit wedge was delicious ","useful":0,"cool":0},"_YAKE605Uiq3VZM3tKy06w":{"text":"Ordered the peacemaker with eggs cochon and corned beef bennie. The apple braised pork on ","useful":0,"cool":0},"6dHSgIsilAInyk1yarHuwQ":{"text":"SO many great things I can say about this place but I'll sum it up. Great food, great vibe","useful":0,"cool":0},"4EwAYjkjeQwh0ajZhmKS_w":{"text":"Loved the smaller location and sitting at the   Bar. Had excellent service and Teresa had ","useful":0,"cool":0},"0EUz_NkCRsjBO6MERf8n4w":{"text":"Service was a bit slow on the day we went, but no denying the delicious food! Every plate ","useful":0,"cool":0},"1sA1oEp353ghVT7zPOaTKw":{"text":"Brunch was wonderful. Our server Mackenzie T, was friendly, helpful and nice.\nThe Trifeca ","useful":0,"cool":0},"y6iPbhwEHnslpDksjuJfIg":{"text":"This place was jam packed today (day after Mardi Gras) but totally worth the wait! We peru","useful":1,"cool":1},"3YuUKwFE2O6-6f1OQIo_Rw":{"text":"The food came out a little late but it was worth the wait, the gator meat was awesome,grea","useful":0,"cool":1},"mGSWbuCLnR19YNmrJF3oSw":{"text":"The food was amazing! So much we couldn't eat it all! The atmosphere was nice and relaxing","useful":0,"cool":0},"Tlsl5xcpAmy9Agw8TiEgSg":{"text":"This restaurant seems to play favorites for seating people.  After waiting over an hour an","useful":0,"cool":0},"kQ9GI6907IA7GRa9KLWd-A":{"text":"The food was good! The atmosphere was very easy going. Our waitress was so so! But maybe w","useful":0,"cool":0},"s6l_J9u5dqfVQXhIUQBeDA":{"text":"For the hype, this place did nothing to impress... let alone blow us away. Average food, d","useful":0,"cool":0},"9f715QXwdV82eZIQx0nNkw":{"text":"We are coming back here again tomorrow!! This place is great!! The food is to die for and ","useful":0,"cool":0},"OXN_eQ2PzE7zZfURjtOrSQ":{"text":"Delicious coffee, food, atmosphere, and service! Very cute restaurant with a country feel.","useful":0,"cool":0},"3EEwCDg8iu_9vH8GVePgGA":{"text":"Family and I were in NOLA and Ruby Slipper was recommended as a great breakfast location. ","useful":0,"cool":0},"xWbNshJzNkE7mDPg0iU2EA":{"text":"This was a great first breakfast in Nola!  We had to wait a bit but sign up for the waitin","useful":0,"cool":0},"96Z-VNZkAbeTLmM5jS_oYg":{"text":"Ah-maz-zing!!! Loved this little spot for breakfast. The staff was super sweet - made lots","useful":0,"cool":0},"vvMj0zCJfz2IC3Zp7hN8Rw":{"text":"The Ruby Slipper Cafe is a great place for breakfast or brunch. The biscuits are the best ","useful":0,"cool":0},"n3N4rBX-voR_nIEC0_Y68A":{"text":"Seriously. This place is THAT good. \nI have never been to NOLA before - but this meal made","useful":0,"cool":0},"xnuhVQfWClLqhXaXCsFa4Q":{"text":"We came for breakfast  here based on Yelp reviews and bc it was walking distance from our ","useful":0,"cool":0},"xmP9BPeun-n-rTFFqs96tA":{"text":"Extremely amazing food! Wonderful staff & service. The avocado toast and BLT mimosa's and ","useful":0,"cool":0},"xl5zObqduS2jQF6nw4U77w":{"text":"Not healthy but excellent. \n\nTrifecta is a must... and service was excellent.  A perfect p","useful":0,"cool":1},"GaHnooW5P-4MT99DvMLKwQ":{"text":"We went here yesterday morning, and booked ourselves online over an hour in advance. When ","useful":0,"cool":0},"DWYhUlUPwDmtQBL7FHJJwg":{"text":"Delicious breakfast with A-MA-ZING biscuits!  Huge portions.  The bacon pancakes were grea","useful":0,"cool":0},"JL0xl705LxGjmDJJcBWrGg":{"text":"Eggs Benedict on delicious - and HUGE- biscuits with fried chicken or pulled pork. That, m","useful":0,"cool":0},"HmStKGGWPOb2JMdQ4gdnJw":{"text":"Ruby Slipper Cafe was our first \"brunch\" spot of our New Orleans trip and it def didn't di","useful":0,"cool":0},"kzhYcOeTcNwBKknV9OOnWw":{"text":"Yum, yum, yum. First time here.  Try their wide assortment of Benedict's on biscuits. Also","useful":0,"cool":0},"jtWHulTgpSGPtCvFO6fqjA":{"text":"Stumbled onto this absolute gem while looking for a brunch place. Went in with 5 friends f","useful":0,"cool":0},"diWw9t1MDiofI8uPp1cAmA":{"text":"Arielle was our server and she was AMAZING. She took care of our party with care, speed, a","useful":0,"cool":0},"e1xjCOvUgh5yXZPUoglzpw":{"text":"Jackie is the bomb.com the house down boots. Loving Jackie's  boogaloo!  Great food.  Than","useful":0,"cool":0},"KHrpmfJ80r22zFC2LYGGBw":{"text":"Tried this place on recommendation. Great bacon and cinnamon pancake. My girls loved the F","useful":0,"cool":0},"PZeBqK9yD7Bg81Qv_ifdMg":{"text":"This is always a must when we are in New Orleans. \nGreat - Lite Fair Migas excellent. Serv","useful":0,"cool":0},"VtYGn0CaEunACiWbnYQHdQ":{"text":"Fantastic service and food! Loved the Bananas Foster French Toast and the Corned Beef Hash","useful":0,"cool":0},"lqwdAV0vdvsUFX1KtNPLIA":{"text":"If I had one place to choose for breakfast in NOLA I would choose The Ruby Slipper on Cana","useful":0,"cool":0},"R-DTwzZmMq2nD5qLoCOGAQ":{"text":"Love love love. Bloody Mary's are exceptional, I had two and they creep, so go slow! :) I ","useful":0,"cool":0},"M9_Mly498QwxAqEB0frjiw":{"text":"Awesome Bloody Mary,Awesome Boozy Coffee, Waiting on brunch, but it looks Awesome also. Wa","useful":0,"cool":0},"J8t5pIy5xiYiK8-FDb1WFw":{"text":"Loved our breakfast! Online waiting list was great. Truly a very good eating experience.  ","useful":0,"cool":0},"JAj9yR9HD1c6QTZvbAFVzA":{"text":"First time having grits and they were delicious. The waiter recommended goat cheese on top","useful":0,"cool":0},"iZXvbMv3FClQxtosmcPNOQ":{"text":"We came to this place because it was highly recommended. Very personable wait staff. The f","useful":0,"cool":0},"Df-e_7-mxpC1yjRnXMMLLQ":{"text":"The food was sooo good! I had great service, so I had to come back\nTwice during my vacatio","useful":0,"cool":0},"YTZP0MR7U6KKS5xrjZOEdA":{"text":"Arielle (spelling?), our server,  was great!  Very knowledgeable about the menu and made g","useful":0,"cool":0},"ztmDxxzxiRnC3RNHSZxV-Q":{"text":"We have dined at another Ruby Slipper.  The wait here was not as long but the food was jus","useful":0,"cool":0},"iLv1rWfDFlZ-jDCc-Wf9nw":{"text":"We had an absolute blast and our server was \"THE BOMB.COM!\" (Jackie.B). The Trifecta was \"","useful":0,"cool":0},"uY2CCa3Dqz9rPjStxgov1g":{"text":"Oh my gosh YUMMMM..... if you want to eat like you're truly in Nola then this is a good pl","useful":2,"cool":1},"p_kd8wIwJt-tUmyQlu-k6Q":{"text":"We went here for breakfast/brunch on two occasions during this visit.  Initially, we visit","useful":1,"cool":0},"pNnQ4tPA6Q156y6dnIt3dw":{"text":"SO SO GOOD!! My boyfriend and I were here for a small trip and all of our friends recommen","useful":0,"cool":0},"UB4WVVLa-EFXRivkp1SZ7A":{"text":"First time coming here. What an amazing experience. Staff is super friendly. Great sense o","useful":0,"cool":0},"vnitnlTsvWmPjR6N9EVsTw":{"text":"The Ruby Slipper Cafe was quickly recommended for breakfast by the front desk staff at Har","useful":0,"cool":0},"p-_Q6H_VJ9xdmox2r6tppQ":{"text":"Clean and comfortable restaurant small in size. Waitress is sweet and efficient. Ordered t","useful":0,"cool":0},"kt1uSs2Xug0KtvZ8HrE16A":{"text":"I visited here because I was told by several ppl this was the breakfast spot to stop when ","useful":0,"cool":0},"twf_FJGfBvz-p8XsnRPtXQ":{"text":"My wife and I love The Ruby Slipper! We eat here at least once every time we are in town. ","useful":0,"cool":0},"uriSfpCVlB-q9VZt_rViIA":{"text":"Great breakfast spot.  We walked right in on a weekday around 8:30am.  I'd been here previ","useful":0,"cool":0},"SAFqDHtTtiW2PprUGX0ROQ":{"text":"Was in NOLA for a conference, went with friends. Loved the vibe! Great menu, excellent Egg","useful":0,"cool":0},"Y5Ha2OE6VWnKrre0D16QAA":{"text":"The shrimp and grits were underwhelming, but the bacon pecan pancake was great! The biscui","useful":0,"cool":0},"KjElBK57jemD4SuwCqUpSA":{"text":"We ordered 5 breakfasts.  One did not taste good but the waitress would not take it back o","useful":0,"cool":0},"Uzx_kDa2cvZ04B3EZRllXQ":{"text":"This was a great little spot we hit up before going to the WW II museum. The food was real","useful":0,"cool":0},"orTPgBa8zOLIXDl0nLGcqA":{"text":"Amazing service our waitress was Teresa. Food is delicious , big portions. Price was fair ","useful":0,"cool":1},"6rWBKUavAtpmrmkWAXpA_Q":{"text":"A long wait for brunch but worth it - recommend using the yelp reservation waitlist. The c","useful":0,"cool":0},"lZGf77f8-0OcgLsXEYHePA":{"text":"Really good breakfast spot. Be prepared for a wait. We had the bam bam biscuit...homestyle","useful":0,"cool":0},"BC8_SAwbuylXRFg4nFgPDA":{"text":"Eggs benedict cochon is where its at! So so good! Biscuits are gigantic. The morning marga","useful":0,"cool":0},"hPFy_tYiaZ35jwfO6lIFPg":{"text":"Jackie was the best waitress ever!! Super friendly and gave tons of awesome recommendation","useful":0,"cool":0},"vDkg7Uba3gXU-37Nzj87cQ":{"text":"This place has really good food. They crack jokes so it definitely lights up the mood. I h","useful":0,"cool":0},"9lGg1X2woP6xzQwOdLAx-g":{"text":"Best French Toast I've ever had! The grilled fish is also great - very nicely cooked. \n\nIf","useful":0,"cool":0},"JvdGIc5JxTx5nRhVOn-DwQ":{"text":"This is my favorite place for a nice warm cozy meal, the service and the food are by far a","useful":0,"cool":0},"LN-5C4nylLpiZgY0-nvLHQ":{"text":"Food was great the line was long. I checked in and went across the street to grab a coffee","useful":0,"cool":0},"4YClrV5-XK-tTbAP_tmsZQ":{"text":"Waited an hour to eat and was totally disappointed.  I asked for over easy medium eggs and","useful":0,"cool":0},"0dmTlkzD2dKKjNbSspO6Jg":{"text":"Worst breakfast ever! Felt like servers were being forced to work there...don't order the ","useful":0,"cool":0},"lMwixuRFS_NXz8S8TZpX9A":{"text":"Skip to the bottom if you want the tdlr. \n\nService was great, but the menu is intimidating","useful":0,"cool":0},"dqZxXe5zb7fE1Ce2hc4MPw":{"text":"All I gotta say is that the wait is worthy. The banana foster French toast was amazing and","useful":0,"cool":0},"fhhyCor56-i0eShCciLIwQ":{"text":"Visited this cafe for brunch. We were a party of 8 and had to wait about 40 min. Our serve","useful":0,"cool":0},"sEh-xNEBp5VIJPIUShRqCw":{"text":"Our hotel was a minute walk, so it was a no brained to have breakfast here. It's one of th","useful":1,"cool":1},"Z0siBlPdAYakDk8htq5N5Q":{"text":"I came across the Ruby Slipper cafe through Yelp and once I saw the wait time I figured it","useful":0,"cool":0},"DctQFupcCUKq78kctun7QQ":{"text":"I would give it a 5 but my family disagrees.  I enjoyed my food and I think the fact the f","useful":1,"cool":1},"5I5vzBh47JTET3Gx4_WKUg":{"text":"Great food, spunky service and character.   A bit of wait time but worth it. We even bough","useful":0,"cool":0},"qWH0h33H-iKDy2bFo2_-Tw":{"text":"Great food. My favorite brunch stop in NOLA. Any location is great, this one is  actually ","useful":0,"cool":0},"7xpe_7soUMxko02JA2AEFQ":{"text":"Everything was great! Omelette was a bit too wet for me but shrimp and cheese in every bit","useful":0,"cool":0},"YQqZ147-8gzQo_E0zpECRA":{"text":"This place is solid and wonderful. You want breakfast, you can't go wrong with RSC. Simila","useful":3,"cool":0},"26oFEwfj43atrcE0uwWK_g":{"text":"I cried tears of joy after eating their grits because it was so good. I grew up on grits a","useful":0,"cool":0},"lqtTcW4MZSUtMMBGh0J5tQ":{"text":"Was staying at the Marriott around three corner and read the great reviews.  Had the assor","useful":0,"cool":0},"fFWEt7hv8pEkQnnb53h5fw":{"text":"Awesome breakfast!  I got light migas but the options were superb for whatever you feel li","useful":0,"cool":0},"eM0XwZMPTDjw8rtd8riWaQ":{"text":"Great place for brunch in the quarter. The food is good, atmosphere is lovely, and the wai","useful":0,"cool":0},"twsyQmeGvutd3REwlAVc7w":{"text":"The food was great. The hostess was a little slacking, but the bar tender and everyone els","useful":0,"cool":0},"SWS8PJeQeah-yYjsKvKm9Q":{"text":"First stop on our trip to NOLA and they did NOT disappoint. My BYO Omelet was delicious. M","useful":0,"cool":0},"yJdWRMkbS_qBA_4fO9IAaQ":{"text":"OMG!!!! Y'all! I haven't had a brunch that taste this great in a looooooong time! The rest","useful":0,"cool":0},"ffbpBOvRQ_ybju8Uw4_Hjg":{"text":"There is literally nothing about this place, the staff, or the food that we did not ADORE.","useful":0,"cool":0},"XMc7qt_Mf6mERIMVq0avCw":{"text":"I ordered the eggs cochon and the sauce was the cherry on top! We ordered to go and also g","useful":0,"cool":0},"J8L2aBF3ChBr7Mi9iyWHDw":{"text":"It wasn't good.\n  - Biscuit was dry. I didn't even finished it \n  - I hated the sweet baco","useful":0,"cool":0},"Ll6hcixXOruwpDjiLtq7hw":{"text":"Has really good breakfast options, the Benedict's were the best. There is a reason that th","useful":0,"cool":0},"_J-tErYHzytwld_4ZDeTEA":{"text":"This restaurant was recommended by our UBER driver... she was a local and seemed like she ","useful":0,"cool":0},"DDfF713L8xSnwbEIWx41jg":{"text":"This place was amazing. The food and service was great. I had the shrimp and grits which w","useful":0,"cool":0},"IAuMXSN83f17SAaPe9yfAw":{"text":"Our food was hot and fresh. We lived the extensive menu. Drinks were on point. I had the s","useful":0,"cool":0},"xddr1DNc1E7bvoohBcgfaQ":{"text":"Pros:  \n- Used the Yelp app to get on the waitlist from our hotel room \n- Our table was re","useful":0,"cool":0},"oUJzQhUXsOTlF3vwHk5PhA":{"text":"The service was great but the food not so much. Eggs were cold and bisquits  under cooked.","useful":0,"cool":0},"hFLVCOKpKAxKraPuTDeP_A":{"text":"Great breakfast. Get there early bc it will get crowded quick.\n\nGot the Bananas Foster Fre","useful":0,"cool":0},"k8YJMbKx_7LS4NrGVkW-5Q":{"text":"This was the first place we ate at when we arrive in New Orleans. Great drinks and food. T","useful":0,"cool":0},"Q3mdZiapw1MXLvYrKttXEw":{"text":"Good breakfast, lots of options. Gets busy but they seem to keep the line moving. Coffee i","useful":0,"cool":0},"Dwzn3r-ze8kIbEMygt-qTw":{"text":"Best Breakfast in NOLA.  Great service too!!!  Was crowed but seated and served quickly.","useful":0,"cool":0},"pXNv-oOqXknNgNw1ebZI7A":{"text":"Stepped in for brunch. Don't have enough space for all of the great things about this plac","useful":0,"cool":0},"yDVX7hgnW8SC7MNoC9cyDg":{"text":"This my favorite Breakfast spot!! When I visit home, I must go and have their fabulous foo","useful":0,"cool":0},"1A0-lxC2E--WXTI6jBU7BQ":{"text":"Oh, Lord, what happened to the Ruby Slipper I used to know?! We moved out of NO about two ","useful":0,"cool":1},"0shsjovcPNugjkLM8VkiXA":{"text":"Ruby Slipper cafe was highly recommended to the group I was traveling with (by a waitress ","useful":0,"cool":0},"CwyXW2y7knhS8keWEgrXgQ":{"text":"Some great unique eggs Bennie variations here! Fried green tomato Bennie? Yep, so good. I ","useful":0,"cool":0},"H2P8urnhY3OHlI8AgMhkag":{"text":"This place was pretty good as far as French Quarter breakfast goes. It was very busy, so b","useful":0,"cool":0},"F_Ff5XzJ5oBD0ynJftR8hA":{"text":"Hands down best breakfast I had in NOLA.  Built my own omelette and had the cinnamon swirl","useful":0,"cool":0},"cErC8jcLHg7WBTf5BRg49w":{"text":"Delicious!! Cool small hole in the wall for breakfast. Definitely thy the chicken st Charl","useful":0,"cool":0},"8n6yqJhc3jy3aCrGPqjXaA":{"text":"Food had no taste, I was amazed because it had such good reviews...  however, they did mak","useful":0,"cool":0},"-Hi_mgHcqmlvaDaA-41Ttw":{"text":"Well worth the 30 min wait! The BBQ shrimp and grits exceeded my expectations and Jackie o","useful":0,"cool":0},"OFQPvzckdkq6n7AVXhOFCQ":{"text":"This was my second time eating a Ruby Slipper and they do not disappoint. Of course I had ","useful":0,"cool":0},"QS3LSp6DJGAHSjwi4UvV6w":{"text":"Food: impeccable. Customer service: impeccable. Literally the best omelet, grits and biscu","useful":0,"cool":0},"3LhUFThE4WJcxR1iZI_IHA":{"text":"this is the place for you if you like any sort of benedict. or if you're just a big breakf","useful":0,"cool":0},"lddFkbMVqd-l8O9ziPdqMg":{"text":"This restaurant is quite possibly the cutest brunch spot I've been to in awhile. I know Va","useful":0,"cool":0},"JXlBbhCg-CYZ-I2wqjB3iw":{"text":"There are NO vegetarian Benedict's. I ordered the applewood bacon, no bacon (which is $3.2","useful":0,"cool":0},"8jRfZs6TD-cWip5yX40k1A":{"text":"I came here for breakfast and it was very good! The wait was over an hour long but I check","useful":1,"cool":1},"RPzBbOQnH1j0XGrSeeqkfQ":{"text":"The staff was very helpful and friendly. For me, the food was just okay, i think it was ca","useful":0,"cool":0},"YrQI1HkRQ05VZhSwfKEn7Q":{"text":"Okay, for real this was one of my favorite spots since I've been here. I started with an e","useful":0,"cool":0},"VucVaT4Pf3qx69CXYyg7Pg":{"text":"This place was recommended by multiple locals and has the BEST breakfast in all NOLA!! A b","useful":0,"cool":0},"O5AHnOm2BPBE-mFABf3mKQ":{"text":"Excellent breakfast spot.  They have your standard breakfast fare with some unique options","useful":0,"cool":0},"_jArbfl-tda90R5eKtrL6Q":{"text":"Fast service, great hot chocolate and cinnamon pancakes, coffee was good too, shrimp and g","useful":0,"cool":0},"iDIrqLUdDd88FM4n4zfYqg":{"text":"Great food great service! Hostess lack customer service but besides them it's worth a try.","useful":0,"cool":0},"MKWFVQOzqhwAh1V1bwQ-tA":{"text":"This is my second time at the Ruby Slipper, and I can honestly say their Eggs Benedict is ","useful":0,"cool":0},"D4xebA039hGH8ujfA4kAaw":{"text":"Oh this lil gem! A group of 6 and we were ALL satisfied with the yumminess! Let's start wi","useful":0,"cool":0},"OKIVdCB06hb5z9fjASgQCg":{"text":"I cannot wait to return here. Delicious food, plenty of mimosa options! I liked the 3 bene","useful":1,"cool":1},"wxStRGi2LgvbIqQmKTaVvA":{"text":"So so so good! I'm sure I'm just another 5 star review for this place but it's amazing. \nW","useful":0,"cool":0},"iNs3YKtmK5KFp8bgmVT6Rw":{"text":"Great food and great atmosphere! Our server was also very sweet and knew the menu well.  W","useful":0,"cool":0},"47XjADHna2mFjrELsmzpWg":{"text":"Eggcellent!! Only need to use Tito's or a gluten free vodka so everyone can enjoy a great ","useful":0,"cool":0},"4lgika-UGeqGBhVnPKNTuQ":{"text":"Great every time! I had the grilled fish St. Peter this time and it was so delicious. My h","useful":0,"cool":0},"zXOJLj-ThGg8av_6hw6iNw":{"text":"Came here on a Sunday morning for brunch and made a reservation yet the wait time was stil","useful":0,"cool":0},"6fWi0f7qOn9btwAHajrtmQ":{"text":"The food in this place is delicious. The best creamy vanilla iced coffee I've ever had and","useful":0,"cool":1},"ceDLLVvDRJwh42V7F7_T3w":{"text":"Probably my favorite meal while in New Orleans. Well worth the wait we spent waiting on a ","useful":0,"cool":0},"s-LM8p-zW9CkIOOiQrCucg":{"text":"Our Air BnB was less than a minute away so we tried it right away. As there was 4 of us, w","useful":0,"cool":0},"erlovEd5fblPAxWAFjLdyw":{"text":"Great place for breakfast, Drinks were great especially the Boozy iced coffee. I ordered t","useful":1,"cool":0},"7kcPRwgu0z5NIAlcZUHz0w":{"text":"Loved the Ruby slipper. Food was great, service was fast and efficient. Would definitely r","useful":0,"cool":0},"uXev_GYrhRbRptGWgWCeGA":{"text":"This place did not disappoint and our waitress was amazing!! Such a sweet woman! I ordered","useful":0,"cool":0},"45rrtDq4_wjKMwUCrhwU3Q":{"text":"Amazing! \nWe coming from Houston for a concert , had brunch there today and it was outstan","useful":0,"cool":1},"IYnlIqxmWJWfM6-k0wuwXA":{"text":"YUM!  The service is great. We checked in online and were seated as soon as we walked in. ","useful":0,"cool":0},"gPSXdXS6_TJ9OhOq0j5YpA":{"text":"Amazing breakfast/ brunch spot. I had the omelet with the famous red sauce. It was so good","useful":0,"cool":0},"EcPUc6yLgg70W8PebvrESg":{"text":"The best pancakes I have ever had. We are from the northeast I wish Ruby Slipper would com","useful":0,"cool":0},"TD7G7FBqp2X-BS9_xj9XDg":{"text":"Any location, any wait time is well more than worth it! I suggest any of the eggs Benedict","useful":0,"cool":0},"MbSrZeaoVuwWtjSYCgtucA":{"text":"Awesome place to go grab a quiet breakfast.  The food and service are excellent.","useful":0,"cool":0},"EI1dH1JnPbzsMutH4LZ5Xw":{"text":"This place was so good we went twice! The service was wonderful and the Pig Candy is to di","useful":0,"cool":0},"YeqdKQwWbTI1qtE8e0dX7g":{"text":"This is a must every time I am in NOLA. The St Charles eggs Benedict are scrumptious. And ","useful":0,"cool":0},"3jaNuJfTEoOeUH6CeesqRA":{"text":"The food was good, shared this plate with my mom and there was plenty to go around. I thin","useful":0,"cool":0},"sGF7w5O2B1lyKV9PlDBEdQ":{"text":"This place did not disappoint. Luckily, there was only a 10 minute wait. Super fast and fr","useful":0,"cool":0},"kKV_c_btdUWm4RUGyQ1kFA":{"text":"Deliciousness overload!!! We were seated as soon as we walked in and the welcome was defin","useful":0,"cool":0},"ZjDMsefPOoWuD-eSrdS2og":{"text":"I wish my experience was as great as the reviews I have read.  However, my visit was lack ","useful":0,"cool":0},"s2qX-9wCoQPIJ4Qn07ccVw":{"text":"Nice hometown feel with friendly staff and lots of options on the menu. You can checkin us","useful":0,"cool":0},"wi1C_n-MgfBFgTsIK1W_EA":{"text":"Great little brunch spot was hopping this am so we used wait list feature & only waited 5-","useful":0,"cool":0},"Fxn4pLE_LisNPQ8Tih8mUQ":{"text":"An unassuming cute cozy breakfast place. \nWe got shrimp creole Benedict, bananas foster Fr","useful":0,"cool":0},"pyv2noyKq2cdR2m12W_uyw":{"text":"Without Jackie this place would be lost! Boss lady running the bar!!! Will be back for sur","useful":0,"cool":0},"0KmbnZIhKvv8BuvDVEBJOQ":{"text":"The best breakfast we had during our 6 day stay in NOLA. After eating here on Tuesday , we","useful":0,"cool":0},"tpsDxSptuBqgOmWwqjJkwA":{"text":"A great breakfast spot located in the french quarter. They had a lot of interesting and de","useful":1,"cool":0},"fr9Vgh0aBcrrYm3gcBnGRQ":{"text":"It was good but I'm wasn't impressed at all. Pancakes were blah and the eggs were dry and ","useful":0,"cool":1},"-rHpgu02dW9hBPwY8S-zsQ":{"text":"Can you say, we are coming back. The wait was worth it. Totally be prepared for that, but ","useful":0,"cool":0},"nqkysqnrPaeh7IIxZL9YTQ":{"text":"Bacon infused Bloody Mary, fried green tomato Benedict and cochon Benedict... OMG  too yum","useful":0,"cool":0},"EyX8zExIDC5PvQcJDiNqTg":{"text":"We were looking all over for a quick brunch place and came across this place via Yelp. Tip","useful":0,"cool":0},"u5hO5Wm81r2uWos5lMkQsQ":{"text":"A great breakfast spot close to the convention center, quick to take our order, very busy ","useful":0,"cool":0},"PLwvG3_catHQBGYFfmvkWA":{"text":"Great chicken and breakfast food! Awesome environment! Friendly people and  Quick service!","useful":0,"cool":0},"EA-0hBAf0aR3zIgmixIKYg":{"text":"YUMMY! Great place for breakfast, friendly staff and seriously delicious food.","useful":0,"cool":0},"iovOSwaGmWTQFcEfIEBRzQ":{"text":"This is always a favorite stop for me in NOLA. It has some of the best brunch food in the ","useful":0,"cool":0},"5Zi-aOloNtWva0inzfhi_w":{"text":"A friend recommended and she did not steer us wrong. 5 stars! I had the shrimp and grits a","useful":0,"cool":0},"OKzkrrb66u-R7b5UE1iuzA":{"text":"Best breakfast spot in New Orleans !  To bad we found out about it on our last day here or","useful":0,"cool":0},"HEdEtrGeSBiw40cQgXZnGA":{"text":"Great spot. All of our food was amazing, and drinks were good but maybe overpriced. Ariell","useful":0,"cool":0},"EdUYWg16VaIUN0TiP5deRQ":{"text":"Guys this place is not good. \n\nMy husband's order: soggy bread and chewy corned beef\n\nMy o","useful":0,"cool":0},"bbheOWkj8q65B7-fUScjng":{"text":"My first time visiting this place here in new Orleans with a group of my home girls I must","useful":0,"cool":0},"Giqvw8fILjflS_FhmweexQ":{"text":"Breakfast at the Decatur St location in The Big Easy. Very busy, hip atmosphere, all ages ","useful":0,"cool":0},"MLw55zebe-6prYH4G-7cQA":{"text":"First breakfast spot in New Orleans. Get on the wait list on yelp it'll help since wait ti","useful":0,"cool":0},"7zyZv7-AHEptyN747bccVg":{"text":"We had high hopes for this one. It was ok. Hubby had two  of the Benedict dishes and his p","useful":0,"cool":0},"1iLgf97OJw8H9Fqslvt-6w":{"text":"I am not the person to try new food items but taking the advice of our waitress, Jackie, I","useful":0,"cool":0},"wOzQqzNbQE8FnsDTMx_8zg":{"text":"We had a bit of a challenge finding a place near the French Quarter that was open for brea","useful":0,"cool":0},"d1UwX0sqwfx9k_s-5n2JxQ":{"text":"Chomping at the bit to wade deep into New Orleans cuisine, and so we opted for this place ","useful":0,"cool":0},"B8MT_DV4BwgUxwZFyj7Nag":{"text":"First time trying southern style breakfast and I was not disappointed. I had st.charles ch","useful":0,"cool":0},"-IrMG25s-JbDJru2DLyOrg":{"text":"The hostess is rude and servers aren't much better. Go to the other location on Magazine S","useful":0,"cool":0},"2z5rlBEzgGsMoQcjfzjUDg":{"text":"Lovely food..I had the famous fried chicken eggs benedict..it's a lot of food!...awesome t","useful":0,"cool":0},"dzWhzKCfbt_OkswSh-U_vg":{"text":"This was our first meal in NOLA and one of our favorites. The biscuits were amazing! Best ","useful":0,"cool":0},"w7fPBU4efrJJOeilNbmr2A":{"text":"Everything we got was above all my expectations!\n\nI got the Salmon and Avocado Toast with ","useful":0,"cool":0},"LPfsBSaqszqh84dcTrBESw":{"text":"Food was great, server was inappropriate and disrespectful. Highly recommend anything bisc","useful":0,"cool":0},"UuBbsGTx8pXwKrWT9r_FRw":{"text":"we heard so many great reviews so we had to try.  ambiance inside the restaurant is super ","useful":1,"cool":1},"WYbimIkOlHpmU9tLT2WvrQ":{"text":"Best breakfast ever!!! Worth the wait, serving sizes were awesome and the shrimp omelet wa","useful":0,"cool":0},"l3nMPAIpyCjmGtAhlti4Ig":{"text":"TLDR: service is bad, wait time is too long, food is mediocre \n\n\nI came here because of th","useful":1,"cool":0},"Vv_a19wmH7KtwKU8Ti0GJw":{"text":"Awesome breakfast spot! There is a long wait on the weekends but we found that the wait wa","useful":0,"cool":0},"fPf87tZID4a0quEdr3dEqQ":{"text":"Omg the breakfast here is so good. So I ordered the shrimp and grits and a side pancake. T","useful":1,"cool":0},"qS0lflhjipNjrYdc-gaW5Q":{"text":"Smells weird in here. Food was bland. The fried chicken Benedict was not good.\nThe cinnamo","useful":1,"cool":0},"TGmyYc5vxddWgDgmxbkilQ":{"text":"Great brunch on Sunday! Long wait but it's worth it and you can check in ahead of time on ","useful":0,"cool":0},"rlKKgTesFbRsQSl9KRocEA":{"text":"The food was great! My mom and I split the stuffed French toast, and it was so yummy!! We ","useful":0,"cool":0},"DC6avI3-LOuuH2IqyyC7fA":{"text":"Love this restaurant! Sitting at the bar, mimosa or Bloody Mary in hand. The Benedict's ar","useful":0,"cool":0},"WJ1KsFj_-NlBCDr0rdR8uA":{"text":"This place is on my list as a must visit for a great breakfast (which my oldest son requir","useful":0,"cool":0},"72ivGD744KIF9t0Z_ZG72g":{"text":"If it weren't for the delicious flight of pancakes, I would give 2 stars. I ordered eggs B","useful":0,"cool":0},"IJZESv5-L78X4gPzON4bzQ":{"text":"Excellent breakfast spot! I got the Migas and it was excellent! My friend got pancakes and","useful":0,"cool":0},"uIl02poKC1vCjMdl-leqHg":{"text":"Had to come back a second day in a row because we just couldn't leave New Orleans on a bad","useful":0,"cool":0},"SMQ-7T64sSr-3h265hvOCg":{"text":"They call the wait list by text. Ours didn't go through instantly so they gave our table a","useful":0,"cool":0},"mmvVlE02DiYm_P_GIE2vjw":{"text":"Came here for brunch on our last day in NOLA. I had heard some mixed reviews for Ruby Slip","useful":0,"cool":0},"DMaTYZ-a1fvCCmOJGkQQ0Q":{"text":"Absolutely fantastic place for brunch. The eggs benedict were fantastic and generously por","useful":0,"cool":0},"fHU18VbVW8uflQyWQqDYUw":{"text":"Great vibe, fun atmosphere and food was great!  The pancakes are the bomb!!  The mimosas a","useful":0,"cool":0},"-kjgXHgml27Baq5Z2pfr-A":{"text":"Awsome.\nYou took care of my hangover with as good breakfast, and damn good coffee. \nWait s","useful":1,"cool":0},"nu84pRQoxPa-3vh8vkcdsA":{"text":"Really good breakfast! I had the bacon infused Bloody Mary and Hon had the Brandy Milk Pun","useful":0,"cool":0},"y1unjOoQmNfAPlSwcDjwJA":{"text":"The food was good and the service was great. They were extremely busy so we ended up waiti","useful":0,"cool":0},"8ItEfjjM0jSePJhkHjEQig":{"text":"Food incredible we sat at the counter. We had great service. It's a definite breakfast sto","useful":0,"cool":0},"xUMghRuovx-lBVYyAcV3vQ":{"text":"Simply amazing breakfast!!! We ate here several times during our trip to NOLA. I'm pretty ","useful":0,"cool":0},"AFu5mAKlfznvKi6tmpXTRA":{"text":"LOVED this place! Arrived early, sat at the bar. Waitress was GREAT! So friendly, down to ","useful":0,"cool":0},"36teRGc0aSsW-NyK_3DpTw":{"text":"The food was AMAZING!!! I had the Peacemaker (which you can choose two different or the sa","useful":0,"cool":0},"aF3dbKuDdAgwHGcXZR18Bw":{"text":"I can't even get out of the restaurant before writing this review! This was an awesome exp","useful":3,"cool":1},"DTO4Qf2BGnYA46Cmp_5LdQ":{"text":"My wife said, \"Best cinnamon swirl pancake ever!\" Kristin, our server was so nice and has ","useful":0,"cool":0},"rn9-0dk1rV91JI7yXH5sxA":{"text":"We sat at the bar bc it was a pretty long wait.  But the service and food is amazing!!! Th","useful":1,"cool":1},"RsN1PdDjT0hIv0Te5Le1Iw":{"text":"Good service, good food, omelettes really good fresh ingredients waiting time is worth but","useful":0,"cool":0},"07AMSWDkCIHH6paV_wTVaA":{"text":"Heard good things about this place so we decided to visit the day before we leave New Orle","useful":2,"cool":2},"nDevC5yX-7PkhLYfmpB8GA":{"text":"This was by far our favorite spot we ate at in NOLA.\n\nRecommendation: Add yourself to the ","useful":0,"cool":0},"o8HnogNnCiw47T9e-2qyag":{"text":"If you want to get a good breakfast seat, get here early! I arrived right after opening, a","useful":1,"cool":0},"KlDf2kWxnaqsZr7Kt0u23w":{"text":"We came here on a Monday morning around 10 for breakfast and there was NO WAIT!! I'm a fam","useful":1,"cool":1},"9wG_pAWI2lw97Tpem0jXIw":{"text":"We loved our waitress Jackie! She made a great recommendation for the grits with goat chee","useful":0,"cool":0},"t4oqeCH_blMHSWQyToBB1Q":{"text":"**Can only speak for the cocktails**\nExcellent Bloody Mary's and extremely friendly enviro","useful":0,"cool":0},"B1AoOrVr8GUxnNRRC46YUQ":{"text":"Honestly not as impressive as I expected, the eggs Beni were overdone. Then when we had th","useful":0,"cool":0},"Aamf1nJatht5laOrkM15dQ":{"text":"We love love love the Ruby Slipper! Food is always fresh and tastes wonderful. I always ge","useful":0,"cool":0},"a3MZbsjxXaNgCrcZ7Tojng":{"text":"Stopped in early on a Friday morning, and were seated with no wait! I had the eggs benedic","useful":0,"cool":0},"DMzVMtp63qwberwYEyY8rQ":{"text":"We had breakfast here on the last day of our trip in New Orleans, we did a quick search an","useful":0,"cool":0},"ImAFyM-Xd7EjCTUiYJAQOg":{"text":"Great customer service and amazing food! We were seated (party of 20) within 20 minutes. W","useful":0,"cool":0},"4k_R6iUDsPDLcuhiTSf1yw":{"text":"Came in hungry followed with reviews to support a satisfying experience...outside the wond","useful":0,"cool":0},"JWQjb-h7G1_ZAvBaqUhE7Q":{"text":"Awesome breakfast!  I got light migas but the options were superb for whatever you feel Ik","useful":0,"cool":0},"1MHUhQGCFs-W3oKmKNIRoQ":{"text":"Guys this place is not good. \nMy husband's order: soggy bread and chewy corned beef\nMy ord","useful":0,"cool":0},"ieqh1icRZc-_YevxybXgDQ":{"text":"Arielle was an awesome server! She was knowledgeable, friendly & energetic!! Food was exce","useful":0,"cool":0},"iAQ3Mb59Ab1LspkFgRFKqw":{"text":"Best catfish egg Benedict I have ever had. Make sure you go in the afternoon to get sat be","useful":0,"cool":0},"Gg79Zy8i6do2Q0ASqfRU0g":{"text":"Very cool place! I went to the one on Decatur. Great atmosphere, great service, great food","useful":1,"cool":0},"tZX00BwMyjm1GdmBcejdNg":{"text":"We got the eggs benny and we weren't impressed. We originally pick the 2 Benny to share an","useful":0,"cool":0},"TwxKMQE2ReriC_4tiAqmIg":{"text":"While visiting New Orleans for the first I was quite surprised by the quality of food and ","useful":0,"cool":0},"GZBL4O9r9B3ib_teOF5QiA":{"text":"I had a great experience with red ruby slipper cafe. The only problem I had was the the be","useful":0,"cool":0},"FewiZG1gfcWMltWZkzxk0g":{"text":"Great food, long lines, guess that's how you know it's a must visit. Food did not disappoi","useful":0,"cool":0},"wrEecoC78CAbZeZnnNrLwQ":{"text":"This place had a really long wait but they allow you to put your name in line over the int","useful":0,"cool":0},"Wfz2XEQOrdCq7Qign2ZQxw":{"text":"Arielle was AMAZING! She was so caring and exciting. Gave us a lot of recommendations for ","useful":0,"cool":0},"ME3DtHxiT8DkiFX12VOvvA":{"text":"The Ruby Slipper Cafe was amazing! Our servers Jackie & Theresa were very friendly and kin","useful":0,"cool":0},"YHk_iH6YDYlCrZrNXrzoiw":{"text":"Juane Evans and Ms. Theresa were the best! The food was so bomb. If you come to NO, you ha","useful":0,"cool":0},"ZS6ZKD1EQLFblIPASw6n-Q":{"text":"We had breakfast on a recent trip and the food was so good, we went back again two days la","useful":1,"cool":0},"L8zy3CycmZS_7Wh7F-WqVg":{"text":"Took the kids to have breakfast here while visiting Mew Orleans and I gotta say it's not t","useful":0,"cool":0},"9pnZZtNfS2slds2YstpV-g":{"text":"We came here right before we decided to go to the Saints vs. Atlanta game. Luckily, we did","useful":1,"cool":0},"eN_V16Hb7JNKPlqYAB68UQ":{"text":"WOW. My girlfriends and I had brunch here and it was everything I had hoped it would be. I","useful":3,"cool":0},"fpeHTi5hWPQJWDmvRiLW4A":{"text":"Loving the many Eggs Benedict options at the Ruby Slipper. Shrimp Boogaloo - because, hey,","useful":0,"cool":0},"sasJu3naLHBhRURY6P9m4A":{"text":"Hands down the best Breakfast/ Brunch place I have visited.  Came 2 days in a row and ever","useful":0,"cool":0},"toauqnJfxB_oC9u7mOfrAw":{"text":"It's a must if you're in New Orleans! If you like Eggs Benedict, you need to try the Trife","useful":0,"cool":0},"_ohm3b-Cg3C-5aOabTazFg":{"text":"One hour wait and well worth it!! Teresa was fantastic! The food was so good it nearly kno","useful":0,"cool":0},"8VefqiIJlpq4CoQ9ClACig":{"text":"Fast paced and friendly. The eggs Benedicts are great, portions are filling. The stuffed F","useful":0,"cool":0},"5y3OWRpJu_enX9kN_X8z4g":{"text":"Delicious!!!! The Bloody Mary with the Bacon Vodka was so tasty. Order The Peacemaker and ","useful":0,"cool":0},"R2V8hU_XO3ZJ_S_OXeYzxQ":{"text":"Excellent breakfast! Be sure to get there early, this is a popular spot so there's often a","useful":0,"cool":0},"YHROVPgIb4mIc393oAPM3g":{"text":"Came for brunch around 11:30/12. Best to do the waitlist ahead of time as it was a popular","useful":0,"cool":0},"MwFCq-nvlfGfwIPJ3kNs6Q":{"text":"Everything was sooo delicious!!! Tried the peacemaker with eggs cochon and the bread puddi","useful":0,"cool":0},"Frs3ydZ4AtzaCdzmYAnNTQ":{"text":"The Ruby Slipper - super dope. Great brunch spot with a cooperative energy and top tier bi","useful":0,"cool":0},"WTFcLWeWIf-JOjlXjTUU5Q":{"text":"If you want great food come here....And you have to have Jackie as your waiter!!! She gave","useful":0,"cool":0},"OXH566oz7IN2VZXZpij3Mg":{"text":"The food was absolutely amazing! After looking on Yelp and being disappointed by lackluste","useful":0,"cool":0},"rT71zrpXkHLfKqkOflk03w":{"text":"Our food was great. Our server, Arielle, was plso great plus very helpful & timely. We wil","useful":0,"cool":0},"e8d48DlBoUCgJs4f_XvMRA":{"text":"Waited an hour then they skipped us and seated another party and did not care or admit the","useful":0,"cool":0},"VssZAtj2Bt5Fqn_vRLArgA":{"text":"Great service and awesome food.  Also ability to use NoWait/Yelp was a huge time saver whe","useful":0,"cool":0},"13iKFYispaf4KtRB9R5S1w":{"text":"Great place for breakfast if you're staying in or near canal street. Delicious breakfast i","useful":0,"cool":0},"euLBNAfnSaYN5yNA2x1HMw":{"text":"Terrible service from Lizette and food was just ok. Eggs were cold. Biscuits were hard. Ve","useful":0,"cool":0},"530P1MXqiwzkEyMApoXvAA":{"text":"Amazing yummy brunch spot in the French Quarter. We were able to join the waitlist ahead o","useful":0,"cool":0},"8G-GqMxgtVGoZDiOPuh2xg":{"text":"Amazing bloody! Pickled green beans garnish on the bloody are fantastic. Highly recommend ","useful":0,"cool":0},"z6ej5-y1ZBsPhIAs3jmSwg":{"text":"Food was  good, so was the service.\nThe only negative  I have  is after a thirty minute  w","useful":0,"cool":0},"n6MYx3ct3Z9QFMXoQJNiSw":{"text":"The wait was a little long for a table to become available but it was completely worth it,","useful":0,"cool":0},"CTmy8HGGBh3L1B_GTajJrA":{"text":"Food and service here are amazing. Drinks are perfect and large. It is an absolute must-vi","useful":0,"cool":0},"h-U-d62bqnf1B8i_93jOtA":{"text":"This is probably one of my favorite places to eat. The location in the French Quarter on D","useful":0,"cool":0},"IJ3PhGqB6XwaPpQ5H5keMg":{"text":"Theresa our bartender and waiter was phenomenal!!  Her conversation, smiles and knowledge ","useful":0,"cool":0},"pgM3epjKBKfo5_Axx_uE_g":{"text":"Touristy and food was not that great. It's average breakfast food. Bloody Mary was good an","useful":0,"cool":0},"mfPXM1Q7EIo54dfU_Kb3Bg":{"text":"This is my favorite brunch spot! I brought my Alabama family here for brunch because they ","useful":0,"cool":0},"1D4rsMKv7Lz2W88jRscbVg":{"text":"This place is popping. We came here towards the end as they were closing (which we felt su","useful":0,"cool":0},"WLyhztLQFTqTItZIAbtVfQ":{"text":"While the line was a bit long, it was for a good reason! The Ruby Slipper was warm, hearty","useful":0,"cool":0},"RgyYBQmCzqvJdFzmyg8j3w":{"text":"Stopped here for breakfast during a visit to NOLA and it did not let me know. I had the sh","useful":0,"cool":0},"xn-iacDhvIA1IWv9HO590Q":{"text":"We went there because it was recommended, I ordered a fish of the day plate it was good ju","useful":0,"cool":0},"wCGgrIBrFEGbNQlSZqhS9g":{"text":"Worth the wait. We had the peacemaker. One fried chicken and one shrimp. It was perfectly ","useful":0,"cool":0},"-7mTohLVfeVYtFNxdlhmxw":{"text":"They proudly use fresh,  seasonal and local products whenever possible.   Cinnamon swirl, ","useful":1,"cool":0},"s9VcuNTeZtHj1ZLKlrfthw":{"text":"Definitely worth the wait - make sure to join the Yelp waitlist to save some time. We went","useful":0,"cool":0},"5t38c9NdBg9BW5sVIzypPQ":{"text":"Oh my! The special king cake drink was amazing. Everything looked and melted delicious. Me","useful":0,"cool":0},"_1EyBNkIqcjQW_cPG2udig":{"text":"As a New York Native And a Seasoned traveler. I've had some of the best food Money can buy","useful":0,"cool":0},"fHNysTH0Bbr6aONMRG4ByQ":{"text":"This was our favorite breakfast in all of New Orleans. The pork Benedict was amazing! We w","useful":0,"cool":0},"UCqbkN7JReBcNlKAskyKGw":{"text":"We thoroughly enjoyed our breakfast at The Ruby Slipper. They have great bloody mary's and","useful":3,"cool":2},"_vnvJAH0yTVsu_sCwxwVGw":{"text":"We spent the weekend in New Orleans and wound up going here twice! We loved it! The food w","useful":0,"cool":0},"sPZG1B-wWPLJOSO_9ivW4g":{"text":"So many locations in New Orleans. Hands down one of the best brunch places to visit. They ","useful":0,"cool":0},"kK-9fUEUBQbQNa1ses4-eA":{"text":"Excellent food!!! HOWEVER, service is seriously lacking. Waited over an hour to be seated ","useful":0,"cool":0},"y6FVbvBhtNQ5A0YKReMlBw":{"text":"A classic, when in Rome! And well we were in New Orleans :). The portions are very plentif","useful":0,"cool":0},"nK9vF8oJ4hcJLC98xvKZsQ":{"text":"Popular joint! If you can make reservations I would consider it. The food was really good ","useful":0,"cool":0},"iD2iTS1FpeRlKtNem64a2A":{"text":"I dont even know where to begin with this review. The wait was sooooo worth it. Our barten","useful":0,"cool":0},"wP-r8wxhJM-znm0vraeRAQ":{"text":"What a great way to start my visit & say \"Welcome to New Orleans! The restaurant was a sho","useful":0,"cool":0},"3ENgmXsMVnM_zlpmCKAV6g":{"text":"Ordered eggs Florentine, delicious!!!! Service quick and very friendly.   Recommend joinin","useful":0,"cool":1},"8Y_7t8y52kMwD6Kj0ARuMg":{"text":"Definitely recommend!!  Eggs Benedict and mlmosa were so tasty.  It was packed but got a s","useful":0,"cool":0},"Wvm6-IBy_vxBiG1vKTc8Uw":{"text":"Was in town on business and looking for a great breakfast place. The food was really good ","useful":0,"cool":0},"b1RY_puAuVxaYiuak-X2zw":{"text":"Jacquelyn and Emery sitting on a tree k-I-s-s-I-n-g!!!! The best servers ever!!! Great foo","useful":0,"cool":0},"EwocvtDL_WcXadL6NyMLgA":{"text":"I went here with my husband at 8am on a Monday and there was no wait to get in. The servic","useful":0,"cool":0},"OVsApXorUbM74aQyHYNuFw":{"text":"What can I say , amazing place , amazing food and amazing service !!!!! I would recommend ","useful":0,"cool":0},"za9ErDEFLKhjSwmQuUQ4kw":{"text":"the only reason for me giving them 2 stars is because the latte was good. but after waitin","useful":0,"cool":0},"ZF9bQNKmGhH04Gi53YGAYA":{"text":"I decided to try the crispy chicken sandwich which was pretty good. The bread was good and","useful":2,"cool":1},"Cug8XHrAchx3TBgGdXkKQQ":{"text":"Listen ... this place exceeded my expectations. Ever been to a restaurant, start getting f","useful":2,"cool":1},"Id9jAQZINVIiBOYCSWou8Q":{"text":"This small gem is amazing!! The staff is super friendly and the food was great. Everything","useful":0,"cool":0},"8yD6LejZC2ygwMO5IKWjwg":{"text":"Arielle was the best ever! Loved the restaurant! Had so much fun with friends and she made","useful":0,"cool":0},"3m1lEWBynEKU5jJIf-8OFw":{"text":"The atmosphere was deserving of five stars on its own. But the food. Was. Amazing. We had ","useful":0,"cool":0},"plNNlLRaRL3AC4sJPgml6A":{"text":"Wow! Words really can't explain how good this place is. The best pancake I've ever had in ","useful":0,"cool":0},"6K5VW6mC51Cg0VGW1GYRnw":{"text":"got a recommendation from a local to come here for breakfast. The atmosphere is warm, the ","useful":1,"cool":0},"Bt-scr8TtNKpaOYdFL_pkA":{"text":"Excellent food and service. Everything on the menu is amazing! We ordered several plates t","useful":0,"cool":0},"94sSwwswyFAhmd0xkaokNQ":{"text":"With reservations, there was a wait to be seated. After waiting an additional 30 minutes w","useful":0,"cool":0},"7j_yhogi68r4PJcof_SRMw":{"text":"I must say that after all the hype I was very disappointed. I would recommend a place a co","useful":0,"cool":0},"cB1fP-XZ2DUfEPQoGvrjvQ":{"text":"The food was good both times we went during our visit. Wait staff were fairly friendly (we","useful":0,"cool":0},"FJw6GizUZ8Zw-O-gqnmvjA":{"text":"Eh. Not worth the wait. \n\nGiven how popular this place is, we decided to wait 30-40 min to","useful":0,"cool":0},"EUsJije0dDn7ZTtG86iY3g":{"text":"I was looking for a great spot to have brunch before leaving NOLA when I looked to Yelp fo","useful":0,"cool":0},"WZp4yMY7nqRhX3yyNaTXpg":{"text":"Came here with four other friends and we were soooo glad to finally get to try the food he","useful":1,"cool":1},"7Zdz20Pv2YNlH2PWCEeghg":{"text":"This place is so amazing that I went here for 2 breakfasts during my 4 days in New Orleans","useful":0,"cool":1},"e9BAscM2IQN60VY40VW_aQ":{"text":"Excellent brunch!  Be sure to add yourself to the wait list from Yelp when you are on your","useful":0,"cool":0},"aJbB_3L_LQnoWNf0eCUveA":{"text":"Went Sunday morning for brunch. Some of the best Pancakes I ever had! Sat at the bar and r","useful":0,"cool":0},"gvl21bgd6t7lzwCGp02JBg":{"text":"We were in NOLA for a total of 4 mornings and 3 of them were spent here. When I say they h","useful":0,"cool":0},"YqCFamPyk_PJG_ewo57DAQ":{"text":"Celeste our waitress was fantastic to start!! Our breakfast was excellent!! We had the egg","useful":0,"cool":0},"7QB4z0m--VasZG0A6KGghg":{"text":"Arielle was an amazing server. The coffee cocktails and brunch rocked!  Order the Skinny M","useful":0,"cool":0},"TYvJ6iTJRbg-yrH6zNYR-A":{"text":"Ruby Slipper Cafe was a highlight of my New Orleans visit. I HIGHLY recommend using Yelp t","useful":1,"cool":1},"Bk3phO1amEBjBNeoxw4KTw":{"text":"After eating there this past Sunday, we couldn't help but return on Monday morning!! Ariel","useful":0,"cool":0},"8Md9ti_SLVOUbFumtnkl_g":{"text":"This was the best breakfast I have we've had!! OMG. The bacon was perfect. I can't decide ","useful":0,"cool":0},"qsbUPfIzLRoTOVNEFiOF-A":{"text":"In From out of town. I yelped the places around my hotel and found the Ruby slipper. I ord","useful":0,"cool":0},"EXkXZGrAkbxUDfm5qQf3Bw":{"text":"We love to eat at Ruby Slipper any time we are near one. They never disappoint. From the m","useful":0,"cool":0},"zaUnzmzkgRInSBULWmWKEA":{"text":"This is our favorite breakfast place in New Orleans. We have been to all three locations i","useful":0,"cool":0},"KDDH7mIQTs4-JgnRqnfv7w":{"text":"We had breakfast here for the past two mornings. Outstanding food. My hubby is not a break","useful":0,"cool":0},"CaNyVl-NFSuKXsRiiHllcg":{"text":"On our last day in New Orleans we visited this breakfast spot. The decor is super cute and","useful":19,"cool":13},"v0peh1Htu_2cE5d3G-FDGg":{"text":"Absolutely delicious food. Croque madame was !best version I've had in a long time. Biscui","useful":0,"cool":0},"zoeADZVJ5hgxuRZBVq6lrw":{"text":"I had the Southern Breakfast and the biscuit was huge and fluffy!  Topped it off with a ho","useful":2,"cool":0},"4J9LrBNANZGgpX_TzwOrVA":{"text":"It was a 1.5 hour wait, but once you're in there it's your time to shine. Their pancakes a","useful":3,"cool":2},"9AIEJqq8XAwYzQ-YBHGCMQ":{"text":"Food was great. I put us on the wait list through Yelp and only waited about 5 min when we","useful":0,"cool":0},"3NBKc-vRugomN5r1zxkEmg":{"text":"Had an amazing brunch! \nGood choices of breakfast eggs, coffee and juices. Refreshing ambi","useful":0,"cool":0},"XNwWGWcM0LgHR45VXWapZg":{"text":"Excellent.  Great service.  Food was delicious.  Highly recommend!  I had the grilled fish","useful":0,"cool":0},"7GC4FYRa3m13--fTO94ViQ":{"text":"Absolutely fantastic breakfast place. Recommend waking up early and getting yourself added","useful":0,"cool":0},"B0tMOMDWQJKWp95K_kecJQ":{"text":"The food was great! The staff was wonderful. But the place was freezing. Everyone in the r","useful":0,"cool":0},"gb4HHkZedooHSZ1Xu3rD6Q":{"text":"All of the food was absolutely delicious!! Our waiter was polite and kept our drinks full,","useful":0,"cool":0},"kkjpHRrHeIrBCqvndUaD4g":{"text":"Best breakfast in the city!   We eat here every Sunday during saints season!  Great staff","useful":0,"cool":0},"VI5Kg5AOgFroPoHF_F9BcQ":{"text":"Spending a few days for Christmas at my old stomping grounds in NOLA bf living in Fort Wor","useful":0,"cool":0},"wbGZh8J7iKhbqiRbtqOtqg":{"text":"I added myself +1 to The Ruby Slipper's waitlist through the Yelp feature.  We arrived and","useful":0,"cool":0},"PEiD3MXpypqBqlcNv4vOMA":{"text":"There's always a line and for good reason. We ordered the Skinny Migas, Croque Madame, Cin","useful":0,"cool":0},"kYKxjaiswAwmaCamvrqBjw":{"text":"During our trip, we took many pedicabs, and we asked every single driver, \"Where is the be","useful":0,"cool":1},"xiQY6uFD8DjdnSd9-LGX1Q":{"text":"Fabulous place for breakfast, brunch, lunch in New Orleans! (Closes 3pm.) I love the one i","useful":0,"cool":0},"ETEtl8_lVhvhIAqy78onEQ":{"text":"I was really excited to try this place as the line was literally out the door. It's right ","useful":8,"cool":4},"otMZU34b1pYgWhHS-qqpJA":{"text":"\"There is no place like home\" :) I needed to come to this place that talks about the desir","useful":0,"cool":0},"6VjAIo6fFONKQM5u5S3xcg":{"text":"Will definitely return. Loved I could add my name to the wait list through Yelp. Was able ","useful":0,"cool":0},"VaBdkDIRRmxB4aJwpYoAKA":{"text":"Everyone in NOLA has probably told you to visit Ruby Slipper..... Listen to them!!! Ruby S","useful":0,"cool":0},"N792Cx_wFFMuTW4KVPDxQg":{"text":"Amazing!!! The food is delicious the drinks are tasty and the service is excellent!!! A mo","useful":0,"cool":0},"2T9zNQQAyc1EHap8Ra3JQg":{"text":"Came around lunchtime on a Thursday and it was very busy.  The service was attentive despi","useful":1,"cool":1},"ALAI34PXPmcLGifojDLqmw":{"text":"Had breakfast here. Such a cozy, qauint atmosphere. The food was great! I had grits that w","useful":0,"cool":0},"5sUbGl7SN66-XsxbjuUM6g":{"text":"Great service and great food!    You do have to wait but the line moves fast and I love th","useful":0,"cool":0},"-jgYbWiAllONv5hIPC2IdA":{"text":"Cute little place for breakfast.  Really good shrimp and grits as well as iced NOLA coffee","useful":0,"cool":0},"C3KhlEEQNNKnohChDSGOqg":{"text":"The wait for a table was long but we checked in ahead and cut that down. The food was AMAZ","useful":0,"cool":0},"t19A0pO3GHn9KWw8YARujA":{"text":"It was good but not great and that's a problem with so many nearby French Quarter restaura","useful":0,"cool":0},"PpqHi6K6MzSDLFks_-y9iw":{"text":"Pretty busy restaurant. The good thing is that you can get into the waitlist through yelp.","useful":0,"cool":0},"eoq69kX7omqkUCNYBRyFhQ":{"text":"Not really sure how to rate this place since they weren't open for business. Supposedly op","useful":0,"cool":0},"aoFM2nMnBQmqjctZUc_B2g":{"text":"Everything was Delicious except for the Grits.  They were just ok.  We ordered The gulf fi","useful":0,"cool":0},"0c9_xwXQWCU95BrIMMFVtA":{"text":"Great friendly staff. The eggs Benedict with pork was fantastic. I did t care for the shri","useful":0,"cool":0},"TtPRmIYBG4EQX90Al4WjLA":{"text":"Our plane got to New Orleans pretty early so we couldn't check in to our hotel yet so we w","useful":0,"cool":0},"9umO4Hz0nbWQJmJ5vKV3pw":{"text":"One of the BEST breakfast spots I've ever been to in my entire life. To make sure it wasn'","useful":0,"cool":0},"OpQKM71ls7KNISCu4HjBAw":{"text":"Loved it. Went two times. I put my name on list to avoid waiting outside for 85 minutes. T","useful":0,"cool":0},"azOAbUUYCGbdhATzCNz9Yw":{"text":"Came here for breakfast, I had The Peacemaker with Eggs Cochan and Chicken St Charles. The","useful":1,"cool":0},"eBMdOOEaXGvkE_A-p_p_Hw":{"text":"Our daughter, who lives in NOLA, recommend we try this place as it's only a few blocks fro","useful":0,"cool":0},"cQdgCmsMjwaiAp0bPXSOBg":{"text":"Best NOLA authentic food place.  Good portions, awesome taste, great mimosas and excellent","useful":0,"cool":0},"pYrHQXXQV9qFka_O9r85Hw":{"text":"After 4 trips to NOLA, I finally had the chance to try the Ruby Slipper. I came around 8:1","useful":2,"cool":1},"Z0hgibvy3cfDZmvvBGIEAQ":{"text":"I was slightly hesitant to try this place out just because it's a local chain but I was ve","useful":0,"cool":0},"pirYkdmTR5ooOxEvcsHCeQ":{"text":"Food was really good! I had the skinny migas. Their specialty mimosas hit the spot too. I ","useful":0,"cool":0},"jnFH76PxsFS2Ozo3nUOhoA":{"text":"What a great breakfast place. Various locations in the NOLA area, this was a phenomenal br","useful":0,"cool":0},"QZ8GHn79n3_j2wwNiqlOQg":{"text":"This was probably our best meal in the 5 days we spent in New Orleans and yes they serve a","useful":1,"cool":2},"xsJLcLZnxxifDRLLFbTl8A":{"text":"Was looking for a place with some gluten free options for breakfast, and found this place.","useful":2,"cool":1},"4Jhj3IXnWlfxwLJfTIDq0A":{"text":"Just go while in New Orleans.\nStaple of the city. Long line  but it moves fast, the staff ","useful":0,"cool":0},"9Dax2PYQqNdfR8iXzog3Yw":{"text":"Put you name in online. Super busy but super friendly! A server asked if we would like a d","useful":0,"cool":0},"VhZB7nk5BxvWLHm3hPn2Cg":{"text":"One of my very favorite places to eat while visiting New Orleans. Try the seasonal French ","useful":0,"cool":0},"C29FfFf9pFiusuhG3s4ghA":{"text":"We travel with a pack who have a wide range of allergy issues, gluten, lactose, no spicy t","useful":0,"cool":0},"s8PJlYp1bDXBvQyHLa3VTA":{"text":"The brunch spot is the perfect way to start your day I enjoyed my meal and the waitress wa","useful":0,"cool":0},"AkLnnbqMmuRdq758sLow_A":{"text":"this place did not disappoint! our group was struggling to find a good spot for food and R","useful":0,"cool":0},"vhK8tBSSNpTP-84pcIbULw":{"text":"Food was amazing - well worth the wait.  Our server  Arielle was great.  Going back a seco","useful":0,"cool":0},"WJ8Ln3DQ-eRxk8wfrYXYyA":{"text":"Great service and friendly staff. Their white chocolate bread pudding pancake was amazing ","useful":0,"cool":0},"br-xS_Vaj5c0Fe60PFloSg":{"text":"The eggs Benedict were delicious--I wish I would've stayed with the first choice but when ","useful":1,"cool":0},"-jPvKfUVH_jVLvPnCDQ1UA":{"text":"Terrible service. From someone who's in the hospitality industry, highly disappointed in a","useful":0,"cool":0},"_NA6aVcUDVvGobqR4G-nIw":{"text":"This place was amazing! I sat outside it was nice weather and i got the peacemaker! It was","useful":0,"cool":0},"UAOXwY-WS1y_o-VAiInWQg":{"text":"Completely enjoyed our breakfast.  I ordered grits with my omelette but got potatoes inste","useful":0,"cool":0},"xrilnilCKynzO6VJBZtvZg":{"text":"We come to eat here every time we're in New Orleans. Absolutely love this place. Food is g","useful":0,"cool":0},"Zq9cMnlW5W5qsFWzywSGWQ":{"text":"The food and mimosas was really good. Loved the atmosphere. I will definitely be back! Jus","useful":0,"cool":0},"bhblKhdFf_7LhTEflBzMrw":{"text":"Fantastic breakfast, we liked it so much we went there three days in a row.  The online me","useful":0,"cool":0},"ZFQic3gh6P_7tFZ-NDNBTw":{"text":"Very good food. Everything our table had was great. Try the fried green tomatoes at breakf","useful":0,"cool":0},"n9-ZYqSKw7ceG58U3o-cYA":{"text":"Food was ok, a bit over priced. Coffee was strong which was good. The wait is not so bad i","useful":0,"cool":0},"JWzOwbXnLN2b2lL29r_25Q":{"text":"Ruby Slipper Cafe is mine and my wife's favorite breakfast joint in New Orleans. We especi","useful":0,"cool":0},"sQaXkSZUZR78aUUV5l6ItQ":{"text":"Some of the best food I have had in awhile!! Great service, great food, and great drinks. ","useful":0,"cool":0},"9P5FYUfwcAcTbWBKVcK4MQ":{"text":"wowowow. I'm not even a breakfast person and this place has me thinking about their eggs B","useful":0,"cool":0},"ou4bswEqOC-zN9Yq9bvsWQ":{"text":"My Partner and I came to this diner on our way back from picking up our new Iphones from M","useful":1,"cool":0},"fmv_rT5c3Kj5ci0SZMIoZA":{"text":"So good. The Costa Rican is amazing. Honestly everything in the menu is fantastic. The Pan","useful":0,"cool":0},"T6i6KkrncKAGNB84T8Xllg":{"text":"This place was recommended by our Uber driver and it did not disappoint! The service was r","useful":1,"cool":1},"ZTNnYTNeiSXBjGZEFt-h6g":{"text":"Loved everything about this place!! Great food, great drinks, amazing service! Our server,","useful":0,"cool":0},"MUcJ2LeegS1xtRgjVBhmjg":{"text":"So it's been two weeks since we left NOLA and let me tell you, we definitely saved one of ","useful":2,"cool":2},"DJExCJBcxPfIkF5h-wboMQ":{"text":"All the 5 star reviews are spot on. I had an omelette with bacon and a biscuit and let me ","useful":0,"cool":0},"EWiS6CTwEQZ2OO4DDfxiMA":{"text":"I only realized halfway through my meal that I forgot to take a picture. The food came out","useful":0,"cool":0},"LjF_XMEQDOeu6ttiFEya2g":{"text":"Ruby Slippers was well praised by many people, so I was excited when I saw the wait time w","useful":4,"cool":4},"v2LzZsng-ZDGc-Ep4OysbA":{"text":"Everyone should eat here while in New Orleans - probably the best food we had the entire v","useful":0,"cool":0},"fFmn9oZViBtJepxcDx5xdA":{"text":"Make a reservation ahead of time! You can even do it on the yelp app! Even though there wa","useful":0,"cool":0},"HzHoTa63cYKJ2vLxZZB95g":{"text":"This is my first Yelp review because Jackie was so freaking amazing! You want superb perso","useful":0,"cool":0},"smJjzgD2ULGhfpL-IoxkBw":{"text":"I went back Sunday before leaving new Orleans and it was great. Sat at the counter. Got in","useful":0,"cool":0},"aKKcghHJXJ-NGsRUBzckzA":{"text":"The service here is top notch. From the hostess to our waiter and the rest of the staff. M","useful":1,"cool":1},"6H50TZtL7d-ST-9Mq9GRCw":{"text":"This restaurant is definitely for meat lovers. While I am not knocking it but if you are v","useful":0,"cool":0},"c3LBiSCErA6mIwBqUhBOWw":{"text":"Been here in year's past and it was excellent. This trip not as much. Got there at 7 am to","useful":0,"cool":0},"CfPjaW72GR-1_4bP_GYWRQ":{"text":"Very good atmosphere, hamburger very juicy, just a little pricey but that's New Orleans.","useful":0,"cool":0},"igpKa8jdqteuviJoCwm9Pg":{"text":"We had the best time at the ruby slipper, our waitress Nicole was so nice! She made us fee","useful":0,"cool":0},"6ZuB0YeVFxZG6a_g3BfsPA":{"text":"Huge portions! Very good food and great service! Does get a little pricey when you add dri","useful":0,"cool":0},"sR2IhK_dwlqKYh3lfstOkQ":{"text":"I was able to put my name on the list before we arrived so the wait time was only about 5 ","useful":0,"cool":0},"A6rdSzm2weW1GPu3l2-KAg":{"text":"This restaurant has the best breakfast. Service is fantastic. Wide variety of menu items t","useful":0,"cool":0},"pLQ4rqNS54uJ9XwbrkCXvQ":{"text":"Nice little brunch place in the heart of the French quarter. Great for a place to go befor","useful":0,"cool":0},"afsoXx5A6YtEZh2mCMBnNg":{"text":"Came here 2 days in a row so obviously a new fan!\n\nWe went to Decatur location. British (t","useful":0,"cool":0},"aS0aEGAuhF461BwIpeSPJg":{"text":"Bangin' brunch. Well worth the (eminently reasonable) prices.\n\nGot a nice selection of all","useful":0,"cool":0},"0Ag3UWSZgbbQPtynD2XKBg":{"text":"Went for brunch. Worth every penny.  Make sure to stop by early and get on the wait list b","useful":0,"cool":0},"uTConKi6nMiYFBH4-knFgQ":{"text":"This place is amazing!! And Norman is the best! My boyfriend and I ended up eating here tw","useful":0,"cool":0},"VF1-1ijHB3UORU56hY1_rg":{"text":"This place was great and right across from our amazing air bnb! We stopped here once we ar","useful":0,"cool":0},"E8gC4cvUEACfR7UUUJgylg":{"text":"Hot damn, this place was great. Great food, great coffee, great t-shirts, great service. O","useful":0,"cool":0},"sAqeig1IN-pQWazxhkYNkg":{"text":"This was my fault, I went to the wrong location while I was in New Orleans; they have a fe","useful":0,"cool":0},"aIjID2rdgYfuqgJ3CRKZkw":{"text":"Great breakfast, good wait staff.  Service was slow that is the only reason why it's not a","useful":0,"cool":0},"PcqTEoSfoE7Jhjr4KKm21g":{"text":"5 stars!!!! I had the cochon breakfast biscuit. It was soooooooooooooo good! So so good! M","useful":1,"cool":0},"WAVVsfPcSv8W0XPn3T7ZHA":{"text":"This place is awesome. Could not recommend more. Attentive service and the food was delici","useful":0,"cool":0},"obbOs3dj064Zn2a__MHbJA":{"text":"This spot is a go to if you're in town. The homemade biscuits and sweet butter just set th","useful":0,"cool":0},"3AUNIuGoWqNSusL0EqXs3A":{"text":"I meant to write this review since I visited NOLA but better later than never.  \n\nIf you a","useful":2,"cool":1},"VI4EJVEfju8QBtvVCUlJNg":{"text":"Great place for breakfast. My daughter and I sat at the bar as there were no tables availa","useful":1,"cool":0},"lW4Dz5YHlGdKUQG7t5l6pw":{"text":"Found this gem for breakfast. Wait was looonnngggg! We joined the waitlist online but was ","useful":1,"cool":0},"4zPWOZ5OGOG8RmpD3pst8w":{"text":"Rating: 4.8 Stars\n\nThis place is fantastic. I only had the privilege of attending once, bu","useful":0,"cool":0},"SM0Qu7fQ_ESTXLHs3Nft1w":{"text":"Everything was perfect. Food, Service, Location. Now this will be a stop we have to make e","useful":0,"cool":0},"drv_8QBJFxwgJ-VkxMRExQ":{"text":"This place is great the food is out of the world and the people are fun it's a must  go if","useful":0,"cool":0},"r8Lm31UR_ZEs1w0h7PH3MA":{"text":"Awesome breakfast!!!! We traveled to New Orleans in search for some good food and drinks, ","useful":0,"cool":0},"GLM_OB-jyacBe5I5uYzJEg":{"text":"Another quality experience this week at Ruby Slipper Café.    Brought two different sets o","useful":0,"cool":0},"8OzAHRAzVC5fNEXQemGKJw":{"text":"The service was great and they send texts when the table is almost ready so you have plent","useful":0,"cool":0},"bG8ljnuXUQ0-UViGwf64OA":{"text":"Great food and service.  Had the Peacemaker which is a combo.  I had the Eggs Blackstone a","useful":0,"cool":0},"BrRba6ii1FJL_rTlJpYWLg":{"text":"AMAZING! From the service, to the drinks, to the food, everything was great. You should ex","useful":0,"cool":0},"eVKEeZYePtlfS_AV7PctIA":{"text":"This breakfast was our family's favorite breakfast on our vacation...maybe any vacation! S","useful":0,"cool":0},"Gc9HMPdeMbgJ3SR1dPCFgA":{"text":"We had breakfast here as our first meal after arriving at the French Quarter and it was de","useful":0,"cool":0},"8apUwYMBjyfbdvtcHPgquA":{"text":"My gosh. Where do I start. This is one of those places that you're so amazed by the food t","useful":0,"cool":0},"o7ofT-TnO-FB5bHjVVjXTQ":{"text":"All the food was amazing! Wait was long but worth it! French toast batons were our favorit","useful":0,"cool":0},"u-8x6ePkKrSWcu0t7sTBJA":{"text":"This is my second visit at a different location and I still enjoyed it! Service is great, ","useful":0,"cool":0},"6r1NZZWEtHSZCIcjzb2OoQ":{"text":"This is a great breakfast place! Amazing food and great service. Liz was very friendly and","useful":0,"cool":0},"o8fUotZgn7AYRoEzo58b3Q":{"text":"Visited on a short trip to New Orleans.  Food was excellent.  Since it was just me I was a","useful":0,"cool":0},"ghOW1cUo40sgu1hL8AK4Bg":{"text":"The cafe is tucked away in a cute little area in New Orleans. I ordered a simple omelette ","useful":1,"cool":2},"BPB_Dl66oOeE42LT4e-Sfg":{"text":"We had all had the peacemaker where you can choose what Benedict you want. Soooo good! The","useful":0,"cool":0},"SR6EKm1AGnXC1xrfoxcEWA":{"text":"All of our food was perfect! I got the crawfish Benedict. The polenta was crispy. All the ","useful":0,"cool":1},"rGkZinBlFGneBB1UZYb-0Q":{"text":"Recommended this place by a buddy of mine. The food was amazing. I ordered the chicken sli","useful":1,"cool":1},"ohZy3vE-GWgnKShIZIq-0w":{"text":"Visiting NOLA and the food here is AMAZING!! Worth the wait and our waitress Lizette was a","useful":0,"cool":0},"_w6GEDxFkiLOQ1xyb8qXdg":{"text":"I am from California visiting New Orleans on assignment with my employer. I was hungry for","useful":0,"cool":0},"nnHmeUmDYQLAEKnfc-aiLg":{"text":"When we were planning our trip to New Orlean we were told this was a must visit location! ","useful":1,"cool":1},"74XbZKV6-Y1IOECzMSoKkA":{"text":"Great place.  Normal grits.   I like the southern breakfast but I imagine the rest is good","useful":0,"cool":0},"1_a7LeoiYhqr-tQ-d8Uwjg":{"text":"The best thing about this place is the service which deserves 5-stars! We really wanted to","useful":0,"cool":0},"quAl-xf0BVTI2Cft9vsyJw":{"text":"The Trifecta has without a doubt been the best thing I've had to eat since I've been in NO","useful":1,"cool":1},"6HtmvfTLcf7-w_Cscu69pA":{"text":"Our hotel concierge recommended this spot for breakfast which was only a 6 min walk from t","useful":0,"cool":0},"u1JCdYpLK3ZzxqjL6sglYQ":{"text":"Stumbled across Ruby Slipper when waking around magazine street. Their brunch menu offers ","useful":0,"cool":0},"WXRiWWc7nH80PFCkc7i5XQ":{"text":"A worker from another restaurant in the same area recommended this place. Since I enjoyed ","useful":1,"cool":0},"BymWtjbTTsNo-HwVVs_miA":{"text":"This was my favorite breakfast during my trip to New Orleans.  We used Yelp to get on the ","useful":2,"cool":1},"SSQzvRV78_hebRiBq3UxOg":{"text":"If you don't eat here you are seriously missing out!  Pancakes are dinner plate size and y","useful":0,"cool":0},"scqfEMRA28x8XAgOuyULUA":{"text":"I had been to ruby slipper during my last NOLA trip 4 years ago and had been waiting to re","useful":0,"cool":0},"hYYjKmPphcM7hLAKIvTkIw":{"text":"My girlfriends and I enjoyed our time at this cafe. All the food was fantastic, however on","useful":0,"cool":0},"Kc85st0Ak4dlDZIR5k36UQ":{"text":"Everything was so good!  Everyone was friendly - great service. We got there before the ru","useful":1,"cool":1},"F0ntldTAuX3MuK4EhnrI0Q":{"text":"Amazing and friendly outside dining quick service great drinks also very busy restaurants ","useful":0,"cool":0},"RlODp_1-xhzpW-7aL931_g":{"text":"an awesome southern brunch spot. be prepared for a small wait time. some of the friendlies","useful":0,"cool":0},"T0EDwaS5XGA2LjeIl5uTNQ":{"text":"So the fam and I were invited to a soft opening for the French Quarter location. I took a ","useful":0,"cool":0},"YHugii6nnqyBmayp_idAWw":{"text":"Simply put: Delicious! \n\nThe flavors all came together perfectly. Everything we tried was ","useful":1,"cool":0},"rwLwFBW-4BDNTgyDHTTuPA":{"text":"This place has great ambience and good coffee options. It is known for its breakfast cockt","useful":3,"cool":0},"A4z4F4NVlaTzIsKxgvgmrg":{"text":"Amazing Food, Service, Atmosphere and the best Mimosas. A must visit if your in the New Or","useful":0,"cool":0},"xKGUml_ThsszSC5nS5vmuA":{"text":"The breakfast here is so good. The French toast bites delicious and the Eggs Cochon wow!!!","useful":0,"cool":0},"9E8JJ64nFTUVDEJ1-Ge4Ow":{"text":"This was an amazing spot for brunch. We started with the French Toast Bites. If I lived he","useful":1,"cool":0},"EnuTI7M-Fz8b-3pdhq5HxQ":{"text":"Stood in line and then found out they weren't seating. They needed someone posted outside.","useful":0,"cool":0},"a2VfyNbnVAId4emuk1pr3g":{"text":"This was one of our best breakfast in NO. And based on the groups consensus easily best br","useful":0,"cool":0},"xy9Drbo1Bf0z-xUaYRqbhg":{"text":"Great spot for breakfast. Our server was awesome. Gave us recommendations for dinner. Walk","useful":0,"cool":0},"v6gIeVlVgXEZNW75tYqCbQ":{"text":"One of my favorite brunch spots!! I always get the St.Charles benny here. I highly* recomm","useful":0,"cool":0},"TTbXQzM0bqZ6nklEV7d8GA":{"text":"I have been eating at Ruby Slipper when I get to NOLA for years. This trip was an excellen","useful":0,"cool":0},"rhv100T1JdYTsHa0L5W8fw":{"text":"I put my name on the Yelp waitlist ahead of time and was told it would be a 30 minute wait","useful":0,"cool":0},"bd_yLrmTcIXDEngCLGPB6w":{"text":"When we got there it was a 45 min - 1 hr wait. It's worth the wait to be honest. I had a c","useful":0,"cool":0},"q4BYNEhOHqaNu7RDG5Btwg":{"text":"Just the spot you need to stop for breakfast when you're nursing a hangover in NOLA.  Hear","useful":0,"cool":0},"fO9oPywX9CtjluUsynrTiw":{"text":"I had asked three different sources for a good breakfast spot and all three said \"Ruby Sli","useful":1,"cool":0},"5WU1BcR6R7f5A_i4DCnGOw":{"text":"I loved this place! The food was soooo good. And that biscuit was EVERYTHING. I had a vegg","useful":0,"cool":0},"FtzSjU4YglZ4B-Rtj69zXw":{"text":"Expect long wait times ... I suggest to make a reservation... the food is amazing. We orde","useful":1,"cool":1},"hmQ55j5xrDhY1oB8ji8T7w":{"text":"Absolute waste of time. 3 hours in and out. Server forgot half our order and what i ordere","useful":0,"cool":0},"XgoQtcsONiwFmFRluB67gQ":{"text":"We put our name on a waitlist before showing up, I would recommend that as people showing ","useful":0,"cool":0},"4jM6GBbcHAEcd100sBFzWw":{"text":"Very nice first experience. This a breakfast and brunch place and is only open until 2pm. ","useful":0,"cool":0},"75-60byg2jldwgRuAYghZw":{"text":"Super breakfast and wonderful hostess, British. She set the tone and was a great introduct","useful":0,"cool":0},"Riw8exi6CE4v8R_EDtNDOA":{"text":"I went here twice during my week in Nola and it was awesome--even better the second time. ","useful":0,"cool":1},"v2v2sCTiJiKuw_lKDAuyVQ":{"text":"A must visit breakfast spot in NOLA! Be sure to arrive as soon as they open to avoid the l","useful":0,"cool":0},"vRgy8YOqicAvo2yVEMa-rA":{"text":"Always good food and menu selectionss.  Service I is prompt fun and courteous.  Always goo","useful":0,"cool":0},"LcnUFOW_sjYt7UUiQysuUA":{"text":"I heard good things about this place, so my boyfriend and I decided to try it. We had a ro","useful":0,"cool":0},"K257WeFAbqN-9PmT9Id38w":{"text":"This place is open, very good customer service and great drinks (peach mimosa). My food wa","useful":0,"cool":0},"hknDAoN7rvB7zkKDLiljyg":{"text":"Amazing food - had the Peacemaker with corned beef and shrimp creole eggs Benedict (went b","useful":0,"cool":0},"FSuG0mHF-Y84RZOc1yDa_A":{"text":"Excellent excellent excellent customer service! The hostess was amazing, our server was am","useful":0,"cool":0},"2JY83xuYtFNzEl8wLGDfow":{"text":"Ruby slippers is a great go to brunch place. There's tons of them everywhere So you can't ","useful":0,"cool":0},"xFDmkjF8GProsivOujzMDQ":{"text":"We just tried to go for breakfast and the exterior doors were locked. There were people si","useful":0,"cool":0},"KBHjWR5xRbUl7kcgfG25GA":{"text":"No trip to NOLA is complete with a stop to Ruby Slipper for me. I used the web link to pre","useful":3,"cool":2},"wl40btypfROiHwLU9Llr5Q":{"text":"Great food and atmosphere. I love there shrimp omelette and biscuits! They also have great","useful":0,"cool":0},"1qIpANQXxWXVQNzXgHrXCg":{"text":"Cheap, delicious food. Loved the option to scan not only the menu but also the method of p","useful":0,"cool":0},"pwNrra9Cs5JD0ixoz4CWuw":{"text":"Holy cow was this place good. Talked to an  Uber driver and she recommended it, thanks to ","useful":1,"cool":0},"ADWfaT6Ph6BP-MJvSKVoGg":{"text":"Overrated 3.5 hour wait for food you could get anywhere outside of French Quarter \nDecent ","useful":0,"cool":0},"R1PSBZXC1iXuG15OIGgXcg":{"text":"All of their locations are always jammed but you can add yourself to the yelp waitlist to ","useful":0,"cool":0},"wiEJsi8WEyHjsIskYmLmLA":{"text":"Got a great outside table shortly after arrival. They do have an online waiting list, whic","useful":0,"cool":0},"SrWPzQn9x562fco99jTlDw":{"text":"Went for breakfast this morning and was not disappointed. My husband had the Eggs  Blackst","useful":0,"cool":0},"01beOFedrqsuGvd78vTX_g":{"text":"Great atmosphere and Great food!!! You can't make resies but you can reserve a place in li","useful":0,"cool":0},"OOFyTiAvtmz2pCIVi9QMCg":{"text":"Decided to have breakfast here since it was so close to the hotel I was staying at and had","useful":1,"cool":1},"5C1rE4qjDNzqHPZyIqHsjA":{"text":"Everything was good except the regular grits..order the smoke salmon.. fish and fried grit","useful":0,"cool":0},"j0AChMZ9TGtQv9gyYWsh7g":{"text":"If visiting NOLA, be sure to check out Ruby Slipper. Food is great and portions are genero","useful":2,"cool":2},"WHRiqnT3ipNtf4bXCIabfA":{"text":"I can't say enough good things about this place. The food was great and the staff made us ","useful":0,"cool":0},"m8SdLjAKc5QP5RAtZHlYIA":{"text":"Service no doubt for me was great start to finish. I tried The Trifecta which a little bit","useful":0,"cool":1},"dzOGt1tCl5_8VVw_fs7AkA":{"text":"Doesn't look like much but it's delicious! The drinks and the fried green tomatoes are eno","useful":0,"cool":0},"ROmLYdmPAbOIjfUJvk67kg":{"text":"Don't hesitate. Just go.\nI had the BBQ shrimp n grits and the starter portion of French to","useful":0,"cool":1},"SfGr9YxN9J4GD9RMqee0Lw":{"text":"Total breakfast gem located in the quarter. Open, clean, welcoming waitstaff- one of the f","useful":0,"cool":0},"OO6Kp3dh98oIhWPgguJxlg":{"text":"The bananas foster pancakes and bacon are seriously the best things I have ever eaten in m","useful":0,"cool":0},"7Hrg2keKt7f8-XIyFwEW6A":{"text":"The service here is absolutely amazing. We went for Sunday brunch, and there were people e","useful":1,"cool":0},"azb_qDbPyUb34-P8Gnk_4A":{"text":"So if your in NOLA, you just have to come here!!! This place is by far one of the best pla","useful":1,"cool":1},"JH8FQPgFvtKhk2poP4IGZw":{"text":"Loved everything we ordered! Waitress was super nice and answered all our questions. Will ","useful":0,"cool":0},"yAB0FCoCEfmrSdBpEScTgQ":{"text":"Are you kidding me...if you are in NOLA and you do not visit the Ruby Slipper Cafe...you w","useful":0,"cool":0},"anu1KfArPa-76MGdWbfuow":{"text":"The Build Your Own omelet was great.  Wonderful coffee.  Best biscuits ever. Can be busy b","useful":0,"cool":0},"zCsEvCccw1RbMAoGbBxSIQ":{"text":"First of all, this place is a must stop for breakfast. Secondly, check in online before yo","useful":0,"cool":0},"77ph7HpU4OapAuCcNchtIw":{"text":"When I am visiting new areas I rely on locals feedback for breakfast and lunch locations. ","useful":2,"cool":2},"czxqpkwhLB2afXgi3JWsjw":{"text":"We did not realize this place had multiple locations  started off at the wrong location. F","useful":1,"cool":0},"T5xs7bAIKyOB40Js8A7JFw":{"text":"I ordered coffee and the trifecta. The trifecta was twenty dollars. The coffee had a smoot","useful":0,"cool":0},"a_jTU5bPFxZbKWkL1YQRNA":{"text":"What can I say that I haven't said before about this amazing place?\n\nDavid and I stopped i","useful":1,"cool":0},"WI8ZAGANvFXWnwQDoI4dlA":{"text":"Salmon omelette is the best! So are the mimosas. Nice atmosphere. Great waitstaff and quic","useful":0,"cool":0},"bwOJTGTZSesc-dy2q1onYQ":{"text":"Eggselent  breakfast  the Chicken St Carles and Corned Beef Hash Benedict was outstanding!","useful":0,"cool":0},"X-wB1MXGIycjIoavkjzeCA":{"text":"Ruby slipper was highly recommended by several blogs and friends. It's a must for brunch. ","useful":0,"cool":0},"N64_Sq4tIhaPf2cT7ej7Yw":{"text":"Our party of 9 arrived at The Ruby Slipper on a late Saturday morning. They were able to s","useful":0,"cool":0},"dkNw-MTk0CRBqVKR1t_4Rw":{"text":"Busy store but call ahead worked great...seated within 5 mins of arrival.  Staff quick to ","useful":0,"cool":0},"Dz1A9G855kLS4eYrQsIbXw":{"text":"The Benedict  was not as good as I expected. I think the restaurant is overrated on its Be","useful":0,"cool":0},"_xB0vT-mEmb2XzoQAimLbQ":{"text":"So to start theres a 45-1 hour wait which is fine, but when we got messaged that we were u","useful":0,"cool":0},"m1N4-GgHWZ2Z15apLgFVuw":{"text":"This spot gets five stars. My waitress was the bomb.com. I don't know how she ran so fast,","useful":0,"cool":0},"6PazJRWnEryrvv36I3hFpg":{"text":"Arielle M was an amazing server! Definitely be coming back to see her! Best breakfast in N","useful":0,"cool":0},"uvY8hKak6XwHcTpdeg6_mA":{"text":"Amazing food AND service! Sherrie T provided us with the most amazing customer experience!","useful":0,"cool":0},"mSB2D4d7gRGOiBc6ieODGA":{"text":"Food was amazing & the service by Arielle was exceptional! Would definitely recommend & wi","useful":0,"cool":0},"UK5_T8iS4GJVZ7pwiwAbzg":{"text":"We dined here during Mardi Gras weekend 2020. Due to Covid, I'm late on the review but it ","useful":0,"cool":0},"NtvjHxSkggJM6ZNWWge3Qw":{"text":"We came for lunch on Jan 2nd. We walked from hotel.\nThere was only a 7 min wait because we","useful":2,"cool":1},"DKNKJZdl3o8eG1_Hfb5I3A":{"text":"This place was delicious! I ordered the shrimp & grits. AHHMaazzZinG!!!! I mean the flavor","useful":0,"cool":0},"b8JUyQEDeyaJRDEEtt1sXA":{"text":"The food was good, but I wish there were more offerings for the brunch/lunch menu. I don't","useful":0,"cool":0},"8g7vnuemT7ElFiRVCHi9Jw":{"text":"We came here and we were quoted an hour and a half wait and the snarky lady in front told ","useful":0,"cool":0},"4dbGHdGj6mmOnwR7cu-yNQ":{"text":"Amazing! The food is great and our waitress was the sweetest woman. She was great at her j","useful":0,"cool":0},"9jroRnY5HZIjTmnFGSXMxQ":{"text":"Ruby Slipper is an iconic spot in New Orleans for a kick ass brunch. And they live up to i","useful":0,"cool":0},"vXxo5ngZ0N4F6qNedIwqmA":{"text":"Go early and there will be no wait. You can also put your name on the online waitlist befo","useful":1,"cool":1},"AtxspZ5IprsVTPLxjW6w_Q":{"text":"Amazing food ! Great customer service! Definitely recommend 10/10 ! Their creamy iced coff","useful":0,"cool":0},"jGZ_jtEMfKOhpxOkOZLg6Q":{"text":"LOVED the bacon Bloody Mary! The candy bacon is delicious, but really try the Trifecta, su","useful":0,"cool":0},"PQ3Sf-7SrWz-NZ67FnPBdw":{"text":"The food and service was phenomenal. I got the 3 pigs omelet and the home made corned beef","useful":0,"cool":0},"Mb_DgD88rAbN5Tp1r2q1wQ":{"text":"Good food and service. Great biscuits. Coffee not so much.\nPreferred to eat outside as the","useful":0,"cool":0},"vqo_HS0SM4S_m9_btD20Og":{"text":"We had heard nothing but good things about Ruby Slipper Cafe from friends who we asked for","useful":1,"cool":0},"CXiSZzbfwgNGaX3_db4SNA":{"text":"Get the shrimp and grits!\n\nWe came here for brunch, I love that this little diner has a fu","useful":0,"cool":0},"4Zhar0bWK_giZ8I8J_89kw":{"text":"Super good food. Eggs benedict is on point. Atmosphere is great and our server Freddie H w","useful":0,"cool":0},"ITHt8b1EtG61maMxhfH0Uw":{"text":"Didnt live up to the hype but it was decent.  Mimosa flight had next to no champagne in it","useful":1,"cool":0},"Df0f2qFNB1S6JkQaPJkKAg":{"text":"Breakfast was delicious.  We had a party of 10, and waited a short time for a table, but t","useful":0,"cool":0},"eK_3LKjHbMORslHoybtx-Q":{"text":"Ruby Slipper is da bomb. Christy, very genuine, not fake morning stuff. Lead us through gr","useful":0,"cool":0},"KEuAGz0CHlAjssGJIsrtyg":{"text":"The food of great. If you order online, make sure you call them to double check that they ","useful":0,"cool":0},"0BS0v7DK56bSkQWn2nIzKQ":{"text":"Definitely a must go to while visiting NOLA! Bbq Shrimp & Grits....... TO DIE FOR! Soo goo","useful":3,"cool":5},"WuD2Mzb8HL33OfbsnBNoKg":{"text":"I have nothing bad to say about the Ruby Slipper, our whole family loved it! I don't typic","useful":0,"cool":0},"9raiCIbelmM5nkQRzNj9gw":{"text":"We absolutely love The Ruby Slipper. The service is impeccable, the food is hands down, th","useful":1,"cool":0},"K6j87LYYMniiuJ3HLxBdyQ":{"text":"Recently had breakfast here when traveling thru New  Orleans.  First time at this restaura","useful":1,"cool":1},"9RcxckBCOJkOFoIsec-_Ig":{"text":"It wasn't a large place so we were a little annoyed at how long it took to place our order","useful":0,"cool":0},"Gui3Dn66X-Afev7phBeFzg":{"text":"Though a larger location of this popular brunch spot was down the block from our hotel, we","useful":1,"cool":0},"6M7SVCvP20c1j1Uhp14XgQ":{"text":"This place never lets me down when I visit New Orleans! My number one brunch spot! Thanks ","useful":0,"cool":0},"G9Y-A3HvJQzy_96-TcoKag":{"text":"Great food and even better service!! Go see the best bartenders Teresa and Varian  behind ","useful":0,"cool":0},"b-zdgYENyj9WCFHyRyXMnQ":{"text":"AMAZING! Traveled to NOLA from out of state in November and I still crave this place while","useful":0,"cool":0},"VZwXl8iAhEo1oZzQY9pcmw":{"text":"We had a terrific breakfast here on our last morning in New Orleans. Service was attentive","useful":6,"cool":2},"FlyHR0zDDVLwzE64uU1Flw":{"text":"Great food, friendly service.  I recommend getting on the waitlist through Yelp prior to y","useful":0,"cool":0},"1v5pW3lrsFikvNeOJQ2MHA":{"text":"The food is really good but service was just ok. We waited almost an hour and a half to ge","useful":0,"cool":0},"GHC4yabzgtyiFBmOEcVdOA":{"text":"Louis is AMAZING!!!!! \n10,000/10 would recommend this place. \nHe was very kind and handles","useful":0,"cool":0},"QB2QUI4tKyEYD_56PMPTcQ":{"text":"I called the concierge of my hotel and this was one of the places he recommended for a hea","useful":0,"cool":0},"TTsZTtBdOR5FK6V4Jwo5Zw":{"text":"The eggs Benedict here is hands down some of the best I have ever had! Service here is gre","useful":0,"cool":0},"AF3_Iwfi3846Wo2-JnbxMw":{"text":"Best breakfast I've had in years.  Staff is awesome, food is just as good.  Highly recomme","useful":0,"cool":0},"Wo8xzvfwr_qhuS_cR7ReYQ":{"text":"This is my number one, can't-miss spot when I visit New Orleans. I previously visited anot","useful":1,"cool":0},"mzHuUfrpILejxovHIg3j3w":{"text":"Great breakfast, better than expected. Very loud though, even early in the AM. Would eat h","useful":0,"cool":0},"VMBpJsuxmTVpDUjmyj9YKA":{"text":"Ruby Slipper is a great spot for the breakfast/brunch lovers out there - which is me! They","useful":2,"cool":2},"RVcLKcQNW-3J7xA63jjhsA":{"text":"In town for a conference and was looking for lunch.   Cant go wrong  here!  Theresa was fr","useful":0,"cool":0},"L70t9Z6ygAeniIweynbS3Q":{"text":"We timed our visit just right. Our wait was less than 10 minutes and our server and food w","useful":0,"cool":0},"6eqzwbDce9J8sWFWzDM5bg":{"text":"Ruby Slipper was one of my favorite brunch spots when visiting NOLA. There's almost always","useful":1,"cool":1},"UiwD0u3AtCru418FrFIwgw":{"text":"Busy place. Servers jump to keep up and their attitudes are great. Great French toast bite","useful":0,"cool":1},"ESQulqTKxeCOraSM3gOC1w":{"text":"Don't leave New Orleans without eating here! So good and the latte was really good. I had ","useful":0,"cool":0},"5Ceggij3fvgvsvgNoEf7YQ":{"text":"Omg these pancake were so good! Renae was awesome and thanks to Jerry for making sure we h","useful":0,"cool":0},"ip_vsgs4N81NjTkMuc3elA":{"text":"I Don't know where to start.  This restaurant was absolutely amazing and one of the highli","useful":1,"cool":0},"8OkhY_8ayIlxeZDBWmxupQ":{"text":"I ate here twice while on vacation and it was amazing! Even during Covid they have went ab","useful":1,"cool":1},"DMC3By3G5iFA4MYsly3wbQ":{"text":"Food was mediocre at best. Service was terrible. Bald dude with the beard needs a cup of c","useful":0,"cool":0},"fqafEPXn3JbNO1BgVsZrig":{"text":"This is not the location we typically visit during our trips to New Orleans, but were on a","useful":0,"cool":0},"ibF69DBQQkDVdJrYSftBlQ":{"text":"We were lucky enough to be able to dine in during early November. The service was amazing ","useful":0,"cool":0},"J46hkRCaupL_pLvGP6E8Pg":{"text":"Fantastic bananas waffles - best ever.  Very busy location.\n\nAll four people in my group w","useful":0,"cool":0},"zfql4-Ff-pQGK1kIbhGClw":{"text":"I have a sweet tooth and I have to say the Banana Fosters Pain Perdu and White Chocolate B","useful":1,"cool":1},"Tq_f7kITrkeVlJR_Drgq0Q":{"text":"Ordered a breakfast sandwich through Yelp. Arrived at the restaurant 20 minutes later. The","useful":0,"cool":0},"I83Ec93ZwFo5GhGob6PB-g":{"text":"We're not in Kansas anymore, Toto! In fact, we're in Louisiana - specifically at New Orlea","useful":0,"cool":0},"iA7CnQKPSopFWvMgFtDddw":{"text":"The ruby slipper ruined by day. We spent THREE HOURS waiting on a table. Most of that time","useful":0,"cool":0},"m-4nmQOtZjh4PSW4h0P7yg":{"text":"Doesn't look like much but it's delicious! The drinks and the fried green tomatoes are eno","useful":0,"cool":0},"VZjPn0scBDia0mvwJiwIGg":{"text":"Great breakfast! Panama City Beach Pier Park  would be a great place for another Ruby Slip","useful":0,"cool":0},"tOhZLo2nF2xRbs74waoqOA":{"text":"Popular place but unfortunately a miss for me. I ordered the Costa Rican and they complete","useful":0,"cool":0},"sv7wOnOf9zx5o4p-fFAT8Q":{"text":"This is surely the place to be, people lined up and I'm upset I didn't get to try a differ","useful":0,"cool":0},"jfY0vxe_Aly0bZVxcnCcDQ":{"text":"Great service great food !!  My husband and I split our meals got to sample some great men","useful":0,"cool":1},"lfeCXFAZsBtXwPxfMPSPKw":{"text":"We stayed at the St. Christopher's hotel just next door. There was always a line at ruby s","useful":0,"cool":0},"5Ax4L333ApFsGSxfzDr_ZQ":{"text":"I have to say the seasonal peach mini beignets were the best dessert I've ever had in my e","useful":0,"cool":0},"5g8UKULksaEqf4I5S-ac-w":{"text":"Yes, yes, and yes!!!\nThis spot was top on our list for places to visit, and it did not dis","useful":1,"cool":1},"hxh_kyWSWVh_mbI9BtqPZw":{"text":"Ruby Slipper Cafe is one of my favorite breakfast places while I'm in New Orleans. This is","useful":1,"cool":0},"J5u8xAcgOOpo7-SH8YET4g":{"text":"Local spot!  Has a pretty large menu.  The waitress was very nice and attentive.  There wi","useful":0,"cool":0},"XvV-BzLpZel17xvLQEKzkA":{"text":"We were so excited to try this place and it did not disappoint! As soon as we arrived, we ","useful":0,"cool":0},"jLR3Wc7Jp5sKNuPWB4aZRg":{"text":"Went here this morning for some breakfast. They had some good reviews so I wanted to see w","useful":0,"cool":0},"zd5IudqSGHAj2fFYws6USg":{"text":"We went to the ruby slipper cafe on magazine street. My party ordered an array of food ite","useful":0,"cool":0},"AmbSPfXaEEkzbnhHddNTGA":{"text":"Wife and I found this place 5 years ago on our last trip to New Orleans and loved it. Of c","useful":0,"cool":0},"1E8gMPC5gqQRmmN-6joIUQ":{"text":"Brandi was absolutely fabulous! The service was awesome. She has a great personality and r","useful":0,"cool":0},"QUTvlDla0KWw7AirW3xr3Q":{"text":"Some of the best pancakes and about 10 different Benedict varieties each one better then t","useful":0,"cool":0},"5QwYQ5bQUHzvvjUKiEEJ5A":{"text":"Words can barely explain how delicious this restaurant is! We've been to New Orleans many ","useful":0,"cool":0},"vakt-xkmy4aPVHTgAscBVA":{"text":"Our group was warmly greeted when we arrived and we were seated immediately! Our server Ja","useful":0,"cool":0},"4o1SlaqPnZSKRBKiKoG-yA":{"text":"Everything we had was amazing.  The bacon bites literally melt in your mouth!  The chicken","useful":0,"cool":0},"e6ZZnFQ-Wo87dg7kMpLvNA":{"text":"Everything about this restaurant is amazing- from the waitstaff to the bartenders to the f","useful":0,"cool":0},"tk97OXlhhCkkJDzpaqcxJg":{"text":"Three friends and I had Sunday brunch sitting at the bar with Jessica S. as our server. Th","useful":0,"cool":0},"9-ktff_kXpeqhkOFH1hSFg":{"text":"This was a great spot for breakfast. Although, I decided to try the lunch Reuben.  It was ","useful":4,"cool":4},"gtx0FcMy3OEwSbiniieZKQ":{"text":"Well this is where we went for our morning coffee ( an amazing Irish coffee)  we were able","useful":0,"cool":0},"smMsDxybRJ1r9IBxRUXeAA":{"text":"Love ruby slipper every-time I go . It's always crowded so expect a wait usually no more t","useful":0,"cool":0},"Hj9OXab9AkvIpSoUvYutVA":{"text":"Our food was so good my kids wanted to go again a few hours after we left! Norman was our ","useful":0,"cool":0},"4Hl2F8sMIjEFrSzEVQpgnA":{"text":"Great breakfast in New Orleans!  I had a Gulf shrimp omelette and an outstanding gin drink","useful":16,"cool":16},"K_7XaSiMHySwCPItUSgNuw":{"text":"Ruby Slipper Cafe was amazing ! The food was fantastic ! Our server Arielle was the greate","useful":0,"cool":0},"6i5TIPfJUuddEs6t2_E-DA":{"text":"Oh my goodness this place! \n\nWe were visiting NOLA for a long weekend and of course weeks ","useful":2,"cool":1},"D9GOOZ9y-JLX2oQEVmA1iw":{"text":"We loved this spot for our breakfast meal. We wanted to try their poached egg specialties ","useful":1,"cool":1},"7FsghKPrfIUIpSTnyzJroQ":{"text":"This place is amazing. Everything about it was amazing. We had to wait outside for about a","useful":0,"cool":0},"fQPeIqh8szwGCDpkr4Lbmw":{"text":"Best breakfast I've had in New Orleans \nAwesome food great coffee and amazing service. One","useful":0,"cool":0},"c_t45HfsZKbYAm3ZBjnt-g":{"text":"This place is BOMB. We added ourselves to the wait list, and after check in at the host st","useful":0,"cool":0},"ffa3_BfxApgC-B6gcd-cmQ":{"text":"Best meal I had in NOLA! In all fairness, I was here for a conference and didn't have free","useful":0,"cool":0},"t0jgUG5T_QM2uwUrzvYZfw":{"text":"Hands down- the best food we ate in New Orleans. Had a heck of a long wait on a late Sunda","useful":1,"cool":0},"8g7cQA3iUuRBHj3Okp6cCg":{"text":"Where is the southern hospitality!? Poor customer service. We were told the steamer was br","useful":0,"cool":0},"3sOzmYqGmWj5PYeGUYLrTA":{"text":"VICTIM OF QUESTIONABLE TASTE \nLord, Ru Paul would be appalled at this restaurant. It's all","useful":5,"cool":2},"CVAYyrmnnvctYV5Gx7TMyA":{"text":"Theresa and David are the best!!! All the Benedict's were delicious. Highly recommend this","useful":0,"cool":0},"I7J5gXpJ-pYjFkiVL2XkCw":{"text":"Visited one location and the wait was long so we went down the street to a smaller locatio","useful":1,"cool":0},"541R7oGyFW8RgYt-I8EfqQ":{"text":"Visited during a 3 day weekend and went there twice for breakfast. Our server MacKenzie wa","useful":0,"cool":0},"mafRZZEM_XPmjSYSIXk8ag":{"text":"You must eat here if visiting NOLA! I had the bananas foster pain perdu (French toast) and","useful":0,"cool":0},"g2Ddve_P6e2jE0GriR9v3w":{"text":"Everything felt rushed, come in, eat your food, get out. Didn't really feel welcomed and e","useful":0,"cool":0},"sBr4O_vmVksKJ1f7hn1sbg":{"text":"Fried French Toast Bites!  Do I need to say more?  Doing great job during COVID. Outdoor t","useful":0,"cool":0},"asNNrYJXJgBQ_JWYJymgjQ":{"text":"Delicious breakfast, 3 days in a row! Definitely a great place for the first meal of the d","useful":0,"cool":0},"n-Jhb6X11dwVhK4ohQq78g":{"text":"Love it!  Have Laura make you a Bloody Mary, and make it a double--with bacon!  Now that's","useful":0,"cool":0},"Pyi0tHF4c42nrIQmPMjfLg":{"text":"The food was excellent, the staff friendly and efficient.  Enjoyed our first trip so much ","useful":0,"cool":0},"32WJ8f5kAbuDbPZta2lZSQ":{"text":"Best breakfast I've had in a very long time.  Great service although I get the \" hip\" flar","useful":0,"cool":0},"kECaNwhdYWz1cKgbn_MxpQ":{"text":"This place was amazing both times I visited! Great customer service and even better food. ","useful":0,"cool":0},"b1obfJnOw5nS3HYAkyAFbA":{"text":"Fantastic place to have breakfast in New Orleans.   This location is on the edge of the Fr","useful":0,"cool":0},"YTnEAIJxVjMX66jOVpVxoQ":{"text":"3.5\nI was begged by my friend to go here and boy, was this a mixed reviews. First know it'","useful":0,"cool":0},"nJtqgCVQg897WFnsUh8Q3g":{"text":"I've heard that this was the go to breakfast spot in downtown New Orleans. My friends and ","useful":0,"cool":0},"wx8HBIYprLoE28jiWe8x2A":{"text":"This place was only decent. We came on a Saturday morning and the wait was only about 10 M","useful":1,"cool":0},"uaV7nuUaeK-lkiTy4pV3_A":{"text":"The biscuits are to die for! My favorite was the chicken st. Charles - it's so tasty. Defi","useful":0,"cool":0},"XEpTXZOB1HpT1ZN5sfMrUg":{"text":"The food and service here was amazing!!!! Ariel was an amazing server and our bartender wa","useful":0,"cool":0},"37ZA0gkoFRKLu_KtBUDb9w":{"text":"Sooooo good and the hosts energy and vibe was everything. We sat at a high top right on th","useful":0,"cool":0},"lB9I5QHwY3Fbx8f9-0p2Cw":{"text":"Terrible hostess up front. We ended up leaving after waiting past the time we were told an","useful":0,"cool":0},"YUZ5txVWY5xdeN5wYQxUFA":{"text":"For once everything in pictures actually looked just as good in real life. The service was","useful":0,"cool":0},"qSvs2bGMc0y5k_Eyd7ZB1A":{"text":"This was my fist stop after landing in NOLA. We were seated right away with no wait. Skimm","useful":1,"cool":1},"lY5bbt6c6X7QVQfmJNBi1A":{"text":"We were really looking forward to tasting the food at the restaurant. Unfortunately, we we","useful":0,"cool":0},"I6HwKrapE-0vBP6C-kdbNQ":{"text":"Great stop for breakfast! We tried 4 of the \"house specials\" and each one was great! The f","useful":1,"cool":0},"MaZugnd5eyujT0ZMvoB60w":{"text":"The Ruby Slipper Cafe is a local and tourist favorite. They will always be busy and for go","useful":1,"cool":1},"qcuWITPwpX_96ta9fHo2YQ":{"text":"They had some of the strongest mimosas I've ever had and the food was great the biscuit an","useful":0,"cool":0},"aE08BaT2PY-bvSxZO0aKCQ":{"text":"Amazing food! The staff was awesome and very friendly. I recommend fried green tomatoes!! ","useful":0,"cool":0},"S721ZlRuElJ8x4pmeR568Q":{"text":"First place we stopped by as soon as we landed at the airport!\n\nOverall, this place was pr","useful":1,"cool":1},"v4P-BH-0XqQ4KLjb2mAqSA":{"text":"SUPER friendly and the food is excellent!!  very creative specials and coffee kept coming.","useful":0,"cool":0},"Y52BtRf6FYav9L3V9T6Z_w":{"text":"This place never disappoints!!!!\n\nEvery time we visit NOLA this is a must stop for breakfa","useful":0,"cool":0},"AolhUhVDEoWmQigAryNjlQ":{"text":"Ok boys and girls I have our place for breakfast in New Orleans! I have given you the best","useful":1,"cool":1},"o5XQHCYnPbhUdo9H6k20jQ":{"text":"Really good food. Staple place to definitely try when you are in the area. Great for break","useful":1,"cool":0},"rtFxAh4zCC1Nii3rlvHNpQ":{"text":"Absolutely delicious and great price!! Their ice coffee is so yummy and the waitress was n","useful":1,"cool":0},"UHKCiIXOF9XM8fUQw8bHWA":{"text":"Walked by here on the way to Cafe Du Monde. Halfway there we turned around and came back. ","useful":0,"cool":0},"OOjNSVuJ6nO295lt5HVCqg":{"text":"My friends and I had just landed in Nola pretty early and needed somewhere to eat breakfas","useful":0,"cool":0},"j49tDX9nYfakQPv5DBIR3A":{"text":"Not sure why people are waiting 90 minutes for breakfast at this place. The atmosphere is ","useful":0,"cool":0},"wnvE7pG0RPDC23IJDxWFMQ":{"text":"This past weekend I visited New Orleans for a well-deserved girls trip. In which we stumbl","useful":3,"cool":1},"2f7uZ2iKjaSQ8VKHzSedAQ":{"text":"Fantastic food, big portions, great service! Noisy atmosphere inside, but definitely worth","useful":0,"cool":0},"WmDxIOl4j0IyVfN1_eHgTw":{"text":"Food was amazing, along with friendly service.  Mimosas on point too.  Will visit again be","useful":0,"cool":0},"j363OSqnrZHpANa0DL79lg":{"text":"The food was excellent. The wait was long so while some people in my group waited in the l","useful":0,"cool":0},"RXhRQ-gfsqvCfhZJ-GsPYg":{"text":"The staff here is beyond friendly, you can tell they all love their jobs!  We came here a ","useful":0,"cool":0},"_SqA-Irm1zAFeGlu8o_zFA":{"text":"One of the best brunch spots I've been to! The food was so tasty! Coffee was great! Staff ","useful":1,"cool":0},"ez465oPnW4dJj3LTCx1CQg":{"text":"Arielle was awesome!  Request her-  highly suggest the bacon Bloody Mary and the Trifexta","useful":0,"cool":0},"2AP3nK9wILEymasjEJdMCQ":{"text":"What a gem it is to take a morning run just about anywhere in the city and end up close en","useful":1,"cool":2},"1JgLEPWpXUwP6s9Qjwq90Q":{"text":"I would give this place a million stars if I could. The location is great; the food is abs","useful":1,"cool":0},"siuShf-mkqzX-J17cY1OqA":{"text":"One of the most famous place near French Quarter. That was the first place I have visited ","useful":0,"cool":0},"kBiSD9RLnrzBgyNA8AGkvw":{"text":"The wait was treacherous but the service and food was superb. Maybe the wait is a ruse to ","useful":0,"cool":0},"DyiK9-F7n34jTV8Gxt4EMg":{"text":"We had breakfast/brunch here a few times while in New Orleans visiting family and friends.","useful":0,"cool":0},"Vk9XYgI1AH7Nej1-Q7gNfA":{"text":"Great food and great service!! I recommend getting on the virtual waitlist EARLY! The Peac","useful":0,"cool":0},"KcPqicPboNSzx9SnZLuDGw":{"text":"I really enjoyed the food here. We were able to grab a table right on the street and our w","useful":1,"cool":0},"IzxTXxc6yZA0RlQ1awjJlQ":{"text":"Clean and they spread you out. The food is always consistently great! So happy to see that","useful":0,"cool":0},"pmiQ_tkJQvwE0TtzsUo92Q":{"text":"So I understand things have changed in the world during COVID, but getting terrible servic","useful":0,"cool":0},"FPJhgbW213mt1u0rsCtJAw":{"text":"The hostess and waitresses were so sweet and welcoming. I mean everyone that works here ha","useful":0,"cool":0},"ABtuI9_ccml-Gk4W1k5q2w":{"text":"We put our names on the live waiting list. Which helped cut the wait time down drastically","useful":0,"cool":0},"km3KSagGo_PdQX3JzZx95A":{"text":"Let's start off by saying we waited an hour and 10 minutes to eat here. The host was cluel","useful":0,"cool":0},"qiuWCwkNaV-O7gPjGL0_vw":{"text":"We stopped by here for breakfast during our stay. I tried the grilled fish St. Peter. It h","useful":0,"cool":0},"Zx9UVaUJEe21uwFEhiqQcA":{"text":"We came to this location b/c the location we were close to had a very long wait. Though ju","useful":0,"cool":0},"B4YfTwbENxacqgVl36o7WQ":{"text":"British the hostess is so fun and makes the wait feel like nothing. She is the bomb just l","useful":0,"cool":0},"AyjSjhqnk4qfzuSzsJMKog":{"text":"Love the brunch and the staff here! Cute restaurant and love the decor of the establishmen","useful":3,"cool":4},"7-MzxaecC5nGXsAq8QFIPA":{"text":"Loved this cute brunch spot. I had the chicken St Charles and the eggs cochon. Food was a ","useful":0,"cool":0},"ww1phqrm1nXR8srJ5vCa4A":{"text":"Magazine location doing an awesome job keeping their customers safe and Happy with great f","useful":0,"cool":0},"3B4BKTU6EZ5pKqp4srcZ7w":{"text":"Came here based on all of the positive reviews, however left quite disappointed. I had an ","useful":0,"cool":0},"07nKp8Qsv1d08BUoklexOQ":{"text":"Enjoyed a late breakfast while I was in town for a business trip. While I've been to a cou","useful":0,"cool":0},"M5CSCekHMcBzBIxM645gKA":{"text":"Get. The. Chicken. Biscuit. \nNuff said? \nAll of the food we ordered was really good. But e","useful":0,"cool":0},"R-5jtc5YELb553h0wFJy3Q":{"text":"The shrimp and salmon eggs benedict were amazing. I also had the grits and potatoes which ","useful":0,"cool":0},"mzQQw1cyJjnjVPC3eWz12g":{"text":"This place makes amazing food! Stayed in French Quarter for a week and went 3 times to Rub","useful":0,"cool":0},"7kDugjQLOU74xO77BnSZlQ":{"text":"Lively brunch restaurant!  Cinnamon roll pancakes were incredible.  Even though it was cro","useful":0,"cool":0},"K78Rm5n8rSckM_mnQgAk4w":{"text":"Loves the food! Service was great. The pancakes are huge! The bacon was the best I had. We","useful":0,"cool":0},"6RPOcEZSnytoHkuJqebeHQ":{"text":"We tried the eggs Benedict chicken, pork and shrimp. Pretty good. I would love to come bac","useful":0,"cool":0},"Du-WLAHfLO95hTNLRUJPew":{"text":"Had to dip off and try one of the breakfast nooks in the neighborhood. Many places do not ","useful":0,"cool":0},"GXOrF-5UbsAcOMpWxf_6cQ":{"text":"Ordered through Door Dash for breakfast.  Had the one tomato two tomato Benedict!   One of","useful":0,"cool":0},"k0gAwJimIOeQXFi2pKgeQQ":{"text":"I do not have enough kind words to say about this place!! Amazing experience beginning at ","useful":0,"cool":0},"TZVHL5hnZiSJ_vUXOqlIgA":{"text":"It was a very rainy morning and our hotel's \"hot breakfast\" consisted of an apple and a nu","useful":2,"cool":1},"XKvvTO1btHCBnPZOcU-X5Q":{"text":"Making the world a better place, one eggs benny at a time.\n\nI'm sure their other menu item","useful":3,"cool":1},"m_JODRKvYndSXIzmE3YBhA":{"text":"Wonderful menu and warm friendly staff. A must try for breakfast/brunch when in NOLA!","useful":0,"cool":0},"AcipzefvewhZUqP_TO3UMg":{"text":"The food and service was AWESOME!!!  I appreciate the use of an app so that you can check ","useful":3,"cool":0},"0pfOenVCB-ZuD-_CT96KUA":{"text":"I came here for breakfast on a Saturday morning. If you want to have a chance of getting a","useful":0,"cool":0},"DMZy-z-zxLphHDvTOw5_Kg":{"text":"I was so excited to eat here. All the great reviews and the insane wait. Too bad this plac","useful":1,"cool":0},"yJacHNVPNSyb__4azA4jNw":{"text":"We are visiting from Maine and wanted good NOLA place to eat. We dropped in because we wer","useful":0,"cool":0},"_ROZvQqfjsArFODtiPZVvg":{"text":"What is not to love about the Ruby Slipper Cafe?!? It screams southern charm from the mome","useful":1,"cool":0},"Vf0Otykct7hontoZt5LzBA":{"text":"Checked in on-line, showed vaccine card. We we're told to wait to the side. After she repe","useful":1,"cool":0},"6F1LrBf5ccrAeV83c1ftQA":{"text":"Shrimp & Grits? Yes, please!! The BBQ sautéed shrimp has a savory rosemary butter reductio","useful":2,"cool":2},"uJBZLBKz-LPYLAXodAVdyg":{"text":"The hostess at this location is garbage. Hostess totally skipped our name on the list. Aft","useful":0,"cool":0},"hQmvvKlObpXTPsehUpodmQ":{"text":"I love and live for a good brunch spot! I had been eyeing this cafe the entire time I was ","useful":15,"cool":14},"owNMFiLBHHYJSI5cYbXGtQ":{"text":"This was my first time coming but definitely not my last when I joined two friends of mine","useful":1,"cool":0},"sxgHV88_NUcgPYlHdHjWIg":{"text":"Amazing! A definite \"must eat\" in New Orleans. Great food and friendly service. Prices are","useful":0,"cool":0},"JaOFbgGJzlSiYxr8apYCMQ":{"text":"Know up front, this review isn't an indictment of the food.  Instead, this place needs a S","useful":0,"cool":0},"2ucy0rrfKGavS6HttyizPw":{"text":"I really liked Ruby Slipper, but to be honest I wish I could rate it 3.5 stars (it's not q","useful":3,"cool":3},"WbK2UdX5zOJQ--5yAacXpw":{"text":"I thought this place would be overhyped but I WAS WRONG. Holy crap was it freakin AMAZING.","useful":0,"cool":0},"2KpRl223h-z2bYdSlubzLQ":{"text":"This is a must place to eat servers are so personable food is consistently good and you mu","useful":0,"cool":0},"ZfwHSV-nn_N1uQfbPinOAg":{"text":"There are many locations around New Orleans. Some locations are busier than others. They c","useful":0,"cool":0},"Y0NEoFCz64zIxmluvnGVvw":{"text":"We are from California, and every time we visit NOLA, our 1st breakfast has to be at Ruby ","useful":0,"cool":0},"T0ESWBjkp7fN_r_adK5nEA":{"text":"Wednesday morning at 10am it was a one hour wait. Ok that's a positive sign if ever.\n\nThis","useful":0,"cool":1},"bWklTlHy7HzA8s56Crdn2w":{"text":"*My first time visiting this location* I suggest getting on the virtual waitlist before co","useful":0,"cool":0},"QFEHgKHkXStYK9i12rQ5rA":{"text":"Best burger around and the unique brunch options were enjoyed by the rest of my party. Sta","useful":0,"cool":0},"KGL9cb3Ao9blx89D8c85Fw":{"text":"Went there for brunch, during our visit to Nola. Ordered the St. Peter fish special (white","useful":0,"cool":0},"npvUWliIJTzFJnoh0X5Kow":{"text":"Use the online wait list and then be prepared to wait when you get there. But once you're ","useful":0,"cool":0},"JnXrDd5hGKQy5iBH17iIIg":{"text":"Love this place and all the selections. You have to get the candies bacon. Life changing.","useful":0,"cool":0},"uhUBgpzYZjeBAGgyeUOFzA":{"text":"The wife and I couldn't wait to revisit this place. We dined at Ruby Slipper 10 yrs ago an","useful":0,"cool":0},"zY-BeYPFuGt83WGWVrqtLg":{"text":"The food was very delicious. Eggs were cooked to perfection, the sauce was very flavorful,","useful":0,"cool":0},"fX3wdax8P-Vmv84iDGFwZQ":{"text":"There is a scene in My Cousin Vinny where Mr. Gambini cross-examines a witness. In this sc","useful":3,"cool":3},"qpxkmipCyt_kHrvvsrFOeg":{"text":"Had this place on my must hit bucket list for my vacation in New Orleans based off all the","useful":0,"cool":0},"_gTTXUXCd3uZOSQBhqjNPg":{"text":"This is a great breakfast spot. I would highly recommend that you join the waiting list so","useful":1,"cool":0},"cADC-8HO-fdj5vXTyjcxAg":{"text":"Waiting time was about 1 1/2 hours, but everything in the area was a long wait. Joined wai","useful":1,"cool":1},"GTHo0V1OcmwHb-ASbxmxmg":{"text":"We were in town for 4 days. New Orleans has limitless awesome food. We came here 2 of 4 mo","useful":13,"cool":14},"hzO95QK0-TO_L2yhbj0gfg":{"text":"If you're in town for Essence Festival or some other event, use the Yelp App to get in the","useful":2,"cool":1},"-8J89f4Ys8wjc8bDh2Jo7Q":{"text":"Never disappoints!! Laid back atmosphere, but the service received is always decent. The c","useful":0,"cool":0},"vAXU4x9aRaviXgzvt64AfQ":{"text":"2-3 hour wait is normal here, but if you get in, you will love it! Hands down the best bru","useful":1,"cool":2},"klIjtIctIkG9ZMcJu2tiFQ":{"text":"If you're looking for a great brunch spot with a slight New Orleans influence, this is the","useful":3,"cool":2},"AEX8AxZ9FPZPGx2Fy9ziQw":{"text":"We are from out of town and were looking for a good breakfast place. Ruby slipper had grea","useful":1,"cool":0}}