{"dgfgoyNjeXB-pqN2x8faww":{"text":"We ordered the buffalo chicken wings. The buffalo sauce was really good but the wings were","useful":0,"cool":0},"1Pv7ChKk_Gtc9mGpnrVZLA":{"text":"Ordered the chicken tenders basket that came with fries and a biscuit.   Man this place wa","useful":1,"cool":0},"rd4gCs2Zd0iNJHkExo6y4A":{"text":"My experience with Willies was good. I attempted to enjoy Willies on two separate occasion","useful":0,"cool":2},"OHUU2G4iZC1HVaSGApDquA":{"text":"This place absolutely has the best biscuits ever. It is a MUST try! The drinks are great, ","useful":0,"cool":0},"BHuQMtEXgOoTGbuM9oUHog":{"text":"I'm so sad they got rid of their biscuits but I still think this place is great for what y","useful":0,"cool":0},"Eshqp7tpVj1YDclXgu5eBw":{"text":"Greasy fried chicken!!! Great place if you have a hangover! They're all over Bourbon stree","useful":0,"cool":0},"57u4O7JQpXdUDiB99zm1sQ":{"text":"If you are looking for greasy, southern-fried foods, this is the place.  We stopped in her","useful":2,"cool":0},"_fGVauq51CDYPHaFjazVEQ":{"text":"A friend wanted us to try the chicken she said was good. I ordered the Cajun chicken strip","useful":0,"cool":0},"5y2X9H0zHj49JQ952We2hA":{"text":"All i can say is the food is average at best!!!! This place is quick, the service sucks an","useful":0,"cool":0},"x-t_eo0hVenKv3vxBXbzdQ":{"text":"Great chicken - rather pricey. Friendly staff. Fun and poplar spot. Drinks are \"ok\".  I'd ","useful":0,"cool":0},"Xh8Ku_-btHR-zQ8erDyfQg":{"text":"Let me begin by saying that the one I want to review is the one on the other side of Bourb","useful":2,"cool":2},"Es_AbqIo5fw56DpN4XiZ5w":{"text":"Who wants some hot, crispy, delicious, juicy chicken????  Me!  Me!  After an unsatisfying ","useful":0,"cool":0},"7o8Qx6XujvNKmHX-lxCKQA":{"text":"Yasssssss nuthin better than willies shack. my quick to go places when I'm here on a busy ","useful":0,"cool":0},"6Oc0_AePrgyxxWjpmDYkFQ":{"text":"yes there is better chicken in new orleans, but late at night, when you're starving and ti","useful":0,"cool":0},"cN7cR02ih0yIHnWbp7iUew":{"text":"The staff were very rude. Asked me \"why are you here on bourbon st. When there are people ","useful":0,"cool":0},"uKmSX5ATWUCJ1t1Rg12E0Q":{"text":"The owner is very rude! I order a two pieces mixed & 3 pieces mixed.. I asked for a breast","useful":0,"cool":0},"S3mRJ3F5jXtPfSzZWqO57A":{"text":"It was late, and we were strolling down Bourbon St. with grumbling stomachs. We stumbled u","useful":0,"cool":0},"YBPGIj62UjYYmo_Xtm0Tug":{"text":"I got to create my own alcoholic beverage! It was awesome!","useful":0,"cool":0},"Iy_7txBF04j90b5ZkUFX0w":{"text":"Biscuit was delicious!!! Everything on menu is deep fried.  Music was loud.  Chicken tende","useful":0,"cool":0},"AW373vmBS6LGjCpMiLwlKQ":{"text":"Decided to stop by last night wanted some chicken but too tired today open for lunch. Orde","useful":0,"cool":0},"UYoQg1H3iF6mdm1XXikOog":{"text":"This chicken is to spicy the hypnotic daiquiri was okay there are different dipping sauces","useful":0,"cool":0},"fI-gvwZr6mP8402XamIJbw":{"text":"We popped in here soon after arriving in the Big Easy. It wasn't my first choice, but my w","useful":1,"cool":0},"ct3EgqeOSVy2XHoO5XVt7w":{"text":"The fried chicken is just okay, the rolls with honey were amazing. The thing I didn't like","useful":2,"cool":1},"9IE1O-lxp7ThhIQLr74HCw":{"text":"This place has the worst daiquiri in new orleans. I brought one with my girl last night an","useful":0,"cool":0},"dcaPa7_0qDs87td3An47tA":{"text":"Monique is the best, but no bathrooms. Awesome chicken and daiquiris. Honey mustard is goo","useful":0,"cool":0},"01rPdgDZ_OFC_naxrKzvIQ":{"text":"You bastards really got me hooked on the delicious crispy and oh so good chicken. The bisc","useful":1,"cool":0},"ybzU4mYC1-KzkEEYZeMaSQ":{"text":"So good! Food was hot and fresh, fries were just moments out of the fryer. 4 different sau","useful":0,"cool":0},"q4oSJ1aniE0wi5EvVQShZQ":{"text":"Really bad Fried chicken.  IT was SUPER greasy and tasted like they had not changed the oi","useful":0,"cool":0},"z2LUhd5xi4k48UjOwcIYhg":{"text":"This is a great place to get a fruity frozen drink and fried things after walking around a","useful":2,"cool":0},"32ZJHvvaNol8Tw8GEOMMGA":{"text":"Really good drunk food.  Very very limited seating though so if Bourbon St. is crowded be ","useful":0,"cool":0},"hE-qVezHx0OxU7XPjcgecQ":{"text":"CHICKEN IS HOT AND FRESH, super crispy and definitely the spot to go on bourbon after a lo","useful":0,"cool":0},"bXQGQY8SXtXd3h9gRKORew":{"text":"Food is good if you want a quick meal. Haven't tried their daiquiris yet though. 3 locatio","useful":0,"cool":0},"hut6hqpNtD2m-0-HGLsEOA":{"text":"Eat this chicken and rice after a night of drinking and you will feel great in the morning","useful":0,"cool":0},"Akj2i6ErN6tuP6th1gFOjw":{"text":"There are probably better fried chicken places than this somewhat commercialized local cha","useful":0,"cool":0},"MoAWTZCPh7FAjpsMBbYHLQ":{"text":"Willie's, in my opinion, is a staple on Bourbon street. It opens late and serves food that","useful":0,"cool":0},"C3jbB5rELodU7dKTEv5bsQ":{"text":"As for as food on bourbon st.  this place was not so bad.  As for as the service  not so g","useful":4,"cool":0},"g74WNsyj7kJhgs6tJcKX1A":{"text":"I'm currently here. I order the wings, catfish, and jambalaya. The chicken and fish was co","useful":0,"cool":0},"y2no3nzh-rpXGE5hogdhYQ":{"text":"Always very hot food with a great taste! A must when drinking on Bourbon. Prices aren't to","useful":1,"cool":0},"sRI38E23MgQNWX3uAZo8hw":{"text":"Walked around bourbon street and kept seeing these chicken shacks just about every block d","useful":1,"cool":0},"8u1ephTLF3pVcMaGq6TVfA":{"text":"This chicken was freakin delicious!  I like to think i've had my fair amount of fried chic","useful":2,"cool":0},"8UgCx0uEfPxOeoU_dKLkNw":{"text":"The chicken wings are very tasty. You really so get your money's worth here. Right on Cana","useful":0,"cool":0},"YA8E2-11F89yAsUblbVQ0g":{"text":"OMG. Delicious warm fluffy biscuits and the juiciest chicken tenders I've ever had. We sto","useful":0,"cool":0},"tTJcerc0xl7UUvWam2TYGQ":{"text":"I visited New Orleans for the first time this past weekend and I really had a good time. I","useful":0,"cool":0},"93OohdR_fGHufg6Wr_w30A":{"text":"After a long day of hand grenades and exploring the \"big easy\", I decided to endulge into ","useful":1,"cool":0},"B6dyCX4HR2jfVbs6RVRKxQ":{"text":"Not even going to lie, when you get the chicken and fresh out of the fryer it is absolutel","useful":3,"cool":2},"0puZn8buNmqnLPGHGpA29g":{"text":"Customer service was OK. Food was OK, not great and definitely not the best chicken I've e","useful":0,"cool":0},"Fe9qqhBjhNjI2HGo2AdAxA":{"text":"Great place to go to after a day of walking around town and/or bar hopping. Get the chicke","useful":4,"cool":1},"GUnONTwuRw1UogPrPRDujg":{"text":"On the cab ride from Amtrak to the hotel, the driver asked us if we had ever had Poppies c","useful":1,"cool":1},"zbvMOPmNrKNFDakGhccwOw":{"text":"Service was good.  The chicken was super crispy and moist.  Definitely hit the spot!  The ","useful":2,"cool":0},"T4p3re2mA889zmqzkwztIA":{"text":"Friday, 1:00 PM.\nTake-out. \n\nSecond lunch.\n\nQuickie:\n+  Good food\n*  Menu variety\n+  Frien","useful":0,"cool":0},"-0yD2mH319Oj4LNK3gtRiA":{"text":"Yes! Just got back from NOLA. Willie's Chicken Shack is ZZZZ Best fried chicken, batter cr","useful":1,"cool":0},"kuFs5hRGA8QmID29SiJPAg":{"text":"Located in the French Quarter, this restaurant is great for good ol' Fried Chicken.......I","useful":0,"cool":0},"98PVp3WfHisKggPmdPsxtQ":{"text":"Quick snack of two pieces of chicken, and wanting more!\n\nLoved the crispy skin and not at ","useful":0,"cool":0},"uY4KqezwM1hxCefUEDXSiA":{"text":"Bright. Good music. Clean places to sit super friendly staff. Good chicken (juicy, crispy,","useful":0,"cool":0},"Y_AS1wDG8EUrK1q9BSXzew":{"text":"For all the times I have come to New Orleans and passed the many Willie's Chickens, which ","useful":2,"cool":0},"vPMn1oodwOnoLa5ElbBf3w":{"text":"HO-MAH-GAH.  Best wings EVER in life. And the honey biscuits will haunt my most blissful c","useful":0,"cool":0},"TB5_9B0Mgc6k7cowHh6ZFA":{"text":"Hands down the best fried chicken I have ever had. Ridiculous good....I guess they want a ","useful":1,"cool":0},"c7H97b7gxLKYWeYvTWyrPQ":{"text":"This place was awesome!! I had catfish and shrimp combo... The fish was perfect!!! My hubb","useful":0,"cool":0},"hcKW4MEjqVwXkX_6eTwwjw":{"text":"REALLY GOOD CHICKEN WINGS!  Not sure if it was because my friends and I had been drinking ","useful":2,"cool":1},"15jSPWDO3B-5rx1HwI0SZA":{"text":"No, I'm not recommending Willie's for dinner.  That being said, if you're in need of solid","useful":2,"cool":1},"FjqqwKTQ8F7L7JSx02K_qA":{"text":"We didn't have the food but the drinks are amazing! The slushies are perfect for walking a","useful":0,"cool":0},"nXEVkhVz-SnKnKMOGTrGGA":{"text":"We stopped here because we passed by the place like 3 or 4 times on Bourbon street and the","useful":2,"cool":0},"5t_1GC9EP-7zhRzacl6HbQ":{"text":"We were on bourbon and stopped at this spot. Honestly this was the best chicken spot I've ","useful":0,"cool":0},"nEdw9bCvMNw2VwGzRyk3og":{"text":"When  I went to New Orleans I was so hyped to have Popeyes, it was supposed to be better t","useful":0,"cool":0},"Cyymt2MHPkhoxbhg7N13VQ":{"text":"The biscuits are the bomb-diggity! Good fried shrimp and decent margaritas. The service wa","useful":0,"cool":0},"8T-e4wmRxvGSJ2VL_JcAvg":{"text":"Small Daquiris for $10. I guess. But I got 2 large for $24 and man I was disappointed. Aft","useful":0,"cool":0},"Kwl-liX_nGvGHPPFaeYJ4w":{"text":"Incredible food, it's a game changer. The chicken, the fries, the biscuits, the special sa","useful":0,"cool":0},"CBLkve_Zn6jmQ57TwY5dSQ":{"text":"The owner straight up stole my beers! Seriously, almost caught a case. Do not come here!!!","useful":1,"cool":0},"e_X5yFwR_yyj9fQKvsOTmw":{"text":"The drinks are good and tasty. The chicken is good but lawd Jesus the biscuit is AMAZING!!","useful":0,"cool":0},"KhC7xtJD27MF9l3n4IBgYw":{"text":"Chicken was not that tasty. Also seemed to have been sitting too long. Popeyes was better.","useful":0,"cool":0},"zcDc6Mb6dQgNp3VaFIjReQ":{"text":"I ate here after many.....many shots. So take this as you will. However, there is almost n","useful":0,"cool":0},"2PzYExpZTpqGOk2Mc03jNA":{"text":"Good for what I got.  Went it to get a tall glass of fruity daiquiri and that's what I got","useful":1,"cool":0},"-XVJiSwIAg8UewDI3mmwwQ":{"text":"Quick affordable delicious Jambalaya. The service was friendly, fast and efficient and the","useful":0,"cool":0},"Nsnc5Gsmizgz0WmVQz5GLA":{"text":"Awesome fried chicken. This is way better than Popeyes or KFC. They cook everything in fro","useful":0,"cool":0},"Lwd_KDJLcTtenkxxyGiVUg":{"text":"Really good Fried chicken, for a late night stop, love the sauces to choose from, quick fo","useful":0,"cool":0},"XvIIyFkVK8nR2R2bmfsizA":{"text":"Frozen drinks always available. Great flavors, a bit sweet though.  The chicken, OMG. Grea","useful":0,"cool":0},"P4mNo9o9h-IjgiY0KAQQ6g":{"text":"Well, I don't really remember it, but wifey said it was goooooood. And she know fried chic","useful":0,"cool":0},"Ao9rl2XRCBILWYrLjnMBDw":{"text":"I tried out Willie's Chicken Shack on Bourbon Street. It was loud and very busy, which I a","useful":0,"cool":0},"DvluOW6PCqTzGpszhviVTA":{"text":"I normally don't write reviews but have to in this case. Bourbon street is dirty and I had","useful":0,"cool":1},"Id0_wTuoZ02TnwBYy-WhlQ":{"text":"Brah when you're pounding beers back and drinking hand grenades nothing in the world matte","useful":2,"cool":0},"IymwkA09Fi4kWXE_cL_ISQ":{"text":"Their fried chicken is delicious and reasonably priced. I recommend trying their chicken t","useful":0,"cool":0},"bbergDW91gOZcRBNaMthWw":{"text":"First time trying it and had to say it was very delicious. The sauce I got for my wings we","useful":0,"cool":0},"01vM1nM5_kDwNqDyhdCO_g":{"text":"Willie's chicken is the perfect meal after a long night of drinks and fun! What's great is","useful":0,"cool":0},"woNeUy3wAO1tFwbQVdhhvQ":{"text":"Good food, fresh, friendly staff. I really like the gumbo it had a lot of spice and it was","useful":0,"cool":0},"JG_AD22jZgqeCTcCpUokfw":{"text":"Horrible! Horrible! Horrible! The service at this place is a disgrace to New Orleans......","useful":1,"cool":0},"q8ebTTBq_SN_xWVSgw3rdw":{"text":"SOOOOOO GOOD!t this was the best place in the french quarter. the one we went to was a bar","useful":0,"cool":0},"7To7gRgF-1SjW5KZ7VHRBA":{"text":"Well, hands down the best fried chicken I ever had. Super small, not Gast at all, but if w","useful":0,"cool":0},"1hRmnRr4Y7ZhK0ZgdCs8Xg":{"text":"Really good chicken  I have good experience yesterday and today is my second thay tastings","useful":0,"cool":0},"vIlWmbQxR7z-hxdF_17VFg":{"text":"It was 2 am, and I was badly in need of food after a long night out on Bourbon Street. I h","useful":0,"cool":0},"UzVmIoQOVdVsOS8T05BTFA":{"text":"Just OK! Chicken.. Nothing to boast and brag about. Ordered 6pc wings & fries $8.99 & $2.5","useful":6,"cool":2},"atiT0mI86LrJneMNhy3rbA":{"text":"3 PC Chicken Tender and a Hurricane! \n\nI asked two locals where is a good place to get fri","useful":0,"cool":0},"a5MmdDZQ9DHthYpwDlXX9w":{"text":"Cool... Chicken wings were hot beyond belief.  Unbelievable... Ate 1/10 and cried blood fo","useful":0,"cool":0},"pOhMxjnOppFA99P2WwjC_g":{"text":"Just went this weekend and it was so good I was licking my fingers. Went here for my boyfr","useful":2,"cool":0},"XzyCjQH_ALNQArxumU00gw":{"text":"Dear Mr. Willie,\nThank you for sobering up my drunk ass. I was pleasantly surprised that y","useful":6,"cool":4},"vJ3LzCUZqlrMFN0zmUyc1Q":{"text":"Good food but worst service ever!! I'm visiting from out of town and we came here to eat a","useful":1,"cool":0},"OzjvpOwCva82LXlippj1XQ":{"text":"This place is horrible. My food wasn't done. They took it and didn't replace it and didn't","useful":0,"cool":0},"PpZecAz7LAbxjXe_g4laTA":{"text":"We got the chicken and fish, it was great and would be back again. The bartender was great","useful":0,"cool":0},"dAUnJeSMZOrRcLxizY54SA":{"text":"Was here Monday afternoon and had the tenders and red beans and rice. Best chicken ever. M","useful":0,"cool":0},"9Er_cG2KyiS4GT2TImcJ1A":{"text":"This place only does small plates, you have to go to their other locations for family styl","useful":1,"cool":1},"bquLKaFE38qzL3lKjCNKlA":{"text":"Hey it was great!  I was walking by at 2 am and the smell of fried chicken got me and I ga","useful":0,"cool":0},"RqR-3yHf0DmF49uqzqv_ng":{"text":"Woohoo!  I'm a little tipsy from the plastic cup deal, however, 7 eleven does not compete.","useful":2,"cool":1},"-UNx3sizzGSNT7CT2F09lA":{"text":"Disgusting! Absolutley the worst fried chicken I've ever had. It is definitely no Popeyes.","useful":1,"cool":0},"79iG-2uC-QgYCHZSzKltPQ":{"text":"If you value your safety, RUN AWAY FROM THIS RACIST PLACE ASAP! The employees are DANGEROU","useful":3,"cool":0},"BbJ4XGG5WyG7ExZ_3i6rcQ":{"text":"Willies is open rather early. Great place to go for an early drink or a slushy version alm","useful":0,"cool":0},"VX_dlNkJevmnCZlJNerU2Q":{"text":"Go to Brothers three blocks up the street. you will get more chicken for less. Brothers is","useful":0,"cool":0},"NKS6w6175MfJE3vIeoAZ3A":{"text":"I was drunk. Really drunk. \n\nAnd hungry. Really hungry.\n\nMy review is coming from that min","useful":1,"cool":0},"GdTYmTrxagKKiH38HSAmPw":{"text":"This chicken was pretty good...very flavorful..it actually had a little kick to it..and th","useful":0,"cool":0},"9Q4Zp6Hav9GUMoLfPSn9eA":{"text":"This is another random spot we ate to eat Cajun food. We needed something quick before our","useful":7,"cool":4},"qqgBKcLdAUaizxWRjt8rQw":{"text":"Went to the location on Decatur. .laughed at slap yo mama good sign! I mean who does such ","useful":0,"cool":0},"2--mZScFoYGbClMMebHzkg":{"text":"Great fried chicken \nFantastic and very moist chicken strips \nThe red beans and rice were ","useful":0,"cool":0},"Rf2KEjaeNBdrBI7ELM9YEg":{"text":"Just good plain ole fried chicken. I can name many better places to eat and I can also nam","useful":0,"cool":0},"VuERGOdsMwfAxW3uDk4TKA":{"text":"Rude staff, slow service,  greasy fried shrimp, fries & chicken- all I can think is we wer","useful":1,"cool":0},"gxVtSCUNGI7aY7JIaPaylw":{"text":"I stopped here during a business trip in October of 2015.  I have had fried chicken at man","useful":0,"cool":0},"8AvPsvF0g2dMu7UBeNhZrA":{"text":"Waited in line for 20 min placed order, limited seeting, waited for bout another 15min for","useful":0,"cool":0},"L-us4b0jj8CONw35XLRO4A":{"text":"We stopped in here while visiting bourbon street because we wanted something fried... This","useful":0,"cool":1},"FRNjZuQVgz89E94g_5T8Rg":{"text":"Couldn't give it zero stars, Yelp won't let me... but AVOID this place. The chicken was av","useful":1,"cool":0},"KD8WbWnGzs2cK2nYVT_k-w":{"text":"Hats off to these people who have to cater to our drunken debauchery!! \n\n**DISCLAIMER**\nTh","useful":0,"cool":0},"5ifvmHgwmNQ6mtUrVog3Jg":{"text":"It's really A-OK. The biscuit is probably the best biscuit I have ever had- they were mois","useful":1,"cool":0},"rI0IvrPGwAnWHL4HTuMDJQ":{"text":"Dinner with a kid on bourbon street. Chicken was good with choice of sauces. Frozen adult ","useful":0,"cool":0},"wuNxfjPI2SlMGtoaez38zA":{"text":"Had this late night after a night on the town. Great red beans and rice and friend catfish","useful":0,"cool":0},"O4TKv_kvXYox5nONcMMW_w":{"text":"Great drinks! Lots of alcohol used lol. Nice little place if you're looking to get buzzed!","useful":1,"cool":0},"Hg1QBE-iEHnwVPMpJAGkbQ":{"text":"To be honest that chicken ain't have NO business being that good. Imagine Popeye's times 2","useful":4,"cool":2},"I2olRUT5UN6J69G0Fy5M8A":{"text":"Was down on Canal Street and stopped in here....didn't eat anything, but had a frozen conc","useful":0,"cool":0},"6Op1RWXZ1fio6U6rWNUSAw":{"text":"In all honesty, part of me wishes we *hadn't* gone in to Willie's that Sunday night a mont","useful":2,"cool":2},"-1X5nehEGUD0tCvj3f8_9A":{"text":"Just here over the weekend, and I can NOT stop thinking about it!!!!!!!! The best food eve","useful":0,"cool":0},"MqKQhyyrVOfaZVH8FkRrtA":{"text":"Fried chicken is nothing special, but their biscuits are divine! They're soft and crumbly ","useful":0,"cool":0},"0rwmLjErbHDd9HPFlxf1UA":{"text":"I stopped here because of a recommendation from a friend. I was not disappointed. When I e","useful":0,"cool":0},"JOZHUc-WRGfj05Oh0b37dA":{"text":"Pretty good spot to grab something to eat, especially if you don't want to wait an hour in","useful":0,"cool":0},"27wsuWJ-ID61ierZvkNjOQ":{"text":"The biscuits are to die for!! Definitely a place to stop for a quick bite to eat - sober o","useful":0,"cool":0},"wMw3a51cYNH2MLZURxTepw":{"text":"It's just a chicken shack with blaring beats and a 1950s diner feel.  The biscuits are bey","useful":0,"cool":1},"q7Hb_QsofDzgFWqexqlthw":{"text":"Wow this place is so effing good. We ate here 3 times and while we were drunk the food was","useful":0,"cool":0},"KkKhdGgGeusYjLMSs1ZzRQ":{"text":"Delicious and cheap. It was great!!! Also make sure you try their house sauce. :)","useful":0,"cool":0},"_zMX_gkg2Kna_tBSZNtgow":{"text":"This fake extra crispy/crunchy Popeyes chicken almost broke my tooth. It was nice and hot ","useful":0,"cool":0},"_C3u-diBnhjHU4m_4HncaQ":{"text":"Probably the best chicken strips I've ever tasted. Very fast service and neat atmosphere!","useful":0,"cool":0},"F1npd30CsQAzGOWLZ_JwNg":{"text":"If you like grease, go for it.  Looks good, all of the taste is in the crust, fries simila","useful":0,"cool":0},"G-OjkusyQVvrrW68WUXDHQ":{"text":"This chicken right here was yummy! Tasted like grandma's chicken! Full of flavor and cooke","useful":0,"cool":0},"2tAop-JnmCJ72THErsQ67A":{"text":"I would definitely consider this place a \"tourist trap\" and I was lured right in! It looke","useful":0,"cool":0},"reVM02AY5U6WIoAG2css-Q":{"text":"Bomb chicken... wish I could have skipped all the fancy eating and just had this place the","useful":1,"cool":0},"IZ4xJI1t26UstNdiJAclPQ":{"text":"Stopped here after 12AM and got six wings and fries which cost $14 . Chicken was not good ","useful":2,"cool":0},"0f7_w7c8nO0QTeD_6mJa8g":{"text":"Those biscuits tho!!!!'   Yaaaaaas. The best ever in life. The biscuit was perfectly cooke","useful":0,"cool":0},"g0rR2nKsLT5AZZUFAuQhWQ":{"text":"I was here back in October.  My friend and I popped in and grabbed a bite.  Split the chic","useful":1,"cool":0},"Gsysg42JIQG4EinPtbquqw":{"text":"Friendly staff and great chicken. The biscuits are to die for. Margaritas on tap--I mean c","useful":0,"cool":0},"pUFNFck5e9k1zKebLv0usQ":{"text":"The chicken is mesmerizing! Double dipped in specially seasoned flour and egg  batter and ","useful":0,"cool":0},"2txO9qNCaVt8mRFHpYRMkA":{"text":"Came here during the super bowl. It was some of the best fried chicken I have ever had. It","useful":0,"cool":1},"dl01zlAeNaOObcwdlbCwRg":{"text":"Although the food was decent, pay with cash...A group of us went there and they charged a ","useful":0,"cool":0},"lGqw4RFSVnT2pwD88Gidyg":{"text":"Clean restaurant. Drinks by the yard available. Chicken was good. Gumbo was good. Nice, fr","useful":1,"cool":0},"_CF7F4VzDb4jbyIX1d2tlg":{"text":"this needs to be a chain.\n\none of the best fried chicken i've ever had. was only in NOLA f","useful":0,"cool":0},"SE0fzmzuND7zU1CydwXusQ":{"text":"Considering it's on Bourbon St., it's clean! The chicken is fresh and delicious and an add","useful":0,"cool":0},"KS_zZsQ3qWQFrTnRxgvC1A":{"text":"Nothing special. Chicken was ok. Fries weren't fresh and biscuit was mooshy. Not sure what","useful":0,"cool":0},"Hsf-lXacFpgmoQg4u3rHFw":{"text":"Pretty much the only food place that I saw open on Bourbon after 2am. Wings, shrimp, fries","useful":1,"cool":0},"-BuqWwf7A-nyd7563nAmew":{"text":"The food here was pretty good for our first meal in NOLA while visiting. The gumbo is a mu","useful":0,"cool":0},"Sd1VzPdlhLlahFO4IIQFaA":{"text":"Surprisingly good gumbo. Perfect food for carrying around bourbon st. Fast and tasty. Admi","useful":0,"cool":0},"t0BlRuR2Wh2B46AUnDfOiw":{"text":"It was late, I was hungry and tired of paying high prices for food in the French Quarter. ","useful":1,"cool":1},"QSWIAO9CniydC0D-wfFYpQ":{"text":"Hungry after a night of drinking on Bourbon st?  The fried chicken will hit the spot for y","useful":0,"cool":0},"cUDIx4N5D_ZlqHFX6Kiqmw":{"text":"Those biscuits!!!  Amazing!   I'm pretty sure I wasn't that drunk (but who knows...I was o","useful":0,"cool":0},"ryVFBiKE2ZHQ0nOVbOylwQ":{"text":"The fried chicken at Willie's was so delicious that I  still think about it!! We stumbled ","useful":2,"cool":0},"kRqMgnksQgQqRQE3BXvFnQ":{"text":"This is possibly the best fried chicken I have ever had in my life.  I ate here 6 times du","useful":2,"cool":0},"vP75IOdM17W-dgcoQr1mLQ":{"text":"If you're going to Willie's, you have likely been on or are on your way to Bourbon and loo","useful":0,"cool":0},"6Q64YGf9iPYh2OdBjK2wsA":{"text":"Popeyes would be way better...I'm sure the only reason these folks are in business is beca","useful":1,"cool":0},"oR6mXyqzxIrTFk34UyAr-Q":{"text":"LOVIN' Willie's Chicken Shack! Great drink....Mixed Hurricane, Willie's Cocktail, Hypnotiq","useful":0,"cool":0},"AA2REOrFhjGE2LBEuCq7GA":{"text":"Yummy chicken strips!!! Yummy red beans and rice!!! Yummy jambalaya!!!!\n\nUnfortunately the","useful":0,"cool":1},"RooW9diOJjuJkKu9nOlqDw":{"text":"Stopped by Willies on our way back from bar hopping. We were pleasantly surprised by the f","useful":1,"cool":0},"rjMF1NZIxRLrbmyhyhOWyg":{"text":"This is a shoutout to the 409 store!!! Maggie is the best ever. Meet here and get a work o","useful":0,"cool":0},"IUv9HhrwAnWBpydnG0HhZg":{"text":"Hot, crispy and juicy chicken- great for after a night of drinking.  But if you are sober,","useful":0,"cool":0},"YmFqj4MOE8YkqISlyTeAJQ":{"text":"As far as fried chicken goes, old Willie knows what's up. This place is a great stop at an","useful":0,"cool":0},"oO7UXIYHgnpd-HhMipBQGg":{"text":"The chicken is .... Nasty , maybe because I was not drunk it was not good . You would do b","useful":1,"cool":0},"bn_rw50tNMeocafTNy5tEQ":{"text":"Chicken just tastes like KFC used to back in the bone-in days. Good, but nothing spectacul","useful":0,"cool":0},"rV7xJ5TO5h8skM77S_rjjQ":{"text":"There are so many Willie's in the French Quarters that I decided I had to try it one night","useful":1,"cool":2},"wjDZCN8urx-FPzt3K1sVUQ":{"text":"Nothing like chicken fingers and fries to satiate a late night drink fest. \n\nYou can find ","useful":1,"cool":1},"nOEHC1SEhR-u-E-GLdIMYg":{"text":"I've heard New Orleans has a drug problem and I suspect Willie's might be to blame.  Wande","useful":0,"cool":1},"7ELy_z-HLjFsrJUPc8moPQ":{"text":"For the type of food it is (chicken and fries) \n\nFRIES ARE GREAT CHICKEN JUICY AND THAT BI","useful":3,"cool":2},"PCkcS3zuC-UiXhb4iZSX8A":{"text":"Cheep dive on Bourbon to get some fried chicken.  Basically a fast food joint.  They got b","useful":0,"cool":0},"kMRI-iVGrLspPR-T2oTucw":{"text":"The best chicken New Orleans has to offer! Every time I come to the NO I must have this ch","useful":1,"cool":3},"_XGYNDUsyM1VUvDl9qZ_YQ":{"text":"best place ever\nvery good chicken but the biscuits were ok for me.but my family loved them","useful":0,"cool":0},"NaXttAwT-6bH3PTkj8dJDA":{"text":"If you plan to come here for some good Louisiana fried chicken, run like hell over to Pope","useful":0,"cool":0},"N0TqqxOeOfCjzWZJCGcYPg":{"text":"Ok so we may be biased as this was our first foray into food in New Orleans but this fried","useful":0,"cool":0},"yxvFsYEWFuUcXtuH8KApOw":{"text":"A friend of mine says you want good catfish go to willies I of course looked at them like ","useful":0,"cool":0},"zrZ0uKbxC8CMhTU2f9Lsjg":{"text":"Willie's had good chicken...but the daiquiri are the best......and i did see a big cockroa","useful":0,"cool":0},"3QoKoP2MVFNNZHy6m4-mPg":{"text":"\"that awkward moment when a chicken place is more poppin than the bar...\" LOL\n\nThis is the","useful":1,"cool":0},"9yhYTcp4Ha7Rx92zRgPmBg":{"text":"OMG...the red beans and rice here are the best I've had in life...ever. The biscuits are w","useful":0,"cool":0},"vxh9ylge39_qnKUgVI1OJA":{"text":"I seen the reviews and thought it would be really good.  Typical chain chicken joint.  Com","useful":1,"cool":1},"68ctQxhLWb4BP5tLrnQELQ":{"text":"Best drinking food there is in town haha. Had this for dinner one night, chicken tenders a","useful":2,"cool":1},"ZZte0TJv74MgmVwTJXijyQ":{"text":"I was skeptical to eat here because it's on Bourbon St. and also sells a bunch of those fr","useful":1,"cool":1},"ojJBx84hw-osL1zkCUm1KQ":{"text":"I don't go anywhere without Yelping first, and after seeing a 4 start average, I've gotta ","useful":2,"cool":0},"YvaK2qeEAgVY4sxau36Jow":{"text":"The food itself is delicious (it may be that I ate it at 1am, after consuming many drinks ","useful":0,"cool":0},"zaek3izcO_EZenmHzDgL8w":{"text":"Oh goodness, when in NOLA I guess you have to get some soul food too right? Well this frie","useful":2,"cool":1},"pocE2wEszpGrs0jtSdVHgQ":{"text":"Hats off to the guy on the A&E show \"NIGHTWATCH\"\nGodspeed to you for a quick recovery & ne","useful":1,"cool":0},"MrDjvIh22lJK5s7G4DrvJg":{"text":"Even if you are totally plastered and it's very late, don't come here. Alcohol significant","useful":1,"cool":1},"y8hMS4AR8vxcMs0jSbY_OQ":{"text":"Was craving fried chicken and we heard about this place from a fried. We got a 3 piece mix","useful":0,"cool":0},"gcOa1CtLCqoGPrg8MoqzHg":{"text":"We went back multiple days for the red beans and rice. We just couldn't get enough. Also t","useful":0,"cool":0},"S3xVHl0k76g_81GaXiavmw":{"text":"I found myself sober at this chicken shack around 3am on Bourbon St, and the food was exce","useful":0,"cool":0},"_JQUxCZoU_Z9QhQh4iagXA":{"text":"Willie's Chicken Shack is POPPIN! I love trying new places and of course with being in New","useful":0,"cool":0},"9PoJ2ZDIMM2Avj9UGCKy3g":{"text":"After party snack.  In San Diego this would be a taco shop.  Bit in NOLA you do what NOLA ","useful":1,"cool":0},"W8tD-MTP4O9Us5nYUEtpAQ":{"text":"A bit pricey for fast food - I assume it is due to the central location. \n\nWe shared the c","useful":0,"cool":1},"V7FS_3XbD908dZ9MK80K0g":{"text":"My friends and I went to Willie's Chicken Shack last night.  The sign clearly stated that ","useful":4,"cool":1},"HdSAYXNaGtr8CQbD6NcF7A":{"text":"My husband and I have tried to go to recommended spots for food all week... But willies (w","useful":0,"cool":0},"sFftABJLpFs8a3qX3obLWg":{"text":"Excellent fried catfish, chicken and shrimp!! We have eaten there 3 times out f the five d","useful":0,"cool":0},"E53m0RiqoT-7RZlAlyw3XA":{"text":"Heard mixed reviews about this place. We went not drunk and enjoyed it! The chicken is del","useful":1,"cool":1},"nuN8plmsttvBq98MTPUmtA":{"text":"Fried chicken, need I say more?\n\nSo greasy, but so good! I stopped at a Willie's on bourbo","useful":1,"cool":0},"fuf4eGlf6l8nw6JfZ_ScSw":{"text":"I created a Yelp account solely for the purpose of commenting on the biscuit,amazing.\n2 fo","useful":0,"cool":0},"K1Cv0IokBgXy61AROvNUww":{"text":"Still hungry after an over priced hotel breakfast, we ran onto this place on Bourbon in th","useful":1,"cool":0},"wj2f9Gvcj3ryCC50lkhK2Q":{"text":"The chicken and fries were ok, but definitely nothing to rave about!!! I was there the aft","useful":0,"cool":0},"WAWhzJO5Weco3wbH7bbHKw":{"text":"The chicken tenders are pretty good, the fries were nit fresh but the service sucks. We wa","useful":0,"cool":0},"Er0Sxttf_mHMcoE9AfWtZg":{"text":"This was our staple while staying in NOLA. The fried chicken was always fresh, and very mo","useful":0,"cool":0},"lKTV52U8_garbmEzLV6Zgw":{"text":"Good place if you are looking for a quick bite but nothing special. Reasonable prices but ","useful":0,"cool":0},"my5GuXfwlhD52JMVVAA1Eg":{"text":"Located on Bourbon street that is overloaded with bad pizza, half dressed women and daquri","useful":3,"cool":0},"bPIUyhSEonA-MSuJXobeAQ":{"text":"Great chicken and drinks. The hurricane was a little watered down but the Willie 190 was t","useful":0,"cool":0},"b39AEsmYqJZ0jOJLPwxmjw":{"text":"I ordered buffalo wings, cajun style sweet and spicy wings, and French fries. Being that t","useful":1,"cool":0},"6jg00Q9ON9mv3EIyRTWvgw":{"text":"Service and staff were great, however the food was not. Visited the bourbon street locatio","useful":0,"cool":0},"qsyLFi2fEDfoczmt6U3QRg":{"text":"Whoever is giving this place good reviews must be totally hungover. Looks like fast food f","useful":0,"cool":0},"4td0AX9N9ONi2abziQjCAg":{"text":"So there are several locations of Willie's but we went to one of the ones on bourbon stree","useful":0,"cool":0},"k_0NFTd2y_Tk3ceab8WwxQ":{"text":"Willies is a popular spot i notice. You can walked 2 feet and you'll  1 or 2 more. Not sur","useful":0,"cool":0},"IGcYBb_KndP9zzMoQYEfXw":{"text":"While visiting the great city of NO this was a great find not only of value but taste.  Gr","useful":1,"cool":0},"IFvEwiVLeb8li65m_IkYxw":{"text":"Nasty chicken serviced by a rude and argumentative employee behind the cash register. She ","useful":0,"cool":0},"iU7st5_F9NFAVqVUBKqLnw":{"text":"This is the cure to avoiding a hangover! I seriously enjoyed the chicken strips all THREE ","useful":0,"cool":0},"8wyQl1rnoPkByMbtl3we6w":{"text":"During my trip to New Orleans, I went out to a few fancy (and expensive) dinners to take i","useful":0,"cool":1},"2Y_HKcOTNAt_q9tSADSthQ":{"text":"I went for the decorative Bloody Mary with the chicken tender garnish on it but was told t","useful":0,"cool":0},"FFDf-avhumb6ZPg96Q3XOA":{"text":"Hi, we were just there and ordered 6 wings/ 1/2 dozen of each flavor for to go. We only re","useful":0,"cool":0},"UVFkP4MWC5EkR7nTvbonDg":{"text":"Ordered the fried chicken meal and it tasted just like Popeye's (I'm from California).  I ","useful":0,"cool":0},"DCfemhcMNguFVQ214Tur6g":{"text":"The food overall, surprisingly, was pretty good but the biscuits, wow. I will go back just","useful":0,"cool":0},"rrCxdsyhwr9hjOTU_MDbvg":{"text":"This place was delicious! Our flight was delayed so friends picked it up for us and had it","useful":0,"cool":0},"IycWzqGosVOC1Mwdv_T5Sw":{"text":"Good chicken not overcoated not greasy fries and tasty biscuit. I say yes to Willie's Chic","useful":0,"cool":0},"tdEI5uDXJK4ZNKOL3EguMQ":{"text":"Biscuits melt in your mouth! I was a little hesitant to try a chain like place like this o","useful":1,"cool":1},"tW9TqUb-9ivXqExqvb567A":{"text":"Something about this place is so ridiculously good at god knows how late/early in the morn","useful":3,"cool":5},"iY6Kxd_64goCqNRO4Ll-DA":{"text":"Came here during mardi gras ordered a assortment of chicken it was amazing it had that spi","useful":0,"cool":0},"XoO_yT89vGsy_vSrXCwttw":{"text":"Willie's is a chain and a pretty good one at that. Great place for the drunk munchies, esp","useful":2,"cool":2},"y7tNJhZoURZjOy_u7EL37Q":{"text":"My boyfriend was super excited about bringing me here. \"For the sides!\" he exclaimed. BUT ","useful":2,"cool":0},"uTOP0_Hy9p0PogpU4ATCHQ":{"text":"Willies, Willies, Willies!! I just so happened to stumble upon this little gem on Frenchma","useful":0,"cool":0},"euE4mQ9hF9wrXiNpyyiT-w":{"text":"Fresh, made to order chicken and fries. Can't beat that on a street full of crappy overswe","useful":1,"cool":0},"sR-UrJ7LVojwJDLdQEhDZQ":{"text":"While wandering along Bourbon street, amid the ear blasting music emanating from all the b","useful":0,"cool":0},"uT0dPvA5yeZIIixW1R2_sg":{"text":"One word: BISCUITS.  Can't say enough after our 2nd trip to NOLA.  The one place I was det","useful":0,"cool":0},"rAqjwyOl51isgXR-uuzE3g":{"text":"The Sweet & Spicy Wings were soooooooo good.\nAnd the biscuits. There aren't words in the E","useful":0,"cool":0},"Dxv6Yz7g1JTzTcsz9FrtAA":{"text":"Good for a grab and go place. Been here twice while on cruising the strip. Both the chicke","useful":0,"cool":0},"ZkFywXXz-PwHB76nJwqKtw":{"text":"$11 alcoholic drinks that don't get you messed up! We drank the whole cups and we bought l","useful":3,"cool":1},"KvKpnatacWs-76qtk0RdTA":{"text":"Food was descent (which is the only reason for any stars at all) but the girl at the count","useful":0,"cool":0},"okD847MdZyEarNYoFfHnDQ":{"text":"The food was decent. What you would expect for such a busy chicken spot. The Hurricane slu","useful":0,"cool":0},"v_z9y52vNWS-o47SHjic2A":{"text":"This place sucks is not great. I'm drunk. I wanted good chicken. This chicken is really sa","useful":0,"cool":0},"hRaU76LTOPFcT9lxmXfe8Q":{"text":"This was the worst experience we had the whole time NOLA. The cashier clearly hates her jo","useful":0,"cool":0},"VscfBcXEsKjYHD4tTw7eKA":{"text":"This is a fast food style place with a cool \"french quarter\" style ambiance. Service was v","useful":1,"cool":0},"QBRp2hu5nAU0X5kjcgWZFw":{"text":"The frozen drinks were pretty good. Kind of pricey honestly though $12 for a small and $15","useful":0,"cool":0},"XZ55ps5HikOfxE1rWG2KjQ":{"text":"No frills place on Bourbon Street to pick up a quick snack and beer. The wings and fried c","useful":2,"cool":0},"05E6vExS4jqdDr1Ibamqnw":{"text":"This place was like a a club version of KFC haha they have basically the same food. Fried ","useful":0,"cool":0},"XnQUfqdmzgdaN6VLy7fI9A":{"text":"On my first night in New Orleans, I decided to stop in this place to get some good ol' sou","useful":0,"cool":0},"lkHNWlvqqNbycuLpJTTCAg":{"text":"The owner is a horrible human being... harsh but true.\n\nOk, this place is on Bourbon stree","useful":5,"cool":0},"ou1a2I7AIpOBfYbjzPCfLg":{"text":"Late September 2015\n11 p.m.\n\nYes, I'm reviewing a fast food joint - don't judge me. For th","useful":4,"cool":1},"sTBuJQ7mw7WG2NgW7s5MhQ":{"text":"Good food, horrible customer service. Enough said. Last time I visit. With the right staff","useful":0,"cool":0},"UNU_WomzhDXO5zOFynjobw":{"text":"I visited this location because we were on Bourbon St and heard it was good chicken.  The ","useful":0,"cool":0},"xOii3BsZDL06MUDJ3yEDpQ":{"text":"Let me start by saying that this review is based solely on customer service. While in the ","useful":0,"cool":0},"JJZLGP3rFID9-h21ex66zQ":{"text":"If you're somewhere near bourbon street or the surrounding tourist areas of New Orleans an","useful":0,"cool":0},"vUPfYiUIqJloGOACPZrreQ":{"text":"If you are coming here chances are you are drunk.  REALLY EFFING DRUNK.  \n\nSo of course we","useful":4,"cool":2},"YptLwNbRsrDjP6MVjFEaEA":{"text":"The chicken is nothing special!!!! I was on bourbon it was late I was tipsy, my friends we","useful":0,"cool":0},"BCCEmQNjgz3t9zk4SqaRSA":{"text":"BEST FRIED CHICKEN IN NEW ORLEANS EVER!! We got the recommendation from an uber driver! Sa","useful":0,"cool":0},"BALERbhAMiweOwrHrWFxoA":{"text":"Visited several times while in NOLA. Food was delicious everytime. I highly recommend Will","useful":0,"cool":0},"vOFKlQdNEtQbKrSFIhMXVA":{"text":"I don't know what it is about this place, but we loved it. Pretty fast service and the chi","useful":0,"cool":0},"UBovQmsHyb9Z981WkTw0zw":{"text":"The fish was freshly fried to order! The quality of the fish was great. This was a good sp","useful":0,"cool":0},"-w4smsjwjLXk9oQwDcfvQg":{"text":"This was one of my favorite bites in NOLA. Maybe it's because I'm from California and the ","useful":2,"cool":3},"2_-rvJMJP8ChilMiMx-D9w":{"text":"My husband wanted buffalo wings and fries.. The girl took my order and somehow she forgot ","useful":0,"cool":0},"832JyxduSmSy6wg7wm4qTw":{"text":"We had the catfish basket, 2pc basket, and a slice of pizza. The pizza had a special sauce","useful":0,"cool":0},"lqgRTsEoAsC3yYA8Jab0-Q":{"text":"5 stars all the way.\n\nWe've all had \"great\" fired chicken. I know I have had it in hole in","useful":1,"cool":1},"gdWFvM3t9-qiLZeS3zQkzg":{"text":"In the spirit of Mardi Gras, it just dawned on me that  that I've never written about one ","useful":1,"cool":0},"9Pa-qt5rU1FysAWc35IVtA":{"text":"This is a place u go to just to coat your belly before a night of drinking on Bourbon stre","useful":0,"cool":0},"mvuVF6LELIzkI2jZ1oJ0Og":{"text":"U gotta go with the 32oz Willie's special daiquiri which is made with Bacardi 151 and ever","useful":1,"cool":0},"njZWp4MXFLykZK2Vg-2qig":{"text":"Really good food!!! The service was awesome!!! Definitely going back!!! Great prices!!! \"L","useful":0,"cool":0},"g5CRhZ1w730GClwh5KCmoQ":{"text":"This was a horrendous experience. We asked for 6 pieces of chicken tenders and received 8 ","useful":0,"cool":0},"ZVC0rREh_s9Fm5mOhRVMRg":{"text":"Great food.\n\nStaff were very unhelpful.  Tried to use the restroom and they claimed it was","useful":0,"cool":0},"x2Ry7FtevYCjraxIc9-9-g":{"text":"Absolutely impressed! Never felt that their quality was any less than 5 stars, quick and d","useful":0,"cool":0},"ubuWmTuD2pSiIdzlN_-iFA":{"text":"Willie's is always a hit! Love the ambience as they have the hip hop/trap music blasting i","useful":0,"cool":0},"-B4bFlsR_5IzVrqRfS-JgQ":{"text":"Everything was good. The chicken is probably some of the best I've ever had. It's just too","useful":1,"cool":1},"FVUif6EN-tW8TBuZsONcaw":{"text":"The food was so good! I had chicken tenders and cajun fries. I also had the big frozen mix","useful":0,"cool":0},"XjvsWVRjH31YlSCcX6n7vw":{"text":"I've been to the Canal St location a couple years ago (which I liked a bit better) but thi","useful":3,"cool":2},"kdrGjr068q8Lbj200jdbow":{"text":"The chicken wings were great, the cornbread was amazing! However your drinks ( hurricanes)","useful":0,"cool":0},"kbTPCIHCm0VvbZNwVFDxkQ":{"text":"I didn't care for it. It was like eating McDonald's chicken strips but at a higher price. ","useful":0,"cool":0},"c8EicsHGf94I1XBNG0i-hw":{"text":"This is a great go-to after a late night around New Orleans and you need something to eat.","useful":0,"cool":0},"30F_S_kcRc1pmzE7fxp2xw":{"text":"The biscuits here tho....OMG!! The chicken and fries are good! Also we had the catfish, wh","useful":0,"cool":0},"AYnMGpvYa6Pd2q5NpkF9pQ":{"text":"Perception is what brings the rating down here and reality is why I am giving it 5 stars. ","useful":7,"cool":4},"5WlFmOhMF9HbDNbIkZESeA":{"text":"After we landed in NOLA and put our suitcases in our hotel my friends and I desperately tr","useful":0,"cool":0},"WIbKXcNvNHIrf-vAfyYwbg":{"text":"Went here thre nights in a row at 3am. The chicken and biscuits were great, but even bette","useful":1,"cool":0},"PxbAyWV65LZGy_djp09Vmg":{"text":"worst service ever I ordered hot wings got regulay chicken","useful":0,"cool":0},"66p2VmXDgJ6T2Gh73cKBYw":{"text":"I'm only giving it one star because the food is good but the service is Was not great at a","useful":0,"cool":0},"7R9B2oIU5lg497vYAeJ20Q":{"text":"You will see a few of these in the French Quarter especially on Bourbon Street.  Surprisin","useful":2,"cool":2},"MQ0t7zf_ajNRbknnhZ5r2w":{"text":"We recently visited here Monday, 11/27/17, and my son was the only one who ate the red bea","useful":0,"cool":0},"byljDACqNyLSR3eDvuAo0g":{"text":"They advertise as being open until 1am. Got there at 12 and they were closed. I spent $20 ","useful":0,"cool":0},"Z9zOYUXbwLE9CUwZ85dP1Q":{"text":"After being disappointed with the chicken at Willie Mae's I decided to ask the Bell hop fo","useful":1,"cool":1},"yKneoJ0gXJPf-SsGVS0-gA":{"text":"Great fried chicken and music. Nice people work there too!","useful":1,"cool":0},"4XxsdO9j-v4bdutqk8ZGnQ":{"text":"This is a chain. \n\nPerfect for when you're drunk and need some substance or if you need so","useful":1,"cool":0},"CW-L_llizfxDiBmVvfcruw":{"text":"If you are a person of color or traveling with a teenager  I would avoid suggest avoiding ","useful":0,"cool":0},"CFL2E_1gq2sV0j-t0PXTcA":{"text":"Thank you for loving Willie's as much as I did! It's a perfect after party food and their ","useful":0,"cool":0},"ZaI46aMw2CjpFJ-rG7e7pA":{"text":"The chicken is great.   The fries are whatever.   The souvenir cups ALL leak.   I was ther","useful":0,"cool":0},"DD13sPVzpe65hZQ0sZfZ4w":{"text":"My sister and I ventured down to Bourbon St. and entered the festive mass of humanity on a","useful":0,"cool":0},"eY8fQzCocB_yvjgi8oS2LA":{"text":"Best chicken I've ever had. I ate here twice on my trip to New Orleans. The fries are grea","useful":0,"cool":0},"jSc3RDGp-47FtFn4hjQTJQ":{"text":"I'm here on vacation in New Orleans with some friends and enjoying every minutes of it.  Y","useful":13,"cool":1},"Xf7LjHn9HKnUCVE2HziNzA":{"text":"The food was soooooo good.  Yes, there were a ton of people.  Yes, seating was an issue.  ","useful":1,"cool":0},"tc501nKO2r3-MwSJzXNT3g":{"text":"Best fried chicken, amazing food after a few too many drinks or sober ! Probably doesn't a","useful":0,"cool":0},"KbkTV9HLbgJnXCuep4apwA":{"text":"Stopped in for a quick dinner while on Bourbon Street.  The chicken is so fresh and the ba","useful":0,"cool":0},"rctivJFVneqcxLsbgBkqUg":{"text":"This carry out chain has a location every 1/4 mile here in the French Quarter!\nI only stop","useful":2,"cool":1},"z3m8cCrKzfmhwO8pL1lFiA":{"text":"Late night stop for a quick bite to eat. The biscuit was amazing warm, sweet and perfect. ","useful":0,"cool":1},"s0dmjGLGNB0tzDwEkoZfgQ":{"text":"Stopped in just after lunch about 1:30 pm we were disappointed as the chicken wasn't fresh","useful":0,"cool":0},"7jilpjByFldzUve_cRtFug":{"text":"When it's late, you're hungry and you happen to be on Bourbon street, just follow your nos","useful":0,"cool":0},"vVmJJJZx55zOpCC7pQ15TQ":{"text":"Didn't expect much from a French Quarter fast food joint, but the tenders are pretty tasty","useful":0,"cool":0},"hX2S3CqzmSCwQ-ceKja53g":{"text":"Those drinks are all hype. I decided to forgo the touristy cock cup and ordered a 32 oz to","useful":0,"cool":0},"S6HMpkdNqKNHlKx8qd-Ymw":{"text":"Surprisingly good fried chicken and biscuits. We stopped in very late night, the place was","useful":1,"cool":1},"CldLu5mPeqf3Fe9kTYU3SA":{"text":"Their fried chicken was absolutely amazing \nThey have a bottle called the cocktail and i f","useful":1,"cool":1},"j77FH8hL5NYzSRYZ6SuXIQ":{"text":"The chicken is great.   The fries are whatever.   The souvenir cups ALL leak.   I was ther","useful":1,"cool":1},"FAfFQVaPNHPHTQHMSriSCA":{"text":"Ohh willies.. so many of these locations through out NOLA pick one any one & be sure to en","useful":4,"cool":2},"2sEy0Er30fBWVsb7Dcmfeg":{"text":"This dude gets mad Bc I borrowed a ketchup bottle in the building that's attached to him. ","useful":0,"cool":0},"NYT_ycMWeD_g5vCRAaJzDQ":{"text":"New ORLEANS!!!! This is definitely a spot to stop by and grab and quick bite especially if","useful":1,"cool":0},"A_mdiiNxf80Fitkfgh0RnQ":{"text":"Fast food fried chicken place. It is quite the same usual place like any other Louisiana s","useful":0,"cool":0},"B8HXqHkcXMRTYzuLyTAeYQ":{"text":"The best best besttt! Chicken is perfect, biscuit is soft and melts in your mouth, fries a","useful":1,"cool":0},"JFxIoQehjImmymHsS4Y8Hg":{"text":"DRUNK. FOOD. (But great!) I'm usually a big Cane's Chicken Fingers girl but this could giv","useful":0,"cool":0},"amwet8GlHzFjIa5JJxQE_w":{"text":"I would say the quality of the food is higher than Popeye's chicken. I had the 3 tenders m","useful":1,"cool":0},"R7571-k8h9te8qMloVmTmw":{"text":"Willie's Chicken Shack should be renamed Willie's Chicken Crack. During my weekend visit i","useful":4,"cool":0},"yubh03EpimEyoosvAle__A":{"text":"Ok...I ended up here after a yard of of voodoo juice and hurricane frozen drink. The chick","useful":1,"cool":0},"yzvlzLqZfsv0_GdB2_H1tg":{"text":"Went late night and waited feeling disconnected.. Even after leaving a tip.. misled into o","useful":2,"cool":0},"eu70XZo-3CLMO20tfzo5fg":{"text":"Sometimes, I will post a long, drawn out review. In this case, that is not necessary. BEST","useful":0,"cool":0},"QHnR3nAOD-RR5t75obhrhw":{"text":"I mean I could not find anything to complain about. I got there before the big rush and th","useful":1,"cool":1},"CJ6zNRGWtPLpjfRrzhpTrQ":{"text":"I've had some good chicken in life, but one thing I love about Willie's is that it is brea","useful":0,"cool":1},"A3bpd_eZdRiAQsD64pFpNQ":{"text":"I was commenting to my friends about the accessibility of Willie's pretty much everywhere ","useful":0,"cool":0},"qdK1eGnmzdBHHMIdrhiekg":{"text":"New Orleans is a amazing place full of incredibly nice people. Andre is no exception. From","useful":0,"cool":0},"WK_1nixlMW58YNiwzwBW9A":{"text":"Sweet mother of Jesus, this chicken is SPICY. When you bite into it, you see the orange/re","useful":0,"cool":0},"bWnnCb7uNgIbRRvVdFnhQg":{"text":"They say, everything tastes good late at night. I add, it will taste horrible when you get","useful":12,"cool":5},"0bda5kn4cmVVkBFeNzAWUw":{"text":"Its a place for rats chicken rats are everywhere in willies chicken/rat hotel i will never","useful":0,"cool":0},"bJZGw4Fwo8N2OM-r0SYE7A":{"text":"An incredible can't miss in New Orleans, but only after midnight and after 3 or 4 hurrican","useful":0,"cool":0},"H1V7eEEJNBbR3adK4Ofe-w":{"text":"Stopped in as it was the closest thing to the hotel and we were about to check out of our ","useful":1,"cool":0},"4-hInYiOEgeZJNVMF4zzCg":{"text":"This is standard run of the mill fried chicken. Essentially just for drunken tourists. In ","useful":0,"cool":0},"cMd5qUj-l5b47IBwKr02xg":{"text":"The best fried chicken and biscuits EVER. I visited NOLA and tried Wilies on the first day","useful":3,"cool":0},"09_FhROPm-ksAusXWDc90w":{"text":"This place holds heat a like a mugg. The lines move slower than expected when you can see ","useful":5,"cool":3},"d6eL7QFO7ZABDnBBm8lkug":{"text":"Willies chicken is the best fried chicken! I got the 3 piece chicken tender and fries and ","useful":0,"cool":0},"FIMXRkGB0dDa5yxynaGn7w":{"text":"A must try if you're visiting from out of state!!  Their chicken's so full of flavor, cris","useful":0,"cool":0},"dU0qd1sfYa7pxHdDVgtevA":{"text":"I had to try southern fried chicken but wasn't able to go to a sit down restaurant.\n\nI was","useful":1,"cool":1},"oG-i93u0Z9QjGv3ABqjpUQ":{"text":"What more can I say? Willie's was my go-to spot while on vacay, especially before or after","useful":0,"cool":0},"-Q3cLrsLJmLjTeZrez7Xpg":{"text":"Food was actually really good. I got the wings and catfish and I loved every bite. It was ","useful":0,"cool":0},"qIvfpor9FFKYYTcQBndwAg":{"text":"The chicken is really good.  I mean the spices are infused with chicken. It's great.  The ","useful":0,"cool":0},"k3NK8WTmKGKYGD-ar3frEA":{"text":"Great food, I love the biscuits! Service was fast and great customer service. Only thing I","useful":0,"cool":0},"Uagz2d8zce5lU1qOUhdFyg":{"text":"When in NOLA,  you must try Willie's chicken shack.  There's a bunch of them.  I think I c","useful":3,"cool":1},"ipQYCsLpoMANamRfPTJDVQ":{"text":"The chicken is like no other. Super juicy and crispy. A must try down in NOLA. Shout out t","useful":0,"cool":0},"f2ts3Ky8T5Tr8B7Ej1B-Iw":{"text":"Just came for the drinks! They had a big selection. My favorite drink is the pina colada. ","useful":0,"cool":0},"J-WdJ5YnCyZ4gTFEmgwUjQ":{"text":"THREE Willie's Chicken Shacks in the Quarter, and we had to stop at this one.\n\nOh boy.\n\nDe","useful":1,"cool":0},"vMaWzr8m41CWpUMxJEMBSw":{"text":"The chicken here is mouthwatering and fried to perfection. They have plenty of sauces to c","useful":0,"cool":0},"T5DnCu4rM4qzmfzDlEUtbg":{"text":"Look now I know this is a chain but man the food was good quick and easy.  When your drunk","useful":1,"cool":0},"hZkXiNhxFYEK0_r490ZZUA":{"text":"Yummy goodness... If you need something quick to soak up your liquor on Bourbon street the","useful":0,"cool":0},"fMMPYG4XmtWPfMFH2cThsg":{"text":"The only thing this place for is getting stabbed or getting food poisoning. Whether you're","useful":0,"cool":0},"yRtQjC8y0uHLJGyJIFmgBA":{"text":"Whew I'm so full! The wings were fried to perfection, jambalaya was seasoned just right, a","useful":0,"cool":0},"AZs6JvWUWhUeumRHp3zkNA":{"text":"It was late ... I was a bit drunk ... Willie's was across the street and still serving chi","useful":1,"cool":0},"hL9YYIhyTE-X4r01fjz0Kw":{"text":"I really didn't have high expectations for this place...boy...I was pleasantly surprised. ","useful":0,"cool":1},"9sSyDTRSRpr6hvHMvT7Jwg":{"text":"Not bad for a bite while walking around. They have good fries too! Whenever you pass by on","useful":1,"cool":2},"epH9fzSfBMv33CFRKVaFzA":{"text":"This fried chicken is bomb!!! The meat is juicy and the outside has the perfect crunch and","useful":0,"cool":0},"kht9b7vPpxiDZbtPDat3dw":{"text":"This chicken is to cry for. I've been here everyday since I've been here. Every short trip","useful":1,"cool":2},"nzbZi1eiMwA2BzwD3O5k6Q":{"text":"When on Bourbon Street and you want something quick to eat that you can carry with you, th","useful":10,"cool":9},"Pur5jbOBMFSELDiv0L6caA":{"text":"Wow! This place is the perfect accompaniment with a great Long Island. The wings are huge.","useful":0,"cool":0},"7JiUEnRkngltX3SiCnXxWw":{"text":"This place is a MUST try! I'm not sure if they bake the biscuit with honey inside but it w","useful":0,"cool":0},"Ow9NowcgYpICpeAHwWGL0w":{"text":"Fair to Edible chicken and French fries, with the seasoned crunchy coating. The hard, dry ","useful":1,"cool":1},"qmt9cqHCEuPFmDYErHC8eg":{"text":"Staff at 630 bourbon street in the French quarter don't ever go eat chicken there I walk i","useful":1,"cool":0},"cYOrTcQ3VgXj7GaT6xsdDQ":{"text":"Being from New York the only fried chicken I can really rely on to be \"Louisiana style\" is","useful":3,"cool":3},"f3ssIt6r9VlE59Sp4ho19Q":{"text":"Ok I'm writing this review tipsy as hell so forgive my typos that auto correct didn't corr","useful":1,"cool":0},"UjL3IL6200rGqNrP_miNWg":{"text":"This restaurant was recommended while visiting NOLA. The chicken here is the best I've eve","useful":0,"cool":0},"pZezDEm5syMcYy4QvB-0cA":{"text":"We always eat here when we are drunk lol or when we are about to! Lol\n\nThe first time I at","useful":3,"cool":0},"RqJFGqMt33AZbpKwul1jaw":{"text":"The food was decent but the service sucked. The lady barked at us. Treated us like we were","useful":0,"cool":0},"FS9TWBfX2YZrOtaGCZboDQ":{"text":"Flavorful & inexpensive slushees & delicious biscuits - what's not to like? Their menu not","useful":1,"cool":0},"1YipMisXxD0Q2zyklc5kSQ":{"text":"Did I seriously eat at two separate Willie's Chicken Shack locations while visiting New Or","useful":4,"cool":3},"CofyK_3J2egD61VvQPoLFg":{"text":"When you're drunk and hungry, ANY Willie's Chicken Shack is a great place to go.\n\nI got th","useful":0,"cool":1},"Bya82c354adL0des0c3rCg":{"text":"Ordered my food and paid in cash. Then to find out someone else took my order, they had no","useful":0,"cool":0},"ckvM14p3DrzTfFP43XeEzw":{"text":"If you're wandering around bourbon street hitting up all the bars and need a quick bite to","useful":3,"cool":3},"htbJMLN-MTWLyHNHrzaCjA":{"text":"Skip Lucky Dog as a late night snack and go here! \n\nReasonable priced, fast service and de","useful":1,"cool":0},"psPVdyMwSMw-k1Arg-l64A":{"text":"Willie's is a must in NOLA. Their chicken is moist, well seasoned, and crisp, just how I l","useful":1,"cool":1},"jPOy9laCkonAILwLba4PGw":{"text":"To be fair, we went to two different Willie's and had different experiences at both. So th","useful":0,"cool":0},"jtW9WY_Xy9p-2m4k-QQDIA":{"text":"I so wanted my daughter to enjoy your chicken but was immediately turned off when I saw yo","useful":3,"cool":0},"KoAMyjRd1o4OHa6RhZtiiw":{"text":"We dined here during Mardi Gras weekend 2020. Due to Covid, I'm late on the review but it ","useful":0,"cool":0},"-SOU77TVGF2MtFcMGbGohw":{"text":"Total rip off. I think popeys are better by a lot. We were visiting New Orleans, and it se","useful":0,"cool":0},"f-XuRHx7v9Um5HDCq96bBQ":{"text":"I'm merely giving this place three stars because I can't really say whether the chicken wa","useful":1,"cool":0},"IHi7mk0zRbb9sIBonNcfpA":{"text":"Went to one on Bourbon St. Biscuit was absolutely delicious but the chicken made me litera","useful":3,"cool":0},"cehYxqqG1DORVIKMnZcwZw":{"text":"Visting friends over the spring break and wow!!!!! The best chicken wings and biscuits. Wa","useful":0,"cool":0},"DdbKxDJILlGUcthVmgoeyA":{"text":"I have to say this chicken was not bad at all. Keep in mind I arrive late into new orleans","useful":0,"cool":0},"2xsykNN3hiWikYykmPoJzA":{"text":"I visited this Willies Location during my vacation.  The smell of the chicken is heavenly ","useful":4,"cool":4},"3PJNVSSGqXPJFLCjlMn7mQ":{"text":"Their fried chicken is actually incredible. We were not expecting such good chicken and it","useful":1,"cool":1},"lPNLDbmvBOR2hkOvW6ZVIg":{"text":"I had a fabulous experience here!! The lady working the front was so friendly and the lady","useful":1,"cool":1},"DATn6sv3v8CW1d5TNPPo2w":{"text":"Willie's has great service. Your chicken is cooked to order and there is not a long wait. ","useful":0,"cool":0},"Ose-Y5E6wmgzFoA55vRaWA":{"text":"Better than Willie Mae's Scotch house. Faster. More affordable. Comfortable. better locati","useful":0,"cool":0},"ixK-Vq868Tbk12zRxXAaPA":{"text":"We originally were at another location but the workers at the cashier were just plain rude","useful":2,"cool":1},"HQjUwoppfQrCkv-ttBWyWA":{"text":"For it to be a tourist trap, the chicken was served hot and had plenty of flavor. \nThe lad","useful":0,"cool":0},"94vvOzQuz4o0f7ViH-pz9Q":{"text":"I so wanted my daughter to enjoy your chicken but was immediately turned off when I saw yo","useful":4,"cool":0},"HOb_aDUUkNd2JCmoqSkoAQ":{"text":"Let's talk about this fried chicken. \"It's slap yo mama good.\" \n\nPrice: $10.99 for 3 tende","useful":4,"cool":4},"pTuyO4Mp7N81u4jG8-hS7g":{"text":"Food was extremely fresh and hot. The only reason I'm giving two stars is the pretty decen","useful":7,"cool":2},"spxK7x2-EezH0ScUkgK0mA":{"text":"It's good fried chicken, especially when you're out exploring Bourbon street and had a few","useful":3,"cool":2},"MNC1183f6_slK82bCWPE5w":{"text":"Just made it to NOLA so I wasn't drunk yet.  Even if I were, my review probably wouldn't b","useful":1,"cool":0},"ikNvtNbelwK9l7t79HFbeA":{"text":"My wife and I spent 8 days on vacation in New Orleans walking distance to the French Quart","useful":0,"cool":0},"8JD66_HuSyD50M1osrq4ww":{"text":"As a tourist and lover of all things NOLA I instantly fell in love with this fast food cha","useful":2,"cool":0},"yZZK1BFOa3nVYSkqu6N28Q":{"text":"My first time coming here was a month ago at 1am and I was tipsy as heck.. I thought the c","useful":0,"cool":0},"wPkuXtN2GR5R4C64MIkRPQ":{"text":"We went here on Friday 5/28/21.  The place was busy, the front three tables were being tak","useful":0,"cool":0},"JA5u146iEvNrpaN8rKM5ng":{"text":"Oh my goodness, where do I begin?!.... Willie's chicken is theeeee best fried chicken I've","useful":3,"cool":0},"a1FMj8_4tRTy0hDEDKRNLQ":{"text":"Greasy? Yes. Grimey? Yes Uncomfortable Yes. Great food!!?? ARE YOU FREAKIN KIDDING ME YES!","useful":1,"cool":2},"QDgqbODsXMZcaAN_HH9bnA":{"text":"This place is the best thing I never knew I needed! \n\nFirst time in NOLA in the French qua","useful":2,"cool":1},"EGLOswVy2Db-M0zGwwNzOQ":{"text":"Okay so we went to this location twice. The first time it was because it was the closest t","useful":2,"cool":0},"rA_RYCULL7iQHYHf3jiurQ":{"text":"Late rolling on the review, but it's oh so good.  I learned about this place, in all locat","useful":3,"cool":2},"TVr_Fql02fPQ4cGK1GKcDg":{"text":"Good place for a quick bite to soak up the Bourbon Street booze - and even drink more if y","useful":6,"cool":5},"yvwhotB79XG-wmq7ENpY6Q":{"text":"Poor customer service. Made incorrect drink. Refused to correct. Very disappointed since t","useful":0,"cool":0},"_PprYqvqECirRyIwAUHN4g":{"text":"My last meal in the city. \n\nThe original plan was to come here after dinner, but we ate so","useful":4,"cool":3},"5OOTfYo09Bb-_7njJQYO5g":{"text":"We discovered Willie's during our first visit to NOLA  in June of 2019, and *had to* retur","useful":3,"cool":2},"3fcEAZfM7XtJi_H7pICvFA":{"text":"Willies is everywhere and I was kind scared to try it at first, boy was I right . The food","useful":1,"cool":0},"sFAKRjNqmWDm0-jf7CRlbQ":{"text":"I love Willie's; but this location on this night was staffed with people who hate their jo","useful":2,"cool":1},"fld0QQyCeBduz6cIR9U5aA":{"text":"One of my favorite places for late night fresh fried chicken. So good !! Beer is 2 for 1 a","useful":0,"cool":0},"YVVgreYGpvkZ8UxQqbBz2g":{"text":"This chicken shack is amazing !!! omg .... we had a couple of items from here and it was  ","useful":1,"cool":0},"tjSpjHCbJ7or-QG9E8qa2Q":{"text":"If you're willing to wait 30 mins while watching employees argue with customers, this is y","useful":1,"cool":0},"smMooI7ovQ1269_ornzeCw":{"text":"Pros:\nCooked to order\nFriendly Staff\nLots of alcohol\n\nCons:\nSalty\nGrease was old\nNo restro","useful":1,"cool":0},"b_f3r5lG_m5hLHEGv0Lyxw":{"text":"This place is awesome! The fact that it's on Bourbon St. is disappointing because I don't ","useful":1,"cool":1},"GYX-NfeoTpUoupCcKJ3yfA":{"text":"After walking up , down and all around Bourbon st. we stopped in here for some chicken to ","useful":2,"cool":0},"TlWdqI8rUpIrfusWf-55Ww":{"text":"That's some gooooooooooood chicken right there. It's always:\n\nHot\nFresh\nSeasoned\n\nAnd gooo","useful":2,"cool":1},"mFBZos5FcWLqeOpYZiXkzw":{"text":"Chicken so good you'll slap yo mamma?!?\n\nMore like biscuits so good you'll slap yo mamma. ","useful":11,"cool":3},"bjLDuMp3zpRP7DHwFnkIgQ":{"text":"Disappointing. The food (chicken, french fries, biscuit) was soggy with oil. The chicken i","useful":0,"cool":0},"MfHHPrUy6IJcp8KLseEKEQ":{"text":"Great chicken and drinks.  Love New Orleans.  I think they must have more awesome fried ch","useful":1,"cool":1},"3xQTQ8OzsIkhr4g0uY0naw":{"text":"Great service and I love their jambalaya a little spicy but I can't stop eating it\nTheir c","useful":1,"cool":1},"8oQ9mqBEsN3Ni7YMjcQa6Q":{"text":"Oh ya! Sweet Willie knows how to make chicken the correct way. \n\nWalked by several times a","useful":6,"cool":3},"VALzd17muPCVpDBtt_JSMA":{"text":"A huge living rat sitting right next to me on the floor was what drove my wife and I to le","useful":0,"cool":0},"t7qhJ7mDw8SntwDrRGKpag":{"text":"Yes, you guessed it. We were partying on Bourbon street and needed some fried goodness to ","useful":8,"cool":10},"tdPFXS7AEhuvZKsDUUkE2Q":{"text":"Probably the best fried chicken I've had.  Probably the worst service I've had.\n\nThe staff","useful":3,"cool":0},"wmvMPp_yV2cZ4lVnNlTuMw":{"text":"This spot was fun and the staff was really friendly.  The food was freshly made and hot.  ","useful":3,"cool":3},"-LaKo1dhXRzsF2A9WVuGMQ":{"text":"There are lots of Willie's around the city and it's one of the first places that came up i","useful":2,"cool":1},"T5LFRXNVbLgBLwJ-5IaA8A":{"text":"Yes yes yes yes yes. Delicious food all around. Very convenient. And amazing after a long ","useful":0,"cool":1},"4ATtamM3adxzCZaxn4HbYg":{"text":"Ok for this review, I'm just going to review the actual chicken itself.  I'm from Californ","useful":4,"cool":1},"fbKQ99j1aTksZBjb3gH4NQ":{"text":"I can't lie - I'm a huge fan of Willie's. While visiting NOLA, my boyfriend and I got froz","useful":2,"cool":1},"ThgScXbWMqh56UNK-QQb9Q":{"text":"My wife and I had lunch there about a week ago..She had the jambalaya and I had the shrimp","useful":0,"cool":1},"9vQKQe3YqomQ7rCrAu09ww":{"text":"Yeeeeees! I love coming to Willies when I come to NOLA. Now I know I pay the crazy price b","useful":1,"cool":1},"C-GImXGywVSN5u8_sllYow":{"text":"We love this place just sad that the ones near our hotel was closed when they are open\nThe","useful":0,"cool":0},"hIb_LONg8_scibQpsrt16g":{"text":"Another typical OVERPRICED spot on bourbon st. Came here at the end of my night .. excited","useful":2,"cool":1},"4vdSkhZ_A4r7TZP3Psdm-A":{"text":"Meh. Decent chicken. Pretty pricy. Fast service. Kind employees. Full bar. Good snack if y","useful":1,"cool":0},"_deHe4gFqCXyzyR2BzKehw":{"text":"The average marathon runner will burn over 2600 calories before crossing the threshold of ","useful":2,"cool":1},"JqHSuHT2ntzjth9ieqg-tw":{"text":"Stopped by here late night for a snack. I love chicken strips and this place did not disap","useful":10,"cool":8},"rhVj7W9ql41A0nSb9v526Q":{"text":"I came to New Orleans for a bachelorette party and during the 3 days we were there, we had","useful":1,"cool":0}}