{"VboSFr2s6RPqPiZuQnuUrg":{"text":"We got the urge to sing during my bachelorette trip so was pointed to Cat's Meow.  We put ","useful":0,"cool":0},"FQWKPPjs5dCqtfnLScB6jQ":{"text":"Had a great time at this bar. It was fun watching the people try their hand at karaoke. It","useful":0,"cool":0},"rMR7yZ2kfviS6qPt0l3MRQ":{"text":"KARAOKE! This bar is lots of fun! There is karaoke on the first floor, a cool outdoor spac","useful":1,"cool":0},"7U_RKZuxQ4mHyQSw4dDJpQ":{"text":"I'm not from here so I could see how the people from here might not like this place. I had","useful":1,"cool":0},"ksRqAu5RJ95rtHW2XakZEQ":{"text":"Not my thing.  Too many bros and not enough sisters.  It's also on Bourbon -- yuck.  Too G","useful":0,"cool":0},"dPO5kV8IKMUyeFYfIj3WzA":{"text":"I have fond memories of Cat's Meow from long ago - singing on stage with my fraternity bro","useful":1,"cool":0},"eG6kYzh6lLVyqrZUzBAnLA":{"text":"(Somehow) world-famous karaoke bar that's both overpriced and atrocious.  Seven dollars fo","useful":1,"cool":1},"dcGSX6GumXmqFhTWXnRemA":{"text":"Really fun karaoke bar. Good environment whether you want to hang out and people watch, da","useful":0,"cool":0},"cglIA9taC1dWCxus9-ZodQ":{"text":"This was a fun place to catch a drink and people watch from the balcony. The karaoke was g","useful":0,"cool":0},"SDh9NZs1BpG4sntyLyn17A":{"text":"Just go here, it's the best bar on bourbon street!!! The energy is fantastic and fun lovin","useful":0,"cool":0},"-O-IaCWWkD_hTWs1MwNWNw":{"text":"Came here with a large group after a wedding and had THE most amazing time. Travis the DJ,","useful":0,"cool":0},"Inx1dBNQQTkGuzT6Vfofzg":{"text":"I came, I saw, I drank the local Abita beer as well as a few mixed drinks, I sang quite fa","useful":2,"cool":1},"P8y7mLRQpIq6ePBNoolyDA":{"text":"My boyfriend and I were here for hours last night!! We left and ended up coming back!! I l","useful":0,"cool":0},"8CXznTbYiVia-_Z2YKjggg":{"text":"Went to this place two nights in a row and it was cool. The host definitely makes it fun a","useful":1,"cool":1},"h_IeFNrq_oq6Kz1oRw72Gw":{"text":"Asked to not sing anymore by the board controller. Must have been terrible :( won't come h","useful":0,"cool":0},"cMN_VKg-0H1GV0_tb_hmSw":{"text":"Anyone can be a Rockstar here, especially after a drink or two. Been here many times. Fun ","useful":0,"cool":0},"VGuzN_SMHEQejAA0b1KdcA":{"text":"Fun little place. Got to hang out with some new friends. Enjoyed the balcony and outdoors ","useful":1,"cool":0},"FXC0gwkpEYWh45vK2M-t6Q":{"text":"Best place on Bourbon St.\n\nGo there.  Tell 'em Hope & Hannah for Alaska sent ya.  :-)\n\nSer","useful":0,"cool":0},"baB5WPu3xP5Ga0__cJrEzQ":{"text":"SO FUN! I usually don't like karaoke, so when my friends dragged me here I was reluctant. ","useful":0,"cool":0},"AbI3jPQIPkJrcUZZDHqzKA":{"text":"Jesus - this place sucks.  This and other places like it also break my heart as a native. ","useful":0,"cool":1},"xJwhkWGrldRyClTn5-g6yg":{"text":"This is my favorite bar to visit in new orleans.  The KJs are Awesome and the enviornment ","useful":0,"cool":0},"HNtmzKpKV3XGNDl6qMFe7w":{"text":"One word...FUN!  No matter the time of day you come here, you'll find bridal parties, birt","useful":0,"cool":0},"sIeHMKx_L7tLdoEb9kMqEA":{"text":"Touristy but fun place overall. Drinks are pretty mediocre. The karaoke DJ sang at least e","useful":0,"cool":0},"NmWFSzd2cm2_8_18P6Lt7A":{"text":"This is our favorite place in new Orleans truly our happy place it's the only place my wif","useful":0,"cool":0},"H_li82AF9cZr5rL4rkoBag":{"text":"OK, so I'm a tourist, what can I say? Fill me up with 2 gallons of beer and throw me on st","useful":0,"cool":0},"dB4yyMdLKuMrf3v-2q8O9w":{"text":"This is a divey Karaoke place on Bourbon St. There is a balcony and a couple of bars insid","useful":4,"cool":2},"EtqVnzx4yGzmx6wAymtWIA":{"text":"Drinks are about $8 hurricanes are super strong. Three will put you on your a$$. Great, fu","useful":0,"cool":0},"kUGez6t_NVKMMqXIcO4m2A":{"text":"Fun karaoke spot on Bourbon.  Your experience will depend on the night of the week you're ","useful":1,"cool":1},"zT2NpqPj8IXOEN6oE7w37A":{"text":"Live karaoke!!!!! Did I mention you are going to be singing on stage and the crowd with be","useful":0,"cool":0},"FK7P4oTmS3jgkvgxu4vNHg":{"text":"Michael with the beard!!!! Ask for the pineapple upside down cake drink!!!! He's the bomb ","useful":0,"cool":0},"rtoQyecLldaAONrbiTyoEg":{"text":"Cats Meow is your spot on Bourbon for alcohol and karaoke. The presenters are full of ener","useful":0,"cool":0},"33R19qs4O34xgfUkLx6-2g":{"text":"The karaoke wait times are ridic!!! TWO HOURS?!!  WTFFFFF.  So if you're going for karaoke","useful":1,"cool":0},"WeIiw_EJOfoOSrSHbnYdGQ":{"text":"We went here on our last night in New Orleans. It's a very enjoyable and entertaining kara","useful":1,"cool":0},"VJey4Z_s4njgWQxBFKzOxw":{"text":"I dont care what any of the reviews said my night here was one of the most fun I had in Ne","useful":0,"cool":0},"ca_FIBjlj52vaP3bzhWr2Q":{"text":"The happy hour was a blast- and a great bang for your buck. The drinks we ordered were hug","useful":0,"cool":0},"rpmxon_obgSaV1aDUkwBbw":{"text":"We were told this was supposed to be the best karaoke place in town. It really was a fun n","useful":1,"cool":0},"R57CFFMZ93VkcjJXGJH-eA":{"text":"Correct me if I'm wrong but CM is one of the only karoke spots on Bourbon st.  No cover bu","useful":0,"cool":0},"79u7cJhGgRId3_qGREcjrw":{"text":"If you are on Bourbon St, you should go to the Cat's Meow. Best bet is to go to the back b","useful":3,"cool":0},"GcIJHaFoCCUKv4k0apB1UA":{"text":"The management totally sucks and the owners are totally lame skulls!!!!!!!! They won't let","useful":0,"cool":0},"-aMAyrmUhWlBYT01w3xsYA":{"text":"Such a fun place to go on Bourbon Street.  We didn't get up and sing but still had a blast","useful":0,"cool":0},"iSgmAJgCjMlEI20JDjSS3g":{"text":"If you want karaoke on Bourbon, dis is it (literally). \nMy profesh org had their every-oth","useful":2,"cool":0},"xwxmB1Z7Nb9EQZmmiUmFKg":{"text":"This place was destined for me because Karaoke and Cats. It was my first time to New Orlea","useful":0,"cool":0},"ZAv9kcnYnHQuinGUTXFQow":{"text":"Never been to a kaoroke bar where the hosts sing every other song. Dumb. Worst bathrooms i","useful":2,"cool":1},"uFXvaJxm9-VS1Jmcty7i3Q":{"text":"My favorite place to go on Bourbon Street. The hosts are amazing and keep the entertainmen","useful":0,"cool":0},"lpJdOLzCoIhURnQYwq01GA":{"text":"I'm going to caveat this by saying that I spent one night here from 2-4am while visiting N","useful":0,"cool":0},"P1y9BBTg9xbgSgjTAOaKtQ":{"text":"This was my absolute favorite place in New Orleans by far. We went here two nights because","useful":0,"cool":0},"57JARcioNwQnhQUezO_IrA":{"text":"Atmosphere and people were great. The problem is that the karaoke host seems to think he h","useful":0,"cool":0},"leE39_Tk9o5k-IZoxOUz1w":{"text":"Pretty cool karaoke bar on Bourbon Street. Everyone has to perform on a stage with bright ","useful":1,"cool":0},"CcA35wVJ0-WeyDtQdNPV2w":{"text":"Where to start? As soon as I heard of there being karaoke on Bourbon St., I knew we had to","useful":0,"cool":1},"JVnDZGFUFLNBn4JQb0BIlw":{"text":"I have had a lot of fun here! but it can also be really intense. I like to go on a random ","useful":0,"cool":0},"MFNlLdex-UrzTq0ax5MSKA":{"text":"I was here with friends this past wknd for memorial day, we came to this place our last ni","useful":8,"cool":4},"qQQnrrIH9jW2i6QEJQOXvA":{"text":"Fun Karaoke Place. I know there are many many many places to pick from on Bourbon St, but ","useful":1,"cool":0},"k9F9QK0KYGAOk6lnyuM9kw":{"text":"Amazing atmosphere - plenty of good drinks, karaoke, and dancing! Definitely one of the Bo","useful":0,"cool":0},"rUq50mPh3F8ii5Cmdx0jlg":{"text":"the night we were there the singers were bad but still fun. Its fun to watch all the folks","useful":0,"cool":0},"D5JN9vwEBIGAjolOmsc6cw":{"text":"I was in New Orleans for two nights and I came here on the first night. I was out back in ","useful":2,"cool":0},"36zBEJmfdc55LIPFPA66vg":{"text":"Same crazy place as before Katrina!  Lively crowd, great friendly entertainers and songs e","useful":2,"cool":0},"gf9GGyvmbd2OkdXk9PnOdA":{"text":"Like everyplace on Bourbon, this place was crazy at 2 PM on a Sunday! lol.  Partly due to ","useful":1,"cool":0},"eoN1nQkU9oU8_8YkfMJ3cw":{"text":"I visited the Cats Miaow with a friend one night when they were having a 3 for 1 drinks sp","useful":0,"cool":0},"2yUGfNwCSVPpjsSkgdNmmw":{"text":"I did not want to go here. I repeat...I DID NOT WANT TO GO HERE!\n\nBut when you're in town ","useful":2,"cool":1},"S_xdd-3rh2nfHZZKdFP_cg":{"text":"If you like a place where the host sings half the songs when 20 people are waiting in line","useful":1,"cool":0},"bwXSxXUIRWtuswz9gLeKdg":{"text":"Had a blast!!! The young lady MC, kept a good flow going.  She was funny, but not rude.  B","useful":0,"cool":0},"8F3qG7SgWZhK_964elnfvA":{"text":"Eh. Pretty much like every other karaoke bar ever. The most entertaining thing at the bar ","useful":0,"cool":0},"ygLNxuuxSWSqEC-m0X1-HQ":{"text":"I used to live in New Orleans. In the early-mid '70s. Now I live in Littleton, CO, I have ","useful":0,"cool":0},"TNFb8xd4YI1olamEmm8GhQ":{"text":"This place gets 4 stars because the girl running the show was absolutely amazing. We came ","useful":0,"cool":0},"0G_jFGKImUT5R_SUDZK4YQ":{"text":"This is the first place I ever got drunk and sang karaoke...much to my friends' amusement.","useful":0,"cool":0},"uLoA0fFNAwoKAyGNVewZaw":{"text":"When in New Orleans....this is one of the 5 spots that we hit every time.  Watching the Ka","useful":0,"cool":0},"vdSzcgnkkWL5ivyHXEePZw":{"text":"I was so pleased running into this spot! Was there for a little while and just over all ha","useful":0,"cool":0},"-fdR_bl8IU-IYz8UQbwisA":{"text":"So, I hate Karaoke. It instills fear in me that I may possibly be dragged onto that pitifu","useful":5,"cool":5},"61cTrnoQr1DhP_Y8MgpAQQ":{"text":"I would give zero stars if I could.  We went here because my friend loves karaoke.  We get","useful":2,"cool":1},"OyISUX6xbVtqdg4GwsarEQ":{"text":"Absolutely terrible.  This should not be called a karaoke bar. It's one singer with a shor","useful":1,"cool":0},"cO_Rh5vl3tug3t5Se3zREg":{"text":"I LOVE KARAOKE! The problem here is the host on Wednesday nights (I don't know her name/wi","useful":4,"cool":2},"spzeX0QI1jIOVVp5XOBvtA":{"text":"I just kind of wander around Bourbon Street and go in/out of bars when the music calls me.","useful":9,"cool":8},"WjJILN_KwFOP_LtjQZJqFA":{"text":"We went on a girl's trip and ended up at the cat's meow twice--once in the afternoon where","useful":0,"cool":0},"YcReeSjsoSf5D-uA6dd8-g":{"text":"The best time we had at a bar on bourbon. On stage Karaoke, where you can sign up and sing","useful":1,"cool":0},"p_wLDmR3_yAE00uHYdK-Hg":{"text":"Wandered in here on Halloween and from what I saw; I liked it.  Was able to easily get dri","useful":0,"cool":0},"Em9GzAc77FCgqTKvbSQG8Q":{"text":"Typical bar on Bourbon. It doesn't get any more cliche than this place. They have TV's sca","useful":0,"cool":0},"HxXQ6TS0I8W4wn9PsO6-JA":{"text":"Went in here one night and had a great time with karaoke and drinks. Decided to return a 2","useful":1,"cool":0},"IQi9juuvHNFYfntF3q0d6Q":{"text":"I don't understand why people go to Cat's Meow for karaoke when there are better spots in ","useful":0,"cool":0},"jt0fNWiOp7M1y-UmG4jIqQ":{"text":"I admit I'm not a regular at Cat's Meow. Sure, I like screaming \"Livin on a Prayer\" as muc","useful":3,"cool":1},"LjoTlpY2bJYzwZIahx4zrg":{"text":"THE most fun we had in New Orleans. \n\nCame here with a bunch of crazy girls for a bachelor","useful":2,"cool":1},"bdMpnQO9_1lwMDlyv5shbw":{"text":"WATCH-OUT!! you may get ripped off by the blond/white long haired bartender. It's too bad ","useful":0,"cool":0},"dvXMtx_DtWk7DuFphdViEQ":{"text":"Was told by locals that their version of \"the hurricane\" was indeed worth it. My hubby and","useful":0,"cool":0},"4KhFVRTQuuRC3c0hzyd_Nw":{"text":"Fun karaoke bar on Bourbon St. The wait to sing was 2+ hours but we barely noticed because","useful":1,"cool":0},"-DAMucYV29JkLPZzWcfmCw":{"text":"Worst selection of karaoke songs ever!  All it is is your traditional stuff.  I do like ho","useful":0,"cool":0},"Z4ziH-ltEGiLZD6VqWSZbQ":{"text":"Fun karokee spot! I love the upstairs inside balcony with TV screens to watch the singers ","useful":0,"cool":0},"mFSGf55mk_go0fIlJY1V1A":{"text":"3-4-1 hh whoa!\nKaraoke\nCool crowd. Fun times in the Quarter! \nThere are so many bars to ch","useful":1,"cool":1},"q91s6EPzdyfn4PCWuMClVQ":{"text":"I am not surprised - No follow-up from the management !! BEWARE!!!","useful":1,"cool":0},"ktv-dTzliJj6Bigv8WNmrg":{"text":"I lived in New Orleans for six years.  During those six years (when I declared myself a 'l","useful":0,"cool":0},"UVf4O7guiXV7Go9VtEIe6A":{"text":"We wandered down Bourbon St and discovered the Cats Meow.  It was a happening place, witho","useful":2,"cool":0},"fWyfwCbyjVJD8LzCkcst6Q":{"text":"Stopped in here on a Wednesday night, and then again with a larger group on Friday. It's a","useful":8,"cool":3},"bnVXhdXO75_c0pZn4Rwehw":{"text":"Hey Bravo to the tandem of Karaoke Host and DJ. We spent Monday night in New Orleans hitti","useful":2,"cool":0},"CQoVJKph_iNK9cNuLUnrXQ":{"text":"My favorite hangout on Bourbon St. Everyone is dancing and screaming the lyrics to every s","useful":0,"cool":0},"StaehmYgukFhkdq1Y31Orw":{"text":"It's one of those places you come in to see the band or who's on stage and you order a dri","useful":0,"cool":0},"bpsG66Tf99SHxvi3mgU8TA":{"text":"This place sucks - steals people money - watch out for your change. They don't give the co","useful":1,"cool":0},"IUiHj64PuxqyC8ibRHY_dg":{"text":"It's a way fun karaoke bar but the drinks are over priced and the obnoxious djs sing their","useful":0,"cool":0},"u75vZ1wpyWxHL3GYBqPvbQ":{"text":"so they had hula hoops on the wall. i really wanted to hula hoop. cool decent bar. drinks ","useful":0,"cool":0},"LB0VonHeCqa7PavQFMx9WA":{"text":"Love coming here when friends are visiting! You must sign up for kareoke and throw Beads o","useful":0,"cool":0},"ge1nz287psxctgAVbs2LXQ":{"text":"I LOVE karaoke. The \"hosts\" get to sing more than the guests. It's a fun place but be prep","useful":1,"cool":0},"siRefsz8Z3OdM0r3c5tBgA":{"text":"This is the absolute worst bar I have ever been to in my life. Do not go here ever. All th","useful":1,"cool":0},"wBhj5BNmcv00zhy6C5tnnw":{"text":"My first time in New Orleans. The first bar I pick walking down Bourbon street is Cat's Me","useful":0,"cool":0},"vsJiL11R7WEPI3PW6Bj1pQ":{"text":"nothing like watching drunken fat chicks singing.  its the best LOL","useful":0,"cool":1},"KFKB970Re-V-ellaTUcEvw":{"text":"Drinks and karaoke. Pretty simple place. You may become a star, or not and just have fun. ","useful":0,"cool":0},"nq4QYaOrbv9lAkY6yM-sJA":{"text":"This place sucks as a karaoke bar. Waited one hour to sing......drank 5 beers. This DJ san","useful":1,"cool":0},"rJsX_LQUu-HLeZJx1vF_vw":{"text":"After a few recommendations from friends, I knew this was one of the places I had to visit","useful":1,"cool":0},"V6U4alBSdGZqKbVNgl5HnQ":{"text":"Everything you do here is broadcast live on EarthCam for anyone to see. Don't believe me?\n","useful":1,"cool":0},"pJCyxQZ2pUNx8m6cc_3lZw":{"text":"Would I ever willingly seek out a karaoke bar? Unlikely. As much as I enjoy off-key singin","useful":2,"cool":1},"6HwhBGicVnRLmSxoiQpkQw":{"text":"So if you're faced with the prospect of going to a karoake bar on Bourbon Street (kind of ","useful":0,"cool":0},"fBkx-rD7juOPAENavI7Owg":{"text":"Had an amazing time! The atmosphere , staff, and overall experience was fantastic. There w","useful":0,"cool":0},"ZN-ZA8kShDS1NggXHFAZig":{"text":"Absolutely a great place to stop while on Bourbon street.  Also, famous enough that people","useful":0,"cool":0},"I63EdPmjhuBCkrBjaLxvFw":{"text":"When I leave work on friday looking to go out, my first thought is never, \"hey, I should g","useful":2,"cool":2},"KM3LIS7U4Vd8sqTr8fpzeQ":{"text":"This place was a blast. I sang on Bourbon St! The staff was fun and energetic, well most o","useful":1,"cool":0},"wVb1dwC72VGGDiUECkpf2Q":{"text":"What a blast! We stopped on while on vacation and it was quite the lively bunch. The guy w","useful":0,"cool":0},"cmzOSsR-7LCcIlVefNAmcQ":{"text":"I been frequenting Cat's Meow for 20 years and it's always fun. Maybe not always full of t","useful":2,"cool":1},"7N0Nl0N2QqRHqz6HD3oKOw":{"text":"Just plain gross. I don't care how cheap the drinks are, when a place is that dirty you do","useful":0,"cool":0},"AyBdV8fg9p7YpKbXn1G1OA":{"text":"Watch out for the scam! They try to lure you in from the street with their 3 for 1 drinks ","useful":2,"cool":0},"g2uLzEFCRf2gwls64TUHag":{"text":"I'm reviewing this place as a local. I see where this is a tourist place more than a local","useful":3,"cool":0},"zvKVV9xvpZmeq_SFM42X0Q":{"text":"Band was so off key that it hurt. But bar has fun vibe.","useful":1,"cool":1},"-jsViv5T1Gwd3rNiMsXVSg":{"text":"This is for the tourists. If you want to hear a bunch of drunk people scream into a mic tr","useful":1,"cool":0},"Tf0V6isTy765Z7IZOdwdtA":{"text":"Somehow ended up here late night 2 or 3 nights on my 5 day trip.\n\nThe karaoke MC is so awe","useful":0,"cool":0},"QvIPCmRJypudv53d_2_iGw":{"text":"First of all, this is Bourbon Street....so if you are coming here it is probably to drink.","useful":1,"cool":1},"t6ZYeFEeVhar7XKqtVN0tQ":{"text":"Good drink prices and had 2 hello shots for 5 bucks. Karaoke was fun a lot of people but t","useful":0,"cool":0},"5cI9ks-2xqTX_b8mr6dlew":{"text":"So last night I was wandering down Bourbon Street when the Cats Meow caught my eye. Perhap","useful":2,"cool":1},"0kUSTdt66drZIrl-mCcwdg":{"text":"Cat's Meow can kind of be hit or miss.  It all depends on the crowd that is there and the ","useful":1,"cool":0},"tUFv0ajwhRyRe3xtGlPCgg":{"text":"Absolutely had a blast at this place! Ok I'm from New Jersey - a long way from home and ha","useful":0,"cool":0},"6rT4_4m7GNbOy51B-0N7KQ":{"text":"It looks like not many people enjoyed this place.  Maybe the only reason I did was because","useful":0,"cool":0},"XW67OZvHqjd2uvB1gB05YQ":{"text":"Awesome karaoke place. There's a cool dude in a cowboy hat that sings with you if you need","useful":0,"cool":0},"3v09W_IYfNiMGVmfPUwgrA":{"text":"If you just want to go, have a drink, hang out with friends, listen to music and watch oth","useful":0,"cool":0},"sNs-GxV2joaofhePwrqfYA":{"text":"In general, I liked this bar.  The balcony and courtyard were nice.  The drink selection w","useful":1,"cool":1},"DVB6lI0FuxjmPDWbUnw6WQ":{"text":"This was absolutely our fave place during a bachelorette trip hands down! We made it a poi","useful":0,"cool":0},"mNuZMvomj-7DVWW4j92MKA":{"text":"Went here for 3-for-1 drinks and karaoke. Ended up having a blast and not remembering all ","useful":0,"cool":1},"nK6nT17l3sslbSj3umnZ1w":{"text":"The house singer is really good. It's a lot of fun and I am really not a karakoe fan, but ","useful":0,"cool":0},"ungjlZMO_PuNICXZIKrp9Q":{"text":"Having better experiences at Cats Meow. Able to relax a little and do songs as long as the","useful":0,"cool":1},"fCwLOV3p5jgHeogc6njpZw":{"text":"It was amazing! Everyone was having a great time and people were really friendly. The host","useful":0,"cool":0},"nfqg8BDm0XTNm7Z4-xob9g":{"text":"Fun place.  Really bad, and good karaoke.  The patio outback was empty when I went, which ","useful":0,"cool":0},"QFdurMSPSZRp1HW63JMv3g":{"text":"Ok, I get it.  It's a place on Bourdon Street and the wait for karaoke is astronomical.  H","useful":1,"cool":0},"XDuwxkQbm4Nux-pQf861GQ":{"text":"I'm normally not a Karaoke person but over all this place was fun.  True the MC doing a so","useful":0,"cool":0},"ApNEBspVy_mmnFdB1QDkTQ":{"text":"Cat's Meow is the best place for karaoke in the Quarter.  They have an interactive host wh","useful":0,"cool":0},"rXXVnHkU6dtdVk4oPA-_EQ":{"text":"Great place to kill some time watching people give it their best at some good old karaoke!","useful":0,"cool":0},"j6vlasqwskdsUn81LRiNhg":{"text":"Ditto the last review - if you like Kareoke this is a great place.  However, I think its' ","useful":0,"cool":0},"MHejR179KMpzb2UcXUHolQ":{"text":"Not a bad stop in the mid-afternoon before it gets crowded. But the drinks are nothing spe","useful":0,"cool":0},"2hkUdHW54vNmsWNcZ2wLQg":{"text":"The World Famous Cats Meow is on the top of my list when it comes to Bourbon Street shenan","useful":0,"cool":1},"_L-RNgCTVrGjUqQ7sxGrSQ":{"text":"I still have a couple people here that I really love, outside of the management- the actua","useful":0,"cool":0},"UZpQFyKNEOymTcVGflgjjw":{"text":"This place is brutal with a capital \"B\".  Err...Brutal!\n\nI went here a while back with the","useful":8,"cool":6},"yPb-yuHj9u8htvHldvOOuw":{"text":"three for one happy hour hello. \nYes its a cheesy karaoke bar \nbut myself and everyone in ","useful":2,"cool":1},"JbqX6fjpxiuBjoUpYz-_0g":{"text":"You know what's ridiculous? It's southern decadence weekend and our friend guy is gay and ","useful":1,"cool":0},"7KcKN_IcUw88JbHnaPZvUg":{"text":"If you like kareoke, this is awesome. We had a blast watching people sing and really enjoy","useful":0,"cool":0},"EkaRqN2dqRfaKvQNY-wPKw":{"text":"I was in New Orleans for the first time and stumbled upon this place. AMAZING! I danced th","useful":0,"cool":0},"gg01myIwf0WDSBuHkSEJ2Q":{"text":"Nobody does karaoke better! Nobody. Nowhere . No how. The regular crew know how to host an","useful":1,"cool":0},"s8aMcpR6wDLoV6pG_LDuew":{"text":"Let me just preface with saying that I'm not a big bar person, and I'm not really that muc","useful":0,"cool":0},"DDoIQSF3Vypnh5EbNmJfrg":{"text":"This was our last stop of the night (early morning) after a night out on Bourbon. \n\nPros -","useful":1,"cool":0},"qTi7zOySPAVp86ZvKC9Dcw":{"text":"Uh, Ed, there was a dude singing California Love.  Some tall black dude was painfully belt","useful":0,"cool":1},"x42Buc2OQdO7yz6z-FxUdw":{"text":"3-for-1 happy hour?  You don't have to ask me twice!  The bartenders here are very friendl","useful":0,"cool":0},"ARx4e-nHKcXOCM_CnznFPg":{"text":"Fantastic VJ and ambience! The karaoke was fun and very eclectic in song choice. There was","useful":2,"cool":2},"-ReHMSfWX4B5ZEG1ln76fw":{"text":"We found this little gem as we ventured closer to unknown territory. I was very surprised ","useful":0,"cool":0},"DAC0wut4dWBWBgC1BDczeA":{"text":"Has a great crowd atmosphere and the KJ keeps it GOING. However, the KJ does sing after ev","useful":0,"cool":0},"qRssxfrG0kgU_5rNx2pJ9A":{"text":"Fun place the M C I think her name was abbey was fun I was there on a Monday night not rea","useful":1,"cool":1},"426uZM9MB9qDOzIKzkEGmg":{"text":"I think possibly the best karaoke joint in the French Quarter. The host was very entertain","useful":0,"cool":0},"u4rjWgX5WM-Lr2VeA4wUFQ":{"text":"It is so funny to watch people try to sing. I didn't go up there but witnessed tons of peo","useful":0,"cool":0},"QhwoAJP0Le-pGRDWipEkbg":{"text":"This place would be 1000 times better if the DJ didn't put himself up to sing every other ","useful":3,"cool":0},"-3gIubzmgzNJQD14xMrTMA":{"text":"We stopped in here during the day to witness the day-drunk debauchery and it didn't disapp","useful":0,"cool":0},"UqVTwudiyFBoeZv31wr9yA":{"text":"Great ambiance, I didn't pay for my drinks so I can't comment on that. However the karaoke","useful":0,"cool":0},"OCutSaubZ5j0DLetKXcohQ":{"text":"We loved it here. So much fun with a Karaoke. There is an upstairs and downstairs and you ","useful":0,"cool":0},"FvDSX4Uo18OCDGN62b95JA":{"text":"This place is a pretty famous karaoke joint.  I don't remember ever making a trip to NOLA ","useful":0,"cool":0},"SeAmD9DSubVObE-eqcTEPw":{"text":"Cheesy karaoke bar. This place was packed to the gills, and the music was REALLY good. The","useful":1,"cool":1},"fBRXiuxlfUhjGUaDZeAM3Q":{"text":"Very limited karaoke song selection.. if you are used to karaoke spots with monster songbo","useful":0,"cool":0},"RQuItrkts_APn-T5atyhVg":{"text":"This place could be awesome. Could be. They waste, literally 10 minutes between singers le","useful":0,"cool":0},"XzBBfb0q-ywW19bYaPeGuA":{"text":"I'm a professional singer and karaoke veteran/past karaoke host. I've been to karaoke bars","useful":0,"cool":0},"zAr34Bpts5RvdK9Byic2oA":{"text":"Had so much fun watching our friends sing on stage and do group karaoke, home of the 3 for","useful":0,"cool":0},"WSECxHWsZzYa3JtpDXJNyw":{"text":"Amazing way to spend my 21st birthday, made a total a$$ of myself cause i was to drunk to ","useful":2,"cool":0},"EaJAaSLiPHlACIjh6lG67w":{"text":"Karaoke! Gays! And Drunk Vacationers! YES PLEASE!\nIt's super hard to get a song in when it","useful":0,"cool":0},"BUwReSxijfasEdiCRdXJFw":{"text":"It was packed, hot, and loud, and I loved it. This past weekend was my first time to New O","useful":1,"cool":0},"cy3jsHS_dHZKy71fNOeKRA":{"text":"Keeping it short and sweet...  Cat's Meow looks (not necessarily sounds) like a good karao","useful":0,"cool":0},"OPAy1Wf5Nvwzn6y9vdxAiw":{"text":"My friends and I are huge karaoke people and we're excited to visit \"the bourbon st karaok","useful":0,"cool":0},"YrQby6LH9Q63qLb1vtdxdw":{"text":"We want to go to Cat's right Meow. \n\nReason:   You're desperately searching for your 3 min","useful":1,"cool":1},"sdQPulkMHGFlRCvLpzVHZg":{"text":"This place was hella fun!\n\nKaraoke was great to watch... I wouldn't dare participate. Well","useful":1,"cool":1},"7sOP1nbFHAu93MirAwtvKw":{"text":"This karaoke bar is on Bourbon Street. Its a great place to stop in and sing one of your f","useful":0,"cool":0},"_Ltr99qsL0IV2_-23t5rvA":{"text":"If you're looking for a fun, casual place where you can have a good ol' dirty time, this i","useful":2,"cool":0},"AQ39yqdF2OFy7M-dvS1A6w":{"text":"Cats Meow is my favourite and meowiest spot on Bourbon Street for alcohol and karaoke. The","useful":0,"cool":0},"_1CWUBjDSMRquZp81muYpA":{"text":"The staff at this establishment is just plain rude and disrespectful. They do not understa","useful":2,"cool":0},"KJGiLQD0j3qPIxVbh8-V5g":{"text":"This is a really fun karoke bar...I have never really been a fan of karoke but for an hour","useful":0,"cool":0},"8mKg6vUJbl5ksjGEc2Qp_Q":{"text":"Bourbon Street.  Awesome happy hour drink specials. Crazy drunk people singin'.  A balcony","useful":0,"cool":0},"YxHY97seUm8bUVAMf2O_hQ":{"text":"This is my favorite karaoke bar! The host is hilarious and fun! The drinks are average. Th","useful":0,"cool":0},"8l4suaf4YLyyU9WCVrCtjA":{"text":"Can I tell you how much fun me and my girls had last night? The mc was hype. The crowd was","useful":0,"cool":0},"KoZr4leI2DJ-0gGRdGkjhQ":{"text":"Cats is pretty damn epic. Awesome karaoke, and the party never ends. You'll see drunk bach","useful":0,"cool":0},"6wGvGQ9K2qWwzGPs-oxdeQ":{"text":"This was the most entertaining experience while on Bourbon. This place was pretty crowded ","useful":0,"cool":0},"LkIxxgO7IJozOU9NHhPkjQ":{"text":"Wandered in on a Friday night. We were able to get the 3 for 1 drinks specials $6.50 for 3","useful":0,"cool":0},"_JTwbGD4TZK-6IpDeLInNw":{"text":"I love karaoke, and Cat's Meow is the best karaoke bar in the United States.\n\nAs I am argu","useful":15,"cool":14},"ya3AQw-9t6MpwZMDxlsr0Q":{"text":"The Cats Meow is the best spot on bourbon street, that is if your out to have fun. It woul","useful":0,"cool":0},"pu1obNIpf1JEOBA532OD4w":{"text":"Very sexist double standards even on the weekend of southern decadence. I mean Jesus get w","useful":0,"cool":0},"L84ZDbUKswXrewd7kMEY-Q":{"text":"I went there twice. \nboth are good memory. The first time I have to wait for a long time t","useful":0,"cool":0},"h-A_-HQyzP5Sku4vanW10g":{"text":"I really have to say that I so enjoyed coming to the Cat's Meow! If you are looking for a ","useful":0,"cool":0},"-rD6QSyWciWWyDG-El4KIg":{"text":"This place was pretty low key. It took us a while to get a drink but we enjoyed the 3 for ","useful":0,"cool":0},"2RQyT_TgJ0HJWIh-KX7UCQ":{"text":"Cat's Meow is a \"must do\" bar on Bourbon. I can honestly say that the reason I find this p","useful":6,"cool":5},"YaiSkVWmFmpOHmWWLOvgwg":{"text":"This place man!!!! My sister and I went here one night out in New Orleans and didn't want ","useful":0,"cool":0},"uVciVUTzKaHaKjx_wV3n3w":{"text":"So me and a couple of friends went to the cats meow to have a time and the door man was ex","useful":0,"cool":0},"qEDGMXe8wmeIymKuQNPuuQ":{"text":"HORRIBLE karaoke song selection and HORRIBLE attitude.  \"If the song you want to sing is n","useful":1,"cool":0},"JqjA4klipqcxlMk2shaUGw":{"text":"Gimme some beer and a micro and put me up stage! ;-)\n\nWhat more can I say. We have been to","useful":0,"cool":0},"zwoyF_-sgn4a6BLi9P8ixA":{"text":"I kind of had fun here (I'm being generous with that statement) but it was a frustrating e","useful":0,"cool":0},"Kl_tJc2ezpDicHgjlWqIaw":{"text":"Really cool karaoke bar with lots of places to buy a drink both upstairs and downstairs. T","useful":0,"cool":0},"CER8I_Y-lgY1Kiw-SrNQbw":{"text":"The bartender was very social, the atmosphere was loads of fun. For a karaoke bar the musi","useful":0,"cool":0},"menBCS1ARDocCtYe1X_YiQ":{"text":"typical bourbon street tourist bar. fan of the no cover. don't ask why I've been here. jus","useful":0,"cool":0},"4rewYTjMygqR1dg9U0OaBQ":{"text":"This place is amazing! The hype men were welcoming to all individuals regardless of music ","useful":0,"cool":0},"VL5ZWIMyI8munXSkFjOeiA":{"text":"FYI, Miley Cyrus sang here on St Patrick's Day.  I was going to go actually but it was so ","useful":3,"cool":0},"pFFZIsune7pg0PIXPeQmng":{"text":"Place sucks. The Jell-O shots blow since they have no alcohol in them.  Very touristy vibe","useful":0,"cool":0},"nwEX-zB1gnggCkFTnvcGuQ":{"text":"The only reason I didn't give this place more stars was that I was pick-pocketed on the da","useful":0,"cool":0},"-FqclcpdhFfMNAR3rw1iKw":{"text":"Do you like people watching? Do you like karaoke? This is your place to be. It's always on","useful":0,"cool":0},"SMzTQ-mmAoDS3TYKTBZdjg":{"text":"My favorite place in New Orleans. The energy and atmosphere of this bar/karaoke is somethi","useful":0,"cool":0},"N7MA1MF1IebaoivaIgjozQ":{"text":"We planned to start our night off here before heading out to some of the other bars, but w","useful":0,"cool":0},"w931A0OzWlcSR_eSoS8vuw":{"text":"4.25 stars.  Yes, it's absolutely touristy.  Yes, the trashy shitshow that is Bourbon Stre","useful":12,"cool":8},"hZBHT6PwzApcPgXYG1q5-g":{"text":"One of my clear instruction from my NOLA friends when I went to visit for the first time w","useful":0,"cool":0},"xoxIguCmHlwRtGagz30p-Q":{"text":"Such a fun place! An on-stage karaoke bar with a total of 4 bars, two downstairs and two u","useful":0,"cool":0},"htfKxTbxObBEIwP-qpr20w":{"text":"CAUTION!!  A systematic theft ring is operating in this establishment.  The bartender alon","useful":2,"cool":0},"7qe67J_tfLI-OKCmCGpY6Q":{"text":"Had a blast here. Karaoke was fun to watch, the hosts made it really entertaining. Patio c","useful":0,"cool":0},"yMHSqpAeS6xqmUIrnhWxgg":{"text":"Chris is the best bartender in the French Quarters!\n\nHe can practically make anything you ","useful":1,"cool":2},"EvLG8JMw-IOOFqHFa28wig":{"text":"Meoowww! Karaoke is the best here!! You have a choice from Miley to Beatles and can sing y","useful":0,"cool":0},"aCbVadX5zzgfSuBV3E-_2A":{"text":"Dropped in at the Cat's Meow with some colleagues while in New Orleans for a conference. T","useful":0,"cool":0},"BuNjVPPLcscPPED_NKfEDQ":{"text":"The occasional cover charge, and the sometimes very expensive drinks ($10 for a beer?  Rea","useful":0,"cool":0},"gNFMqkTC1ikVviuP2KNZ5Q":{"text":"A staple when I visit.\n\nCats Meow is always a party.\n\nThe only downside is that they do a ","useful":2,"cool":1},"3okuzjtVBtljqysFkSaY-Q":{"text":"Best karaoke spot on Bourbon Street hands down! \n\nThis place is a pure party, with horribl","useful":0,"cool":0},"unqRZFmKPzKJbT4WfOM_YQ":{"text":"From the songs its patrons choose to sing to its rock star wannabe MCs, this place is ever","useful":1,"cool":0},"RSZf-fDbZ3-oxcU3ypBv9Q":{"text":"I had the best Birthday weekend  singing my heart away in this fantastic  karaoke bar!! Th","useful":0,"cool":0},"dWiUKc7YfNkD3kSsuxiwlg":{"text":"Karaoke and drunk people is a beautiful combination, isn't it? I wasn't even drunk and I h","useful":0,"cool":0},"Mrix-LqUz_rOWcO0Z1YVgA":{"text":"I cannot really add anything different than what most other people have said in their revi","useful":2,"cool":1},"1fMQ02GRsW9Ebfv5lkrquw":{"text":"This is the main karaoke bar of the French Quarter.  This place is ALWAYS packed with tour","useful":2,"cool":2},"L_hARtGrzicG3RpbLHZ2Fg":{"text":"Minus one star because you can't bring beer in outside drinks, while every other bar in Ne","useful":0,"cool":0},"TU2ZdIGOiJBQ6QNTNWkKpg":{"text":"It was vibrant with lots of people and if we could just get the DJs to stop singing every ","useful":0,"cool":0},"Y0Mkd4lXHKftT1_81ufT0g":{"text":"I can assure you that you will have a great time when you go there. GREAT music, great vib","useful":0,"cool":0},"t_BTcttRZCCkUUIYoYpatw":{"text":"definitely one of my favorite places on bourbon.\ncheesy, yes, but isnt the whole area fill","useful":2,"cool":1},"ZzAId4yR288WHZPD3HBv0g":{"text":"I had a blast here!  What's not to love about Karaoke?  \nThe only issue is the long line t","useful":1,"cool":0},"NbHFTOl4sEXARUvNrhueow":{"text":"Cats meow drew our attention while we were walking down Bourbon. The karaoke hosts do an a","useful":1,"cool":1},"HuZft5AffmFNkwLUy5zh2g":{"text":"If friends and visitors want to go to Bourbon Street while in town, I at least steer them ","useful":0,"cool":0},"XBF5c37vOCy_P9D4tUVB6w":{"text":"Love this bar! Staff are very friendly. Drinks are reasonably priced. It can get a little ","useful":0,"cool":0},"meh0gGXF7JS5zAkiASQ8rQ":{"text":"The Cat's Meow the bee's knees! We went to NOLA last month and sang and danced the night a","useful":0,"cool":0},"CSW80y_mWUjHscEXQ6-BFQ":{"text":"This place should solely exist for the purpose of bachelorette parties. Both times I went,","useful":1,"cool":1},"ytKdWm9P6V_2KtZFXkTpOA":{"text":"Best Karaoke bar I've been to. Tops all the asian karaokes in NYC even the one with the pr","useful":0,"cool":0},"Fr1kMBfSygQ3-3A-Dj2Dbw":{"text":"Fun to watch people singing espically the drunk ones! The \"host\" or whatever they are call","useful":0,"cool":0},"veAnPGnnmX2Od4my94mnZg":{"text":"Was there on a Friday night....not impressed. \n\nI went to hear some hopefully hilarious ka","useful":0,"cool":0},"BBJqPPSLH8sPGNBRF8HudQ":{"text":"I like it here, the location is great and not too many steps to my favorite hubcap burger ","useful":0,"cool":0},"61jTIYr-PxB__Bf2N6Q2nw":{"text":"Entertaining if you are not trying to sing. The DJ sings about 3 out of every 4 songs. Hap","useful":0,"cool":0},"MzEHl3GBxsRUNd57hZz8cg":{"text":"I had the chance to go to this bar both times I had been down in New Orleans, the last tim","useful":0,"cool":0},"dH_lwiBX7hhQ0eusPNMhpg":{"text":"Fun karaoke bar.  Plays all types of music.  Saw a man singing Madonna and I am still laug","useful":0,"cool":0},"F8kqNIB8CJevwbSchYZ9qA":{"text":"Why 5 stars? Because it was FUN and the person keeping track of who is singing what was am","useful":1,"cool":0},"XLcaKSQ1KKGGDjFShKVRMQ":{"text":"Good lord. We came in here because we heard some folks singing karaoke and they were amazi","useful":1,"cool":1},"VqbX7Qa55VIHgz2PA6MAzw":{"text":"This is a place that locals refer to as a \"blackout bar\" meaning you'll have the time of y","useful":0,"cool":0},"r6f3505bVKW1hMbh9oAt2A":{"text":"Cat's Meow was a bar I found out about word of mouth from a local.\n\n I went in and rocked ","useful":0,"cool":0},"9BhRv5I1-s3-S0hLZQjncQ":{"text":"Granted, in my every day life this place would be my worst nightmare.  But when in New Orl","useful":1,"cool":0},"mum4M1NZ70J-5Qbz_woIgQ":{"text":"Though when I went the area was quite crowded. I had a blast. I went with a bachelorette p","useful":1,"cool":0},"twqnKIq9VLGS9xcPtSy4SQ":{"text":"One of the most upbeat places on Bourbon Street.  Of course there were a ton of bacheloret","useful":0,"cool":0},"BEvY0GaQR92AiwgEN1QcFg":{"text":"We had so much fun here, we came back 3 nights in a row.\nFind Will the bartender, he was a","useful":2,"cool":1},"ypkyHJWcS8MI0hEvtm67YA":{"text":"This place was lots of fun! The host really gets the place going. Went there on a Sunday a","useful":0,"cool":0},"1Z5e1t3MK1bRV6_JxHqz8g":{"text":"Literally chugged our drinks to get inside because it looked so fun. Definitely didn't dis","useful":0,"cool":0},"rNMvEEPihcWUMqLsBwLrRQ":{"text":"Interesting  karaoke  on  my  I pad  mini  I  watching  live  from  redwood city Californi","useful":0,"cool":0},"GZfi9T709T1uElZabd-2kA":{"text":"This place provides lots of fun and laughs. The karaoke is the best IBT l I've ever experi","useful":0,"cool":0},"Rp6ghnYyD91MS_o_ZjvyEw":{"text":"Fun, divey karaoke bar. \n\nThe host does get up there between each song to sing. This is go","useful":0,"cool":0},"DhNaGpop8kZJJ7mjllfpiQ":{"text":"Good drinks great upstairs and great balcony views of bourbon st. All in all worth the sto","useful":0,"cool":0},"a9dNRK9qulD59jwIHbzllA":{"text":"Ok, so the place is a little divey (think dirty old men and drunk college guys tossing bea","useful":0,"cool":0},"-fdsEhbNCYT1GlTpYJvItQ":{"text":"Stopping in at the cats meow after my drunken crawl through Bourbon street is always fun. ","useful":1,"cool":1},"ZTfEJbRoV-RGYdAyJ6GS1g":{"text":"Just bad. Employees are rude as hell. Really outdated song list, DJs are lame af and kill ","useful":1,"cool":0},"tiOKwr8_fizx4frJfDRcMA":{"text":"This bar is KICK ASS! Of course when your out on Bourbon Street you drink so going to this","useful":0,"cool":1},"VtFTBcxtO8jiOlw8l4Stzw":{"text":"If the people you're with have never been to Bourbon Street, or are just insistent on spen","useful":17,"cool":11},"2FnSgC_OBLhJ677YuYNR8g":{"text":"The Cat's Meow is a cheesy, touristy karaoke bar.   The rowdy crowd takes drunken turns en","useful":0,"cool":0},"1dTOcltShVyK5H4yA1Ccxg":{"text":"This place, sure, it's a tourist trap, but everyone was telling us to check it out and kar","useful":1,"cool":1},"yQXyM1nMSHO9ca0XGuj5VQ":{"text":"Best Karaoke bar I've ever visited!  Great tunes and the host was awesome at getting the w","useful":0,"cool":0},"nZfGw6HKi7RDm5_o8-pQxw":{"text":"This place is awesome.  It's a karaoke bar done right.  While spending 10 nights in New Or","useful":1,"cool":0},"lzyztUz94J5qc2p0dtQISg":{"text":"If you wanted to torture me by bringing me to places I can't stand, all you need to do is ","useful":6,"cool":6},"fB9Uxps8sW2o24rwNFY6UQ":{"text":"I don't do karaoke, but I do like to watch.  When we got there it was 3 for 1 beers or tri","useful":1,"cool":0},"shw-N9uYILtTasBqjcakWQ":{"text":"Great place to visit and have some fun. Lots of good singers and some just to amuse. At ni","useful":0,"cool":0},"IZ0-Dmm2mb4-J4GjV87npQ":{"text":"this place was ridiculous busy and fun on a sunday night (monday morning 1am or so)!   i w","useful":0,"cool":0},"2A8B-_-PMSFI6rJrJ3q8TA":{"text":"This place looked fun from the outside.  Watching drunk people karaoke sounded like a good","useful":0,"cool":0},"o8m0sCxa2t5zV1jK3w00PQ":{"text":"Laid back atmosphere with mostly tourists I in a party mood performing their favorite song","useful":0,"cool":0},"tUF6vj1NJp0fHqgCJCSgwQ":{"text":"Ok so we were out with a Large Team from work & someone said that another Co-Worker was on","useful":1,"cool":1},"YqFq0oGlYX-7GDzV6i07sA":{"text":"while visiting this establishment, my friend checked us in and said \"plotting my suicide\" ","useful":1,"cool":1},"ajic1Z4CG3uDGsWMbYB5rg":{"text":"Paula and Adam were great. I spent a week on Bourbon and the bartender here was my favorit","useful":0,"cool":0},"cg-MYMqu5lzru6KhEv4xZw":{"text":"Ohhh yes. I'm giving this place 4 stars because they endured Big Kitty on an almost nightl","useful":1,"cool":1},"cHEtG2TO_-K9jncME8YWaw":{"text":"Definitely a fun place to sing along to your favorite song and enjoy a hurricane. I liked ","useful":0,"cool":1},"S_xT4W6LdOqHXnIvr3CmCw":{"text":"I really liked this place because the MC was so cute!! I wanted to put him in my pocket an","useful":0,"cool":0},"zceIuERPgjSEfbnjnwbqcw":{"text":"Cat's Meow did not let my friend in while he was wearing a romper pantsuit. They said he w","useful":1,"cool":1},"iIsviHL9SLCu4WMwl5hdvQ":{"text":"This \"MC\" thinks she owns the stage and performs between every customer so what might be a","useful":1,"cool":0},"yc9utYQP1XcodeJk7mijpg":{"text":"Let me just say we had a blast every night we went to the cats meow it was so much fun but","useful":0,"cool":0},"CuZklUGc5hm-m4PVLFrgHQ":{"text":"Meoowww....thats really what you want to say as soon as you see this place. Its a standard","useful":2,"cool":0},"xHltRgjj8Xp9ZlnP1Xx_RA":{"text":"We ended up in here randomly Halloween weekend when visiting New Orleans (to escape all th","useful":0,"cool":0},"412pE0e6ZcHppopy5flbOQ":{"text":"Hands down, THE most fun place in NOLA!! Just came to town for our anniversary and my husb","useful":0,"cool":0},"1b2SWFagcRXVULmDkCrgzw":{"text":"I've been to karaoke spots around the world.  This was one of the worst karaoke experience","useful":1,"cool":0},"KXWYB-teNnsLK1kvvgLrYw":{"text":"We were there last night and had a blast. Good drinks. Clean restrooms. Person hosting kar","useful":0,"cool":0},"0wx5pf7sPe-1r_GwRbdl6w":{"text":"Love this place! Had a great time watching all the brave karaoke singers. The 3 for 1 happ","useful":0,"cool":0},"Fs_thOQeEYdkoSpxtuX9ow":{"text":"We went here after some friend's recommended it for our trip to New Orleans.  Now don't ge","useful":1,"cool":0},"yyxOzwEftOtDP79OeudKbw":{"text":"I thought it was a great time and that even on a Tuesday night was pretty fun.  The people","useful":0,"cool":0},"fBA8Vmf8VMeVXH2QXXl7XQ":{"text":"This was the last place on our 3:30pm drinking frenzy. The staff was very friendly, music ","useful":0,"cool":0},"Besqf38pn85BWul8s0B6Jw":{"text":"I would not recommend the Cat's Meow for a group function.  I recently attended a private ","useful":0,"cool":0},"6xnBc_YCZ7iYREMf-6eSqw":{"text":"Came here with a group of friends after the House of Blues. Lots of high rise tables, balc","useful":0,"cool":0},"kx2GUs9TBVubtbnD_wOLeA":{"text":"3 for 1 happy hour!!! We were there around 8 on a Thursday night and it was practically em","useful":0,"cool":0},"55KkM0M1-dAdLjEofjW4xw":{"text":"This is one of the first places we came when we arrived in NOLA for a bachelorette party. ","useful":1,"cool":0},"UvOHfRy8Oco7GWdbM4K_eA":{"text":"Good times!!!!!! I remember going here 20+ years ago and it didn't disappoint when I decid","useful":0,"cool":0},"gxkxK5DbIA3c04RvYJXy6g":{"text":"My trips to New Orleans are frequent (I consider myself quasi-local at this point) and bet","useful":3,"cool":2},"rstlPEUwFfWXq2WKHkfvPw":{"text":"Went with group of 11 and everyone agreed to stop at Cat Meow before leaving NOLA. The min","useful":1,"cool":0},"rZvRtAecyOhuWEUP3c-3IA":{"text":"No question the best place to be on Bourbon St. \nWorld class interactive Karaoke fun safe ","useful":0,"cool":0},"VGVOMQqJr6vc45UkFFTgOg":{"text":"We were going there to get on the balcony for the Mardi Gras ceremonial street closing. Go","useful":6,"cool":2},"FchZ5lMLoW5xUHa2YtPceg":{"text":"I love this bar so much and I can't wait until we're reunited again!\n\nWhile on our trip to","useful":4,"cool":2},"RCdwRW6qZRwpkDRUhmHnJg":{"text":"Definitely worth a visit!\n\nThis frat filled dive bar actually has a great karaoke entertai","useful":0,"cool":0},"90OJ12LJGztOhWRmr89vYA":{"text":"Went to the Cat's Meow on St. Patricks day weekend this year, and had an AMAZING time. Lov","useful":1,"cool":0},"JKWpOMlOLZz3yXPK0nfQGA":{"text":"hmm, most places can be fun if you're not sober.  this could be one of many.  interesting ","useful":0,"cool":0},"XYYvuXx-0wY6DOI8e1VvgQ":{"text":"This is the best place to people watch. Great drink specials. Their theme is \"This is Your","useful":0,"cool":0},"8YKyGJitq2UbA8HEmhIuOw":{"text":"This is a great spot to get on the balcony and see racks.\n\nIf you have Mardi Gras beads le","useful":0,"cool":0},"YM10bhMtAf88ZvU3nw7vFg":{"text":"What can I say, Cat's has it all!\n\nThey have an amazing staff, from the bar backs, bartend","useful":0,"cool":0},"Q8khiDUcf6lzWBWBulc25A":{"text":"The place rocks. Especially if you understand the format. I see everyone complaining about","useful":3,"cool":1},"PjSeinizB-bdENsjLW0Rfw":{"text":"This is a super fun place. We had a blast singing at the top of our lungs with the crowd, ","useful":0,"cool":0},"6Is0JeTNc_wU_lb0PFeVZA":{"text":"God this place sucks! It's 24/7 karaoke which is awesome, but the MC's are always the most","useful":1,"cool":1},"JYB2U-UWmAeQ3E5uN7dpPg":{"text":"There's just something about being drunk and having the urge to sing on a stage. One of my","useful":0,"cool":1},"d4AhYk1BU5ovRl01es9PTg":{"text":"This place has the potential of being a 5 star place, but the weakest part of the set-up w","useful":1,"cool":1},"ooxEgOEyBwVzDjptLBkgbA":{"text":"Recently here at least once a night during my stay in New Orleans for my friend's bachelor","useful":0,"cool":0},"qCaz_QERxtu_OMI_5Zr41Q":{"text":"This place is funny and also quirky...I enjoy watching everyone on the web came online dan","useful":0,"cool":0},"2Da2DMcFSB3O12EYN2lyhw":{"text":"The karaoke is bullshit. My friends and I came here with no intentions to get a chance to ","useful":0,"cool":0},"Z8r_JOYGu9wSVFmERbb9RA":{"text":"Super fun & friendly atmosphere. The staff were all wonderful and engaging. We didn't stay","useful":0,"cool":0},"8IarBu8ZlPAvjxFYt7byFw":{"text":"We had so much fun here! The cats meow is a karaoke bar where you feel like an actual pop ","useful":0,"cool":0},"E81vmeOKja8beu-sae03tQ":{"text":"Definitely a good choice for karaoke in this bustling city. Try the bachelor karaoke packa","useful":0,"cool":0},"naJN0zrIOmESz7ZnBKyuTQ":{"text":"Stopped in late on a Thursday night. Drinks were a bit pricier then others in the area but","useful":1,"cool":0},"rcukFdMMGziWBHrFBXCIFw":{"text":"New Orleans on Mardi Gras is the place to be! The strip is so lively and I'm so happy that","useful":1,"cool":1},"X9xAveftYdewsaq9YNhi_w":{"text":"Awesome karaoke. I went here for my bachelorette party and sang with a groom on his bachel","useful":0,"cool":0},"qq748RycBnqoYjr7OZvPKg":{"text":"Was just at the Cats Meow fri 7/24 &   Since my son loves to sing,,,went back again on Sat","useful":0,"cool":0},"tTyyZzeBJpWlyGO8hE0OgA":{"text":"I have never enjoyed a karaoke night when the host is the only one who sings. I do not cal","useful":3,"cool":0},"NiDN9lmm8jb5PpX3s7HCiA":{"text":"Try a different place, avoid this. Although all eight of our party had put our names on th","useful":2,"cool":0},"3xomag07CPBkky3oLlQxCg":{"text":"On the one hand - if you can get on stage to sing a crowd pleaser, you feel like a rock st","useful":2,"cool":0},"zEfvWoqBiwJSQ_LReT8Fyw":{"text":"Probably a 3.5 here, I think this is mainly a Karaoke bar, had decent amount of space with","useful":0,"cool":0},"EFExySufLoHvZFf9DjAVFg":{"text":"In a drunken stupor, my 9 friends and I stumbled into this bar because karaoke. We initial","useful":1,"cool":0},"r4wthfa4KGpco1etEsBSAg":{"text":"By far one of the best Karaoke bars I've ever been too!! The staff is very friendly very a","useful":0,"cool":1},"qKwHiWghbu68BWjkf3CfQQ":{"text":"I do think that it is a bit overrated, but what is cool is that they have a live feed wher","useful":0,"cool":0},"uYM73quwwZFaYCyzk1Y4rw":{"text":"Many locals are ashamed to say that they have been to this extablishment. I, howver, have ","useful":2,"cool":2},"CmNcws-srnZQgJNMgfbwbw":{"text":"Honestly, this place is super fun.  Great vibe.  Asked me for $100 to sing after waiting 4","useful":1,"cool":0},"nCSofy5Xld089vl7O8ecHg":{"text":"It was fun, but the karaoke DJ sang WAY too much, not letting customers sing nearly enough","useful":7,"cool":0},"f4jCT100q6I4oO4KUVMUkw":{"text":"Ok this place is a blast. \n\nThe \"Three for One\" Happy Hour might be one of the best deals ","useful":0,"cool":1},"fWLfs6hXBX63Qmc7RSCNOg":{"text":"We were at this karaoke bar for about an hour on a Saturday night and the only people that","useful":1,"cool":0},"iob0mBM76_dumJbwDqGxgA":{"text":"Soooooo much fun. Now I'm here with co-workers on a Sunday, mid-day and I'm having a blast","useful":0,"cool":0},"usx3Brx66wuJ7SDECGGXGQ":{"text":"Very weak set list for karaoke (No Rebel Yell?! Seriously?!) and the long stretches betwee","useful":0,"cool":1},"fqi8Ei4HOezV8HpmnykkEA":{"text":"The Cat's Meow is always the first stop for my wife and I on our annual trip to New Orlean","useful":1,"cool":0},"MXJpyFFlws0TDD8ZvKhkvA":{"text":"I was physically assaulted by the owner tonight! I was simply taking a video of me and my ","useful":3,"cool":0},"Hb7iNFZSPb8N5zbqkhDDyA":{"text":"So much fun anytime of day.  Staff are friendly.  3 for 1 happy hour.  Good times, enterta","useful":0,"cool":0},"s4Rm6leJU1ycZG5cEt_vvg":{"text":"Wild and crazy karaoke!! This place is hilarious. I had a fun time here. It gets pretty bu","useful":5,"cool":6},"oJcLuQ6iCJYYf-SDXz5jmA":{"text":"The bar tender, Jenny, said that she wouldn't give my drunk friend tap water unless we bou","useful":2,"cool":0},"YcY4VpiBkKkfBYmoQokkKw":{"text":"Guy with a mustache at the door had a little man complex. Didn't let my wife in because we","useful":1,"cool":0},"V8JU8jNY1mM-EnZ9xersZA":{"text":"I came here on Sunday night right after dinner on Royal St. We were just in town visiting ","useful":3,"cool":0},"blfViDiO-O7e3GXOUx22Rg":{"text":"It wasn't a very busy night, there might of been 10 songs in the queue. It should have bee","useful":0,"cool":0},"m9SGVQwqHoASvNpisv8EOw":{"text":"Traditional bad karaoke bar! Super fun tho. It can get crowded. Fun time but not missing a","useful":0,"cool":0},"F_XEEITmVbZMz1B-Ht6sqg":{"text":"I wasn't much for the Bourbon Street scene... until the Cat's Meow made me purr!\n\nAfter th","useful":2,"cool":1},"MWYDImsNwnktGfns5xBkBQ":{"text":"Karaoke great bar great washrooms are bloody disgusting gross.  I mean puke in your mouth ","useful":0,"cool":0},"Z6BHMKJGPd4IZoCB27Uvfg":{"text":"Very strong, relatively cheap hurricanes. Fun atmosphere. Don't bother with the karaoke un","useful":0,"cool":0},"EG7Bbusv4oeQrQzaPZ_luA":{"text":"Omg,best karaoke place ever,so much fun,drinks are not expensive at all,big list of songs ","useful":0,"cool":0},"IurWUXTFpXFh94jYM3VmzQ":{"text":"Do NOT and I repeat do NOT try a fake ID at this place. They will sent you in a heart beat","useful":0,"cool":0},"p8h5YKxn4oE0NxIY6B87kQ":{"text":"The way the young man that treated our group on my friend's 50th birthday song request was","useful":1,"cool":0},"hsmT3EbiqyrK5gwWx_SqZA":{"text":"Cat's Meow has the ability to be great and famous. But when it comes to Karaoke you get st","useful":2,"cool":0},"Z3J2IDCjCaOKdB3hpOnLfA":{"text":"after strolling up and down bourbon st on a weeknight trying to find a place to chill and ","useful":0,"cool":0},"MSLiQqZ1W6BmUgC2URXZ7g":{"text":"LOVE THIS PLACE. If you get here any earlier than 11pm, the place is dead and you can sing","useful":3,"cool":3},"50jCnO8vnoLfPj3s13R8QQ":{"text":"A bartender at a different bar suggested we avoid this place if we actually want to sing k","useful":3,"cool":0},"BE7AUuhMITIsW7Ik7AiAkg":{"text":"Fun!! Good selection of music (despite is glaring lack of Joan Jett), strong cheap drinks ","useful":2,"cool":1},"GJWDlLxltIowjkHFMO5Peg":{"text":"been in new Orleans for a week with my Australian license being fine getting into all bars","useful":0,"cool":1},"cOIjEO_Y1Mk7X_vbtStIfA":{"text":"The cool thing about this place is they let you up to the balcony during Mardi Gras.  A fu","useful":0,"cool":0},"wd-8EEf-hFTjYr7Z6XOVbQ":{"text":"Highly recommend!! Great atmosphere, decent priced drinks and karaoke! It's alright if you","useful":0,"cool":0},"GgUQZJQRny8VPBtIkeCSxg":{"text":"Nice place but unfortunately their song selections Is 4 pages. Very disappointing.  Never ","useful":0,"cool":0},"cstldTdq6FvaaPhniwQJtQ":{"text":"A super fun karaoke bar!!! Cheap beers, friendly bar staff and security. We found a girl t","useful":0,"cool":0},"ndxomzzQF5pXScH8dcNeqQ":{"text":"Went here day drinking for my friends birthday and loved the 3 for 1 drink special. Can't ","useful":0,"cool":0},"XCamhQwyL5K5xrS2vkPPgA":{"text":"My favorite karaoke bar in the entire world! It gets crowded fast especially during festiv","useful":1,"cool":1},"2t3yvDY6XWTEhQ7BhDXDkw":{"text":"The place is pretty cool and has a small room I the back.  At the bar in the back, there a","useful":3,"cool":0},"j28IRvHIVuAMSblXIsiL5Q":{"text":"We spent a lot of time here, and loved every minute of it!\n\nJust imagine...you get tourist","useful":1,"cool":0},"l7N_KWqJ7Nm8IKoQ2KUCsQ":{"text":"I absolutely love to see people sing...wait, scratch that. I absolutely love seeing DRUNK ","useful":0,"cool":0},"MTzeiKzTuDmMAS3bnABi1g":{"text":"In my opinion this was the worst karaoke bar I've ever encountered, but most other people ","useful":2,"cool":0},"eTAXBoi8JpDMazhCwr0FHw":{"text":"So this place is really fun, even if you never go up and sing. The MC host gets the crowd ","useful":1,"cool":0},"k9VfcLrC4DtHqRrouzgkDQ":{"text":"I have to give it this low rating. I am not sure what has happed but the front crew on sta","useful":1,"cool":0},"ZGlH7_tQ3Ox7ApsEQkeaSw":{"text":"Fun karaoke bar with a nice courtyard bar area too. Inside, the karaoke operation includes","useful":0,"cool":0},"vmeqXug2vkpgU2DbSRbrhA":{"text":"The night i went straight men started a fight. Bar staff quickly squahed the mele. Kareoke","useful":1,"cool":0},"f1iAm251Wtucs76iqpC6fg":{"text":"Stopped by because we saw the karaoke sign.  Song list is terribly limited, but for what i","useful":0,"cool":0},"keMfW9SWMuTRO0_p5x3GoA":{"text":"Great time unless you want to spend half the night listening to a chubby Willie Geist look","useful":0,"cool":0},"c1oAwTRrAovkVyWYwsZbDg":{"text":"We stumbled in here on a weeknight and the place was totally off the hook. I can say that ","useful":1,"cool":1},"pNOGkWBMYg0zI8eVat5cEA":{"text":"I love karaoke but I normally prefer the Asian style karaoke lounges where you can get you","useful":0,"cool":0},"TngKr2UPCmxHUGKwJpd_FQ":{"text":"why does the mc sing every other song himself, thereby increasing the wait x2. the mc also","useful":2,"cool":0},"zueExeOx_gd8HyHzPy8_Rg":{"text":"Not for me. This place is definitely for the young and drunk. You need to be super friendl","useful":1,"cool":0},"Qbfu-DWHkuS0EZd9E81Hjg":{"text":"For entertainment I would give this place 5 stars ! It's a fun karaoke bar and the crowds ","useful":0,"cool":1},"TTiMPB-0TPX_ixhJkT15yw":{"text":"So would be nice but the xenophobes only allow americans, only ones who have this policy, ","useful":1,"cool":0},"nrNd9HzS80IVm36MNRgMSQ":{"text":"We went there for my Bachelorette party (one of our many spots). Spent plenty of money whi","useful":3,"cool":0},"jY8-B9c5bEBaACoQkXkMmA":{"text":"They would not let my sister sing even though she was the bride at a bachelorette party. N","useful":2,"cool":0},"DujBBcxWEKecEXToiAaBKQ":{"text":"This place is a hoot!  Come anytime..during the day, or lateee night.  I'm not sure what t","useful":1,"cool":0},"zeihZjFebCE1sdGxG9IU2Q":{"text":"Fun karaoke bar with $3 jello shots!\n\nIt's super fun, roomy enough with both indoor and ou","useful":10,"cool":2},"QtJyKWVdmP8xc_jeakbQoQ":{"text":"Blech.  Bourbon Street....it wasn't my choice to come here and I dreaded it but I have to ","useful":1,"cool":2},"yrFNIejIKGCmmUODe4FnKA":{"text":"Super fun night! I'm not really into karaoke, unless it's in my car...but at one point I t","useful":9,"cool":9},"n3PV-QUstTZz-O44DIgbdQ":{"text":"Yet another bar that somehow manages to ensure that I get drunk there at least once during","useful":3,"cool":1},"FDQcokYuHvuIUQZ6FsAtcQ":{"text":"Came here on Thursday night and all I can say is this place is the bees knees! Everyone wa","useful":1,"cool":0},"tP_MGXyLMpsYOCDrmSdexA":{"text":"Let me just say...there are a LOT of loud, crazy, karaoke places on Bourbon.\n\nCame here on","useful":0,"cool":1},"JJivqHw7fb1zhFtYGzZxQQ":{"text":"MC Ebony, Signup Bakar, and DJ Abby are amazing. We got there early, just three moms from ","useful":0,"cool":0},"FvquZe1lXZmgaQehTqhvcw":{"text":"We had so much fun here - it's such a lively karaoke bar. I think we stayed for about 2-3 ","useful":1,"cool":1},"MSbTOGVS3tEQcL-2o6AQTw":{"text":"we wanted to karaoke and drink last night so I read these reviews and we headed out...arri","useful":0,"cool":0},"LXWGqB5tZv_9noe39fz6vQ":{"text":"I loved their Pineapple Malibu drink but not the Hurricane. I love their karaoke! Very ent","useful":0,"cool":1},"EgDJQXveujaIuB_L6NSZZQ":{"text":"I don't know why it added a A between the artists name but chalk 1 up too iPhone autocorre","useful":1,"cool":0},"Khb-3d8CPRFCokwpK7kjRA":{"text":"First Night in New Orleans and we had a blast here. The girls wanted to do karaoke after h","useful":1,"cool":0},"X7Xm5rXPtnRG77PbVCmO7Q":{"text":"Wow! What a wonderful place full of the hits and amazing entertainment! The energetic voca","useful":1,"cool":0},"vVh7eytlrKcitNLLBV0eag":{"text":"Great place for karaoke on Bourbon Street!  Fun atmosphere, great drink deals.  The staff ","useful":2,"cool":0},"ul2nDIAMRiEE-7_pyjS4Vg":{"text":"I have been to ALOT of bars and this bathroom was the absolute most disgusting of all the ","useful":0,"cool":0},"SHUdOBhg2-ix797JgC50PQ":{"text":"How could you hire a security guard that assaults a comedian. He went to the emergency roo","useful":3,"cool":1},"cxeJoijWdsaG1-2kNcucYg":{"text":"You can't actually sing a song you requested, because the MC (or whatever he is) sings eve","useful":1,"cool":0},"LMcYOIjEBPCf2Rup9O51WA":{"text":"We walked by this bar while walking on Bourbon street but decided to come back to it becau","useful":1,"cool":0},"kzyI1o-26PJR8WMMNjBNLA":{"text":"This place is so fun!! I'm not even into karaoke, but I found myself singing and dancing a","useful":1,"cool":0},"t9ToBAVze3w-B9pQOPkAoA":{"text":"Song selection was terrible. Once you do select a song, you have to wait until the \"host\" ","useful":0,"cool":0},"HIDW8dRJu-wNJvNcLAmFxQ":{"text":"Hit or miss on certain nights but with a few drinks in your system, it'll be a great time!","useful":3,"cool":2},"g0d-cuZY2CXeBEY9Ve7oDA":{"text":"I just realized I forgot to check in here and I am so disappointed! I was in Cat's Meow ab","useful":1,"cool":1},"-loeX-EtP0o2eSEF8uM4jA":{"text":"This place is horrible and the bouncers are absolute shit. Think they own the world and we","useful":2,"cool":0},"W_VqfU0A_TTXKry0RMHa9w":{"text":"I've walked Bourbon St. many a time.  Some clubs come and go, but there are some which you","useful":2,"cool":3},"SMzZuiF0JvLSl81n5BzvpQ":{"text":"Meeeeooooowwwww is right!\n\nThis is my absolute favorite bar on Bourbon street and after tw","useful":2,"cool":0},"R9bLzzANdEjMHRgEzXTnyA":{"text":"Great bar for witnessing the messiness of Nola and bourbon street. If you're looking for k","useful":0,"cool":0},"U4Ttzp2EQe7UDURegfa_kA":{"text":"We recently tried to get into cats meow during Mardi Gras and we get turned away bc a memb","useful":1,"cool":0},"vELbAIzlAuR3O9_ZpVN9SQ":{"text":"I can't comment on this place for a regular night out, but my friends and I stopped in on ","useful":2,"cool":2},"rABfQMqCA8A9n7MY4jOGdw":{"text":"Very fun! Great energy! All staff were exceptionally friendly and professional.  The Secur","useful":0,"cool":0},"SV8gDcMUgMRFwwxa-Udnyg":{"text":"One of the most fun places in Bourbon st. Drinks were cheap (during happy hour) and the en","useful":0,"cool":0},"Eu4VwAIfcfrfQJdijiUVvg":{"text":"Had a LOT of fun at the Cat's Meow when we walked into Karaoke Night! Great place for bach","useful":0,"cool":0},"EH9MUYASQLUJ_ytWkQBbng":{"text":"This place is a great karaoke bar. Definitely the best spot for people watching. They have","useful":0,"cool":1},"_EssJSQc0UjYfA-rb4YDSg":{"text":"With so much to do in N'Awlins, I still always manage to make several visits to this aweso","useful":0,"cool":0},"bviThWvvF7k4rqJDE2Fgnw":{"text":"I literally popped a balloon and got dragged out my the bouncer and him saying they're exp","useful":1,"cool":0},"RLrAtOGFIEpIaR6pMbt3qw":{"text":"This place is SUPER fun!! I was here for my bachelorette party. Sang a couple of songs on ","useful":3,"cool":3},"xUPAojfyUrwK8c8NVQTMsQ":{"text":"Allow me to go on record:  I am not a fan of Bourbon Street.   Once a source of great jazz","useful":4,"cool":2},"KbrKUJJmnKToZ4S6HlEpNQ":{"text":"I start off every trip to New Orleans at this place. \n\n3 for one everything. It's a place ","useful":2,"cool":2},"Z8H7F4w6KYp7kRNeCocp4g":{"text":"Fake karaoke!  All the people singing clearly work there.  They have a cheesy \"MC\" who eve","useful":0,"cool":0},"fHy5X93ndAIezmGxqR81Hg":{"text":"Waited for 2+ hours on a slow night (Christmas) to sing one song and didn't get to sing. W","useful":1,"cool":0},"FFCtPD2gIHnBOx3Ni0_0Ag":{"text":"Had so much fun here celebrating my 30th birthday. Don't let the live cam fool you, this p","useful":0,"cool":0},"Jyk0vNVdxoMlE4P6ZOG1sQ":{"text":"We made a stop at the Cat's Meow for some karaoke at around 2:30 PM.  It was fairly empty ","useful":1,"cool":0},"rt-0HJcSwRIl6nW1c0rS2g":{"text":"Five stars!\nTruly incredible ambiance.\nGreat spot to take a girl on a date.\nThe lobster is","useful":0,"cool":0},"LakmHUqC4wCnVVm7RIJekg":{"text":"Worse bar ever they let me and all my girlfriends in w/ no problem and they demanded a pas","useful":0,"cool":0},"ULcc8wYodT5dLO2e3uQDIQ":{"text":"What a complete and total let down. I get it. It's on Bourbon. People who go to karaoke ba","useful":1,"cool":0},"qkq3116yfD3iFCQB0xIvFw":{"text":"This place has a banner claiming itself as the best karaoke. This place can definitely be ","useful":1,"cool":0},"1579Cy8Ax16oiNx5q04GdQ":{"text":"Loved this kareoke spot!! I enjoyed watching and listening to all the people getting on st","useful":0,"cool":1},"u4Mc_x1RagAFtogJosy60A":{"text":"Meow! What a divey place where you get to see some drunk people sing to their hearts conte","useful":1,"cool":0},"VkDsoEJPlQDF5RZjF3-phg":{"text":"This place was cool until a GIANT cockroach fell from the ceiling and landed on my head...","useful":3,"cool":0},"iV_iy_dWDbKvmIJpgBdiGw":{"text":"KARAOKE OVERLOAD\n\nThis is a nice break from all the bars and live bands. By the time peopl","useful":5,"cool":4},"_cXJBTcTsP18m2XyN7tAVA":{"text":"Staple when bar hoping in NOLA, super fun times people watching and the staff do a great j","useful":0,"cool":0},"0DtwAvnbjGuLbSxlMbJxcA":{"text":"Would not recommend.  I waited for multiple hours and checked in multiple times and though","useful":0,"cool":0},"rnU4ITvvdFeGS_q2ITUi5A":{"text":"This was an interesting place, kind of a mix of a stage show and karaoke, and they keep th","useful":2,"cool":0},"PBoAFIbZceB2LgL8tsP3qw":{"text":"YOU DEFINITELY NEED TO GET ON STAGE AT LEAST ONCE IN NOLA. \n\nPretty much a 24/7 Karoake jo","useful":3,"cool":3},"Md-sNE_yoWmeEctegwE2QQ":{"text":"Ya gotta do it. Tourist. Local. Friday night. Possibly a Tuesday. \nSing, be a back up danc","useful":5,"cool":5},"4lq3JTIYvMwa4y9M1lD6xg":{"text":"This place was great, (and that's saying a lot for someone who doesn't like karaoke bars.)","useful":0,"cool":0},"jobBozVkAgZT4hTtqWIiyg":{"text":"I went to the Cat's Meow on October 23rd. I'm a karaoke lover, so I made sure that I went ","useful":0,"cool":0},"fveQnbsx_AYGJqqANn0jmA":{"text":"We were walking down Bourbon Street and wondered into this Karaoke place.  We ended up sta","useful":0,"cool":1},"XccMKNDwVkiLyjyiPt2Nyg":{"text":"Meow ah yes now I remember I was here it was cool from music to drinks to value to staff a","useful":0,"cool":0},"ENZp2ZC11XGUEzNvlMRQfw":{"text":"1 year later I come back here hoping you have 5150 by Blake Shelton but no. You never upda","useful":2,"cool":0},"y0evjqfCBqy1c7HeMSV9eA":{"text":"I don't like karaoke, but somehow I still find this place really fun. It's pretty dirty an","useful":1,"cool":1},"45UfMam489lVpT1YN4-dhw":{"text":"Stopped in here as we were walking down bourbon st. You cannot bring outside drinks into t","useful":1,"cool":0},"RdeVsFCzQRGne02sGRBGBQ":{"text":"Meeeeooooowww!!!! \n\nThis may have been our favorite bar on Bourbon. And it's probably hard","useful":2,"cool":2},"tIRDxKNc54qPdsRfW8LD4Q":{"text":"Website and Google says they're open....\n\nThey're not......\n\nIf you can't take a few minut","useful":4,"cool":0},"r-JXaXrDwyWQaW4kxqP3dA":{"text":"This is, by no means, a reflection of the establishment itself because the bartenders were","useful":1,"cool":0},"E3KuCXg37yY0Sz2NcJVKgw":{"text":"This was by far the most fun part of the French quarter! \nWhen we got there, we didn't kno","useful":1,"cool":2},"sTN-YroCVStzm4XlyMyTFQ":{"text":"By far one of the greatest Karaoke Bars I've ever been to. With several bars, an inside an","useful":2,"cool":1},"U2uKVOxgk_MCft_DqSfLzA":{"text":"Long-time patron, one of my favorite places on Bourbon Street!\n\nI've been going to Cat's M","useful":0,"cool":0},"S3fxCCizJ9XZhp7CF73lbQ":{"text":"I came to NO for a conference and loved the nightlife. On the last night we went out again","useful":0,"cool":1},"lHgB2l5JukxN2zrcbmtooQ":{"text":"This place is pretty fun, definitely a cool place to be entertained. You can also join in ","useful":2,"cool":0},"A24qPTxkTVNwWoXsKSiJHQ":{"text":"So when you're on bourbon Street and had a bunch of drinks (see New Orleans behavior)...we","useful":2,"cool":1},"22nEzWivTMJQJqG8bEqLvQ":{"text":"Definitely a tourist spot. We went right after watching fireworks for New Years in Jackson","useful":1,"cool":1},"0bUiiTu2y2OI3PnDIy64cQ":{"text":"The bouncer at this bar stole a 20 dollar bill out of my hands. Then his manager and some ","useful":5,"cool":1},"srXwGfTjXiuQREfqMygb7A":{"text":"Ok so it's a blast, it's even fun to join in the fun when you're just walking by. Now some","useful":2,"cool":1},"HLUc4KO8lxyMP1s6gr1pyA":{"text":"I hate Bourbon street... The smell, the parking, the obnoxious, loud, inebriated tourists ","useful":5,"cool":4},"eiXrI5FPhuhCS7NjhRzxFw":{"text":"What a dive - if u are an international who has valid ID but no passport - even from Canad","useful":1,"cool":1},"WO_1sOlohdMT6Wd-iujW5w":{"text":"I was dragged here kicking and screaming back in mid-Decemberish 2012 by the group I was w","useful":6,"cool":3},"rKlvzvqMcRzmJ_uNaul6MA":{"text":"Parking:  SUCKS\nDrink Prices:  TOO HIGH\nAtmosphere:  WAY COOL\nKaraoke:   SUCKS.   Not near","useful":0,"cool":0},"4zb9vXc7mkdg1WqPztNTgQ":{"text":"Place was full and karaoke performers were entertaining. Music was mostly good. Problem wa","useful":2,"cool":1},"EdBz9cIDUrYbz84ODbG_Xw":{"text":"Even for Bourbon Street, this place is a shit hole. Overpriced beers served in a dirty Kar","useful":0,"cool":1},"gsTQpPv798-xApyRpKi8Ww":{"text":"We decided to do our post-rehearsal welcome party for our wedding at the World Famous Cat'","useful":0,"cool":0},"-WLn3MOyiEsBam0SC9UCiQ":{"text":"Karaoke! Drunk people! What can go wrong?\n\nI was drug here kicking and screaming, but it a","useful":1,"cool":0},"qoU4bTfUJLkUJvtDPGc_fw":{"text":"If you were in New Orleans and got kicked out of the upstairs area above the stage... yeah","useful":2,"cool":1}}