{"LsrAvTJp4vk7f4M60B77BQ":{"text":"I stayed At this hotel for three nights. I knew from the price it would be that great of a","useful":0,"cool":0},"xG9ycSE4Ju4l2vm3XZi6rw":{"text":"This was the worst hotel I've ever stayed in! Where do I start the elevators did not work ","useful":0,"cool":0},"RSaVDT9xLeH3YOFfrj4MPw":{"text":"Before coming here, I checked out the reviews on Yelp, Hotels.com, Travel Advisory, and ev","useful":2,"cool":0},"nRNQkCHvqbC7nIj3BgvbeQ":{"text":"I just left the Chateau Dupre today, and I will not miss it!  Don't stay here!  First, I s","useful":1,"cool":0},"pACcC35gDJoO81JqO6cs0A":{"text":"It definitely was not a cheap stay! 600bucks for 2 nights. Sure it was jazz fest but come ","useful":0,"cool":0},"U6O29H8hYD2wj0NxqTr28Q":{"text":"This is probably the worst hotel I have ever stayed in. They didn't even have an elevator.","useful":2,"cool":0},"ZojSYjVOnmDoaF9dliRYZg":{"text":"For an inexpensive hotel, this place was fine and I would stay there again.\nClean bathroom","useful":1,"cool":0},"gWmGLXCUxA2_LnfdxXofTQ":{"text":"This place is a comedy of errors. \nThe best part was arriving to a broken toilet in our ro","useful":0,"cool":0},"kl0hbAp1vA4uLIE8ErJWWA":{"text":"I read the reviews of this place and I was a bit scared but the room was already booked...","useful":1,"cool":0},"cvVHFSw9-bRXmsApYxDHPw":{"text":"Desired a cheap place to sleep and we are very easy going and can put up with a lot but th","useful":1,"cool":0},"om4wLvpLeh24UJi3BwAm6g":{"text":"My original reservation was at the French Market Inn. When I arrived they had no rooms and","useful":1,"cool":0},"_XMv1QgItTzFmH6_gLkx9Q":{"text":"First of all, this is not a five star hotel. It is a really cheap place to stay in a great","useful":0,"cool":0},"0Om48cZ09VlVYAxrxH9q6A":{"text":"This hotel's website calls it a \"luxury inn.\" That's not the case. But it is a relatively ","useful":0,"cool":0},"f4xhWWGLav2vBgO6jSVzNQ":{"text":"The initial check in process was a pain in the ass, the dude working the desk was very inc","useful":0,"cool":0},"GUOTLjN15mqrKIrQOfY19w":{"text":"Not a bad place to stay. It's a little bit run down, but we liked it just fine. My husband","useful":0,"cool":0},"N_PmOUfT8drpj_VlkIkB-g":{"text":"Unlike other reviewers, i don't stay in hotels for the luxury. I just need a bed. That sai","useful":6,"cool":1},"oTfpmLQ9PyRCrKsNPs1wcA":{"text":"This hotel room had stains everywhere... on the carpet, on the drapes, on the bedding, etc","useful":1,"cool":0},"K0oF8O5a_L3elAmcxqkFZA":{"text":"The price was ok and the location is good.  Room was clean but missing the deadbolt (fine ","useful":2,"cool":0},"8lq0BsHotPR4f6-WjaDN0g":{"text":"True, it's no a luxurious hotel. But the location is the big selling point. Close to Canal","useful":0,"cool":0},"EwisdzkR3bZf3BjTzl3Ajg":{"text":"We checked in on Friday with the intention of spending a romantic weekend in the Quarter..","useful":0,"cool":0},"C6R81A2N3N9DVIUXSL1iFg":{"text":"Ok, for the postitves:\n-Clean room\n-Clean bathroom\n-Style very fitting to the French Quart","useful":1,"cool":0},"m8c7a-hHqc4uqaYasBpDLg":{"text":"You can tell that the owners take no pride in this building, which is a shame because it c","useful":2,"cool":0},"NFF9Ewi3VZCAoUvIqtp3SA":{"text":"I really don't know how to feel about this hotel. It bordered on ghetto and was definitely","useful":0,"cool":0},"CxmCJ7flM4-Cx8Bp_jgy9Q":{"text":"Terrible experience, the rooms were cockroach infested and just looked dirty. It was so lo","useful":1,"cool":0},"OlDKoIfwpZPePeeNvyH6UQ":{"text":"Was there for a few days earlier this month.  Rooms were nice, spacious.  A little old but","useful":0,"cool":0},"aY-muvxd6tKgRW0MfhCLSA":{"text":"My bf and I arrived at the hotel on Tuesday 07/02/14 to be greeted by a shitty smell and t","useful":0,"cool":0},"1owb5__UBOxjpzKioEk8Tw":{"text":"This hotel left such a poor impression on New Orleans that I have very little desire to re","useful":1,"cool":0},"nyUmbsl37vYikMJSTgyl-Q":{"text":"Good location - good price ($119/day) - friendly staff - clean room and bathroom.  Downsid","useful":0,"cool":0},"rMraQVyPAEyD6hyXKfavGg":{"text":"Understanding that you get what you pay for...when first arriving the elevator door nearly","useful":0,"cool":0},"srUt9IUvd_kjmqwiRoIOhA":{"text":"No frills and quite a bit outdated. I laughed as they told us to mind the elevator door, b","useful":0,"cool":0},"rXMsJJuijmcs25wKbIheSQ":{"text":"How can anyone rate this rat hole above a 1. I'm a dude and wouldn't even shower there...a","useful":2,"cool":0},"xtJVwWOKyAvBbVOmGphqzw":{"text":"I made the reservation at this place pretty much knowing what I was getting myself into. I","useful":0,"cool":0},"-eBaVuxInW2dkpwBxg9laQ":{"text":"My husband and I stayed on vacation here and loved it. Its sad that it got so many bad rev","useful":0,"cool":0},"nWFgQAMD17ZF8uEeh0KiQw":{"text":"Complete crap!  The elevator doesn't work (and hasn't worked for years, I'm told) and the ","useful":1,"cool":0},"vuxe2FhzBt-6S6rY1M3Y3w":{"text":"My BF and I wanted to visit New Orleans during one of our trips to Shreveport, his hometow","useful":3,"cool":1},"Jfy7KDLplkMC8gqnTjzxgA":{"text":"After seeing the first room which would have only earned one star, we asked for other opti","useful":0,"cool":0},"188wKtJFdLfxrlffGhZMEA":{"text":"Great location and very friendly desk help.  But rooms are substandard.  My first room was","useful":0,"cool":0},"L3twi7YW1AuSFQdYQ7uIxQ":{"text":"This is a nice hotel.  Not great....but considering the location and the price, it was ok.","useful":2,"cool":0},"HdYFZJ8G7xBsj8tDE9TbVA":{"text":"I came into NOLA for a bachelor party, but had trouble finding a reasonably priced room fo","useful":2,"cool":0},"JkAtwH-r9BmWrh3HY1roEw":{"text":"The staff was super sweet and friendly, and the rooms were spotlessly clean. The furniture","useful":0,"cool":0},"xXUkdnDXi8xA0umHRIRmdQ":{"text":"Not top of the line but not lowest either but as for me it is perfect .  It is an older bu","useful":0,"cool":0}}