{"E0yrzLcfZIqt3OHRVWUZCw":{"text":"Scam!! My husband and I were pulled into the bar by the shot girl on the sidewalk. She ask","useful":6,"cool":0},"4XTOa9P5TuPVM8OZAwRYVA":{"text":"Would you like to buy an overpriced cup of corn syrup and neon food colouring that is bein","useful":0,"cool":0},"WMRS6QPaLmzrY_kH_p5-VA":{"text":"Wish I can rate this place as 0 but I guess I have to at least give 1 star which they don'","useful":1,"cool":0},"TG1tny6YnQeIRjIml3rmVw":{"text":"Go in and out of here by your own choice! We were walking around Bourbon and stumbled into","useful":1,"cool":2},"K9D48NViT1MdCBp0HV86pg":{"text":"Date night and had a fantastic time. Very happy they were open on a Monday night. The pizz","useful":0,"cool":0},"Gt9_UAZ4AD_Xrb5VC2NnPg":{"text":"We walked into the daiquiri place across the street but, there was nobody behind the count","useful":5,"cool":5},"A4c66D7042MZdhtkYShkAg":{"text":"This place is a scam. DO NOT BUY FROM THEM!  They quickly grab you and pour multiple shots","useful":0,"cool":0},"VwjdVMHzCy_SnAdtPZVXSA":{"text":"Oh hello frozen boozy goodness that I can just walk around with anywhere I want.\n\nThis is ","useful":6,"cool":2},"dq6CttofNzI2qHYqWewfhg":{"text":"No atmosphere to speak of but the alcoholic slurpees are pretty good.  Given the takeout e","useful":1,"cool":1},"mY2GopuF4TyzW2q3iomCzg":{"text":"Got a mango daiquiri here because it was ALL over bourbon street and we were drunk and tho","useful":2,"cool":0},"VHioWvuEztzP8UXin1WPyw":{"text":"Oh wow looking at some of the other reviews I honestly can't say that I've ever been in th","useful":1,"cool":1},"MaKIBDRXnky6f4sHlElyGQ":{"text":"With all the good drinks you can find in NOLA, I don't come here very often.  But they do ","useful":0,"cool":0},"8gGB1RJc8zwp73sN_8js3Q":{"text":"Bourbon street is funny I swear that I magically went in a circle and it's Mango mango tha","useful":1,"cool":1},"q3APwjnEIeyxyF6vTydU2Q":{"text":"When we first got here in early afternoon we stopped in here & we're totally happy! They h","useful":1,"cool":0},"jl5XA9cuVgOo0jPuAp6Oqw":{"text":"Tasty, but expensive. $13 for a large cup and the drinks are pretty sugary and sweet not a","useful":0,"cool":0},"zmWU2VWgXfrgxb-iJMgrDw":{"text":"A HUGE RIPOFF!  My friend and I walked by and two shot girls grabbed our arms and pulled u","useful":0,"cool":0},"mcvsVa4bzNtWwWiW3lFONw":{"text":"THIS PLACE NEEDS TO BE SHUT DOWN!!!! Me and my friends came here on a whim during our Mard","useful":5,"cool":2},"74HCmzSmChvWCNuFTf7F0w":{"text":"Other than almost having to knock over the guy making the pizzas because he tried to block","useful":1,"cool":3},"3On0v-ywxvr4Tv8YwUU07Q":{"text":"So, I had no clue what I wanted and the bartender suggested a \"sweet tart\". Basically a mi","useful":0,"cool":0},"aKEoucdwEj7RtyvCV37Kaw":{"text":"Stopped here after we ate at a restaurant and were still full.  Decided a slice of pizza w","useful":0,"cool":0},"bWEaGijmZjUD7e-PBX8GzA":{"text":"$2.50 Jell-O shots! Why aren't you here? Not much more to add then that! Best value here.","useful":0,"cool":0},"uan18noUNcc3SkIKka0nnw":{"text":"The pizza was a step and half up from totino's in my opinion, but I did just go to NY and ","useful":3,"cool":2},"9MhIYuYUjq82-PseYskcZg":{"text":"You cannot call this \"pizza.\"  They need to take the neon pizza sign down and do away with","useful":0,"cool":0},"UrTEUyfhb3Br5Kjm1As0Vw":{"text":"SCAM!!!!! Listen to the poster above!!!! This place is horrible. They saw us coming a mile","useful":1,"cool":0},"nkqnm_19rHCREGiJcxqudg":{"text":"NEVER COME HERE!!!!!! Not only does this places pizza tastes horrible... But they have a p","useful":1,"cool":0},"kq5rbehGZSAIvjsFn71GOA":{"text":"They insulted us, and told us that we would GET BEAT UP if we didn't pay $20 for 3 tube sh","useful":0,"cool":0},"G3RP5Fc8JaJJX3tvyJX5qw":{"text":"Slushies with a twist...many locations peppered along Bourbon St.\n\nThe Significant Other F","useful":0,"cool":0},"UsGVQ3YrNqVj_25HDgd2eg":{"text":"Walking down bourbon with a mango mango daiquiri is a very fond memory for me.  It's a lit","useful":0,"cool":0},"6rS8rvFen_0-_xLhNYiwNg":{"text":"I've traveled a lot in my life and this is by very very far the worst place I have ever be","useful":0,"cool":0},"tYJnBjI31nDTqHf2ec07aA":{"text":"Was in the building for less than 5 minutes and one of the waitresses lost her mind becaus","useful":0,"cool":0},"85jWpEK4x8HptunUq56Ikg":{"text":"Pretty simple and easy place! You can sample some of the daiquiris and mix them once you o","useful":0,"cool":0},"zahniwJ1ACpedOtDU7L40w":{"text":"A French Quarter tradition. Not sure about the food, but the daiquiris are always fun and ","useful":0,"cool":0},"vXXQiH5WqXjDhgw1DdqP0A":{"text":"Don't bother! This place is a complete scam and if I could give it a negative star review ","useful":0,"cool":0},"r7s4y1WzI6OG-hMYdktUxw":{"text":"Mango daiquiris are awesome. They lose 2 stars for the super rude & super drunk bartender.","useful":0,"cool":0},"sYoaI9LMBEQE6NQRGkD5cg":{"text":"Good place to stop in and grab a quick drink if you need one while cruising Bourbon. But f","useful":0,"cool":0},"mMPEgGkZaaTVXEhOBRE9yA":{"text":"Patron margarita. Bartender squeezed about 6 lime slices into the cup and then proceeded t","useful":0,"cool":1},"7FG2gWSw4W7RLu0ou8TEig":{"text":"Pretty Frightening Stuff!. I guess to a drunk person looking to score frozen looking pizza","useful":0,"cool":0},"HoqeYeLVhBORBv3GFUoMzA":{"text":"RACIST BARTENDER!!! DO NOT GO HERE IF YOU'RE ASIAN! \n\nThe bartender made up some elaborate","useful":14,"cool":3},"w2J8vbilUSHonSjxDXIWaA":{"text":"Stopped here for a drunken slice to end my Saturday night. I was shocked that a plain slic","useful":1,"cool":0},"6J8JV0SATCbOQJSb9u2kLg":{"text":"do not go here they will scam you. as you can see in previous comments a woman took us by ","useful":1,"cool":0},"uLqS3_XQaJRlrJYik29Rww":{"text":"I could immediately tell that the pizza would be substandard when I walked in the place - ","useful":1,"cool":0},"_QHj2zarpb63B1vzeiNgOw":{"text":"Frozen drinks are really good, perfect way to start your trek up Bourbon Street.  The pizz","useful":0,"cool":0},"Sztgu9GnvCSBaNlDEsVXWw":{"text":"This place charged my card twice for one drink and wanted to argue that they didn't when m","useful":0,"cool":0},"EE-UF0D1mNnrtKi-tJvvsQ":{"text":"Walked in with a group and immediately had shots thrown down our throats (I love to drink)","useful":0,"cool":0},"T6psoMRBq4G2p-SVpdAF9g":{"text":"You will only know this place is a hustle if you either look at reviews prior or get hustl","useful":0,"cool":0},"244G3BcDoYHwMHNpYZS5-w":{"text":"There's two types of Bourbon street: the really trashy ones, and the ones that masquerade ","useful":1,"cool":1},"qyB3BptCMqMMcyUE4DD0qA":{"text":"Don't ever go to this place. Scammers . They will rip you off and the shots have no alcoho","useful":0,"cool":0},"KR2wWK8DQGltsUmfv3tXZw":{"text":"Legit crap. My girlfriends are here for a bachelorette party. First night, we walked by th","useful":4,"cool":0},"7azmQHLmZRs-E40oGXr90g":{"text":"STAY AWAY! They will hustle you! Want shots? They will put 3 shots in their nasty mouth an","useful":0,"cool":0},"k4qt2yzeU3SVIRafQU2zlw":{"text":"We just come here for the Pochahontas's bloody marys, they are the BEST and she works morn","useful":1,"cool":1},"aQuW_4TPW0QLHaRz0ArZ2w":{"text":"After checking in, this was the first stop on the way to Bourbon Street to pregame before ","useful":5,"cool":2},"fy5NRZQ9ifilbwS1Yif0IA":{"text":"We had such a great experience in New Orleans so far. Until this place. Everyone we had en","useful":1,"cool":0},"TPOWsDNLHYYSo5EUzK41Ow":{"text":"This rating is purely for their pizza.  When you're cruising bourbon and looking for a sli","useful":1,"cool":1},"fqYq7C6XYAOy05MmpQ4Ryw":{"text":"STAY AWAY!! \nSeriously stay away from this place!! Huge scam!!! The shot girls literally p","useful":3,"cool":0},"gNMuJEFDE88QX8FvIHhErg":{"text":"just reviewing the pizza here, which was AWFUL.  i swear it's like a safeway frozen pizza.","useful":0,"cool":0},"SSc9zISL-jnnQhF8Xmot7A":{"text":"I fell in love with the girl with the braces that works there. \n\n1 drink gives you a good ","useful":0,"cool":0},"lCi5sWAYYDPXPoxdC5aYGw":{"text":"The flavor of the daquiri's are so artificial that they are hard to drink. And I suggest y","useful":0,"cool":0},"o7wLgih7wthSIXx6KMqSPg":{"text":"Mango Mango?! All I hear from this place is don't go, don't go. Honestly, this place is ju","useful":0,"cool":0},"fBqCLExgWGUt8UBqK42e7g":{"text":"I would rate this zero stars if possible. I was here on vacation trying to be brave and ta","useful":0,"cool":0},"o04Q0dq4hTCloBCFeahtKQ":{"text":"Two words: Absinthe Mojito.  After having a couple at the Old Absinthe House up the street","useful":0,"cool":0},"7wXfI7fSRUPvOth6jVgCEw":{"text":"What can I say. Crappy pizza, overpriced beer but decent daqs. Ill just keep moving.","useful":0,"cool":0},"vd-l4H0qhkbmONr1a38yWQ":{"text":"DO NOT FALL FOR THEIR \"TAKE A SHOT AND PAY $28\" SCAM! Just as another used mentioned, my f","useful":2,"cool":0},"MvCaLh7Q4_EQSe8w2xgIbw":{"text":"Because we were such tourists, we continued to walk Bourbon Street like there's no tomorro","useful":1,"cool":1},"-igteOn7EpP29cr661XmvA":{"text":"It's really zero. Worst pizza slice ever. If I had the choice of pulling a slice of underc","useful":2,"cool":0},"_fYGSwj-iGu-s_YBmIBmJg":{"text":"Scammers, They poured shots into my mouth, then asked for $20, I called them out and they ","useful":1,"cool":0},"bVJnqn_N4gRr2cPMPhMkQg":{"text":"This is the place for the most value priced beer you can find on Bourbon street. Generally","useful":0,"cool":0},"GVaMTLN306QLZoWHPMEFBg":{"text":"I'm not a drinker at all.. so I love that they don't have much alcohol...got the piña cola","useful":0,"cool":0},"DeRVZHPoxVsulYfn3wbtwQ":{"text":"This is a scam. Do not listen to these little scam artist. They will offer you free shots ","useful":1,"cool":0},"AdH-5S2pwl00EWeaYnAmdQ":{"text":"I'd never had absinthe, but Mango Mango may have had me convinced. Wandered into a random ","useful":2,"cool":1},"AXqBe27hAXTWiUKzvxIB9Q":{"text":"Wow, the shot girl is a total con artist. She grabbed my boyfriend and me, tricked us into","useful":4,"cool":0},"PRrD4XYJDyo7Et1EdgHXrQ":{"text":"Not much alcohol and very sugary.  However, they have a wide selection.  Everything is ver","useful":0,"cool":0},"qS_NZI2LsTZ2VCMq3ITWnQ":{"text":"Rip off! Avoid at all costs!! If I could give this place negative stars I would! They coax","useful":5,"cool":0},"rhHpKYH9YDkWVc6WJfsLSw":{"text":"Worst bar on bourbon street. If there was a bar that's a scam, this place is aweful. Horri","useful":0,"cool":0},"-85sK4gmQdiKO4ORh4ufgg":{"text":"My friend and I walked by this place during the day on Saturday, and there were two female","useful":6,"cool":1},"qKvAVnLgliwFbbAzD3FIsw":{"text":"Came here to get a hurricane but was not impressed.\n\nMost drinks you get on Bourbon Street","useful":1,"cool":1},"-6pLXWceTSSpGsxTLlCOhw":{"text":"Horrible treatment by the employees, especially a particular female bartender!  My brother","useful":1,"cool":0},"H2YUegBi103TqWE_JxpDTA":{"text":"scam! we were pulled in off the street and forced test tube shots! after being given the s","useful":1,"cool":0},"sFaHwUPSJF999yWqyGyQRw":{"text":"Horrible. Just terrible. They grabbed my girlfriend, poured a drink in her mouth, and dema","useful":6,"cool":0},"oPLxMXomSdBXX40kg_x-bw":{"text":"This is THE WORST bar on all of Bourbon Street! The shot girls are scam artists- they pull","useful":1,"cool":0},"V7NBrkf-rQ-oz5LLDrasLA":{"text":"So my friend and I are visiting from out of state. We were approached by a young woman who","useful":0,"cool":0},"XNk46JkdmdHFti1hV_Valg":{"text":"What a garbage establishment. They forced shots on my friend and then charged her $80 for ","useful":0,"cool":0},"J3qCgitfXv-OLqpOYBHaGQ":{"text":"It's early afternoon, we just arrived to New Orleans and ready for an adult beverage.  I o","useful":0,"cool":0},"sUUgNcoKjlgDl7mUxgI5fA":{"text":"I was in NOLA last week for my boyfriend's family reunion. Of course, we hit up Bourbon St","useful":11,"cool":0},"9LfFyS-VQazmvZH4dHPg6Q":{"text":"Where do gangsters go when they die?\nThey don't go to Heaven, where the Angels fly.\nWhere ","useful":1,"cool":0},"2Ofgp0hMnS46e9CQyUqKnQ":{"text":"Our favorite daiquiri place in New Orleans. Clean shop, easy in quick service, great drink","useful":0,"cool":1},"hHwxqZC8DiuvQ8Yoa7dDEQ":{"text":"I got a job at a sporting goods store.  A few days ago, I got my first paycheck in 6+ mont","useful":1,"cool":3},"fFRx2hBCQPOpXAwMMimELQ":{"text":"Scam!!! Listen to the comments. Please Avoid this place...... They pulled us in and forced","useful":2,"cool":0},"fh2BiEdDVvfHeA562NbKwA":{"text":"DO NOT COME HERE! This staff is SHADY & DECEPTIVE one of their workers (shot girls) comes ","useful":0,"cool":0},"yxo_jXFzYziEJbNMWmlp-Q":{"text":"This place was a COMPLETE joke. DO NOT COME HERE. The shot girl asked me and my 2 friends ","useful":0,"cool":0},"wS5nDmOjXzx8wMTmQVTcgQ":{"text":"I wish I could leave 0 stars. Walked down bourbon to check it out at about 6pm on Friday. ","useful":0,"cool":0},"avKyYHRt-oMHpibIfOGS6g":{"text":"Never again!  They just ask you if you want a shot.  Give absolutely no prices.  The girl ","useful":0,"cool":0},"6-fdoEzzvyiC4E18MCPl-Q":{"text":"At best this place is average.  Their daiquiris have alcohol but lack flavor.  Try if you ","useful":0,"cool":0},"bnLuh9PgnltOFwjyLZtvVw":{"text":"There is not much to say about Mango Mango.\n\nThere are actually a couple of these garishly","useful":1,"cool":1},"96BZ8fkOUYMj2BOM6CBwfQ":{"text":"Mango Mango has positioned itself within a verify small niche in the Bourbon Street market","useful":0,"cool":0},"6i2pcftm4LDwmXgQU5nntA":{"text":"Stay far away! Don't fall for their scam! Girl charged me $30 for 4 shots of kool-aid then","useful":1,"cool":0},"jtWmr39KjNl76tFkxoJ8yQ":{"text":"Well now would be a good time to clean your taps and provide beers to your customers that ","useful":0,"cool":0},"OO62Lb12jQvYZ_d9KRwYvQ":{"text":"Mango Mango is a Bourbon street staple.  I love them...the pizza isn't New York Authentic,","useful":4,"cool":3},"uaCYBdtOO_U7mAiP_r4nPQ":{"text":"Shady af. The rest of the reviews are correct, but you'll probably read them too late. As ","useful":3,"cool":0},"id6jgvU8tMq9J4SLBnCOBA":{"text":"Walked in with a group and immediately had shots thrown down our throats (I love to drink)","useful":1,"cool":0},"F6cCB2aK2sgFyCTAl70Rcw":{"text":"$10 for a watered down shot that I didn't even want. Nevertheless the workers here are too","useful":0,"cool":0},"G5ApGAtjQWBhT_A4vEDAsg":{"text":"Drunken night walking down Bourbon Street, what does that call for? PIZZA!!! (Although som","useful":3,"cool":1},"6brxvTYljTofiy6ywknjqw":{"text":"Rico see so many mango on Bourbon street.  One man from far away say that pizza taste is s","useful":1,"cool":0},"BSGHrzadwwqkzZ9VgdCwYw":{"text":"I WAS TOLD  TYPING IN ALL CAPS MEANS YOU'RE TYPING ANGRY OR SCREAMING. GOOD THAT'S WHAT I ","useful":7,"cool":3},"PfMW8tChukT73uful7wWkg":{"text":"I came here for the pizza by the slice in the back. After being a New Yorker I was a bit d","useful":1,"cool":0},"7X8Kw6p06EAbNzAoq2ovYQ":{"text":"This place has a prime location on Bourbon St at Iberville. There are girls that grab you ","useful":0,"cool":0},"KT_AtEFyR6JjkLOdmH4d8g":{"text":"I really like the piña colada. Prices are decent. You can use the restroom if you hold ont","useful":1,"cool":0},"oLpHujBV_I4pJt-e8ZFaYA":{"text":"DO NOT GO HERE !! Stay away from this place !! I was walking down Burbon street and a slee","useful":5,"cool":0},"p0ce37TNIY_hpD_bNgQlCQ":{"text":"I'm just gonna go ahead and squeeze out a Cleveland steamer into this punchbowl of Yelp re","useful":3,"cool":2},"HyvNgH333cvRMUDuqH_9tw":{"text":"The girl out front tried scamming us on the drinks. When my wife called them out the chick","useful":0,"cool":0},"ii4EmkxcIphlRKsq1NG3jQ":{"text":"Beware of the crazy l@@king chick with the test tubes.  She put 2 in my mouth and she took","useful":1,"cool":0},"E8ZGTvqqnTCDjduSQdrcxA":{"text":"I wouldn't even give this place 1 star...the first drink I was served had a hair in it. We","useful":0,"cool":0},"H7rTf1QxOhmVGEB2eoporA":{"text":"TRIGGER WARNING: S.E.X.U.A.L  A.S.S.A.U.L.T. ‼‼‼\n\nSo me and a group of women came to New O","useful":6,"cool":0},"m2Ttb_64I6MAmduHmV0hhQ":{"text":"This place is a scam unfortunately, Pulls you in off the streets and throw shots in your m","useful":0,"cool":0},"I9b2cIm9e0k-RzIcD5KtyA":{"text":"Before the storm I would seldom wander along Bourbon St., the whole vibe was way too touri","useful":4,"cool":2},"y4c67WYaJUFwo_3IeJQ5tg":{"text":"If I could leave negative stars, I would. We were pulled off the street by a seemingly har","useful":7,"cool":0},"gzZzoSp173M1g_7FO83HCQ":{"text":"PLEASE DO NOT GO HERE. So many better, more fun places to go on bourbon street than this s","useful":6,"cool":1},"5pAnwg9odkX_JrW2AfjplQ":{"text":"We were walking down the street right in front of Mango Mango when a girl approached me sa","useful":3,"cool":0},"Ln8cOmtdQb2GHD3yfNZBZA":{"text":"ABSOLUTELY AVOID AT ALL COSTS! UNLESS YOU'RE UNDER 21..\nJust as previous reviews have stat","useful":2,"cool":0},"KsvZKNdopo6s-ya2OzozRw":{"text":"Dearest Reader--\n\nProceed cautiously.  I would recommend this ONLY during the darkest of h","useful":0,"cool":0},"kLwFxPtKLT2lLT1yNFtQlA":{"text":"Beverly gave us great service and drinks! Good laughs!! Drinks were strong!!!!!!!! It was ","useful":0,"cool":0},"ji2FC4R9BXPWjfFnvnt7uQ":{"text":"Avoid this place like the PLAGUE. Agree with other posters like Chad F, Joseph A, Leonard ","useful":4,"cool":0},"JBnA-8QGcbTg8FSf6Pp6Pg":{"text":"Ordered a half mango, half strawberry daiquiri for $11. Not as good or strong as the same ","useful":0,"cool":0},"yXQi7hJekYt4De87FxFwkA":{"text":"SCAM ALERT!  Never get a drink here without asking the price.   $30 test tube shots?  F th","useful":1,"cool":0},"JEyijYlCB8-IUzDg20FWqg":{"text":"Didn't go in for an actual daiquiri. Two women were outside and solicited us to come in. W","useful":2,"cool":0},"i9NccJ1UVr8K-gN17VRL8w":{"text":"Stay away from this bar! If you walk past it, they will physically pull you in and force a","useful":1,"cool":0},"NzRZBnQ3vgj4lvetXpwXpw":{"text":"Lay is absolutely so welcoming and sweet ! Would recommend to anyone visiting and looking ","useful":0,"cool":0},"AmMz_kDBm6advwd7mO_JzA":{"text":"Scammed into taking a shot when they make it seem like it's free. Then snarlingly adds us ","useful":0,"cool":0},"yrJ1usukvxn0knr1NS0QoQ":{"text":"Their Pixie Stick flavor slushy is super good! And the alcohol soaked gummy bears were 2 c","useful":0,"cool":0},"j_wHZdzTtll55ScV2rsDgg":{"text":"These drinks aren't everything we expected, actually none of drinks in New Orleans were. I","useful":0,"cool":0},"cUzmmVjuel7iwuRZojnO-A":{"text":"Scam. Shots forced without any word on payment.","useful":0,"cool":0},"M6dZu9UvfVNLRqBPLiq8CA":{"text":"I got two drinks for $22. When I got back home and checked my credit card bill, they charg","useful":1,"cool":0},"oavh9f-JSMSs6h88dOLdqw":{"text":"I wish I could leave 0 stars. Walked down bourbon to check it out at about 6pm on Friday. ","useful":3,"cool":0},"3hSMQ7oTJdiknY9uUPsNbA":{"text":"You can read the previous reviews to understand the one star rating. My friend and I were ","useful":3,"cool":0},"Ua0Xye5b8KEXxbWgZYgw4w":{"text":"This has gotta be illegal what they are done here!\n\nI done been hussled. Its a pretty slic","useful":2,"cool":1},"lqihf_X3boDRYqJnkRHpFw":{"text":"3 stars for the daiquiris; 4 stars for the pizza.\n\nHighlights:\n- Lots of flavors\n- Get a c","useful":3,"cool":3},"pkbaUNrsG0EUgn5srPDAVg":{"text":"Stay far away from this place. It's sleazy, and they prey on unsuspecting tourists. My fri","useful":3,"cool":0},"eRakUYK2vQf4kpNLSD1dHg":{"text":"The manager was extremely rude (larger white lady) we asked for a specific song to be play","useful":0,"cool":0},"1N37OnYUtE0b9a0kafv8_w":{"text":"I stopped during the day and thus didn't have to worry about shot girls. MM is one of the ","useful":4,"cool":1},"ro_ljVSLM-uIgnDc4DcFhg":{"text":"Waiitress tending bar wasn't paying attention and messed up order and overcharged me. Won'","useful":0,"cool":0},"dZvOyh_TON6rDQQBpK5SvA":{"text":"I would click no stars if I could. I was dragged into this bar by someone who worked here.","useful":3,"cool":0},"kYxyJ2ZwrdWRIqyM9S2CGg":{"text":"This place is a scam. Never go here and if they try to lure you in from the street - RUN F","useful":3,"cool":0},"BDwQaeTKp3JdPAgpj8T_gA":{"text":"DO NOT GO HERE. My friend and I decided to go here when we first got to Burbon. The man be","useful":0,"cool":0},"k-TCnmysYU7k8v51JrNdhQ":{"text":"I stopped in to have a quick drink before dinner and ended up drinking a large hurricane w","useful":0,"cool":0},"qDBZQVxTMZK5V7hfSDdyJw":{"text":"Roomy daiquiri bar that also serves about a dozen beers (mostly Abita taps) along with Jel","useful":2,"cool":0},"fqem319RlbFFvgdvrXoi_g":{"text":"Solid place. I'm honestly sad that they have such low ratings. I loved this place and the ","useful":1,"cool":0},"4YJJNH5HVW8g7ugRWEtaKw":{"text":"Was just assaulted by a shot girl. Grabbed me and my girlfriends arm as we were passing by","useful":3,"cool":0},"XGgl-dyNkLHG0AJBf3tr1A":{"text":"First stop once we finally left our room nice & easy quick drink .. don't let the taste fo","useful":4,"cool":2},"A1c2Av2EDNtui5OLqYgjtQ":{"text":"This is a pathetic place that can't get customers without scamming them! \nI was walking wi","useful":1,"cool":0},"goV7m-L4ty2JkoySTn475g":{"text":"We had a ball -- the bartenders were nice and quick and the drinks were really good. We go","useful":1,"cool":0},"JJc39Ud4vfDEeZQJjfaFXw":{"text":"Do yourself a favor and don't even come within the radius of this place.  We were getting ","useful":1,"cool":0},"oLOI3GrncoA5BHg4C0uYYw":{"text":"Piña colada. FTW! Wish hey had funner go cups but I guess styrofoam works? Lots of differe","useful":1,"cool":0},"1Qgy1HwrxeXRn0TWBn5QrQ":{"text":"One shot ladies came out of nowhere and tried to get our daughter to take a shot and we ke","useful":1,"cool":0},"q0_-trRBY51y-pnD2rgEhQ":{"text":"Decent daiquiris but in many other bars you have better frozen options for the same price.","useful":0,"cool":0},"XGUkp6yOztyVRxIcGATIVQ":{"text":"In town for essence fest, I was told to hit Bourbon street. This street is crazy packed wi","useful":0,"cool":1},"tvv2mpF2vwTnMmI9HMpwjA":{"text":"Where was the alcohol in my $12 drink? Ordered the mango flavour and while it was palatabl","useful":1,"cool":1},"fQm04s_6yD-64ELkLIAXiA":{"text":"Strong drinks. Bypass the sleazy shot girls at the entrance. Don't expect to remember anyt","useful":2,"cool":2},"5QoC6VmrKrWca0W89rlc0Q":{"text":"C'mon Yelpers - why such little love for my favorite place to buy delicious mixed Mango an","useful":0,"cool":0},"JOJk-0fL2GaARMdFG2XV1g":{"text":"I wish I could give this place a zero star. I hope they close down this place and never gi","useful":0,"cool":0},"6OVkG_BxuxmxoaG4bnjSTQ":{"text":"A legit scam where a woman will grab you by the wrist, as you are saying \"no, thank you.\" ","useful":3,"cool":0}}