{"VIhTxTqKetPdKKuqGqTzGw":{"text":"We visited The Blue Crab for Thursday happy hour at 4:30pm. The restaurant was surprisingl","useful":0,"cool":0},"1XeS2CmTctjVzYfQg1-2NA":{"text":"This place seems like it would be a great place to eat. Location is amazing but food is su","useful":0,"cool":0},"h64IqbuqO1_KwnhaC20dRQ":{"text":"Happy hour seafood and drinks are so good! $0.60 raw oysters/$1 chargrilled oysters and $3","useful":0,"cool":0},"D8RT9mSLyLuh-45bKXjNbg":{"text":"I have been going at least weekly since they opened and have enjoyed every single experien","useful":1,"cool":0},"yxzN85i2hfmKBwb2_vVwKw":{"text":"This place was awesome and it was 12 of us. I was full but I couldn't stop eating. We trie","useful":0,"cool":0},"7lQN2AccnPuDQw8qnxRHEA":{"text":"Came here for my Birthday with my two daughters & friends the service was great & waiter w","useful":3,"cool":1},"jY3rkJoSjPj6fLV8Vb9sDA":{"text":"Went there last night and was very disappointed. Took family there for my daughters birthd","useful":0,"cool":0},"5rJaHXJ8F76FhN_Uv16uqQ":{"text":"Soooo good! Great location on the water, excellent service. Awesome fresh seafood, better ","useful":0,"cool":0},"QxgOLGUG6A-EWPu93kMsQg":{"text":"Very disappointed. Went with my family, total 12 people so we had a range of food. Apps: b","useful":3,"cool":0},"Es-w4ek53vdHbpdc_hLE6Q":{"text":"The happy hour in this place can't get any better. 25cents raw oysters, and beautiful suns","useful":0,"cool":0},"VTVGyHoTmfgHHpeqqoXqnQ":{"text":"Excellent fried shrimp with batter that is fresh and tasty. \n\nNice atmosphere on the lakef","useful":0,"cool":0},"qhkmJytsVXt7n2cMB5Fg6g":{"text":"Service was great. She was very attentive. I had the shrimp scampi. Very good. Not overpow","useful":0,"cool":0},"fOEQqbJkGubQO9z5KGSR6w":{"text":"I'm going with four stars because while the food was fine, the location and ambiance was d","useful":7,"cool":4},"yXIplZP2oCfKDRq83hgkoQ":{"text":"I love the atmosphere at Blue Crab - laid back but still nice enough for a dinner date. Se","useful":1,"cool":1},"AZINSV2Oo9f_nxxYoupUOg":{"text":"If you are looking for good food and great outside views here is the place. Sit outside if","useful":0,"cool":0},"X5e7P0geE82rSI2t9FCNgQ":{"text":"Don't get me wrong, this place has spectacular views, but the food isn't even worth a star","useful":0,"cool":0},"4ytOhY87uMm4irr6WHvjfw":{"text":"They brought out s gluten free menu and then once we talked to he manager we found out the","useful":0,"cool":0},"oa0mA_qP3X1tCgUg50EA0A":{"text":"Literally one of my favorite resturants! \n\nWent here with a group of friends for a birthda","useful":2,"cool":0},"0tes3oLkYON41ruvbfJFeQ":{"text":"Went last night for the first time. Had the blue crab dip and combo seafood platter. Both ","useful":1,"cool":1},"CfM86VhYGNoUD8SqFXwYnw":{"text":"The food...spectacular. The service...absolutely horrible. This place has the potential to","useful":0,"cool":0},"qy_jHOdKU5z45qn8SYChKA":{"text":"Nice spot to have a meal on the water. Shrimp and grits is really good. Onion rings are th","useful":0,"cool":0},"ITwkD_Zqfviyuj0LfooMbQ":{"text":"The blue crab burger! Crab cake and burger in one. You can't go wrong. Pasta was good too.","useful":1,"cool":0},"CdKX_vEA1eVjsP8JR3dZuw":{"text":"Great delicious Nola seafood! Love the location / great views of lake pontchatrain!! FRESH","useful":0,"cool":0},"8xk6jiP4OlmaVoSh0tKYcA":{"text":"Had dinner there tonight. We went there when they first opened and it was not good. The ho","useful":0,"cool":0},"EHGRexZqJGJeam88jdM64Q":{"text":"I think The was the first restaurant I went to on my trip to New Orleans. It was a great f","useful":0,"cool":0},"OjpIDY56vHWdTge8HbtU3Q":{"text":"Nice place away from the city to eat and chill by the lake (with a view!). Oysters were fr","useful":0,"cool":0},"5ezo-8OV4bZ5NTa0x8-sjQ":{"text":"Had two waitresses on this visit (one downstairs and one upstairs) and they were both C yo","useful":0,"cool":0},"vaDdByRz13BxlhD2wVR6Uw":{"text":"The view outside is awesome. Staff is alright...we had to flag them down for service sever","useful":0,"cool":0},"IxdN8nyQNfwEGSOs4aecJw":{"text":"Stopped by Blue Crab this past weekend while in town on an anniversary trip and it was ok.","useful":1,"cool":0},"2kItVg8cxmkW8LArBcf2qg":{"text":"Some of the best fresh oysters around.  Don't fall for the imitation places that reuse she","useful":0,"cool":0},"kqJHQVjHds4HGWrQL3dF3Q":{"text":"The service was good. The atmosphere was amazing. The food was not worth the price. Our fo","useful":0,"cool":0},"IfVIwTlQ8SgZX2GD_J6hIQ":{"text":"I absolutely love the ambiance! The seafood is top notch and the service is great! The wai","useful":0,"cool":0},"NRZmdWPfI9JrSRM1jPGwxg":{"text":"Not what I expected. I had the combo platter with fried fish & shrimp. It was just ok. Man","useful":0,"cool":0},"lSLYRMt9hhA1SdSqsHKGYw":{"text":"Enjoyed dinner last Saturday, the 19th and it was wonderful! I'm from New Orleans, but liv","useful":2,"cool":0},"lwWLZPYjnJl-r8nCFAozsQ":{"text":"Dined in tonight (Friday) myself and a business colleague. Our table was out on the upper ","useful":0,"cool":2},"ZjZRiYH1spWY5yXF8c-8hg":{"text":"Had dinner here last night. Tried a few things. Here's my take on each...\nGot two free sou","useful":2,"cool":0},"tTmsQhOl2IbuUz2XBprGwg":{"text":"Disappointing. The shrimp and grits were decent. We would have been better off ordering ch","useful":1,"cool":0},"flZJjshjD2pydB6uU6MkSA":{"text":"The food was excellent and the location was fantastic. We ate on the upper deck overlookin","useful":1,"cool":0},"XHn3ycjOIaT-bH69pXSW3A":{"text":"Beautiful scenery from patio of boat marina.  Food was so so...My entree was Blackened lin","useful":1,"cool":1},"7nmDXk8FMyvMCz-J5_bSgw":{"text":"Horrendous service!  Bland chicken gumbo, garbage garbage garbage.  Wouldn't recommend to ","useful":0,"cool":0},"bqtx4mL79qrJ13POP4SaYg":{"text":"Dinner last night, 45 min wait for a table!  Ate at the bar, great service.  Crab dip was ","useful":1,"cool":0},"rTwhnSR11L7xjKogbJaepg":{"text":"This is where we started our stay in NOLA. Views are good. Service was pretty good. The gu","useful":2,"cool":1},"I0C5oqwJdAzauMRj34_2Ig":{"text":"Ok scenario:\n\nTable for 8, with a reservation, at 6:30 on a Friday during Lent.  Sat insid","useful":2,"cool":0},"HS5cMtT_ATrj92IEPg6KHg":{"text":"Easily one of the best crab cakes I've ever eaten in my life. Love this place for several ","useful":0,"cool":1},"5BEw0DoPeN_4-HzP_rbVYA":{"text":"3 stars for the service which is friendly an on point. -2 stars because the food is just o","useful":3,"cool":0},"rj92IoOd4hH_MzgFVToIqw":{"text":"The best BBQ shrimp and grits that's ever touched my tongue. The raw oysters were great al","useful":0,"cool":0},"LTACkKOKllGfWcmv810tHA":{"text":"Went on a Sunday night, 6:30. Decor is nice but nothing special. Dining room is very noisy","useful":5,"cool":0},"q9vUTxM3wF9G8KHOaT6SSw":{"text":"Three Stars applied because I like dining on the waterfront with the honey and the boiled ","useful":1,"cool":0},"eH62E-gYdzqOqaTHb-V3Ow":{"text":"I've been here a few times... their pasta is mediocre. Recently, I went wanting a small am","useful":0,"cool":0},"Jvx3jxXrsv_4hXPIChi2rw":{"text":"I dined here on 12/23/16 for my birthday dinner. I made a reservation for a party of 15 ea","useful":0,"cool":0},"TXq4TUpFk4fh1kK8y3FWEg":{"text":"Beautiful presentation but the food was cold and not worth the hassle of beheading shrimp ","useful":0,"cool":0},"maLtB8NCt-83kc0zdPAbiw":{"text":"Lovely lakeside dining. The chargrilled oysters were absolutely fantastic. I also had the ","useful":2,"cool":0},"YhQIctlRuNR77I4mCDF2ag":{"text":"This place is pretty bad. We ordered the grilled gulf fish almandine with grilled vegetabl","useful":0,"cool":0},"5QLAXLDXrCeLAY4iH3EopQ":{"text":"While traveling in the area, we were looking for a place to dine. We came upon The Blue Cr","useful":1,"cool":1},"POxRKRcpVDlx9fwwW45__Q":{"text":"Went to have dinner last night and all I can say is the food was excellent! Not too busy a","useful":0,"cool":1},"6TSfVC-d9O7h78ikac5qew":{"text":"Best outside seating in the city especially in the spring and fall. Love it. Food has alwa","useful":0,"cool":0},"hd3p7fmkcRMUZVIpub_PGQ":{"text":"I came here with a friend for brunch on a Sunday morning at 11am.  I ordered 2 egg whites ","useful":3,"cool":4},"Bm46pVF4NZLvR1qYk_TL_w":{"text":"Great crab dip..the seafood platter was on point. Very friendly staff!! Right off the wate","useful":0,"cool":0},"bPC5MPrqLNVy8IvB6ugysw":{"text":"The stars have aligned! Chargrilled oysters, shrimp & crab boil, gumbo and a gorgeous lake","useful":0,"cool":0},"M4QhiN3wFR8SQxahif9EDw":{"text":"Empty tables inside yet forced us to sit outside in the heat. \n\nCan't believe all the tabl","useful":1,"cool":0},"MQut9ets4v4Q0umR0Lxi6A":{"text":"Crab dip was awesome. Don't get the Caesar salad. Gumbo was the worst I've had but good cu","useful":0,"cool":0},"y0YQEPFHHhagNL0ry7aUnQ":{"text":"We are usual customers here and it is always great, however today was horrible. The waitre","useful":2,"cool":0},"ZuGPNvQi9j58WMRZDDosiA":{"text":"We brought friends from out of town and the only thing lacking from the traditional lakefr","useful":3,"cool":0},"niA9YAOHG0m2we5L01oYnw":{"text":"I'd usually refrain from reviewing a place I've only been to once, but my experience seeme","useful":4,"cool":0},"8pVkqQJMV4ZsmWYP0rNpag":{"text":"Very tasty!  We had crab cakes & sautéed  crab claws for apps.  Dinner was gumbo, crab & c","useful":0,"cool":0},"s7tZffGlAoRpXdEOOnrpxA":{"text":"Really nice location. The view is great as well. Upon arrival, the hostess greeted us with","useful":4,"cool":0},"8VHqk0nrhELHFGyXkbcPzw":{"text":"Great food and atmosphere! The service was great! I tried the grilled shrimp, steak, fried","useful":0,"cool":0},"6cMLGWpghN1u-t16x-ri9Q":{"text":"First of all I have to compare Blue Crab to Brisbi's and I have to say I would choose Bris","useful":2,"cool":0},"c7OFwMLWlid02uF7HSz5yg":{"text":"Great food and great service. We went around 6:30 so we were able to catch the sunset whic","useful":0,"cool":0},"8rDqsXK8_r6yDWIDRAvFsg":{"text":"Food always fresh. Great views as well. I had the fried stuffed fish ahhh amazing and ther","useful":1,"cool":1},"sYVxB9W2HOgQbEPJrJo27w":{"text":"Char grilled oyster is really good. The blue crab dip is excellent. They don't split check","useful":0,"cool":0},"0-ACBxpdtALaT8-vEHx0Xw":{"text":"Enjoyed our early appetizers and drinks at Blue Crab.  Was an on and off again rainy after","useful":1,"cool":0},"NF0TlnbJ0Ngaen9lyUPyPQ":{"text":"I got the blue seafood platter - fish was cold and very basic fry no real flavor to speak ","useful":1,"cool":0},"IqUtA2Z_jRzuE2WDPVLgyg":{"text":"Took a break from fishing Lake Pontchartrain for lunch and that was a great decision. Had ","useful":0,"cool":0},"xuV8rXjMn4e6cFgmBvDXng":{"text":"The sautéed crab claws were a must order! A great portion and delicious with every bite.","useful":0,"cool":0},"sFCu9QtPmbKeNkMI09Uzjw":{"text":"Excellent food and service. Great onion rings. Very good seafood gumbo, and chicken and an","useful":0,"cool":0},"5kyxgIGOEa4Rv9x4mFVrnQ":{"text":"The view was good on the deck but the food was just okay. Service was just okay - nothing ","useful":0,"cool":0},"_nlrhnUDZlv4uj3RZZETzw":{"text":"Went last Friday evening. Ordered boiled crabs, raw oysters, both of which were good. The ","useful":0,"cool":0},"b4D3RwsEoh_xI-Fy3oUcwA":{"text":"Hard to believe it's so new and as good as it already is. Had the crab and spinach dip app","useful":2,"cool":1},"LNyQ9F_d--ZjTaO84JaEWw":{"text":"Great place to watch sunset, which we missed by about 20\"!  We shared the sautéed crab cla","useful":0,"cool":0},"382IHG4HN2wcxjSaiGkOgw":{"text":"As others before me have mentioned, you're doing yourself a disservice to eat anywhere oth","useful":0,"cool":0},"jvUOLa0ToEDYGoPemsGoIw":{"text":"Guess the cook had a bad night cause he sure didn't make it to work today for lunch! My lu","useful":1,"cool":0},"UU_IKYUtxJ_IsDMBeZX5WA":{"text":"Went in to Blue Crab on the opening night... sat in the bar area with a couple of friends ","useful":8,"cool":2},"TYYg7PXsf-gNEPyZzJ54aQ":{"text":"This is REAL seafood. Boiled crawfish, fresh raw oysters  and a savory crab cake sandwich.","useful":0,"cool":0},"1uAAoffkWdn0__yyQDII_g":{"text":"This one of my friend's favorites so we opted for a beautiful afternoon lunch. \nWe both ha","useful":0,"cool":0},"GEWWou-ZAOQe99f_leh1fQ":{"text":"This is a great place to come when you have a largish group & want good seafood. We have c","useful":0,"cool":0},"L7DYqAFWqJVP4tZwlmQIsQ":{"text":"Took the crew to the Blue Crab last night. Cannot say enough for the restaurant! Excellent","useful":0,"cool":0},"0X4Q0vayLkFzZoLq1AG4Mg":{"text":"18 months later and I'm sticking with my 4 stars. I've been back several times with family","useful":5,"cool":4},"VC_1oQw4KbDXfrv4S2QbOQ":{"text":"Went for my second time last night and tried the Grilled Oysters for an appetizer and the ","useful":0,"cool":0},"kVX_87LvncqVv-Mkr41feA":{"text":"Lakefront dining at its best. Atmosphere and food enhance the \"lakeside\" dining experience","useful":0,"cool":0},"q1RpBFdkDVDVlOuraRiNcg":{"text":"Stopped by on a Friday night around 6:30 and the place was packed. The hostesses were kind","useful":2,"cool":0},"rD64bOD9WtxPSnjYZkEA7w":{"text":"A customer of mine recommended this restaurant and told me to try the shrimp and grits.  O","useful":0,"cool":0},"Y9L5IMAuT-cmPXIuM8Mqfg":{"text":"Arrived around 7:45. After being told they were out of oyster, we ordered boiled shrimp, w","useful":0,"cool":0},"Uk_4S904ogfJT-ZhDDGiTQ":{"text":"I loved this place, great sunset, live band downstairs where we sat. Beers were cold and f","useful":0,"cool":0},"-LuyKRYxcKSfajdmJ7UPPA":{"text":"Great place for lunch with friends. Crab cakes and oyster artichoke soup delicious! Good c","useful":1,"cool":0},"nZ-oqMnt2a_Onqexz_8FHA":{"text":"We wanted boiled crawfish so we decided to go to Blue Crab.  We started with crab cake app","useful":2,"cool":2},"PYluaYNwLrmZYNp23MVkAQ":{"text":"I ate at The Blue Crab while on a business trip to New Orleans.  It was one of the best me","useful":0,"cool":0},"0d9-A91w4u9PQz23GJG53w":{"text":"Good local seafood, the standard New Orleans dishes. Salads, raw oysters, gumbos, and frie","useful":0,"cool":0},"61gkx1pAL93uv5Q4u5imcw":{"text":"Horrible food! Waited over an hour for food and it was cold! Stuffed flounder could have u","useful":0,"cool":0},"P73yFc4L1xDlyIrpgFsqQw":{"text":"Hung out at the bar area for a few drinks and snacks for date night. Great view of the mar","useful":0,"cool":0},"I8AfiXR_GU2jQHbdfV5xaQ":{"text":"Visiting from Houston on business I had a day off to explore Metairie and the lake front. ","useful":0,"cool":0},"DsPwzpbBNfa1gKKHM819Og":{"text":"The Blue Crab is just right.  The breeze was nice, the view was better and the food was ev","useful":1,"cool":0},"RINWESsC4aoIUSyD43V3Kg":{"text":"Delish! Our party had BBQ shrimp, onions rings, crab cakes, corn chowder, catfish po'boy, ","useful":0,"cool":0},"GYP1ggnNJA-Ixv06KFt0Pw":{"text":"everything was hot & fresh!!! the wait was pretty long but it was graduation season when w","useful":0,"cool":0},"vFM5Cmvopcw46CNQ98iIRg":{"text":"Been here several time and it's always good. Made a meal of just appetizer (BBQ Shrimp), b","useful":0,"cool":0},"EXwhmB9VnWOCwJ-5KuhunQ":{"text":"We had a party of 5 (4 adults with 1 toddler). We ordered 1 shrimp platter, 1 combination ","useful":0,"cool":0},"zLT7-k6kXSMfKeIwcr4aJQ":{"text":"My wife likes shrimp and grits. It was a must find when coming to New Orleans.  Her people","useful":0,"cool":0},"WarOgXuAXdUUmXcu7qUsNw":{"text":"We really enjoy this place.  Service and food are consistently good.  A favorite spot for ","useful":0,"cool":0},"TkcIdjAU-2jjd5zUZZvwzw":{"text":"Very rude staff. Even the manager was unaccommodating. Food is overpriced for low quality.","useful":1,"cool":0},"3VWCo-vNyKrd6sHZSAHADg":{"text":"Wow\n100 degree sweltering heat, no fans, $150 meal\nWon't allow bar patio door cracked open","useful":0,"cool":0},"6BKihGXIO1rXo6rsfW1w9g":{"text":"Would not recommend. Blackened red fish which should have clearly been crispy and black wa","useful":0,"cool":0},"Pp70OGcEmXEUESYu2lnRvA":{"text":"Came here with husband and teenaged son.  Tried to make a reservation over the phone to ge","useful":2,"cool":0},"mS_J5peaCv5sVZBds9vz5w":{"text":"So went last week with some in town visitors.  Great Service, attentive, helpful well spok","useful":0,"cool":0},"DkH6jrUmHYMY61N_hlyiWg":{"text":"Only hung out at the bar downstairs but it was a great time with a great view. We just mis","useful":0,"cool":0},"7W9I-C7I1wdLhyoZcr-8Fw":{"text":"Sat outside on back deck. Waitress was very good and helpful. Chargrilled oysters are diff","useful":0,"cool":0},"M37Zkmsf4DVPll6s_SG-Fw":{"text":"All of the patios on the lake are so jealous of this patio. It's got the best view and pro","useful":16,"cool":13},"xj53C2vapcs_YAQbHSVbqQ":{"text":"What a disappointment!  I so looked forward to having a delicious seafood dinner at this n","useful":4,"cool":0},"6Akgrc_LGBBLfDzuzOLAYg":{"text":"Happy Hour oysters with a view. That's what got me interested.\n\nService is incredible. Our","useful":0,"cool":0},"sxrs_pEvepgN5h4pR4vBAg":{"text":"I want to start by saying that the location for The Blue Crab is golden. It's right on the","useful":7,"cool":1},"bA3IBJikHlmvXcS7oahj0g":{"text":"Can't beat the view, especially at sunset. Disappointed they do not serve Pimm's. The BBQ ","useful":2,"cool":0},"apbCWmrQaLhA3sfeRkmI0Q":{"text":"The blue crab dip appetizer was wonderful!  The service and atmosphere were good. The food","useful":0,"cool":0},"BZ5j-U-H5D-OBH_tiDaJuA":{"text":"We sat on the patio, nice scenary.  Food was ok, couldve been better if the experience was","useful":0,"cool":0},"czI3hHyJF0pQqrjrWzXxQw":{"text":"We sat upstairs and outside for dinner and listened to the live band below. The ambiance o","useful":0,"cool":0},"-7goiOpK7X3kPj4ulpYPZQ":{"text":"Beware!!  Warning!!    If you don't want to be robbed make sure you ask in advance how muc","useful":1,"cool":0},"Qb4XfqSUJuQy1VeEJ_gdnw":{"text":"We checked out this place for a late Saturday lunch and I was underwhelmed.\n\nView: Spectac","useful":9,"cool":0},"410J5uYgmgEIhs1PfFgFoA":{"text":"I love the views and their stuffed flounder is great, but I find the rest of the menu flat","useful":1,"cool":0},"74Pm4Cwv3-oo9gYwhcYB4A":{"text":"Great menu and good service! But please!!!! Get some toothpicks for your customers! Thank ","useful":1,"cool":0},"BJXmSs-Lri95KdSRQ4Dj8A":{"text":"Our second visit to New Orleans and we had to--absolutely-!-eat at the Blue Crab. Never di","useful":0,"cool":0},"IaZmsgFuhf2SUbUOpud3sw":{"text":"Ambiance outside at night... Lovely!! Food and service... OMG!!! I have had better seafood","useful":6,"cool":2},"UJfoEoPTJ-0ic3EMLD9JQg":{"text":"We loved EVERYTHING about this place!! The food was delicious, drinks were great, and the ","useful":1,"cool":0},"88dap8ckws29KQFLLWyztw":{"text":"My wife and I ate here today, and I had the boiled crawfish with potatoes and corn. The fo","useful":0,"cool":0},"t4JP6y78YSivuAQCWSeraA":{"text":"This used to be my favorite salad/app place but I just left and I won't be back. They have","useful":1,"cool":0},"c1Q0sihmgmaFmh7Qr9C2Ew":{"text":"This is my favorite seafood restaurant in the area. Yes, it is pricey, but the portions ar","useful":2,"cool":1},"cTcJzT2GeSxIf-3dhIyu3Q":{"text":"After hearing radio ads, we wanted to take the Grandmas here for Mother's Day.  We always ","useful":0,"cool":0},"DTajgYeJsQONM-_HYMPFKw":{"text":"As an out of towner my husband and I really enjoyed this place.  Never had blue crab other","useful":0,"cool":0},"ExdjeOFkIz6uZ0Tqc2SWxg":{"text":"It wasn't terrible. Me and my fiancé went for the first time tonight because we had a gift","useful":0,"cool":0},"RKh0haQyYEYKCSLwfSH2Ig":{"text":"Service was slow and without adequate explanation beyond \"kitchen was busy\". The 2 stars a","useful":1,"cool":0},"wXJCmTY3VzS3WRH9pZc_6g":{"text":"A conditional 4. More like 4.5... we came for one reason and one reason only, the boiled c","useful":0,"cool":0},"8K6T4gWs2d9nA4zWwYEp-Q":{"text":"So unfortunately I preferred the spot next door to Blue Crab and here's why: they are so o","useful":3,"cool":1},"OpAXtGwECLq312W9yj3zgQ":{"text":"Anyone that knows me...or reads my reviews, knows that I'm a sucker for a great happy hour","useful":13,"cool":9},"oG-fDL3PhsJ6fyp_YndbpQ":{"text":"Good boiled seafood.  The bar downstairs was a little slow....but great New Orleans food!","useful":0,"cool":0},"4Xf23wetPl7C4zB8WQOKbw":{"text":"Very touristy. The view of the marina was great. When it comes to food there are other loc","useful":0,"cool":0},"KdqmJd9z2XZpmy1LpXD4CQ":{"text":"I'm usually a little weary of waterfront restaurants (I think a lot places get by on locat","useful":1,"cool":0},"Y0xgeA189P5bhPFJM_VsAA":{"text":"Great view, great food, great music! Outdoor seating was perfect! The BBQ shrimp and chees","useful":0,"cool":0},"N2obShApHILuN5-weOQBOA":{"text":"Really delicious seafood! Fast too! Only downfall is it was kinda pricey... The view is re","useful":1,"cool":0},"w18MjjPOzps_qpsXrOkVrw":{"text":"Delicious, I was in town wanting my seafood fix. I sat downstairs, beautiful deck overlook","useful":1,"cool":0},"Uwa3-xZzNiFzE7gVT4tlog":{"text":"Alright. This place did not have good food. Its needs more flavor. The people were very ni","useful":0,"cool":0},"emjhwsbE5wz7h2j-Kddhvw":{"text":"Excellent service and food!!! We will be back. We sat on patio with a breeze and enjoyed t","useful":2,"cool":1},"vfO6qpcs3E6KzccYBo9T7Q":{"text":"The blue crab stuffed oyster, off the app menu,  was the best thing our table ordered.  wo","useful":0,"cool":0},"L74RoLvXNdj_tGw2eGYVFA":{"text":"We were in town for the Fried Chicken Fest and ate here a few days later for an early dinn","useful":0,"cool":0},"SMmWZVD4RMr4EVmhiyqQfQ":{"text":"Don't leave NOLA before trying this place out the food is beyond fresh & flavorful!! Some ","useful":0,"cool":0},"EZmJloEFmhnrd7aEwdGbdg":{"text":"Awesome.  Orderded the Basin shrimp & grits and added a soft shell crab to the top.  It wa","useful":6,"cool":0},"IYxDb7z0kHqjUSZQ65V9TQ":{"text":"The view from here is so beautiful. The New Orleans Saints owner has his yacht here and wh","useful":0,"cool":0},"KGEKb3cPF1xtQKAJzoy-qQ":{"text":"Went here during happy hour and was throughly satisfied with both the food and the service","useful":1,"cool":1},"lL38tD6n2uLIjmFXC3qdyg":{"text":"Took some friends here for their first crawfish boil.  Made them believers as they sat on ","useful":0,"cool":0},"9SbfNOgG_9YVdur0YTufGA":{"text":"We had TEN people with us and they couldn't even give good service. Order was misread, hal","useful":0,"cool":0},"Jlh0yhyDv5Vmt-I1upi0sA":{"text":"I wish there was a 3.5 rating as this review would be closer to a four and not so much a f","useful":0,"cool":0},"Au7d-uwzxJEdALyLLmOowg":{"text":"Gumbo was watery and not hot\nWaited 30 minutes for the gumbo which had only 3 shrimp.   Th","useful":2,"cool":0},"fkNB7J7x48-WwN7ma698Lg":{"text":"Had a great time. The crawfish was delicious we will be eating here again when visiting","useful":0,"cool":0},"Jthzj9jpQ9_JfcSosL7jIw":{"text":"Packed place. Too many tables, too loud, good for a late lunch. Not romantic, don't be foo","useful":1,"cool":0},"DVX_rSlG2Dw7y_x75MEGJQ":{"text":"Since the West End seafood restaurant scene of my childhood never returned after Hurricane","useful":1,"cool":0},"OrXZzreLgrYJOMZmvLeMkA":{"text":"We ate here tonight and it was amazing. My family loves to eat seafood when they come in f","useful":3,"cool":3},"gKYpfkSsb8h4dAsyFBNgtg":{"text":"I have visited the Blue Crab restaurant on many occasions and brought out-of- town guests ","useful":0,"cool":0},"QemnAvNAgfesN2ZjQYN1nA":{"text":"Overall, good experience for the situation.\n\nThree of us went to eat on a Saturday night a","useful":0,"cool":0},"dphTvKc7yQLUfvGMjFmy8g":{"text":"The ambiance of the outdoor deck and view of the lake is reason enough to come here. I fou","useful":1,"cool":0},"3cHtfx_Jz9B-FPbc7xziaQ":{"text":"Great service, awesome food!  Our first visit but not our last. Very nice way to spend New","useful":0,"cool":0},"n2-Jk6ncv06q19osWAfc7A":{"text":"Live music nice view of the lake especially if you get to see the sun setting \nThe food Yu","useful":0,"cool":0},"sp6K2_3p8ySR0wpntC3V_Q":{"text":"Before I begin, I want to note that I believe in complimenting great service and outstandi","useful":0,"cool":0},"GPzb-mJzMZaJMTwb736rhw":{"text":"A wonderful recommendation from a friend. Good service nice watching the sail boats coming","useful":1,"cool":0},"stwbru63zyRWPJDmYc07kQ":{"text":"Wonderful location on the lake, with fresh fish and seafood.  I especially like the crab c","useful":0,"cool":0},"zXQn4_wmJ83na06LGULW4Q":{"text":"The outside seating gives this place a 5, the food a 3, hence the average of 4 stars. High","useful":1,"cool":0},"G5V8GpYDZ7dZjaR7ReNmwA":{"text":"Came per recommendation from a friend... waiter (he) came by was friendly and mentioned th","useful":0,"cool":0},"c6L-FtwO8QpnoW5-y9e33g":{"text":"Gosh awful wait,  small seating area without outside open.  Hostess very unrealistic  with","useful":0,"cool":0},"9plLV1TSUP_wENIvjI6bKA":{"text":"Nick the Owner and Katie our Server welcomed us with open arms and the food was fantastic!","useful":0,"cool":0},"GrIsvLc3Is9qJh_k-i1KQQ":{"text":"Decent seafood and drinks, but a bit overpriced. $28 for a soft shell crab poboy!!","useful":0,"cool":0},"A4KzXcoSlO1YICCyu2w4Eg":{"text":"Hands down this place has the best oysters in the city of New Orleans and they even have t","useful":0,"cool":0},"RC7SquejfOibaglo6r7fOw":{"text":"The food was OUTSTANDING as was the service. Chris was our sever and besides being very kn","useful":0,"cool":0},"B2SbwWIx7pfgAVJN0yTMcg":{"text":"Service was extra ordinary. Can't remember the sever's name but the blonde haired blue eye","useful":0,"cool":0},"pVuIhk1njGmjs0sasC43mg":{"text":"Good food at a reasonable price.  Sat outside this eve (by choice) and I thought we were g","useful":0,"cool":0},"ZzVgFoIr0mg_PyaT4B1_IQ":{"text":"This is one of our favorite places.  I always get the Wedge salad. It is truly one of the ","useful":2,"cool":0},"o8IDl1TR0I9zoLCBdx4aUw":{"text":"Great recommendation by our LFT Driver....Silver was the best, her hospitality, welcoming ","useful":0,"cool":0},"pb2PTwdGOQFOWRldO-aBjg":{"text":"Well this 5 star rating is for ambience & atmosphere. Food is a 3.5 at best. Lovely, livel","useful":0,"cool":0},"Opm1VfNuQylGpS-Katf0Qg":{"text":"Great location and atmosphere!  So many choices for good seafood in NOLA and although I ca","useful":0,"cool":0},"8TbEh-Wb_aYIshIjv0ycLg":{"text":"I'm going to be nice and just say, stick with Deanies if you're in this area!   The sunset","useful":2,"cool":0},"ft7WM0X0iPsS3E0YRGG2Sg":{"text":"bland , and boring . this place was one of the worst places i ate in nola . the crawfish w","useful":0,"cool":0},"_qbzDRq520Js64SLa3Nucg":{"text":"Exceptional, great and friendly staff. I personally had crawfish, and it was a great level","useful":0,"cool":0},"KFGnk4-djNCIQgBJkqWamA":{"text":"This place has great seafood. I had the fried oyster and grilled shrimp combo and it was w","useful":2,"cool":1},"U7TLrRjxmaovIv9FuII3hw":{"text":"We had lunch at the Blue Crab on Sunday. the weather was perfect so we sat on the back dec","useful":3,"cool":0},"21QfORJWWELmZAO1KIxdVA":{"text":"We came here to be close to the lake. The food was a pleasant treat!  My wife & I had the ","useful":0,"cool":0},"rNRFnSHDbbAU3-6V07KcNQ":{"text":"Went here for a birthday celebration when Deanie's was packed. Yelp had good reviews, whic","useful":0,"cool":0},"9R6iByLY7gDR3HWkQPXZDw":{"text":"What a waste of money. We brought a group of 9 here, expecting great seafood considering t","useful":0,"cool":0},"DTAuWbpmsWCmRBKV9Q_tmQ":{"text":"This is my second time going and it was good. Bbq shrimp are really good. I had the stuffe","useful":0,"cool":0},"XhBNMaDxun-JI53Gj85g8g":{"text":"It is in a convenient and easy-to-reach location (although, parking is tight), and everyth","useful":1,"cool":0},"WdrLhf_JInnl0fsy0LBvvQ":{"text":"NOT highly recommended. Location is great. Oysters were not good at all. My main problem w","useful":2,"cool":0},"VcnxicomAflJPLRWN-Tt8A":{"text":"I would not recommend this place to anyone.  I had the worst experience and the owner did ","useful":1,"cool":0},"HMKuXlflUyY2LfS_FLaUow":{"text":"I LOVE the food at the Blue Crab. My family and I have tried most things on the menu and h","useful":0,"cool":0},"iaSAalfWEW1gBrY46ffxjA":{"text":"I went there for lunch and have to say there are much, much better restaurants in New Orle","useful":2,"cool":0},"DU_jrjXPvq--n-vZ0g3vQw":{"text":"I hesitate to even give this place two stars.  The place did seem relatively clean, so tha","useful":0,"cool":0},"7r6tQ75pANQLSqTOkCqX4g":{"text":"Blue crab dip was really good. Main course was excellent and the service was good. Very mu","useful":0,"cool":0},"j6QpXKbwY-ZMgtje75Az-g":{"text":"pretty standard menu for seafood.  \nhowever the food is above just standard.   I had the s","useful":1,"cool":0},"sUEEnLd9XniZw2THj-9M7g":{"text":"Just arrived to New Orleans from Indy!  Had to stop and drink away the pain of an 11 hour ","useful":1,"cool":0},"HHFHrWMpnZEDBXX1VbcVYw":{"text":"Solid food, nice views. I could imagine the views are spectacular at sunset.","useful":0,"cool":0},"gOHxWiGGXSZSaO47VQQq6g":{"text":"I am giving 2 stars. The waitress was great, very attentive and professional. It took abou","useful":0,"cool":0},"UrwyG0rqnsv-dyIp6UyXpA":{"text":"A very nice Saturday lunch choice! Sat on the upper balcony porch for Saturday lunch. Serv","useful":1,"cool":0},"0eAJOlpqMfIBAah-zDn1ig":{"text":"\" Happy Hour Food Was Good \"\n\nWe stopped by the Blue Crab Restaurant & Oyster Bar to enjoy","useful":2,"cool":0},"I_QqbWwcAKnqvWrH5EZZlw":{"text":"Atmosphere (view) is the highlight of this restaurant. Couldn't ask for a better spot. The","useful":1,"cool":0},"PgnmD2rY4JNnhA1-WLy1cw":{"text":"I brought guests from out of town. After we were seated and ordered, WE WAITED OVER AN HOU","useful":0,"cool":0},"gGCz1NRhGMleprndNzBHRQ":{"text":"I must say, the Blue Crab has always been one of my favorite spots to come spend a weekend","useful":0,"cool":0},"MlHT_3TuBCEo7AZogb-WeQ":{"text":"I have only eaten at the blue crab once...it was terrible. The food was barely edible and ","useful":2,"cool":0},"hJiLTSMn7yTRe-56XZteaw":{"text":"Excellent food and friendly staff. Very much enjoyed sitting by the windows looking at the","useful":0,"cool":0},"VJJUf12zOE2Z-x4R61yE9A":{"text":"This is exactly the kind of place New Orleans needed. We used to have so many seafood join","useful":8,"cool":3},"k8GX53sx3WzofSbGLjtWeQ":{"text":"Pleasantly surprised with how well I enjoyed my visit after coming here. The atmosphere wa","useful":4,"cool":2},"YK8Fu7rvzPQAjN67h-Vpfg":{"text":"Staffs are super friendly. Very clean place! I like how they have a sink in the dinning ro","useful":1,"cool":1},"PT2lgxK-OPdRxZeGd8Txng":{"text":"Our first visit. The location definitely pops out at you and demands you stop and see what","useful":5,"cool":1},"LGuKR2YFZA8u8BtDtV6IxQ":{"text":"Went with our kids and we were pleasantly surprised. Our food was great, place was pleasan","useful":0,"cool":0},"zeQoJuHlnTO1xDBSIMChNA":{"text":"I've been here before.  The atmosphere is great.  It is right on the lake with tons of vis","useful":1,"cool":0},"Ysc8LPWlmDF_iBml6uvxVA":{"text":"This place is really poor.  It is the noisiest restaurant I've ever eaten in.  Concrete fl","useful":3,"cool":0},"jg8ngnvYAfo0_K3MflbQqQ":{"text":"I was able to enjoy one dinner, here, and I emphasize \"enjoy.\"  Service was friendly, desp","useful":1,"cool":1},"n1OIzWOU7Dg6Hej-pvqI7g":{"text":"Was taken here for an interview dinner. Pleasant location down by the lake near the Marina","useful":1,"cool":0},"Gj9TAHtMYk9zGKJXSYDr3A":{"text":"The shrimp and grits were excellent.  The large shrimps were delicious.  The grits were pr","useful":0,"cool":0},"61oR5JMDbJTbAqbhXbo8fQ":{"text":"My honest rate for this restaurant is a 3 1/2, but, of course, Yelp does a fantastic job o","useful":0,"cool":0},"aNln3hr_ZH7yHy6JhnphJw":{"text":"UPDATE:  September 15, 2016\n\nI am very happy to report that our return to the Blue Crab wa","useful":2,"cool":1},"0qYDBdWzg1rUXrL1UjJraA":{"text":"Usually a decent meal and experience.  Placed order and waited 50 minutes then waitress sa","useful":1,"cool":1},"Xi3SUhy4Bv4luSXsh3kImw":{"text":"Super cute place on the lake. Amazing fish tacos! Live music really added so much energy t","useful":0,"cool":0},"smDrdjtsaWG1J-vJ2TH9zA":{"text":"Boy are we sad.  So excited to have a new restaurant on the Lake front.  So disappointed t","useful":3,"cool":0},"20qZiT1PXpj2s2P4N-x5pQ":{"text":"I've been here a few times, usually for happy hour. It is my go to place on the lakefront.","useful":0,"cool":0},"s6Ey5cqAZcC3nQklkGhFqg":{"text":"Ordered our usual Onion Rings as a snack while we waited on the entrees. Excellent as alwa","useful":0,"cool":0},"kXBjpAjVdanJkg5RD0xtJw":{"text":"So, I came here on two different days. The first time with my bf I ordered the chargrilled","useful":0,"cool":0},"rLRdEN9hGTTm-t5A8ffd5w":{"text":"Great food & atmosphere! A little expensive, but that's very normal for seafood & for lake","useful":0,"cool":0},"E1HXdkJk_WYnjrl2Tin9Pw":{"text":"I felt like I wasn't even in the city when I was here. We dined outside on the deck overlo","useful":2,"cool":2},"TQdaWACRxmTSB0L28pxx1g":{"text":"Went there for happy hour.  Had a dozen char-grilled and raw oysters.  Sat by the shuckers","useful":0,"cool":0},"iGml52mfO-OP6hg3bc3N5Q":{"text":"The atmosphere is great. They have a downstairs bar area and an upstairs patio that overlo","useful":0,"cool":0},"t5I22tBoVx1llihK_zojDA":{"text":"The average age of the staff is 21 and although they hustle, they are very rough around th","useful":0,"cool":0},"wZ9ftKyNIvZ_RZcu-s-_uw":{"text":"Great place. Had the crab cake sandwich and crab corn bisque. Delish!! Hubby had blue crab","useful":0,"cool":0},"5cUZ3V9wyEKihs4irDNaGw":{"text":"Awesome view and atmosphere...The crab cakes are a must. My wife and I split the Blue Crab","useful":0,"cool":0},"hPHAa31xNuR9DHJCYcP9qg":{"text":"Came here for happy hour before some dinner reservations. We had a large group of people o","useful":2,"cool":0},"gfqZHWwDiF9R059vZta3oA":{"text":"Kristian the waitress made our visit amazing. She's so sweet. She made the food feel like ","useful":0,"cool":0},"uRYfuLF32OhMjvUiAe7WWA":{"text":"Had the boiled shrimp which was really good didn't expect it to be so big and even one lb ","useful":0,"cool":0},"UKCoYXPl8fTF4gxiua8Wfg":{"text":"The last few times we have been here, for lunch and dinner, the experience was very disapp","useful":2,"cool":0},"D73G96cgFoVH0Toj2oujfQ":{"text":"The place isn't really a restaurant but more of a seafood diner, which isn't really a bad ","useful":0,"cool":0},"AyOCRMRI94xJFihIb8pMIw":{"text":"Had a good meal. Blue Crab is what New Orleans natives have come to expect for a seafood r","useful":3,"cool":1},"Yejd_pyTWRAj9SqvaLCK3A":{"text":"Lunch Special. Stuffed Bell pepper with ground meat and Shrimp. Awesome I even got one to ","useful":0,"cool":0},"zVz1RktYLtFcwJW-XvRl8g":{"text":"Love love the oysters....great happy hour. Just had cocktails and apps but they rocked!  S","useful":0,"cool":0},"AK1XudGHchgILhYJRKdwkA":{"text":"Wow! This may have been the best meal I have ever had. I had the shrimp & Grits; also, I a","useful":0,"cool":0},"y0FSUqBqFm3sJz5EVBgiUw":{"text":"It was okay. We sat outside but the wind knocked over a couple of drinks, so we moved insi","useful":2,"cool":1},"49UlIuCX5ftLD6VdIxgiPA":{"text":"Going back and forth between 3 and 4 stars. \n\nThe location is great. One of the only place","useful":0,"cool":0},"lWFkiDYvYUs9_7bWTUrYDA":{"text":"Terrific food, location and atmosphere. Brought 3 rowdy kids and the staff and patrons did","useful":3,"cool":1},"g7hxGRTS-0ftgcFQPydIwA":{"text":"Came in on a Saturday night around 8:30 for my mother's birthday dinner. We were a party o","useful":0,"cool":0},"EAXV8lRwW4R3r9BMSIegZg":{"text":"Crab claws- very delicious but quite salty 4 out of 5\nSeafood gumbo - watery no oysters or","useful":1,"cool":0},"lUgNErkfiYWNfzePKzfqcg":{"text":"Nice place over looking the water but overpriced for the food quality. Service was good an","useful":1,"cool":0},"WJFxf8qTQ7xG0Eqryt-0uw":{"text":"The atmosphere here is great, but the service is very slow. It took us an hour to get our ","useful":1,"cool":0},"PdRIpLg4eCW4ah0pvnu-YQ":{"text":"This place is so noisy it gave me a headache! Food is pretty good. Crab corn bisque was on","useful":0,"cool":0},"EyxfcI6DmElQtHDfpVUnFw":{"text":"This was my first time hosting a LSU Dental mixer at Blue Crab. It was such a great experi","useful":1,"cool":2},"wBaQA2C3-ZbGePEyn-YLQQ":{"text":"WOW!  Stopped in for breakfast this morning and was completely satisfied. Talk about a hid","useful":1,"cool":1},"7BUR0opA95lRcb3ebEOBEw":{"text":"Less than ok. Very bland and overpriced. I have gotten better food at Cajuns or the corner","useful":0,"cool":0},"57kV1jHoBaBs4IxcUUIcZg":{"text":"Oyster's were great, love the location. Service could have been a little better. Waiter se","useful":1,"cool":0},"F4scMBai8PcaaTM6PmbYVA":{"text":"I went there for the $1 oysters thinking they'd taste like Acme or Don's Seafood at least.","useful":1,"cool":1},"nFpP7OQQkBWgeeL0EpHRRw":{"text":"I came here and had a little bit of everything with a friend of mine. We split the BBQ shr","useful":1,"cool":0},"V1pqmF5HtrxRGTM_Y2V6TQ":{"text":"I'm hoping today's lunch was just a fluke. Every time I've visited New Orleans I usually t","useful":0,"cool":0},"QABpyW8jS5emgWg6xvxMlg":{"text":"What a disappointment. With such a great location and the promise of local seafood, I thou","useful":0,"cool":1},"Q7i-utEkyphIT2E_qPVtsw":{"text":"Great restaurant! Went on a Friday night about 4pm during their happy hour. Drink specials","useful":0,"cool":0},"r77toOtjsPukrTeg0fw79w":{"text":"Aside from them forgetting to put our appetizer order in, it was really great food. We had","useful":0,"cool":0},"wXWWWXyN0ETjFfksXAqanQ":{"text":"We had a combination of boiled crabs & shrimp, red beans, crab cakes, gumbo & soup. Everyt","useful":3,"cool":1},"L7b0hO-A-xUbIKt6f1SqCQ":{"text":"Food is great atmosphere is good. The bartender couldn't make a LIT but that's ok. I didn'","useful":0,"cool":0},"c096h4j2HNrEBzUEPQ6YTQ":{"text":"Great spot for an oyster happy hour. 75 cents raw oysters on the half-shell and $1.00 char","useful":2,"cool":1},"_a-E8zD3kSPphaqHZMOv9g":{"text":"What a wonderful Saturday lunch! Went with some girlfriends and had a great experience. Th","useful":0,"cool":0},"mCv3TqQkU3-sxb3wJmfxZA":{"text":"When you go to a restaurant with the word crap in it you except to eat crab. Well that was","useful":0,"cool":0},"eXAakAqug7-ird0E2uvQjA":{"text":"Let's just say this place has went down. I was in town with some friends and I thought the","useful":0,"cool":0},"kqM5lKvweaPcQF2vym1BmA":{"text":"Me n 2 friends went here on sunday.. First we went to sit outside and the waiter walked up","useful":0,"cool":0},"XswZRdk12ExnH_paBOEVBw":{"text":"I was not impressed. I had the stuffed flounder and for the price I was expecting somethin","useful":0,"cool":0},"18k_2sSayTMVBodI_nFQsw":{"text":"Came here last year in December and I'm so glad I've stumbled across this place. The Blue ","useful":0,"cool":0},"S4yWy4ewuNjMdry2NEqdFA":{"text":"Wedge salad is by far the best I've ever had. Blue crab pasta was really good too- my wife","useful":1,"cool":0},"LTeCCG3qnxAur-NEk1o-Gw":{"text":"We had a great meal here with friends. My husband and I both had oyster dishes and they we","useful":0,"cool":0},"z3k1U-njbe8nRfyPDLWm3g":{"text":"Great oysters very salty and fresh. The outdoor seating downstairs is a nice touch but the","useful":0,"cool":0},"_QZMndcv_dICeFyzOmeWNA":{"text":"If you want to see a beautiful sunset over the lake while having a drink, this is the plac","useful":0,"cool":0},"2ZG6MKx8FAB5uMeK6DSIUw":{"text":"Great food! We had crab cakes, blue crab dip, crab & corn bisque, and blue crab pasta. Nee","useful":0,"cool":0},"QHh6IMPWRz9KocS5tzCDfg":{"text":"We had a friendly waitress.  Good variety on menu. Crab dip was very good. Crab cake sandw","useful":0,"cool":0},"8qvdYCuANdoopNTc1soP2w":{"text":"Good food, good view, great service by Katie! \nThe only reason it's not 5 stars is... No h","useful":0,"cool":0},"Ii-lf_qZ-QVMkD8PztTfRg":{"text":"I've eaten at The Blue Crab many times and the food is always great. However, the service ","useful":0,"cool":0},"JUHwhApMdpOVXCvLB8B_HQ":{"text":"Great place to get fried seafood. Everything tastes very fresh and well made. Went for Mot","useful":0,"cool":0},"fu1t6pDoqjqBW4E6BBKSUA":{"text":"My first time here and the crab soup is off the chain!!! The charboiled oysters arent the ","useful":0,"cool":0},"D9gUfCHxveOUy-c6ZBLUrQ":{"text":"Everything we had was very good except their \"famed\" cheese biscuit.  It was hard and dens","useful":0,"cool":0},"ELPqjYb6uxA-FKE2kcJt8A":{"text":"Good food, good service staff. The food delivery was pretty slow . Server even said this h","useful":3,"cool":1},"D32dL_6dFO1R9LB2DeTwWw":{"text":"Seriously the best margaritas served by smiling faces!!!\nThe atmosphere is so relaxed!\nI f","useful":0,"cool":0},"wrp9PRxRqSHUv8CguPvyNA":{"text":"Two words: slow service. \n\nCalled ahead of time to book a reservation for 6. Told me it wa","useful":0,"cool":0},"d1EyZXHmeTQFNs1Q7J7XBg":{"text":"My second time there recently. The service was awesome.  The atmosphere is great! The food","useful":0,"cool":0},"H6bbUBtC_O3G8VigeokGow":{"text":"*This review is for the marina bar only*\n\nOn July 4 we decided to scout out some places al","useful":15,"cool":13},"XM2CM2eksUN1J8GRCUYeag":{"text":"We came here for lunch on Mardi Gras day and were surprised to see that they were actually","useful":1,"cool":2},"3UqX6XmFo8GCmveLbMUM7w":{"text":"The service from Palo was amazing. He was energetic and I could tell he loved his job. My ","useful":2,"cool":1},"EiEDk7an_umhx5yFxCF17Q":{"text":"Had a lunch date with the bestie. After much contemplation, decided on crab dip with our p","useful":0,"cool":0},"z6k_khCyh0PjQ82MsCuhcQ":{"text":"Maybe the kitchen was just having \"one of those nights\". The server was pleasant enough bu","useful":0,"cool":0},"fxPYV44eOwl2JulESfmTgw":{"text":"This is my husband and I's favorite seafood spot in Louisiana. Its not just the food, it's","useful":0,"cool":0},"_aXb0us0UHt5gWLRnA-dzw":{"text":"This is the second time to come here. The weather was nice enough to sit out on the deck. ","useful":2,"cool":0},"JI_08YoFnFc8PkH_4m5heg":{"text":"The location is nice.  I like that you can eat inside or outside.  We did eat on the outsi","useful":1,"cool":0},"jpZywhMZyrBY49DMqKOuWA":{"text":"The blue cfab dip was pretty tasty. The grilled shrimp were huge and delicious. Happy hour","useful":0,"cool":1},"PjNcND04XW64AQW08z5jTw":{"text":"Went during happy hour with my mother on a Friday. We wanted to order drinks but the waite","useful":0,"cool":0},"bKVluWkY_YWvm5bUH8ktaQ":{"text":"This restaurant was great. Loved the crab cakes appetizer, they were awesome. My husband h","useful":1,"cool":0},"mSrcv-9u4APPv0PeAlQgDA":{"text":"Knew it was a bad sign when we arrive and it looked closed. Sat outside and the view was p","useful":1,"cool":1},"SYskEDd8EmAO4y2sS09izw":{"text":"Came here after Jazz Fest to grab some dinner. \n\nWe called on our way over and still had t","useful":3,"cool":1},"P3MKmj7k3Z_oYRoIF-XyIw":{"text":"Great location on the lake. Food is always excellent. We ate there a few days ago and it d","useful":0,"cool":0},"K688CDVlV2AInIJ5naOr-Q":{"text":"Happy hour seafood and drinks are so good! $0.60 raw oysters/$1 chargrilled oysters and $3","useful":2,"cool":0},"PEpigVsHbj_OTQ7TVpAqUg":{"text":"Had a great lunch at The Blue Crab! Stopped in for some Sunday lunch and got to sit outsid","useful":3,"cool":1},"h_QJUB3aywJqdZrGY-_HPg":{"text":"Like it. Reminds me of a fishing camp. Our server was so rude. From the moment we sat down","useful":0,"cool":0},"jnxn5KGafAoL16yD9VAJYQ":{"text":"Location/Parking: Beautiful location with a large parking lot across the street. There is ","useful":4,"cool":1},"qKki4dX2E0Ad3cW5ePgaXQ":{"text":"Food was OK. Service was horrible. If you plan on going on Sunday for brunch the menu is v","useful":0,"cool":0},"NUTu7YIyX6H88F1hO5Es6Q":{"text":"Currently, my favorite Happy Hour in the West End area of the Lakefront. They offer a grea","useful":6,"cool":4},"BwbPr6_yESMuD8frkxtAbw":{"text":"Very impressed with this establishment. \n\nThis is my 2nd birthday celebration and both wer","useful":5,"cool":3},"sMapEg5xWCxafQzTXNLYIA":{"text":"It was a gorgeous day outside so I was looking for a place to eat by the lake. Their upper","useful":5,"cool":2},"Eo9TWFqDawy-v4zXTWiT2g":{"text":"Been here a few times.  Usually it's great.  Last time we went the shrimp were gamey and t","useful":0,"cool":0},"5J1fKEdA9DiHNFP2iZG11Q":{"text":"My dining experience at The Blue Crab never disappoints! My friends and I dined there earl","useful":0,"cool":0},"r39BNUB7JU2rZN6ULnjBbg":{"text":"Food is good - tasty with all that Cajun fried magic that'll make anyone happy and ready f","useful":0,"cool":0},"wBj_nm0FeGMtBHDtJMe2hw":{"text":"Came here today sat upstairs on the patio. The view was nice and although it was humid out","useful":0,"cool":1},"XdfTAOF_UEePCjGZwxWjgg":{"text":"We chose Blue Crab for our employee Summer party location. Our server was Kelly and she di","useful":2,"cool":1},"97G9s-C05gwuWmzKaVlTwg":{"text":"I'm hoping today's lunch was just a fluke. Every time I've visited New Orleans I usually t","useful":0,"cool":0},"h2pD0nOgd3vKsFcqZ_2qhg":{"text":"We came here for a birthday party downstairs in the open bar area.  But my SO and I wanted","useful":3,"cool":0},"y4_i0f_E04F7JG8KaWqY9g":{"text":"This place does not disappoint every time we visit! Had the best server ever (Nicole) who ","useful":1,"cool":0},"-6ybYTGSO4tP90GHeqmSXQ":{"text":"I want to love this place but I don't. I've been many times with live music and the music ","useful":0,"cool":0},"QcLlUOJVb1Wj3BnBH79R0g":{"text":"Sadly, this used to be one of my favorite restaurants in the city. Not anymore. The food h","useful":0,"cool":0},"o0j2QpMmDK8CyQ_uosAWxQ":{"text":"Ok I really enjoyed the food here. My husband and I were wanting chargrilled oysters and t","useful":0,"cool":0},"Ltpb38-5CIDrh3QQUVLLMA":{"text":"Love The Blue Crab. It's a close bike ride from our house and has a nice view and friendly","useful":2,"cool":0},"pAQt9O4Qvh3Hw-DGg5Hpaw":{"text":"I've been here several times at friends' insistence. Really I don't get it.  The location ","useful":0,"cool":0},"UpfBNt-6qESS4kYMAa1xsw":{"text":"Visited on October 16, 2019, the waiter was the best but the food was served cold, seafood","useful":2,"cool":1},"F_qopfLTXe8Ei3xke1lAsQ":{"text":"I visited for dinner and it was great! Our waitress Cheryl made our experience nice! I lov","useful":0,"cool":0},"_u01WsZp2QdNLDDmTXHWsw":{"text":"After being sat down with hostess, no service or recognition at the table for 20 minutes. ","useful":0,"cool":0},"t-sj4pAuBBe9N41Ozo2OXA":{"text":"The Chargrilled oysters are amazing here and I dont like oysters!!! They are a must. Happy","useful":0,"cool":0},"ks4NY5zmL2ep-KbdyA_dFQ":{"text":"It was my birthday, and I wanted to take my dad out to lunch by Lake Pontchartrain. In the","useful":0,"cool":0},"hWTgKyt6kV86RGFWETURsw":{"text":"Blue crab had some of the best oysters I had while out in New Orleans they were meaty and ","useful":0,"cool":0},"1NJ80EAivRP9602523BVdg":{"text":"Lovely setting, but a question mark of a restaurant.  Three of us ate in.  Good: sauteed c","useful":2,"cool":1},"AE2zmDwEny_sRhCRF4fxVw":{"text":"Service was horrible dinner was good raw oysters were very small didn't have to wait long ","useful":0,"cool":0},"fnlMju-KVbO1xHenGuOy6Q":{"text":"Just opened back up from COVID, so will cut some slack.. food was amazing but service was ","useful":0,"cool":0},"CBUkDynjr8akxIX9WX_1DA":{"text":"This place is fun. It has a nice outdoor patio that overlooks the water and makes you feel","useful":1,"cool":1},"fiktaflQ8gnLBOGGPXHbMw":{"text":"I love the Blue Crab for their happy hour oysters! It's .75 for raw oysters and 1.10 for c","useful":0,"cool":0},"tKpspPyPV4c1fEjQxqrpvA":{"text":"Friday night, kind of crappy rainy weather for the majority of the day, upstairs still had","useful":5,"cool":3},"9bo4RmvMBwRWZzQlV_v6vQ":{"text":"We went out to Louisiana on a job. The customer service was great. The view outside was gr","useful":1,"cool":0},"ZAgRnqtIGo_r7x8pG33eJA":{"text":"The Blue Crab is a great addition to the waterfront dining scene in the city. \n\nLike many ","useful":9,"cool":7},"p4C2j4AcrmkboJKf_0-ZwQ":{"text":"Food was great. Bryan, the server was good. However, the kitchen failed to get our chips a","useful":3,"cool":1},"JJQxN5EOAJKReOng61OTxg":{"text":"First time going. \nGlad we did. Great service,good food. \nIf you like blue cheese you have","useful":0,"cool":0},"eoJRaTY9Pg0vX3sTmIXxYw":{"text":"Today I came just for the music and dancing. There was no charge to dance. Of course if yo","useful":3,"cool":2},"wZcrq-R_evUNDDcqR_dD_g":{"text":"The fish of the day (Mahi Mahi) was really good, I liked it a lot. The Blue Crab Pasta was","useful":0,"cool":0},"-lcS6amerSpVbyP2buAMkQ":{"text":"This was a terrible experience. I paid for a $20 Uber to get some crab because I assumed t","useful":1,"cool":0},"3NeM6bH6JFKPgJHUr0HA1w":{"text":"The food at the blue crab is okay, however the wait list situation is terrible. I called i","useful":2,"cool":1},"spLtRpAR9eQt6MaE1uYLVw":{"text":"Went for lunch on a nice day to sit out on the deck overlooking the marina. That was the b","useful":0,"cool":0},"4nnepyk0Js7EsUXA3R25Vg":{"text":"I must say I was blown away by the customer service at this restaurant. I was dining and h","useful":2,"cool":1},"L3AkqDoEdQ7hkgHGl8c6wg":{"text":"This place is worth coming to just to sit on the balcony and enjoy the view while sipping ","useful":2,"cool":3},"1Y7EbxNAOOl0EsH3cof-Jw":{"text":"Decent food with a water view. Soups like seafood gumbo, and crab with corn were good. Sal","useful":0,"cool":0},"A1nsMv_e91CeRRGt76AZeA":{"text":"DON'T BOTHER JUST DRIVE ON BY!\n\n\n I have eaten here many times and the food is usually goo","useful":4,"cool":0},"olQgm7fFaLEGNnwWjOcfxg":{"text":"Just stopped by for some quick appetizers and vitamin D. Our waiter Ryan was friendly and ","useful":1,"cool":1},"3b4rZXixt2vMSvcNqCp3kg":{"text":"Always great service. This place gets very busy.  I recommend if you go there for dinner t","useful":1,"cool":1},"06MZ-xw76GaFF0rr-07nvA":{"text":"My husband and I came to grab some lunch and weren't impressed.  The service was horrible,","useful":1,"cool":1},"y2dLYuTESdAy-sZRFjPcWQ":{"text":"The service wasn't bad. The chargrilled oysters were delicious, highly recommend. I ordere","useful":0,"cool":0},"WFYgFCin05TRJcQSrxzFPQ":{"text":"Stopped in here for Sunday lunch to hang out on the porch and it was awesome. We got some ","useful":2,"cool":0},"aMxx0q2Xgzms2F7Ek5ZQpQ":{"text":"We went to The Blue Crab  on  a Saturday afternoon. Parking was a nightmare. I think we wa","useful":0,"cool":0},"UTKzOUWHeoudpdM2nqHT4A":{"text":"They do a great job on the weekends with live music and boiled seafood. The bands are grea","useful":0,"cool":0},"sv3ApvFCv9gaU8eTKe10Mw":{"text":"EXPENSIVE!!!  They have fine dining prices.  \nI ordered:\n the grilled mahimahi w/ a side I","useful":2,"cool":0},"X9OV6TACiTVeyH4PBTNyNQ":{"text":"I ordered a half shrimp and catfish plate. It came with three scrawny pieces of catfish. F","useful":10,"cool":4},"FGXAS2xnOJ9C7_DEroTpOA":{"text":"What in the Blue Crab hell?! This is supposed to be a Mimosas. The waitress said it's made","useful":0,"cool":0},"-XCWkBIajBav92xgYzWETw":{"text":"Took my wife here for Mother's Day - first time here for both of us - and it was just plai","useful":1,"cool":0},"CSGb4G7DVTFq6EAe1v_GDA":{"text":"One of my favorite restaurants in the city. I do wish they had better hours and also that ","useful":0,"cool":1},"aJD1PwYgl1WnYG8fNith2A":{"text":"Our family loves the Blue Crab! The balcony is such a great place to spend summer evenings","useful":0,"cool":0},"UDKjUKaaKg3GSJcgixD--g":{"text":"Arrived for lunch on Sunday and had 45 minute wait - weather was divine so we went for a w","useful":0,"cool":0},"IZSi7oeIgIrtWME9-ov9hw":{"text":"Got the trout special grilled. Quite possibly the worst entree I've ever had anywhere whic","useful":0,"cool":0},"p5_14Ox8crXnsp602MoebQ":{"text":"We attempted to go to Landry's which was right next door to no avail (the host staff was n","useful":1,"cool":1},"GkjzVCSZKsxju9OEWwOMRw":{"text":"I jinxed myself with the final line of my last Blue Crab review.  It was not up to snuff t","useful":1,"cool":0},"1VomlE6X_qrY58jRBdaSTg":{"text":"This is my second visit on last night. We got there at 8pm and let me say with an hour bef","useful":0,"cool":0},"S5l99ZkmBxrn3G1EqOwGHQ":{"text":"Drinks are small and weak stuff crabs I order was dry only reason we pick this place was b","useful":0,"cool":0},"XcjY5dR9qDc5_NVqGKEU_A":{"text":"Great location. Nice servers. Food is meh,  we had the captains feast (fried fish, fried c","useful":0,"cool":0},"nr79L9ischdYfLPFV7JKtA":{"text":"You HAVE to try the sauteed crab claws! It is served in this bowl of butter, cheese and ga","useful":2,"cool":0},"kSgQ-55cp48EJYAAUGdDMw":{"text":"Just a quick update: oyster happy hour is back!! We only got the oysters this time as this","useful":0,"cool":0},"UTmT1EWNgitEO99YLivv1g":{"text":"The food was amazing. We had the shrimp and grits (authentic New Orleans flavor). Grilled ","useful":0,"cool":0},"NFec6pbgkEtYZ8a95mQd5Q":{"text":"Wonderful spot right on the water. Friendly wait staff and excellent seafood dishes. Their","useful":0,"cool":0},"PyvTirUKLxG0Xo5ABP0Yqg":{"text":"My sisters and I came here on a Friday for happy hour. We were seated immediately upon arr","useful":0,"cool":0},"oCa7JeLlhwBsZkeCvubtyQ":{"text":"The Blue Crab is a restaurant and oyster bar on the New Orleans Lakefront area.  It overlo","useful":0,"cool":0},"hR92cnVPoB7OBkOUhw0agA":{"text":"First off, my husband and I wondered into this place as we visited NOLA and hung out on th","useful":1,"cool":0},"_m-CeSaVX9yIEmi9mdMzKg":{"text":"Crab dip was deliciousness and it has a great view indoors our out. Great location and foo","useful":0,"cool":0},"Q7SbjgpQt_lxw-irPBXTnw":{"text":"Exceptional food and personable server. 10/10 meal overall and definitely recommend for pe","useful":0,"cool":0},"4sORjQ8_4lC44qPLuOn49Q":{"text":"I didn't like the raw oysters because Felix down the street is better! The char-gilled oys","useful":0,"cool":0},"ulZtjmDvBe7Qdu8Xil4TOA":{"text":"The wait staff was awesome, the food was delicious, the live music was jamming, and the vi","useful":0,"cool":0},"t5Q0r_gYCOV0dvycpyW48Q":{"text":"Love sitting by the water and enjoying their happy hour. Every time we have dined here the","useful":0,"cool":0},"JEwPZRz9_Ve7h00yhjI4gg":{"text":"I went there with my family on Sunday evening and was terribly disappointed.  I had ordere","useful":0,"cool":0},"rajx2AAzImusjABa67-MRg":{"text":"Casual atmosphere, with terrific food!  Really enjoyed the chargrilled oysters, the catfis","useful":0,"cool":0},"Uk-18YSiZLI4JO5yF4mUpg":{"text":"Have always been a fan of the Blue Crab and have been going for years however my last trip","useful":1,"cool":0},"2f3BZholQH5r6bPSEmA4EQ":{"text":"Unfortunately, our 2 time visit to this restaurant were equally disappointing. Very bad se","useful":0,"cool":0},"FFgu29EDXDOrGhkFGDTwMw":{"text":"I have ate at blue crab several times, I don't know what's going on now. If I could leave ","useful":0,"cool":0},"X36iN6p0TwBGAsejc3H7Pg":{"text":"I still love this place.\n\nI've  been coming here with family and friends since they opened","useful":10,"cool":9},"bGSt-ASnjTu7VYTboBKX-A":{"text":"Good Food; Great View\n\nWife and I went here late evening and got a table in the upstairs b","useful":1,"cool":0},"CHEbt31k6emlDcLJK7u52Q":{"text":"Good Food Horrible Service\n\nFamily gathering brought us to this establishment with a reser","useful":6,"cool":2},"UuF7HVyW8G0aQy1y0_pyNg":{"text":"My husband and I dined at the Blue Crab with another couple on a Saturday night. Let me ju","useful":3,"cool":0},"oPZYTbFRjuzbiZCQrCyHWQ":{"text":"My friends who live in town brought us here for our last lunch before heading 4hrs home. W","useful":0,"cool":0},"NbYHsHnqS5vhtIcoz14eGw":{"text":"Love going to the Blue Crab. Always fresh seafood from the oysters to the fishing the day.","useful":3,"cool":1},"GM_WvY9pq0R_JP5xLiBWLQ":{"text":"This review only applies to the downstairs area.  We had a group there to watch a band tha","useful":4,"cool":1},"9sQYjGfFyeclaHk_wLmZKw":{"text":"IT AIN'T BRUNING'S BUT IT'S FAMILIAR\nWe went today on a gloriously sunny, 68 degree March ","useful":4,"cool":0},"I_azHmrQ4MpP3-BD_6GOyA":{"text":"We went on Tuesday night -- had a reservation which was ready when we arrived.  Great seat","useful":0,"cool":0},"f7aPz5Qp8EgLDNeZYPYrEg":{"text":"Very delicious loved the grilled shrimp platter, the soft shell crab platter was so yummy ","useful":0,"cool":0},"kN1JtDgSKctT1XAFgPgB4g":{"text":"I really like the food and scenery at this restaurant. It's on the lake front and over loo","useful":0,"cool":0},"muowKl_p1TQ2ZVVIj1XDwA":{"text":"Friendly and knowledgeable staff. Sat outside on the patio to enjoy the view! Can't beat h","useful":0,"cool":0},"Cg47k4e0Iwkg1391_IeG6w":{"text":"If you're looking for barely mediocre food along with terrible service, then this place is","useful":0,"cool":0},"ld4oL8-x5GXhY8FFCxDD-A":{"text":"Our waiter was Great and was very attentive. The restaurant its self was not good. I order","useful":0,"cool":0},"FWR4hX1L-89_urVcUz7M2g":{"text":"Husband and I went here for happy hour on the 4th of July. Was totally expecting a wait bu","useful":0,"cool":0},"4o7XMXQ4qLGiMhbYG37sZQ":{"text":"Service and food here was less than subpar. The waiter took forever and eternity. The food","useful":6,"cool":5},"nkZ5dNwbtjfEfdJ0XaSnzQ":{"text":"This review is actually overdue. We recently booked the Blue Crab for a proposal/she said ","useful":1,"cool":1},"0-BiXmo2VfFIdmSyChm9lA":{"text":"This is my second time at this restaurant and I'm glad I came.  Eggplant, calamari, and th","useful":2,"cool":0},"35DemfTarfPcoa3Oz4-TCQ":{"text":"I went with my family on Mother's Day and there was quite a long wait, as expected. I thin","useful":0,"cool":0},"HoaqtuoVnD3vOxhw6PqzJg":{"text":"My First Time here!!! I have been trying to get here for the longest! So my parents finall","useful":1,"cool":1},"zrdULLGRWoFgqX1LTDBtdA":{"text":"The Blue Crab was recommended by our tour guide and I'm glad we went!  I was here for the ","useful":0,"cool":1},"f4u0iFjxno9kHLQkT_tCmg":{"text":"SSSOOO LET ME TELL YOU SOMETHING!! This restaurant is straight  This was my first time din","useful":1,"cool":1},"WKn9UgYiJ5WtGsI5LtvyXA":{"text":"I like this place. Lots of tourists eat here, but it's because they like to feel they foun","useful":0,"cool":0},"0yRBKZYOkSHOiYUfXiNI9g":{"text":"My husband and I decided to try a new place for lunch and we are so glad we did. It's been","useful":1,"cool":0},"vu1Qn00xYEGfT9cgFjWoWw":{"text":"First time here for me, and I have to say I enjoyed it. My friends ordered the blue crab d","useful":0,"cool":0},"7PiCAGf7IpQf3jeGHRjbig":{"text":"Delicious!! And wow that view is amazing. Enjoyed the crab dip, frosé, and seafood platter","useful":0,"cool":0},"pZQ84rJTJdv1LYqdM7wHkw":{"text":"I love coming here for happy hour.\n\nThe view is great and sitting outside during the fall ","useful":2,"cool":1},"Gf5cUrAXTcQpubIyM5H6Pg":{"text":"Excellent seafood and a great indoor outdoor setting right on Lake Pontchartrain. I wholeh","useful":0,"cool":1},"pWTf8ByhZG5RQzfOFgxDPw":{"text":"One of my favorite places to grab a bite to eat on the lake. Usually you write a review ab","useful":4,"cool":2},"_4DxvB6ldp2vS5CUEDk0cA":{"text":"Used to love this place but this time was extremely underwhelming. I went with my family. ","useful":0,"cool":0},"qi8XrZGI96iJk8S1qgRkpA":{"text":"Excellent place bring children. The staff is friendly and accommodating as well.\n\nI like t","useful":6,"cool":1},"DXjh5ql2uCkVXbHeeC4X0Q":{"text":"Nice place to watch the saints game at the bar ! The oysters are delicious! Everything els","useful":0,"cool":0},"REaEaNC9Wi_pP7T7m9ulNA":{"text":"Went at peak crawfish season, at lunch the Thursday before Easter. The crawfish were waaay","useful":1,"cool":0},"4Dm_h2UBwH0gVW4x5g_y_Q":{"text":"This happy hour is INCREDIBLE. $5 calamari, .75 raw oysters, $1 chargrilled, and $3 glasse","useful":1,"cool":1},"_wDwHvagzrYYyJVr9ckQAg":{"text":"Went for happy hour I wouldn't recommend the happy hour food. We had fried calamari, Buffa","useful":0,"cool":0},"BQzyjSpeCDVDkVG-0IoXtQ":{"text":"It was our first night out mask free! Yey! The food was pretty good. The oysters were cold","useful":1,"cool":1},"2v60B_Oto6300WH_VWh6xg":{"text":"We had a great casual dinner at the Blue Crab restaurant on Lakeshore Dr. our first night ","useful":2,"cool":2},"b_jqNMzN1b9hYkyF6StOJw":{"text":"Heard a few friends had visited this place so I decided to check it out. Wow! I will defin","useful":0,"cool":0},"MoGTjIpg3wpsl2CPJnDPzw":{"text":"Wholly unimpressed. Minus the view, there isn't much to be desired here to be honest, thou","useful":4,"cool":2},"6UXmsWRSYMxeyFAFrMzSdw":{"text":"Came here with my sweets after a nephews little league baseball game.  We were hangry and ","useful":0,"cool":0},"QU0Mo763mq_8Lxo5v5IGdA":{"text":"Trash service (waitress with horrible attitude) food took almost an hour to come out and w","useful":0,"cool":0},"C1pjUbN6yoLsSOLOIpWPDQ":{"text":"Nice casual joint right on water.  Decent seafood, executed well.  Kid friendly.  Fun ambi","useful":1,"cool":1},"gvs0Dja8CFr0_Unv7XZQ7w":{"text":"The Blue Crab still seems to still be building some finishing touches on the outside but t","useful":7,"cool":2},"udwnmIzIdI_Z_PZ-9kLZeA":{"text":"2/28/2021\nAtmosphere- Nice\nFood- Subpar at best- Calamari Golden brown and not over cooked","useful":1,"cool":1},"Bx8_kW-OwwZAWs2OyQH87A":{"text":"Loved the place.... Seafood gumbo lacked any seafood. Tastiest rice and gravy bowl I've ev","useful":0,"cool":0},"MHgTbzSU7FJAhGrPia2MKQ":{"text":"Good location, short wait (went at around 4), indoor and outdoor seating, and amazing food","useful":0,"cool":0},"hyCOWjJQhoXSXU4TCFN2xA":{"text":"Paolo took amazing care of us and our pup on the patio. He was so nice and made sure we en","useful":0,"cool":0},"jhGiQs95wh37OciHO0QUkw":{"text":"Absolutely divine oysters. Half price at Happy Hour which is such a treat. The outside dec","useful":0,"cool":0},"dzTxU5rclec7L3DkVfCZ6w":{"text":"Mediocre food, awful service, fraudulent menu prices: Visited for Father's Day, to our sur","useful":0,"cool":0},"u5cmEmXw91IHhhpBk_yuUg":{"text":"Oh my.... one of my very favorite places while in New Orleans!!!\nI always sit on the patio","useful":1,"cool":0},"XIEWmMGiEyqXF4ZLvXf_Yg":{"text":"The boiled seafood is good but they are not enforcing any Covid protocols whatsoever. They","useful":0,"cool":0},"2lXzyyK2LB5K31EaUkXEWw":{"text":"This place is not worth the price you're paying. I expected better, this was just plain fo","useful":1,"cool":0},"YqCkXHlyGCjZCiRH4x-BUQ":{"text":"Very nice employees but the sign on the hostess desk let us know that help doesn't always ","useful":1,"cool":0},"TzmCXFeL8-oJWkzewHbGxQ":{"text":"Busy restaurant right on the lake. Big menu with lots of great options. We did the Chargri","useful":2,"cool":0},"tqd95CUZFYaKnL5lZdI47w":{"text":"I choose Blue Crab over the other two restaurants on the lakeshore any day of the week! Th","useful":0,"cool":0},"V0RzUzlEUc279ZQ6eJ5nzw":{"text":"Just not there. This place could be a gold mine if the food was good. Disappointing servic","useful":7,"cool":3},"Kkr37tMe_b0rkxyaXIqO-A":{"text":"We had Excellent service on hot Sunday afternoon. My cousin referred me to this spot, she'","useful":1,"cool":1},"JueddyLMNQep7k4x48Wdcg":{"text":"I have been watching a lot of cooking shows that showcased seafood. Came across this spot ","useful":1,"cool":0},"yq21k7L1nsg4RZ_Knb_Z_g":{"text":"The customer service is terrible aside from that they take long to bring the food out and ","useful":3,"cool":0},"OV9XWZZ6bCvKurQ0CeOPJA":{"text":"The crab and corn bisque soup was the star of the show. It was filled with crab and had a ","useful":3,"cool":0},"N134t4y1DMCWPXoM3GBJXQ":{"text":"I only come here for the oysters !! They had happy hour pre-COVID and it was just a steal ","useful":0,"cool":0},"qsEO6C8SfvfRUWH52pvSvQ":{"text":"I have had the pleasure of eating here a couple of times. Let me first preface by saying t","useful":2,"cool":2},"-2AA7DzEDmf5iBt0hSb8HA":{"text":"Sat at the bar for  thirty minutes. Finally got a table. They put us packed in a table for","useful":0,"cool":0},"FdE1cMk1-2prvPGm7qusbA":{"text":"Great location but HORRIBLE service. Took 85 minutes to get lunch after we ordered. Had to","useful":0,"cool":0},"OTG2vXka7FtGLKjeNI4YDQ":{"text":"Super views - one of the few on-the-water places on the lakefront. Great fresh oysters at ","useful":3,"cool":3},"inxBiWyX4c9dTwP9jEPExA":{"text":"This was my second visit to the Blue Crab. I'm not really sure why I didn't write a review","useful":9,"cool":4},"Dk_lnYlh6bxTRIRp9ubdsw":{"text":"I got there at happy hour, I had the sautéed crab claws recommended by The Bartender and t","useful":0,"cool":0},"mYEQNjWWD1uSSwk9tHBgBw":{"text":"Nice vibe. Waited and 1hr for a table inside which it wasn't bad because I went to Landry'","useful":0,"cool":0},"xS1CD5N2M1ZAOxaBed7ESw":{"text":"Dozen raw oysters hit the spot but damn it's hard to pay today's price. Growing up in the ","useful":2,"cool":1},"phydiJTaCqGIMMFWKUGHiw":{"text":"UPDATE: not changing my rating because the food is still always on point and their happy h","useful":0,"cool":0},"lMcsqNron-WJtrIJydMLMA":{"text":"Wait list beware!\nI've never put out a negative review on Yelp before, but this place made","useful":0,"cool":0},"GZRexJtS16RbTyxIt6vf-Q":{"text":"I have to start off by saying that I don't give 5 stars easily. The customer service and f","useful":2,"cool":1},"pEI2LMtsT7Dknlv0OlFpDA":{"text":"This is the place to go if you want to be ignored.\n\nWe went here on a beautiful Sunday aft","useful":0,"cool":0},"ZyNsZ8qVOGOoYyDpBWBRKA":{"text":"Blue crab is one of my favorite restaurants! The drinks, the food, and the wonderful atmos","useful":0,"cool":0},"8Xgd4QWaKwrNnO6obsPwlw":{"text":"We tried the Blue Crab and had a wonderful time with a huge party of 19! Ryan C. Was on to","useful":0,"cool":0},"Pj_cVT_l-Dqfb_npvUAFsw":{"text":"With one of the most beautiful days of the year in full effect today it was paramount to f","useful":10,"cool":6},"PUYCVBiIZQFV--HoVW0Prw":{"text":"Pretty decent spot. Right next to the water so has a good view. Had both indoor and outdoo","useful":1,"cool":0},"jhHriltsvJdbcD3g4yO1cg":{"text":"Sat downstairs for the music by the water and their is a different menu downstairs than up","useful":2,"cool":2},"FZFuRJyppYj3XDB1ohuKjA":{"text":"We ordered for the first time from\nthe blue crab after living in the neighborhood for two ","useful":1,"cool":0},"DsD5D_E8E82vQDHlB8gV6g":{"text":"Blue Crab does not disappoint! Every time I come, I fall in love more & more with their fo","useful":0,"cool":0},"ilEapn5hagszWBgVxbVZiA":{"text":"When we choose to come here for food, I know there will be no disappointment. I like the s","useful":2,"cool":0},"AhTv5GNpEzdSZgS1v8Z1vQ":{"text":"My husband and I have been coming here since it opened, and we really enjoy the food and t","useful":3,"cool":2},"WbIyvKspYBGY5dvDtF_Ehw":{"text":"Was not too crazy about the blue crab pasta. However, the seafood gumbo was AMAZING. The l","useful":0,"cool":0},"TsbA_m8ZxNYh3Y3tUOYoiw":{"text":"This was my first time hosting a LSU Dental mixer at Blue Crab. It was such a great experi","useful":2,"cool":0},"meH9WSne_42ayPxwPD_xng":{"text":"This place was recommended by a local in the area that I had the pleasure of meeting while","useful":0,"cool":0},"gx9AdeYUqt20CYVJzZ5dBw":{"text":"Very good quality food - very fresh. We had 'Mud Bugs' - Crawfish and Oysters that were pl","useful":1,"cool":0},"loQviUgmB7uJWxVpyxkNVQ":{"text":"Awful experience... I ordered a seafood platter which stated I had the choice of a  item w","useful":1,"cool":0},"oZJ7UIL9Cdib5Xtt4vhlNg":{"text":"First, I NEVER write a review...positive or negative but believe this is warranted.   Seco","useful":0,"cool":0},"Dvv5EBJ1O92xurJUhkxcOA":{"text":"Beautiful location and scenery. Really good authentic New Orleans seafood. Highly recommen","useful":0,"cool":0},"lZkStTuLqx6E3xy-1CEd0w":{"text":"This is a beautiful spot on the water. It is a large restaurant with indoor and outdoor se","useful":2,"cool":1},"cIVGk2n52YXX5OqirXyBtw":{"text":"The experience was so so and that's because of the way they handled an incident that could","useful":0,"cool":0},"SgGdCLpupbGN-KYqY_VJgQ":{"text":"Great owners, amazing and creative dishes! Awesome live music when possible and did I ment","useful":0,"cool":2},"cZXyWend-tBXEj7XJJmYGQ":{"text":"I hate to eat at Cajun restaurants outside of NOLA because it's just disappointing, but th","useful":2,"cool":0},"2cf92LASA0kdoDJKFLN8lQ":{"text":"This was one of the restaurants I chose months before taking the trip from Ontario to NOLA","useful":3,"cool":2},"1pDstySs9O1TIkeEGws18w":{"text":"The saddest review I've ever wrote:\n\nAbsolutely terrible! \nFirst they told us a 35-45 minu","useful":7,"cool":3},"oE3ud1UNiCA67iMIUv5fqg":{"text":"Great place right on Lake ponchatrain. The folks working there actually acted like they we","useful":0,"cool":0},"-93u6SuLtcoW27at1Bw1MQ":{"text":"Late lunch.  Everything was perfect from raw and grilled oysters, grilled catfish salad, g","useful":0,"cool":0},"ajRxbh-fs-b6kjczhIRr5g":{"text":"My family had a bad wait experience at Felix's, so we moseyed on over to The Blue Crab.\n\nI","useful":1,"cool":1},"dOcJh_mTMhlFEOnJhBfzIw":{"text":"This is our \"go to\" restaurant by the lake. We have a 2 year old and it's very kid-friendl","useful":1,"cool":0},"NHee6yQQcZ9ibzonU20oEA":{"text":"The food was comparable to other seafood restaurants in the area, but service was horrible","useful":0,"cool":0},"9WRNTrG7a7_1LI9K92X4Vg":{"text":"The food took over 25 minutes to get to the table! The waiter acted as though he knew noth","useful":0,"cool":0},"2PvSHKlQwxjk7aI45384QA":{"text":"About the only thing I can say about our experience...great sunsets! Busy Sunday evening a","useful":0,"cool":0},"PzujU6EWilgzZp-oiO2EOA":{"text":"This is that restaurant that you pass by all the time saying \"Imma go there one day\". Well","useful":4,"cool":1},"hydXUQHNHAzCmgvJXWByIA":{"text":"We went on a recommendation from a tour guide. Seafood was okay. Waiter was cool.  Evening","useful":0,"cool":0},"43I7AzRb7Y6KUUxtq3butQ":{"text":"Sitting at the Lakefront Arena watching women's college basketball and scoping out Yelp lo","useful":11,"cool":9},"Cyr7HLVqjjJb0Mspuz5Lrw":{"text":"This restaurant was walking distance from where we were staying and even though we missed ","useful":6,"cool":7},"TGG60TOIn_kSsMGbU1eSqw":{"text":"I loved this place but the last time we went everyone but me wasn't impressed with the foo","useful":0,"cool":1},"M9OhVnHesMhI4tFV9jDXDQ":{"text":"My wife and I went  with some friends for a late lunch on a beautiful Saturday. There was ","useful":2,"cool":1},"4Ei4gBxR7Y6PNLoMUCkq3A":{"text":"This restaurant was sadly disappointing. Took my girlfriend out and called ahead but they ","useful":0,"cool":0},"8Fh5AsS7jpPJ56OygzZLBQ":{"text":"Great service and views. Delicious food! We had the lunch special: gumbo, crawfish étouffé","useful":0,"cool":0},"MsTxe_y4G4WdFIiSR2huZw":{"text":"Hi!  My dad & I go out to eat every blue moon. Check this out. \n\nOne of my favorite dishes","useful":1,"cool":1},"0BhlKu1qoxNHyzQWsyR04Q":{"text":"Let me start by saying the restaurant and the scenery are beautiful. That's about all they","useful":2,"cool":0},"l67x79Qwcg-yRWy5JP6JJQ":{"text":"Our food was good. Hostess was really friendly. Our waiter, however, wasn't friendly. He s","useful":1,"cool":2},"KL2bYae-HKvtJ3h5IO0_hg":{"text":"Perfect sunny Spring afternoon on the deck overlooking Pontchartrain.  Great service as al","useful":1,"cool":0},"Q-kE7QijrO8s1KG4pQxdag":{"text":"Before Katrina one great memory was sitting on the deck of a crab shack eating buckets of ","useful":1,"cool":1},"36McbTHnh8j7--GFV0_zmQ":{"text":"Wow! Everything I had was absolutely delicious. Everyone at the table ordered seafood and ","useful":3,"cool":1},"0S_v48tQkX9U6W00TLQZrw":{"text":"This review centers on the wait staff. We visited on a beautisimous Sunday afternoon which","useful":2,"cool":0},"V4vokyYv6a93PElopaKvtg":{"text":"The location and live music is what made our experience here worth it. The food and drinks","useful":3,"cool":0},"i8hOqyvuzGUzvpR9r3uRfw":{"text":"We went there to eat and arrived to extremely loud and distorted music from a live band. W","useful":0,"cool":0},"2NzCjgVC0pbJqkpKnMDKZQ":{"text":"LOVED THE VIEW FROM THIS VENUE- best view I saw in NOLA! Tucked away on a waterfront high ","useful":7,"cool":6},"8AZSuc2UdcYMq1Lc_6e9Hw":{"text":"Excellent service as always fora neatly lunch. Crab cake sandwich on fresh baked bun was e","useful":1,"cool":1},"92WxG4kh7--_pkpNG7KeIA":{"text":"Everything was lovely until the oysters came and I tried one...not good milky,milky,milky.","useful":0,"cool":0},"2-9Pk_YQ4r3SSHPKRAQogQ":{"text":"Ordered our usual Onion Rings as a snack while we waited on the entrees. Excellent as alwa","useful":1,"cool":0},"ekNXv9xtJNh3R7U5DtgNgQ":{"text":"The food was good but the service was really not great. This is a cool restaurant on the l","useful":2,"cool":0},"NcVfs0fTWE7A6-t2OiQYig":{"text":"I discovered Blue Crab earlier this summer and I have been addicted ever since. Located on","useful":0,"cool":0},"rHTjSDKdR5m0CqxvWijFYA":{"text":"Had a large group gathering at this restaurant. Our waiter was very nice and attentive. I ","useful":0,"cool":0},"ewNTtV16Vh8E8UaNl0XysA":{"text":"I live in New York City and I really miss gulf oysters. My parents and I come every trip b","useful":2,"cool":0},"PGg7YMU1t6j7OQCbcw6hAw":{"text":"The Blue Crab has been open since the end of July 2013 and is managed by the fellow once a","useful":0,"cool":0},"UVVJWq9BoEc2EZLZrqVvPw":{"text":"The Blue Crab has become a favorite of my spouse and I.  All the food from pompano, grille","useful":2,"cool":0}}