{"3WwyRjNACl8dC8D1ItgSBQ":{"text":"Exceeded my expectations. Came here on a very busy weekend in NO, when both Jazz Fest and ","useful":0,"cool":0},"qQCy8S79ii87bUqCpBB_2g":{"text":"Every single person we came in contact with that worked at this hotel was pleasant, helpfu","useful":0,"cool":0},"BzzIqZP70ZDux30LzBBchw":{"text":"Stayed here three nights / four days for a business conference. The conference was hosted ","useful":0,"cool":0},"1iOnaKY7M59l-lb6Tbp4aQ":{"text":"Pretty nice place. Bed is comfy rooms are nice. Here for a conference and its a really goo","useful":0,"cool":0},"HwaJRoa2iCp5MzWnJ4I60g":{"text":"Large, factory convention hotel with good location.\n\nLobby restrooms somewhat hidden in ha","useful":1,"cool":1},"EdoNa0rl24kJDnJ3vmwHwQ":{"text":"I'm here for a dental implant certification course, which is being held at this hotel, and","useful":0,"cool":0},"E744SaBHw4GCjRBez1YgVQ":{"text":"Is this place a joke?  Are the rooms really this small?  Are they really this expensive?  ","useful":0,"cool":0},"X-iNKD_T52v7Zwx2VTN0Gw":{"text":"So disappointed! The two stars are for location only! I've only been here one day and I'm ","useful":0,"cool":0},"g9wMs0Ly7PmiXL-IgOiD9g":{"text":"Good property. We had an annual convention there. Friendly staff and the facilities were g","useful":0,"cool":0},"HIy9FzKeZnlr8NdDpDMvSw":{"text":"I cannot recommend this hotel after a 4 night stay there over New Years.  First, they have","useful":1,"cool":0},"0mRlBuQ0y4p7YAxCkF9V_A":{"text":"Great time in New Orleans and wonderful accommodations.  Downtown; which allowed us to wal","useful":0,"cool":0},"xWYZa3gk5TKcuVe2r_GbDw":{"text":"I'm currently staying at this hotel and just moved into my THIRD room in one day. The firs","useful":0,"cool":0},"MLxTQyxttQm01EKHKF3mJg":{"text":"Great place , we had two rooms with 8 guests 4 adults 4 teens. Close enough to everything ","useful":0,"cool":0},"NaK1Igeybkb1qSo9AYFX2g":{"text":"Real estate and hotels are all about location.  This hotel's location is ideal if you plan","useful":2,"cool":1},"ck2R6d7tjMP6He5XbNeaew":{"text":"Horrible! Do not stay at this hotel until they are finished remodeling their main entrance","useful":1,"cool":0},"RH8qlAchB9u7dc3Zwe6bLg":{"text":"Huge and well priced hotel in the heart of the city. Walking distance from everything you ","useful":0,"cool":0},"N4YcM75BCROT1OFogkTsHg":{"text":"Just stayed here with a friend for 4 nights and we absolutely loved it. The location is ph","useful":0,"cool":0},"xdF0r0PK8Z-f3Nnhr52PSg":{"text":"beautiful! Classy, clean.\nProbably helped that I was on the concierge level, but I thought","useful":0,"cool":0},"5RJ7aeCdWJ7UQtbltXqcwg":{"text":"On the surface this hotel appears to be nice and worth the cost, but there were just too m","useful":1,"cool":0},"EjdN6FPZxsUmhG_z4T4klg":{"text":"Stayed at the Marriott New Orleans for four nights for a conference.  Many of the common a","useful":0,"cool":0},"PBcWvxznaZKcmUi7BhrF2A":{"text":"A good hotel for a giant property. Beds were super comfortable, nice shower head, good ele","useful":0,"cool":0},"FaEdwVc6T2OtF-4kPyao9A":{"text":"So, I had the seafood gumbo at the M Lounge of the hotel, which I gather it's from the on-","useful":0,"cool":0},"fn-lRaCErpfK9RZHkY2UkA":{"text":"I would give it a 3.5. I wish Yelp had 1/2 star options. \n\nI've stayed here a couple of ti","useful":0,"cool":0},"hFLViQXFyyTAEuSUsnbpwA":{"text":"I stayed here with my sister for the 2017 Sugar Bowl. The moment we walked in, the staff w","useful":0,"cool":0},"VjUVAX_L1_toezW9TUGYZA":{"text":"Stayed here for a conference.  Rooms are small, bed and pillows are old, \nand the bathroom","useful":1,"cool":0},"fGkaDAN8Myi5Z4zzf5DnfQ":{"text":"For our vacation, we were staying at the Q&C Autograph hotel, a part of the Marriott famil","useful":0,"cool":0},"TipBKa8yO2YdTm_aItcPNQ":{"text":"We stayed here for a convention, and the service was remarkable, considering the sheer num","useful":0,"cool":0},"7WkhLm_PFYWZxe6QVwJCdA":{"text":"I gave it two stars based on location alone. Literally steps to Bourbon Street, fantastic ","useful":0,"cool":0},"t2HhtJxsCgbURc9VAoc9Sg":{"text":"We stayed here last month and really liked the location.  Far enough from the shenanigans ","useful":1,"cool":0},"VAJLceIsKdqRvkif3ZdR3A":{"text":"I'm a huge Marriott fan and stay almost exclusively in Marriott hotels.  The hotel in gene","useful":0,"cool":0},"AdF4HLsuoVwEkdKjmSIcwA":{"text":"Oddly Lilliputian hotel room--everything was just a bit undersized.  The ceiling was dropp","useful":0,"cool":1},"9v2_GBVQksG1tEgp7Y0kDw":{"text":"With eight people trying to check in there was only one person working the desk.  The othe","useful":1,"cool":0},"TVToRiMk3Mch3XmqrfFmmA":{"text":"For the price, (almost $300) I expected much better. The room was small with a view of the","useful":2,"cool":0},"G3MuZu7FkUEWWgluEI4ISA":{"text":"I was excited to do a Priceline negotiator for a hotel in New Orleans. But what I did not ","useful":3,"cool":0},"xXCqJwWpAVDXNKWO89y1NA":{"text":"Big- Old- Marriott hotel in a great location right on Canal Street.\nEasy in and out due to","useful":0,"cool":0},"gPO863r0laxIaZG8D18L5w":{"text":"Just got home from a week-long conference in NOLA.  Our organization was booked at the New","useful":0,"cool":0},"6BoJerkqabMcpZSA9QXGOQ":{"text":"The room wasn't cleaned well, and in our several day stay it was only cleaned once after I","useful":0,"cool":0},"hJMEmLoaJlarSbDV0_ZqhQ":{"text":"Great location! Walking distance to all of the French Quarter, street cars located right o","useful":0,"cool":0},"rQdRsZdLqr88AYfZJn9n9A":{"text":"Do NOT use this hotel.  Check in was horrible, even though elite status, had us wait 20 mi","useful":1,"cool":0},"R2nPukPUJ-JxQ-wHcyCIKQ":{"text":"The place itself is very nice and clean. We weren't too happy when we found out they have ","useful":0,"cool":0},"dCEqUXf1gBawwA0UQz_fLA":{"text":"Great location and accommodations are clean and comfortable.  Service isn't the best.  Fro","useful":0,"cool":0},"w7bP9eR69JYsTA5xBt3rVg":{"text":"This hotel is in the idea spot. However, as an elite member we had 24 hour access to the M","useful":0,"cool":0},"zigKwtt60Sqo6LoJYZxHdg":{"text":"I was concerned about the bedbug issues in other reviews. The manager Kevin Granier (apolo","useful":0,"cool":0},"nLShM8IWTlIU50Ze-Jk-vA":{"text":"I just have to say, not impressed. My husband is platinum with Marriott, and we pretty muc","useful":0,"cool":0},"sWQUzWQe6vmJN-DMdYUsjQ":{"text":"Very nice hotel, comfortable beds, clean room and an excellent staff.  The location is ext","useful":0,"cool":0},"6-E3BOeAUZpg7976yE8oRg":{"text":"Right off the bat, I must admit I was a little too hard on the Nola Marriott. First impres","useful":0,"cool":0},"MHw6eMSjZuSvK5Mrb_P29Q":{"text":"This hotel thought they were ready for our convention...I warned them I really did. They w","useful":2,"cool":0},"iihAcXvH0aIRXPmOYn3e4A":{"text":"This place is super clean and comfy! My husband and I were here for just a weekend and sta","useful":0,"cool":0},"X5WFsXEvxAKzG9nmb4YnUg":{"text":"Very standard hotel as you would expect. My only complaint was that our shower didn't drai","useful":0,"cool":0},"rETmKa0O0u3JlSPGsxjkwg":{"text":"Stayed here 5/27 - 5/30 and it has been a pleasant stay.  Helpful doorman and quick check ","useful":0,"cool":1},"wMSRQ_iE0wEJepJiw3OUJQ":{"text":"The rooms are very basic. For the price, you're really just paying for the fabulous locati","useful":1,"cool":0},"aJibrKJ-KajOc6aoi_SRoA":{"text":"Nice hotel that's in a great spot. The restaurant located within the hotel has the best br","useful":0,"cool":0},"c1awcoVC6Juh_MHYJdGyrA":{"text":"Your neighbors next door are really annoyed with your Valet Honkers! It starts at 6am ever","useful":0,"cool":0},"jbz5PQCeZfrr3FurKh6EZQ":{"text":"Great location. liked this Marriott. Easy in and out to Bourbon street. Room was clean and","useful":0,"cool":0},"tlJXUxH9E_-j8Zbxr4hPDA":{"text":"My friends and I had a great 3 night stay at the Marriott over Memorial Day weekend.\n\nFrom","useful":1,"cool":0},"F8b-o7xozwV56MdMxZkPhQ":{"text":"Great hotel i have to first of all say. Not to far from the main events a block or two not","useful":0,"cool":0},"jU_82M2E56vSpdsaiY5rBg":{"text":"Staying in New Orleans for first time this hotel is in the French Quarter. The room is nic","useful":0,"cool":0},"9Xt7OpKrkTVCgl9SX14Vyw":{"text":"I happen to be an elite member of Marriott and I'm often very critical when I don't receiv","useful":1,"cool":0},"wfM75QYIL1_S6mK1NgRXlg":{"text":"This hotel was alright. Nothing really to write home about.  The lobby was nice; the eleva","useful":1,"cool":0},"Ee0aguhIVVEcsoDk4DqOmA":{"text":"I was down in New Orleans for a wedding over a recent weekend, and given the festivities w","useful":1,"cool":0},"5GrVr20bBZ3G1ShqQDMOXw":{"text":"If my math is right, I first stayed in this place 30 years ago.  It's undergone many impro","useful":3,"cool":1},"i51mwqTiz0LtDs1R897UTw":{"text":"The staff here is incredible. Had a late night issue and Preston at the front desk was fan","useful":0,"cool":0},"zJq_q9lVu-rxbJUx3D1Fpg":{"text":"Decent hotel, GREAT location. The bed was super comfy and the staff were swift and to the ","useful":0,"cool":0},"YYuzcJAianmFhiZkyUssOA":{"text":"Decent hotel.\nGreat lounge.\nIn the heart of the city.\nRooms are a little small, no recycli","useful":0,"cool":0},"F_uEqnmEE738DEEWT_OIPA":{"text":"I don't like giving negative reviews, but man this hotel is not keeping up with other Marr","useful":0,"cool":0},"wz2dM1hYJkeMOP2QSS56Og":{"text":"THE MARRIOTT HAS COMPLETELY RUINED MY VACATION! The resident managers Donald Payne and Sal","useful":0,"cool":0},"MeBoMd8QBDO75MjHahkWbQ":{"text":"Second time staying here...great hotel and great location. We were checked in by Cari W. W","useful":0,"cool":0},"tdfZFcNvwBFOF5d77s8PTQ":{"text":"I never had to pay for the room, so I'm not sure what it would've taken from my wallet, bu","useful":0,"cool":0},"h_98yuPDFHpYcSmM_ULV9w":{"text":"This hotel is close enough to the activity of the quarter, but far enough away to justify ","useful":0,"cool":0},"zztXmdxY_8SyDKfpFk7Neg":{"text":"We had an extremely pleasant 5-night stay at the New Orleans Marriott on Canal Street. The","useful":0,"cool":0},"JVxto3IMXoTefaQAZRTyQQ":{"text":"Horrible service if you are of color. Reserved room a couple months in advance was told we","useful":0,"cool":0},"CHBxjcsIOle9pVQ1btwryg":{"text":"This Marriott manages volume.  1100 rooms are in the hotel, but the staff manages nicely, ","useful":0,"cool":0},"warMe7S_k_9RjByj8B_cWQ":{"text":"OK, this Marriott on Canal is centrally located. You can walk everywhere in the French Qua","useful":0,"cool":0},"Pr5IHqkTuSayO2BEFlfbuQ":{"text":"New Cardiovascular Horizons Conference is great! The live cases are incredible. The Marrio","useful":0,"cool":0},"d_6t053doM8a6g4Ng3-flA":{"text":"Good place.  Location is good because you are on a main road (Canal Street), but your are ","useful":2,"cool":0},"YHsLBMSiulQN_IHQRbBegQ":{"text":"I bought a flight + hotel package through Expedia. This Marriott was priced well. When you","useful":3,"cool":0},"rwoz-ARsxnxvHWB_Ekkv5w":{"text":"I was recently at the marriott for a conference.  I was staying at another hotel.   At the","useful":0,"cool":0},"_YSOAen28pwNk2Ivl4oxfg":{"text":"Very nice Marriott and terrific location. When we first arrived, the line was lengthy for ","useful":0,"cool":0},"e0PkWxGFdgruqGdX6JU_6Q":{"text":"Beautiful, clean hotel! Very friendly staff everywhere! Small room though and we had an en","useful":0,"cool":0},"zTZNEIwzMt47V_jCJ09nbA":{"text":"Mold. \n\nI had a migrane headache and bloodshot eyes for the entirety of my 5 night stay at","useful":0,"cool":0},"F_95QMNDX5K3FqAHhMAgFg":{"text":"A friend originally booked a couple of rooms at the Best Western from hotels.com not too f","useful":3,"cool":1},"uX5j3PUqcW8HwuCu62Ue6A":{"text":"This hotel is just OK. Very large and crowded as a result. Staff is very helpful. Rooms ar","useful":0,"cool":0},"nyw0gut-UVZDvz65gAeBeQ":{"text":"I went to this hotel as a vacation guest. Conveniently located on one end of the French Qu","useful":0,"cool":0},"Q738dQVsN3tCDRr5ug_g8Q":{"text":"Stayed here last week for a conference. Pretty nice hotel with a big lobby restaurant/bar ","useful":0,"cool":0},"yzQ4eBmuJrdL2LmEkPLUrA":{"text":"My wife and I just spent our first night. The service is great and the lobby is huge but t","useful":0,"cool":0},"t4YXXJc0ipkCSFPK-gwRYQ":{"text":"Stayed here at the end of my trips because the Harrahs was all booked and the only rooms t","useful":0,"cool":0},"uGJj7ZtraDlm2wKNSG2Vlw":{"text":"Great hotel!!! Fantastic location in downtown Nola!! Staff is great...\n Cons: prices r exp","useful":0,"cool":0},"pwto1_r8Mw-CX8yh1VNDuQ":{"text":"Great location close to everything on the French quarter.... Had a cockroach in the room a","useful":0,"cool":0},"1kYulzpJ0SCs9jjCCTZlGA":{"text":"This place was awesome. Took care of all of our needs. The view of the city from our room ","useful":0,"cool":0},"9Izsl6Ilsjraz2d3lrUpEg":{"text":"I stayed here as part of a conference which was paid for by work so I can't really rate th","useful":0,"cool":0},"gT7reDCv3NuwWGsllTZfhg":{"text":"Standard hotel room but exceptional service and great location. I had access to the M Club","useful":0,"cool":0},"bYpFUZrxIpjpsSpmtugKlA":{"text":"Customer Service: good. Everyone was nice and approachable.\n\nInternet Connection: very poo","useful":0,"cool":0},"215AlQFWktFYSyz4ppZBzA":{"text":"Three stars for great staff and an overall very clean room and bathroom. Docking stars for","useful":2,"cool":0},"_4o6yi8c2J0BoLTkVqr6Ag":{"text":"After only staying one night at this hotel, I am already a huge fan of the place. What mor","useful":13,"cool":13},"3IhaZhACbwlUp3kPLokxXg":{"text":"Great location, never have to wait for an elevator,  very nice lobby, responsive staff. Bu","useful":1,"cool":0},"I9gVGLwjKdafYRIAKyzP_w":{"text":"I stayed at this hotel during the Essence Music Fest and was totally impressed. They gave ","useful":0,"cool":0},"R0R-mL3erGcWV3wl4n2ARA":{"text":"I stayed there for one saturday night while in town for a company christmas party.  The lo","useful":1,"cool":0},"Xki3SCJTaaRvTztMpjU0Ug":{"text":"Good luck getting waited on.. Once you do... The wine is reasonable & yummy. The food is g","useful":0,"cool":0},"SW9kSIOpBXio5ZtfSAWWPw":{"text":"Everyone is so accommodating which is something you'd expect from a hotel BUT what a relie","useful":0,"cool":0},"AS6xa-wmZhXjt6BEWXqrvg":{"text":"Enjoyed my stay here although parking was somewhat problematic. Room was clean and the vie","useful":0,"cool":0},"znzKQSrnXBQ1FpnJ6fTeew":{"text":"The only thing good about this hotel is the location.  We checked in at 3 PM and our room ","useful":1,"cool":0},"o-1WCcJfFICbHiis7pIKJA":{"text":"Excellent location. \n\nCheck in staff are wonderful. \n\nGold and Platinum members have acces","useful":0,"cool":0},"Bqkv6yVnlOMkUOzl0f3hYQ":{"text":"This place has been wonderful. Walking distance to all the hot spots!  Bourbon Street, Roy","useful":0,"cool":0},"AZ3ltweMH5tuitO4XtyNEg":{"text":"Recently had a very bad stay at this Marriott. I travelled down with a group of friends fo","useful":0,"cool":0},"ZCKRLuS-qds-nNXUyA_fkg":{"text":"Being disabled they tried to charge me 120, extra for my room, I spoke to the front desk 7","useful":0,"cool":0},"3FBBC7-1Krzt32jHlIz9Eg":{"text":"Do not stay here unless you want to wait 30 min for the elevators--particularly if there i","useful":0,"cool":0},"CYRPlGjItjHJm10x_va3Lg":{"text":"We just visited New Orleans for the first time last month and having never been there, we ","useful":1,"cool":1},"h0CbIXFTXyawTrcESWzPwQ":{"text":"We had originally booked at the Westin down the street but several issues when we arrived ","useful":0,"cool":0},"LpnfpUWhWfuDzRyVPJ59GQ":{"text":"The rooms are comfortable but the housekeeping service is very unkind. They ignored servic","useful":0,"cool":0},"aRhYfcM-ryz2kFJZ5l7UGA":{"text":"Stayed here for a conference.\nPrice was average for the amenities.\n\nRoom was just OK.  Pil","useful":2,"cool":0},"Cas4W6c3VjBh59QmiP1Y3w":{"text":"This hotel really rides the line of being ok and not actually being ok. The beds seem clea","useful":3,"cool":0},"nIXSFDuXEraV5N9PL3K6GQ":{"text":"+Convenient location\n+Rates are reasonable\n+HUGE hotel\n+Starbucks in the lobby\n+Staff is f","useful":1,"cool":2},"3lsh2ePtbWSESeU6lh1nXw":{"text":"I have stayed at many Marriott or Host locations,but this has taken the spot for my least ","useful":3,"cool":0},"fa9O2RtNlL4sMaJ6AlEjZA":{"text":"Beautiful lobby, great location on Canal street.  My friends stayed here so I just mooched","useful":0,"cool":0},"9nFFMmGgZVCBb9zbyZLyEQ":{"text":"Love this hotel and location, only stayed 2 nights since it was sold out.  Walking distanc","useful":2,"cool":1},"B73vGa3X9HSIqnlP-_DPWA":{"text":"Marriott has claimed they conducted an investigation and found no bed bugs.  Then why the ","useful":1,"cool":0},"DxHTyrepSoOGb2CTuzyfww":{"text":"Being a Platinum Marriott member, I've stayed quite a bit in New Orleans. I think this hot","useful":0,"cool":0},"ixb6DcvbAMkZ_ztTs69-Pw":{"text":"I stayed here over Halloween...and I got a trick instead of a treat....BEDBUGS!\nI wish I h","useful":3,"cool":0},"6P3-UM_C5_40AKMcR6XWWQ":{"text":"The room was clean and quiet and the staff was friendly! \n\nI thought it was overpriced for","useful":0,"cool":0},"F-7AU6zALtswRZeFtM0FYw":{"text":"This was to date the most unpleasant hotel we have experienced. We paid extra for the rive","useful":1,"cool":0},"w1va2SRiQ1_kp_HLPv-_dw":{"text":"Stopped by to visit relatives from out-of-town. It's a busy place and different banquettes","useful":2,"cool":0},"lbAeDRC6eb-KlG1WkxKaoA":{"text":"Was in NOLA for a conference at the Marriott. Rate was $160 a night plus taxes. Stayed for","useful":0,"cool":0},"nNYDyRE_E0EQt-CkrWs2ew":{"text":"This review is about the valet parking service and not the hotel. Last night we met relati","useful":1,"cool":0},"MN6V9OuGP_x0ANmPGii7kg":{"text":"What a wonderful experience. The hotel is so beautiful and in a perfect location. The M Cl","useful":1,"cool":0},"-Be3rR6BsvsCB7fmuBHijQ":{"text":"Nice hotel, nice rooms, great atmosphere in the lobby.  We were staying at the Marriott du","useful":1,"cool":0},"Zo4nn9wIhTUM8mllJ_8EDw":{"text":"I am only rating the hotel three stars as the bathroom in the room I stayed was extremely ","useful":0,"cool":0},"QZuavGwSG1CffZivYDP5ew":{"text":"I would give this hotel a solid 4 stars. The room and views were awesome, the bed was supe","useful":2,"cool":0},"zNG53-YQR6NrIDQkTe0U-g":{"text":"Perfect location for food and entertainment in New Orleans. Nice bar area and a full Starb","useful":0,"cool":0},"HzD3HD7iFMBF-oergVMaLA":{"text":"I debated whether this was a 4 or 5. Ultimately this Marriott gets the top rank because of","useful":1,"cool":0},"zqM7PiFnKz-lIHGsvv3n-w":{"text":"Great conference facilities, and a decent Sazerac near the French Quarter, but the rest is","useful":0,"cool":0},"Q61GftLbyLbLq_XZoztKXg":{"text":"The choice of the New Orleans Marriott (555 Canal) was a \"no brainer\". Its proximity to th","useful":2,"cool":0},"hPaE1dcCm12i9o0GQ9gd0A":{"text":"This Marriott is older so expect everything that comes with that. They need to remodeled.\n","useful":0,"cool":0},"04zG7OscqB7bVoBEIv9H8Q":{"text":"We got a very reasonable price for this hotel by naming our own price on Priceline.com. Ne","useful":0,"cool":1},"L1VJcbwAPQ36vNSTVD35ag":{"text":"When planning to go away for a weekend in New Orleans, our group had just a few goals for ","useful":0,"cool":0},"hWhXlVU95TAo2cJBXyBZiw":{"text":"If you're a Harrah's Rewards card holder, you can actually stay here for free if you're lu","useful":2,"cool":1},"6IsW-UpGPnaoiKlCpjkNtg":{"text":"They over charged me for a night. I wouldn't have even noticed had I not checked my credit","useful":0,"cool":0},"MLx-K67mGJFwx6PrgJmPtg":{"text":"I stayed here for 4 nights recently. The hotel is conveniently located (within walking dis","useful":0,"cool":0},"CBt8X571x5eOQ6phMV98eA":{"text":"Nice and tall two tower hotel that is very close walking distance to Bourbon Street and th","useful":2,"cool":1},"ZOZZnlBd3TLNBd0zdZB6Dg":{"text":"Enjoyed our stay as a way to relax after a long work week. Loved our room. The bed was ver","useful":1,"cool":0},"LujvQNpz9iatZx_ziP-iNw":{"text":"This review is strictly for the M Club, nothing else at the Marriott, a lounge for gold me","useful":0,"cool":0},"R58fzlY7k-Q6mYpuEDp54w":{"text":"Where do I begin, we have stayed at several hotels and brands throughout the US, this was ","useful":0,"cool":0},"znv69Rz9xhAjcC8Is1TKHg":{"text":"Fantastic venue! Hands down one of the nicest Marriott Flagship hotels I've stayed in duri","useful":1,"cool":0},"8_SjkIrmXJzmPosuNGe_wA":{"text":"Not what I'm used to. Read my tip regarding service at this hotel. Great location but that","useful":0,"cool":0},"NcvGlWt0_4qAQoEw8ZFsmg":{"text":"I've traveled a bit and know a great hotel when I see it. (N.B. I could care less about th","useful":0,"cool":0},"PSOu5nE6rRo7Im4hpmUzkw":{"text":"I feel silly reviewing a hotel considering it pretty much has all your basics and it's rig","useful":2,"cool":1},"Q4XroQQb1tbqAfA_QvkxQg":{"text":"Small rooms, old hotel, kind of a dump for a full scale Marriott.  The rooms are teeny tin","useful":0,"cool":0},"pP_0zQ0d1HxDs6tPb-2-_g":{"text":"Great bedding, good views. Interiors are standard. Staff is friendly.  If I come back, I'd","useful":0,"cool":0},"9NL6QiUJj1K34-nF4dLCaA":{"text":"We were completely pleased with our stay, which included the very Marriott brand hospitali","useful":1,"cool":0},"zIZv-egYJz6K5gbxzHWjZQ":{"text":"I came to New Orleans for a work meeting and this Marriott was chosen as our accommodation","useful":2,"cool":0},"HYjmh919AMfW9z0wZQ4OWg":{"text":"Think twice about staying here. The location is great and rooms are nice but management is","useful":0,"cool":0},"6j8WJWjnVtLL95ixdULiPw":{"text":"Amazing conference.  The food was\nSo good.  The staff and service were impeccable.  Honest","useful":0,"cool":0},"OJZ_ciXPaUU3cYRuAbZi2g":{"text":"This place takes care of their elites, great concierge \"M Club\" lounge and staff.  Locatio","useful":0,"cool":0},"OZu1njbHK1nwcfCE_yOEGw":{"text":"I was very pleased with this hotel experience. I stayed in the river north tower and it fe","useful":1,"cool":0},"A_g_ZaoxC2iE8q3Sbxel1w":{"text":"I came at the worst time for customer service .  We were here for the Superbowl.  They hap","useful":0,"cool":0},"7cVlM-oMWi5vfOG0hlspVQ":{"text":"Treated like crap. Plain and simple.\n\nAfter driving 14 hours from Miami, the extremely rud","useful":0,"cool":0},"iblqg7VRUTjH8tmXekLYzg":{"text":"I've stayed at many Marriott's before and I was very disappointed with my stay at the New ","useful":1,"cool":0},"M4QiC2lqa6WqOD_ebRf0jg":{"text":"Wow. What a beautiful bar. I came here with my husband while he was in NOLA on a business ","useful":0,"cool":0},"Pu6Xa764XYUhQHiO2vVGZw":{"text":"Attended a conference here and my experience was great! The staff was very accommodating a","useful":0,"cool":0},"VzgJ5eaZNGDONaIqRrwX3A":{"text":"I'm originally from New Orleans, but moved away. A business trip brought me back and I sta","useful":0,"cool":0},"t7mlwYXdwJQ11b4QFVWQdA":{"text":"Treat gold members like crap- especially the people standing at the platinum and gold memb","useful":0,"cool":0},"HLv0FRKvJ31OyrYeB2b1Pw":{"text":"Nice hotel, Great Location, Very Comfy bed, Great Shower Pressure (this is a big one), My ","useful":0,"cool":0},"bKihPHKqghyZXwtlJx3lqw":{"text":"Just based on the elevators, this hotel deserves ZERO stars! 20 minutes and I can't even h","useful":0,"cool":0},"AuurQ7MOnFBkciWVif5bDQ":{"text":"This place is beautiful! We stayed on the 19th floor and absolutely loved it! The staff he","useful":0,"cool":0},"8GBBACwcAvLRQm9olLcuZw":{"text":"This is a very clean Marriott hotel, optimally located on Canal Street, and within five mi","useful":1,"cool":0},"7sTgh7lqPtIVWxq9_trW5g":{"text":"Came here to Celebrate A Birthday and from the minute you walk thru the doors the atmosphe","useful":0,"cool":0},"PHELOnhAQpI4a99o_xkOrA":{"text":"A-Ok.  \n\nPositives:  rooms are spacious and beds comfortable.  It is clean and it appears ","useful":0,"cool":0},"aOY1XVz5I2AnjZaPJYaSWg":{"text":"Hello, Gorgeous. \n\nEveryone reviews the hotel rooms, the bar, even the elevators, right? W","useful":6,"cool":7},"rQFn5OGQK-1IYI4VCyaGSw":{"text":"I arrived in New Orleans on March 26, 2017, for a one night stay. My wife and I were stayi","useful":0,"cool":0},"IyY2njDpf5y8KuK9QaKaWQ":{"text":"Wonderful! A lively hotel with a great view and location. We stayed in an awesome suite on","useful":0,"cool":0},"xDdkCYLgXV5nfqJiJjB86Q":{"text":"got 3 nights @ priceline.com for $75/night! can't beat that. \n\nLOVED: \n- asked if we could","useful":2,"cool":0},"HSBk0k28N9syeHqpvTD19w":{"text":"Stayed her for our wedding and very impressed. The house keepers Tyonesha and Lisa decorat","useful":0,"cool":0},"TOZ8as_2xNMFKJPs4Xb6lw":{"text":"This Hotel really pays attention to customer service both room wise as well as the lounge ","useful":0,"cool":0},"gixhLFSPoxfKGf5lERdW8w":{"text":"Those elevators tho! \n\nThis place has cool driveway like Vegas and is new and modern. I do","useful":17,"cool":12},"uOGrq2jJmsj52aKXTEcxKg":{"text":"This Marriott was centrally located to everything, literally right between Bourbon and Dec","useful":1,"cool":1},"ScPuDRYhMXDWZ7SRiNjkgw":{"text":"This should be 4.5 stars but they have the WORST elevator system. I imagine it's suppose t","useful":0,"cool":0},"AbaYV_pAcj_Q5Lb2fUqLEA":{"text":"I  .  Was so happy when I arrived at this hotel. The rooms were just remodeled and were ve","useful":1,"cool":0},"FvyYHEqUhjhfLV1e4l-loA":{"text":"I am a Marriott fan, the NOLA location is Xmas friendly this year with a  huge gingerbread","useful":3,"cool":3},"GLiRabHjajgQVHahUDafIQ":{"text":"Pros:\n- Super convenient to both the french quarter (for all those must visit places on yo","useful":0,"cool":0},"T-PRB6UjdrT_3x_11-TKFg":{"text":"I'd love to tell you about the hotel and how fabulous it is, but I can't remember it.  Wha","useful":0,"cool":0},"LxnOqs5zDNK3OlJEstaJxg":{"text":"This place is way overpriced for the quality of the rooms.  I understand it is all about l","useful":0,"cool":0},"Ih59PQw8_lgGUAikddc3gA":{"text":"This rating is specific to room service dining. There is no way that seafood gumbo is  awa","useful":1,"cool":0},"XpBP8yju6EnmAYPw69H7Tg":{"text":"The rooms are small and clean. The issue I found was for the 4 days I was there the confer","useful":0,"cool":0},"onOPKZfl44mkLDfrylpErw":{"text":"This Hotel stay has been very nice so far.  We also have really enjoyed The M lounge.  The","useful":0,"cool":0},"XQdOiqg_MDqS6bqnosTfdw":{"text":"Very nice hotel, staff went out of their way to take care of my needs. The only thing I do","useful":1,"cool":0},"nkF5EHGZsi-QFCdLvO6mow":{"text":"Well lets be honest, I don't remember much from my weekend in New Orleans because I was th","useful":0,"cool":0},"ePES6qKwKRJCnbPa7xJeUQ":{"text":"They'll just give your room keys to anyone.  They don't give a shit about safety or securi","useful":0,"cool":0},"OpOWRcoY5tl21-ijAwzlfQ":{"text":"This hotel was great. They have complementary  fruit-flavored water, juices and cookies or","useful":1,"cool":0},"D9Jly275LMo4PuRBCoexuA":{"text":"Now, I'll give a disclaimer and note that I'm partial to Marriott hotels. I've been keepin","useful":1,"cool":1},"TLCbwC_SdGoTsqOqmEggUw":{"text":"Having the elevators going out several times during the weekend is very hard especially fo","useful":0,"cool":0},"Sunkkino7zPPrnl2VxlfzQ":{"text":"Great location, clean rooms, and a friendly staff. Not too impressed with the size of the ","useful":0,"cool":0},"YFEw0Hs8WYp0BLnMV1oHLg":{"text":"The rooms are small but comfy and clean. The location and price were great for a girl's tr","useful":1,"cool":0},"xTDDVwAmD0BXXSgSi3CC3g":{"text":"Okay, I'll start by saying that this review is a lot of picky things.  The location is sol","useful":2,"cool":0},"TAjlqMHOVW0Xap9IEUvrwQ":{"text":"This is a large Marriott hotel with over 1200 rooms. I have stayed here many times and my ","useful":7,"cool":6},"DXjoF2YKfZpgmRapeX2YFA":{"text":"I stayed here whilst attending a conference in New Orleans I would say \"a-ok\" about sums t","useful":1,"cool":0},"1sWVFmqTcf-Bog5Kyn6vdw":{"text":"The hotel is showing it's age a bit.   It's a nice hotel but a bit dated.  When I checked ","useful":0,"cool":0},"dG_oQttjLc1KFbflA9reog":{"text":"Just arrived at 12:30 am and found that I had no room. Reservation was made 2 months ago a","useful":0,"cool":0},"nNQKzOrlQ0Q5p5TCML5lKQ":{"text":"This is the second time my family has stayed at this Marriott and we will continue to stay","useful":1,"cool":0},"-9MkW8Z3VMVfbUzZdEHIcg":{"text":"This was a great hotel, right near all the action. Seems like they are doing some renovati","useful":0,"cool":0},"SLkJDUplgus34PFyda_wOQ":{"text":"The rooms are small along with the bathroom; the bed is \"King\" size but looks like a Full.","useful":0,"cool":0},"WEAoPG-nL33ZMWu0fX0aHA":{"text":"This hotel is quite well-situated at the northern edge of the French Quarter, not far from","useful":1,"cool":0},"HmQDTGIbFE5VoWUlk48XGg":{"text":"Stay was for a small group of 25 year olds during the peak of Mardi Gras 2014 (no kids). W","useful":0,"cool":0},"QEVt49S75CWHb0QGjEccDw":{"text":"First, the location of this hotel is amazing and there is a lot to be said for that. Howev","useful":2,"cool":0},"LYtBCHFl6JGF3MOYvqAB7Q":{"text":"A friend and are came through New Orleans for the night and he suggested we user Priceline","useful":1,"cool":0},"LNS-2u8JoRZPAjJMeSNu9Q":{"text":"I stayed Saturday night to attend a wedding in the quarter. The bride had blocked off room","useful":0,"cool":0},"gG35AYOSFAawhNwLomnlKw":{"text":"I planned a surprise engagement for my girlfriend and relied HEAVILY on Aaron Lyon the Dir","useful":0,"cool":0},"E3zKLRBzDJY_2SyNMKUr3A":{"text":"You cant go wrong with a Marriott. This was no exception.  It's at a great location within","useful":0,"cool":0},"msl_Y6dVvcj03QDHJK-_4Q":{"text":"No wifi on the rooms\nNo cooler\nTv channel system is mediocre as with all hotels\nShower is ","useful":0,"cool":0},"Z0Soyom454gVXU8yulv-Og":{"text":"Plain.  If you don't mind plain rooms then you may like the Marriot on Canal Street.  I st","useful":4,"cool":1},"GU3EJX_t2e2XtpYCNUW7Iw":{"text":"Our 5 day stay this week for the Keller Williams convenition was very nice and there were ","useful":1,"cool":0},"mZL1D_EN-NpAsbryOwqtTA":{"text":"Th front desk people are very friendly and helpful. That's the only reason I'm giving it 2","useful":0,"cool":0},"PRb9_L0ad8vohJCaLN99Lg":{"text":"Location is great, near dekanter, bourbon street and lots of shops and restaurants, easy w","useful":0,"cool":0},"K3goO5q0Q_dt5gtlMcPNCw":{"text":"You're really only paying for a view , but our view was amazing . We had a corner room by ","useful":0,"cool":0},"bcyXQkcGqXezNvLFOPM6lQ":{"text":"Not a bad hotel. I needed something quick because I extended my stay for an extra day. The","useful":0,"cool":0},"Fqaa8kkKQ6A3LdJmUBk_yg":{"text":"Here for work. My room is smelly, like cigarette smoke and mildew. Bathroom tiny with pain","useful":0,"cool":0},"ceXsKmP5KI8FPuYgjOq19A":{"text":"The hotel from a far is nice, nice large tower, sign plastered all over New Orleans you wo","useful":1,"cool":0},"MvUN766SSOxwlu7bQl4LNA":{"text":"Great hotel for a great deal! We got a room here through percolating bids on Priceline for","useful":1,"cool":0},"ZHGz75hNpAdjiqNcTXtqtg":{"text":"We paid top dollar months in advance for a package that included J.azz fest and a room wit","useful":0,"cool":0},"HjYMzrKBT0wnuJVfByhXsQ":{"text":"Our stay at marriott new orleans was pretty amazing. We booked our stay last minute on pri","useful":1,"cool":0},"6EQk-evWxRGTgiZIcr6ULg":{"text":"ROOM SERVICE REVIEW\n\nI don't usually order room service when I travel because it is normal","useful":7,"cool":5},"ZnnaEQhwp0o9HvIMq7tR4g":{"text":"Recently had a weekend stay at the New Orleans Marriott. \n\nRoom was very clean and hotel w","useful":1,"cool":0},"J6G99uJ5WEoG8shEXX9hzQ":{"text":"Worst hotel we have ever stayed at. \n\nOur room smelled of mildew and there was no fan in t","useful":4,"cool":0},"Oy7kzTeQkeG77HAZv8gImQ":{"text":"This location is ideal for the visitor who wants to be centrally located without the norma","useful":5,"cool":2},"e_N3k4p1PJ1eCoCoDzBUPQ":{"text":"First and foremost, in this day and age, why does the Marriott chain think that it is okay","useful":1,"cool":0},"h5xLt2Fr-CTZ1_kjif_qiQ":{"text":"Stayed at the New Orleans Marriott for a conference.  Pros:  The rooms were clean and the ","useful":0,"cool":0},"zt1OCUuz3fjWeW0YQutejQ":{"text":"I've lived here 25 years, and my husband and I often spend the night downtown after having","useful":0,"cool":0},"Od_ZNcoGDiyCFqsGwPurUg":{"text":"Stayed here a few nights and would definitely stay here again. Staff was friendly, beds we","useful":0,"cool":0},"luVqkSuVqxp7PwFnPBZ0Jg":{"text":"We visited this hotel with young children and everything was so wonderful. The staff was e","useful":0,"cool":0},"yQQoOHHFX6T3i_p4df7Gjw":{"text":"I stayed at the Marriott during a weekend trip to New Orleans. Overall, the hotel is nice.","useful":0,"cool":0},"4zLqxFMG1Qq1NIAbAs8-6A":{"text":"Nice hotel I'm not sure if the rooms are worth staying up for overall seems to fit it with","useful":0,"cool":0},"scGGEv1nmvzP6Orq1b5EUQ":{"text":"Clean rooms, pleasant and helpful staff, and nicely decorated hotel. It's the perfect plac","useful":0,"cool":0},"nKwjZfZoPFcEUjzCx3dttw":{"text":"One of the better hotels I've stayed in in the City of New Orleans. The check-in process s","useful":0,"cool":0},"gAORXi-ao7WrGWy32pL6Pw":{"text":"Beds are comfy, staff is great! Everything is so expensive it's ridiculous!!  2 drinks $25","useful":0,"cool":0},"m-Uqce2UYEuspH9a8GHWmA":{"text":"EXCELLENT.  You don't even have to cross the street to get to the French Quarter, the famo","useful":0,"cool":0},"wmnpC8c_rjOL5Uhlb6Mg9w":{"text":"I was in New Orleans for work, the Marriott offers a great location as it's within a close","useful":5,"cool":1},"HuqKCYa_BvemsADu9FqOaA":{"text":"This is a wonderful hotel with great staff. We were on the 39th floor next to the seven el","useful":0,"cool":0},"N_D6u4y7mwu0q57KBpCrLA":{"text":"I stay at Marriotts every week. The rooms at this one are the smallest I have ever seen th","useful":0,"cool":0},"SgbUQ9Fpdz-Fh7SeXjxpMA":{"text":"3.5. No jacuzzi, and the sun doesn't always shine on the pool thanks to the two towers fla","useful":0,"cool":0},"yGrmuKr3BnXgsIZvJoGtqg":{"text":"Reviews are the first thing I look at when I choose a hotel and the other reviews almost m","useful":1,"cool":1},"CA4CiGcYTOhKEy2crx2iMA":{"text":"This hotel has a nice lobby and bar area which always seems very busy. The room here is pr","useful":0,"cool":0},"7FoLdtLHPOg9A8mBCicT8Q":{"text":"My room smelled like mold. Every morning, I woke up with terrible allergies including nasa","useful":4,"cool":0},"kkFm86URMLUe1tWdA6ssIg":{"text":"Meh. Rooms are dated and small but beds are comfortable; location is ok.","useful":0,"cool":0},"u8VwtHuIo06TvbT_vqKymg":{"text":"Hotel changed reservation from double bed to king\nReservation price was for 109 a night ho","useful":1,"cool":0},"wVt7T9jiMbDNcxzbh0JVjw":{"text":"Very Nice Hotel! The staff is professional and they all make you feel at home. My room at ","useful":0,"cool":0},"ov-BJgo7Jc_LH2HCOYt6ug":{"text":"Highly recommend! You can't beat the location; at the beginning of the French Quarter, wal","useful":1,"cool":0},"gbd7inkeFam3VgDRZ9XUYQ":{"text":"From the moment we checked-in to the NOLA Marriott on Canal the experience has set a new p","useful":0,"cool":0},"WfzYnP2CUMfMHfFTxADJcQ":{"text":"Clean, comfortable, rooms.  The M club longe is very nice serving a breakfast buffet with ","useful":0,"cool":0},"1MB1w6BfjnMjivtF9hw9lw":{"text":"We spent a night at this Marriott on our way back to Houston after a week in Florida.  My ","useful":1,"cool":1},"pYylxQwh9Xw1Ulb5M9ZOPQ":{"text":"The Marriott security beat up my boyfriend because he wanted to make it across the sidewal","useful":0,"cool":0},"MPFxZPdwZq7d2z5Rvd0eeQ":{"text":"I recently stayed at the Marriott for 1 week attending a convention.  Room was comfortable","useful":1,"cool":0},"GD6uf9YS3H-8nmu2b8HgIQ":{"text":"I stayed at this hotel because of a event/ function with my job. The staff was very friend","useful":0,"cool":0},"UcPzpncr1Sw9atj1JBTjKg":{"text":"Booked this trip on Priceline. Hotel is conveniently located with walking distance to bour","useful":0,"cool":0},"f4lyogT6P3oVpN-LloaUSg":{"text":"\"Hey Lisa, how was your last trip to New Orleans?\" \n\"OMG! Let me tell you about the racist","useful":0,"cool":0},"OGvrEtonKMgjqG05ZNivoQ":{"text":"The location is excellent. Just on the edge of the French Quarter, so you're in very good ","useful":0,"cool":0},"eQrK5A_vq2XSNUB1_7bF2A":{"text":"Nice hotel. Friendly staff. My housekeeper Tyronnesha did an excellent job everyday. Appre","useful":0,"cool":1},"cIX4lvBifUDHhvqaiicRPw":{"text":"My first time in New Orleans and decided to stay at the New Orleans Marriott Hotel. The ro","useful":2,"cool":0},"64JPFZu35CEaYRmL2_vRng":{"text":"I stay mostly in Marriott's and expect a certain level of service.  Small rooms and poor  ","useful":1,"cool":0},"8OSHoPMojA51VfUrnjgUqA":{"text":"So I lodged a complaint to corporate Marriott.  They don't want to pay for any medical tre","useful":1,"cool":0},"mqNkv4FCO-sBg-RzYtECww":{"text":"Great place to stay during Mardi Gras.  Families staying there can see parade in front of ","useful":0,"cool":0},"s8mOMzmklPyllFPNrCCsqQ":{"text":"There are so many better hotels within a block or two of this dump, do yourself a favor an","useful":0,"cool":0},"j6KqJ0ThsuM42cv00nIjew":{"text":"Typical convention style Marriott.  The lobby is always crazy busy, so be prepared to navi","useful":2,"cool":1},"AvxuiEeoATpG1gVAHtum5g":{"text":"GREAT hotel.  It's beautiful, has great views and is centrally located for us, since we li","useful":1,"cool":0},"6UAjCSjebmv9tRqqJlSXgg":{"text":"I've stayed here twice. The hotel is clean, comfortable and they don't bother you when you","useful":1,"cool":0},"SPopcOxrnO4ekOQmXnAgZw":{"text":"I stayed here last month for a conference. Its location is great as it within walking dist","useful":0,"cool":0},"oCcP_DlpDn9T0Orm8dZPjg":{"text":"Jeepers Marriott. With the exception of 3 or 4 wonderful staff members that I interacted w","useful":1,"cool":1},"zlzcPuOyVI8LmjMovD9WIA":{"text":"We didn't stay at this Marriott but stopped by the bar in the hotel to kick up our feet an","useful":0,"cool":0},"TmUeJB6C2GUO3Lr-Kc2siw":{"text":"This was one of the best hotels I have stayed at in sometime.  The staff truly exemplifies","useful":0,"cool":0},"AdItEW6zhUhey5tF-qPiIw":{"text":"I stayed at New Orleans Marriott for a conference and they accommodated our needs. We aske","useful":0,"cool":0},"ZM2XXBCh9WwHLc7Gfo6NIw":{"text":"The location of this hotel is very nice.  They are right in the middle of everything.  The","useful":1,"cool":0},"6KeWi96buaIOM8x7G8C1zg":{"text":"Another great Marriott property. The only negative I found with this hotel is that the bed","useful":1,"cool":1},"cztbLq1iT0qdz6pqSAXGrw":{"text":"Pros:\neasy access to everywhere.\nnice rooms.\n\nCons:\ncleaning crew missed our room. \nwe did","useful":0,"cool":0},"nZj5NXDLl2cu1a1Z-umSTw":{"text":"I stayed in this hotel for a professional conference.  At first glance, I thought the hote","useful":1,"cool":0},"DPoYevD96tR9UA7MVrmnNw":{"text":"Here for a conference - the rooms are pretty average.  It feels humid and damp in the room","useful":1,"cool":0},"ks0LnAc1k6fNXgRCnKv4GQ":{"text":"Stayed here for my first visit to NO. Accommodations are clean and the views are great.  T","useful":0,"cool":0},"GewHdE6t0m_VhieHuC5lBw":{"text":"Everything about this place was pleasant...the decor & staff were both very inviting and i","useful":0,"cool":0},"MZFSf0E2vZPPy0NgJboyQw":{"text":"This is a review of the conference center. Decent facilities. Limited vegetarian & vegan o","useful":0,"cool":0},"7p_IvH-EPcr3oY90uWoeIg":{"text":"Pulling up in our rental car - They have a very nice, large street-level garage to pull st","useful":0,"cool":0},"ra7ipfBSJIJu3j-wwBkw1Q":{"text":"We stayed at this hotel strictly because it was our 'assigned' hotel by the national conve","useful":0,"cool":0},"b4hc9HoTpzgttu-l3dCYdg":{"text":"While the hotel rooms we had were fine (other than a bathroom built for one person who is ","useful":0,"cool":0},"PIRFbWBas6f9JFYM5fA9UA":{"text":"Great location - easy to get to the French Quarter and the Garden District. It's only a bl","useful":1,"cool":1},"GkDneKsLctvvSmudxb7dXw":{"text":"Good hotel, staff is working hard this is Mardi Gras so I cannot fault them in anyway.  Th","useful":0,"cool":0},"SgeSyVk1ZqOBypK-0uLXMA":{"text":"The hotel is nice and has a great M Club lounge.\nMy issues are with housekeeping. We hurri","useful":4,"cool":3},"H8Z7tV2wbxlkGfihGN48YA":{"text":"While this hotel has a great location - if you want anything other than a great location t","useful":0,"cool":0},"GOmwyMUpXlQ6Gu7Lwr3BnA":{"text":"I haven't even checked in and I've already had a bad experience. This hotel doesn't offer ","useful":1,"cool":0},"YcpocPccV43yGDTrdposwg":{"text":"I like this Marriott.  The lobby is spacious and active.  The concierge lounge staff is fr","useful":0,"cool":0},"4fAJtaouOB4rpcFhdYbrbg":{"text":"Stayed the nights of 4/19-4/21 my wife had booked a king room with a view months earlier o","useful":0,"cool":0},"6B6OhCuwk4oLQHUYCVOiQg":{"text":"We've been wanting to go back to New Orleans for some time now but every time we checked o","useful":4,"cool":0},"oPdgEBMZXDlHD_GvL73dCA":{"text":"Great location.  Close to everything, street cars, bourbon street, riverwalk, casino...nee","useful":0,"cool":0},"U3Ayw43RFWmiNrw6w0V-7g":{"text":"I hate to give 3 stars but the elevators were a huge inconvenience. Everything else was gr","useful":0,"cool":0},"T4OALUN4BdmaujyWzQ2lag":{"text":"I booked this hotel for the location and good pricing on a busy weekend: Memorial Day / Wi","useful":1,"cool":0},"slFc06iRGobfTDdxlo1LQQ":{"text":"The location is brilliant, but this hotel was not a good stay. If you get a room anywhere ","useful":0,"cool":0},"9rKRABM_vFUUVjmjbR_zJQ":{"text":"Pluses\n- great view from the 40th floor.\n- wireless in the lobby is nice to have.\n- two po","useful":0,"cool":0},"MsLhy3CpTzFxTHL0gHO0hw":{"text":"Nice hotel. Comfortable and clean. Very competent and friendly staff.  I was there for a c","useful":0,"cool":0},"YpXKRdD8S8_VK2XyvHxokw":{"text":"Had a great stay this hotel was very clean. The staff was very friendly. We forgot to get ","useful":0,"cool":0},"-osFLLvATPVg1NgxMArz4g":{"text":"My stay here was fine though a little frustrating. Fine equals 3 stars, minus the the frus","useful":0,"cool":0},"C19tpKLKrfeGN36pxda4Mw":{"text":"Great beds! So close to everything! The elevators are super convenient, and it was a pleas","useful":0,"cool":0},"YgykvDBeSKuTxikG1iP7_w":{"text":"So disappointed! The two stars are for location only! I've only been here one day and I'm ","useful":0,"cool":0},"FbOcgsJr_LqFRjvoy3GvkQ":{"text":"For a Marriott I really expected more. \n\nNothing I requested was given to me. Higher floor","useful":2,"cool":1},"fm73FDpEU9tKrLfz-JohPw":{"text":"I've added a star and updated my review, because after the toilet broke once again, the ho","useful":0,"cool":0},"GgZXkcyX7sYc1Evmb3t6Gw":{"text":"Considering how much it cost to stay here(approximately $500 for 2 nights), I expected a l","useful":0,"cool":1},"pBHsqbvBgWdMGsXTQxDX5w":{"text":"Pros: I stopped in here after my flight out of New Orleans was cancelled and I had to stay","useful":3,"cool":0},"DEqFPrSVlGVJhq1BLmuvxA":{"text":"This large convention hotel is located on Canal Street, somewhat set apart from the noise ","useful":0,"cool":0},"JkhKTNZrP3h7gVMJ_eIa3A":{"text":"Definitely get a room with the river view.. the sunrise over New Orleans is just wow! Staf","useful":0,"cool":0},"GpXMLVlfFPPPQJetjdWa1A":{"text":"This is one of the swankier Marriotts I've stayed in. Very nice porter at the front door a","useful":0,"cool":0},"N09oPfOc09rQwvhtas8ZbQ":{"text":"There is absolutely nothing special about the place. For the price you pretty much get wha","useful":1,"cool":0},"aBlAWQxeAcCRFACUAlcIWg":{"text":"Checked in yesterday with a complicated reservation and they figured it out and got us to ","useful":0,"cool":0},"7DhBpNJ967URzOJ9tMOcQg":{"text":"Nice place. Right in the heart of the French quarter. A little noisy at night.","useful":0,"cool":0},"QejgtpGs1_B7V9pyYGv6Fg":{"text":"I stayed here for a weekend in January 2018. The hotel is nice and the few staff members I","useful":0,"cool":0},"91XLOOvmdE1Kci2SQevlzg":{"text":"This 4 star rating goes solely to the most delicious Bloody Mary I have ever had in my lif","useful":1,"cool":1},"BW6FThkPHYUqRNkh-jh3gQ":{"text":"TL;DL: If you ship a package here, pick it up at security, not at the FedEx store. \n\nWell,","useful":0,"cool":0},"qtByrsPtLq6QLrl5YeFrNg":{"text":"The bed is sooo comfortable, I have sunken in and don't want to get out. Huge room. Great ","useful":4,"cool":2},"wBMXYUp1f3lkYS2jVIKJEQ":{"text":"Prime location! It's walking distance from Jackson Square, cemeteries, and Bourbon street;","useful":0,"cool":0},"TnWTywCU1BXhR5RHT62mwA":{"text":"We stayed here over Mardi Gras. The Marriott is nicely situated as it is only steps from t","useful":0,"cool":0},"DB1goIGcWORc88Xflpi7Jw":{"text":"We stayed at the New Orleans Marriott for for 4 nights for one of my husband's conferences","useful":0,"cool":0},"3vrJzKRY5z32iXKf8OFTpw":{"text":"Got a really good deal on Priceline, nice hotel and room was nice and clean. Also really g","useful":0,"cool":0},"gWpfu4zQfDEzaGDis2k1jg":{"text":"In town for a conference that took place at this hotel and I had a great stay here. I was ","useful":4,"cool":5},"r_wHVhzrpkoV0t45eXTM1Q":{"text":"We got a great, last minute Priceline flight/hotel deal here. It was July 30-Aug 1; not th","useful":0,"cool":0},"J4V12rrQGJ3nwQbXoz5ELw":{"text":"Well, took the family on a vacation to see \"The Passion\" and while I enjoyed the hotel sta","useful":0,"cool":0},"ZZxSaCoU_p4wGQzWX18lzQ":{"text":"I stayed here with my boyfriend while he was at a work conference.  I really liked the fee","useful":0,"cool":0},"Xjrnat758gjKkqBlQ66K6A":{"text":"SO FAR,  .SO GREAT. Except for the shooting....\nExcellent service. Prompt,  kind,  engaged","useful":0,"cool":0},"hLYhm-0sDxF9c35iXJUR8g":{"text":"My trip through New Orleans memory lane would not be complete without touching on the Marr","useful":2,"cool":1},"ZJIW-0ufgiS1pYe46o51Xg":{"text":"i stayed here for a conference in july 2013. i found the property's amenities to be typica","useful":1,"cool":1},"DLVoaQspvAOB1N4gbP2-ZA":{"text":"The lobby is wonderful. \nThe rooms and issues we had as a large group...less than stellar.","useful":2,"cool":1},"SZly6o5gGSWfQYe_KcIw6Q":{"text":"I was told this was a 4 star hotel so I had my expectations. Long story short, the bellhop","useful":0,"cool":0},"Rtx-Q4YPHghmorvpbCOSlA":{"text":"There was a giant dark red stain on the mattress.  Best case it was mold.  I don't want to","useful":2,"cool":0},"d_FzMVzBtrd72-u59PHAzg":{"text":"Very disappointed in this Marriott.  Tired, but they are going through renovations.  Great","useful":1,"cool":0},"CWTkncGBiOJB9hjc6WYwQA":{"text":"Nice hotel, conveniently close to Bourbon and Harrah's casino. Rooms were clean and look u","useful":0,"cool":0},"HGJX_PXxu6QOpz9kJfsp-w":{"text":"My friends and I thought the location of this hotel was really good. It was easy to get ar","useful":0,"cool":0},"6vu82-tCXF34AzP3kl3tnQ":{"text":"Crappy valet and management. Let your guests know about the 20 minute grace period and don","useful":0,"cool":0},"_lUDXUa6mupZbOmNK579tQ":{"text":"Combining business with pleasure in The Big Easy?  The Marriott New Orleans is a good choi","useful":0,"cool":0},"ywzx8NlVAOxsdj2WKJAR1A":{"text":"BEWARE!! THERE ARE THIEVES WORKING AT THIS HOTEL. STAY AT YOUR OWN RISK. \n\nI stayed at thi","useful":1,"cool":0},"SsYCN8HDowQNDLTOF4Qnvg":{"text":"I stayed at the Marriott with three friends on the second night of my trip to New Orleans.","useful":1,"cool":1},"MhU4liSO6LQ09tTKmmlMbw":{"text":"I'm giving it four stars because it has a great location.  The lobby and staff were great.","useful":0,"cool":0},"QIRkxT3419dcOn1uHLFVyQ":{"text":"Stayed during the weekend of Jazz fest and the place was packed!!! Had a little issue chec","useful":0,"cool":0},"Jwv4_GD4W0AsGo7kapdXQA":{"text":"Excellent location and excellent staff!!  I was so pleased with this hotel.  Our room was ","useful":0,"cool":0},"PfwJR0hWPavFNa9wSHk_JQ":{"text":"This weekend, I had the opportunity to come back to one of the most exciting cities in the","useful":4,"cool":1},"_mIsggH24AqL95ZNNWkoRw":{"text":"I've stayed in NOLA many times.  This is a great spot.  Location is excellent; you don't h","useful":1,"cool":0},"stv1R8o4jYBnwDeFLeOwnw":{"text":"I liked the place enough for the price that I got it for, which was for about $110 on Pric","useful":0,"cool":0},"GUPzsoepkLB4nxv_PshP_w":{"text":"So this a review about the courtesy and being overly nice to us.  My wife and I were on a ","useful":0,"cool":0},"uAqaTyrHQ69eH7tZqc4PRg":{"text":"This hotel is ok. Staff is super friendly. Rooms are run-down and parking is $45. Check ou","useful":1,"cool":0},"TIyIWeJhRVH-P7ocTzeACg":{"text":"The only reason I'm giving this two stars is because of the amazing staff. If I was simply","useful":8,"cool":0},"VBS5Yj9cYnDBcs1svk5fAQ":{"text":"How do you leave a minus 10 review?  They should never reserve this room.  The loud contin","useful":0,"cool":0},"XJ4BwsaAH4Ti0-00M7sFKA":{"text":"Great location, nice rooms but unfortunately the parking situation made this experience su","useful":2,"cool":0},"5XikhAc3dN2khgUf6uxtvA":{"text":"It is a typical Marriott in a great location. Everything is in walking distance. Only comp","useful":3,"cool":0},"Ruey2kX8niGooZajgQpQ4A":{"text":"I checked into the hotel for a 6 day stay and the staff was nice and helpful.\nI got to my ","useful":0,"cool":0},"RpcMUY59nYvRpXpkSAXgFQ":{"text":"Great all around experience.  Walking distance to Bourbon Street as well as right in front","useful":0,"cool":0},"7uXWUonDOAvzoQnphNDnXg":{"text":"I am so glad I wasn't the one paying for this hotel. It was SO expensive. Because I was th","useful":1,"cool":0},"SmEIYQtXEnfGMbYQuUaoDQ":{"text":"Our stay during Labor Day/my birthday weekend was fantastic! From the moment we checked in","useful":0,"cool":0},"mJbXHGPVUBsvhIXEc47SaQ":{"text":"Some of the worst price-gouging for wifi ever. Despite booking through their website like ","useful":0,"cool":0},"VE-iMcGqJuNqVwZlSBnjXQ":{"text":"I stayed for one night recently, after an unexpected road trip detour and a frantic pricel","useful":1,"cool":0},"A-r0rWDPq9_rzICJo9cf0w":{"text":"What a complete disappointment of a hotel. \n\nThe Sheraton across the street is a thousand ","useful":2,"cool":0},"JHtdjyFH86O6NkVzND49Cw":{"text":"Great location with an on-site full service Starbucks, but rooms are a little out dated, b","useful":2,"cool":0},"fJpJAGD1-7YRZPG3v-IaKw":{"text":"My favorite affordable place to stay in downtown New Orleans. I've now stayed there twice,","useful":0,"cool":0},"8D4XR3nn-HPNtEhYFFrj_Q":{"text":"The is a large hotel located in the middle of everything. They only offer valet parking at","useful":2,"cool":1},"ZwhMvAKocBJbLnctMQ-WhA":{"text":"Found this place online browsing around. It had the best rates for the time we would be tr","useful":1,"cool":0},"0qmf4YTKdZrIthIOhXp9Yw":{"text":"For this recent New Orleans trip, we chose the Marriott, due to a great location and past ","useful":3,"cool":1},"xjq979oIs2dP15VNoykGww":{"text":"Very good experience at this Marriott! Love the tasty, complimentary beignets and starbuck","useful":0,"cool":0},"vei58l4QlW6AC-ZQeYGfPg":{"text":"If you enjoy waiting 10 minutes for each elevator, then this is the hotel for you! What in","useful":0,"cool":0},"igr2uaw3NdpWAqu79N9sWw":{"text":"This was the first time I stayed at this hotel but last time I stayed in the same area, wh","useful":1,"cool":2},"Jqa4dp6znXyGEJJf6Imo8g":{"text":"Friendly staff, perfect location, average rooms\n\nThe location is the BEST part about this ","useful":1,"cool":0},"0zPQT5GDaKJgjNL8sd5MbQ":{"text":"Our family is taking a cruise and the cruise line books the hotel. Most of our family was ","useful":0,"cool":0},"UM73nYoNZZb7ORh_p7mWGA":{"text":"I just stayed at this hotel for a conference, and have to disagree with the previous revie","useful":0,"cool":0},"DRTHfQqjrBrh2uWloozSDA":{"text":"Stay started off great as we were given a voucher for two free drinks in the bar for my mo","useful":0,"cool":0},"5Qd-ka1ZELHyMIrufeLQXQ":{"text":"There are many hotels in the area, make sure you don't choose those one!\n\nRooms are dusty ","useful":3,"cool":0},"3AvZ8UpjxTOshwmT7tbl_w":{"text":"I liked this hotel. The rooms were clean and updated. Our view of the water was nice. Chec","useful":1,"cool":1},"h3Xg9pL-_ZM4dl2fGrri-A":{"text":"We are limited to hotels with bath tubs when traveling with my brother. I hadn't stayed he","useful":2,"cool":0},"HZ9Yu16nwov27Rbs8Nasrg":{"text":"This review was removed by Yelp because they believed it was for a different hotel.\n\n\"We w","useful":0,"cool":0},"b-ZAKrGjoEXM0d-9SHD91Q":{"text":"Quite possibly the nicest hotel I have ever stayed in. Super nice front desk area with ver","useful":3,"cool":2},"krANHbbnFLm43gedPmJPIw":{"text":"I usually like Marriott hotels because they typically have good service and great faciliti","useful":0,"cool":0},"YW8U2Y8I4OqjhCImJvyawA":{"text":"We had a great experience here.  The rooms were nice, clean, and comfortable.  Location wa","useful":0,"cool":0},"L6-yH7p7GoGwmmX04ZMrjw":{"text":"This Marriott offers the same great amenities other Marriott hotels have, clean rooms and ","useful":1,"cool":0},"D9LWKqXBxZ3FAm17Expjsg":{"text":"As expected- the lobby is gorgeous, staff is very knowledgable and helpful, and the rooms ","useful":0,"cool":0},"0hhSo0B0x5C66Q7A-bX4yA":{"text":"There is nothing special about this hotel. I stayed here for 4 nights in April in a room i","useful":0,"cool":0},"EJGX4Q1w9dqEvb_rFolrUQ":{"text":"Since it was my husband and my anniversary they upgraded us to the 35th floor and surprise","useful":0,"cool":1},"sTidBJtTq5s6F1Qi60YlnQ":{"text":"We stayed here for 2 nights over July 4th.  The room and staff were amazing.  They were go","useful":0,"cool":0},"0u7KBq6S6D8Gc3K3IR1o4A":{"text":"The hotel and staff are phenomenal. So pleasant and helpful. From the housekeepers to the ","useful":0,"cool":0},"cC8lFDI47L9hqVHmQhn1pA":{"text":"Everything about this place was wonderful.\n\nCHECK-IN: Check-in was fast and easy and they ","useful":0,"cool":0},"vzqao30-3Gnqca-D-9J9mg":{"text":"First of all, Freddie in housekeeping is the BEST. He really helped us out when we needed ","useful":0,"cool":0},"c2cNHXjbjbmyeV7LXep-1Q":{"text":"I stayed here on two occasions in the past year, both as part of high-profile sporting eve","useful":0,"cool":0},"YcV3fNsAkGVS0-UzwQ6aoQ":{"text":"This Marriott is truly a gem!  I stayed there for three nights and the room was awesome, t","useful":0,"cool":0},"_OdeqI7Ha0HTYwE3virHDg":{"text":"The first time we visited NOLA (so many years ago) we stayed at the Marriott. The last tim","useful":11,"cool":7},"nWnsp5flDDGuAraQABxVsA":{"text":"If you are wise enough to book a room at the New Orleans Marriott, I hope you are lucky en","useful":0,"cool":0},"HEEXW3f4y_FM0O0CdG7nnA":{"text":"omg! amazing hotel! i love the mini fridge u can put stuff in. the m club has great breakf","useful":0,"cool":0},"KhbBEOcY0LaeC7I21kmezw":{"text":"Nice hotel right on Canal Street.  The rooms are well kept.  The breakfast is amazing.","useful":0,"cool":0},"jmBTGSF91jnEkPLewfQMhw":{"text":"Great Room - Ottoman! Entrance for luggage laden guests needs to be better marked.  Oct. 2","useful":0,"cool":0},"7aBdvrnUGdHZvgpzqg0-SQ":{"text":"Great hotel! Awesome staff! Would definitely stay there again and recommend to all my frie","useful":1,"cool":0},"W9RB-iX1zlCRvadc2d5fmA":{"text":"Nice place to stay in New Orleans. Place was clean and had friendly staff with a great loc","useful":0,"cool":0},"sZswLOEnNTGaAgWkjAVLgA":{"text":"Nice lobby.  I was impressed with the ice water they provided in the lobby for guests that","useful":0,"cool":0},"NGH4D9vEmsQ9U6A8oIwQiw":{"text":"It was super crowded when we went but typical Marriott. The front kind of flooded when it ","useful":0,"cool":0},"S_hNMJ8OO2i5msbQajOgmA":{"text":"I stayed here for a conference that was taking place at the Sheraton across the street. As","useful":3,"cool":0},"p9yQutMtcB-ClmLcBpXNog":{"text":"The hotel has a great location, however, it is in desperate need of a renovation.  The car","useful":1,"cool":0},"dgRFyXaXyS2dgCkKiytpmg":{"text":"Stayed here for a NOLA weekend.  The room is small but looks clean, comfortable bed, A/C u","useful":0,"cool":0},"IYt5IWXnS8Z_ub_EZFtsrA":{"text":"Comfortable beds. Had a great View of the city. Fancy and luxurious atmosphere. Starbucks ","useful":0,"cool":0},"2orCpw11MMMzFXsgowP6KQ":{"text":"We stayed here for a night before our cruise in the Quarter tower, 14th floor. We had a gr","useful":2,"cool":0},"GkdwcgAhHkLj9Edo8LJ5VA":{"text":"I am a platinum premium elite\nMember who travels a lot and exclusively stays at Marriott p","useful":0,"cool":0},"8X_80Mt3A01rB54dWA3yxA":{"text":"We got it for $70/night ($88 w/ all of the fees and taxes) on priceline negotiator.  The p","useful":1,"cool":0},"NwSAQodcVLxsPknb3ghVDQ":{"text":"Great location! Walking distance from Bourbon street and its in the heart of the French Qu","useful":0,"cool":0},"mhWpUjsoiSPt5UG7cmx35g":{"text":"Service was slow, you have to pay $35 a day plus taxes for parking, our tv didn't work, an","useful":1,"cool":0},"Xj5yg5ZB2ybZREnuQS7AIQ":{"text":"Always my first choice when staying in New Orleans, and I have never been disappointed.   ","useful":0,"cool":1},"vkL-w1k0utp35R0ViocY-A":{"text":"This hotel was in walking distance to the waterfront, French Quarter, Bourbon Street, shop","useful":0,"cool":0},"iAu_6IvjgQy3A_W_5t_Dhw":{"text":"We stayed here this weekend and our stay was great. We checked in and the front desk gentl","useful":0,"cool":0},"Qxt08G2AoQAVbyHZdjY9gw":{"text":"Stayed here dozens of times and always get what's expected from this quality hotel.  And I","useful":2,"cool":1},"MrmOmKiPxpukZYrsWoJASg":{"text":"This is a very busy downtown hotel.  Staff is always busy and not very friendly.  I attend","useful":0,"cool":0},"3nlWZY0LFxAeU6ftuscFRA":{"text":"Great location and in the center of everything. Only reason it's not 5 stars is because up","useful":0,"cool":0},"D8KIT3f_zxrQqDR1ydpG4Q":{"text":"Great location, nicely appointed rooms and friendly staff!  I was attending a conference a","useful":0,"cool":0},"opscPS0QJx78IAxv2lLuCQ":{"text":"I opted to spend a little more to stay at the Marriott vs one of the nearby offbeat hotels","useful":1,"cool":1},"cgi2038VEp77Zu4ILRdAEw":{"text":"I stayed here for a four day weekend and really enjoyed it. The price they quoted me was a","useful":0,"cool":0},"rS2vmGXP1XMFWN7IQlIuXA":{"text":"To counteract others:\n\nMy room did not smell of mildew, musk or smoke\nA/C is managed in th","useful":1,"cool":0},"BtzaE9xFiJS-eR5oepiz9Q":{"text":"I stayed here for a conference recently that was also in the same hotel. I had a wonderful","useful":3,"cool":0},"MCvMWCIyLxsWceC27yhRJw":{"text":"Average city Marriott.  Rooms look like any other Marriott.  Nothing super fancy, but you ","useful":0,"cool":0},"FEtVCh3HGDx6deKvlvhqig":{"text":"This is a large, beautiful hotel within walking distance of the French Quarters, fast food","useful":1,"cool":1},"yKATog4YmUSxM_3NNtKlQQ":{"text":"Check in was painless\nLobby was impressive. \nThey have staff that program the elevators fo","useful":1,"cool":0},"aM_fr5COJTEjVHsUlA6RZw":{"text":"I just returned home after a 5 night stay in this hotel. I will not stay any place else if","useful":0,"cool":0},"G35mHc3JlhKl4Cv_p3_fKA":{"text":"Elevator breaks constantly. Had to climb and descend 11 flights of stairs often. Front des","useful":0,"cool":0},"noB16b5Qe9Gwm4v9x3g1bw":{"text":"Nice hotel, decent event/business hotel (our sales mtg is here).  Staff is efficient and f","useful":0,"cool":0},"AWg5_1l4AuR9nHQzIDjlVA":{"text":"Overall Marriott have a lot of amenities that I'm happy with., My friend have the Elite st","useful":4,"cool":3},"o8WWAEHuYSRZFrH4vBuX0w":{"text":"Small Rooms.  Bathtubs will not drain.  The sheets have mold on them.  I stay in Marriotts","useful":0,"cool":0},"skIskvfdVXpb8w4iuN9N7g":{"text":"I ended up checking in very late on Sunday the 16th because of the all star game. I have t","useful":0,"cool":0},"Kn0hewfNoiJdlzcMUV2teQ":{"text":"Stayed here 3 nights during a work conference. Positives - good location, great selection ","useful":0,"cool":0},"oWYSpye-N7ZPAY5H8sf8cQ":{"text":"We had a lovely stay at the Marriott. The service and accommodations were outstanding. We ","useful":0,"cool":0},"H8uZ15UMnQUKU-ZZ9_hZbg":{"text":"Loved the location and the staff. Very responsive to room issues regarding tub drains, tak","useful":0,"cool":0},"phnvopNk9tQ7vJYpu4Ec7g":{"text":"The elevator system is incredible.  We really enjoyed our stay.  It's in walking distance ","useful":1,"cool":1},"nuctNOO2oaJvFDTYfxI8Aw":{"text":"This place is a trash can ! DO NOT STAY HERE !!!! Most filthy place I ever stood at !! And","useful":1,"cool":0},"X61y-v6P3CA0TOQgn_vsyQ":{"text":"This hotel spoiled us for any other hotel EVER!  From start to finish, every single person","useful":0,"cool":0},"ps_YgRzMgZXWB7QXB2gH7g":{"text":"Now this Hotel I love. In the quarter, afordable and clean. It is close to everything and ","useful":0,"cool":0},"LBEceqb0cbLWLfqjbMsVtA":{"text":"An amazing hotel in the heart of New Orleans.  They have an amazing staff who is able and ","useful":0,"cool":0},"L2tHfDxhslkbBwjDUjsF7g":{"text":"The rooms were small but nice, the pools were not heated but had two of different depths, ","useful":0,"cool":0},"AMMmfZqMKWT7HFg7xFCOTw":{"text":"For just picking this hotel from an address it turned out to be amazing. It is in walking ","useful":0,"cool":0},"F_okfjTuh1VmmqVRDwwXUA":{"text":"Disappointed from the start.\nBe prepared to pay more than you expected. Arrived to find ou","useful":0,"cool":0},"NrFFGPnKQ8M1ADUV7l9Q-g":{"text":"I stayed here for 2 nights for a marathons (I travel quite frequently) and I was very impr","useful":0,"cool":0},"7z5pkrBCzlPyPO7KUX4h8g":{"text":"My wife and I stayed here for our 6 year anniversary. While the room was smaller than most","useful":0,"cool":0},"zqkMp7UEgqbiNczl45FxRw":{"text":"I stayed here during a Sugar Bowl event, which I did not know about!  The hotel was packed","useful":0,"cool":1},"5tWyZRorJNNqnGCese373Q":{"text":"The New Orleans Marriott is located on Canal Street right on the edge of the French Quarte","useful":0,"cool":1},"tMBlCS79II64yEIi4pX7fA":{"text":"We enjoyed our stay at this hotel except for my bike that was locked up in the Valet area ","useful":0,"cool":0},"8zyRJHFsoAJzWtdaOuQDWg":{"text":"I do not recommend this hotel. DO NOT stay here if u have kids or don't fit comfortably in","useful":0,"cool":0},"4DpzG25BIUXx_1d4olUMsg":{"text":"As Marriott's go, this is max 2 stars hotel. My room (1501) is cramped (think: New York), ","useful":0,"cool":0},"0YuY5KfqVGiGlLodXZWvxw":{"text":"We went for Essence Fest and will DEFINITELY  return!!\n\nGreat location on Canal St near Ha","useful":0,"cool":0},"KaRpt8_brNP-O1MXw0p7iA":{"text":"I was forced to stay here for a conference.  While the people here were exceedingly nice a","useful":0,"cool":0},"ram_uqqVO6CQ3T1RMDv7Eg":{"text":"We got a great deal on Priceline to travel to New Orleans at the end of March to stay here","useful":4,"cool":2},"moJAalc51a_kxXbu-H-DQg":{"text":"Decent hotel, great location. If you like to workout in the fitness center while traveling","useful":0,"cool":0},"thjGwNGINpGME9m5AA6nNw":{"text":"Beautiful, well kept hotel located centrally between the French Quarter and the convention","useful":0,"cool":0},"7v6AzKNEg9rtcmeWlSaXGw":{"text":"The hotel was located on the busy area right beside Canal and the French Quarter. The hote","useful":4,"cool":4},"arkAzUJARQJwGTP3daDSzw":{"text":"Great location with amazing staff. The bellmen were very helpful in storing our luggage be","useful":0,"cool":0},"XWxvarkTPmXKLesQ6yctJg":{"text":"Positive experience: During check in Adrian at the desk was friendly and outgoing accommod","useful":0,"cool":0},"_uI72V0o5LoEDwE5l5srGw":{"text":"This Marriott is great for business conferences but other then that I would recommend anot","useful":0,"cool":0},"fHxev9ZpoLEex53jDBWs3Q":{"text":"I arrived to this property earlier than expected so I had to get early arrival. My king ro","useful":3,"cool":2},"TsZaJhpAx7sr_6n2i6Jdog":{"text":"Overall just OK.  As a platinum member I was underwhelmed.  Upon check in they didn't have","useful":0,"cool":0},"zEQPc2sNMUXB38tvr3zcFg":{"text":"Great location, clean & service with a smile everywhere \n\nSpecial thank you & KUDOS to Ms.","useful":0,"cool":0},"i5hONtNHBrTqet0sQ0PEFg":{"text":"Awesome experience, very clean rooms, prime location, early check in request granted. I wi","useful":1,"cool":0},"r0GGzDVvCD8wV-59RK_OfA":{"text":"Wow this place is SWANK....we originally had a reservation at a smaller and quieter hotel ","useful":0,"cool":0},"UMakLMjRpa0ekQtuadT8_g":{"text":"My wife and I had plans to stay at this hotel during our vacation to New Orleans. However,","useful":0,"cool":0},"VcxTS03xdwDhe7njUyhtOw":{"text":"I have a charge for my acct in the amount of 765. For absolutely no reason !!!!  I've call","useful":2,"cool":0},"jAi6r56szQ_keMl35kvbTg":{"text":"Location- GREAT.  just blocks away from french quarter, waterfront, and front center on Ca","useful":1,"cool":0},"43QK25aMgcTjDnQP_T12WA":{"text":"This hotel is old and needs updating. \nThe good: the M club was worth the money. Full brea","useful":0,"cool":0},"yVxs4VfZjS4qF_ySuboF1w":{"text":"The only redeeming thing about this Marriott is location.  Definitely not worthy of the Ma","useful":0,"cool":0},"aPth2UJ3LwtQBv__X8s2yg":{"text":"This is my first time staying at this particular Marriott location despite having grown up","useful":0,"cool":0},"t6IO4EH0-VUDY6q6QXFCvg":{"text":"Having stayed in this property literally 100 times or more in the distant past, we gave th","useful":3,"cool":0},"mOW_CxtQ2oxNG8zAZn7xww":{"text":"A safe place to stay close to downtown and Bourbon Street. Clean but showing it's age. No ","useful":0,"cool":0},"IQzcnFJGRBMLz3GFF0TUkg":{"text":"Just got off the phone with expedia and this hotel and they will not refund me my 300.00 d","useful":0,"cool":0},"GgZGk_rho-sFMt9oWxkGsg":{"text":"you have been warned do not stay in this hotel, abusive, unprofessional, horrible staff. h","useful":0,"cool":0},"OUMyRYPxNYl2dFJWT1YeHQ":{"text":"Great location in the French Quarter that is within walking distance of restaurants, shopp","useful":1,"cool":3},"Q6crX043ilChxhvPsdMXvw":{"text":"Stayed here for a conference. The room was very clean. The accommodations were stellar. Th","useful":0,"cool":0},"9-96jzggwUgZwmTFSpHTFg":{"text":"Stayed here 3 nights during a work conference. Positives - good location, great selection ","useful":0,"cool":0},"Ln_Fiu28qJYo6t9C3q9S4w":{"text":"I usually love Marriott Hotels and when I'm going to on a trip I always look for Marriott ","useful":1,"cool":0},"Qc4UbvXdE9ZDf-ppYtiyWA":{"text":"I can't say enough about how wonderful my wife and I were treated at the New Orleans Marri","useful":0,"cool":0},"1M6dmLXs7KX4MJTByPoW7Q":{"text":"I have a 2 because the staff is friendly but really I felt this hotel was a 1 for a number","useful":0,"cool":0},"v3jgSNmDJS0BwwduNqcx0A":{"text":"Hotel is conveniently located to the quarter but that's where the pluses end.  Pool was un","useful":0,"cool":0},"n7U3MoaoYPjPHK52_vmyXA":{"text":"This is the absolute worst Marriott experience I have ever had!  I travel both for work an","useful":0,"cool":0},"O8NL35de4u5CCgKt2umYQA":{"text":"I am staying at Marriott this weekend with family to see the Saints game. We chose Marriot","useful":0,"cool":0},"F9Od98Ap2URfGg88yx-GrA":{"text":"Great, convenient location on Canal St!  Beautiful room. The elevators are fine- you simpl","useful":1,"cool":0},"U_3wygYpUSJ-sJta0zA9oQ":{"text":"Great hotel within walking distance of all the hot spots.  However, the rooms are small. N","useful":0,"cool":0},"yY69DuYZonkeQFWYBIplpQ":{"text":"This place is beautiful but the rooms and beds aren't created for comfort. Extremely small","useful":0,"cool":0},"2Hu9AV6ufqyk32_zTbBf_w":{"text":"Me messing with the hotel Guy:\n\nGuy: You guys here for Mardi Gras?\nMe: No, is that happeni","useful":5,"cool":6},"O9q6qb5P7DGWHTsDGBGQMg":{"text":"Just wanted to say how sweet Darriel was at the business center/fedex place in the Marriot","useful":0,"cool":0},"y8mHj-LMjQCkusNbnF3VYA":{"text":"PROS:\n- Fantastic beds and pillows. Most comfortable sleep of my life!\n- Awesome bathroom.","useful":1,"cool":0},"_VI3brlNgp1pQmaaM088Fg":{"text":"I attended a conference here recently and I want to warn people that the conference people","useful":0,"cool":1},"Cd3kClqZL-32s5FZptLDjA":{"text":"I loved the hotel. Room rates were good but they gouge you on parking.  Concierge said the","useful":0,"cool":0},"P3AM3LfxslyvqZV6qdqyuw":{"text":"You need a working lift at your front door if you are a hotel and guests are going to arri","useful":0,"cool":0},"Jxen9idn1BJvigbWsNNVnw":{"text":"What Happened???\n\nMy husband and I have stayed at this hotel over the years, generally ove","useful":0,"cool":0},"SRK3Bj6LizFoROVXysFT2g":{"text":"I'm still staying here, but my room is so bad that I couldn't even wait until my vacation ","useful":0,"cool":0},"HPiXTt2vXd31pjUajhYvEQ":{"text":"Went here and booked 6 rooms for a bachelor party and it was a great location near the Fre","useful":1,"cool":0},"Xh1QMe85E8V5KpGVsxI62g":{"text":"I stayed here at the New Orleans Marriott for several days in June of 2018.  The check-in ","useful":30,"cool":25},"zxRq8PrKOA-VZIvsuadzpw":{"text":"Had a horrible experience at check-in. First the digital key didn't work and I had to go b","useful":0,"cool":0},"MoB4rmtizKw-CCcka8iPpQ":{"text":"Great hotel is a good location. Pretty central to everything, the French Quarter, CBD, War","useful":1,"cool":1},"38IdREvsooWNCmag7otn0A":{"text":"Economy service at a luxury price. Rooms are small and housekeeping doesn't show up until ","useful":0,"cool":0},"d11QBBl-mFN4L4XxoZyA5Q":{"text":"Great location!!! Close to everything, walking distance from bourbon street. Right near cv","useful":0,"cool":0},"_Vma5WK1CxR0gSgrsqJQ6w":{"text":"Out of sheer coincidence, I have stayed here during both of my visits to New Orleans, in 2","useful":5,"cool":4},"m8JYFriBtW6_v2QWXQdWVA":{"text":"This is my first time staying at this particular Marriott location despite having grown up","useful":0,"cool":0},"sfQlILrV-u6CI0cm7gGILg":{"text":"My husband, 3 year old and I stayed at this Marriott for a quick weekend getaway. It was a","useful":1,"cool":0},"aHz-WQWN17MeZDNOzOVNHg":{"text":"We got off our cruise & showed up 7 hours before check in. We had the concern of our lugga","useful":0,"cool":1},"6AVptIXdH8NB4sVcDYR_lw":{"text":"Fantastic place to go, if you absolutely hate Christmas. Lovely bar with a great selection","useful":0,"cool":0},"WfFyt8UmLaM-gk53uGiD1g":{"text":"The location is great. The rooms are a little old and musty smelling. The club room is gre","useful":1,"cool":0},"q8nASagzDtgxJdrsH_0yOQ":{"text":"New Orleans Marriott is not the cozy property that some downtown Marriott's can be.  Inste","useful":10,"cool":9},"pJNUzPG04101EATp1AW5Zg":{"text":"The price was right as my gf works for Marriott so we got a darn good deal.  Overall the p","useful":0,"cool":0},"_ce0UPpYj0mHnkrviJpUTQ":{"text":"I would give it 0 stars if I could. To begin with our room was subpar to other marriott's ","useful":0,"cool":0},"kKh79icqmp6EnJHkuuEAFw":{"text":"While this isn't the nicest hotel in NOLA, it is certainly nice enough, featuring recently","useful":0,"cool":0},"8sWyyGmJp3vrra-soFMwnw":{"text":"I was recently asked by someone where they should stay in New Orleans. Options are so over","useful":21,"cool":17},"7AyCSAxM7gJ6FKyqSeDbEA":{"text":"Very nice hotel at a great location. Could not ask for more with the room. The M Club loun","useful":2,"cool":0},"EOJU-U60de8dQiXTQoshhA":{"text":"We were on our way to a cruise and stayed here a few days prior to check out New Orleans. ","useful":0,"cool":0},"Z91GqldFxL3H18jYJiB8Yg":{"text":"Oh my goodness, I've never been treated so well at a hotel before. From the moment we got ","useful":1,"cool":2},"NUVyodi8HYgy_zVs7aiQCg":{"text":"This hotel is in a great location! When traveling- a hotels location to things I want to s","useful":1,"cool":2},"hfSZSTUrQqTpp_RNcv0pFQ":{"text":"This place was very clean staff willing to help, you do not need a rental car close to eve","useful":0,"cool":0},"hyXH50fU52crWl8ErYXEKw":{"text":"Most pleasant stay I've ever had! Gary Bailey and Iris Palma Palmia are the sweetest peopl","useful":0,"cool":0},"WSFHOvK8EVkFfVJDXSsuqw":{"text":"The elevator system is absolutely asinine. Be prepared to stand by your assigned elevator ","useful":0,"cool":0},"h6zwstETN3KNvtwoXBNLOQ":{"text":"We are so glad we stayed here! Everyone was super friendly but especially the front desk a","useful":0,"cool":0},"hm_HjPtQog_7FvP6VxldRQ":{"text":"This hotel had bad service and even worse valet. I waited hours for staff to respond to my","useful":2,"cool":0},"V42gJ8y_6KUvql9oNAlKuA":{"text":"Overall, definitely an A-okay experience at this New Orleans Marriott , even for a huge ch","useful":1,"cool":0},"SsQ0NLQNMgiXKK7bqDZI6g":{"text":"I recently held a small room block at The Marriott New Orleans and for a hotel as large as","useful":3,"cool":1},"Z-l7Yn4h_zuLCIQ5VjYm5Q":{"text":"Beautiful hotel, great location. We got a king room on the 20th floor and the view was abs","useful":0,"cool":0},"52DtGoioJz75yklrOaWrhw":{"text":"Front desk manager, Daniel Shaw, is horrible he is by far the least courteous and most dis","useful":1,"cool":0},"IdZbUfB0NVZrD4h4vpLq4A":{"text":"If you  don't mind paying for Wi-Fi don't care  if theres not place to  eat breakfast  in ","useful":0,"cool":0},"yED04QEH4YmNOlbfKRWY8w":{"text":"Great hotel wonderful front desk staff.  They are very delightful and easy to talk to.  Th","useful":0,"cool":0},"vXnqJzR9sTnnl5MY1U8Mig":{"text":"As much as my wife and I have traveled, surprisingly this was our first time in a Marriot.","useful":0,"cool":0},"lqRXHz8E4hgeHO7g6Cm41w":{"text":"I love my Marriotts! Let's start with my seamless check-in. Rhia was so sweet. She was abl","useful":10,"cool":4},"HAXlM6wTzCKtRo5yKJOO5A":{"text":"What's not to love? Convenient location in the Quarter right on Canal. Clean rooms, great ","useful":6,"cool":3},"T5ruysi01mfeBQwWoTOp5g":{"text":"This Marriott is great for conferences but other then that I would recommend another place","useful":0,"cool":0},"bNz6NMIqWFklh_92GeTfUA":{"text":"I liked the location, the check in was easy, the young lady checking me in and out was pol","useful":1,"cool":0},"XdVkirS0KBfKDl7Bym1t0w":{"text":"This Marriott hotel is a great place to stay. We enjoy every second. We stay for multiple ","useful":0,"cool":0},"Cpfgal155hXGwk07utu22w":{"text":"I'm going to begin by letting you know that I'm a Marriott Bonvoy member and the only reas","useful":1,"cool":0},"QmBcfufwBgQ4f9d__3CEUg":{"text":"Marriott Concierge lounge - if your hours say hors d'oeuvres until 10:30pm, then you shoul","useful":0,"cool":0},"w_akYmtozAypGRCZ9MjS-A":{"text":"Not to be confused with the JW Marriott across the street! Got a good deal on Priceline fo","useful":2,"cool":1},"lZ8nSfGfXy4GqQrwswb22Q":{"text":"This hotel is more than 3.5 stars! For starters the hotel is in a great location, right in","useful":2,"cool":0},"AzGOA5QvFa9Uj4Nl-Qj5wQ":{"text":"I visited here for a conference from Friday through Wednesday.  The lobby is nice and BIG ","useful":1,"cool":1},"7qKvhEIxePBENIgWbWhwqA":{"text":"Great hotel in a centralized location, close to everything, bourbon street, convention cen","useful":0,"cool":0},"dF_b1iKOGhhk11skwDuX5w":{"text":"Rooms are very nice, great location in the beginning of the French Quarter. The pool is lo","useful":0,"cool":0},"H5Ik2DPcvWrN4qln5XQrSw":{"text":"MAJOR FRAUD ALERT!\n\nBe careful giving them your credit card. We booked through a third par","useful":2,"cool":0},"-rY8XA1WZeE56eHWnfiMKQ":{"text":"We just left New Orleans after a 4 day stay this weekend with a group that booked 4 rooms.","useful":0,"cool":0},"_qP70Mdy6C6nA8Sr-fcJeA":{"text":"Hotel have a large and comfortable lobby, room is average size with average amenities.  Ba","useful":0,"cool":0},"vltWYRkkxo-b03MPwWZcog":{"text":"This hotel needs serious upgrading. I checked out of the JW Marriott New Orleans in French","useful":1,"cool":0},"YZRVkAEP3IwlS4JnAf6i2w":{"text":"Commenting only about valet !   One of the valet managers ( Evens) has the most disrespect","useful":0,"cool":0},"YkHqhCRW8gKc2uJCwyQbBQ":{"text":"I have stayed at this hotel twice, both times in the River Tower. It carries a 4-star hote","useful":0,"cool":0},"l9N2XnLvgJs0r8kEB3Cn3g":{"text":"Bathroom was extremely cramped. Bathtub in our room had numerous cracks in it. I'd suggest","useful":0,"cool":0},"7gKszFc6ajPX5cjUyfkqsQ":{"text":"I will say I'm writing this review keeping in mind that this is the Bayou Classic weekend ","useful":1,"cool":0},"ek9pgq9x7hyIIrHFIljShA":{"text":"Great property to stay at in New Orleans. Located close to bourbon street and other local ","useful":1,"cool":1},"6UbqWAigCbV-ob0bYkpp7Q":{"text":"I enjoyed my 6 night stay. The reasons I gave it four stars (would have done 4.5 but not o","useful":0,"cool":0},"nMXK1-3xnwnyvRu5nnNZXQ":{"text":"I have a beef with higher end hotels (as this Marriott is trying to be) that can't deliver","useful":1,"cool":0},"wQXdPtqANkDtcjHC7CtUAA":{"text":"Was here for business/conference. The location is great- many places within walking distan","useful":0,"cool":0},"hdRp-tizwb1oYw9_vS6AYQ":{"text":"The hotel was recently renovated so it has that just refreshed feel to it.  Open lobby wit","useful":0,"cool":0},"2tR3IR2-cWhHsHav9EZGng":{"text":"My clients know me only too well. Especially when it comes to how much I enjoy a superior ","useful":0,"cool":0},"eNuJDzSIE3eVMuZVsfWGFA":{"text":"Some of the reviews are not for the Marriott on Canel. This hotel has lots of positive thi","useful":0,"cool":0},"Q5uDSAF-tly4LxYeZZ3Lyw":{"text":"Worst customer service I've ever experienced. \nNot even a response to my concerns from man","useful":1,"cool":0},"rmkQY2foiBUloP6DXpv1MA":{"text":"Wrecked our Author Signing\n\nOMG...where do I begin?\n\nThe only reason I'm giving this hotel","useful":0,"cool":0},"DpyOLBAqkZ-RS8SDRmzZRg":{"text":"When you average it all together, it's an average hotel.\n\nExcellent location just off of B","useful":1,"cool":0},"nYQYULK9Rnx28fbNXqlnKA":{"text":"Thank you for a wonderful New Years stay! I have been to this hotel before, I believe this","useful":0,"cool":0},"XOLeou8wVQGCrRVoYTXI0Q":{"text":"Great service from Mecelle Smith during my November 2019 visit. Location right next to Fre","useful":0,"cool":0},"mJSyuViqfUxWYnviYTWWtA":{"text":"This has to be the smallest hotel bathroom I've ever seen.  The tub doesn't drain well, so","useful":2,"cool":0},"pQAcIuYoX8U9t3ms_JX8WQ":{"text":"First -  they overbooked the hotel.  I came for work and this isn't a small problem.  Whil","useful":0,"cool":1},"SxnZOgtAMhEL0-7UvDHAVg":{"text":"GGGRREAATTT!\nEverything was great.   The room, the location, the employees, the venue, the","useful":0,"cool":0},"cXyjbC-FUmNq16FihKH4_w":{"text":"Great hotel and great location. So close to all the action, and really one of the greatest","useful":0,"cool":0},"_ylRqCm4GEz7k6PKeVbUcQ":{"text":"I'm SO far behind in writing this. I can here 2 years ago for a work conference and stayed","useful":3,"cool":2},"7FuvTYoNces03vTs9v7jrw":{"text":"Though this Marriott is really an architectural nightmare from the exterior, the inside is","useful":4,"cool":1},"8VrIzn8s5s6quY08qTiiPQ":{"text":"Your hotel is decent, your rooms are decent, your tv is huge, your internet is absolutely ","useful":0,"cool":0},"1d-lFHS49MSv_M_uK4zhXQ":{"text":"Absolutely terrible. Great location. The property itself is nice. The rooms are contempora","useful":0,"cool":0},"pAh_AsjFdCV9L2Lg4PGHTQ":{"text":"Great property in the Marriott family. Very impressed as a former SPG loyalist. Location s","useful":0,"cool":0},"jLlHhHddsGw1W5pUF5ktXQ":{"text":"This review is strictly based off of my room. I stayed in room 640, which I initially thou","useful":9,"cool":0},"-zbhqAvclxykdUrEhC_NHw":{"text":"MAJOR FRAUD ALERT!\n\nBe careful giving them your credit card. We booked through a third par","useful":0,"cool":0},"Qpm0Kds9lH6GpNNfsCJLfg":{"text":"So this Marriott doesn't knock your socks off with the nicest rooms, or the most beautiful","useful":2,"cool":2},"jRoH72ZDqM-uuBX1rgNmrQ":{"text":"Needs a complete update. All fixtures are loose and falling off the wall. The staff was no","useful":1,"cool":0},"LjBr3pAOFGPIlM4WtXJHsw":{"text":"If I could give 0, I would. Bed had a huge dent in it. Black mold & missing ceiling tiles.","useful":0,"cool":0},"hWxv5frRaftrxTbmym8uxA":{"text":"As a Titanium Elite with Marriott, I only stay at Marriott properties.  I stayed here for ","useful":1,"cool":1},"_6M7Ei2v5W1e1MhRVDvADw":{"text":"Beautiful hotel but rooms Nasty!  Sami Bartels in management was rude & dismissive.  Poor ","useful":2,"cool":0},"-0v1OeN0ZzG2-wgFLV4gBg":{"text":"Due to their elevators closing within a 1/2 a sec & the buttons being on the outside of th","useful":2,"cool":0},"IU7SMljqb3g0LfOWYeIsQA":{"text":"[Don't stay here if you like hot showers in the morning or your room to be cleaned before ","useful":0,"cool":0},"lj1Zzuk6QDbF2fFWXtyKhA":{"text":"I stayed here for a girls trip, I booked my reservations over a month in advance thru my c","useful":0,"cool":0},"aa64GLb2JTp5EqblBHC1EA":{"text":"Excellent location on Canal St.\nLarge hotel with two sets of towers.\nAdequate MClub. Limit","useful":0,"cool":0},"ykBHgLCadVFxA7-GGxZ4OA":{"text":"When it comes to hotels only one word matters: LOCATION. That's what this hotel has. It's ","useful":2,"cool":0},"tIjfKany1traYU1FBKDbeA":{"text":"We booked this hotel for our first anniversary...my husband was unfortunatel crushed worki","useful":1,"cool":0},"5p6KclJzYRQaY7kTXdAkfQ":{"text":"This hotel is terrible. The lady at the front desk was rude and had a terrible attitude. M","useful":2,"cool":0},"-UXHi4tWCg_ukf7zfqSsIQ":{"text":"This hotel is in a prime location smack dab in the heart of New Orleans on Canal Street. D","useful":9,"cool":5},"vtE1ACRDwLix5r4Ds8K_Vg":{"text":"My friend and I stayed here last weekend and I must say that we were very disappointed! I ","useful":1,"cool":0},"ydB1he57UHiEfz_7HD4eXA":{"text":"Charging a ransom fee to get my own shipped goods!\n\nThis is not what I expected from a Mar","useful":0,"cool":0},"cOzpNkHbu2_3Hj2iDWwd6g":{"text":"I recently went to New Orleans for Essence Festival. We made reservations several months a","useful":1,"cool":0},"OocryoZ4jrAcwghNX5fHwQ":{"text":"Perfect location.\nIt's on the French Quarter side of Canal, a 2-minute walk to Bourbon Str","useful":0,"cool":0},"2I0BheMzMl16mnMXv__O7w":{"text":"Overall:  Finished a 5 night stay (early arrival for tourism and remaining for conference)","useful":1,"cool":2},"flYDZaWV0hbXIbinXgeeYg":{"text":"Rev for Marriott Guest Dining at the On-Site Restaurant \"409 Great Room\", located on first","useful":0,"cool":0},"XNAVgz__19YfTmd6sPWFUg":{"text":"Hmm  I don't even know. Honestly the room was fine. The view was fine. The location was fi","useful":4,"cool":1},"8seQYiRW-48dLz4OsAEGWg":{"text":"You can find better accommodations. Review contains information regarding: check-in, towel","useful":3,"cool":0},"7cZv2eJul-CjuPZzsjhlIA":{"text":"Called the day before to talk to the concierge about getting help with a group dinner rese","useful":1,"cool":3},"BjqqSCjPZ_08-kVD1l8ofg":{"text":"I have stayed at this location 2x and the first time was pleasant which prompted me to sta","useful":1,"cool":0},"MPBoPZxq18Hx5nznHR0YFA":{"text":"This is one of my favorite Marriott destination spots. I'd normally assign a 5 to this loc","useful":0,"cool":0},"Adg1isLsvsrfiSClF0gXgg":{"text":"Location is good, but the rooms are dirty and no one ever answers the phones, so no room s","useful":4,"cool":0},"gdjakWY5gBAQnXpGlzrCFg":{"text":"This is the dirtiest hotel I have ever stayed at. The evacuees from the hurricane are on a","useful":0,"cool":1},"IWu26QnhuttA_ICfRJNVxQ":{"text":"Great location! Always treated well as a Marriott member too. A special shout-out to Savio","useful":1,"cool":1},"M5Me9CeX9cBjS47ICCMK5g":{"text":"Nice location. Elevators take a little to figure out how to use, but are very efficient on","useful":1,"cool":0},"PhH-ZhW6LINFMnOhjQ6dlA":{"text":"You can't beat the location for the price, but I've come to expect a little more overall f","useful":2,"cool":0},"2IW_g1egHx_miYs6cRwQrg":{"text":"So, this is kind of a mixed bag review.  \n\nOverall, like the location of this hotel and th","useful":2,"cool":0},"8_kIuN4HsU94Uozvl5ZKHw":{"text":"I love love LOVE this hotel! Everyone there is so nice and so helpful. Room was super clea","useful":0,"cool":0},"H9Q_SqOm2dfoFQBMLOwRuQ":{"text":"Close to bourbon street but far away from most of the better places to check out if you ar","useful":0,"cool":0},"Z7cOdlCAKm_Bu0fBMQcYmg":{"text":"The New Orleans Marriott must have given my company a pretty good deal for our recent conf","useful":2,"cool":0},"nxyuJCyDjlvjWz1JCUOIqQ":{"text":"Just finished a 5 day stay at the Marriott Canal Street so I can point out the good things","useful":2,"cool":1},"4ueh2ZP3dv5RRc9CKz9LVg":{"text":"STOLE MY STUFF AND DIDN'T DO ANYTHING ABOUT IT! I immediately reported my stolen $425 doll","useful":1,"cool":0},"RjU0Jdr3D3m6oll9ZoMcaQ":{"text":"From the outside in, it does look a bit dated but the inside has definitely been renovated","useful":2,"cool":0},"j7Lbi9eh6Ux3cvAfIcR-Jg":{"text":"Atten: Frank Zumo\n\nMy five star rating is because of two employees, Ms Debra Reed (loss pr","useful":0,"cool":1},"bJ1fE50_Nf9cErBK4Qszmw":{"text":"This has always been one of may favorite hotels in New Orleans. Horrible this time! No cle","useful":3,"cool":0},"Zh6pmX3R8DT6zrrbga-yAA":{"text":"When we first arrived to the hotel we didn't know where to go. So I got out and went check","useful":0,"cool":0},"p6sHr5IZEH3fctCgYJGHIg":{"text":"It's a gorgeous hotel. We stayed here for Sugar Bowl/New Year weekend. The lobby was alway","useful":2,"cool":1},"KqEFOjo44zA05NxvMgIOOA":{"text":"Had to wait a long time to get the bartenders attention for a drink in the lobby lounge.  ","useful":0,"cool":0},"Q37bdnosZjWlETbOn6TPeA":{"text":"Stay away from this hotel.\n\nOne of the dirtiest rooms I have ever staid in. I was in the a","useful":5,"cool":0},"j2mxRBsgKK28mYkvtlFZMQ":{"text":"I was in New Orleans for my birthday last week, booked with Marriott here given my family ","useful":1,"cool":0},"ghJGhKKWD-Gah661RyXDNA":{"text":"Wonderful Hospitality. The Bell Captains go above and beyond to not only help with bags bu","useful":0,"cool":0},"GtZnvi9TkvBElJRV0JxVZQ":{"text":"Absolutely fantastic hotel\nWe were there 5 nights and each one was wonderful.  Great food,","useful":0,"cool":0},"_zzt1iJL5dcafXId7t-0oA":{"text":"I'm really confused about how this place has three and a half stars. Mold on the walls, di","useful":3,"cool":0},"DfftQO3mlSLqQ8WwxIR-Tw":{"text":"Being a platinum elite member with Marriott, my stays are usually amazing. However, this p","useful":2,"cool":2},"8NuLNYvdQk-0EstaxEbWrA":{"text":"This is just a great hotel.   One of Marriott's best.  Valet, bellhop service, front desk ","useful":1,"cool":1}}