{"lpA_OdM95FgUl6EJNMR7PQ":{"text":"Very nice people. Great place for a simple men's haircut, but if you want anything else, g","useful":0,"cool":0},"EEtZ_qLtVCs2ijLTm0UOug":{"text":"Best cut and shave ever, period. Ernie takes his time, takes in to account your previous c","useful":0,"cool":0},"WybWXQGujbNE7lDkAFoLUA":{"text":"Don't be fooled by the 1970s decor or how old you think Ernie might be. He's right on top ","useful":0,"cool":0},"3h1yf3qaViqKb4y7tB6hYw":{"text":"Ernie is the man! Old time barber shop with great service and a barber who takes his time ","useful":0,"cool":0},"J2KEyQERYrDEHQYUY5LkKQ":{"text":"5 stars \n\nThese guys were fantastic \nA phone call with an appointment 30min later \nGreeted","useful":0,"cool":0},"JU9qnLoFi6drTo6-RiNr2g":{"text":"Nice guys. But by far one of the worst haircuts I've had. I feel bad writing bad reviews b","useful":0,"cool":0},"EHJ4OI_8EMLoxnGFfZcJsQ":{"text":"Writing this review for my guy needing a hair cut while on vacation. This is a local old s","useful":0,"cool":0},"tawVJyvxTgQS5bc-ppWdyw":{"text":"The correct name for this establishment is now called, \"Mr. Jack's\"\n\nI have been to see Mr","useful":1,"cool":0},"PPO5aUH1KLtMe53yLMTLXQ":{"text":"Sub-par haircut and shave. DO NOT GO THERE!  I went in for a fade and shave and left so di","useful":0,"cool":0},"1QDM3AxG5GcideYKZnV-Rw":{"text":"Walked in this morning just after 8am without appointment. Jack already had a customer and","useful":0,"cool":0},"qsnCkmD7arlX-JhSsfw31A":{"text":"If you are anywhere in NOLA, go to Ernie's no matter how long it takes. It was the best ha","useful":0,"cool":0},"w1YJXo2WTr0B0efVV8rf5g":{"text":"This place is actually called Jack's, although I did in fact get my hair cut by Ernie.  Er","useful":0,"cool":0},"TBrgqJwIlMi6LfSiBe1-CQ":{"text":"Walked in off the street with no appointment, was just looking to get cleaned up and I cou","useful":2,"cool":0},"URSCo-ivLjbzQPmaUutSIw":{"text":"This place has been here forever and Mr. Jack knows his stuff. He's quick, the price is ri","useful":0,"cool":0},"fOgSAOR_v3dsAgZBZFWYIw":{"text":"If you're looking for a traditional barbershop, this is THE place to go in the CBD/Quarter","useful":0,"cool":0},"ylzQ0eNwlddjcx7PY2dH_A":{"text":"The place is a dump. Two old men sitting there waiting for business. Ernie the old man tha","useful":1,"cool":0},"pVi2RhEYr1M4EVTx132_cQ":{"text":"The price for a hair cut, with a razor trim, is now $25.  Still a great place for an exper","useful":0,"cool":0},"BqyzAYEikZGxvoY8KU5-lg":{"text":"This is an amazing barber place. Ernie has served New Orleans for last 57 years. Check thi","useful":0,"cool":0},"QPLnom86lK85yyLHxxWmnw":{"text":"Good haircut, friendly service. In and out quickly. Best deal in NOLA. I will be back when","useful":0,"cool":0},"pC2PaiLEhNXTxoraOq4p0g":{"text":"I came in for a head shave and had a great experience. I recommend this place for anyone l","useful":0,"cool":0},"MjVZFxURkujZOrULUiQDCA":{"text":"Stopped by as a walk-in Monday at 4pm. Sign said it was open but door was pad locked. Make","useful":0,"cool":0},"cGWtp8jBsq-2EbGNMdajUg":{"text":"Close to the Marriott, this place is a nice little old school barber shop. If you're a guy","useful":1,"cool":0},"EDJiGt7e9sDXVbtWtNOs2Q":{"text":"This place is just awesome!! Great haircut and personality. Highly recommend it everyone.","useful":0,"cool":0},"VJnqvPu_5WB8ZtwTYIbowQ":{"text":"Ernie is a nice man and a skilled barber. Nice old fashioned barber shop, quality cut with","useful":5,"cool":0},"uGGBNNGW0lB3RwdVyelRWw":{"text":"Anyone know how to get hold of this guy!?! I left some important property in his shop and ","useful":1,"cool":1},"OMZx9ts681oB_Jme25W6zg":{"text":"Been going here for 5+ years. He's been cutting hair since my boss was a boy.(He's in his ","useful":0,"cool":0}}