{"r84jZGcnuoC3uIiMDns7SA":{"text":"I have been to the Trolley Stop on 3 ocassions while staying at a nearby hotel in the Gard","useful":0,"cool":0},"TlahDUQ8y7BaQRjFU5OZlA":{"text":"I was looking to fuel up after a doctor's appointment, and what should appear as I was dri","useful":0,"cool":0},"Px09DAvCaVu9VaZy3kBARg":{"text":"Very neat building. Shaped like the trolly in town. This stop came recommend by my lyft dr","useful":0,"cool":0},"4ToN-tO1WMCg0uuEVgpafg":{"text":"Delicious food, friendly service, good prices. Open 24 hours a day. Glad to find this plac","useful":0,"cool":0},"yq4F23fab4DodtostEm4pw":{"text":"This place exceeded my expectations. I love restaurants with big menus, and they have brea","useful":0,"cool":0},"ZdsUkRghV59003gBKN4Lyw":{"text":"I visited The Trolley Stop on a Sunday afternoon during brunch hours. Our server was Charl","useful":0,"cool":0},"wUGW4ooyAHG_FAqg_MTpgw":{"text":"Stayed in New Orleans for my birthday weekend and chose to go to Trolley Stop for a late b","useful":0,"cool":0},"BPzexiJ2_fmix81BUeowSg":{"text":"Fabulous food, friendly service and great prices.  We were staying just up the road and Th","useful":0,"cool":0},"ThDf9qacb79L-97xvzNaFA":{"text":"The service here sucks the manager Michelle is very rude and also the seve Patricia. The f","useful":0,"cool":0},"rtyf3UuLRjL1yOIi4eXRBg":{"text":"It was a horrible experience. Wait time for food was long and when the food came, it was i","useful":0,"cool":0},"qdfmMkxblh9n7666bb33QQ":{"text":"I LOVE THE TROLLEY STOP! Fantastic, slice-of-life New Orleans diner. The menu is solid, th","useful":0,"cool":0},"rFj4jayg6tWrkcQOx09dPg":{"text":"Stayed at the Ponchratrain and ate here several times over the course of our week long sta","useful":0,"cool":0},"m96MxzSuI-5IrdlQbGHUfA":{"text":"This is the worst restaurant service I have ever had in my life.  Ever.  EVER!  I came her","useful":1,"cool":1},"51fPsRznfSnH3lZGa9dyWw":{"text":"My breakfast was delicious. Perfect over medium eggs, perfect bacon, solid bloody mary.","useful":0,"cool":0},"BMHS5CU3xJQY03-jdnpHBA":{"text":"We came here for brunch and got to say that neither one of us was disappointed! The place ","useful":0,"cool":0},"RyQB5SZuUEFcWLTFCvjSMg":{"text":"The food was decent. Server was ok. Super super slow. Forgot to bring out stuff. After we ","useful":1,"cool":1},"h5-DpwP8P6wXcRyNPm-JIw":{"text":"Great late night eatery. Food and service and are swift. Not very pricey. Always the late ","useful":1,"cool":1},"93X05sNolmIAw7ODEG8YtA":{"text":"Banana split pancakes. Do I need to write anything other than that?\n\nTrolley Stop seems to","useful":3,"cool":1},"AW98muHvYOAM-6qiZ-BBDA":{"text":"Ok. \nThat's the best word to describe this place. Just ok. It wasn't terrible but it wasn'","useful":0,"cool":0},"BF_n7nP0-mlUFJYp1vLt-A":{"text":"One of the best meals we had all weekend - and by far the cheapest!  The red beans and ric","useful":0,"cool":0},"cXDmViI_gSD2fgvkhLuZvg":{"text":"The barista at Haro coffee told me about this place, so off we went to get breakfast. The ","useful":0,"cool":0},"ejwq9Se135SuWrmjzyaCRg":{"text":"Good breakfast spot. Cheap, quick and taste great. Staff was awesome and on top of the cof","useful":0,"cool":0},"MxVe2HwrtUonR8Qu6BEA4A":{"text":"Great food, reasonable prices, service is adequate. I had the French Special. Simple ordin","useful":0,"cool":0},"JPSGM85gdd7jgkWCa3t-nA":{"text":"Just go here and eat. We did. Probably once a day (or middle of the night) and it's always","useful":0,"cool":0},"c7TSGEcYRDq2-GRo0vZyaA":{"text":"Went there 4 out of the 7 days we were in town. Great waiters, great crowd of locals. The ","useful":0,"cool":0},"Y6jq2yWY5UdSOClSpAGajw":{"text":"I love this place cut the hype of going to all the other big breakfast places in the city.","useful":0,"cool":0},"zStr02m3bOUtI_pnx__uxQ":{"text":"Good food and service. I had the chicken gumbo and my wife/son cheesecake and the other so","useful":0,"cool":0},"3w8UASEE-qhhxNGyHAVXYA":{"text":"I love love loooovveee trolley stop! BUT i've only went for their breakfast because it is ","useful":0,"cool":0},"aPDhRmfIMHKbo3Gt4x-gAg":{"text":"We went there the morning before we leave town.  We wanted to go to a place where the loca","useful":0,"cool":0},"beLV4zG1f7VtU3-XvnRsvQ":{"text":"Food is ok . But the staff is just a little slow had to ask for coffee and creamers multip","useful":1,"cool":0},"GYmDfQ3ALu2mLqae8l-GYw":{"text":"Got here at 220 now 318 and still no food. Love coming here for a quick bite to eat but ca","useful":0,"cool":0},"33pHNnR3_wCF3ux-3ec-3Q":{"text":"***2 Star deduction***\n\nIt's been a little while since I've been back to trolley stop so I","useful":6,"cool":1},"5Kz1Yu1Q8kPZrVuzPUsRGA":{"text":"This place is open 24hr and is pretty cheap.  Good is good but customer service was slow. ","useful":0,"cool":0},"yKCaKe-h-t3wumrcyE8Whw":{"text":"This place = 5 stars! 2 thumbs up!\n\n1 star = Novelty\n4 stars = Consistent food quality.\n\nE","useful":1,"cool":1},"oSHgOOWlVAR7yOQz5SFmeQ":{"text":"Trolley Stop was a good stop. After walking around the Garden District, we tried it for br","useful":1,"cool":0},"axdxtTPBfupJ-zFlFLMXMg":{"text":"Very good food! The fish is lightly breaded and tasty! I doubt that anything is home made,","useful":1,"cool":0},"cqcmYqpVcryJBZr_ps4mug":{"text":"We had to wait 10 minutes for them toTake our drink order then took another 20 minutes for","useful":0,"cool":0},"rF-Luf3x-DPIzDEimM_L6w":{"text":"Very interesting atmosphere. I loved the look. Food is good. Mostly deep fried, which I do","useful":0,"cool":0},"EoPEoxz-Qn4HV3HS7lfk_Q":{"text":"Great place to get some breakfast! I always get the toast grits and egg combo! Not very ex","useful":1,"cool":0},"1DQgVo-DOtLXK19EYINfVA":{"text":"Arrived before breakfast and it's past noon still waiting for my order. Friendly waitress ","useful":1,"cool":0},"VhetIAmroQAjlD-jS4E9UQ":{"text":"We come visit here EVERY time we stay in N.O. the food is fantastic and the servers are gr","useful":0,"cool":0},"RhNq4sI4Uy5S5V6F7Y-pBw":{"text":"Great food and huge portions. The prices are really affordable and the staff are excellent","useful":0,"cool":0},"7JfVfRrNbJ71PJbOugcZcw":{"text":"Went to trolley stop to make a change from my regular place (coulis). I'm a breakfast fien","useful":3,"cool":1},"FFqlh_VnXipJYXbcSSJTIg":{"text":"First time trying this place and was quite disappointed. Ordered the pigs in a blanket and","useful":1,"cool":0},"FsovaueDgxfBs4qb-6djyg":{"text":"Not liking it at all. Furniture is old and scraped. Waiter is strange to say the least. We","useful":0,"cool":0},"3pHtl8TDCVKJhZ4t7-m26w":{"text":"We came in here at like 3 in the morning and Will had a smile on his face and Serviced us ","useful":0,"cool":0},"fnIfsaWbxs8LKf2BPt41tA":{"text":"Food was ok, nothing to rave about. Waitress was friendly. Atmosphere was a little small, ","useful":0,"cool":0},"5TEHDfNY4L0IRnbq-pvttQ":{"text":"I thought I had reviewed this place long ago!  It's an urban diner, best viewed between th","useful":3,"cool":2},"ktWz1oKOfTEfWTuOzIgTHw":{"text":"Great breakfast on St Charles ave!  Must try","useful":0,"cool":0},"bVThl2Z4n-vE5QrE04yv6A":{"text":"Waitress was nice.  Oatmeal was a good portion. Prices were low.  Grits were PLAIN.  Bagel","useful":0,"cool":0},"R1mMbDk4tagrvX92eSLOVg":{"text":"This place is one of the best late night food stop! Some places start taking short cuts af","useful":0,"cool":0},"OKWvIe74pd_4gURfyDwVZg":{"text":"Stopped in for a late night bite. Service was great, and so was the food and the prices. G","useful":1,"cool":0},"MTrIKdCw2j4wE84rNUHY3g":{"text":"This is my go-to-place for a good meal at a fair price. I went here twice during my stay i","useful":1,"cool":0},"ERMsNKtZww1QIC_6Uoqc5w":{"text":"How lucky am I to have this restaurant so close to my vacation spot. The selection of brea","useful":0,"cool":0},"X1YtCTWs8QBRPYmzF09PSQ":{"text":"Fried oysters were delicious! Could do without the bagged lettuce for side salad!","useful":0,"cool":0},"FZQJuz73fUodXUoJ_o6f2Q":{"text":"Food is pretty bad. Servers are friendly. I ordered a Southern breakfast which included a ","useful":0,"cool":0},"9LUnLZsp4G6nn-jMN3r7nA":{"text":"I had breakfast here. The food was great, laid-back environment, and very reasonably price","useful":1,"cool":1},"e0BEPsHbTa0Z5_P1Vo-mlQ":{"text":"Prices are reasonable, food is good, place is cute, servers and staff are charming. So why","useful":0,"cool":0},"x9oYLgupsNGptvVVqQJv_A":{"text":"This was the best breakfast I've had in many years! It's just eggs, hash browns, biscuits ","useful":0,"cool":0},"kqXg8gZdus6pFebugL7DKg":{"text":"Went on a recommendation from a friend. It was super early but the staff was friendly and ","useful":0,"cool":0},"K65DTQ6sdlmBaZ1AJr-WJw":{"text":"Decent local spot, friendly service. Food is not fast, but waitress kept the coffee flowin","useful":0,"cool":0},"mmndmLLVjz-rZd3ZA6mtNA":{"text":"Today, after a pointless day at the DMV (I didn't have my birth certificate with me), I de","useful":0,"cool":0},"Hyp92-vmXsdjy0ypJehDCQ":{"text":"This is one of my favorite places for a quick awesome breakfast!! I've been many times and","useful":0,"cool":0},"-dfnWhyJuYpoD-PMd9Jj4A":{"text":"I love eating at the Trolley whenever I'm in New Orleans. The food is super tasty and the ","useful":0,"cool":0},"qRAJnWrDLWHlX_XymTb0kQ":{"text":"I know you shouldn't judge a spot after just one visit, but we're only here for a week and","useful":2,"cool":0},"6ZU1XfCrPPHRHj2T98NqAw":{"text":"Open 24 hrs, good food, decent prices, friendly service...what else can you ask for?\n\n1st ","useful":3,"cool":0},"WjrZJZJQg2PqBkhgkNu_og":{"text":"Went Sunday at noon. The wait was 35 minutes but the waiting crowd was slim. Down to one s","useful":0,"cool":0},"27rCgOdBRa02rKEaK3UV2g":{"text":"If I could give this restaurant a zero star I would.  We went into the restaurant at9:30 a","useful":1,"cool":0},"Bq_GOcZL1Jy1IUyPlrWgEA":{"text":"Awesome place to eat!!! Excellent service! Had southern breakfast and it wad great! Local/","useful":1,"cool":0},"eTzG3vNynMpg0wO1flsmhQ":{"text":"A sin in a place like New Orleans. I don't know where these other Yelpers were but maybe n","useful":0,"cool":0},"OJZVn_QvSZ-nPP2SxxNZgw":{"text":"Fantastic diner - just right for breakfast. Good prices, great fast service. Highly recomm","useful":0,"cool":0},"OAnclM_N07xJyM3rz_rB7w":{"text":"About a 30 minute wait on Sunday mornings but ask for a cup of coffee while you wait. Inex","useful":1,"cool":0},"CsCSQpCG1aGO95KkQW_lDw":{"text":"The morning that i was set to depart on a cruise i woke up early and went to find some bre","useful":0,"cool":0},"sybCaGq9vQVDOhnmX3srIQ":{"text":"Good food,  great waitresses,  great music, and atmosphere.  Breakfast all day which my wi","useful":0,"cool":0},"NEKLQ_xo-ES5jFh_cdym9A":{"text":"I've been coming to the Stop for breakfast, lunch, and early dinners for years. You have t","useful":0,"cool":0},"T7aWax_sNmeEd4XUaYkKzw":{"text":"A local referred us to The Trolley Stop for breakfast and, indeed, this place was filled w","useful":0,"cool":0},"V1hb44HOGOCose_6STgSJQ":{"text":"It was late, we were tired, and this place was right on the streetcar line that we would r","useful":0,"cool":0},"b0kgSQLKzLr9C-4bXOgzeg":{"text":"Loved the cozy feel of this cafe. The food was good and the service was good also.Location","useful":3,"cool":0},"SCKhDYwEcabfDOjw0F9LSw":{"text":"If I could give it fewer than 1 star I would.  I will never spend another dime in this pla","useful":3,"cool":0},"inb8UW5SJ0IvWDjElAqpfA":{"text":"I'm giving The Trolley Stop Cafe, three stars  because of the prices, portions and overall","useful":0,"cool":0},"oCwIsm6UJ5GLaKIxSzJIBQ":{"text":"Been coming here since i got of high school and it ain't changed.Still good as ever. Weath","useful":0,"cool":0},"2oRLQvEg-mF7e3q49kaGCA":{"text":"I was really looking forward to my first southern breakfast at the Trolley Stop Cafe. I or","useful":0,"cool":0},"ZIPysmSiPXadkXFOCO_xCA":{"text":"Quick service, great food. They had an early bird special listed- bacon, eggs and grits fo","useful":0,"cool":0},"EfoB9YxnEs6P4_dvrwDCUA":{"text":"This place is SOOOOO GOOOD!! A must try! I had the French toast with bacon and eggs, delis","useful":0,"cool":0},"g6a04MGhldNvbkr1QsgASA":{"text":"Went there with the family for breakfast because it was close to the hotel. No very good. ","useful":0,"cool":0},"XgF7vcDfLnu71UYbXAbUrQ":{"text":"We always stop here when we come to NOLA. Delicious comfort food. Burgers are amazing. The","useful":0,"cool":0},"rBtEyreh9n5HRLvc5eDSlA":{"text":"We went for a late break today and it was a treat. We loved the ambiance. The staff was fr","useful":1,"cool":0},"k9NLFToWq2mc1AjnWDsrcA":{"text":"I hate writing bad reviews, but I believe that al around, this is the worst dining experie","useful":2,"cool":1},"lBvyOyUDueafNxy5WqDfow":{"text":"This was my second time visiting NOLA so I wanted to hit up all the stops that I didnt get","useful":1,"cool":0},"pR4hCDAhPQMWhOcvV9ekbw":{"text":"If you look for the fancy pretty breakfast, I'd say don't even bother to stop by this plac","useful":1,"cool":0},"xv2kXgMnLDss-S3V-lAYuQ":{"text":"Unbelievable disorganized restaurant. Waited for more than 10 minutes to get someone askin","useful":0,"cool":0},"NPEmyqVUE6a1SJlPoHsjbg":{"text":"This is a nice spot for breakfast, as this was recommended by our cab driver.  It's locate","useful":1,"cool":0},"o2k9BAdemceap-BvRmQF-w":{"text":"My husband and I are staying at a nearby hotel and decided to stop in for breakfast. The s","useful":0,"cool":0},"znGiE6GzUEMPQZeHkRW9sg":{"text":"This restaurant is a fun NOLA anomaly because the vast majority of locals will look at you","useful":3,"cool":2},"Nn4FB8TSvNW1fjjXlZFDjA":{"text":"Decent breakfast with a typical diner atmosphere. Good selection of food on the menu, we s","useful":0,"cool":1},"AspFwvNqFEDGQgTEpkws-Q":{"text":"I love the way they made the stuffed omelette that look like burrito but it's not it was w","useful":1,"cool":0},"vX6wrJxPPhTkogPMLoNU8Q":{"text":"The food was just okay, service left a lot to be desired. My wife had to ask multiple memb","useful":1,"cool":1},"tOsqFGKqtFndcK3LnqUxLA":{"text":"Comfy diner in the Big Easy. If you are looking for a no frills diner with comfort food th","useful":0,"cool":0},"gtuf3X-V-gpKh2aOcWJqCw":{"text":"A giant helping of eggs served with a giant helping of Southern sass on the side? What els","useful":1,"cool":0},"PjvEmi4EavmEh4liEjuwaA":{"text":"The stuffed omelette is ridiculous. So good! Lots of people, good atmosphere and no hipste","useful":1,"cool":1},"f0HqODSpDPjnIk81j-NDOg":{"text":"Solid, classic breakfast place. The service was friendly and super fast. We were in a rush","useful":0,"cool":0},"hwE_4pIXLgAGRCgBIa5rIw":{"text":"The morning prior to our cruise my wife, Dianne and I, ate breakfast here at the Trolley S","useful":0,"cool":0},"kepP5nJEm3GaR5Rr5aTlaw":{"text":"If you are in the garden district you can't miss breakfast at the trolley stop. The countr","useful":0,"cool":0},"f-Z-KW5M1jA_ttCdJKJA5Q":{"text":"No trip to NOLA is complete unless I stop in for a good breakfast including the hot sausag","useful":0,"cool":0},"OwALFx4kKARl337r4Wq-Lg":{"text":"Great food - super long wait. They aren't shy about mentioning the wait. But no food is wo","useful":0,"cool":0},"VOLs_UJJqK-xxjqy89pXrA":{"text":"I was recommended to this historic restaurant and I was thrilled with the food quality.  B","useful":0,"cool":0},"CyZti_WEK3dQnzqDSXHD6A":{"text":"Good food, small location but they make it work. We went on a Sunday morning.   It was bef","useful":0,"cool":0},"bQmbYnxE6Q5taOD7jruqsg":{"text":"This place makes IHOP look like Ruth Chris. The food looked like it had been under a heat ","useful":1,"cool":0},"iIuQq7KnOKXbY_A8Aj6b8Q":{"text":"Great food, friendly staff and their food went well beyond our expectations. Their seafood","useful":1,"cool":0},"WQvSFKJKpfp1kKQ5Z6UA9A":{"text":"This trolley stop is great as you can hop on and take an hour or so leisurely tour of New ","useful":0,"cool":0},"fkLaVi2pe6SBRY2VRNKYiQ":{"text":"I hadn't been to Trolley Stop since before Katrina, when I decided to stop in here for a b","useful":8,"cool":4},"UtNB-uQZ7tgCdSrDCOkYLw":{"text":"We came here based on the hotels recommendation as The Trolley Stop has amazing breakfast.","useful":1,"cool":0},"ygH-9r2DMwz3JCncA10dnA":{"text":"Good service, good food, great menu selections. Food came out fast and waiter was very kno","useful":0,"cool":0},"L2rGAjNX0NxEioR0RanOgg":{"text":"Tonight management slipped.  Major event in town and the on duty manager said the wait was","useful":3,"cool":0},"jvqy06Z-1S5ubpi1SHmaWg":{"text":"I saw this place yesterday when I was walking through the garden district. It's nothing fa","useful":0,"cool":0},"80-l-Bzq3Rpqmn4iTOCbtA":{"text":"Good place to get breakfast. Good food. Lots of local and fairly cheap. So, give it a shot","useful":0,"cool":0},"ucjYWJL6sKvpOy-Dhw4-FQ":{"text":"Too many better places to eat in New Orleans. I loved the snarky attitude of the guy servi","useful":2,"cool":0},"n1V5g2KPAcjadg_xVomumA":{"text":"Great Brunch, wife and I shared a seafood platter, best fried catfish, shrimp, oysters I h","useful":0,"cool":0},"FaKQg_vlavVTS72vraR7tw":{"text":"For 3 years we have been frequenting this establishment every Halloween/Voodoo Fest weeken","useful":1,"cool":0},"8-S5IeCX-kYuYlMbCGhvpQ":{"text":"FIve-star hangover food, pure and simple. To the reviewers who say it's terrible, you must","useful":1,"cool":0},"HtxNwj5WUIC12jBgF1RPYg":{"text":"Not impressed. This was my first time believe it or not, and the best thing about it, was ","useful":3,"cool":1},"ZY0dFG9n8SdpUy01FlwLkA":{"text":"Open 24 hours--- tons of menu options -- the locals love it -- we were told to come here b","useful":0,"cool":0},"i4MuPfgU1CoiEQy9cKwElg":{"text":"The service at night is terrible. The food was not worth the wait at all. Almost everyone ","useful":0,"cool":0},"uMl2LxHfk6oE6meG7eYc5w":{"text":"Good service, good food, reasonable price. Stopped in for breakfast. Bacon & eggs came qui","useful":0,"cool":0},"LjAE-QuvJARZdZvcF3qZXA":{"text":"It took 50 minutes for us to get our food. The waitress kept saying it was on the grill. W","useful":0,"cool":0},"MnrXRQUNQdE9KNTqCRO6tw":{"text":"It's a diner, located at a trolley stop. Hence the name. Not sure how others thought it wa","useful":0,"cool":0},"MKpLmlkMRiw51b5c5RrppQ":{"text":"We were able to get in touch with the owner and he extended his apologies and took care of","useful":0,"cool":0},"bXS-ce2HBiS5C1vbeYEavA":{"text":"I'm giving this place a 3.5. \n\nPersonally, I think of this place as Nola's local iHop--not","useful":0,"cool":0},"wo9jn_d75dcH0L9kLhT7_A":{"text":"I'm giving The Trolley Stop Cafe three stars because of the price, portions and diner styl","useful":0,"cool":0},"7HptM2TMgXZuunN1fyjMoQ":{"text":"Food looks and tastes GREAT! Ask for Dana, she has a warm friendly smile that matches the ","useful":0,"cool":0},"USjLE7h_Tk7AM2D-_X5xnA":{"text":"Probably I should have ordered breakfast, but it was dinnertime. \n\nThe gumbo was good and ","useful":0,"cool":0},"mlMA65KYVHnoj0PX4WSiLg":{"text":"Great price!  Great service!  Yummy breakfast!  It was a very close walk from our hotel.  ","useful":0,"cool":0},"3CsOSrKp52eQ8-FZZg0htA":{"text":"Really great dinner there tonight. A \"1/2\" an oyster poboy and a cup of chicken and sausag","useful":0,"cool":0},"Z50AEd931m97JvntBmgXNA":{"text":"I've never given a 1 star review, but, the following is the reason why:\n\nWe walked in arou","useful":3,"cool":3},"lykYsSN5AgB7srvN6kWrzA":{"text":"Great place for early morning gatherings or afternoon breakfast cravings! The lunch food i","useful":1,"cool":0},"5l7NymrHe_IC6lquXsDeVg":{"text":"Best deal in New Orleans! Small menu, breakfast and lunch. Food is decent, pitchers of bee","useful":0,"cool":0},"hAKZ0niXVGXdIF0kNQJs0A":{"text":"Real good to eat New Orleans breakfast at the Trolley stop. I just enjoy my best breakfast","useful":1,"cool":0},"iVkxyGGP_8MhR2xqgg_amg":{"text":"I've been here a few times over the years and have always had a great meal. Great service,","useful":0,"cool":0},"3y7MD-cVeMOKaxa2GLX4NA":{"text":"The worst diner ever. 40 min wait to get seated, 50 min wait for barely adequate cold food","useful":0,"cool":0},"rysJedFaB30_0DQ0nhi9ag":{"text":"Today me and my family ate breakfast here and we loved it. Our waitress Mo was everything ","useful":0,"cool":0},"65hVe6leRClzhLIvlkKCUg":{"text":"The service here is the best thing about this restaurant. Our server was very outspoken an","useful":0,"cool":0},"RoF-AoXuNFz_UGgIsCKyiw":{"text":"After a night of drinking on Bourbon Street, breakfast sounded great. Though the food was ","useful":0,"cool":0},"WlKlNhl-FXIi867kDuULGw":{"text":"Came in on a Tuesday around 11 am with a group of three. We were quickly greeted and sat a","useful":0,"cool":0},"uJn5mUfp7YHFvymxwYbUvQ":{"text":"We enjoyed it.  It was no frills, but sometimes a good ole' plain place to eat is a good t","useful":0,"cool":0},"MxReZyaBc-89RV81JB2Jyw":{"text":"Red beans and rice was bland. It was late so pretty much anything to eat was good. The bre","useful":0,"cool":0},"sLP-d-dxAsNgQ8KJEmxTZQ":{"text":"Horrible food, nothing great about eating here. Ran out of key items, staff not friendly a","useful":1,"cool":0},"sTY7osC4Ze8j12prJ5h-jA":{"text":"The name is misleading. It doesnt really have the old trolley car turned cafe vibe.  But t","useful":0,"cool":0},"ztiw5ip5jqmaKp_3AXctBg":{"text":"I rather enjoy going to places where there are more locals than tourist, me being the tour","useful":0,"cool":0},"vmVMH_JRkka-9SuHDp7ozQ":{"text":"Had a late Breakfast here last Saturday and Sunday. The service was very fast and the port","useful":0,"cool":0},"J7X6tlJCzP1kn0HelvNRpg":{"text":"Great service and breakfast. The servers were all friendly and fast, and the food was good","useful":0,"cool":0},"_yx9GwMKt9FUKiJfu3Qpmg":{"text":"Unfortunately I wish I could have given them a 0, I was excited to try their food. My fian","useful":1,"cool":0},"wrQzeGhTJ2WoMp0I6wdHhA":{"text":"It's a restaurant that's open late but I would appreciate good customer no matter the hour","useful":1,"cool":0},"ij1d1z3iTX51OAThs4b5qQ":{"text":"I would like to give this a 3.5 star rating.\n\nAfter my friend Edward S. wrote a good revie","useful":2,"cool":3},"QkKG1i9Ipj90WYvkANOHgQ":{"text":"We were looking for a nearby breakfast spot and this was walking distance from our hotel s","useful":1,"cool":0},"jcr-H16vn-HguRgm0XbIXA":{"text":"Not very nice from outside but very good and delicious burgers. Come and get some","useful":0,"cool":0},"KFiX_N-53Y7Gs__rleP7ow":{"text":"If I could give this place a lowering rating, I would. We came in at 1:18 PM. (Party of fo","useful":2,"cool":0},"vx8cyz0mw28lM21UOAeu8g":{"text":"I ate here today and it was absolutely delicious!! No one else was there, which I found od","useful":0,"cool":0},"H4PcpDcHv961BMX4ar-WyQ":{"text":"We waited for someone to notice us for at least ten minutes. The waitress is super nice, b","useful":0,"cool":0},"EZG0rTryBpVVVN41vEj_Vg":{"text":"2:30 am worms beckoned to be fed especially since they've been an alcoholic stupor since 1","useful":1,"cool":1},"Yp7Kj8nqSqUMJrRZO9GvYw":{"text":"Waited about half an hour to be seated, but to be fair, there were a lot of us, and we nee","useful":0,"cool":0},"LL9aysEtmDc-nTABKOiXBg":{"text":"Great for a quick or sit down breakfast! The buttermilk biscuits are absolutely delicious,","useful":0,"cool":0},"YjSci4qUmEud_rFEbKlt4Q":{"text":"Good for lunch too. Had a turkey club, which was good and fresh - and came with a big mess","useful":0,"cool":0},"jfVxFSNzoFxN_tvVPNKC0g":{"text":"great atmosphere and friendly staff; open 24 hours on the weekend and til 2 p.m. during th","useful":0,"cool":0},"hUK1qnfFKuCGXneWVsKDVQ":{"text":"Old school. Fast even when packed.  Must have one hecka of a kitchen staff.  Most people o","useful":0,"cool":0},"dkpWenv-oM3AByVfRXJOKQ":{"text":"No.\nJust No.\nWaiter was nice.\n Place clean. \nFood bland to plain awful. \nFrom rubber scram","useful":0,"cool":0},"TuBVsRoNVj-LpGUG-9MPUg":{"text":"Don't waste your time coming here expecting to eat at a reasonable time. From the time we ","useful":1,"cool":0},"-So-DGqezU2NTcjbB51KTQ":{"text":"Awesome little cafe. Large menu and they serve breakfast all day. Sandwiches are great and","useful":0,"cool":0},"Dr1oS4Oe45hIVVJLd-QrtA":{"text":"This is a great place for breakfast.  The food is crazy tasty and in huge portions, the pr","useful":0,"cool":0},"hlgvMa1o5jyPPQ4rkJccKg":{"text":"Good good, slow service, great prices. Locals know a good place when they see one. Out-of-","useful":0,"cool":0},"MfNajeKNOwrYKPvEH6DS3g":{"text":"When it comes to late night dining options in New Orleans (i.e. after 3 AM), the choices a","useful":1,"cool":1},"ybCo9qHTUXYj5XNe1bvk3Q":{"text":"Great 2.99 early bird!!  Coffee kept coming-  seriously best waitress ever!!  She called m","useful":0,"cool":0},"vF2VKjN04XwWet8pY_FcdA":{"text":"I will never step foot in this place again. From the time we walked in, until 30 minuets l","useful":1,"cool":0},"mOvgiS5gB0bsF8uAzjVNXg":{"text":"Wow! This super friendly place was recommended by our Uber driver. After a small wait, we ","useful":2,"cool":1},"F6ROTB7pbeVHYNY9VgjRGw":{"text":"Pretty good food...always open....what's not to love about that.  The fish, shrimp and oys","useful":0,"cool":0},"FA0kYqlGtzowpe1qkoJueg":{"text":"This is a great place to eat. Fun and friendly staff. Delicious food for an inexpensive pr","useful":0,"cool":0},"jvqjRJv58eowCs4ryuN0oQ":{"text":"UPDATE:   Sept 23, 2007\n\nYes the restaurant is still open.    It is open for breakfast and","useful":2,"cool":0},"svyCtZRbtcB3RDAuy3SFfw":{"text":"Stopped in for lunch on mon and had a great meal and wonderful service. That is until the ","useful":0,"cool":0},"w5W8oipQFG7fg1KvR6GGaw":{"text":"come at 10 am and wait for 40 minutes without any food. 2 table ahead of me walk out witho","useful":0,"cool":0},"edOHG5e4Ife3sPKZJGFKxg":{"text":"Stopped in here just by chance driving down st. Charles saw it thought what the heck we'll","useful":0,"cool":0},"tH1GaLUvvKWqZKtJDSPQ9g":{"text":"Good food. We eat here Everytime we are in Nola. Always busy but with wait. Great breakfas","useful":0,"cool":0},"joLNOMc03a3vJvU3gYwWVg":{"text":"I love this place. I don't like their hours b/c it seems like whenever I go they are close","useful":1,"cool":0},"oqeIUIPPsWbHZqPUO18b1A":{"text":"I have to update my review. The first time we visited was great. The second time, not at a","useful":0,"cool":0},"n8NqaIwleyqVOasI3BL0EA":{"text":"I really do enjoy the Trolley Stop, especially for it's hours that cater to my drunken des","useful":0,"cool":0},"kzaoBMRZm0rwyZWSw7rFcA":{"text":"I'm probably being generous with the 3 stars because the servers seem nice here. We ate br","useful":0,"cool":0},"pcli9UEqq68z8q1LyUJyBA":{"text":"Loved the grits, greasy food, and the atmosphere.  Service was a little slow, but very fri","useful":1,"cool":1},"TAnNfJOyj_SBOivTjvW9lw":{"text":"I had not been to the Trolley Stop in a couple years. It was always a go-to greasy spoon w","useful":1,"cool":0},"xx75Y5vHTxrlVDRPwHN9Lg":{"text":"So I totally do not understand why this place is only 3.5 stars. We just moved to the area","useful":0,"cool":0},"mx14m4FtXgmFS9Lzi4uVww":{"text":"Food is good, however the service is not. The phone number on their online menu is incorre","useful":1,"cool":0},"26HDU67zbDbVbf-Qaq-L_Q":{"text":"If you're going to make breakfast such a huge part of your menu, you better do it right. S","useful":0,"cool":0},"qnv8Wm7DHL_nFlLX4a-ZLw":{"text":"If there is one thing I love more than a great burger or anything with tuna it's breakfast","useful":1,"cool":1},"OnIxCd2bqfylpYWnSMeHyQ":{"text":"The food was great. The service was amazing. My waitress  was the sweetest lady ever.","useful":0,"cool":0},"F89b41OTddNyytAL31rDpA":{"text":"Pretty cool spot. I went with a date on a Sunday morning. The server was really nice and f","useful":0,"cool":0},"zyUf3PMN9Gqb4WsABg1BvQ":{"text":"This place is AMAZING!!!! If you are hungry for breakfast this is the place to go !! The p","useful":0,"cool":0},"dRzN7d2NCm7_kkQzE85Btw":{"text":"This place was so bad it was comical...till they overcharged us. First we were told to sit","useful":0,"cool":0},"qR4p8oCsSEPwPO8ONhpGaA":{"text":"Great Breakfast.  Nice location along the streetcar line","useful":0,"cool":0},"reF42BszNDc7hsrc3-2_ZA":{"text":"Love it! Good food. Always on point when it comes to breakfast anytime of the day. When yo","useful":0,"cool":0},"kHUKaffqORJ-lWoLlZFnKQ":{"text":"On vacation with the family this past weekend, stopped here to eat because our grandparent","useful":0,"cool":0},"wrC0FkVo0qrh49d3HSCgrA":{"text":"Totally what you expected (in an awesome way)! \nAdorable diner-esque restaurant with a sou","useful":3,"cool":0},"NtGSnJh8EAianjsy82jXVw":{"text":"Three stars because the service is unbelievably awesome but i thought the food is bad. I o","useful":0,"cool":0},"AlZGg6YrPBLOonbJuhz0IQ":{"text":"It was a tasty breakfast. The service was fast. I felt like the grits were plain and they ","useful":0,"cool":0},"2EPNEXhisGICduNaP0oofQ":{"text":"First time for everything I guess, but I finally got terrible service and bad food here th","useful":0,"cool":0},"U1mCisEBfySq_j9d971Pnw":{"text":"Great food and prices- the wait can be a little long but it is well worth jt.  Don't think","useful":0,"cool":0},"HFXLoN-GmaMJFmYKHYm0Og":{"text":"Wow, wow... This place is a gem!!  Came for breakfast since close to hotel.  Absolutely wo","useful":0,"cool":1},"YTWw6MSt8xfhA3JNksNn5g":{"text":"We were asked to leave!! We were a little late in being seated with our party and were ref","useful":0,"cool":0},"KZ4qSCuCQNefT4f22NmeSA":{"text":"Recently repainted on the inside with the same old menu, Trolley Stop is still laboring on","useful":4,"cool":0},"lVxn8VUTE1XIJypZJhSFsw":{"text":"Great food, great service, great atmosphere overall. I plan to hit Trolley Stop every time","useful":0,"cool":0},"3UmEJUlTIgC08-8sVYuy5w":{"text":"Ok, it's not fancy. It's not where the action is. It won't cost an arm and a leg to eat. I","useful":0,"cool":0},"Q47XBUDCJQdRT7bz2Y_q1Q":{"text":"Fantastic place for breakfast... We've eaten there three days in a row during our stay in ","useful":0,"cool":1},"w4pVzngdhmP_8k7IYP6ynQ":{"text":"Friendly service and casual, comfortable atmosphere, but my whole wheat pancakes, while pe","useful":0,"cool":0},"Fqpb3GoR8TYihUVERmgs0w":{"text":"Cute little local place to grab some food from. We went during Essence Fest so they had a ","useful":0,"cool":0},"RN-QXHDVV_Tu-UxG6cvDaQ":{"text":"Great food excellent service. Great spot especially for breakfast and lunch. It gets crowd","useful":0,"cool":0},"Wak2zwhs7vhpwIzdOYnU9Q":{"text":"This place is exactly 'A-ok' in the best possible terms. Its your typical quick and cheap ","useful":0,"cool":0},"g43IumEiV3INIVHcIx8cUA":{"text":"So much delicious food. Such low prices. They have a bunch of foodie breakfast joints in N","useful":0,"cool":0},"uY0U7-SXRwb97QBZ4_K2IA":{"text":"Average - I got the club sandwich and was not impressed. Don't go here for a quick pick up","useful":0,"cool":0},"_kY-heV52haVapKLxOIMCg":{"text":"I didn't discover the magic that was Trolley Stop until my junior yr @ XU after Katrina. T","useful":2,"cool":1},"dw2jCLU3hXDsu6VeFIx6Xw":{"text":"We were looking for breakfast before starting our touring in NO LA and this was close to o","useful":0,"cool":0},"-cS9Dono7OAmc8x6CoEtsg":{"text":"The staff and food was fantastic. Everything was cooked to order and tasted great. I would","useful":0,"cool":0},"k8NBoWpyPhrqcf-xkGr1Pg":{"text":"First of all, great servers. My first time here for dinner, got hello's from everyone as I","useful":2,"cool":0},"eVGGhxmkRfswXdO3wOaumw":{"text":"Great menu and something for everyone. Very very reasonable on pricing and the portion siz","useful":0,"cool":0},"YSnKXydguGd3uX1HIyog_w":{"text":"Bad night for this one.  They only had one cook right after a major event when you would t","useful":0,"cool":0},"13MvZenrP01pynakVtXJXg":{"text":"This is a cute diner ready for any size party but you will wait on a sat or sun morning.  ","useful":0,"cool":0},"RbyIWrztDFbV1WUADVr7gA":{"text":"Trolley Stop was a favorite place for me to eat when visiting New Orleans which is often. ","useful":1,"cool":0},"t8YC6HKnue2hg4lfFD0pdw":{"text":"Two stars bc the service was good. Started out with a glass of water with food floating in","useful":4,"cool":0},"d_DPeh-LX77efXj6fiMLhw":{"text":"Waaaay back when I was a senior in high school and looking at colleges (in 2002), my mom a","useful":4,"cool":4},"WoUhkoUG8ev-09COJpwWiQ":{"text":"Good prices for decent greasy spoon food. The last time I ate here was for breakfast after","useful":0,"cool":0},"lDy0xB9N4CUJrI95giQgow":{"text":"The line was out the door! But it was totally worth the wait. I got the Trolley Car specia","useful":0,"cool":0},"0ovJHgwJCbsp-9bNfscJBQ":{"text":"Trolley Stop is one of those 24 hr places that serves a purpose.  If you take it for what ","useful":0,"cool":0},"EGuO4XOX0RgEpdJxQkHyDw":{"text":"With all the great restaurants in new orleans, i dont understand why anyone eats here. Fro","useful":0,"cool":0},"B8OhYq9Pv-_vsH6ETFO11A":{"text":"This is a nice little place where breakfast is served all day. My friends and I ended up h","useful":0,"cool":0},"hm9iEG6jcCRn9ZasrlPxxg":{"text":"I was upset here. The waitress was horrible and seemed to care less about the services tha","useful":0,"cool":0},"WWbyNP0bLQbvaIgpIwcJpw":{"text":"Mo was amazing! Food was great and came out quick. Thanks for the great food in Lundi Gras","useful":0,"cool":0},"g4ZAaMY4n-F2vKhym0jrWQ":{"text":"I always give a business the benefit of the doubt , but this is inexcusable. We were seate","useful":1,"cool":0},"PBmVdhzVedUKTneL4OrKyg":{"text":"Came here for breakfast straight from the airport after we landed because we were starving","useful":0,"cool":1},"cyDpMEsyxWO42zul7faQPQ":{"text":"Breakfast for dinner??\n\nNo, this is not a review of a trolley station, bus stop, or street","useful":4,"cool":3},"cvULX9DXyvs146RNo_s3UA":{"text":"Very simple and to the point. Not flashy by any means but have never had any food that was","useful":0,"cool":0},"6TxwdJK7cloicpX2Tsieiw":{"text":"Cheap, yummy breakfasts served by some very vocal waitresses. You'll be full and have a fe","useful":0,"cool":1},"iGsB2Xd-O-9QD61ET-bciw":{"text":"Haven't been in awhile but recall this place being very slow. Well no more..fast seating/s","useful":1,"cool":1},"yNYPK6-lSMovd3bYZ74OeQ":{"text":"This is the place to go for a hearty breakfast ,and its good on the pockets.  \n\nIf I had t","useful":0,"cool":0},"8dqFseIfuKXjJ61QkTjccg":{"text":"I never once went here before 3-4AM.  I haven't been in years but the best thing I remembe","useful":0,"cool":0},"sWq115dZBek88cvrUUdfHw":{"text":"I really like how cheap this place was , I didn't eat much . So I can't really give it a \"","useful":0,"cool":0},"mJNI57HCkekJE_V6nkA0sw":{"text":"Sabrina was our server. She was friendly and made us feel welcome. She told us all the spe","useful":0,"cool":0},"nKXN2CLtamgW6taaXXLxvw":{"text":"If I can give trolley stop a 0 rating I could..never have I waited 2.00 hours for no food.","useful":0,"cool":0},"MKLvjjfUJ3H1t8-Eb-vX1g":{"text":"Stopped in for a late dinner after arriving at our hotel. This place is open 24 hours so i","useful":1,"cool":0},"cHQ-_-UvfPaBTByJgDnR1A":{"text":"Great little diner! Fast, fresh cooked food at a reasonable price. Nothing fancy, just goo","useful":0,"cool":0},"6VVtmlwKMBlgK3qP1UKBmg":{"text":"We waited over an hour and a half and were never served, because after we finally ordered ","useful":2,"cool":0},"kRKCie8T5QW1r4z_luzDcg":{"text":"Very inexpensive dinning done your way to your table ASAP they are people pleasers. The me","useful":0,"cool":0},"lnpgf_WzKGi0DHKi7tlB9g":{"text":"When we walked in was no wait, which almost never happens at Trolley Stop!! Our server imm","useful":0,"cool":0},"X-W26MVlThZQEKRhUFi5MQ":{"text":"I love this place. I meet there sometimes with a friend that I don't get to talk to much. ","useful":0,"cool":0},"8ADV8L9ej08m63RY4LF12Q":{"text":"The Trolley Stop must love being next door to the Avenue Cafe, especially for early mornin","useful":3,"cool":2},"XcGjC3oUb7mz5hHVVoMncA":{"text":"Every time I come to New Orleans I have to come to Trolley Stop. They have great customer ","useful":0,"cool":1},"3euMZMmkqiBeWWvHbDYfgA":{"text":"Let me preface my comments:  The Trolley Stop is primarily a breakfast joint and that seem","useful":1,"cool":0},"BpTUyAIanuliGICGaH0JNQ":{"text":"Delicious roast beef sandwich!  It was so good that I wanted another one the next day but ","useful":0,"cool":0},"zhUmSbkWeX-psPQR9aoh4A":{"text":"Love this place! Great food, great service but be prepared to wait if busy but it's worth ","useful":0,"cool":0},"zMk2cyGrNvQLjhFUD9j71A":{"text":"5 stars because they are always really nice. But I only wish the food wasn't so bland. The","useful":2,"cool":2},"N4dW3vS0m6KlPUDNOFci5Q":{"text":"This is a good place for breakfast.  It seems to be the spot locals recommend that out-of-","useful":0,"cool":0},"clXKd9MPZm-fFHexWOC6rw":{"text":"I think the Trolley Stop is my favorite greasy spoon breakfast joint.\n\nOnce you can finall","useful":1,"cool":1},"XX9BX45gixUnHsuefyL4Lg":{"text":"This is by far the best place to eat breakfast in NOLA, it's good, it's cheap, and it's fa","useful":0,"cool":0},"6BXPsrlksx1jUWXM77Eypw":{"text":"The 8oz Barbeque Cheese burger was amazing - probably the best I've ever had.  With most b","useful":0,"cool":0},"8C1jPwzCKTZYQ_BOhw9XIg":{"text":"The food and service here was simply amazing. My family and I went there over the weekend ","useful":0,"cool":0},"3Eh2YcHIsoGBuM6-PIGvTg":{"text":"So walked in. Met by Joe and will. Awesome waiters. Food orgasmic. If you're in the area. ","useful":0,"cool":0},"-EsX7xqkq4luYIrZU0aTuw":{"text":"The service was horrible. There wasn't a lot of people in the restaurant and we waited for","useful":1,"cool":1},"GVqLirs8Qv3puTJ9Gho9xQ":{"text":"I went there couple of week the waitress was very nice, but didn't eat half my food it was","useful":1,"cool":0},"11w0OSowmfat79uw4C2uoA":{"text":"Huge menu, open all night, party in the quarter and take a cab here at 4 am, it's packed a","useful":1,"cool":0},"dfdGxYaCldnMdOxnShN85Q":{"text":"I've been coming to this restaurant since I was a kid and they've never seem to disappoint","useful":2,"cool":2},"IGDx0uR8gLGE6X1dOeeUSA":{"text":"My boyfriend and I moved here last year and with our busy schedule, we finally got a chanc","useful":2,"cool":1},"f6iRjcsjTb5wHWD4uD4r7g":{"text":"It took an hour to receive our food for them to get the order wrong. Our food was cold and","useful":0,"cool":0},"Y3obPRSooIaHfitgLw0k-Q":{"text":"We just left from here and our experience was horrible. When we walked in and waited on ou","useful":0,"cool":0},"_X2aRFnRSdiea_xoQUDcKQ":{"text":"Great 2.99 early bird!!  Coffee kept coming-  seriously best waitress ever!!  She called m","useful":0,"cool":0},"M-MPwOf-zy6elrTFN1VPSw":{"text":"Waited 45 min for take out for two overpriced breakfast sandwiches.  After we finally got ","useful":1,"cool":0},"Ls2z470lmz_aSL2qLc2YDA":{"text":"This is a very good diner. Having owned a restaurant for 15 years, I am picky. The service","useful":1,"cool":1},"8V-bTWRZgrXhDBEwqYpVcQ":{"text":"I'm not sure I am qualified to write a review on this place considering it was my 5am drun","useful":0,"cool":0},"2KGP7Mhtx_RhUrwBcKkqkQ":{"text":"This was a late night, we waited too long to get something to eat, and it was the only nea","useful":0,"cool":0},"jhmLfQGtUKVkbRR1x0S5kQ":{"text":"This place use the have good food and decent service. It now has horrible food and even wo","useful":1,"cool":1},"nFCSlyJAHMNAwFhfJ03LzA":{"text":"This place was Great as always! There \"Hash Browns\" that look almost like mash potatoes ar","useful":0,"cool":0},"FbiSji8CW3DO468eKu1gag":{"text":"We knew going in this was a diner type place. It was delicious & affordable! From the fluf","useful":0,"cool":0},"_-ikPpAwbpU9HiggrIr2zQ":{"text":"Where do i start with this place? Me and boys were looking for a place to eat late at nigh","useful":1,"cool":0},"iuc7OJO1bXurtoe-r0R4SQ":{"text":"We visited New Orleans in June, and stayed a few doors down. We often passed this place by","useful":0,"cool":0},"dSLO624AyGUA2N9JHSJvWg":{"text":"Not exactly sure what people are expecting from a diner, but for me Trolley Stop does the ","useful":1,"cool":1},"BK-1lAfjjFyf2CuAnlqK3Q":{"text":"Stayed at the Avenue for a week during final 4 wkend, walked by this place several times. ","useful":0,"cool":0},"WbahvirJwG0m9CSECQ-5Xw":{"text":"The biggest problem I have with this place is that the sign out front says \"open 24 hours\"","useful":3,"cool":0},"SN2P_QBMFOuGhOCVUKumgQ":{"text":"I have always LOVED the Trolley Stop.  The service can be a bit slow, but the servers are ","useful":2,"cool":1},"MEXIPS4fVyqmVQk7xO3YQQ":{"text":"I just got out of this place.\nI ordered a stuffed omelet and it was really good, its a big","useful":0,"cool":0},"omCV5Q-8MTcvURaGZsLFPQ":{"text":"First time In New Orleans and this is the first place we ate.  It must be a well known spo","useful":0,"cool":0},"dw7aC2OASs8m7kPWNfImYw":{"text":"Our second trip to NOLA & we were looking forward to breakfast at the Trolley Stop again. ","useful":0,"cool":0},"Sm1m7bC9qcxJSqudov8bZg":{"text":"Very good food, family time and location. The breakfast is always done right. They sell ot","useful":0,"cool":0},"0H5o_Uv7tpjWJ1ol09uKYg":{"text":"The food was amazing. I had the chicken and sausage gumbo and it was great. For entree I h","useful":0,"cool":0},"HbP71EHnAY7CR7Xm1yENNA":{"text":"First stop, the bathroom, horrible stinch.\nAir conditioner was either off or low on refrig","useful":0,"cool":0},"3VCwLAGXDnBSyRp8_idVuQ":{"text":"The grits and oatmeal are wonderful, the fried pork-chop plate is also good. Service is lo","useful":0,"cool":0},"zMNA55sVmiL9SImTji_Nlg":{"text":"The food was ok, I don't have to go back. The staff wasn't that friendly either. I had the","useful":1,"cool":0},"gj7hkYlmupAybE6b9fkisA":{"text":"Don't  do it. We came in for breakfast st lunch. They gave us under cooked eggs (raw) on t","useful":1,"cool":0},"B7WhoN-rDBC2nqN_hfy3Aw":{"text":"Country Breakfast. Douse your scrambled eggs in some Crystal Hot Sauce, add some of the co","useful":0,"cool":0},"coCDhQx_EgbRGYS-AWaf7g":{"text":"Damned good food and damned good prices weather it's breakfast lunch or dinner they do NOT","useful":0,"cool":0},"gDZHB-jemCB1Uq_udL2PpQ":{"text":"Highly disappointed..and whoever is the owner need to reconsider the kitchen staff. Waitre","useful":0,"cool":0},"_18_s08KzcedQUsrC5krvg":{"text":"Sweet service and  incredible yummy chocolate milk for $1.25. We tried to order the homema","useful":0,"cool":0},"mfuyQigGhTRV1SNRAYH3dQ":{"text":"So... Came into the restaurant and was expecting a great time.... Skurrrtttt . Talk about ","useful":1,"cool":0},"m_sTSJ3R2zJl6Ss4m8YVAg":{"text":"Comfortable easy going place with  good food with friendly service.  Great place when you ","useful":0,"cool":0},"tjDqQIVtTuLNtqb-JSwVuw":{"text":"My family are Friday night regulars.  Breakfast for dinner every Friday night.  I agree wi","useful":1,"cool":0},"WuuwfbGwKW3GUTZDhtLxLg":{"text":"We had breakfast here and it was great. It is literally next to the St. Charles St. trolle","useful":0,"cool":0},"Y1g6XzUIwxDqRIulLYdH7A":{"text":"First off if I could give this place zero stars I would. I recieved the Belgium waffle wit","useful":0,"cool":0},"RmhRiJcwnU0X3lewSoPNDg":{"text":"before katrina, this place was the best. after my husband's band played a show at tipitina","useful":0,"cool":0},"0zMbbXsB9LJFpO8bIQm8Dw":{"text":"If you're looking for a diner...here it is. Love the waitstaff. I don't find much diners i","useful":0,"cool":0},"eXKL865nQwEXCudod1XF0w":{"text":"Before heading up to Baton Rouge for an LSU game, we called ahead and placed an order for ","useful":2,"cool":2},"W2dmz7IiBH2vIvtti6ffmA":{"text":"We ate here because it was close to our hotel. My wife brought in a cup of coffee and they","useful":2,"cool":0},"kc_Rvavs__7gLfsEjdvXAw":{"text":"Ordinary food that you can find at IHOP or Dennys. Except the ham is different....probably","useful":0,"cool":0},"HqJp1dGvrM6rfTyAJ6ITNQ":{"text":"Our group has eaten here on multiple occasions. Po boy sandwiches and breakfast have been ","useful":0,"cool":0},"A44xbLyC-fPwzeqcMWZ6RQ":{"text":"This is a  Good, clean 24/7 diner. Literal feet from the St. Charles Trolley. \n\nFast and e","useful":0,"cool":0},"z5EeEIegS-iTME_GiD_2og":{"text":"Country fried steak and eggs were on point baby! The server was so courteous and pleasant ","useful":1,"cool":0},"uxzkhnrLnpKQOrflVGJpqg":{"text":"This place used to be everything after a night out on the town! Not anymore, those days ar","useful":2,"cool":0},"iGIQRcwpHhS8EELIQubexg":{"text":"This place exists for that late night hunger after pulling an all nighter at your favorite","useful":3,"cool":3},"54BlTr3MhMhYq2jCxQSWBw":{"text":"Pretty solid diner food for taking care of your some 4am hunger, although I would definite","useful":1,"cool":0},"_dE1J7zDHaZcsQSmeSx_qw":{"text":"All I will say is that I knew I was in trouble when I asked about the ice tea. It's report","useful":1,"cool":0},"-yJBuHyknM8A81G1L3e7qw":{"text":"Went here for breakfast.  The prices were good' but the food was OK at best. I had pancake","useful":2,"cool":0},"drG66w4EO1dsNtGnGMNfCQ":{"text":"Oh trolley stop! You will always be a jem in my eyes! So what if you brought out my appeti","useful":0,"cool":0},"TgXLJh6RwFxm2l5pWNyCNQ":{"text":"The chili and cheese omelette was good, chili was in the omelette. The biscuit was nice an","useful":0,"cool":0},"T0Cc48eVQ2WMlVgyLJRvGA":{"text":"Food was okay, nothing spectacular. Had a very sweet waiter that was attentive with our co","useful":0,"cool":0},"d1eq1CWrznGL606eveDPGA":{"text":"The food was very good and plentiful. We enjoyed breakfast and the service we received so ","useful":0,"cool":0},"9OOJwUHi6f2yzdjvh5tGAA":{"text":"I loved this place. It's a little hectic because it fills up quickly in the morning! I got","useful":0,"cool":0},"d4rBp1ltNi-5Gwxk4ZfexA":{"text":"Worst service EVER encountered in my life. After an hour of waiting I just canceled my foo","useful":2,"cool":0},"1_c3BriJMfNDoB9gREQsPw":{"text":"So this review is sadly an updated review. I have so many close ties to this spot. My son ","useful":7,"cool":0},"jUCdZok4GXdZRYppE4CNwQ":{"text":"The Bloody Mary contained EXACTLY one shot of vodka.  The eggs took half an hour to arrive","useful":1,"cool":0},"epOI6dXdCF4ns8vDcLwDiw":{"text":"My favorite breakfast spot in the city.  Now their are places with better food, but the fo","useful":0,"cool":0},"S5KMooOIO_lM-WhwypUWPw":{"text":"This is a great breakfast spot.  The food is great, the price is very inexpensive.  The om","useful":0,"cool":0},"ZVzIfeYPSJyBdf85P8MiBg":{"text":"I like this place so much that I hate to share the news...The food is delicious, plentiful","useful":0,"cool":0},"YL_kvbzvXDd-gOZk6FmvBA":{"text":"Trolley Stop is nothing fancy (nor healthy) but fantastic if you're dying for a greasy spo","useful":3,"cool":0},"torf1IhnkjDeqoJWWXp4hg":{"text":"This is my go-to breakfast place in NOLA. No frills or whistles, but it is predictable dec","useful":1,"cool":0},"aq_mozRN_iX9ucf1G0tEPg":{"text":"A great greasy spoon diner.  Trolley Stop provides generous portions on a fast food price ","useful":1,"cool":0},"KR4lGUhE32XlF6aLR4DWUQ":{"text":"Gordon Ramsey must not have really resonated with this bunch.  Was seated by Kenyell and w","useful":1,"cool":0},"5Vx_GkL2Vsbcblt48iVZNA":{"text":"The worst service I've ever received and i do mean worst. The hall wasn't even full, yet t","useful":0,"cool":0},"crfWlzKjzRqTeKp13eG0wA":{"text":"Cheap, yummy, sweet servers. Not too touristy if you go at the right time.","useful":0,"cool":0},"OuOmBUj9Zf6rR0QNVHmbqA":{"text":"The restaurant is no more but back in it's heydays when you were done partying around town","useful":0,"cool":0},"-xWIN2BdVDEtFLD8gJjoHw":{"text":"It's definitely not the best place in New Orleans but not the worst either. It's a 24 hour","useful":1,"cool":0},"cvkO4oOzJiBdh-F02dB3VQ":{"text":"Not SD friendly at all.........AVOID AT ALL COST!!  THEY DO NOT ALLOW ANY ANIMALS, INCLUDI","useful":0,"cool":0},"0HV4R1UMFgA0XL-ZEYo9hA":{"text":"Stating what has been said several times before, the Trolley Stop Café is a place to get b","useful":2,"cool":0},"duNN8jeSUtdaj3O6sDvYwg":{"text":"Had breakfast here one morning on our recent trip to New Orleans. Parking outside is limit","useful":0,"cool":0},"LaWeH7peciF_hwmgAiEy-A":{"text":"This place is 24 hours, most 24 hours spots are usually best for when you just had a late ","useful":0,"cool":0},"y4_EEhQAyKeIuFbTjcNtgQ":{"text":"My fav breakfast place in new Orleans. I usually go during the week and it's a good crowd ","useful":0,"cool":0},"xnAutVR_JhhKrDakWKAIxQ":{"text":"Food-4\nAmbience-3\nService-5\n\nIt seems like I always have my best meals after a long week o","useful":1,"cool":1},"d5qNlarzPT00dsCPsyhEjA":{"text":"Sad to say goodbye to a long time favorite, but we will not be back.  Too many changes.  M","useful":1,"cool":2},"wImtKHivuvKDOk5fpy2Mig":{"text":"No visit to New Orleans would be complete without a visit to the Trolley stop (and truth b","useful":0,"cool":0},"xXrjCdXnPKwSWlMHmWDNjQ":{"text":"I have been here a few times before, last time being maybe 5 months ago. My boyfriend and ","useful":0,"cool":0},"A_9sGYo8Qm1mr8dYWRPe1w":{"text":"On a recent trip to New Orleans we ate here three times. The food is absolutely awesome, e","useful":2,"cool":0},"OPX0affrvdaKmVrbZyZkCQ":{"text":"This is a fantastic restaurant!! My table had the chili burger with fries, the trolley bur","useful":0,"cool":0},"LvUDP-L8JSHgQOJh0gMUwQ":{"text":"I visit here around 21:00.\nI asked server table for one.\nShe told u can sit wherever u wan","useful":0,"cool":0},"EcaFuPYHI5sWU0tOYfm2nw":{"text":"Food was good and the service good. Somewhat of a long wait with tables open but overall a","useful":0,"cool":0},"6jX2-XJ_f5nZZdEZ2pEOlA":{"text":"Omg Im here on a trip for Spring Break and it's my first time in New Orleans. Me and my ha","useful":0,"cool":0},"lR8x9-BL5Os-CuEPzpNZPg":{"text":"the omlets were to die for.....\n\nIt is in a little broken down building that looks like an","useful":0,"cool":0},"h3ObVY5hzQp9l2OuYLu6GA":{"text":"Food and service was great. Saturday was busy. A line to get in. Small dining area. Quick ","useful":0,"cool":0},"0-Vga-CDOedimpzJAPjfdQ":{"text":"Good local breakfast place.  Way better than Please U Restaurant.  Pass on the blintzes un","useful":1,"cool":1},"UHxUqlfyIf-GThGkFM3vpw":{"text":"Food was good, plus size portions & fair prices but even though the place was not busy, it","useful":0,"cool":0},"gu1r9mazwYJh-GU5LyRH0w":{"text":"Wish I could review the food but we never got served. Walked in and no one spoke to us. We","useful":4,"cool":0},"s2tAhKAsCsiSrlbaArGIUw":{"text":"We really enjoyed the Trolley Stop Cafe. We went here right after checking into our hotel ","useful":0,"cool":0},"RmIF6uIWjVIG1ZRfpkRRyg":{"text":"We always enjoy the service and attention given by the staff! This is a traditional breakf","useful":0,"cool":0},"wNxJ-bDRLiMTaTj6ScBiug":{"text":"I love this place I always come here after having fun downtown and drinking. Service is fa","useful":0,"cool":1},"pSEfwS6g4jUeRq30WQYW1w":{"text":"Went for lunch before a Saints game and was seated quickly. We had great service. The menu","useful":2,"cool":0},"qYHcLBgGFb6sNWDsZvybJw":{"text":"My friends were in town for the NESBE (National Society of Black Engineers) Conference & I","useful":0,"cool":0},"PUSHOtzc6xVXuuq4I6Buvw":{"text":"I am a longtime Trolley Stop patron. Today, same as always, the wait staff was pleasant an","useful":2,"cool":2},"gA94lPKnL93SS-Yl25NBDA":{"text":"The best breakfast we had in New Orleans.  Reasonably priced and delicious.  The chicken i","useful":0,"cool":0},"iDpgHrVJAYkBIxxVHzl2wQ":{"text":"awesome hangover food. awesome 'i'm still drunk' food.\n\nNew orleans isn't exactly a city t","useful":0,"cool":0},"pGqt5AHUl9GX2k7oP-28_g":{"text":"The wait was crazy long... we picked a terrible time to arrive - Sunday brunch around 11am","useful":0,"cool":0},"RHaDyMBQTnsvScIhaNIBlw":{"text":"I was absolutely surprised by the new look! I love the Trolley Stop Cafe since it's been a","useful":0,"cool":0},"DigjPe7OM3B_gV9dlOZmxw":{"text":"Did the job.  Tasty food, normal selection of eggs, pancakes, potatoes, etc oh and hot cof","useful":0,"cool":0},"hZiY8thzd248kX5_qDL0Og":{"text":"The manager Kendell greeted us at the door, he was very welcoming even though it was late ","useful":0,"cool":0},"P18TO2lAEw_43QLhKZ7orA":{"text":"Avoid this place like the plague!  Gordon Ramsey came in here and messed everything up.   ","useful":2,"cool":0},"cBhX3IlEq_9bJctw15OQ7Q":{"text":"I just saw this place on Gordon Ramsay's show  and I got sick to my stomach having eaten t","useful":1,"cool":0},"_AAubXAYnluQ4sZEQV-C7g":{"text":"While exploring the Garden District we became hungry for beer. True story. So we stopped i","useful":0,"cool":0},"BQv14TGz4huF8a9FJWazAA":{"text":"Mardi Gras anyone?  The TS is a must stop place for any late night or post church service ","useful":1,"cool":1},"KyhZkk_Q3pnq7hlSjGXqJA":{"text":"We visited this spot twice in a matter of days and experienced good ol' southern hospitali","useful":2,"cool":1},"INaXqR8SKsEOIvL-fhA4vw":{"text":"Just got to town after missing our flight and was starving. Came across this little cafe a","useful":1,"cool":0},"M8zqcAWNK5AQMnVYnyKAIQ":{"text":"Excellent breakfast options. Everything is reasonably priced. I ordered the French special","useful":1,"cool":0},"l1dOlczy9a4V89MlE3m3og":{"text":"I ordered the shrimp omelet and the flavor was out of this world. The price is fantastic a","useful":0,"cool":0},"lXWfTkPo6WqRCrIUVSEuHw":{"text":"Kind of strange location for this diner.  A little off of Saint Charles, in a building par","useful":2,"cool":1},"Dn8VavOssHycAM9Fwq0vyg":{"text":"Heard about the Trolley Stop from some locals and was not disappointed.  Extensive menu wi","useful":0,"cool":0},"VdYzJq8fjqhMIAdOqm7lrQ":{"text":"Open 24 hours.. a short hotel ride from Downtown Hotels. Nice spot where locals go. Very g","useful":0,"cool":0},"iD0eY5X2q2QrH39tnd0U6w":{"text":"Pretty fun spot. Food is decent. Prices are okay.\n\nThe pancakes were the highlight of the ","useful":3,"cool":2},"qNGZGo-sfqor9K7Cwnk1IA":{"text":"It's open late so that's a plus.   They serve breakfast food late night, so that's a good ","useful":2,"cool":0},"jXaD6faJC7zngpfd2K9ruQ":{"text":"Well, first off they didn't have half of what was on there menu, no chicken and no fish. T","useful":0,"cool":0},"1rEBVYzS_ulFj0_Hd3HESg":{"text":"Breakfast was tasty but cool.  Probably sat in kitchen too long.  Service was a bit slow. ","useful":0,"cool":0},"2wTpZVAuhkgh4rI9Sve7Xg":{"text":"My fiancee picked me up for lunch today and we were looking for something quick and easy, ","useful":13,"cool":7},"cDL0GYx8H6pQQY79TRYr9Q":{"text":"The new menu is not as good as before.  The service is good, but the menu  is limited.  Th","useful":0,"cool":0},"u2H-jp7Eg9orNYwmkOhONw":{"text":"Great food. Portions are very generous and great tasting. Service was great too. The place","useful":0,"cool":0},"hprYbPt1tmA3hTsM_pqQww":{"text":"Another gem in St Charles, open late so you can grab a full meal at any time of the day. I","useful":1,"cool":0},"jSAHdZhtxt5iKws9Q67Yyw":{"text":"This is usually our after partying all night stop when we're full of libations. Things wer","useful":5,"cool":4},"bt_TICIODb1S158kDhNDTg":{"text":"Not impressed with the service and the food. Had the breakfast plate with pancakes, but th","useful":1,"cool":1},"7b5FLmYLrFgh05pMHj9w5g":{"text":"Isn't this place closed?  I don't think it reopened after Gustva.\n\nAnyone know anything mo","useful":0,"cool":0},"snWDf3uYt0Q2Hkk5gNDFRg":{"text":"Not a good visit for me.   There was about a 20 minute wait and then another 10 minutes to","useful":2,"cool":0},"gO4LsbWd325R6ts_P1bb7g":{"text":"My party and I searched Yelp for a cheap breakfast spot and stumbled upon this gold mine! ","useful":0,"cool":0},"XffHWROhVLuMZV-YGmwqyg":{"text":"I had a taste for pancakes, eggs and bacon and this was one of the first places that cross","useful":2,"cool":1},"m4X3tU67RXeXwPPHpxk13Q":{"text":"Great place for a casual breakfast in the Garden District right off the Trolley before tac","useful":1,"cool":0},"KGlKSVonSLEG_0qlzIkOHg":{"text":"Good breakfast spot.  Lots of locals and nearby parking is usually available.  Breakfast a","useful":2,"cool":1},"Z-gOZUPv7XCnv0f9fcDhLw":{"text":"This Place!  Wow, this Place!!!  We love it!  We take the Garden district trolley and get ","useful":0,"cool":0},"9l8oUxNsQj2t9dRcXo_PNg":{"text":"This place is weird as hell. The staff is great and the customers (myself excluded) should","useful":1,"cool":1},"QViIv2qQ7RxwW-e686GUhA":{"text":"Came late night with my kids after getting into town. The food was reasonably priced, larg","useful":0,"cool":0},"Dof8Ir-My3UxvXYWbmSjNg":{"text":"Came here based on a recommendation from the hotel staff. This is a 24 hr joint that serve","useful":1,"cool":0},"ILlQR55it0AhdtqrT5-BZA":{"text":"Ive been a customer here for many years! Its my \"go to\" place for late night eats, & where","useful":1,"cool":0},"W1jvZ6m5K24lE-BUYIAmJA":{"text":"This is a difficult one. \n\nWhile my server was very cool in charging me only for toast and","useful":2,"cool":2},"adtCms0xhza8AoN6jwF3eA":{"text":"I used to love this restaurant. I used to come here all of the time, especially on late ni","useful":3,"cool":1},"zEpxWtGDgti1rp3dtr1-6A":{"text":"After waiting almost an hour for our food my pancakes were cold and the cheese grits were ","useful":0,"cool":0},"mgZhip9W9geptlM50okBog":{"text":"This is a great spot for breakfast that we heard about from the locals and would suggest t","useful":0,"cool":0},"eyu-4F9TSKvxRan_9Arvsw":{"text":"This place is not worth the time or the money. Service is extremely slow and the food is l","useful":0,"cool":0},"le3TbZ8B8gxmozxLR6NlUQ":{"text":"Great spot for breakfast anytime of the day! Just remember to order as soon as you are sea","useful":0,"cool":0},"fdxKE1yzwfHzhF2eEzh4YQ":{"text":"This place was down the street from my hotel and was on Gordon Ramsey's Hell and Back show","useful":2,"cool":0},"PfsEgyDvqvp9mb1lE9JE8A":{"text":"Very cool decor and it looks nice, so we were hopeful. I got the red beans and rice with s","useful":1,"cool":0},"HbDlFjLw45iGmJEgMIu_9A":{"text":"Went here after Halloween. Received good service and food. Jambalaya was tasty! Our waiter","useful":0,"cool":1},"vvB97YKab0TxIfbO6bv9Rw":{"text":"Breakfast was good as usual, however the old menu with many different items had been repla","useful":1,"cool":1},"q9NlLPenmxyk1a8qw0rEjw":{"text":"Okay! So I always grab breakfast here before a Saints home game, which is always phenomena","useful":3,"cool":0},"EudQ0ju24pPtEzZKvRUohg":{"text":"MIMOSA ALERT\n$6 Glass\n$10 Carafe (3-4 glasses)\n$14 BOTTOMLESS \n\nService is personalized an","useful":2,"cool":1},"XsGvYx-v6eobH7296LjmYQ":{"text":"This place is  great for breakfast. I always have the center cut pork chops, which you can","useful":1,"cool":1},"gycv3I3U1UKhnbbaVn9MPw":{"text":"Well, just let me say this was my second attempt to eat here. The first time i literally w","useful":2,"cool":1},"jc-oYxN2e3shJZHvKkNH0g":{"text":"My best friend and I came here after the weeknd concert in May. Food was horrible but serv","useful":0,"cool":0},"Blo0_J-W0vtKcGSH_2N7vA":{"text":"Great service,  but food could have been warmer. It was eatable,  but not out of the pan h","useful":0,"cool":0},"aMGl08lUz1VQlaWIku52vA":{"text":"Great for breakfast all day. Hubby had liver and eggs and couldn't stop raving. Not my thi","useful":0,"cool":0},"2hzus4eXGpLm_0R29qGkxw":{"text":"Ummm, I've been eating at the Trolley for about 18 years now. And something has definitely","useful":1,"cool":1},"CJlsUvUBKxZsjCkcrHRjLw":{"text":"My family and I stumbled upon this little gem while visiting NOLA for my brother's birthda","useful":1,"cool":1},"pSqBI1Dhy_OQCcsL1JZr2Q":{"text":"Soooo good and great staff. I had the pork chops and eggs and hash browns. My picky grandd","useful":1,"cool":0},"euupx5xDKWmaVD5pwKAalg":{"text":"Not what it used to be. I'm sitting at our table still waiting for coffee. We've been here","useful":0,"cool":0},"UUXOcmw_S8FgUNP_DszoKQ":{"text":"It's been years since I've been to Trolley Stop. Decided today would be the day. I could t","useful":1,"cool":0},"BsFh1U44_mmXdgSpzBnI4w":{"text":"I have been going to this place for at least 10 years.  Only went for breakfast, never had","useful":2,"cool":2},"D-M63Va4iL6mYKrhJSwkRA":{"text":"Sunday morning breakfast diner spot. Straightforward good traditional Southern stuff. Good","useful":0,"cool":0},"NXMNsge4HeJuB_JBFiuuRw":{"text":"I highly recommend this place. I've been here twice now and the service was great. This ti","useful":3,"cool":0},"fr_HCtcjrHLZH4bAevEMaA":{"text":"One of the classic old-school New Orleans diners.  Can't be beat.  Great service.  Great p","useful":0,"cool":0},"vnaNFqMEDHx14nhSrX5mbA":{"text":"After watching the renovation of the Trolley Stop Cafe' on Gordon Ramsay's 24 hours to Hel","useful":3,"cool":0},"67f4sEcDBuGJcmWG_QVE2w":{"text":"The menu looked amazing. We wanted to try everything.  The service was not good we waited ","useful":2,"cool":0},"DXFc8KbZOLlWSUbMaIfBXg":{"text":"What kind of food do they have??? Before church food, after church food, just getting home","useful":1,"cool":2},"19csdInvo6oKxPFn67n-8Q":{"text":"Crap food. You have been warned. Just go to McDonald's for $6. $37 bucks for frozen pancak","useful":0,"cool":0},"DZqkK09q6W3VZel0ydvOaQ":{"text":"We ate here the Patty melt & fries were delicious. But your staff needs to be a little fri","useful":0,"cool":0},"ffRRzXTRUQToCWkD1YNezw":{"text":"This is a perfect place for someone visiting. It will give you a great \"New Orleans\" feel!","useful":0,"cool":0},"HJFaB4gvEnXJ7VbNZIduPw":{"text":"Wanted to get some brunch on our way to the garden district from the trolley and this litt","useful":0,"cool":0},"RIpL_pE7GiD-fopCQohNFw":{"text":"Great food, even better customer service and free Parking. What else can I say. I guess I ","useful":0,"cool":0},"4m1rZbXn0Z4M01fZixMjpw":{"text":"Walked by this place once and it looked closed, but went the next day and we were very imp","useful":0,"cool":0},"X8QdUek7ZO2tTSYRc_yhJw":{"text":"Service is awful the employees were literally telling us that they don't have anything we ","useful":0,"cool":0},"MY1Vki-BZLNi_R13VLFGCg":{"text":"Great little diner well located in the garden district. Very unassuming with great prices.","useful":2,"cool":0},"XIjZK8Bfd3BP8UGPM6DIGA":{"text":"Came here for breakfast. No wait for a table but the amount of time it took to get scrambl","useful":0,"cool":0},"vwGRyH1H7iCVOvJImf0Nww":{"text":"Went here for breakfast. It was Loud, slammed, rushed and the food was ok at best! I asked","useful":0,"cool":0},"twCnlIcbynLU9c2AImDQrA":{"text":"I had just gotten off work and wanted some good hearty breakfast food so I went here.The b","useful":0,"cool":0},"5jdOmFYklj_kRFNlCV9cwg":{"text":"This is always a must stop when we're in NOLA. Breakfast, lunch or dinner, nothing is bad.","useful":0,"cool":0},"Kz5lvPcTz5tlgjG6rMme2g":{"text":"It's not that it was terrible, it just was terrible Cajun food. The gumbo was flavorless, ","useful":0,"cool":0},"j0ImR4ysFP_DsYMY9WS88Q":{"text":"Okay I came back because I remembered how good the food and service was. This time, the fo","useful":0,"cool":0},"t2oJm9Ybol4kcFDA-TkIVg":{"text":"In my experience there, I had friendly, quick service, excellent food, and good prices.  I","useful":1,"cool":2},"SnouyJFhTtUkIoDBP0TgBQ":{"text":"Had the dinner pork chops and fried catfish and shrimp. The pork chops were deliciously se","useful":0,"cool":0},"M3oweJLbtRHoNBRnQ6F8Nw":{"text":"I'm giving this 5 stars because of the smothered pork chops and rice lunch special for $8.","useful":1,"cool":0},"dMLfojXEmy3133dszUxxdg":{"text":"We found this place by mistake !!! What a treat... Breakfast with eggs is a must!!! Lots o","useful":0,"cool":0},"affgpZA6J3nApCoZo-Lfsw":{"text":"We stopped by for lunch after walking around the garden district.  We ordered the BLT, cat","useful":0,"cool":0},"pHBq_Zfh9wkQGSoiTpiQEQ":{"text":"This cafe/diner reminds me of those that you went to as a kid for Saturday/Sunday breakfas","useful":0,"cool":0},"j3cJ4Vz4eF4EsaJoX0ns-Q":{"text":"Great food awesome customer service I love there red beans and rice the sweet tea is wonde","useful":2,"cool":2},"JMMI9fwDwbZqqW8lZYOhZA":{"text":"Interesting trolley theme outside, typical diner fare inside.  I would give it two-and-a-h","useful":0,"cool":0},"2Z1tdkcBV4NNnSzrx18Uuw":{"text":"Came in... on a Sunday with a large crowd, 11 to be exact.  It took over an hour to get ou","useful":1,"cool":0},"EgsrWRMTSh_9P9vs7ZLQjQ":{"text":"We were looking for a traditional type of New Orleans breakfast while on vacation and we w","useful":20,"cool":13},"i54oDavRWPDTh3OkWen2YA":{"text":"By far the worst I've ever had. This is terrible. Clumped grits that have no taste and the","useful":0,"cool":0},"PIpBNZdBf3Zz1GQzLJYzfg":{"text":"The portions are huge and very inexpensive. The staff was friendly and prompt. \n\nI got the","useful":9,"cool":1},"Ga4C9Y5QH1-il22k6WLeFg":{"text":"It's a good little place for breakfast","useful":1,"cool":1},"VRpHlos42xYm5rsLZvqvBg":{"text":"I love the trolley stop so much because it definitely gives that Southern Home Style cooki","useful":0,"cool":0},"pOIn9zVfqLAvhylYo48nbw":{"text":"Service was friendly and prompt. Cleanliness left a little to be desired (syrup all over t","useful":0,"cool":0},"BQQjKaW34lQkeMIn8N1F1A":{"text":"Everyone is friendly. Food is very good. Casey out waiter is awesome. Mushroom burger outs","useful":0,"cool":0},"6hSTjkg4I7IDTc0QoyXgbQ":{"text":"Stopped by here for the red beans and rice. It's was super yummy! Our waitress was nice. T","useful":0,"cool":0},"IydYVRDm2ZI6wOnMDLJG-A":{"text":"Went for breakfast before my brother had to head out of town; he ordered the breakfast wit","useful":1,"cool":0},"yHtIKn0EUVoMhsJqaFPTgw":{"text":"The food was too salty and the grits were blah.   The service was good but only one server","useful":1,"cool":0},"XcWbTy46lE_s11BQT62aCg":{"text":"Small and quaint but the food is delicious. The chicken is seasoned so good, you'll never ","useful":0,"cool":0},"Y_GY3tXUTIr41GN4wPMrdw":{"text":"The prices are stuck in the 70s it seems and the portions are huge! This is the quintessen","useful":1,"cool":0},"AvTIS4i5tfByPdmYjfMnNQ":{"text":"This is a great, low key place to visit and enjoy a view of the Saint Charles street car. ","useful":2,"cool":2},"R1OkwwSuH7C1dmT9aZZFaQ":{"text":"This was a favorite, however they remodeled into a tourist brunch spot.  New menu is sever","useful":0,"cool":0},"DR0-3YjuFdvNHPvcoBImlQ":{"text":"I don't know why it took us so long to dine here but I am so glad we did! Well, actually I","useful":2,"cool":2},"dCLSgjaJ2v8N9YY5MfQcAQ":{"text":"Yuck, yuck, and yuck!\n\nWhat happened? I've eaten here before and it was a solid five star ","useful":1,"cool":1},"aAhcj7Kk2tPLUIUJmxekYg":{"text":"Great hidden gem for breakfast! I was looking for a gen boric breakfast restaurant with an","useful":0,"cool":0},"vMhYq0d6tgctoc8iopAZzQ":{"text":"Was here last year and it was awesome.  Big pancakes,  a good amount of food for a good pr","useful":0,"cool":0},"PEN32hjI4_UKpNPvAzeALA":{"text":"Today we visited Trolley Stop. The portions were small and the menu was reduced to minimal","useful":0,"cool":0},"cuqKokJpKECnr5Kp2hMuSw":{"text":"Great location, close to the hotel we stayed at. Good customer service and very attentive.","useful":0,"cool":0},"ZDv9s0oyoLd0MMvrQcNr7Q":{"text":"We stumbled upon this gem while exploring the Garden District and we cannot say enough goo","useful":0,"cool":0},"wMiPLppj06lsGGaI8yFDJg":{"text":"I went for breakfast a couple days back with friends.  Service was good and the food medio","useful":0,"cool":0},"siFt8tDfjMluSue7WlS5xA":{"text":"Overall I wasn't thrilled with my meal here. I had pancakes and sausage. The pancakes almo","useful":0,"cool":0},"BbfHGQ-szh37aFPy-TYn0g":{"text":"two words:\nFOOD POISONING\n\none more word:\nSALMONELLA\n\nand another word:\nPUKING\n\nand a fina","useful":8,"cool":3},"khSzdLM47_Y9dLFioxAu6A":{"text":"This was our breakfast stop on the way back to Texas from visiting a friend in New Orleans","useful":0,"cool":0},"WU1waVWpjcluyOduSJB7vA":{"text":"We enjoyed our breakfast! Service was fast and friendly. Drinks were great and the food wa","useful":0,"cool":0},"8AGarA22kasusoOSh3Emxg":{"text":"1)The wait was long. People started getting up leaving. 2)The tall older guy working the c","useful":4,"cool":1},"4EeKxxw0T0G6SXx-KEPwsA":{"text":"Went there for lunch during a vacation. The gumbo was flavorless and the chicken salad was","useful":0,"cool":0},"WVi2U6jjoNsVptOcwdeOgw":{"text":"So I'm here and I'm trying to wrap my mind around what is going on.  @GordonRamsay came he","useful":1,"cool":1},"DXlV6MyW-eXaNYF1-vG4uQ":{"text":"This restaurant caught my eye uPon my arrival in New Orleans. Quaint & Cute are my adjecti","useful":0,"cool":1},"_P9RIurN2rOI08CBphsamA":{"text":"Hamstrung by festival traffic, we happened upon this place. My BF mentioned having had a d","useful":8,"cool":1},"zC_BUqRMJtYTeL0zzeqP_A":{"text":"I absolutely love this place. Great vibe, GREAT food. Used to practically live here when I","useful":0,"cool":0},"B698ypZ-wGas-Y-sxb-q_Q":{"text":"I'm a fan of the Trolley Stop for really affordable breakfast items. I've only tried one t","useful":11,"cool":7},"eaIMP8cU_3FZVY4srNve4A":{"text":"Now we've been hitting this spot for years after a late night of hanging out in the city, ","useful":6,"cool":3},"X2hgZGpPgQWI_P8kr1gDAA":{"text":"Still remains one of my favorite greasy spoon diners.  Each time I'm in NOLA I make a brea","useful":0,"cool":1},"J4wTVn1VAOcP3YFRQlz8HQ":{"text":"This restaurant is a Gem!  Came in sweaty and hot and she was an awesome and friendly pers","useful":2,"cool":0},"ssbk9ALo9hnZQTlyZr_JZw":{"text":"Came here for breakfast with friends. Food was good, portions were generous. Nothing amazi","useful":1,"cool":0},"44B0n2-Sa_RiuypTkSqnxQ":{"text":"My corned beef hash was excellent. Two had eggs Benedict and liked it. One had a ham and c","useful":0,"cool":0},"_9u1L6CPCnfiZAT5FOnElw":{"text":"3/5 you gotta appreciate it for what it is\n\nif you come with a rowdy table, they will roll","useful":5,"cool":3},"-29c_BgNBerS2ZztNpZIWQ":{"text":"Breakfast was on point here! It was packed but it wasn't too long of a wait. We got $5 mim","useful":2,"cool":1},"7HRuLbwhyDl5qyPUxB1pNA":{"text":"Very cute place with an amazing happy hour! The environment was warm and quaint, and the f","useful":0,"cool":0},"JBHbk_Dn1eTEelEQ-pIEUA":{"text":"The service was slow - so let them know if you're in a hurry.  Now, let's talk about what ","useful":0,"cool":0},"bDWyOT-Uqpts0c3b9Fn8xA":{"text":"We stopped here because it was close to our hotel and recognized it from being featured in","useful":0,"cool":0},"kvBBiMV5WUmcYjplphK-CQ":{"text":"Ate breakfast three days in a row because it was so good. Best pancakes and grits that I h","useful":0,"cool":0},"VjTxfvBKfC-V2l5xN5ACEA":{"text":"Food was absolute ass.   Vibe was the Ragnar the owner was an interesting character, got v","useful":0,"cool":0},"09KZE1sHdZMralZb7Trbrw":{"text":"This was one of our favorite spots when we lived here 10 years ago. We went back this past","useful":0,"cool":0},"Yzpyl2uKYdmJdms55Us5Mw":{"text":"This place was delicious. I had the chicken fried maple waffles and my husband had the pot","useful":1,"cool":0},"ejVhkBQjCm8r1NmQ5fhfqw":{"text":"I just don't think the food is good.  I've been 4 or 5 times, only because it was majority","useful":4,"cool":2},"fyoHSeF9280KJMox3xFLdA":{"text":"The good.\n\nNo wait seating \nCrispy bacon\nGood grits \nGood coffee \nGood pancakes (when not ","useful":2,"cool":0},"6NkpOpLVR5igEDBxWEZOvA":{"text":"This was the worst breakfast that we have ever had. Let's start with the male waiter that ","useful":0,"cool":0},"45QNmZzQx7jwCKN9Ya-STQ":{"text":"Service was great, although it is advertised as 24/7 for some reason that is not always th","useful":0,"cool":0},"jqnh4_GEqZvkZiRxDelfUA":{"text":"This place is outstanding. They're open 24 hours, great food, service, drinks and convenie","useful":1,"cool":0},"4aCiTZtH61Z2WQGOlQecFA":{"text":"This restaraunt was definitely helped by Ramsay.  I've been both before and after his visi","useful":0,"cool":0},"a96XEvdHkAefE0I8Yj9nlw":{"text":"Came here after eating a substandard, small- portioned expensive dinner elsewhere. Ordered","useful":0,"cool":0},"xhodWrGYaVlcgpgd6j4XRw":{"text":"I don't know who needs to hear this, but this is not IT. I swear i thought i was on a tv s","useful":0,"cool":0},"fkfuryWZu1ZTHE1LWQG4PQ":{"text":"We recently visited NOLA and we heard from the hotel about the Trolly Stop Cafe and that i","useful":0,"cool":0},"8dOiMAWYHI67PeL5jEHb7g":{"text":"This place was CLUTCH when we got in super late (midnight) and hungry. One of the only 24h","useful":1,"cool":1},"sl3G4fmTjkp37QxUsPRFMQ":{"text":"Breakfast Nearby!! We were staying uptown and I wanted some delivery breakfast. I first we","useful":0,"cool":0},"QmTcVtJsNucrZTGCWidUtw":{"text":"On this trip it has been all about the recommendations and all the places I missed on my p","useful":6,"cool":5},"aDAyKN03kkCoW0L3cC8T1w":{"text":"Interesting staff and expect to wait a hot minute to eat but BOYYYYYY was the food good!!!","useful":7,"cool":4},"Hf5GswpSOlCGQt38JcK6eA":{"text":"We were very disappointed.\nService was very slow. They were out of bacon we ordered sausag","useful":0,"cool":0},"-EJGzESeqgadMZSvnSf-yQ":{"text":"UPDATE 11/2/19\n\nI decided to come back here for some dessert because I saw they had bread ","useful":0,"cool":0},"WOm4PePEbgoXqCsO9VQKYw":{"text":"This southern hospitality is amazing. My fried chicken and waffles was finger licking good","useful":1,"cool":0},"NxgDUp4DMLM9BiQgPCNC7A":{"text":"Eh, the food was decent enough, but the servers do not want to be there. They took a long ","useful":0,"cool":0},"BmV_j_iZpOeH9l08hpnE0Q":{"text":"There are a few self designated sacred spots in a city that you love to haunt and this is ","useful":4,"cool":2},"jtmTv2eXg-uKn46gU14L3A":{"text":"Not good , zero seasoning in the grits, potato and onion omelet could've been good but was","useful":0,"cool":0},"tK_aC3I2CH6vrM8ITaTSKQ":{"text":"two words.......GREAT  PANCAKES\n\nok a few more words.  there was no wait when we walked in","useful":0,"cool":0},"PKq77Q_uOkm5a1IINcmdQA":{"text":"The food is amazing and the customer service was top notch.  Chicken & waffles is peak bre","useful":1,"cool":0},"NUV9bBYde-X8RT47JArSrA":{"text":"GREAT FOOD! There fried fish & fried chicken is seasoned TO PERFECTION - i recommend for s","useful":0,"cool":0},"HfJp-wGYhoRbaZBzcYxNow":{"text":"Chose this restaurant for breakfast because it was walking distance from our hotel.  We we","useful":0,"cool":0},"DDScqkAo8NQGBiSXW6fEZg":{"text":"I tried this place out based on a recommendation from the hotel staff at the Wyndham we we","useful":0,"cool":0},"yR8XoU7xX4hyifAID8Jp8g":{"text":"Looks good, but tastes BETTER!!! I got the liver and onions and got to say they were the b","useful":0,"cool":0},"srSB2pQfok4Cl2An5BqGWQ":{"text":"After the 4th time my eggs came out runny and raw or came out with shells in them, I final","useful":5,"cool":3},"S4NbHU5UqM63XTRsJ8ZKOw":{"text":"Stopped here for a meal after a party across the street.  I ordered the corn beef hash bre","useful":0,"cool":0},"6TeyFXcqoBImC5oW4DfbBw":{"text":"Arrived on 10/22/2021, to find this location was closed and apparently some homeless had s","useful":0,"cool":0},"ybdytVpgEZJbVjtE-Mny-g":{"text":"Stopped for breakfast and was  disappointed with the food.   Poached eggs were over cooked","useful":2,"cool":1},"63pidYXcfshBJrjEGJaS5A":{"text":"I was out there for the 2020 Mardi Gras and I had breakfast there and wild up getting food","useful":0,"cool":0},"skNbrT8MmQ2e3aIjckQHrA":{"text":"Baaaaaaaaabay the fried chicken here is everything. You can take the trolley here or walk.","useful":0,"cool":0},"2sTBULBhhmu_CmxIslw8NA":{"text":"His place was pretty close to our hotel so we decided to go here for breakfast. I'm glad w","useful":1,"cool":0},"SDtUVAQaA6HoEVQOadTuPg":{"text":"First, our server rushed our order. So hopefully the meal is better than the service. We w","useful":2,"cool":2},"0Ioykre-I5MX-ZqUuwElLA":{"text":"Walked by this place twice thought it was cLosed noticed it was finally open stopped in to","useful":1,"cool":0},"o2bi7T6KBxmhW-qotVJWRw":{"text":"Enjoy the food and the server. The rum punch was made to perfection. The grits just needed","useful":0,"cool":0},"PKtCPGHTfIDOGslLTSMmlw":{"text":"Breakfast came quick and it was delicious. We enjoyed the French toast and patty melt. Ser","useful":1,"cool":0},"RISF626RUuEMqFJXr0hWBQ":{"text":"PLEASE READ **DO NOT USE THE ATM MACHINE HERE** If I could rate this dining experience a Z","useful":43,"cool":9},"CxGFCK1G09DeGX_7EWJucQ":{"text":"Nice breakfast at non tourist prices, Ate there 2 times and service was OK. Would go again","useful":0,"cool":0},"586Gy6eSRp_IRH2WUPrncA":{"text":"Was looking for a breakfast stop. Ordered a Belgium waffle, side of bacon and grits with c","useful":0,"cool":0},"UUcKBONkBdDth6IbpnlYsA":{"text":"We visited New Orleans last month, Jan 22-25. On a Thursday morning walk, we walked by the","useful":0,"cool":0},"U0tRc-UQ1lqW1cF3HpDd2w":{"text":"Fried Green Tomato BLT, Rice, Red Beans and Sausage &  Pattie melt were amazing! I wish I ","useful":0,"cool":0},"xExAzw-9RRi1eXfIJC7ByQ":{"text":"SASSY WAITRESSES, definitely more interesting than the vap-oids at hipsteries;\nAFFORDABLE:","useful":4,"cool":3},"iJYeD4YHRc6Iyi46-3Ch-w":{"text":"Great breakfast as always....miss the days of hanging out enjoying friends...(before Covid","useful":0,"cool":0},"ZhAzFuiAVdoWxx3hqCGOqA":{"text":"We wanted something to eat and it was late. My friend let me pick between here and another","useful":5,"cool":8},"ZBimU5IYqdK_RpVJnSWEQA":{"text":"The absolute worst breakfast I've ever had. Pancakes tasted frozen. The eggs were probably","useful":9,"cool":4},"XSxpQE593TJzfc7etz1UXQ":{"text":"The food was cooked perfectly and the man who served us was very nice. He was also very hu","useful":0,"cool":0},"hwTWknaqj-Cvs586Q4VTtA":{"text":"We tried Trolley Stop for breakfast one Sunday morning because it was so close to our hote","useful":1,"cool":1},"jLehu8Ngec-6BTg89ek27g":{"text":"Have to admit. I want to up my score to 4 points now.\n\nWent back this morning after my hor","useful":7,"cool":5},"yzpombfJH0Ld_pDuOLUTaQ":{"text":"The waiter was a one man show. He put plates right across your face so if you aren't watch","useful":0,"cool":0},"yOkke_I15fm5bps7j-j1SA":{"text":"We walked around the garden district before stopping at this place to eat. As we walked in","useful":2,"cool":0},"D5l1ODrFSrBVXgF59ObrGA":{"text":"Looking for a breakfast place and I found this place on Yelp. It was only two blocks away ","useful":5,"cool":1},"tLSSihmJztSFuOQzlbxb6w":{"text":"This place came highly recommended by many locals The atmosphere was pretty cool and the a","useful":0,"cool":1},"d7IcJtPL_TbAfqNhGcabIg":{"text":"We ate here several times for breakfast and it was as wonderful as we remembered! Fantasti","useful":0,"cool":0},"R3F_F_RIuWICTnIxpxhT-g":{"text":"Probably one of the worst breakfasts ever! Do NOT bother folks. Literally 30 bucks I'll ne","useful":2,"cool":1},"E5SBFBN5llC2ib94sRAV1Q":{"text":"Amazing traditional Cafe food.  I had the fried green tomato BLT and it was great.  The fr","useful":0,"cool":0},"yKvrfaaQrQfrHSGNMg3Hdg":{"text":"I randomly picked this place to grab some breakfast because it was within walking  to the ","useful":0,"cool":0},"GYAiuhQBiQSw8wmwq6xS7w":{"text":"Located In the garden district on St Charles it features a small bar and breakfast and lun","useful":0,"cool":0},"qNRmwA-EpezdmOYNT1Zwfg":{"text":"Granted I was in a different state of mind when I came here, but it's 24/7 and their break","useful":1,"cool":1},"-onmDiOMUwyKrGZ1mdilnw":{"text":"menu was way better last year when I first visited I fell in love with this diner. My firs","useful":2,"cool":0},"VDQdU2IbV1_Bt8yJYZG5Ag":{"text":"A great spot right on St. Charles Ave, and away from the crush of people in the French Qua","useful":1,"cool":0},"xsOa_BAPQHwaxziBBNssNA":{"text":"The Trolly Stop was recommended by hotel staff and it was pretty decent, however they did ","useful":0,"cool":1},"IhquANRJnZunBRAxs-g7jQ":{"text":"Been here several times when the Please-U was closed(Sundays) and found it unremarkable. O","useful":6,"cool":5},"LAIRukQlVwgJkiq4npfAxg":{"text":"If you are in NOLA's garden district this place is a MUST for lunch...It reminds me off a ","useful":3,"cool":3},"ynfHiyLkVrT0N1hTJP2BzQ":{"text":"First let me say...this place is CHEAP.  If you're looking for a hardy breakfast Uptown an","useful":1,"cool":1},"Gw-YBe90q6iljUMm3Is0uQ":{"text":"I was reluctant to come here based on the fact that all my research told me that in N.Orle","useful":1,"cool":1},"w1pLDelYbE22Z--emgZu-Q":{"text":"The food here is actually pretty darn good, but the service is not. I got an oyster poboy ","useful":4,"cool":3},"Mj4rAKSPuNXRK5PnBIBHDw":{"text":"Came in here for breakfast with a group of 5 on Sunday. I was really in the mood for a Po ","useful":2,"cool":0},"3Qi9yN08XU_65v-EKQjM2g":{"text":"Super delicious breakfast food!!!! Service here was fast and friendly and the prices were ","useful":1,"cool":1},"xF8dkygajL7ZW8natZ_olA":{"text":"I am not sure if my visit is unique in the bad experience or if it is a general trend. Whe","useful":1,"cool":0},"Yj-RnYVAjMvnzCyrtrBefQ":{"text":"I went back with a couple of new friends to The Trolley Stop and this time, it wasn't as p","useful":0,"cool":1},"-s8u3csj_OHfs4dyh-cqKw":{"text":"The atmosphere was very \"home-y\" and comfortable, the prices were beyond fair and the serv","useful":2,"cool":1},"ytRx0SAzkxAn06dM_y2QmQ":{"text":"I think I just wanted this place to work. Having been here four times and tried four diffe","useful":4,"cool":0},"J6ZykNDGh8lXdW55mq8c-w":{"text":"This is a regular spot for my husband (a native) and his friends due to the quality cheap ","useful":1,"cool":0},"k2uDdrnH8UZwZtb-BbHhXQ":{"text":"went here for breakfast. \n\nDELICIOUS. and not only the typical options for breakfast. Also","useful":1,"cool":0},"GMhVMDXW8tjQDXc__um52Q":{"text":"Love Love Love this place! It was a bit crowded when we arrived but it was to be expected ","useful":0,"cool":1},"fsvBd_YyKAaa_a73Cj2wBg":{"text":"I ate here 3 mornings in a row. You read that correctly. 3 mornings in a row. I would have","useful":4,"cool":8}}