{"-0RZCW63Lxp6U6OfvkbmpA":{"text":"Don't even mess with those pizza places on bourbon street. If you want a really great slic","useful":2,"cool":2},"hiWaClvRZe_oSK8UqE8qpw":{"text":"We did not  have high hopes for the only food option open at 9:00 p.m. on Christmas Day.  ","useful":2,"cool":0},"-HKdK6jZydGwmT03X9swYw":{"text":"It was alright for Burbon Street late night. The service was sucky but hey you get what yo","useful":0,"cool":0},"IHURA5hdv_JnWaeRspUZPg":{"text":"I'll be honest. I was very drunk and it was very late when we stumbled in here for a late ","useful":0,"cool":0},"qbdkJV1m5QAAR1FVs_NIFA":{"text":"Recommended to this place by a New Orleans resident, and it was okay. It was a good cheap ","useful":0,"cool":0},"nYQNiJCaCo-hU0Lktnd0OQ":{"text":"I found this pizza place on Yelp.  Delivery was free to my hotel.  The wait was listed as ","useful":0,"cool":0},"FwfrUYnZAJff_x2mpeVC2Q":{"text":"i recall being dragged through bourbon street one night around 3 or 4 am and my friend say","useful":1,"cool":0},"8BOD6lt09-PpAoRL7k4mOA":{"text":"We came in to grab pizza to go and the guys in there were above and beyond the best!! They","useful":0,"cool":0},"JbM-7mrLcCZClLdUl6vdhQ":{"text":"Asked a door guy where I could get fast good slice o pizza. Told me here. Small place only","useful":1,"cool":0},"KgZzblalg-12vxY3RmggUQ":{"text":"My wife and I were looking for a delivery pizza option that would be a step up from the ch","useful":0,"cool":0},"WQTnCyaUoTaJrK2TagkVHg":{"text":"First things first I need to specify that I ate this pizza sober. there are a lot of revie","useful":0,"cool":0},"RfSPlIpWpNYzIhb3e2cBJQ":{"text":"Stoked friend of mine suggested having pizza here. I ordered slice of spinach and cheese p","useful":0,"cool":0},"HBydUE4dqW9gnq_NRVFvzA":{"text":"Best pizza in the French Quarter! We visited Vieux Carre twice during our stay and it was ","useful":1,"cool":1},"cMssA8Qo5Hde2h0anADL8w":{"text":"The first night I was in New Orleans, I made terrible life decisions, one of which involve","useful":2,"cool":2},"ljoU3l3tSg7xPMekWZizsg":{"text":"Y'all, this pizza is SOOOOO good! The crust is thicker and very flavorful, the ingredients","useful":0,"cool":0},"a8e345P8HN6O-Abn1Poh2g":{"text":"There is a wait time for larger orders.  The pizza is really good and the breadsticks are ","useful":1,"cool":0},"OOQMl5uqZwzMNRSREJgOWg":{"text":"After a long night of drinking, my husband and I stumbled back to the hotel and jumped int","useful":0,"cool":0},"0-4tIWr7W6KrK3lSET_wHw":{"text":"Delicious Pizza delivered to our room!  A supreme\nLoaded pizza with the best cheese we've ","useful":0,"cool":0},"NTvSRmfzTSgu8L5e1n13ug":{"text":"A really close second best pizza in the NOLA. Great thicker crust pizza, but not quite dee","useful":0,"cool":0},"Kk7hPMvcMoJPg3z8zMvLTw":{"text":"Not a huge place, but the bourbon special pizza has been some of the best and freshest piz","useful":1,"cool":0},"euGyDEreyddcXpptqvohTw":{"text":"Nice service folks, we tried the meaty offering and the  chicken pesto, it was oddly simil","useful":4,"cool":1},"tT18Ui3cNN22CFq1hIDr7g":{"text":"If I could leave a negative star review I would but unfortunately this makes me pick a one","useful":2,"cool":1},"s5pu_4Q-2mMNmqzSztBMVQ":{"text":"Great slice of pizza. Bold fold pepperoni was just the thing to save the day! Hot and read","useful":0,"cool":0},"RKVs3UnU1Xnl30Je_7i16A":{"text":"Dropped by at 1am in the morning during a Saturday night in the cattle drive of Bourbon St","useful":0,"cool":0},"zdyl7ORtqp4igUGGBR8cxA":{"text":"Ordered take out from here. Ended up getting the San Francisco which turned out to be pret","useful":0,"cool":0},"pZJy5S_TjMS6VOIIFQevqw":{"text":"So this is the spot. Pizza is fluffy but with crispy crust. Down the street from the apart","useful":0,"cool":0},"1xhlwePyDkp4rge1q_iDqQ":{"text":"Do not go here. Literally there are dozens of other pizza places on bourbon that won't rip","useful":1,"cool":0},"t0gF9ZuPIXGI83cVvTy7Dw":{"text":"Drunk or sober this is hands down the best pizza you can get off Bourbon street. You can t","useful":0,"cool":0},"t30Jv-t1V6PPckbQkHQzjA":{"text":"Currently eating here! Husband and I got a slice each and 2 cokes for $10.50! Delicious pi","useful":0,"cool":0},"rXSatTBtmfEXsRdz0YGwoQ":{"text":"Best pizza in NOLA and across America. The dough is a perfect consistency of yumminess and","useful":1,"cool":0},"bYlSXH6WHRRkr29r9niruw":{"text":"Pizza was good onsite but delivery was incredibly slow. Was supposed to be delivered in 45","useful":0,"cool":0},"GdknaB0UQVZdlcw5MxksUw":{"text":"I work at a strip club on Bourbon St., so take my word for it when I say that Vieux Carre ","useful":6,"cool":3},"k3BqgvTgdCowY89KxzkakA":{"text":"This is the most unbelievable pizza I've ever had in my life. My friends and I were just l","useful":0,"cool":0},"LOyKLGP1vQYGDlIS3cSjMA":{"text":"It was ok. I have had better. But they came earlier than they stated and they had delivery","useful":0,"cool":0},"SAww8i7kKuZW8O5kvCRcQg":{"text":"I never do reviews but felt it should be done here. I had just got home after a cross coun","useful":0,"cool":0},"hIkGoP8xdzV5Ahb3yc27cQ":{"text":"Too salty. Convenient if you're in the quarter, but a lot like little caesars. Better than","useful":0,"cool":0},"hvpOOT6ZX9NL7aAQIhkRZg":{"text":"Yeah... who thinks of pizza when going to New Orleans!?!?  Well, just in case you are hitt","useful":0,"cool":0},"M8ZPNLt-IJgchG_qQFLpyQ":{"text":"A notch better than your typical pizza from the likes of Dominos.  Although some would say","useful":1,"cool":1},"ej37OXV0GxXWWxJujrlB5g":{"text":"Had the veggie pizza, wings and breadsticks delivered. Awesome food. Fairly quickly and wa","useful":0,"cool":0},"sjnoCl_N9H-I_T9cVAgi9g":{"text":"After several attempts on Yelp online ordering, we got it straight. We ordered the bourbon","useful":1,"cool":0},"8Bpwl19CI3naxgBVEunxtA":{"text":"Bourbon street has lots of pizza joints where you can get a good old greasy slice after (a","useful":1,"cool":0},"A3AlwmCUgEjVG4cwBs310A":{"text":"Pizza in NOLA just stinks.  After loosing our money at Harrah's we walked outside and aske","useful":1,"cool":0},"T_q4U1hOq7FDrql3KPrdgA":{"text":"A solid choice in the FQ. Just steps from our hotel....there were no shortage of choices, ","useful":1,"cool":1},"F99-JM8ClXZfJcRVrpsWKw":{"text":"This is by far the BEST pizza in New Orleans. A bouncer recommended this place to us a few","useful":1,"cool":1},"gDD6gHLkN6_Uo3lGMKlMIg":{"text":"After one drink called the Hurricane from Pat O'Briens, I was drunk and craving for food. ","useful":2,"cool":2},"yX3qBLG9eKeeCgV1wkL9kg":{"text":"After waiting for about 10-15 minutes on the guy behind the counter to let me know the piz","useful":1,"cool":0},"-oPti8XMKHbLufwu2UKJzA":{"text":"Nice people, but awful pizza when you're sober. Thick doughy crust, great for soaking up t","useful":0,"cool":0},"4VmmvKJM3liG5lNMBPFJ1A":{"text":"Now, this wasn't our first trip to NOLA, so we knew we didn't want some tourist spot! We k","useful":2,"cool":0},"r0KRujVxtJ22obyRZ1GE4Q":{"text":"If you're in the French Quarter only get pizza here.  It's cheap and good and not like tho","useful":1,"cool":0},"RQzD-3eQxoSueY6sldn2CA":{"text":"Stayed at Q&C Hotel during Mardi Gras season, and got hungry past 11pm-- I was so worried ","useful":0,"cool":0},"6P9426T7TYsrar_NKi5LjQ":{"text":"This is a come and go kind of pizza place. I only enjoy it when I'm starving or have had a","useful":1,"cool":1},"gTrmeILY1w19JUNAezx57Q":{"text":"We were craving a late night pizza and this was one of the few places we found open late o","useful":0,"cool":0},"Mv3kcC_V-k2x0vKR1MGRgQ":{"text":"Quality and price makes this place unbeatable.  Wonderful toppings, excellent crust recipe","useful":0,"cool":0},"_H3fdKvXeV5RaGIoS_lXww":{"text":"Supplied pizza to a 15 person bachelor party quickly and easily. Dude came on a bike, and ","useful":1,"cool":1},"FfVThq99XBbYgJ5_IEbe8w":{"text":"Very rude staff.  We didn't try the pizza, although the wings were excellent, even though ","useful":2,"cool":0},"H2buw3-n1nCDzTzk9_wqYw":{"text":"Horrible customer service, especially in the evenings. The first time I called a month ago","useful":5,"cool":1},"ILxHOB8MVUxKCadMjy-YpQ":{"text":"Bonus for this place being opened late, but don't be fooled. The pizza is terrible. Good p","useful":1,"cool":0},"kT0MXsCdg5qF_IHYlybygQ":{"text":"After being up for 18 hours, 12 of those hours spent on flights, this piping hot, cheesy, ","useful":0,"cool":0},"N587Maek0XvbLKrPNERlMw":{"text":"It's pizza when you're drunk...and only when your drunk. Pizza is placed back into oven so","useful":0,"cool":0},"PZvsz_Io-yObEo-HqTX1TQ":{"text":"I've been to NO twice & have stopped in here 8 times! Love love love the pizza! After a ni","useful":1,"cool":1},"bZpRlJCW41q2mGp4gFZpPg":{"text":"Best Pizza in Nola! Not a lie. Highly recommend! Great, friendly staff! Awesome pizza anyt","useful":1,"cool":0},"PQn7n4JaMLHmOVwD7or-fg":{"text":"After visiting many establishments in the French Quarter and the hour was getting late, I ","useful":2,"cool":0},"3QevLAECVJ0z5f29YiCkFg":{"text":"On our last night in NOLA my husband and I were pretty exhausted and wanted to get some ea","useful":0,"cool":0},"j6i7leVMrOLAVp3p_rsyLQ":{"text":"Got my pizza delivered; very good pizza but took them an hour to get the pizza to my house","useful":0,"cool":0},"kWc1OZTPT8khn__h2zayZA":{"text":"Who wants some Pie? This is your place for good pizza by the slice. Hot, cheap, close to B","useful":2,"cool":2},"GZY5FK8E_fHIp_vgIvD5Dg":{"text":"Quick delivery. Very delicious - a little pricy. The cheesy bread is amazing, I highly rec","useful":1,"cool":0},"8HIQMYu_bOWNFR36YNCYcA":{"text":"The atmosphere is not very flattering but the pizzas are really good. And they are open la","useful":1,"cool":0},"LcwzviWzJdcCZmEFkNvHiw":{"text":"Reading so many great reviews, we decided to go here...big mistake. The pizza here wasn't ","useful":0,"cool":0},"GKjDjQ7LSvJeqF094S5TNQ":{"text":"We ordered pizza here to be delivered to our place. Pizza was delicious, arrived warm and ","useful":0,"cool":0},"1m_d_50k-0iAquK8wnGtNQ":{"text":"This place doesn't look like much but omg the pizza is delicious!! I tried the cheese and ","useful":0,"cool":0},"pO_3BeofI0FGAXubkuxDdg":{"text":"Date of original review: 12-7-2015\n\nBest pizza in the quarter! There are plenty of greasy ","useful":1,"cool":0},"pcSAfwkd9BwNK6KQpgfIuw":{"text":"I'm a new Orleans local and this is my favorite spot for pizza in the quarter, and their g","useful":2,"cool":0},"SM2Xql1PN765EZhA_dxtwg":{"text":"best late night snack right off burbon st!\njumbo slices of pizza!","useful":1,"cool":1},"7aQ7zc0jx2FVLnglvIWHgQ":{"text":"Any place where I can get Pizza By The Slice thats half good when I'm drunk is gonna get p","useful":3,"cool":1},"PNJ8ggRbfkhTdO3de2mXtg":{"text":"I am in love with the cheesy bread. It is so good and so addictive. The pizza is good also","useful":0,"cool":0},"I8Fjco0ABex9oqvLb1MaIQ":{"text":"Wanted some pizza without going to far from Bourbon Street.  We had a fresh meat lovers pr","useful":0,"cool":0},"oig-yfIo2eVl9vDE8ltzFQ":{"text":"late night drunk pizza. i think this pizza would be pretty good even if you had it at say ","useful":2,"cool":1},"aR9wk1npMNSA013XfD6qbQ":{"text":"What can I say. Fabulous pizza, especially late in the evening. \nIf you eat in, it's not t","useful":1,"cool":2},"oghQu2qA-HZjQ8b35r8DsQ":{"text":"A definite hole in the wall that is well worn - if you can get past that and want to get t","useful":0,"cool":0},"n3_uxhIuq-Iq18FY6g1yFw":{"text":"Decent pizza. Highlights are they deliver late. My only complaint is that the wing that we","useful":1,"cool":1},"AZXjt166vTqueeYe7O6dzA":{"text":"Pizza is fresh and delicious! The few times I've come here my pizza is always fresh out of","useful":0,"cool":0},"GtQTK72qAxOt69DFqywPyg":{"text":"We had five girls and a child and ordered an x-large supreme pizza. It was so good. It was","useful":0,"cool":0},"9ZeGQL4i9guolOGYtvBsCg":{"text":"This guy is the original spot whenever I come to New Orleans and go to Bourbon Street and ","useful":0,"cool":0},"idmtCiPX6VM0UJYG2_OYEw":{"text":"Disclaimer: Was ridiculously drunk and hungry, and it was late. This was the only place we","useful":0,"cool":0},"EmraBTE1ydSbHr960RL87g":{"text":"OH EM GEE. Their special on the weekend of August 24, 2018 was LIFE CHANGING. Chicken pest","useful":0,"cool":0},"BaG6oWopcOVzB6dPnp8z1g":{"text":"By far the best pizza on Bourbon Street. The man behind the cash register was really frien","useful":1,"cool":1},"n22d2znbpnqNjs1UbxFqnw":{"text":"It's across the street from our apartment and happens to be good. \nWe've only had the pizz","useful":4,"cool":3},"zFEb2YxyPOUNp3qlxTn4kA":{"text":"Hardly palatable. Just because it's the best pizza on Bourbon doesn't mean it deserves 4 s","useful":1,"cool":0},"q6JTnKsawXcW81iJEFWsIQ":{"text":"I found this place to be your average run-of-the-mill, pizza-by-the-slice, hole-in-the-wal","useful":0,"cool":0},"rgyIjLs26e8SKPddo1GAaQ":{"text":"Ordered pizza no cheese. They called and confirmed no cheese. We still Got a pizza with ch","useful":1,"cool":0},"dZqK7x3kgmzmZ-vg_DKVQw":{"text":"Vieux Carre was recommended by a couple we met in the Quarter. We found it on Bourbon and ","useful":0,"cool":0},"J1QmytbNKG7-ItmzeLllqg":{"text":"It was a late night and looking for a some snacks. Looked them up and they have free deliv","useful":0,"cool":0},"O9WfQWUNji0flLLc7wS9gw":{"text":"This is THE best pizza you're going to find near Bourbon. You can spend $5-$6 (including t","useful":3,"cool":1},"1b-NPD2liiWrk45wCrXLZA":{"text":"I can't stop eating this pizza. Every night for an ENTIRE WEEK I have purchased two slices","useful":0,"cool":0},"J23XVCqxiXAeMJg1jEMwTw":{"text":"My wife and I are huge pizza fans. Vieux Carre Pizza is definitely a go to stop when in to","useful":0,"cool":0},"9T3bV1HkwRJj2J1S83W-GA":{"text":"Ok, maybe these reviewers are right.  This is one of the few places that will deliver late","useful":1,"cool":0},"3at2f1DXaDr22MESwNQMOg":{"text":"The pizza was delicious, but I was a little disappointed with the delivery timing. We orde","useful":0,"cool":1},"Kkr1tbJfiF0eKP9UT0UsKw":{"text":"Ok, I should give this review some context: this place is located in the middle of everyth","useful":0,"cool":0},"Fj0H33EGjKpLTPzLGo-ODg":{"text":"Out of all the pizza places downtown on Bourbon, the best fresh pizza and it is cheaper th","useful":0,"cool":0},"t6U07JtBaakqYD2BzoWxtw":{"text":"We went here because of the reviews on Yelp... we weren't impressed... we bought one slice","useful":0,"cool":1},"lW4hit-ZDtjec0FsEIZrdQ":{"text":"It was early morning around 3am and my typical drunk self needed food. I wanted something ","useful":0,"cool":0},"1IU3BqjuJx0gq6kbttnXjw":{"text":"Pizza by the slice was yummy.  Easy experience for a festive crowd out having fun.  I woul","useful":0,"cool":0},"QHfc5_As85ql8B3ralzHhA":{"text":"After trying only 2 pizza joints in New Orleans, I'm convinced this is one of the best in ","useful":0,"cool":0},"nTP3-Xl8pA9p4PV5Rb26Hg":{"text":"BEST PIZZA IN THE CITY! Now people let's remember this is a pizza joint NOT 5 star dining!","useful":1,"cool":0},"v5iPmhhclGuXBxdw4yBS_g":{"text":"Pizza was delicious! Lots of cheesy goodness....perfect for soaking up those hurricanes!","useful":0,"cool":0},"DqGwIsuz8vxx7pCj4YHyuw":{"text":"Very pleased with the taste and quality of this pizza! One thing that I like about this re","useful":0,"cool":0},"oysT_fA4iATTGFXAUU8y9g":{"text":"Zero stars. They lie about delivery times of 2 hours and sell your pizza to whomever they ","useful":1,"cool":1},"dOGOzq8-tCqsiPqI8g1wEQ":{"text":"If you suddenly find yourself hungry past midnight on Bourbon Street, make the short trek ","useful":3,"cool":1},"LBSEy4ad-bO2x0z3sGqaDA":{"text":"As a New Yorker I've definitely had my fair share of pizza by the slice and this place bea","useful":0,"cool":0},"9x0pbhQ1co1o3yVo2d9_RQ":{"text":"After eating practically all day, we needed something small but filling for dinner. Pizza ","useful":0,"cool":0},"guKnpTqxEuB-0dNpZf11dg":{"text":"Decent quality pizza in a nice environment. \nOne of the few good pizza places in town. Loc","useful":0,"cool":0},"k9MeSf3Tv_aRkrqzgeXXGQ":{"text":"The BEST pizza you're gonna get in the quarter. Possibly the entire city of New Orleans. M","useful":6,"cool":1},"LQ3Wz_jzOQ9EKPqADBAJEA":{"text":"Pizza joints on or near Bourbon Street generally means disgusting, tasteless, cardboard. F","useful":2,"cool":1},"GIw42UwGDDyOghis-ETvuw":{"text":"This was late night pizza delivery at its finest. It was quick and hot, it tasted good, an","useful":0,"cool":0},"Zr_4n3iGC1yA8Qg80qcUbA":{"text":"They have an Alfredo sauce but just refused to make out pizza in a thin crust with an Alfr","useful":0,"cool":0},"aOQSsQALSNzNGJwVpmyfYw":{"text":"This was very good pizza. Some buds and I were in NOLA for a short time, and came here. We","useful":0,"cool":0},"rPSwGOJEF6JTKYc3uFw5tw":{"text":"What a great break from the traditional food of New Orleans! The city is a great collectio","useful":1,"cool":0},"ULN4yWa1Gmfx8p0OwUNFrw":{"text":"This is the best pizza in the quarter... Omg. I want it everyday.. Go try it and you'll se","useful":1,"cool":1},"CqZKRWkLX91c5GhycLSyIQ":{"text":"The service was absolutely terrible. The cashier had a nasty attitude and didn't give a cr","useful":0,"cool":0},"44mnqbfp5yvi80haAUmaJw":{"text":"This pizza was excellent, dare I say one of the best I've ever had! We had the meat lovers","useful":0,"cool":0},"URKxjWftjRnGthvkrIWqEA":{"text":"I pretty much hunt this place down every time I'm in New Orleans. They are located right a","useful":0,"cool":0},"ks4lj8En8NakY4MqrtJXCg":{"text":"Pizza was a great idea , my son doesn't always want a fancy restaurant feel, so we ordered","useful":0,"cool":0},"k3LBR0eU1lydJdRRxKCimA":{"text":"The best in pizza New Orleans might have some sketchy people outside but don't worry ! It'","useful":1,"cool":0},"muNcYuZprSiuYhsPgohhhg":{"text":"If this is the best in the quarter.... , it's not saying much. It might actually be the ch","useful":1,"cool":0},"pSi4tRqUAxI5iFcH1ZcagA":{"text":"Ok, whiners. It's not NYC or Chicago style pizza. It's pizza that's better than anything e","useful":2,"cool":0},"tZsYgEdTJkfKF1uViQPQ8Q":{"text":"Amazing late night pizza delivery. Hot, fresh, good, basic pepperoni. Will definitely orde","useful":0,"cool":0},"0a3o779f52jWar9BIj2TnA":{"text":"Best kept secret by locals!  Cheapest pizza around bourbon....and the best!  Screw jesters","useful":1,"cool":1},"lbfPgCuHmE51VvWOPnEa2g":{"text":"This is my absolute favorite pizza! If you're out in the Quarter late, it's the perfect so","useful":1,"cool":1},"uFLm7g-jAyROMl_auT28-A":{"text":"A local recommended this place cheap prices for better quality and taste. So good! I was f","useful":1,"cool":1},"6hMY_CW6usb3nkW9TcQq1Q":{"text":"A great drunk food find and similar to the famous Austin 6th street joint, Ropolos, which ","useful":2,"cool":1},"K191LBoVVNME5axjA60SGQ":{"text":"Don't expect a thin ny pizza. These are thick slices. Pretty much a better and larger domi","useful":1,"cool":0},"YCtwZTShOZRPWFGQ8TgtWQ":{"text":"Only pizza anywhere near Bourbon St. worth eating. Slices are large and always fresh. They","useful":0,"cool":0},"yP1v6scnvoZCrK95a-FVXw":{"text":"For sure my favorite pizza in the French quarter, it's excellent! Basically I walk from Or","useful":1,"cool":0},"oj3RRWtOmjF9dP4yzGmbPg":{"text":"Cheap pizza and hits the spot before a few beverages on bourbon. Try the bourbon slices. C","useful":0,"cool":0},"B8C3OGxTohX-_9P6ZYjF5w":{"text":"I can't think of any place in the US that does late night pizza better. The food is always","useful":0,"cool":0},"yy6c-rndYpXvCdSJ7tpLdA":{"text":"Walked in off Bourbon St, craving some pizza. All I got was a slice of Cheese Pizza for $3","useful":0,"cool":0},"pijsaptpGu9TqYsj0Voz8Q":{"text":"We came here on a Saturday night after cruzin the boozin hood bourbon street. All the eate","useful":2,"cool":2},"ctilMUxat-bgwm14cDIx3g":{"text":"Placed order while staying a Sheraton. It said 45 minutes for pick up. Went to restaurant ","useful":0,"cool":0},"cdUCk7yphSEVqu_oQfTD_Q":{"text":"YOU KNOW WHAT? This was pretty darn good pizza. Very cheesy. I liked that. Also, delivered","useful":0,"cool":0},"-3heRzREFbFIu4QDg6z-BQ":{"text":"It's ok but I have to be honest Crescent City Pizza down the street is better l, don't get","useful":1,"cool":0},"6silu8eIYmPgK5-LYIcNSA":{"text":"This review is based solely on the quality of the pizza by the slice. Anyways, the pizza i","useful":0,"cool":0},"JhW7Csx0TSFMN-_0txLWYg":{"text":"Don't waste your time buying pizza slices any where else. This is the spot for a late nigh","useful":0,"cool":0},"F6HYdzZeEkbojLuG5oFgpA":{"text":"The best slice I've had in a long time! Perfect chaser to the Hurricane in the French Quar","useful":0,"cool":0},"BV9_8AyDfKYmNMjc9zvJSg":{"text":"Had this delivered while staying in the Quarter one night. Pretty good pizza, but nothing ","useful":0,"cool":0},"av9SPHgZCBk_x-BwZl2zdQ":{"text":"I ordered delivery at 11:30 pm and was quoted an 45 min via online ordering. At 12:30 I ca","useful":1,"cool":0},"dtDeF4Xv6TwyFtWKf5zLzQ":{"text":"Doesn't look very clean but the pizza was good. Perfect when you are drinking all day on b","useful":0,"cool":0},"vJO2nQqe0FnYuo7AS41qGA":{"text":"BEST DAMN PIZZA IN THE WORLD! Me and my friends go here every friday and saturday just to ","useful":0,"cool":0},"FzkR-Y4K6IuKH-fll4etXA":{"text":"I came here looking for wings and I'm so glad I did!! The wings dipped in teriyaki sauce a","useful":0,"cool":0},"a6WSvzMR4du4J1vSY1levA":{"text":"Good pizza! Ordered the supreme delivered to the room. It came quickly and food was warm, ","useful":0,"cool":0},"Rcd40aPc0VqAni6Rb5xZzQ":{"text":"All three nights we were in NOLA ended here...fresh, delicious pizza right off of Bourbon ","useful":1,"cool":0},"xKGTdWoPupIV7E8gyPgIlQ":{"text":"The pizza is so delicious I love this place whenever I am in the French quarter I have to ","useful":0,"cool":0},"TFU_zo7IwdPuf7vDp-mOVw":{"text":"Lmfao this is really my favorite pizza joint .\nMy coworker brought me here in March and we","useful":1,"cool":0},"MkVOs0SZhfgaNMTE6VNJuw":{"text":"Excellent pizza, tasted great and baked fresh. It doesn't look like a great fancy place wh","useful":0,"cool":0},"u92pDH6Zrda0bhDYQ-xsvw":{"text":"Got a late night delivery from them. Took a little longer than expected but the food was w","useful":0,"cool":0},"tf8hUlsEVIyJCjKmtGGghA":{"text":"People, let me tell you about my first love...\n\ni have never, NEVER, had pizza this good b","useful":1,"cool":0},"K71OFM3mpYpeP23zEQ18Eg":{"text":"Tasted like Pizza Hut nothing really special. I guess I had high expectations from the rev","useful":0,"cool":0},"pfGWi5bdJslTFHUqOftc0Q":{"text":"Good pizza, great location, friendly service... FYI cash only at least during Mardi Gras","useful":0,"cool":0},"4SHdXECxw0iY7UTt8uYr_g":{"text":"Best place to go for that late night snack after a night out!! Service is great and quick ","useful":0,"cool":0},"q5adpaonz9m4RPPJRmrBgg":{"text":"Co-workers and I, after a bit of debauchery had stumbled upon this pizza place. It's open ","useful":0,"cool":0},"IF5BFcCt_9cqXe0N6YKAFA":{"text":"I wish I could give this place 0 stars but unfortunately that's not an option. We had an o","useful":0,"cool":0},"zegjocw3G6DAppXq1qnxbw":{"text":"Easily my new favorite pizza place! Everything was just so tasty. The pizza is still yummy","useful":1,"cool":1},"Mn6e1qYJSIh1b9Man6IWzA":{"text":"Great pizza. And that's something coming from a native Chicagoan. Open late and reasonable","useful":0,"cool":0},"d5cBXlZfOBXeO1_jlvsNbA":{"text":"On new years eve we were walking on bourbon passing by drink shops selling their cardboard","useful":3,"cool":2},"WuQUiM21yrQPFu9vxTJDIw":{"text":"Bartender at Razoo recommended this pizza place. A little hole in the wall, pizza could be","useful":1,"cool":0},"Ycy7p_Y_UjUMH1MN8sKGkQ":{"text":"They deliver pretty much until 3-4:00 am. My pizza was the perfect temp and just what I ne","useful":0,"cool":0},"x6kxkAumK5eph0jLNyPgVw":{"text":"Love love love!! Best pizza place in Nola!! We went here 4 nights...yes 4!! For late night","useful":0,"cool":0},"s6mwl4FWnWQBkK57s-nohQ":{"text":"As we waiting in line a lady that was a local of NOLA told us that was the best pizza arou","useful":2,"cool":2},"ZG0y7Skg_j4g8D9mh2zQKw":{"text":"Great pizza that's freshly made,  unlike many of the daiquiri joints on Bourbon st (I swea","useful":0,"cool":3},"uwK6H69jJzE35VeeYxUyPQ":{"text":"I really wanted to try their food. The gentleman on the phone was so polite, I was calling","useful":0,"cool":0},"7MW_E5lpb4JdrN-ij_MSqQ":{"text":"decent pizza for a random selection.  Not the biggest fan of the you pick your slice and w","useful":2,"cool":1},"B2OMlz0MP6LONPWXfCWqJQ":{"text":"Large thick slices.. on point! Ate twice during my stay, it's that good lol. Worth ruining","useful":0,"cool":1},"gb0zfOetM6yjvtZIYMu_bg":{"text":"The only pizza in NOLA!!! Open late night, very small, a pizza must! When I'm not in New O","useful":1,"cool":0},"XtKQlIbyhVl703foJomNpg":{"text":"Not feeling it.  Maybe if you were SUPER drunk.  Too thick crust.  Mediocre sauce and chee","useful":0,"cool":0},"vaOBRB_is2Y1rJTdCxYk9A":{"text":"Amazing pizza and staff is super friendly. We will definitely coming back !!great midnight","useful":0,"cool":0},"MmIYcoTRcZFuHXIqU3lrYA":{"text":"The family was hungry after rolling in and needed a quick bite before hitting the bed. Qui","useful":1,"cool":0},"Pt3i1sU0nmOjuTHvH1At3A":{"text":"If you like cheap and soggy pizza that's devoid of flavor or you are wasted and can't tast","useful":0,"cool":0},"ZFAhl8ETnDRQKdyo-SutSg":{"text":"Pizza is really good! I discovered this place while walking on bourbon street and it was s","useful":0,"cool":0},"rt28D-0q3BUniBHLCaW45A":{"text":"Delivered a huge pizza for $20 at 3am in the morning. You get 5 stars for that. Overall pi","useful":0,"cool":0},"H4Fajfbn4D0uwHige_lOEA":{"text":"My go to pizza place in NOLA. Yummy pizza that is fresh and super nice guys that work ther","useful":0,"cool":0},"S8055xAKmYFO7onH7PFZyw":{"text":"This is my favorite place for delivery, pick up or sending a barback to grab me some food ","useful":0,"cool":0},"jvyhWfeYJYGc1O1dzffjNQ":{"text":"Pizza isn't something I would have every thought to order in NO but being in need of comfo","useful":2,"cool":0},"6VRvxoWl3MzlvSBTbQwQ0Q":{"text":"Everytime I come to New Orleans, I ALWAYS drop by to get a slice. The pizza is ALWAYS FRES","useful":4,"cool":2},"3gvfObELLQjLz2TBzPhMBw":{"text":"This place was exactly what I needed. I was in search of a pizza place walking distance fr","useful":0,"cool":0},"RMR0dyzbVG0H9t2JQjAqRA":{"text":"The pizza just isn't very good, disappointingly inauthentic. Frozen, mass produced and jus","useful":0,"cool":0},"TyjN7SqhRDPQB2Rt-8db3Q":{"text":"Visiting New Orleans for the first time and had a craving for some pizza. There were decen","useful":1,"cool":0},"NC9FBZr6d000s-Jnf3EHlQ":{"text":"This place ROCKS!! Best $3 a slice pizza around. I would stumble into my hotel at all hour","useful":1,"cool":1},"M169m6Rw9p1VFdUFoVWNlQ":{"text":"Plain cheese pizza is a bit salty, but very rich and i would recomend, fast free delivery","useful":1,"cool":1},"ZLo1Mrk-ykneV2UvszVyMA":{"text":"If you are in the Quarter and want a  quality slice of pizza, Vieux Carre is probably your","useful":2,"cool":1},"NnnItgaQmK7qBLZ12Btqyw":{"text":"Maybe it is because I'm spoiled in the Bay Area by great pizza (like Golden Boy in North B","useful":2,"cool":0},"zgzpcLoaFCBra4fKtkNmQw":{"text":"Love this pizza.... OMG it's the best in Nola... Go and have some , the only thing is the ","useful":12,"cool":13},"7pehynUgKXzSIDS8-smZ0Q":{"text":"Vieux Carre Pizza is the best pizza spot in the Quarter. Their pizza is delicious and reas","useful":0,"cool":0},"MWGXHU92lRXME4KvSfR2Gw":{"text":"Overall not a bad pizza, little greasy but overall taste was good crust was good. Nothing ","useful":1,"cool":0},"UHvVzCvnNcBarJQkDlZ9UA":{"text":"The cashier was a complete jerk to several people in a row including our group. \n\nCash onl","useful":0,"cool":0},"hAE3RXQmCx06kh33NnqLhA":{"text":"So I figured it out... people in Louisiana hate pizza. I asked locals and they all said th","useful":0,"cool":0},"BBL4tJ4u3sWntwVIYgHGUA":{"text":"I also ordered from this joint based on its Yelp reviews...to be honest, I can't believe t","useful":2,"cool":0},"TQ4ugfGiR-ycRv0StRz7ww":{"text":"Everyone gets drunk in the French Quarter.  And if they're not, they still get hungry.  Th","useful":1,"cool":2},"Q6E3NZhs2v505qpFYatSdw":{"text":"Here on vacation.. cold and rainy.. didn't want to get the little one out.. delivered on t","useful":0,"cool":0},"O4N8r4wlgCi5yBRyFQUrqw":{"text":"I recently ordered a delivery from Vieux Carre Pizza. After waiting the estimated delivery","useful":0,"cool":0},"t1eOuU9iQ8qJ-vDwlCpONQ":{"text":"We ordered delivery after getting in town late. It took over an hour and a half and that w","useful":0,"cool":0},"BhvInder7owK9PnXa-_08g":{"text":"Not so impressed by the pizza. I went based on the Yelp reviews and tried slices of the ch","useful":0,"cool":0},"8s7YXLThlY9AfpEHRP2jow":{"text":"This has always been one of my fav pizza places. Hot wings were PLAIN chicken wings fried ","useful":0,"cool":0},"txOcyv-ABtAl3WhRmBiK7w":{"text":"Best Pizza in NOLA. Don't be fooled by the street food image. This place has the best Slic","useful":0,"cool":0},"x60Nw-UHkYv1gDHjFI4tIg":{"text":"The pizza was good, nothing special-just fine - but the Greek salad was fabulous. The deli","useful":0,"cool":0},"DV_VW-FmWQskaiasXlQ9Zw":{"text":"Pizza was so saucy and hearty! Slices are $3-4, definitely a safe haven off Bourbon Street","useful":1,"cool":0},"sr2aCLQu-cSYq-o8ddRzmQ":{"text":"It's what many of you might consider your typical \"hole in a wall\" pizza place, but don't ","useful":0,"cool":0},"LJpeWLRv7vnABdyI6OXAXw":{"text":"The garlic  bread alone is wonderful , and the pizza was cooked well and tasted great!, al","useful":1,"cool":1},"RoKirS50WNOtjM0kPRz15g":{"text":"For someone from New York, I thought the pizza was excellent, nice texture and taste on th","useful":0,"cool":0},"Z_HNnadqs_S4BBOQuv7lhQ":{"text":"Great pizza! It was delivered right to my hotel the Bourbon Orleans Hotel. It took them ab","useful":0,"cool":0},"M_06iZ9qMAorC8c0x5nzAw":{"text":"Best late night pizza in New Orleans. The Bourbon Street Special is my favorite. Convenien","useful":0,"cool":0},"EzmdF0YU78jPV_WIf9f_dw":{"text":"Hey, this pizza was pretty good, it was a pretty good value, and they will deliver it free","useful":0,"cool":0},"bTnv_nqqUH2eeTBdBPBGdg":{"text":"Amazing place... this is my 2nd year coming back to New Orleans and both times we got food","useful":0,"cool":0},"Ul7d3MYzAMCfq0b0jXdiTg":{"text":"Me and my boys end every weekend nights here! The bourbon special slice is a must if you l","useful":0,"cool":0},"oY6LS8JvjflR1GzlHDalDg":{"text":"The food was very good - we had ravioli with meatballs and chicken Alfredo.  Just one note","useful":0,"cool":0},"p1lSZBX4RsoewcMqR6chTw":{"text":"Bourbon street food has a few choices but if you venture off the path just a little you fi","useful":0,"cool":0},"VeKWSKd_H9d63EPr1T1ZVQ":{"text":"Do not eat the pizza on Bourbon! If you want to truly be satisfied you must eat here. The ","useful":1,"cool":0},"Bwq2sKHWhXc1X3tHXYd9qQ":{"text":"Perfect pizza and fresh really fresh salad we always get meat lovers double cut and pepper","useful":0,"cool":0},"4UBVxZzdy6TtfuAZq4o4IQ":{"text":"Definitely some of the best pizza by the slice you will find near Bourbon Street.  Compare","useful":3,"cool":3},"s2Cg2M4Di9ORgzCZlpojWw":{"text":"I don't know why but Vieux Carre Wings and chicken ( which is right next door to the Vieux","useful":2,"cool":3},"8x3B3ejgL_GTk23MLslMtQ":{"text":"Well, ordered delivery to my hotel through Yelp. Waited almost two hours for it. Finally h","useful":0,"cool":0},"VNTw36MSYWsVn4lveqjfCA":{"text":"Fast delivery, generous toppings, fair price, great pizza!","useful":0,"cool":0},"-cmlVKM5AAa487EHjwrIaw":{"text":"The best pizza in the quarter. We always grab a slice at the end of the night. The meat lo","useful":1,"cool":1},"oAj8ciJOsQ6j5SDUc_keDw":{"text":"Got home AFTER checking delivery hours by calling.  We were told 3:00am.  Because of that,","useful":1,"cool":0},"V7LrvjuUL1hmQcIHPvqPmQ":{"text":"I live and work within the New Orleans area. I decided to give these guys a try. I ordered","useful":0,"cool":0},"DJU6g-yC_WhuwD3T3nH-gg":{"text":"Ordered with these guys on a visit to New Orleans. (Sometimes staying in is more fun that ","useful":0,"cool":0},"enZEKHRLj5GcTyc-JiNPMg":{"text":"THE best pizza I've had in a while. Visited after a long day of partying, drinking...you k","useful":2,"cool":1},"bQ6C4apzPfMcXIwKrrA5SQ":{"text":"Just finished my first and second slice of Vieux. The meat lovers had very good toppings w","useful":0,"cool":0},"nBobzUGQNFudfsWa_yX0Cg":{"text":"Grab a good slice of pizza, at a reasonable slice, just 20 feet off Bourbon St.  A good st","useful":2,"cool":0},"LbzV6LRqBRoZDygQl_NF7g":{"text":"Great pizza before you get started on a night in the FQ! Cheaper than the Bourbon Street j","useful":0,"cool":1},"EbrfcXqGUZACgqmA6182ag":{"text":"I love this place. Great pizza & people. Always make a late night stop or two, when I am i","useful":0,"cool":0},"02ri_2S3AwoDDiIhH92_5A":{"text":"When it's really late, and you needing a break from dancing and going hard at the clubs on","useful":0,"cool":0},"7PAqIR9X5t8rUeDbqD0FPA":{"text":"My husband and I ordered pizza from this place based off of previous reviews. Delivery was","useful":0,"cool":0},"_BycX6qHfU1_DVGfU6Iurw":{"text":"Just WOW!! This pizza is SO good and they deliver late night. The only reason they didn't ","useful":0,"cool":0},"TvM5CqK15oXYb4NRIHNmBA":{"text":"This is a great lil grab & go pizza joint and the focus and passion is on the product  - f","useful":5,"cool":7},"RZef1xz4t9BMWlbtAXCOZw":{"text":"The pizza is OK... probably 3*'s. Minus one for gawd-awful lying service.  I asked if we c","useful":0,"cool":0},"aWX5ewdMTObYM7rmRlwHGQ":{"text":"I ordered pizza for delivery to my hotel and the delivery person forgot our side orders. R","useful":0,"cool":0},"KaYqniyiGEBYjkD6UvRsMQ":{"text":"Best pizza in Louisiana. Ok? Listen,  I've tried several and been grossly disappointed. Th","useful":3,"cool":1},"VvW10BOusWQTKxd6OD19RQ":{"text":"Awesome pizza for your drunkard nights. It's a nice little hole in the wall place tucked o","useful":2,"cool":2},"U_8zVpfpqXt-_-18TSGzyg":{"text":"After drinking in the FQ this is the best place for pizza, especially since it's the only ","useful":2,"cool":0},"GRLgy-cbn-VcDTuklXdF3A":{"text":"I'm confused about all these great reviews.  This pizza is a knock off of Sam's Club or a ","useful":0,"cool":0},"pcl15o8UR80iOwIxrg9OXA":{"text":"Pizza is oK. Tastes alot like pizza hut pan pizza, and crust is very thick not neocolonial","useful":0,"cool":0},"Y0PQBdcmVIGXn209bj7c-A":{"text":"This is an awesome pizza spot on a late night on Bourbon Street!! We stopped by for a slic","useful":0,"cool":0},"NAUmpJWW_bZaIQ_i64ypSw":{"text":"This is always our first night in town dinner. \n\nMake no mistake this is a real pizza shop","useful":1,"cool":1},"epdLEE4KXDRgmL6T3NxQLQ":{"text":"Delicious yummy big slice of pizza! Yay! I had the drunchies when I ate mine and it was bo","useful":5,"cool":5},"kN6nuYv80gBvggyr7S59sQ":{"text":"Yuk. Everything. Pizza people filthy. Gross. Typing more because its making me............","useful":0,"cool":0},"jYQrUVU4LZtKpS72kxY9zw":{"text":"Hand tossed style, crispy but medium thick crust for $3.50 one topping. At compac, Across ","useful":2,"cool":1},"2PPHJBRtx3ABgP1S_rbkyg":{"text":"BEST PIZZA IN NOLA. We got 1 slice of meat lovers and 1 slice of their Bourbon pizza and b","useful":0,"cool":0},"HL-3apdBFC7wAFq4CYFr5g":{"text":"My son and I came to this place our first day in New Orleans and we had the meat lovers pi","useful":0,"cool":0},"8Z0lVBjpbXYg80CPxtWurw":{"text":"New favorite pizza spot in Nola! \nAte a pepperoni slice after a long night of dancing, was","useful":0,"cool":0},"YG7Kjvx7NYvvqYenBN79CA":{"text":"Great crust. Good value. Good selection. I don't know how many times I've walked past Vieu","useful":0,"cool":0},"J4mmJLgsNeUCyqMQ-i2akg":{"text":"Good for a quick slice and I'm sure fantastic for late night eats.  Nice guys working ther","useful":1,"cool":0},"jk22mmGkd7HWB1UsG5zncw":{"text":"So we came to this place real late at night, or very early in the morning, however you wan","useful":2,"cool":1},"ZEGdGrauZ1T4pRrsNKpYuw":{"text":"I don't know if this is the best pizza place on Bourbon St, but only because this is the o","useful":0,"cool":0},"KSIYW7u4j8DHl2fAvq8Ftg":{"text":"We ordered the 14 inch meat lovers pizza and it was good! Perfect amount of sauce, cheese,","useful":1,"cool":0},"XOw16qTJLA7d2qafV0JD_w":{"text":"Yelp surely let me down this time around. This pizza was a glorified Domino's. \n\nGrabbed a","useful":2,"cool":0},"KmnGNSc9NaOiO5Fgcl3xHw":{"text":"Preface: I was sober when I ate this pizza. \n\nThe pizza is quite good. The crust to sauce ","useful":3,"cool":2},"eJl7BGScy6dDbX3_7RkdKA":{"text":"We were so tired of walking the french quarter we decided to order a pizza. I brought up p","useful":2,"cool":0},"a8DkYG1gm_0AYE4LAnS8gA":{"text":"We generally order from Pizza Delicious but read good reviews & decided to give this place","useful":0,"cool":0},"UJUCAtGfNQCMpfWh2tEE-Q":{"text":"Amazing pizza. I loved with chicken with veggies and feta pizza. Great to go pizza in the ","useful":1,"cool":0},"PdXvuSEKCq0Ii4OxtDZoLw":{"text":"This is going to be your late night delivery pizza. Or you can go get a slice if you're wa","useful":0,"cool":0},"2Yt4v163Ugb7wGNv6iUAvQ":{"text":"I don't actually remember the pizza at Vieux Carre, but that's actually kind of a good thi","useful":2,"cool":0},"7RT0eSjDOisTyazqhRd8fg":{"text":"Looking for a late night meal after getting in from the airport. With delivery the pizza w","useful":0,"cool":0},"Ey3GFA9UxdrAUGUChyoCqQ":{"text":"Alright pizza...dried out wigs, but they deliver and its nawlins. Better then little Caesa","useful":1,"cool":0},"Pm948NwZAkeydjvl5xo5AQ":{"text":"Ordered the Hawaiian pizza as carryout and it was freaking delicious! Fairly reasonably pr","useful":0,"cool":0},"wT6rOqjkkBcdmAUNVRdlJg":{"text":"Pizza was amazing! I also ordered the Alfredo and it was good as well! Highly recommended!","useful":0,"cool":0},"wDRlMQuKXKiXZIDYCimdAQ":{"text":"I really had a craving for pizza while in New Orleans, and Vieux Carre Pizza nailed it.  T","useful":0,"cool":0},"BjMAZp1llbY9bOUiwEoqTg":{"text":"Being from Chicago saying the pizza is not bad is saying alot, its not Chicago style but i","useful":0,"cool":0},"9bqlptHipEWaISROe17wjg":{"text":"Hole in the wall pizza joint. It's a good place to get a slice after a bit of drinking on ","useful":1,"cool":0},"vPNU0K_zK07UifiyENy8xg":{"text":"It's dominoes pizza under a different name. Not bad if you're intoxicated but not good if ","useful":0,"cool":0},"vJy_uTgb92ow7CfQkUpcqQ":{"text":"Great delivery service. The pizza itself wasn't that great. Lots of cheese, not that much ","useful":0,"cool":0},"FjcRoYFcRJWccPKfTVii3A":{"text":"Pizza was awesome. I had to give it 4 stars cause the order was wrong. We wanted half chee","useful":0,"cool":0},"jjBjNMrgYYjOQ9v1YE5JgA":{"text":"Awesome service!! Fast delivery..we had the meat lovers pizza and wings delicious best piz","useful":1,"cool":1},"3XnZKpfK5sIuftiFjHfQvA":{"text":"We were not that hungry and wanted to get something quick, so we stopped to get a slice of","useful":0,"cool":0},"oRBh8qRxsTRfeQr-rJtMCg":{"text":"Ordered this tonight from ubereats and I should've known better than to order from a pizza","useful":0,"cool":0},"BPVPGJQuH4naC_5VT-YiPw":{"text":"Came here twice in one night .once i was sober during the day. Came back at night when i w","useful":0,"cool":0},"U19ZKhdd9fcAk5Khgm3b-Q":{"text":"The delivery guy has never been less than beautiful but unfortunately he always rides off ","useful":0,"cool":0},"B0UsnnV6k44vu84E4kWmDg":{"text":"I absolutely loved this pizza when I tried a slice of cheese on a night out. It was hot an","useful":1,"cool":1},"Ek8OokcP7SYEndHNPhsUuw":{"text":"I must have gained 5 pounds from having their wings and catfish as midnight snack!\n\nThe ma","useful":7,"cool":2},"OG8VAGNA_iB14Yzm5tBQGg":{"text":"AMAZING!!! I really believe this place has the best pizza on Bourbon St!!! \n\ntry the chick","useful":8,"cool":6},"YFDFJdQ_oUXsnriUXhOahw":{"text":"Quick and decent price for a slice, I am not a fan of thick sliced pizza, but the sauce wa","useful":0,"cool":0},"djRTq8mvInIq8deCLyALfQ":{"text":"Looking for some delicious chicken fettuccine?  Well this is the place to get it!'  Lots o","useful":0,"cool":0},"ENvCxYJP4nq7fvsZmzucWw":{"text":"I just called this place to make an order and the guy on the phone was very rude to me. I ","useful":0,"cool":0},"lwg7HIMPoOfr7yu5BwKV0w":{"text":"Better luck finding a better place on bourbon than this hole.. cold and stale pizza! Waite","useful":0,"cool":0},"0QD8bry1NDVXE7VL7E2gNw":{"text":"Pizza size looks good. We bought a large cheese for $13-not bad! Havent tried it as yet-st","useful":0,"cool":0},"uNyinVQrJqspkG_L_Y7uLA":{"text":"I've walked pass this place so many times and didn't even realize it. But the pizza was so","useful":0,"cool":0},"WvSGU__D8eA2EumWZRgURw":{"text":"Rico most favorite place for the pizza when to the quarter.  Pizza here good!  The daiquir","useful":2,"cool":0},"R0Uog76J74fiig1HdXBInw":{"text":"Not Chicago pizza but left this Chicago content. Good plentiful cheese and doughy bread. F","useful":1,"cool":0},"GH3qjUYKsytTTeNwALrjkw":{"text":"If hungry for a delicious late night snack! Yo definitely have to try this place out!! Piz","useful":0,"cool":0},"V1RB54W1jZlgrop89TaLog":{"text":"Late night, fast and delicious!! Quick service. Delivery guy was very professional and pol","useful":0,"cool":0},"tixkr5KSc8TYiQpxwDkYtg":{"text":"We loved this place!! We went back 3 times on our trip. Must try in NOLA late night or aft","useful":0,"cool":0},"3frLFQaTMdxSENmvQXVzdw":{"text":"We had our first taste of this pizza on Bourbon Street after a night of adult beverages.  ","useful":0,"cool":0},"49qNT0OXBSRCXr31gpPAjg":{"text":"Best pizza on Bourbon street. Slightly thick and crunchy crust. The Bourbon Street special","useful":0,"cool":1},"HFXd_cZ-oDQY-6ZexAF0Mg":{"text":"NOLA is great for so many things; historically I've learned that pizza is not one of them.","useful":0,"cool":0},"lZne5EQKiytuqHXFcOBjRQ":{"text":"Pizza was dry, not enough sauce or cheese.\nToppings of poor quality.   Not enough flavor","useful":0,"cool":0},"6B-UHdWhklKPyi0DD16eSw":{"text":"Coming from Pizza City (I'm pretty sure I'm the only one that considers Chicago pizza city","useful":1,"cool":0},"7f6W04Xk2kJeKOBC5sUfxA":{"text":"i friggin love their pizza!!! i don't know if anyone in the world, evan in italy can top i","useful":1,"cool":0},"lGYrVsWPhQf5j_GIIYXnFA":{"text":"They were closing up but we got lucky and got a piece of pepperoni and the bourbon slice. ","useful":0,"cool":0},"NAlQF-O84yGVwimAp2j7oQ":{"text":"Nothing fancy - just great, fresh, and cheap food.  Highly recommended whether you're drun","useful":2,"cool":1},"9tCiVKVV8c_GDm7uq_RlrQ":{"text":"A good late night snack place. Pizza is tasty and a great price.  It is a hole in the wall","useful":0,"cool":0},"WauXJSDpGxZxWKr_dSDyUA":{"text":"On new years eve we were walking on bourbon passing by drink shops selling their cardboard","useful":1,"cool":1},"Vu9jz-DSsl_gPqXxG3bOlA":{"text":"Don't understand all the positive reviews. Not impressed at all. I've had many a frozen pi","useful":1,"cool":1},"jdPoikJN3Grp6kefH_JL3g":{"text":"I waited an hour for this place to open to get pizza and in the meanwhile walked around to","useful":0,"cool":0},"XZwpBLx16DdOfz_WQ8hPsw":{"text":"Best Pizza Ever!\nGreat Slices.\nPepperoni and Bourbon Chicken Slices are Perfect.\nWill go h","useful":0,"cool":0},"udZzIU0xB0SzcJoD5XaOPg":{"text":"I have probably had all the pizza, gyros and fried chicken up and down the Quarter through","useful":3,"cool":2},"49RaYgCXzrWYD7bqI4ltdA":{"text":"AMAZING PIZZA! Amazing staff as well, super friendly and the pizza was so on point. Super ","useful":0,"cool":0},"ol1FsNfc6hRY5DljdcosGg":{"text":"Great bourbon street pizza shop. Definitely a hole in wall place with very limited seating","useful":0,"cool":0},"K8TIoa8B9HTQvADSkHyogA":{"text":"$3.75 for a slice of pizza! Not your typical thin slice but doughy and still crispy. Cash ","useful":2,"cool":1},"10NhsazCI8Y9N8F5hlYf5A":{"text":"Great pizza! Crust was crispy just right  sauce was perfect didn't make the dough soggy","useful":0,"cool":1},"2TSVmxbFi5sNh8dTwJs8IQ":{"text":"This place has great late night pizza. I came with my bf about 11pm slight wait. We both g","useful":0,"cool":0},"OhrZFSLhctXT-ot-rx-GpQ":{"text":"Ordered whole pizza online and they delivered directly to my hotel. It was great pizza and","useful":0,"cool":0},"vh-E2wwMfP_6vnVpTXxe_Q":{"text":"My boyfriend and I have ordered from here twice so far while we've been here on vacation i","useful":0,"cool":0},"OGCb4zUiJSEYlpg0z_YGwg":{"text":"Came there New Orleans with my three teenagers.  At the end of our trip, we were discussin","useful":1,"cool":0},"Jfai6Jp3sHN_Orvn2KtfdQ":{"text":"I didn't expect this pizza to be this delicious! We ordered the bourbon pizza and Hawaiian","useful":0,"cool":0},"-7lYVOHlM1GDWXL2G54KoQ":{"text":"Horrible service. Paid for my pizza and they delivered the wrong pizza. They delivery guy ","useful":0,"cool":0},"NVEBXs4wXmaQq9HEqPQ-Dg":{"text":"A pizza joint off of Bourbon St does not come to mind when thinking of some of the best pi","useful":0,"cool":1},"5Ve51Y4LgzMtl-tOSC8qkA":{"text":"Ordered delivery for wings - disappointed no longer fried like before.  Still good, just d","useful":1,"cool":1},"hr6Nz378niSmBqd4cf1rng":{"text":"Yummy! This pizza is delicious! We ordered it two nights while visiting New Orleans. Deliv","useful":0,"cool":0},"GBXS5qDT6Wl3qWGukqb6Mw":{"text":"After a night of wandering bourbon street I was getting pretty hungry, so I searched \"drun","useful":0,"cool":0},"NOLqWfSXxB5DfOaO9zzyhg":{"text":"By far one of the best hand tossed pizzas I've had. Top 3 for sure and off the top of my h","useful":0,"cool":0},"CovCFyG23HZCEItgaEWIRQ":{"text":"We ordered the combo pizza.  We are used to a ton of toppings but honestly it could have b","useful":2,"cool":0},"eea7ZTcaXWOdQIoHYSFx5A":{"text":"This was very good pizza. The crust is what makes this pizza différent. It's like it has a","useful":0,"cool":0},"kJWbCRna8Ci4ssdD5tzF4g":{"text":"Our delivery driver was very friendly, the pizza, chicken Alfredo, cheese bread, and marin","useful":0,"cool":0},"JRYMygM8eGbeTSNDxviFhA":{"text":"One of the best pizzas I have ever had. I ordered a large and ate a few slices before goin","useful":2,"cool":1},"OnB0Jt9WjOwGuykHdnzElw":{"text":"While attending Keller Williams Family reunion, my daughter and I decided to stay in and r","useful":0,"cool":0},"UgovDIO6f9Wz_0uqA1AAyQ":{"text":"Great pizza, wings, po boys, and the list goes on. Definitely the best pizza in the state ","useful":0,"cool":0},"mU2eSq3DP4G87LzieSbhiA":{"text":"Really good pizza. My favorite is the bourbon pizza. Quick delivery and for the size and p","useful":0,"cool":0},"OM08ROZMNae_fIflyjMBbQ":{"text":"Pizza is really good for a quick serve restaurant. The crust is crunchy and yet soft and w","useful":0,"cool":0},"yQ-xc_r4Zz9fkAXw3FQ9Nw":{"text":"In the midst of a Bourbon Street Pub Crawl that we were loosley associated with, a friend ","useful":1,"cool":1},"mQZ2OOshalO7xr2T8CeCFQ":{"text":"I ordered delivery. I got the Bourbon Street Special Pizza . It is described as chicken, p","useful":1,"cool":0},"dRl24dFA49KJ1lRoH7OjDQ":{"text":"At approximately 9:30 pm we ordered pizza and pasta from this place and requested delivery","useful":0,"cool":0},"75ccFu46zfAbREZMoY4l7Q":{"text":"This pizza is just fine for a midnight pizza when all other pizza places start closing at ","useful":0,"cool":0},"5mWS9FTjJRIOK9LxLRSOhw":{"text":"Oh my gosh SO GOOD!! Just randomly stopped here on our way down bourbon and was pleasantly","useful":0,"cool":0},"YYkg2_99NCGXnt0PvVnv8w":{"text":"Food is mediocre.\nDelivery is bad ass!!!","useful":1,"cool":0},"7sQgKivIh2fG_hJ24C2ZOw":{"text":"Most likely one of the cheapest meals in the French quarter. The Pizza slice is large and ","useful":0,"cool":0},"eSuZBSdbNjPnSB-WFeMJAA":{"text":"The pizza was great! From the outside, I was not sure.  However, I am so glad we tried it.","useful":0,"cool":0},"eAw-7o4QVZYe1y5EBqz8_A":{"text":"The pizza is amazing! Great slices, and especially great slices for the price. Do not hesi","useful":1,"cool":0},"FT4pIL-LUj67VmfibZPXOQ":{"text":"I got a pizza and the \"philly Cheese Steak\" which was a half melted slice of Kraft cheese ","useful":0,"cool":0},"e2QT1evqPyEMWvNT8ZaWFg":{"text":"Oh my goodness gracious! My expectations for pizza at 3:00AM on Bourbon Street was low and","useful":0,"cool":0},"PgH2WHD50HI3UwPrpfivZw":{"text":"Visiting New Orleans and too tired to dine in.  We ordered Pizza via Grub Hub through Yelp","useful":0,"cool":0},"48au930Kf6FoUXnvRqKmZw":{"text":"Two slices for 8 bucks. Can't beat that. My boyfriend had pepperoni and I got the bourbon ","useful":1,"cool":0},"WB7zzQX-yU6r7Wo0g1wVKg":{"text":"Pizza was just OK. A lil too doughy ( too much bread) for me. Sauce on pizza had a really ","useful":1,"cool":0},"Uyzmpx5bqBTcd13YBFGkZw":{"text":"Just the fact that I am born and raised in New York City alone should qualify me to tell Y","useful":2,"cool":3},"oFLD8GZ29dWbkhKqFkTCAw":{"text":"Pleasantly surprised with how quick and good the pizza and wings were. The price for the p","useful":0,"cool":0},"dlLKFjy-XcKk3Zp_3_fXcw":{"text":"My pizza was 40 minutes late after ordering on grub hub/yelp..they didn't even begin makin","useful":0,"cool":0},"hXOcNrNRCrkWiK38Nmkzvw":{"text":"Best pizza in New Orleans.  Thick crust.  Very nice. Not sure what else to say.  I have to","useful":1,"cool":1},"szGlZjla3DsTaMxze6yjfg":{"text":"Stopped in here while out with friends and we decided we needed a bite to eat. I probably ","useful":7,"cool":3},"lJ6j8IqaDptWmWysyLXBzw":{"text":"Good, solid, respectable pizza.  Not the junk you'll get at dominoes.  If I'm looking for ","useful":0,"cool":0},"m8Vq_GgezJpyG5Vhq6d9dQ":{"text":"I seriously just had the most insanely delicious, juicy, & hot (tempature) wings that I ha","useful":0,"cool":0},"ye2t_1nUODP59Fin66gMIg":{"text":"Fast delivery and delicious!!!! Ordered a large cheese pizza - very cheesy and would defin","useful":0,"cool":0},"WdNqFE9zALngdXXVkFOXdA":{"text":"This pizza was absolutely delicious!! We were craving a little something very late and tha","useful":0,"cool":0},"2TG6sVS7GJ8zZf6Jp2AVxQ":{"text":"We ordered delivery to our nearby hotel on Elk St.\nDelicious, Fast, Hot, Fresh!\nXL 1/2 Haw","useful":0,"cool":0},"u7XlZOo9_IETlq-QQIcP1A":{"text":"Excellent hole in the wall pizzeria! What it lacks in visual appeal, it makes up for in va","useful":0,"cool":0},"5Y_SAMGgzHb-x4-GBieEPw":{"text":"Basic simple good pizza. The front of it is on Bourbon Street. Quick and fast for late nig","useful":0,"cool":0},"idt9cQLMJhGbwxKajGDDsQ":{"text":"The delivery was early, which is always nice. We just ordered a large cheese, it was good.","useful":0,"cool":0},"d1rrnS6pAwNsRCTiebl5Dg":{"text":"this pizza is the bomb. no, not a regular bomb, a nuclear bomb times ten! the srvice was p","useful":0,"cool":0},"N7XSWVtqI-i34qB3gLx-Bg":{"text":"Delicious pizza! Love the Bourbon pizza and pepperoni. Great late night food. Cash only bu","useful":1,"cool":1},"Swuk9pOovvxEB4KjtjmK6A":{"text":"Okay, so I have two things to say about this place. From my perspective, things were delic","useful":0,"cool":0},"vI1Nqw7K8mQf1lHne_kWkw":{"text":"Nothing better than day drinking on the French Quarter and stumbling upon this beautiful n","useful":1,"cool":1},"vI1wILcQj_GKVeAUe66JzQ":{"text":"Late delivery \nDriver could not locate address \nHour and half wait was told 45 minutes \nPi","useful":0,"cool":0},"q02DQzsboxIXbRGmqMgyQw":{"text":"Very good pizza, not the best but def food and delivered nice and hot and right on time!","useful":0,"cool":0},"y3SxDkGtPy3TjGLWfIW3-w":{"text":"Consistently great pizza at 3.50 a slice. Hard to beat that in the French Quarter. There a","useful":0,"cool":0},"agzj944Ns0ULiViJ2bxL8w":{"text":"If you need a greater bread ratio-to-topping ratio to soak up alcohol, this is the one. \n\n","useful":8,"cool":8},"0RCtqOJH1wKyCcHQ1Oa8uA":{"text":"Great priced pizza to have after drinking on Bourbon street. The crust is really crispy on","useful":1,"cool":1},"WxVBHcv6jPVCqDJR-tw2Iw":{"text":"Here on business, was exhausted so got delivery tonight. Chose this place based on reviews","useful":0,"cool":0},"mDcOkpXSZWtUj1316EdQjg":{"text":"Uh oh. The pizza tasted good. Unfortunately, it made me really sick.....I had to use the r","useful":1,"cool":0},"yodMz88rh2K_gR_M5rVKgA":{"text":"Went here for a late night pie. Got the Bourbon Special, and it was delicious. I had to wa","useful":1,"cool":1},"-uG2UPigfyu81q4lM-cKzA":{"text":"The pizza was delicious!! We had a slice every night we were in town for Mardi Gras. They'","useful":0,"cool":1},"zsiaNHK38Hfdw6pSbQAEdA":{"text":"Best pizza in New Orleans. It sucks that you have to go to the French quarter because of t","useful":1,"cool":1},"28ZgekHpPScowuNKmAPzPA":{"text":"The story:\nA bunch of drunk girls walking back to their hotel spot a pizza delivery guy on","useful":3,"cool":2},"Q9ittc-qvuELHoh6jm1l-g":{"text":"It was a decent pizza, good if you want to grab a quick slice.  But, nothing really stands","useful":0,"cool":0},"O_j0hX0HmBngnRd1YMORnA":{"text":"I have to say that this place is awesome!  Found them while touring around the French Quar","useful":0,"cool":0},"nCs66AmSnrL1HnR6Tl3CfQ":{"text":"If you're drunk and need a late night pizza this is the place. But if you're sober don't e","useful":0,"cool":0},"b2zCiVJRD9-SiM1skJc0DQ":{"text":"After a long day of traveling we were so hungry. This just happened to be the first placed","useful":1,"cool":0},"6RuzsDrSX_vRj7irj-KHWg":{"text":"Absolutely the best pizza in the quarter. Service is always prompt and friendly. Pricing i","useful":0,"cool":0},"cbplBamIZpIOBHt1czC9EQ":{"text":"Wow! Talk about a disappointment.  This pizza was recommended by our server at Acme Oyster","useful":0,"cool":0},"TZYNd0XmtLTf0k1usZEueg":{"text":"I literally just wanted a gooey slice of pepperoni. Pics can be deceiving because that's n","useful":0,"cool":0},"mVuPNju9gKBLhILhTBIS7w":{"text":"Oh. My. God. Honestly, I wasn't expecting much. I live here and french quarter food is usu","useful":0,"cool":0},"KB6JSNnMkYq5zU2qUT_aBg":{"text":"Hands down the best pizza I have ever eaten!! It was fresh. The crust  is really light. Th","useful":0,"cool":0},"N2rx7QHNlhIPPZO2r7BX2Q":{"text":"We ordered pizza after leaving Bourbon St (we weren't the drunk partiers, so alcohol did n","useful":1,"cool":0},"umlmw7r1Sgix5Rt7XD3vTA":{"text":"The best pizza on or right off of Bourbon St. hands down. In truth, they have some of the ","useful":1,"cool":1},"7pOCinWOU-HX4K5G7DA6Xg":{"text":"Pizza was good. pizza place that delivers when you're too drunk and don't feel like going ","useful":1,"cool":0},"qzLSDdkYUVQHR20ChxVFTw":{"text":"Decent slice of cheese pizza for a non-pizza town.  Would have liked a veggie slice option","useful":0,"cool":0},"qrcsnpKOR14dmb_R8FMUNQ":{"text":"Honestly, only came in here to use the bathroom. But also grabbed a slice cuz I'm a fat as","useful":1,"cool":1},"YX2-lKlvWXsN0qzVpgywJg":{"text":"Every time I stop in New Orleans I have to come here! This is the place to stop! Forget th","useful":3,"cool":1},"jdnw5OphGw_kQcRONNZsaA":{"text":"this pizza is super amazing. We ordered it super late night and we thought it wld be crap ","useful":6,"cool":1},"xlh-NYmABdBiveW9tFSRYw":{"text":"This place was awesome. Now I do have to say we were all a little tuned up and starving wh","useful":0,"cool":0},"qqMsveIH5bN1MpwmI2p2Cg":{"text":"I am from New York and moved here 11 years ago and one of the things most important to me ","useful":0,"cool":0},"0SY9AA2nTyBA8O7T9kM5hQ":{"text":"This is my favorite late night spot after partying in New Orleans! The pizza is nothing li","useful":0,"cool":0},"YV46mijr3Z9cKQYXCqvPhg":{"text":"My freshman year of college, I came to this place and tried their Bourbon St. Special pizz","useful":2,"cool":0},"HDUKNFKWskzkemOnvIJsFQ":{"text":"We stopped here to get a quick snack.\nThey only had 2 partial pizzas made on the counter a","useful":2,"cool":4},"TYbcSsrRAyvk_PqOs5tp8w":{"text":"Don't order from here on Yelp, for some reason they offer that option in partnership with ","useful":0,"cool":0},"npFt2FcGo2g1PGgUvmNjFA":{"text":"Amazing pizza!!! Vieux didn't disappoint! I highly recommend this pizza! I'm from out of t","useful":0,"cool":0},"JlGVowgcF2rCvUveSk3c9Q":{"text":"Ordered via delivery. I ordered A Greek salad, pizza and pasta. All tasted great. Would de","useful":0,"cool":0},"EVWloETL-01haScmslGTIg":{"text":"Right off Bourbon on St. Peter, Vieux Carre allows you to get in & get out with something ","useful":0,"cool":0},"CgG6wiH8cW2gOwDwGPLxFg":{"text":"Wow! This place is great! Can't say I've ever had pizza like this before, the crust and sa","useful":2,"cool":0},"odTSr8tirPsgMGNE3f504Q":{"text":"My husband swears by this place so I've given it a few tries. As a pizza lover I can be a ","useful":4,"cool":2},"1IxYgyTVonWXAJ54H6_5mQ":{"text":"Easy and delicious pizza after a day or night or enjoying Bourbon Street. Service was grea","useful":0,"cool":0},"QS62UY0-BFE9FyEmIhHZsQ":{"text":"This pizza is Delicious! Been here a couple times. Nope, wasn't drunk either time. I would","useful":2,"cool":3},"vMLMn78ixPJlaaUPoAsZSg":{"text":"Vieux Carre Greko Pizza was the best thing that happened to us all day. We were tired and ","useful":1,"cool":1},"KFOToDkcXvXhd0yszd56Ww":{"text":"I would give this place a 3.5 \n\nWas just looking for a quick bite, in and out midnight sna","useful":0,"cool":0},"YnNKuJS8v4GISSKAqYSRrQ":{"text":"Yum. In New Orleans from out of town and this was just a couple blocks from where we were ","useful":0,"cool":1},"abRGovXtB8uXeM36DG28ZA":{"text":"The food is pretty basic but the staff is ridiculous. The bathroom was out of order but I ","useful":0,"cool":0},"iQTsQpWMPpkSGOA3SigPvA":{"text":"Pizza is my favorite food, so I'm very picky about it. I believe the best pizza I've ever ","useful":0,"cool":0},"DaQzl-lsYh-yrF-QrqE7qQ":{"text":"The pizza here is nothing to write home about. It taste similar to Pizza Hut pizza. The pi","useful":1,"cool":0},"l9C0456LX-q_iQDI4Wy4NQ":{"text":"The pasta was kind of bland for pasta and the delivery man brought me the pizza box drench","useful":0,"cool":0},"EX18ZOaNoOffXuh8K4qzDA":{"text":"The best pizza in the quarter, get the chicken pesto and you will love me for it. its not ","useful":1,"cool":0},"7C5jS4b1f67gr9ULQx5TnA":{"text":"Friendly staff & great pizza. The burbourn pizza was amazing. A great place for a quick bi","useful":0,"cool":0},"0ZNfc5zWoPebjEe3ElWNbQ":{"text":"The best pizza ever! It's so delicious, the crust is not too thick & not too thin. The ser","useful":1,"cool":0},"-8rR3ulfwt-GeCu3t-ueSw":{"text":"Came here twice while I was visiting since it was walking distance from our hotel. Good an","useful":1,"cool":1},"zouCpDsh6RaG9r6890h3JA":{"text":"I'm obsessed with  this place. I'd like to think of myself  as a regular in the French Qua","useful":2,"cool":2},"UqcN0XiLOoo2Ohlia84vyg":{"text":"If you're in for a night of drinking excessive amounts of alcohol (and, c'mon now, who vis","useful":10,"cool":9},"rdjRCk6JWzCyO-kKcL4FIA":{"text":"We just landed in the French Quarter and after shopping at Rouses', we needed to get somet","useful":3,"cool":3},"ZECjoxO94loodA0BlskV5A":{"text":"Easily in top 3 best pizza I've ever had. I got the Bourbon Special Pizza. Crazy simple to","useful":0,"cool":0},"LC_fpdU9eLIGwOyruoA41Q":{"text":"Look, I'm not trying to say this is the best pizza you'll ever have. It may not even be th","useful":3,"cool":1},"llBuzhEVjfUrCNLv4yJHJg":{"text":"This little place is banging out great pizza and wings.  The pepperoni pizza by the slice ","useful":0,"cool":0},"90V96A-qVgVzcEfEXdzFlQ":{"text":"My boyfriend is picky about pizza but we both really enjoyed this place! We ordered for pi","useful":0,"cool":0},"caULe2-ixLCJUw1EQk9L6Q":{"text":"Came here twice - both times drunk, both times very happy. The first night my husband and ","useful":0,"cool":0},"WF2cb5J0MUQmopgHOJwoGg":{"text":"When all things are broken during these \"crazy covid times\" ... I can't express more appre","useful":0,"cool":0},"t5DmJoWX2ekyfuRvirRQVA":{"text":"Food and service was great. Pizza is fresh and the employee working that day, Ahmad, was v","useful":0,"cool":0},"FChsOorWX-RGfqYDvy7QZA":{"text":"My gf & I arrived in NOLA at 2am on a weekday night. And I was beyond hungry. The only opt","useful":3,"cool":5},"Ifp9l8BkV68ngGQIec522g":{"text":"Look closely at the reviews here and ask yourself why you want pizza.  You've been out dri","useful":2,"cool":0},"gxeMXPGj-27TAYvatD4nrw":{"text":"Solid pizza!! Great customer service . Will order again! I ordered in uber eats but had to","useful":0,"cool":0},"9NlpIqK39HVbItC5eNQnjQ":{"text":"Just a great pizza place. Sometimes I'm busy and realize it's late. This is my go to place","useful":0,"cool":0},"x8bGL0YEMxg75ooowPteBg":{"text":"A thicker, breaded pizza without much sauce on a  Supreme - created a pretty bland, dry pi","useful":0,"cool":0},"xAKuR57frtjkqGyolLL6Ow":{"text":"Stayed a couple blocks away at the W hotel....we called for delivery.\nLoved that it was de","useful":1,"cool":0},"oYInpSHpibwSwHSDhb3Pog":{"text":"Great food - we had pizza ( really cheesy). The pasta was wrapped in plastic wrap over the","useful":1,"cool":1},"gMTsZjOppGMD2qD47Rp9oQ":{"text":"The staff here was great! We went back several times and they clearly appreciated our busi","useful":0,"cool":0},"jLjBtvmZGB3kYVW_bieMGQ":{"text":"Great drunk pizza. Depending on the time of day, great New Orleans flop. It's Not fancy pi","useful":0,"cool":0},"KwSTFAcwALbEk9oyN-8v6g":{"text":"Delicious pizza!  What a great surprise.  Piping hot upon delivery.  The delivery person w","useful":0,"cool":0},"txUmi0fch3ZJpe4_Bl8hRg":{"text":"No gourmet fancy-pants pizza here, but if you're looking for late-night drunk munchies, th","useful":3,"cool":1},"65ToitMORKHZweRPENxqow":{"text":"We ordered a large vegetarian pizza to go. We were driving from Houston and were getting l","useful":0,"cool":0},"tMepzBHC0zBPViOGoPaaog":{"text":"Best pizza in all of New Orleans great sizes especially the sides . Great for family event","useful":0,"cool":0},"M7h750B4nizHZhLgiXN9QQ":{"text":"Large bourbon special is always a go to for our group at night. Great service, fast delive","useful":0,"cool":0},"MEvpq9XapWAvT4TSNT0kdA":{"text":"We ordered dinner from here while on vacation. We just arrived at our Airbnb after a day o","useful":2,"cool":0},"d3s0ZhVCXxwxgkAVuJjeYg":{"text":"BEST WINGS: grilled and almost healthy;\nNOTE WELL: Grilled wings are at VCP; breaded and f","useful":5,"cool":1},"35JWskUBymf27DUvYzj2ag":{"text":"i really love this pizza on a night out or after day drinking. they updated the place too ","useful":0,"cool":0},"4XacYeTeZk1mlCwwCF1EYw":{"text":"Bourbon special is a must try but the star of the show for me was the Pepperoni Pizza! The","useful":2,"cool":0},"8Xayzm7Bt0Beqf93OlICug":{"text":"Good pizza in the quarter for when you need something quick to eat to help get you through","useful":1,"cool":0},"UX5T8OTEMcLgIqLyX6mdBA":{"text":"I was not impressed before, but after trying the Bourbon this past weekend I am a fan! thi","useful":5,"cool":4},"dp-LONoQtSoEiHNPs_y40Q":{"text":"No how much you love all the beignets and gumbo that's available in the French Quarter, th","useful":4,"cool":4},"JrlPuIf4Hzt1asiriab6gA":{"text":"I'm pretty sure that Vieux Carre Pizza is really Dominos in disguise.  It looks like a Dom","useful":12,"cool":11},"tNQpV6RrxiML0BEhT26t1g":{"text":"After a long day of walking and drinking i needed a quick bite to take to the room. most o","useful":1,"cool":1},"5EVaKKdpWZV09Mwhh6R59Q":{"text":"I am a foodie ....this is the most arrogant and grandiose place in the city of New Orleans","useful":0,"cool":0},"sDREo_FmgWkkZHaCGajJ7Q":{"text":"This establishment has some of the best pizza my wife and I have ever eaten. If you are in","useful":0,"cool":0},"57fYkTxmJ_I07noUClirEQ":{"text":"Came upon this place by looking up yelp walked over to it about 10 min from our hotel. And","useful":3,"cool":2},"GEGCSxXd4PUSk2kJfAYPzQ":{"text":"Best pizza hands down in the city. We order from here every week. We work on bourbon st an","useful":3,"cool":1},"4QM7XKiAAxjxTxU1lqMwFQ":{"text":"Not bad. Not great. Pizza was 3/5, price was 3/5. Tiny location. This was on a weeknight s","useful":0,"cool":0},"9Klk86Lcgk4qH5DjtpQqAA":{"text":"The pizza here is yummm. If you're hungry, coming from a long night on Bourbon, or just lo","useful":1,"cool":0},"YrMz5GH9eiUHqJsp3EsIzA":{"text":"It's 8PM on a Wednedsay night in COVID-19 wracked NOLA and you want pizza. Not just pizza ","useful":0,"cool":0},"TALNnI9DCHItGAGPEbnIcQ":{"text":"Ordered pizza and wings from Vieux Carew Pizza to go. Have to say that the pizza was ok an","useful":4,"cool":4},"Tmg54SgncFjhcWpwnjbBjA":{"text":"Great pizza spot especially for those late hours. Check your order before you leave but it","useful":0,"cool":0},"tjz9onKoVnYPwdW54qVRkQ":{"text":"The pizza here was actually good. My kids definitely enjoyed. I had one piece and I was sa","useful":0,"cool":1},"1VIDq9CHa3JU9FWiycz3pw":{"text":"Ordered a pizza on a Saturday night at 9:45 pm. I called back at 10:55 and they said the \"","useful":1,"cool":1},"Y8K83ktXZoGzUSFaqRzjeA":{"text":"Vieux Carre Pizza what a life-saver you are. Don't dare eat those pizzas that dot every fo","useful":5,"cool":5},"Bhz0o8V4a_Uus93aOXS9RA":{"text":"Walking around downtown craving pizza. Stopped by Vieux Carre to grab a quick bite. I got ","useful":4,"cool":2},"UwWQLJo9pZIWljNUl3iYeg":{"text":"The meat lovers definitely did not disappoint. The guys devoured it! Crust was soft but wi","useful":0,"cool":0},"WCRrl-mFzaFhORuZjbpZPQ":{"text":"Best pizzia in the quarter hands down! Bourbon special is my favorite! Great po boys. Not ","useful":2,"cool":2},"5_Cmpv6slFIZ4mWFx17KHw":{"text":"This place saved my life. 10/10 delivery service was there in like ten minutes after sayin","useful":0,"cool":0},"yOvTWMpbY7NU-Po0JnZ9sA":{"text":"love this place. open late. super kind staff. great pizza and choices! i've been here a fe","useful":1,"cool":1},"AqiYckriBnxRrTiqVD35ow":{"text":"The delivery to my hotel was SUPER fast and the delivery guy was so patient waiting for me","useful":0,"cool":0},"E_2HXxmJ6Lwg9Q0O8wsZ4Q":{"text":"I am very picky about my pizza and I don't like to try new places very often but my friend","useful":0,"cool":0},"RaWZkvgvlA8o73uDLX6fdg":{"text":"We ordered late night pizza to soak up our voodoo daiquiri and it was amazing! They delive","useful":0,"cool":0},"hGjMt1TxGa1cy9llIdN2oQ":{"text":"Pizza was pretty good. They have awesome crust. We had the chicken, spinach, with pesto. I","useful":0,"cool":0},"JovAqioH192qvb97gIu0cg":{"text":"Every time I visit I have to get a slice of pizza from this place! It's right off of Bourb","useful":0,"cool":0},"xP83bUuzeWoSaPKbRqW5fg":{"text":"Always hot and fresh! And a quick experience that won't kill your wallet. Staff is friendl","useful":0,"cool":0},"fD8xnwIrQwn1qevjWtJpEg":{"text":"Late night pizza fix was average at best but open late for delivery to hotel during COVID","useful":0,"cool":0},"3zimqfrABgJhlSQIcn0YtQ":{"text":"The bourbon special and meat lovers was my absolute fave! After having a hello shot plus a","useful":0,"cool":0},"sgmUD6Jcnn0LIcVbUMlQBg":{"text":"Vieux Carre (Old Square) Pizza is a pizzeria, that caters to the crowds roaming Bourbon St","useful":19,"cool":18},"n3pIkWrh93eVvnK3cU1ZAg":{"text":"DO NOT ORDER FROM HERE. We waited for over 2 hours for our food and they never delivered i","useful":0,"cool":0},"t__AyBy42INOBPwGRe8KJg":{"text":"While out and about the day before Fat Tuesday, we wanted to grab something fast to fill o","useful":1,"cool":0},"c27-HCwlyfjhaOZGijFNzg":{"text":"I think this is a great place for the night owls who are looking for something to munch on","useful":3,"cool":0},"bTjEupgO5AzXb1kKVmZbzw":{"text":"I'm starting to think it's me because all of these high rated restaurants I've been trying","useful":0,"cool":0},"gW7Tk62HJ9Dw4xzaTxAeBQ":{"text":"Y'all. On our drunk adventure from the gay bars, this has been a godsend. It's by the piec","useful":0,"cool":0},"IVzQG2Q96JpwMx6UwM4EdQ":{"text":"I was pleasantly surprised how good the pizza is. This was a quick stop for a slice after ","useful":0,"cool":0},"uqgqynG8AhUCkTa7PA5oVA":{"text":"This place has amazing pizza!!! The crust is probably the best thing about it, but their t","useful":0,"cool":0},"d9ltYP5IBVSsjVe4UKVDlw":{"text":"This little dive have everything one would ever want in a pizza, all in a little spot! The","useful":0,"cool":0},"1hVwaw4WWIcjLkVNdOInuw":{"text":"We ordered pizza very late night to our hotel, it arrived promptly via a friendly driver, ","useful":1,"cool":0},"g1dZpPSUESnUSfFpzqHNVA":{"text":"Good pizza, good price; and delivery was prompt. ~A+. \nI was visiting and needed something","useful":0,"cool":0},"ca7COhRqpGZeSoqyn2svpQ":{"text":"It was great, thin crust and extra onions by request. Prompt and professional delivery. YU","useful":1,"cool":0},"5WENhNiKYF18q4ETYlajnw":{"text":"I wish I had taken some pictures, I really do. Did not think this place would have affecte","useful":0,"cool":0},"ng6tw-15slIk5BZmFrytIg":{"text":"Best late night pizza ever!  Hit this for a couple of slices on Halloween and was absolute","useful":1,"cool":0},"faL8HPnGtrtgPs8ltnnNkQ":{"text":"We are locals who live full time in the French Quarter. Other than Mona Lisa, Vieux Carre ","useful":0,"cool":0},"tkr841PeLMHTTWIHNEyBig":{"text":"The crust is crispy, but the pizza isn't as thin as normal thin crust. Great pepperoni. Gr","useful":1,"cool":0},"Yl6MnsuN1ujIWXoG-vDAmQ":{"text":"Vieux Carre Pizza Ratings: 4.5/5\n\nFood: 4.75/5 - Walking through Bourbon Street and was cr","useful":1,"cool":1},"cs5fAZlPl7bHU9qxM7FD7g":{"text":"3.5 stars could eat there but not a must. We had the bourbon. Good crust for sure light wi","useful":0,"cool":0},"dYB6RrY7LeVDXk-OODjkeQ":{"text":"This is the perfect place to grab pizza after partying on Bourbon. The pizza is actually r","useful":0,"cool":1},"2gYC9RvwLZEl5D0EcgG_9w":{"text":"This is a great little find. It was Daughter #1 who tipped me off to this place. I have tr","useful":5,"cool":3},"F4GwmcopFczMmuW9TPf4TQ":{"text":"Ran into this pizza spot on the way back to the Hotel got the three meats and  a slice of ","useful":0,"cool":0},"Aq3-IsOh_HkxtnC4FCkAYA":{"text":"After a night out in the French quarter and wandering Bourbon Street, my friend and I were","useful":4,"cool":5},"XVKUmc9FqhGtWRLFo0pw-w":{"text":"Visiting from New York. Pretty good. I saw it had great reviews for the burbon slice...Unf","useful":1,"cool":0},"5fBWHtj9yxydGhOFb9d4Xg":{"text":"Had this pizza spot deliver to my hotel during COVID and they handled it beautifully. Just","useful":0,"cool":0},"t8vg4sTMOA2vPtAwUP0iog":{"text":"Pizza was great. Cashier did try to charge us for an order that was not ours last night. H","useful":2,"cool":0},"9Dlr-2d-hDFLANRWWxyQSg":{"text":"Most awesome buzzed eats in quarter. So awesome staff fast in and out and real pizza for u","useful":0,"cool":0},"qJ00mVHeLMXNUIUw-uQ7Fg":{"text":"Okay here we go the place was a complete dump HOWEVER after a night walking Bourbon Street","useful":1,"cool":1},"tFAroS6F2NnSD19IoxKnGQ":{"text":"Just amazing. The price. The slice. The service. Can't wait to come back and have another ","useful":0,"cool":0},"gjJIsC02telhmTEI5wGdJQ":{"text":"Went here for something quick and easy without having to wait in line.The pizza was good, ","useful":1,"cool":0},"qrd4CJQtxjruF_gdnSzI7w":{"text":"There are many really good pizza places in the French Quarter and this one definitely is o","useful":2,"cool":1},"OO4IhyWjiyVzMOf9WUR2jw":{"text":"What a great find!  I was staying at the Royal Sonesta and was looking for something, anyt","useful":0,"cool":0},"bC0H41URPfjHsL2yTUY0Dw":{"text":"Where every every stripper, bartender, and server goes to eat in between shifts. And you t","useful":1,"cool":0},"UMJ8WcsSWi2UG-sl5ohkkw":{"text":"everyone you talk to in the french quarter an surrounding areas, even out on magazine stre","useful":2,"cool":2},"McHB1-7Izq0bU5i59qtxxQ":{"text":"Great late night pizza spot in the french quarter. Cant beat it. Good location near conven","useful":0,"cool":0},"pLIojPW-qCSab-nY2dxlEw":{"text":"Walking the French quarter & was craving pizza. We passed a pizza joint whose food look dr","useful":3,"cool":2},"hkFGAEQh0TDMZCozYBOHbg":{"text":"Best chicken on a pizza I've ever had! It was in big juicy chunks that tasted like they'd ","useful":3,"cool":2},"E_tqV97khcLPKWESML5CdA":{"text":"My wife got sick on our last day in New Orleans so we ordered some pizza and breadsticks f","useful":2,"cool":0},"GRCGO3PQFZkO6Zxi0HeCuQ":{"text":"Pizza by the slice or a whole pizza you won't go wrong. After a few drinks this place hits","useful":0,"cool":1},"uKyYGnUY3cDslvIjKpo9Hw":{"text":"The pizza here was good. Your average after drinking pizza. I got the Chicken Spinach Feta","useful":1,"cool":0},"XIGgYBw0wvjN3qvJUj7Smw":{"text":"I stopped in here with some co-workers after abandoning a lackluster conference reception ","useful":3,"cool":0},"2eaaK34c6vIofRWI3OkP8w":{"text":"I'm chalking up these high Yelp reviews to one thing and one thing only: ya'll ate this pi","useful":8,"cool":4},"rHO2gOqFdhbj3YTulq6Faw":{"text":"The pizza was amazing me my wife n kids loved it we had 3 different kinds as well cheese, ","useful":0,"cool":0},"I4DBELfKQxwk2YaNS984ZA":{"text":"I've been to New Orleans three times now and always stay in the same part of town.  You kn","useful":0,"cool":0},"7hi9yoJavT5YEyJd7pzQFw":{"text":"I don't have any illusions that VCP will win any \"best pizza in NOLA\" awards, but for a qu","useful":4,"cool":1},"zSmGjKZr1Jsb-E0FQ3gLvA":{"text":"For my firs night in new Orleans, I arrived pretty late into the night and needed to grab ","useful":1,"cool":1},"sV2rgsu2fuyZ0jGAesRAyA":{"text":"We ordered late night chicken wings spontaneously and they were great! They took a little ","useful":0,"cool":1}}