{"ndjai8ihDPoXg6FTURJSvg":{"text":"The service is kinder, the poke salad is gone, and more rolls to soothe the American palat","useful":2,"cool":3},"VsSYfXH_o6SxCvujcs7BoQ":{"text":"I have to agree with several people who reviewed Kyoto previously. Decent food, lame servi","useful":1,"cool":0},"4nCySM1FlSdqPl5SAdYrGg":{"text":"I could eat here every night of the week if my wallet would allow me! This is the best sus","useful":0,"cool":0},"RFUhM1HJxPz1WVoHrQBg3w":{"text":"POKE SALAD. That's all I've had from Kyoto and it needs to happen again. It's a slice of s","useful":1,"cool":0},"Eh9X9GvIx8BeA3QxC1bCfA":{"text":"Went here this evening with my gf. Been to this location once before. Sushi is pretty good","useful":0,"cool":0},"JZxJmR7u09bggqwb1bkwkg":{"text":"Still my fave sushi place...maybe it's partially since I can walk there. And I feel like N","useful":6,"cool":2},"55XKEUP_bWUMdTsgt9JsAg":{"text":"I love Kyoto. It's the best sushi in town. The staff are awesome and they have really grea","useful":0,"cool":0},"igMFKh7HIL43T2S4BXRSSQ":{"text":"Really a poor excuse for a sushi/sashimi place. Other menu items are more tolerable. I'm n","useful":0,"cool":0},"cgU24WRSrD4-JtKJlsPL5Q":{"text":"Preface: I am not a sushi person for a number of reasons: Price, aesthetics, and taste (wh","useful":0,"cool":0},"uVzL_YiH7yw3UMGiHXkNag":{"text":"good stuff. I've loved everything i've ordered from here. The Poke Salad is a bit addictiv","useful":0,"cool":0},"u5nnZ2KEf_3nIve65cMIXQ":{"text":"The food was great as always. The service, however, was rude and condescending. Kyoto is o","useful":0,"cool":0},"hl3-awGg9kP2swUrGBoxvQ":{"text":"I saw they had smoked salmon rolls. Wow, that's the same stuff you get in the supermaket. ","useful":0,"cool":0},"rWseapk9nUMn26skj70qGA":{"text":"Unreal. Period. My wife and I have traveled the world in search of good sushi. This is the","useful":1,"cool":0},"Rdx0nmkLGEEmdsoLRz-gHw":{"text":"Disgusting. No. For real. Someone told me Kyoto 2 in Metry is the best. So I figured why w","useful":0,"cool":0},"GiFkn5_43F0kBSqEidyebw":{"text":"There was a roach on the wall, and some gnats flying around our food.  Everything else was","useful":0,"cool":0},"ETHFYzmmdvfVUZe8W5_ldw":{"text":"Delicious sushi; I'm especially a fan of the poke salad and the free miso soup you get if ","useful":0,"cool":0},"9yqIpZvc4zqCOzccwylXLQ":{"text":"The smallest sushi menu I think I've ever seen. Been here twice and both times was a let d","useful":0,"cool":0},"90RBX8VwbpwwU7-_RXZG8Q":{"text":"Great veggie roll, edamame, and spring rolls.  My biggest complaint is that their rolls se","useful":0,"cool":0},"0UCqcC6wDCwpGI6aeY7u1Q":{"text":"This is my favorite sushi restaurant in the city by far. I know good sushi...and the rice ","useful":2,"cool":0},"j48sSAPmZywxaILWuj5Wtg":{"text":"I really don't know how this place is still in business. There are no Japanese people maki","useful":0,"cool":0},"rwzSbR8RbdgqCmi-x6if_g":{"text":"I went here three years ago and loved it. When I went back last weekend, it was a complete","useful":1,"cool":1},"BFKaK3KwPnjzJgqrl66gSA":{"text":"Been waiting over 40 minutes for four rolls. Terrible service. When I asked what the hold ","useful":0,"cool":0},"bXfsOPcVy1TSadIl2uIX_A":{"text":"poke salad, sara roll, sushi to die for. dont believe the 3.5 star rating. this is one of ","useful":0,"cool":0},"iaVWZN1oPnEwTO3YPqOJZQ":{"text":"Food overall: 4 stars\nPrice value: 4 stars\nFish Quality: 3 stars\nService: 4 stars\nCleanlin","useful":0,"cool":0},"BJ9Eb4MdBfSQb7ltCgZjvg":{"text":"This is probably my favorite sushi place to sit down with friends. It always has a great a","useful":1,"cool":0},"lI7Zo7yUZXmMw5F0_1PTUA":{"text":"Went for lunch today.  Apps were not bad.  But we ordered two specialty rolls at $15 -$16 ","useful":0,"cool":0},"pISARhDQPcNGeUZxRcE9yA":{"text":"Kyoto was really great service and a clean restaurant. We had great attentive service, the","useful":0,"cool":0},"KQPr9vdPAr1vqHDdjOu9WA":{"text":"The sushi is excellent, but this is THE place in New Orleans for udon.  Nebayaki Udon here","useful":0,"cool":0},"ZPTYJ1btfadTv_9FHr1SWg":{"text":"It's so rare that I go to a sushi restaurant and not order rolls, but my friend insisted t","useful":0,"cool":0},"vZ2knDdA1Y2cOpEYP_illg":{"text":"Decent, not spectacular. A lot of the more inexpensive rolls are chopped up fish mixed wit","useful":0,"cool":0},"p3rUL056e7pHd_RaWy4kqg":{"text":"I love Kyoto!!  It's definitely one of my favorites in the city.  The Sara roll and the De","useful":0,"cool":0},"gJc9nemJknVMhAMab-sOzQ":{"text":"I don't pretend to have any particular knowledge when it comes to sushi or Japanese food. ","useful":1,"cool":0},"bX3jQqhlcU_94L_igkNICQ":{"text":"Kyoto is the perfect neighborhood spot to enjoy incredibly tasty rolls and bump into frien","useful":0,"cool":0},"tz8P2pNoSl8SRa6mWwTjwQ":{"text":"The sushi here is so bland! I can't believe it has good Yelp reviews. I'm amazed. I got th","useful":0,"cool":0},"NgYDuXuyDNpA3Q2B9H81XQ":{"text":"Kyoto is my local sushi place so I thought I'd give this place another try, but my most re","useful":0,"cool":0},"VVGi7dVQqLN_Gv7dbnnRkQ":{"text":"Excellent sushi rolls. They have the basics, but also offer creative daily special rolls a","useful":0,"cool":0},"U3ozyPJCbDulo28JzEptsA":{"text":"The rolls are not as good as some other places in town, but then again, the prices at Kyot","useful":0,"cool":0},"Aq713aNGxp2qkQISbcXinw":{"text":"Excellent casual sushi!  This place is not fancy, not trendy, but serves good sushi at a g","useful":1,"cool":0},"BfmfOEsCTXYinUtkOeH1hQ":{"text":"Decent sushi, but honestly--the menus were so filthy and stained--like they went through t","useful":0,"cool":0},"H9350b5a24SVKN2gpiKYzQ":{"text":"I love Kyoto. I think they have some of the best value, freshest, and tastiest sushi in NO","useful":0,"cool":0},"ybF195rabz8-udfIcq2Scw":{"text":"This used to be our go-to sushi place for years - especially for the Poke Salad. Tonight w","useful":0,"cool":0},"fzuaJv7Y_x3SfUhzJzX-Eg":{"text":"Salmon Roe was good and the sea urchin but all the rice rolls we ordered were sloppy and t","useful":0,"cool":0},"dIz8aVXBnQRBU72lwU9K3g":{"text":"If the service was lousy, the atmosphere unpleasant, and most of the dishes on the menu in","useful":0,"cool":0},"hjBSUzbH-6bVqxs7Ress3w":{"text":"The food is not bad but they have a huge bug problem, there were roaches crawling all over","useful":1,"cool":1},"9QZ_yZ09EbjIttnu4v_oYw":{"text":"Came here while on a bachelorette party in town.  They were able to accommodate our large ","useful":0,"cool":0},"KDwUYOtRqTnc_W6dTF2aFw":{"text":"Staffed by an anonymous crew of ninja-outfitted college boys for whom this is obviously th","useful":0,"cool":0},"-tVtfp2iP8UGcCo_YTjM9Q":{"text":"Just had the yellowfin tuna roll and funky margarita roll takeout. Wait was long (45 mins)","useful":0,"cool":0},"W5J8ijPlvP10OGgcBbSuGw":{"text":"My chief complaint of Kyoto is that it is FREEZING, so cold that I can barely sit through ","useful":1,"cool":0},"VrlUDwWRNqWEX4vOjLvjuQ":{"text":"I haven't had much sushi since ive moved to NOLA but I'm a big fan of this place. Definite","useful":0,"cool":0},"n8SC2H-S2MiVWCr0vP9aGA":{"text":"I wasn't expecting to eat good sushi while I was down south, but this place exceeded my ex","useful":0,"cool":0},"U8GeLgpRQWb8pI6NurYrEw":{"text":"absolutely disgusting. the absolute worst sushi i've ever had.  the pieces were too big to","useful":1,"cool":1},"0qG_YmZ6ynNpYzSqA1nS5w":{"text":"Hands down, best sushi in the city, IMO.  Everything is always delicious.  I find their ro","useful":0,"cool":0},"q4KGTwqTrJ1WjioMN8bz7g":{"text":"This was recommended to me by co-workers and several clients. While New Orleanians eat cop","useful":3,"cool":3},"PkfEUJ2l1YeoS6RAZRF68Q":{"text":"Good enough for this American white boy. I'm sure many sushi snobs will tell you Kyoto is ","useful":0,"cool":0},"2iY45KF01-JfSH2mKL43NA":{"text":"My favorite sushi place in the world. I love it. I love the same serves that have been the","useful":1,"cool":0},"CYLFtjOXdi3-UVOPE4Hgqg":{"text":"Novio and I have eaten great sushi in New Orleans, New York, Puerto Rico, and Japan(Disney","useful":0,"cool":0},"bejIRiWQI_V6E9siIrzXcw":{"text":"This was the first sushi I tried after being in New Orleans, and I was a bit skeptical, bu","useful":0,"cool":0},"LSDno85z8L5uTgij9sKSQQ":{"text":"Went here tonight to check out a new sushi place, and we werent disappinted. it's pretty s","useful":0,"cool":0},"GdK9eMfrK1lgGIIWOHU-Og":{"text":"Horrible. I have friends that rave about this place and have also read good reviews, so ma","useful":1,"cool":0},"9NmOB2n3-0mPxcxNB2dFgw":{"text":"Oh Kyoto, how I adore thee. You must recognize my face by now, as I visit you so frequentl","useful":1,"cool":1},"ohi9HkANyN2yxEp0HPvzNA":{"text":"I have been going to Kyoto for a long time, and it is still my favorite sushi in the city.","useful":1,"cool":0},"re8FCPcbBhyj1hfU7oslbA":{"text":"Uninspired Americanized \"sushi\" AKA haphazardly cut up raw fish!  Got the sashimi dinner. ","useful":3,"cool":0},"aitruJz1cy_-YSqaS5cJBg":{"text":"The best sushi in New Orleans; Mikimoto is cheaper (and has a drive-through) and Sake is f","useful":0,"cool":0},"S43NpscEdNbSGHcidd7bIA":{"text":"Kyoto is the closest GOOD sushi restaurant to my house so if I'm in need of a quick sushi ","useful":1,"cool":0},"Moz2bc9TyKP7WDYH5d39gg":{"text":"Kyoto reminds me of one of those cozy little sushi joints in NY on the corner.  The atmosp","useful":1,"cool":1},"HPT4vxIrA9RctBUB70XMoA":{"text":"When I lived Uptown, I ate quite a few more meals at Kyoto than I do now. I like Kyoto, bu","useful":3,"cool":0},"cRR2fGUdvfMtC3IA_jgVcA":{"text":"Shortest review I have probably ever had, POKE SALAD!!!!!!! Its all you need.","useful":3,"cool":3},"atDl7_5_0w0Ra31oWhIfIQ":{"text":"Great rolls, quick and friendly service, large beverages.\n\nGood place to go when you want ","useful":0,"cool":0},"UWwYJjU8Lck3BZwNTgQMHw":{"text":"May be my favorite sushi stop in the city. An old friend made me a chirashi over the sushi","useful":1,"cool":1},"KA1mhQ5NyC-E2KB0XUZVNA":{"text":"Tried this again. Epic fail. What takes so long just to take someone's order? The food was","useful":1,"cool":0},"glYL3HR5yVIRtFCialHESg":{"text":"I love Kyoto - the sushi is amazing, the staff is very friendly and professional and helpf","useful":0,"cool":1},"PkT-4SW5_FXQhCz3eB9NCA":{"text":"Excellent dinner last night with my frequent dining partner Randy.  I absolutely loved the","useful":0,"cool":0},"a9kn_DmUY2TItM7DqNhrvw":{"text":"I've only been twice, so I may have to give this place another shot since it has so many g","useful":1,"cool":1},"669YbVbGFrA-fWFnE4nNlQ":{"text":"GREAT.  Sara rolls awesome.  Fast.  Closed Sundays.  Uptown.\n\nMaybe best sushi in the city","useful":0,"cool":0},"ca-rRuD_uPTBf4xNCGYyDQ":{"text":"It's just gotten worse. I think the original owner is no longer there. It is Filthy. Unkem","useful":1,"cool":1},"11y--sXry-vrWq6mJGmbAA":{"text":"Kyoto is one of my favorite sushi joints and I wish I would eat here more often. It's a co","useful":0,"cool":0},"4XNUETWkyrrvHn2-yVwZmA":{"text":"The food is OK, but the service is really bad.  We went on a Monday night, and it took 40 ","useful":1,"cool":1},"JNLDeu4CLo4LgAzfzKcMMA":{"text":"Kyoto is a nice little neighborhood sushi joint.  It's not fancy, and coming from San Fran","useful":0,"cool":0},"ghQy2Nk2yPYFKd5jzPp79Q":{"text":"I've always been a lurker here on Yelp. Always reading reviews but never writing any of my","useful":3,"cool":0},"HfefiHYxdH2zOoR5Uoaz2Q":{"text":"Super friendly staff and yummy fresh rolls made for a great quick dinner last night!  The ","useful":1,"cool":0},"rMO1Esi9ho0RnI56pZufGA":{"text":"Great sushi! Good service. We have tried several sushi restaurants in NOLA and this one is","useful":0,"cool":0},"c-itb1I8xdfvJzWo_hvRjQ":{"text":"Recently went here with a friend after seeing all the great reviews on Yelp. We ordered th","useful":0,"cool":0},"KMKQE7nkO0vfApaJvdDieg":{"text":"I walked in and ordered to go sushi and didn't have to wait long...and that is about the o","useful":0,"cool":0},"6RZRhOYnQVryRp4kE2eAZQ":{"text":"Oh dear - the poke salad. I eat it and think \"I could die right now. No, really, I could.\"","useful":0,"cool":0},"fvGcAbrOoaLXqzOfpAqAVw":{"text":"Although I really wish it wasn't closed on Sundays, this is a great New Orleans sushi plac","useful":1,"cool":0},"4VmLwe_7YyHfKAbcfdZS7g":{"text":"Well I was disappointed this time. I've been here several times years ago and I remember t","useful":1,"cool":0},"t14yfxl_TrB4sU0TJcMJfw":{"text":"Kyoto is my hands down favorite place for sushi in New Orleans. \n\nThe fish is always fresh","useful":1,"cool":0},"LnLvWHWculzmcy3LvdbM9Q":{"text":"The price range is expensive! Had two rolls and a hamachi coma and four drinks which total","useful":0,"cool":0},"L8K07BiDfFPxTXT7TAKPqQ":{"text":"Excellent Poke salad, Ceviche roll, but my favorite is always the Sara roll.  \n\nPlease not","useful":0,"cool":0},"tuXvRqUr6Xts7akG8R1MqA":{"text":"Worst Japanese restaurant I've ever been to. The place needs a thorough cleaning from top ","useful":0,"cool":0},"YLiMU2qEKzzfDUO2N8jtLg":{"text":"My experience here was SO disappointing.\n\nI had been waiting for months to go to Kyoto.  I","useful":3,"cool":1},"b42t-WYkM482LTctm5w65g":{"text":"With a heavy heart, I have to drop Kyoto down to  3 stars. They have been my go to sushi p","useful":2,"cool":2},"BhwdZjJ4mo9bvbTiCibuzw":{"text":"Food tasted okay while we were eating it, but within an hour after eating, both my husband","useful":1,"cool":1},"GTg6eFbUOU05gRJrF3tP6Q":{"text":"I love Kyoto. I love Japanese food. I love walking the streets of Japan dropping in and ou","useful":0,"cool":0},"kwN5JsTLkU2rzSY3ew-_5A":{"text":"This is our go-to sushi restaurant in the city; \nreasonable prices, great, creative, fresh","useful":0,"cool":1},"1RIxBAm8vYNSyjk3s8aTkg":{"text":"Came here for my third sushi meal and it was great. The fish was fresh and the flavors wer","useful":1,"cool":1},"IJGJMGQouvAi4s6l_hc8Ug":{"text":"I don't think this place is a good Japanese food.\n\nThe rolls is ok but for the teriyaki is","useful":0,"cool":0},"apNWNenxxHLr1kCoj7alxA":{"text":"I'd been to Kyoto before, and was not a huge fan. However, since then I've moved much clos","useful":0,"cool":0},"ew-LBQHIFWpbPlJ_QdrGfg":{"text":"What a great sushi place!!  The fish was fresh, and they had great rolls.  There were also","useful":1,"cool":1},"vO0FzesIaEpof7NE5PyvbQ":{"text":"My favorite of all NOLA sushi places.  Last night I had the rainbow roll and the white fis","useful":1,"cool":0},"i0RRPBnHEfjPl_FhVj4bVw":{"text":"Ok... totally my favorite and has been for years.\n\nThe tabo roll is joyous, the sara and t","useful":3,"cool":0},"P9ns0cFadN9u80dF4hxOYg":{"text":"Sat at the sushi bar with my wife, trying to catch a movie at the Prytania down the way...","useful":1,"cool":0},"aOZ8uunFbtn_CLQe0VmSEw":{"text":"This place is filthy, it's close to my house so I wish it was better but the place is craw","useful":0,"cool":0},"-b69G0zoBpZfg032Df6s6w":{"text":"I wasn't blown away, but the experience was definitely pleasurable. The edamame was a litt","useful":0,"cool":2},"ZS7H4ppaq5_SmjeXOQVXCQ":{"text":"Was looking forward to this place as I have heard great things. However I was fairly disap","useful":0,"cool":0},"oJTkL55IgTXzAgPA4doMSg":{"text":"At first, I was a tad sketchy about this place. My first impression was that the building ","useful":0,"cool":0},"f5BjFt4ijf-LUYV-kftkcg":{"text":"I frequent this joint because it is a pleasant walking (and drinking) distance from my hou","useful":1,"cool":0},"mPLRywY6YaRyb4N29Hc-Dg":{"text":"Poke salad is my favorite thing to eat here, fresh and delicious.  Some people compare it ","useful":0,"cool":0},"_O1OFUaWer6zAjof9dx6rQ":{"text":"This place was great.  I walked in at 7:45 on a Saturday night to place a to-go order and ","useful":0,"cool":0},"coXHQQeCrh0jBWG70BwNwQ":{"text":"We love sushi and were intrigued to try Kyoto when we saw our favorite rock n sake rated #","useful":3,"cool":0},"Qsue2sV0CQxA-Es0zLBWYg":{"text":"I absolutely LOVE the poke salad. I have been a few times JUST for the poke salad. The rol","useful":0,"cool":0},"mpMsQ-BHklJwPKuzciAaNw":{"text":"I have ordered takeout several times now & every single time I call the wait time is ridic","useful":1,"cool":0},"u1ml_hGOdwcoIogvtrbt5Q":{"text":"Kyoto is perfect. It's reasonably priced, especially given the quality of their rolls. A b","useful":0,"cool":0},"_eEKV-V5_8zulJgQgTsJcw":{"text":"I went to Kyoto today with my boyfriend for lunch, neither of us having been there before ","useful":1,"cool":1},"IQiLzJ_xHtz2pjD8Aevamw":{"text":"As a long time costumer I have never had a negative experience at Kyoto it makes for a gre","useful":0,"cool":0},"cWufXq2ulvocQydRoz-r3w":{"text":"I lived in an area of Hawaii with a high concentration of authentic and quality sushi, and","useful":1,"cool":0},"rfI1IHh54d6DS8CxRxNXzA":{"text":"Quick service, good sushi, great atmosphere. Chicken teriyaki is good too. Have been here ","useful":0,"cool":0},"7yB6ib029HcObZFEj4FdYw":{"text":"I LOVE KYOTO. I have been obsessed with Kyoto since I moved to New Orleans 4 years ago, an","useful":0,"cool":0},"dUzlCOWEEArJQZ0RL20sAw":{"text":"Kyoto let me down.\n\nFor many months I have been wanting to try Kyoto. I had heard good thi","useful":5,"cool":1},"mY3B7vSefgKEu24RAoYYEw":{"text":"Bigger is not better, at least when it comes to sushi rolls. Each piece was at least two i","useful":0,"cool":0},"KVbVP8xCxrEAXxRkxxghqQ":{"text":"Food took too long to come out. We had ordered to go dumplings, spring roll, and a sushi; ","useful":2,"cool":1},"Coukf7tEJ3Zf_heXbV-a-w":{"text":"Kyoto is one of my favorite sushi restaurants in New Orleans.. maybe it's because I've bee","useful":2,"cool":0},"Pchz8VLXWnvTmK1MBoy2fg":{"text":"I feel bad about only giving 4 stars because I really do love Kyoto.  I think it is the be","useful":6,"cool":2},"BWWYmX1X5CUOBdmJKXuqpA":{"text":"When I'm in the mood for cheap sushi, I come here. \n\nTheir poke salad is delicious but the","useful":0,"cool":1},"O25ZGrZDBdzGCwjcOYElLg":{"text":"The table service is inconsistent but the fish is always fresh and our food has always arr","useful":1,"cool":1},"Wd22_0qju4Jf5Hk_7gniug":{"text":"After dining here a few times, we realized that the poke salad and margarita roll are the ","useful":3,"cool":2},"S_WLdA36U6nPijWspMlcCQ":{"text":"My favorite sushi place in town for the price. The poke salad and the Sara roll will chang","useful":0,"cool":0},"eqavI1k1gfqVx9ufykHcIA":{"text":"Kyoto is my favorite sushi in New Orleans. Granted, we don't do sushi incredibly well here","useful":2,"cool":1},"zvfWY8Ah7D9sv3ivvYOBSA":{"text":"Sit at the sushi bar and get unlimited miso? Woah, I'm in soup, salad, sushi heaven! Check","useful":0,"cool":0},"VAQwEvnlDNmu0BLYRhg-mA":{"text":"Although New Orleans boasts a good number of sushi restaurants, Kyoto is by far the best v","useful":3,"cool":1},"6uUf-hX8hr-GIVtopjp_kg":{"text":"I wanted to like you Kyoto, I really did. But you have really gone downhill. Over 10 years","useful":3,"cool":1},"PfvzlZBe3kz5ffdvEc-j0Q":{"text":"In my opinion, best sushi in New Orleans. Sara Roll is definitely the way to go. Sometimes","useful":0,"cool":0},"PJy7yRgwKFXRgYOCkA1M8A":{"text":"I love the variety here - plenty of great and creative sushi options.  The beef/any type o","useful":0,"cool":0},"tbuH3HP_MPyYsGvKMx3dUQ":{"text":"Kyoto is one of my, if not my most favorite sushi place in New Orleans. I used to live in ","useful":2,"cool":0},"JRg1mSfB0XRXy9Aw_PW9Cg":{"text":"I really don't know how this place is still in business. There are no Japanese people maki","useful":0,"cool":0},"lKcCzAdd1M6GQYlm6HriVA":{"text":"The best house salad of any sushi restaurant where I've eaten. Amazing carrot dressing. Th","useful":0,"cool":0},"tEVVhU0q3uclutDNGcC6tw":{"text":"Agree it's great sushi.  Best vodka and tonic in the city.  Live the Sara roll and Poke sa","useful":0,"cool":0},"_hfWVVltenCHu9Nhmcmdvg":{"text":"I've been looking for good sushi restaurants in New Orleans and this is the best one I've ","useful":2,"cool":0}}