{"_xUhbydbVEspF4WrhToCzw":{"text":"The food here was good, but nowhere near competes with other restaurants in the French Qua","useful":0,"cool":0},"A3KHQ_8J2aHDu52xdNTQ6A":{"text":"Spending the day in Nawlin's ... got hungry and stopped in for a bite.  The wait was extre","useful":2,"cool":0},"98wiayrEV-2jyScWcZQ7wQ":{"text":"Tourist trap.  Bland & boring food with inattentive waiters.  The fried alligator was pret","useful":0,"cool":0},"w1AqmvA7mBSC492yhSGIRw":{"text":"The location is ideal, being right next to Jackson Square. There are lots of tables so bei","useful":0,"cool":0},"9MaJ1T5J4Hk0kl-yqiqmEQ":{"text":"A po-boy is simple. French bread, lettuce, tomatoes, pickles, the stuffings and hot sauce.","useful":0,"cool":0},"abj8OByVbk9YBt2rtZw5zQ":{"text":"The bbq shrimp were great, flavorful, spicy and succulent.  Fabulous garlicky bread came w","useful":0,"cool":0},"V90IMF_9yIs7GbU5SB2FzA":{"text":"Busy, noisy, risk being lost in the crowd but if you get your order you will love it. Of c","useful":0,"cool":0},"vxn-gyBzh1uSUjxnIy6Dwg":{"text":"Avoid! Great location with dynamic view of Jackson Square, but it has nothing else going f","useful":0,"cool":0},"nKRe0uVkmmWZd_s5tGojiA":{"text":"Service is terrible, food is ok, location is great (which is why the average yelp review i","useful":1,"cool":1},"FyhYAlL1BzP-LQAIGJjSFw":{"text":"It was an overall pretty average dining experience. The wait staff was friendly but nothin","useful":0,"cool":0},"9u71JMoEPQP8TJOfAIbypA":{"text":"We went here for dinner tonight, before we went out to Bourbon street and the atmosphere w","useful":0,"cool":0},"eDE-1bu3v-sumc0RHsLbiw":{"text":"Not that great. We went for breakfast. The drinks were fantastic but the food....not so mu","useful":0,"cool":0},"7I5az-cEqVuv1VsfEwWDEw":{"text":"Really enjoyed the blacked shrimp and fried oysters.  Great service, even in the middle of","useful":0,"cool":0},"oO-Iqg0BJBYkW593wQadlQ":{"text":"Food was awful!!!!! Tarter sauce tasted old, gumbo tasted like air freshener, and even the","useful":0,"cool":0},"JvbAOpHgNy3x6HkytgM0Xw":{"text":"Five stars is not for the food because I did not eat there. Five stars for the open sittin","useful":0,"cool":0},"l6KOkPHfA55LeOLsyjHQRA":{"text":"This is one of my favorite places to eat in New Orleans. I make it a point to get the comb","useful":1,"cool":0},"peiLgGW0zDlt-_MCwVoTpQ":{"text":"This was the worst dining experience of our entire trip to New Orleans.  The place is in a","useful":1,"cool":0},"hiQBOsN6-zFt1ISEPR3Ehw":{"text":"Dirty and gross. Stay clear. This was a friends choice for Sunday brunch. We got the last ","useful":0,"cool":0},"hVGYlpUcCarD3P6gZYtbvg":{"text":"Average food, great location, small portion sizes and slightly higher prices. Move on peep","useful":0,"cool":0},"P1OnbGfDuYL5EXaq4ICCkA":{"text":"You can't go wrong here. Great food and a good view of the street performers in Jackson Sq","useful":0,"cool":0},"9iTwhPybmuCW4yidXK82xw":{"text":"Solid French bistro style brunch. Very tasty food. Great location, quick service, but limi","useful":0,"cool":0},"eBoegIQGcZ-LjL2DUvNxRw":{"text":"My friends and I stumbled upon this place for brunch on our first day in New Orleans and a","useful":0,"cool":0},"pF87YFtAkEd-8fcXtzzC3w":{"text":"Currently here. Took 15 minutes to get a cup of water. Our waitress is extremely rude and ","useful":1,"cool":0},"_eyS3MM5x80Wk-s6cwEq9w":{"text":"Bartender Eric was kind and helpful in a very timely manner- he immediately greeted us and","useful":0,"cool":0},"pEl-RfBS7hZ3soTWr8lTCA":{"text":"I really love Cafe Pontalba.\n\nLocated at the corner of Chartres and St Peter Streets, over","useful":0,"cool":0},"W1Vo8a5F4L5lBm4QVzrt1w":{"text":"The best part about this place was that the waiter was very attentive to our needs. \nOn th","useful":1,"cool":0},"KJjzPBYR-prPPl1rATMeRw":{"text":"Breakfast- good view, good service, food was just ok. Listening to the street musicians wa","useful":0,"cool":0},"iLqCFQAWztvqdqIERrY8hw":{"text":"We had tried to get in a couple other places at 9:00 on a Saturday night.  This place had ","useful":0,"cool":0},"GznUnzI2s0Z-stbI7ImaRA":{"text":"Loved it!! Service was great! Loved that the oysters were coated in corn flour instead of ","useful":0,"cool":0},"NJR9P5eVupQztDazPMkTGQ":{"text":"I was torn about whether to give this place one or two stars. Our dining experience was te","useful":0,"cool":0},"q9kyGfMLFB5kXzqaP3mykQ":{"text":"Total tourist trap.  I had an oyster po-boy which was just - not very good. - I've had muc","useful":0,"cool":0},"LaRXw5qtwEeFMzMf_RyLUg":{"text":"This cafe has location going for it, but to the food, I say \"meh\". Tasted more pre-package","useful":0,"cool":0},"lVrn5majETj_DsAX8ACOig":{"text":"Crab cakes with poached eggs are so yummy!we got right in the view was beautiful looking a","useful":0,"cool":0},"YXpxb9tMK4b_wER4Qm3flQ":{"text":"The alligator appetizer is delicious! Order it half fried and half grilled. It's so good, ","useful":0,"cool":0},"OP6wJ1fBj1CdsyQeFXzmxA":{"text":"Claims to have the best bloody mary in the city. Don't believe it.\nIt just mix, vodka and ","useful":0,"cool":0},"_brGNp5pEODUfxkNhwBCKQ":{"text":"I am still tasting the gumbo, fried and blackened alligator + jambalaya. And I ordered a s","useful":0,"cool":0},"L6MhEgFC018Li3epJIv7NA":{"text":"Breakfast was great, we even went two times on our vacation. As for the service, it was ho","useful":0,"cool":0},"u6n-D0SdRgWrwb_N8rc_gQ":{"text":"After walking around last night we decided to stop in and have a late meal. \n\nFirst thing ","useful":0,"cool":0},"A8UF9DIM7J3xBY8qdhPjzQ":{"text":"Bar far some of the worst food I've ever had.  I ordered the jambalaya, I've heard that it","useful":0,"cool":0},"gWuYEHSK4hxgZ1MiTCP8SA":{"text":"Everything about the food at this place was mediocre.  We ordered the red beans and rice a","useful":1,"cool":0},"eAS53L1zfEwYghvOp_L6Fg":{"text":"if only I could give 0 stars. service was terrible. food was terrible and cold. eggs bened","useful":0,"cool":0},"mwRSocN2zu15AwZYBuFeqg":{"text":"Loved the atmosphere. Sitting with all the doors opens listening to the activities in Jack","useful":0,"cool":0},"dAM2XpjO1UYJHLXbwiNrig":{"text":"Loved the location right at Jackson Square. Quick service and we were out of here in 45 mi","useful":0,"cool":0},"BvHINH-HExMdX9OqLAk35w":{"text":"If I could give it a zero star I would. Wish I could also tell you how the food was. But a","useful":2,"cool":1},"K0xcPGbYCUbrtrMB59LG5w":{"text":"I love the location of Cafe Pontalba next to Jackson Square. I really came here for a Caju","useful":0,"cool":0},"JWrgDK3g7_ZNV8T98x4PUg":{"text":"Came here once during our honeymoon. Not sure where the negative  reviews are coming from ","useful":1,"cool":0},"oabm6c6m54u3B5IqosR3JQ":{"text":"Skip it and walk down a few blocks for better food and service! ...\n\nWent with a few famil","useful":3,"cool":1},"zBbvcO7TOfG1mCKEZiPw2A":{"text":"A wonderful location, right on Jackson's Square, but the food.... bland, underseasoned, an","useful":0,"cool":0},"_voTo6QGZbTET2ZY9HJuDA":{"text":"My favorite place in NOLA. The sweet tea is awesome. The Jambalaya is great. The Crawfish ","useful":0,"cool":0},"ZWs9DG3TSsl0V6hcZVcVIg":{"text":"Service and food under par. They capitalize on their location and forget about the quality","useful":0,"cool":0},"I5xfuWEoeUt59XX4ryme1w":{"text":"Wouldn't eat here again. Small portions for the price. Food had zero flavor and the servic","useful":1,"cool":0},"aMWgAdsJDKM9dpXxGT2p1A":{"text":"The standout here was the crawfish pie. The creole was good, the pasta was solid and well ","useful":0,"cool":0},"s28Kx9s7xFNZ6y89p2bnhQ":{"text":"The food was mediocre at best.  I was with a party of 6 and one of my friends wasn't even ","useful":0,"cool":0},"TkiOCSqlpR9LCx9c7eBTXQ":{"text":"Our waitress was very knowledgeable about Gluten Free menu items (I have Celiac Disease, s","useful":0,"cool":0},"eHKtevcFU93a70tyGvIJoQ":{"text":"there was a long wait, but it was dinnertime and there was a party of 12. what else would ","useful":0,"cool":0},"9eh9gwJtnlTW7nF2IwVPLA":{"text":"Pros: \nLocation\nWaitress is friendly\nOpen windows face to the crowded street\n\nCons: \nWorst","useful":0,"cool":0},"wn38HgpzNpr9CXc8jvdqGQ":{"text":"I'm always a little wary of restaurants located right in the French Quarter. Because it's ","useful":1,"cool":1},"PiuRJrYYkmZf9JgnCHU-cg":{"text":"This wasn't our best experience. Waitress was much more interested in talking to staff tha","useful":0,"cool":0},"p3UK2MwyBSQaA2M3bQ1UZg":{"text":"Ended up walking into this place New Years since everywhere else had long lines. I had to ","useful":0,"cool":0},"bEy_sRqTexcMEpbhOBVoEg":{"text":"Food was awful, there were bits of shell left on my shrimp in the etoufee and the shrimp w","useful":1,"cool":0},"okifQUnpF0RJEjxslt0XUw":{"text":"Great place on Jackson Square!! Excellent atmosphere and people watching in The Quarter. T","useful":0,"cool":0},"gGOb0sKm-C5YaEivW4FvcA":{"text":"Great place to sip an Abita and people-watch Jackson Square.","useful":0,"cool":0},"WsYlK3szFeGzJ0ypGy129w":{"text":"My mother in law needed to use the restroom in Jackson Square. The sign said that restroom","useful":4,"cool":0},"d0bGpwaQQoIZkAtk6VK1IQ":{"text":"Good service on Mardi Gras! Atmosphere is busy as you would expect. We ordered Alligator b","useful":0,"cool":0},"vnM7pywbLOTfJgvNvVUMiQ":{"text":"So disappointed in this cafe. For starters our server Kate had the personality of a slug. ","useful":1,"cool":0},"PWeoUF6a-enM_Mvs9wKCWA":{"text":"This place was just average mainly based on our server who was rude.\n\nGreeted with if you ","useful":0,"cool":0},"8YSngEaT7Bxz9ujGg7-tzA":{"text":"This place was amazing! I got the crab Benedict and it was so delicious. Not only was an a","useful":0,"cool":0},"ikXHch7DtJ54dPK_0qN1Hw":{"text":"Super crowded, but great atmosphere.  This restaurant claims to be in the oldest apartment","useful":0,"cool":0},"N09dIDx0LYjY3N22IwjNVg":{"text":"Nothing exciting here. The food was good and quick. The location is nice and we didn't wai","useful":0,"cool":0},"VaUIlGuZt0NOsxXiX_a8xA":{"text":"WARNING: 15% Gratuity Will Be Added For Parties of 3  \n\nUnconscionable adj. referring to a","useful":2,"cool":0},"fqRGNnpxfQyDiQDtaAyPYA":{"text":"Don't do it!  Don't spend a dime in this place.  Even though they're in the perfect locati","useful":0,"cool":0},"CM6cVg-yUZaBiqUhQoTkLQ":{"text":"Great little restaurant right on the corner of Jackson Square. I ate dinner here my first ","useful":0,"cool":0},"qZcY9345NWkOt9YSw2ruSw":{"text":"We loved the service here. Our waiter was one of the kindest, most attentive servers we ha","useful":0,"cool":0},"ormUCo1w1mZ_FhtJ_YlVKQ":{"text":"What a fantastic introduction to Cajun and Créole cuisine; jambalaya, gumbo, rice & beans,","useful":0,"cool":0},"XuAs729CpKYAa_gOnm3vDQ":{"text":"The cafe is a great spot to catch a meal while people watching. They open the side windows","useful":0,"cool":0},"sXikJxcIkSE-xWmW8JL9wg":{"text":"The crabcakes here were definitely better than the ones i had in Maryland! I was a bit dis","useful":0,"cool":0},"wPB5jvR3bWmjyMq8yINLVA":{"text":"The oyster Po Boy tasted good until I got to the crunchy shrimp tails in the batter and so","useful":1,"cool":0},"rhdSlMjfiHJ179bMBlSQHw":{"text":"Zero if I could. So far, I've had to locate a server only for a buss boy to seat us, and t","useful":1,"cool":0},"jKhgZcHcfUGe31rOhRReSA":{"text":"Came straight in and sat at the bar. Had delicious shrimp creole, jambalaya, and calamari ","useful":0,"cool":0},"JiAcELKEHDRIHTjNQlo8cw":{"text":"Visited Cafe Pontalba due to their close location to Jackson Square. Location wise with op","useful":0,"cool":0},"ewYxCuYl6KawuvYtFLi_LQ":{"text":"Cajun Combo had a cup of gumbo which was good, followed by a plate with a scoop of white r","useful":1,"cool":0},"5yHt2Y7oT2ND0cSgQRPB2g":{"text":"The food was pretty good, but the service was terrible.\n\nMy girlfriend and I arrived as th","useful":0,"cool":0},"uoVT2pvfvqELDjG6Jf5gGA":{"text":"We stopped in here 3 different times.  My husband had a Bloody Mary and really liked it.  ","useful":1,"cool":0},"NAUtGAV-toFv-fFIkMy_VA":{"text":"The service here was great.  We had two different waiters helping us, and all our food and","useful":1,"cool":1},"pbklvHzU3JOkkYKKsHtNiQ":{"text":"***15% GRATUITY AUTOMATICALLY ADDED TO BILL***\n\nAs mentioned above, a 15% gratuity is adde","useful":2,"cool":0},"nQyBVOk13JgWCGdYnZfQPw":{"text":"Service was slow to start, however, once the server approached us I was very pleased. He w","useful":0,"cool":0},"m58EVL9eWDDI6NBGHRfC5w":{"text":"This place was a huge disappointment. For the price you really get what you paid for. The ","useful":0,"cool":0},"HXixwXL3Uj_Y_vGK9JHHNg":{"text":"Good location, right next to Jackson square with a nice view, but disappointing food and s","useful":0,"cool":0},"svT5_3UeX0YuO9dKYDXiZQ":{"text":"We visited this place while strolling the French Quarter. We were checking out Jackson Squ","useful":0,"cool":0},"iD-3IqeTwJNKOu0o5PlISA":{"text":"Ordered the jambalaya.  What I got was 2 cups of seasoned rice, still shaped like whatever","useful":0,"cool":0},"OtmlvyfWce1NzW0_XvX1Gg":{"text":"WORST RESTAURANT EVER. I went there a couple of years ago did not care for the food. I wen","useful":1,"cool":0},"h-S2-w34S6TCNbJqsLTlQA":{"text":"Ate at Cafe Pontalbo this evening. Blackened gator was just as our server said it would be","useful":0,"cool":0},"Kz7IzpxNwLDHc3hOYys_2A":{"text":"2 stars for location. Zero stars for food and service. One would think with such a great l","useful":0,"cool":0},"7dA7fYQ1n6Jjl8q2EbabDQ":{"text":"This is a great restaurant.  The food quality varies somewhat depending on who is in the k","useful":0,"cool":0},"uc6xtnKU42CEb_8Zvk62ig":{"text":"Don't eat breakfast at Cafe Pontalba!\n\nThe orange juice was bad. The grits were runny, uns","useful":3,"cool":1},"YH4DX3cXLZJnEyH4M7OtKQ":{"text":"After a hot day of walking around the Quarter,  following a great graduation day at Tulane","useful":0,"cool":0},"I9dA7E0y9K9a0S3YwGr-7w":{"text":"This  place used to be good they changed the menu now it's just crap food, gumbo was like ","useful":0,"cool":0},"YALEnHRTOqn_d95njxYFVA":{"text":"Food overpriced for New Orleans breakfast. Unbathed homeless frequent the front steps. Caj","useful":1,"cool":0},"ta5wXbbKM1uhawQFClrA-w":{"text":"Key lime pie five stars, yum yum and my husband really liked the shrimp po boy four stars ","useful":0,"cool":0},"t1J6WhCPlYh_Pm7QCHHLcA":{"text":"It's pretty cut & dry.  The menu has a fair amount of variety on it.  Chicken, shrimp, pas","useful":0,"cool":0},"V8gvqrWDYulPhc4-LvpUPg":{"text":"This place is what you would call a tourist trap. Conveniently located on the West corner ","useful":0,"cool":0},"KRsdyhFdvlGug1rNVdSsaw":{"text":"First, the location is great! Adjacent to St. Louis Cathedral and the park. You seat yours","useful":0,"cool":0},"iSXuyrUWsC-h-5b6sCeg3g":{"text":"Mediocre food at best. Th etouffee was flavorless and watered down. Not much seafood. Serv","useful":0,"cool":0},"UObvhyKild2frLpBwhBk2Q":{"text":"Cafe Pontalba is a basic \"French Quarter\" cajun dive. They serve up decent food, but certa","useful":0,"cool":0},"84AG3uETs7WpubJZ3quGOQ":{"text":"Terrible choice!!! My hubby and I were looking for a good restaurant to feed our starving ","useful":0,"cool":0},"2blI-rfxQqtdsaDBH3QcwA":{"text":"I visited Cage Pontalba early one evening a while back for a light meal before joining a t","useful":0,"cool":0},"CRfy88XrIlf2VjURoRroyQ":{"text":"First time in New Orleans and obviously first time at this cafe. These people are absolute","useful":0,"cool":0},"Ymnqxd8fsLYN-_Srw8aoIw":{"text":"Great red beans and Bloody Mary, nice spot to people watch and the service was great. Staf","useful":0,"cool":0},"b20D5R_5dTJB6g8Kfn8Z4A":{"text":"The food deserves 4 stars, the 15% gratuity added to the bill for a party of 2 ruined an o","useful":2,"cool":0},"Zl7iHAs37Bcdj-Ht2J_45Q":{"text":"Just stopped in for a quick bite and the food was simply amazing. After being in New Orlea","useful":0,"cool":0},"3PTW6lFspNFR2YvdnKYa7A":{"text":"Not sure why this place doesn't have better reviews. Sure it's a bit of a tourist trap bei","useful":0,"cool":0},"AmTiY0qH3m5afR6frG6P_g":{"text":"This cafe looks upscale but is actually not. The food is ok but pricey. I ordered key lime","useful":0,"cool":0},"mdIuRroW3LQI4jrec-Wb5g":{"text":"It was good. The shrimp Po boy was fantastic. The jambalaya was okay. It was a little crow","useful":0,"cool":0},"S6pNOlNLmmK7dklQbCez5Q":{"text":"Great place for lunch or dinner. While visiting New Orleans, my family found this cafe aft","useful":0,"cool":0},"llmgcTuVJv3XiE8d560JAg":{"text":"The sausage po-boy was very good! My wife enjoyed the red beans and rice. It is in nice lo","useful":0,"cool":0},"RISPM6nCWIoMqFMvqi3UVw":{"text":"Great food! Fast service! Right near the live entertainment and artists at Jackson Square!","useful":1,"cool":0},"Mo65YhOAecUpMVaLYsmSNw":{"text":"This was my first experience when it comes to creole cuisine, so I don't have much to comp","useful":0,"cool":0},"TiejK1_WepZp2v7aTLvI5g":{"text":"I don't know why this doesn't have a higher star rating this is one of my favorite restaur","useful":0,"cool":0},"FxQbqzXL3JPKuDEkM9pIrg":{"text":"On Labor Day morning most of the French Quarter restaurants that were open were full with ","useful":5,"cool":5},"YFk2Gh3-t8X6YyV18xCopw":{"text":"Came here on my last night in New Orleans because it had a nice view of Jackson Square and","useful":0,"cool":0},"yXiG36LVOTSTuktKqzs9SA":{"text":"This is a solid meal option for NOLA.\n\nThe venue is very cute - large floor to ceiling doo","useful":0,"cool":0},"gGcu1WJ3B7iK2kH2q7C_Fg":{"text":"The Shrimp Creole alone makes this 5stars. Quick service and good menu. Also, a decent win","useful":0,"cool":0},"q1DWEYKDS4OdVVEe29MZnQ":{"text":"The food was decent in taste but portion size is not big. My husband and I actually went a","useful":0,"cool":0},"1uxP7Iu32XRK_jhF3Gav2Q":{"text":"We sat right down in the charming restaurant and had a fabulous breakfast of French toast ","useful":0,"cool":0},"TLuHNjDMEkgKHBloNc6Oag":{"text":"Service was a slow start, but ultimately the food was good.  I think they are busier than ","useful":0,"cool":0},"eKpr1EjqXoGH5AIE4NeGRQ":{"text":"I'm not a local of \"N'awlins\" but I'm pretty sure this place is a tourist trap and you sho","useful":0,"cool":0},"MdVmy9VhD7xaEGZNhWF-3g":{"text":"I didn't have high hopes based on the reviews, and the location, but it was actually prett","useful":0,"cool":0},"PoeuIvQq4O7QuzpQLf70Gg":{"text":"Good vibe, decent food, terrible service\n\nWent in a Monday night and spent the first hour ","useful":0,"cool":0},"Kt-qaH_qUWf6BmcK5V7H3w":{"text":"We've walked by here a dozen times but like someone else mentioned, it always just seemed ","useful":0,"cool":0},"xpXobfhMRGSyacQEBxszqw":{"text":"Not a good choice. At all. The food was sub par. The gumbo arrived luke warm with very lit","useful":0,"cool":0},"7prZnm7aEUCAzF7rO0tZUQ":{"text":"We went in this place at the last minute to eat dinner. The food was excellent, but the sp","useful":0,"cool":0},"ALYwtNnrgGcae0iYzJ4wCw":{"text":"Food tasted good. Quantity and price was disappointing. Too pricey for the amount of food ","useful":0,"cool":0},"WENVRkg4etf4aktVHEMNiA":{"text":"Crawfish Pie is spicy flaky and delicious!!!!\nRagin Cajun Pasta has a creamy tomato sauce,","useful":6,"cool":5},"3XX1rvOVqQZkGCCd8V8K4Q":{"text":"Don't know anything about Cajun food, but it was delicious! The Cajun gumbo was spicy and ","useful":0,"cool":0},"A6Bqp8cIezGXDdW3uh1lNw":{"text":"Inedible!!!! I ordered a poboy to go for my grandmother and she was unable to eat it. It t","useful":0,"cool":0},"Go6r9KM3OD8sqNInKbTsBQ":{"text":"Staff quickly took our order. I asked for eggs Benedict, but asked to omit the ham. They d","useful":1,"cool":0},"tp6elthUyv9TeUSCi_9t4w":{"text":"Cafe Pontalba was our first dining experience in New Orleans.  Thankfully, it was a great ","useful":0,"cool":0},"ym1YlBAOO1a2aVfJC5iyUQ":{"text":"Ordered the Crab Cakes Benedict with Cajun potatoes. The flavor was excellent and the pres","useful":0,"cool":0},"PsFohqydvEgCc__sG8_20A":{"text":"Very poor food ordered the Cajun burger so greasy and horribly season ed it was not edible","useful":1,"cool":0},"Rp47bPwSOUVw54z4I_5LDQ":{"text":"We loved this place!  The atmosphere was great, service was fantastic and the food was exc","useful":1,"cool":0},"ly_qiUj-DiHrr1Fnik_CDg":{"text":"Great location!\nGood food!\nNice decor!\n\nWe stopped in here for a bite for lunch after ridi","useful":2,"cool":2},"Mfdftviz3CPSR9aQAE6wBA":{"text":"This was the first place that we ate at when we got to New Orleans and immediately wished ","useful":0,"cool":0},"-dml15jfC0_Gs9nU8OxcBQ":{"text":"We eat here just about every single visit home and especially on Mardi Gras day. The menu ","useful":1,"cool":0},"1WvVAG9knsRbxNOLlIlr6w":{"text":"Good stop if hungry and in a hurry. Nice view from the corner of Jackson Square and has th","useful":0,"cool":0},"LDuG7Xa8vs2pAnLsEfg6eQ":{"text":"I went here for breakfast. I ordered the jambalaya omelet with grits. The omelet was ok an","useful":0,"cool":1},"MdL8-dEy1s3jvren4GVRXw":{"text":"We came accross this place while walking at the square. It looked to be a good place with ","useful":0,"cool":0},"bHXMd8uI0fWcgnubx54UwQ":{"text":"If ur going to the bar here I PROMISE IT WILL BE A WASTE OF UR TIME!!! Sooo we came here t","useful":1,"cool":0},"q7Ph3JfrHPKMM_MlRuEmzw":{"text":"Too much grease, a little lacking in flavour, shabby interior - but fast and friendly serv","useful":1,"cool":0},"5FVbfCInNTlbtkmT_XJ8aQ":{"text":"Wow. What a disappointment.\nWaited half an hour to be seated.\nI had the Fish Pontalba - su","useful":1,"cool":0},"aEv1e-9UCL0yxbkBQahBPA":{"text":"Delicious food! I came here 3 days in a row for the fried fish and shrimps. The prices are","useful":0,"cool":0},"ty3W06hYckYYYPF8dkGN0w":{"text":"Good food. Husband had red beans and rice. I had pop corn shrimp and gumbo! Friends had pa","useful":0,"cool":0},"qbc26BipB9ynZHWPaAQx-A":{"text":"Came for breakfast. The food is ok and the service is attentive. Maybe is a NOLA thing but","useful":0,"cool":0},"2QufBE9PqxHxWVLJIAuoNw":{"text":"This place was on point. The food was great and the bartender was awesome as well. Very at","useful":0,"cool":0},"aBrc4r7LiU9yXO12mwI7CA":{"text":"We did a hangover breakfast here. The food was good and the location is awesome. The servi","useful":0,"cool":0},"j20IEt-lJK85POu-0Yf8zA":{"text":"Absolute must eat when in New Orleans!!!! Best food we have had during our vacation! Gumbo","useful":0,"cool":0},"q6GJryYKJN_y6kVzUx851Q":{"text":"It was just ok nothing great the service wasn't even ok I don't think I would ever come ba","useful":1,"cool":0},"i63XzEvefLXEiqa5fudvKA":{"text":"A nice place to eat here in the Jackson Square area. Food was conveniently enjoyable. A ni","useful":0,"cool":0},"nzs5UgGcpRKUEwZCrAq3bw":{"text":"Overall an average place to eat, good for anybody looking for food. We stumbled in on than","useful":0,"cool":0},"cGWLuQLoucPBWB-dRV-Lgw":{"text":"The best I can say for this place is the location is excellent! It is right on the corner ","useful":0,"cool":0},"S1RfvHg4BP8X19SLbJHTIA":{"text":"Disgusting. The shrimp Po Boy was not as described and was the shrimp was fishy tasting an","useful":0,"cool":0},"2hAUMZL55RBsb1JHjRIeuw":{"text":"Poor service! Food is everything but tasty. The New Orleans Special is nothing special. Th","useful":0,"cool":0},"WPjeZdA0TiYUJM-RdlWnOg":{"text":"Great place to eat and people watch. Good hash puppies (off menu) and incredible creole an","useful":0,"cool":0},"Qn2QAt4BLJ7iwT5ykWWD3g":{"text":"Very inexpensive but a huge no no for cocktails.  My full review. Ordered a Sazerac.   Not","useful":0,"cool":0},"6G-KW4-Pwsbo5oSheaifHA":{"text":"Had the Cajun Benedict for brunch with grits. Was not bad but nothing like the other New O","useful":0,"cool":0},"z7CtVWlxkKvX9ICAI1c_HA":{"text":"Atmosphere and service made a two star food rating into a three star restaurant rating. A ","useful":0,"cool":0},"qnG8RgEh2gBJWAaa9ZcTRQ":{"text":"Waitress clearly did not want to be working tonight. House wine was pricey and horrible. C","useful":0,"cool":0},"qP1EoyNOlS224pq-Esizag":{"text":"I and a few girlfriends who live in New Orleans decided to play tourist and spend a night ","useful":0,"cool":0},"jb50iOl0lm2uJnDWDVzkBQ":{"text":"Very appealing and in a great location, possibly the most redeeming quality of this restau","useful":1,"cool":0},"U_aMB8fHTLzaiylGwMSp6w":{"text":"What a cute little place smack in the middle of the French Quarter. Came here with friends","useful":0,"cool":0},"o0UynWkiHi5UteFT2i1lCw":{"text":"Our meal was tasty, but came out cold. We had to ask them to warm it up. Our service was g","useful":0,"cool":0},"UyowdWYnQ1ve00xhRkI3Bg":{"text":"Went here just because they had the blackened alligator.  Which happens to be my new love!","useful":1,"cool":1},"np8vUtH-BwPSsKI1ZAYx9w":{"text":"Stopped here one day while out with the family in the Quarter. The food was amazing and th","useful":2,"cool":1},"ufirxNiPvDpFIFVebLcgrg":{"text":"There are so many great restaurants in the French quarter, don't waste your time here. Blo","useful":0,"cool":0},"tFA5-vdIv8DqQLl7ScnEew":{"text":"Awful. Awful. I can cook better in my dorm with a hot plate. Shrimp Creole is ketchup and ","useful":1,"cool":0},"jao7M8B4Sz5hJWRlDFF6RQ":{"text":"Red beans and rice were really good! Jambalaya was not as good as I had hoped though- gumb","useful":0,"cool":0},"qfle4msOQVNl_t7f25DppA":{"text":"3.5 stars. Awesome location right off of Jackson Square. Food came out quickly and was goo","useful":0,"cool":0},"r9nc5Mhupu1zIlEe0D02hg":{"text":"We ended up coming here because the Gumbo Shop had a really long wait. The service was fin","useful":0,"cool":0},"78u2Fjl4jq4Pr3QnG6RQbQ":{"text":"We tried the étouffée at this little place by Jackson square.  It was pretty good.","useful":0,"cool":0},"BmEtvzF5Zf9gzt9w88fbug":{"text":"Terrible service. The waiter didn't seem to care about us at all. Had to send all of my fo","useful":0,"cool":0},"JrIveDrQtA0opQFnNFKwYg":{"text":"I was worried this was a tourist trap being so close to Jackson Square. I was really surpr","useful":1,"cool":1},"XMDCLl_pTXUf86X-S3iHzw":{"text":"I've been coming here for 14 years and it never disappoints.  It's less crowded than some ","useful":0,"cool":0},"kVqk9CAFKVs2LtMHFSwoWA":{"text":"As a local, this place was terrible, dirty, under seasoned and overpriced. Red beans can s","useful":1,"cool":0},"mT6XC_QwbOkNayWkhephAQ":{"text":"Located in a great location server was very friendly and helpful we had fried alligator as","useful":0,"cool":0},"XaM6SWkFRZGz1sC9EJid8A":{"text":"Small little restaurant off Jackson Square. I had the Blackened Steak and Egg. Let me tell","useful":0,"cool":0},"NZh2Y6Dm_Enbo2WjG6g3jQ":{"text":"Great view.  Great view. Great view.  It's right on Jackson Square. \n\n\nThere are many othe","useful":1,"cool":0},"V1zTpblBbcWmtyeiw1JNTw":{"text":"Ok. We got the seats by the doors so we could people watch. I'd say good is just ok starte","useful":0,"cool":0},"TJ1ztTT_ATmA1ueoO6Xz_A":{"text":"Decent service in a nice location but the food does not taste good. So much salt in the gu","useful":0,"cool":0},"Yz5vh5c-i6TnjAqxSQW8Pw":{"text":"Worst place to eat in my opinion. The crawfish etoufe cam out at room temperature. The cra","useful":1,"cool":0},"tjHL1UKUDWETON6ETlK3Ow":{"text":"03/05/17 - Cafe Pontalbella is in a great location right by Jackson Park. This was selecte","useful":1,"cool":1},"awqykkpKcyTdVfH2tvESxA":{"text":"Great location.  Beautiful space.  Crab with poached eggs was choke your mamma salty and m","useful":0,"cool":0},"OvG-iAeigOKOVCt5BnoDdw":{"text":"Had lunch here on a recent trip to NO.  It was ok.  Don't think I would go back though wit","useful":0,"cool":0},"OyaRtYltCOYfak_d8InFQQ":{"text":"Located in the heart of Jackson square this place offers all the typical New Orleans flavo","useful":0,"cool":0},"kLObDES2QbwUJXiI_8JaQQ":{"text":"I read some of the reviews but like always decided to go to this restaurant anyway and sur","useful":0,"cool":0},"JrEFs3RCk6YVqjZiS-b5RA":{"text":"Red beans and rice are awesome. Wife had flat iron steak and loved it.  The complimentary ","useful":0,"cool":0},"onXqvYxHdBSK7roOwdAKwg":{"text":"Had the eggs benedict- it was delish! The line to get a table went really fast and our foo","useful":0,"cool":0},"NE8RrX3RBPS7mTa0-VXt5Q":{"text":"Came to New Orleans for the first time. Walked around French quarter and was hungry so I w","useful":0,"cool":0},"VI7ymjBWwawBs6eVmDStqA":{"text":"We were a large party but they got us in pretty quickly - took our orders and both food an","useful":0,"cool":0},"xM96oGNtFmsU52uzYwSLrg":{"text":"If you are in Jackson Square and don't feel like dealing with the crowds on Bourbon Street","useful":0,"cool":0},"sOAoD0Ok3CfChtMw57G8Jg":{"text":"I loved the roast beef poor boy, and went there twice just for that sandwich.  My friends ","useful":0,"cool":0},"oE2UrrJQ5Xm4Dz_cN0wDyQ":{"text":"3 of 4 in our party ordered food.  One was recovering from some illness (food poisoning?) ","useful":0,"cool":0},"W1XYQDywmC_Tme6YFGgjpg":{"text":"Loved this place. Great spot next to Jackson Square. Corner location wide open to all the ","useful":0,"cool":0},"xzSUNTDw4avk8SBUMAErjQ":{"text":"Again... poor decision on my part for not reading reviews!!!\nUsually I have good luck with","useful":0,"cool":0},"TRdP7rXcJ7sAqxoBsMFX8Q":{"text":"I know that this place gets mixed reviews, but my friend & I enjoy it so much that we make","useful":0,"cool":0},"nxsM8I73Gq8VK84dOTyIVA":{"text":"Went here for lunch on a Saturday with 9 people.  We were unable to sit together, but that","useful":0,"cool":1},"57MFOSptQBVBD21ptzqUFA":{"text":"Atmosphere was nice. No frills eatery with floor to ceiling windows. Our server though was","useful":0,"cool":0},"T9iGMXGI1-X4D7cMXgyYtQ":{"text":"Early was amazing! Great food recommendations! Great drinks!!! The creole pasta was to die","useful":0,"cool":0},"jmrD1QnNq4y0-xmBzis0kQ":{"text":"Rude.  Watch out for this tourist trap.  Tried to squeeze five of us on three sides of a t","useful":0,"cool":0},"w4NqDLOlnVYSVJA_uJwDig":{"text":"Great place with simple menu. We've been here a couple times and have enjoyed a new plate ","useful":0,"cool":0},"b2P1cD2dTxIHwaU-TeehpQ":{"text":"UGGGGHHH.  Yelp, why must you be right when I want you to be wrong?  While trying to dodge","useful":1,"cool":0},"NBrJ67wCjsWEvMA6HTP6Vw":{"text":"Horrible experience. I've never wrote a review for anything before this. It was so bad I f","useful":0,"cool":0},"5SCf3XwTwL0spW6g77b8Lg":{"text":"Great service, fantastic view of Jefferson Square. We had half fried/half blackened alliga","useful":0,"cool":0},"CWnVxrTI0cBj3N25CCT9mw":{"text":"Location is nice as it is close to Jackson Square.  But the food is not very good.  Had th","useful":0,"cool":0},"lXoD_aOYLnSO3mm1sORUtQ":{"text":"I'd say this is a solid option for a quick-ish meal in New Orleans. \n\nFirst of all, the lo","useful":0,"cool":0},"zoQs0svauCJWMHUOwssVaw":{"text":"Great views of Jackson square and reasonably priced food. Had the shrimp po boy and wasn't","useful":0,"cool":0},"4BGpivuZ1z5Uay7745Vq5w":{"text":"Food is decent but small portions for $10-12 plates.  Got a seat right quick.  Bugs me tha","useful":0,"cool":0},"qsLOYn8T3Cz25E-t1CQRsQ":{"text":"Excellent food and views. The gumbo was flavorful not over spiced, the Jambalaya was to di","useful":0,"cool":0},"TBPkr-c7iieDD_--kd23Xw":{"text":"I ordered the cajun omelet. All the omelets cone with grits. Really tasty omelet filled wi","useful":0,"cool":0},"HnVn6Q4Sg4sNlEvg56n42Q":{"text":"Absolutely my favorite place for red beans and rice.  We eat here every year (sometimes mo","useful":0,"cool":0},"cwPquxDU7YhtcHbzE6iiNA":{"text":"I'm a military man who grew up in a strong military back and if you know anything about th","useful":0,"cool":0},"uJf9WaZNHrO4BPYlJa33lg":{"text":"The food tastes like bleach and I'm not even kidding. For the sake of your health, please ","useful":0,"cool":0},"IWfk18KG2uQvTGUHxsri9Q":{"text":"We stopped by here after touring the French Quarter for a bit.  The original plan was to g","useful":0,"cool":0},"J7v-YusugQCvSkLW4qbHzg":{"text":"Located right in the heart of the French Quarter, there's a certain novelty to eating here","useful":1,"cool":0},"CH0vh4myHU3LmtumGXUNvA":{"text":"Cafe Pontalba was one of the best meals that I had on this trip to New Orleans!!  \n\nI fina","useful":3,"cool":2},"Tesx9C3r09_bo0LkZnAzvA":{"text":"Cafe Pontalba was a great place! It's on a corner of the main square with a great view of ","useful":0,"cool":0},"QWejXfH0vYzQj6ZetQPZoA":{"text":"Pleasantly surprised by this place. Open air right on the Square on a July night. The food","useful":0,"cool":0},"k6dgNrxM32pfGneaj0iodg":{"text":"So not impressed with this place,  it's deceiving as it looks inviting but takes some time","useful":2,"cool":1},"rGkzSsAwShe4sEQKr4p79Q":{"text":"We had breakfast here and it was a normal, southern breakfast.  The service was fast and o","useful":0,"cool":0},"-7dgRjbIYNx3xVh7_WBQrg":{"text":"My wife was hungry and tired (terrible combination) so as the rain started coming down as ","useful":2,"cool":2},"VKNEoO8SqbJIEadhu4Ujxg":{"text":"Drinks To-Go: stick with the Louisiana Sweet Tea. Pretty good each time. I veered once and","useful":0,"cool":0},"n29aCtgoyXtFnJQsOaqg8g":{"text":"Decent place if you want something to eat just to eat. Nothing to write home about. A frie","useful":0,"cool":0},"l1qINY4-_ojesREUVP51CA":{"text":"We were walking around and came across this place. It was decent. Nothing to write home ab","useful":0,"cool":0},"aJVjkjZxGMQvSK3M9EAX_w":{"text":"I had lunch here on Saturday w/ a couple of friends. The service was good, but I can't bel","useful":0,"cool":0},"HgqiMjYFbaf4hvx30X6CFQ":{"text":"AWFUL! This place had disgusting food (made me sick to my stomach).\n\nThe service was poor ","useful":1,"cool":0},"h7o1WDev6vKnggyZRSCS2w":{"text":"I can only rate Cafe Pontalba for 2 stars-one for atmosphere, and the one for service.\nAs ","useful":0,"cool":0},"UNo44lyPY-zsYaJ3ItaBig":{"text":"My husband and I tried to eat here for lunch but it never happened. We stood in line for 1","useful":1,"cool":0},"R6WRDIwPz2s38IwUNe8zdw":{"text":"Overall this place is decent. Service is fast and friendly, the location and atmosphere ar","useful":0,"cool":0},"n1dmeRh9u7sPcR-TdXLZtQ":{"text":"Had the best bar server server. She met our every need. I had a mimosa and hubby had amber","useful":0,"cool":0},"J2ln_HSxhl-V-iWXIKXW6g":{"text":"This little restaurant was located right by Jackson Square with all of the local artists. ","useful":0,"cool":0},"0FqbfHJrDAmcvamF0AZ0VA":{"text":"This is hands down my favorite place in NOLA! When we came back to NOLA again this fall, t","useful":0,"cool":0},"lERvMW99Gpyh9eKB2dmV2w":{"text":"Mediocre food and service, at best. The location of Cafe Pontalba is what gives it foot tr","useful":0,"cool":0},"cs73l1IjaW7W8DdwZ2epnw":{"text":"** SERVICE CHARGE IS AUTOMATICALLY ADDED INTO YOUR BILL. \n\nIt's on Jackson Square, easy to","useful":2,"cool":0},"yOLc2s_KPq9tfKUlacfkwQ":{"text":"In a word, don't.  I was hoping for so much more but good grief, the food sucked !  Nice l","useful":0,"cool":0},"SP9HFccGfp64UYZEnFt2nA":{"text":"Great stop in Jackson Square. Had the best service from our waiter Lee. Great cocktails fo","useful":0,"cool":0},"AG325_vzg8hKovfzwZWhGg":{"text":"Great location and ambience, perfect for people watching and taking in the street life. Ho","useful":0,"cool":0},"3D08-wV_qGgmH0nj0mVmRw":{"text":"Very good and spicy gumbo, beans and Jambalaya.  The best gumbo I have had.  Excellent loc","useful":2,"cool":1},"Jn7mWmSWFw5WwAMegyC7cw":{"text":"Meh. Sit down restaurant with puny disposable plastic cup Bloody Mary's! Not impressed. Fo","useful":0,"cool":0},"BUgSFIJ8T5oiNi9AIgibug":{"text":"Mediocre food at best -- and unnecessarily expensive!  They also included 15% gratuity for","useful":2,"cool":1},"Tex9Fgg17MhtpI-NEzXbGg":{"text":"My husband and I disagree. I'm a strong 2 and he is a 3. Either way, the food was good, se","useful":0,"cool":0},"HFpnzHFfeHRhT7DFOOPl6Q":{"text":"Perfect location..lovely view of the Basilica.\n\nIf you must eat GF, this is not the place ","useful":0,"cool":0},"hlRFk-gfrz5ZzsJW05NVsg":{"text":"Started off with the barbecue shrimp, then had the Alligator Salad with a side of mashed p","useful":0,"cool":0},"DECzI_ybcxGKPC-47mN4Yg":{"text":"Breakfast was not bad but nothing special. The crawfish omelette was good as was the crab ","useful":0,"cool":0},"4MhhZcMSKzqIuq1-pDcb4A":{"text":"We stopped in while looking for a place to have brunch and cocktails. Pleasantly surprised","useful":0,"cool":0},"tOzOGx9PrwSFaIAhRWkxiQ":{"text":"So we've been going to New Orleans at least twice a year for about 10 years to attend vari","useful":1,"cool":1},"5bDf9WY26XmNrJudH-g1eA":{"text":"Stopped in for breakfast but it ended at 12:30 :( had the gumbo but it was a little underw","useful":0,"cool":0},"wCizMvsS0S0wgYDXYeA3hw":{"text":"The location is very nice, as you get to view the corner of Jackson Square with horse and ","useful":0,"cool":0},"2S_A42YlLywkrqZeM0vGWQ":{"text":"The food was ok. I had the shrimp poboy and the best part was the bread. The fries were ol","useful":0,"cool":1},"0kbs0jf6KkQ0HcvuTWVXIg":{"text":"This might be the best place for a Bloody Mary in town, complete with a few spicy pickled ","useful":0,"cool":0},"YMDsdjhkh6w9hC2DD7NTWw":{"text":"Touristy place in an awesome location.  The open air environment is really cool, but it al","useful":1,"cool":0},"NG4LrNH21zEVjyy-etdVDw":{"text":"My husband, daughter, and I ate here for dinner last night. We were looking for authentic ","useful":1,"cool":0},"y9UTUPjky2oMG9TzCHciCw":{"text":"We had a very enjoyable dinner last night. I had the fried Seafood Platter and my wife had","useful":1,"cool":0},"T4hTfYmC6Np1HaR3ErmMPQ":{"text":"The service is great...however the food lacks everything! Everything was dry, no flavor!!!","useful":0,"cool":0},"GRot3BJZZg7k_qQRuTSiaw":{"text":"Great place for lunch when walking near Jackson square.  The gumbo was very good and the B","useful":0,"cool":0},"r2Jh12ZmZMV-NVlMTKltFQ":{"text":"Blackened skirt steak Caesar salad hit the spot.  Place is touristy so I wonder about the ","useful":0,"cool":0},"OTkLpZAYnb9ZCvlJs6cBQw":{"text":"I wanted to have dinner with New Orleans. That's exactly what I got here. The location is ","useful":0,"cool":0},"XWQfLNwnfT_k1H0IBkQHlA":{"text":"The food is ok, and you definitely pay for the view... the restaurant is pretty open and l","useful":0,"cool":0},"AZXS9-ntXQByYLHh3zpwUA":{"text":"Seat yourself location with a good menu of items to choose. The server was quick to take a","useful":0,"cool":0},"SYczweYHB0Tx-BxJO-72yA":{"text":"Stay away from this place. Their bread is tough and stale, meat is dry, the french fries o","useful":2,"cool":1},"4rEKtHHtOGxGuVudTwyltg":{"text":"We come here for brunch when we over sleep from the night before in NOLA. They are some aw","useful":0,"cool":0},"9Q7t4Oz6yQy9zJ1kE2RH3g":{"text":"In a city with so many amazing food choices a mediocre meal is a huge disappointment. I en","useful":0,"cool":0},"GfF4H6buaDhM9WANZktntg":{"text":"Nice atmosphere with the open doors to Jackson square, very relaxing.\nStuffed mushrooms we","useful":0,"cool":0},"zmL3IRSaOzRuMWngI6s8TA":{"text":"I had the garden veggie pasta saluted with a cajun cream sauce and tossed with penne pasta","useful":0,"cool":0},"WeXMGHUGo5xkXQuz3a1x7w":{"text":"The place is ok.  The crawfish pie was decent, it had a homemade crust.  The portions were","useful":0,"cool":0},"VMw9o3hwPDXAVCfdTqrjUQ":{"text":"OMG! Where do I start\n\nCons: bad food they brought my French toast out twice and it was un","useful":1,"cool":0},"85vNn6Bz7rK65CqCE8stLw":{"text":"Fantastic Bloody Mary, great service, great atmosphere next to Jackson Square. Highly reco","useful":0,"cool":0},"-tgJQ384P18l6zrOjR3Ruw":{"text":"You're paying for the view. I got the Ragin Cajun pasta, my mom got a steak and my brother","useful":1,"cool":0},"0caGzP7GptmW7d5YeQ4kLg":{"text":"This lives up to its yelp reviews. Food was not great, I just picked at it, even though I ","useful":0,"cool":0},"6V32szWmbnZIgCayH4JrMw":{"text":"For two vegetarians the Vegetarian Pasta and the Cajun potatoes was appetizing. Very flavo","useful":0,"cool":0},"irjOF-ivAlFTTJ_5Ht0cGw":{"text":"I was scared once sitting down for breakfast and reading the reviews. However I was pleasa","useful":0,"cool":0},"7q4fPXPu81DdUUboUUkDJQ":{"text":"I am not a fan of New Orleans. I will try my best (this may or may not be a lie) to give a","useful":0,"cool":0},"P9rgGdCdQ_b7m6lJ-GfBNA":{"text":"Wonderful place to eat right in Jackson Square! I ordered the red beans and rice, and a hu","useful":0,"cool":0},"j_1Ut4rLMAd2Okt4a-TgLw":{"text":"We were so disappointed! This was my third trip to NOLA and ate here every time. Staff has","useful":0,"cool":0},"LTVP6btNiTPf7LgmOpVhKQ":{"text":"I can only go based on my experience with a crawfish omlette and I have to be honest I was","useful":0,"cool":0},"5SH70xsXxf3SC1OsmtjC9g":{"text":"Another pleasant surprise, right on the corner of Jackson Square. I had the crab cakes and","useful":0,"cool":0},"esbg5lnkrVpfKcb_4eWeFA":{"text":"Just not that great. \n\nFriday late breakfast. The place is inviting from the outside. Real","useful":0,"cool":0},"WEzhhHkISFbLtZTyT1nKUA":{"text":"Located right on Jackson Square, near Café du Monde and the Crescent City Brew House.\n\nWe ","useful":0,"cool":0},"eglmWrz8Z2PnB7fJlEDvJg":{"text":"It was just okay. The Bloody Mary wasn't anything amazing. The gumbo was okay and the bean","useful":0,"cool":0},"J7t-VTRgkxCop0-SGhB3Cw":{"text":"Nice location with cheaper prices compared to other nearby restaurants.  The food was not ","useful":0,"cool":0},"zZwMzSjlIQaASfluFyHXww":{"text":"In my opinion, I can't say much for the food--didn't order any;  however, bartender Eric p","useful":0,"cool":0},"f4crosYNtB_20mN1plULWQ":{"text":"Food was decent. Not the best, but it was alright. I'd say way overpriced, but that's typi","useful":0,"cool":0},"1UKe1dLVwEp0T7kDpjDQsQ":{"text":"We enjoyed our first taste of alligator here alongside some great calamari and stuffed mus","useful":0,"cool":0},"03dILsR09Yg1ztRkL-U_Vw":{"text":"I visited New Orleans for the first time during St. Patrick's Day weekend in March.  On my","useful":1,"cool":0},"tVkMDy1G-RRn6RbQ53jWOQ":{"text":"I loved the atmosphere here. The service was great. The waiter was very knowledgeable, att","useful":0,"cool":0},"eUHM98oxtsW6FSotesCv5Q":{"text":"Best thing about this place, by far, is the location adjacent to Jackson Square. They're a","useful":2,"cool":0},"s4Rnvlq73TXS7CftyKZbZQ":{"text":"The wife and I fell into this tourist trap one time when we were walking around the FQ.  I","useful":1,"cool":0},"5TjjXMyQv_H_wwYbO0YC_Q":{"text":"These guys fed my cravings while I was hung over. And not so hung over. \n\nTheir food is al","useful":1,"cool":1},"F6alhtWUdoL1uGbbtbmP7w":{"text":"The food here is good. Not great and it can be very noisy depending on what is going on in","useful":0,"cool":0},"tbdmfBiTc4C8yc3IZK_mvQ":{"text":"Such small portions! I wanted to get a Po Boy down the street minutes after I finished my ","useful":0,"cool":0},"NgUNIZruukXHv93BY3k8Dg":{"text":"Had jambalaya & grilled chicken.  Great location (good people-watching), ok food.","useful":0,"cool":0},"WPAUrc6uCC9I3wUpJE_RAA":{"text":"Excellent!  The atmosphere is awesome.  Floor to ceiling doors that open on to allow the m","useful":0,"cool":0},"WEDnrXTLpZB7oF6nc7m-2A":{"text":"Worse restaurant I have ever been to. The food was awful. Gumbo came out cold, French frie","useful":0,"cool":0},"v73CDIjm4ZuS-jKgsnxpZw":{"text":"The location is better than the food or service .  Their red beans and rice are good . Cra","useful":0,"cool":0},"LHHHlZnnd4aqaBptqjl8jw":{"text":"Great location. Not great food. Got an eggs Benedict that tasted bland and watery. Then fo","useful":0,"cool":0},"QAVWIhjiBzucBBEGDHKbiQ":{"text":"I had dinner there 10/4/2014 the food was terrible I had crab cakes that were so salty the","useful":1,"cool":0},"fdDj2LA0j-8yOYrnIDHVww":{"text":"Only thing going for this place is the great location .My husband ordered the jambalaya it","useful":0,"cool":0},"Q2uocF1zzsWY8BLgwvWx4g":{"text":"The location is wonderful for a casual bite and some great people watching. This won't be ","useful":1,"cool":1},"JVsBARv3hT6g4cq3Og2tyg":{"text":"Come for the bloody mary and maybe some fries, skip everything else.","useful":0,"cool":0},"5PaRSX4JN_ACTdvBhM4ROA":{"text":"The food is okay here, but we were surprised when we got the bill. It turns out sandwiches","useful":1,"cool":0},"h1aFHRHXBbLBrUSDlR-Z-g":{"text":"Great location, but that's about it! Go elsewhere for food. Red beans and rice and gumbo w","useful":0,"cool":0},"msA7e1ESKOGDlmNMxHyu5g":{"text":"Yeah - not so much. Overall this place was just bad. Our server was overbooked (but still ","useful":1,"cool":1},"wEoagOvYK-2LZu4Xi8td6w":{"text":"We walked in on a whim for breakfast and it was just okay. The mimosas were decent, and my","useful":0,"cool":0},"zYNjEthyNLRNk0HrZvHbQw":{"text":"We tried to go for brunch across the square here to Stanley's, but the line was around the","useful":0,"cool":0},"S07Hmqd32ISp2p3LFJJUkg":{"text":"Let me start by saying that I firmly believe that what this restaurant does well, it does ","useful":0,"cool":0},"c8ZYKNu3goWsoR5orACXGQ":{"text":"Cute little spot to grab food tables by the window are nice, the windows open up to Jackso","useful":0,"cool":0},"BYwXtV6em2fAahCiILGMuw":{"text":"First time visit on a Monday night, easy seat at the bar.\n\nAutomatic +1 star for having a ","useful":0,"cool":0},"S7fkx0e1btQiWWWx0BEcoA":{"text":"Poor service! Stopped in for brunch and sat at the bar! Ordered a Sprite and paid $2.50 fo","useful":1,"cool":0},"juAGQ4mue0IFs8-8LFzegg":{"text":"Don't go here.  No hostess to seat us. We ordered two drinks. One had no alcohol and the o","useful":0,"cool":0},"gqRe7bl8IW3NmVH3oz2_VQ":{"text":"VERY disappointed. Dined with my son for lunch today. Food was not good, nor was it even w","useful":0,"cool":0},"oKmQGHjzT1wcJ9UAGo-uiQ":{"text":"DO NOT WASTE YOUR TIME AND MONEY HERE!!!\n\nMy wife and I ordered the crab cake eggs Benedic","useful":0,"cool":0},"sUyKBH42EAYuDgamqYK-rw":{"text":"Clean, straight forward, and as utilitarian as a New Orleans restaurant can get. Gumbo, Po","useful":0,"cool":1},"wjVvZQSer4AJZjFeeVSepg":{"text":"We loved this place! The food was delicious!  We had a shrimp poor boy and crab cakes, bla","useful":0,"cool":0},"VLioHErC8BWIxonT30zQAA":{"text":"We had an excellent experience here!  The outdoor cafe atmosphere, where we got to listen ","useful":0,"cool":0},"WlnfLpie-SNEyhfu5L3E8A":{"text":"Extra star for being on Jackson Square, but the good was just ok.  We had breakfast, so di","useful":0,"cool":0},"GDBc-x2JINsBWpFbPNVimA":{"text":"Excellent red beans and rice with good sweet tea.  Shrimp with spicy cream sauce over penn","useful":0,"cool":0},"oraB8Hxi7kAQbfWJMaiV3Q":{"text":"Great place for people watching. No air-conditioning though so it got pretty hot while eat","useful":0,"cool":0},"YQN6pYTEQVOS3Z4cLTI2GA":{"text":"This is our go to restaurant every time we are in New Orleans! The food is great and so is","useful":0,"cool":0},"L88lRiL46GDlH0ei60P04A":{"text":"Just like my petticoats, this place is no-frills, but it still represents!   Got tired and","useful":0,"cool":0},"vY4KzbFxHDbzXgV-fbbbbA":{"text":"Black beans and sausage Creole, and Cajun jambalaya and craw fish pie for lunch. Good valu","useful":0,"cool":0},"K9KAzMviBvZrl85sKzcLWQ":{"text":"This place wasn't bad, but it also wasn't great. Perhaps the particular food items I order","useful":0,"cool":0},"fYiGm2uamf1zHglJt1Pmeg":{"text":"Loved my eggs benedict and was a relief to find out places in New Orleans were open on Tha","useful":0,"cool":0},"RKAqEhFcPeLSdbkZlJkacQ":{"text":"How does this place have any stars?! The service is unprofessional, unorganized, and slow.","useful":0,"cool":0},"kR1g1-theSxOHNTZKE7aTA":{"text":"They used my CC and I have not been there in 2 months.  When I called and asked for a mana","useful":0,"cool":0},"KOECpUsFEGNdfXHth318WA":{"text":"Horrible food - worse than cafeteria \nMushy cold tasteless jambalaya and bland awful gumbo","useful":0,"cool":0},"kAY79vbW1WSFhPP8b1BLGw":{"text":"We went to this restaurant unintentionally after the one we wanted to eat at had a huge li","useful":0,"cool":0},"7BxpT16Ft5GTHG5D2ayYjA":{"text":"The food came out really fast, but was not the best. The shrimp were not cleaned. I ordere","useful":0,"cool":0},"HM9vfpsIPL_kqH63OAMBZw":{"text":"Food: gross and cold. \nService: horrid. \nShared with us that they do not split checks even","useful":1,"cool":0},"Qi4EQJoStLvFNvCwRnTLxQ":{"text":"I arrived as a local and asked for local service and menu suggestions.  I received bad com","useful":0,"cool":0},"Jyj_Xz56SuMFa9n-jzncNw":{"text":"Agreed, not good.  Great if you are in Delaware or something, but terrible if you are judg","useful":1,"cool":0},"t4H3rLOo2HmEuyxrNksK1A":{"text":"Terrible service. Left waiting. One drink arrived 30 min late. Waiter came over as we were","useful":0,"cool":0},"KIXBNn5-q2wcJ8-R_qiWNg":{"text":"Service was great, recommendations by the bartender were spot on - Blackened Redfish with ","useful":0,"cool":0},"OScsr1IR45U92FL1AZ3JNw":{"text":"This place is a tourist trap! It had terrible food. The beans and rice was a disgrace to N","useful":0,"cool":0},"ZDShGHXxGwg7TJgEubBabw":{"text":"I really, really enjoyed taking a break from walking around to enjoy a delicious meal here","useful":0,"cool":0},"keKR6xJjJ89EYYvu908__A":{"text":"Over priced bad food. Worst meal we had in NOLA. Bad service also. The restaurant looks wo","useful":1,"cool":0},"kstUhw4uyBuDlTN78njSzg":{"text":"Yum!  I had the trio tonight!  Shrimp gumbo, shrimp etouffe and jambalaya!  Hit the spot. ","useful":0,"cool":0},"GO_FExhhDsmh46KyZg-E_A":{"text":"The Voodoo Punch is amazing! Four different flavors of Malibu rum topped with different fr","useful":0,"cool":0},"KB654mxzre_OpOppYqJX3w":{"text":"Was there about an hour ago to have a few drinks and chill at the bar. The Angry bartender","useful":1,"cool":1},"I-4IUw7aYRy3klQP6QbEmw":{"text":"Good location near St. Peter's Square.  Open and airy dining room.  Food was just ok.  Caj","useful":0,"cool":0},"2sZS1vGL-khhgwb0fHuIiQ":{"text":"Having brunch here right now....worst food we have had thusfar in New Orleans. Crab cakes ","useful":2,"cool":0},"-FkuSLEMcUegYEWYZQsijw":{"text":"I ordered the raging cajun pasta.   My first bite was just ok.  I then discovered that the","useful":0,"cool":0},"rkz_r11zcjfWyejXV0UUwQ":{"text":"This was our first place we ate at on our most recent trip to NOLA. Boy did we start it of","useful":0,"cool":0},"iP-IXLRBo0KHAoUM6apv-w":{"text":"Food was ok but the service was very slow.  When we first walked in there was no indicatio","useful":0,"cool":0},"DPMN5A6FGD-gtWZTxL4prQ":{"text":"I can see why this place has 3 Stars. Should be one. We came by to grab a couple of mimosa","useful":1,"cool":1},"q77uZ-e9fIYFQUm6WTOCrQ":{"text":"I thought this place would be great off the reviews, however I ended up getting food poiso","useful":1,"cool":2},"mNs47zNCyNoqUj6_AZdjJg":{"text":"I got a shrimp po boy and it was just average. It came with everything on the side. I like","useful":0,"cool":0},"C3gTJH7PvrROONQtBcxmtg":{"text":"I would not recommend eating here if you can spend an extra $3-$4 to eat much better food ","useful":0,"cool":0},"qiZNW_1gHQ7B6Lpf5ylRIA":{"text":"Excellent views of the Cathedral and Jackson Square.  Overpriced food and drink.\nI would s","useful":1,"cool":0},"Cnhx15nSR3ITr0d0oBGR0Q":{"text":"Literally the crab cake is probably the best I've had in New Orleans. I keep coming back f","useful":0,"cool":0},"BL7z6z8OBx2X3l9u9XK3WQ":{"text":"I went for lunch to this restaurant. \n\nThe location was perfect, next to the cathedral and","useful":0,"cool":0},"v5qVxUc6T9lt6OALM34_0Q":{"text":"Such a pleasant spot to stop for a coffee or bite to eat! Right off Lafayette square near ","useful":0,"cool":0},"SoMHyUWY8Vu6elYURfVPNw":{"text":"Just a horrible breakfast experience. Mind you, I never would've chosen the place because ","useful":0,"cool":1},"BJwNOpuPi-jvLP--gAFXDA":{"text":"My worst food experience in NOLA. Leftover, questionable, dried jambalaya with rice stuck ","useful":0,"cool":0},"6Zd7VylBhY_YujbSM7pVzQ":{"text":"Some of the worst service I have ever ever had. I work in the restaurant industry & I have","useful":1,"cool":0},"KEYuqfrP66iFI5FlJskdkg":{"text":"Pleasant service and quite convenient.\nThe food is not terrible and not stellar but the co","useful":0,"cool":0},"uk8VoS96aPnkhKthdJ-BAg":{"text":"Overall this is a good place to go in Jackson Square if looking for a decent meal. The foo","useful":0,"cool":0},"AUfV_tzWWkznziqzDtosoA":{"text":"Cafe Pontalba is the kind of place you eat when you're just so starving from doing tourist","useful":0,"cool":0},"7kJacXyENWzZ9sbtXnBtCw":{"text":"Disappointing, food was overpriced and bland.  The only thing this place has going for it ","useful":0,"cool":0},"kW1LOiw88dfCf83QCvl_yw":{"text":"The French toast is made with French bread!! And it was good. I also ordered the eggs Bene","useful":0,"cool":0},"_e1ZNbEenpeFX1AaM3I8sQ":{"text":"There is no zero star review for starters \n\nWent for breakfast.  Ordered French toast, bac","useful":5,"cool":1},"mZiMxuII5ayF0wmb4pfTkQ":{"text":"Very average. Nice atmosphere but food is very plain. Had jambalaya and its cooked in a ba","useful":1,"cool":0},"uU66D3-ulUnsW3Vg3epcfQ":{"text":"Nice open air restaurant by Jackson Square. You can hear the bands outside while you eat l","useful":0,"cool":0},"NaAQ2U2D_FetJsDGRR1oog":{"text":"Service was fast and one out of three of us enjoyed our food.   Red beans and rice was goo","useful":1,"cool":0},"IArymVD-e5GIlid6cn947Q":{"text":"Had the shrimp etoufe which I've never had anywhere and it was delicious. Recommended by m","useful":1,"cool":0},"ewJ2zK6rkgkI6Wr7mwlytw":{"text":"Really enjoyed this as an intro to New Orleans cuisine!!! \nAs you can see I ordered a drin","useful":0,"cool":0},"6tevkvhnVBsZz20egcYa8w":{"text":"Yeah, lots of crawfish, (spelling) crawfish noodles, crawfish stew, crawfish Cesar salad. ","useful":0,"cool":0},"WUev1fgLqVeuVJe7yKlCDQ":{"text":"This restaurant is a waste of space.  The food here is overpriced crap and the service was","useful":0,"cool":0},"iFSFf2cfeFNWZDTObv-yYw":{"text":"I ordered the roast beef sandwich per the waitress' recommendation and loved it! The roast","useful":0,"cool":0},"wCDZjgdc8GTQ0WT2frbiSQ":{"text":"Quick, reasonably priced Sunday breakfast on Jackson Square. Tasty Cajun omelet with grits","useful":0,"cool":0},"L50ekmqt9dimvMLw5cZ6CQ":{"text":"Open for breakfast starting at 9:00 am. Get there early for a table by the sidewalk. Blood","useful":0,"cool":0},"F-TXCNhW8P0N7AdKDbPsSg":{"text":"Food quality is poor.  Topical tourist be ware.  Frozen burgers dry like hockey puck with ","useful":0,"cool":0},"P_PsY59S780u-S2yx0z7sA":{"text":"This is our go-to every time we come to New Orleans. Prime location. We've always received","useful":0,"cool":0},"G2VLQCqLdFKgziG3QwIIQQ":{"text":"We were so disappointed with the service, food presentation and quality. Our server approa","useful":0,"cool":0},"NM1S2C5sFCTmZQvP8CssGA":{"text":"Stopped for lunch around 1pm. Most tables were occupied but there were a few open. Waitres","useful":1,"cool":0},"HTu2qwDsqfy4ZfXMQIKqwQ":{"text":"Good place to get food right at Jackson square. Friendly staff, good service and moderate ","useful":0,"cool":0},"Qx5SyTnkDxxxMVCiVSuwug":{"text":"We had breakfast here after a loooooooong night of partying & obviously started with the h","useful":2,"cool":1},"drypg_GJRVKkSoMr5fG9MA":{"text":"This was our favorite stop to enjoy a meal at. I wish it had higher reviews because I feel","useful":6,"cool":4},"-4BdyNG3LJKgBiuUn2OR-A":{"text":"Great location, right next to Jackson Square \nAll doors open, lovely!\nSurprisingly there w","useful":0,"cool":0},"u0HQMe1Lxrf2s4S7BTYyww":{"text":"Service was absolutely terrible. We ordered 2 cups of gumbo. After 45 minutes and our main","useful":0,"cool":0},"mQ5u9SiGXnBaiwvVaxIU8Q":{"text":"Awful experience!!!  My daughter (2 /2 yrs old) has a severe nut allergy.  Upon arrival, t","useful":0,"cool":0},"_vbzJnbscxrMIk_0lP-iKA":{"text":"Delicious. Great food and strong drinks. Perfect location and ambiance. Will return on the","useful":0,"cool":0},"uR8iIexUZz2_NVflSc6ivQ":{"text":"Stumbled upon the Cafe Pontalba on Fat Tuesday, we were able to get right in.  We had no p","useful":0,"cool":0},"mNLnU6DjW3j6tIqK6JcWGg":{"text":"This restaurant is in a convenient tourist location. We chose to eat here because of that ","useful":0,"cool":0},"B8dxT64zdafl9mGr34VcLw":{"text":"Service was bad. I could get over that but the food was worse. I had the BBQ shrimp and it","useful":0,"cool":0},"d-XLPAsI9d1YGBeZjL33cw":{"text":"Beware!! Only good thing about this place is the location. The food was terrible, from red","useful":0,"cool":0},"C4NMnWl5NsIZ--Nd3lWf7w":{"text":"We just had lunch at Cafe Pontalba. Joseph, the waiter assigned to our table was fantastic","useful":0,"cool":0},"21SHwyF7OIFO-Fr50ERlSA":{"text":"OMG!  Best crab cakes I've ever had!  I was really sad when my plate was empty, because I ","useful":0,"cool":0},"0_hLQCL8DyqIatjolL0MHA":{"text":"Fried oysters fries and cup of gumbo...2 blue moons I am so stuffed from last night. Frien","useful":0,"cool":0},"jFRHXPy8iNSEqu3QjCRMFQ":{"text":"Aweful place never received our food after more than 45 mins of ordering. Surrounding tabl","useful":1,"cool":0},"f_L9VJXAD-IQnftaXTZrrQ":{"text":"I ordered the fried chicken burger which was huge, filling and very enjoyable. The service","useful":0,"cool":0},"Hh4vAmWRzk-rHaQHqaX7KA":{"text":"Second day in NOLA walking around looking for breakfast we liked the menu said okay let's ","useful":0,"cool":0},"QGPshMMLDO3PVekzLfQ_tA":{"text":"It's a real toss-up. Blackened gator was really good and so were the red beans. The Cajun ","useful":0,"cool":0},"QHOHvS6PDZw9bnYI4bDspw":{"text":"Long wait for breakfast - food was OK. I had the crab cake Benedict  and it was good - the","useful":0,"cool":0},"bCImT4U3d41nyoodIjl0mw":{"text":"This place has a lot of great potential. It's right on Jackson Square with great open wind","useful":0,"cool":0},"wgR9UJWV0qRZ8T6VqRi21g":{"text":"Service was absolutely terrible. We ordered 2 cups of gumbo. After 45 minutes and our main","useful":0,"cool":0},"Fs5d_dJdS5ZCoTiCmiCsDA":{"text":"Food was cold and flavorless. Service was painfully slow and unattentive. A huge disapoint","useful":0,"cool":0},"-p0JJ-sJEJvKugCxl0nUVg":{"text":"Not bad, but not blown away either. I like the open air atmosphere and the service was dec","useful":0,"cool":0},"wUmmQg7B6tgEtBHd1saDow":{"text":"My wife & I ate here on our last night in NOLA.  We chose the place at random, but were en","useful":4,"cool":0},"PgDxK3_tX3mAhw7JpB8IUg":{"text":"Went for a late lunch and got a sampler platter. Jambalaya was pretty good, but the highli","useful":0,"cool":0},"YL-rqnOVdtW2wBZURDdo4g":{"text":"Party of 7 popped into the cafe to have drinks at the bar. We were met by the most hostile","useful":1,"cool":0},"zq3vGwP81byj2pUP_FYNRg":{"text":"The service was disorganized and our waiter was trying his best but they were clearly shor","useful":0,"cool":0},"X6E0ENbbojuYEMhASo3O3Q":{"text":"We stopped in for drinks while waiting on the rain to clear. Our waiter, who's name we did","useful":1,"cool":0},"B1s4d8QHfc7Czm9ZQ-7EKQ":{"text":"Good place great location. We ate within a wide open doorway with a great view of Jackson ","useful":1,"cool":0},"SvAr-nXQgsxWzSFXZNf-eg":{"text":"Service was awful and my food didn't come out correct and they refused to fix it. Disappoi","useful":0,"cool":0},"7HbEVythbyHDGdATRasY4w":{"text":"Amazing location and great views but food was not impressive. Ordered the Crab Cake Benedi","useful":0,"cool":0},"OQDI_XnM-dV0ErGpoKZOTA":{"text":"Food is very flavorful .. If you want to try the local this is the place to be. Jambalaya ","useful":0,"cool":0},"5ffz_MuItTRMsO2bXUBiog":{"text":"Gumbo was great!  I wasn't impressed with my jambalaya and fried shrimp unfortunately.  My","useful":0,"cool":0},"mxY4EjUtkDkJlA0TLulgrg":{"text":"We were in Gumbo Sh 1 block away but it was so crowded we had a lousy table and my husband","useful":4,"cool":4},"sW8WWesVg09GDwdtFJ0eLA":{"text":"Great New Orleans fare with a great view of Jackson Square. There is always great people w","useful":0,"cool":1},"PD0xomE_LTwrupvtg4t-YA":{"text":"Great location but worst service and dreadful food.  My crabcakes had a vague flavor of di","useful":0,"cool":0},"Mqb_gkmxVXa2xyLNw8W1oA":{"text":"Terrible place. I would not recommend, food is awful and servers are rude. I start by sayi","useful":0,"cool":0},"S3UKRpPhl8tpfu_mJq_gtw":{"text":"The food was soooo good and the staff is really sweet. The only thing I don't like is they","useful":1,"cool":0},"IBEd1dc_gVitluCsWKSXCw":{"text":"Best gumbo and red beans in NOLA. \nTry the voodoo juice! Highlight of every nola trip is C","useful":2,"cool":2},"PjpDQGyMniiXHgvmEad1NA":{"text":"This is a bad cafe the waiters are rude they charge your for water which is from the fauce","useful":0,"cool":0},"WFpUCBA8IYMCTcTwTIzg8Q":{"text":"Perfect for what it is. A pleasant, clean, reasonably priced place on the corner of Jackso","useful":0,"cool":0},"KWxqYVlPsuZblsT7Qo9wTQ":{"text":"Cafe Pontalba is convenient and passable, but better spots certainly exist. I popped in fo","useful":1,"cool":0},"oEnKhy60k1WMWkky6e4J_A":{"text":"The food here was surprisingly and disappointingly unappealing. The food was not well seas","useful":0,"cool":0},"UtfQEP2kB5YzJugaXqq3bg":{"text":"I'll be honest, I was a little worried because of the reviews, but I thought it was delici","useful":0,"cool":0},"AfkjM-o1S8om3D2uVAJotw":{"text":"This was the first place we ate in New Orleans, and it was... okay. It was average, pergat","useful":3,"cool":1},"Hel_UhUXBkhAywVrFIw_ZQ":{"text":"Bar keep was really nice friendly made tasty drinks.... so the food was bad!!!!! The jamba","useful":0,"cool":0},"PjcGnRgoL_8wxBZiWl-zIQ":{"text":"Worst food we had in New Orleans by a long shot. It was just...bad. We were there after a ","useful":0,"cool":0},"QEftBgdqo06k7l8pLyK_Bg":{"text":"AVOIDED BY LOCALS! as a former Pontalba resident it's a tourist trap joke;\nEMBARRASSED!  T","useful":11,"cool":1},"XtMdxK35VgW6esspjFBYHg":{"text":"Well this was my first time in Louisiana and I have been a huge fan of Cajun cooking and w","useful":0,"cool":1},"xrzXXxDU_mGMVLRz5uogtw":{"text":"The food was good, but it took forever for our food (and then part of it was forgotten). S","useful":1,"cool":0},"jI4Tj0LTrM7WkFn8Vqy0CA":{"text":"We stopped her to grab a different type of breakfast other than something sweet. We arrive","useful":0,"cool":0},"814c-sqNsa570sClGgJ9ew":{"text":"Fantastic location in old town. We sat on the balcony looking over to the square. Food was","useful":0,"cool":0},"-enkEcINk8tpvVlejKmFVA":{"text":"Cajun combo was amazing , crawfish pie was a highlight of this trip . Service was fast and","useful":0,"cool":0},"qpm-EsI4dSWwo9-N91cIWQ":{"text":"I went to this restaurant in Feb 2020 and got the Cajun Combination and LOVED it while I w","useful":0,"cool":0},"HX8eLCNHyoPgv2K9Wt5Kmg":{"text":"Good service, good food, very quick, great seating at the windows overlooking the square","useful":0,"cool":0},"FAzytU3eAgow9SzK69j76Q":{"text":"Service was quick and friendly. I really enjoyed the seating right next to the window and ","useful":0,"cool":0},"UGEFTSYKWpA6AmPQG7H2kA":{"text":"First place I stopped at during my trip to New Orleans. I went during the evening and was ","useful":0,"cool":0},"PS8pK35ia4Ilj5qYaVV9JA":{"text":"We decided to have our last taste of New Orleans at Jackson Square before we fly home. So ","useful":9,"cool":0},"d-HVbIIywwRzENBCuHnwZg":{"text":"fried gator ! \ni really enjoyed my dish.. got the traditional foods of nola.. red beans, r","useful":0,"cool":0},"lOxS3bmHL_inJ1HX6pR5Vg":{"text":"Great location, but awful food. It's really a shame this place isn't better, it really is ","useful":0,"cool":0},"zVwOC1JirPbSSVaInAqVRQ":{"text":"Wonderful experience. I really enjoyed the food and friendly service. There was guy playin","useful":0,"cool":0},"TiQ8eBOHa7Ja7KesfXLsTQ":{"text":"We went to Cafe Pontalba for the white chocolate bread pudding, and decided to have lunch ","useful":0,"cool":0},"GUM1E5ckt7L9gRHHRcRkvA":{"text":"This was the worst experience we've had all weekend.  The bartender (female who never gave","useful":1,"cool":0},"B9-y7dJ85J8BXNDCO8UctA":{"text":"This place has been by far the best covid safety experience in all of New Orleans French Q","useful":0,"cool":0},"zyWFPQ4gnLuvZK0q5YebLA":{"text":"2.5 stars--mediocre food but friendly service, especially considering how much traffic the","useful":0,"cool":0},"n1RhDxuEXOmtBFkagmyCcg":{"text":"The food is not authentic in anyway \n\nThere are better places.  Don't wast The calories it","useful":0,"cool":0},"vpU9r5aBNuNzmfuUkBbxgw":{"text":"Such a great find at the corner of Chartre & St Peter. The open windows lets in a nice bre","useful":0,"cool":0},"HltiPevfYrDsRR5l4rlsig":{"text":"We had a great meal here. Crawfish Orleans penne pasta was buttery delicious. Fried chicke","useful":0,"cool":0},"Xs9G0Velob7BMjr-rNrYrA":{"text":"Service was very slow and the food was mediocre. My daughter ordered grilled fish, but she","useful":0,"cool":0},"3owrqTxt-C3towH4C-OoBQ":{"text":"Ordered an old fashioned, received something that resembled a pink lemonade. Shrimp was fr","useful":0,"cool":0},"e0YMQuJhigk8fq_WjydQHg":{"text":"Best Bloody Mary I've ever had. No wonder, they make it from scratch. The crab cake Benedi","useful":0,"cool":0},"6XY2O1RWx-q3GeKmkI9Cmw":{"text":"Got into New Orleans this evening. We read so many reviews on places and decided to eat at","useful":0,"cool":0},"WTyRgI5EI2ntMlY5G0wm8A":{"text":"I think anyone could do sooooo much better than this place. Extremely sub par food. Most o","useful":1,"cool":0},"dOqtmw2AHBsFZQ4yEODALw":{"text":"Not a bad start to classic NOLA cuisine! \n\nThis place is near Jackson Square and is obviou","useful":0,"cool":0},"a_wX20g6ZkAt3Zp2MRCHjw":{"text":"I went here after walking around the french quarter. I wanted some water and to order some","useful":1,"cool":0},"7Zft_W5Dlw-mwH7a0n3c5w":{"text":"Long wait, poor service and bad food \nShrimp and grits were flavorless.  Poached eggs were","useful":0,"cool":0},"vqmVReYSy11OZ9yg0PwAlA":{"text":"This place is absolutely terrible. I'm gonna be honest and say that my \"steak and eggs\" wa","useful":0,"cool":0},"n9_1-sdVBfKc2ZY65usY_w":{"text":"So we drove to The French Quarter for some food & we didn't know what to get untill we bum","useful":0,"cool":0},"t7LzW7IRTAhOYj-kf_FQZA":{"text":"Great place to stop by if you're near plaza d armas. We came with a group of 6 and had no ","useful":1,"cool":1},"umLW3FoLweIGQQkjMnRegw":{"text":"This review is not about the food (FYI the food is just ok), this is about customer servic","useful":4,"cool":1},"EkxwnuBhjWo6PuEIg8VJSg":{"text":"Tasty food. Friendly service. Not too expensive. Great location on the square. I recommend","useful":0,"cool":0},"DlveTwarCG6g0mw1I1AYSQ":{"text":"It looked so cute and was in proximity, so we popped in. The Bloody Mary was delicious and","useful":0,"cool":0},"AR3H9MEqQ3p7OQwdMuva8g":{"text":"We grabbed a late lunch here after watching NCIS: New Orleans film a scene nearby for a fe","useful":0,"cool":0},"SjwTfQNWzRFqlneF5xvbQg":{"text":"Loved this little spot. Great views of the French quarter with all of its doors open. We h","useful":0,"cool":0},"Vtyh15MJmnjouxRMsW0KgQ":{"text":"Enjoyed a great dinner last night. My husband really enjoyed his blackened catfish and I h","useful":0,"cool":0},"tjSSkJ-RX__ZYZjrhG1EHQ":{"text":"Ok. It's doesn't do creole/Cajun an injustice but it doesn't do it any favors either. I fo","useful":0,"cool":0},"2baHrfTvpXDGfaVldpJY8A":{"text":"Great place right on Jackson Square.  Sit in the window if you can.  Velvet and Katie had ","useful":0,"cool":0},"QvrIv2ftvEQbl3yRZzaRaw":{"text":"Enjoyed a very light dinner and drinks at Cafe Pontalba with my love who surprised me in N","useful":2,"cool":3},"luoBox3azxmCvTgEn69yxA":{"text":"The rain was dancing off the pavement in Jackson Square and I noticed this restaurant on t","useful":5,"cool":5},"Y19yKCtRgyaYQ-Vawm8clw":{"text":"Nice decor with an open and airy cafe vibe\nGood location in Jackson Square \nSeat yourself ","useful":0,"cool":0},"DYYChHt_ABQ9hVDGm6W3sw":{"text":"I have had 2 great dishes here: Ragin Cajun Pasta and Craw-fish Etouffee. I have returned ","useful":0,"cool":0},"qdIEpYerVRi5oJ2lK7_8FA":{"text":"This food was not very good. Took a while to order and didn't even finish the meal. Our se","useful":1,"cool":1},"OINbivTsJrjshiDDcp7vPQ":{"text":"Complete tourist trap! The restaurant is kinda dirty and the staff made me quite uncomfort","useful":1,"cool":0},"s1a2cMYg5myxYYV7JzFkxQ":{"text":"It was meh food. Disappointed that we had to ask to be served. We still don't know who our","useful":0,"cool":0},"_6Swqp7ZFnkbA1grFWal4A":{"text":"We had lunch at this place. The service was good and very accommodating. We had 7 in our p","useful":0,"cool":0},"CYphLumdP0gxo6fPmSw2yg":{"text":"Don't care about what you ordered, everything looks and tastes like leftover,  the only 1 ","useful":0,"cool":0},"iYIcSm6IVR8Z4HittihoTQ":{"text":"Avoid like the plague unless you want to be sodomized. Making their money off of crappy po","useful":0,"cool":0},"BnvgRXMq_Mrd4bL64czOUQ":{"text":"For our last few trips to NOLA, this has been our go-to first meal. It hasn't really been ","useful":0,"cool":0},"9hAtU6-bIGYAtOtoI7l1Pg":{"text":"We were able to get a table here right away on a busy Saturday night. Service was okay, to","useful":0,"cool":0},"NnqAY4GNkp9uuIPJazuvuw":{"text":"This cafe is in a great location on Jackson Square. You can sit and listen to the music an","useful":1,"cool":0},"9q_TqF4_f7MmSfRiSugnpA":{"text":"WOULD GIVE ZERO IF I COULD \nabsolutely DISGUSTING \nI got the crawfish sampler and got food","useful":0,"cool":0},"D6Ig96kMVQXKuOPQ8QyVaw":{"text":"The worst meal I had on my trip to New Orleans.\n\nI ordered a Ceasar salad, the lady got ri","useful":1,"cool":0},"uMsevoog9hQXi9LSsCGucA":{"text":"Great location.  Average food.  Slow service.\nIt's right across the street from Jackson Sq","useful":2,"cool":0},"PSIuJliuJYCSbRRra_r4Qg":{"text":"If you want to sit, relax and have a drink (or two) while taking in all the sights and sou","useful":11,"cool":7},"DWEmO9KuYy0I3PKYm-3PJw":{"text":"Great service and Great Food! I stopped by for a late lunch and I asked the waiter for rec","useful":0,"cool":0},"11YExPqdr9FVk5tDKnDQQA":{"text":"The restaurant that we had planned on going to was closed today so we went around the corn","useful":0,"cool":0},"Gt508JENUvB0noAJgCGSeA":{"text":"My fiancé and I had walked down to Jackson Square and headed to Cafe du Monde for breakfas","useful":0,"cool":0},"zGSZkdKsSOE5RR0FAdzsaQ":{"text":"Not a fan -  I thought we could grab some red beans and rice, or gumbo at this place near ","useful":1,"cool":0},"x0KjK4pjSXXC4-LriR85hQ":{"text":"Great service and great food. Ate here on Saturday for lunch. Not too busy for a big footb","useful":1,"cool":1},"x3zPwtDPK7ti0uEY7-khIQ":{"text":"At noon this place has a comedian out front.  The servers are busy, working none stop.  We","useful":0,"cool":0},"RT80I5LkHUhEJlfXiPc1pQ":{"text":"Cafe Pontalba helped me when I needed a to-go adult beverage and a restroom. \n\nMy friends ","useful":17,"cool":13},"9gFUG0ED003KUIJwdoN8mw":{"text":"Great spot right in Jackson Square to grab some food. They had all the windows and doors o","useful":0,"cool":2},"TnGbCWzjE1qfNl4P264p2A":{"text":"After walking around the busy French quarters trying to find a place with a decent wait...","useful":0,"cool":0},"1YJcYl5Dcp8M9BaLflISew":{"text":"The location enticed us to come in. Food was very bland. Service was slow. Not what we exp","useful":1,"cool":0},"sx19-sCi4NDfpZef8uP8rQ":{"text":"Tourist trap. Orange juice...No, it was Sunny Delight. Over medium eggs.... no,  white wer","useful":0,"cool":0},"Ukgd3lLig7oVgDsc7DRTcw":{"text":"Went here with my kids for a lunch while we were in town.  Our food was really good, the o","useful":0,"cool":0},"aacGDPNYsO5tLJtq5Dg0Zw":{"text":"Although our waitress was very sweet, the restaurant was 10 to 15 minutes late in opening.","useful":0,"cool":0},"kkvzrCtFR34xGjNijyhmAg":{"text":"Atmosphere and location are great. Service was mediocre and something left to be desired. ","useful":0,"cool":0},"LTqXL7q2d2GpRP8p_0Kh_A":{"text":"Tourist trap. Slow service. Horrible food. Inflated prices.\n\nYelp wants me to put more inf","useful":0,"cool":0},"lE6cyLlOFJ26hELPU5UQZA":{"text":"location, location, location--Cafe Pontalba sits right across from Jackson square, along b","useful":1,"cool":0},"nWQ5LBbF5SwxA3ZbQpUU2A":{"text":"Food was reasonably priced and pretty good. The shrimp was deveined which is very importan","useful":0,"cool":1},"sYIBZrFhqhk7-IkmVCJHnA":{"text":"The devil! It is embarrassing (as a one year transplant) and atrocious that visitors to th","useful":0,"cool":0},"aney2ZeWQDLIc6E4dQQhLQ":{"text":"After reading other reviews I was not going to go here, but then the hotel manager where I","useful":1,"cool":0},"qc2jPDRWozIfaIkpLIb9qQ":{"text":"Ms. MillIe was the best.  I left a $100 tip.  She knew the menu from top to bottom.  She d","useful":0,"cool":0},"B-NV74tV7CtIson4wQ8fVA":{"text":"I can't really comment on the food.  It did smell delicious though.  I can say this as my ","useful":2,"cool":0},"krS9r6RnMCTEgYW7MFiiAg":{"text":"We visited here our first night in NOLA.  Although the service was great, the food wasn't ","useful":1,"cool":1},"a0ELyhbtSrWVDyt_5j-2GA":{"text":"Food was excellent, atmosphere was pleasant and the service staff was amazingly friendly.","useful":0,"cool":0},"iHmNBiVKgYom2ASg7KPuug":{"text":"Food was great, I had a cup of gumbo and the red beans and rice. Gumbo was very delicious,","useful":4,"cool":3},"S4ofb5BEFhlrXmjCYsg4rA":{"text":"Sure, I suppose it's a touristy place. But it's in a cool old building and convenient. We ","useful":2,"cool":1},"PERlK7kFR5IyCItZMTr5tg":{"text":"Food was amazing. Got the combo jambalaya/gumbo/crawfish pie. Aaand Bloody Mary. Delicious","useful":0,"cool":0},"unGV8lV2uN3Aa7dNjfMmUg":{"text":"Well... I'll say the alligator was good. The food was... well... without sounding rude, it","useful":0,"cool":0},"SbuYVmPknUuIw3nPUdEaIw":{"text":"Salty food with a side of salt. Waiter didn't seem happy to be there, lots of flies inside","useful":0,"cool":0},"a3zUGLS5X4EaaTUeJ6qxXA":{"text":"The food here is edible but not particularly enjoyable and there's not much of it (the cra","useful":0,"cool":0},"xGZ8rayxwWnUAPRad-VSZA":{"text":"My daughter and I mistakenly picked this restaurant on 7-27-18 when we could've done bette","useful":0,"cool":0},"9iJvuw6rpK8fgEJJPsiQww":{"text":"While in NOLA, we decided to walk around during the day and check out something different ","useful":2,"cool":0},"RV3weA-QFeLEZU-w_BQuOg":{"text":"Food here was terrible. Crab cake was nicely seasoned bu had lots of shell in it. The jamb","useful":0,"cool":0},"XTTJbWCdTinLAoxc3YOElA":{"text":"I ordered the catfish pecan. The menu said it was sautéed it was not it was fried. it did ","useful":0,"cool":0},"rJTlgvCatZFLb2VbFriKXQ":{"text":"I really enjoyed the food and the Ambiance here. I ordered the fried seafood platter and i","useful":4,"cool":1},"QoGKywQLMu20jjhBkx70Mg":{"text":"From the drinks to the food, this place is not good. Even as a Togo drink place, go to the","useful":0,"cool":0},"gBQuhWuo0j8GNZV0CaAsAg":{"text":"Worst crab cakes in all of New Orleans. And the waiters basically throw menus at you. \nI d","useful":1,"cool":0},"sGMysotEC_o9s8YqoEz_0A":{"text":"Poor service  can't get water no salt on tablet crab cakes good side of bacon two small. P","useful":0,"cool":0},"vhfnaMgLyxYJRwTD91FcQg":{"text":"It pains me to give any place less than 3 stars.\n\nFirst... Let's just establish that the s","useful":0,"cool":0},"-ZVgV0B21FPqA24Vi_rZQw":{"text":"Great location for people watching.  Shrimp po boy was just OK.  Not one of my most memora","useful":3,"cool":2},"24mSR98Vg1COq3wbRlPb9A":{"text":"Coincidently located in the French quarter so we decided to try, and also because there wa","useful":1,"cool":1},"Y4HkZ8XnqNP4onGQnuWQlA":{"text":"When you're at Cafe Pontalba, try and sit outside.  You get a great view of St Peters and ","useful":0,"cool":0},"ox9hpRz3QZ1sltznNbNXgA":{"text":"Cafe Pontalba is a nice restaurant in the heart of French Quarter, New Orleans. I went the","useful":0,"cool":0},"hZX5ZfWd7y9NlMu1R7Ac5w":{"text":"This place is awful. Dry food. Good location and service but the food was prepared terribl","useful":0,"cool":0},"WZyaGluuA-aedQy06HYl6g":{"text":"Amazing food and drinks. Amazing service as well. You can sit here for awhile and enjoy pe","useful":0,"cool":0},"qQZCKvHZwnyMdmFsf9DwQg":{"text":"They make good drinks. They're hurricane knock me on my butt and I had a full stomach. Thi","useful":1,"cool":0},"iC3YNuVuSH7l_ehT7dt1fg":{"text":"We managed to avoid a potentially disastrous dining experience at the nearby Corner Oyster","useful":1,"cool":0},"jYNyQstTl44yPOT0-IczNA":{"text":"Dined here on a Sunday night because everything was busy and had an hour + wait. This was ","useful":3,"cool":1},"csSQwvV-zadAWS3nm8Xbmw":{"text":"This place has a great view of Jackson Square, but the food couldn't stand up to the food ","useful":1,"cool":1},"1wS6IozKwDilQpj2E4OdQg":{"text":"walking thru the city looking for something good to eat, the atmosphere of this little pla","useful":1,"cool":1},"awR7aHi82ryYadc_yUSJbQ":{"text":"This place is great. Right inside the famous \"Jackson Square\" in the middle of the French ","useful":0,"cool":0},"Av2uNQqOPYdMkXLaQM0X0w":{"text":"I was surprised that this spot has 3 stars - I had a great lunch here! It was a full house","useful":0,"cool":0},"WSDjj-lD6N4LWRqr7Nh4sQ":{"text":"Terrible experience.  Waiter had an attitude. At one point when asking a question,  I was ","useful":0,"cool":0},"3IE6pllPKOKltzhZ2nfP3Q":{"text":"Perfect atmosphere inside, a perfect location for sitting down to have a meal while people","useful":11,"cool":9},"rrT3RkVWYbbfQTPqn03gGw":{"text":"Can't go wrong with any of the shrimp there, all super good. The service was not the best ","useful":0,"cool":0},"QMDtZYQg6uSGZFkd8SHRpA":{"text":"Food is BLAND.\n\nThe food is so terrible I'm literally writing this review as I sit here. D","useful":0,"cool":0},"GbtwZpPHxF4_5Oj8gyRFLA":{"text":"We stopped into Cafe Pontalba during a ghost tour. Our group bought drinks while some of u","useful":1,"cool":1},"h-8JadB0SMJ51iUtTPGw-Q":{"text":"The service is great! The fish po-boy was delicious. The restaurant is clean and the outsi","useful":0,"cool":0},"6Tsb7KQjcyTHagOtEG0qVg":{"text":"I would avoid this place. Service was terrible. And I hate to review about service, becaus","useful":0,"cool":0},"hssWa7sp2Hy9ZmAskcukzg":{"text":"I like just about anything, except this place. Shame because it's a good location but the ","useful":0,"cool":0},"hjSszO5-KdMdLP1G38xtQw":{"text":"This spot is right in Jackson Square so it's great people watching! Even though it was rea","useful":0,"cool":0},"72PXG7v9dL6CRoYkyKLUqg":{"text":"I have visited this place several times, and there are a few things that I really like and","useful":1,"cool":0},"I1p3yMAgBKlBqwqOoXesEw":{"text":"Café Pontalba is our Jackson Square go to bar whenever we come for New Orleans.  It's an o","useful":4,"cool":2},"YxsJ6EJpzkAFY4K2t3-ahA":{"text":"Well we came with family and portions were reasonable but fries were cold and tasted old. ","useful":0,"cool":0},"VzBrGD_7o8JTX1PvOidSMw":{"text":"Awesome location with great people watching. Service was efficient and friendly. We had th","useful":1,"cool":1},"tPY3bF6wEV0dnK3n9ofoxQ":{"text":"Chris out bartender was awesome! She recommended the gumbo and the po boy which was tasted","useful":0,"cool":0},"XPKsVCoCVBzt83BtXgV6AA":{"text":"Not the best.  Seafood platter was not seasoned well.  It is located at a good spot.  I wi","useful":0,"cool":0},"xaGXdUU0wuXO54w-sINJkg":{"text":"Very subpar experience dining here. We chose this restaurant because there was no wait, it","useful":1,"cool":2},"ANjONpigzhYoHjVEnONKSA":{"text":"Food: 4.5\nService: 5 (Michael)\nAmbience: 4.5\nDate/Time: 12/14/2019 4:30pm\nOrder: Creole co","useful":0,"cool":0},"38PMWhw_bTfz-1i3RlGfyQ":{"text":"I don't understand why this place gets such a bad rap. It   opens up onto Jackson Square, ","useful":0,"cool":1},"4TRzfaOiXgq68os-PErgKA":{"text":"Conveniently located at the corner of Jackson Square with open doors & windows, their food","useful":0,"cool":1},"yNJzBvvOhRSCviREQxYiNg":{"text":"Stumbled into this spot for breakfast, it was ok. Nothing special. Kinda pricey, which is ","useful":0,"cool":0},"Vw-1cxHC0bMWV_9UmCrvXA":{"text":"Had the Cajun pasta was pretty good husband had the fish with artichokes and lemon sauce a","useful":0,"cool":0},"TwMJskkB32gjA5K-T9YzDA":{"text":"This was a return visit after six years. I sat at the bar and had a few beers and crawfish","useful":0,"cool":0},"fbnpo3cb39Gs8nPxrpizfA":{"text":"We believe we had the best red beans & rice in the quarter. Rebecca was attentive and very","useful":0,"cool":0},"NUNI1lvOVOs0D1DjcxkO8g":{"text":"Usual tourist trap with usual menu.  I will leave the Big Easy with memories of poor dinin","useful":0,"cool":0},"lZ4_iY5zvNauJL9h3FJM3A":{"text":"Best Caesar salad i have ever had. Went here twice during our stay in New Orleans. First t","useful":0,"cool":0}}