{"OWNKAoJKbPpcmEjaqm11Cg":{"text":"We've have storage space with them for almost 4 years. They are very helpful, courteous an","useful":0,"cool":0},"Hi8GowLMYoiVXfnjQMlGzQ":{"text":"I would not recommend this place to anyone! We have two units here and they were both brok","useful":0,"cool":0},"WFEFUTpzbnY5x9a7slfMrw":{"text":"We leased a unit from Ezra yesterday, he was courteous and helpful, the facility appears c","useful":0,"cool":0},"vf9BufbYIbCE47NASTwqpg":{"text":"No wonder Tulane students are TOLD to not put items in this storage facility. This place i","useful":1,"cool":0},"g-7BOGJjVFox1pmxQKdk8Q":{"text":"I stopped by to get a storage unit that was advertised on the website.  The office was clo","useful":0,"cool":0},"P2o-rABGJD0aSTNATkeJiw":{"text":"Called to shop prices for units. I was hung up on at first and then spoke to another perso","useful":0,"cool":0},"C_KHaKpAChA1nAfP34ZF4A":{"text":"Stay away from this Public Storage.  I have a climate controlled unit, which is behind the","useful":0,"cool":0},"xd_moTWR03uX_bcs916H9g":{"text":"Leased a unit for almost an year and had no problems what so ever. Staff are attentive and","useful":0,"cool":0},"nv9dysyA3cb4VmkxJ1vWyQ":{"text":"When we arrived, the staff was attentive, courteous, and helpful in answering all of our q","useful":0,"cool":0},"W1d9IYUlSzrfTVnpjmhOEg":{"text":"Storage is not inexpensive. You look for access, security, lighting, and cleanliness. This","useful":3,"cool":0},"4xLn-5dSEIgbVeXpOcQGDQ":{"text":"After having my goods in storage at this facility on Tchoupitoulas St. for 6 months, it is","useful":0,"cool":0},"kv7moDjpBB9VUR-Bfp-eNQ":{"text":"This storage facility was a saving grace in a time of need. They helped me to figure out e","useful":0,"cool":0},"VRJBjfj8GSWV0rh-DZFYKg":{"text":"The most irresponsible bunch of business owners ever. Unworking elevator for past several ","useful":0,"cool":0},"Fp9JcNhNwEFrETXDeyrXXw":{"text":"Great service from Charleen in the office. Helpful staff and reasonable storage prices.","useful":0,"cool":0}}