{"dp8UBvgn9RIZDu3wR-iu5A":{"text":"A very nice hotel and a good value. ($175/night) The king bed was primo, the room tasteful","useful":1,"cool":0},"nt83C6N73pWHg6DXfeCRFw":{"text":"Celebrating our honeymoon over New Years week, we were lucky enough to score a few nights ","useful":0,"cool":0},"Rul03HzZ8Ljt0LIlqccTVQ":{"text":"Stayed here with the family for six nights on a trip to the Big Easy. A beautiful and char","useful":1,"cool":0},"ZbvDPJ1BBzcB0ac6HzzkyA":{"text":"Overall, this is a nicely appointed hotel with nice rooms, good service, and good amenitie","useful":1,"cool":1},"ej9A0gq2Yewz5PMJTWi_IQ":{"text":"Disclaimer: I'm writing this review for the common areas of the hotel, which I've experien","useful":2,"cool":0},"bq5545g3gqY0q2o6yUhxXw":{"text":"Please be aware if you have a pet and are staying here they only allow you on the 3rd floo","useful":0,"cool":0},"XqYs7d0DWYPgk1ZxUGNl1g":{"text":"Beautiful, upscale, great location, great service, love the rooms, the restaurant is price","useful":0,"cool":0},"k24HGg8WtMRBQuKuxnH5AA":{"text":"I recently stayed here with my husband and had a wonderful time. The hotel is beautiful, t","useful":0,"cool":0},"c_6FtVx-SeJkAtDEnYbhtg":{"text":"I loved this hotel! It was a little more than I wanted to spend, but so worth it. Convenie","useful":1,"cool":0},"qiNs_G85AfCBL88yjOnjaQ":{"text":"Honestly the staff was SO friendly here Alyssa Richardson, Kelly Childress, Parker and Bra","useful":0,"cool":0},"r9t06oeZy9fRpb0L1wtQMQ":{"text":"Beautiful place with an amazing carousel bar. The drinks were great. If you're looking for","useful":0,"cool":0},"WKnXUJYEeMTsUQSeE-V6tQ":{"text":"Awesome bar area.  Very customer service oriented.  GREAT location.  What more could you a","useful":0,"cool":0},"pQzLWtEudQQoKC0noV-Xag":{"text":"Love this hotel!  Perfect location in the French Quarter.  It is a block from Bourbon St. ","useful":0,"cool":0},"hLlooH-SXwtIs3SmGMkhww":{"text":"Hotel was overcrowded and lost our reservation it seems. We had to pay extra for a suite s","useful":0,"cool":0},"RpB-ZpdTaMeqSVJRclAPpw":{"text":"The friendly staff really make this hotel a pleasure to stay in!","useful":0,"cool":0},"DC7kuWmxR0pHtFPZZR1t-Q":{"text":"The hotel is beautiful and clean and the Carousel Bar is fun. My only complaint is that wh","useful":0,"cool":0},"FVNkvvFSA8b34vXoI_d41g":{"text":"This is my happy place in New Orleans; even if not a guest of the hotel (which I always tr","useful":1,"cool":1},"w5jcsPZBF5-zvK2dykHaTA":{"text":"My favorite place to stay in the French Quarter. Beautiful and well appointed. Housing suc","useful":0,"cool":0},"E2nGhD_WEKl565coa29o-Q":{"text":"Stunning hotel, great service and a fantastic brunch!! The best beignets in Nola! The hote","useful":0,"cool":0},"-GligDxr4s79-hcoQ6Klrg":{"text":"We had been recommended this place by a close friend so we came in to check out the carous","useful":0,"cool":0},"aZzDuaN7nadUomfbShqtWw":{"text":"Impeccable hotel with excellent service-from doorman, valet, to front desk and Carousel st","useful":0,"cool":0},"NqgVuFqDS_ekEr_sjYnPeA":{"text":"As the man at the front desk just told me, check-in \"begins at 3, that doesn't mean a room","useful":7,"cool":0},"AGW0JZ_h9dCvaFPajZdRRg":{"text":"Stopped for one night on our way to Florida. It was a nice hotel, rooms were great but kin","useful":0,"cool":0},"Qaw4-ScyKuefxjdW3cm9Qg":{"text":"Favorite Nola hotel! Great history and antiques, comfy beds, very clean. The pool area is ","useful":2,"cool":0},"jB_xvFr7_wC9VirrW_ObOA":{"text":"We just spent 3 nights here in a Royal Salon suite. It was a nicely appointed, spacious, c","useful":3,"cool":0},"zA3WMHXUQOQy1pi85YG1Cg":{"text":"I stayed here through a special on expedia.com during Halloween and I must admit I wasn't ","useful":3,"cool":1},"4LDAjfiB9tICv72gonzZ6w":{"text":"Great history in this hotel.  Rooms are spacious and well decorated.  Bathrooms are a litt","useful":0,"cool":0},"aZu71s4d6UTdVueefbKW_Q":{"text":"Was so happy here! \nLocation 5 stars\nService 4 stars\nRooms 3 stars \nVery clean excellent c","useful":0,"cool":0},"qmkJDOIca55NnPBgF-x4BA":{"text":"Hotel Monteleone is in the perfect NOLA location - immediately at the beginning of The Fre","useful":1,"cool":0},"Jq8kPQbWgVHRzVXM840YyA":{"text":"I had a very enjoyable stay here while attending a conference. It's an older hotel but ver","useful":0,"cool":0},"zKlTq8YdQ3HkUFLsN5YjSQ":{"text":"What a great anniversary weekend we just had! Thanks to Steve Caputo, Sonia Collins and Le","useful":0,"cool":0},"aNyGmstnWDk6u_sdPnGlrg":{"text":"A cool. boutique-ish fancy boy hotel with a great location for nearby bar related debauche","useful":2,"cool":2},"ELCo_NyeKoTusUaUWh_AsA":{"text":"We had a very enjoyable stay. This hotel is lovely with a massive display of roses in the ","useful":0,"cool":0},"1uMO530PodcRRTCVUkyMXQ":{"text":"Love this hotel!! The Carousel bar is a must see and the lobby is gorgeous, but we will be","useful":0,"cool":0},"62UWTyM_ebSFHYfN2SvjYA":{"text":"Centrally located in the French Quarter.  Best air Conditioning! Hotel employees are very ","useful":0,"cool":0},"UQrxwosAOwh-ILsCkjVkDA":{"text":"We chose the hotel for our room block for our wedding on May 11, 2014, as we have stayed h","useful":1,"cool":0},"LJ4CC-WFzlk7riKu2M9lcA":{"text":"We stayed here for 3 nights late may. Great hotel. The rooms are clean and the staff are h","useful":1,"cool":0},"7zXREpwjPVsB_oavrICHLQ":{"text":"2nd trip to Nola and this was on my list. Old world charm meets modern day living. My 3rd ","useful":0,"cool":0},"VkiboffdaiRfIhxve8JbzA":{"text":"We are in New Orleans for a friend's wedding and our 5th Anniversary and we called and res","useful":0,"cool":0},"w3CTIBJN7JCDHH_1SsSxfw":{"text":"Pamela and I stayed here for the duration of our New Orleans vacation and loved it.\n\nEven ","useful":2,"cool":0},"eRZUXNpi19mac73ohmzkHg":{"text":"Maybe it's because we look young, even though we're not. Maybe it's because we were travel","useful":9,"cool":1},"ECJlyVObEjjUFfZcBhrafA":{"text":"An absolutely beautiful historic hotel in the heart of the French Quarter. The carousel ba","useful":1,"cool":0},"C2vigMQ_DEPHbOGxnNks5g":{"text":"This is a beautiful hotel with all the amenities. The bar is not to be missed, but get the","useful":1,"cool":0},"khJ5IwHDEko634sdOKrbpA":{"text":"We recently stayed for the first time at the Monteleone. The Staff was very helpful and fr","useful":0,"cool":0},"-2RQ2-fGplK6mf9A3zvL_w":{"text":"from the outside and inside, this hotel is gorgeous! they also have the Carousel Bar insid","useful":1,"cool":1},"KDIUu3QzURr3RjnIG6jXLw":{"text":"My husband and I stayed here for a 3 day \"mini-moon\" following our Nashville wedding last ","useful":1,"cool":1},"LBk9UsKAE0iPLgXR0dM-CA":{"text":"My family and I occupied two rooms during our stay at this hotel.\nPros:  This hotel is bea","useful":0,"cool":0},"0YyceUfFvr99LER8BpjvAQ":{"text":"5 stars for a 5 star hotel. We were on the back side so we had total quiet. Nice pool, gre","useful":4,"cool":1},"iTjVSswuTeNVh_lBxxoO5A":{"text":"This hotel was okay, but not great. It is overrated. My room was not cleaned even at 4PM i","useful":1,"cool":0},"ZwTQChq4LF4mdoQUI_JD6Q":{"text":"This is a historic hotel in the French quarter. My wife and I have stayed her multiple tim","useful":0,"cool":0},"hiN2NbUhJ4IeKB9t4enF2A":{"text":"Awesome corner suite. Room is great. Atmosphere is wonderful. But why hire doormen if they","useful":0,"cool":0},"RPkhMQ44cFqlvnejYV7CFQ":{"text":"$10 a day for WiFi?  Is that a joke?  I know you want your hotel to look like it's straigh","useful":6,"cool":0},"STSnyXXRT0XgU6pjDFumvg":{"text":"Really reasonably priced boutique hotel.  I stayed here over the memorial weekend and I wa","useful":1,"cool":0},"b1GwXa2m2yGH68mTY6LJiA":{"text":"I was traveling for business, and ended up staying here for an extended period.  My stay h","useful":0,"cool":0},"8pcq2zNwtmbzdVQ8yL9TdQ":{"text":"Welcoming doormen and lovely fresh and fragrant flowers greet you on the way in and a plea","useful":0,"cool":0},"BWgbqsiyTStjmHeDMwhPhA":{"text":"I'm so glad I listened to a good friend who recommended me this hotel.  Love the old world","useful":0,"cool":0},"ZFtVutFoklsxmpIU10VYtw":{"text":"Most comfortable bed I have ever slept in.  I was in town for a convention.  Hotel service","useful":0,"cool":0},"XKNg0m_t-S4bsPR7NK9PdA":{"text":"The historic  appearance of the hotel in general, was fantastic.  Why only 3-Stars?  Well,","useful":8,"cool":2},"VTiJ637q8-OTKy_3TvJ6dw":{"text":"Very nice hotel. Lobby was awesome. Everyone was so friendly. Food was some of the best we","useful":0,"cool":0},"f3lV3JHTNoxrQHoRr6RVTQ":{"text":"Truly a classy place with the only carousel bar in the lobby that I've ever seen. It's ups","useful":0,"cool":0},"3ObtW0ayZWJsHAEjPjuStA":{"text":"There is no better place to stay in New Orleans and the French Quarter. First rate accommo","useful":0,"cool":0},"B9q-hayDP1zMHDrYdufc_g":{"text":"The Hotel Monteleone is my home away from home whenever we visit N'awlins.\n\nIt's on the ed","useful":2,"cool":1},"0YO_WJOFjfFggFMlGq2tfA":{"text":"I have been to NOLA 3 times and every time I have I have tried different hotels. This hote","useful":1,"cool":0},"MIVPpnIXwQhO6MfOLJM_FQ":{"text":"I am here now. The location is terrific  but our carpet is stained!!! 250$ a night is a  b","useful":1,"cool":0},"8b_FAqDCXEqS6pxSA0QF9w":{"text":"Very, very disappointed. I had heard great reviews on this bar but upon visiting I can ass","useful":1,"cool":0},"lsnOT4uJlYsQPOL8B4Xu4Q":{"text":"Stayed here for a conference and I'm glad my company booked this hotel....Fabulous!!! If I","useful":0,"cool":0},"xjzBRcCJR51e2IMLuAMDog":{"text":"I too was expecting more, especially since I diligently researched all of the hotels in th","useful":0,"cool":0},"zDx9pcNGJ2T3js2BeqLiKw":{"text":"My 3rd time there, reviews are accurate, nice hotel, grand entrance, good location. the on","useful":1,"cool":0},"K93Vq8adxdzf9ww9k7HbqQ":{"text":"I'm giving this hotel 5 stars for one reason only. The service with the front line hotel e","useful":1,"cool":0},"euKraVOq1DH52wrlCkVcQw":{"text":"Based on the reviews and price point I had high expectations. Hotel Monteleone did not del","useful":0,"cool":0},"YR-u_hTEG7_U7MvwAR_wLw":{"text":"We spent two days here and had a really good experience.  The location is fantastic.  If y","useful":0,"cool":1},"RzFkaA5OFZi4Y1hnFZ-vNw":{"text":"Came into town for just one night, having tickets to see the snarkypuppys live recording o","useful":0,"cool":0},"hvL1yDHZr5V2G2w7BTKRoQ":{"text":"Stayed here for the Essence Festival. The hotel is BEAUTIFUL! It was my first time in New ","useful":2,"cool":0},"Tjg3KX26JjFfFdKQVsTgIw":{"text":"My boyfriend and I stayed here for our first trip to New Orleans. I read some of the revie","useful":1,"cool":0},"PCiUH8lCrmcwZi54ghhy2g":{"text":"Never stayed here in a room before but have been to the bar many times. The carousel bar i","useful":1,"cool":0},"fUCy0ikbt1Pl-HGgH2cT6w":{"text":"As a local, this was family's favorite place to stay when they came to visit.  Now that I'","useful":5,"cool":4},"XQ57P-a0VZjbKDSf2YOAGA":{"text":"Loved this hotel and everything it had to offer. So beautiful and everything I could have ","useful":3,"cool":0},"grqxE1lZhKCxRxQ_nZRg2g":{"text":"This is a stunning hotel, with the glitz and service that you would want (and expect) from","useful":0,"cool":0},"S09empwlTNQM5R6Z8L2PAQ":{"text":"I have stayed at The Mont 250+ nights over the past four years. Also tried the Ritz, Winds","useful":1,"cool":1},"IU1lf-GO5h8cyGQMomJbnA":{"text":"Hotel Monteleone is indeed a fancy stay, and preferred stay in New Orleans for most folks.","useful":2,"cool":2},"g7QerK2ehJFPg4LO48AOuQ":{"text":"Great location and within walking distance to everything. Rooftop pool was great and I don","useful":0,"cool":0},"rOCx2JujNyrFtpAnw4I2SQ":{"text":"Four stars for location and charm.  It is a really cute boutique hotel. The rooms and bath","useful":0,"cool":0},"TXX2cM9C7bB20V3N_ZP20A":{"text":"The carousel bar is absolutely awesome! You will more than likely have to sit and wait a w","useful":0,"cool":0},"2VUrBedfoiRTMdPsjOTM-w":{"text":"Very nice hotel.  Service wasn't as top-notch as I had thought- no one offered to take our","useful":1,"cool":1},"ceYlhyVc8UHcUzDyEyaxcg":{"text":"We stayed for two nights in an executive double queen room on the 14th floor (for a weddin","useful":0,"cool":0},"ISiXF2aRsniJTMql0yiV6g":{"text":"This is our choice for New Orleans over the years.  Always friendly, helpful staff in a gr","useful":0,"cool":0},"o08RfnmFVbTneJy-FJRBBA":{"text":"The rooms are nice, we have a view of the Mississippi River. The pool was cool although if","useful":0,"cool":0},"gUcrjUZdge6UvahIQbo3rA":{"text":"Just stayed here last week for a little spring break getaway and this hotel was great!  It","useful":1,"cool":1},"8HeDY-kIeIoNhufSXFyNMA":{"text":"Ok we stayed here while in NO for the 2013 Essence Festival. It was a really nice hotel an","useful":0,"cool":0},"P0-mFmlygPOlVUxHGIEuHQ":{"text":"Such a nice hotel. Rooms are great. The beds are doubles though, so they're small. Loved t","useful":0,"cool":0},"jzUCCG1gunxmoIeoBQ9Acw":{"text":"Classic iconic old hotel. Not sure I'll stay again as city noise is a crap shoot depending","useful":0,"cool":0},"JIVsVP4lpf4hmM7Q1sTDcQ":{"text":"I am giving this place a one star cause of those couple of reasons: 1. After got in, could","useful":0,"cool":0},"vS6m6_nagHSz-ozuPEMpGw":{"text":"I love this hotel! I stayed here a few times. The best things about this hotel are 1. Loca","useful":0,"cool":0},"f3dlyF2giLFB3on2aRMDzQ":{"text":"Went in to look at Carousel Bar, which was magical. There was no place to sit, so we moved","useful":1,"cool":0},"kxJzm_N75f0mZMZqbEW9qA":{"text":"Excellent hotel in a great location.  My partner and I spent 3 nights in this hotel after ","useful":0,"cool":0},"HwzSzX24VrSmBQWptzHoyQ":{"text":"What an outstanding location in the historic French Quarter of New Orleans.  The huge lett","useful":0,"cool":0},"9iCYEqHxBl5ImQ0nwpZDJA":{"text":"Outstanding hotel in the quarter. We stayed on the 125th anniversary promo which included ","useful":0,"cool":0},"MkrqassU3PdoSlt2hZA-Aw":{"text":"excellent - all you need - perfect location - good enough rooms - excellent, friendly serv","useful":1,"cool":0},"rwS9YESA7A4QT0DDEs2dqA":{"text":"Great Hotel in a perfect location! I would definitely stay again. Friendly staff and they ","useful":0,"cool":0},"3LRP5_G9mWptoohYzjOPyw":{"text":"My husband and I were gifted a two night stay for the end of our honeymoon road trip. WOW,","useful":0,"cool":0},"WLYV2kHHNPrJfvoLFfrxiQ":{"text":"Location is perfect in the French quarter. Hotel lobby was always bustling on our Friday t","useful":0,"cool":0},"JZtCavHp4f4jn-kvoip1ng":{"text":"Great experience here, from housekeeping to location (only a block from the ridiculousness","useful":0,"cool":0},"5iAGrN0vxwhYc-67iHxaeg":{"text":"Classy. If you're looking for old school, high class  New Orleans accommodations, this is ","useful":0,"cool":0},"pilf9t5SjLQfhD3UMIUV-Q":{"text":"My friend and I stayed last month and after sleeping there we woke up with welts all over ","useful":7,"cool":1},"vR9dRktP_O65S2lb-ORqgw":{"text":"Old style elegance, fashionable, and one of the most renowned bars (the Carousel Bar) in N","useful":2,"cool":0},"L4dUa4k_-Wu6mlxxu5Qt4w":{"text":"Caveat is that I did not stay here.\n\nAs we were walking by, I pointed out to my friend tha","useful":2,"cool":2},"7paK_GX39I3bcPmhTv_pHQ":{"text":"Bloody Mary Morning for Tales of the Cocktail!\n\nThere is a poem by C. K. Chersterrton that","useful":1,"cool":0},"1Nb0Dg-ns2fbleLokTmosQ":{"text":"I started my own tradition of coming to New Orleans and staying in this wonderful hotel la","useful":0,"cool":0},"Pj5bAcICHn3oOt0sG3fvBA":{"text":"Gorgeous historic hotel. Rooms are clean and classy. Wonderful service and staff. Would de","useful":0,"cool":0},"rPGrDCMXFI06Y0Phc_5f2Q":{"text":"While I found it to be a comfortable and charming place, it was very busy and a lot louder","useful":1,"cool":1},"ZpuBQoBwgfXRkMwGhgiyYw":{"text":"Great old-school hotel! Check in was easy and quick. Staff (front desk, doormen, bellhops)","useful":0,"cool":0},"ahC6pBjjT6gkd_Hq9lW2XA":{"text":"The perfect french quarter hotel! Older but still very nice. You can not beat the Bar! I h","useful":1,"cool":1},"G2h-09zrZKjxs3OIN4pBeA":{"text":"WARNING: BED BUGS!!! If you're thinking of staying here let me do you a big favor and warn","useful":0,"cool":0},"C7XIfMytvE_m8gakFi3FIQ":{"text":"From the moment our taxi dropped us off this place was above and beyond! Also be sure to v","useful":0,"cool":0},"QnUUXoXQmDVNBlVdF9shBg":{"text":"Gorgeous hotel and excellent location. The room was fantastic and so comfortable. The staf","useful":1,"cool":0},"E323ofk8RXagI3DDB5vuvw":{"text":"Terrific hotel and location!  We stayed four nights and had four restful nights sleep.  On","useful":0,"cool":0},"EQJrOxiRib1He-Oso5_v4g":{"text":"Outstanding hotel and great location in the French quarter. Classy, elegant but very homey","useful":0,"cool":1},"ZVfM05DMjBnMOOk3YALAgg":{"text":"Very nice hotel and in a great location. Staff is extremely friendly, but for a fancy hote","useful":1,"cool":0},"VPLHZr3tiw07wdfvGnh29A":{"text":"Nice, old school property.  Although the rooms are a bit small, they work just fine and ev","useful":0,"cool":1},"nJGy4Dh60ITfsDlNWy2C6w":{"text":"Spent our first visit to NOLA here during Mardi Gras.  Super fun, relaxing.  The room was ","useful":0,"cool":0},"GNnYfFHwJYN3s4wmEdS74g":{"text":"This place is the best!\n\nWhen you first walk in, it is stunning! From there, the front des","useful":0,"cool":0},"ecMtpaSX0QTCJaN6-3Lh_w":{"text":"Very nice hotel with a lot of charm. The rooms were comfortable and spacious. The newly op","useful":0,"cool":0},"C5HLtGngMhyEydf_utfd-g":{"text":"For the last 20 years, I dreamt about staying at the Monteleone!  The lobby is gorgeous an","useful":0,"cool":0},"dq1k3H2pjz_YxpZmeJ8flw":{"text":"My boyfriend and I spent New Years week at Hotel Monteleone.  We had a fantastic time and ","useful":0,"cool":0},"8G82BntIzyi0pwcB-mBkcA":{"text":"I highly reccomend this hotel during Mardi Gras.  They give you these awesome bracelets th","useful":1,"cool":0},"TQL83Mt0oVK1HheIcL2tnw":{"text":"This Hotel had class at one time in the past, however, now it's like a frat house- hotel 6","useful":1,"cool":0},"KPakxnRF4N2BbZA_q6bBsA":{"text":"Perfect location and the rooms are beautiful if small.  The AC rocks which is always impor","useful":6,"cool":3},"BsKA1Q9yCsEgz53OCGWdyg":{"text":"This is an historic hotel in the French Quarter. Steps away from shopping, great restuaran","useful":0,"cool":0},"EHWI0V03QeTv7Oqj2nkQ5w":{"text":"A great location one block down from Bourbon street... and the service was top notch durin","useful":1,"cool":0},"Q09KtcRMMMtVTd5sgbaKtQ":{"text":"In all of my years of travelling, I have never stayed in a more beautiful hotel.\n\nWhat was","useful":1,"cool":0},"oxR_5VLsALMcP1GvwQL4Ew":{"text":"We've been coming here every couple of months for a couple of years now. Pretty excited ab","useful":2,"cool":1},"LAEBs-0MxIF-d_z27Fi3vg":{"text":"When was the last time you stayed at a hotel that at one time housed civil war soldiers? N","useful":0,"cool":0},"0nxKHnE_JC_OUlAWgOzG5g":{"text":"The Monteleone is in a great location and the staff is amazing.... Crystal at the front de","useful":0,"cool":0},"wtZgJiqtShOA3mPbwBgGQg":{"text":"This was our home away from home for the Christmas holiday, and we enjoyed our stay immens","useful":5,"cool":3},"HkDeBJq10TUWGEnyeZ7-mA":{"text":"All in all, this is a good hotel. There were a few things in my room that weren't working ","useful":0,"cool":0},"cvC_ec5hdr7SKqRoOM_50A":{"text":"came here for anniversary with my wife, Stephanie from the front desk helped us with makin","useful":0,"cool":0},"VZoT4Do_ALQATHbpSBfbmQ":{"text":"Nice, older historic hotel. Clean. Nice staff.  Rooms are a bit small, but still quite com","useful":1,"cool":0},"oMVl8w_DVUuafVc8yh4rRg":{"text":"Nice room.  Wonderful bar and lobby.  Only rub was the A/C didn't cool the room as cold as","useful":0,"cool":0},"7hrI5gIWqrTnPH_WalsnXA":{"text":"Solid hotel in a great location for a competitive price. We came for the Book of Mormon sh","useful":0,"cool":0},"XtzUtADZ9_aMdr3m1_UrQQ":{"text":"Rooms are smaller but that is to be expected in an old building. Very clean, good customer","useful":0,"cool":0},"XDirf9XkradYssOB5mOZ1w":{"text":"Small rooms, but great location.  The hotel gives an old NO feel and is located within a b","useful":0,"cool":0},"NHvbFW69s4qNNkrpWUrwcg":{"text":"Wow this hotel is what's a great adjective? The lobby and the Carousel lounge are full of ","useful":0,"cool":0},"6L6E5Gky0JEs2sLgC4Vwyg":{"text":"We stayed at the Hotel Monteleone for 2 nights last week and we loved it!  I booked it bas","useful":2,"cool":1},"ooqd0Rs6kGcPXVLrKMmehw":{"text":"What a wonderful location. One block from the madness, but not in the madness. Quiet rooms","useful":1,"cool":1},"N__ux2n_o_lRoD4-eQSmsw":{"text":"We recently stayed 9 days at the beautiful Monteleone for a conference my company was prod","useful":1,"cool":1},"jWx7Ys-fZl8MW5qQv5PlFA":{"text":"It's a great hotel and in a prime location here in New Orleans. The staff is excellent and","useful":0,"cool":0},"ZyLyar8fnZAbEcFjKqd3Dg":{"text":"So I didn't stay here and I'm just reviewing the Carousel Bar and Lounge. First and foremo","useful":0,"cool":0},"-AQ5Z1x6OYCzxU_B_dFu8Q":{"text":"I spent one night here during Southern Decadence on Labor Day weekend.  The location is VE","useful":1,"cool":0},"yBl0MDgpM946XSvEWc2lOw":{"text":"We only stayed for drinks, but really enjoyed the atmosphere of the bar and people.  I lov","useful":1,"cool":2},"XCSKnBOtSmlyrzoUxVFLDA":{"text":"My husband and I are locals. We booked a room for our anniversary to spend the night in th","useful":8,"cool":0},"ZShOe-3ZQIxJ5XUmSaksNA":{"text":"Writing this from within the walls of the hotel.  Not much different from what you deserve","useful":1,"cool":0},"x7VwPd5cF1IU-AOmsHi_EA":{"text":"I use the Hotel Monteleone for business guests that come to town because it is absolutely ","useful":0,"cool":0},"2t2SweLlrHQsgWbO52IKSQ":{"text":"I have stayed at the Monteleone twice before and as other reviewers have said, booked it s","useful":12,"cool":0},"g8qgNWzDc_qhZvcmy5j04g":{"text":"Having been in the hotel business, my expectations are always high.\n\nLocation and atmosphe","useful":1,"cool":1},"5Bz6olvbs0lw5nwUv7GoHg":{"text":"Beautiful hotel with small, clean rooms in a convenient location.  The carousel bar boasts","useful":0,"cool":0},"PTX51hu0EGpgh1BzYKmVXQ":{"text":"Loved the location, the charm and the doormen of the hotel but everything else was just ok","useful":0,"cool":0},"1eY8DguzRGi3TZ5p2PTOBQ":{"text":"Located in the heart of the French Quarter the upscale Hotel Monteleone provided a 4 day /","useful":1,"cool":1},"UxtlECsy7Fdf9UysjBd3WQ":{"text":"I wouldn't stay anywhere else in NOLA!  Everything is wonderful...especially the Carousel ","useful":0,"cool":0},"_S5mDmryqui6Vi4OAMgekg":{"text":"Our room,was a nice size,, the service was great , will go back again!","useful":0,"cool":0},"Gag26cyXM0484S4la39PiA":{"text":"I only take time to write reviews for businesses I believe have provided an exceptional se","useful":0,"cool":0},"_o6-nF_NlV9OzVwFqdkIVA":{"text":"Absolutely beautiful, historic New Orleans! Room room is beautiful and the bed was very co","useful":0,"cool":0},"nbXsiuGROJxFowUM5C0ToA":{"text":"My husband and I stayed here a month ago while on a weekend getaway to New Orleans. We lov","useful":0,"cool":0},"-pWUvd1c9IAoUR6_P3wFZQ":{"text":"This place is magical. We stayed here a few years ago and somehow got some amazing deal on","useful":0,"cool":0},"VbDhmh9qC4_S6XcRobQl2w":{"text":"This place is so gorgeous. I didn't get a change to lodge here, some friends and I just wa","useful":0,"cool":0},"mStyvPesTv6l817Ab79JgA":{"text":"They have a beautiful lobby and the Carousel Bar is to their right. We arrived after the J","useful":1,"cool":0},"YubLYwPbIB2LPdFjPe4GIQ":{"text":"I needed somewhere to stay for a business trip, and I wanted somewhere with some New Orlea","useful":1,"cool":0},"PKfGdJxwo4iNGO20x3Mv4A":{"text":"Cool place to stay in the quarter. A little bummed that my room was RIGHT outside the elev","useful":2,"cool":0},"eBc-ADuOTCsFLB6wFGSmPA":{"text":"This is my second stay at the Hotel and another great experience. The location is great. T","useful":0,"cool":0},"gLl-XBKb1QC0YCB7gjFSyA":{"text":"Hotel Monteleone.... Oh how I looked forward to loving you. Unfortunately that was not the","useful":3,"cool":1},"XVy5uhJBVlsfqn2JyHx1Jw":{"text":"Stayed here with the gf for 3 nights. The location is great because it is walking distance","useful":6,"cool":1},"-u3PgWhN_y4PCBFgzANrrg":{"text":"My friends and I were in town for a few days and going to the carousel bar inside the hote","useful":0,"cool":2},"fExIgSz1APLSpiQbvbkV-w":{"text":"You've got to see the bar!\n\nThe service was great.  Everyone was very helpful.  Can't wait","useful":0,"cool":0},"udlla3USRwBS-l2gz5Gtkg":{"text":"I stayed at Hotel Monteleone for a business trip.  The meetings were also held in the hote","useful":0,"cool":0},"4hgkPtO91Bajhl_2Ozowcg":{"text":"From the moment arriving, it felt like home. The Hotel is absolutely beautiful. I saw one ","useful":0,"cool":0},"YT_VcB3KqzZyYm8uMwLsQg":{"text":"Very good traditional New Orleans hotel in great location. Nice, if not somewhat upscale, ","useful":0,"cool":0},"gEJnG7DtNJIgMbr1OCP_Kw":{"text":"We were very happy with the decorations throughout the hotel.  The carousel bar was very u","useful":0,"cool":0},"soPk3M1LGo9CN_jTHb0mlQ":{"text":"Beautiful historic hotel! Stayed there the week before Jazz Fest. My favorite part of our ","useful":0,"cool":0},"f1GS9cMNlNDn7YnwF5pfDg":{"text":"Overall, I really enjoyed my stay. The location is great, close to the streetcars. Service","useful":0,"cool":0},"eMSrZpx7V1LN42RWPJdNIw":{"text":"This hotel is beautiful and historic. I stayed here in town for a work meeting, and had a ","useful":0,"cool":0},"3_kZZuU8L4Zaq7rjOZLE7g":{"text":"Absolutely wonderful! Although the room was small, such a nice quaint hotel. This hotel is","useful":1,"cool":0},"f454NB5hsQCxuPYjICNQUQ":{"text":"My husband and I stayed here for 3 nights to enjoy Christmas. It was a little hectic at th","useful":0,"cool":0},"xbZktG-pY7ypgU5qulZr5Q":{"text":"Very impressed with the attendants from the bell hop to the valet guys. Rooms clean. In th","useful":0,"cool":0},"PxV_m8gcgMPzshBLwXaALA":{"text":"The experience at the bar was sub par. The carousel at the bar was cool but the fight to g","useful":0,"cool":0},"1fIJPqcUZi190_mgky9Q6g":{"text":"I found that the charm and history of the Monteleone Hotel didn't really make up for the s","useful":2,"cool":2},"uFB9RgxB3rV_YSjHlgeTgQ":{"text":"Ehh, I was honestly expecting more. We got my husband's corporate rate, thankfully, becaus","useful":5,"cool":0},"qcYdft60j8Klp1evgYBo6Q":{"text":"Stayed here on my only night in town and glad that I did.  Gorgeous views and right in the","useful":0,"cool":0},"l17ds_F3ZFa5SDhN5fSL_w":{"text":"Well worth the price. Location, service and everything in-between is great about this hote","useful":0,"cool":0},"4pQvrBpKcCUDJ0YzmEI93w":{"text":"Love this hotel! Carousel bar is one of our faves in Nola. And the pool is also a fav hang","useful":1,"cool":0},"3XiCA01TWluktogoqbEb2Q":{"text":"I stayed here on a cross country trip. The staff is AMAZING and I would stay there again! ","useful":0,"cool":0},"UkRFUUKDMAmdB6LxjMT7Pw":{"text":"A very classy hotel with all the beautiful chandeliers everywhere in the main lobby.  The ","useful":0,"cool":0},"KCA300EkrSIjEMJKsE9Hgg":{"text":"Nice clean room.  Meetings rooms was nice and allows privacy for Meetings.  The main lobby","useful":1,"cool":0},"5BknQ6Erbi1Wpae9u6KYSA":{"text":"I had a room here on new year's eve: $500+.  I guess you pay for location and the holiday ","useful":0,"cool":0},"BrzqJeJKXPEHrSqx32bjNQ":{"text":"Great stay!! Great customer service and a beautiful hotel. The hotel is very easily notice","useful":0,"cool":0},"IO8yb0rt_jP4eOSIIVQ0Fw":{"text":"A great large hotel to stay in on your visit to the Big Easy, even you don't mind loud, cr","useful":0,"cool":0},"uWLmrvgE7fvFCY1znRYu3g":{"text":"Service- 5 stars\nToiletries-2 stars\nBeds-5 stars\nHotel location-5 stars\nHotel in general-4","useful":3,"cool":0},"aSUvQPpHtNVfy0eSMlZc3Q":{"text":"We stayed here this past weekend and it was just OK.  For the price we paid I was expectin","useful":1,"cool":0},"Q1Lz7YovL_AsnVasL1Jyrg":{"text":"This review is for the carousel bar which everyone raves about...\n\nYes, it is a cool bar.\n","useful":2,"cool":3},"6hjE_Im-scES5DueOlt4oQ":{"text":"I enjoyed my stay in New Orleans at the Monteleone. The location was convenient as it was ","useful":3,"cool":2},"JerHo69XoAycXuwHUIZi6Q":{"text":"First time in New Orleans and it just happened to be over the Fourth of July weekend. Yes ","useful":0,"cool":0},"MTsy3Bsw9lEHnd1grTzspQ":{"text":"Nice experience ruined by last night. Given hotel ample opportunity in person & by review ","useful":1,"cool":0},"tpDhigNau0jYvxL_3YnQEw":{"text":"Perfect location!  Right in the heart of the French Quarter, walking distance to Bourbon a","useful":1,"cool":0},"IiLgUckm0wcaE6gtwcFfLA":{"text":"This is our favorite place to stay when visiting New Orleans.  We like it for many reasons","useful":0,"cool":0},"20_Yhuujio9ErZBNecGVig":{"text":"I stayed at the hotel for 3 days and attended conference inside the hotel\n\nOverall a 3.5, ","useful":1,"cool":0},"1EZ4oUcaD4furNYaZIVkwA":{"text":"We love this hotel. The best staff, great food, comfortable, lovely rooms. What's not to l","useful":0,"cool":0},"OhaDFqlxxwop6vqJlH7ZQA":{"text":"Wonderful historic French Quarter hotel with old world style and service.  Visited during ","useful":0,"cool":0},"q4DpnsksFXSw_s7Kpx6Lkg":{"text":"The Hotel Monteleone is always my first choice in accomodations while visiting New Orleans","useful":0,"cool":0},"5ZXeWpyxUGdmRh9ibZwXog":{"text":"Want to stay in an older-feeling hotel where you can hear everything that's happening in t","useful":4,"cool":2},"CBxEnsLROWCq5aI8Qo0TRg":{"text":"We stayed at the Monteleone for several days. The staff here is phenomenal (special shout ","useful":1,"cool":0},"q6pZxkCKXvz9QDGYhxQ34g":{"text":"My caveat is that I have never stayed in a room here, but I have attended meetings and use","useful":1,"cool":0},"hqOqpN-jU8YaZ7XLE-Staw":{"text":"Overall very nice hotel with an excellent location in the French Quarter. The rooms are of","useful":1,"cool":0},"AcyGJ3wjIdfjNN-GsWE7lA":{"text":"My friend and I had a wonderful stay at the Monteleone.  Service was perfect and our every","useful":0,"cool":0},"Qw-fV_oY69CLqbfZR4rupA":{"text":"The carousel bar here was too much fun! One rotation every 15 minutes. The drinks are cold","useful":0,"cool":0},"qfXnJSgtNqVH6LcwXgWBsQ":{"text":"Didn't eat or stay here but they have a spinning bar! What more is there to say. Drinks we","useful":0,"cool":0},"mLGHrF7kHolH3aN4A-HJPQ":{"text":"This hotel is in the centre of the  historic French Quarter. Clean rooms. Roof top gym and","useful":0,"cool":0},"4QxIqOM3nTeHVY1k_FCwNg":{"text":"Overpriced. Poor service. If these things appeal to you then you have found the perfect ho","useful":3,"cool":0},"NzrQOhrmrauW4OkgenajzA":{"text":"Super classy.  No matter where you're staying in New Orleans, come here for morning breakf","useful":0,"cool":0},"7WXvPxfHCs8YANc0ESeVmg":{"text":"Good hotel, located within easy walking distance of the French Quarter, Bourbon street, Ja","useful":1,"cool":0},"AVgddJ7zfqc5L1CL4uN9zg":{"text":"This place was amazing, even after our stay started off a little rocky.  I had booked the ","useful":2,"cool":0},"LskzUZNvXvAxOPIaFBNPVg":{"text":"Pretty nice hotel. I really loved the restaurant downstairs for breakfast. Buffet for $20 ","useful":0,"cool":0},"xeE6CFUakRempezHrba7iQ":{"text":"Stunning hotel with a rich history. Very clean and the service is great. The rooftop has a","useful":0,"cool":0},"mCc9m8JzXhEarQrj8-WmZQ":{"text":"This review is a little late, but better late than never. My friends and I stayed at the H","useful":1,"cool":0},"u0mBSzntQzWigPUiy4offA":{"text":"Checked in for a Sat - Tues stay in mid-Sept. The rooms as well as the entire hotel was VE","useful":0,"cool":0},"0-igXBs86ICAO618KqyrTw":{"text":"Stayed here for 3 nights while in New Orleans. Pretty hotel, easy to navigate. Has a histo","useful":0,"cool":0},"iW6MR3NWpcwUg8F3eGzNNg":{"text":"Very nice place, great location, look's historical with a lot of sole. There is a little r","useful":0,"cool":0},"F-rqJ7FPMWhPc_bktMg5Nw":{"text":"We really enjoyed the people and the rooftop pool! Big thanks to Brandon, the front desk a","useful":0,"cool":0},"fMLDEMucdObZMLontwIdPg":{"text":"We try to stay at a different place every time we visit NOLA. So while booking our last tr","useful":10,"cool":5},"lYx7ULboOse36jigbEhLdw":{"text":"My girlfriend and I got this room through the ASHP pharmacy mid-year block of rooms, so I ","useful":0,"cool":0},"OXQg_CaLWMutqIDiX8ofcA":{"text":"Beautiful hotel. I booked this hotel originally and then cancelled it because it was crazy","useful":2,"cool":1},"jXyCWWYJpWEs5rflS7xpMg":{"text":"Stayed here for 5 days, on a partial tour.  Beautiful hotel and can I say...location locat","useful":0,"cool":0},"DqacZCSUBYHXu-u8AaPv-w":{"text":"Always Accommodating, They LOVE me back!!! I have been staying here since the 80's, like h","useful":0,"cool":0},"_O1HKpxL_NeKqkyg_S9F0g":{"text":"Recently stayed here for 4 nights, and it was fantastic. The room was great, beds very com","useful":0,"cool":0},"mWVeXW8GNqusUz6D6k8aWw":{"text":"I have stayed here multiple times and each time have enjoyed my stay. This hotel has a gre","useful":0,"cool":0},"H3PMvqSiKrLKjeWdFmZlvQ":{"text":"Really great hotel! Beautiful with great service. Easy walking to everything without being","useful":0,"cool":0},"967nU8KUHvVzs20q8wKWUg":{"text":"The hotel renovation and addition to the bar is beautiful.  The entire hotel looks beautif","useful":0,"cool":0},"z9_J-pfq2WaXn5Eoi9L0Qg":{"text":"We were a bit cozy in our smaller room, but the service in the hotel and the location can'","useful":0,"cool":0},"Rfae9oFBgpnsRL0s8uR5GA":{"text":"The best. One of my favorite cocktail spots in the Quarter. Tasty Sazeracs. Don't forget t","useful":0,"cool":0},"ySiV5xVRXejQQrGpGkCYuw":{"text":"My second time staying here. Nice historic place. Quiet and clean. Must have a drink in Ca","useful":1,"cool":0},"h7QhDH19zWoCEXLASzMRLA":{"text":"Absolutely just had the best girls weekend in New Orleans and we all agree this hotel is b","useful":0,"cool":0},"qqNTkTeN7HxzxKNword2EQ":{"text":"Loved staying here!! First off, I stayed here for my 30th birthday.  They made us feel ver","useful":0,"cool":0},"cpBJqRVyaJFq0wSbhIQQQg":{"text":"Very nice location but...We waited till 5.00 pm to check in.  Housekeeping at the hotel is","useful":0,"cool":0},"g0rKWmESgrU4VoeJgwlnKw":{"text":"Great hotel, great location, and great staff! We had a great room with a fantastic view. T","useful":1,"cool":0},"7Zk3kC6r_ZkjgiO9W5VRig":{"text":"This is what you imagine when you think of a grand Old New Orleans hotel.  It is busy and ","useful":0,"cool":1},"2nqhpLsay6I1uSyUEAaEnQ":{"text":"We stayed at Hotel Montelone for five nights and our entire stay was outstanding! You will","useful":0,"cool":0},"YSkZGxhs_V_4dvHVd0QDCg":{"text":"My mother turned 67 while on vacation in New Orleans. We had decided to take her to lunch ","useful":0,"cool":0},"3rB-QF8G9hIAMg7Oo5IBrg":{"text":"DO NOT STAY HERE. Employees go into rooms and steal your belongings only because they know","useful":6,"cool":0},"v4Q3SAzYSAhgYS29U9xkkw":{"text":"Wonderful hotel and restaurant!! Espacially manager Mr. Emirhan is so kind. if you are loo","useful":0,"cool":0},"tcI0fuI4frCoe8TbQhyaxg":{"text":"Before we even got to New Orleans they showed us a 5 star performance! The Thursday we wer","useful":0,"cool":0},"QYdawgH-7HXXk3OF_DBrqw":{"text":"My husband and I selected the Hotel Monteleone for a Valetine's Day treat. The hotel has b","useful":0,"cool":0},"ZiPUhK204TD25hpg1OU2cA":{"text":"Everything was great about the hotel.... Till I went back home to Houston. They \"some how\"","useful":2,"cool":0},"SgQhswV3FMs8W8SWd33REw":{"text":"A great respite from the craziness on Bourbon, even though The street is only a block away","useful":4,"cool":0},"455EHdTNT1YtlMLOMR8UWA":{"text":"I stayed here in June- it was a pretty hotel and close to the excitement on Bourbon St.   ","useful":2,"cool":0},"MsyJkJdHE8WxlECb90O9Sw":{"text":"I cannot imagine staying anywhere else in NOLA... the staff, friendly &  knowledgeable, 3 ","useful":0,"cool":0},"a7FbPvZRcXBgJ54_Zl5dgQ":{"text":"Our new favorite hotel in New Orleans! Fantastic service in a beautiful, historic setting.","useful":0,"cool":0},"2QZDOyU4bxgQ0e8lMo5V0w":{"text":"My husband and I went for Thanksgiving weekend and will probably go back next year. Beauti","useful":0,"cool":0},"VCmLku5oC7FRa6rc89vcng":{"text":"I'm about 6 months past due on this review, as I'd promised the receptionist I would write","useful":0,"cool":0},"X8zbGQWXYB33tYMoDwNNlA":{"text":"Went to a conference there in January 2011.  It was fabulous.  Rooms were comfortable and ","useful":0,"cool":0},"HJADLwSyW8_nXqo9C91E2A":{"text":"I have to start out by mentioning that we had a bad experience the previous year staying a","useful":1,"cool":1},"ua9U5M4Q4emm_wKRCis4Ng":{"text":"Great hotel, great location. Smallish rooms, but did you come to New Orleans to sleep?","useful":0,"cool":0},"f_n48X5kdsiiBk1mIlWFUQ":{"text":"Third time here but never again. Room reeked of cigar smoke. Room service food was excepti","useful":1,"cool":0},"wmljAZO2ttW2_cPpWzxymw":{"text":"I very much enjoyed my stay at the Monteleone.  The location, on Royal Street in the Quart","useful":3,"cool":2},"TRyD2aUDG0bKmsO9sMvduA":{"text":"Having never been to New Orleans, we had a hard time narrowing down our choices of hotels.","useful":2,"cool":1},"n7i1zrBpgk_zUcDzv9e-ZQ":{"text":"Gorgeous hotel, great location, and everyone is super nice.  Would absolutely return.","useful":0,"cool":0},"-e7E12NrBnAgpMkP8oK5hg":{"text":"First time staying here. The price was right, the room immaculate, and the staff very frie","useful":0,"cool":0},"ENIfwocWrZUc8pq0XdjCYA":{"text":"My first time staying here and I was pleasantly surprised. Beautiful room, great service a","useful":0,"cool":0},"sHg5If3Pn7n70XfRmtQJAQ":{"text":"The best!  We will definitely stay here again.  The hotel is perfectly located and the roo","useful":0,"cool":0},"zRx6_GUpPOD77kLTKlKNrQ":{"text":"Excellent hotel in a prime location.  Was there for Mardi Gras and it's in the heart of ev","useful":3,"cool":0},"_HUtRlBIe6zsJCbTIZSb9Q":{"text":"We booked two rooms at Hotel Monteleone. Where do I begin?\nWhen we checked into our room (","useful":1,"cool":0},"WdjFV_5Mpk_dllBFSwtH7Q":{"text":"Truly a luxury hotel.  The restaurant and staff went out of their way to assist us in ever","useful":0,"cool":0},"fZvuFWV3Eu5QlpPxp590IQ":{"text":"I continue to stay at the Monteleone for a number of reasons. It is, to my knowledge, stil","useful":0,"cool":0},"8y4E4njXdxx8rLQwbsn0Qw":{"text":"Very nice hotel! Unfortunately upon arrival I joined a group of other guests who were visi","useful":1,"cool":0},"923kkHMDpB7X9eAAExr2VQ":{"text":"Despite a rocky booking process, hotel monteleone more than made it up to us. After troubl","useful":0,"cool":0},"NYKdSooPJGpVzNEg_XzfcA":{"text":"The hotel is in a great location, right near Bourbon St and a lot of other hot spots - clo","useful":1,"cool":0},"kw59EBSY4SdloKiypIujAg":{"text":"Gorgeous Hotel. Was in town recently on Business and we held all our meetings here (and se","useful":4,"cool":0},"pNxQNaQ2QzIboJ_IBfu2yQ":{"text":"I stayed here for a few days in April 2015.  The hotel itself is steeped in local history ","useful":2,"cool":0},"zhzKYDFjcFeahH-0vAKM5w":{"text":"OMG!!! - wordless!  So beautiful and fancy and just omg!!! Make this your  first and ur se","useful":1,"cool":0},"l4tgWMGuRWxYXpklZpf9eA":{"text":"Recently, I had a chance to spend a extensive amount of time at this Hotel, while at Tales","useful":2,"cool":2},"r5bFGnvG0yaXLr-wn8K4-A":{"text":"The Hotel Monteleone has many pros:\n\n1. Location close to the action while not completely ","useful":3,"cool":0},"F5vjoal9VCoMyUv5-wIusg":{"text":"A great experience!\n\nThe staff was friendly and helpful.  The rooms were clean, attractive","useful":1,"cool":0},"UgZeUUblaymiVwrF55AVCw":{"text":"I really liked this hotel. About $200 per night but in the French Quarter this is expected","useful":0,"cool":0},"vES1ERE4cRto4yoCerBV5Q":{"text":"We've stayed here three times, right now we're here for the 2012 Jazzfest.  The Monteleone","useful":0,"cool":0},"pouaLtY0YVopxl2Hi5pJ9A":{"text":"This hotel is in the right location in the French Quarter and the room was luxurious. But ","useful":1,"cool":0},"5Ud4aZ2sABzSxuOj9_jueg":{"text":"Great bar, Beautiful hotel! The decor was phenomenal, service was great, can't say enough ","useful":1,"cool":0},"yHRjKVggl7YtN2d4D-6gcA":{"text":"Very nice rooftop pool area and great location.\nThe staff was friendly.\nThe rooms are a de","useful":1,"cool":0},"0qUyQqfvYKgXZUOI8_BAAQ":{"text":"Clean, friendly and really comfortable beds. This is the place to stay if you want to be i","useful":0,"cool":0},"tB5f-gBachZ0JZ1eDdD8tw":{"text":"My family and I stayed at the hotel the last week in October 2012.  I chose the hotel base","useful":1,"cool":0},"slknZolZjHFEPuEkur5hdw":{"text":"I stayed at Hotel Monteleone during Mardi Gras and I have to say the location is great and","useful":0,"cool":0},"WiXtgDVBKvbYQK28Ra06BA":{"text":"Family owned and borderline ornate in spots, the Hotel Monteleone proved a welcome respite","useful":4,"cool":2},"gtT-tgPc9T2djj16YuOGWQ":{"text":"Great spot in the heart of the French Quarter.  While we were not staying here, we visited","useful":2,"cool":1},"g-w3I--1Ps4d-9TiBXzVDA":{"text":"Ornate and Beautiful. Best Bell Staff!! Bathroom drain problem and they moved us to an upg","useful":0,"cool":0},"ow5Wlz6_IDk7ys3bhyYKLw":{"text":"Had a great stay here. Easy to get to French quarters and Bourbon street . The Carousel ba","useful":0,"cool":0},"ojkjedIMitkjbS4cg4HQ8g":{"text":"Nice hotel but they managed to misspell my name and did not correct it when I checked in. ","useful":0,"cool":0},"q2pa0Dudo1DhVt_xZGSf2A":{"text":"Stayed here for the first time after Christmas. I was very impressed. Got a veaux carre su","useful":1,"cool":1},"2JR3nr-wTrEcW5BIE7ZbKQ":{"text":"We moved  from a less expensive hotel to go to this hotel for our last three nights in New","useful":3,"cool":0},"GRL8fYsT44tJo2xIXUrqRg":{"text":"Great 2-night stay during very busy Mardi Gras season. Perfect service, rooms and locale. ","useful":0,"cool":0},"4IXbdmoLjzsh7LltsF_YyQ":{"text":"Fabulous service and close to everything in the French Quarter and surrounding areas witho","useful":0,"cool":0},"VUfVteoXOWdBZGilASRjSA":{"text":"I only stayed here for a night for business. We stayed in a suite which was nice. It wasn'","useful":0,"cool":0},"EPbwz3fZhrhhTDaW_r_M9A":{"text":"Stayed at the hotel for a convention of like-minded individuals who pretend to be vampires","useful":0,"cool":0},"Klv1okbsEaGGc68cZhtyng":{"text":"Great location and fun carrousel bar near the lobby! They also have 24 hour room service w","useful":0,"cool":1},"83xBuuJBUh75tRsyH3z4hg":{"text":"I WOULDN'T STAY ANYWHERE ELSE IN NOLA!\nThis will be my 5th or 6th year going to New Orlean","useful":0,"cool":0},"1AyB-JAd-4WSnssJuZ-cWg":{"text":"Love, love, love this hotel!  My husband and I meet up with 4 other couples each year in S","useful":0,"cool":0},"dQ1kXJqncUhjyaXdaLgs6w":{"text":"Nice hotel. Quaint not huge. Classic NOLA-French antique decor. Rooms are like the hotel, ","useful":0,"cool":0},"2TLcSA9eKHUpkCHbBgAyQg":{"text":"We booked this place totally blind through priceline.com. We were promised a 4 star hotel ","useful":1,"cool":0},"9Xa450QbOU4UbAp_ygd4kQ":{"text":"Beautiful hotel- wish we could've stayed longer. They have a luggage check room for when y","useful":0,"cool":0},"EnzjNm3zW5YXKBbvtxDj_g":{"text":"Perfectly located in the French Quarter.   \n\nThe friendliest, complimentary service all th","useful":0,"cool":0},"RVl8bx-PMfoqCl8PYKnDBw":{"text":"Stayed here for a wedding during this week. Main reason my wife selected was reviews and t","useful":1,"cool":1},"qTWESJssBNdJOs9BB8VXsw":{"text":"Our first visit to New Orleans and it was made great by the wonderful staff and accommodat","useful":0,"cool":0},"aKB1L7q5so441l0wrMoaFQ":{"text":"I'd stay here again in a second.  Despite staying on the haunted floor (14) we had a blast","useful":0,"cool":0},"_QbJwCSaZfG_SU1LjwcC3Q":{"text":"Stayed here for a quick weekend trip. It is right in the French Quarter one block over fro","useful":1,"cool":0},"dPT_b5cM_JoYFnQ__ChJBg":{"text":"I had a wonderful stay. I enjoyed my massage from the spa so much I went back for another.","useful":1,"cool":0},"bX4NScMT1v1KJRgP4ioviQ":{"text":"Amazing service! Stefanie was so considerate and did everything in her power to make sure ","useful":0,"cool":0},"nVA7-vTVydKUXzUj9jXKCQ":{"text":"I went to New Orleans for Southern Decadence 2012 of course Hurricane Issac was also there","useful":0,"cool":0},"Vpo9TmZ1J-kVjEZm7jxJJw":{"text":"While the hotel was beautiful, and the people were kind, I can't help but get a little pee","useful":2,"cool":0},"Oml7YaQqJvmX3k0tJ5KjCA":{"text":"Love this old hotel!  125 years old but very well maintained and updated.  Renovations pro","useful":1,"cool":0},"cq-5sS7_jwixydzsnz42KQ":{"text":"Wonderful hotel!\nBeautiful, comfortable rooms.\nFantastic bar\nDelicious restaurant\nAnd so c","useful":0,"cool":0},"KNNj0RAVen5uO3_tlqgpzQ":{"text":"I cannot say enough good things about this hotel!\n\nThe atmosphere is charming and has such","useful":2,"cool":0},"eh8J84xaGWjE1bUjx8W9TA":{"text":"Nice room. Great customer service at check in/check out and during room service. Rooftop p","useful":0,"cool":0},"fDqmgyO_yWU2nV3r2ALMKg":{"text":"Staying at the Monteleone had been a dream of mine even since I became interested in the c","useful":3,"cool":1},"8gTL9ulpN_XfT98IlU212g":{"text":"Just okay for the price you are paying.  Great location. Small bathrooms with very little ","useful":1,"cool":1},"-18w38e6s8_bSO3mJiDp8A":{"text":"LOVE IT! \nWe have stayed at Hotel Monteleone twice. two years in a row. And probably will ","useful":0,"cool":0},"K1ibZXH7WYMCiza2wifYXw":{"text":"I really wanted to like this hotel, and there are many things to like about it. Unfortunat","useful":5,"cool":2},"BymKzzQfZGw7bD8_IkydWw":{"text":"ordered room service for a cheese pizza. room service said it would take 30 minutes or les","useful":0,"cool":0},"7t_B08Ro1nuB8mgqGNbfYA":{"text":"Beautiful hotel with a great location.  Their flowers out front were so pretty.   Elegant ","useful":0,"cool":0},"ApygSAAb8L0tF4hCPEhlBw":{"text":"If you are looking for a nice place to stay in NOLA, Hotel Monteleone is not a bad choice.","useful":0,"cool":0},"LL0pUfG5SD56qRSc7V1G9w":{"text":"Busy but hip  strong vibe, with a nice mix of local business and visitor curiosity. Hugh w","useful":1,"cool":0},"DocHudBUFzrYJEVC-C2Vaw":{"text":"Great location! We had a room on the 14th floor overlooking Bourbon.  Hotel is on Royal on","useful":0,"cool":0},"QSkPt_A9Q-6Zk_vufXLxlg":{"text":"Though I haven't actually stayed here yet, I can definitely vouch for the rooftop pool, an","useful":8,"cool":5},"uz22UX89mld0raCn84R-Ew":{"text":"Stayed for two nights on a recent business trip. Since I did not pay for the room, I'm not","useful":0,"cool":0},"M2AY3Yw0KnQtjpffdalVig":{"text":"I go here strictly to bring our out of town friends to the carousel bar, take them for a s","useful":0,"cool":1},"K98De4vk360og_8Hhnz6kQ":{"text":"The carousel bar is favorite for us. The door guy was great. He let us bag check our bicyc","useful":0,"cool":0},"eXojMAn1sy3uYyB-7iL4SQ":{"text":"This hotel not only met, but exceeded my expectations for one which not only sits in the f","useful":1,"cool":1},"oQMksusRYU8I13V6fhpcdw":{"text":"Classic Hotel located one block off of Bourbon Street in The French Quarter. Rooms are dec","useful":0,"cool":0},"0svd_zxWUYF4hVj3cSZ18Q":{"text":"I moved to the West Coast from Louisiana years ago. My friends and fellow Californians are","useful":3,"cool":2},"ptjGuqo_8lfaE5_iedDBlw":{"text":"Stayed here for a Mardi Gras weekend. Amazing customer service! Kennedy was our bell boy a","useful":0,"cool":0},"Wab2Gp7Asrh2f-27K8r9ZQ":{"text":"Everything was great, bed is comfy, great movie options. The only thing that needs work is","useful":0,"cool":0},"GR9vw08QO3OcYyv2I_RMdQ":{"text":"Great location. Friendly staff. Small but clean rooms. Crowded noisy lobby due to Carousel","useful":0,"cool":0},"mGHjauTo1GJyjfzSv7Werg":{"text":"During prior trips to New Orleans, we stayed at the Royal Sonesta, but this time, we thoug","useful":1,"cool":0},"BNX_fKTic7ahA8J4qUS_OQ":{"text":"Fantastic hotel. Excellent location. In the french quarter but not noisy at night. Staff w","useful":0,"cool":0},"ptiQahI_t--2ayjwyqG5Jw":{"text":"A lovely hotel, super nice staff & a great view of the river from our 15th floor room. I'd","useful":0,"cool":0},"KKiCDUebrZl7ufiho_TArQ":{"text":"My absolutely FAVORITE hotel in NOLA. \n\nSafe location, GREAT location ... right at the edg","useful":0,"cool":0},"wewWq-ZRvHukt30Eregvew":{"text":"Bad experience with Hotel Monteleone via Hotels.com. Tried to change dates of reservation ","useful":1,"cool":0},"dLM6bU906ZGaZc5OjGGtjA":{"text":"Beautiful architecture but expensive and needing some customer service. 4 put of 6 groups ","useful":1,"cool":0},"SIm1BdJ35VCpPrf6LQoiuA":{"text":"Great hotel! Rooms are spacious. Conveniently located! Coffee is excellent and the staff a","useful":0,"cool":0},"zvRx_RfDBRLz2c4C7e0oAw":{"text":"This was a very nice, old but remodeled hotel in the French Quarter. I stayed here for fou","useful":1,"cool":0},"v6DNPQbRCIGI37nGunlPjw":{"text":"Perfect hotel if location matters.  I have stayed in other hotels in the quarter that had ","useful":0,"cool":0},"HeG-iCLepNbZHDs8nE83NQ":{"text":"We stayed here for 6 days in the August heat; 2 adults and a 5 year old. Good thing there ","useful":2,"cool":0},"ErZi-2kZbBRkBTJnfHBrlA":{"text":"This review is only for the bar.  Obviously the carousel bar is awesome and unique.  Bar t","useful":2,"cool":0},"7vsjYOFCPuS3muz974R9yQ":{"text":"We had to wait a little for our room, even though I called ahead and told them we would be","useful":1,"cool":1},"R-6ntAdx__cPiHSaIOl20Q":{"text":"Great in every respect. Only complaint is that the internet service is slow and valet park","useful":0,"cool":0},"sJ9_OBhMdGFOfWOP6eVbhw":{"text":"Very beautiful hotel!\nSuper small rooms but their restaurant and carousel bar make up for ","useful":1,"cool":0},"PFsvE36HDDVJvpH927E7hw":{"text":"We are so fortunate to have found this hotel on our first trip to NOLA. The location could","useful":0,"cool":0},"Cmlcf0FZ8kyVlckQrrFjfQ":{"text":"EXPEDIA USER TIP! I have stayed at the Monteleone five times over the past three years and","useful":0,"cool":0},"1ySeqjoI6If8dUDeRWZ6-Q":{"text":"Hotel Monteleone is a Great hotel in a great town at a great location. The room  was beaut","useful":0,"cool":0},"BAoOlN7E1uLywU-ISF8fgg":{"text":"Classy with Old World charm.  Lovely detailing in the ceilings and walls. Ballrooms that g","useful":0,"cool":0},"ZMgjW4ZLmsic9EfomVBOQg":{"text":"I am very disappointed with the service at this hotel.  For it being \"the best around\" my ","useful":0,"cool":0},"e-N-ngycRa8E1RyUrXuxBw":{"text":"Johna is the best!!! Checked in past midnight and asked her what we should do. She had a l","useful":2,"cool":0},"VJmW0E91AUWJKM0Raxa6FQ":{"text":"The rotating bar is cool.  The rooms are small and whatever you do, don't eat the oysters.","useful":1,"cool":0},"KQp-ZzPLP8gYcQGQPyjosg":{"text":"My fiancé and I wanted to take a trip to celebrate our anniversary, which falls on Hallowe","useful":2,"cool":1},"QsFjJAzsVERdTk2pXzktyA":{"text":"I would love to give this place 5 stars because we had a lovely stay until the maid either","useful":1,"cool":0},"z1_bjp5l9aXST57vd4ehdA":{"text":"Wow. What a classless hotel. I've never felt more like a piece of dirt then the day I walk","useful":0,"cool":0},"C_Al9n_heSWepFgJYYYjRA":{"text":"My sister and her boyfriend are currently staying here. My other sister and I wanted to su","useful":0,"cool":0},"H8b5Ioe_kAeP4i2wo9GFMg":{"text":"OMG these rooms are small. And OMG I was there for New Years and the hotel was a zoo. I wa","useful":5,"cool":1},"wXPGrWtP8ZPQRcdUKuZfQQ":{"text":"Make sure your not in or up in your room at 5:00pm having a general normal conversation or","useful":1,"cool":0},"z6cJaTbipLGp3AhBHJLDZQ":{"text":"Let me start by saying that we've always been curious about staying here.  Let it be known","useful":9,"cool":0},"qaP9h7iSU7XQX3PbYdz-xw":{"text":"Really enjoyed our stay; it's close to Canal, and far enough from Bourbon St. that it's qu","useful":0,"cool":0},"e8HAihuOTeeQG0xIr1KuVg":{"text":"We loved this hotel, it's historic the staff are wonderful, it's in a very convenient loca","useful":0,"cool":0},"MJKZP8AeRrOY-o0yN0Dpzw":{"text":"The rooms are small but very nice. Beds are comfy and almost every room has a good view. B","useful":1,"cool":0},"3t3AoMYQ7-ar2tj419QE2A":{"text":"Honestly this hotel is designed beautifully!!! Everyone was so friendly and helpful. The r","useful":1,"cool":2},"CAyQs-HU-pOPtoqajSJpOg":{"text":"I don't give many 5-star ratings, but will make an exception for Hotel Monteleone.  From t","useful":0,"cool":0},"hzwghPh0Zu5tslgrm3qYAg":{"text":"The room decor was quite off-putting. Having stayed in luxury hotels in other cities, I wa","useful":2,"cool":0},"x7Tju74JrO10iBaYK6wVyQ":{"text":"Although, I've never stayed here myself, my sister stayed with her new groom on their wedd","useful":2,"cool":0},"WXoe46X8mfOS7T7IDgOM5Q":{"text":"Like most Americans I want it all. And I want it right now.  This hotel caters to those ne","useful":9,"cool":6},"9UQ7gZrzvC4SXr2LPZsmFw":{"text":"Checked in early, staff was helpful with my questions, room rate was $109 for an executive","useful":2,"cool":0},"QE4AXIc7dJ2THOueyxxEzA":{"text":"The best thing about this hotel is the location. It is 1 block over from Bourbon St and wi","useful":0,"cool":0},"PmYEvFNy8MDyA74HxT4nFQ":{"text":"\"The Silent Summer\" at Hotel Monteleone, NOLA\n\nMezcalElSilencio\nAgave\nLime\nStrawberry\nCucu","useful":3,"cool":1},"sCzmp5-KCbp_1cr2NsazzQ":{"text":"I stayed for a week during Tales of the Cocktail and what a fantastic hotel!  Despite the ","useful":0,"cool":0},"etWEDiXOtggTo0kFamcACA":{"text":"Every time I walk over to the Carousel Bar I see how beautiful the Monteleone is on the ou","useful":4,"cool":2},"Pn7qKyZZiUyKvZOcYRcnpQ":{"text":"Traveled to NOLA for a conference and brought my 9 mo. old son.  The hotel set up an actua","useful":0,"cool":0},"oYJ5PCsY3Roo_KNN_4q5WQ":{"text":"Nice place but shitty amenities.  The beds are flimsy and shake like your on a trampoline.","useful":0,"cool":0},"sEQQI_OeuKx3GLcl5I6PWg":{"text":"I don't know why this place is marked $$$.  I got a great room for a really reasonable pri","useful":10,"cool":3},"0vqpyD85zfxpAVzA8gnyDA":{"text":"Nice for a historic hotel. Does not have the amenities of a modern Westin, though, and $30","useful":0,"cool":0},"8agQytPjrKyUiFdk4e5Mew":{"text":"We just returned from a mini-vacation in New Orleans and we're happy we decided to stay he","useful":1,"cool":0},"TgK4O0m3hxpkMsarM4QvPA":{"text":"We have visited New Orleans 12 times now since 1984.  This is the 3rd time in a row we hav","useful":1,"cool":0},"iFEAgMO0gNytqKLFZwwNog":{"text":"Had a fantastic stay here. I stayed in a \"preferred king\" room and it was lovely. The enti","useful":0,"cool":0},"bVzi72ksdFifM_3-2VUapg":{"text":"This was such a wonderful brunch!! There is food for all different tastebuds, but the auth","useful":0,"cool":0},"rtLwvTtbggDgLiqmy8DOxg":{"text":"Inside this hotel is a revolving bar! It was way cool and the drinks were stellar. Will re","useful":0,"cool":0},"qQc5yGgLljw5vZOULFHVyQ":{"text":"I am so mad. We are staying at what is one of the nicest and most well respected hotels in","useful":1,"cool":0},"Uju4oLMY0473Nb4kex67cA":{"text":"For my recent Nah'Lins trip, Hotel Monteleone was chosen for me since my conference was th","useful":11,"cool":8},"g0U1xTHz4DGwsTcLZoTTWA":{"text":"Beautiful.  Comfortable. Very clean.  Wonderful doormen and staff. Perfect location for pa","useful":0,"cool":0},"trDXpEYTzgTDYwXbPB21Ew":{"text":"Location, location, location\nJust a block away from the world famous Bourbon street, this ","useful":0,"cool":0},"_euc6TVsH5Q4GoOb69vJug":{"text":"We came in for a drink at the carousel Bar! It is amazing. We even got seats at the bar fa","useful":1,"cool":1},"BPC4VDupRpibc3WEnv918A":{"text":"Great historic hotel that is a must stay once in your lifetime.  The staff members were wo","useful":0,"cool":0},"haKQtQ7YdH8VOSYYwPjCUg":{"text":"Beautiful hotel! Old, quaint but exactly where you want to be in NoLa. Pricing was afforda","useful":1,"cool":0},"11hdNlk_vDWoCTa_s_14Fg":{"text":"Stayed with my husband for our five year anniversary this past weekend.  The entire staff ","useful":0,"cool":0},"Nht0hXDQAeh-oMSYAZCmiQ":{"text":"The hotel's cancellation policy notwithstanding, we received sad news from our vet that ou","useful":1,"cool":0},"qlQSc8qH7oDFXtRixQJ6iQ":{"text":"Staying at the Hotel Monteleone is a great way to\nexperience New Orleans. Having just unde","useful":0,"cool":0},"Lmfk0V0DCw3uZsnLiLI-hw":{"text":"We had a great stay here. We were in town for a big group club trip. Most of us were on th","useful":0,"cool":0},"6cNYPtwsqMV_CO5-T6sfDQ":{"text":"Beautiful place, excellent location, well kept rooms that don't dazzle but do satisfy.  Th","useful":1,"cool":0},"X6WJdT1At5Yv0HwOLnOWJw":{"text":"Supposed to be a 4 star but its more of a 3... For Nola tho maybe its a 4. Right in the Fr","useful":0,"cool":1},"j-wDCUTquPD7ubIDeW2hzg":{"text":"My husband and I have stayed here 6 times in the past 2 years, we absolutely love the Mont","useful":0,"cool":0},"MJhKf1QVkZCdJZbB6Xalyg":{"text":"I've stayed in the Monteleone probably about half a dozen times over the past decade, and ","useful":2,"cool":0},"BxFBFjl_213Tt9Td4RQtLw":{"text":"Great location in the middle of all the restaurants, antique stores, and art galleries. Cl","useful":2,"cool":0},"khR9FnDxPTVsj8KCie-daA":{"text":"Fabulous! Fabulous! Fabulous!!!! We just stayed there and everything was...FABULOUS! From ","useful":0,"cool":0},"csEdM1nAQn7fEK0DI8Uxgw":{"text":"I stayed here a couple of nights on my last trip to NOLA.  I liked the old school feel of ","useful":3,"cool":0},"s_Qi17rpguCynbBpHW5SOQ":{"text":"Classy classy place.  Rooms on the smaller side, but clean with prompt and attentive maid ","useful":0,"cool":0},"-20nLJXT4R5KvGjO15ntFw":{"text":"The Carousel Bar may be the best touristy bar I've ever been to. I had the Jambalya, Crawf","useful":0,"cool":0},"p8VyxMPK2yyF6GKwGoZTYA":{"text":"Hotel Monteleone's website photos are deceiving. We are here for a family reunion; were it","useful":2,"cool":0},"1tN4-XIdzQgHbNkm3Ow-3g":{"text":"One of the classier hotels in the French Quarter.  It is a boutique hotel, but it is large","useful":2,"cool":2},"gb5JjHLofn-FRkTDtiF00g":{"text":"Great hotel, great location, great bar, very helpful staff.  Be sure to call in advance if","useful":0,"cool":0},"-Pj_EiHAwYg5vBwGzvZnsA":{"text":"Let me first say I am a local New Orleanian.  My wife and I and friends love to be a touri","useful":1,"cool":0},"h_PVeYpqkq7Lm3OwM6Eapg":{"text":"It looked very nice in the lobby but the rooms were really small. Very dated, in need of a","useful":2,"cool":1},"5FmhxAvAwWK0kk_oGUpS0A":{"text":"The best place to stay in French quarter. Everyone was kind and the rooms were beautiful! ","useful":0,"cool":0},"55BhjkDOVZBp_047FFmuIw":{"text":"This is my first Yelp review, which means I've been particularly inspired.  I recently tra","useful":0,"cool":0},"zjiUzzDiGyejJS4_1WF8RA":{"text":"We stayed here for our 1st anniversary. This was a beautiful hotel in the safe part of the","useful":0,"cool":0},"YUMmiOg0IR4-j3-5sZGPFQ":{"text":"Loved the location, carousel bar, comfy bed and friendliness of the staff here at Monteleo","useful":1,"cool":0},"7MBq6B_d5wY6zWlggO0z7w":{"text":"Wonderful hotel with great service.  The location is close enough to Bourbon Street to wal","useful":0,"cool":0},"vht8zmTDk5lWrqXG0vobzw":{"text":"Although I'm a local and I live a mile from the hotel I spent the last 3 nights here. My b","useful":3,"cool":3},"o-cyC9cdcmNz1WZllS85Dw":{"text":"A mixed bag.  Location is great, bar is good, rooftop pool is nice, etc.  But the rooms ar","useful":1,"cool":0},"9ERFFhKYKPaqgmPqef069w":{"text":"Classic American hotel. Why stay in a steel and glass box when you can experience a hotel ","useful":0,"cool":0},"U0vedMFw9ZU8ETOCrhtRYw":{"text":"Went to the Monteleone back in May for my dads 60th. We all had a great time and love New ","useful":0,"cool":1},"JZJZoQ_IZMuElnM5l_S_FA":{"text":"On top of being on Royal Street, Hotel Monteleone is also sporting one of the most famous,","useful":2,"cool":3},"fV6NF8T2_5ACSZDQDieFtA":{"text":"Now this place has class. It is absolutely beautiful. Great location in the French Quarter","useful":0,"cool":0},"JFS71rgg9oI9kD_XOGJyAQ":{"text":"Location, location, location.\n\nWe've stayed in a variety of New Orleans hotels - top end a","useful":3,"cool":1},"0zugmi8EjZFTH4xbGvKmOg":{"text":"Nice place to stay in the Quarter. 3rd floor facing another building, meant not much stree","useful":0,"cool":0},"NO7rf6ub2HiH3D_5WGKkXg":{"text":"I'm overall happy with my stay. Even though the room and bathroom were tight quarters the ","useful":0,"cool":0},"66SQiSSOqfZYWHRwqYpeoQ":{"text":"I had such a great experience here and wouldn't hesitate to stay there again and recommend","useful":0,"cool":0},"C35-wsTmrCwMUhKK_tdt8Q":{"text":"We booked the hotel with much intention based on location and past visits.  What we got th","useful":0,"cool":0},"uuctQz3eySXV5zUaw8nMYA":{"text":"Great location. Carousel Bar is fun. Staff is super helpful and friendly. \n\nHowever, the r","useful":0,"cool":0},"4m2qdchDStT-efNZY6037w":{"text":"My stay here was due to not wanting to drive around and be right in French Quarter from th","useful":0,"cool":0},"1nokWIH_XuxC24rCwPAP6w":{"text":"The Hotel Monteleone is a true New Orleans gem!  I was in town for a wedding and this was ","useful":3,"cool":0},"gohoaGN8V-nDQBz3muydgA":{"text":"Super nice French Quarter hotel that will not disappoint.  They have the famous rotating b","useful":0,"cool":0},"vuDjlnEFVOnZUOJNInMtyw":{"text":"There are no words to describe this hotel! It is beyond beautiful, and they treat you amaz","useful":0,"cool":0},"P87eObc2eF9reAPwFZw0oA":{"text":"Elevators smelled like vomit, someone smoking dope on my floor without hotel staff address","useful":2,"cool":0},"B9cqr6SSaBN97uzxeV0g0w":{"text":"This is a frustrating review for me to write. I stayed at the Monteleone Sunday night Apri","useful":1,"cool":0},"8bF0txiAda54l3whG86J4Q":{"text":"So so so loud. Despite white noise, we heard street noise all Igor long on the 3rd floor.","useful":0,"cool":0},"NQFyBwVODPGfpW-nc9Gbmw":{"text":"Fabulous.  Rooms were small but normal for an older hotel.  It was obvious that they try t","useful":0,"cool":0},"XvE-qkVd1WBHoOJGi-y4TA":{"text":"Beautiful hotel!  The carousel bar was usually full during our stay but if you can get a s","useful":0,"cool":0},"_BGmncA9fWkE_6mWc6Oq_g":{"text":"\"Cry emoji's\" like 50 of them!\n\nI have a decision to make now.\n\nMimosas and beignets (real","useful":0,"cool":0},"Lo52WFxVxEZduc6IeDYixg":{"text":"I can't say enough good things about this place. The staff is warm and accommodating. Room","useful":0,"cool":0},"_7_sr6_f0MuER863Sz_RXA":{"text":"Mrs and I were seated at a 2 top in the bar ... server was generally attentive ... Gin and","useful":0,"cool":0},"hzSR3CvfjcofInfphHMzvQ":{"text":"I've stayed at Hotel Monteleone a number of times. Unfortunately this current experience i","useful":4,"cool":0},"cqfMfnfgIgANXTzIpqUjsQ":{"text":"I didn't stay in this hotel, just used the convention space and the bar so this is a revie","useful":1,"cool":0},"z4WU2AVBwbGkOt_ZBTmDVQ":{"text":"BED BUGS!\nWe were unlucky enough to not notice the pests until our last day. Stay away!","useful":8,"cool":1},"hsMFYjDJB-dLO_rDxzZoug":{"text":"Great place in the heart of the French Quarter, but they TOTALLY tried to mislead us when ","useful":13,"cool":5},"AqYFKubi-Vjgvq4hoLZKiA":{"text":"I wanted to stay at a place that had character while in NOLA and this hotel fit the bill. ","useful":6,"cool":0},"ZB80lZNhbKxABciDvP9cgQ":{"text":"I did not stay here. I have been here twice before to go to the bar. I love this hotel so ","useful":8,"cool":4},"5IfVaWeUx_HCV3dhRfpxoA":{"text":"As always, we had fantastic stay at the Hotel Monteleone! The hotel is gorgeous on the ins","useful":0,"cool":0},"9Sl28UHb-7LtEL5AAVRGmA":{"text":"I honestly wanted to give the Monteleone a much better review, but I just can't bring myse","useful":5,"cool":2},"g90QM-vzyAjj9LCBja3wFQ":{"text":"The staff were just okay this time around as we had stayed their a few times before, howev","useful":1,"cool":0},"2Ut9SEHiqUUa0I0HtzegbA":{"text":"Great atmosphere, especially at Criolle. Loved the spa and service was excellent. Parking ","useful":0,"cool":0},"JUg7H4k84g35hT0oM_xOmw":{"text":"I got to stay here last fall while I was in town for a wedding. I was really impressed wit","useful":1,"cool":1},"ziWcyYz9h1SmWiAmTEc5Lw":{"text":"It started off as a horrible experience.  Had to endure a group of grown adults acting lik","useful":0,"cool":0},"Qom7MyME8J0o2vaOfRtn5A":{"text":"Rotating bar and excellent classic feel.  The ramos gin fiz was like a stomach  soothing m","useful":0,"cool":0},"F2zUULXM-UFgVxLSs1dByQ":{"text":"This review is regarding your government rate listed on your website. Please update your w","useful":0,"cool":0},"v_JW7Ya-OmKQOs5cjQ-vBg":{"text":"We really really loved our stay at this hotel.   People were so friendly and helpful, just","useful":0,"cool":0},"2ZYUzkzy_f2EJkHetiG_yA":{"text":"We stayed with a group of six and we had three rooms. The rooms are not clean or well kept","useful":2,"cool":2},"Xo7UsJ-wVmPjiKfhROu1nw":{"text":"There are many hotels in New Orleans to stay at. But if you want to stay at a hotel that o","useful":2,"cool":0},"MVFWFPGpbcxSt1hs4NHWHw":{"text":"Make sure not to park your car at the Solaris Garage, which is a part of the hotel.  The v","useful":3,"cool":1},"3C4N7sFJ-Wu7RS4M0FKPWQ":{"text":"Excellent hotel just a block off of Bourbon Street, though you wouldn't really know it fro","useful":0,"cool":1},"sm1hl4MMrR_PHvryPz8u8g":{"text":"Great atmosphere, interesting decor and paintings. The carousel gets crowded so prepare to","useful":1,"cool":1},"0HGVWlDHdkJaIJVi01rTfQ":{"text":"What a great historical hotel. Very clean and the staff shows you the best hospitality. Th","useful":0,"cool":0},"54HybU_qQljeKjQb4JY-mw":{"text":"My review is not for the hotel itself but for the valet parking garage. Went to have dinne","useful":0,"cool":0},"Lvm1APKrzpsOCbj2douaDQ":{"text":"The only plus side about this hotel is the central location, other than that I would never","useful":1,"cool":0},"5G9PvYeIiJp5N6fruxmkjQ":{"text":"We stayed here February 4-7, 2016.  This is the perfect hotel for an upscale stay during M","useful":1,"cool":0},"x5OyweuwST5PDoMewMLDnA":{"text":"What a classy place! Attended a conference recently and had the best service in a hotel in","useful":0,"cool":0},"r0ooFimCtRpyiKZmkmjP5g":{"text":"The hotel is in an excellent location. The carousel bar is charming but don't expect to ge","useful":0,"cool":0},"I34RRH9US5q6IM_qeG2wzA":{"text":"The best part about this hotel is the restaurant Criollo. Best meal in The French Quarter.","useful":1,"cool":0},"OsB_aUQRpzHT9W16nx1Cbg":{"text":"Best overall hotel in the French quarter.  Amazing service, tons of character in the archi","useful":0,"cool":0},"hZlehHI-cO175ZEdOtRlVg":{"text":"Stayed three nights at Hotel Monteleone in late January on a trip to New Orleans. It is in","useful":0,"cool":0},"LCCTH6rXijpDmeYFNoqMYQ":{"text":"I have been to NOLA 4 more times since my last review and have stayed at the hotel Provinc","useful":0,"cool":0},"jb1Rc4zWqumaI8Rw1mvgZg":{"text":"Classic hotel w/ great bar and interesting details. Front desk was great. Rooms are not am","useful":0,"cool":0},"cJu7EnOK0nlRLhAtai8ThQ":{"text":"I'm a creature of habit. I have been coming to New Orleans for over 25 years and stay at t","useful":3,"cool":0},"FiqpUMPja6t6HPADWtg3qA":{"text":"I simply can not say enough about this hotel! As we arrived Darrin was kind enough to hand","useful":0,"cool":0},"HSGScKI30dykLZzjrUuXbA":{"text":"Great hotel right in the heart of the French Quarter.  The room was clean and well maintai","useful":0,"cool":0},"K3FUmsxf7cmeukHyaqdEBg":{"text":"This is a lovely hotel. It's charming & historical & located within walking distance of al","useful":1,"cool":0},"khi3zIj6NyWYOx2dp-1YBA":{"text":"NOT A PET FRIENDLY HOTEL. The ONLY reason I chose to stay here was to have a New Orleans e","useful":1,"cool":0},"5VruKR-BGUHjRQquIzH9iw":{"text":"This was a 5-star review that, sadly, had to be downgraded. (You can see the original belo","useful":0,"cool":0},"DKdez088JcimHFITrxLrQA":{"text":"This hotel is a wonderful place to stay when you come to New Orleans because it has so man","useful":0,"cool":0},"SL7Lv0z27Sl8YcBbXPfrlg":{"text":"A New Orleans landmark.  A beautiful hotel with exceptionally friendly service.\n\nThe room ","useful":1,"cool":0},"rE3YQ4Q9499hwynUucCMfQ":{"text":"I love a good, historical hotel. I had wanted to stay at The Monteleone for years, but it ","useful":0,"cool":0},"21F5gpLk3ANLR1ihEGRMSw":{"text":"Was so looking forward to four great days in New Orleans. Was very disappointed with Monte","useful":0,"cool":0},"zP-tAu3-Mui8s0YPAUBoCw":{"text":"Stayed here in August with a few girls pre-bachelorette crowd. Location could not  be bett","useful":2,"cool":2},"jOnsR_Jp-jBdBFRiFiIW_A":{"text":"Lovely classic non-chain hotel. Gracious welcome at door. Lively crystal chandelier ed lob","useful":0,"cool":0},"QhC9_fl1j_wD3h-bnicOyw":{"text":"My husband and I visited New Orleans, and stayed here for 2 days. The staff was courteous,","useful":1,"cool":1},"z6t0zQrHrxhS_tWWXP6dwg":{"text":"I had a great stay here. This is a really cool old hotel and at one time was the tallest b","useful":8,"cool":6},"SB-Vrj3-Iwjlt_pKqWtwFQ":{"text":"We will never be back.  We are currently here for a conference and are regretting not maki","useful":9,"cool":0},"KsbbhpHvqtJ-sclvsA_oMA":{"text":"The outside of the building itself is beautiful.  The Carousel Bar is beautiful.  The room","useful":0,"cool":0},"8zo9o6EdAmCUdQfspGFPsw":{"text":"Excellent service! Southern hospitality at it's best. Fantastic location in the heart of t","useful":0,"cool":0},"48QrhEGx9IdJjLQI5HON1g":{"text":"The hotel quoted different price on booking and then charged more than 200$ a night what a","useful":0,"cool":0},"Q3rqbSiSOP2ZDCcJUeU3AQ":{"text":"Walls are paper thin; everything anyone does in any adjoining room will be heard.  Even co","useful":1,"cool":0},"KG1d4nNt2Hd2_Q8r3cp2gw":{"text":"Easily the most notable hotel in the French Quarter! I had a coworker who suggested it to ","useful":3,"cool":3},"PJWlchZNg-50K7D4LmZtTg":{"text":"Booked two king rooms. Both rooms did not have any windows. Asked for windows and was sent","useful":0,"cool":0},"aRe94o2uD4aY-eqbAl-nLg":{"text":"This \"luxury\" hotel is overpriced and in desperate need of a major renovation.  The photos","useful":1,"cool":0},"rel2FwchtQjMwad6D69Prw":{"text":"I didn't stay there but go visit because of the family name. They are distantly related as","useful":0,"cool":0},"kaoSyHEgIGQCeQUQWpUQYg":{"text":"When you're standing at a crowded bar trying to buy a round of drinks, and the bar keeps m","useful":0,"cool":0},"_76wEhK5PDSdhLYtnq7W3w":{"text":"We stay at the Monteleone about once or twice a year b/c it's centrally located. The last ","useful":1,"cool":0},"DT-uHpwuCTcqEXHV7KHaSw":{"text":"Hotel Monteleone is a gorgeous hotel at the Canal Street end of Toulouse, right in all the","useful":0,"cool":0},"NhiscO9rivKoOaIHZH_0wA":{"text":"Elegant, yet comfortable and welcoming.  The staff was very friendly and efficient.  The C","useful":1,"cool":0},"wFqdYg3fUMOzZUEZbrDbmg":{"text":"If I could give zero stars I would. Totally over rated- terribly clueless receptionist and","useful":2,"cool":0},"sH__WklPfjFQSIsLN1jVng":{"text":"What a lovely experience. \n\nWe were celebrating an anniversary and the hotel went above an","useful":1,"cool":1},"vcSjzvqVYuXUVaYPaXr94Q":{"text":"Stayed at the hotel for 3 nights with gf and family. One of us had a room facing a side st","useful":1,"cool":0},"weAPN7qT5u4oppbkdzfhrA":{"text":"Over 100 years old, this hotel is nicely located in the Quarter. Very helpful staff. The r","useful":1,"cool":1},"LeOol1uRabbrB25E_lBy-Q":{"text":"Firendly service but rooms are quite small. Very busy.  Good French Quarter location","useful":1,"cool":0},"EAuRFfqqptXjg0UM_uyn7Q":{"text":"All the locals sound and act like Matthew McConaughey to me.  Monteleone is old, clean, ce","useful":1,"cool":0},"q1CVmMozseqsUlMMGqzY8Q":{"text":"I had previously visited New Orleans with an okay experience. This time it was wonderful!!","useful":2,"cool":0},"N7Ym94yOmqqD-P6quo1z7w":{"text":"My son and I stayed last week and had a wonderful first experience!  Room on the 15th floo","useful":0,"cool":0},"TTQMf3KzlKYbiWX3_YP46A":{"text":"We had a great stay! Hotel is absolutely beautiful!!! We stayed for 2 nights, room was cle","useful":0,"cool":0},"e51LZCNYN_y4T733KWgWeA":{"text":"While the hotel is in a great location (one block away from Bourbon, but far enough away t","useful":2,"cool":1},"B8ckjOp0Aws9kJp7fGEJQw":{"text":"I really enjoyed my stay at This hotel. As one of the last family owned hotels in the Fren","useful":1,"cool":1},"ppqIqNn5cIvfYgwL_Myvzg":{"text":"This is a great hotel. Amazing staff, and lounge. Rooms and amenities are superb. Every st","useful":0,"cool":0},"moeWh6zx6TDQkH6loT1lQQ":{"text":"This hotel is absolutely exquisite. Very old Hollywood glam and the Christmas decorations ","useful":0,"cool":0},"wkza4BplCYJG3ZT31Op-ng":{"text":"I phoned the concierge moments ago cheerfully explaining we have a reservation at the hote","useful":0,"cool":0},"BTI_7T9iIxet5GkmKGPyLg":{"text":"Stayed here and it is a grand hotel. We have always wanted to stay here and got the chance","useful":0,"cool":0},"CfuKI7LIgM0Iv8v8m-wXvw":{"text":"I had a bad customer service experience here. As a hotel guest, I tried to order a pot of ","useful":0,"cool":0},"n6EeGfYu23Zh_bOOqUSUrw":{"text":"Allergies awful. Staff worthless. No seating in bar for 5 days. Couldn't get bags up. It w","useful":0,"cool":0},"5qPvzmbQoojp9DFqfjGaaQ":{"text":"I will always have a soft spot in my heart for Hotel Monteleone. My husband and I eloped t","useful":0,"cool":1},"x3i4-cdRs1KTKMIVmUt6dQ":{"text":"It's been one year since I stayed at this hotel and my previous visit was not the best. Th","useful":3,"cool":2},"jvYRhxxFR9l8ztcYR67a_g":{"text":"This was not the experience I expected from the Hotel Monteleone. I stay here when I come ","useful":3,"cool":1},"6UyIBg7tUC3_3jA5IGYPpw":{"text":"Had a lovely stay recently for our 25th anniversary. We asked for a very nice regular room","useful":0,"cool":0},"525HXDbLsJII0y9VkMhFUQ":{"text":"I have now stayed in this great hotel about six or seven times.  The reason I keep coming ","useful":0,"cool":0},"0uWSI0wW6AJszPbtQhYM4A":{"text":"While Hotel Monteleone might have iffy reviews, I had an excellent stay. My boyfriend and ","useful":3,"cool":0},"WFHDch8zidurDUiw7p2Sig":{"text":"First, I don't know why I gave this hotle 4 stars instead of 5 because we had a nice time ","useful":1,"cool":0},"ruqoKfB19CDF0jtMkxLkGg":{"text":"The stay at this hotel was the perfect touch to our New Orleans experience.  The crew was ","useful":0,"cool":0},"yzp_f9ePiOtTjMJrhD-dlg":{"text":"Fast check in- everyone very nice!! The carousel bar is tremendous!!!","useful":0,"cool":0},"6-yyyPCVGdXO2n-80RUymg":{"text":"The Carousel Bar!  That's the primary reason to visit.  It's a one of a kind experience.  ","useful":1,"cool":1},"TolMsI0uEbGWW_jT2VQLdA":{"text":"We really enjoyed our stay here. The hotel is quite classy and classic and the hotel staff","useful":4,"cool":1},"-wFC6LcrqFzzO3wsW1sC7g":{"text":"My second time here.  I wouldn't stay anywhere else on the French Quarter. This place is r","useful":0,"cool":0},"WRRxiCSbNi8gTalD8AvdyQ":{"text":"Such an amazing atmosphere! The drinks were great, and unique. Sean, at the carousel Bar w","useful":0,"cool":0},"71r-svK9qqQ9_vNZew4gbQ":{"text":"Excellent restaurant, the breakfast is awesome!  Nice, very clean rooms with spacious bath","useful":0,"cool":0},"0oOS582U6eFv18Bep1rgFA":{"text":"Our stay here a couple of weeks ago was totally heavenly. From the fantastic service we re","useful":1,"cool":0},"EFbcorgcFwEsczRUzBWNLQ":{"text":"So me and my best fiend stayed there three years ago so we missed our flight from Miami to","useful":0,"cool":0},"iaAiiGJoJ9c1v2PqOIEmYg":{"text":"This is a nice hotel in the middle of the French Quarter. Its beautifully decorated and ha","useful":2,"cool":0},"NFzIKCFrORYfVkZ4e9alHg":{"text":"Our stay here was wonderful.  The staff was very pleasant and helpful, especially Nolan, t","useful":0,"cool":0},"PQ-w_Zqq99gzMjcF71SHHA":{"text":"Classy and Old New Orleans kind of ambiance. The feel and the service provided at the hote","useful":2,"cool":0},"7TJmMkX7mJ0KPQ518gnXhQ":{"text":"Can't imagine a better place to stay in New Orleans.  Carousel Bar was good enough for Fau","useful":1,"cool":0},"T3nZeDCimBzZ6ajQEQbKDg":{"text":"There are a lot of things to like about this place, but ultimately I am not sure if I woul","useful":0,"cool":0},"XypI7FSOdy6qHpeBtdTTpg":{"text":"Didn't stay in the hotel but went there for drinks at the Carousel Bar. Service was swift ","useful":0,"cool":0},"GN7oyllzES9A6nhUlBsyrg":{"text":"I am feeling deep appreciation for this hotel.  I have heard that first hand that, during ","useful":0,"cool":0},"DXCeAVSl4yJp6FkXjCCuWg":{"text":"It's in a nice spot. $30 for parking/day is quite a bit but the hotel is close to everythi","useful":1,"cool":0},"ZwP5N2Q44xeGoVlJkoChKQ":{"text":"It's an old hotel therefor the bathrooms are tiny and you can hear everything your neighbo","useful":6,"cool":5},"E66Zm13HoRagKxGrvDP7vA":{"text":"What can I say about this beautiful hotel! The service is amazing, the beds are super comf","useful":0,"cool":0},"NvH0JtQXuWz3rvrEoCbwWg":{"text":"We paid close to 1000 dollars for a suite for one night. Arrived around 4 pm, concierge to","useful":1,"cool":0},"KMoVALLvEMbFplcPHm30Tw":{"text":"On a recent trip to the French Quarter, we stayed at Hotel Monteleone. I knew of it throug","useful":0,"cool":0},"8C41G1dE9lSSv8FX_8AZlQ":{"text":"Beautiful hotel nestled in the French Quarter with easy access to Canal Street and away fr","useful":0,"cool":0},"vGdbqZA5UXog1qwaEViU5g":{"text":"Charming hotel in a great location. The carousel bar is fun but always crowded so if you'd","useful":1,"cool":1},"hq6BXD0zN-ek0lfXDYT8mQ":{"text":"I have such conflicting feelings about the Hotel Monteleone, which I stayed at for a week-","useful":5,"cool":1},"tN0-7WoXQAo3riARDRlO7Q":{"text":"They don't let guests use the lobby restroom . It's not out of order , come on man ! You c","useful":0,"cool":0},"s6D0sXDxBRvKd813zMFHqg":{"text":"Hotel Monteleone has a great carousel bar that captures New Orleans.  Bartenders jump over","useful":0,"cool":0},"iUH3Xml3pmDaCDTJ5dliOQ":{"text":"I can't put enough superlatives on the Hotel Monteleone. Of course it was clean and comfor","useful":0,"cool":0},"1hirT_-a4cHOMPUEIPl3rw":{"text":"Beautiful historic hotel that engulfs you with New Orleans traditions. A block from\nBourbo","useful":0,"cool":0},"HKsFxc1uDSwuAoX6hjJqcA":{"text":"Beautiful, historic and supposedly haunted hotel in the middle of the French Quarter. Exce","useful":26,"cool":20},"MOV2JSrK8qpVoWdqEhoKWA":{"text":"We stayed at this hotel for a conference so we were able to get really good conference rat","useful":0,"cool":0},"6LMBAxl4vUX8_D_BBqnxag":{"text":"Awesome!! That's all I can say about our stay here. What a beautiful hotel! They let us ch","useful":0,"cool":0},"_oXAcCB83N89jLL1vCY05Q":{"text":"Such a cute lounge/bar area! There is a 25- seat carousel bar here! You have to COME EARLY","useful":3,"cool":1},"MfY80Rr6oCpNKEsBRUuVNQ":{"text":"Every single thing about this Hotel is perfection.  The staff, the doormen, the valet crew","useful":0,"cool":0},"sydbvOMCYuCmw7P0HTS0dg":{"text":"Stayed at this hotel in early December for 3 nights.  Our stay was very pleasant.  This ho","useful":3,"cool":4},"AZJWqKlQl0OgLfU7u_TJqQ":{"text":"We stayed two nights in this hotel in January for our first trip to the New Orleans French","useful":5,"cool":2},"AdmJo3_cTwu1lSCC4hT1jg":{"text":"We had quite the experience at Hotel Monteleone.  We loved the central location and the gr","useful":2,"cool":0},"iGX6VPMbhYN2bprd7sRyVQ":{"text":"Nice hotel with old world charm. Very convenient. Friendly staff. Would definitely stay he","useful":0,"cool":0},"dpSj9KC3aLYmKxGzRLQakw":{"text":"Definitely would go back. Centrally located, plus much more.  First, some tips. Take the c","useful":0,"cool":0},"T8oTwyCdgmepg6wVKwS4ug":{"text":"The staff is friendly, but this hotel is coasting on its reputation. Charges were added fo","useful":0,"cool":0},"bnEopFWPTTuH8cLqhdddag":{"text":"Update: After my complaint, the hotel called me and personally apologized for my experienc","useful":0,"cool":0},"JVLfrj0pLhP-d3gPpc5m6g":{"text":"We've stayed at the Monteleone many times, but the experience has really declined.  We vis","useful":0,"cool":0},"cgSpBdmbIP0Jee17s30QgA":{"text":"Loved this hotel!!! From the moment we got out of our car, a worker greeted us and took ou","useful":1,"cool":0},"jI6YOA-f9NzDGJF1FcMeuQ":{"text":"The rooms are clean but relatively small for what one would expect to be a luxury hotel. T","useful":1,"cool":1},"S_416bA9R8UZGL1wPVadoA":{"text":"Nice in-room amenities. They handled valet parking and luggage well. They even store your ","useful":0,"cool":0},"o03QO8OPsWL4CPvZ4Ize3g":{"text":"Staying at the beautiful Hotel Monteleone, the bar food stinks. Don't come here for the po","useful":1,"cool":0},"3owaBQ9Bvo-kRFX1Z5huoA":{"text":"I've been staying at this hotel since the 80s. As far as I'm concerned the most luxurious ","useful":5,"cool":5},"0vI2lgAHhCxhUDXchCCxnw":{"text":"Actually a nice dig ,but... \nRoom service food didn't taste good\nSuite was overpriced. \nPo","useful":1,"cool":0},"_65HVM108rk8rnkS_zk4BQ":{"text":"I had seen this hotel on a ghost tour a few years ago and I'd decided that I'd stay here i","useful":11,"cool":8},"GLVHq3p4h8E9gd_4qw8iVg":{"text":"Last Thursday, I, along with a couple of friends, visited the Carousel Bar Lounge to see t","useful":0,"cool":0},"BsSeAo4O4OezNKqI9tQO_A":{"text":"We absolutely loved our stay. Friendly staff, great food, and nice room. We have to come b","useful":0,"cool":0},"Iz-9kO8hGpmdrEf22KzH0Q":{"text":"Gorgeous hotel.  I always stop in when I visit New Orleans.  I'd love to stay there, but t","useful":1,"cool":0},"7VcQNEBTt1p20ng8urQ1ag":{"text":"An American classic!\n\nMy rooms here have always been fresh, clean, and bright, and the gue","useful":4,"cool":3},"YeHu8TsCas6mS22BqmlapA":{"text":"There's something so novel about a rotating, carousel-like bar that my friend and I came h","useful":4,"cool":1},"C7I3_IqWYqeDXn6pkzCB9Q":{"text":"One of the classic French Quarter hotels in New Orleans. The Monteleone is near everything","useful":0,"cool":0},"-JkDUJn1McevtadkpgY4Ig":{"text":"I was here in April and staff cutbacks were in place so take that in to account. The atmos","useful":0,"cool":0},"RMvXNPVpx8SRMiM-AVwgiw":{"text":"Cute boutique hotel right in the middle of everything New Orleans. Walking distance to foo","useful":1,"cool":0},"dErgtqcXaY7brbWmxK92QQ":{"text":"My husband and I had such an amazing experience at this hotel.  \nIt was close to all the a","useful":0,"cool":0},"fagmn_MpxQuWkDr4HshpEA":{"text":"It is a lovely hotel.  Everyone has been so kind and accommodating.  The carousel bar is w","useful":0,"cool":0},"ILA0G7PcyE2RBBMrzdUfBQ":{"text":"My friend and I recently stayed here for Labor Day weekend, the hotel is just okay in my p","useful":1,"cool":0},"fP0FB3PY-KCr7JNCE8CZIQ":{"text":"A beautiful hotel in the French quarters of New Orleans. High level of very friendly servi","useful":1,"cool":0},"2xoVLghzL6jdQYWJ04jAJQ":{"text":"New Orleans? The Big Easy! \n\nI have been to this town a few times and it is not just about","useful":31,"cool":28},"-ozHUFQJr-DTxXwwJ7rWIw":{"text":"Found this to be where dreams of being rich may start...sooooooooo I will let you know whe","useful":1,"cool":1},"7hloGB_J8WjNFIG1mXlW0w":{"text":"Let's go ahead and the negative out of the way.  The rooms are smallish, remember this is ","useful":1,"cool":0},"4xaU-CenK2HxtNb4-s4uPA":{"text":"This is a tough review for me to write, to be honest.   Hotel Monteleone is certainly not ","useful":1,"cool":0},"j1HdgpARht5xSaslCHG_XQ":{"text":"We were very disappointed overall. Upon a 4pm arrival and a long day of traveling, we had ","useful":4,"cool":1},"bIYOlWN1amMeAH-UoWLKYA":{"text":"Packed with fun and good strong drinks.  We had a good time once we found a table.  The ba","useful":0,"cool":0},"4ftO7EONBqZBHitVZVQVXw":{"text":"Stay for the history and location within the French Quarter, but don't park your car there","useful":0,"cool":0},"0369CFJEKsRq1Or4d-kQAw":{"text":"We were going to be in New Orleans for a couple of nights and my goal was to stay in an ol","useful":8,"cool":3},"USmGnl1GDbaVomZb8W8n3Q":{"text":"We're currently stranded at this hotel now after staying at the amazing Royal Sonesta!  We","useful":5,"cool":0},"YnuPijm5x8uguv1NIqagIA":{"text":"Everything about our stay at Hotel Monteleone was outstanding! All the staff were friendly","useful":0,"cool":0},"xPZW-PL_LFPwHdbFoQUDxw":{"text":"This hotel is nestled among the high-end antique stores on Royal Street, one block over fr","useful":1,"cool":1},"abj-MZ6OcS5nBVgk9wOEQg":{"text":"This hotel is great for the Carousel Bar and the rooms are cool. The bar HOWEVER, this is ","useful":1,"cool":0},"dxqR3lGFPuNQGZPZ4qpDIg":{"text":"I spent only one night here at this beautiful hotel but plan to stay again the next time I","useful":1,"cool":0},"w-rPVka9VQXQrnibdtKWkg":{"text":"The absolute worst service ever.  Failed at every step of the way, particularly with valet","useful":4,"cool":1},"WZTEY6VnLl9tOavpJREEJg":{"text":"I didn't stay in this hotel, but I did visit for their spa (my hotel didn't have one). Thi","useful":0,"cool":0},"jV9pMVH7PkXFIzGF0Al8vA":{"text":"Getting here on a Saturday night was a disaster and we were directed to pull around to a d","useful":1,"cool":0},"BvQ1VDnGOapYu6t_uYCEgw":{"text":"A great place to step back into the past of this wonderful, friendly city. The rooms are i","useful":0,"cool":0},"VrSC-Omq2y5sZECWrbxVgg":{"text":"Don't even think about stopping there keep going the service is horrible stone with the va","useful":0,"cool":0},"JkwPZGRp4EgDKQ4Cco_Fzw":{"text":"This is a lovely hotel. \n\nIt was my first time staying here and the location is perfect - ","useful":4,"cool":5},"w62dErFIuZGIFX53158CZA":{"text":"I stayed here on a cross country trip. The staff is AMAZING and really care about your sta","useful":1,"cool":0},"ggRmHb9f0evSXLFEo9_g3Q":{"text":"When we arrived to the hotel at approximately 7:00 pm, we were greeted by the bellman and ","useful":0,"cool":0},"h3f_HjLnDoOOuKTwlt32Aw":{"text":"The carousel bar is a must! Has some charm and appeal you won't be able to find elsewhere.","useful":2,"cool":3},"Ib4iE6GRBk_DqEsicoaCjw":{"text":"I had the good fortune to be able to stay here for four nights around Thanksgiving. While ","useful":1,"cool":1},"Wm4VHr4IQjMJKilmhrRgCQ":{"text":"I may still consider staying at this hotel in the future, however would not stay in a two-","useful":2,"cool":1},"PZfzakYmjSBxIVJ2NBgD5A":{"text":"An old hotel, but really beautiful. The lobby is stunning.","useful":0,"cool":0},"PblwE3qG0kR7EqVUk-3yCg":{"text":"For a historic hotel the place was okay but nothing great.  I stayed here for 3 nights wit","useful":0,"cool":1},"yVCXh4swFB1QwFz7yx8rIA":{"text":"Hello. I'm staying in room 382. I brought my dog  that I rescued about 6 years ago. My par","useful":1,"cool":0},"HUPEzKyCQq8zLxa2JxeOAA":{"text":"LOVE aesthetics of hotel... not feeling Catherine-at-the-front-desk...\n \nI am here for 8 d","useful":2,"cool":0},"PARfNNc-6ti5quCaiXDaeQ":{"text":"Randy the Concierge was more than helpful providing transportation for my friends and I.\n\n","useful":0,"cool":0},"6rlCmZ-nxuttEgpTstIvkg":{"text":"Well , big disappointment at the Hotel Monteleone Restaurant ... we were there at 10:17 ..","useful":1,"cool":0},"Q2SDKQ-heDSqP2ueI8_o7w":{"text":"Beautiful Historic Hotel.  Sad to witness and experience management defaults.  Front desk ","useful":0,"cool":0},"J3X0Y_VcIZk0AyYy4_AG_w":{"text":"I was looking forward to spending Mardi Gras at what others have acclaimed to be one of th","useful":1,"cool":0},"cuZlT8he815sb4P6z00nBQ":{"text":"We stayed here this past weekend (8/19/12) for a little \"staycation\".  The hotel is in a p","useful":2,"cool":0},"QG3QnF93-VhSx9qLIDg0pg":{"text":"Had drinks in the carousel bar which should have been a pleasure.  The sweet server I had ","useful":2,"cool":0},"14BMjBb1_JU_OWmUcMQVLw":{"text":"Awesome hotel... So nice and the staff is wonderful.  The carousel bar and roof top pool, ","useful":0,"cool":0},"gLw5MHofiszs0jG0hWWkyA":{"text":"Would not stay or recommend this hotel.\nWe are presently here and for the last 2 days our ","useful":2,"cool":0},"TN724nwFr4K7OFHEv0KBlA":{"text":"Location- yes! Beds- no! Three of us stayed here recently and found the place to be good o","useful":0,"cool":0},"QIsxETzL5vzhEg4is8WztQ":{"text":"We really enjoyed our stay at this historic hotel. The old charm and class shines here. Be","useful":0,"cool":1},"dJmP0tDrp1BYwllxONAsFw":{"text":"This is a beautiful hotel in a great location on Royal Street!  Walkable to everything!\nTh","useful":0,"cool":0},"V4lVQNAvDzL8e-UutZk6UA":{"text":"Beautiful historic hotel very close to The French Quarter. A classic. Service is excellent","useful":0,"cool":0},"MK7HvaJeo1f_MfEm7t2uQw":{"text":"A bunch of friends and I stayed here over the weekend for a wedding that we were all in. T","useful":2,"cool":0},"9Uj491ESPwxPYRwNnjAKgw":{"text":"We've stayed here several times and enjoy it every single time.  The rooms are always amaz","useful":0,"cool":0},"wjyr3vPcXDAAVSBCUZmWoA":{"text":"Cons - $40 per day parking -  so two nights / 3 days is $120 plus tax.  Valet wasn't very ","useful":2,"cool":0},"1Ai_bZ5OEVzwmcAf6jak_w":{"text":"Traditional hotel with an excellent restaurant, great service, inviting rooftop pool, and ","useful":0,"cool":0},"9DyIa4GfljNYu7vPCgHFGQ":{"text":"Great hotel and staff, we had a very pleasurable stay.  Easy in and out around the French ","useful":0,"cool":0},"_2T8iTULx9KjAl9RwG_PYQ":{"text":"I have been coming to New Orleans for over 25 years for business and this year I decided t","useful":0,"cool":0},"c9S7NSZP5fTj5SIk-rPqiA":{"text":"In agreement with the other reviews, you can't beat the location within the French Quarter","useful":3,"cool":2},"DW-64hpp9PIfQTEqX-SwHQ":{"text":"Great service! Nolan is a great guy he took care of us hard working an honest best help yo","useful":0,"cool":0},"zudozYsqSUpxP8ruwLNWiQ":{"text":"They have it all figured out.  Everything was terrific.\n\nNo reason to go overboard with de","useful":4,"cool":3},"k_VqzvqcAuSR9Ds5ARtskg":{"text":"Wanted a nice place to stay during covid.  Hotel Monteleone was definitely clean and safe.","useful":0,"cool":0},"s50XNhvVR1FGeGKRotPrxw":{"text":"Parker Davis, Eddie, and Eduardo are my favorite people at the carousel bar, that is curre","useful":0,"cool":0},"eJYdj-eFHHEVR07yF9Kqmg":{"text":"What a beautiful hotel while you're on the French quarter hitting bars and restaurants try","useful":1,"cool":1},"xIjr3Pd-AHPohaf5Gu-vMA":{"text":"My husband and I stayed at Hotel Monteleone for just one night during our honeymoon. We fl","useful":1,"cool":0},"eY6zgawSNuL7DQe66KrPpw":{"text":"Class act all the way. Hands down my favorite place to stay in NOLA.  I must also say one ","useful":1,"cool":1},"vfo9krGZBvINX0YFWtDVBA":{"text":"My wife and I stayed there last week and had a great time.\n\nThe look and charm of this hot","useful":1,"cool":0},"zn1kCxUYW0SZvCpO77D6JA":{"text":"HOW TO \"OWN\" THE BEST HOTEL IN THE CITY:\nI purposely choose my staycation week to score th","useful":14,"cool":13},"hLUvQkFoBraaz8o_XiKkAQ":{"text":"Beautiful and historic hotel that takes you back in time with all the modern amenities.  B","useful":1,"cool":1},"HpSvYfnZeWk_4TF5qD8wPg":{"text":"Fantastic breakfast and Michael was an excellent server. Make sure that you decide to splu","useful":0,"cool":0},"4yxmotWW4un_7GeE_VSpQg":{"text":"I stayed here for a long weekend in October. Friends that I was travelling with recommende","useful":3,"cool":1},"2iDDzGD6QGF9eULPFnb0eA":{"text":"This hotel is a mixed bag, its very old and the rooms are dated and need a refresh, but th","useful":0,"cool":0},"b5YYGfPCg5GhbsU_z3x1BA":{"text":"The goods: the room was comfortable and spacious for a hotel in this price range. The loca","useful":5,"cool":0},"uVol_wkubvbw3x2whlZ8Ug":{"text":"Exceeded our expectations! Every single person who works this hotel is friendly and welcom","useful":1,"cool":1},"CAgQi0eGgL_JIymFYXcRZA":{"text":"Spent a weekend at hotel monteleone in late august. This is my hotel when I stay in New Or","useful":0,"cool":0},"6k2tMJvnqFKyZ4MnfD6-ZA":{"text":"GreaT hotel right I. The heart of the FQ in a very safe area.  And they have one of the co","useful":0,"cool":0},"3l9HD7j5SmBtex970J1FoA":{"text":"We've been to New Orleans many times and have never gotten a seat at the carousel bar...bu","useful":0,"cool":0},"e-18hz4tmZH0YBiX39sMiw":{"text":"We were drawn to the Hotel Monteleone by its fabled history and connection with famous aut","useful":7,"cool":1},"U-PftVsaFyBtDbWyBx63Pw":{"text":"Roof top pool and bar check, amazing Carousel rotating bar check, super comfy bed in quiet","useful":1,"cool":1},"vA8-Qobj7NLJQog9qDsk0w":{"text":"Stayed here for a wedding. Food was good and so was the bar, but our room smelled incredib","useful":1,"cool":0},"YfPNzzf6GJqT9f-Onvys_Q":{"text":"We arrived and didn't care for our room as it had a view of a nasty dumpster and was next ","useful":0,"cool":0},"DymDfcwEB8_SrGXwObYnZQ":{"text":"When I went to book the hotel, we called ahead to ask if there were refrigerators/freezers","useful":0,"cool":0},"Wpi3vnZrhFn2LTAT0cXqvg":{"text":"This review is strictly based on the carousel bar and restroom. With that noted, don't shy","useful":0,"cool":0},"-hKthFqRyKX-n0968WaUNA":{"text":"The lobby always seems packed, but the room floors are quiet and empty.  That's what count","useful":1,"cool":1},"WRaVE0GTXsPR5Sru_zxC6A":{"text":"Not that nice a place, and they have crappy amenities. The rooms look like they  were last","useful":3,"cool":0},"qHtg-UKlAMepLh-1StCIZg":{"text":"Everything was well done at the Grand Dame: clean, convenient, quiet, and close to what wa","useful":0,"cool":0},"w-9MsZ6Fa4re7epBnyP6Ag":{"text":"Everything here makes you feel like royalty. Check in process was very slow (running 2 reg","useful":2,"cool":2},"SFHwUpYmsty3BBNELTc_Ew":{"text":"I loved everything about this hotel.\n\n- the room (although small) was clean, classy, upsca","useful":2,"cool":2},"Xz9jg0IhCeXm1xoo8XTHRg":{"text":"Had an amazing stay over Memorial Day weekend recently. The service was top of the line an","useful":0,"cool":0},"d3GAa57d-E14WyXRESL4AA":{"text":"the staff here is incredibly nice and helpful. the hotel building itself is beautiful. eve","useful":0,"cool":0},"LOhmOgv5YKjliYuPPyXKdA":{"text":"The carousel bar left much to be desired. The drinks were mediocre at best. Our server Rav","useful":0,"cool":0},"kxno68e5oRuFi-BWPmliLw":{"text":"The site of the famous carousel bar, always crowded and fun, but we spent very little time","useful":0,"cool":0},"8JFcC-25AbfZxrc8Qt278w":{"text":"This place has nothing going for it beyond it being old. Unfortunately it doesn't appear t","useful":1,"cool":1},"7sGT8Cx_yUi37Of1-8urPA":{"text":"Monteleone = New Orleans.\n\nWas in New Orleans on a super-crowded weekend and the Monteleon","useful":1,"cool":0},"rYf-4Tozh-ZR4cP6hTGC7w":{"text":"The W was booked so this has aways been one of my favorites before the W came to the city.","useful":2,"cool":0},"hRdtcrpW2fV34ceJjmSQGg":{"text":"Did a staycation and picked The Monteleone this time. Perfect hotel for anyone looking to ","useful":1,"cool":0},"eyAEQh7aF6hEXs21uKL8_A":{"text":"The hotel is soooo close to perfect ! The one catch is the food at Criollo, and room servi","useful":0,"cool":0},"4gXY5N3BLJc5OYoZalvUVg":{"text":"Very nice historic hotel in the French quarter of New Orleans. Beautiful interiors. Nice r","useful":1,"cool":0},"_-p0kRKm5EGWiAsXwud0IQ":{"text":"This hotel was beautiful! The only reason I gave 4 stars was because the bathrooms were a ","useful":1,"cool":0},"jgq3qyO0DJ9MfQotthCFLA":{"text":"WHY A NATIVE CHOSE THE MONTELEONE\nof all the hotels in the city for a 5-day staycation:\n\n1","useful":20,"cool":7},"PW0fN_DsthKXI5kU1JcvuQ":{"text":"Location:\nFirst time in NOLA and my boyfriend and I  picked this place because we wanted t","useful":3,"cool":2},"35VTIgGaN-CF4jIh3qYqIg":{"text":"What can I say about the Hotel Monteleone that hasn't been said b4? \n\nIt's the most beauti","useful":10,"cool":11},"yN62Ut6gv-t9vard6VEftw":{"text":"Stayed for a business trip and the room was amazing! The ghost in our room gave us chocola","useful":0,"cool":0},"yEoYLWYOha-r9gDqrKX41g":{"text":"The hotel is a very busy, centrally located, French Quarter icon. People everywhere, heavy","useful":5,"cool":0},"8LfgbxXU1LOS6WB-DTxzMA":{"text":"I loved this hotel. First time to New Orleans and I was only here for one night for busine","useful":0,"cool":0},"QtU4u75lzV-I7qK-mFBmsg":{"text":"Beautiful hotel, but if you're there to experience the carousel bar, good luck! My best ad","useful":0,"cool":0},"x8-2qEmzQrge4wLzvnmP6A":{"text":"hotel monteleoneWill make this as short as I can . \nWhen we checked in \n\nThe room was ok, ","useful":0,"cool":0},"_rCmaTQg5oNPYfabSz20Zw":{"text":"I'm not going to talk about how much I travel and yada yada, but I have stayed at numerous","useful":1,"cool":0},"OvKrvrhQ4gYvzHe2o65svQ":{"text":"I have never stayed here, but I have entered this place a few times to have a Gin Fizz at ","useful":0,"cool":1},"T-osOTJJUNDq46QQJFNDVQ":{"text":"Best location in French Qtr , 5 star restaurant, 5 star award wining 135 year old carousel","useful":1,"cool":1},"Kxx-P0OLXcWhVUw8fVDe2w":{"text":"Stopped in New Orleans with my mom while moving cross country from Albuquerque, NM to Jack","useful":0,"cool":0},"1xIn-d9DBxYS8UNKdB3wQg":{"text":"We had a great 5 night stay at Hotel Monteleone. Everything was very clean and the staff w","useful":0,"cool":0},"Zj5VgFZ4KoKVJntrj5S6Zw":{"text":"I spent my honeymoon at the Monteleone.  I give 3 stars only because I have a special love","useful":7,"cool":1},"ZvKatX2oF1Fl4R1hM_I4Dw":{"text":"We had cocktails at the bar on our way to a dinner reservation.  The drinks were well done","useful":2,"cool":0},"6Mc-257Gg4lRzbroIXJzMw":{"text":"Beautiful space, carousel bar is a must-do. Fleur de lis was a big hit for cocktails. In t","useful":0,"cool":0},"Xj5y3MASUrU0RHr7RqC6Cw":{"text":"I stayed at the Hotel Monteleone for four nights in January 2014. My stay started off well","useful":2,"cool":0},"XcMBs1B3ds2rvj4KWqSKTA":{"text":"Beautiful, historic hotel. Excellent location. Unique bar.","useful":1,"cool":0},"xZ1-Yx1pb1jzDKknxwsmnw":{"text":"My husband and I couldn't wait to visit NOLA this summer. Yes, we knew it'd be hot but we ","useful":2,"cool":0},"uIm_V1rgU1IJxr8PmgOPxw":{"text":"Prime location. Beautiful hotel in French Quarter, the staff was friendly and extremely he","useful":0,"cool":0},"LOy-qoj2vKhuOi-Fh3LQmA":{"text":"The hotel is always perfect!c!  Our stay every year is never less than what I expect!   Th","useful":0,"cool":0},"V8YOQNrxIWY1TO834LI7QA":{"text":"Beautiful Hotel Montelone must check it pit with the Carousel Bar..wow! So beautiful must ","useful":0,"cool":0},"QepIH-PgkjP0ET5tvicrbQ":{"text":"I stayed a week in this hotel as we celebrated my husband's 66th birthday. New Orleans was","useful":0,"cool":0},"afklHM4_2W27MesZMwBg4w":{"text":"My family originally started with the Truman Capote Suite with a additional room for our s","useful":2,"cool":1},"7SA2s1vfFeoquLY_yDgxOw":{"text":"Hotel Fabulous- so beautiful and in a great location!  The service and food are phenomenal","useful":1,"cool":1},"X7LsxB7KqXwpLXO-X9kQCA":{"text":"My best friend booked us a room for three people for two days ($447) and it had two king s","useful":1,"cool":1},"SnO2-sqsVMcmeWhTnUJtTQ":{"text":"This is one of my favorite places in the south. It is not the nicest hotel in the world (a","useful":0,"cool":0},"0O40ORk7-sPVvF1DsHVjKw":{"text":"I stayed her over the Christmas week and had an enjoyable time in New Orleans for the firs","useful":5,"cool":4},"Ox66N7AxpWfGPEfOgdoG0w":{"text":"My hubs and I booked rooms at the last minute and we are happy we did! The hotel is gorgeo","useful":1,"cool":1},"PbHIdyh3tW8ez5zYYGbKag":{"text":"Staying at Hotel Monteleone.  Beautiful Hotel with old fashion approach to customer servic","useful":0,"cool":0},"W_kc3GvsmjNRazZwOPT7Iw":{"text":"Come for a ride \nRiding and having a cocktail! What!? Yes it's a possibility at the Hotel ","useful":1,"cool":0},"0WbkY_uqPHz-yUKA2xbJTA":{"text":"This hotel is top notch from the moment you walk in the door.  The concierge Blair was ver","useful":0,"cool":0},"asUTCTmGRYl1htaYt2hiiA":{"text":"We checked-in yesterday (12/26) and our \"standard king room\" (Rm #734) was well appointed ","useful":7,"cool":0},"bHJMwcxrRmKbBKkaqxApzA":{"text":"Monteleone is a charming and elegant hotel with superb service. Any request was promptly s","useful":0,"cool":0},"xAoj-xwL7AkpvQpq14t--w":{"text":"We have visited the Carousel Bar every time we have come to New Orleans. This time I got t","useful":0,"cool":0},"9qhtbR0hU68K3qjhupCQ7g":{"text":"I've stayed at this hotel once before for a brief trip, so I was very excited to spend an ","useful":0,"cool":0},"_WcW7tCwH8rWO9fgqjS9QQ":{"text":"It's the high light of my trip to NOLA. Hotel Monteleone is one of the iconic place in NOL","useful":2,"cool":2},"04uAGavTffg9-upAthuHVA":{"text":"Absolutely beautiful hotel. Gorgeous bar, gorgeous lobby, beautiful rooms, excellent servi","useful":3,"cool":2},"eYaCgBW_y2XsDIf26-ew3w":{"text":"We booked the Hotel Monteleone for the great location!  We would DEFINITELY stay at this h","useful":0,"cool":0},"m09FZbdPib1tIITHbqMZWQ":{"text":"This hotel is in a great location.  It's a block off of Bourbon and about two off of Canal","useful":0,"cool":0},"gEaeggndcoLvppfL23wpsw":{"text":"Beautiful hotel, great location. Really has the feeling of old New Orleans. We stayed in a","useful":3,"cool":0},"rSfsUM_EaqMcKzsXTlngBQ":{"text":"You have chosen NOLA (New Orleans, LA) as your vacation destination, you have chosen the f","useful":8,"cool":2},"igcqqoVDgIZ0QiYW2Wlkag":{"text":"The Hotel Monteleone was built in the 1880's and is the oldest privately owned and run hot","useful":1,"cool":2},"uCaxwh5wuviqAx0P6VcgjQ":{"text":"Beautiful hotel in the perfect location to hang out around Bourbon street. The rooms are v","useful":0,"cool":0},"yuAyzzEMHFJZfe4q9I9DXw":{"text":"...I must confess. My review is for their bar \n\nThe setting is old world elegant. \nI would","useful":2,"cool":2},"8CVkw8BJCqda667luIbT6g":{"text":"I recently spent a long weekend at Hotel Monteleone and I came home feeling loved and well","useful":1,"cool":1},"9LZugrvhzDwLrjPycC1T5A":{"text":"Loved it here. I would love to come back again some day! Very charming atmosphere and food","useful":0,"cool":0},"ypMgxhnpQDe61iOtcG6mqw":{"text":"My friend and I had to cancel our prepaid reservation due to the fact that his child was v","useful":0,"cool":0},"DtmGlK6tQWbwm4tbNhaMlQ":{"text":"We really enjoyed our stay here.  The room was clean and well appointed.  The bed and pill","useful":2,"cool":0},"exItq70qsRNRPyJUUQgdqw":{"text":"Do not stay here. Personal belongings were stolen from me at the pool, while my back was t","useful":3,"cool":0},"VAi90bLwoEAqnxZd49hFMA":{"text":"Wow! Historic and so charming. Very clean room and a comfortable bed. Helpful staff. Fabul","useful":3,"cool":1},"hwgvOj4IpwkRRt8EH3p5kg":{"text":"I've stayed at a lot of places in NOLA but this is my first time staying in Hotel Monteleo","useful":1,"cool":3},"JlrUMT-zv3emlPBgdbAPrw":{"text":"The 5 stars are for location and friendly staff. I think the price was very reasonable for","useful":1,"cool":2},"CsySY6XMhC_OV93060auBA":{"text":"This hotel was so pretty. Conveniently located on Royal St. The beds were very comfortable","useful":1,"cool":0},"Pd42rjqR055zXHKaLvHfIQ":{"text":"We are loving our stay at the Hotel Monteleone. Our room is nice, but the rooftop pool is ","useful":0,"cool":0},"7S-E_B5mjsxVFYeitbUYiQ":{"text":"Stayed here for 4 Nights. Overall great hotel. Fantastic location in French quarter near B","useful":4,"cool":1},"dVsDqtuCtfe8NZeO2a3rIw":{"text":"I don't know where all the 4 and 5 star reviews are coming from?  This hotel may have been","useful":2,"cool":1},"M_kREaiHMo-kACn2ut0Bug":{"text":"I recently stayed at this hotel during my visit to New Orleans.  My best friend and I love","useful":3,"cool":0},"aUhyPfnugZNcl4_R6_ny6g":{"text":"Booked through Expedia.  A very nice hotel with great appointments and really good service","useful":0,"cool":0},"AUM_FalOPLycwdrn2Or8Fw":{"text":"1. Super small rooms and bathroom. Definitely not comfortable for 3-4 people. 2. Bar staff","useful":0,"cool":0},"8l_Q08hSib60K49uKVlngw":{"text":"I have very mixed opinions of Hotel Monteleone... \n\nThey have the location and they have t","useful":7,"cool":1},"aTCGJ2sXH04Re0VMsoYMUw":{"text":"Great Service from all staff. We enjoyed Nolan's southern charm. Excellent experience!","useful":0,"cool":0},"X43uoBzwG2Ll4yka9Llzdg":{"text":"The service, location, cleanliness was impeccable & truly a warm experience with great att","useful":0,"cool":0},"BNTYl9BKxfz6dYpPTAvPZw":{"text":"My friends and I were pleasantly surprised when we arrived at the hotel and saw the old wo","useful":1,"cool":0},"aJdKy9-o2u4BJIaQgcantg":{"text":"What a beautiful hotel while you're on the French quarter hitting bars and restaurants try","useful":1,"cool":0},"HtDUEzf6P16z1IbeFFBaQA":{"text":"My favorite part of the hotel was James, our waiter at dinner. He was awesome and deserves","useful":0,"cool":0},"tCrYs4eiVIHQdbak0gIlLQ":{"text":"Gorgeous High End Property \nThe staff have been super friendly and accommodating.\nThe room","useful":0,"cool":0},"FgJE309r45MudNdwZOtD8w":{"text":"My husband and I spent our 3rd wedding anniversary here at Hotel monteleone and I have to ","useful":0,"cool":0},"ce4kZSx4-bIRQrQnJFygEw":{"text":"Hotel Monteleone is stunning! The beauty and the charm of this family owned hotel leaves l","useful":1,"cool":0},"aKX5ju53Df6S_DvY3sjbgg":{"text":"An  historic  hotel in a  great  location!     The  rooms  are  small which is somewhat  e","useful":1,"cool":1},"eM9deC16ACpfzz3gAJDP-Q":{"text":"We stayed here at the Monteleone for a mini staycation over Christmas Eve with some friend","useful":7,"cool":6},"watWdIN3wzcB5UANSGYaZg":{"text":"The ambience of the Carousel Bar is definitely worth the trip if you've never been. The ca","useful":1,"cool":0},"97Xdsm30GnyDB5iCmrNzrw":{"text":"Great location, in the quarter, steeped in history. Ask for Barras if you need help checki","useful":0,"cool":0},"TzWqv0tmTiCedUj9sSj4Xg":{"text":"I spent part of a summer vacation staying here during a trip to New Orleans before hopping","useful":7,"cool":7},"d-KyiL3kt8Fmo_Z8jHrE2A":{"text":"The Hotel Monteleone is a lovely old hotel. It's set back enough off the busier streets th","useful":3,"cool":1},"t5PS706fjYUTo5ihV-3xZA":{"text":"This is my new (and always changing) favorite hotel in the FQ.  My visits are about 1 - 2x","useful":1,"cool":2},"HN8hoRBoN4ziLBmfhUUnpA":{"text":"We stopped by to visit and get a few drinks at the rotating carousel bar. It's was a great","useful":1,"cool":0},"RXaQNzIwANyzu5vrHDrkHA":{"text":"Top notch quality hotel and adult beverages\n\nWhile our group was in the Bourbon Street are","useful":5,"cool":1},"5OnUN4_N0OHwedsBzvV_sA":{"text":"This elegant hotel has it all; hospitality, cuisine, services, facility. We we're there a ","useful":0,"cool":0},"-WpEoSSyPDirxTLV50bV5w":{"text":"Room was neat and clean, but tiny in comparison to other hotels I've stayed in for the sam","useful":0,"cool":0},"sW5lhlFD7mIKZ5kJfHWjvg":{"text":"The absolute best and most notable place to stay in New Orleans. The Monteleone has so muc","useful":2,"cool":1},"DDop39i83ZHRz0W8dT5jRg":{"text":"Everything was beautiful and the service was impeccable. The only thing that was not was t","useful":0,"cool":0},"vPrZaomwm_QpdX2l6X60OQ":{"text":"The room was ok, (just ok) bathroom was so small...... BTW we asked about the bath when we","useful":0,"cool":0},"oL25VMv7m1_0gLcoMvAanA":{"text":"I would live here. I couldn't stop adding extra days to my reservation. Such a beautiful p","useful":0,"cool":0},"YBTLi_kbi31hB7L8T8KTKw":{"text":"One of the older hotels in the french quarter.  This place is small but elegant and comfor","useful":7,"cool":3},"LS2jGxSzCD-p6T7SjHLXIg":{"text":"Celebrated our 13 year anny here last night and was not disappointed! Service was excellen","useful":2,"cool":0},"qJgIVFnOnyAtdfHk3khigQ":{"text":"\"Pet Friendly\" hotel costed us $500 in non-refundable pet fees for 2 indoor cats. Staying ","useful":3,"cool":0},"iv54wFSfx6epX8PxKJkQfg":{"text":"The staff was so helpful.  They had everything so under control for our daughters wedding.","useful":0,"cool":0},"O4w6CEH4f_DENsDTRb4ylg":{"text":"Beautiful historic hotel very close to The French Quarter. A classic. Service is excellent","useful":0,"cool":0},"i8Q7Kb3KdqNzqdGnRjGeGQ":{"text":"The rooms are nice, we have a view of the Mississippi River. The pool was cool although if","useful":4,"cool":1},"c6a_18iW0463C8oVHSZUew":{"text":"What a beautiful haunted hotel. I have only been to the lobby and to The Carousel Bar, but","useful":2,"cool":2},"YMjxgwVJZ0Mv_K4sw4aT6w":{"text":"Hotel Monteleone\nBeautiful And Historic\nPlease commend Blair for his outstanding service p","useful":2,"cool":0},"P-3kYNRJPCKU7YJRl9bWYA":{"text":"We stayed here as part of our New Orleans tour with Tauck. An old but very elegant hotel. ","useful":1,"cool":0},"8_gH6SaPMHG1c63xjX4i5w":{"text":"$22 for a double fernet?!?! Think a bit highly of yourselves? The bottle is $20, and your ","useful":0,"cool":0},"hJLejIV7PQJ-ZRsvWB-k_g":{"text":"This hotel is amazing!! The staff is extremely friendly and helpful.Also, the hotel manage","useful":0,"cool":0},"9sPZnHYKsWO4v40XnS9UAA":{"text":"My husband surprised me with a 2 night stay here on our drive back from Texas... \nunbeknow","useful":3,"cool":1},"Jk4w4yhpR17YykEGuDiKhA":{"text":"My favorite hotel in New Orleans. Great location, great staff, great rooms, and love their","useful":0,"cool":0},"oZLVsww-9kG7Ud4xKRhbsw":{"text":"Breathtaking is the word that comes to mind!\nLuxury in the French Quarter.  The carousel b","useful":1,"cool":0},"t4ErRNIEe06ILQPQmt1J-Q":{"text":"great service! definitely is a nice and clean place to stay. the best part was nolan the b","useful":0,"cool":0},"LgOuMMn2t-_52oVjcV5cgQ":{"text":"This is our go to hotel when the air-conditioner is out, or power is out, or house is bein","useful":0,"cool":0},"ADqRkvWBe23GYHzBhLc2yA":{"text":"The Carousel Bar is a NOLA institution, do not miss it. Of course, a little touristy but D","useful":1,"cool":0},"zSLtCsHjkTwTlwX4O2B-tg":{"text":"I am staying at Hotel Monteleone with my mom for a mother-daughter trip. We picked this ho","useful":1,"cool":1},"Qp1LneVGV5aRkb9jVJTccg":{"text":"We had a great stay. The room was clean, comfortable and quiet. All of the staff was frien","useful":1,"cool":1},"ai_Nw6d_OkN-qkoI5pKUUQ":{"text":"At almost $450.00 per night I have had better nights at a Motel 6 near the hwy. We were on","useful":0,"cool":0},"AcD9OxId-hFs56PxW5xixg":{"text":"CAROUSEL BAR!  \n\nHas anyone mentioned that amazing part!?!  \n\nOh and the CAROUSEL BAR actu","useful":1,"cool":1},"7pTxPH3zMzPVyTtMH9Tm1Q":{"text":"This place is a little addicting. Every time I come to NOLA this is where I choose to stay","useful":3,"cool":1},"INRURcspoIL8PSTAmUHADA":{"text":"I and my gf stayed in this hotel for one night. So, I have nothing to say about the room s","useful":1,"cool":0},"Fgs3gp2CCgkJaFLwpG-dpA":{"text":"+ excellent service even during mardi gras! Rooms were always made and door men were frien","useful":0,"cool":0},"YYZzzBsDYl4J_e63AxVvJg":{"text":"Had another SATISFYING stay, 4 nights this trip. The Staff is EXEMPLARY. The facility is O","useful":0,"cool":0},"FiyjQ_pf-VMiiFmLAwOwTQ":{"text":"Great place to stay.  Rooms are fair size and accommodations are good for NOLA. \n\nThe rest","useful":0,"cool":0},"qEYzTMQ0CKq0CpvDXZxUHw":{"text":"If you are coming to New Orleans, this is the place to stay!\nThe history of the hotel is s","useful":1,"cool":2},"X-oS00X_i4p4Zyx_8zGzmw":{"text":"The hotel location is about as good as it gets. The service was first class front desk, be","useful":0,"cool":0},"sPqQ6h7kFTR38vMyIBhrFQ":{"text":"The hotel is beautiful but the rooms are small and claustrophobic. The staff is not unfrie","useful":4,"cool":0},"gCBsHo1HQoIDZNg3eNwFOQ":{"text":"I was expecting so much more. Second time visiting New Orleans and stayed at the Ritz the ","useful":1,"cool":0},"2r77XPdTNfihIyqpy3ZXSA":{"text":"We didn't stay here during our visit, but we hung out in the bar every night. It was so mu","useful":1,"cool":0},"pfPhKZtoj1G9AEtNYhW3Ag":{"text":"Because of the pandemic there are all sorts of cutbacks but you gotta do what you gotta do","useful":0,"cool":0},"qhF5d7dvQ40YjhE3VrjVlA":{"text":"This hotel was beautiful, elegant, historic and so comfortable.  The housekeeping staff, D","useful":0,"cool":0},"0QjLeKDMfBOxarDMwWDMbA":{"text":"hotel monteleoneWill make this as short as I can . \nWhen we checked in \n\nThe room was ok, ","useful":0,"cool":0},"GEe8icg1gBdqKGeAtnAAHg":{"text":"I didn't like it and I was  even in a preferred bedroom on the 12th floor. It was painted ","useful":3,"cool":1}}