{"pCoqY82eeB-W0-5FL3vnSw":{"text":"I've had this steakhouse on my list for a while now, due to the fact that I love steak, it","useful":0,"cool":0},"w4k2PjVw78n5mkKqYJtKTQ":{"text":"Most pleasant, attentive thoughtful professional staff AND most importantly the best quali","useful":0,"cool":0},"Hsse35EudxcJvytJMx9alQ":{"text":"It seems as though crescent city is riding on a reputation of what once was. Each time we ","useful":4,"cool":0},"sgUFA84eUSOb5iGeAnbdzQ":{"text":"Supposedly, this is the joint where the Ruth of Ruth's Chris learned this now infamous for","useful":1,"cool":0},"J2DsTVhehLe89zq7bB2xbQ":{"text":"Overall a rather ordinary experience.  Three stars due to friendly and competent service. ","useful":0,"cool":0},"ql4PKj-91ZIz3KBpN31P5Q":{"text":"My absolute favorite steak in all of NOLA. The staff are always very welcoming and accommo","useful":0,"cool":0},"6iva4o_MR3CHcpjPfj_M2Q":{"text":"This is a classic New Orleans restaurant. The ambience is 1960's upscale steak restaurant,","useful":1,"cool":0},"78EEbwhx4BUVnUucV-Ogcg":{"text":"Excellent ambiance, great keeping of tradition on meats which are excellent. I was expendi","useful":0,"cool":0},"oUDM6L7gu6lmibLR_-zzDw":{"text":"This isn't a review of the food- this is a review of the people of Crescent City Steaks. I","useful":3,"cool":1},"x48VJBHg4G5XdGCtl0xqPA":{"text":"Ummmm...Did I miss something? The food is mediocre, the service is okay, the armed guard i","useful":0,"cool":0},"pb-09hGD1DOjd4R4EP_xKA":{"text":"Took my girlfriend here for Valentine's Day.  The atmosphere was great, and the steaks wer","useful":0,"cool":0},"xZy1MZ7b4s9ZeQPojQcN-g":{"text":"We had the Onion Rings to start, Excellent!\n\nNext we had the Bone In New York Strips, Lyon","useful":1,"cool":0},"FZVCRNQW9yDmjslmb4jcog":{"text":"Went here recently for a dude's night out. Has a kind of old-school Italian decor. Service","useful":0,"cool":0},"z-qktR8aVfl0UvxF-G_WSg":{"text":"The steak here is phenomenal. I highly recommend the porterhouse for two. It's big enough ","useful":0,"cool":0},"3uqj8GRMGmwYCcHhkreWXw":{"text":"Dinner on March 31 was excellent and our waitress was prepared to handle a 3 year old too.","useful":1,"cool":1},"R23JgerYnQ5k3Y6ME_pX0A":{"text":"Bacon wrapped Filet cooked medium rare - sauteed spinach - all I can say is WOW. Truly exc","useful":0,"cool":0},"qy7lL43NZXDmrAHlGzFrYg":{"text":"Must have been my lucky day because they are usually closed on Mondays(my only day off), b","useful":3,"cool":3},"75I93Eiu9qAYb3IimDk20w":{"text":"The best filet I've ever eaten. Perfectly cooked & came to the table sizzling. I ordered t","useful":2,"cool":0},"3w34uXBTGyRhLWxYbAzwlQ":{"text":"First time going was a couple weeks ago. This place is great. Old school feel. Prices are ","useful":2,"cool":1},"Z5kyxpYGCaOVvRQjHCjwqA":{"text":"I ate here based on a recommendation, but was very disappointed in the food.  Honesty tast","useful":0,"cool":0},"lqkx3Auxkkr3aafGQ5dInQ":{"text":"I ate here on my honeymoon, back in 92, before there was such a thing as web reviews.   It","useful":1,"cool":0},"S-fdS-dkLD-UHw2Pq-Yebg":{"text":"Great food. Very old school and basic but the food prices are old school too. Gray meat an","useful":1,"cool":0},"KHYvCA-5pMpLwKOPf5BNEw":{"text":"The prices and portions here just can't be beat. A 10 oz filet wrapped in bacon runs you $","useful":10,"cool":4},"yXzZNVfzILv1dwEG2i_oYg":{"text":"Went in this evening wanting a steak but not sure how much time I could invest because I w","useful":0,"cool":0},"N5xis9Csg_zFhLhDYF9FoA":{"text":"Very consistent food and service. A personal favorite of mine for business lunches for man","useful":0,"cool":0},"oyZWobSXz7-_1tO_plkDvQ":{"text":"The steaks were good, not the best I've ever had but a solid steak house. However, for the","useful":0,"cool":0},"A4g-Pf53_MMyWrgwy5_XKQ":{"text":"Food was good, not great. Service was slow at first but good after the order was taken. No","useful":1,"cool":0},"2Muxl9bNvpTKeWnzAi2cMg":{"text":"We stumbled upon this hidden gem while in town for a weekend. This is how a steakhouse sho","useful":0,"cool":0},"CsrNarcYzp9uDrnlak8s4g":{"text":"Holy moley- this place is amazing! My family has been coming here for the last 20+ years a","useful":0,"cool":0},"B-k-vg1_QvkOL1lKRyfs5g":{"text":"Well, we tried this place out for a birthday dinner on a Saturday night, reservation highl","useful":2,"cool":2},"VXnGKi1A1qH2gqL6iGFMxQ":{"text":"My experience at this restaurant today was extremely disappointing. The food wasn't terrib","useful":0,"cool":0},"GYPw3ADb5mop-AP7grlaVw":{"text":"Steaks were tender and flavorfu. I know they have kept everything the same as when they fi","useful":1,"cool":0},"Sw6V9s5tPwPoj8kKdbufyg":{"text":"My family and I visited this place for Father's day last year and had a pretty pleasant ex","useful":0,"cool":0},"g-tJe23sur9IblrzOCDrAg":{"text":"We had a great experience at the Crescent city Steak House!  First and foremost, the servi","useful":0,"cool":0},"zcOMYtHFsRY7--U7f5vjkA":{"text":"I love the old school vibe of this place, especially the private booths.  A nice bourbon s","useful":0,"cool":0},"M3DJXv_q-YiGAA7rfP_N5A":{"text":"We went last night and had the chateaubriand for two.  Excellent.  Really excellent. \n\nOwn","useful":0,"cool":0},"cJqgKUB5I6Ta1YwtR1qyVQ":{"text":"We decided very last minute on a Friday night to make it a beefapalooza for dinner, so aft","useful":2,"cool":0},"cattwMaop7jWuvNGYJxEVw":{"text":"I've eaten here twice, and have twice been thoroughly disappointed. The first time the ste","useful":1,"cool":0},"Xb1euphFcKvLTJuspO046A":{"text":"Food is good...atmosphere is pretty noisy. Prices are reasonable ;) will recommend. There ","useful":0,"cool":0},"DQVx0FiAC65EKYLevnXOpw":{"text":"Great food. Must have the stuffed mushrooms...amazing. Ribeye is insanely good oh and the ","useful":0,"cool":0},"ZpHpvd9yxCSazArpz8psyg":{"text":"Visited 12/24/14.  Solid steakhouse and sides, but filet was overcooked (requested medium,","useful":0,"cool":0},"K-R-c0FIx9hRXOgtJOZJ3A":{"text":"Went last night with a group of people and the service was horrible . The food was was awf","useful":0,"cool":0},"k6X0NYpBaO7WdJ3cTOLFcg":{"text":"Have not been here since before Katrina and randomly wanted a steak in a classic New Orlea","useful":0,"cool":0},"N5ozamjTJOnImoK1TlrDVA":{"text":"Seared on the grill and finished in the oven, that's how you know they know what they're d","useful":1,"cool":0},"9jZKMwooJ0_TrO_R1UrKbA":{"text":"Go there for the experience but not for the steak.  it was great, dont get me wrong.  but ","useful":0,"cool":0},"ccHcoEpQMciyxyp1La0bcg":{"text":"The iconic neon lights of CCS are a great childhood memory. Now decades later I am enjoyin","useful":0,"cool":0},"VcWKdVt75lJXG5uJG-noTg":{"text":"We wanted something off the beaten path where the locals go. We soon found out from our wa","useful":2,"cool":1},"apT81_OvL80g0Ez9mHho4w":{"text":"Everything I ordered was divine perfection. The filet is excellent, the scalloped potatoes","useful":0,"cool":0},"wHaHVcL8r3cDMWlRptfS2w":{"text":"Very disappointed. Caesar salad came on hot plate. The tea taste like they haven't cleaned","useful":0,"cool":0},"oe4gipwiOF4es2Z38D7sYQ":{"text":"I went to this restaurant thinking I was going to have a great meal with a friend of mine.","useful":0,"cool":0},"lRF6vXxDzbsedW-gwcxxQQ":{"text":"The venue: cozy, friendly and inviting.\nThe staff: engaging\nThe food: I had a rib eye. It ","useful":0,"cool":0},"adPdKhLsLjieiOZtkjhZ5A":{"text":"The service was good even though the place was very busy. The onion rings, au gratin potat","useful":1,"cool":0},"iLBpHRa3J1-tk4pVLxDkcQ":{"text":"What character and charm. This place has so much history.   It was such a pleasure to eat ","useful":0,"cool":0},"C5ggqHFv4srhBJZYxTjkzw":{"text":"I had only been to Cresent City Steak once before years ago, but we went for my son's  bac","useful":0,"cool":0},"tVPuLyvv7kRBD84CCu6hqA":{"text":"This place was just ok to me . We made reservations before hand . They couldn't find my na","useful":0,"cool":0},"4bgPSZ8E6u38wx-IzMq0HQ":{"text":"First time there last Saturday night. I made a reservations but they worked with me when w","useful":0,"cool":0},"MjgN5sQSjG32jzjj3gEXXA":{"text":"Classic New Orleans steakhouse, circa 1930's.  Looks like Huey Long ate here.  It even has","useful":2,"cool":1},"H7jGhmNG_HxLcy_CoZDtpQ":{"text":"This is a great classic steakhouse. It is the kind of place where things never change - th","useful":1,"cool":1},"XPhlIoDzeqpIhzLPZrAB9w":{"text":"Listen, I heard this place had a long history but let me say it's one of the most overpric","useful":1,"cool":0},"_-Qwrhks7hVD3PHYMKf74g":{"text":"As usual CCS did not disappoint. The dry aged prime porterhouse was cooked to point at med","useful":0,"cool":0},"lHzSHJLrbYaaZLF-RNd1Nw":{"text":"Simply put, the best steak I have ever had in Louisiana. (The best steak ever was in Tusca","useful":1,"cool":1},"Y96a9HCPT_YwPCl-jHh83w":{"text":"We just got home from our first experience at Crescent City Steaks. It was fine, but nothi","useful":0,"cool":0},"yZE2qU1PfkJQR2kcleoCeA":{"text":"Very simple. Steak was good. Sides were amazing and drinks were strong. No very entertaini","useful":0,"cool":0},"7wmbxzpWq88Ms6NyoxccaQ":{"text":"This was my first time going and I have been looking forward to coming here for quite some","useful":2,"cool":0},"Ny3et53wwPggVlwYbgN8_w":{"text":"An old school classic steakhouse off the beaten path in New Orleans.  Crescent City's my f","useful":0,"cool":0},"Czth7DwHUIX6sNTiN_lw5w":{"text":"Has to be one of my top choices for steak and dining. I would say top 10 with this one ran","useful":1,"cool":1},"mwy5HaLIOOd70Kid2CsuXw":{"text":"Drawing the curtains closed really is quite fun.  \n\nI had driven past the neon sign many t","useful":3,"cool":1},"IGmwpg0uzixPTlbm_eKC2w":{"text":"I so wanted to enjoy this place that even after being less than impressed the first time w","useful":2,"cool":0},"pAzTh7URAI04RC0o1lzLYA":{"text":"Have always loved this place, but after tonight it is off our list. The experience started","useful":1,"cool":0},"LL900iZ6xVnFO_ss1WU3Iw":{"text":"Had a business lunch here July 16. First, I love the look of the place. Private booths, wo","useful":0,"cool":2},"nx3C2Z5_BT3uzaPZxtbSRw":{"text":"Sent two steaks back to kitchen due to excessive salt use in preparation.  They washed the","useful":2,"cool":0},"265DQWIDe5BFdRDGxrdp7g":{"text":"Food was good, but nothing that stands out. The Z Pie was the best part of the meal. Servi","useful":0,"cool":0},"ZsQClCmgHLgf9NPVw772oQ":{"text":"Went here with my soon to be in-laws and had a great time.\nReally old school atmosphere an","useful":0,"cool":0},"LLD0nuezQFwJe_c0qzTv6Q":{"text":"Made a NYE reservation. Was seated 35 minutes late with no apology from host who was rude ","useful":1,"cool":0},"HpgfT2LWANSWXHbfXtXIIA":{"text":"Went to CC Steak House this past Friday, and it was truly a wonderful experience!  It was ","useful":1,"cool":0},"qid85Qr1CBWtvEy7K4LWOQ":{"text":"Had a nice dinner with my best friend's parents. We all had a Rib-eye. I like mine rare. I","useful":0,"cool":0},"OT0vNr5ALd69R9dy25qjDQ":{"text":"Quite disappointing.  Was looking forward to a great steak dinner after enjoying wonderful","useful":2,"cool":0},"SpYTE1FespG79mPG9C298g":{"text":"Best Steak in New Orleans.  At one point, it was ranked one of the best steaks in the Unit","useful":1,"cool":1},"nXxYbaumFvSAiUR5O9A3NA":{"text":"Skip this Steak House, the great part was the very hot plate with the ribeye steak, smothe","useful":0,"cool":0},"HltGTwkz95c7O2ainkiUUg":{"text":"This place is a blast! Steaks are great.... always cooked right but they always ask. The s","useful":0,"cool":0},"4q06UfGKPki1aHyaDVVMdA":{"text":"Always enjoy the local flair of this old school New Orleans restaurant. \n\nTook my Mom as a","useful":1,"cool":1},"IoEKAaxb9hamlKBqwG2DwQ":{"text":"This establishment is  not a welcoming place. The customers they want we're clearly define","useful":0,"cool":0},"upiOWbdn_SXnzlD65gf41Q":{"text":"Before I called NOLA home, I was fascinated by its old school steakhouses. This is the cit","useful":7,"cool":6},"x_BgL-_qNBkspvwTfBFfNA":{"text":"this is old school, and very new orleans.  we sat in a private booth, and I felt transform","useful":1,"cool":0},"yLI6ri_gzxbjoCY-8QReUA":{"text":"The Porterhouse for two was fantastic. Stuffed mushroom were cooked perfect \nWe had sautée","useful":0,"cool":0},"FEQRT5kGAHTuWgxZ1N2vQA":{"text":"Love the curtained dining, hate the service. The au gratin potatoes were sweet. I don't me","useful":2,"cool":0},"TuSRx-oWw0ADz-2id7grKw":{"text":"I've driven by here often but had never been here. (I don't eat meat that often.)Truthfull","useful":3,"cool":3},"qcnjpJTfEkAv8ckSiE3bMw":{"text":"If you want to go to a REAL steakhouse then I highly suggest this place. The old school at","useful":0,"cool":0},"2SHZv_VZAmItL74lzKxDqA":{"text":"Everything about this place, except for the steaks, is great.  The sides are wonderful, th","useful":2,"cool":0},"bB70_V-nBC-8_OJ4WROTQw":{"text":"Not only does Crescent City Steak House have all of the old school charm and ambiance that","useful":1,"cool":1},"mfn4SJvb6yi51ez_djwQJQ":{"text":"8 of us went to dinner. Table was back against wall so, husbands had to get up to allow ce","useful":1,"cool":0},"8s_VgoCPNOprFU09rp2AnA":{"text":"Wanted a good steak and got one here!!  The service was great. It says not kid friendly bu","useful":0,"cool":0},"3zQk0llP1NgqH_vX9ikFvQ":{"text":"I usually have dinner every three months and every time it get better,one of the best Stea","useful":0,"cool":0},"lyf2nRL51V5vhogOmzlJvA":{"text":"I used to travel about 70% of the time and as such have eaten at lots and lots of steak ho","useful":0,"cool":0},"EoCAhzLoYf_bf6v6VHO8Ag":{"text":"Nostalgic, great prices, great service and local! All the best things in a New Orleans res","useful":0,"cool":0},"d6E_X0lPLtSKRJuArDf7gQ":{"text":"I read good reviews on Crescent City Steaks and decided to try it. My server was excellent","useful":0,"cool":0},"FfHc6MK-IHdZIY_rWz8UVg":{"text":"I love the old school vibe of this place, especially the private booths.  A nice bourbon s","useful":0,"cool":0},"884K5wjbkONvfNIxQOjyEw":{"text":"It was a mistake visiting this place. The customer service was sub par and the food was ev","useful":5,"cool":0},"xu7W1w_MxRsfxCDYfZiELA":{"text":"We went here for my husband's birthday dinner. The food was delicious, service was great a","useful":0,"cool":0},"evc7q3qFcdTQvIkfbIBn-g":{"text":"A small family place, good food. Everyone minds his business.\n\nWhen opened back in 1937, i","useful":0,"cool":0},"YyRINbm5qzuD4KdZO9Cf5Q":{"text":"OK..... so I don't know about you but I absolutely love a good steak. I mean when it's rea","useful":1,"cool":1},"58OW3LoL2XXOmsWv9PxlCQ":{"text":"I enjoyed the Rib eye, cooked to perfection , the appetizers were delicious as well (stuff","useful":0,"cool":0},"4L7oyLdkfrEHTHrkY80vMA":{"text":"Old established restaurant celebrating 80 years so they obviously do many things right. We","useful":0,"cool":0},"_hTJjt6LXynGuUIYuyafjA":{"text":"This is a New Orleans stalwart.  My father would take me here as a kid some 25 years ago, ","useful":2,"cool":0},"4HcKLlT0rtYalkFpjVsiqw":{"text":"I was so excited to try Crescent City. I treated a friend to dinner to celebrate her gradu","useful":13,"cool":2},"FwNFeYa5Ut3gRG9Dsm8j0Q":{"text":"I used to give this place 5 stars but the last few times I've been, the steaks and service","useful":0,"cool":0},"snzfDkh6U-3eMg9Xn_enXQ":{"text":"Crescent City Steak House is a Broad Street establishment owned by the same family for dec","useful":4,"cool":2},"7PaBxTfqr6wbXWWyGlctvQ":{"text":"We've been to CCS twice now. Both times we have had the pleasure of seeing the mother of t","useful":0,"cool":0},"rpgzXI196ndgU1wcELv1Cw":{"text":"My boyfriend and I came here for our Christmas celebration date and had an amazing time. W","useful":2,"cool":1},"JvOmHsjbAccwaiHQOUvTTw":{"text":"It had been way too long since I dined at CCS. But as usual everything was perfect !   I s","useful":1,"cool":0},"KsiV595AppkbKhOoy6EDrw":{"text":"We frequent here and always have the same waiter, same great service, and always have grea","useful":1,"cool":0},"q7zsi9dSY4JgwsfbMePKhw":{"text":"This is an old school New Orleans Steak House. Aged USDA Prime Beef. I'm picky about my me","useful":1,"cool":0},"a9NIOtLZJJJSJebTE09NpQ":{"text":"The atmosphere here is excellent as proven by other reviewers but the food and service I h","useful":2,"cool":1},"wkKLFeE4BXKFzrPuSFwl9A":{"text":"Like Mr. Chad below me, I had passed by Crescent City Steaks a million times. It wasn't un","useful":10,"cool":10},"IJP1cFVflnKWnxztHJcIPQ":{"text":"Food is ok both steaks were undercooked and didn't like the fact that the drinks when orde","useful":0,"cool":0},"t-x6Nwusfk9XHGaicgEiQg":{"text":"I wish I could report good things about Crescent City Steak \"A New Orleans Tradition\" but,","useful":0,"cool":0},"mP2vFxlMRISCZ91eVP9T3A":{"text":"This is an old school steak house.  The steaks are cook to perfection.  The steaks are ser","useful":1,"cool":0},"vXJLhFu108XmqqrZq_IyaA":{"text":"I was really looking forward to a unique steak experience after reading reviews. Didn't ha","useful":0,"cool":0},"O1jBivIVr0upxtVFEzuhjg":{"text":"My favorite steakhouse in the city. It's an old New Orleans classic - the owners family ca","useful":2,"cool":1},"zP3edCDXBH9pzdqkl186_Q":{"text":"Slowly but surely I am working my way through New Orleans steakhouses. Tonight CC steakhou","useful":3,"cool":2},"TCXIts_Pttr4ZSHG5lvCYA":{"text":"We've eaten a lot of steak then the years and this steak didn't disappoint. It was hot on ","useful":0,"cool":0},"EadW2ZF1f1Zzt5tcv1QStw":{"text":"Dry-aged ribeye cooked perfectly at medium rare.  The asparagus was fine, but the steak an","useful":0,"cool":0},"MKYql50tWkXLZryULE2eNg":{"text":"Service with Mike was excellent.\nFood came out hot and was delicious. Please make sure you","useful":0,"cool":0},"yq6-Uw8rsLjOJrXR5FvDOQ":{"text":"This is an OK steakhouse with an authentic, old school vibe and history but ultimately the","useful":3,"cool":1},"kqKn9m7ltCIjTLqmj1ju9w":{"text":"As a Vegan Goat can't eat the fantastic smelling meat here and it makes Goat so damn unhap","useful":4,"cool":3},"98RcIeSe67tBC6iZbzOddg":{"text":"I was in town on business and was excited to try a local steakhouse. I was very disappoint","useful":1,"cool":0},"ypLtO58j62YAsq4p4tktbQ":{"text":"My sons and I like to get together at least one a year, just to catch up. We've all been t","useful":0,"cool":0},"uE4CZ-Cb9MQ63yoJ7Wdc2w":{"text":"Nickel and diming-\nHad dinner at Crescent City Steak House spent a little over $300 and no","useful":0,"cool":0},"B8pzN8GrcUQugsQ-gZuYNA":{"text":"My son has become something of a mascot here, a nine year old who takes his steak very ser","useful":3,"cool":4},"AZvQXc-Fs5eX80hc32hSlA":{"text":"With this place you get what you pay for I guess. The salad dressing was super watery. We ","useful":0,"cool":0},"8Bb2j5vN2mugl1oM5Q8BTw":{"text":"Best steak you can get, a little slice of southern France or northern Italy in New Orleans","useful":0,"cool":0},"kKdnSQ5Yeneh4qApTV_lEg":{"text":"Last night we finally made it to CCS.  I had heard that their steaks were some of the best","useful":0,"cool":0},"Q4sKbGqxqabvLTeylBPJ-w":{"text":"Its our first time here, our steak was beyond undercooked. We asked for a medium well stea","useful":0,"cool":0},"tcchdilZtRYWdEI7HmEBmA":{"text":"This was my first time here. i ordered the porterhouse for two spinach au gratin, mushroom","useful":0,"cool":0},"FBPKF1AQpfHgSXsFWkmq9Q":{"text":"In the past, Crescent City Steak house was the place to be. The meal I consumed was medioc","useful":1,"cool":1},"XU1GZEK1B7zHpcXLh6F1-Q":{"text":"This place was amazing. I came here for a birthday reservation and the woman who answered ","useful":0,"cool":0},"xyO_h9eUwOzu6ZYoStQLaA":{"text":"This place was very average! The service was excellent and the pricing is not bad. I order","useful":0,"cool":0},"8f2TNsu-KeqltCN7mzjSlQ":{"text":"I've been coming here since I was a small child. \n\nWhat a wonderful birthday dinner. I had","useful":5,"cool":2},"B01hJ60SRgoWS1SkHBuo7Q":{"text":"I almost don't want to review this restaurant out of fear that it will be overrun by annoy","useful":3,"cool":1},"yueyuWksK_tes_TjVQn6uA":{"text":"Vintage! That's the first word that comes to mind. However, that doesn't go into why I gav","useful":1,"cool":0},"BTQoazOIYHWX-pDZlhGAKQ":{"text":"I was so excited to try this place for date night. We decided to get the booth which was p","useful":0,"cool":1},"CHgSGexHX5pI2Trnz8oAgQ":{"text":"The food was delicious. The service was upsetting.  We went for my birthday, there were 6 ","useful":0,"cool":0},"lU0d9mCCJOFYCXxlsexvBA":{"text":"Just horrendous. Ordered a porterhouse medium rare. Came out well done. Replacement came w","useful":0,"cool":0},"CTQBiU17Ce-C-xuSrhEvLg":{"text":"This is an old-school long traditional steakhouse in New Orleans. The staff is super welco","useful":0,"cool":0},"RhzhjZjU5gSXeFBJT6Fgcg":{"text":"Went here for our Valentines Day dinner, a classic New Orleans steakhouse that always seem","useful":1,"cool":1},"YKaM5hu6y9TVJ88ndNK-SA":{"text":"We were so excited to come here the greeting was wonderful we ordered dinner and then afte","useful":0,"cool":0},"r2EJHOqF_xuT5kSDnmqzQg":{"text":"The Caesar with steak tenders was amazing!! And the service was great! A definite repeat c","useful":0,"cool":0},"7MHeNSkqC8jpz3iIeMdEQg":{"text":"Took my wife here for Valentine's Day. As soon as we arrived we were greeted by the hostes","useful":7,"cool":0},"E7erwYReTdljuHXBZqC-iA":{"text":"Love this steak house!!  Nancy is the best server and we enjoy her smile. The steaks are u","useful":0,"cool":0},"YQLkMQYdB2EAw1Od-C-LKg":{"text":"I cannot say enough about this restaurant!  Skip that pricey steak house & enjoy a real Ne","useful":0,"cool":1},"9KiMYV0uCG2bxnu-tk4PEQ":{"text":"This is an old school steakhouse that still knows how to do it right. The filets and rib e","useful":1,"cool":0},"DpYhNv8PO4T_LSNVr6Clyw":{"text":"Food and service well below par. Spend your money else where. You will not be appreciated ","useful":4,"cool":0},"tga7hFJpyByRxgt2XQS0Tw":{"text":"I hadn't been here in awhile so was looking forward to visiting again. I came with my best","useful":9,"cool":7},"qOLcSwbR-_YzMqmE-w3wSw":{"text":"Very loud.  Bring a megaphone to have a conversation.   Our server was was very attentive ","useful":1,"cool":0},"R5UIFfKZlUmf5pyypeiqqg":{"text":"Horrible Service!!! I ordered surf and medium well turf and my filet came out medium. The ","useful":0,"cool":0},"cMbH9SY04MlIsiDylzmwyA":{"text":"Best steak I've ever had, and that's consistent since the late 90s.  Spinach au gratin and","useful":1,"cool":0},"G0WJsw72D0wl6fJ1US0f7w":{"text":"Really wanted to love it as it is a New Orleans institution but truth be told my steak was","useful":7,"cool":2},"ua60dPWtb7rdk1m_FXoOxg":{"text":"Great food, great friends.  We celebrated my neighbor's birthday here.  We had the back ro","useful":2,"cool":0},"4NARvsAPRAsdumzXzaSghw":{"text":"Terrible. The steaks were bland, unseasoned and terrible cuts of meat (2 steaks being extr","useful":1,"cool":0},"D6EtOCwHpNy6ThH9M31QKw":{"text":"This was our first time at this Steakhouse.  The selection was quite nice.  They did have ","useful":1,"cool":0},"VMeycOI4_G94v3L-MnONeA":{"text":"I am a fan of this restaurant. I have eaten at it many times.  The service was off, really","useful":0,"cool":0},"lxRW5Dmkz0XfZ006Rx2Myw":{"text":"Had not been there in years... Took 2 business associates there for lunch recently... This","useful":0,"cool":0},"q4c0uUQ-i6v7bCElJPvKVA":{"text":"I love Crescent City Steak House and if I'm going to spend royally on steak, I'm going to ","useful":0,"cool":0},"scZRf9cu0yHHeJIXMLYyvw":{"text":"I can't count the number of times I've driven by Crescent City Steakhouse without stopping","useful":14,"cool":6},"UseiJ33g84Jwsa-DkAZzLw":{"text":"I'd give them 2.5 stars, so I rounded up to 3 to be nice. It was what I expected, describe","useful":0,"cool":0},"ZhpDHJuO0xu4Wy2GadrcDw":{"text":"Unfortunately I would not be returning or recommending. I came here for wmy boyfriends bir","useful":3,"cool":1},"ZZTF0JbUJieTyThiocU9AA":{"text":"I do not even want to give one start for this restaurant because it was literally one of t","useful":0,"cool":0},"X2TlmtdlLCZxv4QAVXgcRQ":{"text":"An out of town friend and I visited here about 4 months ago and the food was horrible! The","useful":0,"cool":0},"Bfle9XM26jB2EzOpMG2G4g":{"text":"I've been visiting Crescent Steak now for the past three months regularly, planning to go ","useful":2,"cool":0},"gbzALJlffxxkTy0sOaNeeQ":{"text":"This meal was sooooo lovely. My boyfriend took me here for our Valentine's Day dinner. We ","useful":0,"cool":0},"YaIFBatcO5ZhHvCftTJrVg":{"text":"Our visit to Crescent City Steak House is always stellar.  Our server Robert was 5-star.  ","useful":0,"cool":0},"k19fCMplHlUznMF7uPYlUQ":{"text":"Hands down, the best steakhouse in the city. We've been coming here for years & wouldn't t","useful":1,"cool":0},"J_MkMuK_WxE8IH3V56EfUQ":{"text":"Been wanting to check this out. But like many places, I wanted to go with others. So we we","useful":7,"cool":4},"lGrjSu1AoCBVvk2avK_Sow":{"text":"Dinner at Crescent City Steaks in NOLA. This is where the locals go for great Steaks. It's","useful":7,"cool":5},"hEIzkonNb7WL72F4qg1Knw":{"text":"One and DONE!!!!\n\nA reservation was made for a party of 11 to celebrate my 61st birthday o","useful":0,"cool":0},"1sKs6tkRVYSsYQpQYNm6Og":{"text":"Food was good and the service was excellent. Mike was a great waiter; very friendly and co","useful":0,"cool":0},"PYWvGpKjL6m8OYutC0F-fA":{"text":"Came here on recommendation from our BnB host and could not be happier. Wanted to do a ste","useful":0,"cool":0},"AJQydIR7CoFvhubaejtZ6A":{"text":"Ate there last night with sister and brother-in-law and all of us enjoyed our meal. We sta","useful":0,"cool":0},"mb0FQS4lGoAp7W0o7XavEQ":{"text":"I'm not much of a steak person. I rarely eat it, but when a friend suggested Crescent City","useful":2,"cool":1},"9c-Zx2xYJ9qSIWqR6C-2jg":{"text":"Well this is definitely the place to come if you want good steak \nCan't wait to taste mine","useful":4,"cool":1},"4DRdpROKixF-htwyRXBWvA":{"text":"This is a great old school Mid-City steak house that has barely changed over the years and","useful":5,"cool":5},"yLlR1APdajzEFdjysXu_sQ":{"text":"This is the WORST experience and STEAK I've ever had. We waited a hour and a half for our ","useful":2,"cool":0},"pXG7uTLPtvYx1IH87v-j_A":{"text":"Just visited again and remembered why I love this place, could almost hear the ghost of Fr","useful":1,"cool":2},"__OnYkAwwts3r8cRzhISfg":{"text":"I'm not one to leave reviews in general, but this one was so terrible that a review was wa","useful":2,"cool":1},"PonZHD_L9dzVtyNbbsJcTw":{"text":"So we made a last minute switch to come here for a work dinner last night, and I'll admit ","useful":0,"cool":0},"4Ed1W-iFTrCPX4etbESFpQ":{"text":"I took my family to Crescent City Steakhouse this week.  This is my favorite restaurant fo","useful":1,"cool":0},"QJ3LpTTuKb6EnttAYxzxjQ":{"text":"How odd. My last review of this 'restaurant' was deleted.\n\nCame to this place and ordered ","useful":5,"cool":2},"1ENC2dvhRdXwUwJs1Jjf2Q":{"text":"This place is one of the best \"sleeper\" / time capsule establishments in the city . \n     ","useful":0,"cool":0},"xocSOF2Oa06F_za8lk2-nw":{"text":"A good friend made sure to take me to Crescent City last night as he was in the mood for a","useful":2,"cool":0},"BL7znDh0MZIwxra5Zhoh1A":{"text":"I was excited to be treated to what I would consider by others to be a delicious steak fro","useful":1,"cool":0},"lOjeCqKLfAX0qdXVXasI6Q":{"text":"Me & my husband's new favorite steakhouse! The service was great, the food was amazing, wi","useful":0,"cool":0},"bK4ZeobuWlbsZa3r8u3JlA":{"text":"Very old school Nola steakhouse.  Not much has changed since 1934 when the opened!  Beauti","useful":0,"cool":0},"rSYZmLCSP51JN1hI6hUFZw":{"text":"Excellent steakhouse.  This is the place where Ruth Fertel got her start.  Now she's gone ","useful":3,"cool":1},"fSM5nXG5asGzBa8THvapfA":{"text":"Do not go here. Went with large group (14 ppl, made reservations in advance). Took 2+ hour","useful":2,"cool":0},"DjztqFx_DWfVZ5Q-LitfUQ":{"text":"This restaurant is a unique experience everyone should enjoy. The owner, Anthony, personal","useful":1,"cool":0},"SkrFC57gs2uLxjhn-5l--g":{"text":"this is by far the worst restaurant that i've ever been to! the food was horrible and the ","useful":1,"cool":0},"GO8K1xm4gA-O2lebXq8N6g":{"text":"When we pulled in and parked, we were happy to see a security guard patrolling the parking","useful":1,"cool":0},"FMeyWrb2GuKeB45sNFr15Q":{"text":"this New Orleans old-school steak house is a tried and true staple.  Located in mid-city i","useful":5,"cool":3},"9mz6pbVUYzHM4JKOeC9-2A":{"text":"Just ordered 2 steaks for takeout. Prior to this, we'd try to eat there a couple of times ","useful":2,"cool":0},"ljWRpyJ6-cDD1ADEUS0-Kw":{"text":"Mediocre steak but delicious sides. Wished the steak was more flavorful and a better quali","useful":1,"cool":0},"BZBn6c8qoO7jORQzHzgxOw":{"text":"Without a doubt the best steak I've ever had! \n\nMy boyfriend has been wanting to dine here","useful":2,"cool":1},"QOCsJ8PmMwUa_s5sQuN-kg":{"text":"This establishment is a blast from the past with a great history. Inside it has been prese","useful":1,"cool":1},"eoQY6Rl_spYsFQrn-fkPcA":{"text":"I've been meaning to come to Crescent City Steaks now for some time and finally got here f","useful":2,"cool":1},"de346RGSoAhp14AIiWnSTA":{"text":"When pulling into the parking lot, I was pleasantly surprised there was an armed guard dir","useful":1,"cool":0},"Yn7ycHk5EqEtAKJLZ-0q3Q":{"text":"A classic New Orleans original opened in 1934. The restaurant has kept the same menu, alth","useful":0,"cool":1},"aqhVKS_6x6d7dY1gaku51w":{"text":"My special evening at Crescentl City Steaks was a bust. After years of hearing and reading","useful":5,"cool":2},"LjuhfMaVFo2aCq0ApbDPLg":{"text":"If I could give no stars I would but it's not possible so here it goes! The food was absol","useful":0,"cool":0},"rPBnZUpRrxsJ43o9p4RLmw":{"text":"Crescent City Steak House is a very old school, traditional menu. We made reservations in ","useful":2,"cool":1},"-2iDVonll-hLI2wdCeVF0g":{"text":"Grew up a few blocks from here and never thought about going to this place. Years after le","useful":1,"cool":1},"MM6o0n-SZ8ZwBd1iNcDaLw":{"text":"This is a nice spot!  We wanted steaks, so we decided to give Crescent City Steak House a ","useful":1,"cool":1},"KqLsx86I08PKYtflRx0VTA":{"text":"Mediocre and subbpar. I will detail\nThe shrimp cocktail were I 25-30 per lb which is nonse","useful":2,"cool":0},"wUTOmdkOv2XM8NwksvJ58g":{"text":"This place is so cool.\n\nI'm talking old school steak house with service that's out of this","useful":14,"cool":13},"PDH9rhNlU6DQPX2JMWzg7w":{"text":"This is a quintessential steakhouse and place to go in New Orleans. It's been there foreve","useful":0,"cool":0},"2vcF_alecAF5KvkMykc_9A":{"text":"Yes, you're reading this correctly: I, Joi B, mostly raw vegan chick, not only went willin","useful":24,"cool":23},"z2vdYDxpaDSYOIICoE5m6g":{"text":"The food was amazing and our waitress (Molly) did a phenomenal job.  Would definitely sugg","useful":1,"cool":0},"0Tcwde51WZtzc9zWz-hAng":{"text":"Very disappointed in all aspects of our dining experience at CCS. First we made reservatio","useful":0,"cool":0},"4RAtmw9RwDgc2kurHkFyZw":{"text":"I enjoyed the atmosphere and the waitress was really nice. I had the lobster and it tasted","useful":0,"cool":0},"MxJbbC_pmhdRhe2eK27uSw":{"text":"My only visit to Crescent City Steaks was on Mother's Day so it is a bit difficult to judg","useful":3,"cool":1},"k7paAneBfLS4BYofO45bOg":{"text":"Absolutely the worst meal I've ever had. The waiter was extremely good but the owner refus","useful":1,"cool":0},"_KxIdxIpKGMJBlAPTHpJ-w":{"text":"The husband and I moved to NOLA over 9 months ago. We have some favorite restaurants in th","useful":1,"cool":2},"MeMoMEuj8xFc17BtC3dgGA":{"text":"We've been coming here for years, and this place is consistent every time we go. This is a","useful":1,"cool":0},"0lsEYbqVMREqobOgHHrdLQ":{"text":"This is a great old school Mid-City steak house that has barely changed over the years and","useful":8,"cool":6},"85izXY7aBKltZ5cv0FTE7g":{"text":"Family owned. A nice place in the neighborhood to get a decent steak for a slightly unreas","useful":1,"cool":0},"1VALvT71-zyeiiCgWmniwA":{"text":"My ex coworker and I wanted to meet up for dinner and I decided to try this restaurant bec","useful":2,"cool":1},"e5vCLNv7AmfuPPHcacKirQ":{"text":"I was completely and utterly dissatisfied. Our waiter was amazing but the food was terribl","useful":1,"cool":0},"QTNhKDmKvKgcmDZnjYR0JA":{"text":"Our first foray out to a restaurant since the pandemic. We made every effort to take preca","useful":3,"cool":1},"wylliKj-i7r5qcMOdV-sdg":{"text":"Had heard great things...no...steak was tire tread and the sides were out of the frozen mi","useful":3,"cool":0},"GlityzC07yArpCRiOJR_sA":{"text":"Awesome steaks, great salads and desserts. Waitstaff was extremely friendly and knowledgea","useful":0,"cool":0},"C7PB8sJ_lxkZ8tls-U0wQg":{"text":"We dined here on Mardi Gras day in our ceremonious farewell to beef for the Lenten season.","useful":1,"cool":0},"lNdLc_ulOIwHWK4VF58Vsw":{"text":"Incredible steakhouse with curtained private booths. Such a Fun establishment, as intimate","useful":0,"cool":0},"PVBkgSFvUDz06L_ETeJqLw":{"text":"I visited this restaurant while traveling for business. The garlic bread was nothing speci","useful":0,"cool":0},"4vKADxqe8yaqI5VRlxUuGQ":{"text":"Came again last night.  The filet was excellent!  The au-gratin potatoes were good, as wel","useful":1,"cool":0},"lvVw6viUFVD4M_2hn5_4xg":{"text":"Definitely no social distancing. The restaurant is very crowded. You are close to other gu","useful":2,"cool":0}}