{"6gFywVtRDQFEHyCZUMJXOQ":{"text":"I'm not one to visit cemeteries often, however, I did willingly visit this one. My visit w","useful":0,"cool":0},"IaxOCO-12lmaQGwTVgQOSA":{"text":"It's a cemetery.  Very huge and lots of unique tombs to view.  The area is kept clean and ","useful":0,"cool":0},"3KhQ3v_Waq792bQU8jdhFQ":{"text":"This is the best cemetery in NOLA if you want to take photos. You can also drive in a car ","useful":0,"cool":0},"bgNe2ed-dXwLSoDlYxq3AQ":{"text":"Very nice cemetary. We visited the grave of an iww member named covington hall. It was rai","useful":0,"cool":0},"NTdYr2t_Eg4fIaba_LoE0Q":{"text":"I am a cemetery nerd and love New Orleans all the more for it's unusual old cemeteries but","useful":4,"cool":2},"dZH09IAoXfBGy13OLf3UHw":{"text":"If you see any cemetery in New Orleans, let it be THIS one. It's about a 20 minute drive f","useful":4,"cool":2},"H1BIZgNGA4FEoOZ5a0LwBg":{"text":"Amazing and peaceful! Away from the hussle and bussle of downtown. Well kept and beautiful","useful":2,"cool":0},"S6hqmzNwjAdjmFpQiCj-vg":{"text":"This place is absolutely beautiful. Very well manicured and clean. It was such a sight to ","useful":1,"cool":1},"OCPQl82NTMBOudzQjOU0nA":{"text":"For you tourists coming into the Quarter/CBD from the airport, this is the HUGE cemetery o","useful":25,"cool":18},"wLZIbuGjP8jkK6jNczwmUg":{"text":"I like Metairie Cemetery so much that I did my 6th grade social studies project on it. The","useful":10,"cool":6},"oZriChX8S2j2XNc2lCQ1Sg":{"text":"This Cemetery has been on my list of places to visit in New Orleans, it seemed like the pe","useful":2,"cool":0},"1jnWIJRKxUdfJ9zKg7Zdow":{"text":"Well if you want a huge status symbol for the afterlife... this is where you are going to ","useful":2,"cool":3},"B8pro2OIbB1MTHgwHuZ-3w":{"text":"If you are into statues and unique buildings and experiences this is a great place to visi","useful":2,"cool":0},"QPuwZ6x3ZHJmpRCA1ul_Og":{"text":"Metairie Cemetery is one of my favorite places on earth. That might seem kind of odd to so","useful":8,"cool":3},"kCpfb7BGlUb-Q1u_U4Gmhg":{"text":"The Metairie Cemetery was one of the rare places open on Christmas Day.  We decided to mak","useful":3,"cool":2},"OF_NSeqOjtHQXDIEVrcGtQ":{"text":"Metairie cemetery is very well kept and a beautiful place to explore. So many old New Orle","useful":3,"cool":2},"hU5PJIA21nqyq5uDiF05OA":{"text":"We went in search of Lucy Parlange, the folk inside helped us find her family grave, it to","useful":0,"cool":0}}