{"RsFkUFi9HnZPNo5LI5AOCQ":{"text":"This resturant is beautiful and the food is amazing! The house bread is so yummy, as well ","useful":0,"cool":0},"COiTKJ0vPLQoq3oIJ7gnvg":{"text":"I can't say enough nice things about Meson!\nThe armosphere is fab! There is a spacious bal","useful":1,"cool":0},"eTM4mqPYlWRv2C-Muzi4lg":{"text":"I came here to grab dinner while my friends were passed out in the hotel room....it was a ","useful":0,"cool":0},"Dmxz_SCrE6XtzoMHnzqyuA":{"text":"Food was very good - nicer restaurant with higher prices and limited specialty menu - grea","useful":1,"cool":0},"1gwHXP5TNDtJAkdcVX2sCg":{"text":"Dinner with friends and associates here was so fun! What a great place and the concept of ","useful":0,"cool":1},"b_TdvYF-wFnyzABWAbUAEQ":{"text":"Grrrr Brad, I thought I'd get a 1st to review on this one!\n\nAnyway, I dined here last week","useful":2,"cool":1},"RvoGzt1pPH6vcRSOCA4NOg":{"text":"This is a small trendy bistro on S Peter. Walking in, there is a very modern feel and a sm","useful":2,"cool":0},"4FT-EWQ5LPaCobRMxJa6WQ":{"text":"Delicious Food and a nice atmosphere.\n\nThe bartender was pretty cool. I got to meet the ma","useful":0,"cool":0},"Hyb894E9tKcSxN88XkqVeg":{"text":"I was in New Orleans for business last week and ate dinner at Meson. I like the look and f","useful":2,"cool":0},"cUjxV2TgM9xaZxEHyi2k7A":{"text":"I am a big fan of Coolinary season, and I try to take advantage of the various prix fixe m","useful":0,"cool":0},"5mTom_0HcuJLNL8Y-nPXrQ":{"text":"Whoever put Meson in the Cajun/Creole category is clearly snorting drugs cleverly disguise","useful":7,"cool":2},"vWpFzwrEHdHQ29XQ2rtlaw":{"text":"The food was high quality but the ambiance was a bit overdone for our tastes and the serve","useful":1,"cool":0},"8fcwmY2zWa3SawHb79cmdQ":{"text":"What a wonderful and chic restaurant. Great place to have a sit down dinner or a drink and","useful":0,"cool":0},"hJMLCAdhazltj_djs313Ow":{"text":"Amazing! Makes Emeril's taste like McDonalds.","useful":0,"cool":0},"NG2Xxou7r9eFOYC8z6mFiA":{"text":"My overall the experience at Meson 923 was wonderful - they serve great food and are staff","useful":1,"cool":0},"Rui6yA8C_I5lD3qMkZ-Giw":{"text":"It is tough to review this restaurant since every few months it changes again.  The latest","useful":1,"cool":0},"txPfOSBdxeePbT8BNqWg8g":{"text":"Meson is the most amazing restaurant in New Orleans right now. It was fresh. Unlike many o","useful":0,"cool":0},"omPcH5RRy3fMGMH_Oil7cg":{"text":"I finally got to try this place and thought it was pretty good. A solid four stars for the","useful":0,"cool":0},"dceMF-SQn-NKqINBoDCMOA":{"text":"The service was great, the food was awesome, and the drinks were fabulous. Between the two","useful":0,"cool":1},"UBuLaJqlVorg2YnhqvhQHw":{"text":"WOW !!!!!!!!!!........Quite different than your average trendy restaurant.......Its like a","useful":0,"cool":0},"HSdX5GHAumofvYMPUQeStA":{"text":"forgettable.","useful":0,"cool":1},"HTtqfjKlpgS5PQkal3b0nQ":{"text":"One of the most unique restaurants I have come across.  No prices on the menu.  At the end","useful":1,"cool":0}}