{"RILjKUGEoOHhp8oRG9-2XQ":{"text":"The fish was dry, overcooked, no sauce or flavor. The lemon wedge was old and hard, could ","useful":1,"cool":0},"1uZ5w3CfYGqOj9BH_PsRpA":{"text":"Established in 1840, it is noted to be one of the oldest family-run French restaurants in ","useful":1,"cool":1},"Zb_74KaPC4XrKhdYTrxcXQ":{"text":"Service was impeccable.  The servers have mastered the art of being constantly present and","useful":0,"cool":0},"EmBWMrkk1SGICrkUBf2Dgw":{"text":"Oh wow it's been a minute since I've actually dine at Antoine's. And when Re suggested tha","useful":5,"cool":4},"a6lCQKwVXUnuFoFkzn850Q":{"text":"Hit this on a Friday night (without reservations!), so they directed us across the street ","useful":0,"cool":1},"T5rFvVWiFVoAUd6TzpBb2Q":{"text":"Food was classic fare, building is amazing, oysters Rockefeller originated here. I can see","useful":0,"cool":0},"JkHLEHvBKZ616acsn8V0gA":{"text":"I was going to rate Antoine's as one star, but my husband and my daughter found their meal","useful":0,"cool":0},"uUWLpZIZte4b9ELlBXMPXQ":{"text":"Firstly, I would like to mention we just left the restuarant about an hour ago. I wanted t","useful":1,"cool":0},"QKRzoawueoki22wD_toJSQ":{"text":"Overrated and over hyped!  Can get much better food for much less.  Tourist trap at its be","useful":0,"cool":0},"jAKqkFNdYqPEPAu4GHmTPQ":{"text":"Old New Orleans is right.  You wanna dine in the splendor of the nineteenth century?  Want","useful":3,"cool":1},"fl5gH_tml_EHvRSOFfz36g":{"text":"Had to try this place as recommended by a client.  My wife and I were a bit under dressed.","useful":0,"cool":0},"9Eh_B4Tb9K8cRVqj1qmVew":{"text":"Horrible service and horrible 'customer service'.\n\nEveryone has heard of Antoine's Oysters","useful":3,"cool":0},"s4_MV1EwywFCCmpnzpgXdw":{"text":"Good food, gear service, very interesting location.  There is a lot of history in this res","useful":0,"cool":1},"0PslAoAQ0_3mswcRjMuT-w":{"text":"Came to NOLA for a Bachelorette Party and decided to do brunch here one of the days. We we","useful":5,"cool":0},"mLycHlgo6nIxiQhewXuisQ":{"text":"This restaurant has an amazing history. Founded in 1840 and Its seen the history of the Ci","useful":0,"cool":0},"GSYYdgFc7EUhSVv4PSXzvA":{"text":"Had a very good lunch here in late-February....hadn't been here since my previous trip to ","useful":0,"cool":0},"xuImPx3U0UKtxbS-fKwi7Q":{"text":"Had brunch, food was barely edible.  The Shrimp omelette (shrimp tasted like it been in a ","useful":0,"cool":0},"rIV12MLHSkGe1H-UQN1ZaQ":{"text":"For a restaurant that came so highly recommended by friends, I was disappointed. Beautiful","useful":0,"cool":0},"dVIfQksJmdAVraLZFZNLBw":{"text":"I've wanted to dine here since I was a teen and read \"Dinner at Antoine's\".  Coming to NOL","useful":0,"cool":0},"6eWCWgozo3M36dC-W6r5Hw":{"text":"Charles was our server.  He was the best of the best of the best.  I have never had servic","useful":2,"cool":0},"xbK381y76ITBhPXL5SxFrA":{"text":"The history and staff of this place is remarkable I highly recommend anyone who visits New","useful":1,"cool":0},"iyck-D4nDermw4jJFAS_5Q":{"text":"We had our best meal in New Orleans at Antoine's $20.12 lunch special, complete with $.25 ","useful":0,"cool":0},"VNv9A_9FD94CFvf8ewRs4w":{"text":"I came here for lunch with the friends that I was in town with on vacation. Our first tour","useful":0,"cool":0},"AEOiZI0Rq8aj32ubpbowUA":{"text":"THE ABSOLUTE BEST. We recently had our Wedding & Reception at Antoine's and worked with De","useful":0,"cool":1},"1A5Q-Lx1y9fABizdu0oPCg":{"text":"My God, this is TRUE classic New Orleans! Really, this place is amazing. \nOld school no do","useful":10,"cool":5},"qzb3zu_5z6z8ZChT8iziJA":{"text":"It's hard for me to review Antoine's because my experiences have been very varied over the","useful":2,"cool":1},"yzAo8GBT5CYxnQ85fEeXKw":{"text":"Quarter Martinis and Lunch Special\n\nWe started with the martinis (pear and lemon drop were","useful":2,"cool":1},"L_KH8DxiZtFfhyecCa7hFw":{"text":"So we came for the jazz brunch, which sounded really nice online. When we got there we lea","useful":0,"cool":0},"YxukSFPuWy60eq9I3r70AA":{"text":"Great bar and bartender (the real deal).  When asked his speciality, he made us the best S","useful":1,"cool":0},"gtOaZYO4g-06EkweQGIMPA":{"text":"old atmosphere--feels historic, and apparently the birthplace of classic creole food?  had","useful":1,"cool":1},"CpyDURyVvBW_d49tIhM-ag":{"text":"Interesting bites of potatoes.   They go well with the Sazarac which is really tasty.    T","useful":0,"cool":0},"lge__ZnYBWdftjFhTxQo4Q":{"text":"For the past 20 years, I've listened to my husband rave about his first and only other exp","useful":1,"cool":1},"NxlQUArOyuCYJy_yq0laBA":{"text":"Meeting for dinner with our friends from Texas, we were once again a party of nine, and se","useful":0,"cool":0},"g5NiWjlkzgaQzhyzw46hWg":{"text":"My husband and I were lured in here by the waiter standing outside, offering some cuts of ","useful":2,"cool":1},"K3zdvkLJtX5Fqelp-1Z-Lg":{"text":"Was super excited to come here for our Anniversary dinner. Love the ambiance. The drinks w","useful":2,"cool":0},"bpdeD7e7I1H3RrIPzswsnA":{"text":"This was an excellent experience. Had the Gumbo, Potatoes, Warm Chicken Salad and it was a","useful":0,"cool":0},"PIZSIXFSX3ceVti6hvWyWw":{"text":"I was so disappointed in the service at Antoine's today.  They sat us in a room with a lar","useful":0,"cool":1},"fFCoe5hKsd1Y8XJNt1Z5UQ":{"text":"What can I say... Went twice while in New Orleans since the service and the atmosphere is ","useful":0,"cool":0},"G_LtZnL66Iwama_7_FCLUQ":{"text":"We have been here for an hour and a half and JUST got our first course; our dining room is","useful":3,"cool":0},"anvNkjMQmsa1nlxP6RZ55g":{"text":"Antoine's was recommended by one of the locals.  It's the oldest French-Creole fine dining","useful":0,"cool":0},"yTXY3T0rKiiMptYr9Iv44Q":{"text":"This was my first time dining at Antoine's, but we had heard many good things about the re","useful":3,"cool":3},"N5ngvbLwIwDLQ5dYQ7ldWQ":{"text":"5 stars for fantastic service. Darrell was attentive & graciously shared with us some uniq","useful":0,"cool":0},"gYyrhMH3bLG0-UQzXWLg1A":{"text":"This place is amazing, literally the best mea I've ever had in my life. Went twice in thre","useful":0,"cool":0},"bYA0JCYy2gCtAMWoTZGdVg":{"text":"This was our \"fine dining\" destination that we planned well in advance, on our first trip ","useful":0,"cool":1},"u81v2r7oSOYV03vEHCk-Hw":{"text":"Went for our 10th wedding anniversary. Open Table said they had made a reservation in my n","useful":0,"cool":0},"56gpWokH0aRtSlkwsZshbA":{"text":"I had wanted to like this restaurant. I really did. \nWe were going to be late for our rese","useful":1,"cool":0},"Y_NNGiCvbY4MDhqUl0Y0Rw":{"text":"We went here for brunch because it was less expensive than the dinner menu and I am glad t","useful":0,"cool":0},"05uD2t8H0WhGbG4svSJgnQ":{"text":"Wow. This place is AMAZING. We had the \"COOLinary\" menu, which was an appetizer, entree, a","useful":2,"cool":1},"MeEGqVPz5BnEubIP1PraxQ":{"text":"In a word - horrible!!! The food was terrible, the prices high, the portions small, the se","useful":0,"cool":0},"HY5VepDwZDy3GlqT1vdRDg":{"text":"Came here for the 2015 lunch special and loved every bite. The charbroiled oysters were to","useful":1,"cool":1},"dV7VhxrKkr_cz36yekQl_Q":{"text":"I read a review on here that says the service at Antoine's is a \"time honored tradition\" D","useful":0,"cool":0},"uwJSY9TjeZvu_8elx_-EVQ":{"text":"We were really looking forward to the dining experience at Antoine's. Anthony, our server,","useful":0,"cool":0},"lu7AhVEorKEm8m0evsTSBw":{"text":"Fantastic location, fantastic vibe, fantastic food and super fantastic service by Eddie.  ","useful":0,"cool":0},"FZFOhD7RH03PYjRI0h5QzQ":{"text":"Beautiful historic building.  Total tourist trap.  The kitchen isn't trying because they d","useful":0,"cool":0},"hW-jiykaWA3cTHaPn4lQ-Q":{"text":"Amazing service and food. You'll be treated like a king or queen. Ask to get a tour of the","useful":1,"cool":0},"ysh3F-Y3rDHa0oqN-ZOTxQ":{"text":"Been sitting here for 20 minutes with no acknowledgement from anyone. The servers are walk","useful":1,"cool":1},"eD8kA0mm7gs5kBN_zlM7rw":{"text":"I went here expecting great food, but it was just good. The place itself is very impressiv","useful":1,"cool":0},"r9SI0lh2iilC3gECqU-0-g":{"text":"Cool old school New Orleans eats. So much has been written about this place so I'll just s","useful":0,"cool":0},"MCEbjAITdQ7RPYeHsgqXMw":{"text":"I can't believe this restaurant doesn't have five stars!!! Matthew, the general manager, g","useful":0,"cool":0},"O7TGujz-OwDZ8NbYUuDEtw":{"text":"Had a group set up in the Rex room for the luncheon special. Soft shell crab was awesome. ","useful":0,"cool":0},"qB3y_jtjHBgo3PoDW3JvtA":{"text":"Don't go to Antoines unless you want your credit card compromised! That is what happened t","useful":0,"cool":0},"mcAwEDcUEzx3swh0ezr_qA":{"text":"To be fair, we had no entrees, just tapas, apps, oysters rock, and shrimp cocktail.  I lov","useful":0,"cool":0},"il_jOUXxVqX0u4SHSYW6iA":{"text":"Excellent, traditional New Orleans restaurant founded in 1840 and still run by the origina","useful":1,"cool":0},"PBaXgw4078DrlsU3u1lDcg":{"text":"Crabmeat Raigotte was great. History was refreshing and traditional New Orleans. Food was ","useful":0,"cool":0},"xS7_Hjqp6PPu77IxuDbSrQ":{"text":"Went here last night with my family, boyfriend and his mother. We were seated right away i","useful":0,"cool":0},"ovo7ghw_dI3qhQ_XMWIl-g":{"text":"I went here with my mom today for Sunday brunch, and it was a mixed experience. Our waitre","useful":2,"cool":0},"VNbDw4hYcPq0CsEMutJvKg":{"text":"Went here for the $20.10 lunch special and 25cent martinis. The service, ambiance and espe","useful":0,"cool":0},"SulPaxW8z8wxNrMQsqiRlw":{"text":"One of the most excellent restaurants I've dined at in the French Quarter!! Absolutely top","useful":0,"cool":0},"3877O-gHrsoMbEUnMuagKQ":{"text":"This is a perfect restaurant if you enjoy French/creole charm and food. The chargrilled oy","useful":0,"cool":0},"_WY6YiHaiWgrdBj_yXfdaw":{"text":"Walking towards another restaurant we stumble upon Antoine's and noticed the lunch pre fix","useful":1,"cool":1},"80e7pTJKrYakOgMzTQlnVA":{"text":"Oldest continuously operating restaurant in New Orleans.   Amazing experience.  Note.  The","useful":0,"cool":1},"IC02TmV-NnqzMpLuFOx31w":{"text":"Upstairs dining room with the full extent of all the hospitality that NO-LA can offer. Inc","useful":0,"cool":0},"Dn4IO4678jDMW3fQ43aHsA":{"text":"I wanted to give Antoine's two stars, but considering the prices I just can't.  The food i","useful":0,"cool":0},"TJL4OLcp042r9g3IhcaYzQ":{"text":"Amazing service food great always a good choice in the Quarter, great history you can walk","useful":0,"cool":0},"YFcyEINJ-nhLs7cuIxjnzQ":{"text":"I realize that this restaurant has been around for 160 years but that how the food looked ","useful":0,"cool":0},"mrCPiQ-0PjhoKbVJui62QQ":{"text":"This place is amazing. Oldest French Creole restaurant in the quarter, awesome fine dining","useful":0,"cool":0},"ATtnp87vr73uOTbwlaC20A":{"text":"It was with some trepidation that I reserved a table at Antoine's, especially after having","useful":3,"cool":1},"ShMlR3rcWUgNhcOsSfuFLg":{"text":"So this place is part of New Orleans history, it is literally an institution, i don't thin","useful":0,"cool":0},"yFMwSKUOxYThlrcypfrCxQ":{"text":"I'd like to dedicate (read:blame) this review on my husband since he chose this place. Let","useful":0,"cool":0},"jASCnJ3dxgi5MOyIP-Jptg":{"text":"Finally had the original oyster Rockefeller. It lived up to the hype. Truly amazing. A mus","useful":0,"cool":0},"_4eH8N6gY-Qc2CD7ql7ykg":{"text":"Antoine's was average. The gumbo was quite tasty but the rest of the meal was lackluster. ","useful":0,"cool":0},"EC1HhW8mkWpw1EGUc0GSJA":{"text":"Old classic!  Four of us had dinner on a very busy evening.  We were not in a rush, but th","useful":0,"cool":0},"v5Mh3fHEEnUVcDXMggrmZA":{"text":"You can't beat the $20.18 lunch with $0.25 martinis.  We got the oldest waiter and he was ","useful":2,"cool":1},"SL0Vm46-e9AwdtwL5R4OaA":{"text":"Amazing! My husband and I went to Antoine's for a date night and had the best experience. ","useful":1,"cool":0},"TUxZ0vVpA0BZmY49i2pGDw":{"text":"Sometimes the service makes 'okay' food, 'great'. Antoine's staff make it known they appre","useful":1,"cool":0},"azAqGmu6N33u6vEoA38fTQ":{"text":"Been to Antoine's many times for dinner but the summer lunch special was pretty bad. The c","useful":2,"cool":1},"zJsXC4Zy4rQQ6ayG9iZpcA":{"text":"I treated myself to a belated birthday dinner the day after. I was ready for a foodie expe","useful":0,"cool":1},"gRcSvXpkEKEX1AE77JFDMw":{"text":"Had a good meal, but I got the feeling that there are two levels of service here - one for","useful":0,"cool":0},"zyUpNEki4NKpfzcpcT3wTQ":{"text":"Went here with great expectations based on all the hype.  Big, big, big mistake.  There we","useful":0,"cool":0},"g0rsW8tHTdyd2ZFfq0nKYg":{"text":"Antoine's has fantastic food and ambience, but is unfortunately lacking in the details.\n\nI","useful":0,"cool":0},"Elz6Vs0bxlHDCBiHBsSdeQ":{"text":"Awful experience. Came here for dinner on a Tuesday night, the host could not find out res","useful":3,"cool":0},"kW8yFVpxVZ6hD1NcjNjfjw":{"text":"I was sooo excited to go here because it was my first time and I heard so many of my frien","useful":0,"cool":0},"mO2TG16UhFMgjBJNzdVEzQ":{"text":"Walked right in the front door with a warm greeting from the host. Promptly sat down to a ","useful":0,"cool":0},"hhHJDjdVUk0VMLTRYBFcgw":{"text":"Great food from start to finish. Started off with amazing cup of gumbo. Then ate the filet","useful":0,"cool":0},"f-1E_3SrmZe9lIcFFn9BYw":{"text":"Antoines was our last meal for our long weekend visit.  Tried the \"coolinary\" special that","useful":0,"cool":0},"gickFRbjQ_8YorCleO-P8A":{"text":"Every good thing you've heard is true. Authentic fine dining in the heart of the Quarter, ","useful":0,"cool":0},"CpgfRrJD2UnOCZZwtCW2Vw":{"text":"One of the most memorable restaurants I've ever had the pleasure of visiting. Not only is ","useful":0,"cool":0},"8WW2aIbxOsRTCrzqLmshAg":{"text":"Biggest dissappointment in New Orleans. We were ushered past scores of empty tables into a","useful":1,"cool":0},"xklX_isolUusg_SPt5guAg":{"text":"Very good NOLA iconic restaurant. Great touches with the numbered card on your Oysters Roc","useful":0,"cool":0},"N2ETfZW2aMVdA0p8A90ojg":{"text":"This was my second trip to Antoine's. The first of which was for lunch. We were seated aft","useful":0,"cool":0},"2pidckOuqresUT2bF_duww":{"text":"Its a touch of American history so it has to be worth while. But after the history lesson ","useful":1,"cool":0},"z7BlACFnw2KDJo50Q0t_2w":{"text":"My mom's side is from New Orleans and this place is famous no doubt. I was definitely expe","useful":0,"cool":0},"-V3kDGPnT5PGMPMDZhdNcQ":{"text":"Wonderful restaurant. Fancy as they get. Our server team, Vinnie and Nicole were warm and ","useful":0,"cool":0},"Vde6EgpxwbiPHQVlVReRwQ":{"text":"Outstanding service. It was our waiter's 50th anniversary at the restaurant, and he at lea","useful":0,"cool":0},"kKmviK6s4525BXRmTOR97g":{"text":"This was an experience. We ordered the lunch special which was a 3 course meal with 25 cen","useful":0,"cool":0},"CzuaclaxaMBcI_emCxt-Yg":{"text":"The food was delicious, the atmosphere was quiet and lovely and our waiter was on top of h","useful":0,"cool":0},"Sgj5-rGVXV6KdHBIgb1kNg":{"text":"Antoine's really doesn't disappoint with it's $20.12 lunch menu and .25 cent martinis!  I ","useful":2,"cool":0},"N3F_udikEjMigJuttiv-tg":{"text":"Some of the sour puss reviews here remind me of reviews I have  read of the classic Prince","useful":0,"cool":0},"xBIq1Qf6rpKdP7at2Nn02A":{"text":"Great selection of fishes, chicken, and steak dishes.  Service is exceptional, and do save","useful":0,"cool":0},"U94AJsmqlo5JCki6pOEZbg":{"text":"I must say five star experience all around from start to finish. When here for lunch yeste","useful":0,"cool":0},"2akEMq4tinL-gHsVD8Rb1A":{"text":"We had two good meals here, Saturday lunch and Sunday for the jazz brunch. \n\nThe food was ","useful":0,"cool":0},"fOF9HajS5AyJqhK19DXl8Q":{"text":"We went here for brunch on our last day in NOLA.  This restaurant has been around for awhi","useful":0,"cool":0},"hsp3r6JRXJzAB2pjJa5fCA":{"text":"Food is good, prices are beyond steep for what you get. Oldest restaurant in the US, with ","useful":0,"cool":0},"aVWoaa5cJ5vebbHaoH40PQ":{"text":"Great history here and a very friendly waiter in the bar area - he was a docent of sorts f","useful":1,"cool":0},"c5k_-b8KzkSQG6X02vFW0w":{"text":"Went to lunch at Antonines and got the lunch special.  The food was good and service was f","useful":0,"cool":0},"POtJ48pcR0Bafs5UOTcNCw":{"text":"You can feel the history in the food and the restaurant itself. We did the summer lunch de","useful":0,"cool":0},"n4TgifMyrnwStT9Bx6spoQ":{"text":"I am so sorry - my review was not for Antoine's but another restaurant.  We did eat at you","useful":0,"cool":0},"mAUTWmna0KUrvOqQaAL1cg":{"text":"The catfish platter was excellent start to my trip to the big easy. Definitely  a great pl","useful":0,"cool":0},"N4X7p_2OaAlQGgYwlZ1Dig":{"text":"Antoine's has been around too long and has forgotten to evolve, particularly with service.","useful":1,"cool":0},"c5KNHTdIyD2ion4X6vVAJw":{"text":"I dined here with a large group on Thursday evening and the only  redeeming  thing about t","useful":0,"cool":2},"lnwlyuka9aBE6eHXrwQnvw":{"text":"OK so it's been around since 1840 and some of the wait staff are originals. I love to see ","useful":2,"cool":0},"D_QLMy6nO9V8K29qBRaxAg":{"text":"I have to say I was a little disappointed by my dinner at the legendary Antoine's in New O","useful":6,"cool":3},"zT64d3uVMx0Utmhb4P_FBw":{"text":"Beautiful, wonderful but get out your credit cards cause it's going to break you.had a fan","useful":0,"cool":0},"97qu3gS1aqBJTiKtyFiyxw":{"text":"We had our first ever dinner at Antoine's on Tuesday evening and what a wonderful meal it ","useful":0,"cool":0},"o86O2NWxzHvm7EcThOFI8A":{"text":"Pretty disappointed with my experience at Antoine's. I was there for a birthday party, and","useful":1,"cool":0},"F7OxL8XZDIY_yldNVAufqg":{"text":"Semi-fancy, yummy food, good drinks.  Ask to sit in the big red room, the other rooms are ","useful":1,"cool":1},"Cc_MhuZtE48-9Q6_vUwrTA":{"text":"We went to Antoine last night -  we were a party of 4. And on business accounts so we need","useful":0,"cool":0},"1Au5H8KXniFRUH2TiMEBdw":{"text":"So far we have been to Commander's Palace and August and to explain this restaurant in one","useful":3,"cool":0},"ucqaeKlhCchDcgqLSZkWLQ":{"text":"I went here with my mother and a friend for my birthday. It was so wonderful. I love the h","useful":2,"cool":2},"jbSJoys4f6C2SVByUdRlSg":{"text":"The food was ok. How they can make a dish spicy yet bland is beyond me, but they accomplis","useful":0,"cool":0},"2YBV73S0NNRdQ9bj5Q8lZQ":{"text":"Service was amazing and attentive. Atmosphere is interesting and historical. \nI ate in the","useful":7,"cool":0},"6nGpb6NsFzFSAx_cfa6sTg":{"text":"I can't recall a time when I've been more disappointed. I came to New Orleans for my birth","useful":11,"cool":0},"QhFp6WvMtcQhJguqutq4iw":{"text":"Jeffery, our server was excellent! Great lunch special. Can't beat the 25 cent drink speci","useful":0,"cool":0},"CFRL7iQ9v9WH8IBQROOMPg":{"text":"Do not! I repeat DO NOT EAT AT ANTOINES. Just don't. Waste of money, time and breath. I co","useful":0,"cool":0},"p6nGw319MhszvQEeZbx6FQ":{"text":"Over priced, over hyped CAFETERIA FOOD. I even heard a guest at a table next to me complai","useful":0,"cool":0},"1NQ0d1iQnr6R41w-wZ_82g":{"text":"The service is spectacular, they were very attentive to us but the food could of had a bit","useful":0,"cool":0},"vvCnKpLIUSn6vd03gs0bQQ":{"text":"Just walking into Antoine's makes one feel like they are actually stepping back in time to","useful":2,"cool":2},"2XTJ2eu1ZB3IthDjb0HEGw":{"text":"Everything we ordered had a problem, and at these prices you expect much more consistency.","useful":0,"cool":1},"FWPIt49RWfgYH-tzg88_8w":{"text":"Antoine's isn't just another New Orleans restaurant. It's an experience where you are trea","useful":0,"cool":2},"yX0VlkhQBdQn-MLfV2LYsg":{"text":"Horrible meal at Antoine's .\nFood was not great.\nworst oysters Rockefeller ever.\nChuck, th","useful":3,"cool":1},"Q_omA9h-gFkDG4d3uL_XeA":{"text":"Had a very weird experience here earlier this year.  First off, the food is only mediocre ","useful":0,"cool":0},"cepqwWIHtPLXrpm2uU0Y4g":{"text":"4 stars here for their service, oysters are good and at lunch get the $.25 drinks. You wil","useful":0,"cool":0},"v49ukVNKTsKUgUSboG-3aQ":{"text":"Believe the bad reviews!  They are all true and would probably be more plentiful if people","useful":3,"cool":0},"CZvgRWAZeUcNnMTLX0tzkw":{"text":"We went for the lunch special and enjoyed ourselves so much. Very attentive staff, and del","useful":0,"cool":1},"fqJb5uwL6t0qi2su_cnjPQ":{"text":"I'm sure there was a time when Antoine's defined the classic New Orleans dining experience","useful":1,"cool":0},"pjOMBI_cdWg3FcG7_Pd_bg":{"text":"When we heard Antoine's was a fifth generation restaurant, it was a must try before going ","useful":0,"cool":0},"4dqFKFy-ynfqayPRstSoJg":{"text":"The food was tasty, but our second waiter (trainee waiter?) declared that he was sick \"it'","useful":0,"cool":0},"mtTRcjkYARmxC5peROmQVQ":{"text":"Antoine's is a New Orleans institution and an absolute must as an experience.  Reservation","useful":1,"cool":0},"lmfA_YZ8Ql5XCPxUJP5J-A":{"text":"$20.17 three course lunch & 25€ martinis....eat in the bar... Shirley is a trip! Great att","useful":0,"cool":0},"VruHBySWCkxMEh4zxcF1iQ":{"text":"Went here together with my family to have a dining experience of NOLA's oldest restaurant.","useful":0,"cool":0},"7hM83YGja2VFpKOVFmL9uA":{"text":"Antoine's carries on but this lady is tired.  Wait staff did an admirable job keeping the ","useful":0,"cool":0},"7iz6yG6Jbb8dNaD36l67HQ":{"text":"The service has deteriorated a lot. The food could have been well presented and tasteful b","useful":3,"cool":1},"_69nwkZwWi1-ZTSldbCEKA":{"text":"This place is so awesome I framed my menu (well I'm planning too). I was on a walking tour","useful":0,"cool":0},"_DriPmPzgItObX1sSo-paQ":{"text":"A New Orleans experience - a little dated and expensive if ordering off the menu, but the ","useful":1,"cool":0},"Re9E-kAY_ASrfJzHc5iarg":{"text":"This historical restaurant did not disappoint.  I was in charge of booking a large group d","useful":0,"cool":0},"ybzw-oegqUr-U-hgcmHFgw":{"text":"A group of 6 of us dined here last weekend and we thoroughly enjoyed it.\n\nThe French Quart","useful":0,"cool":0},"1l1GSGQLULJnay1Tw4uxWQ":{"text":"I went over to the bar area to order some appetizers and a drink. Since they invented the ","useful":0,"cool":0},"QQMIZj72gqe_lpfj_q96dA":{"text":"This is probably one of New Orleans oldest and most iconic restaurants steeped in history ","useful":1,"cool":1},"YB7AhKifBqxo8VFPyjei7g":{"text":"Very disappointing. The oysters Rockefeller finish was hard and the flavor was offensive. ","useful":4,"cool":1},"S-bFs0FVBurwJxKhrH7NWQ":{"text":"Hier gibt es eine gute Küche, natürlich auch zu keinem billigen Preis. Lieder lies man uns","useful":1,"cool":0},"_mMirDN_0m39eOy0fr-rNw":{"text":"We dined at Antoine's for my daughter's 21st birthday celebration. We had a truly memorabl","useful":0,"cool":0},"xH7BrDMxZ-0HxqTqqAMavw":{"text":"Great cocktails and old line French cuisine.  It could use  some renovating but it is stil","useful":0,"cool":0},"sBqhR_j4ebdM4HDOyLfTBw":{"text":"Our family went our first night in New Orleans, and glad we did, because it was definitely","useful":0,"cool":0},"4MRsIrdhbAnkc0a2u7kUzA":{"text":"This by far was my favorite restaurant in the French quarters. The Food was amazing. Our w","useful":0,"cool":0},"xDNNkM5u1_ic7FucTAGQ-g":{"text":"Absolutely wonderful experience\n Food and atmosphere were very good. I'm from New Orleans ","useful":0,"cool":0},"D8w59IWWvXbsNwEKUpkNbg":{"text":"Went today for \"Jazz Brunch\" when we arrived we were seat in the back dining room which wa","useful":0,"cool":0},"sgtu9n5imrV_3EJOcUyX0Q":{"text":"First: a lot of these reviews are complaining about the quality (\"just ok\") of what they f","useful":2,"cool":0},"5GVxp6KAXJPAnOgoji2y7Q":{"text":"I was here in March when they were open for lunch.  I had a round of all 3 lunch specials.","useful":0,"cool":0},"mI_Zc47zuwaAmrz9zlrpPg":{"text":"I didn't love Antoine's. I think I must prefer newer, innovative food over traditional one","useful":3,"cool":0},"wgEHMSs7DuDia1oQNS8icg":{"text":"Rich in history, disgusting in price and low bar in food flavors.\n\nRich in history, that's","useful":0,"cool":0},"8PD2ZoB49UClFfcFmd1Cag":{"text":"Huge disappointment after seeing great reviews in various places online.  Antoine's clearl","useful":7,"cool":1},"iUfsV7T5wwAY0stcJTWv1A":{"text":"Upscale restaurant that had so much history. We ate in the bar for lunch and had the Oyste","useful":0,"cool":0},"qRkdhWhTsCPbApcE1YEN7w":{"text":"I went there in April in a sad bad compelled mood the place didn't help. The restaurant fe","useful":0,"cool":0},"ISBNlOp6tFtmomnqBQAPTg":{"text":"I hosted a private dinner here last year for 30.40 people.   From the start, the meal as a","useful":0,"cool":1},"f4kcV1uPYWqmEi6WXqHhgQ":{"text":"I don't take the time to write about restaurants often, but tonight was worth the time.  I","useful":2,"cool":0},"PpDqdh8OQaQdry7F42G2cw":{"text":"Antoine's' service is impeccable in every regard. Charles, our cuisine custodian for the n","useful":0,"cool":0},"vcYS8Ny23AcEoFDN5_qvEA":{"text":"This place was amazing. Charles Carter was a fantastic server and host. Thanks so much for","useful":0,"cool":0},"UIa910zVsEIaXy94LBnmXg":{"text":"The flaming baked Alaska presentation was amazing. The food less so.  The crab appetizer w","useful":0,"cool":0},"55Mcxf2nhQ-VDs0mwnOKGg":{"text":"Good food, great cocktail (French 75 mm mmm) and great service. It's known to be the oldes","useful":0,"cool":0},"Z7AMfXq6UAdUYpCoQiCUKw":{"text":"Quick summary:  This is, hands down, the most amazing dining experience the wife and I hav","useful":3,"cool":2},"vb1JvlsCUg80Y0LOJ_YKqw":{"text":"Finally got to experience my first time here over the weekend and I must say it blew me aw","useful":1,"cool":0},"etw1qB22yFkAUnSYPAXa3w":{"text":"Definitely overrated. Food was so bland. Waiter got the order wrong which cost us more mon","useful":0,"cool":0},"ge-QJncFEXt1Z9fdJDlMvg":{"text":"One of the best restaurants I've been to in a while. The gumbo was great, but not the best","useful":0,"cool":0},"zXwA4qF4pwjTxsTGlL9k9g":{"text":"Went for Saturday lunch. Had Alligator soup with sherry, a meaty soup, followed by a local","useful":0,"cool":0},"S7EzQ-i56fIj4JXqdg4y5w":{"text":"We had our wedding rehearsal dinner here. It was amazing! The service was awesome. Everyon","useful":2,"cool":0},"YexlVYzYVhejLFzwjZo4sQ":{"text":"My wife and I were married in New Orleans about a year ago and we were fortunate enough to","useful":4,"cool":2},"CIQEFMlwj2PV2EXDEXJg6Q":{"text":"Best SERVICE ever - - Bradley was the BEST server I've ever come across (and we eat out a ","useful":0,"cool":0},"WiOYXYGZywSdD4qdq6mhsQ":{"text":"No concept of customer service. I saved for years to visit NOLA. Top of my list was to eat","useful":2,"cool":0},"0d6vAMMFaDNtis_M_gAeSw":{"text":"This is a very nice piece NOLA restaurant history.  Price point is high but food and servi","useful":0,"cool":0},"P8-BKFzCtK_ADXc9u15W2Q":{"text":"We came here specifically for the café Brulot, where the presentation was awesome!  Our wa","useful":0,"cool":0},"Od3nmmiWYS2xaFeS-v6U8Q":{"text":"While this restaurant has been around for many many years, the dinner that I just had was ","useful":1,"cool":0},"TJJg8s4yHgruwkEmQb5tKw":{"text":"Just returned home from my first trip to New Orleans. Enjoyed the Sunday Jazz Brunch at An","useful":1,"cool":1},"Y7lopABsLR_PVpKrQqFulQ":{"text":"My boyfriend and I came here for dinner and we didn't know men had to wear pants and a col","useful":0,"cool":0},"14iTXcjimUhdpaDn7DxDAQ":{"text":"We had such a terrible dining experience this evening and sat next to a couple with an equ","useful":3,"cool":2},"4EVpqc1FrxlBQ0PG3Smj6Q":{"text":"Save your money and go somewhere else. Everything here is extremely overpriced. Food quali","useful":0,"cool":0},"v-HmzXi9tL5HdfCa6UmzgA":{"text":"Antoine's is by far the worst restaurant experience I've ever had and for someone who eats","useful":1,"cool":1},"Pfc0q6KeN6NSjIO9PSyRYQ":{"text":"The history and dining rooms were fun, the service was below average (tried talking us int","useful":1,"cool":0},"wcKTb4hPG_pi7eJ9p9C6lw":{"text":"Horrible service, waited 2 hours and 15 mins for this fatty ass chewy lamb. Not worth the ","useful":0,"cool":1},"eqlENDc3JqqwHxgendWXHA":{"text":"Very elegant and stellar facilities. Staff is top notch. Oysters Rockefeller is the best o","useful":0,"cool":0},"PoCvPXF-NAvmBibLZ4YZTw":{"text":"Came here for my birthday lunch and I felt like it was hyped up for all the history behind","useful":0,"cool":0},"u8x2LCXrKYYnV5gaq8U36g":{"text":"The gumbo is excellent!! My husband had the trout almandine - best EVER. I had the $20 lun","useful":1,"cool":0},"DKCOQmSvSzK2Xg_3UrLFyQ":{"text":"Great lunch special. 3 courses for $20.17 but the ambiance leaves something to be desired ","useful":0,"cool":0},"5S93EY4MAt2Dd9VGRmiBeg":{"text":"Very nice Summer Special lunch. 3 course all of which seemed prepared to order and all bee","useful":2,"cool":2},"b-bjgSIdp-OI3qYgULxVgQ":{"text":"Their lunch special was hands down the deal of our trip. $20.18 for a three course meal wi","useful":0,"cool":0},"HsCnpvJaHZWuV_GssaYVYw":{"text":"This restaurant was on my bucket list.  What a major disappointment.  I truly believe this","useful":1,"cool":0},"TAGf2z0Or8WhgoFveSv41Q":{"text":"We had reservations and were seated in the first dining room.  The tables and chairs were ","useful":0,"cool":0},"MCsS-4BYcFtcTllfP8rh1w":{"text":"Despite the negative reviews we decided to eat here. What a disaster. We sent back our app","useful":0,"cool":0},"59MSvaPbkKqm3BvgzLV6Rg":{"text":"A wonderful dining experience.  The $20.25 lunch is one of the best deals in NewOrleans.  ","useful":1,"cool":0},"HetnNZn8h1A1CSFY6BmuBg":{"text":"It started off as any other night in Nola and as first time visitors in this great city, W","useful":0,"cool":0},"PQeJAEg0QrR3Ai8rRZqHcA":{"text":"I've had the pleasure of eating at many of New Orleans' great restaurants but I would not ","useful":0,"cool":0},"zpSSzpnZhfKVWlZ7P4wN1g":{"text":"Very disappointed! We are from Louisiana and appreciate good local food. First, we had res","useful":0,"cool":0},"tA6HBh8t050I3kWoE__bZg":{"text":"The ambiance and the wait staff make this place.  The earlier review that stated that you ","useful":0,"cool":0},"qTe5MYjMEDbeJFCj59LpCg":{"text":"I visited this restaurant in a tour. It's a huge, elegant restaurant with 160+ years of hi","useful":0,"cool":0},"cHubi6ai_fug5DlgCQwYCQ":{"text":"I wish I'd read the other reviews before going. I took the advice of a native, but she has","useful":0,"cool":0},"Avu8KlVMBqeglm4PRvdaaw":{"text":"Where to start????\n\nThank you Anthony Bourdain for the recommendation from your show...\n\nT","useful":1,"cool":0},"HP-6wifyi-Zd685C4WtArA":{"text":"I give the service 5 out of 5 stars and the food 3 out of 5 stars. The servers always had ","useful":0,"cool":0},"Z9-iPP_jVqZS6ORtyQ67sA":{"text":"Antoine's is like no other and has been for a long while. I wish I could remember the name","useful":0,"cool":0},"aAebQ0g3iX-bQ22bdyiLWw":{"text":"What a great restaurant to visit in New Orleans. I am a big foodie. I usually judge restau","useful":0,"cool":0},"DWu4IC7Xrfu4Tzk8hBJoDw":{"text":"I have dined at many exceptional establishments all over the world. Some good, some not-so","useful":0,"cool":0},"yTOaLccwoWZFvgEWz37GHg":{"text":"I usta eat here a lot, about 10 years ago. Then the food kept going down hill, in 2008 I s","useful":0,"cool":0},"JsostYnFKswWxVHGtG7O0g":{"text":"There aren't a lot of bargains in New Orleans, but the $20.18 -- get it?? -- lunch special","useful":4,"cool":4},"yoIRApK9p5RykA1KAu3Vfg":{"text":"Wonderful lunch experience . Their special holiday dinner is $110 a person so we went to l","useful":0,"cool":0},"d7Jw2tCm7ENoha8tuS2ncg":{"text":"I also got sucked in by the Bourdain recommendation on his show.\nAnd yes, the special dini","useful":2,"cool":0},"w3ddsoUk-twbaEduxCkcgA":{"text":"My mom and I went here for lunch and both ordered from the $20.14 three dish lunch menu. V","useful":0,"cool":0},"CGipYB-f8RI8NeBqGvk0tQ":{"text":"Honestly, the food wasn't that great. Although the service was good, the food wasn't that ","useful":0,"cool":0},"BYR0W7c5pBb8tJGCxx8k_w":{"text":"This is Old School New Orleans at its finest. If you're looking for $1 shots and crappy fr","useful":2,"cool":0},"mwLAC23opUrrhhahY3RQmg":{"text":"You know...it's really not that good, despite it being famous. The food is all \"okay.\" The","useful":2,"cool":2},"znqnp63OOPnmP1Px8nJVkg":{"text":"I would give it 6 stars if I could! Our best NOLA food experience. My husband and I had th","useful":0,"cool":0},"gmZJiPVSaZ2S6zewYd4ABg":{"text":"Amazing service by Sterling Armour (server with 10 years in this establishment) great pre ","useful":1,"cool":0},"nACUOHzAFha0O7C29ZyZKw":{"text":"What a disappointment! has really gone down hill. been here several times,but tonight I wa","useful":0,"cool":0},"RqXK7H55c2gK9aafWRz8PQ":{"text":"I feel bad saying anything good about this abominable tourist trap, so i will refrain, and","useful":0,"cool":0},"6MOXD_T9sqEUsESjFX05Bg":{"text":"First dinner at this restaurant during our NOLA vacation. \nFirst of all... our waiter Mich","useful":1,"cool":2},"AJ2_qh0PzRfoCqlhOkm4Ow":{"text":"Awful meal. Cubed potatoes, broken and grainy hollandaise, a tough skin on the Oysters Roc","useful":0,"cool":0},"WxmQGT8CMQKABIbwBNNfPg":{"text":"Historic, beautiful and great eats. Service was impeccable. Tip of the hat to Terry and Ri","useful":0,"cool":0},"prmsd8qjwHFkkUkRS4CyKQ":{"text":"I went with a college reunion group, and this expensive meal was pre-planned with very lit","useful":0,"cool":0},"tAwdYP17JPObRpuG4QqMaQ":{"text":"We came here with a group of 8 for brunch. We made reservations in advance based on a reco","useful":1,"cool":0},"dnyKuskXnpoIg3S1FFvLpA":{"text":"My friend was very excited to try this restaurant again after eating here many years ago. ","useful":0,"cool":0},"uRfM6Hn_p2oyYu7SueuMRQ":{"text":"I had very high expectations for this place, it was good, but not great! The service is go","useful":1,"cool":0},"U6DD-QWz3-ezO7zGS_qeWg":{"text":"Complete waste of time and money!  This place was awful.  The service was equal to the foo","useful":3,"cool":2},"-LiOG9moWBwVhGX0TUS76Q":{"text":"We ate Brunch here today, and I was so pleased, I had to Yelp as soon as possible to reaff","useful":2,"cool":2},"p47ms5iFmHFHxnznFSIUVw":{"text":"Now I know everyone or just about everyone has said Antoine's is not the same and has gone","useful":0,"cool":0},"BPj9oUMqnieMUQtqrnru5Q":{"text":"Went to Antoine's for lunch and tried their August \"Coolinary\" Menu -- three courses for $","useful":1,"cool":0},"WjABDyWNsz1adF-ErtgTWQ":{"text":"The food is very average. We went during the lunch special ($20.17 for a three course meal","useful":0,"cool":0},"37OC1scmjob6AEFQXID67w":{"text":"2nd visit to this beautiful restaurant and was more disappointed with dinner as last year.","useful":0,"cool":0},"UvX1SHWOL9C1rpiIp4JDsQ":{"text":"The prefix lunch here is the perfect way to introduce a newbie to New Orleans. The food wa","useful":1,"cool":0},"5vJ8ev7gyx3CPgT8MvFJ9g":{"text":"I ordered the Trout with Almonds for my first meal in nola, per my waiter's recommendation","useful":0,"cool":0},"89PCv8292yGFl9rzyQd0Uw":{"text":"I enjoy fine-dining and to me this was all that it was; 'fine'.\n\nThe food was good, the se","useful":2,"cool":0},"b_3IlRcARSHoFIm-GFOyqw":{"text":"I really don't care what anyone says about Antoine's. It is a classic, terrific restaurant","useful":4,"cool":2},"ziwgTVUfeysquXXK3xCkyg":{"text":"So this was my first time to this restaurant which claims to be the oldest family owned re","useful":0,"cool":0},"wzJLr3xO8jNmUuAN7eyrow":{"text":"TLDR; there are other places in New Orleans with a better fine dining experience, but no p","useful":0,"cool":0},"m1yRUToaqBPWQN8tNwBdgA":{"text":"After one dines at Antoine's many times over several years it takes on a new place in one'","useful":4,"cool":3},"YkkwLgCTE66c-Yc96B_Iqw":{"text":"Lunch menu and service are modestly done and reasonably priced. We appreciated the cool se","useful":1,"cool":0},"4p3TnALvCviYmg2I2rvKSw":{"text":"So many restaurant choices in the French Quarter, but this one was very impressive. The di","useful":1,"cool":0},"Cr5m5TlQQhVCA5nGBO_mUQ":{"text":"We love oysters and with Antoine's creating the original recipe for Oysters Rockefeller, w","useful":2,"cool":0},"0_82XMwIO8QODObNugrXrg":{"text":"Usually enjoy Antoine's but the service today was beyond AWFUL.  The $20.18 lunch is a gre","useful":0,"cool":0},"WiH_NdMpFcC8kF8ej-y6QA":{"text":"The decor was very old fashioned French style. Waiters are very neatly dressed and helpful","useful":0,"cool":0},"ZD1SRC8ppf1viDBK6CQx9A":{"text":"Sunday Jazz brunch was delicious and service was on point. The petit filet was cooked perf","useful":0,"cool":0},"4HaEOkb81c4CqAYOye3bsQ":{"text":"Everything was good but overpriced. The fish was fresh and cooked well. The restaurant is ","useful":0,"cool":0},"RIVupQv4MGpqjX9Y0E05fA":{"text":"This restaurant was incredibly disappointing. In particular, the food was extremely medioc","useful":3,"cool":0},"WZWFm7icF6bOzU5P7wMHfw":{"text":"Gifts of cash and a gift card totaling 140 dollars were stolen.  Also, the 47 dollar plate","useful":1,"cool":0},"A9eFUixC_J_t-koijhPJkw":{"text":"This place is the ultimate tourist trap. The physical place is quite interesting, a bit of","useful":1,"cool":0},"6nPMQC-kpRrbPQzUwUMMcw":{"text":"There were no redeeming qualities to our meal at the restaurant. The wait for the table wa","useful":0,"cool":0},"TB73h-lNYp32YslsujSaKA":{"text":"For this place to be a landmark establishment, not to mention the prices they charge, ever","useful":2,"cool":0},"3rQPqY96r600sGl-OKCS0Q":{"text":"This is my absolute favorite place to eat in New Orleans, I have never had a bad experienc","useful":0,"cool":0},"enuYvCTNLQxBkX_0dNME6g":{"text":"When I dined here 8 years ago, it was an elegant, indulgent experience.  I was so excited ","useful":1,"cool":0},"GcNJlslMBGxyRjueFH54uQ":{"text":"What a great experience start to finish! Our new friends mentioned they were going to dinn","useful":0,"cool":0},"6pF5ZSA26Nz4BGPfxWsUZA":{"text":"Antoine's is to New Orleans like a good friend. It is always there supporting and helping ","useful":11,"cool":4},"DgQh7OhaNQmS3gFcygCuLA":{"text":"Great service. Really nice appetizers. Entrée was OK but dessert was really good (baked al","useful":0,"cool":0},"yjCBQMwGangL9MXurst6AQ":{"text":"Best food we've ever had in the New Orleans staff was fabulous took us on a tour can't say","useful":0,"cool":0},"pjCr3T61l-xOIWXd1DcCZg":{"text":"i went to enter the restaurant, and the host found it better to have me wait for him to fi","useful":3,"cool":0},"G9soGJR3QU-gJ8f8gtNvUA":{"text":"More tourist trap than fine dining establishment. Dress code not at all enforced. I felt o","useful":0,"cool":0},"NXZkEyBgNllXkUslz-DE3Q":{"text":"Antoine's is the pinacle of creole cuisine. If one does not enjoy the food, they must not ","useful":1,"cool":1},"9G6u0qblAh8N77aaANLHpQ":{"text":"We came here last night for a friends birthday. While I didn't expect great food, I was lo","useful":3,"cool":0},"zk6ny_UqUVfSEK3NAt_Zew":{"text":"As a local, I would never go back here. What a circus of service. Food- I could make bette","useful":2,"cool":0},"DF33JuWdaOthdTZKUaMEKg":{"text":"No concept of customer service.  I saved for years to visit NOLA. Top of my list was to ea","useful":0,"cool":0},"ZHk-1NLAwKqAMgpm0E2oSA":{"text":"This place was amazing. From the food to the decor, to the history, to the wine, to the se","useful":0,"cool":0},"OM6e7pbAlkJra7riWmpHEg":{"text":"Best wine steward ever- even took us down and showed us the wine cellar.  Oysters are fant","useful":0,"cool":0},"6kPE2CQ8Sizoi26GI-hvWw":{"text":"Came here for a private dining with a large group of people and I will say, this place rea","useful":0,"cool":0},"35mo-iqisYubmw8j_KEavA":{"text":"I was invited here for a business dinner and had heard about its history and all the dinni","useful":0,"cool":0},"5uioIXwi4r4F84o2S1INTw":{"text":"We flew for the day to have a New Orleans experience ! The service was great but the food ","useful":0,"cool":0},"cvSnwvumnHxxXf7k-wicsQ":{"text":"This extremely expensive restaurant is steeped in over 175 years of history. The food is g","useful":0,"cool":0},"PaokyKrp-Bql8RyXOt4bIA":{"text":"Lacked any concept of fine dining. I'm writing this from the urinal, the last refuge from ","useful":0,"cool":0},"YkDIA9Ex0hHIU9_0vBMA1Q":{"text":"Well......I struggle to find words to describe my feelings about this place. Here goes not","useful":2,"cool":1},"2iSN_o8h1VCLGcOqdcLoJw":{"text":"Visiting Antoine's on Mother's Day for brunch was truly an amazing special experience. I h","useful":0,"cool":0},"NSkUtoYKgLrymlQUhPxAKw":{"text":"If you're coming to NOLA you have to stop at Antoine's. It's a staple. We came for Sunday ","useful":0,"cool":0},"j1c6Sj5aqNa5lti1RcgTOg":{"text":"We (wife and I) went here in 1990, and had the best restaurant experience we've ever had. ","useful":0,"cool":0},"99ctmi5A-_OZxiI0rMpLAA":{"text":"Really great, fun, and attentive service. Food was awesome -- went and got the lunch speci","useful":1,"cool":0},"GSv67ne4P8ckOjZALVG49Q":{"text":"TAKE THE TOUR! Ask your server for the tour after your meal, its soooo worth it. I love se","useful":1,"cool":0},"VcFvr7a1jIjmu3Q4BnKXKw":{"text":"I had heard about Antoine's over 20 years ago on my first trip to New Orleans, when we did","useful":4,"cool":1},"a-Up6E9Q34J0cGB5NUwWBQ":{"text":"This is strictly about the tour of the humongous restaurant and Sterling Amour, the server","useful":3,"cool":1},"FRm7rHIRTREEN8yvcB_pjQ":{"text":"This review goes out to Sheca...she wasn't our waitress BUT she should've been.  Service i","useful":0,"cool":0},"tqrUnvGWcMCz61MiD4J0Kg":{"text":"Old, tired, and definitely past it's prime:  all good ways to describe this French Quarter","useful":2,"cool":1},"MsNFD4KuTQHsw6Mn_A_tCw":{"text":"The worst meal experience I had in town.\n\nFacts, considering arriving the day after thanks","useful":1,"cool":1},"IH-ugLmslxZsyPDz-9TY4g":{"text":"With so many terrific restaurants in NOLA--such as August, Revolution, and Patois--why bot","useful":0,"cool":0},"0RtZPsM7eGaTNDrwrlE9bw":{"text":"I had their summer lunch special. Three course lunch for $20.18. Great value, made even mo","useful":0,"cool":0},"LHoSjiQfTtQHc_JMNQcbAw":{"text":"A must have is the oysters. I had the pork tenderloin it was cooked perfect. Must try it i","useful":0,"cool":0},"z_yEvvz6fPkZsCzU488RGg":{"text":"Great restaurant, location, and atmosphere. Service is good. Onion soup was amazing, but m","useful":0,"cool":0},"NkHzaoOAaDCyzQiolI1UtQ":{"text":"Guess you need to go there on the tourist circuit, but wow, so disappointed. Terrible serv","useful":1,"cool":0},"7hzNnF1xF59Tt2tibCc8MQ":{"text":"Wonderful! Old world charm. The lunch specials are tasty, good value and fair portion. An ","useful":1,"cool":0},"-rsyRLAzjK2a-i1zaq_llA":{"text":"order the steak, it was the best. don't order the fried soft shell crab, that was terrible","useful":0,"cool":0},"TtEc7rfifaX50Mz2xDIP8w":{"text":"Yuck. An yes, I went there. This beautiful, New Orleans staple has nasty food and sub-stan","useful":2,"cool":0},"q0M-zLu90VcU96OGDFaaiw":{"text":"Overrated, had a bland shrimp appetizer followed by overcooked fish that smelled like it w","useful":0,"cool":0},"sILPi5S_9rUhlwI6HZy24w":{"text":"The baked oysters were poor. The appetizer of crayfish was lackluster and poorly presented","useful":0,"cool":0},"iNo5spPCvMzKxdyD7GVCgg":{"text":"Dined here a few months ago. Like eating banquet dinner food at two-star hotel. One dimens","useful":0,"cool":0},"VqhSaQFkVKXoj4pauzZRDg":{"text":"We had a lovely experience today @ this famous New Orleans French Restaurant .The staff so","useful":1,"cool":0},"RDXLYJYn8x6i87kE_aXEYA":{"text":"If you have the money to spare on an expensive yet fantastic dining experience, then steer","useful":1,"cool":1},"qzqYBLjkY7BCThKRgG5Qug":{"text":"been here during vacation - the quality of these French-Creole cuisines is worth the wait,","useful":0,"cool":0},"35RWP3PhoVN5NJpHKT-o3Q":{"text":"Antoine's  is a place you should at least go inside and check out all the beautiful decor,","useful":3,"cool":0},"GVl7QoNJA_ybjCBlJKpSQA":{"text":"wow\noysters rockafeller were invented here, and they definately have a very RICH and compl","useful":0,"cool":0},"2M7_QFJzBQoaT5Apvb1hFA":{"text":"Food was totally under my expectations, I was disappointed with the steaks, no seasoning, ","useful":1,"cool":1},"ehDQx5G4EqCI0IwpsYjAuQ":{"text":"This was my first trip back to New Orleans in about 15 years and obviously the first after","useful":0,"cool":0},"Z6SintY0OEICMgfBeZuHYQ":{"text":"Went for lunch but also as a bucket list of things to try.  We did the escargot, oysters R","useful":0,"cool":0},"WKdfMfbi_oEiteGTE9nJ7A":{"text":"oh how painful it is to write such a well deserved bad review for this grande dame of New ","useful":4,"cool":1},"48YX1TF0dUAJ5CkuxEy0rg":{"text":"My husband and I both had the trout.  Unfortunately, it was the driest trout almandine I h","useful":0,"cool":0},"UMJHfJIwIbAUxqHgEz5nGw":{"text":"Late on a vacant Monday evening our party of 8 was left to hunger and thirst in a far away","useful":0,"cool":0},"n8G0OHradPd3RV7bQy_4iw":{"text":"I ate there twice on my visit to NOLA last spring! The crab is to die for, the Pontchartra","useful":1,"cool":0},"V8tm6d654URqbsq_nNp9Gw":{"text":"We came here on a recommendation, and not by choice.\n\nWe ordered: \n\nAppetizer- the rockfel","useful":1,"cool":1},"aorquLFGSAifykoxqOqThg":{"text":"Our tour guide told us about the $20.14 lunch special for which we are very grateful. \nWe ","useful":0,"cool":0},"ZLkDImwHrejmktrhoYIDzg":{"text":"The food was decent, but we mostly came here b/c of it's history and location. We sat in t","useful":0,"cool":0},"M23quJm1d_hcNdRAOy0B9w":{"text":"Don't miss historic Antoine's for lunch - where else can you get a three course meal serve","useful":0,"cool":0},"Cet64UxhwL497c9ZShUJZA":{"text":"we went for lunch - because it is an institution in the  french quarter.  My wife and I or","useful":2,"cool":0},"Vj9juen6dh7r3vZFYWd8aA":{"text":"Oh hell yes.  An iconic Nola institution, established in 1840.  Of all the times I have vi","useful":0,"cool":0},"UxppdFx3W3D_F4JsPUt9vA":{"text":"I love Commander's Palace and this trip I was determined to try a few more of New Orleans'","useful":1,"cool":0},"zEb4Kkc-MrGZjzry8Qf57Q":{"text":"My husband and I had seen the restaurant featured on Anthony Bourdain's show, so I was a b","useful":1,"cool":0},"QhmccYMElm3yMHnJcWzaMA":{"text":"The history and atmosphere are the draw. The food was mediocre at best. Nothing stands out","useful":0,"cool":0},"O2TA0tPjoMOq4vYt2iVjQw":{"text":"Antoine's reminded of the White House restaurant in Anaheim! They are both very fine estab","useful":0,"cool":0},"5EEdRbZF0t7yig34ypI8-Q":{"text":"Amazing food. Beautiful decor. Fun history. Great and friendly staff. A MUST if you enjoy ","useful":0,"cool":0},"nXn1kti11Zh97JwCLyCMSA":{"text":"We had the 20.17 meal. It did not disappoint. The bread was amazing and the 3 course meal ","useful":0,"cool":0},"IdTaJGNhmrhFVigLAk6azQ":{"text":"What can you say about Antoine's?  I mean, it's the oldest family owned/operated restauran","useful":0,"cool":0},"Cy4vCEYPV929LL1-zEZTsw":{"text":"Get the pomme souffle.  Interesting potato puffs with a hollandaise dipping sauce.  My wif","useful":0,"cool":0},"pP33noey73g-iPx3rIBhnQ":{"text":"Lunch!!!  We went for lunch because I wanted oysters.  I was very pleasantly surprised tha","useful":2,"cool":2},"ke5oq_NckTQ-__z3JFHPvw":{"text":"The food here is an embarrassment, especially given the high price. With the history this ","useful":2,"cool":0},"ZFTcKe3Os8-B3zEqkrz7qQ":{"text":"Antoine's is claimed to be the oldest, running restaurant in the United States. It has bee","useful":1,"cool":1},"RktjbNh7M6xLY0Y9d_RovQ":{"text":"This place had been talked up for me for a month, so perhaps I walked in with great expect","useful":3,"cool":1},"CZDqhOqavHhXeVNiNPMQYw":{"text":"Tried it out during a conference stay - sloppy, slow service that was also inaccurate (wro","useful":0,"cool":0},"mtrJLDZU4G873x-b551qrw":{"text":"The worst Oysters Rockefeller I have ever seen or tasted.  \"Original\" creation or not, one","useful":0,"cool":0},"Uq51sE-3mD6hI5mnHqxkug":{"text":"What a disappointment.  Invited by a good friend to join his party for a Saturday night di","useful":0,"cool":0},"6OiG0clVA5GS9cwS2J05Cw":{"text":"We were excited to try this place and it breaks my heart to say this, but sadly it was ver","useful":0,"cool":0},"gVWec5Bl3O2R5V2Px827SA":{"text":"What can I say about this world class restaurant that has not already been said?  Well, if","useful":0,"cool":0},"xzY2iFoohb0h6OlJ00CENA":{"text":"Wow. What a bunch of snobs. I asked the bartender if he could make a Cafe Brulot for me be","useful":9,"cool":0},"qf-rB4vQ-1OSGHO5FPBW7g":{"text":"I was here with a group of roughly 30 people.  I almost always trust the Yelp reviews.  Th","useful":1,"cool":0},"aYlHdd0RXZKa4gFttY2JbA":{"text":"The one and two star reviews of this historic, fine dining institution were apparently wri","useful":5,"cool":2},"sfxnOw3tSv8ggbjG13JVlg":{"text":"In this our first visit and only for appetizers, we really enjoyed ourselves. \n\nA classic ","useful":1,"cool":0},"qTuVqfIyJ2vLJkaxV2AbDA":{"text":"After reading so many great reviews about this restaurant, we were pretty excited to visit","useful":3,"cool":0},"psRR-q-4GdXVlKhdzkOUHg":{"text":"We visited New Orleans from Milwaukee, and Friday lunch at Antoine's was our first meal in","useful":1,"cool":1},"ZVl50T-Xw7obBBpttR4xCA":{"text":"It seems to be the course of my experience that the old guard of French dining (Le Bec Fin","useful":1,"cool":0},"mHCrjMUXzZns9FHfnPA1cg":{"text":"So this place was probably the best surprise of our trip! We had no lunch plans and our to","useful":0,"cool":0},"oFMz-Ysc2uzhXp_PkEvPFQ":{"text":"Atmosphere of the bakery was great! Quaint little place to stop in for pastries and coffee","useful":0,"cool":0},"R_QnA1AIzowZss3f09LPIQ":{"text":"This place was awful and really expensive. It may have been in business for over a century","useful":4,"cool":1},"KR2gJpe5FmxgLkwJ9LMicg":{"text":"You know that show on the Food Network called The Best Thing You Ever Ate?  The Huitres a ","useful":2,"cool":2},"aW2G-3vokEduy6UrUUIpPQ":{"text":"Their winter weekday 3 course lunch special was amazing. First time having soft shell crab","useful":0,"cool":0},"0RW3ZoIF2aUOrvF_Q4EMRQ":{"text":"I have spent countless hours researching the history of Antoine's. I have menus going back","useful":2,"cool":0},"nh_Cu8lb6NIAe8vVlh9EfA":{"text":"Went there on our first night in NOLA\nThere was a private party going on, and it was empty","useful":0,"cool":0},"8kwLZNXFarT9PERoMRalgA":{"text":"We were seated immediately upon arrival for our 8:30 reservation.  The restaurant was not ","useful":0,"cool":0},"1jpM7b0iBelROHp7TjpjqA":{"text":"How do they keep up the food standard for decades? Jumbo was delicate and creamy. Pompano ","useful":0,"cool":0},"qFrz4igF2vQA8dH8k6dc8w":{"text":"Oldest restaurant in the French Quarter and rich history make Antoine's a great place to d","useful":1,"cool":2},"RXk-xWBYxX0bqrjleDTbpg":{"text":"We stopped in for the lunch special, it was our last day in New Orleans and had so much go","useful":0,"cool":0},"xu7X0eXCupv1D6UPhuSuLg":{"text":"Get a reservation if you want a good table, this isn't a \"been drinking up and down bourbo","useful":0,"cool":0},"Plb301BpOncgUtFoBfodRw":{"text":"This place is indeed half museum half upper crust dining establishment.\n\nWent with a group","useful":0,"cool":0},"NU9Do56VK8AhBUtKWQAebg":{"text":"It's been quite a while since I've been to Antoine's, and nothing much has changed. That's","useful":0,"cool":0},"et_3SOoy7e4XquJurTvFrw":{"text":"It's like stepping back in time. Our waiter was Sterling who has been there 45 years and h","useful":1,"cool":1},"GYm7vNbpFISYefnGy21ibg":{"text":"Food was ok, wait staff was not very good. I'd heard how amazing the wait staff was and we","useful":0,"cool":0},"hrgcos-cR8nwtllP-iUr7A":{"text":"OMG!  Best experience of our trip.  I had chicken the BF had a ribeye.  He claims its the ","useful":0,"cool":0},"v6o6ut6trPOFNGo75OuqvA":{"text":"The food was ok. I had the oysters which were ok and the drum fish with crabmeat. Service ","useful":0,"cool":0},"O5YFsxKDawz-Z77yN8WlRA":{"text":"I had never been to this restaurant until last night. I will honesty say I regret having s","useful":3,"cool":0},"pRac_bHGAd6B1hgfC0mGSA":{"text":"Ok WOW. this place is definitely a restaurant that I'll remember forever. My friend and I ","useful":0,"cool":0},"NHP_YejGAEwKBJVni__-aw":{"text":"This place is the French Quarter's best-kept-secret in terms of having a decadent lunch wi","useful":1,"cool":1},"xIm6XyGY8UcFW9F-ETG6vw":{"text":"What a place! So historic and so full of genuine charm. The meal was perfectly prepared an","useful":0,"cool":2},"BKQCc3HMSUfDIwsZ6YjUYA":{"text":"Maybe this was a down day but I left the experience with the impression that they are way ","useful":0,"cool":0},"uz_chitzIQh98Ln185jphA":{"text":"Lovely lunch!\n\nWe started with oysters which were wonderful. I then had crawfish etouffee ","useful":0,"cool":0},"XW5kX8Sb2SAHeUaT0bleWw":{"text":"Like you, we were drawn to this place for its historical significance and old world grande","useful":0,"cool":1},"6D0zbFasAsYwOIw-KcQ9MQ":{"text":"Had an excellent meal, Charles and Joshua gave us great Service\n\nit was the first time i h","useful":0,"cool":0},"vlL11UJP4ggJgVQksp4tgg":{"text":"Went for the spring lunch menu and $0.25 cocktails. The experience of eating at Antoine's ","useful":1,"cool":0},"99jGyfVc_3MuuUZESzNUHw":{"text":"I cannot imagine who would give Antonio's less than 5 stars.\nI walked in for lunch and was","useful":1,"cool":1},"BiGWgalmfohVUcObrXTjHw":{"text":"Arrived in Nola for the first time! Ate here.. The soup could have been more dense. It was","useful":0,"cool":0},"mIw528bVmoYmw6KyzE39ZA":{"text":"Just ate there for a group dinner.  It's a large historic place with cool decor but unfort","useful":0,"cool":0},"HiW2c1KKrxHgYckVhNkXaQ":{"text":"I went with a friend to give the Winter Special a try and all of it was perfect.  As an ap","useful":1,"cool":0},"DFzkLAAa1sck5VU_CHe2Fw":{"text":"A disappointing lunch experience, not sure why we went here considering the average review","useful":0,"cool":0},"Tua3ogMGF3Ew8FNLFCPD0Q":{"text":"Was reading my Frommer's guide to New Orleans and this was listed as one the oldest and mo","useful":3,"cool":2},"Rd-ckzHUhsDdEtmtjuo0Kw":{"text":"Closed on Friday for 2016 Marcie gras for a private party:(   don't understand who they th","useful":0,"cool":0},"hnixL2CPocOqn5kl_cmR4g":{"text":"Our food was delicious. The escargot came pre-shelled. My friend had the shrimp cocktail..","useful":1,"cool":0},"YWWivkTdoMHeJhnQWJ7oYw":{"text":"Oh dear. The only thing this place has going for itself is its history - and that its in t","useful":2,"cool":0},"CU2Eq-QYu4w1l2UFg5hCRw":{"text":"Loved it!  Great ambience and the lunch deal was totally worth the money for the three cou","useful":1,"cool":0},"p1vQkbKN0v30N1t1w2NurQ":{"text":"We went for my nephew's birthday. Let me say the service was spectacular. Although it's pr","useful":0,"cool":0},"_JpsIwTtEwvY1ix1zjKqFg":{"text":"Finally made to Antoine's.   Ambiance and history is big as well as the great room we sat ","useful":0,"cool":0},"Qumm1Ix4byCAH4ln44d1gg":{"text":"What a neat place! Winchester, our server, and his assistant were awesome. They provided f","useful":0,"cool":0},"Fxci8JVBmWD1XJ7RC2-EOw":{"text":"The building & history are cool, but that is where it ends.  Over priced food.  Portions w","useful":0,"cool":0},"ICdV-dTIEw1gc3ITfpLRMA":{"text":"I originally wrote a bad review for this place, My mistake. It was a different restaurant ","useful":3,"cool":0},"xHcIzG1gUa0IKdjVkCYs8A":{"text":"Dining at Antoine's was a truly unique experience. It was also quite pricy. My wife and I ","useful":1,"cool":0},"h143RVLeYE38dvNuo02w6Q":{"text":"Weak drinks to start.  I invited a client for dinner and we sat in the bar to have appetiz","useful":0,"cool":0},"A2mt_5cyCWXDAZ_Fj17Jzg":{"text":"This place was sooo average and overpriced! The $20 lunch special probably would've been a","useful":0,"cool":0},"W3yg811qsTYgaAlwBlI5qQ":{"text":"Museum/Expectations\n\nAny place that stays in business this long has to be given at least 3","useful":3,"cool":1},"U77BfmU-j4ky_muA9C5fHQ":{"text":"Antonine's has been serving New Orleans since 1840. It is a great symbol of this unique Am","useful":2,"cool":4},"CCuZZyOxhCsGu0zAmezYew":{"text":"We were here with a big group over the Superbowl weekend. \n\nStaff was great but food was r","useful":2,"cool":0},"2YBaqWQ8bE8syLwmm0Zq-A":{"text":"I've been to NOLA countless times over the years, dined at many of the areas finer restaur","useful":1,"cool":1},"fnl0UZMucNjwcMQEjoEWuw":{"text":"We went to Antoine's because we were told it was a New Orleans tradition and is the oldest","useful":2,"cool":0},"5UoMGgmCCBvPTzzoJVMSyQ":{"text":"Anniversary dinner. Was highly recommended by locals.  Over priced wine and Under cooked a","useful":2,"cool":0},"5PDDzahy4rnCRBo8Hzb7mw":{"text":"We were so excited to experience this iconic place and left extremely disappointed!\n\nOur g","useful":2,"cool":0},"6a1xcL1ycq0hTME8M8Pomw":{"text":"Well this place certainly has been around a LONG time and it has a great history.  Some po","useful":1,"cool":0},"G34tVZqO23P7PPff-OHbxQ":{"text":"Delicious! The bread was incredible while waiting for our food. There were 6 of us and we ","useful":0,"cool":0},"7ncFgs54Y8Y9jIo0j_i9GQ":{"text":"Amazing! Great service and amazing food. Def sit in the room with jazz worth the extra cou","useful":0,"cool":0},"LcKSMmaqDeVDkl4ng2735g":{"text":"The atmosphere, the food, the service.. All on point. I recommend the lunch, it's a perfec","useful":1,"cool":0},"bZZe0bH6Zy3KUrTJuQ63aQ":{"text":"Sorry to have to do this but here goes. this is not a fine dining establishment,\nTha appet","useful":0,"cool":0},"yGRyNMhMd4y0gnaemSjLiw":{"text":"Not impressed by the food at all, oysters Rockefeller may have been delicious 100 years ag","useful":0,"cool":0},"DsmG_gIMSTqfj4cT2tUQGA":{"text":"First of all, the ambiance​, the wait staff remarkable. (Beyonka and Kenya) were very atte","useful":0,"cool":0},"ZRToAwkrxWny1rqLXR-HDw":{"text":"We attended a birthday dinner for a friend. Reservations were made well in advance. When w","useful":0,"cool":0},"WD2vLU7u8RaMTqXD-qYOqg":{"text":"I have to begin by saying that eating at Antoine's is more than just a dining experience. ","useful":0,"cool":0},"ljFcz7gC0xDmena205vQHQ":{"text":"Something wrong is going on here....we had a 1pm lunch reservation 12/29, took 35 minutes ","useful":0,"cool":0},"aqpf2-jhXLuSCzNJEFKZBg":{"text":"Overpriced and overrated. This place has been around since 1840, so it's historical, and t","useful":2,"cool":0},"00CX1tsx_NvBCHP--F0WGg":{"text":"Had lunch there yesterday. They offered a pre fixe menu - very reasonable, including a fea","useful":0,"cool":0},"A3mr2gKwM2OiIl7Nj_r8Lw":{"text":"My wife and I were here March 23. I am sorry to say it was not very good. I previously ate","useful":0,"cool":0},"ZCThFQnCKyxm4O10GyVPxg":{"text":"We wanted to try one of the classics... The service was really good but the food was just ","useful":0,"cool":0},"iS0X12RWVFATPuW-SHXCWw":{"text":"So good! Get the filet. Mmm it's so tender. The iced teas are also really good and differe","useful":0,"cool":0},"9cafKkHKldJZQJr-fP-esA":{"text":"I should have trusted the three star review and gone elsewhere. I don't understand how thi","useful":0,"cool":0},"-iMcU_AXjPTVupI_t78yiQ":{"text":"On Tuesday night I had great food but terrible service at this New Orleans classic. I was ","useful":2,"cool":1},"kr1Y1iPPYS4t5xST-1wcdQ":{"text":"Man I first went to this place pre Katrina and they had the best mufalottas hands down.  W","useful":0,"cool":0},"jY0WtGYADGcU1qUFeXKV7Q":{"text":"Craig, our waiter was very nice!  The foods was good and the decor was amazing, a lot of h","useful":0,"cool":0},"dAmvOs1ef3MDq-wFEvo1_w":{"text":"Really poor experience. Arrived 10 minutes early and were seated right away and then waite","useful":0,"cool":1},"9ZCuKpSvsLGjiSJCaTQ0Ig":{"text":"Antoine's was a last minute decision for dinner for our first night in the French quarter.","useful":4,"cool":2},"54D_s40iA6_t1KSLFjTdWA":{"text":"It is a landmark for NOLA. I had the filet and a cold shrimp salad. Salad was great, the f","useful":0,"cool":0},"mp_l_9ybxpDSSaz3s8CSQA":{"text":"The history of this place was amazing!!! Staff the best!!! Food was really good too!!!","useful":2,"cool":0},"mopqHTbI9t7ihwDzvwEbNw":{"text":"Antoine's is a historical gem where you must dine if you are in New Orleans.  From the str","useful":0,"cool":0},"7rqoHIbsDzQ_qI7Q8M0YzQ":{"text":"I am not a man who ever uses the euphemism \"the bomb\" to describe things, but Antoine's is","useful":2,"cool":2},"mpOs69Mk5wy-nVmhXJKJew":{"text":"Pretty much guaranteed to disappoint.  The oysters Rockefeller are overpriced and taste li","useful":3,"cool":1},"Sm-BGjGLvSouR9lHg9Rqrw":{"text":"I ate here for lunch, from the Coolinary menu, and it was delicious. I tried the three oys","useful":1,"cool":1},"uAVTqLHpKQTaAqjCfihfLQ":{"text":"For all the hype and hoopla this was quite a disappointment. The sever was not very attent","useful":0,"cool":0},"oof0_NqCb9LBeiKKu_k5iw":{"text":"Stopped in for their  $20.18 lunch special and so glad I did!  Had a 3 course meal of Oyst","useful":1,"cool":0},"xUFrq88keemCxdmtJ9Wvkg":{"text":"Saw this restaurant on the travel channel and decided to book a reservation for tonight fo","useful":0,"cool":0},"aMmBAPclpdldD1QxrHndJw":{"text":"The food and service were good, but neither were outstanding. Because of Antoine's reputat","useful":0,"cool":0},"vbIw7Sj_D-ccN81TtkdEPQ":{"text":"After reading a few more reviews, I realize that bringing out things you didn't order and ","useful":3,"cool":1},"QIxfR1UbAwwWRplWQG0w0g":{"text":"After learning about the historical significance of this restaurant during a guided cockta","useful":0,"cool":1},"Rl0FkTCYv6YvtAsfrElRHw":{"text":"My family and I had a memorial dinner here for my recently deceased father.\n\nWhat can I po","useful":2,"cool":1},"-_qI354Lw9CkfPGR0_Rcmg":{"text":"The food is the absolute best in The Crescent city,a step above Commander's Palace,but the","useful":0,"cool":0},"cFKDSJSwteJkYIW3oRiwxw":{"text":"Just came back from dinner.  We waited an  hour and 50 minutes for our entrees.  We will n","useful":0,"cool":0},"4ymtXpZeYY7Vby5uEK7PXA":{"text":"Had a get together long time friends. We started in the bar with some  drinks enjoying our","useful":0,"cool":0},"F1f6nwAYDDjNUY2NHo3Aag":{"text":"I'm really not going to waste a whole lot of words on this review. Antoine's continues to ","useful":0,"cool":0},"MnXnF6DjDHwDWL1CcD2dtQ":{"text":"We went to Antoine's Restaurant as a group on the last night of our trip. Glad i dressed u","useful":0,"cool":0},"jgxPu5wNGk2j-vuwAtMOkg":{"text":"Food good but really bad service. Restrooms were a mess! Will not return; there are too ma","useful":1,"cool":0},"Obo-szZ1_sJ4FCOJYz9-9w":{"text":"I'm giving this place a two star because of it's history, their food is not good. The Rock","useful":0,"cool":0},"11aS8vjTpCsHvc3mDrBa3g":{"text":"We dined here for my boyfriends birthday and it was great. We shared the beef tenderloin e","useful":0,"cool":0},"RH0QKWLvlXsMQHM8I_b-Lw":{"text":"If you are in New Orleans for the day, do not pass up the opportunity to have their three ","useful":5,"cool":0},"E_n0HPQiE72beOfKvT7FHw":{"text":"My law partner recommended I try this restaurant and made the online reservation for me.  ","useful":1,"cool":0},"yx6c5WHK5J4-_fMlcNgwQw":{"text":"Such a New Orleans staple! Everything we ate was absolutely amazing: oysters three ways, s","useful":0,"cool":0},"PAUGwM6OdEN3HsZyPvSp_Q":{"text":"Fantastic food, service, and a bit of history. \n\nLunch sets for $20.17 are great.\n\nNot a b","useful":0,"cool":0},"Z1xCqPcMVC7VBvTDV4TgVQ":{"text":"Really unmemorable. Mediocre service - waiter seemed less than enthused to wait on us. Did","useful":0,"cool":0},"5if7QA2DcdUNmA7xQXU_BA":{"text":"Have to say the food was amazing!!  \nBut even better the service was wonderful. \nI forget ","useful":0,"cool":0},"aiWKyqPdurGTHS7BdR8Bng":{"text":"Wow! 3 course lunch menu for 20.14 plus $.25 Martinis. Loved the alligator bisque & pecan ","useful":0,"cool":0},"wwm44mnsKFnTRYGg1ezRiA":{"text":"Received several rave recommendations from multiple friends about this place, so went for ","useful":0,"cool":0},"TjjsYJiNKU1hle5CSSGiow":{"text":"Ok so let me start by saying this, I believe this place is 2 things, a bucket list experie","useful":3,"cool":1},"1DrZy9YSgMlohydEskMb_A":{"text":"Fresh, classy, awesome waiter, fantastic tour from the host, wine cellar and history was a","useful":0,"cool":0},"PkuQRoo8YHhBtUSuJ1bpGA":{"text":"Don't waste your time. Poor service and ridiculously expensive for mediocre food. Would ne","useful":3,"cool":0},"y6A0ExopX78PIJf5aUseYA":{"text":"Antoine's is a classic New Orleans restaurant, steeped in culinary tradition. Make no doub","useful":4,"cool":1},"YQ0-dVgRf1QJi8xc3QlWyQ":{"text":"If you are looking for restaurants you must visit during your lifetime, this is one of the","useful":0,"cool":0},"_Nh2OnrK0vpfJDDgElUxsg":{"text":"food is great here but there are 2 things that really really bugged me\n\n1 was the price I ","useful":2,"cool":1},"aHYAeGFapg5OVnxKidRltg":{"text":"I think a lot of yelpers have missed the point when it comes to Antoine's. This place is a","useful":0,"cool":1},"ZMc-LupHnNKqWx9z9KI6Tg":{"text":"Wow!!! Simply AMAZING..... \nthe onions soup is spectacular. So rich and filled with taste","useful":0,"cool":0},"-wHkezFPNxpxPDH0OGmoaA":{"text":"Food...delish from appetizer to dessert.  Service amazing. Lovely restaurant. Lots of hist","useful":0,"cool":0},"bQeqyY1lO_2mioLCdB_ADg":{"text":"Oysters Rockefeller were fantastic. We all ordered steaks, rare. 2 of 3 came out medium, m","useful":3,"cool":1},"m6zwQrWNetu16n4MwEQI9g":{"text":"I'm not sure why this place gets so-so reviews. Yes it is a little pricey, but the food is","useful":4,"cool":2},"VccVELV8fZ1Cj8SoORXJWw":{"text":"Food and experience off the hook, if you have a chance ask for Sterling, he is the best. H","useful":0,"cool":0},"CKIC5ksR1ShVxJjU1hLRiQ":{"text":"Great atmosphere and service. The staff was incredibly nice and we even got a tour of the ","useful":0,"cool":0},"bEfuJBysUxQfpaRx-R82Tg":{"text":"Antoine's. A little piece of history. After our walking tour of the French Quarter, our to","useful":1,"cool":1},"8z7BM-6tQfTE6jMutKGZcA":{"text":"Only reason for not giving 5-stars is the walls.  Seriously.  They are covered on old pics","useful":0,"cool":0},"DSalVkJPuDxZiGkL1WcQtg":{"text":"Historic restaurant.  Not too many folks out tonight probably due to the unseasonably cold","useful":0,"cool":0},"XH0qRyhhDoI9weFd9mBvGg":{"text":"Honestly, if it was just the food, I'd give this a 1 star. Although the oyster Rockefeller","useful":0,"cool":0},"5hyuaI8fxtjV2OuU7637MQ":{"text":"Great food even though we only went with the special. Our server was outstanding. Went out","useful":0,"cool":0},"chbTd1zKVM8RNXZKC6Kkxg":{"text":"Just ate there for a group dinner.  It's a large historic place with cool decor but unfort","useful":0,"cool":0},"xR0Ql9K_ux0E_H8rTrV5xA":{"text":"This place was one of the highlights of our trip! We went in for their lunch special that ","useful":1,"cool":0},"zztayUncYm_zgXVISI19Wg":{"text":"First time visitor to New Orleans and\nThis was the first place we ate. It was fantastic!! ","useful":0,"cool":0},"yqyK9A4WMvtahmWoTaTMKw":{"text":"Excellent! Excellent! Excellent!! The food was amazing! The Rockefeller oysters, lamb chop","useful":0,"cool":0},"HovJj39ghcojhvF58CLzaw":{"text":"Wow this was the biggest let down.  First of all the ambiance was Meh at best but I though","useful":1,"cool":0},"wOSfqrq-cRG5X9OsKePRSw":{"text":"So so bad. Everything from the oysters Rockefeller  to the fish with crabmeat was 24 hour ","useful":0,"cool":0},"9NKP7kpyPDcd2ftzG7y7tQ":{"text":"Antoine's is my favorite restaurant in New Orleans. Great service. Ask for Paul or Eddie f","useful":1,"cool":0},"xwAudPdCdxbqLdCntf-lSg":{"text":"I wanted so much to give this place a 5 but we had a pretty bad experience.  Id never been","useful":0,"cool":0},"2X7k9_xza7WAekWhS7Yyxw":{"text":"Where do I begin?!  My son in laws 30 th birthday and expecting a wonderful dinner.  The s","useful":0,"cool":0},"1y52OjSECU4snnEOCddMTQ":{"text":"Came here for the Winter 2018, weekday lunch special. For  $20.17 you get a 3 course lunch","useful":0,"cool":1},"EsVq7zGgnH2lZo4ybAMWEg":{"text":"Antoine's is exactly what should come to your kind when your think of New Orleans food.  T","useful":0,"cool":0},"P5YbRqUZOQxUCYnHtXqQTg":{"text":"The food is ok but not if your a vegetarian, and even less if you are vegan. The service i","useful":1,"cool":1},"tIovz3QVgAc8RzxeSFfPuw":{"text":"Excellent service, beautiful historic atmosphere, however it ends there \nPortions too smal","useful":0,"cool":0},"OeLhFL7xia92rD4UtHvJ9w":{"text":"Not very good at all. \n\n1) WAY too expensive. It was about $100 per person for dinner, and","useful":1,"cool":1},"LX6gbGAPOS3sWpSFf3Wv0g":{"text":"After our first experience here for dinner I wasn't planning on coming back. If you aren't","useful":1,"cool":1},"oKKuJd2vsaBcIomsAL4RPQ":{"text":"LOVE Antoine's. Was here for dinner on a Saturday night, and we were seated right away. Th","useful":0,"cool":0},"lif8ly7JsHramB-X1ngXeA":{"text":"I had their luch special---for $20.15!!!  Yeah! For my appetizer I had 3 oysters done 3 di","useful":0,"cool":0},"ha6bceeRc74R86Dz5RZpYw":{"text":"Not impressed.  I expected better food and definitely better service.\nThe restaurant opens","useful":3,"cool":0},"OrK4b6lhq7lWmXFT7wYCvA":{"text":"Brought my father to NOLA for his 60th birthday, and he's quite the foodie. I did my resea","useful":1,"cool":0},"qpnzZf__DlVNFsujyMDbNw":{"text":"Headline: We saw a MOUSE at the end of our meal INSIDE the restaurant running between the ","useful":3,"cool":0},"-akC9Aefa5TNXUrRURrEgA":{"text":"3 of us girls had a wonderful experience one chilly night in New Orleans!  2 of them arriv","useful":1,"cool":1},"95OvaThYER5kshWiMuM0Vw":{"text":"Absolutely the finest lunch pre fixe in he city. You can't be the service or the 25cent ma","useful":1,"cool":0},"Hms24qB46y6XCRh-aFXLkw":{"text":"We received a gift certificate for this New Orleans landmark and we were excited to try it","useful":1,"cool":0},"AJJDxej509QAGLRki4qdrQ":{"text":"THE SERVICE IS INCREDIBLE! Absolutely a new favorite of mine! We went there last night for","useful":0,"cool":0},"1XokomvP03q9m9fFPJobEw":{"text":"Sorry Antoine's.  I have to say your food is just not that good.\n\nWe went here after going","useful":0,"cool":0},"qkJF-wUCrEm8_YPSGwB3CA":{"text":"I love the history and all.. But this is a restaurant, not a museum.  This is the first ti","useful":0,"cool":0},"pSGKUjBuXJTVztleQ6BVHA":{"text":"A very well-rounded price fixe lunch menu. The oysters are great. Lovely service from Bran","useful":0,"cool":0},"ufPwpHO6SNeXhHVWoxEf5w":{"text":"It definitely lives up to it's reputation.   By far one of the best meals we have had whil","useful":0,"cool":0},"7k-G-UJrQpfDMULDUHmjaQ":{"text":"I was suprised to look Antoine's up on yelp and see 3 star avg.  With the grade inflation ","useful":1,"cool":0},"ArlWIZ8w5j7Pv2hCkMXnDg":{"text":"It has been over 10 years since I visited Antoine's. I can remember it like yesterday. The","useful":0,"cool":0},"SH_-m_URccc7TCa4pCvi4Q":{"text":"Antoine's was established in 1840 so of course I had to visit this historic institution. I","useful":1,"cool":0},"oWs8wuC58uAzLlgb1VrPLQ":{"text":"Had the $20.16 lunch special yesterday.  Alligator Bisque, Shrimp and Grits and Pecan Brea","useful":0,"cool":0},"5-mnEX2Is-afw5HsDQyLbA":{"text":"As I sit here at jazz Fest or as I like to call it, Pot Fest, I'm wondering what i can do ","useful":2,"cool":1},"dxJGjQc2nYtrhh-10eXWIw":{"text":"Awesome ambiance, service and food. Can't go wrong. Lunch special was the perfect portion ","useful":1,"cool":1},"sr6TmtK2mfYSx8XZb1XH_w":{"text":"One of the best lunches I've ever had! We did the $20.18 lunch special and it was nothing ","useful":2,"cool":0},"r96yaZFX8_jCEiLBP9WFvw":{"text":"My review of Antoine's is based on the overall experience, not food alone. Hubby and I mad","useful":0,"cool":0},"C_aZ8y16fPELe_bSZNqYaA":{"text":"We had brunch on a Sunday. The ambiance is a 5 stars, its historic and really cool inside.","useful":1,"cool":0},"FI8G2IwCS4eVoh2U5_Q1Nw":{"text":"Antoine's is a bucket list kind of place - you have to check out a restaurant that has bee","useful":3,"cool":0},"JVmPFgPpnUgJmKLPRK4YDQ":{"text":"Had dinner last night, thursday prior to Marti Grau. ...in town with conference....federal","useful":1,"cool":0},"xqcINy4IgfXay6YOK4_y6w":{"text":"I made online renovations about 20 days before the date. We arrived on time 6:45pm my husb","useful":0,"cool":0},"GO8Vkw_ZwNJcBEnjwQJqxg":{"text":"Kevin F with the shaved head was our very cool server   Excellent recommendations and grea","useful":0,"cool":0},"b7rTCdRWSjr1LYAl2W2d0A":{"text":"An old New Orleans classic that continues to deliver.  To start,  they make a great French","useful":0,"cool":0},"YCpzMi1c4hlR930-28Dztg":{"text":"Went there for lunch and it was a great value. $.25 John Daly's were very refreshing but w","useful":0,"cool":0},"X_PTScqR8V8aVf3mSXwRJw":{"text":"We planned to go to Antoines for my birthday celebration after recommendations as a must d","useful":0,"cool":0},"Da9bzGUhnCsVTCHzRztGUg":{"text":"This felt like a plantation house that didn't get the memo about the end of Jim Crow South","useful":0,"cool":0},"XPzFZtkJ1VKOFk7Tq8eX4g":{"text":"First, do NOT miss the tour of this restaurant (i.e. just let them know you'd like to see ","useful":1,"cool":0},"Zs3USJJRR2_GNbdJJNaDwQ":{"text":"It is with a heavy heart that I write this. Now, I absolutely love soft shell crab and my ","useful":8,"cool":3},"EbUakchQrzz4yKFjOVwPyA":{"text":"I came down here mostly for its historical presence in New Orleans. It has a family tradit","useful":0,"cool":0},"fRBrLLd8kgdadHoPMParsA":{"text":"If you're a local or want to eat like a local, avoid at all costs, especially if you're lo","useful":0,"cool":0},"R-SmyLHEFTo_gieonMDGzg":{"text":"Our walking cemetery and voodoo tour guide made a plug on this place so after our walking ","useful":2,"cool":2},"G_xMBC1aVk6AsEJRIogFAg":{"text":"A huge disappointment!  We went on a Monday night, so I am guessing this was not the best ","useful":1,"cool":0},"t41BshwWtyfeeLNbMDjzaA":{"text":"I went here for the lunch special and $0.25 martinis. That day the martinis available for ","useful":7,"cool":2},"fVlxjXXs7y9Ou28x2NXclg":{"text":"I came to Antoine's last week a little skeptical of the food based on two facts: the numer","useful":1,"cool":0},"R57SbzqY_qeamJZa9Q0iqA":{"text":"Could not recommend a dinner house more highly than I would Antoine's! Our service was bey","useful":3,"cool":1},"G7cH_VDjrz76lcU1L_b53g":{"text":"Antoine's is a NOLA tradition.  It has great food and cocktails of course,  but the histor","useful":0,"cool":0},"K-AohYf4X3vjuR9rXdHqiA":{"text":"Avoid this place. You have many wonderful eating places to pick. Everything here is dated ","useful":1,"cool":0},"OTpf5mndnu-9x8VNdNZTrA":{"text":"Traveler's advisory: at the front door, turn around, cross the street, walk 10 yards left,","useful":8,"cool":3},"USjz4nRHdKUHeE0tt3BGuA":{"text":"Go for the history, not for anything else. This was our least favorite restaurant during o","useful":1,"cool":0},"3FFvEzPOnarF4NjylukTrg":{"text":"It has been a long time since I ate at Antoine's in the French Quarter.  Antoine's is one ","useful":5,"cool":6},"VC0EkeSJI8zwN7DC8xMfnw":{"text":"Impeccable service, we dined in a private room and fellas Joe and Kevin catered to us. The","useful":0,"cool":0},"Io4DjLGHxIHKkOOtiUXQIQ":{"text":"I was actually very pleasantly surprised by our dining experience here.  Friends in New Or","useful":0,"cool":0},"CPOHmM6YUqjOo5J08YzVDg":{"text":"I went to Antoine's for weekday lunch and got the $20 special. \n. I got the char grilled o","useful":1,"cool":1},"_dmMNLpIs8eZ06ajMYYisQ":{"text":"Talk about overrated. We had reservations on Saturday night at 7. We were seated and every","useful":1,"cool":0},"C_rrtplPkb-rYTcspR7bVw":{"text":"Not good. A relic of the past that lives on reputation and bad taste buds. I was raise 1 b","useful":0,"cool":0},"VadU_s0RV1KLxTUZKxuOcw":{"text":"Came in for jazz brunch. Place itself is gorgeous. Feel like you are transported back in t","useful":0,"cool":0},"aMntGp48LSFdW-9xG8saWQ":{"text":"Fancy restaurant, with relatively high prices, but not worth the money. The starter was ve","useful":0,"cool":0},"308LpqJ6s5FvjjjGiHXO_A":{"text":"Antoine's was the first place I ate at when visited New Orleans. I made a reservation at A","useful":0,"cool":0},"nCHsYKRspxEP23A5_dMUjg":{"text":"Thank you Antoine's for providing the perfect venue for my son's rehearsal dinner.  Our gu","useful":0,"cool":0},"5R-JhX1w16C_uVhjgWWeRg":{"text":"This is a review of Antoine's food. The serving staff deserves 5 stars.  Antoine's is a le","useful":1,"cool":0},"tpKOdb749MBrTTOeWnlnrA":{"text":"For the money, it wasn't worth it at all. We ordered fish and it came alone on a small pla","useful":0,"cool":0},"wJbYq7Gw9yaKRurfwFA7aQ":{"text":"This is a review of the Oysters Rockefeller. \nAfter hearing of Oysters Rockefeller origina","useful":2,"cool":1},"fcoo4_qGT0K8FkxBDzCk6w":{"text":"I hate to be a Negative Nancy but..... my boyfriend and I had an absolutely TERRIBLE exper","useful":4,"cool":0},"ij_TfnlWWe1oeQ12Dj87fA":{"text":"Antoine's was such a disappointment because I had such high expectations after watching an","useful":3,"cool":1},"FP8YX1eZXmvnyXPse_LmMA":{"text":"Had our own room for an event with a balcony overlooking the street below. Amazing gumbo! ","useful":0,"cool":0},"pQSFOUonNl5tE1AEVJclag":{"text":"Visited Antoine's during a trip to New Orleans- with numerous previous people suggesting t","useful":1,"cool":0},"66RwGcVrZsUqhMFJPwBMZA":{"text":"I hate to write this review because I know that my experience just happened to be an unfor","useful":1,"cool":0},"CyZqTdVSEpSxL_87MwmG8A":{"text":"Without a doubt a New Orleans institution.  The food was amazing.  We were part of a group","useful":1,"cool":0},"Rmsr3Ymk2CCenlP9zgWSjQ":{"text":"First time visit.  Food was bland and without any reasonable amount of taste.  There are t","useful":0,"cool":0},"sPDHdcJZ9kn3ZaDIODSP6w":{"text":"I recently dined at Antoine's for the first time, and do not plan to return any time soon,","useful":6,"cool":1},"n4snWLJ5Hj189OshderNjQ":{"text":"Horrible experience. Ambiance terrible. There are a lot of different rooms but the one the","useful":0,"cool":0},"sEKQ3UMpqqein4iZRxJ-nA":{"text":"My group of six stopped at Antoine's for happy hour in order to try their famous Oysters R","useful":2,"cool":0},"su8RZcD_3GRTda7VLB_eCw":{"text":"Private room with 14 people.  The room was extremely nicely done having access to the balc","useful":0,"cool":0},"xIe8oW6gU5VWOX2qkm9Riw":{"text":"My spouse and I went to New Orleans mid May 2018 and had a blast. The foods and atmosphere","useful":0,"cool":0},"DxphlYMA7Ueo62rboEjkiQ":{"text":"We had our sons rehearsal dinner at Antoine's and it was the best choice we could've made.","useful":0,"cool":0},"-4e6D_wyhBxlXJ42bTZQXg":{"text":"Terrible foods and very over priced!  I did the $39 3-course meals and left before the des","useful":0,"cool":0},"MKkpUIhV59dYU6jtWB7otA":{"text":"I was excited after seeing Anthony Bourdain's visit, but I had a very sad experience.  Exp","useful":0,"cool":0},"LPKtsPmmK2H4jUsyXeKGrQ":{"text":"I had dinner at Antoine's 25 years ago. It was magnificent.\nA month ago I visited it and i","useful":5,"cool":1},"Iw2COZGQe1dnY37Eryh-_Q":{"text":"We went all out for this dinner and were not disappointed. We made a reservation as we wer","useful":1,"cool":2},"LWF0UgIutB_B1VA5Irad3Q":{"text":"Went for lunch, taste great. The 1840 dining room is so so amazing!!!\nAppetizer:  Oysters ","useful":2,"cool":1},"LfeSC8_TicLRwCq5zbdR3Q":{"text":"Legendary restaurant in NOLA's French Quarter but I really wasn't feeling it.  \n\nI believe","useful":1,"cool":0},"jnFakMykUWqLWeuMVIR9Qw":{"text":"We stopped in for lunch we know we would make it for that if nothing else. Busy busy busy.","useful":1,"cool":1},"xlw2n30_ZxflpK7vc4xhtA":{"text":"We loved the lunch special. (3 course meal for $20.00 plus a $,25 cocktail) We had the swe","useful":0,"cool":0},"mMAvDt55U7fk3oYUgFDQKw":{"text":"If you're going to splurge in Nola, you have to visit Antoine's. It's gorgeous and the foo","useful":0,"cool":0},"JhHWH1Uec5uhJL_zx5KfNA":{"text":"I'm surprised by the bad reviews I'm seeing. My husband and I had a great meal. I was afra","useful":2,"cool":0},"J0Ny9yFphoRv6nRLZhoRDA":{"text":"Good, but not great. We were there on a Sat night for a birthday/vacation dinner. Made res","useful":2,"cool":0},"mNuHFcqaVXj9nl8HLuzfFg":{"text":"So, this maybe a biased opinion because I loved our waiter.  He spent a lot of time explai","useful":0,"cool":0},"94lQqsVEcLAVaJXtrvuJzg":{"text":"We went here because it is supposed to be the oldest restaurant in New Orleans. I have to ","useful":0,"cool":0},"1qA26ACrCu14QdDg4PqB6g":{"text":"Anyone that doesn't rate this place top-notch is just not seeing Antoine's for what it is.","useful":2,"cool":3},"4P2o_SbSDK2C-VFdiFiKpw":{"text":"Old world eating extravagance, ask for the back dining room, it has a much nicer old world","useful":1,"cool":0},"vrtM_eD56c4vMocVVzfzPA":{"text":"My wife and I love this restaurant. We visited New Orleans as part of our Honeymoon. I had","useful":0,"cool":0},"7mk-jevxQ4njf0c0VaC1vg":{"text":"Service was superb, extensive wine list and knowledgable sommelier. The oysters were good,","useful":0,"cool":0},"093GJ62yo2WJqqbHdzZBQA":{"text":"A long time coming for a review of Antoine's. Having most of my family born and raised in ","useful":8,"cool":0},"0auUHVJhVHNzbPLOOXAb9g":{"text":"Yeah I have to agree with their 3 star rating. Appetizer, entree, dessert, and a couple be","useful":0,"cool":0},"ts4pc67kagwIJhWa09EIhQ":{"text":"The food was mediocre at best. The prices resemble those fit for cuisine at a much higher ","useful":2,"cool":1},"a4XeKWPS04RFbJZ5vXgP6A":{"text":"Very expensive and very average food.   Wait staff was inattentive and un professional.  N","useful":0,"cool":1},"Ec1iopupM5R2drViaecBcw":{"text":"Firm lunch did not go well.  Service was incredibly erratic and the food was not particula","useful":1,"cool":0},"zAUsmbUMbdVTBjgeABWXaA":{"text":"Point blank, Antoine's Restaurant is basically a tourist destination and a few celebrities","useful":6,"cool":1},"Oao667fnhlvw6vMsZCxEdw":{"text":"I'm perplexed by the folks that like Antoine's, because I thought it was pretty terrible. ","useful":0,"cool":0},"p_h5-vOVj9con3DiTJHvQA":{"text":"Stop!  Do not go.   This is an over priced disappointment!    What you get is a   \"we don'","useful":1,"cool":0},"pnJOd53JkPpEX6Ne25ykYA":{"text":"This is another fine recommendation from a local that we decided to try on our recent trip","useful":0,"cool":0},"Zr5983b7afFJyklSdxt-rA":{"text":"Foods & services are wonderful and charming. Restaurant itself is filled with history and ","useful":0,"cool":0},"ApVn1NcLVH3wbrUENvtD3g":{"text":"Lunch special \n$20.18 price fix\nSee Sterling Amore, he will take care if you\nThis place is","useful":1,"cool":1},"AskHNLSV9s1cZTHEaDIz6Q":{"text":"You come here as a tourist and you appreciate it as a tourist.\n\nA must:\nOysters Rockefelle","useful":1,"cool":0},"hWgqjDW203euhDMKnsoGcQ":{"text":"Had reservations, seated quickly & requested semi private area, had the perfect rm. , know","useful":0,"cool":0},"Yuk-3QUWrCr3XRoJ60sKaw":{"text":"The level of service at Antoine's is a time honored tradition.  It is family owned since i","useful":4,"cool":1},"UzhTxLWoYqtxJncdNZKdJg":{"text":"My partner and I had the best time here celebrating my birthday! We had the $20 winter lun","useful":0,"cool":0},"cTTyCALv9Ns4U_suMWoCcg":{"text":"We had the $20.16 lunch special  on Monday Oct 31st. We made reservations via Opentable. O","useful":0,"cool":0},"x9F-uEhSzypr8LTOOU-P8g":{"text":"By far the best meal that I've had during my stay in NOLA. We came here just for the lunch","useful":1,"cool":1},"7DLSNmcGz2DJKFRAO9mrmQ":{"text":"We traveled to New Orleans for the first time to celebrate our 40th anniversary, and were ","useful":0,"cool":0},"mbJY5gvd-FeKYrEntlyruQ":{"text":"This was simply a fantastic evening and unique NOLA restaurant! Everything we had was deli","useful":0,"cool":0},"EY8AQ-uTyA23UrHvsgKz8w":{"text":"Such a disappointment. Large room, cement floors, uncomfortable chairs; and high ceiling f","useful":0,"cool":1},"dY6Hl2ra1BmYRe4GbEgBDQ":{"text":"An institution we experienced twice during our recent vacation to Nola.  The first time wa","useful":1,"cool":0},"-YxAmOWumCGA8wQ9b7uYGg":{"text":"Oysters Rockefeller was visually unappealing and not very tasty. The other oyster appetize","useful":0,"cool":0},"LKXvLtwuYngq-hhwafF8EA":{"text":"I grew up in the New Orleans area and brought my boyfriend home for the first time. Antoni","useful":0,"cool":0},"AE3-hO1Q0JJa1R_b5CR1dA":{"text":"This restaurant is known for their jazz brunches and historic standing but I can say that ","useful":0,"cool":0},"Oqu91tDA1SrS3voSTakLfQ":{"text":"It may be the oldest restaurant in town, but it's a far cry from culinary excellence. We h","useful":0,"cool":0},"0yGFY36WY315Ft4eeg4p1A":{"text":"Love it . This place is just great. My family has worked at Here for many generations and ","useful":0,"cool":0},"ZpINHA7LjpIHdEGG-OPNSQ":{"text":"What a neat restaurant! Got the lunch special which consisted of a 3 course meal! Loved th","useful":0,"cool":0},"kiOX6Zp_Um5XE4HUGdGY_w":{"text":"Came in for breakfast this morning with a large group but was told I couldn't have a hot h","useful":0,"cool":0},"6Kmr7ka0HXoCwal7mtKltA":{"text":"Just came in tonight for my bday. The waiter didn't say more than 2 words to us. The meal ","useful":1,"cool":0},"9s6ELEvQhn8kxnnGwU2Mng":{"text":"Reservations are a must as we attended the \"Jazzy Brunch\". Fun atmosphere while eating as ","useful":1,"cool":0},"gFKGu-JtWz4zoJjJ4WIqZg":{"text":"My husband was enamored with this place, I think mostly due to the rich history, impressiv","useful":0,"cool":0},"amKwPXMrKleBLFT5IunmPg":{"text":"Great french cuisine on the French Quater, claims to be the home of oyster Rockefeller, I'","useful":1,"cool":1},"2ZRN0S6HBMcS9cvO7z1ANA":{"text":"Excellent service and the people were so nice and helpful! They gave us a huge bag of free","useful":1,"cool":1},"FGeHRr_Fujoj07yFctcftw":{"text":"My wife and I ate here in Jan of 2012.  Unfortunately it was the worst dining experience w","useful":2,"cool":0},"v2rRZp9iGX9-5aG-G0f-LA":{"text":"We were celebrating an anniversary and a birthday and they didn't pay attention to that in","useful":1,"cool":1},"vptJ5jXDbek-yVUUFdaOww":{"text":"Building was beautiful but our positive experience ended there. The waiter was pompous, th","useful":0,"cool":0},"eUYxFgl7OaHkW8lzTxFwzw":{"text":"My wife and I came to this restaurant because of the historic aspect. Antoine's truly had ","useful":1,"cool":0},"VuCY1HhGgIQ7DahoSCe2aQ":{"text":"Felt like an assembly line. In and out in less that 45 minutes with three courses. Food ob","useful":0,"cool":0},"rF8Brmz9epBoLw5nAWqqGw":{"text":"While this is one of the oldest restaurants in the country and has quite a bit of history ","useful":1,"cool":0},"rdDVFWZPMDiq-fGDmXaHUQ":{"text":"Foods were just fine. But the server was really well trained and hospitable. The only reas","useful":1,"cool":0},"3Uueuh8VVFWYUDvNxJkAwg":{"text":"I came for the lunch special which was three courses for around $20. The food seemed to ha","useful":0,"cool":0},"WWgWLe760FnXxrY8uyzVQQ":{"text":"I went in with low expectations which is the only reason I did not leave in a rage.  If so","useful":0,"cool":0},"_nN8P6AHAtzk2mIiN5mq2Q":{"text":"Was told today that the restaurant has been short handed and they could not be sure that d","useful":0,"cool":0},"fs85p3eJQplUSZiA7nRQfg":{"text":"I kept hearing a lot of hype about this place and was most excited to eat here during our ","useful":0,"cool":0},"f9ZM7IaoHGSJecwAtnSAgA":{"text":"Came here with 10 others on a Saturday night the week before Mardi Gras. Service was impec","useful":1,"cool":0},"6a5VjTHbrVUxJnmflG-GiQ":{"text":"If you've read any of my reviews, you can probably deduce that I'm not usually one to dine","useful":4,"cool":2},"xjqTHw0nyJHa0ieasZyeog":{"text":"Stellar service, ambiance and grub! Try the cheesecake. It's a must.","useful":1,"cool":1},"NnSEVpSz4tgP8aqKH89Y8w":{"text":"The food was okay but not at all what I expected from a New Orleans legend.  Our waiter wa","useful":1,"cool":1},"3lmGVSE5uAcoUqvTufMcIQ":{"text":"One of the dining highlights of my life.  An absolutely beautiful restaurant, from front t","useful":0,"cool":0},"y6bBVuUGcbB4BYVcc8fCvg":{"text":"My husband and I were so excited about trying Antoine's. We had heard so many wonderful th","useful":0,"cool":0},"NfSKbfSfYrwcWAPnmDaxaw":{"text":"A CALIFORNIAN SAYS: \n\nIt's a good change from all the new fancy chain restaurants here in ","useful":1,"cool":1},"OLqwXY6lH2Eh2m1UkK2C0g":{"text":"Orian, Walter and Sterling (Armour) are amazing! They have terrific customer service skill","useful":0,"cool":0},"yhHDqie4L7Z4rKvL5swc5g":{"text":"After many years the service, atmosphere and food continue to be as good an introduction t","useful":0,"cool":0},"zkCpH_mJpsaK1u1ppQVpRw":{"text":"Great atmosphere, service and food. The history and care that is apparent here makes the p","useful":1,"cool":0},"5JjTmtbDSZ0bf6lHh6D3nw":{"text":"Really enjoyed our meal because of the professional waiter full of historical knowledge an","useful":0,"cool":0},"fRnNhXPqI6EzsXubAGlL4w":{"text":"I give Antoine's 4 stars for the impeccable service (Thanks Mike) and being surrounded by ","useful":0,"cool":0},"M32sBHAsw6pBQBSlPJqRMg":{"text":"Perhaps I just didn't know what to expect but we went here on Sunday for brunch. My friend","useful":2,"cool":0},"Bni1wCfH5946LjO_PPFriQ":{"text":"This place never changes. And I am glad it doesn't. We took our two kids there for Easter ","useful":1,"cool":1},"c93LlqEBsO9dxovmWlD4jQ":{"text":"The Chicken with Sautéed Mushrooms was absolutely delicious! This restaurant has a beautif","useful":1,"cool":0},"Evk0LANH7Zbg0hZ7-d3vLg":{"text":"Everything you expect from New Orleans. Old atmosphere, Mardi gras memorabilia and traditi","useful":1,"cool":0},"DkzH0RNuWGj3deDzpHJ1WQ":{"text":"My review of Antoine's comes from a bit of a different perspective from the average diner.","useful":5,"cool":6},"4avTb35C78lj2gIAeajLHw":{"text":"The best thing about the food was the bread.\n\nThe food is just okay. Was buffet quality fo","useful":1,"cool":0},"xLQiBCkZAQ9BOSG4l1UtYg":{"text":"We dined there for lunch yesterday and could not believe the attire the hostess had on.  T","useful":0,"cool":0},"bDRA29DcFlgBkKT0T3pW7w":{"text":"A sad review to write... Had high expectations for Antoine's and did my very best to try a","useful":1,"cool":0},"33Vi8f-V_LkH_iv_shZYiQ":{"text":"Six of us went for jazzy Sunday brunch at 11am.  They open the doors promptly at 11 but yo","useful":2,"cool":1},"sxfxVcFDoXwV32jqWwHpzQ":{"text":"Food was good. Servers recommendations were uninspiring. Signature dessert was a bit dry. ","useful":0,"cool":0},"WfpdJs5EjMV6bgU_HXj3QQ":{"text":"Antoine's is the pinnacle of New Orleans class. The waiters know the whole menu, and every","useful":1,"cool":1},"fwBu_6mhybGvoIM0kZ62Hg":{"text":"so i had to eat an antoine's during my first visit to new orleans, and i was not disappoin","useful":0,"cool":0},"VYSl42tfXu5L8ENwnzVnlQ":{"text":"Great Service and great food. Will definitely return here on our next visit to New Orleans","useful":0,"cool":0},"p8MWNUNHalptdOD9IDlIzQ":{"text":"Classic creole cuisine, with white tablecloths and servers in bowties. Ask them to show yo","useful":0,"cool":0},"TzQPekmltdzpJT7A6taAsQ":{"text":"Overrated. I thought I would experience something special because of the age, the history,","useful":0,"cool":0},"db2WfVpWqQvC5oKQH06dHA":{"text":"We had a lovely dinner.  The service was fantastic! We were celebrating my husband's birth","useful":1,"cool":1},"CmQSvTusoxpazFryGwvELg":{"text":"Outstanding experience.  First time at Antoine's.. and I went with the entire family.  We ","useful":1,"cool":1},"tUJPi_Z0UjTit5yYEFKy5A":{"text":"Dont go! Four couples went last weekend and we all had our credit card info stolen.\nEmaile","useful":2,"cool":0},"nSMBClexAvlS32khN5c9Lg":{"text":"Came here in Nov 2015 for a friend's rehearsal dinner. We sat in the green room and had im","useful":1,"cool":0},"qgAuq4jzkvc2-CewwBw4qA":{"text":"Wow this is a cool place!  It feels like you stepped back in time 100+ years when you step","useful":0,"cool":0},"5IqRUuL1NWcS0CnvBuH4ug":{"text":"If you have not been here, go! I went with a group of girls for my bachelorette party and ","useful":0,"cool":0},"PtgThyFP7jkgE_0BNUMNlw":{"text":"Our group of 6 was somewhat disappointed by Antoine's, though our expectations were very h","useful":1,"cool":0},"_5qPkRGObekyHGcdbZMLog":{"text":"We came here after researching heavily, and upon recommendation of our Hotel Concierge. We","useful":0,"cool":0},"SQB2IpUw44TYtlbv9SlELQ":{"text":"I had the most amazing night here for dinner. This restaurant is full of New Orleans histo","useful":1,"cool":0},"fR3f_z4R9d0PwwYZgx2hZA":{"text":"Disclosure: Saw it on the Travel Channel as 1. The oldest continuously owned family restau","useful":1,"cool":1},"8bKq_YFXz0wmpYMGG2bmMA":{"text":"Antoine's was on the top of my list for dinner in New Orleans. I read mixed reviews on Yel","useful":1,"cool":1},"RHbEqOp8amTKd68KORg1uw":{"text":"Antoine's $20.17 brunch/lunch special was a nice way to experience this French Quarter fav","useful":1,"cool":0},"govqj-zoMdooxKZp5b3Z9g":{"text":"This restaurant is absolutely fantastic! Hands down the best meal I've had in my life!  I ","useful":0,"cool":0},"HJajpKnVOwa9dFa41Dd3sQ":{"text":"Fancy, Fancy, Fancy! Anthony Bourdain has many fabulous things to say about Antiones which","useful":0,"cool":0},"lCa5oMfgJy2BuztGZXiZ9g":{"text":"Ladies must try the St. Germain cocktails. Aroma of elderflower and champagne, a perfect c","useful":0,"cool":0},"GeCsj8vYBUCY1CIcxnw12w":{"text":"Possibly the worst experience in a restaurant ever!  Waited over 2 hours for entrees and w","useful":0,"cool":0},"mSXqRxxtHMG2Rn7WtPUR1A":{"text":"Ambience was fun, and a good buzz on a Saturday night, service was professional and polite","useful":0,"cool":0},"yGTxYpANeXFCZCYuryFSLg":{"text":"Delicious  coffee gelato pastries.  Hilariously cute wait staff. Super clean, French atmos","useful":0,"cool":1},"Xdy5cKTgTpcVew7QByjupg":{"text":"Absolutely wonderful--truly a highlight of our trip to New Orleans. Not cheap, but worth t","useful":0,"cool":0},"Tk857W-AfUH34A0dpO_6qA":{"text":"Went for the Saturday lunch and it was excellent.  My wife and I both enjoyed the 3 course","useful":0,"cool":0},"lvoFa-MDqjqFa7_nVxRWGQ":{"text":"Great food and service!  Since 1840 this place has been satisfying New Orleans visitors an","useful":0,"cool":0},"pP7o3f8Od9PGNIwnDIxVOg":{"text":"I got a rave recommendation from my uncle, but I had some doubts after reading the reviews","useful":0,"cool":0},"k4HI363ZCmE1K5Mox5SV-w":{"text":"Food is good to very good, but not great.  Service was poor, especially for fine dining.  ","useful":0,"cool":0},"oHizXhUFqT_zOIzb1wPElQ":{"text":"No stars.  Walked out.  Appalling service.  Wouldn't know what the food was like because t","useful":0,"cool":0},"ne9VFl77pX0-bZ2u5jGbSA":{"text":"Wall comics and history of the restaurant is wonderful. The decor is definitely interestin","useful":0,"cool":0},"9mWM_3U5nZOXUZYiRqyjJg":{"text":"After expecting so much, I found it hit or miss. Checking in for our reservation was met w","useful":0,"cool":0},"wwwtNZPiePLIq17HWYzWOw":{"text":"I can't believe this restaurant doesn't have five stars!!! Matthew, the general manager, g","useful":0,"cool":0},"t5hq0QV3DPXnFD8O4koB8g":{"text":"We ate at Antoine's last night with a party of 10.  The atmosphere is lovely and then atmo","useful":0,"cool":0},"7UNJybHoEqs16x1YHnOstg":{"text":"I have never had a happier, more talented and accommodating staff serve our table anywhere","useful":0,"cool":0},"akDvzTKWfTIqUsc5lZ31hw":{"text":"Horrible experience waiter showed up and read us the entire menu...we had to listen to him","useful":0,"cool":1},"r8t5tBw2CnGdFJDcwMBUEw":{"text":"I've always been a fan of Antoine's, long before I ever walked through that front door. I ","useful":7,"cool":7},"woTae_lBjLQ1tmzXB-qpIw":{"text":"This place was extremely average. The atmosphere was decent but very loud. We had a table ","useful":0,"cool":0},"2Bn1YHyJmkTJ6LuBfip5fQ":{"text":"Go for the history...NOT the food! We live in and love New Orleans, and have been wanting ","useful":0,"cool":0},"mWAmK7S6dvO1tSTvxyEPwA":{"text":"Good food combined with the perfect location and historical facts that you couldn't make u","useful":0,"cool":0},"PuUciRSRbUhZCiSqNp-sBg":{"text":"I actually went to Antione's twice during my time in New Orleans, once for dinner and anot","useful":0,"cool":0},"duWG8bIA80kzwV7wvUlMIA":{"text":"Big disappointment. Our waiter looked like he would rather be having a root canal than be ","useful":0,"cool":0},"RNzSa3BPLfPZcHnadWHpnw":{"text":"My partner's mother and aunt were in town, so we wanted to have a special evening out at o","useful":3,"cool":0},"pONd4ikImDyamUJKSRMHPg":{"text":"Made reservations two weeks ago for 7pm tonight. Was seated at 7:03 and didn't even get a ","useful":1,"cool":0},"_oHO1Bb6ApdEc27alVbKDw":{"text":"The escargots and the Gridalles et Grits are as good as I remember, but the service can be","useful":0,"cool":0},"g-8lyfo5ceA0TTVI7XRAjA":{"text":"Not perfect but good.  The filet was awesome but the pompano was fishy.  The lump crabmeat","useful":0,"cool":0},"iTn2olx_34Y-dvovXM9xJQ":{"text":"We were excited to try out brunch in this historic restaurant in the French Quarter. Unfor","useful":0,"cool":0},"05ZF_r4jLwNg24QxsvZxag":{"text":"Had reservations for Christmas eve and we were looking forward to this established restaur","useful":0,"cool":0},"o-Bu_7GJZxnBtI59kEymJA":{"text":"We enjoyed $21 three courses lunch very much. My BF had baked oysters, pork chop, chocolat","useful":1,"cool":0},"hEOK7wJdRCvaD5Iy2oc9bw":{"text":"My wife and I each had a four course meal with starters, salad, main course and desert, an","useful":0,"cool":0},"9mkgECr0JKTGHFU5E2VwyQ":{"text":"So disappointed! It's suppose to be a high end restaurant but it wasn't worth half of what","useful":5,"cool":1},"rBsza-dyuaOe3WDknNhWQg":{"text":"Outstanding! \n\nThis is the real deal in New Orleans!","useful":0,"cool":1},"f1hqCiwd0cC9ZG4M56HU_A":{"text":"We had Chuck as our waiter and the best food , and waiter. We went 3 times on our visit to","useful":0,"cool":0},"uR3lrRiH1QH6SsIyFJPHsg":{"text":"Tried a fancier place today for a lunch special - Antoine's.\nThey offered a $20.18 Spring ","useful":0,"cool":0},"DAG5y5uJDDiYfFJ7yAerwA":{"text":"At some fine dining restaurants you can rationalize spending an exorbitant amount of money","useful":0,"cool":0},"1vkkiQUklojG6ClxNOYQWQ":{"text":"I hesitate to write a less than stellar review, but we were a little disappointed with our","useful":0,"cool":0},"TASJdMQ5ED6oUl__vdWmGA":{"text":"Good food but extremely overpriced, especially for dinner! Glad I didn't come here with a ","useful":0,"cool":0},"FLR3K7PAY-wMUiC7r-plTQ":{"text":"This place is rich in history and we were lucky enough to arrive a bit early for dinner ti","useful":0,"cool":0},"p4TArjdMxJsWnTc_d-cVrg":{"text":"The food was exquisite! We tried the different ways they make their oysters -- go with the","useful":1,"cool":0},"NU_K-AbmZqLAeDkR_kqKAw":{"text":"This is a bucket list restaurant. You have to try it once for the history and tradition. O","useful":0,"cool":0},"xhcDZuLqjqC-NDoKAp81ug":{"text":"Worst service I have ever experienced! Walked in and felt invisible to the wait staff. Wou","useful":0,"cool":0},"7CD3Dehs7D8b9X4qgvLGlg":{"text":"The history and location of Antoine's is most definitely the most alluring part of this re","useful":0,"cool":0},"uiGDzyDy9-sYZDJQh3_nYA":{"text":"Really was excited to try this place. I came here for my birthday with 9 of my friends. Na","useful":0,"cool":0},"cEuqPVFeWYX8ybFiwDvP0A":{"text":"Poor Service and mediocre food.  The staff is more passionate about their history and wine","useful":1,"cool":0},"F2rhDqe20e7s15IS3YCZeg":{"text":"I'm writing this review in honor of my parent's 61st wedding anniversary which was Feb 27,","useful":1,"cool":0},"8_bKhF917JfTQ398IirW3g":{"text":"Dear Bobby Flay, \nHave u ever even tried all that brown food including there famous and un","useful":1,"cool":0},"YGGlqpKlMaKzdJP15lyZag":{"text":"A few days after Christmas, I took my large family--nine people in all--to this restaurant","useful":0,"cool":0},"06QB0AkTZ_NVMyn1V1G-QA":{"text":"I would have given fewer stars, but the $20 Friday lunch deal with $0.25 martinis saved th","useful":2,"cool":0},"KuyBO5YZZ3n8qinJ2uYrgw":{"text":"Worst meal I have ever had at any price. \n\nWe had reservations for a party of 20 at 7:30. ","useful":6,"cool":1},"6LnPwB9AsaN24ftFW_az_A":{"text":"We went for a fancy girls' lunch and we're not disappointed. \nThree courses (oysters, craw","useful":0,"cool":0},"NWlcye95pvIV48Gk0dt2qQ":{"text":"Very disappointed. The first reservation we made in New Orleans was to visit Antoine's Res","useful":1,"cool":0},"EIajb_cFyEDnPo9AOFWhDA":{"text":"A NEW ORLEANIAN SAYS:\n\nDon't waste your money.\n\nAs a native New Orleanian / foodie (perhap","useful":9,"cool":4},"RLt-I6akCMqxjF7Q23V5Mw":{"text":"Food good. Service nice. Great tour. Gotta have a jacket for the dining room, something th","useful":0,"cool":0},"aDkXerKkq8HEqhPLhYxIHg":{"text":"Antoine's was good, but not great.  We got the Chateaubriand, which they charge $120 for. ","useful":0,"cool":0},"D-ZpQHcHnD3Zn1S1tjy0KA":{"text":"We were excited to visit NOLA for the first time and from what I've read, we have to visit","useful":1,"cool":1},"8d7kPa1JrhbgAX892rhvmA":{"text":"Antonie's is a one of the longest established fine dining restaurants in New Orleans, know","useful":7,"cool":2},"c_HFx_OW6Kquu-9eQlpeZQ":{"text":"Get it all. Live it up. You will over pay, you will be under impressed by the food, but he","useful":0,"cool":0},"J1tP95teth5gpcqdvHu6Tg":{"text":"We walked in here a couple of days ago and the stuffy atmosphere almost turned us around. ","useful":0,"cool":0},"yuL7jEhdvD-D6hHH_ZnBXg":{"text":"This place was very quaint and the waiter Barry was Awesome!  The food was tasty and we ha","useful":0,"cool":0},"HuNXbFA3dmNtazMmdCAajw":{"text":"The meal was very good and the history of the place was even better.  Make sure you take a","useful":0,"cool":0},"3bWxZ9CGWZpK4YiFOiujhQ":{"text":"With the construction going on this place wasn't easy to find but the walk was great. A lo","useful":1,"cool":1},"99CoaWZEntSggEFhw7mYNg":{"text":"Just got back from a trip to New Orleans with 4 friends. We were told that we just couldn'","useful":0,"cool":0},"M_XVfH56s7edjpQ6EIYSbA":{"text":"Incredible dinner and lovely secret tour of this keystone New Orleans stalwart . This unpr","useful":3,"cool":2},"kUA3DZLSeUO_T9eT3nZlfQ":{"text":"I enjoyed my waitress Beyonka. This woman made sure our table had enough bread and water w","useful":3,"cool":3},"lrmElJswmHXkm3r5UglPrA":{"text":"Per the recommendation of a rest area information attendant we went and requested the Wint","useful":0,"cool":0},"L7kRcta1TuOSKmBQ6WIgng":{"text":"My husband and I went there on Monday for the lunch special.  They have a three-course mea","useful":5,"cool":0},"g6vcxi4IMPCVwNWjvC8Asw":{"text":"Easily our worst meal in New Orleans. We came for their famous \"Sunday Jazz Brunch\". The j","useful":1,"cool":0},"4zUyNlK49GVnajgxAxXS3Q":{"text":"It was an overall poor experience. It was our first night in New Orleans so we went to Ant","useful":0,"cool":0},"a0t-6RvD9jnH0mCBOGbTRA":{"text":"The food the service and the history of this place, makes it a must-visit location in the ","useful":0,"cool":0},"snIWhhcwlicJV-sPvsuATw":{"text":"Antoine's, the oldest French -Creole Fine Dining Restaurant in New Orleans. I always wear ","useful":0,"cool":0},"mveiHv1onq0-cKl19Q3Zfg":{"text":"The food at Antoine's is really good. It's a traditional NOLA menu and you won't be seeing","useful":0,"cool":0},"H1_SlRXmdlEiSu6jHUWgSg":{"text":"I first heard about this restaurant on Anthony Bourdain's No Reservations.  One of his mai","useful":2,"cool":3},"pn082EXTkFx5PBPMTIoB9w":{"text":"THE WAITER WAS HORRIBLE. Tourists, please carefully consider this restaurant before you bo","useful":3,"cool":0},"1xxYbGhypjXhgHkP6c5RgA":{"text":"Rude host, very pricey for the size and quality of food.  They first tried to seat us near","useful":1,"cool":0},"wrI2lS-nFKcqn-yHIyifmg":{"text":"My friend Kara and I had an amazing experience at Antoine's. We were visiting from New Yor","useful":1,"cool":0},"2off6r1xNqgJxX96UwjeCQ":{"text":"Antoine's 20.18 Summer Lunch Menu is really wonderful!  How can you go wrong with Char-Bro","useful":0,"cool":0},"WYYFfVhgpkdd8ozTYLe_XA":{"text":"We w met to Antoine's for the Sunday Brunch. My wife and I had omelets...one with shrimp a","useful":0,"cool":0},"uaoLNtDCxSnS9Mht9gSnDg":{"text":"This is a review of their lunch that was one of the best accidents ever.  \n\nFinal full day","useful":4,"cool":5},"6KdzyAvWs9MtUALLND7O-A":{"text":"I never write reviews, but after eating at Antoine's last night and having such a disappoi","useful":0,"cool":0},"2KKie8-zcyQ-cdzx-gvPAA":{"text":"I tried the $20.11 lunch menu (which is a great deal and an affordable alternative to the ","useful":0,"cool":0},"G9iXsvplN8EZOqguzQCggw":{"text":"Being this my first time in New Orleans, I cannot really say what is the best. I can howev","useful":0,"cool":0},"9_Mq_KE66EfJ7NIGxC7Jjw":{"text":"Had absolutely the worst expirience at Antoines last Saturday.\nI had spoken to Chef Earnes","useful":0,"cool":0},"xsDK5kgFWkuPgF7WRX36qw":{"text":"NOTE:  the bakery is around the corner from the restaurant and is actually on Royal Street","useful":0,"cool":0},"Au_FmHrNayvSyevXgrBJtA":{"text":"My family dined at Antoine's earlier this week and we were terribly disappointed. We expec","useful":0,"cool":0},"xE1yg17WoB4jGfRLIjr_pw":{"text":"Wow, the food was delicious and I mean everything top notch. The wait staff are very profe","useful":0,"cool":0},"SEWtYTo7AQURD9IZoFdm-Q":{"text":"Maybe it was just because I was there for an event and they were kind of doing a large gro","useful":0,"cool":0},"eBGIT-jMZGDHz9T6zzor2A":{"text":"The food was amazing, especially the sauces on the steaks. However the service was inconsi","useful":1,"cool":1},"hfE78qQ-KAHVcR3vDwrgaw":{"text":"My wife and I had a really good lunch here.  The shrimp creole and bread pudding were exce","useful":0,"cool":0},"97nTa6EaxDy7r5JCvKh4xw":{"text":"This is a great place to go to simply to enjoy the historical significance. The menu is th","useful":0,"cool":0},"gxVs9AVOKtyvWm2hssIgTg":{"text":"Bad service.  Lost reservation.  Wrong food brought to the table and bad decor.  This plac","useful":0,"cool":0},"dTkPLakBOrBDA4ObbQbgIw":{"text":"On a recommendation by a local we decided to try Antoine's for their lunch special. While ","useful":0,"cool":0},"N1_q55mcX4rnx6Co9m2ezw":{"text":"Extremely disappointed. I had high hopes for this place and was looking forward to the bak","useful":0,"cool":0},"zDCvcARGDrPfE3f6rjhRBQ":{"text":"This was a first meal in New Orleans for us and what a disappointment.  The food was worse","useful":0,"cool":0},"b6H7Vm6wrllGIiLdME2odQ":{"text":"Absolutely Amazing!\n\nI've been to New Orleans 5 times, but this was my first time trying A","useful":1,"cool":2},"fn5Vz7xW7T0IEI7sSvgvyA":{"text":"So delicious! With old world New Orleans charm. Wonderful service. The drum florentine was","useful":0,"cool":0},"IZrYbki06e9bStW13u1D0A":{"text":"A New Orleans original dating back to the mid-1800s, this 14-dining room establishment is ","useful":1,"cool":1},"E9ycn93bdwiJLPiBk12JiQ":{"text":"I went to Antoine's (Hermes Bar) for the first time last year and I enjoyed it.  I haven't","useful":0,"cool":0},"LomL_CbtGu1LME1p-6PCfQ":{"text":"I found Antoine's to be a glimpse into old New Orleans that doesn't live up to it's reputa","useful":0,"cool":0},"j9v6-gJaxctDEt2Tl305WQ":{"text":"From the historic, elegant, 1840 building, to the food, service, and ambiance, Antoine's i","useful":0,"cool":0},"6q9mhLz5DNdm8dywpnID2A":{"text":"OH MY STARS! $20.18 three course lunch is SUCH a value! It was really super delish the fir","useful":0,"cool":0},"Y-rQXPWoJUvKAz9tuhwlcg":{"text":"Our dining experience was top notch. Eddie, our waiter, kept us entertained the entire tim","useful":0,"cool":0},"Fwd4xhFQc-Ue7yQSHJuGMg":{"text":"Last place we had dinner in NOLA during our visit. We literally stopped a local man on the","useful":0,"cool":0},"6MVbauhXpeAe7Rg3Ol-BCg":{"text":"I am tempted to give two stars for both food and service but feel bad for its good decorat","useful":0,"cool":0},"8dWThj0MQuNcL0oehUcd2A":{"text":"Love this place! Great ambiance, Sunday jazz brunches, really friendly service and good fo","useful":0,"cool":0},"u7s3zn74ssb8N5lmZBA6Vw":{"text":"I attended a wedding at Antoine's.  During the festivities, my clutch purse was stolen fro","useful":1,"cool":0},"eYHAmQXPxCfpEqfwD3O3qQ":{"text":"Although we had reservations, we were led through the quiet dining room with empty tables ","useful":0,"cool":0},"2CKc1zEwEaML5-r4TB7vXg":{"text":"Average quality and small portion. New Orleans versions of French classics, set in the con","useful":0,"cool":0},"OoZmvIw1DNq47H0S7af2LA":{"text":"They invented the oyster rockerfeller but - their version sucks.  Skip it.  Its dispensed ","useful":0,"cool":0},"iDPIOXHgBBDX_RwRsIIuVA":{"text":"My husband and I had lunch at Antoine's on a recent visit to New Orleans.  While the food ","useful":0,"cool":0},"mWvZT3Ayk0QLCJpZ_rfy3Q":{"text":"Decent food, nice service, HUGE price. You decide whether you want to go or not based on y","useful":0,"cool":0},"AvGrnGR0fw0SxLGjE5f1xA":{"text":"Very disappointed after hearing so much about this place for years.  One of the worst meal","useful":2,"cool":0},"nmAVnvimcIfa5KN_UDAn3A":{"text":"The venue is beautiful.  The service was great.  We were there for a private party.  The f","useful":0,"cool":0},"YF6CB0wSnCWUqjF-q8SX_A":{"text":"Antoine would've rolled in his grave if he saw the place today... We HAD to visit this his","useful":0,"cool":0},"epCtG0ZDGsenpd-uWFdohA":{"text":"The epitome of class and taste.  I've lived in or near New Orleans my entire life, and I h","useful":1,"cool":0},"rKa9PH2vdSL3jf0vPixFXA":{"text":"I would not recommend this restaurant. We were there for a bachelorette party- which was p","useful":1,"cool":0},"HyV1DaPCMBwUR31ByWOJCQ":{"text":"I was so excited to eat at Antoines. I love Oysters Rockefeller, I love history, I love Ne","useful":2,"cool":1},"o17kTo7W8kX3x6W1wG1GeQ":{"text":"My mother will not shut up about the mandarin martini she had last Wednesday. She said it ","useful":1,"cool":1},"cJyg_-VJZA_YH7SZ178vyQ":{"text":"Somewhat disappointing! Antoine's had been on my culinary bucket list since I first tried ","useful":1,"cool":1},"zMbjokSXUUn3NUdWFNXkIw":{"text":"Really awesome! Full of rich history, ASK FOR A TOUR, it was my favorite part of the whole","useful":0,"cool":0},"l7DlH18MZJtwzAXieTTeMg":{"text":"Came in here & had a couple of drinks that cost $20, this is a pricey place so surprise th","useful":0,"cool":0},"9SsTLXHLpZL3-R4VbayRRQ":{"text":"Antoine's is a New Orleans classic- one of those \"if you live here and haven't eaten at th","useful":1,"cool":0},"kQy_irvOjuvbIabsCXTQNw":{"text":"Hosted a business dinner here for 15 this week and from start to finish had a lovely time.","useful":0,"cool":0},"b0F8rNjzbeRGay9Ty1PQzg":{"text":"Great atmosphere and the wonders son is fifth generation in the business and a lot of fun ","useful":0,"cool":0},"umqqrYHRwYELQIPJ-DT-wQ":{"text":"A quality meal and delicious. From the street you wouldn't think you would find such a nic","useful":5,"cool":3},"ixsjqnqz-VrZ827E0rcYAg":{"text":"Food was just ok.  This place is huge with tons of people so the food can only be so good ","useful":0,"cool":0},"LG14Q3P8cGwgwlpjj23aYg":{"text":"***Review ONLY for the Bar at Antoines\nWent to the bar on a whim, as it looked nice.  We w","useful":0,"cool":0},"619nxGo5aeg5tnlmJm9cmQ":{"text":"We went back at Jazz Festival again last year. It's still a great restaurant. They execute","useful":0,"cool":0},"GwnL_9-bEdDqMfQ9PbSngA":{"text":"Overpriced and not properly staffed! Throughly unimpressed. If you want to waste your mone","useful":2,"cool":0},"bSgkfos5MwH7lqg_aor4ng":{"text":"My wife and I ate Sunday brunch today. Food is good but not worth the price in my opinion.","useful":0,"cool":0},"5zkAZPaTiZI4__pcN23ICw":{"text":"Amazing restaurant, especially for lunch!\n\nWinchester and Charles (3rd generation waiter a","useful":0,"cool":0},"OpYa67dqCoMXWxMXcKh77Q":{"text":"I feel really bad saying anything but good things about a restaurant that has survived in ","useful":2,"cool":2},"SpNC-V8KBVJUVn4Q1jLy0w":{"text":"Classic NOLA.  A must for the list.  Consistent quality experience that never changes.","useful":0,"cool":0},"JdRiFY4iU0yLAB7Rwrhp4w":{"text":"Really enjoyed this restaurant the service here was much better than at Commanders Palace ","useful":0,"cool":0},"wkWJ-Q2JOu5sNZzgR15lOg":{"text":"Extremely disappointed. Greeted by the host who gave us a choice of dining rooms and table","useful":2,"cool":0},"6nsSYHpi-5DyiuwbfCWnfw":{"text":"It was an amazing evening at this restaurant!! My boyfriend had the beef brochette and I h","useful":0,"cool":0},"6LrU10BI3A-OAcEuCIiVOw":{"text":"Awesome lunch special. App, entree and desert for $20. The chargrilled oysters were the be","useful":1,"cool":0},"iYa2ZBWJwBbzgcVG3IOcBQ":{"text":"Seems more like a community dining room.....poor services, had to wait 35 MTS with reserva","useful":0,"cool":0},"4X49xISNnsZGkXGnhjHLzQ":{"text":"Had a lovely night this past Saturday night.\n\nBottle of wine recommended by the server, ca","useful":0,"cool":1},"0lEBV15rjZm_lqMCwO6TWQ":{"text":"We came here for the lunch special as recommended by a local. $20.16 (as it's the year 201","useful":3,"cool":0},"_BSbMdzIhc4OBrD5kYbt3Q":{"text":"We went last night it was horrible food bad service bad bread  came late  salad no dressin","useful":0,"cool":1},"4EWON3uKWin-nontgc6_tw":{"text":"Literally a tourist trap! I get this place has \"history\" and what not but the food is AWFU","useful":0,"cool":0},"NN_tQeWbjT3eYMcnnlAxvg":{"text":"Sunday jazz brunch was great, food was fantastic, etc. The only problem I had with it was ","useful":0,"cool":0},"Wa7JHMXzObEOv71t7qybBQ":{"text":"Full review w/ Pics in Blog\n\nTaking my seat I was handed the menu and a wine list.  Deferr","useful":5,"cool":2},"i6delAVv0Fixu6VkrDnKhg":{"text":"This is the small bakery, not the full restaurant. Just popped in for pastries and coffee,","useful":4,"cool":1},"sUFu8vpA98ntabRTviaMNQ":{"text":"We picked Antoine's for our son's wedding rehearsal dinner because of a 'visit' we made in","useful":0,"cool":0},"duWps9rEr3iHkQTi4UJ7zQ":{"text":"Impressive!  That's the best single word I could come up with to describe our inaugural ex","useful":1,"cool":0},"kc3kasEMsz2sz-f_adGQvQ":{"text":"Shrimp remoulade was amazing. Nice horseradish zing in the sauce. The 4th, 5th, and 6th ge","useful":1,"cool":0},"IHJbA85o0LazYeebAHqEhA":{"text":"3 stars is a fair rating of Antoine's.  My service was fine, nothing spectacular.  Portion","useful":0,"cool":0},"Tc4son26Feo-pVo339P9zA":{"text":"I gave them 1 star on Facebook, but in retrospect, they did have a nice dessert, only reas","useful":3,"cool":0},"z4VA6WNJT16vPtURouqCAw":{"text":"My wife and I walked in, underdressed on a sweltering 100 degree evening. The waiter was v","useful":4,"cool":1},"SeqE8aRl3xiyoz02moLeMA":{"text":"I've eaten at antoines probably ten times in the last twenty years, most recently a few mo","useful":1,"cool":0},"Tpw47u2h3BBzn5BuPVbnCg":{"text":"Antoine's is an fancy way to grub in New Orleans. Food was good - service was impeccable! ","useful":0,"cool":0},"GjtZpZpRQEy8B-Rw14HnpQ":{"text":"Very nice people rough start but they definitely made things right and took care of us.","useful":0,"cool":0},"m3CYJLuNn9qal2VuIAvWqw":{"text":"We went in for lunch after the advice from our carriage tour driver. We had an excellent 3","useful":0,"cool":0},"dWEkTTIybWtRhzqxaxC3pg":{"text":"There is a reason these guys have been around since 1840. Make dinner reservations several","useful":4,"cool":0},"ZQdW7wM37PSxq-D3e5D-kQ":{"text":"we were a party of 6, celebrating 3 birthdays and wanted an Elegant dinner out.  One arriv","useful":2,"cool":0},"DB3IBO9LWLk5YAaP8H7b9g":{"text":"Awesome experience not to be missed.  Like stepping back in time to a classic era.  Food w","useful":0,"cool":0},"PoknvKFIVzj2khIzeLqxZA":{"text":"Who didn't give this place 5 stars? Who? Went here the day before my birthday and our wait","useful":0,"cool":0},"Up22o2p8xue3aPHfab1sRA":{"text":"Absolutely fabulous dinner! The Escargots a la Bordelaise and Cocktail aux Crevettes were ","useful":0,"cool":0},"sPopm46vzwAO919j17wdkA":{"text":"The first word that comes to mind about Antoine's is: History. That being said, I initiall","useful":7,"cool":3},"4muAoq57Ql541g4jaY1vAA":{"text":"I rarely write reviews but sometimes you just want to tell the world about a great experie","useful":1,"cool":0},"eUsA7hPNRhMzbvcciAeg3Q":{"text":"Had lunch at Antoine's on New Year's Day.  Great food and service.  I highly recommend add","useful":0,"cool":0},"CrXi1-xlbc7M5VJa9BnVFg":{"text":"I am not one to complain but I felt compelled to write this review.  I was looking forward","useful":1,"cool":0},"bpNBzY06rJIf_72S4YPEVA":{"text":"Richenel was our waiter (along with Eddie).  He was a delight.  We had a lovely brunch and","useful":0,"cool":0},"c-RmQpSDxge-FaxkcpnQig":{"text":"We had a large group of about 18 for a noon lunch. The waiter was very good and had one as","useful":0,"cool":0},"DK03kfmvh5KdXquCdDFNww":{"text":"Classic New Orleans - atmosphere was amazing. I had the del monico rib eye which was very ","useful":0,"cool":0},"rdXN9n21VYODJNPDo-RrIA":{"text":"The food was good, but I have had way better for the prices. I fish was over fried, the po","useful":1,"cool":0},"y2V68RT5BkIFT9LEVfCvJQ":{"text":"My friends and I were so excited to come here for their highly recommended Sunday jazz bru","useful":2,"cool":1},"VsD_xgeBQRxx1sCv6c_2dQ":{"text":"Genuine New Orleans atmosphere, 5 star food.","useful":0,"cool":0},"wmxKpkQnp_a7I-pfWq9vRA":{"text":"Awful, just awful. $175 for the worst meal I've ever had. I had the Boeuf en Brochette and","useful":0,"cool":0},"0gYbnWB9eT269wv8DYng7g":{"text":"I went to New Orleans for a long weekend with family and we had not planned well - we had ","useful":0,"cool":0},"ANP6bqs9xlU59v9MJEXE_g":{"text":"Barf...Barf ...Barf. Need I say more. Service was very slow. Food tasted nasty. This place","useful":1,"cool":0},"WzHrss7m6Np7mu2D4bea_A":{"text":"We had reservations at 6:30, checked in and were promptly seated . Murphy greeted us immed","useful":0,"cool":0},"u2VKVsTBfiYH8zRQdNthBA":{"text":"I had such high hopes for my meal here. I of course had the oysters rockefeller and they w","useful":0,"cool":0},"_xv8Hhm9dsi2VQZJ2Dlq8A":{"text":"I saw this restaurant featured on the food network and decided to try it out. VERY DISAPPO","useful":0,"cool":0},"78k2Cqd-c4A6hBJxwMmRdQ":{"text":"Elegant, fine dining. I had the lamb special (not on the menu). The flavor was awesome, bu","useful":1,"cool":1},"oISXr-2fJpYeYLZftdKj9Q":{"text":"Ive been here 2x..its pricy...but its very very good...the service is very nice and prompt","useful":0,"cool":0},"2190lmR9UTfbGcxUDM7D0Q":{"text":"You must order the Oysters Rockefeller and the Baked Alaska. We also shared the filet with","useful":0,"cool":0},"om4z6i5nfgL3IRKBTVLyUQ":{"text":"If I could give it zero stars I would. Treated rudely from the moment we walked in until w","useful":3,"cool":1},"KzXm14Ei6lJ8880klS1Qlg":{"text":"Great Spring lunch.  Choice if appetizer, entree and dessert for $20.18.   25¢ cocktail of","useful":0,"cool":0},"FR2AqSyGYsoaNNST3W-0oQ":{"text":"Had been told/warned of the decline in this icon and didn't want to believe it. Service su","useful":0,"cool":0},"9AUzYCZMmmZyUmKmwxLEXw":{"text":"Here for work and had lunch. I saw this online as a place you had to go to this fall. I ha","useful":0,"cool":0},"tOwtYJpqbDzOKnhS-AqjVw":{"text":"New Orleans's fine dining is worth the price. The food and service is five stars. My wife ","useful":0,"cool":0},"UhbhDe0bP5Z66t-wS8173A":{"text":"If I could give .5 stars, I would. Service was atrocious! There were 2 employees and only ","useful":0,"cool":0},"jZlLD_nbDeeBM66LeLXpTw":{"text":"They have a set brunch menu that will change you whatever year it is. There's also $5 cock","useful":4,"cool":4},"Al053M5xcPucQtJAYmtPDQ":{"text":"My wife and I had reservations for 8:30p on a Monday.  We were excited at the opportunity ","useful":3,"cool":0},"uEiGOPmU53XOGX3myvBM2w":{"text":"Antoine's is a \"must go to\" stop in New Orleans.  The restaurant itself is very interestin","useful":1,"cool":0},"8p19fJHwN0ASlsfjOgIe7g":{"text":"Ordered a Ramos gin fizz, onion soup, and gulf fish (drum) amandine. It was a good experie","useful":0,"cool":0},"AYb6clNpN8jMoNrJ_qpzYw":{"text":"Had heard of famous Antoine's but be aware...Huge disappointment!\n\nMaitre'd placed us (par","useful":0,"cool":0},"LLbWvLAaw-Y4Le1w10DY4Q":{"text":"One of the worst dining experiences. Bad service and rude manager/maitre d'.  The food its","useful":1,"cool":1},"N17rmEQ6L_aFhVkQ1QuuIA":{"text":"We went here for lunch one day then dinner and then drinks.  It's the oldest restaurant in","useful":1,"cool":0},"D9O__rCsP5rAC7m825s3og":{"text":"Quite honestly, this one of the worst dining experiences I have EVER experienced. \n\nI went","useful":0,"cool":0},"o2chkcIjwFD6Mfq1N13p8A":{"text":"This is really worth a visit. One of the most memorable and joyful meals I've ever had. We","useful":2,"cool":0},"_Ng0-FB_jOV-FjYGm11XKw":{"text":"Sterling Moore was an amazing waiter!! After our meal, he took us on a private tour of the","useful":0,"cool":0},"KnbKjJgkksx6aAjnbrL2jw":{"text":"Super fantastic meal with top notch service! \n\nWe had dinner at Antoine's on Saturday nigh","useful":2,"cool":0},"aWDnLQNK835xpyQd43-5SA":{"text":"This is a tough review to write as I appreciate the history here and everything this resta","useful":3,"cool":1},"Q81frKtm6JMo-b9fCNX85w":{"text":"Cool spot here as the waitresses are really cool and they can pour a decent drink.\nI regre","useful":3,"cool":3},"zgcej_dAcNCKJAvOaE5I8Q":{"text":"Very disappointing. Came here with a group of friends and service was very slow.  I expect","useful":0,"cool":0},"DhYvFsP8yoq66bICX24P1g":{"text":"Service was just OK. We were promised for a tour but the waiter asked us to walk around ou","useful":0,"cool":0},"QdBNujB5OkRQ-pJvJdTmeg":{"text":"Great service.  Diverse menu.   Ask for an explanation of the item you are considering.   ","useful":0,"cool":0},"6H8S054KMg9pdznwms8oCg":{"text":"My wife and I dined at Antoine's this week because it is always mentioned as a historicall","useful":0,"cool":0},"y5D2UBOos75msGXql9O_8Q":{"text":"Experience the history of New Orleans and fine dining at its best. Start with an oyster ap","useful":3,"cool":2},"b--MacYSVzhvh2niE_p9ag":{"text":"Cool atmosphere and very friendly staff.  They are known for their hospitality and Oysters","useful":0,"cool":0},"8jw8GzEV3feFp4Gy1QPfsw":{"text":"Sad to say our recent visit was not good at all. Being from New Orleans I have been to Ant","useful":1,"cool":0},"yLWqMjLUuttHt_Yv0YzlFA":{"text":"We have looked forward to eating dinner at Antoine's for a month. We finally had that dinn","useful":1,"cool":0},"j_CzKbD_6s_3sRyqDo2x7A":{"text":"All I can say is despite the ambiance, I cannot even give them two stars. We are part of a","useful":0,"cool":0},"K5wVGtpAOHOU9uh27An7yQ":{"text":"Antoine's is a New Orleans institution. They've been operating since 1840. The restaurant ","useful":0,"cool":0},"F5adeU0I_etLunWlrZ7qjA":{"text":"Came here for my sister in laws bridal luncheon, food was not that great. The Rex room wit","useful":0,"cool":0},"7zDUevreddFrA-q2l3pswg":{"text":"I saw this place showcased on Anthony Bourdain's TV show No Reservations and I was instant","useful":0,"cool":0},"NiuM1Cnchsj3fYt-ZIonvw":{"text":"There's no better atmosphere for a festive group dinner anywhere in the world.  \n\nFirst of","useful":7,"cool":2},"TU_N4UUBgyNXiqjtiulfuA":{"text":"Food was very average and the service was horrible. We had an old man that couldn't even h","useful":0,"cool":0},"3vSPujtBTvKTqIhwYEhbrg":{"text":"JULY 18th at 5pm...  Awful.\n\nSat at the bar.  \n\nWe have come here over and over again.  It","useful":4,"cool":0},"sv9v_3PfxvL60cJ9EB0FKw":{"text":"So let's set the record straight: this place has good food, but you really go to Antoine's","useful":0,"cool":1},"1poWnnAspOMQEwHPpAHfEw":{"text":"Easter jazz brunch sounded special. How sad was the experience! Had the prix fe menu and. ","useful":0,"cool":0},"noRB8P_gby1SSOJrDc-MWQ":{"text":"Didn't get to eat here but has the best NOLA hurricane at the bar. It was a work of art an","useful":0,"cool":0},"9zrXoDlOiFQ-EPRtDzMAgA":{"text":"This came highly recommended by a few people.\nLet me start the service was excellent after","useful":0,"cool":0},"VkKBM66hzT_bGhGYIPD-5Q":{"text":"One of my favourite restaurant in New Orleans! The food is good but it is really the exper","useful":0,"cool":1},"OiE3xdrQHPsqMURhd5-G1g":{"text":"If you come to New Orleans you really have to come here for the history and the dining exp","useful":0,"cool":0},"M2vXBngp0LQg3-bh1FH91g":{"text":"No doubt about it, it is a top classic restaurant. Beautiful historical milestone photos w","useful":1,"cool":0},"GOPYfRExxHVgz9Z_fx2xew":{"text":"Antoine's is the oldest fine French and Creole restaurant in New Orleans.  It is a grand e","useful":0,"cool":0},"DILMS7nWy59anx81QdgwmA":{"text":"Seriously, this is one of the BEST restaurants I have ever had the privilege of dining in.","useful":7,"cool":8},"k5WntVIm_agTJhRL66vUWQ":{"text":"Antoine's is a place to which you come solely for the experience.  However, the food is no","useful":0,"cool":0},"t_8DrUP5b5_4CWe51lRHgw":{"text":"We came for the Reveillon menu after learning about this New Orleans tradition during an e","useful":0,"cool":0},"hT5gVbvMWsnEdrPAzsmEFg":{"text":"While the food was so so, the entertainment was priceless\n2 stars\n\nWhere to dine on Christ","useful":3,"cool":2},"xg6CxwMF-hQkBGDwodZV_Q":{"text":"Antoine's is an elegant staple. The food is consistently good. We went for lunch and order","useful":0,"cool":0},"alTeguls7gBXz7HpBO6vhQ":{"text":"The potato suoffle was excellent! The Service, very nice. It was down hill after that. The","useful":1,"cool":0},"thFrSC1oX300ix1tu5qYQw":{"text":"One thing I know is good food and great service. My best friend and I got both! Gregory, M","useful":0,"cool":0},"cpcvi8havwzOH2DTiU65BA":{"text":"Poor service. Filet was ok. Oysters Rockefeller were NOT good. Baked Alaska was NOT good. ","useful":1,"cool":0},"05CdcjGbeWaHfC3sUiFFZQ":{"text":"Very disappointed in the food.   Group went for Christmas luncheon and i don't think anyon","useful":0,"cool":0},"h_lo4xzGp_sUjnh7hGXNqQ":{"text":"Everything about this place is amazing. The history, the attentive staff and especially th","useful":2,"cool":1},"FCw1HwRKGSskZtrTiynW6A":{"text":"If you are going for the oysters.  Stop. Listen to me....go straight to Acme. You will tha","useful":0,"cool":0},"a1d2Zk0dciHU-0jTpWlKvw":{"text":"Bottom line first: classic fine dining. Food was good but not fantastic. Pricy with good a","useful":2,"cool":1},"e_MDAUFOb8Vgv0r1YpqNbA":{"text":"Service was amazing and the charbroiled oysters were our favorite after 5 different restau","useful":0,"cool":0},"DzkjI3m-Hv1acJIVhJpoig":{"text":"The $20.19 lunch special is amazing and a great deal!!! The service was excellent and the ","useful":0,"cool":0},"g7kOcVMSqlFRtxOdZqLTPA":{"text":"Recommended by our concierge. Very nice atmosphere. Food and cocktails were great. Service","useful":0,"cool":0},"uWHOiTJ2DReSgUgPbD-p9A":{"text":"Our reservations had to be changed because a company booked part of the restaurant on my b","useful":0,"cool":0},"KSVC5ZH9sFOTjEgYNkzzAQ":{"text":"I always see Antoine's featured in food shows and magazines, so I was really excited to ea","useful":0,"cool":0},"vbNG60ealbWcbPHQYA1tRg":{"text":"Iconic spot for sure.  But the lunch is lacking.  Shrimp and grits were ok. Winter salad..","useful":0,"cool":0},"Z1wdkGazkyb5Lrl2T9MkBQ":{"text":"Ordered: \nBourbon Milk Punch \nJohnny Walker Black Label on the rocks\nEscargot a la Bordela","useful":0,"cool":0},"j1Wl4mhcPBj3JYQum37SfQ":{"text":"make sure you call in for reservations, because this place gets booked! \n\nThe home of the ","useful":2,"cool":0},"EQYj2vjjB6I8aTvC5msrhg":{"text":"We came to the restaurant to celebrate a birthday in our party of 6.  At the very beginnin","useful":1,"cool":0},"7_B5Pqe5FM8sTRYbJORc5A":{"text":"Antoine's is a great restaurant with excellent service that pushed this rating up to 4 sta","useful":0,"cool":0},"uOFxe7qxl-zYqcRvdpXCWg":{"text":"My boyfriend took me for our anniversary dinner Saturday night. The food was amazing but s","useful":0,"cool":0},"wSyZ_fTHoJZ59xLhnquSdw":{"text":"Great 20 dollar lunch special with .25$ martinis.  Creole charred oysters were terrific!  ","useful":0,"cool":0},"4IgJamTBPb0mZZF9_tmEUg":{"text":"Meh, \nI was pretty disappointed. With the food and the experience. The food was just okay,","useful":0,"cool":0},"oWlEMWiIBqvHVOmU_FV1Qw":{"text":"One of the worst meals and experience in New Orleans! We were there for lunch.  The gumbo ","useful":0,"cool":0},"083PdZ6mQnEdDe6pjYQuuA":{"text":"This old New Orleans restaurant is still one of the locals' favorites.  It's $20.19 lunch ","useful":0,"cool":0},"y3pPJ9mNErcGP0vy-fsNWw":{"text":"Antoine's is the oldest restaurant in New Orleans and arguably, in the entire country. His","useful":0,"cool":0},"Z9UeDaP6_-vnoFFdG3VwYg":{"text":"I was recommended to come to Antoine's by a local to try their generous $20 3-course lunch","useful":0,"cool":0},"rfT2ZEBjlj0oLcGYVzo9jg":{"text":"We had a wonderful brunch yesterday.  Armour helped us with the menu and we had a great me","useful":1,"cool":0},"eaSRNH600m_U44EPyX-YHA":{"text":"Wow!  Don't go.  Food?  Cold.  Service?  Not.  Never asked if I wanted another drink.  Had","useful":1,"cool":0},"46wow2Sd50BGM9kDXiqNnQ":{"text":"We went for dinner with nine colleagues last Wednesday four of us were a bit late and the ","useful":1,"cool":0},"syfP-VU6u5UA95qnf4xeJw":{"text":"What a massive disappointment!  Our waiter put the \"Bum's Rush\" on us from the moment we s","useful":1,"cool":0},"a23_Fa2XGlMYO6Whb6yp9Q":{"text":"My friends and I took advantage of the $20.19 three course lunch special on a Friday in ea","useful":0,"cool":0},"iUIPTnQPKNw50NakSc_jhQ":{"text":"Well ... this is simply the best restaurant we had during our 4 day stay in New Orleans ! ","useful":0,"cool":0},"_6DZ-e2brX4Lc5-7AdBVcw":{"text":"We had a wonderful experience here. If you are looking for exquisite food, service, ambian","useful":0,"cool":0},"D4eSyxgYddXRQipXYTWJUQ":{"text":"Superb old style New Orleans Cuisine. Since 1840. Ask to take a tour of the place before o","useful":0,"cool":0},"JjNsRN7-W1XyHVj5Hw32ng":{"text":"I don't know where this place got its reputation but it's worse than a tourist trap. Oyste","useful":1,"cool":1},"jXROCOzx8S9VE3BzXmiUwQ":{"text":"Terrible.\n\nI'm not one to post negative reviews and it takes a lot to disappoint me, but t","useful":3,"cool":2},"ECTTr8IQsvJHVdz5XSkxTQ":{"text":"I concur the oysters Rockefeller were inedible.   The fish with crawfish topped was good t","useful":1,"cool":0},"9HffBavklUwGbaxXuO72Bw":{"text":"Excellent. Incredible history to the place. Impeccable service. Our waiter gave us the tou","useful":0,"cool":0},"g-46JOYyIbfQ9CkdSCmx-g":{"text":"Yes, it's the oldest operating restaurant in the country...yes, it's a landmark building..","useful":0,"cool":0},"S9De52SXjWyf0AINX5MR5g":{"text":"Came back to Antoine's after a few years. It is still as good as our first time. \n\nWe came","useful":0,"cool":0},"EzVnJ6w-SIHQ95uvZt51vQ":{"text":"i was a solo female traveler.i have worked in  restaurants for 35 years so i think i have ","useful":0,"cool":0},"PL8qgx5eHGZpuYOJitUJwg":{"text":"Everything at Antoine's was delicious (not Commander's Palace level, but still great), and","useful":0,"cool":0},"CCW1GNQ7EE7ymC7wlvZKsw":{"text":"Murphy was the best. that darn Scott, Chris, was a maniac!\n\nFantastic meal. i had the veal","useful":0,"cool":0},"5E5Og4-m7tGxlMraILclpA":{"text":"This restaurant is touted as the oldest French-Creole Fine Dining Restaurant in New Orlean","useful":2,"cool":0},"4ubIODmP2moPADjEArQ9uw":{"text":"Came here for lunch while visiting New Orleans! We wanted to enjoy all of the food culture","useful":2,"cool":0},"TAb1HSLuKzvRQJ_CVsWHBg":{"text":"I wish I could give this historic New Orleans restaurant more but we were sorely disappoin","useful":0,"cool":0},"Mw69Xpo7i14Mz23AlQ9m2w":{"text":"My fiancee and her family and I celebrated her birthday here recently, and it was deliciou","useful":1,"cool":1},"VZJ9kDAesJQbDrydNGeZjA":{"text":"We had an amazing lunch today . Our server Craig was so friendly and helpful . Must visit ","useful":0,"cool":0},"_SyI5oL22pfCXyFrKVM8iw":{"text":"Overrated, overpriced basic fare. Waiters were friendly and attentive however. Was not imp","useful":0,"cool":0},"MFdd5QvlHPk9Dtaju3ycvA":{"text":"One could see how this is THE place to go to celebrate special events back in the day.\n\nTh","useful":3,"cool":3},"pinQxrZM01SGvCFrwwAlcg":{"text":"I loved having dinner here.  The food was fantastic and the ambiance was exactly what I wa","useful":0,"cool":0},"cWomOFG2BSqUppAMDHG40A":{"text":"Had a lunch reservation at Antoine's early Sunday afternoon. We were looking for a place w","useful":2,"cool":3},"exx3l8cr3jvWM5Ae0cGZYg":{"text":"Sunday jazz brunch lacks jazz if your seated in room that fronts street! People in know as","useful":0,"cool":0},"b4ZEPj5v0SbUtF39MT1v0g":{"text":"Drove from mobile, al to make a day of enjoying new Orleans,  had lunch here, was quite ha","useful":0,"cool":0},"OfaJZpptFkJEA16k7JZh6Q":{"text":"Food good but very noisy, terrible acoustics, service OK.  We went to a group meeting so d","useful":0,"cool":0},"_geTe57sl7b-2MMkn6q3zw":{"text":"Came to NOLA for the first time to this restaurant because of good reviews. The food - oys","useful":0,"cool":0},"5jxG5bCC4JzRXJ-PAKUR9Q":{"text":"This is based on the bread pudding only. It's my favorite bread pudding in New Orleans. Th","useful":3,"cool":3},"yp_5uDnXJX5YgQG_LbR74A":{"text":"I had been looking forward to going Antoine's. We are avid fans of the travel channel and ","useful":1,"cool":0},"_fWYo29bXPxxMAyeOuMGWw":{"text":"We had a birthday dinner at Antoines last week.  There were 8 of us and 3 people celebrati","useful":0,"cool":0},"fnOfy084wvAaj3oJPyBRag":{"text":"20 years ago we came here when my daughter decided to attend Loyola University. The food, ","useful":0,"cool":0},"aHE4ppzg6nGW3Gm8lqAr4Q":{"text":"The food was horrible. By far the worst food we had on our entire trip. The prices were ve","useful":0,"cool":0},"ZDmtM0VN_E2q_qSBUD5jPg":{"text":"Nice ambiance ! Old NOLA and exceptional waitstaff. The food was just good but nothing to ","useful":0,"cool":0},"AHkBcO1vVTEVFDKckjZcfw":{"text":"2 stars. 1 for longevity in business , another for nice service. Otherwise, i really think","useful":0,"cool":0},"ZfHrki5Ye7e6NqgrisKltA":{"text":"As locals who now live in New York City we were disappointed and horrified at what This pl","useful":1,"cool":1},"oQT24bKH6n-VkQ5G1FI7mw":{"text":"One of my all time favorites, and for good reason.   The food is fantastic, the service su","useful":0,"cool":0},"1LMttQSGj3LFj2swfJ3kOw":{"text":"It is an absolute experience that is a must for all.  The service is perfect and the food ","useful":0,"cool":0},"p2hPTJ8l2SIKLmLNVYTEvQ":{"text":"We haven't  been here in a while, but decided  to go for the $20.17 lunch special. The ser","useful":0,"cool":0},"wX59xeUKLiIXqayl3LHDHA":{"text":"I gave this a high 5 star one year ago ( see below), but this time it was average at best.","useful":3,"cool":1},"2KxRXwHjFETffU9CvkqGDg":{"text":"We came here on a Monday night at 7:15.  The host was very nice and got us seated quickly.","useful":1,"cool":0},"v6HwGwPymlZ1xtsihBDMZA":{"text":"Old School Elegance!\nFor all the amazing food in New Orleans, there seems to be a casual a","useful":0,"cool":0},"fQ1bPqUxTxX9J4v8-xu1lw":{"text":"My husband wanted to go here for the historic factor. It is charming but that's about it. ","useful":0,"cool":0},"8pK0eXOYEvMZSkC95Tt-cQ":{"text":"My husband and I went to Antoine's for lunch yesterday expecting the service and quality o","useful":0,"cool":0},"NTOin1N09zZ-bJ9JgJivww":{"text":"Dinner at Antoine's was marvelous. I paid attention to some of the negative reviews at thi","useful":0,"cool":0},"jWX7n7xVjAA38gtM7UrInw":{"text":"Great food, impressive decor. Funny bartenders. Would return for the food. Jon the server ","useful":0,"cool":0},"fE5iPcbbx3yL_R25MIAvcw":{"text":"We heard so much about Antoine's but we were disappointed.  The lunch was OK, but not grea","useful":1,"cool":0},"t91LMI5XCTWLVQw-NTFfbA":{"text":"I don't see how this restaurant doesn't have five stars from every human who's ever been t","useful":0,"cool":0},"fhImCj-rgwmNi0EOaMMqsg":{"text":"People giving this institution bad reviews are largely low class types who expect \" large ","useful":4,"cool":0},"Vif77_uV4wCwHNcTgiW2cw":{"text":"Great experience. I was a bit deflated when I first walked in because I had a very sour st","useful":0,"cool":0},"4Y6_62gv-vHH317pPZQC6Q":{"text":"Very disappointing-escargot was at best warm not hot and too cheesy on top. French onion s","useful":0,"cool":0},"xsAXy1rnnM1lMldUWMay3g":{"text":"This was my first French restaurant and I was not disappointed. Ryan did an excellent job ","useful":0,"cool":0},"VCnVP1hE_oUNUujUljphHg":{"text":"Love this place. Take the tour. Ask to see the attic there are no lights but if you have a","useful":0,"cool":0},"OUQ0vOzzz2g162RwH0edcA":{"text":"I really really wanted to love Antoine's.  The history, the beautiful dining room, the wai","useful":2,"cool":0},"MfSq8nVXExxdMIMDqBTTGw":{"text":"Bae suggested this place since there were offering lunch for $20.19.  The service is outst","useful":0,"cool":0},"gMVb8hKhVHcC9K9KO9wuYg":{"text":"Came here for the first time with my girlfriend around Christmas time.  Gorgeous atmospher","useful":0,"cool":0},"jmh3w3ikzkt_uy87lZWZcA":{"text":"I heard this was the oldest restaurant in America or something so I figured we might as we","useful":2,"cool":1},"IVHCEZtbFF8XVkWxkmnTjA":{"text":"When we entertain at home, one of my favorite \"go-to\" recipes is Oysters Rockefeller; so I","useful":0,"cool":0},"8c4af_tVPlYa2fBtmekgWQ":{"text":"I will give it 2 stars because of respect of its 175 years serving. Place is beautiful and","useful":0,"cool":0},"ZvSHJ2eahkUzAZRWs9g6og":{"text":"I came to New Orleans for the 1st time in February for my 40th Birthday.  I did all my res","useful":1,"cool":0},"PZ6KFf8X3m2-xojhJJJvJw":{"text":"Went there for dinner March of 2014 and was not impressed.  \n\nFirst the Pros:\n-The service","useful":0,"cool":0},"y1NfOUNQXlJRblb5QSA6jg":{"text":"We dined at Antoine's for their $20.19 lunch special during our visit to NOLA at the end o","useful":0,"cool":0},"hTVAwmUVyCtzFMaMDvINFQ":{"text":"Went for lunch special. $20.19  three courses with $.25 special cocktail. Got to try oyste","useful":0,"cool":0},"UjKhGJyQFIhPcVZCqanJEA":{"text":"When we were deciding on a place for a very special 10th anniversary dinner, the sentiment","useful":9,"cool":6},"kpKjlywjwXnBcHaD1tXIAQ":{"text":"I had no idea the history about this restaurant, and when you entered, the decor and the p","useful":0,"cool":1},"9GctLZxk4IrBZAd1Dx015A":{"text":"There isn't much to add to the reviews. I'm a little disappointed that the tours seem fair","useful":1,"cool":1},"EyXstELDjWuufcj-7LE3MQ":{"text":"What a great experience! Upscale service and food. Preset lunch,with a choice, appeizer, m","useful":0,"cool":0},"UDkdTkCw9AEJvUpvoIupGQ":{"text":"This place may be called as an \"Institution\", with a long history .. but its present may n","useful":1,"cool":0},"z8aubtF80GlWwKqWNPcGxw":{"text":"As part of planning our New Orleans vacation, my husband selected two restaurants he wante","useful":0,"cool":0},"gKK--0bqhGNcKugBmH7STQ":{"text":"This place is huge! It's worth stopping in just to hear the stories of all the people that","useful":2,"cool":1},"DWVgScTwANWvISbhLriRNw":{"text":"My favorite restaurant in NOLA. Delicious food and outstanding service. This last visit I ","useful":1,"cool":1},"1kuzUf4-0AG_mni6_vdtVw":{"text":"Everything about this experience was perfect. The food, service, and atmosphere. Somehow t","useful":1,"cool":1},"VWSUo8vcYFhAgzjeA5Th7Q":{"text":"Hardly fine dining.  Food was mediocre, drinks were poorly served and one even had a hair ","useful":3,"cool":0},"DLqNqYY1JKnl7QqLScOoDA":{"text":"It was horrendous.  Went for brunch - the restaurant was nearly empty and it took 20 mins ","useful":5,"cool":0},"rbm4DNJsX2j2kw-eHbxGKA":{"text":"Dined at the Hermes bar located on the side (different than main entrance). Great craft co","useful":2,"cool":2},"hElXmGzBVaCIwzzS2Mhngg":{"text":"This place is standing on name only!!!! The service was absolutely subpar, the steak was u","useful":0,"cool":0},"SBNOIM9QnfFxTbi3MyyLcQ":{"text":"The classic New Orleans experience awesome staff amazing food. We had the revellion dinner","useful":1,"cool":1},"UVXRlqSj2I69C4LjLQbHqw":{"text":"We had a really delightful fine dining experience at Antoine's. The food was first class a","useful":0,"cool":0},"2Y57a2dDPHzTO2-iRc-44g":{"text":"Antoine's is an institution and I feel it's something that everyone needs to experience at","useful":1,"cool":0},"xDU4RQxR5dm0GgxbU3fuRg":{"text":"Antoine's should be on everyone's short list of restaurants to try in New Orleans. This is","useful":2,"cool":2},"tsebpyWt63ZevhhlukYfOg":{"text":"Our servers West and Richard were absolutely amazing! Food was fantastic. We had the $20 l","useful":0,"cool":0},"MhpUC9upgwllTisu3IXiIw":{"text":"Almost Everything we had was good but not great.  Our server's name was Brandon and I must","useful":2,"cool":3},"djwuq6igy5hYePNHc2D1fA":{"text":"Probably the worst place I've eaten in New Orleans.\n\nSomebody else picked the place for di","useful":0,"cool":0},"O1m0f2YPKP7zUTTfB8EzPg":{"text":"This was a wonderful spot! We took advantage of the lunch special and are very happy we at","useful":0,"cool":0},"5hh1u0mt-MHYaABn5ygNUg":{"text":"Oldest family operated restaurant in the United States.....  Just don't go for the service","useful":2,"cool":0},"gDS04dXH8IbQiI4qHv_UAQ":{"text":"You can not go wrong with this place! Super yummy incredibly sweet staff and the prices we","useful":0,"cool":0},"24rIw4JRryj3C0oBY9RzmQ":{"text":"Worst dining experience I have ever had! It took over 30 minutes to get one drink, over 45","useful":1,"cool":0},"-4W2NRgHuxriiMHuS7Dptg":{"text":"While visiting New Orleans, Antoines was on our list of must try places due to its long hi","useful":1,"cool":1},"OZxM3Ci0a0L5apVXWXCcDA":{"text":"Heard great things from friends that are local to NOLA and also people that recently moved","useful":0,"cool":0},"SlaZjVmwNuCEQai7aEo__w":{"text":"It was bound to happen--my very first one star review. This is no joke of a rating either;","useful":4,"cool":4},"6vjDbt0mnHjgu1gpL0xBrQ":{"text":"We went with our 5-year-old daughter for early dinner. The waiters were very friendly and ","useful":0,"cool":0},"uAhgRohl7qIwgHVrICkDrg":{"text":"Antoine's is a landmark.  It is the second oldest restauarant in New Orleans and you don't","useful":3,"cool":2},"m8CnZi7S9b4aiSqibt7iPA":{"text":"Food was truly amazing. We were served by Glenda, who was really a wonderful server. Cockt","useful":1,"cool":0},"yA9Zgby6O6nprJ6mAZ_Uyw":{"text":"For my 400th review, I am so happy to share Antoine's with you!  (pronounced Antwon's) \n\nS","useful":8,"cool":4},"bZbjj5t-czbIiuLmbvDIIA":{"text":"Phenomenal restaurant! The staff was excellent and the food was amazing. The ambience was ","useful":0,"cool":0},"44mEZbMeKyS6VBFu2ZJDjQ":{"text":"Staff was stuffy.  Alligator gumbo was delicious.   Salad had no flavor and dressing was w","useful":0,"cool":0},"RAxssrlo_9BOStjBv77z-A":{"text":"My fiancé and I are visiting NOLA on a bit of a whim for our anniversary. Tonight we were ","useful":0,"cool":0},"dsRWZvdka_yjsgqt30P8_A":{"text":"I ate here about 6 years ago when I was visiting for mardi gras.  I was stone cold sober t","useful":0,"cool":0},"K0Xf3Vmyw3cA5J8mPKVdhw":{"text":"Antoine's claim to fame is that it is the oldest / longest running restaurant in New Orlea","useful":8,"cool":1},"FAW2Z_2WSXUzgDPM5iIZTQ":{"text":"I hate to say this because I had such high hopes but it was awful. I booked it for last ni","useful":2,"cool":0},"sAX9ESfVRgRirYW8jAqqMQ":{"text":"My husband and I made a reservation on Feb.6. We were immediately seated.  Then we waited ","useful":0,"cool":0},"tPb3BkljGXg1XY01WeH7Hw":{"text":"I was so looking forward to going to this restaurant because of all of the great reviews a","useful":0,"cool":0},"wvezLKONPzKpyMOjokY46w":{"text":"Don't bother. We went for lunch. It tasted like left over buffet food. \nService was tepid.","useful":1,"cool":0},"AgM49tp-yK1NnBZdkxkXsQ":{"text":"A must stop for lunch when visiting New Orleans.  Antoine's never disappoints.  Service is","useful":0,"cool":0},"TF2hEEAAT2TOvpev7GAnzw":{"text":"The Service from Boudreaux and Cody was great..extremely professional highlight of the exp","useful":0,"cool":0},"nYzv9NVe_oTWkE1u07T_ig":{"text":"Antoine's has such a rich history that they have been featured in travel guides from the 3","useful":0,"cool":0},"cLPcXILqWFX2Q7JGp3ndlg":{"text":"Lackluster at best.\nAre you prepared to ask for ketchup with your pricy meal? \nAre you pre","useful":0,"cool":0},"yB3naHB9eoYjhaXGbDgrLg":{"text":"Loved the presentation and the atmosphere in the 'speak easy' room. \nOur staff was nothing","useful":1,"cool":1},"j9aZILcO3u5D1pW5bqoyOw":{"text":"Well the foood looked good but I couldn't get the bartenders to really help us- even tho w","useful":1,"cool":0},"KVY6jjBvLddeHKixbwAr5g":{"text":"So we were a party of 10 & were given a reservation at 2pm for lunch. They apparently clos","useful":2,"cool":0},"LuMn3JSjB10Zu2t_D4Tezw":{"text":"Antoine's has the great New Orleans historic vibe you might be looking for. You get the el","useful":2,"cool":1},"Szg2dhEiRZGwqWNdO6yXSQ":{"text":"5 stars all the way! We went for dinner last week and such a nice experience. It's a very ","useful":0,"cool":0},"UF3rkh8fVpDIOJ35lvS0BA":{"text":"From the minute we walked in we were treated rudely, the service was extremely poor and th","useful":2,"cool":1},"4eiVIVS67Cm72MnoIAKIBQ":{"text":"Excellent. Made reservations ahead of time. Service and food outstanding. Worth the price.","useful":0,"cool":0},"4cI8xEPUX4rzdNecgkhcdA":{"text":"I just went back.  It's still AMAZING. One of the best restaurants in the United States...","useful":0,"cool":0},"O0njhTiJq4356WzT_UaP8Q":{"text":"Antione's is an old New Orleans fave, and while I've not always been a fan, they are stepp","useful":2,"cool":1},"CQ_cBOo9vlfKI3DInlW_MA":{"text":"My friends and I went to Antoine's with high hopes. We'd heard a lot of great things about","useful":2,"cool":0},"LonqAKop2ww2PIyx5WsNig":{"text":"Went to Antoine's as a recommendation from a friend. We made a reservation and were seated","useful":1,"cool":0},"IfIWEY41A0L7g33tUEt2GA":{"text":"Fraud and deception, bait and switch, cafeteria style. Don't go here.\n\nIf you're walking o","useful":0,"cool":0},"EijsRqOV1vKRMTr7S8aV6w":{"text":"Classic New Orleans atmosphere and service that can't be beat. The food here is always fir","useful":3,"cool":3},"R3Z2H7i-w6ri59c5GdQkbg":{"text":"Go for Lunch special well worth it!  25cent cocktails were a nice treat. The crab appetize","useful":0,"cool":0},"63lbtUC-CM2JLof6vfMCpQ":{"text":"Ate At the bar last night. The pommes soufflé were not properly cooked; in fact, they were","useful":1,"cool":0},"AHgwuCyTn2UmlyEa1gaCqA":{"text":"Antoines was suggested as a must visit to us as it is the oldest operational family owned ","useful":1,"cool":0},"QkJRympaINydfFORfIK8mA":{"text":"Yes, I would like to speak to the manager about this incidence.  Its ridiculous to have a ","useful":2,"cool":0},"3D5q1W3JMjXQkUj9FomP5g":{"text":"Antoine's came highly recommended by a friend. We were sadly disappointed. The host and ho","useful":1,"cool":0},"CEf0xEJa35GF-EqTrORgnA":{"text":"Came to NOLA to celebrate spouses 50th. Our last night was to be special. Unfortunately th","useful":2,"cool":0},"5j97mTNIFEUIVha_wa_RXA":{"text":"The culinary experience continues. This place is full of tradition and history as the olde","useful":0,"cool":0},"LATGN4MtgJj_q0zaA-refA":{"text":"Service is great so far ( we got here @ 11:30 though right when they opened - had a reserv","useful":2,"cool":2},"2nLIEwqi6skhtWUE_5Jyuw":{"text":"Very disappointing. We ate there Saturday December 15th for lunch. My salad was wilted and","useful":0,"cool":0},"n2fBHZD8ZN-zv3DE34zkMw":{"text":"One star is too much for the experience we had this evening. Our Oysters Rockefeller were ","useful":0,"cool":0},"t-A45zr5DWH9OwNBk-Rk3Q":{"text":"Ok first of all it was our 24 yr wedding anniversary we had never been to NOLA and had hea","useful":0,"cool":0},"DkSj3cjDxLcWlin82GjGqA":{"text":"I'm visiting from California and I ordered the gumbo which was so amazing and the service ","useful":0,"cool":0},"s4D9tort9e0VH3-hUERcQA":{"text":"The number of stars would vary based on what I was actually rating at this restaurant.  If","useful":3,"cool":0},"CTUWGuO2oaHg2TLkaL-atQ":{"text":"Best service and food we had in New Orleans. The lunch special for 20 bucks is a deal.","useful":0,"cool":0},"3Re2oRqKO0DEdvcPsg_ebg":{"text":"We enjoyed the lunch special. I was impressed with how reasonably priced it was. The food ","useful":0,"cool":0},"QZ1sO4RFrGGumxs80-m6TA":{"text":"Paul was our server and he was amazing, so ask for him if you get a chance. We came in aft","useful":0,"cool":1},"YbBMPmpcvMsWL6oz4mMkYA":{"text":"TOURIST TRAP!! This place is cruising on history and not current greatness. \n\nFood was onl","useful":0,"cool":0},"n-wNZTqblQqxl-1-m4dRmw":{"text":"Let me preface this review by saying I've wanted to dine here ever since I was in New Orle","useful":0,"cool":0},"XuYtzbu5ukUhOtf-UyJang":{"text":"Had a reservation for 5:30 PM on 9-28-2019. After we were seated and handed menus my husba","useful":0,"cool":0},"rIfEB_KbC02QD_mBSbVlqg":{"text":"Who doesn't love $ .25 screw drivers! I would definitely order the price fix menu for lunc","useful":0,"cool":0},"dre8BkmhqBM8IrZ-NwD68A":{"text":"Today, I took my friend to Antoine's for lunch and to my horror, we ended up having one of","useful":2,"cool":0},"bOeTNolQrZ7THp5ER3lNyA":{"text":"I really want to give this place a great review, but I just can't.  Took three people to b","useful":0,"cool":0},"SuRxw27-oNJ1CWdOlaZ2hA":{"text":"Well, I'm glad we checked this place off the list, but I probably wouldn't go back. Group ","useful":0,"cool":0},"JFyy6AvQLrKoANJ5yKnD-A":{"text":"Horrible!!  I had reservations, and asked to be seated in the front, not in the back \"gym\"","useful":0,"cool":0},"j8AHZbH1c5EAGceY_Hvmpg":{"text":"We had a friend's birthday lunch here. I just felt like everything was rushed. I was also ","useful":3,"cool":0},"yGxUfjGadSlOQJjBG2s2qg":{"text":"Great place to host an event. We had a packed house for our women in business lunch hosted","useful":1,"cool":1},"k6ebxvA0YZkElgb3_bm-Og":{"text":"We were downtown for the Red Dress Run and wanted to grab food before we start drinking, w","useful":1,"cool":1},"nUO_zf_wfCtFNXqf1fsyMg":{"text":"Antoine's is everything that it's reputation foretells.  The lunch deals were outstanding ","useful":0,"cool":0},"XFh5ASfHFJ_pI3IijhTRXw":{"text":"This restaurant really is packed to the brim with so much New Orleans history. Even the ro","useful":1,"cool":1},"54AkO6oyWtShb2Ccoqx9KA":{"text":"Most excellent dining experience ever! Cocktails before the dinner reservation at the beau","useful":0,"cool":0},"mGdFnfAnKJ9Csm-g6r4uRw":{"text":"Was SO disappointing. I first visited Antoines 50 years ago. A cherished memory. But this ","useful":0,"cool":0},"0_pPrICilAwS83ZCuFydHw":{"text":"It's a well known fact that New Orleans has some of the finest gourmet restaurants in the ","useful":0,"cool":0},"5l9_H-hTwF0OWQ9uNC-D2w":{"text":"Resting on their history only.  Great place with average tasting food.  Had their prix fix","useful":0,"cool":0},"gWvS3bw3h4p0xXTl10qPDQ":{"text":"Antoine's bills itself as the Oldest Restaurant in New Orleans. I went for the $20.16 lunc","useful":1,"cool":1},"GyBfQ8uPvdnsWZXH6mEEPw":{"text":"My friend and I had the loveliest meal at the famous Antoine's. We went because it is the ","useful":1,"cool":1},"sKbgzOzOuH2AUl7ELH6EJg":{"text":"All around great place. Arrived at 11 and while brunch didn't start until 11:30, Sterling ","useful":0,"cool":0},"nbSUrzzJTuDEjr2MUpPVSw":{"text":"I know the owners of this restaurant-they pride themselves on being the oldest restaurant ","useful":0,"cool":0},"3dA4cLcmVdHc6AVTGCDAAg":{"text":"If I could give less stars I would. First, they say they have a dress code. I show up in s","useful":1,"cool":0},"1AjQgxsOWPVTOIkv_uWKPw":{"text":"This is an establishment. It is formal, old-school and unhip. It also invented Oysters Roc","useful":1,"cool":1},"HdSSX0P5lZmwj2VCCzcLDQ":{"text":"This is the best food I have ever had! Terry and Henry were amazing servers. The Pompano P","useful":0,"cool":0},"e8nf0vhQhllOBnlrPXEdfA":{"text":"We made our reservations based on the Reveillon Menu. I will take the blame for not checki","useful":2,"cool":1},"i1CcM00sovTFfM99YOeuwQ":{"text":"A new favorite: we sat in the Jazz Bistro, so (excellent) live jazz music throughout the m","useful":0,"cool":0},"h0upa8aA2Jj3JQCAgQ0aWA":{"text":"I went for my birthday.  Steak was tender and cooked correct.  The sides were lacking in t","useful":0,"cool":0},"7gTzBNTn1toGRlH0a_rCnA":{"text":"We went here for my friend's birthday lunch. They have a weekday lunch special for a 3-cou","useful":2,"cool":1},"zxsnDonT2Z0aEr9lusrqtA":{"text":"This is definitely a place to revisit. It's been around since 1840 but has fallen out of f","useful":1,"cool":0},"QcDk9ouo3P6qwLYBg4Auog":{"text":"I've been here twice, once for brunch and once to have lunch. Brunch was nice, food was ex","useful":1,"cool":0},"-5jodZO_QFMOkk61nVDoyg":{"text":"Magical evening at Antoine's during the holidays! Food is on point ! Our service was excel","useful":0,"cool":0},"vj5_HyG2sMn4Jmdbnx-jhQ":{"text":"Upon reading the negative reviews, I can only surmise that Antoine's possibly treats touri","useful":7,"cool":2},"oQxULEJExGb4HtX5Oy9gaw":{"text":"My partner and I picked this place for our Sunday brunch on our vacation to New Orleans fr","useful":1,"cool":0},"NjVPyviHRiLOGU6BiuB-EA":{"text":"Captivated by the history attached to Antoine's and knowing it's the oldest family run Fre","useful":2,"cool":1},"8mR323ReoHm7C8AZxribzA":{"text":"As a local (I wasn't born here but raised in the area since I was 3) I have heard several ","useful":7,"cool":1},"VIr9InTcWj9XOYD2Rmx_5A":{"text":"Fast Eddie is the man! Everything was so good I don't think I can describe it in words!","useful":0,"cool":0},"f_UZ1t9DKPMKCn79ebdhNQ":{"text":"This is one of the city's gems and always a delight.  We went for Sunday Jazz Brunch and h","useful":8,"cool":5},"r2gdbHmlrC9VMrZZQKRMvw":{"text":"Pick a different restaurant!\n\nFor my wife's birthday dinner, based on suggestions from fol","useful":2,"cool":1},"6NQzMsID0PaBg3tFOZYPag":{"text":"I appreciate the history behind the name Antoine's, and was excited to participate in thei","useful":0,"cool":0},"9qXcQRweJq36OVLMwlyXaA":{"text":"This was an extremely disappointing meal. Have eaten here before and it was good. This tim","useful":1,"cool":0},"UzqrtRoCLmvA703Ny3Hc3w":{"text":"Antoine's was the best dining experience I've ever had! It is beautiful inside and so much","useful":0,"cool":0},"EhOmURI_DNOKddvLR_fOgw":{"text":"There are no English words to fully explain that Antoine's is a life-goal, bucket list typ","useful":3,"cool":1},"YQU1BWPKfgoaI3usprqNxA":{"text":"For all the hype, the dinner was rather underwhelming. The food was okay. The Oysters Rock","useful":1,"cool":1},"wKc6gwMzuqkt151Rf-A-aQ":{"text":"I can not say enough about Antoines and Mr Sterling armour as well as the rest of the staf","useful":1,"cool":0},"E786s4PKQe8GjddGkNxYCQ":{"text":"Our team celebrated our holiday meal at Antoine's last year. We had our gift exchange at o","useful":1,"cool":0},"E_llNKSxZq7xEH-Vw5rpGg":{"text":"Had Easter brunch at Antoine's on 4/21/2019 with my mother and had a terrific time.  Enjoy","useful":1,"cool":1},"m-VqXgm_dzmUAQ7nofcR3Q":{"text":"Somehow I have lived all these years in NOLA and never dined at Antoine's. Now that I have","useful":0,"cool":0},"35n8Pu0dF8CkUCkzv9QWhA":{"text":"Made a reservation at Antoine's - hearing about it's iconic past and status as a French Qu","useful":0,"cool":0},"JEyZk1zB-iuwx9WjfY8wLQ":{"text":"Living on its reputation fumes.... Unfortunately, the food quality is sub-par. After eatin","useful":0,"cool":0},"5PELFxdYh7BxmZ5QlSUbVg":{"text":"So let me start by saying that it is very clear that back in the day Antoine's must have b","useful":2,"cool":0},"OWlgl5e-b9oc0JtBxDc-uw":{"text":"Family and I had dinner at Antoine's a few nights ago and I thought the suggestion from th","useful":2,"cool":0},"EP5bYCceNxjI2avO6qWUUw":{"text":"I'm really confused how anyone could give this place five stars unless you're used to eati","useful":1,"cool":0},"myMJ4qL8P3Sv1Nb6CMDDPA":{"text":"So gross. Period. Overpriced old-folks home food. Super salty or super bland. Oysters Rock","useful":2,"cool":0},"ppAiWKs0WhvORExWN7YDiQ":{"text":"always good ... and of course a must in NOLA ..  always stop by here ... walk royal street","useful":0,"cool":0},"IpUacujaWUIrUH681Jd8Hw":{"text":"Impeccable service, incredible ambience, and absolutely amazing southern cuisine. This is ","useful":0,"cool":0},"GpqXuHh8T99aVft_wMIcsA":{"text":"Very expensive, very beautiful feel absolutely gorgeous. The decor in the building is outs","useful":0,"cool":0},"yGohEwwCJr696u0RLRWtcA":{"text":"To really appreciate this place, you should read into the history of it first. Make sure y","useful":0,"cool":0},"Dn6NGFKB5cJ1EPrxaVuVGg":{"text":"All I had to eat was the gumbo. It was pretty good. I definitely enjoyed it. I planned to ","useful":1,"cool":1},"-sb3Wfyd9BoblrqSNLLvuw":{"text":"Been sitting here for 20 minutes with no acknowledgement from anyone. The servers are walk","useful":0,"cool":0},"ivTSzRJNxS_iUaUrOnss3g":{"text":"I guess this restaurant is still stuck in the 19th century, since it's service is just as ","useful":1,"cool":0},"_iSi9KuVPv1BCMyDva3jFw":{"text":"Came here for brunch, due to the history of the place and everyone we spoke to told us we ","useful":0,"cool":0},"VAazUAC_BJxf3nyqHYPUng":{"text":"We had lunch at Antoine's and can not say enough good things about our meals and experienc","useful":1,"cool":0},"49U_MI1DOWWtkEWzqaTe_A":{"text":"Honestly, the food here was pretty good but the service was garbage. Entrees were mixed up","useful":1,"cool":0},"F8Pg1WKAXJLxbHpwD3A4nQ":{"text":"Travis and Austin gave us the best service of our trip! Brenda was very welcoming and gave","useful":0,"cool":0},"h9V0okO6EA9bijjOMWmPDQ":{"text":"Antoine's Restaurant is absolutely beautiful! It has different themed rooms with amazing m","useful":1,"cool":0},"y7w-seyVs236HkSyax7JLw":{"text":"Just a big no for me. First time in NOLA, and honestly the dives we went to were so much b","useful":1,"cool":0},"rlg4WmJSf2fD_EDo-9F8xw":{"text":"Do not EVER set your foot in this place.\n\nHad dinner in a private dinner room with a party","useful":2,"cool":1},"tk4u52gQh46jV4TbjzaQPQ":{"text":"I spent my 30th birthday dinner @ Antoine's in NOLA and it was an incredible experience to","useful":0,"cool":0},"w80soLm0U-J01XHa8jVtbg":{"text":"The Oyster's Rockefeller, Bienville, and Thermador were served room temperature. We sent t","useful":1,"cool":1},"GjNa0dQhx30kW_1xQAV_-A":{"text":"My husband and I got all dressed up to have a fine dining experience and enjoy delicious f","useful":0,"cool":0},"HyW3n3Xsfn1tEG-l6_YsgQ":{"text":"We went here because it was an old historic restaurant with great reviews. While the food ","useful":0,"cool":0},"2odwgwjIf13Skve2W8OgEg":{"text":"I travel frequently to New Orleans every year and I always pick one different restaurant t","useful":1,"cool":1},"eg2qS6VVJuWCNFkrS78atw":{"text":"While we enjoyed the wait staff (Bryan was out main waiter) and the knowledge they gave us","useful":1,"cool":0},"4EVeDsaWqvgsZTrdy8kyXg":{"text":"The food was good, but the service was very disappointing. We waited 35-40 minutes for a w","useful":0,"cool":0},"3IMokzo_lOlx-aG7qDiXpQ":{"text":"This place is a treasure! New Orleans oldest family owned restaurant. EST. 1840. We first ","useful":0,"cool":0},"Szzd7yejVUVJeeMUdhw4Kw":{"text":"Good food. Best deal is the pre fix lunch and the special drink of the day for 25 cents.","useful":0,"cool":0},"2NwoDmEAXHMV9s6DD6uBSw":{"text":"Oh my, Antoine's does not disappoint. The food was amazing and the decor is amazing. We we","useful":0,"cool":0},"9VoNYRVfWxAbu8DZM77JSQ":{"text":"We had a great lunch - Lunch special for a 3 course meal for $21.00 with 25.cent martini L","useful":0,"cool":0},"93aD3Oy4GBoAvOI9qKeQ5g":{"text":"Wow what a place! It is a museum with all the photos and what not on all the walls. We wen","useful":0,"cool":0},"Wjxs2s4COU7f-mth9WdEbg":{"text":"This is one of the best restaurant experiences I've had. The food is divine, and the servi","useful":0,"cool":0},"3PDtyaULROLAYHIXKLvSWA":{"text":"Last time we dined here, we were very disappointed. Today Paul waited on us and provided e","useful":0,"cool":0},"F-kEm_pLYP4NYKo-5nwYdg":{"text":"Come here often since I was a child. Brought my whole family recently and service was agai","useful":0,"cool":0},"dWa5TCC48bicFT9hgkHOcg":{"text":"Went today for a part of 18, we made reservations in advance and we had our own private ro","useful":3,"cool":1},"roRFz9HEjsqzxqI2Kmdvuw":{"text":"This was my second time at Antoine's (the other time was 2007). I don't know if I built it","useful":1,"cool":0},"-2rsyuAY2cAdcFpGa53Rcw":{"text":"I specifically go to Antoine's for a French 75.  Always my first stop in the French Quarte","useful":0,"cool":0},"ejLG2bB97tRk7pyT-cKIsQ":{"text":"I was extremely disappointed. I have only eaten here once but, I don't know if I would eve","useful":1,"cool":0},"hL8w6LD0gU2cd5RwV-De9A":{"text":"I love this place!  I especially love their seasonal lunch menu a three course meal for th","useful":0,"cool":1},"7sTUkoL6j0UI8NzrLzYovg":{"text":"First- let me emphasize the space itself is delightful and classy, and the service is top ","useful":2,"cool":1},"9aDxOTKGHaUgKMP1gzWGrQ":{"text":"One of the top 3 restaurants in the US! No really. It's heaven, dripping in history, stunn","useful":1,"cool":0},"OEvtuD2p3KGqyRpl0lfPJA":{"text":"First of the staff was exceptional!! They were so attentive and friendly. Their food could","useful":0,"cool":0},"y50ultyRsmUAAQBdVO-GFQ":{"text":"We stopped in for a light lunch and drinks. We had reservations and we got a table immedia","useful":2,"cool":1},"a22CZ-M-1tST1X1qVyVsyg":{"text":"I made my reservations weeks in advance. This meal was to be a highlight of my trip to New","useful":1,"cool":0},"zy0Aph4-vQexLWyUTKIfWg":{"text":"Arrived right after a white couple 10 minutes before our reservation and were told they wo","useful":1,"cool":0},"xO2JzS0TO3azVAF1vD7zeA":{"text":"This was the first time I experienced service at a restaurant that I would classify as dis","useful":9,"cool":1},"RupU4e_65t112wgZmJPEqw":{"text":"Recently visited New Orleans with some friends. My friend has been wanting to eat at Antoi","useful":1,"cool":0},"tS14oOn-1XKSyiyxD9Rcjg":{"text":"Tourist robbery... \nWe went to Antoines for dinner and it was $300 before tip for two. We ","useful":1,"cool":0},"9fzVU3NIUHbaGYn-SvSTbg":{"text":"We had planned this dinner here for a while.  Overall the food was good,  but certainly no","useful":2,"cool":1},"Jm-nWDcUys2NK85IVkeUpA":{"text":"Unmissable dining experience. I came in for lunch before the Stones concert and was deligh","useful":0,"cool":0},"g4heT_Cay6PIvP3RMf4dUw":{"text":"What a great experience. It was our family's first time trip to New Orleans and we thought","useful":0,"cool":1},"BMrDldHRUJSJLrR9InjpWQ":{"text":"After many years of eating throughout NOLA, we visited Antoine's for the first time on Val","useful":1,"cool":2},"Ma70I0tBQ4BFtUF_zL0Bqg":{"text":"Book a reservation.  Just do it.  \n\nIt's so interesting and historical and the French food","useful":0,"cool":0},"myylg9c4zsV6dmOA5-CVLA":{"text":"Antoine's summer special is unbeatable.  We didn't have to make a reservation, we just wal","useful":1,"cool":1},"rh6kSoojLgsY51SaPMi8yg":{"text":"Very disappointing.  I am not sure how they've lasted 180 years. Service was marginal, bre","useful":2,"cool":0},"vvEnGSeMhWzb36A-Nu2KRQ":{"text":"We ate her for the jazz brunch and I was a bit disappointed with the meal.  The food was a","useful":4,"cool":4},"p1VDsgff9fyK0AChH8DQNg":{"text":"Okay, you know I have been wanting to come to NOLA for years, because I really wanted to t","useful":3,"cool":1},"1LS3YlxUFFfOBbJiHtrDBA":{"text":"Yes I realize that this is the oldest restaurant in NOLA and I really want to say somethin","useful":1,"cool":0},"0yKwLQ6ypnfxSglC3erx1g":{"text":"Antoine's was highly highly overrated.\nThe venue is beautiful and full of history, but the","useful":3,"cool":1},"M2AAjEm64W6vNGuwQMkT0Q":{"text":"We went there after reserving for evening dinner on 03/05/15 and escorted to different  ro","useful":0,"cool":0},"MNfTC8I7_MYko3k15uS9eQ":{"text":"This review is a limited one because I dropped in on this very classy and classic New Orle","useful":1,"cool":3},"Tcb79vXQvZR4jWVltXNrzg":{"text":"So so good! I have no idea why this place has mediocre reviews. Definitely worth a trip!","useful":0,"cool":0},"R2wstU9BW1kNZbeAlbiF1Q":{"text":"Food and service were both terrible.  We had finished dinner and had ordered desserts but ","useful":3,"cool":0},"UUm5mwG5gb8U-GuOGRKV5Q":{"text":"Without question the worst dining experience of our 5-day stay here in New Orleans. We wer","useful":1,"cool":0},"adrifVGJMip_IgS1Y9-g2g":{"text":"My fiance and I went to Antoine's for the first time today to celebrate our anniversary. T","useful":1,"cool":0},"KKbj7PheY-oa9NTnff4vHA":{"text":"Kind of surprised this place is three stars overall, as of my review. Here's how I see it:","useful":7,"cool":3},"NGgTlsZyI3zGaHsS6_nVHg":{"text":"Want great food? Want to feel like you are dining in a museum? Come to Antoine's. After ou","useful":0,"cool":0},"rHV0DQRg7x0KHJ-RSRJ86Q":{"text":"The service was absolutely spectacular. It's a great deal for the amount of food you get a","useful":0,"cool":0},"W3Hq0_mdCS7moSwSY7ASzg":{"text":"We did not really bond with Antoine's. While loving the surroundings, tradition and histor","useful":4,"cool":2},"xhWlEyZpydeF955C64-Wvg":{"text":"My boss took us here for a group dinner and we had a great time! We ordered one of each ap","useful":1,"cool":0},"kqytnuBUrVkchl7k5K9Rrg":{"text":"First time here Very Busy Had Only a couple of issues First we sat literly next to the fro","useful":3,"cool":3},"NpE32Tp4Dn_1n9rTbEGCSQ":{"text":"We were so excited to taste this food. I am a foodie and I love seafood and French cuisine","useful":0,"cool":0},"ucAy62oW7vgdmq3EZ11r4g":{"text":"We came to NOLA for the Avon RepFest and my sister had on her bucket list to come to Antoi","useful":0,"cool":0},"d2SCQq6quZ3w1PLl14mzEQ":{"text":"I went in to grab lunch with a friend the other day during my lunch break. The food was go","useful":1,"cool":0},"lmzriH4c2VEPwMA9bB4KWQ":{"text":"Way too dark for my taste, the AC was at full blast making it a bit uncomfortable, food op","useful":0,"cool":0},"bh-UENqDUHr0_uW7cBnhAw":{"text":"My family and I went to Antoine's for the jazz brunch on Sunday.  The jazz was very good, ","useful":1,"cool":0},"sElUIH9sCr5XN5bHEd-2Fg":{"text":"Lives on reputation alone. Expensive, Sub-par food, rude service.","useful":0,"cool":0},"dxTXWsqOzfWD8bnMR8SjQg":{"text":"I always wanted to go to Antoine's on my birthday. My husband met me at the airport the Fr","useful":0,"cool":0},"S7xsHg28ZR114eRsidWixw":{"text":"Meh. \n\nOne of our vendors invited us to Antoine's for A celebration. We went deep into thi","useful":2,"cool":0},"OlfCLH-QO9d-I0mrYU1r-g":{"text":"Short and to the point. Went here for a private party with my boyfriends family. It was no","useful":1,"cool":1},"hQDEpvVVnkE-NDZdIXwdTA":{"text":"So, Antoine's is not where you will go for innovative food, but it will not disappoint you","useful":3,"cool":0},"wmOLIkoN1jaNliduw5DvSA":{"text":"I was looking forward to dinner at Antoine's for a year. What an unbelievable disappointme","useful":2,"cool":2},"6mgPgKsW4fKtQ54F8zRTdQ":{"text":"My wife and me reserved a Sunday brunch with Antoine's.  We waited at the table for 15 min","useful":1,"cool":0},"nrgsLTT5eCowQ0ZXATgmNQ":{"text":"I love their bar called the Hermes Bar but the best part of Antoines for me is the restaur","useful":3,"cool":2},"NTvpNgEum9duYTPqGmC-Uw":{"text":"This place has been around since the 1800s and is the oldest family-run restaurant in the ","useful":3,"cool":2},"15faAyIlErIKcihCd4yZjA":{"text":"I would rate this as one of the top 5 meals I've ever had! Classy ambiance, tremendous ser","useful":1,"cool":0},"RAly3jV3iP5VOd-x_1FWDQ":{"text":"Today we went to have lunch at Antoine's. It was my first time going and I was dying to tr","useful":0,"cool":0},"X85rgWfyhS-4YozXPR-Cpg":{"text":"One of the Grande Dames of New Orleans restaurants.  The food is creative in preparation a","useful":2,"cool":0},"4EIyR8oZmw3vt-hBOUuVsA":{"text":"Reviews on management's poor treatment of guests are correct.  Our water waiter was the on","useful":0,"cool":0},"BKVOxNkpX97FjSC3EIbo3w":{"text":"Walked out due to rude server. We were excited to try a new Orleans institute. Instead we ","useful":0,"cool":0},"DuMIU5N16Yq-9bEjKcTUGA":{"text":"Words cannot describe the incredible experience that we had. I would highly recommend Anto","useful":2,"cool":1},"NCgYHxVcOQy1btZEVLZdVA":{"text":"Very overrated place but I assume the experience is dependent upon how much they're busy c","useful":0,"cool":0},"ofZjfwgzgI9eR9R7WRE3lg":{"text":"This was my husband's pick of \"must do's\" on our honeymoon.  It was definitely an experien","useful":2,"cool":2},"Ba8MmTvRmJ6fwg18ZSi9kw":{"text":"This was probably one of the worst meals My husband and I ever had, and We are foodies.Yes","useful":0,"cool":0},"pWAARXiTZUWNGjtpmj5-oQ":{"text":"My boyfriend and I were excited about dinner at Antoine's, expecting a quiet and exception","useful":1,"cool":0},"-I9ji848EwadG3qZCGWvHA":{"text":"Amazing, simply amazing! I with I could bathe in the onion soup. Our meal was superb and t","useful":0,"cool":0},"dJiNtbVHvCgv9sYNS2E9aw":{"text":"I was looking forward to a great dinner for my last night in New Orleans but instead it tu","useful":0,"cool":0},"SWi3NCO4TLK5IgmZWKvF9w":{"text":"I was so underwhelmed by the entire experience. Food was alright but not spectacular, serv","useful":0,"cool":0},"PnY6k5Cx7S2pWTuJrWDlrA":{"text":"I really liked the traditions and decor of this French Quarter original. Its the home of O","useful":1,"cool":0},"ht3zHw6o92awmIJD6rEIaA":{"text":"This restaurant get's a 4* because the experience is nice, the ambiance is beautiful, the ","useful":0,"cool":2},"R5H9jgDSKGVC3HJ5N3K0TA":{"text":"I'm not even sure where to start with this review - everything from the welcoming hostess ","useful":1,"cool":0},"C9Pi22icG9fBo9T1_VFqqA":{"text":"This place is an institution in New Orleans and rightfully so. It's lineage and history go","useful":0,"cool":0},"ts7iGzEMrr9v3HhgcxhrgQ":{"text":"Meh. The build up was highly overrated. We had heard that this place was considered one of","useful":0,"cool":0},"0hOi0D9_EAk7Z_moaIgm_A":{"text":"SIGNATURE DISH: the brown lettuce remoulade\nwas actually the best part of the meal today. ","useful":9,"cool":2},"TwKdhbmvHMg5b-oSlKIJ_A":{"text":"Pompano with crab...excellent! Ate there a while back and the fish was very dry; not this ","useful":1,"cool":1},"LWg9I1kKpsP9EjzQ4o2Ilw":{"text":"I went for the lunch special every day I could. The food was delicious, the price was extr","useful":3,"cool":0},"6zIwudTs1YLTsdg9VTCQTg":{"text":"Anticipating our visit to New Orleans, we researched and selected a few top rated restaura","useful":0,"cool":0},"YG5XHQt1ckCjccvN5usPbQ":{"text":"What am I missing here?? Our experience was just awful. I've had cafeteria food that was b","useful":0,"cool":0},"pYOUf3os9avN5FSWKMlu_A":{"text":"Thoroughly enjoyed my experience here. The service was excellent as was the food. We order","useful":0,"cool":0},"gdGCk2k2aH9hZFxP2tsoDw":{"text":"This place is the best, plain and simple. There is no way to give it less than 5 stars. Lo","useful":5,"cool":0},"qklhh6yWqWNxikHlpgpnHA":{"text":"Stopped in for some lunch after a local tour.  Lunch is more casual; although I understand","useful":0,"cool":0},"52cQaCHh0Vh45J8KQ3dZpA":{"text":"Many New Orleans restaurants are famous for originating a certain dish, and here, it's Oys","useful":0,"cool":0},"X4emFJbwyDeSy6tiu4dauQ":{"text":"Oof. I never in a million years thought I'd be giving Antoine's 1 star. \n\nMy partner had n","useful":3,"cool":0},"mSmSovSQi-AIPZuGla3VkQ":{"text":"Picked this place after reading some reviews off the web. My group of 8 visited from out o","useful":0,"cool":0},"2LZts5hMdLBZY3DkkM88OA":{"text":"I've wanted to dine at Antoine's for years.   What a disappointment.  We were seated at a ","useful":0,"cool":0},"sKETt_eZOnWG3dN19iSKJw":{"text":"My husband and I went to NOLA for the weekend.  Very excited to try this landmark restaura","useful":1,"cool":0},"3Rud0etVjjOsN_OztduA5Q":{"text":"This is in my top 3 NOLA favorites. Always a fun experience. Fairly dressy. Service is exc","useful":0,"cool":0},"IBde6Z6MZzsJeEHLUoheCA":{"text":"This place was supposed to be one of the highlights of our New Orleans trip. This place wa","useful":0,"cool":0},"sOww0-4C03qpKHGvFEd3Cw":{"text":"Gabrielle is amazing! Literally the best server we have had in New Orleans. Great food as ","useful":0,"cool":0},"ohBhmGaXwk-19xM0inddyw":{"text":"Outstanding old line New Orleans Creole restaurant!!!  Many people describe Antoine's as a","useful":7,"cool":7},"dbPtsK32PWHK2zFGPmDR8Q":{"text":"Dinner night here went good as we had the escargot appetizer and was really good with the ","useful":1,"cool":1},"NPwONr0-0iZc5rIZkeB2IQ":{"text":"I was in town for a girls weekend which happened to coincide with Coolinary Month.  Fortun","useful":6,"cool":6},"DQ29fwCGJZOHeRMr7rI2PA":{"text":"Wonderful place great food old school flavors amazing service great good hot bread \"crusty","useful":0,"cool":0},"KMGxL8wF0vQpWZMoYGpYgw":{"text":"I gave this only one star because the food was just so-so and the price was exorbitant for","useful":0,"cool":0},"q6YEktwZRvV60u3Y-3qP4A":{"text":"I've been here a few times for the 20.18 lunches. For a mere $20.18 you can get a three co","useful":4,"cool":3},"NZvwjO6-uORWhGb5jBTMJQ":{"text":"Antoines is an excellent restaurant in New Orleans that provides tasty food, great custome","useful":0,"cool":0},"eb7hk4qk7DM-lMJggAr17w":{"text":"there's nothing quite like shrimp and grits. especially in NOLA and especially at Antoine'","useful":3,"cool":4},"ZIL16J9tQ28MudzTYnGPnQ":{"text":"Very good food, my wife and I both had shrimp creole and the food was simple but good, bes","useful":0,"cool":0},"IZk9VdjN08E-yyUOp0WvCA":{"text":"Where to start! We picked this place because they have a $20.20 Winter Lunch Special which","useful":2,"cool":0},"1Z9UdriopRJ0PiZ7qEQxgQ":{"text":"Antoine's was a win in my book.  The restaurant is a staple in New Orleans, having key rol","useful":1,"cool":1},"Mff_eeWeIYDjxxACPuDjIQ":{"text":"The menu is nice with a variety of things listed. We got the escargots à la Bordelaise, oy","useful":0,"cool":0},"9KDiOoIl309CGEWUMr4qIw":{"text":"My travel companion picked this place because it's said to be the oldest family owned rest","useful":0,"cool":0},"rqrzx8KDDQKx6hFM0teb2Q":{"text":"A bit dissapointed here but a nice old historic building, the inside of this restaurant is","useful":2,"cool":1},"-6-o28fAAFYtQ2A07nW2YQ":{"text":"Having been on a good tour a few years ago and getting to hear and see the history of the ","useful":2,"cool":3},"dnaZryyc92oWoCa37JDzDA":{"text":"We had reservations for 9 people at Antoine's and all ended up leaving upset. The service ","useful":0,"cool":0},"hUOcwMh-VGaFj8u11MBx9w":{"text":"Antoine's is an experience. The service alone is IMPECCABLE with very knowledgeable server","useful":1,"cool":0},"yCbNsZUn5ZRGILao0Xn9eA":{"text":"If you are looking for a fancy white table and black bow tie restaurant come here. I came ","useful":3,"cool":0},"gc_6_GmD52oAUrjtsfqvkw":{"text":"This is an unbelievably exception restaurant. A huge selection of oysters and escargot on ","useful":0,"cool":0},"u-ACOP9-mVmYo4OWyMdnzQ":{"text":"Completely bungled our order. Ordered and waited and then were told 30 minutes later they ","useful":0,"cool":0},"xGIMuLCHWZchPG11D9kPpQ":{"text":"Food was really good. I went for a bridal dinner and the three course meal was really good","useful":1,"cool":0},"-ju38XfttiQyJax0_sYO7A":{"text":"What a lunch treat we had at Antoine's today. I was told this was the oldest restaurant in","useful":0,"cool":0},"pAxuE-VqrnVJ6sX0ZNALpw":{"text":"For a restaurant with such a reputation, this was an exceptionally disappointing experienc","useful":1,"cool":0},"EWzT3DmEH-I_BEvHwcAugg":{"text":"Oh Antoine's! \n\n   Your wonderful history, delectable food,  and historic service is known","useful":3,"cool":0},"cbDOR3nFUf5gg-9ZUd3XIQ":{"text":"Over all embarrassing experience and left feeling very discriminated against. My girlfrien","useful":1,"cool":0},"vgaYJ1pkXNNs6wCv49syQQ":{"text":"I'm taking off one star because we started the evening at a table nearest the ladies' room","useful":0,"cool":0},"OFfyrtJ3fpsuJ6YwwD8BpA":{"text":"We wanted to give the infamous Antoine's a try so we made reservations as suggested. We sh","useful":0,"cool":0},"es5aAVNvxBqwjBg_rJHxzQ":{"text":"We tried this on our last night due to its long standing reputation.  So, the salad was ju","useful":1,"cool":0},"TJSjNOSfRq6R5TUIvXLaKA":{"text":"Stopped by for supper on business. Very classy place. \n\nThe Oyster Rockefeller was very go","useful":3,"cool":1},"-nC0xCY_bJog-HjqGtUuvQ":{"text":"I can't help but give this place a 5 star review every single time I dine here. This past ","useful":6,"cool":3},"1A4PBtnGr8sK8QU9LDxyiA":{"text":"When I walked in I was in 1920's  Paris! Classy and elegant!  I ordered the side car to dr","useful":1,"cool":0},"qQ2i-L6yhzNtJqmmXpvxFg":{"text":"Maybe in the 1800s the food here was good, but in 2015 I will have to pass.  I feel so bad","useful":5,"cool":1},"fU4dRqVTL3DmJwWGX_0OSg":{"text":"the food was average but what makes the visit worth it is the sites rich history. i recomm","useful":0,"cool":0},"Gp4HPJvgmkipGqVb7SOasQ":{"text":"We were walking in the French quarter looking for a place to eat and stumbled upon this pl","useful":0,"cool":0},"Vlvn-o2VOPcZQpvJhUd_Aw":{"text":"I was so underwhelmed by the entire experience. Food was alright but not spectacular, serv","useful":2,"cool":0},"5BjCIIQXDK4IImhFzooGNA":{"text":"Where do I start?\n\nTook 18m to be greeted by a server for a party of 12 in the back room.\n","useful":0,"cool":0},"KX7CIl8DEPVkttqJjffS_A":{"text":"Invited to Antoine's for a business dinner and we were very disappointed. Party of 12 were","useful":0,"cool":0},"Z_i40B_LBqGV20FeoHTVaA":{"text":"On that real real, this place was average. Good atmosphere and drinks, but the food was ov","useful":0,"cool":0},"t1DkvJZoIbCqeA6RfUrTag":{"text":"Very disappointing.  The service was mediocre at best.  Food arrived cold or not at all.  ","useful":0,"cool":0},"rs8ELDLfJK6evS7kFIxYcQ":{"text":"We only had the original oysters Rockefeller and were so disappointed.  Middle was uncooke","useful":0,"cool":0},"ozR94X_5kR2YCbgX2Ns6fw":{"text":"We went to Antoine's for the $20 Lunch Special while visiting New Orleans and were NOT dis","useful":0,"cool":0},"jr6mAsAkA6svUowfCrQdSA":{"text":"If only I could give this place zero stars. This may have been the worst dining experience","useful":0,"cool":0},"ljjsIwnwtSsrtSjpfsHVjg":{"text":"I and my wife liked their 20.20$ lunch special. Charbroiled garlic oyster was delicious. T","useful":1,"cool":0},"EuJWX679pyQxSVXpDDF6wg":{"text":"Excellent  service, nice ambiance,  and fabulous food!!! I ordered the trout Almondine  an","useful":0,"cool":0},"QA0m2bUJFJ-EOVVwLn_TpQ":{"text":"Best boozy brunch! \n\nI had the best of intentions going into Antoines - we had a lot of si","useful":5,"cool":3},"D1N0xGfyjSVlRg-zsMak4g":{"text":"My out of town friends want to come to this  place because it does have history. The oldes","useful":0,"cool":0},"94lpyE2N7MvQKhEwHdq3Yg":{"text":"We dined here for lunch on a Saturday. The food was okay - oysters Rockefeller was mostly ","useful":1,"cool":1},"cl_2Oq0bO-v9zIIxjKRI-w":{"text":"Went today for the first time with my boyfriend. We were greeted nicely and lead to our se","useful":0,"cool":0},"fYm4nHIVhzJKhISiO4tzTQ":{"text":"This is the place I picked to have dinner before I asked my lady to be my wife. This place","useful":2,"cool":2},"p9UXJn4LDjAxmKBbWqheKA":{"text":"We went here with a large party. The put us in an absolutely beautiful room that wowed our","useful":0,"cool":0},"49s5KTwGuSpqqzI7abYBZg":{"text":"History oozes out of Antoine's.  You don't go just to have a nice meal, you go for the who","useful":3,"cool":2},"-auxSZ8m2Q7jBzVcVgx1Hg":{"text":"My family and I came to try Antoine's on a Saturday afternoon after reading that it is one","useful":2,"cool":1},"EM2EjxpRRjow5rs70VR9qw":{"text":"I really like Antoine's Restaurant.  It feels like an old New Orleans fine restaurant from","useful":0,"cool":0},"oS20-Q6YdxzRLQPsjd62sw":{"text":"From a food perspective, this is a 3/5, but from the perspective of a historical relic, it","useful":0,"cool":0},"rGlSKn1sMAfu3Xd6APcuMA":{"text":"Stopped in for lunch and what a treat it was!\n\nFirst off if you go in for dinner NO shorts","useful":5,"cool":2},"Wt7V9orBkpJuHFh__f4fww":{"text":"We initially had a reservation for Arnaud's, but the timing of the events of the day, part","useful":1,"cool":0},"3GIhGDnl3ZLNLmAYJ6iz_g":{"text":"This review is a limited one because I dropped in on this very classy and classic New Orle","useful":0,"cool":1},"yRryjD8O6Q_ulRccHLQeiA":{"text":"Antoine's has a long-standing history, sure..but I only came here for the 25 cent martinis","useful":2,"cool":0},"UfeZzeIVDMs7pRtkTHBTog":{"text":"This is a beautiful restaurant with great service!  The Baked Alaska was amazing!  But we ","useful":0,"cool":0},"umRL6sYNvgmhQFhKlAsWkA":{"text":"What a cool old school place to visit! Its nice to see there are still places around that ","useful":0,"cool":0},"cRT4bybJFo3BIV1uOzJB9Q":{"text":"Service was ... rough.\nFood and drinks were phenomenal.  That made up for hectic and not g","useful":0,"cool":0},"2n9t5obLA7r_o_k4GBUqtA":{"text":"This place has mediocre food at best. My gosh, not what I expected from such a long standi","useful":2,"cool":1},"8vNvRb89TuhZ4al-ers3Lw":{"text":"TOURIST TRAP!!This place is cruising on history and not current greatness. \n\nFood was only","useful":0,"cool":0},"iyNPjsxlW6TgBB5Z6O7pdw":{"text":"Our first dinner in New Orleans omg it's a tourist trap! The people who work here are grea","useful":1,"cool":0},"ypp6nTyqcm6WHM0cKVnbmw":{"text":"Very nice restaurant in the french quarter. Really good food, more upscale. The dress code","useful":0,"cool":0},"YF-7Sb8EWMt5rh9WUl1vhQ":{"text":"For me, five stars. Others in my group did not enjoy their meals as much, so I think this ","useful":3,"cool":0},"JWpsLg1NHD3EgQTzTKw3yQ":{"text":"This was the most affordable and upscale meal we had during our most recent stay in NOLA. ","useful":2,"cool":2},"X8zQeSy2rX80hzNQUATx6A":{"text":"This my favorite restaurant in NOLA. The atmosphere and the food are amazing. Our waiter C","useful":0,"cool":0},"la_Mu1Nm22zRHr4KdbbGdA":{"text":"May be New Orleans oldest restaurant but it tastes as bad as food did 150 years ago, so th","useful":0,"cool":0},"Q4aNpYCj90RuF8foPMmHNw":{"text":"I've been going to Antoine's for many years and I'm done. The food was garbage. Embarrassi","useful":4,"cool":0},"IUQ1-jfa4Bb4RGe-d6T2FA":{"text":"Not the best food. Great service in an excellent atmosphere. Highly recommend the 3 course","useful":1,"cool":0},"5ZWCf6zJa04Fdo72M-TTNg":{"text":"We were looking forward to dinner at Antoine's Restaurant.  It came highly recommended by ","useful":0,"cool":0},"-YrywlEUR1QTvY98EtaaxA":{"text":"Love this Restaurant! Oysters Rockefeller are my all time favorite of any food at any rest","useful":0,"cool":0},"D4ISSFwXe8osuDb2SGELDw":{"text":"I had a steak with potatoes au gratin. The steak was good. I wasn't a fan of the potatoes,","useful":0,"cool":0},"QkDNEsW4HEPmr693-LKS_Q":{"text":"Antoine's is surviving off of their history these days. They still try for the hoity toidy","useful":4,"cool":1},"biO10xx3WiaB7Ijee-DzLw":{"text":"I'll keep this straight to the point. The place didn't live up to the hype. The food was d","useful":3,"cool":0},"zifrK4z2dgLr79har8tpEQ":{"text":"We had lunch here based on the recommendations of friends. We had reservations and got sea","useful":0,"cool":0},"nJobSrSteTnYh4m291EnJQ":{"text":"I had always heard and read about this restaurant so finally got to go; for lunch. I had t","useful":0,"cool":1},"QW5zTq0lNVVsUmzmkAh7zA":{"text":"MB, my colleague, not to be confused with the other, took me to dinner at this legendary r","useful":6,"cool":6},"rwHwMACrJbxa-cnrp_lM-Q":{"text":"we love this place. but this restaurant has an average of 3 stars. it should and it should","useful":0,"cool":1},"t8x69EF2kP65P0pd17c6jg":{"text":"We made a mistake coming here. It is advertised to tourist as this grand culinary experien","useful":1,"cool":0},"MsraYkd1Kw3YL5AdizrtgQ":{"text":"My husband and I had dinner here on Sat., Apr. 17.  We were looking forward to our dinner ","useful":0,"cool":0},"or_EqfrEeujm6DzK-75waw":{"text":"Great date night spot. I've been a few times over the years but it's been a while since I'","useful":0,"cool":0},"sZ49Z3zbsoDeos1rBcz7MQ":{"text":"I typically love Antoine's but it is post Covid and I know service is much spottier than n","useful":3,"cool":0},"Co_0SFDenVxuNstiFeQmTA":{"text":"The tradition lives on! Eating at one of the oldest restaurants in the country & being ser","useful":0,"cool":0},"XHAiol0q8oowfHVCrkpxkg":{"text":"Where to begin to review the oldest restaurant in the French Quarter. So, I thought that b","useful":0,"cool":0},"iDI5c552wpopNNjFMLr2PA":{"text":"We were really excited to eat here as it was our final spot during a friends bachelorette ","useful":0,"cool":0},"M64Gp3oL9jXB5X_E-M-oFw":{"text":"Utterly disappointing, too expensive for what you receive, mediocre service (although our ","useful":0,"cool":0},"rO00MoSE11xfxHR6VXCijg":{"text":"Antoine's was our first meal in New Orleans.  I picked it because of it's location in the ","useful":1,"cool":1},"-TRaSGp-YpuNS6KdPT_xyw":{"text":"Great place to celebrate birthdays.  This is a New Orleans legend.  It's a must visit when","useful":0,"cool":0},"rK332KS4KUdom1xvp3dGIw":{"text":"Antonie's is a must stop when in New Orleans.  Make reservations as they do fill up.  We h","useful":2,"cool":1},"xi3x86KzOcCAeGjr-C6gyw":{"text":"Made reservations to eat here based off a recommendation we received and we're glad we did","useful":0,"cool":0},"-dAx1VivUfcgAHK_VCY_DA":{"text":"This restaurant was on my \"must do\" list for our New Orleans visit, so I was thrilled to f","useful":3,"cool":1},"ZJCxwiApD_Uu78eQkN76Zw":{"text":"As classic as classic gets. Bottomless mimosas were a blast (with the correct oj to alcoho","useful":0,"cool":0},"kz9FWQa0gjOVHb6cahHSHw":{"text":"Had so looked forward to this reservation. I got my vacation days mixed up and they were g","useful":12,"cool":4},"Z2r_BHaqZI_crXFTcHwAmQ":{"text":"Our experience would warrant 6 stars, if that was possible!  We mostly chose the special l","useful":3,"cool":1},"H_5mVysscJnd_tOw9S13ZQ":{"text":"I cannot believe this place only had three stars! We called last minute with a big party (","useful":0,"cool":0},"5a5vTPtt0yBqfS0_kmlSEA":{"text":"We went to this restaurant 5 years ago, and were thrilled with the food and the service.  ","useful":1,"cool":0},"7ybQHmxyLO5sLMMQ72kaEw":{"text":"Some restaurants of this age tread on their reputation in New Orleans. Antoines is still v","useful":3,"cool":1},"OnppUVKQgnkAcDoZE2aY6Q":{"text":"Went for the Winter Lunch Special. Loved it! The wait staff was great and the food was awe","useful":0,"cool":0},"lDMZqbEG3t-mQeiKkzrcGg":{"text":"The only reason this place gets three is because our poor waitress was a jack of all trait","useful":5,"cool":0},"3UTFtZWfQkzb3gHTMqCXvQ":{"text":"When we visited New Orleans a couple of weeks ago many of my friends said 'you have to go ","useful":1,"cool":1},"NcZCok7lGBZ90fR65wA6-A":{"text":"Antoine's is of the most historic of the old school French Quarter dining establishments. ","useful":16,"cool":18},"1NbMBaOAUrZGVPR0uu8y1w":{"text":"Incredible!! Amazing place! If ever in New Orleans this place should be on your list.I hig","useful":0,"cool":1},"huG_tGIVKSqkKg19IR0V4Q":{"text":"I'll pass.... We went for the $20.14 lunch and .25cent cocktails.  Who can complain about ","useful":2,"cool":0},"jpGsgsvBnD25sbWdj3xBAA":{"text":"I might be in the minority in my opinion but I wasn't impressed. Other than being able to ","useful":4,"cool":0},"p8FXLw7E8fxg_-rh_JyWGA":{"text":"The food was HORRIBLE.... But the worst part was our server, she looked almost disgusted t","useful":1,"cool":0},"NzbyM8NVmwh00313IjT2sg":{"text":"Unfortunately, and I hate to say it....our planned ahead date night was somewhat ruined by","useful":0,"cool":0},"JF704MDa3uOXFNTSYhSODQ":{"text":"The food was fantastic; the atmosphere and quality of service was good but did not create ","useful":0,"cool":0},"XCWVAzJ7FaqYj3tFohgECQ":{"text":"When I was growing up, my dad worked in a well known French restaurant in Oakland so I gre","useful":3,"cool":3},"taBc5y0M2qIj7IeezaHQ4w":{"text":"Always great service, foods and atmosphere. This is a no brainer when looking for a histor","useful":1,"cool":1},"CiPfJWUPJzBXgvc2y29l7g":{"text":"If it was possible to give this place zero or even negative stars, I would. Let me begin b","useful":5,"cool":0},"ESJhEAsihqsVgXDu78d1IQ":{"text":"Incredible service. Ask for gregory to be your waiter. He was wonderful!!! Recommended all","useful":0,"cool":0},"471tl0-Rm4Sa0QKasHIiPw":{"text":"This was my third visit to Antoine's and frankly, I feel the place ran more off its histor","useful":0,"cool":0},"PrbeMLCrMIxnWZusxWVgsA":{"text":"The most pretentious restaurant in NOLA in my opinion. Maitre D's were arrogant, obnoxious","useful":1,"cool":0},"0t5piJYh4d1lPzaF3bRRaQ":{"text":"I was able to squeeze in Antoine's before goin to the Saint's game. Started with the world","useful":0,"cool":0},"170rGZmgLux0h7EWgU7c0A":{"text":"Used to be that you had to wear a jacket and tie in this place. Now, you'll see more t-shi","useful":5,"cool":2},"z0Q1n1M1bGPenxasBGO7HA":{"text":"New Orleans classic restaurant. Here are my thoughts: \nGreat Live Jazz Music \nBig hall wit","useful":1,"cool":1},"fEjBLc98ny84dZoYkJw0_A":{"text":"Food is ok, real French. Waiters not excited at all. Service extremely slow, you'll need a","useful":0,"cool":1},"p4wkB4tgcTzRqR_AY8JTrQ":{"text":"I struggled on how many stars to give this review but settled on 4.\n\nAdmittedly Antoine's ","useful":5,"cool":3},"9aw7GdVDFdFq5phFBtZbnw":{"text":"Staff was good and very formal as to be expected in a restaurant founded in 1840. The food","useful":0,"cool":0},"pn7njlsD76lSuUfYb6rQUw":{"text":"Disappointed. The website stated that there was a dress code and listed the specifics. Thi","useful":0,"cool":0},"QJdjaCbsesUPuU7esvTxGA":{"text":"First time caller, life time fan! Food is great BUT the service is AMAZING! We're talking ","useful":0,"cool":1},"9gPfmwWgs0J6UcB_riDnyQ":{"text":"haven't been to antoines in ages and now i know why.  food and service pathetic, sad to li","useful":1,"cool":0},"aZJbQGDUbM2KOd_ZBoojHg":{"text":"We went during a Sunday jazz brunch. My husband ordered Eggs Benedict (with was ok) and I ","useful":1,"cool":0},"LFsPhYx4N8KCyiOagfJXLg":{"text":"This place has lost the plot. Maybe was good in the heyday, but needs to change to stay al","useful":3,"cool":0},"BQOYNQfxRlkIWK-CWHOS3A":{"text":"What was once an elegant event in old New Orleans has become a Times Square-like spectacle","useful":0,"cool":0},"9oR0W7kEe8PmYO0hK0IOAw":{"text":"Came here for my husbands 25th birthday! \nSURPRISE... despite informing them a week prior ","useful":7,"cool":1},"5zjfZCH7L02LMEjmRopb-A":{"text":"Good was good,, great price , staff was AMAZING,, after dinner we had a tour of the restau","useful":0,"cool":0},"v-wNFTTgAbX9pnW_d1hb4g":{"text":"I loved Antione's. We came here on a Friday and got the lunch special (3 courses for $21 -","useful":1,"cool":1},"FOFtqC8V7vEUHIJNT05CIQ":{"text":"The food was over the top excellent! The service staff were kind, professional, and all to","useful":0,"cool":0},"gTyOamZoM7q4iktIVTHT5g":{"text":"We had a great server. He was informative and gave us a tour of the whole scene backstage ","useful":1,"cool":0},"Slf7nr6X_6fGF9BHYGsf6g":{"text":"We went here for drinks and appetizers at the bar. This place is a place y can go for dinn","useful":1,"cool":1},"1M7Vj-PeVgYpciryPMl_vA":{"text":"Antoine's gets 3.5 stars for the food and another half star for the service and staff.  We","useful":2,"cool":1},"4pm2d5INxV9nN70HI7c8tA":{"text":"Idk why there's bad ratings. I loved this place! I got the pompano pontchartrain with lump","useful":0,"cool":0},"PsExP6QA_wZjA5P-A2SA-g":{"text":"I was excited for a jazz brunch at Antoine's. One of the most famous restaurants in NOLA, ","useful":6,"cool":1},"SSCRtZTd-S4lISH4XDMC-g":{"text":"The oldest restaurant in New Orleans.\n\nIf you want to immerse yourself in New Orleans cult","useful":4,"cool":3},"DPpekXrPbvtFAdnm6aFtzg":{"text":"3 stars for great service and rich history. Tried the Coolinary. Food was just alright. Oy","useful":4,"cool":1},"JzxUSaGET7L2JP9TZOdeSg":{"text":"Another Restaurant with a Dress code, but a much different feel than Galatoire's. \n\nThe dr","useful":3,"cool":0},"LlDV8MOOa_2jutFwaxp3hw":{"text":"What an amazing first dinner in New Orleans! We ordered the Oysters Rockefeller, escargot,","useful":1,"cool":0},"NC8ULyOvd78_u9Ub-6y3gA":{"text":"Horrible customer service - had a reservation here for 2 months and was turned away at the","useful":0,"cool":0},"C74yCTXpzEfWovSaaIDniA":{"text":"Go here for lunch because it's an old historic restaurant (the oldest in NOLA) and because","useful":4,"cool":1},"OoT1L_Y9FPepOrr3qpSXqQ":{"text":"We were lucky enough to enjoy lunch this week with fantastic $20.20 deals! Bottomless $15 ","useful":0,"cool":0},"onA-IHn--FsmEZe-ag196Q":{"text":"SCALLOPS MARSEILLES, buttery light in an heirloom tomato cream sauce over grits;\nQUINTESSE","useful":6,"cool":4},"hhhY9heDB4gITXVT-HgK1g":{"text":"A few years ago I had drinks in Antoine's Hermes bar, and I remember thinking that I'd hav","useful":17,"cool":14},"bBe-vOBoxBGu-QYyXWW_7Q":{"text":"Our first choice for a dinner this time 'round the French Quarter of New Orleans, December","useful":5,"cool":1},"QbQqgEPXwH0WFa-fscny7Q":{"text":"We went here for brunch. It was great. We would go back in a heart beat. \n\nBottomless mimo","useful":0,"cool":0},"Hn68U9khCW21zmDCWxJaWQ":{"text":"Antoines was disappointing overall.  Seems to be resting on its laurels. Would give it 2.5","useful":0,"cool":0},"oX4WH4cmozLGHDtRFtYYsw":{"text":"First, I gave one star because there is no option for negative stars. We had such great op","useful":1,"cool":0},"JZBcS9a4224p8q_6DK8KFA":{"text":"We had heard rave reviews and we were not disappointed. To minimize the expense we went th","useful":0,"cool":1},"fJobRhW0tHVEx3-CTBH-NQ":{"text":"We decided to come to Antoines after Christmas Eve mass at the St. Louis Cathedral. We hun","useful":1,"cool":0},"maBNcEFRHmOMzb8y2jSE7g":{"text":"I came here for jazz brunch on Sunday and was very excited to see the inside! We walked ar","useful":2,"cool":0},"m734w9PQS0FbjNBd_xrXCQ":{"text":"Antoine's Restaurant in the heart of New Orleans' French Quarter is far more than just a r","useful":17,"cool":8},"UOsWoeRa3zep3OgLa6HnXQ":{"text":"We had a great experience at this restuarant . We went during lunchtime and had their $20 ","useful":0,"cool":0},"5xpmy1VfOXhkAep04y50vw":{"text":"Antoine's Restaurant. It's an amazing restaurant. It's over 100 years old. I was lucky eno","useful":5,"cool":4},"ktuJpUYLDuW6uEdf72MS3g":{"text":"I came here for my birthday because a local friend of mine recommended coming here. I had ","useful":0,"cool":0},"kqWephkkMvqN9KdlPHjk2g":{"text":"We recently celebrated our class reunion at this restaurant.  It is a shame that the porti","useful":0,"cool":0},"eUCCC9QSDypz6gZiP0HIaQ":{"text":"Went for dinner,  heard about the hype. The service was impeccable,  the staff is extremel","useful":2,"cool":1},"wULRiXtDe8ZphvVmb0JAvg":{"text":"I ate dinner at Antoine's Restaurant in New Orleans, LA on 4/16/2015.  Even though Antoine","useful":1,"cool":2},"3trMkeqoFT9TqhLruDozPw":{"text":"Nice ambiance ... Food was AMAZING .. that bread pudding was really good. I would definite","useful":1,"cool":0},"YSJFrpfi1kKNbMLy9vHKFw":{"text":"The home of oysters rockerfeller has become the home of oysters grey goo onto of an oyster","useful":0,"cool":1},"71t2xUiPWVBsMasAow7eXg":{"text":"Best High class restaurant .  World class.  Must have baked Alaska and eggs Benedict.","useful":0,"cool":0},"BBDlzYAhCxm_uKmx6mUmqw":{"text":"This is a very old-school New Orleans restaurant. It's also a very good New Orleans restau","useful":3,"cool":0},"tXJ-tVbHAF5iAYHSjHavLA":{"text":"Loved this historic restaurant and we decided on making a second trip here for Mardi Gras!","useful":2,"cool":1},"isCQ1gCuyIh9y6zqpBEZ5g":{"text":"I had somehow missed dining here after almost a decade in the city, so this past weekend I","useful":0,"cool":1},"3kKvx04vUmlahfyzpEKkVA":{"text":"Very disappointing. Oysters Rockefeller was great.  The gumbo fell flat.  Shrimp and grits","useful":2,"cool":1},"UGv4VQkTMw4e2KYEbk9gkw":{"text":"we made our reservations to celebrate my 63 birthday over a month ago... then about three ","useful":4,"cool":0},"MLBPiGxwvu2XtiSNkJUogA":{"text":"I have been to Antoine's numerous times and have never enjoyed the food. However, I do lov","useful":1,"cool":0},"UByVMZlMZdM6e0khjFQMxg":{"text":"I came for Sunday brunch.  I originally wanted to do the pre-fixe menu - the one on the we","useful":1,"cool":1},"1U2Zeb6Vl1TPHUd1QF3OwQ":{"text":"My friends and I visited this restaurant on a quick getaway to New Orleans. The service wa","useful":0,"cool":0},"ipodQvk0c0jq59vrX5xiSA":{"text":"So cool to be able to eat here!\nThe oysters are amazing!\nThe service was great!\nBottomless","useful":0,"cool":0},"EGC1_B6eFKSBzC20aErQFg":{"text":"Worst dining experience ever. We had to go to the bar twice to get our own drinks, sat at ","useful":2,"cool":0},"NhMEBsgZphnrg4QjkMeQOg":{"text":"I have to start by saying Mayur is the best. He made some excellent recommendations and al","useful":0,"cool":0},"Zvs_SJNSpNhHdCbDRdIxpQ":{"text":"Extremely disappointing! I very rarely write a bad review but In this case I made an excep","useful":3,"cool":3},"cmcBx_Rpja1pG4ulIJsNrA":{"text":"I went to Antoine's for the first time and enjoyed it but probably will not go back.\n\nWe h","useful":1,"cool":0},"SAqUmw0nssPjvnmiv0oArQ":{"text":"Great place for dinner, ended up crashing a wedding upstairs and at the 1840 room. This re","useful":1,"cool":2},"UdapcQS_c_MXPb1qho3Dyw":{"text":"Great New Orleans original! We stopped in for brunch with the jazz band playing. Started w","useful":0,"cool":1},"3UiPVA36pJsypNIpbVkEEg":{"text":"Over the past few years my girlfriend and I have fallen in love with New Orleans; the food","useful":10,"cool":10},"akrYm5I5X5bItmDCeozRig":{"text":"So pleased with my experience at this cafe. Was frantically running around looking for a b","useful":1,"cool":1},"5crvtvVtHL8QQ56-NiCskQ":{"text":"Yes, the menu hasn't changed in 160 years, but that's one of the things I like about Antoi","useful":7,"cool":4},"HJdrz3eSLzrrnMhuI6JzCQ":{"text":"The lunch special is Monday thru Saturday. It's three courses and only $20.20. Can't go wr","useful":1,"cool":0},"ozFfV_4OwI4T62oIp3lKIw":{"text":"My husband and I went to lunch today and I'm sad to say our experience was disappointing. ","useful":2,"cool":0},"ZibtEV_deOS_bNNv2QlFNw":{"text":"We had our wedding dinner here. The food was delicious and the staff were very responsive.","useful":0,"cool":0},"-X2AcN5chZogJtvOYsOaTA":{"text":"No tour of French Quarter is complete without a mention of one of the most historic restau","useful":2,"cool":1},"j7eDpK_z8QqFUX72ZgdZVA":{"text":"If you're going to this restaurant to go to the oldest family owned restaurant in New Orle","useful":0,"cool":0},"YXXD7adDZjmxU8VToMllFQ":{"text":"Ask for Hazelforty fifth anniversary made more than special.  Food was excellent and well ","useful":0,"cool":1},"mTqiglxsRdbxZuywmewk2Q":{"text":"We  had the lunch special and it was fabulous.  Those char-grilled oysters are unbelievabl","useful":0,"cool":0},"vKDJPN3pMAfcXUTifIEWmg":{"text":"Food was excellent and service from all staff and especially our waiter, Silver, was 5 sta","useful":0,"cool":0},"QZ3ZdCn4ZysXPlOaBqX2lg":{"text":"What a total disappointment! We were expecting a New Orleans staple to be so much more, bu","useful":0,"cool":0},"ghWcdTjf-HV2PqfPHBS4fQ":{"text":"This should be everyone's first stop in NOLA. It's the oldest running restaurant in Americ","useful":1,"cool":3},"z4-7WppSAH3fbXzgb6VcLA":{"text":"Disclaimer: I know and have dined with the owner whose father is part of the founding of A","useful":7,"cool":4},"RjWk9AaNHf4f5M5sNdOzBw":{"text":"Oysters are on point. No joke the Rockefeller is great but I would recommend trying all 3 ","useful":2,"cool":0},"GBakivCTh3lZ4vrZiaz3aw":{"text":"This was a severely disappointing experience. For supposedly \"one of the best\" restaurants","useful":2,"cool":0},"sut4K-FdPl3PIeVt0FpixA":{"text":"Merde......Sucks!  I used to, used to love Antoine's.  Antoine's  is one of the oldest Fre","useful":20,"cool":14},"W3NI7FKxYnW4EvxgiA4Gcg":{"text":"Surprisingly disappointed. I expected so much more from this legendary restaurant, which h","useful":2,"cool":1},"8CUWCToDgPoFThDv8fRk3A":{"text":"I'm disappointed to leave a 3 star review,  because my 1st visit 2 years ago was amazing, ","useful":1,"cool":1},"grlxLcNmw5UK9BD_6AOX2w":{"text":"The history of the building was cute and old but the food was really bad.. it started with","useful":1,"cool":0},"AEr4H-QYNfJQ22t4oDpcvA":{"text":"5 stars for: atmosphere, food, and service. \nMy boyfriend and I came here after multiple r","useful":3,"cool":2},"M_pY9_9R5yMl-4MuXJfPiQ":{"text":"You won't be disappointed. Escargot, Oysters Rockefeller, Oysters Foch, and fish amandine ","useful":0,"cool":0},"uNbAnkl7iB9SF4ZeqvKmzA":{"text":"Extremely enjoyable experience with top notch service throughout the meal.  Seafood gumbo ","useful":0,"cool":0},"bUP_llfc5DJvDfiO7fJKBg":{"text":"I love this place! \n\nIt starts with the service. The hostess was sassy but personable, Mai","useful":2,"cool":0},"wuhi8CiDZUOuivJ1WTAFrA":{"text":"For first timers, like us, to New Orleans this place is a must--because of its history, at","useful":0,"cool":0},"eQuglVBTJ-bLaFb2_wpufw":{"text":"Amazing birthday and engagement dinner with my fiancé.  Steak was amazing and baked Alaska","useful":0,"cool":0},"pV9tpJoCWZ4-t33WnFBD2Q":{"text":"Probably the most overpriced, overrated restaurant in all of New Orleans.  I understand th","useful":0,"cool":0},"5zL8t-6cN9z1PTzdP1w4BQ":{"text":"Disappointing and embarrassing.  Food was bland and service was abysmal.  Must be survivin","useful":0,"cool":0},"Dp75v8VyCd3pVsAR6LllAQ":{"text":"Antoine's is the second oldest restaurant in New Orleans and there is a reason it's surviv","useful":15,"cool":13},"G9aw3qdhlcersAMIdg3DgQ":{"text":"Dinner at Antoine's was a major highlight of my recent (first ever) trip to New Orleans. M","useful":1,"cool":0},"dMk6sSyf76zfaQN4EBdccw":{"text":"One of the grand dames of the New Orleans culinary scene.  This place oozes old world char","useful":2,"cool":2},"3ij9oojmSYsRE3rWX-ECXw":{"text":"I can't give enough praise to Antoine's. There's a reason they've been around since 1840. ","useful":0,"cool":0},"VQkpbnDyoNYJneiE9KfEzg":{"text":"While we got off to a bit of a bumpy start, as there was some confusion on which server te","useful":0,"cool":0},"rG_SvZ0vTCgS39RAN2Z38w":{"text":"What an embarrassment this place has become.  I made dinner reservations via open table fo","useful":2,"cool":0},"PT6HWmeIXZtbJgV4I8HsNw":{"text":"Very disappointing experience. Average food, dismal service. After making reservations, be","useful":0,"cool":0},"cn3YktqB40q4_JkniANvuw":{"text":"First time to New Orleans! A friend that grew up there told me I have to go to Antoines.  ","useful":0,"cool":0},"2WFTarHgQTvctmDO176PlA":{"text":"Service was great, ambiance was nice... but the food was overall just OK. French Onion Sou","useful":0,"cool":1},"aeNu4ryRvNdeLs8nAT_gIw":{"text":"We made reservations after seeing all the reviews. We were here for the jazz brunch on 2/2","useful":1,"cool":1},"wckstFsuW5U3Jmp67U2Gtw":{"text":"Had a work dinner here last night, and while the atmosphere and service were great, the fo","useful":1,"cool":1},"BMIe3XDCiMZi_wEBp5Wa9w":{"text":"I visited Antoine's for the first time yesterday with my boyfriend. It was excellent: wond","useful":0,"cool":0},"C05DF184X6rXWD_NvvAHQQ":{"text":"I attended a dinner of twenty people, Half were locals who had eaten at the restaurant sev","useful":0,"cool":0},"4VvT3e1TBwbVRFpLQv7dAQ":{"text":"The only reason it gets one star is the waiter was personable and you can't give zero star","useful":0,"cool":0},"EUrmkmf8-EG-9-Rf6xAwfw":{"text":"Eating here is a right of passage for anyone visiting NOLA that seeks an enduring memory. ","useful":1,"cool":0},"NbAtI5lqaOJjWYi9g-1pkg":{"text":"Desiree is an amazing bar attendant and bartender. The Hermès bar attached to Antonio's is","useful":1,"cool":1},"RphQsEsRRV1_Yj2E9GqHUQ":{"text":"Great food, great drinks and an awesome WIne cellar. TOok a tour and it was a great experi","useful":0,"cool":0},"Zt_Z8IirFfw43N-GcaC12w":{"text":"I started with a French 75. I was a bit nervous because I'm not a big fan of gin, but I've","useful":12,"cool":12},"sBUP3BcW3WbvPZgjII53DQ":{"text":"The country's oldest family run restaurant, OLDEST, in the COUNTRY!! That is amazing to me","useful":8,"cool":5},"zBRvoCK25q4c4k7fWHXPfw":{"text":"I came here a while ago and didn't bother posting a review, but I decided to post one sinc","useful":1,"cool":0},"ExTrZ1YAdIRjTH9FLO-dVw":{"text":"For the food ehh it was ok.  For the drinks, dessert, coffee and bread I'd return every si","useful":2,"cool":2},"FzxKSlzmEzM18lfoV98RLQ":{"text":"I thoroughly enjoyed my vist to Antoine's. We went for lunch my last day on my recent visi","useful":0,"cool":1},"Xs2ey2gaurYrHLFATgeh8g":{"text":"Extremely disappointed with Antoine's. I had been looking forward to eating here, but it w","useful":0,"cool":0},"gVPiiEC9JLnVVDSI8AlRjQ":{"text":"My sister took me here for my birthday dinner last week.  We arrived with high expectation","useful":0,"cool":1},"YnKE7Vpk3xxAHQeK3-cVow":{"text":"Go some place else. Oysters Rockefeller were salty, the $30 chicken was dry, the gumbo was","useful":0,"cool":0},"KuDwpSvKsIxczOJ1MSqVZg":{"text":"Antoine's is one of the oldest restaurants in New Orleans still run by the original family","useful":5,"cool":6},"IpulS5FbTK7wYMqU_kh1BA":{"text":"First things first, the wait staff we had were absolutely amazing. They came to check on u","useful":0,"cool":0},"FnHq1MkVIlYxW8M1pfPcGA":{"text":"I wanted to love it, but I just did NOT. For a $$$ dinner, the ambiance was lacking, the s","useful":0,"cool":0},"W_UfUNFtfW9vumjXKFMFVw":{"text":"This was one of my favorite meals in NOLA.\nWe both had the oyster samplers to start. The f","useful":1,"cool":1},"D5poi8vPfyzZ9_zFbla0qQ":{"text":"We come to New Orleans twice a year and this has always been our favorite restaurant. When","useful":0,"cool":0},"bjlgUOi-rHCZ8RnX8mxGnA":{"text":"The most uppity restaurant in New Orleans! I called 3 times and spoke to the reservation o","useful":2,"cool":0},"s9C0Gf_CXKYG63QRVpNS6g":{"text":"Nothing I say here can prepare you for the decadence you will experience at this restauran","useful":2,"cool":0},"iYRDFiQdX1cqR_aggIeMgg":{"text":"Great service, convenient location, good food, and decent prices. This place has a good va","useful":0,"cool":0},"Qm-aSbxEURGR13gjfdgJBg":{"text":"Truly among the three worst restaurant meals I've ever had; memorably bad. \n\nThe oysters R","useful":0,"cool":0},"u-bo-_iC0zzAeXFDc3EeXA":{"text":"Antoine's is a cultural icon of New Orleans. It's known for being fancy and expensive. I n","useful":1,"cool":1},"zFL_Ai2BE9QWDj5d4WEy6A":{"text":"Phenomenal service, hosts, and overall - classy decor.  The prices are pretty steep, but i","useful":6,"cool":5},"26obv_ZdumDehvjt9CE2sQ":{"text":"Very nice meal - wait staff was ver accommodating with our selections of piecing together ","useful":0,"cool":0},"OZR6Pg6dxAP_zrGKH6BI-Q":{"text":"I recently attended a fancy lady lunch with Re H., Katie A. and company and I was so excit","useful":14,"cool":10},"hzzgk1gKzKHr6U0UT57zng":{"text":"For a restaurant that has been around as long as Antoine's has I expected a lot more. The ","useful":0,"cool":0},"J9Ggn8p-FKi3WFuzo8xwAA":{"text":"Oldest family-owned restaurant in the United States. This place really feels like a step b","useful":1,"cool":0},"L4z_FePXu1RMVZtbtZpIdA":{"text":"So great / if you go you *need* to do the $20.19 lunch special with $.25 drinks!! The serv","useful":0,"cool":0},"BREQHlqE87Qzy6SKVKWxsA":{"text":"Antoines is really over rated.  The service was very bad.  The waiter seemed disconnected ","useful":0,"cool":0},"9lUNzUbozvTOEOj_OtTPVQ":{"text":"My least favorite experience when visiting NOLA. \nFood was terrible, sent steak back twice","useful":1,"cool":0},"Zi7iENFBS9e_S9ii92NXBg":{"text":"Formal service by white-shirted, freshly starched servers.  A dining room old enough to ha","useful":2,"cool":1},"4AufbbzvQkSZWRgNM1_UdA":{"text":"Oldest restaurant in the city with a wine cellar a block long!  Traditional New Orleans cu","useful":1,"cool":0},"9kFsDNgh9gcx4CbLvdr8Sw":{"text":"What a horrible experience here. We had a reserved private room with about a dozen locals ","useful":5,"cool":3},"Zph5waksRv_pY4_aSwmWnw":{"text":"What's not to respect and love about a New Orleans establishment that is steeped with a Fr","useful":11,"cool":14},"JT3Qvmk-5ZMEDKHfbbs63g":{"text":"Terrible service and extremely rude!! Would not recommend to anyone younger than 30 as the","useful":1,"cool":0},"OqMr5jNpOGkHJjVqE-JWBw":{"text":"My parents recommended this after visiting 2 years ago. Im 22 and my bf is 23, this was ou","useful":0,"cool":0},"1t6uU5AaRBE-NiYBju9-zg":{"text":"What an amazing brunch! The history and character of this place is reason enough to visit.","useful":2,"cool":1},"UW1Hl5fY0EDJZUZDNtrSjA":{"text":"I wish I can leave zero stars ,  this really saddens me to leave this review,  today is my","useful":3,"cool":0},"1KhysZ8vc_kVCIX2dymEDQ":{"text":"Beautiful restaurant, excellent waiter, but the food was very uneven. Good oysters and sou","useful":0,"cool":0},"gB2s3Keusc8NxekklWbWkw":{"text":"Service was amazing, food was delicious. We even recieved a tour after our dinner is the e","useful":0,"cool":0},"XlouiR_e0Qeaubq8xPEtLg":{"text":"Here is how bad it was. I ate the first oyster and it was horrible. I tried a second think","useful":1,"cool":1},"Kgvp4bmwNFtBx8GTUtIz3w":{"text":"After a morning at Brennan's you'd think you couldn't match that - and yet we did - spendi","useful":1,"cool":1},"ybgiguQ5L5fBFVI2iIUGyg":{"text":"When my Grandma found out I was going to New Orleans,  she told me about her travels there","useful":28,"cool":25},"ENo44vMTxT9gfYRFGNoBWQ":{"text":"This restaurant has always been on my list of places to go eat dinner. Well, I'm glad I di","useful":2,"cool":1},"mVZP8TkhVz4gf1Xgyidsnw":{"text":"When you step inside Antoine's, you are stepping into history. Elegant, every detail is ac","useful":4,"cool":3},"3CDaLxyjmzg926vM6w7Dcw":{"text":"I visited this place during a recent trip to New Orleans. it was suggested prior to my vis","useful":2,"cool":0},"XdkkW9IUcxBs8-uoPHVs8Q":{"text":"PLANNING: I made a reservation online for a Friday lunch.\n\nFOOD: I did the COOLinary menu ","useful":0,"cool":0},"HYpBwkkX67wgf0-pdL21kQ":{"text":"(Special thanks to Chuck Wonycott for the wonderful experience!) \n\nIf you have not yet had","useful":2,"cool":0},"mzL-XUkTacrQ0vF7MxEakw":{"text":"Really great experience overall - a historic location, a lot of history, and the invention","useful":0,"cool":0},"n_NVujqQWCWptbHf-ts-_Q":{"text":"Our experience was nothing short of fantastic. The food was absolutely superb, but what ma","useful":0,"cool":0},"Rn-kNg5KehL7rNVfzGJt1g":{"text":"We happy to get to tag along on our friend's reservation for both our anniversaries.\n\nMeag","useful":4,"cool":2},"pqJGdqWqdwC33mAgodtR9g":{"text":"If you are looking for traditional historical New Orleans French creole cuisine, this is t","useful":0,"cool":0},"gg0t5y-fswQUETS6aPSSRw":{"text":"The $20.19 3 course lunch is an astounding value for food of this very high caliber in an ","useful":3,"cool":2},"VD1m5tT-vKjk0Nr2fWkNGw":{"text":"I had the good fortune to have dinner at Antoine's in the 70s. Back then it was the epitom","useful":1,"cool":0},"f5xLOscdm5BZEagWRliOOw":{"text":"A delightful dining experience. Had only been to Antoine's twice in past 15 years as we al","useful":0,"cool":0},"OQzWLeO70VNy9ViRAg30wA":{"text":"Obtained reservations for lunch early the same day.  There was no wait upon arrival, even ","useful":1,"cool":1},"yRDrbnYrMhrMRM2X2WeHRg":{"text":"It didn't look like it was a busy night as there were empty tables around mine. The poulet","useful":0,"cool":0},"yndqrRSkAW6G0HvvenrQ0Q":{"text":"I had a 5 star meal here a couple of years ago, and was expecting the same upon returning ","useful":1,"cool":0},"lEYv1P5-gbYb1fD4r6NVCA":{"text":"Popped by Antoine's in hopes to sit at the Hermes Bar to finish some work and order some f","useful":0,"cool":0},"Z90NwuKVnMBgVTngCJg6hg":{"text":"Our wait staff (Ace and Roberto) were FANTASTIC. The service was flawless and professional","useful":0,"cool":0},"Q7-34V-lCELxmZ5O_NQlXQ":{"text":"i would have given it one star but for the sheer history and the fact that they manage to ","useful":3,"cool":1}}