{"ZwRKS1lihkvx4d9vpbAt3Q":{"text":"Crawfish mac n cheese = outstanding! Cornbread was awesome, too. Good strong drinks and gr","useful":0,"cool":0},"PyxTtF9CxMPRrSwwmpE2dw":{"text":"If you're a lover of good food and lots of choices, this restaurant is for you. Number 1 d","useful":0,"cool":0},"lazHwKUdCiNnV-2Iw3S2WA":{"text":"I stayed at Nopsi Hotel over the weekend and had dinner one night at Public Service. The r","useful":0,"cool":0},"vXb5qJTYaV8yf57ZlfixYQ":{"text":"I had two breakfasts here and my wife had dinner with the kids last night.  The first brea","useful":0,"cool":0},"F0fHcvIj8I0DDw7zBreAkA":{"text":"The restaurant is beautiful with an eclectic, seasonal menu filled with fresh local choice","useful":0,"cool":0},"mxycXcQ09vIAbHbfECB4oA":{"text":"Public Service is the restaurant located in the NOPSI.  The restaurant has some kinks to w","useful":3,"cool":0},"g6y9ZXMK_KiegUtuNvQTqA":{"text":"We stayed at the NOPSI Hotel for 5 days and 4 nights. This entry covers two reviews: one i","useful":1,"cool":0},"eYigZ2ChjrJvnC9lV8gWFw":{"text":"If you're looking for a simple breakfast in a very attractive spot, Public Service is a te","useful":0,"cool":0},"cCL9pkAjCdJyf6EJDohHbw":{"text":"A random search of a close restaurant nearby that I hadn't been to before showed up as Pub","useful":0,"cool":0},"ugmNUUU0fWUOUislrJ5w0g":{"text":"Order the Boudin Stone Grits with a side of poached eggs!! Also the Rotisserie Porchetta H","useful":1,"cool":1},"PgO-gwnxyt1D2cpoOV5Cng":{"text":"Everything I tried, the hush puppies, the poutine and the mushroom tagliatelle, was very t","useful":0,"cool":0},"5Or3dnFJNjcsaQX_NeRt5A":{"text":"YUMMMMM!!!Stayed here for Sugar bowl 2018, too cold to go outside. Thought we'd grab a bee","useful":0,"cool":0},"98fnmSSCQ9JPhO3KrUXPyg":{"text":"I'm usually unsure about restaurants in hotels, but this one is GREAT! Great food, great s","useful":0,"cool":0},"QWbi3TtoA_ceSkZKUwoTXg":{"text":"Stopped in for lunch last Saturday on our way to the French Quarter. Beautiful hotel and v","useful":0,"cool":0},"eoJ6lOPyvlV_J0Bs4q-GoQ":{"text":"Came here for dinner right when they opened and...\n\nPROS:\n- was promptly seated\n- restaura","useful":1,"cool":0},"Zlk24iThbuF8khmX9STCuA":{"text":"Should've read the writing on the wall when there were only 4 people eating dinner at prim","useful":2,"cool":0},"6hyIHrrFG9hfKnSILUFtow":{"text":"To be completely honest, I wish I could give this place negative stars. The service was at","useful":1,"cool":1},"CbdMioAr7BNaykXslY6J7Q":{"text":"This is my second time being here. First time was way better. The second time not so much.","useful":0,"cool":0},"o7oE8ebEICWRoBRKOTeiWw":{"text":"On our recent trip to NOLA we stayed at the NOPSI hotel, we dined at Public service for Sa","useful":1,"cool":0},"Xo2tETUWXeAyj8zkDg4Mvw":{"text":"Horrible service. Doesn't match the atmosphere or menu prices. Plus the food is okay and n","useful":1,"cool":1},"4r8JYZKB6t1sKJh3EYpfnA":{"text":"The service was good and our waiter was very nice, but the portions were embarrassingly sm","useful":2,"cool":0},"PSAjL81pdi3FOq0dgYCbBQ":{"text":"Came by for a late dinner and were promptly seated at a table because the 4 empty booths w","useful":0,"cool":0},"DpP_Cz-OezibZw41Oz_hQw":{"text":"Awesome bar and a convenient location for going out. Best Gumbo I have ever had as well. T","useful":0,"cool":0},"9mmrXBXtGNndJ8jEFLz0Sw":{"text":"The service was great but the food was ok . The steak was kinda chewy , the cookie brownie","useful":0,"cool":0},"T7qAVCCsnqW6B-9NtgA83A":{"text":"Incredible food and sweet service staff!! Went back two more times and it was still THAT g","useful":0,"cool":0},"iT5tFyTBpwe7Fb-uLlZyRg":{"text":"They need to address the issue of their consistent  slow service. The food is delicious.","useful":0,"cool":0},"Ev5yVt2VFK7Rb3fstUsqQg":{"text":"We love the NOPSI Hotel, where Public Service is located.  It is such a cool spot.  Can't ","useful":2,"cool":2},"kIfTStkJj5whO-xNuSlFWg":{"text":"Great new restaurant in NOLA . Let's get straight to the food. Warm yummy cornbread to sta","useful":0,"cool":0},"XnOH6jdTaZJIcy3HeBBzXw":{"text":"After being created with a smile by the bartender I saw my way to the hostess stand by the","useful":1,"cool":0},"U7N0Cm_5UMuEWAOHPQwvxQ":{"text":"Great food. Even better service. We are staying in the hotel and had concerns with getting","useful":1,"cool":1},"tfyLpo2-Sos3nWkdzT5WNg":{"text":"Terrible, waited 30 minutes for appetizers and there were literally 3 tables...  crap\n\nThe","useful":1,"cool":0},"bzXVOcvM4r_8O8UQSwop6g":{"text":"We are local and we know food. I don't know what the other reviews are about but this is o","useful":0,"cool":0},"eqkYXO7PE0f2Uk58DgV_fA":{"text":"Went for lunch today. They did a really nice job on the renovations in the hotel and resta","useful":0,"cool":0},"8FA8u0fml8we5SxnhSxt_Q":{"text":"I made a reservation for dinner on Thursday 5/31/18 for dinner on June 4. Got to the Restu","useful":0,"cool":0},"zSYTQIe4ACRDmjrDtRz3UA":{"text":"really pretty bar, we enjoyed a cocktail here on New Year's eve day. we saw people eating ","useful":0,"cool":0},"08u6pvPAqSK8HEETffDBKA":{"text":"Everything we ordered was cold and our waitress forgot from one minute to the next what we","useful":0,"cool":0},"mdPB3tutvIDhsByOUR2Z9A":{"text":"Delicious breakfast and loved the biscuits with the warm preserves. The pancakes came out ","useful":0,"cool":0},"fSXfKjSgcTEdSXjzvR5wzQ":{"text":"I had friends that were staying at the NOPSI hotel over the weekend.  We visited the attac","useful":0,"cool":0},"vj1kMyQngTvzvq6hG6TlBQ":{"text":"We went on Christmas Day which has a special a la carte menu and it was fantastic. Love th","useful":0,"cool":0},"aUsVHEq3buNL-1OHobbriQ":{"text":"I love the CBD and while walking I came across Public Service.  Nestled amid the apartment","useful":0,"cool":0},"4agU775m9Bk36oSmQrInAw":{"text":"Nice high end beautiful bar.., Terrible service.  If you want to catch/keep your good time","useful":0,"cool":0},"iB9L4y89mREcjevYmjLkYg":{"text":"Great food, great service, great drinks! Had drinks at the bar before dinner and they were","useful":0,"cool":0},"H9OcQkxTJGap_ykXawUMOQ":{"text":"The place is beautiful. They did an excellent job of renovating the building.  But just go","useful":0,"cool":0},"F7MWTmeoTOJJV4_N-Q0SXg":{"text":"First time visiting New Orleans and a family member suggested going to Public Service loca","useful":0,"cool":0},"AFAMMFucqg5M8SKKu2qnuQ":{"text":"Always great drinks on the menu and Adrianne is the best! Always so nice and personable.","useful":0,"cool":0},"krADdHPtB7lsHHkNJrXzBA":{"text":"Awesome menu and excellent service. Visiting from out-of-town and found it on OpenTable.\n\n","useful":0,"cool":0},"Phj1a7-h536I0MPz0kBnjg":{"text":"Tolles Ambiente. Nettes Personal. Die Drinks waren lecker. Waren zur Happy Hour hier. Die ","useful":0,"cool":0},"rqDhkkxf86jUlq6EeRtebA":{"text":"Decor was quite nice. Navigating three different menus was ridiculous. Gumbo was so spicy ","useful":0,"cool":0},"Wv_HWwjzgwmpBfl5-NPMtw":{"text":"This used to be a great spot for lunch but the service and overall management of the resta","useful":0,"cool":0},"8CJLtc0VBSCUiVcH9Tfj8w":{"text":"The food quality is great and tastes amazing. I had brunch with a group of friends. We wer","useful":0,"cool":0},"gCN3KrJp9chXWfiPFeVu1w":{"text":"It's a gin bar!\n\nThere's a great selection of different gins and tonics. You could do an a","useful":0,"cool":1},"Hg6DZQgThWUbPnzCy4plxg":{"text":"Some of the worst service I've ever experienced.  Bartenders are inattentive to say the le","useful":0,"cool":0},"XHleBNRNGWKeGlgdkxJ6GQ":{"text":"Attentive, friendly service from our sweet server Effie, and the food was fantastic. We at","useful":0,"cool":0},"Ax6SEFUBaBDv-5HdC3zhjA":{"text":"I went to Public Service the other afternoon with a couple of my girlfriends after work. T","useful":0,"cool":0},"L-Ho94CRg8YVkzLo9T5YQg":{"text":"Had breakfast here this morning and having dinner here now.  Food is amazing and the resta","useful":0,"cool":0},"5SXt0xqedeYmjCWYF_H3RA":{"text":"Adrianne stebbins is the best bar tender I've ever had! 10/10! The bar is so nice and the ","useful":0,"cool":0},"bn9nZZ_44iJLThlTr2JAJA":{"text":"The food here was amazing, definitely giving a high rate for the crab cakes and hush puppi","useful":0,"cool":0},"E1oxouam-Rd5df9onFbXTA":{"text":"Really had a great time. The staff and food went beyond my expectations and the manager Br","useful":0,"cool":0},"puFozWkzUYSXKBy3ctN_Kw":{"text":"I really like the food at Public Service.  My boyfriend and I have been here before about ","useful":0,"cool":0},"ydWd2g7oLazRiVh2E2UP2w":{"text":"Zac was amazing. Very helpful with suggestions of great local bars and history. He was qui","useful":0,"cool":0},"jeSjcn_h3HmRpxcbS9FAGw":{"text":"It's really a 3.5 review.\n\nWhat to get:\nTasso Hushpuppies (oh....my....goodness)\nBrussel s","useful":0,"cool":0},"bmOa-6ahO34wDPAv4UmSnQ":{"text":"It's really a shame that a beautiful Lee renovated nopsi hotel has such a horrible restaur","useful":1,"cool":0},"0mYIkXUP9BC9P9qaZhf6hQ":{"text":"We got to New Orleans pretty early, and we couldn't check in to our airbnb yet. Did a quic","useful":1,"cool":0},"mXf7ljqfY_Ihtv87XIYcNw":{"text":"I have visited this restaurant on several occasions and every time it is the same thing!! ","useful":0,"cool":0},"ybwIAeky0MFveJaULeLCIw":{"text":"This place served our best bites in New Orleans! We went during Mardi Gras, and service wa","useful":2,"cool":3},"qw-LXQabxDNqqtYqhgQudA":{"text":"Our server Anah was very attentive. She often checked on us and did well by ensuring our i","useful":0,"cool":0},"yPaZB8BK0jAGRVGexU7jlg":{"text":"Excellent service from Effie and very good food and drinks at this place!!! Loved the ambi","useful":0,"cool":0},"pf5sb-d40pL7q5Q7-93cgA":{"text":"Leonard made me the best drink, \"The Purple Rain\" at Public Service restaurant.  Not only ","useful":0,"cool":0},"A7XEIdtkbSI19H53jyAIeQ":{"text":"This place is a good hotel restaurant located in NOPSI hotel. I personally think this plac","useful":1,"cool":1},"7brh9A1ckG9tcPXKUzIRGg":{"text":"Tried out the Sunday jazz brunch, it was excellent!  Tried their perfectly cooked Creole O","useful":0,"cool":0},"vjXUFwo3v3iVFVj1XTxUOA":{"text":"Pretty good.  Mostly nice dishes. A few misses. Great staff! Really good atmosphere. The r","useful":0,"cool":0},"pmLL2XnAm7gfs5VV46xzOw":{"text":"I've had great service here, and I've had terrible service here. The brunch is pretty good","useful":1,"cool":1},"iX9K-37xf4ec6tw-kMjftQ":{"text":"I will start by saying this was not our first visit to the Nopsi. Previous visits have bee","useful":0,"cool":0},"343c7yP1gwX4FYuCObeBFw":{"text":"Walked in twice , left both times . As a locali  thought I would stop in for lunch . One t","useful":0,"cool":0},"l4H2mnzbWWnvwIs4xB_nIA":{"text":"Loved staying at the NOPSI!  Was in town for the Eagles Vs. Saints game. We decided to hav","useful":0,"cool":0},"1woHAt9rkx0Awm8-sYgbCA":{"text":"Reggie was awesome & friendly, served me a nice bubbly Rosè.  Two days ago, also had excel","useful":11,"cool":7},"uL71VuHFrsT1KbDRM59nfA":{"text":"Still haven't tasted my food because their silverware is entirely to hard to grip....","useful":0,"cool":0},"cph4hf2NBJ8gCf11HCa91w":{"text":"The waiter was really nice. He recommended a white wine to go with the fish that made it a","useful":0,"cool":0},"MAp3XWgmfu5eGb8QzafNIw":{"text":"I and some family members from out of town tried this restaurant tonight. Lawrence was our","useful":1,"cool":0},"ooDcAZBAgRk9nwuunhGuZA":{"text":"The atmosphere at Public Service is awesome- the ceilings are super high; the space is ver","useful":0,"cool":0},"96wJb22ej4DTJSYOkTr3tQ":{"text":"During our time in New Orleans, we stayed at the NOPSI Hotel and Public Service happens to","useful":0,"cool":0},"FAZOrOW6tMI7miWfLHQ02A":{"text":"This place had great food, the waitstaff was amazing after a game night on Halloween. We w","useful":0,"cool":0},"sr-86xVtp9LOKKqhvnZ8_A":{"text":"Came in and went to first bar on the lower level. Asked the bartender if bar bites were av","useful":0,"cool":0},"-dkS65THLPeMlTMrzkk2VQ":{"text":"DIM THE LIGHTS...\nWhat a horrible pun, but the sentiment is correct. I'd seen reviews from","useful":10,"cool":5},"tDmtG3g94mfJLr2ksU4HIQ":{"text":"Stayed at Nopsi so decided to grab an early dinner before going down to Bourbon Street. \n\n","useful":0,"cool":0},"GgLzFdC8uhdaWs_kqj_Qlw":{"text":"Okay, I was a bit nervous about eating here because it was EMPTY! People were at the bar b","useful":1,"cool":0},"YEzz7kM9gnFnX7uj8jW8ag":{"text":"Public DISSERVICE. Stood at the host stand for about five minutes until anyone came over. ","useful":0,"cool":0},"qFuifS-Iemw2TfcfhHi4bw":{"text":"Trust the chefs and have their \"Feed Me\" menu. Sunday night was slow so we were afforded l","useful":0,"cool":0},"UldAsJQPcXPYvv1QLD0RGA":{"text":"This whole experience from start to finish was atrocious!   I will never return!  We got t","useful":4,"cool":1},"V25dGI29Ega_O77wE5-9Iw":{"text":"Dear Public Service, I want you to be great, but you aren't. I've been there several times","useful":0,"cool":0},"fjZ1OPd6FLw0mfgOGXVYhw":{"text":"Sat quickly\nCoffee order taken quickly\nI ordered steel cut oatmeal and avocado toast $19 t","useful":3,"cool":1},"taY6S5SndE8PS3uaYMzSCA":{"text":"Had brunch here before the Saints/Panthers playoff game. They seemed a bit overwhelmed. It","useful":1,"cool":0},"iheoBwNnL5mnnaufaeTQhw":{"text":"Was here for a birthday celebration 5/5/18, staff was amazing,courteous, and attentive for","useful":0,"cool":0},"JnR-jNvWXzQGBxcLz4vqKg":{"text":"Leonard was awesome! The food was great as well!!! Very pleasant atmosphere. Quick service","useful":0,"cool":0},"j-3wh21f65vcFz35Vsj8xA":{"text":"Stopped here for drinks after a dinner with my parents. I wasn't drinking and was still a ","useful":0,"cool":0},"lfNy9x-e8OI1L1tt9vYlig":{"text":"This is hands down one of the best places to dine for breakfast in New Orleans. The grits ","useful":0,"cool":0},"1yHfuEUoi2_eL5p_yU9OAw":{"text":"Sooooo I've now visited twice and been underwhelmed twice. My first visit: great cocktails","useful":0,"cool":0},"LjFzEHFjlrxM1mqG7ZZUww":{"text":"Walked all day through New Orleans so we decided to eat at the hotel. We ordered the Boudi","useful":1,"cool":1},"jWx59sj8yb0bBsFiRWKXog":{"text":"Wow. Wow. Wow.\nWords truly cannot explain my experience here. If you want to be treated li","useful":0,"cool":0},"eQejpez0uCNFi9lV7bJqDg":{"text":"Coolinary Month!\n\nAh, the most wonderful time of the year--when the best restaurants in to","useful":2,"cool":1},"mhoOQHSnrLXRVzw_E1mt4A":{"text":"Initially I though this was going to be another breakfast place in a hotel. I was absolute","useful":0,"cool":0},"HuBZh6hJk2b2r2lZKSWtQg":{"text":"The food was phenomenal but the wait was not. Not really sure if it was due to the larger ","useful":2,"cool":1},"9X2Ff5RDTnzzz5tt0sy89w":{"text":"Decent brunch. Had the pork Benedict and weirdly the pork was sweet but still enjoyed afte","useful":1,"cool":1},"E-pnw8Ukcul_99y61utQiw":{"text":"Super disappointing. Was not greeted or attended to for like 15 minutes and they weren't b","useful":0,"cool":0},"8oSMm3sFW13IVLAaz7sf0Q":{"text":"It's ironic that a restaurant named Public Service would have such awful public service. Y","useful":3,"cool":2},"bS20bAnNSjcRB1EHjSydTA":{"text":"The staff was friendly and the restaurant had a good vibe, but the food was mediocre. I or","useful":0,"cool":0}}