{"IknVOwCaZ3G-oyRw6zK0NQ":{"text":"As it was raining during the time I visited in October when the Water Convention was in to","useful":3,"cool":3},"zuASJ1Vwvb-1_3MX2pVzLQ":{"text":"My friends and I visited this restaurant twice during our stay in New Orleans - once for d","useful":3,"cool":1},"27slqZGgwWTVZRKnQHDpmQ":{"text":"COMPLETELY surprised by how good it was. It was too hot to go outside so just ate here sin","useful":1,"cool":0},"AqRIJsAHkm8Z6aUu9Ttw3g":{"text":"I ordered room service and was not impressed. The gumbo was good but the next day I ate ca","useful":0,"cool":0},"baGbZiQzw6UxoAzgrXdjnQ":{"text":"Dined here while staying at the hotel for breakfasts and dinner. This restaurant is lovely","useful":0,"cool":0},"QScYGz1Yf8zYN-G-wb3rtw":{"text":"The service was very poor. The restaurant was supposed to open at 11 for lunch but instead","useful":0,"cool":0},"vBCjdhqxbyj2tnJjqJNvhA":{"text":"Our waiter Javier was awesome!! But the reason for the one star is the manager in the morn","useful":0,"cool":0},"TrLcxLQ8rbKq56UFIZQBfA":{"text":"The food was really delicious. I was able to experience it because I was attending a manag","useful":0,"cool":0},"SLLxClvf0vl3Hn-aeuXCRA":{"text":"I had the BBQ Bacon Cheeseburger with fries. It was THE BEST THING!!! I just recommend mor","useful":0,"cool":0},"yxxZeiznUIgtnKVMW5jZ3Q":{"text":"Dezerelle was our waitress and was super rude, didn't smile and  when we asked a question ","useful":0,"cool":0},"5az2g5HHjZamhxZ63pOnTQ":{"text":"Horrible breakfast buffet. We are staying in the hotel so we decided to try out the breakf","useful":1,"cool":0},"ntovBPhESqFyR4Wu8T8ppg":{"text":"Breakfast was mediocre, I loved the omelet that was personally made for me.  All the other","useful":0,"cool":0},"aASti-Mx8rhgM63ehkg1gg":{"text":"My vote is simply for the bartender, Max. His Banana Cream Pie cocktail was yummy! It's wh","useful":0,"cool":0},"qnDSq6lnYBhtzoUeXT94gw":{"text":"I truly underestimated how great the food was at the Holiday Inn Streetcar Restaurant. I f","useful":1,"cool":0}}