{"Y7MQsen3FqeBQg3PjTr1_Q":{"text":"The cauliflower hummus and pita bread were delicious! The cocktail was alright, nothing sp","useful":1,"cool":1},"fpdX6Y3_OKZmcR5Sp0QvLw":{"text":"From start to finish, our meal at Shaya was completely top-notch. We had a very friendly a","useful":1,"cool":0},"GmSLVvgCPlTX86AxIA_9OA":{"text":"It's been 2 days and I'm still full from the delicious lunch we had at Shaya. My party of ","useful":8,"cool":6},"HF3RRIRhC1WUhhSJg6Cabg":{"text":"So,  so good. My husband is Armenian,  so a lot of the food is familiar flavors he grew up","useful":0,"cool":0},"SaPeg68DNCx4ThT8K-Fsrw":{"text":"The wood-fired pita oven is beautiful, and the fresh hot pita is delicious.  We ordered se","useful":1,"cool":1},"Oyav7XpPlUQPZRNCyorjMw":{"text":"The food was pretty good. We had the tahini hummus, baba ganoush, Israeli salad and taboul","useful":0,"cool":0},"CcmSvg48H-qwt21SW3yPUA":{"text":"What can I say? YOU MUST EAT HERE!\n\nThis is one of my favourite restaurants in the world, ","useful":2,"cool":1},"3XeKzQTYrjWM9l8AuE9S3g":{"text":"It's a beautiful place, great atmosphere. I especially loved their courtyard. \nThe hummus ","useful":0,"cool":0},"FDqapoKT3A3KjPoCxxKtUw":{"text":"Just amazing. Accommodated our large party for lunch and everyone was super nice and very ","useful":0,"cool":0},"3AKS_i-_hFiLPmhqNjKbjw":{"text":"Hands down the best food we had in New Orleans!! Everything was super fresh, and so extrem","useful":0,"cool":0},"zPvXbKo3fqg7-qNZuBZI7Q":{"text":"-2nd time eating here\n-lunch on Monday with friends in town from DC.\n-falafal sandwich/cau","useful":0,"cool":0},"DiyftvYJDbxKyH4y5iiV1A":{"text":"Wanted to give more stars but not as good as earlier visits. Could be the change in manage","useful":0,"cool":0},"i5c-lfqkxjbRfKUNeC0QGg":{"text":"Food and service were good. I wouldn't say great or excellent, but I may have had unrealis","useful":0,"cool":0},"E-pXj5RDX-ME_KOUusb6Og":{"text":"It's like it's thanksgiving all over again. Ate so much delicious food I feel like I need ","useful":0,"cool":0},"zMV1rb9orZb_Dxhx8HbGeA":{"text":"Growing up in Detroit I have sampled some of the best middle eastern food available in the","useful":2,"cool":0},"KoRLHveZeBLYFKtwfIsDSw":{"text":"There is a lot of talk among the locals about Shaya being crowned the \"Best New Restaurant","useful":3,"cool":0},"dYXxNAtLnV15OhBjRjX3xw":{"text":"Very busy hip spot. Driving around waiting for hotel room and thought we'd try it. Walked ","useful":1,"cool":0},"XDO6NEGW8TUFsNX4aQHTBQ":{"text":"Finally tried this place last night with my Greek friend. It was delicious food and a huge","useful":1,"cool":1},"36osvGHChGOK6L3mZu9Icg":{"text":"What a pleasant surprise.  I went here with some ladies for a girls dinner and it was just","useful":2,"cool":1},"NUar6bbpM6RUn-nSnRoiHQ":{"text":"Best Mediterranean restaurant I've been to. Literally everything is fantastic! From the pi","useful":1,"cool":0},"koohK9FYLQezGWMMkVifug":{"text":"One of my new favorite restaurants in New Orleans. Alon Shaya knows what he's doing and is","useful":4,"cool":1},"0KYXiVGaMeaWxGJoaWo-kw":{"text":"Walked a mile through a parade to get there. Arrived at 4pm to a nearly empty restaurant. ","useful":0,"cool":0},"Niivd3gBhO6P1vFHWy5nxw":{"text":"We really loved the food and ambience. The people were very friendly. The food arrived on ","useful":0,"cool":0},"ajwE_6bdJXQ0md6vdTqcug":{"text":"Food receives 5 stars. It's wonderful and the chef deserves all his accolades. \n\nThe hoste","useful":1,"cool":0},"0ytpzC9VFsw_Bulpg8kQ0g":{"text":"Had a late lunch on the Sunday of Labor Day weekend, as no dinner reservations were availa","useful":0,"cool":0},"KPfbleASivK-Vn22f2_DXg":{"text":"This is one of my favorite meals in New Orleans!  The Pita was amazing, but everything was","useful":0,"cool":0},"eobpAb0kiQFyBpl7sNh_4Q":{"text":"I've been following them for awhile. My son brags on it all the time. Of course first plac","useful":0,"cool":0},"bmFfhvMNSF1AB5nOxrd5yA":{"text":"Excellent food and service once you get past the reception. The night we arrived there wer","useful":1,"cool":0},"W9EKAyRShcrvlwqc7RsY6Q":{"text":"We ordered so much food at Shaya. The waiter advised us to get like three more things so y","useful":0,"cool":0},"3XOW-7H0pBZFujKhrpf8bQ":{"text":"Best Middle Eastern Food I've had.   Just soooo tasty every bit.  The pita was amazing!\nFa","useful":1,"cool":1},"v0_W2xD1tMWdV9Sl7I-XEQ":{"text":"So incredibly glad we found this place! We are visiting from out of town and didn't make p","useful":1,"cool":1},"MREgG2IVnSc3OjnzI5iWMQ":{"text":"Oh, so delicious! I was not a big fan of the small plates concept, but this place definite","useful":1,"cool":1},"X4-cZhL0WNd6KWYHcUui5A":{"text":"Scroll Up + Click \"Get Directions\" + Wait + Eat Food + Leave Happy + Do it Again tomorrow.","useful":2,"cool":2},"TZ3dwbEKWwh5Qxi41yfmDg":{"text":"Shaya is one of the most famous restaurants in New Orleans having received more than one J","useful":0,"cool":0},"OlMGbqRVjlNjq5ODvxXrFw":{"text":"Unbelievable lunch. Lamb ragu was amazing. The bread was fresh and delicious. Tough to go ","useful":1,"cool":1},"mU2zkUNtkzx0ovWs-Pj42Q":{"text":"Shaya has awesome food and the service is great when you're in the restaurant area. The se","useful":0,"cool":0},"p1eh0l4b_kVxxUK-4LQSxw":{"text":"We ate at several really good restaurants in New Orleans, but Shaya was the best. From sta","useful":2,"cool":1},"RXSxM1cvHHZAD7NmcT0h7Q":{"text":"With all the 5 star reviews expectations were certainly high as lunch reservations were ma","useful":2,"cool":1},"0P9vqfeO1IYUxhkXv8c7MA":{"text":"Have now gone to Jazzfest on NOLA 2years and eaten here twice. Both times I had a fantasti","useful":2,"cool":0},"W5GA7Ywc4ILxZfpo-6Ez-Q":{"text":"Tiny plates, over priced, middle eastern food. Save your money and go to Mona's or Lebanon","useful":1,"cool":0},"Ng8IVb9td4AEtW8UQWertA":{"text":"Go shank or go home. The lamb shank was so tasty, the meat was so moist and just fell off ","useful":0,"cool":0},"5fKsee8vCta8At9VS5p-sA":{"text":"The food is outstanding, the service is great. Don't miss out on the cauliflower hummus, t","useful":1,"cool":0},"99sakU-tHJ1BkbiAT-sZBg":{"text":"Visited New Orleans for a few days for a convention and I was told I had to go to Shaya by","useful":1,"cool":1},"4bcRgBWE05eugErNov_uTw":{"text":"I've been to Shaya twice since it opened, and it's absolutely incredible.  You must find t","useful":2,"cool":1},"neQnYfEr7zs2ZuPV3fpG4Q":{"text":"All the reviews are correct, this place is delicious. I was somewhat hesitant because I am","useful":0,"cool":0},"8J1gP8tXXrixDI4m1pSxxg":{"text":"Oh my goodness how splendid.  This restaurant was so rarely wonderful and delicious.  It h","useful":1,"cool":1},"cQtMluE7qGkpXYnpx-JN4A":{"text":"Best Mediterranean food I've had- the cauliflower hummus is a must try. Everything is deli","useful":1,"cool":1},"TLZFwtZWncw1XEXx6Cy-HQ":{"text":"Everything we ordered, including the cocktails, was great! Especially loved the pita bread","useful":0,"cool":0},"hOifkWXd4bVnKrElsgdVUA":{"text":"We drove 4 hours to New Orleans, just so we could have lunch at Shaya. They welcomed us ri","useful":0,"cool":0},"Q9oXfrlPQ83O-TOgp4xrtQ":{"text":"When you can only get a reservation for a Monday night & the place is packed, you get the ","useful":1,"cool":0},"OG5hxRWnMbLu-Eliyfqk9A":{"text":"Its a beautiful restaurant with an amazing ambience and great service. The problem was the","useful":1,"cool":1},"5RkjqSqiTch2qhCjU8gubA":{"text":"It lives up to expectations! We had small plates and lots of hot pita bread. Truly great f","useful":0,"cool":0},"3u1ePnkeubzD31PcQtwLzQ":{"text":"Everything about this place was outstanding. The decor is very modern; restaurant very cle","useful":1,"cool":1},"nAO3uKJIR1PKIvjL8kHF3A":{"text":"First, make reservations. We called 45 minutes ahead. Told them we would be there in 35-45","useful":0,"cool":0},"W8YsIi7K8wQT01jA-dWBJA":{"text":"Amazing!  The best pita bread I've ever eaten.  Nothing else even comes close.  Best bread","useful":0,"cool":0},"Ts-4pYcU2Eqg4XdF3f2_yg":{"text":"I've tried to make a reservation for Shaya the second we booked our trip to NOLA, approxim","useful":4,"cool":3},"7Q3VaLvtNxC3FwKxQadQ-A":{"text":"I did not find this restaurant to be very authentic. Perhaps it's not meant to be?  Nothin","useful":0,"cool":0},"zzmDqNq9XRotAzMkPO4_9Q":{"text":"Excellent food, especially the fresh baked pita bread, hummus and lamb kebabs. Cocktails a","useful":1,"cool":1},"8K9j341dD67VEaCjqtrJ9Q":{"text":"Such a wonderful experience! Desmond was our very friendly, helpful waiter. He was knowled","useful":0,"cool":0},"0GGCuFlqY2cJzVMG2lLyew":{"text":"Thank goodness for restaurants like Shaya so I don't have to eat fried food on vacation. \n","useful":2,"cool":2},"PBjGz490C-xDkJVJuT9XAQ":{"text":"The food is good. The bread is fresh baked and outstanding.  I am greek and middle eastern","useful":0,"cool":0},"qB5FQAxVkQ3hFqygDP3CYQ":{"text":"A must visit!!! Get reservations to make sure you can get in! The best service and the bes","useful":0,"cool":0},"oeIlQyMBz5gboysm9Cu8vw":{"text":"Really beautiful interpretation of Mediterranean flavors. The watermelon, soup, breads - a","useful":0,"cool":0},"lxTE8nQuT3rYo4esf0IKHQ":{"text":"Quite simply, fantastic. My girlfriend actually told me the braised lamb shank was some of","useful":2,"cool":2},"lTf9ZqMxyBHd6JsMNeDqUw":{"text":"Most definitely one of the best mediterranean food I ever had in my life. I had some good ","useful":1,"cool":1},"CZzanAxTsTMqEdYyvGofLA":{"text":"Everything was amazing! I definitely recommend this place to the T! From the atmosphere to","useful":0,"cool":0},"a8aoz-jZZwqXcwzyVJ7XBA":{"text":"Fantastic food.. just takes a few visits to get your order right.. The sizes of the plates","useful":1,"cool":1},"Tm8y3z-nSKXiRGJ5nvlMHw":{"text":"I LOVE THIS PLACE!  Easily my favorite restaurant in New Orleans and my top 10 anywhere.  ","useful":1,"cool":1},"VGBCPRrcuaIBCMqVk4Bkqw":{"text":"What can I say? This place is a James Beard award winning restaurant for a reason! That re","useful":3,"cool":2},"T2qzkvyqkha0Q6i3-rWeXg":{"text":"I'm a big fan of hummus and I'll have to say that Shaya's cauliflower hummus is my all tim","useful":1,"cool":0},"9zdLkkou4kRHuVGiz1RzZw":{"text":"Holy Cow! This place was delicious!!! The hummus is a MUST. I had the curry fired cauliflo","useful":3,"cool":1},"gzYwWgvp4574jtY2bPouWw":{"text":"Definitely my favorite place in New Orleans!!! The chicken is the best I've ever had. That","useful":1,"cool":0},"TtyHniayjHmC8Ntmm3I4yA":{"text":"Went 2 years prior when it just opened and had a mind-blowingly excellent meal.  Went last","useful":0,"cool":0},"ZSLEL241t6f9B5PNCDyd3g":{"text":"Bad bad bad\nDon't spend your time\nEvery basic Israeli restaurant top this over rated resta","useful":0,"cool":0},"dkDGZVyXtkmh5dq8q3Og5Q":{"text":"Extremely delicious falafel, perfectly tasting humus and fluffy warm pita are the plates t","useful":1,"cool":1},"tfn-9JdJe2xA6nXx1wvONA":{"text":"Second visit visit for our party of three. The food was fabulous, the service not so much.","useful":0,"cool":0},"OAqiGVJ_P-6kTobhx9tJig":{"text":"New to New Orleans comes a truly gourmet and inspired take on dishes you are probably some","useful":3,"cool":1},"ulPHy-DufP3jfXbVVlOb_g":{"text":"Checked this place out while in NOLA. Glad we did. Place is very nice. The ambiance is awe","useful":2,"cool":1},"Oa8gpddt8jcsnkdONYuRvA":{"text":"I've eaten here 6 times. There are enough reviews so I just want to say a few things about","useful":2,"cool":1},"6dh4KtkAWQ2MLLbJqJsRqQ":{"text":"Their hummus is spectacular. Enjoyed the small portions appetizer to get to try several it","useful":0,"cool":0},"4469LAtHsOhyPu5YwRd1sw":{"text":"Lamb kabobs were awesome, great flavor and seasonings, chicken sandwich with house fries i","useful":0,"cool":0},"OTA9jorEcLQ93EcaILufGg":{"text":"This awesome, quaint little perfect spot in the Garden District for a date night does not ","useful":1,"cool":0},"f8WPDdt-HkneuUK9ICUIGA":{"text":"Omgggg...sorry, I haven't recovered my powers of speech yet.  This may be THE best restaur","useful":1,"cool":1},"FbM-v9yOFZaBuyaksakw7A":{"text":"Pita is a burning thing\nAnd it makes a bready ring.\nBound by wild desire\nI fell into a rin","useful":2,"cool":4},"CqozsjHLM_cJS8vuzfyF4A":{"text":"Pita bread and Curried cauliflower hummus were amazing. Best hummus we have ever had.  The","useful":0,"cool":0},"o7kV5biqC39SV1HgxNXeoA":{"text":"WOW!  This place is amazing.  Highly recommend, one of my new favorites!!!  The fresh cook","useful":0,"cool":0},"SzO9DuI-KU9RtmuS3a1jYA":{"text":"The food was good overall. Great taste and very authentic feel. The portions are served mi","useful":1,"cool":1},"pplYb02W6M_aBTV0Wgm3DQ":{"text":"So wow. Strolling on magazine, I stopped in for some chicken liver pate at pizza Domenica.","useful":3,"cool":1},"_PIjs3nuBOGTRy3dA60osA":{"text":"Service and the food were outstanding! I dream of eating here again and long for the Lamb ","useful":1,"cool":1},"-77WiG59FzgR9XXMjKFuOQ":{"text":"The shakshuka at Shaya is the best I've ever tried...eggs perfectly poached on a bed of sm","useful":0,"cool":0},"JVA8umtoIfMBxlivnwoAAA":{"text":"Where do I begin?\nHonestly one of the better meals I've ever eaten.\n\nCasual, warm, and rel","useful":2,"cool":1},"7j07fqBsR6dQUmwkbnrQKA":{"text":"There's reason they got a James Beard, y'all. I'm of the personal opinion that Alon Shaya ","useful":3,"cool":1},"bDyBQurx9IMF5RIlHDJQAw":{"text":"This was our first time in New Orleans and we had been told that, \"Shaya's is a must...you","useful":1,"cool":1},"noDYvpJuPMGq3bfcTkcHQw":{"text":"Wonderful! I want to pack it up and bring it home. We enjoyed the meal, service and locati","useful":1,"cool":0},"1cm9VVEZrbo6QcKPYRIo7w":{"text":"It's losing a star because of the server with the German tattoos. I lived in Germany and n","useful":2,"cool":0},"Ij8veOL3OEnsPtxxYU2v9g":{"text":"This Israeli cuisine restaurant is a lovely little gem in the city. When I arrived, I was ","useful":2,"cool":2},"pFNJdQGSBqvTzfsTHTr9gg":{"text":"Don't know how this won a James Bears award. It is fine Mediterranean food. Pretty limited","useful":0,"cool":0},"lJP3O6LSXdJ6_gbl6wptFA":{"text":"my daughter made an online reservation for two recently. It was confirmed. Then she was em","useful":0,"cool":0},"jf6rTI823DKzIBqKHmKH7Q":{"text":"I couldn't wait to eat at Shaya after all the hype.  I thought it was good, but not great.","useful":1,"cool":0},"S-F5SjkhmQlAmGRpvxQysg":{"text":"Had heard about this on Eva Chen's Instagram story a few months ago and instantly got hook","useful":0,"cool":0},"zSCdp56vC3aU6yZt6-fcwg":{"text":"Ok, if you are going to brunch in New Orleans, go to Shaya. I lived in Israel for five yea","useful":0,"cool":0},"mMl0xfTnyN1OSR70fxAUPQ":{"text":"I was recently lucky enough to get into Shaya without a reservation. I found the food to b","useful":1,"cool":0},"T98BxD58g0mXOJeIYjEG1A":{"text":"Love everytime I can dine here. Ask for the off menu \"All of our troubles\" cocktail. Jessi","useful":0,"cool":0},"Dqj4FaI-pM22v59ezOGIOQ":{"text":"I really hope this place stays open for a really long time! The bread is to die for. We tr","useful":0,"cool":0},"1NpVIviUHTuYPwVeZkTalQ":{"text":"Literally one of the best meals we've had in NOLA! We ordered the lamb kebabs and the curr","useful":1,"cool":1},"jxaf8cNZimNnnF-U7WfUWA":{"text":"The wife and I went to dinner on a Friday night at Shaya.  We arrived a few minutes early ","useful":11,"cool":8},"o2pmvgjRjXVxlKclxA0aLg":{"text":"This was a lunch dining experience that me and my sister and her husband are still talking","useful":1,"cool":1},"DTfw5iNs3gM2Q3yVVIEaSA":{"text":"The food is amazing as is the service. However the hostess is off-puttingly terse. Which i","useful":2,"cool":1},"TfKOgSjIMgfQwj5UmDfJQw":{"text":"Such an original, new restaurant in New Orleans. \nWe went on a Monday night with a group o","useful":2,"cool":1},"4nABSZO036Xqkf3Ge5qVLA":{"text":"Delicious Mediterranean food. Must try the baba ganoush and ikra (yogurt with caviar). Atm","useful":0,"cool":0},"JZ8wGuGOoILM6rd9yLZSSw":{"text":"This was fantastic. The service was perfect and the warm pitas, cauliflower hummus and lam","useful":0,"cool":0},"Ncq_r4OU_wJh2sJLntOKcg":{"text":"The food was absolutely incredible. Service was great! The server was knowledgeable and ki","useful":0,"cool":0},"n9maMCkk5TQccvNQxsTxyQ":{"text":"Literally some of the best food I've ever had, it was a very very thought out approach to ","useful":0,"cool":0},"Cp7nOJkYT5eRlkyZ-ZH2Ug":{"text":"My sister and I went to Shaya for dinner on a Friday night upon recommendation from severa","useful":1,"cool":1},"Qie2sW4choTwsjmX4ltsdQ":{"text":"What a Treat! The experience and food even better than the hype we had heard! The service ","useful":0,"cool":0},"aQ9KC1jhY5wUXLswBzs_tg":{"text":"Okay, I KNOW it takes over a month to get a reservation at Shaya, but it is SO WORTH IT. I","useful":1,"cool":1},"eCWTL9lFhcb9zCgDMk9Z6A":{"text":"The slow cooked egg hummus, with cornichons, harissa, and red onions, is one of the best d","useful":0,"cool":0},"sxw6j1G3ctkfXD8OZbuyRQ":{"text":"I've been wanting to try shaya for a few years but you always need a reservation. I drove ","useful":0,"cool":0},"CvxWyOnfnQ4DlpwSOYOgtw":{"text":"Wonderful part of town to walk around before or after. Quaint front entrance, beautiful la","useful":0,"cool":0},"4PkAIsv3jL1RNhxZlMTQWA":{"text":"First better take a cab or Uber because parking is horrible. The drinks were not made well","useful":0,"cool":0},"_m3zFw8CNxFPlBK5WHQGiQ":{"text":"Super interesting take on Israeli food-- definitely deserving of its James Beard award. \n\n","useful":0,"cool":0},"OBTs5YNqwD8Dq6IH7qZOfA":{"text":"Hype: There is a lot of hype about this place, some true, some not so true. Initially a tr","useful":0,"cool":0},"n-JpvuMsupMUXmfFxCwYmQ":{"text":"My son has become a foodie.  He and his wife live in New Orleans and always seem to find t","useful":2,"cool":1},"q4xPYyYLm3y3Qvcpgej86w":{"text":"Food is spectacular!!! All my favorite restaurants tend to be Italian places, so the fact ","useful":0,"cool":1},"c5lXkJizlh-L_wuN978HBw":{"text":"One of the best and most memorable meals I've had. Phenomenal food, great cocktails and fa","useful":0,"cool":0},"L5re6XuVWVXPwRpvZX01pA":{"text":"I cannot say enough amazing things. Today was our first visit and boy were we excited to t","useful":1,"cool":0},"EM_3xN1QVpYBSIDNGgL44A":{"text":"I got engaged here after a wonderful meal. It was heaven for a pescetarian, mostly vegetar","useful":0,"cool":0},"LlX_bNMK2vkqnAwTrQMOng":{"text":"The food and service is great . The lamb and cauliflower hummus is great also lamb shank i","useful":1,"cool":0},"nIABZJDPHJ34Tl1DDt77TA":{"text":"I've had an amazing amount of Middle Eastern food, both home made and restaurant.\nI have n","useful":1,"cool":1},"tK5gLV8l2CBPWC9Tbn8i-A":{"text":"With all the great reviews and accolades Shaya has received, it almost feels blasphemous t","useful":1,"cool":1},"f0ji1FbEoanSGwe4BUHwCA":{"text":"It is just sooo good! We booked a dinner reservation well in advance for 6 people, though ","useful":2,"cool":2},"GPxND3OfFe2EfAaCSHOGUg":{"text":"Shaya was over rated in my opinion.  Excellent pita bread and excellent cocktail.  Everyth","useful":0,"cool":0},"dkMuoqZq26PnMMjJUnpTPA":{"text":"Still thinking about the carrots of all things. THE CARROTS! Our group ordered a bunch of ","useful":2,"cool":2},"__BTAlyfo1aNmKZ3VEZfrQ":{"text":"Get the hummus! It was truly unique and masterfully crafted. Further, our service was deli","useful":1,"cool":1},"YQ5GXNMX9mXkoOOErRe-QA":{"text":"My daughter put it perfectly... she said I feel like we went a food spa mom, I am so relax","useful":1,"cool":1},"zoTQ6tBJGTYVjNqzcnxwgQ":{"text":"Authentic as authentic gets as far as Middle-eastern food. This place got all the details ","useful":4,"cool":2},"Xkki12owTk3xkAYxcLbGbA":{"text":"I was told this was the place to check out during my visit by many friends. Even the Uber ","useful":2,"cool":1},"roRdFwLYgTYq-U7TZZTNZA":{"text":"This is quite a departure for New Orleans!  The food, overall, was creative and excellent.","useful":1,"cool":1},"w_sVYuFYSfaMuLH7_HstyQ":{"text":"Delicious and I can't wait to go back. I went with a large group, which was great because ","useful":0,"cool":1},"2YZ6BIt0ITOJW0Da7UnutQ":{"text":"There is a reason Shaya was awarded best new restaurant in America--their food, ambiance, ","useful":2,"cool":2},"bWm_L95iroW_4zQf_z2jEA":{"text":"Dear God, this place is good! Despite the departure of Alon Shaya, the food was some of th","useful":0,"cool":0},"59AOpKhHyC7hQkFipqHIzg":{"text":"I went last weekend and it was so good I want to go back this weekend to try all the other","useful":1,"cool":0},"-95c5CiZlg84bQkUR-KA3A":{"text":"No wonder this place was a James Beard Award winner! Had this on my list when I visited th","useful":1,"cool":1},"v2pXY_4tyWC39Uz65bhhZw":{"text":"Everything on the menu seems great, but be sure to order the Kibbeh Nayah and the Short Ri","useful":0,"cool":0},"P_8BhGukVGiKXL6JGM_sQQ":{"text":"Oh wow! I don't even know how to compare this place to anything! It's so different from yo","useful":2,"cool":1},"A5xWzbPHvRKzRaU4mqVMHQ":{"text":"We had eaten dinner at la petite grocery the night before and wandered across the street t","useful":1,"cool":1},"XcStmGFOvOHoosIQwFC62w":{"text":"Shaya is a fantastic restaurant. Everything is excellent. The tahini hummus is some of the","useful":1,"cool":0},"SG13BPj9Bu4r4VIGbUxsaw":{"text":"Bold flavors!  No dish was a miss. Get the hummus with cauliflower, the Brussel sprouts, t","useful":1,"cool":1},"9CTup2pIyrNDeG2A1eSGAg":{"text":"Wow I've never had such an insulting experience at a restaurant.  Started with the hostess","useful":2,"cool":0},"DlOdqDIhbVIN6bXz5VVVTA":{"text":"Everything, and I do mean everything, was amazing.  The service was exceptional. Every sin","useful":1,"cool":0},"i_Y85YekMNaAfasdHzZXFA":{"text":"Best meal on my recent trip to New Orleans, you may not necessarily think Mediterranean wh","useful":1,"cool":0},"NimSh1ynXVon67lQhkzXEA":{"text":"The watermelon mint drink was much needed for this hot NOLA afternoon. They have their own","useful":0,"cool":0},"DES91s1aRVgQtuaQxlrYZw":{"text":"We were in New Orleans in April 2017 for our 20th anniversary. We are vegetarians and Shay","useful":1,"cool":0},"Z8CgJn-e-lzQiqnt-v7XHg":{"text":"I loved this restuarant.  We got an assortment of dishes and shared them with the whole ta","useful":1,"cool":0},"ztU14vxF_0fNdqb7310KjA":{"text":"Father's Day dinner at 2:30.  Party of 7.25 (the baby is small).  So delicious and refresh","useful":1,"cool":1},"ChZSEpjSB0mE5laV23erqQ":{"text":"this has been my favorite meal so far for 2016. the perfect pita puffs the you see workers","useful":0,"cool":0},"DvH18XSqzZUADmpufUM0PQ":{"text":"I stopped in while on a recent trip to New Orleans.  This was easily the best Israeli food","useful":1,"cool":1},"fQkgU5MgNZFQ8OUi4U6tlg":{"text":"Beautiful food - managed to get a same day reservation for two one day when the back patio","useful":0,"cool":0},"0348ufm2iWJlUAyWxLp56w":{"text":"The best Matzo ball soup in my life. I have never tasted a richer, better stock in maybe a","useful":0,"cool":0},"SLo91BRVCm-5f9ZiBv6o2w":{"text":"Come for the pita, and stay for all the amazing spreads to dip it into.  This was one of o","useful":5,"cool":6},"0r_-vWS2hWdEN_AZhrKPmA":{"text":"Beautiful assortment of fresh food. This place will not disappoint! Happy with everything ","useful":0,"cool":1},"8cUZapDa0dIi1fN0KrvWuw":{"text":"Go for the bread. Stay for the rest of the food. Budget some time though, this is a place ","useful":1,"cool":1},"WR_C1Eh9sGlSK62KWKPVXg":{"text":"Amazing dinner. Worthy of all the accolades. Cuisine was middle eastern fusion, with a bit","useful":2,"cool":1},"VeXuEoIfTy7GbQ3uUdcofw":{"text":"AMAZING! A must visit while in Nola. We had some cocktails, hummus w tahini, cabbage dish,","useful":0,"cool":0},"4E8Zepgbijjc3d86S0mXLQ":{"text":"A friend who visits New Orleans regularly to see her daughter at Tulane told me that Shaya","useful":0,"cool":0},"EGrxKFobgIWC6vy4-2Geyg":{"text":"THE FIRST THING WE NOTICED WAS THE PLACE WAS EXTREMELY LOUD.  WE COULD BARELY HEAR EACH OT","useful":1,"cool":1},"i6ttRKOPz2n9glwl1nWL9g":{"text":"Well for such great reviews I was a bit miffed.   The various hummus spreads were a joke a","useful":0,"cool":0},"ilRdM5txHAye58sFLTzFFQ":{"text":"This is a great restaurant.  Excellent food - excellent service - great atmosphere  and gr","useful":1,"cool":1},"BNYS95sB-YqbitB9UGvceA":{"text":"Sunday at 6pm, no reservation.  Had the option to sit at the bar or sit outside. Sat at th","useful":2,"cool":1},"Cwe8ALqU8KcgfvUBWy0sog":{"text":"Four of us were seated for dinner, we went the small-plate route and ordered nearly everyt","useful":1,"cool":1},"45P6qGHouYzovYd0nysG1w":{"text":"Second visit to Shaya; everything about this place is authentic. Service is great. Food is","useful":2,"cool":2},"fZFmLCI0nEZt3yLWTy_2xw":{"text":"I was prepared not to care for Shaya -- the hype, the reservation, John Besh and Alon Shay","useful":3,"cool":2},"eiOk8czhuu5_kgTICQ6M2A":{"text":"Let me start off by saying the curried cauliflower hummus and fresh baked pita were phenom","useful":0,"cool":0},"GSwI74Y58XHJsNdgQVK29w":{"text":"If I get the chance - and unless I have an unambiguously terrible experience - I try to vi","useful":1,"cool":0},"8GazirGEnh6TVqRd7KbWLw":{"text":"I last visited this restaurant when I was in town in March (almost 7 months ago) and I'm S","useful":1,"cool":1},"etY2O_EGpNTgHILjwtunqw":{"text":"This restaurant was amazing. I read about it and there were great reviews. It did more tha","useful":2,"cool":1},"sTJK72U9kbktnT_dq6UPSA":{"text":"The two women at the front desk were more interested in adjusting the length of their hems","useful":1,"cool":0},"6t6t0FNwUWuaZtmTITH9Lw":{"text":"Every time I visit Shaya I feel as though it is better than the last visit. When my partne","useful":2,"cool":0},"cIW5ZS_acYZwrbj-BqMjWg":{"text":"Not much can be said regarding how fantastic this Israeli/Mediterranean restaurant is that","useful":3,"cool":2},"7F-yVabuCH6MJzn5AkIwsQ":{"text":"We had a fabulous lunch here today. Everything was amazing! Delaney our server was very ni","useful":0,"cool":0},"mUq5b3W-8k7o4OF_k01u4Q":{"text":"No words! Great ambiance, nice servers, unreal food! The hummus is the best I've ever had,","useful":2,"cool":2},"hSPBg_2r5ZTGGAa3mREUYQ":{"text":"Superb food. I visited here several times, the chef never disappointed me. I like the ambi","useful":0,"cool":0},"MUCENppkBNfD9mME73JvOA":{"text":"Shaya definitely lived up to our expectations. Always impressed with what Alon did at Dome","useful":0,"cool":0},"BCC-OyYgNXnRfNGbYyoLlA":{"text":"Amazing salatim and hummus--the watermelon feta salad, ikra and babaganoush were standouts","useful":0,"cool":0},"2shVDJk7gJxths6lcN1JNQ":{"text":"THE softest pita bread I've had in my life! In fact, I think Shaya ruined me for all other","useful":5,"cool":4},"F8W2Tf8PP-Jn7PCx7z52Tg":{"text":"Omg so amazing and delicious. I am vegetarian and I ordered bunch of small dishes and humm","useful":1,"cool":1},"Cpa2jqlVIISiJ1npgFy7rQ":{"text":"Fancy, friendly, and fresh! After a long day touring New Orleans, a short stroll down Maga","useful":1,"cool":0},"NKZ0F5KuNKKC5w0XmYXtcw":{"text":"My wife and I LOVED our meal and experience at Shaya the menu allows you to taste and expe","useful":1,"cool":1},"C8_RxdOErW0OgNazD3QwxA":{"text":"Excellent food and prices. Delicious baba ganoush. Pitas are hard and fresh out of oven. S","useful":1,"cool":1},"VpkTkX-jzRdtdgNiiBaFOg":{"text":"Wow! So great to have a meal that meets all of the hype. Took my Tulane U student and a fr","useful":0,"cool":0},"fAx5z1vUx420FX9NoAt-vA":{"text":"Easy to see why Shaya is a James Beard award winning restaurant. Service was top notch and","useful":1,"cool":1},"81i_53YauBZlaalgUneumA":{"text":"A 4.5...zahav is better but this place is great...and a grest lunch value\n\nPita? 5\nHummus?","useful":1,"cool":0},"qYv1x6n6brNPPAdf5kqiEw":{"text":"Well hot damn. It's hard to find food in NOLA for a visiting vegetarian friend, but this i","useful":2,"cool":1},"koBIPmgu3ZkeGuE6V3x6iA":{"text":"Greatest food u can get in NOLA. Totally beyond expectation. Will come back and try everyt","useful":1,"cool":1},"2LATO3kLj7iFEEWMn3sdkw":{"text":"I visited New Orleans from San Francisco where we eat really, really well. I was excited t","useful":1,"cool":1},"RI68Kb1ed31aqo2HVQYcSg":{"text":"I feel lucky that I had a chance to eat this wonderful food while visiting New Orleans. We","useful":1,"cool":1},"7RLm1ZeOVSP21r34F9yQew":{"text":"Blows me away every time. Everything is just so darn fantastic from the drinks to the mezz","useful":0,"cool":1},"tco7vlVZ-FXX6BePUHTmbQ":{"text":"Who knew that after decades of eating Levantine food all over the world (although, admitte","useful":7,"cool":5},"xMgyQP6ottxS9nDh4OHRfg":{"text":"The best Mediterranean food I've ever had. Went here for lunch and got a seat on the beaut","useful":0,"cool":0},"_z54R6eVLU8vP-jN7Q99YQ":{"text":"4.5 stars. John Besh killing it again with another amazing restaurant. We had the baba gha","useful":0,"cool":0},"Y-54YCWMVcei31FCqtvokQ":{"text":"We may be visiting Creole country, but I have some very specific culinary priorities and t","useful":1,"cool":0},"AJcJxl_xFPoHIHQlyCv-eQ":{"text":"Best meal we had in New Orleans. Ambiance is fair. Service was pretty good. But the food? ","useful":0,"cool":0},"d-ZqnwuPR9C0VcOyFRiSLA":{"text":"Where are the ten stars? How about four thumbs up? Heaven. Absolute heaven in every way. W","useful":3,"cool":1},"_2BTFCyIGzgJrzboEz72nA":{"text":"I had a wonderful anniversary dinner here with my wife. The ambiance was bougie and modern","useful":0,"cool":0},"Zw5MGpButQMtGwQAQRVHcA":{"text":"With all the different cuisines available in New Orleans, excellent food is the norm on ev","useful":1,"cool":1},"7_3xPGgGBYepzaaMwTgBgA":{"text":"We'd waited a long 4 months for our reservation! We were especially excited since the rest","useful":0,"cool":0},"KqThAfYnCmwSeFkpfgba0Q":{"text":"I had high expectations and they delivered. Hummus and pita is addictive plus that avocado","useful":3,"cool":3},"iCCXvit7abM_Dk3x63OjSA":{"text":"This is a great hidden gem!  Happen to walk by and decided to pop in for a quick lunch.  I","useful":0,"cool":0},"GcRnvWzUvJJYCYdF-0u3mg":{"text":"Wow. Chef Alon Shaya and partner John Besh have a solid winner in the new Shaya on Magazin","useful":0,"cool":0},"aRFrWEwVfcBwy2ULlwXAXA":{"text":"I've been waiting to try this restaurant for awhile now and had the chance today with a fr","useful":3,"cool":0},"LkWdY8viU3RAiTUpers9JA":{"text":"Simple food.  Amazing experience.  One of the best meals i have ever eaten.  We asked out ","useful":2,"cool":1},"nfFfoVrttWEIc8Ho9DTqvQ":{"text":"Shaya lives up to the hype. The smoothest hummus and the most exciting, wonderful flavors ","useful":1,"cool":1},"_4TQMdU7v0Wu9LVXOoAc3Q":{"text":"One of my favorite places\nvery contemporary, the food is from my culture, so I wanted to s","useful":0,"cool":0},"2q4cYJXk0C_8gWjrlPvstQ":{"text":"For all of the hype, I can't say that I was overly impressed with this place.  It is defin","useful":3,"cool":0},"mcKIqzzjz86nyLHmMucybQ":{"text":"I am sorry but it is too hyped. I probably would have given it 3 stars had I not been expe","useful":0,"cool":0},"TzN3WW0XVmUfBOD2stz6LA":{"text":"How in the hell does this place only have 4.5 stars!?!?\nWho's ass do I need to kick to rec","useful":0,"cool":0},"82EbOqSi0frfFfzuO78gfg":{"text":"Medium sized fish in a large pond.  We had a 1030 reservation and were rushed by the waits","useful":0,"cool":0},"eM9Hpv1D2KqY5pJO6K8xbg":{"text":"Shaya was everything we expected and more!! Special trip to wildly exceptional Magazine St","useful":1,"cool":0},"KObs-DDfxprHIEn4oz8ySA":{"text":"We were recommended this spot by a pedi-cab driver (rider?) on our last night in town, and","useful":0,"cool":0},"HM5kyhIYGx0blI7iORaXRQ":{"text":"A fabulous evening endulging in Mediterranean flavors and washing it down with red wine! O","useful":0,"cool":0},"9vJyZZTxLJwetAz5pwTnvQ":{"text":"Great food, i'm Israeli and it felt just like home.","useful":0,"cool":0},"f9v2RI72RZ5l7sZ4nbR8RA":{"text":"My dinner here was one of the best I've had in my life. This restaurant really deserves al","useful":4,"cool":1},"VhVsH4IlDDaew-zvWfMJgA":{"text":"Loved this restaurant! Went on a busy Friday night. Greeter was very professional and frie","useful":2,"cool":2},"tdjGaJ5MHjN5EYZDFMb2ag":{"text":"Hummus was great, grapes leaves good but 3 for $8.00 is a bit expensive. Not very much to ","useful":1,"cool":0},"6zYEExFksUlss06mK2Zk6Q":{"text":"Our party of 8 secured a dinner reservation through Open Table well in advance of Tulane m","useful":2,"cool":0},"bz4eO_fNMkx9jkGpV5YH4w":{"text":"Since dining at Shaya, each mention of it to friends has elicited an audible gasp, widenin","useful":5,"cool":3},"UHJnhzUVH7jHCDcuR0bzCg":{"text":"Amazing food! We live in NYC and this restaurant is delicious. The shashouka and pita is t","useful":0,"cool":0},"T_x94dIUIAGsd8cGx1KbzA":{"text":"\"They've done it. They have figured out food.\"\n\nI was left so speechless at how good Shaya","useful":7,"cool":8},"UPkyLVYB7CwQ6a9OflyW1g":{"text":"Amazing food!!! Been coming to NOLA for work and not been able to get in. Finally able to ","useful":0,"cool":0},"QVwCgH0eoI2LRMCtHsHLng":{"text":"Okay...........there are over 500 reviews and you can't read them all.\nBIG NOTE________ MA","useful":1,"cool":0},"_Q3AQJWHHAXS7gGaBMzPAA":{"text":"Came here for dinner and it was DELICIOUS. My friend could only get a 10pm reservation for","useful":2,"cool":1},"N8I7Q8e6NayG-24NxDSQ2g":{"text":"When it comes to Hummus, you can take my word. Years of cooking, tasting, blogging, review","useful":3,"cool":1},"QXiyVK3Fd4_Z5tfdEhBZoQ":{"text":"This place is perfect. From start to finish, we enjoyed our experience here. We dined at S","useful":1,"cool":0},"VjJ5e95hu18lGdxb483uDA":{"text":"What a refreshing alternative to Mediterranean food. The 3 for $15 or 5 for $25 small plat","useful":1,"cool":1},"S486SqDrLapl0-3NddoI_A":{"text":"Two friends and I finally made it to Shaya for lunch on Friday after several weeks of anti","useful":2,"cool":1},"5iZVTehtyUgPn4nVl2DTtw":{"text":"If I could give this place 10 stars I would! I couldn't believe that we were going here on","useful":0,"cool":1},"Gbpp2vFm7xuIzP9HXInATA":{"text":"It wasn't until I had a strong craving for pita bread the other day did I realize I never ","useful":2,"cool":1},"5rv_YtlvJKwsfd4bXoeXOw":{"text":"What else can be said? The best Middle-Eastern food I've ever had. \n\nWe snuck in about 30 ","useful":3,"cool":1},"UpBlP58b95JcwgjxSur39A":{"text":"Rude not accommodating and inconsiderate of the elderly I've tried booking 5 times since m","useful":1,"cool":0},"YR4d_2PfHaUbi9b1bUgHhw":{"text":"Excellent restaurant across the board. Great ambiance. Great service. The food was simply ","useful":1,"cool":0},"TwUzxMB5WRI-DoJbU9IqcA":{"text":"We tried to get a table here for dinner, but weren't successful, so took a punt on a lunch","useful":3,"cool":2},"nOcfsRmXPx-HNc0N0hs1zQ":{"text":"Atmosphere and service was awesome. We sat in the courtyard and it was beautiful! Pita bre","useful":2,"cool":2},"64uJIS62lMf4tX51bLljCg":{"text":"Shaya fills a niche in the New Orleans culinary scene that many have set out to do, but fe","useful":1,"cool":1},"-ecNwfhT2AMPfCWJB1gr9g":{"text":"As a native Israeli living in the US I try to avoid Israeli restaurants and control my cra","useful":1,"cool":2},"PLFoOtF8tTOcx2WSK1cw7w":{"text":"OK.  I've been looking foreward to this for MONTHS!  As soon as I knew I was coming to NOL","useful":0,"cool":0},"nmyfv4ba4Qsj-I1WWHFNkw":{"text":"We ate at Shaya on Friday night with 7 friends. The food is fabulous. The roasted cauliflo","useful":2,"cool":1},"HApKauVsi6g-ABZbq2dgsg":{"text":"Great food but really awful service. \nWe sat at our table for 10 minutes without any of th","useful":0,"cool":0},"hsR0iBSn9Odwmwy86IrDwg":{"text":"As we dined at Shaya , the much acclaimed Israeli restaurant , on a recent trip to New Orl","useful":0,"cool":0},"Z5xNTmG6ukaP37SSOcGY0A":{"text":"Located on the charming Magazine Street, Shaya provides a charming upscale dining experien","useful":0,"cool":0},"fc-4cnB6QbCNiwLcyFg7Pg":{"text":"Hummus with califlower was amazing. I have tried hummus all over the country and make a me","useful":0,"cool":0},"yof3zZW5aE5nf0g00Y_ZMg":{"text":"this is literally best restaurant I have eaten at in a long time in New Orleans. Most of o","useful":3,"cool":1},"EOkhu6MU0xHLQopShWqm5w":{"text":"Amazing food.  My favorite was the Jerusalem mixed grill sandwich.  It might read a little","useful":3,"cool":1},"3gNtFQC2IkehQAxtKRsWlQ":{"text":"Though the food is pretty good, it just is not quite worth the hype. I've been 3+ times no","useful":0,"cool":0},"EjckbP7QgEHy1bZF6KmsdQ":{"text":"The food was slightly overpriced and over salted. The best thing was probably the hot pita","useful":0,"cool":0},"82qd84NIHNl52wD3YT7S0w":{"text":"Myself and 3 other people came here while in town for a convention and it was amazing! The","useful":1,"cool":1},"1flcggt_0ogF9ym-X8HbfQ":{"text":"There is a lot of hype surrounding this restaurant. Let me tell you, it lived up to it. Sh","useful":0,"cool":0},"aXnLHB9tLXSAEJlV9hQD6Q":{"text":"This is a great place to go with a group of people and has a beautiful inside and back pat","useful":0,"cool":0},"j-ECZq5XokOaqo7-9Vokgg":{"text":"Shaya has a lot going for it in the way of spice and unique flavor.  The pita bread was a ","useful":1,"cool":1},"vP5O-IoXA6mnGS3aB_bKRw":{"text":"Loved it. There are a lot of mediterranean restaurants these days where all you really see","useful":1,"cool":1},"1oHpsvjIAtSi6izPpKZsOQ":{"text":"We stopped for lunch after seeing Somebody Feed Phil. Everything we ordered was amazing, o","useful":0,"cool":0},"6wQ3aw2UK9i1PWAb4oOqkg":{"text":"Places not worth the hype in New Orleans: Commander's and about 1000 others.\nPlaces well w","useful":2,"cool":2},"jt3--LiCngJg6Z3svsjZ9A":{"text":"While the atmosphere and serving staff are great, I was not at all impressed by the food. ","useful":1,"cool":0},"Jfym9GOIwY9CxmdjpWVAPA":{"text":"One of the best dining experiences I've ever had. All shared plates and each given enough ","useful":2,"cool":1},"F2LPh6svmk73PUYb8Abe4Q":{"text":"Excellent food, okay service (somewhat slow). Lamb ragu hummus was spectacular, and highly","useful":0,"cool":0},"lq6oySbqBKNWTXFmNH5kKw":{"text":"The lamb shank was the best I've ever had. I recommend asking for carrots so you dont fill","useful":1,"cool":1},"4hOnXoAaHWiL88v64Lxx6A":{"text":"Short and straight forward menu. Hummus with egg is recommended.\nThe service was a bit slo","useful":0,"cool":0},"KAJwc4mrIFD4sZQJm51yNQ":{"text":"Amazing service, ambiance and food. Pricey but worth it. Best Israeli food I've ever had! ","useful":0,"cool":0},"2xtr5l5wFFUowQsg2qB8AA":{"text":"Shaya is as good as it gets. My wife and I have been here twice, with the last time coming","useful":1,"cool":1},"tamwbTTmo9nlC_ezYpb3Kw":{"text":"I saw this on Food Network's best thing ever, and this was also recommended by people I kn","useful":1,"cool":0},"1qgmqKz7LrZbuvR5fCk1NQ":{"text":"I love everything in this restaurant. I've been there a few times already and every time I","useful":1,"cool":0},"RhYcUwZ5KRHoUxofKwBrhg":{"text":"Definitely one of the best meals I've ever had!!! Food was AMAZING.  Love the décor in the","useful":0,"cool":0},"Ch3yj6WLWeKka_FqWNqh0Q":{"text":"The food is great.  I wish Shaya was still part of his namesake restaurant but I can still","useful":0,"cool":0},"CorjhTQkWSZ59jBTD0_g4w":{"text":"We were excited to try Shaya after being recommended by our local friends in New Orleans. ","useful":0,"cool":0},"fobxdMzB9-hMhuYlEA39Uw":{"text":"Big hype with the rest of these reviews. This is a very pretty restaurant. It looks like i","useful":1,"cool":0},"Z_aHH-vxigPBaElj2egtyg":{"text":"Radiant\nOutstanding\nSensational\nServer\n\n...the only explanation for what the name Ross mea","useful":4,"cool":0},"TYUL8V5rD9mpY8CBgVxdVQ":{"text":"Small plate heaven on earth. Lamb kabob - smoky flavor with great spices; Beets in a tahin","useful":1,"cool":1},"LhnJbaFnaOzSqdbnkg4W4w":{"text":"The food was amazing - the service left much to be desired. To give the benefit of the dou","useful":0,"cool":0},"xfi5em3ZQnoaPu7VxJFemA":{"text":"The fresh baked pita is what makes shaya so special. The hummus and the baba ganouj are th","useful":0,"cool":0},"8RTq9hx4LAe5FAHVRcvGJw":{"text":"Wow. I had high expectations of this place, and it managed to exceed them. Even my dad, wh","useful":1,"cool":1},"OgBcLRTSXICMXHqYwnxufA":{"text":"We dined at Shaya and feasted on wonderful\nIsraeli cuisine. The mistake we made before fea","useful":0,"cool":0},"wwzEL1wDhSwHXKX7F21MHQ":{"text":"Amazing.  We had the babaganuoush, tabouli, lamb ragu, falafel sandwich and matzo ball sou","useful":0,"cool":0},"-A6R3EtdEYDHLVntHK-fvQ":{"text":"Great! This restaurant makes food memories - Middle East and Eastern European food with a ","useful":1,"cool":0},"xZfyDndXShCIlyRuHk4Bpg":{"text":"LOVE LOVE LOVED IT!  The ambience was relaxing and cool.  The conversations between guests","useful":3,"cool":1},"OWk8Q3Q4xWxN4W7ku3Hyzg":{"text":"So I've eaten in at Shaya twice and picked up twice.  It's more of dine-in spot, but we li","useful":6,"cool":3},"81x3zPN5TLQYfUK4shVvdw":{"text":"Amazing food, fantastic service, in a beautiful space. Shaya definitely lives up to all of","useful":1,"cool":1},"NQpSoGMKhn3nJ-5jlDQZpA":{"text":"Shaya is excellent. From the mixed cocktails, to the grapefruit infused cardamom soda, I w","useful":1,"cool":1},"y7tPLVfpbF0mlKhzi7qeKQ":{"text":"When a restaurant receives soo much hype and soo much praise you wonder is it really THAT ","useful":3,"cool":1},"dBe3R6TEmf303C8M8zy-AA":{"text":"SOOOOO GOOOOD. I want to go back to New orleans just to eat there again!","useful":0,"cool":0},"nCg-O9vJtqHitInxYOUong":{"text":"Best hummus I have ever tasted, I say this as someone who eats two or three tubs of sabra ","useful":1,"cool":1},"Scna19ePP3XPgtNsTc0wTw":{"text":"Service was a little slow, but made up for with the taste. Every dish was superb. Speciall","useful":1,"cool":1},"JstiZ4wR7SzFOS6aoLQq_g":{"text":"This place was bumpin! We tried to make a reservation day of and they were full (Friday ni","useful":2,"cool":2},"rbzHjoK56SpFlFp20otgKg":{"text":"I just want to say, the denizens of Los Angeles (and a few token New Yorkers) came all the","useful":1,"cool":0},"N3JmTAoVohH3hQLCdowP0A":{"text":"Had a 4:30 reservation for 6, the wait staff seemed ready for us in order to give us the b","useful":0,"cool":0},"7z8CvX-neXU5QUxcMrAHFg":{"text":"The food is delicious! The pita is made fresh and melts in your mouth. The hummus is on an","useful":0,"cool":0},"2Gzp5XduC8sRLzat9EthqA":{"text":"Lunch at Shaya was delicious; service was great.  We liked everything we ordered, and, giv","useful":5,"cool":2},"AlZC4aLVuuFPzZP6Azs3yA":{"text":"Saw this restaurant won some award as best new restaurant in the country so I came to give","useful":1,"cool":0},"SYDdvXs2LDgZCQio0CIuaQ":{"text":"It's taken me a while to write this review as I have mixed feelings about the visit. I wil","useful":1,"cool":0},"MW6TlLmd-KAoJfF_uYYvPg":{"text":"We went to dinner at Shaya about a week ago and it was a real pleasure.  The service was e","useful":1,"cool":0},"jUaAa3aRQUNxuK5EVvZyPQ":{"text":"Amazing food and atmosphere!! Would definitely recommend and eat again. Best hummus I've e","useful":0,"cool":0},"ZbrD8MLXDuY_MBSE9cz72w":{"text":"Delicious meal- try lots of things to get a great sense of what this restaurant is about.","useful":0,"cool":0},"2cxIoCzKmDVjDGpHzG52pQ":{"text":"Incredible ambience to start. I had called see if tables were available, very nice hostess","useful":5,"cool":3},"PyPhfFVoKyGBGv1hNCVzOg":{"text":"What a meal. It's really 4.5 stars for me.  It started of with a birthday card from the st","useful":0,"cool":0},"ixv0XQ9IVPwnn6eivlMZjg":{"text":"ITS WORTH THE WAIT. Shaya is a bounty full of great dishes served in the perfect venue wit","useful":2,"cool":2},"0keEJscg8i7_MY-Vs5qLtw":{"text":"Great night out over all! We made our reservation a few weeks in advance and still the ear","useful":0,"cool":0},"UXnexprua3NsZgcoWYtKVg":{"text":"Yum yum YUM! The cauliflower hummus! Yes! The carrots! Yes!  A few of the dips were tasty,","useful":2,"cool":1},"6u4M-rIeb4VFdvEyVtHSKA":{"text":"Food was very good. Way too much hype though. Would recommend going for lunch. Not worth t","useful":0,"cool":0},"5JieLZgFySYr44xAqHOI3A":{"text":"Came here with a couple of colleagues for dinner. Being seated outside but the fans helped","useful":2,"cool":1},"PPVTJMlpOgDqLRpbml6W0A":{"text":"I don't really have a single complaint. Incredible fresh pita from the wood fire. Not many","useful":2,"cool":1},"4y0CnNpVbe0FGAmZip1Jkw":{"text":"From the minute you step into this very packed building till the minute you walk out with ","useful":9,"cool":7},"ngGuHjS2rp-qoHBlat5L_Q":{"text":"This restaurant apparently is booked always. But do not let that fool you. It is neither a","useful":0,"cool":0},"7_LYXGwklfvufUl2nd9E4A":{"text":"By now, everyone has heard of this place....it just won a big James Beard award. Well dese","useful":2,"cool":2},"gQUGWnlKyJketWin3XfHpg":{"text":"Margo is an amazing waitress! Food is awesome, lamb hummus and falafel is perfection!","useful":2,"cool":2},"zEwqtPqgMoOuLamnvhAd8A":{"text":"Wow.  Just wow.   I'm a huge fan of Middle Eastern food and this place did not disappoint.","useful":2,"cool":1},"ZW_AojAchYv_TPWubv0cug":{"text":"Absolutely fantastic. The food and atmosphere were exceptional. The sommelier is very know","useful":1,"cool":2},"pb0arkivckQ6uhTcAWLUGw":{"text":"This new hot restaurant makes a white-washed nod to Israel replete with a bit of attitude ","useful":2,"cool":0},"pCTuvz08q8upAOBmfy1jTQ":{"text":"Shays is a lovely restaurant. Simple decor and design. My friends had great cocktails. We ","useful":1,"cool":0},"1mum0McfgmXWKAoLK9G9zA":{"text":"What can I say that hasn't been said?  Shaya is the best, and you WILL enjoy it, if you ca","useful":0,"cool":0},"igIVpSeD1F2UUikSe5s91Q":{"text":"Did not expect the food to be so bad here after all the good reviews but it really fails i","useful":0,"cool":0},"GcCqAgb8oFD9sjR_fP-bSA":{"text":"I really enjoyed this restaurant and the ambiance is perfect and the food is amazing.  We ","useful":0,"cool":0},"4Yy7hDvMoE39Tk9m14dCcw":{"text":"Shaya is good. Eat there. The lamb was the best I've ever had. I'd also like to compliment","useful":1,"cool":1},"Bjuj2LGcQr8kSByya2zvFA":{"text":"Honestly the most amazing restaurant we visited during a food-obsessed four-day tour of Ne","useful":1,"cool":0},"uqA2zTj2_n-Dywj5X5B9Mw":{"text":"Oh the hype and having to book way in advance, was a bit skeptical. Then was blown way by ","useful":1,"cool":1},"vjMyiqIUrRdhDc0ID4ZoEg":{"text":"WONDERFUL. The egg humus was wonderful. The lamb shank was incredibly tender and fell off ","useful":1,"cool":0},"jzQN4I5guF8-LcK8GBNykA":{"text":"Shaya is my favorite restaurant in Nola so far. Every time I go EVERYTHING is amazing. I m","useful":0,"cool":0},"3HFcy6-ipMOr8pSMTv8MTQ":{"text":"Overall the food was very tasty and the service was exceptional. The matzo ball soup was w","useful":0,"cool":0},"xEa9IQ0qORKQm5qC5cpC9g":{"text":"This is a really, really great restaurant. It's not the best I've ever eaten, but between ","useful":1,"cool":0},"2aEFZm_xA1GdmBGTaq22QA":{"text":"This restaurant got very decent looking with easy parking. The service was good and better","useful":1,"cool":1},"TmBDdbhaVGn57os1smITkw":{"text":"Omg. Best in NOLA hands down.  Make sure to book in advance. And get all the hummus and la","useful":0,"cool":0},"6O8whKb8-QVUsi7YFO23LQ":{"text":"Fabulous! We went for lunch and ordered several small portions from the menu. Everything w","useful":1,"cool":1},"id5QfOsSPcbcPhecluGTYw":{"text":"Fantastic food in a neat area! If you are a party of 1 though, make sure to come at an off","useful":0,"cool":0},"wGPCNPCttY8IHxljRVkPHQ":{"text":"Oh boy. Where to start? I really wanted to give this place a 5 star review, but after my e","useful":3,"cool":2},"bcsbk2PFfSuViHYqmvYoyA":{"text":"Lunch at Shaya was remarkable. We had multiple small plates and all were exceptional. The ","useful":0,"cool":0},"jjBn9yWzXX2sbtgSWNqCEA":{"text":"I have eaten here several times and the food is fabulous, unfortunately the service has de","useful":1,"cool":1},"c4EXguFtw3Z52sJe6d9gZw":{"text":"I came here for lunch on a weekend, and was glad I made reservations a few weeks in advanc","useful":1,"cool":1},"-w74JXniyg9XB3bSTpS-hA":{"text":"\"Stick with the Starters\" was the unanimous vote of the 5 of us. Fresh pita ( literally st","useful":1,"cool":0},"TfxnvylCyVZu95JnjqFz3g":{"text":"Doesn't get any better. Beautiful delicious unique lunch. We nearly ordered whole menu and","useful":0,"cool":0},"SFQUqn4lpRHzZBUo0qKZpA":{"text":"Best thing here is the pita. Don't go overboard, at this place simplicity rules. Excellent","useful":0,"cool":0},"UGbGxRINfA4OAnmR6-GzMg":{"text":"That once in a blue moon dream experience where each dish delights and you eagerly anticip","useful":1,"cool":1},"b1io3owfMtM7AGUEUEQsQQ":{"text":"I thought I had had a really good Middle Eastern food in the past but the simplest things ","useful":2,"cool":0},"h9T-HuOEb6lpNhCn2HsxCA":{"text":"Service: 2.5\nFood: 4\nAtmosphere: 4\n\nThe salatimes and small plates were outstanding! The p","useful":1,"cool":0},"9RIUbYfuJor4CrNzdUkz6A":{"text":"This was by far our favorite restaurant of the trip.  I know when you think of New Orleans","useful":3,"cool":1},"faQwK4LS4FdSZdQHL1LfOA":{"text":"A friend of a friend is a chef in Nola and recommended Shaya and WOW-- an incredible recom","useful":2,"cool":1},"FO2yp7NeIRTW8sR7a5Yo4w":{"text":"I guess I'm just adding to the echoes here, but yay! So delicious!\n\nI have been meaning to","useful":3,"cool":3},"Yv9B6jKl-zZtG-XFZmtalg":{"text":"Shaya is a gorgeous restaurant with remarkable food that somehow tastes better than it loo","useful":12,"cool":12},"4DlOqF5ezl6fIP8gylVAqQ":{"text":"This place was incredible. Everything pairs so well between the cocktails, appetizers, and","useful":0,"cool":0},"qf4ifq3D2aT-9Ymt63hD7A":{"text":"What a gem! Came here with some vegan/vegetarian friends on a recent visit to New Orleans ","useful":1,"cool":0},"P_pIZ8lZhN2F19nDFOakMg":{"text":"Simple, beautiful, elegant, and delicious! The tabouleh was the best we've ever had. Every","useful":0,"cool":0},"uC423MzfWnoVswz-Ra5AGw":{"text":"Best Mediterranean I've ever had and I've had my fair share of Mediterranean food. Caulifl","useful":1,"cool":1},"IcBdvqg6HCtfHFhOmGk_mw":{"text":"Celebrated a friends birthday here and had a great experience with some delicious food...\n","useful":1,"cool":0},"jigUrWSJINNkflyL_NxhPA":{"text":"Amazing flavors. Fresh. House made pita. Great wine. Great staff. Babka desert in skillet ","useful":0,"cool":0},"9_hPwRCobPoBqXWoFXmU3Q":{"text":"I experienced the most rude treatment I have ever encountered at a restaurant today when I","useful":1,"cool":0},"TqxzTeugLsauHQgiuSzvcA":{"text":"Met here for a work function and while the round of passed apps and desserts were deliciou","useful":1,"cool":1},"M0YKe7fM5upQBuqYwzzzYg":{"text":"We were fortunate to stop by Shaya on our way out of town and got in on a Tuesday in Novem","useful":0,"cool":0},"kLaTPbhKXYOTE0b-huepFA":{"text":"Believe the hype, folks.  Alon Shaya's new Israeli restaurant on Magazine is everything yo","useful":4,"cool":3},"iFnUuc4I39ls_nXh_Pb1xw":{"text":"Unbelievable! Incredible food, incredible service. You have to go here! One of the best re","useful":0,"cool":0},"Q9tiMdlKIkVD6Z_NLnyooQ":{"text":"Absolute perfection. We walked in without a reservation and were seated outside, in a surp","useful":1,"cool":0},"lG0f_xOE2rjw-uhip2ALJw":{"text":"This place is a must if you like healthy, delicious, beautiful food. Newly remodled just a","useful":1,"cool":1},"Cc3LiZnJkzCnsEmrOIiadQ":{"text":"I really want to give Shaya 5 stars because the food is so, so good. Everything we had was","useful":4,"cool":1},"YC45uaf-Rx2iQNv111QLsg":{"text":"Wow that was an amazing food experiences. Without a doubt I can say that this is the best ","useful":2,"cool":1},"nfCNnb93Lp16q6hSv-B8pA":{"text":"Confession time: I think Mediterranean food is fine. Just fine. I think it's really diffic","useful":1,"cool":0},"8K-JJPAINZ55xo8zac2Dxg":{"text":"This is what a 5-star yelp review is all about! Make no mistake, fellow yelpers, when you ","useful":1,"cool":1},"iRtBobNXetSCRZHexYMy5g":{"text":"The food at Shaya was incredible. By far the best bread I have ever eaten. We enjoyed seve","useful":0,"cool":0},"oX0yxC7QCurIj2mQobyvkw":{"text":"I was just there for my birthday and I loved absolutely everything I had. My boyfriend wou","useful":3,"cool":1},"AkgqDGqFIgc-TxLCRXS0aQ":{"text":"This place totally lived up to all the hype! Not only was the food amazing, the staff went","useful":1,"cool":1},"uId6zTP6liBl07Ud3bcHIg":{"text":"You want to talk about an ideal vacay? Booze, babes and Bourbon street. Yessss, that was m","useful":4,"cool":5},"eGr3-F2h2-JZad5XiVsyWA":{"text":"Shaya is perfection. The pita bread is made on site in the dining area. I highly recommend","useful":1,"cool":0},"v5WsfKuLB6qc2tQkMirirg":{"text":"Love this place in every way. Both the ambiance and vibe are relaxed but trendy and fun. T","useful":0,"cool":0},"rD-Lv8uWVHl4bck08O9TWQ":{"text":"Unfrickinbelievable. This was by far the greatest restaurant I've ever been to. From the s","useful":1,"cool":1},"rEhfg4WacXRmz0SaRxbjMg":{"text":"One of the best meals I had during my three day trip to New Orleans- that's saying a lot w","useful":3,"cool":2},"LQ_iXk5s9HH33xXr-AYTBg":{"text":"This place will redefine how you view Middle Eastern food.  The hummus with lamb ragu is f","useful":1,"cool":0},"N_L0edA6xzZywKGN47knuQ":{"text":"Great Mediterranean menu. Take the green street car; on $3 for an all day/34hr pass. The s","useful":0,"cool":0},"zGODst9KE6P_Fg9ysCCN2A":{"text":"Literally the best food in New Orleans. The drinks were fantastic, try the mad monks. The ","useful":0,"cool":0},"dOn9w9Nt9cozm_EsN-JJIw":{"text":"Loved every bite of our sumptuous sexy mezze fest of hummus, crispy halloumi, baba ganoush","useful":2,"cool":1},"S0mOh5SgeNCd4QJjPR5D6g":{"text":"I ate here on a Sunday night with a group of four, we just walked in and sat out the back,","useful":1,"cool":1},"bn_V5AVR8DqT7b1ya3GPrA":{"text":"The restaurant was packed inside, but not completely. Maybe you have to make reservations ","useful":0,"cool":0},"kqRlc3J7_693pBy77d7HsA":{"text":"Well this place certainly lives up to the hype! Took my fiancé here for a date night and w","useful":0,"cool":0},"p9AYY_pkwxQmOziiozsxdA":{"text":"Made our reservation well in advance and we were not just pleasantly surprised, but overwh","useful":1,"cool":0},"I1WfHDlhSS3dTQVti3uR4A":{"text":"Shaya was a (insert scoring sports metaphor here)!\n\nThe space is clean and airy. We didn't","useful":15,"cool":6},"zB1PA8Bbcqp6HvJirYZVcQ":{"text":"One of the best Mediterranean food that we had in the recent past. Fresh and simple!!","useful":1,"cool":1},"_za0mV9Q4PnkrxGLbu-MGw":{"text":"Shaya lived up to my very high expectations!  I had read so many things about it that I wa","useful":0,"cool":0},"C2pZ6YcdvMOdDOxa31SlmQ":{"text":"Shaya- I have had intentions to come here for quite a while and finally got here with some","useful":1,"cool":0},"2whbaFeZeGy1bu2P7vvU4w":{"text":"I'm giving it 5 stars only because I can't give it 6. The fresh hot pita bread is amazing,","useful":1,"cool":1},"SSZdYtj5V6_4Zblr75kI4w":{"text":"So here goes. After a ton of anticipation and excitement leading up to my family's 7 day N","useful":4,"cool":0},"rc58U2LsmGnEn9d13JDCDw":{"text":"Shaya is amazing. I'm Israeli and the food was everything you could ask for, if not more. ","useful":0,"cool":0},"H7Dq3acKueln0xGU--VuTg":{"text":"Wow. Shaya truly rocked my socks off. It is in my top ten restaurants I have been to. Peri","useful":6,"cool":5},"u3hHfli8DE72cbgueOLynA":{"text":"Shaya is, without question, worth the hype. Every award and glowing national review is wel","useful":1,"cool":1},"beXwwihtdqekOewR6geH1g":{"text":"Excellent choice for hot weather cuisine in a quieter part of the city. Well worth the 20 ","useful":0,"cool":0},"RpOTBUx9KJyrPSBw73JR8g":{"text":"Good food, the bread is divine, the waitress never brought out a few things we ordered!  S","useful":0,"cool":0},"HHcqI_VoxnHLgqlw25ULIA":{"text":"We ordered the hummus with tahini, matzo ball soup and the shakshuka...holy schnikies yumm","useful":1,"cool":0},"6-kf9YBhkTgoGIptwxC_1g":{"text":"I ordered takeout from Shaya after having a great experience at the restaurant on the Sund","useful":6,"cool":4},"DWX9vovzpHGtjnwZrcoaaw":{"text":"Having just traveled to Israel I can personally say their hummus, schnitzel, and lutenitsa","useful":0,"cool":0},"Vi04ZSUta3l_xaHv-P3-zw":{"text":"Never have I ever had a better hummus. \n\nThe hummus sampler we tried was amazing, as was t","useful":0,"cool":0},"Jg9GTrt7vWmciqc6FjUDPw":{"text":"Lovely warm colorful inviting space. Busy even at an off hour mid-week but the service bar","useful":1,"cool":1},"7aQtuMBkDQgHvIvoEOsZNQ":{"text":"After waiting 6 weeks for a dinner reservation, we came and were seated immeadiatly. Howev","useful":0,"cool":0},"KlXsEQ8FjfubBGZbMyuV-g":{"text":"So glad we came here. This was one of the best dining experiences we've had in a long time","useful":0,"cool":0},"MblYiveQpaCICmQlL-q21A":{"text":"I had heard great things about shaya and it's safe to say this place doesn't disappoint. Y","useful":1,"cool":1},"B3rAZ3ZxOovpvuQCsHYTMQ":{"text":"Just go, ok? Ok. Because...\n\n1. Best pita I've ever had.\n2. Delicious cocktails and great ","useful":1,"cool":0},"u8AG70ZuYeHlBDrcWUvA6g":{"text":"The third time's a charm at Shaya. This is not to say that my first two dinners were bad, ","useful":4,"cool":3},"k2FHPWW46JW4gVEwK6jUuw":{"text":"So I've been coming to Shaya since they opened and it has been consistent since. The ambia","useful":1,"cool":0},"adRd1NXUYiKpgiuStek2oA":{"text":"This lively spot was recommended by a friend and she was not wrong! The drinks were beauti","useful":0,"cool":0},"VWF1vmlFyw6zBeodEflBLA":{"text":"We were able to get in without a reservation.  Hummus with curried cauliflower was amazing","useful":1,"cool":0},"g8KTHMumgTe0h4rAjOs2qg":{"text":"This place is perfect for a group of friends and sharing - my favorite way to eat!\nEveryth","useful":3,"cool":2},"_9htoEmVZ5Ckk74vaxrPcg":{"text":"I don't get around enough to know if this is the \"best restaurant in America\", but Shaya i","useful":1,"cool":1},"VPl_2HCPrpqLSgvOZYqLTg":{"text":"Simply amazing. \n\nI was initially put off by the awkward wait my husband and I had standin","useful":2,"cool":1},"x1nzHTHYVjHdjPQACP1fUw":{"text":"The fact that me and my family went to Shaya two days in a row speaks for itself. Really a","useful":1,"cool":0},"Iyeybrk8sjo1pYtcarci8g":{"text":"Shaya is my new favorite restaurant in the city.  The dinner I had here was the best meal ","useful":1,"cool":1},"D5O4vrwFb8kJX8zmyHMq0Q":{"text":"Roasted pita, smoky eggplant, perfect red pepper dip. Congenial, modern atmosphere, attent","useful":0,"cool":0},"SH_oxf3VAjmA8uJJj4r9Ag":{"text":"The service has been disappointing, twice now. The food was excellent, but the level of se","useful":1,"cool":0},"WaA2x_ZjOypDoykbBQS85Q":{"text":"We didn't even need to order a meal, just split the 5 apps/small plates and hummus and lef","useful":1,"cool":1},"Ze27EIjkNgUdqwE77387Tg":{"text":"Everything about this little gem is excellent.  I had the lamb ragu with hummus yesterday ","useful":1,"cool":0},"yqfUU0obpsqxSVv-SWxYtA":{"text":"This place is incredible.  It's located in the Garden district which is a beautiful neighb","useful":0,"cool":0},"ogew6WgKB3flhweREWS2QA":{"text":"I've dined here twice. Overall it was positive, but I did expect more from the James Beard","useful":0,"cool":0},"8FB9j_-0QaSPIv6lIZzX1A":{"text":"I really enjoyed my experience at Shaya. I don't think I have ever had pita bread quite as","useful":2,"cool":1},"57LAuysppOrW67IghNaoYA":{"text":"So obviously the food was great I'm very familiar with all the flavors very fresh and good","useful":1,"cool":0},"tJ0VShQFWsdwkLDG7762Ug":{"text":"Nothing bad to say about this place. Guarantee it will be packed on the regular. Was a lit","useful":1,"cool":0},"EZyfdfPN1vvTKWqqdwlx1w":{"text":"Food was okay; three in our party, with mixed reviews; one loved a dish, the others not so","useful":1,"cool":0},"Y2bkXeNTW2cZlqMO_L20MQ":{"text":"Amazing!!! Must go!!! Appetizers were delicious. We ordered the falafel and hummus with la","useful":0,"cool":0},"qti2CBMQiGPR7Zo-oYas9g":{"text":"The food was delicious and creative, the atmosphere was calm and elegant, and the service ","useful":1,"cool":1},"FipQzfXw6rPDS6R8fvMZ_w":{"text":"Great experience. Literally had no idea what I was ordering but loved every bite. Definite","useful":0,"cool":0},"ehMQy0Y3me-xN-7q0KatGA":{"text":"First off Shaya is not Creole or Cajun so if you want a NOLA experience this is not your p","useful":0,"cool":0},"0PjoyaA4lkGu2swe2Ydfqw":{"text":"Ok, but tries too hard. \n\nNeeds to relax and be itself \n\nCold reception walking in. Would ","useful":3,"cool":0},"n9G0ztaFYmmWgVl3NmK3iA":{"text":"Coming from out of town it was tough to pull the trigger on skipping a creole/southern spo","useful":1,"cool":0},"LT-DxRsP2zBV81UErZOa4w":{"text":"Shaya is a nicely decorated space in a good section of Magazine Street and it has it's own","useful":1,"cool":0},"NwQTgBqlwOSEDoOe9TMtdw":{"text":"Going into shaya, i was skeptical how the flavors of Isreal would be represented in the me","useful":4,"cool":3},"BKzRgGAkveffPQ6sAPgjgA":{"text":"This place was absolutely incredible. Coming from a heritage of this cuisine, I can not ex","useful":1,"cool":0},"KuRpT8YVEDEnlvhEDZ8K8w":{"text":"Doesn't get any better. Beautiful delicious unique lunch. We nearly ordered whole menu and","useful":0,"cool":0},"I1TQZjY7DvfSHD5ecNhwTA":{"text":"My fiance and I had a wonderful experience at Shaya. Great food, service, and ambiance. Ev","useful":1,"cool":1},"Esf_wYnngmttMwkVTz8Ckw":{"text":"The fresh pita is to die for. Went with a couple of friends and ordered a bunch of small p","useful":2,"cool":1},"qyTbm0P0NijITRL1XPql6A":{"text":"I have to say I expected more. \nThe pita was amazing and the amba was great.  But, for $12","useful":0,"cool":0},"if0IfG2vdMziMGxK0qEbxA":{"text":"Although there's quite a bit of buzz about Shaya, I had been lukewarm on the idea. We have","useful":1,"cool":0},"kwRK0zTf0BqJ6JhvDtXKLQ":{"text":"Amazing food. The cauliflower hummus is great! The service was awesome. I can't wait to go","useful":2,"cool":0},"4cIEKLMyGLGn_YKYH1HKlA":{"text":"Had a casual lunch one rainy Saturday.  It was packed.  Had the chicken schnitzel, and it ","useful":1,"cool":1},"V-QJMMTphWsx6Cji4T5R1Q":{"text":"Y'all... Shaya is SO good. \nThe pita. The hummus. The bagaganoush. The roasted beets. The ","useful":2,"cool":0},"IxY4C4X_kpBwOCDa-OBYQg":{"text":"This restaurant and its service lived up to all expectations and recommendations by family","useful":0,"cool":0},"G_Yp7ZfOX2zhmgJI4ibDeg":{"text":"Absolutely delicious food paired with wonderful service! \n\nMy group ordered probably 15 di","useful":1,"cool":1},"XgMG2g4rmB5xBnGyWYK4pQ":{"text":"Did not disappoint. The environment is great with ambient lighting and traditional music. ","useful":1,"cool":1},"HX9fZTu6K4zR4F1ujvhPJw":{"text":"Delicious Eastern Mediterranean Food\n\nShaya is a nice break from a steady New Orleans diet","useful":0,"cool":0},"tBjwaZMAzZfbCdPsCsQmeA":{"text":"Freaking delicious.  I couldn't believe how good it was.  I recommend that you try the Mor","useful":1,"cool":1},"dHlVxE4U2zy9HuuSjp4m5A":{"text":"4.25 stars.  If I lived in New Orleans, Shaya would very likely be my go to restaurant for","useful":5,"cool":7},"Onu9oCLhdZpwK29uTI8BOg":{"text":"One of the best meals I've ever had! Our meal was absolutely fabulous from start to finish","useful":1,"cool":0},"PQVdjM0U5VZdi4D_Ijf20A":{"text":"We didn't have reservations but we sat at the bar and it was worth it. The Falafel was rea","useful":0,"cool":0},"MPzHtyzFB8kp2wqnJV-aIQ":{"text":"Shaya was absolutely delicious and inventive but was it worth the price? I kept asking mys","useful":0,"cool":0},"VFNEuwpwpIk82yqP3MEQGA":{"text":"BLUF:  Very unique place in NOLA.  Amazing food.  Very nice atmosphere.  Great place to go","useful":2,"cool":1},"LfvjayXHutGlg7yAItgl8Q":{"text":"Enjoyed the food and atmosphere here a lot. Had dinner with a party of three. Love the fac","useful":1,"cool":1},"0-YK5N0h586LwOOYejwDFQ":{"text":"Definitely our best meal on this recent NOLA trip and we certainly did not expect it to be","useful":1,"cool":0},"RUKzibISy2StdPMBUbTeQA":{"text":"Went to Shaya on Wednesday night for our first meal out in NOLA. We opted for the bar sinc","useful":2,"cool":0},"PXgcgOBUycTBSl5-Lb_CJQ":{"text":"Came in for a weekday lunch with my fiancé.  We made a reservation fortunately, as we hear","useful":2,"cool":0},"ICAHh4QcPdH1qQy_Zw9iww":{"text":"Such a pleasant lunch meal we had here. The place is a little tight with so many tables cl","useful":1,"cool":1},"mDEQPCXNp3ijbvGevVChqQ":{"text":"The flavors were rich, cohesive and left me wanting more. The textures of the dishes worke","useful":0,"cool":0},"5qiX8CphTbXzofwCaFikvA":{"text":"Food is fresh tasty and pretty accurate, but overpriced and small portions.\n5 stars becaus","useful":0,"cool":0},"F0XmOtpJkU6oBuuqAuakZw":{"text":"And to think I questioned eating at a middle eastern type restaurant in the heart of New O","useful":1,"cool":1},"ebYnPRgUCtB-b3q65cC-eQ":{"text":"The hummus.... the best damn hummus I've ever had in my life.  We got the curried cauliflo","useful":2,"cool":0},"lb4-B5-oULiJ0XdLXe5-uQ":{"text":"There is a reason why this place wins awards and lands on every \"best restaurant\" list- it","useful":0,"cool":0},"GFXP_h5y85O9XoTgFVi5og":{"text":"We just had a wonderful dinner at Shaya. Part of our group had already been for lunch rece","useful":2,"cool":0},"QuRZjfRNJ24tUIlhyXELFw":{"text":"I enjoyed this ...  so much.     we came for a friends birthday, and we tried many dishes.","useful":1,"cool":1},"A-RVgRaYvl5MAneBNugpXA":{"text":"This place deserves fully to be crowned best new restaurant in New Orleans. It doesn't mat","useful":1,"cool":1},"xJjZTSb_c8of_uxDczKFfA":{"text":"I stopped in to Shaya with some friends for dinner to close out a New Orleans weekend. Poi","useful":1,"cool":0},"b_yvScwrOfwYuep898NZvw":{"text":"Really enjoyed our meal at Shaya.  Everything we ordered was well prepared and super tasty","useful":4,"cool":2},"2-qZOofm9AFNDZli_DCRWQ":{"text":"Hands down my favorite restaurant in New Orleans from the ambiance, to the decor, to the p","useful":2,"cool":1},"PCZ6n6p8DGpGf1HymrivSA":{"text":"The food at Shaya is awesome! We had the baba ganoush, tabouleh, israeli salad, curried hu","useful":2,"cool":2},"PwptNZXg8zEwNlxklVSnjg":{"text":"Me & my husband went there during our recent holiday in NOLA.\nThis place has amazingly goo","useful":2,"cool":1},"hpNMjyJHmz0r3A5C1bl-wA":{"text":"Everything is delicious. Come here and eat here. I don't care what you order. Just eat it ","useful":1,"cool":1},"wVIKBHfhNExTQWVQKCNeJw":{"text":"Truly meh. I do not understand why this is so popular.  We went and were so excited to go,","useful":0,"cool":0},"b70__t-2r-TJkEQoe-AnPQ":{"text":"I wanted to edit this post to thank Alon Shaya and his general manager Shannon for taking ","useful":0,"cool":0},"7KD75bF9qrF71LlNPdGsyA":{"text":"Ok at best. Overpriced and tasteless. Besh lost it with this one. ONE PITA at a time? Drie","useful":3,"cool":0},"vB5Xg0rC0u6nCf4SVPLVwA":{"text":"I know, I know, another 5-star review for Shaya, trendy huh?\n\nShaya totally lives up to AL","useful":4,"cool":0},"DBfTwuuX9o7jXhnf_GR4Ow":{"text":"Five stars out of five. We were delighted to find this place as it serves authentic Medite","useful":2,"cool":1},"kRmEhNuxN4ymp-KiWXJsRQ":{"text":"I went here for my birthday dinner while on vacation. Beautiful restaurant, great drinks (","useful":0,"cool":0},"lariWzLkdqeSI92USNUfQQ":{"text":"There's a reason Shaya is ranked #1 on Trip Advisor. The food here is incredible. From the","useful":2,"cool":1},"3PXZGFz1p16-YGmOPFskxQ":{"text":"Went for Christmas dinner and place was slammed. However, Jessica and Ryan made sure dinne","useful":0,"cool":0},"VDc4lQu43MOkarf1RQOVTg":{"text":"Went here on my lunch break with a co worker. Really enjoyed the cauliflower hummus. Their","useful":2,"cool":1},"Nm9nOpXF_fkM5hFrvh4AYA":{"text":"We decided to experience Shaya for a \"coolinary\" weekday lunch.  The place is nice and cle","useful":0,"cool":0},"Y4aHJAvyoFpMl9Vth4Yuvw":{"text":"Excellent and imaginative food in a city that is known for its fantastic creole and cajun ","useful":0,"cool":0},"PUd6kXngUSL6jIhLxEMd3w":{"text":"We rolled into New Orleans and realized we didn't have a plan for dinner. I'd heard someon","useful":0,"cool":0},"NIDhWRf3-1DdfcOpbwI_hQ":{"text":"Worth our 2hr drive just to get here.  Some of the best food ive ever tasted.","useful":1,"cool":1},"Klefl5pYz1AHgAxHx1-UsA":{"text":"Modern Israeli cuisine in NOLA? Yes - please!! Wow this place has such interesting flavour","useful":2,"cool":3},"l4OZvCbhCQSoyV8wipbCGQ":{"text":"Of corse I am bias to Mediterranean food, but I this has got to be my favorite restaurant.","useful":1,"cool":0},"9gCetWmR-mZ-tbDpKctbVA":{"text":"Went here with my wife.  Basically a high end middle eastern restaurant.  Any item with a ","useful":2,"cool":1},"DAF-C7a-s-uH5mwmvoS-lA":{"text":"The three of us came here for lunch because it was highly recommended, and was told we wou","useful":3,"cool":4},"bNTtySQY9JSJxhLCKxXGNQ":{"text":"We enjoyed the wonderful and knowledgable staff.   The pita was outstanding: hot and tasty","useful":0,"cool":0},"tbeTJA5w4ejMUIhzkJ_HzQ":{"text":"Phenomenal..... Food, service and drinks were excellent. Fresh pita and hummus, with a fis","useful":2,"cool":2},"BIH7jW2YPncWRg8_aE5vAQ":{"text":"Every single dish that we ordered was a tasty, delightful adventure for the pallet. The fo","useful":2,"cool":2},"khDNECNfQFKJDfevqNULJg":{"text":"OMG! Food was delicious. We shared small plates. Prices moderate. The wine was ok...not wh","useful":1,"cool":0},"4-rTEA97OT4y2hq0H8AXWw":{"text":"Creative and inventive Israeli inspired cuisine. This place won a james beard and you need","useful":1,"cool":0},"LOzvivMtXGpjFS0gaiUjtA":{"text":"I didn't know what to expect from this place, but it definitely surprised me in a great wa","useful":2,"cool":1},"Uco2XcPNqFILs-sZEyg5NQ":{"text":"Best mediterranean food ever!!! I could visit new orleans again just for this food. Everyt","useful":1,"cool":1},"ZReu3-dlTwDCpGIH8I9E3A":{"text":"Such a nice meal. \nFelt like I tried everything with their for the table options. \nPitas w","useful":2,"cool":1},"fFVAqA4Xu6sDd_hGvi5gCw":{"text":"Absolutely the stand out meal on our recent trip to New Orleans!\n\nThat cauliflower hummus ","useful":2,"cool":2},"UvyBQrlZpz7mcEO_o-w8IQ":{"text":"As someone who lives in the neighborhood, I had been listening to the hype about this plac","useful":0,"cool":0},"AqqrXOHgLWtkiZ0VrfQCBw":{"text":"MEDITERRANEAN FOOD TRUTH! Worth all the hype. That being said, the hummus is the entire re","useful":1,"cool":1},"dFc-InadSxJIBwQVJ1VJOg":{"text":"Saw this restaurant on somebody feed Phil and made it a point to visit now we have been to","useful":0,"cool":0},"8Vv_mC8UeiUNRXFfdurhkw":{"text":"Yum! When you want a change from the normal new orleans food and want to give your palate ","useful":1,"cool":1},"rIegoBXdcJrEV7wfb481rA":{"text":"Had an absolutely wonderful experience here. The bread is out of this world. Smoothest hum","useful":0,"cool":0},"5-D2UlByN1dhM9dnxaSRiA":{"text":"Had an outstanding meal with my mom and her friend for lunch! Sam was an outstanding and p","useful":0,"cool":0},"WDs5P0LrUllH2FekG9pfYA":{"text":"Stunning new restaurant that impresses at every turn. The food is incredible. The decor is","useful":17,"cool":14},"QmfDFbmg2BmqDXn9Km_gmw":{"text":"What a wonderful gem! I was very excited to come here and was hoping for a magical experie","useful":1,"cool":1},"NC4oftW6x7Wloc3Q5Nr9yA":{"text":"Great service, drinks, and food. Freshly-fired pita is already amazing, the delicious za'a","useful":0,"cool":0},"xA05iXZoMuTvd9twFJOWkw":{"text":"Amazing dinner! We had every item on the menu in our large group (except the Avocado Toast","useful":1,"cool":1},"swDAbrrU9EBtGJu0qsG2PA":{"text":"The Hype Is Right\n\nHere's a place that stands head and shoulders above their counterparts.","useful":1,"cool":0},"RSWLUpz9RyJ50oXnmxWgpg":{"text":"After looking at the other reviews, there really isn't much to add. This place is unreal. ","useful":1,"cool":0},"FEGco7kR5dcHofb8YGSG3w":{"text":"so much hype! I had a lunch here that was delicious. dinner was overwrought and overcompli","useful":0,"cool":0},"MmpJALbX7RZLFIKxWYVCgA":{"text":"Superb. Impeccable care is taken with all the small plates to get the subtle flavors and d","useful":0,"cool":0},"okhkfoz5sbs0wc6mB1XDJQ":{"text":"Amazing. Perfect. Amazing. Perfect. \nI ate in Shaya twice during my stay in New Orleans an","useful":0,"cool":0},"kijdpWsxCCusrkcL959Axg":{"text":"Having grown up eating middle Eastern food I was very excited to try shaya. I found that e","useful":0,"cool":0},"uUHj3GbEOwSyyYeAqESIYQ":{"text":"You must have reservations and we had to make ours months in advance. The pita bread is fa","useful":2,"cool":2},"lXuehtIxwyxYhs_GIJoxIA":{"text":"I really liked the atmosphere here which is a depature from from the classic designs of ne","useful":1,"cool":0},"v74pEfuMNhZtkHoSqmev4w":{"text":"Shaya was very eclectic in its choice of which Israeli foods to feature. The hummus with b","useful":2,"cool":2},"VlVKp8ja9bxDkVwAb9Adpw":{"text":"I really enjoyed my visit at Shaya. The pita is to die for! It's so fresh and tasty. I had","useful":1,"cool":0},"qDtvdQX4QeRbH39KYeOZVw":{"text":"Israeli food? In NOLA. 100% worth the hype. Restaurant is beautiful and inviting. Menu is ","useful":0,"cool":0},"m8-NYrLFF8q7_HjlZKb-QQ":{"text":"Fabulous !  Had a great lunch.  Both food and service was excellent .  Will definitely be ","useful":1,"cool":1},"NE-WwQIrz2t6QAQ8ijb1gQ":{"text":"Everything was great! A must visit! Hot, fresh unlimited pitas. We ordered asparagus/snap ","useful":1,"cool":0},"HYfi2ycpg7MXEKT8mJTuBg":{"text":"This place is incredible! You will never want to eat store bought hummus again! The signat","useful":0,"cool":0},"-mEfSNL2stoBx3pGBD91jg":{"text":"All this speak about Shaya and then I saw it listed as one of the \"best new restaurants in","useful":8,"cool":2},"TnsXhwy0qXm93-J2uGhVuw":{"text":"OK. I need to be truthful here. I have never been to Shaya, but I looked at the menu and i","useful":1,"cool":1},"A1RFXKDDE1XSaTyTTtgZRQ":{"text":"Shaya is easily one of the best restaurants I've ever been to. First thing I noticed was t","useful":1,"cool":1},"beELwDNIV2smcUe-uipsIQ":{"text":"Just go eat....sit at the bar if you can't get a table....\n\nAsk Tennessee (the Elvis looki","useful":2,"cool":0},"ODdSIkvYMxaIusArVODHpw":{"text":"Had a fun flavorful mid Eastern meal. Very accommodating chef! All selections that could b","useful":0,"cool":0},"kl60kpUMypBcyEt-xEsWog":{"text":"Great decor and ambience. Overall the dishes were quite good but nothing incredibly innova","useful":0,"cool":0},"WcBb0egSqDsD4FWzdTEUbA":{"text":"Things we got for a table of three: \n\n1. The trio- ikra, baba ganoush, and labneh \n2. Caul","useful":1,"cool":0},"H3GBRnjRXEdtBHtQdiY-uQ":{"text":"We have not eaten there yet, but I am already impressed. I have been communicating with Ch","useful":1,"cool":1},"rTxsMwoUvIUJ-HMp4y0fNw":{"text":"So delicious! I definitely recommend he avocado toast with whitefish, the lamb kebabs, & c","useful":1,"cool":1},"Rx5bZ7_4RPvPYAwabxUgnA":{"text":"Amazing place,  be sure and make reservation,  is James Beard Foundation restaurant and th","useful":1,"cool":0},"-XlhfTst2AzJtmCvpJ5Wkw":{"text":"After reading so many stellar reviews of the place, I decided to give it a shot yesterday ","useful":0,"cool":0},"dFtJ9Fxx5RHTltZl2tPShw":{"text":"Being largely unfamiliar with Mediterranean cuisine beyond the basic kabobs and hummus, my","useful":2,"cool":2},"jbS65V3WWCjuvB6TJtxirw":{"text":"The place is quite overrated. The pita is great but certainly not the best pita I've eaten","useful":1,"cool":0},"tb5X4MzKic6eEWJUV-a_gQ":{"text":"I was here Saturday afternoon, 2:15-3:30(ish). It was not what I hoped. Shaya is one of th","useful":2,"cool":1},"3zVYsY8N2Tmp2-Q0lZph0Q":{"text":"Amazing hummus. I could eat an entire meal of just the different hummus with warm fluffy p","useful":0,"cool":0},"FfWzewQ444zoHrCUNSIXHw":{"text":"Excited to try Shaya for lunch yesterday. Love the bright white, clean space! The food was","useful":2,"cool":2},"YAl6LuwCi_uSaObDgKrf_g":{"text":"Heard great things so we checked it out. We had a group of 4 and shared several small plat","useful":0,"cool":0},"OFnUmzUXFwcyWfkDUX759Q":{"text":"Shaya just keeps getting better and better. I have read that the original owners are not w","useful":1,"cool":0},"IZRoZ6-KXqFQFSqpa6Wvhg":{"text":"Great amazing food. Service needs improving. Very slow and needs training. Hostess ladies ","useful":0,"cool":0},"zLsej21FmLY465_Me3ungw":{"text":"This is the longest review I've ever written, but it's also (with the exception of a certa","useful":1,"cool":1},"zAIaAqcotTi28_lwDquA7Q":{"text":"Their pita bread is the greatest I've had. It's made fresh to order and served warm, perfe","useful":1,"cool":1},"ujLV-1dwMaTW5iYAuWZDDA":{"text":"Truly fabulous. Great atmosphere. Great food. Great service. Beautiful courtyard. We had l","useful":0,"cool":0},"MJw_88wDHcx0yHSaHh_GMg":{"text":"The bar was set high and didn't disappoint. Best bites I've had on this trip and we've eat","useful":0,"cool":0},"jReSBCRd2k0kMDSvJCRnyA":{"text":"Place: super cute and very clean looking, we sat outside and it was perfect!\n\nService: ver","useful":0,"cool":0},"HgzAnnNHMnTS8hocJHMdUw":{"text":"New Orleans is known for good food, but I was a little bit skeptical of an Israeli-inspire","useful":1,"cool":1},"aGC8VRb_ts-Lan_fHkRQcQ":{"text":"Don't fight over the falafel. You'll be tempted, but there's a better solution: order two.","useful":0,"cool":0},"-Yw3vw_Fj3RQrJh1GJoWzg":{"text":"From beginning to end a special meal. There are several housemate hummus that will complet","useful":1,"cool":1},"ut7c9vajbkwfk7Ttbl32hQ":{"text":"This place is almost perfect.  When you sit they bring you pita bread so soft you don't kn","useful":4,"cool":2},"sQpz1oF4tUW6gOBtMErmcA":{"text":"This place officially lives up to the hype. My fiancé and I had reservations on Friday whi","useful":0,"cool":0},"oUYXy63JHGpQfvztx169HA":{"text":"So close to perfection (bold flavors, cooked perfectly).... but every dish was way too sal","useful":0,"cool":0},"DallwA9jmVUvC0na523ewQ":{"text":"The baba ganoush here is to die for especially when it is accompanied with the fresh out o","useful":0,"cool":0},"twIU0UBdiCyv-pVA_xlbgQ":{"text":"I can understand why this place is highly rated. The food was incredible and they had the ","useful":2,"cool":1},"tGGgPqrtYhowBpE3O8wG1w":{"text":"We absolutely loved each and every course. A must stop and definitely will be returning so","useful":1,"cool":1},"u4D66-9lFccVygiiWmPClA":{"text":"Great restaurant, the decor was on point. Classy and modern, with a cool spaceship looking","useful":0,"cool":0},"zOt3XhUrW1YgQyPcbKavTQ":{"text":"5 stars are just not enough. Recently returned from a week in NOLA and I am still dreaming","useful":1,"cool":1},"Iz3l4r1lNGVFyXPBh5mR1Q":{"text":"Outstanding food and service.  All the customers are treated like royalty.  I was an hour ","useful":0,"cool":0},"qiPBAfr46oqho2Y66QjkvA":{"text":"More like 4.5 stars!!\n\nShaya's a beautiful Israeli restaurant located on Magazine st, over","useful":1,"cool":0},"TKI3W2k-7JN7hkqphv8l0w":{"text":"Came here on a whim as we saw an open reservation at a decent dinner hour I open table. Wi","useful":0,"cool":0},"Ryxyhg_i2yocXHrxWr7FtQ":{"text":"I got nothin but love for Shaya.  Everything I've ever had (and we've tasted our way throu","useful":1,"cool":0},"xLhdhey44_jbPEakwIXSJQ":{"text":"Shaya is a modern take on middle eastern food. The service was extremely knowledgeable and","useful":1,"cool":1},"NzYaKozNm8WsLx23x85vCg":{"text":"Excellent Israeli/Mediterrian restaurant... Everything is awesome but their custard desser","useful":2,"cool":1},"BWYaxHeSX_84Rmefra_FcQ":{"text":"Shaya at last! We came here for our anniversary and it truly lived up to the hype.  FLAVOR","useful":0,"cool":0},"BcJ6N4L6vaPWpIXtwX5lFg":{"text":"We had lunch here. We started with cocktails, (which were very good!). We then ordered sev","useful":1,"cool":1},"27oGIPPF_NOT0P2moH-IQA":{"text":"Amazing food. We ordered the mushroom hummus and falafel sandwich. Both were amazing, but ","useful":1,"cool":0},"VVPRG0pAh0o7Vo4ycBpu1w":{"text":"AMAZING FOOD! My fav restaurant in New Orleans, there I said it!","useful":1,"cool":0},"W9I2e7zBhL0PnW39PH9W4w":{"text":"If I could provide a negative number of stars I would. The rating is due to the horrible s","useful":2,"cool":0},"U2tP_nCCYKbT9HlkqGUQSg":{"text":"While this little place has the best pita, tabuleh, ikra (and many other things) in the wo","useful":0,"cool":0},"2mxkYcL_l2lruu7VI5GV2A":{"text":"Could not have been any happier with my experience. Went for lunch there yesterday with my","useful":1,"cool":1},"BrcBcR6KkcBf9K6YG-AFyQ":{"text":"One of the best meals I had in New Orleans.  I need to make my way back to New Orleans jus","useful":0,"cool":0},"LdWNaJL7hD1ZsB96HQYCDQ":{"text":"I can see now why they won the James Beard Award for 2016.  The food was amazing!  The tex","useful":2,"cool":2},"uvdyQbVP1EeP8gDS9lTnGA":{"text":"I'm gonna rain on the parade here. Shaya is a lovely restaurant, rated highly no matter wh","useful":1,"cool":1},"ejylInP0VRYfG7G0bce-1w":{"text":"Great food, every plate unique and inspired. Craft cocktails, good beer selection. Hard to","useful":0,"cool":0},"hdDFc8dbiAtVXEfJDtiKvA":{"text":"The food was perfectly executed and we had great service. Only reason for four stars is th","useful":2,"cool":0},"0c6elcnMHIqTm2zVqOTJUw":{"text":"As an Israeli I can definitely say that the experience was a little disappointing.\n\nHoweve","useful":1,"cool":0},"6fB2Kq6Qbq6uGEs4Zzht_w":{"text":"Absolutely incredible - do not miss Shaya whole in NOLA. Go for lunch, and the cauliflower","useful":0,"cool":0},"61I2KZ7MNYHHP0_IevZ7oA":{"text":"AMAZING food, If you like Israeli/Mediterranean food this is the best there is. Everything","useful":0,"cool":0},"hOLzihMveS4WTZl3dDmIFg":{"text":"This place is so cute! It's a perfect place to go with your girlfriends for lunch/early di","useful":1,"cool":0},"nsxHEd_I2L5CY_bSAfgDDQ":{"text":"Really good food and excellent service from the staff! Pita bread is fresh from the stone ","useful":0,"cool":0},"jlSKTgtyWvivu2lNIT0Ngw":{"text":"Everything my wife and I had tonight was somewhere between wonderful and sublime.  \nI'll d","useful":1,"cool":1},"gCuUgUNFtRDp2j9XVrA2fw":{"text":"Favorite restaurant in New Orleans - delicious, inventive food, beautiful scenery, great p","useful":0,"cool":0},"7YK4Y0ybULr8R8vU3L7U6Q":{"text":"Wow, so good. We were lucky to get a table. The threat of rain kept their patio from filli","useful":0,"cool":0},"RPC_jJSbh9FuRUqvf5HgQA":{"text":"After I posted the previous review of my experiences at Shaya, I was contacted by the rest","useful":0,"cool":1},"siV658ApPyi58u-0xOH2yw":{"text":"Just had a huge lunch here. The food and service was top notch. Everything we had taste bo","useful":0,"cool":0},"rwbGKP7UnwsplIE1IcLfaA":{"text":"I am torn on how to rate Shaya. On one hand, it gave me my favorite dish in New Orleans - ","useful":0,"cool":0},"HA7if9Pu60UFJinlYCBvpA":{"text":"I came today to Shaya after being walking magazine Street over 3 hours. Certainly, this wa","useful":0,"cool":0},"8NiTdAWAU6FAdG4ZhRMorQ":{"text":"Small menu - I had the falafel sandwich which comes with fries. The fries were hot and dou","useful":1,"cool":0},"gfBASIXc4O23oWtmfKguXA":{"text":"Very hip and modern restaurant. The food was impeccable. My friend and I ordered a little ","useful":0,"cool":0},"8AtQXqutYkzEUGTyhfNu0g":{"text":"Went there with family in April, 2016. The food is delicious. The pitas are hot straight f","useful":1,"cool":1},"gRs-rX9-UB1mt6wKuaAg1Q":{"text":"Delicious food (try their hummus, asparagus or lamb kabab), very good drinks and a fantast","useful":1,"cool":1},"cXf7e5qC-GfyRLE7WrvIPQ":{"text":"DELICIOUS ARTISTIC FOOD - ATTENTIVE SERVICE - LOVELY DINING ROOM. We stopped here because ","useful":0,"cool":0},"2gjaqmJX1Y8U4U2nyYvwPA":{"text":"I'm originally from israel, \nI travel all over the USA and this if I could have left 10 st","useful":2,"cool":2},"AF6Ixw8UEwdnGDX8b_j9pw":{"text":"Went in with a friend today for an awesome Passover lunch. Except when I got there I found","useful":0,"cool":0},"sj2fOhpClYbbJAJ_5Pal2Q":{"text":"I really enjoyed eating at this beautiful Mediterranean restaurant. There is a lot of \"hyp","useful":0,"cool":0},"SUzO7JeFC8JKCaqtGG-g3g":{"text":"The lamb entree was great and the pitas were amazing.  I went in with very high expectatio","useful":0,"cool":0},"3Zi-x50O9GXupQTW-UzhkQ":{"text":"Everything was perfectly prepared. I never knew hummus could be that delicious. Make reser","useful":0,"cool":0},"4gd6a9JcudLKE2QNuKS_og":{"text":"We heard all about Shaya in food magazines and on tv. Since we were visiting New Orleans a","useful":2,"cool":1},"kxMnEWrf76A8lR4-WMbdzw":{"text":"One of the best restaurants we've ever been to. From the friendly, talented, and very know","useful":1,"cool":1},"jgBZKjGpQzkVYIANoLIpKw":{"text":"My 17 year old daughter stumbled upon this place on a recent school visits and brought the","useful":1,"cool":1},"D3OduQ7ikYYic6807Eiu9g":{"text":"I cannot think of a single negative. A beautiful room. A cheerful, attentive staff. A char","useful":1,"cool":1},"9rX77LzbjQaS59CQ1DXlvw":{"text":"Delicious, fresh and flavorful dishes! Very friendly staff and the restaurant itself is ve","useful":0,"cool":0},"Rob9Y7x_WadoKi56VYwCHQ":{"text":"One of the best meals we've ever had! The best way to eat here is to go with a group and o","useful":5,"cool":4},"YnrdGXxsTWjkIep-yPvk3w":{"text":"Very nice ambience, great food & service. Everything was top notch. Especially there bread","useful":0,"cool":0},"HWbgXTlCx9M0e_jRhgkgQA":{"text":"Shaya was absolutely phenomenal. The maitake hummus melts in your mouth and has SO much fl","useful":1,"cool":1},"VF8IfnlHdP-JoGlIlFjMJA":{"text":"I could eat all the hummus dishes and homemade pita as a meal...every dish was of superior","useful":0,"cool":0},"F8MHvepDIxkjm69YNQchMQ":{"text":"Very tasty food! We tried a variety of things and loved them all. It can be hard to be sea","useful":1,"cool":1},"Efn-9yJPhvJbBIaR5c780Q":{"text":"Shaya more than lived up to all the hype.   Every dish was perfectly constructed.  Even be","useful":2,"cool":1},"g4Rc4VPyO2YNEZfoPAyrgg":{"text":"We really like this place. Their servers are very knowledgeable and nice. All the appetize","useful":0,"cool":0},"Y14gXnYiTeP1BVprvVBthQ":{"text":"Heard about this on the Conde Nast podcast and made reservations based on that alone.  It ","useful":0,"cool":0},"grVmv4nnObYMh_qsV2B9Ww":{"text":"I'm docking a star for service, which was the weak link.  We had a late lunch (2:30) befor","useful":0,"cool":1},"8DEHs-yKEr3Lmb_7PQXrTw":{"text":"The flavors are unbelievable, you really feel like you could find the same food at an expe","useful":1,"cool":0},"upIdiim1ADFxBJoMYhNcew":{"text":"Loved the gorgeous setting inside with warm lighting and modern feel, although we ate out ","useful":1,"cool":0},"olAE51K1TzqZJrRA7TC_tQ":{"text":"It's like ordering an S&M service. Every hummus is great. And once you filled up with humm","useful":0,"cool":0},"3mmigMn5WHuATsOZDRYb1g":{"text":"Everything here was phenomenal. I ordered the fish and it was divine. Cooked perfectly wit","useful":1,"cool":1},"rFIMPfyQcOfHHi8Ugta6Kw":{"text":"Went here with my wife and this place was amazing beginning to end. Most menu items served","useful":1,"cool":1},"HLvNJiJPpPIb_nsXWlkNyA":{"text":"By far the best Israeli/Mediterranean food I've ever had. I eat this type of food a lot an","useful":2,"cool":2},"9VkWgLN4UpJFm-5SOMrY7g":{"text":"Good food but TERRIBLE customer service.  I have visited this restaurant a few times now a","useful":0,"cool":0},"h2SaIWR_qS4XlY6zuOnRGw":{"text":"Wonderful food and service with a great vibe!!! We had the ' for the table' small plates w","useful":1,"cool":1},"f-RoN7sCNCNAbLGnMR0ZpQ":{"text":"We celebrated daughter's birthday at another John Besh influenced restaurant - Shaya - in ","useful":2,"cool":3},"9CRAPEdkHbk-cabthr8Nqw":{"text":"You will never eat hummus like this again.   Creamy, earthy, and with the most beautiful, ","useful":0,"cool":0},"3u2UF9VTitfxrArALDZIJg":{"text":"Good food, but underwhelming experience. Made the reservation weeks in advance. The waitre","useful":0,"cool":0},"1vKMpXREBNVLRo6H9pvn_Q":{"text":"I had to make reservations 6 weeks out, which is fine but my expectations were high after ","useful":0,"cool":0},"PTZyjR-iEPL5Jj49Y6oSeg":{"text":"It totally lives up to the hype. Expertly crafted dishes. We tried a bunch for the table a","useful":2,"cool":1},"v2ImwUfjgBR47P_p7Zf0Gg":{"text":"The food was very delicious, especially the pita, lamb kabob and Brussel sprouts. We sat o","useful":0,"cool":0},"Fd6xpTuoj0qfVa03Wmqg5Q":{"text":"Great service and friendly staff. The ambiance is perfect for a date yet still good enough","useful":1,"cool":1},"tAOUPYmIyLftUwZ0LEtEyQ":{"text":"This restaurant was on point in so many ways.  Everything we ordered was fantastic and the","useful":3,"cool":2},"a_3GqeKE7igDNezPIj38Fw":{"text":"Pros: Bread they serve at the table is amazing and fresh out of the oven.\n\nCons: Almost ev","useful":1,"cool":0},"SxqWyRe9J8BG1kwMZpmzJA":{"text":"Oh my goodness!  First time here and we didn't know what to expect really. Such a wonderfu","useful":1,"cool":0},"PMeHq4Xse8swsSFeGXwpCA":{"text":"Bravo!! \nKudos to Alon and his staff for bringing something new -  a breath of fresh air -","useful":1,"cool":1},"IYipQYcFKpdhSGQs1qgHdw":{"text":"Love this place. Really similar to a place called DishDash in NorCal that we went to. We o","useful":3,"cool":2},"tnGNU9phXiY7J5Yu3U0mYQ":{"text":"The best Mediterranean food I've ever had hands down. We took a late reservation (10:45) b","useful":1,"cool":1},"ngATc73R-zD3cGrfJdfGqQ":{"text":"Such a fantastic meal! I had heard rave reviews about the hummus and pita, yet I was still","useful":0,"cool":0},"gZla5Ecgw_XKfZaG4pmkGw":{"text":"This seems to be the new place in town that everyone is talking about. Maybe it was becaus","useful":1,"cool":1},"AEqKQB8xgDDPPtcvwkTvIw":{"text":"Incredible meal. Everything was perfectly seasoned. Highlight was the slow roasted lamb, w","useful":0,"cool":0},"TOzr_A0SKxcHQImaUY1qqw":{"text":"Shaya!! Best lunch ever! My mom and I ordered some things and split it all. The hummus alo","useful":3,"cool":2},"nKkac1_oNvzs7hJYWhTMdg":{"text":"Delicious food, good atmosphere, and solid service. We took a large group and sampled almo","useful":0,"cool":0},"w5lEBbOk5zV_AWsDrIospA":{"text":"4.25/5 great group dining\n\njust came fresh from a casual lunch here, and we all agreed tha","useful":5,"cool":3},"9oOkpg0ft_PvoHdDgCfNXw":{"text":"First time here and everything was amazing. Had the best server Sam, all his recommendatio","useful":0,"cool":0},"aEZRuQPgQWVXIiOsNIpMOg":{"text":"O.M.G!\n\nI'm not sure where to begin. I guess I could start by saying I was lucky enough to","useful":1,"cool":1},"RGmHuavibsm2Vga6MegAMQ":{"text":"This was an excellent.  I started writing a long review documenting how wonderful everythi","useful":0,"cool":0},"eKn0PF1pvTyI0yceKD39gA":{"text":"Good food; bad staff.\n\nI tried to go here last week.  I called and asked for a party of tw","useful":0,"cool":0},"pC87P2T07F21IWWWeZGr5Q":{"text":"While searching for vegetarian food options in Nola, I came across this. I wanted to make ","useful":0,"cool":0},"TcTZnFyWymi0CerpxdV7nQ":{"text":"Outstanding!!!\nBest meal ever! I cannot overstate how outstanding the food and service was","useful":1,"cool":0},"vmALiaYvk0tX86qK66mKFA":{"text":"It gets 4 stars from me because my close friend told me they raised their prices just a co","useful":0,"cool":0},"YUmatZ2PVs5s6LKGZ6UOcQ":{"text":"We came to Shaya for a Christmas dinner. There were 7 of us and Shaya is a perfect place t","useful":0,"cool":0},"BbAGwR29TfZcYvxNQXI8qw":{"text":"The hottest ticket in NOLA! Hands down the best place I visited during my weekend. Really ","useful":0,"cool":0},"nwO6vBfx6t6TxnC4T5GKpQ":{"text":"My boyfriend came here upon a recommendation from a local. It is apparently a new restaura","useful":0,"cool":0},"JxwKn9t-r1Te6bapBQQY-w":{"text":"\"You're Biased\" is what my friends said when I told them I have been dying to try Shaya on","useful":1,"cool":0},"Z1QpwxKqi0imX6ijwGPLZQ":{"text":"I was so saddned to here about the split of head chef Shaya from this restaraunt (his name","useful":0,"cool":0},"sNzPlQLpw-lnn9Lr90fl7w":{"text":"Outstanding - one of the greatest restaurants we have ever been to, and we dine out freque","useful":1,"cool":0},"14mcXVw3dOA-TfKVey3OoQ":{"text":"Pretty good! I recommend sticking with the small plates hummus and sides. The main dishes ","useful":3,"cool":2},"X6NdL7fsqfzC3W2BJLPU1Q":{"text":"Shaya does not disappoint, I was worried that as wonderful as Domenica restaurant consiste","useful":0,"cool":0},"YWomsjvH5e289KQdqZI5Qw":{"text":"After hearing so many raving reviews of Shaya for weeks, I finally was able to make it for","useful":9,"cool":7},"CW0pQW0A4TYPOk59klXHbQ":{"text":"I rarely give bad reviews, But the food was very bad\nI was waiting to eat there, I'm for i","useful":1,"cool":0},"IaWSBplsV4hywoBVKhc_PQ":{"text":"Best food I've had in New Orleans. Simple yet so delicious and really fun! The staff are v","useful":0,"cool":0},"mWJsC2wvaJ063sXDR-VJyQ":{"text":"I really appreciated the unending supply of hot, freshly baked pita. My friend and I order","useful":1,"cool":0},"gCgMmfa1qNMYwI7INBxn0Q":{"text":"We came in on a rainy Saturday for an early lunch. Service was a bit distant but efficient","useful":1,"cool":0},"gjczEHKwmyixFFYJAm_fuw":{"text":"Amazing! One of the best restaurants I have ever been to. A must for anyone visiting New O","useful":0,"cool":0},"23VSHJ98_Cwx-XpXkORERQ":{"text":"Took a group of doubters (\"Israeli food?! What? In New Orleans?!\") after Christmas and the","useful":1,"cool":1},"MkRPe-x2TNseTuwspm-5LA":{"text":"Server recommended dishes for us and it was delicious! Roasted chicken is to die for and d","useful":0,"cool":0},"0NRLPBXa_QL_uGR1thqexw":{"text":"So so sooooo good\nI cannot say a specific order was good cuz all what we ordered we super ","useful":2,"cool":1},"ZqZmS9QXTpgzOMJAAvcy1A":{"text":"4.5 stars Great overall dining experience. Server Sarah was very good. Nice cocktail beer ","useful":1,"cool":0},"wfk6o4MmPiQGEaeOSeFpYA":{"text":"I've been to New Orleans three times now and finally have been able to make it to Shaya fo","useful":2,"cool":1},"PWEkfC7YQXntfmozeMREew":{"text":"This place is amazing. It is probably the best lunch I've ever had. The cocktail selection","useful":1,"cool":1},"FDgSCW32BgGtaU8uthQEgA":{"text":"i came to NOLA last year for the first time and 2 waiters at Luke had recommended Shaya to","useful":2,"cool":1},"Cl7HUZz3krG5o0vfNROSBg":{"text":"Absolutely divine!  We had a surprise party scheduled. It started in the courtyard, starte","useful":0,"cool":0},"XgNf1GDz3kbYHKB_wT218A":{"text":"Hipster Middle Eastern food. Who knew there was such a thing? \nVisiting from Detroit, we h","useful":1,"cool":1},"nCPNLWs_KJxO-0Ny8ho9Dw":{"text":"Why would this get anything less than five stars? It's voted the best restauant in the cou","useful":1,"cool":1},"ACOYCZ14YvjQiobakMhx_A":{"text":"Nicest people and pretty space. The cocktails and wine are lovely. The small plates are cr","useful":2,"cool":0},"VSC5W63ef7mNQ8O8OQvOWQ":{"text":"Amazing food as expected from the reviews, fries were different had a nice flavor, dips we","useful":1,"cool":0},"g3iisH-t-lu6pLuxMX1qKQ":{"text":"Chanterelle..!! Chanterelle..!! Chanterelle!! Do not miss this dish. The Pitas are freshly","useful":0,"cool":0},"DlxyN5S9GkDstZ2x-b8bpQ":{"text":"Yum! Yum! Yum! We went for lunch and loved it. Pita bread....couldn't stop eating it. The ","useful":0,"cool":0},"E-WdwWMNnC6mnZP3S2aHZQ":{"text":"I sincerely hope we dined on an off day, because the food was bland and the service was wo","useful":1,"cool":0},"tAn9BIaSGai17qNvb7Ed2w":{"text":"Absolutely amazing food!!! A friend recommended this to us, and boy were we pleasantly sur","useful":0,"cool":0},"QTrkVX6pOZRiYWgdoA8y2Q":{"text":"My boyfriend and I ate at Shaya for our fifth anniversary--and it was an AMAZING experienc","useful":0,"cool":0},"JUFgijKmtI-tSWIRfBosOw":{"text":"Life-changing pita bread! Must get the short rib hummus!!!","useful":0,"cool":0},"K7TzTsxQLtGJ35Fci5V9CA":{"text":"I have had NOTHING here that hasn't made me want to lick my plate clean. Soft, hot, pillow","useful":3,"cool":1},"H7PVwfnSxAANvC6zUTvGkQ":{"text":"Food is absolutely delicious. But they need to fix their termite issue outside or close th","useful":0,"cool":0},"IKLbTYs8KP7Ecq-zex-okw":{"text":"By far the best israeli food I've had outside of Israel!! These folks. Hat they're doing. ","useful":1,"cool":0},"tZ8JfOXaVnaYd4TWNTgLLQ":{"text":"This place is beyond great! If you live a paleo, vegetarian or whole lifestyle - it is a p","useful":0,"cool":0},"HF55oIQVxo_YLezyINMvNQ":{"text":"Had an amazing lunch today was so much fun to try 6 different small plates and experience ","useful":0,"cool":0},"VYIbAJ9Ayt_E_78npwDRYw":{"text":"In the middle of a trendy neighborhood\nJust south of the Garden District\nSits Shaya, unass","useful":5,"cool":8},"Tb7f1Ux7Zu_Lng9xOqWYBw":{"text":"Excited to try this place after seeing the amazing reviews. Tip: they have a side parking ","useful":0,"cool":0},"7lCYYz_GdM1GuolV_57k0g":{"text":"Great.  Strolled in.  Had wonderful service and delicious food with fresh warm bread potas","useful":2,"cool":0},"6FO-DG0-z9IdJdMGEWzKMw":{"text":"Come on!!! The food was not good at all! Have you ever eaten hummus in Israel? I have eate","useful":2,"cool":2},"BjGnWbj4BpHfJ4wD890CSQ":{"text":"Good food\nGood drinks\nTotally good vibe.. we were looking for something light to eat and e","useful":0,"cool":0},"TIGgZ_K5SroZ_o66GFmkzA":{"text":"This was the last restaurant my wife and I went to while in New Orleans. And what a way to","useful":0,"cool":0},"HAV9nYeULr8VOnFxTAAKwQ":{"text":"Don't know why this restaurant gets such a great rating. It is does have an awesome interi","useful":0,"cool":0},"fbB7MkLjwbSf6C4EYUBrcQ":{"text":"The last place I expected to have Israeli food was NOLA but a colleague had just read that","useful":1,"cool":1},"azUvTEXVgKHKMP-lcfmpbw":{"text":"Great hummus- asparagus\n\n\nGreat schnitzel \n\n\nGood water\nExcellent Cabbage salad\n\nGet the M","useful":0,"cool":0},"Sl9nrb3j1QTa8MljizoINQ":{"text":"My wife and ate at Shaya were able to get a reservation for lunch.  There is parking on th","useful":1,"cool":0},"EXwkQ1JOCSrJRUyeY40xmw":{"text":"A nice side step from the norm around here. This place has it all; great drinks, amazing f","useful":1,"cool":1},"-zuUnGyq5lL_Tn0mvq9JrA":{"text":"Heard rave reviews from everyone before coming to NOLA.  I would say that we really liked ","useful":2,"cool":1},"s5BPBkjzmmi8iYC6crhDAQ":{"text":"This was hands down the best dining experience we had in NOLA, which says a lot. We loved ","useful":2,"cool":1},"ZcdXO7cSieg9vzNeSE5JoA":{"text":"Went for a work lunch, and we were able to get in without much of a wait.  The Lamb Ragú H","useful":0,"cool":0},"pMn6x-i_XUGS_8yCwbqnhw":{"text":"This place was crazy good. Their hummus is the best I've ever had. I enjoyed the Fois Gras","useful":0,"cool":0},"wBCxpUt0HN_KePXPlbSSxQ":{"text":"Stumbled upon this during Marti Gras and well traveled from Ca to visit this place again!!","useful":0,"cool":0},"QNFF0C1R3Ohe7HJwaMGvPA":{"text":"I could spend a lot of time reviewing Shaya, but it would just tell you what you already k","useful":1,"cool":0},"QiMwVUG3Ln6pRweb77RwQw":{"text":"Shaya. Where to start? The menu is laid out for sharing. You will have a selection of dips","useful":2,"cool":1},"wvVqrOf6FAK_gkKockFrPQ":{"text":"They have created a nice intimate space here that produces a good environment for couples ","useful":10,"cool":4},"1cm-GYA2m86OibOoks_Hxg":{"text":"Perfect date spot! I came here with a Bumble date the other night and fell in love (with t","useful":0,"cool":0},"x0aE189LwEc9LKj5oIVjPw":{"text":"Maybe we went on an off night. \n\nOur meal for 2 $250. (we went to Lukë's a couple nights a","useful":1,"cool":1},"N8WSaa0lo4zuCMpH2ExKpw":{"text":"This place is a must do when visiting New Orleans! Freshly baked pita in their pita oven, ","useful":0,"cool":0},"3uvXAZ-4Ru_tnDcWGT_K5w":{"text":"I came to Shaya around 1:30 on a Tuesday and it was lively but not overwhelmingly so. The ","useful":1,"cool":0},"2IZ5_c68eGJTyX5TxNGZLQ":{"text":"Shaya should have a 5-star review, but instead, because of the lackluster service, they ge","useful":0,"cool":0},"IQHVH4fBAouVePkTu2ffkQ":{"text":"Lovely place, although a bit loud and dimly lit. Excellent food and service. Would definit","useful":0,"cool":0},"msTCa0RQi4Z5QXZ2iLj3tw":{"text":"This place is billed as the hottest ticket in town and it really DID NOT disappoint! There","useful":2,"cool":1},"pwC5B0GyIcHHAeuj3CuEVA":{"text":"Great new place, with surprisingly upscale decor yet an overall friendly feeling.  They've","useful":2,"cool":1},"BQ6bisqYpSEwEa6ubpzPXg":{"text":"Not sure I can add more praises to what's already been said.  The food is incredible... un","useful":0,"cool":0},"v5LRJLSuguxswTn7nsOMqg":{"text":"Still love coming to Shaya for great food.  This past trip to New Orleans, my now husband ","useful":1,"cool":0},"r0LvROwRbS1nDpAcNxCifA":{"text":"If you're visiting New Orleans only for a brief time, save Shaya for your last meal before","useful":2,"cool":2},"va_KgsKInQXQU-Hn3ItaXw":{"text":"This was by far one of the best meals I've had, the service was amazing and the food incre","useful":1,"cool":0},"zpyS_A6wi35cyvfOZZD4OA":{"text":"Small portions, but dope. The back garden is quaint. The Pitas were like pillows of joy an","useful":0,"cool":0},"-eSbwBlGSdCVcJHnJKch-A":{"text":"Went here for lunch on Sunday. Luckily we got walk-in but recommend to make a reservation.","useful":1,"cool":0},"hbeYD2iBX5e498Ydl_zgLg":{"text":"Boy this was an amazing restaurant! I didn't expect Israel food to be this good in NOLA. I","useful":0,"cool":0},"_uUgxILOp06myK1vdXTb1w":{"text":"Magical restaurant with delicious middle eastern food. Shaya would be at the top of my lis","useful":4,"cool":3},"6zSUqedQcCeMWEe2LhmkPQ":{"text":"The Moroccan tea is delicious. What stands out is the lemon, lemon simple sugar, and mint ","useful":2,"cool":2},"mp66gyA1zkf5f74mnPIXtQ":{"text":"Rip off alert!\nI'll be frank, it wasn't that the food wasn't good, it was very good, but a","useful":1,"cool":0},"gHGHZqpk4kTm4YIpb12ETg":{"text":"I saw this restaurant on the Netflix show feed Phil and it looked amazing. Well, it is!!! ","useful":0,"cool":0},"fC2G6qpfKNgIkRUL0u8ohQ":{"text":"I probably would've given them 5 stars just for the fresh pita bread they serve while when","useful":0,"cool":0},"Se2IYd6U_on-16l1Yxf9zg":{"text":"My friends and I tried Shaya, and found it to be the best Mediterranean food we've ever ha","useful":4,"cool":1},"4UuAGcHSYUJP6Z6XYDIPjA":{"text":"Finally trying this place out! I definitely recommend the cauliflower hummus and their lam","useful":1,"cool":0},"tRWR5JxI_4Yn0hZ-koe-Uw":{"text":"It was a great place. Service was outstanding. The Moroccan Mint tea did remind me of my t","useful":0,"cool":0},"8w-yuXANXT87qcUASDoaaQ":{"text":"I spent a little less than twenty-four hours hours here, so what few places I frequented I","useful":1,"cool":1},"C-P2gJBTtYJdCleRpiGZBw":{"text":"Great Food it is hard to get in there but once your in it is great.\nWe went for lunch with","useful":1,"cool":0},"S5QHxBlwCMbtIYASZ2PuPw":{"text":"This restaurant came to us via \"Somebody Feed Phil\" on Netflix. We were VERY fortunate to ","useful":0,"cool":0},"CB_KJ9ztqedhy4Bwu9limg":{"text":"Food was decent but seemed as if they are riding the curtails of whoever the opening chef ","useful":0,"cool":0},"N_fytC6SUM4mmCbchH6P_Q":{"text":"I got here a lot. I'm a local. This is the best Israeli spot in the city. The owner and st","useful":0,"cool":0},"3QKkz6LLfiO7bZPhS-jLeg":{"text":"Amazing place! Must try the cauliflower hummus! We also got an anniversary card when as we","useful":0,"cool":0},"QCLsrm8Mq5WMzKiI9lKtPA":{"text":"Holy moly. This is literally the best Israeli/Mediterranean place I've ever eaten. And the","useful":2,"cool":1},"24TMS12B8HN4xwHh0gnqEg":{"text":"make reservations. ate at bar...great food and experience at bar. pic shows oven baking th","useful":0,"cool":0},"8dwEJIvvdKsHG6o3FhDLhw":{"text":"My favorite new restaurant!  Had the lamb humus, and could not be more impressed.  The mil","useful":1,"cool":1},"7vqTMGgyPkWrLAQUsclQdw":{"text":"I'm still dreaming of the soft fluffy pita I had at Shaya. I've never had anything like th","useful":1,"cool":1},"W_LnOUugW1TA9uCs5ZnJCg":{"text":"Worth every star! All the hype is true. Incredibly flavorful creative contemporary Israeli","useful":1,"cool":1},"rQV1NDt8hkRTYETOxZxmoA":{"text":"Finally found Kibbah Nayeh in NOLA. Everything is prepared when ordering. The pita bread f","useful":0,"cool":0},"nvkZ4cyH7tv4SdpW3wjC6w":{"text":"The best hummus I've ever put in my mouth. \n\nShowed up without reservations and was able t","useful":0,"cool":0},"bZ1GA58HzcfGL90OKpnAQA":{"text":"This place is truly amazing. I liked an atmosphere, food was amazing, really authentic too","useful":0,"cool":0},"gq1aUsbtDt0Zg2o5n2JT0g":{"text":"Delicious everything I ordered was amazingggggg had the limb humus. The appetizers where f","useful":0,"cool":0},"2NkJKhpYafevloZgJcMgxA":{"text":"Highly suggested by locals and was super impressed by the service and ambience. Staff is r","useful":1,"cool":0},"KYEAD4Nvge1ikgXqiU5nAg":{"text":"Definitely some delicious, authentic Mediterranean food here. It's great for groups becaus","useful":0,"cool":0},"FUH4AtF2IXpUHgpjrHuxgQ":{"text":"Have been here twice (in one week, no less) and both times was blown away by the food. I'm","useful":4,"cool":1},"_4lm4a5-Ry2JTYVIxKpb_A":{"text":"All the food at Shaya is for lack of a better word (and probably the most perfect word for","useful":1,"cool":1},"SKijIM-W19HsoMwYjhv4Ag":{"text":"I was disappointed. Mainly because the best food we had in New Orleans wasn't Creole cooki","useful":1,"cool":1},"GMrlVxPvcCypVtwUEnH4ZQ":{"text":"Best humus ever; rich, creamy, nutty, and topped with lamb ragu and roasted pine nuts! Bes","useful":1,"cool":1},"vTjWY2q55QV7M7bwfKBe_g":{"text":"Unbeliably good. The bread is to die for.. the Cali flour and/or fried chicken hummus is s","useful":0,"cool":0},"BbumDEyXgwR9ICp0Gqg7cw":{"text":"Came here for lunch on  Sunday after all the hype. The experience did not rock my taste bu","useful":0,"cool":0},"tJmbXk6_3GMd-7uBnBOphw":{"text":"I went here with some friends from Los Angeles, and we absolutely fell in love. Shaya offe","useful":0,"cool":0},"KtSTjAVrWVjJsyP25joBgA":{"text":"I was visiting New Orleans for the Sugar Bowl and on my last day, my friend (who lives in ","useful":1,"cool":1},"6_QRb-lwhFtDl3jLwy2zEQ":{"text":"This is a must when in NO.  Broccoli appetizer and lamb are amazing, love the Israeli and ","useful":0,"cool":0},"e9_WTLvUovDTDBYddpba_g":{"text":"Shaya is hands down the best restaurant I've ever been to. And my second time around prove","useful":5,"cool":3},"aOhZwOK81L4e7uWOZyDkFg":{"text":"Came here for dinner on Christmas day as this was one of the few places open in town. And ","useful":0,"cool":0},"zBSO-ciVVPEBST8bK6mHHw":{"text":"For those familiar with Oren's hummus shop in California the pita at shaya will disappoint","useful":0,"cool":0},"cohB_g215QoUfCfTCFoIbw":{"text":"Well done twist on classic dishes. Not your grandmother's cooking. Unique and interesting ","useful":1,"cool":2},"DMOxaipz3heJyQ-l44Sgvg":{"text":"Had lunch here and loved the hot pita and cauliflower hummus--better than any we've had. M","useful":0,"cool":0},"JeZPgTcD61T43yk9TgH6bg":{"text":"So so good. I never would have thought to seek out Israeli food in Nola, but got a hot tip","useful":3,"cool":2},"8iZ1ViLbT2O4VE2LyhyApw":{"text":"Having been to Shaya now, I am actually surprised we got a table for dinner without a rese","useful":3,"cool":2},"GF2Mt-NsxpDI0N5coJXGxA":{"text":"ABSOLUTELY AMAZING! I've never been one to frequent middle eastern spots, but I had to see","useful":0,"cool":0},"_FP6dZic_Li8q5BhCnepnA":{"text":"I had high expectations for this place and really wanted to love it. But I found the food ","useful":1,"cool":1},"4Z8_GKT1qqoaxGczuB7jSw":{"text":"This place was awesome from start to finish. The share plates were great as well as the ch","useful":1,"cool":0},"ingipjZk0P_eK8MMOUkD_Q":{"text":"Even though it's tapas you will get filled up and leave happy! The outdoor seating ambienc","useful":0,"cool":0},"b6Jm7YnjL6cDvUtMM9d4Ag":{"text":"Honestly one of the best places for Mediterranean food ever. Went here after being recomme","useful":0,"cool":0},"-7MNT648rSf4JX_a-mbxbQ":{"text":"Crazy great!\nAfter eating my way thru NOLA over the past four days, I was told by locals t","useful":0,"cool":0},"uspgt-BOniN_NmMeo2RZ5A":{"text":"One of our favorite meals on our first trip to NOLA. Everything was phenomenal. Best to co","useful":0,"cool":0},"YRLd7rCdvCad55HQ7iinRA":{"text":"I'm not really a fan of Mediterranean cuisine, but I'm definitely a fan of Shaya.  Althoug","useful":0,"cool":0},"k3SJZtAWxV30H2L3mBx2tw":{"text":"I've been a couple of time to Shaya and it never disappoints! Here you'll find the best pi","useful":1,"cool":0},"5V_ZPB2dts4LDxRdm5mYng":{"text":"Pros:\n-Israeli Salad\n-Good cocktail with rose and strawberry\n-Abundant cactus collection b","useful":6,"cool":1},"fMVMHdxNYZqX5nXEXdrOww":{"text":"Mezze. \n\nSmall plates.\n\nI broke my own rule and showed up hungry. \n\nThe din is deafening a","useful":4,"cool":4},"r9-SdjqUzYW2dTAByM5IGw":{"text":"Well, we came here yesterday for a friends birthday lunch.  It was so hot in there.  I ask","useful":2,"cool":3},"wj2GJR2NFYerUpuGVxQO3w":{"text":"Really enjoyed our visit here. The whole menu revolves around pita breads which are being ","useful":0,"cool":0},"nBf9glZxfOkIiqusJiQP2w":{"text":"Visiting to NOLA for a few days and this place was recommended by several different sites.","useful":0,"cool":0},"b5JjEGNQRmlKru6wmzxVLw":{"text":"I've been meaning to try this for a while. Went with the bf the day I returned from Mexico","useful":1,"cool":0},"gNg9n_FO59b_6MXG8MbRdQ":{"text":"I have been wanting to try this place ever since it opened. I crossed my fingers and went ","useful":2,"cool":4},"YbxamfD46ErNPq1L2WyEFg":{"text":"Outstanding Israeli place.  From the fresh interior, attentive service, unique dishes and ","useful":2,"cool":2},"Mrtt69K9hwuF6Ta3-zZvgg":{"text":"One of the best Mediterranean places I have been to. The food is so fresh and tasty. Every","useful":0,"cool":0},"QKf9Wmv6XEqfqOWHl-YSsQ":{"text":"I placed a large order for pickup. The food was ready on time but several containers conta","useful":0,"cool":0},"HKikbs9X-ycaqIeW1AM_HQ":{"text":"Cannot recommend this restaurant highly enough. It checks all the boxes- amazing food, ser","useful":1,"cool":1},"JKh0J97Pll-rsbiwl7n21w":{"text":"Wow. Amazing food and incredible service. The lamb ragù hummus was divine. Baba ganoush so","useful":0,"cool":0},"k4h_kQIyNgJfNGhUV_MVsw":{"text":"Worth the hype. \n\nAfter we saw the accolades that had been poured on Shaya, we tried to ge","useful":5,"cool":2},"HRGdsY8xYEPbBYDieCBabQ":{"text":"I've wanted to go here since I learned of its opening. I got a little taste tonight and I ","useful":4,"cool":1},"6xVYyFM40GBPsolpS3LlNw":{"text":"If you can, go with several friends so you can try EVERYTHING!  Love their hummus selectio","useful":1,"cool":0},"ZHWqJZlI_rTNGjOxp0_Zuw":{"text":"This place is incredible and a must-eat-location if you find yourself getting sick of the ","useful":1,"cool":1},"n9jc7umqpz7tB4lYPY9ZJA":{"text":"After over a year of wanting (and trying) to get reservations at Shaya, we finally decided","useful":2,"cool":1},"k_FQ-FpppEuIFkFDS7Mifg":{"text":"This was a delicious restaurant! Im here visiting with family and we had reservations week","useful":0,"cool":0},"KC3Av2W8HV4X_IrHDmaORQ":{"text":"Hummus was great.\nFalafels were the best I've ever had and the cabbage served with them wa","useful":0,"cool":0},"QrMofoJw0ulAY0nW11yySQ":{"text":"More like a 4.5. Went here for brunch and we enjoyed our preshopping brunch on magazine st","useful":0,"cool":0},"I_M4OJQK7FnAzPZWAttcFw":{"text":"Just Amazing! I understand why it was rated the best new restaurant by Esquire. The Lamb R","useful":1,"cool":1},"mInfta74byetKoqkQTn7IQ":{"text":"Great food, especially the hummus with lamb ragu.  The atmosphere was casual and good, ser","useful":0,"cool":0},"3vCR7aSwYIm60Jii3iv1YQ":{"text":"I have been dying to try this place and finally did. I wanted to leave 3 stars but decided","useful":0,"cool":0},"FwdmvvWAnUHHBS9fS7vWcg":{"text":"环境很好，服务很热情。\n但是很不符合中国人的口味，点的几道菜都不太喜欢，太腻了。\n如果是中国朋友推荐换别家尝试吧\nWwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww","useful":0,"cool":0},"-mx0Noz8gq8_4NNZg8Zf8Q":{"text":"Very nice restaurant. Excellent service with a relaxed atmosphere. Food was of high qualit","useful":0,"cool":0},"4cnNfEriw_W4JOQ-GQGM1Q":{"text":"\"Israeli\" might be a turn off to some who think Mediterranean is not their style. However,","useful":0,"cool":0},"t5gM4S8ArwLWQ1an2w2CKA":{"text":"We weren't too hungry when we dined at Shaya's, but were able to put together a delightful","useful":0,"cool":0},"iwYhu1La8LCwd8yPgO_zMg":{"text":"Delicious. Fried chicken hummus.  Everything we've had there we've lived. Including incred","useful":0,"cool":0},"hwFPQI7y4uSmyB0YkRhfzA":{"text":"The whole experience of Shaya, from the clean white exterior, to the modern yet cozy inter","useful":1,"cool":0},"rW1RlcOPHfB9CUxxkQWZeg":{"text":"I really liked the overall place, the vibe was good and great service. The food we enjoyed","useful":1,"cool":1},"f07Uy9_s0FEEhhUsqtql2g":{"text":"A party of 11 is tough to accommodate in a smallish restaurant.  Shaya was kind enough to ","useful":0,"cool":0},"nNS00baHQllYGThqDg2lig":{"text":"This food warmed my soul and was worth every penny, fresh ingredients and flavors that wil","useful":2,"cool":1},"564zLF9FRr0GkMsTV9Jj1w":{"text":"This is my go-to place. I can get full solely eating the cauliflower hummus, but I always ","useful":0,"cool":0},"Q3bhNBgX-zMH3olJsa70eg":{"text":"So many friends recommended Shaya for our New Orleans trip and so glad we listened! Loved ","useful":0,"cool":0},"GcIRiiAP4ZZC3P2C-2JkNw":{"text":"After a day of eating heavy, rich Cajun and Southern food, we were really looking forward ","useful":1,"cool":1},"eY2u-04-Dy0SCc8mYoVAZA":{"text":"Listen I wanted to love this place. My husband and I came to New Orleans and this was the ","useful":0,"cool":0},"0Y8o5z2z-fThS2oNKb1F_g":{"text":"Best Mediterranean food I have had. Beware the humus and bread, lest you fill up before th","useful":0,"cool":0},"uEWQaylYqfoPKR7sVYGwwA":{"text":"Serendipity. That's how we ended up here. We'd been exploring New Orleans all day on a Sun","useful":15,"cool":13},"2CeVT2FWAj9r4VZq4P-vCw":{"text":"Had friends give us their reservations to Shaya and we were more than happy to take them. ","useful":3,"cool":2},"w3bTm4PKeyxDRZoYIAhYdg":{"text":"Great food! The lamb ragú hummus is amazing, as is the califlower anslow roasted lamb. Tak","useful":0,"cool":0},"K36KaOPqo6cPti10NtWYvQ":{"text":"One of the best meals in 60 years... every dish was exceptional with flavor, creativity an","useful":0,"cool":0},"vjwfnB_pIkzE7LDidhbfVg":{"text":"Excellent flavor and great service , highly recommend this place! We tried several differe","useful":2,"cool":2},"uvvQFWlLh-FFL8H_r4ARLQ":{"text":"I love middle eastern food, and giving a popular restaurant like this a bad rating makes m","useful":3,"cool":0},"gtVf8m7xBbvoQNemrf23Hg":{"text":"No it's not your typical cajun, creole, New Orleans food but put Shaya on your list.  We s","useful":3,"cool":2},"4UYyC7gPlU8fhnHYBxxsCg":{"text":"After reading about this place, I was so excited to try it.  And it didn't disappoint!  I ","useful":0,"cool":0},"htokY1ruOwXBbbjXHFbu1g":{"text":"An incredible restaurant located in a great little area. Went in during a week day between","useful":0,"cool":0},"H1XU9--lDOSPiHRAjdKFCw":{"text":"Great place. Great food. Loved everything we had. Their homemade pita was to die for.  We ","useful":0,"cool":0},"qDaJwPCVKresrb4o6WkWMQ":{"text":"In New Orleans and have a yearning for eastern Mediterranean food that tastes authentic? E","useful":0,"cool":0},"XDgJmql_C3BztweRHs8lKA":{"text":"Delicious. Worth the hype and wait though you may want to call 6 weeks in advance for rese","useful":1,"cool":1},"t1lj_JXu9lLnH_q5HdxuJQ":{"text":"This place was awesome. Def reach my expectations!\n\nApps * Fried Cauliflower Hummus with b","useful":1,"cool":1},"tC8fiXxbnFDX3lQsiAU95A":{"text":"After seeing Shaya on the Netflix series Somebody Feed Phil, I knew I needed to go here du","useful":3,"cool":0},"kaYNupTo4eyFwkchnrZv3A":{"text":"Easily one of the best meals I've had in a while in terms of fresh, creative food, ambianc","useful":0,"cool":1},"yWQZyQ_ND7msU1B44PXJsw":{"text":"I had first heard about Shaya watching Somebody Feed Phil on Netflix. The food looked soo ","useful":0,"cool":0},"b9_EGK-Fq6xt1b5K3HpBcg":{"text":"I simply cannot say enough about this place. It's a little off he beaten path for people w","useful":3,"cool":3},"ADNtX-TNqEPGI6RJ9HL0qw":{"text":"Pita perfection!!!\nMust order- Baba ganoush, fried chicken hummus, Kibbeh Nayeh. Underwhel","useful":0,"cool":0},"4OVhA96kOlLSnmrLd3eciw":{"text":"Amazing Pita that melts in my mouth.. loved the lutenitsa- something I heard about and tri","useful":1,"cool":1},"Olqjz-CuMG692R1kPh6qsA":{"text":"Highly recommend! Everything we had was amazing! Love the hummus plates! We tried the caul","useful":0,"cool":0},"gM097fUoFDfRrM6ePoXBGg":{"text":"Wow not single thing presented was a disappointment. The shrimp dish was amazing. My son h","useful":0,"cool":0},"iNmk0KeiiMFI0md0oq_VrA":{"text":"Alert: if you are a small person of 5 ft as the women in our group were they cannot feel c","useful":2,"cool":1},"vB9Ro6iayqwPKbfnjW3KVg":{"text":"Food was incredible. So tasty and we had lots of left overs. Loved the setting - so inviti","useful":0,"cool":0},"ucZfgnWByuv3KR1dnn2m3w":{"text":"Amazing food and atmosphere. My husband and I were able to get a patio table on a Saturday","useful":1,"cool":0},"w3TELDBWx5qw9u_vMBDJhg":{"text":"There is nothing like Shaya, home of hummus and everything delicious. Whether you sit in t","useful":0,"cool":1},"Qw20nm6Wjr5gsRx3_YO8vA":{"text":"Well, I have to say it's pretty difficult to get me to go to a two star rating. But there ","useful":2,"cool":1},"yb_cimB2SHSElSpvmnzfXg":{"text":"On a girls trip we came to NOLA for the 50th Jazz festival. One of my friends wanted to tr","useful":1,"cool":0},"YUy545wqz3m7YM5paeLZMQ":{"text":"Shaya has earned a very large following and some outstanding reviews both locally and nati","useful":6,"cool":4},"kQ2eIyoeJn66fR4CMAmDvw":{"text":"The food is so good- we ordered tapas style so we could try everything plus the rib eye st","useful":0,"cool":0},"O8N24dTRUfzT4bOH-vV_oA":{"text":"Wow!  Saw this place on a food show and admittedly I've never been interested in Mediterra","useful":1,"cool":0},"6vBmDQFHur5BUGE6tfyFDw":{"text":"The experience at Shaya was real excellent.  From the decor to the waitstaff to the dishes","useful":2,"cool":1},"7uT_6BOsAfd9SvmMZzpxMw":{"text":"I felt like I needed to be rolled out because we ate so much food.\n\nWe sampled 9 different","useful":1,"cool":0},"AK6oM15NzWG4cWy0SNV4uQ":{"text":"This is the best new American restaurant featured with upscale Israel style. Pita was bake","useful":2,"cool":0},"FRMi55-UTQSG9p380pXw6A":{"text":"First visit - Husband and I had an early dinner tonight at Shaya and it was one of the bes","useful":1,"cool":1},"XPoMEjdOGJGuFx8jxh9TFg":{"text":"We live in the neighborhood and have been anticipating the opening.  We stopped in for lat","useful":0,"cool":0},"LCaumPn_CZ146z3nQ9btLg":{"text":"The hummus and pita! And everything else too! Stopped in for a lunch on the recommendation","useful":0,"cool":0},"T6OvY1V6XJQZxAAs6sKRhw":{"text":"The hype is real. Really good middle eastern food at a reasonable price. 5 of us had lunch","useful":5,"cool":2},"MlHT5zLOY3VqvsH3Yior7A":{"text":"TLDR ; good food but slightly overpriced. \n\nCute high end eatery on magazine street. We ha","useful":0,"cool":0},"rqUtb05qRQycUpHkFiA3JA":{"text":"One of my faves! Hummus is delicious and served with freshly baked, soft and fluffy, and d","useful":1,"cool":1},"W_mAlmExj84ETv1Mw2xkvw":{"text":"I finally made it here after waiting for a couple of years, and it was well worth it.  Eve","useful":1,"cool":1},"zgzGZt8Ct2yUm-9oE9SE4w":{"text":"Great service, food and decor. One of our favorite meals in NOLA. An escape from the tradi","useful":0,"cool":0},"_rfDqSYNCFbCf5LrQwHHXA":{"text":"Came in for my friends birthday, in my reservation I stated that . They gave her a happy b","useful":0,"cool":0},"hdcwdzK_y-2TaH2QghZhcQ":{"text":"My husband and I went to Shaya for the first time last night. From the food to the service","useful":0,"cool":0},"-j49vlx9o3APu_xqCIsDLQ":{"text":"Took forever to get a reservation...but SO worth the wait. The menu has a small selection ","useful":2,"cool":1},"__AgRiPzt8njOV-PLJ4aNQ":{"text":"Incredible service. Simple yet gorgeous decor, and dishes to die for. Seriously delish. Ev","useful":0,"cool":0},"Q8tfMXVZT6amYomFJRX6-w":{"text":"Our chicken entree was good. I would probably eat it again if I found myself back at the r","useful":0,"cool":0},"Pl2MCN34Pr4-ov9IKf4Zyw":{"text":"shaya exceeded the hype. i went out of my way to have a super early lunch there on the day","useful":1,"cool":0},"VrVntJOXHBDxCf4K7G-DBQ":{"text":"What an awesome little jewel on Magazine st. Went there for lunch. The food was great and ","useful":1,"cool":1},"a_I8rAUlOrSDDFj3HfHN4g":{"text":"Cannot support any business owned by John Besh. You shouldn't either. So many other great ","useful":1,"cool":0},"CBEpyFNWea8HyVbcP3QAFw":{"text":"I had a rather bad experience here at Shaya. \n\nFirst of all, it took the waitstaff almost ","useful":1,"cool":1},"jR76hsmIqe-RfSQ-VJmLJQ":{"text":"One of the best dining experiences I have ever had. From the first cocktail I ordered down","useful":1,"cool":1},"m3cNs82JGRefIdImo9MiQw":{"text":"I love this place, my bf and I come here about 3 times a month, when we met he didn't eat ","useful":0,"cool":1},"KV0y7d90TXWqYSL9eTB7Sw":{"text":"Just amazing! From the bread to the lamb and everything we ate in-between it was perfectio","useful":0,"cool":0},"vkhte59zqseuYc8D4K_I8Q":{"text":"The pitas are amazing!! The best I've ever had; however, there was a little attitude since","useful":1,"cool":1},"9izjbPbJB5l1aQAXAFOgsA":{"text":"My boyfriend and I came here for his birthday on Friday. We did have reservations - we got","useful":0,"cool":0},"t6oZmFncDn7zPAd4-RCK7g":{"text":"Best hummus I've ever had.   Lots of good tapas-style dishes.   Lamb was fantastic.   Hard","useful":1,"cool":1},"_zxCqHC3cog8cRu6GsS4nw":{"text":"Hi Roger thanks for reaching out. In a world where restaraunts are closing just as quickly","useful":0,"cool":0},"f13khVsKRMylzbzTUULoJA":{"text":"So, day 3 of the great New Orleans food adventure. Up to now it's been unbelievable. We wa","useful":4,"cool":0},"T88-ER8CUf4X2wpFz1lfEA":{"text":"I came to New Orleans for the Southern/Cajun I food, but left with a greater appreciation ","useful":0,"cool":0},"quict23lRH7SHoc3dWuyIg":{"text":"The food here is definitely good, but what makes this place truly fantastic to me are the ","useful":0,"cool":0},"9LPvNZHLHnqsaaIHzLDN0g":{"text":"I gave this restaurant 5 stars even though i would say half our meal was 5 star worthy. Th","useful":0,"cool":0},"UWHDRElRItRMpTd-6ullZQ":{"text":"Pleasant neighborhood in the garden district offering this gem.   Savory offering which we","useful":2,"cool":1},"35QhMOVwoDg59WDEXSMvOA":{"text":"Simple yet sophisticated, complex yet focused. Perfection all around. Shaya is on my retur","useful":3,"cool":3},"Y-czdqT49gcnBPFXq8HdFg":{"text":"Our expectations were not realized; service was sub-par, cuisine better than average.\nMy s","useful":2,"cool":0},"zWLWxHsbsPYS5S-TUJU9tg":{"text":"Shaya is an award-winning Mediterranean/Israeli restaurant in New Orleans--and there's a g","useful":2,"cool":1},"GmpDMXF0X4bp5HQzRajb1w":{"text":"This was the best meal we had in New Orleans. We came for an early lunch, sat in the lovel","useful":0,"cool":0},"4UfY630k2HwmIHqv1PH1zg":{"text":"I cannot say enough good things about the food here. Started off with the hummus which was","useful":1,"cool":1},"Od4yAzcp4b3FuKv1svSxRw":{"text":"Finally made it to Shaya for an early lunch. They have an elegant dining area inside and p","useful":2,"cool":2},"4k0vgkQ3g2dJ5CzjcFmP6Q":{"text":"I love Mediterranean food and Shaya did not disappoint! Came for an early dinner on a Frid","useful":1,"cool":1},"w4N2LcoA_PV6yy0lPIl-3A":{"text":"They opened the back patio with a ton of seating, was able to get a prime brunch reservati","useful":1,"cool":0},"YDIq-E61bcEsqf62KELpgw":{"text":"This place is the bomb! Everything was so flavorful. My husband and I cleaned just about e","useful":1,"cool":0},"tLVhH5kGFr0dWummGrF-_w":{"text":"All around fantastic experience! You absolutely have to try their hummus. We got the cauli","useful":0,"cool":0},"FmFWgLdae8sPQQ8YGio82w":{"text":"This was one of my favorite meals during my stay in New Orleans! I'm still thinking about ","useful":1,"cool":1},"zkBTUzOGQXXxHHSFBSCp8w":{"text":"If you have a party of 7 don't come here.  We were turned down two times.  We called in ad","useful":0,"cool":0},"t4gXevIMsPTWZCYlqs2CzQ":{"text":"My absolute favorite NOLA restaurant. My favorite dish is the humus with lamb ragu. The pi","useful":1,"cool":0},"g2_nHZLly2A32Xs_lU0ppg":{"text":"*Yes make a reservation as early as possible\n*Yes worth all the hype & no other restaurant","useful":3,"cool":2},"icuK31IOvwHlC7_Py3N5eQ":{"text":"Recommended by several friends, we by chance strolled into Shaya and recognized after the ","useful":1,"cool":0},"P0HvczVDxedEN76lzggKOg":{"text":"The only reason it's not 5 stars is because the service is so bad. The food is beyond amaz","useful":0,"cool":0},"PfiKVBweLOwY7vjf-zjgYw":{"text":"This is probably my fourth or fifth visit and today we stopped in for lunch. Small plate s","useful":0,"cool":0},"0pSXpRu5Jy3-Iu3qH3GZ7w":{"text":"We ended up ordering a variety of dishes and sharing. I especially enjoyed the lamb kofte ","useful":0,"cool":0},"AcQFtbMOpvNVF9axVYPKiA":{"text":"All I can say is WOW! The food and service were amazing. I really enjoyed that the wait st","useful":0,"cool":0},"buHFIZxgNUTn8_lLUruw8w":{"text":"Wow.\n\nIt was our last dinner in New Orleans, and I had saved the best for last. No offense","useful":1,"cool":1},"m_GLHsI3yxbChCIAgXtTpg":{"text":"I've heard the hype about this restaurant and was really excited to try it out. I personal","useful":0,"cool":0},"GH4eq4i2d5T6GRFsy2SunA":{"text":"I haven't eaten bread in 3 months but when they brought to the table that fluffy hot wood ","useful":1,"cool":1},"FDi_Xdh257XcY0J_g01RqA":{"text":"Very authentic. My boyfriend who is Israeli went with me and loved it! We had the courtyar","useful":1,"cool":1},"JFlRJ1Pcu-IXCsko6TGb6g":{"text":"The pitas are made from the pita god himself. So pillowy would perfect, I can't stop think","useful":0,"cool":0},"8GCdxSvtcg1EM5fQyNtquw":{"text":"The most amazing Pita bread I've had till date, however, everything else we tried on the d","useful":1,"cool":0},"CFlNSqYD2TPmhywkvZrlMA":{"text":"So glad we came here. This was one of the best dining experiences we've had in a long time","useful":1,"cool":1},"cuhQNnbdaaJKxKIWq6ct_A":{"text":"In the last three to five years restaurants of the Israeli vintage have been trending in f","useful":0,"cool":0},"cSzHifc-O3ZloGtIj4FNJQ":{"text":"We were excited about going to Shaya based on the hype and reviews.  We left thinking, thi","useful":0,"cool":0},"GaN0-2Qd9c9x0kVBxykGcQ":{"text":"The pitas were really hot and fresh. We tried the lamb ragu & cauliflower hummus. The chic","useful":0,"cool":0},"shQlDE4-9TKkKUzxGcDH1Q":{"text":"Can I curse on Yelp? What are the rules? SHAYA IS SO MOTHER BLEEP GOOD ITS THE BEST BLEEP ","useful":1,"cool":1},"EX6zxNf6b6XscMPToxrB4w":{"text":"This is one of my favorite restaurants in New Orleans, for brunch or dinner. Their small p","useful":0,"cool":0},"ieYC0dUmTMy9OdRaU4FQfg":{"text":"Delicious delicious delicious! You wont regret it !!!!! Food is just awesome. The pita bre","useful":0,"cool":0},"TcrfQ44euISUd4HNtN-h1w":{"text":"I have eaten at both Shaya and Saba and they are both 5/5 in terms of food and service. Sa","useful":0,"cool":0},"a8KeqNIXCXNU2QCP9slnIA":{"text":"Am I the only one not in love with Shaya. The food is good and the ambience is great espec","useful":2,"cool":1},"nUBmRruzw479hTs0_g-g-Q":{"text":"Shaya translates as a \"gift from God.\" In this case Shaya, the restaurant located on Magaz","useful":0,"cool":0},"o-RECVKhOCFx6Qz-kM5sQQ":{"text":"everything was terrific and interesting. not a fancy restaurant but the service and food a","useful":0,"cool":0},"ox_40cg8KLf6GiXXcCF-cg":{"text":"After trying two other Alon Shaya/John Besh restaurants over the past couple days, we were","useful":5,"cool":2},"JZD1xsONjGqOZfJ8dOu_wg":{"text":"Outstanding Resturant and atmosphere.\nIsraeli cuisine in New Orleans.\nServers were great","useful":0,"cool":0},"-Bz1S4vMD8IxMek2wmL0DQ":{"text":"Shaya was a fantastic way to end our NOLA trip. Although we had reservations for 8:45, the","useful":3,"cool":1},"l288YOiM3WidHtXJNstrIw":{"text":"First time visiting! Food was superb as well as the service! Was recommended that we share","useful":0,"cool":0},"mNS4z8ASWkhggzMWSVp8UA":{"text":"Just go and eat there you'll understand the 5 star as well. :D some of the best Mediterran","useful":2,"cool":2},"v38wcSKIRhZvGor-bK7MxQ":{"text":"Delicious Mediterranean food. We came for dinner on a Wednesday night as we had made reser","useful":0,"cool":0},"VDKpvrZ-0r4CWOgSE3QOHg":{"text":"Wow! The service, the ambiance, the food... I just can't get enough. I was immediately tak","useful":0,"cool":1},"NRYdBEJse7Mc0ZetKIBNfA":{"text":"Seems to be one of the harder reservations to acquire (at a normal hour) in this town desp","useful":3,"cool":1},"ekVXn0ImDoDjaw2rfu6rJQ":{"text":"Shaya appears to be from my visit to have a lot of excitement around its opening. Here was","useful":0,"cool":1},"zKb3RF1K83AKcxGTjyx72A":{"text":"Stopped in for take out since we were in the neighborhood during our road trip. We tried t","useful":1,"cool":0},"dKKgv31TIrdqTJMh0MmlCw":{"text":"I can't believe how good it is.  From the food to the service to the space itself, I was s","useful":3,"cool":2},"yBsNXy-cE3k1oUxvRt3CgA":{"text":"The small plates are great!!! The brussel sprouts are amazing and the house made pita is a","useful":4,"cool":1},"1Cmsa9wQzN4Au1luyBGxNw":{"text":"Super delicious food! The hummus and beef tartar were my favorite but you can't go wrong w","useful":1,"cool":0},"JyTqescob0lXtuy2wNsmdw":{"text":"This place is exquisite! They have a lot of vegetarian options, the food looks great and t","useful":0,"cool":0},"_OdmhxODpIROH26OIFB4ww":{"text":"This place really kills it. Absolutely delicious food that leaves you full and feeling hea","useful":0,"cool":0},"RTSvZAqwvs5tW4cmZ3-Cnw":{"text":"I've been to this place twice. I've only been to New Orleans twice so that makes sense. Th","useful":1,"cool":1},"S7aajhZT_igxHYrgeM1aHw":{"text":"We had some friends in visiting and it happened to be their anniversary. We decided to try","useful":0,"cool":0},"AGTGsPrdLQvGaksftNAlNA":{"text":"One of the best Mediterranean places I have ever had the pleasure of dining at, highly rec","useful":0,"cool":0},"xWDsgyI8HHrEUbXvgQbo-g":{"text":"I love this place! Best falafel sandwich \n hummus & pita are 5*, the milk and honey desser","useful":1,"cool":0},"2gNYFv4knFYzhs--FrV6xQ":{"text":"The atmosphere, food and service made this a great dining experience. \nOur server was grea","useful":0,"cool":0},"sXhUbFzZUlNYJvRa1o2dEg":{"text":"I was obsessed with Shaya! I loved the diversity, unfortunately today things changed... I ","useful":0,"cool":0},"xQcztf7kBrwfoZ4VOBN84g":{"text":"Only had apps in this modern, sleek Israeli and Mediterranean restaurant on magazine but t","useful":0,"cool":0},"P7-snPPcdrWj80BwpIzA5Q":{"text":"I grew up in Egypt, spending a total of 11 years there.  From what I remember, the main me","useful":4,"cool":5},"AXYCldHg9je8BxbeWIH25A":{"text":"A great dinner in a cozy, well decorated space.  The hits of our meal: heirloom carrots, l","useful":0,"cool":0},"7GjMvqQ2uHRAuoKH-oqyJA":{"text":"Went there with a group of friends for a celebration of sorts and it was nothing short of ","useful":2,"cool":0},"hmVl8dlhmomrl-gM5v8zWw":{"text":"After watching the New Orleans edition of Somebody Feed Phil on Netflix, we knew we had to","useful":0,"cool":0},"0dBkniqWydC9_V1R9M6AMw":{"text":"Just as good as everyone says. \n\nThe great:\nThose pitas!! It's never been more pleasurable","useful":0,"cool":1},"fEd_wGBIVngz4DCyNXiEuw":{"text":"The food and service are incredible. The pita bread is the best I've ever had and the vari","useful":2,"cool":2},"iDiQwwoLMLbUHbD3NeVe5w":{"text":"I would definitely recommend Shaya and would happily go back. Really great Israeli food an","useful":0,"cool":0},"kHtGqzkH-8IPKFpqr9XvaA":{"text":"Love at first bite!  Modern Israeli cuisine in what was already (previously Dominiques on ","useful":1,"cool":1},"eAFA8m2HqMfYtQvn4a9O9A":{"text":"Had dinner here ......Matzo ball soup was tasteless and  the service was way below top-tie","useful":4,"cool":0},"NN-b81v3ju-m0rVdnICHQw":{"text":"I literally cannot handle how much I love this place!!! \n\nClean, innovative, tasty food pa","useful":1,"cool":1},"j6kSEa5P5dysW615DE17Yw":{"text":"Great food, ambiance, and service!! It's all great. Wanted to order more but we were stuff","useful":0,"cool":0},"ya8avlGasXsA47Xn98KQYA":{"text":"Shaya is a beautiful spot on magazine street that really encompasses all aspects of what I","useful":2,"cool":1},"3MXfZtDkoLprJOvCLBEB4g":{"text":"Dining at Shaya is a treat that can be enjoyed by both the culinary critic and the casual ","useful":0,"cool":0},"lUWA3pPuh4TBJ7aRALAyWg":{"text":"We came to this place after watching somebody feed Phil. I had high expectations but it di","useful":0,"cool":0},"HBeSlzhrcRyoynX-5-sswA":{"text":"Fantabulous !!Love it !! Love it!!! Really enjoyed the delicious food with warm pita bread","useful":0,"cool":0},"E6v9LPWEdbDvZI4szLhhpQ":{"text":"OK - it's been a couple of months, but this review needs writing.  My wife hates beets.  S","useful":1,"cool":1},"kexdRXd8-6bZROPOyDzi8w":{"text":"Oh how the mighty have fallen.\n\nI love, love, LOVED this restaurant when I first went here","useful":3,"cool":0},"soh8JTQZTQ31NhAtHSS5CA":{"text":"Highly recommended happiness in your mouth. The best pita bread I've ever had and I love M","useful":7,"cool":4},"quq1WZWP8_O2ZxDePzvy2A":{"text":"Amazing amazing tahini hummus! What I love about the hummus order is that they consistentl","useful":2,"cool":0},"Dmn-ARV4h5sf_X1CKZoXaA":{"text":"Babaganoush and all the hummuses are delicious! The best babaganoush I've ever had! I foun","useful":3,"cool":1},"FVDBjhLU2AyF5Q9OhfxfnA":{"text":"Our Christmas dinner at Shaya was superb! Great food and service, classy atmosphere. The w","useful":0,"cool":0},"AjjCPhb_6t8vGjXsSajmBw":{"text":"Love it love it love it!the portion of the dips they provide is outrageously small but the","useful":0,"cool":0},"WYtHajVYUQvQDlOXUir44Q":{"text":"This is such a great restaurant! I have now been there for lunch and dinner and can say th","useful":0,"cool":0},"91jA_8jAsQOtKp_m5Pie2A":{"text":"Been wanting to try this place for a while. My boyfriend and I made reservations for our 4","useful":0,"cool":0},"7EfPxc3hBqg3x2ZS5WZvXg":{"text":"My group of 7 dined here and it was an entirely decadent and divine experience. In fact, f","useful":24,"cool":20},"S39MeHu7ZNz_I3yZCHF44w":{"text":"Awesome! Some of the tastiest food on the planet \n\nFun, place for all. Great drinks too!","useful":0,"cool":1},"GXd9Ra0gi-YGMv0i5ibXtw":{"text":"Shaya post-Shaya rolls on in a competent, corporate way but from the the first bite of pit","useful":3,"cool":0},"AJIbKwkRhhRutVrbB8PmXw":{"text":"Fantastic food, especially for a lunch. Very light, but full of flavor. A great place to g","useful":0,"cool":0},"qnhTiAS7Mjf8mcn8WzPztg":{"text":"We were able to nab a Valentine's day reservation at Shaya, albeit for an early lunch time","useful":1,"cool":1},"d1nZOg_7W4e5EqovgTWgCg":{"text":"The perfect example of a chef who got intoxicated by his own success and a lot of unjustif","useful":4,"cool":0},"ZmjOjJj45oac89owxvW7kw":{"text":"Absolutely fantastic!!!!   We ordered baba ganoush, roasted okra, friend chicken humus, la","useful":1,"cool":0},"wKjYztirSQDHfQ5EcDT9VA":{"text":"Soooll good! Try the Ikra! Delicious.  The pita bread alone is worth the trip.  They have ","useful":0,"cool":0},"Fs5Y3SoWnpH87MrjQ2b0Tg":{"text":"Delicious foods.  Outstanding pita.  Excellent service.  Surprised to learn that award win","useful":0,"cool":0},"EBEJdM1z9ECVIqo8I-SpNQ":{"text":"Absolutely the best Israeli food outside of Israel I've ever had. The matzo ball soup with","useful":1,"cool":1},"En79qpt5xO98KCb3w3KcgA":{"text":"Look, I knew James Beard back when he was just little Jimmy Peachfuzz from around the way.","useful":17,"cool":13},"KaO1ZsZkroRrHKfd9jPGzg":{"text":"Probably one of my favorite places my boyfriend and I visited in New Orleans. Was recommen","useful":0,"cool":0},"Zp_ndT7Y4KKHOMEL-oPmXg":{"text":"We were fortunate to get in to Shaya during our brief New Orleans visit.  We love Mediterr","useful":4,"cool":1},"j4gFsff3p1nnrnxLKYA3hQ":{"text":"Amazing, fresh, flavorful dishes. The warm baked pita bread is delicious and perfectly flu","useful":0,"cool":0},"lZMs24zU31PD1sdPkqlc_A":{"text":"Hands down the best falafel I've had outside of the Middle East, and better than a lot of ","useful":0,"cool":0},"Z_-xNQNNtS9Yv10tjCdoow":{"text":"Fantastic tapas/Med food! Our server was awesome, the atmosphere was beautiful, hummus was","useful":2,"cool":2},"ppmCL4KEt8Hw6nQ05IVNuA":{"text":"Absolutely one of our new FAVORITE places in Nola! I can't tell you how fabulous this plac","useful":0,"cool":0},"4eGiAz-Fe8RM8locs7bYfA":{"text":"do you lose your mind for good hummus? then this is the place for you.\n\nor do you think, \"","useful":1,"cool":2},"t1oFz3VewooVQM1_DWosZQ":{"text":"Flashes of brilliance, but ultimately just OK\n\nThe mushroom/octopus hummus literally chang","useful":0,"cool":0},"FwEr9gNjBkZds2kGjfNnyw":{"text":"I can't give it 1 star, because when Shaya actually was part of Shaya, it was the best.  B","useful":0,"cool":0},"S5ugqUzsKowBOE-I_xh55A":{"text":"Consistently great.  Seriously.  In 10+ visits haven't been disappointed.  And you don't h","useful":0,"cool":0},"bMMN5iaypBkRqk7klsq-BA":{"text":"We were so excited to try this place after hearing so much about it; when a non-seafood/ca","useful":2,"cool":1},"D-QdjxLtBuvV1UacOzd0Iw":{"text":"Delicious, affordable, and the service was excellent. I will definitely be back. The curri","useful":2,"cool":1},"7znmtkO3UnZrLstQIsrp0Q":{"text":"We walked in, just me and my fiancé trying to check out something new uptown. We were turn","useful":1,"cool":1},"FwQGZF-71EAEdbkfrLy3EQ":{"text":"It's true: food here was dope. My fella and I live in Mobile, AL but we can't seem to stay","useful":2,"cool":3},"pILovFxXTgxv1Ng8YJuXAg":{"text":"This restaurant is my husband and I's favorite place to eat in New Orleans! Hubby is a \"st","useful":0,"cool":0},"3PHoZuZkOxq1g5GViUqXww":{"text":"Food-4\nAmbience-4\n\nSo I didn't pay for this meal, but I definitely wouldn't mind coming ba","useful":1,"cool":0},"gQNTg4OmfvEb86fmdeDAGA":{"text":"This is the best food in the city. No need to go any further than that. A true experience ","useful":0,"cool":0},"xMNOxytg9UnC9SOALzb4jw":{"text":"Hands down BEST meditteranean food I have ever had paired with some of the best cocktails ","useful":2,"cool":2},"zL2NWylD5QUM9WGdAzvYWQ":{"text":"I have died and gone to heaven. My only regrets are that I can't eat more and that my meal","useful":0,"cool":0},"w8o5iHDcQbLwv6059SOJSA":{"text":"I finally came to Shaya after years of hearing how great it was. I mean, I only love 3 blo","useful":3,"cool":1},"vdILDaOwX1UGoYCPxtpZew":{"text":"It took me two years to experience Shaya, it was worth it. I love middle eastern cuisine, ","useful":1,"cool":1},"ZCzwvbo-S5nxDHPF28XfYw":{"text":"Love love love this place!! Can go on and on about the way the restaurant is set up, it's ","useful":2,"cool":0},"8kCJN6bzIL_fKGPofTz8HQ":{"text":"Shaya is a middle eastern restaurant that has dishes reflective of many countries within t","useful":1,"cool":1},"B_oM1iot27wFFR2E4pJ6qQ":{"text":"Everything was fresh and wonderful,  including the waitresses recommendations. BUT as a to","useful":0,"cool":0},"YpwckjxkUV7KU0alwApJzQ":{"text":"Once upon a time, there was a large white dude and three friends who ventured to a modern ","useful":5,"cool":5},"rJ_0j1xH0yAkTTPZIZn7lQ":{"text":"LOUD and uncomfortable.  As for the food, I don't understand what's the big deal about thi","useful":0,"cool":0},"euMfyBBvEUzZcsNWn0m6yQ":{"text":"It was a great experience dining at a James Beard award! My boyfriend and I dined here on ","useful":4,"cool":3},"boz7Ds5jhtc_IvLrTzaACQ":{"text":"One of our best meals in our five days in New Orleans! The bread here is as amazing as you","useful":0,"cool":0},"r7ci0VZro1nqUq4FbO6vsg":{"text":"Chef Alon Shaya was awarded a James Beard Award for Best Chef of the South 2015 and deserv","useful":2,"cool":1},"kXcVDwrhsgkBFGPshZosMQ":{"text":"I have been here two separate times and had two VERY different experiences. The first time","useful":3,"cool":1},"H-3EnJFDPblmvcEBzXr7jg":{"text":"Wow, what can I say.  I made a reservation for shaya about two months ago when I knew I wa","useful":0,"cool":0},"uSb-gBb-CdoI5CULWfwj-Q":{"text":"My favorite food establishment in Nola. Interesting and delicious cocktails, flavorful dis","useful":0,"cool":0},"SnoFle3uuhZ4MWdsfUBqag":{"text":"This place is amazing.  Seriously the best bloodmary of my life. Really!!!!. Ramona the se","useful":1,"cool":1},"CdkqH2nqzqeZdj_IAaGZ1w":{"text":"My 3rd visit here. Just amazing food and service. Fresh pita, made from scratch, out of th","useful":1,"cool":0},"s3lkWW95bX95qoh57nKOYA":{"text":"Hands down the best Mediterranean food I have eaten so far! Food portions are really good ","useful":1,"cool":0},"x3FydwZ0qGXQaqjWVVEh2g":{"text":"The food is absolutely amazing.  Come with a large group so you can try as much as possibl","useful":0,"cool":0},"3CgCm7qbR3J_R1VjVkaqxA":{"text":"This is now one of our favorite restaurant in Nola. We were coming to town to celebrate ou","useful":0,"cool":0},"Q-lBt2qYTQC0UGmKD5WPYg":{"text":"We were referred to this new \"hot restaurant\" by a top eschelon employee of restaurateur J","useful":1,"cool":0},"dYBQ6jBZOE2t9tjhK1mdDA":{"text":"This was our final dinner before leaving New Orleans, and it did not disappoint!  As I was","useful":2,"cool":0},"A-5fnt8VZg6--gVzLdy0fQ":{"text":"Amazing!! We had the shrimp chermoula, lamb kofte kebob, and lebnah.  Best food we've had ","useful":0,"cool":1},"QF69WBJsC5Ek7rKC75YXdA":{"text":"One of the best restaurants and experiences my boyfriend and I have had in years. Went for","useful":1,"cool":1},"QTb0oAxl6-jSglETRJeO7Q":{"text":"Shaya is a beautiful restaurant. It definitely has an upscale Mediterranean feel to it, wh","useful":4,"cool":0},"5UcmJ7IENUcDAsJ9MVboMQ":{"text":"The Best, The Best, The Best!  Four of us dined at Shaya on December 24 2016. It was the b","useful":0,"cool":0},"quescTlz0_5jS6WSyvrO8w":{"text":"There are so many white people in this restaurant right now. \n\nIn other news, the baba gan","useful":1,"cool":1},"XZ-3Y0LKO2C8RHIzBrKmgw":{"text":"Disappointing but this place is not good for pick up. They charge for pita bread at $1.50 ","useful":0,"cool":0},"xibEjp9-JddmkhDqx_piBQ":{"text":"This place is absolutely fabulous! The food is so good! If you love Israeli food or if you","useful":1,"cool":1},"KLu-Xsbxojm94W9qm9kSgg":{"text":"New Orleans has definitely stepped up their restaurant game and Shaya is a definite front ","useful":3,"cool":1},"0SD9oQrePVqhLL7Cu5M-bA":{"text":"We are here twice on our visit to Nawlins. The hummus, baba ganoosh, chicken schnitzel and","useful":1,"cool":0},"bdFulqQmv58F_Rul5SUkXA":{"text":"In New Orleans for a week & we went here twice in 3 days. Excellent food & amazing service","useful":0,"cool":0},"P4Wzu563D2ijQSB2yZyt-w":{"text":"Went here on a Sunday night, they asked if my party of 3 had a reservation and I said no, ","useful":0,"cool":0},"JTM9_-YwT7QNAuS-Jkviug":{"text":"The reputation of this place proceeded my visit here. It had been on my list for a while. ","useful":4,"cool":3},"7K4a_BcR1vF72cJuGL3rRA":{"text":"Extremely pricey!!! Tiny proportion of the food. Slow service!!. I wouldn't recommend this","useful":0,"cool":1},"atQLdrCVgBTfBEmxw5sSkA":{"text":"First of all, the pita is probably the best I've had in my life. Fluffy, warm, delicious o","useful":0,"cool":0},"vZ2mWA75iP8ger8GF5P5dQ":{"text":"Great food and surprisingly affordable, but really hard to book dinner there during the pr","useful":0,"cool":0},"gJiR4u4BLYlVdZ5Bn17fbQ":{"text":"Everything was soooooo good!!! That bread though, was to die for! And the scallops seared ","useful":0,"cool":0},"4eifZEvc1lOMUypXbB5lWw":{"text":"This was excellent, certainly among the best Israeli restaurants I've been to. The pita he","useful":1,"cool":1},"ToExhk5Yg0skoK3rM5Sf2w":{"text":"My family visited Shaya in NOLA because of a friend's recommendation. As a Lebanese family","useful":0,"cool":0},"TbhmjNoyTbbbyxrTGKlhDQ":{"text":"I don't even know where to begin except to say that our lunch at Shaya was one of the best","useful":1,"cool":1},"kjsdMEMBCh4tnhmS0X6uVw":{"text":"Had a really nice dinner with my wife here. The staff is on point and nice.  The ambience ","useful":0,"cool":0},"60VMHltmkZDuYzZCjRk7kQ":{"text":"Incredibly fresh food and great service. Every single dish was mouth watering.  Highly rec","useful":0,"cool":0},"dk28FksS5U4mdP16Ozip3w":{"text":"Had one more night in New Orleans and was lucky to pick this as my final stop for food and","useful":0,"cool":0},"0JpeR3Qq1GzdO_DeC1IUfw":{"text":"Was there for lunch yesterday, and went into the experience wondering just how much differ","useful":1,"cool":1},"HmCWyO0r2W4_kQIsMj9E8g":{"text":"Our Uber driver, Naser, recommend we try the place. We're picky when it comes to middle ea","useful":1,"cool":1},"gzXMm4XN1s0J-7rtpapx6w":{"text":"Wow!\n\nFabulous food, fabulous drinks, fabulous service.\n\nWe've had the following items:\n- ","useful":2,"cool":1},"ZEwDB8H-Bu1j1sGG2FVVbg":{"text":"Being from the Middle East myself, I'm always skeptical of going to upscale middle eastern","useful":0,"cool":0},"pZrY5_OMENrtxXMhjPrC5g":{"text":"Fantastic food. We've eaten at Tusk in Portland OR which is also Israeli food and top-rate","useful":0,"cool":0},"1VnPU85R53fU5t2IZpxNdA":{"text":"Truly one of the best meals of my life. Had the small baba ganoush, Moroccan carrots and a","useful":0,"cool":0},"54paz5oC5GvsYwXwjs7XDw":{"text":"Shaya, what can I say? It's worth the hype. We ordered the Labneh, Babaganoush, Acorn Squa","useful":0,"cool":0},"nUZZu_GtVhUjvZA4NcfvfA":{"text":"So the food was excellent....but for some reason we were seated opposite the dishwashing u","useful":0,"cool":0},"bZlcdWXLwo3pTVZ5AHjSjA":{"text":"OK people,  this is THE best Israeli food I have ever had,  and I grew up in Jerusalem. Yo","useful":1,"cool":3},"9_7UpU_YIlPGy17XnVGpzw":{"text":"The pita bread alone is a worth a visit here. Fresh and hot right out of the oven! Some pi","useful":0,"cool":0},"phuFXI6LbjgVmCdtxL14gg":{"text":"We heard about this place from the Netflix show Someone Feed Phil and I'm glad we were abl","useful":0,"cool":0},"bNBcR6XrNtIDOKfyHuGUFg":{"text":"The perfect fusion of favors, knowledgeable & engaged staff, moderly elegent yet welcoming","useful":0,"cool":0},"x4fd8WOz_SxMTCO4ryOmKw":{"text":"By far our best meal when visiting NOLA. We had high hopes based off of their reviews and ","useful":0,"cool":0},"VZuKyiwxln0KR_gK28If_w":{"text":"Had the 3 dip combo: baba ghanoush, roasted pepper and squash. The baba ghanoush and peppe","useful":0,"cool":0},"zhItjUQUSYCWCMyR23SXjQ":{"text":"Went here for lunch at the recommendation of a friend.  He said it's some of the best Isra","useful":1,"cool":0},"g6JkrOE9-VRKuZMEhukznQ":{"text":"The baba ganoush and striped bass (market fish) were excellent. Great dinner option to tak","useful":1,"cool":1},"RXsc5eJSpEcVK32Rxwbvsg":{"text":"Shaya is truly a gem. Here's an item specific rating of each dish we ordered:\nButter beans","useful":0,"cool":0},"4HwukrwiqnMAa6EWMUffjw":{"text":"The fact it is hard to even get a reservation for days tells you something about this plac","useful":2,"cool":0},"7YDKoaDXxwhTHnPwwnBh2w":{"text":"I can't believe it took me so long to get here and I do think because it's been so long th","useful":0,"cool":0},"oAEP4sYQjUz7agn8RGGfPg":{"text":"We had to try this place on our last night in Nola. Beautiful restaurant on Magazine St. T","useful":0,"cool":0},"XTy23cN5iTjN9biXzEARvA":{"text":"Was pumped to go to Shaya for the first time when home in New Orleans. Definitely make a r","useful":3,"cool":2},"cpOHtMrkNiVu1vFps010qg":{"text":"My initial plans to NoLa for a long weekend did not include dinner at a Middle Eastern res","useful":2,"cool":0},"szxEYqfp55pk9k2TOOxT-g":{"text":"It's possible to get a table as a walk-in on a Monday night with no special events going o","useful":0,"cool":0},"47qmmSVRwPgG72RDTHKzgg":{"text":"Shaya was outstanding! We ordered most of the menu and every dish was top notch. Whats bes","useful":3,"cool":1},"tUarzpvt6JHO4HLqN2ntZw":{"text":"Not really what I would have expected from this restaurant...super disappointing, especial","useful":0,"cool":1},"hAYzgdCcHN4gJnq2X7WyMw":{"text":"Yeah. This.\n\nBecause Israeli food is somewhat novel in this country, the first thing you n","useful":1,"cool":0},"Dyk5hkhJVAMfVW_1OpTnZw":{"text":"Shaya just won the James Beard award for best new restaurant in the U.S., and as a local w","useful":2,"cool":1},"5_ZVzy4umP1NKOMRiunOXw":{"text":"This one has been on our list for a few months now and we scored lunchtime ressers in town","useful":2,"cool":1},"KnLm2jrr9BTrcpkXEpyc-A":{"text":"I'm a pretty harsh critic when it comes to \"Lebanese\" food (yes, this is Israeli) so for t","useful":0,"cool":0},"-zCZjGIg5IB58lT6Nl_T5g":{"text":"Shaya has been on my \"go to\" list for years and I finally decided to carve out some time t","useful":0,"cool":0},"iDAtxuiQ7kflDRODjDziYg":{"text":"Easy to see why this place is still a Top-20 US restaurant, and the highest rated in New O","useful":0,"cool":0},"V4Y2sOf0-HPKGii2CnoNAA":{"text":"Fantastic meal. We got the Ikra, tabbouleh, and baba Ghanoush to start, and then the fried","useful":0,"cool":0},"2yaxrnKzubOj7CVm0ktLbQ":{"text":"Back for a second time - this time for my birthday lunch. The food was delicious - BUT the","useful":1,"cool":1},"9BAOIbFIEJtbgpEyJ0kQqA":{"text":"My favorite restaurant since moving to New Orleans 6 months ago. My friend made reservatio","useful":0,"cool":0},"hYMLMHr95jc65XqbEXRv6A":{"text":"All the hype and this place was nothing but a big dud! This was nothing more than a glorif","useful":1,"cool":0},"61Kv6MmQTTRcWv-7EZoaqg":{"text":"WoW is an understatement! The flavors are paired to perfection; enjoyable to the point of ","useful":1,"cool":0},"JWQwdFjQxp882wsafW8G7A":{"text":"Absolutely loved it, I ordered the baba ganoush, lamb ragu hummus, falafel, lamb kafota, a","useful":1,"cool":1},"5OM1YA7knQ63RdzUMAFFPQ":{"text":"Oof so good. The pomegranate soda is amazing, as is the hummus. The baba ganoush is honest","useful":0,"cool":0},"lc7DQHrQqOUSBHCRC1gj-g":{"text":"I am here because of the hype around this place. \nWe ordered the ikra spread, the cauliflo","useful":1,"cool":0},"ickmuTS-TCkfd-69M7TsXA":{"text":"Oh my dear lord, I think this is my new favorite restaurant! The fried chicken hummus was ","useful":0,"cool":0},"RbhULYO1pYRhRKR58KD0OA":{"text":"Do not under any circumstances eat here. I just arrived in New Orleans-- this was first an","useful":0,"cool":0},"grfS2aFIeo2fzW0CcgbReQ":{"text":"Best Birthday Dinner!!! We just celebrated my boyfriends birthday here. After all the hype","useful":2,"cool":0},"deGvlQG1ErbAlzGJ4cQm3g":{"text":"Great food, great service, great prices. I'd eat here again. We ordered some dips, some sm","useful":0,"cool":0},"kT3SQl60XBHqxm-78YMROw":{"text":"I have only had the pita and Fried Chicken Hummus...this place is ridiculously good!!! Mak","useful":0,"cool":0},"qfTNW6T0GQnqFkrgt9Fkdg":{"text":"This was our last dinner in NOLA with our friends from college and it was the best meal of","useful":1,"cool":1},"pj4M5XolQb2cEsgTt6OrnQ":{"text":"Excellent food. Freshly baked bread and crafted hummus dishes were amazing. The hostess co","useful":0,"cool":0},"LSgYAZopHt4sV1EwiRT6DQ":{"text":"Giving shaya four stars as I think Saba (almost identical) has better food, but Shaya is s","useful":0,"cool":0},"RTQIlh2sr2wz8wddnXkazQ":{"text":"A coworker of mine briefly brought up Shaya in passing, but I didn't know much about the p","useful":2,"cool":2},"a7rkF9jr-iSbovn3DAK36g":{"text":"I heard so crazy thinks about this place so we tried. It wasn't what we were expecting. Ee","useful":1,"cool":1},"_twwztQSfoAB0nDc3ZyPjw":{"text":"This place was recommended by a friend. We stopped to try a few items and wanted something","useful":0,"cool":1},"1079hYsXbMUzVbeQn_mESQ":{"text":"I guess I'm not \"yuppie\" enough to think this is good. The restaurant has a very sheik atm","useful":0,"cool":0},"-b8PFZto_AgRSqF-RatYsQ":{"text":"Excellent service by waiter Steve.  Food was both unique and delicious!  Atmosphere was jo","useful":0,"cool":0},"_qFLhJdbqT0Jd-SEoPLEKg":{"text":"Incredible food with amazing service.  We came here at the last minute following a short a","useful":1,"cool":1},"FjdlgB48Du661kMix1jyvQ":{"text":"Still love Shaya-but highly recommend going when they first open or make reservations far ","useful":2,"cool":2},"1jQH8zFQVYpFzHsYu1R5SQ":{"text":"Excellent Israeli food! I am Israeli and this is probably the best pita bread I have had a","useful":0,"cool":0},"HFQBr9t47xLn6i09YPb0sg":{"text":"My friends and I were randomly yelping some good food on a Sunday and came across Shaya wi","useful":3,"cool":2},"uChCKZS63U_If4e6rGWDIA":{"text":"Whenever I think about some home cooked  food and whenever I'm actually home sick I go at ","useful":1,"cool":0},"x0E9WPseUwpw9T5T1HUOmw":{"text":"A fantastic restaurant with lots to offer in both ambiance and flavor. Let me first start ","useful":2,"cool":1},"jAPxic68DJVpy0e2o5xNhQ":{"text":"This is a late review from a visit that I made in January. I had to come to this restauran","useful":1,"cool":1},"Fja-9sE4cqqmxYmG9OajNw":{"text":"My friends and I split hummus, baba ghanoush, green beans, tea and the fresh bread. The ho","useful":0,"cool":0},"ipbZleBKDtCgRZJpnYTxAQ":{"text":"Hands down one of the most enjoyable dining experiences in recent memory. The staff was ki","useful":1,"cool":1},"HNQF_0JH9MjsbUieM2pXag":{"text":"Stopped in for lunch without a reservation- was seated immediately despite the restaurant ","useful":0,"cool":0},"mOd3wucnxBOb_s17HWud2g":{"text":"What a great experience.\n\nHere is what we ordered:\nLabneh - delicious, could not stop eati","useful":0,"cool":0},"9RU1-dtZ8yJcHOTtJS2N7A":{"text":"We just went here for lunch, and it is delicious! We started with the Brussel sprouts, and","useful":1,"cool":2},"M4H4LpGWeOxhsrpwnDrqcg":{"text":"As usual the service,food,and ambiance was exceptional! I highly recommend the falafel and","useful":0,"cool":0},"wfBGfbb5ujwYb5a9pbBpww":{"text":"It's damn good y'all.  The pita is amazing and every dish that came out exceeded my expect","useful":0,"cool":0},"Utycbm99l4A8_lkeBuRaqQ":{"text":"The food, cocktails, and service were fantastic! The okra, eggplant, lamb kebob, and endle","useful":0,"cool":0},"GRzZaflMByC4X6vXyXApGQ":{"text":"I don't think I could say enough about Shaya, but I can try.\n\nTo start of with. If you hav","useful":3,"cool":2},"rQt_dDY60uG5X7E_rJ7v8Q":{"text":"Seriously the best meal I've ever had. (Actually a reason to come back to LA.) My error wa","useful":1,"cool":1},"W6aGNZt4QSlW0bZDyQLyNA":{"text":"Great food and ambiance. The waitstaff are so helpful and did a great job explaining the d","useful":1,"cool":0},"pG-AhlWwzmaW5csQiqbAoQ":{"text":"We were invited to Shaya by a foodie friend as we were looking to eat outside the French Q","useful":5,"cool":6},"1Rc4KUWy2IRH-UyWWOHv4Q":{"text":"I don't have much to add that hasn't already been said. Get reservations. \n\nThe lamb ragu ","useful":3,"cool":0},"FE5ZpQeCaxt-JlosxKwp7w":{"text":"This was a great birthday dinner. The pita breads were freshly baked and complimentary. We","useful":0,"cool":0},"aocxPuw_qjaMXJGU6oPQWA":{"text":"Disappointed with the food. Apps and small plates are very good. Large plates were average","useful":0,"cool":0},"wkDLL7a4XJoq4nCtTqP1lQ":{"text":"During my visit to New Orleans last week, I came in here twice! I had heard fantastic thin","useful":2,"cool":0},"6e3J6YQ3fcospWPBUFsF5A":{"text":"Well another example if I don't get it. Service was excellent and the ambiance is very cle","useful":0,"cool":0},"eXERcre7jM_pYvj2GyVf9w":{"text":"Solid food, solid drinks, AND it's not very difficult to get a table if you're willing to ","useful":3,"cool":1},"eDLsmg1Vhsx9uucXmL1N4w":{"text":"All I got to say is one  thing \"John Besh, you're in deep trouble!!!\"  \n\nNo, it's not what","useful":3,"cool":1},"-rsScdQmtoip_PvgBiaWpg":{"text":"This was the biggest surprise to find such a fantastic restaurant that was not your normal","useful":1,"cool":1},"XGMNBWwmWnNQKZx3-k7TGQ":{"text":"AMAZING Mediterranean spot on Magazine St!\n\nFood: Get as many types of hummus as possible-","useful":1,"cool":1},"VStJ_Ep5HPB94tudbIZEWw":{"text":"Each thing was better than the last!  \n... and that fresh baked pita!\n\nFirst: it's importa","useful":2,"cool":1},"ZJksOl6oNV33pbpJWFrwuA":{"text":"Great vibes and decor. The whole place is so well put-together and the staff who seated us","useful":2,"cool":3},"_nQgZfCTd0W-Imq8rnw89g":{"text":"Awesome food. Awesome service.  Awesome look, feel and everything.  Will be back! The smal","useful":1,"cool":0},"1xAmO2m98MFENqGP0wNx7A":{"text":"4 stars for the ambiance, the cauliflower hummus - possibly the best bite of food I've eve","useful":1,"cool":0},"YR5bLk7iUm8tKT3F8Flu8Q":{"text":"Wonderful place! The house-made pita was perfection. (I hate to even call it \"pita\" becaus","useful":0,"cool":0},"i1lzjaGFBtoJM-bP2XeQ0A":{"text":"Unfortunately I cannot review the food. We were never seated.\nTheir policy is first come f","useful":0,"cool":0},"VYlgnWZVpoHeqDso4hgCkQ":{"text":"Went here on a recommendation by a friend. We had cauliflower and cauliflower hummus for a","useful":0,"cool":0},"rS9vYZmAZDMOfV4ZLBI_IA":{"text":"I was able to go to a pharmaceutical dinner there!. Very nice place... staff was super ama","useful":0,"cool":0},"T3xxOQBGKoAjox3vgu-DlQ":{"text":"Best restaurant in the city. Surprisingly not the traditional idea of what you get in New ","useful":0,"cool":0},"Ro6YZpm82SxJiS_dzVPtyA":{"text":"Beginning to end, everything was almost perfect. The food, the ambiance, the service--very","useful":1,"cool":0},"eVde-w0MZCUCdulaHc32RQ":{"text":"A beautiful resteraunt. Our waiter was wonderful and suggested to get 3 Salatim and 1 smal","useful":1,"cool":1},"TlMCaPhmwE6UsMaehLSQ5A":{"text":"The best part of waking up...is not Folgers in your cup, it is Shaya leftovers in your fri","useful":3,"cool":2},"F8in1ppjahCATuXrnreibA":{"text":"Okay..I feel that I have had the good Fortune of eating some pretty good middle eastern..l","useful":0,"cool":0},"AD6_YNf8-4beolkdky0aUQ":{"text":"I went here with my Filipino-American date and I'm fairly certain that we were treated bad","useful":0,"cool":0},"lmnRQK2_CmWcieKnFup2jw":{"text":"Shaya is one of our favorite restaurants in New Orleans.  The food, service and restaurant","useful":0,"cool":0},"8grdSeYsbvc6cIFj_fKIAQ":{"text":"Amazing food! Great quality food and professional customer service. Pita bread offered is ","useful":0,"cool":0},"bDuddDBivnFenii4LhOHog":{"text":"Born and raised in Turkey, I'm always curious and excited to try restaurants specializing ","useful":1,"cool":1},"hTVE3b8paobmNLkNxTm5kg":{"text":"Shaya had long been on my must-try list as one of the country's preeminent spots for Israe","useful":0,"cool":0},"fu4bLJGHQj424lsJ17fm8A":{"text":"This is my second time having Israeli food and I can't even begin to tell you how good thi","useful":9,"cool":6},"QwcsGHmtzE9ZascFipd69g":{"text":"This restaurant had the best food. Pitas were so fresh and soft. You seriously can not go ","useful":0,"cool":0},"8hSHccQhtAlyLLA72Lkcww":{"text":"Shaya is my favorite restaurant in New Orleans! They are consistently amazing. They have a","useful":0,"cool":0},"9js7UuNMElevjG9DlOHm-g":{"text":"Hear me out. It's easy as a tourist to get caught up in dining at creole joints across the","useful":3,"cool":1},"oK2QFZY1LjVxUrODn9FK0g":{"text":"Absolute no. I came here because i knew Alon Shaya started this place. While i also knew h","useful":2,"cool":0},"A8HriIh9qaPPTQ_LuMrTtg":{"text":"I wish there was a way to give this place 10 stars. I heard about Shaya from a mutual frie","useful":1,"cool":1},"yEqxhznGukwopKbM6oe67g":{"text":"Nothing beats shaya hummus + pita. The pita is served warm and is so soft and delicious. T","useful":0,"cool":0},"udmfK6eMR97YxOZeyVcuag":{"text":"Phenomenal.  \n\nI don't live in the city, let alone the state, and i've been there 3 times ","useful":1,"cool":0},"MHJoXno3jdX1ec6vDz-8rw":{"text":"We visited New Orleans for a 5day trip and this  restaurant was at the top of our list. It","useful":0,"cool":0},"mbs6JZ1f5UWUM0sJm2o5eQ":{"text":"Oh hai, Magazine Street. When did this stretch a.) get a name b.) get so many cool busines","useful":16,"cool":10},"VC3I9yh1fI-LSA0rw3f7tw":{"text":"Hands down one of my favourite restaurants in New Orleans! Shaya has everything you would ","useful":2,"cool":1},"VPiGI0N3muWf2r1QklsprA":{"text":"Amazing food, service, and ambiance. Our waitress was so kind and attentive, she always re","useful":1,"cool":1},"2Kibh7BM1et3O-1JYiVtuw":{"text":"food is superb . We got babaganoush , moussaka , lima bean, hummus cauliflower - wow it wa","useful":0,"cool":0},"3duc-CWgZYeu7GF5kj6gnQ":{"text":"What can I say except to add my voice to the many cheering on Shaya?\n\nWe made reservations","useful":1,"cool":0},"HOAdwbayxaZHl_xJyB-Cqw":{"text":"We're trying to do our part to support local restaurants that are reopening for dine-in, s","useful":0,"cool":0},"dihydSwuSvDodY2hD78yBA":{"text":"Just unbelievable. Led there by a great segment on \"Somebody Feed Phil,\" my fiancé and I t","useful":0,"cool":0},"KeWJOsjW23Aokmb0XNjrOQ":{"text":"Clean open space with modern lines, friendly staff, and an excellent three appetizers for ","useful":1,"cool":0},"K_W49apZR4sQVkdGhenLJg":{"text":"Delicious food! I went with my husband on a Saturday evening without a reservation and we ","useful":1,"cool":0},"Rf5IPyNA2xMmXt0Imkmq9g":{"text":"I can't believe I've never written a review especially since I find myself here once a mon","useful":6,"cool":6},"kcUqwFMtO5wc95lBUpw0MA":{"text":"I love Mediterranean food and Shaya definitely helped me get my fix for it.  Came here wit","useful":1,"cool":1},"seGI8SPCsdUubcMpuSnp2w":{"text":"I stopped in around 440ish on a Saturday to find this place quite busy but space for me.  ","useful":2,"cool":1},"J6ShgHdLF0w-Xkr3TwplKg":{"text":"All very good. Food was delivered starters and main dish at the same time though, mistake ","useful":0,"cool":0},"ZG2X6uXBNK0NUcHXv3eoCg":{"text":"I've visited New Orleans a few times - however this was my first trip to Shaya. If you don","useful":0,"cool":0},"Uy_2Ln_DpSz2QuZwAq7Wvg":{"text":"After discussing this dinner with my dinner date we both agreed, this place seemed to be b","useful":1,"cool":0},"KGK3aqMq_UHmpw7ECSXzGg":{"text":"Completely awesome place. Perfect ambience, great food and friendly service.  We had the t","useful":1,"cool":1},"0JzeHtcKmu6VXAYFYKQlpw":{"text":"Food was excellent !! We ordered online then picked up curbside. It was great and super ea","useful":0,"cool":0},"3OcOj-mxDldGiP4AeBUasw":{"text":"Pretty much every time I order food from this place they mess up the order. Always check y","useful":1,"cool":0},"TWspFvWhsat3X8vp2eHYFA":{"text":"One of our favorite restaurants in NOLA.  Service is exceptional and the food is as good a","useful":0,"cool":0},"LAc0TKzxqM6YfGtxU1d1zA":{"text":"Hostess clearly is lacking hostess experience. Showed up solo and asked to sit at the bar.","useful":0,"cool":0},"aojq5TnLvZBl4aIwTbBDRg":{"text":"Ohhhh food was excellent and staff very swift and knowledgeable. We felt safely distances ","useful":0,"cool":0},"6d8xQgFh7jFIwXvSK5Pjbg":{"text":"Finally I made a visit to this infamous restaurant- Shaya, I mean THE SHAYA. I have been d","useful":6,"cool":3},"H2vcBQaZUQDyJ34FqoS5dw":{"text":"Like the other *very few* non 5-star reviews, I feel that I must lead with a preface. I do","useful":3,"cool":2},"Tbv5Ihp5wA4Ko-A5OK4qbg":{"text":"I know good food and OMG!!!!! This has been the best meal I have had in at least 4 years!!","useful":1,"cool":0},"qFrJI6hfyTjsMWA9CiQ2jQ":{"text":"Super delicious! We had 3 hummuses and several small plates. The pita was delicious. I was","useful":0,"cool":0},"0fpxEbRUp90mtOiO3au5XA":{"text":"One of the best meals I've ever had. Can't go wrong with any dish - our most favorite plat","useful":0,"cool":0},"twbkQXViXto0bD1xQbn6yQ":{"text":"Shaya is fantastic. I've been to Israel and this restaurant was honestly as good as anythi","useful":1,"cool":2},"EeFeiElNKkWUd0OjJg_5Lg":{"text":"As a preface to this review,  I have worked in several food & service industry capacities ","useful":1,"cool":0},"vMbBxc3-iwIOdKKu54XXrQ":{"text":"So I used to love going to Shaya until recently I found out from a friend that there is da","useful":6,"cool":1},"-f4OhWyaGYEYhzBlUQ7amQ":{"text":"The pita bread is amazing, as is the hummus and small plates. They have a fantastic happy ","useful":0,"cool":0},"AOZy5C3I62xEYJ2Z28bFcQ":{"text":"Really cute restaurant and we loved the fresh bread with a side of baba ganoush, moussaka ","useful":0,"cool":1},"tdSYyu0-wTO0n-Y47V3U5g":{"text":"Food and atmosphere were perfect! we had a group of 6... 1 vegan, 1 pescatarian... the sta","useful":1,"cool":0},"34N7BjijWhrPaxCtYDYswQ":{"text":"Really great atmosphere and excellent food! I lived in Jerusalem for 3 years and felt like","useful":0,"cool":0},"RIQRyIxvRaJsxl90piUDxQ":{"text":"This place is a Gem. \nI must say - I cheat a little, because I love to look up great place","useful":2,"cool":0},"9TAjk6do13Fj-S1yxn3T6A":{"text":"Tea is fresh along with all the ingredients in their food which you can tell they took the","useful":0,"cool":0},"AFngRwOZe80aKCmZiLYyDw":{"text":"Off the charts creativity.  Atmosphere is modern bistro.  Lively acoustics makes it sound ","useful":2,"cool":2},"pVGWWoORydcmhVM_i4I2dg":{"text":"The Basics: Shaya is a restaurant on Magazine St. in Nola that features modern Israeli foo","useful":6,"cool":3},"cXYornkBC1x4B2HHyjVtmQ":{"text":"Great atmosphere, great food, great service. Came to celebrate a birthday and they made us","useful":0,"cool":0},"omXvdAc7upbQVUxfta1Hww":{"text":"Delicious is the word to describe the fried chicken and hummus!! They served the pita brea","useful":0,"cool":0},"aio1xI3BJMlG0wISsnIPjw":{"text":"Do not miss this dining experience. Visiting New Orleans, one would not expect to eat Isra","useful":0,"cool":0},"agNWB0mJJeabWrHid0k3zg":{"text":"I did go to this place with high expectations and it delivered.  Last time when I was in N","useful":1,"cool":2},"Kxda5tpzX2EaO2KsHpSGzg":{"text":"Phenomenal. Shaya is easily one of the best restaurants in New Orleans. \n\nAs a hummus love","useful":3,"cool":1},"cBBS_O7iV98pgN-Z_ZZeyg":{"text":"They did not get us a table although there was plenty of available tables. You should fire","useful":1,"cool":1},"0HCgO8ZWymCC415bxRgEaA":{"text":"I had always heard such great things about Shaya and always needing to reserve a spot way ","useful":6,"cool":3},"x_yEtZBERMCadff-ODq2Dw":{"text":"Still utterly fantastic.  Every bite is worth the calories.  Simply the best versions of M","useful":1,"cool":1},"PuMk7xIJ8qWtNGpWfGJgpg":{"text":"The problem is that I had very high expectations. We made the reservation about 2 weeks in","useful":1,"cool":2},"fbbzFeIQRRG6MMBsYFbNGw":{"text":"I was in New Orleans for work and Shaya was recommended to me by several friends. We had a","useful":0,"cool":0},"2UAC8V0yPsu6e63UPqR4ow":{"text":"It was fabulous. Our waiter( Harrison )  suggested what we ordered and were loved it all. ","useful":2,"cool":2},"v4x5hGOfUSZF29kDw5AI0A":{"text":"A simple dish of hummus and pita has never been so decadent, the bread having the richness","useful":0,"cool":0},"6T51IHw0e7XgV5FIWnl9lw":{"text":"Unbelievable food. Service was on point along with local NOLA beers to start. We ordered f","useful":0,"cool":0},"Fm789eYyMQq_jVhehsLizw":{"text":"I was recommended to visit Shaya on my recent trip to New Orleans by two different people.","useful":0,"cool":1},"hv7qQi57spqmBHTCi-orLg":{"text":"This is a great spot for lunch (or dinner). The servers are very knowledgeable about the m","useful":0,"cool":0},"5PxPW5p5vZN5R0FZ2iIGQw":{"text":"I always come Shaya since they open . When they open costumer service was great ,employees","useful":1,"cool":0},"5SbG_JCNFvfe-Ve7sAOQSg":{"text":"THE MOST AMAZING CUISINE!\nEvery time we come to dine here, Shaya never ever disappoints.  ","useful":0,"cool":0},"uolqMK4Xt4jKNGYQxUeK9Q":{"text":"Wow is this restaurant good. Came here on a recommendation and it blew me away. Everything","useful":0,"cool":0},"uM79xrgLczwmqgNmADz9ig":{"text":"I have been holding off on writing this review, but after spending my 21st Birthday at Sha","useful":3,"cool":1},"Uah04SiQ7wK_PxViezXHig":{"text":"My husband and I had lunch at Shaya for the first time this past weekend and we really enj","useful":2,"cool":2},"A3cFDlzFIpsAbgGzxKRffg":{"text":"This is one of the best Mediterranean restaurants, with such amazing food and a nice vibe.","useful":0,"cool":0},"JiR2j5amZKCj76zqJ289yw":{"text":"This is a dessert review, as we did not eat dinner here.\n\nWe had the Warm Chocolate Babka.","useful":1,"cool":0},"dbdXgu117EZtqLFWJdJwRA":{"text":"We got takeout a couple of weeks ago and the service was not very good. I had trouble orde","useful":0,"cool":0},"IcZiWf9HDxEpyMX2EAhprw":{"text":"I see what the hype is about.  Shaya's cool - it's got a trendy vibe and it's casual for a","useful":1,"cool":0},"l9ld7sa9fKAQY7IEaDj3kg":{"text":"Your review helps others learn about great local businesses.\n\nThe food was very good, but ","useful":0,"cool":0},"xfzwCJjpShcGDgFEVPqjXQ":{"text":"This place right here I just love a good Mediterranean restaurant and this place does not ","useful":1,"cool":0},"uK8EFfR4p0zSwXhf6D7E8Q":{"text":"Food is amazing. Love the atmosphere. The wood fire cauliflower hummus...there are no word","useful":1,"cool":0},"6bHPMDfcpScaITBTLYXD9A":{"text":"I dream of Shaya's hummus. I really do. I never knew such earthy flavors could bode so wel","useful":5,"cool":3},"Ax8gc9wWsDWu6Gmw7NknfA":{"text":"The food is amazing! I've been three times and every dish is equally amazing! The fries ar","useful":0,"cool":0},"I946LaCoLEcENjb5TIWJOA":{"text":"Ambience:5 Food:4.75 Service:5 Value:5 Return:5\n\nA phenomenal lunch I was lucky enough to ","useful":10,"cool":5},"-Loxabty_0H2CDrTsg5AJw":{"text":"Every time I go to Shaya I leave with a belly full of hummus and happiness. There is no be","useful":3,"cool":0},"HfLGvoLH9-RGy5kIedgAdw":{"text":"Slow and minimal service is the downside of this place. The server barely came by twice to","useful":2,"cool":0},"uURbq8as4mNLHJ1FdEnSKQ":{"text":"We enjoyed the food, drinks, and ambiance.  The hummus was the creamiest I've ever had and","useful":1,"cool":0},"X7nFOpeJwcjATLWdWsvKYQ":{"text":"This place never disappoints! Amazing food and even better service. I love the shared plat","useful":0,"cool":0},"_54v8IBepGQVZAPIq-pnBg":{"text":"Shaya is absolutely charming. It's a nice size, loud but not deafening, and has very prett","useful":0,"cool":0},"8sFeksFwbuu9pdoVpc9eLg":{"text":"Yeah, the food at Shaya was excellent, from beginning to end. Winner of the 2016 James Bea","useful":53,"cool":51},"OPUZ95JedADIOBoBfNhF-w":{"text":"Great service and exceptional cuisine. We tried the tabouleh, the asparagus, the babaganou","useful":0,"cool":0},"4Nb550HodUr3UDBPhtpBmg":{"text":"We love Shaya! We have been here several times, service is always great, and the servers a","useful":0,"cool":0},"Kr-cMSedLucw3sw3YqQbdg":{"text":"Best Mediterranean I have eaten. Beautiful diner, free parking. Reservations required.","useful":2,"cool":0},"QXXhCb6CkpbTE4hoybFvIQ":{"text":"Shaya was my go-to stop for lunch when in town for business.  I loved it.  Always on point","useful":5,"cool":1},"fjc6tjAMlZP1bh5We1r2iQ":{"text":"Came for dinner and our waiter Steve was very knowledgeable and friendly. We tried the fal","useful":3,"cool":2},"B3xFF2n3LWayn-ZwcXI4Ig":{"text":"I ordered cauliflower hummus, baba ganoush, and falafel with extra pita to be delivered by","useful":2,"cool":0},"rx5c4kBE3Fa4TzNv8Qoi_w":{"text":"Delicious pita, a bit on the doughy side. Hummus and starters are all delicious. Found the","useful":0,"cool":0},"fuOeOYkEPk242E5dqcFU_w":{"text":"All the hype I read about was fulfilled!  The food and service was amazing!  Stop in and s","useful":0,"cool":0},"4I1cpLQaD1iAy7KPoZxpwg":{"text":"This review is way overdue, I did a trip to New Orleans just a bit before COVID hit and ha","useful":0,"cool":0},"2VZbhinXLRj2BBz6rZEiGA":{"text":"Ate lunch here on a weekend trip to NOLA and I don't get the hype. I grew up in the middle","useful":2,"cool":0},"E-L9OKsFPuUNUHdfo0SxAw":{"text":"The staff here was so nice! They were able to squeeze in a reservation for us. Restaurant ","useful":0,"cool":0},"0-RElMJPMb04yDqJyuwlPg":{"text":"A must if you're in New Orleans!!! My friend's mom told me it was the best meal of her lif","useful":2,"cool":2},"lEeBT3u2o1a4zIethbWWYg":{"text":"I've waited to write this review because I didn't want to overreact. I wanted to like this","useful":3,"cool":0},"r2wzflWl9NFyIePdCrz5jQ":{"text":"Among all the creole and seafood options in New Orleans, this is a standout hit and a must","useful":1,"cool":0},"eNcErWboUDWdsXgVCbsmgA":{"text":"Food was delicious and staff super friendly. Fresh wood fired pita and good drinks too. Wo","useful":0,"cool":0},"DDExZPoGuprrYGr4T2zCFw":{"text":"YALL JUST GO HERE IF YOU LOVE ISRAELI/ MEDITERRANEAN FOOD OKAY?? Save it for a nice occasi","useful":1,"cool":0},"ncJd-RmYaePYuMHlsow8KA":{"text":"I'm from NYC, surrounded by the world's most amazing restaurants AND THIS RESTAURANT IS TR","useful":0,"cool":0},"IbH0z7C1vW4-LifVf1WBqg":{"text":"Best hummus I've ever had. The food was spectacular. The two hostess at the front door wer","useful":2,"cool":0},"g7-wLrAkphuWMTiqqr89pQ":{"text":"We had a fantastic meal at Shaya! The ambience and food were both superb. The date salsa v","useful":0,"cool":0},"HlnkZ-lf-_XsyvRRcqPhOw":{"text":"I heard this place for a while and now had a chance to come and enjoy. The food is fantast","useful":1,"cool":1},"Zknhf2y_WMJLZ2hbWEWZ9A":{"text":"the best new orleans has to offer. the drinks were off the hook. the pita is the freshest ","useful":0,"cool":0},"1PZ9fZFmmJcUC8oDfMOd6g":{"text":"Where to start, from the host who was an absolute gentleman to the server who was professi","useful":0,"cool":0},"vq7WctneIHAw49ipSpOdOQ":{"text":"The fried chicken hummus is a must-order!!\nI came for dinner with two friends and we were ","useful":1,"cool":0},"9rPiB6PVawC7cSH6QI14yg":{"text":"The baba ganoush was delicious. The wine selection is excellent and I love their freshly b","useful":3,"cool":1},"ws3V_Yeq3pH4GoFpIRlhwQ":{"text":"Once again, another \"Somebody Feed Phil\" find for me. Well actually, I had Shaya bookmarke","useful":2,"cool":1},"q5yTIkBa3nZ9POIlsdJLhg":{"text":"Went here last year. Sorry for the late review. You guys, the fried chicken made me cry, i","useful":0,"cool":0},"9CtWYwnH_R2D5U0AMVLowA":{"text":"Fantastic restaurant with great food and service! The pitas were amazing and I definitely ","useful":0,"cool":0},"8cg40MXDHHdWqkolYKt6hw":{"text":"Hands down, the best food I've had in NOLA and top 3 best food I've had just about anywher","useful":0,"cool":0},"UrRVTnhKc3vXItvIonUsAQ":{"text":"My mouth still waters for the freshly baked pita and delicious hummus. Next trip back to N","useful":0,"cool":0},"f_WyDNnC063gbNqDzm9fgw":{"text":"I can't say greater things about this place.  What a treat!!  The Chickpea Moussaka and Ch","useful":0,"cool":0},"ikqWbq9Rx2unabeHzSAxgg":{"text":"MY RACIST EXPERIENCE HERE!!! \n\nI love the food at Shaya. In light of current exposure of r","useful":0,"cool":0},"Ap6A-g3SyKNrnkqP_T8tEQ":{"text":"This was the best meal I've ever had, hands down. I came here for my birthday dinner after","useful":3,"cool":2},"EDmq1a4GKlSfTILmZQV0kg":{"text":"Best food I have had in NOLA. Hands down! We couldn't stop eating the Sakshuka. It was Ama","useful":1,"cool":0},"9RwC_L5d_X_3HxcFlvUdXA":{"text":"The cauliflower hummus was my absolute favorite. The cauliflower was quite delicious as it","useful":7,"cool":5},"LSk9a9ETqFNMYRrBZiPZYw":{"text":"I just got back from having lunch at Shaya, and I couldn't wait to rave about it.\n\nFirst o","useful":12,"cool":5},"iJIuFhNllc0FgiB7o5U9QQ":{"text":"Thanks to Phil from \"Somebody feed Phil\"(netflix) \nThis place has amazing food  you have t","useful":0,"cool":0},"wjYK5Hq9f3rGAIMuNQkUVw":{"text":"A NEW STANDARD & A NEW STANDARD\nA new standard to judge the plethora of trendy as well as ","useful":13,"cool":7},"t_ttVovjYoRwvmMa5hV4cQ":{"text":"Amazing! Love the fresh press tea, Cauliflower Hummus, Fried Chicken Hummus and Shakshouka","useful":0,"cool":0},"HmtfqdwB6fbBzcMYXmBaAw":{"text":"I've eaten here 6 times. There are enough reviews so I just want to say a few things about","useful":12,"cool":7},"8Wurm4ISv6aHj9VczmZ5Rg":{"text":"This was the best meal we ate in New Orleans. The food was incredible, service impeccable,","useful":2,"cool":1},"TAsyILbNrmi8gUm94Vpy6g":{"text":"So I came here last weekend on an early dinner date with a friend after shopping Magazine.","useful":2,"cool":1},"nJfJVWCckE15j1AHTzXGxA":{"text":"Amazing experience and food. Lamb shank and hummus was the best. Kenny and my server Darre","useful":0,"cool":0},"hgmCx3XEbO_PWDOqlCXD6w":{"text":"I just had the best cheesecake ever! Lol \nIt's so smooth kind of like a mousse, the nuts, ","useful":0,"cool":0},"S9sRv-P7j3GZslKi5Lnmag":{"text":"This is my first time at Shaya and I was excited to try it because I heard great things ab","useful":1,"cool":0},"v7Dj9Py2xg-352Yb3BzvbA":{"text":"Very disappointed on our return visit. On the plus side the maitre d went out of her way t","useful":1,"cool":0},"4cYEPkGXMdERvq-tRa_zxg":{"text":"This place was an unexpected surprise. Everything was so delicious and memorable. I'll def","useful":1,"cool":1},"d-2uMJ80VUuq0sWxobXTUA":{"text":"Freakin. Phenomenal. \n\nWe went on a Sunday night. Sat indoors, and ordered the baba ganous","useful":0,"cool":0},"WS7n2T0WS2WAlNMjDW-HZQ":{"text":"Shaya is a modern Israeli restaurant that really impressed. From start to finish, from the","useful":22,"cool":15},"L53fLY2gPEWMF1PmCzZwQA":{"text":"Fresh pita bread coming out the wood fired oven constantly so go! K, bye. \n\n\n\n\nI mean that","useful":7,"cool":10},"xkw8l9uPTxWhLIRhdDebbw":{"text":"Shaya is phenomenal - it's not overrated. Won a James Beard award for a reason, duh! It's ","useful":1,"cool":1},"DU40hupCB4uoilvGGj149g":{"text":"Absolutely amazing! One of the best restaurants in the world. The space is classy,intimate","useful":0,"cool":0},"izd4V-qROnT83IS1sr8sPg":{"text":"Delicious food and best pita bread I've ever had in my life! Family-style with amazing atm","useful":0,"cool":0},"smKdXEYgGZCEh-8Atm6Y8A":{"text":"Shaya was one of the best meals of our NoLa trip. ALMOST as good as Zahav in Philly! My bo","useful":2,"cool":0},"vRNIFZp0R3tZ93YfyiTXcA":{"text":"amazing hummus - tiny portions - $$$ = will come here for a great lunch but maybe not dinn","useful":1,"cool":0},"0flS_Z9LRKXHtRunyYRxqQ":{"text":"The food was delicious!! Great courtyard ambiance. Excellent service. Would recommend anyt","useful":0,"cool":0},"mvCtiNwJtQB1eBX2Cq13nw":{"text":"Their falafel sandwich is amazing!! I ordered a side of Harissa Mayo but absolutely didn't","useful":0,"cool":0},"o5r4suiO6UyZKI5Kdom_FQ":{"text":"This place has the best freshest bread!\n\nI went with my friend to split dips and drinks. W","useful":0,"cool":0},"D2nkdm0hDnuIU5sn6nPGIw":{"text":"Great late lunch at the bar! Two of us shared multiple dishes and were plenty full! The fr","useful":0,"cool":0},"qvVZhcr8bHGIVbJ6h8tGsA":{"text":"Don't even know how to describe this place. I was speechless after this meal. FANTASTIC!!!","useful":1,"cool":0},"I9EX-xvsvTmL9P0ZU31KbA":{"text":"Wow! honestly so delicious. i'm visiting in town and my friend who lives in NOLA told me s","useful":1,"cool":0},"nywDPy6NtakcJdLuik9qbw":{"text":"I'd come to Nola just to eat here. Everything was amazing! Ate twice in one week, coming b","useful":1,"cool":0},"1dJCfP7liBW0zys8onUuaA":{"text":"This restaurant came highly recommended by multiple friends and we were excited to try it.","useful":1,"cool":0},"KgXBLVjUmDHkKiRVk_w8hw":{"text":"The falafels are really good! We loved the pita bread. Quite a few options for vegetarians","useful":0,"cool":0},"wD-wtE88R4VvnT52jthhLQ":{"text":"Great atmosphere and staff. Our party of 8 shared 2 hummus selections 3 small plates and 2","useful":0,"cool":0},"0yuK1pNESUu-jUzFuij2wg":{"text":"The food was good. I ordered a cucumber salad and I feel like it was a bit overpriced for ","useful":0,"cool":0},"GGTyJeQH-RmrKSFfiz2s7Q":{"text":"Heard many good things about this place as well as seeing Alon on various shows. I don't k","useful":1,"cool":0},"xkHi2sTq5Bs5km6w3jVCMw":{"text":"Usually I try to take a photo or two but I was too busy enjoying the company I was with. O","useful":2,"cool":1},"FSE1RZo1uFY55hELR54KkQ":{"text":"Top 5 meals I've ever had in my life. Absolutely anything from the menu is amazing. One th","useful":0,"cool":0},"QrjhuKtUWqH1W02ssvT9Dw":{"text":"Such great food. Did a great job following COVID guidelines. Tables were spread out, every","useful":0,"cool":0},"dLqjky91at1QnPZ2HTLABQ":{"text":"Freshly baked bread with fried chicken hummus is so good.\n\nMake sure if you have an empty ","useful":0,"cool":0},"FYCU484ST31J79mcYivJMg":{"text":"Loved my dish; the Jerusalem Mixed Grill is like having a party in your mouth. We loved th","useful":3,"cool":1},"r0t43E1ijmrrGGzRGw6ryw":{"text":"Shaya has been on my list of 'must try places' for awhile now. I've been hearing great rev","useful":2,"cool":2},"9do7gz3fJ2MQnQOcx5ULXQ":{"text":"We love all of the appetizers! Fried chicken hummus with their hot bread is a must try! Gr","useful":0,"cool":0},"elF7DJy7vfntUBd0DCvbUQ":{"text":"This is the best restaurant in all of NOLA! We went twice during my stay there. I still th","useful":0,"cool":0},"cNMhhqktLFKA-Ayg91JT4A":{"text":"I have been hesitant to try Shayh, as this cuisine is not my favorite. Boy has this place ","useful":1,"cool":1},"V9U1foekJJGZli91Vbm3LA":{"text":"I had heard so many great things about this place and was SO excited. I gave two stars ins","useful":2,"cool":0},"dIhXFCelUFZtnZHD9lXVVA":{"text":"Three words. Fried chicken hummus.\n\nCame here for the first time a few days ago with frien","useful":6,"cool":3},"H7Bo9HlXFfr2VJqNw4CvGw":{"text":"I've been waiting to visit this spot for quite some time and I can say it did not disappoi","useful":1,"cool":1},"J3mBwEH6wUy_u-UojdB-WQ":{"text":"Love the dips. The pita bread is homemade at their firestone oven (I believe). Soft and fl","useful":2,"cool":1},"oXtLaaxJYZ2wwm1dJbihWA":{"text":"I was watching an episode of Chef's Night Out on Vice when I found out about this restaura","useful":0,"cool":0},"yKd4klX-C47-VqVEWlun0g":{"text":"One of my best restaurants in the city. My best two are Peche and Shaya. I love their sign","useful":0,"cool":0},"Dkp9SaulxxEVBpz6Mn2tMg":{"text":"I've been to Shaya several times and absolutely love it! It is a super cute restaurant and","useful":10,"cool":6},"0cmDoHiNRKuVDp_AUgcAbA":{"text":"Gosh, it has been tough trying pick out what places to eat in NOLA. With so many great opt","useful":2,"cool":0},"934Ptv-IG_GkHlyUroNNTQ":{"text":"Amazing food here, fresh baked pita bread is a must try. The cocktails here are unique and","useful":0,"cool":0},"HlLaA3AhnFLPt1qTtusThA":{"text":"Wow, just wow. There are few meals that I remember as well as my experience at Shaya. I wo","useful":2,"cool":0},"6txsahI2jYyQRPR6LAykKg":{"text":"A little pricy for what it is, but arguably the best hummus I have ever had in my life. Th","useful":0,"cool":1},"kKnQTitT-fdMhYZIXLK7Tg":{"text":"We ordered Labneh, Lamb Ragu and Fried Chicken hummus with Pita, Falafel and  Chicken leg ","useful":0,"cool":0},"WfA-U5lr3U_4rOKIGlvTkA":{"text":"We went as a party of three and Shaya was one of the best meals I've had this year. We sha","useful":1,"cool":0},"hctU-z0bymvcSfewAkK7-A":{"text":"I revisited Shaya two weeks ago with my friend on a Monday night (it was packed) & then ag","useful":1,"cool":1},"6M3gC7lL_JcjtGucdN1eow":{"text":"You don't need to read ANOTHER review of how terrific this food it, but it is, it is! Make","useful":2,"cool":1},"ZCcegn9n9z72kKZbx0hrkw":{"text":"I remember this place being more expensive? Maybe I was wrong?? Regardless I really enjoy ","useful":22,"cool":13},"l-TL2qpVW9HIZWD8U42hxQ":{"text":"Great date night dinner here. Service was attentive and friendly. Food and drinks were fan","useful":0,"cool":0},"YHr5Em-NvOmCtDGPOrbigQ":{"text":"I really liked the atmosphere customer service and the attitude of every one there . Some ","useful":4,"cool":4},"tAp40tkAS6mIrWkphP0nrg":{"text":"The most important stop I make every visit to NOLA. A very local vibe in the heart of Maga","useful":2,"cool":1},"jULo5JTEBRQxtgzoDXA2dQ":{"text":"I preface this by saying I'm not a huge fan of Middle Eastern food. You're welcome to disc","useful":3,"cool":2},"qAcsEaO2aRpYbCPrhHFdEw":{"text":"In a city with great food, Shaya stands out as different and amazing! Colleagues and I dec","useful":0,"cool":0},"Ma6rC-1Rm_sROwL-ndVdzA":{"text":"Came in for a glass of wine and the pita and hummus. It did not disappoint. I will definit","useful":0,"cool":0},"GDFzOwlrjdP16hCACiy-sA":{"text":"Oh goodness. Don't fall into the trap of thinking that you should only eat shellfish and b","useful":4,"cool":2},"s8yCChJqLDm1d7f-dn7e-Q":{"text":"I arrived with 2 of my friends and we didn't have a reservation. The host asked us to wait","useful":4,"cool":1},"Qm0jSDoHu1GPNHJ2BBZWbg":{"text":"What a meal! Went for lunch with my daughter. I'm gluten free and there was plenty for me ","useful":0,"cool":0},"SIz_XcDLWaMQ-mfJJ9z1DA":{"text":"Shaya is absolutely amazing. The humus, which is a staple, is unreal. All of the small pla","useful":1,"cool":0},"lGk_X1ShgHNbnQ-NKZzcBA":{"text":"Make reservations because Shaya is very popular!!  Why?  Because it's deliciousness on a p","useful":1,"cool":0},"vh_Qn14fBOcZsYNJmqKg-A":{"text":"Went there twice on a recent week to NOLA and I was a bit disappointed both times.  My pit","useful":1,"cool":0},"6qvuBZx8MKRhb3jYCa73tA":{"text":"Dude legit the BEST meal I've ever had in my life.  Get the lamb hummus and lamb entree, t","useful":0,"cool":0},"fprsg6b6DsZFyeNk2fV7Tw":{"text":"Shaya is definitely a happening place and even though we were seated as a walk-in with a r","useful":7,"cool":6},"jGjjniB3mA_ra_qEol67fQ":{"text":"We were recommended this place by my cousin (my mom's niece), and we absolutely loved it! ","useful":0,"cool":0},"sHvjAKoCt7ZzwnnmkXnAjg":{"text":"The ambience could swing either an intimate date or just a fun dark binge eating session w","useful":2,"cool":3},"ZlY-W53BBH2ypygSeXrEpw":{"text":"Have been here multiple times and it has always been incredible. This time for lunch I'm n","useful":0,"cool":0},"2eNQvA9EYrnXHMh_NYs5dw":{"text":"How could this be our best meal in NO? But it was. Totally original, totally fresh, totall","useful":0,"cool":0},"w8cEVrFGU036_4JVBW8_uA":{"text":"One thinks small plates...middle eastern food...that can't fill you up...think...again. Or","useful":1,"cool":0},"tr2A8wqUSuRVaC-T4LxGTQ":{"text":"It's a cute place for brunch! We came here for a Friday brunch with our family and friends","useful":0,"cool":0},"0nDEZxzZNV4bzQFn9R6L9w":{"text":"The place is beautifully decorated, the servers and hostesses are very polite and friendly","useful":0,"cool":0},"FfL92nDogeDBWSG7x-WCnA":{"text":"Delicious. We were too ambitious and filled up on the cauliflower hummus and fried halloum","useful":0,"cool":0},"mTRbexvv9aqxl-n0CitYdQ":{"text":"Last year I spent two weeks in Israel and Jordan.  The pita bread and baba ganoush are the","useful":4,"cool":3},"miXInicBT1eXbkoHy8sUiw":{"text":"Came here, like many people, for a delicious meal while visiting NOLA. The experience was ","useful":1,"cool":0},"ZFcQS7z-tV0-wfQaZkCTMA":{"text":"Lunch at Shaya was one of my favorite meals on my week-long food trip to New Orleans. From","useful":23,"cool":21},"2CHE-Ht9NIuzTNE4d6vD8A":{"text":"Wonderful food! Got takeout appetizers of hummus and spreads. All delicious. Online orderi","useful":0,"cool":0},"W2wBqlhtuGHXMbjIBkeY9A":{"text":"Wonderful ambiance, friendly staff, excellent food. If I could give this place more stars ","useful":0,"cool":0},"mxppP6tE0_Calhe0If7dYw":{"text":"The best food in New Orleans. People come from all over the world to eat here for a reason","useful":0,"cool":0},"9dgWVGWBJLCFKgYDQcd6Dw":{"text":"Cool vibes, great cocktails, awesome service, and amazing food.  Arguably the best meal I'","useful":0,"cool":1},"8aylZLAP38ZHY3iib-4o2w":{"text":"I have been to New Orleans three times and would absolutely put this on the do not miss li","useful":2,"cool":2},"MuHH_EMcoKAzyb_w9PGubA":{"text":"Everything from our first to last course was amazing! The pita was fresh throughout and th","useful":0,"cool":0},"QEFuIb6LWLHF5O_yzA_tdw":{"text":"I know I'm late to the party on this place, but Holy Shaya!!! If anyone ever wants to take","useful":1,"cool":0},"M2194H8SDMDEkXt2OdH25g":{"text":"Absolutely blew me away. My boyfriend and I planned on having a date here for a while, ant","useful":1,"cool":1},"Q471FaZlh4v_-CN6h0Mi6g":{"text":"On the flight in, already so ravenous that travelers in close proximity were hitting call ","useful":15,"cool":17},"BSyT7NuHUpI2H-LZFMtxyg":{"text":"An Israeli place in New Orleans isn't exactly what you would expect, but this James Beard ","useful":1,"cool":2},"3-pwOnoSQGKlyWqKadh2wg":{"text":"I finally got in here to eat. I was alone and they sat me at the bar. Service from a delig","useful":0,"cool":0},"lPPnNTvlRQjll23oIYJAjA":{"text":"Consistently excellent. I won't bother reviewing individual dishes, because one could orde","useful":3,"cool":3},"ThivWO1WSHtkbrAdvgjfUg":{"text":"There's a reason that Shaya has become a destination restaurant and been featured on a bun","useful":1,"cool":1},"NQLbmQ2ujy17bW4f1bLumA":{"text":"Good deal on Happy Hour. Half off hummus, and half off wines.\n\nInteresting that even thoug","useful":2,"cool":0},"pV2oKJijbGYdwHkPHYVmng":{"text":"Food is outstanding. Staff likewise. Atmosphere is wonderful. Only negative is it can be h","useful":0,"cool":0},"jXoiqYUh1V3INHU_hs0b-w":{"text":"Best Middle Eastern food I've ever had.The bread and hummus is a must! We order one small ","useful":1,"cool":1},"a4HMOa_7CQps05HASyYJcw":{"text":"Fried chicken humus! This place is wonderful. I suggest splitting multiple dips and hummus","useful":0,"cool":0},"jHZCs_sCMF9k7lm3gGNgWw":{"text":"Shaya has awesome food and the service is great when you're in the restaurant area. The se","useful":3,"cool":1},"qethywr1-46vTGakh3QIjA":{"text":"This place is fantastic.  Best to come here with at least 3 people, since you'll want to o","useful":2,"cool":1},"qat2MAn02BISXAmoHZXcwQ":{"text":"If you ever wanted to know what a James Beard award tastes like, this is the place, all th","useful":4,"cool":1},"lKBJMQAMv7AVBD8T0n09KA":{"text":"The food and atmosphere were amazing. The staff is friendly. We stumbled upon this place a","useful":0,"cool":0},"v-5CKMhIHpHGPJVPgBcsDw":{"text":"Starting off with, we have had Shaya bookmarked on our \"when we come back to New Orleans l","useful":0,"cool":0},"CfJcOarKOagJ3K1Ogqtv6Q":{"text":"Absolutely exquisite meal! Perfect ambience and delicious food. One of the best Mediterran","useful":0,"cool":0},"kYOcjNGx8MRtxDNzyd3zVA":{"text":"We came here for dinner and it was a huge hit. We sat outside, which was a gamble as summe","useful":1,"cool":0},"BW-lePwWbx8s_R06GN8ctg":{"text":"It's not often that I visit a restaurant more than once, but I really enjoyed my first vis","useful":2,"cool":0},"XfuyrcBAQbn7whhqP2lHhw":{"text":"Shaya never disappoints. The food is always delicious. Make sure you save room for their s","useful":0,"cool":0},"5FU66EYYeEWuwVEdPJ3RfQ":{"text":"Ok this place at first I thought well, it's not a place for everybody. It. Might be too fa","useful":1,"cool":0},"7lHo2hZspXcyNErPeGXfZw":{"text":"I came, I ate, it conquered me! Leaving fat (stuffed) and happy but I WILL return! Tapas s","useful":0,"cool":1},"Zb2uHvvdXjVLozjqDSECTg":{"text":"I can't understate how much we were looking forward to our Shaya reservation during our tr","useful":4,"cool":1},"iUw8j9pAz9PNtJmbAWtLsQ":{"text":"An absolutely mind-bending culinary experience. Everything on the menu was amazing. The fr","useful":0,"cool":0},"M0BT2sVJyoz3-JkBSuiccQ":{"text":"Service was great. We were given a table outside; however, I had to ask them to move us in","useful":1,"cool":0},"3EaW4TjQypHReUkOdi72Ug":{"text":"I've been to Shaya several times now and I'd have to say this is one of my favorite restau","useful":0,"cool":0},"s0oJToO2m-JtWlcLk6AaGA":{"text":"Whoa. This may be the best Mediterranean I've ever had. Our experience was an A+ from star","useful":1,"cool":0},"4wasEhspP9yMQ5e5Epzwgg":{"text":"I could've sworn I wrote a review but also it's 2020 and this has been the longest decade ","useful":19,"cool":17},"t1iXAdEfNc3Z_Nn58sk48A":{"text":"Yes, as good as it gets...this is the land of \"Milk and Honey\"...","useful":1,"cool":1},"80B-gwaZTw-YfxgLjjf4ew":{"text":"So delicious. I highly recommend this place. The quality of the food is exceptional and th","useful":0,"cool":0},"U_oyfYNDG1dPpO3A-aadSA":{"text":"Me and my wife walked in at 1 pm greeted by the hostess that informed us that there are no","useful":1,"cool":1},"keFH6iK6pJRBXWy1pQ67sQ":{"text":"After seeing Shaya featured on Somebody Feed Phil, I knew I wanted to make a point of tryi","useful":0,"cool":0},"MQjvz_nVnG8UEpruzbF0EA":{"text":"I visited NOLA back in November with my friend to do a food trip. Shaya came up on Yelp as","useful":2,"cool":2},"2tIuQYIYNEiQ_ia84HaFiw":{"text":"So disappointed during our first visit. Mezze and bread were SO DELICIOUS we couldn't orde","useful":0,"cool":0},"CYqPnb1Jn1e3fEjHlgEwJw":{"text":"Shaya is a must-visit when in New Orleans!\n\nAlthough it doesn't offer the cuisine you expe","useful":8,"cool":8},"BkdVm12A5Ucz5GJgA8ltGw":{"text":"Pricy it is. It may have two dollar signs in Yelp, but it's pricey.\nNo doubt about food qu","useful":2,"cool":2},"2-T_fYAQu5baPP8f7QrYFA":{"text":"Absolutely delicious. You can not go wrong ordering here. The food wasn't just good, it wa","useful":0,"cool":0},"AmZ37JlYVrOEgsaORy-PMA":{"text":"My god that was a good meal. My wife and I were antiquing on Magazine and noticed Shaya wa","useful":0,"cool":0},"eN961pt1uS4v8UVE2ivgLA":{"text":"I heard rave reviews about this place from numerous tv shows and was super excited to try ","useful":0,"cool":0},"3lnvfXR8chWfdZlXCrItlg":{"text":"The BEST pita bread i've ever had! I heard about Shaya from the Netflix series Somebody Fe","useful":18,"cool":17},"-_4-pGBzX29Av_PJIzk4nA":{"text":"The naan is made to order, in the dining room so that diners can not only smell the delici","useful":0,"cool":0},"7ehlL3LSRLkoZGMqyUhXoQ":{"text":"Came in very hungry after a long day and was met with very kind and safety/covid-conscious","useful":0,"cool":0},"NXS-JD_CjgZPK0SKWrqLhg":{"text":"Hands down our new favorite restaurant anywhere!!! We saw on Somebody Feed Phil and wanted","useful":1,"cool":1},"g3emP6UFseCdONNj_nTAdw":{"text":"Hmmm where to start. Probably the best pita bread I've ever eaten in my life. The fact of ","useful":2,"cool":1},"REXEpQOoJsxP680bjq64Ug":{"text":"Took my mom her for her birthday dinner and we had a wonderful time! Everything we ordered","useful":1,"cool":1},"xj-BN3NbpY5FtiV9YWlWpQ":{"text":"Omg, the best meal we had while visiting Nola.  We started the evening with Crispy haluomi","useful":1,"cool":0},"Z4sWaOKUo1dltscxe0m5Ew":{"text":"Items Selected:\nwarm pita with olive oil and za'atar (sumac and toasted sesame seeds)\nbaba","useful":3,"cool":5},"r_2PeRVgy4ZJEeaioP0Zfg":{"text":"Presented on a Friday afternoon without a reservation. Hostess (who wears glasses) informe","useful":1,"cool":0},"64usWtwBqzZdPDTZuTYOCw":{"text":"Amazing food, great service, and very nice decor. We love Israeli food and will definitely","useful":1,"cool":0},"DwOBW16Su3oawwQ1oDWlIw":{"text":"This review is for carry out only.  Extremely prompt, completely accurate order, yay! Lamb","useful":1,"cool":0},"k2XJFqmgeHc81w6095PCcA":{"text":"I'm so glad I finally got to eat here! First, let me start off by suggesting that you make","useful":5,"cool":4},"fXQ79KyyJPU2O1xdX7-RXg":{"text":"WOAH. I first decided to come here because I read about the cookbook written by the owner ","useful":1,"cool":0},"KZQ2Z_bY__7_h9wRKRIdlg":{"text":"I know, I know, just another 5 star review to add to Shaya's hundreds of reviews! I just c","useful":3,"cool":1},"ansHWVcR4EXBH9gvCMW4rQ":{"text":"Beautiful dining area. The chicken humus is so delicious. Can't go wrong with the Israeli ","useful":0,"cool":0},"sNK3H6hZMxxQT6iNKuSrzg":{"text":"Food was amazing. Our server seemed a bit irritated with our table but the ambiance and th","useful":2,"cool":1},"onm6-gSkvFtSH_we44mykQ":{"text":"Beyond impressed with the cocktails and food. We had two recommendations to stop here and ","useful":0,"cool":1},"cTAOxoanLirphDjTNKwTkw":{"text":"Must go. Absolutely fantastic and surprising. My husband and I are vegetarians and it's ha","useful":0,"cool":0},"2XM0aExuGOh9Y6YZpD1UeA":{"text":"Best restaurant I've ever been to in New Orleans. When I first entered I did not expect th","useful":0,"cool":0},"-ezxkkRH8XGeLxfl-vxWIw":{"text":"My first time here! Just amazing! Good food and service - just truly amazing! Thank you Sh","useful":0,"cool":0},"Y9A2WIhSIhrNpTZs3HbuCw":{"text":"Well may be I am the odd one here who is giving Shaya a 3 star but that's what it is for m","useful":3,"cool":1},"QoE5Nh6i0jlSMnF1j4fOFQ":{"text":"This place is always amazing. All their hummus's are to die for. We had the chicken this t","useful":3,"cool":4},"-ibnGnU7Fhvou8oV240PVw":{"text":"Made reservations. When we arrived, about 5:30-ish, most of the tables were available. We ","useful":0,"cool":0},"eR4RpFwWbmTPuEn3amtDIg":{"text":"This is the only restaurant I ever want to eat at. I feel so lucky to have made a reservat","useful":0,"cool":0},"ja_xaeJ8oao07wc83Nt_JQ":{"text":"Amazing food for a switch up of the classic New Orleans. Had a trendy atmosphere on the in","useful":0,"cool":0},"Dv6LToZRrzsBiPTmVvM8CQ":{"text":"First off i want to say the place is clean and very elegant place to dine. Very different ","useful":2,"cool":0},"6JZkIuI6VHPidBhwpX1CAg":{"text":"Well, I came back, and this time I did exactly what I said I'd do last time -- stopped aft","useful":1,"cool":1},"O4Vdfd6K7c7YT7L8JTqW8w":{"text":"This place is a must try.  The menu is so unique and full of flavor.  You will not be disa","useful":3,"cool":3},"nqrW1-SB3kBhsw8u3bxt-Q":{"text":"Well I finally made it to Shaya and to be honest I expected more!\n\nYes, you read that righ","useful":5,"cool":2},"vsU4og8fRsb2rHT4Y22ktQ":{"text":"Fabulous Israeli food. Would highly recommend this place for authentic Israeli food. Was h","useful":0,"cool":0},"7y4Hj3vo1tepG9XaUckAsg":{"text":"If you love all things Mediterranean then stop into Shaya for the best fix ever ! Shaya wa","useful":2,"cool":1},"HODhlPOWkBREX-rnqB0xNw":{"text":"Four of us ate dinner in the vicinity and wanted to get some cocktails afterwards. We knew","useful":3,"cool":1},"cWZ5Vjg4Zyeynhnh8KKEvA":{"text":"After all the hype I was expecting extraordinary but didn't get it so that's why three sta","useful":0,"cool":0},"BNkIQ7odHk4OFFH5YckrjQ":{"text":"Great middle eastern. You cant go wrong with anything on the menu. Im a sucker for the cau","useful":0,"cool":0},"samP6vAWma1vBY7BAHZtyw":{"text":"I'll mirror all the reviews of this restaurant- fantastic!! The homemade pita bread is to ","useful":2,"cool":2},"nMWvkn9bRtj7ZMlWK4vH8A":{"text":"This place was outstanding.  The food was amazing and the service was excellent.  We were ","useful":0,"cool":0},"eC3wDu0WVCceI-CdXhPptA":{"text":"Very enjoyable evening with great menu options. The bread they serve from the oven is wort","useful":0,"cool":0},"InBllFyH22kTcSmqjjiOGg":{"text":"Considering I visited New Orleans just to eat at this place, I'm really glad it didn't dis","useful":0,"cool":0},"SLXypizo9t46cBRsnK85Hw":{"text":"Came here on a Sunday afternoon with some of  my Foodie friends and - simply put - we were","useful":1,"cool":0},"6qpqYDFCcdnBiDN_Q-b_Ig":{"text":"Living in Southern CA and having a close family friend who is Middle eastern, I've been ex","useful":2,"cool":1},"uGoS7yvER368KQva65SeoQ":{"text":"Wish we could have gotten in for dinner but glad we managed to get a table for lunch! We t","useful":1,"cool":1},"G5P4Sne968iqK_BLYcDEfw":{"text":"The food was amazing, the restaurant was super cute, and the staff were all very nice.","useful":1,"cool":1},"AI5XnoB0uWA4FIHcs-FJow":{"text":"The humus is a must, both the fried chicken and the Fall seasonal (squash with sage brown ","useful":2,"cool":1},"JH1FMtYuoNCgRNZMoRFTew":{"text":"Fresh pita from the oven! Yum! Excellent service by the hostess and server and the food is","useful":1,"cool":1},"RLxUR7qHXTTcsaeQteQrSA":{"text":"We stumbled into Shaya not really knowing what to expect and I was blown away by how amazi","useful":3,"cool":1},"OR-UDsgX6MdleuwN-_Awlw":{"text":"This place is great. Hospitable hosts, delicious dishes and beautiful presentations !! Wil","useful":0,"cool":0},"seRUP0YZx7HMSjUKawgIJg":{"text":"I had never tried Israeli food before and it is an amazing place with amazing staff. They ","useful":0,"cool":0},"Nzaa206go-4GfkVo7O0Tfw":{"text":"Our waiter said to try not to fill up on the delicious fresh baked pita so we'd have room ","useful":2,"cool":1},"Pb2TvVUSH7HT58vFjKEM1A":{"text":"Very nice place to have gone too. Staff is very friendly. Place is super clean. Lunch menu","useful":0,"cool":0},"aQ2_20oBeT70fOgOV-u7kg":{"text":"I come here for Hummus plates and falafel. I think it's pita.. or bread. Whatever it is, I","useful":2,"cool":1},"Rmi0U4___WwNhAkPB_XCQg":{"text":"Beautiful decor and atmosphere!\nThe staff was very nice and helpful.\nThe outdoor seating w","useful":0,"cool":0},"UU_udsEzuvZkkZw0tSEZoQ":{"text":"Shaya was quite magical on our New Orleans trip. I was not expecting to find absolutely am","useful":3,"cool":1},"z_TdaziDndTkS5SJxL3h_w":{"text":"I'd give it a 3.75. In true New Orleans fashion fairly loud ambiance. The food quality was","useful":2,"cool":2},"xjZrGe2otqQZ3_Ihoh6XVA":{"text":"This was my favorite restaurant I visited in New Orleans and might be the best Mediterrane","useful":1,"cool":0},"NqV_l5dT3asrqXNMcciBnA":{"text":"I love this restaurant. Whether it is the fresh hot pita that is cooked onsite or the milk","useful":15,"cool":11},"NvLCVhWNzDTxd3UT2yCEyg":{"text":"We love middle eastern food and really appreciate the New Orleans food scene, so we had to","useful":17,"cool":14},"7Voagb56pjAGjCiqX6INSw":{"text":"Shaya is out of this world. We shared two kinds of hummus. It was creamy and tasty. The pi","useful":2,"cool":1},"qlTxG6IwX36uuBwtsv_VFA":{"text":"Amazing Pita that melts in my mouth.. loved the lutenitsa- something I heard about and tri","useful":2,"cool":1},"kZRFSpSEw79ZYIRhF4HH5w":{"text":"Very, very SALTY. I ordered humus, grape leaves , and cous cous--- they were all over/salt","useful":1,"cool":1},"3YnYQpNYeFum9EHoXCR65g":{"text":"In house, brick oven made pita bread. Order the fried chicken hummus or chicken sandwich!!","useful":1,"cool":2},"hRZ9Hp_5PsR_JMSVFEYRdw":{"text":"Really good restaurant in New Orleans. The lamb ragu hummus with pita was the epitome of c","useful":0,"cool":2},"X-RCsRTsrh4uYs5za_EtHg":{"text":"It's my birthday!\nI chose Shaya to eat with my family for my birthday celebration.\nOut of ","useful":2,"cool":0},"sp1hwLOPLpxsoKqYvQ2zzQ":{"text":"Make it a 4.5. Very modern and dimly lit - clean lines and a layout which amplified noise.","useful":2,"cool":1},"nJQ9mKPFYi--tmOh1KdDVw":{"text":"I don't know how you could give this less than five stars.   Dinner for two with the works","useful":2,"cool":2},"iaYzylORgiJLv6UCKmnykg":{"text":"How have I never left a review for Shaya before? Hands down one of my our favorite restaur","useful":4,"cool":2},"oLi5swWAa-SNfmuKWPdRzw":{"text":"How have I been lucky enough to eat at Shaya three times and not yet posted a review?!? No","useful":1,"cool":1},"9TQQPZzwEdfftlO9h3ca-w":{"text":"This was worth the wait! Made my reservation almost two months ago. Day of, they were able","useful":3,"cool":1},"bzALbr_E_sfCabLbRvjRIw":{"text":"Best dining experience I've personally had since before Covid.  The restaurant was tastefu","useful":0,"cool":0},"0YiZwnDvtJXfoVszgEkCjQ":{"text":"If you want to try the best Mediterranean food, you have to eat Shaya!  Hands down the bes","useful":0,"cool":1},"IGenplyVu-NwuPbdSnErlw":{"text":"This place right here I just love a good Mediterranean restaurant and this place does not ","useful":1,"cool":1},"pE5YSQERUUOkECjyE50MbA":{"text":"Nothing but good things to say about this place. My food was an awesome mix of seafood, sp","useful":1,"cool":1},"sAdWCf6oiouzRa0kLRvJow":{"text":"Holy moly! Who would've ever guessed one could find amazing Israeli food in Louisiana (no ","useful":2,"cool":0},"TqglQzrokZyU_1faaOqzPQ":{"text":"Came here for lunch on a Monday with 3 friends which was perfect because the food here is ","useful":2,"cool":0},"T9FamRqIDtftyHqTtjOw6A":{"text":"Perhaps there's nothing left to be said about Shaya, but I've become something of a regula","useful":4,"cool":2},"XxAV4XJroHLsqLc6g6Kelw":{"text":"A great experience at trying something different. We mainly went because so many people al","useful":0,"cool":1},"6qwCVlBdkF62zg5mliU4_g":{"text":"Shaya is one of those places that absolutely hits the mark in many ways.\n\nThe ambiance, th","useful":2,"cool":0},"S0JGsjF-JBBdREy9kOVDOg":{"text":"I think this will be one of our new spots. The fried chicken hummus is phenomenal. A littl","useful":1,"cool":0},"ZZkDIzI-va0VkF_XpVL1SQ":{"text":"Shaya's food is good, but unfortunately the quality must've fallen off since COVID-19 beca","useful":2,"cool":0},"DKn_uxfnYFIJiU_hzpYwSw":{"text":"Went here for a quick lunch around 1:30pm on a Tuesday. We were seated right given the pla","useful":1,"cool":0},"BM2PmwOXwHR3nKKItEIWwQ":{"text":"We had an early dinner here in December.  Our waiter was very attentive and the food was a","useful":0,"cool":0},"lB3RTGCsXLmj5GjqUEqoIg":{"text":"I took my girlfriend here for a surprise birthday dinner and really enjoyed my decision. T","useful":1,"cool":1},"VW9C6yuaiqBfdl-KmVzEeg":{"text":"Great restaurant to eat with friends and family.\n\nMy wife and I were able to dine in perso","useful":1,"cool":2},"imSzssN-U1Dcl2nG7Zxdww":{"text":"One of my favorite restaurants in the world.\n\nThat pita bread.\n\nThat cream cheese dip.\n\nTh","useful":1,"cool":2},"_rZOZrEtHS_AIHKSQGLnAg":{"text":"The hype is real for Shaya, and the wait for reservations is worth it. My wife and I like ","useful":1,"cool":0},"EpRNFLcsPKwHo5D3coVWHA":{"text":"People come to NOLA and talk about seafood , po boys and oysters - don't get me wrong , No","useful":3,"cool":3},"5vi3M4xXgNPfSfVDbGxu6A":{"text":"Wow! Shaya creates pretty mind blowing Israeli eats! Located on Magazine Street with the n","useful":3,"cool":1},"hNAyELkr84gM6w_MBXm37w":{"text":"One of the best dinners we have ever had. We're recommended this restaurant by a friend an","useful":1,"cool":0},"8Av2-rgcvzhyFCTvWVq5LQ":{"text":"Shaya is a must visit in New Orleans. If I lived in this stunning food city I would eat he","useful":0,"cool":0},"PJbbdmqTEjWgivl8yakBXQ":{"text":"Much improved on the food. Pita is light and tasty. Ikra, when they have bowfin eggs, is d","useful":0,"cool":0},"nc__074S1Ctmxb-o98oNnQ":{"text":"This place was heaven on a dish. Seriously, take the time to go and eat at Shaya. Someone ","useful":1,"cool":1},"RAIsLb4I0Y1ZfDFGxSHhUQ":{"text":"Really incredible Mediterranean food here! I live in NYC and have access to tons of great ","useful":1,"cool":0},"iaW-6KZs2W2PTREsDz219Q":{"text":"Got a delivery order today, was supposed to include 2 pita and had none. Also got the choc","useful":2,"cool":0},"JNIERtgK7rVsmexCCmRgiQ":{"text":"Simply put I think this is my favorite restaurant in New Orleans. I am speechless at the q","useful":3,"cool":1},"7ZF36TXQYqaoT7ry-NzZlw":{"text":"Wow! Absolutely amazing hummus and pita bread. Absolutely fresh and delicious. Couldn't ge","useful":2,"cool":1},"Qyi3TczO_6agnG7JSWU9lQ":{"text":"My fiancé and I found this place from the Netflix show Somebody Feed Phil and we knew we h","useful":1,"cool":1},"_QB9qVy81gNE4GTQbtbqnQ":{"text":"We visit New Orleans often and during our last trip I was able to plan ahead enough to get","useful":2,"cool":1},"9kOudD9DDEB1FjHT8CgA8Q":{"text":"After a few days of washing down heavy, southern cuisine with copious amounts of alcohol, ","useful":1,"cool":0},"HPGAkUDnF9m3-HSbCXJevA":{"text":"I had been planning to come here with my girlfriend for our Friday night dinner in Nola. I","useful":1,"cool":1},"p6hdTpdYOynRFoANwM7ZKg":{"text":"This was the best meal we had in New Orleans. Mediterranean food! \n\nSuch a delightful spot","useful":4,"cool":2},"02XKtT3juGot3GIRliKArg":{"text":"My dining experience was nothing short of amazing at Shaya from the service to the delicio","useful":3,"cool":3},"FT-tk0N0itfa55dhY7Yh9w":{"text":"BEST HUMMUS AND PITA EVER.  The end.\n\nBut seriously, the 30 minutes we waited just for tha","useful":1,"cool":2},"Qpot9kz3et-YxluJkWoBrw":{"text":"....beware of how great the food is. You will want to try a lot but then you will eat the ","useful":2,"cool":0},"cyycHWY2wBFKTjct7vbBKg":{"text":"I was blown away. And that happens almost never ever!... One just has to do it. \nThe food ","useful":3,"cool":2},"Ac2jN9iONIuv_wwQ5ci2DA":{"text":"I had been sitting on this review for quite some time, unsure of what to say. The first ti","useful":7,"cool":3},"EoTjP0LHJwYIPyOwdt7xVw":{"text":"I love this place, hands down my favorite restaurant of this type. From the atmosphere to ","useful":1,"cool":2},"hTNUhZwh8fwUaJwdoD1FzA":{"text":"How funny. I've seen this restaurant featured on at least one food/travel show and our Air","useful":2,"cool":2},"x7UYBBgM_GdSDiGUm7RrHA":{"text":"This place is gorgeous inside! Perfect for a group of friends, family or date night. Our w","useful":1,"cool":0}}