{"8N5zS5yn2JABuNW3mYCYdA":{"text":"Good variety of vegan fare. We had the Everything Plate (enough to share) and the Malaysia","useful":1,"cool":1},"if_IDcsaKuvqZj7ObrU4Fg":{"text":"I was staying at the hostel around the corner for 6 days and came here almost every mornin","useful":0,"cool":0},"4o0A1dNPWbPk6dsuUhEA_w":{"text":"Absolutely awesome! Vegan love pure and crazy friendly stuff. Definitely worth while for a","useful":1,"cool":1},"CjlnnnE3BsCORVEi4ncWQw":{"text":"My wife and I visited Good Karma via a Groupon. We had never heard of this place nor heard","useful":1,"cool":0},"CziWUtDsOjwTjOXBgAkRZw":{"text":"This cafe is a gem.  I enjoyed the veggie burger and soup of the day along with the matcha","useful":0,"cool":0},"fgK0FgV_c0K5bVzXEyHFmA":{"text":"First off, it should be noted that I am in fact not vegan or even vegetarian. That said, t","useful":1,"cool":3},"-i6t7R3iHiKEBAign-9Ncw":{"text":"The other day after my dentist appointment (no cavities, yay!) down the road a bit, I foun","useful":18,"cool":10},"FGbOac6_xAQvSlhcY6PkLA":{"text":"Food is so tasty.\n\nHealthy vegan options. The curry was very good. A little pricier than I","useful":1,"cool":1},"msYpts596knWW_9Tq3OqYQ":{"text":"I need more Good Karma in my life. This place has become a go to for me. I eat a mostly pl","useful":3,"cool":3},"RLEWYXU4OtxeR0ldETMniA":{"text":"Amazing, healthy alternative to a Popeyes and king cake filled weekend. The Malaysian curr","useful":0,"cool":0},"EqlquMjsugIqUObzAtFmFQ":{"text":"Upma is a fresh, healthy, energizing and totally original way to start the day. This spot ","useful":0,"cool":0},"bHbOD90oN5yPNQ7dXPV5CQ":{"text":"Few vegan places in New Orleans but this charming with good vibes place did not disappoint","useful":3,"cool":1},"RDhoq75F9OoO3BT6G_ZJmQ":{"text":"The air was different as soon as we walked in. So good!!! The food was amazing. I wish I f","useful":2,"cool":2},"9qiSB36sjfFo_dRBNxXbQA":{"text":"Feeling hungry and want some food that will also make you feel fantastic afterwards? Come ","useful":0,"cool":0},"OSf6OrRGAlm5ObvcMDZ05A":{"text":"Yum, yum, yum! Cozy little spot, sort of tucked away on Canal St. Everything is healthy an","useful":2,"cool":1},"MA0JjGuerW_Ph9Epo9DZtg":{"text":"Authentic food and folks. Consistently my favorite place to go to get a meal that is burst","useful":0,"cool":0},"WpEesOx4dtQj328EZEYXPg":{"text":"Good Karma is connected to a beautiful yoga studio. It has a calming energy, an outdoor ea","useful":0,"cool":0},"IB6ut91H0K2DFX5nQbHZ2w":{"text":"Great place for vegetarians/vegans, to actually have soy protein in NOLA is wonderful.  Th","useful":0,"cool":0},"eqjIpaw4gEWbrW2_vhb5Eg":{"text":"Delicious food and fantastic service. A really beautiful layout with some comfortable cush","useful":0,"cool":0},"jEHcyQeas84q1aE0tU2NMw":{"text":"Best Vegetarian Burger we have ever had.  Great service.  Wish they were closer to French ","useful":0,"cool":0},"Idd_-Yt1-wZACUipaB9O5w":{"text":"Good food for breakfast. Lot of vegan options. Attached to a yoga center. Upma is good.","useful":0,"cool":0},"L0FGXV-JsfKYmtpWEfrDlQ":{"text":"Great friendly atmosphere. Wide selection of juices and vegan plates. Outside seating avai","useful":1,"cool":1},"sd4245HEEPCVxkX026Fokw":{"text":"The food is almost as incredible as the people and the energy.  We can't say enough good t","useful":0,"cool":0},"fvn-oqu9oUd6eiQ6qhTtpA":{"text":"I'm not a vegan but this place is interesting with good food.  It's something different fo","useful":0,"cool":0},"qRBEDmu7BNasMJRl4z30VQ":{"text":"Excellent creative fare, very well-seasoned which is unusual for vegan food. Service was a","useful":0,"cool":0},"CWbZjWwduNz0BtbpzgqiJA":{"text":"IM FREAKING OUT! I gotta tell someone! Yell it from the roof tops! I just left the cafe wi","useful":3,"cool":2},"2OyyETx9zmdEtE26THWqKg":{"text":"You cannot go wrong here. Everything is delicious -- prepared to order and with love. I've","useful":1,"cool":1},"ovCNjG94ngOdkq9rI8RVpA":{"text":"I came to eat here with my girlfriend (who is a diehard vegan, while I'm the exact opposit","useful":2,"cool":2},"PpmYkvkcg_asJwqdoVdzEg":{"text":"I really really enjoyed my lunch! I ordered the soup and salad special - very tasty and al","useful":1,"cool":0},"FNPl9_fNIFtdX40us0maSw":{"text":"I went to Good Karma yesterday afternoon wanting to try the Malaysian curry. The woman tak","useful":1,"cool":1},"dTXFp4_MqKAit-AmdU6m5w":{"text":"I mean to my fault, I've passed this place SEVERAL times, thinking it was just a Yoga Stud","useful":16,"cool":12},"jPUSvuc-ydzZ_4FQ9ZjiSA":{"text":"What a blessing! What an oasis in the city.\nHIGH VIBRATION FOOD! Such incredible flavor an","useful":1,"cool":1},"Iv9xoByL6KEmNmx8o_EWjA":{"text":"The environment was awesome. I had the \"everything plate.\"  It was good at first, but all ","useful":0,"cool":0},"chXF4NcHC8cuYOF2PFKMQg":{"text":"Had an amazing vegan meal here today for lunch and it was delicious! Their menu is all veg","useful":2,"cool":1},"LA4PfWTUrIdTMSfRB3OkXA":{"text":"This was the freshest meal I have had in a really long time.  I got the Good Karma plate w","useful":2,"cool":1},"YxGnYrsHEq381avFS7oZ-Q":{"text":"So good, Vegan, Smells great inside, Beautiful inside and outdoor seating\nI love this plac","useful":0,"cool":0},"jVM25iZqnLAHGkNkDA6hqw":{"text":"Absolutely amazing. We just searched vegan places in New Orleans and chose Good Karma. We ","useful":0,"cool":0},"t1z8ADDS8Um4b6pHI9hW4g":{"text":"The atmosphere is quiet with bar, table, or couch seating along with WiFi access.\nService ","useful":2,"cool":1},"-z7GHK9fxjqSabXkkMhP2w":{"text":"Get The Everything Plate...your life has just been changed! And yes go ahead and have a sm","useful":1,"cool":0},"pd6DTrzyfKi1Rg_ghSSOaA":{"text":"What a hidden gem! Everything was so delicious and fresh. Everyone that worked there was v","useful":1,"cool":1},"fajZ451s7Hi1vg1q2O78GQ":{"text":"Went here on a whim with a friend. Great selection of food and coffee! Had both the fire b","useful":0,"cool":0},"QRd87Qc7PoOomK57R27amw":{"text":"Love this place. Like others have said, it's hard not to feel a sense of peace because of ","useful":3,"cool":2},"19EpfomhDJlVAAPP-rkCXg":{"text":"The food was amazing! Even though we showed up at 2:30 and normally serve food in to go pa","useful":2,"cool":2},"mmfM_mTsDTKind3rZt_ZXg":{"text":"This place is so good, the food is prepared with love and flair. The restaurant is simple ","useful":0,"cool":0},"Bralq4tpcUdVM_wYjjqr9A":{"text":"Yum!! This is a fabulous place for breakfast! I had the Buddha bagel and my husband had av","useful":1,"cool":1},"HVlzdYwzjjdHQJRi68lMtg":{"text":"The juices are always spot on. Amazing food and a quick lunch option for work and an easy ","useful":2,"cool":2},"K9LxOy_mKgGfiu4Onyc-Pg":{"text":"I love love love this place!! I mean their food is top notch. I have traveled to more plac","useful":1,"cool":1},"XgCmU164m9ZoYy-EoHpivQ":{"text":"Just finished my first lunch here, and all I can say is WOW! Very delicious, fresh food. T","useful":8,"cool":7},"ua9ptT4dNck8lyYWIBPFUg":{"text":"This is my last stop before flying back to DC and I feel as if I saved the best for last. ","useful":1,"cool":1},"oAm7Gq-2x1XexXIOKspU-g":{"text":"- Only went for coffee, Archangel was great, I loved the atypical ingredients\n- Employee t","useful":1,"cool":1},"-5nzMXPls_YkVF51gBKZFw":{"text":"As much as I try to be critical, I couldn't think of a reason not to give this place five ","useful":4,"cool":4},"Fgop-ICci33BD5nTF9ZoSw":{"text":"Holy Shiva- my love for Good Karma Cafe is so deep! Now that my yoga practice is back in f","useful":13,"cool":9},"CTHxZQ1SFLpRI3tuJWZkgg":{"text":"I really like this place, and I'm glad they now open til 8! I have definitely come more of","useful":1,"cool":1},"wjqX3Iyfmci1j4pCNGvkTA":{"text":"I came by just to get a smoothie in the morning. Although it was tasty, it was nothing spe","useful":1,"cool":1},"ywN5VkZwWkY-emdJ3N_L8w":{"text":"If you need some fresh & healthy food, a friendly smile or a safe & chill space... This is","useful":0,"cool":0},"0HVCUkt8Fp-a5cunYcJE9g":{"text":"Can we say delicious! And I'm not even close to a vegan. The teriyaki tofu wrap was everyt","useful":0,"cool":0},"xgdxXi5bRzKEemsnWaG2uA":{"text":"This is my favorite vegan spot. The food is always fresh and flavorful. I love that the so","useful":1,"cool":1},"W50sZTMQeTSNCLh-CcKZUQ":{"text":"Delicious, reasonable prices and portions, clean and friendly environment, absolutely love","useful":1,"cool":2},"gS64Pw7xMJhbpCk2AXRqFg":{"text":"The teriyaki wrap was sooooo good! I wish I had the recipe for that tofu!! I loved it! Wis","useful":0,"cool":0},"dQQqgcnzoAUeDeUDGByEMw":{"text":"Visited from Baltimore, and loved the atmosphere! The food was delicious with hearty servi","useful":1,"cool":1},"Iq5qw6qD1AJAD1s9XyJUPw":{"text":"Nothing is worse than getting to the bottom of a plate and finding hair in your food. I'm ","useful":2,"cool":1},"tsY2hAdn2sQGGKtTanXVfg":{"text":"This is my home away from home! House made almond milk - tasty salads and soups not to men","useful":2,"cool":3},"Eoljv85TspP5qeAV69fN2w":{"text":"Great place for vegan food, desserts, smoothies, juices and coffee.  You will not miss eat","useful":2,"cool":1},"ktY4jdtNHlWWOAviM7nCig":{"text":"In the heat, I tend to stay away from lunches with meat unless I am staying a long time an","useful":1,"cool":1},"wWBRieWMLW6uX6GuPjQn2Q":{"text":"Great food, better smoothies, cute ambience, outdoor seating options, & centrally located.","useful":0,"cool":0},"cph8EmbrpgUIb1xIl_4Cxw":{"text":"I was in New Orleans for Spring Break this year and was disappointed by the lack of vegan ","useful":0,"cool":0},"YC_TifUfhjKx4hbhKN9Xzw":{"text":"I used to love this place for their light open beautiful space with consistently good vega","useful":1,"cool":1},"n4YiKK-EfMbdfjEboj0AbA":{"text":"Step inside a magical yoga that manages to also feel like a diverse space welcoming of all","useful":2,"cool":3},"2WU2b25KffNxaTv_LsGcZQ":{"text":"Pretty pricey, but the quality can't be beat. Considering food in NOLA is of the unhealthy","useful":1,"cool":1},"zC-HWXrVgYDuxZ3TU7Lscw":{"text":"A vegetarian and vegan delight!  This place has fresh healthy food that makes you feel goo","useful":0,"cool":0},"EsvEODnvrhIAi7uJ-Qp3Jg":{"text":"Omg we LOVVVVED THE TOFU TACOS!!!!!! My sister & I are actually planning our next visit!!","useful":0,"cool":0},"X13zE0QPKFgTmaugS48Geg":{"text":"Another great lunch find in New Orleans! I had the Karma plate. This included a salad, a M","useful":3,"cool":2},"vN5mTsnSlQVFyYjzFLXVxw":{"text":"I absolutely love this place and I still haven't even went inside haha. The food is amazin","useful":0,"cool":0},"bi5h84tnKC7pDQFxeTMWyg":{"text":"I recommend this place to anyone who is looking for fresh and healthy food. The staff was ","useful":0,"cool":0},"faCYMJqxIwCV8KvtL47ang":{"text":"Wonderful atmosphere, the cook greeted me immediately and welcomely explained the menu and","useful":4,"cool":2},"Qtu8BW-HFtsElKM6JAD24g":{"text":"Great bowl of BBQ seitan today. Lovely space, too. Found myself wanting to just hang out i","useful":1,"cool":1},"mxj83ceRLpTyJJUMic7vxA":{"text":"Great spot for coffee and breakfast with AMAZING service. The people who work here on Satu","useful":2,"cool":2},"yQXubbdVb7BJTavDbsa8lw":{"text":"I love this place my favorites are the Buddha Bagel with avocado and cucumber  in an every","useful":0,"cool":0},"qhk7gIqhZV4hQ5Tx0zNfYg":{"text":"Service was very slow and they were out of bagels but happy to find a vegan menu close by.","useful":1,"cool":1},"ZbrKaoh0qPQJLYYorCiSsQ":{"text":"First time here today after an amazing Saturday morning yoga class with my dear friend. Lo","useful":0,"cool":0},"CyK_p3d1woWEp0R0RB8Jjg":{"text":"See below","useful":12,"cool":9},"-FCwwaAbarNlZx9ainB6dA":{"text":"They're really gotten it together lately! Service has gotten so much faster and more effic","useful":3,"cool":2},"b-ySHYFWfKriEcLrONih-g":{"text":"I live down the street from Good Karma so I eat here a lot; and you know what?It's always ","useful":2,"cool":0},"5s0aVXmjzho9fWaNFGDULw":{"text":"I really wanted to love this place--and to be fair it does have a lot going for it. It's i","useful":7,"cool":1},"b7o8pN0pkxC__HlQp_rPdA":{"text":"Good Karma Cafe is my favorite restaurant in New Orleans. I love their savory entrees, esp","useful":0,"cool":0},"2E3oX-xJUjnqOLcnscB5Mg":{"text":"Delicious vegan food. Very friendly staff. I got special and wholesome juice. Tasted very ","useful":0,"cool":0},"XemVLdMGOE6b92dNeyAEVg":{"text":"Good Karma Cafe is as great as its name! I love their coffees there as well as their fresh","useful":5,"cool":2},"vrgxp9NQZzF0ak8icir7EQ":{"text":"Yum. Just so much yum here! I'm from Seattle, and we have a pretty solid gluten free/vegan","useful":3,"cool":1},"--DcWXBx2ei_ME39LrL6Hg":{"text":"Good stuff even for the non vegan. I was surprised how satisfying my avocado toast was. Th","useful":1,"cool":0},"kyqS8T7AW0wa2e5xlafKug":{"text":"I went here in September 2019 for lunch with my 2 non-vegan eating friends. The entrance i","useful":0,"cool":1},"HM5x3r5Yea2sdU_HQ2PNVQ":{"text":"We were visiting the Crescent City and looking for a place  that had a good plant based me","useful":0,"cool":0},"NSUuE6FP7-RMUFcSzwCHDQ":{"text":"In five days I've made a special trip here three times. Just a great little cafe attached ","useful":8,"cool":4},"-ZWvKzOB16XJziLbqhdzCw":{"text":"magic. what wonderful people. food was excellent​. make time to spend there. interesting​ ","useful":0,"cool":0},"rDOV8U1yT-k7KPUdYihikQ":{"text":"I really wanted to like the food here but it just didn't do it for me at all. I ordered th","useful":4,"cool":0},"wb4CA0mweanBy2dn_EHjsw":{"text":"Honestly first and last time I will be coming here. One of the girls had the worst attitud","useful":0,"cool":0},"APlMwEhafc6vncGM4LeQ9A":{"text":"Let me tell y'all what I had for lunch in New Orleans today.  Good Karma! I got the Good K","useful":0,"cool":0},"opQDzJGQEe11Noku9Td2fQ":{"text":"Good Vibes All Around.  Excellent resource for Vegans and Vegetarians.   Menu is well expl","useful":0,"cool":0},"XPRr-i0HkDdO9U-uDdGplw":{"text":"Stopped in for breakfast this morning and tried the Buddha bagel.  It is very good.  I'll ","useful":1,"cool":3},"FIBgSzSQMLNdGUtnso-oRQ":{"text":"This was a lovely little spot! A ways back I had some vegetarian friends come visit me, an","useful":0,"cool":0},"Vcx2cM6tB90d-PqowkwMLQ":{"text":"The food and drinks all look fantastic here. I had the curry bowl & oat milk latte, which ","useful":0,"cool":0},"8u3Inyi-b3bdmWyORk5NFg":{"text":"The name of the place is very appropriate. The food tastes like it too - good karma. It's ","useful":0,"cool":0},"utMgqYMH_rSbFxVpAgOA9g":{"text":"Been here a lot and it has really great healthy organic food but the service is trash here","useful":1,"cool":0},"1YkMEkl0uERpAYqReAH7QQ":{"text":"Good Karma is a great find in Mid-City - awesome vegan baked goods, coffee drinks and othe","useful":2,"cool":2},"6B9bXE1xpo1Ml71Ogf0CuA":{"text":"Great healthy food for a lunch stop, good juices and hot drinks as well. I usually get the","useful":1,"cool":1},"QMKcOe95swbD8j9QsoDSHg":{"text":"Lovely little find in New Orleans! The front door leads to a yoga studio so make sure you ","useful":0,"cool":0},"X2dEyr8c23iY_p9WR-dN4g":{"text":"I have had both breakfast and lunch here. The upma for breakfast is delicious. And the cha","useful":0,"cool":0},"OrYKJ438gmYxFeIZI_7s0w":{"text":"A great place. Delicious food, amazing coffee, very friendly service. A MUST if you live o","useful":0,"cool":0},"r-2UE0QYYq9myzwAK69Oyg":{"text":"I was super excited to try this place based on their selections of vegan and plant based f","useful":3,"cool":4},"qJqBRwzgzd3HbKgaEvejLw":{"text":"Now that Mardi Gras 2019 is behind us, it's time for me to attempt to eat healthier. Enter","useful":15,"cool":12},"H-b0SUTRiz2jWTlc2nasyQ":{"text":"I love going here when we get a chance. The food is fresh, tasty, & (I think) very healthy","useful":0,"cool":1},"8-pV7lJrwyEA1qGBbd7vbQ":{"text":"We were very surprised to find a super taster and very authentic Indian style vegan place.","useful":3,"cool":0},"UhIaLz5iA6G9q5Md0NyxuA":{"text":"Definitely a hidden gem on canal street for vegan food. My go to is the always the kimchi ","useful":0,"cool":1},"Yy-EBHZAoz4I1LygO114Zw":{"text":"This food is where it is at; if you want something healthy and wonderfully delicious, you ","useful":0,"cool":0},"OCtLoXFg0QBFz8CkM4IDUw":{"text":"My new favorite lunch spot. The veggie burger was tops  - moist, flavorful and filling. Th","useful":1,"cool":0},"_35F3NAXcF47uwX7_us0vQ":{"text":"I have had their food twice, both totally different plates. Both were excellent! Everythin","useful":0,"cool":0},"pFQ1E0yyr-fqTcKbbLkyuw":{"text":"Oh my goodness I found a hidden gem! I ordered the jackfruit tacos and some bakery items. ","useful":0,"cool":0},"0JDBiEN7VQUPl8yeQrs-sA":{"text":"Wowowowow. The food, the wholesomeness, how they store things and have an edible garden...","useful":0,"cool":1},"te_U6q5PBWC-eHCFeidCXA":{"text":"I'm a fan! Good Karma offers healthy vegan options all day. I have been here a few times. ","useful":2,"cool":1},"h5DgAXYREPsjhuzQebmmfA":{"text":"Delicious food - had the sampler which had so many different complex favors. Only feedback","useful":1,"cool":1},"gjynRPO-Y9Y1HQJLGHq6vQ":{"text":"So delicious! We ordered two smoothies and I was stoked they came in reusable glass jars!!","useful":0,"cool":0},"fsBnpawLCLL8TOWuGCUvrw":{"text":"Was craving for some good vegetarian comfort food , and found this place. I had the Malays","useful":0,"cool":0},"bTiZrBVs58KRPbJfPLlrtg":{"text":"Love this place! Adventurous beverages offered with your choice of numerous alt milks.  Th","useful":1,"cool":1},"DsKZSZP2ro05Jb9uLIjS8g":{"text":"Fantastic service! Everyone was so helpful during our New Orleans vacation. Coffee is sooo","useful":0,"cool":0},"-nyDNE8vVANGcBq-cYLMzw":{"text":"I almost didn't stop in. Like every other plant based eater, I do look up my options befor","useful":5,"cool":3},"t-DIVYYo0ZuTtjmIspVnTA":{"text":"Great modern take on Indian and lots of great drinks. \n\nYummy avocado toast. \n\nThere's an ","useful":0,"cool":0},"NgeikcpoZdovuQ7uuqTQLg":{"text":"Excellent tasty healthy vegan food. The employees are so sweet and helpful. I love the ene","useful":0,"cool":0},"yiE5LsJFSs_zxeuvao3tOA":{"text":"We ordered Kichari, Veggie burger, Quesadilla and Malaysian curry bowl. Everything was del","useful":0,"cool":0},"ARdnD0tbfUSTeEpVSk8_QA":{"text":"Delicious juice,  sample plater. . Everything solid,  just really good food.  Soup also. I","useful":0,"cool":0},"Sf56u0aRQgsLzMXewzGGXw":{"text":"This place is really yummy, with lots of good. healthy options. I have always been treated","useful":0,"cool":0},"BzBJ-etavZdTJrlEf5VMVA":{"text":"Great vegan food and drinks. Prices are reasonable. Food feels clean and healthy and is su","useful":3,"cool":1},"UEWRMET9YAYJRlo2z5y-8g":{"text":"This place was really cute and the food was delicious and full of flavor. \nWe also got a s","useful":0,"cool":0},"4hHV9fcELEbWzz4XLSJymQ":{"text":"Sigh, look. I'm not a whiner. The food is fine, though unremarkable. I've been here severa","useful":2,"cool":0},"wyac3K_K6ABRgKseGXvhHw":{"text":"i love the atmosphere here.  We stopped in for lunch and tried their veggie burger, my fir","useful":2,"cool":1},"ris_rmvC4wwrkxDX4_COwA":{"text":"Great vegan food and atmosphere. Everyone was friendly and helpful. Stayed for a whole aft","useful":0,"cool":0},"5ntz7yKYv7J03L06mnSW9A":{"text":"We loved everything on their menu -- especially their smoothies -- and the folks are so fr","useful":0,"cool":0},"Y4o54z9ID37eZ8aSKsW3rw":{"text":"One of my favorite vegan spots in the city. Their food and drinks are amazing, tasty and v","useful":3,"cool":2},"STfNpUAG3JFCu3lpwK_U3g":{"text":"I'm still full, but it was soo good I can certainly go back for lunch. I had the Chai and ","useful":0,"cool":0},"qNCAx5rUUVktzRBR9mCdLw":{"text":"No better place to go for your vegan cravings! Very nice quaint setting with an amazing st","useful":0,"cool":0},"tfGl5zhNNH7MrhSFSOXp4A":{"text":"Lots of vegan options here. Is a coffee shop and restaurant. I appreicate the floor seatin","useful":0,"cool":0},"Mm7cNgFKbVlUylVkmwJuHw":{"text":"This place needs to change it's name to Bad Drama. We were completely ignored while standi","useful":4,"cool":0},"zHb8R5HhcBTL1mujIdfTsg":{"text":"Malaysian curry was delicious. Great place to get healthy juices. Locally owned and a good","useful":0,"cool":0},"ETtVUuoe-r2Dadse5kLUeg":{"text":"Best indian foood ever! I loved the taste and the environment! My bf and i ate there and w","useful":1,"cool":0},"Z8SnrxfoNhV6KBE_Y7jOCA":{"text":"The coffee and made to order juices and smoothies are always organic. Mostly organic ingre","useful":0,"cool":0},"RIyCzM3cERnBgsjsLcNv7Q":{"text":"Excelente comida vegana con influencias mexicanas e indias, los chilaquiles son estupendos","useful":0,"cool":0},"QmKh2QGOXeOvkelIUYyayg":{"text":"I took a Lyft over here from the French Quarter and I'm completely conflicted on whether i","useful":5,"cool":4},"d4nOIl7n6dSi9cPxaYWT5w":{"text":"I've only been a few times but I simply love this place -- you will find nowhere in New Or","useful":1,"cool":0},"SwHwSRT9AIgPjtQGTWGF8g":{"text":"I was in here yesterday and I am BUMMED I didn't come sooner! Deliciously nourishing and b","useful":0,"cool":0},"ZW0DZ-dLf7TrhYdHIOd0Zg":{"text":"Had the curry bowl, pickle plate and the cerviche (hearts of palm) tacos. All was excellen","useful":0,"cool":1},"L_grUWkvOSVffbSew-pckw":{"text":"The food was good but not amazing. The service was also good but not amazing. We had a to ","useful":0,"cool":1},"5zJ3zC964euoa35cVxte4g":{"text":"Oh snap! Every coffee place tries to be boho and down to earth but ends up being boho chic","useful":1,"cool":1},"XxHd9G74LHAmFuVLIFGzuA":{"text":"So rare for me to be able to order an iced mocha without dairy BUT in this place, I can.  ","useful":0,"cool":0},"3CQhcVIdxaNVN8bs-_rzag":{"text":"Vegan? Vegetarian?? \nAmazing,healthy,and made with love is how I would describe the food a","useful":0,"cool":0},"scOkv_9TpmGDtknvX04Xrg":{"text":"This is my favorite place is all of New Orleans!! I visited back in October 2016 and have ","useful":1,"cool":0},"M-ZEeauy0FF1D_h64XRLCQ":{"text":"This is hands down the best vegan & vegetarian food I have, and from a regular/casual plac","useful":1,"cool":0},"w4lWXAzgUnP9XNZFSiLZlg":{"text":"This place is so amazing! The tinctures they make are truly magical. As an intuitive pract","useful":1,"cool":0},"bCwHg1JIDwkLld4xTXehNg":{"text":"The everything plate was excellent. South Indian upma was right on. The veggie burger is g","useful":0,"cool":0},"XxAJ2HaUGHTSZm8mYG45mQ":{"text":"Don't leave this page without looking at the menu. Hands down, no contest, favorite restau","useful":0,"cool":0},"VC9HU8txpli48H5-9oQNIQ":{"text":"This place is wonderderful and KP is magical!\nThis is the earliest vegan restaurant in New","useful":1,"cool":1},"hH5OJdFQHICwoErvGjaYSw":{"text":"Stopped here for lunch with my friend a couple days ago and can't wait to go back again. W","useful":7,"cool":7}}