{"akeakg7Z98g24oavjU8vrw":{"text":"Took a 5 minute, 1.5 mile drive and was fraudulently charged $75. Don't answer when I call","useful":1,"cool":0},"Mv3srIZsMn-Ojfqv-ActiA":{"text":"before coming to NOLA I was freaked out bc I saw all the horrible reviews on taxis, shuttl","useful":1,"cool":0},"jTIjvmKRmfDWkTBqHUZphw":{"text":"STAY. AWAY.\n\nThe whole ride I thought we were either going to crash or I was being taken s","useful":1,"cool":0},"r_LfoDmWbKqmconoOoaZog":{"text":"We took this taxi from the New Orleans port cruise terminal to the airport.  I specificall","useful":0,"cool":0},"izaLHRWVCtCss0Y3H4_osA":{"text":"Girlfriend left her purse in your car with her passport in it. Her name is Meredith and pl","useful":0,"cool":0},"X1PuSP5rjv2CYfGeAhxeCA":{"text":"I just took a cab ride from them on the weekend for 4 blocks.  It was supposed to be $6.  ","useful":0,"cool":0},"HAWZ9Og-QtWfNJQllSRpOg":{"text":"Terrible. We tried to catch a cab home... which was around 20 minutes away. He would only ","useful":0,"cool":0},"CFenTaCe_jTyoVCqdar_sw":{"text":"Very nice driver, quick, and cheaper than United. Hailed him in the French Quarter as anot","useful":0,"cool":0},"hdG1lr7rS2mgGQlJxax3Pg":{"text":"We had an unpleasant experience last night.  Our bellman found a cab for us from the stree","useful":2,"cool":0},"bJARoOspAYOdsCPZcMcjSg":{"text":"One of the worst cab experiences I have ever had. The driver was rude. He barely spoke Eng","useful":2,"cool":0},"ByGLzVii79RyhjaGoc9kWA":{"text":"Took a taxi from The airport to the French quarter today. The man at the taxi line pointed","useful":0,"cool":0},"5I6aZ68Dq20BF4mDOErL4A":{"text":"This company is terrible!! I recently took a trip to New Orleans and they charged me $15.0","useful":0,"cool":0},"nP-ytNxUrP8jsDDF9MoIgg":{"text":"4am pick-up, driver was there 5 minutes early. Very pleasant, personable guy. Would defini","useful":0,"cool":0},"iEpbOcuuY2XZGeGrAoFU2w":{"text":"Maher R. was our driver and he was so patient and a really courteous and safe driver. Of c","useful":0,"cool":0},"AlLeeMsb52zo3FwYCBOwPA":{"text":"Kahled was a great driver he returned lost property to us after a late flight. That sort o","useful":0,"cool":2},"5C2FDQBYyjArz4gXFCar8Q":{"text":"Cab 1350 stole my husband's phone tonight.  He left it in the cab and we noticed immediate","useful":1,"cool":0},"FoJa7-XgJPh9QJeTNNgV0A":{"text":"I was standing with my bike on a corner that is NOT a cab stand and driver 0906 drove up i","useful":4,"cool":0},"mB7B3IQodPrMto8HIam5ug":{"text":"We used this company when we arrived in New Orleans. Our driver Lou Joseph drove us to the","useful":0,"cool":0},"g3FmouDRYOt4RU9w6mNJ5g":{"text":"No stars . Crappy telephone manners- my husband wanted to call them back and cuss them out","useful":3,"cool":0},"uxR9w3V7gd7uVCmGNUh1ag":{"text":"Cab driver almost hit my girlfriend in the crosswalk then threatened to shoot me last nigh","useful":2,"cool":0},"_q20Mq61O89c-gexRHYWEw":{"text":"If I could give -5 stars I would. I'm from out of town and waited 4 hours for them on the ","useful":1,"cool":0},"zfusCj9JoaLXO7PIP93i8Q":{"text":"I wish I could rank them lower than a 1 star. \"Credit card machine was broken\" when in fac","useful":2,"cool":0},"9lsqs04o-CogpZ06Djnw2w":{"text":"We took the taxi from New Orleans to the airport. The rate is a flat $36.00. Taxies are al","useful":0,"cool":0},"eWf5vP13pF6Rmr6YtYfHmg":{"text":"Guy tried to screw us over and refused to start the timer. Instead tied giving us a flat r","useful":2,"cool":0},"N_Pf15tCgCFo0eIFimnTHQ":{"text":"American Taxi Car #1517--on Saturday, July 7th at 5:10 PM on Notre Dame St. in the CBD. I ","useful":0,"cool":0},"4nPS6jFAd26IAt9xq2mWxA":{"text":"We took this cab to the hotel from MSY airport... The driver flipped out when I didn't hav","useful":3,"cool":0},"HzSfZe5adPIGtoH_EUOupA":{"text":"Totally unreliable. Do not use unless in dire straits and even then make sure you have at ","useful":1,"cool":0},"gDlvQ77QBLzbxw1giSRmTA":{"text":"Thanks so much for confirming a cab would be arriving in 5-10 min and not showing up! We w","useful":3,"cool":1},"HEgwLnOLnNpX0BLeAVru4Q":{"text":"While my husband and I were visiting the Maple Leaf Bar, we grabbed a ride with American T","useful":0,"cool":0},"4Yhrt_-pbu58Uri6V1T6bg":{"text":"I left my phone in the cab and realized it 2 hours later, I called my phone and the driver","useful":2,"cool":0},"Hm_WbYZHneXnTS6EEUUvHQ":{"text":"Oh my God! I had seriously forgotten about my experience with American Taxi until John's r","useful":5,"cool":2},"AnQEhmsjft2_B8TqJa7ncg":{"text":"If I could give -5 stars I would. I'm from out of town and waited 4 hours for them on the ","useful":1,"cool":0},"nyJrZnlar5uD8lrQqovYlQ":{"text":"Zero stars.  I would give them a star minus if I could. AVOID AMERICAN TAXI.  The driver I","useful":1,"cool":0},"QisGNkFoovhkPrIfckTPxw":{"text":"Scam. Took an American Taxi this morning from the Hilton Riverside to the airport. Upon ar","useful":0,"cool":0},"XPnr_tUkOJSjr3nCZDR_MQ":{"text":"I just witnessed an American Taxi driver hit another car. It was clearly his fault.  He pu","useful":1,"cool":0},"HBhol6FZ0g9WQTMVfSKHRQ":{"text":"Fine experience. Nice van. Driver didn't get out to help me with my bag at pickup or at ai","useful":1,"cool":0},"sn-W0lcnwlkboFxn4YHb1g":{"text":"Watch out. Know your route because their drivers will take you WAY out of your way to boos","useful":1,"cool":0},"UAD0FHzzJykMzSIvv5ltww":{"text":"Flew into New Orleans on July 4th looking for a taxi.  We were greeted by a nice young lad","useful":0,"cool":0},"j1ZZ5J1Tit1F7HzHvs73_Q":{"text":"I was recently on veterans Boulevard in Metairie Louisiana. Traffic was very heavy in all ","useful":4,"cool":1},"OevwVU8vfADDL-51k9KNtA":{"text":"Our cab driver Shamen Isidore totally ripped us off. Charged us twice the going rate claim","useful":3,"cool":0},"dqDpurrwMwhIBHtsEgyTYw":{"text":"Worst service ever ! Left a jacket in the cab on accident because the cab driver told the ","useful":0,"cool":0},"rZFOGNjnPL-LqBBWGWNBLQ":{"text":"Tried posting a review on this company twice and both times my review has been removed. Ap","useful":5,"cool":0},"3AlHDiofe_mn96paddpM4w":{"text":"Went above and beyond! The driver (a lady from Haiti whose name started with an L) was ple","useful":3,"cool":1},"4L1dTsofFx4VvZh8vLqGFg":{"text":"This review is for an American Taxi driver.  His name is Mousa, and he drives Taxi # 0567.","useful":0,"cool":0},"-ESlw8Go0mHnvS4_axIXCg":{"text":"Avoid this company, and if as another driver you see them on the road, be very careful. \nT","useful":2,"cool":0},"lW0uUlcoSS1V0M508t75TQ":{"text":"do not take this cab service. they will rip you off!  i took a cab with my pregnant wife f","useful":1,"cool":0},"cis8lA59fZ4o1d0j_NRWzA":{"text":"I took this cab company at an early morning hour from a hotel.  #255.   She didn't turn on","useful":0,"cool":0},"1CzxRiPBDmVjX2KcrBpCEA":{"text":"Cab 0908 refused to take us uptown from the Superdome. This stuff is why Uber and Lyft hav","useful":0,"cool":0},"XRGQpPrXBz6C2xVn9aWf0Q":{"text":"I took this cab from the airport and gave the address to the cab driver. He went to the wr","useful":0,"cool":0},"cOLsWs3fu90SE0zi2qjuuQ":{"text":"American Taxi is awful. Every time I have ridden in their cabs there has been some issue r","useful":11,"cool":6},"bAR2Cf4SE-NCBXt43wRAHg":{"text":"I had a great experience with Moussa. Clean car, fast trip to the airport, and was 15 minu","useful":0,"cool":0},"GGtqYKv777MxzbWoGPyczg":{"text":"Was straight up flipped off by driver of 1574 and told by dispatcher that he owned the com","useful":1,"cool":0},"iRDxiONQ8zYTzHYjLAQ_Uw":{"text":"I took a cab from apple barrel on frenchman to 2317 north rampart st. A distance of less t","useful":0,"cool":0},"YSEhE4uunBZbwEJQZLacxg":{"text":"I would give zero stars but its not allowed on yelp.\n\nCab #0818 should not have a license ","useful":0,"cool":0},"amOyqpLxcVZ65ufaO92UCw":{"text":"At approximately 9:30 this morning American Taxi cab driver in 1505 ran me off the I-10 We","useful":0,"cool":0},"xk7MuWcMLyFt0peYWbVa_w":{"text":"Lost our backpack in one of the cabs on a Friday night. Tracked down the cab number throug","useful":2,"cool":1},"d2ZBuzRxSedpCdDQH6HIJw":{"text":"We are unfamiliar with taxi use and we were visiting New Orleans and they took advantage o","useful":0,"cool":0},"CauqwP4diS6mcdYKMdL89A":{"text":"Cab 0240 picked me up as I was walking to my Airbnb. He had me sit in the front and didn't","useful":1,"cool":0},"_2UZGo82W03E2pvdCGKWUw":{"text":"FRAUDULENT COMPANY! Claimed my credit card wasn't scanning so I provided another, which he","useful":1,"cool":0},"jtXybRwik5Bi66sJ7BFWsA":{"text":"Unreliable and/or non-existent service. Completely fed up with American and other local ta","useful":0,"cool":0},"Ygt6yISV309VIipkPKqSRw":{"text":"We took a cab from the airport to Metairie. The cabby was pretty nice and tried to spark c","useful":3,"cool":0},"jMHmiALde243aHxH5cc0kQ":{"text":"I just sent this complaint to the Mayor's office after almost being run down by an America","useful":1,"cool":0},"F2E5m9MDh_xwYIrKTVGzRw":{"text":"I write this review feeling very humbled, yet inspired at the same time. I never really un","useful":0,"cool":0},"KVKqrzuqtPFElWqk7XfdBg":{"text":"While driving home to New Orleans from Metairie, driver 0202 sped past me veering in and a","useful":0,"cool":0}}