{"aMG-zkqhmGwd9Y4ztYYMkg":{"text":"Old Absinthe House is a New Orleans icon, and I agree with other reviewers that it is a re","useful":0,"cool":1},"1BVs9z4pW2qF4cmVZB5_9w":{"text":"Dark and dirty....with a cool vibe.  The absinthe was very pricey....go to Pirates Alley i","useful":0,"cool":0},"tjTj2xK0lMDGV7lZQLUPJA":{"text":"A chill, Day Drinking Spot!  They have Coors Light and a Jukebox!  Shifting gears for the ","useful":1,"cool":0},"bVe2vhYlzo883V7k-jAXMg":{"text":"Got super excited about this experience . I had not had this drink properly concocted  lik","useful":0,"cool":0},"KcAlOucRxYl4v5D3W4H1kg":{"text":"On our first night in NOLA we decided to stroll along Bourbon on a Sunday night.  For Bour","useful":3,"cool":3},"I9L2Skhrj9HZO8lcQADAUQ":{"text":"Stopped here for our last drinks in New Orleans before heading to bed for an early flight ","useful":0,"cool":0},"DSKb-0eqHfZJRx0hsQRsgg":{"text":"First, the Bad:\n\nThe place is touristy, the beer selection isn't good, the liquor selectio","useful":0,"cool":0},"69dLKx1iX8isNWSCrHZ6WA":{"text":"Don't go! Went last night (3 locals) and had the worse, most overpriced drinks eva! Been t","useful":0,"cool":0},"ODL8-slPbTNGeLroLEvRww":{"text":"We came here for the Sazerac, believe it or not! The absinthe drinks run about $20 a pop, ","useful":0,"cool":0},"JPYuhHE-5PgcES0WIqfb6g":{"text":"Madcrazy overpriced.  Filled with typical Bourbon Street nimrods.","useful":0,"cool":0},"kkHA1sbeM19BvscrKtDgyw":{"text":"Cool bar.   Just a low key place where you can have a drink.  Bartenders are really friend","useful":0,"cool":0},"iDFNMm9GHu5OvUpV2ANGgA":{"text":"This is my second visit to the old ab house. The first time was definitely memorable...in ","useful":0,"cool":0},"IJsW6QWx39pILkVRu7cKDA":{"text":"Skip it. Out of ice in august? Bartenders beyond slow and unpleasant.","useful":1,"cool":0},"-3UgsrfSJEHtkIcNG7o_tw":{"text":"Had  a delicious and extremely strong breakfast hurricane here, it was a cool old place to","useful":0,"cool":0},"KewiqpiC5qGl_pAYbYGZ0g":{"text":"I'm not a very huge drinker but in New Orleans, it is so ingrained in the culture, and lik","useful":0,"cool":0},"DpkFO5cQMOcRHLr-hqfzvw":{"text":"I went there back in April during Jazzfest, me and a few buddies just went bar hopping in ","useful":4,"cool":3},"xbW1eB8Zp32mxAsVNOARzQ":{"text":"It's basically what everyone has said. \nIt's a dark dirty grimy NOLA staple. Service is us","useful":2,"cool":1},"J6GPs0pEfDrOrKed_ML0Kg":{"text":"At first glance - nothing special vs other bars on Bourbon.  But then - I spy a couple get","useful":1,"cool":0},"QvsdDHZQjRxC0bZIUyhD4Q":{"text":"Hole in the wall bar with a fireplace and popcorn machine right on the corner of Bourbon a","useful":2,"cool":2},"KmIIoKs0G1XO-wkN328RNQ":{"text":"So this is also one of the oldest bars in Louisiana. Lots of famous, historic people have ","useful":4,"cool":3},"sh6v5o30qh551iyV4OIoRg":{"text":"15$ Absinthe House Frappe. \n\nI understand the liquor and the mysticism and everything behi","useful":0,"cool":0},"2JUyJEKkRfjvEFs0hXu2GA":{"text":"While absinthe is not something you'd drink (or should) drink on a regular basis, this pla","useful":0,"cool":0},"GW8VC-O8nzHtw0Nr7EX7hg":{"text":"Seem like a nice friendly place I didn't only had a drink a the front bar and it was early","useful":0,"cool":0},"B7La3QW7Zg-SyVeQAvhusA":{"text":"My experience at the Old Absinthe Bar was unique in that the bar was DESSERTED. My mom and","useful":4,"cool":2},"94_aoL0BBYCLt2qqL8kFww":{"text":"The Old Absinthe House is a dive with pricey drinks.  This would be ok if the quality of t","useful":0,"cool":0},"utTeZc5CY5c5y7gPsQu_Hg":{"text":"Awesome bartender dope spot in the midst of a not so impressive Bourbon street \n\nTried abs","useful":0,"cool":0},"Cud8myEXWS3Um_p2PXy_uw":{"text":"Really enjoyed our Bloody Mary's and the waitress was...fairly friendly. But, there's a bi","useful":0,"cool":0},"Zfsy9-Sw0q5S3sSVmp0zbA":{"text":"If you are a first timer in New Orleans and wanting an Absinthe experience in an old New O","useful":0,"cool":0},"FXnGXFPTODbs43QmNzUOqA":{"text":"I want to give this bar more stars, but it gets a little lost in the hustle and bustle of ","useful":0,"cool":0},"6F6E3rH848Q6b6MZtwiH5Q":{"text":"Was expecting to get a cocktail with absinthe in it, but even their Sazerac doesn't have a","useful":0,"cool":0},"Nad48qwzJYWTEZetGea_GA":{"text":"The variety of character in the diff establishments right in the middle of a major tourist","useful":3,"cool":1},"B4dsPHYPeL2zycU5TzPv9g":{"text":"Just slightly off the main strip of Bourbon, The Man and I casually walked in here for a m","useful":10,"cool":9},"9d8hPGFPq4Ga0AhcbTlsdg":{"text":"Really cool and chill atmosphere specially to be right off of bourbon street. Only thing i","useful":0,"cool":0},"bCCnWF1y4Vw9BQ4MyG1kiQ":{"text":"I would consider this a must see bar in New Orleans. It is allegedly the oldest bar in the","useful":0,"cool":0},"633ougmC0kv5GArgVjeg5g":{"text":"The bar has a good vibe.  Old and new business cards cover the walls and (very dusty) foot","useful":0,"cool":0},"78pTQpho91Gj4S9aWIbs0A":{"text":"Stopped in for our last stop of day drinking and by now I have learnt - alcohol ain't chea","useful":2,"cool":0},"y8lPhZtDR7UbFQ3D9OpwNA":{"text":"The best on Bourbon St.\n\nThe atmosphere here is completely different than the rest of Bour","useful":0,"cool":0},"ENEA5Y8l2sY1plagrwTz0Q":{"text":"Great place to hang out. Don't bother getting any absinthe - I was warned away from what p","useful":2,"cool":2},"qyVyCc2F90A7O3P7hggQJQ":{"text":"I like this place because it's right on street corner in heart of Bourbon street. Their ab","useful":1,"cool":1},"WSQK7kEMFlu0hdkGRG9IiQ":{"text":"I never tried absinthe.  The great-dressed bartenders knew the product inside and out and ","useful":3,"cool":3},"jhDHCOUvy09O3qqP8oBjRw":{"text":"Bar.\nA good dive bar for quick drinks. Their Bloody Mary is really tasty here. The bar is ","useful":1,"cool":0},"HhUOA6QSng_eU6QSV6US5Q":{"text":"They have specialty cocktails and it's Bourbon Street.  I'm not sure where you can go wron","useful":1,"cool":1},"iVeOy1XW_LFtcFjVPrjhGA":{"text":"I'd give less stars if possible. \n\nCame for the experience and rude bartender couldn't eve","useful":2,"cool":1},"yPdTQ0OCk2l0STimRRfAiA":{"text":"Finally made it here after all these years. $30 for 2 weak drinks by bartenders who could ","useful":1,"cool":0},"NWByiLhcNCSQHTJnN4J5GQ":{"text":"Only reason for a 4 is I probably need some food on the menu - it's a great bar   Famous f","useful":0,"cool":0},"RuyqkxwuqPugmm4t4BbLVw":{"text":"I really liked this place. It wasn't too loud any time we went. The absinthe is GREAT and ","useful":0,"cool":0},"vD5zHArL6ULRdPUd6dPiyg":{"text":"if u wanna party the right way stop here 1st off plane get a couple absinthe shots in they","useful":0,"cool":0},"zyK39wUZrhpO5yA-TildUg":{"text":"Jean laffite's blacksmith shop is one of our favorite places in New Orleans, due to the af","useful":2,"cool":1},"LkD0RH1Rz3oc5RQairwR_A":{"text":"Really cool bar. Did not drink absinthe like my friends but enjoyed searching the walls of","useful":0,"cool":0},"CcIq-hqkoMYO9TBeZZDboQ":{"text":"Typical Bourbon street dump.  Lots of better choices even on Bourbon O, street.  the smell","useful":1,"cool":0},"8ZNEKkObsgQuMoIoRCHsOA":{"text":"Great place to drop in and grab a drink.  I've been coming here forever.  Great place to c","useful":0,"cool":0},"xghLTBSI8huOk2x_4D-H0A":{"text":"Looks like an oldest bar around bourbon street. If you love absinthe, you should give it a","useful":0,"cool":0},"f4C4n1f3Bt9TinwCm9YjeQ":{"text":"Cool dive bar.....vintage football helmets hanging from the ceiling, business cards lining","useful":0,"cool":0},"TyU8Cl10phj1DPTdxVoc7Q":{"text":"Went there last night,my beer was not good coming from the tap of Coors lite. But,my wife ","useful":0,"cool":0},"pg_0rA7AIK1vG4p3Nq2LBA":{"text":"Rude server, weak, pricey drinks. Go to Laffite's blacksmith shop instead-- better ambianc","useful":1,"cool":0},"EBHGWsuiXCghy4QyoiedcQ":{"text":"Lots of locals warned us not to bother with Old Absinthe House; they said it was touristy,","useful":1,"cool":1},"WMbMt9wo9fpd-Num1Ock8w":{"text":"Terrible service. Only the barback around and he just kept staring without explaining wher","useful":0,"cool":0},"KUSvj-HYjnPyDnybZrww7w":{"text":".  I have been coming here for many years.   I love absinthe and they have a good variety.","useful":0,"cool":0},"1olnRDGMiny6kKoMQNQlOw":{"text":"Is it old? Is it a dump, that looks as though the entire building could collapse, at any p","useful":0,"cool":0},"sI2GZaYSxWukpffHn2Yk1A":{"text":"I went to New Orleans with a couple of friends over the first weekend of November 2013. Th","useful":0,"cool":0},"NV5x6X8DC5Or5ir-rAmCfw":{"text":"The bartenders should know the drinks! I ordered a mint julep, but ended up with bourbon o","useful":1,"cool":0},"9xXmn_WUEjdtb1ODqi0kHA":{"text":"absinthe...yummmm...fireplace for the cold nights...the rest is like you read already...ex","useful":0,"cool":0},"1k85nSmR2MDJq2aWvsu4Cw":{"text":"Last time I was in New Orleans, absinthe was illegal and we had to make do with Jagermeist","useful":0,"cool":0},"3c-QuWvCmvdsMROSpg0qQw":{"text":"This is a very good place.  It is in the \"Red-Light District\" of Bourbon Street and is a m","useful":0,"cool":0},"fGF1mlTRFyUi6uF0DFzuFA":{"text":"Fun little place, although I like the Pirates Alley a little better.\n\nI am an absinthe nut","useful":1,"cool":2},"xVn5gJf8Buz8iMYKfTeLIA":{"text":"The drinks are not that great if you want a \"proper\" cocktail go to Fat Tuesday (kidding a","useful":0,"cool":0},"bVoisQUVbeWgizgdUF3Crw":{"text":"This is where everyone local seems to meet up after a nice looong lunch in the Quarter and","useful":4,"cool":3},"hPnzRPRJZjr8jKKDZdaB-Q":{"text":"Ordered a sazerac. The atmosphere seemed chill but I was quickly put off after being requi","useful":2,"cool":0},"Dt5bMFIle2jUYJduy7TqQQ":{"text":"Touristy and divey. Yeah, it is that. But Old Absinthe House had something that I was sore","useful":4,"cool":3},"LRkdoUTH2qmFJ5pZRH-N5A":{"text":"Let me preface this review by stating that I hate Bourbon Street. It is loud and smelly an","useful":0,"cool":0},"3vHccjFbtvK__gldZtb7XA":{"text":"Came here for their signature absinthe drinks.  Service was slow drinks were good I had on","useful":0,"cool":0},"pICJRcyqW1cF96Q3XhLSbw":{"text":"We went a month before mardi gras season so it wasn't packed and had a great time at this ","useful":0,"cool":1},"bM4U3KNFZ0Zh7QJ31S9WZg":{"text":"This is an above average bar on Bourbon street if you are OK with the format. They do not ","useful":2,"cool":1},"qYVdyVcVDpkNjWgFC08hBg":{"text":"Good booze.. way more casual than we thought it would be. When a place writes about their ","useful":0,"cool":0},"-Lb0WxLZB2K6heMhsvpVoA":{"text":"Our favorite stop so far in NOLA!  Drinks were good, awesome atmosphere with the doors ope","useful":0,"cool":0},"Zno564wU-mu3I5i8Ihh9jQ":{"text":"Looking for a cool place to observe the antics on bourbon st? This place is great. Pimms c","useful":0,"cool":0},"ATAcjNSAbmwPVI60AcRdhQ":{"text":"Likes: delicious drinks, open bar stools, playing the NFL games, and free popcorn.\nDislike","useful":0,"cool":0},"5LxZq1mESVKHWN5dSMem2w":{"text":"The only thing that keeps this from being a five-star review is the prices.  I didn't indu","useful":1,"cool":1},"pwJ6OwbHTa7SqUZspR0FCA":{"text":"Old Absinthe house is a great bar, with a lot of awesome history behind it.\n\nThe interior ","useful":0,"cool":0},"79FrCST-lqXnGWgYHN8LsA":{"text":"Our initial greeting by the bartender was so rude and the prices were so inflated, we didn","useful":2,"cool":1},"XJSofujl67Fo5VdH4_twgQ":{"text":"Good Bloody Mary, strong screwdriver, and a willingness and ability to change a TV's chann","useful":0,"cool":0},"z7sZ3q36rUZ04op6n8akog":{"text":"k, so I saw this on another reviewer's reviews & had to put my 2 cents in.  Like a fellow ","useful":4,"cool":1},"vpWxbOzE-Mf4QXTichsYeg":{"text":"One of the regular hangouts on Bourbon Street.  My friends and I came here thinking it wou","useful":0,"cool":0},"9O7ryyO4ruLpykBcB45Ifw":{"text":"A great old joint in the French Quarter. Jess was a great bartender. Had the absinthe. Our","useful":1,"cool":0},"BDq0Fug1cRa5tXTjy9EZ3A":{"text":"This place is great!!!!! I guess the bad reviews came from people looking for a 64 ounce 1","useful":0,"cool":1},"YqSY_y9HjTG3trYS1erdsA":{"text":"Attending a vendor party on the second floor of this quaint place.  Food was superb.  We h","useful":1,"cool":1},"4RCAqKAQo91T6bs27dbJ_w":{"text":"The staff was there to work, that's understandable, but there was nothing beyond that. The","useful":1,"cool":0},"cK4D7owtKtDAAHs5rOuF4A":{"text":"Still awesome after all these years! It's in the WORST (or best, depending on what you're ","useful":2,"cool":2},"rDAJ98uE6YADaKNo3FjWlg":{"text":"My kind of dive bar. Loved the ambiance. I'd say this is a must stop on Bourbon.","useful":0,"cool":0},"-DpP1cxCWAyYMSdcVVjj4g":{"text":"Really . . $20 for an Abita beer and shot of Jameson?! If we had been in an upscale lounge","useful":2,"cool":0},"LEu0VCLKOYQvnE9aMF3MeQ":{"text":"Loved the location, the building, the scene.  A fantastic place to enjoy a happy hour!!!\n\n","useful":1,"cool":0},"e9xdtv7lN0iOVy9zsEtPIA":{"text":"Love the old school helmets hanging from the ceiling. The bartenders are very knowledgeabl","useful":0,"cool":0},"XirOKrlBpDz0LEbpy6FnSw":{"text":"One of the most over rated bars in the French Quarter. The corner in front is always busy.","useful":1,"cool":0},"VA-O1AEBeAEk9GcUFmQ0rA":{"text":"I stopped in for some refreshment as that southern sun was leaving me a bit parched. I sat","useful":0,"cool":0},"nhFLLZLk-9UOgTIqTunHxA":{"text":"Went here for a last single drink with a friend, his dad, and party before he got married ","useful":0,"cool":0},"nkDwS4F7lM7xlj5TNAFjRw":{"text":"This became a regular Daytime Stop during our Nola Trip, just like home for people who lik","useful":0,"cool":0},"854ctzOVgvtTstKpaHXRwA":{"text":"I've only been to New Orleans a half dozen times... That being said, with all of the hundr","useful":0,"cool":0},"IarHGo1z2BdefR0bySJcog":{"text":"i come here every time i come to new orleans, i love absinthe. also, the bar is just cool ","useful":1,"cool":0},"3x-oKFm__F8rGcdyYHv44g":{"text":"We come here every time we come to the quarter. It's one of my favorite spots.  \n\nThey mak","useful":1,"cool":0},"l3lcujYqvJMjt6U1OAk6-w":{"text":"While the prices are high, being able to try various absinthes is really worth it. For the","useful":0,"cool":0},"lUPtImMkUam-1GqBmdm_ag":{"text":"They charged my credit card twice. When I called multiple times they had the audacity to t","useful":0,"cool":0},"0BHIBgxuX9mk-34uCVDDQg":{"text":"The only good thing is the fireplace. Watered down drinks. I asked for a rum and coke. Ask","useful":0,"cool":0},"In7NwwQZFMiKXsmr_nrdjQ":{"text":"We chose this bar because of the history associated with it. It was not in evidence. The b","useful":0,"cool":0},"8-BPIgcyW3tlAy6VRCwKOQ":{"text":"Melody is amazing!! Very knowledgable bartender with a great smile and awesome drink sugge","useful":1,"cool":0},"Gtv59bXuD85I3j43RMao1Q":{"text":"The drinks are good and the beer is cold. It is a great place to people watch. Try to get ","useful":0,"cool":1},"iC4iHSYcrW7b8EjvD2-5fQ":{"text":"Really really snotty bartender. Complete with eye rolls when I asked questions ! I know th","useful":1,"cool":0},"CI_71aWLb1CgtPuxwIoCZg":{"text":"This place gets extra points for having fireplace. It adds a certain class to the dive bar","useful":0,"cool":0},"kxo6V9goaZfm_3M2xHcBsA":{"text":"I would love this place if a few things changed but currently the cons outweigh the pros t","useful":1,"cool":0},"-0TFKMwctpd1NjB-PkHxnw":{"text":"Stopped in while in NOLA and wandering the French Quarter. It certainly has a lot of chara","useful":0,"cool":0},"Z9yVU4IyXtfljUUWR7ShCg":{"text":"This place looked cool from the outside and the inside, but was ultimately a rip off.\n\nI d","useful":0,"cool":0},"veol3iV10Dnl8MR5Lr8lXA":{"text":"This place is pretty okay. In town on business and stopped in since it was the only reason","useful":1,"cool":0},"c24GykGU3oY_TiW5x-lbiQ":{"text":"I have a hard time rating this establishment since the bartenders were great. Both the lad","useful":5,"cool":0},"AcJN_gToohDUD18DFtgEWQ":{"text":"Great old school bar- always a stop when I go to town.  Drinks are a good pour and the peo","useful":0,"cool":0},"iiDHRDBdGVlxStCFx0M5Ug":{"text":"I didnt get any absinthe so this rating is for the bar aspect of this place. It didnt real","useful":0,"cool":0},"DlZ4CtrCrxJ7kKvLLoYFDA":{"text":"Simply put.....I would not come back with this poor service. We sat down directly in front","useful":0,"cool":0},"Taq-b4JRPtOQfD4gU8roig":{"text":"I stopped in thinking I would grab a nice dinner at a historic restaurant. I had the filet","useful":0,"cool":0},"oky4MrgWJUZsS6E3V9lLfg":{"text":"We stopped here to do a little day time drinking to help pass the time. Upon walking into ","useful":0,"cool":0},"KTN4ypR_ni_kS5uO8U_H-Q":{"text":"Went and tried the absinthe frappe and it was pretty good. Truthfully I went here because ","useful":0,"cool":0},"hzbP187iKrECoGXC9pr2EQ":{"text":"if not the oldest, one of the oldest bars in New Orleans! Such a cool experience to have h","useful":0,"cool":0},"w3MolvB5HJSlgAkh-Cstng":{"text":"This place was our last stop and I wish we would have found it sooner. Great atmosphere an","useful":0,"cool":0},"e34i5i5rue83khfPNFKP0A":{"text":"Bar is ok nothing special....\n\nThe decor is a bit cheesy and it's so old it looks dirty. I","useful":0,"cool":0},"fByiaMTRxHOHE4i94XTlQQ":{"text":"The only reason this place is getting two stars is because of the architecture and history","useful":0,"cool":0},"3S8_qmKarWgc23zlnJsSfQ":{"text":"Um. What to say. Well, on the up side, it's in the French Quarter. On the down side, the w","useful":0,"cool":0},"0Ms1_Vs85OLjuwre2pqiUQ":{"text":"I don't remember a great deal about my time at the Old Absinthe House, nor did I sample it","useful":2,"cool":1},"4AwuH9DiE9Ef3jEhB8261g":{"text":"Famous place so we had to try it! I got the Planter's Punch which was good but not very st","useful":0,"cool":0},"hn41Mn0ZmSomZ3eoMEj3ow":{"text":"Typical bar on Bourbon with a very impressive clientele.  Presidents, famous authors and n","useful":1,"cool":0},"xozoFUBtmJrf_P-2a4Z6eg":{"text":"Come here for a shot of authentically prepared absinthe if you dare!  It's kinda a bucket ","useful":0,"cool":0},"Uf9q6J5jSk_95W0lP7t2dg":{"text":"Planned on going here for the whole absinthe ritual, with the spoon, sugar cube, and water","useful":0,"cool":0},"_PPHJue37fwiIwrUqg31fw":{"text":"This place was the second stop on Bourbon while visiting New Orleans for Mardi Gras.  Me a","useful":0,"cool":0},"Zjf_osV5s8SHg66g_QgY_Q":{"text":"I would give no stars. Waited for 20 mins, flagged the waitress down. She ignored our grou","useful":0,"cool":0},"anCXIpa1HJQi0PRb0WdN3Q":{"text":"Awesome bar, but very old and kind of smelly. Definitely a dive bar, BUT you HAVE to go to","useful":0,"cool":0},"IqcIsb_uq2SOU42jqq9HfQ":{"text":"ehh a tourist trap better places to drink","useful":0,"cool":0},"OfdpS3xdu29EZ76950ak1A":{"text":"My husband got the Pernaud Absinthe, and he really loved it.  The bar has so much history ","useful":0,"cool":0},"E1v58vhbyqBTBAhVfO_M6w":{"text":"its like being transported to the past. Old fashion cocktails, the bartenders dress the pa","useful":0,"cool":2},"V4nh66Zb9zZbAdMA0A_cQw":{"text":"I came here expecting to have some fun , it was a rainy day so we stopped in. I asked for ","useful":0,"cool":0},"OmEHOQlG64WGZJ52cOZjUg":{"text":"This place is fun and has a very interesting vibe. The bartenders are really nice and they","useful":0,"cool":0},"A63IVMTY593KE2XsoeA9cw":{"text":"we really liked this place and so did our friends.  we went on the recommendation of a fre","useful":0,"cool":0},"TGSu80FJUbngeYC1nGSs8w":{"text":"Cool place to hang out. Many different types of absinthe to try but shots are pretty expen","useful":0,"cool":0},"KhsZP5A-SiR2p_eNU9Eb2A":{"text":"I was wondering around by myself on a rainy day of our group vacation and I ended up passi","useful":6,"cool":6},"7euT5o7AkDr0UPXUGvJXqw":{"text":"Hard to rate cloudy memories from the early 90s, but sometimes you only remember how an ex","useful":0,"cool":0},"3-Gy1yog0Lm5ocrLghVNGg":{"text":"Cute little dive bar. Went twice while in NOLA and enjoyed the ambiance. Tried a few new d","useful":0,"cool":0},"r3o_CTdKtc2jKIPznNpRLA":{"text":"I was there both last Friday and Saturday and would make this my bar on Bourbon Street.  W","useful":1,"cool":2},"aEZmDZf2QoQguQ4xJgkP3Q":{"text":"Generations of grit await you, nice casual dive bar right off Bourbon street.  Beer and cr","useful":0,"cool":0},"Yfw3DEqBUCNvKvqvvpiwjg":{"text":"went in with a group and walked out with twice as many of us. but - that could be that we ","useful":0,"cool":0},"EmLiJ2ejOw3frM5PcQaJqQ":{"text":"I came here for one reason and one reason only: the Ramos Gin Fizz. \n\nA highly respected c","useful":0,"cool":1},"-Zwr2XYLcZkd7I1wg8GYLw":{"text":"Yep. It's a bar on Bourbon, BUT it also can be a calm respite from the street. \nYes there ","useful":6,"cool":4},"ecR7ZZLQptsBh8TsSSuGQw":{"text":"Very cool place...chilled here after a Voodoo Tour. Limited seating inside, and a few tabl","useful":0,"cool":0},"lGwIZPE5WqFnwrCNW1BDvA":{"text":"We wanted a traditional American Absinthe experience and was told this is the place to com","useful":0,"cool":0},"LuaSoQpesJc0OffVL0xkhg":{"text":"We came in here on a Thursday afternoon and the first thing we noticed is that the beer wa","useful":3,"cool":1},"FeTTUY9HrqLUVWsCGXBGSQ":{"text":"Cool spot on Bourbon Street without being too \"Bourbon Street-ish.\" (meaning no test tube ","useful":0,"cool":1},"BhM2dmTTmxqROiPEAFGrHg":{"text":"Heard from my bartender:\nWe open around 8am. When you're hurtin, just come over to the Abs","useful":0,"cool":0},"haoqz9ZkdK8VxyrEEdNwqQ":{"text":"First time in New Orleans, one of our friends recommended this place. Interesting atmosphe","useful":0,"cool":0},"mmrhqdeiazj4ZOLVqEFATA":{"text":"I loved this place.  We had several orders of different types of absinthe.  That was inter","useful":0,"cool":0},"_CNSywJCgcCDC2VwmsnEmA":{"text":"It's old.  On cold days, it has a roaring fireplace in the back.  On most days, you can fi","useful":0,"cool":0},"Lv76UHKcrtHVikPR0-xNWQ":{"text":"Absinthe is a bit of an obsession of mine. The Old Absinthe House is a historical landmark","useful":17,"cool":8},"oWKKYh1DhTyAK75VbaoTEA":{"text":"The craziest mix of sports bar and old time tavern.  LOVE.","useful":1,"cool":0},"DLrHiYfOu5RNy3gbx0-1aw":{"text":"I was incredibly disappointed with this bar. It was my first stop in New Orleans on a Thur","useful":1,"cool":0},"RwZ1_jJgWmQYvlhj1LH-fA":{"text":"Do not go here. They will double charge your credit card. Just a ripoff. Staff is horrible","useful":1,"cool":0},"adJiipSMLb2iH2_ga-GjMg":{"text":"This place is under new ownership and prices have skyrocketed. Locals are defecting to mor","useful":0,"cool":0},"cssq4QzoSW120p9FhKZOhg":{"text":"Fun bar. Good drinks. Nice ambiance. Well stocked bar of top shelf selections. My buddy li","useful":0,"cool":0},"HpXh3OyMe02aOR8F64VMFg":{"text":"Fun absinthe menu! Bar staff was not friendly and acted as if we were a burden. Cocktails ","useful":0,"cool":0},"QMQ61EKNMfkoUFQ1UFARwA":{"text":"Since I moved back to New Orleans I wanted to celebrate by hitting up the french quarter. ","useful":4,"cool":4},"VyI9xBqNUD486SVK8R2TKw":{"text":"It's a neat dive bar to see.  If you want to see serious drinkers falling down you have co","useful":0,"cool":0},"9FuGo0Ms1yWhEUhIbb0nNg":{"text":"Strong drinks. Check. On Bourbon Street. Check. Barflys. Check. Great staff. Check Check! ","useful":0,"cool":2},"pZ-GRMcS4PrfL9NKPlukbA":{"text":"Had the Absynthe, which is presented with full show and history lesson.  Fairly accurate a","useful":0,"cool":0},"7YzNjYaRukb7A02HzCEqhg":{"text":"Came in here this Wednesday night. Place was partly busy but got a seat at the bar. Fun fo","useful":3,"cool":0},"g22-l9HvWjiVqQGPLzZVxw":{"text":"Had so much fun here.. really is just an old old bar on bourbon with history to it. Howeve","useful":0,"cool":0},"HB5J8vw3eB6ITMxBE217pg":{"text":"It's been said before, but it's worth saying again: the drinks are very expensive. The atm","useful":0,"cool":0},"saWSEvmyIAL4LzhilpNpBA":{"text":"Dirty and overpriced.  Somehow I'm still drawn to it.  No food available, but I have broug","useful":0,"cool":0},"r5XMT0WwxRjXnBkmtgOKVg":{"text":"Horrible Service. Watered down absinthe.  I expected more. This was on my to do list. Sat ","useful":1,"cool":0},"8hS0m6stiWN4vp1nKGhHqg":{"text":"This is the place that popped my Absinthe cherry.\n\nThe waitress was very knowledgable abou","useful":0,"cool":0},"zqDDINnAMNfi1nbUlv7S0Q":{"text":"Only stopped by for day drinking. Bar tenders were helpful and... local. An \"it takes all ","useful":1,"cool":0},"mkWqttM7AFEHB1Z0P86_Ig":{"text":"Great bar! We stopped here for bloody Mary's and Pimm's cups 2 days in a row and really en","useful":0,"cool":0},"-EzvbOKsvOS8WKnJ6oCZHw":{"text":"I had this on my to do list while in Nola, I read the bad reviews but decided to come anyw","useful":5,"cool":1},"NTk1kCMZ6oW41JvwqXvZ5Q":{"text":"Our stay in NOLA also included a delightful night of drinking at The Old Absinthe House.  ","useful":2,"cool":1},"uiI-du9xsySjzyrQTTdCOA":{"text":"I just read Stephanie's review below and LOL!! I had the same grumpy bartender the Sunday ","useful":0,"cool":0},"krkah7VaT7dzbTFJCesZfg":{"text":"Just a dive bar with some nice TVs if you are looking to watch a game. There is always so ","useful":0,"cool":0},"3WK042MpaGDQbcEX-M0zAA":{"text":"The character is in the walls here, not in the service that we experienced.  There's an in","useful":3,"cool":1},"lBmORCq81g_VoeQUVjpRJg":{"text":"Had the top shelf absinthe there... The ritual of making it is phenomenal.  Will be back..","useful":1,"cool":1},"DtQ3wFbpKkP-QCcvA7LYfw":{"text":"Old Absinthe House is old. How old? A lot older than you or I. It's practically a booze mu","useful":6,"cool":6},"F_BZ4DEmBFlSFoV0NGZB3g":{"text":"The Old Absinthe House is my favorite bar anywhere. It is the only bar that I have gone to","useful":2,"cool":1},"bo8hLSD92L7p2UKV2F1NUg":{"text":"I used to get the Absinthe Frappes here \"back in the day\". The 1st time I walked out of th","useful":7,"cool":4},"jzKg5y_vUb-p1QPcpBCpgQ":{"text":"What I loved about this bar was the absinthe drinks and the fireplace. The bartender was o","useful":1,"cool":0},"LWltkPskZHFWVk-js9_4Ng":{"text":"So overpriced for a small drink. The woman who greeted us was very nice and friendly but t","useful":0,"cool":0},"5Wjleje98Oz-4HIfsIkzeA":{"text":"A little dirty, a little old, everything you want in a bar in NOLA.  However, this of righ","useful":2,"cool":1},"ChUkYI9K9Cb8zOWuyyyJgQ":{"text":"This is a cool place. We drank here every night while in NO, which was 4 nights. It has a ","useful":0,"cool":1},"BtXwvrZ8BDYwbSrXyzTuNw":{"text":"We were really looking forward to coming to this bar due to its history. \n\nOne word: Disap","useful":0,"cool":1},"X3MuQtXP_lIQcEVoQXYCxw":{"text":"Perhaps it's my age or my curmudgeonly demeanor, but on my most recent trip to Bourbon Str","useful":8,"cool":6},"7IwtEWmucGcjGG9DNbxXkQ":{"text":"This is a very different type of bar and fun to go in and take a peek around. The drinks w","useful":0,"cool":0},"7GCUAVIy4qVFidraXwQdGw":{"text":"This place definitely has a mixed, off-beat vibe, but that's not why you come here. No, yo","useful":1,"cool":1},"dHItUtj179r3_RtkCWdwzg":{"text":"It's not worth it. Luckily I took my own absinthe and spoon to NOLA. The scene was typical","useful":0,"cool":0},"WINmRJq7SD0eADo9H6pxRA":{"text":"3.5\n\nfirst bar in nola that we went to. dive. real cool stuff on the wall. bartenders not ","useful":1,"cool":0},"FdtK444Mj6X5zZmjnek9ZA":{"text":"A must see on bourbon street. Totally mistaked this bar for an older one down the street o","useful":0,"cool":0},"qSf0qHznKnmj0t8e_8zEGA":{"text":"A classic bar on Bourbon Street. Made a solid sazerac and have, as you would guess, a good","useful":0,"cool":0},"DigMEVqzB9TkRsIRwprjLQ":{"text":"This is another french quarter price with lots of history and character that is therefore ","useful":0,"cool":0},"EqeBDo3l9cTGGP93HTU-cg":{"text":"As you walk down Bourbon street, you will see alot of the same places. You got your Daiqui","useful":0,"cool":0},"6JBOXlrLVIte5Na0No__ew":{"text":"The oldest bar in Louisiana and my favorite bar in touristy Bourbon Street. I'd recommend ","useful":1,"cool":1},"tkVXEq7kqugPKiGyBrW1BA":{"text":"Great place and service. I love the fact that it has so much history and It's been around ","useful":0,"cool":0},"JUfCo_leOCC_8W2bOOa9sA":{"text":"Over rated and rude bartender! Over priced for terrible service and atmosphere. Go somewhe","useful":0,"cool":0},"Gyu1bMxjHewcGTV6Clm5Ew":{"text":"If you like Absinthe, you'll love this place. Many choices. Fun place on the bourbon stree","useful":1,"cool":1},"-ZefUuG7M15G1nKm8onvkw":{"text":"Doesn't even have a real absinthe fountain, pouring water from a plastic container. Touris","useful":1,"cool":0},"hjRdzZK2vMP97w76t3p42g":{"text":"I have visited Bourbon Street many times over the decades, and each time it gets less auth","useful":0,"cool":3},"2E1475nrk3aOtyRwXeZLvg":{"text":"I've been to this place numerous times.  This time visiting NO was no exception.  Its righ","useful":0,"cool":0},"0M8-N5AObW9ayz5-2FIknA":{"text":"After I heard that this bar offered a nice selection of Absinthes, served traditionally wi","useful":0,"cool":0},"gtkkVIwH5HFI3FQsUB88zA":{"text":"Fucking love absinthe\nAnd this weird ass bar. Mellow\nBartenders, chill crowd","useful":2,"cool":1},"i3xAd15H9TmAvgxLipJOnw":{"text":"A Bourbon Street classic. Reasonable drinks at reasonable prices with a great juke box. Of","useful":0,"cool":0},"eora37p8vDOAZPUTp5k0nQ":{"text":"Not worth the hype. The bartenders here need a major attitude adjustment. \n\nOn a recent no","useful":0,"cool":0},"d-pzSYdxBE0MUQ5VtAGEgg":{"text":"Actually very nice bartenders. Pretty good Planter's Punch (which is a HUGE step up from t","useful":2,"cool":1},"ACxFsliAgnhOUI5JwVW3CQ":{"text":"We came in here for Ramos Gin Fizz after dining at a nearby popular NOLA restaurant. In fa","useful":3,"cool":1},"GrCVp9q3BIOOTKvQ3mpD5A":{"text":"Very unprofessional.  Manager wouldn't even come talk to me when I had a question. Bar sea","useful":0,"cool":0},"aNOLLv-H5dXUPLcA2f2pXA":{"text":"Cool absinthe bar.  Nice and mellow compared to some really collegey drunkard spots on bou","useful":0,"cool":0},"c1f-SF9WUH2c5eC1xEtYlQ":{"text":"Great Sazerac! Quirky and unique! Cool football helmets and other athletic items hanging o","useful":0,"cool":0},"XoMGrORWfgyXWZJ__HPUDA":{"text":"This is a cool old bar on Bourbon Street.  It may not have the live music or specialty dri","useful":0,"cool":0},"Gwryhew-p-Yrycy7ngbUdw":{"text":"Great place to grab a drink away from the insanity on Bourbon st.  The servers are friendl","useful":0,"cool":1},"vczDd3JuYlpKpGIvzyDVmQ":{"text":"We made a quick stop at the Old Absinthe House before dinner. The bar was well stocked and","useful":0,"cool":0},"xFGutPRzym9dQZCLGkELcA":{"text":"Seemed like a classic Bourbon Street Haunt. They have an interesting absinthe menu - it's ","useful":2,"cool":1},"G27PaPiZJOtO3aITdx9GIQ":{"text":"Nice place on bourbon. Definitely a dive. Cool atmosphere and the fireplace is a nice touc","useful":0,"cool":0},"ILv0rehyn_qvEm8DW4zrhg":{"text":"Was really excited to try some of the unique drinks on the menu. Unfortunately after being","useful":0,"cool":0},"lkQy2GBqHo2MNTpgeEUj_A":{"text":"Lovely lovely place. Melody is the one to see. Trust her suggestions. She will lead you ge","useful":0,"cool":0},"tX18XK-zYq5qSF58auZVYg":{"text":"Had several Absinthe drinks here this past week while we played around in New Orleans. Big","useful":0,"cool":0},"MDMOUusG2rgMQIc-Z2KgFg":{"text":"The best bloody mary i have ever had.  Chili vodka and home made mix make for one hell of ","useful":0,"cool":0},"NeeJVp39F8OfBT_N-k94Mg":{"text":"Have been here many times. I don't really get the appeal outside of some super tasty blood","useful":0,"cool":0},"NBY2Sae7g_FkTlxDo7-mQQ":{"text":"It's disgusting but you need to stop in for one. The shirts, flags, and football helmets a","useful":0,"cool":0},"BwdU6QZEn5iHRQVl0REH_g":{"text":"My favorite place in the world to get a Bloody Mary. Eeeextra dark w/extra olives & pickle","useful":2,"cool":1},"E2uJVLSn_JNhcK3fFJpZQA":{"text":"Lets just say this place is unassuming but completely off the hook! Our wedding party met ","useful":0,"cool":0},"cJgtYjRRwRL6H_lAd-avrQ":{"text":"Horrible service. An older woman was bartending and after waiting 30 minutes with no servi","useful":1,"cool":0},"TOf2L-FX39SZqi_LOswqWA":{"text":"Cool place to hang out and drink. Bartenders were pretty cool and the prices very reasonab","useful":0,"cool":0},"ramxaFdxHlz1xwjGIGlqXA":{"text":"Pretty cool little spot on Bourbon if you like absinthe. They had a pretty good Sazerac...","useful":0,"cool":0},"AqGD-lZvx7shfmU955EG1g":{"text":"Such a cool little place! An oasis on Bourbon street. The inside actually seems classy and","useful":0,"cool":0},"-CSnLicRrOtoScF7bqs4gw":{"text":"CRAZY overpriced, slow bartenders, and the worst part is that they don't even live up to t","useful":0,"cool":0},"VyMXdStQf3FeHUktOn2Hrg":{"text":"I know...Total tourist trap.  I can't help it, I go here several times a year and always h","useful":0,"cool":0},"VykwOcoU4mNKuf3OYXUaVw":{"text":"This bar was the last stop for my night of drinking.  I don't remember much but I remember","useful":0,"cool":0},"A9-9_yYeY0E-xkUxEJ6AKg":{"text":"I liked the old football helmets decorating the place and absinthe drink was pretty cool.\n","useful":2,"cool":1},"JaN1FyCJv0B8qWu9B-RYGA":{"text":"OVERPRICED, HORRIBLE SERVICE, HORRIBLE PRESENTATION!  I don't want my absinthe mixed with ","useful":0,"cool":0},"-7CnOKZITDO8xYCigbLkbA":{"text":"Wasn't really for me.  Kind of a tourist trap and drinks are pricey as hell, especially fo","useful":2,"cool":0},"d6xr2dlosHTrfqf4NRW22Q":{"text":"This place is in a good location and the traditional French preparation of the absinthe is","useful":1,"cool":0},"sqvSdhJkyIxQh-9flPHfpA":{"text":"I wanted to try Absinthe while was visiting New Orleans. The Old Absinthe House got the jo","useful":0,"cool":0},"sVdPR77JyeBoRs_r0rDMuw":{"text":"While this is somewhat typical of dozens of dive bars in The FQ, the unique element is it ","useful":0,"cool":0},"JmQbYcktgjHlers3AODW8w":{"text":"This is a Dive Bar. I love it. Cold beer on draft, and a great vantage point to soak in Ne","useful":0,"cool":0},"L3J35U2GiREJo2IBT7zGZw":{"text":"This is a good ol' dive bar that locals go to. Tons of ambiance. Good, strong drinks and g","useful":0,"cool":1},"jArFRIbzx-d5VMu_9t-b9A":{"text":"This isn't the worst place to get a drink in New Orleans. It's a really weird blend of peo","useful":3,"cool":0},"oxiAO6rmeWEMJ3oCWKWOaw":{"text":"Great place for drinks. The staff are friendly and willing to make the cocktails you want.","useful":0,"cool":0},"F0USIhEe8fVg0VWUqSQj3g":{"text":"Very unique place. Even though $$$ couldn't leave without trying and witnessing the pourin","useful":0,"cool":0},"ug2QZ3m9VkpZDNGUeV220Q":{"text":"We stopped in because my buddy wanted to buy me a powerful drink for my bachelor party. Th","useful":0,"cool":0},"FH_ysmSK8mPtIG7Dls8u5w":{"text":"What a shame. For a bar that's been around for over 200 years, there was very little sign ","useful":1,"cool":0},"u9Axy09Vx2K1cmDHHs0ZlA":{"text":"Probably my favorite stop on the haunted bars app we had. Maybe it was the history... mayb","useful":1,"cool":1},"B7pjnf7_CstW3WbxQ8lzcg":{"text":"This place is a must for Absinthe...quite numbing is all I can say. Bartenders are nice an","useful":0,"cool":0},"u_E46Alt2PaJFvWdms1fCg":{"text":"Worst service.  I am a local and I understand it can be taxing serving tourists all day bu","useful":4,"cool":3},"cc3z3rcYdDIFkRUBwL58JA":{"text":"Really old and cool looking place. It was awesome seeing 3 much older ladies getting bange","useful":0,"cool":0},"CgykWr6-_NziqvQ1fAcG2Q":{"text":"The description says wheelchair accessible, but it should be noted that if you are a woman","useful":2,"cool":1},"itZ0UPaObtDd0epeS6l46g":{"text":"Respectable, cozy (fireplace), good drinks and generally good service.  A nice mix of loca","useful":0,"cool":0},"Wphn7AzSqUMDEPwlzGu9TQ":{"text":"Small corner bar. The walls are covered with business cards. Absinthe drinks are very expe","useful":0,"cool":0},"CS4Cmr_4jCXd59Q4AZbwyA":{"text":"Best Sazerac in town.  Service is wonderful.  A must-visit if you're in the Quarter.  The ","useful":1,"cool":1},"weYTOKFdhk2NbdIVcexzuQ":{"text":"Great local pub amidst the madness of Bourbon street. Cajun spiced popcorn to munch on whi","useful":0,"cool":0},"HNXrGkaTZGX0SZfAPXqaig":{"text":"Where can you drink absinthe and raise a glass to saying to hell to British oppression and","useful":0,"cool":0},"8d6HfZ15g7QbBcZCS69afw":{"text":"I winced when I saw how much Worcestershire the young lady added to my plastic cup. I shou","useful":1,"cool":1},"srW4hDUXeOxMmHOl6Kljow":{"text":"Horrible service. Waited 10 minutes to take my order at the bar. Then the bartender turned","useful":1,"cool":0},"cfXmZ2awy8JjEUaisSze-w":{"text":"Exceptional customer service. Most delightful experience in the whole city! Excellent bart","useful":0,"cool":0},"AIfkXSAoH2nMPMuOz2uMdw":{"text":"The place has a long history and is directly on Bourbon Street. The atmosphere is lively a","useful":3,"cool":1},"uf1Cp7CurSE0nQd3i8En-A":{"text":"I tried the absinthe drink. It taste like licorice, which I hate, but the bartender added ","useful":0,"cool":0},"_zJDq3GGng01b8__q8qEsA":{"text":"Our bartender, though scary and not very friendly made wicked drinks! \nThis place is old a","useful":1,"cool":0},"y-jwGM7bkzzA1pXrwEHV2w":{"text":"Old, old bar which was also owned at one time by Jean Lefitte, the original bad ass of the","useful":0,"cool":0},"TALpGR_uEU88JrV5QsM4pA":{"text":"Stopped in and was instantly overwhelmed with the décor! Business cards all over the walls","useful":0,"cool":1},"rsnG2Vse2b7hqvuEj8W3Cg":{"text":"I'm a fan of good absinthe. I keep some top-shelf bottles at home, along with sugar cubes ","useful":7,"cool":4},"tsvlZWoX8MejiF6BsDjIZg":{"text":"The main reason I wanted to check out this place was its ancient history. The place remind","useful":0,"cool":0},"Ny7KESeWMFs-mfL86LXpPQ":{"text":"It's a kinda dirty bar with beer and friendly staff. My biggest question is WHY WOTH THE B","useful":0,"cool":0},"z9UQ0irRIvx-YPjyXS19Nw":{"text":"I had a great time.  A total New Orleans dive bar with football helmets on the ceiling...t","useful":0,"cool":0},"APhoxSmwuijVP8PDB945vQ":{"text":"Decor filled with business cards. They have signature drinks and I tried the punch. Super ","useful":0,"cool":0},"IkLmt9JIX4tLiKu3KNUzyw":{"text":"Awesome location with nice wind sweeping through on hots day!  The best is Diana behind th","useful":0,"cool":0},"uURaqfHosTgI65_CL_cj_A":{"text":"This is a very, very cool spot in NOLA. On my last night of vacation I wanted to get a way","useful":0,"cool":0},"wKrO-jGM7AClF5eZAJxgQg":{"text":"Come here for a classic. Absinthe frappe. Ramos fizz. They don't serve food. Dive bar ish-","useful":0,"cool":0},"PtoUopw-rRBKMF5WircKiQ":{"text":"Strong drinks and Absinthe, Oye! Stop in for a shot or take it to go! Gotta love NOLA!","useful":0,"cool":0},"Hk353Qcu_LGnz3XNRldAew":{"text":"My review is only for the bar.  OVERPRICED shot of Patron... $10?  I walk a block down to ","useful":0,"cool":0},"jMHeBHCrwAXlb96GoUav7g":{"text":"Stopped in here for a bit during French Quarter Fest. The bartender was really nice and I ","useful":3,"cool":2},"700KdxDRo2_0ggaD0_vbPg":{"text":"Went to old absinthe as a stop during our 'bourbon st day'. It was well worth it! Besides ","useful":0,"cool":0},"i2IRnrVx5ldGid60KYaTvw":{"text":"Went here as we were going to the 5 oldest bars in New Orleans and this was one of them. B","useful":2,"cool":0},"S1OP7kwP0n4SfrL3yNigPg":{"text":"The girls at the Absenthe  House are nothing short of amazing! Dawn, Erin, Carolyn, Julie,","useful":3,"cool":2},"HHDtCKlIUYq0hqaoHrhxaQ":{"text":"Great bar. Bartenders are super nice. Absinthe selection is vast. Music in jukebox are not","useful":0,"cool":0},"e9YMr17sTfyHFf5WsOSoCQ":{"text":"Fun atmosphere for people watching. Bartenders seemed preoccupied but hey, it's Bourbon St","useful":0,"cool":0},"Gu55Q_wM5mtlE9nn0DxVUw":{"text":"I was here about 2 weeks ago. The Bloody Mary's were great, but the service was not. The f","useful":1,"cool":0},"4WtrMo6w8H40Jc0WcNLLIA":{"text":"Great pub, casual no crazy dancing or crazy music.  Nice place to grab a beer or two right","useful":0,"cool":0},"coHQoolKDDNKQ1WxhLgo2A":{"text":"This was fun. Absinthe done well. A quick, worthwhile experience as we hung out in the bac","useful":2,"cool":0},"f-_c5jj5uRehdlVjR_l3Sw":{"text":"this is a great place to try Absinth, and many other cocktails!  super nice staff","useful":0,"cool":0},"I3BEmmp_RDqk6vuQearcwA":{"text":"We ordered the Absinthe - good presentation from the bartender with the lit sugar cubes.  ","useful":0,"cool":0},"vucLgcXhPB9xVwmyTzRIfA":{"text":"Leblon cachaca, lime, simple syrup and ice and you've got yourself a party. I and a few co","useful":7,"cool":7},"2dZ7irtMpexHQaDCXbwF1A":{"text":"I like absinthe but I didn't get one here because it was so expensive. Like $19-23 for a g","useful":0,"cool":0},"-b-MmcxKFF7VphksLvHs_A":{"text":"This place is really amazing. We finished dinner and walked into this bar. It seemed to ha","useful":0,"cool":0},"IkWs0Q2RrlMn6y1wZPh-EA":{"text":"I do not go to the quarter without stopping at the Old Absinthe house.  It's a good thing ","useful":5,"cool":4},"oWwx9TFFfWqIedKrfD5hDw":{"text":"Thank you Ashley for being super great for my boyfriend and my first time with absinthe. S","useful":0,"cool":0},"JxNp_ElJaXicSy-ETvdK9A":{"text":"Stopped by on a Friday in September around 4 or 5pm. The place was pretty busy even though","useful":0,"cool":0},"Fhp0jzjOXKvBJ8x2DOBw5Q":{"text":"This was the first bar I stepped foot in on Bourbon Street. The bartenders on 5/12 during ","useful":0,"cool":0},"XSjX9wcq830zZUZN9Q1vvg":{"text":"If the Sazerac is the official cocktail of New Orleans, then absinthe is the official spir","useful":3,"cool":1},"YazYkaLtIPAbJHI3igjPCw":{"text":"This was fine for just any old bar, but I specifically went in looking for absinthe, so it","useful":0,"cool":0},"d1DbCEZHdliP1jwI9X94Kg":{"text":"Stay away from the draft beer, dirty dirty lines. Tasted like fish tank water. Ordered 10 ","useful":0,"cool":0},"BPd1AW6CHFwmWKXET27zFw":{"text":"Why yes I did try Absinthe here and didn't hallucinate. Or did I? Were those woman's breas","useful":0,"cool":0},"Zo7MtgVBvGunCRylB0pFlg":{"text":"My gf and I read on yelp that they were dog friendly.  We went in without issue but then b","useful":1,"cool":0},"Zd7gAHj1LMvCoV4KspLQsA":{"text":"I enjoyed a nice absinthe here, Cinco de Mayo. My bartender Hannah was polite and engaging","useful":0,"cool":0},"8FBF5VK_pdp8nPE5G8AguA":{"text":"this place rocks..they're totally nice to the absinthe newbies\ngreat show with the sugar a","useful":0,"cool":0},"l5fRDzV8UcLIR9rzwubEbA":{"text":"Not a bad stop for a drink before carrying on more in the quarter. The absinthe show seems","useful":0,"cool":0},"x4IyWt016P-3abKHKauowQ":{"text":"My dad and I were passing through NOLA on our way to Texas and we decided to walk down Bou","useful":0,"cool":0},"yqTaL-S02KQk4O4-0rOYKg":{"text":"My first, last, most frequented venue in New Orleans.\n\nThere's a certain charm to the Old ","useful":2,"cool":1},"_lf9EqXBOezlRlgpEdc2Xg":{"text":"Bourbon Street and their crackheads.. I love it.","useful":0,"cool":0},"dJ9uwfeBGuMP-jfgYueIUw":{"text":"This is pretty touristy and can get very crowded, but it is still a must see. Great histor","useful":0,"cool":0},"ffvMipmoXv7y09L89ce9iw":{"text":"The service was awful. We walked in, asked for water while we reviewed their selection of ","useful":0,"cool":0},"2xALei8Qx13z0jcjwhgCMQ":{"text":"Felt like an imposition from the second I walked in the door.  Bartender was more interest","useful":0,"cool":0},"bpHv6NTDUIzLSIlEJDVPbQ":{"text":"This place was an interesting dive but not worth the price of the drinks IMO.  The Ramos G","useful":1,"cool":0},"U2OD8PfI7XATDLAnS2uohA":{"text":"I dont mind a good diver bar and didnt have high expectations.  You are on Bourbon St - so","useful":1,"cool":1},"EKcYNLXW3E7tJf_L0UvpHw":{"text":"Great bloody marys, very friendly and attentive staff.  On cold days they have a full fire","useful":0,"cool":0},"O3YYbIczHH3SbQK0vjvtTg":{"text":"It's crazy how steps away is the mess that is Bourbon Street, yet when you step in here it","useful":0,"cool":0},"0EIRoZd0zFN7IPIjLlSrdg":{"text":"During a walkabout I was craving a good New Orleans original.\n\nI had heard good things abo","useful":0,"cool":1},"6ZmjJhs_E1B8IoVjx0ZwIA":{"text":"Great drinks and atmosphere. Very laid back, with an awesome fireplace. Definite must do o","useful":0,"cool":0},"eQhcsril8UwfvrSrKiHhwQ":{"text":"I had to review this place even though I only tried a sip of my friend's absinthe. The bar","useful":2,"cool":0},"WQEZAi_w2JvQGYiFU8uiJw":{"text":"Boooo Old Absinthe...you brought me in with your history and for hopes of a nice Pimm's Cu","useful":9,"cool":4},"DXIC1fSJfYKQvvey_QLt8A":{"text":"A nice, chill spot in the Fresh Quarter. The bartenders are very knowledgeable and helpful","useful":0,"cool":1},"H9BgQDl4XNmxsUqeYHy7eQ":{"text":"Cool place to hang out. Bartender was friendly. One of the oldest bars in Louisiana.  Drin","useful":0,"cool":0},"OGVSSbOokzKWk7u3KsTQ6A":{"text":"I'd give this 4.5 stars but will round up to 5, 1/2 star deducted just because the bathroo","useful":0,"cool":0},"Ia7Qz0rexf09fyO9Ev8KbQ":{"text":"Place is ok, cool place to pop in and check out for a drink.  Pretty pricey as it is in to","useful":0,"cool":0},"meiunyzesU4tMnKFrEg8lA":{"text":"Was quiet on Thursday afternoon. Popped in for an Absinthe drip $22.   Interesting to watc","useful":0,"cool":1},"9QOO78K8nRHGVKXj6XT7KQ":{"text":"Some reviews have used words like dirty, divey, and pricey to describe the Old Absinthe Ho","useful":1,"cool":3},"-4CqsS-HrUWX0FCxDGikjQ":{"text":"First time in New Orleans and I just had to try absinthe! I also wanted to check out one o","useful":0,"cool":0},"LzeYwA5OdxFqD3TEOo6U8g":{"text":"This is a fantastic bar.  The dial that controls the volume behind the bar is great.  Chec","useful":0,"cool":1},"bZEZpxjq29FQSWWLAN6nlg":{"text":"Super fun experience with Hannah. She explained how the drink is made and a little backgro","useful":0,"cool":0},"Ot-7L4LCkekbfngCPFfMUg":{"text":"One of the top two or three bars I went to when I was in NOLA. Awesome atmosphere that see","useful":0,"cool":0},"2fW1UVOfKcecYYZSVP-kWg":{"text":"If you don't have the new New York State ID and you're  planning on having a few at The Ol","useful":0,"cool":0},"4N07T8KomBZVWKbTi4jUrg":{"text":"One more place of the list of \"must go to\" of NOLA.  \n\nThe walls are filled with interesti","useful":0,"cool":2},"vv7KtRmlGYbwBEyoy7_7pw":{"text":"This place in my opinion was just okay. Nothing really special about this place. My barten","useful":0,"cool":0},"lrIOh8suq5IAHIPuMKxiLw":{"text":"Stopped here for a few drinks while on Bourbon Street. The beers were cold and it was a bi","useful":2,"cool":1},"QhaVDFaTUH1glUpmVLJfrw":{"text":"Nice and dark, with a decent clientele. They serve absinthe the old-fashioned way (also, t","useful":1,"cool":0},"K2xtsz4TaajPl--15bDdqQ":{"text":"What an odd atmosphere. They have dozens of football helmets hanging from the ceilings, th","useful":0,"cool":0},"4MpP5qOcg9jsvgeaxGS3Dw":{"text":"Fantastic absinthe and service. The bar tender didn't make me feel like an ass when I was ","useful":0,"cool":0},"DPDdpX1QSYfgqzJVn4C8aA":{"text":"Let's get this straight: YOU WILL NEVER TASTE ANOTHER BLOODY MARY LIKE THIS IN YOUR ENTIRE","useful":4,"cool":3},"3aXbOcTbk1eBV0emnUa6pg":{"text":"Good selection of absinthes, and I like the way the prepared it properly. However it seems","useful":1,"cool":1},"-QahTsqkVYjsHmrM2VY5QQ":{"text":"Two stars #becauseabsinthe. Super disappointed in the decor, the shitty baby boomer light ","useful":1,"cool":0},"ztCsjYSU8iVIX1KCQnpwGg":{"text":"I had so much fun here!\n\nLoved the Pimm's cup and the Absinthe service put on quite a show","useful":2,"cool":2},"6muganl22Q642l3a5R26lA":{"text":"$7?  For a 12 ounce draft?  Come on now.  That's worse than getting a beer at a MLB game. ","useful":0,"cool":0},"hchDPccEWeckuW_KEAZBOA":{"text":"Fun little place to stop and have a drink. My friend had never tried absinthe before so th","useful":1,"cool":0},"k4Z65qoqxlxdb4P0cqtq2A":{"text":"The place to go and meet someone you know for a good New Orleans afternoon in the Quarter.","useful":3,"cool":2},"kDQnysz4rAs_RcrO2-Y2hw":{"text":"A wonderful, no-frills tavern located in the French Quarter. The building is over two hund","useful":6,"cool":2},"GEidhguwMJO8RjrI7On_yg":{"text":"Delightful absinthe presentation. For all the terrible places off Bourbon, this is a stand","useful":1,"cool":1},"w5KMiaur_zWwccMDZsK8sw":{"text":"We stopped in here to get a drink on the go .... I had the pernod and my other had the nou","useful":0,"cool":0},"tUSP6lb6YvOqzNl6TC9StQ":{"text":"It's always perfect. Not your normal bourbon street dive, no giant frozen drink machines. ","useful":0,"cool":0},"SXakQUz76EhM6Xe5K9kwRA":{"text":"This bar was WAY overpriced for what you get.  Drinks were terrible, bar is filthy, even f","useful":0,"cool":0},"uhUDgD_lZQdwGj33kq6ZaA":{"text":"Well if you have another choice take it.  Ordered a Bloody Mary from one of the most dry b","useful":0,"cool":0},"C5CDQ-jGhcvW1Hl1wrpnTg":{"text":"Good drinks (love the Bloody Mary) Kathy has that New Orleans personality. Always a stop w","useful":0,"cool":0},"ryPNbtLYDzJI4aa-FZcdRw":{"text":"We visited twice to sample different kinds of absinthe.  There are 100, 106 and 136 proof ","useful":0,"cool":0},"Puosr8udW3oMI2qrbak_1Q":{"text":"Almost $20 for a glass of absinthe!? WTF?\n\nPirates Alley Cafe is half the price and far mo","useful":1,"cool":0},"jGREsApqc6H3J4CBzLlo4g":{"text":"Awful. Watered down drinks with zero flavor. Had the Absinthe Frappe. Tasted like seltzer ","useful":0,"cool":0},"iHJs0pLKaKYR9RwMGH_cFA":{"text":"Maybe I had high expectations, but this place wasn't as amazing as I had imagined. We're h","useful":3,"cool":0},"YbR7JmVoTSRgZdPnpGee8w":{"text":"I'm never disappointed at this local staple.  One of my first stops whenever I roll into N","useful":0,"cool":0},"C1WTxumC_VTr1DRNRKxK5Q":{"text":"This Bar is officially the first bar I went to in New Orleans.. many more followed it. \n\nA","useful":3,"cool":2},"5Ev6FP-IGKgVg41UdyVPQg":{"text":"As divey as it gets and with some fantastic drinks.\n\nAbsinthe (obviously) is the signature","useful":2,"cool":1},"yDmDbJ-sWPW6xpKWY2CpHA":{"text":"My favorite and a tradition anytime I come to the French Quarter. Always have a chance to ","useful":0,"cool":0},"vlB9hilI3R3RVTlIFb4REQ":{"text":"After rejecting a few bars on Bourbon for being a little too rowdy for our tastes, my frie","useful":2,"cool":1},"4_KGAc3vVSiTxrZOLvKSeg":{"text":"Well other than the sign outside this bar has nothing to do or any basic knowledge of Absi","useful":0,"cool":0},"iAD8U4bv_4UEKMH-eJDULA":{"text":"Super fun bar with lots of absinthe choices. I adored the absinthe frappe, with lots of an","useful":0,"cool":0},"Mz_-vda2kb5EOd7HCNb91A":{"text":"This place is my jam, the history alone is mindboggling (ask for a tour of the entire faci","useful":1,"cool":1},"UTGVPf7RDtfP8zQy2CGpew":{"text":"We had to make a stop here on our first trip to NOLA. The absinthe drink was undrinkable, ","useful":0,"cool":0},"D23r8kyQ6ohaiZ8dYDaBjA":{"text":"Ever since watching the movie Euro Trip in 2004 I've been wanting to party with the Green ","useful":2,"cool":1},"iwZQS_Ao_QpzNbzWYPsOtQ":{"text":"Legendary bourbon street bar open to street and still  pour a stiff drink. Gene Andrew Jac","useful":0,"cool":0},"lQTSf8YipHJkzAVnLMC7aA":{"text":"If you are on Bourbon Street this is a must see stop!\nLooks like it has been there for hun","useful":0,"cool":1},"4s1lr5fv17huEakdK9KLcg":{"text":"Yes, the absinthe is expensive ($16 for a glass). It is quite a show, however, for those w","useful":3,"cool":1},"dkBV0M-QLi39xr6RwGRuLw":{"text":"Cool little hole-in-the-wall bar on Bourbon St. A ton of character/history and great staff","useful":0,"cool":0},"zn-QBYllGlOa1Y4oTnSjdA":{"text":"I wish I wasn't so drunk that I couldn't enjoy a glass of the weakest absinthe available. ","useful":0,"cool":0},"viAWnkUEV2LaXxHxHH6Exg":{"text":"This place was actually kind of quiet in the midst of the Bourbon Street chaos, and we app","useful":0,"cool":0},"dPiQ0_fIXdSX2Un9sM8-_A":{"text":"Absinthe makes the mind go nicely numb. From 106 Proof Clandestine Absinthe....so very smo","useful":3,"cool":1},"WdGoIsf84mQ-0Uh8CGEwww":{"text":"Great spot on Bourbon Street! \n\nLarge drink selection and love the round bar seating. Also","useful":5,"cool":3},"4rlBlnIcC9DoxgsHrEt3Og":{"text":"Jackie claimed that she was the manager but inappropriately took my drink before I was fin","useful":0,"cool":0},"L6u-XPHppwNlGo-5uPhWaw":{"text":"This place was one giant disappointment. The mystique  and history I read  of this place d","useful":6,"cool":0},"tZvElHVSOc1mzfvtGq5N9w":{"text":"Classic\n\nGood place to stop for a cocktail (read the menu and see a most interesting origi","useful":5,"cool":0},"gAne2JMEXCMQ3idhZlI77Q":{"text":"Chill bar with a decent selection of absinthe, so I decided to try two that I've never had","useful":0,"cool":0},"ThrzCiEuwWDHd1ii5K2fKw":{"text":"A nice little piece of history here, but very small and not a whole lot to offer. Worth th","useful":0,"cool":0},"yiaWpIb6y9NqYcNOpo16Bg":{"text":"Passing thru Bourbon Street and picked up a drink... as my family and I bar hop.\n\nWe found","useful":1,"cool":0},"Sl1JZrYAmnisujWSH6i_Dw":{"text":"This is such a great place!  Easily my favorite drinking establishment directly on Bourbon","useful":6,"cool":5},"rD0gIpn062bLVB8lqmHeAQ":{"text":"During my first trip to NOLA back in 2016 with a shitty ex/person and his friends, we had ","useful":0,"cool":0},"DTQPJG3GJjIgT8S_llALfg":{"text":"BF and I made this place our first bar stop after dinner.  This place had red lighting and","useful":2,"cool":1},"LCH-OY7omSMHeJTooysT-g":{"text":"Spent the trip drinking Sazerac and La Louisiana, but wanted to try the Absinthe. Had the ","useful":0,"cool":0},"IF-YxHfm4sx_XUygWKmL3A":{"text":"Always wondered about the way the French served absinthe. Here you have ice and absinthe p","useful":3,"cool":3},"uzzSh0meWG4BmXgIOa_YKg":{"text":"Not surprisingly, this bar was a little nasty. When I went in with another woman (and a co","useful":2,"cool":0},"bG3g_V_4_bCtg0AphdLU0Q":{"text":"I was disappointed here.\n\nThe little garden in the back has a neat bit of history attached","useful":1,"cool":0},"atICAIuRwTXSksNR7Q4jtg":{"text":"Visited this bar with a group of friends.  I didn't purchase anything but my friends did a","useful":1,"cool":0},"2dqeM4ucYcFt0au6eensAg":{"text":"Quietish place to get off the strip and have a fantastic beverage really charming old buil","useful":1,"cool":0},"tMSXiZ8177x_IXG4USH56w":{"text":"A classic old school staple of a bar on Bourbon Street with a well stocked bar.  Always fu","useful":0,"cool":0},"LttbGi5QhAthiJhFXMTfEw":{"text":"Cool bar with cool decor. My buddy had a sazerac which was a pretty hefty 12 bucks. For th","useful":0,"cool":0},"BJvLqMqDPybuxK9mRotohA":{"text":"With all the history that surrounds this place, including the number of historical figures","useful":2,"cool":0},"6m_qa40qbZUov1QV33Ippw":{"text":"Probably my favorite bar in the quarter... It's dark, dirty, fantastic jukebox, and great ","useful":3,"cool":3},"EEIQ0Z3DT3Tatx1DzUuK7w":{"text":"First and only time visiting here. Unfriendly young dark haired male bartender, bad drinks","useful":0,"cool":0},"8Dg3On-0sUMVq8BIxC4rnA":{"text":"Very neat place. Built in 1807. Unfortunately, it hasn't been cleaned since 1808. We paid ","useful":0,"cool":0},"Lf9-J0-E988nj7l4ESniAg":{"text":"\"The Old Absinthe House installed a commemorative plaque, stating: \"Old Absinthe House. Le","useful":3,"cool":4},"8nV6Usco1LkekOdlpezhMA":{"text":"I really love the Green Fairy!  This visit included a new libation of the Absinthe Frappe ","useful":0,"cool":0},"RVBeXh3btQQvB_eM8KKymQ":{"text":"The idea behind Old Absinthe House is sound, but the way it treats its customers is poor.\n","useful":0,"cool":0},"ta3tBJOXUusl9gOTV0Oq3A":{"text":"This historic dive-bar is on the downtown end of Bourbon Street.  Yes, there is an absinth","useful":3,"cool":2},"gLMDhI5eex-bJqFWEBeO3w":{"text":"I wasn't there very long. The bartender wasn't very pleasant, and there's no food there ei","useful":0,"cool":0},"CvgthcxAdEGR5qYAOTS0dw":{"text":"First off, best bartender ever. Old school craft cocktail  recipes and pours from a kind l","useful":0,"cool":0},"jGAkgBj5jROHIenq-T92Hg":{"text":"I'd stay away from this place. Looks like a neat spot because of the dive atmosphere, but ","useful":0,"cool":0},"AUq-QTGQW8yU_u0wxD9oew":{"text":"NOT PET FRIENDLY- called I advance  and asked if they allowed dogs and they said yes. Show","useful":2,"cool":0},"NbhgDgT0kDeifUlyXuRtbw":{"text":"This review is really late, we were there about a year ago. The absence was really strong,","useful":0,"cool":0},"_Na9B45LfaPokWgKy15R5Q":{"text":"Older bar in bourbon street. There was a bunch of different football helmets hanging from ","useful":0,"cool":0},"z2K42lHalBMPtmwf6DdhGg":{"text":"Not many know or appreciate the benefits of absinthe, but I tell you, the green fairy is w","useful":2,"cool":2},"PceritxuLMlDR4H1h00niA":{"text":"We stopped in here for a cold beer during the afternoon rain. Fantastic! It's a place to b","useful":1,"cool":1},"Wj9YBwVQ_6pdGFNiRvT8nA":{"text":"One of my favorite bars in NO. Best Sazerac ever! Go during the day for a refreshing time.","useful":0,"cool":0},"9LYsHYP73Ha4TJWJDFj8wg":{"text":"Expert old school bartenders. Must try the Sazerac. Closest thing to drinking a banned sub","useful":0,"cool":0},"-Xi7iMCED7uuZeGhdgTIug":{"text":"On my second trip to Nola I made it a point to pass by the Old Absinthe House and try Absi","useful":12,"cool":5},"3qppNp_h2FT_XFUmuXyeLw":{"text":"This place is super unique and crazy old. We stopped by at least a few times on our Bourbo","useful":0,"cool":0},"JV0FUdigCUtIHYYux1QtNA":{"text":"When the house or place is the name of the drink, you order the house specialty. An Absint","useful":0,"cool":0},"vwup8bhyYB-jSXxCuuX6vw":{"text":"This place is so cool!!! Very old with a beautiful fireplace. The Bloody Mary was insanely","useful":0,"cool":1},"U5hsN8oME5VJI0K72yWiYA":{"text":"I like the atmosphere and absinthe(DUH!). It's pretty pricey but what do you expect for su","useful":1,"cool":0},"quJxshL1Z9yX9ox1EiUciA":{"text":"Sat down for couple of cocktails and wasn't welcomed / greeted nor asked \"What'll you have","useful":0,"cool":0},"Qe1_O7hlLFFnDGNkKlsTFg":{"text":"I do love the green fairy, far to much.  Fortunately the cost prevents me from indulging a","useful":2,"cool":2},"b4svrbuf4Ril9ZXrpdUE7A":{"text":"We walked in here to cool off and grab a quick drink and use the restroom. The place smell","useful":0,"cool":0},"DgdxO_1o57lRoTIs5sSOug":{"text":"Superb. Tight little selection, prices are great, staff friendly AF. Sit down, knock one o","useful":0,"cool":0},"ZRY8EAzmV4--p0Td8-LXrg":{"text":"When in NOLA - you gotta try absinthe! I walk into this bar with a friend around 1am. It w","useful":4,"cool":1},"qhmS4NCwZLF1f0tVPBYmLQ":{"text":"\"After the first glass of absinthe you see things as you wish they were. After the second ","useful":0,"cool":0},"_V9ylfVVhYvIQ_-2iOHplw":{"text":"I'd give 0 stars if I could.  Went  there all weekend and spend lots of money.  When I wan","useful":1,"cool":0},"zJvezqHZKmjoLv4IFiSK_g":{"text":"The first night we were in NOLA, we ended up eating at the Italian half of the restaurant ","useful":0,"cool":0},"ND3PM-f9pckqwzgb3xd5Cw":{"text":"Met some very cool people here. Loved the Sazerac. We went back a few times for cocktails.","useful":0,"cool":0},"YEpTsAduAsdhKaTfhUpBwQ":{"text":"My main reason for a full 5 star review is because of the bartender Courtney! LOVE!\n\nThis ","useful":2,"cool":1},"EO_q_AutY8yu0CDfF8_5fg":{"text":"This is one of those \"whole in the wall\" type of place.  Bar in the middle, with strong dr","useful":8,"cool":6},"ZJDKWvFKqXmVeWSsCVJETA":{"text":"This is a charming little bar that tingles your nostalgia when walking in.  The walls are ","useful":2,"cool":2},"fv0WSmRQ-CzisjEilGzdQw":{"text":"I  saw this on a travel show and it did not disappoint. This is my first time trying absin","useful":0,"cool":0},"RZjw1Ht7oM9KO7fxIGTj7Q":{"text":"Decided to go in here for two reasons. One to try out the absinthe and two because I had r","useful":3,"cool":3},"E20MOcK1zjGgDkWm-piTtg":{"text":"Every time my husband and I come to NOLA, we make OAH one of our first stops. Bourbon stre","useful":1,"cool":1},"W_Vor1a-7cGqPIVkQXzUaA":{"text":"Yayy!  My first review of a bar on Bourbon St!  I don't spend a lot of time on Bourbon St.","useful":3,"cool":2},"sSYFXGP8uVzgUoInC1zO2g":{"text":"So we went for Mardi Gras. We bought the tickets to reserve the balcony. Some of the reser","useful":0,"cool":0},"_el4RXuA3RrlKSGC_8ynoQ":{"text":"Great spot for a cold one, it's right on Bourbon but not far down from Canal. Friendly sta","useful":0,"cool":0},"6TfFucs5cZ6-iY7MQ0mj0Q":{"text":"Earlier I stopped at Lafitte's Blacksmith Shop for a Hurricane and spent much of the after","useful":2,"cool":4},"Myo7P1HCCBsj-hH3_5oVsw":{"text":"I didn't get to try much of their drinks mainly because I was already drinking throughout ","useful":2,"cool":1},"zckXcllHwZZzBJbF3ZrSQQ":{"text":"The drinks were okay, but what made us go back was the service.  The bartenders were nice,","useful":0,"cool":0},"rH3Vh4xa3Dz3cCH8tnkhpA":{"text":"I've always wanted to try absinthe but never had the opportunity and was finally able to a","useful":0,"cool":0},"5h7tvgLMhrVgqbJNfeTT9A":{"text":"We tried a lot of different drinks on our visit here: The Rambo fizz, Irish coffee, mother","useful":3,"cool":3},"MukPGu4Xc_7gQKy3mQTTvQ":{"text":"Well didn't try any absinthe but the decor was pretty cool, music was just right and the a","useful":1,"cool":2},"j7HtXvQ5Cz8xYyg3VekONA":{"text":"This is a dive on Bourbon. We stopped in because I saw it listed as a historic bar while d","useful":0,"cool":1},"kxLDVHzJYUb-ViYED4Kivw":{"text":"If you like absinthe, this is a must visit! They have a menu of the different genuine absi","useful":1,"cool":1},"cIIPlgvd91mr5q2gSd9qFw":{"text":"Okay, so I cant give a full review because i was pretty drunk and only in here for like 20","useful":0,"cool":0},"mlcCD-HCSEGK8UX_uu3FTg":{"text":"This girl was being racist and disrespectful I can't remember her name but it's very sad t","useful":0,"cool":0},"Ojz-BrYNHDEL3aENuarOUQ":{"text":"We stayed just around the corner so getting a Absinthe specialty drink was perfect as thes","useful":0,"cool":0},"HmWvItzkYvacMNRpiWD7wA":{"text":"If it's your First time trying absinthe this is your starting point. The bartender explain","useful":0,"cool":0},"QiKH_C_FVmZ-7asD-8GH2A":{"text":"A MUST DO when in Nola. Within 3 hours of landing in Nola this was my 3rd stop. Not realiz","useful":0,"cool":0},"1wBnNM3T6h4UuVHe5NPVYg":{"text":"The ambiance is stellar, the price tags...for real? I had to do it, but $25 for a single A","useful":1,"cool":1},"DAFZTTyESRKi1US5nMrWrQ":{"text":"11/23/17\n\nA beautiful bar.  Strike that--a magnificent Laboratory!\n\nOf all the drinkeries ","useful":51,"cool":49},"MR3jD5toN_0yrx0V_x95Ww":{"text":"The Old Absinthe House will always be 5 stars in my book. Always my first stop when I visi","useful":10,"cool":8},"6cJXWudmQYEONzr2iJMmdQ":{"text":"I am a friend of a previous reviewer and just want to reiterate that the staff working at ","useful":2,"cool":1},"v4ryY05V1iJPT0pa6oKCWQ":{"text":"If you're looking for an experience and like the flavor of absinthe (black liquorish flavo","useful":2,"cool":1},"qzA25yXEQRjzHTFmV6Ccew":{"text":"It's probably one of the original dive bars in New Orleans, but after reading about it, we","useful":2,"cool":0},"PTtxeSyR1cB3-tO3if65kw":{"text":"The Old Absinthe House is a cool old spot on Bourbon Street that has been here forever and","useful":0,"cool":0},"rSaWRAzP9-YAToig5KLBjg":{"text":"What a wonderful little bar!\n\nThis bar on the corner of Bourbon Street has such a cool vib","useful":0,"cool":1},"_ufW0wW8helm5RGdeLMJkA":{"text":"Stopped in because I wanted to get a absinthe in the original old part of the bar but unfo","useful":0,"cool":0},"dVjQtzV4rxMA_ZRy-JjttA":{"text":"I would give this place zero stars if it were an option. Let's start with the racist barte","useful":0,"cool":0},"5SwEA23PWZ5OQv9gED3UYw":{"text":"If you like black licorice you may like absinthe, but if you hate licorice you will hate a","useful":1,"cool":0},"Pq7wlCq0X9LMzCTOzg_glw":{"text":"Historic bar from the 1800s. This was one of the stops in our cocktail bar crawl that we b","useful":0,"cool":0},"ovhvqFTWhm48GqWdQPQTjw":{"text":"Must follow tradition...\n\nBefore our first dinner in New Orleans this visit, we went to Ol","useful":1,"cool":2},"91f1JJdVZ7zuATqhrDqZBQ":{"text":"The oldest bar in New Orleans average bar strong drinks in New Orleans everyone has strong","useful":2,"cool":0},"45SD0mz9FzoHJ4Ko0-IY7w":{"text":"came to this place twice within 1 day because they have a small outdoor seating and not to","useful":0,"cool":0},"3ULIPs67pzb79zezQxbQvw":{"text":"At this point I consider myself to be a New Orleans pro.  The first thing I do every trip ","useful":5,"cool":2},"AihIwNQ48761vtI7kCiiWw":{"text":"This place gets 5 Stars for the best bartender and the best bloody mary I have ever had.\n\n","useful":2,"cool":1},"YzNLSYXoBVKuk1S3C1TMcQ":{"text":"Such a fun place. Esp for some great Absinthe cocktails. Our stop everytime we are in NOLA","useful":0,"cool":0},"L_EqMXCDIXXKIMywZ1Qe-w":{"text":"The only reason to go here is if you really want to try Absinthe! My friends and I had nev","useful":1,"cool":0},"D53QMzyh4SyNLuvolJo2-w":{"text":"Super cool atmosphere.... Bartender knows her absinthe history. Made a fun drop in spot fo","useful":0,"cool":0},"emeULdO0Vb3_hzSlpR4kvg":{"text":"This is a gonna be a quick review. I'm not a huge fan of this place. One reason is the liq","useful":2,"cool":1},"o27FTzhQdQXXyowTMti73Q":{"text":"RULE #1: DO NOT PLAN ON USING THE BATHROOM UNTIL YOU ARE SEATED AND HAVE CLOSED OUT YOUR B","useful":1,"cool":0},"OoCMeRJtbkIRutSJyWahIQ":{"text":"Great bar with an even better atmosphere. I popped in here because it was recommended I ch","useful":2,"cool":1},"8BhkooW5ypCA_ML-fPhzAQ":{"text":"We had just left Pat O'Briens when we stumbled across this place, and I do mean stumbled. ","useful":3,"cool":2},"VWAHBw3n8JWNoh5Lr67Jeg":{"text":"A pretty standard bar off Bourbon Street, totally focused around showcasing its absinthe c","useful":1,"cool":0},"kCpqOQdU-52MfUa0QVd4Mg":{"text":"They really do the Green Fairy justice here.  We had 2 glasses served the traditional styl","useful":2,"cool":0},"9k4e6fNcIFxbketkrtr55Q":{"text":"Pass this by. The only thing of interest here is the name.\nThe drinks are sad, the ambienc","useful":0,"cool":0},"84Lybn4R81Kye2y-FBQlxQ":{"text":"Not a bad bar for being in the Quarter.  Call me a hater (it's OK, actually, because I've ","useful":1,"cool":2},"SX9EjN3NE_kvPSSNgqMrxg":{"text":"On a quiet Monday night, our group of 40+ medical professionals who were at a surgical con","useful":10,"cool":1},"VIcu1pN7gUNs-3Atg9hLEA":{"text":"The green fairy must have sprinkled her dust on me! \n\nIt was a week before Fat Tuesday and","useful":0,"cool":2},"2uBTENquT2iEnQO7-GUkCw":{"text":"We wanted to try Absinthe- and the experience at this bar was exceptional! Barkeep Missy w","useful":0,"cool":0},"YpKkEUqHkkJYt9d-qdKIGQ":{"text":"Properly described as an island of chill in a sea of crazy. Its amazing how things changed","useful":1,"cool":0},"b8ean2Xo9aKCQRC3Q4CjJg":{"text":"I love this place...especially at night when it's so damn dark!!!!  This is a must stop on","useful":5,"cool":5},"7AM59W2xki-5OjYvGHPtJQ":{"text":"Bartenders are amazing so five stars there, however a staff member decided to passively ag","useful":0,"cool":0},"7EW38xN_IOcYyJLt1lMwWw":{"text":"I was extremely disappointed with this place, it was just not what I expected and drinks a","useful":2,"cool":0},"baXlnCNaNsXXn9o0s2a09Q":{"text":"This is more like an outdoor bar area. They don't have any air conditioning and just like ","useful":0,"cool":0},"uIocba2jmEwe_bUatNj-Eg":{"text":"Awesome place!! CC aka Cristine was great!! Had our 1st\" hurricane \" cocktail !! It was ma","useful":0,"cool":0},"uVzrA2VlIA833Fy7dkMCbw":{"text":"Must see if you like your historic watering holes. I stop in every chance I get when in NO","useful":0,"cool":0},"Qff4FWnpbpuz5yUVws7dmQ":{"text":"Definitely gets the stars simply for the selection. Absinthe is something I am not familia","useful":1,"cool":1},"GBT3w3BVUG0ioCm-2y6cEg":{"text":"I did not have the absinthe after I witnessed the bartender use a basic glass instead of a","useful":6,"cool":1},"nXGteDPCLzs_TUdUiXrrRg":{"text":"this was one of our stops on our haunted bar crawl! Service was great and so are the drink","useful":0,"cool":1},"WrFRQTcsWj1yZ7rMbmdxqw":{"text":"I cannot believe we have not been here before this trip\n\nShame on us because this place is","useful":1,"cool":0},"3Z2iDZl6CgyjwuTfXKHF0g":{"text":"This is a really cool historical building that is a must visit on your trip to Bourbon. Th","useful":2,"cool":1},"avpCKrqCK2djxir8U6xe-A":{"text":"Ok this is not for the faint of heart... Absinthe is like drinking licorice gasoline, it b","useful":8,"cool":3},"Rf4vXdjj90UH55I6Ikm9QQ":{"text":"Okay you are on bourbon street, find the Royal Sonesta hotel and walk west to the cross st","useful":4,"cool":4},"dQ9a0j_tk6lOESXlGG5-rA":{"text":"Gotta stop in here. One of the bartenders has been working on Bourbon for 20+ years. When ","useful":0,"cool":0},"cW_seWdE1E4kwVB-vw8oUw":{"text":"Julie. That was the name of the bartender who understood a cocktail was meant to be more t","useful":0,"cool":0},"tUZUiJzSRvj2HDranESgWg":{"text":"It's a dive bar that has a bunch of different types of Absinthe. We were walking along Bou","useful":8,"cool":7},"gYxf4syBqrNsWdqTsAZygw":{"text":"Awesome spot in the middle of the loudness on Bourbon St. Great bar atmosphere and even be","useful":0,"cool":0},"8FEDWAXvoRtrWLRK0hW_LA":{"text":"I really love the decor and the vibe here! There's a really cool looking fireplace and bac","useful":2,"cool":1},"qvqssGb0YC8w4kABvWtn4A":{"text":"If you make your way down to Bourbon Street, this place is a must try! They are known for ","useful":6,"cool":6},"ROE0aVf1FKc9gwK9qA-6zg":{"text":"A dive bar that is just a tourist trap? I'm a huge fan of absinthe so I stopped by the old","useful":0,"cool":0},"ZtOx7Q9xKiyTe5qwfLCm9w":{"text":"A destination bar, I went here twice on my visit to New Orleans! Absinthe galore but I lar","useful":5,"cool":3},"abJdPoOWr9TfLBruCFV3NA":{"text":"Cool little bar on bourbon street.   I was trying to find a place that wasn't as touristy ","useful":0,"cool":0},"cTEJdbO7tF6MzChMbVRUxw":{"text":"I had no desire to try the absinthe...but gleefully watched as 4 frat-ish boys winced in p","useful":2,"cool":2},"ruUpMXroL8PVU6ka1NLj7Q":{"text":"I know bars and this is a great bar. Mitzi and Christopher are great bartenders, as are th","useful":0,"cool":0},"VmFgudbE9050fjsnQ88Thg":{"text":"This is a dive bar right on Bourbon street. The walls are lined with the business cards of","useful":15,"cool":11},"m8BBVh5bVnKcqpzv1KRm4A":{"text":"If you interested in trying absinthe this is the spot for you! I tried the Clandestine Ans","useful":2,"cool":0},"5OFLhwn6Lou1k6JbAJzFOw":{"text":"Love this place. Great pours. \n\nHad one of the absinthe cocktails. Wonderful. Even if you ","useful":1,"cool":0},"bj_1quOMjBkJcF8GL0dSzA":{"text":"I come here for the sazarec and the fireplace when it's cold outside.  It's a dark yet sup","useful":0,"cool":1},"6HlrQSy-cw0Te7zMZHU8QQ":{"text":"Hahahahahha! \n19 dollars for a weak absinthe drink that was mixed so poorly that I got a d","useful":2,"cool":1},"-dl4XcX0aMyiiDY0zwzyfQ":{"text":"Not bad...\n\nWhile in NOLA for a long weekend, our Sunday plans were a bit thwarted by Hurr","useful":1,"cool":1},"o3loeXjYjnxu3ncDeXgYjw":{"text":"You pretty much figure it out from looking in.  This bar is in a super-prime location, and","useful":3,"cool":1},"bTkt-pD-1SDeMjyaTsV_HA":{"text":"This is the second oldest bar in New Orleans.  Come in here for a Pimms Cup, and stay to h","useful":1,"cool":1},"_keHU76ExbakjnPKnxRWeg":{"text":"Draft beer was flat and funky.  Bartenders knew it cuz they immediately asked what else I ","useful":1,"cool":0},"6FiZxteonu0sibXR2DbxWw":{"text":"For years, I had wanted to try Absinthe, done the correct way.  I am not a big drinker; tr","useful":0,"cool":0}}