{"0OnsRdkOdRB-YPP9fdSe6Q":{"text":"I absolutely love these humans! they are super fun, professional, open and inclusive. The ","useful":2,"cool":1},"Q4y44Ux_tue5nYXzplywjw":{"text":"NoLa -- you are so lucky to get a Dark Garden store!!!!  When my wife wanted something for","useful":0,"cool":0},"r3p_RN8iK9BkHayOemky-w":{"text":"Want to feel AMAZING?  Go try on a Dark Garden corset- it will change your whole world. I'","useful":0,"cool":0},"JeMOnKTqbdis5GwBohYp-Q":{"text":"I've long been a fan of Dark Gardens corsets, living in the Bay Area. I've worn their crea","useful":0,"cool":0},"SQt3MEWhoMg4lSFw1IS83w":{"text":"I love Dark Garden! This is a must go too when in NOLA.\nSeriously amazing and stunning loo","useful":0,"cool":0},"J5otPEsiV13ftifmrRuudw":{"text":"I can't find enough words to praise the artistry and devotion that is put into every corse","useful":0,"cool":0},"x8NhOk5Nuucsiy_yKa1LeA":{"text":"I have been a Dark Garden customer for over 20 years. I have never had such a skilled, tho","useful":0,"cool":0},"BE1_TTVldqgTICS7NC1aHg":{"text":"Dark Garden is great on so many levels.  They make beautiful work that fits exactly as it ","useful":1,"cool":0},"M5PfTWEsJKSk2-Jgy23TSg":{"text":"I have owned 3 Dark Garden corsets over the last 20+ years everyone has fit superbly and i","useful":0,"cool":0},"e5aS3GtCHX3lwaeT4G9Mmw":{"text":"Dark Garden corsets are the best! They fit perfectly, are absolutely stunning, and last fo","useful":0,"cool":0},"OS4O7nouBVVEz3T7Tk1E4g":{"text":"One of my favorite things about shopping on Magazine Street is entering a store and feelin","useful":1,"cool":0},"Xc_MvB_RRXLVw8AnuDmfFQ":{"text":"I noticed this shop had opened when I was visiting the Ace Hardware across the street and ","useful":6,"cool":3},"7F4IahwGZBrgVtsMh38f-w":{"text":"Dear denizens of New Orleans! You are in for a treat with Dark Garden! I'm reposting my re","useful":0,"cool":0},"i67eJDh613rqguf89L4Rsw":{"text":"From San Francisco to New Orleans, Dark Garden is my go to shop for everything corsets/lin","useful":1,"cool":2},"gJHTcz_ZEV5OsqTIexWjew":{"text":"This place is the real deal: a lingerie and corsetry boutique that gives the true luxe exp","useful":1,"cool":1},"rkKHU_TBZJVy3U6Cg1HJuw":{"text":"Love visiting Dark Garden for events and shopping trips. I always leave with a smile due t","useful":0,"cool":0}}