{"l2ZdgVoyhV8jISp0tQBHVg":{"text":"Thank you Bryn for helping me start my 60th birthday off with some cold ones!!\nThen thanks","useful":1,"cool":1},"KOuQp8iDxnOBqzidXCbWRQ":{"text":"This place has amazing burgers & the best chili cheese fries \nWe live about 6 blocks away ","useful":0,"cool":0},"aVlLu0ZAv_UB0l1c0BCzgw":{"text":"Madigan's is the place to go for underaged girls (even though a sign on the door says they","useful":0,"cool":1},"yiz_AVnfY7Ng0_0pix71RA":{"text":"I am about to embarrass myself by writing a current review of Madigan's, a bar I swore I'd","useful":4,"cool":5},"S6KXI6fk66VSTfq5Qc5qKA":{"text":"Call Nancy Drew. Call The Hardy Boys. We have a case of another missing review on our hand","useful":10,"cool":6},"N4BQsm7UJMlsp9kDVIHHrw":{"text":"Service is horrible bartenders don't even acknowledge customers and have attitudes. As a b","useful":1,"cool":0},"tk22YbZQt2PAhsw3xkwclg":{"text":"$2 high lifes. All the time. Great bartenders who work hard. Thanks Veronica! Can also ord","useful":1,"cool":1},"eMJYmmGNNlN1dtFy3sq5sg":{"text":"Aside from a nice interior with dark wood paneling and a lot of really great art-prints th","useful":2,"cool":1},"TVnu0qpkmIRYk4kgDmiT_w":{"text":"This is the place where uptown panhandlers go to play video poker with the money they bumm","useful":0,"cool":0},"mEWPLggp0TidbraFFPwdfg":{"text":"Great neighborhood bar  excellent, friendly bartenders & owners. Great food after 5 from G","useful":0,"cool":0},"SUJ5uHQMy6YHX8xI0e9EtQ":{"text":"This place could be so much better. It has a great location, nice setting, it's clean, goo","useful":0,"cool":0},"PX0KGDmCe2k2_a0RkV8AgQ":{"text":"Love this bar! But recently i came in and a new bartender was working. Kristen was inatten","useful":0,"cool":0},"mFLHvO7xO92DjodWyapk7A":{"text":"When you feel like you are too cool for TJ Quills because you are now 19 (and thus don't w","useful":1,"cool":0},"EGHS7I1Ak5AeA9TyceB4og":{"text":"Great neighborhood bar! Love to come here on the weekends when Cooter Browns is too crowde","useful":1,"cool":0},"H75ASn7DRpVpQFqGAy8DVw":{"text":"Classic riverbend bar. Cheap drinks and a view of the Carrolton streetcar line make for ex","useful":2,"cool":0},"nJMV82APLDsvXw3hmq0r2g":{"text":"This place has been around for a long time and it shows. Solid service, drinks, and food. ","useful":0,"cool":0},"U965kh0lg5RqoOFSbo7oQg":{"text":"The Madigan's of today is no different than the Madigan's of the 90's. There is something ","useful":5,"cool":2},"cqTtIGXZ0rGWbV23N1FNSg":{"text":"Meh.  It seems like Madigans has gone from a great college and neighborhood hangout to a r","useful":0,"cool":0},"6JwPQoGhvcwbdjLX1eEuHw":{"text":"This is an inassuming bar tucked at the end of Carrollton. I often forget its even there..","useful":2,"cool":2},"j-1EMFFXTXdVB270SirTYQ":{"text":"Me and my friends' favorite place to hang out at. The bartenders are friendly and the atmo","useful":0,"cool":0},"dtiNA0wCblvnaeFy_ZtwNw":{"text":"Sometimes this place is great sometimes it's not. All depends who is bartending. I have wa","useful":0,"cool":0},"as5CPs-4rpFdhPoPu9vTsQ":{"text":"Cretins \nFired the good found the lame, cut off the jukebox paid for requests, now working","useful":0,"cool":0},"3MlC1KuHU9X6UtoS6pHn5w":{"text":"The death metal blasting out of the jukebox kind of turned me off. But, the place reeked o","useful":4,"cool":1},"Se1pMJzyGR8BxMH5eox8lw":{"text":"This evening's experience at the bar was not the first one that was disappointing. The bar","useful":0,"cool":0},"U7SZicces_OaLadgXqnvgw":{"text":"This is a basic bar in the Riverbend that offers a consistent experience.  It never seems ","useful":5,"cool":3},"pV1SI5bJ8P6ob2KLhRFQyQ":{"text":"Only been here twice but great burger and 20-30$ steaks. I like the location as well. I'll","useful":3,"cool":1},"w2kQquUCszlhcUCpcONHlw":{"text":"Ok, its not a cheapy cheap bar, but I'm fine with that. Yes, there are people smoking insi","useful":0,"cool":0},"cft8UQn-el69jJAJEQyBmQ":{"text":"I've been coming here for years. It's a really chill, low key bar with very friendly barte","useful":2,"cool":1},"b0wrIRrgWXFx8sjKrDSgzg":{"text":"Veronica, Bryn, Adrienne, and Meagan (sp?) are the best bartenders EVER. I would akin it t","useful":0,"cool":0},"bEbeabVppLL3WYbhSAA69A":{"text":"I ordered a Clase Azul margarita with a Grand Marnier Cuvee du Cent Cinquantenaire floater","useful":0,"cool":0},"WyfUDmIxppvqeLWzLh5tog":{"text":"WORST SERVICE I HAVE EVER EXPERIENCED!!! Card machines down for more than an hour (on whol","useful":0,"cool":0},"84sx3VmowGp5fbfGAm4oEg":{"text":"Madigan's is a neighborhood mainstay. I went quite often way back when I was in college an","useful":9,"cool":4},"vv91M0yMAVyZBOXAZt3R-w":{"text":"I cannot believe I haven't ever been here before.  Ok, ok, ok, we're super neighborhood-or","useful":2,"cool":1},"pDu6B1kQtwZIVfWmjFKwLQ":{"text":"Ok, so I went here one Friday night after work for happy hour. Happy hour is until 7 P.M. ","useful":6,"cool":6},"SkC2eRC5Ve2lSZ9Jg5_NuQ":{"text":"I still can't say enough great things about this bar. Since a lot of the other reviews are","useful":1,"cool":1},"3EnYgf_iSgOKRAmTQM3TJw":{"text":"The bar has opted to stay closed until more restrictions are lifted. It is not permanently","useful":3,"cool":0}}