{"GTn38yqKPMh02MGZfl9VeQ":{"text":"Noooooo. Just no. Spent forever in line for really really sub par food. The regular size o","useful":0,"cool":0},"ocnSbjZzSGrUcXPWEkNiUA":{"text":"Vegetarian super burrito with Pico, sour cream, and cilantro is the bomb. Best healthy mas","useful":0,"cool":0},"JNl1uXWJmJKdbreIcXbPJw":{"text":"Felipe's offers deliciously fresh and authentic Mexican food. Their nachos as well as thei","useful":2,"cool":0},"I85dCoIx1sD1Lou5_G3emA":{"text":"Yeah, they just opened, and they're probably finding out what works and doesn't work for t","useful":2,"cool":0},"426CkHfeO5ntGUBNC9HrQQ":{"text":"Had a hankering for south of the border style food and ventured over to Felipe's.  Tried a","useful":1,"cool":1},"7k9yvDaxaq6KH8t2KxZt-A":{"text":"I love Felipe's food.  My rating is so low because i tried to place a a togo oder. I tried","useful":0,"cool":0},"fZODBxEkpnR4VG6IS3Qxvg":{"text":"Great new place and great atmosphere.\n This new location is pretty much what you can expec","useful":0,"cool":0},"xLvj7IGwFNuwFfWmg4lT0A":{"text":"Ok, but not good. Very disappointed. Ambiance was lacking and service on the bar side was ","useful":0,"cool":0},"vTNsay2qfxZ9psF3frMHcw":{"text":"Al pastor is the best meat. I always get both green sauces and the habanero salsa. also, t","useful":1,"cool":0},"tojKFMu5gdyOdkLyjv0hjA":{"text":"I love Felipe's! I like the Carrolton location so much better the FQ! Chimichangas and mar","useful":1,"cool":1},"SoEetmAwYj3m0kxKZJJWJw":{"text":"Queso dip = heavenly!! The service at the bar is great, Liz the bartender is super awesome","useful":0,"cool":0},"zLJTFHYlhl2-Y40NGExRsA":{"text":"Way better location than the French Quarter one. Parking galore (which you don't have to p","useful":0,"cool":0},"l0Fjp7eCheB4e-aHQUUWfg":{"text":"The best Mexican food I ever ate hands down. Whatever you get from here you will not be di","useful":0,"cool":0},"BBMb3XMgD7vQXMw8ikhEgA":{"text":"Wish we had these in Texas!  Great atmosphere. Great service. Fantastic burritos! Grilled ","useful":0,"cool":0},"MV8dSbkbMEl9RhtV56mE5w":{"text":"Food is good but the service is sooooooooo slow compared to the Uptown location. All I wan","useful":0,"cool":0},"s0sTqpCq7Q2vxWDWUC-Dow":{"text":"This location has very poor customer service. They don't understand English very well and ","useful":0,"cool":0},"AykQCEUvnI-oUBiNzMviZQ":{"text":"I went to Felipe's and the server refuse to cook my meat well done. I cannot eat medium ra","useful":0,"cool":0},"tpVwyu7hXFMAg0r08vjA3A":{"text":"I enjoy the food but rarely enjoy the general demeanor and friendliness of the staff, also","useful":1,"cool":0},"YWZ6L32VNJj1BGwUQQcf9g":{"text":"Ashleigh is the best! We had great service even though the bar was packed. I like that she","useful":2,"cool":0},"I2PiGnvthz8jYSF58lcTfg":{"text":"Parking is a B here. I always park in the grocery and I have to fight the little old ladie","useful":0,"cool":0},"IAx6hKoEIzqLxNvTU6AjCQ":{"text":"Not impressed with this location.  The carnitas is bland and dry and the overall quality i","useful":1,"cool":0},"nYOzs2C9RPvs3x4haSeSuA":{"text":"I enjoyed our dinner on Friday!  The drinks were great, the food was really good and reall","useful":0,"cool":0},"EGEyBjYlrsQPu7WpUELF0A":{"text":"First review I have ever felt compelled to write. The service has slowed to crippling pace","useful":0,"cool":0},"PuftTfpq4B0lPFTgn41xEw":{"text":"I was so excited when this location opened. Not anymore. Took my kids and we all were disa","useful":1,"cool":0},"BKGS_QS_6QLVFqYUAEBM8Q":{"text":"My all time favorite Mexican restaurant in the city!! Come here weekly. Everything is fant","useful":1,"cool":0},"3vVa1B2UerlvuQvhqwku4w":{"text":"Great drink specials and I truly enjoy the employees 80% of the time, and one of the barte","useful":0,"cool":0},"p9r9tK4xPudgSwPWB5QwTw":{"text":"Felipe's is definitely one of my favorites. The workers are kind and quick! I'm a fan of t","useful":0,"cool":0},"mP5XlOYu5HtiZ8Q5hGY7-A":{"text":"Recently went here for drinks with a friend.  It has definitely improved since last time. ","useful":0,"cool":0},"uVIP5-j3wPdyp5UErseJ3Q":{"text":"It's my favorite to go to Tex Mex food. Easy, fast, delicious, cheap and I always have eit","useful":1,"cool":1},"BgMvW99vATEfNpcUeiMe_w":{"text":"As much as I want to really like this place, it just never really impresses me enough. The","useful":3,"cool":0},"8x3hCaoWWqTCvbU0Kbaxhw":{"text":"We eat here about once a week. I find myself craving a Feilpes burrito. The prices are fai","useful":0,"cool":1},"pszWELV-r3Y7JyWW_x_EZQ":{"text":"Fresh, top-notch ingredients and quick service- this Felipe's location is one of my favori","useful":0,"cool":0},"e7NtXdMBDzHgmHEaDQ1NsA":{"text":"Everything was hot, fresh, and authentic.  Fed the family of 3 for $30 and left overly sat","useful":1,"cool":0},"cADByJiO3u0OsV-jc5b7sw":{"text":"I stopped in here to have a margarita and a taco. I sat at the bar, which was a little str","useful":0,"cool":0},"sY2WerIgzavfi1IZtlz0QQ":{"text":"Though they don't have the full menu as the one in the quarter, Felipe's in Mid City produ","useful":0,"cool":0},"3rCXG73f4N1ko2tqodKawg":{"text":"Very friendly service with beyond exceptional food!  It think this just may be the best (a","useful":0,"cool":0},"ueK7q-SI2hFOMRybHWi_Uw":{"text":"My 700th review!\n\nYou know that I had to come back to an old favorite. There is finally a ","useful":6,"cool":3},"N4JRJfotaQ7uqzhW88vPNw":{"text":"I seldom meet a burrito I don't like. Usually because burritos are a go to \"I'm gonna be d","useful":2,"cool":0},"3sgrjziQ_MRCRJzeHQn4YA":{"text":"Y'all do not order from this location on Postmates!!!! Please. Save your $$$. Whatever you","useful":2,"cool":0},"00LsAcupTX119RMWg7DIIA":{"text":"I used to be such a regular at the uptown and French Quarter locations to the point where ","useful":2,"cool":0},"wFTQhOqEyrtItxyfn2h1bw":{"text":"Just like many of the other reviewers I've had great experiences downtown and uptown, and ","useful":0,"cool":0},"TMaZkTfbUq2e3e3TUQkWtw":{"text":"Stopped in for a bite with the family recently. Staff was friendly, food was made efficien","useful":0,"cool":0},"2gbu4hYT31sFFb8xzwr12g":{"text":"That was my first visit to a Felipe's but I wish there was one closer to me! Come to Flori","useful":1,"cool":0},"kopH374O1SLy0oqJ4l698A":{"text":"I do not like the food here. It is overrated, the food is bland and gross. Juan's Flying B","useful":2,"cool":1},"BU72wPz_940d30lfGdA8rA":{"text":"This place blows my mind away. $10 for a combo and it is awesome! They roll that burrito u","useful":0,"cool":0},"_Av5f7cru7lyzGsYrejZeA":{"text":"The service here is painfully slow. I've been twice now, since they opened up in the Mid C","useful":0,"cool":0},"3kJsrkb2sF4b87CrJQHc1A":{"text":"My boyfriend and I got the chicken quesadilla and the carnitas nachos to share. The quesad","useful":0,"cool":0},"b9QO90ZEMB0f3ZHhlRz4VQ":{"text":"Love this location and the staff. They do fun events some nights out on the patio. Food is","useful":0,"cool":0},"5o1iEPi34st9JmoG_IsRcg":{"text":"I end up at Felipe's more often than I plan on! I love their cocktails, their margaritas, ","useful":1,"cool":0},"AjtyXl2trEHCtYUoC1vB6g":{"text":"No SOPAIPILLAS!!! Hellllllo, it's a mexican restaurant that has brownies, but no sopaipill","useful":3,"cool":0},"ZMgI9wziB4h6-J7CNKOFAg":{"text":"We have a group of 6 and we eat out every weekend. Felipe's is top in our list for Mexican","useful":0,"cool":0},"wj-XysXUsM_MqnVcMEKXMQ":{"text":"This is a great stop if your in the mood for a quick bite. The ambiance is always a hustle","useful":0,"cool":0},"9mK9AeZxvovPpsG7KEucFw":{"text":"I'm surprised to be honest at some of the bad reviews of this location in comparison to th","useful":1,"cool":1},"_5lkkqL0ouEog8ET0jIwmg":{"text":"So very close to my home, very convenient online ordering! The only problem I've ever had ","useful":0,"cool":0},"WckmU1vFSyKboMHc7o8rfg":{"text":"They finally got it together! At least while we were there. It was after the lunch rush bu","useful":0,"cool":0},"CBohnawon7ZLPVRz45Qlwg":{"text":"Here's a place where I wish had table service, besides the bar.  It's an interesting conce","useful":0,"cool":0},"OtYaUE7THHW1yCZHcHSTBg":{"text":"to my friends who haven't been here, i like to describe Felipe's as, \"Subway for your burr","useful":0,"cool":1},"Mn9jclm8sWnbmAKIZnsUvA":{"text":"Came here with family for dinner and it was great, very friendly staff and yummy food! Gre","useful":0,"cool":0},"f7iFBMNwe5M_8BX371WJ8Q":{"text":"I have not been to Felipe's for a while but I went there tonight. What a disappointment! T","useful":1,"cool":0},"1ZIgP21sQiJKFmecd8KjXw":{"text":"Felipe's is really good!  It seems to be on the expensive side but overall, the food is so","useful":0,"cool":0},"9DKjypRj-P_rBIIB-_XWAA":{"text":"Ok The Guys that prepare the food are Awesome!!! I guess I should have knew better than to","useful":0,"cool":0},"cW6QzQFmrbxm93Qz1UaUNQ":{"text":"I love Felipe's.\n\nLoooooooooove.\n\nI flew all the way from Baltimore just so I could eat he","useful":0,"cool":0},"_1ChDAnTSqfeZlLnwYliIw":{"text":"Food and drinks are like every other Felipe's I've visited in the area so the quality is c","useful":1,"cool":1},"GM3MjORZitAjS26HdbrhLQ":{"text":"Full disclosures first:  I am a vegetarian and a California native.  Ok, here goes.  I gav","useful":0,"cool":0},"hCScpLK2XLWyaaL4FQ3lOQ":{"text":"one star because I can't post without clicking on one but it deserves NO STARS. rude staff","useful":2,"cool":0},"yATa9pUq-CbiUUhbSrZLvg":{"text":"I visited this location this past Wednesday. It was $4 margarita day. One thing I don't li","useful":1,"cool":0},"VJks2VW2Cvusq8q8wN28rQ":{"text":"not as fun as the qtr.   maybe its cause of the layout, and the people inside, but seems o","useful":0,"cool":0},"e7OyDOU7_btga7lcT6USeA":{"text":"I love coming here when I need a quick bite to eat but am really hungry. They also have ki","useful":0,"cool":0},"6-eNVr-dlWx6xa44Vt7Btw":{"text":"Once upon a time a long time ago the mid-city location was really good . the food was fres","useful":1,"cool":0},"bliueujEy9tiXIwrVakL9w":{"text":"SSSOOOOO RUDE!  Unorganized, total mess. Jennifer was especially rude.  All the employees ","useful":3,"cool":0},"7dnlkUXcxMunHSKVK5L2sQ":{"text":"I'm really glad they opened up a Felipe's in mid-city! The quarter location is always way ","useful":1,"cool":0},"yqRW6PJaHwKCZBOpdcO8Og":{"text":"Steak nachos consisted of some sliced cheese that barely melted on not fresh chips and ste","useful":0,"cool":0},"B2sYD1ePm9OqQsKaqYGWRg":{"text":"Nice margaritas like the one in the quarter but my burrito was cold and between that and t","useful":0,"cool":0},"G9rb6sUAfGc4qVpFlUwCzQ":{"text":"The best tex-mex place I've been to in New Orleans so far!  Great food, and its cheap!","useful":0,"cool":0},"c1sKlmgZc0BegyJDmygJpg":{"text":"Good burrito make line. Get the quesadilla. It is basically a burrito with cheese on the i","useful":0,"cool":0},"7ryrcSeCVbFDHnRW-TNCww":{"text":"Wait forever at the bar, the worst. Otherwise, good for what you pay for.","useful":0,"cool":0},"ZcmpNanzIKBphqHUiIXtiA":{"text":"Felipe's is good the price you pay. \n\nYou have a vast option to pick from and the salsa ba","useful":1,"cool":0},"Qg4gbieR6NaDlRZ3pLopzQ":{"text":"Any bar that makes their margaritas with hand squeezed limes, the good kind, is a place I ","useful":0,"cool":0},"J1snZaZnpE6hIyFH-LQI7g":{"text":"I love this place.  It's open until 11, and the employees are always friendly and the food","useful":0,"cool":0},"Uuph41qdZKpgSI_Q8X3_nw":{"text":"Went for lunch the other day with a group of about 10.  We got there pretty much at 11, so","useful":0,"cool":0},"Cbe8eqpwBnuJoUdiwyAaNQ":{"text":"Good, quick Mexican food they way you want it. Pick your format and all ingredients and yo","useful":0,"cool":0},"D_lI5U9p1ZbnMmHYU1nOgg":{"text":"Busy fast food. Order at the counter like McD's and you get your food a few minutes later.","useful":0,"cool":0},"gym1ikpODuL_fQ6qVp2zAw":{"text":"I love Felipe's in the FQ so I was thrilled that one was opening in Midcity without the hi","useful":0,"cool":0},"kzB024FASiQgZJ5h9k1Q5A":{"text":"Mexican Margarita = huge draw card for me and my fiancé! Quick service, sit at the bar, in","useful":0,"cool":0},"kjoldrI_0DglnU8h70fPvA":{"text":"This is my favorite burrito place in the city. Try their al pastor if you're looking for a","useful":0,"cool":0},"OwgbstQ8uZz8uFvvOUYpKw":{"text":"I was so excited to try this place out, and once I got to the front of the line, I noticed","useful":1,"cool":0},"Acbt356gEx3wG1Yf5nGdJQ":{"text":"Best gay bar in New Orleans tonight for some reason!  Props to Derek behind the bar!!! Mar","useful":0,"cool":0},"vTVwemPD4KJiIyMY6hfCHg":{"text":"My favorite place to eat!! Better than Moe's or Chipotle. My favorite is the quesadillas &","useful":1,"cool":1},"Zi4zInE1zVo8MYHF8-XM6g":{"text":"Have you been to the Felipe's in the French Quarter? In Uptown, by Tulane? If you answered","useful":5,"cool":4},"Pjc1_FE1WQ4Zw17vwYXJ_A":{"text":"How can you not love this place?\n\nIt's quickk. It's fresh. It's delicious. And it's afford","useful":4,"cool":1},"Wm3U0MjtI4fSC89usQRwEA":{"text":"Ordered delivery from Felipe's yesterday. The tacos were good, but I was missing 4 of the ","useful":0,"cool":0},"NM-xSB3vwODobvBrq2MJqg":{"text":"Melanie is an angel and one of the best bartenders I have ever had. Every time come (which","useful":0,"cool":0},"EKwDv9uB6bZMYFs7hE7L3A":{"text":"I have not been to Felipe's for a while but I went there tonight.  I had noted a few issue","useful":1,"cool":0},"F9pBg6MXz9DYm8FTJAc3GA":{"text":"Yummmmmm! Great food, great service, great drinks. How does this place only have three sta","useful":0,"cool":0},"9H66iHcbBiYc3StQhuVY6w":{"text":"For being to-go ready food.. it's amazing! Frozen margaritas are amazing and the experienc","useful":1,"cool":1},"PUn4KpRkZrZls55E1ONjXw":{"text":"Best Mexican Taqueria in New Orleans, hands down! I don't think I've ever had such great s","useful":0,"cool":0},"GnPCWAGpU_iFOetFpKkvPg":{"text":"I go here pretty frequently, and like it a lot, but find it awfully expensive. The add-ons","useful":1,"cool":0},"C2YjOUMAnQfkzPZt-rZq7w":{"text":"This is by far my favorite felipes location. Growing up in the riverbend I still come to t","useful":1,"cool":1},"_9aaOb4W9vlEQFWUaz-H-w":{"text":"Felipe's is one of my favorite spots to grab a quick bite to eat for dinner. Fabulous (and","useful":0,"cool":0},"6mLlylE3eQOYgNpJUc_yLw":{"text":"My girlfriend and I eat Mexican/Tex-mex food all the time. We both even work at Mexican ea","useful":0,"cool":0},"9FhY-QJheW6mVYgjb_aBvA":{"text":"This place is amazing! I'm from Chicago and we have fantastic food but this is some of the","useful":0,"cool":0},"wufRwkwuJo_s4eQFaXBM0A":{"text":"After my last experience I decided to give this restaurant another try. In part because I ","useful":0,"cool":0},"VHQ-cIj5RM8nZj7tlxeZVg":{"text":"Wow! Felipe's has been my go to for burritos since forever now. Yesterday I brought some f","useful":1,"cool":0},"wlTA5vF0F09tKqcLIXaSQA":{"text":"Updating review!   I'm really impressed with the owner's urgency to get this issue resolve","useful":0,"cool":0},"zyNbzz-DEywlZhd78rs75Q":{"text":"I really like this location and the food that is served here. I always get the Baja shrimp","useful":0,"cool":0},"xytLooRYAc2cEs_L2ujGoA":{"text":"I will say this, the food here is pretty bangin'! I got the super burrito with carnitas, g","useful":0,"cool":0},"b8rzBmUvsRbNLRLsDPs_DQ":{"text":"I like this place. You can order a' la cart. And it a fun atmosphere. Easy to find and eas","useful":0,"cool":0},"WtkAZpimsSQyqCvUXlS3AQ":{"text":"Mediocre.  I get the burrito bowl or whatever they call it when you get no tortilla.  At o","useful":0,"cool":0},"QAy1Mw0GViitI2QWUgGNyA":{"text":"Felipe's is dope. \n\nI went here with a friend and sat at the bar. The staff was entertaini","useful":0,"cool":0},"XsdDIv9Jdk4QuQpv-069xQ":{"text":"You'd be pretty hard pressed to find a Mexican restaurant that I wouldn't enjoy, and Felip","useful":1,"cool":1},"kdhhFmd077w_qplZn1BoBg":{"text":"So, I'm updating from my previous review. Pike and the rest of the Felipe crew certainly t","useful":1,"cool":1},"T6szmcBabRBCWCssj5SEmA":{"text":"Just ok. I was excited about the mid-city location, but disappointed when I tried it. The ","useful":2,"cool":0},"breMkqxmXTXm5iKzBf49nw":{"text":"This is one of our favorite places.  Near the house, tasty and reasonably priced and most ","useful":0,"cool":0},"GUUmTnpSawba9ulQaOvNsQ":{"text":"Three and a half stars for the food, but 5 shooting stats for the staff that shows so much","useful":2,"cool":2},"X-7WGmWX3W_9rZ0g8vNccw":{"text":"The house margarita is pretty decent (that's how I generally judge the bar at a Mexican pl","useful":0,"cool":0},"Du0qWFp8LwAs_xBcUi3gtA":{"text":"First time trying this spot and it was a good quick bite. Casual atmosphere connected to p","useful":0,"cool":0},"kr_pCFK8S23rGLGNqV98qw":{"text":"This is my go to mexican food in the city of New Orleans. The Fillipe's special and pork f","useful":0,"cool":0},"FFF8s79WfrJXw7V3ySWMhQ":{"text":"I hate Mexican food, but I was surprised by my love of it when my friend brought me here. ","useful":1,"cool":1},"faK9E4y8_WllZU-Wbu4oaQ":{"text":"Really good food and reasonably priced. I eat here a lot and I've never been disappointed.","useful":0,"cool":0},"_QaGqQJzWO7hiJXJ6O6bZA":{"text":"Felipe's is definitely one of my favorite places for a great margarita and delicious food.","useful":0,"cool":0},"Q3KM9GGGibQ6QGX7hbVj1w":{"text":"Really good and fast service and makes me feel closer to home. Sweet staff and pleasant at","useful":0,"cool":0},"WnDAM33ZLx7VS0m5IiCK9w":{"text":"Felipe has never done me any wrong when I do eat here, but I feel like they are kind of ex","useful":1,"cool":0},"LQQWEl57VB1IayzSVMmVXQ":{"text":"Tacos are great! Margaritas are amazing prefer on the rocks but frozen are great as well. ","useful":0,"cool":0},"Yp9kpFzG-7OTTHTv9j-l1Q":{"text":"Felipe's is the cornerstone of my well-being. They've had my back more than ever has been ","useful":1,"cool":1},"Jp49x4ZIbF-CsnUonJDF-g":{"text":"Awesome food and drinks!!! Best bartender Anji ... always smiling, friendly, and even reme","useful":0,"cool":0},"15b_EpQiFbOf1AzYw66IbQ":{"text":"I decided to go here one night with a friend because she lived down the street. The servic","useful":1,"cool":1},"1h4rjPRZPuC8xhm55t8TsQ":{"text":"Eat at the bar for table service.  The food is quick and delicious.  My favorite is the ta","useful":1,"cool":1},"5QRGoNV5mtGr_9oGlPlQYg":{"text":"Love Love Love Anji!  Her spirit and energy is ever flowing with positivity.  Great drinks","useful":0,"cool":0},"zswfvW3UDz1IvPMnnMYGeQ":{"text":"This location has relatively nice seating outside. The food is always great and consistent","useful":0,"cool":0},"5wNQ_jtauy3wj6AuGo_LUQ":{"text":"Can always count on Felipe's to get the job done. Only drawbacks are occasional slow-movin","useful":0,"cool":0},"hkpGnOseEGNem8qU1-UDrg":{"text":"I am here way too often. Usually on a Wednesday. They have $4 (small) margaritas (regular,","useful":0,"cool":0},"dtyrjHp5k9z067O3tpucjg":{"text":"Big thanks to the employees of this Felipe's! My day is made each time I visit to pick up ","useful":0,"cool":0},"IzMI0nRjZvc6___4sND3cQ":{"text":"UPDATE: I have been contacted by the owner twice to share his concerns. He assured me that","useful":0,"cool":0},"KhxF0dU4SlEDM1mJSLR7Cw":{"text":"Ordered delivery from Waitr last night. We had tacos but salsa was put on them which made ","useful":3,"cool":0},"RHc-aCCylWASpKuoIbEMMA":{"text":"Their Chimichangas are undefeated. Great drinks and vibes. Very versatile menu for the pic","useful":0,"cool":0},"B6EKPs_4TQhmfrmVhN297g":{"text":"I eat here a lot, and the food is always consistently good.  The nachos are enormous and I","useful":0,"cool":0},"ZSmChzLWJl8TL_O2hIwqUQ":{"text":"The customer service was suck.. Rude employees with no customer service skills. The shrimp","useful":1,"cool":0},"wEoQm6EFpMyt4K3v0KkYFg":{"text":"Of the Subway like Tex-Mex joints (Chipotle, Moe's, Izzo's, etc) Felipe's maybe my favorit","useful":2,"cool":1},"BF6H71HBv-DclAAwKBVz4A":{"text":"REVIEW UPDATED:   The owner was very responsive to my concerns.  He personally reached out","useful":4,"cool":0},"VWA1PUWXsk1Tyr60oH9rCg":{"text":"Felipe's has been my go to spot for burritos. The fresh food and flavors always leave me s","useful":0,"cool":0},"7qGV93h860WmN4BPc5R5jw":{"text":"Update: Tried Felipe's again, because the tacos were so good. I wrote in the order notes a","useful":0,"cool":0},"1EwxbqvsODkJr2YT4MNpLw":{"text":"Yummy food in a fast food atmosphere! It's a good place to eat while in New Orleans if you","useful":1,"cool":1},"ryzSSDnvvzPET-IeBx8kNA":{"text":"This is my favorite taqueria :))\nThe Chimichanga is the best. The tortilla soup is delicio","useful":1,"cool":1},"PgFWqjGPfdoEreqP9HX9Tw":{"text":"Anji is a great bartender with excellent serving skills. She made sure my cup was full and","useful":0,"cool":0},"9A2iZv9EtCSa6FD167HloA":{"text":"UPDATE:\n\nGreat customer service. When I expressed an issue with their restaurant, the mana","useful":0,"cool":0},"oUUmhuVGRS5wQ_fNMGkHQg":{"text":"I love this place. The food is always hot and fresh. We got takeout a few nights ago and I","useful":0,"cool":0},"wwmVcfgIrJH4wfh923RJYQ":{"text":"When we first walked in we didn't know where to start so we asked the cashier and she said","useful":0,"cool":0},"BMM3BBlc8coRo8SpavDUGw":{"text":"I can't believe I've never written a review of Felipe's before which is crazy because I ea","useful":4,"cool":3},"jEnKqpVCafbZLVq3z2JGcw":{"text":"I've gone to the location of Miro St for a while, but since I moved to a job site closer t","useful":5,"cool":2},"tbOcPmzToMIAcLNoUwxCAg":{"text":"The food a Felipes was very good and worth a 5 star review. What is more important was how","useful":1,"cool":1},"WzOZ6hBtRAo7skVaElOVeg":{"text":"The guy who started my burrito tonight was very friendly and personable! I think his name ","useful":0,"cool":0},"8CQwn4LfEtBpWMFYPru-6Q":{"text":"This is one of my favorite places to eat in Nola \nMy boyfriend and I are here probably onc","useful":0,"cool":0},"HHQlOpwJqqlDvM19NlIiPw":{"text":"One of my favorite go-tos for a quick lunch. All of the ingredients always taste delicious","useful":1,"cool":0},"oOZoFqspz9SCtw4cSCV0Jw":{"text":"Food is always fresh and wonderful. We go there often. Convenient location with loads of p","useful":0,"cool":0},"KdJtLARo_H_Um_Se3Nt09A":{"text":"In my previous review I mentioned of an inconsistency in the service and product I receive","useful":0,"cool":0},"hI5_6vR8bHhr_QM_bsuoXA":{"text":"I went to the Felipe's on Carrolton, and had the steak and chicken burrito with queso on t","useful":2,"cool":1},"GN9fA9s59iPFSOOmef2dCA":{"text":"Changed my review.  Felipe's management made good on a disappointing evening.  We generall","useful":0,"cool":0},"CDmvInIfjMpjU7FrOYtQpw":{"text":"I love Felipes. Omg the salsa is so fresh, and Noah our bartender prepares the most amazin","useful":0,"cool":0},"hU8VcXFw3LctNBzTQTYAyg":{"text":"I enjoyed the burrito. The ingredients were very fresh, and there was a great selection. I","useful":1,"cool":1},"lG2QYyO27PV2ViHt_bM0hA":{"text":"I go to Felipe's all the time! I live and work very close! However this time wasn't very g","useful":2,"cool":0},"s9C9PA8Yeobx_JWSRfuwQA":{"text":"Thank you for the chimichangas and strawberry filled churros! I introduced my husband to i","useful":0,"cool":0},"BlDroyBMjUyjrpRTahgCrg":{"text":"Didn't manage to grab a pic, but ordered catering from Felipe's and everything was amazing","useful":0,"cool":1},"5KouPnQZ84IsyuT9Vw9ZpA":{"text":"So happy to find such a delicious Mexican cafe in Nawlins. The staff were incredibly helpf","useful":0,"cool":0},"Gj1yd8_EYf3Euw0XPRfD7g":{"text":"This WAS our second best \"taqueria\" to go but after the treatment my sister received today","useful":0,"cool":0},"UXK4zKYOoDo5Mnk20MVl7Q":{"text":"Never ever been disappointed. Keep in mind it's a Taqueria! \n\nMy food is always fresh! I n","useful":1,"cool":1},"c_8WKCgk11otM2U3vopq4w":{"text":"Big fan. When it's packed and only one side is open (which is often the case), it can take","useful":0,"cool":0},"gPqojr9Ffvwlpv7TTiUmmg":{"text":"I've professed my love for Felipe's at their other locations, and was beyond excited when ","useful":6,"cool":4},"ji9gEa4LIfl5ZhFmzKt35g":{"text":"My absolute favorite Mexican restaurant in New Orleans . The food is always fresh and fast","useful":0,"cool":0},"3zgqP6v5bQlOYbLrRYsWEg":{"text":"Man, there are some whiny reviewers here. What is it about taquerias that brings out all t","useful":0,"cool":0},"btqL-pRXLZHtnIEjg7-LkQ":{"text":"Everything was amazing. Anji is the best bartender ever. Everything she made was delicious","useful":0,"cool":0},"kahbjkzbiB-p8S-FTnLvjg":{"text":"I love Felipe's!  Awesome food. Quick service. Amazing margaritas and mojitos!\nGreat happy","useful":0,"cool":0},"sBynBHxXVwgu3IKCBKAQRw":{"text":"I am kinda obsessed with Felipe's. A Mexican restaurant that encourages me to make my taco","useful":0,"cool":0},"F7Uob5ClPNNG0d6Jz5fRhQ":{"text":"I couldn't love Felipe's more if I tried. I've been a Felipe's superfan for almost 10 year","useful":0,"cool":0},"q6itiX0Di3wmKkPo9hjr3A":{"text":"I had Felipe's two days in a row because the burrito bowl is so good and filling. I ordere","useful":3,"cool":2},"vXLS9V9JAMUEwPew22UyWg":{"text":"The taco are very good.  I love the chicken and shrimp.  I like the fact that youu can dre","useful":0,"cool":0},"rUKVZ_K77qoAjQTs4M8hfQ":{"text":"Like the other 2 Felipe's the food comes out fast and is really well priced. The food is s","useful":4,"cool":2},"-iqyZGMHDhkwLU8gq2DCYg":{"text":"For the price, your better off going to Chipotle.  Kind of expensive for what you get and ","useful":1,"cool":1},"K7SyrhGFrYFDxI17eq3ZFg":{"text":"I was SOOO excited when i seen there was a Felipe's in Mid-City. I think the prices are to","useful":1,"cool":1},"dKT5j1m3_Wp-Ev_kkp2BVg":{"text":"The flautas were really taquitos. I still want flautas. I was very disappointed.  Make sur","useful":3,"cool":1},"3K1-B13ebWJro3_FlTvJTg":{"text":"My absolute favorite Mexican restaurant in New Orleans . The food is always fresh and fast","useful":0,"cool":0},"EdQ5Lq55lTcRPa3FK2-yQw":{"text":"if you are in a bind and need food.  burritos are tasteless.  it is fast food so what do y","useful":2,"cool":1},"7JrlTLQ0KiGvHmvuR-Zy-w":{"text":"Great response regarding my lack to order properly through Postmates.  It's a la carte so ","useful":0,"cool":0},"cvAVTjiXicVmDEwv09e0Kw":{"text":"This mid city location is just awful!! The lackadaisical employees don't know what they're","useful":0,"cool":0},"TBE8c-vZp0ZgdSa2Jigx-A":{"text":"I've been going to Felipe's for about 5 years now. My order is always the same! Regular st","useful":0,"cool":0},"hjiZi_VsNcT5tWZ8WZ6Pxg":{"text":"Cold and crusty tortillas, food was slopped together and items were missing on half the or","useful":1,"cool":0},"AjnHV-wwd4dDwIoPyA1N5A":{"text":"This is the best felipes in New Orleans hands down. Make the drive, the DTLA location is m","useful":0,"cool":0},"ncfR0VnzJsD3HEoEsjugKQ":{"text":"Three strikes and you're out.  I used to come here every week for the past five years, and","useful":2,"cool":0},"8nJ-Gx8O6uIHGNXDs5buAQ":{"text":"Wow, I have never interacted with people this rude at a restaurant before. The food is goo","useful":1,"cool":1},"8jJ4eUDAFHrG4aKSBBjKnw":{"text":"Yummy fast Mexican food.\nI normally go to the Mexican restaurant next to Brocato's but was","useful":0,"cool":1},"GsXQ0uqsKz113mKIFkMCoQ":{"text":"This Felipe's location honestly doesn't even deserve to have the same name as the one Upto","useful":3,"cool":1},"DbeZgiEtp-k5MpItRC3c5g":{"text":"Inconsistent pricing, HORRIBLE customer service. Came here on 3 different occasions and wa","useful":3,"cool":1},"kdgHA--EJGQ6cOS7EK-A3Q":{"text":"Left within 5 minutes. The service was non existent, and we got tired of waiting. The orde","useful":6,"cool":3},"81-SgzVQgoQzUmcQau1t_A":{"text":"The restaurant part of Felipes was absolutely amazing the long-haired man working at the r","useful":1,"cool":0},"V9D31kxiVIRA86-NuL2uQA":{"text":"I visited Felipe's on Nat'l Tequila Day, which I found out about upon arrival. I saw that ","useful":0,"cool":0},"kcEnWDKCnedI-jZCQeytfg":{"text":"Beware! Don't ever order online, pick-up or Uber eats. I have given Felipe's THREE chances","useful":3,"cool":1},"WeelaJT2NfEa8H8sXqbSwA":{"text":"Didn't appreciate how Felipe's served their sangria. Our bartender literally poured UNDER ","useful":2,"cool":0},"Eb1obNTJWR-UErQi4ADw1w":{"text":"What's not to love about food wrapped in a tortilla? The veggie burrito is uh-mazing. With","useful":6,"cool":5},"nQaNNS1L3sgdY74J7udtvg":{"text":"My original review was accidentally deleted. However, I posted a review about some bad ser","useful":1,"cool":1},"_M1hdL-36OdDQCteeaMjTQ":{"text":"I've been to one of the other locations and really enjoyed it the times that I've gone, bu","useful":1,"cool":1},"0VKBJZiVaiWpOx6L2jREXA":{"text":"I went in tonight to ask the bartender a question he looked at me and didn't say a word to","useful":5,"cool":1},"GOnWSRqTNV9mndCkD9ms7Q":{"text":"Effing SLOW!!! stopped by for to go order at 2:45, not full, short line, took 30 MINUTES!","useful":2,"cool":1},"IrTindhv1h3g09DiNkdO6g":{"text":"It smelled like cotija. The taste was bland. I ordered a water bottle with this too throug","useful":1,"cool":1},"9giLBkKP4EJef2QloauAAg":{"text":"oh felipe's, how you gonna suddenly decide that super burritos don't include cheese, put i","useful":2,"cool":1},"uahj9d5Otc6iu3bXDFKhPg":{"text":"Felipe's mid city is like the bastard child of the New Orleans Felipe's family. It's been ","useful":2,"cool":1},"_fig3XUDvxPqqZXwOpg3cA":{"text":"Accidentally pressed \"place order\" button while trying to exit the UberEats app because I ","useful":2,"cool":1},"41PixlGhm8GWr-VqDEuHHw":{"text":"Ordered online and we got 3 different orders of queso and no where on the online menu does","useful":3,"cool":1},"cPfeEUdCItumgTRcjK8K6g":{"text":"Great place for a quick vegetarian lunch that isn't just salad. I love how anything on the","useful":2,"cool":2},"1I1gIOFpIsnjBPZQg5PR5w":{"text":"Good ole Felipes! You can't go wrong with them. Even though I didn't get food this time, t","useful":1,"cool":1},"iONDK5q03iwihoYuv8plsQ":{"text":"Love my quesadillas from here. The chorizo is always great and the steak. The best thing t","useful":0,"cool":0},"s2LDSbaBB9ARm5tBPrOJAA":{"text":"Some of the best food and staff I have seen lately.  These people seem to care about their","useful":0,"cool":0},"scdZ-Pf6P0NLFEdxmI_Q9Q":{"text":"Service was horrible, they were 3 girls up front that did not take their job serious. The ","useful":2,"cool":1},"pq3QfI7eDrrKR3h4Ft7npw":{"text":"It tastes alright but the past two times we've ordered they have gotten our order wrong. I","useful":1,"cool":1},"oMjxBPhwEIQMbPlZfPWNhw":{"text":"Ordered steak nachos and steak tacos. Steak was overcooked and chewy, nacho chips were bur","useful":1,"cool":1},"kWVCbdDsLitUkG0a1Mo-Vg":{"text":"I'm so glad I visited felipes yesterday! It was my first time visiting. I went in on my lu","useful":0,"cool":0},"fox9kUSpKrSAj5r9-kAisg":{"text":"Food is always fresh the drinks are great and the atmosphere is really nice. I would defin","useful":0,"cool":0},"sfpEy7B2X0PYo1z1pRI1CA":{"text":"Although the food was ok I still prefer the downtown location much better. The downtown lo","useful":3,"cool":2},"sboyNqqMmsXFRu97cyXLNg":{"text":"I was excited when this came to my neighborhood but found it disappointing. I really enjoy","useful":1,"cool":1},"I46aAib1A5MfLZFar3GcHA":{"text":"This was a sad visit to one my favorite local quick eats--the service was very slow, the f","useful":2,"cool":1},"bnj8BKvE7_7pAQxsMoCLjg":{"text":"The drinks and the atmosphere were great for Cinco de Mayo, but the food wasn't the greate","useful":2,"cool":0},"XrU1gGmyt4AjVU9ndXURsg":{"text":"When you order the queso it doesn't come with chips but the photo they use for delivery ha","useful":3,"cool":1},"Nbu44XeqUllHcVVeCLez9w":{"text":"Yes Pike - per your comment, you have heard back from me on private message MONTHS ago. No","useful":2,"cool":3},"ZBmi4upim6QXsJaP5zV5ZQ":{"text":"I've been to Felipe's many times for a quick bite to eat, but how did I not know how fun a","useful":2,"cool":2},"fS5euq1AdQDz7kloebhJFQ":{"text":"Wasn't that impressed...I got the chicken flautas and was thinking...this is it? Then I ha","useful":1,"cool":1},"DXfWq6vvgVnrPOsQPM6MSQ":{"text":"Second time I've gone here and gotten the wrong order because they were busy and the line ","useful":1,"cool":1},"FknJRIRkXw1IiJF7w52iCw":{"text":"I have no complaints about the food or service. It's always good; however, I was shocked t","useful":1,"cool":0},"uN1TxutWJp1kGcF-RVfdFw":{"text":"This is the worst of all locations. Meat was cold, tortillas were cold and doughy(even tho","useful":2,"cool":1},"mOHD44WGlKkdCCrOvfX73w":{"text":"our order was completely wrong. mixed up salad ingredients and also forgot to give us our ","useful":1,"cool":0},"2h5HfOj-_TeGaYrk_Sn2HA":{"text":"I tried the pork tamale, they barely had any meat in it. The churros were good though","useful":2,"cool":1},"ZqaUHRfSB1ke1J_1keqD6Q":{"text":"My favorite place to get a burrito in New Orleans. When I first came down for college me a","useful":0,"cool":0},"hLnkw_xlF2S2G70hrE3GoQ":{"text":"Felipe's is definitely our go to for awesome Mexican. The food is always consistent, the s","useful":0,"cool":0},"0CSqsZ81lOQf8ojROAc_2w":{"text":"I've been coming to Felipe's since it opened as a Mid City resident. \nI've never been so h","useful":1,"cool":0},"uADm3eA7kGKYl-A06FsLOg":{"text":"Chimichangas!!!!!!\n\nOh yes, my favorite from this spot! \n\nOK so starting off I'll just let","useful":2,"cool":0},"5dFliSo5ibBH8kEvPyG6Eg":{"text":"No flavor whatsoever. I asked for extra salsa roja don't see or taste any. The rice is ver","useful":0,"cool":0},"EX4w8Ffz9UHAHTVpzycEcg":{"text":"Had my last visit due to the staff that preparing the food being very unprofessional.","useful":1,"cool":0},"C58h3dsoOFQQK1GnJem7Sw":{"text":"Ok. I've come here 4 times now; enough to justify my 2 star rating. Initially, I decided t","useful":1,"cool":2},"lnfLt86yRHXJFQFgG3eGKA":{"text":"Victoria is an AWESOME BARTENDER! She I always a pleasure to talk to and makes great drink","useful":0,"cool":0},"wYUN2uvkOgJsFjNtuFDi9g":{"text":"4/5 for food and drinks, 3/5 for service. \nWent in during happy hour on a weekday and it w","useful":1,"cool":1},"lXpHMP4ZnO4o7kthVIZi4g":{"text":"My wife and I ordered from here to our hotel. We received no utensils and no napkins. Both","useful":3,"cool":1},"nAXqSSQUeoX5YvCAg4CASw":{"text":"This place is so convenient, it's literally down the street from my school and I go here v","useful":1,"cool":1},"dozRtU3-T2lISOu2XIgdSA":{"text":"This place is crap and I see now why I've stayed away from here for so long. If you want s","useful":7,"cool":3},"WEhtIPioE1q6iyCcLkmScg":{"text":"The customer service was suck.. Rude employees with no customer service skills. The shrimp","useful":2,"cool":1},"3ZtKE20QrQRpt8x6gRC5NQ":{"text":"I love heading over during my lunch breaks! Always friendly customer service. And on the w","useful":0,"cool":1},"6HT3N7y82oBBQoVcRHy_Yg":{"text":"I've been a patron of Felipe's since it first opened after Katrina.  It always has the fre","useful":0,"cool":0},"Y1Im5p-1ZdEbk0W-IyCwDA":{"text":"The manager at this place is very unprofessional and give awful customer service. He actua","useful":3,"cool":0},"BpQr3K0oBN_cU5dC8m-bmg":{"text":"Their tortillas are so tasty. I usually get the carnitas. I do love their toppings bar the","useful":0,"cool":0},"7VirjasvbFvoghY6OV6arg":{"text":"0/10 would not recommend. My friends and I came here Wednesday Sept 8 were celebrating bei","useful":0,"cool":0},"O_F3027LE46gttAM0r1X4Q":{"text":"Get the churros!! So delicious! Highly recommending building your own burritos at the coun","useful":0,"cool":0},"1a_FXJ1LsfVhLhL4R1T8AQ":{"text":"This location is sooooo much more convenient than the one on Peters. For starters, there i","useful":0,"cool":0},"cGFpEGpRWdxm0kudkLvaKA":{"text":"4/9/19 Ordered 2 super Burritos and a large order of queso.\n1.Almost no meat on both burri","useful":3,"cool":1},"07dlf6v_TLboeTQNoYNDpw":{"text":"Terrible, terrible service. They don't apply themselves whatsoever and don't listen worth ","useful":1,"cool":1},"vhn_asfFFEjv82aTGO1tsQ":{"text":"Read my S. Miro location review.\n\nAside from the regular and super burritos, I feel like w","useful":0,"cool":0},"feFUv3277dgixvAoaAIOow":{"text":"Dined at Felipe's recently. Corinne makes the best drinks at the bar!! Stop in and see her","useful":0,"cool":0},"Ttt_-Y7MWRta8uKT9kk0_g":{"text":"The ladies at the cash register are so rude and sassy and i feel disrespected.  They need ","useful":2,"cool":0},"V0siileLoVXwDmoMfx9Xyg":{"text":"For the past six years I've been a decreasingly adamant fan. Felipe's used to be a fan fav","useful":1,"cool":1},"oELwY9xqy3fW16gOtFLScw":{"text":"The Taco Salads (5 total) I picked up were all completely soggy and felt like the ingredie","useful":0,"cool":0},"hWjvdmXr7LZgGmMcIHbbQg":{"text":"The Margaritas as top notch, totally natural, no sugar or mixes added!! Also love their sa","useful":0,"cool":0},"0FgHhUM7fN7aZEADfxcupA":{"text":"Worst place ever and rude customer service. Please don't waste your hard earn money and ca","useful":1,"cool":1},"Z-Fl-oixo908jxMu8GdRVw":{"text":"This location is always busy when I come, but the line moves pretty fast. I usually get ta","useful":0,"cool":0},"fIwU8e95UQzGTFbxaAF7iw":{"text":"Iced cold take-out, yum. Not sure if it's because they keep the pick up orders in the fuck","useful":1,"cool":1},"VXPr2rbdyWqisVroH2o2dA":{"text":"The two things Felipe's has going for it are freshness and quickness. Not flavor, not the ","useful":2,"cool":1},"JrcjH5q2A83N238YnsBIRQ":{"text":"I've visited the FRENCH QUARTER location and have been pleased with the overall food value","useful":2,"cool":1},"lbtAtZcYrONX-6oPYzkI-g":{"text":"This Felipes has went wayyyy down hill.Almost $20.00 for a chimichanga if thats how you sp","useful":2,"cool":0},"wsIu7S0G1Jt1cdbDVK4yeQ":{"text":"Man they're slow as fuck!! It takes them damn near 30 minutes to make a burrito and they h","useful":1,"cool":1},"YV1jIEQvHJjYM7KVWc4ofQ":{"text":"I work right across the street from Felipe's and decided to stop by on my lunch break. I'v","useful":3,"cool":0},"Vzn1yDmgaXX0vI9LugReEQ":{"text":"I love Felipes, but this location has declined in quality to the point that I am no longer","useful":7,"cool":0},"iL7nz9TtNbCBTgHcS7rwEg":{"text":"Unimpressed. Overpriced. Bland. \nMy baja taco combo, an order of pork nachos, and a small ","useful":6,"cool":2},"JGx-I5CFxzbkb-AplyksHA":{"text":"This location has the worst service. They constantly mess up orders. I've been going to Fe","useful":0,"cool":0},"hvN6keNNDjzGBj7-dNtPEA":{"text":"I found a staple in my nachos. I would avoid this place at all cost. Unless you like stapl","useful":0,"cool":0},"6j3RDvYvgnchb-4auLUqVQ":{"text":"To start off I love Felipe's and have ate at 4 of their locations so far. The reason I'm l","useful":2,"cool":1},"QEDUpWrAkL-fcSKuSjmUTg":{"text":"I guess no managers or owners read these reviews- or care to fix the issues-im here to say","useful":3,"cool":1},"GJOrJLmhfI1iSALSxvSD3A":{"text":"I was in the mood for nachos and apparently the only thing open is Felipe's.  First let me","useful":1,"cool":0},"JLYYtnQrF-KRV3FMqsMwLQ":{"text":"Felipe's was on my try out list of restaurants.  I was trying to decide between nachos or ","useful":0,"cool":0},"adiXxqmKidi-nKdHYO5NPg":{"text":"Who doesn't love felipes???? My favorite go to meal is the shrimp quesadillas and you get ","useful":3,"cool":3},"deQvLEgCl-IKOY4gOvOiKw":{"text":"Walking from the streetcar stop to our favorite brewery (which doesn't have food), we stop","useful":3,"cool":0},"6NoR6164VULsEp7HxD5ElA":{"text":"I still love Felipe's food, but throughout the pandemic, I've been pretty stressed about g","useful":1,"cool":1},"61FQQGpt-yZ_ps0M3oL5fw":{"text":"The staff at these Felipe's getting worse and worse. I used to always come here to eat, I ","useful":2,"cool":1},"5aY5YqinNgYoIjOi6cqpcw":{"text":"I had to sign up just to write this review.I would just go speak to a manager but the mana","useful":3,"cool":0},"gsfVPlBInTizX4RIDsp4mg":{"text":"My wife and I decided to make a Friday night mini-date by going to the bar at Felipe's whi","useful":2,"cool":1},"Iv3cuxAGKybaUOZfzStwoQ":{"text":"This here is another addition to the Mid City area, What a great addition it is. I decided","useful":2,"cool":2},"5d3VaiJwxl9xyW2XuAt9Jw":{"text":"It's hard to get a bad meal here! It's fast, affordable and you can customize all of your ","useful":1,"cool":1},"8exnl7dLAIKhbdXvABA_BA":{"text":"I suspected the entire Felipe's brand was going downhill, and today was proof positive of ","useful":3,"cool":1},"yNVvsS-6EwjcRT8WnVwlzg":{"text":"Variable quality and disinterested management. Last visit should was cold and manager was ","useful":3,"cool":1},"GdOD_cqJHLvB6fCz8oCEYQ":{"text":"Their tortillas are so tasty. Sometimes the al pastor is a bit dry. And I usually get nerv","useful":2,"cool":1},"Em6oqHHe_BYF3usi9BJ_EA":{"text":"This has to be the most poorly run Felipe's in the city. 2 people eating at the bar - 3 pe","useful":3,"cool":1},"7-Nukq3fDadJXFpXbyfLtQ":{"text":"Often crowded but room at the bar; tasty food at decent prices; great decor.","useful":0,"cool":0},"rkyoWAeRX2exvt8Z9hqxHg":{"text":"Cinco de Mayo curbside pickup:\n\nAs usual, Felipe's came through in the clutch! They helped","useful":1,"cool":0},"MKt1bqKzVHPxpSGPeIi5Tw":{"text":"Felipe's is my go to spot for fresh Mexican food. My go to order is usually the chicken ta","useful":0,"cool":2},"pbsD-eTEK7TmQ9OKZwlCdw":{"text":"I am so thankful that my weekly\nLunch venue had reopened safely during covid. Had a great ","useful":0,"cool":0},"E2RtAuUqap_-GzSgK-vh8w":{"text":"Me and my hunny came there for Taco Tuesday. He had the small tacos with beef, lettuce, ch","useful":0,"cool":0},"DQKeKzYS4L_NPgDXsqhpvA":{"text":"positives: bar tender was really nice and my drink was good. the food service was fast.\nne","useful":0,"cool":0},"JLaGEwomxkhqYcb-mq79yg":{"text":"I am a felipes fan and customer since I moved here in 2009. I have had many enjoyable expe","useful":1,"cool":1},"-zEuLxypG74PeR1cmATsEg":{"text":"First review I have ever felt compelled to write. The service has slowed to a crippling pa","useful":5,"cool":0},"32SXG4Jf4gQgLmruo2fo_Q":{"text":"My mom and I went here fro dinner last night.  We got 2 pork tacos and pork burrito and sp","useful":3,"cool":1},"JKb3XHeNkmMX_hwFIG6ARA":{"text":"Gave two stars only because of the lady working the food station! \n\n\nUpdate: Went in with ","useful":3,"cool":0},"M3C5o_40NrOE9mYL60_fog":{"text":"I always enjoy getting burritos from here. The chicken tinga is one of my favorites to cho","useful":7,"cool":5},"w1iNsdyqCPU7AvDcLBfU0A":{"text":"Highly recommend building your own burrito.  Somebody the other menu options can be disapp","useful":0,"cool":0},"PQOPLUTrV9dMegI-XfrRiw":{"text":"I think it'll get better as time passes.  They definitely need to separate the sports bit ","useful":1,"cool":0},"5tMxXBbMiokrfX1TnU1e3A":{"text":"The customer service is horrific. They were so rude on the phone when I was explaining the","useful":4,"cool":0},"CIPkJDOOEgMkILsFBOShZA":{"text":"First off, I've been to the location on N.Peters over the years and it started out with th","useful":1,"cool":0},"ikCg71sUBytRZ8tzMTB4dw":{"text":"i wanted Juans, but they were closed. So Felipes was also on my way home from work. Ive ea","useful":1,"cool":1},"1sxTNWj4Qdrjuz_Qlsw1Jw":{"text":"I don't know about you, but as a nola native I used to love felipe's- especially this loca","useful":0,"cool":0},"IFTTK5YDqfFZzys_hZmIew":{"text":"Where to start. No chorizo. Ok but bland ground meat as a substitute. Ridiculous. Presenta","useful":0,"cool":0},"fIXi0fYXH--n4x2puyyJiA":{"text":"Just left Felipe's today.          I ordered food ,paid and moved away from the counter fo","useful":0,"cool":0},"jxkA8RjGYcSHyrwL_GBIXQ":{"text":"This is my third time trying to food. I guess i was hoping it would get better. Food is ju","useful":0,"cool":0},"5Ey0_8uRfdvMzjB7KJR-ig":{"text":"Felipe's will always be an all time fave. Great place to grab a frozen margarita and Baja ","useful":0,"cool":0},"mZ55U2yjw3IxJ1su7OIU5w":{"text":"Felipe's saves lives. Anji is a rockstar. Best tortillas. Best margaritas. Mamas happy.","useful":1,"cool":0},"e_rvTMRMGHv7rmXchhh0IQ":{"text":"I don't get this place. It took forever to order and there are so many extra charges. What","useful":3,"cool":1},"aISmywyizudETRlcWetYIw":{"text":"Salsa, gauc, and queso were incredible!!! So good. I'd recommend to anyone and I'm from Te","useful":0,"cool":0},"qm-0xtqc_dcksZihrGKInQ":{"text":"Felipe's is awesome! It's cheap, quick and really good... Open till midnight on weekends w","useful":1,"cool":1},"HKJ7PsBrtYjAM5jLp1M10Q":{"text":"I can live anywhere as long as I have a church, hiking trail, and a mexican food spot that","useful":6,"cool":1},"Qk3w3IOR4cuG6RK8ax9cbQ":{"text":"Felipe's has been my go-to for Tex Mex here in New Orleans for 8 years.  Inexpensive and d","useful":0,"cool":0},"5JQR_3ddIWb54MPEfu8YXw":{"text":"I went in tonight and was so happy to see de'shaun working again and this time I saw resta","useful":0,"cool":0},"Z91nZQrqWTBvt7mFiaHIlg":{"text":"I have been to this location several dozen times since they opened. At first, it was AMAZI","useful":3,"cool":0},"jJreZmV1hUJDEshSg6K_hg":{"text":"Great food and drink specials. \nI'm a cheese lover so they one me over with their queso. I","useful":0,"cool":0},"rb1dh-e9O2i5WlxVSM35UQ":{"text":"The food here now sucks.The black beans had zero flavor no salt or spices whatsoever.I got","useful":2,"cool":1},"l7fEAmB1vY5_cwGRYQyREQ":{"text":"Coming this place is horrible makes you order online and waste your god damn hours because","useful":1,"cool":1},"-nbC9zV9GqjnccXwDm6VVg":{"text":"Waited in line for 16 mins when two people were in front of me. Line to the door. The guys","useful":1,"cool":0},"1Hen0g7_YmvBZIkQv5SktQ":{"text":"Every time I visit New Orleans I stop by Felipe's for a mango margarita and tacos. The mar","useful":1,"cool":1}}