{"mMcTY2JAcrGcQJyg2ko1cg":{"text":"Not like the old days. Food was still good but the ambiance has lost its luster. We will s","useful":0,"cool":0},"-XhTeK-yoS8hTi1o3Dg7xA":{"text":"The entrees are better elsewhere.  The oysters are fabulous here.  Cash only at the bar (r","useful":0,"cool":0},"GsrrI_Pocc9_IIWt6UD5FA":{"text":"Pascal's is a New Orleans version of a Metairie restaurant doing New Orleans and Italian f","useful":1,"cool":0},"rng5GfNNAWqGbQgPYH6qCw":{"text":"I've eaten at Pascal's Manale a few times and know what to expect when I get there. The pl","useful":0,"cool":0},"kR7g-bMruD0Qe9qA7Z8Xmg":{"text":"4 stars for ambiance, history, food, service. The last 2 times we went however, the world ","useful":0,"cool":0},"AH2DNvfipjHLppRbVxSrjA":{"text":"Just FYI yelp says they close at 10 - but not the case. Walked in a few min before 9 and t","useful":0,"cool":0},"k-pPsaYXotTMIbWfHglJcA":{"text":"Couldn't wait to check it out, ordered a $24 veal parm that I could have got at any Italia","useful":0,"cool":0},"qrNEUgMgVgEt9KVE2K3E2A":{"text":"After reading some of the reviews we were expecting bad service & a mediocre experience bu","useful":0,"cool":0},"APNBdgtakLbeeZCaO52JmQ":{"text":"Amazing restaurant.  Was there with a large group and asked the waiter to serve us family ","useful":0,"cool":1},"LQ1weXGmVDAYXTM-pC3OJg":{"text":"Come here for the best stuffed shrimp in the world, and the cleanest raw oysters. This pla","useful":1,"cool":0},"Z1DtJ2L87oat3Ay1w6EBHA":{"text":"Best Bar-b-que shrimp ever! Oysters were amazing too!  Traditional in appearance and menu,","useful":0,"cool":0},"mJ8PXlZhXC3USvk1mtYyNw":{"text":"The best. The people are the Best, but the BBQ shrimp was so good!!!\nWe Love it here, I do","useful":0,"cool":0},"UOppiWLEf7GDkdUFFnKALA":{"text":"great turtle soup and bbq shrimp oh man was that turtle soup great. i will be back to eat ","useful":0,"cool":0},"JVgKiKKDndlCW1Hc_gctow":{"text":"Nothing like getting denied because one person in the party was wearing shorts! Guess they","useful":0,"cool":0},"C7rAAU2IaLjv1JFraAABxA":{"text":"This was my Mom & Pop's favorite place to go back in the 50's.  My dad is eighty now, and ","useful":1,"cool":0},"22_YgIqn-9LMcDLKSJn_9Q":{"text":"The food and atmosphere are good, but not great, and it is all severely overpriced.\n\nI had","useful":0,"cool":0},"uMGRGc0LXbwXTGAwB2fzWw":{"text":"I'm sorry this place is OVERHYPED\n The BBQ shrimp was gross. It was swimming in old oil an","useful":0,"cool":1},"HgijcPnLvT86qLNx7Q1rXg":{"text":"Now that i am back from New Orleans i must admit that this was one of my least memorable m","useful":1,"cool":0},"30KH9w08Db-sym46ONftSw":{"text":"I'll dream about the BBQ shrimp - so good, and unlike anything I've ever had  before. We t","useful":0,"cool":0},"OtZ2dTGYQXzbEIGnZoOdMw":{"text":"To repeat what everyone is saying, eat the BBQ shrimp!  If you are a vegetarian or do not ","useful":1,"cool":0},"XlEFsKGpE-T0G0t9Sb3x2g":{"text":"great southern character, great southern food. most interesting, in a good way, server ive","useful":0,"cool":0},"DHwm42zhAdjbwiSvP7Bzfg":{"text":"We returned to this restaurant after 4 years because of the excellent bbq shrimp sandwich ","useful":0,"cool":0},"2I8aNE-Lp9HQTEm3auQesQ":{"text":"MAYBE you can find a little better meal at a few other places, but definitely not for the ","useful":1,"cool":1},"aaZ4ITXWJ9uj8B5ZPiLo1g":{"text":"This was described on numerous websites as a kid-friendly New Orleans classic.  The food w","useful":0,"cool":0},"cu358_k15JbPZxSWTsFFUA":{"text":"Best place to have raw oysters during happy hour! So fresh n clean!! Thomas is the best oy","useful":0,"cool":1},"PRJSJlwLDn8otdqQl-mGrg":{"text":"Amazing! Came here last weekend with my uncle and aunt and it was fabulous. Of course I go","useful":0,"cool":0},"TP652lU3haDDSu9qVp7VzA":{"text":"For my 100th review, I thought it should be special. What's more special than my favorite ","useful":5,"cool":2},"zaJbCQ5NiTfOpzTJJEPZ8Q":{"text":"The end all be all of Barbecue Shrimp.  I have eaten at this place 50 times and it never d","useful":0,"cool":0},"sUHtqNLqApDfNSUNXFd6Jw":{"text":"Happy Hour not very happy!  First: a throwback, no credit cards. O, they have an ATM. I am","useful":0,"cool":0},"h-ZRPpXQVjSAN1j8se6KQg":{"text":"Pascal's is an institution, or rather a NEW ORLEANS institution.  The atmosphere is circa ","useful":3,"cool":1},"-aFAxCZpxWdYTJWTNxuhpA":{"text":"Extremely disappointing. Walked in with an assumption that this would be a nice meal. \nOrd","useful":0,"cool":0},"FtyMaA-CN7kq-zSKTsxJEw":{"text":"Completely in love with this place!\n\nWhen you walk in you are immediately greeted by the b","useful":0,"cool":0},"FG5t-ZraHpeIdf1wYXVskQ":{"text":"Random thoughts about Pascal's Manale's BBQ shrimp:\n\nWowza--that's what they should call t","useful":2,"cool":2},"ktAVzWWviW3eIAXT0Vsl0A":{"text":"Absolutely amazing meal.\nWe started with an egg plant dish that was covered in shrimp and ","useful":0,"cool":0},"CCkCOKPr4yXPWzvJxcHVpw":{"text":"This place had come highly recommended, and we were very excited to try their food. Our wa","useful":2,"cool":0},"1MpSvSXfjQ2ix9af9z8jrQ":{"text":"If I could issue a zero star rating I would.  The famous barbecue shrimp were a frozen pro","useful":2,"cool":0},"noJkC7F89Z_ZgEIPLWWEew":{"text":"Being chinese and from the bay area we are familiar with consuming shrimp in its best form","useful":0,"cool":0},"PwFx66wiYn9qEKZy-PURvQ":{"text":"Pascal's Manale is our favorite restaurant in New Orleans.  As tourists, we researched our","useful":0,"cool":0},"U63S5B5AoLVrB7t8RcR-3A":{"text":"Went here with some friends while in NOLA on business.  I had been here before ( before Ka","useful":0,"cool":0},"sKr_YSaBkKjsdaqMLA-Jnw":{"text":"Quintessential NOLA. 100+ years in business. While I'm sure everything on their menu is gr","useful":0,"cool":0},"IlvVdybJChNzmo2qfFk71Q":{"text":"This is a very special place. Old style elegance and fantastic food. I had the classic BBQ","useful":0,"cool":0},"F-cnNr_RVf08y0-or1d_EA":{"text":"I very seldom give 5 stars..only because for most places there is always room for improvem","useful":0,"cool":0},"CHTsABPgSbsAkk8Jm1JM5A":{"text":"This was a last ditch resort for a dinner on Friday night.  We were seated as a group of 8","useful":0,"cool":0},"60OzZ-GF7gvz_bYqCkNs7g":{"text":"My wife and I returned after 17 years and found the oysters and shrimp to be just as we re","useful":0,"cool":0},"vmraEYeXqEvAriSKRMxcsg":{"text":"Beware!  This restaurant says it is wheelchair accessible but that is only by entering thr","useful":0,"cool":0},"2z_HvC11M5BRx6d4d2sPmQ":{"text":"I am seriously so disappointed. This restaurant was recommended to us, so when my boyfrien","useful":0,"cool":0},"crWaYWhs_wFtO9SD_Xio_g":{"text":"Great Bar-b-que shrimp.  Second to only Dante's kitchen.  Dante's only has it as a appetiz","useful":1,"cool":0},"QpNXthiSKHzG6EN0q-MCmw":{"text":"Always a favorite spot for lunch or dinner.  I had the Mediterranean shrimp pasta from the","useful":0,"cool":0},"4SRK_Iu02YtPLj8bXrg5kg":{"text":"Came across this place one night before heading to a show with the wife and thought we wou","useful":0,"cool":0},"0wE0RuiLxJ0o7MzDz43Afg":{"text":"The food here was really great. I enjoyed the seafood casserole. I cannot wait to eat here","useful":0,"cool":0},"S11TM8gT9zXw8H6FsUuSpw":{"text":"Expensive lunch but soooooo worth it.  GREAT staff.  Amazing food, service and bar.  We di","useful":0,"cool":0},"z0GJ-9pwz8P3KyymkyjXcA":{"text":"It doesn't look like much. The staff is quirky. They only take cash (maybe just at the bar","useful":0,"cool":0},"JeAnmZ44Fcnbtowj5xygZQ":{"text":"Love their bread pudding! It is amazing.   Not a fan of their BBQ shrimp, which is what th","useful":0,"cool":0},"FXVVWCt5Glw0NABh09HVnw":{"text":"I had a lovely time here this evening. It had been the kind of day that calls for grain al","useful":1,"cool":1},"Lf_l3T7vqKd5s_TkNKg-IQ":{"text":"Very good old (104 years old) in the garden district. The oysters $8 per half dozen and ve","useful":0,"cool":0},"4tnMNi-3TuN7to1uNau27A":{"text":"I have been coming to Manale's on every visit to New Orleans since the late 1980s.  The oy","useful":1,"cool":0},"ycX-AYoFHlqgIhWvBu0K6w":{"text":"Staying 3 doors down at Beau Sejour, this restaurant came highly recommended. It was about","useful":0,"cool":0},"AqLpEWvzm7mU-CXI8pnQDQ":{"text":"Wow, this was truly an amazing meal!  Our group shared the Sampler Roast and the Eggplant ","useful":0,"cool":0},"Zdx859YbZhLRpF_UvHc3dg":{"text":"Never expected a white cloth restaurant in the middle of the neighborhood.  We really enjo","useful":0,"cool":0},"Xgxg8gZ58to1_V4Z9GxDnQ":{"text":"So disappointed with this restaurant....My fiance and I heard nothing but good things abou","useful":0,"cool":0},"tlgv_nFxxnfx7SpdOriFwQ":{"text":"Our experience at pascal's manale was very brief, but incredibly unpleasant. Around 9pm we","useful":1,"cool":0},"736Gs-6X2l4gJvmmDily0Q":{"text":"I'm a local and was quite disappointed!  This very well known city restaurant offered ridi","useful":0,"cool":0},"Cuxblo0S3gWIUBTQbG1xvQ":{"text":"Came in close to closing and terribly underdressed after a long day with rain. They were g","useful":0,"cool":0},"ZRmFHri1HUBuVQ6KChN0iQ":{"text":"I've been here many times and will always return. Classic neighborhood restaurant in Uptow","useful":0,"cool":0},"C7W6xvQdBGnRcbjcMG_99w":{"text":"Best, biggest raw oysters in the city. The wait is worth it if you stand at the oyster bar","useful":0,"cool":0},"8vhW0huNUe1Oi0IM9ToCJQ":{"text":"Loved the history behind this place, as well as the atmosphere. When you first walk in, th","useful":0,"cool":0},"WUAQ8nsKwmixgtSb4B0xaw":{"text":"Just not impressed. Their specialty of barbecue shrimp was s huge disappointment. Ordered ","useful":0,"cool":0},"RZ4_o1wYIshJu9V9w6pEBQ":{"text":"the BBQ shrimp really is as heavenly as everyone says - they serve it with a giant loaf of","useful":0,"cool":0},"NmeSRC9BZ9cJ0zxfYJw9Rg":{"text":"This place is a must-go if you are visiting New Orleans. If staying in the French Quarter,","useful":0,"cool":0},"hSg2gWLVA0ifSwL-hIGusg":{"text":"A lot of hype about this place and I was told I must go.  They are the inventors of BBQ sh","useful":0,"cool":0},"zN3xVCC1NfuLEPE-oJRxjA":{"text":"The oyster bar and Thomas are World class. and the barbecued shrimp is really good. In fac","useful":1,"cool":0},"xZzd8yeb6Ie8fP-zdDGhmw":{"text":"This place is fantastic, love the story behind it, the history and the awesome food, one w","useful":0,"cool":0},"Dlt1xWR6vdN1Rl9mjCMTlw":{"text":"The restaurant had a historic feeling to it, with all the pictures of famous people and so","useful":0,"cool":0},"4PQgrvW6M3iUn3TtAsmpzw":{"text":"Carpeted. Also overpriced and unoriginal. And carpeted. What's up with New Orleans and the","useful":0,"cool":0},"xU_9GibF62NEnKU1cseWzw":{"text":"I found this restaurant overrated.\n\nPros: Nice atmosphere at the raw bar...lots of room to","useful":2,"cool":0},"6qVxcuaBOAtrhEMf_Snmdg":{"text":"Excellent BBQ shrimp. Wonderful service. Easy to book. We had a party of 5 and was well se","useful":0,"cool":0},"sLSFA9nKHLieaLwgVRCGEg":{"text":"So we had a big group initially on RSVP, but our group of 15+ went down to 10...So the are","useful":1,"cool":1},"IORpOEk3OYA4uqMUnayQmA":{"text":"I was somewhat disappointed with my experience here. I had heard huge things about the BBQ","useful":1,"cool":0},"XFJ1CDTPkDc-dqr0ole4rQ":{"text":"The chicken was so good, until it was coming back up 4 hours later. I have never thrown up","useful":0,"cool":0},"TOJEkLFsFJij5ZcxO6t8WA":{"text":"Recommendations: Oyster Bienville and Crab Cake Alfredo.\n\nOyster Bienville - baked oysters","useful":0,"cool":0},"c_gIuk0zQ1OLB5VA_k5gsg":{"text":"The WORST service I have experienced in NOLA. From the moment I walked in I knew we were i","useful":1,"cool":1},"S3eLvriuEIw2Njzo0BEnwQ":{"text":"This place was recommended by my husband's coworker. We were pleasantly surprised by the a","useful":0,"cool":0},"pd-t0S78yWpW1xrQ3jWoOg":{"text":"Loved the BBQ shrimp special. AND that the chef came out and discussed my gluten-free opti","useful":0,"cool":0},"5Xok9UvPe1Glu3fERbd78Q":{"text":"3.5 star dinner review. This is a cool place, and they'll hook you up with a private room ","useful":0,"cool":0},"_DesuU2503eUmGIVmij2_Q":{"text":"This place has been here forever it seems, it has a very 40-50-s vibe to the decor and gen","useful":1,"cool":0},"S0d9hpqm9Rsmjho3_ir9jg":{"text":"Pascal's is a legend-- I grew up drinking from a souvenir mug that my parents bought at th","useful":1,"cool":1},"s4jc_9v5cdlCCH3J1FMQ0Q":{"text":"Delicious meal! DH had bbq shrimp and they were cooked perfectly. I had the special which ","useful":0,"cool":0},"3zEITNvGAQKJnEIRstveEg":{"text":"great raw bar! that's all i can review.\n\nto do it go to the bar, order a dozen oysters (or","useful":0,"cool":0},"V2SsT-ISQ3GIyiAYY9yI1w":{"text":"It feels like a place that let itself go.  Drinks were made improperly, at best. Old-fashi","useful":0,"cool":0},"WVf4_sMT3zKkBSigmyWIQg":{"text":"This was the best meal I had in New Orleans - better than Delmonico.\nPascals Manale INVENT","useful":0,"cool":0},"vOvyhwLbJdmFS74fRcapzg":{"text":"Nice restaurant but it feels small and contained.  We were a party of about twelve and wer","useful":0,"cool":0},"HHOolTELn84WOl_LOLLHEA":{"text":"simply lovely evening.  we began with oysters, and they were fresh, tasty, and the horsera","useful":0,"cool":0},"c8w2yFZf72qE8KFW7mqs5g":{"text":"This review is solely for Oyster Happy Hour- we visited \"Uptown T\" at Pascal's over at the","useful":0,"cool":0},"9R7cb1iGkPPrKSCiBCHtCA":{"text":"Oh, it is good.  Forget the cab ride, and take the street car.  It's a block away if you g","useful":0,"cool":0},"rtV2ilUu2d-O9Dpw0XLj4w":{"text":"Surprisingly horrendous, disrespectful experience.\n\nI am a religious Jew and was asked to ","useful":3,"cool":0},"X7dLa8gGdzhiaOMtC1tlYQ":{"text":"How Far The Mighty Have Fallen .   We're career restaurant pros from SF and have attended ","useful":1,"cool":0},"MNuOE52tYiw0RM_L8G3f8g":{"text":"Without a question one of the top places to go in Uptown!!!  The raw oysters were as thoug","useful":0,"cool":0},"g8NGRMty7dCkrEXAnLCOgQ":{"text":"I had a dozen raw oysters.  You can't screw that up.  They were good.  The service was med","useful":0,"cool":0},"E6_KtPS7X4hzlLaYwnvrCg":{"text":"I have been here several times in the past and always enjoyed it. This afternoon we came i","useful":1,"cool":0},"vWPL01JnTesbe7--937zog":{"text":"I give it a 4 because the food wasn't the greatest bur the ambience was. You walk into thi","useful":0,"cool":0},"59f9NApC4nNOWAq4evYBAw":{"text":"I'd leave no stars if I could. My dining companion had the Pascal salad and the stuffed sh","useful":0,"cool":0},"V-8o7gq4-e1aSr6XoNQ3wg":{"text":"Really bad service. Food was okay but not great! When you wait for food and drinks way too","useful":0,"cool":0},"LkBhm72jIS6Hp9K_ej4Gqw":{"text":"Another treasured lunch at Pascal's! Superb food and gracious service.  This time, Jill wa","useful":0,"cool":0},"YwdIlAAYrfaZ3s3IQ5NlrA":{"text":"As a tourist visiting this city and staying in the Garden District, this came to us highly","useful":0,"cool":0},"7wpXl5RRMPa5TbFsqdvWmA":{"text":"A friend of mine told me about BBQ shrimp, and after googling it to find out what it was, ","useful":3,"cool":4},"ncwtv19oEkEw-2LY1tet6Q":{"text":"We went here upon recommendation from a friend. I ordered the BBQ Shrimp and my husband or","useful":0,"cool":0},"92fGH8RI9Jbdq6XckkNgjw":{"text":"I read these less-than-four-star reviews and I wonder what the hell these people are used ","useful":3,"cool":0},"-0uIIjs0bJjqR7iBpZbAyQ":{"text":"Not only is the food delicious and they deliver it time and time again. The staff is excel","useful":0,"cool":0},"EOqChD23EljC6Jt9wKzHdA":{"text":"Was recommended here by a friend, excellent choice!! Service was great, had some authentic","useful":0,"cool":0},"VrxNeaDsRAQ6uFviFXGGhg":{"text":"I recommend crabmeat & scallops. It was extremely good; not too heavy, flavored well & por","useful":0,"cool":0},"lRRdCE-o08-k0Lw3Q7TmXQ":{"text":"This was our first time here. Our server Jeanette was awesome. The oysters bienville was r","useful":1,"cool":1},"n0qRVmpVU_uywKUVOGFhXQ":{"text":"Fantastically disappointed and wished I had made more of a point about it rather than just","useful":1,"cool":0},"07dnGGlSj4GbrCmSEpUAkQ":{"text":"This is a gem. The food is very rich! I don't eat seafood but was told it is excellent. Ho","useful":1,"cool":1},"z6_lC8s53MrAiF2BH-9U-Q":{"text":"Horrible! We ate at several place while in New Orleans. This was so disappointing. The foo","useful":1,"cool":1},"-aDDbRKuKcM3VHGe2-48Kw":{"text":"Food was reasonable. I had veal which were very thin dry pieces. Pasta & sauce were good. ","useful":0,"cool":0},"fAhBgQ9GnrW0_fiE6TjN4g":{"text":"My friend suggested coming here as she had memories with her parents, and wanted to show u","useful":0,"cool":0},"8UPXMftEsW_dlaRN5Y7HBA":{"text":"Think this place has been over hyped. So if course got the BBQ shrimp, where BBQ shrimp wa","useful":0,"cool":0},"0mFF8f8orlEFTFY5vXkEAQ":{"text":"It has been a number of years, betweeb visits and it should not have been this long. \n\nHap","useful":1,"cool":0},"ncLYo0A3xMX-PmBfh8y1Zg":{"text":"Went there with five other guys and we all loved it. The BBQ shrimp is freakin awesome.","useful":0,"cool":0},"KhGOJGgfhQAMC-3eacXTpA":{"text":"Awesome BBQ shrimp. Also the alfredo pasta side was really good, a bit on the heavy side. ","useful":0,"cool":0},"8jQyBa1vWx46fVXNiu90cw":{"text":"Its oyster bar is amazing and their prices are equally awesome, a dozen for $15. The maîtr","useful":0,"cool":0},"ocyRpRKScLk0EqQaiVek2Q":{"text":"We had the BBQ shrimp sandwich and it was flavorful and delicious. The bread is fresh and ","useful":0,"cool":0},"Xi-sCnyccZqUdOTyvrSezg":{"text":"Excellent food and service with great ambiance as well. Catered to the kids and everyone h","useful":0,"cool":0},"K-7v1gfeqKatupxpAIlxVA":{"text":"I was craving some of LA finest raw oysters. It's a myth that you can't eat them in warm m","useful":1,"cool":0},"B2I2IsuuFwlxvYjjD-wyKw":{"text":"See my profile. This is what I chose for my last meal on earth, and that's no joke. The ba","useful":1,"cool":2},"94W4ESC8CPFS97YX2RS6iA":{"text":"Went 12/23 with the family. Got the bbq shrimp. Not bad but not nearly as good as Mr Bs. H","useful":0,"cool":0},"dUjNAJi712rIxz4AeFcF9Q":{"text":"BBQ shrimp was absolutely amazing, I will have dreams about it. The seafood gumbo was surp","useful":1,"cool":1},"PxcWzYOfJlrTHWrbhEFqhg":{"text":"From the moment we walked in it was what we were looking for. Cane our waiter was very att","useful":0,"cool":0},"prFjWz2g83i-aQAm_DztwA":{"text":"This review is focused not on the whole meal we had on a recent visit but only on the famo","useful":0,"cool":0},"iufkc94O97PYKyQcj_ZFRw":{"text":"Oh my. Our meal here was wonderful. We arrived late in the afternoon on Lundi Gras and ate","useful":1,"cool":3},"Z7oRfII8pMkGFPiMQ8z1tA":{"text":"Not the experience we expected. I brought my family to New Orleans and specifically to Pas","useful":0,"cool":0},"Yq1k-tYRKx6wAk4x77VrVA":{"text":"When I first had BBQ Shrimp here over 20 years ago, I thought I had died and gone to heave","useful":0,"cool":0},"c32tNPYVWme51Oo94qwxrw":{"text":"I was super excited to go to Pascal's Manale when I was in town for Mardi Gras but other t","useful":0,"cool":0},"wZ6G-tcQal45SxveMx0zQg":{"text":"I had dinner here with my girlfriend this past Saturday night. We had reservations for 8:3","useful":3,"cool":0},"AYV3AOKQgoENTkoEDt97Mw":{"text":"First of all if you walk into this place the smell alone makes your mouth water.  You have","useful":1,"cool":0},"EYzmop8qI9vRsGi--6QOJQ":{"text":"This is a Nola institution! You simply must eat here at least once in your life. \n\nThe bbq","useful":3,"cool":2},"itJLKx1CnOlKpbIJKe0Fvw":{"text":"I think this place and many places like it fall into the \"my grandparents used to take us ","useful":0,"cool":0},"10HWc9adt9Qp_XytfvDkAw":{"text":"The flavor!  I can't express enough how good everything  I ate was here. The food has so m","useful":1,"cool":1},"B-leod4FoST6K-o4HCWDCA":{"text":"I was here a couple times before and since the reopening after the storm I was not impress","useful":0,"cool":0},"YJgO4fAtOwgVHMCub-R8Fg":{"text":"The food was ok. Just ok. The stuffed shrimp was not good. The BBQ shrimp are good. But ne","useful":0,"cool":0},"FVhBoWoeG8wr_vYrkkObAw":{"text":"Cash Only @ the liquor bar / raw bar!!  By your booze and your \"oyster tokens\" at the bar ","useful":1,"cool":0},"vCHpzsaa9wenpKBet16CAQ":{"text":"BBQ shrimp were great but everything else was only ok. Tourist place that is living on its","useful":1,"cool":0},"fLbWSL_QOsgUxUNhvB_-eA":{"text":"Wow again this is our go to restaurant in New Orleans. \nWell of course we ordered the BBQ ","useful":1,"cool":0},"boqCEUsnaPFmjYqIwYyhQA":{"text":"Omg! What a wonderful meal!! Great service! Great food!! U must try the BBQ Shrimp! Everyt","useful":0,"cool":0},"HzJn8c0lAq8m4gaoGIIJxQ":{"text":"We came here for a wedding party. Had a reservation for 9. Cut our photo shoot short becau","useful":1,"cool":0},"rWmZY6W1FOfcLfBHBD6q-A":{"text":"After hearing glowing reviews from a friend and checking the website, we decided to try Pa","useful":0,"cool":0},"VXO3-HvBiw2fkD6vLGqxIw":{"text":"A definite NO.\n\nService was OK. Not great or poor, Just OK. The food was nothing to pay fo","useful":2,"cool":0},"qxvpcP5P7wPNMaNJz4JDSg":{"text":"This neighborhood institution is full of ambience and history. When we mentioned that we s","useful":0,"cool":0},"L6HAUimtpmAGcEF11rH0TA":{"text":"I've been meaning to write this review for sometime now.  My dad is from Louisiana and has","useful":2,"cool":0},"qAkoS791h9ThUYohn3J9nQ":{"text":"Uptown.  Creole Italian.  Since 1913.  Famous bbq shrimp are amazing (its not bbq in the s","useful":0,"cool":0},"ZWtcyTSHLU5vsOjUaOZhEw":{"text":"A classic New Orleans restaurant.  We came in on a Friday night without a reservation and ","useful":0,"cool":0},"JSfE-MJXyIDBl0HjXPM-yw":{"text":"Pascals is overall a solid eatery in NOLA. I got the eggplant and shrimp appetizer which w","useful":0,"cool":0},"sn0mKZkawCcF8xdjPz3SrQ":{"text":"You can only have one first impression for everything. When I ate a piece of the bread I k","useful":2,"cool":0},"kC48-tpXeQeIYRqV2FinLg":{"text":"Literally just walked out. Came here for dessert because we've heard the bread pudding was","useful":1,"cool":1},"nVauOkpQsY1qrjI5eSqEkA":{"text":"Fantastic oysters, memorable BBQ shrimp, casual (but nice) setting. Loved it, highly recom","useful":0,"cool":0},"SjoD_1sQ5KvsYJuq7apd4Q":{"text":"I brought my brother, sister-in-law and toddler nephew here for lunch a few days before Ch","useful":0,"cool":0},"zgbnOOY3J6mx1-Z4B8BYrw":{"text":"I was told this place had the best oysters in town.  But it doesn't.  Having been disappoi","useful":2,"cool":0},"HLuBZ0vf03760MoJ4oiRrA":{"text":"Will not return, do not recommend. \n\nWe were so excited to try the home of the new orleans","useful":4,"cool":1},"bQxdd4KWsMahf6m9c8QTZQ":{"text":"I'm leery of restaurants that people refer to as traditions or institutions, as if stickin","useful":0,"cool":1},"5DIUS9egxCQAk4FkGLQjHQ":{"text":"This one is a three based ONLY on the fact that PM is an extended family favorite - I'm no","useful":0,"cool":0},"2YzdS9doiR1MzxOaNEP9ew":{"text":"My favorite NOLA restaurant. The BBQ shrimp is amazing, also the bread and shrimp dishes. ","useful":0,"cool":0},"w2xN3qFC9VMxMJy88zWmEQ":{"text":"Upon visiting friends in New Orleans, Pascal's Manale (many say Pascal Manale's -- which i","useful":0,"cool":0},"cwCOJ9gic_mN9DZVMYe6eg":{"text":"First time since Katrina. Tommy at the oyster bar, Wendy our waitress and the food was all","useful":1,"cool":0},"W6JUu-43gZtBpMrWfxNSKw":{"text":"Simply excellent BBQ shrimp- although a bit pricey. The veal marsala is very succulent and","useful":1,"cool":0},"11111Erkaub7TweatWlBcA":{"text":"The barbecue shrimp is incredible. Be prepared to look ridicules when they tie the bib aro","useful":0,"cool":1},"VJeii9SAfYkW28D0mqskMw":{"text":"This place was awesome. Came late after a long walk from the French quarter. Staff was ama","useful":1,"cool":0},"SaYWFSJGg8mkHLzWhkG0Jg":{"text":"The food and staff were both amazing. For a place like this I would expect to pay two hund","useful":0,"cool":0},"XWCgM94lhYfMNMQOp6XwGw":{"text":"We went in before a show at Tipitina's. It was one of my late father's favorite places, an","useful":0,"cool":0},"lVIHjneKWgtB1ZmzWLQzoQ":{"text":"This a classic New Orleans restaurant.   Famous for its BBQ Shrimp but it is much more.  I","useful":0,"cool":0},"BHmolS4PBNAMH-h7DzWAFQ":{"text":"Absolute classic. Either the restaurant or the oyster bar, you can't go wrong. You can get","useful":0,"cool":0},"Jn7KyAom8jRAnWDbTZOetQ":{"text":"First time diners here. Atmosphere was great. They have signed clelebrity photos in the lo","useful":0,"cool":0},"nPmIeSR7GpVhdYHmL5schw":{"text":"My first experience at Pascal's Manale was excellent. VERY casually dressed, we walked ove","useful":0,"cool":0},"AYsdFuu7LagTCNfdRau9wA":{"text":"A must....BBQ Shrimp and Italian favorites...I can't describe what is so special..the whol","useful":0,"cool":0},"3-c2FkAMnM8_zc6My2oIDw":{"text":"If I had to hear \"You HAVE TO try the bar-b-q shrimp at Pascal's Manale!\" one more time...","useful":0,"cool":0},"faT8J7cVcNJlBMCQKWeWSA":{"text":"Great History and a wonderful personality and overall vibe. I love this place and have lov","useful":1,"cool":0},"PeI5qvc-IsJ2ELfYzBPwaA":{"text":"The acoustics are horrible. The noise in the room was deafening. A party of four trying to","useful":0,"cool":0},"hoe0XCeBy__8Cr6E2kTDOw":{"text":"Great food and service by Joe. Had the BBQ shrimp, both oysters, chocolate moose and puddi","useful":0,"cool":0},"x9ZcV25h03pc6iRcYoEdIw":{"text":"Bang for your buck: 10/10\nQuality: 10/10\nService: 9/10\nAmbiance/Location: 9/10\nOverall: 10","useful":0,"cool":0},"mlfY5qZTYZY1Bgoow4R-UA":{"text":"Can't stop by Nola without stopping by this place and trying the famous barbecue shrimp. I","useful":0,"cool":0},"T67p-ncHKmNWjs_dtjNJhA":{"text":"I can only say good things about the food...very good.  Very good service as well. But whi","useful":0,"cool":1},"7re_U_VqOKNS_4cctCIDcw":{"text":"The potatoes Brabant were one inch cubes of French Fries without butter, garlic, or parsle","useful":0,"cool":0},"aCV-PETIBBQlSydrXEPE3A":{"text":"I went here after meeting the chef one night at Henry's Uptown Bar. I told him I was new t","useful":3,"cool":3},"2Ymw_QHDocGH4G_V2efHUg":{"text":"My husband had fond memories of going to Pascal's Manale with his Dad while growing up in ","useful":3,"cool":0},"EmTy7cWvWSgwRTZ1oZY4Dg":{"text":"Ok, I have been to NOLA a number of times and eaten in some of the best restaurants ever. ","useful":1,"cool":0},"v762G-kdu-RxRbvrOs-pGw":{"text":"We've lived in Nola for 3 years now and we'd heard it's a tourist trap but wanted to give ","useful":0,"cool":0},"zbOWBmbjrsweEFFNVOk8pw":{"text":"I had high expectations for this place, but I was slightly disappointed. \n\nMy friends and ","useful":0,"cool":0},"9m7Pwe2zzhZ2K7OeX81rmQ":{"text":"Pascale's Manale is the perfect embodimentm of the Creole-Italian mixture. I hate to beat ","useful":1,"cool":1},"oXmNbiCObkpWWOW8bI3i0A":{"text":"My second time to Pascal Manale after years ago. I remember the raw bar being very good, w","useful":0,"cool":0},"Ud0b1m-YVX3k9gXPVL8sew":{"text":"Wonderful restaurant, wonderful staff! Don't-miss dinner location for any trip to New Orle","useful":0,"cool":0},"Z-BAfb3i9PghGkt5VR3XzQ":{"text":"I could not have been more impressed with the delicious food and excellent service. A grea","useful":0,"cool":0},"AhAsKvle1LkVa-TSbU93yw":{"text":"If I ever had to have a last meal the BBQ shrimp po boy would be it hands down\n\nI've eaten","useful":0,"cool":0},"-OA1YHHDBuuWBnB14XBtvg":{"text":"The food and atmosphere awesome!   Key Lime pie y'all.. woop woop! Ask for Lou.   Excellen","useful":0,"cool":0},"fcMhyYIkYKDaMWDxlL0k1Q":{"text":"I was really excited about my first meal at this well-known Nola eatery. I brought some fr","useful":0,"cool":0},"nN9jLAQmhz3AwaxSx2Xrgg":{"text":"I'm late with this review, but wanted to convey my thoughts.  Five of us came in for dinne","useful":1,"cool":1},"Krj2PZe9t-VAb7We_tSgcg":{"text":"Just to be fair we had very high expectations about this place. The raw oysters were compl","useful":1,"cool":0},"wrRVOOCY3Mt6lQdiCmsYWg":{"text":"Picture this... a local restaurant tucked away from the touristy areas in Uptown with old-","useful":3,"cool":2},"xzvcJRGacgbzfqCNjugIJw":{"text":"10 Easy steps for conquering your visit to Pascal's Manale. \n\n1. Make a reservation. \n2. V","useful":8,"cool":3},"fuVlCKw6t7PulMAfc_2WeA":{"text":"Did I just eat at the same restaurant others are reviewing?? This place was horrible. When","useful":0,"cool":0},"vy81_OZ_sykc8Mi9rutYcA":{"text":"Deliciously messy meal that we seek out every trip. Try the sazarac at the bar while you w","useful":0,"cool":0},"GgEfEl0Kp_l4sHCazEQPow":{"text":"I met up with a few friends for dinner. This is a great part of NOLA. The wait was minimum","useful":0,"cool":0},"E6-KLRG6gU50gktWo_iz8g":{"text":"One of the best meals we have had in NOLA this trip.  Oysters bienville, sautéed drum topp","useful":0,"cool":0},"kc9vRzk7ZzWVAzjgkmtfvA":{"text":"Clearly the Best Shrimp I have ever had!!!!\nVery fun place. \nOn a short business trip to N","useful":1,"cool":0},"-10_8j2qV3u6vAVnMZskLA":{"text":"Wonderful lunch. I had the Andouille Sausage Ravioli. It is served in a rich cream sauce a","useful":1,"cool":0},"nQ3voEEVMTD-zzN1mmNCvQ":{"text":"The off-street parking is a huge plus, especially considering all the construction on Napo","useful":2,"cool":1},"P-ww5B2BvC68H9JbkWaDWg":{"text":"We wanted gumbo, we wanted BBQ shrimp, we wanted oysters; we got it all at Pascal's Manale","useful":1,"cool":1},"TJMXE7e9eeSdUAQMeTJ4aw":{"text":"I went there recently with my mom on a Saturday evening.  We did not have a reservation, b","useful":0,"cool":0},"8M4rRifNY0PvQHykug5sPg":{"text":"Fantastic authentic Italian! Had a wonderful lunch. The chicken parm was great. Oh - and t","useful":1,"cool":0},"fqyvIbWQECjdk25PI7I4TQ":{"text":"Great Restrant always go their when in New Orleans, First went 1980 always have BBQ srimp ","useful":0,"cool":0},"Va_dXoWBXL1pG8eQ1NU7JA":{"text":"Terribly disappointing. Had heard about Pascal's Manale from many friends and Yelp reviews","useful":0,"cool":0},"_NsvBCcsoj9g0fwDwnphrg":{"text":"Been going there for years based on a recommendation of my late father - he loved this pla","useful":0,"cool":1},"FnaZivxf72Dl7Vttb1s8Qg":{"text":"First time to NOLA, two people had told us we had to try Pascal's.  as your seated in the ","useful":0,"cool":0},"EUWqASmhH_MTXVkTgy3HIg":{"text":"My husband and I finally tried this restaurant after several visits to New Orleans and we ","useful":0,"cool":0},"vHlF1DYw7gnoXVcUP7sd2g":{"text":"Excellent service and bbq shrimp were so amazing! This place is a little old but not in th","useful":0,"cool":0},"McgHSyqPw2mVhQaIJ5Kdmg":{"text":"OMGosh this is the BBQ Shrimp headquarters. Some say Mr. B's, and there's 20 other Nola jo","useful":0,"cool":1},"FaSytsTjvV6ecNK41msXRA":{"text":"Bbq shrimp was awesome!! (Not really bbq though., nicely seasoned, buttery sauce) Best shr","useful":0,"cool":0},"WMgBznSkHTemp0_bcINnVQ":{"text":"From the oyster bar in the lobby to the service at your table, Pascal's Manale will not di","useful":0,"cool":0},"SdWKmmqR_wDaJfqM183mqQ":{"text":"I don't usually burst out with smiles while eating, but the BBQ shrimp couldn't contain it","useful":0,"cool":0},"GSWFakUGz8hF4K0_pXVkIA":{"text":"Came here based on IRL recommendations.  Decided to walk and take the streetcar from the h","useful":0,"cool":0},"2DQg6FaXkAh1Ns0pKoggbg":{"text":"My husband's parents used to come here  years ago when they traveled to NOLA from Illinois","useful":1,"cool":0},"x39SxLE-7BWH6q8rxgHCDw":{"text":"If you want fresh oysters, this is the place to go.\n\nThe oyster bar is fantastic.\n\nMy next","useful":0,"cool":0},"vOFbWPtYDIYDACXnL-pknw":{"text":"A coworker recommended this place to us. I was excited for the BBQ shrimp. Anyway, the dow","useful":0,"cool":0},"NnfzTywH3w8_BqNlCE9i1Q":{"text":"Uneven and occasionally pretty great.  First of all I know you're going to get that famous","useful":0,"cool":0},"RAmkM9zIp8U6_ypiQCa69A":{"text":"Very sad to only give this 3 stars. One of my former faves. Still worth going for the old ","useful":0,"cool":0},"g7HNhrKiccx6A2h9UknF2Q":{"text":"Had the bbq shrimp, pan roast and oysters dante. Everyone talks to how amazing the bbq shr","useful":0,"cool":0},"SqreZdLLN2ftneSnQc_S3Q":{"text":"I was unimpressed by the food for the price. I may have gone in here a little too early in","useful":0,"cool":0},"2Y13lk2E0pPSSD-8PEhGhw":{"text":"One thing I can say..I'm totally addicted to your food..!You've gained a customer for life","useful":0,"cool":0},"-m1-KbBz_02cmnx6oDfRVA":{"text":"Oyster bar was excellent, the best oyster in town.\n\nBBQ shrimps, I don't know about others","useful":0,"cool":0},"2rJnCFpwPPMhZV5VHDwY-g":{"text":"Today, something was off. I ordered the calamari and the chicken piccata. The chicken was ","useful":0,"cool":0},"Zf7cUFcUZiGA9ox-1RutYA":{"text":"This is an institution and a must when visiting NOLA. \n\nI came for the barbecued shrimp be","useful":1,"cool":1},"P60pDSv56KfA6qaRg3qXSQ":{"text":"Definitely deserves a visit, maybe many visits! Unique menu in antique New Orleans setting","useful":3,"cool":1},"Lld0MnEv0axpvQvHWl0VbA":{"text":"Disappointment. On vacation from southern California, multiple people said you MuST HAVE t","useful":0,"cool":0},"k30x2y-__fOW7894lnkH5g":{"text":"I think this was the best meal of my life. Great oysters, although huge were still amazing","useful":0,"cool":0},"Sz_XzUZGeFsSqVPDSMRPTw":{"text":"We had reservations for 7 people. We arrived 15 minutes early.  2 large groups that came i","useful":0,"cool":0},"zscrTvC5tG8nGF-h4nrIaw":{"text":"A New Orleans favorite and known for the creation of BBQ shrimp.  This place is full of no","useful":2,"cool":1},"YFot_Ho1X8vjxkeRnQq__w":{"text":"WORST SERVICE EVER. I was in a group large enough to qualify for added gratuity, and the w","useful":0,"cool":0},"mL2DpRl-Jtxmcdq8lqbJCw":{"text":"5-31-18 Had reservation, seated quickly, very nice dining rm., old school style, elegant b","useful":1,"cool":1},"kFw26ihfKizH7wn8KO-uqw":{"text":"I don't generally rate restaurants , however, this restaurant is off the beaten path an mi","useful":0,"cool":0},"xb3yAPjo0tYhDWsnSWLiKQ":{"text":"This old-school restaurant disappointed us. The service was okay, but the barman was slowe","useful":2,"cool":0},"NC_n5gHqbVsIUl_To-XvCA":{"text":"Food ok service good but this place seems to be past it's prime. There is better food to b","useful":0,"cool":0},"3m6JbkLOTE7Q0yWuTC62xw":{"text":"When we travel to New Orleans, it's been a tradition to make it down st Charles to get BBQ","useful":0,"cool":0},"QpU5zpasOD7OoBEp9QLsDQ":{"text":"I had been hearing about this place since I was a kid but mom and dad never took me there ","useful":0,"cool":0},"gVtt_ckrvz1-S2HSthP2vA":{"text":"Disappointing. I had been to PM many years ago and was blown away by their BBQ shrimp. Thi","useful":0,"cool":0},"xIcHaee2VRuddZVcGpNkMA":{"text":"I always make the mistake of not ordering the BBQ shrimp every time I go to Pascal's, whic","useful":0,"cool":0},"zlpDEq0vA8m78lL_h5ubaA":{"text":"Oyster bar is awesome. They stick them on this nice marble bar right in front of you with ","useful":1,"cool":0},"qcGhJb8IsEp1Bb9mGlDilw":{"text":"Famous for creating BBQ Shrimp....famous for mediocre drum specials as well. I had not bee","useful":0,"cool":0},"GCLZmCgzXiwhWngHPnuYTA":{"text":"Friendly and communicative staff. Gracefully aged atmosphere.\n\nWaiters in Formal attire, o","useful":2,"cool":0},"DTNj-dRnHzVUhUvrn9xu8Q":{"text":"Pascal's Manale is the one restaurant in New Orleans I must dine at when I am in New Orlea","useful":0,"cool":0},"jQvfjvl-vt5ZOq5RiZ5XXw":{"text":"The food was decent, not worth mentioning really. The server took a long time to make it t","useful":0,"cool":0},"sHV-x2oqYRGtP5H10Io_Zg":{"text":"An absolute must for NOLA foodies.\nTHE place for BBQ shrimp. The broth is so good you'll w","useful":3,"cool":1},"W1VQXQkFHQClVumqPLNGaw":{"text":"Such a delicious meal here! My husband and I came in for dinner during the week. We ordere","useful":5,"cool":1},"qGoY1A6BWszjBgca97_4Ag":{"text":"Everything you'd want from a neighborhood Italian restaurant in New Orleans. The food is a","useful":0,"cool":0},"bASGnPZG5-Bm99Xwlp0LsQ":{"text":"I have eaten at this place numerous amount of times in the past... Pre Katrina. \n\nHowever,","useful":2,"cool":1},"md82E-FO3jOmHgPyeSaVnw":{"text":"After having eaten Shrimp Manale for years in Mississippi at various people's houses, I wa","useful":0,"cool":0},"Ki-0-z6UOL337BkP-G-4aw":{"text":"Burgers were pretty good and the service was also decent.  But I have to say I was very sh","useful":0,"cool":0},"2MWd9_41xY53-aRLI-zFwA":{"text":"The Bar b que shrimp is amazing! Been going for over 25 years and never disappointed!!","useful":0,"cool":0},"yolld1Zg3452IUhG1cPu8Q":{"text":"This may be the best place in town to eat Raw Oysters for my taste. I like bellying up to ","useful":0,"cool":0},"jbr_2IW5QX1Ioq4oClQBMw":{"text":"Don't get me wrong. I have no problem with old-fashioned restaurants with legacy menus and","useful":4,"cool":3},"3YcCUPvXTzEtJKRxriaxDg":{"text":"Fantastic! We live in California but we pretty much travel to Nola every year or so simply","useful":1,"cool":0},"IIeSWuX8r8zR0ZTJoun3Vg":{"text":"We had reservations for 7 people. We arrived 15 minutes early.  2 large groups that came i","useful":0,"cool":0},"CvXbuS9zH-0S9iZdw7-ANg":{"text":"I think this was worth the trip out of the French Quarter just to try the BBQ shrimp, it w","useful":1,"cool":0},"wfB6zDk_WUOMT7E0It8iuw":{"text":"A gem in the uptown district.  The ambiance is truly southern elegance.  Located in a conv","useful":2,"cool":0},"PWQcoV2ykw1Qp2uDekm57A":{"text":"We ate here on a recent trip to Nola. Based on the locals advice and opinions it sounded r","useful":1,"cool":0},"kF2XwVnySQ6H2MaDCmBbZA":{"text":"A colleague took us here during a convention to try their world famous BBQ shrimp.  You ge","useful":0,"cool":0},"inptUOKdFuxC5f_D7KoZqQ":{"text":"So good! Get the BBQ shrimp! Dip your bread in the Au Jus from the shrimp! Sooooo amazing!","useful":0,"cool":0},"eL_Sz9ltorIxY3nVxdi3TQ":{"text":"I travel a ton and generally hate touristy locations.  I prefer going where the locals go.","useful":6,"cool":2},"8XCvitncsKY0GP5jGaCkiQ":{"text":"Get the bread pudding. The rest of the menu is great - I had the drum and a good beet sala","useful":0,"cool":0},"-5wGWRnhFbh1X7Hv1YufGg":{"text":"Table for two. Showed up without reservation on New Years Day around 6:00pm. We were able ","useful":1,"cool":0},"-2Ve-duWtT3QA1qsavHkiw":{"text":"THEY GAVE ME A  BIB! That was awesome. I wore a really pretty dress here and it was hilari","useful":1,"cool":0},"BDegwsSOKzl8LpZyUeCCdQ":{"text":"The best food, service and atmosphere of ANY of the real local's restaurants.  This is not","useful":0,"cool":0},"S42bFeAMVAumgaLZi9vXcg":{"text":"Was this Throw-Back Thursday?\n\nPascal's Manale is one of the oldest restaurants in New Orl","useful":0,"cool":0},"ON1P63QmhsAPkNTTp7yRhw":{"text":"A little bit of a drive out of the downtown area but a great quality experience.  Good foo","useful":0,"cool":0},"add2CbTr5cSmJtynJMzaCg":{"text":"Great food and warm, freindly service.  Veal picatta and pasta was delish. Salads large an","useful":0,"cool":0},"9kBWAnudfr3FeyhcGIfGzA":{"text":"My wife, son, and I ate here on weeknight between Jazz Fest weekends. We were running late","useful":0,"cool":0},"s-wLPxCg8BjDuzAJAY6WZw":{"text":"Pascal Manale's is off the beaten path deep into the Garden District and certainly not exa","useful":2,"cool":0},"1En9kZzF4pp74038vZXrqQ":{"text":"We had a large group in town, and my boss decided to take them to Pascal's Manale.  It def","useful":8,"cool":1},"MiUFs1MkHOeiGEnwuG1V1A":{"text":"Great customer service. Excellent food. I had BBQ shrimp and grits and bread pudding--top ","useful":1,"cool":0},"Jeo6dQTu4hhn9iNVq7Tfjw":{"text":"I will preface this review by stating that I didnt try the BBQ Shrimp. However, I did get ","useful":0,"cool":0},"4e_9fewF2Qt23-Y6K4HyTA":{"text":"Pascal's Manale specializes in Creole Italian dishes but it's main focus is the BBQ shrimp","useful":2,"cool":2},"OlyW6BogQYNdLWYePPj99w":{"text":"Been here twice before and it never fails!!!! Best BBQ shrimp poboy in New Orleans!!! The ","useful":0,"cool":0},"tDAlEd9KbT3TugnrE3zvEQ":{"text":"Host acted like he was doing us a favor by seating us since we didn't have a reservation. ","useful":0,"cool":0},"fwlpZHkiq4b1xJ77ky42jQ":{"text":"On 2/26/16 Friday evening we had a group of 19. We were very disappointed. It took over tw","useful":0,"cool":0},"W8GZ9taXDA_IH4syDAxFkQ":{"text":"Visit New Orleans once a year since childhood and this is one of the places my parents and","useful":0,"cool":0},"nf74VHVKUYuyYZS4nHGk4g":{"text":"Let me first start off by saying that I've heard great things about this place.  Unfortuna","useful":1,"cool":0},"9PBm8urgxVpY3MqltD4w5g":{"text":"The atmosphere is old-time Louisiana, but the food is not star quality. From the reviews i","useful":0,"cool":0},"Vk9XkF9xcphlTyEsfewi-A":{"text":"Comfort food, NOLA style. Old school decor, super-filling portions, and (despite the upsca","useful":0,"cool":0},"juup6_t2IaeTuYP-4SFH2g":{"text":"HEY YOU! You visiting New Orleans? You ARE going to Pascal's Manale and you ARE ordering t","useful":2,"cool":0},"deY67yHp0gOroQC3Tsizeg":{"text":"Came for coolinary today. Heavy handed clunky food. Not elegant in any way. Pasta way too ","useful":0,"cool":0},"hu76hgtF663VCLfuQxJmnw":{"text":"Had fresh oysters half-off, and some fantastic turtle soup. Everything was amazing, and ha","useful":0,"cool":0},"V8LHQpNVo5xnwSUXyUcg4g":{"text":"I have to say that this is my favorite restaurant in New Orleans. I have been here many ti","useful":1,"cool":1},"Y9jqcF13Smd6-5CfalRfcw":{"text":"This is another institution for New Orleans.  Its not what I remembered from years ago.  F","useful":0,"cool":0},"2ITGC83pr3z3zXJHe-Y9mQ":{"text":"Pascal's Manale is a famous New Orleans restaurant that everyone should visit at least onc","useful":5,"cool":5},"87YDBGI-gzQCYVYWnOFzxw":{"text":"Upon arriving to the restaurant, we were seating right away. I had dirty utensils at the t","useful":0,"cool":0},"NQI9sjMRkhPnAD8md8ZvMg":{"text":"This was one of highlights of our trip to New Orleans.  We rode the St Charles Trolley fro","useful":1,"cool":0},"5PXfNbeGiQw2J9ahIgM5jg":{"text":"A gem I the uptown district.  The ambiance is truly southern elegance.  Located in a conve","useful":0,"cool":0},"A3KdZG-kRC_WvL0Wsdy-gA":{"text":"The oysters here just can't be beat- they are HUGE AND FRESH!!!! Waitress was the best and","useful":0,"cool":0},"dCreyYOi3_6Q18WwwWqxnQ":{"text":"The shrimp sandwich is to DIE FOR! We stopped in for lunch and enjoyed the classic ambianc","useful":0,"cool":0},"Ltnjnu_HTP5xCUO7JJCgsQ":{"text":"Haven't eaten their in 30 years my only point of this review is too explain their signatur","useful":0,"cool":0},"E-iAmNXXpBuS1pbFGJZHNQ":{"text":"The food was excellent but the service puts this place over the top. This was one of the f","useful":2,"cool":2},"2X52_fZ2SeIP7WPF9vBE8g":{"text":"A nice refreshing ride on the streetcar from our hotel to get away from the crowds. Walked","useful":0,"cool":0},"qfi2tZ8rf0UKrGiamioXwQ":{"text":"Awesome oyster happy hour!  Nothing says New Orleans like this place.  the drinks are half","useful":0,"cool":0},"vC4qRE8mq1nmQbZ7HKktWw":{"text":"Our De  La Sale class of 71 had an awesome lunch. We laughed and commented each other on h","useful":0,"cool":0},"dpcS7s8hvb5sAH9Nj9O5eQ":{"text":"Run down of dinner:\n1. Start out at the Oyster Bar. Wow! The freshest most amazing oysters","useful":1,"cool":0},"jejsKJZMt453q_vTCzMCBA":{"text":"I go to Pascal's Manale and I transform from a charming young lady into a loud, scotch swi","useful":0,"cool":2},"2YEtTS1GCKIpyWV87X3Sng":{"text":"I love these classic New Orleans restaurants.  I hope no matter how many new places open t","useful":1,"cool":2},"R7p-GKkMLmkwNSCgcmxUfQ":{"text":"Post Katrina has seen a major change come to this restaurant.... It's simply not the same.","useful":0,"cool":0},"Fa1LuukKgFWDXiuQSzHzjQ":{"text":"We had a wonderful traditional New Orleans dinner last night at this iconic restaurant. It","useful":0,"cool":0},"RFtJnVzmHhtBWTTMo5f6DQ":{"text":"I went to Pascal's Manale with a few colleagues. I had never been before, but several of t","useful":4,"cool":2},"TDYf7eSCp1SYa4udRS7RLw":{"text":"I understand history and all but I don't think this place is very good. The raw oysters an","useful":0,"cool":0},"MUbszRC6AluXAK7--QRZSQ":{"text":"OYSTER HAPPY HOUR. OMG. \n\nSeriously, you'll love it. Why aren't you there yet? Uptown T is","useful":0,"cool":0},"jT-J93qwRwgMjoe-IWIjfQ":{"text":"We were told by a New Orleans native to avoid tourist trap French Quarter restaurants as t","useful":1,"cool":2},"YLlt0VmIQ910m7iXb5WnAw":{"text":"Had terrible service.  To start with I had made reservations, when I got there they did no","useful":0,"cool":0},"Xtx78mKaCKsbATSIPgAiHQ":{"text":"I love the BBQ shrimp I make at home and was excited to try the original. I was sad to fin","useful":0,"cool":0},"DTVYFd4lpHYP0AduTz7e-w":{"text":"Best place to experience New Orleans\n\nReal clean bbq shrimp\n\nWaiters are locals. \n\nClassic","useful":0,"cool":0},"9VusnmBah-S3WdQKa6KmxA":{"text":"Somehow, I lived in New Orleans for four years and never knew anything about Manale's (as ","useful":13,"cool":11},"6eX5YNsd6v13XaKWBFNYaw":{"text":"My thoughts on Pascale's:  \n\nThe food is good and a throwback to the menu on many NOLA res","useful":6,"cool":3},"F-XKobiPGkvD73eVtX034w":{"text":"I'm trying to do this  after eating some pretty damn good NOLA bbq shrimp!!! Why do I tort","useful":4,"cool":3},"_fWA4jeGHPYpSb9j2B05Tg":{"text":"I had hear about the barbecue shrimp many years ago, when I was a student at Tulane, but c","useful":2,"cool":0},"A573y3km8iP8zw5OlyJQXw":{"text":"The BBQ Shrimp is awesome. It is not really BBQ in the normal sense, it is a bunch of big ","useful":0,"cool":0},"tQeASdHLrUsMtWXnWMiESQ":{"text":"BBQ shrimp were good. Service was horrible. They told us it would be 30 min wait and 1 hr ","useful":0,"cool":0},"d0gcEpygLZUS9t8ZXPNnGA":{"text":"Pascal's is truly a must have when visiting N.O. The atmosphere is pretty darn classy but ","useful":6,"cool":4},"5pnZtNkuSu9M_M2lkt1xzw":{"text":"Please! PLEASE! Bring back the pre-Katrina menu. Since Katrina, Pascal's Manale has never ","useful":0,"cool":0},"SBadjh4oj9XC4spWxOftfQ":{"text":"I really really wanted to like them, but the BBQ shrimp just wasn't good.  They were bland","useful":1,"cool":0},"SE6Ren4UprzixkgCROnv0w":{"text":"Great place.  Cheap booze and oysters, excellent ambiance.  Bartenders have great stories.","useful":2,"cool":0},"0H8Hnev74XhqrCDSLdHssQ":{"text":"Pascal's Manale is a New Orleans institution- popular with locals and tourists alike. Loca","useful":1,"cool":1},"qqeOcke7YX-94MCX2KPllg":{"text":"Horrible....who do you think you are. Random night went in for dinner. Rude rude rude empl","useful":0,"cool":0},"tm2lqEAJgDSIkSd3sD_HIQ":{"text":"Over priced.   New Orleans fish was hard and dry.  Hostess and waiter aloof.  Would not ev","useful":0,"cool":0},"ljoxaqbA95NWVucmlhEQqw":{"text":"I was so excited to try the famous \"Pascal's Manale \" for the first time unfortunately I w","useful":0,"cool":0},"2tay3EMK9yYneIy-GNBsMQ":{"text":"So I'm giving this review strictly on the bbq shrimp dish. First, the soft shell crab with","useful":0,"cool":0},"2a_e0vczEfmKnDWabROmVQ":{"text":"Had an enjoyable evening tonight. A group of us ladies came in and had the pleasure of bei","useful":0,"cool":0},"7wGXxx6BrMyzUrGKrNysbg":{"text":"What a disappointment this place was.  It came very highly recommended and it was one of t","useful":2,"cool":0},"yQ7qTQGFksA_nl6HoWJAeg":{"text":"I loved the Barbecue Shrimp and Grits..The Service was great...Everyone in our party loved","useful":0,"cool":0},"XYNnlq-g6HE-JK6NWoL25w":{"text":"You should probably fast before eating here.  You should also plan on having a luxuriously","useful":3,"cool":2},"S6IuEd4_weE_Yj9EQOxH-w":{"text":"Highly recommend the raw oyster happy hour! Oysters are shucked one-by-one and as fresh as","useful":1,"cool":0},"O4hBSpHokmVl_rL_YNWsbA":{"text":"Great old standby in the Big Easy, serving up great seafood and history since 1913.\n\nPan r","useful":2,"cool":1},"Xgx4tVTgThH5xzitPzbb-g":{"text":"Had a delightful experience tonight at Pascale's... We heard about this place from an acqu","useful":0,"cool":0},"WnbPdTsBljif9X259uf8uQ":{"text":"We were here last in 1990 for the 49ers stomping the Broncos in the SuperBowl. It's been u","useful":0,"cool":1},"PR-xr6QwNgS5ED5ImFUjOg":{"text":"My daughter has severe food allergies (egg, peanut, tree nut), so eating out is always a c","useful":0,"cool":0},"B6vpj_bTqJx5LF6oDGURew":{"text":"Though I'm a New Orleans native this was my first time visiting. Overall I would give them","useful":1,"cool":0},"H57JTiEz7xsQR6wSDzjK_g":{"text":"The best BBQ shrimp ever!! Been eating here for over 40 years. Oysters on the\nHalf shell e","useful":2,"cool":3},"1Wd-9fRIPExqR3b12IpEJQ":{"text":"This was the most disappointing meal we had on our recent trip to NO. The place was highly","useful":3,"cool":0},"ce8bMVFwE-xh-iTq46SmGQ":{"text":"Wow! What an experience. A good friend was moving from New Orleans back to California, so ","useful":2,"cool":1},"dsxayZapDJuFFGk2P8Hipg":{"text":"Home of thee best shrimp house I've ever eaten: I'm not alone. Do try this restaurant .","useful":0,"cool":0},"-Pn-H37b1oEso98tG7tYaw":{"text":"Not sure why this place has only three stars! It is excellent. Very homey atmosphere great","useful":0,"cool":0},"dHIZeV81wNLHQqGR5OE0WA":{"text":"Don't waste your time or money. This place is riding on it's well know name but it has pas","useful":0,"cool":0},"YgzesTc7lcp_L_l3THq1lg":{"text":"We only got the try some oysters here so the review is just for that. We stopped in here f","useful":6,"cool":5},"ySnsMFZo_pLyqQb6SmcysA":{"text":"This place is very nice. The shrimp pasta (diavolo) was delicious as well as the creamed s","useful":0,"cool":0},"r_QFf6jsV8w4LFnaErkEQA":{"text":"of course ... NOLA ... BBQ Shrimp and Fish ... for those unfamiliar this is not BBQ sauce ","useful":2,"cool":1},"k0koAhd9qnsAsaiFkeSY8A":{"text":"Went here for a friend's birthday. The staff was wonderful and the food was delicious","useful":0,"cool":0},"_XzKP2_g5EovQKpMIL4chg":{"text":"BBQ shrimp= excellent, but messy. \nGood old New Orleans atmosphere. \n\nThe penne with fried","useful":2,"cool":0},"fNmtmxEyetvL2mqgIXbdPA":{"text":"Where do I begin? We were a party of 16, we asked the waitress in the beginning if we coul","useful":0,"cool":0},"IkrAtLg1bdJ547MQ6suiWQ":{"text":"Not as good as it used to be. BBQ shrimp was watery, filet over cooked. The wait in betwee","useful":3,"cool":0},"ISAbAjCmtpZFoEVDh2A-rw":{"text":"I went with some friends a month or so ago for Coolinary. BIG disappointment. Do not expec","useful":0,"cool":0},"hT8de9viwOv1gsOObHKKog":{"text":"The BBQ shrimp are such a treat.  Many places try to copy the dish but no one makes it as ","useful":1,"cool":1},"fxoazMewnnEu-By9RP_k_A":{"text":"First, I would give 4.5 stars. Though after consuming my first plate/bowl of BBQ shrimp, i","useful":0,"cool":0},"kAtHuYzEhC9lMMdWZosX5A":{"text":"I think of this place from time to time. Had such an amazing experience here. The most ama","useful":0,"cool":0},"j_XDg0KSvJ0gfKWwA2FQPw":{"text":"If you only want barbeque shrimp, this place is 5-stars.  If you want anything else, it's ","useful":0,"cool":0},"qLh_S06l0c6ltXGwW6o5iQ":{"text":"This place reminds me of an episode of Family Guy where Stewie said something like the fol","useful":9,"cool":8},"wAUp7yGGpUzc5ZQQag-pMQ":{"text":"Overpriced with tremendous attitude, wait staff uninterested in your order, pushing unimag","useful":0,"cool":0},"6HAtsdFH9QzMupOy6nYO0A":{"text":"I wanted so much to like/ love Pascal's. \n\nBack story-- I am a NOLA local who has eaten ou","useful":10,"cool":1},"k_jr2UpPHJoMstehaLtzBg":{"text":"This family owned restaurant has been opened since 1913 and is home of the original BBQ sh","useful":0,"cool":0},"3SRMxdS1vqJyPVfJO0J48g":{"text":"Happy Hour? Not so happy. After years of dining occasionally at Manale's I saw its online ","useful":0,"cool":0},"GLeoGCyiXQjVMGSaFbem7g":{"text":"Our family loves the BBQ shrimp and the French bread. Our daughter can make a meal of just","useful":1,"cool":1},"J14-Cn7xXAPOdHvYcVZluA":{"text":"Ate here tonight with wife Sarah; first time in 20 years or so.  BBQ shrimp as great as ev","useful":2,"cool":1},"hRpr-TPdyGfbZs2wdyWEjg":{"text":"My wife and I had a very nice celebratory dinner here recently.  The oysters Bienville app","useful":9,"cool":6},"xx9j92pQ771PkzEjh6WiQA":{"text":"To be honest, the gulf shrimp they serve here are truly world famous. One look on the wall","useful":0,"cool":0},"AWR2ORAbpCMEusiK_uRVWA":{"text":"This restaurant had great potential but only lived up to the hype around the BBQ shrimp (d","useful":1,"cool":1},"nX-0wxdHM-aq-YY5HYUoHA":{"text":"So tasty and what a beautiful historic building and restaurant. I loved the bar area and O","useful":1,"cool":1},"6ryimAcyYgfgtB78USlcdQ":{"text":"I have been coming to this restaurant since I was a kid and now I take my kids there.  I h","useful":0,"cool":0},"rTs5YFL9KcX_ofQWA9Jz0w":{"text":"If you crave raw oysters - this is the place! Get a couple of happy hour cocktails and a d","useful":1,"cool":1},"KwDbrGhrzaWPJ6FDAS45yQ":{"text":"What a lovely experience with the wifey and our daughter. The wifey ordered the stuffed sh","useful":4,"cool":2},"HtaYg2tXtZWkqyjYYrbxkw":{"text":"PROS: BBQ Shrimp, good service, nostalgic atmosphere.\nCONS: Can't order Raw Oysters in the","useful":0,"cool":0},"l9gtWRBhr-rMxaiB9bDhjg":{"text":"I have enjoyed dinner at Pascal's Manale whenever I visit New Orleans. Always great from s","useful":0,"cool":0},"2f0TInaRpS5CL8tOW6mwEg":{"text":"Called to ask about getting in and told it was crowded. Went anyway and the place was abou","useful":0,"cool":0},"4VxcjyW0iUxBs98l_KTuCQ":{"text":"Went to the bar one night by myself and had a great time. People who worked there were mor","useful":0,"cool":0},"E2VAoPbjXgpOe8-HLcRzbw":{"text":"Ok, I've got to admit that it hurts to go two stars with this review.  I've been to Pascal","useful":6,"cool":2},"CX5ly78xtzTi4bs0LKuuIQ":{"text":"I am married to a New Orleans native that remembers this restaurant when the line to get i","useful":2,"cool":0},"sYkoLBhDyOCipbZNG2U4qA":{"text":"I've only ever had the bbq shrimp here but it's my favorite place in Nola to eat this dish","useful":2,"cool":2},"hAWZEz1dSz6Gi5XIJlvLLA":{"text":"Just had one of the worst experiences in dining. The noise level was horrible, could not h","useful":0,"cool":0},"n3ZJ-bBAnWe-lux8zzJwfw":{"text":"The BBQ shrimp are such a treat.  Many places try to copy the dish but no none make it as ","useful":0,"cool":0},"PO18F6wCkQXjOMxzq_v7ZA":{"text":"It's been a few years since I have been here but I absolutely loved everything about the p","useful":0,"cool":0},"Rf99ghivovetqpjCxGqWgA":{"text":"Great food and warm, freindly service.  Veal picatta and pasta was delish. Salads large an","useful":0,"cool":0},"ptqXkGWLRa0KIghHlyCcjQ":{"text":"It has been a long time since we lived in New Orleans but made the trip back to celebrate ","useful":0,"cool":0},"zWF8uYmAayE1DIjmgTLPBw":{"text":"Delicious food and great service! This was our second time eating here in the past tens ye","useful":2,"cool":2},"vDnfsWP-6JKktBg6jzbjsw":{"text":"Just enjoyed a great dinner here with hubby.  Food was solid good, not great; we're pretty","useful":1,"cool":1},"MxqiEwk15TEI1mxG9HEdtg":{"text":"So it has taken me a while to write a review. But I was there a year ago and we decided to","useful":2,"cool":1},"Lr8Dam2aFh6LikDd8im6nA":{"text":"Love this place.  Always go there when in New Orleans.  Everything we have had there is so","useful":0,"cool":0},"SgJ11E98zRimrtuY0ijz9w":{"text":"I've eaten there many times.  What has happened to this once great local restaurant?  They","useful":0,"cool":0},"8abZOK3xlsr6PnO9JVb6pA":{"text":"The BBQ Shrimp was amazing and the bread pudding to die for. The best part of the night wa","useful":1,"cool":0},"OCtlMhS30S9LR9H6MiSasg":{"text":"Been twice to this place. Like the ambiance of the dinning room and love the bar area. Tho","useful":1,"cool":1},"e4WxrEwEynLZh5QwSKYlAA":{"text":"Come for the shrimp.  Stay for the bleu cheese salad dressing on the wedge salad and the f","useful":0,"cool":0},"dTogVTXgIsL4WGNvIlZVhA":{"text":"Every time I am in New Orleans, I try to make it here. I heard about it my first time to N","useful":0,"cool":1},"7EGynAOX-5hxUwXHOjW9GA":{"text":"Pascal's Manale rules. Make sure grab a drink from Jerry at the bar and have Uptown T shuc","useful":0,"cool":0},"f1ePwv1Nhzb3JWE3EMvK2w":{"text":"A must have for New Orleans BBQ Shrimp. Had the special fish with shrimp. \nTheir fresh Fre","useful":1,"cool":1},"ohVGkMzIA8s3pJEQDTniyQ":{"text":"We went with a group of 8 and had a great time.  Staff and service were excellent.  This i","useful":1,"cool":1},"iW63_0BSNzDihb418DZAFw":{"text":"As visitors to New Orleans, I would say this stop is a must for first timers. The BBQ Shri","useful":2,"cool":3},"UlnMjO8viggpUbkxDazLBA":{"text":"I have been traveling to New Orleans for business and pleasure for the past 24 years.  The","useful":3,"cool":0},"P-AbmGYw4F14kmDyyajrhw":{"text":"I have been coming here since I was a child, and it's always been my most memorable and fa","useful":1,"cool":1},"lYhocGPItmtjNLWUYeUd7w":{"text":"If you're looking for a 'tourist place'... keep looking. This place is as authentic New Or","useful":0,"cool":0},"BqEVYf-8mnBb5xQIVSf-9A":{"text":"You can't beat those BBQ shrimp. They are the creators of them and they even give you the ","useful":1,"cool":1},"s9cu1j-YmudPKPR5qkr92g":{"text":"We had a reservation for a Thursday night dinner.  The restaurant was located up Napoleon,","useful":2,"cool":1},"Mzy4Fv6Ry5NNrzvmv-HJEg":{"text":"Making Time to get here again soon....never thought I'd say that after spending $13 on a s","useful":1,"cool":2},"-dFWApXkAArs2JDNP3ziKg":{"text":"Hands down the freshest and best oyster bar in amy existence. Small local place. Such a hi","useful":0,"cool":0},"3e4qt8X-nrP9KwGH6LKjfg":{"text":"I have came here the last couple days in a row for happy hour.  Fresh shucked oysters and ","useful":2,"cool":0},"qyx8X62KTz40LKDVYXmi-A":{"text":"I should be giving a review of the attentive service and delicious food. Unfortunately thi","useful":4,"cool":0},"xJ8C2YYQwuxEJZbZnHneKA":{"text":"We LOVED this New Orleans experience.  The best bbq shrimp on the planet.   They have an o","useful":1,"cool":2},"sAq8fwu4g95sDr7w1j_1dw":{"text":"Wanted to love it after hearing that it's where New Orleans natives eat. We had a large gr","useful":2,"cool":1},"aGqqwSIcDMCts06XXWh_Jw":{"text":"Wow wow wow is all I can say. Everything was delicious. BBQ shrimp was excellent as were t","useful":3,"cool":2},"x5TJQ5_2LNu9Vh27L1Zzpw":{"text":"Hadn't been here in maybe a couple decades because I no longer live in this neighborhood. ","useful":3,"cool":3},"eaYRZnOB02Naa59NcPKedg":{"text":"I'm always Yelping for the newest or top rated restaurant and while searching in NOLA came","useful":2,"cool":1},"cpiu8p2nZcdm2gluF9gaNA":{"text":"I'm a little late on this review, but visited NOLA BEFORE all the unprecedented health cri","useful":8,"cool":7},"446-EEs0opqAvWAi_8vMGQ":{"text":"After calling last minute to get a reservation for a large party, Carson set us up with a ","useful":0,"cool":0},"0GQoE2B34WUv4GaM7VXyFg":{"text":"Very kind staff and great food! Classic bbq shrimp was great!","useful":0,"cool":0},"4ggu3nKsOqyS7rTyueGpaQ":{"text":"A true New Orleans restaurant. BBQ shrimp is not, for those unfamiliar, BBQed. It's just w","useful":4,"cool":4},"d8B-VOa9Bw3DlEpiBuE0fg":{"text":"This is not the place to go if you're vegetarian.  I had the Ensalada Alla Manale - \"olive","useful":1,"cool":0},"puAED9fX3vJpSx1xABZD8g":{"text":"Had a horrible experience.  From the bartenders attitude to a horrible server.  Shrimp was","useful":1,"cool":1},"boBtg04A4N8ZwDvjgiFkOA":{"text":"So if you've seen my latest posts you know I acknowledge restaurants ramping up service an","useful":0,"cool":0},"MFr1MQ-mV6NCunr6Jq7VpQ":{"text":"Classic N'Awlins stop. Their signature dish is their Barbecue Shrimp. They are not really ","useful":1,"cool":1},"lfCBcVQ-8mo21NKIXHw9yQ":{"text":"We came here during lunch. We only had one hour 12-1pm and needed to go back to work. The ","useful":4,"cool":3},"gGcrdLzwb7zbxBBEBWyoxw":{"text":"I have to say I was a little nervous when it said proper attire because I honestly do not ","useful":3,"cool":1},"5S3-V5xVUUF-wLzmhUqwJQ":{"text":"The BBQ shrimp are the best! We have been here 2 or 3 times before, but I forgot how great","useful":2,"cool":1},"1EWjLOYgoiARxoeYeT6YNQ":{"text":"I didn't expect to write this review. I had put off going here for years, but finally had ","useful":1,"cool":0},"fTsfl23SVN-bcqoRx3lTcQ":{"text":"Honestly the food was worth 3 stars, but the SERVICE. Oh my gosh - we saw a table get seat","useful":2,"cool":0},"LJ380zxTvJno2WRu4xdckA":{"text":"This was our special meal while in New Orleans. It was recommended by folks from New Orlea","useful":1,"cool":1},"WN8QLG0jhXsRv4Ue6XXDJA":{"text":"This restaurant is delicious with nice family atmosphere and excellent customer service.  ","useful":1,"cool":1},"7uAzfxqujz-Us21y_Wt0HA":{"text":"This is the most horrible dinner experience I have ever had. The one star is for the waitr","useful":7,"cool":0},"ssLpErhRDP5KwR9WyNMfNw":{"text":"Excellent lightly fried catfish lunch special! Service is great. A real NOLA classic!","useful":0,"cool":0},"r75kivdrNVyfPWFsRhhDkA":{"text":"We got a tip from a local this was where the locals go for dinner. Our server \"R\" was very","useful":1,"cool":1},"ssKIq0yyKY8S2qxkkYK01Q":{"text":"This is a bit delayed but 5* non the less..\nOn Jan 30th, I called from Tucson, Az and coul","useful":1,"cool":2},"62htQUZ6ZHqHdzmi3XJ5wA":{"text":"Slow getting dinners out of the kitchen, which resulted in our \"overstay at the table.\" Wh","useful":1,"cool":0},"3mlSqM-tbPh82Ar8_-kMoQ":{"text":"Any restaurant that's been around 1913 should be good...  and without hesitation, Pascal's","useful":2,"cool":2},"CcXOW9AUTjn05EUZ0-_iZA":{"text":"Barbeque shrimp was fantastic.  Anitpasto salad was not bad.  Dessert was okay.  Good time","useful":1,"cool":1},"cp68qi1M_Fj2EwgpSwcpSQ":{"text":"Went there on 10/24/19.  My waiter Michael was very nice and friendly.  Had a Sazerac, del","useful":1,"cool":1},"0wNnQ0eG6mzWiKRc9f411w":{"text":"Quaint old Italian restaurant three blocks from the St Charles trolley, known for their BB","useful":1,"cool":1},"E_WUcjhOqZ1Lm4siezbvmw":{"text":"We absolutely loved our experience. Louis took excellent care of us and was so enthusiasti","useful":0,"cool":0},"GRXnFZgogCTqxzTBy7WZ2g":{"text":"Pascal's Manale is a New Orleans institution, and I really enjoy visiting these older New ","useful":1,"cool":0},"8ED6BLa6W5G-FnF57jfU7Q":{"text":"Although I appreciated the fast service and the fresh food, the atmosphere was sort of \"st","useful":3,"cool":1},"OaTXADfZJBmwV1N3g_P2mw":{"text":"Horrible service. Wanted our money but did not want us there. Do not recommend this place ","useful":1,"cool":0},"2eHX8_e12_V5N9NXOaUHhw":{"text":"This would be a 3.5 star review but as we all know you cannot do half star reviews. It was","useful":1,"cool":0},"4TbmQscVgX2VnNV1aq82JQ":{"text":"Great dishes, nice ambience. Try the BBQ shrimp - outstanding, and the bread pudding was t","useful":0,"cool":0},"FfeLDBaA0yqD12HSuBQeSQ":{"text":"I have gone there since 14 which makes it over 60 years. It is one of the finest restauran","useful":1,"cool":1},"z3wudTRSh8GIbuVFmeWx6Q":{"text":"I have been coming to this place for 20 plus years and it continues to never disappoint. I","useful":2,"cool":2},"4lwyG8CbHPQC2rtnJaRY3g":{"text":"Pascal's Manale is known for creating the original BBQ shrimp. For those who are unfamilia","useful":14,"cool":12},"1gNITLz3mjHjoAps7NjLMg":{"text":"A must go to when in New Orleans. THE BEST bread pudding.  Also love the BBQ shrimp sandwi","useful":0,"cool":0},"V2lyJtghGeiZVDRVT4et4Q":{"text":"BBQ shrimp is to die for.   I can't stop thinking about it and it's been almost 3 months. ","useful":4,"cool":2},"QN2ybYHway2QlglYBf-wYA":{"text":"Went for lunch with a group of friends. Our server was attentive and really great. \n\nThe s","useful":1,"cool":0},"KRs2-B6mOmsWMWuKiNP1Dw":{"text":"What a disappointment.  I'm a local and grew up eating here.  It's been a few years and su","useful":1,"cool":1},"96d_fjYbtfUe16FwhNjOYQ":{"text":"So ugly. The dining room is an eyesore. The lighting was harshly bright. The carpet is a g","useful":1,"cool":0},"myY4Pfev0_0iX1Frmdbhzg":{"text":"As a HUGE thank you to my friend for helping me SO MUCH after the hurricane, I treated him","useful":0,"cool":0},"0nL4aCkbrTAcFw4NK0tcig":{"text":"Unacceptable -Cancel your reservation and don't eat here unless you want to be treated awf","useful":4,"cool":1},"EXL24vG0_ozMEp9YpDnwsA":{"text":"Went there on New Years Day for lunch on a whim as our daughter had been there for happy h","useful":1,"cool":1},"aeKSYZSvcVyVMWcCyrL2XA":{"text":"A few folks recommended this place so we thought we'd give it a try after visiting the WW2","useful":2,"cool":1},"T3z59em94gQmVeUpgxEtcg":{"text":"So wonderful! Amazing service, amazing food! The BBQ Shrimp were wonderful, as were the ha","useful":1,"cool":1},"LQeYFs64gTXWdP4H379CZA":{"text":"Food was delicious ! My waiter was very rude and even tried to shush us when ordering. He ","useful":2,"cool":1},"AOi-aA6aNIYvlYhV77FsrA":{"text":"Recommended via Lyft driver . Unfortunately it wasn't as good as he said . I ordered a chi","useful":1,"cool":0},"2Nt7bfyluOJzBwTQ3Uy6Xw":{"text":"A fantastic place for any old school New Orleanian to enjoy solid Italian. \n\nCame with the","useful":1,"cool":0},"6utOhP-tM11b9D422ylbuA":{"text":"loved the barbeque shrimp. The Salad was very good. It was the Pascuale salad.\nthe se","useful":1,"cool":1},"-aZB6GNpj25IMIhnjd8ukg":{"text":"Our server Louie (sp?) was fantastic, and everything we tried - BBQ shrimp and Frutta Del ","useful":1,"cool":1},"jxINpMYlUgvIOXQ607lvIQ":{"text":"I was extremely excited to order a gin martini and have the option for cocktail onions. No","useful":1,"cool":1},"jHtQJLqGS5o9SI_UMls8dQ":{"text":"Best food we had while in New Orleans!\n\nWe had the BBQ shrimp and it was awesome. I'm so g","useful":0,"cool":0},"DIM3OdrNfe_09_kPb3nCWA":{"text":"Wow! I found this place to totally live up to the hype. Especially considering it's during","useful":3,"cool":1},"zr_Ff8GEwR3SQB3viljCWw":{"text":"From what I was told, this is a local gem. From what I ate, it is delicious.\nI had all the","useful":1,"cool":2},"WLqCJFpw6SJ2ypkHF9Q6jw":{"text":"We're on a foodie tour of NO this weekend and had to try one of the oldies we've never bee","useful":0,"cool":0},"m_OrkTiuj9XYUkk-jD-Bmw":{"text":"Don't waste your money. You can get the same thing much cheaper from a truck stop buffet. ","useful":2,"cool":0},"ZqXkkCaiU_7K-rMYN7yHaw":{"text":"Had dinner there Saturday night early. Staff was more than attentive, the atmosphere was c","useful":0,"cool":0},"hSLL0IkbG3zm2D82Ly5ELA":{"text":"Came here with some friends while in town for a birthday celebration. The bar and oyster b","useful":1,"cool":1},"581CfOW8NLewSh9-ggXmzw":{"text":"Our lunch group tried the Coolinary menu in August and all us us agree that we can't wait ","useful":0,"cool":0},"MQ-lR0i-eyVlXbyVBQkIcg":{"text":"We came here to try the famous BBQ shrimp, which was amazing. \n\nHowever, the service was t","useful":1,"cool":1},"4aA0CsZykWYnv4F0ilAq2A":{"text":"I was in New Orleans and decided to get some lunch but the French Quarter is so busy and n","useful":6,"cool":4},"REEU89xnC7KseoBQEkFj_w":{"text":"I don't eat here often, but when I do, I must have the BarBQ shrimp.  This is one of the b","useful":0,"cool":0},"1k-wH758rvAGbwOvCsYs7g":{"text":"This had to be the worst meal I've ever eaten in New Orleans... and I've eaten a lot of me","useful":4,"cool":2},"nz_A6RQcWb-vH29FYGSOiw":{"text":"I've been trying to get into Pascal's Manale for years, every time I make it to New Orlean","useful":3,"cool":2},"0L2YoJ3LEunbfyFZ_NNNoA":{"text":"You looking for a good restaurant in New Orleans?  Keep on going.  Do not waste your time ","useful":0,"cool":0},"JQ2zMr4mNNJ0jROE9tlxYA":{"text":"Good service.  Friendly waitress.  As always, BBQ shrimp were excellent!  The fruit de mar","useful":1,"cool":1},"onQykefeKaJidSlR5mT0lQ":{"text":"To begin when we walked in the staff gave us unwelcomed looks and acted like they didnt wa","useful":4,"cool":0},"hVu-8FHPZkRyKw_8-CtXgw":{"text":"The dining room is very, very noisy.  It's like being at a prize fight with a group of dru","useful":1,"cool":0},"O48I9k0rnWOlzyKZjUoZJQ":{"text":"Had a great experience during happy hour Wednesday 7/17/2019 with a buddy. Fantastic servi","useful":0,"cool":0},"bZBbNMTMIRt55RTdb01ghA":{"text":"This is a gem of the Crescent City. The fresh food and great service make it a standalone ","useful":1,"cool":1},"NIBy6FhKGnwSvf_4q-7T5A":{"text":"I've been here before, but today is our 47th year wedding anniversary. The food is delicio","useful":1,"cool":0},"Kwgvf2W6exsf4Dmp0v1j6A":{"text":"Great food and service with a family-owned restaurant feel. Our party of six all enjoyed o","useful":0,"cool":0},"vkEr7Kb62v_taU34su5vog":{"text":"Horrible experience. Poor taste food, freezing cold AC which the manager said is necessary","useful":1,"cool":0},"O8jzVKWes0ckPJF5vTQO1A":{"text":"This place is legendary in my family.  My parents came here in the 60s (they have very dif","useful":3,"cool":1},"WsfNXHpBAi-QXjxkPN5dGw":{"text":"Mike is our waiter and Thomas W Stewart (sp?!?) shucked our oysters ... amazing !!!!  Kern","useful":2,"cool":0},"jjV30IuS93xb5IStIcr0HQ":{"text":"This restaurant was recommended by a local driver. So I decided to give it a shot. After b","useful":5,"cool":0},"I3s5i5LftBOtYE-KvHwUPw":{"text":"Hands down THE BEST shrimp I have ever had in my life!!! The biggest too! You will not be ","useful":0,"cool":0},"2_Tc4uCdZgDwONGyJlW8Dw":{"text":"The food here was great, with so many food options! We were visiting from Chicago and came","useful":1,"cool":1},"HAbbq9NqGj0iHEy208X3eg":{"text":"My wife and I were staying in Uptown on our recent visit to New Orleans and we just had to","useful":1,"cool":2},"5Y07AkLdQgzQL5NeyAZzeQ":{"text":"This is a New Orleans landmark and it doesn't get any better than this place. A family own","useful":2,"cool":2},"Cg2ASKenBAkngBWurJHq2Q":{"text":"One of my biggest disappointments in a famed New Orleans restaurant that is definitely liv","useful":9,"cool":1},"TZFukUEu1hxL-7tYWcMd2A":{"text":"Did I just eat at the same restaurant others are reviewing?? This place was horrible. When","useful":0,"cool":1},"ZYslGe-Be37M6GfnidZf4Q":{"text":"This was truly the best part of being in New Orleans. Just coming in casually for happy ho","useful":0,"cool":0},"Bp9zKAnb1XhsuOlhy7p8nQ":{"text":"Excellent food and service at a reasonable price!  \n\nHave to have the shucked oysters in t","useful":1,"cool":0},"Ao-wXLQaDvjYvDLjD2n4hA":{"text":"Dinner was so so so good. Cain was our waiter and he was hilarious. He knew everything abo","useful":2,"cool":1},"UpmTsXduY2Huo1ZXgfyljg":{"text":"I'm so glad we took up our friends' invitation to join them for lunch. I'm still thinking ","useful":0,"cool":1},"utduOz4c9Arp24rMmX5x4g":{"text":"Dined at Pascal's for a work dinner on a Tuesday night...food and service was fantastic. O","useful":0,"cool":0},"berPmf09uPndmSUfEFCA3Q":{"text":"It's been a number of years since we had dinner at Pascal's Manale. \n\nWe saw some less tha","useful":0,"cool":0},"r-LxhZlA68NEaFgnPZTWnw":{"text":"I think I pissed butter after this meal.  But oh God, was it worth it.\n\nThe friggin amazin","useful":2,"cool":1},"wmR-reE21t9CP6BKal-vXA":{"text":"Our group of four sought out Pascal's on a Friday night on a whim to locate the happy hour","useful":1,"cool":0},"0ZphL-6qk9ET0E_PdVBRCw":{"text":"This is the restaurant that boasts all the stars of yesteryears.  The real treat is when t","useful":1,"cool":1},"d2YBeZ3H9UmG6UbWo5LFtQ":{"text":"Went there pre covid. Wildly expensive, but the oysters and steak are delicious. Would not","useful":0,"cool":0},"5GqkiV9-GQP6cAVC3aU3sw":{"text":"I've been to New Orleans several times and have eaten at many different restaurants from t","useful":1,"cool":1},"qcwVOKZLMkYwysjj-wY7-Q":{"text":"I've been coming here all of my life. It has been fantastic. I came here this evening for ","useful":0,"cool":0},"0TLyEgctjoR5Pzrk5dMNsA":{"text":"We have been coming here for years and unfortunately will never return. \n\nAll I will say i","useful":0,"cool":0},"b5difTF5KbCOJlwGTYFSuA":{"text":"Came here to try the food. To be completely honest, it was not well flavored. Might have j","useful":1,"cool":0},"6lFng0PZAe1sNpEUcD045A":{"text":"Been here 103 years. It has an old school feel. You walk in the door to an oyster station,","useful":1,"cool":1},"C3Sgs6VznuwCRxsAmXggcw":{"text":"I eat here nearly every time I come to town. Great old school oyster bar in back and great","useful":2,"cool":2},"z3_DgLISvlBNypNKDQrHXQ":{"text":"This is a great restaurant... if you are the right skin color. People of color, do not go ","useful":1,"cool":0},"8Az5fTP6YBJABkAx4I81Eg":{"text":"I think this place might be for older white people. The food is bland and not particularly","useful":1,"cool":1},"iEiURCwyNwILor8WWgkcSg":{"text":"This was a very memorable meal. The restaurant is a little off the beaten path, in the bea","useful":3,"cool":0},"Rd_n29Mh_XKMBHWDtcEwoA":{"text":"There are too many good places in NO to go here. The hostess is rude. I am not the only on","useful":3,"cool":0},"9B0UeC9aDjJaqDxan0VpQA":{"text":"I was highly recommended this place in a few different spots...I'm just frankly baffled. I","useful":3,"cool":0},"Q1ZvxK6Gs3WduJdkbh6h-Q":{"text":"When I lived in New Orleans I had heard of Pascal's Manale but thought it was one of those","useful":0,"cool":0},"RE741O4iYtb8vX31thy6dA":{"text":"Such a hidden gem!! When you walk into this Pascal's you're inside a casual bar but when y","useful":1,"cool":0},"W7ex7aP4yxWrK-8bp8IJsw":{"text":"I write this review still upset about my family's short experience at this restaurant. As ","useful":0,"cool":0},"Ywz6ahwTZ7NWvvugOSAOHg":{"text":"What a great dinner I've had here at Pascals. Everything we ordered was delicious! The BBQ","useful":1,"cool":1},"9VN1YaG68mTwh-C9ulTT7g":{"text":"What a gem of a spot, and conveniently located steps from our AirBnb. After a long day at ","useful":2,"cool":1},"crfuD5qnIVzvfp38V0EKRQ":{"text":"Ooooh Coolinary! As soon as I saw Pascal's on the Coolinary list I knew that I had to fina","useful":9,"cool":6},"64GzO-VsSLk_6sYz0YW5OQ":{"text":"So apparently Pascal's Manale is famous for their \"Original Pascal's BBQ Shrimp.\" I was so","useful":4,"cool":7},"2EqJ0FIIzItaiBEG380J8w":{"text":"Ohhhhmygawdddddd. Best. Oysters. Ever. I came in during a visit to NOLA off a random recom","useful":4,"cool":4},"XME2OIFG3KFHFm4QrbrVCA":{"text":"\"Pascal Manale's\", the name we grew up thinking was official, sits on a shady oak-lined co","useful":7,"cool":0},"JUAPJJmfCXK1uA5YyiW5XQ":{"text":"This place is clearly a New Orleans staple and the type of place that has loyal regulars c","useful":7,"cool":7},"1Mymrh4ZlR_BNOHSv9WHrw":{"text":"We have been to New Orleans enough that I feel like we have a good handle on where to get ","useful":3,"cool":3},"pIMlFPQu7jehRdCDUHnyGQ":{"text":"Ok, so since I consider myself more than just your average tourist in New Orleans, I am a ","useful":5,"cool":3},"Od0gRL826ObhO08sjl8q6Q":{"text":"Came here for dinner and tried a good amount of the food amongst our group! The veal picca","useful":1,"cool":0},"N9_ZXiIpK_k4Td4LIcKoDA":{"text":"After a 45 minute wait for our reservation, my party of five had a very disappointing dini","useful":2,"cool":0},"UyaPjM_mPQEMkUmbPZnnBg":{"text":"This was the highlight of my NOLA business trip...do not I repeat do not fall for other BB","useful":2,"cool":1}}