{"urxaJ48N2luF4uH9b3jMUQ":{"text":"In town for just a couple days, and signed up for the two week pass as it was cost effecti","useful":1,"cool":1},"iUZ9uJNOwFVJR4QAQIIXhw":{"text":"This studio is fantastic! I'd done some hot yoga before but never Bikram and I was definit","useful":1,"cool":1},"6nkt1zWX3ZwQEE77LbCBqw":{"text":"First time doing hot yoga and it was AWESOME! The teachers were so nice and their instruct","useful":1,"cool":0},"Gj2zuauqJe0FwiC0ZQUdDg":{"text":"I love this Yoga studio!!! The vibe is awesome, the space is awesome, the teachers and com","useful":1,"cool":0},"5srRjm3fCnXo4Ai3BIGbUg":{"text":"Beautiful space in cute neighborhood. I took a bikrham class from Mike and loved it. I wil","useful":0,"cool":0},"Rvqb5osMEoR_OKsZSSveyg":{"text":"Recently I visited New Orleans and got a chance to take classes at Yes Yoga. I'll say one ","useful":2,"cool":0},"4wI3yyZjzsM0j650ecYHPA":{"text":"Love this studio. It's a beautiful, comfortable, welcoming space, and the teachers are fan","useful":0,"cool":0},"CjiknD9ufRQXnFkKDqjfhQ":{"text":"I have been going to Yes Yoga for almost 3 months this year and I love it! The professiona","useful":0,"cool":0},"I-A3XI8ZXsYzfvbu6bCaYg":{"text":"Came to New Orleans to escape Miami during hurricane Irma. I was looking for a Bikram styl","useful":0,"cool":2},"0in822O8H0fo_0yE9wwAzg":{"text":"This place is great. And convenient to many of the (only) great places to go uptown. Yin i","useful":0,"cool":0},"Q4gnbTBBATV8SFjNShpvkA":{"text":"if you are searching for a hardcore traditional bikram studio this is not it.  They offer ","useful":2,"cool":0},"He0lUddCtv1rMdfAEquzAg":{"text":"The studio ambience has really improved since they removed the carpet. The room no longer ","useful":0,"cool":0},"DWdwK9e9hhiHOR5qfBZQXw":{"text":"I highly recommend this studio for hot yoga! The teachers are very friendly and they have ","useful":0,"cool":0},"nC6Jn6nTL-0ONF0gvesk9w":{"text":"I regularly do tennis, soccer, running and biking.....and the HOT yoga effectively killed ","useful":0,"cool":1},"KJGvpUHkY3eiHZLotRiMLA":{"text":"Admitedly, I have been dragging my feet when it comes to writing this review. I wanted my ","useful":3,"cool":0},"QLW5OQkOLcGaf7b0_NGZ5g":{"text":"Great space and great instructors! I didn't know that I could finish a 90 minute hot yoga ","useful":0,"cool":0},"yjtKpv4XYwLWr2yBY-k4TQ":{"text":"Though \"elite,\" I will not be able to properly describe the experience in words. This is a","useful":3,"cool":2},"P5uAyfnvk8QxeJddzwdH4Q":{"text":"Best instructors, beautiful studio. I have been a member for the last few years and apprec","useful":1,"cool":0}}