{"vLUrFT61fUn7UI6kF5wmFA":{"text":"This was one of the worst experiences I had  with a Mandarin Express. The fried rice was b","useful":0,"cool":0},"cByxDY9WoiM54Pn-cTr2BQ":{"text":"This makes Panda Express look like a five star authentic Chinese restaurant. The dominant ","useful":0,"cool":0},"IRp-NYYDF2kFBCqZoIWy_w":{"text":"First off the lady attending the front has no customer service experience, she doesn't eve","useful":0,"cool":0},"5ljKlXCKpDA5w3y5Hf7G5w":{"text":"Horrible horrible place!! Greasy food, leftovers, and more importantly COLD, very unimpres","useful":0,"cool":0},"YaE_WiJgkN564TbHD25POA":{"text":"Normally, the Mandarin express is a reliable and edible chain when you are in a hurry.  I ","useful":0,"cool":0},"-50lWWd64b9e35JicXcNhQ":{"text":"The manager here is completely stingy and rude. I didn't want rice, he gave me vegetables ","useful":0,"cool":0},"V5pL1uLcCejr9bol048nuA":{"text":"By far worst service I have had in New Orleans! Food was cold rice was soggy! Bad! Do not ","useful":0,"cool":0},"UnJXp5CrCvyNU9AxC1RDzA":{"text":"This is by far the worst Chinese fast food I've ever tried in the states. We ordered a 3-e","useful":0,"cool":0},"guM6Hm5cdUpDdG2BWWH25w":{"text":"Food was ok\nCashier always on the phone ignoring the customers while scratching her head o","useful":0,"cool":0},"q6nDl8RjVESNH0EpFm6vWA":{"text":"Ok service. But the noodles were very very soggy. Do not recommend. This makes my Chinese ","useful":0,"cool":0},"EESVZFpXRwCh8C5I_89H2g":{"text":"Only two menu options - a two item combo or a three item combo. We ordered sesame chicken ","useful":0,"cool":0},"R1g4NrsRkckLAFVj-JvPYQ":{"text":"Average food for a fast food Chinese place. The orange chicken had much more breading than","useful":1,"cool":1},"gYur_HqrmSbxjIZfd9xe0A":{"text":"The employees there told me that they weren't open till 10:30...when I know they're open a","useful":0,"cool":0},"GWPn4pnKxVw1TrqyrXJDAA":{"text":"This is the 4th time i ordered from them,and got absolutely no satisfactory. I figured if ","useful":0,"cool":0},"0SU1q_o7fDc7_VhPRbDfGg":{"text":"BY FAR, THE BEST CHINESE FOOD IN NEW ORLEANS!\nBut then all Chinese here sucks** (ever sinc","useful":2,"cool":1},"X9JzrZFh1qSQ_AJS87sTmw":{"text":"Mandarin Express , 500 Riverwalk, next door to Harsh's Casino, end of Canal Street. Ordere","useful":0,"cool":0},"005uu4zkqrACRQKMzDrYuQ":{"text":"Out of white rice.  A Chinese place.  That is out or white rice.  It's quite incomprehensi","useful":0,"cool":0},"cnM-1O-aTFezaA4NJuQFXg":{"text":"Food was decent but the service here sucks. A smile or a hello goes a long way. Most place","useful":1,"cool":0},"tzkZ2NC56hqK3wIFBLHEHw":{"text":"I wish it was possible to give zero stars. Because this place doesn't even deserve a 1 sta","useful":0,"cool":0}}