{"NXshoIIG1Uy1_Jr0skPXVg":{"text":"not good for large groups.  very hot in the breakfast area.  rooms are very small.  i'm ve","useful":1,"cool":0},"Z0trO3O8UWlhU138E8Tvsg":{"text":"We got to the hotel pretty late around midnight. When we get into our room the toilet is e","useful":1,"cool":0},"2rLzHXfXRyUEdyZPWokUsQ":{"text":"The front desk and housekeeping staff are very nice. Front desk gentleman, Elliot is very ","useful":1,"cool":0},"fT_hhxwWiLk-tAUfoJUCYA":{"text":"I can't imagine why the other reviews aren't great here. Impeccably clean, modern rooms an","useful":0,"cool":0},"jL8LxHYpTOXNbdFYCujBPg":{"text":"This place has consistently confused me. For starters, I was trying to brush my teeth but ","useful":2,"cool":0},"kWpGoVkzTBPUu60W2YK5hw":{"text":"Pretty average hotel. The customer service is excellent. The staff was really helpful. The","useful":1,"cool":0},"nhHVDdz-_KdLBtpDTpK1kw":{"text":"Caesar is the most rude attendant/ desk person I have ever encountered- he had guests wait","useful":0,"cool":0},"WhngZ9B_puCBmgLsLrgT1Q":{"text":"Loved this place. Very CLEAN, breakfast was decent and most of the staff were fantastic. D","useful":0,"cool":0},"LfOJD6BgCRlvTOrrSlzGUA":{"text":"We stayed in the executive sweet which was roomy.  This place has been updated and is conv","useful":0,"cool":0},"cPTRyMFQQSRlZyQEVVIzZQ":{"text":"I was here for 4 nights and this hotel is definitely a great place to stay! The staff was ","useful":1,"cool":0},"k_Jd-1YLNy38SQjQppeYug":{"text":"Another great stay at this hotel. My girlfriends and I had the pleasure of staying here tw","useful":0,"cool":0},"c6QY8NxIlmM7tYPwlY-_og":{"text":"Hotel was nice but customer service could be better. There was a lady working at night tha","useful":1,"cool":0},"RH_4OgGoTWcjVYZhNbY-BA":{"text":"1. Great Hotel to stay at it has been completely remodel ( but I wouldn't stay here again ","useful":0,"cool":0},"EhCGrBR8IKGRrpb6hNYZiQ":{"text":"WORST PROPERTY! DO NOT WASTE YOUR MONEY, unless you want the run around by this incompeten","useful":2,"cool":0},"7qkQMceCOt6LS9h1986log":{"text":"If I could  rate this a zero I would. Please DO NOT stay at this hotel. Very poor manageme","useful":1,"cool":0},"x8YmiLygeiP75vp_BVi7QQ":{"text":"Rooms are dirty. My original room had urine on the toilet still, makeup in the sink, hair ","useful":0,"cool":0},"B7a4v5boeKMrpC124BrsJw":{"text":"Worst experience ever with billing issues. My husband booked the room with a credit card, ","useful":0,"cool":0},"CPLBP8IiWdXaU72MOCkjsQ":{"text":"We enjoyed our stay here! It is clean, safe and well lit. The staff was so incredibly frie","useful":1,"cool":0},"0PEB5RiKJJsG3X7IDq8Hkg":{"text":"We were very pleased with employees Elliot Ferran and Jasmine at the front desk. They were","useful":1,"cool":0},"m5sZgFO-zghFrtGTeGAKVA":{"text":"There are bed bugs in this hotel! Not only that, but the sheets were not changed.\nSpoke to","useful":4,"cool":0},"3YYBP4cWJ9cEFr-ZZ_UVqQ":{"text":"The good: The room was clean, stocked with plenty of towels and other necessities. Staff w","useful":1,"cool":0},"FWS_temt5ZsAEF1QrH_Bkg":{"text":"Didn't like this hotel. I normally love holiday Inn express. There are no stairs and the e","useful":1,"cool":0},"1Srf0QuokDklDsTXGfj-Fw":{"text":"I don't like leaving negative reviews, but I would be remiss to not talk about my experien","useful":2,"cool":0},"-2aitHZlR8IWC0hmr1W8hA":{"text":"PERFECT LOCATION! \n\nThis place is affordable and you can walk to Canal st in about 7 minut","useful":0,"cool":0},"gh_m3MhbPWCUXibbDmmIlw":{"text":"This was an unfortunate experience. My husband works hard so we can have these fun weekend","useful":0,"cool":0},"wUjSjOY5pNS9FprC6Yw9iQ":{"text":"Although it is a clean and neat place, the service is bad. The lady at the front desk was ","useful":1,"cool":0},"462rIZ49uSzA9M4bvyW0_w":{"text":"I don't know why this has such negative reviews. My stay here was really pleasant. The peo","useful":0,"cool":0},"ZdIcf0oXdHB5tKCFUarXgg":{"text":"This hotel is hands down one of the worst hotels I have ever stayed at!!!! Management was ","useful":1,"cool":1},"wCGRPElYrYxn9Ls1yZFQNA":{"text":"The Holiday Inn Express New Orleans Downtown on O'Keefe St is the precise example of \"just","useful":3,"cool":1},"XJKOk099vLoNkPXNQ4UEPQ":{"text":"No keys could be made at check in and for 24 hours after. Had to be escorted by a security","useful":1,"cool":0},"GiPNsEbQAbewkMp8qrSNWw":{"text":"Very upset because they did not have access to stairs and I am deathly afraid of elevators","useful":0,"cool":0},"d-e7KolftNV69HP9QY0bnA":{"text":"We had the WORST experience with the staff. We were woken up in the middle of the night an","useful":0,"cool":0},"0IloW6veSY-wPjZXKK_yQQ":{"text":"I stayed here for my 3rd visit to New Orleans. While during my stay the staff were nice an","useful":0,"cool":0},"Jhkizms7ZiW7pe4pt9pXOw":{"text":"The only reason they deserve 2 stars instead of 1 is due in part of the person that handle","useful":0,"cool":0},"VXlxu452B9Bc4rgKvdKJmw":{"text":"zero stars!!!!\nWhitney the front desk girl is nice!\nAmy the manager is useless....we had e","useful":0,"cool":0},"6OZw71AYRtgcyKT7LXYQow":{"text":"Convenient location to stay at!   Close to the trolley cars, Bourbon Street, & Frenchmen S","useful":0,"cool":0},"B0DgeQ96_DUfcSFFCXmY-g":{"text":"Stayed here several times before and though it wasn't anything to write home about, I alwa","useful":0,"cool":0},"6zeMy-rM1AM4Cqzx6gSFwA":{"text":"The staff is extremely rude at this hotel. It's an inconvenience to ask a question. It's d","useful":0,"cool":0},"rSKaaLuq0CfrT8ZXen5muQ":{"text":"We arrived two hours before check in and was able to get our room. Service was given with ","useful":1,"cool":0},"DxheQN_cHpz-Rd5PhJRfzw":{"text":"BED BUG problem. Your worst nightmare could be when staying in a hotel! \n\nMy wife and I wo","useful":6,"cool":0},"j7youQkoQzn2ZaVtYQ2k5g":{"text":"Awful service!!! Our shower DOES NOT work!!! You would think at $800+  for two nights we w","useful":0,"cool":0},"LmbOPpw8kuOPTMNkQzBQ7A":{"text":"This Holiday Inn Express is located downtown NOLA and it is a good location if you are loo","useful":1,"cool":0},"JztuKqC_YsDMITdqwFSyrA":{"text":"Great location.   Walking distance to bourbon street.   Affordable rates.   Have to pay 27","useful":1,"cool":0},"y667YoI4Ic1Jbeb8Hm6MXA":{"text":"The next morning, the husband asked his wife to come back to the hotel so they could talk.","useful":0,"cool":0},"Tgs85cU3K52CXWtG_bzVdw":{"text":"Checked in right away, great location, nice clean sized room,  with a pretty comfy bed\nFri","useful":0,"cool":0},"psingf-OjxxKhwEZMYfXIg":{"text":"I have never written a review. But, our experience with this hotel was rough. The rooms ar","useful":0,"cool":0},"LA5KkLf43QL1kuHuo9nUZg":{"text":"We stayed at this Holiday Inn Express overnight from Saturday to Sunday. To start our expe","useful":4,"cool":0},"Khh_2gmdmu1LH-A87T72EA":{"text":"Let me start by saying the place served it's purpose - we had a bed and a bathroom in down","useful":1,"cool":0},"emtZuAVqbwC2gaj4jzf7Sw":{"text":"Very unimpressed. Their's also a $28 parking fee to park in the lot which I found very sne","useful":0,"cool":0},"e77Jd4PSzdXCRNfNegFSuw":{"text":"I've definitely had better experiences staying at other hotels, and I think this may be th","useful":3,"cool":0},"avXCkPZyh6DQLLQGwzVb0A":{"text":"I always enjoy HIE.  Clean rooms, friendly staff, & decent amenities.  Things are certainl","useful":1,"cool":0},"8oe7_q9aN0cDjOHXuTyDVw":{"text":"photos do not lie! if you dont believe my comments are accurate, simply read all the other","useful":3,"cool":0},"nShU0APKEeifK9zTRpkRMA":{"text":"Dirty and over priced. First, sheets had what i assumed to be coffee stains. I asked for t","useful":3,"cool":1},"uk8LfSO6GOM6Tup9H_NCKA":{"text":"This is the crappiest hotel in New Orleans! I had two necklaces stolen from my room. I had","useful":2,"cool":0},"_V52R8Hc8Re7fuG0yL3-8g":{"text":"I would give no stars if it were possible. We arrived at the property at ~11 and we knew w","useful":0,"cool":0},"9RGsBgyRBvEEYZErNKFS7g":{"text":"A.P. Null, or whatever your name is, these are Absolutely the pics from that terrible mote","useful":1,"cool":1},"V7r7-JdGSDe6AxYQ-qWXNg":{"text":"Worst hotel ever!!! If we could give NO stars we would! No amenities in a room thats being","useful":2,"cool":1},"kPlDpaHaCD517migUHKvIA":{"text":"Small rooms and the sliding bathroom doors don't close all the way (and don't block sound ","useful":5,"cool":3},"SuXQTyY3ym65z6CCkG7JtQ":{"text":"I don't understand the bad reviews here.  Easy check in. Clean, mostly quiet room with fri","useful":1,"cool":1},"z8FOsK4ytO3rfhFHoRD1ng":{"text":"Awful, my Aunt came to visit my mom and I, she made reservations but when we got there las","useful":3,"cool":1},"JLFHXTZsi9DpLhhMNlnsZA":{"text":"Do not trust them with your credit card information. My credit card was fraudulently used ","useful":1,"cool":0},"HULCrq2Sy3Eot7JOwrNmVw":{"text":"Not sure if this is the vibe they're going for, but this hotel is reminiscent of a shabby ","useful":2,"cool":0},"xHDTqP5c36XmqQrYx_DRXg":{"text":"RIPOFF!! They charged me for parking in their lot, which I actually parked across the stre","useful":1,"cool":0},"DYtVck47l7J23xVzCiGNnA":{"text":"Do yourself a favor and stay somewhere else! I wish I had thought to check reviews before ","useful":5,"cool":2},"kXpgZ_96Jx0CR-X6fIOoog":{"text":"This has got to be the worst hotel I've stayed in. I waited in line behind one person to c","useful":2,"cool":0},"qXh78vP3QSwUPPuOYPvH0A":{"text":"Honestly, the absolute best thing about this hotel was that it's walking distance to the F","useful":1,"cool":1},"3WQ5TOqAfRbfLi1J6AmIOA":{"text":"Worst hotel experience EVER! I will never stay here ever again! The staff were some of the","useful":0,"cool":0},"jeoYolYONCk5vk3ihwZ-kg":{"text":"Smallest rooms ever! Mildew on sink. Last occupants hair in bathroom. Air went out. Housek","useful":3,"cool":1},"K6zINLdee6c9uYJFE3s4hw":{"text":"If I could leave no stars I would! Two words bed bugs! Thankful they didn't see them until","useful":0,"cool":0},"09lBPovOK0ip7EHAeOTQRg":{"text":"The hotel was overpriced. I'm sure it's because of the hotel industry trying to recoup the","useful":0,"cool":0},"nWofeiR_74okzGXN8CHDRQ":{"text":"I'm fairly certain this hotel JUST reopened under Holiday Inn Express management. Or at le","useful":2,"cool":0}}