{"xNWcGS0M0kljAriaGCA2bw":{"text":"Had a private CC lesson with David Newman, who is an excellent instructor providing techni","useful":0,"cool":0},"0HaQHJFO11wDt18SSsjEaA":{"text":"I cannot recommend David Newman's concealed carry class more highly.  He's a gifted natura","useful":0,"cool":1},"X0zvgcP5RKDg0zbiAL4raw":{"text":"I took the Concealed Carry course with David Newman. Dave's knowledge and expertise is sec","useful":0,"cool":0},"_07OFuKmzm_kxiS8JTbktg":{"text":"Dave and his company Concealed Carry NOLA was absolutely wonderful! I would highly recomme","useful":1,"cool":0},"mieMsryR83RrOUUedn8mmg":{"text":"As a new resident to Louisiana and having a concealed permit from another state, I wanted ","useful":1,"cool":0},"HOf2LAMx1U2sXzkPqU0wxg":{"text":"I strongly recommend Concealed Carry NOLA and David Newman concerning the Louisiana Concea","useful":1,"cool":0},"6JHLrX9r_GXl-UYyLu2bdA":{"text":"Another student who was renewing their permit explained to me towards the end of class tha","useful":1,"cool":0},"Ly6tvLByozJStKjKSBm7nQ":{"text":"David is very knowledgeable. No matter what question you asked, he'll respond to it. I am ","useful":0,"cool":0},"ck3AaiJOp54_agU6Ua-WeQ":{"text":"I had the great pleasure of attending Mr. David Newman's Concealed Carry NOLA Class and th","useful":0,"cool":0},"yTTunzv2JxM8O3-m-dXviQ":{"text":"This was the second time I've taken a CC class. The first one was with another instructor.","useful":0,"cool":0},"vh2Fb-mnrwNLTZ9noqaakg":{"text":"This class is ideal for anyone and everyone planning to apply for a concealed carry permit","useful":0,"cool":0},"EI1I21GjjsSt6PjfOls1-w":{"text":"My husband and I were interested in learning more about personal protection and the possib","useful":0,"cool":0},"e2Q3RxVLpEmxGTkT1QaU4w":{"text":"Great class! Dave was very informative especially about the laws. I took a training class ","useful":0,"cool":0},"76nsUW2ZqP8UIRbNrHDlJA":{"text":"Mr. David Newman is great. I'd only been to a shooting range once or twice in my life, so ","useful":6,"cool":2},"oj31BlbZH0Fb10Q8qrs3Xg":{"text":"This is a great class. Very informative and knowledgeable. I would definitely take more cl","useful":0,"cool":0},"TeSimAB_A0neqPNzRCtGjA":{"text":"Dave is an extremely knowledgeable instructor. I've taken the CC class in another state, a","useful":0,"cool":0},"GVKvLOLqZ8-JAVWWYmoW8Q":{"text":"Mr. Newman class was excellent. I went in nervous and very new to gun ownership and came o","useful":0,"cool":0}}