{"QEkyAdsrVo7tEsANDN7O9g":{"text":"Missed Marvin this time around. Really enjoyed the chocolate shake. Went later in the day ","useful":1,"cool":0},"kIViMGM4JTHHozAE1r9boA":{"text":"best breakfast ive had in a very long time. ive been very disappointed with breakfast, may","useful":0,"cool":0},"LpHt30LaQHAtBs-j_EYUUw":{"text":"I recently visited the new French Quarter location and enjoyed it as much as the Carrollto","useful":1,"cool":0},"WqCjrz_fV-n6y_nDxme2lA":{"text":"This is one of my favorite places anywhere! If I was told I would have to eat at Camillia ","useful":1,"cool":2},"J8kc5pwyAtpl1Wm91RopYQ":{"text":"A total disappointment. Long time New Orleanians will recall the spotless venue, professio","useful":0,"cool":0},"Eb8qupWiFGi_OU-E-NbB1A":{"text":"As far as diners go, you just don't get much better than this. Worth the wait, great staff","useful":0,"cool":0},"qeRvtq8AcZATC-BE8tChFg":{"text":"This place was great food and entertainment all in one. Our waiter Ronald was so fun. My f","useful":0,"cool":0},"kgBV2kR1LQ-LQqpI71qHxQ":{"text":"One of my co workers brother recommended this place to us and it was absolutely amazing.\n\n","useful":1,"cool":0},"mTvtpfqo-h0FRwId5ByRYg":{"text":"Went in for breakfast. The food was fine. The service from the server was awful. The cook ","useful":2,"cool":0},"R6fuc7koJeRn5K_a-U4gmA":{"text":"A highlight of our trip to NO. Amazingly friendly staff (Brun made us feel like family imm","useful":0,"cool":0},"GmP59dlSHgHPm7Pzj_6FrA":{"text":"Terrific hamburgers and pecan pie. Great service and atmosphere for a reasonable price. We","useful":1,"cool":0},"VZ0BKNuFgIdDphAh-vWqbg":{"text":"Camellia grill. Easy enough review. This place is not going to wow you with extravagance o","useful":0,"cool":1},"_Fv2XpeQdNWnSasvOvVohw":{"text":"Always one of our favorite stops when in NOLA. The wait is worth it, and yes there is alwa","useful":0,"cool":0},"Y5SlkD5reibzJDb8kbCpJA":{"text":"The Camellia Grill was fantastic! Went there when I was craving breakfast food kind of lat","useful":0,"cool":0},"HTGF-bz7vhhA6sQp3NG-kA":{"text":"Great place and a true original little gem. I love the service when in Nola I always make ","useful":0,"cool":0},"eIDLQtaLnyRqVgEQNsUB5A":{"text":"My group took the Streetcar down and had lunch here. What a great place. It's a diner. We ","useful":0,"cool":0},"wST7t24pSfbetzRvm6mx7A":{"text":"Breakfast was well worth it. And yes the servers were hilariois. If I had to give a negati","useful":0,"cool":0},"2BCg5wJWo5GZ3XeCL0bEtA":{"text":"Great old diner!! Great atmosphere and friendly service. Typical dinner food which comes u","useful":0,"cool":0},"Ik3uMbfMqeqpD-xNy25RbA":{"text":"I love the double U-shape seating arrangement when you first walk in because it's like the","useful":0,"cool":0},"Bfy3GZYgvRaDmwkamb0J5Q":{"text":"Don't judge this book by its cover! And definitely get the Southern food menu items (versu","useful":0,"cool":0},"Tmg23-TKzaI8RrGz4pVmAA":{"text":"The staff is attentive and a little abrupt, but that's just part of the experience at Came","useful":0,"cool":0},"hpc9hWgqWl-Mx5Pwb6On1A":{"text":"I never understood what \"light and fluffy\" eggs were until I ate here. Apparently they put","useful":4,"cool":0},"peC35r9sMcjX0dvCpgQv-g":{"text":"Great diner experience. The french fry omelette was.... interesting. This place isn't the ","useful":0,"cool":0},"tMESSwaI19TSjN-9N5NBkg":{"text":"Just went there for the first time in 40 years. The food was great and the freezes wonderf","useful":0,"cool":0},"GqoV3TutjHp5gwyIOl7JBQ":{"text":"I live a few blocks away from this place... if I wake up early enough and can get there be","useful":3,"cool":3},"Qxq2aXH9GkMz7-Zg5RGFvQ":{"text":"Great prices, great food, great service. Went back twice for breakfast! Had awesome conver","useful":0,"cool":0},"gk-fmydqtLbdLTs1lP-4LQ":{"text":"Well...this is my 50th review on Yelp. And I wouldn't have wanted it to be with any other ","useful":1,"cool":1},"rRu0SYqrdMtNRcEr58mo8A":{"text":"3.75 stars.  There are two locations for the Camellia Grill, but this is the one you want ","useful":5,"cool":5},"01wCYhk_jE8A0rn4qpMUFg":{"text":"Had a few recommendations for Camellia Grill, but it was extremely disappointing. Went for","useful":1,"cool":0},"62iVPi8xtjVFnikl1cIGHw":{"text":"This little diner is a must stop if you are on the Saint Charles Streetcar line.  It is no","useful":0,"cool":0},"E5UGKeeiEtavgPCmL-2nug":{"text":"My daughter just graduated from Tulane so we are going to have to figure out excuses to ge","useful":2,"cool":0},"H-E3xTCrLs_CWSBAIQzogg":{"text":"Love it.  Second trip to New Orleans and sad cuz the French quarter location is closed but","useful":0,"cool":0},"mA0LgVmjsmnAB4BjZN7cbw":{"text":"I always have a good meal here. But the atmosphere is what takes this place to another lev","useful":0,"cool":0},"AJFnrxYzRLC2WPTDUq9tqw":{"text":"Authentic diner experience.  Walking into the restaurant takes you back a few decades.  I ","useful":0,"cool":0},"DvXb2pjnoqjk33G13lit3A":{"text":"You go to Camellia Grill for the experience, the fist-bumping camaraderie and manic enthus","useful":0,"cool":0},"BR9HR8VFjeO5YhOiCW3haw":{"text":"Best cure for a hangover! Classic-greasy-Cheeseburger and omelette are just the best in to","useful":0,"cool":0},"g9MZgYN7npremIiZwp_RtA":{"text":"Finally made it to Camellias grill! We ordered the bacon cheeseburger and chocolate freeze","useful":0,"cool":0},"33kfuGDwKIKldh3xal7_DA":{"text":"Coming here felt like coming home - except better because my mom doesn't cook this well.  ","useful":0,"cool":0},"CAZ61PTLoaEAVJCUjSh-DQ":{"text":"We dropped off our son the in the Loyola University area this week and stumbled upon this ","useful":0,"cool":1},"qopUkiBtOT8neBh_WyRmgQ":{"text":"This was my favourite place to eat during the whole of our trip to NOLA.  I loved it! \n\nCo","useful":0,"cool":0},"Y7LEN_iS_DcEWmF61rt6Gw":{"text":"Friendly staff, great food and fair prices make this a wonderful place to eat.  The breakf","useful":0,"cool":0},"jc3WFP2rcj67ij9LJUKAgw":{"text":"This place was recommended by a former NOLA resident. Definitely didn't disappoint. Basica","useful":0,"cool":0},"Sn1YRL_kFHmJLdgGwuNqdw":{"text":"I can't say enough about this place. I walked in one day, with a need for waffles AND a pa","useful":0,"cool":0},"tTaLpr-l3PFfc3wxqIOK_Q":{"text":"We went for a late breakfast, on our last day in town, and absolutely loved it!!!  Great v","useful":0,"cool":0},"bQJ_ffhy-e5vD77O5Hf_vg":{"text":"This is exactly what a muffuletta is supposed to be. Cooked to perfection in front of you ","useful":0,"cool":0},"pPwyaM4a67-aQj9GcpaMlg":{"text":"Right on the St. Charles Streetcar Line, this place is a GEM!\n\nThe building is fronted by ","useful":0,"cool":1},"8gc020V6lV65jAFrQwcSkg":{"text":"Saying this place is a New Orleans institution is an understatement. My mom and dad used t","useful":0,"cool":0},"TRnFEM5w-m-yWTggX7AJNQ":{"text":"Loved our stop in here for Memorial Day breakfast. Tasty food, friendly folks, great servi","useful":0,"cool":0},"NqrP6KFPRdKaAtDhrienLg":{"text":"Classic greasy spoon, New Orleans-style.  Small, pink, crowded, noisy, and utterly delicio","useful":0,"cool":0},"IoXIrvqJ59QjlRfHtsLL9w":{"text":"This place has the best classic diner feel! The staff was awesome and they treat you as if","useful":2,"cool":0},"7c41AHNEAT3UpHf4zceKZQ":{"text":"Fantastic food, service was great and the atmosphere is wonderful with an old school vibe.","useful":0,"cool":0},"XjilMpCNtewYeuJLDMrzBQ":{"text":"Great meal at reasonable prices. The burgers are great and the hash browns are even better","useful":0,"cool":0},"hs0tBVuKiOEcm622WYK_0A":{"text":"Very nice place that is always crowded. Food is ok but it's the service that makes it a pl","useful":2,"cool":0},"auiJMJFPL9ta32u9pO8wHw":{"text":"One of my favorite spots in New Orleans. The burger and the Red Beans are both delicious, ","useful":0,"cool":0},"EODALgk8nMPdpsQPE9bsPQ":{"text":"Great food. Great service. Worth the wait!!  NOLA classic. Grab you some breakfast at the ","useful":0,"cool":0},"G5YO5dajporLG8nYWw2gDA":{"text":"2/3/12\nWe ate there on friday morning almost as they open for the day.  We didnt know ther","useful":0,"cool":0},"z6RWPrj4of5XoQKzeQKbDw":{"text":"This Uptown/Carrollton tradition is still hopping after over 60 years in business. Camilla","useful":1,"cool":0},"9Vp7XVBA49TQpuE5jna_oQ":{"text":"A diner that doesn't open until 8am? Not good. Not good at all. That said, it's a great pl","useful":0,"cool":0},"4PKQCo6MbPFqgqGpZ34i5Q":{"text":"I actually love the place - \nBut just don't go in the early morning hours just before clos","useful":0,"cool":0},"gwCpoe1uCQgEHUHJ6AFpjQ":{"text":"The food is American diner food with high quality. What makes it superb is Leon the waiter","useful":0,"cool":0},"y5Vekvirl2INipKujUHhzg":{"text":"OK, first off let me say I love this place and have been coming here on and off for many m","useful":0,"cool":0},"Cphr5q2gY52TIqf3Fr1TvA":{"text":"Fell upon this place after our trolley ride to the garden district.  Nothing fancy here bu","useful":0,"cool":0},"DNUSTzFEe_QfD8DQKuAoQQ":{"text":"Love some Camellia Grill!  Worth the wait for some New Orleans charm and delicious food.  ","useful":0,"cool":0},"XDVbolRLpNhcQ9xwx2d7sw":{"text":"This place was so fun to eat at!  I love that it was bar style dining, and you sit facing ","useful":0,"cool":0},"a3YO42M2JeUtSookzE7Vxw":{"text":"Food was decent but nothing memorable. We had visited here a few years ago and enjoyed the","useful":0,"cool":0},"kVjIgpVnOFdCEv39hBYgxA":{"text":"Seating is extremely limited and the food is exactly that of a diner. I would say it's not","useful":2,"cool":1},"TQBUop4a1x_-ED29dF69SQ":{"text":"I find Camelia Grill to be absurdly overrated. In a city of amazing food, this does not ra","useful":2,"cool":1},"36cyXPKR9sEOCZOflq-eXQ":{"text":"My wife and I heard good things about the pecan pie, so we decided to stop in for a bite. ","useful":0,"cool":0},"A9MtWue4pIKHG00gEPchjg":{"text":"Great environment, good food, great price, incredible service.","useful":0,"cool":0},"3lAut6lxBQS5K8NLatahFw":{"text":"If you're looking for a great late night run for $6 cheeseburgers that'll fill you up, thi","useful":2,"cool":1},"4odisceByhwo0faSekYE6Q":{"text":"Just so it is no surprise, this is a small place. On a weekend, expect upwards to a 30 min","useful":0,"cool":0},"dUwOh9xApZX2K_oEqYFEdg":{"text":"Yay!  This place makes me so happy. Great old school diner with wonderful burgers and chil","useful":0,"cool":0},"QBrwYJuy-C26olrBh9baFQ":{"text":"Best meal I ate in NOLA. The Manhattan omelet was AMAZEBALLS and the hot roster beef po'bo","useful":0,"cool":0},"kWcNZfMSRSCAcElQ2LrspQ":{"text":"Great old fashioned place, wonderful food, fast service, and a kind waiter. What else coul","useful":0,"cool":0},"HisAUXzhgM0sv0MOC_hV5Q":{"text":"I've been going here since I was a child, through my high school and college years. I'm 36","useful":0,"cool":0},"WZKDokoJoXYcvY7B0geIfg":{"text":"I wish I remembered to check in here so I never forget that I was here.. took a streetcar ","useful":3,"cool":2},"zpIKr2-9uxjN18LuyIk4TA":{"text":"Great place for breakfast where the St Charles line turns north.  There was a significant ","useful":0,"cool":0},"brHUG3DFeNKlAoSRjhTjRA":{"text":"Always great!  We lucked out and arrived at the perfect time; sat right down at the counte","useful":0,"cool":0},"Iapt2nCnmamauiraa_cQhg":{"text":"I heard that the place can be really busy but we must have come in at the right time becau","useful":1,"cool":0},"rQc957qhZX2RTTl05Cy_SQ":{"text":"We went for breakfast. Service was tops. Hash browns were really good. We liked everything","useful":0,"cool":0},"ISwjZBtYEvxKm2-2DAf8Rw":{"text":"Always consistent on food quality!! Camellia Grill is always open, most holidays and late ","useful":0,"cool":0},"SHHLPq3jBpiauX-U8Mi6sQ":{"text":"Must do while in Nola-\nRide the streetcar\nEat at Cafe du Monde\nVisit Metaire Cemetary (tru","useful":12,"cool":10},"BE1JFbWn_oNXY1Lr_83O2A":{"text":"Camellia Grill is stellar, fantastic, life-changing... That may be a little exaggerated, b","useful":1,"cool":0},"NjPybXKzYDczAMbi3lGJyg":{"text":"Good food and excellent  service! The veggie omelette I had was big enough to share. Busy ","useful":0,"cool":0},"Lo4Pci2so6wUb9ZNp224Mg":{"text":"Fun Experience.\n\nGet a fist pump from your server at the diner and you feel a bit better a","useful":0,"cool":0},"MLopkVjlH9DHsrirMOsveg":{"text":"If you are staying in the French Quarters it can be a trip to make it out here but it's wo","useful":1,"cool":0},"kT7W356yKZKVGY6mOw68RQ":{"text":"Aug 23 rd was my 60th birthday. There is no other place I wanted to eat at but here!!\nMr. ","useful":0,"cool":0},"7t4QLuaPpYIN9Yc58tatVg":{"text":"The Manhattan omelette is exceptional. The bacon was cooked perfectly to our liking at bot","useful":0,"cool":0},"8uSPw4ru2wk8sG9g3HrVlw":{"text":"I know, I know... the wait is horrific sometimes, but if you are in need of comfort food, ","useful":0,"cool":1},"pdZkk-hUV0IL5RRhRR-Lag":{"text":"If I could go zero I would . Wife and I came after the game and we got their before the wa","useful":0,"cool":1},"F3WDkIWBkoEAK9QWA-R0yQ":{"text":"This is historically a fun place to come on the St. Charles trolley for a cheap and tasty ","useful":0,"cool":0},"Tz3uE0Q318EmNlpVZA7Zbw":{"text":"Love the fun and friendly atmosphere!!! Diner still but not missing any of the New Orleans","useful":1,"cool":1},"qOc9v1O2EpMtunCZsT5PIQ":{"text":"3.5 stars. I liked this place...but didn't love it. \n\nMy first complaint is that there is ","useful":2,"cool":0},"puiZTz1kUn2NfD4YRF2t6w":{"text":"Every New Orleanian must go to Camellia Grill.  So we did.  It was my 1st time.  Won't be ","useful":0,"cool":0},"VPy6_2-RAmx5tjgcZB_w5Q":{"text":"I know it's a new orleans gem because it's been around for a while but it's really your av","useful":1,"cool":0},"JXCXfhVfwENVERZNKKgGTg":{"text":"Always a must visit in NOLA!   It's a wait but worth it and generally fun in line with oth","useful":0,"cool":0},"ybfrGCtzECyF_ZOsC_xnFQ":{"text":"As a tourist, this was a fun to-do off the St. Charles streetcar line on a lazy day.  The ","useful":0,"cool":0},"0vcYT7x2CCH-5Cnb7n0hUw":{"text":"Can never go wrong at Camellia Grill. I always get an omelet and they really do have the b","useful":0,"cool":0},"H-DeCSkoKHi2WpxMqBfBUg":{"text":"This place is small, get there early or plan to wait.  It is certainly worth the wait.  Gr","useful":0,"cool":0},"_A3syqxzonojPbw_1Mv3qw":{"text":"We made it in on a Sunday morning just before the line started forming. One of the few bon","useful":1,"cool":0},"4aJY-Q8qE4JJxTcD0uwCrA":{"text":"Oh.my.god. This is the heart stoppin southern food I've always dreamed about! If you're in","useful":0,"cool":0},"C7XX-It7fWVRRUjHvwtDog":{"text":"This place isn't for you if you want to complain about the messy kitchen. It's all part of","useful":5,"cool":4},"R4D6VSyXxyCU31Pj9geCKQ":{"text":"I would go here just for the chocolate pecan pie! Served warm (they toss it on the grill w","useful":0,"cool":0},"9I682tgYJonYnB7gYmFhJA":{"text":"Best meal I've had here in NOLA. The service was flawless. I've never had such a kind wait","useful":0,"cool":0},"r-fj_X0nm4LF_weQxZzFaA":{"text":"driving by one evening and saw a sign in front .25 cent oysters on the half shell. quickly","useful":0,"cool":0},"hl6vT6L-gXcThBStVg2yyQ":{"text":"Food is amazing, service is amazing! Truly enjoyed ourselves this is a much more cozy Waff","useful":1,"cool":0},"4h2_xViYqN2STZkL5v6voA":{"text":"Great place for breakfast or early lunch. Hilarious great service! If you are there you de","useful":0,"cool":0},"ODDITKtT_G4yThmIATaB9w":{"text":"Was there with sis in Feb....food was solid and I enjoyed the diner atmosphere.  Service w","useful":1,"cool":0},"uutZFDVG9gzU7z3RF4lkww":{"text":"Great meal at reasonable prices. The burgers are great and the hash browns are even better","useful":0,"cool":0},"9y9U0MTMwldN_7fgAb0NjA":{"text":"Where to start? Hmmmmm I don't eat pancakes besides my own but baby let me tell you, those","useful":0,"cool":0},"uSBh6wY6mnMe-iquSFsPqg":{"text":"Camellia Grill is a top choice for late night food establishments. It is the best restaura","useful":0,"cool":0},"Evbys-HiYd_EEjmaP_Taog":{"text":"Apparently, there is a regular crew working tirelessly for years, and it became clear when","useful":0,"cool":0},"TpeoAjLSc7xm9GXYvx5PrQ":{"text":"Great spot for burgers and good old fashion greasy breakfast.  The atmosphere is great wit","useful":0,"cool":0},"yQ2XawvLZVR26gb2GJ1MDg":{"text":"The Camellia Grill is another venerable New Orleans dining institution that is well worth ","useful":0,"cool":0},"tKYSkzuWAb27TMCT8_Q92A":{"text":"What can be said about this place that has not already been said?  It's a quaint storefron","useful":0,"cool":0},"PTA04mH-3Z_jZejbGREZjg":{"text":"Not my first choice when visiting new orleans. Kinda dirty and very busy. Reminds me of wa","useful":0,"cool":0},"fmyquTmEhBmGNrKRwk4jGA":{"text":"Aweosme experience. Food was awesome and big portions. The waiters and cooks are fun and v","useful":0,"cool":0},"afJffJfAv1h9jCi3BxF-ow":{"text":"Great little cozy diner experience.  The food is delicious and the wait staff is very frie","useful":1,"cool":0},"TMrBX86kYxlocuSefimQAA":{"text":"The food is delicious! I highly recommend the Camellia Grill for breakfast, the omelet was","useful":0,"cool":0},"zB-b6glrVk_HsHRgkgPpRg":{"text":"Super entertaining breakfast with our hosts. All the breakfast basics that taste better th","useful":0,"cool":0},"GXg6WuAy_tHDViOEUzfThQ":{"text":"One resurant in New Orleans I will never forget.  We were welcomed with open arms and our ","useful":0,"cool":0},"lDKE5nTpCpuKvdzid43lhA":{"text":"Just normal breakfast food, but normal breakfast food done REALLY RIGHT. I doubt I'll be g","useful":3,"cool":1},"9WxAEzDYnLZQgJc3xivi1A":{"text":"Came here for the first time for lunch. I liked the old style lunch counter seating. Brun ","useful":0,"cool":0},"qhCPWfnT84zXnWmb4Eg2gQ":{"text":"I hear a lot of hype about this place so I had to try it for myself. I must say that it wa","useful":1,"cool":0},"-_XGeqP2vFWo-B8ZQ6GXbg":{"text":"Are you kidding,it's an instant pleasure to my senses,it's a landmark.Love everything & ap","useful":1,"cool":0},"pri2Wx9JK2SftVbXX4ybZA":{"text":"We LOVE this place.  Best breakfast in town (and in the South for that matter).  I'd take ","useful":0,"cool":0},"ErIdqgbe_TVQuqCWuQQ3BQ":{"text":"This place is pretty straight forward. Breakfast and lunch dinner with animated old school","useful":0,"cool":0},"i1n6qNBHLbwoEsPUl2GVXQ":{"text":"Camellia Grill, you're like an old friend to me. From the BLTs I used to eat in high schoo","useful":1,"cool":2},"sR9nWNl-7jMZkzjnwk6qbA":{"text":"I'd give this place 5 stars for uniqueness and personality of our waiter. This is type of ","useful":0,"cool":0},"davaIwNfOKjpYpjey_-Qxw":{"text":"I LOVE breakfast food, and I like entertainment. This was the first place I went to eat wh","useful":1,"cool":0},"-ngvzzeT8q2x_ScKB7hzGA":{"text":"I ate at Camellia Grill (French Quarter location) for the first time this morning and may ","useful":4,"cool":4},"nEy4c8VN79t1J_8LnVLsOA":{"text":"So, after reading the reviews, you already know that the food here is great.  I'm not goin","useful":0,"cool":1},"-bJ7-rAf2vF_MPcqH1uryA":{"text":"This is the second time I went there for breakfast. The breakfast food is ok, good atmosph","useful":0,"cool":0},"dnvEFG-70fntAPspfXpgWA":{"text":"We hardly had to wait at all. We went on a Sunday morning around nine and only stood outsi","useful":0,"cool":0},"XjeDKH1wflLtpI60cZL0HQ":{"text":"You've got to try this place if you find yourself near Loyola or Tulane. The double U shap","useful":0,"cool":0},"DRvyPlrI-DWvll7cPe09ug":{"text":"A Local's Favorite Haunt\n\nThis place was amazing.  You have to imagine being transported b","useful":0,"cool":0},"mf40ktcBq9wHEWzd1gpbiw":{"text":"Great place great service great food but you should always expect a wait. Don't go here if","useful":0,"cool":0},"VAJLzgvW69EfWbPlWGpJkg":{"text":"Are you kidding me? . . We only had pie,  but it was the best ever. . Served fast and fun ","useful":0,"cool":0},"LlPjcTBEpDRC9J9RdTHHMw":{"text":"literally just a breakfast joint. seriously, nothing special. \nI got the waffles (good fla","useful":0,"cool":0},"9NURXVKxBKM34S_6wYHPSw":{"text":"I wanted to like this place, I really did. The one star is for the very nice cooks that wo","useful":6,"cool":0},"DeHGEwnTUmrwWXdBZF0LOA":{"text":"Had a fab waiter, Chris, who was super-entertaining and friendly. The food was simple, but","useful":0,"cool":0},"7MipPzZRHLvby9jam39jbA":{"text":"Dirty diner food. Guys serving you sweating all over the place. Never saw anyone wash thei","useful":0,"cool":0},"eAdzP9qmrmXIUTbOfVDIMQ":{"text":"This place has everything you want in a diner. Nothing fancy. Just excellent food and a gr","useful":0,"cool":0},"GKH4BqrvzEpmrfzBYuzFIQ":{"text":"An iconic location in the Big Easy. Usually a late nite stop after you are done with the R","useful":0,"cool":0},"Gdivci5uAqAz7_sNY-5U1g":{"text":"The service was super great, these guys deserve a great tip. I ordered the Mexican omelett","useful":0,"cool":0},"q0NaFDAGyq_A9K18FAN-Ww":{"text":"Awesome. For tourists and locals alike, this place is one of the best to grab a simple, de","useful":0,"cool":0},"H9Nc00UfWr7r9Os6eoFE1w":{"text":"I did not find this in any tour book.  I still suggest that for breakfast,ask a native,or ","useful":0,"cool":0},"6lm4174XiBQKV9apQTdelQ":{"text":"The consummate greasy spoon, the institution that is The Camellia Grill is one not to miss","useful":6,"cool":4},"VGim8LMiIhYmt4rnlfFXQQ":{"text":"What a fun place to eat. You take the St Charles trolley to almost the end of the line. It","useful":0,"cool":0},"l2BmqY_K1cpikwryJncIhA":{"text":"Wait was so long. Food is OK. We were not served water until much later, had to ask for a ","useful":0,"cool":0},"IpS_jEl5ZM3u1Bwqtpu1vA":{"text":"I have been going to Camellia Grill for twenty years, and this old time diner has not chan","useful":3,"cool":4},"tkE8R0fH8lgVgbXFcZ2V6g":{"text":"This is an awesome breakfast place. Food is always good! The staff is always friendly & he","useful":0,"cool":0},"CcWN9Il53topJHJnuZNnJw":{"text":"This is a solid choice if you are looking for a greasy spoon type of place. If you are not","useful":1,"cool":1},"VsCjY0_HD9Ox_ysQBco3mQ":{"text":"Went to Camellia Grill for the first time in many years last night. I was hoping for a tri","useful":0,"cool":0},"lvIF8EePoCNafdYd0qLUOQ":{"text":"Had a fantastic, affordable diner meal at a convenient 1 am!! Enjoyed the atmosphere and h","useful":0,"cool":0},"-d3RM_wGPNbE7laDLEPGmg":{"text":"I was hesitant to eat here, given that it was recommended by a college student who eats an","useful":0,"cool":0},"gmU3LT2IAq2V_QD3U8PjeQ":{"text":"Loved it!  Awesome greasy spoon!  Gumbo was delicious!  Take the St Charles trolley.  Got ","useful":0,"cool":0},"F6T79Ny9ObeOnToqS84CXA":{"text":"We were disappointed. We have been coming here for 36 years and the service and food have ","useful":3,"cool":0},"bsBoq1z-xcvtUXQL3Ge2yw":{"text":"The best thing about the camellia grill is definitely the atmosphere. It feels just like a","useful":0,"cool":1},"XmjYvsRSRAzKWFc5b1h17A":{"text":"Best place to eat in town good food fresh made when you order good prices multiple options","useful":0,"cool":0},"_WEWgnNj1W4X69J7tzJMuw":{"text":"Awesome omlets and burgers. We always get a freeze when we go... especially the chocolate ","useful":0,"cool":0},"rWJw1rCUGIoa5EDdYwO89g":{"text":"Really great diner for breakfast. It's only counter seating, which is cool. We tried the b","useful":0,"cool":0},"KfNvOanVF3-kKO60aYKHlA":{"text":"When I visit the Crescent City, this is a staple for me.\n\nA friend of mine who is a studen","useful":1,"cool":0},"cd_Ee2b-Oc8NVEpn4RVvAQ":{"text":"The Camellia Grill at 540 Chartres Street in New Orleans' French Quarter is the only place","useful":2,"cool":1},"2qq6R_kAW50fyCL867pjAA":{"text":"The burger was awesome! The fries were crispy and good! The chocolate freeze were awesome ","useful":1,"cool":1},"TYGs49Jz-btOcacNOvUrlw":{"text":"Great local place!!  Only in New Orleans do you get syrup dispenser and a butter dispenser","useful":0,"cool":0},"FIhgVCK0aAZ8JepMNycIiQ":{"text":"Camellia Grill - open late, prices cheap, and ok food. Somehow, people fall ass over tea k","useful":0,"cool":0},"QCcebuF8S_5tVlbRfr6b_A":{"text":"Went there for lunch. The staff likes to entertain. Food is below average. Restrooms are i","useful":0,"cool":0},"rUwOy95nJKjQQYgHZaFCsw":{"text":"Waited in line about 40 min on a Sunday morning but it was definitely worth the wait. I do","useful":0,"cool":0},"-j-amLnROQPq0EGbsF2r6w":{"text":"This counter-only diner was good and the familial environment was great.  I'd advise takin","useful":1,"cool":0},"_giq0ZVwDJpW7KoHQ2EiYg":{"text":"Love this place. Great breakfast, brunch, or lunch spot. Best waffles I have had, best has","useful":0,"cool":0},"Mm4FbyK32GXRGab2QxF1eg":{"text":"Great service, great food, great place to visit if you come to New Orleans! The waiters ma","useful":0,"cool":0},"xq3oAsxMckLfTG2IHRUnww":{"text":"We had the vegetarian omelette and the Rano's (egg whites and spinach), and decided to sha","useful":0,"cool":0},"53xFItI0px3nCf_mNQ_pAw":{"text":"They don't salt their fries. Even McDonald's does that.  I think I ordered poorly - hot ro","useful":1,"cool":0},"Ph7QxDjlhcg9d7uCL3aKXQ":{"text":"I was really excited to go here with my friends after a zoo trip, but it turned out to be ","useful":1,"cool":0},"oHc8g8jBt7FQndd2LoDCsQ":{"text":"Wow! What a breakfast ,,,,,had the mushroom omlette with hash browns and a side of bacon ,","useful":0,"cool":0},"kvudrAVHJrfpx6tIIXlZzQ":{"text":"I ordered the chili omelet with grits, 3 pancakes and a pecan pie with ice cream. My meal ","useful":0,"cool":0},"IUDsHtgQA-YvdQo-6yRppg":{"text":"This is the quintessential diner!  Food is great, the staff friendly and they cook right t","useful":1,"cool":0},"wzHhyyFtlRhac-sQ278YGA":{"text":"A review two years later for me...I'm glad I was able to visit while the late Marvin Day w","useful":0,"cool":0},"rZJq9-S3JOU2MFosKKN50w":{"text":"This is a New Orleans institution that has been located in the river bend area of New Orle","useful":1,"cool":0},"erJRIboipADPbTO2uj2uBA":{"text":"To start off, make sure that you're getting here early or that you're ready to wait. To fo","useful":0,"cool":0},"icl_eKFspOVlsGhCZ82gnw":{"text":"I've never had a bad thing from here! Everything is good! My favorite is the Word special ","useful":0,"cool":0},"xCgpWu-FdQIUTZQ6x27l_Q":{"text":"The food here is delicious. Other than the rude hostess the staff is funny, pleasant and m","useful":0,"cool":0},"csW3Z9rI9KecjDKA0pZccw":{"text":"I give Camellia Grill 2.5 stars.\n\nHad a hankering for some diner type breakfast on a Sunda","useful":6,"cool":1},"wyUTuhCVN9L0aV0AXPeN3g":{"text":"We took the trolley here for breakfast the morning of New Years Eve.  We arrived a little ","useful":0,"cool":0},"mXqZ4Jf9B5pnz5h17MhDcg":{"text":"One of my favorite places ever.  So charming, such great food..and the people who work the","useful":0,"cool":0},"d-4QrFrO7G83tEcODyph4g":{"text":"Old school dining at it's best with a staff that will make you smile/laugh.... And food th","useful":0,"cool":0},"GEdadIaqvk23C9HCUuVv1Q":{"text":"I can't say enough great things about this place. It's so unique to uptown and has anythin","useful":0,"cool":0},"861yBEkjn4NRMFKo63mKTQ":{"text":"This is the cutest diner ever. I love how the waiter orders up the food. I stuck with a BL","useful":0,"cool":0},"jsr70izlOHQ7MRtuMgE-qQ":{"text":"(10/2014) \nMy second taste of Louisiana!  It's good ol' fashion simple home-style grill fo","useful":0,"cool":0},"HjCD7-kE8_YOja0aRZ6V1g":{"text":"This is another of those places where I think people are more enamored with the idea of th","useful":3,"cool":1},"mcvY2yFROcOwDbsXfA0p7w":{"text":"Arrived at around 2am. Totally ignored for 30 minutes. Almost had to speak to the manager.","useful":0,"cool":0},"NYG9i5vpq5P-V2in7LyLwA":{"text":"I came here on June 9th around 4:30pm along with 3 other friends . Upon walking in , this ","useful":0,"cool":0},"Ywz2MCTXCrPNDG7cu3y7vA":{"text":"You CANNOT miss this place if you're visiting New Orleans! Yes, sometime the wait is long,","useful":0,"cool":0},"V87PwEAO2S84MFTPtenJkg":{"text":"small place but man the food is amazing. we had the fried catfish, the chef's omelet which","useful":0,"cool":0},"Fsx5T_V_EcFyQYPYDlUELg":{"text":"Not sure where to start except to say WOW!!!  What a experience in food, quality, atmosphe","useful":0,"cool":0},"KhKATs_KOZjCsEsF_jMq1w":{"text":"Been here twice in my three visits to New Orleans. We just love it!  It is an experience n","useful":1,"cool":0},"XNkyWWnqPYXVWjjQ10bWHA":{"text":"DON'T GO!!!\nThere are too many great places to eat in NOLA to waste a meal here.\n\nOmlette ","useful":2,"cool":0},"dsTYMrQtuZ6_tGPTK2kOvA":{"text":"I went to New Orleans for my sister's graduation from Tulane this passed May.  I had heard","useful":0,"cool":0},"ml1P4qAo-7_3Ss5Gj9i8Ig":{"text":"I have been going to the Camellia for almost five years and after five years I will not re","useful":0,"cool":0},"NAHhc7FTScoIuqRWcdq3_w":{"text":"I love this place!  I've been coming here since the 80's.  Every time I go to New Orleans ","useful":0,"cool":0},"Tsabj9a0-VacbO3bCssDaw":{"text":"Love The Camellia Grill! Although the food is good, it's the atmosphere that makes the exp","useful":0,"cool":0},"oLzYGnoGcoayTktHgW7Z2A":{"text":"Great atmosphere, great service, lively good time.  Belly up to the diner-style counter an","useful":2,"cool":0},"sEL1sr-q2lWlwHXd_t2APw":{"text":"Leave Jackson Square when you're in NOLA!\n\nThis grill beckons a by-gone era with its waite","useful":2,"cool":0},"K1MnBGz30t-L9BLLlznSKw":{"text":"Classic diner.  I would go here for the experience rather than the food. \n\nAlso, plan on s","useful":0,"cool":0},"cw-jdsrnA55f1QZzx_rSeA":{"text":"So my friends had been talking this place up for YEARS, and the last time we went they wer","useful":1,"cool":1},"gAaa0Hia93V4BCClT7aA1A":{"text":"Excellent service. Good Food.\n\nCamellia Grill is a New Orleans classic! I have been going ","useful":0,"cool":0},"VJX02pgGk52ZN_cf9Cu07w":{"text":"I'd passed by this place in Uptown for many years, but never stopped in until the week aft","useful":0,"cool":2},"5pXnJbMyCzAjMrBUWfi3XQ":{"text":"Too crowded to find a place for four together and one of the line cooks kept rapping. I do","useful":0,"cool":0},"NkYEYQk8eQi-TJeDn470sA":{"text":"I'd give it a worse score but the place is clean and the service prompt. The reuben- liste","useful":0,"cool":0},"kMxIeAmEzkjhYZrKAnAAww":{"text":"Pecan waffle + over medium egg + fresh orange juice = breakfast of champions.\n\nThe true di","useful":0,"cool":0},"su8bRjztM1F7s1SZdCUspg":{"text":"Simple good food at a low cost in a fun atmosphere. We enjoyed our breakfast here before a","useful":0,"cool":0},"g0F1VME40tftJ0wgNX7VaQ":{"text":"We only stopped to have the pie. And what an experience. If you want to experience a good ","useful":0,"cool":0},"zWu_qKBUa4hZ5sVLp6qf6Q":{"text":"Went here for the first time and thought it was ok, but definitely won't go back. \n\nI admi","useful":3,"cool":0},"DFL3kP0sf91a5cYZOuEXIQ":{"text":"Camellia Grill has gone downhill.  Had a cheese omelette that I really used to look forwar","useful":0,"cool":0},"HCv9ZTmz3khkkbsStldsiw":{"text":"Really good, end of story.  Could be a little cheaper only complaint.","useful":0,"cool":0},"07CgQJFCm1v4PMyAesQ1Aw":{"text":"The food is nothing special (they were out of pecan pie), let's just be honest. At least f","useful":1,"cool":1},"dy7aQIjjgnlowapnUHbLUA":{"text":"This was our last stop...waiting in the wings to offer us yet another slice of heaven.\nAnd","useful":0,"cool":0},"GfyjZ529aV9ZK6J8UkFLtw":{"text":"The female server with long braided hair obviously hates white people!! She had an attitud","useful":0,"cool":0},"tvX9owIjsyCTMOVBL_ucgQ":{"text":"Loved this place. We were on a hunt for the best milkshake in New Orleans back in May and ","useful":0,"cool":0},"rD6kclB7QD0G0uQufYileg":{"text":"Sadly, their French Quarter location has closed, but you get the same taste and experience","useful":0,"cool":0},"YEVnW6gJ9Hde6CYHF_u8iw":{"text":"Camellia Grill is the only local diner I frequent. It has a great classic feel with only b","useful":2,"cool":0},"6Cv5FqhZ_blaeZxP6qQ13g":{"text":"Camellia Grill - 7:40 a.m. My group of 20 ALMOST first in line. Enter promptly @ 8:00 with","useful":0,"cool":0},"S6JhW-p7p3TFxvsx5o0SGw":{"text":"Great for families, good reasonable prices, fun/friendly staff, big variety.\nWe stayed in ","useful":0,"cool":0},"_Uk8eM_oNpCLYG-JnC-ALA":{"text":"It's a dam good thing I don't live in New Orleans because if I did I'd be at this joint ev","useful":2,"cool":1},"F8ltVEM7ZwSc8nnDLu8YgQ":{"text":"Probably one of the best burgers I have had in a long time! You have a wait a bit to get a","useful":0,"cool":0},"elskdV90F2ll3E9UuCbPnQ":{"text":"First time back since college and it was so worth it. We stopped for breakfast on our way ","useful":0,"cool":0},"HTji1Ehn2L0RpjUsLr8Xhw":{"text":"It's been 15 years since I went to Camellia Grill so things may have changed. But I still ","useful":0,"cool":0},"NtZHGzXq2X9iJeRE5Px4Bg":{"text":"My wife and I had breakfast there. Both had omelets, grits, and hash browns. Omelets were ","useful":0,"cool":0},"IyU4zpJTZHSg9FHc8-5l0Q":{"text":"I am truly dumbstruck as to why this is so highly lauded. Yes, its got the diner kitsch ex","useful":2,"cool":0},"ZlnrFjldJBzzZfYnNTEzzA":{"text":"Man oh man - had 30 minutes- ran in and had the \"tuna\" and a tea! Good lord these people m","useful":1,"cool":0},"8H7GGvHxVcIaN_9tegp-Kw":{"text":"We were staying in the French quarters so it was a trip to come out here (later I saw one ","useful":1,"cool":0},"wfvqUlu9a3iTBe4x2hWSkw":{"text":"Camellia Grill is the king of diners! It has one of the best (and least expensive) burgers","useful":0,"cool":0},"8Y6Pc9pmY0wvHcOT1Xerxw":{"text":"Best short order grill in the city!!!! Open till 2 or 3 in the morning. Highly recommended","useful":0,"cool":0},"kg0XzGLGKpn0Pi0YHd3ryg":{"text":"This was a GREAT place to eat on our first visit to NOLA! It was recommended in Frommer's ","useful":0,"cool":0},"3S6wvZ14_WNsCCQBt5RQDA":{"text":"This is a really charming place. Definitely brings you back to old school dining. The way ","useful":0,"cool":0},"67g-61XRmmdNh1Ks8_tr3Q":{"text":"Love the Camellia grill come hunger and don't think about calories. Don't forget the homem","useful":1,"cool":0},"gDjfjixZXabeLCdEbzNwuA":{"text":"Meh.  Pecan Pie was good, but I feel like the omelettes and breakfast were kind of mediocr","useful":0,"cool":0},"_7KP7ZePxJNLGSFW_Ct_JQ":{"text":"Excellent food. Excellent service from Michael! Got a sausage and cheese omelette with has","useful":0,"cool":0},"G_AZxt9x-45ohlaFZBfuOQ":{"text":"My and My cuzzin ate here after a night of bar hoppin in NOLA and the food was GREAT!!! Th","useful":0,"cool":0},"wGTmiW0CpbUMwtu_L4vPzg":{"text":"Everything was amazing! Bacon cheese burger, fries, onion rings, grilled cheese for the ki","useful":0,"cool":0},"wJzeFqtuuNz83qtPY9ulcQ":{"text":"Always a must on our trips to NOLA.  Great breakfast and friendly staff.  Arrive early.  O","useful":0,"cool":0},"n4hSYQ-hpizkMqC8u9Y6rw":{"text":"Late nights or recover mornings aren't complete without Camellia Grill. Great greasy in th","useful":0,"cool":0},"Wiqr0xFuMq3ivberRqgXsQ":{"text":"LOVED this place. Once we discovered it we went here for breakfast every morning. Staff is","useful":1,"cool":0},"HqgTutUTKuN0NbAkLED5yQ":{"text":"Beware! Recent health code violations in July 2014.  Entire family became ill after eating","useful":2,"cool":0},"DEO-7bLwCybxcrwIhImZTQ":{"text":"One eyed buck burger with bacon and cheese. The bacon was really fatty, but the patty and ","useful":1,"cool":1},"mnZUlKpZIhA4u0LL5FbhfA":{"text":"I was really looking forward to trying this place for breakfast while my family and I were","useful":0,"cool":0},"pEPoTKHgXgA4lGkPe0NeGQ":{"text":"We both had the SW Omelette.  Very good and the grits were excellent.  Counter seating.  F","useful":0,"cool":0},"Fj1BYKcWv-SN5TtkTSkDpQ":{"text":"This place is exactly why I love New Orleans.  It's one of a kind.\n\nThere are no tables, j","useful":1,"cool":2},"N7GD3w_8DN1Rvuc0-GyQQg":{"text":"A Nola tradition and everyone should go at least once for a trip back in time.  Very good ","useful":2,"cool":0},"VzsXev0aBdjyGZf8YuApPg":{"text":"In addition to the food being fantastic, our server, Leon, was easily the best server I've","useful":0,"cool":0},"G--qxWL08lGjXOjYeMBYYg":{"text":"Food tastes ok but portions are small and it's pretty expensive for what you get. Service ","useful":0,"cool":0},"wWBJzz-HBxqQYU6JK6f_Sg":{"text":"Stopped in for a post 11pm meal in the riverbend area and ended up at Camellia. The food h","useful":2,"cool":2},"UNpA_KoAYK8yVbGO7F6pAA":{"text":"Not good. I always hear that this is the place to go for late night meals. I was obviously","useful":1,"cool":0},"sW0shSAZYusaqnsF2VFNeg":{"text":"Best burger I've ever had! I ordered the One-Eyed Buck with cheese and bacon. I'm fact, we","useful":1,"cool":0},"5y6V0R5luWL8k2xumkB8_g":{"text":"Long lines at peak times. Loud atmosphere... Yeah, doesn't matter. Still one of the best d","useful":0,"cool":0},"kNexAEhq_D3qbjS7vAs-eg":{"text":"The service, the ambiance, the nostalgia and of course, the food! It reminded me of being ","useful":0,"cool":0},"nmzhpDRGl047Bj1M-tGhcQ":{"text":"The food is good, the portions are large and the staff members are great.\nPretty much expe","useful":0,"cool":0},"ZHY2O6fgOROjiellVNy1rQ":{"text":"This place is one of, if not the, most overrated restaurant in New Orleans.  The experienc","useful":1,"cool":1},"hfZP3r-oPDkI54-NVAOmJA":{"text":"I was in NOLA for work last week. I have to say my colleagues and I ate here everyday!! Th","useful":0,"cool":0},"RtRwD5xPyQ-PJtXKIz7frQ":{"text":"Outstanding meal and great atmosphere. A New Orleans tradition. Best breakfast in town","useful":0,"cool":0},"xNE3s6Zs9vErFUmR-2n_qQ":{"text":"This was a fun experience - service was fast despite the chaotic and crowded ambiance, and","useful":0,"cool":0},"ikI_wLNfEB7J82j8qtWRGw":{"text":"Great service. Good food. Burgers fresh and not frozen. Freezes are basically milkshakes t","useful":0,"cool":0},"wMqmFG3rHtC8Jt4FgXtVaQ":{"text":"The food at Camellia Grill really hits the spot--but the reason for the 5 star rating is t","useful":1,"cool":1},"2xZf1UNB3-KKSV0_UYvlcg":{"text":"Whats not to love? The servers are a kick, the food is delicious, and they have butter in ","useful":0,"cool":1},"DmDUk_tuDCOuGiiGUS8tJg":{"text":"This was always the go to spot for great breakfast when I was in school in New Orleans - f","useful":0,"cool":0},"gE51AdMvTKECHsMc_wBhow":{"text":"Old Time Fun is all I can say...I recently discovered this place and liked it so much I at","useful":0,"cool":0},"K70uWWszLgWetkrgva_7zA":{"text":"Nom Nom Nom... this place was so very tasty! I was taken here by a local for a laaate brea","useful":1,"cool":0},"5D_hDo_TD8tPfLPvJAcogA":{"text":"Tasty food, not the type you can get just anywhere. I had the chili cheese omelet, as good","useful":0,"cool":0},"DgPG3OEIbLsVHasn32OOAA":{"text":"I'm sorry all you die hard fans, I just don't get it. I am by no means a native but I'm ma","useful":0,"cool":0},"bSdM-nV_oiGUy3oJ0WPW0w":{"text":"Nice place. The food is good. Ordered the catfish Po-boys, gumbo, and cheesecake. The rice","useful":0,"cool":0},"_mqEcFzrUxJxi08opJFJ8w":{"text":"I sold myself on a few places before our trip to New Orleans, this was one and I was hopin","useful":0,"cool":0},"BnX-IgWg8UfSAEH8GvKZRA":{"text":"Was brought here by a local for a friday evening get together and was excited after readin","useful":1,"cool":0},"9dTcnRa_NfkBWMntIaXPmg":{"text":"this was the best breakfast in New Orleans. THE BEST! as I looked online to find a good br","useful":0,"cool":0},"Ua8iIaTaDSQ1xznjT8CvAQ":{"text":"I ate lunch here every day for the 3 years I went to high school across the street at Fran","useful":1,"cool":0},"agFnRMIfNDvp9lVT8viHDQ":{"text":"My husband and I both ordered the cheeseburger, onion rings, and a soda, and we were lovin","useful":1,"cool":0},"FbYYz-LhxkASNV_R2JVeJg":{"text":"Greasy food but really good. Very friendly wait staff and fun \"diner\"type experience. Has ","useful":1,"cool":0},"0-EBfFlFK2lAKn8rJ1OGGw":{"text":"A locally famous spot that my friend who lives there likes to go to. It is a walk away fro","useful":1,"cool":1},"SXeG9sEmSc87ZirVI_30ew":{"text":"I was recommended to this \"place to eat\" by my hotel desk as part of my  St Charles Trolly","useful":2,"cool":1},"1SUVYB9nQlFE-nTwsW4Gvg":{"text":"I cannot believe it took me so long to finally experience Camilia Grill.  I've driven by m","useful":0,"cool":0},"WhCUo8TQvjFJbW5kHeDreA":{"text":"Something about this diner is really cool. There is Southern charm, friendly staff, good p","useful":0,"cool":0},"JLH_5uUwwMsODaq7Ho5enQ":{"text":"Maybe it was the hype or the majority of people who love & recommend this place are young,","useful":0,"cool":0},"7jTyX1HfcGk8aXhrtLryuw":{"text":"Greasy and over rated, but service was good. We went here because the ratings were so grea","useful":0,"cool":0},"2gg0uCNncUqSlG1q4iJMSw":{"text":"It's a cattle call and I don't like to be herded. It was like a military maneuver getting ","useful":1,"cool":0},"k_gi4EOcfuXjz-dT_zkLaQ":{"text":"The Camellia Grill is a must go if your visiting NOLA. There is only seating for about 20 ","useful":1,"cool":0},"dGLdfuYzJ3j824RMZezrCw":{"text":"The best part about The Camellia Grill is that it is open late (2:00am) and the food is ch","useful":0,"cool":0},"fFgdAd6vz3d22pDUeafOzA":{"text":"we had the frog burger which is according to our waiter the best thing not on the menu and","useful":0,"cool":0},"wddho3AXcn0RG8EK2xqA_w":{"text":"Great place for breakfast! Home cooked style and they load your plate up! Breakfast for 2 ","useful":0,"cool":0},"nXzEuB7xC24GbHbPdrHCBA":{"text":"A cute diner where the wait staff is happy to see you and are really friendly. Food is sta","useful":0,"cool":0},"PhxFhMXNV7w2R5yu5azJsA":{"text":"The food was so good and the waiter was so funny.  The only thing was portions were a bit ","useful":0,"cool":0},"5VrlSIX-8skxTgrfr-DAuA":{"text":"A charming little kitchen. I loved the waiters/cooks but the food was just ordinary. I tri","useful":0,"cool":0},"cb0DGCjaVshuGyaLldrPIw":{"text":"Forgot how fluffy their omelettes are. Had a Mexican Omelette with ground beef, cheese, an","useful":0,"cool":0},"WcCBWGUi-ZMQyt3DQely2A":{"text":"This place is amazing.  Old school diner type place with awesome hash browns and omelets. ","useful":0,"cool":0},"2Y8UN-Z15bxg57GYm9QR2g":{"text":"One of my favorite places for breakfast and burgers, etc., since I was a kid. This place i","useful":1,"cool":1},"vniY8I61aSXfbwrjbubW-g":{"text":"The staff is wonderful and food here is great!!! I had to get that out there first. \n\nI ha","useful":1,"cool":0},"Fqw2Pt4xSlBFpwI7_vhU_A":{"text":"Very good omelets.  Had the chef's special, but 86ed the chili.  Glad I did as they pour a","useful":1,"cool":0},"Tw9z4EIiFr1ZjOWu7_61Ww":{"text":"Never miss this place when in NOLA.  At least once every time I go to NOLA I have breakfas","useful":0,"cool":0},"exsfGKjBPthk721eJGWfZA":{"text":"The burgers here are so good and the service is super-friendly. It's all counter seating, ","useful":1,"cool":0},"1UfIjUGIIbsgewpztYqWXw":{"text":"This is the perfect place for inexpensive and quick dining with very good food. Everything","useful":0,"cool":0},"hD7H0XB-sbLp5lfJCYioBQ":{"text":"They may not have the best diner food around, but its still pretty good and the atmosphere","useful":1,"cool":1},"CX1uhdjzPWonXRQCcceLYg":{"text":"So, I feel like a bit of a jerk giving a NOLA staple like this only two stars. However, I ","useful":1,"cool":1},"poFDTpJ3IKiXysuRk4SafQ":{"text":"Love, love, love, love, love Camellia Grill!!  What's not to love - from the entertaining ","useful":0,"cool":0},"Rw5_zqB7uJEF741cT9pSuw":{"text":"Awesome breakfast! Wiith great personalities. We ordered the chilli cheese omelet; our fri","useful":0,"cool":0},"eetMSLiMRQa98zmuFbIF-Q":{"text":"Stopped in for a couple beers. Cool sports bar atmosphere. Huge selection of beers, both i","useful":0,"cool":0},"nXJmnTsAARjX4bVzFdoCDQ":{"text":"Absolutely need to visit this cute little diner. Wait staff was very polite and personable","useful":0,"cool":0},"148bM48N0eonEvL-Tiz4oA":{"text":"Not the greatest but then again it's a true diner so dont expect high end cuisine here.  I","useful":1,"cool":1},"yGmqPleGsC1uBxmhd1QKug":{"text":"The chocolate pecan pie a la mode was mind blowing. I ordered it unsuspectingly, just expe","useful":1,"cool":2},"nI448jVKK3EUGILDG5HXwg":{"text":"Very good great service and very fast and it is small but I went on a good day there was p","useful":0,"cool":1},"egIDu60S77IiFTXuT0_99Q":{"text":"First time here and I must say the burger was delicious! Made to order and juicy! Very coz","useful":0,"cool":0},"ifQALGqovLrXyl82O-1FRQ":{"text":"Do you like apples?\n\n I had a slice of apple pie a la mode and my girlfriend had the choco","useful":3,"cool":4},"G5wJgZIpVzgXogkXC44M4g":{"text":"People love this place but I wasn't that impressed. Staff wasn't that friendly, one employ","useful":1,"cool":0},"ghg_NWaq2oWeFVxsM-w9lQ":{"text":"Camellia's is the best place in New Orleans for a bite of greasy spoon food. I love  to go","useful":1,"cool":1},"U9R3PVpltYbndkybWcEADg":{"text":"Our last stop before we headed home, and probably my favorite restaurant we are on the who","useful":0,"cool":0},"baLpQ19vBc45vZKDe8dbbw":{"text":"A great Diner dinning experience. It's a no frills, no non-sense no time for food pics kin","useful":1,"cool":1},"9upuY_bo3NgPEPbi_gQ2_g":{"text":"Waffles and chicken, pecan pie. An institution! And in a BEEEAAUUUTIFUL section of the cit","useful":0,"cool":0},"GLeIQxT6zehvp9CcTZhXMA":{"text":"A must go to spot, the burgers are unbelievable!!! The service, oh the service!! We had th","useful":0,"cool":0},"HIkC9A0lzrgH1lmaigtHpw":{"text":"Visited from California , got off the trolley and found this Gem .\nGreat food and service ","useful":0,"cool":0},"-q2Cq-J9acflRvpUFNlTcg":{"text":"Great diner food! Freezes are excellent. Cheap quality food. Like waho only better because","useful":0,"cool":0},"7cNKcfvAGUdyQhatmP1njw":{"text":"Fantastic vibe, great service. The food is classic diner food, but distinctively New Orlea","useful":0,"cool":0},"X78o-zten8IRzfJ4GqGSeA":{"text":"Although convenient to the streetcar, Camellia Grill is definitely worth hiking a couple m","useful":0,"cool":0},"cOP-KCozlE13yQ4ScBP-Og":{"text":"I ate the best breakfast I've had in years at the Camellia Grill this past Wednesday morni","useful":1,"cool":0},"vHNK6zx1dE5aqEW78sKJ1A":{"text":"Worth the wait if there is a line...but this is one of my favorite places to eat in New Or","useful":0,"cool":0},"1zeG2wSc82NjAM6tFmm__A":{"text":"People are seriously blinded by the history of the place.\n\nThe service is terrible, they a","useful":2,"cool":1},"k_gF2crZuHrmYy092NoXpg":{"text":"Sure it's touristy but there's a reason for it. The food is greasy, big and simple. You're","useful":0,"cool":2},"Z7Z-hFdEsi5gT8FQEH41gg":{"text":"i'm surprised there's only been 49 reviews of this place!\n\nThis place is a New Orleans mus","useful":3,"cool":2},"S3KEmKbVVekNKAtZUYEaIA":{"text":"I grew up on the coast hearing all the stories about Camillia and decided to finally ventu","useful":1,"cool":0},"OyXxhy3PG6OOm5mZvKXgig":{"text":"This is the type of place you give 10 stars to! I lllllllllllllllllooooooooooooovvvvvvvvvv","useful":0,"cool":1},"Zf4INi63kKQv_f5Igym7-A":{"text":"Taking the streetcar down St. Charles on a beautiful spring day and looking at all the bea","useful":1,"cool":0},"WGJxOB2QKc1TWok8dbWrTA":{"text":"Perfect cure for the blues or a hangover.  Breakfast of champs was burger w/ fried egg and","useful":0,"cool":0},"lfDwdj_C9vmclYL-qVoqVw":{"text":"If you don't mind a wait this is the place for breakfast food.  Delicious omelets and milk","useful":0,"cool":0},"wuGJFVvoEwWr7Am0sP6rpw":{"text":"Disclaimer: If you're looking for upscale, classy, super clean eatery...this is NOT for yo","useful":1,"cool":0},"ENm2IhmiTusvA5gS_Ykfmg":{"text":"Counter seating only, but that offers the best view.  We enjoyed a mushroom and Swiss omel","useful":0,"cool":0},"uh1OKPP2dePE62WTwYNQqQ":{"text":"We came to Camellia Grill for lunch. We ordered muffeletta and crispy waffle. The waiters ","useful":0,"cool":0},"OVoL9JEzZ2UkMgC_b3_rew":{"text":"I thought I reviewed this place last year. Phenomenal!!!!! I'm going back to NOLA tomorrow","useful":0,"cool":0},"jX_REh2-0uw6T1n9aa2vgQ":{"text":"My friend and I were in town for a concert and we had a local friend take us here. We had ","useful":0,"cool":0},"v52PbLGg5SZ0ZgpH9DJRLQ":{"text":"A must eat place. Pecan pie makes non pie eaters into pecan pie lovers. Catfish was tender","useful":0,"cool":0},"RUR9i79E398jgbwBCCjw0w":{"text":"This is Don from Ohio. I was told at my hotel to go here. Took the trolley to the end of t","useful":0,"cool":0},"csxxp29mt3Z2cy6UORJm7g":{"text":"Had breakfast here with the wife today.  She had pecan pancakes, I had a sausage omelette.","useful":1,"cool":0},"VH2ER5POqxL8PT0QFwQP6Q":{"text":"Small place, diner seating, you want to know where the locals eat you found it. I had the ","useful":0,"cool":0},"b_NX8vy5eVn8cxtZuWW3hA":{"text":"Okay, so I have really mixed feelings about the Camellia Grill. \nI'm from the northeast of","useful":0,"cool":0},"izwzjVchGeJl4QaTz1cF7Q":{"text":"Energy Amazing!!! Great food and even better service!! As soon as u walk in a \"Hey Baby Ho","useful":0,"cool":0},"zRe_TTuRgY5pbMFZdkuVuA":{"text":"Visiting the French Quarters but want to get out to see New Orleans? Take the St. Charles ","useful":0,"cool":0},"Bw14jVR-LjSNv1dI7hUEJA":{"text":"Amazing.  Not only the food but the ambiance (old south).  Get an omelette and a freeze","useful":0,"cool":1},"VPi4Z5AXIyrEZQpKLbdVGw":{"text":"Everyone should  come here at least once for the experience.  It's a NOLA treat. My fav is","useful":0,"cool":0},"BC9kdIIHOpUMB5reG4GXEw":{"text":"Not what it used to be but then these days what is?! I was there one morning mid-week, arr","useful":3,"cool":1},"DKw1SlS5xue5xCi-7StapA":{"text":"Pecan Pie a la mode.  Is one of my fondest memories from the time I spent in New Orleans a","useful":2,"cool":3},"eF9cKFIwROsmyi1Wz8PeQQ":{"text":"Holy moly!!!\n\nChef omelet I believe it was called. A giant omelet covered in chilli. HECK ","useful":2,"cool":1},"QA_osK1SVj5yvm6e2M5y0w":{"text":"Skip the onion rings, get chili cheese fries with your burger. The turkey club is amazing.","useful":1,"cool":0},"o9z2RgzADxPkEcDo4C2fsg":{"text":"I live in California, and all I can think about is how can I get my boss to pay for a busi","useful":0,"cool":0},"BDqQEUf19tZxhj_hvTQWfw":{"text":"The Camellia Grill is a steadfast dependable friend. The food is always excellent, the pri","useful":0,"cool":0},"47HFrEVw8xXxdmJFQFgS6g":{"text":"The Camillia Grill is a landmark restaurant for comfort food and I was not disappointed. A","useful":0,"cool":0},"AgYFDF6IfpUjWNxWBVgocA":{"text":"Around 15 years ago, I paid my first visit to The Camellia Grill. I sat down on the right ","useful":1,"cool":0},"KaNuR0DT7gpNledD25hyQw":{"text":"If you want a greasy burger and fries, this is definitely the place. The quality of the ha","useful":2,"cool":0},"U1MGChEiUrct_mzTJ34wSg":{"text":"A favorite for visitors & locals alike. No place like it in the city! Friendly staff & won","useful":0,"cool":0},"mp8J-QzjTLOXfGD-aqI57w":{"text":"Service was slow and kind of rude. There was no alcoholic beverages as advertised. Not ver","useful":0,"cool":0},"TOMaE8EnNsbenxw5miG2XQ":{"text":"The guys behind the counter make the place-especially Marvin. I have a secret crush on him","useful":0,"cool":0},"4LFLAtHJr3yfH9j8trSMFA":{"text":"The guys who work here are so nice! Everyone was kind and talkative. The food was gross, b","useful":0,"cool":0},"8YdSaJ9Sg_USC8hlSQ9o7Q":{"text":"Let me start by saying that I visited this establishment because they got voted one of the","useful":0,"cool":0},"i1j01Ywqn3eAm5nQzafw2w":{"text":"i work in the quarter and am so happy for  Camellia on chartres and toulouse!  Sneak off f","useful":0,"cool":0},"i7muo2Nzt7JYJlrhu2D8NQ":{"text":"I was just looking for a quick bite to eat before I got on the road and was pleasantly sur","useful":0,"cool":0},"NHTrubFVEYRe-OPzZu7J0g":{"text":"Like most restaurants known as \"institutions\" the experience tends to get a little tainted","useful":0,"cool":0},"Fvqf-Upau7QzX2PB3r6lrA":{"text":"Nothing spectacular.....save your money... Plus the food has way too much oil.... If you w","useful":0,"cool":0},"BU4rhvAEDIIU88Vtkt6CaA":{"text":"Camelia is one of my favorites, but objectively the food is not why people love to come. T","useful":0,"cool":0},"lKI7MsWrus0KOMOTFosWqw":{"text":"We stumbled on to this place while looking for breakfast. What a great deal!  This is the ","useful":0,"cool":0},"H_ooXLaG8IXDmhNRRPngrg":{"text":"Great food and service. You could be happily surprised at just what might happen during yo","useful":0,"cool":0},"xnddwY5S0Y-abjBMWzKpnQ":{"text":"The place was packed.....\nfelt like an old time diner (50s) so that was cool.  It was nois","useful":1,"cool":0},"JdE31k3QFDhAjarxj6woKw":{"text":"Loved this place! Cool, old-fashioned dinner with yummy greasy food. You order by checking","useful":0,"cool":0},"x8coAV-ymTFX6TO_lYWC9g":{"text":"Very cool place. No frills breakfast food. Coffee, eggs, waffles maybe. No alcohol - this ","useful":0,"cool":0},"8g4a4lU14OSqYUwbtR0JOQ":{"text":"This is a cozy little diner where the locals eat. It's nothing fancy but the service is gr","useful":0,"cool":0},"nWHEmxWOH8vdd7T5C4mllg":{"text":"This place was a true jewel after a night of drinking. I wish the place was bigger though.","useful":0,"cool":0},"eewb5y0nVPkPaJ2Qcm3wjQ":{"text":"WOW, I didn't know I like Pecan Pie that much until I eat it here. \n\nI came here on Sunday","useful":0,"cool":1},"SpewseNg68sVp3ESGXj64A":{"text":"Small quaint place, depending on time you visit there could be a line.  I went for breakfa","useful":0,"cool":0},"2hqGbp0UfgxfI_HI5Dj09g":{"text":"This is absolutely a MUST when traveling to New Orleans. You can take the trolley right to","useful":0,"cool":0},"d45NITC2VadIxhqCOzMyVA":{"text":"second time here. about 2 years apart. seems like new management. the logos on the cups ar","useful":0,"cool":0},"1Ok2pOEpCbKhCu9TJF-jyQ":{"text":"It don't get better than this. This food is out of this world tasty. I had the chefs omele","useful":0,"cool":0},"BU5Sn_GH0F_CtWXV0ciRMw":{"text":"OMG! We went for the pecan pie. It was grilled in butter on the grill to heat it up, slath","useful":0,"cool":0},"UluBrh238OVLH8X5SnX7IQ":{"text":"A New Orleans staple! Camellia Grill doesn't seem like anything too special, but it's the ","useful":1,"cool":1},"kR28I_muoQGwF4cO94Fwdw":{"text":"So much to say about Camellia Grill. It may seem like just an old, run-down restaurant, bu","useful":0,"cool":0},"o9t2WyZCJnbpEfb6NVLp0g":{"text":"Visited Camellia's Grill while in New Orleans for a work conference. We stayed in Loyola U","useful":2,"cool":0},"MH1T2l9G68nJhAyOAkjMjA":{"text":"The food was DEFINITELY worth the wait! Even though we had to wait 30mins, the food was AM","useful":0,"cool":0},"Fuo2Ig9VetBjyaFSOqHWww":{"text":"This is by far the best New Orleans diner. It is aneé Orleans institution open for generat","useful":1,"cool":1},"TEYLBEbRnLXpVZlIX_8p0A":{"text":"Love the people working there. They represent the best of this city. They are kind and do ","useful":0,"cool":0},"fDf2Bdka72XT-GXfqBQJvA":{"text":"I'm down with diners for breakfast, and fully expected a typical diner experience here, bu","useful":0,"cool":0},"DppOr-KTR-73BOEqpHbQrw":{"text":"Whenever given the choice of sitting at the counter or sitting at a regular table...seriou","useful":2,"cool":2},"3V8ll5Ae0eoqK6DnlYG4Sw":{"text":"So nice actually  sang happy birthday in a very New Orleans way.....staff is amazing.  Stu","useful":0,"cool":0},"GwZZMfVKsgAxzGw1nj6oeA":{"text":"Worth the wait if you have never been here. Long Nawlins tradition with terrific servers. ","useful":0,"cool":0},"DHCK09hw7Gu9pJLzlCDnJg":{"text":"This is really two reviews, one for the sober crowd, one for the lit.\n\nSober folk - you sh","useful":2,"cool":0},"1dG3Hlm_4fIufpsegDVVzQ":{"text":"Camellia Grill is a 70 year-old classy short-order diner, famous for its sandwiches, break","useful":0,"cool":0},"eQ7uiuhcDpKFPPf_p2KHmQ":{"text":"Still craving for this breakfast again. The best greasy spoon we have ever been to. A fun ","useful":0,"cool":0},"xwSSUWfY0IRbvfVP76hX-A":{"text":"A wonderful gem we tripped over once we road the St. Charles line to the end! Don't miss! ","useful":0,"cool":0},"vW7k_tnwcVqVegD2-bLqYw":{"text":"Been here twice before. I'm from NY where you can find legit diners all over town. Camelli","useful":0,"cool":0},"azP3MCFZDY7LOqQd2vrNrQ":{"text":"Food was very average, nothing special. Not horrible, not good. It's just around the corne","useful":1,"cool":0},"zrLHlPw52UN_hO5tNE91mg":{"text":"pecan pie with vanilla blue bell ice cream. enough said.","useful":0,"cool":0},"VMKqDAxcWD5bPzKCmPyFMA":{"text":"Unless you go at odd hours, be prepared to wait.  This is your actual lunch counter and ev","useful":1,"cool":1},"coHanh5QstGrKZUWcnYhEw":{"text":"Excellent food, service and atmosphere. From the moment we walked in until the moment we l","useful":1,"cool":0},"rUsiSpVFw6JKnpqIwnFrrQ":{"text":"It is awesome that there's a reliable place to eat greasy food on the late night tip here.","useful":0,"cool":0},"8BLUD9b2W2KX9Oxo4Z5ZLw":{"text":"Everyone was super friendly and the food was great. Great environment and really fast serv","useful":0,"cool":0},"nv2ZeuqYAbu0kzqJJyWtcA":{"text":"Fantastic New Orleans breakfast, I love the atmosphere and service. Portions are huge, veg","useful":0,"cool":1},"gbrxmuPdlKz6GCMERcyZWQ":{"text":"I don't understand the high rating. This place is very old and dirty. Bathroom is nasty, v","useful":0,"cool":0},"m_MC3K4gykcEktP-lAkwsw":{"text":"Deliciously New Orleans! Camellia Grill is a must go-to for anyone living in or visiting N","useful":0,"cool":1},"sw5qi1Vh0xDiaAci6rmARQ":{"text":"Historical and a good burger. The service was quick and friendly. Locals eat here worth th","useful":0,"cool":0},"iPqtzN0TKzUHPKHzTb_Vlw":{"text":"Came here because of America Horror Story, going back because of the food. There was a bit","useful":0,"cool":0},"xQaotnRCSnWPJ3dtxrXp2g":{"text":"This is just an old school diner that has remained virtually unchanged since 1946; which i","useful":2,"cool":1},"whSkodJDcc_K3eGDksigtQ":{"text":"I was super hungry when we arrived here. Waiting inside to be seated... The smell of the f","useful":0,"cool":0},"si9CGxDyxtvHr5i7j26gFA":{"text":"You can bet every time you come to Camellia Grill, you're not only going to enjoy the food","useful":0,"cool":0},"s-NgzcP3s6p30n57zQOd9Q":{"text":"My all time favorite greasy spoon. There's only so much you can do with waffles, burgers a","useful":0,"cool":0},"-3D4G0XG52u9O6FHH96DIA":{"text":"Camellia Grill is a perfect choice for that late night greasy bite to eat. Typical Diner f","useful":0,"cool":0},"gAsbK5U5rIq_wxzXIZZNdw":{"text":"I have some of the BEST Tulane memories from Camellia Grill! Hung over breakfast or burger","useful":2,"cool":2},"pEBcMFqNUTtNTm6L_a3vHg":{"text":"I thought I had written a review here before? I finally stopped in the Camellia Grill in t","useful":1,"cool":1},"GX8Aujx0UkTnKAGyJmirvA":{"text":"Pretty decent service and has that old fashioned diner feel. Food was a bit on the greasy ","useful":0,"cool":0},"ALK4BUFNYcf5fHVn8GzDYQ":{"text":"This is my type of place. It's not fancy, there's no white table cloth, and the food is gr","useful":2,"cool":1},"xCoKRZhMvOqLGlA65gZWAw":{"text":"This place is truly a NOLA staple, and rightfully so. The cooks and servers are the defini","useful":1,"cool":0},"Eb0a5T5dW_eUf63d7A9TxQ":{"text":"The Chef's omelet with chili is a must get! Terrific late night meal. Great meal, great se","useful":1,"cool":0},"cGjMY2i-QjvbUUgw_SCZFg":{"text":"A must for anybody that visits me. Great omelets and burgers. Can't beat the unique cultur","useful":0,"cool":0},"Weak8NtRDFX1dECCmU4kUg":{"text":"Amazing food, great prices! The power went out and stayed out.. The food was still prepare","useful":0,"cool":0},"x82sfhoMVJSDuUYI0-sZwQ":{"text":"I've been coming here since I was a wee tot sitting on my dad's lap. All the old crew is l","useful":4,"cool":2},"hMC-RK9OoXt1FAJNrS0AWw":{"text":"Probably the best breakfast I had while in NOLA. This place gets busy quick and the cooks/","useful":1,"cool":1},"vf6Pc1Adzt9VFgr0CJIeew":{"text":"Waited in line to get in for about 25 minutes. \"It's too hot for this!\" I exclaimed to my ","useful":0,"cool":0},"oUk2h-AhsceTeyogNSpc7Q":{"text":"Camellia Grill, I still give you five stars!\n\nYou are amazing. \n\nYou have melted butter in","useful":9,"cool":6},"wetRkNAI5DnbMKZDhFwWGA":{"text":"Abosute worst service. Had a to go order waited 10 minutes beyond the quoted time, which w","useful":0,"cool":0},"p7BzHA4r3HO5dZOAEtBvig":{"text":"Beloved by locals and open 'til 2am on weekends, I was drunkenly transported here by new f","useful":9,"cool":4},"msVP6bWnG4AZm1Elva1u_g":{"text":"The chef's special omelet was pretty good, albeit huge. I could not finish it. The grits w","useful":0,"cool":0},"XngdHPncss4f9MdOdypySA":{"text":"I was a regular when I lived in New Orleans. My usual order is a burger (with cheese, dres","useful":1,"cool":0},"P9PEf3dyNcNTAOS9ptEN6g":{"text":"Camellia Grill is small place with good service and good comfort food. I would definitely ","useful":0,"cool":0},"KdBZUu0Jcza1iadeikYCqg":{"text":"I live walking distance to Camellia Grill. Its always packed and there's a reason why. The","useful":3,"cool":0},"6WipZAXPNIT79Noc_Sqq-g":{"text":"This place was awesome!  At first it just seems like any old diner, but everything about t","useful":0,"cool":0},"rCoZMKvcjBEBXpLFpCY2Hg":{"text":"This place was a little far away from where we were staying but it was totally worth the t","useful":0,"cool":0},"_2NkAARFD8eYm3n-4zVB8A":{"text":"Staff and food are incredible. Staple of New Orleans. You can see tourists wandering off t","useful":0,"cool":0},"VIhwiDJp75xF5LHBfo6Mcg":{"text":"We came here based upon a recommendation from a friend and it did not disappoint! I got th","useful":0,"cool":0},"c4QfcZotW8ZmdlsE11xjcw":{"text":"Eat here and get the best breakfast of your life. Make sure the depressed white guy isn't ","useful":0,"cool":0},"2m3hjkm1UpMzb-FjwS56wQ":{"text":"Will not be back here again. I paid around 10 dollars for an undercooked, pink on the insi","useful":0,"cool":0},"ZQm-aEVvTqAcxJxPQWfQQw":{"text":"Amazing!  This place is just wonderful.  Totally worth the wait if you go during a busy ti","useful":0,"cool":0},"Snz8UbVYiHWijLSryIUl7Q":{"text":"Always worth the wait; and you will wait.  Once you're seated, though, you can pick anythi","useful":0,"cool":0},"qTaAlsbmpeS9LgWuPhvuQA":{"text":"I had a hamburger po-boy and some very nice french fries at an apparently rare event, an u","useful":0,"cool":0},"xqDJurW5wdrGyrQKBWBf6A":{"text":"Ok, this place was an experience. Food was good. But, cleanliness is an issue for me. Don'","useful":0,"cool":0},"BDtcLE_Rn8jugcYhYHQv5g":{"text":"I love this place.  I live down the street so I have to ration myself on how often I go be","useful":0,"cool":0},"QX7KvjvMLHWXS2zRe137XA":{"text":"The service was fast, the food was tasty, although next time I must say I would order diff","useful":1,"cool":0},"nvNiD53RDIWbGitjugE_cA":{"text":"Oh, the Camellia Grill...how I wish you were still open 24 hours.  Doesn't everyone need a","useful":3,"cool":2},"EpiX0fp9wIhEM4f24UzsPQ":{"text":"Addictive. Tasty burgers and onion rings and fries... I just keep coming back. \n\nIt's a sm","useful":0,"cool":0},"oHneozAdbvnDbcrmF2JVqg":{"text":"Still good 40 yr later. ..and open til 1200 a.m. friendly wait staff and cooks. Treat ever","useful":0,"cool":0},"JUrY1Dm15Fe_1qW_ejZ7AQ":{"text":"One of my friends is going to NOLA and I told her she must visit this place. I went Jan 20","useful":0,"cool":0},"lrKLBu99u2J-933CKLp6qw":{"text":"Great place for breakfast! They are really friendly, the food is hot and yummy and you can","useful":0,"cool":0},"LFcq7eKYB4ftqrtObw-rUA":{"text":"I hoped this authentic-seeming New Orleans diner was the right place to experience authent","useful":3,"cool":1},"VJvDYpHLYba0rM9VxroRMw":{"text":"Great place got to ask for Marvin. Love the burgers.   Warning u may have to wait.   It's ","useful":0,"cool":0},"7qGXLC6FAdi2uUcdIVa7PA":{"text":"So so so delicious!! I had a waffle and my friends had on letters. The one with corned bee","useful":0,"cool":0},"EEk_3oMsne-we8NMPZtAng":{"text":"Go.  Just go.  Wait if you have to.\n\nLine isn't so bad as it sees.\n\nOmelets are killer (we","useful":0,"cool":0},"dfOgp1LuTu1tj1B96y3vIQ":{"text":"Last meal in new Orleans and I wanted pecan pie. We came here, spilt a burger. The food is","useful":2,"cool":0},"AljkZB-T4qvyxhKEQAru2Q":{"text":"What an experience!!\nEating here was interesting in many ways! \nFirst of all the waiter wa","useful":0,"cool":0},"lyWD0rHOtOD6E5UTunUCxg":{"text":"Great location with extra points for being open late (until 2am Friday and Saturday!). So ","useful":1,"cool":0},"3_YwK8re5KPxHw2o6iYu_g":{"text":"This place is a popular \"lunch counter\" in the RiverBend section of NOLA. You often have t","useful":0,"cool":0},"XmE_-1PtmLRpBgvJfQU2sA":{"text":"One word AMAZING! Food is great and always has been great. Even before Katrina this was th","useful":0,"cool":0},"sXsEgmw5WOnYDYP6MWf6ag":{"text":"Our cab driver highly recommended we have breakfast at The Camellia Grill. So happy we fol","useful":0,"cool":0},"QcvumWrLJIRdsmw2XxAugA":{"text":"Loved this place growing up. Over the last year I have tried to eat here twice feeling sic","useful":0,"cool":0},"B5LvvJ8lLay1KI7iHqpxHA":{"text":"Classic New Orleans. A blast from the past. It's a must visit for tourists. However, bewar","useful":0,"cool":0},"0uPcGh2tr-V7IwfhguAC5g":{"text":"Been coming here for over 30 years and it is always great. They do something to their omel","useful":1,"cool":0},"zaxXCtGzaDq63ksv6n6cxw":{"text":"Amazing food. Ate here a few times during my one week stay at the quarter house with my bo","useful":0,"cool":0},"WNDGzORfATwgvQ5PYZEDsA":{"text":"Best diner in New Orleans.  Scratch that, best diner in all of America.  NO!  I will go fo","useful":1,"cool":0},"oZWTruXkzRe4bP8br2hP8w":{"text":"This was the best BLT I've ever had!! I love seeing young brothers hard at work.\nTo the sh","useful":0,"cool":0},"cIDyfge9jO7v5qK3REP9sQ":{"text":"WOW. This was my first stop in New Orleans and it did not disappoint. I wish we had someth","useful":1,"cool":2},"GjRN4mg6UlXZdMUIrgA2hA":{"text":"Used to visit camellia a lot in college. Things are still the same here. Chili cheese omel","useful":0,"cool":0},"-I6H7k_tq1q94yFBoXLTtg":{"text":"Best bacon cheeseburger!!! Bacon Cheeseburger goes great with a side of fries and brown gr","useful":0,"cool":0},"O_z9oqwd7vl7lNKdewCWqA":{"text":"Marvin is the best waiter on staff. The burgers are absolutely a great post hangover remed","useful":0,"cool":0},"hKZx2FeZpu9qNN0SpZHvLg":{"text":"RODENTS RIGHT UP FRONT!!!!  Unbelievably, as a New Orleans native I had never eaten at Cam","useful":0,"cool":0},"GVWBgu7PZAr26DE2Gx-Jyg":{"text":"Outstanding old school diner atmosphere. We had the chef's special omelette along with a p","useful":1,"cool":0},"FOWoT7sc6kDqKhDgYpkW5Q":{"text":"Never disappoints.   Wonderful food, service and other patrons make for the perfect diner ","useful":0,"cool":0},"5bxS61OqVmkyzi20-zu1vw":{"text":"Well I stumbled upon this place while looking for a quick breakfast. I was pleasantly surp","useful":0,"cool":0},"6gN8z82POBBzHevRCs3UyA":{"text":"Mmmm.  Omelette's juicy inside crispy outside.  Huge.  Pecan Waffle with plenty o pecans. ","useful":1,"cool":0},"cEDArSkb0dgI75aHXsyEZQ":{"text":"I have been coming here since the mid 80's and it was a cool institution and like so many ","useful":0,"cool":0},"QuH5Zk5ZD6HHdnDxII4oCQ":{"text":"After a rough night of moving heavy furniture this all late night spot was exactly the rem","useful":0,"cool":0},"Wq-rdUAzXlLLqQLFcRzFLA":{"text":"Still craving the delicious burger, onion rings and deep fried mac and cheese.  Service wa","useful":0,"cool":0},"T2riILWfSPuYzqJbkPbmtw":{"text":"Waaaay too expensive for the quality, and for me, too greasy to be enjoyable.  A lot of my","useful":1,"cool":0},"7x7s3HgsiH9mDBK8j5LofQ":{"text":"Double Cheeseburger, Fries, Chocolate Freeze. Counter seating only and if the line's out t","useful":0,"cool":0},"PNfCAnOXg1rD31u3M4V-_g":{"text":"We had a personal recommendation and it did not disappoint. The wait staff was attentive a","useful":0,"cool":0},"kwRpu66gQQDe380n6xpUyw":{"text":"If you like diner's this is a classic joint that you should visit - We took the cable car ","useful":0,"cool":0},"2ERUdLUxi39vwC1em8nRbg":{"text":"As good as ever. Everyone should eat here at least once. Be it for breakfast or late nite.","useful":0,"cool":0},"qVD5yCKJ5ZDirtntBPGEnw":{"text":"unfortunately the food is highly overrated. the service was good and a fun atmosphere but ","useful":1,"cool":1},"2wBlsh7gL9B1cE5f2UgGcw":{"text":"What an amazing southern diner GREAT SERVICE, AMAZING AND FILLING FOOD,and overall great a","useful":0,"cool":0},"zc8KMt3EqRMA9j24jvgmsQ":{"text":"After a long flight and a tough week of boozing, I needed some comfort food, and this is t","useful":1,"cool":1},"JGHSZgiqAqdX6w1ibXn6bg":{"text":"OMG BEST OMLETTE EVER. Our wait wasn't too terrible, and the food comes out veryyy fast. T","useful":0,"cool":0},"igm6Z5kOI50JfACTECo9RA":{"text":"Great home cooked feel breakfast joint. Food was delicious and the staff was on point. Noi","useful":0,"cool":0},"CsCbNpYz1Z1T9wM64arkug":{"text":"Off the chart food and service. Couldn't stop eating my one eyed buck before my cheese fri","useful":0,"cool":0},"zprPwCFmljeITerJ6eLMZA":{"text":"My two sons both study in New Orleans (one at Loyola University and the other at Tulane). ","useful":1,"cool":1},"aSPaCA3cT4Hi46zdbo7NyA":{"text":"Leon is charming and awesome,\nMy omelette was plentiful, not greasy and tasty, fast servic","useful":0,"cool":1},"-9k-C0Ap2hSBJL58kBBQaA":{"text":"The service alone is worth the long line. The cooks and servers were friendly and outgoing","useful":0,"cool":0},"h0wJ_y20VRhNDMoMdU_P3Q":{"text":"We came here on our first day at New Orleans for breakfast. \n\nIt's a \"sit wherever you lik","useful":1,"cool":1},"Aan_uoMoDO1tZXQuB5zYQw":{"text":"Get the grilled chocolate pecan pie w ice cream. Seriously.","useful":0,"cool":0},"AxOs3Q-aJ0XaMA5SRWeJrg":{"text":"We just got off a cruise and found this place on Yelp, so my partner wanted to try it.   S","useful":3,"cool":1},"FJwUjw3luzLExF7UPS7AMA":{"text":"Great food and reasonable prices - on my 2nd visit 10 years later!\nThe wait is too long!!!","useful":0,"cool":1},"ToJjhbrFxDU16NOQOfLg8Q":{"text":"Some of the absolute best cheap food in town. My friends always get the chili cheese omele","useful":0,"cool":0},"g-7Y_tg5oWar3N8AJCNZqg":{"text":"This is what it tastes like to ride into the sun. Both of the times I've been here, I've h","useful":0,"cool":0},"H4CwyM79UoCFFjKKtdLu2A":{"text":"i will not dwell on the obvious awesomeness of this place.  tip one: get a fried egg on yo","useful":3,"cool":1},"rod-WfilNijnx__g941FfQ":{"text":"This is one of those not-to-miss experiences in New Orleans.   Watching the folks behind t","useful":2,"cool":1},"830xhMnfGSTFwvfL31_XBw":{"text":"For us, a trip to NOLA is not complete without a meal at the Camellia Grill. We always sta","useful":0,"cool":1},"HHAPL1_KmFtmWvW4MWnFtA":{"text":"After riding the St. Charles streetcar for 45 min, this place did not live up to my expect","useful":0,"cool":0},"xvYUNC8EtX-_1CN76h1X9A":{"text":"There's no better treatment for a hangover than a good chocolate freeze and greasy breakfa","useful":0,"cool":0},"eWYD2Wyj_idL53mSw8dWUg":{"text":"Depending on when you go and how many in your party (the fewer the shorter the wait) waits","useful":0,"cool":0},"zwDX0X41uqoxb-rHsM7_kQ":{"text":"This place has gone down hill since my last visit. Service was good, food just okay. I hea","useful":0,"cool":0},"QhMFIaOFVz9wxG1tFtaRYw":{"text":"Thankfully there was no wait...Because as everyone knows, there is almost always a long li","useful":0,"cool":0},"TE0ZFKrAlprwaVimHJRTQw":{"text":"Let's get one thing straight, The Camellia Grill isn't for everyone. Part of its charm is ","useful":1,"cool":0},"XsVgyFTtReBd2buWhmBgQA":{"text":"Have to love this place for what it is. Great local diner that dresses their food in butte","useful":0,"cool":0},"8FoB5WDT8k5cGSTHKPF-FQ":{"text":"Service was amazing and the food was the best we've had during our entire stay in New Orle","useful":0,"cool":0},"6D5Yc_sXtRx2WVNijnLmgg":{"text":"Wow!! I was so pleasantly surprised with this place!! We went to New Orleans for the zoo a","useful":0,"cool":0},"B41wYMCjbp2spoutB6NTbA":{"text":"Two pair of old geezers dressed in tuxedos, walk into the restaurant about 5 minutes after","useful":8,"cool":6},"Lk3R3tbgltWjAn7qfmph_A":{"text":"The Camellia Grill (Black Pearl) ... a traditional diner with only counter seating. Very n","useful":0,"cool":0},"dc_tvYfF0_7aRTSSZ5qTvA":{"text":"Dirty! Dirty! Dirty! I was so uncomfortable sitting in the place, eating anything, or drin","useful":0,"cool":0},"da8AGpRNqUve4z_moOOW6Q":{"text":"I love a place that serves breakfast all day.  Nothing like getting a big omelet after a n","useful":0,"cool":0},"Dnsm77HccD1Mo3yZWWaUug":{"text":"This is a counter restaurant. You sit at the counter order eat and leave. Enjoying watchin","useful":0,"cool":0},"kv7DG5am134IGV_bgOml_Q":{"text":"Another amazing breakfast.  Worth the wait.  Every Jazzfest a must.  Gotta get the Pecan W","useful":0,"cool":0},"YvFxBwZxWjWw-6SJSt1zag":{"text":"I had an incredible time at Camellia Grill!! It definitely lives up to all the hype! I lov","useful":2,"cool":0},"X19ufH1PGtpGxzDLycxfrQ":{"text":"Top 3 breakfast experiences I've ever had, great prices, quality omelettes, interactive se","useful":0,"cool":0},"1OfUamYKcfPlwRmHlmjbPQ":{"text":"I have been a devotee for 45 years since I moved to N.O.  I love their cheeseburgers as we","useful":1,"cool":0},"rMkuAkPQfhff3cHLSaOPrA":{"text":"The Burgers were delicious and omlettes were light and fluffy!! I recommend the Manhattan ","useful":0,"cool":0},"wtmN7_XUhWM3tFhwCgmqYQ":{"text":"Worst experience ever!! I drive way out of my way at 8:30 in the morning for a bacon chees","useful":1,"cool":1},"z45GBIT-qxgrIc0s8hdVgQ":{"text":"4.5 stars\nMassive omelets. Great service. Very unique little place with counter-only seati","useful":0,"cool":0},"62wm4oZZ_3-o7WICxq_f-A":{"text":"Two words: hot pecan pie ala mode!!!   Unbeatable anywhere!   Re other food, your engaging","useful":0,"cool":0},"7uOB23l1EWY9Ma4cdm2iHw":{"text":"Breakfast was simply divine! I had the best bacon omelette! My husband had a vegetable ome","useful":0,"cool":0},"FxzU4RfOlKIUzSvcKCN-5w":{"text":"I give this 4.49 stars.  You go here for two reasons: you crave that greasy, lets-stop-the","useful":0,"cool":0},"KKCalZm6vaXfrS6fovRLnA":{"text":"A visit to New Orleans is just not complete without a breakfast at the Camellia Grill.  Th","useful":0,"cool":0},"udTgxtB-e7V9Y5DIK4ANFg":{"text":"This is no longer the Camellia Grill that Harry and Marvin made famous and kept you coming","useful":0,"cool":0},"7_07qk5DjyD-R_5t3P-EKg":{"text":"The food is awesome, and the atmosphere is very lively! Everyone is friendly (save the hos","useful":1,"cool":0},"sJQc3ufoiMdDC8ZZAvHkxQ":{"text":"I wish I'd found this place earlier in our vacation, because we ate at several overpriced,","useful":0,"cool":0},"In44348lu1LAYoQRcG93Yg":{"text":"OMG - I will cut to the chase.  Do not eat there.  My husband and I went to Camellia Grill","useful":1,"cool":1},"Z68_ACIbIWTn2G766qC6-w":{"text":"Good food and very entertaining servers! Fun place for people watching!","useful":0,"cool":0},"Mo17_W7CPNw32lRfVZbkgQ":{"text":"First ate here in 1986 and it has changed very little. That's a great thing in this case. ","useful":1,"cool":0},"nSta4PVEOXY2IMb7sq2Edw":{"text":"I wasn't very impressed, as soon as I walked in their was a odd smell, you can see the kit","useful":0,"cool":0},"vNj-gDlAAwNcgaRS0RWGKA":{"text":"My wife has been telling me about this place for years... says you can't get the 'real' NO","useful":1,"cool":1},"Z4Eia0vvCk1JPC-HEhQRFQ":{"text":"What a great local breakfast spot! The omelets are bar far the best choice when eating at ","useful":0,"cool":0},"TNydHqglDMBZ4oQgHy7k0Q":{"text":"Delicious and inexpensive! I only wish they had actual table seating so you don't have to ","useful":0,"cool":0},"dkRLoOlcVnWYuMGDb59SLg":{"text":"Loved this spot. Great diner experience: good food and attentive service. Though busy, it ","useful":0,"cool":0},"5CtuxCORiCFEo4UtO8oF8A":{"text":"Had to go to this place. It's one long, winding counter. So if you don't like to eat at th","useful":0,"cool":0},"d85s2O9wzIJm2-6ibW7oPw":{"text":"Really a great diner with classic fast and friendly service. Only counter spaces, but you ","useful":0,"cool":0},"lr0u2UVzV-DX1IKonsaFLw":{"text":"I went to this counter-service-only spot on a night in which there was a little bit o' dra","useful":0,"cool":0},"c_DySNtpIwOeNuH3yPQdMA":{"text":"I can't explain how much I love this place other than saying they understand when I want s","useful":0,"cool":1},"xM2KMPhnCeSVeRRw-OvE0Q":{"text":"Delicious and fun. Great place to get breakfast food/burgers anytime of the day. Atmospher","useful":0,"cool":0},"ucrQCt3TSjBEMjfgxDn-OQ":{"text":"This is a fun place to eat.  limited menu but great food, and watching the way everthing i","useful":0,"cool":0},"8FYqnXcvooNowSXwWtiPyw":{"text":"Loved it! Based on other reviews that I read, I was afraid we would be missing out on the ","useful":3,"cool":1},"Q4paCItxn0CzoUyeOs3LIg":{"text":"Okay, there is always a line outside of here and I have no idea why. I ordered a burger an","useful":1,"cool":0},"gPjck3c3usilAyRURZoXqg":{"text":"It was a good meal overall. The server forgot to give me the waffle multiple times, so we ","useful":0,"cool":0},"tGTpiEMSLgqydZAUOB6Mnw":{"text":"By far one of the best places I have ever been to eat! Not only was the food good but the ","useful":0,"cool":0},"cpr9UE1btb0daFVPfXsRFg":{"text":"Love it!  This has been a regular dive for me for more than 10 years, and for good reason:","useful":2,"cool":1},"5Ofop26sMcmVNP9zn0SaBg":{"text":"Ambiance here is old school, but cool.\n\nGrilled cheese...amazing!\n\nI liked how the head ch","useful":2,"cool":0},"AornmvZ7T6ciiOTpTqhBiw":{"text":"Every time someone from out of town asks me where they should go eat, I send them to Camel","useful":0,"cool":0},"V4UKJe75B_0LcqwYHfSciA":{"text":"awesome CHEAP food, great surface, and neat seating area (three U-shaped bar-style seating","useful":3,"cool":1},"NwlNhgbkebgR410Gz5AkRg":{"text":"This was my last stop of my New Orleans trip and my friends said it was a must! This locat","useful":1,"cool":1},"x4rlm5hq_lg-5plLkQ0WGw":{"text":"The best old school dinner in town. There breakfast is a stable in the city! Worth the wai","useful":0,"cool":0},"4xX2TKVJOxhXcXUkMxjsAg":{"text":"Always great service and food each time I go to eat here. I love that they're open late an","useful":0,"cool":0},"AkLQgxO0Wl8QECMWT0n9TA":{"text":"The chilli egg white omelette was okay. The omelette was plain and the chilli gave it the ","useful":1,"cool":0},"BQ-eEYd8uz13ub3MxVboCQ":{"text":"Camellia Grill has always been a New Orleans eating experience not to be missed.\nBest comf","useful":1,"cool":0},"k5k484fTIYYbciJw1T4WNg":{"text":"Amazing food, amazing service. I am from Los Angeles, and this cozy cafe was reccomended t","useful":0,"cool":0},"41a_6zYfjVso2NuvnFHFZA":{"text":"There is no place better after a long night of drinking or after you have slept it off and","useful":1,"cool":1},"Ca57L3A2x4-8HLz6Q1VQgw":{"text":"The Camellia Grill is a greasy spoon retro diner. No frills, no fuss.\n\nA plate of their eg","useful":4,"cool":1},"XWbICZmCbEeNwp2OaDaQqA":{"text":"Was here during Jazz Fest 2009.  This place is awesome!  Old style counter seating encoura","useful":2,"cool":2},"cMVZTqLgjM9M7sZ8ulboIw":{"text":"I imagine this is what real 'old school American' diners are like.\nSuper friendly servers!","useful":1,"cool":0},"wmTNdWzQZXxF6kNAJeGiVA":{"text":"I love me some Camellia Grill.\n\nIf you go on a weekend, you are most likely going to find ","useful":0,"cool":0},"bytnAOrWOD3q-xfK2XulgQ":{"text":"Uptown, how I love you! This location is setup just like the restaurant in the Quarter. Th","useful":0,"cool":0},"sF9uAmgbyPsD0noVocBTnA":{"text":"Damn good breakfast, simple as that. And you get to sit at a counter, how cool, right?\nYEP","useful":0,"cool":0},"SNctaqj-I1oiav_Xx8CX7g":{"text":"Wowza - Wonderful! Traditional breakfast - super nice wait staff. Quick, affordable and de","useful":0,"cool":0},"2EZqmUauW8qx6jBUGfcjIg":{"text":"We ate breakfast at the Garden District location in January.  I must give the 5 star ratin","useful":1,"cool":1},"cFRIZUqhAk9Pty-wDPeS8w":{"text":"This place was charming and delicious. Had an omelet and pecan waffle for breakfast- reall","useful":0,"cool":0},"v1HGc_skoftWChl1D0Eyfg":{"text":"This place is a landmark, which is why you will have to wait in a ridiculous line during p","useful":0,"cool":0},"altmXayuUxDnBNnw4egBcw":{"text":"Love love love this place! Found through yelp when visiting for the New Orleans Jazz Festi","useful":1,"cool":0},"NJhrYRCvpfUSVqXKcmXdKw":{"text":"Went their this morning and last night. Best chocolate freeze the best and the waitors are","useful":0,"cool":1},"hpFKF0wLNvxW9F5MbbrAjg":{"text":"We simply had to go here. It's an institution - or so they say. Turns out it was recently ","useful":1,"cool":0},"vwqIel2pdj8kUftbEEtnKg":{"text":"Went to Camellia Grill for the first time last week since August 2005 (a few weeks before ","useful":1,"cool":2},"8v4oZIY51g_59NmkfZNgxQ":{"text":"We took the St. Charles street car down here since it was highly recommended by family. I ","useful":0,"cool":0},"Q7SGfyzDar0D7XPylDBlcA":{"text":"First time visiting and this place was awesome! It's a very laid back homey feeling place.","useful":0,"cool":0},"wR5MoZcJo2oMdTM_XcvyUw":{"text":"this place is AWESOME!! the service is great. and the chili cheese fries are gooey yummy m","useful":0,"cool":0},"PSP1bTxY1YgyVIsRKlTqdQ":{"text":"The fluffiest, most amazing omelette i have ever had. Got it with bacon and cheese and it ","useful":0,"cool":0},"1nF3jiuwYgpQZgP6hh3nng":{"text":"I want to give this joint a fourth star just based on theatrics and service but I'm hard p","useful":1,"cool":0},"5ubvBeI0FqRo-kFI47Xe0A":{"text":"Went here yesterday and had a very delicious and exciting time.\n\nOne of the best places fo","useful":1,"cool":0},"_JJbq_RP-Wt7L5UbCxxZRw":{"text":"This place is right out of the 50's or 60's which makes it nostalgic.  The wait staff were","useful":1,"cool":0},"JH4_Y4tstgYM4IcOSx8qGg":{"text":"If you aren't from here, you might wonder what the fuss is about. It's just a lunch counte","useful":2,"cool":0},"Df6nNyUcno1qrMScii2cPg":{"text":"Leon was our server and he was great, making jokes and treating the ladies like ladies! Gr","useful":0,"cool":0},"kYfTXk6dIDW6yx198OdEQA":{"text":"Our friends Joey and Droze introduced us to the Camellia Grill on our first visit to New O","useful":0,"cool":0},"NmYPqahRjviFJTdvupImYw":{"text":"This small place is run by a small crew of guys in bow ties who have their operation down ","useful":0,"cool":0},"GANyehO5V8M1qo7ozFs0uw":{"text":"Stopped in after the Saints absolutely dominated the Eagles. Got a burger and a chocolate ","useful":0,"cool":0},"IvTmLC1RYmPTnlFHteAKbA":{"text":"This is a really cute diner with a family friendly feel. According to a regular, all of th","useful":0,"cool":0},"gscgU6CoQlYcQt8BwiamfQ":{"text":"Great filling flavorful food served by great gentlemen in bow ties and prepared by very pe","useful":0,"cool":0},"P4Ij5P_L7aaGAeVZ6GzoBA":{"text":"One of my favorite places to have breakfats in NOLA! Chef omelete minus the chili with but","useful":0,"cool":0},"RPOni1gqyKcLL9XLgUBBKA":{"text":"Quality of service and menu items has taken a step backwards from past experiences. I have","useful":0,"cool":0},"AQLeagVdghNIkH_B5gbObw":{"text":"Food is great especially when you are a tad drunk.  Milkshake was terrible.  Overall thoug","useful":0,"cool":0},"j8abvBSIJnZCYX8yFvYyBw":{"text":"I'm going to write a review for the Camellia Grill? That's absurd. You don't \"review\" The ","useful":0,"cool":0},"JRmS-P054vUMpQp3FGESYg":{"text":"Jerell made THE BEST \"heaven in a cup\" as he called it. Chocolate cherry freeze. Great foo","useful":0,"cool":0},"Z5VEgAacs7JMgSLNud5Opw":{"text":"Cheap, good eats. Could use some music, eerily quiet. Walk to the Bathroom is super cool a","useful":1,"cool":0},"V9zHaxsbhqB0cN3s7pQfNQ":{"text":"BURGERSBURGERSBURGERS. I am really surprised by the one start reviews. This is not a touri","useful":0,"cool":1},"0Iqj5zNc75JLn5Zloe2Rqw":{"text":"The food was great though not expensive but the atmosphere and service made it worth the w","useful":0,"cool":0},"BTJwJ0N3jA7nQ6Sp692qiw":{"text":"Visited years ago...again this weekend...as good as I remember! Had the Word Special Po-Bo","useful":0,"cool":0},"7sAmP0lXuvvjcbpEHxZOjA":{"text":"My five stars are granted on the basis of two excellent menu items not on most people's li","useful":1,"cool":0},"wdXUR7KRYtp4qM3y5EroPw":{"text":"Best meal ever in New Orleans.\n\nThe boyfriend and I took the street car and saw a line of ","useful":2,"cool":2},"r9vAiowgUVBTLUj_p-SQwQ":{"text":"I went here after a local friend referred me. I guess its a local staple so its OK to visi","useful":0,"cool":0},"NsfKe_QLu3I4mhIMI01CDQ":{"text":"Just...wow...Went for lunchfast and totally worth it.  They say there's usually a long wai","useful":1,"cool":2},"mZ6v8wZ3K3OJ56AZjd-Yxw":{"text":"Good breakfast served up fast by folks who have been doing it forever. Enjoy!","useful":0,"cool":0},"GYD9DhMP5jHMt0P3QbGEow":{"text":"Whenever we are in town this is the first place we stop. The food is always delicious, the","useful":0,"cool":0},"2egplpGDf2z5NeFUixJr5w":{"text":"Awesone place.  9 of traveling stopped here.  Dennis treated us all like royalty.  We all ","useful":0,"cool":0},"kZubnS12zPCEu0m89BMnXQ":{"text":"This place used to be an iconic greasy spoon great for late night grub when you've been ou","useful":0,"cool":0},"9l59y0z6xYRgMvV0F68Enw":{"text":"Leave the prima-donnas at home, this is a divey diner! The servers are ancient as is the d","useful":0,"cool":0},"3rNa9RhJk-tAgdndbXoNaA":{"text":"The Camellia Grill; this iconic landmark greasy spoon near Tulane has been grilling up bur","useful":0,"cool":0},"3XErn8K4-hC8EFUQrRSN2w":{"text":"I order a vegetable omelet tonight.  I did not order a vegetable omelet with cheese.  Acco","useful":3,"cool":0},"1gtyHlu4SDFmdZi1YypGSA":{"text":"Always a 5 food always the best food. Quick service. Who cares about the wait, it's Camell","useful":0,"cool":0},"5I6netXI7pNA7vFD9FXKqA":{"text":"We come here a lot for late night. \nGreat little place...reminds me a lot of a waffle hous","useful":0,"cool":0},"NolhgtHNtBJ4S4lcfBJu0A":{"text":"NOLA has several quaint and historical places to visit for breakfast. However,​ this place","useful":0,"cool":0},"bmpPgYAZbI0ikTByRTf6aA":{"text":"After a long trolley ride, trying to survive a hangover, we arrive at Camellia Grill.\n\nI w","useful":4,"cool":2},"tuDC-jEhb78ThfmlcA4R-A":{"text":"Classic diner food. Small place, we missed the rush by going around 1:30. Great burger. We","useful":0,"cool":0},"SaHvN5sABVHORemO7Iu4wA":{"text":"The service here is incredible and the breakfast was amazing. Truely my favorite local pla","useful":0,"cool":0},"T7ejn_m00_gxbfa4t1_cjA":{"text":"One of my favorite breakfast places in all of NOLA. The omelettes are delicious perfectly ","useful":0,"cool":0},"jjsLQ84moTywqOIurR2SIg":{"text":"Pretty good breakfast, laid back atmosphere, and decent prices too. I just had breakfast h","useful":0,"cool":0},"gC2rlutqIg7_7Qnzj_90lw":{"text":"Comfort food, pure and simple.  You sit on a little stool at a counter, where you are chee","useful":2,"cool":2},"68w5_yV8b1S35eCXSKgqpw":{"text":"Pros:\nChocolate shakes\nBreakfast\nAwesome staff\nPortion sizes\n\nCons:\nExtremely greasy\n\nBott","useful":1,"cool":0},"sag7ybqz9ek-RS3xi9AqIg":{"text":"A must stop when visting NOLA. Long line but worth the wait.  Thank you Camellia Grill.  I","useful":0,"cool":0},"ojH2ELSKnv6ri83F4C4s7g":{"text":"My big sister came home for Giftmas, and wanted to hit the Camellia Grill. I hadn't been s","useful":1,"cool":1},"PrNTSENToQ8vGyPAfyP4mQ":{"text":"This is the perfect place for breakfast.   We had seven in our party and it was a quick se","useful":0,"cool":0},"jTEX9rVeWgH4zIrhMch_XQ":{"text":"Went again recently - still a great experience.  Place never changes.  The Pecan Pie is no","useful":0,"cool":0},"mwM1CG-wS2pFfvM3ayPV7g":{"text":"Yep, another 5 star review after my 3 weeks in NOLA. I went here twice in 3 days for the b","useful":1,"cool":2},"0sv4qHwC2NpwpFTR9G6NnQ":{"text":"I have talked so much about this meal, my family is now making fun of me! I will dream of ","useful":2,"cool":0},"TR1CCj9dgEgEAWABZ-q08A":{"text":"If you starvin', go see Marvin at the Camelia Grill..  Eggs or burgers, he does it right f","useful":0,"cool":0},"E2QOGYwgMA-CZhFER6Ou_w":{"text":"Cheeseburger and onion rings were so good, 5 of us enjoyed our meal before our uncomplaini","useful":1,"cool":0},"d5GHxhyZgGDr13pdIh_YNg":{"text":"My mother and my father went to the Camelia Grill in the 1940's\nI followed suit in the ear","useful":0,"cool":1},"dP59EJIAaNf-bgBownILPg":{"text":"Traditional Americana Diner meets Classic New Orleans\n\nOne of the best features here is th","useful":1,"cool":0},"WWeAOhCjuw_h-DigxpCA_A":{"text":"This is one of the best diners I've been to, ever. When Guy Fieri frequented The Joint a f","useful":3,"cool":1},"lVldNXa_J3gDiQPaEdDrDQ":{"text":"Mostly a tourist trap.\n\nExpect LONG lines and a LONG wait if you get there after 9 AM on t","useful":2,"cool":0},"_uiH0e5auqdySgLgVuKayg":{"text":"Atmosphere is so much fun ... and the food is pretty darn good as well.  I had a cheesebur","useful":0,"cool":0},"N0X_QGVclOFN2qstTMdfkg":{"text":"My husband & I go there for breakfast to celebrate of our Birthdays & yearly Wedding Anniv","useful":1,"cool":0},"de4zLUM70OTOd0cXZunghQ":{"text":"We came late for a frozen chocolate and pecan pie. This place has so much character from t","useful":0,"cool":0},"EXKqGog8IZs-hP9Sk9DByg":{"text":"Their burgers are really small but delicious!!! The service there isn't too great but the ","useful":1,"cool":1},"6wBNgyYwAl3PJPLtIPvdvg":{"text":"My wife and I just ate at the Camellia Grill after coming from the New Orleans Zoo based o","useful":0,"cool":0},"WIF0iQyUTQQaIgaWcXyNkA":{"text":"My wife and I went here for breakfast.  Came across as a touristy kind of place.  It was v","useful":1,"cool":0},"sBODRTSEJgefNbYgieAnVg":{"text":"Great little old fashioned place near Tulane. This is a burger joint where you sit at the ","useful":0,"cool":0},"v5yU5klkjxOOL0vztNDDgw":{"text":"Neat little what-you-see-is-what-you-get diner that serves both locals and tourists alike.","useful":0,"cool":3},"OtG7kO4uoyBCnX9xbf97sA":{"text":"This place is for tourists. If you are a tourist, you should go, because it says so in the","useful":3,"cool":0},"aCXk8u6djOnLy5H4wspCNA":{"text":"Great service and food! We ate wonderful omelette for breakfast one day and later had burg","useful":0,"cool":0},"LvWx2ZtbnQXnjk8zxvFh4w":{"text":"An Uptown New Orleans staple. This is a great place to take in your surroundings. You sit ","useful":0,"cool":0},"Wb_DJzqy1QXWVJtI8li58w":{"text":"I have lived in New Orleans for 4 years now. And there are so many different diner places ","useful":0,"cool":0},"uTpQsjejt0YwvpDi1U3pMw":{"text":"Interesting place but I wouldn't go back. The bread was delicious, but overall just okay, ","useful":0,"cool":0},"nEDGSTe60aGBsqFGMmSYXw":{"text":"CHOCOLATE FREEZE\n\nNOW.\n\nThe food is good but not great, a wee bit overpriced but usually s","useful":1,"cool":0},"fmV7sGx-V_CWOtSw5vFhGQ":{"text":"this place doesn't have any actual tables it's just bar seating. So it's not great for a b","useful":0,"cool":0},"4uhS4qe8sw-Yk7ST2vG7PQ":{"text":"Basic breakfast. Big portions. If you get a high five from Marvin then your day is made!","useful":0,"cool":1},"9Wi4NTy-Zjhiv9_DVtIRRQ":{"text":"When Jimmy Buffet comes to New Orleans, he makes sure to point everyone here to get the oh","useful":1,"cool":1},"wslOVrFVaVVfVcfBeg6Nug":{"text":"I wrote a review of my experience here (less than a year ago) and it has since been delete","useful":0,"cool":0},"VuGAPKqVMAAnxIe1ms1zuw":{"text":"Great breakfast diner at the of the street car line catty corner to cooter Browns. Counter","useful":0,"cool":0},"QHJk3a75FI-EJZlHnjlGCg":{"text":"The restaurant was recommended by a coworker.  Myself and a party of two went to this loca","useful":1,"cool":1},"b9mXKT4KniZ3Y8TH8OXXTg":{"text":"Don't be frightened by the long line outside this joint! Go and stand in line, its worth t","useful":0,"cool":1},"dg5qqujFhotWOa0sivpKXg":{"text":"Totally awesome- very cheerful waiters-  made me smile a lot with the graceful movement.\n\n","useful":0,"cool":0},"zm4EdY1c5w4NCUaj0fR6OA":{"text":"This is a must try if you want that late night diner experience. Parking is a bit crazy bu","useful":0,"cool":0},"YaufGCUgyp_NFesSYpyVNQ":{"text":"Really enjoyed this NOLA classic counter breakfast lunch. They manage their line well, sta","useful":0,"cool":0},"5xp9d_E5AOr9Si2510JzyA":{"text":"This place is ridiculously good. The chef's special omelette is delicious, and way more fo","useful":0,"cool":0},"J14gimut69Jky4N_7XTImA":{"text":"Definitely a must try! The food was delicious! With the exception of the grumpy and unwelc","useful":0,"cool":0},"vjX1s4apLU_z6vj6H_rBFQ":{"text":"An old friend of mine took my college buddies and I to this place during Mardi Gras in the","useful":0,"cool":0},"3nv3GLVtuCcWLbcmd6nS3w":{"text":"One of the main reasons I'm going back to New Orleans in October.  (the first being to rem","useful":1,"cool":0},"WA-LC7Vb-w8conhbsKQNyQ":{"text":"I've only been here once, and the piece of coconut custard pie I had was delicious.  The s","useful":2,"cool":0},"8HLxagSJSGcXQtmbE-gifw":{"text":"people always talk about how chic fil a's service is unmatchable. oh honey. the waiters he","useful":0,"cool":0},"zsiH3lPTm1FuYv_iyNi2dQ":{"text":"My favorite diner. Fantastic omelettes and the best hashbrowns in the city. I particularly","useful":0,"cool":0},"bIAdyqeWspAestHsm7Q5ug":{"text":"We hit the one in the Quarter. Wow, the staff was super cool, we had Jack as our waiter. W","useful":0,"cool":0},"4jAk2FbJmixAVftGSCG0BQ":{"text":"This is one of the more fun breakfast experiences I've ever had. My BFF had been talking u","useful":2,"cool":0},"zt9LoxEqJMTij-AJIuXlsg":{"text":"A trip to NOLA just isn't complete unless you go to the Grill for breakfast - just take th","useful":0,"cool":0},"nFOZhoJzodIK5E6Gpi0APQ":{"text":"Breakfast done right in the garden district.  Great little diner with only counters.  Remi","useful":0,"cool":0},"Jf93uubfX2vT2Fwe-d4LOg":{"text":"Someone reviewed this place and called it \"a place for tourists\", and while this is true, ","useful":9,"cool":5},"3syjdH1GKllQM2Okj5KreA":{"text":"The pancakes are so buttery, absolutely delicious. Worth the wait! We had a group of 6 peo","useful":0,"cool":0},"YzLdMYNUIr5k3Rx6gGMhvA":{"text":"feels like youre stepping back in time at this place, a real old school diner. the layout ","useful":0,"cool":0},"l34ws66ZYMu9_XfI6tnIhA":{"text":"Well I was told to come here 35 plus years ago by my aunt and I just now made it. I've bee","useful":0,"cool":1},"_tVyeMai227aDwOe_klINg":{"text":"A family member from Memphis, TN recommended this place. Wow! what a great place to eat. w","useful":0,"cool":0},"VaBxELBXZDcQ7qgihGdw6A":{"text":"A New Orleans institution. So glad they came back after the hurricane! It's far better tha","useful":3,"cool":2},"v5N0sGB4sVaiiua1KDW8uw":{"text":"Nothing exotic just simple burgers, sandwich etc.  Fun atmosphere and \"interesting\" people","useful":0,"cool":0},"unnn8Ob55M1aENbAQhZ_XQ":{"text":"I have eaten here before and the food is great. I came back to town today and wanted to co","useful":0,"cool":1},"nNyGNMf2f9nsLOY34nICXA":{"text":"This was the final stop to our eat-a-thon of New Orleans.  Located uptown, it is located r","useful":4,"cool":1},"Id-7zpKIKwMPpPHuhIUITw":{"text":"I came here on the advice of my cab driver while on vacation.  I don't know how it didn't ","useful":0,"cool":0},"u9Q4ahku2fA11WZI6v1pfw":{"text":"Let's be serious . . .you really are not coming here for great food.  No.  What you are co","useful":6,"cool":4},"Pbb8H2v8vU5SO--rbmEwUg":{"text":"No matter where my family goes for burgers my parents always compare it to Camellia's burg","useful":0,"cool":0},"gG9dVIRBgkbBXEBcEbq4Rw":{"text":"This was the last stop on our New Orleans food tour.  We heard this place got pretty packe","useful":0,"cool":0},"VRj1ADTwjEhi7TJvOt9d-A":{"text":"A New Orleans Uptown Tradition for drunk Tulane and Loyola students, tourists and Sunday M","useful":3,"cool":1},"rRWQ6C_8kLTwJCGO-13ozw":{"text":"UPDATE: Not as slow the last few times and they accept cards now \n\nALWAYS SO SLOW when we ","useful":0,"cool":0},"iQPlPY0id50_Yd07D3tmSQ":{"text":"Saw this place on an episode of Somebody feed Phil. Said the next time in in town I'm defi","useful":0,"cool":0},"5bHoJlo_vyq0u0PNgz6Z-g":{"text":"Great atmosphere, extremely greasy omelet and potatoes. All gumbos are not created equal.","useful":0,"cool":0},"JXwlxcp851PdTHb470UQdQ":{"text":"A fun place! It was recommended to us as a must stop during our vacation. We were told the","useful":0,"cool":0},"32x9OjDHx-Seu_l_ew9zDw":{"text":"Fresh off my flight in a new place and guess what? I'm starving. \n\nThere wasn't anything o","useful":4,"cool":2},"v1bAwRyKZPPl8qFsEsAbtw":{"text":"All style, little substance.\n\nWe love the service, the architecture, the retro counters, m","useful":1,"cool":0},"1ga8l_e7ygvGQy_h4xPkRQ":{"text":"Good food fast. The service is very friendly. Prices are great too. The whole place is one","useful":0,"cool":0},"Dt8XFSlvUv86m2tRlw6kmA":{"text":"Camellia Grill is the definition of a cute little diner with to-die-for food. You might be","useful":0,"cool":0},"qWzJ2CYNZ2buL3IToCa6KQ":{"text":"Food- you get what u see so 3/5. Service from our friendly server -4/5 . Lovely old-timey ","useful":0,"cool":0},"VuN16mWOXaE5VophmJ7Seg":{"text":"What a cool place! Unique New Orleans feel at this no frills 24 hour diner. I went while s","useful":0,"cool":0},"Rg8rVtXYVZAfqwoHCaotug":{"text":"Oh how unremarkable Camellia Grill is. Whenever I need a good laugh I like to drive past a","useful":8,"cool":2},"2KGygt5T9clAIYv4MpgDmw":{"text":"Camellia Grill was my last taste of Nola before I had to return to NJ.  After the mayhem t","useful":0,"cool":0},"mlD2eE2pfXkh3n1mapArJg":{"text":"Horrible. Has really gone downhill in the past few years. Extra filthy. Cold food. All per","useful":0,"cool":0},"aR1hV-OeBrdEmBV1Ug0Keg":{"text":"The absolute BEST omelette I've ever had in my life. It  was just a plain sausage and chee","useful":1,"cool":1},"AVr95L2al6JX8xFSJc_8qw":{"text":"I think they serve nectar soda here. Nectar is a mix of almond and vanilla flavors and it'","useful":0,"cool":0},"HJdI5Fo-m39Phyhoc1LMJg":{"text":"Awesome service and even better food! I got the pecan waffle with bacon on top and it was ","useful":0,"cool":0},"M7XZg54VcTdvqz1f2RlLNw":{"text":"This is my go to place for late night eats. This place does get busy, but they do have off","useful":4,"cool":2},"FyRiHntFdJyB4baaydCh9A":{"text":"This place has a lot of character and the guys all have unique personalities. Each person ","useful":0,"cool":0},"nf9HnRiMZsBw3gOxuArBwg":{"text":"Standard American diner, with friendly staff. Ordered 2 Eggs and the Chicken Judges hot sa","useful":0,"cool":0},"tJaUk2aH09EN9bM89MvbdQ":{"text":"Terrible. Have fun with your food born illness. Cooks don't wash hands, wipe utensils on n","useful":1,"cool":0},"hpIU9fOE8zBqJq2Ia1XV_w":{"text":"I've been coming here for years (although it may be years between visits now bc Im forced ","useful":0,"cool":0},"OVbJmxbNpboJSe9exV5_AA":{"text":"AMAZING! The food was so so good, and the staff was very friendly. I will say, prepare you","useful":0,"cool":1},"kTw8P4YDSgefpSYnXB_7_w":{"text":"The \"Grill,\" as it is more commonly referred to by locals, is a welcomed sight (and taste)","useful":2,"cool":1},"skz6-5BYc6EHLl67eDxhDw":{"text":"Camellia Grill is a New Orleans institution. You feel like you stepped back in time when y","useful":0,"cool":0},"_HbB0QT-WnaGH4DgpouK2w":{"text":"Old timely diner... mostly counter space. True diner menu, breakfast anytime, burgers, fri","useful":1,"cool":0},"qc9d_oHM7a32qY2i5ne5XA":{"text":"Anew Orleans institution, The Camilla Grill is an old school restaurant with a serpentine ","useful":0,"cool":0},"B2s1jUJg_1EEGrl_il7_yg":{"text":"The service is quick and efficient and the menu is straight forward. You enter and are sea","useful":0,"cool":0},"q3tpmFGyRHTDp5IsiQx8hA":{"text":"First time back since Marvin \"Word\" passed. I've come here dozens of times over past 30 ye","useful":0,"cool":0},"B7R6m5R_GZNSvuMYL2vAhg":{"text":"As a Nola Native Camellia Grill never gets old. As always the service was great. I was sur","useful":1,"cool":0},"OsP-OGyPH1saTvbY5Az7sA":{"text":"This place is the bomb! It's all about the atmosphere. The guys behind the counter put on ","useful":0,"cool":0},"ffA6pApfMv6_AkwKDOHNgQ":{"text":"Made a visit the other day for the first time in a long time. Wanted to see what was simil","useful":4,"cool":4},"lsydXi-264rIrfUb8oyY-w":{"text":"Best omelette ever. Worth the trolley ride which is fun anyway. Add jalapeños to the veggi","useful":0,"cool":0},"TcolBE3pQIDg9DHp_9FzSw":{"text":"Love this place. Always a go to when we are in the the Garden District. Good honest food f","useful":0,"cool":0},"9Grz-79nYLpP0Xp2062pYQ":{"text":"A local friend told us about this place and it definitely should not be missed.  Fresh and","useful":0,"cool":0},"vl8MUsLP_ibAGGDDb77-Gg":{"text":"Food was great here. Per Yelp, I got the Juju Julu omelet with the grits. The grit, I swea","useful":3,"cool":0},"OURFmjIe_10B-oQ556_6xQ":{"text":"Never had a bad meal.  I used to go here with my folks after a full night of drinking with","useful":0,"cool":0},"OhGKPIKraQExDEjF-Pdl2A":{"text":"If you haven't had camellia grill, it is a must try. It's also I nice experience as well. ","useful":2,"cool":2},"6efpenz_E2D20jJoRQeXOA":{"text":"Hmmm... I have no review for Camellia Grill? OK, I must alleviate that post haste! I have ","useful":4,"cool":1},"dvMWVZ2sQIqeMptYuRr_uw":{"text":"Great Atmosphere....Super Busy but its a cute diner.... The wait was about 30-45 mins, how","useful":1,"cool":1},"051Qn12m-XQvCm4iTk1wCA":{"text":"There are two locations for the Camellia Grill, but I have never been to the location in t","useful":1,"cool":0},"DHfWL5UPiE7OTLipMUEYkA":{"text":"Family and I were touring Audubon Park. We ran into a local who recommended this place. We","useful":0,"cool":0},"ZNT79T37-6Td9qTu7dFK1g":{"text":"Good diner chow at a New Orleans institution. I'd suggest you try somewhere else for peak ","useful":0,"cool":0},"PcC-jIoZBwIrvMLFGkTKNg":{"text":"99% of the staff seemed lovely and friendly and kind but the asshole at the door and his t","useful":0,"cool":0},"uBeK8l1Qf6fOaSdLhp5Zrg":{"text":"Stopped here for lunch, my co-worker suggested the cheese fries with roast beef gravy. I c","useful":4,"cool":4},"Et3mKe5DsRwXInMd8qBolQ":{"text":"This was not the place I remembered and loved. My husband and I were visiting from out of ","useful":1,"cool":0},"Up43f8JRKFGXNHtgeSpLWQ":{"text":"I absolutely LOVE the muffuletta and service. They are extremely nice and always close by ","useful":0,"cool":0},"KArpB0KFESIcPmVioMOosA":{"text":"This place came highly recommended and it didn't disappoint. From the moment we sat down w","useful":0,"cool":0},"j1xeMoBijGRaolFSZ_PVjA":{"text":"Kk Iyar  IM u mm nuy jimk has always l  I u the I'm under yet I uuuuu  I'm kkk jk the krlk","useful":0,"cool":0},"MQttCcCmyvJl-J2Z4l2Qtw":{"text":"Loved loved loved this place!  This is an all counter seating diner with great servers/coo","useful":4,"cool":3},"7V399bWZws4HQN_KIq95dg":{"text":"Best burgers, old time diner with such great  ambiance, hope it's around forever, dependin","useful":0,"cool":0},"iC-z--PjLFxXprYGKAREDQ":{"text":"File under institutions.  Also file under better experienced when there is no line as wait","useful":2,"cool":1},"bd14Qo_l8VJh1-KfTmz7Fg":{"text":"Camellia Grill is the type of diners you see in the movies.  The atmosphere here is an ove","useful":1,"cool":1},"eZn0mMq33hYI4ymAjrjjjg":{"text":"I haven't been here post-Katrina, but this was my all-time FAVORITE place to go after a lo","useful":2,"cool":2},"Wvkui6mOWd7B51s3ilUXFw":{"text":"Another amazing culinary experience in NOLA. This is the only place that has properly pull","useful":1,"cool":2},"TwA5xlJR7CyXoy5hP6IUiw":{"text":"queue up for this newly reopened (1.5 plus years after katrina) new orleans old-school din","useful":0,"cool":0},"BRwGRWib8-BKyhp4A7vAkQ":{"text":"Three stars only bc the staff was awesome\nFood just wasn't good at all. Way too greasy","useful":1,"cool":0},"JGUiwJDxnFoT3ux4SeMEXQ":{"text":"A friend who went to school in the area insisted we try the Camellia Grill, I just wanted ","useful":2,"cool":0},"WxEAVyfNeeVFdG6zo6P9UQ":{"text":"This place is oh so good. My best friend introduced me to this little spot back in 2011 on","useful":1,"cool":2},"5sag2m_43i_rb37i8k_Jcg":{"text":"Talk about a place that had its ups and downs, one of the great eating instutions in New O","useful":2,"cool":1},"iiJyP7YOyxRAeJiTIGCuZA":{"text":"First food stop taken in New Orleans. I ended up ordering:\n\n1. Combination Baked Ham And C","useful":0,"cool":0},"xepFHRi9SeIPgn2hrpz8kA":{"text":"Celebrated the start of my birthday celebration at one of my favorite places and as usual,","useful":2,"cool":1},"ALegOUOazVB3GcOoXAvj7g":{"text":"This was our first dining experience as tourists in NOLA and we weren't disappointed!  \n\nI","useful":1,"cool":0},"gdXLa51pnpLkkdzgzijjQg":{"text":"Was it worth the wait?  I'm not exactly sure.  Marvin, the waiter, is definitely a lot of ","useful":2,"cool":0},"_RzOp5zjLQb1vhomwi8QEQ":{"text":"Amazing diner.  Felt like a local spot.  Service was aggressive but on top of it.  Amazing","useful":0,"cool":0},"mZ50V_IvjgO1zK-2owQafQ":{"text":"ALWAYS SO SLOW when we go in for to go milkshakes and are obviously just standing there wa","useful":0,"cool":0},"V-5YCZ2mzuaTDk1TXacF5Q":{"text":"We had a great time at Camellia Grill!  The food was great! The people were wonderful!  We","useful":0,"cool":0},"hCin5sN5quPR16VLbPFOBg":{"text":"Late night food... This is my spot!\n\nIf I'm craving something to eat around 10 or 11 more ","useful":2,"cool":2},"dFcYB4w4ZpLou9-trYg3ow":{"text":"Loved the Mexican omelette! Yum yum. The staff really make the experience worth it. Super ","useful":0,"cool":0},"zoBBynyCx0Eqyu_EcMepSg":{"text":"The Camellia Grill is a New Orleans institution. Most of my experiences, including my most","useful":10,"cool":2},"ctYtr59egY9tHgxjAuJyQw":{"text":"What can I say that hasn't already been said? The place is an institution and I've been go","useful":0,"cool":0},"fLIWk2e-gZ16B-y0xQCEwA":{"text":"Finally made it to this landmark after all these years.\n\nPerfect spot for a late night sna","useful":2,"cool":0},"deHclajo6o4gH6Do-OBIOg":{"text":"After a late night out in New Orleans, this is the place to get your greasy hangover cure!","useful":0,"cool":0},"J-OR0XhnR8NZHJTIQcaNPw":{"text":"Diner food and seating style throughout. Best pecan waffle I've had.  We also ordered the ","useful":0,"cool":0},"-7o8j-XnQTLg76Dfxr1qqg":{"text":"I order take out, the lady on the phone was curt. I figured it was part of the diner charm","useful":0,"cool":0},"4jMGBb8gAGX2cFxHHJTmpQ":{"text":"Come here if you want to fill your stomach with soul food and leave wanting to take a nap ","useful":3,"cool":1},"pd0s2dMqgCWsk72jGHyBOg":{"text":"We started off on the right foot when our server Will made some recommendations and then g","useful":0,"cool":0},"qXhsamalKHWklYtCwKP03A":{"text":"Classic diner open since 1946. Had cheeseburger, Reuben sandwich and fries. One would thin","useful":1,"cool":2},"D6SljIck3h1h-9vgKku7kQ":{"text":"Lady working the register was on her cell phone laughing and chatting with someone who cle","useful":0,"cool":0},"kSnxMBVM2TGBrxK368qkAA":{"text":"We stumbled by this place after taking the St. Charles Trolley/Bus to view the nice houses","useful":0,"cool":0},"wwaXXDsGE45LsDYi2euVCQ":{"text":"I will stop by Camellia Grill when I'm heading home from hearing great music at The Maple ","useful":15,"cool":7},"4YwxKq-TBB_81yLem4vt1w":{"text":"It's not the same as I remember it but that's ok, I had a good eat & the people that are t","useful":0,"cool":0},"Sbi6qVLJ7ur5h6HkwlcE1A":{"text":"good food and friendly service.  we got there just in time when the line was still short. ","useful":0,"cool":0},"GWS84R8TZvl6U6qSHUWXAg":{"text":"Got the chili cheese fries recommended by the chef- because I wasn't able to finish a full","useful":0,"cool":0},"DoGG-xR2KQdhOPSxg79mvw":{"text":"Dirty place. Cash only.  Greasy food.  Chile for chile cheese fries comes out of a can.","useful":1,"cool":1},"CczXsFBPLrXAAQ36NN7EAg":{"text":"I love this little diner, from the servers to the cooks to the food, everything was great.","useful":3,"cool":1},"ixLwtYIaO1k_5d6ClfNI-w":{"text":"First, this no diet joint. With that said, they are open late and the perfect place for a ","useful":3,"cool":3},"ARRDyzhxkU01XVUK-VdECA":{"text":"Great diner just off Chartres St. It was busy and the seating is two U shaped counters but","useful":0,"cool":0},"ZJhljDRfbrW1or8td9l5Wg":{"text":"this was one of the best places to eat pre-katrina. it was close enough to the tulane camp","useful":0,"cool":1},"LCHALAjzxgTACR49DRK_zg":{"text":"The food is okay the young lady at the door is not sure what her job is the restroom is ve","useful":2,"cool":1},"Xn5HuT15Sf7XBAeUQOgY-w":{"text":"Haven't been here since I was 12 in 1982.  Still remember the delicious pecan waffles.  Th","useful":0,"cool":0},"NdZhVbRSBMXNQpuAKQXnBQ":{"text":"While this is definitely one of the more touristy restaurants in this part of town, Camell","useful":0,"cool":1},"PgIpS9ddtpPa8cEFth7upA":{"text":"Adorable place with outstanding service. \n\nThis place is a blast from the past and authent","useful":1,"cool":2},"Fvfp0OP-UxUnJDBDFpKWMw":{"text":"Anyone who doesn't give this place 5 stars is someone who doesn't understand New Orleans, ","useful":1,"cool":1},"sWdasfU5uukcI1YSaZ9iBg":{"text":"Old New Orleans diner. Sit at the bar service, which is excellent.  Great food.  Large por","useful":0,"cool":0},"c3zElUVZ-VUi01iNX4Nq2A":{"text":"This is a must visit if you're in New Orleans/ uptown. The service is absolutely out of th","useful":0,"cool":0},"jdJwIGeW0th_5F2C3B1vlA":{"text":"Camellia should the first place on anyone's list wanting to get some true southern feel go","useful":0,"cool":3},"Uft2P8vMeZB8bJvK9pzEag":{"text":"Delicious food. Absolutely add the chili on everything. Service was great and staff were s","useful":0,"cool":0},"OFLI4fzr7Y2DJdCj_HMB1A":{"text":"I met my future wife here in 1987, so we were excited to return for some nostalgia.  Our m","useful":0,"cool":0},"24RmD4N7x2UguIrpLY8W7Q":{"text":"I've been going here for 50 years without a second thought. My recent visit was disappoint","useful":0,"cool":0},"o4WttS5wq6ZMk_uvEHmc-A":{"text":"Came here while on vacation because I was told it's a must! It was packed which was a good","useful":1,"cool":1},"fYAgjAtuor547YTrXTZG1Q":{"text":"I get here and see we're supposed to wait for half an hour or more for a stool at a greasy","useful":1,"cool":1},"2wNPJ0sH9XBrb7uvsjiUdQ":{"text":"We came here at 9:30 AM on Saturday since the furniture store we were heading to wasn't op","useful":3,"cool":0},"jGGNbzumba4Ac0CWB2qKsw":{"text":"I'm from LA and the times I've come to New Orleans I always make sure I stop to by to grab","useful":1,"cool":1},"NZiNNIg1hth5LA5Jvr8JlQ":{"text":"Camellia Grill is a New Orleans standard that has weathered the test of time. It has becom","useful":4,"cool":3},"9FufRrDRrCLonkBiaXEMJA":{"text":"The best experience in NOLA. If you have never been here it's a must! I was here 25 years ","useful":0,"cool":0},"9U7XvPbeqm2FjE2FqocKRw":{"text":"Camellia Grill is a little piece of New Orleans history.  Expect great food at low prices.","useful":1,"cool":1},"OVfFMEHm42JvDXnHMY4S1w":{"text":"I returned here late night on 4/18/08. It looked like a different staff than they have had","useful":1,"cool":1},"dIwcOt-66QeQzb5ozTQ8Gw":{"text":"I just got back from my first trip to New Orleans with a friend of mine who knows it like ","useful":1,"cool":1},"lFJ6AKYzIqpioJobGYCK8w":{"text":"This was one of the cleanest and  best places in town until the present owners took over. ","useful":3,"cool":2},"l6enoWAn-jKpdjuYBPikrQ":{"text":"Always great here\n\n\nWe love coming here and it's great to meet locals. \n\nWe always recomme","useful":0,"cool":0},"X--IL7fh5w890eqC3E5a8g":{"text":"Perfect dinner! Better than I Hop, Waffles House.. etc. exactly what you would expect from","useful":0,"cool":0},"P1DrmqqvioYIIVT88X3qww":{"text":"Best grits on Earth, hands down! Quick, ultra-professional service, tasty food, and a real","useful":0,"cool":0},"hdj7qJBmQ07zQZy4kyHLKQ":{"text":"I've been here before and had to take my kids again to the iconic hamburger bar. But sadly","useful":0,"cool":0},"f8aElWEYPRqqM04n4yzEMQ":{"text":"Awesome place! Very attentive and the food was fantastic. Pecan pie was the greatest I've ","useful":1,"cool":0},"TBgDZRDzZGIqXyCR_ePtMg":{"text":"Well we went here about 20 years ago and had fond memories of taking the trolley to get he","useful":0,"cool":0},"AQDgeP612H82v3W8MQr4JA":{"text":"If you want to keep it simple, this is the place. We ordered cheeseburgers and chocolates ","useful":1,"cool":0},"sk2QjZNKplJiJW8661-6AQ":{"text":"We had a nice breakfast here of bacon, grits, eggs, and toast. I'm a lover of breakfast fo","useful":0,"cool":0},"Nw8rdWAgvokerKUrJfE-FA":{"text":"The Camellia Grill was by far the best meal I had in N'awlins.  This is a great breakfast ","useful":1,"cool":0},"zIgrZplaBA7yeDLdmwIkNg":{"text":"We LOVE this place for a great pecan waffle!!   We frequently come here after church and r","useful":2,"cool":2},"aNjBLGcBuYs2uEDqMcIfEw":{"text":"I lived in New Orleans for three years & left in 2000 before Katrina took out much of the ","useful":1,"cool":1},"8IuGFYNrCYrXIrvN7Xy0HA":{"text":"It had been years since I've been to Camellia Grill so recently I made my way back there. ","useful":0,"cool":0},"q3DqGk2De7GojUe89WUHsA":{"text":"I've reviewed my fair share of places on yelp and I think I can count on one hand how many","useful":0,"cool":0},"Rsa3ujWfmx-XhjlG61YDJw":{"text":"I always get the chef special omelet I have been for at least 10 years I usually eat here ","useful":0,"cool":0},"yPSbrUnup97q4ZKrL0OdoA":{"text":"Tl;dr A classic American diner -- I don't really see the hype, especially since the butter","useful":0,"cool":1},"KYjwGWsfMqUh-YcnvjVSKg":{"text":"Hubby and I are back at it !!!!!! Service and food was good .Quick bite to eat for lunch .","useful":0,"cool":0},"QTLbW7f20wU6u9l6TcxnIA":{"text":"You really need to visit this place when in New Orleans. The best time to go I think is la","useful":0,"cool":0},"Hwnj5WaWDZWMlPP2znRbkg":{"text":"It's a greasy diner and my husband and I love it. The food is cheap and satisfying. It's a","useful":0,"cool":0},"N0-s7s16uVW2IyEX_jCd0A":{"text":"Have you ever wanted to watch a short order cook make a eight different omelettes all at t","useful":0,"cool":0},"R6X0HlLwUEVnt7fn_-Rpig":{"text":"Love it!  A time capsule of an old-fashioned diner with incredibly fast friendly  service.","useful":0,"cool":0},"Ah7Qo4nLiAecGVWHElEu0Q":{"text":"There might be a line, but try anyway. Diner-counter style set up for a quick turnover. Wo","useful":0,"cool":0},"tRWIa8Mlnu8YZFsY1L06oA":{"text":"I was highly recommended to come here for breakfast and I am so happy I did! It's very sma","useful":0,"cool":1},"XzgvzxXTb5WaNTnLCUyIfQ":{"text":"Remember eating at your friendly neighborhood lunch counter?  Neither do I.  That is why I","useful":0,"cool":0},"WIlfeHHBDExE81YGCZMCtw":{"text":"By far one of my favorite places to grab a hamburger or an omelette for breakfast. Staff i","useful":0,"cool":0},"y6yv3MAM0vY_0DWJb039WQ":{"text":"A very fun lunch spot.  Set up with seat yourself counters, this place has a fun vibe.  Se","useful":1,"cool":0},"pbY49WxkqseoxibvuaNfYA":{"text":"Chefs special omelette was amazing came within 5 minutes of my order. The Banana pie was f","useful":0,"cool":0},"r0nk4WYlGmcXG7U1BTixFA":{"text":"Sooooo GOOD! I never have had a milkshake at breakfast, but darn, I will again! The atmosp","useful":0,"cool":0},"RlG9JXpgyIIbHPlDIQbsCA":{"text":"I love Camellia Grill!!! this place represents New Orleans so well.  The staff is so fun a","useful":4,"cool":2},"UYFpHineQdq2-4OLHPg7VA":{"text":"I love, love, love this place. The space is so cute and quaint. I love the counter and how","useful":2,"cool":0},"ODLvJqKgnRFkPUjKPqPSdw":{"text":"If you want great food, the best service, and all around a good time come to camellia and ","useful":0,"cool":0},"p0ejYn3BWqpYhRLav3hmpQ":{"text":"Great service and amazing food!! Ordered the waffle and bacon! Omg!!! I could eat that ove","useful":0,"cool":0},"nwSMMjX9GkSTtBc4p9zBKg":{"text":"This place was delicious and service was great! \n\nMy husband had the special, which is hug","useful":1,"cool":0},"jmCQntGxZIspvelGFo2GCg":{"text":"Best \"Breakfast\" burger everrr! Thanks, Will for being awesome! I ordered the bacon cheese","useful":0,"cool":0},"_7R0jIPu76yhjarF7Ho8BA":{"text":"This little gem in uptown reminds me of a Waffle House. The service was superb & fast! As ","useful":0,"cool":0},"_ciWoOo34umEfDBcDX9B_A":{"text":"One of the many fantastic historic staples of this city's dining experience. \n\nGreasy spoo","useful":1,"cool":0},"_aydk0bheLQdXziSbPKkLg":{"text":"Love this place. I love breakfast and I love this unpretentious, eat-at-the-counter, greas","useful":1,"cool":1},"nU9oMt3FPCQBqJXLxV4wpA":{"text":"Always good friendly service. Nothing fancy, just good omelettes and other food. Good for ","useful":0,"cool":0},"OHuCsjr-w7vdlCvWXAUACQ":{"text":"This place is like home away from home for us we eat here so much while visiting New Orlea","useful":0,"cool":0},"b-QU00pHM9UYsGHbVvXbkg":{"text":"On the advice of a friend who is also a local, we jumped on the Green Trolly at Canal St a","useful":0,"cool":1},"v4J9G4pT9FbSEtoRpFQkXQ":{"text":"I've been coming here for over 30 years. And it is awesome. There are so many things I lov","useful":1,"cool":0},"36xGA_wWE1shtwhXIgF14A":{"text":"Very mediocre food..Maybe back in the day it was something to rant and rave about but now ","useful":0,"cool":0},"5JNxFW_y6lFUtpm6VNqUsA":{"text":"I go here often because I live in the neighborhood. But DONT ever make the mistake of gett","useful":0,"cool":0},"uxqG6NwjdqWU-rw_c__d6Q":{"text":"Ordered a burger for pick up two days after they reopened. They where still trying to figu","useful":1,"cool":0},"in9KEWdTQn3y4-9Ufj79mQ":{"text":"Great service and food! Had the one eye buck burger and Mac bits definitely a great greasy","useful":0,"cool":0},"uWoDPaLhSL9babR8T4URHg":{"text":"The woman host was so nice, felt like I was talking with my cousin. The waffles, pancakes,","useful":0,"cool":1},"dFXjVrzKqEQySX3_BsmAwg":{"text":"I had the Mexican Omelette which was ok but I could not get past the flies...so the one st","useful":0,"cool":0},"W7x8QWvrInfzRMKwJrX80w":{"text":"I love Camellia Grill! I have been going here for years, and I have so many fond memories ","useful":4,"cool":3},"l1r5OtX_E98nPruXRC5bJg":{"text":"I hadn't been here in a long time but recently dined in.\nI was suspect of the cleanliness ","useful":3,"cool":1},"6HBcL1RQe0BmZ_9-30dE9g":{"text":"I decided to try a new restaurant in the area, big mistake. I walked in and sat down and w","useful":0,"cool":0},"rPc0Bdmox4a6oxHruNMxdw":{"text":"Chocolate cherry freeze, please!\n\nOkay, if you're a stickler for cleanliness, this is prob","useful":8,"cool":4},"wpr1edBxYXY57QAH7hc_uw":{"text":"Best place in the whole world! The burger was so good I came back the next day for another","useful":0,"cool":0},"8baWxk6OsLkeUH59ZnBMBQ":{"text":"Classic and reliable. Always a must on every visit to NOLA. Right on the streetcar line, s","useful":0,"cool":0},"9PfKHTjg7Bnj5qtTWNyxEg":{"text":"YUM!! My mother lived uptown twenty years ago and referred us to this place for an awesome","useful":0,"cool":0},"ozxTHtKANZxx4rS5pVH3Gg":{"text":"I can't find enough good things to say about The Camellia Grill! One of my all time favori","useful":0,"cool":0},"Sgv9TYSehRASvYLv78HEUg":{"text":"Best lil greasy spoon in the N O. Chili cheese omelette a gem. Good place to eat casually.","useful":0,"cool":0},"yxLs7DiKX2JeR_PkI-okSw":{"text":"LOVE this diner. We went for breakfast a few years back (I have scoured the web to find th","useful":1,"cool":0},"9DhDd4uPpKEKVupIFOCbmA":{"text":"I've been coming here for 43 years and never have I had such a disgusting breakfast. Cold ","useful":0,"cool":0},"UK4HTC7iIEajqerC7kJdfQ":{"text":"Got the warm pie with ice cream on top and it was 1000000 (a million times) better than th","useful":2,"cool":1},"gPO6Hml2cjEhxGRwuQsTDQ":{"text":"If you're lucky enough to be in NOLA, hop on the streetcar and head down into the Garden D","useful":4,"cool":1},"8ADYtA6EENKIgqMDwD5g7A":{"text":"Forget about the fries I mentioned previously and go straight to those delicious burgers!!","useful":6,"cool":1},"zFzw-1JnHV-yl0F3mmX7lg":{"text":"This morning I got a Rano's omelette and coffee.\n\nI'll start with the cons:\n- It is soooo ","useful":0,"cool":0},"SK02DwNQNiCpRy9ZODpA_g":{"text":"Old school spot with super kind staff. Low prices and large portions. Nothing reinvents th","useful":0,"cool":0},"Pkhj8HmnK3d4mplf-a0vCQ":{"text":"All of their food my family ordered was excellent.  Service was pretty good.  This restaur","useful":1,"cool":1},"hpXODbORV3dKI5W0EdIYzQ":{"text":"This is why I hate Yelp. People gave this place 4 stars so we went to check it out. Food w","useful":1,"cool":0},"TZvF0oYvvO_kooBDtbFQIw":{"text":"Amusing time here as someone with a birthday came in and the workers had everyone wish a h","useful":1,"cool":0},"rTC7BEScjk88MNAqPauXFg":{"text":"Quick meal meaning fast service \n\nThis was my second visit. I went because my niece watche","useful":1,"cool":3},"gkI365RX462XDguLK4Pqvw":{"text":"Big expectations but low performance. \n\nTo start with the restaurant is always busy. The l","useful":1,"cool":0},"OS5T6VDae_3aT6V7UiU9mg":{"text":"We stopped at The Camellia Grill after Mid Summer Mardi Gras to sober up a little. I've he","useful":1,"cool":1},"qFd7KpeqE4avZCOnDcKE3A":{"text":"Stopped here today on our last day. What an awesome meal and dining experience. The atmosp","useful":0,"cool":0},"FQ-gK0bAUysx1e8rrCT42g":{"text":"We came here for breakfast based on our Lyft drivers recommendation. WOW! It's a diner and","useful":1,"cool":0},"Vu_XnbcBxJhC08K1punyLw":{"text":"A recent visit to NOLA introduced me to the Camillia Grill. I arrived at 1:30 PM, got seat","useful":1,"cool":0},"mo5MZ0FNcBEB5kL7cY2eUQ":{"text":"Camillia Grill is a great place to eat\nBut the place is very hot during the summer time\nRe","useful":1,"cool":0},"cYWP1R1zjLS8xnh9r3W23Q":{"text":"Best breakfast place ever open really late for those long nights after work or partying. B","useful":0,"cool":0},"7D3nrT7iRJzr7T05ytlDjQ":{"text":"Every time we visit New Orleans, we try a new place to eat. We thought the last place was ","useful":0,"cool":0},"SoT10thEOLNUYYnFwTDRmQ":{"text":"I have been coming to this place since college and try to make it back each time I am in t","useful":0,"cool":0},"9tyY2sS9ipsAP7Rv_Qb5Uw":{"text":"An absolute must on every trip to New Orleans. So touristy yet so New Orleans and so good.","useful":0,"cool":0},"lUUMIc8BpS0OzatNqEcOkA":{"text":"I wish I had read some of the reviews before I ordered my food. While sitting at the corne","useful":0,"cool":0},"LRLldA-mKhD928NLXSiXtQ":{"text":"Horrible experience. Walked in, was told we would be seated, a server waived us to his sec","useful":0,"cool":0},"SBuWlSu7kNfAkEAm6uncSA":{"text":"Best lunch counter dinner ever! Great Shrimp PoBoy and muffaletta. We had a chocolate free","useful":0,"cool":0},"VyJnltcs0kcBpDa8UEQKnw":{"text":"Amazing food!! Best pecan pancakes I've ever had. Loved the corned beef omelette as well. ","useful":0,"cool":0},"vChGvFI76CShfF-cFmGINQ":{"text":"Hands down, best hole in the wall breakfast EVER! Been coming here for decades and never h","useful":0,"cool":0},"y1D65i5D0h8Vw35MhP-s7A":{"text":"When my gf and I visited New Orleans back in October  we ate at this place every morning f","useful":0,"cool":0},"ubXECSIByY2s-aajM610Rg":{"text":"Just a small diner on Carrollton street? Not really...\nThis place is SMALL, but perfect. R","useful":2,"cool":0},"SPLEs8z5cVi7VGosxhbOfA":{"text":"Love the friendly and helpful staff. The place is very small, but we were lucky to walk in","useful":0,"cool":0},"mQCeiMaXBDK9Y8iqH5Hc7w":{"text":"What an amazing ambiance.... it was filled with history and amazing people serving the foo","useful":0,"cool":0},"oKFS4qYwnEWUa3npHlxwhw":{"text":"Been in Nola for a while but just recently are here. The food was alright. Typical greasy ","useful":0,"cool":0},"pZTOrxv_NPhkkwZDxNsglQ":{"text":"Such a unique little diner. The service is awesome. Chicken and waffle was delicious. Ther","useful":1,"cool":1},"Bp8lWQhN99ZyJoOSn3Phzg":{"text":"Waited for twenty minutes and never got seated. People walked in and sat down, not leaving","useful":0,"cool":0},"Pa7q46FdJnVlfREKX_6UIw":{"text":"soo everyone loves camellia grill.  i mean, if you dont like it, then...who are you? i say","useful":3,"cool":1},"YdCEN8Ix1ELxHrtw5QzQPA":{"text":"Have you ever wanted to watch a short order cook make a eight different omelettesall at th","useful":0,"cool":1},"3YdZx2bu943JzpcIqW_Asg":{"text":"I've been in love with the Camellia Grill for nearly 3 decades. Always fun, always delicio","useful":0,"cool":0},"xhiPZNrRBEisrmIJA6VDgg":{"text":"The manager was horribly rude to a young man yelling at customers at for moving a table to","useful":0,"cool":0},"3dGzSUSRq7EkvVoClDXdPQ":{"text":"I have not been here in the four years in NOLA which is very shocking. They do not have a ","useful":5,"cool":2},"Ybc9nHRrHGFgfMqlNwZH1A":{"text":"Hands down best Catfish sandwich I have ever had in my life!!! Great vintage and friendly ","useful":0,"cool":0},"y3CJ0PI7JqyduxLGmRc5uw":{"text":"This is my favorite spot to eat at ever. The people are amazing Ans the food is awesome. I","useful":1,"cool":0},"hrS-2c8I3AUmUWOU2Uc3Pg":{"text":"If you're looking for the diner experience, this is it.  There are no tables for seating, ","useful":1,"cool":1},"Ci1tmeZ03G0Z3wGPrSGpnA":{"text":"Great food,  great service. Exactly what hAt you need when you want a gooD hot breakfast w","useful":0,"cool":0},"gcxYk4hf07ezqdvWQOWe_w":{"text":"Used to be a must place but the service is abysmal, parts of orders left off, under or ove","useful":1,"cool":1},"KbwW4rdMdvAH-DAEMNhB2g":{"text":"I keep trying to go at night but they're closed. It says open online but the door is locke","useful":0,"cool":0},"TZQdCOMoJI-Eg1fvMvop2A":{"text":"Hubby and I are back at it !!!!!! Service and food was good .Quick bite to eat for lunch .","useful":0,"cool":0},"8ehZdiIYjhtEEWHOgQ29Dw":{"text":"Ah, The  Old Camellia Grill. So many happy memories there. The chili cheese omelettes, the","useful":1,"cool":0},"o2gdsZjh1cEfKubeC1w0gw":{"text":"Honestly this was the best food I had in New Orleans.  We tried Commanders Palace, Cafe Du","useful":0,"cool":0},"_c3IEFqckYOz6ERIUgBusQ":{"text":"We've been coming to this place for the last 15yrs, off and on.\nAlways go for grits, wonde","useful":0,"cool":1},"7BIkhipfwk0Wc8daQdnX0w":{"text":"Nice authentic place. Got off from the street car and went there with our local friends wh","useful":0,"cool":0},"KnvTNs466xxqlJXe5sRTYg":{"text":"Po-boy burger one of the best burgers in town. I'll start by saying, I hate fancy overly d","useful":0,"cool":0},"z2UweQ4hLNbLBmECkARXkA":{"text":"I love The Camellia Grill. The food is amazing! The only problem I've ever had is waiting ","useful":2,"cool":0},"9b5-UN7RXfDSf_D_u_IYbQ":{"text":"It's delicious diner food with great service. Everyone is quick, friendly, and welcoming. ","useful":0,"cool":0},"I7q0zRV5VXWbZG9T7o5VHw":{"text":"Food was delicious and the place is like a blast from the past. It's like you are dining i","useful":0,"cool":0},"vYUJXXYBQN2Ac_Vyl6GW5Q":{"text":"Very disappointed. Waited 1 1/2 hours to be seated. Service not good at all. The cooks wer","useful":0,"cool":0},"LDIQ5wLzzG-5jbj66aD0Gg":{"text":"People here are very friendly and I see a lot of old customers. I got waffle with sausage ","useful":0,"cool":0},"gcd7EiwwrOypMHg8nRJZAQ":{"text":"Dive right in. For my money this is the best greasy spoon you'll ever find. \n\nA nice ride ","useful":6,"cool":3},"177pL6onhCNymOOX79LADQ":{"text":"The staff here were so friendly and the food was soooo good! I made sure to leave room for","useful":1,"cool":1},"y6qYH3UUsv8s3_5SU3qKhA":{"text":"Not a single hairnet or mask was worn by employees to include the chefs. That was a turn o","useful":0,"cool":0},"G1vHFHbKzWM7ikKr-pOf3w":{"text":"The history is a part of their customer service. The food is delectable and the outside se","useful":0,"cool":0},"n5SsSAf7BkrfC-noOT2A_g":{"text":"Rude staff and not COVID safe. The seats are not socially distanced except for two benches","useful":0,"cool":0},"cOVOKLRMoDgkUfY_znfiQA":{"text":"Skip the food and just go for the desserts.  The Chocolate pecan pie was buttered and gril","useful":0,"cool":0},"YSpsKSzi_eagh14SHJc5_A":{"text":"Order a Doc Brinker's Special (double meat cheeseburger with melted American & Swiss chees","useful":0,"cool":0},"wcany2NnQLVd1i9NBYze6Q":{"text":"Coming from Austin I always try to do the old standards when in New Orleans. While Austin ","useful":1,"cool":0},"DIDbiYNVIJqf5Z7f0nSFtw":{"text":"Decided to pick up breakfast last Sunday. I  ordered the Mexican omelette, the Rano omelet","useful":1,"cool":0},"KOP5pyWEskLJ3Xv2gW3Gug":{"text":"At the far end of St. Charles St., past the Garden District, past Tulane, is this great li","useful":2,"cool":1},"Aaa8esL_6ogZs4JPc2-48w":{"text":"Seating us at a lunch counter. Vibe is solid old school diner. Right on the St Charles str","useful":0,"cool":1},"IME4C2idlquerVtjJg1RLw":{"text":"Mmmm this fantastic little place is the definition of a greasy spoon and I loved every min","useful":1,"cool":1},"C8AeezbMXR6PurNORU9uRA":{"text":"Fabulous bacon cheeseburger and chocolate freeze (milk shake). Fries weren't bad either. C","useful":0,"cool":0},"ni1pWEqsv7xkLox2cA55uQ":{"text":"I wont say its the best burger place in the city but i will say its my favorite! If this l","useful":0,"cool":0},"pr2eE9ZiXAfeMocmEtYuzw":{"text":"This place is one of my fav's but cleanliness has to get better. I am a big fan of Bar Res","useful":0,"cool":0},"t3ZxbpycISu4eKnaKYebIw":{"text":"Highly entertaining dining experience. Whether they mean to or not, the cook and the waite","useful":3,"cool":1},"zbHrbH1m_MIUTxWuGGwIOg":{"text":"OMFGGGGG!!!!!!!! Where do I begin???? Ok let me start out with the ONLY negative thing I h","useful":0,"cool":0},"_-2T-FXl-IpOYrHP_h3I_g":{"text":"My friend wanted to come here for her birthday breakfast. When we arrived there was a long","useful":3,"cool":0},"J0-vWw2LHGA6lR7EIVNgkg":{"text":"Dennis is great! Our family loved him and he was super polite. :-) food is also 10/10 woul","useful":0,"cool":0},"xDSYzZsPGNCQcTTiVNz8HA":{"text":"It saddens me that I have lived in New Orleans for over a year, but have never been to thi","useful":2,"cool":0},"exCkkN2qAhgoE5Tu8Bxpbw":{"text":"We really wanted to love this restaurant, But they really screwed up. We waited for our or","useful":0,"cool":0},"ZAgS9s9CuGTEtKbNRPhwRA":{"text":"So this place was recommended by our Airbnb host and by Yelp!, so of course I had to make ","useful":0,"cool":1},"JPL3paT1M3U-r6dmF-9mEQ":{"text":"Didn't expect it but, The Camellia Grill was definitely cool. The prices are very moderate","useful":0,"cool":0},"IgU806OMI_9itOfjaPAO2Q":{"text":"All-hours Carrollton grill\nBlack tie & white coat\nChoice fare with NOLA patois\n#NOLA_Haiku","useful":2,"cool":1},"k0w7oBPL9zBz417Yew2log":{"text":"This place normally has a line out the door but it moves fairly quickly. The small restaur","useful":3,"cool":1},"03bb4xOaUDOogHiXSvCDbg":{"text":"I went on a Sunday wearing a Saints t-shirt. I was greeted by Marvin w/ a \"who dat!\" The C","useful":0,"cool":0},"RwJkWTSDvlUFGk39G1d9sw":{"text":"Huge omelettes in a scenic and picturesque area of town. Old school diner vibes so don't e","useful":0,"cool":1},"LOLeP245Kv1-gv0lFhT92Q":{"text":"Atmosphere - lively, fun, and talkative\nService - loud, bantering \n\nFood - pretty awesome\n","useful":1,"cool":1},"mzekFOwMpIq2VfYTVnFHHA":{"text":"Cute spot right when you hop off the street car! The restaurant has one long tabletop coun","useful":0,"cool":0},"i1RMp-weMwN2QgKDW5j7ig":{"text":"Saw this grill on somebody feed Phil. We loved the food and the service from the waiter. T","useful":0,"cool":0},"JqitniFJGp_0_N3mdRtVoA":{"text":"Love the friendly and helpful staff. The place is very small, but we were lucky to walk in","useful":1,"cool":0},"71yxZQGTlz_2e6XfdgUA0Q":{"text":"One of my wife's regular hangouts in college.   I just fell in love with Camellia Grill.  ","useful":1,"cool":3},"9brM5AWRwYNnHGqXmDw4WA":{"text":"We had a recommendation from a local to try this spot out...we went for the Judy \"JuJu\" om","useful":1,"cool":1},"GXRlYbMjBIhaJvQ-GRq2EQ":{"text":"Tasty food in a throwback diner style atmosphere. \nI enjoyed my visit. The catfish and egg","useful":1,"cool":0},"SqqUeFCViwXDQSrPzhSO7w":{"text":"This place is amazing. I usually get the burger and fries and I've had the sausage burger ","useful":1,"cool":0},"-xyLwBHmElva2qv1rEF2hQ":{"text":"The best old style diner food anywhere!! We had a group of 8 and didn't have any problems ","useful":0,"cool":0},"1slBSr24EZn119DjU_EV5A":{"text":"Omelettes.  They are feather-light and packed with tasty goodies. I had the cheese omelet ","useful":0,"cool":1},"pELQgg9Y2RsWj8D0sW5B8w":{"text":"What a great place!  I found this place via Yelp. I walked in and the place was packed. It","useful":0,"cool":0},"71lCkEgQWf-evwZmEsaiIQ":{"text":"Wanting to venture out away from the unpleasant sights of downtown New Orleans for dinner,","useful":2,"cool":1},"KXDO727lxjgZXoqYRgEhPA":{"text":"It's a diner! The wait staff was friendly and helpful! The Greek omelette + grilled shrimp","useful":0,"cool":0},"nrvLk0kG1XA5XRPZeIbgdA":{"text":"Friendly staff and decent food. Very messy/dirty. Although you get to watch your food bein","useful":0,"cool":0},"9t-RSrwDzRajteJADHhj-w":{"text":"Almost everything I've had here has been the best of that thing I've ever had.  The best o","useful":1,"cool":1},"UdZuNijbC5ALiD44wI7o2g":{"text":"Ok. How I missed this place is beyond me. I am HANGRY writing about it. \n\nWanted a simple ","useful":8,"cool":6},"n6TJbtgzhKMfPFikkJaAWQ":{"text":"The menu is very simple but the atmosphere is very unique. There is only counter space tha","useful":0,"cool":0},"FiWX5RUkiDBvQFS5_JtQ3Q":{"text":"Well, we had a group of 7, so we split up the group.   One of the children ordered milk, a","useful":1,"cool":0},"Hgvq72DnCtqnSYIllwqChw":{"text":"I don't even know where to begin. For this restaurant being a staple place to visit in New","useful":1,"cool":0},"5_lN08VJxajyL5dSYhREYQ":{"text":"Sometimes I ask myself if I keep coming back to New Orleans just for the chocolate pecan p","useful":0,"cool":0},"CA-67m55MQaypSzRpeaawg":{"text":"This place is the best!  I used to go there all the time when I lived in NOLA, and now I n","useful":0,"cool":0},"GWaY18nxg010TxczN1wZUw":{"text":"If you want to stand in line for 45 minutes to be rushed through your meal. This is a grea","useful":0,"cool":0},"PRutaR5ZHlAL0IlbJvUyZw":{"text":"What can i say, i absolutely loved the feel and atmosphere of this place right when I walk","useful":1,"cool":1},"v8nEEGfP3WK8ERYbbmVqyg":{"text":"Nice to drop in again after 30 years...\nTake the St. Charles street car uptown from Canal ","useful":0,"cool":1},"yBX07hnR88BxDkNP51PbGQ":{"text":"Price: 8/10\nEnvironment: 10/10\nExperience:10/10\nFood: 10/10\nService: 7/10\n  \nMy favorite f","useful":1,"cool":0},"yUvgUyZJ3G4vR1NGvp981Q":{"text":"I'm not sure what happened to my pictures but my food and experience was excellent! Braun ","useful":5,"cool":2},"UvLJb6r0FBFGm3yhO_PDTw":{"text":"The sandwiches here are pretty good, but I would lean more toward the 7/10 than 8/10 (sinc","useful":0,"cool":0},"Mth-lolVGVx9wqWWWk99lQ":{"text":"Heard about this place for years and finally went - what a disappointment!  Dirty, dirty, ","useful":0,"cool":0},"zDW4GrTwadXsTKUJ3TpKXQ":{"text":"Camellia Grill, such an amazing place to dine.\nI had the standard 2 egg breakfast with sau","useful":2,"cool":0},"coeucSpr00uW-jZYZT2olA":{"text":"If I order 20 burgers a year from different restaurants, 19 come out cold.  FINALLY A BURG","useful":0,"cool":0},"uIcz5a3KdhxSbmSzY-QmTA":{"text":"-just as good as we remembered from previous visit. Originally opened in 1946 and closed f","useful":0,"cool":0},"1nKGlzokrEsNAfpqAZN6ig":{"text":"Very different then any other place I have been it brings you back in time to food was ver","useful":0,"cool":0},"uY8Zgc8fK70MbmTS7bHYIg":{"text":"I've been craving breakfast from here for awhile. It looks like the perfect little weekend","useful":0,"cool":0},"xTLYyxZSDpNE-p5aHptLpQ":{"text":"Just a short and pleasant streetcar ride from the F.Q. but a world away!\n\nI came here to r","useful":2,"cool":1},"nfOcmHEm2oic6rxQcS8nRw":{"text":"such a fun diner experience! food was delicious and hit the spot. loved the simplicity of ","useful":0,"cool":0},"Ptrk1Z5sARB6pvT6022soA":{"text":"This is the exact restaurant that I look for in any place I visit: an authentic, old schoo","useful":0,"cool":0},"I50rFE1XxgNK4DxsMwhAuA":{"text":"This is probably one of the greatest places to eat in all of New Orleans. The atmosphere  ","useful":0,"cool":0},"9qAiEu1aaAypl_m_6lsNmA":{"text":"Very greasy and overpriced for what it is.  I guess if I'd had a hangover I might have app","useful":2,"cool":0},"O88Z2jc-0KRzf_v6xanGfQ":{"text":"Maybe I ordered the wrong thing( shrimp pob\n\n\nMaybe I ordered the wrong thing( shrimp po-b","useful":0,"cool":0},"lTBWYfM4i7U78YhvuTpzWQ":{"text":"I haven't been to Camellia Grill since 2009 and in 2021 the food is just a great as I reme","useful":0,"cool":0},"iXDHaqMSAYtv-VUkmwmZPA":{"text":"Awesome crew!!! Just real people.  Great place to take visitors or out of towners. i had a","useful":2,"cool":1},"k8CyGdNTF3nDqXrq2CSY4g":{"text":"We heard about the Camellia grill from a local of some report, so after checkin' the numbe","useful":2,"cool":0},"1vTsKdIWfnyG1MIjNxATPQ":{"text":"Camellia Grill is an all time favorite of mine. I used to come here almost weekly when I a","useful":0,"cool":0},"2Y01ap7njZBlZ5ymf-VAlw":{"text":"One of my  favorite places to grab a quick  bite in New Orleans. Loud and busy like  a  ol","useful":0,"cool":0},"lBwnwoBVQPfxpNezxtHMGA":{"text":"The Camellia grill makes you feel like you're part of the Camellia family. You got your mo","useful":3,"cool":2},"7pNwAPyAiesqbVAcoN_vpQ":{"text":"Looooved this place. Great service, food, and clean environment. The Western Omelette was ","useful":0,"cool":0},"bT-ZFecbwgx57De8TZcIhQ":{"text":"Good Gracious!! After seeing the line for our original choice, we found this place recomme","useful":1,"cool":1},"HHmd5xSTcp0AUbKxt1Ajvw":{"text":"Hadn't been here in years. Was glad to see it survived COVID. All was as remembered. No wa","useful":1,"cool":1},"9n7meiyT5SjU5H0u99pXFA":{"text":"Love it! Great atmosphere. Food is delicious. And the service was fun. Our waiter was Melv","useful":2,"cool":0},"ecuxA_h_G5uagV053Vpn8A":{"text":"It's kinda crowded and you often wait in line for breakfast. I wish they had real cheese, ","useful":2,"cool":1},"IQ9CcMFFTaIS7EGEfDI6sg":{"text":"This is a great place to grab a quick bite any time of day, but especially late at night. ","useful":1,"cool":1},"v7dHQ1HKGbbberNkLfayBw":{"text":"I don't think I've ever had more fun eating at one restaurant. The vibe alone here gives i","useful":5,"cool":5},"CId4tYZUoE8bDos0-J09Hg":{"text":"Not what it once was. Waiters are surly. Guy sitting at the register watches everyone like","useful":0,"cool":0},"u00eoftZp0CWOp9ExFBAUw":{"text":"It's a cute, old-school diner. 5 stars for the vibes but 3 stars for the food, so overall ","useful":0,"cool":0},"bP6_WEBmpTAWKmD1JCkeog":{"text":"I love this place.  It was a first breakfast spot for me years ago during my very first vi","useful":1,"cool":0},"nlOsPnE3T9bawDby6opDJg":{"text":"So this was my second time eating here while visiting NOLA. \n\nPros: \nGreat, friendly servi","useful":0,"cool":0},"fha6hcioMpeqsqxFbAC50Q":{"text":"After a late night in the quarter and some sluggish traffic on the way back to Metaire I d","useful":4,"cool":5},"AxsVNCJU4F4rBdhBwAQ2og":{"text":"Old school grill. Lunch counter style seating with flat tops where you can sit and watch t","useful":0,"cool":0},"KqouSCH2EtCiAf1a_ISwJg":{"text":"If y'all are wondering where the bacon is, it is right here. Best BLT in town, and get the","useful":0,"cool":0},"eOQyg2tOV4Zct2NjAd_WRw":{"text":"The diner atmosphere is very neat here! I liked the way they kept it old school and tradit","useful":1,"cool":2},"N14ZM6AmtPRHDSb_p2oL-Q":{"text":"A must try if in New Orleans ... it's where all the locals go to eat ... best pecan waffle","useful":0,"cool":0},"RpY-OEUZKCbex-POEzHecg":{"text":"Major disappointment.. Host and staff rude, order took way too long and was forgotten, Pec","useful":0,"cool":0},"ROuBb5jAl-1w8KHu9xIKuw":{"text":"This was definitely a cute little diner. It gives your that \"at home New Orleans\" vibe and","useful":0,"cool":0},"sqKwXyu_1UD-zlWBkPvOGQ":{"text":"It very good small dinner, but what you really get is a piece of history. The wait staff a","useful":0,"cool":0},"yodSgYo34TfGvEhOfOWs6g":{"text":"A friend recommended this place for us and to be honest I was thinking I was headed to a f","useful":3,"cool":1},"fmy2foeL_meIONPe0d3MdA":{"text":"There are few perfect places. This might be one of them. The Camellia Grill is as reliable","useful":0,"cool":0},"AVxmsoxixGCipzzFiIH71A":{"text":"Comfort greasy spoon at its finest. A seat at the counter is definitely the best seat in t","useful":0,"cool":1},"sGGXGrnBucf7RI75cZeBpQ":{"text":"We got lucky and there wasnt a line to get in.  But if there was would be well worth it.","useful":0,"cool":0},"9emsZarysKPB_BGvUHxwBA":{"text":"Still a classic breakfast place! I was happy to see they had eggwhite omelets (Rano's omel","useful":3,"cool":2},"oYrC10oY1Dxd5oHmMoh2WQ":{"text":"The grill was manned by Brandon, who was welcoming when I arrived and even came outside to","useful":0,"cool":0},"gtiCM2mFlJ4Q3XzcjfV6Mw":{"text":"Best gumbo I've ever had, my only complaint is that the portion was a little small. As far","useful":0,"cool":0},"bBdgQ5N_89KevCm5qp3cdA":{"text":"Ok let's start with the good and and with the bad. \n\nThis is my second time coming here an","useful":3,"cool":1},"-gXVPyVkuCP-erzFdDeBDw":{"text":"Camellia Grill is a bit off the beaten track if you are staying in the French Quarter or t","useful":1,"cool":1},"FaqKEol0Lye3uJiXtHdXhg":{"text":"I love the casual vibe of this place, and the food is quite tasty. I ordered the tomato ba","useful":1,"cool":1},"PsWZU2dyIpWJZYxfgpqZMg":{"text":"The Camellia Grill is an institution, so much so that they were filming a segment for a TV","useful":1,"cool":0},"Cdvkgbw0LhwJ931y0P4xbw":{"text":"A New Orleans staple. You absolutely must come to Camellia Grill. The servers are wonderfu","useful":2,"cool":1},"LK-FBiZH1O2KPpPCaKwLPQ":{"text":"If you enjoy close quarters and greasy food, this is the place. My mother used to love it.","useful":0,"cool":0},"d9krfGOn2Tl-jfOD4LtDSQ":{"text":"Can't say enough about this place. We have been to New Orleans a couple times and we will ","useful":0,"cool":1},"NhUXls5hSHNufFoFPqW7zQ":{"text":"First off, if you're a picky \"oh I MUST have my eggs lightly scrambled and the crusts cut ","useful":5,"cool":3},"c_teSw9XJk__4bTPG3PNiw":{"text":"Camillia Grill is back \nopening hours are 10:00Am to 7:00PM \nthings are better  place is c","useful":1,"cool":0},"m733xTS8Q1kqr0tMxI6GZg":{"text":"I don't know how this place was never visited by me before our summer visit. My kids and I","useful":0,"cool":0},"z4_kXXZOesRC1U6EdI0d1w":{"text":"I'm out of order ... not as in chronology or as in kaput, but in the order in which I had ","useful":8,"cool":7},"I1uQeSSOD6g2QqF7gcyG9Q":{"text":"A hot day in Nola and we wanted something quick and stumbled upon this restaurant. We walk","useful":1,"cool":1},"bsr6hO4mx5KGVDXCuBU1zQ":{"text":"The host was a complete jerk. Actually heard him call a waiter a crack baby. The food was ","useful":0,"cool":0},"WUHC0P7BS1QCa5S2P1ngCg":{"text":"Excellent Service and food!  You must try the Chocolate pecan pie!  Dennis was a great wai","useful":1,"cool":0},"trv1JoiFKLLQGqJawY2Ozg":{"text":"On top of seeing Camellia Grill on Somebody feed Phil, we were recommended to stop in by a","useful":0,"cool":0},"UQ5XVSZpX1phWDX5eaWP4Q":{"text":"Yum - I love this place!  I stopped in with a coworker and we enjoyed the gumbo, red beans","useful":0,"cool":0},"VT4NmRuuhVA6rsg461l-eg":{"text":"Service was fast and great enjoy the meal it's a must do again It has an old fashion ice c","useful":0,"cool":0},"M7rDU-r-q0mzYpSEXYImZg":{"text":"I will admit that most of my large party of 10 colleagues were hesitant to stay when we in","useful":2,"cool":1},"T4cH5byh9PdKwD3OYHIWaw":{"text":"A lot of memories made here over the years. Step back in time and wait in line it's worth ","useful":0,"cool":0},"_voXlZlLprjLySe1gmHZuw":{"text":"We came in here as a recommendation from locals--and it didn't disappoint. After a long da","useful":0,"cool":0},"NsDyIG5-qJFt9QWsoZEPdQ":{"text":"Looking for a quick good place to eat? Then I'd suggest coming here. I wasn't completely f","useful":2,"cool":2},"Y-KhG3NTlyCbV5F44jK6TA":{"text":"This is a place where the nostalgia to tourists far outweighs its food and service. \nEmplo","useful":0,"cool":0},"NwwkL_lrCF1OuWYoMT0VOA":{"text":"Great late night food. Love the diner atmosphere and the cooks and waiters are great! My f","useful":0,"cool":0},"sThBUraosoOulLYQ61S9Zg":{"text":"I like this place!\n\nThey serve melted butter in a syrup container which is cool.\n\nQuick  s","useful":0,"cool":1},"uhoWFL2zAxy2tff9VqxShg":{"text":"Fantastic food and efficient, entertaining service this Sunday morning. I enjoyed a shrimp","useful":0,"cool":0},"fGIFmrxQpJ9yvD6WmUlFYg":{"text":"Whatcha see is whatcha get! \n\nWhen you walk in, the only seating option is at the counter,","useful":0,"cool":0},"lk1bZpJOfGRn8YII7c5i6Q":{"text":"I don't think I've ever had more fun eating at one restaurant. The vibe alone here gives i","useful":11,"cool":8},"IsUREJ73b21VHfuUQI7vVQ":{"text":"Simply an awesome place, bursting with NOLA culture. The unique seating arrangement allows","useful":1,"cool":1},"RWzZfEYsqYynK0iTIU_x3A":{"text":"Not Wowed by this place .. Rude host and wait staff, waited way to Long for waffles and Ba","useful":0,"cool":0},"lXySJxK3j0gipx_AjFQhmA":{"text":"Camellia Grill has a great atmosphere and an authentic New Orleans feel. It is a reactivel","useful":0,"cool":0},"_xaxkD4hee6117Pt_fWtog":{"text":"We sat outside on a beautiful Spring day.  The staff were friendly and the food was excell","useful":0,"cool":0},"JoMWjNbU-JuMjyIKBOZwtw":{"text":"Great atmosphere. Great service. Great time. Camelia Grill. AUTHENTÍC. Ask for Bubba and H","useful":0,"cool":0},"6sA1Ulo6u33PDa0tqvcMnw":{"text":"Camellia Grill has been churning out diner food for 75 years (1946!) and you can tell they","useful":1,"cool":1},"3pTgrrQSYu6VB_sw0_ZH9w":{"text":"Ok, total disclaimer.  I've been going to this Camellia Grill since I was in high school (","useful":5,"cool":2},"d46I_lknlrWzB1OXTLn9PA":{"text":"A place you have to go to because of the history.  But, the food isn't that great.  Grits ","useful":2,"cool":1},"8lP1aNkyDyVwrFgi8yZMTQ":{"text":"What you will find here is some good down home cooking, some friendly and interesting staf","useful":2,"cool":4},"ajt14ao3f95lY_wIS7cyAw":{"text":"A fantastic place to get some good ole diner style food in New Orleans! The food was excel","useful":1,"cool":0},"rvQepaTWw0NJ2MwW9il-vg":{"text":"Super yummy old school diner that is worth the wait. Lots of variety on the menu. Friendly","useful":1,"cool":0},"j8Y3Og7N7fU7NVlkjeXARA":{"text":"GET IN MY BELLY.\n\nBut seriously, Camellia Grill has the best breakfast food/burgers/late n","useful":0,"cool":1},"tEyrfioZNtTHsNAtT5lQ5g":{"text":"We saw some great reviews and went there to try it. It was really far from us, but everyon","useful":1,"cool":0},"UuthR2CkatLYPnUVZMtaTw":{"text":"The Camellia Grill is a legend in New Orleans. Definitely the type of place I bring friend","useful":0,"cool":0},"5BgtPMdFJShyoShhUIRNjg":{"text":"I came here on a Monday afternoon around 11:15AM and had about a 45 minute wait.  It was w","useful":1,"cool":2}}