{"re-3zvKg1I8KXP3SchR6Ug":{"text":"Can you find it? You better. Great ambiance and wonderful craft cocktails. Boudin Rangoon ","useful":0,"cool":0},"QekBDAAQhI8B7DHR7ww90g":{"text":"Think British Colonial swank. Really the best place for classic cocktails in the quarter. ","useful":1,"cool":0},"TMx2jxEX9Cd-emFbu818_w":{"text":"Went there the previous night for dinner with some friends on our last night in the French","useful":1,"cool":0},"GWGPr3RIOkvozpTdtaKE7Q":{"text":"This is not The Bombay Club I remember when I came here for college. This place has had a ","useful":5,"cool":2},"6n07u-oP6dwOfwD1x0M8fg":{"text":"Coming here on our final evening in New Orleans needing some good music and great drinks w","useful":1,"cool":1},"wZd9GbFdIb85BdRN-IGrUw":{"text":"We stopped in for a Christmas Reveillon.\n \nThe good: \n\nThe cocktails are ABSOLUTELY worth ","useful":0,"cool":0},"N7LxB_9OYWNZrzYhPTuqFw":{"text":"My meal was extremely good, I had the Rabbit pot pie and it was excellent. Atmospheres in ","useful":0,"cool":0},"UQyhHVIH5M6IhyK7g7rjQw":{"text":"Went here for happy hour with a party of six. Everything was delightful. The patio is love","useful":0,"cool":0},"4yI_h7iypbgIamuButAmfw":{"text":"Received a recommendation from the Royal House Restaurant.  (I believe that the Bombay Clu","useful":2,"cool":0},"3lBItBumT8uGWHhCqI0aGw":{"text":"We had Drinks & Dinner last night for our Anniversary. \nRachel, the Bartender was wonderfu","useful":0,"cool":0},"HlPnMrAR4H3wNa3bPXYpOg":{"text":"$3? Really....$3 for happy hour appetizers every day from 4pm to 7pm?  Where can you get t","useful":1,"cool":1},"2Ol9wNNRt9JO_qTNoITPGg":{"text":"Music and atmosphere were fantastic! The drinks were a little slow and over priced. But wa","useful":0,"cool":0},"2qecPNx92-FQXOaH9y7GKg":{"text":"Visited here in late February and was pleased with the quiet ambiance and the cocktails.  ","useful":0,"cool":0},"wpv7V_V44bLtvPrGHeqyNQ":{"text":"Coming here I had mixed feelings from all the mixed reviews but it was a fabulous amazing ","useful":4,"cool":2},"3EJmfUJDoQu_fVTmKOVDwg":{"text":"Best Martini in the Country. Great old bar, live music.. A must if your visiting NOLA","useful":0,"cool":0},"7H5gGFHGF_du4DTZaKWuew":{"text":"Just stopped in for happy hour and really enjoyed the drink and app specials. The ambiance","useful":0,"cool":0},"MpRE2fFbJiQaddz22zWQuA":{"text":"My boyfriend and I wanted a nice romantic dinner for our last night in New Orleans and we ","useful":0,"cool":0},"7Ij9_Hy3q_YusmjVF_aRbQ":{"text":"What a lovely place off the beaten track. Whether in the dark and clubby bar area or the c","useful":0,"cool":0},"Rlbth7z2VRtM7owiyc3YzA":{"text":"I've come to rely on tasty cocktails consistently made by skilled bartenders here. Great a","useful":1,"cool":1},"dpnuh3-ntCiVbKbmzejkcQ":{"text":"A very poor experience....  I took my family to the Bombay Club for Christmas dinner.  Thi","useful":0,"cool":0},"QVo5cQZXVgCfOQqcn3p9ig":{"text":"Came here for happy hour and dinner. We initially were seated for dinner but the crowd nex","useful":0,"cool":0},"eX5fdVje3kmTlcAUMMdgTw":{"text":"One of our favorite places we went in New Orleans.\n\nChristmas evening dinner was perfect. ","useful":1,"cool":1},"9Tn6XV8Ei7p7vcmsAwA0uQ":{"text":"Service was excellent, food and drinks were stellar.  Will definitely visit again.  Hats o","useful":0,"cool":0},"lkOo8U2KsWEnyDlBcxnPsA":{"text":"Friend and I stopped in for a few drinks after dinner and were very happy we did so.  Cock","useful":0,"cool":0},"QAXohOSMLZposxK8KkC-vQ":{"text":"Had a great time here with my husband last Friday night. Didn't catch the name of the band","useful":1,"cool":0},"DFcxd0lT2xSdnHhLjJLEyA":{"text":"Came in for a drink for my birthday. Super classy little spot. Best martinis around. The b","useful":0,"cool":0},"sEaKlI9CoSjEksFzTLabZw":{"text":"I had really high expectations for this place, especially after I read that several celebr","useful":4,"cool":0},"M9cpfvrT2vdYlNg7cLE-IA":{"text":"We came for happy hour and had a GREAT experience! Their extensive cocktail menu makes is ","useful":0,"cool":0},"ky7FxKyRBM7sgW0WLaeQ-Q":{"text":"The Bombay Club was an amazing oasis from the chaos and debauchery of Bourbon Street. Fabu","useful":0,"cool":0},"AnXT0ujdAXZoURWEbL_hug":{"text":"I brought some friends from out of town to try this place out for the first time and it su","useful":0,"cool":0},"p7lA5Sn0pkNvGxuXRsj8UQ":{"text":"My husband and I had our small wedding reception here Nov 3, 2012. It was perfect. They we","useful":0,"cool":0},"NzOMzSPziF17CSEwRzJz-w":{"text":"Popped by for dinner on a Saturday night.  Quiet, subdued place that was just what we were","useful":0,"cool":0},"rTft9oR6avz_gF6yEUnbfw":{"text":"This was a little gem we walked into once the crowds in bourbon started to hit the \"overwh","useful":3,"cool":0},"iy1WEiRoF2qBdRQL-j04AA":{"text":"Wonderful atmosphere and hands down the best food in town. Local jazz musicians and excell","useful":0,"cool":0},"wIYVjKfy1xAPNeW2avNTtA":{"text":"We sat in the courtyard during happy hour and got drinks, an appetizer, and dinner. Our wa","useful":0,"cool":0},"VpAIhkwxnEtrOeNYy1f5pQ":{"text":"This place is such a gem I almost don't want to write about it, because after all the heat","useful":3,"cool":2},"Aa4r3Qfu2XGaYrXf7E1uYw":{"text":"Came here during brunch for the bottomless mimosas and left super full on the BBQ Shrimp a","useful":0,"cool":0},"n5jB-iDerr24Cs9T9d4HJQ":{"text":"Came here for a bachelorette party. I'm so sad to not remember our waiter but he was super","useful":1,"cool":0},"FepnN-4gUGN-wmezfu7rCw":{"text":"Hidden gem. Nice bourbon selection and happy hour menu. Very comfortable and relaxed feel.","useful":0,"cool":0},"SX4GvLZniRQlGd5pt4kVyg":{"text":"Delicious! You can't go wrong anywhere in NOLA.  My cocktail was amazing - it was a gin so","useful":0,"cool":0},"1G98tlvOiYWUZiy5pEi-Ew":{"text":"AMAZING AMAZING AMAZING!\n\nEarlier this spring, my boyfriend and I went to New Orleans on b","useful":4,"cool":3},"aCKD0CUxqHutqdXNNkxAvg":{"text":"What a find!  Tucked in a secret space a quick walk off Bourbon, this former speakeasy pro","useful":0,"cool":0},"XuUEgm5Q5Fd69v9SJ0vKmg":{"text":"I cannot speak for the restaurant, but this bar deserves a FULL 5 STARS. not a measley 4.5","useful":4,"cool":4},"IczyPHwRjbmMz5TrAufK6g":{"text":"Bombay Club is my ideal kind of bar.\n\nWe came here when it was not too packed and actually","useful":1,"cool":2},"7Jw-5ay2CXxSLLwq4GIZkw":{"text":"This place is great UNLESS you are a vegetarian and def don't come here if vegan unless yo","useful":0,"cool":0},"XZZp72dlbAUXjj0grAHtDw":{"text":"Incredible! Appetizers were delicious service was amazing. Ambiance was old-school and cla","useful":0,"cool":0},"RJFse7uIKvccSn_yGdzq3w":{"text":"We went to Bombay Club on vacation and loved it! The atmosphere was great and the food was","useful":0,"cool":0},"YrkgLo7fC_O9KAkO3QOdkw":{"text":"Favorite craft cocktail bar in New Orleans! The manhattan and French 57 are a must. Brando","useful":0,"cool":0},"VQLOE_QmIytkeuwr7y61FQ":{"text":"I wanted to like this place. I was a big fan of the original. I missed Bombay when it clos","useful":3,"cool":0},"gREON6SkL_OYOZ6jv2sOwQ":{"text":"We spent the holidays in NOLA and made reservations in advance for Reveillon dinner for Ch","useful":0,"cool":0},"8tF3N_Nr1Lbv78dBoeVlNQ":{"text":"What a wonderful dining experience. For the starters we asked Chef Haleigh for her suggest","useful":0,"cool":0},"UkY2Cg8gEpEk_HjR4BJTgQ":{"text":"Had a great experience here Saturday night. My boyfriend and I were celebrating my birthda","useful":5,"cool":4},"lQXvacztfyM9Hdnd7XqXVQ":{"text":"I was having visitors from out of town for Thanksgiving one year and was asked to make res","useful":0,"cool":0},"iqveaf2q2PbthNZQRYrJKg":{"text":"I seriously don't understand how you could have less than 4 star experience at this place ","useful":2,"cool":0},"-ebwnpoX2oZBzIJZg2vUrg":{"text":"Underwhelmed. They would serve their customers better by disclosing what's in the food. I ","useful":0,"cool":0},"8JWLZ7TSCYJnz1t5Des1Lw":{"text":"Ok my first time here. I had the Pork belly Tacos to begin with. The main course of Pork-c","useful":0,"cool":0},"3CdzFpi6SXojZuNOskx9IA":{"text":"We were really excited about visiting this place but we're pretty disappointed by the qual","useful":0,"cool":0},"q7C9U24YetSmxphy--rLAg":{"text":"My favorite bar in the Quarter. Quiet, elegant and a great Pimm's Cup! I have never eaten ","useful":0,"cool":0},"jkDQ56L-rRHqfqJ0zsM-cg":{"text":"Very cool vibe, upscale but not pretentious, very nice cocktail menu and the bartender wil","useful":0,"cool":0},"ba8kv9VTET8GnOxHJYT4aQ":{"text":"Lovely dinner location; darker mood lighting, wood everywhere, live subdued piano jazz. Th","useful":0,"cool":0},"lXTOEQXFMKp9BoZvtRI-cg":{"text":"As many people come here for the bar & music as the food, and I can't say I've tried the f","useful":1,"cool":1},"44FiWr5qhSZshHHMaERM_g":{"text":"One of the best happy hours in the quarter. We stopped in to this shaded, cool Brit bar fo","useful":2,"cool":1},"TBBYuA6rgDcEwgTL9fa9hw":{"text":"Fun place to hangout with friends,nite we were there they had a band that played jazz and ","useful":0,"cool":0},"TrXVGfSG6Q757W7F1jWpbg":{"text":"Love the Bombay club! This establishment has a great vibe to it. While in town we enjoyed ","useful":0,"cool":0},"063l8dWq9K0CTvVmqIpXjg":{"text":"We went to Bombay for our first-night celebration dinner in New Orleans. The service and e","useful":0,"cool":0},"Xy4uM2JNDPjX7y1wwI2zbQ":{"text":"After a day of Mardi Gras Eve bar hopping, my somewhat rowdy three friends and I arrived a","useful":1,"cool":0},"v0Bru9_cQT44U2QtMrkSqw":{"text":"Great service, only $10 for bottomless mimosas and they mean bottomless! Brunch was good, ","useful":0,"cool":0},"_LAsauqf_czWQu2buQPrCw":{"text":"Not sure what's going on at Bombay Club - has been wonderful through up to last fall. We n","useful":0,"cool":0},"d7LuXUacJKikzqzZ-qKt6A":{"text":"Great setting, food and service. This was truly an experience. The boudin scotch egg was r","useful":1,"cool":1},"l-yaEkKfX94mS2T28FmBpg":{"text":"Food: 2/5\n\nI had the Ponchatoula salad as a starter, my mother did not get a starter as ou","useful":3,"cool":0},"BNmKkQdQG5XfU82UrrfyyA":{"text":"The ambiance is great. Come here for a drink, some soft jazz and maybe a small plate (Brus","useful":0,"cool":0},"8083GEF8ME6ytk5VleGJkg":{"text":"Just finished two Manhattans for happy hour, I only had one app for 3$ wished I order all ","useful":0,"cool":0},"i65DT_8Sdls9-goiytfnlw":{"text":"Attached to the hotel where we were staying in the French Quarter (the Prince Conti), we m","useful":1,"cool":1},"lfp2-ZnYgQoukMxRins41g":{"text":"The place is amazing from beginning to end. The food was really good. The service was phen","useful":0,"cool":0},"pEEo1MxpVmLtm2QXWnBKOg":{"text":"Horrible service. Totally ruined my experience. Went out with family and got treated like ","useful":0,"cool":0},"tIB65CKafydxT2p2UY_Q6w":{"text":"Small dark restaurant. Food was ok. Two cockroaches ran by our table while eating. The man","useful":0,"cool":0},"5CyQi10lGRUVpjnw90sBvg":{"text":"We went here for one of the \"nicer\" meals on our honeymoon. The ambiance was nice with mus","useful":2,"cool":0},"swXVD9_b11P_ASbtRmzAQQ":{"text":"Happy hour!\nThe first thing which hit me when entering was how cool the room temperature w","useful":1,"cool":0},"4uc4r57OJhShwa-EFNLtnA":{"text":"Popped in because it was the first place we saw at the end of our late night ghost tour.  ","useful":0,"cool":0},"CRUIb1D9R8tkk_PmeClmQQ":{"text":"This place is not worth your time or money. Seriously. Just don't bother.\n\nWe first wander","useful":3,"cool":0},"PCvD4GYLe_59ZPO53Gmo5Q":{"text":"Great atmosphere, one of my favorite spots in New Orleans! Good food and great live music,","useful":0,"cool":0},"c8oIDnk-LzoJwz4KWiNmMw":{"text":"I can't speak for the entire restaurant, as I've only been here for the drinks at the bar ","useful":3,"cool":0},"UfXi9vjalCd-w5-JW5Mn9g":{"text":"This is a hidden gem in the heart of new orleans! My wife and I came to Nola as a honeymoo","useful":1,"cool":1},"ZjpshEz-h9ADfC_oba-DDQ":{"text":"Great food & drinks.  Great place if you are looking for a break from Bourbon Street","useful":1,"cool":0},"G6N2lGsQc6LIhqDFnELilg":{"text":"We stopped in for drinks and appetizers during happy hour on a Friday evening, around 6. W","useful":0,"cool":0},"mvl6IxnETYiIC3OtK0WCnQ":{"text":"Love this place. The environment is amazing, service and staff are top notch. Also you can","useful":0,"cool":0},"ExJYDTLs3e2XkrStMYra8Q":{"text":"Happy Hour was amazing! Poutine, pork belly tacos, and boudin wontons! Omg... I'm dying of","useful":1,"cool":1},"bkzKm0JltDvw1Y54mWpjmg":{"text":"Such a great ambience! Hands down one of my favorite restaurants. My boyfriend and I enjoy","useful":0,"cool":0},"0MsGQG1MiOjpAVlZk9NOmA":{"text":"It's been a while since I have been here for dinner..really before Katrina.  As it is a La","useful":1,"cool":1},"u1lvSpK_v3Q3be5zzyhP3w":{"text":"We went here on a Wednesday. The restaurant was intimate and cozy. The food was excellent ","useful":0,"cool":0},"IiU7iLgWpfGFcTnE3XTDww":{"text":"I ordered the crab cake appetizer, spinach salad and pan fried drum with asparagus and lyo","useful":1,"cool":0},"MJ3LpEVgk3r-AMrXYz9Htw":{"text":"This is probably my favorite place to go for drinks, if I were to choose a single venue in","useful":4,"cool":2},"7ssT72MUnTOjTlofRVtM6Q":{"text":"Great looking place. Very nice bartenders. 4$ happy hours and not too pretentious vide.\nVe","useful":1,"cool":0},"V1lX7ES8kuq9Uv7rH5A7Bg":{"text":"Amazing food and service! Becks is the best waitress ever! The drinks and the band made th","useful":1,"cool":1},"awSzmu_a2JgyH912BYqtlg":{"text":"We had Eggs Benedict, steak and eggs, and the bottomless mimosas..All were delicious! The ","useful":0,"cool":0},"_XRvD-BQhmqRF6sPjaXXCg":{"text":"Food is pretty delicious! But I would mainly come here for some fries, drinks, and live mu","useful":0,"cool":0},"5ZinxRSYaWDPU_Ac9gpUgQ":{"text":"Back again.  Last night's Pimms left me wanting more.  Too stuffed for a main course.  A s","useful":0,"cool":0},"1T8yZxibm_AkIG7vQW4zGQ":{"text":"Great atmosphere if you want to enjoy the beauty of NOLA without dealing with Bourbon st. ","useful":0,"cool":0},"LoITBVKjkSjsHVgJl3_jfw":{"text":"I booked a dinner at The Bombay Club as a surprise birthday present for my friend and her ","useful":0,"cool":0},"_-TUmX5wLDrZkTPZ_SG2fQ":{"text":"I had dinner there on 4/30/11.  When we arived the place was not yet busy. We had a party ","useful":4,"cool":2},"8ld3lc-aqNXeyt0e_FJ95g":{"text":"We dined at Bombay Club Martini Bar & Restaurant for our birthday. There were so many choi","useful":0,"cool":0},"QlLx04um8P_qCm2QYUP9Uw":{"text":"Excellent spot. What made it particularly special was Dat the maitre 'd. He went out of hi","useful":1,"cool":0},"QtWevBMB0oKmHTLDkjNyLw":{"text":"Came back to Bombay Club this weekend based on an exceptional first experience one night o","useful":0,"cool":0},"0bJOdJah9UAUHND0j7NO_g":{"text":"The Bombay Club was conveniently located near our hotel. Excellent happy hour prices and e","useful":0,"cool":0},"Q-dns3xgLI5TQhS5QUxMGQ":{"text":"This place employs people like Ross who care for their customers. I came in late and he to","useful":0,"cool":0},"B4751NBlBnwHnAskZsL0NQ":{"text":"This place is tucked deep inside the Prince Conti Hotel off of Bourbon Street. I never eve","useful":0,"cool":0},"fbQvAwiHWBbeUEwhBJl_Jg":{"text":"My husband and I went for Christmas Reveillon dinner, and were blown away. The atmosphere ","useful":0,"cool":0},"oJSUsJlh2FQCZGwpoUo3pg":{"text":"Great atmosphere, awesome staff, amazing food. Definitely off the beaten path of the frenc","useful":1,"cool":0},"sX6niUulOxob6yxI4Oqmtg":{"text":"Very good.  Took my wife for her birthday\nGreat drinks and food.  Mussels were tasty but s","useful":0,"cool":0},"oCs2bxJQSS2ZkeSljv9vlA":{"text":"The absinthe here was better than the Old Absinthe House in presentation, quality, authent","useful":0,"cool":0},"B7Ny8vSVygj2v9_J-zzf-Q":{"text":"Great restaurant my boyfriend and I went there for date night and got first class service.","useful":1,"cool":0},"XUxkfEcihsV2tZA-m6MBbA":{"text":"Has so much potential, but the service in this place was AWFUL. The first time we came in ","useful":0,"cool":0},"GcfXoIj0MS2mPSkDkuPy9A":{"text":"Finding food on Fat Tuesday evening was kind of a mess last night, but walking around The ","useful":5,"cool":5},"JWUwxvk-dJNvyqzwCwgggg":{"text":"Cool atmosphere. Service was a bit slow. Food was just ok. Had the fish and chips for $22.","useful":0,"cool":0},"DcdJbvCQ5uArX6V78LuBuw":{"text":"The best pimento cheese and fish and chips I've ever had! Loved are little nook with a cur","useful":0,"cool":0},"smaGgB8m_7PMcj5m90iBGw":{"text":"One of my favorite places to get a night cap in a dimly lit room with the nice quiet mulli","useful":0,"cool":0},"vYDck8-emXUqX2CTSJKZxg":{"text":"This is a great find a few steps from Bourbon Street. It is like a private club, on the or","useful":0,"cool":0},"rV8Q3OUSQufvcLyOMCZIOA":{"text":"Came here for happy hour with my husband and it was such a great time. The decor was class","useful":0,"cool":0},"TZspMyZbwiQL4e70Gu2ntQ":{"text":"If you're looking to have your dinner partner fall in love with you, take her to listen to","useful":1,"cool":3},"HZYQXXP8tU_KaHLZ9NSTxQ":{"text":"Good food, good location, and great service! It's an absolute treasure! Perfect for date n","useful":0,"cool":0},"vq7-WW9IIucDb3Q9LEnuVA":{"text":"I went to Bombay Club years back, a week before Katrina hit New Orleans. Their salmon were","useful":0,"cool":0},"3wX14s-rr803nmqT9iBLAg":{"text":"Happy hour in the courtyard was wonderful! We had the Caesar salad, duo of beets, pretzels","useful":0,"cool":0},"UikbBZPZO-kiTgtZw1qRVw":{"text":"This place is the second best martini bar I have ever been to (following closely behind Lo","useful":4,"cool":0},"anp1x0ulxmdkrQ8ppE2SIw":{"text":"Had heard so much about Bombay Club and was very excited about checking it out with a wedd","useful":1,"cool":0},"TBUNBPyQfeW-hAhKVt0Lkw":{"text":"I visited briefly w/ 3 friends on 1/5.  I advised said friends that the worst 2 mistakes y","useful":3,"cool":2},"cCwIwT5txDnwGpQ0_x6Npw":{"text":"This is a great place to take a date. Romantic atmosphere, tasteful music and awesome drin","useful":1,"cool":0},"VEuI-hFxZKTf_wMHPzMqbQ":{"text":"I came for the atmosphere and the drinks. It's a hidden little gem, live slow jazzy music.","useful":0,"cool":1},"9mooCCh9oGN1Zd0Rxd6MfA":{"text":"This place is quaint, cozy, and has an eclectic menu of marvelous chef creations. Enjoyed ","useful":1,"cool":1},"vw4ukWZ4MDH3D_6P6Wv_9w":{"text":"The drinks were delicious and the bar staff was fabulous... we had a reservation and when ","useful":0,"cool":0},"GTwGUgfJeWOHbV7IlJ7oBQ":{"text":"Came here two nights in a row for happy hour. The food is ok, but the drinks are on point.","useful":0,"cool":0},"Bpmj0LTiVo1i89zqbRP-Dg":{"text":"We didn't really know what to expect as we were walking in but were immediately taken in b","useful":1,"cool":0},"g3odlEck9M1F73ze6HH4Vw":{"text":"Good food and good ambience. \nOne of the best mussels I have eaten in my life. \nTotally re","useful":0,"cool":0},"LrRGxlgbFTpriIPFhiUoXA":{"text":"Food is A-Mazing! Service is impeccable, and the restaurant not only has live jazz, but is","useful":2,"cool":0},"diD9KZXflB33Mq92om8ZQg":{"text":"Essentially tucked into a garage, this spot wowed us with the boudin and crab beignets as ","useful":0,"cool":0},"WXxmSW5o6b2u-PXuQhoPKQ":{"text":"Smoking hot outside but inside it's cool. there is jazz playin, food is delicious  and we ","useful":0,"cool":0},"Md2ZDCCd4PXF3JynEGi9tA":{"text":"Hmmm...somewhat conflicted on what to review this place as the service wasn't that great, ","useful":0,"cool":0},"C0caM0eqKR77DGYXxDjXrQ":{"text":"Incredible experience! We went to The Bombay Club to celebrate my friend who is getting ma","useful":0,"cool":0},"Cca7xFdskG7MIJXthTJ9Mg":{"text":"Great service food and music. Great place to go on sat night. Had steak with bernaise sauc","useful":0,"cool":0},"AykvyiK3nBhIfge-Im2XZw":{"text":"Excellent food and ambience!! Loved it. Gulf fish with chorizo rice was out of the world.","useful":0,"cool":0},"qUm3k_VwoMUMA-EXv38SwA":{"text":"Excellent food, but service could be better\n\nI was here the week of Mardi Gras for work an","useful":1,"cool":1},"0t1p0sAoKOvvjo5q-xbUag":{"text":"I have been here twice now -- came right back during my next visit to NOLA because I loved","useful":0,"cool":0},"l6KG35vrbriOC5FT7dqCJQ":{"text":"Yep, best martini in the city. Hands down. Food menu didn't excite me but that want why I ","useful":0,"cool":0},"SSpo_OoztK85VfR-cJbsuw":{"text":"Our French Quarter host took us here to his favorite local place \"Where everyone knows you","useful":0,"cool":1},"ig-Qet3a5I8dBKNNPNu9yA":{"text":"Snooty, arrogant, and rude.  Had to practically beg for service.  Finally gave up and left","useful":1,"cool":0},"OCo6sJTW8hgpfAOR179cgA":{"text":"Had a nice atmosphere, but we were disappointed by the service of our waiter. After he bro","useful":0,"cool":0},"IzNMp8HC2ccLle9gGEkCzg":{"text":"Decided to give them another chance to get things right. I was hopefully optimistic that i","useful":1,"cool":0},"GfWznmnz5XGc-2leha0zGA":{"text":"Couldn't decide what to order so I opted for a basic cheeseburger!  It was wonderful! My h","useful":0,"cool":0},"6ppHMyKSj0ZuFugYIg_t3g":{"text":"We went here with my sister-n-law for our 20th anniversary dinner while staying at the Pri","useful":1,"cool":1},"WUl1hPEFhHBnKcuBnPaJHA":{"text":"Really enjoyed the atmosphere and Sunday brunch. Everything was delicious and the service ","useful":0,"cool":0},"zV0-LCrh60MJuqxOZFWo-w":{"text":"Fun atmosphere, great food and a great location. The fried Brussels sprouts and truffle ta","useful":0,"cool":0},"OcsszPzSLOd80_suJsDrkQ":{"text":"Excellent food and so-so service, I went here with TUCP board members for our annual dinne","useful":0,"cool":0},"MEeDM2lEbkSyjDwa-q2ENQ":{"text":"if youre into speakeasy craft drinks, this is the place.  expertly made.  our bartender ev","useful":0,"cool":0},"jsLmOWG5d_ZpmUUPGry8jw":{"text":"Although we went there for a wedding anniversary dinner, this is a great spot for a girl's","useful":1,"cool":1},"FgJN8V7ZLO7D9B2vF78QYw":{"text":"Barbeque shrimp was awful. Seemed close to raw covered in some cheap sauce. Just disgustin","useful":0,"cool":0},"dRDKKxJNa0RN1phFp1lkpw":{"text":"Eh...nice atmosphere and calm.  But the steak came out cold and was so greasy I couldn't f","useful":0,"cool":0},"_dEWjPhKDDyhQ5oTel6y2A":{"text":"I end up here mainly for the bar and not the food.  The food is decent but there are reall","useful":3,"cool":2},"k38WLf1gGZSKT9GVq7qPsQ":{"text":"This place has a STELLAR cocktail menu and ambiance to spare. I only had time to stay for ","useful":0,"cool":0},"P58l-I0Fjv5XwaVBhZJfMQ":{"text":"Great décor, very classy.  Excellent happy hour food specials (definitely recommend the po","useful":1,"cool":1},"3SIR4-mxfP__CjWXTsumbQ":{"text":"The Crackilin Crusted Fish and Chips was great!the appetizer was amazing, Boudin Scotch Eg","useful":0,"cool":0},"CRS0827PR1zhQ1rr5V1HRg":{"text":"This place is so great. The atmosphere is perfect - dim like a dive bar but with cool alco","useful":1,"cool":2},"Nt7QPqQRQdMSptQhi0UeZw":{"text":"Bombay is under a new management and I must say it is very good.   We went into the French","useful":1,"cool":0},"vNy855Cgq-aR8JzRb0YpdQ":{"text":"Exceptional cuisine so what we loved was the perfectly cooked filet mignonette with Stilto","useful":0,"cool":0},"D9YXNTBdeiL6XeblvKvkLA":{"text":"At last night's Royal Street Stroll, The Bombay Club served a short rib slider with spicy ","useful":0,"cool":0},"zlSaoQ5qkm38NOr7inUHjQ":{"text":"Really enjoy this place and try to stop at least once each time I'm in New Orleans. It is ","useful":0,"cool":0},"FTRLoQLcEViFeivahnGDCA":{"text":"I've never eaten here but I'm definitely a fan of the Bombay Club for a pre-dinner drink. ","useful":1,"cool":0},"ZiOKpM-NU9vVoJyJXSxxww":{"text":"This was a nice experience.  The bartender was friendly and shared some history of the bui","useful":1,"cool":0},"WgAj4BzvFOekrtA0Fa-2VA":{"text":"Excellent restaurant. The ambience provides a nice respite from the raucousness of the res","useful":0,"cool":0},"n82pGNLhy9ftnV0E3N7MEw":{"text":"One of the classiest dining and drinking establishments in town.\n\nThe Bombay Club, hidden ","useful":0,"cool":0},"3CHx7ds3f12Xcvzgkp1yQQ":{"text":"Nice atmosphere and very good service. The food is good in general, on the salty side. \nWe","useful":1,"cool":0},"ZjxSW-EGyXxmuZiR-iz_bQ":{"text":"I was very much looking forward to visiting the Bombay Club.  We walked half way through t","useful":0,"cool":0},"t1J74Zf03o8b01ys5yXfGQ":{"text":"I had a very surreal night here about a million years ago and then didn't come back for ye","useful":8,"cool":5},"5hmjWSDnWz2QRRxLTrAMug":{"text":"we stayed at the hotel next door, so the location was perfect the restaurant / bar itself ","useful":0,"cool":0},"6pBeyEGlndVGTSjBpeuYgA":{"text":"This place had a great menu, but it's really dark inside.  It needs a remodel to liven up ","useful":0,"cool":0},"8KlpsKgWEARN1YprGQRAlQ":{"text":"Wow wow wow. So impressed with this place! As soon as we walk in we are transformed into t","useful":2,"cool":1},"PQ-1B1bKipzDA7x_YhMbHw":{"text":"Decided to go out for dinner and drinks with the boyfriend. Staying at the Prince Conti ho","useful":4,"cool":3},"BIIiFSYvo60CMJJQDsrvog":{"text":"I really had high hopes for this place, but it was a very busy Friday night. Only if what ","useful":0,"cool":0},"88V5HgRYCWP-bMfK5oqlZA":{"text":"Another great find in #followyournola recommended by a local friend. Romantic atmosphere, ","useful":0,"cool":0},"EkLsVcczuuS40Yb3f6n2iw":{"text":"I was excited to visit this place because of the speakeasy vibe I had read about.\nOriginal","useful":2,"cool":2},"qQmt8mJm0OEZ3Gyf-0WnLA":{"text":"I loved the old school interior, I did sort of feel like I was walking into a dark bar in ","useful":1,"cool":0},"daVwoR7QmWd5nyArgEeJcA":{"text":"Wonderful...fabulous...great...was almost put off by the reviews here that painted it as v","useful":0,"cool":0},"IUI4V640MK54xQvd98OKmw":{"text":"Step back in time, savor some sazerac and enjoy the jazz as it steeps over this dark, cozy","useful":1,"cool":0},"ih-eEA9eBhRnen--s-iAjw":{"text":"Amazing! The whole ambiance is the best. They have live music while you eat or drink. The ","useful":0,"cool":0},"AEDfuAZX-AkBLSeuC_DCEQ":{"text":"My wife and I visit this wonderful place each time we visit the city.  Nostalgic setting f","useful":0,"cool":0},"FHoTcyNx3_j0H4-sFHd7XQ":{"text":"Great food, great service and good music! We had the roasted pork tenderloin  and blackene","useful":0,"cool":0},"8Vscqfz6Ch_qfRg1Bxh6gg":{"text":"Let's do the time warp... please? \n\nI realize I've never made this plea public. I might ha","useful":16,"cool":12},"wypK7zvZTnOvWwVnG-C9Kg":{"text":"Excellent service, proper recommendations, an excellent menu and enjoyable relaxing ambien","useful":0,"cool":0},"ksTVM6lEAB-pCzBTjPs3AA":{"text":"This is a favorite spot for a pre dinner cocktail.  The chocolate martinis are fantastic -","useful":0,"cool":0},"An9m5LVMVBpohmvZwB--uA":{"text":"Meh. You walk in and the place seems fancy and certainly conservative. Fine.\n\nI had the sh","useful":1,"cool":0},"pBm2OKopZGwQZCXSK59mXA":{"text":"Came here for pre-dinner drinks during happy hour. Service was not the most attentive, but","useful":0,"cool":0},"MGbjWdsdSCTkjrZfmP9d1A":{"text":"Exceeded my expectations. An oasis of charming sophistication just steps away from the deb","useful":1,"cool":1},"Zfinq2o5jlJQUZ1Vqjavpg":{"text":"Nice, clean decor.\nGood deal happy hour special.\nHigh quality craft cocktails. In glass. I","useful":1,"cool":0},"Z188CrAHiN2c4c4rbc5A-g":{"text":"I was completely and irrevocably disappointed in my experience here.  After hearing so man","useful":5,"cool":4},"-fqA1i9O-O7XdfLRBc9SAQ":{"text":"Excellent atmosphere. Service was very friendly and attentive. My husband and I both were ","useful":1,"cool":0},"E3DsXjaD-a0KfS6UBb6_Wg":{"text":"was here for their official opening last week and was hugely impressed with the space.  As","useful":1,"cool":0},"fAF81dcxN3ozgJCYREgx6A":{"text":"Bunch was delicious! Bottomless mimosas or sparkling rose for only $10! Grits were amazing","useful":0,"cool":0},"FUb77JGR9UvU-j98QPcvCA":{"text":"We stopped by this wonderful place for happy hour and got the poutine, the Rangoons, and t","useful":0,"cool":0},"TXy1JM8VnqukCsHUdsJU1g":{"text":"I first went to the Bombay Club about 9 years ago on my first trip to New Orleans. Our dri","useful":1,"cool":0},"7PS2qoJbpMazcten1KpC8g":{"text":"I had the boudin Rangoon, pork belly tacos & cajun poutine. We came here for happy hour. T","useful":0,"cool":0},"evph7GZF97cAI2pY-U4gRA":{"text":"Nice atmosphere and jazz music along with fun specialty drinks.  Good food and presentatio","useful":1,"cool":0},"1Dgdf0lyG_Ul343B2L0t7Q":{"text":"So happy we tried this gem of a restaurant. The food was amazing. Our table had a variety ","useful":0,"cool":0},"yuECEz9MaWRy3mgs4pZZaQ":{"text":"Enjoyed seriously crafted libations here.  The owner makes sure to use only fresh ingredie","useful":1,"cool":1},"8ocqHG7AIAauo53g4rufJQ":{"text":"Disclaimer: I didn't eat/visit The Bombay Club.  My review is based on my experience worki","useful":4,"cool":1},"g67lkU_8-KQA78uXkq_lfg":{"text":"Dark, cool and excellent. 20's speak easy feel. Great service and some of the best cocktai","useful":0,"cool":0},"JLvQiXrAXlouKIFJkeUD2w":{"text":"Brendan at bombay club is out of this world. He catered to every need I had,  and was more","useful":0,"cool":0},"nwc5yNqvWs6HUpjQpzv6ow":{"text":"My cocktail tour of New Orleans concluded here.  There was a huge variety of martinis to c","useful":0,"cool":0},"NfxKtgcWURAbI5yNzlzcnw":{"text":"I must start with the obvious kudos for their wide selection of martinis!  They have a gia","useful":0,"cool":0},"DukN7Szg9OvBlj8gHJ-VFw":{"text":"We enjoyed dinner here twice in the 6 days we visited during carnival season! The food is ","useful":0,"cool":0},"lSQTz7GmeUlbjA46OQfoJw":{"text":"Had dinner at the bar last night.  Terribly disappointed in the food, the wine list AND th","useful":1,"cool":0},"2p4Bl2EBOCJAIqb1eXxM1Q":{"text":"dropped in for thanksgiving dinner.  i wasnt on a date, in fact i was with my uncle.  let ","useful":0,"cool":1},"UkgW82VEzsGpOTqyKHwiuw":{"text":"Can't say much about the food because we didn't eat here. As a matter of fact we never got","useful":0,"cool":0},"OiXmZbGosME6u4h3JZf07g":{"text":"3.5 stars \n\nIt's inside a small hotel off a side street so it's away from the noise and tr","useful":2,"cool":1},"7siJ20KX3Gpa_5d0lSE8ag":{"text":"Ok my first time here. I had the Pork belly Tacos to begin with. The main course of Pork-c","useful":0,"cool":1},"XYlXVLOYW2lciKstVNr7uQ":{"text":"I came here while I was in New Orleans for a business conference, which brought an influx ","useful":0,"cool":0},"0YVzTyRx8ytR469-G8Z_Ww":{"text":"Fantastic accidental-somewhat- hidden- find!  We were originally supposed to go to Bayona ","useful":0,"cool":0},"AhqpTvlHg8yHxAjMc52RWg":{"text":"Very cute dark bar with shaded lamp light.  Felt like a 1930s speak easy with Mint Julips ","useful":1,"cool":1},"OqGEtrptKBRAYBc4hDNDCQ":{"text":"Great place. Very classy. Great live music. Food was great & has a VERY big drink menu, sp","useful":1,"cool":1},"b_uL8-xlJV5Ux9qyOruJ9Q":{"text":"Stopped in for a small bite and cocktail before meeting up with some friends in the French","useful":0,"cool":0},"xuKmnIgWhEaFv-7krs7abQ":{"text":"Came here as part of a cocktail tour.  They are famous for their martinis and the bar list","useful":0,"cool":0},"HzSnxx7yftS2oqh-WxffIQ":{"text":"On a scale of 1-10, I give it a 9.5.  The food was fantastic. The Brussels sprouts with ba","useful":1,"cool":0},"yJCumpJv2F5MQGLTkfNMvQ":{"text":"Very nice hideaway with wonderful people; but, a shadow of the place which was one of the ","useful":0,"cool":0},"47idmXMQX81y-RDIKZoIFg":{"text":"this place is cute and very romantic like the perfect valentines dinner spot. i loved how ","useful":1,"cool":0},"ePCIv_larcVboOuW7Dtmfw":{"text":"I love the ambiance of this place and always go there for late night cocktails and some mu","useful":0,"cool":0},"HB-SW7I3fp1vp7wznX0J5w":{"text":"The worst service I have EVER experienced!  The waitress was snobby, rude, and didn't eben","useful":1,"cool":0},"0EoZiayEhVo7fHdm8W0o9A":{"text":"Service was great! The setting is very intimate. We had a private booth with drawn curtain","useful":2,"cool":0},"xMf5CJht-PKSFFzHuyrqsg":{"text":"One out of three bartenders at this bar have a fully respectable beard.\n\nYou wouldn't thin","useful":0,"cool":1},"i8BIG6TeMefk98QWMm9XrQ":{"text":"I had a wonderful time here! I had called in advance to set-up a plan for my proposal to m","useful":0,"cool":0},"5g9TTLtYofWwIfdTeNuTsw":{"text":"The Bombay Club is the definition of a classy joint. It is perfection. Delightful live mus","useful":0,"cool":0},"S-C8ZXVNedn4C-GBWoupJw":{"text":"Surprisingly good! The entrance is a bit awkward, the interior feels confused like it's un","useful":1,"cool":0},"jeBLZESbZQPuNmYt6PpDCA":{"text":"As I wished to avoid the rowdy Bourbon Street bars for a night, I got a suggestion from a ","useful":2,"cool":1},"t-RViJBFrNBOZEaDxFtlqQ":{"text":"Amazing cocktails. Lack luster food. The fennell and beat salad was covered in fennell bri","useful":0,"cool":0},"5g50dEGQpFzIb-VGW_v3oA":{"text":"We went to dinner last night (Xmas eve). We were disappointed. The drink order was incorre","useful":0,"cool":0},"_T99mByoaGJwRzoUhxdWbg":{"text":"Came here for happy hour (4pm-7pm) on a Thursday night; the happy hour menu is all $3 for ","useful":6,"cool":6},"WN-RqfIDC3FyA8Plbxq2dQ":{"text":"One of my favorite bars in NOLA. Great music, good food, and Blake the bartender is outsta","useful":0,"cool":0},"UbLnQn6tKMOQpA5_erl0uQ":{"text":"Great little hole in the wall between Bourbon street and the French Quarter. $3 apps and d","useful":1,"cool":0},"Y3IWMy75EpyNp66Uw-cYew":{"text":"Just left Bombay Club. We were looking for a great place to celebrate 34th anniversary. We","useful":2,"cool":1},"V2d40Rhgbzjt-x-1dUS4fA":{"text":"WARNING. BEWARE!!!' I love this restaurant, please consider trying it if you haven't alrea","useful":3,"cool":1},"lCSEaOTOuRJLjkRz6rZpNA":{"text":"We got here after going on a drinking tour. We didn't have a reservation, but the maitre d","useful":0,"cool":0},"eeM8Ha2jc-ul5CRwOBXN6Q":{"text":"We just had drinks here. Been here several times and never had the food. They have changed","useful":0,"cool":0},"z--G1fKQyFQYfMZza19DcA":{"text":"This review is only for their happy hour. \n\nOn my last day in town, I wanted to grab a sma","useful":1,"cool":0},"you-YS5RegQZP-ax6WW2Sg":{"text":"This place is freaking cool! First off, I'm gonna say that the drinks are pricey, however ","useful":5,"cool":2},"-qgnj16v8KZLVD_MlJ-CQQ":{"text":"I truly enjoyed the meal! I started with bbq shrimp and finished up with the hangar streak","useful":0,"cool":0},"68frLX1E9vqX6J3w3hsChQ":{"text":"Been here twice and love this little gem.  Hate to write a good review and share this, but","useful":0,"cool":0},"S18sZMZIXKFVvRqcBr3t-A":{"text":"Spent several days in New Orleans and this was my go to bar since we were staying at the P","useful":0,"cool":0},"fnID26Ee0mXzQiack51JzA":{"text":"I've been here a few times and always enjoyed it. The brunch menu is great and the enterta","useful":0,"cool":0},"yCk6dagpfiKaq70DfpeK4w":{"text":"A perfect birthday brunch thanks to Ashley our lovely waitress. She was so kind and attent","useful":0,"cool":0},"x1KuUjbTuDJUN28tTPYIqg":{"text":"Before leaving for my yearly New Orleans trip, my parents recommended this place for happy","useful":0,"cool":0},"TBIXUyC0NuASbGq-veT_9A":{"text":"I went here the other night specifically to listen to the pianee player: The man, the myth","useful":2,"cool":1},"yDIf2aB5BKbygtdN_kIUgw":{"text":"Stopped in for cocktails and dinner and wasn't disappointed. The brussel sprouts were to d","useful":0,"cool":1},"w3JtqDvSqUSB-HvLNoGrHw":{"text":"Fell in love with this place immediately.  Dark interior, leather chairs and couches, Sina","useful":2,"cool":1},"7UYBegOqxDFA-yh8DT6akg":{"text":"The food and drink were excellent.  I'd definitely go back.  The service was good.  The on","useful":0,"cool":0},"XVMwIApXaz2_rytE2-fzNQ":{"text":"Awesome burger! Great happy hour! Hidden away from the street.  Ask for Sammy! SAMMY SAMMY","useful":0,"cool":0},"DFedDNs0jEQRt8aU3tsETA":{"text":"Let me start by saying the service was impeccable. We were able to make a last minute grou","useful":0,"cool":0},"CXAI6U2sv2cw-5As2xA7vg":{"text":"When we walked in, I liked the atmosphere. The glassed-in courtyard looked nice, but it wa","useful":0,"cool":0},"_Mv_X2IbfKEx3bgTWIlJyA":{"text":"Hubs and I were in town celebrating our 25th anniversary and I decided this looked like a ","useful":0,"cool":0},"j-BWLefzgd5IDfcx4leQLg":{"text":"This place has a huge selection of martinis, so we decided to come try it out. I was pleas","useful":2,"cool":0},"BowtJs_JjOaM5ML1R2xdrg":{"text":"Came here for happy hour with a friend before catching the LPO at the Cathedral. \n\nI like ","useful":1,"cool":0},"IRYIqOe-CuvRWqpfDPLrYw":{"text":"As I've said in my reviews of other establishments in the city - there is something unique","useful":3,"cool":1},"XrAJAYOq_dWeJKE3_788AA":{"text":"Not only does this place serve up a mean martini, the food here is amazing.  We go for Lob","useful":3,"cool":2},"fGaFo619Mnn27lesTzRwXw":{"text":"What an outstanding experience! $10 all you can drink mimosas started things off right. Yo","useful":0,"cool":0},"gilUPO2CfAs_GCRjcRPwMw":{"text":"Me and my wife had dinner reservations mid-October on a Friday evening.  We walked in, we ","useful":1,"cool":0},"S7UZanJsLzzdzOD2rfJI-g":{"text":"My friends and I ate here during Mardis Gras last week. I have been there before quite a f","useful":0,"cool":0},"yN5M9twCsqjo7Z2yK-51Hg":{"text":"Nice upscale restaurant. Waitress messed up my order after talking in length about it, wou","useful":0,"cool":0},"M2KUFrwiGDUrjgOYEUQyKQ":{"text":"Good atmosphere and drinks, otherwise only average. Steak and drum were only mediocre. Pia","useful":0,"cool":0},"hMek-N6WZ664tDt5ke7_TA":{"text":"Enjoyed! Nice atmosphere and definitively for the adult non bourbon st adult. The bartende","useful":0,"cool":0},"LoWLWhrsL8cOziPVk6nzAA":{"text":"This has been our favourite happy hour place in the French Quarter... Great prices, great ","useful":0,"cool":0},"tTsz5xj9Wi8fYxXhIp4t0w":{"text":"Booked Christmas Day Brunch 2018. Waiter not friendly, didn't even crack a smile once. We ","useful":0,"cool":0},"ZzY53iH6eHD5YdQkae6Vrw":{"text":"Quick evening bite to eat. Very attentive waitress, good food, we enjoyed everything. Live","useful":0,"cool":0},"e5QbIayvfCqYzF13Y1zQiQ":{"text":"Loved this place! Honestly I'm not even sure how we chose/ended up here but glad we did. O","useful":0,"cool":0},"P7-DMT8AWeWZGSybpEBTRw":{"text":"We had breakfast there this past weekend only because the Conti cafe had a 30 minute wait ","useful":1,"cool":0},"hBECQH8tKkiBD2bssfPTFg":{"text":"A gem hidden in the Quarter.  Don't expect a lot of seafood, don't expect lump crabmeat on","useful":2,"cool":0},"TUQv1yw6-PdORKQDLst_pw":{"text":"Unfortunately this is Yelp so I have to give at least 1 star but If I had to give a true r","useful":0,"cool":0},"oGS8Q-E8KFsrjqwRwxAHag":{"text":"I went with my husband for Valentine's Day and loved it. So, that's where I wanted to go f","useful":0,"cool":0},"d1WCPMKj3RJ6sQpbq2Ozxg":{"text":"Amazing brussels sprouts and craft cocktails. Such a fun restaurant.  I try and go every t","useful":0,"cool":0},"DtoKQBbH-Gvg4bScHCNgcA":{"text":"It's a restaurant!  It's a nightclub!  It's a bar!\n\nThis is one of those places that you h","useful":11,"cool":1},"Ch-0c1avmmdFPfqtppo7hg":{"text":"Wow. Came here for a date night during our first time trip to New Orleans. We started at t","useful":1,"cool":2},"NrHQ08NCkgkfX-R9DJjyaA":{"text":"Very elegant location for a meal. It was intimate with several spots that could be great f","useful":1,"cool":0},"OY8KH4N4h2y9zL-cMt5NIw":{"text":"Great ambiance, very good food, attentive wait staff and good music.  It was the best plac","useful":0,"cool":0},"9KLd01PjyE7zVrYi4383lA":{"text":"Great drinks and an excellent happy hour. The sazerac is their own take but damn good. The","useful":0,"cool":0},"XM0LGXkpl_fsESSGqfVlCw":{"text":"It's hard to be honest, but this was just OK.  \n\nI loved the atmosphere, the owner (who hi","useful":7,"cool":2},"8HfHSfSZxwjB7kzjHdHNiA":{"text":"Food and service was excellent. Live music as well. Super chill spot and well worth a visi","useful":0,"cool":0},"CvDkNVuEkSXdoHJmOmp4Fg":{"text":"As others have said, this is a hidden jewel. If you're a fan of \"music\" that depends on it","useful":0,"cool":0},"rEKdV6NtfoKbKM7SczLhjQ":{"text":"This place is predominantly known for its martinis however we were delightfully surprised ","useful":1,"cool":2},"zp34rS48gC2gULHfwi5UwQ":{"text":"Savory beignets were delicious! Shrimp & grits were awful! Carrot cake was heavy and hard.","useful":0,"cool":0},"XGX88DLmOSj5NSSi1oEXQw":{"text":"AMAZING BRUNCH!!!!! $10 Bottomless Mimosas and EVERYTHING on the menu is delicious! Servic","useful":0,"cool":0},"_QfX972-D8Orv-oHGiOu7g":{"text":"Great atmosphere! Wonderfully amazing food!! Chef Nathan was a sweetie and is unmatched in","useful":1,"cool":1},"RKHP7OScJ3DXwzKychfx3Q":{"text":"We were here for Christmas dinner.  I loved the atmosphere and the cocktails.  But I think","useful":0,"cool":0},"n8yWgZfFd_unseDG0ch3Wg":{"text":"An interesting establishment aiming for a classy feel with premium food.  Pricing is very ","useful":0,"cool":0},"5sh582wCrJTZ16n7aV7iMg":{"text":"A MUST if you are in the French Quarter. Its just a block away from Bourbon St. but you wi","useful":0,"cool":0},"Pl9VhOkej6h46UOimLYBWw":{"text":"If I could give no stars I would! Such HORRIBLE service!! The waiter was so rude and unpro","useful":0,"cool":0},"sOXy4RnTSR_NGOqWDUB90Q":{"text":"I want to give this place one star purely based on service, but the food was actually pret","useful":2,"cool":0},"SE-bAIOLTp430mvCmzeORg":{"text":"I found this little gem at the last minute and boy am I glad. It is located off Bourbon St","useful":0,"cool":0},"U3pAqMLxWFC4nqita1yNBw":{"text":"Saw photos on Yelp of the burger and it looked like something my wife and I would love to ","useful":0,"cool":0},"Oj6QROeavCe0iQHDAnBVUw":{"text":"After arriving in New Orleans and playing in the French Quarter we decided on a quick bite","useful":0,"cool":0},"z-OsXQ8E8_rXI9cOhAW-mw":{"text":"If you wanna hear live jazz in New Orleans, but you want to sit down and relax while enjoy","useful":2,"cool":1},"OOC93Zoe6xEK17RmsHZ25g":{"text":"Special shout out to: Pimm's Cup and Fish and Chips \n\nA Cajun twist to classic pub food. T","useful":0,"cool":1},"pEoc0EU8dIvlQAWTIHF3FQ":{"text":"We had a reservation for 10 people at 9:30. As we sat down we were told that 2 servers wou","useful":0,"cool":0},"MH7n-xGI-AY7n_I1EfUXNw":{"text":"Great bartender Jeremy!  Thank you for taking care of a bunch of ladies last minute!  Grea","useful":0,"cool":0},"eKeomuoMqYDSfAT7m5sSdw":{"text":"Had a great time at the bar with a fun bartender whose name I regret not getting. She was ","useful":0,"cool":0},"b0LvVygti8RErPyE-pvR_A":{"text":"I enjoy the Bombay Club very much but recently had a disturbing experience with my bar and","useful":0,"cool":0},"BodQu6klpZ1suQ5D0PerFA":{"text":"Food was okay and the drinks were fine. Nothing too crazy to glorify about. The waitress w","useful":0,"cool":0},"408tsAmkDv7bm9idc3mMEQ":{"text":"This is located in the back of the hotel. There is a large bar area and plenty of seating ","useful":0,"cool":0},"RZ1SpKKCAfW6q854YnAQBA":{"text":"Had dinner here and then stayed for a few drinks and to listen to the piano player. They d","useful":1,"cool":0},"o7v9RKo9Sf7ayV_9KN8vrg":{"text":"My experience was very poor. Our server Ashley was great however her timing of bringing ch","useful":0,"cool":0},"O7D2wIxWcgW1OLYC-V-o7g":{"text":"Great atmosphere and service. One block off Bourbon Street and away from the craziness. Th","useful":0,"cool":0},"5mUu60-lReB60wvSVK9u7w":{"text":"This was a great spot, super low key and the bartenders were cool, i recommend going for h","useful":0,"cool":0},"9A0Yw3EhjqR8gr61mIY0Ag":{"text":"This has been the been the best place we have eaten the entire trip here in New Orleans. O","useful":0,"cool":0},"A1R4G9MillOqZCDq1dIMjw":{"text":"We had an incredible experience as the hostess and manager couldn't have been friendlier. ","useful":3,"cool":1},"XoQ-V09rju1-yioSRf6w-Q":{"text":"Happened upon this place while walking the French quarter. Was immediately drawn in by the","useful":3,"cool":1},"moeTltu-EHtvEH042SNm5A":{"text":"Loved this place. The food and atmosphere was great. Kyle who was our bartender was great.","useful":0,"cool":0},"W7qbU2prPuvDF3UI-tlhEQ":{"text":"Lousy service\nIf you are not at the bar and do get waited on best order 2 or 3 drinks \nToo","useful":0,"cool":0},"lG0dUq6iqiwE696okvRBWg":{"text":"The live band was great! This is what we originally came for. The drinks and food were not","useful":0,"cool":0},"tHJ9NKgGrUaDBYYyVuHKOA":{"text":"Christmas special lamb lollipops were DELISH!! The crab and chorizo beignets..?? YES PLEAS","useful":0,"cool":0},"NwQXj8jFJQQg_20dj348OA":{"text":"Hi,   I love the Bombay Club,  I have been going there on and off for over 40 years.  I we","useful":9,"cool":0},"UQc4TBt0ueh_yO5D0yv5Gg":{"text":"Great service; very attentive.  Cocktail menu is extensive but menu is a little limited.  ","useful":0,"cool":0},"3NIyq83ZdSy6qrWGJNfRfw":{"text":"My second visit here has left me pretty disappointed enough to write a review update and p","useful":16,"cool":5},"5vdN2LiWFThTW9fNKEYpyw":{"text":"I brought my mom here for Mother's Day. Looking at the other reviews makes me think they m","useful":1,"cool":0},"kMj8GK7UXNb_tJkx2rsw3g":{"text":"We searched high and low for the perfect brunch and we absolutely found it. The GM Chris r","useful":0,"cool":0},"L5v0LHjZkaZjvkrkIaVZhQ":{"text":"Came here at the last minute after our original restaurant had a kitchen fire, very much r","useful":0,"cool":0},"fL6SjTh9t6V86jON4EVZ-A":{"text":"When we return to NOLA  we will eat dinner here.  We had the gumbo. Smoked duck.  It was t","useful":0,"cool":0},"V26MEbd8REkk7cqlgiseHA":{"text":"First Class experience all the way around.\n\nI made reservations for Saturday Dec. 21st at ","useful":7,"cool":4},"R4yKwn-R7zI6WzYeYkIixQ":{"text":"Go here for high end drinks like old school martinis. Drinks come at high prices but the a","useful":0,"cool":0},"afDRYOKnH2Zo_uxXqudI0Q":{"text":"One of the best brunches I've ever had. The food was amazing, bloody Mary was yummy and se","useful":0,"cool":0},"Onu8el5yvFP8AzI0JgRJSQ":{"text":"We were looking for a restaurant with music, and although the music was excellent, the din","useful":0,"cool":0},"4c9sHwexNjKhdGUXT8qUBA":{"text":"This has been the best place we have eaten the entire trip here in New Orleans. Our server","useful":0,"cool":0},"nbT-tPaZtk_cHCDNTcAnXQ":{"text":"The ambiance saved this place from a 3 start review.  OpenTable had this at $$ but yelp is","useful":1,"cool":0},"toVv1Zr_3Y3XSprJSiuqUw":{"text":"Omg so we were strolling bourbon street on a girls trip and stumbled upon this place and w","useful":0,"cool":0},"e1QTOuyBpPxbparQ6CE6Qg":{"text":"Awesome happy hour classic old school French Quarter club!  Great crew working the apps ar","useful":0,"cool":0},"bb6Oysf9b3CN8rxwEi25kw":{"text":"A most outstanding place. Amazing drinks food music and place. I'm from Nola and I swear I","useful":1,"cool":0},"aeleS9DePaG5qELpqCtoPg":{"text":"The cocktails & brussel sprouts are to die for. We probably should have asked for a booth ","useful":0,"cool":0},"yNnirSFTa51pkzS70M8c9Q":{"text":"Stumbled into this place on Christmas and I must say I'm glad I did! The ambiance is very ","useful":0,"cool":0},"FdX2QvtwN5LaYpE6xwxuxw":{"text":"The ambiance at Bombay club is very nice. The service, however is terrible. It seemed like","useful":0,"cool":0},"gmYMoMtTggvs9tF3DhFHJQ":{"text":"Well first off the service was great, cocktails were quite good. But I had the mussles and","useful":2,"cool":0},"AflxkOtGUTHKcS0cX6u-Tw":{"text":"My husband and I were starving after a full day of flying to NOLA.  After checking many re","useful":1,"cool":0},"EqJBrWrL1q2dvPPnRLeTGQ":{"text":"So we came to this place on the recommendation of a friend who visited the city some years","useful":3,"cool":1},"Tiyx7vb-z-E96DzBiGCGpA":{"text":"Beautiful atmosphere. Great music. Extensive drink selection. The menu is varied, with cho","useful":0,"cool":0},"0u_QM5A8N30tAycLFWu3wA":{"text":"Drinks and atmosphere are amazing!  Their new menu doesn't go with it!  Wait staff and man","useful":1,"cool":0},"1HWgFAjUvLEG5usEv4CNqQ":{"text":"A great place for dinner. We went this place for thanksgiving dinner. The turkey is decent","useful":0,"cool":0},"8iOBYYqqburT0_4xYiN1Uw":{"text":"Showed up for happy hour.  They have daily specials for $5. The day we arrived their HH da","useful":0,"cool":0},"0-ExsjOfYcbkL_Q9KctcYw":{"text":"I was not impressed with this place at all, and maybe that's because I really had high exp","useful":0,"cool":0},"bLf2dEIKIvkCH7ko4Yyp5A":{"text":"Ivona was phenomenal! She was the bartender and our waitress and I couldn't be more please","useful":0,"cool":0},"BsliNJsBEsHKYJsCH-hqvg":{"text":"Found the Bombay Club because of their happy hour specials and poutine! We were in New Orl","useful":0,"cool":0},"JAODhehcMTvH5d_LiRGNaQ":{"text":"The BEST New Year's Party was this past year at The Bombay Club. Live music, great cocktai","useful":0,"cool":0},"-LbcVMq0jmFqer8VubkUMw":{"text":"My hubby and I came here for dinner during our trip.  The drinks were unique and strong.  ","useful":0,"cool":0},"Zz3ZHYR2-2GXzse4jhwbXg":{"text":"Food and drinks were good. It was the costumer service that was beyond horrible. It was pr","useful":0,"cool":0},"m7bmjoNsM3xZVg55yms5gw":{"text":"if you are reading this review COME TO THIS ESTABLISHMENT. \n\nthe service, the food, the qu","useful":0,"cool":0},"BRQvxxNIfOdPCgC6rCqrVg":{"text":"So we came here the over day we are staying at the Prince Conti (awesome) the hotel bar. W","useful":0,"cool":0},"CuKmwFOKxNjvjCFwIeUT7Q":{"text":"When to The Bombay Club for breakfast, great food, excellent service and unlimited mimosas","useful":0,"cool":0},"8BpYvGkIPGg_gyaEwaAmhA":{"text":"Old school, classic dark wood ambience.  The service was good.  The food was pretty good a","useful":0,"cool":0},"ibLbhL4x2CG-pD5YehdX4A":{"text":"The Bombay Club is back. After 9 years, I finally returned for a meal.  It would have been","useful":0,"cool":0},"TWpKBQNv5OCh00s8a-GTvw":{"text":"Really nice little club. Good jazz, yummy food and great drinks! It's adjacent to Prince C","useful":0,"cool":0},"wuEU_tf3uy2XVz69MaOz0w":{"text":"A hidden oasis of solitude and class just a block off Bourbon Street. Full disclosure - th","useful":1,"cool":2},"l7kOs_RbAX_DT4MY-ynjWw":{"text":"Excellent service, delicious (and expansive) drink list, and lots of options for seating. ","useful":1,"cool":0},"tdrF2KQCUhZQHyb-61KPwQ":{"text":"Among the best shrimp and grits, little bit spicy from the jalapeno, shrimps are bbqd. Fiv","useful":2,"cool":0},"QZVQyQ6RopX9kPfWZgXudw":{"text":"Situation\n- Tuesday evening dinner with 4 others in October 2019\n- I ordered the double-fr","useful":1,"cool":0},"apF0RJ_15kj3kUWa04Z3uQ":{"text":"Atmosphere is amazing and overall experience was great! Steak could have used a little mor","useful":0,"cool":0},"aUoUJEHy5Dytpc0D1PJ1UQ":{"text":"This place was amazing!  Our group of 4 went there last Saturday night and sat at the bar.","useful":1,"cool":0},"K_wsO7JPsPVhLK7gYh4zGw":{"text":"I absolutely love this place. The service, atmosphere and quality of the food here are gre","useful":0,"cool":0},"iqwh_Y9bNBzYT1n9kwNGuw":{"text":"I signed up for Yelp specifically to write this review.  In a city full of great eating an","useful":0,"cool":0},"To4nW7sXPVFlg2GHZc4XfA":{"text":"ALL THE WAY, FIVE STARS! Well, this is happy hour talk here. I almost don't want to spill ","useful":7,"cool":3},"6_KtIZTBcsL0pV1Fin-n2A":{"text":"Good food and entertainment. Service at the bar  was slow, but would still recommend.","useful":0,"cool":0},"5tyHLUBYZEH-7Wk6f3NCdg":{"text":"ORIGINALLY my review was higher..... but I checked my account today and they DOUBLED their","useful":2,"cool":0},"TIFtIht7303GEs-ndJNJ5Q":{"text":"And In Conclusion....\nAfter an hour of trying to decide where to a late dinner, and stoppi","useful":0,"cool":0},"ayGnEHuAW9ZAPW3vQAUSUg":{"text":"Nice place in New Orleans! I like the atmosphere, the music, the stuff.\nI like it and we l","useful":0,"cool":0},"pb8139sMe50pB6EBMOZ9YQ":{"text":"My husband has been wanting to try this place for a while, so we finally decided to check ","useful":0,"cool":2},"IAAxwl3ar7hdsS1z4jeuVQ":{"text":"The best brunch I've ever had. I had the bbq shrimp & grits. The bottomless mimosas are a ","useful":0,"cool":0},"WGKDsxbkzVRVejyrd3iGVw":{"text":"Amazing ambience, delicious food and brilliant service. We went all vegetarian and ordered","useful":1,"cool":0},"i6KQwlatPDfI7FvWw_jhjg":{"text":"Probably one of the places I would return in the French quarters. Only parking is a proble","useful":0,"cool":0},"4caVFay1S9INyoHwrpJwHw":{"text":"I brought some friends from out of town to try this place out for the first time and it su","useful":0,"cool":0},"CleI18dnjIpBFBgnLlXWWw":{"text":"Excellent food & drinks. Nice low-key quiet bar area!\nThe Happy Hour menu has great option","useful":0,"cool":0},"NApfjwYaX5UcYr5YZk-YaQ":{"text":"I would like to thank the Bombay Club for always making a stellar Sazerac and for turning ","useful":0,"cool":0},"MSYcBpQD2H13LYLe9Ln1Fw":{"text":"This club seems to be one of the French Quarter's secret gems.  The atmosphere bring you b","useful":1,"cool":0},"FQrCl71rQVkFmrMzKgKfqg":{"text":"Absolutely fantastic little place inside a hotel.  We went here for happy hour 2X because ","useful":1,"cool":0},"Ycmw5wzBoWzfUb5yZ0fh3Q":{"text":"This review got posted to the wrong restaurant and I can't figure out how to delete.","useful":0,"cool":0},"q5SLIho-Yh-mAD1W6R5lkw":{"text":"Great drinks, delicious food, fantastic music. Came on a Thursday night, can only imagine ","useful":0,"cool":0},"OO4Deg7u8CGMDGgP-vbzYg":{"text":"From the time we arrived it was off. Our waiter couldn't have been more rude if he set out","useful":2,"cool":0},"UilnOkF4BDIzOSQSbLrRkw":{"text":"So the burger was so so, it was dry and then served with spicy ketchup. The pretzel was go","useful":0,"cool":0},"DvQAanHFY1fIMxA-jXOGwA":{"text":"Wow!!! I have never had such amazing service as I did at Bombay. My sisters and I happened","useful":0,"cool":0},"Y3uG9l-zrJtMNmDIc-Tr2A":{"text":"With so many places to eat in NOLA, don't wast your time here. The place was not crowded, ","useful":2,"cool":0},"MS-r6-HbJJ3r8uvivm2oyQ":{"text":"Great little spot tucked away behind the hotel. You have to walk through the valet circle ","useful":1,"cool":0},"itlbQEW8_i3Gze28KI0cTg":{"text":"Everyone we encountered at Bombay Club was delightful except for our main bartender Jereme","useful":3,"cool":1},"YqV1Jv86mb2qilrf-swBbw":{"text":"Tired from a long day in the car and sightseeing, we decided to try The Bombay Club in our","useful":0,"cool":0},"TNk7c_7Gud_KIRLjev-elQ":{"text":"Came for great food and live music, but unfortunately we were too early for the music whic","useful":0,"cool":0},"NR7Wh2xeJR2_Az6Gzakz5w":{"text":"My girlfriend and I were looking for a good late night spot in the French Quarter off of r","useful":4,"cool":1},"5Lu9c_uEPalp3RYe5vWkIg":{"text":"Visited the Bombay Club on NY day. The ambiance is very nice being darkly lit, wood panele","useful":0,"cool":1},"NGwUtz584P7tGjpArIksoQ":{"text":"I ate here on my way from the museum and it was good. I ordered the shrimp platter and my ","useful":1,"cool":0},"YJWkmZ9FGDKHc3PT0F_kKg":{"text":"I made dinner reservations here based off yelp reviews and New Orleans \"revillion menus\". ","useful":0,"cool":0},"KL88wZFEp0j-M4NuBN5TqQ":{"text":"First of all, let me start by saying this place has top notch service and top notch food!!","useful":0,"cool":0},"E5yEk95jJnolleLU4-B7sQ":{"text":"Went to listen to Tim Laughlin last night and had a lite dinner meal while we were there. ","useful":0,"cool":0},"hcZjh1Iyyjv73quEf0ILYA":{"text":"Came here for happy hour and really enjoyed the light bites and 5$ daily cocktail special,","useful":1,"cool":2},"RQVcq71o6q03L72jPuEHpw":{"text":"DO NOT SLEEP ON THE HAPPY HOUR HERE! \n\nThey have happy hour daily from 4-7pm and it's basi","useful":1,"cool":1},"lnmKcA2NRcdfSoqCOy_2WQ":{"text":"Came here for brunch, and it did not disappoint. The food was absolutely amazing, and the ","useful":0,"cool":0},"sVVh9ONJuf0aYXEtSGLyQw":{"text":"The menu online looked pretty good so we decided to give it a shot.  The menu at the actua","useful":0,"cool":0},"gS4xu4lACXHkWvVMfHu2Tg":{"text":"I absolutely love this place. Such a cool easy vibe with live music. Kinda like a speakeas","useful":3,"cool":3},"4J0vGiCzdknW-2856ozJOw":{"text":"The Bombay Club is an oasis of sophisticated charm less than a block from the raucous deba","useful":5,"cool":4},"AORyyTqxxV58JgEPPSowgA":{"text":"We went here in a whim, and glad we did! The food was so good! At first we were like this ","useful":1,"cool":1},"zTq-641uLoTjUjxrYx4WJA":{"text":"We've come here with a group of 15 people for a birthday dinner. The ambiance is spectacul","useful":0,"cool":0},"3rK3Wh6cLFa5OPouzCvWSQ":{"text":"Old style nola. Leather & dimmed lights. Huge bar, lots of space, live music always! My ki","useful":1,"cool":1},"UgerpSuXiu0d3Z6MlwDNmw":{"text":"Super friendly staff! The best drinks in NOLA. We visit her every time we're in town... an","useful":0,"cool":0},"wEY6BomZoFyD_GMzly7a5w":{"text":"I came here with my colleagues for some drinks and we weren't disappointed. They have a ha","useful":0,"cool":0},"NSjDZ4XkFF1YKVw52UnW2w":{"text":"We came to this place based on the amazing reviews. I was quite disappointed as the food w","useful":1,"cool":0},"AILhQYB4_Hh6XG3KCLi70Q":{"text":"Music in a cabaret atmosphere at night Older crowd, well-dessed.  You can come in a T-shir","useful":0,"cool":0},"05f-sujkOFzBZK0S6dP3sw":{"text":"Hugely skilled bartenders can make anything or guide you to discovering new drinks. Defini","useful":0,"cool":0},"5i2woLpF30dVOdOc_qGXPg":{"text":"The griddle charred patties make the burger as close to perfection as it gets.  Just excel","useful":0,"cool":0},"O0dup7TdH0Xi7xavAtZkig":{"text":"Amazing spot that's hidden in the quarters! Brunch was delish all around. Great food and s","useful":0,"cool":0},"j864IKzz4uGYBik7XWlq5Q":{"text":"This was hands down one of the best restaurant experiences I've had in while. On a packed ","useful":0,"cool":0},"kSBy_Wx-6H2OojWIl_S6Fg":{"text":"Great food and a fun atmosphere. Lots of inventive cocktails. It can get very busy so I re","useful":0,"cool":0},"k5jhAOTcMChmP1VshiohmQ":{"text":"Nice atmosphere , good food and good service. Heads up, not open for lunch. Restaurant was","useful":0,"cool":0},"J1Nj4FqGp5rLUqmQCTobuQ":{"text":"Pure class. It was a class act all the way, from the service, to the ambiance and the pres","useful":5,"cool":2},"n28nC72L5ZMDUH-Uq5_RiA":{"text":"Nice little Bar/Restaurant located in the same spot as the Conti Hotel. The list of martin","useful":0,"cool":0},"Yw9QoQIqYbsfTZn1_L92FQ":{"text":"Let's start with finding this place. We went to Cafe Conti which had a 30-minute wait. Rig","useful":0,"cool":0},"6kErwYnMVFe7pLCi3ZHVvw":{"text":"I come to New Orleans a few times a year and would always visit the Bombay Club specifical","useful":0,"cool":0},"1t1BvTg_jihXNzyB22ZHUA":{"text":"The Bombay Club has always been one of my favourite places to visit when in Nola, but I do","useful":0,"cool":0},"d_UynhbMsCHJQpIZ2cTReQ":{"text":"Really great atmosphere, beautiful music by a live band, and awesome mustached server who ","useful":0,"cool":0},"rj_WXG1RK8jH4lKaMfg4Sw":{"text":"I visited New Orleans a year ago and came out to the Bombay club for some jazz and it was ","useful":1,"cool":0},"CmAxkPz414vBXloWNdpoAQ":{"text":"Such a great find! We didn't order food, just drinks but the options were endless (and del","useful":0,"cool":0},"IjBGWjHMYr-1BWNXe6HBEw":{"text":"The food was excellent.  The atmosphere was warm and inviting.  Our server Ashley did an a","useful":0,"cool":0},"iRzkr-82Y8L9jsy2r-4puw":{"text":"I can't rate it completely due to not getting any of the food. That will be the next trip ","useful":0,"cool":0},"2Wj2kGLuZNviAZXaA6Uajw":{"text":"My husband and I ate dinner on a Saturday night during Jazzfest. We live by the beach in C","useful":0,"cool":0},"4q3aOh06_ZXYdUGcSoDoLA":{"text":"Made a dinner reservation for 4. Was looking for live jazz and food for birthday festiviti","useful":5,"cool":4},"oDV3449Mz_6LOM5RXHN62A":{"text":"And now you have finally had a bad meal in New Orleans.... that was my experience at least","useful":1,"cool":0},"xxTD7LHHbmJWhcCk8cgLug":{"text":"I want to start off by saying that my girlfriend and myself absolutely love everything abo","useful":3,"cool":1},"os6_r46XAEP5-u0z9MhJgg":{"text":"We had reservations there. Promptly sat and everyone was very nice. Service was top notch.","useful":0,"cool":0},"Myy7QZ43Lk-wSY6h1n7RBw":{"text":"Hidden gem! Talented bartenders with a wide variety of drinks. Nice bar bite and dinner me","useful":2,"cool":1},"kOt-a4rHn6fVKDJYL5mtnw":{"text":"Searched high and low on yelp for a place that had live music and great food and found thi","useful":2,"cool":3},"QGMDhz-_9I_kVJxUYEvrqg":{"text":"Great little spot tucked inside our hotel. Some people may complain about slower service b","useful":0,"cool":0},"RiPrKZy54xAmRxn9HJHcKw":{"text":"We had Christmas Eve dinner here and it was outstanding.  We had a 4 course meal and cockt","useful":1,"cool":1},"qp-NkVc5mltetGvGoxT6RQ":{"text":"My fiancé and I absolutely loved it here! The ambiance is romantic and the food was specta","useful":0,"cool":0},"ZZXfaiZ6UB5b-VjmLJJijg":{"text":"I came to hear the great jazz bands that used to come here but was extremely disappointed ","useful":1,"cool":0},"jE3ABwEgepQa5CTP1EQ4AA":{"text":"Hidden gem in the French Quarter! Off the beaten  path, but close enough. \n\nCame in for dr","useful":4,"cool":1},"1qEswvtTlrI8Ye49Y3uP4A":{"text":"Decided to try happy hour here.  Ordered 2 martinis , (what they're known for). Cho Cho Ch","useful":0,"cool":0},"72SSsRG2U3kih8H62dZfzg":{"text":"Food here is delicious!! Drinks are superb! Atmosphere is amazing! I'm just looking for an","useful":2,"cool":1},"y4wJnR2CZ2lLbdITAXS4ng":{"text":"CONFIDENT OR COCKY?\nA comfortable mainstay in the locals' bar rotation, Bombay Club can be","useful":9,"cool":2},"PPwEYevJqoY-6DRf67JWBw":{"text":"A few friends took myself and my cousin to check out this bar. We had a great time listeni","useful":0,"cool":0},"mYS-zO8W1URG3JXw_EerBw":{"text":"TLDR: Tucked into a hotel driveway, this wood paneled escape serves awesome martinis and a","useful":0,"cool":0},"Q0Ln4D2Hrvton8HOsyrP1g":{"text":"Awesome happy hour and the drinks are really good!  Just a great place for happy hour will","useful":0,"cool":0},"9wxRwpzw6lp5uDpO1NNgGA":{"text":"My sons and I found this place by accident, and sheer good fortune. Right off of bourbon s","useful":0,"cool":1},"skkfc0nlZXgB8cRYVnNDtA":{"text":"Started out with amazing crab beignets, my dinner partners had the burger was a bit @mcdon","useful":1,"cool":1},"1o2aBXpe9Ncini_FrWTL_g":{"text":"I've been coming here for three years for their reveillon dinners and every time I bring p","useful":0,"cool":0},"44lNlvop-fL4i9m3WeeZwg":{"text":"This place is incredible. A must-go while in New Orleans, especially if you love live jazz","useful":0,"cool":0},"ucABVzjjIGavGOEcr62RrQ":{"text":"My wife and I had dinner here on Mardi Gras and absolutely enjoyed our experience. Reserva","useful":0,"cool":0},"sAF0ZQiILw_NKsB-r8fKAQ":{"text":"We absolutely loved this place and ended our three day trip here every night before headin","useful":0,"cool":0},"1HXn9K3l9Gx3WjpbkQLx2Q":{"text":"Went here for happy hour with a group of people and had a great time. Everyone enjoyed the","useful":0,"cool":0},"APKzLv44ZoFqBWcWMebRYQ":{"text":"This is a swanky little bar tucked away in a quiet and unassuming space. My husband and I ","useful":12,"cool":10},"lLi7D2yZ2FT-y_0rDd2v3w":{"text":"Love love love Bombay club! Incredible happy hour! Super chill and sports bar vibes. I lov","useful":0,"cool":0},"eBrsJwLgs58OpArktLsesQ":{"text":"Nice little place tucked away at the end of the drive way of The Prince Conti Hotel that h","useful":3,"cool":1},"59c2CbpAlfMmPTX_DQqwJg":{"text":"Took 30 minutes for them to take our first order, then a girl came up to us and was super ","useful":0,"cool":0},"E4ixbtFzdrQ34rv1TMB-Yg":{"text":"Really enjoyed this hidden gem! The small bites during happy hour were absolutely deliciou","useful":0,"cool":0},"8Hj6sRY6fXuJNfLeQc18xQ":{"text":"Very sad and disappointed about the disappearing live jazz music. Spent many enjoyable eve","useful":1,"cool":0},"6sDz99gKS7ZKE3v-l9G83g":{"text":"I'm glad this bar is still able to operate because it was one of the highlights of my trip","useful":0,"cool":0},"WIFKzM9oz9oQgZKfPEYUjw":{"text":"I think it's important to keep in mind that this restaurant may be more about ambiance and","useful":1,"cool":0},"UzSSnNcIec6FX7WvwBkxiA":{"text":"Outstanding cocktails made with pride and precision by Ana. Each cocktail was true to the ","useful":0,"cool":0},"JeIZtENQq3JfXFYBYqyceA":{"text":"Extensive cocktail menu that is impeccably written. Cozy atmosphere, usually live jazz mus","useful":0,"cool":1},"IB5UZJNqYbttmZn2C7Wbkg":{"text":"Tucked inside a hotel courtyard this place was a nice change of pace, but it didn't live u","useful":3,"cool":2},"FAhL9EIM_Ar-IWwkJXykXQ":{"text":"Probably our favorite hang out in the French Quarter as we went to their happy hour multip","useful":0,"cool":0},"X-GhRYXidPjBl7bdgENrsQ":{"text":"For the price of drinks and food, the portions are very small. $12 - $16 for martinis in t","useful":1,"cool":0},"mr0AGWsG_5K_iwL_snLx4w":{"text":"Tucked inside the Prince Conti Hotel is another:\nFrench Quarter Happy Hour Classic!\n\n4-7 M","useful":5,"cool":1},"AFz5IDfNmAeJ2CiS4RB1rQ":{"text":"Amazing happy hour .. the carre vieux (sp?) Was killing it.  Could be a ny bar ... classy ","useful":0,"cool":0},"-M95ZKh3GFOXNdCc9uP33A":{"text":"Came in for happy hour on our trip to NOLA and had such a great time here! Good company, g","useful":0,"cool":1},"1ZzwUFxN2c1eTLkL8_FwrQ":{"text":"Great service off the beaten path. Awesome martinis! Excellent food. Definitely not a tour","useful":0,"cool":0},"nyMPO_kmdlbVntODgkYTaw":{"text":"I had the opportunity to visit Bombay Club and Martini Bistro during the weekday afternoon","useful":3,"cool":1},"RWOmUdHAIpDvQg9Hwx2ZiA":{"text":"Wanted to get off bourbon street for dinner and stumbled upon this cozy restaurant tucked ","useful":0,"cool":0},"AmEBJ3KsYUU9s8O1nCho7g":{"text":"What a find! Sophisticated yet fun dining in a private booth was great!  The food was orig","useful":2,"cool":1},"wHQQOmKnm6NwYnPO5_sqFA":{"text":"Ambiance was perfect. Waite staff was very friendly and the food was delish! I had the lob","useful":0,"cool":0},"jQISTuEbyPQY0_PCtkT8tg":{"text":"We had the most wonderful meal, the Reveillon Dinner was a culinary and artistic masterpie","useful":1,"cool":0},"XoOKsfYHhYLZFVNLFiQhDA":{"text":"The meat pies were absolutely delicious. We were looking for a jazz spot for dinner and st","useful":0,"cool":0},"2PjH0BkIMlJgXM6PESaPZQ":{"text":"So glad to have stumbled upon this dimly lit hidden gem! What's even better is that they h","useful":2,"cool":1},"N8FszrwjRuPmF-SLuJYP8g":{"text":"Let me start by saying it was Good food, cocktails and service.\n\nHowever - Went with large","useful":2,"cool":0},"cLMGdfP2t3jUM-BCS07M_Q":{"text":"The drinks were great and we had great service--although we were basically the only ones i","useful":0,"cool":0},"J4s_nH9l-iRqJzojgKmAaQ":{"text":"Gotta tell ya, this place has ALWAYS been packed in the evenings. There weren't 5 people i","useful":1,"cool":0},"eIHKsRemJDAcqg1nyucCvw":{"text":"food is ok. Gumbo is tasty although a bit salty. The service doesn't match the vibe. it's ","useful":0,"cool":0},"bJVWRMMXRy7haI5takVTNA":{"text":"We called ahead of time to make sure there was live music.  The guy on the phone confirmed","useful":1,"cool":0},"CNq67SkIQkwGhFANNwQmgA":{"text":"Great experience in an otherwise seedy part of town. Very clean and friendly staff. Our wa","useful":0,"cool":0},"jz0LqFBKv6BHP-ul_Zv-PQ":{"text":"Easily the worst customer service experience ever. My husband and I went here on Sat 29th ","useful":2,"cool":0},"OUJtHKP8JOTzNNS2R24ojw":{"text":"We've been here 5 times and had the best service and food. Post-COVID, this is our first t","useful":0,"cool":0},"OAZit3JfV9ksp8bYFLrP-A":{"text":"This is our favorite martini bar in the city. Huge variety of traditional old school drink","useful":2,"cool":3},"WKBv0Ec69scflChNkyORDg":{"text":"Solomon is great!  Locals are genuine & warm. \nWonderful place for date night, very classy","useful":0,"cool":0},"mQdLG02EXsKxFLt0BR_VKQ":{"text":"Fantastic little gem. Has a great retro vibe and extensive cocktail selection (I was actua","useful":1,"cool":0},"Y4kRcpCSVmkc5sfqIC6IZg":{"text":"I have been here 2 times now.  The second visit with friends was equally good.  One of the","useful":2,"cool":0},"-MFKrBkTrXd342NiGZ6vkg":{"text":"Such a classy and intimate place. The atmosphere is very dim and cozy and reminds me of an","useful":1,"cool":0},"yye9aW1TfZ1i2AouYJ26vw":{"text":"The Bombay Club is a hidden gem with a great happy hour, really delicious food and a dark ","useful":0,"cool":0},"OErp4J92FdILBJM9-rjrpw":{"text":"We were promised a wide menu plus nightly jazz music. We got neither. We came here for din","useful":0,"cool":0},"yxSZZVGheBGtgyZmeC55TA":{"text":"This place is classy as hell. It's like the perfect man cave. It's dark and leather couche","useful":0,"cool":0},"lrSz6Llo-LJDd0FuPxyePQ":{"text":"Great bar that we've been coming to for happy hour for\n years whenever we visit New Orlean","useful":1,"cool":0},"kR-UcRk1noxMX2JebzerkA":{"text":"And update to my previous review: the FOH manager Charles called me personally to discuss ","useful":0,"cool":0},"fQ7jcm3TgqzfbJgtCH9MHg":{"text":"It's not a NOLA bar anymore. Everything has changed and they don't serve dinner anymore. U","useful":0,"cool":0},"ffd-nzX8r91wHlX6pqTATQ":{"text":"This gem of a bar/restaurant is another example of what sets NOLA apart from every other A","useful":2,"cool":2},"9hczUCEIba3fIHaWsvVAGw":{"text":"I went here on Christmas Eve for the buffet. I had to make the reservation last minute and","useful":0,"cool":0},"Zdf3E75Jk19gOvrG6H2rLw":{"text":"This was my first time to the Bombay Club and what an experience! Austin is super knowledg","useful":1,"cool":1},"WtqMtwRLE7oU1KV7Gu_WZg":{"text":"I had a great time here and it was definitely one of my favorite places I visited during m","useful":4,"cool":3},"LNUDroeVRnKg67kGF-u-hw":{"text":"On vacation in NO with my wife and friends and stumbled in on this place. Wasn't sure what","useful":2,"cool":1},"CVGJ9eF9JNeV6-pZ40QuwA":{"text":"Looking for a suave cocktail bar to relax at near bourbon street? This is the place for yo","useful":2,"cool":3},"Fcbs2rIKYmzuDD9wxx28xQ":{"text":"While the atmosphere was very nice. I was extremely disappointed in their limited menu.  I","useful":0,"cool":0},"IMKvHWhxF0xih0gwJ4OP5A":{"text":"It's been about 7 years since I've been here last time. Definitely changed. Was ..ok. Drin","useful":0,"cool":0},"ZNN8DC9vgNJj4amW5Yp6jw":{"text":"Several restaurants in NOLA are closed Mondays and Tuesdays and a few more were closed thi","useful":0,"cool":0},"JiKoSxqjqbiMhjQIpUjWnQ":{"text":"There is no food service before 4 pm or after 10 pm.  The drinks were great but bar was de","useful":0,"cool":0},"J_-6f1CAsO0t48VqZJ4xWg":{"text":"Love.  Love.  Love.  The food is great.  The drink menu is a booklet.  The staff is excell","useful":0,"cool":0},"E_-TSSTsYUA7A54pqYmXXA":{"text":"Great bar service (Amber) in a relaxed atmosphere at happy hour- away from the craziness o","useful":0,"cool":0},"w9qu3aazagIYB8BV4VhIuw":{"text":"This review is for Bar drinks not restaurant.  So we are staying at the attached hotel.  I","useful":0,"cool":2},"8Z0VWJiOnTV8DaKlnq87uA":{"text":"We checked out The Bombay Club for dinner. I enjoyed the COOLinary menu and my date had th","useful":1,"cool":1},"sPVyAIa-VzJO9v1-Y9R3Zw":{"text":"Ok we haven't been here since pre-COVID, and were not surprised to find it's still just as","useful":1,"cool":1},"ToEBc0MSMULPbCMrqleCGA":{"text":"Dark bar and seemed kind of pretentious.  Had a beer and ordered the giant pretzel.  Wasn'","useful":0,"cool":0},"fRT6XGSxuFXucZiVInpf5w":{"text":"By far the best meal, ambiance, and music we heard while in NOLA. When we originally envis","useful":0,"cool":0},"8h76JdaDbkhfsAcQuDDl1g":{"text":"i always enjoy this out of the way bar . the atmosphere is just as it should be in new orl","useful":0,"cool":0},"oBoFymYMWl8juVfkSZF3Bg":{"text":"After a disappointing failed happy hour at Broussards, we found Bombay Club and decided to","useful":6,"cool":3},"uA9tRu-0p2gzfTn8Zb_pQw":{"text":"We go to the Bombay club every time we hit NOLA. But it won't be our top choice next time.","useful":7,"cool":0},"HrZf6Bd4nH5a_3-wfA_o8A":{"text":"Perfect happy hour spot. I find it also nice for a cute date night. (When you know the per","useful":5,"cool":3},"cuM9e9lb65U1l-Kgcyxw2g":{"text":"I wish I could divide the review into a five star for the bar and a two star for the resta","useful":1,"cool":0},"_nZfVeiOr5jXZQbB-bwp1Q":{"text":"My review is for the dinner at Bombay Club.  It was awesome.  I loved the ambiance, the se","useful":1,"cool":2},"BzbNky55SNXIkFpMgfe1pg":{"text":"Looking for a suave cocktail bar to relax at near bourbon street? This is the place for yo","useful":1,"cool":1},"ABrx04cl1tLS7gy4iXd1rg":{"text":"We had a fabulous night at the Bombay Club, complete with high quality cocktails, tasty cr","useful":9,"cool":10},"3CDVQkNevvbdNfvRnI_yeA":{"text":"Great evening of drinks and music. The decor is perfect. Love the Churchill painting and b","useful":0,"cool":0},"IAGRJevDNJaqFYIgzq3WHQ":{"text":"Upscale, yet casual, little trendy place to have a cocktail and appetizers with friends.  ","useful":0,"cool":1},"4ZtQkFD_te_sA4GhYfCxMg":{"text":"Made reservations in advance and took my wife and daughter for a nice night out. Our waite","useful":0,"cool":0},"_-AzfFroWhpbZ4v2KYVatw":{"text":"We went in for Happy hour. Btw they have it until 7. The bartender was so friendly. Staff ","useful":0,"cool":0},"Xc0ycvxlWZqH5e1zLh7Odg":{"text":"Came in to celebrate Valentine's Day with my fiancé. I highly recommend reserving one of t","useful":2,"cool":0},"EnPcNA26hE_CgBzWyoHKMA":{"text":"Previously a fan of Bombay Club, I have to retract my praise after suffering through the w","useful":2,"cool":0},"lOj7TduBrW53sS99AdhPKg":{"text":"Great location, allows you to take a sip without the bourbon street noise but still being ","useful":1,"cool":1},"Ld4EeNXt48JOZzDGtW7P8w":{"text":"Like stepping into another world! The old school booths with the curtains, dark wood-panel","useful":1,"cool":1},"DtFDu-eibCgZc7RiNVlpGQ":{"text":"We went during a weeknight. It was okay. The service was very slow but good, drinks were a","useful":0,"cool":0},"5i2TwZ3vavCXhbfwwtLyIw":{"text":"Heard about this place from a friend who said they made amazing cocktails. A group of four","useful":0,"cool":0},"JfR7vyzorE8aTwAVHn7KBw":{"text":"Hidden gem for craft cocktails at the Prince Conti Hotel. We were so impressed with the co","useful":0,"cool":0}}