{"EpTgdg8_DpKzyNfd1zd-Kg":{"text":"I was fortunate to be invited for the grand opening at this restaurant which is a one of a","useful":1,"cool":1},"61Ng5WgXbVykmZXLHMmhOw":{"text":"Great experience !!! Food was excellent !!! Chef Kaz and Eli was awesome if ever you're in","useful":0,"cool":0},"1W1Bvlg1Vp_WT1uyTqGGjg":{"text":"This place is a hidden gem. From start to end , the experience was phenomenal. Great recep","useful":0,"cool":0},"MT9TQ_O4LOlqXvMFI14suw":{"text":"Best Japanese food I've ever had, wasn't particularly close. Found myself saying, \"this is","useful":2,"cool":1},"VMqJb2FDwvIjXBhSXRxjow":{"text":"Wow!  We had a wonderful experience at Nagomi.  The Omakase were $75 a person which is ver","useful":1,"cool":1},"WUH6Tzl63xlgy2PAHs_nXw":{"text":"I have loved Chef Kaz for a long time. And I've been missing him since he left Shogun many","useful":6,"cool":4},"-m3ld6AJX1YebwcOLEvNUA":{"text":"I snagged a reservation here for February in their first month of opening and so glad I di","useful":5,"cool":3},"47xd6C2dI5tXDK--zMEmxg":{"text":"Exceptional. There are few words to describe the sheer joy experienced during this meal. I","useful":0,"cool":0},"8m8E0ExKaImZCpgAzGb9bA":{"text":"Thank you for dedicating yourselves to this craft! Whenever my out of town guests come in,","useful":0,"cool":0},"LqqVKXMFqlteFIUTGJRMjw":{"text":"This is hands down one of the best meals I've had in my life. The flavors were just crazy ","useful":1,"cool":1},"yew-RZYsO0T7hGmQAADF3g":{"text":"I feel like I'm in Los Angeles. I wish I could compare it to Japan but I haven't been fort","useful":2,"cool":1},"V9Kfu-IcGZA2RX4ErYy6Ew":{"text":"This is easily the best meal I've had in New Orleans in a while, definitely on par with Sa","useful":3,"cool":2},"QrCvSmVWYPh7fTI4iLo7-g":{"text":"Nagomi is hands down one of the best (if not the best) dining experiences you will ever fi","useful":1,"cool":2},"folDQNAPu7mYJtjoeLSh2Q":{"text":"People often speak of how great the food seen in New Orleans is but they often refer to th","useful":10,"cool":9},"vuy9xf3YTO2jBduWQm0XAQ":{"text":"Love the experience. A two man operation. They work so well together! Even made accommodat","useful":0,"cool":0},"UMT-OmRPLpB5V73PYmFS9g":{"text":"Last night dinner was outstanding - I enjoyed everything- every plate.  Eli and Chef Kaz m","useful":0,"cool":0},"rfkJQ12eIL9LOtZ2J94ISA":{"text":"Had my first omakase experience @nagomi, and I was literally on cloud nine \n*\n*\n*\n*\nOne of","useful":1,"cool":2},"ORN8o4qlt5l1U8E6iuxXpQ":{"text":"I would say Nagomi was probably the only OG  True Japanese sushi place I have visited in t","useful":4,"cool":2},"D1HGS4aFL6AHyAepVQeNSA":{"text":"I had a wonderful Omakase experience here! Chef Kaz and Eli are a great combo together, th","useful":1,"cool":0},"wxRMu6CYNF9m95BQMnylmw":{"text":"I've been lucky enough to visit Nagomi twice since they opened and all the accolades you r","useful":3,"cool":1},"ecDhHDvKad3OXFbotr0xaw":{"text":"I expected a lot based on what I had heard. \nWas shocked at how much better it was than I ","useful":0,"cool":0},"l7ATHOuXhfISj04ITCmS6Q":{"text":"Tucked in the Bywater, this restaurant takes you out of the city and brings you a little s","useful":4,"cool":3},"iBvI6HDA6zSJeoLm1VY2Cg":{"text":"Located in the Bywater. Dinner only.\n\nReservation is required, I believe, as they are book","useful":2,"cool":2},"cEIQ_3km78nL7zMK9qXInA":{"text":"Nagomi was freaking amazing. Wow. It's really hard to get a reservation here, but I believ","useful":4,"cool":4}}