{"fpw5-RLBb_ymSjFaD5SGog":{"text":"Amazing gulf shrimp poboy also by with some tasty Louisiana brews! Came in during the Sain","useful":0,"cool":0},"mFE52AnjfzeSUk7lrNZ5Cw":{"text":"A great little bar with phenomenal po' boys and some good beer on tap. Thankfully a bit lo","useful":0,"cool":0},"2uvOdDmqf8cULIedfI-wXg":{"text":"Love this little whole in the wall!  A little gem steps away from the chaos of Bourbon Str","useful":1,"cool":0},"-2IVbF9MvCIYmsRfpCYtQA":{"text":"This place..we sat at the bar while waiting for our order from Killer Poboy in the back,  ","useful":0,"cool":0},"ys9AUXYjCa_4M_qOYnBonQ":{"text":"I stopped by for a shrimp poboy today. Unfortunately I was disappointed with what I got. U","useful":0,"cool":0},"TTNG97c8qF7h2kGNHPox6w":{"text":"Cozy spot off bourbon. Frozen Irish coffee in the souvenir cup is top-notch, especially wh","useful":0,"cool":0},"gsG-JqgfvgUX_Vz7W6N6cg":{"text":"My favorite in The Quarter, and I know bars.\nJust the right kind of dive, adorable bartend","useful":1,"cool":0},"kvdLoARSFOuxwjug-A2VFQ":{"text":"Greta bartenders who serve up stiff drinks without pretension. Prices are a little high fo","useful":2,"cool":1},"Z6vard7wt3xbWo-eOiOQ5Q":{"text":"Great bartenders, great drinks!  Get yourself a frozen Irish coffee and shake the die for ","useful":0,"cool":0},"jIACtUpoYsYfbiKLbJyAUQ":{"text":"I love this place, and in some respects, I'm sad that other tourists have found it! This i","useful":0,"cool":0},"YhWN648STFL-NjKUBO0gUQ":{"text":"Great frozen Irish coffee! Bloody Mary's aren't too bad, either. Make sure to walk to the ","useful":0,"cool":0},"DZjoutT-z4JWQ3Mw8tJT_w":{"text":"A must visit in the morning hours for their frozen Irish coffees and tasty bloody Mary's. ","useful":0,"cool":0},"tpNY7Tv3g-1C4j3o2T94dw":{"text":"Must be a whiskey lover. Down to earth bar away from the typical Bourbon St. peeps. This i","useful":0,"cool":0},"x-pBkn3hSBJRo2pSFaMZYA":{"text":"Frozen Irish coffee+ pork belly poboy = phenomenal way to start a night. 5 stars!","useful":0,"cool":0},"UR0pPMVK3Lq-67VM_2H9DA":{"text":"One of my favorite stops. Not the typical tourist bar. Staff has always been good and the ","useful":1,"cool":0},"TIYLukHlCii9n5no9r5wWQ":{"text":"If you dig dive bars this is your place. The bartender was nice and my drink was good. The","useful":1,"cool":0},"8HaiS8xaHxP64fA6n6WdOw":{"text":"Little hole in the wall bar but sooo so unique!! Go in and start yourself off with a FROZE","useful":0,"cool":1},"AF8G7fAxc-8bQ2deIbiO-A":{"text":"Another bar less than 2 blocks from my house that I went to the first time. The drinks che","useful":2,"cool":1},"zdZs8psaDVuZcM36uj9xIg":{"text":"There aren't too many places in the Quarter where you will find almost exclusively locals ","useful":0,"cool":0},"VxzYrQk19vLON2p2-2RZXQ":{"text":"Bartender was nice, frozen coffees are delicious, good beer selection, no gimmicky sugar d","useful":0,"cool":1},"-Jo_VYc1KZtQAqu-z5maCA":{"text":"My friend and I visited Erin Rose based off a recommendation and man did we love it. We in","useful":0,"cool":0},"STT8cBK1fa9diDnKL5fz_Q":{"text":"Drinks were amazing (especially signature frozen Irish coffee) and their secret Po Boys at","useful":0,"cool":0},"9qxY8HdkuLzZ4Bp4XIgDBw":{"text":"We really enjoyed our time here. The bartender was super chill, the jukebox was solid and ","useful":0,"cool":0},"Fo5mc_H5I7XjDhhpJlGYJw":{"text":"The frozen irish coffees (and the hot as well) are the best thing I drank in New Orleans.","useful":0,"cool":0},"mziXaG1QBrcdro2nvhfNzw":{"text":"good dive bar, but can definitely fill up fast. the frozen irish coffee is a must when the","useful":1,"cool":0},"mYguExnI4b1vbCFIz1Y0Pg":{"text":"Like any good tourists my wife and I researched \"The Best of\" before heading down to New O","useful":0,"cool":1},"80pDOdXW9eQnMz8y14CeZg":{"text":"Stopped with friends here after hearing about the classic iced Irish coffees offered at Er","useful":0,"cool":0},"CYOFiYZPXegsJIpuErbg-g":{"text":"We were in town for 2.5 days... and we came here three times! The frozen Irish coffee is a","useful":0,"cool":0},"IcefCKiAxvdeFdsFE-21jQ":{"text":"Great all around bar! Randy the bartender was amazing. He gave us so many tips for our New","useful":0,"cool":0},"DcoONoe_MisBT_g09PUEiA":{"text":"This is my go-to spot in New Orleans.  Great po-boys in the back and great (and cheap) Mim","useful":0,"cool":0},"dWKYCIfA78F9ikmleq39wg":{"text":"Dangerous place. Avoid if alone. I was attacked, unprovoked by people at this bar while wa","useful":1,"cool":0},"YZGSzeaiYDQ7JCEwIoLNLg":{"text":"We happened upon this bar and were glad we did!  Friendly people, good drinks and no drama","useful":0,"cool":0},"ozhBJDzG4zjL_lH_Ex4hoA":{"text":"Frozen Irish coffees and po'boys are great here.  First time trying both and they were fan","useful":0,"cool":0},"4PWJEAijwl7Z6n7orieLug":{"text":"Love this as a daytime drinking spot. They have cheap as hell drinks before 2 and their bl","useful":1,"cool":1},"y-OCSuSoLlTCYX80UcHo9w":{"text":"This was one of my favorite stops on my friend's Bachelor Party in Nola. We came here spli","useful":0,"cool":0},"7tNFTGxE8bcijtLI3sW71Q":{"text":"Frozen Irish Coffee. \nSticky Toilets. \nGreat staff.\nJameson.\n5 Star music playlist.\n\nDo yo","useful":5,"cool":3},"X4k3rbI2yqPIZayDt7Qdzw":{"text":"We weren't interested in many of the spots around Bourbon and Canal but Erin Rose was a fu","useful":0,"cool":0},"f366r1USeZT2597xYwd8Zw":{"text":"4 on the shrimp poboys. Basically a bar with a small kitchen in the back. Don't count on a","useful":0,"cool":0},"S-ra8hg_0aKu1XqQbA-N6w":{"text":"The Erin Rose has quickly become on of my favorite bars in NOLA. In fact, I spend most of ","useful":0,"cool":0},"t0HwnG9lUvv5V47Cf5nXqA":{"text":"Nice cozy place, great music, not too crowded, fab food, and of course great collection of","useful":0,"cool":0},"lCeDEr72YqSfXOSpdVHk8A":{"text":"Erin Rose was loads of fun. So many of the bars in New Orleans are so tourist-trappy, with","useful":0,"cool":0},"_6TpDXE89aq86W-VDAdRKw":{"text":"Great atmosphere in this Irish bar off Bourbon. The frozen Irish coffee is a must for your","useful":0,"cool":0},"Ao9OC9HmbOTzO0QOtRanCA":{"text":"Pub sympa, pas très grand mais assez stylé en termes de déco (déco de bar typique quoi!)\nT","useful":1,"cool":0},"FDRViq-bb-QoIYvgWXMBxQ":{"text":"What a find it was while I was in NOLA. The po-boy shop in the back is an absolute must-tr","useful":0,"cool":0},"10tfnd27fKfivH24bj5RyQ":{"text":"After reading the reviews and finished a fantastic dinner at GW Fins, I was ready for some","useful":0,"cool":0},"akHuAs3o2T4a72XLavv_RA":{"text":"Definitely check this place out.  It's somewhat of a New Orleans staple and although it's ","useful":0,"cool":0},"s-ZhsVWxD8uYOxDwGDjf9g":{"text":"Best Frozen Irish Coffees anywheres; I tey you what!","useful":0,"cool":0},"NoPgpZsyYMvoBT6xhAuOBQ":{"text":"FROZEN IRISH COFFEE! Great happy hour specials till 2pm. The bartender was rude and harrie","useful":0,"cool":0},"RXZwQsScvvmYZ683ehVoag":{"text":"This is my favorite bar in the French Quarter. Okay, so I'm not exactly a frequenter of ma","useful":0,"cool":0},"KzGU60CAaSbPZTtFWKzWyw":{"text":"Seeking to escape Bourbon Street for a real dive? \n\nSmokey--Check. Cheap booze--Check. San","useful":0,"cool":0},"s6l2l-1zrDA4WIq7-DMVgg":{"text":"A bit of an oasis near Bourbon Street, serving excellent Po Boys and well-poured Guinness.","useful":0,"cool":0},"xWMVXi0UglQOn1OOeJCikA":{"text":"One of my go to bars in the Quarter. Just off of Bourbon and close enough to the street ca","useful":1,"cool":1},"uB_DRYeMWHT_hIiPV_Qv6Q":{"text":"Well,  I cannot say enough great things about this place.  The juke box, the drinks, Kille","useful":0,"cool":0},"HmbOmVRtyqvv9o4wbnQYVw":{"text":"Monaghan's is one of the better little bars right off Bourbon.  There's a great Vietnamese","useful":1,"cool":0},"E34Bzry1UXiPm2A87PS7aQ":{"text":"We love this bar! Always make a point to stop when we are in NOLA. Right off of Bourbon so","useful":0,"cool":0},"0VDXh62Ge40yeNIeDp8vgw":{"text":"Had A  blast at Erin Rose!  Angie and Tami were awesome.  We adored everyone we met there.","useful":0,"cool":0},"iQYV40ykIjOxQavsyiImXQ":{"text":"LOVE the Irish coffee! Great poboy menu!","useful":0,"cool":0},"8s6ZBMEVzIGM4K6WvUeB0A":{"text":"On a 32 stop, 3 day Bar Crawl, we wound up her 3 times!  \n\nOn our 2nd day we decided we di","useful":1,"cool":1},"NC1edxXiqL7q0o7H4D76BQ":{"text":"Yummmm frozen Irish coffee! Great little drive bar, friendly service and a great way to co","useful":0,"cool":0},"aC2SEDjRzdTHJd2nmxJUBw":{"text":"With such high marks on Yelp, Monaghan's Erin Rose was our first stop in NOLA. We found a ","useful":0,"cool":0},"MOcThB4DfGPVVoQ2ITKr5w":{"text":"Monaghan's is another great Irish pub in New Orleans.  Full of local color, it occupies a ","useful":2,"cool":2},"-hyLdk4CWQHHExPH_149nQ":{"text":"This place is killer. Amazing prices for what you want. They make drinks to go. In the bac","useful":0,"cool":0},"pIP6LrZOuF7-NYQKXq7vtg":{"text":"This is one of my favorite bars in the French Quarter, particularly because it does not fe","useful":1,"cool":1},"9LHxHEq_DgydlMJ7W7TR0A":{"text":"Great atmosphere and the bartender is awesome.  We had the food  from killer grinders and ","useful":1,"cool":0},"BlpM9Ip6cJh8mTqTU1cxdQ":{"text":"A piece of a sanity in the main drag of the quarter. Great for day time drinking. Juke box","useful":0,"cool":0},"YKbvFnJjipDJ6LOCHd_XAA":{"text":"Just get the frozen Irish coffee. You WILL NOT regret it. Almost like a coffee milkshake t","useful":1,"cool":2},"5ZnrReflfCEG1v4n9VgBDg":{"text":"Well, well, well,... first day in New Orleans and end up on Bourbon Street within hours of","useful":0,"cool":0},"iovv3HhpdqrP4GhMPLwa8w":{"text":"It's  not pretty and it's not fancy, but it's fun and the frozen Irish coffee is delicious","useful":1,"cool":0},"PSFWdmcrw5E0N2wJcLWRbw":{"text":"This is a review of the Irish coffee. All my attention, despite the fun decor and the frie","useful":0,"cool":0},"-25Hm3aL5icq4uYuvl7Uwg":{"text":"Been in The French Quarter for six days. The Erin Rose stands out as the best daytime bar ","useful":0,"cool":0},"RPkwAnSbAA5hH2Z1sOh7Ng":{"text":"Erin rose...oh how I love thee.....April and the locals made us feel truly at home. The ow","useful":0,"cool":0},"LXkGgDXzxlNYBRkIVIfjUg":{"text":"And home to the best critically acclaimed poorboys in New Orleans ... Killer Poorboy  from","useful":0,"cool":0},"2bbEBjmimN4AyqsYEe3BQA":{"text":"I actually found this bar online prior to our trip and thought I'd check it it out one mor","useful":2,"cool":2},"XmAi6rfykz_j-Ki-QPuB8Q":{"text":"Will always be a fond memory of New Orleans. Don't like Bourbon street too much as smells ","useful":0,"cool":0},"3Nmbl8V28YEHwb_fc2kSeg":{"text":"Stumbled across this bar while looking for Killer Poboys (located in back). Erin Rose is a","useful":2,"cool":0},"GvAbf_QDeGwbNM0p0s-dWg":{"text":"We will never come to New Orleans again without stopping at Erin Rose for a frozen coffee!","useful":0,"cool":0},"bvxrjtaol9BAwDalxhjChg":{"text":"Dilly Dilly! This place is great! Small and tight with great music and atmosphere! Love it","useful":0,"cool":1},"hbZDPcc_zQYSOxrjn6L85w":{"text":"Great spot in the French Quarter. Locals had recommended it to us for their authentic po'b","useful":0,"cool":0},"JGbUE45tEw3zGVxZR5Hnqg":{"text":"Favorite dive bar! Every time I meet someone interesting. Who doesn't love their frozen Ir","useful":0,"cool":0},"g2ymxufzvleJnTj3WGMmnw":{"text":"First stop in Nawlins....The Erin Rose. Well technically the hotel but I came here to drin","useful":0,"cool":0},"0PgFpWvl2sdo1RNTlZrsiw":{"text":"Most delicious po'boy I've had yet! I had shrimp and honey had beef. Very tasty! And while","useful":0,"cool":0},"6wrCeWbX68JBQaYc_pTxtQ":{"text":"Love this place. We visit New Orleans every year and this is always on our list of visits.","useful":0,"cool":0},"LIXXkaruElu94C8rvHVqtQ":{"text":"Not impressed. Pre-made freezer drinks. Quirky personality and that was good. But if you'r","useful":1,"cool":0},"ZoPdz8dhtY4iR7x9QvEAVg":{"text":"So did Chicago transport one of their amazing dive bars to New Orleans? Cause that's what ","useful":1,"cool":2},"yp1PhsbLI63epDpU0ZRSGQ":{"text":"Simply put ... come in for the frozen Irish coffee. Most delicious drink I've ever had.","useful":0,"cool":0},"b1Gyc4LSzpmor6u051f3Iw":{"text":"The classiest of dirtbag bars. This is a place of epic history, and not to be missed when ","useful":7,"cool":6},"RezYlhAzQKaDnjex262d6g":{"text":"Stop in and get the Irish Coffee drink, it is perfect for a hot Louisiana Day, and absolut","useful":0,"cool":0},"zIFXjIiNCy_DIB_YUniULg":{"text":"SF friends have used this as the meeting point for years, it has a Mission dive bar feel t","useful":0,"cool":0},"n86ZA6r0Gu7ey4kBg831tw":{"text":"No, I'm not a local, but I was kindly tolerated anyway. A breath away from the squalor of ","useful":0,"cool":0},"_2Vj1HcnHdvTWZw1i2UdTw":{"text":"Guinness in a Bloody Mary....yes, please. It was a very unique addition, but I have to say","useful":1,"cool":0},"eAJTRyTmDQoqHeQMMjaSeA":{"text":"This place is a must in the French Quarter of New Orleans. I stopped by due to a recommend","useful":0,"cool":0},"qG9t1Q-GG_OqfU8uqKeqkw":{"text":"Any place with happy hour 10am - 2pm daily gets 5 stats in my book. Didn't try the food ye","useful":0,"cool":0},"xaKY9diBcU-nF87t85-d_g":{"text":"Erin Rose is great place to sit at a bar and just be. It's not touristy or pretentious it'","useful":0,"cool":0},"dRLW-V03CZi6CjNZoi8DWg":{"text":"Cool dive bar known for the poboy's ordered in back. Good music and great service from the","useful":0,"cool":0},"Jvtj4C_eWYVPGxrK96Ru7A":{"text":"Pure dive bar hole-in-the wall hipster goodness! We came here twice during our stay. The f","useful":0,"cool":0},"C-a3_yJ8qKLFJnecEHwMjA":{"text":"The Frozen Irish Coffee is AMAZING, service is TOP NOTCH & the atmosphere is so relaxing! ","useful":0,"cool":0},"1yRWeTLv1UpMw6Bshl8UAQ":{"text":"A great bar to hit up to grab some drinks and a Killer Po Boy.  Cant go wrong here.","useful":0,"cool":0},"arxTaHvZIblp_w0kRTaEng":{"text":"I had heard about this place from some friends that stumbled on the place during one of th","useful":0,"cool":0},"blACpspLsKJxcGP_O-JvqQ":{"text":"Erin Rose is a great local bar.  It is very small but a fun place to hang out in.   They a","useful":1,"cool":1},"6vKKGQUhtuaJiDq0QAbLFA":{"text":"Great NOLA spot to grab a drink, try the frozen Irish coffee!  We were there before 11 AM ","useful":0,"cool":0},"vDbzkXkXnzHqXZKqlktKIg":{"text":"Not a NOLA local but as a tourist who researched her Poboys well, this was the best place ","useful":0,"cool":0},"c5axcJlpeCaS3QW5B8PRfg":{"text":"Small place but AMAZING po boys! Walk in and go all the way to the back for the best po bo","useful":0,"cool":0},"-tpYE7EmbqI98xYPUSaQLw":{"text":"This is a fun pub type bar, a bit off Bourbon street. The crowd is pretty laid back and yo","useful":2,"cool":2},"69nEUcARmvU22bj-uHH34A":{"text":"Straight up dive bar!\nCash only.\nNoLa locals.\nTiny wall space, but check out the back - so","useful":0,"cool":1},"phjN_L6idW3MDVUu84ggog":{"text":"Out of all the bars in NOLA this tiny one was featured on Esquires Best Bars in America.  ","useful":0,"cool":0},"mQx7p70nCanSI-I94KMC-g":{"text":"Service is quick, prices reasonable. It is just a bar, nothing fancy or pretentious. Just ","useful":0,"cool":0},"cTqXCkfIsaDTAtYxWyTa3w":{"text":"First timers looking for good clean warm fun after walking for 2 days on bourbon street. B","useful":0,"cool":0},"IfWnviSBgB-7eAEaZSB25Q":{"text":"Off the beaten path, amazing poboys, friendly service, and whoa--the iced irish coffee is ","useful":1,"cool":2},"rD6VXPZBtPIT7JbEbO-8wg":{"text":"Good atmosphere, and the frozen coffee drink was great. The only reason I don't give 5 sta","useful":0,"cool":0},"hdHxU6wTHYigoYQaSSmbtA":{"text":"Small pub right off Bourbon St. They have to go cups with spiked coffee that are really go","useful":0,"cool":0},"UKJfO19lBJemzQrMJlq_pw":{"text":"As in my other review another night after work i took my dad out this time and we went to ","useful":0,"cool":0},"N9RvOcYszVAeyP988c_mUw":{"text":"Great, quiet dive with amazing Po boys in the back. Stop in here if Killer Po Boys isn't o","useful":0,"cool":0},"XV1f74OXVnkXdg6vmt0kTw":{"text":"I love this bar! It's a great place to sit for a while and get off Bourbon Street. The fro","useful":0,"cool":0},"h3GWBVN07DFJHjj-_4WGaw":{"text":"Okay, I finally tried the Bloody Mary.  All the bartenders put Guinness in them, and they'","useful":2,"cool":1},"FBjTDYpARmjvfpxewtxCNw":{"text":"Maybe it was because the place was packed each time we went, or that my feet stuck to the ","useful":0,"cool":1},"BfIqSKnB9GxV4TGRLNQ-4w":{"text":"The Irish coffees here. I would come back every day if I could. It's a happy hour from 10-","useful":0,"cool":0},"UO3Os_1ON0yTDHUsD0vhHg":{"text":"Divey and fun! Everyone at the bar was singing along to Bohemian Rhapsody.  \n\nIt is a litt","useful":0,"cool":0},"agDLSY1ZVSyQWR1diQcxsA":{"text":"Great little Irish pub that I found due to killer poboy stand in the back. Went back with ","useful":0,"cool":0},"37x_4ljdVefVFxqWbqssDg":{"text":"It's smokey as hell. A small place, not really clean. A dive bar by definition but it does","useful":4,"cool":5},"D_e0aO6No2J2PsojaDnYAA":{"text":"Love to come to this place every time I'm on Bourbon St. for their Frozen Irish Coffee Dri","useful":0,"cool":0},"WYzApUq6qV72qjICocqLxg":{"text":"Irish coffee. If you haven't had the Irish coffee (hot or frozen), have it. Really awesome","useful":0,"cool":0},"mV-1jFKYCEMzU7beDDK1lw":{"text":"Chill dive with a small kitchen in the back. \nHad some beers and a Pork Belly Po Boy. Pret","useful":2,"cool":0},"k1e2uRfPNCayHrxnag9D2g":{"text":"I really love the Bar at Erin Rose but the Po'Boys are off the hook!  I had the shrimp Po'","useful":0,"cool":0},"PVXJSojVvu8PP0FE4dFA8g":{"text":"Already can't wait to come back here. The frozen Irish coffee...just do it, don't think tw","useful":0,"cool":0},"Ay7E5KE3EVx1LWiFzV2LcQ":{"text":"This is my man friend's neighborhood bar so sometimes I can be found partaking in an Irish","useful":1,"cool":1},"UH7t7Coe367M5SQl4ebV0g":{"text":"super cool bar. two bar areas. the first one by the door i couldnt get any service so i we","useful":0,"cool":0},"TgujDKi09YWBFjxxvr-iyw":{"text":"Great dive bar with the BEST prices! We kept coming back throughout our trip. It doesn't h","useful":0,"cool":0},"qYCiEQor6PulQshPjMUwDw":{"text":"Love this bar just of burbon street. Lots of locals and visitors mixed. Ambiance felt like","useful":0,"cool":0},"FpS66SD08jEelByHBe3QVg":{"text":"Came on a hot summer afternoon. Frozen Irish Coffee is perfection in a Go-Cup!\nKeep your t","useful":0,"cool":0},"F2UjvE2AZ7PzRnlaW7k6Dw":{"text":"Great spot for a po' boy in a town where every spot is great for a po' boy. This is the sp","useful":1,"cool":1},"7TssfJr-YlVc8uoeDpr-Gw":{"text":"Seriously the best frozen coffee drink I've ever tasted. Bartenders were also quick and ef","useful":0,"cool":0},"dQHUAHDbCmxjjurjJPJB1w":{"text":"Refreshing change of pace from most of the bars on the main drag of Bourbon street. It's a","useful":1,"cool":0},"a2hKyEmoLoEROx7PExC48A":{"text":"My favorite bar in the city, hands down. Bartenders are quick and competent - start showin","useful":0,"cool":0},"iRCPuDMAXNiKvTYVT1kwXQ":{"text":"I made a quick trip to the French Quarter for an Irish Coffee.  It is a must try. It's lik","useful":0,"cool":0},"bQvE0FzHEKSfu4Z_4Jkbow":{"text":"Awesome dive bar in Nola. Fun little games to play with the bartender for free drinks was ","useful":0,"cool":0},"z6PPONIWNQovBS2GWpFyyw":{"text":"They aren't sweating life at Monaghan's Erin Rose, and if you're not quite sure if that's ","useful":0,"cool":1},"4WI2wtvEIk2M7at-Mm7a9g":{"text":"Omg I found an Irish pub in NOLA! If you love the real pub atmosphere you'll love the Erin","useful":0,"cool":0},"umt4pADbG27bta48y7ZgBw":{"text":"Love this little bar and love the Frozen Irish Coffee!!! Stopped her twice during my weeke","useful":0,"cool":0},"kiptJ1L8Kt8Wz6Mguhz2mw":{"text":"Pussy... That is the one word that I, and the kick ass bartender here named Molly, would u","useful":2,"cool":2},"MtrVE0SAkLZFlqx8aHpPUw":{"text":"We split a pork belly po boy it was huge and so amazing! We also shared the famous Irish c","useful":0,"cool":0},"1sLptWfsnGmh92nyseqB5g":{"text":"I want to give this bar 4 stars when there are little to no tourists invading this awesome","useful":0,"cool":0},"jQ38jpM5lUO2Jxu_cOa3qg":{"text":"Total dive bar but totally worth it. They have a handful of local beers on tap and the ser","useful":0,"cool":0},"zvKImsfenk2bqZzxpTR0iA":{"text":"As everyone is saying on here, this seems to be the place where locals go. It is your typi","useful":0,"cool":0},"imWZqymAMAz5HkoEkFRR8Q":{"text":"The atmosphere, music and most importantly the beer were all excellent. Great service as w","useful":0,"cool":0},"wr9ygip-H-vyQKOgPTDi_A":{"text":"This bar is intimate, dark, clean and full of good, stiff drinks. The bartender was friend","useful":1,"cool":0},"zIGU-oyPR96ZnFAgIfyokg":{"text":"Do you like slushies? Milkshakes? Irish coffee?\nHave you ever had all of those rolled into","useful":2,"cool":2},"3jfkW_uA1Olv0BveJYlayg":{"text":"Wow, cheap Guiness and a cool little irish pub. Sign me up. The Guiness was very fresh and","useful":0,"cool":0},"6rJ5dCI-fxPTjVluLbZSuQ":{"text":"This place is recommended by a spice store clerk for Killer Po-boy in French Quarter. Loui","useful":2,"cool":1},"D-LM6shLOUCdfpoLrGiphA":{"text":"Poboys, beers, small bar with lots of history. The best Poboys: glazed pork belly, grass-f","useful":0,"cool":0},"ZySNvxXg4hygd5E7cijphQ":{"text":"The Irish frozen iced coffee is dangerously good.  So refreshing on a nice day.  Very swee","useful":1,"cool":0},"0bOJ-YU-iWam1Wqw3USHjA":{"text":"Awesome divey joint. Great attention from the bartender, great beers. Pop in an afternoon,","useful":0,"cool":0},"EH0J9SzTaEnY5_9bg59dzA":{"text":"Excellent slaw of use on the shrimp po boy and the frozen Irish coffee was exactly what I ","useful":0,"cool":0},"3VcpBHdNYkVfQ7Xv-lSHFQ":{"text":"I wanted a Poboy this trip to New Orleans and we got in a little late. Erin Rose was just ","useful":0,"cool":0},"H8J9K5FfutqKYt1I6iucnw":{"text":"I made a quick trip to the French Quarter for an Irish Coffee.  It is a must you try this.","useful":0,"cool":0},"PbnsTZTtrE6KY4H-Y7-okQ":{"text":"The frozen Irish coffee is delicious! A perfect refreshment just off bourbon for a warm da","useful":0,"cool":0},"9P_RKg59PHoaJfUNNunDsw":{"text":"On Conti.. right off of Bourbon.\nLittle dive bar that touts they have famous Irish Coffee.","useful":0,"cool":1},"bGksg45W4vHj9EQ9pvda_g":{"text":"One of my favorite bars off the beaten path of bourbon. This is a mix of locals, tourist a","useful":3,"cool":2},"pWocsOxoIi2kYmeBDRK2aQ":{"text":"5 stars for gourmet-ish poboys that aren't run of the mill. Marinated grilled shrimp poboy","useful":0,"cool":0},"mkc7qY0L_WNdZYVQ7D9hvA":{"text":"We went here as it is a little off of Bourbon St. which is too crowded for me. The bar is ","useful":0,"cool":0},"mLLVCtOM9Lc4B7QXqUThQg":{"text":"My wife and I ate here today...  It was all around great.  We has the shrimp po boy and th","useful":0,"cool":0},"lRcsIWa3lne1lc8rX5ToNw":{"text":"Best Bloody Mary in New Orleans are anywhere else!\n\nThe po-boy shop in the back is practic","useful":0,"cool":0},"qHVZsnk3qgZ16OSQq7yElg":{"text":"This is my favorite bar hands down.  The bartenders are rad. They have a good blend of per","useful":1,"cool":0},"09IpN0sR_ABc_63SVgt9Ng":{"text":"Hands down the best bar in NOLA. The staff know how to make a drink. No BS here. Drinks ar","useful":0,"cool":0},"UuEMbGBGczhNE0to86ATmQ":{"text":"In my many trips to New Orleans the Erin Rose is always a must stop for me. Located right ","useful":0,"cool":0},"meFXsS9YSaYcbUB7Uo0jig":{"text":"On our last night in NOLA, my husband and I made a stop at Erin Rose.  First, this is a li","useful":1,"cool":0},"E9LNOut8cnIxxCg2Sbz5mQ":{"text":"super cheap drinks! All the bars in the french quarter charge way too much. Not this place","useful":0,"cool":0},"ZuUm3J0KRgiQ1ti0EX5FgQ":{"text":"This was a fun spot, nice ebb and flow to the crowd just a bloc away from Bourbon Street. ","useful":0,"cool":0},"Src2Qt_ZD-EWeAvodliflg":{"text":"Visited Erin Rose on March 22st, very busy little place, like a dive bar but smells much b","useful":0,"cool":0},"OEl-0M-BUHAv-XIswPlN4A":{"text":"Frozen Irish Coffee here is fantastic. Do not miss. Consistency and flavor were perfect an","useful":3,"cool":0},"TdJy6zjFj_Ut8Ke_5uLOIg":{"text":"Fantastic dive bar with lots of character and friendly bartenders. Went here several times","useful":0,"cool":0},"GimEXR-z6wwq9ke9BikecA":{"text":"Low key considering the location, Drinks are cheap and the bartenders are always friendly ","useful":0,"cool":0},"WU_7DqMSJvzM269s4sjiug":{"text":"Frozen Irish coffee is the bomb. Make sure you don't go early in the morning when they're ","useful":0,"cool":0},"tiaL2qJbnBRa_c7--7YSOA":{"text":"Ambiance...great stuff to stare at when you're drinking.   There on a Tuesday and they wer","useful":0,"cool":0},"0ZMBXktoUhgGC8dlB1dXMw":{"text":"Ok, maybe its because its Wednesday and its the World Series but Erin Rose was not great a","useful":0,"cool":0},"xlzApzpBb6EYYuHXLzbDxA":{"text":"I really liked this bar. Sure it's divey, but it's great. The night is a bit of a blur, bu","useful":5,"cool":4},"DO3EvmgFf_ZpRpIHw1hLVg":{"text":"My buddy and I have an ongoing debate of our favorite bar in the Quarter.  He loves Johnny","useful":0,"cool":1},"mFRzBPwXtxCbJnztBdCW4Q":{"text":"omg this place!!!! i couldn't wait to try the pork belly po boy! un freaking believable, i","useful":0,"cool":0},"oVPrmMTMX3fOqgQvpwKeqA":{"text":"We are hooked. I am not sure why we didn't stop in here back in October or December while ","useful":3,"cool":1},"QwaGGgkLwczsIMKgU84yzw":{"text":"Loved it, went back a second time which we try not to do when on vacation and exploring. S","useful":0,"cool":0},"Gd-1_V8szxGCT-hKDZzYQw":{"text":"Loved everything about this place except for actual space.  On a random Thursday afternoon","useful":0,"cool":0},"8V_8b2MMv0uYqPTLfFJj1g":{"text":"I'm a little ashamed to admit my visit to Erin Rose this past weekend was my first ever. I","useful":18,"cool":17},"D5Jdy_MKw2WJdOlPLiIdwQ":{"text":"This is one of our favorite local bars in the quarter.  We highly recommend it to our frie","useful":0,"cool":0},"oNMpsdkzL3Frre1CgfbWBQ":{"text":"On two different occasions we ended our night on the town at the Erin Rose. On the last on","useful":3,"cool":2},"592hJmJdu9mtCWt76VxuRg":{"text":"Ms. Erin,\n\nThank you for your hospitality, for the welcome respite from Bourbon Street. I ","useful":0,"cool":0},"ShPDrm2xKcm_FriLaA5SAA":{"text":"Our first drink in NOLA! We got the frozen Irish coffee after hearing about it online. It'","useful":0,"cool":0},"vzIhATC7AUHMjR5__sn1oA":{"text":"Even if you're not a local, you'll feel like one in here. Reasonably priced drinks, a kill","useful":0,"cool":0},"W92Qj_ozSGvdWX_UnXNI4w":{"text":"Decent little neighborhood bar about a half block from the douchebaggery of Bourbon St. Ho","useful":1,"cool":1},"iUYc2S_a4iNwrxMf-b-o6w":{"text":"Frozen Irish Coffee!! This small pub probably makes the best I've ever had. I very quaint ","useful":0,"cool":0},"C9P66J4WLqCX6C5D06Cz5Q":{"text":"My favorite dive bar in the city! Very laid back place with an excellent bar staff and Kil","useful":0,"cool":0},"UogOqWoYhCYLIyLrCrmXnQ":{"text":"Best bar in the Quarter. Good cheap bloody marys, great vibe. The grilled cheese in the ba","useful":0,"cool":0},"o6ZcM79nkdcIg3QfTzR8ww":{"text":"Came here on the recommendation of Emily and oh my the drinks! It's considered a dive but ","useful":0,"cool":0},"OOcQULZy-UeoIYXJnaRQEA":{"text":"What's better than having to make your way through a great Irish pub to some of the best P","useful":0,"cool":0},"YPeHXvprW8rG2na8peQAvg":{"text":"With all the over-yelped bars in the Quarter, I was amazed to see this one getting not eno","useful":4,"cool":3},"dhRGwz5-ZA6B_HmQ719HKw":{"text":"The frozen Irish coffee is absolutely delicious. Definitely worth taking a trip for. The b","useful":0,"cool":0},"yk1F0dAMeVZXY63F4XbQOg":{"text":"It's a tiny little place that seems crowded with more than 10 people - and it seems like m","useful":1,"cool":3},"av59Py_lT-wbxLF0riMLUQ":{"text":"Great dive bar get an iced coffee. It's a bit of a change of pace from bourbon st. We stop","useful":0,"cool":0},"w8Uux7EchqVKUgYSSUeUAQ":{"text":"i loved this place, went there everyday i was in town. the staff (nate, randi and murph) w","useful":0,"cool":0},"DWdxXvH5XELlMPB8K-280Q":{"text":"FROZEN IRISH COFFEE. EFFING AMAZE-BALLS. Very impressed with our bartender, in such good s","useful":0,"cool":0},"nAhlaawx_cHmEsHMqeqhoA":{"text":"Went here a while ago with the GF when we were visiting NOLA on the recommendation of a fr","useful":0,"cool":1},"t9CtxypA8lKIqWy8uNaksw":{"text":"Review for Killer Poboys!\n\nKiller poboys is in the back of a tiny Irish dive bar Erin Rose","useful":1,"cool":0},"xgwajsw_YchpVVmD7Jdt6Q":{"text":"Nice dive bar - but wow, noon struck and the place was over crowded with middle aged drunk","useful":0,"cool":0},"9mMbvUJH92FSjU-cXu0zaA":{"text":"Erin Rose was great! It is a sweet bar just off bourbon street, with the most amazing froz","useful":0,"cool":0},"5uXd374CSYwLK1k8FVlISg":{"text":"Don't miss it. I was in NOLA for a weekend and despite the endless supply of drinking hole","useful":3,"cool":2},"M6EDbQEGtvh43qV6gAX8tg":{"text":"Erin Rose, thank you for existing, and thank you for serving frozen Irish Coffee!!!  Great","useful":1,"cool":1},"EKAoOTO2qFz8CxE6E5mUgw":{"text":"Any trip to New Orleans would be re-missed without a visit to Erin Rose. It is well known ","useful":1,"cool":1},"QJ17jlqFtgoPz3BbjAoIFg":{"text":"This bar feels like home. Good music, great drinks, excellent people. Murals in the wall o","useful":0,"cool":0},"sHRDHBxFm2EWcvZx72bb3A":{"text":"I spent 6 days in New Orleans for Jazz Fest and went to this bar 5 times, if that gives yo","useful":2,"cool":2},"75mkh8RfNuvixwNNtoN0kQ":{"text":"A great little dive bar that made me feel right at home.  They have an old, cd-player juke","useful":0,"cool":1},"-fuY2oS9yzbh6SukOP2fUw":{"text":"Went here the other night with a few friends and felt like I was transported back to the e","useful":0,"cool":0},"1EUam7nW3AZH-9d9gayrVA":{"text":"If you like  a spicy Bloody Mary, than this is the place for you! We are pretty picky abou","useful":0,"cool":0},"MwZrGpylGYxymrgKgt_yZw":{"text":"A tiny tiny tiny tiny bar. \n\nTiny. It is very small. \n(please read the above in an old sou","useful":6,"cool":3},"l1E5-NHT0zwzIDJ3Pd7_iA":{"text":"Just like everyone says, the Frozen Ice Coffee is way good.  Basically, it's a coffee milk","useful":0,"cool":0},"U1ywlnihBixYygmugfckOQ":{"text":"This is by bar the best frozen Irish coffee in the Quarter. 24 hour bar. Great at all hour","useful":0,"cool":0},"yAdFG3wrFEUjEVD_CQEokw":{"text":"Never been to New Orleans but the frozen Irish coffee from Erin rose got me coming back fo","useful":0,"cool":0},"_UVQEGDOgkxfxKS5fHNqKQ":{"text":"Amazing place great frozen Irish coffee they have a place in the back that serves poboys c","useful":0,"cool":0},"k0sL1i9ljAkUGssNXN3e0A":{"text":"Excellent slaw on the shrimp po boy and the frozen Irish coffee was exactly what I needed ","useful":0,"cool":0},"pDTEDC11HJGtC8vLdJVWMw":{"text":"A friend told us about this bar. It's right off Bourbon street and it was a very fun dive ","useful":0,"cool":0},"1M4lE_Z-cQfERgG5mMG3HA":{"text":"My husband and I visited NOLA over a year ago and we still talk about this place! We went ","useful":0,"cool":0},"It6s82XY8Oy1TvBhwlzkSQ":{"text":"Famous iced Irish coffee- check!\nLaid back, mostly locals vibe- check!\nExcellent music sel","useful":0,"cool":0},"I8Mo6vKBI6w3HRiKOxhFlA":{"text":"Best bar in New Orleans! Off the beaten path but not too far. Frozen Irish Coffee is aweso","useful":0,"cool":0},"bIoh-rZ6pAdSmVhoUZeDtg":{"text":"Every time I go to New Orleans - I stop here. This is the coolest dive bar.\n\nThe drinks ar","useful":2,"cool":0},"WhNvsVRO6LM2hS_HhaKqEA":{"text":"Loved it. Chill, great bartender, delicious frozen Irish coffee, and no douchebag barfers.","useful":1,"cool":0},"kl0qWFWEIIJF8hoK6z59NA":{"text":"If you're looking for a great pint of Guinness this is the place to go. They clean their t","useful":0,"cool":0},"qrHqPw39Bik-TTN2RveO_g":{"text":"Pretty cool spot...in the back of a dive bar!  Great poboys in a tiny room tucked in the b","useful":0,"cool":0},"Eeq39Ke1t46SdaP5tsqKgA":{"text":"This was our first stop in NOLA and it was well worth it. Much like our own favorite neigh","useful":0,"cool":0},"rorG8EBFhmdDtCcLsZRMOg":{"text":"Had a $3.50 frozen coffee during their 10-2 daytime happy hour. It was great. The décor of","useful":0,"cool":0},"aZdc1wuf_qeiRnKrPTrotg":{"text":"I thoroughly enjoyed both times I went to\nErin Rose. The first time was to have a few drin","useful":0,"cool":0},"FW_3v2H1HtR4tXybI8xpiw":{"text":"Love the fact that there is Killer Po Boys in the back. The frozen mocha drink is deliciou","useful":0,"cool":0},"TCxH4tXsIo4HPWEPVOeBGQ":{"text":"This is my forth trip to New Orleans and Erin Rose is the first place I go for their Blood","useful":0,"cool":0},"0u-uQ90vemkhANMa6pRf5w":{"text":"Erin Rose is a must go to every time I go to New Orleans! This divey bar has probably the ","useful":0,"cool":0},"4W3BEIwoLPFn4o_wGP4nsA":{"text":"This pub became a quick favorite! How can you go wrong when you come for the (amazing) po ","useful":0,"cool":0},"foiw-S6cUEe8dPwvLIe9DA":{"text":"The staff is super friendly, great drinks and good prices. The Killer Po'Boy is a must try","useful":0,"cool":0},"PG79wbp7pQMY1N_kNx9IgQ":{"text":"This place is set off of Bourbon Street. We tried it out since one of our friends is a HUG","useful":0,"cool":0},"q03LKWRcN14gwYekJsCL8A":{"text":"The po' boys are good here.  Real tasty and made to order.  The beer is cold and they have","useful":0,"cool":0},"AOr2BLhgtcQA0TdTnBSJrg":{"text":"Not just the best iced Irish coffee around, but also the best food ever AND the nicest sta","useful":0,"cool":0},"VFnR4kemjGDFCHzsH5hTrQ":{"text":"I wish I could give this place more than 5 stars. Honestly. It's that amazing. The killer ","useful":0,"cool":0},"JTXFvw-SiRz1i-YMkIzuOQ":{"text":"ICED IRISH COFFEE! I know that generally speaking Yelp prefers longer reviews, but that's ","useful":0,"cool":0},"LVTh9opi6ievQCN1VvZC7g":{"text":"When I think of Erin Rose.. Toby Keith  \"I love this bar...\" Song comes to mind.. And does","useful":0,"cool":0},"Uyi2gOHXhcyutQa4XaLHlw":{"text":"Roll the dice for a $2 shot. Go during the day when it's not packed. Good service. Actuall","useful":0,"cool":0},"Bho70Dbfe-xUEkWHeXje2g":{"text":"Right off Bourbon St, but a very different vibe. Drinks are great, decor and atmosphere fe","useful":0,"cool":0},"zDGmNfxAH4GEWG6wfkOF-A":{"text":"I was told that this was a most go place in New Orleans. Definitely a hole in the wall kin","useful":0,"cool":0},"JyhJoIPCGh12jgLQxD3aFA":{"text":"You wouldn't expect it for a Bourbon street bar. The black\nbeer beef debris was damn good.","useful":0,"cool":0},"TJ2BGcToWP119N5GrK8-QA":{"text":"One of the best juke boxes on the planet. Cool bartenders. Jameson grilled cheese will soa","useful":0,"cool":0},"KA1dyy5QOzNXNxe_RM7ixw":{"text":"Frozen Irish coffees in a narrow divey-ish but lively fun environment--or to go. \n\nHuge, m","useful":0,"cool":0},"DeGWo3eO8-wbWgtyuTWSyQ":{"text":"Love this hole in the wall dive. The Frozen Irish Coffee is a must have. Hungry? Grab a Po","useful":2,"cool":0},"SNRnGYU0OEYc2AAk1Y5-Wg":{"text":"OMG my fav alcoholic milkshake in NOLA! It's a frozen iced coffee with a shot of Jameison'","useful":0,"cool":0},"gCSLZGa3n7v1qisAxWIoaQ":{"text":"Written with the caveat that I will give this place another try, as my fellow Yelpers (Fel","useful":0,"cool":1},"Y_PHtWLQeIfXaU7hOnqeFg":{"text":"This place was great! Drinks were cheap and it was right off of Bourbon St. I left my card","useful":0,"cool":0},"heFiXIQt6jN88rQGi0Icvg":{"text":"Best bartender in New Orleans! Reanna (sorry, probably spelled wrong) went the extra mile ","useful":0,"cool":0},"BSrrr0ZdV7V_eeZJE2BnZg":{"text":"Really liked the music, decor, and Irish coffee! Would go back. I liked the po boy sandwic","useful":0,"cool":0},"wg1pY6XfD4arbxPVYc8s9w":{"text":"This place is definitely a dive, but in the good sense.  Very chill atmosphere with good d","useful":0,"cool":0},"ohTLjCEVo4X1H2gKZVa9Vw":{"text":"Honestly, I had no idea this was an \"Irish  pub\" until coming on Yelp to wrie a review. Fr","useful":0,"cool":0},"xcipXPBRFjVqrHzEfEgyuA":{"text":"Hole in the wall that I visited based on some very good yelp reviews.  Sadly, the pork bel","useful":1,"cool":0},"Rt8swEAOvZ1dOvtlJdH3mw":{"text":"We were vacationing in NOLA and met an old friend, who now lives in NO, at Erin Rose.  She","useful":0,"cool":0},"jvjw7QHQjP6XHpYoowAhCg":{"text":"Walking through the French Quarter and discovered Erin Rose. Open with windows of air in f","useful":0,"cool":0},"1OCAk3skoyWiTeeEPo6kkA":{"text":"Let me start that this is not a tourist trap just because it's right around the corner fro","useful":0,"cool":0},"7IhD8v5uCO1lmzeMvtv67A":{"text":"Admittedly, I came here first to try the poboys in the back. But as soons as I set foot th","useful":3,"cool":3},"BOXIoSzpMH0o4WGVs3elPg":{"text":"Quality dive. Got a seat right at the bar, ordered a famous Irish Coffee (delish) and went","useful":0,"cool":0},"TzQblkwrFfLozMXvzI49Fg":{"text":"We took a spur of the moment trip to NOLA, and I was here on a rainy Monday afternoon with","useful":0,"cool":0},"9b32jLz4epABmRZ9FyHVKw":{"text":"Best bar in the quarter. Randi was awesome and the drinks were amazing especially the care","useful":0,"cool":0},"Sju-al2tJczzyr3AsaToMw":{"text":"Erin Rose is a must stop in New Orleans for their frozen Irish coffee. It delicious and se","useful":1,"cool":0},"mYa1RJwFlsqbfFFSp8kCaQ":{"text":"Yep....Irish Coffee is delish!!  Bartender was great, even looking up a coffee drink we lo","useful":0,"cool":0},"93AOHICeO6_VAM3abUYsYQ":{"text":"We went to this bar only for the reason to get PO' boys in the back. It's kind of a neat s","useful":0,"cool":0},"PbkQn-a_2ZiV8BSMLs4uuA":{"text":"very tired of bourbon street, a friend and i wandered down conti in search of a less-touri","useful":0,"cool":0},"oE44BPDwJ7Js2Hnz86vuRg":{"text":"Small hole in the wall...definitely a nice refreshing change from the typical Bourbon St b","useful":0,"cool":0},"QznyPjCjbJ0QH6XQMhul0g":{"text":"If you do not get a frozen Irish coffee from Erin Rose when you come to Nola there is some","useful":0,"cool":0},"FKYbCYs5sagx8hT-j-HovQ":{"text":"Awesome po boys. I had pork with sweet spicy burbon flavour and sipping all kinds of James","useful":0,"cool":0},"fFrt3Ynss6-aZ_gD71D5YQ":{"text":"Love this bar. I initially came here for the poboys but since they seemed kind of untradit","useful":1,"cool":0},"u3fBp3zBCkAO-7YI-pXhaw":{"text":"Bartender accused me of \"stealing\" from him because I took a sip of my drink while waiting","useful":0,"cool":0},"N74Tydb7xroILQfNpQLN7Q":{"text":"Love the feel of this place! One of my top favorite dives in New Orleans. The bartenders a","useful":0,"cool":0},"xQcsv2xrzHZTQxfNpT826g":{"text":"My husband and I only had one night in New Orleans, and wanted to find a cool bar in the F","useful":0,"cool":0},"kS5cBNXxZBych-fY61IiGA":{"text":"I'd give this place 10 stars if I could. We were there bright and early for a frozen Irish","useful":1,"cool":0},"d7l5oeo999E84EOPTDLklA":{"text":"While on vacation I try to visit as many different places as possible. Rarely do I double ","useful":0,"cool":0},"U51Nwzv4HlkXRMFLxcVvkw":{"text":"When I go out I typically stick to beer, wine or tequila - but my friend got everyone a ro","useful":0,"cool":0},"30mkQrYM5UqG3NF37nj_nQ":{"text":"I love this bar!  My sis & I stopped in eager to check it out after reading so many great ","useful":0,"cool":0},"_y48WazsXfEuQZD-kp8-Aw":{"text":"Non-Bourbon St bar with great drinks (try the frozen Irish coffee) and personable bartende","useful":0,"cool":0},"dDLHMi2xVkBSlPnHuJte1A":{"text":"This place was quite packed when I arrived and it took some work to make it into the back.","useful":0,"cool":0},"hRsqEPffc9au7IH6R3IZOA":{"text":"One of my favorite bars in NOLA! Halloween was awesome there and the service is great, the","useful":0,"cool":0},"t-1XKtaWnTBKu-q2eoWdJQ":{"text":"Best little gem right off of Bourbon. Rianne (spelling?) the day bar tender was awesome! F","useful":0,"cool":0},"wYSzQziYFmvMW2OuW65uuA":{"text":"My boyfriend picked this place out because of their famous bloody Mary's and frozen Irish ","useful":0,"cool":0},"SWorf1j7ADS2tiCUzvv7oQ":{"text":"Love it! Love the environment and history. NOLA always has such good restaurants and the E","useful":0,"cool":0},"6uf1kQSCPTXD-N43O2EUmQ":{"text":"Great little divey place with cheap drinks. I also highly recommend the frozen Irish coffe","useful":0,"cool":0},"St_YNDo-xI9o0YFxOeN1pw":{"text":"the BEST in the French Quaarter! It's the first place i go in NOLA. the Best Bloodies. The","useful":2,"cool":1},"TQrmE70FtBMRskhAoMyMfw":{"text":"When in New Orleans, some places just feel like they have more spirit than others.  In a t","useful":1,"cool":1},"QUbo8YGY5_o44Q21Ds-2RQ":{"text":"Love, love, love me some Irish Coffee. \n\nCompared to the other Irish Coffee's in town, Eri","useful":3,"cool":3},"XU4PnFNdwWjFN-rN8O2HIw":{"text":"Absolutely some of the best food I have ever had; it looks sketchy but don't let that dete","useful":0,"cool":0},"amTdYjFyObrR5JTlLhD_ng":{"text":"I just got back to Houston and I miss the Erin Rose already. I love the crowded streets an","useful":5,"cool":3},"MEyXcfBuTOgCnQpt2wfPSw":{"text":"Everybody can do drinks, the staff of Erin Rose make the difference.\n\nBesides, what kind o","useful":0,"cool":0},"jCSZ1TkfY6ZtqQN4Y74fsQ":{"text":"Erin rose is divey, but it's well worth it to try their signature frozen irish coffee.\n\nTh","useful":0,"cool":0},"S4Ra7CD-Dxk3RaW9HHE_mw":{"text":"Stopped for a drink and decided to get a poor boy.  Holy cow!  Absolutely the best I've ev","useful":0,"cool":0},"YlJOty9Sj44EXh0lHmGCag":{"text":"Erin Rose is an amazing tucked away bar with fantastic frozen Irish coffee. The people are","useful":0,"cool":0},"teRFoWoGUstEwbD3iwEvkQ":{"text":"A must stop in every trip to NOLA. Try the frozen Irish Coffee and the Shrimp Po'Boy. The ","useful":0,"cool":0},"ZjyAF6hUAykNWaafc8aEiQ":{"text":"Jim Monaghan, who founded Molly's at the Market at the other end of the French Quarter, al","useful":0,"cool":1},"LNBjYk6BdS3MK13iH1KaRQ":{"text":"I love this bar. It is definitely a small local dive that can only fit 20-30, but looks li","useful":2,"cool":1},"XU9phH-0wyqNe2L79lGL9Q":{"text":"You must get their blended Irish Coffee. It is a basically an alcoholic frappuccino and oh","useful":0,"cool":0},"4r3EUERxRTYVuw1-3lQmzw":{"text":"This place was creepy and we were there during the day! Actually didn't go to have drinks.","useful":0,"cool":0},"LhAshjq1bRCyXsKyhfWn0g":{"text":"Fun place. What you see is what you get. Fun dive bar located in the French Quarter right ","useful":0,"cool":0},"2C_kvquvS7CY6p6GYyAChg":{"text":"Cool hole in the wall Irish bar in the heart of the French Quarter. A friend who's a local","useful":2,"cool":1},"-GW5H_YtROuoyHkvHbrYSQ":{"text":"If you like bars that decorate for Halloween and have an awesome music selection, go here.","useful":1,"cool":0},"VaBn-UkG-ntaF5f-aw4ONg":{"text":"Welcome break from the crazy of Bourbon St.  Kinda dark and divey but in the best way poss","useful":0,"cool":0},"BXV9XSBo8eSXcyHZH9vYNg":{"text":"Went here on my first day to New Orleans to try their Irish Coffee drink.\nAs my husband an","useful":0,"cool":0},"c0Z6fsnTlCLCNYPXXvdO8A":{"text":"Very rude stuff and very small place, not a place you wanna go and enjoy your time. On a b","useful":0,"cool":0},"Be_MzpXfUvF4T4OkkM8ukA":{"text":"No words to describe....Simply ONE of the best drinks I've ever had!!! So yummy!! I have t","useful":1,"cool":0},"NSb9hryFXwTj5lE9yiYqug":{"text":"Perfect little dive bar right off of Bourbon street. Lots of locals. Cheap drinks and if y","useful":0,"cool":0},"eZL39f0VP4y9bBbpBctRoQ":{"text":"I really loved this place while visiting NOLA best Poboy I ate while here was at Erin Rose","useful":0,"cool":0},"dSSWR4G0YyZeO7sVi_SKZw":{"text":"Bartenders were super friendly and attentive and the Frozen Irish Coffee is perfect. Can't","useful":0,"cool":0},"FMTdLBEqeznLwyWSbzlH7A":{"text":"This place is always on my list when I visit New Orleans! The bartender jeff is awesome an","useful":0,"cool":0},"obv8nt4wnVrugHtoEBsrew":{"text":"Fun dive bar. Great escape from Bourbon St. \n\nAwesome po' out place in the back. So order ","useful":1,"cool":0},"7p7WoiUUac7-ag7sAKpaLw":{"text":"Love it. When we're in NOLA a must try. Bartenders are all on their game. Great Hot and Co","useful":0,"cool":0},"--3EBLV-_xMpZ5s35A5QBg":{"text":"I would give no stars if I could. Pride weekend, my friends and I all ordered drinks at th","useful":0,"cool":0},"crGJ8c6RJ0oDmv20zZIJZA":{"text":"If you're in New Orleans, you need to get frozen irish coffee from here. I started my days","useful":0,"cool":0},"g7GWExg4JZiPe8nGd2G89w":{"text":"Cool bar, great juke box, awesome bartender (Mollie)... Get some old New Orleans Rum here ","useful":0,"cool":0},"J2rTJNUlm38aWsfaUVhuPA":{"text":"great little neighborhood dive bar.  highly recommended!  bartenders were personable, offe","useful":1,"cool":0},"k5fyePhxzqp4ZwKpUBWW1A":{"text":"Great crowd, great wait staff, stiff drinks, cheap drinks, poboys next door, and on bourbo","useful":1,"cool":0},"x_M2YE7RRgMZuVtmkRNxtQ":{"text":"This place looks like a dive, but has fun atmosphere and a fun, tucked away restaurant in ","useful":0,"cool":0},"Fh5Ifh-Z0Iy-0GPJMIZANA":{"text":"Never ending happy hour and the best frozen Irish coffee you will have in your life.  It's","useful":1,"cool":0},"T23Y-mdeQuScaa0lp3sWhg":{"text":"I can't say much because I only wanted to try a frozen irish coffee based off the many peo","useful":0,"cool":0},"Cadn6EUJLii0WfVVghyM_w":{"text":"Crowded!  But one of the only bars in the quarter I like.  Mmmmm... frozen irish.  So wort","useful":1,"cool":0},"AxzqlQR0ovczZEdb3Noc9w":{"text":"Crazy good po boys! I had the shrimp, awesome. My friends had the meatloaf and grilled che","useful":0,"cool":0},"znFfikzXeRe4vVdtqOKHMw":{"text":"Since NOLA is now only an hour away from me, discoveries like this bar make me warm and fu","useful":0,"cool":0},"d6ltdnOBqZrNUeQC3Jzlog":{"text":"Best frozen Irish coffee ever. Came here three times and we were only in NOLA for 5 days.","useful":0,"cool":0},"sTJghi6ct0TqIO3OnMLQaQ":{"text":"Our first and last stop! Love this place, it's got a good neighborhood vibe. Had to come b","useful":2,"cool":2},"XsHIIeoXxEU-2LpG_7mLdg":{"text":"Less than half a block north of Bourbon, but feels like you're in a different world.  If y","useful":2,"cool":0},"6nOOfqNeH3TVaV2D8rXJzQ":{"text":"Erin Rose is a casual bar in the French Quarter known for its Shrimp Po Boy in the back of","useful":1,"cool":0},"SBhvVxCgPinwX8qGq9b77g":{"text":"I love this place!  Great music and Rhianon is the bomb!!  No she literally had a classic ","useful":0,"cool":0},"uvao1_iIOVE155CZt0JjmQ":{"text":"It was 100 degrees out, we had been walking for miles, and I needed a frozen drink - STAT!","useful":6,"cool":2},"rkH2DagcLv5UrVKSXqVhZA":{"text":"I've been a faithful fan of The Erin Rose for many years. There was a time in which I freq","useful":0,"cool":2},"kkiwrXuhoetS8fsbEPlh5Q":{"text":"This bar is great, affordable prices, tons of drink specials during the day and the frozen","useful":0,"cool":0},"ahNPctVwnetSG2DMN6Yqqg":{"text":"This place is a bit hidden in the back of the Erin Rose. These poboys are LEGIT! This is a","useful":0,"cool":0},"pUpOZXl_T6aWfE8a5jMh8g":{"text":"Went here tonight because someone wanted their iced Irish coffee, and I must say, that was","useful":7,"cool":4},"EXLmGMAqHyFfBCzJiLIXjA":{"text":"A dive bar at its smoke filled grungy best.  The bartenders are amazing and the prices are","useful":1,"cool":1},"4Kys-GsC-rhmOz_VDp7uoA":{"text":"You're going to see my 5-star review, and then walk into this place and think, \"Mike, what","useful":1,"cool":0},"_Yojv9NdivS-YVrrNf91Sw":{"text":"This was a quick stop on a recommendation from a friend to try the iced Irish coffee. It w","useful":0,"cool":0},"wfCJ8NCiem9H4N055RwF1g":{"text":"Great prices on beer. Good juke box & friendly bartender. Great selection of Irish whiskey","useful":0,"cool":0},"1QSKK5GZC_NpZW_N6aBrDA":{"text":"I was not impressed by their sandwiches and the eating area in the back was filthy. \nThe b","useful":0,"cool":0},"Bm6MZJEKY1mmshMldI6kQg":{"text":"We stopped here on a recommendation from a gentleman we met on the plane ride down. I wish","useful":0,"cool":0},"xN2mXDmDUkee2iSQYu0jLw":{"text":"It was in the 40s outside, but enough people had told me to come here and try the frozen I","useful":5,"cool":4},"p2ziHKmpYUcdem5E9ODriQ":{"text":"This place. What else can one say? I just love it. Great divey vibe, great drinks, and gre","useful":0,"cool":0},"HeXC-6_XDQOrM6faTToFag":{"text":"I lived off the iced Irish coffee with extra shot of Jameson my whole vacation. This place","useful":0,"cool":0},"woCa0xDloAo82ciel3HVnQ":{"text":"Almost tempted not to write this review because making it even more crowded for my next tr","useful":0,"cool":0},"X3HC0neSeeQZN641514wug":{"text":"How in the hell do you review Erin Rose? I almost feel like I shouldn't... But I will.\n\nA ","useful":14,"cool":14},"RSLTnHf7ksqJDJaMYlzKaQ":{"text":"One word ! Best Irish frozen coffee ever !!!\nPlace does not smell bad. It's pretty small a","useful":0,"cool":1},"wJgyRkwnTbmokVUaBC6_hw":{"text":"Amazing Frozen Irish Coffees...\n\nIt's August in New Orleans....you bet it's hot and humid.","useful":0,"cool":0},"6KqV0x486pLAhk2Xh64qJA":{"text":"Top of the mornin' to ya! After a brief visit to an overly packed bar with too much loudne","useful":5,"cool":2},"yOLGxeWWuleeKRi6DZAEAA":{"text":"Just discovered a gem!!! Googled po' boy, and Erin Rose came up.  A little hesitant, but t","useful":0,"cool":0},"yoyX9oWMi8qOqpRIEOXhrQ":{"text":"Great spot for locals to hang pre-game.  Good spot to have a Jameson and chill.","useful":0,"cool":0},"hKvSrdgdtGAcvu-21dgyAg":{"text":"Pretty neat dive bar just off of Bourbon street, good local beers and reasonable prices.  ","useful":0,"cool":0},"aCsb4dLHwHnCEkSGocHWoQ":{"text":"Fun little dive bar to grab a drink (and a po-boy from Killer po-boys in the back).  It's ","useful":0,"cool":0},"-7WPfL2xXW7n8kP77CjyYg":{"text":"Good for what it is. A step above a dive with awesome frozen and hot Irish coffees. Cash o","useful":0,"cool":0},"1avtrFrGb9_gYkE6RR8zNg":{"text":"Five stars for the Frozen Irish Coffee. Don't ask questions; just order the large.","useful":0,"cool":0},"94oxSzUKCFbRgcCdk-YEaQ":{"text":"Great pour. Get a Po Boy from next door. The decor is a festival for your eyes. The bathro","useful":0,"cool":0},"ZGERr_wU5WOcjkeBojKrtw":{"text":"Wow what can I say, I now see why this bar is so popular. We had an after party here and w","useful":6,"cool":6},"yZknB8v1Vk2fgwGQHYUpNA":{"text":"Went in to try the famous frozen Irish Coffee, purchased a large for a decent $6, paid wit","useful":3,"cool":0},"VfBTk2TSi6Qq1a9H-a4h6Q":{"text":"Very good Shrimp Po Boy, not so much for the pork belly!!  A bit disappointing and wouldn'","useful":0,"cool":0},"G03nSqT56CG8mRJ5H2Ajbg":{"text":"Great prices esp at Breakfast. Great vibe and an exceptional jukebox, which is appreciated","useful":0,"cool":0},"7A0Z_7KXcJx5oBqibu5MhQ":{"text":"After hearing the buzz about the \"killer po'boys\" we stopped in to give them a try & a bou","useful":1,"cool":1},"E4cpEQPR5L7lg25eg5Xa-g":{"text":"No, I don't want to leave a review and have more people fill this already tiny dive bar! B","useful":1,"cool":1},"LZKwG3kKoOIQJD6-DLTIww":{"text":"I love New Orleans - the culture, the history, the people, the lack of open container viol","useful":3,"cool":2},"lAWoHn2OSbxgb3nLOoGXjA":{"text":"Awesome frozen coffees. I still dream of them and am constantly tempted to fly to NO just ","useful":0,"cool":0},"PoeYqppDWk2wfwW6DJUiYA":{"text":"Super chill bar.. good and cheap drinks. Def worth a stop here. No nonsense.. just good dr","useful":0,"cool":0},"gkzRI-DdCQYEz1FhK9eGFQ":{"text":"Frozen Irish Coffee... what more could you want from an Irish restaurant in the French Qua","useful":3,"cool":2},"gBJ6f4P514MdCS9CQOFdRQ":{"text":"They may have the best food in NOLA but never got a change to try it\n\nKitchen service was ","useful":0,"cool":0},"HxJ4hNBapnkJnTLwMa7FXw":{"text":"Great dive bar. The frozen irish coffee is a MUST. Get a large and it comes in a plastic E","useful":4,"cool":3},"_6R-Ie-SW-ir_pVakKa_XQ":{"text":"Bartenders are great. Por boys in the back are great and slots cash you out. $5 winner!  Y","useful":1,"cool":0},"FF0LgUZufVvaqHq0-5os7A":{"text":"Frozen Irish Coffee, Jameson Grilled Cheese, Pork Belly Po' Boy - oh my gosh. Everything o","useful":1,"cool":1},"7sDu5q9-7HZZOegMYPryPg":{"text":"Best priced drinks I found. The frozen Irish coffee was delicious and the Bloody Mary was ","useful":0,"cool":1},"ISHltoEaHoWKjGWGgJ5ByA":{"text":"Great service, good beer selection and a cranking A/C; in all a great place to hang and ge","useful":0,"cool":0},"cFYK191chkxZCdO9Lw0nvQ":{"text":"The best frozen Irish coffee! My bf tried the hot version also and very much enjoyed it! B","useful":0,"cool":0},"f3oRHqEqzE82A-pfdZEGIg":{"text":"I wouldn't call this an Irish pub at all. It's a tiny, dive bar. Maybe the owners have Iri","useful":0,"cool":0},"aC6_rA4avo3a-1zc8h4uYw":{"text":"I heart Erin Rose. If it is worth me crossing Bourbon and being that close to Bourbon for ","useful":3,"cool":1},"aExgUOHUZ0cQRNgvjwIezw":{"text":"I 1000% understand why this place is thriving with reviews!!! \nThe bar staff is ahhhmazing","useful":1,"cool":0},"URJKSCtwakgHQFnZN4jZ2g":{"text":"Seriously fun dingy bar- the way I love them.  Bartender super nice- Mathew!  Thank you fo","useful":0,"cool":0},"3plx8_Uc5C0YO3IUghb__w":{"text":"Great frozen drink! Great sandwich place! Great bartenders! And they strictly keep out the","useful":0,"cool":0},"IXQbQFSduMMcC5FevFHEXw":{"text":"The 5 stars are for the frozen coffee drink. $3.50 for 12oz of greatness. Get it in a to g","useful":0,"cool":1},"uJZCjyzBKsK0_FzktXQdow":{"text":"You can spot this bar while walking down Bourbon Street though it's not quite on the strip","useful":1,"cool":0},"i1Qnah1ZA-2ouCqd6I9Sxw":{"text":"Chief and bar tender are both really friendly and gave great customer service.\n\nThe Irish ","useful":1,"cool":0},"zHu7_F2YnIZ5wmf4iPeA1Q":{"text":"Drank here while eating at Killer poboys, great fun atmosphere and the frozen Irish coffee","useful":0,"cool":0},"UsyvbNH-vuFldqjMzHWEcQ":{"text":"Definitely one of those \"hole in the wall\" gems! Our bartender Randy served us some delish","useful":0,"cool":0},"j_2yWAbCr2sGZmvsYYeEgw":{"text":"Liked the vibes of this place but I couldn't say if I was having Irish coffee or Starbucks","useful":0,"cool":0},"ABftBxWRCVc1y_Bv7aaiSA":{"text":"Such a cool little bar right on Conti and Bourbon. The first night in NOLA i walked by Eri","useful":8,"cool":9},"7HBX9TgGoMlcAdUEuKIfPA":{"text":"The frozen Irish coffee. That's really all you need. On a hot day this was perfection.","useful":0,"cool":1},"x7F3Qu3-Hwe8dYyMuv2JqQ":{"text":"My first time here and definitely won't be my last time! Ordered the frozen Irish coffee a","useful":0,"cool":0},"idHNtfBdW0Lvifycv7rDFA":{"text":"This is my favorite dive bar in NOLA! It's just off Bourbon but so different from the usua","useful":9,"cool":7},"2YqXFbxCiYjz24jCwvgkvQ":{"text":"Great frozen Irish coffee. Extremely rude bartender. Don't know her name but she is fair s","useful":0,"cool":0},"1F15EGPX55NVMB4U9kIaxg":{"text":"We didn't stay.  Small, dark, dive bar.  The size reminded of those prison movies, not muc","useful":0,"cool":0},"LWU3J4GMDet5vDcc9CtcQg":{"text":"Nice dive bar with a slick rick lookin bartender with tons of funny stories and knowledge ","useful":0,"cool":1},"5rHJmlB81UsdCYDWUiSZ-w":{"text":"We shall see what they reply. This is the email I sent since no one answers the phone ther","useful":3,"cool":1},"7v5WWyFCONwphGxWqlncEw":{"text":"Very disappointed that they have a $10 minimum on debit cards. I'm sorry but not paying at","useful":0,"cool":0},"jvFyYjzC_wg7G-tC-bE_wA":{"text":"We were looking for Killer Po Boys, which is the back part of this pub. It was really hard","useful":1,"cool":1},"j9Kw1Wof5xqsRD74HGpISg":{"text":"I favour a less is more approach to Bourbon St in that I enjoy it far more the less often ","useful":3,"cool":2},"PQSdTqE4fyikxWMDjsts4g":{"text":"I have fallen in love in New Orleans. This bar has totally stolen my heart. Had a night of","useful":0,"cool":0},"PQfLPrskT3fN0qAOJMIakg":{"text":"This is one of my favorite places in the French Quarter area. It is a pretty small bar wit","useful":1,"cool":0},"9eBpMGabo88XV3xXceWM_g":{"text":"While the food was tasty and the service in the rear of the business was very accommodatin","useful":2,"cool":0},"5dcmWvgEACrtC5CQSn_G1g":{"text":"Po Boys !!!! Beer braised beef debris po boy and whiskey grilled cheese. Both very good.","useful":0,"cool":0},"hCAyzr-De3Q7Lftf_WbuMA":{"text":"Great Irish pub on Conti just off Bourbon Street.  First night in the quarters and I neede","useful":0,"cool":0},"SAehxEounrTYwqhJpybNLQ":{"text":"Awesome little dive bar. Their frozen Irish coffee is awesome. Drinks are fairly priced an","useful":0,"cool":0},"R6V5zf5ghCqtOWF8JG09Qg":{"text":"Erin Rose is a fun little dive of an Irish-style pub bar located in the heart of the Frenc","useful":2,"cool":1},"10OQNM4kbQRV7CZbxopJbw":{"text":"Oh wow, the frozen Irish coffee was really good! It was cheap and tasty. We order 2 souven","useful":0,"cool":0},"l64WLIYOwM0DgP5N8xFY5Q":{"text":"Love this place!  I came to New Orleans for 4 days, and this became me and my boyfriend's ","useful":0,"cool":0},"CCSKL5nDwK7D9ipL3mdVxQ":{"text":"This review is based on being in this bar for one minute and thirty seconds. Their frozen ","useful":2,"cool":1},"hWXfSD6XdCktxrG_Hb5uKw":{"text":"My review is based on the experience we had today. We took a cab to this location due to t","useful":1,"cool":1},"zg_wU04vBja7tJlo5OR4XA":{"text":"This quickly became my favorite bar in the French Quarter.  The staff is very professional","useful":0,"cool":0},"sRgbxZTaYzmmDiwOvjK9Vw":{"text":"Cool vibe, cool people and a definite local's hangout. I just hope all this Yelp press wit","useful":0,"cool":0},"vp-D06tEdQN64BuWJsEHKg":{"text":"My favorite bar in New Orleans. In the French Quarter, but off Bourbon St. Great drinks, a","useful":0,"cool":0},"CA5eswWZzX_XSMsUVmWwjA":{"text":"This place is known for its Irish Coffee and now I know why - it was very good. It's a sma","useful":0,"cool":0},"_023wTtZigNZaUgrMyU4dw":{"text":"Good drinks, good people, good times. This is a cool little bar just off bourbon st. A gre","useful":0,"cool":0},"nuOZYy8WyVa7-8ybahCy2w":{"text":"Yes! This is just the kind of place I was looking for! If you are looking for a dive bar f","useful":1,"cool":1},"bdEOEo3dTUC2_JdbRSmFGw":{"text":"This was a great Sunday night option just off the rubbishness which is most of Bourbon St.","useful":0,"cool":0},"Cb4Y1WjcHd2n6wOYvk8PDQ":{"text":"Only negative thing with this bar and several others in the area is the restrooms,if you c","useful":0,"cool":0},"Wcx-j03D-zZDVUCSjJr81Q":{"text":"I spent a year in New Orleans, and basically lived in the Erin Rose. It's literally a ten ","useful":1,"cool":2},"mAw7cWbGmLHcxFKezuUcGw":{"text":"ive been here three times once was a day or two before halloween. that was interesting i s","useful":1,"cool":0},"p7UyBvDJv1sDEw4zwIx9wg":{"text":"my kinda bar in my kinda town! take a trip down to the big easy and see for yourself. try ","useful":0,"cool":0},"1dY9cwgtu6R2V4GjJoOOgQ":{"text":"Erin Rose is undoubtedly my favorite bar in the quarter. Unbelievable frozen Irish coffees","useful":0,"cool":0},"P7tmP5u_pGllDy5I1iBLdQ":{"text":"Erin Rose exemplifies the best of what you want from a New Orleans dive bar. Cheap drinks,","useful":0,"cool":0},"kv_e5Niq9KUX6MAuOJsSWg":{"text":"Best Frozen beverage in NOLA! The Frozen Irish Coffee....tastes like a mocha milkshake and","useful":3,"cool":2},"6IpTGgx2QYiEFtgNV3Fd5g":{"text":"Nice little pub in the Quarter. Was close to our hotel so we made multiple stops to and fr","useful":0,"cool":0},"NuFXFHDM-cYqS-jYe-T2Hg":{"text":"great little bar that you'd never realize was a hair off Bourbon.  I've been by this place","useful":3,"cool":1},"gGi2RUdFm6dy21LyqHML9w":{"text":"I'm now obsessed with this place. Matt/Matthew (which ever he prefers) at the back bar was","useful":0,"cool":0},"jmS_kMbiN976gZk3Se-x-g":{"text":"Get the frozen Irish coffee!! Super good and perfect for a warm morning! Bar was on the sm","useful":0,"cool":0},"JGTXp4Q_P0QD56UIZ12lpg":{"text":"AMAZING FROZEN IRISH COFFEE. \nI am in love. \nThey taste like a mocha java chip from Starbu","useful":1,"cool":0},"WniB0A7jH1UtdvokYu-3zw":{"text":"This is our home bar when we are in town.  Whenever we walk in, it is like family.  Must t","useful":0,"cool":0},"i3GDOCmLoT0cSTT3iggWEw":{"text":"Pork belly sandwich was very saucy and was mediocre \nSeared shrimp was delicious\n\nFrozen I","useful":0,"cool":0},"hfD1ZVXq2Fpe1D2I9gZvGA":{"text":"Great local hole in the wall bar with some of the best Po boys! Got a recommendation from ","useful":0,"cool":0},"RZdGOFT_nGiZh091Ddf4fA":{"text":"Best bar in town with the best po-boys. Tucked on a size street, this little Irish pub doe","useful":0,"cool":0},"wdTGOElJHp5gXqhezG2Tnw":{"text":"This is the best place. The staff are friendly and know how to make an amazing cocktail. A","useful":0,"cool":0},"AoRtdnb5uYlGMFzY1qG81A":{"text":"Probably my favorite dive bar in New Orleans. Helps that Killer Po'boys is located in the ","useful":0,"cool":0},"OevedlajtP3GUnY_uIfv2g":{"text":"Let me start with this, they have hard cider!  Its a great, small, Irish bar, they have a ","useful":0,"cool":0},"EwTKIDCyfqC0Zpguj-rjvA":{"text":"This is a must stop on every visit to NOLA. I LOVE the frozen Irish Coffee. The Bar is pre","useful":0,"cool":0},"PEzdz6S1Ec53yxsmLC0LIw":{"text":"great bar, great bartenders. FQ charm coming out its ears.","useful":0,"cool":0},"_m9yn8NyghUiwvBq9s_KRA":{"text":"So after reading the Yelp reviews, I was really excited about this place. When we walked i","useful":2,"cool":0},"uqp5q41p6YSzCL1tOCu7zw":{"text":"Awesome dive bar here in New Orleans!!  We love the Irish coffee here!! Order it iced it's","useful":0,"cool":0},"JoNCoBROsv8OdBEBWeZSbg":{"text":"I'd heard about Erin Rose for a while, but never seemed to make it there on my trips to Ne","useful":0,"cool":0},"kN68dsspMnnRzQA2X2tkaw":{"text":"Had a great time today, the atmosphere is so laid back and the drinks are great!\nEnjoyed t","useful":0,"cool":0},"i46iIRIO8-JRojQs9oXpCw":{"text":"Very few people love a good dive bar as much as I do and I found the Erin Rose while plann","useful":2,"cool":1},"ORoWXQcLJJYrQpenqrhx4g":{"text":"Funky little bar - friendly bartender, we went for the frozen Irish coffee  - Which was ve","useful":0,"cool":0},"HB5HsN5zP_qldtQBjSxChA":{"text":"My friend took me here because she said the Frozen Irish coffee was to die for, and she wa","useful":0,"cool":0},"4RjF0MtH_alAQBRBqqB1Gg":{"text":"One of my favorite little hidden gems just a few steps off Bourbon St. I went first becaus","useful":0,"cool":0},"fS3iyTEZPK4tg5Subr3k0g":{"text":"Are you in New Orleans and looking for an Irish Bar?  If so, look no further, this is the ","useful":2,"cool":1},"z4BO2-UnmubwYCwnDcVSIg":{"text":"A disgusting dive bar. I have a good attitude on dive bars generally, but this stretched m","useful":4,"cool":2},"3PEoSAoIalxnSxyAxK_1Lg":{"text":"Went here just to try out one of their frozen Irish coffees based off of the reviews on he","useful":0,"cool":0},"ua7gao_432CK5tQGyZVF3A":{"text":"My favorite bar in NOLA. I will come here forever!!!! $5 Irish coffees which are as good i","useful":0,"cool":0},"QnoOdqavFaVWq4j4kx0-fQ":{"text":"Amazing atmosphere. Amazing po boys. Amazing Irish coffee. FYI-Cash only like a lot of bar","useful":0,"cool":1},"0tvr2lKQ0yfaWA7hAc9zbg":{"text":"Not a half block off the toxic tourist trap that is Bourbon St. is where so many locals go","useful":1,"cool":1},"_JVqUK4qF1yO0vAro-biEg":{"text":"Great service. Clearly there are regulars, but the bartenders treated us foreigners like l","useful":0,"cool":0},"fdi97fXmhB9UyR3lKgFk5A":{"text":"Went there a got a Irish iced coffee. SOOOOOOO delicious. Definitely recommend going there","useful":0,"cool":0},"6VsZkLJrY_hqvB2C7JqtSA":{"text":"Just about the perfect place to bring your out-of-town guests.  Who can resist their froze","useful":10,"cool":7},"m2554z7GaB5pzFgKqB5cpA":{"text":"This has always been one of our favorite spots...but not tonight. One of the bartenders ma","useful":2,"cool":1},"FDDWx1yCn52cSDYgbUadAQ":{"text":"Just a great chill bar away from the madness of Bourbon Street with great prices on drinks","useful":0,"cool":0},"_vXchVgYiZkgkieNAHqliA":{"text":"10/10. I would fly back to New Orleans just for this Irish Coffee. Literally the best thin","useful":0,"cool":0},"8Fen1PeQL3DBrj0Q4jP-Pg":{"text":"A local recommended we head over here to give their frozen Irish Coffee a try. Best recomm","useful":1,"cool":1},"uzcQLP8PzsTaiuzMg01MBA":{"text":"The 4 of us stopped in on a Friday night to grab these Killer Poboys we've heard so much a","useful":0,"cool":0},"2r2hznsfmvmrnepgn7HCQg":{"text":"Out of this world Frozen Irish coffees. Awesomely fun atmosphere. Great service but extrem","useful":0,"cool":0},"2hzvuJTkRh3V3a3p8ONTnA":{"text":"Off the beaten path where the locals drink. A little hipsterish with PBR and Miller High L","useful":0,"cool":0},"FCKdiNLW9FO5W4YtBmyOog":{"text":"I absolutely love Erin Rose! I was so happy to be introduced to this spot during a recent ","useful":1,"cool":1},"pFER5WEmgHWoO4xAZpuxcw":{"text":"I got the famous classic Frozen Irish Coffee with a shot of Bailey's added and it did not ","useful":0,"cool":0},"Q79MMRilsgM0E5Zx9xK0cg":{"text":"Great place. If you don't want to dive into a full size Irish coffee, ask for a wee one.","useful":0,"cool":0},"XWyjq6DnQ2mIq5zpGbL56w":{"text":"THIS IS THE BEST BAR EVER!!!!!!!!! Amazing Po-Boys and talk to bartender Brooke\n She is am","useful":0,"cool":0},"FI2290vufU_aQ0EXDNDJsw":{"text":"Meh. A local told me I'd get the best poboy here. Wish I'd gone elsewhere. It was okay. Bu","useful":0,"cool":0},"ftlf3gy15OzjgrSLTwdJOA":{"text":"I love Irish pubs. They always make you feel at home. This one is quaint and small (and a ","useful":1,"cool":0},"xrcCEXvDFM3sf2N85IpHhw":{"text":"Definitely a favorite bar in the French Quarter. Kyro & I favor small, Irish & British pub","useful":0,"cool":0},"tH7D51JIMouSfup5Vp3zJg":{"text":"I came here with my coworker for lunch.  The food counter was way in the back in the small","useful":2,"cool":0},"S0-eRConp1KLClhQiq282g":{"text":"This was our first stop once we got to New Orleans. We stopped in for a quick bite to eat ","useful":0,"cool":0},"nhLD7g-1CHQb-O_x91j0XQ":{"text":"Erin Rose is a locals bar amidst a sea of tourist trap bars in the French Quarter. It's pr","useful":1,"cool":1},"9osYRrJFRdQjI2Nmx90xqw":{"text":"The frozen Irish coffee drink is delicious and the best I have ever had. The music is kick","useful":0,"cool":0},"UC9lDW9H4b2agpxW67pNUg":{"text":"Amazing irish coffee! I have had a few of these around the country but they are the best h","useful":0,"cool":1},"atMV_wCzEZmkbvYud6GkgQ":{"text":"They are one of 2 places that serve the Frozen Irish Coffee in New Orleans. GET ONE! \n\nThe","useful":0,"cool":0},"T5Hi3AJjQVIguoLgWGg_Gw":{"text":"The rumors are true. If you want one of the best frozen Irish coffees around town, you got","useful":11,"cool":5},"6A0MThLK3u28tHP0dXF76g":{"text":"Always excited to visit Erin Rose while visiting NOLA! It's a little bit of a dive bar and","useful":1,"cool":1},"AKV44t90UR7Q2YppGuSpBw":{"text":"How could you not love fall in love with a day drinking spot that has a legit happy hour f","useful":0,"cool":1},"rDGS4p6UDcmcn9y7xRwZvg":{"text":"This was our \"go-to\" bar while we were on our honeymoon in New Orleans. It is a dive, but ","useful":1,"cool":0},"HuquA9zijPBmcmLGDXf55Q":{"text":"This was one of the best places in Nola. Their frozen Irish coffee was to die for. We came","useful":0,"cool":0},"3eHqOJa8nj1cU8NjmSFI1g":{"text":"5 stars based simply on the Most Excellent Bloody Mary with Guinness which saved my brain ","useful":0,"cool":0},"S4N4iSqmoPPSdFUTP4qA2A":{"text":"A true NOLA gem dive bar.  So glad they have reopened.  service is friendly and safe.  Bes","useful":0,"cool":0},"dWZLT46P3xdpVd3bsvqu8Q":{"text":"Visited 2 years ago during the summer, and loved every second in there. Best decision ever","useful":0,"cool":0},"lPqWTX__urwK6jdQcok_mQ":{"text":"Erin Rose was recommended by a friend for me to stop in. \nI had the frozen Irish coffee an","useful":0,"cool":0},"EbDoXZoL8YbPTCWClrqtMQ":{"text":"Frozen Irish Coffee.\n\nThat's all that you need to know. This staple frozen drink is normal","useful":17,"cool":12},"l_jBjEEWcFIw-EbrDZU8OA":{"text":"Place is awesome, my kind of dive bar. Great poboy. Nice break from the Bourbon Street mes","useful":0,"cool":0},"3Vj-hLkutbvDw1unVQSMHA":{"text":"A NOLA must visit- even if you just bop in for a to-go drink.  Been here years ago and wen","useful":1,"cool":1},"Mu_xgPw4k5PDSTCN79FUFQ":{"text":"Went in just to get an Irish Coffee. Honestly the coffee was great, extremely tasty and re","useful":1,"cool":0},"_JHb6dTkzsCWW4C70H6mtg":{"text":"Stumbled in by accident, looking for Killer PoBoys, and this place ended up making a bette","useful":1,"cool":0},"dDEGD4G4vPbCzO-k-8u5fQ":{"text":"Loved this Irish Pub as a chill spot from the craziness of Bourbon Street.  Went here the ","useful":0,"cool":0},"kH4WlE0S03vjw23mGa-QUQ":{"text":"What a cool little Irish bar tucked away in the French Quarter. It's a small, cash only an","useful":0,"cool":1},"zic41x423UIOCkuLqK6zUQ":{"text":"Frozen Irish coffee ($11 for is very week - you might need to add two shots (or more) to t","useful":2,"cool":1},"iaphDfiUSdmq8NYuNxDlDg":{"text":"Kick Ass Frozen Irish Coffee!!  A great break from the heat.","useful":0,"cool":0},"giiosy6U-VTWJED4H9fyQg":{"text":"We've come to love this dive bar.  Skip the bathroom but hit the frozen Irish coffee and h","useful":0,"cool":0},"SRPtPyOWnvvvY4bIGWlZ7Q":{"text":"Fabulous old-fashioned dive bar-it's dark inside-but the bartenders here are bright and ma","useful":0,"cool":0},"DJS8ibpIpSlWp3RVEczD7w":{"text":"Yup. I loved this bar.  I had my very first NOLA drink here. Frozen Irish coffees are deli","useful":0,"cool":0},"czf4O5-bj67-6bWobvWpRg":{"text":"This place is really great. It's really cool to find a local dive bar in the heart of tour","useful":0,"cool":0},"LglXv7FEn22EFuyjEPLLGw":{"text":"If that's the best Irish dive bar in NOLA we may be screwed lol joking Monday night, one d","useful":7,"cool":2},"RQwDPgzaolGLJ0h3AGZa3g":{"text":"I've been a bit liberal with five stars lately, but this place struck a chord with me.  It","useful":4,"cool":3},"SRH8AUobkdWeuCrMSGqUjA":{"text":"One word \"Loved\" food and drinks were good. Atmosphere was fun. Will come back to eat and ","useful":0,"cool":0},"rGqg-_nAdK7ho1FmmP15Ow":{"text":"It can feel like there are literally a thousand and one bars in the area. We came to this ","useful":1,"cool":3},"O9W7fQUA1MnS6QM3eCW32Q":{"text":"Came back two more times after this experience (Irish coffees are that good). It was the s","useful":0,"cool":0},"sKxxl50e3IdMb6EWh9gurQ":{"text":"Frozen Irish coffee drink for just $6 was the best drink we had on bourbon and in new orle","useful":1,"cool":0},"9QfNazICzUkAV_Zf9sGc0g":{"text":"Erin Rose is one of the best dive bars in the quarter. Set your expectations accordingly t","useful":1,"cool":1},"Y1tx7XtjOGLdjKKOaXMCNQ":{"text":"I love, love, love this bar! My favorite in the whole city! The beer is always nice and co","useful":0,"cool":0},"PnhnS507rGC_Ht3G7j792w":{"text":"I'm including management response to my review below. I ll add a star but that's it. Very ","useful":11,"cool":10},"FFVI-M9W1dMdHZV1kcsevQ":{"text":"A strange crowd. The bartender was nice. The drinks were basic. The bathrooms were disgust","useful":1,"cool":0},"ULABta6ghLpQFugTSDinkw":{"text":"Already can't wait to come back here. The frozen Irish coffee...just do it, don't think tw","useful":1,"cool":1},"WqOk2Pk0Ar4hZISPKnaAZw":{"text":"Great dive bar. Bartender Brooke was great-friendly, animated and attentive. Cold beer and","useful":0,"cool":0},"XgoTS0IWYEfn8Bcgncw1og":{"text":"The bouncer grabbed me and touched me on the way in. I wasn't aware that there was a door ","useful":0,"cool":0},"ZiXJLEO1bZMt9tKAlgoGcA":{"text":"Three words. Frozen Irish Coffee... it might sound weird or like not your thing, but if yo","useful":0,"cool":0},"2uN2K5k2ckWOPR0BCjFfaw":{"text":"Must-get EVERY TIME I visit -- Pork Belly Po'boy. The meat is ever so succulent, and perfe","useful":0,"cool":0},"gcbOBGRew90uFT7PaRe4Pg":{"text":"Awesome dive bar here in New Orleans!!  We love the Irish coffee here!! Order it iced it's","useful":0,"cool":0},"uoZtZLS6LkPjFutQFe_9Vw":{"text":"Grab the pork bellies Po boy to share with hubby as we aren't that hungry, but we want to ","useful":0,"cool":0},"8tK5YzxRmLFylCCnhcY3Cg":{"text":"Great place to hang out.Bartenders are fun and attentive.Doorguys are cool.Crowd is mixed ","useful":0,"cool":0},"qtX5h9OJsvnMlUOgH2GxuQ":{"text":"Yelp, why are you so freaking good to me.\n\nI was balls-deep in my New Orleans trip and loo","useful":4,"cool":10},"rZ5EM9_o_i_sLemdB_tZUg":{"text":"This place is a solid little dive bar. I noticed the sign on the first night and wanted to","useful":0,"cool":0},"wakB9Q82Yw0FjXKCeMBJ8Q":{"text":"Frozen Irish coffee drink was good paired with a meatloaf poboy .  Great drink and sandwic","useful":0,"cool":0},"OOBVGrBLjWpHmX62LOaf9w":{"text":"Who are you people who are under the illusion this is a dive bar?  This is not a good or a","useful":2,"cool":2},"CmO4CEtMPnFyDhzT-DRGug":{"text":"Awex is vewy powite. He has weally nice hair. He makes gweat dwinks and is always vewy hap","useful":0,"cool":0},"_ReT-DoWmgerVXnp6OLocg":{"text":"Love this spot! Visited NOLA twice this year and a friend of mine took me to this spot dur","useful":2,"cool":1},"UzIbfQeg6hgcwAbdQGp7uA":{"text":"Every time I am in NOLA, I have to stop by Erin Rose for a frozen Irish coffee (I have the","useful":0,"cool":0},"cQoVRBy11bxMFEYKNCMa_Q":{"text":"little dive bar with super friendly bartenders. didn't get a chance to try the po boys. go","useful":1,"cool":1},"x8w2EEqjL-0F93FUnDfrng":{"text":"The Irish coffee was super good. This won't be a long review because getting the coffee wa","useful":1,"cool":0},"nB2j4qB8YqBdhJtScxGkCA":{"text":"I really liked this place. It's a neat little hole in the wall off of Bourbon St. and a ni","useful":5,"cool":1},"1gkvvd-0xMBsmwdx_d1Yyw":{"text":"Erin Rose is always my first and last stop when I come to Nola. Always great bartenders, a","useful":0,"cool":0},"ejKi6eBLNX1Y10eXHXxwSA":{"text":"Frozen irish coffee with an extra shot. What more could you want in life? \n\nI normally hat","useful":10,"cool":8},"Ww9zUIpsL1smUKw50lQ01Q":{"text":"The place in the back has some of the best Po Boys in New Orleans. Definitely the best on ","useful":0,"cool":0},"8iJJxrP_IDf2o3m2Qxq45w":{"text":"Both times I've been in nola, I've come back to this place primarily for the food in the b","useful":0,"cool":0},"gYICjEqI-GbDI5GTQTzpAw":{"text":"Stopped into Erin Rose twice during a long weekend in NOLA. Great dive bar. Features your ","useful":0,"cool":0},"CIMYa2u_5RsA-rS_9q6hLw":{"text":"I'd give 10 stars if I could.  Service here is always fast and friendly, but the frozen Ir","useful":3,"cool":2},"1-kzT5vPnViSw2LPjbLQmA":{"text":"A great local-ish dive bar right off Bourbon St. Great people and bartenders. I have visit","useful":0,"cool":0},"-kOExVNgE5KVWI_b-f9W8Q":{"text":"Went in for the frozen Irish coffee. Was good. Admittedly I am not a huge Irish coffee fan","useful":0,"cool":0},"5ilqkqYLhqh3lchgFm3BRA":{"text":"Only went for Irish coffee. It was great. Do yourself a favor make this either your first ","useful":0,"cool":0},"-Wf1tP-3XWXtYv1MfzkafQ":{"text":"Frozen Irish Coffee in the swampy Summer, and then soothing Hot Toddies in the Winter. \n\nI","useful":0,"cool":0},"ToramWpvuI1ObrjR8ew5vA":{"text":"Great bar! My husband and I stumbled upon it on our first day in NOLA. We liked it so much","useful":0,"cool":0},"eECfwzHg8c31cG0RIx7QSQ":{"text":"It's all about the frozen Irish coffee for me whenever I swing by Erin Rose.  It's a great","useful":6,"cool":8},"c6feOGKDgj0Jn1tuyRKzYA":{"text":"The Erin Rose is a small shotgun dive with good bartenders and cool patrons.  I really lik","useful":1,"cool":1},"iAPxiAbh2aI5OIuzfvTBrg":{"text":"Irish bar. Super friendly bartender. It was also a stop on our Bike Drinking tour and we h","useful":1,"cool":2},"gHTK1KRbVWTN2r-kxND3gw":{"text":"Pork belly po boyyyyyyy. So delicious! Never had anything like it before. Drinks were good","useful":0,"cool":0},"9sBI9ep4gPXJAcXqD_2Bog":{"text":"I truly enjoyed my night at Erin Rose. I did not try the frozen Irish coffee, so I can't v","useful":1,"cool":1},"O8fcgrnk9ol8EnUrfeCCqg":{"text":"I had my first Irish coffee here. Those drinks were absolutely delicious OMG. And they cre","useful":1,"cool":1},"WIa--k6kxDDeOiAiWUPOiQ":{"text":"I didn't actually get to go inside because we still had a gigantic drink in hand from anot","useful":1,"cool":1},"F8iIXFznO_rTyqmY3mvfAA":{"text":"I have to admit, their Frozen Irish Coffee was pretty awesome. I came the day after Mardi ","useful":0,"cool":1},"8IHocx83W-AQhuaPq9asuQ":{"text":"I've been a fan of this place before I even knew Yelp existed.... it's small, cramped and ","useful":8,"cool":8},"zwDqp_yQ0csZeKU67KnnwQ":{"text":"Their Irish Coffee is one of my favorite things I tried in New Orleans, and its super chea","useful":0,"cool":0},"91ZMNUarOgbC5uTPAAx3Gw":{"text":"Sorry Erin Rose, there is no higher rating past the five stars. I am glad I don't live in ","useful":11,"cool":4},"n-gxpi02FHcgN-ctO0txew":{"text":"Loved this place!! Read on Yelp was a must try frequented by locals and I agree!  Small ba","useful":2,"cool":1},"Y1VruLrIBYCaWeOseWkvow":{"text":"This is a little dive bar. The drinks are strong. The bartender are nice and Killer Poboys","useful":0,"cool":0},"L_bi0WeXO-Ov3Cg-kSE-dw":{"text":"What a hidden gem around Bourbon.  Super energetic atmosphere during St. Patrick's day. Th","useful":0,"cool":0},"PC3olIGDvJ55kGCPvzbt5g":{"text":"One of the best bars in the city. Such a great dive bar. A lot of personality from the sta","useful":1,"cool":0},"oA5J7FO7dLTBVnle6y01_A":{"text":"Erin Rose is a great dive bar in the French Quarter! If you need a pick-me-up before a nig","useful":1,"cool":0},"pwEDl5qru1aJxkhX-eWQzA":{"text":"This place was definitely a dive but was far from a tourist trap which is a great. Don't l","useful":0,"cool":0},"Rip9qCiC5OPM2ic5SbdWfA":{"text":"Stop by for a frozen Irish Cream.\n\nTypical Bar environment. I did not sit or stay. The bar","useful":0,"cool":1},"1WroxWqn6QZW1vX7vi8Jzg":{"text":"This will be a place I visit every single time I am in New Orleans now.\nWhat a cool little","useful":0,"cool":0},"2afVwPMvgeb58yWYCrgPQg":{"text":"PO BOY, PO BOY, POY BOY! While knocking back a few of the local beers, go to the back and ","useful":4,"cool":4},"9v-Pi7S7DhY20VuUDNPNrQ":{"text":"Nice little side bar on a side street. \n\nSeemed like a local crowd and tourist . \n\nThe bar","useful":1,"cool":0},"zQ34u3wMigds60_0AAuiPA":{"text":"This place is friggin awesome. Stop in have a drink and snag an amazing poboy while your a","useful":0,"cool":0},"uCB2e7uHjCF5gihOGDLWbg":{"text":"Our club spent several hours and a lot of money at this bar on a Tuesday morning/afternoon","useful":1,"cool":0},"9YlCYHClInRfl6jOIwgkug":{"text":"A dive bar that has very friendly bartenders. It has the best Frozen Irish Coffee in NOLA ","useful":0,"cool":0},"Yrra3UN4ip0XisM6pzgptQ":{"text":"Love this place! I came here both times I've visited NOLA. The Po'Boys in the back are so ","useful":3,"cool":3},"cRfY7RALWXRSfRLD2YSSKw":{"text":"Excellent mid day happy hour, bloody marys, mimosas, frozen irish coffees, screwdrivers, a","useful":1,"cool":0},"IImr9-sG9hLpLP3RABGROQ":{"text":"Divey little bar with the BEST frozen Irish coffees. I am not a huge alcohol fan but this ","useful":1,"cool":0},"i_wEkbIk0g1fdpKoQeaJsw":{"text":"Affordable drinks? \nHello $3 mimosas and $4 Bloody Mary's! \n\nErin Rose is the quintessenti","useful":7,"cool":11},"yBtsmAgiP9egMntb50QoZg":{"text":"The people have spoken. This is THE dive bar in the French Quarter. Really recommend the i","useful":0,"cool":0},"2kFD6LqrkgS6NlqsTFqRYA":{"text":"Divey bar that has THE BEST frozen irish coffee. \nOnly set me back $3 during happy hour. W","useful":1,"cool":0},"x2BRXgtje3fiK9MPhCF73w":{"text":"Always a good time. Friendly service. The frozen Irish coffee is a staple, but don't sleep","useful":0,"cool":1},"cyl0fH5GwXbPvK_WKfUhOA":{"text":"I only enjoyed water as I was trying pace between bars, but my friends loved their cocktai","useful":0,"cool":0},"gZPdHMQUxsHa-yszmgjtPg":{"text":"Convenient dive bar with back room kitchen service good food.","useful":0,"cool":0},"o-fuvCFNVkpY0sUVckDNhQ":{"text":"We came here to try the frozen Irish drink upon the recommendation of Yelp reviews, as wel","useful":0,"cool":0},"6arty_EWWflFH5n1CDSC1A":{"text":"My favorite NOLA spot, from the frozen Irish coffee to the powerhouse bartenders. Always a","useful":0,"cool":1},"joQp15fk-k8dKl5KtmgAzA":{"text":"wam bam thank you mam!!!!\n\nbadass cool kicking it bar!!! \n\nbrook with an e on the end!\n\nsh","useful":0,"cool":0},"Gx8T6_xTWsPu_kVVEDTsSg":{"text":"Horrible experience with the apoplectic bartender with lecherous old men looking to capita","useful":0,"cool":0},"8n99ziupdGETzF3HM-jkMw":{"text":"By far the best bar in New Orleans.  You can't beat $5 Guinness on draft and the best Bloo","useful":0,"cool":1},"rhWCYNRZDTWKLcenpRmcJw":{"text":"Frozen Irish coffee ... Probably the greatest beverage I've ever had. You MUST try it.","useful":0,"cool":0},"VKi5kvZ4pES5DpWvarZH-A":{"text":"Great atmosphere and amazing Irish Coffees! Being from San Francisco, I loved seeing all t","useful":0,"cool":0},"8KVLOgVJq-5bolfLekVEUg":{"text":"Came in our first night in NOLA. It was ok the crowded side but still comfortable and we w","useful":0,"cool":0},"vNfiPqOqp1Uq0OTJlD4OHw":{"text":"UPDATE:\n\nIncrease to five stars.\n\nWent there a few more times. All that I liked about the ","useful":0,"cool":0},"isCSb4C2H07gvpyZvUjp9w":{"text":"I have never had such appalling service from a bar tender.... two bartenders in fact. \n\nCo","useful":6,"cool":2},"_DDyFk5-_S1ttkeUR1BBQQ":{"text":"Stopped. By because my SIL is Irish and wanted to stop here again. \n\nHe had been here with","useful":1,"cool":0},"AWu9vCtiCJ3iC6cZfmkv2w":{"text":"A chef friend recommend Erin Rose and I'm glad we took his recommendation. We had a good t","useful":2,"cool":1},"4rsTmB9TwOD4SLwYcrTNfw":{"text":"Frozen Irish Coffee. Yes. Just order it. Get the extra shot of Jameson. Just do it. You're","useful":0,"cool":0},"Fe4dl02cryFMJXFbrNqA8g":{"text":"My boyfriend and I had just arrived in New Orleans and it was late and looked on yelp beca","useful":1,"cool":0},"FV8ckkZZ6CloGhJx1fR1sg":{"text":"Amazing bar! Great staff, crowd, drinks, music and happy hour. One of my favorite spots in","useful":0,"cool":0},"P8naArKRem90aZItYUcXpQ":{"text":"BEST IRISH COFFEE EVER!!  Get the large frozen, you won't regret it.  It's 36 degrees out ","useful":1,"cool":0},"JpV9Od-RCOlmZElsZIhx-g":{"text":"Out of all the places from my New Orleans trip I took back in January, Erin Rose is the pl","useful":2,"cool":1},"rB-MumOZmA1pXBvBnPEWLQ":{"text":"Pretty good place to hangout and chill, however the bathroom was disgusting. There is food","useful":2,"cool":0},"TcvaE505w2iC8toU33SaTg":{"text":"We went to Erin Rose on the recommendation of a bartender friend of ours. The place did no","useful":0,"cool":0},"gwVlj1ihY1InYg-Hxealkg":{"text":"This hole in the wall had the best po' boy! We had the shrimp and carrots po' boy with a b","useful":1,"cool":1},"iXg1rFweaV15WbSeRHVnGg":{"text":"Great and friendly service, the drinks are SOOO cheap and worth it. A very nice and casual","useful":0,"cool":0},"z-EXVXlocRmapIYc-X2HHQ":{"text":"Like many others have said before me, Erin Rose is a great place to seek refuge if Bourbon","useful":7,"cool":5},"6XLitVQCV4pSL1taWsSMmw":{"text":"Typical dive that you'd find off of Bourbon but the key difference for me was the crowd: a","useful":0,"cool":0},"OpG9TIN-XhYjieN8vRx8yQ":{"text":"Erin Rose is your typical bar scene. Lively, loud, friendly. It is a rather narrow space, ","useful":1,"cool":0},"inS7TopYpL-2bhyJxyB-4w":{"text":"This is a long and narrow dank dive bar hidden right off Bourbon Street.  There is general","useful":2,"cool":1},"1JL4vX8-FA7dPfqZ-cdpcw":{"text":"Rico think best bar in world.  Maybe go there 84 nights and see sun when I leave.  Many ti","useful":3,"cool":4},"OMTsGlAiOskG8QQdOxep-w":{"text":"During Covid (as of 12/22) this bar is serving to-go drinks! I had the frozen Irish coffee","useful":1,"cool":0},"BF6Qpl9Kj-OQcAOYHf6Oag":{"text":"If I lived in New Orleans, this would be my local!\n\nOn a tip from our bartender at Irvin M","useful":2,"cool":1},"ivWhT7CcoU-1xm-PZwXK2A":{"text":"This is always my first stop in the quarter. Cold beer and awesome po boy sandwich. Always","useful":1,"cool":1},"LPwM9ZoEKJ2HfqncTZu5FQ":{"text":"Erin Rose is legendary and for good reason. Their bar tending service is unmatched - solid","useful":0,"cool":0},"kSn9zmrgbAekiVmV5RsXYQ":{"text":"Great place! A local people place! Love the atmosphere & bartenders! Highly recommended fo","useful":0,"cool":0},"2y_Lhykd5MGtU-ydP2Pvpw":{"text":"Must have the frozen Irish coffee!!!   Best drink I found in New Orleans!","useful":0,"cool":0},"wu2jKBUM_Ta1xfATskRwzg":{"text":"We came inside here looking for Killer PoBoys. We ended up drinking a bit here before gett","useful":8,"cool":4},"C1YBt2sRM92FuK5yv2sSiQ":{"text":"Erin Rose is such a great bar in the French Quarter.   Just out of the way enough to be a ","useful":0,"cool":0},"UIfVe4ywW3aeOVABuF18sA":{"text":"Near the tourist bars, but not a tourist bar. It's a decent, small, Irish, dive bar with G","useful":4,"cool":1},"qShdigaH8CYcEyDeDoNlrA":{"text":"Awesome dive bar. Bartenders are all excellent recommend to everyone who visits NOLA.","useful":0,"cool":0},"pymgqH1guTgALD30c2l6Kg":{"text":"This is a nice getaway from the flashy flashy business in the French Quarter. Came here be","useful":2,"cool":1},"483z72aDIyr5vcNuSEzEHQ":{"text":"Erin Rose is a hole-in-the-wall rockabilly-Irish bar with super-cheap drinks, and low key ","useful":3,"cool":3},"q-t6LFzVxxzMB5pFdYQhSw":{"text":"Still one of my favorite bars in the city and my favorite by far in the quarter. The bounc","useful":1,"cool":0},"JLvdsH-h3X34tZEveN4unA":{"text":"I love this bar.  It's the ultimate local hangout in the French Quarter, mixed with the oc","useful":5,"cool":5},"TBgoIzUBOeK3haFpoxX0xA":{"text":"one of my favorite things during our new orleans trip was this little frozen irish coffee ","useful":7,"cool":7},"RVP2w2wXq_ykSDxKoEkzAw":{"text":"Erin Rose, \nYou've become my clock out cocktail spot. And by cocktail, I mean a large froz","useful":13,"cool":11},"rEJmoiebnxBMQRcfUKVh-w":{"text":"The frozen Irish coffee is why you come here. In my opinion, there is no better way to sta","useful":0,"cool":0},"d_-b3BfFtIQ1zCVYqqyIrg":{"text":"Do yourself a favor and go have the frozen Irish coffee. If you are in the quarter, stop b","useful":0,"cool":0},"jNrjLSbBthccKa_JUvM0AA":{"text":"My favorite spot in the quarter!\n\nI'm hesitant to write a review, as I like that it is nev","useful":2,"cool":1},"PH86LpkSc1dwIa5b8st8rA":{"text":"Frozen Irish coffee - blended coffee with liquor and chocolate shavings - this is the best","useful":1,"cool":0},"hKrSH2TuUi19snJgnN2vgA":{"text":"A must stop! For a dive bar it's well kept and the staff was super nice. I have no words f","useful":0,"cool":0},"QbtdelmzKWo3qzbvXH1IyQ":{"text":"Best frozen Irish cream coffee ..... get it every time you pass by... its just not to weak","useful":0,"cool":0},"mxawk-J763kjVufVwsW2oA":{"text":"A bar frequented by tourists and locals alike.  It has a dive feel but in a good way.  It ","useful":1,"cool":1},"lxwDbl98eLenD9PCgKRByA":{"text":"Came here with a large group of girls for a bachelorette party as our first stop. The plac","useful":0,"cool":0},"6MhEeMeF4FT5ak_SuMataA":{"text":"OMG!!! The frozen Irish coffee is to die for! Be careful drinking these babies as you can ","useful":2,"cool":1},"l0QxCRPD2WxLkSkj9KcpMg":{"text":"This place is amazing exactly the vibe you want low key but still in the middle of everyth","useful":1,"cool":2},"AgQY3rOWB_gmtMmH8JbzQg":{"text":"Best drink on Bourbon Street in my opinion!!... hands down the Frozen Irish coffee it stra","useful":1,"cool":1},"zy3y6slZIyD9FKwd5yRe6g":{"text":"Great atmosphere, Po Boys in the back, awesome drinks, Randy the great at the bar, AND Ray","useful":2,"cool":1},"ID7x9ubZiWOMgu6562EwcA":{"text":"Small little bar...very small!  LOL  But, lively and the Frozen Irish Coffee is a MUST whe","useful":0,"cool":0},"ME5irdykH_j9wUUrSv7vYQ":{"text":"If the reviews and pictures don't tell it all, I have 3 words for that a$$: Frozen Irish C","useful":0,"cool":1},"7uOo6J7pTqVxRu3S1edf-w":{"text":"Just order the frozen irish coffee here.  Do not pass Go! Do not collect 200 dollars!  Get","useful":0,"cool":0},"Iv5dNviqeFGL22YxRXNgaw":{"text":"Found this joint while on day 2 of 4 day vacation, ended uo back day 3 and 4.  Great price","useful":0,"cool":0},"64vDy1J_wiPAk4xWXBjNUg":{"text":"Great little place! Really enjoyed the atmosphere of this place. We stopped in for a quick","useful":0,"cool":0},"qZ8tpDmp-ueStnzkmR7stw":{"text":"This is what I call a dive bar with a twist!\nGo to the back and order some Po Boys then or","useful":2,"cool":0},"dlOU0Ukj5Pf9cmemgtEquA":{"text":"I went there the other night on Wednesday specifically for food their delicious shrimp po ","useful":2,"cool":0},"e1a2wGsY2ohO2vFw6W7Wxg":{"text":"Best frozen Irish coffee it does have cold beer and a so-so bartenders.  This places is AL","useful":0,"cool":0},"HzI119iSygEJjNZgUoT14A":{"text":"What can I say? It's all good. I just drank 9 frozen Irish coffees. The last one was as go","useful":5,"cool":4},"BZJFdeUeLL-LqG-lYmUGFg":{"text":"The only place on Bourbon i'd go to drink...probably because it's not really on Bourbon ;)","useful":0,"cool":0},"hdvekhnOShAHJuoK7qvORQ":{"text":"Don't know what it is but every time we come here it's when its really cold outside and gu","useful":1,"cool":1},"6r2ICQnMd2vBFjpnKdsXbw":{"text":"One of my favorite places in Austin for Frozen Irish coffee shares its recipe with Erin Ro","useful":0,"cool":0},"ccyZ-eWOf87U0MzBSQ87dw":{"text":"I enjoyed the vibe and the cool decor. In the back room, there is another bar and a spot t","useful":0,"cool":0},"bmZ5L1HBOVt9VEcPzzIJjQ":{"text":"Love Erin Rose local watering hole known for there frozen Irish coffees and strong drinks ","useful":0,"cool":0},"uCQUNXVTT8kFE_Q0Deq74g":{"text":"Great dive bar away from the pace of Bourbon Street. Loved the atmosphere. Heavy metal on ","useful":1,"cool":1},"C0Uiq5addrKf2z6f7cJLcA":{"text":"Went on a 4 day bender for my 50th birthday with friends in NOLA. This became a daily stop","useful":0,"cool":0},"bYsbt1cYEwJ6HODzmQI72g":{"text":"Rated Best Neighborhood Bar in the French Quarter years running. Small, social, a nice bre","useful":1,"cool":1},"R9W1askjrj17rDEwTESOzg":{"text":"Alright guys, glazed pork belly poboy with\n*Louisiana rum\n*ginger cane syrup \n*lime slaw &","useful":0,"cool":0},"KoUmYSOxNqBKNUc_cRL33w":{"text":"Came in for a quick frozen Irish Coffee.  The drink came out fast and was really tasty. I ","useful":0,"cool":0},"QZLWypDfSuEXSkCwJz3utA":{"text":"I was fortunate enough to visit NOLA for my first time with my GF who, despite having only","useful":2,"cool":1},"yrti5fFApN3gTmuhVtZxdQ":{"text":"We wanted to try this place so we walked in to a full bar. The bartender (Monday evening) ","useful":0,"cool":0},"h5rc8ywWoxPTKB22szScZQ":{"text":"I love how old New Orleans is. In a country that's a baby (relative to so many other first","useful":9,"cool":5},"tgbnBRHusI70hmltZuX3jA":{"text":"Cool decor. More locals than tourists. Good service. Food in the back. A nice escape from ","useful":0,"cool":0},"eItLxx4x6HnNTk_osLHRvQ":{"text":"If you're looking for a cool but subtle respite from the bustle of bourbon street, Erin Ro","useful":1,"cool":1},"WXGk0tq2wXnCIRz-vG1Mvg":{"text":"This is a fun little dive bar. I appreciate that it's not right on Bourbon street, so it d","useful":12,"cool":13},"C84VPKiLT80wcmCdGoO2-Q":{"text":"So Erin Rose is a sort of nondescript bar off Bourbon St like any other but the lovely lad","useful":3,"cool":0},"ovDJQo67BNBSbmNDmGUdYA":{"text":"\"Bartenders with bad attitudes and poor customer service.\"\nI was a frequent local visitor ","useful":0,"cool":0},"DB9uHShDasr5kXq3x9WV3g":{"text":"Small, cozy, pretty intimate bar. The Irish coffee is probably one of the most delicious t","useful":0,"cool":0},"To1jjvwZ02Uvz-QeScDe_Q":{"text":"Let's just say we came twice during our three day stay in NOLA! They have a cool Portland ","useful":1,"cool":1},"FOFfuUpe3R4mBo5-l3Ju2w":{"text":"Bartender was prompt and friendly wish I had more time in NOLA would love to stop back in ","useful":0,"cool":0},"TgOUp0nrVtpK53MxggRkHg":{"text":"Hands down the best bar in NOLA. Their Irish coffee is so addicting. We went here everyday","useful":1,"cool":1},"W12OqoNGlmB6Wwf3sQ5-Bw":{"text":"I must admit that I'm not much of a quarter rat these days, but Erin Rose is a solid, neig","useful":5,"cool":6},"VHnW2XcPn-7eVW78jSUaYQ":{"text":"Stopped by on the recommendation of a friend. Brooke, our bartender was attentive and frie","useful":0,"cool":0},"kF4BCKPQxrHdHcGF6irxVg":{"text":"This is the perfect local/tourist place. I can't  even begin to to tell you how much I mis","useful":47,"cool":50},"tZ5Mi6IblKsXDlJhDLfQ1A":{"text":"Went here for a frozen Irish coffee cocktail. Bartender was beyond amazing. Really enjoyed","useful":0,"cool":1},"Io4unOqcHmfbpRRy7u0ihA":{"text":"Erin Rose is amazing!! Genesis is the best bartendress!! Best atmosphere and the banana cr","useful":0,"cool":0},"z_hxy0hjRCb9mnZ9KpiVYg":{"text":"We loved this dive bar. Must stop by and see it for yourselves. Frozen Irish coffees are f","useful":0,"cool":0},"PlZDtdBY652axnpOjzbljQ":{"text":"Great Bloody Mary and frozen Irish coffeebartender appeared inebriated ‍food was delicious","useful":0,"cool":0},"Hs6nN8crvDVLWQM-Ja2Mog":{"text":"The frozen Irish coffee is better than any milkshake I've ever had! Despite being crowded,","useful":1,"cool":1},"wRudoJPhzGAOhWU1jwvj7A":{"text":"Great dive bar near the quarter. The frozen coffee drink is a must get! Bar tenders and su","useful":0,"cool":0},"rpEsVS8V533-dwAkdIJYkg":{"text":"One of the only places with frozen irish coffee which is absolutely great for the weather ","useful":0,"cool":0},"ito0rKmD0DJttOohtDycsQ":{"text":"THE BEST POBOY I HAVE EVER HAD. I am serious. Came here on a high recommendation and I can","useful":1,"cool":0},"iphiYWWmD8z8S_D9kYEnQw":{"text":"Best bar in the Quarter. Their frozen Irish coffee is killer, make sure you get a shot of ","useful":0,"cool":0},"CxR1A3KNEMEtFB3mfmr8sw":{"text":"Everyone in this establishment was really friendly. Drinks were strong and affordable. The","useful":1,"cool":1},"bZs98gYSNwqrcj402hhB1w":{"text":"5 star bar with 1 star bathroom, but doesn't detract from the good time. If they ask you i","useful":1,"cool":0},"-qiqLnwHoT-pExuRDINYFw":{"text":"I truly understand why this is the place for killer poboys. I ordered two because I could ","useful":0,"cool":1},"tvZcbQ339LMjf_c9uwTpqQ":{"text":"Simply amazing! Came here specifically for these frozen Irish coffees. Had them 3 years ag","useful":1,"cool":0},"5DDKEOZgArkXxgCg2pPkBw":{"text":"How the hell did I get this place confused with Molly's and almost miss out on their take ","useful":1,"cool":0},"1g-lBjCWgQqyVJOXEw-yxQ":{"text":"This place is a must !! It's a little hidden gem off of bourbon ... the frozen Irish coffe","useful":8,"cool":8},"ukjsvHt9oj8xahntbKJGvQ":{"text":"When in New Orleans, go to Erin Rose to get a frozen Irish coffee. It doesn't matter the t","useful":23,"cool":16},"P-x5l4TO3Ttm2TTvS7u5JA":{"text":"Fun bartenders, big personalities and of course gotta grab some frozen Irish coffees - pro","useful":1,"cool":0},"k9O0rcL166lMUYTMk9L5Ag":{"text":"TOTAL DIVE!!!  \n\nI wasn't myself on this trip as I would have never stepped foot in an est","useful":4,"cool":4},"ehOICsV-jahuJkKuq3JU7Q":{"text":"Racist af door man lame af racist garbage staff worthless plus eNtetsbce smells like urine","useful":0,"cool":0},"KJqrxf6mm-mtHG-y49ykLA":{"text":"Great staff. Keeping a positive attitude even though they barely have 4 pub tables availab","useful":3,"cool":1},"5MgBGNguds-3Ai1Y7Raj5Q":{"text":"This place has become a staple to bring guests visiting from out of town.  Divvy Irish Pub","useful":1,"cool":1},"4b0By31RE6CXblgv5Wbaiw":{"text":"When in NOLA this is a must go to spot.  It's a very small and confines business but it's ","useful":1,"cool":1},"4N6UoVijXI3P7ggXQToCIg":{"text":"Erin Rose is our default bar when visiting New Orkeans. \n\nI just tried to enter the bar wi","useful":1,"cool":0},"zM2B51xLQk6uIQNyA0eYZQ":{"text":"A cool dive bar near bourbon. We went during the day so it wasn't too crowded which was go","useful":2,"cool":2},"hnpz-N9p6Jfnl2g76VsLgQ":{"text":"Their frozen irish cream does not disappoint! The texture was similar to that of an Oreo s","useful":2,"cool":0},"keKjHmK8QzxdpOFC9SfZ3Q":{"text":"Years of coming here! Always an excellent local experience. Friendly fun and happy times h","useful":2,"cool":2},"K94rZom9i0SkyelaainNBw":{"text":"Three words: Frozen Irish Coffee. Pretty much my favorite frozen drink of all time. There'","useful":1,"cool":0},"2TidRM4ppMWGNY9-zhUN_w":{"text":"Here is the hidden gem in the French quarter. We find ourselves continually coming back he","useful":18,"cool":15},"1CafXtYaB7vX3vKY-c7xmQ":{"text":"The Erin Rose is easily one of the best bars in the French Quarter.  On the Rampart side o","useful":1,"cool":1},"Lg7ZW0J-qTJf1WY-jWLQ-A":{"text":"I love NOLA, but I'm not really a Bourbon Street kinda guy; nor am I a fan of dive bars or","useful":12,"cool":10},"as2SKxLNdX_T309ALZDLpw":{"text":"Great space, superb bartender and amazing frozen coffee. Will be back on my next trip to N","useful":0,"cool":0},"wJJp9U7a-JC1qcQ-LsdGTQ":{"text":"**ONE OF MY FAVORITE BARS IN NEW ORLEANS**\n\nWell, so I looked a bit too fancy in my dress,","useful":20,"cool":20},"WoAT_b2bXdDDUwVkFhwhAw":{"text":"This is one of my favorite bars in New Orleans. It's no frills and super divey! What's the","useful":4,"cool":3},"juA0op-9k9f66jAVq_u85A":{"text":"It's a dive.  They have some great frozen Irish Coffee.  Bartender is friendly.  Bathrooms","useful":0,"cool":0},"Qg4uDrKsW7qAwB443Qa8nQ":{"text":"Simply put there's no better Irish coffee in the French quarter, or honestly anywhere for ","useful":0,"cool":0},"pKLyM7iU5BrtV0e6oQgaIQ":{"text":"Lots of people come here exclusively for the blended Irish coffee. You should probably con","useful":13,"cool":7},"VWm-5N8_-DwmAx1Uo9g-xA":{"text":"This dive bar was already pretty busy on a Sunday afternoon. We had the  Frozen Irish Coff","useful":2,"cool":4},"g0kUHlZS9LQqFh9xZQ0Geg":{"text":"The best poboy we've had during our trip to NOLA! \n\nThe shrimp poboy is more like a banh m","useful":0,"cool":0},"jyxGEstwHq6zdozibEnhWg":{"text":"Erin Rose saves my life every time! After lots of drinking in the quarter, take refuge in ","useful":1,"cool":0}}