{"aEREOkTO8Tcp6xZJNJP4Ag":{"text":"Never disappointed. The food here is amazing. It does not matter if you are looking for sw","useful":0,"cool":0},"qU_65ctw6bFIgYuXZtlhiQ":{"text":"This spot is great and I'm so happy it is in my neighborhood. Reminds me of Brooklyn with ","useful":0,"cool":0},"NlIXkxs49Go-yQtRKm8QaA":{"text":"The waitress was great but my friends and I found the food a little bit plain. \n\nMy salmon","useful":0,"cool":0},"MB69fYHOmCl2YxJCyhLoFA":{"text":"What's best to start your day? A good breakfast of course and we had it at Ruby Slipper!\n\n","useful":0,"cool":0},"WiL_3bpSeurBNHAs9DlhQw":{"text":"The stars say it all, \"Eek! Methinks not.\" I'd rather go wait in a line for 15 min at Came","useful":6,"cool":0},"jgah5COPPZDYVT28FNysXA":{"text":"On our way out of NOLA we stopped specifically for their bananas foster french toast and i","useful":0,"cool":0},"YOnrQ-Zclk01Oxnpmeu-Yg":{"text":"This is one of my favorite breakfast/brunch spots during the week. Service and food always","useful":1,"cool":1},"YS3Ohm8MLxk62P_kGjn-TQ":{"text":"Ruby Slipper used to be the GREATEST breakfast place in NOLA.  Unfortunately, the last thr","useful":0,"cool":0},"SswN5T-AboLx1oA0BxVPgA":{"text":"My wife and I had a great breakfast and exceptional customer service by the servers.  The ","useful":1,"cool":0},"NTH-9DCV3AsuEGNwV-eL3A":{"text":"This place is still rockin'. I have been here at least half a dozen times since my initial","useful":4,"cool":2},"w2k4oJD5TIaclZlBCZYTdg":{"text":"Cute restaurant with a cozy atmosphere (and by cozy I mean waitresses bumping your chair a","useful":0,"cool":0},"L_7MvXvKiM4FuOB7-NuWPA":{"text":"The food was absolutely amazing. I had the fried green tomatoes sandwich, and my friend ha","useful":0,"cool":0},"i4gHrX4JqpWzHInH4GaVXw":{"text":"I've heard so much about the Ruby Slipper and how great it is. I am a sucker for brunch an","useful":1,"cool":0},"aXHEeoOQqIIULqLHr7Tgcw":{"text":"There is no better breakfast in town. They have amazing monthly specials but it is difficu","useful":0,"cool":0},"a6nxBIIbLIWK9l37ysUgtg":{"text":"I just love this place! The breakfast is always plated  nicely and it looks very delicious","useful":0,"cool":0},"AW6vipKEdYeEJV6ah_84DA":{"text":"Delicious!  My husband and I dropped by here on the morning of the Endymion parade (the Sa","useful":0,"cool":0},"xwydhy57qhCcHIwd6arAcA":{"text":"This is a great place. I have an allergy to mammal so I really appreciate their vegan and ","useful":1,"cool":0},"GMbiYHT12ZFk3HeAnD2KAA":{"text":"As long as people are foolish enough to wait 30 min-1 hour for this mediocre food and serv","useful":0,"cool":1},"xRlmaKXHneKRNZhhE2qnaQ":{"text":"The Ruby Slipper Cafe is a new (Spring 2008) Mid-City breakfast and brunch spot that is tr","useful":0,"cool":1},"Xk3lGWA4szP0DRmfPjiDIw":{"text":"We had brunch here this morning and the food was awesome! I got the basic breakfast with s","useful":0,"cool":0},"_XWZqB52erDYBznPqElppg":{"text":"I try to rectify poor experiences with the restaurant before I write a bad review. Unfortu","useful":0,"cool":0},"PROX_kCjGE2va2SXzBnPtg":{"text":"This is a very popular chain for breakfast/brunch and it was easy to see why. The service ","useful":0,"cool":0},"7gIHfg5alltoHWWKMZjJHQ":{"text":"When my wife and I moved to this city 7 years ago to Bayou St. John, the first place we ha","useful":0,"cool":0},"DcYNNMK1PaHGSQiMItdEtg":{"text":"Mimosa was bland, I wound up not finishing it. \nSalmon eggs Benedict were ok, looked a bit","useful":0,"cool":0},"hqe7FKM1APNMoWHzu5nDQg":{"text":"I went with a large group of friends and we were all very pleased with the meals, service,","useful":0,"cool":0},"xnVdWZ0j5DYtNSnaZXKU0w":{"text":"Great menu! Everyone in our party was very pleased with their meals. We also ordered the m","useful":0,"cool":0},"7FpauZkq9vpgRJVo-XQisw":{"text":"This is probably my favorite brunch spot in New Orleans. I have gotten the migas before an","useful":0,"cool":0},"tli5qu5xH2jkZl2tWJV8cQ":{"text":"This place is great! Delicious food and friendly staff. I tried a couple of different sign","useful":0,"cool":0},"MyNi-dZkmQJvIXlIEBNHvg":{"text":"We visited this restaurant in New Orleans on Canal Street. The food was outstanding. Wow. ","useful":0,"cool":0},"U810-Nz33tcxgewy4FSfWA":{"text":"Yummy good sized portions! As a local New Orleanian, the authentic flavor Is the truth!","useful":0,"cool":0},"G0CH-2pRcrt3AHzOwBmeIA":{"text":"Loved it!\n\nI went by myself and everyone seemed to be thrown off by that - LOL. But they w","useful":3,"cool":1},"1blubQ0vSsBFz4-siRxKQg":{"text":"Cochon eggs benny!!!\n\nGot the trio and it was the best! \n\nGood service \nBloody Mary's had ","useful":1,"cool":1},"tY_UME2IojNCqkxKciRbJg":{"text":"Banana foster French toast was ok. Not the best I ever had. The catfish and grits special ","useful":0,"cool":0},"EpMqVvhSmHmyGJ__4eVXhg":{"text":"Had brunch here on a Saturday. It was a busy day but I took into consideration the festiva","useful":0,"cool":0},"lZNnqftGYJEHyeKtjt5g6w":{"text":"Loved this little breakfast spot.  We were lucky to go mid week as I fear it's busy on wee","useful":0,"cool":0},"3ZwgrqyWU8ESKsSo3uLvCQ":{"text":"Was in New Orleans for a conference. While on a daily stroll, a local told me to check out","useful":1,"cool":0},"Dl9GZMGfdJ9u0lMyIcCQtA":{"text":"Definitely worth the wait. The food & drinks were perfect! I had the catfish & grits (Bran","useful":0,"cool":0},"hHb0_IAFTFBskdSI7Rr2UQ":{"text":"The wait for this place is bananas on most days, but well worth it. \n\nI haven't been to th","useful":0,"cool":0},"y1qgjEsZyjhRXT31c7WMcg":{"text":"The morning wait can be fairly long, but with good reason... these guys know how to do bre","useful":0,"cool":0},"T_Bjlg396xewvX-f_Lz41Q":{"text":"Love this place... great local vibe, gourmet breakfast and amazing morning cocktails. A li","useful":0,"cool":0},"vg8MA3HDjmTwnzF6Mv0Tuw":{"text":"I had The Ruby Slipper Cafe bookmarked for quite some time now before finally getting to t","useful":3,"cool":3},"beVn8x35G3qLVp4I0KLv0Q":{"text":"Seriously the best breakfast ever!! The St. Charles Chicken, Eggs Cochon, and BBQ Shrimp a","useful":0,"cool":0},"OSYSxNDRh14zNcrGLDLaZQ":{"text":"Was looking to go somewhere different and non-touristy for breakfast on a Saturday morning","useful":2,"cool":2},"qz_5tQOCbpqFR17xMYM6lg":{"text":"My friend and I came here for brunch a few times on the weekends. It's a great little plac","useful":0,"cool":0},"Xh6y9-a5_UO826juDKZMmw":{"text":"My boyfriend and I recently moved to the area and decided to use yelp to decide some of ou","useful":0,"cool":0},"9ZldLlK_SUwynDhmnspRQg":{"text":"No tourists at this one! The perfect way to get the good stuff without waiting in the line","useful":0,"cool":1},"sLBFBFRaUMt0NifuI9l5Cg":{"text":"standard breakfast fare. i had the shrimp and grits which was pretty good. the service is ","useful":0,"cool":0},"Czo9mc4K7tEyWqRRaRIwnw":{"text":"Meh. Surrey's on Magazine or Elizabeth's (Bywater) seem to consistently have better breakf","useful":2,"cool":0},"YnSjRHwYfT98f57NQKIO5Q":{"text":"Place was great. No wait. Wife got a spiced chicken Benedict that was fantastic.  Chicken ","useful":0,"cool":0},"Y88H9x9mKEv0gaWdkQm_4A":{"text":"We live in walking distance so we figured we would try it out. It was a Wednesday morning ","useful":0,"cool":0},"WFLoIawAMGb7vv_3vGkiNw":{"text":"The Bananas Foster Pain Perdu was amazing. I also got the milk punch and a mimosa that was","useful":0,"cool":0},"GlZTi364Sva6-a6H90PRBA":{"text":"I have dined here many, many times in the past and have always taken my friends here for b","useful":0,"cool":0},"CNQaZ-d3VslXYjFB04f1gQ":{"text":"I cannot rave enough about this place. Before moving out of state this was my neighborhood","useful":0,"cool":0},"39Lov4S5aKNvEPZ6rxzNhw":{"text":"Using the no Wait app to get in line ahead of time is great. The new Broad street location","useful":0,"cool":0},"PRJNO_cwHNRzpgLssPNEQw":{"text":"This was the best experience!!! Our waiter was so nice and pleasant! Great location with g","useful":0,"cool":0},"9yQ9AeDJwUB_wNBjrkFB1Q":{"text":"Such a cute place. I've never been a fan of grits, but after this visit I realized when do","useful":0,"cool":0},"ralRDznn_hT9EIG511Mm7g":{"text":"Excellent breakfast, good people, we shared Eggs St. Charles with neighbors. My 3 Little P","useful":0,"cool":0},"rQ7ANEF1n7gXOt9vsi9EHQ":{"text":"Really quite a good breakfast and brunch spot. I eat here often, usually in the context of","useful":0,"cool":0},"IK0Yjp0zy5JldPgKT4eS8A":{"text":"Food was good!! But this is not a place I would recommend or ever come to again. Yes somet","useful":0,"cool":0},"3uW4U8LzGA2HzN2-ppJ0SA":{"text":"Best place I've ever had breakfast. What a gem of a place. Great service. Great food. The ","useful":0,"cool":0},"88ArqbsVtSgfolzjfoPO9A":{"text":"Amanda was so friendly and recommended her favorites which frankly were all the menu items","useful":0,"cool":0},"FA-Q3xZsZp1EbsHa1KfvVQ":{"text":"Food was great!  But service was out of this world!  Jack's level of customer service was ","useful":0,"cool":0},"zYF_TaoRsAEZEb6sst_Mvw":{"text":"The restaurant is a nice local spot. I went early Tuesday morning and it was very easy to ","useful":0,"cool":0},"jr5FalMczjYKkh4568o2zw":{"text":"Imagine it is 2PM on a Sunday and after running errands and often times putting in time at","useful":1,"cool":0},"i5N4ov8AUFcp2UM11QW3fA":{"text":"loved this place. The coffee was the best I've ever had in my life. I went with friends an","useful":0,"cool":0},"13PlH4J0G-hHaNhdoqigxw":{"text":"The food was very under seasoned and cold. I have now been to two different locations and ","useful":0,"cool":0},"8wcbPC_vM3PbTlRdDhI-Ig":{"text":"Ruby Slipper is a fantastic addition to the Mid-City restaurant scene, and a much-needed b","useful":0,"cool":0},"3ixzEgrQg675zjBAxlFLJw":{"text":"Not totally pleased with this place at all. We used the online check-in process instead of","useful":0,"cool":0},"x1ApXKSBmN9Ztixi7hSJSw":{"text":"Bacon Bloody Mary for breakfast.  With a side of eggs and grits and a home made biscuit...","useful":0,"cool":0},"ukn9OS5LEjxQHRZ4WJNEKQ":{"text":"Beyond excellent. Today was chicken st Charles. Fresh buttermilk biscuit, topped with ligh","useful":0,"cool":0},"Ff1ev_Nb5eJrQOGGUCqOLA":{"text":"Would have got more stars, just the wait I wasn't fond of. If only there was more seating ","useful":0,"cool":0},"pNORXNtpa1qMmAtvSY2N0w":{"text":"I had the banana foster pain perdu , I don't why I ordered it because I hate bananas lol b","useful":2,"cool":1},"7EuMSzERpBJ7TOsvcIEgjQ":{"text":"This was a solid place for a weekend brunch, but wasn't our favorite in the city, and was ","useful":0,"cool":0},"fTuDfUqa9dEkt1vqMEzffQ":{"text":"Personally this is my favorite breakfast spot in New Orleans. That's saying a lot in a cit","useful":0,"cool":0},"rYhM009dHUGUHKB5OcGTRQ":{"text":"Be prepared to wait or add your name to the wait list while your getting ready. The food w","useful":0,"cool":0},"KXYfY18o7X-ihV3kwoVCoA":{"text":"Crowded on a Sunday morning. 20ish minute wait. I got the basic breakfast... and it was re","useful":2,"cool":0},"x0Wbo0Tessad0mFNH1i3lw":{"text":"Breakfast started out delicious celebrating a day in New Orleans with family. I was excite","useful":0,"cool":0},"fBSIVujxy77oP9PNpBXg6Q":{"text":"My most recommended breakfast place for visitors to New Orleans. Multiple locations (and I","useful":0,"cool":0},"gVMpD021v4PWdX-jx9TjMA":{"text":"Great food- some of the best breakfast food we had during our visit in New Orleans.  World","useful":0,"cool":0},"ZWmpir2_U9sYk3XDY7sWBQ":{"text":"This has to be my favorite breakfast and lunch spot. I visit here at least once a week. I ","useful":1,"cool":0},"LzsYmWMWYonVnmw0t8T0eg":{"text":"Great spot. Pleasantly surprised by the great digs. Friendly staff and great food. The foo","useful":0,"cool":0},"-UGb-kzwBAJ6X7RMKmTcmQ":{"text":"It's a cute little place, I came on a random weekday, mid-morning, and had a brief wait. T","useful":1,"cool":0},"tcsCSHtxBJC-yL2logACAg":{"text":"It's not a good idea to show up here at noon on a Sunday. Our wait was nearly an hour, but","useful":1,"cool":0},"LuZYaf8vNU1y7GdOi0ZZsg":{"text":"Perhaps it's because I went in at 1 p.m., but I wasn't super pleased. My biscuit was hard ","useful":0,"cool":0},"v473kZr7K-6hN2k8pRMbcg":{"text":"So after many years of missed opportunities I finally ended up having brunch at the origin","useful":2,"cool":1},"BOVLaB14AAxgtMhEJi6yGA":{"text":"I'm not sure what all the fuss is about. Maybe I got the wrong food? Maybe something wasn'","useful":0,"cool":0},"YYAyPQ7F9MeQnBakSHuYsQ":{"text":"A great place to have breakfast/brunch! I HIGHLY recommend the St. Charles Chicken! \nWith ","useful":0,"cool":0},"a1mT3Y8cfdrk1-UvUWJ5rw":{"text":"Came to the Ruby Slipper during a long weekend in New Orleans.\n\nWe went closer to breakfas","useful":2,"cool":0},"fqzzGeXHUYiav15rPZogqQ":{"text":"When we walked in one waitress told us to sit anywhere then the manager stopped us and bro","useful":0,"cool":0},"62IM35OZX6MhOnAQrDu_QQ":{"text":"I'm not a food snob but I know what I like. I'm a huge fan of Ruby Slipper in Mid City and","useful":1,"cool":1},"Ol-REbY8k7J1-n0JDI2fhg":{"text":"Our family eats here every time we visit the city and family.  The wife loves the mimosas ","useful":0,"cool":0},"bPniTNFC-gat9kj0_0nTQQ":{"text":"Awesome spot. Went here twice for Shrimp N Grits. I am from Atlanta and I liked their bisc","useful":0,"cool":0},"QWyP7QmYtknGp_vX8lJV3A":{"text":"Went to the Ruby Slipper Cafe this morning for breakfast following the Susan Komen Run. De","useful":0,"cool":0},"AyNHBYPuAkutoXwHdX4clQ":{"text":"This is my favorite place to take out-of-town guests for brunch when the finally wake up -","useful":0,"cool":0},"yVGhfCygTjV89yPJ-U9S6A":{"text":"Good food. It's best to sign in for a table online on the weekends. Saves a lot of time. T","useful":0,"cool":0},"mz4IWd1LgYlHwTCd8c2ACg":{"text":"A Nieghborhood Gem.  Fresh seasoning and giving back to the community make this one of the","useful":1,"cool":0},"doIJTcr-I_T26nWeVXgw8g":{"text":"Great place to head for breakfast! We have been meaning to go to a Rubys for the longest t","useful":0,"cool":0},"rPFl5hShukACIAzFXCM4Qw":{"text":"My fiancée and I chose to eat brunch at a cute spot in Midcity. There was a small wait but","useful":0,"cool":0},"p1U2UAx7EtJRILbYqUUcQg":{"text":"This is my all time favorite breakfast/brunch joint in New Orleans. I haven't had anything","useful":0,"cool":0},"42V0FoQ88-ftEJUCGwAnpg":{"text":"This place is very easy-going and friendly (it would not be out of place in Portland's Haw","useful":0,"cool":0},"g2Q0IF2jN9s_Us-gqFZA_A":{"text":"I I have tried this place twice,forgetting how bad it was the first time. The salmon (what","useful":0,"cool":0},"wQxvm6vjAtrVjSv_BFGXrw":{"text":"I never post anything, but it was that BAD. DON'T GO! I've been to the Ruby Slipper three ","useful":0,"cool":0},"DIkcv2NowHkii62Aq-0zYw":{"text":"Really great. Liked it the first time and second time I trellised how amazing it really is","useful":0,"cool":0},"_8-bj5nx16mH0gbETG_VCw":{"text":"Food was awesome! Bloody Mary was great too. Loved the homey feel of the place. Servers we","useful":0,"cool":0},"cR1odnjZXpDs6P0hj3pYRQ":{"text":"Pancakes are amazing! Love the sweet fluffy pancakes and crispy bacon. And if your wanting","useful":0,"cool":0},"3KPFP665FLO4OnK247irTw":{"text":"Great food, fantastic food selection, great biscuits, friendly staff.  It was so hard to c","useful":1,"cool":0},"tG8pF1sSKisXvunUBZGiVg":{"text":"It's good, but I have to be honest and say the hype was a lot greater than the final resul","useful":4,"cool":3},"obtqtCscCDcrcLF32KDhUw":{"text":"Always busy, and parking can be a bit of a challenge, especially with meter maids and boot","useful":0,"cool":0},"0yokN3zPPIpV9C1eEMBJDA":{"text":"Variety and delicious breakfast and great early drink specials!  A must if you're in nola.","useful":0,"cool":0},"9AJgwbwirp0IjyAdfE_Tiw":{"text":"A local recommended this place, and it didn't disappoint!  It was walking distance from th","useful":0,"cool":0},"KSAAkeDuzy_PGkQ-KEBTkw":{"text":"Very touristy but great food. The Costa Rican is one of my favorites. Always get the pig c","useful":0,"cool":0},"uBJIBjWzGIODqGobC0M54A":{"text":"A lot of good choices for breakfast fare. It was hard to decide, but luckily, my friends a","useful":0,"cool":0},"QgpySQ1MbPQIZw8l6kbqVQ":{"text":"Loved it got in quick food great.  Eggs blackstone really awesome. Service excellent. Outd","useful":0,"cool":0},"FojgssvOh-laU5pvd4C9ag":{"text":"The food is so good. I had the pancake flight and chicken sausage. I will say the waiting ","useful":0,"cool":0},"LSmqmoP95BskGmWzu729CQ":{"text":"This breakfast place was charming! I loved the interior, the old floors and old fireplace.","useful":0,"cool":0},"gYgyiXsOj3BFjbFloSxg4g":{"text":"Brunched here on a beautiful Sunday and didn't wait long for a table. I had the shrimp & g","useful":0,"cool":0},"dwEkLgrFDIRVHVkT6nmoPA":{"text":"Simply the best! You can't go wrong with ANYTHING on the menu! The new place has parking n","useful":0,"cool":0},"mQ5i67JASnohriWxlgCn0A":{"text":"Excellent good and very nice staff. They have multiple locations but this one is very new ","useful":0,"cool":0},"MiuXxDQyWipFJsSApN15RA":{"text":"My friend and I went to Mardi Gras and came to Ruby Slipper twice during our stay! I wasn'","useful":0,"cool":0},"mWMXPU0l4Dvj2kRkYi9v3A":{"text":"The is probably my favorite place to have breakfast when visiting NEW ORLEANS.  lathe menu","useful":0,"cool":0},"kAMUHGNi_khhYvaJ_L_ybw":{"text":"Lots of options for the whole family here. I love the endless Benedict options. The servic","useful":0,"cool":0},"zeFchcQFE7zS1AuEoZlEGw":{"text":"The hostess was nice. We were seated pretty fast considering how busy they were  (we used ","useful":0,"cool":0},"bjvhtdSruDLuagBdpJahng":{"text":"If it weren't for our server Jack, this would be an even lower review... bartender wanted ","useful":0,"cool":0},"ZR7NtZ4o8K7xp0VbZmypAw":{"text":"OH YUM-O!!!! I love the Ruby Slipper - so cozy & yummy!!! Just such a nice neighborhood br","useful":0,"cool":0},"gV0e4DvaOZeIJrqmHOHAKA":{"text":"Fun, yummy, laid back... We went as a family with our 2 teens for brunch on the recommenda","useful":0,"cool":0},"oTA8kUxB0aoxTF6fjX6KWA":{"text":"So impressed with the food. We all got the Chicken St. Charles and it just blew me away! S","useful":1,"cool":0},"eODBWfvkAWp2ydFeaJnoxA":{"text":"We went here 2 times during our 4 day stay in New Orleans and loved it!  The food was very","useful":0,"cool":0},"esIKGqLBoFZVqMx-hmSpSg":{"text":"Food was unimpressive and expensive...I mean really unimpressive and very pricey for eggs ","useful":0,"cool":0},"9aVWXyedRd6mrMfqNJCFZQ":{"text":"At here for the second time last week.  It was every bit as good as my first trip.  Good s","useful":0,"cool":0},"MGS00bRjjveHlH29XYcfQg":{"text":"Ruby Slipper Cafe is the answer to your question: What's for brunch? Everything I've eaten","useful":0,"cool":0},"BM9tHeWzJPJ_Cqq0DL-LPg":{"text":"I went here for breakfast during 4th of July weekend with my two sisters and it was crazy ","useful":0,"cool":0},"ee_8O-ZMM2Yc8gPgniNZZA":{"text":"The food was absolutely AMAZING!!! The customer service was OUTSTANDING!!! A must do if yo","useful":0,"cool":0},"KDmj58-y706qowGLOlEkdQ":{"text":"I'm from Houston and we went with family while in New Orleans. I'm so glad that we decided","useful":0,"cool":0},"BRje6OdR4IxqNOM65JSEfg":{"text":"Nothing special but definitely a quality breakfast.  I got the breakfast sandwich on bagel","useful":1,"cool":0},"RUg_qoazequG-Tmaz1tu6g":{"text":"REALLY disappointed in this Ruby Slipper!  First, the place was half empty at 10:45 am (no","useful":0,"cool":0},"3vnI4sMSJEbrPkif7gi8qQ":{"text":"Could've had a better breakfast sandwich at Starbucks. Staff not very friendly. Over-price","useful":1,"cool":0},"SgjWbUh986jPVTf70xOgTg":{"text":"Awsome food and GREAT DRINKS. Mimosas and bloody Mary's were great. Diana our waitress was","useful":0,"cool":0},"Mms5f-nLmmCkdeDCU8EoDQ":{"text":"This was fabulous food and to make it even better we had a great waiter.  Nico gave us gre","useful":1,"cool":0},"Q-V7aoddByfs_S-E_yzrBA":{"text":"Oh my- the Batons! Everything you've had as a child gets wiped out with there cinnamon Fre","useful":0,"cool":0},"rO8Fls138UCJod3WFWs9Yw":{"text":"This is the Ruby Slipper you need to go to! Don't even consider the one downtown on Magazi","useful":0,"cool":0},"oQAxO33EXfu6aKlzdmp3iw":{"text":"Stopped here for brunch on our way out of town. No wait, which was really nice. First of a","useful":0,"cool":0},"HHM--yACph775XjQsQ9yTQ":{"text":"Absolutely delicious food and cocktails.  Some friends and I recently stayed nearby on vac","useful":0,"cool":0},"Wh7TzwXchxgtKrFEPaEt7w":{"text":"Long waits on Saturdays are usually a good sign. This was no different. The key to their n","useful":0,"cool":0},"s9lATumkcwMs8Mq5zkp-bg":{"text":"I was in New Orleans for a fun weekend trip, and had Ruby Slipper recommended to my boyfri","useful":1,"cool":0},"oM3mIvDppNYiPxz_Cv9-pQ":{"text":"My wife and I are here for breakfast and both of the eggs Benedict's we ordered were absol","useful":0,"cool":0},"RPLyJj8zhD-1KDLkFu0dLg":{"text":"Worth the wait!! Went to the original Ruby Slipper after eating at the Canal Street locati","useful":0,"cool":0},"feoAcG87g9whnNWE4eQn6Q":{"text":"A delicious destination, but be prepared to wait if you don't show up early on the weekend","useful":0,"cool":0},"EpPGxmOQeX8g-TtjO2-9SQ":{"text":"The most amazing place for brunch. There is def a wait time. So just order up a nice drink","useful":1,"cool":1},"yS-TsmH7RXdxqK6v_K_-HA":{"text":"The food was really really great, but it might be best to eat there instead of getting tak","useful":1,"cool":1},"BKCQJ2_KI7j-sGGwv_nImg":{"text":"While the food is ok, I have just been there for breakfast and lunch, they are way overpri","useful":0,"cool":0},"sCcF3Xo8PyQn0zxuivXIYQ":{"text":"Newest location. Ordered grilled fish of the day. Drum.  Over a cheesy grit cake with a sk","useful":0,"cool":0},"co2PeXkytiEDOLcUDSYp1w":{"text":"Amazing spot for brunch. The menu has a diverse selection of breakfast options. The staff ","useful":0,"cool":0},"sIXx36iT4ARCQ-0Mmka6xA":{"text":"This review is specific to the Mid City location though this basically holds true for the ","useful":0,"cool":0},"Xl4UhbOM6ScmzwXjpncRaw":{"text":"This location is a hidden secret. It morning drinks were amazing! The food was delicious! ","useful":0,"cool":0},"fCCBRUI9E0REMM2boSYh_w":{"text":"This place is awesome, located in a quaint neighborhood. The food is delicious and the cof","useful":0,"cool":0},"BkJKNLmkLwvxOq87GsDOng":{"text":"I only ordered the breakfast potatoes and grits. So my review is limited. The potatoes wer","useful":0,"cool":0},"wOwx7JrPibwnNtnlQGxQXw":{"text":"I'll start this review by saying that I haven't been to the other Ruby Slipper locations (","useful":0,"cool":0},"dcklOpEYsVoBp0kF-_f_pA":{"text":"Goodness gracious New Orleans...  Why do I love thee so...\n\nDat Southern Hospitality...  D","useful":1,"cool":1},"cQeRAQhzCI3ZhU7N2FuBAg":{"text":"So I was staying at a airbnb around the neighborhood and was recommended this place. I def","useful":1,"cool":0},"uDm-Q0YxG6Ie1AuEnWP7vQ":{"text":"Had a great breakfast there this morning with my friends. Everyone loved their food and we","useful":0,"cool":0},"P47OFof2vCDQAjQu6aXPWw":{"text":"I've heard praises of this restaurant from friends and family. We (my sisters and I) had n","useful":0,"cool":0},"yo-MSuARfpdiw33Muc1Niw":{"text":"Every dish was delicious. We tried the packed eggs with hollandaise and bacon, the fried c","useful":0,"cool":0},"c3qjcX_YAuPDw-94-k6wrQ":{"text":"This was our first stop for food in New Orleans. It was close to where we were staying at.","useful":0,"cool":0},"gKn7dqW9-ktYnaW4HphE-w":{"text":"I go to bat for this place 100% when talking about best breakfasts in Nola.  I can not spe","useful":1,"cool":0},"SZxyIMe8wS6RxkuPLOawJA":{"text":"Great food. Busting at the seams as far as space, waited over an hour to be seated when we","useful":0,"cool":0},"zE1kFCmoWHjHK3MlISk9zQ":{"text":"We were very excited to come here! It had excellent reviews, the menu was reasonably price","useful":0,"cool":0},"wX6qsruf63aVPTsIucX4-g":{"text":"I visited their new location on Broad and I really love it! Outdoor seating and a yard wit","useful":1,"cool":1},"xNpopog9l6ilvHvZLf0ZiA":{"text":"Love this place! Only a few blocks away from my house definitely makes this a spot i frequ","useful":3,"cool":1},"FOczIoU3yogvaOJ6c7FCGw":{"text":"Food looked great, but was incredibly bland. I ordered the stuffed French toast and I was ","useful":0,"cool":0},"99JaW2ja0aUy-hhBouSVvA":{"text":"Don't think- just go. Amazing breakfast!!! We went for brunch around 10:30am on a Friday a","useful":0,"cool":0},"BhyWCahW4AZCee7FRiQOOQ":{"text":"This is by far my favorite of all the locations. The service was great our food was delici","useful":0,"cool":0},"toVvaEircfrWDFw8aS0S-g":{"text":"Excellent fast service.  Great food had the shrimp and grits and omlette.  Both were great","useful":1,"cool":0},"mjB1ASf2PKV-dD1KripbJA":{"text":"Yummy Bloody Mary. They don't substitute for non-meat eaters, which upset me. If I'm not e","useful":0,"cool":0},"UVW4JBiU-KeZzTmkMGrpLw":{"text":"Good brunch place! This place is very popular so be prepared to wait on weekends! I really","useful":0,"cool":0},"B3ibLIz1EpPP1TDzrG9prQ":{"text":"Great stop for brunch! The seasonal berry mimosa was amazing! There were also really inter","useful":0,"cool":0},"DFgGYfDFY1RxiWjxgV85lA":{"text":"it's the second time i've been here, and i'm still not super impressed by the food.  stand","useful":0,"cool":0},"CJAsuThEOmmMXsx2iZzDzg":{"text":"Lots of buzz about this place and have been hearing about it for years. So finally got a c","useful":0,"cool":0},"Hxa4EAtFJHAdPzv77Spefg":{"text":"Stayed in NOLA for 7 days...we are at Ruby Slipper for 4 of those 7 days...compared other ","useful":2,"cool":1},"A6yOzlWpLWEQzB1WOLO47w":{"text":"Excellent food, excellent service we will definitely be back! We had Misty as our server a","useful":0,"cool":0},"16PNxbqIwKFE827SsuzXtQ":{"text":"I come here often for breakfast before work. Service is very attentive and genuine. The co","useful":0,"cool":0},"NWPR0KZJidxWydPytBaJtw":{"text":"Went there this morning with great excitement because of the awesome menu. We had a party ","useful":0,"cool":0},"zcSjyXZYqWFbme2d6NKilQ":{"text":"I had heard so many great things about The Ruby Slipper prior to coming here. The wait was","useful":1,"cool":1},"tq7PLxgVXH_nLB0klqFhjw":{"text":"A friend and I went to this cafe because it was near the Airbnb we were staying at. We had","useful":0,"cool":0},"NZCyMnMRGLg1FwVKfvbN2A":{"text":"Food and service was good. I have to warn, however that if you order the Costa Rican break","useful":0,"cool":0},"6a_fuxl03l8QPRJEYNWMNA":{"text":"One of my favorite brunch spots. Wait is always long - hard to get a table for a large gro","useful":0,"cool":0},"wkGWuCFE4ho_MYmTheropw":{"text":"Great service. Great people. St Peter's is a must try. And those that don't mind day drink","useful":0,"cool":0},"tGhf2FyAlLKPYumWozQj9g":{"text":"We arrived at Ruby Slipper around noon on a Wednesday and waited about ten minutes for a t","useful":1,"cool":0},"zGomRTh0cKeDWBBwfhxicw":{"text":"The food here was probably the best we had in NOLA. We had a Gulf fish St. Peter, which wa","useful":0,"cool":0},"bN3SuhTN2rQ5w_n5OrEmhA":{"text":"Meh. Went on a weekday morning so no problem getting in and getting a seat. I ordered a st","useful":0,"cool":0},"c5oI4uaod52L1uQY8S9IDA":{"text":"It was one of my favorite places in New Orleans!! The food was great.. great atmosphere an","useful":0,"cool":0},"OYbRTKMc8FoAopgJPmHMiA":{"text":"Been here several times now, usually with out-of-town guests. Which is ideal because we ge","useful":1,"cool":0},"F7I-rp4Xe3Y6O1Kh6QzC6A":{"text":"Had the blt, omelette and the Mimosa.....all were excellent! Great service, even better fo","useful":0,"cool":0},"y2PsBXIQm8GZMDmREWqcUw":{"text":"Their marscapone cheese grits with beef debris and kale is probably the most perfect brunc","useful":1,"cool":1},"MEi3-BFQF6XknF-joc-oSA":{"text":"We love this Cafe.  Mimosa is outstanding and can't go wrong brunch selections.  Get the p","useful":0,"cool":0},"aLnanEs89J8GDFr1vmxd3w":{"text":"Ruby Slipper is definitely one of my favorite weekend breakfast spots. I've never had a ba","useful":0,"cool":0},"hV6U5tZ3FkK_iq_aN5i5QQ":{"text":"Our AirBnB host recommended this restaurant. Long wait but totally worthed. Amazing food.","useful":1,"cool":0},"uJQ4gjq94X_ll7jXFnXwxQ":{"text":"Loved everything about it! Their food is simply delicious- everyone in my group licked the","useful":1,"cool":1},"t-0IyEcVD6nWDON42Q2Ocw":{"text":"Awesome breakfast. Quality, variety, and service are all great, every time I go. The Blood","useful":0,"cool":0},"QG-d2-_x4NTwvKfxIKPZ4g":{"text":"I live in the neighborhood, and the owners did a fantastic post-Katrina renovation of a co","useful":0,"cool":1},"Lpa9RPzJBNOYeAazfSUNew":{"text":"The only reason they're not getting a 3 is because their food was INCREDIBLE. I feel like ","useful":0,"cool":0},"b5EW3oWXJG7Ng_iH1_6AjQ":{"text":"This cafe has awesome breakfast or brunch food southern style. I had a combo of eggs Bened","useful":0,"cool":0},"cxrZAaXe3oEnkolKduYBPw":{"text":"There was a slight wait, but it went by pretty quickly. We were here for Breakfast and the","useful":0,"cool":0},"ZbZfeDdlH1NF8Jql_j1GVA":{"text":"I have only been here once, but wow it was amazing. I went to this location in particular ","useful":1,"cool":0},"r29n8UlBisIPpj0PxEFLTQ":{"text":"I really love brunch and I was really looking forward to trying the ruby slipper but my fi","useful":1,"cool":0},"14k138K48nqgn4WeucQOKQ":{"text":"I brought my parents here while they were visiting me from MPLS, MN. I had the shrimp and ","useful":0,"cool":0},"Hefvjs_iHrannLWKCjjs9w":{"text":"Hands down one of the best brunch places in the city, with awesome brandy milk punches to ","useful":1,"cool":0},"KYkU_tAXJrgoqdioNGhKMQ":{"text":"Bacon pecan pancakes are marvelously delicious.  A tad more sauce would have done me in.  ","useful":0,"cool":0},"5kCTCIIRfm0wj0uH0hvQzA":{"text":"First time in New Orleans, my partner found this place... & OMG the Breakfast is great! Co","useful":0,"cool":0},"MY-D-yYBVc94JyiPTmkalw":{"text":"Stopped by twice during our trip and everything was amazing and the staff was very nice. H","useful":0,"cool":0},"OE71-q8jEj0yOIax1I8Itw":{"text":"The wait on a Sunday morning was over an hour but the food was yummy. The drinks were tast","useful":0,"cool":0},"Cux1mGmm1uQwnZd3YkCVRA":{"text":"Walk in and immediately was seated , nice friendly faces . \nOnce sat down I was ask what I","useful":2,"cool":1},"oDZ-3jOuCkSyI1TsbId0Mg":{"text":"Me and the ladies from the office went in today to have breakfast and it was wonderful!!! ","useful":0,"cool":0},"JHXZQCCTHSAc_7zg1uYACg":{"text":"We initially wanted to go to the one on Magazine because we heard so much about the Ruby S","useful":2,"cool":0},"qPulKv7HV8kvDNhFPAfAww":{"text":"This place it's just the epiphany of Brunch. First time at this location and I loved the p","useful":0,"cool":0},"PTXSgbHmIuJo4DLROknPsw":{"text":"The wait staff was super friendly, fast, and nice. The food was fresh, delicious, and qual","useful":0,"cool":0},"QLNybK6WvQgdx23weCDFWA":{"text":"We find the staff very friendly and professional and enjoy the variety of choices . Today ","useful":1,"cool":0},"02T2QAAS4lSm9hMdFchjig":{"text":"We went earlier today (Good Friday) around lunch time so needless to say there was a bit o","useful":1,"cool":1},"3pg7nw6zV06YIMUhZLRcHw":{"text":"While I am partial to their shrimp and grits. On a whole this is not that great of a place","useful":2,"cool":0},"0jfne205Txd_XhkZ622mZw":{"text":"After giving so many breakfast joints sad reviews it puts a smile on my face to review Rub","useful":0,"cool":0},"IQuJ14kPlcUNZDFE8i0zgA":{"text":"This is a delicious place for brunch.  I started with a brandy milk punch, which was prett","useful":1,"cool":0},"VHvYNKHr6GBICBl_JYfsfw":{"text":"Simply put, this is what southern food looks like.  The Ruby Slipper Café is an institutio","useful":1,"cool":0},"SFzbRnU-ZeDL2FAmvuRr8Q":{"text":"When our party of 3 arrived, the hostess stated it's a 45 minute wait and she might as wel","useful":3,"cool":0},"4e0GE2OKBZJf4zexsWVqTg":{"text":"Large portions. Had the two menu starred versions of the eggs benedict and the cheesecake ","useful":0,"cool":0},"XopsUjzYk69gQ0-S3jBvwQ":{"text":"I consider it my own personal mission to seek out and try every brunch spot in this city b","useful":1,"cool":1},"6AkXxF4llZEehTCewjHbFw":{"text":"Absolutely amazing! Great place with amazing food!  Great proportions, and fantastic wait ","useful":0,"cool":0},"-9w6jT21GQ2aHZS_5KZMaA":{"text":"Overall very good but would agree with some of the post that the Food was bland.  The favo","useful":0,"cool":0},"QxdTXxlJCE6Po-QibMCzVQ":{"text":"Though I hadn't had much time to explore the city of New Orleans until the last few weeks,","useful":0,"cool":0},"gKRUkDwDDElEjGGKVgapEA":{"text":"I had the cochon debris over \" crispy grit cakes\" with poached egg & hollandaise. The grit","useful":5,"cool":1},"IaAoLydP9CCcVtJMvWEKsg":{"text":"Pro's\n1) Great quality food, menu selection, and portions.\n2) Reasonable prices.\n3) Friend","useful":0,"cool":0},"yaCWls8mXtWE1zBG0rka0g":{"text":"use to love this place 5 years ago.  they seem to be slipping.\n\nshrimp & grits: the shrimp","useful":1,"cool":0},"L-tHZ_PEnxdKRsP-wS3ziw":{"text":"This is, technically, a great place for breakfast in Mid-City, and other people give it gr","useful":20,"cool":0},"e6MfjKAvsqgj3vdUUFaHzQ":{"text":"Something for everyone, worth the wait and delicious drinks & food. We always take our out","useful":1,"cool":1},"yuqrX940u1UZtV9-7tl18A":{"text":"Great breakfast spot. The food is great. Large variety of items to choose from. The locati","useful":0,"cool":0},"axlrXwlGtoLZripgRbaNCA":{"text":"First time coming here it was amazing the Costa Rican was everything I needed. I can see w","useful":0,"cool":0},"plvxUrti5e16Y2CWcWCVqg":{"text":"Best shrimp and grits I have ever had. That merits 5 stars. \nTheir coffee isn't great, but","useful":0,"cool":0},"yUHH402aFamFUH2IJ12gmA":{"text":"We got there around 11 and was seated by 12:15 it was crowded but that figured. We didn't ","useful":0,"cool":0},"gW9LSDRD0znlv7X51rQP6g":{"text":"hollandaise gross.  taste out of a can\nchocolate chip pancake dry\nservice good\nprice avera","useful":0,"cool":0},"qzw4S1_-XzubJDqeo-WVXw":{"text":"The food!! The service!  The mimosas!! The renewing of the community!! If you haven't been","useful":0,"cool":0},"qg4EXKOTPXNMyydqI1nLCw":{"text":"Absolutely love this location! Great service & the food is always on point. Avoid the Mari","useful":0,"cool":0},"HME8OUIkDIYrJIXY5vJTaA":{"text":"Went here for brunch in late November - my boyfriend and I both got versions of the eggs b","useful":0,"cool":0},"HNOTYDwjAXEYX-koJHlKDw":{"text":"I love this place. We came here for Sunday brunch. The wait wasn't that long since we got ","useful":0,"cool":0},"c2dwKchHXfsFpomcD0QFsQ":{"text":"The food was great, the wait time was CRAZY and the service was horrible. Absolutely rude ","useful":0,"cool":0},"g5afWG5J66I9o7uiflWPjA":{"text":"Love this place. We've been enjoying it for years. Waitress Diana is a doll, very friendly","useful":0,"cool":0},"YWvJjjzcowB6TOUWlGIbPQ":{"text":"Best breakfast in the City of New Orleans,  Hands down with Chef  John Currie who is a bea","useful":0,"cool":0},"Q3nhkowuk6YuyU5qfAR86Q":{"text":"My food took quite a long time, even considering it was a busy Sunday morning.\n\nI had an i","useful":0,"cool":0},"9bIw8QTeiUd9C98vd7w-sQ":{"text":"If it had been the old crew and management, I would have given this place 5 stars, but it ","useful":0,"cool":0},"HBOw_wlTmAKcXUvsbaMLqw":{"text":"Had brunch at the bar this morning and it was absolutely perfect. The bartender/server, Ja","useful":1,"cool":0},"3PsoVTrpjqqSx3lCfS6axg":{"text":"There is no better breakfast in town. They have amazing monthly specials but it is difficu","useful":0,"cool":0},"t-wYnjrRLsl4FkYsUjwJOg":{"text":"The brunch food is tops.  I always get a different type of omelet - and they are all just ","useful":0,"cool":0},"vB6F0DFQj61oVucz9JElyg":{"text":"***UPDATED***\nSo I somewhat enjoyed my last trip and thought I'd give it a second shot. Ba","useful":1,"cool":0},"MyqmshDXJ7lUYMteJ0jpEQ":{"text":"This was by far my most positive eating experience in NOLA and I only wish said experience","useful":2,"cool":0},"hnyWGLcS33Enbunwp8mkuw":{"text":"I was taken to this location on July 4 by a good friend from New Orleans.  I was surprised","useful":0,"cool":0},"tb8B1US5Dy2vFKVI6sMn2A":{"text":"We were in NOLA for three days and went to Ruby Slipper two mornings in a row. It is so go","useful":0,"cool":1},"4dhV9iv1Xw0wT2J6MUwmPA":{"text":"The chefs were laying it down too.   The food looked great and tasted even better.  Shout ","useful":0,"cool":0},"3i_iHcAqKUeiFtSFC3rvRw":{"text":"Great food, great service, ask for Misty she's the BEST. Sweet, friendly and she makes the","useful":0,"cool":0},"Bpepe_LGdnK2xfSvsQYe-w":{"text":"Awesome. Totally completely awesome. I've heard about this place forever, but they don't t","useful":0,"cool":0},"fs3ISg9yL2wzSFri_82XSQ":{"text":"Yes, we had to wait on a Sunday morning...but the wait was well worth it. We had the Banan","useful":0,"cool":0},"nrY010ZPXsuhibQEt_Bygg":{"text":"This popular restaurant is tiny, so prepare to wait.  The mimosas and bloody marys will he","useful":0,"cool":0},"97dk38Do0RhWY4j7Mtremg":{"text":"Food was nothing to write home about. I was hyped about going because I heard so much abou","useful":0,"cool":0},"RfCOgqRIVqvl2KdA9lCBtg":{"text":"Well, well, well. The slipper has a new foot... just went to the new location on broad str","useful":0,"cool":0},"hHqrU2xIyGYkPi2gLPHAUw":{"text":"Wonderful brunch. Majestically, there was no wait time on a Saturday for a party of 7, (we","useful":0,"cool":0},"EiQH_t14IC5DIvscZIwa3g":{"text":"So today had a girls get together with family and ruby slipper is our favorite brunch spot","useful":0,"cool":0},"0J4WBlEePTT6eVQUZ9-3nQ":{"text":"Had a bachelorette brunch here. They accommodated 9 of us nicely. Had great drinks and foo","useful":0,"cool":0},"5vl-RhK8Mqbd61W1jGM1SQ":{"text":"What a nice NOLA gem. Such a vibrant atmosphere. Came with the bride and bridesmaids for b","useful":2,"cool":1},"LyMiq60-_eHPFDCe-dctjQ":{"text":"As I soon as I came in...I was able to be seated so I was very very happy.  I ordered the ","useful":0,"cool":0},"ZuwhwfQZKV3QVDCgYw4TKg":{"text":"Food was good, but came out cold. Service was okay. Came for the eggs Benedict. Still, I'd","useful":0,"cool":0},"5N5OL7WHqmU5J4fBOq_krg":{"text":"The food was really good, but the service was just decent. Had an omelette with shrimp and","useful":0,"cool":0},"cNGGVJ2c34KS06Ohd1F4gA":{"text":"This place was AMAZING!!!! The menu had your traditional breakfast items, and speciality i","useful":0,"cool":0},"oSJc9BqFlDZmelo5hymE_A":{"text":"Delicious breakfast with the family. We love this place. The Bam Bam biscuit is fabulous. ","useful":0,"cool":0},"Buo0Zgr2tKXh9kZHKiNCAQ":{"text":"Top 5 best places for breakfast in NOLA! I've only been to 2 locations but both were wonde","useful":0,"cool":0},"wbIu-3ZB4RVRaEmocbc9sA":{"text":"We visited this restaurant about a week ago. It's really amazing experience! We ordered di","useful":0,"cool":0},"3lUlzKArAlD9y11X4FzQEw":{"text":"Deeply OKAY. A local treasure that no doubt got too popular and slid a bit. Huge wait, got","useful":0,"cool":0},"G_MOjKdi-ws_4guGKYm2yA":{"text":"Delicious Sunday brunch. Worth every minute of the hour wait. Once we were seated, we plac","useful":0,"cool":0},"7yZEk_leharJ9k-oUon_rQ":{"text":"I was having a hard time deciding on what I wanted. On the waiters reconnection I got the ","useful":0,"cool":0},"iuLu7BLhncUcBzl9e0kA-Q":{"text":"I came here after my friend posted a picture of their breakfast on instagram. The picture ","useful":1,"cool":0},"TjlTJa6BOCLabrszT-afGw":{"text":"My favorite Sunday morning breakfast spot! Great service and food!  Please use the No-Wait","useful":0,"cool":0},"54xUhkn45VvrxiqDy-q1dg":{"text":"Had the Trifecta with 3 different egg Benedict's. The biscuits were huge. Food was bomb. M","useful":0,"cool":0},"mYCaFXMzSiymuiT-o-d3og":{"text":"The worst thing about this place is the very long wait. But the food and drinks are unbeli","useful":0,"cool":0},"jtzbJ_cAxiIDANeedaBL3Q":{"text":"Awesome food and fast service! Food is great and ambience is fantastic. The waiting area i","useful":0,"cool":0},"G5XegsYNLPp7Q63hqOnMjA":{"text":"This location of the Ruby Slipper Cafe is smaller and not as pretty as the one on Burgundy","useful":7,"cool":4},"m4HhnkECJeyAqYECyNsrsg":{"text":"Hands down the best breakfast place in mid city. I come here every Sunday morning for brun","useful":1,"cool":0},"hk5AwGNyUMURFO_xCzvT5g":{"text":"Came here for sunday brunch. Service was decent, food was mediocre for New Orleans standar","useful":0,"cool":0},"6DG2Oqf8MTHA7gW6j329yA":{"text":"Great, understated spot. The food was just as good as the fancier brunch places around tow","useful":0,"cool":0},"pU36udQLoo7TkFPOYdEFhw":{"text":"Awesomely delicious BBQ Shrimp & Grits! The shrimp didn't have any heads so you could just","useful":0,"cool":0},"mScvZ0BFWVtH8jGxlZroQA":{"text":"Good gawd amighty. A huge plate of tasty food made this my new treat myself spot. I had th","useful":0,"cool":0},"kUpfjWA_3jWvk4ECMkn6Zw":{"text":"1st time to NOLA . We had a party of 12 and had waited for an hour after our name was plac","useful":0,"cool":0},"xqu4s2gaF9U8hUEoqMO9-g":{"text":"I wish I knew they had an app to be placed on the wait list. That would've helped with the","useful":1,"cool":1},"yUWLpPuIFFM9Su3s09y5eA":{"text":"This is one of our favorite breakfast places in New Orleans. Any time we have visitors, we","useful":1,"cool":1},"iSUBu3O6MnYirLOlv0Jx7Q":{"text":"Delicious! Newly renovated place and looks nice inside! Friendly service and food is great","useful":1,"cool":0},"USa16V-hxHhFt81SRS6Sxg":{"text":"Our first month in NOLA we lived around the corner from Ruby Slipper and I was hooked as s","useful":1,"cool":0},"638e0-mS1gMv_694eK7kSQ":{"text":"Chef Rolita makes the best fried green tomatoes I've ever had! The tomatoes have this wond","useful":0,"cool":0},"k1fxbwUNA5UezLhfHDY3jg":{"text":"Ruby Slipper is the only place I know where you can get a Catfish Eggs Benedict and it com","useful":0,"cool":0},"5ICV1ZvWX2pOAG9u0B8djw":{"text":"It is overrated.  The service here is unorganized and food is okay.  Nothing worth going b","useful":0,"cool":0},"4lpvROtNbqJ2M5iTOfKEqw":{"text":"Our waiter was super friendly and full of smiles despite the Mardi Gras madness. The food ","useful":0,"cool":0},"Zk4aq07Kt5IolPrM8c-fwA":{"text":"The food was awesome! The cafe is a little bit small for he crowd that they draw. The cafe","useful":0,"cool":0},"II5epIfU8zwRAEUxbP2LrQ":{"text":"The best meal we had in New Orleans! Eggs Cochon (best biscuit I have ever tasted!) and th","useful":1,"cool":0},"f-3JuZa-8O9E1YwHGVPeJA":{"text":"Walked to this joint from our Airbnb and so glad we did! Sat at the bar and had a wonderfu","useful":0,"cool":0},"NCHRK9s3sOfHLH5-QyrV1A":{"text":"Mmm","useful":0,"cool":0},"XDideRfl8uDNT_LRDO8bZw":{"text":"Awesome Awesome Awesome! Service was friendly and fast,  we ordered a drink from the outsi","useful":0,"cool":0},"ccclP-D_7TaiHF2ISbUzrw":{"text":"My husband and I went to Ruby Slipper on the recommendation from a friend.  We waited over","useful":2,"cool":0},"19arGzgkEhdYQ9gO17PixA":{"text":"Great service! Delicious food! Those two elements coupled with great company are always ap","useful":0,"cool":0},"cTq_JS_OYgoAHOUlKe0C8A":{"text":"I don't do sweet breakfasts that often (can't handle so much sugar that early in the day),","useful":0,"cool":0},"GopgF9ypRTESJPMTRo3qow":{"text":"always a satisfying food experience, Ruby Slipper is among the best breakfast/brunch place","useful":0,"cool":0},"TMmIOjgTAYFtwKdifoVmeg":{"text":"Went to the Ruby Slipper with my family the last day of our annual trip to New Orleans for","useful":1,"cool":0},"hq4FEkyBpwlNQOwmtWtqwg":{"text":"So....more like 3.5 stars.   I've been hear numerous times.   Sometimes the brunch menu to","useful":1,"cool":0},"hrkD_NOmWsYzWOpZtEYrLQ":{"text":"The food was great. The wait time wasn't bad at all. Going thru the yelp app helped us a l","useful":0,"cool":0},"LZYlEYEsVfFLRzZr0QoCqg":{"text":"On my way out of the city I had to checkout a good breakfast spot.  Opened up the Yelp app","useful":1,"cool":0},"2BNH-8hcTzL0NopPtQEDZg":{"text":"Have always loved the mimosa double option. Every time we come there is a creative special","useful":0,"cool":0},"g6aDOo1OjOZL7VCgRlaagQ":{"text":"Awesome experience. I live here in Nola and I have passed this place a thousand times. I w","useful":0,"cool":0},"Zjmjw4lc1DdoXlKGRh-qtg":{"text":"Love this place the waitress Jasmine is the best ever. No matter how busy she was she made","useful":0,"cool":0},"wLOCGZXT310fx8yCkNNicQ":{"text":"my go to brunch plavce in nola! bright and airy with super friendly staff!! not stuffy or ","useful":0,"cool":0},"uKVDogm7T4O3NP3yXw2ljQ":{"text":"Came highly recommended and far and away exceeded expectations. What a fantastic meal. The","useful":0,"cool":0},"jo5mNBjGyPXSrjIhrvJ6jw":{"text":"worst pancakes ever but they serve a decent piece of ham with their egg plate.","useful":2,"cool":0},"73G2QG65Tn-aYmq0G5V-7Q":{"text":"Wish I could help you decide on what to order but everything is a safe bet. Sorry. The cat","useful":0,"cool":0},"Tm6lIaljsRqXzgZIJb0waA":{"text":"I've been coming down to Nola to visit a friend for a few years now. Each time she would t","useful":0,"cool":0},"Z-8i4lN36rsEHuMY6hV2Pg":{"text":"Hello Brunch! We hit up the Ruby Slipper after a late night on the town, and it was just w","useful":0,"cool":0},"XyGoRaqc75PGNuKdKv2yrg":{"text":"We had a large group and long wait but the food was fantastic and the drinks were strong. ","useful":0,"cool":0},"EZF-2jBKhUQvNnE6GmqNIw":{"text":"I love Ruby Slipper. The food never disappoints me. I usually get one of the French toast ","useful":0,"cool":0},"fqobsFWTvWo_makhEtxH1w":{"text":"We miss the old location on Cortez.  Admittedly it was small, but the atmosphere was so mu","useful":0,"cool":0},"bnr_Cz9EbS1PKpHONAkjXA":{"text":"DON'T eat at Ruby Slipper Cafe midcity. I LOVE enjoying Sunday brunch, am a foodie and am ","useful":1,"cool":0},"C-DWXcRbmqEmfvWDkrletg":{"text":"The shrimp and grits ( the very first item on the menu) was a complete disappointment. The","useful":0,"cool":0},"q5kZ4PO62mDA2C9rqfgB5w":{"text":"If this restaurant being only a few blocks from my home wasn't reason enough to frequently","useful":0,"cool":0},"pBkcc0zUFji8jiHq05cxEw":{"text":"Ruby Slippers is just \"Wow\". We travel a lot all over the US and the world, and few breakf","useful":2,"cool":0},"8aim8YFNobJvRaAyILDvIQ":{"text":"Diana was wonderful- food excellent as always- our favorite brunch place. New came butter ","useful":0,"cool":0},"DS41owVFCRIuXNs7MV79yQ":{"text":"Delicious food, great service, and wonderful atmosphere! \nWent on Easter Sunday and expect","useful":1,"cool":0},"_m56k2tpw0Gz39rMK-iZlQ":{"text":"I've been meaning to go here forever and finally had a friend drag my butt here recently s","useful":2,"cool":2},"nNr-XpZ4ptWg7Q1wXX_bDA":{"text":"Lovely place, lovely people. Delicious food. Fun and happy waitstaff. You will not be disa","useful":0,"cool":0},"nPtEXAFIdbTYYFfS3GFoVQ":{"text":"My husband and I ate here two days in as row, and the food was amazing: the eggs croquet, ","useful":0,"cool":0},"LqlJxzLygas6Wc7F4xsgWQ":{"text":"yes, please! \n\nokay, so i've really only been here once, so idk how much weight you should","useful":0,"cool":0},"PiNIgs2wqCr93fKIvWydwQ":{"text":"The only star the Ruby slipper is for the food, the food was good but the rest of the expe","useful":0,"cool":0},"ZsweDugteJlnbCTOxvNY_g":{"text":"Had the seasonal Stuffed French toast with apples and it was delicious. Had the peach Bell","useful":0,"cool":0},"B4RoJjciOyaecRLwQ1c1Zw":{"text":"It didn't really live up to the hype. I've had better brunch elsewhere.","useful":1,"cool":0},"Bjm0PXeV4NGzMXxIt0uFRw":{"text":"I love breakfast more than any other meal, and the Ruby Slipper is as good and original as","useful":3,"cool":0},"d3oNSj-JXgYhAXaEavYylA":{"text":"This is a great place for breakfast or brunch. Service is always fantastic. The OJ is fres","useful":0,"cool":0},"seXaUkNG8eoazu12Ysd4aA":{"text":"I arrived right before brunch so I was lucky enough to get a table. My waitress was very s","useful":0,"cool":0},"L70AunVJJwjDlpp8AVESQQ":{"text":"It was an hour wait but we used their app to put our name on their wait list.  An hour lat","useful":0,"cool":0},"oHPUL6y__Le7J9tUNMnM4g":{"text":"Awesome awesome awesome!!! I had the the Banana french toast w/ banana and rasin syrup. Tw","useful":1,"cool":0},"pprNHucI-R8exaaOcsPWlQ":{"text":"I love this place. I've been here eight or nine times, and though it's always crowded and ","useful":2,"cool":0},"7jvBnqa98ZJdpxy3ghGHpA":{"text":"I had the Costa Rico plate and it was just boring.  When you read about \"slow cooked beans","useful":0,"cool":0},"yUYYSo7pWGpm4Z_uMLNuYg":{"text":"This is by far one of the best breakfasts I've ever had. I had the Eggs Coubion, and a pan","useful":0,"cool":0},"MhneVFpMbGzDVJ2gD87k5w":{"text":"Another good trip to Ruby's. This time I ordered take-out for the office. \n\n+ I ordered ba","useful":0,"cool":0},"H0-JpuiU6rOIk21W8RQGNg":{"text":"Amazing breakfast/brunch spot! We've tried their mimosas, and they give you options of jui","useful":1,"cool":0},"6gq2Oamqaf6jxF7twrX1jQ":{"text":"This place is excellent! You can check in online and save your place in line until it's ti","useful":1,"cool":1},"OFUAiaZl4ui9RT2s1xXZBw":{"text":"All I have to say is pomegranate mimosas and MIGAS.\n\nBeing from Texas, I couldn't miss bre","useful":3,"cool":1},"wO9nG18-p3atbQE2V9FM9A":{"text":"Just came back from lunch here today. Service was great, we were seated quickly in the bac","useful":1,"cool":0},"J2PDjO0o6lv3CLzgKZd1XA":{"text":"Locals referred us here for brunch! \n\nIt was a cool yum place with delish French toast.\n\nT","useful":3,"cool":2},"qnz6meDkmPjWiwu5fSswNQ":{"text":"I've been this spot twice and each time I ordered a Bloody Mary and coffee. The first time","useful":0,"cool":0},"qyDZFFsCoDZI0tNKo8zN8w":{"text":"Excellent breakfast/brunch spot! The service was good, the menu has so many tasty options ","useful":1,"cool":1},"dytUrK-iBMjb3kOupoQsWA":{"text":"I wish there was a negative star option.... I am currently sitting here at the bar and the","useful":0,"cool":1},"wHJt8u2XJV694Dc4Cxw-1Q":{"text":"Fantastic!!! Always a great day when I can go to brunch here...friendly staff, amazing foo","useful":1,"cool":1},"yRunjao1lcR6cnoQEcfcWw":{"text":"Third time eating this week.My new favorite breakfast place. I ordered the Southern Breakf","useful":0,"cool":0},"9_8J5Vw3P6HCEzpI9De7Rw":{"text":"++++\n- The one in mid city had essentially no line\n\n+++\n- as usual in NO, shrimp and grits","useful":2,"cool":0},"a5YfU4Asn-MampxoPavBSg":{"text":"This place deserves a nod because it was one of the first of the truly unique new restaura","useful":3,"cool":1},"ItCygLfB7leucl5LIohe6g":{"text":"I really enjoyed the Ruby Slipper Cafe. We had excellent bloody mary's and delicious spike","useful":0,"cool":0},"dIaBsebKb1oL_JeLI-ZyRQ":{"text":"Pros:\n-delicious food that covers all tastebuds. \n-their food touches upon the local Louis","useful":0,"cool":0},"f8yGUXq47Y6lCtFnnt3vSg":{"text":"If you feel like venturing outside the tourist areas, this place is a wonderful find.  Foo","useful":0,"cool":0},"9ORTGzk1DPl_7ex9vG3UJg":{"text":"Amazing crabcake, no filler, just pure crab.  The hollaindaise was also very good, not gum","useful":1,"cool":0},"Bl4UbGUaBribZb4-XG8meQ":{"text":"Twice now my wife and I have enjoyed the breakfast/second breakfast tradition here in New ","useful":0,"cool":1},"v1JtqWmi36eyDuKwkyc00Q":{"text":"Let me start by saying that I really wanted to like this place. First, because I just love","useful":1,"cool":1},"-L6Qo1CYSRK2nCycfDnUIg":{"text":"Came here for Sunday breakfast with my wife on our last day of the trip and wish we came f","useful":1,"cool":0},"4fkLOci-WSfProvBudj2Yg":{"text":"Awesome lunch time menu...I enjoyed a great meal in a very friendly atmosphere. The place ","useful":1,"cool":1},"YkFaMeSipZN5PNcCVAMIIg":{"text":"The food is very appetizing! The food portions are large.  The drinks are luscious! \nThe s","useful":0,"cool":0},"Y1XVlXE_XCBw55PuSFFAOw":{"text":"Been going to Ruby Slipper in Mid City for the past year and while I have gone though most","useful":0,"cool":0},"3UkUG2PjXhtyjFk8K14F3g":{"text":"Looks like their menu changed a bit since I ate there but don't think you can go wrong wit","useful":0,"cool":0},"EtPyEq4F_yHvf1rNg-lkxg":{"text":"We just got back from a wonder lunch at Ruby Slipper. Reuben was big and delish. The servi","useful":0,"cool":0},"cNK_BLQlpwSovuvtF7CAnA":{"text":"I love The Ruby Slipper! Especially the Mid City location. Staff is ALWAYS friendly and th","useful":0,"cool":0},"0En6qF-Kl4uRyx0L0-XQXQ":{"text":"* Note - Both of  these experiences happened 2+ years ago.  \n\nI've been here twice, which ","useful":6,"cool":2},"ANbmWliEBKk3_kkSb03Xwg":{"text":"This place was the perfect ending to our NOLA trip. I ordered shrimp and grits for breakfa","useful":1,"cool":1},"89iXtl7avKV8Sv4pZ5_wVA":{"text":"Went here with Chad C. this week.  I was jonesing for pancakes- seriously.  \n\nThank god th","useful":1,"cool":0},"qx1UgPcDZcHzw82aH0Z3oQ":{"text":"We've been here two times in the past year and this place never disappoints! Great coffee,","useful":0,"cool":0},"GFreTeUcg31J37-FW3Ng7g":{"text":"Consistently fantastic! I've never had less than a wonderful experience. The food is delic","useful":0,"cool":0},"2CkPUHSnxdv8UrqL7l4-kA":{"text":"Oh my- the Batons! Everything you've had as a child gets wiped out with there cinnamon Fre","useful":1,"cool":1},"Kg92N5YGmfMvDBoRQ0sI3g":{"text":"Absolutely phenomenal breakfast and brunch. Always, always get their eggs benedict: big, b","useful":0,"cool":0},"ovAG-zq7G1G-mHZJVQ9iYQ":{"text":"Seriously.........5 Stars.  Does not matter what I order, everything is delicious.  I espe","useful":0,"cool":1},"cSzyLUm5w3F1zWQxa2U3Aw":{"text":"Admittedly biased, but this is a wonderful breakfast place. The benedicts are the reason t","useful":0,"cool":0},"EYS3Jg7cKq-ky6yr7ti1Rg":{"text":"Ruby Slipper in Mid-City is one of my all-time favorite weekend breakfast/brunch spots.  T","useful":4,"cool":0},"pSu5ZkIv_pQUIudQctARiw":{"text":"Get the Bananas Foster French toast! It's phenomenal and definitely enough to share. And I","useful":0,"cool":0},"JXcgxjs9Y90gln0bYvYYiA":{"text":"Diana was our server today - she was super! Anticipated our needs which - with 2 3-year-ol","useful":0,"cool":0},"ocITLFVxq5-qyu4ylS3Q6A":{"text":"eggs benedict...omg.  \n\nWent with some friends and experienced the drink specials (recomme","useful":1,"cool":0},"06pgJNspMqkT7Sz0X1QEXw":{"text":"We've been to the original location and loved it, but this was our first trip to the new M","useful":0,"cool":0},"xGjTzuBCFNQ7zf27LjMHNA":{"text":"Have been several times.  Love the Pom Mimosa's.  Awesome Chicken Salad.  Didn't care for ","useful":0,"cool":0},"JZTdBKjpYCRIhTI2OBDypQ":{"text":"This is an awesome breakfast place to come to. I was in town for vacation and the hotel ga","useful":2,"cool":1},"AI0JIVkOHC2Ja4S2_o1rog":{"text":"Food was great. The wait was a bit long but I'd expect them to be busy on Saturdays. I ord","useful":0,"cool":0},"WfB_X_kCDuQW-GP0t3pfCw":{"text":"Service: Excellent.\nFood: Also excellent. \nAtmosphere: Excellent.\nCoffee:  Most excellent.","useful":0,"cool":0},"Amew8nodZ4UA2jX0-itnsw":{"text":"Shrimp and grits were awesome but the worst pancakes I've ever had!! It took me 30 minutes","useful":0,"cool":0},"JclE1ISzeOD1WKh-jvYXTg":{"text":"Michael was the tits. Hilarious dude. Amazing brunch. Mimosas on point. Bennie on point to","useful":0,"cool":0},"zwpkMXkwIDlrKE5q2IMYIQ":{"text":"Recommendation made by a local so you will find no tourists on Cortez location. Food is am","useful":0,"cool":0},"kNCNvHH9GNLd5JZd_2i5SA":{"text":"Joining the waitlist via Yelp will save you! This Ruby Slipper location is a little more m","useful":0,"cool":0},"T-0XNdLlJO3hp4tCH7PqUQ":{"text":"A+ food and service. You'll never be disappointed. Creative, fresh options and portions th","useful":0,"cool":0},"8Jt4AdL4Do3DLylzsE9NfA":{"text":"Went on a Sunday morning was crowded and had to wait in line but got a seat in 10-15 minut","useful":0,"cool":0},"EjphhGUMKoT2YIuxk5OWYg":{"text":"My family had a great time here and we all enjoyed our food. Get a drink or some fresh squ","useful":0,"cool":0},"XlPvfJJYjc-xh_wcIIt9AQ":{"text":"I LOVE The Ruby Slipper! It was my first time at this location and the astatic and vibe ar","useful":0,"cool":0},"2JJtbDdI_Y7-_qYjezHTbA":{"text":"Best places to eat the best pancakes & French toast. I had the migs and shared some bacon ","useful":1,"cool":1},"_1EUUAJ8ndZ2bLS8sO-XXw":{"text":"I have never been to a breakfast place better than this. I entered the doors of heaven whe","useful":0,"cool":0},"u45LZWe7mwka5XA3u4YMZQ":{"text":"So so good. Nice place the service was excellent and the food was to die for. Wonderful pl","useful":0,"cool":0},"BILaA05Lii8lEZMOzGFGUg":{"text":"My husband and I went to this place on Harrah's recommendation. This place is DELICIOUS! M","useful":0,"cool":0},"fJDsqg6laqKatKmIwDcYmA":{"text":"LUV IT!!!\n\nOne of the best breakfast places in town!\n\nI've been there many, many times for","useful":0,"cool":0},"WajxCBSpTacOqNIp0P-aSw":{"text":"My experience was great. We arrive and given a table right away. The food was delicious. I","useful":0,"cool":0},"oJFOwdTzZDlkNRhAjDFh0Q":{"text":"How much do I love, love, LOVE Ruby Slipper? A lot! And it's within walking distance from ","useful":12,"cool":12},"vkJ_Zd1rcAkdjIaLCKHZ_Q":{"text":"Breakfast with Cameron as our server was amazing. Great service, worth the wait because th","useful":0,"cool":0},"YKT3u-0U9vnDopc3haZH3A":{"text":"We come to NOLA about 3 times a year and always make a point in coming. We haven't been in","useful":0,"cool":0},"W-EqIF2655N1w8ALlt8Mcg":{"text":"Love this place! Food is sooooo GOOD!  A must-so when we come to Nola!  Migas, Stuffed Fre","useful":0,"cool":0},"tGb_AIjnttiP_H4yc-vVKw":{"text":"This is in response to a recent review. The reviewer mentioned that a server's girlfriend ","useful":0,"cool":0},"bvgN4QGbADhCQq4Lf0WzBg":{"text":"Food was great. The wait was a bit long but I'd expect them to be busy on Saturdays. I ord","useful":0,"cool":0},"pG0qUfPob_EoAWUNPLqklQ":{"text":"Wow! I love breakfast....I have been missing out! \nTalk about good! Biscuits, eggs, bacon,","useful":1,"cool":1},"6a5ctrRVKLlfRTQ3aocuNQ":{"text":"Congratulations on your continued success! You went from opening one location on a rainy d","useful":0,"cool":0},"oPDbmodbR3ae-3V_J9j2DA":{"text":"A buddy of mine kept raving about this place, so my gf and I decided to give it a try one ","useful":5,"cool":0},"k3QE3zIgOq_6zBnRIHGxDg":{"text":"Walking distance from the AirBnB we were staying at during our visit to New Orleans, we de","useful":0,"cool":0},"HFDtnnSHvbJOToPn08MSLg":{"text":"SO WORTH THE WAIT. Went in on a Sunday afternoon at around 1:30 after walking there from o","useful":0,"cool":0},"UI3f2eEmOz_kVlxHl5RhZw":{"text":"It's not the best breakfast I've ever had in NOLA but it's good. The wait can be excruciat","useful":1,"cool":1},"_qMA3JiCNcUZ8beHjq3f4Q":{"text":"Boyfriend and I came here for brunch on the Friday of Mardi Gras weekend. The ambiance is ","useful":0,"cool":0},"MAzONH3Kyex-JbLkpz1EMg":{"text":"I will NEVER go back there again even though I have been there several times.  Yesterday I","useful":2,"cool":0},"6VhynFlzOUEzLLBDY9jJ4A":{"text":"My friends wanted to go to the Canal location but the parking was so bad. Just so happened","useful":0,"cool":0},"l1rLDl3i94wp0iAuWbhOcg":{"text":"As soon as we walked in from the time we left, we were impressed! We will for sure be retu","useful":0,"cool":0},"DnODgFADzOp_PWTLaL2EHQ":{"text":"This Is a neighborhood place about a block off Canal Street.  The Cajun shrimp and grits a","useful":1,"cool":0},"AM15bZFCb4CD8ef131Tibw":{"text":"Not a morning person but once you get me up I am up and hungry. Checked in thru yelp so th","useful":0,"cool":0},"S0Cg_a9J9uX2ZBDVHINU_g":{"text":"Be prepared to wait!!! This place is obviously doing something right when you have a long ","useful":1,"cool":1},"OhXrzyf31MoNAS1cFulB5Q":{"text":"Such good food and super sweet service!! The catfish breakfast was super delicious :)","useful":0,"cool":0},"Au67ODA3fvjTIEKSX344Fg":{"text":"This place is cute. Very cute. The staff is efficient and friendly. The first time I dined","useful":2,"cool":0},"aqgdCuSHeSSMrtummWNDbA":{"text":"Everything was amazing! I had mimosas along with the shrimp and grits with a big ole biscu","useful":1,"cool":1},"JpzRW2chVx8idXigv85Duw":{"text":"BBQ shrimp and grits was pretty terrible.  This surprised me because their BBQ shrimp blac","useful":2,"cool":0},"_YK3hWKXJkY9en-F-lLshw":{"text":"It was an enjoyable dining experience.Our waiter was attentive. We were seated immediately","useful":0,"cool":0},"mAoE5QsvRAbsk7AvnQG8dg":{"text":"Great breakfast place for friends and family.  Always has different specials that work wit","useful":0,"cool":0},"EMnW25DDf_m1Idr1wmuF6A":{"text":"This place was very good. It had a long wait yet it moved quickly.The hostess was very ful","useful":0,"cool":0},"LxRqv17OjDpaNEncygB1YQ":{"text":"Was very excited to go to the ruby slipper after rave reviews by my local friends, so I'm ","useful":0,"cool":0},"P5A_RSbDHjVNCA3KdKQtDg":{"text":"When we go here, there was a 45 min wait. After the wait was over, they moved very quick. ","useful":1,"cool":1},"zEf2jBCYqAxFkuT11ieTZA":{"text":"If you don't mind waiting during their weekend breakfast rush and being treated as though ","useful":9,"cool":1},"lzsxoZpXN9wZ3Xx8TQO_aA":{"text":"Food was good but *watch your bill*. Very disappointing was the waitress. My 10 year old s","useful":1,"cool":0},"8gXRsTOk4bcKoG3oywbZfw":{"text":"as per yooszh, the cocktails were great. i'd been to the uptown locāsh recently (which com","useful":1,"cool":1},"iXR2R-9ik9B3SetbEEapkg":{"text":"The trifecta was The BEST- the chorizo and shrimp was delicious! The pancake flight was al","useful":0,"cool":0},"MterR_drM5y2YHmxWAgGJw":{"text":"I opted to take an uber to this location because the one on canal had a 30 min wait. It wa","useful":0,"cool":0},"0qgRyuB_6iDieAQksNBVtQ":{"text":"Friendly staff but long wait time, highly recommend signing in online.\nHad the eggs Benedi","useful":0,"cool":0},"iY9GikCVZZfpr3oYrNuKvQ":{"text":"I absolutely love this place! If you're looking for a semi-high-end breakfast/brunch place","useful":0,"cool":0},"rTxtpNZomQCQF-_FwRywlw":{"text":"Dearest God! Hands down best brunch I've ever had!!!! I am ruined for life, can't wait til","useful":0,"cool":0},"cvux7vy9kKytwBfGdRYu9A":{"text":"Oh man! Great place for brunch! Go there! Try anything, it's good! We had iced coffees and","useful":0,"cool":0},"xLH2ISvDW24sO13EvdokrA":{"text":"We were so glad there was a Ruby Slipper right by our Airbnb in Mid-City. Came here on a S","useful":0,"cool":0},"E6Tn9K1wmTeGoDkXbR0oPw":{"text":"This location is small and quaint. I've eaten here a ton of times and took my family when ","useful":0,"cool":1},"ZVW-zsmwjqwmLVPnWO6_Dw":{"text":"Southern hospitality at its best. The staff was super accommodating for my party of 6. The","useful":1,"cool":1},"cwqlqDqGCID4SzHdbsmR0g":{"text":"This was our first breakfast in NOLA and it was great! Breakfast places seem to have weak ","useful":0,"cool":0},"3ZWYofRvpqrSaeC4WwTMWA":{"text":"Amazing delicious food. Friendly staff and fast service. An all around great place hands d","useful":1,"cool":1},"5n06ujg0SUIUGdlQFYtTLA":{"text":"This place stays packed. Everyone was very nice and understanding. Very accommodating, how","useful":3,"cool":1},"BqA5fK7mFqDmNUeSzdqFgw":{"text":"Best Bloody Mary in New Orleans. The Eggs Cochon are pretty fantastic as well. Solid brunc","useful":0,"cool":0},"0Oni5hCMQg6ywQij9-x1dQ":{"text":"The food here is phenomenal!  We had the bananas foster french toast, st Charles chicken, ","useful":2,"cool":2},"0XeYlPGM-_BXKHk8oFEwEw":{"text":"I ate at Ruby Slipper this morning. I ate at this one and the one on Decatur several times","useful":0,"cool":0},"dmbpAWq5YK0r8qEYTOo7PA":{"text":"Went and had a little weekday breakfast here today and, as usual, it was a good experience","useful":2,"cool":1},"BnoNqhRHxDjf7CfHpVSasQ":{"text":"This place was great! Coming from NYC this is all i expected from new orleans. The staff w","useful":0,"cool":0},"3xg2PrgcsTF3ZxSGSxNx_g":{"text":"I just got back from my first brunch trip, and Ruby Slipper Cafe filled me up and complete","useful":0,"cool":0},"lGkn6gLZPSU6-TjpBHnlxg":{"text":"Here for breakfast. Did not know there was parking in the rear. We are having barbecue shr","useful":0,"cool":0},"Bowxy2L5u0Qjf4lWz9uiDw":{"text":"The Breakfast is delicious... I had my bachelorette brunch there and I had a large group !","useful":0,"cool":0},"oYKzwJqhLifo1UBv2B_mbQ":{"text":"The food was amazing! Quick and good service. We had the chicken Benedict and cinnamon swi","useful":0,"cool":0},"Wsn7lDciGKypsQ5RzfkZpQ":{"text":"We waited 20 minutes because this place was bumping, but well worth the wait! Excellent fo","useful":1,"cool":1},"n__x0Oap1Xj_mVQH1PKg9Q":{"text":"Truly an amazing experience. \n\nPhenomenal food, great servers, awesome atmosphere.\n\nThe bi","useful":0,"cool":0},"1X2BEyJDf3lS_dmmJYPNYg":{"text":"This place has been more than just solid since they first opened on S. Cortez in Mid City.","useful":0,"cool":0},"G-7XFTP_WH4P25LVyuEAlA":{"text":"Food ok but NOT a neighborhood restaurant as the other places are around here.  They will ","useful":0,"cool":0},"40MRukwU-r3f0SDSJlHCNA":{"text":"If you are in NOLA this is the brunch place you should definitely hit up. The restaurant i","useful":1,"cool":0},"BhDjjJVnMNtbndPu3tSXIg":{"text":"Jessica was the best food was amazing wait time was worth it and very very clean environme","useful":0,"cool":0},"954DsSbIJMvQwoI8UmG_2g":{"text":"I love this location! Def my favorite I've ever been to, the staff is all so wonderful and","useful":0,"cool":0},"KJmvKCn70cPLlYzghUJq6Q":{"text":"Great atmosphere and great food. Wide variety of options but I have never been disappointe","useful":0,"cool":0},"0Rz1jz1kKY7U3YdcB01u4A":{"text":"The best part of our trip to New Orleans was doing our brunch here. Everything we ordered ","useful":0,"cool":0},"A_xfykyUJZGSQ2f7SNYE1g":{"text":"What a great hangover brunch place!\n\nMy friends and I were visiting from out of town and t","useful":0,"cool":0},"VhXeyyHrDOpy-T-aL5gFiA":{"text":"This is a pretty good place to have brunch in Nola. Not the first place I'd recommend to p","useful":0,"cool":0},"1mrqzmeaaEWP5UkMlsW-6g":{"text":"I truly love this place! The staff is always super friendly. The wait is long but worth it","useful":0,"cool":0},"1360pFxvFDave_FLcHdqzA":{"text":"Boy oh boy was the wait here crazy. Used the Yelp waitlist so I didn't have to wait long t","useful":0,"cool":0},"2vSOu8Odf9WKs_LMtcbHng":{"text":"It's amazing and the drinks were phenomenal. The Bloody Mary and peach Bellini were the be","useful":0,"cool":0},"KGKU-5nj3blFk3wFuwQe4w":{"text":"Awesome breakfast spot! Jess was a total sweetheart and food was amazing AF, took less tha","useful":0,"cool":0},"1KhPuqvHFI5WStm2xUg7cA":{"text":"We signed up thru yelp for our table,which was a great way to avoid having to wait too lon","useful":1,"cool":0},"rVkwttcpttg6N0o-_PTtNw":{"text":"I just went to Ruby Slipper on Broad, as I often do, and the wait time was 20-25 minutes f","useful":0,"cool":0},"ZsfyV99X-paSy7TST7g8fA":{"text":"We were staying at an Airbnb on S Cortez St so we walked over to this place to find a 45 m","useful":3,"cool":1},"VAKjFZxtW5e0E-jBxNJRdw":{"text":"Visited last Sunday during brunch. My friend asked the host to hold a seat for us. He reme","useful":4,"cool":1},"YYo8yUcenXGuRkquXlMRaw":{"text":"I hate to give it just 3 stars, but nothing here was THAT special. It really just feels li","useful":1,"cool":0},"0HjEyTvxqqQW_Odogkd12A":{"text":"My wife and wanted to come here for sometime now. It happened to work out this morning. I ","useful":0,"cool":0},"r37FLZVrJVyLQ5bhsHWBTw":{"text":"Amazing customer service and love the fact they are dog friendly. Quick seating when I add","useful":0,"cool":0},"_L0zJDjYbS7SNEtZ3QJpLw":{"text":"I absolutely live for the brunch at The Ruby Slipper. This restaurant is one of the first ","useful":3,"cool":3},"myM8YIRyculNzQ16iwbiZA":{"text":"I had come to New Orleans previously and tried to eat here, but the wait was way too long.","useful":0,"cool":0},"rOk6zIiTi5hfWq-OuhJJ5Q":{"text":"amazing service! our waitress, jessica, was the best. food was perfect too!!! definitely t","useful":0,"cool":0},"IuvTRgGzRb68uTbw_aW2Cg":{"text":"I want to start this review off with saying the u.s. is currently under a nationwide gover","useful":0,"cool":1},"KOISA_0fNsesCWDyg_L2Ug":{"text":"Friends and I have eaten at the Ruby Slipper three times, and every time the food was deli","useful":0,"cool":0},"8c-iojitdF4XxAbWbEt9Yg":{"text":"Review 2200! Yes. I have a problem.\n\nThis review is for the newly opened (less than a week","useful":7,"cool":5},"ovtOgP3ILIVoUprnk7b1CA":{"text":"TL;DR: Order the White Chocolate Banana Pudding pancakes (even if it costs you your flight","useful":0,"cool":0},"mtwV1goSu-ClhLTSMPuvag":{"text":"This is just a great place(s).  I haven't had a bad meal or experience.  I broke down and ","useful":0,"cool":0},"6AhqzbSW4jerfahId94xgQ":{"text":"First off, I want to thank The Ruby Slipper Cafe for taking care of Federal employees duri","useful":0,"cool":0},"P1c9MZHnMvV2ea9W_6JUWQ":{"text":"Always a fun atmosphere and great food at a Ruby Slipper Restaurant. The specials are inno","useful":0,"cool":0},"uj10UIo0LtOJ4Flsn2iywg":{"text":"I had the Trifecta to experience as much as I could during my visit. My only regret was th","useful":0,"cool":0},"s58yMWGph4TTQ-4C5V0kyA":{"text":"WOW! It is typically hard to impress me with breakfast/brunch restaurants; however, I was ","useful":0,"cool":0},"cziI0ZVE0bNshRd23zcZAQ":{"text":"I came here after a long night of drinking, and honestly, I was pretty disappointed. I ord","useful":0,"cool":0},"1b1KbeCZnV1OxHLYLg_RsA":{"text":"Had grits, a spinach omelette, fresh squeezed orange juice, and incredible bread pudding t","useful":0,"cool":0},"1gPh26GBBt14q1t79RKjig":{"text":"Too pricey for cold food... this was a constant issue at the old location that they brough","useful":1,"cool":0},"Lc3U8nNOHBsYZJ5-96mk_g":{"text":"During graduation weekend in NOLA we dropped in for brunch at The Ruby Slipper. After read","useful":0,"cool":0},"8Tn3rJKGBcFlqPufNdpeVA":{"text":"A great brunch spot. Going on a Tuesday we avoided the crowds, but I'm sure it's crazy on ","useful":0,"cool":0},"0kHa2Nbg1rUzdK93d0o1fg":{"text":"Great location for a hearty breakfast/lunch/brunch that's off the beaten path and easy on ","useful":2,"cool":1},"uLqZkRpxZstAVUkJiNbdaw":{"text":"I love  ruby slipper! The service is very good, they are attentive and constantly check on","useful":0,"cool":0},"XQcix_vZ9yQszEQwdLEEoQ":{"text":"This is the breakfast place in New Orleans. Plus they have great waiters. Jessica is proba","useful":0,"cool":0},"LFBEjGvlsZWVUskbh9woWw":{"text":"Had to wait a quite a while. 20 minutes for a table. 10 minutes to get a menu. The host co","useful":0,"cool":0},"ehmUfrY4X4xPJpUw1UV0YQ":{"text":"I was recommended by a friend to come here before leaving New Orleans, so I knew I had to ","useful":0,"cool":0},"VZrWGGxMuC0R5yHtMcyfvA":{"text":"We had a lovely brunch here. First I have to say parking was great. The service was fast a","useful":0,"cool":0},"JsC_QMWxDGhzEa-1DkoRrw":{"text":"Probably my favorite brunch spot in New Orleans. All around service and food is 100%. From","useful":0,"cool":0},"FyuIkaBHGS180WCDWWIPJg":{"text":"We had the southern breakfast and Louisianan Omelet. They were so delicious! Our waitress,","useful":0,"cool":0},"3vvgUHtIcWc5us-vqgJgSw":{"text":"We were staying in an Airbnb nearby and walked over on a Monday around 10:30. It's in the ","useful":0,"cool":1},"tniJK3xgtxBkAVoBgcMB8w":{"text":"Ugh, was not impressed. The service was great from when we walked into the door until we l","useful":0,"cool":0},"6oTbD6nDDWnggLlKT2TxlQ":{"text":"Amazing. A local urged me to give this place a try for breakfast and upon having this loca","useful":3,"cool":3},"URFr3DGEW2sVh4rVcCojKg":{"text":"This is the only place i go for breakfast when I'm in town. The service is amazing!! Every","useful":0,"cool":0},"J1CaRMSiat05oUdpcxFNZg":{"text":"Absolutely delicious!!!  The wait was quick because they have the outside bar for your con","useful":2,"cool":2},"ix-HlKDpnlLfNijlZ7o1HA":{"text":"The Broad Street has evened out the food and it now taste more like the old Cortez Street ","useful":0,"cool":0},"vExd9UAHsmglJs8tku2IoA":{"text":"Wonderful atmosphere & friendly wait staff. Food was terrific and it was the best way to s","useful":0,"cool":0},"h8RmT1C5v5DmfyF3UZm0Cg":{"text":"Amaaazing! I am not from New Orleans, but let me tell you. I highly recommend, I checked i","useful":0,"cool":0},"cEfxB47tsXqrvabIwXALPA":{"text":"I really do question myself of why the hell I delayed coming here... seriously. The breakf","useful":1,"cool":0},"OuMN93_-9CWw28v7iittDQ":{"text":"This location is very close to my house so I decided to go with my family. I ordered the P","useful":0,"cool":0},"Q9H0uIOE3B6YP3H3ADnPtg":{"text":"Waited 10 minutes for a table on a Saturday morning, so not bad at all! Server came right ","useful":0,"cool":0},"IdvWXxCwD2DVBLPhSktvwg":{"text":"Best brunch place I've been to in Nola so far! We got there on a Sunday at 11 am and waite","useful":2,"cool":0},"0bdHAjIfP0aABHaveMxfUA":{"text":"I bookmarked this place to make sure when I took my trip for Mardi Gras this would be one ","useful":0,"cool":0},"9O4XVaDS-5PVQ48Ax6st9Q":{"text":"When you're dealing with a table of 8 mostly hungover ladies on a stormy Saturday, and eve","useful":2,"cool":1},"zEhRZhKnhC6RlIVXokofHg":{"text":"Amazing environment, awesome service, delicious food as expected. I love the updates. Didn","useful":0,"cool":0},"GMfTGOgQkTrYQtPt38vL0Q":{"text":"I only recently moved into the neighborhood & so I was Googling around for a plain old gre","useful":1,"cool":0},"UnxbFH4chlEDm_ZtZHI50g":{"text":"I saw all the good reviews and decided to give it a shot. Food was very well presented, bu","useful":0,"cool":0},"-6CT5Aqa30sETKa-cTeMmg":{"text":"Delicious food and great service! A birthday celebration for our son in law and the King C","useful":0,"cool":0},"7NFM6glZ6mO915P8WdLDlw":{"text":"Love this place! I eat breakfast here at least twice a week. The wait staff are awesome an","useful":0,"cool":0},"MIFIw_-jsMuj0pT_w5tITQ":{"text":"Had a great time here with family! I was able to get a table without a wait on a Friday br","useful":0,"cool":0},"5Y_oaQl8d5YvxUxLve2wtA":{"text":"This was my first time dining here and it was such an amazing experience! Jessica went abo","useful":0,"cool":0},"oBGNh2N447xbQkDVS2CTWQ":{"text":"Presentations and atmosphere was amazing.  One request, more seasoning.  Didn't tase any s","useful":0,"cool":0},"4quBv2BPyPWf_KxSbzdhPw":{"text":"When we travel, we like to try different restaurants not chain restaurants and prefer mom-","useful":0,"cool":0},"6T9oe-lt4l8cdPTF-efIrg":{"text":"One of the best breakfast spots in the city. The chicken st Charles is a must try! I haven","useful":0,"cool":0},"_qPk6mAJKx8gPd1Tq-kD9w":{"text":"Their breakfast potatoes are AMAZING, but the pancakes suck. Overall, a wonderful little n","useful":0,"cool":0},"c7NFtgZJhK39jqaVxQuB1Q":{"text":"Ruby Slipper in one of my favorite breakfast places in New Orleans. I was thankful they ha","useful":2,"cool":2},"Vw6aSXKOpm1i2MAC_LWwzQ":{"text":"I got the eggs cochon- it really lived up to the hype and was a good amount of food. The c","useful":0,"cool":0},"xrzuRaGCXKsh8lA2yGYuuQ":{"text":"Cuteness!! This little chain is doing brunch right. Stop by for some boozy dranks, fried t","useful":0,"cool":0},"BaC0yrp_pfBjMSqHlezlMw":{"text":"Service was kind and extremely fast. I got a delicious iced cold brew, Bananas Foster Pain","useful":0,"cool":0},"Rj45bbbDv4BTS72zM5xJ8Q":{"text":"The energy and ambiance was amazing!! The food was OUTSTANDING and the waiter Roy, was SUP","useful":0,"cool":0},"3KSchk0uHGg3dT65HtDtDA":{"text":"The food is always super yummy but, today we had the best server. Jessica S was just the s","useful":0,"cool":0},"iyU69nwuUIF2JTQodSlkxA":{"text":"I came to the Ruby Slipper on Broad St for breakfast, but the host and hostess were very r","useful":0,"cool":0},"X7ikV15C480cTHZ18QmhiA":{"text":"We seriously had the best experience here. We were a large group, two people were sick and","useful":0,"cool":0},"eaq01t-ARi5fFvFfY__Zcg":{"text":"Pretty decent. Not the best brunch food I've ever had but I'd go again. Someone mentioned ","useful":0,"cool":0},"Lbdl_bC6WERUhwT99YY_hw":{"text":"Amazing food and, if possible, even more amazing service from Jessica! This was our last m","useful":0,"cool":0},"SUlMZI_5cMeFt1u21Zr5mA":{"text":"Touristy but a must visit in New Orleans! Their drinks are top notch, but be aware they ar","useful":0,"cool":0},"Jk6LdDYlGL7sJN9bA67zcA":{"text":"Had to wait a quite a while. 20 minutes for a table. 10 minutes to get a menu (not necessa","useful":0,"cool":0},"51B48w9vLq0KWVbnZeESPA":{"text":"What a gem!\n\nOnce again the Ruby Slipper blows me away.\n\nThis was our first visit the Broa","useful":12,"cool":11},"NcJVKuctOEuxLp92uMwZ_A":{"text":"The only time I missed ihop.\n\nThis is an expanding chain that offers nothing worth your mo","useful":1,"cool":0},"d2fB0yJdtEr8afjZAoCrpA":{"text":"If you're willing to wait a little bit to be seated and get your food, this place is amazi","useful":0,"cool":0},"jHAIFvFsxBQ8tueVv7R5lg":{"text":"This is one of my favorite places to go in the city, and to bring my visitors to. Besides ","useful":0,"cool":0},"3VBXMk5TPa8gIJ0n1biXYQ":{"text":"What a great place. The atmosphere was wonderful, the service was super attentive. But the","useful":0,"cool":0},"Usgs3jTIC9bKtE_OQYEndQ":{"text":"From the outside it looks like a office building. I tried to enter in the front. But the e","useful":0,"cool":0},"P4p9wXCTlTdP23PsOUVCVQ":{"text":"I had a \"build your own\" omelet with shrimp, mushroom, tomatoes, etc. It was pretty good a","useful":0,"cool":1},"fnqC2qn8W92_OiUm8NMsIQ":{"text":"Great food and great portions at this place I found after a quick search. The bacon was so","useful":0,"cool":0},"o-OOqHkWRvD9NunyvU1lBw":{"text":"S/O to the Ruby Sipper for holding down all the unemployed federal government employees.  ","useful":0,"cool":0},"Zd5Z8boBzy_C6mgIodx65g":{"text":"Excellent food, seated quickly, friendly service. An all around good choice. Ordered a hal","useful":1,"cool":1},"sMhOmW6DSNxn3WSI8HdqBQ":{"text":"Awesome, amazing, breathtaking, scrumptious, quaint, quirky, damn near perfect little brea","useful":13,"cool":8},"l5u7qR3nZeApPgPTWh1aVw":{"text":"Jessica displayed and upheld professionalism, expedient service, timeliness and kindness t","useful":0,"cool":0},"WWjiBzSiEbSgTKcdUKu6dA":{"text":"All the way from San Francisco to New Orleans, I can say this is some of the best food I'v","useful":0,"cool":0},"010mjZkiz3_T8qJO0vTayw":{"text":"Today, my family gathered here for brunch  after church.  The wait wasn't bad for our larg","useful":0,"cool":0},"QCoqFQzugs6iR0YL7uMqDQ":{"text":"First time eating here, bbq shrimp and grits was A1,\nCatfish strips mouth watering!!!! Ada","useful":0,"cool":0},"0E0Fmszx9xHF0xqria8guw":{"text":"Love this place! The brunch atmosphere is live but never a long wait. No matter what time ","useful":0,"cool":0},"zv9HPaBj13Y1QWnF_6e9AQ":{"text":"Loved having our last breakfast here at the end of our trip. We went to the one downtown b","useful":0,"cool":0},"SHmiD6UuS3vv2J3MuJ6YsQ":{"text":"AMAZING!!!! My friends and I traveled from NY for Essence festival and stumbled onto Ruby ","useful":0,"cool":0},"SKbol_ZaTHNWc6a83zh8FA":{"text":"By far and away the best breakfast in New Orleans. Great service nice restaurant amazing m","useful":0,"cool":0},"xWqoR_qVPmMUpZUvsCboXQ":{"text":"This NOLA originated place always has great food. It was even great to sign in ahead thru ","useful":0,"cool":0},"HXiOOD504OuaNKNkd3qwrw":{"text":"Love this place! Reasonable  prices, reliable, yummy food!\nIced tea, coffee and bloody Mar","useful":0,"cool":0},"5pt7HL8iYa_JcOrF2JYmaw":{"text":"Love the Migas dish. Really delicious. We waited over an hour today (Sunday), so as long a","useful":0,"cool":0},"Ca5yF3GT7lDzkSQrKQ2DLg":{"text":"My favorite brunch spot!! Best staff and fun atmosphere! Go sit at the bar and Jessica wil","useful":0,"cool":0},"56Tx_fIW-5MszGa2vHlQ1g":{"text":"The Ruby Slipper never disappoints!  And wow, they have the best mimosas!  Get there early","useful":0,"cool":0},"HzpnsI9wXHiP0Z6hBo2TFA":{"text":"Expect a long wait but the customer service is amazing the drinks are awesome. You have to","useful":0,"cool":0},"Orhz3sqtM5gIOBmZoZ5WSw":{"text":"Best brunch in town after a night out in the French Quarter! Hostess was behind, however t","useful":0,"cool":0},"HTL03VknVofxRU9gfEGUMw":{"text":"The best place ever!  Shot out to Ruby Slipper for taking care of all the government worke","useful":0,"cool":0},"OSQ_3cK70-90cZSZOlh9Aw":{"text":"OMG. Two words. Eggs Cochon. Go there, get it, and devour instantly. I was very skeptical ","useful":0,"cool":0},"YOCHP4SGq83BZ3bWKhmqaw":{"text":"Fantastic food! Friendly staff. The entire building is so anassuming. From the outside it ","useful":0,"cool":0},"VRN8IiBOl33yn6d5zumbag":{"text":"As far as places to go to get breakfast in New Orleans you really can't find a better plac","useful":0,"cool":0},"iQHDGSW_7a5F3Fsf9pV-fQ":{"text":"One of my favorite brunch/breakfast spots outside of the French Quarter.  Food is usually ","useful":1,"cool":0},"4QDLI_1IuRVhjFr_YKzGtA":{"text":"Breakfast was delicious! Lots of options for everyone. Jessica was our server and she was ","useful":0,"cool":0},"Au99Vd6FLLqYcMkwNykG4w":{"text":"I try to rectify poor experiences with the restaurant before I write a bad review. Unfortu","useful":0,"cool":0},"3fohsnkslarhpLmjsdYpcw":{"text":"Delicious breakfast. Friendly staff. Good service. Half price mimosas M-T. \nThe biscuits a","useful":0,"cool":0},"WvXReGk5AM5NMGHpty56NQ":{"text":"Had Bananas Fosters Pain Perdue. 5 star\nBBQ shrimp n grits. 4 star my Lady loves it\nthe da","useful":0,"cool":0},"pafa9MMG12TnQ4joqo7C5g":{"text":"Oh my goodness if you're considering this place for brunch, definitely go! The brunch opti","useful":0,"cool":0},"32wnlew-x7y-aagvevw4yw":{"text":"Chose this location because we figured it would be less crowded. The wait wasn't bad..abou","useful":0,"cool":0},"gJdOZ09MyNS0kc-rj9dgqA":{"text":"Food was amazing. Request Jessica to be your waitress. She doubles as the bartender. Our g","useful":0,"cool":0},"VkAOxx9e7X7gyA5PtFYOmg":{"text":"Brunch!\n\nThe bf's cousin took us here- and we were pretty excited because it had already b","useful":2,"cool":1},"Sioy2aju6vAEIxVPvbcAeg":{"text":"Great breakfast place. I had the Florentine omelet with grits and a biscuit. The omelet wa","useful":0,"cool":0},"8afIKfiYRTz5MifeuJ5oog":{"text":"So i am physically here and they told me it's a 60 min wait... mine you this is my first t","useful":0,"cool":0},"4FC6l-HJNqd5hQlRu9lopw":{"text":"I was told because they have a wait for dine in that I couldn't place an order to go. Didn","useful":0,"cool":0},"6EiYFZiBFpVlEzvrhb5Ugw":{"text":"We have been coming to the ruby slipper for years and have always loved it. The food is gr","useful":0,"cool":0},"qb5PZ5ctHpq3t5PQ28eY7w":{"text":"Jessica made the experience fun! Best service I've had at a restaurant in awhile! The Coch","useful":0,"cool":0},"4PTzHYi0vakNehZkSE0rSQ":{"text":"I used to live next door to this place and it was worth paying the over priced rent to be ","useful":0,"cool":0},"a4ZOV6PEhy66ExCHvhAeNw":{"text":"Such a great breakfast spot! We got lucky and walked right in but there was a line out the","useful":0,"cool":0},"Ic9HBTkawop47e27Gf8JIg":{"text":"I have came to this location multiple times because it's so good! Sadly today on October 5","useful":0,"cool":0},"_ipGHGYRszLxOGdtrm898w":{"text":"Delicious breakfast/brunch food and great service always. Worth the wait (small location).","useful":0,"cool":0},"NoPpEzqSfL-35AZ_qXUmkA":{"text":"Service was great food not so good! Nothing really had flavor. 1st and last time I go","useful":0,"cool":0},"Zp7mASy4VhtRjoAsiLq0pA":{"text":"That was amazing. Bananas foster French toast may be the best breakfast meal I have ever h","useful":0,"cool":0},"GlYCLz3P1uM7MFyklCDwmQ":{"text":"This place has been raved about and I finally tried it today. It was fine. I ordered the L","useful":1,"cool":1},"U-85Qwd1On40N_y3dHlhog":{"text":"Was a little skeptical on the bbq shrimp and grits but decided to try it anyway. Definitel","useful":0,"cool":0},"dPi5oaG9Ck27aS6CLB20zA":{"text":"Fantastic lil place with a great menu and feel. We stopped in on Friday before Endymion an","useful":0,"cool":0},"-QEi5jYFHb-1ZicypvDR8g":{"text":"You just can't go wrong here. Eggs Benedict any which way. Amazing specials and just good ","useful":0,"cool":0},"CsphFajz8UdnjqxCyoFPVg":{"text":"Consistently delicious!! Hands down the best breakfast/lunch/brunch in the city! Amazing s","useful":0,"cool":0},"sORBK0xZdKJQtSnFY4jDSw":{"text":"I'm not a 5 star reviewer normally, but Ruby Slipper Cafe certainly deserves it! Everythin","useful":1,"cool":0},"eX83-H_n-roafhiuqBPTZA":{"text":"Ruby Slipper delivered what I consider to be a top-5 brunch-of-all-time.  This little hole","useful":1,"cool":0},"o5FNL70FMlb1zb4X741qEg":{"text":"We went on a weekday right at the lunch hour and had zero wait, nice!\n\nI am a big fan of s","useful":0,"cool":0},"8K9ms8zAokv24dkufJdiTA":{"text":"Went for brunch at the new location. Irish iced coffee was good, could have used more whis","useful":0,"cool":0},"di1JVHPprYAAib35CdL5uQ":{"text":"This place is usually really good with the exception of today the cooks were off there gam","useful":0,"cool":0},"pOGiRWhMfywyzQmgj_l7dQ":{"text":"Excellent food, service and atmosphere. Recommend the croque madame. Wait shorter than exp","useful":0,"cool":0},"yCMiQb4GxCd7AjxRt_QZuA":{"text":"A great breakfast place!  Took the staff to breakfast this morning as a treat -- the food ","useful":0,"cool":0},"JbGGwJyYonNiJNsHNV1AuQ":{"text":"I adored this restaurant!\nGreat service and tasty vittle. We had breakfast on two separate","useful":0,"cool":0},"MX3xbToT1gSB9tnmCIdhaA":{"text":"Our group had been to this place a few times in the past week. Not a single person disappo","useful":0,"cool":0},"LjbzEuReD6sP-gxxScO4sA":{"text":"Ate there yesterday. Should have gone back! The salon beenie, AWESOME! The Bananas foster ","useful":0,"cool":0},"K_LqNOzlZE0E8ZrPNOYLbw":{"text":"OMG!!!! In town with friends for Essence Festival 2018. I have been here before but at a d","useful":0,"cool":0},"bc_RIbQSMdOPNqX-226oNw":{"text":"This is the second ruby slipper location that we've been to this week (tried the Canal St.","useful":0,"cool":0},"5eR2n-UCLp65kAQLQF3zEw":{"text":"This location has a bar for the solo folk, and quick access to dranks.  \n\nThe bartender wa","useful":4,"cool":2},"e0_dgthfrAhls9fhccj_aA":{"text":"Had the 3 little pigs and it was really good. My friend had the Costa Rican and she said i","useful":0,"cool":0},"oob0sP7nQLEetErqhQaO5Q":{"text":"We found everything to be just OK, not over-the-top special, but OK.  We had the Bananas F","useful":0,"cool":0},"NMlkzZfhEppYyuHpe91lww":{"text":"Been here twice so far, get here early and the wait isn't bad or get the no wait app! Food","useful":0,"cool":0},"BgtgLN49tCruLz6908vPzw":{"text":"Fabulous breakfasts. Shrimp omelette and migas with shrimp are outstanding. Service is ver","useful":0,"cool":0},"mhw6v4So2LHXNn6WiMogCg":{"text":"Hands down one of my favorite brunch spots in the city. The mid city location, while small","useful":0,"cool":0},"0NqwCQ2ICd28dqc42LrEJA":{"text":"How can anyone go wrong with breakfast? Ruby Slipper serves a simple enough menu which mak","useful":0,"cool":0},"e1e1YMuKl5ZWpgEFRKKpMg":{"text":"Totally delivered. Possibly the best breakfast I've had at a restaurant ever. The drinks w","useful":1,"cool":0},"65BK9yyxR6-wj5hdSTo7qA":{"text":"I was in town visiting family for the Thanksgiving Holidays and wanted to try something ne","useful":0,"cool":0},"DZBIV49mj_Dz8XcJw1Lthg":{"text":"Very southern and quaint little eatery in mid city nola! Me & my boyfriend visited this pl","useful":0,"cool":0},"MFAex1rzvI1SHNxG2-5htA":{"text":"While visiting New Orleans for the 2010 NAR Convention, my husband and I had breakfast at ","useful":0,"cool":0},"G2Ue7kJASgfzfNRW8iwGaQ":{"text":"We had a great experience here. We were seated at the bar immediately despite a packed hou","useful":0,"cool":0},"HgkNcACSOBoiHKcsUDRSsw":{"text":"Best breakfast I have ever had.  My friends and I all had breakfast and we all agreed it w","useful":1,"cool":0},"9BMbDIHgcRtqPLFrDJP-pw":{"text":"Really??? no one thinks the prices here are outrageous? What is it with these Mid City bre","useful":17,"cool":7},"VY3YkGRphnhtoGIIV_MBgg":{"text":"Both the food and service were great.  I visited this restaurant at the recommendation of ","useful":0,"cool":0},"L0bMl6UtmhoFg3NoA94ayw":{"text":"Wonderful experience this afternoon at the Ruby Slipper Cafe. The cafe was unusually busy ","useful":1,"cool":1},"q20RIykz7M3lqd_S_5fZVg":{"text":"As a native New Orleanian, this is the best breakfast in the city at the mid-range of pric","useful":0,"cool":0},"oGNO7pJ0FNbWjh-Ra_7D7w":{"text":"Tried the banana Foster and it was so good. Apple wood bacon was the highlight. There was ","useful":0,"cool":0},"Q2Buw4eGjEittVRbFCIamg":{"text":"Breakfast or Brunch is best. Love the chicken and waffles when they have it - probably the","useful":0,"cool":0},"wLzL5tP_LMTsdBP6GDHRLg":{"text":"Bananas foster french toast was better than, well, some really good things in this world ;","useful":0,"cool":0},"aPl8XJ70HT-xrhz6fbUNIQ":{"text":"We went today for brunch and will definitely be back. We first tried the Canal St location","useful":0,"cool":0},"WR5HRajca_IsVtbwZjvNFw":{"text":"If you like sweets for breakfast, get the Bananas Foster Pain Perdu. Seriously, it's delic","useful":0,"cool":0},"iNR6MOvnLWdTI8W_bbQGAQ":{"text":"One of my favorite breakfast items is Eggs Benedict and I jump at the chance when restaura","useful":0,"cool":0},"9OszV2dvO5bUqWYA8AOHXQ":{"text":"Service was great food came fast.  I ordered the BBQ shrimp and Grits, it was delicious, m","useful":0,"cool":0},"xpvm1Ja3zcCdhdZiVmJuug":{"text":"Oh my yum! A friend and I stopped in here on a (non-holiday) Monday morning around 9, and ","useful":1,"cool":0},"qCNjQ2l2gyx2jQMewqBedw":{"text":"Decadent breakfast!  Brought the whole family and my son said, \"This is the best place eve","useful":0,"cool":0},"5duCbHeWYTM0Gc-KMTrSBw":{"text":"New Orleans how I missed you!!!! And what a great way to start my trip than with a breakfa","useful":2,"cool":0},"6She8Vu4tw2sPi-4h40GcQ":{"text":"Wow wow and wowZ. I had the trifecta, the best Benedict was the corn beef hash, off the ch","useful":0,"cool":0},"0VgaeO94wBIIGGChTP4PLQ":{"text":"The Skinny migas is the best!! Love the new mid city location, parking, more space, and st","useful":1,"cool":1},"P7KbVkhkjsXL0xBYEhuTng":{"text":"We really enjoyed the food here. The service and staff was great. Reminds me of clam jumpe","useful":0,"cool":0},"S522bwtAdAJiFe4u8E0tFA":{"text":"So, I went with a co-worker last week, and here's my take of the place:\n\nPros:\nClean\nCutes","useful":4,"cool":3},"cSLbjyIBRxong-XKRjGJcg":{"text":"The No-Wait App is a joke, especially if it's not utilized by the staff. Our party added o","useful":1,"cool":0},"iv5thhEfPzjp4mmv0_BnEQ":{"text":"**Update** \nIn addition to the reply posted on my review, I received a really rude private","useful":33,"cool":4},"2CMxlADoW3x2OK70NKxNtQ":{"text":"Holy Toledo the fried chicken eggs Benedict with Tasso sauce! Treated myself with a birthd","useful":0,"cool":0},"3b9YLk6GTSmLZEk71KEqNg":{"text":"3.5 stars! Just because I don't give 5's and 4 is my way of saying perfect! The food was n","useful":0,"cool":0},"2B1SOgXPy5jxG-pUvdOH2g":{"text":"Field is a great server. This location is great. Quieter and cuter than the quarters. Food","useful":0,"cool":0},"6yJfhtJ5RqM_0g68WrTHzw":{"text":"I wanted to try this place since it's highly reccomended. Unfortunately,  it didn't live u","useful":0,"cool":0},"cUaay2wnBv6DE7NpvBkOTw":{"text":"Nice place to get a yummy breakfast in Mid City. It's not the biggest place, but the panca","useful":1,"cool":0},"iZQAeMxEAYnq-0Mc79fXnw":{"text":"It's been a couple of months and this place is still on my mind. My friends from NOLA reco","useful":0,"cool":0},"fpP409-lC2yh9NSEos6HnA":{"text":"Y'all want great brunch food, superior drinks and an amazing atmosphere ... well look no f","useful":0,"cool":0},"LlRN4pPUZWzYZSsrKMb6yg":{"text":"I went to breakfast this morning after working a 12 hour shift. We got the migas & Louisia","useful":0,"cool":0},"W2gXFrlQ62-8Xp364wqAxQ":{"text":"This was my worst NOLA dining experience in many years. I felt sympathy for our waitress. ","useful":0,"cool":0},"JzyvwbKKcKkF4ZGHktFGCg":{"text":"TF. There was a piece of bacon in my pancake.... and I'm vegetarian.... the potatoes took ","useful":1,"cool":0},"dNbCPt4DvEFhaNEtgBYtEw":{"text":"They have something called the St Charles Chicken that will make your head spin, along wit","useful":0,"cool":0},"V_kfZjegXLFNayob8e6A3A":{"text":"Not sure what all the hype is. total slop.\nWe eat out often and finally caved and tried it","useful":1,"cool":0},"GY9fU-LrDrjQrmHhjeIJ0g":{"text":"I cannot say enough about how much I love this place, and I couldn't disagree more with th","useful":0,"cool":0},"yel-BgS5B6io4170IBmCHA":{"text":"Even though I loved the old location, I always love the food at Ruby Slipper. This space i","useful":0,"cool":0},"4Ue06rVg0AViw4Y_Ay_Q9A":{"text":"Mediocrity at its most mediocre. This is probably the most overrated breakfast spot in New","useful":0,"cool":0},"hPc7i3c9UUz889Da29hipw":{"text":"Best breakfast in the city! Food is hot, fresh...and DELICIOUS.  The staff is friendly and","useful":0,"cool":0},"2PKVwG-9XOUIM0C46bHeUw":{"text":"Cute spot for Happy Hour and Brunch! Always super busy and you will have to wait a bit in ","useful":0,"cool":0},"jXSXh_OAAgSkT9GYaX9mGA":{"text":"Some of the best service I have ever had in New Orleans!! Good food and recommendation wer","useful":0,"cool":0},"K8kV0RAUjwQTAY8wjS2NLQ":{"text":"It was worth the hour wait!! The food was bomb ! From the eggs, grits, chicken n more !! E","useful":1,"cool":0},"3iVaO2BGDfgmz2nRw-_Y6A":{"text":"Went here while on vacation in NOLA, the food is amazing and the portions are huge, defini","useful":0,"cool":0},"I6mIvGLsKlZiPZ3bRdW3oA":{"text":"It was busy and crowded on Sunday at 1100, but using this web site to put our name on the ","useful":0,"cool":0},"r6kBoe2upEOSQtnSkmlO7Q":{"text":"Very impressed with this place. Every dish we have had here has been pretty darn perfect. ","useful":0,"cool":0},"Mfg9hgWoDwmsIffGNxv7MQ":{"text":"The Ruby Slipper is a cute little neighborhood breakfast place situated in Mid-City.  The ","useful":0,"cool":0},"qCTs0Emx5fO9QQYz83RUrQ":{"text":"Rudy Slipper food is wonderful the wait was very short I love the Chicken St.Charles so if","useful":0,"cool":0},"mzDm4Dh5dwR6vwXR_cn22Q":{"text":"Was just on vacation with a group of friends and this restaurant was close to our house. W","useful":0,"cool":0},"4_98rXtnHZDFXT52fbCO4g":{"text":"When looking for somewhere for breakfast we came across the Ruby Slipper. This location wa","useful":1,"cool":0},"MxszN1QDw7Gz7y8Teq2FfA":{"text":"Loved the food! Roy provided great service. Would definitely come back when I'm back in Ne","useful":0,"cool":0},"lB50jLTiGJuWwo4qLKfXtA":{"text":"Excellent in every way.....coffee was outstanding, food was excellent and the service spot","useful":0,"cool":0},"_HeDSpaJO8nssk9AQRioxg":{"text":"The amazing Benedict duo! Honestly, What you can also half see is the manager behind the c","useful":0,"cool":0},"WEvLvA7qSF-tzMFneSqS5Q":{"text":"I had a great experience here. When we arrived we had to wait 45 minutes for seating. They","useful":0,"cool":0},"bBkD8DDGLwQ0KtbejavLoA":{"text":"Just had the worst experience ever at Ruby Slipper on Broad . First , we waited patiently ","useful":0,"cool":0},"9M7C8WMUqEvEJVnR65up-w":{"text":"I solemnly swear to come here and any other Ruby Slipper location any chance that I can ge","useful":2,"cool":2},"I-oSd6a-d6qINo_o9PEYjA":{"text":"The food here is AMAZING. Those biscuits with the honey butter will change your life. The ","useful":2,"cool":1},"8lTvFljBhP1FHqVyO6sjEw":{"text":"Long wait, so long that we skipped it one day. But when we finally did make it inside on a","useful":1,"cool":1},"aediXTGAykUB66zgJFLBrA":{"text":"To start off, the service was horrible. We kept it simple ordering bacon, eggs, toast & pa","useful":0,"cool":0},"XSIfz_UzK_G-WoSiyuOX4g":{"text":"Amazing breakfast we enjoyed it so much we came here twice during our stay for breakfast. ","useful":0,"cool":0},"uKXMfBy_buyZS_M_Rq7dHg":{"text":"It was good, fast friendly service. The biscuits are amazing!!!! We had the two famous Ben","useful":0,"cool":0},"9AYb_QcrsInGHLbI4k0yhQ":{"text":"I always have an amazing time here. The service is incredible and the food never disappoin","useful":0,"cool":0},"CRjc12YV9k93-yu-dpgE9A":{"text":"The hype is deff not reality, there's so much potential in this restaurant but food is bla","useful":0,"cool":1},"XYGpvZhcvWW2l73cxMz5Ew":{"text":"Yum yum yum! We came here for brunch on a Monday and it was pretty crowded. It's first com","useful":0,"cool":0},"7jGkvUd_EacxuQaT-rnG3Q":{"text":"Nice atmosphere, mostly friendly staff. Trendy. \nVisited the place twice. First day the wa","useful":0,"cool":0},"WF244Q-jhmI2IRWJdWP0Hw":{"text":"Big portions, big flavors and a small price tag. Skip the coffee its weak, but get the St.","useful":0,"cool":0},"WGXuQdqtKXw5XV_W-uMBeA":{"text":"We love Ruby Slipper on Broad.  The food is delicious and they accommodate our kids!  High","useful":0,"cool":0},"tPUN9iWeEiBcPWzrFWgLRw":{"text":"This is my new favorite place!!! I had the chicken st charles, and my mom had the Spanish ","useful":0,"cool":0},"zZN8JR_vSWw39J6dwnRRgg":{"text":"Went here for our final breakfast during our stay in NO.  Breakfast was solid. Had the chi","useful":0,"cool":0},"i68daY_qdMvlJr0PAfTCSw":{"text":"This place made me mad.\n\nIt made me mad because how are you gonna make French Toast that i","useful":1,"cool":1},"3jyf4qKy-J7O18lx2C_Yvg":{"text":"The bacon infused bloody mary is a must! We went to both locations and both were equally d","useful":0,"cool":0},"FC_xwfRx2fIsUsTXnaLUmg":{"text":"Great environment and food was actually pretty good. Sat on the patio and had a very nice ","useful":0,"cool":0},"p2-eCAJI_6DKKhLwbmvtQg":{"text":"Our first time in New Orleans and Mary Jane made us feel right at home. She was so welcomi","useful":0,"cool":0},"8hUikJyZSOBr8a0pn8UVbg":{"text":"Pretty broad food selection. Our waiter was Roy, and we had the best service! I plan on co","useful":0,"cool":0},"GsWkDdgXKBD8HBCnbBg1Ig":{"text":"Ruby Slipper is a chain across NOLA, bolstered with uncharacteristically high scores in th","useful":1,"cool":0},"TSYaHpYISWSHx0WF4mtGcw":{"text":"We went to the ruby slipper for breakfast. started with the pomegranate mimosa & French ic","useful":0,"cool":0},"ly9JqzDkRRpTqZIHQZNIbA":{"text":"I love eating at ruby Slipper but when friends invited me with a group of 35 I was a tad h","useful":0,"cool":0},"7vVfx3RlNDaB3c7BVdP-Yg":{"text":"We checked in online on our walk over from our Airbnb. Definitely recommend the online che","useful":0,"cool":0},"MQvr8R2ljABK3DATUOZAxg":{"text":"Very crowded and cramped dining area. Do not eat here if you can't handle being bumped by ","useful":1,"cool":0},"jrQZt4fcgi4nQexV62eb_w":{"text":"Oh my gosh!!! The food here was amazing. I had the salmon omelet with cheesy grits. I've n","useful":0,"cool":0},"gajnzc7ZvaDxZrxNhA63Ww":{"text":"They've become too much of a chain breakfast restaurant. Their chicken biscuit is amongst ","useful":0,"cool":0},"Z-43uQZ22UIANcWLOMHZcg":{"text":"This place is worth the wait but that's not needed with there call ahead service that will","useful":3,"cool":2},"L8airW161smPAemWWQ1bBQ":{"text":"Long wait!! It was almost 3 hours from the time we got put in the waitlist to the time we ","useful":0,"cool":0},"e1XRiPylS7m1Dw9IP1m50A":{"text":"Great brunch with a long wait.\n\nBut, worth the wait.\n\nCharming interior, friendly staff, a","useful":2,"cool":2},"3n8ahU1yX0j3N8jJpSMMvg":{"text":"Great food and service. The place was very clean!  My husband is not an eggs person and th","useful":0,"cool":0},"Fs_s9Sr1n9uERW-WUhVB0Q":{"text":"I only go to Ruby Slipper on a weekday. Forget about the weekends! This place def get busy","useful":0,"cool":0},"kThG7KSU6cy-hAZa86JcYg":{"text":"The waitress was sweet and knew what she was talking about. I asked her for her favorite b","useful":1,"cool":0},"TLrlhtgq2ebr32QzI5sXeQ":{"text":"The service was wonderful, the pancakes...I'll take a table full! There were several Bened","useful":0,"cool":0},"uJKnxb-jSoyvEqFx-fn3Ow":{"text":"Amazing place to sit down, relax, and eat some great food...Our server Jessica was simply ","useful":0,"cool":0},"dZNOmLYL3WwNJwnEmNKkyg":{"text":"First week of Phase 1 COVID precautions and I was super impressed with the Ruby Slipper's ","useful":2,"cool":0},"-f4oGaOsrnhpRDDr17XPcg":{"text":"Love the food. Love the waitstaff.  Aggravating all the flies yall let in by leaving the f","useful":0,"cool":0},"bmk2wjGEssfjDJpU-rhmfA":{"text":"Local Review: Went to Ruby Slipper for a late breakfast. We were starving so anything shou","useful":3,"cool":2},"cpeTRHhP84bM72Pe_x2frw":{"text":"Absolutely you have to get here for brunch. Find Jessica S. And ask her what to order. She","useful":0,"cool":1},"l7SsbkvvZB7HpgpZH1rm5A":{"text":"The wait is always horrible. I could stand waiting for a long period of time if the servic","useful":0,"cool":0},"-gXwcdveHlUGkhGh8h1Dow":{"text":"The reason for the 4 stars is simply because of the Hostess being on of the rudest unpleas","useful":0,"cool":0},"dUZ0FEN8oGbtiG7UlBQdLA":{"text":"I'm definitely disappointed with this location. I ordered the French Toast Bites and Bacon","useful":0,"cool":1},"N2Qs5qPFjbZNDRb9fzn1eA":{"text":"After visiting Another Broken Egg I was craving another great breakfast meal. I've had the","useful":0,"cool":0},"AT97y4XJ5l0vJdKpP69ueg":{"text":"this place is phenomenal. the service was amazing. i wish i remembered their names but lit","useful":0,"cool":0},"ri6TMDXU9KenadVVjo8Vww":{"text":"What a gem! Monday morning we walked in (1-2 min wait) and were seated. Our server was abs","useful":0,"cool":0},"9bjClCwh7BOglc2prMuE4w":{"text":"Pros\nMenu Choices\nTaste of Food\nAtmosphere\n\nCons\nCustomer Traffic\nLocations\nInside Space\n\n","useful":3,"cool":2},"7_FYkoYf37R_dd2PmMbRBg":{"text":"I love this location of the Ruby Slipper the best for atmosphere and service. It is family","useful":0,"cool":0},"WZSFBeWQGILd11PwufJFNg":{"text":"Meh. Ruby red slipper is just okay breakfast in my opinion. We've been here multiple times","useful":1,"cool":0},"H4G5TT2tfdoluBYJ6WbcJg":{"text":"We celebrated 3 birthdays yesterday and I chose this little gem. Not a gem anymore. I have","useful":0,"cool":0},"x-l6whLXCBIA12XiLCyQAQ":{"text":"Our server Sandi was a doll, she was concerned and polite. Food was delicious but they sho","useful":0,"cool":0},"ntb8ejMGV7vcwRAWsH-VHw":{"text":"From the outside it looks like a office building. I tried to enter in the front. But the e","useful":0,"cool":0},"hyprkukgpYg0NcPefmxGtA":{"text":"Initially, I was annoyed because they separated us into two groups and left one person wit","useful":0,"cool":0},"ROtj9ZOspcgivZTsf6rz4A":{"text":"This is a great breakfast spot. The food was delicious and the staff at the bar was awesom","useful":0,"cool":0},"NfhGCpDgA5V89SlpfQwsjw":{"text":"Jerry (the manager) and Ashley (waiter) were fantastic. I had the Morning Margarita and th","useful":0,"cool":0},"fG9QJ_a4VcStpjlVPtvT3A":{"text":"Definitely a place to try if you're into breakfast. They always have unique daily specials","useful":3,"cool":2},"S4cQNHS7w0SufkBhcPFEFg":{"text":"We love Ruby Slipper in all its iterations and locations. And we love the whole success st","useful":0,"cool":0},"GIERgfwLCZnGsfTxQtbU8A":{"text":"I went during one of the busiest times for the city--The Essence Music Festival!  The serv","useful":0,"cool":0},"U8Rqq9IF0ppfoMPW1UtSGQ":{"text":"Our waitress was amazing. She was extremely nice and was funny too, very personable. The f","useful":0,"cool":0},"ocf-_Z5P1Cr7oPP5rJwMoA":{"text":"Outstanding breakfast place, very unique menu. The usual morning libations (Bloody Mary's ","useful":0,"cool":0},"stNrCFSf-rAagrQG5O_Kcw":{"text":"I'm so glad I visited this cafe on my last day in Nola. Initially, I wanted brunch but I w","useful":0,"cool":1},"4Sl3U999F56GQLfT8A5dDQ":{"text":"What a beautiful establishment. The out of site setup allows for a more quiet cozy dining ","useful":3,"cool":0},"rizQogYXz1Ib7imLYrPclQ":{"text":"Great restaurant. We decided to go because it was located near where we were staying. It w","useful":0,"cool":0},"HANNQMndDQv2969v8i9Erg":{"text":"Order take-out of pancakes, french toast, and breakfast tacos. LOVED the food. It was hot ","useful":0,"cool":0},"WTGh6qw7bZDOC_lYlxiJoQ":{"text":"YUMMY! Came here with friends and had an awesome brunch! Mimosas were great and the bbq sh","useful":0,"cool":0},"g9yCHr_kVGPjDUwbX-QW2g":{"text":"DO NOT GO HERE IF YOU HAVE ALLERGIES. We ordered just pancakes, wrote on the ticket allerg","useful":0,"cool":0},"sYnAsDeNqX76oz2GrW-fOw":{"text":"Food was just OK, so was the service. \n\nThere is a parking lot around the back so that you","useful":1,"cool":0},"96cWk1HtV6KmQtsohcfF1g":{"text":"My daughter and I were hungry. We tried to get food at the RS Cafe Metairie location and w","useful":0,"cool":0},"0FPd8yiroeGuGXRlIyVlWQ":{"text":"This restaurant was awesome baby and our waitress Rhaina was all that and more. Traveling ","useful":0,"cool":0},"aNAbl7jLSIQ5IDHqrlZMdg":{"text":"This place the worst service EVER and the manager doesn't make anything better either our ","useful":0,"cool":0},"agzDHJP_g4q-guj9-P-G6w":{"text":"It took a while before our waitress Charlotte got to us to take our order but she made up ","useful":0,"cool":0},"_sSUlMJXjOxzu3YC2kwpOA":{"text":"So today was my very first visit and my server was Kyle! He was absolutely amazing!!! He g","useful":0,"cool":0},"QPenT8z9m-6olGjEriPnvQ":{"text":"The food here was so good!  So many creative options to choose from! The wait though they ","useful":0,"cool":0},"XkrpNFLrWDOrLSTQnMPKoA":{"text":"Was searching for a great brunch spot in Nola and came across Ruby Slipper. Was apprehensi","useful":0,"cool":0},"34RZI541N-pSLScbZQXRnA":{"text":"This was our first time at this restaurant. The food was fresh and very tasty. We sat outs","useful":0,"cool":0},"sJr1gEe6kBw3p2dvLDFKbg":{"text":"Not the same as before. Went on memorial day and although our server was nice they are obv","useful":1,"cool":0},"adMcFNqYuk73UtzoQINhKA":{"text":"This is our go to location for brunch. The wait can sometimes be an issue but once you are","useful":5,"cool":2},"lxR2z4ttHDZtlLCoK3TNWA":{"text":"My friend recommended we head over for brunch while we were in town.  I ALWAYS expect to w","useful":1,"cool":0},"xidsVI__BfJ1UmPC1wbRcg":{"text":"Great place for breakfast, absolutely everything on the menu is good. May require a wait b","useful":1,"cool":1},"i5zsdE94ymysCn7MQzfItg":{"text":"This is the second location that I have had the opportunity to visit and the quality is co","useful":0,"cool":0},"7JJMj60F0ucTUrute6IR9Q":{"text":"Let's start with of all the food I ate on this trip, this was the bestest of the best. I a","useful":2,"cool":0},"WZHtHefwkObIUek6puj4pg":{"text":"Came here on a beautiful windy Saturday morning and it was packed (10:45). I recommend joi","useful":0,"cool":0},"6yc2l1VPvJyYNpafYeIqCw":{"text":"The parking was a little difficult to find while following the GPS. \nWe were greeted by a ","useful":0,"cool":0},"6vDCRTqSoJtIZ1HamwwQHA":{"text":"My cousin recommended this place so when a group of us went to NOLA we had to try it. It w","useful":3,"cool":1},"lnfUyjBN0vWwuP2DLgx_Fg":{"text":"This was my second time going to this location. I was excited because when I first visited","useful":0,"cool":0},"N6Kodxte9Z2qkwcKjZI6xw":{"text":"Wonderful brunch this morning. Speedy service and polite staff. Felt very safe and clean!","useful":0,"cool":0},"cEmNOMgfFUUuVKmGxRonwg":{"text":"Everyyyyyone told me to come to Ruby Slipper Cafe when I came back to visit NOLA once more","useful":1,"cool":1},"HY30Aosbf908ru2OdY0Rcg":{"text":"Jessica S makes the experience all worth the while. Jessica hour!! We dragged our sorry bu","useful":1,"cool":1},"R469rCKm0leyrcz5QMjtTg":{"text":"Great outdoor seating area. We appreciated the tent for the shade. Wonderful service (than","useful":0,"cool":0},"klO8XM5Nfv8YDerXS0j4Nw":{"text":"Wait was a little long but I can understand since it's Mother's Day.  Food was hot and goo","useful":0,"cool":0},"CWxvK9-coFr8imyTZWIqaQ":{"text":"Awesome place to celebrate Fathers Day. Great food and great service. Recommend shrimp and","useful":0,"cool":0},"w4hAQLkx260iVgk4sJ8Q8w":{"text":"There is a reason you will wait for a table any time on the weekends. Not only is the food","useful":0,"cool":0},"n3o2Kd43Ru1NUwKcHWvefA":{"text":"When you're a tourist and you go to the same place twice in the same week, with so many ch","useful":0,"cool":0},"64nq2fBBxdpKEkDF88I4sQ":{"text":"GOOD-GREAT-AND BETTER \n\nthis place is so spectacular I wish I could eat breakfast here eve","useful":0,"cool":0},"U92ZZZ4bKZp4IIc_nOf2Iw":{"text":"This was our first time at this restaurant. The food the fresh and very tasty. We sat outs","useful":0,"cool":0},"V_PQHrIqK0L8Xz0kDbw0Ow":{"text":"I recently moved to New Orleans and discovered this place by accident. I have been to this","useful":0,"cool":0},"Bc1iz4Z_rmNH44TdZcPFDg":{"text":"If you like eggs Benedict, Ruby Slipper is the perfect place for you! Their chicken St Cha","useful":0,"cool":0},"ENouosnUyhyGRkpdKOLVSw":{"text":"So glad we tried this place! The staff was amazing. Food was delicious. And you can't beat","useful":0,"cool":0},"2CU_3OHyIqEsEKjnY1sShg":{"text":"We had a great experience and will return, loved the service, food and staff was experienc","useful":0,"cool":0},"1uIGftha67r2pK0QNstksQ":{"text":"I was looking forward to having brunch at the Ruby Slipper. This morning was a true disapp","useful":0,"cool":0},"IGKOO_mYeIJXpXQ-C04PbQ":{"text":"Happy Birthday Ravon! The Portobello, feta and spinach omelet to die for! Sorry folks, it ","useful":2,"cool":1},"fHn4GzaWELLLTxpCR2U4bw":{"text":"My family and I came here for breakfast and we had a great experience. The ambiance was la","useful":1,"cool":0},"85PXN3MQOR144Ykcru9DEw":{"text":"I consider myself to be quite the brunch connoisseur, and Ruby Slipper Cafe was the PERFEC","useful":1,"cool":1},"kwdpfCq_odtrfCmKgWJtog":{"text":"My sister and I just had a late lunch here today. Charlotte was our waitress....what an ab","useful":0,"cool":0},"Lp0fnnIIqPL2VnfF05h83Q":{"text":"This has been my most delicious tasting breakfast experience so far on my trip.  WOW! I st","useful":0,"cool":0},"vwidyoWeP7G0T20XR41ScQ":{"text":"We took our friends from out of state here for their last breakfast in town. I loved that ","useful":1,"cool":0},"a5jGxfDHGO4bAOc_EML7yQ":{"text":"Food was amazing, so many options, took forever to decide. The only thing better than the ","useful":0,"cool":0},"5xU0LQN1zqqGnX2PsiOBZg":{"text":"Used to be really good, but they have really overexpanded and the food quality went way do","useful":0,"cool":0},"XJYerVVqBIpX277fpDZRxg":{"text":"I  enjoyed Ruby Slipper. I came for brunch with my husband. I was ready to try that bloody","useful":3,"cool":3},"9m9WeEtbcSCCx250TnO-Xw":{"text":"Came here two days in a row, back-to-back for brunch and it was phenomenal both times. The","useful":1,"cool":1},"kEoZlm5FntysbFcdyaVH2g":{"text":"Came here at 11am on a Saturday morning & the wait for 2 was an hour, which we thought wou","useful":0,"cool":0},"ze23OjRMPmc0ExTyn9psYw":{"text":"Best brunch in NOLA!! Food and drinks are always on point!! You have to try the Eggs Cocho","useful":0,"cool":0},"6J5NTpL-O5-4R_GTtk9ofg":{"text":"Ate really good here. Heard a lot and finally went. Handsome waiters. Food was presented w","useful":0,"cool":0},"YsLpp7LOMbD-hZ0xdnUZmg":{"text":"Great place but they really need a door from the kitchen to the outside section so the ser","useful":0,"cool":0},"f1PVS6CWV7NhgTmdgqboPA":{"text":"Broad St. advertises that they close at 3:00 on Sunday. Told us that they stop seating at ","useful":0,"cool":0},"NDsbBnp3I7U1K2fS-h-Uxw":{"text":"We went to the Broad st. location. I service and meal was perfect. They accommodate us wit","useful":0,"cool":0},"2D-sYmhMKE9Bh0-dBDqGdw":{"text":"My family and I came down for Mardi Gras weekend and we were looking for an authentic meal","useful":0,"cool":0},"xIBOueZDLfN3mXvCmvksWA":{"text":"Visiting from Los Angeles, my girl friend and I wanted to try something original.  A ten m","useful":0,"cool":0},"HV5TvA_S7pC_fnLczsk4XQ":{"text":"This is my favorite place to eat breakfast in the world thus far. All flavors of eggs Bene","useful":2,"cool":1},"VVsgZ1t07ezCmNhykfA1rw":{"text":"We've been here at least a half-dozen times since they opened and we've never had to wait ","useful":2,"cool":0},"TNod1t33zpHQ-XjcHs1sGw":{"text":"Yum! Ruby Slipper is delicious and they have a lot of menu items. I recommend adding yours","useful":1,"cool":0},"Xz-UIFH-tZAfUeUCKUPHtg":{"text":"I came here today for brunch to celebrate my boyfriend's mother's birthday. The food was d","useful":11,"cool":7},"xRJFz_iZb5eVYEe-8sVmsQ":{"text":"Went here for brunch 2 weeks ago on a girls trip. We enjoyed the food so much that we retu","useful":0,"cool":0},"sTzG3pFYrHmf8tIq-UUrEA":{"text":"Diana D. Was a great waitress! She took good care of us and gave us great food recommendat","useful":0,"cool":0},"t1_epYyKrZLaRi1LNVglGg":{"text":"Came by here for brunch with a large group of friends. They were very friendly and accommo","useful":0,"cool":0},"8gjXdRPPwGp7Rk28v1ILQQ":{"text":"Thanks for the great food! Restaurant doing well during covid. Everyone very kind too.","useful":0,"cool":0},"QkHazv8NWFz8jS650DcPYA":{"text":"First meal in NOLA, and our friends and hosts took us to this cute, little restaurant to t","useful":0,"cool":1},"a0tF4OmamDSn1No0XhePJQ":{"text":"Pretty good food. Waiting is a horrible. But we sat outside and drank their mimosas. It wa","useful":0,"cool":0},"G62RRzs3a-CY0IPrtJDomA":{"text":"Ms. Charlotte was absolutely amazing!! \nShe has the best customer service ever! \nShe helpe","useful":0,"cool":0},"GRqmiwg4SbKyDGxkB0mYzw":{"text":"Omg if I could give them more than five stars I would. I was in NOLA visiting on a girls t","useful":0,"cool":0},"2xOVk6Df3v7HFQ_vddUe2w":{"text":"Edit* (1/19/20) \nUpon moving to Broad St they immediately became my favorite location.\n\nI ","useful":10,"cool":9},"F8ta8KvdWmGvdtcIZ0BZvQ":{"text":"Came here with a local so I had high expectations. Three of the four of us ordered off the","useful":1,"cool":1},"anI9bgXHRubZBSn-DaSnkw":{"text":"Tasty fresh food and it's worth the wait!  We went during lunch time on Saturday.  We got ","useful":1,"cool":1},"4TmKOYyanHdgVkyVwiWctw":{"text":"The Ruby Slipper did not disappoint. I felt very comfortable with the social distancing. T","useful":0,"cool":1},"H5acMsgHgoztCqgcoE9i1Q":{"text":"Our server was Destiny and she was so friendly!  I had the Southern Breakfast and my husba","useful":1,"cool":0},"AlbbpnvWuJkr060IpPuTLg":{"text":"I ordered from this place on Ubereats as I didn't feel like leaving my hotel. I ordered th","useful":1,"cool":2},"uv_fSgfgRNa4HKVx5x2vSQ":{"text":"If you have a sweet tooth, this dish is for you! I ordered the \"Sweet Heat Chicken and Fre","useful":0,"cool":0},"tJZpm2nPykKE8u8otp1gQA":{"text":"The Food is Luke warm, the service is scarce, definitely in need of knowledgeable waitress","useful":0,"cool":0},"AgkuTFwNdw8w4-oJ7HokCg":{"text":"I'm wary that any restaurant with seven locations within a 5-mile radius could feel like a","useful":1,"cool":2},"KBFhYfD6GU1j41MGDUlAXw":{"text":"One of my favourite spots for breakfast/brunch in the city! Huge portions and great tastin","useful":0,"cool":1},"UaTvbkL0d1NvVKDGcWnt0g":{"text":"I am a huge fan of Ruby Slipper. But not this location. I usually go to the Marigny locati","useful":0,"cool":1},"x_fendtwPrNg9NZTZd7crA":{"text":"Legendary. Eat here!!! Perfect Benedicts, great coffee, great service - a must-visit in NO","useful":0,"cool":0},"h8wiRAKSN_zZEZkMis0ERw":{"text":"I finally managed to get to the Ruby Slipper Cafe in Mid-City early one afternoon & althou","useful":3,"cool":1},"l2KSBmhYZfQFJU4dNaTcrw":{"text":"This is the perfect breakfast/brunch spot! Their boozie coffee was just was I needed to st","useful":2,"cool":1},"V0NMEEb5PCTsLFi1h-mOWg":{"text":"Delicious in every way! The appetizers were amazing! Our server was the sweetest and very ","useful":0,"cool":0},"l7rRlxsIyMU9ZXct1XLBVQ":{"text":"This place was awesome tommie was a great server and showed us a great time. Great hospita","useful":0,"cool":0},"CdKtkL7oE0VhlRssec5VQA":{"text":"Good food and portions.\n\nBartender was very entertaining but we didn't get much of our own","useful":0,"cool":0},"skU0lgFOYLKyx3eQR9aTzQ":{"text":"Wife and I stopped by for brunch, omelet and eggs benedict, WOW!  The food was expertly pr","useful":0,"cool":0},"dcKI-tnH1B6GXqFn1s6oSQ":{"text":"Delicious! I will be thinking about the fried green tomatoes for years to come. I would pu","useful":0,"cool":0},"sMIOt8AT-j3cBUgprZ7QGg":{"text":"The food and service was AMAZING! Our server Alisha was the absolute best. She made our vi","useful":0,"cool":0},"VsjBAwmWDrkZVzp6yYISAw":{"text":"Despite the recent events in the country and shut downs of many restaurants, the Ruby Slip","useful":0,"cool":0},"j2kMyViSGUHLieeDz2euHA":{"text":"THE REAL TRUTH. They get points for a pretty outside and pretty looking food. The food was","useful":0,"cool":0},"PK7KTlCsNbREIFKepguXVg":{"text":"Had really high expectations but was completely let down. The waitresses are garbage Every","useful":0,"cool":0},"_zhLdf0SWXfmX2MF2UxalQ":{"text":"We decided to enjoy Ruby's and found a location which didn't have a line like there is fre","useful":0,"cool":0},"VOFZ4bzGCjfC0y8Kp7LDfw":{"text":"Food: 5/5\nService: 3/5\nAtmosphere: 5/5\nValue: 4/5\n\nOverall: 17/20  \n\nTruly a great spot, n","useful":0,"cool":0},"oamX4WlR0dG1qH1FprQoyg":{"text":"As always awesome experience. Outdoor seating socially distanced. Staff all wearing masks ","useful":0,"cool":1},"7JiWAy1TfEfptY7CDM-fzw":{"text":"I went to RS Broad St. a couple weeks ago on a Friday at lunch to celebrate my sister turn","useful":1,"cool":0},"MnJiC_IvPY12Id64is3H9g":{"text":"We have had a great brunch at Ruby Slipper! Everyone was so friendly and Alicia was a wond","useful":0,"cool":0},"C_KzQ8jZa0CoqJYzeam8og":{"text":"Came here after a 2 hour long flight to have breakfast with my friends and I left full and","useful":2,"cool":1},"KAhK7fZPGbhMtvPUR-Ys0g":{"text":"I haven't even eaten yet and I already know that my food is going to be A1 because NIA, ou","useful":0,"cool":0},"hQeflR91sOuq6xjUAhcyUA":{"text":"Destiny was a great waitress. We were a party of 9 and all the orders came out correct and","useful":0,"cool":0},"1F4yOQPipFyEFprYVPPpHQ":{"text":"Definitely saved the best for last on this trip. Popped in before heading to the airport a","useful":0,"cool":0},"YXisWW8FGoMgB_0UdVSL9Q":{"text":"We sat at the bar and it was fun.   The atmosphere was super busy but they found ways to m","useful":0,"cool":0},"_pi9A0d3e3J9PEAz2K5Jyg":{"text":"Always a great atmosphere to sit down and eat. Our server Charlotte was on point with ever","useful":0,"cool":0},"F3FljbLkQyhW2wGWCtFZtg":{"text":"Despite being crowded for Sunday brunch, we got a table within 5 minutes. Our server, Alis","useful":0,"cool":0},"Js7CaiPzCs-sAr_OZjq7eQ":{"text":"This place was so good! The wait was really long but worth it as the food and drinks were ","useful":0,"cool":0},"FtvOzjcP-iqfwKLyiuPwOA":{"text":"Consistency. That's the name of the game. You're know what you're getting. Every time. Goo","useful":2,"cool":1},"X5QKFCPp3IixIGlZypIxTA":{"text":"Ruby Slipper is a really great place to start your New Orleans experience with. I came the","useful":0,"cool":0},"dOjuLyvCettuCeInEnqXOQ":{"text":"When in New Orleans, you must, must, must try this place. We were there on a 6-day visit a","useful":1,"cool":0},"JkW1FMh-UXkPo4NeAXF60g":{"text":"I got the shrimp and grits. I was so excited after what I saw on the internet but when I g","useful":0,"cool":0},"zBYQXmzEHju_gCcQK2otfA":{"text":"Shrimp and grits, Banana foster french toast , and BLT !!!!!!! The best in Nola . Service ","useful":0,"cool":0},"oR9aEeJlhkgrXwtvlNMvdQ":{"text":"Amazing food love everything, it's really hard to decide what to get because everything is","useful":0,"cool":0},"WEFciBj5WLXIa6i5AdeLiA":{"text":"I am a bit embarrassed to admit that I live right down the street from Ruby Slipper in Mid","useful":2,"cool":1},"cHJEOIISb2YVCb5cZ-g0Cg":{"text":"2nd favorite location (tied with Marigny)\n\nThis particular location is higher on my list b","useful":15,"cool":9},"x7Ai2S5m_bxQT5RcBrkedA":{"text":"Looking for a nice brunch spot this is it ! Plenty of different food choices and staff wer","useful":0,"cool":0},"FUSIswp4-muRicfUHWAwcQ":{"text":"I've been to Ruby Slipper three times and each time I had a good meal. \n\nThe wait time is ","useful":2,"cool":0},"k3IiixjY7Vc7BIF8yEzSJQ":{"text":"This place is amazing. Benedict's are where it is at. The drinks are pre mixed with alcoho","useful":0,"cool":0},"6EHFRHTob5Q-dUqrU6Lzgw":{"text":"I have been waiting to try this location for the longest. Every time we go on a weekend th","useful":0,"cool":0},"eFSz1zRojJqfDn08oumzFw":{"text":"Everything was great I waitress Alejandra or Alex was such a joy she was so funny and nice","useful":0,"cool":0},"FXkR3C5iUQtRer4k9PX3_A":{"text":"The food was good and our waitress was nice other than that the experience was totally hor","useful":0,"cool":0},"GQLVpJNmM-l5EfcMNa65yA":{"text":"It was quite a wait. But we were happy once we got seated. I never liked grits but after t","useful":0,"cool":0},"ndUPxxS-R1aeURM9UAnQeQ":{"text":"Great Food and Great Service! Our breakfast cocktails could have been a bit better. My hub","useful":1,"cool":0},"BHR2d0YpAM3vfkEXBJP-gA":{"text":"Always a fan of Ruby Slipper! I ordered carryout from this location. I love the setup with","useful":0,"cool":0},"IaC5IBTwzWvEaDV9v5d_1w":{"text":"So I placed an order through UberEats, my delivery time was excellent food was still hot. ","useful":0,"cool":0},"aZHo7nWpfnyhrhzg4DJEKw":{"text":"If nothing else the Ruby Slipper is going to be one of our breakfast stops at least once a","useful":1,"cool":1},"5xiGrIRfnyHeryntxvYpxg":{"text":"There is something special about breakfast. It's the one meal that I cannot make nearly as","useful":5,"cool":3},"2WomIORNl00nh7sq-27DRw":{"text":"Best Breakfast In NOLA\n\n\n      I love this place. The shrimp and grits and shrimp omelette","useful":0,"cool":0},"huQJSa9EoRNINb8cInvrow":{"text":"Always love stopping here. Staff are fantastic, food is good, and they are great at accomm","useful":1,"cool":0},"gvXPKsrMOH3r5GMlibE4_A":{"text":"Our waitress was amazing. She was extremely nice and was funny too, very personable. The f","useful":0,"cool":0},"8-ymIX7UPOiGW2B_4bwzBQ":{"text":"Jessica S is the best\n\nYes the food and atmosphere is great but it's the staff that makes ","useful":0,"cool":0},"12STMDdh1LLVUzlnvTf9VQ":{"text":"Great place to go after a night of sips and libations... LoL. We always split the bananas ","useful":0,"cool":0},"N_MJsH8LMkiJTSpeg7B4fA":{"text":"Different and Delicious!!! Jami was was amazing!!! She is very patient and was the only se","useful":0,"cool":0},"DqjXPvSFvu8HbuhQqv-yPA":{"text":"This place is solid. Came here for breakfast based on the reviews and pictures of course a","useful":2,"cool":2},"Zvzqr4bC-nfzlDMggxbIvQ":{"text":"This place is amazing! We went twice during our 5 day stay. The food and drinks were amazi","useful":0,"cool":0},"s6Kp0JEr0T7HLxHKns7kpg":{"text":"Food is always great but can't give it more than 3 stars as it has very slow service. Don'","useful":0,"cool":0},"6iJeusSsS7P5qwiwGe-nxg":{"text":"Although outside was closed due to pending inclement weather, the host was able to place o","useful":0,"cool":0},"JQHMa_1oA3horPPYwtGY2g":{"text":"The food was excellent but the service was out of this world!! Jessica is phenomenal and r","useful":0,"cool":0},"T9JCsPwcEOoqkFy0zhBQFw":{"text":"Great food, really enjoyed the beignets and candied bacon. Server was very inattentive tho","useful":0,"cool":0},"2oTAlVWx8cup1sg8gpZv4A":{"text":"This place is an amazing breakfast place! I got the Trifecta Benedict and let's just say I","useful":0,"cool":0},"G1Ya0A6oYEDfqCHgu2ln1w":{"text":"I absolutely LOVED the ruby slipper. My boyfriend and I went before our Mardi Gras festivi","useful":0,"cool":0},"a8uAId_GFulOJH1nwUvzEg":{"text":"Dear Owner - thank you for a memorable brunch! First time here & fell in love! The salmon ","useful":0,"cool":0},"XFxFPJGMmkuxrGw1jYgvKQ":{"text":"Ok I know this may be an unpopular review, but I was absolutely not impressed. We have alw","useful":1,"cool":0},"S--F0z-3G0JwGn4fb5rtig":{"text":"All I can say is don't skip the candies bacon. Ok, but really, this place is worth the wai","useful":0,"cool":0},"MrOJoxQO9q1JITq6yW4koA":{"text":"Ruby Slipper Cafe is a great spot for breakfast or brunch! I loved this cute spot, and the","useful":3,"cool":3},"lmd58GIx40yoF8NnBlaj6g":{"text":"Jack was THE man as our server. He was incredibly friendly and personable. Our food was ta","useful":4,"cool":2},"qK8mS5CY_uqmV8o532sE8A":{"text":"Although this location has changed from the original renovated corner store location opene","useful":4,"cool":3},"bHvGDtfk88zqdVMSMKJ7BA":{"text":"Our hostel host recommended this place for brunch. When we arrived on a slow Monday mornin","useful":0,"cool":0},"SU2VpKfWKwLoH_FWT0HezA":{"text":"The menu is stacked with things the mrs and I wanted to try but alas we decided to save ou","useful":1,"cool":0},"tsOj6dyWdzLIvAeAuUYSmQ":{"text":"S/o to Jessica S. She's HILARIOUS and helped us pick AMAZING food and drinks for our last ","useful":0,"cool":0},"xr66chriDdEdJjtf5Y7tAw":{"text":"Great service friendly and professional staff. Will definitely recommend and come back to ","useful":0,"cool":0},"sIfSxd4RR4D12h_W6om8Lw":{"text":"This was my second time in NOLA and we finally got to eat here at Ruby Slipper Cafe. But y","useful":3,"cool":1},"eqwWhuy2lLbPWLhHfLxAsQ":{"text":"Loved!!! This was the first stop off the plane for food and did not disappoint. The drinks","useful":0,"cool":0},"SMtTQy-w6c3UvqUQwlbb5A":{"text":"Highly recommend  the Chicken St. Charles. Not so much the Shrimp Boogaloo. It was dry and","useful":0,"cool":0},"mr3SEFn7fgOPSgcsPt6-gA":{"text":"I've been a customer for more than ten years and have always enjoyed the food and good ser","useful":0,"cool":0},"ByegtZJmknTrv95MboYv8g":{"text":"Definitely in the top 3 of Best brunches in NoLa  I love the Breakfast Sandwich and I've a","useful":0,"cool":0},"LwdfxCRw49KrEhv8MbGnGA":{"text":"Ruby Slipper = amazing.  Truth be told, I decided to join Yelp just to write a review of o","useful":0,"cool":0},"L8sesNRG3l6MKQkoseyD2A":{"text":"Jessica is the best!! Service was a great and chicken phenomenal! Thanks Jessica for helpi","useful":0,"cool":0},"PsF4D9BhrXBYKwac9qmhxg":{"text":"On my quick weekend trip to NOLA, Ruby Slipper was recommended by several locals I spoke w","useful":1,"cool":1},"E5gHa8qsYVXx0kDuk-LHBA":{"text":"Came in on a Sunday morning for brunch with a few of my friends. We joined the waitlist an","useful":0,"cool":0},"lmSSctTfboPnZ0_IafOogw":{"text":"Three nurses (including myself, of course) walk in to this locale at around 8:30AM after s","useful":0,"cool":0},"JNFVzQII6Sb2tjoqaWvGoA":{"text":"My family and I visited Ruby Slippers on Saturday, 1/11/20 for breakfast.  There were six ","useful":0,"cool":0},"syXDmTwrBae4j7lMYYzSLw":{"text":"Food and service was great! Ask for Roy when you come! He was attentive and was also helpf","useful":0,"cool":0},"7qTJbuV8bcRBEX2aD3vuiA":{"text":"I can here for brunch during a bachelorette party weekend and they did not disappoint! The","useful":0,"cool":0},"ivmMWzKT2Zy00nfYF2xP1g":{"text":"I came with a party of 15 people for a birthday breakfast at 8:00 a.m. and everything went","useful":0,"cool":0},"1ksahlWEDzLyTvrfY864jQ":{"text":"It was absolutely amazing.  4 of my BFF and myself celebrated VALENTINE!!! The food was gr","useful":1,"cool":0},"3oOOgLMRmBP7ng_zVI5s4w":{"text":"I've been to several of the Ruby Slipper restaurants in NOLA but Sunday Oct 3rd was my bes","useful":0,"cool":0},"2F4ZLLCXrkl-oJv-B_TR9w":{"text":"Food is as bland as the photos. Local slop house! Reviews can't be serious, plus they have","useful":0,"cool":0},"5IbR7JDCGb1cNowz2z8ecg":{"text":"After a bad experience at the Ruby Slipper, I must say this morning's experience was great","useful":0,"cool":0},"cbkq5AwCyulJNj45ZG2B1g":{"text":"The Ruby Slipper is always a solid choice. I recently went to this location for the first ","useful":3,"cool":0},"mtt-T_-kHr1YpRorWi-9lQ":{"text":"I heard so much about the place so finally tried them out, the food was bland and the bisc","useful":0,"cool":0},"hN728N7s7SACpmU_XOmBKg":{"text":"On our way out from Mardi gras we decided to try this place.....from see'ing all the peopl","useful":1,"cool":1},"xe68PXTj728O95x34ZsNPw":{"text":"WHAT WORKED:\nMy wife and I had the The Southern Breakfast and it was great. The two slices","useful":1,"cool":0},"RZWYTGQke0pzunMNQ4fCgw":{"text":"The first time I tried Ruby Slipper in 2016 at their original location, I had a great expe","useful":3,"cool":0},"XAtJkZ8W5RK8MWvZ0SXv_w":{"text":"Gotta update my review because...\n\nA: I love the hostess - Mama D (Deanna) - who's always ","useful":1,"cool":1},"c7MEQV6UAe5CtNfybeDN5w":{"text":"We stopped here on our way home from NOLA, and we were honestly kind of disappointed. The ","useful":1,"cool":0},"4CptFLiWAFhRvSZTeVBkkA":{"text":"Visited this spot on Tuesday for breakfast/brunch with my roommate and girlfriend. We were","useful":0,"cool":0},"NapA6KOjfcnpcpdhVn6j_A":{"text":"Amazing! Would recommend! The food was phenomenal and the service was fantastic! I would c","useful":0,"cool":0},"zOuFAHJfZpi7VCtc3UBD4Q":{"text":"Hands down some of the best breakfast and service I've ever had. This restaurant feel like","useful":1,"cool":0},"kZlJZsw5Wn_M51lk2k8FlA":{"text":"Excellent breakfast/brunch restaurant!\n\nMy daughter celebrated her Sweet 16 birthday with ","useful":0,"cool":0},"1ehlOXv5N-ZuLQVm1KchEQ":{"text":"A nice place for enjoying brunch. Recommend Cochon egg, the pork was really good, but the ","useful":0,"cool":0},"QEz-X5WvqzXo0xMY2g9ZaA":{"text":"We came here early on a Sunday to avoid lines with the help of a crazy sleep schedule due ","useful":1,"cool":0},"oX-NBikEngke_VToQrmgVg":{"text":"The wait time was a not long at all for a group of 8. They're fast with their service. Roy","useful":1,"cool":1},"D4huQ7wC9zXge-w3pEbUlA":{"text":"I heart breakfast food! Yup, I'm owning it-I can eat breakfast food for every meal of the ","useful":3,"cool":3},"BFLJrdO_stz5l3xANUHBuw":{"text":"I love Ruby Slipper and I always will, however this location could use some help. We were ","useful":0,"cool":0},"0iGsETTzWvm18m5AyeyaYA":{"text":"This place is amazing!! The pomegranate mimosa is the best and the fried green tomatoes ar","useful":0,"cool":0},"TqR7LnGcFXNBJKeCWAM1CQ":{"text":"On a Sunday we ventured to the Ruby Slipper Midcity.  The wait time was 40 minutes which w","useful":2,"cool":2},"p8IPwE-979GBg_LE5HrYjQ":{"text":"This place was awesome! We were very surprised to get seated almost instantly on a busy Sa","useful":1,"cool":0},"YaWZLARiCPBtx6tcb9qgqw":{"text":"I have been wanting to try this spot for a long time. It did not disappoint! The wait was ","useful":3,"cool":0},"VBEC7hrRn0onw-JlvRxocg":{"text":"I love the ruby slipper chain and this newest location addition to New Orleans is really w","useful":2,"cool":2},"lIUzD9rf2pokSqfZjySaCA":{"text":"I had the Peacemaker as I could not choose. The pork debris was very nice and the tomato w","useful":1,"cool":0},"oQKZ9PdAgc48haoC2gBG0Q":{"text":"Let me start by saying that Diana D. and her trainee, Damien, we're absolutely AMAZING!!!!","useful":0,"cool":0},"O63pnKj8FEGdrf2pmvEGXA":{"text":"Yummy breakfast/brunch food and delicious mimosas/poinsettias. Our Server Diana (Princess ","useful":1,"cool":0},"XY8ojMrj5K51BOB4VoeiGw":{"text":"I got the breakfast tacos and they were yummy! the rice in the rice and beans was kinda cr","useful":1,"cool":1},"JTHM8jkY2VRd_CdSmcma5g":{"text":"This isn't my first time at a Ruby Slipper but it's my first time at this particular locat","useful":1,"cool":0},"ZnAMRhohYLzXqJlj04-E_w":{"text":"Took a chance and came to the not so overly crowded location.  The yelp app lets you go on","useful":3,"cool":2},"xmGVcjHRE3j1W7l--IJNlA":{"text":"Our last meal before we left town. If you love a good brunch, definitely check this place ","useful":1,"cool":1},"bFvmZEKt4flhkcY7nXO0qg":{"text":"We had been looking forward to this breakfast for a while, having missed it on our last tr","useful":0,"cool":0},"oA9rqXfWej1W6uycMtMAtg":{"text":"Thought i had written a review for this place a while back, but alas, i have not. I love t","useful":2,"cool":1},"SzbRxa_9ZoRFgMHZpakHxw":{"text":"On a Saturday afternoon we made a reservation for brunch at this Ruby Slipper and upon arr","useful":2,"cool":2},"5yVea0iobKDCkegoniSR3Q":{"text":"Let me be clear....the service here is fantastic. Phenomenal! Everyone we encountered was ","useful":4,"cool":1}}