{"Ycg99K9o-rTbfA5BSZa0yg":{"text":"terrible food and the manager was shockingly rude when I tried to return my food. I had th","useful":2,"cool":0},"38fmuDvBObd4RK1Du5wL6w":{"text":"Worst of the worst. Ordered three items and waited 40 minutes for the barbecued shrimp to ","useful":1,"cool":0},"CYm5F_fOwCoMtbkaqASnMg":{"text":"The food is disgusting. We watched the cook microwave all the food. Never go here. I didn'","useful":2,"cool":0},"mtSYui0KHjzwMJG7NsPuBw":{"text":"2 stars for gumbo, 1 for the blandest, bleakest serving of red beans & rice ever! Really h","useful":0,"cool":0},"1EXBQEIa2AVb9DGlS7recg":{"text":"Unacceptable wait for food. After ordering and paying, were told they were out of bread fo","useful":0,"cool":0},"QYYrjHJ1L1bHEKxSIBWRsQ":{"text":"Ordered the gator bites and creole potatoes. Was told to wait and 15 minutes later I got m","useful":2,"cool":0},"Huv-kk-8yY9s2PCmCUMQEQ":{"text":"Fun spot in the lively French Market. Food was good. Service was a bit spotty at the count","useful":0,"cool":0},"szuXNFXQQo4dryLF1MpnFg":{"text":"#chifoodie #NOLAtourism #foodtourism #blackownedbusiness #blackbiz Highest rating.  Eating","useful":0,"cool":0},"PGYLdezc6MjaKdJAhd3Etg":{"text":"By far THE best shrimp and grits I've ever had. Stopped by just to pick up some spices. Th","useful":0,"cool":0},"8CvNgAcyh5hrNOz7jwZ5KA":{"text":"They say that there is no bad place to eat in N.O.  Wrong! I found it. I payed $15.95 for ","useful":0,"cool":0},"qWQvrTL_mvkCXprc58sBKQ":{"text":"The creole breakfast bowl. Not a fan of breakfast, usually don't eat it. But this was amaz","useful":2,"cool":1},"1RJmvvligXjIu_yj2BF4TQ":{"text":"We walked up to the counter and the lady said there was a long wait. We decided to go for ","useful":0,"cool":0},"jhg1cRMc4ncpIT2ZSscGqA":{"text":"The line was long, the menu had a lot of options, so we stopped for some food. The line mo","useful":1,"cool":0},"cOwVzXW-2Q1vS90oZQNZBg":{"text":"The service is not that good here :( we came from CA and wanted to try the food from New O","useful":2,"cool":0},"js1wvInzUsSKnEQ6TTOitg":{"text":"Great food. Great service. Will definitely come back the next time I'm in New Orleans. The","useful":0,"cool":0},"dRY4RWDST2z8-t0BBj4E8A":{"text":"Service is extremely slow, and my shrimp po-boy was more like a tomato sandwich. Not enoug","useful":2,"cool":0},"R5mmCu_tPwsKAZgQpzUlXg":{"text":"Don't eat here! Worse dining experience I had in NOLA. To begin with, they're severely und","useful":1,"cool":0},"zUE0viIQL-LeW23C1fRKPw":{"text":"Stopped by to try their \"Food Network approved\" creole seafood gumbo. Don't do it - it's e","useful":2,"cool":1},"8_ioTFfnkqId3o8-affbkw":{"text":"OMG, OMG, OMG.  The seafood gumbo with okra is great!  Spicy as heck (yesss! )and they giv","useful":2,"cool":0},"QM4n8vkG7m2H8yf98ov2Cw":{"text":"A great stop in the middle of the French Market. The seafood gumbo was delicious. My siste","useful":0,"cool":0},"hM50rLjeE4O1ApawHBx0Zw":{"text":"LOCATION- Located in the French Market, N'awlins Cafe and Spice Emporium definitely catche","useful":2,"cool":0},"KveI7uCSyfy4VLJdizz2RA":{"text":"Horrible experience. Waited over 30 minutes and paid $14 for one crab po-boy that was basi","useful":1,"cool":0},"CO2LyMgJ9eTkWbdDmjOAnA":{"text":"buyer beware-300% markup on cafe du monde 12 ct keurig coffee $23!!! no receipts given!!! ","useful":0,"cool":0},"hjWZLPjTmWHD_gEaBUfwtQ":{"text":"Excellent crawfish pie and po boys. Located in the French Market with a Counter to sit and","useful":1,"cool":0},"KzvUh-bdpsaudXl-EbHIxg":{"text":"I wanted to love this place. The biggest sign in the middle of the counter touted a crab s","useful":0,"cool":0},"NLpsTnVZsihwE1B54IQB0g":{"text":"The Creole breakfast bowl was absolutely delicious a little bit on the salty side and ask ","useful":0,"cool":0},"tSG5WyS3lqRuBgNa_zoDaQ":{"text":"Waited over 25min for my order which was inedible  when I got it. Avoid this place at all ","useful":1,"cool":0},"mJP_wCelW155xZPg3Td0kw":{"text":"Horrible, horrible service. Waited over 45 minutes for the food to come out, when told 20 ","useful":1,"cool":0},"b9Y-0MlJICG8n6kgi9EURA":{"text":"Mary B -- 1 star  Horrible! Horrible! Horrible! Worst place we ate at in New Orleans!\n\nDec","useful":4,"cool":2},"ncTi6S-M5SQ23h7AagoHOQ":{"text":"Not bad for the French market, but a little pricy. Soft shell crab sandwich was surprising","useful":0,"cool":0},"J0tS6LNmSxAqNV85-8BqoQ":{"text":"Don't make this spot the only place to try local specialties. \nCool souvenir shop, but the","useful":0,"cool":0},"1bjmH9OSYCUMCMSCiemWdg":{"text":"Found this place just before heading home and I really wish I had found it sooner... This ","useful":0,"cool":0},"rmQUgH5o9WJjwKJ6891fxQ":{"text":"So many questions why this place is still in business. Here's a handful:\n1) Your signs adv","useful":3,"cool":0},"oT1srQWwGuCwvzda-Gx3rQ":{"text":"Amazing, great food at a really good price. The BBQ shrimp is as good as any restaurant in","useful":3,"cool":0},"djKBEmejyAqpO8KA0OY9uw":{"text":"I rarely give one star reviews. But in this case, it's more than merited. \n\nWe strolled th","useful":3,"cool":0},"wiW6anVELoseYrAFtUCEgA":{"text":"#PoopInShrimp Store manager is rude. Hope this lessens the 2 star ratings... Poop poop poo","useful":1,"cool":0},"d17YLBgaRYQ2mmXUmDsk3Q":{"text":"The food here is OK at best. The waitress was very nice. Now I ordered a Fried Aligator Po","useful":0,"cool":0},"nLGIVdN9AqBbCdy40hzoUg":{"text":"Waited over 25min for my order which was inedible  when I got it. Avoid this place at all ","useful":0,"cool":0},"1HQ0QiGboDz5TtpwNPRO6A":{"text":"We had the world famous gumbo and were disappointed.   It was not bad but I had better gum","useful":0,"cool":0},"TvFAFQ-VJAcyg1WfIvgswQ":{"text":"Its nothing special, it said \"famous\", but that may have been a long time ago when that wa","useful":0,"cool":0},"zOXkYh0XBR9yoKjSUD2Skg":{"text":"Wrong place to try authentic local food and dishes. We've tried the Gator bites (usually l","useful":1,"cool":0},"bkwHgU8zLc60GbcDew1ptQ":{"text":"They advertise themselves as\n\"Authentic Creole Cuisine.  Cajun and Creole Spices\"\n\nEvery k","useful":3,"cool":0},"u9taqf_n0voV9STYeIUuDA":{"text":"This place is always my stop for my spice needs before I hit the road back to Tennessee. I","useful":3,"cool":0},"5ZN8M9LzWxI7-3WGXYJyeQ":{"text":"Ordered the shrimp po'boy and creole potatoes. 25 minutes later I had the most disappointi","useful":1,"cool":0},"yqS91Olnd5LHGB2lo_GwvA":{"text":"Bad service and bad food. It took them 30 minutes to prepare Meatballs and Spaghetti and t","useful":1,"cool":0},"tLY99keigzeTZI4HLKmUnQ":{"text":"Pro: \n-sweetest lady helped me with ordering. \n\nCon: \n-I've had better gator in Pensacola.","useful":0,"cool":0},"n35VT9TjMNiG3pvxB5F81g":{"text":"DO NOT EAT HERE! There are so many other options in the area. We ordered a soft shell crab","useful":1,"cool":0},"h5gHCEuc0oekhgrWTcnRzQ":{"text":"Wow. Waited forever for the food just to get a half full bowl of seafood gumbo for $9+. Th","useful":2,"cool":0},"ICzldoq57jo7DDSMiuiHpQ":{"text":"Overpriced. We ordered Cajun jambalaya, side of potatoes and seafood gumbo. Sizes are so s","useful":1,"cool":0},"EUZOXtF3yBB5p1g9mQ6TKw":{"text":"Do not eat here run far away! It's too expensive the red beans and rice is nasty,  the shr","useful":0,"cool":0},"waw1CeRnOcYK-sn5T5U2YQ":{"text":"Discovered this place on our last day in New Orleans in the French Market, but wish we fou","useful":0,"cool":0},"qaO5imVSPeX25aAcLwiDNA":{"text":"I had the lobster poboy which sounded great but ended up being about two tablespoons of lo","useful":0,"cool":0},"RCv1ZpKQbHZEteugu5GjbQ":{"text":"Don't ever eat from here they don't clean their seafood!!! And they won't even replace the","useful":1,"cool":1},"NZKVQV1OJOiFqSdtME6bZA":{"text":"OMG. We thought this placed was going to be soooo cool because it had all these \"swamp\" fo","useful":3,"cool":0},"LS-LFkkxqxY-0eS37D0mag":{"text":"My first time in New Orleans, and I was told by friends who have been here before, to come","useful":0,"cool":0},"IgdboLFw4wIGSAWGVBnmrg":{"text":"Disclaimer:  this is only for the spice shop portion of the shop, not the cafe hot food.\n\n","useful":0,"cool":0},"mai3PGhKs0fG9gPWkjV0RQ":{"text":"If you don't have 1.5 hour to wait and eat don't come here.  They did refund 1 meal but do","useful":0,"cool":0},"2wDhA6XSK7bJLfn1bFTzig":{"text":"This place is the bomb!!!!!\nwe came from the 305 MIAMI\nto eat the worlds famous voodoo bur","useful":0,"cool":0},"jMvXdYEFXjAPOHkTZHzJhA":{"text":"Worst meal I had the entire weeklong visit to NOLA... I didnt even think it was possible t","useful":3,"cool":1},"wGC-cgdUnBFaqhhgDsd_FA":{"text":"In the French market , this is my spot I always come here for southern food, best gumbo, C","useful":2,"cool":1},"OhuvyDQpsMdZyOHdRG_qgw":{"text":"My voodoo burger was great, the spicy lobster poboy was lacking in lobster ad spice, and w","useful":0,"cool":0},"dNeo4VqiqtRST4zIiMHv6A":{"text":"Best food ever. 1st time in Nawlins and decided to eat here. Very filling. Food was season","useful":0,"cool":0},"sB6670pjxV6-H4epkVC7WQ":{"text":"HANDS DOWN MOST delicious breakfast bowl I have ever had! I had the creole breakfast bowl ","useful":0,"cool":0},"I7euzq1F1SWbg6XxvcmXAg":{"text":"The over priced tamales were frozen in the middle and the gumbo was thin and flavorless.  ","useful":0,"cool":0},"d3nvJvSq0CnkengoDzeAcw":{"text":"Got the shrimp po boy...$15 for stale bread and a few shrimp with 3 slices of potato. The ","useful":1,"cool":0},"x5xCpaRAbBr_sQqantBhMA":{"text":"Worst place in New Orleans terrible service and terrible  food !  PO boy bread is rock har","useful":1,"cool":0},"np07WhuhcWRuzgoO0iWs1w":{"text":"If I could rate zero I would. Shrimp was not clean; food was served cold; bread was stale.","useful":1,"cool":0},"EbzlwhNak_xnoikgYjHJMQ":{"text":"When you're advertising GATOR ON A STICK, it would seem reasonable that your customers are","useful":0,"cool":0},"9-UoplRkT__BE5PfAaIhPg":{"text":"This is our first time visiting New Orleans and so far N'awlins has been our favorite spot","useful":0,"cool":0},"0zU1a4Z0ka_Hney-PF8liA":{"text":"Got here just as it opened up.  Ordered a 3 egg omelet with crawfish and they put sautéed ","useful":0,"cool":0},"eLbb4hMkRB6jePeGXgp82Q":{"text":"The boudin was our favorite in New Orleans. Flavorful and just so delicious. The alligator","useful":0,"cool":0},"kYn2NPcLH_KBTq_o3ja0Hg":{"text":"I cannot believe this restaurant was actually stupid enough to get their business featured","useful":0,"cool":0},"CMla7gMcad4DdkpV0VxBiA":{"text":"Very unorganized. Could tell the employees were getting frustrated with each other because","useful":0,"cool":0},"sX-_L9exfanMU62k9bu8_Q":{"text":"Yikes- where do I even start with this place! We ordered the seafood platter, which came t","useful":0,"cool":0},"jyOZ_SD4K5aDLW_nPw8zpw":{"text":"Not worth the money. Flavorless and poor service. We paid $20 for 7 bites of alligator. Wh","useful":0,"cool":0},"2n6tqrBwYBPM5k-3UDOH0w":{"text":"Probably the worst service and food that we had on our trip to New Orleans. 30 min wait fo","useful":1,"cool":0},"cfsHXwLxtjiirNC6R9QLgw":{"text":"Best place in New Orleans for authentic creole food!  Its family owned and the entire staf","useful":0,"cool":0},"wY0YyLWv8VffGjkZGEVSqw":{"text":"Situé dans le \"French market\" ce petit snack est plutôt mauvais.\nUn sandwich à l'alligator","useful":0,"cool":0},"WsZ7uGFsb3gsC3tZLrrmMg":{"text":"I think it's very over priced for what you get. I got a shrimp poboy and my total was $17 ","useful":1,"cool":0},"CBeRNMZQKwW-F__jlZY5yQ":{"text":"I ordered the tilapia  it came with seasoned Cajun potatoes, and mixed vegetables. So lets","useful":0,"cool":0},"4tEkU-a2a_QWJ9ywDqF-dA":{"text":"Looking for some NOLA lunch food with some kick ass sauce.\nI had the gumbo and alligator s","useful":0,"cool":0},"pFgimmGbFuYT_tHMxImlag":{"text":"We waited an hour and a half for a sandwich and boudin sticks. The food was lackluster at ","useful":1,"cool":0},"ew_bI0ph-VGaXa1zYZ4uDg":{"text":"If I could give this place zero stars I would! The shrimp po boy was freezing cold the bre","useful":1,"cool":0},"KUznKvApVZZ7XO8E84tptw":{"text":"I've eaten here several times over the years and it has the best BBQ shrimp I've had. I ca","useful":1,"cool":0},"K3uXgjg8LMNd_rUZtobfmA":{"text":"Alligators bites were bland, BBQ shrimp bland, crawfish pie bland, the shrimp creole bland","useful":1,"cool":0},"2aS209uJNQ13R0qD-pNqKA":{"text":"If you want to be ignored this is the place to go.  I'm not even sure they know what custo","useful":0,"cool":0},"W86vKIqMBpgwB0QrZecjdA":{"text":"I got the creole breakfast bowl. It had a good portion of grits, gravy, and cheese topped ","useful":1,"cool":0},"vgS57AUwdrzVMlL1wXn6cQ":{"text":"Don't know why the bad reviews. It was near end of day and the vendors were shutting shop ","useful":1,"cool":0},"WbicNJBNXbA2aQTJfS90_A":{"text":"This was our third food stop during our stay in New Orleans. The food overall was decent. ","useful":1,"cool":0},"3KRFCwiKv_0p7WoGew3yiQ":{"text":"Creole jambalaya  was bone dry.  Tasted like microwave rice r roni.  Crab poboy was stinky","useful":3,"cool":0},"1lWDeHB8roTq2qrOlLol0g":{"text":"I've been in NOLA for close to a week, challenging my own intestinal fortitude daily, and ","useful":0,"cool":0},"EblAtFKzcOtveVL-LKiOfw":{"text":"Great coffee. Had the Creole breakfast bowl, it was pretty good the shrimps in it were ama","useful":0,"cool":0},"q1u5hPrp0ULMA-tzSrOyTQ":{"text":"We strolled through the French Market in New Orleans not really looking for a place to eat","useful":1,"cool":0},"lni28O9jXk8yC1MzhG5msg":{"text":"This place was way to over  priced for such bad food. The rabbit and fish had to much salt","useful":0,"cool":0},"eCodrjDwHL5vIPUPsQzpaQ":{"text":"Disgusting, overpriced food..we got 2 po/boys...1 shrimp, 1 gator.  They were both 6\" max.","useful":1,"cool":0},"7LYh5ErA8N4KkzlmNJrgOA":{"text":"The gumbo did not taste anything special. The alligator meat was tender and juicy, unfortu","useful":1,"cool":0},"F1HR2NOWBbZjX4kmG9CUyw":{"text":"WORST experience! Deserves nothing but negative reviews and to be shut down for their unfa","useful":1,"cool":0},"DRotk8Dr6HuEtjZs3jCUfw":{"text":"1st time eating at this restaurant and I really enjoyed myself. Staff was very knowledgeab","useful":0,"cool":0},"3WnjA-c32K66MRfvt8xncg":{"text":"Rip off. 36$ for sub par hamburger and catfish plate. Literally had 12 fries on my plate. ","useful":1,"cool":0},"rBWDCLindO8h9VNgWHk1kw":{"text":"Super authentic food at pretty unbeatable prices. There was a long wait despite the lack o","useful":1,"cool":0},"BbvC5Zf3uDoID25YSgnNWg":{"text":"Amazing selection if you're looking for everything authentic and hot. Great service and de","useful":0,"cool":0},"vrftpgCwz4MUmSI5Yks-iw":{"text":"Ordered 6 bowls of Gumbo. After waiting 40+ minutes, 3 luke warm bowls are out and the rem","useful":1,"cool":0},"PrvfCW-tTD4b1euzybIP4A":{"text":"The worst place. What a let down. You wait over twenty minutes for an alligator kabob and ","useful":0,"cool":0},"iLO-H1U9aQJv30SVoIf5Jw":{"text":"After all the amazing food experiences in New Orleans so far, this place was a train wreck","useful":1,"cool":0},"wvyne2ME1ViVDi0Ii4MkVA":{"text":"Never trust a place with a \"NO REFUNDS!!\" sign! Landed here while looking for delicious se","useful":0,"cool":0},"Psz9zxiU7HXSPvA_P0Nhsg":{"text":"Skip this place....seriously....turn around....keep walking....extremely slow service.   T","useful":1,"cool":0},"pEkIrMehMYpgB22ZjlkqWA":{"text":"Very hectic! The menu is very large with lots of authentic new Orleans dishes to choose fr","useful":1,"cool":0},"fx59P5u57eEpIlmobviElQ":{"text":"Had the Jambalaya added shrimp looked to be out of a can salad size . Nothing at all speci","useful":0,"cool":0},"N4GsBm2Ph2yG2WkMK6Nt5g":{"text":"I'd give a 0 if it's an option. TOOK FOREVER!!!! Asked the MGR for refund, he refused, wen","useful":0,"cool":0},"SFwewqvz-6P9qO6_kD5JvA":{"text":"Headed down to NOLA with a friend for the weekend and we stopped for lunch at the French M","useful":2,"cool":0},"OpgL9AZZrSkHDb2q6gb9Vw":{"text":"Mediocre food, meager portions.  Server with a major attitude problem.  We just finished e","useful":0,"cool":0},"c45rYYfolPGKll84zyzDuw":{"text":"The name and the \"stamp of approval\" from the Food Network made me think this food was goi","useful":4,"cool":3},"ZUpYdpU1Ao5AkbRGDxPjWQ":{"text":"Was fooled by the number of people eating at the bar. Ordered shrimp sausage po boy and ja","useful":0,"cool":0},"s1BknOHtkTcp6pO6lxiCmg":{"text":"I do not usually give anyone one star...however, this was horrible. If I could give them n","useful":0,"cool":0},"gfy_4gywnQMyzgb3-XI5vw":{"text":"It was a busy day but the wait for some Creole jambalaya was much longer than you would ex","useful":1,"cool":0},"Md702KhQMZiPZvLWvCN00Q":{"text":"No. \n\nSmoky, flavorless gumbo - BBQ shrimp that doesn't live up to it's billing as \"the be","useful":0,"cool":0},"ecfeU3Otd-w7iV76qkqhmw":{"text":"25 minutes for allogator on a stick. The \"alligator\" is just a sausage, not a tail. Comes ","useful":4,"cool":1},"3-HKtwwckFP-djLO1uvZdw":{"text":"This restaurant is amazing!! Never even knew this place was here! First time eating here a","useful":3,"cool":1},"vy5HZb37U6QkOa9SD6XCqg":{"text":"The food is great. I got the Creole breakfast bowl. It was amazing. The gravy is top notch","useful":0,"cool":0},"sI_0qvkxNTOxQvRXTIChmw":{"text":"UGHHHHHHHHHHHH. \n\nCame here during Mardi Gras and were intrigued by the menu. It's in the ","useful":3,"cool":1},"OJp4AFGp7VbUVQNyteuK2w":{"text":"A great place for an authentic Cajun meal. My boyfriend ordered a Creole dish with shrimp ","useful":1,"cool":0},"2DILdHoudofR39pmk2O6bA":{"text":"This has always been one of my favorite places to stop within the French Market, and I was","useful":2,"cool":0},"lMSCq44rW-Uo85zStCDTGg":{"text":"Cute place,  tried the alligator tamales.  It was flavorful, but not made as a traditional","useful":0,"cool":0},"Mrv0ru4oC_ybdFGdcv4uqQ":{"text":"Bad food, over priced, horrible service and i got food poisoning for 5 days after eating t","useful":1,"cool":0},"-Z4gI4H94hPAlkNObFItIw":{"text":"We were having our trip to New Orleans when suddenly it rains,not just rain but really pou","useful":5,"cool":3},"Yx7up7vW1boy3XTyp8CgXg":{"text":"Gator bites are normally delicious although here they just make me sad  they were small fl","useful":1,"cool":0},"UFtD2LAStXt11GzysJwJrw":{"text":"Awesome po'boys and great staff!  Had their sauce and spices here too and they're amazing.","useful":0,"cool":0},"eTJxM-CVZdt5ps0i3HHT5Q":{"text":"If I could give a zero star status I would do so for this place. I'm not picky, I've eaten","useful":1,"cool":0},"HYm9LZTVgFkVXLyHoUy9dA":{"text":"Food was good and the service was excellent. I'm\nWe ordered the Gator on the Stick, amazin","useful":1,"cool":0},"gv9JXbe4OKeLp6adXIEw0g":{"text":"Owner needs to fire this manager. Wiping up all confused and chastising the hard working s","useful":2,"cool":0},"GxLUHtlNj8DXixkes-ZxXg":{"text":"Visited this location on our food tour and tried the seafood gumbo. It was spicy, flavorfu","useful":1,"cool":0},"e76UrmDh64xg_7zZRh86UQ":{"text":"We ordered a Po boy sandwich over 40 min ago and everyone that came after us got their san","useful":0,"cool":0},"UIf1188mHBPeGGHvY1tuDw":{"text":"Ripped-off in my favorite restaurant city!  I've written a fair number of reviews, and thi","useful":0,"cool":0},"RHbmOoBNBaTGnUeQhpzWBQ":{"text":"I should have rested on my laurels and not trust restaurants that claim to be \"World Famou","useful":2,"cool":0},"EycPIrZDuN1VRdiDmTQPyg":{"text":"This place was ok, I do like their variety in menu. But I had to ask twice for my water. I","useful":1,"cool":1},"teqDO-P3ldeBHojMAtR1Zg":{"text":"My wife had Creole shrimp was way too salty. She really couldn't enjoy the Creole sauce .\n","useful":0,"cool":0},"19_T0b1UAS9_6jDUGfpIGg":{"text":"We ordered the gator bites (three pieces of bread and about 3-4 tiny gator meats and the s","useful":0,"cool":0},"elu573QbgSzEkDPDeY8Hyw":{"text":"I don't even know if I can give this place ONE star... I would have felt bad giving this t","useful":1,"cool":0},"cxWg2i1SFCH4bQENtT4PSQ":{"text":"I know a bit about New Orleans, a city of Festivals, as I have been coming to the city for","useful":1,"cool":0},"SFQ3BZKA2YNb2iGx9P-sdQ":{"text":"Don't waste your time or money here.  Mediocre food and incredibly bad service. A very dis","useful":4,"cool":1},"CEx37p2aF3Yy-KIAsJumxw":{"text":"This place is the bomb!!!!!\nwe came from the 305 MIAMI\nto eat the worlds famous Voodoo bur","useful":0,"cool":0},"c__QFlr-G3YlkTKxh3vUug":{"text":"I had the voodoo hamburger very good and spicy hot. Just wish they used another type of bu","useful":0,"cool":0},"fyS_9sy0hSMUVhlyLjc7UQ":{"text":"Decided to check this place out for an afternoon snack after strolling through the French ","useful":4,"cool":0},"IB-E5bl27C1EpzI92THinQ":{"text":"Seafood gumbo is very flavorful. Not very thick at all. Nice rice to soup ratio. Huge crab","useful":1,"cool":1},"ywK6ssZFWexiEys5L29BUQ":{"text":"Great food! Went there for a quick \"alligator-on-a-stick\" snack but after seeing some of t","useful":0,"cool":0},"Omzk4h0pgiiCiaWYgfdMRA":{"text":"I paid $20 for the gator plate which was the same thing as the gator bites, which are only","useful":1,"cool":0},"YjKY9XU7eKjOeNho4GR-VQ":{"text":"If you love seafood gumbo don't miss this place! \n\nI'm not from New Orleans, but I know my","useful":1,"cool":0},"k1i1oFromV3oFBq_mWzzZw":{"text":"We decided to try the gator bites. For $12, we got 6 very little pieces of really salty me","useful":0,"cool":0},"OoZiAHDNJVLC0lA8jOj1Hg":{"text":"Horrible service, food is sub-par to say the least. Avoid if you're in New Orleans, plenty","useful":0,"cool":0},"ptiE1YDvyzsW-X6Qc6ZNLg":{"text":"Stopped by here because it smelled good and the counter was empty. It was empty for a reas","useful":4,"cool":0},"Mq_9zrqboauYe0r_GG1VFw":{"text":"In the French market,  we thought since it had a line it should be good.    Wife had the c","useful":0,"cool":0},"jNblBnLatkuU7765TFWXxA":{"text":"I found out about this place because a person walking down the street had the bag.  Hahha.","useful":2,"cool":0},"0D_Cad7Dw-2BP1A7eWK2Cw":{"text":"Service was great.  Servers were very personable.  Too many selections in in he menu.  Har","useful":0,"cool":0},"fXshLyeGhlbhrOk7Xq0PNg":{"text":"Amazing! So good!! Who would have thought that red beans and rice would be so tasty! I had","useful":1,"cool":1},"-6VyB1sok7ws9eN4JoiqQQ":{"text":"Great quick service.  The son owns it now n he was working there and had his son there. I ","useful":1,"cool":0},"1KwwSlDNELI0bttE49iWmA":{"text":"We only ordered one small creole okra gumbo and it was GOOD! A small size was enough to sh","useful":1,"cool":0},"qKbi1EzdE_XEWPje-dlceA":{"text":"When I ordered Gator on a Stick, I expected pieces of gator on a stick. Instead was given ","useful":0,"cool":0},"N6waDTW48C1uL5PxEfi3cw":{"text":"Crawfish omelette was delicious- great setting in the market place- would definitely eat h","useful":2,"cool":0},"V34SooazCxTIKTqNCHIr5A":{"text":"I agree with the previous reviews. Don't waste your time or money here. Even if the food h","useful":0,"cool":0},"ocnZxaGzLRXAODHjNah1PQ":{"text":"Myself and two friends ate here. They each had a problem with their food. One's jambalaya ","useful":1,"cool":0},"Ega9N2WExZZLk44g_2X6Vw":{"text":"Ordered the vegetarian jambalaya. Their big vegetarian signs suggest they care about provi","useful":0,"cool":0},"hb8td4Mb2GHMkxvLpQdGbg":{"text":"YUMMY! I ate here twice during my 5 days in N'awlins!\n\nThis gem in located in the French M","useful":2,"cool":1},"TO2R0yuOm8VL7HU7YD0l8w":{"text":"While it's convenient in you're hungry in the French Market, the food was nothing to rave ","useful":1,"cool":0},"TMwwRNLozG6uXt_sYN1AVw":{"text":"If you are looking for AUTHENTIC  gumbo or any creole food this is the place to come!!!! B","useful":0,"cool":0},"CSHvmftZSxXQ0ct-nCmhXg":{"text":"I had never had gator before... so when my cousin mentioned this place had \"gator tamales\"","useful":1,"cool":0},"hiG50yvavGX0sTad28sssA":{"text":"I was at the French Market and decided to eat here because there was a line, so I thought ","useful":1,"cool":0},"C5oSA_HIBBcNE4yZTXhyqw":{"text":"Decided to eat here after exploring the French market and looking at all the food places. ","useful":0,"cool":0},"rrXipF2c2xmqZJn5H0_p7A":{"text":"Ordered gumbo. Waited 10 minutes. The gumbo was cold and had 1 shrimp in it and 2 pieces o","useful":0,"cool":0},"tS-8Ep8y_qmBt9hySNPZfQ":{"text":"We have been in NOLA for about a week and visited many different eateries and hands down t","useful":1,"cool":0},"btGkHtjtFndfwjVycEXcQA":{"text":"We care here on a Sunday at 3pm and waited for 1 hour for a poorly made dry seafood platte","useful":1,"cool":0},"XbldRJiZG7wjJRPSMJI0ew":{"text":"I'm not understanding the bad reviews. Glad I checked it out randomly before looking on Ye","useful":1,"cool":0},"eItoGeZEtwvn9-fQYTg-mA":{"text":"Waited half an hour for a gator on a stick , other people's food was bought out quicker an","useful":1,"cool":0},"GhCIeEQxbcu9v5QyY_aaIA":{"text":"Avoid. After waiting 30 minutes for jambalaya, it was cold. Seems like they couldn't push ","useful":1,"cool":0},"4gkVTzj6MtK_FF6Mb9KgRA":{"text":"Easily the worst food I've ever had in New Orleans.  I love cajun food from nearly everywh","useful":1,"cool":0},"pqIYDA5rhA5dWSRhWjXRIA":{"text":"If I could give one star I would. The po-boys are terrible, have maybe 4 pieces of crawfis","useful":1,"cool":0},"DvV4hpkbV6hvdCRJBKFfvg":{"text":"Ordered hamburger which got the job done. Was not a big burger but waitress let me know th","useful":0,"cool":0},"GYO4ClqBfwQih2GGK1SrnA":{"text":"All kinds of Cajun cuisine and just delicious. We came for the chicken boudin because we d","useful":3,"cool":0},"QGIJdd7b3nTmZYaXQTdx1w":{"text":"Just finished lunch here. Poor quality. Should Yelp next time before sitting down at their","useful":1,"cool":0},"0kwCzj0tkosmNliP_3BMyA":{"text":"The Gator on a stick is absolutely amazing!!\nThe \"Taste of N'awlins\" is a great way to try","useful":0,"cool":0},"qhGjpecpOsjRmmH8i4sY3A":{"text":"If I could give zero stars I would. This is absolutely the worst service I've ever had at ","useful":2,"cool":0},"EIb_coJ_tiUWXlIWHkSqKw":{"text":"So I have read other reviews and mostly due to bad service. I am here at 10:30am for break","useful":0,"cool":0},"Lus4PkG6xLsKBYHPmj-k1w":{"text":"I ordered the alligator piquant(?) and my gf had the turtle cowan.  Mine was good hers was","useful":1,"cool":1},"tcfIp6v8kJi8RQGvyk872g":{"text":"Ordered the gator bites, and received half a plate of potatoes and 4 quarter sized deep fr","useful":0,"cool":0},"Su_0yMQ1HXjvKj5b5lrsLw":{"text":"I don't know why the rating isn't better here. I stop by this place every time I'm in NOLA","useful":1,"cool":0},"ZG03-6Rj3sLDEFdxr_FsDw":{"text":"I am very disappointed in this meal. It was not nasty, edible, but nothing special to rave","useful":1,"cool":0},"8iUK6gBaeh2J3wGWFXF9Bg":{"text":"Not impressed by this place. I ordered the small gumbo and it was $9 (which is a bit too p","useful":3,"cool":0},"qmLYdNDGfyNFmyp9S7noKA":{"text":"This review is for the on-line store. I ordered 4 items February 8, 2016. Feb. 17, I recei","useful":0,"cool":0},"UYnMZAhEbtmowW5vU2_PQQ":{"text":"I came because I really wanted to try the gator on a stick! But because I've never tried i","useful":1,"cool":0},"flJg9y8i_4iIsLiwa72vTg":{"text":"Just another reason we should check yelp first. Crazy long wait for gumbo and poboy on a s","useful":1,"cool":0},"sOKQ1A7UqAqUl2nE6H8Q1g":{"text":"Today was the first day I ate something without checking reviews first and what a mistake!","useful":1,"cool":0},"8qHaOOIQZUHnHGpodJ0UqQ":{"text":"If you want to go through the trouble of finding terrible New Orleans food & service, here","useful":0,"cool":0},"JKY9BRMAPm5PEYlJizsq2A":{"text":"Service was slow but the waitress taking our order was polite. Stopped to try the gator on","useful":0,"cool":0},"wcg_raShBHR_pT1-wgT0FQ":{"text":"The food is alright. We're a little disappointed that the food was bland. The seafood plat","useful":1,"cool":0},"eH9npeOsOze7_GZyYh23iA":{"text":"Agreed with all the bad reviews earlier. Should have checked Yelp first before I order! \n\n","useful":1,"cool":0},"xIqkF8Aq9CsinicwP2P_fQ":{"text":"I loved my 3 egg omelette with crawfish! So delicious! The atmosphere is nice for people w","useful":0,"cool":0},"unOCuAxxP4iI2YdfjYCySQ":{"text":"Try it for yourself before ignoring the place! It was our first time eating here and the s","useful":0,"cool":0},"5OcZmbAGmt5IehNu3DwLvg":{"text":"Way over priced! $15 for a shrimp poboy with a side of potatoes. Sparce lettuce and little","useful":1,"cool":0},"bFu8x0gGDabEFqR9umEsJw":{"text":"The food is way overpriced for what you get. I ordered the po boy and the bread was stale.","useful":0,"cool":0},"mYffOzB6s2Z0T7xc6V2WVg":{"text":"Wanted some authentic New Orleans food. the food was definitely not what I expected. I pai","useful":0,"cool":0},"2qbosOla3MduXXhL_ClDmQ":{"text":"It's fun to walk through the market with lots of food options. We sat at the bar counter a","useful":5,"cool":4},"m0Uz5YB00b6ma_uMwCSPlA":{"text":"Creole, not good \nPoboy, not good\nBbq shrimp, not good \nGator bites, not good...\nNo flavor","useful":1,"cool":1},"DOJzCETTlycTmaIyuoRs4A":{"text":"Best boudin in NOLA. Sat right at the counter and enjoyed the experience. Tried to make it","useful":0,"cool":0},"vQZgXjrEu7lSsHoLHwL0Fw":{"text":"So many better places to try cajun food nearby, so better try them instead. Got crawfish p","useful":0,"cool":0},"v3fe3ndE9yqh4k9MhKGEMA":{"text":"If you have to self aggrandize yourself, then you really know you are in trouble. \nAn exam","useful":7,"cool":4},"TeOkOeNbM5vKJPBSG3uS2A":{"text":"I had a craving for soft shell crab sandwich and decided to try this one. It was $14  ( a ","useful":0,"cool":0},"zuA4OXuZlklO_DdbUTzMEg":{"text":"Meh. We had the sausage Po Boy and the fried shrimp one too. Nothing special, it was short","useful":1,"cool":0},"HwyE7QsGso-xJ_i7ZTOb2g":{"text":"I just ate here this morning. Such a disappointment and waste of money. I had the crawfish","useful":0,"cool":0},"kyOa1AvzfrlgUosOEw7bdQ":{"text":"This is by far the worst stand in the French Market! We ordered a lobster Po Boy for $18 w","useful":1,"cool":1},"BG8tXYDppuxMDeLVaJnXFQ":{"text":"To be honest this was the biggest let down of my trip. The big white lady at the register ","useful":1,"cool":0},"3ZIwldv_yEth9hzh_iuRsA":{"text":"I love this place for their large tasting \"bar\" area of hot sauces.  I can handle a lot of","useful":1,"cool":0},"JoV13llmfgKYb1kVQXcAvQ":{"text":"Do not be fooled. This place is terribly managed with peoples' orders being completely out","useful":1,"cool":0},"sNo5PN8oKxLww8R8dbuduQ":{"text":"My husband and I went right before the Krewe de Vieux while the NBA Allstars game was in t","useful":0,"cool":0},"BkMa0Tva-cVokctkLKgKJw":{"text":"Took over 30 minutes to get a nasty hamburger.  It was dry, over cooked and overpriced. Do","useful":0,"cool":0},"mHqPZNKTocS7V7TZqt3ekA":{"text":"This place sux... slow service, food was burned, cold and over priced. I'll never order fr","useful":1,"cool":0},"w90lf6-eD2GTj6YwrAouJg":{"text":"Such great food! The people that work here are very nice & sweet! Great hospitality !","useful":0,"cool":0},"oGHuUyyBsSSmy5qIHgIvww":{"text":"Wasn't bad, but with steep competition nearby, definitely not one of the best places to ea","useful":0,"cool":1},"LfKpBASPEx138U62-Ai0oQ":{"text":"Do not eat here!  Hair in food. Customer service was horrible.\n\nWe ordered the crawfish et","useful":0,"cool":0},"CLq-hTxX1Fap1q5Xx-Mh4w":{"text":"Of course this cafe with ample spices and sauces caught my attention as a possible lunch s","useful":3,"cool":1},"oJrNuSjMqUG_yhb4VSKatg":{"text":"The food was not fresh and the order did not come out together despite the request for car","useful":0,"cool":0},"4l1pUni-9MxOfBHBzUvyfQ":{"text":"I ordered a bowl of seafood gumbo and that tiny bowl costs $8 doesn't even have a piece of","useful":3,"cool":0},"FQTb_mQSVQRL07jd9qJZsg":{"text":"I wish I would've read these comments before trying this place out. I was walking by (afte","useful":1,"cool":0},"T6TPmoGkVwKSnYesOtrVCQ":{"text":"We had a shrimp and a soft shell crab poboy. The shellfish was ok but the sandwiches were ","useful":0,"cool":0},"qCKSaWVehJ7X5tNVhg_XuA":{"text":"We were from out of town and my husband ordered the jambalaya and I ordered the crawfish e","useful":2,"cool":0},"HWrBTt5_EOulQfh_rCB8dg":{"text":"Worst part of our trip to New Orleans so far. Drink prices were outrageous.It was seven do","useful":1,"cool":0},"a1zTxx33Hno3K4OPnTPlgg":{"text":"This place is located in the French Market. They have an extensive menu and there were man","useful":0,"cool":0},"UyW4YbLhSEHgVkheRNpudg":{"text":"Yeah, this place is pretty terrible. I'm sitting at the counter now. I wish I had read rev","useful":2,"cool":0},"TIg-uPmyDjnWPWjQAN8Omw":{"text":"AVOID AT ALL COSTS. I mistakenly didn't look up the Yelp on this place prior to going & th","useful":0,"cool":0},"NExsYW-DUI0cFeSK8ZwQpg":{"text":"Probably one of the few spots in the city to get a somewhat healthy bite at. \n\nLOL! Hey, t","useful":34,"cool":30},"RwFiUNUjojupejsEAt9N_g":{"text":"Don't do it!  It's tempting to order a lunch as you walk through the French Market but res","useful":0,"cool":0},"fSUxFGeI6XIqBSli3amDDQ":{"text":"We got the gator on the stick because it sounded unique. We wanted to try it out since it ","useful":1,"cool":0},"wzXZtAiTfe2FzfmorgMO5Q":{"text":"I didn't buy any spices (overpriced), but I did eat here.  Decent food.  The voodoo burger","useful":0,"cool":0},"UmNzqTuTkzh2Wxmc5p__NQ":{"text":"Having stopped here before, but finally realizing its really about the spices they sell, t","useful":11,"cool":7},"6OIW0wGYknvlJMP22mwgig":{"text":"Ordered the vegetarian jambalaya. Their big vegetarian signs suggest they care about provi","useful":0,"cool":0},"u6Kbcz1Cd37DZ5dSVG5KmQ":{"text":"I also was not impressed with the wait and the quality of the food. Placed order on a frid","useful":3,"cool":1},"eK3xEXd-c_vsPofbePNaqA":{"text":"We stopped by here while browsing the French Market & ordered the bread pudding with rum s","useful":0,"cool":0},"DGegFI8tCa7kTtuXIAAOIg":{"text":"Whoa this place is not great. It's located right in the French Market and I expected it to","useful":1,"cool":1},"rG-r2KSFkHnO_fDybewehw":{"text":"Try the gator.  Warning it's pretty spicy here, but worth a try.  Wish I could get this di","useful":0,"cool":1},"NaxD7Kn0ZHKiqWrDEVbHKw":{"text":"This is the worst food we had on a week long trip in NOLA. Waited 40 minutes for po boys w","useful":1,"cool":0},"1FGRWvejDh8S0rwdopW6cg":{"text":"SO DAMN GOOD!! Thank you for authentic creole gumbo made the right way, it was delicious a","useful":0,"cool":0},"2YusWn2O_2mwzoUcXFqveA":{"text":"Thought this place was pretty good.  Had the Creole and it hit the spot.  Perfect if you'r","useful":0,"cool":0},"hKpHyUp4bRUO43ZXhmrBdw":{"text":"One of my Facebook friends recommended Nawlins in the French Market. Three of us ordered f","useful":8,"cool":2},"0HB2UnTFfz4DCamtaJP6Eg":{"text":"This is the worst experience I have ever had at a food stand. I ordered two dishes: dirty ","useful":0,"cool":0},"aHWYZ70UuKwNLhIuObs2cA":{"text":"This place is an absolute disgrace! Prime location in busy farmers market guarantees non-s","useful":2,"cool":0},"0KXhqM2hmF9UtHKZDADU-w":{"text":"*** TOURIST TRAP, WORST SERVICE AND ATTITUDE, SCAM LOCATION ***\nFirst day in New Orleans, ","useful":2,"cool":1},"ubWsoWHGWAhjs2aWmryhQg":{"text":"So so so bad. Cooks not wearing masks, food deplorable. I literally spit out my first bite","useful":1,"cool":0},"sItBW3tOJyYzpPH9Eath-g":{"text":"The line was almost an hour long! We thpught this must be a sign that the food was good. N","useful":0,"cool":0},"Hsw7wFw_x4hKDOoSgt7rgA":{"text":"Disappointing.  Ordered a crawfish po boy.  Barely any crawfish on it for almost $20.  Was","useful":0,"cool":0},"yDqUQOcKLBOAE6zXTZwkUA":{"text":"Long wait and the the gumbo is not very great. Lacked seasoning. I would expect more from ","useful":0,"cool":0},"EbQw_4axaKA7bqwknzT5VA":{"text":"Spicy little bar and spice market in the French Market. \n\nVegetarians and pescatarians - y","useful":3,"cool":0},"aXLsSMgq1sp5Y72Kxg61Vg":{"text":"the absolute best at french market. must have. when we come back, this is definitely the f","useful":0,"cool":0},"pETKCxu79VLFE6Lyu2sVXg":{"text":"I was craving gumbo so bad but none of my group members wanted to stop by somewhere to eat","useful":0,"cool":0},"K4KZRj2WwIKk_Ebu6-2x8A":{"text":"I t was just okay, nothing stellar.  I had the pan perdou and he had the shrimp and grits ","useful":1,"cool":0},"5lyykNJ2lTA7y20yeJkBng":{"text":"This is undoubtedly the worst poboy ive ever had and my wifes gumbo was totally inedible. ","useful":1,"cool":0},"CsOyIdZeY3aX6uRDf22vxQ":{"text":"I came to the French Market for a day trip and came across this restaurant . The line was ","useful":0,"cool":0},"mx53vgiLzJG-TCHaMk7OEQ":{"text":"Located inside the French Market warehouse with open walls, this is a fast food kiosk with","useful":42,"cool":43},"BdkEUWaG2daNj8MyN_6EWQ":{"text":"The food we had was not very good. What can I say! Jambalaya was not good, small, and dry ","useful":0,"cool":0},"YEPWmvh4wq_6jxrg_XLkgQ":{"text":"Took entirely to long to get our food, the employees did not have on masks, the cooks up f","useful":0,"cool":0},"FmiuAKoRGhX-dgQph16TMA":{"text":"Food was nasty and cold. They don't do refunds and to top it off the server was extremely ","useful":0,"cool":0},"fx-Qj6qPSr0rFT05Audd3Q":{"text":"This place is an absolute disgrace! Prime location in busy farmers market guarantees non-s","useful":0,"cool":0},"R7Rsl8xTRzaq182_V1eN_g":{"text":"Absolutely worst experience while visiting New Orleans.  I noted a number of famous people","useful":0,"cool":0},"twlwnWJUg1H9TLsrWmBl6Q":{"text":"The food here is okay, but definitely not worth the price or wait time. I wanted to try al","useful":0,"cool":0},"ba-XmUoCELsVGMA1-D4pLg":{"text":"We spent $32 on a ham and cheese po boy,alligator bites, and two medium drinks. The alliga","useful":0,"cool":0},"c2JTtOZFYSjfA0jy1LD9ow":{"text":"It feels weird giving this place a 4 star review when their average is 2.5! Everyone seems","useful":2,"cool":1},"DgaWt3A4ospVpxkO5lT3yg":{"text":"This is located in the French market. They have chairs to sit which was convenient. The me","useful":0,"cool":0},"xa5_6ub8r3wXQ8y4cufV3Q":{"text":"Food was good-we tried the grilled shrimp po boy & Cajun breakfast with gator. Tasty food.","useful":0,"cool":0},"vVmocXV0SckKXkyWSKadug":{"text":"Pricey food, long wait, but friendly service.  The Cowan turtle sounded exotic, but the ta","useful":0,"cool":0},"vhakSgFaTWV5VEOrxkYFwg":{"text":"Took forever.  Huge waste of time and no idea what makes it world famous.  Incompetents wo","useful":0,"cool":0},"-ImFeL8EjADMokHf0AZPWQ":{"text":"This location is in the middle of the market. I have high expectations going into it. Orde","useful":1,"cool":1},"6q32m7Fr89dtjuyoI_QGeg":{"text":"Ok let me start by saying, do not eat here!!!!!! this was the worst place I've been. Waite","useful":0,"cool":0},"It1GoaerZulE7UQfwen8cw":{"text":"Totally disorganized. Everyone waited at least 30 minutes for food. Orders came out incomp","useful":0,"cool":0},"1LthclXtsbLqLm3u9h6Cxg":{"text":"I don't understand the negative reviews...this place is delicious. \n\nIt's located in a mar","useful":8,"cool":5},"2bVoTwuAFH1exVTWSjmbHw":{"text":"The line was long but I was craving crawfish so much I waited. Hot and spicy marinated cra","useful":0,"cool":0},"Q1HIglMrFXkm4Dva27JNXg":{"text":"Sadness. \n\nConsidering the name \"World Famous\" and the \"Food Network\" stamp of of approval","useful":3,"cool":2},"Wprq_eyoRBV1wFeatB4WpA":{"text":"if youre planning on grabbing something here, beware, there could be a wait. the prices ar","useful":4,"cool":4},"V0uQnqMPKPRWvkIxUBiFwA":{"text":"Honestly the word \"World Famous\" should have been my first tip off that this establishment","useful":6,"cool":1},"PzfaxqNEk9axIKoAd3p5GA":{"text":"Great friendly service, talked a lot of smack about the saints vs 49ers. My first Gumbo in","useful":0,"cool":0},"Nc85sggKROj8DJjOCpwQcQ":{"text":"Was not crowded, but took 45 minutes to get the food in installments. One plate came out w","useful":0,"cool":0},"ero9v9WsyFEngRsRuokqvA":{"text":"This place was one of the worst places I've ever been to. \nThey are extremely overpriced a","useful":0,"cool":0},"nmv-EwTHAhCiawMEu90r7A":{"text":"STAY AWAY FROM THIS PLACE!\n\nIf I could give this place 0 or negative stars I would for 2 r","useful":0,"cool":0},"JFcjEbUNImrynmYbqKG5ZA":{"text":"Don't waste your time!!! They are super slow and it took over an hour for one plate ! I wa","useful":0,"cool":0},"hVX3WPjN1EZiWwF54rx_xQ":{"text":"Had the seafood gumbo here, very good and spicy. Gator on a stick was fantastic. Very soft","useful":2,"cool":0},"GbzibLUk4pHsb4AjQ7vWCA":{"text":"The recipes are OK. The service is extra bad. We ordered two dishes - jambalaya and small ","useful":0,"cool":0},"DjQLYj-jcBFKLRwl3hvKSg":{"text":"I don't ordinarily give this kind of review but it was so disappointing  that I had to con","useful":2,"cool":0},"N9OFXy_qjZ-miMwRR7rpEQ":{"text":"Ordered a lobster tail poboy and the gator on a stick. Needless to say, the poboy was blan","useful":1,"cool":1},"9xlgbOH65TORHPFL2LnExA":{"text":"Not a bad place to get some breakfast in the French market section, with fairly good price","useful":2,"cool":3},"ulNW-Spk8M7a85uhk_vPPQ":{"text":"I was lookin for a place to try some gator. I went for the gator bites just Incase i didn'","useful":1,"cool":1},"ka6-_wA8wxcgO7u9YybP1Q":{"text":"Complaint Details\nI purchased the Red Beans & Rice dish from World Famous N'awlins Cafe fo","useful":2,"cool":0},"kcOw1qh64zTGkntmF8ZHSA":{"text":"World famous? Whose world? Is this self proclaimed? I tasted nothing from their \"world fam","useful":4,"cool":2},"_clTpNmdDrk2q0QX1t94Qg":{"text":"Huge selection of spices in the French Market. Kindof a one stop shop.\n\nI was at a cooking","useful":1,"cool":0},"WDTMcfne-_FqEKB_e8Y--Q":{"text":"Great place for organic flavored and non-flavored coffee. I have yet to try their food.","useful":4,"cool":1},"_7oKsLMbL9rzs4qy9OyWjg":{"text":"Sat down here with my fiancé for some BBQ shrimp. This item is over $20 and barely feeds t","useful":0,"cool":1},"i6auz16bfUJ1xZmn9C4TIA":{"text":"It was great.  My friend and I were in vacation in NOLA and decided to go to the French Ma","useful":1,"cool":0},"d-0n6jruNn5RmHoV8unHyg":{"text":"Easily the worst meal I had this past weekend in New Orleans. \n\nI had the seafood jambalay","useful":6,"cool":0},"kkN9kcl_L_3YNeUZgXk5Yw":{"text":"Go straight for the OKRA GUMBO, you will not regret it. Also great place for people watchi","useful":0,"cool":0},"vtChtM5_7tosDFofZNQd8Q":{"text":"The staff here is the absolute best. Get Brandy to give you an astrology reading while you","useful":0,"cool":0},"ue1Cks8NKKc3yZrCxj8i4w":{"text":"Too salty and gross tamales. Very fishy po boy - should have checked yelp before ordering ","useful":1,"cool":0},"CeM8aDhmfO1UbvGy8X2W5A":{"text":"I think my brother mentioned that this place was on Food Network (or a channel of that sor","useful":1,"cool":1},"np-PExBbjQsZD3pbT8qyEg":{"text":"For starters world famous I think not they don't even deserve a one star rating but I had ","useful":0,"cool":0},"TnZkzwVOJsu_5WeMMiLi5A":{"text":"If it were possible to give negative stars this place surely earned them. They had signs a","useful":2,"cool":1}}