{"65_CF9T7m7VTodo5AC5ZWw":{"text":"Table for 10...we were seated quickly, then....it went all wrong. Bug in salad, orders inc","useful":0,"cool":0},"JQeXWDmuFTNYAt0abhj7Kg":{"text":"went here and got a philly cheesesteak sandwich, which was about average..had better. but ","useful":1,"cool":0},"yXK6EvQ7UU__DwHWHhd-Sw":{"text":"I googled best seafood omelette in New Orleans and it came up Daisy Dukes so off we went. ","useful":0,"cool":0},"0W3CT6sIUnnDFwgBIWVeMg":{"text":"This is K's and my go-to spot when we're hungry at like 11 pm, which actually happens quit","useful":6,"cool":2},"QGn8hbzUcZzE0VUKAXhSyg":{"text":"LATE NIGHT NOLA  it's not gourmet but it'll do and you know what  the people working there","useful":0,"cool":0},"8SniXqaW4FfbuPMhET7dSw":{"text":"To start, I was at Daisy Dukes on Fat Tuesday for lunch, and the serves was wonderful, the","useful":2,"cool":1},"BpuDYcSuJ5xlWjbm2jhJOQ":{"text":"Go to the one on Carondelet. Food is a lot better and their is less hustle and bustle. Was","useful":1,"cool":0},"5fMqaG2ijs-A4UCwXdPt5A":{"text":"Everything was hot & delicious. Highly recommend the mozzarella sticks, chicken tenders an","useful":0,"cool":0},"E3gtUsGXYnxxWJ84h9xpNA":{"text":"Good food at reasonable prices. \n\nThe fried green tomatoes were very good but a bit bready","useful":8,"cool":5},"uZWiUhJmlRSZsP8D-md5Rw":{"text":"Got into town late Monday night and yelp suggested Daisy dukes and then the valet driver a","useful":0,"cool":0},"618MuzhuEl_xmai1Whrm0Q":{"text":"Popped in for an early breakfast.  Seated quickly our waitress was attentive.  The food wa","useful":0,"cool":0},"I2S6ifI5ie_w9fwjO2DYHg":{"text":"Greasy and average food. But a great experience of going to a dive bar - breakfast style. ","useful":1,"cool":1},"I2J72MgVMXJlI2snift3hQ":{"text":"Good food and fast service but Bloody Mary wasn't all it was cracked up to be. That's ok t","useful":0,"cool":0},"F5zOC1HK5pfOYDucdFJY0Q":{"text":"Service is quite fair... oysters were really good, the lb of crawfish was tasty, the gumbo","useful":1,"cool":1},"YqYVreSi6T3cH7-0HvKBUQ":{"text":"Their gyro is pretty good but really greasy. I went there in July and the meat was better ","useful":1,"cool":1},"0sve26Cu7_W45ayTh2jL5g":{"text":"Food was decent, but the wait was horrible - waiting for menus, waiting for our bill (15 m","useful":0,"cool":0},"OpFPh4djdPF7HRmGuZG7gg":{"text":"Food: 3.0/5.0\nService: 3.5/5.0\nValue: 3.5/5.0\nDecor: 3.0/5.0\nOverall: 3.0/5.0\n\nStandard di","useful":0,"cool":0},"_gvShhQ5tSKQdzWAqLS3xQ":{"text":"What a phenomenal feast. Come here for the crawfish Monday through Friday noon-6 for their","useful":0,"cool":0},"csPwQJQtekwkhQRq5ZSj6w":{"text":"Reasonable, cute little breakfast place in the Quarter that is not overly crowded. Got in ","useful":0,"cool":0},"RrqQ0-YRMMe2CkOXhsZjNA":{"text":"Small place, nothing fancy, but the food is good and reasonably priced. Even my picky eate","useful":0,"cool":0},"enIml0Xvsp21qlV08XxWSg":{"text":"Great food relaxing atmosphere exactly what you want in NOLA. Best of all my bill was only","useful":1,"cool":1},"Pzzy8Jg8au0mHfQTyiZ9AA":{"text":"Got the pancakes for breakfast and they were amazing, light and fluffy and did not turn to","useful":0,"cool":0},"-j9h2bejmdcKBQS2WQCaXA":{"text":"I don't know. I just don't know. If you like greasy spoon type places this is for you. I d","useful":3,"cool":2},"df3W_z4JqwleQkASY7gRMQ":{"text":"The many times I have been to this location, I don't remember the pancakes being bland. Re","useful":0,"cool":0},"Sa_YJSRSbIAAO5IYHsn-AA":{"text":"Food was just okay. We both ordered the Seafood omelet and they were overcooked a d dry. T","useful":0,"cool":0},"fpWE1GSQ8qUkPPE9inSYqg":{"text":"Good, cheap breakfast. Eggs, bacon, toast and hashbrowns only $4.50. On top of that this p","useful":0,"cool":0},"UoR_fivWrUbBHeXTm0gwQA":{"text":"Friendly staff, great Cajun food near the quarter without spending a lot.  We were there 4","useful":0,"cool":0},"5FQLXdeP9VD4q2C6yYO0bQ":{"text":"Nice hangover food! Cheeseburger was bigger than my head, plus they have a bottomless Bloo","useful":0,"cool":0},"pWEQaNG4952lHHKVI5o3bQ":{"text":"Great place to eat late at night. The food is good, and won't break that bank. This place ","useful":0,"cool":0},"H9TDDHWv6DDrAeVfB7U3nw":{"text":"Came for a late night snack. Service was very friendly, and the food was good. Shared an o","useful":0,"cool":0},"vKfgjjKzEvPqCMk6wBOFQQ":{"text":"This place is a hidden gem. It's one of my favorite breakfast/brunch spots. The biscuits a","useful":0,"cool":0},"9mDYBg5yc75qKDLFKH2tzw":{"text":"Daisy Dukes tried unsuccessfully to scam my girlfriends out of $20. They were a large part","useful":0,"cool":0},"d9GPlpexFBUK3ciAOyKXLg":{"text":"It was great! I had the Chicken Philly Cheese and it was so much that it could hardly fit!","useful":0,"cool":0},"AkZZ-SnbUqMn4J00-avx-Q":{"text":"This place was recommended to us because it was an affordable breakfast, and it was afford","useful":0,"cool":0},"Ufi_iPAade7bdfxGqm-fPA":{"text":"We had our breakfast delivered to our hotel twice during our week long New Orleans vacatio","useful":0,"cool":0},"8uGUW22jc15NLAotwGkx3g":{"text":"I ordered the scrambled eggs with alligator and it was really good. The crawfish was also ","useful":0,"cool":0},"JkjJO63apU-lJe1zKHIMPA":{"text":"This is my go to spot whenever I'm in town. It's open 24 hours a day and you can always ex","useful":2,"cool":2},"TlkpbNinmt4HSJdNrOnflA":{"text":"Waitress was very nice, but none of the food stood out in any way. My buddies got some pou","useful":0,"cool":0},"2_M5dy3x7Da1oqZm-uIBtA":{"text":"By far the best gumbo in New Orleans! \n\nWalked right in and was seated in less than 5 minu","useful":1,"cool":1},"TeV7TlerBUU-BmRXUrUL7Q":{"text":"Awesome for breakfast can't say enough good things about our server Daisy she was outstand","useful":0,"cool":0},"ipUiCgHQb1W8B1It_QmKVQ":{"text":"We were there for breakfast around 4:30 in the morning. Since they are a 24 hour place, yo","useful":0,"cool":0},"Xj_DwQY8CgG1XR6BcouG8A":{"text":"Had the spicy gumbo. Wasn't too spicy at all to my dismay. No gumbo file either, looked at","useful":1,"cool":0},"ep2OnSgsDjyjCcRHsq5RAg":{"text":"I think faster service would be nice but you cannot force perfection in a touristy area.","useful":0,"cool":0},"W1dtshgREARMQM4Ak1tM8g":{"text":"Waited outside to be seated and took forever to get a server. Restaurant was not even busy","useful":0,"cool":0},"hwNol8YKmKO4qtS6mrD3Iw":{"text":"Great Value, Big Portions, Yum!\nWe were tired, hungry and SO glad we stopped in. Service w","useful":0,"cool":0},"DfzxyBQ8WIpVrm6F1V-Ujg":{"text":"Slow service, slow kitchen, mediocre food. Don't bother. Although great for suburban touri","useful":0,"cool":0},"uXAdI9_Q6-qNLt20M9izhA":{"text":"Great food for the price. Large portions, straightforward. We had breakfast which was quic","useful":4,"cool":3},"1oRgAT-IKN_tkH-cTtl5tA":{"text":"New Orleans hidden treasure! We found this little spot at 2am off the beaten path. Quiet l","useful":1,"cool":2},"qlZ-BYYF3RzcfVZkl0LO6w":{"text":"Good inexpensive food any time of the day.  The staff is native New Orleans and treats you","useful":0,"cool":0},"skArX4d10FW8rzSADvhPLg":{"text":"This place was recommended by locals so we thought we'd give it a try. The bottomless Bloo","useful":0,"cool":0},"eRqhf0avr_m_6PgBgEXMlA":{"text":"The food was awful... I was expecting comfort food and got bland barely warm crap. You don","useful":0,"cool":0},"KgmyhLoUW4v_Pq8D3uQVQg":{"text":"Don't miss the Cajun Omelette and make sure you get their bottomless Bloody Mary that's co","useful":2,"cool":1},"zOc_xop6tqT9hkOnj6gG4g":{"text":"Daisy Dukes was a good breakfast place. \nIt's not your fancy restaurant but the food is re","useful":0,"cool":0},"QYbv4VjbUN9JuTeXldfx7A":{"text":"Had me a veggie omelette with a bloddy Mary to start my day right. It came with a cup of f","useful":0,"cool":0},"dAEM61OGZmQpcO21RM01gw":{"text":"Daisy Dukes is great! While I have only checked out this place after hours, our group made","useful":2,"cool":2},"DNOuQMlGIpsUNKsi0_Sk_w":{"text":"I was with a group of friends wondering around for late late night food, when a local sugg","useful":0,"cool":0},"rY0ayexAoOuAK3sRil87sA":{"text":"Went specifically for the wings, and boy were thy a let down! We ordered the lemon pepper ","useful":0,"cool":0},"yqLoago8svmjJsWRqilRSw":{"text":"Horrible service and poor management. Very rude when asked to split the bill between coupl","useful":0,"cool":1},"eT0Sk_oBZbAjmdpeGvXwzA":{"text":"I know a lot of people like this place and I did at one point, After future visits Ive cha","useful":1,"cool":0},"l7owg5sq4NfJlhlfxugRVg":{"text":"Like a lot of other folks, we came here when the line for Jimmy J's was just too long. Thi","useful":0,"cool":0},"fxqYefNrgX2cNNT0uTA3Uw":{"text":"Very selective service. My waitress didn't want to be there, neither did the manager, from","useful":0,"cool":0},"QrjM01zDCUBVPAh9FVDqqQ":{"text":"Walking around and saw this spot, so in we go. Pretty small place with lots of art on the ","useful":0,"cool":0},"TMww9gzVN8DJ-61tFW4IMQ":{"text":"Perfect place to stop in for breakfast after a long night of mardi gras fun. The spicy blo","useful":2,"cool":0},"Jh6NohvpEHcGsx5N4Aikbg":{"text":"The food tasted good and the prices were very reasonable.  The interior wasn't the best an","useful":0,"cool":0},"hfDcvl2Rauz-a6H9v7tIEg":{"text":"My 8 year old daughter said, \"I thought Daisy Dukes has the best pancakes I've ever tasted","useful":0,"cool":0},"wG-Atj9zeKlGJQs0H4Xv8g":{"text":"It is open 24 hours, that's about the only reason to go there... the food is nasty, the se","useful":0,"cool":0},"SC_KbHTXGzptPThrQuthJA":{"text":"Next to Marriott Hotel 555. Just outside of the rear entrance. Kinda divey but great for a","useful":0,"cool":0},"8iv_bBpixhctTHESdVXzhA":{"text":"I go here at least twice everytime I visit NOLA.  The crawfish etoufee and alligator sausa","useful":0,"cool":0},"ThbwKKFGmTaGBRVRBeggSw":{"text":"Got the shrimp basket which said it was served with cajun fries.  It was a ton of shrimp o","useful":0,"cool":0},"fqO9eH7pW0xHZcx59kw4Rg":{"text":"This place was highly recommended by hotel staff at our recent visit to New Orleans. We we","useful":0,"cool":0},"OGGto6zlKtfGx-LvXHNwjg":{"text":"OPEN 24 HOURS!! This is the place to eat breakfast and get it like you want it. You want y","useful":2,"cool":2},"xZUQ2LirVqH6LzHFc0xQiw":{"text":"Went for breakfast and it was very good.  I would classify this restaurant as a dive, but ","useful":1,"cool":0},"jYIBbrsC3IhbE0BOi3NTug":{"text":"small local spot w awesome food!!! Nothing fancy but the food and service are terrific","useful":0,"cool":0},"MqFb0ayOiEab6RZYoXSQ3g":{"text":"Great little nook in the crevice of New Orleans busy downtown area. Nothing huge very pers","useful":0,"cool":0},"f6Ylt3aeoaHFscNKQnxNYg":{"text":"Your money is better spent anywhere else in the quarter. Not worth the 30 minute wait in t","useful":0,"cool":0},"W3f1obSALvPl4HrUzMoMjQ":{"text":"Truth - I only came here for the unlimited bloody mary. \n\nThe first time  - I ordered take","useful":0,"cool":0},"Y6wHF0LgVDGKq7J9JRzFeA":{"text":"Service was okay... Price would have been reasonable until I received the starter dish \"cr","useful":0,"cool":0},"jcW60MlRHUMtlXgZnjseNw":{"text":"Should have known this off canal place was going to be terrible the moment I walked in. Se","useful":0,"cool":0},"sgP3T3mgMlh_g5-rc1wHbQ":{"text":"We ate here this morning before the parades in the French quarter... Man, I'm glad we stop","useful":0,"cool":0},"c1XNrwoXMumLL7Vn5HkKAw":{"text":"Reasonable prices, the ability to order easily ala carte and convenient location. Only com","useful":0,"cool":0},"i4jhUEMfs18iMeNOLK83BA":{"text":"Eat at Daisy Dukes for great breakfast anytime. It was late night; I had hashbrowns and sh","useful":0,"cool":1},"pfD5WpyFkrPKIIA0hn9XyA":{"text":"Excellent Bloody Mary!  Great spicy sausage po-boy.  Fried green tomatoes were really good","useful":0,"cool":0},"9YtsktwqfC9ffwta4Im7MQ":{"text":"We stopped in twice during our stay over 2012 Carnival season and loved the personal atten","useful":0,"cool":0},"b12YcLLGebkNkCx3l3DTPg":{"text":"This IS THE BEST BLOOD MARY I've ever had. No joke. I've never posted a review but I felt ","useful":0,"cool":0},"ol543pbd11lLrN4FVmDcmA":{"text":"Red beans and rice tasted like hot dogs and pork and beans...the shrimp po boy was just OK","useful":0,"cool":0},"w3iYNwiTAsoyWxSRqdGiLA":{"text":"Limited menu \nNo pancakes after 12\nRude waitress (white with short hair)\nManager wasn't co","useful":0,"cool":0},"yGRuasS-zZjx7J7PTRN4lg":{"text":"I would say the food here gets 3 stars and the price gives it an extra star! My friends an","useful":0,"cool":0},"UVf7JML0HA_Bs60V85lUtA":{"text":"Having not been to Louisiana in about 12 years, I was excited to have some real crawfish, ","useful":0,"cool":0},"BN6joweFydDcijXEnEInQQ":{"text":"Slow service - they sat our big party over in \"the bar\" section to the left and it was ver","useful":0,"cool":0},"ZT5X3uFeC9KQojHzTKtMrQ":{"text":"For breakfast on our final day, we wanted something simple to counterbalance Brennan's, so","useful":0,"cool":0},"xVAAqo8W11R0WrgWHUSt4w":{"text":"This is a great spot to check out if you are in the French Quarters, they are open 24/7 I ","useful":0,"cool":0},"0ndFGBD4VvAWMZRaZo_GJg":{"text":"I ducked in here today as it was raining.  The waiter talked me into a Bloody Mary \"unlimi","useful":1,"cool":0},"W8DHKaCEB7wZ41ZQYWWNkA":{"text":"We came here to skip lines at nearby restaurants. Big mistake! The food was terrible! I ha","useful":0,"cool":0},"8w6rJ6WEktmb1q88dXKU-g":{"text":"What a find.....no downtown prices herr and a great bloody Mary.\n    Was on our way to rub","useful":0,"cool":0},"sG8f-hs1Pc9E1B_Ehz70VA":{"text":"Ate breakfast here during vacation and it was a good experience.  Friendly staff and good ","useful":0,"cool":0},"tkeRgh1t86jFobJnPS0hSg":{"text":"This place has horrible service. The water took 15 mins and the food over 40 mins to be co","useful":0,"cool":0},"17ivkYGTMz2oXNpPgMzVOQ":{"text":"My boyfriend and I were starving after our flight to New Orleans, but it being midnight on","useful":3,"cool":2},"vTCw3AG4Ttkrf2EBSmNawg":{"text":"I'm being generous based my friends' experiences here and not my own.  \n\nI had a literal c","useful":0,"cool":0},"K63EwBZEz8HhTiKk6pO-EQ":{"text":"A solid breakfast and a good bottomless Bloody Mary. Good service keeps the Bloody Mary's ","useful":0,"cool":0},"1l6ae2NuxesxPdO-r0MSmg":{"text":"I'd give less if I could. Though all signs and advertising says 24 hours they were closed ","useful":0,"cool":0},"-pTFCnLlLhVxZb2tWUDTIg":{"text":"I'm always pleased with the food and customer service. The food is made to order. 24 hour ","useful":0,"cool":0},"o9r6Fat60qHdRxoHaLJvbg":{"text":"They have really good wings! But I ve had one of the worst experiences with the delivery f","useful":0,"cool":0},"rSIiNhE28lz3z6teYoghJw":{"text":"Normally I prefer not to dissent from the masses, which seem to offer a mix of reviews -- ","useful":1,"cool":1},"_WUJSOZx1MmqUKdoi4hONQ":{"text":"Long Island iceteas and seafood omlett.  Yummy. Service was a little slow but it was a Sun","useful":0,"cool":0},"Kc498tA1kVKUWNd4PnzmaQ":{"text":"I'm so glad we found this restaurant!! It was late and we were looking for something famil","useful":0,"cool":0},"IhIevE9emRyQBoGx8WNsDA":{"text":"With so many fantastic restaurants in NOLA you don't have to put up with ignorant waiters,","useful":1,"cool":0},"jFW-bidpt-XsQJH2WPtnVg":{"text":"A solid 4 stars. This restaurant stands out for value for the money. I was in New Orleans ","useful":4,"cool":0},"a-o-1n45ddpDtiuvHcvqNg":{"text":"My girlfriend and I were hanging out in New Orleans in the rain and needed a quick bite to","useful":0,"cool":0},"OYM50ZJH8yGT36xbCRahUQ":{"text":"We stopped by here yesterday because I was on a hunt for boiled crawfish. Being that it's ","useful":0,"cool":0},"dmIMBxAv3fT3ebNTYW5Feg":{"text":"ALL YOU CAN EAT CRAWFISH\n\nYES\n\nBelieve me, it's not as much as you'd think. Between pinchi","useful":0,"cool":0},"krSXvPg-sG7M6tevNNvhZQ":{"text":"Gumbo wasn't bad last time, but tonight they didn't feel like sitting me  at a booth, desp","useful":0,"cool":0},"25t2S3cHh5cWgtAZyn0qCA":{"text":"I never thought I'd find better wings than Wingstop, but daaaaaaammmmmnnnn dem wangs theau","useful":3,"cool":4},"0st0zouhj6p1AllVLKyrkA":{"text":"Dirty, terrible food and 1-star service. I don't know why people are giving to this place ","useful":0,"cool":0},"MdpA5s1ubLqXgPl7Jk5YcA":{"text":"This is a little hole in the wall right off of the French quarter.  The food was good and ","useful":0,"cool":0},"DtOU2-4K-XxUphUtXy4QiA":{"text":"Kids liked their seafood platter... But my Po Boy shrimp was terrible.  The shrimp tasted ","useful":0,"cool":0},"xitGHtHsQ-tQ-Tqr_wjOpQ":{"text":"Excellent breakfast.  Had the two egg breakfast with hash browns, sausage, biscuit and pan","useful":0,"cool":0},"F1oWkLxRqTalos0DfWzAMA":{"text":"Food was decent. Front of house and bathrooms are a disaster but that's expected in the qu","useful":0,"cool":0},"kQtCHiNCh7bFwFEfT2fPAA":{"text":"Sooo good! I love the shrimp poboy! One of the best I've ever had! Hands down a great plac","useful":0,"cool":0},"ByIsM4FbAq3Z3WK1a-ohdg":{"text":"nummy nummy jambalaya. and breakfast 24/7! I love breakfast, so any place that serves brea","useful":0,"cool":0},"ScuLc09S2GQG31fOnCKnAA":{"text":"After three days of grabbing Starbucks for breakfast, we decided we'd have a sit-down brea","useful":1,"cool":0},"seQHKuk3yoi84zty-bEqIQ":{"text":"Decided to try this place with a group of friends since we got tired of waiting in the lon","useful":0,"cool":0},"2MPK-Rc50lHhzMdxZz4lQQ":{"text":"Cravings satisfied. Check. What a perfect late night hotspot! \nAmbiance: low key restauran","useful":6,"cool":5},"BLecmJnjAYxJ2u2Wz_5G_A":{"text":"The wait was crazy, mainly because the lady working the door decided to have a 30 min ciga","useful":0,"cool":0},"etiN7LwHRY2O5hk0-ZXH-Q":{"text":"We stopped in for breakfast. We waited a LONG time for someone to come outside and acknowl","useful":0,"cool":0},"UQ8L9GlUrBjGoCueuwnSyw":{"text":"Breakfast was just good but my hash browns tasted burnt. The Bloody Mary was disgusting at","useful":0,"cool":0},"CUs17zJsgpRm2FH0Nu681g":{"text":"There food here is really good and the service surprisingly is legitimate. I'd say tins a ","useful":0,"cool":0},"x245imgSzrXZkbwyPNUQ9g":{"text":"Every time I stay at Marriott across the street I've seen this place but never stopped. Do","useful":1,"cool":1},"V7kKqlhyNYUd5K66zVyaQg":{"text":"This was our last day here and we heard great things about this place. There was a wait to","useful":0,"cool":0},"IxgqpVMC2VVeBRKTMQsARA":{"text":"Had a late dinner, around 9-9:30, this particular evening. The arrival was a little discou","useful":0,"cool":0},"1FCoLnr8-S-8L6yLfaYHPQ":{"text":"Visited about 14/15 restaurants during our SB week long trip, and this was by far my absol","useful":0,"cool":0},"19Wl3p0tVmHuXxBmzyZg7g":{"text":"Came here after being let down by a previous favorite. The place is pretty much a dive, bu","useful":0,"cool":0},"FHtovgu6xUPkP_08JLIl-A":{"text":"I love Daisy Dukes, one of the cleanest places in quarter, open 24 hours a day, good food,","useful":0,"cool":0},"y-ViLsFtVVuZnh7cVjcuZA":{"text":"I'm so torn because the food was ok.  We went late at night, and ordered Bloody Mary's  (n","useful":0,"cool":1},"VFPwBpR52QscRWZIeXVR8w":{"text":"I usually don't write reviews but I just couldn't let this one go..I really was looking fo","useful":0,"cool":0},"BGYfrFFep1zQm-4ZSMVL9Q":{"text":"Daisy Dukes is a great late night (24 HOURS!!!) spot after some drinks around the Quarters","useful":0,"cool":0},"AXWClp20qhPfF1MkSCoQYA":{"text":"The food and service were both phenomenal! I was so hungry I forgot to take a photo of my ","useful":0,"cool":0},"SQJ0E5RDUCurzkwlCwJ7dg":{"text":"At first my mom was asking \"why do we eat here? I rather eat at deanies. \" after we try th","useful":0,"cool":0},"I_DIKCYNCR0CNmfvaWPaJw":{"text":"We came in hoping for $2.99 breakfast (6-9am only), but realized we'd missed it. : (\n\nThe ","useful":0,"cool":0},"slXWq7qYdthHFtbbbjWpoA":{"text":"Waitress Megan was tired or perhaps that was her personality.  The poboy special came with","useful":0,"cool":0},"J6d7rln2lPNnebmHlgjYHg":{"text":"Great diner to get food anytime in NOLA. I had the shrimp Po boy and jambalaya on a separa","useful":0,"cool":0},"-saYFZVqnti4s-Y2o91BeA":{"text":"The breAkfast was decent. The bloody Mary's were good too. The service was disorganized bu","useful":0,"cool":0},"G5pIHiInr9tmSRWxY4AD5g":{"text":"Gumbo was excellent! I had the 1/2 Shrimp Po'Boy and Gumbo. The gumbo had nice flavor and ","useful":0,"cool":0},"YVeMNDrzz9kT5RbKvbPvlA":{"text":"This was one of the very few places we visited in NOLA and didn't like.\nFirst of all, bf a","useful":0,"cool":1},"M0FzuDpvD65viJJoap5pHg":{"text":"Ehhh. Not overtly impressed by this place. Food selection was kinda small. Food was bland ","useful":0,"cool":0},"-ho44Tus-GxfS0ZDti-f4Q":{"text":"You would honestly think daisy dukes would be not the place to eat. But the food is great ","useful":0,"cool":0},"MpmtIKyINaL0w2S4oeaYYw":{"text":"First off, let me say that when the Mrs and I stayed in this part of the quarter two years","useful":1,"cool":0},"Mjx5A2F9IFOtBmaow-K0gg":{"text":"Spent a week in New Orleans and went to Daisy Dukes 4 times.  It's that good.  Crawfish to","useful":2,"cool":2},"hKDZbXQ8ctUZo8SCdCJ9Xw":{"text":"Average.\nThe Po'boys are OK, nothing to write home about. The service is good, but overall","useful":2,"cool":0},"IfiDaYIg3wdsF89sxmDQYA":{"text":"Best breakfast I have ever had in NOLA! Had the early bird..eggs, grits, sausage, buiscit ","useful":0,"cool":0},"CqbeHzbCZf-OeLTOXBtUgA":{"text":"Be warned the inside here is hot. They have ac but you can't feel it. We went in the morni","useful":0,"cool":0},"QplG_o-FtEe6WBDbpspV5A":{"text":"Cleanest place around  I thought, service was good and food was better than I expected, a ","useful":4,"cool":3},"Kg2mSTjDyzWVoPxSPXppJw":{"text":"Jesus. Management where are you? Stood outside like sign says for 5 minutes though only 4 ","useful":0,"cool":0},"H51Lbxzt-9dLpmVGQbWvYA":{"text":"Visiting from San Antonio, TX. The service was great.  Zero wait to be seated for breakfas","useful":0,"cool":0},"ir6keFjKwjRFFRNOIUgEdQ":{"text":"Came across this place after getting into town around 6am It's one of the only 24/7 diners","useful":5,"cool":2},"exBRYE71A91XKTtwXBl6XA":{"text":"Daisy Dukes served its intended purpose for a hangover breakfast, almost. It was fairly qu","useful":1,"cool":0},"TGKO_MHpYCC1ZIZ7Lm-imw":{"text":"The gumbo wasnt too spicy, the food was fantastic. My mom had grilled pork chop and gumbo.","useful":0,"cool":0},"IRloNmivT4TsU0-jmJV6sQ":{"text":"After coming back to NOLA late from Orange Beach, Alabama 3 hour drive - we were starved s","useful":1,"cool":1},"3ZfnvzQ8AqhrEQ5FqjyZhw":{"text":"I ordered the Cajun chicken cheesesteak and really enjoyed it. Well seasoned chicken that ","useful":0,"cool":0},"6BcRougOaKyBLbQbqlDbxg":{"text":"Great service and food that is affordable at any hour of the night. I visit often, and the","useful":1,"cool":1},"JOUfaFPUGIqY405ImLUMsg":{"text":"I came with a group of 7 girls while we were visiting New Orleans and we had nothing to co","useful":0,"cool":0},"GPv_CbXWP9dRU9nR_ZvO1A":{"text":"The Chartres location sucks! I have tried them for breakfast, lunch and very late at night","useful":0,"cool":0},"m6rRymu6ibUj2pgHD5DX-g":{"text":"OMG!! Free Bloody Mary Refills! I'm thrilled, Cajun style! Great and super friendly servic","useful":0,"cool":0},"VkCB_LS8uOVVWbwhuSw2IA":{"text":"Nothing to rave about, but not bad on the whole.  Go here any time of day to grab some gru","useful":0,"cool":0},"fYY6U4AY4mrqaIcRg4oLkA":{"text":"This is a hole in the wall joint that's open all day, everyday! They serve huge portions.\n","useful":1,"cool":1},"oue-jAMM-_hFsduM8w41OQ":{"text":"I was visiting New Orleans and I was craving some Fried Green Tomatoes and since I was in ","useful":0,"cool":0},"8akHdPD-l0wuqTIEzVaong":{"text":"Walking to Daisy's, the line wasn't too long. The service was very nice. Our waiter was ki","useful":0,"cool":0},"4b0g9lSOwpkr_Bane6yEYQ":{"text":"Great place for cheap, good food. It was located just about a block and a half from my hot","useful":1,"cool":0},"ANseb5c1AfENV8w0MkNqJA":{"text":"My family and I were actually headed to Jimmy J's Cafe but with the cold weather we didn't","useful":0,"cool":0},"zn9-CrHRssrWenPj_U7Puw":{"text":"Looked a little dodgy from the outside, but pleasant inside for lunch. Fast friendly servi","useful":1,"cool":0},"zTPiDuzHGD7wAszRwIan_g":{"text":"WHOAMYGOSH! Im telling you, this was the best meal I had when I went NOLA! It was my first","useful":0,"cool":0},"W172KDOAL5_lSNsQJej2Nw":{"text":"loved it!! Gumbo and fried green tomatoes were excellent.. red beans and rice was great as","useful":0,"cool":1},"4odnTQAr_HiKeXt3IKXFzQ":{"text":"Had the oyster poboy and was pretty good. Service was touch and go. Started off great but ","useful":0,"cool":0},"qforhINRmbFY9P3g9wvlbg":{"text":"Walking distance from intercontinental hotel, this place serves hot and devious omelettes ","useful":0,"cool":0},"0eQnZam3QELh-2itW4DUbg":{"text":"Anything fried from there is pretty good. The gumbo and red beans and rice was THE WORST I","useful":0,"cool":0},"ZGVaVZS4foIXWkFt32-v1g":{"text":"Excellent food and friendly service. This is the best of New Orleans! Our favorites--Cajun","useful":1,"cool":0},"e7l8aqrSRpuV2i58LELeYQ":{"text":"Food was great and service was OK but we got a free crawfish for checking in and we did no","useful":0,"cool":0},"944u0da0TzYhpwEA09nufw":{"text":"Came here as it was less crowded than ruby slipper. Enjoyed the whole meal and coffee unti","useful":0,"cool":0},"Yao0rt-2HRFhpJ4JZYJE7g":{"text":"Very bad service, don't take care clients,\nThe woman -manager- is horrible \nI don't recomm","useful":0,"cool":0},"f3iHPsBxar1aw5PRYx0dMg":{"text":"Not one of the best food experiences we had in the NOLA but still decent.\n\nWe came here fo","useful":0,"cool":0},"KgPlU1wob0VLXoPq-8oU7w":{"text":"Brought family in for a quick bite . It was only 6:00 pm. Tried ordering a beer and they w","useful":0,"cool":0},"lEjcrfce-_1gn9vEO_4jWw":{"text":"This review is for the Daisy location on 308 St. Charles Ave. \n\nI loved this place- and le","useful":0,"cool":0},"AW_Iy3aZWYjaV_pRSOdOhQ":{"text":"I would rate them 4.5 stars. I probably ate here about 3-4 different times during my stay ","useful":0,"cool":0},"dl_6tCuCU-zwCdzob2Or5Q":{"text":"Came here for a quick meal to get my day started and I honesty should have just gone to Mc","useful":0,"cool":0},"jI57rmPfMzG2EvlWyVHpzw":{"text":"I got the crawfish étoufée and enjoyed it--it's a little spicy but that's not a bad thing!","useful":1,"cool":0},"GXN5GNLHa3VJxt1hb5arYA":{"text":"Very late night delivery order, the delivery was very prompt but that was probably the onl","useful":0,"cool":0},"DMqiTu3_2yChHebr8kSWSw":{"text":"The staff is so nice! I loved the craw dads  and the Bloody Mary is divine. It's great for","useful":2,"cool":2},"P-q71JmBCdvQ8ZNRj8wWnQ":{"text":"Great service, really good food, bang for you buck. And they're always open! Ordered 50 wi","useful":4,"cool":3},"Wae3lgfFELIlYd9G4Udw3w":{"text":"An ok place to go.  Nothing special.  Decent pancakes.  Horrible coffee.  If you're desper","useful":0,"cool":0},"iR4Pj9QJlIbXGRWcd1_fmQ":{"text":"Great dinner. Got the sampler to try everything. Loved the gumbo and then heard from a few","useful":0,"cool":0},"GuxE7vW4kFBeNaeND8QtaA":{"text":"The Yelp letdown of the night. I usually trust reviews on Yelp but this place flat out suc","useful":0,"cool":0},"z846d0ZBRZszJ6R6R4dMkw":{"text":"This place is one of the few in the French Quarter area that is open 24/7.  \n\nThe staff is","useful":1,"cool":1},"Rqc5OGml6aL3ohk86DgY5Q":{"text":"The Place was a tid bit small, however this could be the \"norm\" for this city. I order a s","useful":0,"cool":0},"UL-iFvC3j_aggsMqNw2CQA":{"text":"A bit disappointed.  I had high expectations for the bloody Mary but had much better at th","useful":0,"cool":0},"sj_wHLLJWrOG2-fmColeDg":{"text":"Great food, good prices, friendly staff, and with the new renovations this place my go to ","useful":1,"cool":0},"dOfYCt0vtPWew7dUqgd5YA":{"text":"Not impressed. We came for breakfast on a Tuesday morning and the place was almost empty, ","useful":0,"cool":0},"0deWPwere1P4J9JXHI6FDw":{"text":"One word: gumbo. Best gumbo around. Found this little jewel wandering off bourbon street s","useful":0,"cool":0},"4EtLxZcA4j1EI7-9nXtVSg":{"text":"Excellent. More food than I could handle. Diamond in the rough. Soo good. Whether you're a","useful":0,"cool":0},"UdO-9gKdZvzTpi8_WwoWWA":{"text":"Walking down Canal St., you will almost miss this place if you aren't paying full attentio","useful":0,"cool":0},"R74lk46VlYnFkMSyuUYxKA":{"text":"My husband and I are visiting from Seattle and we're out late and our hotel kitchen was cl","useful":0,"cool":0},"IJIpOfqvUJupMcJkdJOkUg":{"text":"Decent diner if you need some all American grease.  Our late August trip caught the staff ","useful":0,"cool":0},"kpcbpEejQtupmgLb65jE9Q":{"text":"Wait staff friendly. Food was good. I'll come back  for the gravy and toast.  Good spot fo","useful":0,"cool":0},"a-gzPMn-roMETDu7Do-OuA":{"text":"The food is okay but their commitment to their patrons, their well being, and comfort is w","useful":0,"cool":0},"CDLZHZ8Zz1AeSihGcEjnpQ":{"text":"Delivery was pretty quick, came in less than 30 mins:)\nI ordered wings and gumbo, and food","useful":0,"cool":0},"l_FSLCbfSsrx_btzKjG4lw":{"text":"I had a good Bloody Mary (which are bottomless if you buy a meal) and a pretty good meal (","useful":0,"cool":0},"ra-1UmIYNpNixGfBjcTSzA":{"text":"The food was great. I had pancakes, eggs, hashbrowns, and sausage platter. The staff is fr","useful":0,"cool":0},"pBZn2iQLcUkYr2fsafqG1A":{"text":"Was happy to be seated as quickly as we were on a weekend morning, place is crowded but th","useful":0,"cool":0},"zVmH8YFGovRa7L0Q5DtQCg":{"text":"Ehh...it was decent, but no wow factor. The fried green tomatoes were good. Not great. The","useful":0,"cool":0},"2R7NRgpTbieR_6tJP0haoQ":{"text":"Very nice good service  \nDaisy is a very nice and professional waiter she made us feel lik","useful":0,"cool":0},"J97HkaAqjBDQ9GCjgCGV-g":{"text":"New Orleans is notorious for NOT having restaurants that stay open late. Even though this ","useful":0,"cool":0},"beHLIQbka_a3nk5Pi8xlMw":{"text":"We were recently in New Orleans for the jazz and after an amazing few days of good times a","useful":0,"cool":0},"NPVRWKDFzLhXZiUDjbcXOQ":{"text":"I LOVED this place! A definite MUST try! A friend and I shared the alligator sausage platt","useful":1,"cool":0},"K9KAMw_4QlpNW2dVpGRNTg":{"text":"This place did the job ! Can't beat the price. We had a huge breakfast with biscuits and g","useful":0,"cool":0},"S83rNMksRGoaJ7ZAtcKNjg":{"text":"After a night of drunkeness on Bourbon Street a girl needs a good place for breakfast to s","useful":3,"cool":0},"8I53PAgSWQvGsq1an5fDtQ":{"text":"Buffalo wings with daisy dukes sauce: so freakin good!!!\n\nCatfish combo plate: gumbo was t","useful":5,"cool":5},"o7Tj42cz_HG1TFQL0h-q8A":{"text":"Food was okay. Got the BLT with egg and my husband got the meat lovers omelette. The Blood","useful":0,"cool":0},"ZtxwrnYaB2nhKiBZyYzD7A":{"text":"Food was pretty good! They open late at night and the servers are super nice, friendly, an","useful":0,"cool":0},"elghToSFL9GKec3srJiRcw":{"text":"The place is ok the help is good \nThe oyster are very small \nThem crawfish are good! And s","useful":0,"cool":0},"iPleB2nPEyozz5nNEinrRg":{"text":"Horrible awful service.  Half our food never arrived or arrived incorrectly.  I know thing","useful":0,"cool":0},"fzb9Ztjk-SBiKuv9e5MtRg":{"text":"I was in town recently staying at a hotel across the street from Daisy Dukes.  I had alrea","useful":0,"cool":0},"Fe0B15U1PnCxK5z1Vf6cyg":{"text":"Loved the place. It's far enough out of the way that the place wasn't loaded with the typi","useful":0,"cool":0},"g-a72jfe2YWtpslpgCEU9g":{"text":"By far the best breakfast value in the french quarter. Service was top shelf and the break","useful":0,"cool":0},"jXeFyEGoRxNk0qPIzIITWA":{"text":"Don't be turned off by the off-the-beaten path location, the hidden entrance or the line o","useful":2,"cool":1},"KpZrCT0ZwE8wT7AkBOBThw":{"text":"This place is sub-par, the floor was filthy. The house salad looks like someone just throu","useful":0,"cool":0},"e4oV2YiyvlBwfoNTe1u4Mg":{"text":"Find this place. Good food. Good price. Takes you out of super busy touristy places. We ac","useful":0,"cool":0},"OXRLuJfMVxeJLMQp2WL9yw":{"text":"Came for some late night eats after the Red Dress Run.   The service was fast. The food wa","useful":4,"cool":3},"gbsang9f_neHk-Xnq3VxIA":{"text":"I created my own omelet and it was delicious! The staff are friendly and all of my food ca","useful":0,"cool":0},"fthdFKyf77XjVvdnOXSCUg":{"text":"Awesome breakfast! I had the alligator omelet with grits. The alligator sausage was amazin","useful":0,"cool":0},"x0GttOCWULdRHUEbcki-tQ":{"text":"Came in to grab a late lunch. The place was pretty quiet and a bit divey.\nService was quic","useful":1,"cool":0},"AF4MgIMR_-6BeLqJjUpLTQ":{"text":"Husband and I got into NOLA late and checked into our hotel and just wanted a quick bite t","useful":0,"cool":0},"g16r1neKA-rrSfxa50PHww":{"text":"Good ole southern food! The name brought memories of the old eighties show. I didn't reall","useful":0,"cool":0},"C9UsP4VRUn_4_mn-Cf6Fxw":{"text":"Came here for a quick breakfast because most places don't open until 7 for a bite. The ser","useful":0,"cool":0},"rE0Vg-V1ZRwSxKxDJEHS1A":{"text":"Came so close to 5 stars, food was priced right and plentiful. Parking was actually not to","useful":0,"cool":0},"QIjvQJdwiSLtf0jrSu0Qjw":{"text":"Fantastic breakfast special.  I can't remember such competent help.  The food quality is e","useful":0,"cool":0},"feoVdCyTFrsWea7tNXrqNg":{"text":"Came here with my bridesmaids we all ordered something different and honestly we all loved","useful":0,"cool":0},"RSICDlEWdtQPYzuZRJw4EA":{"text":"Slow albeit friendly service but food came out fast. Average food, but I must complement t","useful":1,"cool":1},"3cTJjoCxY7daSO8DRuqxmQ":{"text":"Great food! My friends and I visited during the MLK weekend and experienced the best servi","useful":0,"cool":0},"5o0HJW86NgXE-KKQgXDG2g":{"text":"Great breakfast food and awesome service.","useful":0,"cool":0},"vUE-5X6SEJU1IUuJfBLYGA":{"text":"How on earth this has decent reviews is beyond me. We had a shrimp po-boy, pancake, gumbo ","useful":0,"cool":0},"im81g9iYPsBe7LZNCaGe0Q":{"text":"Really low quality po boy.  Slow service.  Seems like they are merely capitalizing on drun","useful":0,"cool":0},"j9n3g-R5Eyt5Jl74AmnWig":{"text":"Cute place.  Stumbled upon it and remembered reading reviews before my trip.  Good breakfa","useful":0,"cool":0},"39Ek5E4v4hJONlidRwuLMg":{"text":"idk why i have a horrible habit of not taking pictures when i eat but I'll see if my words","useful":0,"cool":0},"Z7EZwbrAvtEBXssoJ5sJiA":{"text":"Small little shop right off Canal. Cozy and very casual. Nice quick service. I had the gum","useful":2,"cool":1},"bdwCbGBE6R-FihK6KdI2IA":{"text":"Good eats and bloody mary refills.  What more can you ask for?  Maybe not a \"local joint\" ","useful":1,"cool":0},"TdzUACCxZA3yGNJBwKU44A":{"text":"A must for the New Orleans breakfast. Check in for those Bloody Mary's.  had the country f","useful":0,"cool":0},"c0tOp1HJ2fP1Yuvc_6PkHQ":{"text":"Always friendly service and large portions.  I usually go for the hot sausage po-boy.","useful":1,"cool":1},"YsJUIV6QH53larYKy0OeDw":{"text":"My review last time I was here....\n\n\"It was great! I had the Chicken Philly Cheese and it ","useful":0,"cool":0},"H2gNxb6xJ6Gr8GicEeFhYA":{"text":"Breakfast for dinner?? Absolutely! Pancakes, ham steak & a side of creamy grits and coffee","useful":2,"cool":3},"HI5WHG-gUzHsfUxMMNNW9w":{"text":"Delicious etouffe. I really enjoyed the preparation of the food and practically licked the","useful":0,"cool":1},"LB3XGfb-uDS9k9ER4UjNmA":{"text":"Nice 24 hour spot. Alligator sausage is delicious. Everything else was pretty good. Servic","useful":0,"cool":0},"vtwOyP4zoSJ23Qks4RAC_w":{"text":"I wasn't impressed...at all. Went for lunch based on a recommendation from a local. I had ","useful":0,"cool":0},"Wet32OH8_0ggu9bX5dxwyg":{"text":"Fried green tomatoes were tasty, as well as the sauce it came with. My friend and I shared","useful":0,"cool":0},"1ePqSMqX0_bUXT3bMelHgQ":{"text":"Good food and service.  Not very fancy but a good place to eat.  I had the gumbo with red ","useful":0,"cool":0},"elIlwLQ607woWnSTgXUeIw":{"text":"I will say that this place is not very good. Our BLT was so so, the fried green tomatoes w","useful":0,"cool":1},"wFFAHeibc8jPt--oY1FC-A":{"text":"This is one of the many hole in the walls off of Canal St. The line outside of this restau","useful":0,"cool":0},"EvR33ZDPl6IW-9ERlguRpg":{"text":"Not going to lie. I was crazy hungover when we came here to eat breakfast on New Year's Da","useful":0,"cool":0},"sVSet_QFBLiK7S5ziglxlQ":{"text":"Good food. My GF and I both had sandwiches. The Cajun Philly was the best cheesesteak sand","useful":0,"cool":0},"RprQHYyq37b8NeGAOlGeIQ":{"text":"After my friend and I had beignets at Cafe Du Mond, we were still hungry and decided to tr","useful":1,"cool":1},"HI1FfOgfMFskmN0gl7HwAQ":{"text":"So I just wanna say when someone calls you to make a delivery order you don't say \"oh no t","useful":0,"cool":0},"8sb2vpDGZDBXNgT9yFcXQA":{"text":"Some friends and I had dinner here before hitting the streets for a night out on the town.","useful":1,"cool":0},"ZffuYq5_55kh1j4Z-Xfegw":{"text":"Late Night Breakfast\n\nAt $7.95 and $8.95 the breakfasts are overpriced, but if it's after ","useful":0,"cool":0},"aKEs1OSr3q7gPyL-IT4DbA":{"text":"I believe it was our last morning in the French Quarter. I was looking for a place that ha","useful":0,"cool":1},"m_Kag51mBHpmYN71KYv_Rw":{"text":"I ordered pancakes + orange juice. My mom ordered a veggie omelet + orange juice. \n\nThe or","useful":0,"cool":0},"EiLtYNPOt_s5_oZ_fFoRzA":{"text":"I went to this restaurant during the 2018 Essence Festival.  Great restaurant for breakfas","useful":0,"cool":0},"RMPT_zOh_0iVOdoJkZ5EDQ":{"text":"Horrible service, and food.  Dont bother.","useful":1,"cool":0},"vG0TdkWFOmdP4-pRcXiBhA":{"text":"I came in here for a late lunch/early dinner on a Sunday afternoon.  I was seated at the o","useful":0,"cool":0},"0OsV7XPq13F2XTyuNziWhw":{"text":"Was staying at the Marriott and this place is open 24/7 so we ate here a reasonable amount","useful":1,"cool":0},"me-Pm2QFn9F51bjU9EVTbg":{"text":"1st night in New Orleans. walking around this place was recommended. Went right in and was","useful":0,"cool":0},"GTCPsXpQKKouEG7OG7ZISw":{"text":"Average food, terrible service. The bottomless Bloody Mary are only good the first serving","useful":0,"cool":0},"uudzQfCFaZbXadNIGP259Q":{"text":"We had Angela as our server and she was very knowledgeable and amazing! Crawfish was good ","useful":3,"cool":2},"eOHMNn6H5jhi8MdgLLY6lQ":{"text":"Came to NOLA for a quick trip.  Asked the concierge for a recommendation. They recommended","useful":0,"cool":0},"SvmX7TpZ9eK59MHveHQk9g":{"text":"Some of the tastiest food we found in New Orleans! They're open 24 / 7, have super large c","useful":1,"cool":0},"FiQOSsqLKG6Pi2oomXziWA":{"text":"Right across the street from the Marriott on Canal street.  Went in for a quick breakfast ","useful":0,"cool":0},"0VKm_3fuit54mo1-Rutwlg":{"text":"This restaurant was just okay. It has an outdoor holding area where you wait for a table -","useful":0,"cool":0},"9pGgk0q9VmWfm-maGd-UqA":{"text":"Came here for breakfast one morning on the recommendation of staff at my nearby hotel. Ser","useful":0,"cool":0},"hg9_pgXMfN3mMPxWUL8Iaw":{"text":"Hands down the best gumbo I have ever had! I am usually not a fan of gumbo but this place ","useful":0,"cool":0},"KTY9fG1ZQiu1MYlpz8NEmw":{"text":"Extremely long wait\nNot worth the wait\n\nEven with other customers departing--\nStaff is Ext","useful":0,"cool":0},"cj-c5pGwy8rPo3DofF3yLA":{"text":"One of the best taste to price ratios in the French Quarter.  Excellent gumbo and red bean","useful":0,"cool":0},"ScSaiOx36XbmKjBXbbVxew":{"text":"The biggest issue with this place are the tiny, tiny tables. Everyone who was seated at on","useful":0,"cool":0},"xvCmyEmb8-qxWo_8WqktDQ":{"text":"by far the best Gumbo we had in New Orleans. Open 24 hours and a great place to grab a qui","useful":0,"cool":0},"6FV42XKnsYqOpApiAlyJXA":{"text":"I have visited this place on several occasions, mostly late at night.  I've had a variety ","useful":4,"cool":2},"Ol_p_l8ifeuRweEcqI8XNw":{"text":"Amber was amazing! She was super attentive, helpful and extremely friendly. We will defini","useful":3,"cool":2},"ntDQdvDwbztCHWn5k12OAQ":{"text":"We're on our last night in NOLA and looking for a late dinner. We find the place and wait ","useful":0,"cool":0},"Bc3C4rM1TVZTJzKEN6REtQ":{"text":"24/7 is a plus since my flight arrived at midnight and I was hungry. This hole-in-the-wall","useful":0,"cool":0},"bC-48_7Es7iYmSKSP104nQ":{"text":"Ok so this is definitely a straight HOLE in the wall, 24-hour joint. But at around 3:00 am","useful":3,"cool":3},"QF_pqoegRklNbWRuy3UcCA":{"text":"Very disappointed!\nWent for crawfish all you can eat.  Was told only served in season.  He","useful":0,"cool":0},"vRaLKkmjq7OP88NrnVeB-w":{"text":"Service needs a lot of work. Food was tasteless and bland. I'd stay away from this one.","useful":0,"cool":0},"0wijopC9lgP24_pRUxvG6g":{"text":"Great spot for late night eats at an awesome value as well. Will definitely be back when I","useful":0,"cool":0},"LIAM1S6_xmHrG-SDmR7d2A":{"text":"I have eaten at Daisy Dukes twice on two separate vacation trips to NOLA. I will say this ","useful":0,"cool":0},"rcItoAL6WDqHAQQvDGTc3A":{"text":"This spot is great to grab a quick early breakfast or a midnight meal. The service is quic","useful":0,"cool":0},"EM-227L9LGraTFeM2mg4jw":{"text":"This was recommended by friends, we went on a Tuesday night, great quick services and good","useful":0,"cool":0},"u2UP13ciTP6j_6NFmNVQqQ":{"text":"Great food! HUGE catfish Po Boy....two giant TVs to watch games and wicked awesome service","useful":0,"cool":0},"J1uSmISReZ_4XMf9o9lWKQ":{"text":"OK so aside from the fact that these folks are open all night, they are right next door to","useful":0,"cool":0},"Rp9QIB7jpEYyBL78xo9mzg":{"text":"Daisy Dukes was recommended to us by our mom and it didn't disappoint.  The Bloody Mary's ","useful":0,"cool":0},"QGaD3_NFEAFMeWPFOjb5KQ":{"text":"Their drink specials are great! I went during St. Patty's weekend, so I was worried this p","useful":1,"cool":1},"qvaIL2gE6tIMP-faZyxxfA":{"text":"VISITING FROM CALIFORNIA... Place was amazing!! food delicious!! I can't remember what our","useful":0,"cool":0},"dxsrY0QePB8DU2Yeoib57g":{"text":"This would be 1 star because of the food but the server was sweet, which is the only reaso","useful":0,"cool":0},"MEA0guONJ9bjr3-NQ9p3qw":{"text":"{: Bloody Mary review only :} \n\nYou can check-in for $6 bottomless bloody mary's with food","useful":4,"cool":2},"WFdxmJxR3tXl12LEAKn_cg":{"text":"It's a great after party spot when you need good grub to save you from a hangover the next","useful":0,"cool":0},"bwqBdiUpFPkXtwCACOww0Q":{"text":"I heard some good things about Daisy Dukes and was looking forward to eating there. \n\nThe ","useful":0,"cool":0},"KVMg9M8MlwB31eneBbuxSQ":{"text":"A cozy little spot with fast, friendly service. I love the bread they use for the po boys,","useful":0,"cool":0},"2ezTU-VhWguGvBNy3RD3-A":{"text":"came on recommendation of the desk clerk at the Hotel we stayed.  Had étouffée and alligat","useful":0,"cool":0},"PiBCB91CAQuTkwCg29eDvw":{"text":"BOTTOMLESS BLOODY MARYS. Need I say more? Because I can! You can get them TO GO!\n\nAlso, th","useful":2,"cool":1},"rmhY6IZnxF-pm_AQv-tyrw":{"text":"Casual place for lunch. I had my first Po-boy shrimp sandwich, which was satisfying. The s","useful":1,"cool":0},"4P5XLSma-8D_Iuo4HdxUXg":{"text":"Very friendly staff.  The chicken cheese steak is the star.  Better than it looks.  (No on","useful":0,"cool":0},"-IZhn9QAcZYkipvpRcXYcA":{"text":"Oh sooooo close! All great for my shrimp poboy except for the stale bun! Crawfish just out","useful":0,"cool":0},"K_ZvhViWGkD31-e8Up440A":{"text":"My first meal in New Orleans! Got off the plane and was able to have a po boy at 8:00 AM. ","useful":0,"cool":0},"691ZuiD6t5nnmPfYYrb8BA":{"text":"Our server Veronica was great super friendly right from the beginning! Very helpful with g","useful":0,"cool":0},"4pyKue1ImSHRyxyH2ooGKA":{"text":"Great Crawfish at 2am!!!\n\nSome of best crawfish I've ever had!\n\nMust have had 6-7 lbs ever","useful":2,"cool":1},"c71YoYgeXcaxws3AN-z65Q":{"text":"We went here on our 1st visit to New Orleans and the food was solid! Everything was delici","useful":4,"cool":3},"ZXRaCA8ZGaIWb7Kck8LKQA":{"text":"We went to the place because of the reviews! \n\nMe and my husband ordered their pancakes ve","useful":1,"cool":0},"HyagsmM98cZL4IZV4Uzgvg":{"text":"We come here every time we are in New Orleans.  This is def the best breakfast joint!  Go ","useful":0,"cool":0},"9C5JisgkwSIwxme8dOqzAA":{"text":"love the breakfast and seafood when visiting new orleans po-boys arnt bad either","useful":0,"cool":0},"0ZkOv9pBR5rhHRq0eT5a3w":{"text":"With only a walk next door to this open late treasure is a place with the best alligator s","useful":0,"cool":0},"MCaEyx-Eg6Bf296-VY7lEQ":{"text":"This place is perfect! Open late, great food, great service, great prices, bottomless bloo","useful":1,"cool":1},"z43Rbds8Q5_teHbUF8PO3w":{"text":"I went to Daisy dukes with my husband last Sunday. Meals were good ,the French fries could","useful":0,"cool":0},"0cKfWcS20Pifgg_iqOCpXQ":{"text":"We went in after 11pm. Place was pretty busy, service was okay but food was bad. I am not ","useful":0,"cool":0},"Ot79Pw6RhyCC3dPA6mcQYw":{"text":"So good I had to have it twice\n\nA close friend was getting married in new orleans and I wa","useful":3,"cool":2},"ZpqYhljkGU63jbriG434-g":{"text":"Ordered breakfast delivered to my hotel.  Omelette was good as was the giant biscuit and t","useful":0,"cool":0},"g7iQ3avSukpWINXmD2oOqw":{"text":"This is probably going to come off a bit harsh but the truth is food may be okay but the s","useful":1,"cool":1},"hS6_K0_K93mycILQOGCS8Q":{"text":"The staff was very friendly and the breakfast was great.  If you are looking for pancakes ","useful":0,"cool":0},"GSUrLsMan7j-dzNETadI9Q":{"text":"A week in the French Quarter and this was my favorite restaurant, easily.  The Alligator S","useful":2,"cool":0},"8MmIq2_mMQ-JKaJma_j_eA":{"text":"Great experience for New Orleans!   Food was very reasonable not fancy at all but I enjoye","useful":0,"cool":0},"47cLW3p7vpJ-Vnop5Rxp3Q":{"text":"It's was three thirty in the morning everything was closed so asked the bell hop at my hot","useful":0,"cool":0},"U8SRolOgB7-By0vaGelu7g":{"text":"This review is for late night take out.\n\nI lost track of time after multiple rounds of unp","useful":0,"cool":0},"0HEW4_zJdf7MM7GTa3e6OA":{"text":"Great place to grab a quick and easy breakfast if you are in a hurry to go sightseeing in ","useful":3,"cool":2},"-KTlM3r5SVGtSi_aXfbp2A":{"text":"The Bloody Mary they serve is delicious and the free refills is a nice perk.  I had breakf","useful":2,"cool":1},"NBcDfaQlJ30dG1xHZlBxOg":{"text":"Stopped in for a hangover lunch with a big group of people during a bachelor party trip.  ","useful":3,"cool":6},"4xE8Tq13kOXA-3X1m75gVg":{"text":"Was just ok. Shrimp boy was average. Gumbo was good. Service was ok. Friend had burger and","useful":0,"cool":0},"P0nblBGkcyBIGbaKiR2FqQ":{"text":"had the New Orleans Sampler, crawfish etuffee, gumbo, red beans and rice. fried green  tom","useful":0,"cool":0},"dVM3VH4jjUMJtaMz7A15aA":{"text":"A local favorite with good breakfast offerings, endless Bloody Mary's and quick service. T","useful":2,"cool":2},"05GJlQWxDqPi1BIxAYfz6Q":{"text":"Best gumbo by far. Been waiting 7 years for another bowl of gumbo. Well worth the wait. \n\n","useful":0,"cool":0},"WQGYNfgthEVUEFJm5hBeSQ":{"text":"Decent little breakfast spot right around the corner of the JW hotel in New Orleans. I ord","useful":0,"cool":0},"xCmbCEhLtRU7DGMuaUXCuQ":{"text":"Great pancakes. Awesome Cajun fries with just enough spice & grease. \n\nVeggie po boys- The","useful":0,"cool":0},"Eerko7GXtD94UOhEDLvdwA":{"text":"I had the Crawfish Etouffee and a Bloody Mary. It was amazing! The Etouffee was a mouth wa","useful":0,"cool":0},"ayCNstefeYO4t1bY_RP3cQ":{"text":"They're 24/7 in the Quarter what more can you ask for. I've had the fried oysters (yum), t","useful":0,"cool":0},"6mDQx5aqC0VfbdRhpuY8bA":{"text":"We came here on our last full day. I was...let's say a little hungover from the weekends f","useful":0,"cool":0},"H3R9TcJloM81ie68zRLp5Q":{"text":"Come on baby... Kick them daisies\nLook at them girls with the Daisy dukes on\nI want ya to\n","useful":4,"cool":4},"piZN0u84NwnrNhtxWcdquA":{"text":"I wanted a po boy sandwich so me & hub decided to try them out.  Greeted promptly, wanted ","useful":0,"cool":0},"RFtzQ_U1rlgAwjnwDF5Z4w":{"text":"Wasn't crazy about this place. We waited outside for an hour and 20 minutes and was disapp","useful":0,"cool":0},"yQIdvtaH9H4niOTBQQyvAQ":{"text":"Simple good breakfast.  Nothing fancy, but decent and a good price compared to the other p","useful":0,"cool":0},"5ajU3aX1DQAg1URybg9-sw":{"text":"This place is amazing for several reasons. At this location one may expect an overpriced c","useful":0,"cool":0},"nSy1Eovrq1KaZLvfxRZ-MQ":{"text":"Daisy Dukes has some good food but I wasn't blown away. I was really craving some crawfish","useful":0,"cool":0},"Cq2vPctREBBQGHlEAypzqg":{"text":"Great salad, delicious gumbo and good po'boy... nice, friendly staff","useful":2,"cool":1},"a2S8Js6YNQhfa7eELulk0w":{"text":"Loved eating here. The service was good and the food is delicious! Unfortunately the wait ","useful":2,"cool":0},"KyCx3jpRIekwHLQ3lVT7rw":{"text":"Ordered this late night two nights in a row. It was one of the best shrimp po'boys I've ev","useful":0,"cool":0},"1Y_Yv48trTClGwB6VXm4DQ":{"text":"Pretty good breakfast. I had a BLT. Hubby had a full breakfast - bacon, eggs, sausage, bis","useful":0,"cool":0},"Ciqfr3aJvRuJ4w6SvqjoBw":{"text":"I called but didn't asked the price...I sat down to find they are $10 a pound, ok whatever","useful":0,"cool":0},"lqXdW6euYhgPdshvZ0051Q":{"text":"Probably one of the best places to get Red Beans and Rice. They were so good! We had a ser","useful":0,"cool":0},"ZUVuQ8fllxqQMiaNPmuQ7g":{"text":"If you're looking to try a good breakfast meal with meat Daisy Duke's has a great rib-eye ","useful":0,"cool":0},"t-e-uKtJ-c4ue_rIIyUGrw":{"text":"I ate here twice while visiting New Orleans. Once for breakfast and once for lunch. For br","useful":0,"cool":0},"zfmYZ_CAAoNLxZe_B2U4yw":{"text":"The food was NOT GOOD. I couldn't eat my gumbo because the taste was so bad -- like the ro","useful":1,"cool":0},"sx_f5UI2GygasWcRP0lP6A":{"text":"We showed up here around midnight or so and got to be seated immediately. Our reason for g","useful":0,"cool":0},"fHv8VMllBOKIHgWZ-HIn4w":{"text":"The service was bad. My sister do not eat meat. So when she ordered the shrimp poboy and s","useful":0,"cool":0},"ZhRZAn8oDg4brC31GZgeOw":{"text":"The omelettes are huge! The grits are good and of course the Bloody Mary's! Are killer","useful":0,"cool":0},"UAYbVkqfJIDyuLuSNAYQJw":{"text":"Went here for a late breakfast and it was very satisfying and started out the day nicely. ","useful":2,"cool":1},"iSS8y5TkVDFpThtuyFB5ug":{"text":"We got into town very late and we're very hungry.\n\nNot too many places open at 2300 hrs.\n\n","useful":2,"cool":1},"FdibtY3H_RMr2TaMpEpXTw":{"text":"This place is great. Nothing fancy but they have good food and friendly staff. Justin G wa","useful":0,"cool":0},"AC-HzuA--p64z9XDdvoiPQ":{"text":"The best 24/7 restaurant in the quarter! Their omelettes are amaizing and everything in ge","useful":4,"cool":3},"dyYK0ZkiwqVbKDHdcR8Ugg":{"text":"We ordered this food to our hotel room and it was God awful disgusting. After waiting for ","useful":0,"cool":0},"i8Hekfl_J5zn9gBjAQ4lRQ":{"text":"This place was right next door to our hotel literally next door. We walked there for \"brun","useful":0,"cool":0},"HEBXp5IaO9fl7NHdqhOeGQ":{"text":"Seriously? i ordered 90 mins ago. no food. and you wont answer.    this is insane.  the wo","useful":0,"cool":0},"S74lpnXA-0BkXjdKMq8YUA":{"text":"Midnight craving brought us here.  I had the alligator sausage, gumbo, crawfish etoufee, a","useful":0,"cool":0},"2GJ-jx4ccIaaPWJ3ulc6Zw":{"text":"Excellent food! Service was incredible. Ask for Valerie. She made me her signature drink..","useful":1,"cool":1},"hdHMqq-OPzE2mE4B-GIObw":{"text":"This place offers breakfast 24/7 however there's not much to write home about. The two egg","useful":1,"cool":1},"ZIu7m6WGJ5U07IojRJu_bQ":{"text":"This place is great for the night owls. Need a bit more life and helpful staff...yeah I'm ","useful":0,"cool":0},"EsGf8X8xHoM57PNxS6gN0w":{"text":"It's a place that will serve you breakfast 24/7, which is cool. But, it's nothing to write","useful":0,"cool":0},"owNzGLNL-76j6jwvFjTAXA":{"text":"We walked by this place numerous times believing this was a touristy \"breastaurant\".  Imag","useful":1,"cool":0},"qW4sLDyQgccq9TZY_18ADQ":{"text":"We came into Daisy Duke's several times during Carnival 2012, and were lucky enough to hav","useful":4,"cool":1},"E5u9MNTCx_VXcqHw7o4TYg":{"text":"I went for dinner around 8:30 PM on a Monday. Wasn't crowded. Very fast service. It's not ","useful":0,"cool":0},"ew_T8fNOcoGAm2tTWT34EA":{"text":"This place was ok, I had a shrimp po'boy, and my fellas had a fish po'boy, and \"sampler\".\n","useful":0,"cool":0},"BNXYw_VhQIcgeJ9lLoMGHw":{"text":"Food was decent enough but took 40 minutes to get some chicken fingers and a cheese omelet","useful":0,"cool":0},"xsWC0MMN8IKbZE15rriBFg":{"text":"OMG this place is amazing!!! Food so fresh so good!!! Loved my server Pamela and the rest ","useful":1,"cool":1},"7KbQy2ubyw-okt23XbRb2Q":{"text":"Had some of their biscuits and gravy, poboys, and pancakes.  Great food at a great deal, e","useful":0,"cool":0},"2_0lcJ18sBKnuC0nYECkDg":{"text":"we stayed  on the same block , so we ate here 3 times . the food was great . i enjoyed eve","useful":0,"cool":1},"YrsSb1jxKAWJl7yV5ysfJQ":{"text":"Came here for breakfast at 3am. Great service and great food. I had a regular American bre","useful":0,"cool":0},"HffW0Gt02GfQ3L5On-OENw":{"text":"Dissapointed....went around 1030 on Saturday morning. Was full but only few minute wait to","useful":0,"cool":0},"mbmrwcDlLMsjipRKbU6jMg":{"text":"I arrived in New Orleans the evening before my friends were scheduled in town and had some","useful":1,"cool":0},"7b7UecIFxJ4VXRSRHXwYnw":{"text":"Yummy Yummy Yummy!!!!! This spot was yummy....we had the gator omelet  and the pork chop b","useful":0,"cool":0},"PNTCdNwIj_7Dz0ZY1TQv_A":{"text":"Had breakfast here and I think it was ok. I don't have anything bad to say, just ok.","useful":0,"cool":0},"S-9gmkyTHpwRFZERj8EnGA":{"text":"This is my second time to NOLA and I ate here both times.  The first time I had breakfast ","useful":1,"cool":1},"mPGEwksnl3BNmFi9k72O4w":{"text":"Biscuit  was good and that's about it! Gumbo was descent! I was excited for bottomless blo","useful":0,"cool":0},"AyyOII1KDxVTWFbSYc-_PA":{"text":"Every things was phenomenal! The place itself was cozy, a little tight, but enough room to","useful":0,"cool":0},"gB0DAXSIfSl5WABYt-cmrg":{"text":"This was one of the few selections of places to eat on a weekday after 10pm. \nThe staff wa","useful":0,"cool":0},"kpTD21WGyYCpzA7cJncyfA":{"text":"2/27/14 : Early Bird Breakfast at was solid & filling for 3.99!  Got a delicious biscuit, ","useful":2,"cool":2},"SU5pZiOzX3lNxCwply1EIw":{"text":"The service  was excellent. We arrived around  8:30 Sunday  morning. The place was semi-fu","useful":1,"cool":0},"c-rYsFN99XXirdJPJT--Nw":{"text":"Good Service and no singnificant wait time.\n\nDelicious crawfish boil. Came out hot(tempura","useful":1,"cool":1},"tge3WVAUEs4UnUIW2vKneA":{"text":"The only reason I am giving even to stars is based on a couple of items I had delivered. T","useful":2,"cool":3},"yx4-yFUTyk96N7v43gpB6A":{"text":"This place certainly isn't anything fancy, but we were glad to find it after a long couple","useful":2,"cool":1},"81WuyuXvQWG7Jn_TdYnG4w":{"text":"A short wait but worth it! We were seated within 20 mins and that saying a lot considering","useful":0,"cool":0},"ok8JXZb_w80kFWYaBbCCAA":{"text":"We came across this place really hungry. After waiting for some time we noticed it was rea","useful":0,"cool":0},"MC35cSLSolSZjft23Qo1XA":{"text":"I had my doubts about a place called Daisy Duke's, right around the corner from Chartres a","useful":7,"cool":7},"75iLs1Yg-5KwmeJ_n3Vsaw":{"text":"This place, while far from fantastic, does consistently OK food.  I have eaten here a hand","useful":3,"cool":2},"lGmFGp0U0f8DlOrbk_1erg":{"text":"Ate here on our way out of town. Great breakfast place. Free refills on Bloody Mary's. Lot","useful":0,"cool":0},"4vRALbDAic-pqdSryVvdWA":{"text":"Well, I had high hopes for this place after the doorman at the Marriot recommended it to m","useful":0,"cool":0},"9hUKr0BGqwmjVmtxa-S1DA":{"text":"The seafood omelette was good. Nothing special. Fast service. Good for a quick grab.","useful":0,"cool":0},"VVaZiHtMR8_F_Wi8cuZyIA":{"text":"After we left the Blue Nile (great jazz music there), this place was recommended!!! I want","useful":2,"cool":2},"xtpYroH97T299pBngEJGYw":{"text":"We needed a place to grab dinner and ended up here. Service was a bit slow and food was go","useful":0,"cool":0},"HZdIw_PjroUghojIvGmT4w":{"text":"Ordered using Uber eats. Quick preparation. The food tasted fresh. Great for delivery and ","useful":0,"cool":0},"4IlUR1XmXESSgvMTEub5oQ":{"text":"I enjoyed every dish I ordered. The red beans and rice was hellah seasoned!!! The chicken ","useful":2,"cool":2},"r6pNz4k1XZNzro8rzZLKhA":{"text":"This place is great. Small but comfy and the pie is to die for. Staff is helpful and pleas","useful":0,"cool":0},"1vvaXq_Jf2wQAQTK1uKdpg":{"text":"A place to go to soak up your alcohol. Raw Oyesters not chilled, VERY average wings, decen","useful":0,"cool":0},"5Db4uYQ582QeY6BznwMRcw":{"text":"So I didn't want to come in when I first passed because it smelled like a nursing home. Th","useful":0,"cool":0},"6qtSfmhe4HkYgaolDk8DwQ":{"text":"We visited in August 2017.  We were seated quickly and the waitress was attentive.   The f","useful":0,"cool":0},"LltCZnwRhh2tKZBc3iyoCw":{"text":"Nice comfortable restaurant. Food is decent with large portions and a good price. They hav","useful":0,"cool":0},"RcX6kwaTRGrv-7tou8EDHQ":{"text":"Good burgers GREAT seafood and the service was fantastic! Definitely ask for Patricia, she","useful":0,"cool":0},"m6Aj9fZom34oXP39NRRqSg":{"text":"We were looking for a place for a quick lunch. The Daisy Dukes was perfect - it was not to","useful":2,"cool":0},"AJtItpzmQVUNnrjXsNzKKg":{"text":"Last day in NOLA :(. Great breakfast.  This is truly a diner so don't expect any fancy typ","useful":0,"cool":0},"5wS7ljsQOJTWERMqZIX1sA":{"text":"We went for a late breakfast. Sat right away, friendly server (Alicia) was very nice. Food","useful":0,"cool":0},"8eiiosQESHxaFB9M4cJpgQ":{"text":"We were waiting in line at jimmy j's next door and decided to eat at this little gem next ","useful":1,"cool":1},"j3m1ahpiudhnj2Mc6wPaOQ":{"text":"Stopped in for breakfast - service was friendly - took a bit longer than expected but was ","useful":0,"cool":0},"ZCNW43TMUtexW1-FSwhC5Q":{"text":"Food was good,  service was not.  The staff seemed annoyed to be there.  They didn't menti","useful":2,"cool":0},"3CCmvkokqmZzeMG3nO1l9w":{"text":"Came to this place after a event. To my surprise was the atmosphere was not what I picture","useful":0,"cool":0},"M-90LJpxm5GVDU-mA4FdqQ":{"text":"I had low expectations, but was pleasantly surprised!  Our waiter was a sweatheart, and th","useful":0,"cool":0},"5apz2BGyjLW1aPjHGL-FoA":{"text":"Just ok. They were out of oysters. The first Bloody Mary was great but the second was dilu","useful":1,"cool":1},"WP6FTX8ZsIBnkuMqyXZRQQ":{"text":"24 hour breakfast place with NOLA style food, decor and service. Great location within stu","useful":7,"cool":5},"p6ha6EgeSCTHOx2_HvjSiA":{"text":"Cajun omelette was ok! This 24 hour eatery has bottomless mimosas and cheap eats! Reccomme","useful":0,"cool":0},"sz7nXTszu970KRm0PMuzlw":{"text":"Can't go to New Orleans and not eat here! Best and quickest breakfast food ever. One of th","useful":0,"cool":0},"lmKvL22qz8g3cBMx9gM5yA":{"text":"We got into New Orleans quite late and asked at the hotel what was close for good food. Th","useful":0,"cool":0},"E1GAiRy_atxy5tbEXOffPA":{"text":"Stopped by to grab a quick dinner as the reviews appeared to be okay. Perhaps it was my mi","useful":0,"cool":0},"7cTu_jWdyUSbwkeC55_cmw":{"text":"Good comfort food on a cold NOLA night. Good value, friendly staff and local beer on tap.","useful":0,"cool":0},"ecN8JZZh5J3yqkv2-qJo2Q":{"text":"Really liked Daisy Dukes for breakfast. They had all the fixings and pretty reasonable for","useful":0,"cool":0},"Y9vPdEAALjXcf7x-DqfznA":{"text":"The food was decent but nothing to write home about. It's fairly priced for what it is. Th","useful":0,"cool":0},"VzdzgyL4DEIW-H6REDwYqA":{"text":"Worth the wait in line for a delicious and affordable breakfast. Our only problem was we o","useful":0,"cool":0},"p8H3a3EiZuDJPEBmmFd3oQ":{"text":"The food was REALLY good, but they had a limited bar menu. The atmosphere was VERY informa","useful":1,"cool":1},"-vnGA7efvVNd2w0-x7w3wg":{"text":"This place had a nice atmosphere. The wait wasn't too long. They have gluten free options ","useful":0,"cool":0},"qV_x424_QLksFxfSlJdl9A":{"text":"Good service, weakish coffee, omlette wasn't cooked, PO boy didn't have that killer NOLA b","useful":1,"cool":0},"JQIatAmPmYMsh44zxdmM1Q":{"text":"Maybe 4 in a half. The fried oysters were very good. The amount of craw fish for the price","useful":0,"cool":0},"dLH8ZhG8K_xfEdtMeaSNJQ":{"text":"I never thought I would eat at a place called Daisy Dukes, but the breakfast was fabulous.","useful":0,"cool":0},"Xg-RiVa50re0MZR_7so5ug":{"text":"Came here for a late breakfast and was tremendously disappointed. The biscuits were burnt.","useful":0,"cool":0},"LBJ5iQiRyvzrzkI-UKyJQQ":{"text":"Let's just say that it was 10:30pm and we were hungry for food after our flight so we came","useful":0,"cool":1},"-G-CXkPByhXzBOPEGrt43g":{"text":"had the steak and cheese po-boy was just ok would have preferred the peppers and onions to","useful":0,"cool":0},"Z52b9bUYxGzUqYiGWMTYDw":{"text":"Pretty yummy food. Didn't really care for their gumbo, but their Oyster and Shrimp Po'boys","useful":1,"cool":1},"YroxtEjPQN0jFpUb-OouvA":{"text":"Excellent southern-style breakfast anytime of the day or night.\nQuick, friendly service. \n","useful":12,"cool":7},"S0dZMRzCbctqT2vaOA6Cvw":{"text":"I guess the food would taste better after a long night of drinking. But as far a ordering ","useful":0,"cool":0},"Rf9OEVCJSl1-2YWdqu9UsQ":{"text":"Some of the best and cheapest oysters you can get anywhere!  The crawfish was always aweso","useful":0,"cool":0},"LQitCWbDNsoxbcLjjZF62w":{"text":"Great food. Bottomless bloody Mary's? Awesome! Thank you Pamela. Pamela was awesome. Kept ","useful":0,"cool":0},"uUMhbKu87j-5TsqTy1XpKw":{"text":"The food was good! It's one the few places open at 4 am that has a ton of choices for the ","useful":1,"cool":0},"3aSOnGRNHSLJHZL08bPADQ":{"text":"Gumbo was good! No okra in it, nice and easy. I went on a non busy day so service was quic","useful":0,"cool":0},"MBB8OMstYWfqUDQY6TaKAw":{"text":"Maybe it was just an off-day or something; I'm ordinarily shocked by how low people rate t","useful":0,"cool":0},"cKp1Lw8URB-ANF_bCyUACw":{"text":"Great location, bloody Marys were bottomless as advertised. Tasty Christmas Day meal. High","useful":0,"cool":0},"yo1a8oeH0tfuCWFkA89GzA":{"text":"For breakfast this morning, I went to Daisy Dukes with a couple of my colleagues.  This is","useful":1,"cool":2},"vHyYEcXfZR1wOxg1BI-5Tw":{"text":"Service was \"ok\" ambience was \"so so\" it kinda smelled a bit. When I visit the south I exp","useful":0,"cool":0},"Bym7oLSYN8AZf_-m5wBoKA":{"text":"My experience here was excellent! The atmosphere and food combined with the amazing servic","useful":0,"cool":0},"jJpajIuobcV6V0YqmbzGrA":{"text":"The food and bloody Mary's were awesome. Our server Jaymie was fantastic, by far the BEST ","useful":0,"cool":0},"mKcPWy6VICw4zzT2qxRU5Q":{"text":"Typical Sisco food unless you come during crawfish season. 3 stars because the Bloody Mary","useful":0,"cool":0},"yd0Np3D5W2EFnOkEiGhnyQ":{"text":"Kind of a cross between a diner and a bar (they actually have a full bar).\n\nIn a 3 day wee","useful":0,"cool":0},"b3JGzM4w-5vJJ899rZ85Ug":{"text":"Decent burger\n\nGood fried green tomatoes.\n\nWas not thrilled watching a mouse running aroun","useful":0,"cool":0},"ONVgSvLN8phJbjRiHN6FFg":{"text":"Love the gumbo! Doesn't have too much going on as of unnecessary stuff in it. Loved it! Sp","useful":0,"cool":0},"utKBhfKTp8hwaVJ38P-0Rw":{"text":"I hate to give it 1 star, because everyone was friendly and my eggs were cooked perfectly ","useful":0,"cool":0},"yKInRk-Bn10bMhVFnZ6_EA":{"text":"Walking in to Daisy Dukes is instant immersion into New Orleans. I got to town late last n","useful":1,"cool":1},"Gl8RFcplXVVzCMF0EyVGFQ":{"text":"Great place for a quick lunch or breakfast. I had the alligator omelet which was excellent","useful":0,"cool":0},"7iccDrgq8cqhTeIT-9vQyQ":{"text":"The Gumbo was excellent but the service was poor and our waiter was horrible. We dined in ","useful":1,"cool":0},"8TvjOx123UgqLP3vF_CPHg":{"text":"Best gumbo, shrimp ramalaude, red beans and rice, and jumbalaya we had in the city.","useful":0,"cool":0},"5jLkzHnvBHD2zgkh3tYz_g":{"text":"The thing about New Orleans, is if you are staying in-near The Quarter, do your homework o","useful":0,"cool":0},"oziP4NV0CmSAeQvuFCkbPA":{"text":"I give this place 5 stars because there aren't 10. This was the best food and service we h","useful":1,"cool":2},"R2vkMyjxVxKyU_ZIR28PTg":{"text":"Oyster poboy yum. Big screen tv for the game. Abita amber it's all good.","useful":1,"cool":2},"GvR5ESHWGEsgya0PvANACg":{"text":"The Cajun omelette is super good.  The gator po boy is amazing!  Bottomless bloody Mary's ","useful":0,"cool":0},"VEa2Eapvb4o5W49T9Rs_dw":{"text":"So heard the food was good and it was 24hrs and it's 2am on a Saturdaynight so we went in ","useful":0,"cool":0},"k2DzrcklNOBhMN9nY9-rkQ":{"text":"I haven't read all the other reviews.  After a few days of trying the tourist stops, Daisy","useful":0,"cool":0},"yN77CkUbbZfU6wNCtpSwpw":{"text":"I really enjoyed eating here ! I ordered the shrimp po boy and spicy gumbo . It was defini","useful":0,"cool":0},"A-bk6OJGjwxUh-1HItv23A":{"text":"A tourist rip-off, as a local hospitality employee in FQ, breakfast eggs hbrowns and toast","useful":0,"cool":0},"v9fMDVHhbbHd3djQadwUMg":{"text":"This place is next door to Jimmy J's which was our original destination- the line out of J","useful":0,"cool":0},"6HGX87zMizxekPzZuiA6kA":{"text":"I've eaten lunch at Daisy Dukes and knew it was good. Had not done breakfast there. Headed","useful":0,"cool":0},"aHyBVzXtfsuTiHKPlMpeBA":{"text":"Excellent value.  Good food. Great Bloody Mary, unlimited refills with meal.  Had a great ","useful":0,"cool":0},"gKVPLS5R5yR65aAjxxkeOw":{"text":"Fair. I wouldn't go back but it was quick, did  the job, the food was fine. Nothing great.","useful":0,"cool":0},"auiEhZ9EEBMgz3Tocf3q0A":{"text":"Breakfast was solid. Decent price lots of food. If you can get the early bird special that","useful":0,"cool":0},"WDgxEbeKQVy6NNkcc-DwMQ":{"text":"I liked this place. I ate breakfast there. After a yucky night at the W hotel and after ea","useful":0,"cool":0},"xV28vsToLs1_DbkFCPg-kw":{"text":"OMG this place is a hidden gem!!! What a delicious restaurant! Their gumbo recipe is one o","useful":0,"cool":0},"OePhfd8Ytf-noJH101-0Qw":{"text":"Daisy Dukes at 121 Chartres Street is in the French Quarter and Daisy Dukes Express in sev","useful":0,"cool":0},"SaPBfnm6DT_KwTTVaV-E7A":{"text":"Popular with the locals for no apparent reason, this place is like a Denny's inside a dive","useful":0,"cool":0},"x35cCDzSauSC6x9xP5rkNw":{"text":"Cute little place, we had some nice food. Waitress was charming. Found the bottomless Bloo","useful":0,"cool":0},"wmntIqK1PzdkXjHsFRl-zw":{"text":"My friends choose never to order here or go here!!! Ordered delivery on their 24 hour deli","useful":0,"cool":0},"TlMqKdnxtKA0HSNVND3Gug":{"text":"Went to Daisy Dukes twice for breakfast because breakfast is served 24 hours.  I had eggs,","useful":0,"cool":0},"M89VGSZf-VmFYi6ho1YzBg":{"text":"Our server Pamela was the best!  Food was amazing...never waited for a drink refill and no","useful":1,"cool":1},"6f9GZZ_skVmsi1H7JruUQg":{"text":"PERFECT spot to stumble to after a night of heavy drinking on bourbon or to celebrate a mi","useful":2,"cool":1},"zVdrCKC_zMiXMcqtC8yHTw":{"text":"I was near bourbon street and wanted to get some crawfish and found this place. It had dec","useful":5,"cool":5},"_BCU5NfIqN9CYkCwiLn-SA":{"text":"Only 1 star due to the fact that you have to right a star to review. Granted we did come i","useful":0,"cool":0},"N8zTmnljT7vE9rwuJkZF1w":{"text":"By far, the best bloody mary ever. And the food's awesome too. Service was great, fast, at","useful":0,"cool":0},"AFMBkVxCRbzcFJaXa6TLNA":{"text":"One of the locals told me this was a great place for breakfast. Couldn't agree more! Had a","useful":0,"cool":0},"Z-8UG80NvpEImydPJXfTgg":{"text":"Out of about 4 places I ate at during my trip to NOLA this has to my favorite.\n\nWe ended u","useful":1,"cool":2},"ImXiWFvIv8CScc5s0uHgfQ":{"text":"Bottomless Bloody Mary's - with one placed into a to-go cup without even asking and brough","useful":0,"cool":0},"hv2pKmtNUrCWs8gxFfz0mQ":{"text":"I liked the place for having quick eat. Had Grits, Hash Browns, Veggie Boy with Onion Ring","useful":0,"cool":0},"I31S-H5GjlQhtpB2kRcWrw":{"text":"A perplexing experience. When I got there the hostess was very friendly and told me it was","useful":0,"cool":0},"90jtpBYl1sJuOvlGBuZL4A":{"text":"It was really hard for me to enjoy food at this restaurant because I am a vegetarian.  The","useful":0,"cool":0},"ASyQyBb33Zs-7V3sbmDMdA":{"text":"We were in search of a good after-bar spot and Google'd Daisy Duke's.\nThe paintings on the","useful":1,"cool":0},"ym3mPg6xTHCjMhbEUEhyyA":{"text":"Very good food but a little overpriced. I was very basic nothing extraordinary about he me","useful":0,"cool":0},"Kbwh2qfsd9EGpvDgBdq5Cg":{"text":"It's amazing coming from an expensive city (NYC) and then finding cheap gems likes this pl","useful":0,"cool":0},"xieiLOBywWEg5fMltWLZVg":{"text":"Start with horrible and goes downhill from there.\nWent on a recommendation, and ended with","useful":2,"cool":0},"XN6M14ucCLDlHkYx17xbZA":{"text":"Tried the gumbo. It was watery and had little flavour. The service was also unfriendly fro","useful":0,"cool":0},"CYxQ8OzyY7MlzSKjuJxAGw":{"text":"We really enjoyed Mel and all the staffers. Our food was good and we got a chance to sampl","useful":0,"cool":0},"AxWPQQFK2CEM0uuRAttvgA":{"text":"Daisy Dukes, feels like a biker joint with reasonably priced food.  Open all night.  Recom","useful":0,"cool":0},"Zie8vKOa_8x5E24Lx0j5Wg":{"text":"The poboy was good. Wasn't a fan of the oyster  but the shrimp was good. Tad bit expensive","useful":0,"cool":0},"2_sl9O44-dvnVWmQN_ewyQ":{"text":"Not quite sure what the hype is about this place. \nWe had a sampler trio that had red bean","useful":0,"cool":0},"bXyemKOtNiUyn0VDENYkPQ":{"text":"Us New Orleanians know Mardi Gras is a long day we certainly aren't amateurs at the world'","useful":5,"cool":4},"3F67LqyuKshs-7nk7mwbAQ":{"text":"Breakfast sandwich with egg over easy and bacon on wheat at 5 am with family was delicious","useful":2,"cool":1},"qak5ndX9dUAObbkKfzm5fw":{"text":"Great late night spot to grab a bite, this place gets really packed so you might have to w","useful":0,"cool":0},"vCaUikqtBQiU4SYKfWthoQ":{"text":"Cheap food that's pretty tasty. Delicious Bloody Marys. Buy one get one free! Also breakfa","useful":0,"cool":0},"4Q54l3xlHRnueCfiNwrn9w":{"text":"After walking around looking for a place to eat on Thanksgiving, we stopped here for break","useful":0,"cool":0},"ryJ2YgOVxiQNBrNqg-EWlw":{"text":"Daisy Dukes is a little hidden gem for breakfast in New Orleans. They offer a huge menu wi","useful":0,"cool":0},"vJ__NYSekkgNrom9iVWo7A":{"text":"We stopped into Daisy Dukes for some crawfish because it was recommended by a few locals f","useful":0,"cool":0},"zDOB1dIAy165gPYWR2YHOQ":{"text":"I can only speak for the breakfast,  but it was awesome. Food comes out super quick, hot a","useful":0,"cool":0},"8A71T7O57wg2OoGkPZeWNQ":{"text":"Good crawfish, though a little over boiled! But they were seasoned nicely!! Burger was che","useful":0,"cool":0},"DkAmzEWxCK4fZ7JkCuCKwg":{"text":"Excellent breakfast, ordered and presented to  perfection! The family of sisters are heck ","useful":0,"cool":0},"9HVJ1CqNoOv5oYHINFCSZQ":{"text":"We stumbled into this place when we realize the Hobnobbers is closed on Sundays. Luckily t","useful":1,"cool":1},"SuOy8b8ZT3EzaN7xh2pWLw":{"text":"Terrible service and manners from waitress, be prepared to spend a lot of time waiting for","useful":0,"cool":0},"7frdzP6otpwoQzsSpW1yZg":{"text":"Amazing food, and shockingly cheap. I am not sure why this place shows two dollar signs on","useful":0,"cool":0},"I8m0IVdhx9eAtgAJPARAOA":{"text":"Ate here around 9pm and we all had shrimp poboys with gumbo. The gumbo was absolutely amaz","useful":0,"cool":0},"hTa1JYMdmkR-z4ROMdDlLA":{"text":"Great place! Very small but we literally had our entire breakfast in under 5 minutes! Food","useful":0,"cool":0},"RPmcFo-plH1aWK3vAB4doQ":{"text":"I ordered the sampler plate. The Jambalaya was very good. I was shocked that something tha","useful":1,"cool":0},"qpE8pBaH6ymfOODgOO7Ctw":{"text":"This is really a 2.5 star review\n\nWe came here for an early breakfast because it's one of ","useful":0,"cool":0},"U22LpZeDtWhPvDIQXNdOfw":{"text":"I visit New Orleans in Octover 2010, November 2010. I love the food iin Daisy Dukes new re","useful":0,"cool":0},"-m_ObmhfZfgpmy7Z8LYnfg":{"text":"So I did a turn around from Bossier city to NOLA with my family and I. We arrived in New O","useful":0,"cool":0},"YIEGuDgbgF14gKNw56bm5w":{"text":"Low-key diner open 24 hrs, which is why I was there in the middle of the night. Place was ","useful":0,"cool":0},"mCJ91R0ayvCM-2kNVJaVwg":{"text":"We found this place by chance and we're glad we did! The workers were friendly, the Bloody","useful":0,"cool":0},"_1D-QAQRSOy-3VtoUszdzQ":{"text":"Ate both lunch and breakfast here on a recent trip to NOLA.   Small place but the food and","useful":0,"cool":0},"KyFervMgM99WnsrXNJonQw":{"text":"We really liked this restaurant - the gumbo was tasty & had lots of shrimp & the portions ","useful":0,"cool":0},"6j8o931UQE0Zexp_FZUc-g":{"text":"Review for 121 Chartres St. I did not like the service, the host is pushy , the food was n","useful":0,"cool":0},"PEklvaRbVdRgjayNRRvFmw":{"text":"Blood mary=nice granish... but no spice or flavor nor alcohol. Tasted like watery tomato j","useful":0,"cool":0},"L_lTmzNoaf4K-hClpBJZSg":{"text":"I came here a while back in December. \n\nA few advantages to this place:\nIt's open late for","useful":3,"cool":1},"sL2nZVJp8tBbjuRBj4JwKA":{"text":"The waitress seemed kind of bothered by us being here. I had the seafood omelette with has","useful":0,"cool":0},"RA61OWzGsu6WFt2Anpbtaw":{"text":"We discovered this place the first day we arrived in New Orleans. We have been back for br","useful":2,"cool":2},"JVgDxxhOmK9377hKbj8Urw":{"text":"Decent place to grab a bite after hours. Lots of police officers when I went there, there ","useful":1,"cool":1},"ebBxIdpERp0X04iqVQJx6g":{"text":"While I was NOLA, I came here 2xs and both times just phenomenal. The shrimp basket amazin","useful":0,"cool":0},"bs-Gu84MogqhrzSuzexixw":{"text":"This is a great little place with great food and atmosphere. Friendly, courteous staff and","useful":0,"cool":0},"S9hi-raA2Rb4zYBxEQ9lag":{"text":"I came here at around 1am to get a late night snack after partying!  Ordered a couple Po b","useful":1,"cool":1},"QbhIQKAubj43SK7nqE87hw":{"text":"Hole in the wall type place; not many options. Only good news is that they have breakfast ","useful":0,"cool":0},"-Ch4OGG8B_ztizbqdbOnzA":{"text":"Love this place! The crawfish are perfectly seasoned and you can get them anytime. The sta","useful":2,"cool":1},"TZ0fcURLHHsfxgHcW7Dh2A":{"text":"This place rocks.  It is inexpensive in a normally expensive restaurant town.  The breakfa","useful":1,"cool":1},"o1Cw1WYG6GP78ji99qwAHg":{"text":"I loved loved loved everything I ate from there gator omelette,  cheddar cheese grits, BIS","useful":0,"cool":0},"vgEkOGV60tvFtNwZGtSTxA":{"text":"The food here is OK. They make up for the food not being stellar by serving you big portio","useful":0,"cool":0},"s5Szo-zb1BtDBI2ptDgKoA":{"text":"Absolutely terrible..!! Frozen fish... Not fresh..!\nFrozen onion rings... Not home made..!","useful":0,"cool":0},"MgsUYLQR9_BzU5ufiTWryg":{"text":"Good relatively inexpensive food in a convenient place right off canal I usually stay at t","useful":0,"cool":0},"o5oBYIhU85yDjycq-oOFAg":{"text":"This review is for TAKE OUT ONLY!\n\nI was too tired to go back out at 10 PM from our hotel ","useful":2,"cool":1},"SmAhSwSuoV0bEDO8wpHmbQ":{"text":"It was ok for what it is...Its just diner ....service was ok food was ok...its open pretty","useful":0,"cool":0},"GlE75Y2UjcpCU2Uc00Tscg":{"text":"Can I give a zero star? Worst bloody mary I've even had. The waitress took our drink order","useful":0,"cool":0},"jzlRfQqXk6ul6TXqwst9kQ":{"text":"So, it's been well over an hour and we still have no food. Took about 30 minutes for the w","useful":0,"cool":0},"QYhDCerSDoWCYRBUcq8g-g":{"text":"My friend's and I were looking for a good local cajun restaurant when we stumbled on this ","useful":0,"cool":0},"hyjPM99u4Nt5bJQh9nBiEg":{"text":"Ordered the chicken tenders with buffalo and the chicken and sauce are awesome! The fries ","useful":0,"cool":0},"nAh6YTDX8k1NE2PhTWWuTQ":{"text":"Probably the worst restaurant I've ever been to.  Our waitress had to stop taking our orde","useful":0,"cool":0},"RJVh-ecYvXeiIkYJZ9OLYg":{"text":"So I kicked off my holiday travel in New Orleans and decided to try Daisy Dukes and I must","useful":0,"cool":0},"ZL8bcmBnQ0FVfiOUPE_9vw":{"text":"My friend and I came to town for Mardi Gras. We stopped in here on a whim the first day we","useful":3,"cool":3},"n4v8beyp8Fw07AQBBWXIhg":{"text":"Just had breakfast food, which is hard to get wrong, but my Omelette was somewhat brown an","useful":0,"cool":0},"y0HR3PnhgOiY3oPf_m45jw":{"text":"Unfortunately, they started off with a bad impression when my Sweet tea came out to the ta","useful":0,"cool":0},"ZzsICY5XK7fve9KgPK1L3w":{"text":"Ordered pizza and the manager and co workers were extremely rude and was told I was acting","useful":0,"cool":0},"Opo-xK080McMx9oF0QKOvA":{"text":"This was my first go round with Daisy Dukes and I have been to NOLA a few times.  Let me j","useful":3,"cool":1},"gHd7d-981_VCsqXjgC7KIQ":{"text":"I believe this was the location my friends and I visited on night around 10pm the day we g","useful":0,"cool":0},"cAehBYClGFqDU8zro3KeHQ":{"text":"This place is great! They took us in right away with a large group and our server Pamela w","useful":1,"cool":0},"6xgauMxNUwAS31_hEDjhnA":{"text":"Open 24/7 with bottomless hurricanes & more mimosas this place is the greatest in the late","useful":2,"cool":0},"8E6dwyenj8CRd1OGeMy0Bw":{"text":"Here for the Essence Music Festival.   This place was highly rated.   I don't know why.   ","useful":1,"cool":0},"M66dpvs0UdIkSuxC2qy6ug":{"text":"Went to breakfast with the wife.  Service was ok.  Food was extremely greasy, even for a C","useful":0,"cool":0},"sAQZXNdwGUBWPu3GxshChA":{"text":"The fried green tomatoes are amazing. The wings are crispy and meaty.  The crawfish etouff","useful":0,"cool":0},"RYhpZNg_YHTJdzZtE8vGlg":{"text":"I can't believe I was in NOLA and really only wanted their burger. You can't beat free ref","useful":0,"cool":1},"kM0lieKprWrB8cn2td97mQ":{"text":"Bottomless bloody marys seals the deal for me. They are pretty tasty too! I enjoyed my bre","useful":2,"cool":1},"l6htwmIgCg__mAjp1Ti4VA":{"text":"Chis is the best waiter! Food is delicious and the atmosphere is upbeat and happy. We will","useful":0,"cool":0},"CdLG8HDFjaxsCNzNXBLO8g":{"text":"Endroit sympa...personels gentil....par contre..pas de shrim pas de crawfish....juste oyst","useful":0,"cool":0},"I05-UEbDP-8Y7wFTOViAqA":{"text":"Had nice fried green tomatoes but the buttermilk baskets were the highlight of my trip","useful":3,"cool":3},"72tXbw-hp_H7eDXAApYsMg":{"text":"Always a good hearty portion.  Only gave it four stars because wait sucks but the food is ","useful":0,"cool":0},"Tpaja3K1dnJxp2N7xyC_ZA":{"text":"Best breakfast in NOLA.  Try the omelette with alligator sausage.  Biscuits are heavenly. ","useful":1,"cool":0},"howTHg9_ySfJ1yS53ZsGRg":{"text":"After looking at yelp for close to an hour, I decided on Daisy Dukes after a friend recomm","useful":0,"cool":0},"Q8voUKSSf0037NVUjTaE0w":{"text":"Nawlins is one of my new favorite layovers and Daisy Dukes is one of the reasons. It's clo","useful":3,"cool":3},"8tVAb8aUqoEhR7_qqbvFGg":{"text":"Good late night affordable food, staff is friendly!!  lots of choices French toast was yum","useful":0,"cool":0},"KWamRlti9TOu13Mg_IF1kg":{"text":"Great breakfast.  The alligator omelet was delicious.  The half po boy is huge. Nice local","useful":3,"cool":3},"LbLxgiyyLFmHB_gBJZNlvQ":{"text":"Well, I didn't expect much after a horrid experience at Mother's. I am now banned from rec","useful":4,"cool":3},"7vBMem3-c24w97z9ptkF_w":{"text":"We declared this our after hours spot once learning it was opened 24/7 (well the one aroun","useful":0,"cool":0},"v5Ppy8LKkuiX0uCeDk604Q":{"text":"Yum!! Shrimp Po Boy was amazing. The red beans have the perfect amount of spice. Great foo","useful":0,"cool":0},"XnS9Fz2StjySPpxq1Vb3Qg":{"text":"Okay this is the worst place I've had breakfast . The pervious night we went to Ruby slipp","useful":0,"cool":0},"-lWsmfhwJyr33SLhA2TlwA":{"text":"Great service! Pamala was excellent. Split checks for us against their policy. Cool atmosp","useful":0,"cool":0},"nvjLYJm1owk8CYuFb5TuuA":{"text":"The waitress was very nice, and they were able to accommodate our party of 9 at 10:30pm wh","useful":0,"cool":0},"Bv9G37izDHj0vkdsEAQT7Q":{"text":"I really wanted to give this place a good review. The staff is friendly and welcoming, the","useful":0,"cool":0},"yAMewWxaYMLwZxL_rD5Kfg":{"text":"I found this place late night hidden between bars.  I ordered a $7 burger with bacon and f","useful":0,"cool":0},"X8ZiUb7ABGMcyCHnFo6GgA":{"text":"Bottomless Bloody Mary for $8 bucks can't be beat. I chose a meal that was $21.00. It was ","useful":0,"cool":0},"qSWsyht4-Wq3Yk6FgRaLFQ":{"text":"Straight creole/Cajun food here. \n\nThe food was amazing. The bottomless bloody Mary's were","useful":1,"cool":1},"Q0IOmrvCZiRXTZ4VYdCv9g":{"text":"When in need of late-night eats... DD fits the bill. Good foor, good service... not too fa","useful":0,"cool":0},"_tHbpHr91E7---9qxKYTtQ":{"text":"Worst drinks ever. Absolutely no flavor, where's thee liqour???? Both the hurricane and bl","useful":1,"cool":0},"_PTkQKsio1gePjuKITJO3A":{"text":"A dive -- if you come expecting more than that you'll be disappointed.   This place was di","useful":0,"cool":0},"1RIdh-iC2F_rMmYzSu2kWA":{"text":"Great breakfast. It's a great place to chase a hangover away. We went, unfortunately, at 8","useful":1,"cool":1},"TRdfd4kAwrzWiCuKW4tNmw":{"text":"My husband & I went here for breakfast, and we both enjoyed our meals.  He ordered the bis","useful":0,"cool":0},"mIfszGaIMof1jlv2xGk_dw":{"text":"Went for a late dinner after getting in the city. Service was good. Food was great! Would ","useful":0,"cool":0},"MUp73iGNjnhY4TqjWIWpdQ":{"text":"So far so good, haven't eaten yet. Bloody Mary is very good. Pamela is a great waitress.","useful":0,"cool":0},"V1AY9Ez1ASynEa3fxjNxqQ":{"text":"Awesome fried green tomatoes. \nGreat customer service. \nWent out in a small group of 5 the","useful":0,"cool":0},"LnM_PeCSlTNTJgHqXzEGeQ":{"text":"Had half a shrimp and oyster po-boy.  You can't order it that way.  Had half of someone el","useful":0,"cool":0},"j-CBHUx2zP_VCTTX52-aeQ":{"text":"Pretty good late night spot. The fish Po Boy was the perfect 3am dish. The red beans and r","useful":0,"cool":0},"3TnINy296klp7-CAghBIbg":{"text":"Great, well-priced food. Had the breakfast sandwich and Cajun fries. Yum. The Cajun omelet","useful":0,"cool":0},"611VnYwzi7pqENfAEFDbAA":{"text":"Grilled chicken sandwich was great; fries had the right amount of spice. I didn't even nee","useful":0,"cool":1},"MgwPN6zL5Vkg2x4t8FHQaw":{"text":"Delicious!  We hit Daisy Dukes every time we are in NOLA.  Consistent food, great service ","useful":1,"cool":0},"IyWYromcJDZNVQ9q0vxtgA":{"text":"Total divey place that I would not think to come to eat but with limited choices on Christ","useful":0,"cool":0},"Vk4C_Ln11ohO8zxg-z89Yw":{"text":"It is mine and my boyfriend's first time being in New Orleans, and everyone back home was ","useful":0,"cool":0},"XfwFNQTNcglbUSOPtJ98jQ":{"text":"The food was average, nothing special, and the service was very slow. The waiter was nowhe","useful":0,"cool":1},"s3rqmT3MnTqqRsU2Wt5hPw":{"text":"Great gumbo! Asked for shrimp and grits and they special made for us since they didn't off","useful":0,"cool":0},"ycMs_MiS5IHvmAmA6dKphQ":{"text":"Hidden on the side street across the back entrance to the Marriott, you couldnt help but n","useful":2,"cool":0},"OAFahZtzoMj6rDn1QNHYTA":{"text":"Great bloody marys and combo plates truly local place with great local food. The staff is ","useful":0,"cool":0},"sQLR1NtRbE8zhBcIAmZClg":{"text":"This is my third visit on a five night trip to NO. The first visit I ordered a pound of cr","useful":0,"cool":0},"geZ7yLH1kxPkO_KalIzp1Q":{"text":"pancakes were terrible. have had the breakfast special before,very tasty and a bargain, ju","useful":0,"cool":0},"xkZHueTlIoMP33J3kKhRDQ":{"text":"This was a first stop for food in New Orleans and it really set the tone. We had the oyste","useful":0,"cool":0},"9Vv7SPoMt77b4z7B7Cw-5A":{"text":"This was the place to go.....it is open 24hrs a day. So if you can't find a restaurant the","useful":0,"cool":0},"AgDuoNvHZujPZi_ZaZK87A":{"text":"Line took a while to get in but everything was yummy. Worth the wait. Delicious bottomless","useful":0,"cool":0},"RMgBAh4kh8wo_Bk0WlVECA":{"text":"Diner like dive. I didn't even order anything. My companion did get the crawfish and enjoy","useful":0,"cool":0},"5LgyEsbdcNKeOG3ew78P6A":{"text":"Hello Touristas who want to get pissed for dinner.\nThis review is for YOU.\nIf  you want re","useful":0,"cool":1},"FHZcfXPI4SxJi3kZuHBmUQ":{"text":"Good food at a decent and acceptable price. Oysters were good, a little small but the pric","useful":0,"cool":0},"Uu2tHFafQWVTbIfsQz9obw":{"text":"Another place that was open on Xmas, much appreciated by these out-of-towners looking for ","useful":4,"cool":5},"V742bF12YqJepbq5PdICHA":{"text":"Super good service. We were tired if greasy fried expensive food, so we ventured off bourb","useful":0,"cool":0},"qoOntHL3zJSodJ7ItYmMZQ":{"text":"Not a fan. Food was edible, but nothing great. Definitely doesn't compare to the other opt","useful":0,"cool":0},"Jz--PXpuwlg9mvc-ZVig2g":{"text":"I didn't think it would be possible to fuck up a simple po boy and at such a high price. D","useful":0,"cool":0},"RHGX7cMAVfkpvnLkvwUV3A":{"text":"Best Breakfast made your way 24/7. Earlier Riser's and Wait Staff from the Quarter eat her","useful":1,"cool":1},"vZVZqHz0W0NWVVhw1DFlPA":{"text":"5 stars for being open 24/7...but then it goes downhill from there.\n3 Stars for the food.\n","useful":3,"cool":0},"w-5JtsCU2oMnEgMRwUwh6Q":{"text":"Clean, (really clean for NOLA;) good service, alligator sausage po boy & fried green tomat","useful":1,"cool":0},"jextkgpipX8snTSymgclkA":{"text":"This place is a typical late night diner that serves tasty food. \n\nThe ladies, even at 3.3","useful":4,"cool":4},"y66OtIAxOJl-XiDgZlT7bQ":{"text":"This is a hole in the wall place. I came here for a quick lunch. Very friendly staff. Orde","useful":2,"cool":2},"DZ_e5W9iKzmaEQ9G_VY0cQ":{"text":"Very good food.  Good portions, and great service.  Three very different meals tonight and","useful":0,"cool":0},"GIqUBcutdvYgrSZx7BKoLw":{"text":"Great food and wonderful service. Brandy is a spectacular server! She made us feel right o","useful":0,"cool":0},"bERGLGVIdBjiOXyqm1KLCg":{"text":"The place really looks like a questionable establishment from the outside but inside is co","useful":2,"cool":3},"C80QbwGRBOhcXk3YAZ1D7g":{"text":"Excellent food and service. Freshest salad ever.Gator sausage outstanding!!! Crawfish Etto","useful":0,"cool":0},"fykEWTzrXuNxfUbK1fdbRA":{"text":"Horrible wings, wing sauce is terrible and wings aren't full wings, more like scraps no on","useful":0,"cool":0},"ETvC7hfk1L-XWUlX05zxGQ":{"text":"It was a late night venture for my wife and I. She had the fried shrimp platter and I had ","useful":0,"cool":0},"XpQzH9e37D4v7TOmPeSw9Q":{"text":"Daisy dukes in new orleans good enough food I ate there twice. Way better than the meals I","useful":0,"cool":0},"iH80quzxOQ-neCRBC1EQLw":{"text":"Ordered some delivery upon arriving past 11pm to my hotel from the airport. Paid $40 for a","useful":0,"cool":0},"2rNsmUoc99GVea6pMNJgKw":{"text":"Was in Nola this past weekend and this spot was a few blocks from my hotel. I went on bour","useful":2,"cool":2},"9HfAgHU5nmg-wYGQtQSQCQ":{"text":"Great food. Smaller place with good intentions but service is lacking. Bloody Mary's are f","useful":1,"cool":0},"OPcNFZLTL_RKGjzQ7d0NIQ":{"text":"We stayed at Marriott while in Nola for a few days. Since daisy Dukes was close bu we ate ","useful":0,"cool":0},"Y55JySvCSGxyDGzxv17tPw":{"text":"The food at Daisy Dukes is good and not expensive. They have real gumbo and good service. ","useful":0,"cool":0},"hBjg0lhhBm4QaZKHYWKtKQ":{"text":"3 visits over two days. Twice for breakfast for their bacon egg and cheese biscuit sandwic","useful":0,"cool":0},"Te-RPo-NHzfedt0_OQD5Ww":{"text":"All u can drink bloody mary's for $8 bucks, hell yeah!  They aren't the best but they will","useful":1,"cool":1},"gPEqaa_JaTjU5GUcRlJjNA":{"text":"When you think of the New Orleans culinary experience, chicken wings are probably not high","useful":1,"cool":0},"v3VnGeC7RhaJgKAP1nrlqw":{"text":"Don't go!!  Stood outside for twenty minutes. No hostess came out. When entered to inquire","useful":0,"cool":0},"vc36lm2VCK10twwT_3kdow":{"text":"Good breakfast joint. The alligator sausage omelet was cooked just right-soft and tasty. T","useful":0,"cool":0},"r-bNtXpsx8lMaqxFBOf_LQ":{"text":"This was a cute restaurant. It had a lot of personality. The food was delicious too! My fr","useful":0,"cool":0},"fzmWm1ffb_-mtB3DFMEsag":{"text":"Coffe was weak- you could see through it and NOT hot. Food was majorly greasy, you could s","useful":0,"cool":0},"MrAi4NYwoFJG_TqTAp1vrw":{"text":"Early bird special was good and excellent for the price.  The service was extreme fast and","useful":0,"cool":0},"nDumoRE-8DxFA6Py_8rtlg":{"text":"This is the best gumbo I have had in a long time. I ordered food one night at work and now","useful":1,"cool":1},"_p_dtZAHL2O6HcRvTWMXAQ":{"text":"I'd skip this spot and try another. The front door serve wasn't ideal but our server was s","useful":0,"cool":0},"4LBN9U5UG3yRs_R0iQNqJg":{"text":"A locals approved 24hr diner with fantastic creole inspired cuisine. Great place to start ","useful":0,"cool":0},"HABnndJKDtwUvXO8nhrDEg":{"text":"Breakfast was meh....bloody marys were great. Loved the crawfish additive with it. Will on","useful":0,"cool":0},"xIEc9aLRR6rwn1GFrPgAjA":{"text":"Awesome food, quick delivery to table and endless bloody Mary's. I will be back. O yea, th","useful":0,"cool":0},"ReuUA4PoJiUEVrJ9eZ6JeQ":{"text":"Small establishment. No pomp & circumstance. Refills on blood Mary's so that's a plus.","useful":0,"cool":0},"d77aNK3F-_3BCqlQOQRvSw":{"text":"The service was great and the staff was nice.  Went in and the food great.  A must visit o","useful":0,"cool":0},"CFy76iEqgsq1RNk9e0VNsQ":{"text":"ZERO stars.  Came here for brunch, waited a good 20 minutes before sitting down, no big de","useful":1,"cool":0},"iSRfHJLozv-VWgpvJVjp6g":{"text":"We went to Daisy Dukes for breakfast.  Everyone in our party ordered some variation of the","useful":0,"cool":0},"nLNKo0mRKNFbW0GrZ3jrQA":{"text":"Our order got here faster than they said it would but it's wrong. Biscuits instead of toas","useful":0,"cool":0},"O-YqTjQ6rTokchafFVlcxg":{"text":"Went here today with my little family. Early bird special was great! Husband I both got it","useful":0,"cool":0},"EkbUoGaIXhyN2sx6Gcfkhw":{"text":"Had a little too much fun on Bourbon Street our first night in town, and made it back to t","useful":0,"cool":0},"_OELUBs4LFrQkSICz1uXbg":{"text":"This place is so good we had it twice while visiting New Orleans. The prices are affordabl","useful":0,"cool":0},"Pb8gh3qqf6eSuFhH-s2lNg":{"text":"No matter the day or time this place delivers with a smile. Highly under rated considering","useful":0,"cool":1},"vsZ-bcwiqhH4PtbX3iv53g":{"text":"The evening staff has a horrible attitude and no communication skills at all. Although the","useful":1,"cool":1},"wgFjLiH7rkSEgRFr5bCwug":{"text":"Been to NOLA multiple times but this was my first time trying this restaurant. Food was pr","useful":0,"cool":0},"k3vYs91AwPEB8aCUq6YI_g":{"text":"Good inexpensive food that is a step above fast food.  In the French Quarter that is hard ","useful":0,"cool":0},"1YU8dodLcbF6FiyLket6oA":{"text":"Standing on a sidewalk on a side street in New Orleans, smartphone in hand and looking for","useful":1,"cool":0},"EZ4X3nAsl8aMC7hiNvMfCQ":{"text":"Food was pretty standard, service was sub par. I ate here twice during my trip to NOLA. Du","useful":0,"cool":0},"tks6j-3zAQCJb62-hBWQTA":{"text":"The food was good and the service was great. If you're getting fries, make sure to get the","useful":4,"cool":3},"ff6_pIfJDF0o0R1zYMm7bw":{"text":"Ok... I don't normally do this. Food was fine a mouse ran under our feet. I live where the","useful":0,"cool":0},"x5fRq2vmBhjp07h5YCCtAA":{"text":"This place was recommended by our hotel as a great spot to get crawfish. I could not have ","useful":0,"cool":0},"fK2z5J6S---0ZL0BtnuT7Q":{"text":"Great food. Great fun servers. The crawfish ettoufe was creamy and buttery. Open late. Bet","useful":0,"cool":0},"7jT0ItCiEhss_gWe8ie1Wg":{"text":"Great food. Great drinks. Hello BOTTOMLESS BLOODY MARY'S with a YELP CHEK-IN... Winning!!!","useful":10,"cool":10},"schVOpOWG1PoWBO_r-gonw":{"text":"Ended up coming here 4 times in the week we were in New Orleans.  They are open 24/7, so i","useful":0,"cool":0},"sBbA97STYNJNkJZpuQQd4A":{"text":"Very good lunch place. Came here for lunch on vacation.\n\nThe gumbo, as other people have m","useful":1,"cool":0},"JnU1qK9VhUAjJHKw25i2GA":{"text":"Decent food, nothing special. Soda/pop is huge so if you're thirsty, this is where it's at","useful":0,"cool":0},"c1C220ffd29JhEUBh79ukw":{"text":"This place is exactly what you would expect. A typical greasy spoon. There isnt going to b","useful":0,"cool":0},"lallMSQiONmXrKeKa30wKg":{"text":"Amazing breakfast & reasonable prices. Will definitely return. Just missed the early bird ","useful":0,"cool":0},"b0yqvfv7S4BhjscLdIxsfg":{"text":"I was a little underwhelmed with the red beans and rice,as well as the gumbo. Especially f","useful":0,"cool":0},"GGj5s5J8olUfSCundQMmtQ":{"text":"After a very late Friday night out on the town, we needed breakfast bad Saturday morning. ","useful":1,"cool":3},"8fUM1HRXOKmUzNtOJgIBaA":{"text":"I was looking for late night eats while on vacation in New Orleans. The wait was long but ","useful":0,"cool":0},"ycehfywXLafH8UZ165Bkxg":{"text":"If you're in town for Mardi Gras or just a weekend in NO, you have to stop and grab a bite","useful":1,"cool":1},"Dzl2eWv0UQqSXFqt0syyVw":{"text":"On point!\nThis place delivered to our hotel at 1:45am and the pizza was great.  The chicke","useful":0,"cool":0},"PV46b3nxFzgs4Le50WOa_A":{"text":"My Sweetie and I had a fantastic breakfast here this morning @ Daisy Dukes! He had the veg","useful":0,"cool":0},"lPlQtSnHzWUnZK6GoHa4gA":{"text":"Had just got off the plane and checked in hotel. Walked over and perfect! I had the gumbo ","useful":0,"cool":0},"kF-G5LMqc9UZUvMAqoNL_A":{"text":"We went here on a whim late at night during Mardi Gras on Monday night before Fat Tuesday ","useful":1,"cool":1},"91wSskm7NSSxd6eP4A0d9w":{"text":"We came here on 12/20  because of the good reviews we read online, and were totally disapp","useful":0,"cool":0},"fBtAMu25uFqRvXbGdJ1qlQ":{"text":"Great food.   Relaxed atmosphere.   Definitely will come back some time during our trip","useful":0,"cool":0},"GL9HR_1vJ2Q3Z5od5V1XQA":{"text":"Also wir haben den Double D Burger mit Fries und ein halbes Shrimp Po-Boy mit kleinem Gumb","useful":0,"cool":0},"o4_wPlWaexYAqQBlb7Iq8A":{"text":"I had a hankering for wings after attending the Saints (Who Dat!?!) vs. Falcons game on Ch","useful":0,"cool":0},"3wzY8SsmqlbXKNwxXjo4hQ":{"text":"Good place to stop in for lunch the hot sausage po-boy was spicy and good. Service was pro","useful":0,"cool":0},"NSSd6nZ7YYuitDNbqxregA":{"text":"Daisy Dukes had crawfish when other establishments were out! They've got a great all you c","useful":1,"cool":0},"N3wEn1ADyJ5dyEB3ogqzSA":{"text":"Every meal in Nola is an experience but daisy dukes is the whole package fabulous food won","useful":0,"cool":0},"1O3J3d44ktSR_iBxLng9Tw":{"text":"Hard to find with street construction but worth the effort. Great breakfast. Great service","useful":0,"cool":0},"kYu55mSPltPUmb-T1_47eg":{"text":"Went here for breakfast and the food was served cold. We asked to speak to the manager and","useful":0,"cool":0},"GmhzGA5dMOb6Ey-9FLkOvg":{"text":"Heard so much about the great Bloody Mary.  Had to try it.  Well, hands down the best Bloo","useful":1,"cool":1},"9O9OcTM5QZJy2RF06lhaVg":{"text":"Came here multiple times during my vacation, they were VERY busy, but that shows for the q","useful":0,"cool":0},"WrCizly1Lr6e_owV7Irvqw":{"text":"There's a lot to love about Daisy Dukes! Every time we visit New Orleans we manage to end ","useful":2,"cool":2},"UW6gX89qK5ZgJ-1ie6Nxdg":{"text":"Seriously just f-ing close. If you want slow service paired with awful food, this is for y","useful":1,"cool":0},"6s_oGnjHmvunTw1U_Sep8g":{"text":"By far the worse food I've ever had in NOLA. It was comparable to a crappy Waffle House me","useful":2,"cool":0},"80outD5-YDi5c_DJWhCMFg":{"text":"Decent little spot that can get extremely busy.  Food is decent but our waitress left a bi","useful":0,"cool":0},"dhTHs_Tre0ohdVvbmNGyww":{"text":"Ended up here for brunch after realizing Jimmy J's was beyond crowded. Put our name down h","useful":1,"cool":0},"j-9-MswcMuApy__gxP39uA":{"text":"Went at night and the service was slow. Waited outside to be seated, waited for water, and","useful":0,"cool":0},"cifVVBdEHD9zcno60_E-jw":{"text":"Love this place for late night, wait staff is SO SWEET! Jazz is our girl and she is the be","useful":0,"cool":0},"Ix9ihnL_FxO0Sn8cAKg0Cw":{"text":"This place is only for the convenience of it being 24hrs and for the crowd that's feeding ","useful":0,"cool":0},"pTbiPnKDVrVuNcJiTAbMsA":{"text":"Late dinner at Daisy Dukes before heading to Buorbon St for drinks. We had the Raw oysters","useful":0,"cool":0},"TjHmZfFjNyN7-lb9E-48yQ":{"text":"Casual setting with very friendly and helpful server, whose name was Tiffany (I think??)  ","useful":0,"cool":1},"sYtbLVsjbN_eKUa2TxzjsQ":{"text":"Wait staff was awesome!!! Service was wonderful and took loads of pictures of our group! G","useful":0,"cool":0},"kWivCOpzkKCpnUZgScIEhQ":{"text":"I went to the area looking for a rest. called Oriente de venezuela but it was closed so i ","useful":0,"cool":0},"uK-z9fLqwkax1IeQBh3y0A":{"text":"Plenty of food. Very reasonable priced. Wait staff was great. Had the breakfast. Food was ","useful":0,"cool":0},"KpZXtgirKz0ZYzDNAW0Lrg":{"text":"Went here on the recommendation of the front desk staff at our hotel. This is where she an","useful":4,"cool":0},"U5pW5iuYdB_8NxEopCnpqQ":{"text":"I am so happy we ended up here. Next door at Jimmy J's people were rude and outside people","useful":0,"cool":0},"UpXhQT2npida3bPH-t_CGw":{"text":"We were recommended this place by our hotel staff and it lived up to the hype. Be aware, p","useful":0,"cool":0},"Btt01r6XtcQ237nKX8HQrA":{"text":"Good food, got lucky with no wait, great service and relaxing atmosphere! Bottomless Blood","useful":1,"cool":0},"jz6DogLshUPRWPcjcdB_0Q":{"text":"Stumbled upon restaurant standing in line to Jimmy J's Cafe. However it's extremely hot ou","useful":0,"cool":0},"2qb6V4zmBnHjcTm6lXKp2Q":{"text":"Ran down here to order take out.  I ordered a hurricane while I waited.  We got the shrimp","useful":0,"cool":0},"dUJQHvmZXvmRF-lncBwFqg":{"text":"Open 24 hours . I haven't had anything but omlettes  and hash browns . Not bad as I was st","useful":0,"cool":0},"CSCH5rAzT1VZaEgLA4O0kw":{"text":"Amazing staff. Great food and drinks! Recommend this place for breakfast and brunch!!!","useful":0,"cool":0},"uR-_8JLj0rZCWSqMqOdoxA":{"text":"As a guy from southen california  and little knowledge of nola food scene tis place was am","useful":2,"cool":2},"Yj6hQca7QfgFz5TZOsSNPg":{"text":"Came from Illinois for Mardis Gras. It was very rainy outside.  After dinner we walked 20 ","useful":0,"cool":0},"jza5_AqmrM5ZOkxoo3yN8Q":{"text":"Ok but not amazing. My travel group and I came to Daisy Dukes to grab a bite to eat becaus","useful":1,"cool":1},"W7FyN2oIfeXZUGJFwRH7XA":{"text":"We came in here on Thursday night/ Friday morning. All I can say is our waitress was Rude.","useful":2,"cool":0},"0wBdz3RnMxKnkvpPIrwBKg":{"text":"This was perfect for our early afternoon, morning after brunch. We had originally intended","useful":1,"cool":0},"nMTG51kbY2jBcDqu8CY2jA":{"text":"Been there twice and the food is always good! They serve the food quickly as well and is o","useful":0,"cool":0},"cmggzWrQ2HNImcTo11qrdw":{"text":"The gumbo here is full of meat and very tasty. Just spicy enough with no burn. Blackened a","useful":0,"cool":0},"QpoggvLCN1uJ9JNlij06cw":{"text":"Ordered delivery to our hotel. Took 45 minutes. The food was cold and horrible. Shrimp pob","useful":0,"cool":0},"tFjyBbjMOaRH_ORowJ04Cw":{"text":"My husband and I went for dinner tonight,  we saw a mouse run across the floor, when we ad","useful":1,"cool":1},"VBucI8avfkr2DQTnVcawiA":{"text":"For a late night place this will do. Better than the average diner but don't expect five s","useful":0,"cool":0},"sQs1PMJsX8UPy5oeL0UPoA":{"text":"Breakfast was great.  Service wonderful.  Really liked the help.  Sonia was super friendly","useful":0,"cool":0},"aEDrjD-jPK860F-IaVsSpw":{"text":"Went to eat after parade. I had breakfast food and it was great. Super friendly staff.","useful":0,"cool":0},"_J9xcIJ4yIhsqbnb5sCdOw":{"text":"We really enjoyed this place.  We had omelettes, biscuits and gravy, seafood poboys, and p","useful":1,"cool":0},"6JYfH9fbM2ANxNVENTpDLA":{"text":"If I learned one thing about going to NOLA with a big group, it's to make reservations. We","useful":0,"cool":0},"Tb0n5Mohuv9CG9CtLCwq1g":{"text":"Good burger for decent price. Around the corner from Hilton Garden Inn French Quarter.","useful":0,"cool":0},"VOs0PSf9wIA_mbqe1kCSZw":{"text":"Yummy everything. Biscuits and gravy outstanding. BOGO Mimosas which they make in a beer g","useful":0,"cool":0},"rxsndXe2O8zJgB_fJVse1Q":{"text":"Nothing special...Definitely nothing special. In town for the first time, yelp it/googled ","useful":0,"cool":0},"WZzQ8DFipphYqrIg-7rGWA":{"text":"I love the omelet selection here. Big! Very cheesy, fun filling variety, fave is seafood. ","useful":0,"cool":0},"GsoR-2GHSyhwL1dwHiPh7g":{"text":"Good Lord, all kinds of uneventful. I come here about once a year when I've forgotten how ","useful":1,"cool":0},"u8_Jn5XXQBHCGvPrTw0SYg":{"text":"Small but good fast food... If you get here before 9am you get a BIG BREAKFAST for $3.99..","useful":0,"cool":0},"Hw_uQLMHQc7E4xIzlu0H7g":{"text":"This was one of the worst restaurant experiences I have had in NOLA.  Almost, well to the ","useful":0,"cool":0},"DR38Bg2D9fF1DZtF1gfwZw":{"text":"Awesome!! A little hole in the wall but usually the best food in town. Party of 10 with fa","useful":0,"cool":0},"7_O58YelEys0KPnNTcYKYg":{"text":"On the plus side, it was open 24 hrs and we could bring our kid when we needed a late meal","useful":0,"cool":0},"i-Fq1r8tJmOjow6ZP5UlLw":{"text":"This is a great option if you're staying at the Marriott and need a quick place to grab br","useful":2,"cool":1},"dsRSaqqJCShKUafsBJt2UA":{"text":"Good breakfast. Egg white omelette cooked perfectly. Grits were not as creamy as I like bu","useful":0,"cool":0},"VuBflhb7eq3yBQ_lwaz0XA":{"text":"Some mornings I wake up very early for no reason and go to Daisy Dukes for breakfast.  The","useful":1,"cool":1},"KbmiLiXVLcjWPIXv4XP_fA":{"text":"Over Rated\n\nA lot of folks like this place, so we gave it a try for brunch. Should have go","useful":0,"cool":0},"wKo6MWRZn64UdpzaHLUSlg":{"text":"Early bird special is a steal! For under $5 you get a standard breakfast that's cooked wel","useful":0,"cool":0},"VjHtgWYuRPzc_x4xi6U1DA":{"text":"went there on christmas day (12/25/12).  there was a line, but it didn't take too long to ","useful":0,"cool":0},"VlHDQwlQMQfa37FdlL2F2g":{"text":"This place was better than I expected. My fiancee had the ribeye and eggs with pancakes on","useful":0,"cool":0},"fccOK_l692Lq9pnq67J-Qg":{"text":"We were actually headed to breakfast at a place nearby and the line had us scared. I proba","useful":0,"cool":0},"_lm1RB85pGPixPgzvZ9-xQ":{"text":"TOURIST TRAP. Everything is ridiculously over priced, especially because of the location. ","useful":0,"cool":0},"fFFLYFuI-y6Aw4v75lKvlQ":{"text":"disappointing my food came out 20 minutes after the rest of my party had finished theirs, ","useful":0,"cool":0},"u67v0bc_LTZdcVo7OPinWA":{"text":"This place was around the corner from our hotel. I went there for breakfast and the pancak","useful":0,"cool":0},"DAOv9gxhdPJ5ZQ5gnVOlTA":{"text":"This place is perfect. Good prices, great food, and even better drinks!\n\nAmber is certainl","useful":3,"cool":3},"kkaPshmQKGecFOwq71p26Q":{"text":"My first meal in NOLA was breakfast at Daisy Dukes...actually, this was my first time visi","useful":0,"cool":1},"QJfEhcACuw-kVhKd7CZoHQ":{"text":"I don't understand how this restaurant has so many stars. My friends and I ate here this p","useful":3,"cool":0},"F9jgE7hY3tCAatvF9ChNzQ":{"text":"We were looking for a nicer place for dinner.  We were very hungry and got tired of lookin","useful":2,"cool":2},"rhQkSnS0OIdLIl4XWUNO7A":{"text":"Crawfish $10/lb... pricey and not the best. Go to Big Fisherman Seafood on Magazine St ins","useful":2,"cool":0},"7Bfv_8m7Cb-CAjVlxbugvw":{"text":"Definitely has the look of a dive bar but it was just a few steps from my hotel and the go","useful":0,"cool":0},"afID63URdrjHS28ynmL67Q":{"text":"Several days later, I actually came back here with a large party and ordered the filet mig","useful":2,"cool":1},"QxHq_ZJu924TQeOu8smV2w":{"text":"This was the worst food I've ever had in New Orleans. Ordered the lemon pepper chicken win","useful":0,"cool":0},"DBew1YqQtSeQpUFEmDNWuQ":{"text":"Great food, great service. We were originally supposed to dine next door at \"Jimmy J's Caf","useful":1,"cool":0},"WQWQqU7ed0GszC_5BFZEzQ":{"text":"Food was just ok when I visited on 3/14/17. Gumbo was lukewarm. My 1 star rating is due to","useful":0,"cool":0},"zDf7qikO4rzQwpqTNUviDQ":{"text":"A great late night post Bourbon St place to eat. I went to NOLA for a bachelor party with ","useful":1,"cool":0},"4XRDHTW1-yGcpJGvumgr8g":{"text":"Quick service and reasonably priced.  We had breakfast and it was good.  This restaurant i","useful":0,"cool":0},"CbISYyBJvY925BsBK9iYyw":{"text":"This place is good at 8 am, 1 pm, 10 pm....the gumbo was surprisingly very good and the Ca","useful":1,"cool":0},"-0ADdOoVnfwmtdUjGX8KxQ":{"text":"NOT impressed, looking for some good creole dishes, I had the sampler and the gumbo did no","useful":0,"cool":0},"snIetQX1mUnPIOzEXswqjQ":{"text":"The server was very pleasant. Through no fault of the server, the eggs and hash brown were","useful":0,"cool":0},"FMKaha04N3joj_cxFNFC_A":{"text":"After leaving 2 other places for various reasons (one extremely rude waitress, and a menu ","useful":0,"cool":0},"u9j00RAwTW7jw20PbHy65A":{"text":"Service was horrible; took a long time to be seated, given menus and orders taken.. I shou","useful":0,"cool":0},"0HJ3FXu3SBBwR_3uAoX3yg":{"text":"Breakfast was good. Scrambled eggs with cheese, hasbrowns and toast. Nothing to write home","useful":0,"cool":0},"jMf7f32O29q9gRiPPr_KqA":{"text":"Love this delicious food and the GREAT customer service here. Traveling and finding someth","useful":0,"cool":0},"PxJ5vv5WoOfE7PiUf-xP1w":{"text":"I had ordered the chicken finger platter, I got my tenders dipped in the daisy sauce.  And","useful":0,"cool":0},"QI0qEa4d5gHm4LEjpMAKWQ":{"text":"Was in a hurry to get to airport, so I stopped at Dausy Dukes for a quick bite.\nHad a frie","useful":0,"cool":0},"VOmW9ttYZ5u890utrSTU9g":{"text":"A nice alternative to the fast food chains on Canal St. and some other expensive options. ","useful":1,"cool":0},"W5Opou3hBW9oPGV4I4OGXA":{"text":"Good quality food at a very reasonable price! Highly recommend the Double D burger. The ha","useful":3,"cool":3},"3asC3un5OunZbfsxK4gKPA":{"text":"Best gumbo I've had the entire weekend trip there. Even tried to see if we could go back b","useful":0,"cool":0},"f65Kp_3D1v0AEAZ54HBVAg":{"text":"I went in for a late night meal and wasn't overly impressed with the jambalaya. Nothing sp","useful":0,"cool":0},"kiuomz2MCdcYIcJzdCo2Nw":{"text":"This restaurant is GREAT!  The food is good and the service is awesome.  The servers are a","useful":0,"cool":0},"MHUF9Ki-0SudM0PRJaYmhA":{"text":"Bisquits were hard. Sausage was dry and crunchy. We have been here on other trips so we we","useful":0,"cool":0},"6xYaqwYHoZsf4GH1rgOtrA":{"text":"Great little place to grab a po'boy and some hand dipped onion rings.  Friendly wait staff","useful":0,"cool":0},"qxD9VrPppxLzepgTW4aqGA":{"text":"I love that it is open 24 hours! The gals were nice but one gentlemen in particular was bo","useful":2,"cool":0},"96BemnMgChp_PBzIp96C1g":{"text":"Stopped in Daisy dukes because streetcar cafe was closed down they would have never surviv","useful":1,"cool":1},"P3Le4fJvjNI-4Em6IWMD0A":{"text":"Wasn't the best.  Po boy wasn't great, wings were ok and the  craw fish boil was  meh.","useful":0,"cool":0},"X5Ll8wzKomijR7cTeeMcKg":{"text":"Came in late at night and the food was ok. Nothing to rave about, but it was open and agre","useful":0,"cool":0},"rlN8vGE5a29hjQTnS7rUhw":{"text":"We stubble onto to place and we were happy. The bacon and sausage was juicy. Great for and","useful":1,"cool":0},"eqd4ptdAMoOz_C3n_LcNEg":{"text":"Some of the best fried seafood in the Quarter. The breading actually has taste instead of ","useful":2,"cool":2},"YdkiLTZk88kNhGDoKXPudw":{"text":"Food was pretty bland. I ordered the seafood omelette and had to add a lot of hot sauce to","useful":0,"cool":0},"PNQWLrBP9LnZQELaDWM-aA":{"text":"From the outside it looks a little bit like a whole in the wall place but it's my favorite","useful":1,"cool":1},"k0rJREj0hXDXSPagkRSiPw":{"text":"BEST IN NEW ORLEANS!  Passed the location trying to get to recommended restaurants. What a","useful":1,"cool":1},"WvSdZFg7zeXbZxdXm-lI4w":{"text":"Went for breakfast.  Service was slow but no fault of the servers.  Our server was kind, k","useful":0,"cool":0},"QWyJLiCp-3FMNzlrTHfbig":{"text":"Ordered late night delivery and it was quick and comfort food galore.  The fried shrimp we","useful":0,"cool":0},"i3Vs_zMsHEfMCYZuEFy3MQ":{"text":"They have one thing going for them. And that is that they are open 24/7. Their hostess and","useful":1,"cool":1},"qdiD4YOYdiOWLH7OGFZx4Q":{"text":"I had a terrible shrimp po boy here.  This is the Applebee's of NO restaurants.","useful":0,"cool":0},"tbSC8KQU5YPBAdJmXGpQlA":{"text":"I'm giving them one star, simply for the fact that they will not separate your party's che","useful":0,"cool":0},"bEmCXDDUFnXybv8XIMXX-Q":{"text":"I didn't know I wanted crawfish for breakfast with my pancakes, but I did. I really did. A","useful":2,"cool":1},"Qbv0BY_cHV8TO8e10Gq7dw":{"text":"I had breakfast last week when we were on vacation in NOLA. The service and the food was o","useful":0,"cool":0},"s-QhvJupnDW24HazFOo7iw":{"text":"The food is good..but WTF..DUDE. this location bites ass major ass..it's small  it dingy a","useful":0,"cool":0},"mIm-Q84GLI-mWv_V4i-Xbg":{"text":"This place is just eww. Even drunk I didnt enjoy this. The waiter ignored us. We were not ","useful":0,"cool":0},"BGSbUmBeHP9GdV33WgRr5g":{"text":"Cheap breakfast if you wake up on time to get it. Actually really cheap. The bloody mary i","useful":0,"cool":0},"0aHovtIf9HEm9WbfdF8fPg":{"text":".food was well done- but Bloody Mary was a little off- sorry that is what I had to knock y","useful":0,"cool":0},"Qr6e7cxwExVU5DfpaRe1Tg":{"text":"Worst restaurant in NOLA.  I was in NOLA on vacation for a couple days and this was the wo","useful":1,"cool":1},"DBjemI_VjBzFi9la7WfKqg":{"text":"Cajon alligator omelette was the bomb!!! Good cheese grits! Unlimited Bloody Mary's and th","useful":0,"cool":0},"3T8OIusp7BCDO8aKXOrcHQ":{"text":"No wait and great service. Lots of options on the menu. Prices food and food OK. The biscu","useful":0,"cool":0},"U_zQ2FgHntTSeyTXAsu-BQ":{"text":"My husband and I visited new orleans this past weekend 2/5-2/8. Our first night in, we wan","useful":1,"cool":0},"QcFmXc0dlBEpXdwafCKL8A":{"text":"Really nothing special about this diner other than its open 24 hours. Seafood Gumbo had go","useful":0,"cool":0},"QJmdCWXnHMAsJ3gpBAkW_g":{"text":"Pretty much everything around these area are the same price, though this particular place ","useful":3,"cool":4},"2QSwO2yk3R0zTrqmaFbkYA":{"text":"Great bargain.  The bottomless Bloody Mary is indeed very good, and presented like a salad","useful":2,"cool":1},"cRufgRk_WhGqJt55AeJZQg":{"text":"We first went in because it was across from our hotel. I'm so glad we did. \nThe staff here","useful":1,"cool":1},"LOsiGs_Gg_wO0_RshiF-bw":{"text":"Best BLOODY MARY ever! Can't wait to visit NOLA again with my husband. Time of my life but","useful":2,"cool":2},"G6dYRFV4tGiq4tGo4V629A":{"text":"Best breakfast deal in town. In the mornings there is an early bird special that runs arou","useful":1,"cool":1},"eJXIRnv4PW54OeZdcDAWKA":{"text":"Price gets four stars, but everything else gets one. The food was FINE. Nothing special. W","useful":3,"cool":1},"olC6lx7R8-v2ucxhw_w_bw":{"text":"Good late night eats!  It was the closest restaurant to our hotel that was open at 3am... ","useful":2,"cool":0},"lT1alJ0wFHq5zgt1fzTdfA":{"text":"Stopped in for a late night dinner after the Saints game. \n\nI got a Greek salad and Gyro. ","useful":1,"cool":0},"sXa9wOjmBnf8wSSXiHfhzQ":{"text":"Posting my trip advisor reviews this review is from March 2012\n\nThis is a hole in the wall","useful":1,"cool":0},"VhUM_odQtTiruUxvzsh6uw":{"text":"The server was sweet but the service here is ridiculously slow. It took almost 40 minutes ","useful":0,"cool":0},"MpFKCNs3YGwYvh74TIcLwQ":{"text":"I stopped in here mainly for the Bloody Mary. It was presented nicely with pickled okra, o","useful":0,"cool":0},"zHLs2oJCTZCMjY8c1xqbJg":{"text":"OMG!! Breakfast All Day! \nFree Bloody Mary Refills! I'm thrilled, Cajun style! Great and s","useful":0,"cool":0},"wS-fnX9GEJcHLNKz6-nPsA":{"text":"I like this little cozy restaurant. My server was sassy (in a good way) and I loved it, ma","useful":0,"cool":0},"6hcZmzEX_InMXRf2lWZnBA":{"text":"Finally some food in NOLA with some of that southern flavor, So far on this trip I've been","useful":0,"cool":0},"iBw4V3mfcuYbs2JoODEi5Q":{"text":"The service was great. Super fast and friendly. The food was awesome. My husband had black","useful":2,"cool":2},"hBdCnfO3lK5qwGaSDw1_wA":{"text":"Great Early Bird Special.   The price was right, the seating was fast and our order taken ","useful":0,"cool":0},"EqoZg1y2UvgL_R5Si2C8QA":{"text":"Absolutely love this place! Conveniently open 24 hrs and was SO good. I had the catfish pl","useful":0,"cool":0},"JF99W8y5n-457roQawbxLQ":{"text":"Used a deal from Groupon. We ordered crawfish, oysters and a sweet tea (alcoholic). Oyster","useful":2,"cool":1},"-geUxPYckYrfOvgjhWZoaA":{"text":"Went there yesterday while it was dead, just 4 to 5 people and i had the shrimp po boy and","useful":0,"cool":0},"XlRMOHw7iMuI9I2xTnapGA":{"text":"Stopped in to get an omelette before going to the airport.  Really good food, staff was pr","useful":0,"cool":0},"--QTTnyzGZG-sgdOybfDmg":{"text":"This is our go to place after partying on bourbon street. It's open 24 hours and food is d","useful":0,"cool":0},"b5R5DgIAKmdc2OIu7ovE_w":{"text":"We came here and had a basic breakfast. Nothing was too special about this place. But noth","useful":0,"cool":1},"tUl1EtwV5Bj6o45JyKm8lg":{"text":"Not much to say -- they were open on Christmas when my family's flight got in late, so thi","useful":0,"cool":0},"TKNsC3Tbi4LQjwRNVsmuag":{"text":"Checked out this spot late night on our first night in New Orleans and it did not disappoi","useful":0,"cool":0},"xyZTWp4Ef14j-dxX6PuVDw":{"text":"Pros:\n- It is 24x7 and it opens on Christmas eve and Christmas day\n- They serve beer\n\nCon:","useful":0,"cool":0},"qG2S5e7TXIvOWFvYY5-bdQ":{"text":"What can I say bottomless bloody mary's \nAlso good food at great prices for nola \nWould de","useful":0,"cool":0},"gDZqLeHMk9me2HvqBondAg":{"text":"The line was long, and didn't move fast, likely because people were inside enjoying their ","useful":1,"cool":1},"aviMPmI78vuGGBnHvh6ZXg":{"text":"We actually ate here twice, the second time being a drunk quest for midnight snacks.(More ","useful":1,"cool":1},"e3JOrHJxYem3BqKwAM_PWQ":{"text":"This food can only be enjoyed while intoxicated. Definitely not for a sober palate. I was ","useful":0,"cool":0},"FUmf3cKpknJ0IkjGZLwFcg":{"text":"Seriously surprising burgers.  They were pretty dang good! The red beans and rice was very","useful":1,"cool":1},"Ob-41bQjg84AFTcAHgAJaw":{"text":"This place is an ass kicker. Chicken fried steak is the BOMB!  The daisy burger is the SUP","useful":0,"cool":0},"3G1Iy953z9kz0ZOmx_LLng":{"text":"For my first trip to New Orleans, I was SO impressed by Daisy Dukes. It may seem like a li","useful":0,"cool":0},"N2IrqwlBcu1AykZxTnbvlA":{"text":"Attempted to place a delivery order.  The individual  who was supposed to take tge order h","useful":0,"cool":0},"ATaf-uqkXM5iFAqAlI-Hog":{"text":"Service was ok, server wasn't very attentive and it wasn't very busy either. My meal came ","useful":0,"cool":0},"Egx3rq4pfvq1jmafTxdH_w":{"text":"These employees are not on southern time. They will acknowledge you immediately, and your ","useful":4,"cool":2},"4whtVgaNb0l-iWxnRRo9Jg":{"text":"Yuck!  We went here because of the 3.5 stars on Yelp and were so disappointed.  We both or","useful":0,"cool":0},"V40PFHfZIXW3mmDhxTKsJA":{"text":"Food was decent. Nothing amazing. \n\nDisastrous service. It took me an hour and 20 minutes ","useful":0,"cool":0},"xy73dBwqZ_Ppz5_rysDPVg":{"text":"Awesome place. Great food and we had a great server! Small and simple but good food. My Bl","useful":0,"cool":0},"wPEf9NW1eAZbHXPyg5rwgA":{"text":"We should have known better based on other Yelp recommendations but I was dying for some c","useful":1,"cool":0},"GLe2YPKK-8xBp8KWftvEuQ":{"text":"I was recommended this restaurant by a local from another restaurant and thought it would ","useful":0,"cool":0},"QDH0R1S71sIR9Srm_-KwHw":{"text":"Trecked through a storm with flood warnings to try the amazing bottomless Bloody Mary serv","useful":0,"cool":0},"WQg2Z-LKk55prdF7TsMzkA":{"text":"They don't call me the queen of awkward moments for nada...\n\nSo, I recommended this place ","useful":4,"cool":2},"PNj0y-L112U0kkT5qJK_kw":{"text":"Solid though unspectacular breakfast. We landed here in search of a more traditional break","useful":0,"cool":0},"ZPYBXsKL_r8LOKf6F-Du_Q":{"text":"It's a greasy spoon coffee shop type of establishment that you wouldn't patronize if it we","useful":0,"cool":0},"Yput27ifg7_GI_UDZ9vgaw":{"text":"The place is OK with the exception of its Gumbo...  The Gumbo here is arguably the best in","useful":1,"cool":0},"jsq7A8-fNsFjnvc2Z0hEgQ":{"text":"The food and service here was great. I ordered the bowl of crawfish etoufee and it was a g","useful":0,"cool":0},"IYBvKUieuEDvebD_w48T-A":{"text":"Right around the corner for our hotel (Astor Crowne Plaza). Ordered the red beans & rice a","useful":0,"cool":0},"1Bfax9IeMT1x0mChcD9-GA":{"text":"My husband and I went here at one in the morning and got a shrimp Po boy and a cheeseburge","useful":0,"cool":0},"G9RZeKYcQZVeRpMdDFQmBA":{"text":"It was ok you can get bigger crawfish elsewhere! My husband got a bottomless Bloody Mary t","useful":0,"cool":0},"YAa07Sl5HMruWOIngfRbCQ":{"text":"Stopped in here for breakfast this morning and it was very good.  Service was great.","useful":0,"cool":0},"bcojGD5nAxfIlA65lTC0QA":{"text":"Went here for some late night eats. We eat family-style so I didn't personally order all t","useful":1,"cool":2},"pgWV3FDyiwx2HnLF9nWCQg":{"text":"Awful service.  Couldn't get simple orders right to save their life. Food was horrible too","useful":0,"cool":0},"REtD0hEeY-3XoAXMxei8PA":{"text":"The service was great and attentive.  It was 1 in the morning.  The best fried green tomat","useful":0,"cool":0},"tYuLUh2mvADkqkOUc8Dqiw":{"text":"Our server was good. Service was quick. The food was mediocre. The shrimp in the seafood o","useful":0,"cool":0},"Zu5aFeWOn1kYK_b6rEj28w":{"text":"Don't let the name fool you. There are no half dressed waitresses slingin' jambalaya and g","useful":3,"cool":2},"dX5LUAn-0LF4OSv167K21A":{"text":"Great little spot at the edge of French quarter.  The prices were average for the area, bu","useful":0,"cool":0},"45QmX-cI2zb6tTSP2QaMhg":{"text":"Daisy Dukes was a pleasant surprise on my recent visit to New Orleans.  We had a group of ","useful":3,"cool":3},"4rkpBBoxIjVRf99rhooztA":{"text":"Tastes even better than it looks. The bloody Mary is great, the seafood omelet is great, t","useful":0,"cool":0},"CNtN2wZKu0hqQpmdmFy7Wg":{"text":"Good Food, Horrible service.\n\nThe Po Boy sandwich is HUGE and tasty, better than one we tr","useful":0,"cool":0},"7NtmuKJ1_7XaJjDCRvVwPw":{"text":"Came here to enjoy the $12.00 bottomless Blood Mary. It was very good and had just enough ","useful":0,"cool":0},"CwOEEONtGEQrNd1VORT95Q":{"text":"I was not too impressed with this place. It is very small and although the service was qui","useful":2,"cool":0},"HkdPKYi8R8ahhP0IlXxfkQ":{"text":"Daisy Dukes is a great place for breakfast - any time: 7:30 PM, 3:30 AM, or 9:10 AM (when ","useful":1,"cool":0},"VXCHk3M6fBPnL6ts_62F0g":{"text":"What a $hith0L3! Yet we enjoyed our quick snack and STRONG 2 for 1 drink deal. $8 bucks fo","useful":1,"cool":1},"xTOn-Ho5a9Cu89qyTki_uw":{"text":"Breakfast was perfect! Bloody Mary was amazing!! The service was fast! Conveniently  locat","useful":0,"cool":0},"iNz_ueOzb8TysqtPwZUnyA":{"text":"Great restaurant. Friendly service. Good food. Had the blackened catfish which was amazing","useful":0,"cool":0},"poqhj_Z4xaNiHtGQ7cu8oQ":{"text":"One of the best burgers I have ever had and they delivered to my hotel. Would be more star","useful":0,"cool":0},"ueVZulmdSusGWj6jkZCmtw":{"text":"First of all they are open 24hrs so that is a plus for me. I had the shrimp po boy with re","useful":0,"cool":0},"BdlaQ1-yTLKWu2Orsf1mMA":{"text":"We came here to get out of the rain and I had no idea what to get. The waitress suggested ","useful":0,"cool":0},"B35fZASh4D5mjdiixTnEaQ":{"text":"Last day went here for breakfast. Nothing to brag about. They had the worst grits out of t","useful":0,"cool":0},"8SB2w8o_TczelCYPMElj6g":{"text":"Smells gross, dirty inside, service was awful.  I get its right at the entrance to the qua","useful":1,"cool":0},"A4QOq_XRlOmcuwRQCMdeog":{"text":"This place is GREAT! Fast and attentive service (thanks Alicia)! Try the Bloody Mary, it r","useful":0,"cool":0},"LwLX1UG1oZo-QXDzqu38bQ":{"text":"The first place we were directed to by our hotel, food for everyone, whether you are in th","useful":0,"cool":0},"xQnW3QDA18fZc9_IVOIjWQ":{"text":"We went to Daisy Dukes on Christmas day around 11am. Many places were closed, and this was","useful":1,"cool":0},"0_FPFkBhrq-JwVELhksAVQ":{"text":"We ate at the location near the La Quinta on Camp St. It was great! The food was amazing, ","useful":0,"cool":0},"yzoX0zLHYZYbMt2bZGEffg":{"text":"Great diner at an excellent price.  24 hour breakfast is always a great option.  The award","useful":0,"cool":0},"jBqrn2pgeO73zQi6R-xX6w":{"text":"Bleh...I was in New Orleans for 3 nights and somehow managed to eat in this mediocre dive ","useful":0,"cool":0},"aLRtTZQ6knqAVwzjUlFTZw":{"text":"3.99 breakfast with the best bacon I've had so far in the quarter.  Excellent service at 5","useful":0,"cool":0},"amLiu1tDzpzLF8UMJPUwkw":{"text":"Get the bottomless bloody mary!! Food was ok, but the servers were quick and the drinks we","useful":0,"cool":0},"HVG0DaUmAtypYWLJM-9KAA":{"text":"mediocre food. rude waitress. long wait for no good reason. $130 5x person tab with 15% au","useful":0,"cool":0},"WRNd_KbE6OunwTKCoq_4vg":{"text":"Visited New Orleans for my boyfriends birthday. All the Cajun places we did try the gumbo,","useful":0,"cool":0},"Vim_ttaJbaHs95YKoTjbiQ":{"text":"The best at 2am. After a night going around bourbon street bars, Daisy Dukes had just what","useful":0,"cool":0},"T-v3LYt7pVvZvW4LnFwstw":{"text":"Aka drunk kids' friend - they're open 24/7 and are a few blocks down from Bourbon.\n\nVegeta","useful":0,"cool":1},"Ew_wfuUG8yA-8As8yxny1g":{"text":"The gator sausage Po Boy my wife ordered was delicious. I ordered the chicken philly... bi","useful":1,"cool":0},"nc7C82HwiAaoiyCGLLg4rA":{"text":"This place was just ok. Service was semi lacking, but the girls working were friendly  eno","useful":0,"cool":0},"NNNWS8Jimhdbq-KZaYtJsg":{"text":"This was like a hole in the wall spot. I expected more due to the reviews, but nothing was","useful":0,"cool":0},"UrBo9E5AjKAJPRah5sQY0Q":{"text":"DD has many locations through the city and this one is very close if you're staying in the","useful":0,"cool":0},"x9wVdrfA_yM0teaUXWlqqA":{"text":"The food is very so so and the service is horrible. The best thing about Daisy Dukes is th","useful":0,"cool":0},"v-Jn-jbyPd4Gpt5TnatPFQ":{"text":"Probably the worst breakfast I've ever had. The restaurant was not busy at all, but the se","useful":0,"cool":0},"0w5XGQ8nwe4yyooUhHxrJw":{"text":"Food was delicious but the service was just okay.  Girls don't wear Daisy Dukes.  I asked ","useful":0,"cool":0},"9n7phe8-MOBwzIHxCTzfyw":{"text":"Nice little restaurant within walking distance from Saenger Theater. Good Louisiana food a","useful":0,"cool":0},"PxSH7u-DPNxy5zLGQy65DA":{"text":"I loved it here even during maradi grasi service was great!! Ppl should totally go during ","useful":0,"cool":0},"bzofGIiQmfHC5u_PGbwFSQ":{"text":"Great for what it is -- a 24-hour dive! I'd been in New Orleans two days for a conference ","useful":1,"cool":0},"eSjW9CUuX264tddRFMVpZQ":{"text":"Drunk? 4 am? Starving? Well this place hit the spot perfectly. Fair prices I believe sine ","useful":5,"cool":5},"4GOmahIA63uTY7g0p9dQvQ":{"text":"Great breakfast, will definitely go back! Was off the beaten path and and you would miss i","useful":0,"cool":0},"KRkopAn8F6TTSIv_wqAseA":{"text":"We arrived in Nola around 8:00pm after a 13hr drive and wanted a quick meal!  This place w","useful":0,"cool":0},"ff9tPSbktwVyByRUJzYQjg":{"text":"For a city known for their food, I came here with the intent of seeing what all the hype a","useful":0,"cool":0},"gBsxxa4QslxvNNg2s0c4Tg":{"text":"Crazy long awaiting time,  even during  not busy night. At least 30 min just for the simpl","useful":0,"cool":0},"q9Bes2TFvrbUPclfjjs3fw":{"text":"I ordered the half/half Po Boy (half shrimp half oyster) on the recommendation of the bell","useful":1,"cool":1},"pk9cf6f75wER8HDsFdVf4A":{"text":"Only ate breakfast here but did so several times during my stay.  Omelet is delicious.  Ha","useful":0,"cool":0},"WQZsiFkHChbLivTb46fnUQ":{"text":"I loved the New Orleans sampler and the bloody Mary's.  this place rocks.  Food is reasona","useful":0,"cool":0},"bFYGcGG4pZRjbr_olZHHyQ":{"text":"ehhh... was so so.","useful":0,"cool":0},"7dKfBnxMp4Ykn4hX9Dp_HQ":{"text":"Alligator Po-Boy, large in size and in taste. Although not fried alligator as i had blindl","useful":0,"cool":0},"O8LLv95h4Jyhj0gABIFFWQ":{"text":"Seafood omelet was pretty good hash browns could have been a little crisper but overall gr","useful":0,"cool":0},"D-My5yhkF-PAYobWYcCltA":{"text":"Eggs were not very fresh, fruit cup was a couple of sad, shriveled strawberries and a brow","useful":0,"cool":0},"qvT9X3EQdqdEOsWPRLBRPA":{"text":"Went here for breakfast once...once. Really bland grits - one crawfish tail in my seafood ","useful":1,"cool":0},"Q968d6M0B2uCEM96xdndjw":{"text":"I think the ratings for this place direcly correlate to the reviewers alcohol intake and t","useful":1,"cool":0},"3gQG8oJvOqtL6eOUBBbTQg":{"text":"The food was alright, the waitress was sweet and helpful. My husband loved the alligator s","useful":0,"cool":0},"mldcNfhJcyr9NNuqd2FeZw":{"text":"Went here for breakfast and really enjoyed it. Relaxed atmosphere, great prices & friendly","useful":0,"cool":0},"pTIXv1mGi8-gQIv0auTJhA":{"text":"Yet again, Daisy's was our first stop for food in the quarter, and not because we have bee","useful":2,"cool":0},"VxqJg07GhZrvrg2C86FUHA":{"text":"My,husband and I had just 4 hours to enjoy new orleans. We Ate here and LOVED the sampler ","useful":0,"cool":0},"bGvTqtyMNjvGYJMVXxIr1A":{"text":"AMAZING!! Fast service, delicious food, courteous staff from the hostess to the waitress. ","useful":0,"cool":0},"hKBMpvPu1BaIIA84gClrmg":{"text":"There is nothing fancy about this restaurant, great breakfast spot, food was hot fresh and","useful":0,"cool":0},"n82rZoskr9yWrY5RoNi-Qg":{"text":"Right next to the Mariott the breakfast was fantastic good classic southern food with a un","useful":0,"cool":0},"-WqM9Ym43bGkxALrqdpLPg":{"text":"Hubby and I stopped in in the middle of Mardi Gras madness, and we walked away satiated. I","useful":0,"cool":0},"oWTBPSUg5NX5apx9KuBSrQ":{"text":"Part of a group of 10 that stopped in for breakfast this morning.  Organized,clean, great ","useful":0,"cool":0},"L5sTqwlAh7bf9CZG9LpPbg":{"text":"I did not want to go here but my boyfriend wasn't feeling adventurous like me so daisy duk","useful":0,"cool":0},"AUjDA8SPhRcbY29yr9sNdA":{"text":"They were fast and friendly and divey - it was a good brunch for an acceptable price.","useful":0,"cool":0},"4F-oy_ImccwFWv0cLN6siA":{"text":"This is a sloppy seconds choice for breakfast. If there is a line outside, it's not for th","useful":1,"cool":0},"bE7k5vNtJI8_uWWlJSORFA":{"text":"No. Just no! Don't go here! The staff couldn't answer any questions upon ordering. \nThe fo","useful":2,"cool":1},"2FcvF7OCm9TZzbqQGGU3EQ":{"text":"This is the place for great early or late dining.(or delivery) Wings are great and the sea","useful":1,"cool":0},"4_6OvDa29637brB2CteUWw":{"text":"For a place that seems to be always packed, they do a great job getting people in/out. I'm","useful":0,"cool":0},"E5N0Fn4kpBmAokVsLkUNRg":{"text":"This place is located directly behind the Marriott Hotel.  We had breakfast there and orde","useful":2,"cool":2},"7cjWZqG51ZUnd8T5pBIEYA":{"text":"The food was good. It was freshly prepared & served steaming hot. My issue was with the re","useful":0,"cool":0},"HCLSWwOZy1oyKumMjgOEeQ":{"text":"Daisy Dukes has the worst breakfast I've ever had. First, off when I tried to pour some pe","useful":1,"cool":0},"DsTHZVzMOcRQHh97kLpceg":{"text":"After wandering in the FQ all night, you inevitably need some food to sustain you (or sobe","useful":5,"cool":3},"xX0WOh9Gujxgh0y34hv39w":{"text":"Driving into New Orleans - in the middle of a rainstorm--- super late from CA - accompanie","useful":0,"cool":0},"2UMTXUesp5UJHH9aVUmH7A":{"text":"Food was way too spicy and I normally like spicy food but I couldn't even eat this.  The g","useful":1,"cool":0},"677ZrEakX30PtSzSnnPz0g":{"text":"** Breakfast Review **\n\nNew Years Day - Had about a 20 minute wait during which one of the","useful":1,"cool":0},"9_rX1u2np1aXjkrEtVq3Rg":{"text":"24/7 restaurant in the French Quarter with great Cajun Food! Every time I'm in town I stop","useful":0,"cool":0},"nr5Lfqpc0aNIju2x-yuExQ":{"text":"Great little place place lots of tv's. Apps came out quick  and seemed fresh. Grilled shri","useful":0,"cool":0},"zb6_c3b9ftnFt87df8pP-g":{"text":"I asked a cop on a horse for a good jambalaya recommendation.  He told me to come here. \n\n","useful":0,"cool":0},"p07bDqQ-mCyv7I0z_NlUfQ":{"text":"Ate here twice, excellent both times. My only knock was the gumbo, tasted a little burnt. ","useful":0,"cool":0},"ps_q3Kw7E0pzslIhu0o5Og":{"text":"We were in NOLA for a wedding recently, and some fellow wedding guests told us about Daisy","useful":1,"cool":1},"6rPZY8TAfdtp8EhEDx3hTw":{"text":"Wings were terrific, gumbo was so-so, although I am no gumbo expert. It was served room te","useful":0,"cool":0},"SVXW0pV7iEW3K8EKtaYZgw":{"text":"Coming from Chicago we definitely wanted the New Orleans food experience so we asked aroun","useful":0,"cool":0},"jejYoboxvhp-i8HBG4VUBQ":{"text":"Great breakfast stop.....open 24 hrs. so you got plenty of time to stop on in.   We sat in","useful":1,"cool":0},"PYeoyW0W7ZDagKHWf-GQjQ":{"text":"Food here is amazing,  ASK FOR AMY, Amy is FANTASTIC! Delicious crab cakes (came back 3 ti","useful":0,"cool":0},"o5tNxHK-viCaN3KPVheHGw":{"text":"Wasn't too busy when we came in around 1030am, which we thought was good. We were promptly","useful":0,"cool":0},"Z-4U3L8hThnOINc2re94HA":{"text":"Being in the French Quarter, at 10 pm, looking for food, during some parade is nuts.  We w","useful":0,"cool":0},"iG1w6spOAVH-0ye9x9a4Yg":{"text":"I'm from Baltimore, here on a business trip. Decided to come here for lunch. Food is pheno","useful":1,"cool":0},"CM7rtgX-j8LSEAVG9XfKPA":{"text":"Daisy Dukes serves decent food. My table ordered the bloody Mary's (buy one get one free),","useful":0,"cool":0},"0zKrz6JpFfkZnE2tN4HNGA":{"text":"Daisy Dukes has great craw-fish.  Other food served there is just ok.  Check yelp before y","useful":0,"cool":0},"DDFxZt9Mo2tR-cDM-i411w":{"text":"The best gumbo I had on my long weekend in New Orleans and that's saying alot cuz I ordere","useful":0,"cool":0},"1UDorexLd0hoYFLhjxaMfA":{"text":"Luv this place! Gumbo is perfect! Only drawback is the cup is not a sufficient serving for","useful":0,"cool":0},"s0SvzyjrpBDI5xSZ9DqwUg":{"text":"Sooo I was here (New Orleans) vacationing for the first time with my family. Before I got ","useful":0,"cool":0},"abOUBH9H3HLxWRNYk_vTaA":{"text":"Everytime I visit New Orleans this is my go to spot for brunch! The service is absolutely ","useful":0,"cool":0},"ElDoZ-ua4YHPEuvEsPIyBQ":{"text":"Late 11'o'clock at nite , I wanted go eats and found it here. The gumbo is AWESOME, Very t","useful":0,"cool":1},"4_yBfMI9l1rI1xqcLDZ8UQ":{"text":"Score = 3.0 (solid for real diner food)\n\nPrice = $\n\nWebsite: http://www.daisydukesrestaura","useful":0,"cool":0},"z_AYNhyfXhGi1JLVE9aA8Q":{"text":"Food was pretty darn good and the staff was nice. My server spoke to fast for me to catch ","useful":0,"cool":0},"Go9OBhsoFpVMvUHXP3QR2g":{"text":"Came in looking to kill time right before I needed to head for the airport and boyyyyy was","useful":2,"cool":1},"bT3uBs-2oM11uz0MI32zbg":{"text":"Great staff,neat place to kick off the night. Heavy grease, but what could you expect lol ","useful":0,"cool":0},"mwYOtrBUw0MQFOZGsrlblA":{"text":"Went for breakfast around 9:30am and was not impressed.\n2 reasons:\n\n1-New Orleans has such","useful":0,"cool":0},"NnyYOE4400X_qzm1bFKqmw":{"text":"Great breakfast in a nice little place with a good atmosphere. Service good food good,  re","useful":0,"cool":0},"Gc28lxmqz6UMk2IglhsLJw":{"text":"We went on a rainy Friday night and it was quite busy.  Our service was pretty bad but the","useful":0,"cool":0},"CLG8lxjpR0ZM3Ww9q82Kbg":{"text":"Antonio was absolutely amazing he suggested everything I ordered and it was nothing short ","useful":0,"cool":0},"VrhHW8__R7spSuCXI0_80g":{"text":"Stopped in VERYYYYY early in the AM while in the Big Easy after hours on Bourbon St  ... T","useful":1,"cool":1},"L1lMlZZrVYIoB8EAkuw1Cw":{"text":"my shrimp po-boy was delivered hot and in a reasonable time to my hotel room. \nthe deliver","useful":0,"cool":0},"hyUj-SZ2rVeNwPsx8ocoiA":{"text":"Came here on my first day in New Orleans. My brother has been here many times and recommen","useful":0,"cool":0},"8ij39xj3kb78qfN4cSrZ7w":{"text":"Came here on a Saturday at 3am and we had the best waitress ever. She was attentive and al","useful":0,"cool":0},"J9D6OkZSNGdrstAJ4RLU8Q":{"text":"Had the gumbo and alligator sausage.  Very good.  We went late and it was not too busy and","useful":0,"cool":0},"-Ixv6wNyx7DtPX4PggwCFw":{"text":"So here I am back at Daisy Duke's. I promised the good folks here when I was last here at ","useful":4,"cool":2},"bB3YX5YL3SmP3bxzMAsLyw":{"text":"Next to the Marriott Hotel, this place is a 24x7 joint that has an extensive menu (For a N","useful":0,"cool":0},"_vvQ1J9qyg4ZSbbHq-a8PA":{"text":"This is our first trip to New Orleans.  Our first restaurant the wait time in a half empty","useful":0,"cool":0},"f_Rtz6DVuzVoHTZzsVkwrg":{"text":"This is a super convenient breakfast spot right next to the hotel I was staying at. The fo","useful":0,"cool":0},"UuRhtD4Vq6OS1BtLSQjnxg":{"text":"Had a great experience. Came in after the Taylor Swift show. Good cocktails at good prices","useful":0,"cool":0},"nq-LquNGcLQ1XW5-zrNXCg":{"text":"Great place for a quick simple tasty meal. My husband was hungry after his flight and it w","useful":0,"cool":0},"LDMzxJ2VBR05hf4bVVsFig":{"text":"What a great spot for early breakfast or late night eats and everything in between!\n\nWe ha","useful":0,"cool":0},"WyvGeRj2WKG3ywp8_fxUrA":{"text":"Could not get into Ruby Slipper. Asked the wait staff and they suggested daisy dukes. Real","useful":0,"cool":0},"df_ejLAl6DNF52hG4ABhyg":{"text":"Kind of like a Southern ratchet IHOP. Not the best service or food. Very okay. Not impress","useful":0,"cool":0},"umO_GICedSiJeVjqshnvRw":{"text":"The food is absolutely amazing! Great staff and our waitress took great care of us! LeLe w","useful":0,"cool":0},"ULcJQSoGFPeivTCxU2byPw":{"text":"Nothing fancy, but the food's decent, especially for breakfast/lunch: had the alligator po","useful":1,"cool":1},"KyE57eKQgekCumyR81GmLw":{"text":"I got into NOLA pretty late and was looking for a place to grab something to eat around 1A","useful":4,"cool":1},"wxYxiIgqihgqVEEkmkherw":{"text":"Perfect Choice!! Always a line. Nice portions, attentive waiter. I chose pancakes and baco","useful":0,"cool":0},"XHPn73j-Yyzoi05QKNhnMg":{"text":"Good food and good service.  Prices reasonable. Sausage and biscuits and gravy bowl was te","useful":0,"cool":0},"k-6RdmUcWWpRH_a06raK6A":{"text":"A very nice place, although small, the food was very good and the price is excellent compa","useful":0,"cool":0},"ZdguF32uJVyQXo79uIXmvg":{"text":"Thus place was okay at best. The breakfast was mediocre, not what I expect in New Orleans.","useful":0,"cool":0},"BXTulMhi7D9B4DZUb1Z_aw":{"text":"Nothing was right about this place. Not the food, not the service, not the drinks, not the","useful":0,"cool":0},"BaWXOPj7gegc88QyK86NDg":{"text":"Best gumbo I had in NO. This is the kind of place that defines the city. The service was g","useful":0,"cool":0},"BKe7wyMCrDI1YlsOEdEsJg":{"text":"Best burger that I've had on this trip and I've had several really good burgers.   Great s","useful":0,"cool":0},"dAMWvtJSBMgC5-Y9DoHH6A":{"text":"We ran across Daisy Dukes unintentionally. Saw the mimosas sign and was like why not. Well","useful":0,"cool":0},"3sNTxT7bBuNwlzw_sd63xw":{"text":"OK, to be fair, the wife and I were here October of 2009 and we had great service and grea","useful":0,"cool":0},"9b8Bidf51ph8dTAsaWdytQ":{"text":"Fun restaurant and crowd, chill vibe, great service and real southern cajun food. There wa","useful":0,"cool":0},"Vv2hy14zVOJP6z1p-c88yw":{"text":"Small place near hotels on canal\n Lackadaisical staff and food\nOk but not exciting. Like t","useful":0,"cool":0},"m6Iv-98OM61nTSY5KA-C2g":{"text":"Daisy Dukes truly kept me alive during the Essence Festival. if you're looking for cheap, ","useful":1,"cool":1},"7d80HNYp_ndFLYSetmF6Ug":{"text":"Great food and people\nFREEZING inside. We sat by the thermostat and it was 61, but old bui","useful":0,"cool":0},"PWmQVp1GofpeChPVtA5fgw":{"text":"1st time I tried Alligator Sausage on a Po Boy.  Yum!  Yum!  Open 24 Hours. Nice place to ","useful":2,"cool":1},"OK21LzvaEYR1AQUWycHLvA":{"text":"My wife and I went here this last weekend on a whim and I must say we were blown away. Thi","useful":1,"cool":0},"KuBQ7S4gOODKyIdEJKV0Bg":{"text":"Arrived about 12 pm on Friday and had shrimp and cat fish. Good seasoning and taste. Staff","useful":0,"cool":0},"On4ZwGJRO0HjRY8nZZxVIw":{"text":"Great food, good prices, and great service. Especially Jazz. She's great.","useful":1,"cool":0},"qK9CUhWFVq3EvWkeqXpUbA":{"text":"Horrible service...went there with a group of 4 and one person had a drink from bourbon st","useful":0,"cool":0},"JLEq1Rveo-NJ7IMdJP_9qQ":{"text":"We came to the restaurant and the waitress was not attentive,  did not get the order corre","useful":0,"cool":0},"8TKZ5kMi9FiuPrVu12uwIQ":{"text":"After getting horrible service all weekend from other places in the French Quarter, our wa","useful":0,"cool":0},"VyUfJBquokQtT_zt_Y2Xzw":{"text":"The family and I arrived here this morning for breakfast, found it by using Yelp.  The bes","useful":0,"cool":0},"j1e0QRxuPnfO0L2Du-SW7g":{"text":"great 24 hr spot,  not an overly big place but food came out good,  little hard to find wi","useful":0,"cool":0},"jnS5FCsxyuDUIjzBCVhb8A":{"text":"This is my second time at this place and it was good on both occasions.  They were fast in","useful":0,"cool":0},"Jqme0GDr9cvfJMAXpozMkg":{"text":"There was a short wait line but we got in quickly. The hostest and waitress were extremely","useful":0,"cool":0},"8lrvIX2eC4EL-l9nNt-L8g":{"text":"Excellent Blooyd Mary. One of the best I've had. The Cajun fries make for a good side here","useful":0,"cool":0},"vfbE6xAJegaUnAzUUaAzcg":{"text":"The shrimp and grits are outstanding! And Lisa is an amazing server! We came back for the ","useful":1,"cool":0},"6Oz20v8uLdbSe7ZGYF7OCQ":{"text":"Gross. Worst pizza I have ever had, and I've had a lot of pzzia. $1 frozen pizza is 500% b","useful":0,"cool":0},"EDWLEBczJYycx0-pAFyH4w":{"text":"Food is decent for the price. Service is ok, but they didn't include the biscuits with our","useful":0,"cool":0},"u0ELQ2yWCIv-G_gWt_HAzQ":{"text":"i love the bloody mary and the ryan special, great service.\nI will come back.","useful":1,"cool":0},"sfKKjDX06__PdAhDVZ5KJQ":{"text":"Very very Gud service.. Omelettes, pancakes, specialty entrees were great.. Alligator saus","useful":0,"cool":0},"pe24wXgdpeFNT_fYN44sPQ":{"text":"That po boy I had was outstanding!  And their potato salad was incredible. I'm glad to hav","useful":2,"cool":2},"Nc54W-qoTHS_IWiSiQaGBw":{"text":"Good place to get a quick bite. Cajun fries and fried fish is delicious. The hostess frien","useful":0,"cool":0},"Z0s3KjiOYzmzHUOewP_QBw":{"text":"We had breakfast there and it was excellent. There is an early bird breakfast if you get t","useful":0,"cool":0},"wuFlfALyX-x6FkptbfYX-Q":{"text":"Great place. Loved the fried fish and shrimp. And they stay open really late.","useful":0,"cool":1},"FmLNVeBQbHrStfRNxconJg":{"text":"I ordered a green tomato po' boy. It was very good. The onion rings were also excellent. \n","useful":0,"cool":0},"U1RnI1Yps16NYcjSRI1LKg":{"text":"I was greeted by a friendly, older gentleman, who offered me a towel to dry off with becau","useful":0,"cool":0},"TtTn7ZdpYI8L-3Bysnzfdg":{"text":"Had dinner and breakfast there. Food was mediocre  for the price. The bottomless bloody Ma","useful":0,"cool":0},"oR018Af1z7PMOnKDvc6rYQ":{"text":"Prostitutes, strippers, pimps....everything one could ask for at 5 am in the French Quarte","useful":0,"cool":0},"jIk94TwVQt9rIUyoA9Ftgw":{"text":"We ordered delivery, late night on a weekday (tuesday).  It took 1 hour 15 minutes for our","useful":1,"cool":0},"zuCgeHoKzZ6nf1JmZQROrA":{"text":"Ok! This by far was the MOST FLAVORFUL place that we had the pleasure of experiencing whil","useful":1,"cool":1},"6gp3kP9i-s8Pa6WitQIMJg":{"text":"The service had always been great for us. The lunch combo of half po boy and gumbo is deli","useful":0,"cool":0},"gcO-3bZ_HbedgbqtespvmA":{"text":"Perfect hole in the wall type place. It was right outside of our hotel so it was perfect f","useful":0,"cool":0},"VeqQopOxgemc7HPDkoE7_g":{"text":"Walked in & the place smelled weird. Me & my friends ordered breakfast (pancakes, grits, e","useful":0,"cool":0},"pvWmn7Eh8bXO1YAuI3x8Mw":{"text":"Best spicy gumbo in the French Qtr.   Great value - low prices with excellent food. Breakf","useful":1,"cool":0},"vDyBH6yHNed9Z8V3WZKDhA":{"text":"This establishment is open 24/7 and thank goodness for that! We stumbled into this place a","useful":4,"cool":3},"irl5Peic8rtJyafUum4Nlg":{"text":"The food was good and the service was decent the only bad thing I didn't like was the payi","useful":0,"cool":0},"dmzetvT5PZE0DVdyPuYKdg":{"text":"Breakfast all day, delicious food, full bar at breakfast. What more can you ask for in New","useful":0,"cool":0},"PLBz5PvxzPD1c17z-vEpAg":{"text":"My husband and I went for breakfast. Had to use the restroom and on the way down the hall ","useful":0,"cool":0},"6kyp3FablZt8Er2K3H2pMA":{"text":"Horrendous!!!!!!!!!!!!!!!!!!!!!!!!!! RUDE!!!!!!!!!!!!! DISGUSTING!!!!!!!!!!!!!!!!!!!!! ...","useful":3,"cool":0},"rCYZz83lNxK2-U3UavFhGA":{"text":"Nothing special or outstanding about this restaurant. Food is decent. Seating is small and","useful":0,"cool":0},"neHsqi_25kFvH-o7LL0wIw":{"text":"YUM! This was one of the few restaurants that was open when I arrived at my hotel and I'm ","useful":0,"cool":0},"-vzZQ6ih5eVDJjA02xoeeQ":{"text":"Came in for the $6 bottomless Bloody Mary Yelp special and breakfast. I was pleasantly sur","useful":0,"cool":0},"YATxvdjb8PqMv4pgCxSdkg":{"text":"Legit, tasty, reasonably priced, and captures the essence. Would eat here again when in to","useful":0,"cool":0},"_UosuRDssIkJ9O7PQ0K2ZQ":{"text":"We are in New Orleans for Mardi Gras. We went here 3 times(2 different locations) and rece","useful":0,"cool":0},"jeR4TKDsG_haTrMynMFVRw":{"text":"Exactly what the doctor ordered after a crazy night on Burban Street. \n\nThe right vibe,  t","useful":0,"cool":0},"7UjIgmvtxHrFdGUHTBqZLw":{"text":"Going to eat here is a MUST for when we are in NOLA.  They have the best red beans and ric","useful":0,"cool":0},"QgzbMhcuzHFQolpmTwr0vg":{"text":"Food was great. Highly suggest the center cut porkchop. Perfectly cooked. Also enjoyed the","useful":1,"cool":1},"wvEY1lOLPofMtCZZt6hp7w":{"text":"This place is awesome. The food is great and large portions too. Fried green tomatoes are ","useful":0,"cool":0},"MZhPbDWg_JTZB7Loerqedg":{"text":"This is the original Daisy Dukes, and they serve a hell of a breakfast. We split a Cajun O","useful":0,"cool":0},"76YpM-pD7ovwxdvds4kj9g":{"text":"Shrimp po boy and Cajun Philly cheese steak was DELICIOUS!!! Good spot close to french qua","useful":0,"cool":0},"Y2eN4zf0RDalwj2qqJLCsg":{"text":"Food was nothing too special.\nTook forever to get out check.\nCouldn't break a $100 for cha","useful":0,"cool":0},"oU1SOi3Cn41fitChDfiYmg":{"text":"Daisy Dukes is the Denny's of Bourbon Street being a 24 hours joint. When I found myself h","useful":3,"cool":2},"MCQLl3e231ycegoWxRAevg":{"text":"Spicy, delicious gumbo and a free sample of crawfish. This has become my gold standard for","useful":5,"cool":3},"QwmQvmuXi46qq6YpguUfhA":{"text":"We went on a Saturday for an early dinner.  I saw the varying reviews on Yelp but we had a","useful":1,"cool":0},"fDQDNdQu4ohLNA3ei4X74Q":{"text":"The crab cakes were large and the fried green tomatoes were tasty, just eat them quick! Do","useful":0,"cool":0},"HlKMcUo8EAHOHFJlAGOpLA":{"text":"This was our go to place on the late night.  Hubby and I really liked the staff,  food and","useful":0,"cool":0},"kpn2w8aD02LLArrIubQMwg":{"text":"We came here on Christmas day, expecting delicious food.\nWe got crap.\nIt seems like the NE","useful":0,"cool":0},"dBb5ATsfLLkvcT5XVekgWQ":{"text":"Daisy Dukes was our first stop when we arrived in New Orleans, and we had a very positive ","useful":0,"cool":0},"Z9pPFqBy1b1XZ8_SO9nuOQ":{"text":"This place is close enough to most of the hotels around Canal St. that it can be a go-to f","useful":0,"cool":0},"pXKQVLwPNK7GTYQdD0uvFQ":{"text":"Great breakfast and fast service. You gotta try the home made pancakes. Out of this world!","useful":0,"cool":0},"g3OVCkxNef1nLfIE2BdcRg":{"text":"Best breakfast all week.  Seafood omelet with hash browns and wifey went with French toast","useful":3,"cool":4},"IMJ84obQmdaU0JF803e30w":{"text":"As a tourist from California, this was my favorite place to get gumbo delivered to my hote","useful":15,"cool":13},"Z8btaJM8DKWzlFVbo4nQlg":{"text":"We were in town this weekend and ate at three different breakfast places (two chicks, dais","useful":0,"cool":0},"gNZpwPI91PSMEHEBY6CfLg":{"text":"Order from Daisy Duke's if you hate eating food, because I guarantee you, after they take ","useful":0,"cool":0},"ogwq382PIlTFv9JriCt9IQ":{"text":"This place was given to us as a recommendation by fellow tourists. We were not disappointe","useful":0,"cool":0},"9mpva-X82AgqxkKDOolXBw":{"text":"A real dive of a place next to our hotel, but open 24/7 serving totally unhealthy but fant","useful":0,"cool":1},"sjK77-HSYiDcZEUz2IFMCw":{"text":"Service was great. Our waitress was very Attentive. We were originally seated at a tiny 2 ","useful":0,"cool":0},"6Sz9bF9JyJPSMpr1Nz1r-Q":{"text":"Waited for over twenty minutes with no one even stopping by our table and incredibly rude ","useful":0,"cool":0},"0dEF8EoqUvaLp541W10X7A":{"text":"We decided to stop by here after taking a super long walk to the area then riding the stre","useful":3,"cool":2},"q4PJKH2TLz72ouZSKyZbqA":{"text":"Food was good but not great. Service was ok. Probably wouldn't go again. Not many options ","useful":0,"cool":0},"23kVM7Kf5CTFRqTG6EsqGw":{"text":"Daisy Dukes was conveniently located across the street from my hotel in New Orleans, and i","useful":2,"cool":0},"8lCbOWxpP60vQ60v55T1Lg":{"text":"Wow, reviews for this place are all over the board, huh?   I guess it depends on what you'","useful":7,"cool":3},"gljRWrYmNc_U20szMsXYyA":{"text":"We just enjoyed a very average meal.  The servers and hostess was nice but all the food wa","useful":0,"cool":0},"GW-HNkrdoGpRbi442SZNPw":{"text":"I stopped in from a tour in the French Quarter to have bite and watch the Dallas Cowboy's ","useful":0,"cool":0},"xqVb8x9cNRmS4cr3IhKJXg":{"text":"The food was good, but not great.  I was disappointed that I ordered biscuits and gravy gi","useful":0,"cool":0},"wG40MIhjaFC5OYwPY50kHQ":{"text":"OMG! Food is great and they just added shrimp & grits to the menu,  well it's not on the m","useful":0,"cool":0},"n_gly494K2Z5MxkoErEUTA":{"text":"Had the alligator sausage po boy. Didn't \"wow\" me, was still good though.","useful":1,"cool":0},"3rdewmcFO6Lgo_CurWJTnw":{"text":"First meal on my return trip to NOLA was SO DISAPPOINTING and NOT GOOD!!!! \nHad the shrimp","useful":0,"cool":0},"TtwV6u6oWm87Dseq6d4log":{"text":"Fabulous place for breakfast. The food is fantastic and the service is excellent. Julie ou","useful":0,"cool":0},"x9xrt6gXThjBXbZS5wd2xQ":{"text":"This place has great food and is in a convenient location. I've had the fried shrimp (good","useful":1,"cool":0},"hGIJIGkImJf-v8drhT4nTQ":{"text":"THE best crawfish I've ever had! Service was great and staff were very friendly! Definitel","useful":0,"cool":0},"N0jFCKvm4CzFjzA4OxXrsg":{"text":"Went here during Mardi Gras, and there wasn't a wait which I loved! \n\nI got the fish baske","useful":0,"cool":0},"K43Z5WuiqYQ9IaouMJlwVA":{"text":"Always happy with the food when I come here. They are open 24 hours, which is great, but s","useful":0,"cool":0},"OyJiVhvhQlOvWO7iUUV5Pg":{"text":"The hostess we learned was from Hungary  was so kind to us and our silly kids! If you want","useful":0,"cool":0},"fSGynsbO9ZNqE_YaL0JZBw":{"text":"Lovely  relaxed atmosphere. Great Southern Breakfast!! Grits & customer service! excellent","useful":0,"cool":0},"8Rz3sFSXsMGA4u810f3U7A":{"text":"We ate here almost daily for breakfast as it's located a couple doors down from our timesh","useful":0,"cool":0},"348OF3zJvM6BerTOnPfNCw":{"text":"Set up is ridiculous. Standing outside waiting to be seated for 10+ minutes while the staf","useful":0,"cool":0},"bT5M6rIxaZlmBY_aLpXcig":{"text":"My wife and I had a wonderful lunch there today, great food and a great price.  It'\\ has a","useful":1,"cool":1},"j82mMYrr2iiiSJ3KCiI17w":{"text":"Service was great.. but my overall feeling 'eh'. \nGumbo was delicious. Just disappointed t","useful":0,"cool":0},"NZReFCtHHSWreIWLdCg7Jw":{"text":"Solid food. Open late. \nNothing incredibly special. \nHOT WINGS. Enough said. \n\n\nPs: They d","useful":3,"cool":2},"-iIn3Lvs4rPRCclf8x_zUQ":{"text":"I was highly impressed with this 24/7 French Quarter joint. Very friendly service and sinc","useful":0,"cool":0},"4WfX5VMc1cmZTYtJFB9XgA":{"text":"Oh.. Daisy Dukes where do I begin.... While in NOLA for the 2014 Essence festival DD was r","useful":0,"cool":0},"xE-NOlpcRN8ngJRoPjcgig":{"text":"Stumbled in at 11:30 after flying in late and needing food.  We were very pleasantly surpr","useful":0,"cool":0},"gwxFrnzs_UW3PUbHdhZLBQ":{"text":"Nothing to write home about. It's a New Orleans diner that stays open 24 hours. Late night","useful":0,"cool":0},"SUIlJxcH7I66UsVt7aDMfQ":{"text":"I want to be fair.  I went to Daisy Dukes because I had read some mixed reviews but wanted","useful":0,"cool":0},"QUntcj7wkEOeVK0YijYwxg":{"text":"Name kind of through me off.  For some reason My expectation was low but this  was great. ","useful":0,"cool":0},"WbX__DodIsXyn8YZRjm3DQ":{"text":"We came here for a pre-dinner (this is a judgment free zone, people) because our dinner re","useful":0,"cool":0},"s6kHz3-jOqF4CNrqgltfIA":{"text":"We enjoy this place because it's a good cheep breakfast.  If you go before 9am it's only 4","useful":0,"cool":0},"hNjeTZFr3TJbRHH3M50dJw":{"text":"What a pleasant surprise! Doesn't look like much, but looks can be deceiving! Food was del","useful":0,"cool":0},"Up0HJnL62d0KLFHchGJMMQ":{"text":"The service was awesome and the food was Cajun spiced to perfection. We had the rajun caju","useful":0,"cool":0},"cAmsbQ7H_7G2d8vU1gJ1nw":{"text":"We came in here while on vacation for a quick bite to eat in between our busy schedule. Th","useful":0,"cool":0},"ZdeIYduVN2up2s5BbBihQQ":{"text":"This place is open 24 hours, so it's perfect for this late night cravings. It's pretty clo","useful":2,"cool":0},"6uzzMTPO-2rxGfYBNsBGvQ":{"text":"Amazing food and great staff!  Long line for the place next door, don't waste your time, c","useful":0,"cool":0},"h0T5ZsV1LLUCdc-p7p4LvQ":{"text":"This a great hole in the wall for poboys, gumbo, and jumbalaya. Super cheap & huge portion","useful":2,"cool":3},"JmMdx5eIIdYKzsASEpns2A":{"text":"I came I ate I conquered....to be honest I was defeated. Waaaaaay too much good food in on","useful":0,"cool":1},"u0xART8MF_x1l7qudlnq0w":{"text":"This was a great restaurant open 24 hours. They also deliver. This place is convenient and","useful":0,"cool":0},"zWUoXAVKP8-aFh0FVL1qHA":{"text":"Food and service hands down amazing  A must try is the pork chops and shrimp and grits","useful":0,"cool":0},"o_UO6Gy9Nd7R0Jgo9EelIQ":{"text":"Amazing Gumbo! Seriously, get the gumbo! Also great atmosphere too and reasonably priced.","useful":0,"cool":0},"bVDTxb6NafP4-3yy7RDcWA":{"text":"Long wait but great food. If you are looking for a fancy clean restaurant, then this is NO","useful":0,"cool":0},"SrF2U6TeeUdN4dO1EEXRbA":{"text":"Went here for breakfast.  Boyfriend and I got the early bird special.  Food was good, not ","useful":1,"cool":0},"_RyRIXZmzJuYVNv1dPHgQQ":{"text":"My stomach hurt every time I ate there but I would totally still go back. 24/7 eats, big m","useful":0,"cool":0},"pDcIrds2MDOIgqLRreUP3w":{"text":"We stayed right on Canal Street so Daisy Dukes was one of the 1st places to pop up on plac","useful":1,"cool":1},"YXq2sjdkccsOOe-eZ6_OcA":{"text":"Three days in a row for breakfast!  A much preferred escape from the expensive hotel break","useful":0,"cool":0},"IGnIca1HYfxUks0nExYOVw":{"text":"I'm really shocked that Yelp only gives Daisy 3.5 stars as it serves up some of the best f","useful":0,"cool":0},"vvGpF6twM5fRYdHgNxnmYQ":{"text":"Nice place for a picky eater , menu consist of almost everything , ordered red beans & ric","useful":0,"cool":0},"kR0DkQpgiqL3I3J02d8Lhw":{"text":"They are always so nice. Until recently, I only came here after a night of drinking. This ","useful":4,"cool":4},"4LXebIU8S6Xse7rBEoAiVg":{"text":"That was easily the single worst delivery meal I have ever attempted to eat.\n\nI would rath","useful":0,"cool":0},"f4kuLjcAYNSPfvTuc4DdXQ":{"text":"I did not like the signs that mentioned to stay outside to be seated. My friend did not se","useful":1,"cool":0},"EjOojZs8gYoYScFymTC8tA":{"text":"Got two late dinners from their downtown location and they didn't disappoint. I was initia","useful":1,"cool":1},"pwt_WH1G0_5-h13TCdtSSw":{"text":"Daisy dukes is a great diner style restaurant. The staff is great and super friendly. The ","useful":0,"cool":0},"4Ivus4h-lHqLiB0JBq2Hdw":{"text":"All though our stay at the Wyndham didn't come with breakfast, we weren't too worried with","useful":1,"cool":1},"q3jdCBXKjFfUoAMyafot-A":{"text":"thanks to everyone at Daisy dukes , we accidentally ended up there for lunch and it was th","useful":0,"cool":0},"0ZUsWwYc66Ao2Xt0PVjlUw":{"text":"What a great place for breakfast/lunch! The staff was super friendly and fun. Bottomless B","useful":0,"cool":0},"D1NQVRIxgwG0YzQ4StaF2g":{"text":"24 hour establishment ran by 3 sisters Jami, Jody and I never caught the other sisters nam","useful":1,"cool":0},"hiOfnaZZqcwZMiwbwo1MHw":{"text":"Best bloody Mary's in town! Alligator po-boy are the best here! Also the staff was very fr","useful":0,"cool":0},"MIqWPmWMX7rgjl1o6lnbPw":{"text":"Let's start off with what Daisy Dukes is not:\n-fancy brunch\n-top of the line food\n-good fo","useful":1,"cool":0},"9UBpuybZHJKcIQC_d0d41A":{"text":"It was super busy because it was a few hours before the Saints game but everything was ama","useful":0,"cool":0},"NzBTO9J9Y3Z8kSzIvv2VAA":{"text":"Stopped in yesterday and had an Oyster Po boy and gumbo.  Excellent food and service.  See","useful":0,"cool":0},"ZToiZk1WG6HP4jPhNzx9qg":{"text":"We got into NOLA late on St Patrick's Day. Looking for a quick easy late dinner. Came upon","useful":0,"cool":0},"iSPtzyo5B2MXRf2XuHWdmA":{"text":"Awesome service from Julie and hands down some of the best country fried steak I've had (r","useful":0,"cool":0},"-PXxkm3vLi58_bQ4rxx9LA":{"text":"I've eaten at the 2 Daisy Dukes in Nola and the food is very delicious. Nothing too fancy ","useful":0,"cool":0},"DoDGzLyDMVBYO-HnIKfyZg":{"text":"If you're looking for a decently quick diner to eat at this is the place to go. This place","useful":0,"cool":1},"YVRi117LNUnQpZKggoZgiw":{"text":"Walking down the streets of New Orleans me and my family decided on this place.Staff were ","useful":0,"cool":0},"mcjiz_p1dCd5m1cXqN4jLA":{"text":"Ordered the oyster po boy special with a cup of seafood gumbo. The po boy was good not ove","useful":0,"cool":0},"LHyvbAf7809sm91fTU8bTg":{"text":"This place was a breath of fresh air after all of the overpriced tourist traps on Bourbon.","useful":1,"cool":1},"UF0LslM8oWewf6bHKLIrmA":{"text":"I am staying in New Orleans in the French Quarter ... I ordered the daisy dukes special a ","useful":0,"cool":0},"V1Q6-Z8lE07raEE4dp1Kkg":{"text":"The food came out cold and rubbery. They claim their eggs are shelled but there was no whi","useful":0,"cool":0},"1dnPZs3aEBLpjjbLXxRNOw":{"text":"Great Breakfast! \n\nI ate here 6 out of 7 days I was in NOLA for breakfast.  The food was g","useful":0,"cool":0},"nUYcvZdgg-Ui3fkIkFvfLQ":{"text":"Still have crawfish and is as good as it gets.  All you can eat and some of the best I eve","useful":0,"cool":0},"5u8SIakgMCh4_nAbZBgE6g":{"text":"Friend and i are visiting New Orleans this week and this was the first restaurant we visit","useful":0,"cool":0},"m61MgYbJZlrH--i1e6Komg":{"text":"Horrible experience. They were severely understaffed (only 2 waitresses working), but that","useful":1,"cool":0},"DCvTrFD1L1Jg7K6fhtLo9g":{"text":"No major complaints, even if atmosphere does leave a little something to be desired. But a","useful":3,"cool":2},"acqRbSdmAitR-6xP95_iEg":{"text":"This was the best meal I ever ate it got me ful and I stayed full of the three days that I","useful":0,"cool":0},"BYR1ZYq9ei7sp9W2w160_g":{"text":"Selected this restaurant based on yelp ratings. Good choice for breakfast.  One of the fir","useful":0,"cool":0},"13T9LA7TUgLnr5KXM23wUA":{"text":"What an amazing restaurant to stumble upon! Great friendly fast serviced rom the time we w","useful":0,"cool":0},"_jHjMtxnfpTSAIsZVndq8Q":{"text":"We are vegan and while visiting New Orleans, this place was our go to almost every night (","useful":0,"cool":1},"ev9ikjZsDEavvFoQ0-24Ag":{"text":"24/7 restaurant in the French Quarter. They serve breakfast all day and night. Always a go","useful":1,"cool":0},"twvKvb1cF9QWmkgOlH2s-Q":{"text":"We loved this place! Our server was friendly and full of smiles, but not in an overbearing","useful":0,"cool":0},"sSMUFNn_qNVrNwrT2q-IuA":{"text":"I had the red beans and rice and she had gyro sandwich and cajon fries. Cute atmosphere, a","useful":0,"cool":0},"Mde9xzQ-ld0r95kzDA9Tww":{"text":"The food would of been great if they deveined there shrimp! I tried the little bit of shri","useful":0,"cool":0},"pWwLnX2YOX57khtVgu2vEw":{"text":"First time in New Orleans and were ready to eat! They DO not disappoint on the serving siz","useful":1,"cool":1},"XENeyd8PWgy7gjwsE8X_IA":{"text":"Good food and drinks.   We stopped off after a night in the French quarter and were pleasa","useful":0,"cool":0},"7xD7u4wWRUAYGMOCSj_cBA":{"text":"This place is amazing. We flew in from Chicago for the weekend. The best Bloody Marys I've","useful":0,"cool":0},"8gkYsIj-YypTIdLpLDVn_w":{"text":"Saw the open 24/7 neon sign flash the other night. Decided to come back for breakfast the ","useful":2,"cool":0},"EGeKQjxOajnTzXDk7qhIpg":{"text":"Groupon has let me down again.  I was excited to purchase a groupon for $10 worth $20 for ","useful":0,"cool":0},"A8KY4DoxaLKKK926Rz_nbw":{"text":"Went there for breakfast this morning  & was served cold food. The manager was awful & cou","useful":0,"cool":0},"J-JAa2bq1EEkL_v8GWvuqw":{"text":"Good 24 hour spot for food! Shrimp po boy wings and daisy sauce delicious! Very good place","useful":0,"cool":0},"m4WeeABFE1zzL__gDsz9zg":{"text":"Had shrimp & grits and New Orleans sampler. Everything is great and service as well. Sampl","useful":0,"cool":0},"SZocwyiHZZ_AJUZD3CGlQQ":{"text":"Hate to say it but it was just okay! For my first time going to New Orleans i was expectin","useful":0,"cool":0},"3111Ahs_arBOrWMBOt6jIw":{"text":"I got Salmonella from eating at daisy dukes. Me and my boyfriend were recommended to come ","useful":0,"cool":0},"7ev8nSEMQjqJQSR0iOi-9Q":{"text":"One of our favorite place to go in New Orleans. Went for breakfast and wait was not long a","useful":0,"cool":0},"gzsuPa6BpIasRIIsiYESFQ":{"text":"As most places, there was a lineup but our party of six were seated within 5 minutes.\nThe ","useful":0,"cool":0},"eyGceiBBSpcj01bAttD6IQ":{"text":"My friend and I did a quick trip down to New Orleans from DC, and I was excited to visit D","useful":0,"cool":0},"Sru9hQUAq8PAeb8uVYtPVQ":{"text":"We came in the restaurant on the evening of Wednesday, August 28, 2019. The place was quit","useful":0,"cool":0},"Qxp3bfBG6-kUnkM6TFZuGg":{"text":"It wasn't a real busy morning though we had to wait a while for a table.  Later saw that t","useful":0,"cool":0},"OfPy7tr5AwxMBudWFIP4tg":{"text":"This place should get a 5 but there were so many things that went wrong that the ratings w","useful":1,"cool":0},"e6hE46ZftshPPqydz3Nrsw":{"text":"The Good: Breakfast was GREAT!  The biscuit was a nice touch. YUM\n\nThe Bad: Service was SL","useful":1,"cool":0},"w76Vc8o2kb9M5gAjmvFjdQ":{"text":"Great place, friendly environment, great service. April was our server and was on point. T","useful":0,"cool":0},"m0tpdtaopdHnb4qF8v6TGA":{"text":"I've NEVER EVER EVER had an experience with the restaurant not having change enough to set","useful":0,"cool":0},"bl-1ZIroUplMgr2Yg8g9Mw":{"text":"If I could give this place zero stars I would! WORSE place ever! My mom and I ordered thei","useful":0,"cool":0},"M_dZ5zgc1GIdJ54TwLb9Mg":{"text":"First time here, visiting for the holidays. The food was great, good portions and very ine","useful":0,"cool":0},"hxagCqKDq1o3Jegm29eITw":{"text":"We stopped in for dinner on Christmas and had great service. The lady working the door was","useful":0,"cool":0},"Ysy0YjigeorKdDRMhoZlUw":{"text":"I am reviewing restaurants from my trip to NOLA last month and I am having a hard time fin","useful":0,"cool":0},"Z7yD8_T12vRFcsbfyPTOug":{"text":"Went here twice and enjoyed both times. I had the fried green tomato po boy and the New Or","useful":1,"cool":0},"7r41oz0pvHvR5g99nkywgA":{"text":"After missing bkfast @ the Ritz Carlton N.O. the front desk suggested Jimmy J's for a late","useful":0,"cool":0},"kJkJjBrf6HiU5_iRFSY5jA":{"text":"Good food at a good price-nothing fancy but if you're looking for a good Southern breakfas","useful":0,"cool":0},"y4f_VOPrzMbh6fASuXsWRg":{"text":"Great food and service. I love places that offer more character than the well know chains.","useful":0,"cool":0},"K9TK2p29YJHWc9d80qMqmA":{"text":"Awesome brunch. The Bloody Mary was great. Will go back the next time I visit NOLA.","useful":0,"cool":0},"ixPzpIe0Bl5Z1zboEteBZg":{"text":"Amazing breakfast food. Servers really shows their southern comfort that's matcjes the foo","useful":0,"cool":0},"j1fmrzKNzAGcQ7R9fUEGDw":{"text":"Great service for sure.  Food was nice and plentiful. I just feel the quality of their foo","useful":0,"cool":0},"5PEo4khZoOdMGQcY37OC3g":{"text":"Awsome hole in the wall.   This place is great for breakfast.  Service staff are very nice","useful":0,"cool":0},"DTQqCEMRp2gWNtKnnZ44XQ":{"text":"We have eaten here every time we come to NOLA. Have always enjoyed the breakfast here. Sta","useful":0,"cool":0},"ldeF48GA4WHC7tL3HJ6DGw":{"text":"It's the only place open 24 hours near the area and I woulnt recommend it to anyone!  Orde","useful":1,"cool":0},"zzhazzLZFekYR5ei-aPgkQ":{"text":"Ate here the first time last night. The food was pretty good. The service was awesome. I d","useful":0,"cool":0},"Xb5-E1UYdhrr5UAfhrE_tw":{"text":"Just like they advertise: Nothing fancy just good southern eating. Shrimp PO Boy and cup o","useful":0,"cool":0},"ceXUTcQIDgsDwDcSHZ5heg":{"text":"Had the friendliest service here today for breakfast. After dealing w/rude service at othe","useful":1,"cool":1},"K1sWsl-H2sudHqc2C1JVqA":{"text":"Just had a great breakfast here. Our server Christine was just great.  Made the best mimos","useful":0,"cool":0},"sGKRmMuvgCXDtsyIof0zkA":{"text":"We were on our way to Jimmy J's and saw the line was over an hour wait, so we went next do","useful":0,"cool":0},"KLFHtZsov_qKnda6cYfLGQ":{"text":"I was only in town for 3 days and I ate here 2 days in a row. This was the awesome Cajun f","useful":0,"cool":0},"TVyQEuh8qMLAPQHGB1_W9w":{"text":"Came here to meet some members of my family for breakfast after a night of drinking and pa","useful":14,"cool":12},"VfYLnlPBi8dV4mnEntrh6A":{"text":"Excellent restaurant in the French Quarter open 24 /7 and always good! I'm a big fan of bl","useful":5,"cool":4},"XBgMCGZo-jo94R6KVvvR-w":{"text":"This is my third time here. I found out about this place 1 year ago when I was in New Orle","useful":3,"cool":4},"PDX4PQSycADpUHxWWAMAgg":{"text":"24/7 hole-in-the wall spot for all of the NOLA specialties + breakfast. I went with my fri","useful":1,"cool":1},"iu-RgZX0uh3lmuhBzzRTzQ":{"text":"Walked in and I immediately knew we shouldn't have come. Waited a couple mins to be seated","useful":0,"cool":0},"lGCSta7i4WnreCsGh32zQQ":{"text":"Arrived about 10am on a Thursday. Waited less than 10 minutes for a table. Staff was atten","useful":0,"cool":0},"9DK3t4Xorqzbiy9sgBGWHg":{"text":"Great breakfast.  Great prices with a specials as well as regular stuff.  Thewait staff wa","useful":0,"cool":0},"KU4ma8mAzLGVdgiNGpSYcw":{"text":"Was in town in February before the pandemic blew up. They got my order wrong twice and cha","useful":0,"cool":0},"g5x8IV75YZ52p2o_CpH_HQ":{"text":"Great good and great prices. The poboy bread was perfect, crispy and chewy. I had the alli","useful":1,"cool":0},"tUalIOiJxn7GURfKNp6h5A":{"text":"I went in with low expectations and I was pleasantly surprised. I ordered something simple","useful":0,"cool":0},"35-yimauXQLW7FSfO695RQ":{"text":"A place that serves breakfast 24/7?  Sign me up!  We got a late start one day on vacation ","useful":1,"cool":0},"qNEWL72HVj79C0uremSWLQ":{"text":"Everyone was hungry and it was late so we started walking from our hotel and saw this rest","useful":16,"cool":9},"axq1askNS1_AchRcUjd0Gg":{"text":"Did not like anything I ate. I took one bite of the gumbo, and it tasted very old. The gat","useful":0,"cool":0},"_CqbLv9hHMcF8K6BsAcZ4g":{"text":"Back at it again with YET ANOTHER gutwrenchingly atrocious excuse for \"service\" in a resta","useful":3,"cool":1},"8H0G97oW-ro76eFdqQOaRA":{"text":"Great atmosphere don't let the outside area change your mind on eating there . The breakfa","useful":0,"cool":0},"hAyCdHnE1IKmCito79q4Zg":{"text":"The place has a line but moves quickly. We came for breakfast and it was just ok. Do NOT g","useful":0,"cool":0},"GypHS2rfaR6BAz8AQlSjtw":{"text":"1. Don't order coffee. It's water down. I don't drink a lot of coffees and I can't taste a","useful":0,"cool":0},"SPzIQZeqWYXH68ecth6Qqw":{"text":"Pretty cool little place in the French Quarter with Po-Boy combos and bottomless Bloody Ma","useful":0,"cool":0},"I_GnhK6PfWehMM01mo-JPQ":{"text":"Whenever I'm in NOLA I always come here for the early bird breakfast...$4.99 before 9 am..","useful":0,"cool":0},"Fv_2KQjjxgBpLd09zNV-ag":{"text":"The raging Cajun shrimp po boy was great. Got the shrimp basket on a separate night. Both ","useful":0,"cool":0},"o19p0KW693kmk8fiLDwPVQ":{"text":"This was the first thing I ordered from uber eats when I got to Nola and it HIT THE SPOT. ","useful":0,"cool":0},"N0EI1JhjeqNgT73MsYGe2g":{"text":"We were treated extremely rudely at Jimmy J's, which is a few doors down from Daisy Dukes,","useful":0,"cool":0},"isDMlcJ9iLGXqDxBEGimHA":{"text":"My husband and I are here for a mini Vacay to celebrate our anniversary! I went to yelp lo","useful":0,"cool":0},"99w8fR5auQbcuyvNYcWHnw":{"text":"We had an amazing experience here! I am a vegetarian and I had a veggie omelet and the Fre","useful":0,"cool":0},"l_cYnr5jhGk3MBs7a7T-dg":{"text":"Really good breakfast comfort food for a late night.  Went there twice while on a weekend ","useful":0,"cool":0},"lGJHgirXwRpiPv9JBkeGNA":{"text":"We order from here alot and have never had a problem.\nTonight we ordered wings and an orde","useful":0,"cool":0},"woXXZH1wRLJ3la9MSjabAQ":{"text":"I ordered food for delivery like I've done for years at 6:25 gave them the address and the","useful":0,"cool":0},"AyIOYjzIiK7fTTujOvXK_w":{"text":"Some of the best food I've ever eaten! The gator sausage in particular is superb. It's sea","useful":0,"cool":0},"bruDmbiTuCsdJlwKQ6gqgQ":{"text":"Highly recommend this place - I had a veggie omelet and it hit the spot after a night of d","useful":0,"cool":0},"oLBWcYvnJ6VfRZfPFgXf9Q":{"text":"Food came out SUPER fast. Service was great, and friendly. I would definitely come back ag","useful":0,"cool":0},"Ha9VdeeO2JGkpIYqyillSg":{"text":"Had the gumbo. Complete goodyness. Servers were friendly and prompt. It was so good! The o","useful":1,"cool":0},"iBZXk13oMCjhs_-KOsbnkg":{"text":"Had breakfast this morning food and service is always wonderful, we've eaten her 3-4 times","useful":0,"cool":0},"SWE8zXEgebgYbpJo36jHIQ":{"text":"Go see Jeremy at this restaurant!! He is a joy to talk to. The food is delicious and deliv","useful":0,"cool":0},"QMYB7lwuGUZc7S2Tvf72Wg":{"text":"Came in for a quick meal around midnight. We lucked up and got seated right away. This is ","useful":2,"cool":1},"RRmt-CZWwCIqHBvm8O6UxQ":{"text":"Great place with good food, fast service and affordable. I recommend the Po'Boys (shrimp&c","useful":0,"cool":0},"g-5BUJKkK_L5oi0jnfGYgA":{"text":"This was my first time going to Daisy Dukes and I was disappointed. For starters the servi","useful":0,"cool":0},"SPurTJmB_Ouc34byTYBhow":{"text":"This place never disappoints when it comes to reasonable, delicious, cajun food. They are ","useful":1,"cool":1},"nabyHIjLIKqPl9adB4Nfqw":{"text":"I had my first Southern meal at this place and I was pretty impressed. A little slow on th","useful":1,"cool":1},"U15LynVcYV3uWByDW_RzfQ":{"text":"Came in from Houston, this place was absolutely incredible. The blackened alligator was pe","useful":0,"cool":0},"FOIxEg03ShDOO3lNL0dnsw":{"text":"This is a typical tourist trap. I cant find any other reason for it even being in business","useful":1,"cool":0},"zQA4gtUWZq4-uUyCBBE_-A":{"text":"I called Daisy Duke's at about 3:30am for delivery to the Tulane ER. I ordered a cheesebur","useful":0,"cool":1},"Vv4z-0HvehswAvEnOBX6eQ":{"text":"Super disappointed with the shrimp & grits .  I refuse to eat shrimp that still has the bl","useful":0,"cool":0},"vDmW_p9JB5O6TcxHtfp5Qg":{"text":"Amazing breakfast food. Be prepared for a wait, it's a popular spot! I enjoyed the alligat","useful":0,"cool":0},"eAnKFixWaO_m6zjkeJ2z2A":{"text":"I was really tired from my flight into New Orleans so while I was wandering Canal street I","useful":3,"cool":0},"_Q0S-iciwJITq1XgifR4pw":{"text":"I do not recommend.  If u want to see the wait sit and gossip and food come out 3 minutes ","useful":0,"cool":0},"u_Vs9SdAwy_qFXvO8rhVKg":{"text":"Best cost efficient breakfast in town. The food is great, sausage gravy and biscuits with ","useful":0,"cool":0},"g3-z5AoPrU5x-Y5O6dD9Rg":{"text":"I tried the half alligator sausage poboy plus a cup of gumbo.\nEverything was very tasty","useful":5,"cool":6},"QKlRB0nqRQrbqpkcWzpCLA":{"text":"Fabulous \nQuick bite before SugarBowl\nExcellent waiter Daniel recommended the alligator \nA","useful":0,"cool":0},"MTrmMgLGMjR6uj3NXax2SA":{"text":"We had a really weird experience with trying to get in/be seated.  We arrived to a line of","useful":1,"cool":0},"OrmqtCq-ZtC6i8sUczcTzw":{"text":"The grits & shrimp here are really good. The sauce on top I has a very unique taste/flavor","useful":0,"cool":0},"x7Km8B58dUleGWvegK72fw":{"text":"Do not waste your money. First, the place has a fishy smell!!! We had a drain near our tab","useful":2,"cool":1},"rcXfLBHSCQuXlPSOcS-Mtw":{"text":"Food was sooo good that I completely forgot to take pics of it!  Had the gumbo, beans and ","useful":0,"cool":0},"TO5_XMyKcOWp6Us4F2ZFCQ":{"text":"Went here with my fiance while on vacation and was totally turned off after receiving my f","useful":1,"cool":0},"gqUETF2fwTJ2KXqjK7mcbA":{"text":"Rajun Cajun Shrimp was the deal. And it was good. The shrimp poboy was classic and perfect","useful":0,"cool":0},"uswTUqGtu8TAa7PAQDYn8A":{"text":"Came here for a drunk late night snack! Was pleased with the fried green tomatoes even tho","useful":0,"cool":0},"U70BBRU8rtdFaRlumqNiEg":{"text":"We stopped by for a late dinner. I wasn't too impressed. I bet the breakfast is better. Go","useful":0,"cool":0},"ck9Sxl9hURDu5S3okaxR4A":{"text":"A dinner with ok food.  Definitely better breakfast options in and out of The Quarter.  St","useful":0,"cool":0},"T2tsk00DBnlKqNMYP2ugsQ":{"text":"Awesome breakfast  and extremely reasonable prices.  Highly recommend to start your day of","useful":0,"cool":0},"NeW98k_36kO4rb_Xc18mPA":{"text":"Food was great! Will recommend this place to anyone. Customer service was impeccable. Juli","useful":0,"cool":0},"hOAooHAJxlhnyATvX219Cw":{"text":"Absolutely loved it!  We were looking for a late nite spot to get dinner and usually, that","useful":0,"cool":0},"OqfddPC6y-hZ7dDgpdJQlQ":{"text":"Gumbo is fantastic. Just the right amount of spice \n\nPo-boy was the best I've had in NOLA ","useful":1,"cool":0},"u__i2XDr0HXguApeOr7dMQ":{"text":"Stopped by for a cup of gumbo and salad. The gumbo was savory. I would highly recommend it","useful":0,"cool":0},"Xzkz5TdLbRQiOlo0tq6b9Q":{"text":"Seafood omelet and Cajun omelet were both great. For quick breakfast or meal, this place i","useful":0,"cool":1},"fYNP7pWPAsykbJiYwFnatQ":{"text":"It's a local chain. Not fancy at all as their slogan is \"nuttin fancy, just great southern","useful":0,"cool":0},"4g0djtk4V7A3-mIduxk6dg":{"text":"I would leave 0 stars if I could.  My friends and I thought that we could enjoy a lovely m","useful":0,"cool":0},"U4osiFQYuyHVa61ClH6jrQ":{"text":"This was our second visit to DD and we enjoyed it just as much as the first time. Bottomle","useful":1,"cool":0},"ExzXd0KQG61dDWBDrU4bjg":{"text":"Special thanks to Jamie  who made our dining experience awesome. Great conversation & Good","useful":1,"cool":0},"LMybtHSUJKvTjcC-OAK3GQ":{"text":"Amazing shrimp po boys, and bottomless bloody Mary's that are delicious. Nora is the sweet","useful":0,"cool":0},"BSMnhjkTDcJ-oKGqO8Zflw":{"text":"Fast, very friendly service.  CLEAN bathrooms .  We even caught a little show with our bre","useful":0,"cool":0},"zt0_Pkg2W_i93gghorukgw":{"text":"Being new tourists in the city of New Orleans, we are trying to sample local food specialt","useful":0,"cool":0},"5ToiYP3BLjb0tKEicHKRpw":{"text":"Very awesome place! We had to wait abit to get in, but well worth the wait! Bottomless blo","useful":0,"cool":0},"nkl45EuKpRrwGrltspH1dw":{"text":"This restaurant is a hidden gem!! Great food; good customer service; and \"comfy\" just like","useful":0,"cool":0},"S4kJr9_jSdXK8hDlO9BuyQ":{"text":"Earlier on this day we ate somewhere else that was overpriced and underwhelming, then we w","useful":0,"cool":0},"RY6pcoJ8-N_-dKf87wpQcw":{"text":"Place was pretty good, no wait so that was nice. I ordered the red beans and rice which wa","useful":0,"cool":0},"AMrL_zG_3tHNT5TSVRH8WQ":{"text":"Complete disappointment.  Staff appeared confused or had no experience as a server.  Sever","useful":0,"cool":0},"MdeZle6rRjGN40Lu8nundw":{"text":"I am from South Florida and I never had alligator tail before so decided to try that with ","useful":0,"cool":0},"Hbxsr10GCRTLsi3bk0o8ww":{"text":"Decided to try this place because it was right next to our hotel and it did not disappoint","useful":0,"cool":0},"guxl98ZUHERnTxsSDuXjAA":{"text":"Great Breakfast and sweet people. New Orleans was shutting down because of this so called ","useful":0,"cool":0},"PIrhLKQvCdBSyNCDCULWyw":{"text":"Food was really good.  Recommend the chicken Philly.  My wowdi said his drink was water do","useful":0,"cool":0},"oHtkAIao_xqO8L2gSUrLWw":{"text":"My burger was delicious! It tasted homemade with fresh toppings! Service was great as well","useful":0,"cool":0},"2P9KtA1LGcy5vgWHrMqyfg":{"text":"24/7 : breakfast, huge portions, tasty shrimp po'boy and an excellent gumbo;\nCLAMOROUS: an","useful":2,"cool":2},"_qLG605QfA8Bg-pMVYOP2A":{"text":"This place has great food and is in a convenient location. I've had the fried shrimp (good","useful":0,"cool":0},"MqLkfa00DhZ0-gibThTRzg":{"text":"Larry is the absolute greatest server- the service at this place is phenomenal and the foo","useful":0,"cool":0},"3ePd_QsgDsducn2eB9iiLQ":{"text":"Service was great, place was clean and food was tasty! Wings were very good. po boys delic","useful":0,"cool":0},"AlBKlKMZNBDU22pA11nzRw":{"text":"Gumbo is great as well as fried green tomatoes. I tried PO boy for the first time here and","useful":0,"cool":0},"Wl0GKnHBTXGRnQomWcPv3A":{"text":"The food is tasty. The wait staff is adorable and full of sassy personality. And prices ar","useful":0,"cool":0},"BmfyZEcZHDRa4qG-czfEvw":{"text":"Came in for brunch and it was packed so we sat at the bar. Ordered shrimp & grits and a Bl","useful":0,"cool":0},"m4oJn2amETR_exp45-AVGA":{"text":"This was a really good spot. I can't eat shrimp due to allergies so instead I had 2 pieces","useful":0,"cool":0},"bhXlfF9pvL4QglqV3D0Q4g":{"text":"This seems like the locals and tourists go-to. Cheap, and even better Bloody Marys! I have","useful":0,"cool":0},"DcDqOdxMiUjnzCM6y8hAVA":{"text":"I came to NOLA to drink and of course I want a good breakfast after at 2AM! Daisy Dukes ha","useful":0,"cool":0},"Nti3pDe-eRKJTK6rAeSLtw":{"text":"I liked it!! Great bottomless Bloody Mary.  If you read my other reviews you'll see my wif","useful":0,"cool":0},"Cq-JTXQVmYDGslEu1mFS8w":{"text":"Was in town for a statistics conference...with no food! My group and I were starving, so w","useful":0,"cool":0},"IdRMTVxh70smmnP63vT6bQ":{"text":"This was our first restaurant in New Orleans, so at first we thought maybe EVERY place was","useful":2,"cool":1},"N23zl-W7xKBefV02TcnqEA":{"text":"Perfect late night spot. A friend and I were ending our night in the French Corner and in ","useful":1,"cool":1},"GcfI3AwKnHmkVMCHAekCdQ":{"text":"Just arrived in New Orleans, and this was my first time at Daisy Dukes.  Absolutely amazin","useful":0,"cool":0},"e2XTGNi-RfHtvau3UT0Trw":{"text":"So yum!!! The bestie and I were hangry after a long drive in a disgustingly hot time of th","useful":1,"cool":1},"7vq2ZLFhI8LycYSsWAdfoQ":{"text":"Extremely poor service. Sat down. Waited over 10 minutes. Totally ignored. Several wait st","useful":0,"cool":0},"PcpABHZsXr_55Qo_N0w_8g":{"text":"This place is a nice breakfast place right outside the Marriott hotel by bourbon street - ","useful":0,"cool":0},"PxSLJqvSbsiLZteqt1Nw2Q":{"text":"This place is amazing. I could eat here everyday. We have eaten all over NOLA and this pla","useful":0,"cool":0},"C4oCxyrNwM7wrlf5QSL2ew":{"text":"We checked out Daisy Dukes after a later flight in from the airport. This was everything w","useful":1,"cool":0},"1GITym2zhmFGJkoVAtlasA":{"text":"Food was amazing. Bloody Mary was amazing. Over all. Amazing. Great service. Accommodated ","useful":0,"cool":0},"sFmBgXSORtJZOQsN81bbhQ":{"text":"The food is not the best. This is def drunk food, if you're looking for a cheap spot after","useful":0,"cool":0},"CoXKrA4glwv13CBxbD2-Yw":{"text":"Had dinner here it was a joke. Ordered shrimp and grits the, grits was like a bowl of soup","useful":0,"cool":0},"FZkfLFC-E043UDAywYB0Tw":{"text":"An unassuming little breakfast spot across from my hotel turned out to be my best breakfas","useful":1,"cool":0},"KyfKVS5d9CpydOT84fd78A":{"text":"This was our favorite place to eat after a night of drinks and fun! We stopped here twice ","useful":1,"cool":0},"TuOZ0h1RP6kkVs-cOXVA8w":{"text":"Great breakfast!! Fast and friendly service. There was a line when we arrived, but it move","useful":0,"cool":0},"1HF4VvWvQyW9--ey4wHiHw":{"text":"Valentine's Day:  we had a late lunch and decided on late dinner.  While walking past this","useful":1,"cool":0},"OPlXviLFmY8ncUsZ0SJS4g":{"text":"This place came highly recommend. The drinks were nasty. I ordered a mimosa and I spit it ","useful":0,"cool":0},"I6eaPChhyyGPW7iT933UDw":{"text":"I ordered the biscuits with sausage gravy. The sausage was cut up and the gravy didn't hav","useful":0,"cool":0},"HLNrNbJx9oC-hV0uVVIrzQ":{"text":"This is a small restaurant but the service is awesome and the food is outstanding. They of","useful":0,"cool":0},"D1mIm50Ke9obckj6-ZMD3w":{"text":"This place was recommended to us by a friend who had previously traveled to NOLA.  First c","useful":0,"cool":0},"BEslLCxWGVbu6gqhX4eu8g":{"text":"So glad we stopped in here instead of the spot we originally planned to go for breakfast! ","useful":0,"cool":0},"cXj3wICNuQcRuSchYeJHHg":{"text":"Was a late night in NOLA and needed some eats...so we decided to give this dive a try. The","useful":1,"cool":0},"3NGPRzxkWBjD4hSShGyQXg":{"text":"I got some late night pancakes delivered to the hotel that I'm staying at. They were yummy","useful":0,"cool":0},"-i0brGIZhSxeaVfzaSRXzA":{"text":"I love this place so much. NOLA has great food all over the place, but this place is 24-ho","useful":0,"cool":0},"HYfdIl2QKvWFtWr7RfTnTA":{"text":"We stumbled upon this place purely by accident, and oh what a find!!!!!!! It was so good t","useful":0,"cool":0},"LXVCDYfJxBn_UM_3FT_nJA":{"text":"If I could give this zero Stars I would. The food was unseasoned, the biscuit was dry, and","useful":0,"cool":0},"BLs7p7xtE8kRf4T1Qhzf_g":{"text":"DON'T GO HERE- If I could give less than 1 star I would. We went to this place about a hal","useful":0,"cool":0},"Fa26sa-vsiQJLdZH7tfo0g":{"text":"Staff was SO rude, especially the woman in the front. She told us we had to wait outside b","useful":0,"cool":0},"gzjO0tNSvzufAxEqlf5oKw":{"text":"The grits are SO yummy! They have the best customer service, the food came out very quick.","useful":0,"cool":0},"mssJeLTsqTOL-9oYcqjHnQ":{"text":"Charming staff and even better gumbo soup the absolute best gumbo we have ever tasted! We ","useful":0,"cool":0},"lozxDQZ-c-C8CB6i8g_FSg":{"text":"By far the worst dining experience I had while on my trip to New Orleans. The service is a","useful":0,"cool":0},"aaHm08SXmeN07YIyygSO3g":{"text":"Waitress was really nice and funny, shot out to Jayme. Oysters were extremely fresh. Blood","useful":0,"cool":0},"jgNgZU87sceDsPkzvzD4KQ":{"text":"I was vacationing in NO with my husband, my sister and her husband. I had shrimp and grits","useful":0,"cool":0},"4M1drHaNT5KdhoIXq-XYMg":{"text":"This is only my 2nd time in NOLA. My son and I spent about 5 days here last summer and doi","useful":0,"cool":0},"Jj9PCv7UMf-La2c5HDrGMg":{"text":"Came here on Sunday morning and as others say, there is a line outside, but it moves quick","useful":0,"cool":0},"dEnVVoJGTsACu5pGzsLL6g":{"text":"Listen. I did not eat here. You could probably do that and be fine, but THIS ISN'T ABOUT T","useful":2,"cool":2},"7mHoRg-1PDPpjm1fElUF_Q":{"text":"Delicious red beans and rice and fantabulous fried green tomatoes!!! If in NOLA.... this i","useful":0,"cool":0},"cdhLZtbIkMSqxavXtFx0Ng":{"text":"so this is the Daisy Dukes that I came to you for like three days in a row. The food is so","useful":0,"cool":0},"Y6VtiuqqRKt4YMb7iW61gg":{"text":"Not so bad place, but only if it is 4am and you're craving New Orleans food while everythi","useful":3,"cool":1},"NlSqsCwAh_oYldpUuQpvuQ":{"text":"Great breakfast food after drinking all day/night! I've only had breakfast here and only h","useful":2,"cool":1},"vveTMZwJkUFWHkSI28SJKw":{"text":"Loved the crawfish étouffée.  Great spot to watch the football game.  Service was on point","useful":0,"cool":0},"1C5YVsc2Xz67M6Z3QbLokw":{"text":"We had the Early Bird breakfast...2 eggs over easy, hash browns, bacon, and wheat toast. $","useful":0,"cool":0},"8d_umY61t1mRqkdjkgpFhA":{"text":"Gumbo is really good.  Fried shrimp, delish. Serious biscuits and gravy!  Had a bottomless","useful":0,"cool":0},"wKNHXV1fzd00niaA8Gvh-A":{"text":"We are here visiting New Orleans to celebrate our 5th wedding anniversary! We were looking","useful":0,"cool":0},"ifk_IdLvYQSgbdOt2cIKCw":{"text":"My wife and I went out for a date which is rare for us since we mostly do the family thing","useful":2,"cool":1},"kydoBEc0wuHpUe3N7IowZw":{"text":"I go to Daisy Dukes almost every time I have some free time in the business district. Thei","useful":0,"cool":0},"ZOQ2PPBYpyDlYmpK-ZPmFA":{"text":"Reasonably priced, small country diner type atmosphere. Staff were friendly and comfortabl","useful":0,"cool":0},"-B6gWws7hRB1zbrtwnRYmA":{"text":"Don't let the fact that you have to wait outside for an available table detract you.  The ","useful":0,"cool":0},"KUy5Ck6_fYMFElDZFfEtFA":{"text":"We ordered takeout from here and everything was really good. My husband had the catfish po","useful":1,"cool":1},"AfXVmXmW9m3uMF2Km10U2w":{"text":"Loved it! Stick to your ribs grub. Great taste, good sized servings and moderately priced ","useful":0,"cool":0},"3M_diBo0Yy8Ys9ouHCvaaw":{"text":"Breakfast here was affordable and delicious!  I went with the omelette and the biscuit and","useful":9,"cool":8},"8ZxoMzZdvHNW9r0qUqu5yA":{"text":"Our server was awesome and super friendly! She put us on to our new fave drink (forgot the","useful":0,"cool":0},"lXemIMWRC_lYT9w-1HvH5A":{"text":"5 stars for quick, cheap $2.99+tax breakfast! In & out in under 20 minutes. 2 eggs, hash b","useful":2,"cool":1},"7EMkE5bv0GLd2QWKpqhWJg":{"text":"Basic breakfast with a Nola flair.  Very good value, good for families, would highly recom","useful":1,"cool":0},"fHClds7JaPPZw6njyMdBFA":{"text":"Dude this place rocks. Do you want to spend $20 a plate for a stupid a$$ hotel breakfast o","useful":2,"cool":3},"oYbXtGFPvzsTyeiz7lt3jw":{"text":"We came here and we really wanted to dine in so we sat down and ordered but once we realiz","useful":1,"cool":2},"ScODEc3EshJjwEGcu5y2PA":{"text":"Worst food I've eaten in New Orleans. Overpriced, too. I do not recommend their food, it t","useful":0,"cool":0},"wd8phIF_OokA2HLEhRKEIQ":{"text":"Came here when Jimmy J's was too crowded next door. It took a while to get seated but ther","useful":1,"cool":1},"Ciux9a6V97Afo7qg1V-bOw":{"text":"CAN YOU SAY BOTTOMLESS BLOODY MARYS!! My server Shelly at the bar was the sweetest thing. ","useful":0,"cool":0},"VwW7WRVLfxKrslRkeLUi1A":{"text":"Great place, staff was friendly right down to the busing staff. We had breakfast around 12","useful":0,"cool":0},"26HkGjxNp3C0ASXH-t70uQ":{"text":"The gumbo, poboy, fries and shrimp and grits was the best! I'm here on a business trip for","useful":0,"cool":0},"kjdrCgoCsfuMJ-R85a602w":{"text":"No, we won't be returning based on my first review. Ther service was not up to par and the","useful":0,"cool":0},"ptlVfU_V08I4fPICsSFwqQ":{"text":"Oh My God, they deliver, all the way to your hotel.  When it's 90 degrees outside and it's","useful":1,"cool":0},"sDQpRIcmoJHMPzpK-B0TCA":{"text":"You MUST try the shrimp and grits!  This was my second time here and both times were enjoy","useful":0,"cool":0},"2fZkNCtYYmnv5g-fzn3xfg":{"text":"The food was pretty good. We got the biscuits and gravy which did not disappoint. The serv","useful":0,"cool":0},"Mvd2ioIGg7LcBpOuc0UTNw":{"text":"This is my favorite off the beaten path diner in New Orleans.  We kick off every night wit","useful":0,"cool":0},"G6eUnqa3HE1lOET7PT7lRA":{"text":"I went to this joint for breakfast during COVID and found my experience entirely underwhel","useful":0,"cool":0},"QL6DEJcrhTmJKUYE2Er2aA":{"text":"This little gem was a marvelous find!  The interior is beautifully decorated with exposed ","useful":1,"cool":0},"RQs0cMb_02xNd1GGod4MlA":{"text":"Excellent choice for home cooked breakfast! You must try the seafood omelet and the gator ","useful":0,"cool":0},"yBftxKFJ2AOkYQMQmX5-pw":{"text":"Waited an hour and 30 minutes for cheese fries. No one will give you the time of day, no m","useful":0,"cool":0},"snd2Ey7nXlAsp4nERon3qA":{"text":"I was in NOLA for 3 days and visited Daisy Dukes three times!!!  Great food and friendly s","useful":0,"cool":0},"Z8BMcqVGGOmhUPz5fOf5ew":{"text":"Just arrived in New Orleans, and this was my first time at Daisy Dukes.  Absolutely amazin","useful":0,"cool":0},"IjtTwX-hKsVaShuJu_aaoA":{"text":"So when you are drunk you want something delicious to eat and you don't know where a Rober","useful":3,"cool":3},"eZt6LNRnoFj4krthmllWAw":{"text":"Don't bother. Poor service. The first waitress walked away from me mid sentence. They deli","useful":0,"cool":0},"aJiZyQcZkMMXNyqy3yHNkg":{"text":"With so many options in the French Quarter, Louisiana, we came here for breakfast . I orde","useful":0,"cool":0},"wifb7hlwK7gcdr5m6Hb8xg":{"text":"The pancakes here are to die for!!! If you think you ever had good pancakes from somewhere","useful":0,"cool":0},"KHMVzzqSoL6ZANTnTF5i2A":{"text":"Hit the spot after 6 days in New Orleans.  Something for everyone and delicious.","useful":0,"cool":0},"-M8rrXFwXIy_N0HNTc-Wbw":{"text":"Great early bird breakfast special, cheap and excellent food. Staff was extremely friendly","useful":1,"cool":0},"zFRz4IsvDCQFvJ79M4hK5A":{"text":"All you need to know is that Daisy Dukes is 24/7 and they serve breakfast all day.  You kn","useful":1,"cool":1},"4KdNmOcSpadhCvdJ3Zy6Dw":{"text":"Thought the food was really good and went there a coupe times as the prices are pretty rea","useful":2,"cool":1},"7BAaH07mpayy0KnNFrLxtA":{"text":"Looking for a place to enjoy breakfast, lunch or dinner with great customer service? Here'","useful":0,"cool":0},"6M6Y60HPwYBcarej6cFDTw":{"text":"Staff here is the best. Stayed next door for 3 days and ate here every morning. Great food","useful":0,"cool":0},"a3eu8PPRYUfg_8viyLfE3A":{"text":"I love their spicy gumbo. The portion size is great and the taste is like no other! This p","useful":0,"cool":0},"80oI7EwM7nP7oo0d1kl8-g":{"text":"My husband and I visiting Fort Lauderdale stopped at this famous place for breakfast and w","useful":2,"cool":1},"fXUUwajkQj0DtpQsLg8tvQ":{"text":"I have to say that the service here is 100% HORRIBLE! I wish I can give NEGATIVE 5 stars.\n","useful":0,"cool":0},"9veqToLUT7OifnUVlCCL-w":{"text":"Probably one of the better meals we ate in NOLA. Doesnt look like much on the outside but ","useful":0,"cool":0},"O9xUA6Hk5-I1O8rKKbHqog":{"text":"Save your money or just hold it a little longer and walk to a different location. Horrible","useful":0,"cool":0},"-p2QviveCWrc7PfbnsNFvg":{"text":"The best food and atmosphere I've ever experienced. The food is diverse. I got a pizza and","useful":0,"cool":0},"xW2HeixFvwg1YfbrqujgzA":{"text":"Ordered the early bird breakfast special. \n\nThe pluses. The staff is incredibly friendly. ","useful":2,"cool":1},"zJ8-W80NqP35wbWvQMfMzQ":{"text":"Nothing fancy. But it's a decent 24-hour establishment to catch a meal. Came here and got ","useful":2,"cool":2},"wi8EC8FFghjwVsY2QfvOEQ":{"text":"Conveniently located across for the Marriott, This spot is great for late night dining. It","useful":1,"cool":1},"-YmTZwX-QyRdUJm0JSXYzg":{"text":"We went to this place at 2am because nothing was open and they delivered. We ended up walk","useful":0,"cool":0},"5ZXBdy00pjQkisV0F8Z4GA":{"text":"Found this wonderful place because our first choice was closed.  Pamela was a very friendl","useful":0,"cool":0},"3etPN45CGOTzOY8hggsSjQ":{"text":"Service was great, place was clean and good was tasty! Wings were very good. po boys delic","useful":1,"cool":1},"9_GAn7UFSSrw2Y1ZSKqlJA":{"text":"Daisy Dukes was located very close to the hotel I stayed at. It's very convenient that's i","useful":0,"cool":0},"jvDeTpFe9CV5ka2khgqy9A":{"text":"Ok. I'm in New Orleans today. It was snowing earlier today and freezing! The driver guy re","useful":2,"cool":1},"3zPnmqpiR3922_xfg6WvbQ":{"text":"Daisy Dukes has great food and a wonderful staff. We went twice on a short trip to New Orl","useful":0,"cool":0},"h4d3Y6x-01FU8ZG7Gt3QhA":{"text":"Seriously impressed with this little hole in the wall in NOLA. Great customer service, hug","useful":6,"cool":2},"Y1CggBmB9VtGyJ6grLQoQQ":{"text":"Daisy Dukes was one of the first places I ate at when visiting New Orleans back in June of","useful":10,"cool":6},"8JXD3FjtxkKgyECb5Tb5Ww":{"text":"Thank you to Daisy Dukes and Yelp for the check-in offer.  Free cup of gumbo for me!\n\nOrde","useful":4,"cool":4},"anOZbOUYTUc_KzXFLdfh1w":{"text":"Just a good greasy spoon restaurant. Great portions. Will come again! Most of us had break","useful":0,"cool":0},"0U_QbzpCh2BanfuLJfi-kA":{"text":"Wow! Great breakfasts at a very reasonable price. Service staff that pays attention to you","useful":1,"cool":0},"ApwcB39GelyIigRVq250fw":{"text":"Food was tasty and great value . Had the eggs your way and they were great .\nKids pancake ","useful":0,"cool":0},"hcKdsj0n09hD3_c3BVERnw":{"text":"I came here with a group of 7 while visiting New Orleans. The line was pretty long but mov","useful":1,"cool":0},"uVTyG8QEUHr-8vplCkBnzg":{"text":"First time in NOLA. Tried this place as a recommendation and can't say I hated it or loved","useful":2,"cool":0},"B2aY_i1ki_rMWI4XwQwWVA":{"text":"Over priced and extremely mediocre drinks, also mediocre food. Our server was a sweetheart","useful":0,"cool":0},"5G8wYosTUEELP4NIQhkU2g":{"text":"One of my favorite places not NOLA!!! Food is amazing ! I had shrimp po boy and of course ","useful":0,"cool":0},"5U9CEEFgeYd7AzskZ8lEVg":{"text":"I had the shrimp and grits and bottomless Bloody Mary. The grits were very creamy and the ","useful":0,"cool":0},"sgjxdK1wk6TQPAKpbEJyLQ":{"text":"Went for a late night dinner, didn't have to wait for long, but was escorted to a side roo","useful":0,"cool":0},"5u6cEB59jZulLUF32u0NZQ":{"text":"This should have been updated long ago. The manager was so kind to comp my next meal here ","useful":0,"cool":0},"aXFjtSMLDGh2-RcuAcqJ5Q":{"text":"The perfect place to eat after a night of drinking on Bourbon street. I got the alligator ","useful":0,"cool":0},"df8sF1w5JCzz5-WO9MGdRg":{"text":"Ate there last night, had the crawfish ettouffee and gumbo, which were both delicious and ","useful":0,"cool":0},"bju_Hwot6M3ZTqM3_Vvzsw":{"text":"There was a party in mouth and I was invited! The food was excellent! I don't need to say ","useful":2,"cool":0},"Agbh4-ttM_K32Qgf4W7kPw":{"text":"Found this gem walking New Orleans on vacation and I have never tasted grits this creamy a","useful":0,"cool":0},"jCkzNm0OAAKopCS7DuIgHA":{"text":"Stopped into Daisy Dukes for lunch based off the reviews and was pretty disappointed... Fo","useful":5,"cool":1},"YLZM8koFmKRxmpCc10ViOQ":{"text":"After eating lots of rich food in NOLA and local dishes we had a longing for a great burge","useful":0,"cool":0},"b36TqHjN1r217_667hy-yA":{"text":"Found this place right across the street from my hotel and since it had a pretty decent am","useful":1,"cool":0},"-NK6Vwi3elliv2fYG_1Q7Q":{"text":"My husband and I ordered an appetizer, which came out pretty quickly, but then realized ou","useful":0,"cool":0},"axqfzht8yWiaKUIQ5S6IMQ":{"text":"I stayed at The Quarter House and Daisy Dukes is a few doors down. I absolutely LOVE the f","useful":0,"cool":0},"2K2J77ejEV9AG_nrEOt1QA":{"text":"We've been to Daisy Dukes a couple of times now. They never disappoint. Great food & servi","useful":0,"cool":0},"4uRpb78egw5Tmq5VxDFxUg":{"text":"We needed a quick brunch spot on a Sunday morning before heading to the airport. All other","useful":1,"cool":0},"7YhY0Eti59yrsBAOMjSqVw":{"text":"5* Food and 3* Service. The food here was great. The chicken tenders were very fresh and s","useful":0,"cool":0},"rhlaWzEKGHhYUIhBHj2Uyw":{"text":"I came in hungry but walked out stuffed. After a night of maybe a little too much drinking","useful":0,"cool":1},"1KeK0DqDe93dzHm1LMoiNA":{"text":"Got here for late lunch.  The cat fish po'boy was spot on.  Service was OK and drinks are ","useful":1,"cool":0},"1DVW26YC27PwQTCl36yk-w":{"text":"Good place for a quick bite, but let's be honest a place called Daisy Dukes is not going t","useful":3,"cool":3},"wG26iCVCqDeKE6DCIE1CTA":{"text":"Didn't know where to go, so this came up as a great place to go & my goodness I'm so happy","useful":1,"cool":0},"B-HWdf1Lj2FMNn5tTnJTgQ":{"text":"Fantastic Place. The Food is Top Notch I had the Ultimate Meat Lover Omelette. It was deli","useful":0,"cool":0},"Q6OV8YrV4BWFC3JBW63exg":{"text":"Had an Omelet here on March 4th and man was it DELISH! No dissappointment!","useful":2,"cool":2},"k3Hoqq22E8ldOwD7m0uBmQ":{"text":"We had breakfast at Daisy Duke on Tuesday Feb 11, 2020. There was a leak in the roof. Drop","useful":0,"cool":0},"_ztftvYX7xWUaZrPwne7TQ":{"text":"What an amazing breakfast place, my usual place was closed because of Covid, so I gave thi","useful":1,"cool":0},"FwoIyAFYqTvVEU2RoFiQjg":{"text":"Had the half Shrimp Po-Boy and a cup of Spicy Gumbo, it was amazing! This was the second N","useful":0,"cool":0},"8LlAKnJmlzCrIYNMNtwi6Q":{"text":"One of those head scratchers for sure!!  Daisy Dukes is somewhat of an institution in New ","useful":14,"cool":9},"Y6zNI-1vRWFsr_n9jFg9gg":{"text":"My travel companions wanted some pancakes and this restaurant was recommended by a good fr","useful":0,"cool":0},"tp6fPvBa1xk-UT9PH1LD8A":{"text":"Great late night diner. Variety menu, friendly staff. the waiters name was Kaiser, that wa","useful":0,"cool":0},"VrcZA66hYp8Yfga7f6Oujw":{"text":"Loved the customer service from our waitress. The drinks were really good as well. The ove","useful":1,"cool":0},"RYuhsGXTGAnIetUxJv2_6A":{"text":"My review might be slightly jaded after going to Mothers (as in evil step mother)  but i d","useful":5,"cool":4},"MyRAKVYiznbkZPp95IDXYQ":{"text":"Why look.......an amazing 24 x 7 restaurant that serves alcohol in New Orleans!!!!\n\nDaisy ","useful":3,"cool":3},"b2abTkfL1LpDitMdJ9oXDw":{"text":"Been here quite a few times. The food and services is always the same, good. The fried gre","useful":0,"cool":0},"gXYZHtmCjScjgBNvAMdjqw":{"text":"Great New Orleans style breakfast! This place was located a few blocks from my hotel when ","useful":3,"cool":3},"s3zjPik8sfl3BDGYL6QGRQ":{"text":"In town visiting and thought I would step in for a bite to eat. I ordered the blackened fi","useful":1,"cool":1},"aNRcmVe7c8gH6FKEDZtlwA":{"text":"Cute little spot. Food was pretty good. Our server could have been a little better. There ","useful":0,"cool":0},"3MzbyCzXhMy5fvxji7UBjQ":{"text":"My experience was quite poor. I had received a recommendation from from the Omni hotel nig","useful":0,"cool":0},"9XKiSZw0Cw3TOa1fghieKA":{"text":"(Visited Jun 8, 2016) My husband loved the name and was excited at the possibility of havi","useful":0,"cool":0},"4U9WZBw9iWLetnHpJnZ2bg":{"text":"We wanted a casual place to eat after our 8 hour drive.  There are 3 different locations f","useful":0,"cool":0},"9MD0kiEX5eZ6KYyTRyZ3Qg":{"text":"Mimosas\nShrimp & grits\nGreen fry tomatoes\nWe enjoy the good food\nService was good\nWe come ","useful":0,"cool":0},"qy7oCy5TTCCRJ-1RplD7jQ":{"text":"Shrimp and Grits that's all I have to say. Creamy grits with a Cajun shrimp sauce deliciou","useful":0,"cool":0},"hGZifAtzRJ-DYiceadS8GA":{"text":"5 Stars is for the bottomless Bloody Mary's!!!!!!!!!  The food, service, location everythi","useful":9,"cool":8},"j_1j5DCxGPijH6iRKA64HA":{"text":"Came here a few days ago with friends in the evening. \n\nI ordered the gumbo and it was too","useful":1,"cool":0},"mAn7pQ2uyhl04W8KRswyMQ":{"text":"Ok so we was heading to Jimmy j And they was closed so Daisy was next door. So we went in ","useful":0,"cool":0},"Betc0B_4NCvurO0DXX6GSg":{"text":"Best gumbo in the city. Hands down. On my first trip I had the shrimp po boy and gumbo whi","useful":0,"cool":0},"2kWn1JgUNezjyIggIuOQyA":{"text":"The food is good here and they make good grits but not all of the staff is wearing masks a","useful":0,"cool":0},"9jyFCr2HYUeVGNQXPa-0LQ":{"text":"Great food and service....however STAY OUTSIDE UNTIL THEY COME GET YOU!! If you go inside ","useful":0,"cool":0},"o0BLT5yURTORuLKvljdbNg":{"text":"Delicious shrimp and grits, flavorful and spicy. The wait for a table wasn't to long, mayb","useful":0,"cool":0},"nXawkwVB-27nwORp8akkJA":{"text":"Excellent service from LISA!!! Food was great and they were very accommodating to our larg","useful":0,"cool":0},"ODqqt1miNm1l7JRvwnHO0g":{"text":"Its a dumpy dive type of diner. Now the breakfast and nola foods are pretty decent and I e","useful":0,"cool":0},"yrdHkgEqWo9nT4qaZ0IUnA":{"text":"Outstanding breakfast, and fast and friendly service (thank you Pamela).  We will definite","useful":0,"cool":0},"vUq1IxXauLyFhKoC_K9ouw":{"text":"Endless bloodys. They're ok, ask for extra spice and garnish. The best part is they're end","useful":0,"cool":1},"akkDek8TNe2MDyxHcMAgkQ":{"text":"have you ever vomited right after you ate? well, my husband did here. shortly after that i","useful":1,"cool":1},"uHFiRgQ_VUeXKiM4uttr5A":{"text":"Great quick breakfast. Cheap! Cheap! Cheap!  Service could not be better. Friendly and fas","useful":0,"cool":0},"0sZ8TpZXO3ljjvejs5_Jsw":{"text":"Girls Trip and decided to spread the love and supporting this business.  Disappointed that","useful":0,"cool":0},"w2U9lvcnqq3ZuRTHpymI8A":{"text":"We order 4 meals and one had a long hair, we immediately told the lady and she took it bac","useful":0,"cool":0},"AuRoY1gmCciGteWM5ZJv8A":{"text":"I ate here on my first night in New Orleans after walking around for an hour finding a spo","useful":3,"cool":2},"j1UktdWFviAuMdZvX3LHbQ":{"text":"Not very attentive staff, food was sub-par.","useful":0,"cool":0},"4VKLUwmiCHL0c0EeW6JtRQ":{"text":"I can not say that I was a fan. This place needs a good cleansing from top to bottom. My f","useful":1,"cool":2},"ugsv1Nub60X6eSnJbTIvAw":{"text":"Great Cajun food with a decent prices. I got the Pork chop platter and I'm not a big fan o","useful":0,"cool":0},"J5ptrTbVG-ecxR2CCLcHig":{"text":"We were on vacation and absolutely loved this place. We ended  up going for breakfast and ","useful":0,"cool":0},"fgE9LEHfIedoc8-d13Kc3g":{"text":"I'm in home in the big easy & just made my first of many fine eating moments here. Daisy D","useful":0,"cool":1},"JVkXRiD1-wCn3KI1dK12VQ":{"text":"I don't know if I like this place so much because I'm always at least slightly intoxicated","useful":1,"cool":0},"MPBj7K3FwpFqYZEhJxsDWg":{"text":"Humongous poboys! I had the Hot Sausage and it was pretty spicy.  It wasn't amazing but st","useful":0,"cool":0},"2_GOnykKkw7o-ZDgJ_jKvQ":{"text":"This was the first place we got food arriving off our flight. This place is open 24 hours.","useful":2,"cool":0},"ERdtYAY3LtRbfIHJC9gSng":{"text":"We arrived here about 10am after another breakfast was at capacity and didn't want to wait","useful":1,"cool":0},"Jl9kRf5jAZR7a9G2Erf3NQ":{"text":"Update a little disappointed couldn't get my shrimp and grits to go kitchen was busy. Conf","useful":0,"cool":0},"EEF81jPJBYN56w9KveY6zQ":{"text":"Like some of the others, I stumbled into this place! Thank. Goodness. This place was soooo","useful":0,"cool":0},"PaWN9CdG5k-M_vRk3Yo8iw":{"text":"Seating service was quick, ordering was quick, serving the food was prompt. Servers were a","useful":2,"cool":2},"aYjkeTELobhuzZ8vk-q5pA":{"text":"Unlimited bloody mary's for $12??? You drew me in with your temptation!  Our waitress was ","useful":1,"cool":1},"bKXN82QW2-zATkCdrX-0Dg":{"text":"Stopped in for breakfast and we were all satisfied with the food southern breakfast. My fa","useful":0,"cool":0},"8MoT2SzuU5lDzq2Po23zQA":{"text":"Considering crawfish aren't really in season anymore they were pretty good. I just couldn'","useful":1,"cool":0},"WoaLXPQ5dHspg55ErJcb1w":{"text":"Daisy Dukes is a hangover recovery center.  That is where they excel so just go here for b","useful":5,"cool":4},"CWxICHe-100u2BczD_WuYg":{"text":"Not a bad place to eat.  Free bloody mary refills caught my wfie's eye so we stopped in.  ","useful":0,"cool":0},"ITp9wjQlaap2l-mQWOJMpQ":{"text":"I have to admit, my friends and I wound up eating here when our first choice restaurant ha","useful":0,"cool":0},"ZtRgxwS0XHakwdsHQZNhMw":{"text":"What a dump! \n\nWas in town for the holidays; up early and stopped in for an early 5am brea","useful":1,"cool":0},"7ZPwO97Uuu8cUEBDtmPVgA":{"text":"We arrived in New Orleans on Thursday around 11am after a cruise. We were all hungry and w","useful":0,"cool":0},"iK6WEUrpAfobEHSOjyEgqQ":{"text":"I went from ACME oyster (5*) to this place for an late night meal.  Horrible experience . ","useful":2,"cool":0},"HiOyCtbnzu9bWG7Hi6ahlA":{"text":"Good restaurant with some awesome New Orleans staples. Our server was friendly and attenti","useful":0,"cool":0},"1GCJAWDRYn9jY2llgxRjkA":{"text":"Great gritt, great Cajun omelette , biscuit , Bloody Mary is da bomb!!!!! Free refills of ","useful":0,"cool":0},"_AK1roK02a-lFvnKpyWZzA":{"text":"Found this place after walking around New Orleans and decided it looked pretty decent and ","useful":0,"cool":0},"3x42Si58lQnUx_T-x66-YQ":{"text":"We visit New Orleans from Florida very often. While here, we always have at least one brea","useful":0,"cool":0},"HrHWWBa9zRiN9Edp6l7PFg":{"text":"Wonderful food and exceptional service.  My server Juuti made me feel right at home, and k","useful":0,"cool":0},"Yt_MHb5JL5MkRbuGKUZoJg":{"text":"This place has been wonderful! Their prices and food are amazing! Not to mention the conve","useful":1,"cool":0},"6lKL00gAOr_-p4ITqXmQiQ":{"text":"Our flight landed around 1am we got to hotel dropped everything off and asked our concierg","useful":0,"cool":0},"IbW6veBUkaJ2UHVOvgveRw":{"text":"My favorite gumbo in town is Daisy Dukes's gumbo from this location.. a cup of that with s","useful":0,"cool":0},"U7fW3R8pHcYhSytfBnUebQ":{"text":"We were hungry and didn't want to wait in line and Daisy Dukes was in sight...  The food w","useful":0,"cool":0},"6HQ0d3FNs27EgoJX3vD4sQ":{"text":"I was as happy with my server as I was with my food. The location combined with a great (a","useful":1,"cool":0},"hS_0eX4rtCsy-ANi4ZKryg":{"text":"During our trip to NOLA we stopped by here for breakfast one day. Very casual dive-y spot.","useful":2,"cool":1},"Nih6BtM_aP_9k-WzfwPPAw":{"text":"We were looking for a place to have a burger and came across Daisy Dukes.\n\nWe saw it was r","useful":1,"cool":0},"B5VzmvyhThGG8RywWe08QA":{"text":"I have been in the city for 5 days with my husband as he works (and I eat ‍‍) and this has","useful":0,"cool":0},"2xEaBmojDsWPOT6o_SzAUw":{"text":"Don't bother.  I ordered oysters on the half shell and they were so bad I had to send them","useful":2,"cool":0},"NbB3xoB4_aAa1s2nsaRmhQ":{"text":"When I visit New Orleans I try to make sure I stop by this place. I love their breakfast a","useful":0,"cool":0},"Jei0_yHbfGIEb8t0XARd3Q":{"text":"Went for brunch with the family. Not very good at all by any standards let alone New Orlea","useful":1,"cool":0},"Le6Nx79s0iIhBcSg1d76_Q":{"text":"Listen I'm not going lie for a late night 24 hour spot this def hits the spot. If you arou","useful":1,"cool":0},"7pFExF6H-rkBorNCHh4Ikw":{"text":"This was the first place we stopped to eat while in the NO.  It is across the alley from t","useful":2,"cool":2},"WlClgiMs5hygkXJGV_yh4g":{"text":"Decided to stop by since everywhere else was busy and they had plenty of seats. Ordered th","useful":0,"cool":0},"jKc0gri7kZ5HgI000os1Pg":{"text":"A great way to end an exciting weekend!! This little gem is located right next to the Marr","useful":4,"cool":2},"YzHbQi46_KuNH24bUDyXlA":{"text":"First time here and the sign in front of the empty hostess stand says, stop, wait outside.","useful":3,"cool":0},"wlBrFCJ0yWwUdER6Bs2MuA":{"text":"Lisa was phenomenal great customer service.Knew what to recommend on the menu and it did n","useful":0,"cool":0},"GQz2MZfXNR7izm8ypQtNoA":{"text":"so im hunrgry last night before i decided to hit the streets. i yelped this place and and ","useful":1,"cool":1}}