{"fQ2m1Uft_eJ1QTZQHl7DAg":{"text":"From Grilled Redfish to Stewed Rabbit, this place serves up great local food, that is as i","useful":2,"cool":3},"83JG4B2k1GvfYZa6CCWxzg":{"text":"We went today, and I had the seafood platter ($19.95). It was pretty good, and they gave a","useful":1,"cool":0},"fRISMrb8PXARKDV42COwRw":{"text":"I regularly eat at Deanie's since I work in the area. I've rarely ordered off of the norma","useful":3,"cool":1},"66prbYuvEhlcjPxwai0-LQ":{"text":"Off the track of other restaurants, I found this one by referral. I was pleasantly surpris","useful":2,"cool":0},"A3pSjyULJZOdSwxvQuyQ2Q":{"text":"I have never been so uncomfortable in a restaurant in my life. The food was sub par. I ord","useful":2,"cool":2},"IUU6GB7UfC4o7sMpFeclaQ":{"text":"Had the \"Show Boat\" it was was pretty good!! The inside needs to be renovated but food and","useful":0,"cool":0},"SwsZ9oBD6XZzGFkA6Vs2kg":{"text":"This place is not closed! \n\nFrequently confused with the other Deanie's restaurants becaus","useful":8,"cool":4},"pS3ZYKPW2NO5X-Q9A9iTlw":{"text":"Can you say best Gumbo??? I can! This is one of those places you will never get to experie","useful":0,"cool":0},"mALnQrL9vaG5-dvdvRy-wg":{"text":"Had lunch at Deanies on Hayne today and it was fantastic.  Our server I believe her name i","useful":0,"cool":0},"yP4IBZnVJHeYjvWsbQ11OA":{"text":"Wonderful seafood, just like you would expect in New Orleans. Place was clean, the only dr","useful":1,"cool":0},"JBKufzV_YUajcDyeQDELNQ":{"text":"The best for local New Orleans food; been going here for nearly 40 years. Note that this i","useful":2,"cool":2},"kyOI8d-kFRkretASF7r8BA":{"text":"Local flavor in every way. Our waitress made sure we got the local favorites which were de","useful":1,"cool":0},"NZx7D2BQb4_1b1Lix_cudQ":{"text":"Felt great to see a restaurant from my childhood still open !!!! Food was as good as I rem","useful":0,"cool":0},"MrurMCZWLCsteX6WO7Z4CQ":{"text":"The food and the service is great! I enjoyed the craw fish and sweet bread...mmm!","useful":1,"cool":0},"U-ExYZEk52E9f8H_8A5YSA":{"text":"This place SUCKS! The waitress was awful. The waitress mentioned Jasmine tea during orderi","useful":0,"cool":0},"idOeh8VshEA7F7zlBeTmxQ":{"text":"Food is great!  Had boiled crawfish, seafood platter, gumbo, and oyster artichoke soup. So","useful":0,"cool":0},"cGPpfM0Oh406oFXsr3W1aw":{"text":"Great place. Po boys are great, close to airport and makes it easy for us corporate pilots","useful":0,"cool":0},"d4B0kMz9z2KbwqedvfNK3A":{"text":"This is the best Deanie's -- apparently not related to the others. Go here for an unpreten","useful":0,"cool":1},"plfpJdzkM5bOwt9xlFtOtA":{"text":"Havent been here since I was a kid living in the East.    Everything was excellent: obviou","useful":1,"cool":0},"x39kcS5gvvgPpf0YdJLS9w":{"text":"Food is awesome and the bread is the right texture I have shrimp or oyster po boy sandwich","useful":0,"cool":0},"DecV-EQrQ8equZ0a__xj8Q":{"text":"Do not get the place confused with Deanie's Seafood in the French Quarter. This deanie's h","useful":4,"cool":2},"Us1VV-Y5gMe2r6dsmgPvcQ":{"text":"Great service. Friendly and helpful with recommendations. The trout was great. Fresh and t","useful":2,"cool":0},"f7bCk2mATIKMAM-Ly1ZEOg":{"text":"This place has awsome food with huge portions I had the jack leg chicken it's jambalaya wi","useful":2,"cool":0},"L61gK1lDCa9wCPj6K8KO5A":{"text":"Fantastic lunch menu!  Shrimp Creole was very good.  Three stars for being out of a lunch ","useful":0,"cool":0},"0vIFUn5iIk74e1vmGF06fg":{"text":"Crab Three Way is incredible!!  Crab Bisque, Crab Linguini and a whole Soft Shell Crab wit","useful":2,"cool":0},"--HR828qO-SSsjgU6Fo87A":{"text":"I love a simple uncomplicated restaurant. I personally believe that time should be spent o","useful":0,"cool":1},"fmefzRlgzz7olzpsKWxnIw":{"text":"some old school new orleans up in here.   great solid food, tasty, and filled with a simpl","useful":4,"cool":1},"rUl1SkVB8TIoelx1ioeqyQ":{"text":"Fish was not seasoned and batter didn't stick, so the breading just fell apart. The macaro","useful":0,"cool":0},"jL0-WoTe-RRziqHhb7j2SQ":{"text":"Just ate dinner there very good excellent food Good portions and great service  Prices are","useful":0,"cool":0},"7x5Uq8hnU15U16GSgQK9vQ":{"text":"This is a gem of a restaurant with a long history in New Orleans. The food is great with r","useful":2,"cool":3},"N1Wulmjea8lEDO066bR2qA":{"text":"Excellent fried soft shell crab. Friendly staff, a little off the beaten path but definite","useful":0,"cool":0},"388dnsSCVbAh8lR5iJnCWw":{"text":"This is a terrific place to eat GREAT food. 10 daily lunch specials plus regular menu item","useful":1,"cool":0},"vtSGSNtzalmsWC03hz4vxw":{"text":"Visited this cozy spot during my stay in NOLA. Everybody there makes you feel right at hom","useful":1,"cool":0},"u9XesR19gf9KiGgXYF2-jQ":{"text":"Great spot on Hayne Blvd. revisited today after learning that the Walnut Room Is closed. T","useful":1,"cool":0},"w70YS2b-3Xxsn5csp3m7QA":{"text":"I love everything about this place. Its off the beaten path a little but worth it. Definit","useful":1,"cool":1},"iI782_Zspdcpv6byl-8vzA":{"text":"The chargrilled oysters are to die for. They have $.50 oyster happy hour as well. The prim","useful":1,"cool":0},"2Oano3t8xKB0PGsbtO0s1g":{"text":"Great reason to visit New Orleans East. This restaurant is great for dine in and carry out","useful":1,"cool":0},"E61E1vYzYuZ43UWQwwkYCA":{"text":"The food was excellent, the service was beyond great, and the food was very reasonably pri","useful":0,"cool":0},"-ULUNA567LwZuRwTrjbq1g":{"text":"The Best Louisiana Seafood in New Orleans !!!\nLove the Crab Cakes, Stuffed Shrimp, Boiled ","useful":0,"cool":0},"l4idGQ9EOpXGHW8pVqyqEg":{"text":"Deanie's was actually our second choice after my friend's go-to seafood joint on the lake ","useful":2,"cool":1},"ajZQ_83N7Sst5Lvf4t4fOA":{"text":"Best surprise in New Orleans!!! The bring potatoes to the table with your drinks (instead ","useful":0,"cool":0},"y457StHXKe0hj0JvMfGbZw":{"text":"Haven't been here in about 20 years! Would always pass Deanie's but thought they were clos","useful":1,"cool":0},"KfhGX_b7Y7oXASJ7RfxfIw":{"text":"Stopped in for a very affordable lunch. This is what authentic New Orleans food is. New Or","useful":0,"cool":0},"kHlvuDWYGRQTL63ne99x-Q":{"text":"Great fried catfish and baked macaroni special. Affordable and quick service. Very clean b","useful":1,"cool":0},"oFEwnvUMesY1ju7J0SHdVA":{"text":"Stopped in for an under $15 lunch had a chicken Parmesan and a side salad with a fresh gla","useful":0,"cool":0},"12nlZTAmTNjPqZK2liuj2g":{"text":"I felt like I was at home here. Food was delicious and staff was very inviting. Will be co","useful":0,"cool":0},"swyTLFZ5s0MkbeSy9xAKIA":{"text":"I live about a block from here and I order from time to time. I thought I'd try it since i","useful":0,"cool":0},"KHAwsNMBDyHLWb57fTxryA":{"text":"Great service and food! They have a great everyday menu with changing specials daily, ALL ","useful":0,"cool":0},"DXrRlnrwjuZDyubXE0QHOQ":{"text":"I've eaten here a few times. I usually order to go. The food is delicious! I can't complai","useful":0,"cool":0},"D592z6tk_y87ezQeHKk-eA":{"text":"My mother in law always talks about Deanies. She's a NOLA native who now lives in San Anto","useful":1,"cool":1},"sKOh2RTu7yA0zJavbua7-Q":{"text":"The food and staff is way better than the other Deanies location.  The daily lunch special","useful":0,"cool":0},"EzPjC_66mDMgESLQJJ60EA":{"text":"The customer service here is great.  It is a very intimate little spot with carryout and b","useful":2,"cool":1},"7w7Xg0CiwpY8cKmdpJavjw":{"text":"My husband and I went to eat here last Friday night with our son and the food was amazing!","useful":0,"cool":0},"kh-Yjo06w_Sa7V02NwVs2g":{"text":"I was surprised to have a disappointing experience, as I was excited to try another Deanie","useful":2,"cool":0},"o0vrInUvY5ZUGhVBtIPvuQ":{"text":"The food did not disappoint! We are from Austin, Tx and everything was amazing!!! Haven't ","useful":0,"cool":0},"NfYzcIiJfz5-WxArgXPpcw":{"text":"Because of my love for the Deanies in Metairie, I decided to try this location as well... ","useful":4,"cool":3}}