{"MlSG_fohGTXfIKKlvSSGjw":{"text":"Found Bettys bar on a whim. The food was great but the service by Bob, the bartender, was ","useful":0,"cool":0},"0GVH6J6AOKFObtiwFc6Wwg":{"text":"Best spot in the quarter for a strong drink and a meal that surpasses your typical bar foo","useful":0,"cool":0},"uohqn-FhABG8MESNVqTZhw":{"text":"Omg, I orders the Mac and cheese bites with the burgers for delivery and it was the best f","useful":1,"cool":0},"savWxxYsxUYWt55zR24WVg":{"text":"Great neighborhood place with fantastic bartenders  and a good vibe. The cocktails are goo","useful":0,"cool":0},"jDdmwlGDHGwFXwldve06xA":{"text":"OH. MY. GAWSH. This little gem is amazing. The loaded sweet potato fries are deeeelish. An","useful":0,"cool":0},"s-SfstuphmBfLFjGL3RO1Q":{"text":"Stumbled upon the grand re-opening of the bar, it was more than expected. Great loaded che","useful":0,"cool":0},"YlVAXDZoWfZxX2qA0xE8RQ":{"text":"Best pulled pork sandwich I've ever had. Inclusive and friendly establishment. No one in o","useful":0,"cool":0},"KhggZDzCWbaXVrDwQNwtSg":{"text":"The food here was fantastic, and the atmosphere was great. Our server, Ryan, was super att","useful":0,"cool":0},"JOo1E5nbjcNf2gNYxiAlNA":{"text":"My Date and I scoured the streets of the famous French Quarter to find the perfect spot fo","useful":0,"cool":0},"0ZHGLn7RpWiz2fyOVCz7uA":{"text":"There are better bars than Betty's. Yes it's new, attractive inside and the food looks and","useful":2,"cool":0},"tnfL0vt4GULQPmdI-PBMYw":{"text":"Love love love! Bartenders are all very nice and personable. The crowd is fun and the food","useful":0,"cool":0},"pGkNDAY3lhciJ7cB9RAGrQ":{"text":"Just happened to stop in and eat here and so glad we did! Super friendly service! Pulled p","useful":0,"cool":0},"qn8zxZNPS5eNCULxc-oFZg":{"text":"Just stopped by for drinks but it's so fun here snd they have the best music!! I got a mim","useful":0,"cool":0},"xPmO90w39liCsPjH8TzHXg":{"text":"We did a Yelp search for burgers and Betty's came up. Who doesn't love a gay bar that does","useful":0,"cool":0},"VMu1LaU-Oy0dERhBbD7ekQ":{"text":"We stumbled upon Bettys looking for late night (see 8:00) dinner after a long car ride to ","useful":1,"cool":0},"nBSW4eZmSx0owebZkSgCXg":{"text":"One of my favorites! Super friendly staff, food is always awesome. Great neighborhood spot","useful":0,"cool":0},"1DN9xTCzR2g520Bu1D_OTw":{"text":"Came here for the positive vibe of the look of Bettys and their menu. Was pretty dive ... ","useful":0,"cool":0},"gF_xSpkKKP2xXCbLejQMvA":{"text":"Went during shut in.\n\nCool spot, nice music ordered to go.\n\nBurger was everything ground m","useful":0,"cool":0},"qztcGAWK5PVyZqJ3BWASEQ":{"text":"Great bar! They play pop music from the 2000s and play the music videos on the tv screens.","useful":7,"cool":5},"VzErIvEve9TKPPPOJBKb7A":{"text":"This place was right across the street from our hotel. Saturday we went across and had a c","useful":7,"cool":7},"QAMK7u8ZIg7pmyRFN4-p_g":{"text":"Delicious food!!! Three of us had the special chicken sandwich with fries and I added bist","useful":0,"cool":0},"7qkhV00oUNI22K7JkXHT_A":{"text":"So happy with the new look and feel of this space!  Thanks for keeping them Mac n cheese b","useful":0,"cool":2},"QF78rwAgK0HgFIYESA-qgA":{"text":"I love this place! This place is a  necessary stop every time I'm in NOLA. I found this on","useful":0,"cool":0},"BYVaJiZtYNOvouFnNExVxw":{"text":"Wow! First time in NOLA and saw some great reviews for Betty's so we had to try it out and","useful":0,"cool":0},"cZpyt_Sp8TyykYLxRL9LmQ":{"text":"So glad this bar/restaurant made it through COVID! The staff are always friendly and upbea","useful":3,"cool":1},"5xv-kNd9sZyLU8ekR9yYfw":{"text":"We were walking around and I read the reviews prior to coming here. They just opened and w","useful":0,"cool":1},"JqP4Ly2j-zHCXYR6b_Eb2w":{"text":"Amazing!! Was visiting a friend and he suggested this place and omg was I impressed. I was","useful":0,"cool":0},"-bY9Y2VtNO8iuN5JpM7y-g":{"text":"We love Betty's! We used to come back when it was 700 Club. The food is great- I LOVE the ","useful":0,"cool":1},"xb2gJvU4kZa-c3sh4Fm9DQ":{"text":"Came to French Quarter on our vacation and this was the first place we found that served v","useful":0,"cool":0},"yq6Y5xa-aL66Ff7BTv8VRw":{"text":"I've tried several things on the menu and absolutely everything has been totally delicious","useful":1,"cool":0},"X6kNBeZktN3dNPzFGTf5iA":{"text":"I'm not sure what's been going on, but I used to be a weekly regular at the bistro and the","useful":0,"cool":0},"Vwt6xAtujpJCRJUbHXpxzg":{"text":"Came here with a few friends and this was our second time here since their reopening. We h","useful":0,"cool":0},"LwAwxzBVwfWigROsNp7P5w":{"text":"If you haven't been to Betty's Bar & Bistro, you are missing out on a FQ gem. I stopped in","useful":0,"cool":0},"5vAV147w3spn7TEA2s_VTw":{"text":"I love this place. I ste here on spring last year as well as late jan this year. The fish ","useful":0,"cool":0},"8h-3qgoke34Xkl9apeSXyA":{"text":"What a treat Betty's Bar and Bistro is! \nSome of the BEST burgers you'll ever have and loa","useful":0,"cool":0},"o3pUMr81uGVna8N193Hw6A":{"text":"This place was very refreshing after a weekend on Bourbon street. The music was great and ","useful":0,"cool":0},"HtSn6NRka4dTWrIp8icV2Q":{"text":"We ordered a hamburger with fries and chicken quesadillas. It was delivered on time. Every","useful":0,"cool":0},"a7NNWztyhqffGJLMFo7Pcg":{"text":"I was so confused to discover the sign that said Betty's Bar since I knew this as the 700 ","useful":5,"cool":3},"olDk2V43mAmftGA5_VXt9g":{"text":"Food best in New Orleans- fried chicken best ever! Wonderful warm happy bartenders! Love t","useful":0,"cool":0},"UfoPTaG5GnXeaXQJNkrvwQ":{"text":"Sooo much fun and great food but deafening music. Really good food fir our last night in N","useful":0,"cool":0},"7DufrUWwMLxW5ubQPrxS9w":{"text":"When you need a break from the madness of Bourbon or want to chat it up and get some real ","useful":4,"cool":4},"ZQjTM0D74SKZdOoTY3C0Nw":{"text":"I obviously missed the part on Yelp that says this is a gay bar and was a bit confused whe","useful":7,"cool":2},"CDMX0WTGKNWwtF-kxoOb_A":{"text":"I was visiting bars and I stopped in Bettys, and was told that I needed to be fully vaccin","useful":0,"cool":0},"BNEzmEOXMj2W1IjWOymrAQ":{"text":"It's a very chill spot. They place some music from\nThe early 2000s and offer a happy hour ","useful":3,"cool":3},"h79jaPb7fxMTSJKPHODxpw":{"text":"We were out walking in the Quarter and we stopped in for a quick bite; I had heard that th","useful":4,"cool":2},"RasvqjO2MMRM8S7LB0ZsBg":{"text":"I've never been fond of bars--they only seemed fun for tipsy people, and I'm not all that ","useful":3,"cool":2}}