{"O6EPWo84RdMsJ8m2CkN-Lg":{"text":"This is my 5th time here and probably my last.  I have given these guys a chance over and ","useful":0,"cool":0},"rSN8rXfSC_0q3TJLzIpoZw":{"text":"Clean shop and excellent pumpkin pie flavor.  They also have a location in the heart of th","useful":1,"cool":1},"vJ3pv7YLtiA0udWAOyB6-Q":{"text":"I'm not usually a fan of frozen yogurt. I'm more of an ice cream fan. But, this place is a","useful":0,"cool":0},"3zdbzWQ4CdPphgnm0_61CA":{"text":"Very friendly staff that remember frequent customers. And of course awesome desserts!","useful":0,"cool":0},"znURyTDserRl2i91sAvILg":{"text":"So I had recently switched my fro-yo allegiances to Yogurtland because a) FREE SAMPLES LIK","useful":3,"cool":1},"0f-7ALWzlFrDwTXxtoXnlw":{"text":"Well, I do have to say that I love love pinkberry and this place did not disappoint with f","useful":0,"cool":0},"kzCwgJeu5vEI-mRmtR2J8Q":{"text":"My kids love it - me, not so much.  Frozen yogurt that you fill the bowl self serve with l","useful":2,"cool":0},"KXwS1iyMt5uOGvPUvvBrgQ":{"text":"Love this pinkberry!! The consistency of the yogurt is just right and they always have a t","useful":0,"cool":0},"JvbBJ3mintqd7dalvXQQiQ":{"text":"Visited this location long time ago, finally reviewed it..\n\nWhen it first open, it was so ","useful":0,"cool":0},"oAMDL8ZbglMZUnZxkSk6bQ":{"text":"I want to marry the new lychee lime flavor. Is that wrong?","useful":0,"cool":0},"VR0JRom47CZ3lklMJ5vQpA":{"text":"Delicious.  Try the pomegranate yogurt with pom seeds.  mmmmmmmmmmmmmmmmm\nAlso like the or","useful":0,"cool":0},"_eY0G4vE4rSY5ylAWNg5mg":{"text":"Some people don't like Pinkberry. They dislike that the toppings are served by people behi","useful":2,"cool":2},"tPKv9WsJRihGyv4aHvpXow":{"text":"Great atmosphere, great yogurt, very consistent.\nThe lines seem long, but they move fairly","useful":1,"cool":0},"LfMpSQ_9gTEcBf8Hb0v-5Q":{"text":"Service - amazing. Those poor kids must have a hard time sleeping because their cheeks hur","useful":5,"cool":4},"OM3QmwQYbrSsN0vUUbUgbQ":{"text":"Once I tried Pinkberry in New York, I counted the days until one opened in New Orleans. \n\n","useful":5,"cool":3},"Ty-tRWKIBGbcMb_gBHq4Qw":{"text":"So I had never even heard of Pinkberry until last year when it opened in New Orleans. I'm ","useful":2,"cool":0},"478Da8WFBx87fqLgtu9cZA":{"text":"Well, it says I'm a regular, but I haven't yet reviewed Pinkberry. I guess I'll do that no","useful":2,"cool":1},"Y9n8CoVZSLad8yZk375EBg":{"text":"Yogurt was amazing! Was a little apprehensive about getting a smoothie made with Greek yog","useful":0,"cool":0},"6qsQrgZPggb1UsQMd8jfbA":{"text":"Love Pinkberry, but I will no longer come to this location. Every time I've been I've rece","useful":0,"cool":0},"NnWyg0y9OqsFs8wKK1Q8Eg":{"text":"I struggled with giving this a 3 star or 2 star rating. Pinkberry was mostly not what I ex","useful":0,"cool":0},"k_d4fK9g3nHZk5oZKRPHMA":{"text":"Love this place.  Super friendly staff, great variety of toppings, and they turn the flavo","useful":1,"cool":0},"Xt9BZBQ5D-dh2XneSi1rSw":{"text":"So this one time, I was like, \"Where are the peaches?\" and the guy who was working there w","useful":0,"cool":0},"HH02tJaa8Vz646YMDAYaPQ":{"text":"I came at 11, which is when they opened. I walked in on them still pouifj the yogurt into ","useful":1,"cool":0},"R4T6CVJSS1rd-yaDPMnMJQ":{"text":"It must be a culture thing, but here in New Orleans, I go out to get snowballs... MAYBE ic","useful":0,"cool":0},"QD8ske2o0KoZ9U-oOZtHvw":{"text":"Pinkberry is my goto place for frozen yogurt. They have any and every topping available to","useful":0,"cool":0},"YWNUQbJtArmRcCQgj45fQQ":{"text":"I am a Pinkberry groupie! Best frozen yogurt ever!\n\nI am not a big fan of yogurt, but Pink","useful":0,"cool":0},"Llz49rupyNv18wlH1gWzeg":{"text":"After shopping around Magazine St. this is a nice place to take a short break. It's your s","useful":1,"cool":1},"ToPK4BG4DiYAM5EjW7AZ2w":{"text":"The yoghurt is excellent. I had the lychee-lime flavor with raspberry, kiwi, and chocolate","useful":1,"cool":0},"50ibAULDCUP3mGmyJfu9VQ":{"text":"Even though it makes me feel like I'm a 16 year-old girl from southern California, I reall","useful":2,"cool":1},"lCWBL08hOFKHqcyQcFT_bw":{"text":"Amazing. There is really not much more I can say about the yogurt at Pinkberry. Everything","useful":0,"cool":0},"lgVoX7yZ9B9o7oVwukvcXw":{"text":"Ehhh, not all it's cracked up to be. First off, you can't make your own creation. To me, t","useful":0,"cool":0},"sIpbcdKPHgHqAfhFpyc1EA":{"text":"Why is everyone head over heels abou this place? i could put strawberries on frozen yogurt","useful":4,"cool":0},"bpmmXbNvsOfp-xs-Iq--eQ":{"text":"As far as froyo goes, this place is just another overpriced, trendy place uptown. It was a","useful":1,"cool":0},"lvUyXhf3cm4_68xkMJLHyQ":{"text":"Delicious frozen yoghurt is available for purchase at Pinkberry. With many different flavo","useful":0,"cool":0},"QTlcB2WRDacHKqYGjAjezg":{"text":"So in the weeks since I first visited pinkberry I have been enough to almos have my card f","useful":1,"cool":1},"M70TB2khN-Pq2JZNEJyk5w":{"text":"although a national chain, the quality of the product, the freshness of the toppings and t","useful":0,"cool":0},"8ex3Q6oJqz6fHhWssQ7BlA":{"text":"From the first time I had it in California to the multiple knock-offs in DC, I LOVE FROZEN","useful":2,"cool":0},"ttNlmvCiBAPqZpm2N_E3lQ":{"text":"Tried to bring the kids here at 11:30 am on Wednesday and the door is locked. The hours ar","useful":0,"cool":0},"KJeCLHuQq6fZEISSrWX-pA":{"text":"Yeah!  PINKBERRY has finally arrived to New Orleans.   The flavors are great!  The topping","useful":0,"cool":1},"qnSG5WpRd8iXHFXNbpYWXA":{"text":"Pinkberry just never gets old!  Best frozen yogurt in NOLA hands down!  If you're not used","useful":0,"cool":0},"Y7v0-HdmqczEIJbBw4lbnQ":{"text":"First-a time-a Pink- a-berry:  I no have-a no orga-nas-um but da \nPink-a-berry rubb-a-me d","useful":0,"cool":0},"YAdT5V5HKQP4ky0rS-dnGQ":{"text":"I go here due to convenience (I can walk there) and when in dire need of a fro-yo fix. \n\nI","useful":5,"cool":5},"C3BlyCvvU-Z-8nr9VPqvhA":{"text":"YES.  YES.  YES!!!!!!!!!!!!  IT'S FINALLY HERE!\n\nWhat, you may ask?   Decent fro yo in NOL","useful":0,"cool":0},"kZzjpHZ8TaZ2sPUhT8RzUg":{"text":"Too expensive!  I think I'd rather go to Zack's across the river.  I'm not waiting in a 45","useful":3,"cool":0},"5A0b9AOdpulQ917IoWLQnA":{"text":"Psst! Don't tell ice cream I've been cheating on it for the last year. Sure, I mosey into ","useful":0,"cool":1},"VtwwOaRIZjqaEAHWlEDR2Q":{"text":"After hours of beer drinking and bead catching at the Muses parade my lady friend and I we","useful":2,"cool":2},"UHSak6K8RxbrbFm_caeQ0A":{"text":"Ive had better.  Went here for a sorority function after all the hype had died down about ","useful":2,"cool":0},"LKtC34uD92v5lhMqIbz5dQ":{"text":"So this is my first Yelp review and it's gonna be a good one! I visited this Pinkberry on ","useful":0,"cool":0},"xAOi42jNQKM3m_lcRI8kCg":{"text":"Really,  People!  I would rather go to this overpriced \"chain\", and get the dessert that s","useful":0,"cool":2},"s4F7zJXR6vLFfZuaDx1t1Q":{"text":"Pinkberry has these Greek yogurt bowls. I got the strawberry mango. It came with strawberr","useful":0,"cool":0},"mr2uhJwcP9_lNMBw90HCfQ":{"text":"The staff is exceptionally nice and welcoming- refreshingly so but you wonder how they can","useful":1,"cool":0},"ISHjFfyD8N0__XjT8ihrXQ":{"text":"Really people???  You live in a city with some of the best food in the world, yet you visi","useful":0,"cool":0},"DEGyDyydEYVSgLmQhXnuwA":{"text":"You can never go wrong with Pinkberry and all of the fresh assorted toppings. This is one ","useful":0,"cool":0},"Q7nW0hXyY1SrlSTvtcKoSQ":{"text":"Yay I am a fan! Since we are at the tail end of a recession, I would suggest they reduce t","useful":2,"cool":3},"z4ZhWH7CZFTJHH1yJ4ZsDg":{"text":"Ok pinkberry.... I admit it.... you win.\n\nDespite my penchant and joy for poking fun and d","useful":0,"cool":1},"kkw3Nvc77FHOIwVILecZBQ":{"text":"My favorite part of Pinkberry is I always get a laugh when I tell them my order, and they ","useful":2,"cool":2},"HhrnKa1oa9M0MwCzvzupJQ":{"text":"So great that this location is right by Romney Studios! It's a nice post workout treat. Th","useful":0,"cool":0},"-AePMKq0HCVfKQCBWFKalA":{"text":"I am assuming that the yogurt artist? that helped me was a manager. If he is not, he shoul","useful":0,"cool":0},"S8HuDUSwBPXGnEVYWGQf4g":{"text":"Had not heard of pinkberry until we stumbled upon it in May. The long line almost made us ","useful":1,"cool":0},"xlCkHtPQ3ViGNEOwx7kMFA":{"text":"Fantastic yogurt and nice employees ! But how in the world you don't accept Apple Pay in 2","useful":0,"cool":0},"3cfcbw6yH0wkC5xENlBYEw":{"text":"The staff was pleasant, really pleasant. I was offered tastes.....generous. Number two cho","useful":11,"cool":4},"Mg7Nf-WCZ4TaL-ciqutzbg":{"text":"Love the frozen yogurt flavor tangy, tart and sweet. Lasts in the freezer for days and sti","useful":0,"cool":0},"nPPB07esDYItuHNX7q7NsQ":{"text":"I think Pinkberry must have crack in it. \n\nI'm addicted. I get cravings out of nowhere. Th","useful":0,"cool":0},"IYsw3rzCJc-umVweh0GoZg":{"text":"Pinkberry original w prailines and hazelnut topping is literally to die for!","useful":1,"cool":0},"pz-LKNByGqy2vtILKYGiHQ":{"text":"I have been to many pink berrys, this is the most unique location-very cute, nice outdoor ","useful":0,"cool":0},"I3K3wutuGgjWAOg5KU4T0Q":{"text":"Cultish. Overpriced. Delicious.\n\nThe frozen yogurt at top-of-the-line yogurt places like P","useful":2,"cool":2},"YmjuU2ll_VgR6oKlcS6lYw":{"text":"Pinkberry is my absolute favorite treat to have now! \nI love going grocery shopping at Who","useful":0,"cool":0},"hA9_D47aw_g2fqJ4g-EI9w":{"text":"I have a sweet tooth. And when you're 26 the tooth fairy doesn't come anymore when your te","useful":0,"cool":0},"UBFo1FNZbpBrfuE7qXvuQA":{"text":"I always stop by pinkberry when I'm looking for a delicious, yet light sweet treat. I'm a ","useful":0,"cool":0},"Zgp9Yfguqjx6s0MkQXCL4w":{"text":"Visited on 6/26/19. Ordered the mango with strawberry boba. The location wasn't busy at th","useful":0,"cool":0},"ix5_9y_r7f3u5uH7V_RttA":{"text":"Everyone is always friendly! I usually get the same flavor every time, but there are alway","useful":0,"cool":0},"ZauiTq9RMPSty9ztNI-3Ug":{"text":"The froyo base is pretty good already, but the toppings make it even better. It's also a b","useful":1,"cool":1},"gVt8WxiSBqS_SaeFzNUwGw":{"text":"I love how New Orleans has its own PB now!\n\nI was getting upset that I had to go all the w","useful":1,"cool":0},"hnmKQPMcg7A-NCkEq0kkzQ":{"text":"I'm not a huge fan of frozen yogurt but I have to say, this is pretty good.\nThe place is a","useful":0,"cool":1},"JI7Lu_wOq7FPseAJ6wfQMQ":{"text":"I don't know why they are so special, but I like it. Just not more than another frozen yog","useful":0,"cool":0},"vHUwsZrSuMniLgxRvhWshQ":{"text":"The positive is location, freshness, cool vibe, & tasty treats.\n\nThe negative...parking re","useful":1,"cool":0},"O5mpIp_TfIFtLAwEmNZ7ag":{"text":"By far the best yogurt ice cream !!!\nI made it a tradition to go eat there at least once a","useful":0,"cool":0},"Ev2PemCj9N4YmpcCWT1ZBA":{"text":"The employees were so nice and picked out the best fruit for the yogurt, the offered to ju","useful":0,"cool":0},"VmNvPsJsTvNcPh_ZB-mplg":{"text":"It has been YEARS since I've been to a frozen yogurt place, and it being Pinkberry at that","useful":1,"cool":1},"Opt43_KrbG0lmz2BJlTDWQ":{"text":"I love pink berry and usually have a pleasant experience but every time i come and this on","useful":0,"cool":0},"CjvVxYKXH97jqmOcK1UIUA":{"text":"Best quality of frozen yogurt you can get. Most other places melt very fast, but Pink Berr","useful":1,"cool":0},"_AcWbAvNRNlmJnw2GRMmpw":{"text":"We have been going to Pinkberry for years especially since we can walk there. It is usuall","useful":0,"cool":0}}