{"u_w_XuUIZXKpbgQkhvuQ_A":{"text":"I went here once and was not blown away so I probably won't go back.  Some friends chose t","useful":0,"cool":0},"JCyQR4UaVQVZ3fH8NIShaA":{"text":"This is such a weird review to write, but I have to be totally honest here.\n\nA friend and ","useful":17,"cool":11},"Uj3n-W8G8WBLcIUpHnVFwg":{"text":"Not the best mexican place I've been in town. Tacos were OK. Guacamole and queso dip are v","useful":0,"cool":0},"EjDFZcSyOiBMNXK0TzCKZQ":{"text":"First time in New Orlean's, and this was the first restaurant we dined at because it was w","useful":2,"cool":0},"KG99uPHI99R__APXItSUEA":{"text":"Pleasant surprise! The cheese dip is really good. I ordered the chicken caesar...let me ju","useful":0,"cool":0},"YqkdF8_8RqK0o4VZ5R_aiA":{"text":"I suppose the food would have been good if it had been at all warm. A bunch of us ordered ","useful":0,"cool":0},"0Yivx6d0aSd3kRzzd4UGWw":{"text":"I guess I don't know if the food or drinks are good since after I was seated I didn't see ","useful":0,"cool":0},"iYEnchyHjQsCfQe8C2DT_w":{"text":"This is by far one of my favorite happy hours. $2 tacos, $4 margs, 1/2 off queso + more un","useful":0,"cool":0},"FhUG8WdLjfaLkIFCOUD2vw":{"text":"I've lived in the neighborhood for over a decade and love to support small businesses. How","useful":0,"cool":0},"MxkNBFlCxrKXl5NITc1LKg":{"text":"Great location for an ice cold michelada. Unfortunately, the food was not good at all. \nSo","useful":1,"cool":0},"TUpakzifNW34kShGW1ixjg":{"text":"Food was good, if it was hot. Had to send food back again, came back burnt. Service was ex","useful":0,"cool":0},"x0KdmFuaDK4yHsytmMe_jw":{"text":"My boyfriend and I visited the La Casita Oak location about a year ago after they had open","useful":0,"cool":0},"2roY_Qug6GWG8JakjHiS7A":{"text":"Best queso in town hands down!! They have great specials for happy hour on tacos and drink","useful":0,"cool":0},"rzAG-C1vTN7MMWJNzJ_HKA":{"text":"This used to be my favorite place for tacos. Easily one of the best happy hours. The happy","useful":1,"cool":0},"oDZVfRfjoFCWDJr0WLoMug":{"text":"Some of the most legit tacos in town. Happy hour was pretty killer- 4$ marg's and 2$ basic","useful":0,"cool":0},"zRy7KW_PcqlCIkLk5R2-Hg":{"text":"So the food and drinks here are really good.  That's about it. The service we've had has n","useful":0,"cool":0},"U7k5J-6PBYJBDgL6RYZHtg":{"text":"We love the food here and the service has never been great, but having a server was a plus","useful":1,"cool":0},"reBKYTE9jR10-EXasCrqkQ":{"text":"This is not Mexican food. The salsa is all tomato and so sour.  The chips are the only goo","useful":0,"cool":0},"wSAUguS0XujeFZ7APYM43w":{"text":"No bueno!  You have to order at the bar, get your own silverware, then get passed up serva","useful":1,"cool":0},"SdN8u7qSGAcKpdc59widOA":{"text":"Really nice restaurant, nice outdoor seating area, just too cold when I visited.  Great ha","useful":0,"cool":0},"4DPds_qPg0cIfYznhDcsSA":{"text":"I was hoping the food and service would be better on the second visit but it was worse. Ov","useful":4,"cool":0},"A2tO0HqV7T93wO127XfwJg":{"text":"Stopped by on a Monday night for happy hour (3-7pm) and was pleasantly surprised by the at","useful":0,"cool":0},"_jTTx4l6gUk0CngRtKuXVQ":{"text":"I went in on a rainy Friday and it was moderately busy. Our waitress wasn't very attentive","useful":0,"cool":0},"BsEFd19T1PvVSecgmOmgSg":{"text":"This restaurant is located in a very \"cool\" area. The salsa and guacamole were good, chips","useful":0,"cool":0},"IqmE3Dgs3NTGWLbOpKF8-Q":{"text":"Went here on a Sunday during happy hour and had the Queso, Elote, and Mexican street tacos","useful":0,"cool":0},"MB1BQ7gUV7oit_tkGWirXQ":{"text":"Just like their original location in the Warehouse District this joint has an awesome dail","useful":3,"cool":3},"Uk1yMfB-rBitwfRYEXeG5Q":{"text":"So I was bummed to see Squeal go out of business, as good BBQ in New Orleans is difficult ","useful":0,"cool":0},"NrJn_qn_cfSRoQMnduu85A":{"text":"Went for dinner on a Tuesday night with a buddy of mine. They have what looks like a decen","useful":3,"cool":0},"QsU4m7kfRrIAMKfF2KfVPw":{"text":"We waited for about  a year before  trying this spot. It's  in our neighborhood  and the h","useful":0,"cool":0},"cDcYnp3T-PVLyJCcrhV1ZA":{"text":"La Casita has really good margaritas and the happy hour prices are great. Same goes for th","useful":1,"cool":1},"6cie2RA0gfB3HX2RdRsjBA":{"text":"Great place for lunch or anytime. Had the carnitas tacos. The salsa was so fresh and bold,","useful":0,"cool":0},"6tRhG-bE6xyCLHtSdOaVOQ":{"text":"The food is not good at all. For two people it was almost $60.00 and it was really not wor","useful":0,"cool":0},"wHVfCfAEeCazjJBalHAf9Q":{"text":"Love the street corn, and they also make a refreshing margarita. I like the style of servi","useful":1,"cool":1},"Jwtl-G3jz57OswXcuHoYnA":{"text":"Hit or miss on the food quality--the queso and guacamole is never the same. Great happy ho","useful":0,"cool":0},"GxEFNcjjt2hBz3LoOlXodQ":{"text":"Food is good but the margaritas are NOT good. First time coming to the Oak Street spot and","useful":0,"cool":0},"nk841ugV03dfyMw0EPPKkA":{"text":"Went Thursday night for happy hour and was pleasantly surprised.  We have walked by this p","useful":1,"cool":0},"68CQpqwCSRspZRE3TTTeYw":{"text":"I went to the former one on Julia a couple times for happy hour. Service was always lacklu","useful":0,"cool":0},"2QFC2iTeTvvMy6TMpTF7aQ":{"text":"A handful of friends decided to try out this restaurant for Taco Tuesday after our CF work","useful":0,"cool":0},"IE0KNDvz3-AeqGAsqJ6Ong":{"text":"\"Really good food out here. I will be coming back whenever I can. The salsa is what blew m","useful":0,"cool":0},"uekBliDO8H5a0Awcg7PFwQ":{"text":"OMG, in town after an amazing R+F convention!!! Now hangin' with my sisters and nephew and","useful":0,"cool":0},"GSZ7BbnzjWvbFImflkTHhw":{"text":"Avoid. The entire experience for us was a very unpleasant one. From charging us incorrectl","useful":2,"cool":0},"rSPdeNxjfRWs_H5ZUkbd5g":{"text":"I used to come here all the time when they first opened. They used to have house made chip","useful":0,"cool":0},"o02Mo9WaKHgJrOxKuJzXzg":{"text":"Love their daily happy hour!! $2 tacos and cheap queso & guac. Every day 3-7. Totally wort","useful":0,"cool":0},"KPwAnHIGrlF4Lm7BWYNPtQ":{"text":"So, how should I begin. The service is not up to par. It took forever to get an alcoholic ","useful":3,"cool":1},"i4bk6lJwi5o8E9arVmOLWQ":{"text":"It's exciting to see a new restaurant open here...again. We don't have many Mexican style ","useful":1,"cool":0},"Smy3kjcXKwG-OM22x6LyOg":{"text":"I used to love this place. It's a cute little taqueria that USED to have waitresses. I'm n","useful":2,"cool":0},"rjuVKHSE_45OM1jp1J9aBg":{"text":"Had a great lunch.  Husband never gives anyone a \"5,\" but this was close!  The shrimp cock","useful":0,"cool":0},"Gd30m6zypjBJdnAu-3qyFQ":{"text":"We went on a Saturday night, and by far the best service and food we had in awhile. Our wa","useful":0,"cool":0},"Q96yxGglhUd9SSG9sdiq5w":{"text":"My buddy and I were starving, and he really wanted to try this place.  I like the location","useful":0,"cool":0},"jAzBRaAAeYLjZtZFyahkmQ":{"text":"The food is average, the drinks are decent, the prices are steep, and the service is gener","useful":1,"cool":0},"XF0AfKEt6otA2stWBXRSiQ":{"text":"Favorite happy hour in town! Great drinks, salsa, guac, queso, and tacos... A staple for m","useful":0,"cool":0},"dc1h-CCYCr7XH9WcVGYmmQ":{"text":"Went with a group last week. Our server Catherine was friendly and had great suggestions a","useful":1,"cool":0},"1AUesObMtkDEG3Vkt_tjSw":{"text":"We were a group of 5 for dinner tonight. We ordered queso and chips..,the temperature on t","useful":0,"cool":0},"jxgBQV4v4-RQq9MfuhdlrQ":{"text":"So this place. We went on a Sunday and I was excited to try it. I always heard about the o","useful":0,"cool":0},"sIsszDGIhH-tYkxZhyds-A":{"text":"Update:\n\nWent back for a second time and ordered the chips and queso. The chips were an im","useful":3,"cool":0},"VHJL2a5-utNgcOMobCCaLg":{"text":"One of my absolute favorite happy hours. The bar staff is top notch, knowledgeable, and ar","useful":1,"cool":0},"eV6cE7WlN6PRT0LePQ4Eiw":{"text":"Fantastic service, great food, and a delightful location! We sat at the bar during happy h","useful":0,"cool":0},"Mc1l4Y-o4K5lhYxHeA8BqQ":{"text":"I'm not really sure why people hate on this place.  I love it.  Happy hour is cheap and de","useful":0,"cool":0},"uR2P1nEMKfZiWfevgYc0rg":{"text":"The service was extremely slow: to come take our order, for our food to come out, to get u","useful":0,"cool":0},"rmEvg8OF9z3nF2BVklDqSg":{"text":"I'd heard of this place time and time again but what finally reeled me in was the happy ho","useful":3,"cool":1},"WYxZlqKK3GojhMaHAvv3hA":{"text":"La Casita on Oak St: I advise you to avoid this place. The only saving grace was the guaca","useful":1,"cool":0},"dsfoiB1NTu__U31mtobD7g":{"text":"The hostess was very welcoming. Sitting outside on the porch during Happy Hour with a marg","useful":0,"cool":0},"9sTcINGbS9_TQqs6R4a6TQ":{"text":"My absolute favorite place to go for tacos and margaritas! They have a great happy hour an","useful":1,"cool":0},"_KVOQkvXBC_RW77DG9G6xw":{"text":"My boyfriend and I have been coming here for a while, and although the service has never b","useful":0,"cool":0},"Zkgh7KmkdwnS0gDhuhJkXQ":{"text":"The best tacos and queso!!!! The new chicken mole poblano chile taco is the best taco I've","useful":0,"cool":0},"jugf2tgvvINAKOSXSdTHDA":{"text":"Personally I'm surprised this place only has 3 stars- I've always had nothing but positive","useful":0,"cool":0},"GAYq5n0PcQN9JDUpOHnOpg":{"text":"I had my reservations eating at a Mexican restaurant in New Orleans. Since I have lived mo","useful":0,"cool":0},"DFF8v3akSi-kluEZ_ZZWWw":{"text":"One of my favorite places to sit on a patio and have some good food. However, today I was ","useful":0,"cool":0},"dhpSImYpkS6Uucb3VZh_XA":{"text":"Really disappointing experience. It wasn't busy but the server still took several minutes ","useful":0,"cool":0},"fPXz7uiQV6o8ln0RFTKtPw":{"text":"I was really looking forward to dinner at La Casita after dining at the old location 3 yea","useful":0,"cool":0},"BXVQcWshVGizvIbokXUIng":{"text":"I will give La Casita Taqueria 3 stars because the service was excellent. We ordered the q","useful":0,"cool":0},"RIgyyfN8JMuUil2icwspGA":{"text":"Good margaritas and tacos. Taco salad is ok. If you're used to Texas mex, I wouldn't come ","useful":0,"cool":0},"_-CdJjMLcKnA5dol6EfpKA":{"text":"Great spot for Happy Hour / Dinner combo. Food and service are terrific..plus it was a won","useful":0,"cool":0},"cPLRNuUpw18WQfWknfvklQ":{"text":"I gave this  a 2 only because the last time we went here it was better. When we went today","useful":2,"cool":1},"KnN5I1t_kR5AbCmKHinDMw":{"text":"We were staying in an Airbnb across the street from this restaurant so just happened acros","useful":0,"cool":0},"OC8uVebv5mdE_0hcGgY3Tg":{"text":"Quick service, Strong margaritas, Awesome flavor!!!! \n\nStopped in for a quick bite after m","useful":2,"cool":0},"s82qe68A13ruBuWzwDziwQ":{"text":"Get the barbacoa and the carnitas tacos! So delicious. Also ask for Leah as a server. She ","useful":0,"cool":1},"KqJXm6aBNIUs7D5-8Yet-A":{"text":"Okay, first things first.  We've been looking forward to this restaurant since we heard it","useful":1,"cool":0},"DjVae1ghWIXPczAjIT9Wow":{"text":"I would rate La Casita 3.5 stars.  They're off to a great start at their new location, but","useful":9,"cool":3},"MOWoLl1IyprtqDfdYqooGA":{"text":"Disorganized Service, Rude Hostess, Possible Credit Card Fraud?\n\nI have never received suc","useful":1,"cool":0},"LZCgDRTWJK1eSSe1CA5BuQ":{"text":"I'm from Nashville. This is the best Mexican food I've had lately. The Mojoita was great, ","useful":0,"cool":0},"HAUTP8w8m1C7fAGogMqSnw":{"text":"La Casita on Oak street is what we chose for lunch one day and I wasn't really impressed. ","useful":2,"cool":0},"MYEk_-e9ladKztzYkBh9zg":{"text":"It's a nice, quaint place on Oak. \nFood is good. Nice bar. We stopped for a small bite and","useful":2,"cool":0},"uZajTKqhd7uAUKd1LFKs0g":{"text":"If I could break them out I'd give the food a 4* and the service a 1*. Second time we've b","useful":0,"cool":0},"_rpVj2_KQW_yBDWcnweQWQ":{"text":"This is a review of service. We never got to try the food. \nMy family and I went on a Frid","useful":0,"cool":0},"23245PVzfJM0D_MkgnKA6g":{"text":"Food was very good and the happy hour menu was very reasonable. I have seen other complain","useful":0,"cool":0},"B7HVb0e5r0HZB7Zb73ismg":{"text":"Average. I was referred here for a happy hour special.. Drinks unfortunately we're 3/4 ful","useful":1,"cool":0},"yAQXVRdSHZhK3sjxZTQksA":{"text":"We went for happy hour and really loved this place!! Strawberry Jalapeño margarita was gre","useful":0,"cool":0},"BR0mriHNaBIgCWm6h-Nh-Q":{"text":"My friends and I went to La Casita for a birthday dinner. Upon asking for the check, Doug ","useful":0,"cool":0},"pVrFhgUOSUyHOPRPNnGn0A":{"text":"Darn good tacos, amazing guacamole, good margarita, and the service was perfect. I'm glad ","useful":1,"cool":0},"NuNTVxuAAcekniyfokh3IQ":{"text":"La Casita has an attractive, \"homey\" exterior; it looks like a former house & yard. The in","useful":1,"cool":0},"7ujrzjXLP4cVKY0YhqGjOg":{"text":"This review is mostly on the service I experienced with a group of friends last night. The","useful":3,"cool":1},"ijRYwcaj0Oh-_-n-r9Rbbw":{"text":"I recently went here with a friend. We went during happy hour. The food was great. We got ","useful":0,"cool":0},"-ntcErSLdtzhtey-jf9mPQ":{"text":"One of the worst roller coaster rides straight down that I've ever seen happen to a restau","useful":2,"cool":0},"e4pTZT79s8E8HncV-2MwHg":{"text":"tacos: A+++++ (carnitas are the best in my opinion)\nqueso dip: CHEEEEZY (A+++) beats Felip","useful":0,"cool":0},"YAuxQtomn2PTKskVInpyOw":{"text":"Please don't go here. It is probably the worst taco place that I've been to. \nThe service ","useful":0,"cool":0},"kZhnTf1omLFdj8jUwHnwyQ":{"text":"The atmosphere was good. Very laid back and just cool. The food we had was good....for hap","useful":1,"cool":0},"6qLDE30VjHlMgQmA5DXkKQ":{"text":"Delicious tacos. Yummy margaritas. We had the chicken mole and pork cochon tacos with the ","useful":0,"cool":0},"uvmr_qwDzByBFfbRQ-rmAA":{"text":"Amazing  papas guapas a must eat!!! Happy hour is sooo worth it drinks are on point !!!! G","useful":1,"cool":0},"OYmWjXK6s0c8hSBHlJq_Pg":{"text":"Even though the food was good, the service was not good at all. We arrived at 6:15 and wer","useful":2,"cool":0},"4CD1n1CqXfc2kcrgQOv1pA":{"text":"I couldn't wait to try the new La Casita location because I've been to the one downtown an","useful":0,"cool":0},"0Uu8Tk2vwRqlUgU6M115lA":{"text":"This used to be my favorite taco spot in the neighborhood, but ever since they went from t","useful":1,"cool":0},"4B3h8VxiehW_xwaSOl1zAQ":{"text":"My boyfriend and I Decided to try this place for the first time tonight. We sat down in th","useful":0,"cool":0},"toJkRA7MLxJ20Nx27HOfCQ":{"text":"Located at the old Squeal BBQ, La Casita retains the physical charm while adding a new twi","useful":5,"cool":1},"Z55YFQvqNxq1_XtUPtwe-g":{"text":"Slow service, but a super hip water. They are constantly offering water, so you will never","useful":0,"cool":0},"XiKYvEooweiAZt0bGYqvQA":{"text":"I like this place much more since they located to Oak St. The sangria here is the best in ","useful":3,"cool":1},"Vq4UYX7eYFBv_9eIV-kr0g":{"text":"Great for happy hour if you can get a seat. They have a deal on tacos and margaritas. This","useful":0,"cool":0},"B5W6h-LbfNpUzxn7YpTdVQ":{"text":"This place is horrible!! I ordered potatoe fluatas, Guac and chips. First off the potatoe ","useful":0,"cool":0},"fSruD5uvE8ossu1PcqC7fg":{"text":"This place looks amazing and sounds amazing. The idea is just perfect, it's nice old fun h","useful":0,"cool":0},"HyrKLTonKdYEH2Qscliepw":{"text":"Bad service and decent food\n\nWent for happy hour and the place was pretty empty got a few ","useful":5,"cool":0},"LUPLWkABBXVY1GNVue0srQ":{"text":"I love this location and their patio.   It's a casual restaurant with some great outdoor s","useful":6,"cool":1},"yB5lBcKlTmEr1pjUgLDvtw":{"text":"Great Jalapeño margaritas. Loved the sweet potato and pork quesadillas! My tacos were good","useful":2,"cool":1},"tZRSStyCaWcOP-9AVvv5cg":{"text":"My wife and I where looking for somewhere new to eat and we ended up at La Casita Taqueria","useful":0,"cool":0},"sHaGPelkmwLikQFHwW97Zw":{"text":"Food was ok. Service was bad. Waitress disappeared for long periods at a time. Had to be a","useful":0,"cool":0},"pd6JmWsv3W6uargGzGgIpA":{"text":"Do your self a favor and skip this place. We have tried to love this place for a long time","useful":0,"cool":0},"PVrbsLvO-IDodx363O8d2g":{"text":"This was the second time I've eaten at this establishment and I wasn't disappointed. This ","useful":2,"cool":0},"gyTWpir7NIZL6HL0NSHoug":{"text":"I come in about 15 mins before 9pm due to seeing on Facebook they have Sunday Funday = Hap","useful":1,"cool":1},"SSNG7kpKC4euVlVHzUbhRg":{"text":"Not sure what the story is on the negative reviews but we just ate there and loved every b","useful":1,"cool":0},"dGi0mHwe_vQGLMlijgtJlw":{"text":"I am a westbanker who LOVES New Orleans food spots. My friends took me here for my birthda","useful":0,"cool":0},"MHqfNGNHaznWzQHXgtjjRA":{"text":"I live on Oak St. I want this place to be successful. We have been several times hoping fo","useful":1,"cool":0},"fyrufekIX9X-vDrdcUDPJw":{"text":"For a very long time I have been seeking out a good Mexican restaurant in New Orleans. My ","useful":9,"cool":3},"zlPtHG9rRmPYd1JFWS7IVg":{"text":"One word - Flavorful. The tacos are tasty and priced right. I was pleasantly surprised by ","useful":0,"cool":0},"TH5bkpl_XWsxSJXRWloe7w":{"text":"I ate here yesterday and now I have food poisoning. it could be from Zea's, but I doubt it","useful":0,"cool":0},"nDd5s9FhavIH6UImKMQb9Q":{"text":"Went here for happy hour last Friday with a few friends of mine to check this place out af","useful":2,"cool":1},"uHGbecID_mAUPzOjNbIwZw":{"text":"This is probably the worst Mexican restaurant in town. I have given them 3 chances already","useful":1,"cool":1},"RD7X_vg31rFbNtSeI8ZysA":{"text":"Because I live in the neighborhood, I'm a dedicated regular at La Casita's happy hour- the","useful":0,"cool":0},"QRgATCdh1-vWmuu9fpzVCg":{"text":"Sigh. It breaks my heart to write this review only because I used to love this place so mu","useful":1,"cool":0},"ONVnoPjzmoYFqmfDT666Eg":{"text":"This place has gone down hill. I remember when I use to come here multiple times a month a","useful":4,"cool":1},"dVRhXtqwWR-YKDntEkD74g":{"text":"I really wish you guys could get your shit together because I really like your food but yo","useful":0,"cool":0},"EOd8hYOFSGOnkxnW3Y7u8g":{"text":"I came on a lazy Sunday afternoon, and business was pretty slow for La Casita Taqueria. Di","useful":2,"cool":0},"-IyvHK7S3O4pS5xR8N4vIA":{"text":"The food here is alright here, service is slow, but I'm normally ok with that. However, th","useful":0,"cool":0},"Pck0kXulHvHhHUZv4YN8fA":{"text":"I love coming here for some queso, salsa, and fresh guacamole.   Their happy hour is the b","useful":0,"cool":0},"NS43cv08oCkuEyTsrZn6WQ":{"text":"I have been to La Casita multiple times over the years. I always enjoy the food and drinks","useful":0,"cool":0},"I94T-JGQUIdCwQpp4lbeOA":{"text":"Went for Happy Hour and excited for Margaritas. Waiters had hard time figuring out who wan","useful":0,"cool":0},"Cy5rPQoS4urkL7YJRah4tQ":{"text":"They tried.  Ordered a mojito and got a margarita with some bits of mint.\n\nThen ordered a ","useful":1,"cool":0},"jWrAj50qRps1ZhJOpJqQXw":{"text":"This restaurant used to be good. But is now terrible. We went for a quick lunch and sat th","useful":1,"cool":0},"qxEQZGih9luwqUqGAt_J8Q":{"text":"The food we had was delicious; however, we only made it to the chips, salsa and queso.  We","useful":1,"cool":0},"6pRbuit8ozODvBrByFwbgw":{"text":"We arrived towards the end of happy hour so they were packed. I guess we should have gone ","useful":0,"cool":0},"pkeRETcBxAUooEQJxtXV0g":{"text":"We ate here for lunch today, and it was absolutely delicious! We had mushroom and pork tac","useful":0,"cool":0},"tXJWpnZjRDsNeKgyR-xK-A":{"text":"The environment is chill, relaxing with amazing service. The food is delicious!! Margarita","useful":0,"cool":0},"h7nJMIe_yy6NqiW1DjdF7g":{"text":"Enjoying the $2 tacos & Half off Guac & chips! Service was good & fast thanks to our Barte","useful":0,"cool":0},"UXX8dZXMiSNuC0EVIDmVzg":{"text":"Came during happy hour, which is from 3 to 7PM. 2 dollar tacos, 2 dollar domestic beer, 5 ","useful":0,"cool":0},"_jXoprCsCP_o1WPn-BA0gg":{"text":"It was a good experience at a non-authentic taco spot. It was nice that they're open later","useful":1,"cool":0},"KueToVIHYcedNiXOExxpqw":{"text":"The El Fuego tacos are AMAZING. Really, everything I have tried has been amazing, those ar","useful":0,"cool":0},"ob-UbBrtfT5jCCYITB5_2A":{"text":"Not quite sure happened but they forgot our food. Drinks were good but could not comment o","useful":0,"cool":0},"NgDTPsyyRdUsuhJQ5w69TQ":{"text":"This used to be a great place to eat but my experience tonight was rather disappointing. T","useful":0,"cool":0},"Dr697SkduZMBGLeMcMS4Lw":{"text":"I've always been a fan of the location of the spot in the CBD but this place - oh child! \n","useful":10,"cool":7},"AYghtkJVotmENzCQmHvIsQ":{"text":"This place looks amazing and sounds amazing. The idea is just perfect, it's nice old fun h","useful":0,"cool":0},"7l5Jq8ZCuxfzipeBZWVPnQ":{"text":"I absolutely love this restaurant, I had a below average experience one time and they made","useful":0,"cool":0},"CS0RtS0PAqHG_mXrhsW2zA":{"text":"I tried this place again--still dissatisfying. I gave this place 3 stars, however, I only ","useful":3,"cool":1},"Qs7k1-1trovhFsNTXLsdow":{"text":"La Casita is one of the regular places that I visit when I'm on the Oak St corridor. When ","useful":4,"cool":0},"wP7s7P6U3ojBlw5IZM2tXw":{"text":"After looking at the Happy Hour specials, my friends are I were incredibly excited to head","useful":0,"cool":0},"UlRbfj0z9PaWlXuNpplWBg":{"text":"This place has new owners and has really stepped it up. Service is good, food is good and ","useful":1,"cool":0},"BEdqD7PmUx-_OcXWWgNzUQ":{"text":"For maybe the fifth time visiting, I was disappointed in the service. I went on a Friday a","useful":6,"cool":0},"E9rf28J6G54U9lWbHTtfwg":{"text":"I'm always on the hunt for good Mexican/tacos in the city. We stopped in here one night be","useful":1,"cool":0},"Fsp8YX3svfg0M7JmmBFagw":{"text":"Came in during happy hour, female bartender is horrible, did not acknowledge me or offer t","useful":0,"cool":0},"Qg8-rHUitaqALeK-9GOisw":{"text":"Cute building friendly staff.... meh food and no wine selection.  Skip this place... too m","useful":1,"cool":0},"EzRHKiycIDFG5oJzDdSC3w":{"text":"Cute little place uptown!!! This is such a gem, great music, happy hour specials everyday ","useful":0,"cool":0},"z42Kr8xhWQJkZFQow-0_YQ":{"text":"Went last night with a few friends around 6:15. Apparently there is happy hour that emptie","useful":1,"cool":0},"4kdGDxoosbY4u9J0-xHNfg":{"text":"I visited with a few friends for a Friday Happy Hour after work. I thought it was a good h","useful":3,"cool":1},"yWWQUK9zJW7WA4Cdvsp_lA":{"text":"Great Tacos! Amazing Happy Hour(s) from 3-7 every night. Excellent music selection.\nSadly,","useful":8,"cool":3},"L_1tPChVHNidYvuIhKpPkg":{"text":"Bobby and Nathan were AMAZING. He was so helpful and made us feel so at home. Great drinks","useful":0,"cool":0},"uSpzQV-dH1Oj6ULE9QobEA":{"text":"I came on taco Tuesday by recommendation, but I'm not satisfied. The food is a little over","useful":2,"cool":0},"V0A_oYWAa9yW3AP5DR810w":{"text":"Definitely disappointed in the customer service in the bear area of this restaurant. It wa","useful":0,"cool":0},"mKj8vg8s9bYnLaoekQkgSw":{"text":"This restaurant is my favorite place to eat in New Orleans. Every single menu item I tried","useful":0,"cool":0},"xnn_lzGu1bhloonHqlcCdA":{"text":"I left 20% because I worked in kitchens.  If you won't pay, don't go out!!\n\nWe will never ","useful":3,"cool":0},"I2_2j-qr64FjCH_yx3oEHA":{"text":"I recently visited La Casita when I caught up with a friend over dinner. \n\nLocated on Oak ","useful":1,"cool":0},"kPfE89AR-wwfIs267To1Hw":{"text":"Mind blowing Michelada! Best I've ever had. Adios, Bloody Mary (I will still love you Bloo","useful":0,"cool":0},"l-NM-hiXmEKbhhYmDch-vQ":{"text":"La Casita on Oak is pretty new. The restaurant is really cute. I didn't get to check out t","useful":5,"cool":2},"MFIDA2b-0AR9Gv4nCtZZSQ":{"text":"Terrible service! Waited 35 minutes for a Diet Coke and margarita and still didn't have ei","useful":1,"cool":0},"hZtW5E4rSu0sz3bt82aSHQ":{"text":"The burrito/tacos selection is awesome! Pulled pork options were great. Artful gourmet mex","useful":0,"cool":0},"TddID2LpLTU8pneDVhZ3Pg":{"text":"We went for happy hour, we ordered chips salsa and queso. Chips tasted horrible, they were","useful":0,"cool":0},"qiZ-IZpehC1s6x2N-RVZmA":{"text":"This place is the spot between 3 to 7pm...the tacos are great especially the happy hour pr","useful":3,"cool":1},"dAtssKo5sQ8Ma0KkqjzqDg":{"text":"Taco heaven. \nThis spot is fairly new and the staff is a bit green, but the tacos are wort","useful":2,"cool":3},"N6iemGyIKQOP-gVa3iSYNw":{"text":"Catfish tacos, fries w like crema & cucumber salad. Matthew was awesome and had great reco","useful":0,"cool":0},"umHoDZJIzdbz3LFCngykdw":{"text":"My so and I go here after I pick up my son and we got the nicest waiter ever he danced wit","useful":0,"cool":0},"De95ZYKWR0oymZEez3QJoQ":{"text":"I like La Casita's atmosphere! The space is big with a nice bar and outdoor area. Lots to ","useful":0,"cool":0},"Zg1OYsDsWBlcTzTcrCyiag":{"text":"The combination fajitas are the bomb! The sauces, chicken, vegetables are all delicious an","useful":0,"cool":0},"JrzgNsnHhOZBPb8V4qnMLQ":{"text":"This is probably my favorite happy hour in town. The brisket simple taco is to die for! Th","useful":1,"cool":0},"LOLuhPdDZZbtF6DnPfvk4g":{"text":"The Ladyfriend and I came here a few weeks ago on a Sunday around 10 minutes after 11.  Th","useful":2,"cool":2},"VasNAEIEAsRcHghoPSmjmw":{"text":"I don't know if I just went on a good day, but the tacos I got were fricken' amazing. I or","useful":2,"cool":2},"g_x80-o8SU6gKEwhk1OHEg":{"text":"My girlfriend and I heard great reviews and decided try to for dinner.\n\nUpon entering, the","useful":1,"cool":0},"VLdZfBTrCUQ0qBRFTf3MYQ":{"text":"I think the tacos are tasty for the price (try with the green hot sauce and \"El Camino\" st","useful":0,"cool":0},"d2GPfl5rzjBqSRRvqChrYQ":{"text":"My boyfriend and I were visiting New Orleans, and my sister recommended La Casita for thei","useful":1,"cool":1},"fG2ffbTB1fvq7W_bkgw_Aw":{"text":"Tacos were alright, I wouldn't mind going back during their happy hour when they're only $","useful":3,"cool":2},"ELlq2OgkhjEIPqAMGdydaA":{"text":"Awesome happy hour.  Tacos were awesome!  Papusas were delicious.  Wonderful guacamole!  T","useful":1,"cool":0},"l5f_RcOiFmegy0mVJy6iGg":{"text":"Stopped by this place on Oak street and decided to have some tacos. They have outside seat","useful":1,"cool":0},"9rGQNitJZFfrP2RDvMwsoQ":{"text":"Pika Pika Taqueria!\nPika loves coming here for lemon drop and during happy hour!\nVegan tac","useful":0,"cool":0},"voWMBc8aY4yQfNAwf-r-fg":{"text":"I used to think this place had the best queso in town, but I have to say I'm quite disappo","useful":1,"cool":0},"Rua310RSBbMhCxi4aTLsYQ":{"text":"Met up with some old friends here and we adored it! The restaurant is so cute and has an a","useful":2,"cool":1},"ts7QDOklvJKdWW6gYnFgsA":{"text":"I use to love this place  I'm not sure if it was the cook or the food but it wasn't good l","useful":1,"cool":0},"O-1K_Z0LijzgxqU9apmvoA":{"text":"La Casita Taqueria is now our goto restaurant for Mexican fare. We only visit for their ha","useful":1,"cool":0}}