{"foTQ5mXBoO4IZ-qdCa8WiQ":{"text":"This place was wonderful. The shop was closing in 30 minutes and he stayed to read for the","useful":0,"cool":0},"bWfOWTsw0W6ca3ar5SvNKg":{"text":"Wonderful shop full of interesting items and creative pieces. The owner, Sallie Ann Glassm","useful":1,"cool":0},"tgSA8J-jTPyIUWR59iPvMg":{"text":"Just loved getting to visit in person! The oil blends are wonderful, and I can't wait for ","useful":1,"cool":0},"OI8L7q4swkyD6PXjCsWJqg":{"text":"Where did all the culture go?\n\nWell, there's not much here in America.  And if you go to N","useful":9,"cool":4},"TQMqLy5aIBBN_jXuQPa_FQ":{"text":"yay, this is now down the street from my house.  what a great spot to peruse voodoo.  its ","useful":3,"cool":2},"HXfOK61FZbpoC6Bs79u0iA":{"text":"We had a great time in here. Mambo Sallie Ann was there and such a nice lady. I felt welco","useful":1,"cool":0},"DUuKNLep555o0p4TlE4jgA":{"text":"Madeline gave me a very accurate and insightful reading.  The shop includes many needful t","useful":1,"cool":0},"2gcMxCkE_1vwcHZax9XCWA":{"text":"So glad I found this place! Lots of candles to choose from at very reasonable prices. I in","useful":2,"cool":1},"v2GwoPKqa0vdHJXfja73bA":{"text":"make the visit, take it all in. if you want an appointment, better call a few days in adva","useful":1,"cool":0},"6z62YMgFwJti_WjU-w1wFw":{"text":"On our visit to NOLA last week, we were fortunate to be put in touch with Casey through a ","useful":11,"cool":5},"S3UEJfNZ9ytyvG7XnipmeA":{"text":"Omg!!!! I got a wonderful psychic and tarot reading from a reader there named Fatima. She ","useful":5,"cool":2},"HLYF2AVmVwg-O46PSLHvtw":{"text":"An excellent little curiosities shop! Not only is it a great place to stock up on candles,","useful":0,"cool":0},"O-XwAM17EpHoDbtu_GAoxQ":{"text":"I have done two readings with Fatima. The first one was so extremely accurate and insightf","useful":4,"cool":0},"IXfdQLo-fwA_RnAatmkbpg":{"text":"Totally in AWE!  I loved my reading! My coworker had recommended getting a reading with Fa","useful":2,"cool":0},"htux0dgwMlkk2-HIotugYQ":{"text":"Sweetie and I are such big fans of Sallie Ann Glassman, the Mambo who runs Island of Salva","useful":3,"cool":0},"sEFv1gF-Jj6Q_x1Y3n9ezQ":{"text":"Meh. It's ok. A little hard to breath in there but they were friendly. Their Daiwa's and f","useful":3,"cool":1},"XzhS53lZGntx0Pyoaq5DjA":{"text":"I had a reading with Fatima she was nice and positive. I received a reading from her but I","useful":3,"cool":0},"3zdAtL5w3ljdbgWY8fYLxw":{"text":"Wonderful shop with an excellent variety. The staff is very knowledgeable and the owner is","useful":0,"cool":0},"Pkgxfp7b9QFupNWADbaUaw":{"text":"I visited NOLA earlier in March. I did two readings on my trip and I went to the Island fo","useful":5,"cool":0},"FeLHSlyakBgJh8Nv7qp_jw":{"text":"New Orleans Birthday Trip = Vodou in the Bywater Area\n\nAfter being throughly disappointed ","useful":27,"cool":8},"zvPM1D9BxU2_s1VZiTXZMQ":{"text":"Love this place and Sally, such a gentle soul.. Don't need a reading so I can't comment on","useful":1,"cool":0},"irOSZgALwvucvkQA_khTcg":{"text":"My husband and I LOVED our visit to this shop and I had the best reading I've ever had! \n\n","useful":2,"cool":0},"BTvgmKM37lrbWv2swg4cfw":{"text":"I had the chance to visit this shop when I was in town. I wanted to shop somewhere other t","useful":0,"cool":0},"yB-pNrfXo8qxcXhyWLh__g":{"text":"If you're looking for a great store that gives back to the community, look no further. The","useful":0,"cool":0},"pkkZRK6TX_-_pss7UypJMg":{"text":"The Owner is as Sweet as Can be, and I was Thrilled to have Finally Met with her. I Had a ","useful":1,"cool":0},"LE6kCP6fT3pN2l2KWZKvBg":{"text":"I went in and had a ready with Ciara ( hope I'm spelling it right). She was a delight. At ","useful":0,"cool":0},"U5XXXyLCTLImXT88UGyf_Q":{"text":"Gary is LIFE!! I was so glad he was there to greet us when we arrived yesterday 7/23, as T","useful":4,"cool":3},"phiAQG5-NhgcdPqWHY1brw":{"text":"I absolutely loved this shop! It was recommended to me by a friend and I was not disappoin","useful":0,"cool":0},"9-mq-NSQDj5U8z5uJAdOBA":{"text":"I had a reading with Sallie Ann at the urging of a friend when we were vacationing in New ","useful":3,"cool":0},"1aZ_D_wUZdd9gqHuZBRSkw":{"text":"This place was recommended to me by a friend who lived in the city for years. I wanted to ","useful":5,"cool":4},"JWEfDGGiAd-pBA_jb7Krrw":{"text":"Cute oasis of spirituality tucked in to a quiet strip mall / building space. There's all t","useful":0,"cool":0},"tm7-QF1bQOiUp0r2k3cfTQ":{"text":"I absolutely love Sallie Anne. She really is a healer and one of the most warm, pure light","useful":17,"cool":3},"WcgHL-d2-a79BfDCMygmIw":{"text":"Loved this shop. I got a reading with Cierra, and as soon as I walked in, it felt like suc","useful":0,"cool":0},"0v0C4JQsIshLyy9rM8Yl_g":{"text":"I love this voodoo store. Let me say voodoo is not my thing, but on the lighter side if vo","useful":7,"cool":6},"2m543Bzqw--nnIfa5qyCDA":{"text":"I had a reading with Sierra.  My experience from the moment I walked through the door, I w","useful":0,"cool":0}}