{"PNu0nQQ3nRsqNjidJe-5dQ":{"text":"This team is fantastic, they do an excellent job and really pay attention to detail. They ","useful":0,"cool":0},"ad68KP6egvpQjnbmRdKRYg":{"text":"Quick and easy! The staff members are friendly and they have free vacuums to use.\n\n$2 off ","useful":0,"cool":1},"wcmM3Xf0MDaBucQOaTBMhQ":{"text":"The staff here are friendly and professional. I must admit I originally judged this car wa","useful":0,"cool":0},"rcOOfUDzT4zOxXAahQTVXQ":{"text":"Horrible service. Very rude. I would give them zero stars if I could. The only good thing ","useful":0,"cool":0},"EC9jRQoutKqq2sPTdan_Qg":{"text":"We were happy to hear they were building a Pelican Pointe in the city. Now that we've been","useful":2,"cool":0},"aT-8zK3DHKxF-musQNdmTw":{"text":"My poor car hadn't been washed in forever and I finally decided to stop at this carwash on","useful":2,"cool":2},"epjRACO73VFGEQX-8Of92Q":{"text":"Fun new automated car wash right here in the city.  Washes go from $6-$15 and they have mo","useful":1,"cool":0},"xOVB-7OER66xlpe-YKUtFQ":{"text":"good wash for the money around $15 for a super wash. I wish they had a prewash option, I a","useful":0,"cool":0},"rmgUNoXtcaXgZVmoBGLgjA":{"text":"Pelican Pointe are hands down the best car washes in NOLA. This location is fantastic and ","useful":1,"cool":1},"y_XQINlF2YcQUIiM8lBYIA":{"text":"I had good experiences with this car wash. The scrubbers do a good job cleaning and they m","useful":1,"cool":0},"hGBzZrx5-73LF1Ypf7yQxg":{"text":"I love Pelican Point Car Wash and was excited to find out that they had opened a location ","useful":0,"cool":0},"rZ3YgVd98no3VT1pmgZc4A":{"text":"Just went here for the first time and it was a very good wash and very quick too. Got the ","useful":1,"cool":1},"qKcvOAAKX6kKHmojf_Zi4Q":{"text":"I was expecting the Ritz of car washes just based on the appearance of this place from Cla","useful":4,"cool":2},"F_IVhICMIQFWCxMvzTjpAA":{"text":"Visited twice so far, impressed with the team, their attention to details and care for the","useful":1,"cool":1},"ZUCykR8il0OA6YGoC6OP_g":{"text":"Very professional staff. On a recent visit, my rear wiper cap was knocked off while going ","useful":0,"cool":0},"2C8YxRLTtX9yv2Mn76GkhQ":{"text":"This is the best car was place I have ever been to.  I stopped there today and there was a","useful":3,"cool":2},"wVS_J2wPC9njbWJXZKnobQ":{"text":"I really like this car wash.  Not the best neighborhood though.  Keep your wits about you ","useful":2,"cool":0},"GXrH7HT0nt7I2Jv1U1-0_A":{"text":"Such great customer service. They scrub the bugs off before going into the wash too, well ","useful":0,"cool":0},"x7l21X63tuo0QMNQbivcdg":{"text":"Great car wash not too far from downtown. They do a great job of getting the bugs off. The","useful":5,"cool":2},"NIZYM4NFkDZ5Iy3WoHoqlQ":{"text":"3.75/5 clean for what it is, scary lights.\n\nso you pay up, then you move through. i haven'","useful":9,"cool":4},"ACanntwDOi6dO-gOpUNNBA":{"text":"Good automatic car wash. Was able to accommodate my large truck (F-350 4X4 with an extende","useful":0,"cool":0},"RIOvQpy5H6EP-LEAzOssyQ":{"text":"It's pretty easy, the price is okay, and they were nice enough to tape down my back windsh","useful":0,"cool":0},"PAyqoKuLk9rSRMGE0aONVw":{"text":"This place is the best- my car comes out of the wash looking amazing! The vacuums (free) a","useful":0,"cool":0},"szMPUpjAwYVamQ20vjiwfQ":{"text":"Ooohh fancy new suburban style car wash, right by my house! The cheapest wash is $6 and it","useful":8,"cool":6},"BbJfd-i8aWfN6jSuUDqSIw":{"text":"It looks like the Pelican Pointe dropped their lowest priced wash from $6 to $5.  On top o","useful":2,"cool":3},"J5d-Tkc5kdNorNfPWu2WKQ":{"text":"I love Pelican Pointe Carwash. I bought the $19.99 monthly pass two years ago and use it a","useful":1,"cool":0},"yv8Hb28iZyDfRftsEDa97g":{"text":"I LOVE THIS PLACE!!!! Five bucks for a drive through car wash (close your air vents- the w","useful":1,"cool":1},"HXDO03Ed53d7bQBttp7gpQ":{"text":"I was treated very poorly here! There is someone I heard named damion that was talking abo","useful":0,"cool":0},"bzYFyd_phJh5QuwTRBOiOA":{"text":"Fast, they personally scrubbed my windows, and free vacuum for as long add I needed it! I'","useful":0,"cool":0},"dWCMlcx1KI_glD63x6-NQA":{"text":"The fact that you get free self, unlimited vacuuming, make life\nworth living .............","useful":0,"cool":0},"cmp6DyE3ZvEZ5lczBXADkg":{"text":"I remember when Pelican Pointe just had the location out on David Drive.  Now they've expa","useful":0,"cool":0},"xsANUT-rLtPF_dbW8nXzyA":{"text":"You really cannot beat a $5 car wash. Even my broke/cheap ass will find an excuse to 'splu","useful":5,"cool":4},"jntjwVh54tCxGn-SE5gwfw":{"text":"I'm going 1 star for a couple of reasons.\nI took my truck in first,  and noticed after the","useful":4,"cool":0},"hRd_OrggHP-HUgbd-ky6gg":{"text":"I had a wonderful experience here! One man working there was incredibly helpful. My friend","useful":0,"cool":0},"bDBngi5oVP4UAYQFXw0Wvg":{"text":"Great service. Guys where quick and attentive to protecting the cars rear wiper blade. Do ","useful":0,"cool":0},"bEn8t-nzVsoBVOBH_ke-1g":{"text":"Great car wash in NOLA!  Miss the towels provided, but maybe that will come back after COV","useful":0,"cool":0},"2L4mtsJ5EqMUqGH67RVO6Q":{"text":"Good car wash.  The employees were nice and scrubby the bugs off my vehicle I will be back","useful":0,"cool":0},"oc2RsjdakV26LwO3etGT3w":{"text":"Pretty good car wash with friendly staff, wash for bulk of the car clean, not so much the ","useful":0,"cool":0},"clGtx91WEPRStwDh-PSVfA":{"text":"Ethan and Shane! Thank you boys for signing me up and setting me up for success on the roa","useful":1,"cool":2},"vROQoanT2K3QDwtgWjDntQ":{"text":"They are suppose to open for 7:30am, but it is hit or miss.  One morning I had to wait til","useful":0,"cool":0},"AI4WYPkiEUGr4nq3NS6o3g":{"text":"With my favorite car wash still closed due to Hurricane Ida damages, my search led me to P","useful":9,"cool":8},"uosWWEQpOLPgF1_H-d-KDA":{"text":"There is no bug wash station and the staff that is supposed to brush for bugs before you e","useful":4,"cool":2},"v6e4Aq6C9pbVkk2pZcv_cw":{"text":"I love this place!! Second year working in New Orleans and your car gets filthy here!!! $2","useful":3,"cool":1},"dFy76Yx77rDxszlDuItu4w":{"text":"Alright, alright, alright...for an automated car wash, this is top notch.  They offer $6-$","useful":6,"cool":2},"u1v-NpYn6fVYdb21DPqQTQ":{"text":"So I am not a nice car mom, and on this (fingers-crossed) final day of owning Rhonda the H","useful":13,"cool":12},"65Ab3fsvU--eKkhmaijqug":{"text":"Went here te ester day because my car was in need of a bath. It was a nice brisk day,  and","useful":1,"cool":3},"5wKbfeX77T9P5Ms_qGmHzA":{"text":"They always use the brush on the people in front of me to get the stubborn dirt but they s","useful":0,"cool":0},"HomulNSkIdm_nyaeRupx6w":{"text":"Great customer service experience at this Carwash today! Warren (I hope that is his name) ","useful":8,"cool":5},"wMBnlnvd1U97uZpXuiaVDQ":{"text":"New discovery: I've been trying to find a decent car wash that could get the tree sap off ","useful":0,"cool":0},"Rm1ytl8gOu0_eKbOFtVxWA":{"text":"Automatic car wash with many options from just a basic wash to a more elaborate wash and e","useful":2,"cool":0}}