{"drZzTtBuKLojG4-l2A1HwA":{"text":"This location is larger than the location in Algiers but it is so far away. I wish they co","useful":1,"cool":0},"F-9Q1vVDvs1pM31bRJOOvg":{"text":"Its has the makings to become an absolutely amazing school with everything needed in order","useful":4,"cool":1},"9mXfWXD7OZ1Wlavjish5QA":{"text":"It seems like Delgado has improved on answering their phones on the main campus. The price","useful":2,"cool":0},"O2oN3Kj9cG0dSaL7X8CI1w":{"text":"The administrative staff is a joke. \n\nMost of the employees do not even pretend to care ab","useful":11,"cool":0},"Vs8c1M3kQZ7D-ZsQhaMgTg":{"text":"Trying to attend this school has been the worse experience in my life! I was in the milita","useful":11,"cool":2},"fJRWdbZ8I3IEaZWPiVQnZA":{"text":"This college is a joke. I need my transcripts from another college and some how you have a","useful":7,"cool":0},"-ZFqcL__-ZmNIQDADrKBeQ":{"text":"TL;DR Great campus/school, bad communication skills.\n\nThis school offers great resources, ","useful":7,"cool":0},"hFrQcucNsgsgyBYNvsxQ0g":{"text":"Even though this is a community college, in these times of tight purse strings, it is a gr","useful":8,"cool":0},"K75W2TAK9AF53QFdUoHIEQ":{"text":"This is the worst impression of a college I have ever experienced. Complete disrespect by ","useful":0,"cool":0},"6oyNX7hkq9AzFGW4lZwW3A":{"text":"Delgado - I love you and I hate you.\n\nPros: The size of campus is nice, the classes are no","useful":11,"cool":1},"F94IIkmFhVxBIHFRAqTBlw":{"text":"I have been attending for a couple of years. Ms.Juno my EMT teacher is awesome, always the","useful":3,"cool":0},"5zoNagS5BIFM5IZHgDbsxg":{"text":"I have been attending this good old place for wayyy too long now. They have the worst admi","useful":12,"cool":2},"YEXtkWIzLcwZyaQ3CS7-vg":{"text":"delgado was the worst school that you could possible ever want to attend! i had the worst ","useful":4,"cool":0},"DjeEl_K5kzXZfSdCqnTxXA":{"text":"Look, if you apply yourself, Delgado will provide you with all the tools and professionals","useful":2,"cool":0},"SQfcEkeGfJwnCG1zsIOScg":{"text":"If you are trying to get into the lineman program do not waste your time going here. The l","useful":0,"cool":0},"0y5x6quQGnWVDo4Latf3Zw":{"text":"So far I'm really impressed. The last school I attended was a 4 year university so I expec","useful":5,"cool":0},"fUeFAQK7fD7iip4AxKw7uw":{"text":"I had a wonderful experience at Delgado, from the English Dept to Biology to theater. When","useful":0,"cool":0},"r8xltS1wQ-ZHd4K41TsO-g":{"text":"This campus is my favorite Delgado campus. It's big. It's spread out, it's at city park. T","useful":7,"cool":2},"Xc9IcWvyjkDT-m_8ZfINoQ":{"text":"I do not even go to this school, I have never been a student there and they placed a hold ","useful":3,"cool":0},"NMrUZQxzdXWphs21BnspDQ":{"text":"Largest campus Delgado has. Nice location across from City Park. Brand new library. Clean,","useful":2,"cool":0},"wZcDflv9cctcBIL9V7ADgQ":{"text":"Good school with commited teachers. Very inexpensive. Bathrooms are always dirty.","useful":5,"cool":0},"DX8eZBdintDkf3zktkeH6g":{"text":"Surprisingly most of the teachers here seem happy to assist ! \nCons- some classes are so m","useful":3,"cool":0},"Sa9sgDB3Zk9MSCXTO0JzNw":{"text":"For a community college, this is not only a big campus with equally impressive buildings, ","useful":3,"cool":3},"2hiFs2qZqXhldvgIwyRoWQ":{"text":"This college is bad at all for helping their student. They just keep doing with money and ","useful":0,"cool":0}}