{"yC9dZVIc2X0FPxjM9tK5cQ":{"text":"Love the place.  Upstairs and downstairs seating.  I ate the fried oyster platter.    I as","useful":0,"cool":0},"UNs3hVwwZ6pCPvXOScp4uA":{"text":"Lovely simple hotel. Our flight was cancelled due to weather and we had to find a hotel la","useful":1,"cool":0},"wAO8wA8DLlYfqCyNDzkC7w":{"text":"I love this hotel.\n\nLove it.\n\nIt's so charming, an old renovated bakery in fact, but it's ","useful":2,"cool":0},"HNgXZ7BJRxTxKY9nDhefZw":{"text":"This hotel was pretty good.  We had a room that was definitely meant for one person, not t","useful":1,"cool":1},"qeikA9PEtjUXe3st7NxbzQ":{"text":"While our stay at the French Market Inn was overall enjoyable and the pricing rather accom","useful":4,"cool":1},"HMBtYqVSDo_H7G1FO1uXJw":{"text":"Very clean, AMAZING front staff (thanks Jen!), we had everything taken care of at a moment","useful":0,"cool":0},"yOjQu2XleU7M2IpvaaBJ2w":{"text":"So here's the deal. This place is a gamble. The price is great for the location. I hoed we","useful":9,"cool":1},"84AoTp9tsVKzIBa9YQmSCg":{"text":"This was a great stay hotel. Very old and very cool feel to it. I really loved our room, i","useful":2,"cool":0},"T4GL2EVHpLR9swm8L5S6Jg":{"text":"My husband and I stayed here during our trip to NOLA for Jazz Fest. The hotel is in a perf","useful":0,"cool":0},"7amvtokOj3aDTm0x_H0Xgg":{"text":"We stayed here for Southern Decadence. The location was good for that. I liked it was acro","useful":0,"cool":0},"yczOonNZCjnLQ3bu4APa4A":{"text":"I would like to give it 5 stars. The service at the desk and the doors was phenomenal. Eve","useful":0,"cool":0},"pfoo7svW5Lbn7h6fq7T8IQ":{"text":"This hotel was awesome!! Stayed here for New Years Eve. Great location to the Burbon Stree","useful":0,"cool":0},"8o6EPYlr8BN98vpLxa97TA":{"text":"Staff was very friendly. For the price paid, not bad, my room I selected had no windows. \n","useful":2,"cool":0},"_npcPfg2ewswXCHS6OduYA":{"text":"French Market Inn had great reviews and was highly recommended; sadly, I was not impressed","useful":0,"cool":0},"Y7Y4CtwJ5F4xrpGg1GRXHw":{"text":"I enjoyed the overall stay. The staff members were super friendly and helpful. The locatio","useful":0,"cool":0},"aaTNkUw5yXmXfsS9bqK-sQ":{"text":"We stayed here for Mardi Gras 2014 and had the perfect trip, the perfectly located Inn bei","useful":1,"cool":0},"ldOPKrZWCHKeKh8XOCCJxA":{"text":"Reserved my hotel by calling them but I didn't know they booked me on August when I wanted","useful":3,"cool":0},"502n6RuDBO8FpwJqInusng":{"text":"Love Love Love this place! It was my first time traveling alone and I have never felt so s","useful":1,"cool":1},"TegwNsVHO-Q27UZ7bHx-DA":{"text":"Very clean and the receptionist was very kind and knowledgable of the area. It's also situ","useful":0,"cool":0},"03gNnvrG7sJQs2_gSdt_TQ":{"text":"Nice hotel and it's not haunted. Go figure. Parking is a bitch!","useful":0,"cool":0},"Hz2wnfErGK4pIKNUajXjTA":{"text":"Our stay was during renovations, but our room was nice and renovated (windowless, but nice","useful":0,"cool":0},"ghLO9M7wEdnXQqHR6ItlCA":{"text":"Great place to stay!!! Great location and the service was amazing. The location was great ","useful":0,"cool":0},"B-4OwKutcTlDtqpBRLZy4Q":{"text":"This place is fabulous, right in the heart of the hussle and bussel of New Orleans without","useful":4,"cool":1},"Op7Mq5UGzTIFM0QZyU4oWg":{"text":"Everything they say is true.  It is charming, clean, unique, and in a generally good locat","useful":2,"cool":0},"rKwuq6FMP2F7pyhjt4zM2g":{"text":"We loved this quaint, old world charm Inn! Great staff, rooms are unique, comfortable and ","useful":0,"cool":0},"8M3oxKDkXOEy_-Cz31dLpQ":{"text":"We recently got home from staying at the French Market Inn for a week - excellent place, e","useful":2,"cool":0},"b356TRyP2RhaP9z5KjTnag":{"text":"I stayed for three nights and was extremely pleased with this hotel.  The staff is courteo","useful":4,"cool":0},"NmiqII9PG3xELjJ_w8eA3Q":{"text":"I have stayed here quite a few times over the years. it has a convenient location, but  th","useful":0,"cool":0},"3ddE6JcQF0cdA0UmfQ5Nmw":{"text":"Overall I would say a 3.8 or 3.9 is more accurate.\nRead on...\nThe French Market Inn in on ","useful":1,"cool":0},"Rw7VgsEiCLHc-7Je4GkA-Q":{"text":"This hotel was exactly what I was looking for in New Orleans! The perfect location and the","useful":0,"cool":0},"FDDaQZSTAKXRyk0H3mrZJA":{"text":"Quaint, historic, clean hotel in a wonderful French Quarter location. Not check in until 3","useful":1,"cool":1},"xmF4irsO-sT9efwI8zH7Lw":{"text":"We stayed about a week and this was a really good choice for us. Yes, we could have stayed","useful":9,"cool":4},"7EOopk2ceMLLf3mpWNPo6A":{"text":"We had a deluxe (?) room with windows out to a shared balcony. We thought it was a great l","useful":0,"cool":0},"nXdHclcE7HblfSVRgqH6Pg":{"text":"I really like this place. First time in New Orleans. Perfect location. Coffee shop right n","useful":2,"cool":0},"zve23f-2miFtZ6Hn1DpCag":{"text":"Well located, high quality for the value and dripping with charm jelly!  TIP: Keep in mind","useful":0,"cool":0},"N6yOOBBKSgQMsDyZ8Y_Efg":{"text":"Holy Cow, what an awesome find!!!!\nWe booked it for the price and the location, but we got","useful":1,"cool":0},"AS3chFjX1rXK75CWgLOZ_A":{"text":"Check in was at 4pm, they let us check in around 12pm because the room was ready which was","useful":0,"cool":0},"jNRJOJh4r2g-18Bhhs4S0A":{"text":"I love love love NOLA.... You name it, it's here. The food, people, atmosphere,  entertain","useful":1,"cool":1},"9fiX0sR-NGF4yChtFfGS-Q":{"text":"I hate to say this but the place is a shit hole.  I stayed for 4 nights and cringed every ","useful":1,"cool":0},"tC9VCChsQ-8l2H6RvW-khg":{"text":"We were looking for a place to stay that had the character of New Orleans, not one of the ","useful":4,"cool":2},"ukBLIWNlbXw1K7m8p5EWdA":{"text":"Small room.  View of Decatur parking lot. Side table dirty.   Had to clean it myself to be","useful":1,"cool":0},"5LwNsDdajL560WOyRp91PQ":{"text":"My family has continued to visit the French Market Inn anytime we visit New Orleans. Great","useful":2,"cool":1},"2i2Am_TjZN73DuGg0g-pfw":{"text":"We picked this place because of the good reviews and the central location. However, we exp","useful":2,"cool":1},"aZ6NTjMBAuKVUjMfOlgDOg":{"text":"If you want to have the ultimate NOLA experience, stay here!\nFirst, the front desk clerk w","useful":0,"cool":0},"FnCP6XaDwyT8EmJAbttc4w":{"text":"Stayed for 4 nights. Our room was a little small but that was expected and we didn't reall","useful":0,"cool":0},"s-gXOOjkryjbQjxpq41ODA":{"text":"Avoid at all costs. A few of items were missing from our room and nothing was done about a","useful":1,"cool":0},"Fv1ngMtkOVQDfJg-Z_88ug":{"text":"An order of comfort with a side of love, the French Market Inn will feed your soul...\n\nI h","useful":0,"cool":0},"8m20ygdlGIYQ_sa_VTl94g":{"text":"Since this last review my husband and I have returned to the French Market Inn two more ti","useful":2,"cool":2},"biORgg0rtWSFztsKppUx_A":{"text":"Do NOT let them talk you into an interior room!!! No, no, no!!! Dark, depressing. Like a c","useful":1,"cool":0},"JfrR8j7ruJVUp4k3ReXODg":{"text":"This hotel was AMAZING! We had such a great stay here!! The location is perfect. The staff","useful":0,"cool":0},"vr31RolX_OMCy6HASDlzrw":{"text":"Good location. But hotel is being renovated. I had a cockroach in my bathroom. Staff was s","useful":0,"cool":0},"8QCUm04eJjXnHhuUMeUR6w":{"text":"We did a 4 night stay in New Orleans for vacation. The French Market Inn was a great place","useful":2,"cool":0},"xOwzvMPifJdT-3Z_t2pwCg":{"text":"Great rate thru expedia.com. The staff was courteous but not overzealous about their job. ","useful":2,"cool":0},"1Oj6Ylz_VUQRYbiDc9_1tQ":{"text":"Stayed here for the first time over a very busy holiday weekend in the quarter. Despite a ","useful":0,"cool":0},"i91AHxo-Guoo6MpOLyZj-g":{"text":"Made a reservation to stay here through Expedia- paid in advance. When I arrived I was tol","useful":0,"cool":0},"xe8GG4b9N3DZT1odNfPERQ":{"text":"Great hotel! Close to everything you want, Bourban st (but still quiet)French market, rive","useful":0,"cool":0},"VI_-j7wp8JVOyjd_eShDTg":{"text":"Very nice boutique hotel in the French Quarter two blocks away from the party on Bourbon S","useful":0,"cool":0},"SEh2vYHgaKhhYMnVxb3G5g":{"text":"I wound up staying here for one night due to the fact that my buddy was staying in an expe","useful":2,"cool":0},"FdbP7RkcJKzfNpUjNmt4oA":{"text":"My boyfriend and I stayed at the French Market Inn last week and were provided the best gu","useful":1,"cool":0},"WPSwMIGUJelmCYqVGoKagQ":{"text":"Very comfortable beds and very clean rooms. Wish there was a mini fridge for leftovers. Ne","useful":0,"cool":0},"jeviqhEkAXh-lpGi9bWzEw":{"text":"I'm a little confused on people paying a motel price and being upset when the place doesn'","useful":1,"cool":2},"XMdTuQ8RghaEYaPLc3IpOw":{"text":"Beautiful hotel, courtyard, and rooms. Staff was all about customer service. Just a beauti","useful":0,"cool":0},"yYeVdaLZ3Jn9RrXKEFJ-Mw":{"text":"Perfect for the price.  Every employee I dealt with was helpful and most were friendly.  G","useful":1,"cool":2},"rYzWYFdNOL4EF6vrBxxdlw":{"text":"Want the French Quarter experience complete with beads, bourbon and beignets? Staying at t","useful":1,"cool":1},"sQdwm3CMeeYBQ6ZMfeW85Q":{"text":"This was a wonderful hotel!!!  The staff was all very gracious, and Lonnie and Nancy hooke","useful":4,"cool":1},"R32qHHk4DnwwCv9fpVw7Ig":{"text":"I really wanted to love this hotel but it was not to be.    The room we had was extremely ","useful":0,"cool":1},"o1K_SYqd0eMSjuPU3pptoQ":{"text":"AAAAAAAAAAAAAAAAAAAAAAAHAHAHAHAHAHAHAHAHAHA!!!!  IS THIS PLACE A JOKE???  That has to be t","useful":2,"cool":0},"FwMqbDZ0oqCqE9Nce2X2aA":{"text":"After reading the reviews for this hotel, I was a bit concerned. It was the only thing ope","useful":2,"cool":1},"XNb5QVcH_B6RzqGoEDj9Iw":{"text":"I was a little skeptical about this place because of a few bad reviews, but I'm SO glad I ","useful":0,"cool":0},"hNNlwbbgbV-czuomZ3WJQg":{"text":"I fell in love with this hotel. The rooms are in individual buildings and the people we tr","useful":0,"cool":0},"EtiKPzkuHTiu9bWcB4PTpA":{"text":"I've stayed here twice and I've finally had a chance to talk about my paranormal experienc","useful":0,"cool":0},"LvrBwut7Z7UGqyYUlvtkAA":{"text":"My boyfriend and I loved our visit to NOLA and our stay at French Market Inn. The French M","useful":1,"cool":0},"6O8EyG0bbtXdWrmBZ6eT_A":{"text":"Just stumbled into the courtyard area (while visiting a PJ's coffee and using the restroom","useful":1,"cool":0},"OxKetSQp5ePwhX-XZblSTA":{"text":"Stayed here for two days, one night and is located pretty much in the heart of FQ. Within ","useful":0,"cool":1},"nJvKuLsukSdaSlBlq_SfHg":{"text":"I stayed here over Labor Day weekend with some friends. Between us we rented three rooms a","useful":3,"cool":2},"dREBGCzZNPvMserrV9aXZg":{"text":"Such an adorable hotel in the heart of the French quarter! The rooms are spacious and deco","useful":1,"cool":0},"EkH5h5eOpus0zjc1aIyUig":{"text":"I'm telling you 8 times here it gets better every time great location in the heart of the ","useful":0,"cool":0},"nf8vi_5Rg0m_D1COwcdjvg":{"text":"Intrigued by the name, but I picked this place for the price and location. \n\nThe Service\nE","useful":4,"cool":1},"u9sHohudNbi6TcZQ90YIoA":{"text":"Quaint and cute with good friendly service.  It was very clean but not soundproof.  People","useful":0,"cool":1},"zcuD4ClHrTHCU_Quu-TNiA":{"text":"From the moment we walked in to the moment we checked out, the staff at the French Market ","useful":0,"cool":2},"r662JOSwSw3Epxm7pAtegw":{"text":"Stayed at this great hotel when visiting New Orleans and this place was the best part abou","useful":0,"cool":0},"cbPGHEDhAl9b_kMjhXDfZA":{"text":"What a beautiful, charming hotel. From the front you would never guess how expansive and l","useful":1,"cool":1},"ocm7ibDJHYX9kQVM4XNpfA":{"text":"This place is full of old world charm and the friendliest people ever!  Nancy checked us i","useful":1,"cool":0},"S1a2eOUgQSCsnpXpewaaXw":{"text":"Rooms were sufficient in size and comfort. Our room was close to pool which is noisy in th","useful":0,"cool":0},"yXv7A3BE21wDaiHAhThqLw":{"text":"I think we have a lemon. Dirty walls with footprints,  sticky carpeting,  had to call for ","useful":1,"cool":0},"55LrIfchzCyCuKz4Koj0Pg":{"text":"Wow- we LOVED this place. From the moment we walked in, we couldn't believe how warm and f","useful":0,"cool":0},"wiaQH_70m2vWPK5uL6Wmcg":{"text":"I came here over Valentine's Day weekend with my boyfriend a couple weeks ago. Right away,","useful":0,"cool":0},"D_SFmHDCdlxy4e5aigQcnA":{"text":"In the heart of the quarter, on Decatur Street, a minute from Jackson Square and a minute ","useful":1,"cool":1},"SLlHvAh6pi4eKqh8d2HWHw":{"text":"This hotel was recommended to me by my sister and her husband who enjoyed their stay here.","useful":0,"cool":0},"R67UHRmQ1v6anlx21OSmUg":{"text":"The French Market Inn was a fantastic way to spend a few days staying in the French Quarte","useful":1,"cool":0},"0UGRwPVTDAYSyxAG6xhgWQ":{"text":"Great location. Rooms are spacious. Staff are  helpful. Great customer service.\nNancy, fro","useful":0,"cool":0},"08oFl6GGDhzCzQkgSSpfxA":{"text":"Everything was very nice, very clean.  Concierge and front desk were very polite and helpf","useful":0,"cool":0},"huHdeanco4au4KbjLGdm-g":{"text":"Beautiful old hotel. The staff is very helpful. We loved it from the moment we walked in. ","useful":1,"cool":0},"BT-Y4hVaIrnHwGSZ6eBaGw":{"text":"Beautiful and a great price. Stayed in a balcony room overlooking Decatur for our honeymoo","useful":0,"cool":0},"Wj8NjNaNtTG3NdukFIjbvg":{"text":"If you are accustomed to chain hotels, please know this isn't one. The rooms are small, th","useful":0,"cool":0},"0qPCT0lV5W3QPiq_VAw_fw":{"text":"I really love the location of this hotel. It's right in the heart of the city with plenty ","useful":0,"cool":0},"YEA5oEekEAckiNj__aaJCg":{"text":"We stayed at the French Market Inn seven nights, and will definitely stay again whenever w","useful":0,"cool":0},"5OstpuTFCyhL8J97Q_hVqw":{"text":"French Market Inn is a very quaint hotel in the heart of New Orleans' famous French Quarte","useful":3,"cool":0},"nDYKAIfCAcmjP1dvY4-pig":{"text":"Just spent the weekend here and it was great!!! The location is phenomenal, right across f","useful":0,"cool":0},"cslLQ4YgMwqLVIscI7GY5g":{"text":"Front Desk/Bell Captains get a 5 star.  They were all pleasant and helpful.  Not so much r","useful":1,"cool":0},"_MQy590SgkigAK6QAHBtYA":{"text":"My first time in New Orleans and so glad we found this hotel. My sister and I shared a roo","useful":0,"cool":0},"ktpXzfuZp25wdF1zaMyC_g":{"text":"Horrible experience! My mother, sister, and two small kids (1 and 4) took the train to New","useful":0,"cool":0},"dOV_b1pKWxz3JTvycVKTeA":{"text":"We love, love, loved our experience at the French Market Inn!  The staff was good, but the","useful":1,"cool":0},"QX6JZY8agMgVqTRz4DgFZg":{"text":"Great price and the hotel staff is super friendly. The rooms are cozy and have a rustic fe","useful":0,"cool":0},"QBH9JFvzrCMta8vaj9utCw":{"text":"Hotel is very clean and has great character. Staff was very friendly and helpful. There's ","useful":0,"cool":0},"34EmJ04zriBvZOOsiLodTw":{"text":"I stayed at this hotel this past weekend, and was glad to find a place at a good price and","useful":0,"cool":0},"IFZiLX3E_yPz6NGgVm8SIw":{"text":"This is actually the worst hotel I have ever stayed in.  \nI have traveled the world and th","useful":0,"cool":0},"S0gny1X3TtuSpZIvYQBIlQ":{"text":"Very nice room. Good deal for the money. Only 1 complaint, there is nowhere to put the soa","useful":0,"cool":1},"CYw7PaizIIdLABZXE5KtNQ":{"text":"Great location and in walking distance of Bourbon And Royal Street. There are ton of amazi","useful":1,"cool":0},"QJ2SIEVg925kTpYz08eDXA":{"text":"We really enjoyed French Market Inn.  Quaint hotel.  Service isn't over the top but it isn","useful":2,"cool":0},"TIUC2UKvw6WimoIGLdTMKA":{"text":"We stayed here for four nights during JazzFest, 2014.  Prices during JazzFest are always v","useful":1,"cool":0},"9G1rwbtGYCYWB4R1m7Pl7g":{"text":"A friend referenced me to stay here. He accompanied me too and mentioned how they've since","useful":0,"cool":0},"bGO8DKOE7MD9rugaXO9MAw":{"text":"Such a great stay. The hotel is located in the best place possible to travel through New O","useful":0,"cool":0},"lF4I3Dj48nWzAPOlg4-90w":{"text":"My experience could have been better.  My room was small, though quiet, and without a wind","useful":0,"cool":0},"xLI5YkWIAh3O202pYPXupA":{"text":"I went to NOLA for my 50th bday with the bff.  I did my research and needed something remo","useful":1,"cool":0},"PwD7TmaSqC4881CcyNtKGA":{"text":"This is the second time we have stayed here. Each time we were impressed by the service an","useful":1,"cool":0},"HWBp7hvxsS10og-UR2x3OA":{"text":"I spent 4 nights at French Market Inn.  The hotel is in a very good location in the French","useful":0,"cool":0},"1g5xmEY6wpbePOW__OMqdg":{"text":"Very nice hotel with tastefully designed rooms and beautiful and spacious courtyard with c","useful":0,"cool":0},"VAzBx7eyRecj7GASTEU6fQ":{"text":"This hotel was great for the price. Very clean and has the coolest French Quarter Style. O","useful":1,"cool":0},"Y1LtcP_KC6WVN2i6rPGh3g":{"text":"This hotel is amazing and has a lot of architecture. I loved staying here . The only thing","useful":0,"cool":0},"VkeSa6k3n011T3-liQpWmg":{"text":"I made a mistake when making a non refundable reservation and even though I called the hot","useful":0,"cool":0},"XVm8zFk61uvXfs5k-8ioMg":{"text":"Probably my favorite hotel I've stayed at in the quarter to date. I love the exposed brick","useful":4,"cool":0},"Vyep8qkbZpcW78Z7f1wnmQ":{"text":"After lots of research, my husband and I decided on this hotel. We stayed 3 nights (6/9 - ","useful":1,"cool":0},"4ORuB6UX2gfX2-vlxPq_gg":{"text":"FMI was a nice place to stay. It had its high and low moments but overall, it was a good c","useful":0,"cool":0},"wgOz6RxgGHkLKQAfmEggVQ":{"text":"The French Market Inn is hands down one of my favorite hotels. It's a true \"hidden\" gem, a","useful":2,"cool":1},"Di5MvoG2CUsnueHQPc1qrw":{"text":"French Market Inn is currently under restoration, but everything about this place is just ","useful":2,"cool":0},"kNWj7vFGhl4WNAZcRdOS7g":{"text":"Can't beat the location. Within walking distance to Jackson Square and other popular sites","useful":2,"cool":0},"gX4tLBwqbYJKsrEUEudDjw":{"text":"We stayed at the French Market Inn the 19th and 20th of April 2015. Our room was great, al","useful":0,"cool":0},"pHLT75-H0NHClwNHtGjPUA":{"text":"I recently stayed here on my first trip to New Orleans and I have since become obsessed wi","useful":2,"cool":0},"krpMckfJ2-YSyulLDGdYjg":{"text":"We have stayed at the French Market Inn twice in the past three years. We love New Orleans","useful":0,"cool":0},"r46oiUSekXnmebXAJKQwOQ":{"text":"French market Inn is the only place we stay in Nola. Perfect location, beautiful rooms and","useful":0,"cool":0},"CYA5TYihgWgUCYSQJk4CwA":{"text":"Not only did we have an amazingly cool brick walled room with the only balcony on Decatur ","useful":0,"cool":0},"PB_l1swKBnivbs5LRyT3cg":{"text":"I room I stayed in was very nice and just what I expected. The exposed brick was beautiful","useful":1,"cool":0},"RAGBH50cZgLB9_LLYEwy4A":{"text":"I've waiting forever to write this review. :/\n\nThe staff was exceptionally friendly, agree","useful":0,"cool":0},"ZZf94rxjykJbXlkuuphgWA":{"text":"What an wonderful hotel!!!!!  It's perfectly located on the edge of the French quarter so ","useful":0,"cool":0},"hv7-u0xh_mJWeTsiYVfSPA":{"text":"I loved this quaint hotel! Location was perfect, dozens of eateries, shops, and bars withi","useful":0,"cool":0},"aHULmido6lfdoIEN3VN5XQ":{"text":"What a treat. So close to everything. Didn't have windows in our room but that was fine. N","useful":0,"cool":0},"Tg8CtCmklVDdqXESUzBEAA":{"text":"The location of the hotel was perfect.  Decatur St. was a bit \"tamer\" (which we preferred)","useful":0,"cool":1},"PaswUQ91HPTuiATyuNSLMA":{"text":"It's probably not easy to host a bachelor party of 10 people. I woke up to my shoe in the ","useful":2,"cool":2},"TFddLrZPR5ag2ryknZ43lA":{"text":"We ended up staying here by chance after we decided we were going to extend our time in NO","useful":0,"cool":0},"wWQ7goDo7s7MVZPwwyFfhQ":{"text":"Stayed for four nights at surprisingly low rate.  Excellent service and location. It is ex","useful":1,"cool":0},"gpckmvXJHXcu53V0VWmkoA":{"text":"Stayed for three nights. Room was clean, comfortable, and within walking distance of Bourb","useful":3,"cool":0},"mqxGkxW81A4Q1iT0Kt4HDA":{"text":"We stayed in an outside room facing the courtyard and the room was large, awesome, and spe","useful":0,"cool":0},"9eE-pHSi9RdAJ9OtizPsfA":{"text":"DO NOT STAY ANYWHERE ELSE IN NOLA.\n\nHotel is in a perfect location with really nice rooms ","useful":3,"cool":0},"pnZlcymWXmuDyZt8EnzMlQ":{"text":"We loved this inn! The staff were all extremely friendly and personable. Our rooms were cl","useful":1,"cool":0},"mDmQMhoEZKynBGtEJFi9eA":{"text":"Loved the French Market Inn! Charming building and beautiful comfortable room away from th","useful":0,"cool":0},"DOjl4Ihf2fS4kCTG8C7rvA":{"text":"Great experience at the French Market Inn! Awesome location. Friendly staff. They even hav","useful":1,"cool":0},"ZUmapiKjB0dmJ4JswaseQQ":{"text":"Good: The staff was very friendly and helpful. The room I stayed in had a nice view facing","useful":2,"cool":0},"zI3bXId0_Frxd9zwxjgIDA":{"text":"GREATEST HOTEL IVE EVER STAYED IN!\n\nEverything about the French Market Inn was gorgeous, t","useful":2,"cool":0},"6I62ldYsvmFejKcIzUqofw":{"text":"Accommodations are 'ok' only. If you decide to drive a car, DO NOT use the hotel's valet. ","useful":0,"cool":0},"stUD218LhYy_ixLotsEdkQ":{"text":"Beautiful, but small, interior room, no windows.  I was fine with that, as I wanted total ","useful":1,"cool":0},"JkmmCEOOtDRAR4Ydp7bg2A":{"text":"Stayed at this hotel for 3 nights during Mardi Gras and loved it!  The location is within ","useful":0,"cool":0},"iVvVtePFt4Y__6Cpfu4wYA":{"text":"Stay in room 401 and you won't regret it! Everything is clean and there was just a pleasan","useful":0,"cool":0},"11MMgO8-JAZs7N86-j4H5w":{"text":"I've been to NOLA the past 7-8 yrs and finally stumbled upon the best hotel! Perfect locat","useful":1,"cool":0},"gVhFz7o3vbBHOYKUR87tEA":{"text":"I booked a king. We got two doubles. The ceilings were maybe 6' high. The bathroom was sla","useful":1,"cool":0},"UEiskn-DffJJnMZPA1nLUg":{"text":"Just got back from a 3-night stay at the French Market Inn. I booked an interior room for ","useful":2,"cool":0},"Gs9zL3hYKstvn1JHKh8aag":{"text":"OK, so the location is fantastic and the hotel itself is quaint...you'll be within walking","useful":2,"cool":0},"_sNTJ8ZQafQZPL9l5Ni1NQ":{"text":"Located in the French District, we found the French Inn hard to find.  We were told they h","useful":1,"cool":2},"_8F9yF_li6HWGmBR5ibfnA":{"text":"Came here for a bachelorette during French Quarter Fest. We had 5 rooms. All were in reall","useful":1,"cool":0},"ZTLqT4vVHICqKjKAJTvnVg":{"text":"This inn make-over was done things right.  Ideally located in the old quarter, attention t","useful":0,"cool":0},"hhU0KxN-Lnjg9HsellsDcQ":{"text":"I adore this place, the location, the feel, the history, the coffee shop, the resident kit","useful":1,"cool":0},"CSdgpCVLgCmvINOnSgmiBQ":{"text":"Terrible customer service!!\nIrresponsible and rude staff \nNone of the hotel's features mat","useful":1,"cool":0},"ioQMYLBhNX7ihpaAo26DsQ":{"text":"In the French Quarter? Check. \nBoutique hotel? Check. \nClean rooms?  Check. \nClean bathroo","useful":0,"cool":0},"pMul5tHfDDC5X-XZyHodzQ":{"text":"Would I stay here again? YES. Is it haunted? YES. Other than that it's honestly very cute ","useful":1,"cool":1},"XM41BwTtYnD3FFPlnIg4MQ":{"text":"My friend and I had a spur of the moment trip to NOLA. Knowing absolutely nothing of this ","useful":1,"cool":0},"2cRLJ7BjXRwcsCs-DVNLvQ":{"text":"LOVE LOVE LOVED this place. It's old school charm and exposed brick make the boutique hote","useful":0,"cool":0},"qlujoSOpz1HBmGyy-DWwfQ":{"text":"I stayed at The French Market Inn for a bachelorette party when we decided that Bourbon Or","useful":0,"cool":0},"5q1mQy7zya0WCRkjZYeqXQ":{"text":"This is such a beautiful place.  Great location with easy walking access to great food and","useful":0,"cool":0},"Eg1ZRAF-e86-l726RYgt3g":{"text":"Great hotel on Decatur Street in the French Quarter. Try as I might, I can't think of a ne","useful":3,"cool":3},"kDgbEMuHM1t6FKRacGqbIQ":{"text":"A great hotel in the French quarter! Great location, prices were very reasonable and rooms","useful":1,"cool":0},"17z4Y4hGFnP-JFZEyCmDRA":{"text":"Quaint little boutique hotel. Service, location and convenience will be the reason I retur","useful":0,"cool":0},"m12HeT9e77JeXJ_Wewv-MQ":{"text":"Best service in New Orleans. Nancy was an absolute delight. NEVER have I been received mor","useful":0,"cool":0},"Bl5zdOWzopeoNLdwMTR9xA":{"text":"Very nice place. Great location. The view of the Mississippi River from our room was aweso","useful":0,"cool":0},"dpkcQRxuTOjkU-PY73WWxA":{"text":"When we checked in they were in the midst of renovations so the Wi-Fi was spotty and there","useful":1,"cool":0},"mDk3CyJFT83qSBFgBeSGKg":{"text":"Ok, yes, the staff mostly blows.  Most of the employees are unfriendly, but one was relati","useful":4,"cool":1},"Vp_hbiIeMdBzxOkWVVsgdQ":{"text":"Wonderful hotel. Very quaint and old world making for a very charming building. Everything","useful":0,"cool":0},"pdjqaPiRfuRVlq_wG4C4ZQ":{"text":"Excellent location on Decatur.  Could not have been better.  Just 2-3 blocks from Bourbon ","useful":0,"cool":0},"zopemHUpXIrlrqmpbTul9w":{"text":"As a frequent traveler, it takes a lot for a hotel to be one of the best in my books...but","useful":5,"cool":1},"gOa85B9qrfQgtRuQ0oDTUA":{"text":"Ok so I will start off with the pros: I have 0 complaints with the staff. Everyone was ver","useful":0,"cool":0},"JTQKs2X5jj9p_CgfmltQeQ":{"text":"Beautiful hotel with a great courtyard.  Very reasonably priced and very close to everythi","useful":0,"cool":0},"6G4L6slZLvLbZD8G-i5DKw":{"text":"A well-located hotel in desperate need of some refurbishment. The staff is friendly, helpf","useful":0,"cool":0},"z_FQF6A3nu74ERrTK7y4-A":{"text":"The staff was amazing! My best friend and I came into town for the film festival. I had re","useful":0,"cool":0},"x6AD5L9T2iQaWwkJlgiQQA":{"text":"They still haven't remodeled the entire building yet so so some rooms are updated and othe","useful":1,"cool":0},"VyDgrOeGWsBOxfoA52Kzjg":{"text":"This is an affordable decent hotel located centrally to all the main venues such as Jackso","useful":3,"cool":0},"UQH1orJ0DuSCFCrTwklwqg":{"text":"Stayed for three nights, including New Year's Eve. Friendly staff & clean, comfortable roo","useful":0,"cool":0},"7vYGlO8bAyXDwFxHyGu9Qg":{"text":"A great location for a hotel because it's very central to many attractions including Bourb","useful":0,"cool":0},"NI13enEjZcSszYUJ6U9FoA":{"text":"This place had some great character as well as some working here. We stayed during the rec","useful":0,"cool":0},"37DTkRYIpccTg6ZbJAQldA":{"text":"We ended up staying here by chance when we went to New Orleans for a week.  This hotel was","useful":6,"cool":2},"63RmMFZNwJYN15WV-su2Bg":{"text":"I've stayed in or near the French Quarter several times. I was expecting historic, but I w","useful":1,"cool":0},"xe_ZPGZhDpC8zC3DMzh67w":{"text":"I've stayed in most of the hotels in the French Quarter at one time or another and I have ","useful":2,"cool":0},"3tavGAJdaRB6YbnnTVwCBA":{"text":"Great location, great service, tiny, tiny, tiny, windowless room. If you book with French ","useful":0,"cool":0},"TcYIYAUi98n1qjpyRkeBvQ":{"text":"What a great place to stay! Right across from the Mississippi and walking distance to ever","useful":0,"cool":0},"eGA1islCuWueeyF26Y1e3w":{"text":"I've stayed at this hotel twice now and I really love it. The location is by far the best ","useful":1,"cool":0},"Uostw8We18C-7XkhzbLK9A":{"text":"This place is a gem. Stayed here last week for my birthday trip and I loved it. The only n","useful":1,"cool":1},"pbS4-hb9K7G5U2vORiV0yA":{"text":"Just stayed there during Mardi Gras(one week)- Was built 1833 !!!  Yes its old and a maze ","useful":2,"cool":0},"K8g0Kpnp18hyr8PYSea4qg":{"text":"I stayed at this hotel with all of my friends for a wedding recently--I was annoyed to cha","useful":8,"cool":1},"CZvWInzKmka9ItSIgLV1AQ":{"text":"The hotel was very nice. If you are looking for the modern hotel and don't like quaint old","useful":1,"cool":0},"4fsugKtJapePHPBGauM1og":{"text":"My husband  and I frequent  this hotel  in the past and their \"sister\" hotel. I will say t","useful":0,"cool":0},"BKTl_Ybw_MT1v3cGuMqV9w":{"text":"We absolutely LOVE it here! It was our second time in New Orleans, and we loved staying at","useful":4,"cool":0},"8Xx9A_OA6SeK8NDjU5uw7w":{"text":"Having lived in New Orleans for 4 years pre-Katrina, I was excited to bring my husband bac","useful":0,"cool":0},"PAw6tcKhO2v8vUnkVew7zQ":{"text":"This is a great hotel to stay at when visiting New Orleans! It has the French Quarter char","useful":1,"cool":0},"qpzWPz-SrS9_fMbCwTyKhA":{"text":"Best find of the trip! Staff was bend over backwards helpful! Rooms where immaculate. I co","useful":1,"cool":0},"Z8WhwiBuAS1tHpZy4NfSrQ":{"text":"What a beautiful hotel! My SO and I spent 4 nights here over Thanksgiving in the Petite ro","useful":1,"cool":0},"Sag9ot-H71-UC9QZ4t7PKw":{"text":"After reading some of these reviews, I was prepared for the worst. Thankfully, reality far","useful":0,"cool":0},"lslhec9qZKErzv3rEgKPHA":{"text":"The staff has been great the valet parking sucks the rooms could be alot better but over a","useful":0,"cool":0},"PQBuX0PAZ6y91UyumntMqw":{"text":"OK so I originally was gonna bash this place mainly because our last nite here was terribl","useful":2,"cool":0},"ezwzC_Z-gCMBo6oXaXvJDQ":{"text":"As one of the previous reviewer's noted... Do not stay here if your looking for a cookie c","useful":0,"cool":0},"Q0hLjxd79sA4dtyssYsnpQ":{"text":"Upon arrival, the first thing I adored about this place was the service. The staff assisti","useful":2,"cool":0},"MnX5ZE6Do1Egsy21-L_jMw":{"text":"This hotel is wonderful.  The staff is outstanding all the way around.  The room was very ","useful":1,"cool":1},"QMdWeMIf5_DUU7R6SB6csg":{"text":"Stayed at the French Market Inn for one evening.  This is a sister hotel to the Place D'Ar","useful":0,"cool":0},"ytV3C5714ymnieMqwVAbig":{"text":"Very well located hotel in Decatur St in the French Quarter. Walking distance to most attr","useful":0,"cool":0},"VdkOMafz8Cw2eALeqBC19g":{"text":"A cute Inn right in the middle of the Quarter. I enjoyed my stay here very much. The staff","useful":0,"cool":0},"-kasgGf8qJpx2z0Of_7WEQ":{"text":"I last reviewed this place back in 2010 and was totally unimpressed at the time.  I stayed","useful":3,"cool":0},"nLt5DnNCVwWny1EPdyHI-A":{"text":"Just got back from a 4 night stay. Loved this hotel. The location was amazing. We were goi","useful":1,"cool":0},"ii1ZDVvZXSmyghtV9wln-Q":{"text":"Okay...so if you're going to come here, you need to understand that this isn't anything li","useful":3,"cool":2},"3I0f6C1HFdg1TPs4FF3HKg":{"text":"I think that The Historic French Market Inn has potential.  It could probably be really ni","useful":0,"cool":0},"CXoQaKO1MWzIv6TFowtT3w":{"text":"My wife and I just came back from a stay at The French Market Inn. This place was awesome.","useful":5,"cool":0},"_c7rFsD5znwpgVdHftzA0w":{"text":"Wonderful location. Beautiful building. Great courtyard.  I made a reservation 5 months in","useful":0,"cool":0},"aVjqIrP_4eSbgVKVkRikIQ":{"text":"I'm a huge Yelper when it comes to leaving reviews as we travel. If you ever go to New Orl","useful":0,"cool":0},"mKlw3G2jyeklUknvicXZ0Q":{"text":"Fantastic, Fantastic - right in french quarter, walking distance to everything, fabulous r","useful":2,"cool":0},"cnJl0LPaDAY8GP2H7AMIYA":{"text":"My boyfriend and I stayed here from Friday to Monday of Superbowl weekend. It's the perfec","useful":0,"cool":0},"ah9K7si1A3kbM4PYRXG6lQ":{"text":"So there's no way to make this short. My husband and I made a quick trip to new orleans to","useful":11,"cool":0},"dbgDbIg7OZ_oyHSBVFAx9g":{"text":"The location is fantastic...close to Bourbon, yet far enough away to avoid most of the noi","useful":1,"cool":0},"qD9iXmuSrEAi9cXKNK1f5g":{"text":"I loved the CHFMI (I haven't been there in a decade, but when I was there I LOVED IT).  Mo","useful":2,"cool":5},"cZ0H_ix7Yd5SWstgfUrY0A":{"text":"Great hotel - quaint setting with an interior garden / definitely feels like your in Europ","useful":0,"cool":0},"hUE0xWQJkNYO3Jp7rI4ekg":{"text":"Nice hotel, location is PERFECT-friendly staff at the front desk gave my boyfriend a bottl","useful":0,"cool":0},"BOSkre3-Tv0PIUWIG20AaA":{"text":"Definitely located in a great spot, but with the remodeling that will go on forever, and t","useful":0,"cool":0},"RXNvSjR-jD5cEl3k2xhSug":{"text":"Update the did refund a night of our stay and the main owner manager called and apologized","useful":4,"cool":0},"OoXly2DHxCDhyYzJ3x3-Fg":{"text":"Great cozy boutique Hotel gave excellent dinner and breakfast suggestions and very friendl","useful":0,"cool":0},"vpD72ntMOJe5esbq6quiGw":{"text":"My friend and I were walking down the street when the door to the French Market Inn popped","useful":0,"cool":0},"K8O-J_lZCWfOTT5018sh_g":{"text":"I had a girls trip in New Orleans this past week and we loved it. The French Market Inn wa","useful":0,"cool":0},"DUE434ztvlOK4Vw4PA_f5Q":{"text":"Stayed at the French Market Inn January 7-12, 2018. Loved my room, everyone was so nice an","useful":0,"cool":0},"Fe_m0ZyKwr64arcn101Mbg":{"text":"There were no windows. I asked several times for a different room and they never gave me o","useful":0,"cool":0},"cvYdVLY-UIU6g-ib-4c5dw":{"text":"Beautiful room. We had the king bed window room. Spacious & very affordable. Loved the loc","useful":0,"cool":0},"bj_0-PgCoTSUPE9_Ulyteg":{"text":"I had the best experience at this hotel! Not only was the place itself beautiful, but we h","useful":1,"cool":0},"_jDZemuR0xh5IS4v3my3Mw":{"text":"Beautiful place, beautiful views! Got our room but then said they could upgrade us to a la","useful":3,"cool":1},"ffyKx-9PBwxi_npLafI9bw":{"text":"This Inn was everything we were looking for. The location was very central so we could wal","useful":2,"cool":0},"1qXLIwNAUyRrbOMJhvHPMQ":{"text":"I am very conflicted as I write this review. The outside of the hotel was very cute and ev","useful":3,"cool":1},"_LB0sL1kXdm1oCxUg5xf0A":{"text":"On my first trip to New Orleans in April '09 I stayed at the French Market. I was SO excit","useful":2,"cool":1},"OW7i_VO2iW3jPj1sdm4AqQ":{"text":"Perfect place for us! On the river side within walking of everything in the French Quarter","useful":1,"cool":0},"rrrvC7ud_iK-WVXZIb0EyQ":{"text":"My fiancé and I thought this place was magical but we had a few hiccups. On our first day,","useful":0,"cool":0},"2ciOHcSSZpz5n8Z88Z2gtQ":{"text":"I would absolutely stay at the French Market Inn again. We got a petite exterior room. It ","useful":1,"cool":0},"OZ4i96axA8yQIdsBd5g98A":{"text":"I stayed at the French Market Inn for my recent bday (from jan 21-25). This hotel is nice ","useful":3,"cool":0},"A1UyH_GVvo2hPwAQcZdnZg":{"text":"This was HANDS DOWN the best hotel my grandma and I had ever stayed at. Not just because o","useful":5,"cool":1},"p_X6a-cJOd5NZW_jEfv_7A":{"text":"Perfect. Near all the excitement and just walking distance from great restaurants. Lots of","useful":0,"cool":0},"g3r6Ty5OaTV6mslKlJZmKw":{"text":"We loved our stay at the French Market Inn. Our room was small, but well appointed, beauti","useful":1,"cool":1},"64cdvRMD0Ce_O7Q522KV-A":{"text":"French market inn is in a great great location and the atmosphere matches the city. The co","useful":0,"cool":0},"7ntjCoyDiOqlHQtbrEG39Q":{"text":"We have been visiting New Orleans for 20 years and stayed in  many various hotels thought ","useful":9,"cool":1},"G20xtrUkrI8Qz4rge_LxqA":{"text":"We stayed here for two nights, upon arrival  there was a thunder and lighting storm very h","useful":2,"cool":0},"qTxzVFK_nD3eNmovOUjK-w":{"text":"The hotel is nice and gives you that old school New Orleans vibe when you go in there. Whe","useful":0,"cool":0},"ek7ZMlpcdF0FnR70X39YLQ":{"text":"Charming, one of a kind gem. Friendly, attentive staff at all times of the day and night!","useful":0,"cool":0},"YNb9uU1YmGPtgb_d-tCtjg":{"text":"Spent my first two nights in New Orleans at this lovely hotel back in April of this year. ","useful":1,"cool":0},"vlV8OEPRNAZzR1WMsjCw7g":{"text":"First time to New Orleans, had a great food experience at the original French market. Wher","useful":0,"cool":0},"0-HBIuy9C7vCumMTxZ9i_w":{"text":"For a cheap \"boutique\" hotel in the French Quarter it served its purpose, but I probably w","useful":2,"cool":0},"PE-_2ks5ZVtfxdEVB2DQ9A":{"text":"Amazing!!\nI've been to New Orleans several times and have stayed in many hotels.  This is ","useful":2,"cool":0},"lblKMDYpp9DFKAkNryfCwg":{"text":"My husband and I stayed here on our honeymoon and we just loved it. It is a beautiful hist","useful":0,"cool":1},"J8frEtNk-E-mQZynL4hGGw":{"text":"Loved our stay at the French Market Inn!\n\nWe had an interior room with a Queen bed that wa","useful":4,"cool":1},"eprsi-Ierf-2_ldnW26KNg":{"text":"Wonderful stay during the week of thanksgiving. Two adults and two kids, stayed in a balco","useful":0,"cool":0},"LmJ6Km9U2-H4REOQ4h_Shw":{"text":"We had a lovely stay at the French Market Inn. \n\nOur room was small yet comfortable. Renov","useful":4,"cool":2},"teosoaNhN7TZA2j2J2L18Q":{"text":"We had a balcony room and the room has a tremendous amount of character.  Staff were alway","useful":0,"cool":0},"Tn0lWNHTp3o-DNDZSw9_Yw":{"text":"I thoroughly enjoyed my stay at the French Market Inn (Feb. 4-8).  Most notably, the emplo","useful":2,"cool":1},"FeZtyLRYIGdkGrU5GTqUGw":{"text":"I stayed at the French Market Inn during our recent trip to New Orleans. \nIt was during Ma","useful":3,"cool":3},"OASXRx5wXPrMuHddp77PBA":{"text":"Enjoyed a really lovely four-day stay at the French Market Inn with my three grown daughte","useful":0,"cool":0},"wyU2iEgHiH8oMz7dHxttKg":{"text":"The staff is very nice and very helpful. The hotel is beautiful and quaint. The rooms are ","useful":0,"cool":0},"44LGQjtvWpD8zF73bf_s1A":{"text":"I planned a trip to NOLA to surprise my husband for his birthday and Christmas. I was real","useful":0,"cool":0},"ghi6MsTnTPit0UT0pYz9Rg":{"text":"Hidden gem. Love that its close to everything. Its in French quarter so walking distance t","useful":0,"cool":0},"Fu_fpA10NxBNWwtM1_FCKA":{"text":"Super cute hotel!! Love the brick walls and the feel of the rooms!! The front desk was ver","useful":3,"cool":1},"teVzcbF9pnOeSxbwn45j9g":{"text":"Great location, friendly staff and beautiful room!  We had a balcony and loved sitting out","useful":0,"cool":0},"fXccbJ9g2UDJdJS3YJY56Q":{"text":"Loved every minute if our stay!  Beautiful rooms, clean, perfect balcony and great locatio","useful":1,"cool":1},"VRIO13xtamCY-1lyKMNCDA":{"text":"This was our first time in New Orleans and we absolutely loved staying at the French Marke","useful":0,"cool":0},"s-UXGnOx4yzhrNJ0PE_eRQ":{"text":"Our room was old and interior.  Which is fine.  But the carpet was sticky because it was o","useful":1,"cool":0},"C041NQ2m3P5Z4dL13IRDZQ":{"text":"For the location & the cute courtyard & decor, you can't beat the price! Staff was friendl","useful":2,"cool":0},"0cxWtvh4ik8j5Z5BdiPB_g":{"text":"Lonnie is the man. Point blank period. Great hotel, very clean... Perfect location with an","useful":0,"cool":1},"5mp-LjiEkFmVmZ8bR25K3w":{"text":"Stayed here for my 50th birthday and loved it!!! The staff was exceptional and professiona","useful":1,"cool":0},"17whfak1AMHgvvCKU7GEig":{"text":"Stayed here during the Essence Festival and initially had some concerns from reading up on","useful":1,"cool":0},"VySdkTxeUwvc3MmUEbQuSw":{"text":"The French Market Inn was my home away from home for my 4 days and 3 nights in the French ","useful":4,"cool":1},"hNS1WYORDMp9Yt_9v55WnA":{"text":"This place looked cute and was near a wedding I was attending but when the wedding was can","useful":1,"cool":0},"TYIe6_cdJB3SSXFQ9xdQnw":{"text":"Darling, reasonable price. We stayed here two days for vacation time before we moved to th","useful":0,"cool":0},"a5MkpUZZyzpv8o5h-kH_0A":{"text":"First time we stayed here and we will absolutely stay here again. Everyone was friendly an","useful":1,"cool":0},"9fEjXp8uM-FLt75UKPU6JA":{"text":"My brother was graduating with his doctorate, and we wanted to spend a couple of days in N","useful":1,"cool":0},"T1dSJbn4Ept5f8SkhwfVNw":{"text":"Great spot to stay in the quarter. It's in a central location, easy to walk to and relativ","useful":1,"cool":1},"qFS0DAPbOfYSjEmviFjvbQ":{"text":"I've stayed in this hotel six times and every time has been a great experience!! Highly re","useful":1,"cool":0},"P7BxBEpdo3VyUM87v9-FFg":{"text":"This is my fourth stay here and it is always so wonderful. It's in a perfect location. No ","useful":0,"cool":0},"rAqjHkp1SE2boFNb63HZPA":{"text":"I had a great time here! The first time I visited New Orleans, I opted to stay at an Airbn","useful":6,"cool":2},"dkC_-_ukHzY91880eg2CPA":{"text":"Stayed here during the Essence Festival and initially had some concerns from reading up on","useful":0,"cool":0},"q1ZbofZXDcpebxTCPjh2Gw":{"text":"I awoke from what was admittedly a rather late and boisterous night and found, upon openin","useful":8,"cool":0},"LxPNbauyP09pK_fEbpaDwg":{"text":"What's to love about this hotel? \n+ the old NOLA charm with the exposed brick and lovely i","useful":2,"cool":0},"ulh2588rhpAGy78MSssa-w":{"text":"Buyer beware- long story short- made the reservations for feb 12- 16, paid the deposit, pr","useful":0,"cool":0},"8NOthr3X0GdT7GgdQu1M3g":{"text":"We came to New Orleans for our mini-honeymoon, and we booked a balcony room at the French ","useful":0,"cool":0},"-0eHpLWwG5j1OyvOWRn4UQ":{"text":"Charming place, friendly and helpful staff, great location. Clean and comfy. Small pool in","useful":0,"cool":0},"KPhHCP9o-rWZDpjCC9c1Fw":{"text":"My conference booked a group of rooms at this hotel for a few days and I truly enjoyed the","useful":0,"cool":0},"mWdJqvJza0KOkzTn2VK2wA":{"text":"I absolutely love this place. It was built back in the 17th hundreds and additions were pu","useful":0,"cool":0},"o2sg72v8OOBiY_IHVexZiQ":{"text":"I am just hoping nobody stays at this dump. Thanks I'll tell anybody that asks not to stay","useful":0,"cool":0},"gLgo9g4mBJGaPbhbFKqkgA":{"text":"We stayed at the French Market Inn this past week. First impression is that the staff is a","useful":1,"cool":0},"TR1ehWMZwAXoqn4SVdDLYQ":{"text":"I had a friend from out of town that booked this Inn for his family and I had the opportun","useful":3,"cool":2},"vZLQwk5UfHVG-iN1xo3FbQ":{"text":"Great staff, great location! We stayed in one of the petite rooms which was the perfect si","useful":0,"cool":0},"l452qk7fc3juLXbRP5FJVA":{"text":"The price comes with the territory I guess. The location isn't all too bad if you are a to","useful":0,"cool":0},"jryA-WGdJ26Yxz3i_9w2-A":{"text":"Oh man...we didn't want to leave. The family (staff) at French Market Inn are amazing. We ","useful":0,"cool":0},"1ByCnGmOfL5MXmN7IIqVig":{"text":"If I could write a lower star I would. A mouse was in our room and we didn't see it until ","useful":1,"cool":0},"jS1Ze46Vz_moxfAIk8LJgA":{"text":"Very nice stay.  Staff was really really nice .  Beautiful courtyard and great location.  ","useful":2,"cool":0},"w8FWYjKnb-kaDLU1yJaQ_g":{"text":"Ah.. well.. looked nice in the pictures; real life, very dirty. Dusty, carpet super dirty.","useful":0,"cool":0},"s1xPkGukJTGxGEIA8kHB1w":{"text":"I really loved the location and ambiance of this hotel-it was right in the midst of the Fr","useful":0,"cool":0},"LanEdtcPnKhO5syzCuyrRw":{"text":"Great place to stay in New Orleans! Perfect location! Close enough to everything in the Fr","useful":0,"cool":0},"b30HpgfQl4rhTA37E8mSgA":{"text":"First time visiting New Orleans and stayed here for 3 nights. It was really beautiful and ","useful":1,"cool":0},"BUb324-rRQSEnFHhEP3BXA":{"text":"We stayed 4 nights, and would absolutely do it again. The room was comfortable and made up","useful":3,"cool":2},"sYS8tdxGaXiW_Uhx0ac6nw":{"text":"Stayed here last week for my Birthday and it was the best experience ever! As soon as I st","useful":0,"cool":0},"JBq18aI6iYrUWt2ecWHxWg":{"text":"Amazing hospitality from check in to check out. The roads were blocked because the sugar b","useful":2,"cool":1},"lkcIOvPo-DAnlkfRfx9TKg":{"text":"I can't even begin to express how much we love this inn! They had me impressed months befo","useful":2,"cool":2},"RIwXgmM3ij39O-84Xnnqxg":{"text":"First time to New Orleans. A wonderful place to stay. Something a little different than th","useful":0,"cool":0},"hXsEEaH-klDBo_ZL7b8NrQ":{"text":"Amazing hotel that surpassed my expectations. The lobby was clean and beautiful with helpf","useful":3,"cool":1},"Huxd4nOKcSVcku0Iqzcc9Q":{"text":"I really wanted to be wowed by the Inn. We are looking for our go-to spot to stay when we ","useful":1,"cool":1},"rDnC_ZWrU8eq_v95BxNC3w":{"text":"Gorgeous hotel. Located right on Decatur street in the French quarter. If you want a quiet","useful":0,"cool":0},"ORymFnGpmu1A66TvuLj7RQ":{"text":"Update:  Although the issues in my original review are worth considering, it is also notab","useful":0,"cool":0},"o3rRDUb8cKUApZ9KTqMG8g":{"text":"This was a beautiful hotel room. I didn't expect it to be that big, seriously 2 rooms both","useful":4,"cool":2},"MyXZ9B2l9pXv6qBPtGtK5g":{"text":"I don't like writing bad reviews but in the interest of future travelers I feel I must be ","useful":0,"cool":0},"LxpKikpUFx8_EIVDLJ8UYA":{"text":"If you want to stay in the French Quarter this is the place to stay. It is quiet and the s","useful":0,"cool":0},"tXfWeAQ8df9YDt3m4RHrEA":{"text":"We love this hotel.  We have stayed here twice and have gotten amazing service both times.","useful":1,"cool":0},"CriGgwr4IAFBTjhFWr8ExA":{"text":"This place was beautiful.  The brick walls in the room were authentic.  The rooms we had w","useful":0,"cool":0},"ETovMB4f5NTWuEIqNxmFWw":{"text":"The French Market Inn is located on the touristy street of Decatur. It has tons of shoppin","useful":7,"cool":1},"L72umI0pz59eKEErotzF-Q":{"text":"We stayed here for 2 days in the winter. \n\nThe room itself was really nice. Well cleaned a","useful":0,"cool":1},"R563lCjOcGg1lBPMFe6SUg":{"text":"What an awesome find! Super friendly service, so much character, and in the heart of the F","useful":3,"cool":0},"kQu93GwXSXzrGhAXvFcOiA":{"text":"I enjoyed my stay at the French Market Inn while visiting New Orleans to attend a family e","useful":0,"cool":0},"m-OqBvhts3juh5ORWJzgcg":{"text":"Very friendly and helpful staff. Perfect location!!even though it is in the French Quarter","useful":0,"cool":0},"iVJEp3DwPyMOlCawK7-zEw":{"text":"We stayed here for New Years and absolutely loved it ! Yes, the rooms were small , but wel","useful":1,"cool":0},"1wf6g6YZzXhdSBq7WE-xtQ":{"text":"Good location, by plenty of shopping and right around the corner from Jackson square. Room","useful":1,"cool":0},"eDygkMEXuny8h3gqxpXbZg":{"text":"This was such a fantastic find. The price was great for the location and being New Years w","useful":2,"cool":0},"Xb60MZ1jCBt8baVti9toXA":{"text":"We recently spent 5 nights at the French Market Inn. \n\nPros:  \nThe staff is phenomenal. Th","useful":0,"cool":0},"xEEbdObdGFlrHkdjt_ahog":{"text":"Finding a place to stay when you're out of town is always complicated. Will it be close to","useful":47,"cool":41},"Y7ovouD2zgzYwM3ckQ9MSw":{"text":"I stayed here for a bachelorette party.  Both groups had huge rooms, the location was grea","useful":4,"cool":1},"c9Z0QwerEiRM3pieLZCiIg":{"text":"This hotel was awesome, great location and price. I really enjoyed the coffee shop next-do","useful":1,"cool":0},"hqmD9ceF0gV_ZZxi8PulSw":{"text":"Stayed at this hotel during Valentines weekend and OUR CAR WAS STOLEN from the valet servi","useful":6,"cool":0},"AqsMqUGo7V0piQQ6hbZyxQ":{"text":"My daughter and I spent 4 days in the French Quarter just prior to Mardi Gras 2020. This w","useful":0,"cool":0},"Y5LS5T4lTkw_AKMVZI9VEA":{"text":"Charming. That is truly the only word I can use to describe this amazing hotel. We stayed ","useful":10,"cool":9},"y5FGmqHKtRn3okElqx_xvg":{"text":"Great location, but not a classy place to stay.\n\nWe booked the French Market Inn when last","useful":1,"cool":1},"wcia3WmfEuHu5TsUxNL1Hw":{"text":"The staff were all courteous and helpful throughout our stay.  The location of this hotel ","useful":1,"cool":0},"wPHai_6g39ZBNgCNe4ZSQg":{"text":"Not horrible. A good value (about $80 for the night, on a Sunday). Treated our service dog","useful":3,"cool":0},"C5In_pUBYsfoVEuWQPGFxg":{"text":"Do I have to give this a star? Worst lodging experience ever.  Interior room felt claustro","useful":2,"cool":0},"-_mcg7AmPfMx6io_cl7bJw":{"text":"French Market Inn is conveniently located right on Decatur which gives you easy access to ","useful":10,"cool":6},"C4udOjUAGlJzpG5DtQ8gOA":{"text":"We loved our stay here so much that we extended our stay for another night.  We actually h","useful":0,"cool":0},"V_32YLsGgfIdWOxQ7L_NFw":{"text":"Just returned from a 4 night stay in this wonderful and fun city. I've been here before bu","useful":0,"cool":0},"NNtfwuuxcOwWHEL543nj8w":{"text":"I've stayed here twice. The first time was phenomenal! Second time was last week, and thin","useful":1,"cool":1},"8XsIS509V_3feP3yS0BCIQ":{"text":"Wonderfully beautiful hotel. Very comfortable room, and nice big bathroom. Warm and friend","useful":0,"cool":0},"HSPuCQPG1PGq4RTIhRoEbw":{"text":"Two of the three nights here were wonderful.  A great check in experience - hand over the ","useful":5,"cool":1},"sNtzKcmqsfysh72HbNNXgw":{"text":"I love this hotel!  So quaint and full of character. Situated right across from the river ","useful":0,"cool":0},"oa6R1TuaVa2ibXTyPfz5qg":{"text":"Stayed here for a weekend vacation in Nola. The hotel is lovely. The rooms are comfy and c","useful":0,"cool":0},"2ZzmU5-_ym24JU-ikqc18Q":{"text":"We have been to New Orleans numerous times and wanted to try a boutique hotel vs the norma","useful":6,"cool":0},"9RiyPfGD178T0ZpChj3aRQ":{"text":"We stayed her from October 1 to 6.  We had a nice, quiet room, in the heart of the French ","useful":0,"cool":0},"32YlOEoAdYo7eZ4Oo-fGag":{"text":"Omg, love love love this place.  So close to everything but so peaceful.  Pool is small bu","useful":0,"cool":0},"45XalPEO_dz2Yv7N0YbclA":{"text":"Coming from France, we really enjoyed our 2 night stay in this hotel. It has character  th","useful":0,"cool":0},"-MpSBXm62pmCAfy18mGjig":{"text":"About a year on my NOLA trip, I stayed at 2 different hotels and the French Market Inn bei","useful":0,"cool":0},"oQSi81kFShVN26mX-j9heA":{"text":"The French Market Inn is super cute, and really close to many things in NOLA! It's reasona","useful":0,"cool":0},"ZCZttMIYnG3yzct_MOIUqw":{"text":"Beautiful building built in the early 18th century. Deeded to a Baker by the last name Dre","useful":1,"cool":1},"A7lvDx3kz0x7LexSSSAejA":{"text":"I was weary of staying anywhere in the Quarter (with family) so I chose French Market Inn ","useful":3,"cool":1},"A7ZWWwZMNFEAFC5nriRAng":{"text":"We recently stayed at French Market Inn and had a wonderful experience. Great location in ","useful":0,"cool":0},"n8USol4MRoUTXL2P6p1YVA":{"text":"It's old.  It smells old which wouldn't be so bad if the windows opened but they are all s","useful":0,"cool":0},"rrXiS63Xe04q9HzfApM0ig":{"text":"This hotel is very charming and has a lot of history. It is centrally located close to res","useful":1,"cool":0},"TtVrG_6UKBETcZyPQArJKQ":{"text":"Highly recommend this boutique-style hotel if you're wanting to stay in a clean, safe hote","useful":1,"cool":0},"DgI7zEP-aF0gTaSIX67MBQ":{"text":"We gave this place a shot because of the price point but we won't go back. We were told by","useful":0,"cool":0},"IjPxyY2JK-lH0oh64crF3w":{"text":"Absolutely adored our stay at French Market In  this past week! The staff was so accommoda","useful":0,"cool":1},"dHOb2yfIXoSVfkC7mfx9hg":{"text":"We stayed here 3 nights the week between Christmas & New Years.  The price was great compa","useful":0,"cool":0},"xUoSIOUVDKhMD7DSu88a_w":{"text":"I traveled here to celebrate my friends bachelorette. Overall the hotel was nice and easil","useful":0,"cool":0},"P3hCO0r_J6zSuwtsuhPjig":{"text":"We stayed here on our cross country trip and found a room on hotels tonight! For $100 this","useful":1,"cool":0},"mN4myCwSoMZQ9ikQME6uTQ":{"text":"Love this place. Staff is very nice. Rooms are quaint and intimate. Well be returning. Who","useful":3,"cool":0}}