{"H4AKI91nCbyRQZ-DbeYpiQ":{"text":"Went here the other night, a new and very stylish restaurant on what had once been an utte","useful":0,"cool":0},"jQkN7Vuv4iOfhCSfeR2Yjg":{"text":"Had the feeling that someone is trying to be something high end. Had the cheese plate and ","useful":0,"cool":0},"gnMbmrIrXR07P4RGp3XwbA":{"text":"Love the menu and the ambiance of this restaurant. I've been multiple times and always enj","useful":0,"cool":0},"p0ibKuuvbhLF2VCr25HTGQ":{"text":"Came for a girls night and absolutely loved the atmosphere. Shoutout to whoever was in con","useful":0,"cool":0},"Yd9Url30M2tvYhAU8Vdxkg":{"text":"I came here with a large party of 10 people. I do not recommend this place for a large gro","useful":1,"cool":0},"kUZHdAo7k5-8V4sjN01Z5w":{"text":"Ask for Randy! He's the best. Attentive but not overbearing. He was observant enough to re","useful":0,"cool":0},"QwAa7BC9uIV1CtBleyc7IA":{"text":"The ambiance and service were excellent but.....\n\nWe tried three small plates, a pasta, tw","useful":0,"cool":0},"elF2cv2zycO4TsCOil5t7g":{"text":"The service here was attentive and very friendly. The food items combined some seemingly u","useful":0,"cool":0},"bOS-Fh6mD5C__ov-u8I7aA":{"text":"Menu fit for a foodie. Dishes perfect for sharing. Great drinks. Busy but not rushed. Will","useful":0,"cool":0},"Ihu1ySdENuHsVOcrWD95Mw":{"text":"We were taken aback at how beautiful this place was. Incredible setting with delightful ha","useful":0,"cool":0},"7dx4Y8sit3Rzx0EgeOFXBg":{"text":"Such a cute restaurant.  Wait staff was very friendly. All the food items we got (lamb, pa","useful":0,"cool":0},"wxMfqXziESv_MJZ-f3UMlQ":{"text":"I was highly recommended to this restaurant from a few of my friends. Today was a special ","useful":0,"cool":0},"pED1lD652uQMUXNaHpF5Yw":{"text":"Loved the experience and the vibe! The food was wonderful and there is a great variety on ","useful":1,"cool":0},"Kfr4QHAA79V0LoSg_7_g-g":{"text":"Popped in with my sorority sister for a midweek dinner date. I had the whipped feta and pa","useful":0,"cool":0},"zMgIFwWise_qJCZZC6ygYQ":{"text":"Took my boyfriend here for his birthday and indicated that it was his birthday when making","useful":0,"cool":0},"QHq6YShDrkZKPQk2Kzh51A":{"text":"A beautiful st emilion...leeks in a marinated mussel vinaigrette , Marsala, roasted chili'","useful":1,"cool":1},"M21iWx9U06hP3igQQIKvvA":{"text":"So glad we met Tony the barmaster here; excellent service, great drinks, extremely knowled","useful":0,"cool":0},"5KTs1c4NMnT6OG0eT_CySA":{"text":"A beautiful st emilion...leeks in a marinated mussel vinaigrette , Marsala, roasted chili'","useful":0,"cool":1},"Jr6dGZkCmo6kESMHykun2w":{"text":"I have greatly anticipated dining at and experiencing The Bower.....but it \"did not give w","useful":4,"cool":0},"zQLJ40dojfDmPBgQNyULFg":{"text":"I went to The Bower with a friend for Coolinary. We sat outside, which was very pleasant d","useful":1,"cool":1},"R7bJbagy98lxlOHkH60DxA":{"text":"What a fun experience in an almost boutique feeling resturant.  \n\nMy daughter and I were f","useful":0,"cool":0},"jA0sfNXyYC9d9QehMUZJQA":{"text":"I came with a friend for dinner on a Saturday night and we had a great time. I don't norma","useful":1,"cool":0},"dAk9BHF4cUHQ_uPjc8wITw":{"text":"Go to The Bower! Everything is wonderful! The space, the atmosphere, the service, the cock","useful":1,"cool":1},"4WKYXSHEGYQw_Tz2UhojBw":{"text":"Went last night for date night and had so much fun. They blast the music loud and the ligh","useful":3,"cool":2},"7cvbrRB_luZ1R0B-yoV3DA":{"text":"I went here for a dinner with my girl friend. Our server was so friendly and helpful. She ","useful":3,"cool":2},"rMb50_h5Q3DceqfrqM-1Yg":{"text":"Listen... This was my first time eating at a restaurant in a year (Outdoors still) and tal","useful":19,"cool":12},"U5WrQSAB4pfWXzhfG6ecfw":{"text":"Went here for a birthday dinner. It was easy to make reservations online and we were seate","useful":0,"cool":0},"s9Qt5mbrwQN6U5n0marpBg":{"text":"The food and service here is superb! I highly recommend trying this restaurant, you won't ","useful":0,"cool":1},"k4ZKwvySBnXYI7n6oBV4qQ":{"text":"The bower exceeded my expectations! They have a great happy hour and an awesome restaurant","useful":1,"cool":1},"DtmPZqbN9QYYc9q_DuxGiQ":{"text":"Food was very good, kind of expensive. Your portions were small. I wouldn't go eat here if","useful":0,"cool":0},"7rf0TtKpdqB2d_FsUJ-xlw":{"text":"This place is beautiful! Made a reservation on a Saturday at 4pm (right when they open) fo","useful":0,"cool":0},"mSui28QRHZPwIWigsBgP8Q":{"text":"The food is fantastic and the vibe is perfect! Describing this place in 3 words I would sa","useful":4,"cool":3},"hbUYFeL5001LPiyFU4zmMw":{"text":"Came here because another restaurant was weirdly closed but I am happy I came across this ","useful":0,"cool":0},"Jl8HFWPnMSd5bBy0Rn1FJg":{"text":"Very disappointed by this place. \nWe ordered a chefs choice cheese board, the casarecce, a","useful":0,"cool":0},"SsBSFN3BhdRied2Z2L4aqg":{"text":"There unfortunately was no air conditioning in the restaurant.  We had a reservation but w","useful":0,"cool":0},"Rg-Mg_WGCyGXXL0SJt8gSw":{"text":"I met up with a few friends on a recent Friday night for drinks and snacks in the lovely o","useful":6,"cool":3},"KHvkpI2hrGklMVIPGzqthQ":{"text":"We had an early dinner here and it was fantastic! Great service and an amazing vibe. We or","useful":0,"cool":0},"UJQ-iaxmV25_KRzh8WlHvA":{"text":"Amazing place! The ambiance is so lush with a menu of cocktails to keep you there for hour","useful":3,"cool":2},"ikpyO4_zh70Eu4gE4oT2lQ":{"text":"LOVEDDDDDD this spot! Came here for a girls night and we got the best seat in the restaura","useful":6,"cool":4},"mqIq8rWdyiZ8Yvf78kl5ew":{"text":"I can not say enough good things about this place. The staff, the atmosphere,  the cocktai","useful":0,"cool":0},"BLVtVV0UJO0MOibO02ofKA":{"text":"We stopped in because it was coolinary month and I am very impressed with the beauty of th","useful":3,"cool":3},"0UUUoGlKcVR1X32gCH6MQQ":{"text":"The Bower is a newer restaurant on the New Orleans scene. With a weekday happy hour from 4","useful":2,"cool":2}}