{"41iQIyJpud8bD5QA04CdbQ":{"text":"Honestly this place is beautiful. The hospitality of the staff is what sets it apart. I ho","useful":0,"cool":0},"9AyuilJJOm4aV0LXkKKJag":{"text":"This place is super pretty and has a lot to offer. The bathrooms are stunning and the beds","useful":0,"cool":0},"QDQEljDNdCL5CLxUsSR27w":{"text":"Absolutely beautiful venue. Lovely, welcoming staff. Location is perfect. Just sorry we we","useful":0,"cool":0},"kaGzsWJ9oXggsoKiz8uWOQ":{"text":"I'm currently on my third trip to New Orleans in a single month, the first of which I stay","useful":4,"cool":2},"RnETlh2x4J_Dq13nMQpgEg":{"text":"Unfortunately, these photos do this hotel ZERO justice! We absolutely loved our stay! The ","useful":1,"cool":1},"03Vmx9VyiwrJj0H3_eiCrg":{"text":"I love this hotel.  It's quirky and elegant all at once.  The staff is lovely and welcomin","useful":1,"cool":1},"ZvyTbhB5Wz1GgVlPB9OlFQ":{"text":"The room was very luxurious and comfortable. The bathroom was a nice size I especially lik","useful":0,"cool":0},"PCshV3TcyWb_nKvCzsGO-A":{"text":"WOW, just WOW! Hard to even tell you what we enjoyed most about our stay this week at Mais","useful":1,"cool":0},"gduqm57nJ7WO9QopASBPtg":{"text":"Update: The Manager, Thomas successfully addressed my issues. Albeit, it doesn't remove th","useful":3,"cool":1},"BXHG7Jibm251Zu8sOHqPoA":{"text":"Maison de la Luz is perfect in every way. This hotel really made my trip to NOLA special!","useful":0,"cool":0},"PuWduNN1XOZ_WpFMRgR7Pw":{"text":"This is just based on an order too surprise my sister who was staying there to celebrate h","useful":0,"cool":0},"PMfo8GeeQt03ioQRQwLQAw":{"text":"The worst \"5-star\" hotel experience I've ever had. The food was awful. The television didn","useful":2,"cool":0},"ClIJAqx6uELmrM00JSeHpQ":{"text":"This is a gem of a hotel! The staff were exceptionally attentive, helpful, and friendly. T","useful":2,"cool":0},"QwG9R2DwaA1q9aAvzGBS3Q":{"text":"So you're looking for a nice hotel in New Orleans right?  You stumbled across Maison and y","useful":2,"cool":1}}