{"2lVtFvAhHkCwkULm3-DgAQ":{"text":"Ordered the crawfish marigny...needs more flavor. At least some salt and black pepper. Dri","useful":1,"cool":1},"ei97mZVlgH_Lg-c2tO5VsQ":{"text":"The gumbo was really good, with some blues music to maintain a easy attitude.  Great place","useful":0,"cool":0},"hdMax6LmfYp1AU3JclqLRA":{"text":"Just a great place to go. Food was very good both times we went there. Camille was a great","useful":1,"cool":0},"300206014ialMBuH9WUZqQ":{"text":"The bbq shrimp with grits are amazing. The hamburger is huge and great! Server is super ni","useful":0,"cool":0},"YA9GicPv1p_jDtM0iwd7KA":{"text":"Marigny Brasserie Unsanitary Practice\n\nWe were regulars here until wife got ill immediatel","useful":4,"cool":0},"GnNPYzclh63b2UxUH316sA":{"text":"Absolutely fabulous! The host was so extremely helpful and polite. We were there for hallo","useful":1,"cool":0},"B0yXxr93FFsIbMK1C4nHBA":{"text":"Honestly, one of the worst restaurants I've ever been to. I am from New Orleans and this r","useful":1,"cool":1},"lgnOoykTQlOpiXOV_NKc3g":{"text":"We went for lunch.  Do not get the frog legs.  Unfortunately, the chef covered the frog le","useful":1,"cool":0},"obIg0x6BeZrH8WmZh9HkSA":{"text":"Food OK but priced a little high for the quality. Worst part was the SERVICE!  And honestl","useful":0,"cool":0},"OHbF468tJWZ1TnnUhbSbvA":{"text":"Service sucks, 30 minutes with no waiter or drink. We were asked to tip the band (which we","useful":0,"cool":0},"8fQRuYKnhDaUEvbwSxTVDQ":{"text":"Horrible. Greasy overdone steak.  Bugs on plates.  Slow service.  Nothing redeeming about ","useful":1,"cool":0},"OQAdJCgzAQgRtmsfyh_0hA":{"text":"I am not quite sure why this place is considered inconsistent. We had two of the best meal","useful":0,"cool":0},"b9qai-oyRU-JjdyPtiNRdQ":{"text":"Fun atmosphere with a live band. Just stopped in for an appetizer and drinks not disappoin","useful":1,"cool":1},"pVGdVwgOv695Ph8lZlivfg":{"text":"This place has so much potential, but we had a really mixed experience.\n\nGreat atmosphere.","useful":0,"cool":0},"jS_2SU28zTHjFUSohu28bw":{"text":"Our first meal on our first night in NOLA. She had the fish special (some sort of Gulf fis","useful":0,"cool":0},"__6L8gz2QYbQ3es2RuLKQw":{"text":"We chose this restaurant because we wanted to see live music while we ate. I was a bit dis","useful":0,"cool":0},"UanJKm5pPAwUO5G66Y2TNg":{"text":"Friendly service and pretty good food. My favorite part of the meal was my cocktail, Momma","useful":0,"cool":0},"LCu2l8x7bNnItfHYsC9qGg":{"text":"I really really enjoyed everything about this. The band playing was great, the atmosphere ","useful":0,"cool":0},"6upaRm5ej3LBQOd_eC6Xxw":{"text":"This place is not your typical New Orleans bar. In fact, it's mainly a restaurant. But tha","useful":1,"cool":2},"-RdcoZAzlQAzyMAwY6elXg":{"text":"Just stopped in for a few brews while on vacation. They have a huge screen projector to wa","useful":0,"cool":0},"oBCTXbnPQkLlD1dMlazryA":{"text":"Still delicious this time had the BBQ shrimp and grits. The greens served with this are BR","useful":0,"cool":0},"zCYrYrBxU5zyrOaA1ImY2w":{"text":"I had been to NOLA two times before this trip and wanted to try something off the beaten p","useful":0,"cool":0},"puh0OyZCiU69sH4AU8Fygw":{"text":"Great music ! However food is good , expensive and overall not worth it ! \nEnjoyed the mus","useful":0,"cool":0},"HnG3bAwyZ7vpHFhhDanjFg":{"text":"Walked in on a Monday night looking for some live music and Marigny didn't disappoint. Abb","useful":0,"cool":2},"P3cb4-CHAiZejhHy6byi1w":{"text":"The service was horrible, very slow and nom attentive.  Food was ok at best. Music very lo","useful":0,"cool":0},"jTywAEgIGMX53F57RTnLag":{"text":"I've had fantastic and just mediocre experiences here, so I'm giving it three stars as an ","useful":0,"cool":0},"3-ZX67d-xw5yYm-yM1jRnw":{"text":"Great place tucked away in the French Quarter. Good service and great live music. Everyone","useful":0,"cool":0},"Z40EFH2uxPH85KdIcA2OuA":{"text":"This place is my absolute favorite in the city. I ate here when I was visiting and now sin","useful":0,"cool":0},"dWxFcuQyeD4sver7uJ6FNA":{"text":"Nice atmosphere n scenery but food not so well.\nOrdered an app that was burned in old grea","useful":3,"cool":0},"y3KtqeQsey6ymOVcyDr-kQ":{"text":"1st and most importantly we enjoyed our brunch and the buttered rum coffee.\nCame in for br","useful":0,"cool":0},"TKQlywaQkQ8axJV7N6feoA":{"text":"My service was great! My food was great. Not really sure what everyone is complaining abou","useful":2,"cool":0},"AKLWR7EHBWiR-wgCSrL1JQ":{"text":"Friendly service, loud jazz, good drinks, and a fast kitchen.\n\nWe really enjoyed our first","useful":0,"cool":0},"j1mhiAD6KGM2RDN4tblgRA":{"text":"This restaurant located on Frenchmen Street gets rave reviews for the food, drink and live","useful":1,"cool":0},"a5cBEFwFuW6jlBgG8_MJYQ":{"text":"Stumbled upon this little gem while trying to find sustenance & libations away from the cr","useful":0,"cool":0},"_D1zGzDkvzJqqD-Li_gwEQ":{"text":"This is probably the most upscale looking place on Frenchmen Street. We had lunch here. Th","useful":0,"cool":0},"98M-pmMe9A16XkOvkx3pig":{"text":"Wanted to like this spot but I was unimpressed. Came with a group of 8 for brunch, so yes,","useful":0,"cool":1},"cGq4r94bZ-zie6YidYl6RA":{"text":"Music is great, but it's really hard to hear anyone at the dinner table. I would highly su","useful":1,"cool":0},"xh1g8Es_93ZEM1mPGU0ElA":{"text":"...had the Sazerac. Super strong. Not the usual nuances I associate with this cocktail.  F","useful":0,"cool":0},"nUc3P6ZWRI8ZrCSmBg-HRA":{"text":"**FOOD POISONING**\n**RUDE MANAGMENT**\nFirst, one friend received warm oysters that nearly ","useful":2,"cool":0},"bVO9nd0kX3nNAEAZEOjb4w":{"text":"We had a great time here for dinner. The boudin ball appetizers were delicious, and the re","useful":1,"cool":0},"-peJ5Xj1HhTDz_y_4LYnMQ":{"text":"Great food, great music, great drinks. Chef came out to check in and make sure we liked th","useful":1,"cool":0},"3IsH4DcbcoLzROt5_atS-A":{"text":"Walked in on a Monday evening looking for some live music. Bartender Abby was the best!!! ","useful":2,"cool":0},"vTFyGy8hzIt5rjdPBqYj5Q":{"text":"We were very happy here! Fried green tomatoes were excellent. Drinks - great! My husband h","useful":0,"cool":0},"jkemU5Vn-9_LqsE0Fammpg":{"text":"Best is their happy hours till 7:30 pm house Vodka is Svedka.... Conversation with neighbo","useful":0,"cool":0},"KDvGM4YvXe4y2aPg8_-7tQ":{"text":"We were on Frenchmen and we were hungry. Our usual haunts were packed. Marigny Brasserie w","useful":0,"cool":0},"_bgdM8e6lMxaA_R1JK2Iig":{"text":"I thoroughly enjoyed my dining experience. The atmosphere was Bohemian. It reminded me a b","useful":0,"cool":1},"GzNGrrOhJZobW-xhkwV8Xw":{"text":"Had a big group of friends in town the week before Mardi Gras.  They wanted a late lunch a","useful":3,"cool":2},"eojwbuJ-6hWpMoG4liRdxg":{"text":"The drinks are good here, but the staff is not. Went here recently in the afternoon and it","useful":4,"cool":2},"kgJtlJnD0LE2eX3XuwtQcg":{"text":"What a great place! The waiters are super friendly and the customer service is really grea","useful":0,"cool":0},"z5OAWNl3mVGYD-pkQdmaQg":{"text":"I was pretty excited about returning here, since I've dined here a few times and was very ","useful":3,"cool":0},"NZU_ovdSJwLdv0-MxJa5vQ":{"text":"Walking from Bourbon Street towards Frenchmen St corridor, this was the first bar we ran i","useful":2,"cool":0},"HOytRgQd-uX_WWl8aOAbIA":{"text":"love the jazzie music! our waiter was so professional and knew his stuff!  (sorry think hi","useful":1,"cool":0},"I5WDsZ8uHiEu6b45te3d_g":{"text":"Friendly staff, decent selection of draft beers, TVs for college football while a little s","useful":0,"cool":0},"51PqYaOfE3zHRpEJq30uKw":{"text":"Truthfully I thought the food was ok. We had the fritters, gumbo, and fried pickles.\nThe f","useful":1,"cool":0},"FAOXUmcgjMUWkH5fDpS6DA":{"text":"UM. $3 bloody marys and mimosas? Where have you been my entire life?\n\nBig Red was our serv","useful":4,"cool":1},"m-En57kSrg-dQ4XaMOP_eg":{"text":"Based on a recommendation for the live music here, we stopped in to also grab a bite and a","useful":0,"cool":0},"cuABuuaqCG1_xTBqkjCcyQ":{"text":"My family came to visit me in NOLA and this was our favorite dining experience of the 6-da","useful":1,"cool":1},"iao-iESZUJz4NLuEj49utQ":{"text":"I came to New Orleans with my girlfriend and our good friend during our Spring Break in 20","useful":0,"cool":0},"Wg0SvW7h-kEPisQcbgckCw":{"text":"We stopped in here to get a glass of wine one night while walking around the Frenchman are","useful":0,"cool":1},"-TdbE7pzcKI1ANK1x6JO1g":{"text":"We had dinner at the brasserie and there was a really good band playing called ( Vegas Col","useful":2,"cool":0},"Qe2YL86a-1uYeXThz6DjNA":{"text":"UPDATE:\n\nI gave sitting outside at the front another go today and I should have stuck to m","useful":5,"cool":0},"2An_r2amzFhNg6UafqjIOw":{"text":"We went there twice! \nThe food was fantastic. Gumbo and oyster poboy on BLT with Blackberr","useful":1,"cool":0},"iCTMDt6xLebStK16Jk6fvA":{"text":"Appetizers: \n\nFried Green Tomatoes\nCrawfish Cakes\nFried Eggplant Bites\n\nEntrees:\n\nHamburge","useful":1,"cool":0},"BJGlfyljNfPOGgYd2IZMmg":{"text":"So here it is 3+ years later.  Party of 4 stopped in on a whim for lunch on Mardi Gras wee","useful":1,"cool":0},"2ircfnd1MtXUTfvkso9NYA":{"text":"Awful. I took my husband because it was very good several years ago. The menu was lacking,","useful":0,"cool":0},"Z-zl7zP2sKDluzXRZKNkOg":{"text":"Great vegan burritos and awesome service. Will come back. Decent prices.","useful":0,"cool":0},"100YyrWs1V-GmNCa0ZnmcA":{"text":"Came here for dinner.  We had the BBQ shrimp for appetizer, pork special & seafood platter","useful":0,"cool":0},"voW07xDWFg7L7w9EMuRzCw":{"text":"This was an amazing find to stumble into. Service was great and friendly and the food was ","useful":0,"cool":0},"i4HvyL2wLYCimttRXHCEyg":{"text":"Lunch-2 people-split blue cheese iceberg wedge salad.nice salad withonions,bacon bits and ","useful":0,"cool":0},"iibO3TmLWYyXjyktmsoQTA":{"text":"We dined there multiple times.  Every dish was excellent, very high-quality food and drink","useful":0,"cool":0},"q5hzF6_W52m_rfAAS6cfag":{"text":"I had my birthday dinner here last week. We started out with the fried green tomatoes, cra","useful":4,"cool":4},"pj4zzwgKnxPkvpBZOVm-lg":{"text":"Fantastic Cajun fare! Loved the fried green tomatoes & boudin balls. The lavender lace coc","useful":0,"cool":0},"9K8LvLpzqH652vJbK11wpg":{"text":"As always my wife and I like to break out of the tourist trap areas to find more eclectic ","useful":1,"cool":0},"2emLdTIyVy62HF_Cpr4PLQ":{"text":"My friend and I went this past Saturday while visiting the Frenchmen art market and i must","useful":0,"cool":0},"_5BNiWBaemyV9bdCPYSAtQ":{"text":"We came in here to use the bathroom on Halloween when we were out on Frenchmen and we deci","useful":0,"cool":0},"raibVfi-2twdgdU1OV3ogA":{"text":"Truly one of New Orleans' best kept not-so-secrets. A gem.","useful":2,"cool":1},"Qjf6fipSc8SNC-hAELHG5Q":{"text":"I'm not sure why this place only has 3 stars. My lunch, was one of the best lunches I may ","useful":0,"cool":0},"9N5Pp70SHerHezI89Gr6MA":{"text":"Marigny Brasserie a major \"Step Up\" Corner Bar with great food. Truffle Fries to Tempura O","useful":0,"cool":0},"TZdSqib8ChzAfkEli9RaUg":{"text":"Convinced to come in by the server, who was getting some fresh air as my friend was passin","useful":0,"cool":0},"kR-tJfgjbuYRr7JRLasDPw":{"text":"Wandered in here on a whim, very hungry and exhausted after a day of walking. The atmosphe","useful":1,"cool":0},"izceA_PXoJJHOTFSxH3kMg":{"text":"Great location, right on Frenchman in the heart of Marigny.  Loved the food and service!","useful":0,"cool":0},"0qItF0TtiVxZO_mL0AofUg":{"text":"I dined here a few months ago for a friend's birthday, and it was fantastic! \nI took my pa","useful":0,"cool":0},"_siqfN2UktkwFpevU80tVw":{"text":"This is a fun restaurant.  A large group of us came for dinner.  We ordered a variety of a","useful":1,"cool":0},"1a2FSvRVYF-SKHqmM1Ooow":{"text":"Very disappointing....I went on a Saturday evening around 8pm for drinks and dinner with m","useful":1,"cool":0},"7A0L7OdM46u6sJczK45y0Q":{"text":"We had the oyster shooters to start.  Two of us, three of them. I liked them, but they wer","useful":0,"cool":1},"YuQmbAt4sN58ST_i6NIPUw":{"text":"I really wish I could just rate this place based on drinks, staff, and live music. But the","useful":0,"cool":0},"JAxoJjoCykLo69ej5ACDqQ":{"text":"Nice neighborhood local, pretty cute place and live music. The live music is what gives th","useful":0,"cool":0},"WHjRXR9fuTk-N4dpPlxXJg":{"text":"Great food! We'd only been off the plane about an hour on our first trip to New Orleans an","useful":0,"cool":0},"bO8qo2ZUaSOTuRF_xehgnQ":{"text":"I got the poo boy sandwich. It had fried green tomatos and fried crawfish. It was ok. The ","useful":0,"cool":0},"6yC9eIo-0dwFAbMGoLizfg":{"text":"We wandered in on our own & ended up have a great time. We ordered crawfish fritters, frie","useful":0,"cool":0},"0VD1Yy7RouV7V6MFp6ryFw":{"text":"This was a really cool spot. It was late and we saw they closed at 2am. One side had live ","useful":1,"cool":1},"IUJdc3xgvXq9zJc-od7ugg":{"text":"Fresh ingredients in the drinks and food. Amazing!! The friendliest staff, amazing food & ","useful":0,"cool":0},"ckcWRO1YYY0Ux5uMfVHCZw":{"text":"We got into town around 4PM and stopped here for a quick bite. The place was empty, yet no","useful":0,"cool":0},"7sCiy8yCQdAZJt6tzW8fCA":{"text":"Please avoid this resturant. We ordered two Argula beet salads at our table and they came ","useful":4,"cool":0},"GfUr_H5qWqZhOjb3TDS33A":{"text":"We stopped in for a quick snack, (shrimp tacos), and then the band started playing... We h","useful":1,"cool":1},"yOmkT8F6ilggPRuV_qqDxw":{"text":"During my trip in the spring, me and my friends stopped in this place multiple times. It's","useful":2,"cool":0},"5DJZPu7T6BKt1t7ppibXnw":{"text":"This is my 1st trip to New Orleans. I had the shrimp étouffée and my wife had the Cajun tr","useful":0,"cool":0},"kv_wAlqjwo94wVtS-gMauQ":{"text":"Bar hoping continued. We stopped here for drinks. We ended up getting drinks and cheese fr","useful":0,"cool":0},"NwkM6wVK8x63O-Q0XMX2-w":{"text":"My bachelorette party was in NOLA over Memorial Day weekend. Saturday night we decided to ","useful":0,"cool":0},"-gftE7me25wE-PLMeHf1IA":{"text":"We originally had reservations to eat here for dinner on Friday night.  It was close to ou","useful":1,"cool":0},"SSGz25DMPE7Dj3KklG3_6A":{"text":"A couple blocks from the French Market. The hamburger was fresh, so I had it medium rare. ","useful":0,"cool":0},"HQwx-efhcbwqjSupmJ1qDw":{"text":"We had been in this place before a few months back, we weren't over impressed then. On thi","useful":2,"cool":0},"ZeEYEubX53aCh9XzMmYsJA":{"text":"Service was good, we constantly had refreshed soda. The pasta and gumbo were tasty... but ","useful":0,"cool":0},"XnF62ENH3KiG7XwtImRDQQ":{"text":"Went for lunch & our group got the Frenchmen St po boy (awesome), Marigny #1 sandwich (ver","useful":0,"cool":0},"kzKs5YNe7ISuowqYoy7VAg":{"text":"This place is awesome! Had my birthday party there and it was perfect. The food and the st","useful":0,"cool":0},"B4pBkzAYtZFVMo8_hGvtiA":{"text":"I only had cocktails here so I can't really comment on the food.  But the watermelon mojit","useful":2,"cool":1},"9CyFL3LgyRNzainhigqKpg":{"text":"Had an amazing meal and the service was fantastic! We were a little skeptical to try this ","useful":0,"cool":0},"JQrGGcB-RB0vU_orTcUkmA":{"text":"First, let me start by saying we live in the French Quarter and there are so many great re","useful":2,"cool":0},"kacMjIJJrRfw3eZTNMSMaQ":{"text":"I actually had a pleasant Sunday lunch here. From the reviews I definitely wasn't expectin","useful":5,"cool":1},"y4BBiptadMXumsW9-UvyLw":{"text":"Smooth jazz is usually playing and the food was really good. Loved the pickled beet salad ","useful":0,"cool":0},"8t0fNKtf1UNXJMoWq-1DiQ":{"text":"Went for lunch and the service was good but the food was average at best. I ordered the Ne","useful":0,"cool":0},"qKxSD5zXD7n5XoR6n8Lwig":{"text":"Came on a summer Thursday for dinner. The place was nearly empty but the food was yummy. S","useful":0,"cool":0},"tTbQAAJLJn2P15hy5I0YAA":{"text":"Great craft cocktails. The bartenders were all very pleasant. Had the grilled chicken taco","useful":0,"cool":1},"bg3XdS52Zu5LAGsgpMfA-Q":{"text":"Interesting happy hour cocktail selections. OK food. In a town full of amazing food, the b","useful":0,"cool":1},"DnjclW9wOw4Ofxuk4DliUw":{"text":"Shrimp not so good. You would figure on the Gulf, but no. Tried a friends catfish, that wa","useful":1,"cool":0},"dCAgjjmVMGzaMeOlfqB0qw":{"text":"Excellent food and service... Not fast food but well worth the wait.  Best fried calamari ","useful":0,"cool":0},"I6_pZybmKgm6OPyhR8fbuQ":{"text":"Yes... come here.... definitely come here .... order the gumbo for sure. If you're especia","useful":1,"cool":0},"QdL2YU64AFjN47_Sf-r1hg":{"text":"The food here was delicious.  We were wandering down a street when a woman stopped us from","useful":0,"cool":0},"yTHqKfgOLPf2A08u2DveFQ":{"text":"Had lunch here.  Very good food and excellent service.\n\nFor an appetizer we had boudin bal","useful":0,"cool":0},"f5_m4uu5IoGCvoQJk5O85g":{"text":"Outdoor seating, catty-corner from Washington Square. Great service, excellent cocktail me","useful":1,"cool":1},"E7QCnciUMBkEz2n-kFjesw":{"text":"This place was delicious. My boyfriend and I had the Gumbo and grits while sitting at the ","useful":0,"cool":0},"GcbcGawmFRRaXXt44QFzEA":{"text":"great food, not a tourist trap, is really for locals, but they accepted us and gave warm s","useful":1,"cool":0},"5dDMXxN_aShSctJTFenxag":{"text":"Fish of the day...din't come in. Grits and BBQ Shrimp - was average at best. No WOW factor","useful":0,"cool":0},"tEYaYuooizU5RpvlWv1ptA":{"text":"Delicious food, great service & groovy band. Perfect way to start out our NOLA experience.","useful":0,"cool":0},"MfnkTjKKuJMjun1-9HL-hA":{"text":"The music is great and this would probably be a great place to have a cocktail and listen ","useful":0,"cool":0},"HJppjMSO57lXrxZmtwXcMw":{"text":"For the people that got food poisoning from this restaurant after eating there 4 hours bef","useful":2,"cool":0},"qNaughfiNAi1rnfQio0p3w":{"text":"My best friend visited NOLA a couple of years ago and couldn't stop talking about this pla","useful":1,"cool":1},"Efn8CktDPP9_YNtm4rG_KA":{"text":"Took the host several minutes to notice we were there, then acted like we were an annoyanc","useful":2,"cool":0},"HZcWgzR3hfz1aBicYInNxg":{"text":"Delicious vegan menu, friendly service and great live music! I had the black bean burger w","useful":1,"cool":1},"dsdCgSHe50nKZH5YOYXWYw":{"text":"Went on a Sunday night and it was pretty busy. We were able to get a reservation same day ","useful":0,"cool":0},"V3f8pLfEGYtw7LtdbFzlBA":{"text":"Make reservations! Nice loud atmosphere. Live band with a singer. A long wait without rese","useful":0,"cool":0},"wIjbHVufkDKgv1YEZmxcLg":{"text":"We went on a busy night and has a large table of 8. Seated immedately and recieved our dri","useful":2,"cool":0},"dAudEo5vliqHyi0bSj8pzw":{"text":"Cool place!  Had a salad to start which was ok.  Then had veggies tacos.  Those were good ","useful":2,"cool":1},"s2xqmm5YGjVGns_9PFiqhg":{"text":"Great place for drinks, food and music. Service is slow but you are relaxed listening to j","useful":0,"cool":0},"dESnU5r4xog-bsgrZiteow":{"text":"The place gets 3 stars mainly for the atmosphere, the staff and the music - the food was r","useful":0,"cool":0},"bjGcplLj_KhtmET46ddd4w":{"text":"Been here twice so far, and both times were completely different experiences but enjoyable","useful":0,"cool":0},"i8VGIFkM8KcdsOvn2J46aA":{"text":"Great service and Kick ass shrimp and grits! Amazing fries green tomatoes....live band pla","useful":0,"cool":0},"_kDD097lA82sV23V8PctxA":{"text":"Over Satchmo Summerfest 2016 I had the occasion to dine twice at the Marigny Brasserie. Th","useful":2,"cool":0},"fnDumRMnOov9L-0OH5q7cQ":{"text":"good service, great drinks, awesome fries. their biggest ding is on tacos, which look awes","useful":0,"cool":0},"h_h6mZQDJpjRyzrNPGLi9A":{"text":"I passed by on my way back to my Airbnb, read the menu and decided to stop in for a drink ","useful":1,"cool":1},"eKr37Z1veqmZY9DbwuURRg":{"text":"Writing yet another review of one of my favorite restaurants in New Orleans! Perfect place","useful":0,"cool":0},"976HqFG4YCm7CIQS0YWe2g":{"text":"A must eat on Frenchman St!!! The new ownership really understands traditional creole cook","useful":0,"cool":0},"lp8P31dkrczSwDFpxrjn1w":{"text":"Awesome dinner as usual.  We sit at the bar with bartender Jess!!  She's a doll!   I tried","useful":0,"cool":0},"UxsqQcS1RhrN-xIJh-ewRQ":{"text":"Wow! The mr. Fancy Pants burger is amazing! The best burger in New Orleans. The white truf","useful":1,"cool":0},"iO3sZLDTBIPJ-kr5NKX35A":{"text":"Really nice bartender/waiter.  Had a salad and fried green tomato's.  Happy hour wine and ","useful":0,"cool":0},"POgJmbLT__qdaM1-tQEHgA":{"text":"5 stars are based on my brunch experience. Excellent, friendly service. The mimosas were c","useful":0,"cool":0},"reUi7oZQclQyIfgZV70xKw":{"text":"We enjoy the clubs on Frenchman Street, especially the Spotted Cat and DBA. Marigny Brasse","useful":1,"cool":0},"Wjs69ZuTR6OQwPfdEBcxMg":{"text":"The full striped bass was off the charts!! Fried green tomatoes kicked butt!! Lea was awes","useful":1,"cool":1},"jK5I2vyHwj4m7nbIFXRO5Q":{"text":"As locals, we care a lot about how tourists perceive our city and our restaurants. We had ","useful":1,"cool":0},"S2I-w9BLuUeoUnc8I99V1w":{"text":"Pleasantly Suprised.... Wanted a local eatery and live music, I got it and SOME! The Redbe","useful":0,"cool":0},"r2ZkPFU4d4dJAlBza7T0oA":{"text":"Went for lunch. Cucumber cosmo was delicious!!! Service was nice also. Sandwich and fries ","useful":0,"cool":0},"9LdWW0iTq6OWy3nEWlP2OA":{"text":"If I could give a negative star I would. I used to love this restaurant but over the past ","useful":5,"cool":0},"64olGQ_u1dMKEQTKxWlMEg":{"text":"The food wasn't bad.  Not great, but not bad.  It feels like you're in a casual dining cha","useful":0,"cool":0},"gl5_z6lTsXC8uD9GRINbOA":{"text":"Stopped in for a late lunch, the place was empty so I can't speak on rating the service. W","useful":0,"cool":0},"PmAwER7AMupcenVpUgJztQ":{"text":"I am a server at an italian cucino, 2 of my 3 friends are also servers, and we tend to loo","useful":0,"cool":0},"ATUzyN6_jWGjva_4KOtAng":{"text":"I used to love this place. However the treatment I received the last time I was there I WI","useful":3,"cool":0},"tUZOVwsYfXcP-24WIGi2dQ":{"text":"Good food, nice service. \nHowever they included the tip directly in my bill without tellin","useful":0,"cool":0},"v-ZIe3TdG1cuv_FIVBhQzA":{"text":"I came here twice during m recent trip to NOLA....The first night we came around 11:30 pm ","useful":0,"cool":0},"aJaHLtAfgHpMb5R261Rnkg":{"text":"I should have read the reviews. Called to make a reservation for one but was told to just ","useful":0,"cool":0},"NWh03iX-VmpcdyrbpND_sg":{"text":"All I can say is wow! So unexpected to get such a fabulous meal in a bar restaurant. Their","useful":0,"cool":0},"mN_ts20VuRDQmeJfXeunSg":{"text":"Excellent service, very fast. Great atmosphere with band planning whilst we had dinner. Ma","useful":0,"cool":0},"Z5XSV90TQDQyPjBYOxk7aQ":{"text":"Waited nearly 30 minutes for a to go salad that was already dressed. Who the hell adds sal","useful":0,"cool":0},"1zxZ8Zpn4KmWxJAQu7Am_Q":{"text":"Loved this place! I had the Fried Pickles oh so much and soooooo Good, and the wedge salad","useful":0,"cool":0},"EJ8hiMuQMcKMFvQtI4SNCA":{"text":"This place is great.  We came on a Sunday and there was some good live music.  The staff a","useful":0,"cool":0},"5ApesXRLgbuccMZdQzfG_Q":{"text":"Coming from California the first week of December, my family and I were looking to get the","useful":0,"cool":0},"S8LJCwMLZP01yD3I_u1G1w":{"text":"Five stars for being in a great neighborhood with delicious, just-hot-enough wings at a fa","useful":0,"cool":0},"wJKn6ZNDXGtLEzgQg4GatQ":{"text":"I LOVE this restaurant. I have no idea why it only has 3 stars. I've been here twice and t","useful":0,"cool":0},"S1fSyvigwUZlKM9vEIZ9vA":{"text":"Great menu but a little over priced considering the presentation. Also don't rush me. Most","useful":0,"cool":0},"xFyzxNiJA3MHyr3yU13BWg":{"text":"Just ok.  If you are New Orleans why not go to a really good place.  It is not bad, just n","useful":0,"cool":0},"Yqytwmp4zTQOIj0lYHkzsw":{"text":"I've eaten at the Brasserie twice.  Once for dinner, once for breakfast.  My first trip he","useful":2,"cool":1},"8lto2wlxYyy7Y0O19S27hg":{"text":"Food was fine, nothing special. Music was mixed. Unpleasant band the other night during di","useful":0,"cool":0},"hUJUIt1c1hl71LzwceCD4g":{"text":"Fabulous in every way except acoustics made it hard to have a conversation. OTOH the band ","useful":0,"cool":0},"sVAi_wT0TEOx2BcS2jvXsw":{"text":"My friends and I headed to this place for the DJ upstairs. It was hot as hell up there, so","useful":0,"cool":0},"DodPB8dbPz3-VmTQ10OkMw":{"text":"My girl insists that we need a quality meal before going out drinking (again) so we stroll","useful":4,"cool":3},"Yzl3awzpg5PPVbibKBAkpw":{"text":"My wife and I ate there two weeks ago and had one of the most bizarre and subpar dining ex","useful":2,"cool":0},"lfxZv3IhuirtPRtz3cRv9w":{"text":"Went to the restaurant on a Friday night and surprisingly, the restaurant was not busy at ","useful":0,"cool":0},"Ct7cQRwHRX3ijiavq5DcXQ":{"text":"I am shocked this place only has three stars. First and foremost, we are foodies and well-","useful":1,"cool":0},"0-hiovGFUkdZahug2u0oOg":{"text":"Oh boy!  Don't pass up on Melissa' s strawberry mojito's.  Great jazz, great atmosphere,  ","useful":0,"cool":0},"kMPBJJRlExJf1YWKqKgDRg":{"text":"The bartender was super friendly and They had some good music playing.  I ordered the PO-b","useful":0,"cool":0},"1nSEwONItMlrCLiw6TPzNw":{"text":"Shrimp and grits and shrimp po' boy- both excellent! Jazz music was loud, but good! The se","useful":1,"cool":0},"8I8765Cu-SIoxsHJKxy-ZA":{"text":"Comfortable, great selection of food, not super high end but excellent food. The roast bee","useful":0,"cool":0},"0p_LkbDSnd-SdrHKq3eC2Q":{"text":"The Brasserie has sadly given up having a real chef.  All I can say, is having visited the","useful":1,"cool":0},"Ic05v8sKLos0GvT-dnP7sA":{"text":"I came here with my boyfriend for a late-night dinner. We tried the etouffee and it tasted","useful":1,"cool":0},"fFcaZpRyvdHk7aP05JDsdg":{"text":"When in New Orleans for a weekend my friends and I were looking for refuge from the swelte","useful":0,"cool":0},"6x1VDNpwVgmL8wlS4umg9g":{"text":"Sitting at the bar listening to a great band with an amazing singer. A little bit of jazz,","useful":0,"cool":0},"HORR6Vomj16q8fvm4om_sA":{"text":"The workers are attentive but snooty. Corner location in the Faubourg Marigny. It's near S","useful":7,"cool":0},"-kJ16cgeM3RhFTAV1ypwYA":{"text":"Not good but not bad. I probably would not return . Server was attentive but food was bori","useful":0,"cool":0},"50LbGklQax81l2Gx90GeXg":{"text":"Here is the thing about this place...the food is just ok as far as New Orleans standards g","useful":0,"cool":0},"RLZuvW6jRYmiZnS6jadLJg":{"text":"We had a lovely time at Marigny Brasserie.  We ordered the gumbo, red beans and rice and t","useful":0,"cool":0},"D2WNwN18Sd-3uDks_oiesg":{"text":"Just came here to listen to some live music for a bit on a Saturday night. Drink prices we","useful":1,"cool":0},"66R0-bAy3MUEXlPWE0Kp8g":{"text":"I stumbled upon this little gem while visiting nola for a conference. The music drew me in","useful":0,"cool":0},"0i0rZYk20Rgwe_zQOwpnrQ":{"text":"We basically chose the Marigny Brasserie because the wait was relatively short on a Saturd","useful":2,"cool":1},"0hfcQDXe4HyDyvBzNxzF8Q":{"text":"Pretty average sausage po-boy with a dry as a bone roll. It would have been better if the ","useful":0,"cool":0},"-AfQPi9VuNfUwtCsoPc0Mg":{"text":"Stopped in for drinks last night, we were drawn in by the jazz music. Had several lavender","useful":0,"cool":0},"Vue5lPIK5hhtRUTZLig2Xg":{"text":"We stumbled into this place on Frenchmen street and were very happy we did.  The food was ","useful":0,"cool":1},"RisE8bCbzpe62_T6z1eBXw":{"text":"No good. Crawfish taste dirty. I get that it's a \"mud bug\" but yeesh.  The strawberry sala","useful":3,"cool":1},"qCBWYYwxg1VoVwoRouaTYQ":{"text":"We heard the fried chicken here was incredible, and it was truly out of this world. The se","useful":0,"cool":1},"boZG6-JlmaFYN78sC0D8Yw":{"text":"Fun live band, friendly staff, and tasty beverages. The kitchen seemed to be running out o","useful":0,"cool":0},"SBqe354Kef4xuURMerq6WA":{"text":"Well, we decided to try this place because there was a groupon.  It was pretty good!  I lo","useful":0,"cool":0},"Ink4dTpV4oBejdWXSn9btw":{"text":"Terrible food, terrible service and a jerk of an owner. There a million restaurants in New","useful":0,"cool":0},"kXuK1_pnFs82c0nHEZ8QUw":{"text":"You could tell this  place was having a bad day...or someone just quit / didn't show up to","useful":0,"cool":0},"dqyQWZ-qnOhha1KgeXxy8A":{"text":"I found this restaurant while redeeming some of my rewards points on restaurant.com (self-","useful":2,"cool":1},"JR7iQFY5wJFraAn8BgJ5FA":{"text":"Even though the food smelled good, we just had drinks on our couple of visits here. I love","useful":0,"cool":1},"e171fRj5N01gdzY8pDCGWg":{"text":"This place is slightly hit or miss. The first time I went, it was awesome, and the second ","useful":0,"cool":0},"pRSrvSRnIBFxM3uoXs6cUg":{"text":"We had reservations for Friday of Jazzfest first weekend and arrived 10 min early and were","useful":1,"cool":0},"UBtJqwAXJAQDufIF_OF_1A":{"text":"Ok place - lots of seating both indoor and out. Came mostly for the happy hour drinks and ","useful":0,"cool":0},"tP_tSa8QW_gPzFuV3XGIag":{"text":"The best food on Frenchman street! Their crab cake and crawfish mac and cheese are spectac","useful":0,"cool":0},"fdD8IJsmEO_BGnvA-2yFnQ":{"text":"Second time here. Food is average, service was not good. Get to Frenchmen earlier and make","useful":0,"cool":0},"BL7h0EAwbjoXGE8lNx2TnA":{"text":"It is currently a place that I am ok with bringing friends from out of town.  They may not","useful":0,"cool":1},"P7UgjP1luy58tGI-rfrssw":{"text":"We stayed at a B&B in the area and were heading to the French Quarter. We decided to stop ","useful":1,"cool":0},"xgrGTRF80NyWKmhZa4uIFA":{"text":"Friendly service, good beer selection, live music, but more sterile than other places in t","useful":0,"cool":0},"8q82MxQTKRbtJE7NMu0v-A":{"text":"Food was amazing and service top notch. Clean, not crowded plenty of ac and live music. \nW","useful":0,"cool":0},"adBW476KTg2tRMDQ9a_rZw":{"text":"Hipster & country-chic is how I would describe this place. Not sure if I was biased by the","useful":1,"cool":0},"apZFvkpGjf-fiC8OV3IMjg":{"text":"This place was horrible in every possible way. Worst service I have ever experienced- took","useful":1,"cool":0},"_64Zy_BRAs0tB5iYqzVsCQ":{"text":"A friend and I were in New Orleans this past weekend and I had one of the $25 for $10 food","useful":0,"cool":0},"9qxSrJF3X-mCsHQlW2-1DA":{"text":"I'm a fan of their lunch offerings (the Marigny #1 sandwich is REALLY good), but I'm not s","useful":0,"cool":0},"9Fano6F3OIh5eyTRAkSlSw":{"text":"Come here for the live music and prepare to be swept away. I went here on a Wednesday nigh","useful":2,"cool":2},"PCu4ZLjiQk7frz8xac2geQ":{"text":"The food was cold and they could not get the food out at the same time for a party of 6. I","useful":1,"cool":0},"pLWj1XNaIWNDOWVHTtO9mQ":{"text":"OMG.  The bananas foster martini is to die for. Tiffany is the best bartender.   Also had ","useful":0,"cool":0},"qSGF8SlawZTQmHMZ7hTFVg":{"text":"I never write reviews on yelp, but I had the most amazing experience here on friday (5/30)","useful":5,"cool":3},"bVaaRhwgiH-igg2u-dih2Q":{"text":"Awesome crab cakes & crawfish fritters!! Bartender Milty knows his stuff!!  Great Lemon Dr","useful":0,"cool":0},"XxG5J48rkKjgdX0wa_3hKg":{"text":"I agree with previous reviews on dour/snotty service. Stood at entrance. Waitress saw me f","useful":3,"cool":0},"iCAjsqBDyNzh7Q0yDHbDlg":{"text":"I wished I lived closer so I could frequent this restaurant.  However, I am over 1000 mile","useful":1,"cool":1},"dn1MCKNXKG4ruBcZ58r-fQ":{"text":"my husband and i were in the frenchmen st area and stopped in here for a beverage - a quen","useful":0,"cool":0},"aTYX16EDsulV4ikyF1Hq0g":{"text":"Food was ok I was expecting a lot more garlic mashed potatoes were awful chicken was a lil","useful":1,"cool":0},"utmqERsRzcnepwS0YRVrcg":{"text":"Our server Ashley was amazing, the food was amazing!!!!!!!!!\nAbsolutely highly recommend t","useful":0,"cool":0},"S00b45ZzmZc8jmi6UImlTA":{"text":"Meh. Over salted blackened catfish, jambalaya decent, nothing go rave about. Good wine sel","useful":0,"cool":0},"ahfhYxFX-GNrbRknkN522w":{"text":"I had lunch here a year ago and it was wonderful.  We returned to NOLA for a quick weekend","useful":2,"cool":0},"3XhNI4E0nj29DKBx_soZSQ":{"text":"The restaurant was nice. I wish you could see the band from the other side of the restaura","useful":1,"cool":0},"ob54rx171GQN_q32Lq35DA":{"text":"Went for a short meal and tried the Boudin balls, very good. Also the shrimp tacos were ex","useful":0,"cool":0},"nMpR0_rXJdQBWp8u_AxTKw":{"text":"If I  ate here more often I think I'd have to up the rating. Pork chop very tasty but just","useful":1,"cool":0},"OS-o_WhFqIZSmjQwqS7Gow":{"text":"Not worth the walk down Royal from Canal.  :(  If you into fried green tomatoes (3) it was","useful":0,"cool":0},"J6lxIxwVfQdHRxSH6Cj_fQ":{"text":"Ate dinner here one night. We didn't have a reservation, but luckily there was a table ava","useful":0,"cool":1},"v4khGZRwzNHmgmZorPaPhw":{"text":"The other reviews discuss the consistent inconsistency... ... Which is New Orleans experie","useful":1,"cool":1},"LgjpF3kmgHbmO451awCeQg":{"text":"I was a bit reluctant to eat here after reading the reviews, but a friend had gone a coupl","useful":0,"cool":1},"zWrSUTC-tguZ3VUcCBuL_Q":{"text":"Between us we ordered a Sazerac and Cucumber Basil Lemonade. Both amazing drinks, perfect ","useful":0,"cool":0},"UapvW48L1U6ZXVF1gaf6Ug":{"text":"Huge portions. Great food. Jeannie is a fantastic server. Fried pickles rock! Fried chicke","useful":0,"cool":0},"CKijgrkC7yQf4TD8igjUwA":{"text":"This is a nice, casual place to have a drink and something to eat, nothing extra special a","useful":1,"cool":0},"_vxASXjjA4lZ-A2UX3o2Qg":{"text":"We stopped by early Friday evening. The band playing was loud, but without tone. The boudu","useful":0,"cool":0},"eNfp8FotlEo2hgdWtf13ww":{"text":"Pros:  Nice atmosphere, good presentation, decent food.  \n\nCons:  Food was a little bland,","useful":0,"cool":0},"65EVvGUfaVwhH-7cmsU10w":{"text":"The Shrimp and grits were phenomenal!!! Absolutely delicious. The reason why I gave it a 4","useful":0,"cool":0},"kMUiJUEcschFOQAw1yQdRg":{"text":"wanted to come here for a long long time.  I was a little surprized that the menu was so \"","useful":1,"cool":0},"8Pc73wc4aMAuCz6ijNl2lA":{"text":"The service was good and the Sazeracs were reasonably priced. A group headed by Christina ","useful":0,"cool":0},"VOrXY5QYdTSZC2zElHvRJg":{"text":"Alas. I had such high hopes for this restaurant because of its amazing location on Frenchm","useful":3,"cool":0},"8M3Ih6RvvqtWfbUBQkThiQ":{"text":"Ate here, service was prompt initial appetizer order came quickly. After 30 minutes inquir","useful":0,"cool":0},"hUOAJm2nafGy-qA6TUWqhw":{"text":"After walking by several restaurants offering Louisiana fare with a jazz show, we landed o","useful":0,"cool":0},"mQbmwq1YGbkShVGwDlMDtA":{"text":"I come here quite often, actually, and have always had a good time here.  It's more of a c","useful":0,"cool":0},"en-wi_FQf-DuDy0daO3ogA":{"text":"Great drinks. You would not think it, but they have amazing appetizers. We had the best cr","useful":0,"cool":0},"QIWr1g-4t3CSgIBx00ijLw":{"text":"Absolutely terrible service. Tables next to us that were seated after us, got their main c","useful":0,"cool":0},"LNjYdLaVT5SQWXDF6DU3Zw":{"text":"When we first moved into the Marigny this was one of our favorite destinations. It had gre","useful":1,"cool":0},"liiOP5XFx4hVWWwlQmxH0Q":{"text":"My wife and I stopped in after taking in all the antique and art galleries along and up fr","useful":2,"cool":0},"tC2gkFelLVL0XyrSb-T4Bg":{"text":"Charming place, delicious food, great service, live entertainment.  We especially liked th","useful":0,"cool":0},"d9IEmsphZKRHcp3_BA90NQ":{"text":"Had a lovely date night here a few weeks ago.  Our waiter Will was excellent, and the food","useful":0,"cool":0},"71P1-Y1T_2F24rmJC1dTbg":{"text":"Bought the Yelp $10 for $20 deal & tried this place on a whim. And oh how great Whimsy can","useful":0,"cool":0},"2YLPN5T4QvJp4NZ8Tc4ptA":{"text":"Great food - salmon, burger, and veggie sandwich are all recommendable. Would have given 4","useful":5,"cool":0},"liH_zCcNLeaC8vHaD81ukw":{"text":"Ehhh....plain jane food and choices....lackluster to say the least.   From reading earlier","useful":0,"cool":0},"09a6osv3eLOIVZ9RffkTDg":{"text":"I was hesitant to go here given some of the bad reviews, especially the food poisoning peo","useful":1,"cool":0},"8icHktFTilHTCvuYiN2DWQ":{"text":"We went here after finding out La Peniche was closed.  Update your hours on the website Pe","useful":2,"cool":1},"ZHDnXi228rHtceB-fhaSpQ":{"text":"These people should be ashamed to open their doors. Just horrible food , served in a loud ","useful":0,"cool":0},"_cmTh0aaj3X6gORbuQ5nLw":{"text":"Stopped in here kind of late (10 pm) with 5 other friends. We were quickly seated and enjo","useful":1,"cool":2},"bIsRLvz3QUcJkg2rUlfEHQ":{"text":"So good! The Mr. Fancy pants burger is so awesome. The boudin balls were also awesome. Def","useful":1,"cool":0},"RMSkjwFX_m4g5WMCtvhs3w":{"text":"Although I had high hopes upon walking up to the restaurant, it failed to deliver in a num","useful":2,"cool":0},"nm77PXGq8UXHy8dr4hYhlw":{"text":"Good atmosphere to chill  and listen to live musicians ! It's a jewel on Frenchmen st, dis","useful":0,"cool":0},"cp_Zd1uKNaEB4rGhGoA1AQ":{"text":"The fried chicken was amazing... The chef stole it from his grandmother's recipe. We went ","useful":2,"cool":2},"OKTqLQVZCYe2FipGVtRnSg":{"text":"The band that played tonight was really fantastic. The Louisiana jazz music is so unique a","useful":0,"cool":0},"xDBv0YuIKnXCvvrlNVN9dg":{"text":"Welp, one of my favs has gone into the pisser.  Apparently they are under new management/o","useful":2,"cool":0},"eOpik_xKt9-AZcZnx_LjEQ":{"text":"Clearly a locals joint.  Folks walking by outside were waving in to the staff and people w","useful":3,"cool":4},"P2GcAxb2KaXfO7bvrpMNDA":{"text":"Disappointed. If this review was solely about food, I would give it 3-4 stars. Sorry Marig","useful":4,"cool":0},"Dy6Z8Vc4tNfNTJqXrqdtng":{"text":"i see above that i could join an email list for this place and get free food  -\ntwo though","useful":0,"cool":0},"m6Hpwyiu-gDDK_pqDG_X0A":{"text":"Great place to hangout and have a bite. The laid back feeling of Frenchman and its followe","useful":0,"cool":0},"NeDMdtUtJOhhoOduNZL7cQ":{"text":"Great location, great food, great atmosphere, great service! I came here a couple weeks ag","useful":0,"cool":1},"x2bJXvPZypWGaZqbG9ClUQ":{"text":"My wife and I walked up and down the street trying to find a nice place to eat and enjoy m","useful":0,"cool":0},"_n0gsbF8fIwl1Aa3X04yQQ":{"text":"Gave this place a second go for lunch after a bad experience many years ago. The new manag","useful":0,"cool":0},"PBsS8J9duD0AHR8uBAWZYQ":{"text":"Did not live up to my expectations. With so many great places to eat in NOLA I would not g","useful":1,"cool":0},"GEj5hcgoglxS-MbftnxGCw":{"text":"Our party of five obviously did not have a good experience at the Marigny Brasserie.  This","useful":1,"cool":0},"3ugMzW84HIyJqlRUXT38IQ":{"text":"In response to NOLA H's response:  No, we were not there 5 minutes before happy hour ended","useful":2,"cool":0},"YqC2wk_QHfe0fLTdU3mTEw":{"text":"Just walked by, place caught my eye. Super clean inside. Friendly staff, I don't like goin","useful":0,"cool":0},"tvlv1v0NaG1fek6ew8gNng":{"text":"This was a decent place until it seemingly changed hands about a year ago.  The food used ","useful":2,"cool":0},"4H0f0eQgN_riIb9DgULrjw":{"text":"What a lovely restaurant - spacious well lit place, friendly wait staff and great great fo","useful":0,"cool":0},"_qW9fN3bTzOvxNvF0SsYDw":{"text":"Good local food at a good price and really good drinks. The dinner was made even more enjo","useful":0,"cool":0},"K0ZILQpso2Y7Dpz2ssXobQ":{"text":"I just want to start by saying that the entree I ate was excellent.  The gulf fish tasted ","useful":1,"cool":1},"lXUY6Ba74LU6hQtjT2aE9A":{"text":"We sat at a table by the window for 30 minutes and we never got served: not even water. It","useful":0,"cool":0},"jw5afN3L0Gg-tDlZ4EoI-w":{"text":"Great food, friendly service, reasonable prices. Service (food and drink) is slow but they","useful":0,"cool":0},"JIU2i9ISi9UnYXmQQYN84A":{"text":"Jessye.  Best bartender ever.  Yumm yumm yummy cucumber Cosmo.  But..jessye is the bomb. M","useful":0,"cool":0},"w4YZIvfmahHpr8kl-qEg9g":{"text":"Stopped by for dinner at about 7:00 Saturday after a couple of sweltering hours at Satchmo","useful":1,"cool":1},"oEFyC8A-e2lCTshW7nYokQ":{"text":"We waited ..... And waited. ... And waited. The manager apologized and comp'ed our meal. H","useful":5,"cool":0},"Glzm3Oy7Q8pMQbkRQQskzA":{"text":"Great gluten free chocolate cake, extremely large wine pours and fantastic live jazz music","useful":1,"cool":1},"ozmb8zRIso1WZ6FB26jtOA":{"text":"My daughter and I just got back from the Super Bowl and outside of the 49ers losing everyt","useful":0,"cool":1},"hdkI_3fVptfr9FzZY6ERzA":{"text":"We always enjoy eating here we have never had a bad anything! The french 75, was the best ","useful":0,"cool":0},"y4_eOKtZ8B4LBr6B9UexNA":{"text":"Someone recommended this restaurant to me for a nice place near Frenchmen Street. A group ","useful":1,"cool":0},"PnaKJrC4p1F0iWZM30osgw":{"text":"The stop I made here was just one of the several that I made on my drunken night of debauc","useful":3,"cool":2},"plkOiXwcp9O-DWXInZochw":{"text":"Great food, great music playing (loud if you sit by the bar, not so loud if you sit in the","useful":0,"cool":0},"_4YLtTHxi_7XFpeNKPs0Cw":{"text":"Three and a half stars. Nice spot, attentive service.  Love the live music. Changed chefs ","useful":0,"cool":0},"57dr90TOTvUgQepRflAjBg":{"text":"Decent but not great, my husband's Coquille St, Jacques was good, potatoes were a bit blan","useful":1,"cool":0},"QmNrc1kjuTSLIZ_GBsygXQ":{"text":"MEH\n\nThere is so much good food in NOLA and right nearby on Frenchman, why suffer through ","useful":2,"cool":0},"ObbIxlX87gSMx0_UyKbtdQ":{"text":"The food here was okay. I got pasta with chicken and frankly there was not enough meat. Th","useful":1,"cool":0},"0Nefy77d3Xku-P-e-2Lrxg":{"text":"I never write reviews. But the general population needed to be warned. I sat here for over","useful":1,"cool":0},"_nBrBad7ri2Z16Xu3fHy3Q":{"text":"Awful. Awful. Awful. We had reservations for 8 people at 9 pm. We sat down around 9:30 and","useful":1,"cool":0},"VehVpVI5I2jmUUVoCQcmRw":{"text":"Loved my catfish/shrimp dinner. It came with the most delicious crawfish fritter. Next tim","useful":0,"cool":0},"bg4xiC-H3S5jrmb75xWtnw":{"text":"Came here last week for the drink specials and no cover for live music and came across thi","useful":1,"cool":0},"QAqGFySbfUrq_Hom1BFoXw":{"text":"Ducked in for lunch and cocktails. Boudin balls very good. Pork tacos also very good. Cool","useful":0,"cool":0},"klF_z0ZvzoNoaW2kpETXqA":{"text":"I went there yesterday and had an ok experience. I ordered the Crawfish Marigny which was ","useful":1,"cool":0},"KSp8Q7MqGAZmfuLXL7Ivrw":{"text":"Very disappointed to arrive and find it CLOSED. Looks like they been renovating. October 1","useful":1,"cool":0},"QsN-nsrpH6b4Z3UWIWGkOA":{"text":"Overall good experience. The Frenchman po boy was good! The fried green tomatoes were AWES","useful":0,"cool":0},"l__p0sa3h_BQlHwjWugtDg":{"text":"Excellent service, clean with great drinks, a little pricey though. Really enjoyed ourselv","useful":0,"cool":0},"ylIwdVt5hxXN7DeOzl8RMA":{"text":"Crawfish pasta was really good!  Fast service and great live music made for a great Saturd","useful":0,"cool":0},"qGzNQsNf-BLUXs-B_9p8yw":{"text":"By far the best meal I have had so far. I know the ranking is low but Travis n John the ne","useful":0,"cool":0},"oHBhL_1bDO6ZQKagkZ7NtQ":{"text":"We were lost on a walk in the French Quarter when we stumbled upon Marigny Brasserie bag i","useful":0,"cool":0},"SsJp15QTBZL2YoqauKAirQ":{"text":"Great place, food, customer service and atmosphere.  Most of our table had the Au gratin w","useful":1,"cool":0},"uV8EdzyC4QEVeEuWQyfPZw":{"text":"We had an amazing dinner!  Our server Tiffany was amazing, she knowledgeably lead us throu","useful":1,"cool":1},"5EhQU5_kgakbsSP0gvRRgw":{"text":"Best cocktails we've had in NOLA. Stopped in for a quick drink and a couple appetizers bef","useful":1,"cool":0},"h5ZRMNrFMgUaMPhJumdjfw":{"text":"Wow. Wifey and I bumped into this spot by accident and we are so happy we did. We had the ","useful":0,"cool":0},"mURvADxGpFzKTNdirkQ-Zw":{"text":"We walked to Frenchman Street in search of some vegetables (not to be found in the quarter","useful":0,"cool":1},"ADnTeAxLdbDjoKJPoak3Mw":{"text":"This place should receive a lower rating.  I came in with a group of twelve friends from C","useful":1,"cool":0},"FR8ctVioNWJkHMmkpvTh4g":{"text":"Lunch here was very good.  We came in I guess just after opening so it wasn't crowded only","useful":0,"cool":0},"D94ZzmlBGdvVwAfm2-82rg":{"text":"3.5 stars, rounded down.  Great specialty cocktail called The Hemingway. Good but not grea","useful":0,"cool":0},"vWdLiaJkx_xRVUYtGk-UrQ":{"text":"Had dinner last night here and was very satisfied. Our waitress was attentive and knowledg","useful":2,"cool":0},"-BAJpBD7ASn8X-ogWk7c4Q":{"text":"Very nice inside, reminded me of an upscale French restaurant. Unfortunately my girlfriend","useful":0,"cool":0},"rOAEThcX6KqJSCv-FfztqA":{"text":"My wife and I went twice over the Feb 19th weekend, once for breakfast and once for lunch.","useful":0,"cool":0},"RPl1MFn725A8gonwGGAGdA":{"text":"I got a $25.00 Restaurant.com certificate.  We were staying in the French Quarter and deci","useful":2,"cool":1},"WgVVsRz8erTHl9hGBcNCdw":{"text":"Great live jazz music. Kinda loud though. Had the lavender drink and momma's one and they ","useful":0,"cool":0},"-znJ7Aj7_Oe6wjpr0hmECA":{"text":"We stopped for dinner one night when another place didn't allow kids, and our friends had ","useful":0,"cool":0},"ANnOIcYVKMQr-gm85yhkmA":{"text":"This place was PERFECT...  The firefighter recommended it...  Always as a firefighter wher","useful":0,"cool":0},"Gu5jMn0xlREfh25HrWlppw":{"text":"My husband and I stopped in for a snack and a drink. It was only about 3:30 so it wasn't b","useful":0,"cool":0},"4NPMPcIekIbq-SKa-e3jew":{"text":"My husband and I ate at Marigny's for dinner several days before fourth of July.  It was a","useful":2,"cool":0},"xPqb9O-X32XMyU00MyLdOw":{"text":"I used to say I'd never had a bad meal in New Orleans, until I found this place. Our drink","useful":0,"cool":0},"ryGW9Emrs16d5PZlZoz6SA":{"text":"TERRIBLE!! I would not recommend this restaurant to my worst nemesis! The service would ha","useful":0,"cool":0},"iNaniKlvVK-S41Z4FhQp6w":{"text":"Food: blackened redfish w grits & green beans, steak & mashed potatoes, shrimp po'boy and ","useful":0,"cool":0},"Q-aEw3U44GfRmtI4s74mtA":{"text":"Honestly stopped here for a bathroom drink and then customarily ordered a drink. They had ","useful":0,"cool":0},"UtqPZdlJSn1wukgPRFW5nw":{"text":"Terrible service! We waited for our food for 1 hour and 45 minutes and then it was ALL col","useful":1,"cool":0},"7cOoekTjVzJOsgXq_2-dig":{"text":"Stopped here with my wife for dinner. It was the only restaurant on Frenchmen's St that st","useful":0,"cool":0},"JHezd1W4MF5Af15S-B0LYQ":{"text":"Never got to try the food so this is a service review only. Most dysfunctional restaurant ","useful":1,"cool":0},"M805PwcNU_PpxO2zX2WUvA":{"text":"Great spot for a reasonable priced meal. $20 steak was great, cooked a little over, so nex","useful":1,"cool":0},"WKK7rXxY8qatUmeu2Mp9yw":{"text":"Amazing cocktails - mojitos & Sazerac were delicious. Friendly bar tenders. Bread pudding ","useful":0,"cool":0},"p-RF028APQ7LfzIr4bVdRQ":{"text":"I have only had one meal this year that might slightly eclipse this one and it cost 3 time","useful":0,"cool":0},"LuxcEKEkBAoHif2Jaj4-qA":{"text":"We went here on a Saturday night and were graciously seated because our waiter agreed to t","useful":0,"cool":0},"qjMkI4OjVa4rL1Pn8AKzLg":{"text":"The whole experience was a pretty terrible one, beginning to end. There was no host to sea","useful":2,"cool":0},"Wz40zIQlek_2hcO0ZEu1uA":{"text":"Stopped in to listen to the music and it was great.  Drinks were good.  Went there the nex","useful":0,"cool":0},"2_0rLeXU5vq4vTzcscdhCQ":{"text":"Love the ambiance and the sidewalk dining. Bartenders make great drinks (try the Pear Coll","useful":0,"cool":0},"yPlQHHDDPH2DXCl9ZLgeaA":{"text":"Thus place is so good..you can come afternoon and enjoy the place. And Brian is so kind.","useful":0,"cool":0},"-pMq1Gnu9xhkOuqZ7dKS2g":{"text":"Our night started off poor when the hostess got our reservation wrong. They then placed us","useful":1,"cool":0},"5C8CvrNl5GqePncCjWZ93A":{"text":"Your review helps others learn about great local businesses.\n\nPlease don't review this bus","useful":2,"cool":0},"5dToqd7ubo6iBCFfwhe_mg":{"text":"Ridiculous joke of a restaurant. Do not go here under any circumstances. Food took absolut","useful":3,"cool":0},"grOK2KiN5unFCbvxgH0VuA":{"text":"A wonderful find in the up-and-coming Marigny district. We thoroughly enjoyed our meal, ou","useful":4,"cool":0},"hmpn3KHi6Z47xY1lYPlviw":{"text":"Can't stress enough how NO ONE should ever go to this restaurant. The food is terrible, th","useful":1,"cool":0},"B707yqY42qVcUd1zDyzauQ":{"text":"We stopped in for the Jazz, which was great. The brass instruments were clearly the stars ","useful":0,"cool":0},"yKGYatdsQRhG2hljjH_myA":{"text":"Two words that make a meal here worth it: truffle fries. They are delish! And if you are l","useful":1,"cool":0},"4RLpN_NWUSQlAZ27DozXqQ":{"text":"I was hesitant about going here after so many poor reviews, but it was my friend's birthda","useful":1,"cool":0},"OuR9Q0hLA3pKvXnrDYNxXw":{"text":"Our party of 4 managed to order three BBQ Shrimp & Grits.  And it was DELICIOUS.  This mig","useful":1,"cool":0},"E3NwJLyIlJ8F71y_dSZmkA":{"text":"Good music, to die for spin dip, nice bartender (jessica) and decently priced everything. ","useful":1,"cool":0},"IxT31B_ExX9zWbAVogCkRw":{"text":"Great place for lunch, dinner, and/or cocktails!  The bar has some very creative and refre","useful":0,"cool":0},"wiPR9GnVQrHRE6TrPpXZLA":{"text":"real nice for our first night on Frenchmen st. just off the plane, real jazz atmosphere. N","useful":5,"cool":0},"0oUxCFo6ovfY8Icm9DlPUg":{"text":"Went there yesterday for a bday lunch, and it was great! Loved the atmosphere- even though","useful":0,"cool":1},"hHXrcOdgpB1x1M8clt2z-w":{"text":"I dined here last night with a friend because she had a living social coupon to use; $30 w","useful":2,"cool":1},"wbc5bRcltW9TxpiLLjYrVQ":{"text":"Terrific ambiance; New Orleans flavored blues band. Tangy BBQ shrimp and grits, subtle bla","useful":1,"cool":0},"XiIdZp3xmN9EEmnVHeutyA":{"text":"I've seen this place many time walking down frenchmen. I decided to take my girlfriend the","useful":0,"cool":0},"vDN9Rtw33n-cuC2_rd8SRw":{"text":"This place used to be a fairly short stroll from where I used to live so I'd end up here e","useful":0,"cool":0},"weZ8eoQH-UuI-jvhPzNlpA":{"text":"We ate here this weekend. Below average service. Very below average food. We went here bas","useful":0,"cool":0},"lthC5gdZBwxqqo7mF3ivmA":{"text":"I read the reviews on here and was apprehensive about going, but ended up going to this pl","useful":3,"cool":0},"SZ4xqYUBBYEJbpvW6fmF5Q":{"text":"Me & my wife live close to Marigny Brasserie & have never been there in till tonight 11/29","useful":0,"cool":0},"IcG3gphji4RHo2BPikNywQ":{"text":"My husband and I were surprised by the previous reviews. We consider ourselves to be foodi","useful":0,"cool":0},"d9U5_RoVemSuud2oXDpasA":{"text":"Wow the fish tacos were A1. The Seafood Platter had Red Beans And Rice to die for and the ","useful":0,"cool":0},"JclF_U7ooDxkJlqCVlfaZA":{"text":"We found this restaurant when we were roaming about looking for a place to eat. Most of th","useful":0,"cool":0},"Tpc5RW8_9OcJA4T1QHCQgw":{"text":"You don't expect foot this good when you walk in. I thought wrongly that there wouldn't be","useful":1,"cool":0},"6QofqPQLtv7c2lNI2p4DWw":{"text":"They make incredible cocktails and the food is AMAZING! We had crawfish fritters, fried gr","useful":2,"cool":3},"eJRr5cVcXlCsLPocZKbE_Q":{"text":"Delicious meal. Service was fantastic. It was Friday 13th during lent so we didn't eat mea","useful":1,"cool":0},"QTcg9Q9P8iDxQmPHU12ikw":{"text":"Heard a great band here called the DinosAurchestrA. The food was a hit or miss. The crab c","useful":0,"cool":0},"8bdflAfhkp9YPNP2hU4nCA":{"text":"Great food and atmosphere.  I had the mr fancy pants burger with crawfish mac n cheese.  T","useful":0,"cool":0},"5bI9_otmgeFghyr9YKSBrw":{"text":"This place has an AMAZING vibe! I had a blackberry mojito and listened to amazing jazz mus","useful":1,"cool":0},"USoPn2ipURZKdnHOGQYf1g":{"text":"the service was bizarre in all the wrong ways and the food was mediocre at best. they're o","useful":0,"cool":0},"6Sfjzg1UMyiFO12uOdcuRw":{"text":"We've visited twice and had really good food both times but the service was really not goo","useful":0,"cool":0},"0MnCzAVK83VcXxwEs1cLdg":{"text":"This is a great option for Sunday brunch, lunch, dinner and drinks.  Specifically, I love ","useful":0,"cool":0},"Hioq4LhQKGG7J0usWtnRlQ":{"text":"We visiting this place last fall and LOVED it.  The food was to die for (hello boudin ball","useful":0,"cool":0},"jS6yRYbirQl8-gxbwVViUQ":{"text":"Complete letdown!  Went for lunch on a Sunday, ordered grilled catfish w/ mac & cheese....","useful":0,"cool":0},"BtXTGkn_2qbPPIyw3gbEiA":{"text":"Worst service I've ever had in a restaurant anywhere in the world at any price point. Our ","useful":3,"cool":0},"mHPAKsvCl38xFdPmP3Mbhg":{"text":"Hmmm, this is a tough one.  They were busy when we went in and so we bellied up to the bar","useful":0,"cool":0},"Ns3jlr38qKcHzkql-ipbew":{"text":"What a pleasant surprise. We dropped in for a light meal and drink. We ordered the strawbe","useful":1,"cool":0},"bVfgMeoCNmO4pkzGaK_NCg":{"text":"We should have listened when we read that the service was AWFUL!!!  We arrived 15 minutes ","useful":6,"cool":0},"270HngxZ3xbpTeHtA5Eq4g":{"text":"Amazing! We had shrimp, crab cakes, fried green tomatoes and cucumber basil lemonade then ","useful":0,"cool":0},"T4j67SYmZxMEYerVCbi1og":{"text":"My wife and I stopped here for brunch on Valentine's day. I remembered that I had very nic","useful":0,"cool":0},"37SSDpLSjbXShZwMACQF9w":{"text":"Definitely leaves something to be desired. Rather disappointed. This place was recommended","useful":0,"cool":0},"ClcLWIzF6DIdbEC-fdn8VQ":{"text":"Well it was a great night or server was good and did not rush us....however the lil blonde","useful":1,"cool":0},"2i5KmPu8sN5wOYZMdcmoEA":{"text":"With all the amazing restaurants in New Orleans, we had the misfortune of ending up here. ","useful":0,"cool":0},"mDxB1saM_WTgkpG6LzKhqA":{"text":"Had a great experience here and would have rated Ito 5 stars if they weren't out of the Se","useful":1,"cool":0},"JgvhLPh4DnJ_4pcWMydpTg":{"text":"First, Schantel was a fantastic server. Second... three stars?! How is that possible? Just","useful":0,"cool":0},"zWp_pKC5ZuN-cCoxu7pYQA":{"text":"Went here with my hubby and in-laws. We were not disappointed. Started with fried green to","useful":2,"cool":0},"h2VtNhPUK9SFg2M6t3x7sw":{"text":"After a few days in the craziness of the French Quarter, we finally came across Frenchman ","useful":1,"cool":0},"rxcWZ8wIZ43DyNXxYazLRQ":{"text":"I have never liked cole slaw until I had it here.  Jalepeno cilantro slaw is amazing, the ","useful":0,"cool":0},"RyLTeVfUfo-utd6ZuK7dlg":{"text":"This place was fantastic when it first opened but as the popularity of Frenchmen Street in","useful":8,"cool":2},"HTmDApnfzR3FJy92Gx88Bg":{"text":"How I know I'm getting old: I appreciate a bar with sufficient lighting!\n\nMy husband and I","useful":1,"cool":0},"dWQKbuFY4AGVmZ5iTECp2w":{"text":"Music is great and food is good but service is clearly their week point. We went two night","useful":1,"cool":0},"rRg6_1SZAgtwxf42wtBY4A":{"text":"If you are going to drop by this place for the band & drinks you will be OK. If you are go","useful":14,"cool":8},"r1FURKCeLEVP97yZCqAPLA":{"text":"Frenchmen would be a better street without this place... \n\n1) Very slow and inconsistent s","useful":0,"cool":0},"-w1DHC-VFGftGZ6_dC9Ikw":{"text":"Wow! Just over a year later, I actually made it back to eat and with the same friend.  Do ","useful":2,"cool":3},"8M2AFPqhOgO44v5c3HbpXQ":{"text":"Come here and ask for Patrick! He will make your day/night, recommendations on food are on","useful":0,"cool":0},"lkqFDthMfrm-Rqf6qHb8iA":{"text":"We actually ate here twice during our stay in NOLA. The first time was for dinner but we w","useful":1,"cool":2},"A9N3VVGKBPxp3e6bKbSRUQ":{"text":"If I was just rating our waiter, I would give five stars. He was AMAZING and he made going","useful":3,"cool":0},"ei2rjM5SoOWs9Sy8mzUGsw":{"text":"This place was awesome! The bar tender Eli was friendly and served awesome drinks well wor","useful":0,"cool":0},"e-zkt8mZovJKplZbNk3Q2Q":{"text":"Just don't worry about this place.  Service is sub-standard and food is just as bad.  Ther","useful":1,"cool":0},"h_QfRUsl0Yg2dCKcMP5LYw":{"text":"We went there after visiting Marigny several times.  The service was good, but the food wa","useful":0,"cool":0},"xNgT1gMfq9HPM_Met28oyg":{"text":"In town for a conference. Came in with of 3 others. Ordered and we got the apps pretty qui","useful":0,"cool":0},"KA0zTCJQjg2jNVXGGxm47w":{"text":"If I could give less than one star I would. Reservations for 7:30pm, we didn't get out unt","useful":3,"cool":0},"ydfKx24JDPR2rVaLBcW4xA":{"text":"Food was delicious. Got the spinach artichoke dip and fried oyster BLT and both were perfe","useful":2,"cool":0},"1sf0c9I2VSJ0X6Girdz2rg":{"text":"I came here with my family on Black Friday and we had a really great time. Between the fiv","useful":0,"cool":0},"n5qAKalIy1jXN_RrJErZog":{"text":"I went there lat week with my boyfriend. \nWe were starving and were looking for a place wh","useful":0,"cool":0},"tnnfJgj2jQsrthUSpzbjFQ":{"text":"I wish I could give a place 0 stars. This place was dirty. The staff was extremely unfrien","useful":3,"cool":0},"uGokl5dDde-2YZeZwqgXFQ":{"text":"We stopped here last week.  Had some crab cakes, etouffee, and above all the fresh redfish","useful":0,"cool":0},"gmUv9NnRVvUZaO2m7iuBzA":{"text":"I hated this restaurant. The service was horrible and the food was bad! Went with my husba","useful":1,"cool":0},"db4s83hECc1zuQtSzxq6LQ":{"text":"I had a fabulous hangar steak with bordelaise sauce.  The fries were perfect.  The service","useful":0,"cool":0},"NMKimbz6J3OlSyRp4b2Nig":{"text":"Food is mediocre at best. We are local and we were disappointed we took our family from ou","useful":2,"cool":0},"G12glVx4d0CO-gY7sybl9A":{"text":"AY Lappa\n\nCrawfish Pasta is the hardest dish to prepare the same consistently. There are s","useful":6,"cool":2},"mlH6b4cf078HRGuHh3Q2ZA":{"text":"consider my vote a 2.5\n\nI have wanted to visit this place for a while now, I am afraid tha","useful":0,"cool":0},"27QCGPV-QQF37n7n3mElCg":{"text":"We came to Frenchmen street and was recommended here by the bouncer at The Spotted Cat. Wh","useful":2,"cool":0},"ZwrydO8Xw1rXmlnxPVcpdg":{"text":"The bathrooms are very decent here but the bar service was horrible. I was patiently waiti","useful":4,"cool":0},"ORqSBcRvV984L4fOF8wbEQ":{"text":"Poor service.  My wife and I were greeted by the host.  Never told that they had a limited","useful":0,"cool":0},"nowXaEP6X1X8itTchrhajQ":{"text":"hmmmmm well the coffee was so so and the food was pretty flavorless, but at least they hav","useful":0,"cool":0},"IBjfYCUSc_YjhC8bQbPNMQ":{"text":"The friend Catfish was wonderful!  It was light and fresh tasting . The mac and cheese was","useful":0,"cool":0},"aFZrX-t-ALkVkyg_IUQbqQ":{"text":"Tasty food and good for groups! Live music wasn't overly loud in the larger seating area. ","useful":0,"cool":0},"bFWYNExHYWrVLRkFIDYJ9A":{"text":"It was amazing. The service was great the food was amazing! Upscale feel but you can still","useful":1,"cool":1},"xsFo2bQr43zkhvovq2zfow":{"text":"last night this restaurant deserved 1 star. i give it 2 because i think i hit it on a part","useful":0,"cool":0},"puLnpDh16zN0uc3M66ABRA":{"text":"We had dinner there this past Tuesday.  They were having some issues, cook/chef missing or","useful":1,"cool":0},"gMlG5Y2IkyTpS7MXXlVU_g":{"text":"Fried pickles, unparalleled so far in NOLA (and I've tried them at no less than 3 more pla","useful":1,"cool":0},"O7-XI5PIAhr6dDzYVFiuHQ":{"text":"Great little neighborhood spot.After a few nights of expensive,heavy meals we wanted somet","useful":0,"cool":1},"sRmLtc2OROU4o_jrX28ZjA":{"text":"This place is a tourist trap disguised as a nice restaurant. Was walking around the quarte","useful":0,"cool":0},"o1BvEXujg0kwRGJExInKLg":{"text":"Really awful.  Just waited here for more than 20 min and the place is not even full.  The ","useful":0,"cool":0},"ke4Hjeag_knCA8EPIeYrKQ":{"text":"Happened to be passing through the neighborhood and caught this gem out of the corner of m","useful":0,"cool":0},"6vhs2Hp4wUUZaD9jOoRK1g":{"text":"Really enjoyed our time here. The blackberry mojito is bomb.org. The staff was friendly an","useful":1,"cool":0},"6RJPpC-xH9CT9VZKKR1s8Q":{"text":"We were in between meals when we stopped at the Marigny, so we had only appetizers and dri","useful":0,"cool":0},"IgLHlGjZmZSbq68PgtQJgw":{"text":"I've sat down to eat at this restaurant on two separate occasions. The first time, I broug","useful":3,"cool":0},"r61Iwc0pGRVFy5KSxU7z2A":{"text":"Over priced frozen food.  Terrible service, had to keep asking for silverware pretty sure ","useful":0,"cool":0},"9EY3XCxRfk9X_SUXWI-uwQ":{"text":"I am just going to reiterate what many others have already said. The service is terrible! ","useful":0,"cool":0},"Ozh2FJC--KiaiId1ihWSug":{"text":"Horrible food, staff, management and owner. I've been 3 times. Each not pleasant. So I won","useful":2,"cool":1},"N2R_9UIMj4ahscjxPpvDjw":{"text":"The food was ok. The service was HORRIBLE! The very stoned waiter stood at one end if the ","useful":0,"cool":0},"OhL_5FnB4BYkpIH5NDuI4w":{"text":"The service at the place was not very friendly, the food was not so great. I ordered the f","useful":0,"cool":0},"bM0rHfMARuCVkQqBhDl_cw":{"text":"The server was nice, and we got our food in a timely manner. The onion rings were deliciou","useful":0,"cool":0},"vg7KivqJvlu6PcCjp5a1fg":{"text":"I'm surprised to see this place only has three stars! My husband and I loved it. Beer was ","useful":0,"cool":0},"pItBcMKPup6FfA6bAKKq7g":{"text":"Marigny Brasserie is indeed a place to hit up when you are in the neighborhood and with th","useful":2,"cool":2},"FE7mil1g-qir8g4vfsnbZw":{"text":"We were in New Orleans for 3 days and our meal at Marigny was our favorite and we will def","useful":1,"cool":1},"Z0eVwn2D0OKnlUCO_3un5A":{"text":"After one full lot to the next full lot, an hour of circling Decatur for a parking, my boy","useful":0,"cool":1},"15HVISbYxr0PMgdfyXbhyw":{"text":"Came here on a Friday night for live music and drinks. Great spot if that's that you're lo","useful":0,"cool":0},"lQXc561ToS47VKV_X7D6nQ":{"text":"This was my favorite dinner spot while exploring New Orleans! It was great to put in a res","useful":2,"cool":1},"Y0NOA5QJrfHo1qPCuBwaEg":{"text":"called a dozen times in two hours this afternoon to make a reservation on the recommendati","useful":0,"cool":0},"r3JDiO2BtcJamy0whzjoVg":{"text":"Excellent food, excellent cocktails and impeccable service. We sampled the steak, salad, t","useful":0,"cool":0},"oZ0z5TpUf8W62RO8CB9OEg":{"text":"It wasn't a bad experience, but it was forgettable, and immediately wish I had spent my mo","useful":0,"cool":0},"jrBhGWbl2svmD9gVHhGe7w":{"text":"If I could give this place 0 stars, I would.  I had lunch with four of my girlfriends and ","useful":1,"cool":0},"q0MWB5ZCn_Pz8TN51t_4jA":{"text":"What a lovely place to dine in! I came here during the day on a Saturday, the place is spa","useful":1,"cool":0},"nHrD6ptOUA6B7VIlVGSS8A":{"text":"Made reservations from out of town weeks ago. Got seated quickly. But then ignored for wel","useful":0,"cool":0},"vJRV8J3wroDMbmWPQp628g":{"text":"We had another great lunch in New Orleans here - took our time and had an appetizer, 2 mai","useful":1,"cool":0},"s8beFiuo0te5eColbs1qdA":{"text":"The first time we visited was a Sunday and the service was a bit slow.  That being said, o","useful":0,"cool":0},"1XOmctvvx79gJCP-WDK4DA":{"text":"Good little spot away from the chaos of Bourbon st.  Live music decent size restaurant.  F","useful":0,"cool":0},"CLKKOrzHlUCBLXNBRSp0-A":{"text":"Bar service is second to none! Visited here with my BF for New Years, very busy but we nev","useful":0,"cool":0},"zQGV8mQKyIeQimSXjdnzfw":{"text":"Not going back again!\n\nWe were a big group and went to the place since it was one of the o","useful":3,"cool":0},"cqoYnbRLSuiD5BlrXZvv_Q":{"text":"Located in the heart of the Marigny area, all I can say about the chef is ah mazing!!!!  T","useful":3,"cool":1},"sb8pRcPOPnP_KjP4Db1N4g":{"text":"Some of the best bbq shrimp and grits I have had. Salad was also top notch.   Service was ","useful":1,"cool":0},"nbq2SxZFnLFQDe1_Jhk13g":{"text":"The drink were alright but the food and service was great.  Loved the gator sausage.","useful":0,"cool":0},"r-DqNJ8Fb_4QLDen0gw-GQ":{"text":"Very disappointing experience. Service was next to nil. Took ages for the food to arrive p","useful":2,"cool":0},"h1eum-5ODb-CQwvSnKU3Hg":{"text":"Just had drinks and cheese fries but they were amazing. The band was awesome jazz music. R","useful":1,"cool":0},"pd6foj5mV99m30hMyXWS9g":{"text":"On a recent romantic weekend visit to New Orleans, we met up with a local friend and anoth","useful":1,"cool":1},"6yPQNTN_4hGNrcsBVX93_A":{"text":"Delicious lunch and cheerful service in this local restaurant.    We loved the pulled pork","useful":0,"cool":0},"ICZkLpM2wFnpyAmx_1159g":{"text":"We had dinner here last night.  The food was ok and really just ok.  I had pasta with shri","useful":2,"cool":0},"2Tttn29MSoWbTCBfbAyAeQ":{"text":"We stopped in for a place to listen to music while eating dinner.  We got friendly service","useful":0,"cool":0},"Jte_9cWZlFPfOWv6Dwr4Vw":{"text":"Such a nice place to drop in from time to time.  Nice atmosphere,  sometimes we catch a ba","useful":1,"cool":0},"4mKbfucXTwdalCRwfiziCA":{"text":"This place is a tourist trap disguised as a nice restaurant. Was walking around the quarte","useful":0,"cool":0},"PpWCUZQCyJTbRPNb_pW9nQ":{"text":"Cool place for a great drink. There was a really good bad playing too, nice sound system f","useful":1,"cool":0},"spR7yq2uRnR9zaCi5bk3OQ":{"text":"Came here years ago with friends and every time I'm back I make sure to come here... love ","useful":0,"cool":0},"j2RHOFC4_799hXOELkqjbQ":{"text":"Service was awesome.  Fried pickles, truffle fries, green beans, chicken quesadillas, and ","useful":0,"cool":0},"CYbTlCz0T1QBiHtj1rquOg":{"text":"The atmosphere is clean and comfortable. I sat at the bar and met the most amazing people ","useful":1,"cool":2},"YCj9oOu3kSpSWIuRANtSrA":{"text":"Drinks and appetizers, and dessert, and live music on Saturday night. Sat outside, whet th","useful":3,"cool":4},"nYYw9Xcl_8_S2GsW3wfkow":{"text":"Clean, updated and friendly. We enjoyed a warm, delicious banana pudding as we waited for ","useful":0,"cool":0},"r9tx6qWd2AmSIRDfooF1MQ":{"text":"It was a great experience! The Shotgun Jazz Band was playing in the front room where we at","useful":0,"cool":0},"3AYD2JiCQ-vHerllnA4tsw":{"text":"Four of us ate here last night and had an excellent meal. The service was terrific. My cas","useful":0,"cool":0},"JloonB7gRcb2m5HXloVU_g":{"text":"We came across Marigny after the clubs on Frenchman. What a delight! The Shotgun Jazz Band","useful":0,"cool":0},"lQTe5LUeRAKRckxo_tAxDA":{"text":"Very disappointing experience. Mediocre food and poor service. Incredibly slow even though","useful":2,"cool":0},"HPflFnvaIG05exU1fhS0Og":{"text":"After a ton of visits I feel I'm ready to write about my experience. My pickiest of eaters","useful":0,"cool":0},"5-OxpzH0QrusZtTlJIBG_g":{"text":"Came here on a Friday and there was a great live band! Fried green tomatoes were excellent","useful":2,"cool":1},"IDwZbnXbaET3xM5YgkOUbA":{"text":"Pre show dinner.  Had no expectations but thoroughly enjoyed it.  I noticed that their hos","useful":0,"cool":0},"ej1los7dz6xZYz41kcchBw":{"text":"The vibe of this restaurant was relaxed. The love music was very enjoyable. As was the art","useful":0,"cool":0},"8NlteCCmENktLgrQEyT73A":{"text":"Really enjoyed food and atmosphere. Had the special Drum with buttersauce,pecans and crab ","useful":0,"cool":0},"XL-DbmwcvAlnlxj4vohJtA":{"text":"The service was extremely slow when we ate here and the food we mediocre at best.  I am a ","useful":1,"cool":0},"xgN5f0IlyhsyyeKljyLKIg":{"text":"Took 2 hrs for 4 Po boys to come out. Not very busy while we were there. Felt like they kn","useful":0,"cool":0},"qf6kWEuFf2-SxOSXXXT4Rg":{"text":"Nice! Really good cocktails. The crawfish fritters and the bbq shrimp and grits were my fa","useful":0,"cool":0},"U19iyRSWR_lhib0hf-Du-w":{"text":"AMAZING FOOD. I'm a New Orleans local & this place does it RIGHT. Great food. Great LIVE m","useful":0,"cool":0},"tDCUJ3zJt9XTxpaM9q71rw":{"text":"This is a hidden gem. Who knew that the food would be so amazing and the service just as g","useful":0,"cool":0},"kkbcTTzhpxYC_d-y2QUAaQ":{"text":"Service was great, music was fun, and the Fancy Pants burger was SO good. The meat was so ","useful":0,"cool":0},"qBDccH_8kMnQgzjGg6DMeQ":{"text":"Friday night band,  Vegas Cola, was AWESOME!! And the bartender's were top notch! Thanks f","useful":0,"cool":0},"qBGojO_yk9VfXee6MA08yA":{"text":"Congratulations, Travis and John! You guys are knocking it out of the park every day. I ha","useful":3,"cool":2},"3Uqay7UY_gCBFSxNM_C_6A":{"text":"I have visited before and loved it; however, the food quality has taken a hit lately. I pa","useful":0,"cool":0},"vO0HALLvGy8xLJL282v0CA":{"text":"Maybe we were lucky, but we had excellent catfish with the chef's crab sauce--the special ","useful":0,"cool":1},"vL8AAJSYYRsWxgyYcANoVQ":{"text":"Came here on a Sunday night over Labor Day weekend.\n\nHad tried to get into several other p","useful":0,"cool":0},"_d5JkM5KAZrAHt3APFeZKg":{"text":"What an amazing find! My friends and I stumbled upon this restaurant while looking for foo","useful":0,"cool":0},"3MVSVXtNn491cPIuNBHeVg":{"text":"The food is pretty good. We had the crab and crawfish cake, the fried green tomatoes, and ","useful":0,"cool":0},"9D0wCPGbxF0ou7CX8om0ng":{"text":"This place is the definition of tragedy. The food is absolutely incredible- best Fried Gre","useful":0,"cool":0},"QTvKoXmzjPLgXdqMFwZMDA":{"text":"Excellent service as usual. Their evening band is awesome. we come here regularly.  I enjo","useful":1,"cool":0},"OGoXxABs7ois5Q-R5WUdqA":{"text":"I'm a little bemused as to why this restaurant only has a 3 star rating on Yelp as I just ","useful":0,"cool":1},"vDgEhnXRjth2fAJ44_8CPw":{"text":"Just okay. That's all I really have to say about this place.  We were too early for live m","useful":2,"cool":0},"ohS5Q0V_ZpdLNRuZf2ikfw":{"text":"Tried to eat there and there was a horrible atmosphere.  There was atleast 7 dirty tables ","useful":0,"cool":0},"NlzWBypzMHSaGFLNRCzB6w":{"text":"Best restaurant we tried in New Orleans! The crawfish/shrimp pasta, BBQ shrimp & grits, Ma","useful":0,"cool":0},"phNBszPuMI5jRfTDygjz-Q":{"text":"I came at 10pm with my sis on a Saturday night. Live music, loud, seated instantly. We had","useful":0,"cool":0},"CS-ZqAcRNdq3c6wHywWsEg":{"text":"Came with a big group of 11. \n3 hours later we are splitting up our own tabs from one chec","useful":5,"cool":0},"KzJ2oS4-trqpiWOs8VdJsg":{"text":"So much yes! We liked this place so much we came here twice in one day! Our server, Ashley","useful":1,"cool":0},"lnYuzguGbHsJWXL3xGpVJw":{"text":"A great place to get food and drinks.  Very nice and friendly waitress.  Clean but a littl","useful":0,"cool":0},"nCQBpXXB4HD7KXkknHdLDw":{"text":"Figured I'd give this place another shot after a bad experience a year ago.  Decided to du","useful":4,"cool":0},"A1o-BK4LH2UnuirqVR2TjA":{"text":"One of the best meals we had while visiting NO.  I had the fried chicken macaroni and chee","useful":0,"cool":0},"U-6wXGmMKD0wgRYWCr4Cog":{"text":"This place rocks.    Great staff and great food.   \n5 of us came and we all loved what we ","useful":0,"cool":0},"ZKNdjQM9uGBoa7z_IhodWg":{"text":"Really good experience! Food was good. Lemonade basil and peach sangria were excellent. Ve","useful":1,"cool":2},"val6SIRG5CH32hf_PKfsUA":{"text":"So, we got into town and were staying about three blocks away from here.  When our room wa","useful":1,"cool":0},"ykjLlnWsKwVEHed9qhCMYQ":{"text":"This is for the \"food\". It's pretty bad.\nThe servers are nice, the kitchen is not!\nThe fri","useful":0,"cool":0},"xiharmD30XVUMsJrLCywpg":{"text":"I had many great meals here.  Its expensive but they do great twist on Cajun food.  Extrem","useful":1,"cool":1},"WDzkB7JCtE8VjcFS37O9oQ":{"text":"Great Mac n Cheese options, shrimp and grits and the red beans and rice was awesome!  Righ","useful":0,"cool":0},"0-zjeHEGI6R8OzJ_zN8olA":{"text":"Spot on service, from greeter to manager. Widely varied menu with unique and delicious foo","useful":0,"cool":0},"b4Coy25Apo6ZO3YTH3oJMw":{"text":"Excellent choice for al fresco dining and people watching. I enjoyed the oyster blt and my","useful":0,"cool":0},"dQLw2VZ9aCruj8yK2MSMYQ":{"text":"!!!!HUGE DISAPPOINTMENT IN NEW ORLEANS!!! This place has the worst service and worst vibes","useful":0,"cool":0},"3xjl6iUh43seqck3VMVRcw":{"text":"It was so good I got the stake my husband got the fish. Wonderful. The staff was really ni","useful":0,"cool":0},"SyrHCaSSK1uqzVNO_av7UQ":{"text":"While walking near the French Quarter, deciding which restaurant to patronize for lunch or","useful":0,"cool":0},"oMMnOXeMAT9c7G622cTtCA":{"text":"Great specialty cocktails and music! The bartenders here are very attentive and cheerful. ","useful":1,"cool":0},"WpGKQTZaVnwQmDqDbk7IrQ":{"text":"My wife and I ate here, found the food and drinks to be below average, and subsequently sp","useful":5,"cool":0},"841H4E8vFvms3S7vVpzhVA":{"text":"Wonderful neighborhood restaurant with great service and an amazing staff! Menu options pl","useful":0,"cool":0},"BtW39J8lFW6lu3umxYr-Sg":{"text":"We made reservations for dinner here on a Friday night in March for 8 people.  Even though","useful":0,"cool":0},"hM7x3WdopOmGZjrVo6NDag":{"text":"I stopped by Marigny Brasserie last night because it was one of the few restaurants on Fre","useful":0,"cool":0},"bG00gNSzhY6s_lw_1am3aw":{"text":"We had a party of 3 people and the total bill was $93. We had spinach artichoke dip that w","useful":2,"cool":0},"xYV-W0Zjw_NbrAeArz3MTw":{"text":"This review is for their happy hour specials.  That peel n eat shrimp is so fresh and juic","useful":0,"cool":0},"5A-2P4SegzgyklSdn4QVRA":{"text":"Food--5. Shrimp and grits, Caesar salad, fried green tomatoes. All tasted great, but the t","useful":0,"cool":0},"80jHrUIGUTKMzAFcgfKedA":{"text":"It's Fat Tuesday, the entire town is wasted (including at least one in your group of 3), t","useful":7,"cool":9},"8puVHqLCC8TKWUjx6oqScQ":{"text":"My friends and I happened upon Marigny last Sunday for lunch. We absolutely fell in love w","useful":0,"cool":0},"b7ZHKjN5c8mXUKNU1nKa4Q":{"text":"Slowest service we've seen in New Orleans so far. We were seated a little after noon. It t","useful":0,"cool":0},"MafrQQJK5qV3Eq4rTe-nQA":{"text":"Food was alright, but if you're going there for the vibe (live music) it's great! Heard a ","useful":1,"cool":0},"f0ied2VxSZd545zuxYmpLg":{"text":"We ended up finding this place due to its proximity to our AirBnb...and it delivered. They","useful":1,"cool":1},"Sh6nFhhgcMG-558dm8O1JA":{"text":"Everyone working was lovely and made the most of what seemed like an overwhelming situatio","useful":0,"cool":0},"FnZ2H7f021HQrrk5q8CWgw":{"text":"Great place to eat. We walked right in at 7 on Saturday without waiting. The food was grea","useful":0,"cool":0},"FrUPkCBzS2gFR29YYRaGww":{"text":"Solid choice. Crafty bartender. Great red beans & rice. And the owner is walking the floor","useful":0,"cool":0},"__c2KcuuLs9aAqSskMPVlA":{"text":"Definitely a nice laid back restaraunt with very attentive staff. I had the PO' boy sandwh","useful":1,"cool":1},"AcVP_WD_FiwaNWmyKfj0Jg":{"text":"I went here during the last night of a work conference I attended in March.  My \"Mr. Fancy","useful":0,"cool":0},"gvQo84egNG6wXse3d_0NWA":{"text":"We came and saw Vegas Cola perform and had an absolute blast. Great ambiance and a little ","useful":0,"cool":0},"jq4CEfBQr4kQLOhOlmAYGQ":{"text":"We got there late on Fri night and they had no tables. As we stood outside trying to figur","useful":0,"cool":0},"VostgOCiZ8b1KSrKkmoEFw":{"text":"I always love eating at this place. The food is great with a very relaxed environment.","useful":0,"cool":0},"8D2IDCC0aGEkMNtybEPXPQ":{"text":"This was a last minute decision of a place to eat, but did not disappoint!! The crawfish f","useful":0,"cool":0},"cZoDrEmc3t5cMxpCW00V7Q":{"text":"Could not have had a better dinner. Thank you. Appetizer, salad, dinner, dessert, service ","useful":0,"cool":1},"km19ENF8QaFYjLzOUxXUhA":{"text":"Excellent seafood and music playing. People were dancing while they ate which was nice to ","useful":0,"cool":0},"_Fx9KtXu-oAiNg83i9pGcQ":{"text":"This place is the real deal. Very solid food, great music, you honestly can't go wrong. Be","useful":0,"cool":0},"kfgQTuQR-AH_dan6tG3IKg":{"text":"The best meal we had in this area. Seriously amazing. Top notch food and atmosphere. Thank","useful":0,"cool":0},"_boFL4zlQ15EWndDSJtDoQ":{"text":"Food: The Mac & Cheese is a must try. My mom got the Pork Mac & Cheese and it was truly sp","useful":0,"cool":1},"_TFLp2wsMAifqbeKJLkJEQ":{"text":"The Marigny Brasserie, located at the corner of  Frenchmen and Royal Street, is a casual s","useful":1,"cool":1},"dgI3obUOQUL3lB8NhA4BLw":{"text":"DELICIOUS! + Patrick was such a kind + tremendous server. Get the Beet Burger - even if yo","useful":1,"cool":0},"Eimf10VB9s7l-CCMX-pWGw":{"text":"Dined here in July 2009. The food was fantastic, the service outstanding, and no one looke","useful":0,"cool":0},"sKwPA-hb7sEwP6GZbNupPA":{"text":"We all enjoyed the food here! The shrimp po boy was a table favorite. The cocktails were a","useful":0,"cool":0},"bZ501oxUvWo_0z5M5OInng":{"text":"The place have a life music. Great atmosphere.  Very NOLA. Did had a reservation and were ","useful":0,"cool":0},"YDUHTXsZ0qv6x2lUMBFcGA":{"text":"5 stars for the band/musicians playing. Awesome group of guys, great music. Would recommen","useful":3,"cool":3},"5eM71_ZPobXKGR8-3hj2JQ":{"text":"We had a reservation, even on a Tuesday night, as things seem to have been really busy on ","useful":0,"cool":0},"ZBK9_8EeiHqZrkkjXxBQ5g":{"text":"Had a wonderful meal here. The crab and crawfish cake came with a lemon and caper sauce wh","useful":0,"cool":0},"2F1n_QgwIx_04oauO5dKBQ":{"text":"We came here for an early dinner on Friday evening, and it wasn't very packed. There was l","useful":0,"cool":0},"Bf5LWurVZa0jJ8AN8NN2Dw":{"text":"Great food, fantastic burger and very good service.  The manager came around and talked wi","useful":0,"cool":0},"B7XqkFxj-n7TwBWFh96sNA":{"text":"The food was delicious. Try the spinach artichoke dip--so good. Also if you are looking fo","useful":0,"cool":0},"3KzPh8MIIRVEirheWLuc5A":{"text":"If I could give zero stars, I would. I made reservations through open table for 7:30 pm on","useful":0,"cool":0},"IerUbEfIyeL_-huEVicKeg":{"text":"I came to this restaurant with a group of three others. We ordered for apps the crab and c","useful":0,"cool":0},"TGLEHKeZbGR0gODasr1nGA":{"text":"Friendly staff.  Food is amazing.  Highly recommended.  Great music amazing prices what mo","useful":0,"cool":0},"Ujoxzbmdn7SYDvqCeY6whw":{"text":"This place is amazing they had a live band and a great wait staff. I had the Florentine Ma","useful":0,"cool":0},"BwI1eGEaZ3ZY9vvyzANmkA":{"text":"This place was great we were greeted warmly and taken good care of. We had crawfish fritte","useful":0,"cool":0},"q_IbTq1-chM7Dou-mYtuPg":{"text":"Went tonight for dinner. Menu looked great. Waitress was Jessica. Very rude and disrespect","useful":0,"cool":0},"IY74eI3sfH2vlAbfy-_SzA":{"text":"I don't like to write three star reviews for restaurants because I usually lean towards 2 ","useful":10,"cool":5},"F2xgHX4GOmFzZVxbR8SEnQ":{"text":"Fantastic.   Everything  we had was delicious.    Fried Brussel sprouts that could have be","useful":0,"cool":0},"YG8OvU4FkAsWy9JKlqc6XQ":{"text":"I would have given this restaurant zero stars if I could. We were a group of 12 that went ","useful":4,"cool":0},"LUxXCzXn8UYyFIO3hGxv6g":{"text":"Nice ambiance. I had the bbq shrimp and grits, it was wonderfully flavorful. My date got t","useful":0,"cool":0},"a-_scYkcM_0lWsfqVk56Fg":{"text":"From the minute we walked in this place was awesome. Our server Tori was amazing. We spoke","useful":0,"cool":0},"C_Envu9625MxfNpsV1rOTw":{"text":"This place made me wish I was never born. The service was lame as hell. (Though if I could","useful":1,"cool":1},"Wlvm09RQ6-GmnSPJ7GuVOg":{"text":"So happy we had our last dinner of vacation here! Gorgeous spot on Frenchman Street with d","useful":0,"cool":0},"XPp8cxCRWmeHfIEqIxGz6g":{"text":"The best food we've had since we're got here.  Top that off with plenty of gluten free off","useful":0,"cool":0},"tmTWcCfC5ea-Cf6eCSqQ1Q":{"text":"In my opinion it wasn't worth it . We came here for lunch and had a coupon deal but my hus","useful":4,"cool":0},"insQav6JVJ4R1b67s7CFlA":{"text":"First time here...all of our food was great and staff was super helpful and accommodating ","useful":0,"cool":0},"ydCC5iwaXI2bSfc9xsv1Tw":{"text":"Let me cut to the chase: AVOID THIS RESTAURANT and GO SOMEPLACE ELSE. Marigny is completel","useful":3,"cool":2},"arQuVYkO3dG2nuwqAgIROA":{"text":"A cute little restaraunt right off of Frenchmen. The food wasn't bad but not spectacular a","useful":0,"cool":0},"6SBDNBkEcq8-Dpq1CAZrCQ":{"text":"What happened to this place?! I am shocked to see any good reviews!\n\nMost likely, the good","useful":0,"cool":1},"fnm9hTyjt7_vcJcX5xPGhw":{"text":"Came in on a recent Sunday night for a night cap. Regretfully, after feeling invisible for","useful":0,"cool":0},"P-TH0beaSAlh0YwlpPCR2Q":{"text":"Amazing, loved it so much we came back a second time during our stay. Gumbo, red beans and","useful":0,"cool":0},"MEc2TfZqwN3AwPb7qF2HXg":{"text":"First meal of the vacation and it was a hit! Great food and wonderful jazz music. Thanks f","useful":0,"cool":0},"6a-iJYSvQXvtJ6NRII0PWw":{"text":"Super great band, lovely establishment, but horrible service! The bartenders were extremel","useful":0,"cool":0},"bXl-OCersr783VAz4f0m0w":{"text":"Waitress forgot about us and it was not busy at all. All other waitresses were chatting, n","useful":0,"cool":0},"hYLV-Ekz0hLdnGWhgSxQmA":{"text":"The food and the cocktails are both pretty good and the prices are fair. This is the kind ","useful":1,"cool":1},"mlnoPp7-jqc4VzCwpuedFA":{"text":"Love the drinks here!  Had the Hemingway but had it with tequila instead. It was fabulous.","useful":0,"cool":0},"e-KbWficYnPXO3l1wjFPQA":{"text":"I'm I'm currently sitting at Marigny Brasserie, the time is 10:15pm and we were seated at ","useful":2,"cool":0},"9bblg8pkfQEfwhhC4P5JYw":{"text":"Found off of Yelp and Yelp you did me right with this one. Fresh local fish that was sooo ","useful":0,"cool":1},"H4R0NuZ4dNi7go92DbO6VA":{"text":"My husband and I went here on a whim for a drink and an appetizer. Loved the bartender, sh","useful":0,"cool":0},"pGvf9glBmg5RdpJpMXZD-A":{"text":"O.M.F'ing.Mac!\nI consider myself a Mac and cheese expert and I've never had one like their","useful":0,"cool":1},"GCJAVW4cfx5T1jn1oPN8bg":{"text":"Delicious and authentic Cajun cuisine served at its finest. Expect to find fresh food and ","useful":3,"cool":4},"YB50jdRnIwYe4at60mPe8w":{"text":"This was, unfortunately, only one of a few places to eat at on Frenchman Street that wasn'","useful":1,"cool":0},"vMH4OT4xVrVPrFDpRanuYg":{"text":"The best shrimp and grits I've ever had. My friend had the red beans and rice and enjoyed ","useful":0,"cool":0},"5vvuXNZdt-o0RnAuCE2j1w":{"text":"The food was pretty good. I got the Marigny pasta with crawfish and shrimp. Really tasty. ","useful":0,"cool":0},"1CfYLEk_PTYBKKe7gfeq0w":{"text":"Walking up and down Frenchman street this place caught our eye. The live music and vibe wa","useful":1,"cool":0},"6D4dNwbKELX27UEWwFOrNA":{"text":"Nobody recommended this place, we did a random search on restaurants on Frenchmans with at","useful":0,"cool":0},"14W32ULMFDgx2y1PdGwVww":{"text":"Had dinner reservations before a burlesque show.  Seated fairly quickly but the service th","useful":2,"cool":1},"nzjPPFn_c84EaecXNJqvhQ":{"text":"Great place for a quick bite and jazz music. Server was great and the bread pudding was yu","useful":0,"cool":0},"DBo__CqG3Z-Avf20udGWaw":{"text":"Our first night in New Orleans we wanted something quick for dinner and chose The Marigny ","useful":1,"cool":1},"_P_-CroJiHFsAdr1iUHclQ":{"text":"The inside of this restaurant is great.  Very light and bright unlike many NOLA restaurant","useful":0,"cool":0},"GRevfqI1IgI-PGVdFXGDvQ":{"text":"We had a party of eight at The Marigny last week. Everyone enjoyed their food and experien","useful":0,"cool":0},"TAJOGUuaVzS3pMiI5MznFg":{"text":"The pork belly Mac n cheese is so delicious. The place itself has a good vibe- you get to ","useful":0,"cool":0},"N_XOKFukXwS9Ofzx6ah4Rg":{"text":"the ambience is fun but too loud. The bbq shrimp was good, the Mac and cheese was deliciou","useful":0,"cool":0},"kQMQLwAp5-njDwfboVWMDQ":{"text":"Nothing short of fantastic!  \n\nMy husband and I wanted something a little less busy than t","useful":1,"cool":1},"znnpivCERUXvsy67jnQgyg":{"text":"To ring in 2011 the right way, the girlfriend & I spent the week around New Year's Eve in ","useful":1,"cool":1},"2W6fj-joQdtq2qKnXmeisA":{"text":"Stopped at this place for lunch and it was not busy at all. It started off promising, but ","useful":0,"cool":0},"ste7hCk9_8lqgcYUmU7IAA":{"text":"Across from the Frenchman Hotel and Bar on Frenchman Street, the hang out for locals and t","useful":0,"cool":0},"KFIWMbMRpl9Vp66ABNpS8g":{"text":"Oh my god what good food and service! My party of five was able to get right into the rest","useful":0,"cool":0},"30vJZAtT-gkSO6-G_nRZRw":{"text":"The food was good. Service left a lot to be desired. I understand that with COVID the rest","useful":0,"cool":0},"CQhsuUu7nhq-7iQ7e3N0Jg":{"text":"Here for French Quarter Festival. This place is a few blocks off main venue but never-the-","useful":4,"cool":0},"ym_gAJV3kdMVqQ2EUGnXJg":{"text":"My husband and I came here for our anniversary back in October wIth a couple of friends. I","useful":0,"cool":0},"KnH9sbBqLcHFA-eCUvGB5g":{"text":"So here's what happened. We had been out all day Sunday, just walking and letting our feet","useful":1,"cool":0},"rkE0-fcEgZz2fxwkskmZnA":{"text":"Looking for a  place to eat on Frenchman's after our original plan fell through & found th","useful":0,"cool":0},"OKCiDADLhBwUfyQK3wIgYA":{"text":"I came here tonight with some co-workers, we were looking for somewhere outside of the Fre","useful":6,"cool":4},"tRVV-ozJdnDKrk3ldE-psQ":{"text":"A pearl among the very, very many restaurants in New Orleans, is The Marigny Brasserie on ","useful":0,"cool":0},"w0AR5KQfswwpwBmrqTAV5A":{"text":"We went on Sat night, Feb 1.  It was night of a parade on Frenchman St.  We put name on li","useful":0,"cool":0},"s8dBwAb0wPTgh4JsTEk1Dg":{"text":"One usually equates New Orleans with good food but our group of 4 visiting from LA found i","useful":0,"cool":0},"VTMJNFob_Du0abPRdVmf4Q":{"text":"The food here is pretty good, but the main reason I keep coming back is that there is alwa","useful":0,"cool":0},"hRmXrarjPvFB9O6og9IOWQ":{"text":"Well my beau and I went here for a hour lunch break and let it be known to the manager  (w","useful":1,"cool":0},"Bxhlt2hHLKxVURFQeEyp0Q":{"text":"Best food we've had in New Orleans. We don't usually like Brussel sprouts- they have, with","useful":1,"cool":1},"LrYJG3ZvEsc3v0XIupTVKw":{"text":"Wonderful food, amazing service.  Stopped in by chance and couldn't have been happier.  Gr","useful":1,"cool":1},"Iu0lbM6ZGD7JvWss7o9SHg":{"text":"Awesome food, but small portions. \n\nBest mac and cheese I've ever had! The \"fried chicken\"","useful":0,"cool":0},"eYiGq4M1ncM6obQoNF7X2Q":{"text":"I am an out of towner and this was my first place I visited for dinner. \n\nNot the best pla","useful":1,"cool":0},"9EaJ54GsUMiO6BASIHH7Sg":{"text":"BBQ shrimp and grits ARE amazing, just as another reviewer stated. The staff is friendly, ","useful":0,"cool":0},"ZQilyRMzG2bQq7fRZbue8A":{"text":"We made a reservation ahead of time so we were seated immediately and had excellent servic","useful":0,"cool":0},"3IleZVWKrwE3mtPBKfp2zA":{"text":"Let us get this straight. \n\nI don't come here for the entrees or to grab a beer (pricey). ","useful":1,"cool":1},"GXYEUYGFOA-ydBG7S43tgQ":{"text":"The service was great the atmosphere and lube music were 5 stars. They were out of the fri","useful":0,"cool":0},"jAQbexWWJ886cTo39ET1jg":{"text":"Stopped into this area of town one night looking for some good live music. Great music ens","useful":0,"cool":0},"QcqCjIm1YZrS2JXb16MamA":{"text":"We sat down at 10:35pm. They close at 11pm. Despite this they were happy to accommodate us","useful":3,"cool":1},"f1nG61xcfNCGWFddq2HqNw":{"text":"I recently decided to stop in after hearing great things about this place! Upon walking in","useful":0,"cool":0},"F1jzM2krdgPYO74IwMAAQw":{"text":"I'm so glad Marigny opened back up. This is my go to in NOLA and this trip was just as goo","useful":0,"cool":0},"zLluoj7dEtQdKCequYTh7A":{"text":"Everything we ordered here was amazing. Each dish had rich, good flavor. This was the seco","useful":0,"cool":1},"2N0v1s7Vqp8HNopoZNv5Vg":{"text":"Excellent hamburgers and fries, red beans and rice was good too. Ordered food to go, staff","useful":0,"cool":0},"Fug8WnUB2oCuamn3tWnVyQ":{"text":"Food is absolutely delicious and the staff is super friendly. Great music and a great time","useful":0,"cool":0},"ifCM9E1MGMEnq3j-WLdSqQ":{"text":"The good: nice location, ambiance was nice enough, the people were nice, there was live mu","useful":0,"cool":0},"duIyh1QunkTHMzaLF88lRw":{"text":"We ate lunch here before returning home. I liked the laid back atmosphere. Bartender even ","useful":1,"cool":2},"83eE38ACj5e-sngel2yp2w":{"text":"Our waiter was kind enough to take our order in near the closing time of kitchen, the Mac ","useful":0,"cool":0},"EIJzl4soJCF4H0PJxSEr3w":{"text":"This is a pretty cool place on the outskirts of the french quarters of New Orleans. There ","useful":1,"cool":0},"EmIkGHAnsAN9_66dQjH6eQ":{"text":"Quaint little spot easily found right across from the park on Frenchman Street. We stopped","useful":1,"cool":1},"gtvgGzE3e75P6t3KSXOX6w":{"text":"Across from the Frenchman Hotel and Bar on Frenchman Street, the hang out for locals and t","useful":2,"cool":2},"gZ-I8FJU2O6jrUyXV8vDAQ":{"text":"New Orleans. There are so many food options, you can't go wrong. \n\nWell, that's a lie. \nYo","useful":2,"cool":1},"6N4p2Zs2CV-EN4PRfvknng":{"text":"My husband and I found our favorite New Orleans restaurant!!! This was the best meal we ha","useful":1,"cool":1},"XUZSNff5OTm8BLdLUqrcBA":{"text":"Stopped in during a drunken walk down Frenchmen Street and de uses to stop because the pla","useful":1,"cool":1},"Nxvthk7wtulabti6OBYBNQ":{"text":"Worst Service in NOLA trip experience. Our waiter forgot to give us silverware! Even after","useful":3,"cool":0},"1U6Q8fb6tA25SLq0I9I2YQ":{"text":"This place was super cute and perfect away from the large tourist crowds. The food was yum","useful":1,"cool":1},"LVg5bgnv8nQGWfekcf-Lqw":{"text":"Okay.  Lots of people seem to like it, but I found the food to be mediocre at best.  It wa","useful":0,"cool":0},"wAIhROLIA3Odhdzzgh3Vfw":{"text":"As a group of 7 on a Saturday night with no reservation it was hard to find a table, lucki","useful":1,"cool":0},"PeK1_85u7-gxMbXB_yPnJw":{"text":"My first and only visit was last week.  Good location.  Staff was friendly and efficient. ","useful":0,"cool":0},"pURlU38m9Pg6aBOj_hjvuA":{"text":"I ordered the fried green tomato caprese which looked absolutely delicious but it was miss","useful":1,"cool":0},"beUWEt5ivXhdKYpuEsDJIA":{"text":"Stopped here with my family as per a recommendation from a local we had just met and I mus","useful":0,"cool":0},"bqJ5x7OkOf_sCNkuWFX6yA":{"text":"Must try their cucumber  cosmo!  It's light and delicious.  Boudin balls, crab cakes, red ","useful":2,"cool":0},"zqa87ToBykUcDmXSDgpKpQ":{"text":"This is the best food I have enjoyed so far in NOLA.  I am kinda picky about ambience and ","useful":0,"cool":0},"lkUIbuU76l6Jh0UWAtlr9Q":{"text":"The food is fine, and the bar is a good one.  But what I really like here is the music.  W","useful":0,"cool":0},"NdezAqXLAq5pw75xKlvaQA":{"text":"One of things I was most excited about for my return trip to NOLA was a return trip to Mar","useful":3,"cool":0},"D4h3fd48OdZpU0DkV2AQ_w":{"text":"Really good food! We had the fancy pants burger, truffle\nMac and cheese, seafood pasta and","useful":0,"cool":0},"P8kCtnNuCNgisqe0QkNSbw":{"text":"I see several meh or bad reviews for the place and I'm surprised because it was the best m","useful":3,"cool":1},"aQ91amoLuhJ9CoOOqC4ZQg":{"text":"The new chef (John) is nailing it. Nothing short of amazing. We enjoyed the best fritters ","useful":2,"cool":2},"_vGth6bGXU9QHBd_lYzxTA":{"text":"It's hard to stand out in NOLA.  Everyone's got a good menu, good music, and great people ","useful":0,"cool":0},"hKIUeyPwqpYFW-priOimqw":{"text":"I have to say. This use to be my favorite place years ago but the service and food quality","useful":0,"cool":0},"sif6fPPnhcepjgYM687uqw":{"text":"Service is a bit indifferent, but they have a good drink selection and the food is decent.","useful":0,"cool":0},"3E33Z8x-8t-LTmMgjI-_-A":{"text":"I love this place. Stumbled upon it by accident on a colder evening. Looked warm and frien","useful":3,"cool":2},"duIDiSWF-JagenNzvWzT9g":{"text":"I didn't try the food here but we stopped by for drinks and this is a nice little spot on ","useful":1,"cool":1},"9P5cIoz76kYdXEnON4USKw":{"text":"Hungry after all the festivities in the quarter on Mardi Gras day. They didn't open for fo","useful":4,"cool":3},"C7g7_l-zJ4xPOKURqJ87CA":{"text":"Was expecting a great dinner in the Frenchmen area and left feeling like I wasted a perfec","useful":4,"cool":2},"eUBvUimaB5yXHy-k42HkUA":{"text":"We went there for drinks before we hit Bourbon street during Mardi Gras. They had such ama","useful":1,"cool":0},"HK0nlUljbK1PF0GF_GZ_Yg":{"text":"The starter I orders was divine! I had the crawfish fritters, so I highly recommend anyone","useful":0,"cool":0},"Hx__exGe9SDt0BckhPqisQ":{"text":"The Marigny Brasserie is a nice space that features live music and reasonably good food an","useful":3,"cool":4},"KpBJ1_ncapo0zgEmCelVgQ":{"text":"We found ourselves walking up/down Frenchmen Street Corridor when the sound pouring out of","useful":3,"cool":1},"3sfsYFj_hJ53oXPmscm1uA":{"text":"We came here for dinner and jazz with intent to experience Frenchmen's Street. I ordered t","useful":1,"cool":2},"dErxZFbdb1qoNN4dyQ_x6Q":{"text":"I went for Happy hour drinks... They have a great wine menu and cocktail menu as well. \n\nT","useful":2,"cool":1}}