{"abKghvZEZue9xTHBRpZFAw":{"text":"Again for those that see my review I only give 5 stars after multiple trips.   This local ","useful":1,"cool":0},"xZqWU7ozR38ziDe8qMWWBA":{"text":"There was a hair in my girlfriends rice. Staff is really nice, food is mediocre. We just w","useful":1,"cool":0},"cdhfi2lSFnocJwun_3qZEw":{"text":"I love this place. I've started coming here once a week when my craving for bún gets too s","useful":0,"cool":0},"00n7AuDDL8Ft3gyNdUTtvQ":{"text":"After spending the better part of a week indulging in gluttony, New Orleans-style, we were","useful":3,"cool":0},"oLt_feeV4x6KwgXtBQpRiQ":{"text":"So yummy! Spicy tofu banh mi rocks, along with the rainbow spring rolls. Service can be a ","useful":0,"cool":0},"Kb-rmLsvm2C735kXKLh7Dg":{"text":"I doubted I could find flavorful pho in New Orleans, but boy was I wrong. The beef pho bro","useful":10,"cool":0},"fv7_i3OKfymfwuJdLDgqXQ":{"text":"This place quite simply has the best pho I've ever tasted, and I have had it all over the ","useful":1,"cool":0},"sU2_9Maj2Kve_3t2b3pimA":{"text":"The Pho Ga here is excellent best I've had outside of Vietnam.  The service is not so grea","useful":0,"cool":0},"vOWWuQbY1lMxe7OEClOj2g":{"text":"3.5 stars\n\nSome people have no clue how to eat Vietnamese food.  Lilly's is packed for lun","useful":1,"cool":2},"SbSl7FWHGWmrZayQ1i9A2A":{"text":"So disappointed...pho broth was just ok and they really skimped out on the beef brisket. M","useful":1,"cool":0},"ffHGFqoYCYXsQ9_xiI1Qyw":{"text":"Great and authentic Vietnamese food in lower garden district. Delicious vegan pho and many","useful":1,"cool":1},"YRa0GsJw5qJ0URGGWTE_bw":{"text":"Very friendly, prompt, and attentive service. So far I've only tried the tofu bahn mi & th","useful":0,"cool":0},"lMXLq3JtN0bVDjS4AgYhJQ":{"text":"Best pho place in town! Their food was delicious and customer service was excellent. I jus","useful":0,"cool":0},"3jSeQQBafwx6PpsIcJSFpw":{"text":"I went to Lilly's recently with my daughter and had lunch. Generally when I do Vietnamese ","useful":2,"cool":1},"8nlMO4N0mSVF48Dl6c2TPA":{"text":"This was our first time eating there. My sons and I enjoyed our meal. Quick and friendly s","useful":0,"cool":0},"dZIVPDtmX1kIIFI9kyElng":{"text":"Fast and attentive service! Delicious spring rolls, house made strawberry lemonade, pho, b","useful":1,"cool":1},"mYhqSHRE5E2SceP_QEXpnw":{"text":"This place is overrated. 4.5 stars on yelp should say something about this place. Went her","useful":0,"cool":0},"e6GcpV0fayLCby6ZkPzuFg":{"text":"Yum! Always great service. At first they seemed to be upset that I wanted a fork for the v","useful":3,"cool":2},"8oMnBu-dX7D9IQM6m-iKbg":{"text":"Delicious Vietnamese food- simple but ample menu- even as a vegan I am spoilt for choice w","useful":2,"cool":2},"I2cg7U78c9gOcGvWuZ_fjg":{"text":"Delicious pho for when you're tired of eating po boys and fried oysters. The broth is deli","useful":0,"cool":0},"WCcwcpDNSvrjKEcRqzAkAA":{"text":"The pho here is magical. It is definitely the best tasting base soup I've had in pho in th","useful":0,"cool":0},"5G6a8WKLqBapjkP_x6Iw1Q":{"text":"Since the departure of Pho Tau Bay I've been at a lost for a good Pho and Báhn Mi. Lily's ","useful":2,"cool":0},"7ImgwF2zs4AslXnntV9Vuw":{"text":"Service here is good and very attentive. They gave me input on what was good and what was ","useful":0,"cool":0},"rttQNm_LrcqCRecji4RKMg":{"text":"Fantastic space, fresh ingredients, delightful service. Loved it.","useful":1,"cool":1},"L0A499AoqyCY4d6x7w39OQ":{"text":"quick stop before we head back to Nashville, Tennessee ... Very good and authentic! So ple","useful":0,"cool":1},"Xi2Od-IGlbOs7rLVnxRfIQ":{"text":"I wrote a review on this place before about how the pho soup tasted inauthentic and very w","useful":2,"cool":0},"VdoN_6rpnnpDFiF1Q9KEdA":{"text":"Wonderful and even better service. A rare gem to find. The owner even came out and spoke t","useful":0,"cool":0},"YLDjR8C5fgpAMBfwrgdCcQ":{"text":"What a great restaurant! There are few things in life that I enjoy more than hot vegan sou","useful":2,"cool":0},"gfFkddZgLgoqbu-8OujyjQ":{"text":"Every time I crave Vietnamese food, this is my go to place!  I hate that they're closed on","useful":1,"cool":0},"pnA8yxQy667hQTgo4UX9xg":{"text":"The pho is EXCELLENT and so is the service...but it's not the tidiest place in town.  The ","useful":0,"cool":0},"QO1UNubdf7CHYGxNw7Jgpg":{"text":"Lilly's Café doesn't need my four star review because the place is always packed with happ","useful":0,"cool":0},"ogp9CF4aiTs_PZd-jhL4xg":{"text":"With a fresh aroma hitting as soon as you walk in the door, this cozy neighborhood joint i","useful":0,"cool":0},"FPr1gSFiPg1jkmZ6-KXdVg":{"text":"The staff was extremely nice, the service superb and fast!  Was visiting and got a bit sic","useful":1,"cool":1},"CtxwU0Pos6uIVbCA4IcYUA":{"text":"Good pho great Rangoon overall I wool go back and recommend. Service was  lacking but adeq","useful":0,"cool":0},"6UNt2HPA5U4axvwOpIpiAQ":{"text":"normally, i do not like vietnamese/chinese/asian food.  but this place is AWESOME!!!!  fab","useful":1,"cool":0},"E0kDL50CW0jYB4YG6-lnKQ":{"text":"Love this little Cafe'. The food is fresh, the staff is friendly, the bathrooms are clean!","useful":0,"cool":0},"deE8bWxiwcdauts9Xb0Zjg":{"text":"Not only was the service friendly, accommodating and prompt... Not only was this probably ","useful":1,"cool":0},"IJSWwvRXRN3YWXexCuMiIQ":{"text":"Toooo expensive! 12.00 for a drink and a bowl of vegetable soup. At least serve dessert wi","useful":0,"cool":0},"2algww9825hSB3g_16q9ag":{"text":"Why have I not eaten here sooner? Oh yeah, cause the last couple of times I did make it ov","useful":1,"cool":0},"fBmQqP6m6hoIrO6KeX7lrQ":{"text":"The pho is actually great. I took my parents here and they approved too. The broth is not ","useful":0,"cool":0},"PdlOFVgRJe6KBjhxKGgUmg":{"text":"Going to have to settle on 3 stars as it was fresh and pretty good but didn't blow me away","useful":0,"cool":0},"iYE1Hp0BygGsogxtxj0Udw":{"text":"Ordered the spring roll and pho combo. \n\nSpring roll was pretty good. Ingredients was fres","useful":1,"cool":1},"cdtIHvCf6sjTr_rox74AMA":{"text":"Amazing. All of it was amazing. The pho broth will bring you back to life after drinking u","useful":1,"cool":1},"wQu5JnNHlsZx3WIB8RK1EA":{"text":"Fantastic food!! Just had an egg role as well as I\nLillys roll followed by spicy shrimp ph","useful":0,"cool":0},"ipJvknvVQJ-YvbMMsvX1jQ":{"text":"best vietnamese in new orleans! lilly is also a very nice woman and i'm excited to go back","useful":1,"cool":1},"j5qBhmkbXAhENizGSlampQ":{"text":"Lilly's is my all time favorite Vietnamese restaurant in Nawlins, & I have been to all of ","useful":0,"cool":0},"FStNMrolWMia_eeVDCRYqw":{"text":"This is the second time I've been to Lilly's and it's still amazing. They pump out food at","useful":1,"cool":1},"4B3A7tYNbObycwtTNk55Yg":{"text":"Yum! This is a great spot for folks looking for good and flavorful pho (not the best pho, ","useful":0,"cool":0},"O8ZLIyjxKgpaYEEvs2XmrQ":{"text":"With an abundance of Vietnamese restaurants in the area, this failed to live up to the hyp","useful":1,"cool":0},"WYFYHGZaj85tZ9wixaeROw":{"text":"Had a late lunch at Lilly's today.  The place was pacjed at 2pm ... and after having a mea","useful":0,"cool":0},"9JihYL9ZXUM9xwSB-OwPxQ":{"text":"Our first experience at a Vietnamese restaurant and it was amazing. \n\nYou can taste the fr","useful":1,"cool":1},"KumNWzx9AjrswSArJxF2bg":{"text":"Super great food, nice family owned staff, multiple fresh options( fresh seafood, vegetari","useful":1,"cool":1},"0ZghbgZVNKr-qYwhGxKxCg":{"text":"Lilly's is by far my favorite Vietnamese place in New Orleans. Not only is the family so s","useful":3,"cool":2},"tHqNzhiJy_O1PJxunFXbpg":{"text":"Woohoo, this place is killing it! Amazing bun with lots of HUGE shrimp, perfect dressing, ","useful":1,"cool":0},"7xJ9iXq4FMh_DPUUlAzEnA":{"text":"The food is so good. I eat Vietnamese food all the time in Atlanta.  This place is fresh, ","useful":1,"cool":0},"cg8F7sWzUur8kKmxMq9PuA":{"text":"Best pho ever. Amazing staff and lily is a wonderful host. Also enjoyed there Vietnamese i","useful":0,"cool":1},"MFOkT7oTK0H64y1QbGsaug":{"text":"I'm not normally a big fan of pho, mainly due to it not being very authentic in the US, bu","useful":0,"cool":0},"IhEdKm4xq-t5vuZVPUz3ew":{"text":"I do not like Eastbank Vietnamese pho. Nope. I like the real stuff.\n\nSo when I was starvin","useful":10,"cool":5},"r11QaVxT3bEtWMvJWHPSUA":{"text":"I went here with a couple of people and I thought the food is great but it wasn't.  I noti","useful":0,"cool":0},"8qDmnHLaPplLFroRty5YuA":{"text":"I am from Houston and used to really delicious Viet food. Lilly's is ok. The place is nice","useful":1,"cool":0},"t2w5_TGcc85NaM8dRR9iSw":{"text":"Consistently great food and service!! Food for pick up never takes longer than they say an","useful":0,"cool":1},"6CLahYdq4LSAiq-EP8kStQ":{"text":"After our Garden district tour we decided to walk to Lilly's cafe for lunch around 2 pm. T","useful":1,"cool":1},"sBbL10KIs_DHsHA-yn_KsQ":{"text":"This place is so legit. Their pho is the best I've had in a long time. A lot of other plac","useful":3,"cool":3},"Xas9-wYZFoXEBZI6fXUt4Q":{"text":"Delicious!  Super fresh dishes and nice staff. Can't say enough good things about this pla","useful":0,"cool":0},"x9K0aKyWyyfbyqORqwfeYA":{"text":"I'm still new to Vietnamese food, but from what I know, Lilly's was a nice off the beaten ","useful":1,"cool":1},"iI8s9Y6rx6BAlldMWb9PSA":{"text":"Decided to go with the top Yelp reviewed Vietnamese restaurant in New Orleans. Which ended","useful":5,"cool":2},"F9qIbl1XjHHGzhcA9QKJJg":{"text":"I absolutely ADORE this place  I did a sister trip to New Orleans and needless to say spen","useful":1,"cool":1},"xa3IOB_yGTG8hiGzYgqJTg":{"text":"Great pho tai, tofu bun dishes.  Vegan and pork spring rolls are perfect.  Tofu spring rol","useful":0,"cool":0},"YQJC_X_BRjugfVhfQOfIGg":{"text":"I love Lilly's!! Her Pho Ga with vegan broth is a heaven sent whether you're sick or just ","useful":0,"cool":0},"kWWhJOVonb6gtQS7qGvc8A":{"text":"I'm obligated to leave a five star review because the beef bahn mi was the best I've ever ","useful":0,"cool":0},"OZG0sv1c7Er-7epJKFTrVw":{"text":"Series of unfortunate events occurred during our visit to this establishment.  I read from","useful":4,"cool":0},"rVLG8UegoE1vL_sl3FbjHw":{"text":"And the veggie pho is delicious...in case you were wondering, as is the spicy tofu appetiz","useful":10,"cool":6},"klp1NbiT2qDxKu3NeoSg9Q":{"text":"Had a Vietnamese roll and it was really worth the money!! Great service, really attentive ","useful":0,"cool":0},"S822s8qDOu241k_ynjMcfw":{"text":"Great atmosphere in the Garden District.  Service was exceptional.  Food is phenomenal!","useful":0,"cool":1},"JZ_AeWGaO8rBLmvs1OT6dw":{"text":"I love it here.\nService is always INCREDIBLE. The food is always AMAZING.\n\nGo for the beef","useful":2,"cool":2},"slMhPalyRXg98NM0VLf6-g":{"text":"I eat Pho all the time, and it is by far the best Pho I've ever had. Lilly is a sweetheart","useful":0,"cool":0},"X8f_wqGygtrCz6fLJMPQ-g":{"text":"Very good Pho and a nice quiet, but busy, place.  Could be a little more prompt with drink","useful":0,"cool":0},"XHLZccCuUzDCwOO9loCzsA":{"text":"Just stopped here for some lunch.  Everyone there was very friendly and the food came out ","useful":1,"cool":1},"Ow9LtEkPObGHmffljAEoOg":{"text":"This is probably the best pho I've had since I was actually in Vietnam. The service was go","useful":1,"cool":1},"3UdQzA1bRBCJAYPsnA_asA":{"text":"The grass isn't always greener on the other side. I decided to try out Lilly's since its i","useful":1,"cool":0},"wRnR0OCxbJySw6ERECR8Iw":{"text":"I had the bun with grilled pork. It was AMAZING!! The owner actually came to our table to ","useful":0,"cool":0},"ThYkITiNuYB7qi8KrC9cdg":{"text":"The food is absolutely amazing, and the staff are very friendly. I would give them five st","useful":2,"cool":1},"4Gq0YiHa_QLrY5B52ND1ew":{"text":"I've only been there a handful of times but Really enjoyed the iced coffee, egg rolls, pho","useful":0,"cool":0},"t94nZePZEN-jyzYey4IaVA":{"text":"Very tasty pho and friendly staff! I will be sure to eat at Lilly's again when I return to","useful":1,"cool":1},"pSH2GoeTtCFFbk4QeV3TyQ":{"text":"The best Vietnamese restaurant around - with the best bahn mi possible.  The bahn mi are h","useful":3,"cool":2},"RPMaaFQ1qi3lTCxxDmJ7NQ":{"text":"Great experience! Food was yummy and staff was so friendly and fun. Best Uptown Vietnamese","useful":0,"cool":0},"yPgLVPXYN34kV3RPwRlCtA":{"text":"I can't believe I never wrote a review for this place! I recently moved away from NOLA but","useful":4,"cool":3},"4jjNO1Ly3ovgHnhbjZfakg":{"text":"The Shrimp Pho was solid, if not a bit bland, but the clean restaurant , efficient service","useful":2,"cool":2},"sttvue2hz_t0Tc7gmiAaVg":{"text":"Disappointed.  Was looking forward to an authentic Vietnamese meal after a week of eating ","useful":0,"cool":0},"m29TijlHrVm2cyoAilnZpg":{"text":"I had to stop by this place for Viet food. I was told that NOLA has a pretty large Viet po","useful":6,"cool":0},"LIuONLWzfQa0aCtLTRY9tw":{"text":"Love this place.....I order take-out at least once or twice a week!  Pho Ga is the best in","useful":0,"cool":0},"OMcU3RRx9-QxKw4HzYpNzA":{"text":"We have always loved the banh mi sandwiches here but our experience this weekend was disap","useful":1,"cool":0},"qui-0T3ppvRo9KAAi0Zj2Q":{"text":"Lilly's cafe is amazing! The service is super warm and extremely fast, and the food is del","useful":1,"cool":1},"Awerb6pEmFLB-eW0oLmEiA":{"text":"Veggie spring rolls with a delicious peanut sauce,  followed by a Beef banh mi that was al","useful":1,"cool":1},"KBgCy8ReqjqlSKeODy3u3A":{"text":"This is my go-to Vietnamese restaurant!  Their shrimp spring rolls are the best around, an","useful":1,"cool":1},"ieJVCgCUGGLEl0iQhLcA2g":{"text":"On our last day in Nola we were dying to eat anything other than the usual fare in the cit","useful":0,"cool":0},"GsCBilTDiD9WL8ImPOf9Yg":{"text":"So good! We had rainbow spring rolls (tofu, avocado, vermicelli noodles, strawberries, let","useful":1,"cool":1},"HbG9knvaxoVVtTqRFz2FKw":{"text":"Amazing chicken pho noddle soup! The best in town! Love the shrimp fresh rolls with the pe","useful":0,"cool":0},"kBf-t_B1iYJtXFoM7_4TNA":{"text":"Great pho.  We'll be back.  My father in law would like brown rice as an option but otherw","useful":0,"cool":0},"l4fqbp7m0IC_D8DJcCLpjA":{"text":"Awesome alternative to Cajun creole food went to jazz fest needed a break from all the gre","useful":1,"cool":1},"23ZYamwoUaElYJ7EGQ_R0A":{"text":"Delicious food and generous portions!! Definitely authentic and worth the trip out of the ","useful":0,"cool":0},"YpHrW1WWvX_9dBYwp-lytg":{"text":"Only tried one other Pho place in the city that was all but forgettable so i am thrilled t","useful":0,"cool":0},"B1mGqHX0ZZBT8qghoUQMOQ":{"text":"Lilly's Cafe is absolutely amazing! If you've never tried Vietnamese food I would highly s","useful":2,"cool":1},"wVGvf20I8ivw42hiORENZA":{"text":"It is really difficult to find a veggie pho that has a flavorful broth but at Lilly's they","useful":1,"cool":1},"lfzKxy4Y3gMjuDfkqZX8Xw":{"text":"Ate there a while ago, can't remember what I got but it was something vegetarian and delic","useful":0,"cool":0},"oMovKHUJnHBbb5c16dOT2Q":{"text":"Kind of feel silly writing this as everyone in the neighborhood knows they are a gem, best","useful":1,"cool":1},"d88kG4yOpnURFoFVsKZQbQ":{"text":"Great atmosphere! Totally acceptable Vietnamese , but not traditional ! My only complaint ","useful":0,"cool":0},"AvRPGhhcr6a-eI4fz68VmQ":{"text":"This is a super cute, pretty small cafe with insanely fast and friendly service, the best ","useful":1,"cool":1},"SWdw-d8t9dk531E-4jAFKg":{"text":"I would give 3 1/2 stars but will round up because of price.\n\nTried going back to Pho Noi ","useful":2,"cool":0},"t5kR2KJm0jvmHv68P74tZw":{"text":"The only thing I don't like about Lilly's Cafe is that they aren't open on Sundays, which ","useful":1,"cool":0},"uZwsL0VB4kCglGJvlWyeoQ":{"text":"We were very excited to have a bowl of pho during our trip in New Orleans. We walked from ","useful":1,"cool":0},"-t2MJzQfmJnwGdjrT9Uoaw":{"text":"Delicious and nutritious! I usually stick around the rice with chicken or beef plates (w/e","useful":0,"cool":0},"Qz3guJqFGe-_75lPOKb1fw":{"text":"My favorite place for pho in all of Uptown. I enjoy walking here and getting the spring ro","useful":0,"cool":0},"oQdBUWPFGiHgTgd_FDXSaw":{"text":"I am by no means a pho expert.. or a pho snob. I know what I like, I'm pretty easy to plea","useful":4,"cool":0},"V76mrLUgMyE0wZn8V8JBkw":{"text":"I come here at least once a week on my lunch break, and have yet to have anything less tha","useful":1,"cool":1},"srvWKg1fELWGYr4dxr3-nQ":{"text":"I LOVE this place. My favorite place for pho. I try to go at least twice a week.","useful":2,"cool":0},"VwY_oAuO-gF9K9dECdrtFA":{"text":"Lilly's has delicious food and fast, no-nonsense service. \nI kept hearing about the great ","useful":1,"cool":1},"gOecbITQPn5EPOJKnWqcNQ":{"text":"Lilly's is hands down the best Pho on this side of the river. I love Lilly herself, always","useful":0,"cool":0},"KZYnBfMmorKeDxkZOhs5Cg":{"text":"We asked the hotel concierge for some recommendations on good Vietnamese food in the area ","useful":0,"cool":0},"t8PSCkWDoLjlcjilF654yA":{"text":"I'm calling it. I think that Lilly's is my favorite Pho that I have had in New Orleans so ","useful":4,"cool":1},"wiJKAuSPO-2BfCHZLU2vBw":{"text":"Not too busy for a Saturday night. A smaller sized menu with lots of protein options. Pho ","useful":1,"cool":0},"5GXs_ohR1n5C-8r1zkAHnA":{"text":"Best freakin' vegetarian Pho ever! Service was great and the food came out fast. I was als","useful":1,"cool":0},"FGnA2ROmDW26Uv_z9RE9iA":{"text":"Pho broth tastes fine, on par with other places. However, the grilled pork lacked any flav","useful":0,"cool":0},"trc64j8FgrhvSwqCK7YI2Q":{"text":"Authentic Vietnamese food! Got the seal of approval from the BF who is Vietnamese. \n\nWe la","useful":2,"cool":1},"IH-DRsoZI8JhyGyzta-Ijg":{"text":"This is my fiancé and I's favorite Vietnamese place!!! The service is great, they are very","useful":1,"cool":1},"r8uuHRtqple_tMCeTVl0MA":{"text":"My husband and I relocated to Brooklyn, NY after Hurricane Katrina but come home at least ","useful":1,"cool":1},"ZqxsZwUhMqZx8Cwe8ltnYw":{"text":"This place is so yummy!  Try the pho and the spring rolls,  also the vegan eggrolls are ve","useful":0,"cool":0},"ocsyAuAIwnVtGt73hPPv4A":{"text":"I was feeling a little under the weather, and the Spicy Shrimp Pho here helped revive me! ","useful":1,"cool":1},"QOUHFNxPof7hUkEuYKXpaA":{"text":"Their Banh mi are tasty and juicy. Great for lunch! I also already had pho which has a goo","useful":1,"cool":1},"C0cPT-kexzuzRrirIkGaDw":{"text":"Lilly's has the best Vietnamese food I've had.  It is excellent.  The vegetables are fresh","useful":2,"cool":0},"9Pb1DXdl8LgKYro411g0Vg":{"text":"Great service great food very inviting staff and the atmosphere was fun. Stop in and try t","useful":0,"cool":0},"m3IyiiRs6pL4_p84CvB36A":{"text":"Awesome food. Efficient and very friendly service. Very pleased, I highly recommend specif","useful":0,"cool":0},"brhhhHgY4vy7Aab1sMefzg":{"text":"Favorite Vietnamese in the city. Garlic tofu bun is the best! The owner, Lilly, is such a ","useful":1,"cool":1},"dsvJy-BY0QB0ZKCfMFHE6w":{"text":"It was a hot and humid evening so my friend and I decided to order Vermicelli with Egg rol","useful":0,"cool":1},"PjcwEOKbDg1UnemZK85TJQ":{"text":"What an experience! After eating Cajun food all week long while traveling in NOLA, this Vi","useful":1,"cool":0},"AUzltBl_13ovPe-7pGXkUw":{"text":"I come from NYC, where Vietnamese food is super cheap and the menus have 400 dishes on the","useful":0,"cool":0},"U6YWUGVdF7UhnpL3oo04Dw":{"text":"My friend and I wanted to try this place because of all the awesome reviews. We walked in ","useful":0,"cool":0},"G7uvQ_TDX3O12ogv1y2BdA":{"text":"I went with a group of 7 and we did not have to wait long to get a table.  We had pho and ","useful":1,"cool":1},"lXMwwjySzyzmA5S-4czBgg":{"text":"Very finest food quality and price. Lilly is a fantastic and caring host. Portions are gra","useful":0,"cool":0},"A6SVvxkKQ1NEdA7JPqrCbQ":{"text":"Great pho! The lilly rolls and crab rangoon were not impressive, though. Fast service and ","useful":0,"cool":0},"bxxNwnYiVat3e77lcilxHw":{"text":"The chicken salad I had reminded me of the very best vietnamese chicken salad I ate, in a ","useful":1,"cool":1},"u6wYqYb1kECFdjc0GEsiJw":{"text":"Great Buns, I recommend getting the grilled pork with egg sunny side up with steamed veggi","useful":0,"cool":0},"Qm1iqMgRtMcXuWD94LIOtw":{"text":"What a gem!  It's super clean, decor is very nice, the waitstaff is very attentive and the","useful":0,"cool":0},"Ir4RyfVzjgIBNKt8Ljy3kQ":{"text":"Went there during my stay in New Orleans, the staff is super friendly and the food was rea","useful":1,"cool":1},"4ZqC75K6hCyrhAxFtXPuLg":{"text":"The best pho I have had in a while. The broth is what makes it the best. We wanted to try ","useful":0,"cool":0},"quIfRRFLl4iMrNVWOrOeuQ":{"text":"As we all know NOLA is famous for its unique cuisine. We have been here for a week and the","useful":1,"cool":1},"oumWJr1Co3DlZZl02Fdwkg":{"text":"The food is delicious, so far the best Pho I have had in the New Orleans area. Full of veg","useful":0,"cool":0},"Nb2gns2qWy0GJOtfIBzOYA":{"text":"If you're in the area and looking for Vietnamese food, just come here. \n\nGreat location. W","useful":1,"cool":2},"P7lPrJJzmAC5axfh5DCWWQ":{"text":"their pho ga is pretty good. their beef pho is average. \ncan't comment on anything else bu","useful":1,"cool":1},"OPrCbOBrwCOOtGkyDQCoqQ":{"text":"Place seemed nice food was ok but didn't realize how cheap and stingie they are. Got a Tog","useful":1,"cool":0},"pjGyjJdfJO45RWKdKWwv-Q":{"text":"Delicious pho! Great service and a wonderful staff. Their spicy tofu is SO good, it might ","useful":0,"cool":0},"Mf2SbjMBKtniWb2uGH7j4w":{"text":"I tried their spicy shrimp vermicelli, which was pretty darn good. Would've loved a larger","useful":0,"cool":0},"qDr5wfrU_QpGyto6E3vsAw":{"text":"Delightfully delicious and a place I keep coming back to. Best kept Vietnamese restaurant ","useful":0,"cool":0},"bNiJ_f2m5ztoRKF7io8CSw":{"text":"I'm actually finishing up my pedi as I write this. This place is great. Clean, hygienic, a","useful":1,"cool":0},"PlTtVZTC1xw5Stw1gtWg8g":{"text":"Best pho in the general uptown area. Amazing service, great location. Got flank and briske","useful":0,"cool":0},"cG-eNtWDsB-8uUdB8rQZtA":{"text":"Food is great .... Made me a convert to Pho. Service is an issue though, you can tell the ","useful":1,"cool":1},"LM1cyIJlkZp-qhm-s6If7w":{"text":"At last my prayers for good quality Pho nearby were answered!\nThis is my new go to place f","useful":2,"cool":2},"FVS4VuM5VZmae38KEvjXkw":{"text":"Wow! What a gem! Wonderful food, nice cheery atmosphere and really, really nice staff. Veg","useful":0,"cool":0},"mF1qWzDkN-oXG78rx0z9mQ":{"text":"My friends and I randomly picked this place based on a yelp search because we needed a bre","useful":0,"cool":0},"OF4rJI_7US-lop1XVHrEIQ":{"text":"This place is great! Really clean, authentic Vietnamese food at exceptionally affordable p","useful":1,"cool":1},"G1BkZRLXdDKKUiOLC0kegg":{"text":"Cute little place on the edge of Uptown.  Looks inviting from outside, and friendly people","useful":1,"cool":1},"qO6qdqY0a_Y0Zh3_feW8fQ":{"text":"Trust me, I'm fat. This place is good. The Pho is... well.. pho rull.\n\nAll joking aside it","useful":0,"cool":0},"Gp4sxHqizlVu4OoxDkY-uw":{"text":"The pho is very good, but not the best I've ever had, and a little spicier than I'm used t","useful":2,"cool":1},"AOzmH-fsWwwz8YCqCAKQdw":{"text":"When you walk in your senses are immediately accosted by an overpowering smell of mothball","useful":0,"cool":0},"-O2N43-vkcb2ee_2-dVFvA":{"text":"I'm a big fan of this cuisine.  This is the first visit for this place and it definitely w","useful":2,"cool":2},"6__4QW9ycfp6MPWgmZE90A":{"text":"NOLA needs to have more pho places considering a hot warm bowl of noodle soup is the ultim","useful":1,"cool":0},"q6ur6uECfqfLNri7_HvQAw":{"text":"If you're in the uptown area and you're craving some pho or anything even remotely Vietnam","useful":1,"cool":0},"UH4WOXgKkqxeLc3Q6Y-uAg":{"text":"Lily's is fab. I go here for lunch at least once a week. The menu is small and saturated w","useful":0,"cool":0},"ZT0A_1ABABf66AtZtYnwNA":{"text":"So excited to have this neighborhood gem nearby. It's a great place for a quick and delici","useful":0,"cool":0},"XmFtOn2tWPvOPoY1pFwvOQ":{"text":"Was in new Orleans for mardi gras and was craving for Asian food. After driving to 3 diffe","useful":0,"cool":0},"j7WbVU8iNFSz8rNMJjSTlw":{"text":"Little restaurant with authentic food. I usually don't order pho at restaurants because mo","useful":0,"cool":0},"7mvVeBFpsAsxu7zgAoLuNw":{"text":"Not really sure how this place has 4.5 stars on Yelp.  The service is not great, and neith","useful":3,"cool":0},"6ieTke8bwt5jdJBR-sIQfg":{"text":"In New Orleans for a few days and wanted to try some of the local vietnese food. Lilly's l","useful":0,"cool":0},"HrfWlKEba1pGhn8CRfq0zA":{"text":"A nice change of pace restaurant in a rich food town.  I had my first visit to NOLA last M","useful":0,"cool":1},"3pwcVR3hpVzlvgZ6a93TKw":{"text":"My favorite Pho in the city! I love that they have vegan options! :)","useful":0,"cool":0},"1Gu3jK5fA29TGbpA930wJg":{"text":"I'll admit, I was standoffish and would never have gone here if I wasn't meeting friends i","useful":1,"cool":1},"FekDcVYN6qiUgulkK1Bwcw":{"text":"Awesome!! Everything we got tasted soooo good. From the tofu to the bahmi... YUMMY! Highly","useful":1,"cool":1},"iAyS4RWX8aOXb5aA6BihOQ":{"text":"Best Viêt in New Orleans I have had so far ! Spring rolls are really good. The beef one is","useful":0,"cool":0},"Hk_X2fsbc3JAOAdb8YYx2Q":{"text":"Delicious vegetable tofu pho, tofu was grilled which is nice, though thinly sliced which I","useful":0,"cool":0},"H1vGAnNKf1Y3TFWeZctqDQ":{"text":"Seriously, the best Vietnamese food I've eaten in the states. And Lilly is a great host!  ","useful":0,"cool":1},"YysCZK0y0ZmOA3euwpVNPg":{"text":"Oh man. So bad.\nHere's what went wrong:\nNo sign or other direction indicating that we shou","useful":3,"cool":1},"TodkhJnUCFJa1pUOZ0hDsw":{"text":"We went by last night around closing time. I will be honest- the food was not appealing. G","useful":0,"cool":0},"MhtfGhiRd4qf8mlTxLLnVA":{"text":"Had lunch at Lilly's yesterday was more than pleasantly surprised. I am a foodie and all a","useful":2,"cool":1},"Xo8EUtqTc3bKgG8oPsg_vw":{"text":"Excellent veggie pho, perfect summer rolls and peanut sauce, and great service at lunchtim","useful":0,"cool":0},"wpHqbA9bqPwP5dC-OdBsJA":{"text":"We eat vietnamese often and found Lillys. The food was well prepared, and tasty, but eh se","useful":0,"cool":0},"4sO_MDwbahXU2r3Mc8_jjA":{"text":"It's all good! The best, freshest Vietnamese food in New Orleans with excellent service an","useful":0,"cool":0},"lFq0Jh_uret6ggTWN7zo9g":{"text":"Best pho I've had in New Orleans, Las Vegas or Los Angeles! \n\nSmall spot right on Magazine","useful":1,"cool":0},"qoWp61pmfIfaxdwQP2oFTA":{"text":"- have sinuses so went to get the spicy shrimp Pho last night\n- i don't know what is in th","useful":1,"cool":1},"uOHsrCkDlT13kLJ1aPO2tw":{"text":"I really like this place!\n\nI stopped by on a sweaty afternoon to get out of the heat - and","useful":1,"cool":1},"4YgQKFKGzgH7Be5LDMCkoQ":{"text":"Order lunch here at least once or twice a week.  Totally addicted to their PHO.","useful":1,"cool":1},"ezHj-kJ6iXnbDV86LjI3FA":{"text":"I went to this place solely on the Yelp reviews and I was not impressed. \n\nWife and I shar","useful":5,"cool":2},"BQ3vitA-kObQiBnksHECpA":{"text":"Amazing food, great service, nice people and nice decor! What more could you want?\n\nLove t","useful":1,"cool":1},"jg7MgS6c2avLRlz9YB0dUA":{"text":"Brilliant, being a vegetarian it's hard to get a good veg meal with taste and spice, this ","useful":1,"cool":1},"LXwz2kMBa70JOXXtEyRUVw":{"text":"This is the best pho I've ever had. I'm usually pretty indifferent about pho and thought m","useful":1,"cool":1},"5mdvykzf4uQcg4JtA45nKQ":{"text":"Lilly's is actually the best Vietnamese option in east river New Orleans. Please diversify","useful":0,"cool":0},"I_UcqhYlyC_sHdM-T1WeiA":{"text":"I debated whether to give Lilly's four stars or three. I think the food is a solid four bu","useful":1,"cool":0},"TkBRBuVdQvrs5D66UIuXtg":{"text":"When I'm not feeling well I come to Lilly's for their pho.  This means I get it to-go so I","useful":1,"cool":1},"oOWl8HZg_GbQIRL6fnURlQ":{"text":"I'm late but this place is the best.\nLily is the greatest hostess- the food is comfort foo","useful":2,"cool":0},"Y3r7uXjbYrSy7cwwzHB7bQ":{"text":"I cannot say enough nice things about Lilly's Cafe. The food is delicious and I wish I cou","useful":1,"cool":3},"m752PCy3t3Bo6wvKcwC9GQ":{"text":"Got the rice with grilled pork. It was not good. Pork was dry and it was not freshly grill","useful":0,"cool":0},"NuHafWVK_05GlDlf98XPeQ":{"text":"relaxing, family Vietnamese restaurant.  Fresh and well-trpared selections with generous p","useful":0,"cool":0},"fiEQjD_LKv_pOabWXsbsCg":{"text":"The spring rolls are delightful and the pho is sublime. Absolutely fantastic!","useful":0,"cool":0},"zz6KqYJo2QQHXOl_xUijpQ":{"text":"Great service, cute place, good food.\n\nVegan Pho!","useful":0,"cool":0},"JVJjUw4vs46fBAhyobcjnw":{"text":"I adore Lilly's!  It is delicious, quick, and close to my apartment.  I'm warmly greeted a","useful":5,"cool":3},"P1RY-fVh8KLp9o1wqRCY3w":{"text":"Best pho I have ever had. First time I have NOT added any extras to my bowl. The broth was","useful":0,"cool":0},"CNuVs1bGaxanL86BEgYSZw":{"text":"While in NOLA for Super Bowl we ate here.  The Pho was amazing!  My  friend is a vegetaria","useful":0,"cool":0},"Ug-VpgetH0p9d4NM1Ulx8A":{"text":"Walked from the CBD to this great neighborhood specifically to try Lilly's and was not dis","useful":1,"cool":1},"O4fSr5HY6EL6mXyWq0qA3g":{"text":"I read reviews of the place on Yelp.  We must be talking about different places. The food ","useful":1,"cool":1},"Fj6Fs0l0FfAxwax0sXyaug":{"text":"So good and very authentic Vietnamese food. I tried the garlic tofu and avocado- shrimp sa","useful":0,"cool":0},"Ra9NVDIX5Y6C4MIJuD4e_g":{"text":"This spot has been around for about a year and has already transformed from a modest pho s","useful":0,"cool":0},"dg0vqFD9gpA7GcJaXo0_bQ":{"text":"So. I wrote a bad review. The gist was that it was busy and mistakes were made.\n\nI then go","useful":6,"cool":2},"wSJjwB3OymEhKprNoefrJA":{"text":"If you are a fan of Asian food.  If you are looking for something other than the touristy,","useful":2,"cool":0},"sYnJ8vVFXkJghrpZvB8rVQ":{"text":"Lilly is a lovely host, conscientious and thoughtful, and the food is first rate. Our larg","useful":0,"cool":1},"B5pPjoipgy42MvTyHOZkwQ":{"text":"Been craving for pho and this place hit the spot. Broth is light yet flavorful. We also go","useful":1,"cool":1},"S9YIm7DUTficEEhXg8e7ew":{"text":"The Phô was great and so was the small restaurant's atmosphere, but we received very littl","useful":0,"cool":0},"P3iYuH0vRg7kQ58Dh_JBag":{"text":"My favorite place on planet Earth.  Everything I've tried is damn good, but the chicken ph","useful":0,"cool":1},"GSHA5fDhkGfYAz-2OZAorg":{"text":"New Orleans is known for Pho, and Lilly's is my second favorite Pho spot. Great, authentic","useful":0,"cool":0},"Uda5CydtH-vKU7YOu2ZV_g":{"text":"Lilly's is one of the only places in town where you can get tofu and it isn't just plain. ","useful":1,"cool":1},"ls6a8a63E1kj8NDanH47rA":{"text":"Very cool and friendly staff. Was there with my friend and we got two decent not too spicy","useful":1,"cool":1},"KuBZz5iGBDPsRaV1c-tenw":{"text":"My first time trying pho and I was impressed.\nI had the combo pho with: flank, brisket and","useful":1,"cool":0},"k24yUiJqtWq6t3IqHYmEJg":{"text":"If your a pho lover and don't feel like driving to the westbank to get your fix, this is y","useful":0,"cool":0},"Z5dbJHPomqmUl54_04RRwA":{"text":"My girlfriend and I only ate here because Pho Noi Viet down the block is closed Mondays.  ","useful":1,"cool":0},"N9aZ0I2qclp-PQhzvRlu2g":{"text":"Hands down my favorite restaurant in New Orleans. I've been coming here for five years and","useful":1,"cool":1},"8cu9B51oQUayNku8ruMGIw":{"text":"Had a late lunch at Lilly's today.  The place was packed at 2pm ... and after having a mea","useful":2,"cool":1},"kWT6b_OxLvXI70KUdXHhwA":{"text":"Ok this is not exactly authentic Vietnamese food but their version is slightly tweaked to ","useful":1,"cool":1},"86sTobHv-EaCt23T1MfK8A":{"text":"So very good and the most consistent food around. Lilly herself is usually there and she i","useful":1,"cool":1},"XJfycrhv0Gz-bndZA_dpXQ":{"text":"This place seems to be a big deal on line. Finally  tried it! It definitely served the pur","useful":2,"cool":1},"UaVvRxAdojA08XyRxXON-w":{"text":"Best Pho out of the two places in the LGD.  Nice people, immaculate bathroom, and fresh fr","useful":0,"cool":0},"4gWXpcRAALN7tWgv085EPA":{"text":"I love Lilly's. It is my go-to Vietnamese spot uptown. But I have had a series of bad expe","useful":3,"cool":1},"3cZngH1XGZCk7btZ1YiD8g":{"text":"This has become my \"go-to\" place for Vietnamese food.  All of it is so good.  My only cave","useful":1,"cool":0},"FkD9YukhFkKhpCNXzX5xqQ":{"text":"I had been in NOLA only for a day but I was already hankering for Asian food. After a quic","useful":0,"cool":0},"81ArPnTc58VyXjj2K0P-fA":{"text":"Delicious. Great food and atmosphere. Wait staff was attentive and accommodating. Kinda pr","useful":0,"cool":0},"k1efOlMsg5YjaX4BnGZ-1g":{"text":"I wish we were local because we would be here all the time. The Pho was tasty and my daugh","useful":0,"cool":1},"ngalt6xoOLGvVh6bFW-ThA":{"text":"Lilly's was quite amazing! Started off with perfectly light strawberry spring rolls and th","useful":0,"cool":0},"cOvW9MCSCXxrhW1A0KDe8g":{"text":"So glad Lilly's is so close to my house! The food is delicious and the owners are very fri","useful":7,"cool":5},"WuaeqOrVF2T7Y8T7L6DfDw":{"text":"Wow. Just wow. *Amazing* pho. Absolutely worth going back to, super cheap (~$11) and full ","useful":0,"cool":0},"ihkjLiPaTRxJb2fRRqtakQ":{"text":"I ordered food to go from here and it was AMAZING. I can't wait to eat there. The staff wa","useful":0,"cool":1},"Yy8Y9sNU_0tyRO5jWhql2g":{"text":"First time customers. The owner informed us that they've only been open for 9 days. Very f","useful":3,"cool":0},"LTG4P5oPio4bXMS8b9EgIQ":{"text":"Cute little Vietnamese cafe on magazine st. So my family and I were visiting New Orleans f","useful":1,"cool":1},"X_0nSH2xzFldgw80fEKfwg":{"text":"We were pretty adamant about the best pho being in New Orleans East but Lilly's proved us ","useful":0,"cool":0},"QqyuyYpLLUw3cavDfy_rxw":{"text":"WonderPHO!!! I'm visiting from California and have had my fair share of Pho. This was deli","useful":1,"cool":1},"bq3q32GSbtc0tRliMnaI3g":{"text":"I live above Lilly's, and it takes a lot of self-control not to just outsource all our coo","useful":6,"cool":5},"GTmXoyVjrnHYqky9Zkx8qQ":{"text":"Small cozy Café,\nVery friendly service,\nVery relaxing atmosphere\n\nWe had the Crab Ragoon, ","useful":0,"cool":1},"7HuXOfVQ_ABDash-iOMVpQ":{"text":"Went to visit Nola for a week, and ate breakfast here almost every day - it's that good. H","useful":0,"cool":0},"GIqyuimJVFQ-0fNsOYo4aQ":{"text":"Just opened so they were waiting on their credit card machine, but the Pho was delicious. ","useful":2,"cool":0},"3vXySjbqeBafHiiky-4qEw":{"text":"Great food, friendly staff, and a relaxing environment. Get ready to eat when step in beca","useful":0,"cool":0},"l7FE6X701sWMJbdh5T521Q":{"text":"I am not sure why this place is so highly rated. A solid place but not really worth going ","useful":5,"cool":0},"clXCrmiYbfORZRVrN-q57w":{"text":"Miss Lilly is a charming lady. I've only ordered take-out (they don't deliver) from here, ","useful":1,"cool":1},"Qxzf3ORs6EfwK6M2X3-v3Q":{"text":"I seriously crave this place and have started a once a week habit. Get the tofu pho with b","useful":0,"cool":0},"wBGBe9uLsOylw4F77Zx08w":{"text":"Lilly's is a charming Vietnamese restaurant at the end of Magazine where the street divide","useful":0,"cool":0},"37pXjk6yXUjtRrEKaInS3Q":{"text":"Not sure what's all the good reviews is about but it was a disappointment. My friend order","useful":5,"cool":0},"JyERzd2dwokG8trb8OZwkQ":{"text":"I absolutely love this place. I am quite a snob when it comes to Vietnamese food and they ","useful":0,"cool":0},"AHCNKYFN9DeYqnBKZ2TTNg":{"text":"Lilly was amazing to my husband and I. My husband woke up sick today and she made the most","useful":0,"cool":0},"uT6Zgl1vDDPit8grDgJjCg":{"text":"Honestly I am disappointed that people are actually coming here for what they think is ama","useful":3,"cool":1},"SSS_qvwnId04TCR6lGlKng":{"text":"Best Pho ever! My sweet friend Vegas brought me some today to help me get through a bout o","useful":1,"cool":1},"eZuwosgbXR_a7_61_03FgQ":{"text":"Quick version: get the pho with brisket (or rare steak) with extra vegetables--it's got a ","useful":0,"cool":0},"H4fC2aetZSi_FoBdJx0TtQ":{"text":"I love love love Lilly's!! Whether I'm looking for an excellent hangover cure or just a de","useful":0,"cool":0},"SHcek_iVfZWcMpWdn79_vQ":{"text":"This is the best Vietnamese restaurant I have ever been to and I live on the West-Bank. I ","useful":5,"cool":2},"V0sCLQtT93Mp2rmC10alLQ":{"text":"We were in town for company meeting and decided to give it a try based on Yelp review. The","useful":1,"cool":1},"rhBFKiMSLriKqpaOpMXUJw":{"text":"Very fresh, tasty, and light. Tried the unique Rainbow Roll with steamed shrimp, avocado, ","useful":0,"cool":0},"LbhqIQRuu3peCZ7Ehiiv4g":{"text":"Best pho ever. I had the spicy shrimp pho, the chicken with quail eggs pho, and the pho co","useful":0,"cool":1},"ep5IzfgPwMjg77tP8WJz8A":{"text":"A fantastic example of Vietnamese cuisine in New Orleans! I am in town for a conference an","useful":2,"cool":3},"-D_aBlY5tipcrgySS_ySEg":{"text":"my favorite spot on this side of the river. get the extra veggies in your pho and don't mi","useful":0,"cool":0},"FFPMLX0B6ewyierrie96sw":{"text":"i'm with Daryl P. on this one - best pho broth i've ever had.  Lilly's spring rolls are un","useful":7,"cool":4},"OuOH1778dNiBuSN0AQeERQ":{"text":"The food was beyond expectations! The staff was so friendly and excited to serve us - we t","useful":1,"cool":0},"wR1tPtSiIQwaXuZjXjjxyg":{"text":"I ordered the Crab Rangoons and Spring Rolls (non-fried rolls). The Spring rolls were a fu","useful":0,"cool":0},"yNu4aUEePI59eh0tuTE1Cg":{"text":"As a tourist to New Orleans, this spot was a welcomed relief from the Creole/Cajun food I'","useful":0,"cool":0},"wnPEZbSOXaqAumV1228yuQ":{"text":"Fresh ingredients and very fast! Lily herself waited on us and her staff is great too.","useful":0,"cool":0},"KfzR7j5rgWiJ6Ky_TVXZxA":{"text":"We enjoyed our family lunch there. The food was really authentic, the service was fast and","useful":0,"cool":0},"KDxw3WOFl59IDsMl1yPQqg":{"text":"Favorite!!! I'm addicted to their spicy shrimp pho and crab rangoons.","useful":0,"cool":0},"I8XnFJKkWFJDrUK3TtiSNA":{"text":"This place is great. Delish pho. Broth is real flavorful. I had the Brisket pho its  .grea","useful":1,"cool":1},"bHTl_3O9tGwVhj01em9KtQ":{"text":"Pho was very good, cute environment and friendly service. Spring rolls were lack luster, t","useful":0,"cool":0},"WjDQMgyHD7mi6QAhvvwlcw":{"text":"Finally had the opportunity to check out this tiny gem in the Lower Garden District! Havin","useful":8,"cool":7},"uilxObQ_BkZIdY-7oKOapA":{"text":"Been wanting to try this place. It's my daughter's favorite. The Pho was very good as was ","useful":3,"cool":0},"ktoCVEEMReFG3Amk3QnD0Q":{"text":"This was the first time I have ever tried Vietnamese food, and I was extremely impressed. ","useful":1,"cool":0},"2Bw5BWImEy5QM0W4uY7LYw":{"text":"In a town that ever resturant is serving the same things , this place is a real treat , tr","useful":0,"cool":1},"cekC37ropqagR7L7AA86zA":{"text":"I love Lilly's that's all I can say the food is fresh, the Bun, Bowls, and Pan are amazing","useful":2,"cool":1},"lPaGaRYKauLQ6XnhOEgixQ":{"text":"Affordable, delicious, and fresh! I would recommend trying the tofu spring rolls because t","useful":1,"cool":1},"c1rFD0n8-zqvaON3LTyGnQ":{"text":"I had lunch here yesterday and loved it!  I asked the waiter what his favorite dish was, a","useful":3,"cool":1},"0brXPrQRpoDPRwAhJUFpPg":{"text":"This a nice, café style Vietnamese restaurant. The ingredients they use are fresh and flav","useful":1,"cool":0},"T5vOfeKGe3C5NUCXR4aJZA":{"text":"Tried Lilly's and Pho for the first time on New Years Day! I really enjoyed the chicken ph","useful":1,"cool":1},"lq_GIh_e6wl-Wtq5xfgPfw":{"text":"Looking for an amazing, delicious and inexpensive Vietnamese option in New Orleans? Look n","useful":0,"cool":0},"HYKD_7qXgZIf4yCwIGvJjg":{"text":"My first time having Pho ever and I got the Spicy Shrimp Pho... it was quick and yummy. I ","useful":0,"cool":0},"6yUWKYKZ3OQ9w-yXO7i8IA":{"text":"Best damn pho I've ever had the privilege of putting in my face. Lily was actually there w","useful":0,"cool":1},"DJe1LsezO73oogl8T1c9Mw":{"text":"this is the most horrible meal i had in new orleans, the most horrible pho i have had in m","useful":8,"cool":2},"J98ZHcO3nOqB724WYoso0A":{"text":"The food was decent but not the typical authentic Vietnamese one. The flavor and portion s","useful":1,"cool":0},"2E-wM1smmBoruSy5FymUtQ":{"text":"The egg rolls are horrible! They are sour and taste spoiled. When I asked if it was suppos","useful":2,"cool":0},"R6RvOvJ4PaFqzn4Y2gW7hw":{"text":"Decor: 3/5\n-a bit confusing interior with the different color light bulbs and different co","useful":4,"cool":1},"CrB3aN3sFmJ3Tzkc5nF4Kw":{"text":"enjoy, it is really delicious! I recommend spicy pork and lily roll. Of course, it is the ","useful":1,"cool":1},"cjIe0KcvJmBxvR-5Vnd3GQ":{"text":"The best pho place in the city... Hands down! The staff is always friendly and great! I've","useful":0,"cool":1},"hVAYkXOyhN3Z_ulI8HxH8Q":{"text":"Excellent, quaint little restaurant on Magazine Street, the spring rolls and peanut sauce ","useful":0,"cool":0},"wMOH-dNPqRmBpG_7Z5yDVw":{"text":"Lilly's was good and the price was right. I just had a couple of appetizers: the crab rang","useful":2,"cool":0},"sTr1VHD0jWvKQCJ-29A2FQ":{"text":"My husband and I are visiting our daughter, a graduate student down here in NOLA.  We have","useful":1,"cool":1},"4niPSV9XNFwkwkIq-U9qqA":{"text":"My only regret from my recent trip to New Orleans is only coming to this restaurant once. ","useful":0,"cool":0},"Mj0h6fhFrdbS4zshatn_fQ":{"text":"Very clean ... the staff was on deck at all times... an funny ppl.... I had a great time","useful":1,"cool":0},"zzyda1dPqj2-K_Kck97HJA":{"text":"This place is so fantastic. Can't wait to go back. It's like eating in Lily's own personal","useful":1,"cool":1},"DaC5sHwdq1TPT6NMGh5aew":{"text":"Ahhh what can I say, it's my favorite vietnamese restaurant in Magazine area. The little w","useful":0,"cool":0},"n9foQIQ0Vqg2OfJyLWZcbg":{"text":"Ive had so many great meals here! Best Pho in town, INCREDIBLE Bahn Mi, mind blowingly org","useful":0,"cool":1},"iRaTjJ8qzWT85vrTAv3QNg":{"text":"Although only 4 blocks from home, our first visit to Lilly's was last night.\n\nHad \"spring ","useful":2,"cool":0},"_-wdej8d4iyI145UVpbwqQ":{"text":"Service was great but pho was just mediocre  the portion was a lot smaller than a regular ","useful":0,"cool":0},"JFCFL1KR0HmalHznyXLBFg":{"text":"Just walked out of Lilly's on magazine.Took 25 minutes to take our order. Got all three of","useful":1,"cool":0},"VWniey-xynKTTGituXtjlA":{"text":"Easily the best Pho I've ever had. Shrimp rolls were good as well. We came here twice whil","useful":1,"cool":0},"T7i-PbK8HwuWkXRygcsCyQ":{"text":"The waitress told me I was a like a beautiful Barbie doll but I was too busy talking about","useful":0,"cool":0},"vVntvgjFqSL9yhai4udoBQ":{"text":"This is one of the best Pho broths I've had so far and fast friendly service.  Anxious to ","useful":0,"cool":0},"839zKzZGiSJWfAJDmatGrg":{"text":"Ugh so good. Always always so good. I've never had a bad meal at Lilly's. Pretty reasonabl","useful":1,"cool":1},"bukueZ-Q5QihjVWCsPlFfA":{"text":"Lily's is still pure Vietnamese perfection. Met my little brother here for lunch and we ha","useful":1,"cool":0},"PF8GaUStTewWSVKKV8Sn_A":{"text":"Had some great spring rolls here as appetizers: the surprisingly tasty Lilly's Roll, in wh","useful":0,"cool":0},"hEQxC4rzx-vPaRx4hsPi5A":{"text":"Was visiting from Seattle, and decided to grab some pho after our red eye flight. The pho ","useful":0,"cool":0},"CUC8-s_SgL9TzG3FldkK5g":{"text":"Lunch at Lilly's today made me so happy.  And not just because I have been desperate for m","useful":5,"cool":2},"ebwhfqML8wC7nyLP9HSewg":{"text":"Having lived on the Westbank, Tan Dinh was my pho standard. I have a new favorite in Lilly","useful":1,"cool":1},"sPkozxFVG_DrLaaLbZ1bzg":{"text":"Great Vietnamese food! I've never been to Vietnam but I'm gonna say it tasted authentic to","useful":1,"cool":1},"_WYyEjVw_KbgYk1LU_FmJw":{"text":"Food is decent Vietnamese, which means it's yummy.\n\nThe service is terrible. I thought it ","useful":0,"cool":0},"i1vX2gk_76LiluXyROIKWQ":{"text":"You got to have the Egg Rolls! Today I had the Flank and Brisket Pho!!!! I'm 6'2\" 200+ lbs","useful":1,"cool":0},"rSqsWszvl5FCcPKegYryGA":{"text":"My husband and I stopped here while staying in a hostel not too far away. We always have d","useful":2,"cool":1},"_4g5e2N2mCoYysY5hsopAQ":{"text":"The food was so good here, we had to come back and try other dishes! The Pho is terrific, ","useful":0,"cool":0},"JZSo_PrghfiUE4o4ammb8g":{"text":"It's a cute little restaurant serving Vietnamese food. The wait staff is friendly and the ","useful":0,"cool":0},"brdsDQ9o-aIK0VAe1Fsnkw":{"text":"Clueless to what the hype is about when it comes to this place.  Hate for my first review ","useful":1,"cool":0},"vfDkiSFEglNQ9VCNBAXjeQ":{"text":"We were headed to the airport and wanted to grab a lunch bite before hand.  Most places ha","useful":0,"cool":0},"d1d1iXaECE3d6qKPcTeTyg":{"text":"AMAZING! The food is amazing... The staff is friendly and attentive. My daughter and I wen","useful":1,"cool":0},"MZMH352yGHTUYCWwxetIcQ":{"text":"Had lunch here about 2 weeks ago this place is supercute! I loved all the art and furnitur","useful":10,"cool":5},"LKTnFf2m2Aq0v8fH6exrBg":{"text":"Love pho from here. Maybe just be my favorite pho place in nola. The broth is flavorful, s","useful":1,"cool":1},"pilH9w6YEar8fwqtdZpgnw":{"text":"Service was swell, just as their nail salon next door. Food was tasty, very fresh, and wel","useful":0,"cool":0},"aKUCvYwDoTzMueRT-uFkjA":{"text":"After inferring that there was a significant Vietnamese population in New Orleans (only be","useful":2,"cool":0},"MAi5r9jyBgx_mgy7aq_6Lg":{"text":"I was in the neighborhood when I was having a craving for a banh mi (Vietnamese-style sand","useful":0,"cool":0},"GpFP18hhiwpg5S085wvS5Q":{"text":"This restaurant serves some of the best authentic Vietnamese pho in New Orleans. The food ","useful":1,"cool":1},"qR0vLv0At5vY0Ht-LOaapg":{"text":"Some of the best Vietnamese food in the city. Cute family owned business. Amazing pho and ","useful":1,"cool":1},"llZTu3ATXnTooKUtvsaQbQ":{"text":"Stated quite simply, Lilly's has excellent food. If you are looking for the freshest and b","useful":0,"cool":0},"aR799-LyuF5-Goy4e51kyQ":{"text":"Went here the other day for the first time.  My friend ordered the spicy tofu appetizer wh","useful":0,"cool":0},"WlRbWbVKGLUL_Mdu4WIyZw":{"text":"Lily runs her cafe with great humor and very efficiently. Our group had a delicious and af","useful":1,"cool":1},"eg3qPoGD7wsVlKlz1ygZog":{"text":"This is my favorite place for Vietnamese food in Nola.  It's a small place in uptown. Grea","useful":1,"cool":1},"U9FP2CzdhrlMhlZgSyUKEQ":{"text":"I don't know. Pho and banh mi are generally pretty cheap eats, so the prices here feel a b","useful":1,"cool":0},"u2FHLRPyzEn6fYmBrKRhvw":{"text":"So good we ate here twice in the same week. I got the chicken Pho and my friend got the sh","useful":0,"cool":0},"O0ElWOx_IWAta9-395en6Q":{"text":"Outstanding food, very reasonable prices and friendly people.  Definitely on my always vis","useful":0,"cool":0},"TcJP5y5NE_tZ3sHRmY2HrQ":{"text":"4/5 friendly and full\n\nalways busy. why? cuz it's awesome, duh. i almost always just get b","useful":4,"cool":5},"d92QGa7MPY3rTxb9zihEEw":{"text":"Fantastic food and service. Everything we got was delicious (big portions!) and staff was ","useful":1,"cool":1},"hg0pjShn5bFULuYjdm0LDQ":{"text":"The best Pho I have had was in Ottawa, the capitol of Canada. The only Pho spot I love in ","useful":0,"cool":0},"VNuxMghDLVJ15quUil9A2A":{"text":"Their pho is my absolute favorite. I have no idea what they do to make their broth so good","useful":3,"cool":2},"_4U-DaeI0VW-G2a1HpD2Og":{"text":"Really enjoy the food at Lilly's cafe. Service is quick. I gave it four of five because it","useful":0,"cool":0},"7u8IeiTBKxW-isxVj69EQQ":{"text":"One of the best Vietnamese food I've ever had so far :) had beef vermicelli and LOVED the ","useful":1,"cool":0},"cSTZ1J9eyUkXU6SGT6Wjhw":{"text":"I love this place!!! They have great service, great staff and the food is amazing! I have ","useful":0,"cool":0},"w_uCHoWWVXWcpriL5VyQBw":{"text":"To be fair, it's the only Vietnamese restaurant in New Orleans I've ever tried, so take th","useful":1,"cool":1},"auIinFVuD0vuWqFBkUuQpA":{"text":"Friendly staffs and good food. Tried Vermicelli with grilled beef and it was delicious. Ca","useful":1,"cool":1},"EH494uJ7Lzcus04wNV6j5w":{"text":"Love this place! After trying many Vietnamese Restaurants in town, this one is the favorit","useful":0,"cool":0},"peQFfnA4oovhgjlJO8LB-Q":{"text":"Hands down best Vietnamese in NO. And i live in little Saigon SF.  Not even a close second","useful":2,"cool":0},"S6v9787EaRhKB2Y7MCMfwg":{"text":"This is the BEST vegan pho in town!!! I drive across town to just get it and sometimes tak","useful":1,"cool":1},"8ON3Ll-TAQDFdr8BCSfnNA":{"text":"i have not had all, but i've tried most, and this is the best banh mi ive had on either si","useful":0,"cool":0},"2Z7tYiEPCaAixh1fyNrDOw":{"text":"Best PHO in town! But just a heads up, they are closed until August 5th. I've been calling","useful":5,"cool":1},"9XYEZxETPO_H6umcA3qDhw":{"text":"Paul Walker ate here shortly before he passed away.  His picture hangs on the wall near th","useful":3,"cool":0},"hJj-88u_M6E0fy6SiXvULQ":{"text":"Ok, so to say I like pho and bahn mi and tiny delightful spring rolls is all an understate","useful":1,"cool":0},"OC47oiwJbSLnNQcPDskHZg":{"text":"LOVE Lilly's!!! The shrimp and strawberry spring rolls are to die for and the peanut sauce","useful":0,"cool":0},"ig3FM12JGDuzaIyZT063QA":{"text":"Food is unbelievable- my favorite is the grilled pork bun. The only issue I ever have is t","useful":2,"cool":4},"yFKC_uQc8-RSWrF_mGyPcA":{"text":"I always enjoy this place. Good quality, authentic Vietnamese food. They're quite busy and","useful":1,"cool":1},"a9aaSNEPlloLuPChEOZomw":{"text":"Lilly's Spring rolls were a delight. Fresh, flavorful. Pho Ga was delicious - the broth ha","useful":1,"cool":1},"uZ-QsZoWlJPz1bSgi02s7Q":{"text":"Amazing food and service... Next this this will be my first stop in NOLA.\neverything is ma","useful":0,"cool":0},"992H4868JfNaItGeBnl-Dw":{"text":"Wow! Taste so delicious and it seems to be really authentic Vietnamese Food . Very good pl","useful":1,"cool":1},"oc8AXrBA6CKjq8O-K-KO2w":{"text":"Best pho I have ever had and ive been to 15 pho places in New Orleans and West Bank (Doson","useful":0,"cool":1},"yRwiI5TEVJs9qwjnSEg01Q":{"text":"Our first Vietnamese meal in NOLA and it was fantastic. Me and my husband were craving for","useful":0,"cool":0},"0qO6jtQe5uCihlwZRwzYMg":{"text":"Phenomenal Vietnamese , friendly staff, vegan/ vegetarian friendly, great veggie selection","useful":0,"cool":0},"OygUNE2UhQ3o4TGnGSVP3A":{"text":"We are Vietnamese food fans and this place was so good for lunch we are coming back for di","useful":0,"cool":0},"uv7L3sQ7Q1h2qvpwelHQJw":{"text":"Lilly's cafe serves one of the best Pho that I ever had before. The broth was tasty and go","useful":1,"cool":1},"SJwKCOioXtHWoXZkdgJxww":{"text":"I loved this place! I came in about a half hour before they closed, so I was a little worr","useful":0,"cool":0},"XYIKhVw1Pis4jr6wc3YPXQ":{"text":"Lilly's is by far the best Pho in town hands down! Their broth is next level and their ser","useful":0,"cool":0},"CLNqlejkXV7z-uu49bLy8Q":{"text":"No MSG and Vegan PHO options!!!! Reasonably priced and some of the best Pho I've tasted.  ","useful":1,"cool":1},"XEpPkU4rsogeAB5Vl_q8vQ":{"text":"What joy to have two new Vietnamese restaurants near my hood open in the space of a month ","useful":7,"cool":3},"N30qFgT6tDvPDjwe70I3YQ":{"text":"My visit to Lily's was the first authentic Vietnamese meal experience I've had. Lily's set","useful":0,"cool":0},"NbLQ6yfUMRPdbsuqxe75hw":{"text":"THE. BEST. \nHighly recommend: vegan options, ginger tea, pho\nPrices are perfect, customer ","useful":1,"cool":1},"OVzRGGK8RgkXXscqiAs68w":{"text":"This has got to be one of the best Vietnamese spots I've ever been to, and my family eats ","useful":1,"cool":1},"9vR3sTRtfTyOIWpqOSnoSA":{"text":"Not bad. I'm a huge fan of Vietnamese food and I have it often. This place is not the best","useful":0,"cool":0},"S1V_cDE87lAN8epSPDU2BQ":{"text":"Delicious Vietnamese food! The portions are generous, everything is flavorful and the busi","useful":2,"cool":2},"mIF2YQgL8fBc9D7uTUgr_Q":{"text":"Best pho place in town.  We didnt think we could find an authentic Vietnamese pho place (l","useful":1,"cool":1},"vVHXrWzjmnnxhCf1xRXx7w":{"text":"Really good pho! Great lunch place\n\nGot the following:\n\nFresh spring rolls: 3 stars, what ","useful":0,"cool":0},"fbkQu0NZz6nkfGbQchv6CA":{"text":"All their dishes are great, but the spicy tofu banh-mi is the best option in my opinion. G","useful":1,"cool":0},"I3a5VssQaRt6Soo5_hJXLA":{"text":"Came to New Orleans from California. After a long night of drinking Pho is a must. Stumble","useful":1,"cool":1},"NpZ70R3Svgtbqy12Ub48fA":{"text":"Soooo this place hit the spot. I haven't had good pho in a long time and this was the best","useful":0,"cool":0},"FUZDxjIfQnrsC8F3kJOlKA":{"text":"Wonderful service! Delicious food! Fresh and lovingly made just like your mom would make--","useful":1,"cool":0},"Kalhehhg6Z1YVB-ok7r59A":{"text":"I'm going to get a massive blow for this, but I never get the whole Team Lilly's deal in N","useful":4,"cool":1},"vYeySEtOtXL9gHwRN5Er5A":{"text":"Came here for lunch during a hot day on the dock, excellent food & service and quick turn ","useful":0,"cool":0},"sBJFcoITnfxHHirSLy4XvA":{"text":"Visited NOLA and haven't had pho (or any asian cuisine) so we decided to check this place ","useful":1,"cool":1},"D6HcBRfdiPKAWt7pkyyUSA":{"text":"Fantastic food! Pho combo and crab rangoons were excellent!  Very fast,  friendly service ","useful":0,"cool":0},"RaHrxtZAB6fLLVTSp5hrLg":{"text":"This spot is an absolute gem!! The owner and staff make you feel right at home. I'm so hap","useful":0,"cool":1},"iVYMuLyIrali0yzZ50jt1A":{"text":"Amazing pho! Huge portions - well worth the $10 a bowl. Lily is really sweet and hospitabl","useful":1,"cool":1},"xkydjBTlwKnQQJmsk1FR0w":{"text":"Generally good food and the manager was very warm. However, I went there with my family (t","useful":3,"cool":0},"YTBoIsCmvfTIAVVPTuorNg":{"text":"Yum. Why has it been months since my last visit? Delicious tofu bun (which can be had with","useful":2,"cool":1},"gwvOLbYNuN5-P4-VuxuYBA":{"text":"Lilly's cafe is great!  Had two appetizers, pho, and rice bowl. Everything was fresh and t","useful":1,"cool":1},"ZBxjAHTcpJyuUz_Mf3UpWw":{"text":"Primero! Lily is a sweetheart.  My mom doesnt speaks Spanish and she was all the time tryi","useful":5,"cool":7},"0bQriwPsEBijQfO1Gef-rQ":{"text":"This is my absolute favorite place in New Orleans to get anything Vietnamese. The Bun is a","useful":0,"cool":0},"2xbgxHjJLrHJYrTN0oH9Cw":{"text":"GET THE BUN! Don't forget to add eggroll and an egg. Chase it down with their amazing coff","useful":0,"cool":0},"eKmwxKfeLkVFZgzcpyx6uQ":{"text":"The Salad Rolls and Brisket Pho were the best. I visited Vietnam earlier this year and I w","useful":0,"cool":0},"Je-4FGrMWdbQsXH4EgLftA":{"text":"Delicious! I love the way the steak is cut into bite sized pieces. The services was great ","useful":0,"cool":0},"2NBR99EE32AYXZUrPONmJg":{"text":"Have the spring rolls, the iced coffee and any of the soups or salads.  \n\nAnd for pete's s","useful":0,"cool":0},"5ZYiroIcGeiNQUpIeGRg2Q":{"text":"One of the best of I have yet!! And their likely spring rolls is different bc they have st","useful":0,"cool":0},"r3rUvLLsTBUHelJh8YX9oA":{"text":"We came here on a Monday night because a lot of other restaurants we wanted to try were cl","useful":0,"cool":0},"ZvwwlJarArjCfaBNo5ECWQ":{"text":"Best Vegan Pho in New Orleans !","useful":0,"cool":0},"7V_av2x6hNE9ZHjumccuxQ":{"text":"THE REASON WHY VIETNAMESE ARE NOT IN LILY'S CAFE\n\nMe and my (Vietnamese) friend went to ea","useful":6,"cool":0},"3vdp1kweCjKxe88oalS9-g":{"text":"Service is spectacular!!!! Ban mi pivots is Ok.. didn't have that sweet mayo sauce I like ","useful":0,"cool":0},"QOQyu3drpysg_TTJz9qYiw":{"text":"In town for work...amazing Pho!!! The quail eggs melt in your mouth. This meal left me dea","useful":0,"cool":0},"GiO08TVIt1Kp0UFCnbvfeA":{"text":"I love the spicy tofu! The service is rather friendly unlike most local Vietnamese restaur","useful":0,"cool":0},"z2rfqrCHF6nK5465DeLr5w":{"text":"Coming from San Jose, California where there is a large Vietnamese community I was a bit s","useful":0,"cool":0},"3WbHKmjhzK-H7rXnTp3rgQ":{"text":"This Vietnamese restaurant near the cityside end of Magazine street nets an easy five star","useful":3,"cool":5},"LJoidVIqYpI9-v0T-dEI3A":{"text":"The staff couldn't be friendlier.  Lilly, you are awesome, and I love the way the place is","useful":0,"cool":0},"rJr4vXzLbfYh6MykkgPUEA":{"text":"Here's the deal.  Prices reasonable.  The pho is well balanced and nurtured.  It has as th","useful":1,"cool":0},"sRRbUhyfSRVdye8VXkPRUg":{"text":"LOVE Lillly's! Best Pho broth in the NO. Friendly staff, great value, quick, and just supe","useful":0,"cool":0},"w5OxS5UZVJwG63spYVsfLQ":{"text":"With not much Vietnamese restaurants new Downtown New Orleans, Lilly's Cafe did satisfy ou","useful":4,"cool":2},"AuZlpDyPC_Av3OyjrmfwoQ":{"text":"Best brisket pho I've eva had. Tender, hearty pieces of brisket, noodles are soft unlike m","useful":0,"cool":2},"wpb6e8zLllwz44QZWK5H1g":{"text":"We bought the spicy tofu rice and the tom yum soup, both are delicious.. definitely try sp","useful":0,"cool":0},"ojtvdrklNwVs0fT7N6eDLw":{"text":"Their Spring Rolls with the strawberries are amazing!! They have great coffee as well. And","useful":1,"cool":1},"R4-1qMDqRi24Forc3_hq1w":{"text":"AMAZING Vietnamese food!!! After trying lots of different Vietnamese places in the city, I","useful":2,"cool":2},"Ui3eOn8Gnz16dHUOiuU21Q":{"text":"Great food and service overall.  I am a vegetarian and it's been a struggle to find good v","useful":0,"cool":0},"P0anzOwDuQLGHJkhD7hPcg":{"text":"Really good pho. But very bad service. I told the waiter I didn't want sweet tea and he se","useful":0,"cool":0},"sIY60ABRVoUk88Bogxjh5g":{"text":"I'm Vietnamese and I would like to think I'm kind of obnoxious and boujee when it comes to","useful":4,"cool":4},"hFGsopLjPW8HUAlXQNsgZQ":{"text":"AHHH. We started with the spicy spring rolls (didn't make the pic) & the spicy tofu. Both ","useful":2,"cool":2},"BlvbljfWm9OgcgYYhnwuhQ":{"text":"What an amazing little restaurant!!!! The service and food are great. Also their variety o","useful":1,"cool":1},"XQ6dpPt-SaDKV4IDR4MAlg":{"text":"This place was amazing! Had the spicy tofu banh mi and I will probably won't have another ","useful":1,"cool":2},"ZaukL5H63Sj8bX0XA8CbRg":{"text":"Imagine this:  A windy, RAINY night in NOLA.  A massive hunger brought about by a full day","useful":3,"cool":2},"oVwY8VEwtU7mp3urqfJUyQ":{"text":"I've met my favorite Vietnamese restaurant in town. Lilly's Cafe - you are amazing. \n\nI've","useful":1,"cool":0},"BNvPt9v9PXq7uZtRbOyb6Q":{"text":"The Phò is amazing... Delicate broth with great flavor. Highly recommend....\nThe staff is ","useful":0,"cool":0},"w3iVNg-dRp-bimARo5Gx3A":{"text":"Consistently the most amazing pho I've ever had.\nAs someone who eats a lot of pho and norm","useful":2,"cool":1},"JgYGvBh7I7S3p8dmI3SPwQ":{"text":"Cute, casual setting with awesome Vietnamese food and good prices. I've been to a lot of V","useful":0,"cool":0},"BdElmhxrtiYQKkv-j4fmOQ":{"text":"Received another message from the owner and it wasn't a friendly one. If you don't write a","useful":4,"cool":0},"XWJOJxkhhydQ_kY4owdm6w":{"text":"Not the best Vietnamese I have had in the city but definitely a contender. Lilly's cafe, i","useful":0,"cool":0},"gTIyN2r_qWFmGWNk-Kb0Gw":{"text":"Great food at a great price. Pho was excellent and service was good. My only complaint was","useful":0,"cool":0},"LmY0dV4nBJYpil0a1ZntFA":{"text":"Usually I start off my reviews of Vietnamese restaurants with \"Me love you long time\" or \"","useful":2,"cool":2},"KIwTgtx6l_m8HL8RvhPCYQ":{"text":"Lilly's is our go to pho spot.  We pick up from Lilly's.  We dine in at Lilly's.  They are","useful":3,"cool":1},"5PsIiI6IC8Y0Qx0wgosTkQ":{"text":"SO good! The food and service was wonderful. \nWe ordered the iced coffee, vegan spring rol","useful":2,"cool":2},"IDYZDl58a7ew7FMQP_-Xkg":{"text":"I wanted to give this place more stars but couldn't.  We had a shrimp pho and a chicken ri","useful":0,"cool":0},"AeWNVDgFGhS1Y1K3K1YFCg":{"text":"Lilly's is he best pho in NOLA. The broth is buttery and delicious. I usually order the ph","useful":1,"cool":0},"-E_hp9-Dnr4V9rNP7pUCvQ":{"text":"The best Pho ever! My kids loved the rice and chicken dish. Whenever I come to NOVA I will","useful":0,"cool":0},"lSiDu3Wgbu_463rhPMI8LQ":{"text":"My first time having Vietnamese food. Tremendous! Spicy shrimp Pho was very good. I you ca","useful":0,"cool":0},"xuctRW15wbGsM1NZ9wW3cA":{"text":"Lilly's is an amazing addition to our neighborhood.  I am there at least twice a week.  I ","useful":0,"cool":0},"tWl5DrEmN8Mj-D_302zfNQ":{"text":"BEST PHO in town. Small quaint place on Magazine in the LGD. We had Pho Ga and Goi Con. Bo","useful":1,"cool":1},"gIO9a0U-ePlOxSsCwKmB8A":{"text":"Uh-maze-ing food. Get the spicy tofu. Get the spicy tofu. Get the spicy tofu. \n\nThe prices","useful":1,"cool":2},"M_KCd7uN6gfhXBs5y896jg":{"text":"I love everything. That's all I can say... nah I'm just playing lol. \n\nSo pho-lovers, Viet","useful":2,"cool":0},"0kkl8BTpC_qOi1CqtQyxZg":{"text":"There are a few times in life when a meal is crafted with steamy goodness that you not qui","useful":2,"cool":2},"SJhWtyQpei0VjiA39s0YwQ":{"text":"Great Pho especially for being in New Orleans. AND coming from SGV in CA, where there are ","useful":0,"cool":0},"KDYxyy4QRBIeblzjLWGn4A":{"text":"This is my favorite Vietnamese restaurant in NOLA right now. This is both due to the quali","useful":5,"cool":3},"ZJ8U8ccOaUFZnsFuD-XAbg":{"text":"Retuned for lunch and this time I ordered the Bahn Mi. Wow. Wow. It was a great sandwich, ","useful":2,"cool":2},"b3Rg3PBfuMwJkF79N3Vs1Q":{"text":"Absolutely incredible food. The combo pho is really really good! We're from out of town an","useful":0,"cool":0},"Db3cbtUbx39DiAg9GBlSJQ":{"text":"Amazing pho - I've been to Vietnam and this actually compares. Pho Tai is the way to go (t","useful":2,"cool":1},"JsuR0yQAcc1mD73FuutncQ":{"text":"Retuned for lunch and this time I ordered the Bahn Mi. Wow. Wow. It was a great sandwich, ","useful":3,"cool":3},"vxXO3yAjterZipxMR6bY9g":{"text":"Have been wanting to come here for a while now and finally got a chance the other day. I o","useful":1,"cool":1},"7TYvhKVpmaSjkiOjVcsvWA":{"text":"Where do I start? The food. The owners? Everything is good here. The pho is amazing, the b","useful":1,"cool":1},"YIdotXVh8sRIlLB2E5KAQA":{"text":"Loved this place! I'm from Seattle and Vietnamese food is my go-to comfort food. \nEverythi","useful":0,"cool":0},"1rTj0YzkM8HpJL2o5i2Zpg":{"text":"Dining at Lilly's is like having a delicious  meal in a friend's home , lovingly prepared ","useful":3,"cool":3},"ElMJKqtsVdGeFKvG5m4U8A":{"text":"Ordered the Vietnamese Iced Coffee, the Pork Banh Mi and the Chicken Pad Thai. All were am","useful":0,"cool":0},"N10V-UVr57cQMFpCcvWefw":{"text":"They were nice enough and the inside is pleasant. It is not the best Vietnamese food I've ","useful":0,"cool":0},"Xr1XRv10N50kcogcwETRPw":{"text":"It has been quite awhile since my wife & l took a long walk from the bustling streets of d","useful":1,"cool":1},"lbnb6ckwsShl-Mbm3oKA4g":{"text":"Great food and great service...can be a little packed sometimes so be aware of that if you","useful":0,"cool":0},"zrpJEznSS-yn4TJncn-YAQ":{"text":"Tofu bahn mi was D E L E C T A B L E and the service was great. Vegan egg roll was also in","useful":1,"cool":1},"U05oL_mZ0_Q1Nbt0c01EOw":{"text":"Very cozy here and the food is spectacular. It's one of the best I ever had really. I orde","useful":2,"cool":2},"E5gSQY6nQHi-UJvVsGC5_A":{"text":"Service is extremely friendly and gracious and the pho is delicious! The spicy shrimp pho ","useful":0,"cool":1},"Jd15A-mR81ykU6kc3DUAFQ":{"text":"This place is amazing. Coming from the bay area with a tons of pho restaurants, nothing is","useful":1,"cool":1},"a0GtMS7BqQ4ABGTkfNiHew":{"text":"One of my favorite restaurants in the city!! Lilly's Veggie Pho is so flavorful and it's V","useful":3,"cool":2},"QecareWw_flCt_hZnKjdbg":{"text":"I took my wife to New Orleans for her birthday. We did a restaurant crawl and Lilly's Cafe","useful":2,"cool":2},"J92_mi9j7VmraPehOBgjng":{"text":"Got a vegetarian tofu and veggie pho bowl. The broth here is better than most places I've ","useful":1,"cool":1},"W4QbLO0NOQDbUT40TYxChA":{"text":"I stopped in here for an early lunch. I started off with the vegan egg rolls, which everyo","useful":0,"cool":0},"jMA-zcLh5PRei8bA7ehi9A":{"text":"We used to go to Lilly's a lot between 2013-15. I've eaten there about 10 times in that ti","useful":1,"cool":0},"YQ3YJLPZJV3zMvJsA0v55A":{"text":"Very cute place. Tried the chicken pho. The broth was a little salty, otherwise it was del","useful":0,"cool":0},"b8sSEoZsjqR4MUDDTm17nA":{"text":"A hidden treasure  a big bowl of delicious hot Pho on a cold January evening is satisfying","useful":0,"cool":0},"xiJei6bjyWowzsyCZ0E8kQ":{"text":"The place to go uptown for comforting, steaming, savory Pho.  Lily's is an unassuming Viet","useful":1,"cool":1},"zDdfiwHB7cKQTw0thuOnrg":{"text":"I wanted a break from straight American food in Nola and decided to get PHO. I heard there","useful":1,"cool":1},"Bq0Q48KOYDeQbQeqBlaxGg":{"text":"Try the spicy tofu, if delicious with a little heat is your thing. I love the bun. It's a ","useful":2,"cool":1},"vLNDyxLB_dJQFty-2VOlSQ":{"text":"We came here on a cold and insanely rainy day. We were quickly greeted with smiles and sea","useful":1,"cool":1},"HNWfcAPpvg2BW-eodUH61g":{"text":"It was a busy Friday night, yet the service was quick and attentive. The food was excellen","useful":1,"cool":1},"GEZ8q0A64cACPlNvcn6U0Q":{"text":"I've been disappointed that Magazin, my go to take out Vietnamese place has been closed fo","useful":1,"cool":1},"0PN8mhKKefy6T89je08ZEQ":{"text":"Lilly's, I used to love you, but it's all over now. \nI was there when you opened and came ","useful":10,"cool":0},"g9AL6a85SHX1fuj3NG1GyA":{"text":"I've visited Lilly's twice. I was very satisfied with the food and service both times. I'm","useful":0,"cool":0},"YDOn0SX6yHlaFlMAkgLnMA":{"text":"I love everything about Lilly's! I live in the neighborhood and go very often. The pho tai","useful":1,"cool":0},"QIqYYyW4GK3LwaTwNJao3Q":{"text":"Excellently seasoned beef broth. I always order the tofu and vegetable pho in beef broth n","useful":1,"cool":1},"yaKClCB08Z1mpGHVJbJ3yQ":{"text":"This is my go to Vietnamese spot. The food is always fresh and the service very friendly. ","useful":0,"cool":0},"ctV-4U1zsOLLHEaB8VKtKg":{"text":"Such nice service. Vegan egg rolls were amazing...made with root veggies, very unique. Spi","useful":0,"cool":0},"Y3muUpzM7zr5l9RmASWTtQ":{"text":"So delicious and they had a great vegetarian selection for my friend! Coming from SF, I kn","useful":0,"cool":0},"MTsyMghlNrbSyKL7q-Ho9A":{"text":"I FOUND THE ASIAN PLACE TO GO WHEN I'M TIRED OF EVERYTHING FRIED AND COVERED IN SAUCE IN N","useful":5,"cool":2},"nOsqauamMsKg92rFEA9yMw":{"text":"This place was absolutely wonderful!!! Lilly was super kind and very welcoming. I'm visiti","useful":1,"cool":1},"kyZtmwI0WM8JpzE68vdxuA":{"text":"Soooooo good! The best Vietnamese we ever had. We ordered the summer rolls, bun with grill","useful":0,"cool":0},"mJh9h1xOySsz4a1mgeJl4w":{"text":"Cute casual place. Staff is friendly food is great!","useful":0,"cool":0},"nCvFH-8KL_Tpkd-J2WMnJg":{"text":"We stumbled upon this walking around town. The food is on par with what I would consider t","useful":1,"cool":1},"ofJ1KvBR_3ZvwnrNjpiymw":{"text":"Excellant tofu bahn me!!! The pho is really good too. Super friendly and very fast. Def a ","useful":0,"cool":1},"FawdRggD1j8evqIUk6T3pA":{"text":"I've tried Vietnamese restaurants in New Orleans from deep in the East to both the East an","useful":0,"cool":0},"jrfBkDnzosgMhl_5BYDD2A":{"text":"I dream of the vegetarian spicy tofu.  It's so delicious that I greedily eat an order ther","useful":1,"cool":1},"SjdDb8ykiX4_nAJVypoYRg":{"text":"I was craving some restaurant pho as a tiny break from my lovely mom's homemade pho (sorry","useful":2,"cool":2},"F5G5FKmF2qxIGfjwOEhxoQ":{"text":"Amazing pho!! We had the vegetable pho and the shrimp pho (has a little spice to it). Love","useful":1,"cool":1},"_hDrqCr6_-XpqBI9cM8w_Q":{"text":"This is by far one of my favorite Vietnamese restaurants in the US. Such fresh ingredients","useful":0,"cool":0},"XfLpOmOpE-LZNx5VST6qWw":{"text":"My 1st time here and really enjoyed it. Spring rolls are awesome and the peanut sauce that","useful":1,"cool":1},"tE5MntDrgc1XREHF6DkTIA":{"text":"Fantastic food. One of my top two Vietnamese places in the city. Service can be lacking at","useful":0,"cool":0},"IsGHBebBSTpjn-T9QfzI0g":{"text":"Great qualities: I enjoyed the food here. We ordered the Chicken & Quail Egg Pho and the g","useful":2,"cool":3},"8i0XHlVUXBdCRmIj-vneXA":{"text":"This place was busy , however we sat down , got. a table. After 5 mins , they asked us to ","useful":1,"cool":0},"cfDsPnyTKc3O8CGLTaTtVg":{"text":"The name is somewhat misleading; this is no mere cafe but a rather excellent Vietnamese re","useful":4,"cool":5},"UTVp6y4U3hz8Vzh5oyFiAQ":{"text":"Today I got the Bún with spicy chicken which was delicious! Very quick service and great q","useful":1,"cool":1},"FaCwfKpe3HeY3kG23X_IMA":{"text":"Love everything on their menu. Staff is always super nice and food comes out amazingly fas","useful":1,"cool":1},"qm4DnCwSkGftJL0lchBG1g":{"text":"Lilly does a fine pork banh mi.  Good bread is key.  I love bread.  Carbs are not my enemy","useful":1,"cool":1},"vQgr-Ez8H9EY6sEy8Ews2A":{"text":"We had Pho and Banh Mi (spicy pork).  First, Pho does not taste authentic, it's just a bee","useful":0,"cool":0},"yCOY_Cj6fNZcM5QHyYKKUA":{"text":"This place was absolutely delightful! The only thing I didn't like was the extra noodles w","useful":1,"cool":1},"UIce6caakp6xJLPo5rX1Yw":{"text":"This place is awesome. I have never had a dish I don't like, the pho is amazing. Prices ar","useful":0,"cool":0},"SK2fEZdJSnjSeBvq0oKMrA":{"text":"I had to give this restaurant 2 stars because the most important item in a pho shop is the","useful":0,"cool":0},"weMSReyCPmu-UlxvTQfAhA":{"text":"Best best best pho in town!!! Amazing broth. Everything was so good. Definitely my new fav","useful":1,"cool":1},"2WHQ7SRb8FmKlxQcY8WKXQ":{"text":"No stars. My husband and I were going out for dinner and thought we would try Lillys . We ","useful":1,"cool":0},"LuvpDyUK9PD4SbZ1BtzTGA":{"text":"This is a great Vietnamese place on magazine street. I placed a pickup lunch order in the ","useful":0,"cool":0},"1qU47GgTvqDq7A9dxmLDbA":{"text":"i liked my pork and rice dish here with the fried egg. also liked the pho that I sampled. ","useful":1,"cool":1},"O5HuCqIC1vUriOb5iILRYw":{"text":"Delicious Bahn mi! The bread was very fresh. Loved the spicy chicken salad! This place is ","useful":0,"cool":0},"CFDWS8DaYGtHc197n0ziOw":{"text":"Very very very hospitable! Small store front, medium sized restaurant, delicious food! Cam","useful":1,"cool":1},"kUHpcckBh498loUx3988HQ":{"text":"Loved this place!  Good food with fresh ingredients.  Wasn't sure I'd like the strawberrie","useful":1,"cool":1},"a9TvBbQcIPzKjMc6tuVQkQ":{"text":"One of my fav spots on Nola! Always super fresh and flavorful! Lily is super happy and bus","useful":1,"cool":1},"0Gjaa8S4MNNRO-f3fPosaQ":{"text":"So delicious! And vegan friendly. THANK YOU LILLY. I had it delivered my hotel as my last ","useful":1,"cool":1},"e2WQQA7q6V-MbhA77tyFmQ":{"text":"Good Pho, decent pricing. The sandwhiches were very good size. Would I go back-yes, was I ","useful":0,"cool":0},"wRNLqSl9MP5el_VjB3iRiw":{"text":"Long overdue review. I have lived in the area for just over 2 years, and gone to Lilly's a","useful":1,"cool":1},"NptHvp18mBB_HOu5ZlbXvQ":{"text":"Great people, great food. \n\n\"Lilly's Spring Roll\" is filled with strawberries and avocado.","useful":0,"cool":0},"MjusPEUwR3FybPlRhes_6A":{"text":"OMG BEST VIETNAMESE FOOD IN THE ENTIRE NEW ORLEANS & IN MY ENTIRE LIFE\nI am completely sat","useful":2,"cool":1},"VHLXK3oC71UeyCRi2huQTg":{"text":"Their broth is very rich and hearty. At first taste, you can tell it'w broth has been simm","useful":2,"cool":1},"hIfn4lNZUgVZJ6-HyuUhaQ":{"text":"This is the best Vietnamese restaurant in the city. With pho getting more and more popular","useful":1,"cool":1},"qdW2dXjgkT-RdGq76apejg":{"text":"everyone at lilly's has my heart--some of the sweetest ppl in the area! food and service a","useful":3,"cool":3},"r1dZsCv9rWSmmR18rOpEdg":{"text":"Heard good things, but was not terribly impressed. Smallish menu - the spring rolls were w","useful":1,"cool":0},"A20QOtR88fis206XDemM8w":{"text":"The brisket pho was great. I also tried the pork spring rolls which were equally good.  Th","useful":1,"cool":0},"F8IPoX4kTc9EqiQVuZZpTg":{"text":"You can't beat the price, the pace, and the atmosphere. We had one awkward experience wher","useful":2,"cool":2},"5siyniLvmauU4pntLn2U2g":{"text":"I've had a lot of great meals on my many visits to New Orleans, Herb Sainte, Cochon, Butch","useful":0,"cool":0},"5TF0PcV_Q7Nx-RbbWDS63A":{"text":". This is a great spot!  The service is amazing.  I love that our waitress was wearing a S","useful":1,"cool":1},"rBBjkzVUKT_gBQMuSYYUeA":{"text":"Lilly's Cafe was a nice change of pace while dining the last few days in New Orleans. Tuck","useful":0,"cool":1},"u6K1JM8bI3MqHCEhvpfEwQ":{"text":"We live right above this place. Its always a good go-to for us. We've tried and enjoyed ju","useful":0,"cool":0},"8kc2zZylGHbG-7bxRqkhOQ":{"text":"This place is really nice and The food is really good. The owner she also showed us where ","useful":1,"cool":1},"23EXKM-OZ8IdRG2-WLsEMg":{"text":"I've never resented having to drive across a body of water (in either direction) to get th","useful":0,"cool":1},"DcJl1UDj_UE8EEkVxrNCwA":{"text":"Best Pho I've ever ever had. The layers  of flavoring and the quality of ingredients reall","useful":0,"cool":0},"2BaLqGPkAE6kLWpVEMZPVA":{"text":"This place is so good! The spicy rice dishes are sure to meet your heat needs and the verm","useful":1,"cool":1},"xvH4Fy-WCbCCTe688gSzwg":{"text":"I always get the vegan pho, my husband always gets the vegan banh mi.  We are ALWAYS happy","useful":2,"cool":1},"dZeZn_7IYCc9dD9NUcMMmA":{"text":"We're visiting from Los Angeles and Lilly's cafe was a couple of streets from our Air bnb,","useful":1,"cool":1},"vyCUJ_r_XdlIjQt9cI9dZQ":{"text":"Best pho in New Orleans. Always craving my usual: spicy shrimp pho, tofu bahn mi, and shri","useful":1,"cool":1},"1BQJeZrKG8MrBDBLNDXoAQ":{"text":"Pho is flavorful. No bland broth in site. Their self named rolls have strawberry in them w","useful":2,"cool":2},"xF2usMKTrFyKoXfMI8YH_g":{"text":"I kept hearing about this Lilly's cafe and how good the Pho is.... let me tell you no one ","useful":1,"cool":1},"5kXmavB9a1qzAyxddRDW7Q":{"text":"Lilly's about saved my life last week! With temps dropping to the point of actual *icicles","useful":22,"cool":19},"IbkoIDa9KATieUxkEatjEQ":{"text":"I used to really like this place, and their chicken with rice dish is delicious but... las","useful":1,"cool":0},"4tv7PyDsORkBaPt3wfwyWw":{"text":"Lilly's is okay with me. I ordered the chicken Pho and a Strawberry lemonade.  I really en","useful":1,"cool":0},"3BtI-tnKjKgw5zm-h9xfow":{"text":"Pho-tastic! Pho is as authentic Vietnamese you can get in these parts. Wait staff super fr","useful":0,"cool":0},"Rc7StPwH1N_CpsCYPhllrg":{"text":"The best! So friendly! The pho is outstanding! I travel by several other pho places to com","useful":1,"cool":1},"wdSHlcEs0uuxVP_I6w3oaw":{"text":"Fantastic pho- best I've had since leaving Los Angeles, good Thai tea, avoid the boba thou","useful":0,"cool":0},"oCvgc6AQyMi0kryqKaBHXQ":{"text":"I'm in between on this place. There was some things I really liked while others were meh. ","useful":1,"cool":0},"CpF9MWyIQEcnSf97XYl7Dw":{"text":"Not sure why such great reviews, I guess not much Vietnamese to choose from in Nola. Had t","useful":3,"cool":0},"h8uP2ui2c8JFyE37IKqVYg":{"text":"I don't understand the hype surrounding this place. Maybe I ordered the wrong thing since ","useful":6,"cool":1},"atS2QvX9Tiskmd_mW1FNLQ":{"text":"Mighty  tasty chicken vermicelli...  Love the flavors and the crunch.  Very easy going own","useful":1,"cool":1},"asi1K65UD36H3tgijADUZA":{"text":"I wanted to like Lilly's, I really did. Since there's a notable Vietnamese presence in NOL","useful":6,"cool":1},"cfa-gW87n4a0qS2snKywcQ":{"text":"I absolutely loveee this place , the owner is so nice . The food comes out so fast . The f","useful":1,"cool":1},"yCIUSrNp8ffAmDc_ouHpVQ":{"text":"After repeatedly sampling traditional New Orleans cuisine, Vietnamese food is a welcome re","useful":1,"cool":1},"oU1rzqEClKmhdrFDbDYdJw":{"text":"Lilly's cafe is truly a gem! \n\nI took my order to go and everything came in a separate con","useful":5,"cool":4},"gpRcjxz6zFqguErzV4lINw":{"text":"We visited during Covid phase 2. The restaurant is currently open for dine in and take out","useful":1,"cool":1},"5MMwnLelqSSH9qDrm9OAOA":{"text":"Lilly's is consistently good and fresh. The pho is the best in the city. The shrimp and av","useful":0,"cool":1},"SthRB6TCpfXWO3qmuabvWA":{"text":"Great vegetable pho, cute atmosphere! \n\nFresh vegetables, and fried tofu. The broth is ver","useful":0,"cool":0},"pYaLfuJqLz-Ea5FzwXOD2A":{"text":"This is just for pho as all 6 of us didn't try other food. We all think calling \"authentic","useful":0,"cool":0},"GBJIBlyauCLhsCG5yGXhXA":{"text":"We are from out of town and loved this place a few years back. Went again and took our kid","useful":1,"cool":1},"vKw02LmAh94bRaw6DlIAFQ":{"text":"Perfect place to satisfy your Asian food cravings when you you need a break from Cajun/Cre","useful":7,"cool":5},"Yj7GcJJyePaCZGFVzpOgxg":{"text":"Excellent food here! The vermicelli spicy pork is awesome. It's loaded with moist chunks o","useful":1,"cool":2},"hJ7Ttp_n2X7vgljoDKSzpw":{"text":"We stopped in here on a rainy NOLA weekday around 1pm and it seemed like the whole city ha","useful":0,"cool":1},"cIO26R4q47OE7qNmdY644g":{"text":"Absolutely delicious!  We came here on a cold, dreary day wanting some nice and warm pho a","useful":1,"cool":2},"VRCj73GU5Yx6FaRCJ6-CQw":{"text":"My new favorite place for Pho! The pho and bun dishes are bursting with flavor. I had the ","useful":1,"cool":2},"1lfswEXA3vhAK77c6AvjqA":{"text":"Lilly's is my favorite place for pho in New Orleans! They have great options, my personal ","useful":1,"cool":1},"B4oAGOgCuAodqwsMYcTc8A":{"text":"The place we go to every week! Never failed us with their pho and bunh! Tried a few other ","useful":0,"cool":0},"3UGQprObmKNfWvYOP1VBiQ":{"text":"Loved loved loved this spot! The atmosphere was wonderful. The vibes and decor were so ple","useful":1,"cool":1},"ufVFdk9OBdNzCFcZcVF9kw":{"text":"The food and service at this quaint, cozy Vietnamese restaurant on Magazine St is perfect.","useful":1,"cool":1},"HQhoFyYyEP-NztImFQtZXA":{"text":"The best pho in Nola. Hands down delicious. Been going here for years and doesn't disappoi","useful":0,"cool":0},"0cZF7f_FdAptv89k20betw":{"text":"I had heard so many great things about this cafe. It was good but not great. I felt pressu","useful":0,"cool":0},"lASP7RUatDufekRU5SzOuw":{"text":"Last night I shared a dish of Shrimp Spring Rolls, Spicy Tofu and Pho Tofu with my boyfrie","useful":0,"cool":0},"U0vFkwjubCmyh0ETXUaaIg":{"text":"Amazing food with amazing portion sizes! My bf and I came on a Tuesday afternoon for lunch","useful":3,"cool":1},"DjtjFlFypA-kyG_pvfWldg":{"text":"They have a lot of vegetarian options. I had the veggie vermicelli with an egg, and it was","useful":0,"cool":0},"lT3hpEds1ODo0-cFdd9ilw":{"text":"Unreal. Just so good. The rice with pork is DOPE. So is the rice with spicy tofu. And the ","useful":2,"cool":1},"7mjyhSTsqfH5Dm7WnYJ8jg":{"text":"Alright, so a year or so ago my boyfriend and I were having Pho in NYC and he could only t","useful":2,"cool":1},"-dIPS_ii_fxs5rJIvWU9LA":{"text":"This place is soooooo good . I would eat here 4 times a week if I could considering my lov","useful":3,"cool":3},"KFZQk20m1MlqNUP0BnyrkA":{"text":"A friend showed me this place recently and I cannot wait to go back.  Vegan options of my ","useful":2,"cool":2},"BOelAIAgdw7vD8HLznzeuw":{"text":"It doesn't get any better than Lilly's Cafe. First, the staff is incredible; always so ple","useful":2,"cool":2},"0PcZabx-8VZ9JfkG5gA0BA":{"text":"Lilly's Cafe has been our go-to restaurant of choice since moving to the LGD! We moved fro","useful":1,"cool":0},"lovOoPaMZ_k0rKM5ofeUSg":{"text":"Everything was so good! To begin, it's an adorable little purple shop in the garden distri","useful":1,"cool":1},"o79KhLpj-AGjtv6Oo7pwvw":{"text":"I have visited a ton of restaurants that served pho so on a cold day I decided to venture ","useful":3,"cool":0},"D9qUmPG0L9t97mOM9XOEtw":{"text":"What a hidden gem! Great food, wonderfully sweet people taking care of you, what is there ","useful":0,"cool":0},"6wpqqD-3jKTKEaZEE8pogw":{"text":"Over Memorial weekend, I was terribly sick with a sinus infection or whatever was going ar","useful":3,"cool":1},"-EJwzp1V5Nn_EhGSZqYzQw":{"text":"This is really the only place I go to for Pho while in the city. Lilly's has the most flav","useful":2,"cool":2},"6DaynLDO0AeyY7FGi9n-fg":{"text":"Lilly's serves fresh, delicious food. The broth for the pho is stellar, with fragrant five","useful":1,"cool":1},"jqr3ILwfjuMwPruPKVdf3Q":{"text":"There's something about this place that always draws me back whenever I come to NOLA. It's","useful":1,"cool":1},"ZEQkJDwR0hRUg-P1VMpAqw":{"text":"During a visit to New Orleans, this neighborhood restaurant was a nice break from all  of ","useful":1,"cool":1},"1X07lSKMyBkf90qdNt1n3g":{"text":"This is a must must must in New Orleans \nBYOB so being sure to grab stuff \nU can't go wron","useful":0,"cool":0},"_an2zmezholrSJxzZmGBoA":{"text":"In the New Orleans metro area there are SO MANY different Vietnamese restaurants you can v","useful":2,"cool":3},"h1Gn8QT8qSJ029HbVcBFmQ":{"text":"This place is definitely a small cafe. It was cute! There was like a small garden looking ","useful":1,"cool":1},"SILvH81E6tdIQCabND-jxg":{"text":"Want the best Pho in town? Then look no farther than Lilly's.\n\nMy 'usual' is a large, stea","useful":13,"cool":8},"2k8Wn1unOKY9q3A4F4r-tg":{"text":"Lilly's has the best Vietnamese food in New Orleans! My favorite entrees are the Pho Spicy","useful":0,"cool":1},"F6facN-nRGEY_YLv02xFyQ":{"text":"Friday was an early day at work for me, so I headed Uptown for some Vietnamese grub with m","useful":2,"cool":0},"SNg7DDX7StzxARPEowQw6w":{"text":"Loved Lilly's! Easy to spot cafe, bright purple with tons of plants in front. Came for lun","useful":4,"cool":4},"-O8Y9EV0GeWbkN5UviJZAA":{"text":"Our favorite neighborhood spot! Always delicious always fast and always great service.","useful":1,"cool":1},"LMJ6J9l_wLOJNbDJ0Xp6tw":{"text":"Lilly's cafe is absolutely charming! The exterior is eye catching with its bright purple p","useful":2,"cool":2},"5fUe0YTSSoLpV2PrwkJxMQ":{"text":"Probably one of my favorite restaurants in NOLA! Great service and food! Cozy designs insi","useful":2,"cool":2},"KEpm_tNxbR2z7jI6g9qbrw":{"text":"I'm always hankering for good Vietnamese food and relied on a yelp search to lead me to a ","useful":2,"cool":2},"UT_zpaXQo2YFajK8SeZ0uQ":{"text":"We came here on whim because we liked the area and we were craving something different.  T","useful":0,"cool":0},"q25S_PqabYkljYZCri3gcA":{"text":"I can't believe I've never written a review for Lily's! My husband and I have been eating ","useful":0,"cool":0},"36yeeOZp62vUuqHHeekVyQ":{"text":"Being from the Westbank, there are not many great options for Pho but I do have a favorite","useful":1,"cool":1},"z5SNUPIX3FslR9oLbcTgSQ":{"text":"Great great great! We were in the area, my daughter was in a Crab Rangoon mood & I can alw","useful":1,"cool":1},"bk01Taq6VGKonI2qdU2joQ":{"text":"I tried this place last Tuesday. Note that this is not an all vegan establishment. Got the","useful":3,"cool":3},"uzXjuy-S7a_04fLFDdBiGA":{"text":"We finally came back to Lilly's after two years of accidentally stumbling upon it on on wa","useful":0,"cool":0},"THyyAATF2ocTrSZy7JxGfQ":{"text":"This is the place to order from of you are in the area! \n\nOrdered here on a whim the first","useful":1,"cool":1},"WUnf5coVW6iZF3_gUIbInQ":{"text":"Some of THE BEST vietnamese food I've had in a long time.  The service was fast and friend","useful":1,"cool":0},"fbjD2CpvyGVmUz7rTbMS8w":{"text":"Amazingly delicious Pho, served with a smile, fast jasmin tea refills, & a sparkling clean","useful":3,"cool":2},"pMs4X1E0Y8KkU9qbLvFkgw":{"text":"The pho here is really good. The broth is super flavorful. I've had the pho dac biet twice","useful":2,"cool":1},"zpoHMgEX1CFY_MIo7Wqv7Q":{"text":"I had spicy summer roll (not spicy at all), grilled pork summer roll, and combo beef pho. ","useful":1,"cool":0},"6Nos22IPhJoJP4yQRO3EXA":{"text":"OMG! Delicious!  Probably the best Vietnamese food I have ever had. And I eat a lot of it!","useful":1,"cool":1},"rypXgDdjHQLzbjGpiByokA":{"text":"The food is authentic, fresh and always plenty. This is the BEST pho around. Mind you, the","useful":1,"cool":1},"1fOwVMoIiFbHeuOkCTkc5Q":{"text":"I got sick after eating the grilled chicken banh mi. It did taste slightly off (not enough","useful":2,"cool":0},"1jU7mdAt25PKZ5Tme-NfJQ":{"text":"Yes yes yes! \n\nThe best pho in town. Amazing flavor, temperature and customer service. I h","useful":4,"cool":1},"O3IbNHWAVuFMjXEkaS7OSg":{"text":"The staff was friendly, and attentive. Love the decor of the shop. The viet iced coffee & ","useful":2,"cool":0},"xsmFO-_cHm3LUVMareGTUQ":{"text":"Delicious food & amazing service! Beef pho broth was exceptional. Would recommend combo ph","useful":1,"cool":1},"x6iHFFOfqeFTKi2nsGujVA":{"text":"Absolutely amazing food. Service was so friendly and welcoming, will be returning very soo","useful":1,"cool":1},"_iF6EVyKl-YKbqyCPzPbtQ":{"text":"Vegan pho and bun bowls? How can you say no to this place!?!?  \n\nI came here earlier today","useful":3,"cool":2},"hFbqeiHm9cEMfbEc_FjDbA":{"text":"I really wish I enjoyed this meal more than I did. I believe the over hype gave me higher ","useful":1,"cool":0},"oAYgTnpPqGZEcwbGRMInOg":{"text":"Simply da best! Always fresh and delicious! The menu keeps evolving with addition of some ","useful":1,"cool":1},"dxsehrp51cxqa9DKVBxVMg":{"text":"We LOVE Vietnamese food and we are always looking for the best in each city we visit. Lill","useful":2,"cool":3},"Gq4HkJ3SCd7DCaAN0vhwzA":{"text":"Pho-get-about-it, Lilly's Cafe is some of the best Vietnamese food in town. My go to is al","useful":2,"cool":2},"Rt5-_ZzCdFuoh7aUk6tzrQ":{"text":"Fast friendly service. Boyfriend and I both ordered the pho and the broth was excellent. W","useful":0,"cool":1},"ygxVIEHrZW_mKee4wk77AA":{"text":"Holy cow. The spicy shrimp bun with added egg roll is one of the best things I ate in New ","useful":3,"cool":3},"RbHXnu0HpGlsz3Dgo-MQ8w":{"text":"Top notch - great service, cozy place, GREAT pho! I've been here twice on my week long vac","useful":4,"cool":1},"jdqeLcAJEejMRyCpsshw2w":{"text":"My friends and I were in NOLA for my friend's bachelorette weekend. We were on the hunt fo","useful":1,"cool":0},"NtWIKdK3VpxGhFp2uax_rg":{"text":"I'm sure their food is good but I wouldn't know because they aren't very good about answer","useful":1,"cool":0},"ly229pSYX4zj3-td7DdB3g":{"text":"**the perfect hangover cure after a long night in Nola***\n\nI really had to go into Lilly's","useful":3,"cool":5},"nLKPEFEk8s0U265fV4GJxA":{"text":"Great Vietnamese food on Magazine street. Went there for lunch based on the great reviews ","useful":2,"cool":2},"SdaJQGvVgTeeW0ioHCPk7Q":{"text":"There is so much I could say about Lillys Cafe, but I'll say this. If you pass it without ","useful":1,"cool":2},"_CRncno7bMi5NDs4ar-ZTw":{"text":"Everything was decent except for the fact that I clearly asked our server if their fruit j","useful":1,"cool":0},"GCNjba4vo7JxdnGSh6I-Yw":{"text":"My husband and I LOVED this place! The food is so good, the portions are generous. It look","useful":1,"cool":1},"YzAePcQMB33DFk-iEdlO_Q":{"text":"You can easily get here off the 10 or 11 bus line. Got dropped off almost right in front o","useful":2,"cool":2},"Zw2BnNnehX7fuAlQO0DLMA":{"text":"Fantastic Vietnamese food in beautiful cafe setting. We Followed the menu suggestions of L","useful":1,"cool":1},"Xdg6nA1LAeqCU5rPwV1Jeg":{"text":"Okay so I went back yesterday and ordered the spicy tofu bahn mi... OMGGGGGG I was blown a","useful":0,"cool":0},"8-uqJSrPhefyMQtJE5nZAA":{"text":"I really would have enjoyed this with my family if I had been given time to enjoy it. We a","useful":0,"cool":0},"2RyOwPcebdAOV9FiCHc93g":{"text":"Been here a few times, the food is great. The service I received on my last visit, however","useful":0,"cool":0},"x3awxsAoxzXRRsE9x0HMHg":{"text":"OMGGGG \nDoes anyone else lose it when a place they have had favorited  for FOREVER lives u","useful":0,"cool":0},"doROz5bGG7DLCqPN2u5jJA":{"text":"Literally the best Vietnamese place in all the greater new orleans area. This is always th","useful":1,"cool":1},"AJWAJTVQXcCqARU9dlyUDA":{"text":"Excellent food and quick service here! The vermicelli spicy pork is awesome. It's loaded w","useful":1,"cool":1},"aE4SJ8somD4GYSitRhpnQg":{"text":"The spicy tofu is amazing! If you think you don't like tofu, this is the one to change you","useful":1,"cool":1},"VroLUINQu1JawYj9TRmQWQ":{"text":"Great pho! Quick for lunch and affordable! Well 100% go back!","useful":0,"cool":0},"D__vkhH6X2wEBH2g3evamw":{"text":"All the vegan folks in New Orleans probably know about this place because it is a staple r","useful":7,"cool":2},"tDXNQ6eLH4hYr0aScvSFmA":{"text":"Love Lilly's cafe! Their pho always hits the spot, especially on cold rainy days. I also r","useful":1,"cool":0},"k3wfbtu2ADrDmKkLPTZRpQ":{"text":"I was greeted and seated right away for a Friday lunch. There were guests at only 3 tables","useful":0,"cool":0},"w1uaIqKw0y5CLXQG3k3ojw":{"text":"Cheap delicious food. Great for takeout!","useful":0,"cool":0},"Qe19-ZizPlpEAVe8jhnIag":{"text":"Lilly's is SO good. Definitely seems like a local/in-the-know spot which makes it even bet","useful":0,"cool":0},"q2GAJvMEbO0G6MQopM-E_A":{"text":"Lilly's is my go to takeout, and it's the best! They are always polite and repeat my order","useful":1,"cool":1},"pTUxyieHTPeMgtm5MFG56A":{"text":"I love Lilly's! The best staff and the freshest vegan pho! I love their spicy tofu dish I ","useful":1,"cool":1},"tslhqU7TnOj7JlRLvLhvSg":{"text":"Love love Lily's it's such a great atmosphere and the food is always consistent. Lily hers","useful":1,"cool":0},"E7T1TtCNT7opAHDMmfL77g":{"text":"This was our second visit to Lilly's.  The last time we were here was 5 years ago.  Food w","useful":3,"cool":3},"I_qUeJVKfjc2Va2c60Rtjw":{"text":"I just tried Lilly's Cafe for the first time, and I think it's just earned a spot in my re","useful":4,"cool":5},"xRlOg4gt4HESSh8Zt37FjQ":{"text":"Great food, very enjoyable staff they really make you feel at home and comfortable!! Large","useful":1,"cool":2},"ua5Zn8CPNxl0_bbLk3g5Zw":{"text":"This place was dope and the service was awesome. I personally feel they could stay open la","useful":1,"cool":1},"wm18d2e5kCs29rSAorOSFA":{"text":"I was very skeptical about this place because most reviews are by non-Vietnamese. Most Vie","useful":8,"cool":6},"D9Kz6g-WmrjbpCSExMApzw":{"text":"Excellent food, relaxed lunch atmosphere, and variety of healthy/vegetarian/vegan options.","useful":1,"cool":1},"BkDXXy3imvygH3tcUu7SBg":{"text":"Loved our dinner experience at Lilly's! The pho is phenomenal and Lilly herself waits on c","useful":0,"cool":0},"3v-uCnDDmuVuj4p_2X_mPg":{"text":"Best egg rolls ever. And my son who has many phos, said the chicken & Vegie pho at Lilly's","useful":1,"cool":1},"14PgPrX3iBuAC2cmIvGfcA":{"text":"Always good. It's one of my goto Pho restaurants in NOLA. Staff is GREAT and service is qu","useful":0,"cool":0},"AePbVRoyYFhiPdbihjbXhQ":{"text":"Absolutely one of the best pho experiences I've had so far. I had shrimp pho and the flavo","useful":0,"cool":1},"lIdL9d4O0MwTMHjxcJKjCA":{"text":"Ordered the spicy shrimp and aloe juice. Totally delicious, everyone loved the food and th","useful":1,"cool":1},"0fd1nx8kIC8vHhOA8UHEZQ":{"text":"Came here on a cold day in New Orleans. I was craving pho so I found this location on yelp","useful":0,"cool":0},"wqYX5WaIhxmN36-0B7bj1A":{"text":"Two years 2-3 years ago I came here for a conference and stumbled upon this gem. This time","useful":2,"cool":2},"EXAJGHj2qRPyN3UMxHC2JQ":{"text":"We can never get enough of Lilly's!! When I told my daughter we were heading to Lilly's fo","useful":0,"cool":0},"yOtaxkUCbRre3m8bQVDAXg":{"text":"I loved this pleasant little hole in the wall on Magazine St. I normally can't eat much at","useful":1,"cool":1},"6wCZvvlNjtfaU_p62nUaHg":{"text":"VEGETARIAN OPTIONS; & interesting pairings, like strawberry avocado spring rolls.\nFRIENDLY","useful":2,"cool":2},"nlwKzR5muPnYslJffXG1BQ":{"text":"Best pho in town! The owner is such a sweetheart, the staff are always really nice, and th","useful":1,"cool":1},"3DFHqiYyZCbS7QdPCnsWJQ":{"text":"Love it!!! So I've never actually experienced table service at Lilly's, I've only ordered ","useful":2,"cool":2},"xGink51eB5NYtr5ngYqYbQ":{"text":"What can I say, I know I'm not in Bolsa, but good Vietnamese food is good Vietnamese food ","useful":4,"cool":3},"YFS1xUbZDbRJlwpSHiie7w":{"text":"Waited 10 min for my change. Crab Rangoon's were just cream cheese no crab flavor at all. ","useful":2,"cool":0},"m8HuO_5YuRzNsUTJoJghmg":{"text":"Ambience was great. Neatly decorated inside... Food was great. Service was welcoming and f","useful":1,"cool":1},"FDZn-lOnZDp4E3-Eux2sDA":{"text":"Get the Thai tea, spicy tofu, and shrimp pho.   You will not be disappointed.   The broth ","useful":1,"cool":1},"ad2c2VkG3yczStTo6z9bAA":{"text":"I virtually gasped when I had my first sip of their pho broth. It was a perfect balance of","useful":3,"cool":2},"d1P0LDskbcqKyArsMHyLYg":{"text":"I'm vietnamese, I'm was going to Vietnamese restaurant, I see Vietnamese and I speak Vietn","useful":3,"cool":0},"FTDGzYfPMXaxdcg_o8KlKg":{"text":"Okay wow\nOne of the best in nola / anywhere\nIncredible vietnamese food, kind and knowledge","useful":1,"cool":1},"EgrAAjgppepusFqmLEImXA":{"text":"This place is the BEST! \nAfter struggling to find a restaurant that was open late on a Mon","useful":2,"cool":1},"JQw0zNGMu6_Z8ncd8u7TeA":{"text":"Delicious well-needed food! A group of us ate here our first night in NOLA before a confer","useful":1,"cool":1},"Ou2sBCdPElSPPhij2PRAUA":{"text":"Great spot for some pho great service price kinda high but when a tourist area that's what","useful":0,"cool":0},"06KPEeEuygQiX0TO5xmisQ":{"text":"Cannot wait to experience this adventure with you SPENCER FITCH!!! \nAdventure awaits us...","useful":0,"cool":0},"q1h8IvfZop6FQrByBN4lNA":{"text":"Always the spot to go! Pho broth is so good you don't need the hoisin or the sriracha","useful":1,"cool":1},"rw6m9xuAf0ksxuWljpe2WQ":{"text":"Freshness you can taste. Spicy tofu bun for the win. The space is bright with a nice level","useful":1,"cool":1},"PKIkhTHvRfNvMtwVMHScVw":{"text":"We stopped in for some Pho to warm us up on a cold January day.  The reviews were good and","useful":5,"cool":5},"zLIt9PyUEm7kXYNWqJ2tlA":{"text":"We traveled to New Orleans from Virginia and one of the first places we went was Lilly's. ","useful":1,"cool":1},"tDhiIZd4pcwG6HMywoVOsQ":{"text":"I had the Pho it comes simple with no tripe. Very basic Pho spot not that impressive but I","useful":2,"cool":0},"FCtZGvlTgMKCZZRrhMmcGw":{"text":"Came to Lily's on a Saturday for lunch. Most tables were full. I had the Shrimp Vermicelli","useful":1,"cool":2},"PRdLaEJAH73oUGMMAWz3kQ":{"text":"Favorite pho in NOLA. Not even close. Love the friendly staff, quick service and, of cours","useful":1,"cool":1},"fVAa5WbXJQNOyTyiew_NXQ":{"text":"I've eaten at Lily's several times and can say it is one of my favorite vietnamese spots i","useful":1,"cool":1},"7iOwjSxXwBbN2ZM8z3meLg":{"text":"The skin-drying cold and snowy weather (in some parts) was the perfect day for some Vietna","useful":6,"cool":2},"XgIRoxRgCdg1kS-0CvYizA":{"text":"Absolutely one of the best pho experiences I've had so far. I had shrimp pho and the flavo","useful":1,"cool":1},"botMXVM3I9PXxxKJSq9pgw":{"text":"amazing.  I live in china town in nyc and i came to new orleans thinking that i had the be","useful":1,"cool":1},"twtl9nffoBg64GAzJWS0Xw":{"text":"I had never heard of Lilly's but needed some pho and ordered it from Postmates. I have had","useful":1,"cool":1},"2eDwjyB_7LPH50DGX-ohUw":{"text":"All the food that i ordered from there so far, was absolutely amazing. The best thing abou","useful":0,"cool":1},"QUm7BDXqqr8hrNzb94zW0g":{"text":"Here's the deal.  Prices reasonable on the surface except he overpriced bahn-mi.  The pho ","useful":1,"cool":0},"sgdl262AMq1DWhABF2bmEg":{"text":"This place has a very intimate and very tranquil setting. They have great customer service","useful":1,"cool":1},"NAkHtQ5QSCr6I_uGlbnqNg":{"text":"Delicious food, amazing service. Extremely friendly and very fast! Zero complaints. Employ","useful":2,"cool":1},"_uMCr8Mq3LJ73KSbYINE7g":{"text":"This was my first time having pho in New Orleans and it was definitely not my last. Lilly'","useful":1,"cool":0},"9mOQXz9SpGx_xUucN5vL0Q":{"text":"Eat here, just do it. Always a stop on our trips to Orleans. They have great vegetarian op","useful":0,"cool":1},"6ouLcDQx7cPhDdx2N4m8Dg":{"text":"Good and cheap. I got the shrimp & avocado salad and my bf got a chicken and rice plate. W","useful":0,"cool":0},"sWRVKbqH3elPTD4OH5VqHQ":{"text":"The food is THE BOMB! The atmosphere is really homie and kinda whimsical. The staff are re","useful":1,"cool":1},"BhSKMnR8zdn2X9TSk9Rd9A":{"text":"Literally the best Vietnamese food I've ever had, and I've been to Vietnam! Ms Lilly is am","useful":1,"cool":1},"Mj_fgxSxNkIZActUrBi29Q":{"text":"Best vegan pho in New Orleans (or probably the world)!  Delicious, tasty broth, ample tofu","useful":0,"cool":0},"IXi2wbZdZdwYUUOiAvLpaQ":{"text":"I wanted to give this place more stars as I've heard rave reviews from both my coworkers a","useful":0,"cool":0},"Xk6snro3taz7bH4sFaSG-w":{"text":"Finally came to Lilly's after years of hearing about it. The pho is as advertised, great w","useful":5,"cool":5},"VNcMxuASbRSpCs1x2J9ZCQ":{"text":"I don't think a food over is good like people said. I am Vietnamese. So I know how a real ","useful":4,"cool":0},"clYqBmoVK2xXrKeXRoIhyA":{"text":"Friendly service and great food!! We were in town from Houston on our way up to Chicago an","useful":0,"cool":0},"4nffzrVlW94wdY9xINQOKg":{"text":"Friendly, local atmosphere. Our food was not exceptional. Reasonably priced, good service ","useful":0,"cool":0},"kQIMY8boFFk7ZKyY53YDJg":{"text":"The food is underwhelming in sharp contrast with the high yelp rating. If you are looking ","useful":5,"cool":3},"G8eV9juKRKF0VbSChc7M_A":{"text":"I love Lilly's! My sister and I used to go to  Magasin all the time, but Lilly's is the pr","useful":1,"cool":0},"J70ZYjDaj_74OjijknpEHg":{"text":"Besides the food being good the customer service was great! The summer rolls were fabulous","useful":0,"cool":0},"rioGWLci1X70z_19CCWuUA":{"text":"What a breathe of fresh air being here. We were here for a skincare convention and got tir","useful":2,"cool":2},"wOerRvsKcVZNPWMtWbkVxA":{"text":"Spicy shrimp pho. Add some chili oil. It's so fragrant. So delicious. Good bang for the bu","useful":12,"cool":6},"QnB4orwAYKaBNI5HQrfhVQ":{"text":"Lilly's had great food, and very friendly owners.\n\nOne night when I was working late, I de","useful":8,"cool":5},"EgGMJejqejMMeVM4jZiISg":{"text":"Great find by a friend in the mood for some inexpensive Vietnamese food. The vegan pho was","useful":0,"cool":0},"eViGPhiAwzB_ksC2Id_04w":{"text":"amazing vegan options + friendliest staff around = awesome place to get your tofu on\n\nMy b","useful":3,"cool":1},"S9QoKxrziszEMBjnz3BjYA":{"text":"Fantastic food! I'm a vegetarian and my husband is a carnivore and we both find amazing me","useful":1,"cool":1},"w6q7PvPrFgUrptpICGLhHg":{"text":"Me and friends were in New Orleans for Christmas, and we just wanna eat some pho noodles. ","useful":2,"cool":0},"Sb2BkO7isT7hcMO7rOliZA":{"text":"After hours of disappointing roaming throughout the city and not knowing where we were goi","useful":1,"cool":1},"Wi-OoUz0YXWgREeeCIgXqw":{"text":"The real deal! Wife and I enjoyed great pho and egg roll. Very nice service and patronized","useful":1,"cool":1},"nXZXfPnjU1wnsERX3_Z_Wg":{"text":"The only place to go in town for amazing rare flank pho and terrific service. They tend to","useful":2,"cool":2},"A63c0zPrw5yxjaTNInK_XQ":{"text":"Best pho I've had in the area. Very nice people, very clean place. Good service. All aroun","useful":1,"cool":1},"yET8igut2i9NzW88k8sdgA":{"text":"Everything is awesome food is great and this is hard cause I just think it's the best ever","useful":2,"cool":2},"nFjIK4EDX6_mZqHZJKugag":{"text":"Visiting NOLA from LA and couldn't eat another fried bite. The kid found this place online","useful":4,"cool":1},"V3uy-WTTydixmZYTSNPmiQ":{"text":"Lillys cafe is one of the most reviewed and highest rated Viet places in NOLA and i can se","useful":6,"cool":5},"MxKd_LtersLbCh5wvt1Jfg":{"text":"To be fair, the food actually tastes alright, but it really lacks the \"authentic\" flair th","useful":0,"cool":0},"t82NrVYFRLOzXhmV-VPqaw":{"text":"I'm a west coaster living in New York and I can say this is the best pho I have had in a l","useful":0,"cool":0},"DOzMQtzSlA401kT20QIfzA":{"text":"The food was really good, my only complaint is that everything was really oily. Including ","useful":0,"cool":0},"5LVcj8mQ63SkWMo2Vfp7_A":{"text":"Big fan. The vermicelli bowls were absolutely delicious. They were accommodating with food","useful":1,"cool":1},"CHp5sj4yfAv5ERi8wGktsA":{"text":"5 Stars for Lilly's !!! \nTried and true for really good Vietnamese food! \nI stopped in to ","useful":4,"cool":1},"k9W1MMsil3NF44MqDteDcA":{"text":"The service is awesome - the staff always gives great suggestions. The menu is extensive s","useful":1,"cool":1},"PqGFYVxGbDmaddQTYN4K9A":{"text":"I went to NOLA for a while and having eaten so much fried foods, I had needed something th","useful":0,"cool":0},"kXIAqKu2xZdwrvtuxAcPPQ":{"text":"Delicious Food! Got a Watermelon tea with tapioca pearls that looks like a slice of waterm","useful":0,"cool":0},"JL_8aHvSL77If3NO96Qj2w":{"text":"Lilly's Cafe is a Viet restaurant in NOLA, on Magazine street.\nThe pho has a good broth, t","useful":8,"cool":12},"SieGiiqVRIJMuVq2-C9EEg":{"text":"I have been DYING to try this spot for what feels like years! She had closed down for some","useful":2,"cool":0},"b7tx7slPus2QU4yIu9yUZg":{"text":"I don't usually write reviews but this place was so cute! Some of the best pho I've had in","useful":0,"cool":0},"IGVQGSx4j7_tBtxbUjfWhA":{"text":"I've met the banh mí that I want to marry and live happily ever after with!\n\nI shamefully ","useful":18,"cool":13},"MzFa6JQ-zTCBWXo1qP57Xw":{"text":"Love the area and food!  We were tired of eating heavy southern dishes, so what do we do??","useful":0,"cool":1},"2nSfHSRL1PWlnj4YDsSKKw":{"text":"Nice place. Friendly staff. Pretty busy when I went. Interior looks nice. Food came out qu","useful":0,"cool":0},"nCJKu5tA-pud_j8NDnXeMw":{"text":"This is my new neighborhood Vietnamese restaurant, and I couldn't be happier about it. I w","useful":5,"cool":5},"MHDcB49Rrk2Ut-96eSopnA":{"text":"We came here the day before they closed for the 4th of July week and the guy there was rus","useful":1,"cool":0},"Pqx8OE2njqitipg_kxIYLw":{"text":"If I lived here...I'd be the healthiest fatty ever!  SUCH GOOD FOOD!  And at really afford","useful":1,"cool":1},"80JihgDGmOxCfmmaXaAMug":{"text":"New Orleans is known for their large Vietnamese population -- so you know its going to hav","useful":4,"cool":4},"RoJzuUuwcggcW7PaQv_c9g":{"text":"The owner was our server, she's was extremely friendly and quick service. Good food. Place","useful":0,"cool":0},"ESTSPOWuajOLz8iH_BhrBw":{"text":"Authentic pho spot run by the Vietnamese! Their broth was on point. Definitely did not hav","useful":2,"cool":1},"EBJgeKLiwkZ2zpWAymbDSA":{"text":"Updated review from COVID times: I ordered to go with a few of my coworkers and when we we","useful":4,"cool":3},"8s5jMyATBW8FylXmteG1BQ":{"text":"I absolutely love Lilly's. Like...probably the best pho I've ever had outside of Vietnam. ","useful":0,"cool":0},"90kSN6WbP9RlOkuGO0pFBA":{"text":"I had the summer rolls and Pho Tai. It was decent, but far from good pho. The service was ","useful":2,"cool":1},"Xhf31xK_LtesfsofslvUcQ":{"text":"As a military veteran that travels often & have lived in different places... BEST PHO hand","useful":0,"cool":0},"cET116GDCAOKEUJnhEvRCg":{"text":"This is my favorite pho in the city.  Now that winter is finally here, I find myself eatin","useful":2,"cool":2},"y7uLUTuzMcexv5AwVoxTfw":{"text":"Cute little spot for lunch! \n\nFood:\nFor appetizers, we ordered Spring Rolls, crab Rangoon,","useful":1,"cool":1},"mYxFFVbqu6Y0--8nathXzg":{"text":"My friend and I needed some Asian food during our NOLA trip, and this pho hit the spot aft","useful":1,"cool":2},"4ljRWpooIGSV7wOilTyNOg":{"text":"The spicy tofu appetizer is so good I had to put it out of my sight to avoid finishing it ","useful":2,"cool":1},"yF5Udc4iR0nyM17IHR0k_g":{"text":"We retreated to Lilly's when the arctic tundra moved into NOLA and we almost froze to deat","useful":1,"cool":1},"jdBXKWV3um-7qIM5glCgpA":{"text":"Lilly's Cafe was my first meal on my recent trip to New Orleans. My girlfriend is a huge f","useful":3,"cool":2},"FGv-1uDS2RKgb3i5ImZcxg":{"text":"Started off a little shaky. Weren't acknowledged when we entered the restaurant, gave them","useful":1,"cool":1},"lB8BSd8WRElHCLRdIerWKQ":{"text":"Hands down the best Pho in this town! I've tried pho from a lot of places in search of the","useful":2,"cool":0},"UYE48_UoKjDTR8mWsR1U4g":{"text":"Out of all the new Vietnamese places that have opened on Magazine recently this is by far ","useful":11,"cool":5},"TSEAYFvW83stfc8dTs5Png":{"text":"It was my first time at Lilly's and I loved their chicken pho. The broth and the chicken p","useful":4,"cool":4},"7IL4rmUBZw0Y-06dfpz2bg":{"text":"Tonight was my first time dining at Lilly's and it did not disappoint! I had been waiting ","useful":3,"cool":1},"6hHO1TYqUFMifGRdxICYvA":{"text":"The food is good but Lilly does not take good notes when taking orders and we ended up bei","useful":0,"cool":0},"tpuMl_Xs2DT_2siH2PqZHg":{"text":"Lilly's pho\n\nSo a lot of people ask what is pho? Pho is a popular Vietnamese noodle soup m","useful":3,"cool":4},"DypENphn_obwE3gS0jLcxw":{"text":"The tofu pho is packed with vegetables and is SO flavorful (lots of onion, scallions, and ","useful":1,"cool":2},"CMMUpTGm7o8HdP8iKL3iSQ":{"text":"Ooooh yummy!! My neighbor took me here impromptu and I loved it. Had the pho of course. I ","useful":0,"cool":0},"zjSLcP3VCUQkTnwUzrVjLA":{"text":"How have I not written a review yet?\nOn a general Vietnamese level, Lilly's gets a 4 star ","useful":3,"cool":2},"Tk9-LIfSdXyVJUxL-dKTnQ":{"text":"I was just about to add an extra star . . . until I saw LC's incredibly unprofessional res","useful":3,"cool":1},"na55G7u3NlAlx3rFAvXZPQ":{"text":"I think we did it wrong. In a city with the highest concentration of Vietnamese folks in t","useful":18,"cool":5},"QVR2OW0Ppr4BFjd8ffWxbg":{"text":"Came to New Orleans for a bachelorette party. We were craving pho and came here. Good food","useful":1,"cool":1},"MNfWun8XV0DmYkHMGnFCpQ":{"text":"Legitimately have no idea how I haven't reviewed Lilly's before!\n\nOf pho broths in this ci","useful":16,"cool":15},"IFBO1LNKfmWRhcrhVWp11Q":{"text":"Great soup. I went here with some friends pre covid. It is very small. and cannot  see how","useful":0,"cool":0},"UorRIRV3nahY_irjixO6TQ":{"text":"Lilly's is my favorite spot to get Vietnamese food in the city. My go to are the rice dish","useful":0,"cool":0},"ctcFxFEQt61PuVI03NoPNA":{"text":"Overall food is subpar. The brisket pho was the highlight. Meat is seasoned well and broth","useful":1,"cool":0},"5OtOIETXEgUPt9lKNZSvkA":{"text":"If I could give this\nPlace zero I would. There was roaches everywhere all in my food. Aske","useful":1,"cool":0},"WfhC4YrwZrbCYAUmveFRLw":{"text":"One of the things I wanted to try in New Orleans was Vietnamese food. As a Vietnamese-Amer","useful":8,"cool":5},"_870iP_Sd_S44v7USYWkTA":{"text":"Great food. Great atmosphere . Great ice tea. Lychee is my favorite. . Our waitress(owner)","useful":0,"cool":0},"AbiwkJd-uCoEk2D6WFOohQ":{"text":"Came here for a late lunch yesterday. The high reviews brought me here.\n\nFOOD:\nThe soups l","useful":2,"cool":0},"RGR9CmONhnkEKFzrsP2yCA":{"text":"After a few days of fried food, I needed a diet cleanse and was happy to discover this pho","useful":1,"cool":0},"UwJU8T7NjUpYLj7k6AGHHA":{"text":"Great lil spot for pho! The pho was great, and really enjoyed the rich broth. I had the fl","useful":2,"cool":2},"LOQR6xvfaxozxNHR23nVuA":{"text":"Average, average, and average.\n\nI don't understand where the hype derives from. Perhaps it","useful":3,"cool":0},"NU-lsf61w3L8S49esPdfhw":{"text":"This place has really really great service. Lilly comes around and asks people how they're","useful":1,"cool":0},"Wfkcwma35erLtO6t5jy6Vw":{"text":"I discovered Lilly's Cafe in Yelp and Urbanspoon and am thankful I did! I've been there th","useful":10,"cool":8},"qae7u7Csr1VoqyhZ46zzbg":{"text":"Only have had Pho twice.  After today I hope ever other restraunt is half as good.  Wow.  ","useful":1,"cool":1},"OceExbFnoqMrgNslDhvNiA":{"text":"***Check my photos for their petty response*** \nSave you're money. Don't support these peo","useful":2,"cool":0},"YCicwn3H7AJYZtIuwRXUmg":{"text":"Although I've had better Vietnamese food in California, Lilly's Cafe is probably the only ","useful":1,"cool":0},"0MFUAZ2eSRbgTSb3IvNpYQ":{"text":"I'm sad that the experience my group had here was nothing like all the glowing reviews tha","useful":7,"cool":2},"uN8b-Y5D4Ibp335ogGbsQg":{"text":"Lilly's is truly amazing. What a sweet spot, right on magazine in Lower Garden District, l","useful":7,"cool":6},"_Y4Zurl5mMe73djF9AYpGg":{"text":"I think Lilly was our server... or she was near the counter. I didn't get their  names, bu","useful":2,"cool":2},"0moi_2oYkm4QJ_caWbwhSQ":{"text":"Had a quick work lunch here and enjoyed it! \n\nI ordered the spicy shrimp and rice and it w","useful":1,"cool":1},"GkvNTaSrFIl8pHVHo_uhiQ":{"text":"phở. bún. cà phê đá. all the food was wonderful. the atmosphere was lovely as well  :^)","useful":0,"cool":0},"SRvSkgbFz-mhR8idHwoEwg":{"text":"Lilly's has the beat pho in town. Seriously...the broth is unlike any other. Plus they're ","useful":1,"cool":1},"mprYYQPspr4j8UTovjmeag":{"text":"Hands down my favorite lunch spot. Spicy tofu is to die for. So insanely delicious!!!!!!","useful":1,"cool":1},"AFC01zvGiHdESlb21mA6CA":{"text":"We try to eat Lilly's once a week. YUM! I can't go past chicken pho and my husband can't s","useful":1,"cool":1},"cud9tj91H3SgiFv3GbuIOA":{"text":"Lilly is as awesome as the food is!  No tripe or tendon options but broth is amazing and h","useful":0,"cool":0},"VsO_7C64XuXHoE6jgFAqPw":{"text":"I stopped in to grab a watermelon tea and ended up dining in. The food smell so good o has","useful":1,"cool":1},"72c4KrOSIwbAqcObh0T4qQ":{"text":"Very fusion Vietnamese.  Not the authentic vietnamese that I was hoping for.  But the food","useful":0,"cool":0},"CM72VJlcSXxw8_hgJ24lYA":{"text":"There is a lot of weak flavored vegan pho in the world, but Lilly's is the best I've tried","useful":1,"cool":0},"E9EOA58cBNRiKGVAOlzu1w":{"text":"Recommended by a friend, she said it is the best pho she ever had! We ordered a combinatio","useful":1,"cool":0},"CxQv6vOh2ClylSTAEyGzYA":{"text":"I've worked across the street from Lillys for years and have eatin here 3-4 times a week. ","useful":1,"cool":1},"Lbyohb4sAqtFoZMvBsvAqw":{"text":"Terrible customer service and argumentative manager. Instead of fixing a problem she decid","useful":5,"cool":0},"CmI0XKD07FoLbdkzMHrITg":{"text":"The pho soup was overly salty. The service was ok to my table. But I saw an Asian guy alon","useful":0,"cool":0},"ycauWV1tKfEarK6Zxw_DOA":{"text":"The service was great even in a noticeable crazy rush because of the temperature. The food","useful":1,"cool":1},"5Z5J6C42L4jsKCYdp5LXLw":{"text":"Delicious food. Great price. Get there well ahead of closing time because they stop servin","useful":0,"cool":0},"Fxzc6huFOAB5GsSHuVIlrA":{"text":"Lilly's is undeniably the best pho in town. \n\nI started eating here while in medical schoo","useful":1,"cool":1},"9S37ehbPEZOsWxC3xVgFkQ":{"text":"If you haven't been to Lilly's, you're missing the best pho in town. A causal spot in the ","useful":2,"cool":2},"f9kuJvzWC2a36etXRbct_w":{"text":"Lilly's is such a good neighborhood Vietnamese place. Everything is done well and done qui","useful":1,"cool":1},"3gJUQYsR3HOSva8LF4HpHg":{"text":"Hands down have to say my lunch experience was pretty disappointing. Sat down with my girl","useful":0,"cool":0},"tWWDyK5sWJhFAhO4vlyGCQ":{"text":"I LOVE THIS PLACE\nMs Lilly is amazing. The spicy tofu is MY favorite. Nothing comes close ","useful":0,"cool":0},"2rwhbOAd4wpc6_AkAgNP4A":{"text":"Lilly was a joy to talk with and it was the best pho I've had in my entire life. Our pho c","useful":1,"cool":1},"FSJeLDGtTnlt67pgp-RYVA":{"text":"The Phò is amazing... Delicate broth with great flavor. Highly recommend....\nThe staff is ","useful":2,"cool":2},"dR8X_ds6GrhHz9kiNFgEMw":{"text":"The service is phenomenal, the staff is SO friendly, we felt like we were being treated li","useful":0,"cool":0},"4gq9F6UEJO-u8i7ZMGMgwA":{"text":"Ugh the pho is so good. I wish it were closer to home so I could go more often (I work and","useful":0,"cool":0},"cD6elwxabExJAgYDwiCsoA":{"text":"I am a pho lover and Lilly's has some of the best pho, if not the best in nola. Fast frien","useful":1,"cool":1},"Qp5wSVjkUMBnv2GGDBJXUQ":{"text":"Let me say that this place has AMAZING food. I had the bun (vermicelli noodles) with spicy","useful":1,"cool":1},"rR_ckBvDLkn1kFAkBfvP5g":{"text":"Ordered the spicy chicken vermicelli bowl + Lilly's spring rolls. I've had the spicy chick","useful":2,"cool":1}}