{"5hjnF63R_N3od8UBvd3HhQ":{"text":"Great new sushi spot in Lakeview not to be missed. Unique tasty rolls and keto friendly op","useful":2,"cool":1},"WXpdTTl_z1H896_JE6p7Ow":{"text":"Amazing food, staff, service and atmosphere! Can't wait to go back!! Trust me, you've gott","useful":0,"cool":0},"I24CTUgrcbUnEhZNDe49sA":{"text":"I really enjoyed my experience at this sushi restaurant. Shawn, our server, was delightful","useful":0,"cool":0},"0N0Qfc5G5pCkB9GoXkPQOQ":{"text":"Great sushi, amazing service, and the fried Brussels sprout are maybe the best in town. De","useful":2,"cool":1},"_oJSaOKLYBUgaeKn7ZVrvw":{"text":"What a great addition to the neighborhood. I've had the dragon roll, brussel sprouts, edam","useful":0,"cool":0},"pOy1rOPfmNBcObXuXBocwg":{"text":"Sushi is probably my favorite food, so as soon as I saw a new sushi spot in my neighborhoo","useful":0,"cool":0},"4VuIZ8oKVYBpeXzTmEfqnw":{"text":"Amazing sushi finally is here in Lakeview. Everything is fresh and all the apps and hot di","useful":0,"cool":0},"J7gSgdvYSkmMVhnC2IcsVg":{"text":"Had a great meal at Lotus Bistro  this evening. Great selection on the menu, prices are ve","useful":0,"cool":0},"JqbEka_9NFnFivwFBF1MEA":{"text":"Delish specialty rolls. Great menu options. Wonderful service. A perfect new Lakeview sush","useful":2,"cool":1},"aaZ0lUY7lDeENNfdySRPXg":{"text":"Really good! Tried it last night for the first time and loved it! The Brussels sprouts wer","useful":0,"cool":0},"3WWwaAz4szOiN2-7nr0PHg":{"text":"Had a great meal at Lotus Bistro  this evening. Great selection on the menu, prices are ve","useful":0,"cool":0},"TKqUkAPRGirK2T8T-0DV8A":{"text":"This place is an amazing sushi restaurant. I love the strong feminist vibes with so many r","useful":1,"cool":1},"Bm6jsT-Y6DzeuqrQWhajOg":{"text":"I'm so happy this place opened in our neighbourhood. We have been twice now and all the su","useful":0,"cool":0},"ASnlpfhElK5ob4dVCNsXYw":{"text":"Ordered take out from here as a first timer at this restaurant and omg the rolls! We order","useful":1,"cool":1},"CL_5hOPLEV6_VpCxeddZTg":{"text":"A friend of mine filled me in on the goodness she found at Lotus Bistro, and I knew immedi","useful":11,"cool":10},"hzd1VOte5DNAPC8KuXnBpA":{"text":"If you're in search for a culinary climax, you've found the right place! Their curbside pi","useful":0,"cool":0},"rvE-auzumXBwlV167LXFug":{"text":"Wow! A Gem of a restaurant just opened up in Lakeview. I had a opportunity to dine there f","useful":2,"cool":1},"8atmU6xPgCpgYt8JsQDing":{"text":"This is a great sushi restaurant which has exceptional rolls!  A must try if you haven't a","useful":0,"cool":0},"oLR7hlEz-z1SgJBriv_Smw":{"text":"Went to try the \"new kid \" on the block. And I have to say everything was fabulous.  We tr","useful":3,"cool":1},"W9Qfg2IBpNAfQv_qyhujVA":{"text":"This place is awesome!! This is my second time here, although, we dined in the first time,","useful":2,"cool":1},"rrkkE6iX3MxE1UOgZxt5_Q":{"text":"3.4.21 \nSo we tried this place tonight after OTF, me, Erica, Cameron, it was on Harrison. ","useful":3,"cool":0},"WiZOEfhxidDiyuT0DbR0tw":{"text":"This place is amazing sushi, appetizers and meals\nfrom the kitchen. \n\nMy entire family wil","useful":1,"cool":1},"U9FEQm4gIW4cJpX1vXybrA":{"text":"As Betty, the owner, was explaining that she named her specialty sushi after very brave co","useful":3,"cool":1},"3NdvrbmXA7RvBa1zceCqAA":{"text":"Sadly haven't been able to dine in-person here, but the to go orders we've gotten during t","useful":1,"cool":0},"VWvNniTsm2Yen1gzr7rrTg":{"text":"Contrary to what the popular reviews are saying. . I'm disgusted by this Bistro. For many ","useful":16,"cool":0},"jnb9NoX4fDfrlXo4ECGBvg":{"text":"As a Lakeview resident, I was very excited when Lotus Bistro opened because the one other ","useful":13,"cool":0},"RyggXlYI6YQ986ng-wbo0Q":{"text":"Great ! \n\nSo happy they are in the neighborhood. It's been hard finding great sushi option","useful":0,"cool":0},"WbpgkSD1qgjqUET5oSJpSA":{"text":"Lotus Bistro was so good, especially their fried rice! Omg AMAZING! Just writing this revi","useful":0,"cool":1},"hABwZZWqz7Mt6SSL0GRnPA":{"text":"Stopped into Lotus for outdoor sushi and though the service and being outdoors was a littl","useful":2,"cool":1},"eFi-phZmDN7LEVHANnsfeQ":{"text":"This review is limited to some sides/small plates ordered to go with my Yelp event main. \n","useful":1,"cool":0},"DjWFkUn_ck7G0gArhJ2mQg":{"text":"Very disappointed on the second time around. It was good the first time I picked up. But t","useful":5,"cool":0},"sQaaitd2YRrp5A9BtlrsHg":{"text":"Pricey for small portions. Guess the owner has not heard that ever but its the consistent ","useful":1,"cool":0},"UI38EjyKA4yeb9ORGM0_HA":{"text":"I had a wonderful experience for dinner on a Friday afternoon around 4pm. Their parking is","useful":0,"cool":0},"PFUU8wU3TA5q6tb56pRQ7A":{"text":"Came here for a Yelp elite event but I always purchase something instead of just receiving","useful":1,"cool":0},"kEhozc7GOfMxU6BZf3u5jg":{"text":"Yeah NEVER Again! Terrible service. Remember the customer is mostly right. I ordered three","useful":14,"cool":0},"Nt5ywduUP5QC4utbVKtvMw":{"text":"Ok y'all, I have to say, even though I tried only two rolls, they were amazingly tasty! I ","useful":6,"cool":6},"Xv38HHkez1G-QTr87FYOfA":{"text":"We had a wonderful meal tonight.   Crab Rangoons are perfect, thin shell with the perfect ","useful":1,"cool":0},"mNLdRbQgM3-j6--WelQgBg":{"text":"omg best sushi i have had in a while!! the kimono roll and the kimi iwata are to die for!!","useful":0,"cool":0},"dvVMKouoOljwoyTqtssAdw":{"text":"Came here for dinner last night and it was great! The waitresses were attentive and very a","useful":0,"cool":0},"0FNOdg2ssKR6XBTuoQxHEA":{"text":"I visited as part of a very generous Yelp elite experience during which we received free f","useful":2,"cool":1},"H3PJk_qfh9XN1JnAs0iSAA":{"text":"My new favorite spot. \nThe food is incredible, and the vegan options are AMAZING!! \nThe se","useful":2,"cool":0},"sQGwX5JwUCEo7Wobwrn0Pg":{"text":"They're currently only allowing outdoor dining, so we kept our waitress extremely busy run","useful":1,"cool":0},"8V5HLjPR6KxLoN5CvLZmmg":{"text":"I went to Lotus Bistro the other day and ordered a TON OF FOOD to go! Right now Lotus Bist","useful":5,"cool":0},"hOFlb2ri22G4Ohef4wGbuw":{"text":"I would not order from them again. They're only two minutes away from me so I've given the","useful":10,"cool":0},"lsRARGmkXa7_-OKy4o0xsQ":{"text":"It's outdoor seating only and kind of confusing bc there is no sign indicating how to get ","useful":0,"cool":0},"pIEe-JiLEA3HqJ6O9xt7Jw":{"text":"I simply wasn't satisfied with my whole experience. I felt this strongly about my experien","useful":16,"cool":0},"N5vXqCl1Nq4f3sMAfZ0bng":{"text":"I was really excited to support a local Lakeview business during Covid and was highly disa","useful":22,"cool":0},"Egcl56vQFykbj4niK5vnVA":{"text":"We visited Lotus Bistro last week!  They were taking Covid precautions and only offering o","useful":3,"cool":1},"6YXJ5CsZr00aSGGhcltW7w":{"text":"We had a doctor gift us lunch from this place today & it was  delicious! The variety of ro","useful":2,"cool":1},"kTns4jQ4TqLnn4KCWQZnGQ":{"text":"One of the best sushi spots in Lakeview has to be Lotus Bistro! The weather was beautiful,","useful":6,"cool":5},"M-6UmEzbln21BOwsax7AZg":{"text":"Extremely disappointed in the whole meal. Just moved to the area so we figured we would tr","useful":1,"cool":0},"X_LHzB8sN51Y41ErUk7u8Q":{"text":"Amazing food, staff, service and atmosphere! Can't wait to go back!! Trust me, you've gott","useful":0,"cool":0},"ZvTX-qPl6aPsW8dIYyu5XA":{"text":"Atmosphere- inside dining wasn't open yet. We dined outside at lunch time. Not the brighte","useful":1,"cool":2},"4BxogoG4GGEPfh7COeo_bA":{"text":"Came here for a Yelp Elite event and ended up getting MORE! WARNING it is dine outside or ","useful":3,"cool":1},"zKHCDCmQ_E0FGSD0MTXCOQ":{"text":"We ordered love boat yesterday for our anniversary. Not sure if there was a change of sush","useful":5,"cool":0},"hJNGqHakzmdFD9AjIk88dw":{"text":"Unfortunately, the lady that answers the phone is incredibly rude. If you want to experien","useful":10,"cool":0},"-qPS7RMxGaemTMt-HhUCog":{"text":"In response to the comment~ I am being fair with my review.  I have no problem with dining","useful":2,"cool":1},"ATNV0BA-nrB21AjYYcKA8w":{"text":"I had the matcha tea, which isn't sweeten at all, and the Brussels sprouts. As the waiter ","useful":1,"cool":0},"5dIhmrcNEIm9hejHiGaEpA":{"text":"We order from here all the time and today I have to say was severely disappointing. The or","useful":14,"cool":0},"G7TZV6ANZqjEbYB_K1aZXA":{"text":"Great food with a super healthy menu, and it is also woman owned.\n\nI had the 3 piece sushi","useful":0,"cool":0},"0U17hXTfT8pRdkNp1FlxIg":{"text":"Came here for a yelp elite event. Would give 3.5 stars. They had outdoor seating with benc","useful":2,"cool":0},"dPT_3x2wIJLKusaradW1wg":{"text":"I ate at lotus bistro  once 2 weeks ago and  have had it 5x since very high quality sushi ","useful":1,"cool":0},"2Jy4WxMyUz_MU5JSD-T1Sw":{"text":"I've only dined here once but honestly trying them one time is all you need to get hooked!","useful":0,"cool":0},"A_BoSkfRJN1A4b8v8VYguA":{"text":"I heard about Lotus and wanted to give it a try. We sat at the sushi bar and the chefs wer","useful":1,"cool":0},"v36yMXpmYsrrEsE85FNY8Q":{"text":"Tried Lotus Bistro after hearing about outdoor dining options.  Treat to dine out amidst c","useful":0,"cool":0},"88vke-0VdhbniM5rkEbtbQ":{"text":"Super disappointed in what is advertised versus the reality. Very overpriced and lacking i","useful":1,"cool":0},"9Y55fYZmF4XBU1jftuXo9w":{"text":"Looks smaller from the outside, but very clean and decorated nicely inside. Sushi was very","useful":0,"cool":0},"ClY0TJxYbNVpYu84FwmdNw":{"text":"I had a wonderful lunch at Lotus Bistro. They offer outdoor seating now as well as take ou","useful":3,"cool":2},"_y9E1b1bWagkPJmaSMZVzg":{"text":"We have dined in and gotten take out. The food is great! The order is always correct and r","useful":1,"cool":1},"z8e4W2zqQr1B2A3WoBraLA":{"text":"Excellent sushi and fantastic customer service! We have only ordered from here during the ","useful":0,"cool":0},"IS6nQs4qYozLumHqeAteNw":{"text":"Tried the sushi dinner and clear soup. The food was actually pretty good but the service w","useful":21,"cool":0},"g-TkzhTHxK7yGTrzGBQAQw":{"text":"Lotus Bistro only has outdoor dining right now, which is understandable but it's gotten ve","useful":0,"cool":0},"6uqgdMzfXYGaBGZXbCVRQA":{"text":"Lotus Bistro is such a cute space in Lakeview! Sat outside on a nice day and really enjoye","useful":0,"cool":1},"AIOKIe_bBAUDhQ8CbY81aw":{"text":"Sushi was great. I got the West Harrison and crunchy rolls. Both were delicious. My only c","useful":1,"cool":0},"2M5g8B8txutahgQHgpviOA":{"text":"Unfortunately, this is the first review I'm posting that is unfavorable.  The door was loc","useful":2,"cool":0}}