{"gbC4fWQ2XOn04oqoFsbjQg":{"text":"Posting a whole slew of reviews for stores I hit with my Mom on Black Friday.\nHazelnut is ","useful":0,"cool":0},"gxJTMiJTabzBn6FF14bKYg":{"text":"Be prepared to think skinny while shopping in Hazelnut.  It is a small store chock full of","useful":1,"cool":2},"Ydga7pvZL7k8CLfDZkgJcg":{"text":"Hazelnut is my very favorite gift shop in N.O. and I always have to stop by when I'm in to","useful":9,"cool":7},"-ss-wYBrEBDUgE6cFb_Vpw":{"text":"Love this store!\nAmazing gifts and refreshing styles for your home.\nBryan is always availa","useful":0,"cool":0},"BHfrewnSoLjko-gnJHwSdw":{"text":"I came here just to stalk Bryan Batt (Sal from Mad Men) since I happened to be in town.\n\nW","useful":1,"cool":0},"j4wNU5F7LreQSBvP5xzU8A":{"text":"The moment I walked into Hazelnut, I was swept away to a beautiful Christmas wonderland. T","useful":7,"cool":5},"I_lqg8pRcc7rRDlNi8D0Vg":{"text":"The store is cute and has interesting finds. Not necessarily things that you wouldn't find","useful":0,"cool":0},"F0YZbeVqX8hCuDXKM78unw":{"text":"Growing up, my mother had a sort of a cringe-worthy decorating sense.  I'd come home from ","useful":5,"cool":7},"oE0petazng0x2E7POypikg":{"text":"Super cute shop!!  I actually follow Hazelnut on Instagram after seeing that they carry my","useful":1,"cool":0},"99yvko-nOmeIAjz4um6gBg":{"text":"I was hunting for a Secret Santa gift and then as I was walking around for about 3min I no","useful":1,"cool":0},"xeIRD4bQFVyLlTiUvShvEg":{"text":"Very friendly and knowledgeable staff with a great selection of items! The perfect place t","useful":1,"cool":0},"mAqNlmcY_KaIEtzyOmZcsw":{"text":"Adorable gift shop with all kinds of trinkets, serving pieces, coffee table books, art, an","useful":0,"cool":1},"5pEeQtn3aGcEOTCMY4lUgQ":{"text":"Hazelnut is an incredible store along Magazine all year round but especially fun to visit ","useful":0,"cool":0},"PfdOjb6_CpQJJGUF4x-IjQ":{"text":"So full disclosure: I really don't do tchotchkes and I mostly stopped by to stalk Mad Men ","useful":0,"cool":1},"e0DYGjJEhcPAKPgVpiicHA":{"text":"I'm from Japan and have been in NOLA for 14 years.\nMy joy is walking this area once a week","useful":1,"cool":1}}