{"ECijjjbdSpg6fEmckEUCdQ":{"text":"Newly remodeled well staffed smoothies are consistently delicious. \n\nAs you would expect s","useful":0,"cool":0},"ZXXdKsPFuYD4zEtxIO_IHQ":{"text":"As with most places, I've visited this location a few times before deciding to write a neg","useful":0,"cool":0},"SM4Ab31W_HQItRko6WtIjQ":{"text":"Every time I step foot in this place, I remember why I just go to the Elmwood location whe","useful":0,"cool":0},"R4Tmo5jD53NlJWKJVZKvLw":{"text":"Employees are great, but the manger don't help AT ALL when its a rush in the morning. She ","useful":1,"cool":1},"bHPwtrQ1jvin5oovLsR9fQ":{"text":"Well staffed and smoothies are good. However, I'm VERY disappointed in the management of t","useful":0,"cool":0},"eKxXwFrnIrA2yQph35JBDw":{"text":"Having visited several Smoothie King locations across the metro New Orleans area, the Algi","useful":0,"cool":1},"d2FLBltnglyN0YjuLw-nww":{"text":"Hey good good for good grandma to you I want her number so we have to be good to her I am ","useful":0,"cool":0},"p-pP1TNFa1RASQQcEYRE0w":{"text":"These people dont listen to your orders and are so slow. Pick another location. I asked th","useful":0,"cool":0},"_XrQwyMPLfOFN5dpjWcSnA":{"text":"Great staff!  Really friendly!!  Smoothies always taste great and they is never a long wai","useful":0,"cool":0},"GsHaY7j_dFgQyhHH308pwQ":{"text":"Smoother than red velvet. I forgot all about Smoothie King, until I passed it on the way t","useful":2,"cool":3},"NHJWcaKbuYwt_B5C2lwVmw":{"text":"The only thing good about this Smoothie King was the music I had to listen to while waitin","useful":0,"cool":0},"Qzpmx0aXUqfGoXSERN6m3g":{"text":"I've never had a problem with this Smoothie King until yesterday. First off they left my s","useful":1,"cool":0},"tfsBSjR7mUuxbVNoQI12mQ":{"text":"If there was a way to give negative stars, I would. I have tried several times to give thi","useful":1,"cool":1},"Ee2BY_bEu8htmIqJsxAPBw":{"text":"So I ONLY visit this and every other Smoothie King on Fridays when the $5 special is happe","useful":4,"cool":3},"XQ8Ho3tbVlJaNiFRvYHAMg":{"text":"Worst smoothie king, ever. Every time I order a smoothie from here, it never taste the sam","useful":0,"cool":0}}