{"Rx-Uevbx6U45lb2O0bWXJw":{"text":"We did the cemetery tour with Ren.  Highly recommend doing the tour plus REN is the BEST! ","useful":1,"cool":1},"5o5xGJzDXMfruVo3C8vGrg":{"text":"My best friend and I recently took a tour with Mike. He was awesome! Very informative and ","useful":0,"cool":0},"3Dfa5Y8FHpFTZ1B2ffeT8Q":{"text":"Karen was a great guide and all of her stories were memorable. We used two other tour grou","useful":0,"cool":1},"9Rv20NmeYQkLcsWZHRcQ2A":{"text":"Moira was out tour guide and she was great! She shared a range of information from archite","useful":0,"cool":0},"ljlKkK6uGfNvqDFrFSOtaQ":{"text":"I took both cemetery tours, and could not have been happier with my experience- -Ashton an","useful":0,"cool":0},"9h_0XnCNUqwTVbQFtbggXg":{"text":"Our tour guide was awesome! Very knowledgeable about Nola history and the cemeteries. She ","useful":0,"cool":0},"5prhmPrDV-pcHXCZTAKOsQ":{"text":"We had a tour with Ren (nickname) this morning at 11, it was extremely enjoyable. We did t","useful":0,"cool":0},"fZSKyg1QzYAVd7jUK7KOsw":{"text":"I went on a tour with Christine through the French quarter. It was awesome! Christine is v","useful":0,"cool":0},"Tdc4ixgwfNSqVg7njyJVIA":{"text":"We just did the St Louis #1 Cemetery tour with Michael Naughton. It was very easy to book ","useful":0,"cool":0},"dJMswePtiXUFEVdGxBPKxw":{"text":"I can't imagine a better walking tour than Two Chicks. I arrived by myself wanting to expl","useful":0,"cool":0},"dpO0FoaDGmPH_zkKBejhDg":{"text":"Moira was a great guide. Kept things moving. One thing to consider is to give out a small ","useful":0,"cool":0},"XAeRprXFBCcIqERGhdyA9g":{"text":"Mike was an awesome tour guide, he deserves a raise and his own history of New Orleans sho","useful":0,"cool":0},"071deW47TTpcWcH6aE3wVA":{"text":"Don't just walk, run to the Garden District Tour\n\nMy wife and I were in New Orleans this p","useful":1,"cool":2},"qYihSAvJS_SxVD_-rOeYXw":{"text":"Brothels, Bordellos & Ladies of the Night walking tour. I went by myself as a single femal","useful":1,"cool":1},"7MW61jFMEdxfzlgI1eq3_A":{"text":"Michael's tour was fantastic!!!  He was very informative and funny.  Highly recommend this","useful":0,"cool":0},"jiZbHeCANDBoOneYEKHepQ":{"text":"Karen was so great and knowledgable.  A friend recommended this company for my NOLA tour a","useful":0,"cool":0},"VVXJObrtJkvIG0NyLaWXmg":{"text":"This is my second Two Chicks Walking Tour. My daughter just moved back to New Orleans and ","useful":1,"cool":2},"Q9uHhaxrJw5-aFe2czYwSw":{"text":"Christine is fantastic! If you are looking for a knowledgeable local friend to take around","useful":0,"cool":0},"TzmNDRrDiqo3h859_CvPsw":{"text":"Our guide was a nice person and knowledgeable but not a good storyteller. We actually cut ","useful":0,"cool":0},"MOtfM5RsKLFiOgDSHNvd7g":{"text":"If you do a walking tour of the Garden District, ask for Loki. As a born-and-raised Garden","useful":0,"cool":0},"c58dNL_hpYkd73aN7fruOA":{"text":"We had a great tour of the French Quarter with our guide Karen! It was well worth it. She ","useful":0,"cool":0},"d1vsLp3awghiS16l92bbgg":{"text":"My wife and I did the Dead Sexy tour with Ashton yesterday. Very informative and fun. Our ","useful":0,"cool":0},"t67E7JSqOJFc8vsdtnNLEg":{"text":"We took the garden district and cemetery tour on 11/5 with Loki. My friend and I were so g","useful":2,"cool":1},"np9N-lxbym7PbsBaByBEEA":{"text":"Ashton was never boring, excited about us and the tour and very animated. It's obvious she","useful":0,"cool":0},"PpglXoqMCgw-4Zp4RuK1mg":{"text":"We decided to do a tour at 7 pm the night before and booked it via the website. It was fas","useful":0,"cool":1},"NZbIM1bQ6S6Fu0bbvWJyWA":{"text":"We did the Garden district walking tour with Richard, it was great. We basically covered e","useful":0,"cool":0},"lL_C9qPcQxDi78KnMdOdYg":{"text":"Loki was so incredibly Knowledgeable of the Cemetery, it's mind blowing. So educational!!","useful":0,"cool":0},"zVf1NSdscXto6xRoZluHAQ":{"text":"I've taken a couple tours of NOLA in the \npast, but was tired of the large groups.  \nSomeo","useful":1,"cool":0},"5xF9WNUMn-JVwDr-j_35dA":{"text":"Took the tour of the French Quarter and it was great. Richard was so knowledgable of his h","useful":0,"cool":0},"JH6qPaq7eC-suUw-hWN-Ug":{"text":"Totally recommend it! Took the brothels and bordellos tour on a sweltering Thursday evenin","useful":0,"cool":0},"8pVH_bfsp0xe0SMEOksZNg":{"text":"Visited New Orleans recently and had two different tours with this group. The guides were ","useful":0,"cool":0},"DMFfWDTpvWwgglfueiniXA":{"text":"I took 2 tours on my down day in New Orleans  (Garden District and French Quarter Brothels","useful":0,"cool":0},"WpgEnsi43tMyYj2xXCLVFA":{"text":"I used to live in New Orleans and never made it to the St. Louis 1 Cemetery. After being a","useful":1,"cool":0},"aoPH_U8nIG-wo6J1pL16GQ":{"text":"Did a walking tour of the French Quarter with Loki who gets all the stars for his fabulous","useful":0,"cool":0},"7I7zHjs0wO38faYzp0spPA":{"text":"We did the Garden District and Cemetery tour with Loki- it was a wonderful way to see this","useful":1,"cool":0},"gvS8QPnZASOjC_2xJeubhg":{"text":"Trese was so good! She had a lot.of knowledge and really allowed us to take our time to re","useful":0,"cool":0},"nBvDNpGjsBVeEt4mbTM1xQ":{"text":"My GF and I surprised my mom with a surprise trip to NOLA this past weekend and among the ","useful":0,"cool":0},"4a9oic0TBBjXiMggyUE64A":{"text":"We toured the St. Louis Cemetery #1 with Karen and greatly enjoyed the experience. Karen w","useful":0,"cool":0},"b0yvxKg4Rhysc0tSR753gQ":{"text":"Had an awesome tour with Loki. It was a two hour tour in the sun but he kept us hooked and","useful":0,"cool":0},"skZ7iN_We9EZnqI70xKQqA":{"text":"New Orleans' Garden District has a lot of history so we decided to take a walking tour of ","useful":0,"cool":0},"-XX7a_U36C0JpKPZ9UsKgA":{"text":"Christine gave us a great tour of St. Louis Cemetery! She was so fun and informative! She ","useful":0,"cool":0},"SbUMDGabwgnkwfVQ_7j6oA":{"text":"My wife and I were visiting New Orleans for the first time celebrating our wedding anniver","useful":0,"cool":0},"oH_ilIYkkXj3S3v_xl7bVA":{"text":"I thoroughly enjoyed the Dead Sexy tour. Our tour guide was quite knowledgeable and funny ","useful":0,"cool":1},"FSLUXIAuBuI5xbK5A92KKg":{"text":"I booked a morning cemetery tour for 2 people and wasn't disappointed. Ren was really well","useful":0,"cool":0},"R8WgVTfDjRaZycL6va06fg":{"text":"FANTASTIC company and experience! Group of 7 wanting to do a cemetery tour and we could no","useful":1,"cool":0},"LWNNoMk21D0Ue9N2MHbS8A":{"text":"First- we saw other tours. Ours was much much better. Promise. :) \n\nSo good. Even though i","useful":0,"cool":0},"2gSllTF-GQutN-VLXcUYaw":{"text":"I went on a 2 hour New Orleans Burlesque Tour! The tour guide, Ashton, was very knowledgea","useful":0,"cool":1},"48kGja0cCeuuFtQkzPyjrA":{"text":"We took the St. Louis cemetery tour with Karen. It was fantastic! She presents history in ","useful":0,"cool":0},"SIRaia-H-isv9XC6JCNuQA":{"text":"My family and I did the French Quarter tour and we really enjoyed it. It's basically a his","useful":1,"cool":0},"arh8dS-xAGu1KiEF8R7byg":{"text":"We went on a walking tour through the Garden District with Karen and she was great! Extrem","useful":0,"cool":0},"iQG9cqnGVQ_M5alUHYnhig":{"text":"We met up with Ashton today near Cafe du Monde. She led us through the French Quarters wit","useful":0,"cool":0},"xWFKKkKJngbC_A3gyg3ekw":{"text":"My friend and I visited New Orleans for the first time this past week. We love going on to","useful":0,"cool":0},"vXSWoTaLrqcFjbOW4sFvkA":{"text":"Gosh, really good tour! To our surprise the tour guide, LOKI was not one of the chicks, bu","useful":1,"cool":1},"ORn_LmJQxqCcasorG6AjDw":{"text":"We had a wonderful experience with Two Chicks while on vacation in New Orleans. We signed ","useful":0,"cool":0},"8SdkNPOAT8tcDDTFnuJdKw":{"text":"The best tour ever!!! Loki was amazing, knowledgeable and so entertaining.   I highly reco","useful":0,"cool":0},"4xYLiNiqPX60EAmD4OS9YA":{"text":"We took the cemetery tour with Christine; she was excellent!  Friendly, informative, and f","useful":0,"cool":0},"U9qA9_cPjVaOzEaD0t0uhg":{"text":"Great tour. \"Loki\" was a great tour guide. The historical insight on the Garden District a","useful":0,"cool":0},"E41BQSbnjTdE0p-RY7qaNg":{"text":"Our tour guide was Karen was amazing! She was so knowledgeable and friendly, and made it w","useful":0,"cool":0},"BOfScDWii9mRDn2yRpTMsQ":{"text":"One of the best walking tours I've been on. The guide was very personal and knowledgeable.","useful":0,"cool":0},"9H4olJCamSWiCREET05isQ":{"text":"I really enjoyed the Garden District tour I did on Oct. 3, 2016. Christine, my tour guide,","useful":0,"cool":1},"r8yrzOQRfIaDNJtIjrGYsA":{"text":"Best tour in NOLA! educational, entertaining, and so much fun!  Loki was our guide.  His p","useful":0,"cool":0},"s30q41PJdmhpa992DuztZw":{"text":"Enjoyed a really fun tour through the French Quarter with Carmel this morning.  Learned a ","useful":0,"cool":0},"UjXnGWeAlXqzZA_rIMrXdw":{"text":"August 6, 2016 my cousin and I took a St. Louis #1 cementary tour power hour with Ashton a","useful":1,"cool":1},"cI_8FMs1Wfl4qliwT4XqBw":{"text":"Amazing tour!! We came to NOLA for a friend-vacation and one person really wanted to do a ","useful":0,"cool":0},"KQ95OWRvQHwtuQncBdKfWA":{"text":"Candace was a wonderful guide for the Lafayette Cemetery #1 tour! A fantastic story teller","useful":0,"cool":0},"BC9Bfo1lzYyU54xC_hsurg":{"text":"My girlfriend and I participated in the Two Chicks tour of the Garden District and Lafayet","useful":0,"cool":0},"b6TlX2ejAc5KgvVQQe_6_A":{"text":"Each time I visit this fabulous city I try a new tour. I'm a sucker for good history and t","useful":0,"cool":0},"lQETmkPOZLTxrV042KF8yw":{"text":"Took the tour of the French Quarter and it was great. Richard was so knowledgable of his h","useful":0,"cool":0},"jgMYZh8fnVZMJ9SJ5MqJ-g":{"text":"Had a great tour with Karen learning about the history of the world's s second oldest prof","useful":0,"cool":0},"jc0TZM-x1lZL8aLKVx6xMw":{"text":"Fantastic walking tour! I did both the French Quarter and the Garden District tours and th","useful":0,"cool":0},"3gPp6hCYljKnuI7Lrb0GNA":{"text":"Amazing tour!  Our tour guide, Gray, was incredibly knowledgeable of the architecture and ","useful":0,"cool":0},"6CrXQidYfJ7Fj5ZzWxNPow":{"text":"Participated in the cemetery tour. It was cool. Learned a lot of things. The cemetery was ","useful":0,"cool":0},"kSDYfG3K7Qxrg509czymlg":{"text":"Took the Garden District and Lafayette Cemetery #1 tour on a recent visit to NOLA. Ashton ","useful":0,"cool":0},"rysyHrXTEiIYNIcB5UYh6Q":{"text":"First off, meeting in front of the District Donut shop is straight dangerous. All those de","useful":0,"cool":0},"2YinBZN6TADmLObWtWeUHw":{"text":"Christine very personable and knew her stuff. Small group and she answered all my inane qu","useful":0,"cool":0},"MFvMnoE8TZTWTklIXHrE8w":{"text":"We joined Ashton on the French Quarter tour. She was funny, engaging and incredibly knowle","useful":0,"cool":0},"5BTofr7M7FFTZuqikZwF-g":{"text":"Took the French Quarter & Garden District tours--Christine was so welcoming, fun, and know","useful":1,"cool":1},"VCAevWm2YisGYGCjzgt_Aw":{"text":"Had a wonderful tour with Ashton. She was extremely knowledgeable, sweet, and a lot of fun","useful":0,"cool":0},"hmweCuzroCBzoYXnm2hn9Q":{"text":"Such an amazing experience! I have been to NOLA many times in the past but never thought t","useful":0,"cool":0},"L4iA4NOvm3ScG3RZ-jdYHw":{"text":"Great tour!!! Did the \"Dead Sexy\" tour and Karen was our guide. Karen had a ton of knowled","useful":0,"cool":0},"XUXVJZv1Fj3zGvJ67xea9Q":{"text":"Took the garden district tour with the cemetery led by Grey who was friendly and professio","useful":0,"cool":0},"Bu_rmcfKPQZoebndFsZX8g":{"text":"Took the dead sexy walking tour with Karen. This tour was awesome. Karen was very well inf","useful":0,"cool":0},"iNlmFi_fm3tDAEpwYCAJWQ":{"text":"Our guide was Christine. She had a lovely personality  and was very helpful. We enjoyed th","useful":0,"cool":0},"PMXrdiW8wZhIvyAwPE4TfQ":{"text":"We had a great time with Christine on our tour of St. Louis #1. She was very informative a","useful":0,"cool":0},"kGEcr79Z4CfVyW6EJ7oq8w":{"text":"This is a great tour of the Garden District. We learned a lot about New Orleans' history a","useful":0,"cool":0},"mc0wi-fK--_GkdT_7k_EXA":{"text":"Took their Garden District tour with Karen and she was awesome! I was a little nervous tha","useful":0,"cool":0},"LjLmA_XMBPUIeXNsd_HEnQ":{"text":"We took the Garden District Walking Tour this morning and it was a wonderful experience.  ","useful":0,"cool":0},"cBIgrEC3rCshTTWFzt5LiA":{"text":"We took the 1-hour St. Louis Cemetery tour on Sunday morning (9am) with Robert. I guess be","useful":0,"cool":0},"2oLeQeaK2eBLL2zs9zAA1w":{"text":"Ashton was an amazing tour guide, very fun and very well informed. She even extended our t","useful":0,"cool":0},"lWvtW8dlqKG27wsUq10KDg":{"text":"I took two tours with Two Chicks Walking Tours: The Cynic's Ghost Tour of the French Quart","useful":0,"cool":0},"0PbfC7QevrTgF6ZwNE__4A":{"text":"I took the one hour cemetery tour this morning. It was a perfect length. We met in the air","useful":0,"cool":0},"IXWxtXfkiGkm3-yjUBAIBw":{"text":"Entertains and informative 2 hour walking tour. I took the French Quarter tour with Christ","useful":0,"cool":1},"KlbyPkDw7aI69DJ-7mNCjg":{"text":"What a great tour we had with LOKI. This man is crazy knowledgeable . If you end up gettin","useful":0,"cool":0},"5cwLAFzOJ2kjfWXAj-nj9Q":{"text":"Well, I can't comment on the tour because due to a mix up in registering we didn't get to ","useful":0,"cool":0},"cPKED54fPdvvVrPpNQJB9A":{"text":"2 Chicks was a great experience, small groups, knowledgeable and friendly! I booked a tour","useful":0,"cool":0},"4x5P8uy6TxHpfxgkruAg7g":{"text":"Christine was very accommodating in getting a schedule that would work for my daughter and","useful":0,"cool":0},"xCNQfTn8X-iPGIk5HHOq6g":{"text":"This was the BEST tour we have ever taken and we have done walking tours throughout Europe","useful":0,"cool":0},"ZEtvZxWbYydDYI8dgiq_tg":{"text":"We had such a great time! This was the best tour! Ren was our tour guide and he was awesom","useful":0,"cool":0},"hbG1VDTG3mTfcnWBm4c74Q":{"text":"An amazing intimate walking tour and highly recommended over the bigger groups. Our tour g","useful":0,"cool":0},"Ng5oYus5gHGeEQmt-3XOxg":{"text":"We did three different tours with Two Chicks on our trip to New Orleans and had two differ","useful":0,"cool":0},"OE63LhV4tbP1WbJecV7rtg":{"text":"We called on a whim and Russ was able to get us in the next tour which left in 30 minutes.","useful":0,"cool":0},"XrIyB-bldlXXPFxbL6LdBg":{"text":"My boyfriend and I went on a tour of the St. Louis #1 Cemetery through Two Chicks Walking ","useful":0,"cool":0},"KlElv6bKRhNoWCjgZZNQ_Q":{"text":"Are guide Carmel was prompt and very imformative on our St. LOUIS Cemetery tour.  We had a","useful":0,"cool":0},"5kW5JdDXUgw2jIjE8kLCDw":{"text":"Ren made our experience very enjoyable. He had a lot of knowledge about the history of New","useful":0,"cool":0},"01BgKO6nkteellhJsrc9ow":{"text":"My boyfriend and I made a quick stop in New Orleans for one night and decided to do this t","useful":0,"cool":0},"lTZHVGHVmgAPGMhupNEWGg":{"text":"We did the Dead Sexy tour with Richard and the Cynic's Ghost Tour with Loki during our rec","useful":0,"cool":0},"vdxh8BfQ_GY4EmSzdtmozA":{"text":"I just had my bachelorette party in New Orleans and we opted to take some time away from B","useful":1,"cool":0},"mZ4oiWroAP1XrFI1-h1L_Q":{"text":"We had an amazing time! This tour was awesome! They were super informative yet fun. We lea","useful":0,"cool":0},"7O5YmKBqlfCKkaWDXqjd9A":{"text":"AMAZING! Highly recommend. We called and booked a private tour and got 3 hours of excellen","useful":0,"cool":0},"yrEnvF_Qrx6a83ji_kILlw":{"text":"We did the ladies of the night tour with Loretta. She was lots of fun, easy to understand,","useful":1,"cool":1},"UaCgFgc-8hF7egO_V_XzfA":{"text":"We had a great tour with Loki of Two Chicks! He's 8th generation Creole and clearly has a ","useful":0,"cool":0},"fWZlx5bzcLHlxR_jq5Lq_w":{"text":"So, we're not touristy people by any means of the imagination. With that being said, we wa","useful":0,"cool":0},"4RX_li5sr2MMVgcriZstvA":{"text":"My friend and I took the French Quarter tour with Karen on Friday afternoon and were very ","useful":1,"cool":0},"1iyElxa_MFiGt3EmZD0bMA":{"text":"One of the best walking tours I've been on in years! Richard was a knowledgeable and enter","useful":0,"cool":0},"Jk1xjRbo_KyyNxvqOcVrtw":{"text":"Great walking tour of the Garden District led by the incredible guide Karen! She only does","useful":0,"cool":0},"gJthzUd31StMpVmxLT0Hzg":{"text":"Loki, def not one of the chicks, was our guide and he gave 23yr old me, and my 60yr old fa","useful":1,"cool":0},"IQUFDe_zrLCEsKoHKeOw7g":{"text":"We had a fantastic time with Richard as our guide through the Lower Garden District. He wa","useful":0,"cool":0},"xhbfRNrDcIDC0bu69I7zbg":{"text":"Took the St. Louis #1 cemetery tour with Loki earlier today, and it was fantastic. He seem","useful":0,"cool":0},"b6MBBD373eKAkAkBCzVI7g":{"text":"Great cemetery tour - even in early September when it was very hot! Great knowledge of the","useful":1,"cool":0},"OOqyB4NTdl2N3rLDr1CQQQ":{"text":"Ashton did a fantastic job showing off a city she clearly loves. Lots of beautiful sites, ","useful":0,"cool":0},"2UwYd1L_nzPlJmo5Lp8gxQ":{"text":"Loki did an excellent job as our tour guide! Would highly recommend him and Two Chicks!","useful":0,"cool":0},"I7OmHm4PnvqeBPic6ZnQnQ":{"text":"Just got back from the Dead Sexy tour. It was awesome!! Fun, informative, hilarious! I lov","useful":0,"cool":0},"eS4DuTJ4ZY9P6uroaRv9RA":{"text":"Today I took the Garden District tour which includes the Lafayette Cemetery #1 with Two Ch","useful":0,"cool":0},"31nPt_Hm67PwQWmYZ1ljrQ":{"text":"A MUST do when visiting New Orleans. Tour guide Karen was extremely knowledgeable, profess","useful":1,"cool":1},"4To6bmcVLR2t2dZuuJwdPA":{"text":"I wasn't going to take a French Quarter tour, had wandered the  Quarter several times over","useful":2,"cool":1},"yKK1EBm_I6EyNj_Eop9raQ":{"text":"Our family of 6 had a great experience with Ren doing the cemetery and garden tour. We wer","useful":0,"cool":0},"70lJXD6cWDaCOYJKRn-f9A":{"text":"We had a St. Louis Cemetery tour with Ashton and she was great! She was very informative, ","useful":1,"cool":0},"OecXmuaG37IxsO8mfUh29w":{"text":"My tour guide was not a Chick, but I wasn't disappointed. Loki is a badass tour guide who ","useful":0,"cool":0},"Cuq9JyG5qR_jtbLKABOWsg":{"text":"Great tour of the French Quarter. Two hours well spent and a family friendly way to experi","useful":0,"cool":0},"svPCM9OQSJQk8F2PQUDkBw":{"text":"Grey was an amazing tour guide! Great wealth of knowledge and really catered to the our in","useful":0,"cool":0},"ubtyHgFbpepNOds5LQMrjw":{"text":"We stumbled upon the \"Dead Sexy Tour\" and were absolutely BLOWN AWAY with how wonderful it","useful":0,"cool":0},"pitkVz7dSJcDC2K8jqDI9w":{"text":"This was the best walking tour, Loretta-Maria was amazing. She made sure our group didn't ","useful":0,"cool":0},"ZavUIzgRIfOwj88gcS7qPQ":{"text":"Great tour, our tour guide Rob was knowledgeable and entertaining.  Highly recommended!","useful":0,"cool":0},"wz9Kc57Lblp5vIhTfX_VSg":{"text":"I took the Garden District tour this week and had a fabulous time! I was exploring the cit","useful":0,"cool":0},"IJpqWKmFvVgO7IAIc_WhkQ":{"text":"Loved our tour guide Loki, as he is a native of New Orleans. Very informative and made our","useful":0,"cool":0},"LEaF-ltFezlf-Er3IbKl-A":{"text":"Informative and fun! Garden district tour was amazing and the guide was funny and knowledg","useful":0,"cool":0},"DWpT0FpczVQVw_fpLnkkNg":{"text":"We took a wonderful walking tour of the Garden District with Christine, the owner, on May ","useful":0,"cool":0},"atm_6lbhVSQCe5As_WRBGg":{"text":"We took the dead sexy tour and loved it. Richard is a fantastic tour guide, very knowledge","useful":0,"cool":0},"WKl0dksxxf-sDkFT2h1OVQ":{"text":"I was so happy with Christine and the tour service she provided. I live here in New Orlean","useful":2,"cool":0},"Zxpdc1bfLzRk1qdSPc7PCw":{"text":"What a fabulous tour! Christine our tour guide was both knowledgeable and personable to ou","useful":1,"cool":1},"gVKwIwJNilnMQnQ48HczCw":{"text":"My sister and I were fortunate to join Christine's evening tour of \"Brothels, Bordellos & ","useful":2,"cool":0},"V5XBI_w5h-Tb-2L0z53NiQ":{"text":"I took a Two Chicks Walking Tour with Christine over the weekend. We visited St. Louis Cem","useful":1,"cool":1},"ZkI-DUOj-iFpEbJhlBJQmw":{"text":"My mother and I had the pleasure of starting off our weekend trip to Nola with a tour of t","useful":0,"cool":0},"NpSRgjbSKH8-vMfY6wHB-w":{"text":"We had Loki as our guide. He is a very knowledgeable guide and very entertaining as well. ","useful":0,"cool":0},"C7gREJZeIq40pjTIYt6wgw":{"text":"Awesome Garden District and cemetery tour! Loki was AMAZING! Tons of info and great storie","useful":0,"cool":0},"TLq68W3Vi6RhN8FN19Nanw":{"text":"I had a cemetery tour with Ashton and she was AMAZING!  I lived in New Orleans for 4 years","useful":0,"cool":0},"IDFGa0MK5gt2FpxKqRnyfA":{"text":"Highly highly recommend!  Loki was the bomb... he's knowledgeable, native and his stories ","useful":0,"cool":0},"Vg2aMpdTp3VKQfz1YbpCBA":{"text":"Did the Grand Garden District and Lafayette Cemetary tour with Loki.  Loki is the best!  S","useful":0,"cool":0},"_guJ5uvk6ZkqFMmPNKCT4A":{"text":"Fun and informative garden district tour. I would absolutely recommend.  We stopped at all","useful":0,"cool":0},"o0CaUGkCgg2Q26h_P-hPXA":{"text":"A++++. Would walk again.\n\nTook the 2 hours Garden District tour with Richard. Also visited","useful":0,"cool":0},"G88S4olTktYFRUkB36KvIQ":{"text":"Absolutely one of the best decisions I made on the trip when I picked the 0900 tour with C","useful":0,"cool":0},"d6ChAp7z98mlCn6O9DeldA":{"text":"This was my first trip to New Orleans and my favorite tour. I learned so much about the hi","useful":0,"cool":0},"qtI0xZ2_-bxd57DQ_wW8QA":{"text":"This was definitely the highlight of our trip! We had Loki as our tour guide and we happen","useful":0,"cool":0},"j1uGy_vPiQTU0_9lavuPdQ":{"text":"Can't recommend this tour company enough!  Loki, our tour guide was the perfect mix of his","useful":0,"cool":0},"uBlvhTiGLX-QKmM2Pvf1qg":{"text":"We had such an awesome tour of the Garden District thanks to our guide Loki, an 8th-genera","useful":0,"cool":0},"vHhRKPmpVSDp3cElFrtXVA":{"text":"Great cemetery tour with Michael! Super knowledgeable, but also very sweet and self-deprec","useful":0,"cool":0},"ECatQDdr1aJXKe_spJivDQ":{"text":"Booked a St. Louis Cemetery walking tour through them and it was a fantastic experience. E","useful":1,"cool":1},"1rtYgx5uadpO1jx0VXOiXg":{"text":"Great tour of Lafayette Cemetery. We had Loki, NOLA native with lots of great stories and ","useful":0,"cool":0},"dNLIFBLu3Gzo_UsbljjYHQ":{"text":"This tour with Loki, our guide was one of the best times we had in NOLA. There's nothing b","useful":0,"cool":0},"bGudUj-3D3l5xuB7s_3PdA":{"text":"Grey was an amazing guide. She seamlessly blended the history of NOLA architecture with in","useful":0,"cool":0},"RFdlsKZXwdmCCnHs2jcphg":{"text":"Highly recommended! After enjoying an awesome tour of the French Quarter with Two Chicks o","useful":0,"cool":0},"hGeczdNOt8ITQzgkqS8Ulg":{"text":"We took the St. Louis Cemetary #1 tour today, celebrating my 50th birthday. It was fabulou","useful":0,"cool":0},"1WobgH1MaRPpXDfo-ShUlQ":{"text":"Had a wonderful Gracious Garden District and cemetery tour with Loki, who was quite the en","useful":0,"cool":0},"68xE9dF_KB_9fT0gPZBf2Q":{"text":"My sister and I took the Brothels, Bordellos, and Ladies of the Night tour on our last nig","useful":0,"cool":0},"mT8TJTFQFKEhKTHh_iPvLA":{"text":"The weather was crappy, but the tour was awesome. Our guide was George and he was a great ","useful":0,"cool":0},"uM5j22_7KjDnWeIPvx6Ciw":{"text":"My husband and I took a Lower Garden District and Lafayette Cemetery 1 tour with Grey and ","useful":0,"cool":0},"A6HOCFYYije9ULFGLWGQeA":{"text":"We reserved a French quarter tour for our first time in New Orleans. We enjoyed the tour w","useful":0,"cool":0},"WIN_V686u8zxVNUMTfIerw":{"text":"Karen was an absolutely amazing tour guide! She is extremely knowledgeable and our Garden ","useful":0,"cool":0},"d_YqdeYZRsDCBEUadqP9bA":{"text":"My mom was in town for a few days and I wanted to show her around NOLA by foot. We booked ","useful":1,"cool":0},"GeW691yvdol3sAYZsGolrg":{"text":"Finished two walking tours with this company today and enjoyed them completely. \n\nThe firs","useful":0,"cool":0},"YI8e4DUCG1QttXV15JnnTg":{"text":"Fabulous time! We found the Two Chicks Walking tour after an online search for my daughter","useful":1,"cool":1},"PdVMhVYvBC8ILQcgg7JgTA":{"text":"In NOLA for Thanksgiving weekend, and decided last minute to book a walking tour of the Ga","useful":0,"cool":0},"IjhEPD-79sWwNsx0JpOQIA":{"text":"We booked the Cemetery Tour during our stay in New Orleans. 45 minutes prior to our tour, ","useful":0,"cool":0},"V4N_gmd6amlm_0NsVHClIw":{"text":"Loretta is the queen of New Orleans.  Great story teller, full of facts and the two hour t","useful":0,"cool":0},"ENIo0mK4OPYo-4F1Vg1z2A":{"text":"My husband and I, along with our friends, enjoyed a very informative walking tour this mor","useful":0,"cool":0},"DYL2q6WTSMKYC2ZGysrT2A":{"text":"Highly recommend. Stacey was fantastic. The tours are small and she just does a great job ","useful":0,"cool":0},"9rAoMncxKnMEdfTn5uo7rA":{"text":"I can thoroughly recommend Two Chicks Walking Tours. I took the St. Louis Cemetery 1 tour.","useful":1,"cool":0},"n1-TMiFJ3WmW-tB1zKckXQ":{"text":"The Grand Garden District Tour, was fantastically informative and low key. Ren, our tour g","useful":1,"cool":0},"xBJ1wQx3uCmJ_g-m-A4PSA":{"text":"My group had an amazing time learning about the history of New Orleans brothels. Karen did","useful":0,"cool":0},"lLhJjaqMZvjqjZdE8i6q0g":{"text":"We've done walking tours with 3 different tour companies in New Orleans and we had the bes","useful":1,"cool":0},"sycVgYDVxVNCKnEK_eZMpg":{"text":"We had a fabulous walking tour with Loretta yesterday! She has spirit and passion and it's","useful":0,"cool":0},"IlIBvfa8uveQyW2mkkJJ2A":{"text":"We had a great tour today of the Garden District and Lafayette Cemetery. \n\nOur tour guide,","useful":0,"cool":0},"Ncw6lvm7EFA0ks53BR2S_g":{"text":"Went for the ghost tour with Loki, excellent historian and storyteller. He was factual and","useful":0,"cool":0},"yeNKV3QcIqzizL6VDar6iA":{"text":"Loretta was amazing for our family's private tour. I asked for a \"New Orleans 101\" tour an","useful":0,"cool":0},"lu3hi5N2n3MKrR48E4nPDg":{"text":"Used Yelp to find available tours of Garden District and Lafayette cemetery. Jonathan Weis","useful":1,"cool":0},"MQ-xYIaFOw_Q05U82Mkg-g":{"text":"Went on the whore tour and learned all about comfort women during my time in New Orleans. ","useful":0,"cool":0},"wzaVzFfeGgjPI0TIEzt7aw":{"text":"We had a great tour with our guide Loki - a native of the area with generations of ancesto","useful":1,"cool":0},"hKy91PPHYkT89wVrDp0rGA":{"text":"A few nights before my tour with Two Chicks, I went on a Ghost and Vampire Night tour of t","useful":2,"cool":2},"MHgYuv6WWbXa5u8A0GfiVg":{"text":"My wife and I took the Ghosts and Vampires tour last night with Loki. We booked last minut","useful":0,"cool":0},"Ua-JGRTH5Lcojyxba-hzCw":{"text":"I chose to take three tours in one day from this company and all of them were spectacular!","useful":2,"cool":0},"REcBOwpjX1fXjF6gvoo6PQ":{"text":"We had a tour of St Louis Cemetery #1 and it was great. Jamie was our guide and she was ve","useful":0,"cool":0},"BmBh1BVhx8tiHXYgFiMzow":{"text":"We did a walking tour of the French Quarter with Loretta.  She is awesome.  We had a great","useful":0,"cool":0},"V9ylHLPJVTk5_Mgsk2XGbg":{"text":"Tour was perfect blend of history and fun anecdotal stories. Christie had great knowledge ","useful":0,"cool":0},"oTo0lPvrZV3V6URxlZxWzQ":{"text":"If you're looking for a fun, engaging and intimate walking tour in and around New Orleans,","useful":0,"cool":0},"lRLxwefvMoJqaAl8nymaMg":{"text":"This was a really fun walk!  Our tour guide, Loki, clearly loves New Orleans and shared so","useful":0,"cool":1},"-G2QWr6zC0pLi1wMGganAQ":{"text":"Fantastic tour. It was uncrowded, interesting, and personal. Our guide, Val, was fascinati","useful":0,"cool":0},"4Ej2vHnYOj4_smpi2j_H-A":{"text":"I booked this tour last minute for the Lafayette Cemetery and it was super simple! Loki wa","useful":0,"cool":0},"ytYs8lEHuaNrvOpydKsZpg":{"text":"Karen was a great tour guide, very funny and knowledgeable.  Would definitely take a tour ","useful":0,"cool":0},"2EM49WxXgkGLRqNCQPjblg":{"text":"Very informative and fun tour of NOLA's Garden District. They keep the tour groups small f","useful":0,"cool":0},"hcWd97HdkBs71fdZF96iww":{"text":"Did a walking tour of the French Quarter with our guide Kathy, who was lively, fun, and in","useful":0,"cool":0},"xX878Dh7FpLmzyrq6UNNBw":{"text":"I had a great time exploring the Garden District with Loki.  His expertise was exceptional","useful":0,"cool":0},"Lhm05KQcqWzbQ0JAStmswA":{"text":"Fantastic tour and customer service!!! We took the Garden District/Cemetery tour this week","useful":0,"cool":0},"2AAWQ6JXrmzy0ddcPDCSwQ":{"text":"My boyfriend and I took an afternoon tour of St. Louis #1 and had a great time! Generally,","useful":1,"cool":0},"8XudRMIGEzqS48zRXxgQ5Q":{"text":"Great tour. Our tour guide, Mike, was very knowledgeable about the cemetery, but also the ","useful":0,"cool":0},"qSCevDFX_vRxecEtLDVgbQ":{"text":"Handsdown my best tour experience during my NO visit with Loretta for the Dead Sexy Tour. ","useful":0,"cool":0},"2GVgvj6BzZIVSZk6WFrKfg":{"text":"Our tour guide, Loki was recommended by a friend of a friend. We did the \"Skeptic's Ghost ","useful":0,"cool":0},"RHZbwcejhOHKdTCBBYrIJQ":{"text":"Amazing tour of the cemetery and Storyville! Our tour guide Vail was hilarious and so welc","useful":0,"cool":0},"aBQU6Koq2X1dizBu5hujHw":{"text":"We took the Dead Sexy walking tour today, visiting the Saint Louis cemetery number 1 and t","useful":0,"cool":0},"Hsx-u4wPebbJsZTtabbdMw":{"text":"We loved our tour guide and the small group during the tour. Our guide was wonderful and k","useful":0,"cool":0},"vRPfBOCS5fRQpPVMU2c6vg":{"text":"Wonderful walking tour through the garden district. Our tour guide was Loki, who is an ext","useful":0,"cool":0},"OsesgcJWagXBu3FktLf0HA":{"text":"I decided to \"bite the bullet\" and book a personal walking tour during my short visit to N","useful":0,"cool":0},"-g0RBHyjRi4FD4b9xcUhxg":{"text":"My husband and I spent a long weekend in N.O. You can only go to Bourbon St. so many times","useful":0,"cool":0},"Suuzn1kC0CH6_NkmF3pr3g":{"text":"My wife and I did the walking tour of the Garden District and Cemetery today. Our tour gui","useful":0,"cool":0},"_q7RYO3WQtH5z7K1um2AHA":{"text":"Lovely tour by Miss Loretta! We (boyfriend and fam in toe) were lucky enough to be the onl","useful":0,"cool":0},"Olp21EHvp_ydCYQoT4lpxA":{"text":"We had a fabulous tour with Val. She was very knowledgeable and her love of New Orleans re","useful":0,"cool":0},"5PT0hkQk9xgECJZpkI3J9g":{"text":"We did the tour of St. Louis Cemetery No. 1. Average. That best sums it up. Our guide didn","useful":0,"cool":0},"G0jZfNTj_2nHUBqTI23tww":{"text":"We did the \"Dead Sexy\" tour and it was awesome.  Loretta was so great and knowledgeable. S","useful":0,"cool":0},"0jB9fIE5sqb_4FuHQegSIg":{"text":"Took two tours from them on a recent trip to New Orleans, they were great! The Garden Dist","useful":0,"cool":0},"MRbMk5YNhzpaCDlrwv09LA":{"text":"So, coming to NOLA I have always found it difficult to step away from the French Quarter -","useful":1,"cool":1},"s3xzksHfyhSAgnwzIIhpgQ":{"text":"Karen did an awesome job on our tour of St. Louis #1.  She was extremely knowledgeable abo","useful":0,"cool":0},"5-5FV0qQvZbDpRTx73SoCQ":{"text":"My husband and I took the St. Louis number 1 cemetery tour today with Loretta. It was very","useful":1,"cool":0},"VmCD6Ryl6qvavMCWIYpFrw":{"text":"Loretta gave us amazing insights to the world of Comfort Women before, during and after St","useful":0,"cool":0},"nzSvYzFxBgN0Z3QTVd-vZQ":{"text":"Just finished the dead sexy tour with Miss Loretta as our guide. She was wonderful. Made t","useful":0,"cool":0},"OgDxawM-gvcl8ZpE5vDHzQ":{"text":"Stacey was awesome! We toured the Garden District and it was a great experience. She was s","useful":0,"cool":0},"oqEYLidoKy0ixaWDiQdk_Q":{"text":"Loretta was knowledgeable, outgoing and an overall great guide.  Looking forward to my nex","useful":0,"cool":0},"uE-YQsfsiPw58ilrkW0oMw":{"text":"This was a great tour!  Moira was an excellent tour guide.  She is passionate about New Or","useful":0,"cool":0},"Exk8bahP6-CDUJgUYK7SjA":{"text":"Loki (George Williams) provided a fascinating, entertaining and yet realistic account of h","useful":1,"cool":0},"6NrrdXv2s1NdUNGgQtyaoA":{"text":"Loretta is a tour guide rock star. She clearly loves this city and loves what she's doing.","useful":0,"cool":0},"z6mwrXe25Ixlyt5OyzyqvA":{"text":"I'm a HUGE fan of cemeteries, so was really excited to check out the great history when vi","useful":1,"cool":1},"ySU2j2GiHF97VR9v3gXy9g":{"text":"We had a great time with Leslie.  She gave us lots and lots of info in a very interesting ","useful":0,"cool":0},"dEoRtcgBfkNc1chErpyDjw":{"text":"We took the Saint Louis Cemetery No.1 tour with Mike. It was a great tour he had a lot of ","useful":2,"cool":1},"R8bePvxlOpWP0htr1422FQ":{"text":"First of all, you are crazy if you don't join a small group like Two Chicks offers. Those ","useful":2,"cool":1},"sy7rgEuS9fFtE3rjYiISaw":{"text":"Loretta is amazing!  We took the St Louis Cemetery # 1 tour on Day of The Dead which meant","useful":0,"cool":0},"poLHVN7RFGMnRfa9CpqZhg":{"text":"So I did my homework before we went to NOLA and I found Two Chicks Walking Tours, so I kne","useful":2,"cool":3},"Y_03FXGEahbGQXNn3eYr5w":{"text":"Loretta-Marie and Karen were an absolute blast! My husband and I did the Skeptic Ghost Tou","useful":0,"cool":0},"xYrelm9YyY53m--HjKVpfw":{"text":"Had a great tour of the Cemetery and Storybook district by Loretta yesterday. She was supe","useful":0,"cool":0},"XGqa8__he6P2J0ZCXpGNbA":{"text":"Great tour of the Garden District. Loki was amazing! Lots of persona anecdotes and a ton o","useful":0,"cool":1},"fShj2SfhY89loL7o-veZVw":{"text":"My husband and I did a skeptics ghost tour of Nola. I'm not much of a believer in spirits ","useful":4,"cool":1},"KKbRK39-rkpSBPSZiNR-vA":{"text":"I haven't written a Yelp review in years, but our walking tour of the Garden District was ","useful":1,"cool":0},"xFocTbMWvdAWtVqNA0EnoQ":{"text":"Steve's historical knowledge of New Orleans, the Garden District and Lafayette Cemetery wa","useful":0,"cool":0},"3BRduBJ88gtXLH_UCVDNvw":{"text":"We toured St Louis #1 with tour guide Mike.  Great tour!  Mike was great and we learned so","useful":0,"cool":0},"AoBVADA1oNJiWwhhGiFsWQ":{"text":"I took the Brothels, Bordellos, and Ladies of the Night tour with Karen. Despite there bei","useful":0,"cool":0},"nVCOJ8gbzRHSgBVgGkrZ_A":{"text":"Stacey was our guide on the \"Dead Sexy\" tour (combo cemetery/ Storyville tour) and she was","useful":0,"cool":0},"ulrR9ZPULAiJxL0Lypuhtg":{"text":"@St. Louis Cemetery No.1 walking tour, it was an extremely hot and humid day but our tour ","useful":0,"cool":0},"sIKg4raDR3xcyQxSZSaVpQ":{"text":"Loved this tour!! Easy to book, left from a very convenient spot and our tour guide was gr","useful":0,"cool":0},"bUZrKzII54_kf5BZkh47nA":{"text":"My husband and I throughly enjoyed the Gracious Garden District and Lafayette Cemetery #1 ","useful":0,"cool":0},"gp4GmZonls668WPEm0uzRQ":{"text":"I don't write many reviews but when I am very impressed with someone I will.  We were a gr","useful":0,"cool":0},"exxnGbp35YG0sYVJGojLjQ":{"text":"I've done a lot of walking tours in New Orleans over the years, and I have to say, this is","useful":2,"cool":1},"QedQnJxn0XknKTU1coBQvw":{"text":"Christine is a fantastic tour guide! So cool and super interesting! I highly recommend Two","useful":0,"cool":0},"VIKw9FAQpGvztKqT3_TsnQ":{"text":"I went on the Garden District walking tour. On my first trip to NOLA a few years ago, I wa","useful":1,"cool":0},"F0WS5pPUv5VGrlOAh8vNnQ":{"text":"We thoroughly enjoyed our Garden district & Lafayette cemetery tour with Rebecca!! She is ","useful":1,"cool":0},"rQ4MQYchQhOr-shoaok2uA":{"text":"Val was great on the French Quarter Tour! She is a local who has lived in the area for 20 ","useful":2,"cool":1},"bxbibBRDdeOANi8X1GXX6w":{"text":"I was in NOLA for a wedding and had a free morning while waiting for the wedding to start.","useful":1,"cool":1},"ASH-s6G6AVAj7zX3IG97qA":{"text":"When picking a tour of the Garden district and cemetery I wanted to be sure to find someon","useful":1,"cool":0},"kzZkAng6Awc3Nsm8ZlXSHg":{"text":"This was a tea cool and fun tour. Loretta was humorous and very detailed and informative. ","useful":0,"cool":0},"1JWDeWBxVpOYYp5PYhdzoQ":{"text":"Wow!!!! This is the way to do a walking tour!  From a local!  Loretta was excellent! Kept ","useful":0,"cool":0},"jMzH_9wA9-spypbWhjOfOA":{"text":"This tour was super fun and educational. We learned a lot about the city and the culture s","useful":0,"cool":0},"0S_Ylc1IUZd78iboH_nO9w":{"text":"I expected a tour, not a one man, one act play.\nLoki was our guide...a bit too much charac","useful":1,"cool":0},"BNph80jtAxwCnfbvrGJtSQ":{"text":"Wow. Just finished our tour.   Christie was most excellent!!! She was very knowledgeable a","useful":0,"cool":0},"aCrVuUBJJT7vAyDDMgDiqA":{"text":"St. Louis Cemetery  walking tour\n\nWe did not know what to expect. We were pleasantly surpr","useful":0,"cool":0},"kgIH0bDySd3sgXeYqnMnLQ":{"text":"Great tour, flexible to switch reservations when our plans changed, Mike was super knowled","useful":0,"cool":0},"uKhRiGBk-3iR7PoctbfKJQ":{"text":"On my first day in New Orleans, I sought an introduction to New Orleans that wasn't focuse","useful":2,"cool":0},"MmlHMjdvrlOjpgyrn7L9ng":{"text":"We had a great Gracious Garden District tour with Rebecca. She was funny, informative, and","useful":0,"cool":0},"0tEDv-3qRG0ZKZfB8SksKA":{"text":"Loretta was amazing. Super fun and energetic. Put on your schedule. Lots of history of the","useful":0,"cool":0},"dXA8-K2xSnj4RC8_v-LKog":{"text":"Suzanne was a great guide. Very informative and showed a genuine passion for New Orleans h","useful":0,"cool":0},"j0fAb04iGoADEPlO6UWFOg":{"text":"A friend and I took the 3pm tour of St Louis No. 1 Cemetery with Val. I would definitely r","useful":0,"cool":1},"T_llwnkoqkt-LEYWDmsqEA":{"text":"I took a tour through St. Louis Cemetery #1 with Loretta.  I was the only person for the 1","useful":0,"cool":0},"rcLY__WcfLZItijETHf_WQ":{"text":"I took the At Louis No 1 Cemetery tour on New Year's Eve with Christie. She was great. She","useful":1,"cool":0},"HqnB8Lka0FfoTJR5UITs9A":{"text":"We had a great time with Val at the French Quarter! We loved the amazing stories about the","useful":0,"cool":0},"wZEW-nsp6qniNHj60c0E4Q":{"text":"Two Chicks Tours-- you must know that Loki's Garden District + Cemetery tour MADE my birth","useful":3,"cool":0},"l6m0fjgL3eFvUzfoENvh7w":{"text":"So great! I was in town for a wedding, only was spending a few days in New Orleans and wan","useful":1,"cool":0},"Ya4hd8uG2Rbmjelb5Mk7Dg":{"text":"This is the best walking tour of the Garden District if you are a history and architecture","useful":0,"cool":0},"eBEPcPXmo90ti2cd4Ti51Q":{"text":"Karen was our guide during the Dead Sexy tour. She was a lot of fun and it was an interest","useful":1,"cool":1},"JyrXJY20QnN0w1SNBrmUWg":{"text":"We took a tour with Christie today and did the Garden District.  The highlight was seeing ","useful":0,"cool":0},"HmFpkIwBNtZn3DiiunSFMg":{"text":"My daughter and I did the French Quarter Tour with Loretta on February 16th and it was the","useful":0,"cool":1},"wuLIxBFv9Cc06-3Zog-oJw":{"text":"This was not as risqué as I wanted it to be. The tour guide was knowledgable about the his","useful":0,"cool":0},"1vmVRJFu0z_lleF3-Go5HQ":{"text":"Had a great time on the Garden District and Cemetery tour! Tons of fun tidbits in a beauti","useful":0,"cool":0},"eD1G7fn-D3_U6eAu9DTZsw":{"text":"We took the Garden District/Lafayette Cemetery tour with Christy and the St. Louis Cemeter","useful":0,"cool":0},"y4O6Xw2EboeA51mhU3Pweg":{"text":"We did a tour of St Louis Cemetery 1 and it did not disappoint! Our guide was knowledgeabl","useful":1,"cool":1},"JX8uZ4v1I7bqCqoCwcPSkw":{"text":"Had an awesome time with Ren during a tour of St. Louis cemetery 1 very knowledgeable.","useful":1,"cool":0},"OOSR5qFjo8vjuQuHjDVfCg":{"text":"We did their Garden District and cemetery tour. We had Loki as our guide, and he was excel","useful":1,"cool":0},"n564kN4mJ0LO4tiGaA1idg":{"text":"Took my boyfriend in the Dead Sexy Tour w/ Loretta & it was AWESOME! She has such great en","useful":1,"cool":1},"5-bzeQ0U1hNi9WPQXolM0Q":{"text":"My husband and I were given an A+ tour by Loki.  He explained so many architectural and hi","useful":0,"cool":0},"yoHTg2SWwcBd7AaGGb4Jbw":{"text":"The Dead Sexy Tour with Loretta was definitely a big highlight of our trip to New Orleans!","useful":3,"cool":1},"MBtY8456tKXeMCnrl9dUHQ":{"text":"My grandmother and I went through Two Chicks Walking Tours to tour St. Louis no. 1 cemeter","useful":0,"cool":0},"xW6CZLh17szt0r0yE1DjHQ":{"text":"Loretta, our guide, for the Brothel tour was funny and informative!  I liked all the photo","useful":0,"cool":0},"e2TK6p96XhAzRPt1T5fKcQ":{"text":"We just did the cemetery tour, which I highly recommend. I really wish we had more time to","useful":0,"cool":0},"dRC6JZ1hxNo7Q1eXVHY_Uw":{"text":"Great tour of St. Louis Cemetery 1. Our guide, Suzanne, was excellent. She was friendly an","useful":1,"cool":1},"BRT86a-XSw35bpjPFmb5iQ":{"text":"Great tour. Karen was very knowledgeable and patient with our group.","useful":1,"cool":1},"lS7ZElNbJJ3BpPApumlXmA":{"text":"Christine was great.  This was an informative tour that included history and some pop cult","useful":1,"cool":1},"AedF4YiR1qa9P5sa0AIaiw":{"text":"Knowledgeable. Kind. Curious. Insightful. We had a fantastic time with Christine on our Ga","useful":0,"cool":0},"ZO65a8mxR2s008DZBT61sQ":{"text":"We chose the \"Dead & Sexy\" tour with Ms. Loretta as our tour guide. It was simply the best","useful":0,"cool":0},"znQ4XD-By-J59y2mUxxrRw":{"text":"Great tour! Ashton was very knowledgeable. The size of the group was just right. Would hig","useful":0,"cool":0},"kYYjBJwJAZhXmhklBGEzbQ":{"text":"I really hate to give them a bad review, but I'm extremely disappointed. This was our seco","useful":5,"cool":0},"1VwVS6WrWgkdM2iXprR3vA":{"text":"Great informative tour. Christie had so much information about the houses, cemeteries, and","useful":0,"cool":0},"H6Tjg4gN8L8ilfZRu2IpPg":{"text":"Today we had Karyn on a private walking tour and she was amazing!! We truly enjoyed the ex","useful":0,"cool":0},"kfMl4pS4fT3_VSphSQ6-rw":{"text":"I really loved my walking tour. Two Chicks was recommend by my sister and I did their St. ","useful":9,"cool":5},"9UIvDh68OqgCOEJx8CngEQ":{"text":"Extremely frustrating experience. We did the \"Grand Garden District Tour\" in New Orleans. ","useful":3,"cool":0},"4NbGZabpX0VpVv8fvDjuYA":{"text":"I did the Dead Sexy tour which is a combination of a cemetery tour (St Louis #1) and a his","useful":0,"cool":0},"8mzAnJL8_06tJT6hqZBR5Q":{"text":"Robert was an awesome tour guide for the cemetery tour!  he even sacrificed his dryness to","useful":0,"cool":1},"4XL0gOI0RC38V4WaqwL_pQ":{"text":"My husband and I did the Garden District tour on the Sunday before Mardi Gras. Two Chicks ","useful":2,"cool":2},"1umH5Za6qcCrbGUO2MUHlQ":{"text":"We had Loki as our guide today in the Garden District. He was fantastic-knowledgeable, fri","useful":1,"cool":0},"ewbTqVi1Jx3GWYuet0CZxw":{"text":"We did the French quarter tour with Carmel as our guide. The tour was excellent! Carmel wa","useful":0,"cool":0},"8kUqP4AkQ4SnZ6T03ZK0aQ":{"text":"We absolutely loved our walking tour! We did a tour with Christie in the Garden District. ","useful":0,"cool":0},"AVT76CiHdWEUquNfx-ZO4g":{"text":"I had an amazing time on the Garden District Tour with guide Dannel (rhymes with Flannel).","useful":0,"cool":0},"1r2CXHHfkbGRyVFNoCLcSA":{"text":"Went with a 50th birthday group, because where else would you take someone marking half a ","useful":1,"cool":0},"vgFL9sNKPeT4UCYDZcDaRg":{"text":"This was my second garden district tour. The last one was in 2012 when I was last in NOLA ","useful":0,"cool":0},"JESDSpytafPljQnnja0uow":{"text":"Dannel was a great guide. She was very knowledgeable. I lived in the Garden District for a","useful":1,"cool":0},"wAous7Go9oo9Pz9myGZhsg":{"text":"Did 2 tours with this group (Garden District & Dead Sexy) and had a great time. My husband","useful":0,"cool":0},"5OBKFZEfXCkBz0m07H34HA":{"text":"We did the Garden District tour- we had the best experience. Grey was awesome, she was ver","useful":0,"cool":0},"8h3z3bmvhqbeHbUr3oOjfA":{"text":"Boring and sexist.  Could rename it the Nicolas Cage fanboy tour.\n\nThis was a big disappoi","useful":1,"cool":0},"v5AUxHApKaLkzvXY_apYdg":{"text":"My husband and I decided on a last minute- let's drive to New Orleans since we have never ","useful":5,"cool":4},"KGmLltFQu8VbQ0k2pbf1ZA":{"text":"Ashton was absolutely awesome. She showed me and my 15 friends around for my bachelorette ","useful":0,"cool":0},"xmUy3hQ0Oj-ypubHDTwpuA":{"text":"Best tour Ive been on and the guide LOKI was the best ever","useful":0,"cool":0},"7E2DGCFbYrGxRPbFy6yVXg":{"text":"Susanna was such a fun tour guide! I mean, how often do you get a tour of an amazing city ","useful":1,"cool":0},"MA4wZsWJD6mqaNOLELyp7g":{"text":"My buddy and I were visiting from California and wanted to do a cemetery tour, luckily for","useful":0,"cool":0},"or6ycr5TCuZ_SbLv6mPkEA":{"text":"Had a great time with Christine. Even though I was the only one signed up for my time she ","useful":2,"cool":0},"EFf0HCvQwRBUSeOfgGwjVw":{"text":"The Garden District and tour of the Lafayette Cemetery was nothing short of amazing. Our g","useful":0,"cool":0},"OOWzXEgK0P9AWH3MhXZRBw":{"text":"I had the privilege of taking Christine's Cemetery Tour through St. Louis 1. I live in New","useful":0,"cool":0},"4DETPpVv0WpVvWdvzG-eUg":{"text":"I loved my tour of the Garden District. My guide gave a great perspective on the area and ","useful":0,"cool":0},"g16dCWabSCx4mJQKITtmRQ":{"text":"The Garden District tour with Christine was a highlight of my New Orleans trip. It was a f","useful":0,"cool":0},"RsFJT1h-E3dkaas69QQZ6Q":{"text":"Informative and fun tour of the Garden District. Our guide was knowledgeable and friendly.","useful":0,"cool":0},"0WZ5JzVvS0aNA-1U0PgHjg":{"text":"Six of us took tgw dead sexy tour with Dannal. She was great to she is passionate about a ","useful":0,"cool":0},"pbOJP_MwXQ9xXLetcSwC9Q":{"text":"Excellent tour of St. Louis #1. Great stories with a lot of detail. Looking forward to tak","useful":0,"cool":0},"k00A-SxmMCI9JlIni7W9ow":{"text":"Took a tour with Robert, and it was just great! He was so well-versed with the history of ","useful":0,"cool":0},"tQcayafmWFJ-nk9IlLDpYA":{"text":"Two Chicks makes walking tours fun!\n\nWe recently took the garden district/Lafayette Cemete","useful":1,"cool":0},"Bntwqm-BNjwfotNTCqyThA":{"text":"Fantastic tour!!!!  I booked this tour for my sister's bachelorette party and was very ple","useful":0,"cool":0},"xoe1d1zkcq7xBkik-nlTgg":{"text":"We had a 7 person group go on the St. Louis 1 cemetery tour and all of us cannot stop ravi","useful":1,"cool":1},"wFZgDnwntoEJSt08-nJfTg":{"text":"Christine gave us a great tour.  Very informative and interesting.  She covered lots of to","useful":0,"cool":0},"io_pIiriiVoelFVlcpv1qQ":{"text":"My BFF and I took the Sexy Tour, which was the cemetery and history of prostitution in the","useful":2,"cool":0},"4swOc_A4JPLJx7RofKy6DA":{"text":"Highly recommend! We took the Garden District & Lafayette Cemetery tour. There was only tw","useful":0,"cool":0},"avYr3FtAQaB45r9K0UYlcg":{"text":"This Garden District Tour was the most informative and interesting tour I've ever experien","useful":1,"cool":0},"jL7O4hwcsPyj3BlibSKMfA":{"text":"We did the St. Louis Number One cemetery tour and it was great! Our tour guide was Ren, an","useful":0,"cool":0},"3Vigqcpx4Xht_F4uwF3S0g":{"text":"Did the small group, 1 hour, cemetery tour with Christine. She and the tour itself was fan","useful":0,"cool":0},"QuEUgG7dQCd0oKsy3KUGWQ":{"text":"I love it when my friends from elsewhere come to visit and I am 'forced' to be a tourist i","useful":7,"cool":3},"0xR3cq8-XbEocLjNCusVJA":{"text":"we had such a great time on our cemetery tour! lots of interesting info and a nice small g","useful":0,"cool":0},"DGBxwzDqwAcdrdXUJBopKw":{"text":"3 friends and I did the Dead Sexy tour with Loretta today.  Interesting, informative, and ","useful":0,"cool":0},"gzJp9j28pZVQ9kmd7318fw":{"text":"We had a guy named Loki as our guide. Not one of the chics, but we were not in the least b","useful":0,"cool":0},"J-UMCcOtEMIwx4rTFSfIlw":{"text":"I spaced out and thought my tour was Friday, but it was actually Thursday!  Even though I ","useful":0,"cool":0},"b97qV5kOiEUpctQaT5P0qA":{"text":"Support this local tour company. My daughter who is 14, and I went on a tour with Loki whi","useful":0,"cool":0},"moNdvhLTsiNGgFPsZ2gMig":{"text":"A wonderful historical tour through the Garden Center learning about the history of NOLA, ","useful":1,"cool":1},"CgXlp6ywwwR0v8w93Bxj9Q":{"text":"Karen was a fantastic and knowledgeable tour guide. She had tons of factual and antidotal ","useful":0,"cool":0},"-VnXFKoqF6Zj6v3Ny9VIRA":{"text":"Really enjoyed the tour with Karen. Lots of insight - esp on architecture and local histor","useful":1,"cool":0},"ZF56mdRRmWzNr9FhuasGMg":{"text":"I took their brothel tour last year and it was expensive and disappointing, and not becaus","useful":2,"cool":0}}