{"iLUG-ahDzS61DuFK7hpqpg":{"text":"Peanut butter bacon burger with jalapenos. Holy fucking fuck! Seriously one of the best th","useful":1,"cool":0},"jgWkUiZUcZQi34nCIsOyFA":{"text":"This is NOT a fancy place, and is the quintessential NOLA dive bar in the Quarter. That be","useful":0,"cool":0},"TIIL65MuOiEvAFHmSVA7Dg":{"text":"Dive bar... Dirty, but my GOD the Peanut Butter Burger is LIFE CHANGING and well worth eve","useful":1,"cool":0},"jhUbYUbTZZC7-vVhsqAyHA":{"text":"Sorry Mama Lovers, but we were very disappointed with our lunch here.  On our trip to New ","useful":0,"cool":0},"KEFgF5PzHNjLoQNtJnB8lw":{"text":"On my last visit in February of 2014 the food was excellent as was the service.\nThis visit","useful":2,"cool":0},"bLMRm19W4ogFVIXyOi3T9w":{"text":"Our first stop in New Orleans and not disappointed! Peanut butter burger is delicious! Per","useful":2,"cool":0},"MmUHqLtlw4alFutSw0QZtQ":{"text":"In the aftermath of hurricane Issac, suffering from a touch of \"cabin fever\", lack of elec","useful":2,"cool":2},"9F-tcFQeww2XOur6r0BmHw":{"text":"enjoyed their burgers! pretty darn good. they also have talls for draft beer which is prob","useful":0,"cool":0},"FlgMthPi1mtEPfw2wGbhWg":{"text":"Came here on a Thursday night and split a Texas BBQ and Bull Fighter burger with my girl. ","useful":0,"cool":0},"84hkdp1EKNjhfBUQL26Mcg":{"text":"Local and regular customer who always takes good care of bartenders and waitresses , could","useful":0,"cool":0},"4xkiwNhMkmSp6L6WgUdZdQ":{"text":"This place was recommended by a server at the Old Absinthe House (thank you, Jess!). Exten","useful":0,"cool":0},"gWlrNMSSrruU_Bbp8pZCXA":{"text":"I never would have survived New Orleans without this place. The bartender was awesome & ta","useful":1,"cool":1},"9fZonxECtB-MaSDeUqQO5Q":{"text":"Yo Mama's is now Port St. Peter. Same menu, same location. Same amazing peanut butter burg","useful":0,"cool":0},"1d8wSY2XiUwzvM9pRCSf8g":{"text":"The eternal (yelper) question: Does this- insert iconic establishment- even need another r","useful":17,"cool":12},"bcGDnokxILEgQkYG7Z1HBA":{"text":"Enjoyed our burgers!  Variety of burgers to choose from and the sides were good, as well. ","useful":0,"cool":0},"sumq6wn_uc35EDhZX9MSTw":{"text":"I walked there for lunch with two coworkers.  I was skeptical because I've never heard of ","useful":0,"cool":0},"M961LklmnNX1qDaBUAEw-w":{"text":"It's a pretty chill spot. it's a nice bar and has some solid gumbo. Try the alligator saus","useful":0,"cool":0},"5oOzri_JFHpcpe_VnBxdjg":{"text":"4 words. Peanut. Butter. Bacon. Burger. Traveled to NOLA in June with a friend and this wa","useful":0,"cool":1},"5Duhkx8RS4QN0ONzSZz7ZA":{"text":"Food good.  Rediculously long time to get food.  Then staff says busy and no one on either","useful":1,"cool":0},"6D411s0fyHBpyEJcICiqvA":{"text":"I loooove the divey atmosphere here and the old tunes on the jukebox makes me feel like ea","useful":0,"cool":0},"ngrNQ3i7SJ3v0In1zZADlw":{"text":"Everything you read about the Peanut Butter Bacon Burger is absolutely correct. It's beyon","useful":1,"cool":2},"j5BFWm9wy-0twXPE7_OCXw":{"text":"First off, this place is small - like 4 booths and a bar.  I have no problem at an order a","useful":2,"cool":2},"GTT7dpb_ivQGcrjn6FHtVw":{"text":"Let's see...you're in the Quarter, you're hungry, and you don't want to wait in line for a","useful":0,"cool":0},"MdkP0zUvXXGH3e7H30GRDQ":{"text":"The best went to yo mama last October I will be back June 16 after I land in Nola it will ","useful":0,"cool":0},"qPNbSS9QPYwZsq7YViJLJg":{"text":"very small place they have a doorman checking IDs as you go in. you have to be 21 to enter","useful":1,"cool":1},"65GzpKqEY1tjhOWDNF29Xg":{"text":"\"Don't go to Port of Call, go to Yo Mama's\" \n-At least 3 different people.\n\nWhile I can't ","useful":4,"cool":2},"jqhWqaUeVwjL8e1PvxfcZQ":{"text":"Another top 5 from me... trend? no, reality.   Small but great bar, with a few booths down","useful":1,"cool":0},"JdW25MGJc89ZEullC3I_OA":{"text":"Now this is a dive bar! With great burger selection! Servers know their drinks well. I lov","useful":0,"cool":0},"XT3i4XuW74TrorRqa_xyQw":{"text":"So, the husband and I had heard from a friend that had lived in NOLA that Yo Mama's was TH","useful":0,"cool":0},"1kAGLGnn8D6MpCBBV2kU3w":{"text":"This has to be one of the best burger joints in the u.s. I've eaten here once before. whil","useful":0,"cool":0},"9Q3P4bEWZnt3wiiXKMNsNA":{"text":"\"The best burger\" in NOLA is what they are known for.  They have many newspaper & magazine","useful":0,"cool":0},"j2wGmA5cmWIAtS6-SHm9lw":{"text":"One of the best burgers I have eaten! Jucy, well cooked, really good seasoned och the boss","useful":1,"cool":0},"GXOCo13hixARfPhXTS9xzA":{"text":"Awesome! Very hospitable and friendly staff. The burger was excellent and the mac was quit","useful":0,"cool":0},"H5t6VI1KVseNhf9FfE4vNA":{"text":"Drinks were good. Bartender was good. Food was good. This place really does not skimp on t","useful":0,"cool":0},"A1Zjdz4nVimU2LZfUUaTdw":{"text":"YES! YES! YES!!!!!! \nI ordered the peanut butter, bacon burger, dressed w/ a fully loaded ","useful":0,"cool":0},"F044W_-iuRU8_gwaRO5cNQ":{"text":"PEANUT BUTTER BURGER!!!  \n\ni'll admit it.  i was hesitant to try it at first.  my cousins ","useful":1,"cool":2},"2pb4pmHQPD2AnUDBypeY_w":{"text":"Ahh! I am so conflicted. I really wanted to love this place but it just did not win me ove","useful":1,"cool":0},"PF_H5aBhTVMjoNv_YAyLpg":{"text":"A couple hours after eating Yo Mama's burgers, both my girlfriend and I were violently puk","useful":0,"cool":0},"y8piSvt80ASIHV_gkhiDDw":{"text":"If the peanut butter burger wasn't just so darn good, this would've been a 1 star review. ","useful":0,"cool":0},"LuIskzC9RGRuC_f-0iv_Tw":{"text":"After driving 16 hours from Detroit to New Orleans, my friends and I were absolutely famis","useful":0,"cool":0},"GQAnHAlqaxUdX1r--atQeA":{"text":"One of my \"Go To\" places in Nola. Perfect stop for a great burger and cool tunes. An exten","useful":2,"cool":1},"TGUS6OKw1zLNHWaaO_-4Gw":{"text":"My hubby wanted a hamburger and after asking around, everyone said Yo Mama\nI checked the m","useful":0,"cool":0},"LJFAHopkpljraErbxq__9A":{"text":"I've been back and tried the Peanut Butter and Bacon burger... It rocks!","useful":0,"cool":0},"B2OWcULQHna0htFUpdyLEg":{"text":"The service is super sassy and I like it!!!  \nThe first time I went here (Super Bowl Sunda","useful":0,"cool":0},"Ot0pzp-caH0pbbs097pmvg":{"text":"I was SO excited to stop here during red dress run! Normally this place is one of my favor","useful":0,"cool":0},"wu_eSrNX8GO07R81FwLJUw":{"text":"i was in new orleans for 2 weeks but my first night in town i was there with a band and it","useful":0,"cool":0},"wS6t7SZTxkoWdoGz_wAjQA":{"text":"Boy oh boy this place was a lifesaver for a slightly drunk and very hungry tourist (me). D","useful":0,"cool":0},"0AkN8Dstct28Vtzete1Ksw":{"text":"A friend of mine, recommended I try a peanut butter burger from here.  Never had that as a","useful":0,"cool":0},"zlwqLFy1N1pzycx65w8OZg":{"text":"i love this place  the food is always  great service is wonderful  i would eat here every ","useful":1,"cool":0},"GXaOrgZl078tYJTyf0F1wg":{"text":"This is a fantastic bar and a better grill. possibly the best burger in the area. Our firs","useful":0,"cool":0},"PNfndvyiwypI3ufT2I2abw":{"text":"Much more than a late night dive, Yo Mama definitely delivers.  Visited this bar/dive at a","useful":4,"cool":0},"yZaeylcm8XBoZgaOZGWZwQ":{"text":"Best restaurant Mac-n-cheese I've ever had (they use penne pasta and are liberal with pepp","useful":0,"cool":0},"O1IpR_lGtFm7EajeQOkk7w":{"text":"Yo Mama's Bar and Grill was a small bar that had about 3 or 4 tables with a dimly lit inte","useful":0,"cool":0},"aTx4tFe_Sdq6bGJMPY1USQ":{"text":"Somewhat unique burger selections, okay burger.\n\nThe burger here was better than one from ","useful":0,"cool":0},"5qRryTPwwEX3bFVnk2weOg":{"text":"There are a few things that make this place worth looking for parking in the quarter.... \n","useful":2,"cool":1},"vSUjagHBpVXNjRl8juDRjw":{"text":"Went to Nola back in Dec. and went Yo Mama's after reading reviews on Yelp! The place itse","useful":1,"cool":0},"sxyMp6HyLMjxsLNAxHjYjQ":{"text":"I absolutely adore that so many out-of-towners have written rave reviews of Yo-Mama's. Thi","useful":3,"cool":1},"d08hyohDdoJPrlezB7G_Vg":{"text":"this dive was where we decided to eat a late xmas dinner. seemed like a mix between touris","useful":1,"cool":1},"T8CzhiKD1Sa5gNU3bBhSZQ":{"text":"Music is good, food is great, and price is average for NOLA. I'd would recommend it to fri","useful":0,"cool":0},"-L0siV-V5FMo5wkmeD4A1Q":{"text":"This place never disappoints! Even the locals recommended it.  Every time I come to NOLA I","useful":0,"cool":0},"CHdMqNwWeIt6lcQu80lhlw":{"text":"As we drove away from New Orleans a bacon & peanut butter infused tear slowly rolled down ","useful":3,"cool":1},"5o3xqySbvELrESgz1v91Uw":{"text":"Yo mama's is a bar. Let's be clear about this. It's a shotgun bar that serves food. If you","useful":1,"cool":1},"W5ytm_NJRhQjds-MNKIgPQ":{"text":"I went to Yo Mamas on a suggestion from a friend. We were in a rush and decided to call fo","useful":0,"cool":0},"4bAMH8HYHmOH17LbNFySmw":{"text":"THIS is the place that started the obsession!  My last meal (if I ever have/get to choose)","useful":0,"cool":1},"t5n1xGzvIf7rbxeibJORVQ":{"text":"Let me first say what this bar with a burger joint in it is not.  It is not a coddled whit","useful":1,"cool":0},"mjoUK8K_kKZE6qPNjQzG1w":{"text":"My husband has been trying to get me to go to \nyo mama's  place for over a year. We had he","useful":1,"cool":0},"l3f4iyaPVlzJ7G8490aMQA":{"text":"Oh man the peanut butter and bacon burger is slamming. Besides a burger I had in Portugal,","useful":1,"cool":0},"kbo-RgEWK38K4vZoaHGGuA":{"text":"Yo mama burger was amazing!!! First bloody Mary I ordered 3 out of 5 on spicy scale and it","useful":0,"cool":0},"hx68k7X93yVqZk64XNnLKg":{"text":"This place is excellent if you're in the mood for an amazing burger, down to earth bartend","useful":0,"cool":0},"8INJZ9hzb_BM84Ju7whljQ":{"text":"Dark little dive bar.  Great service.  My friend and I shared a regular burger and a peanu","useful":0,"cool":0},"D4nUNnDYgYRTMTglStSbsA":{"text":"You won't get fries with your burger but you won't care. Burgers come with potato salad, M","useful":0,"cool":0},"hrjPovopdbo_ZVF5kbjKig":{"text":"My husband and I had the BBQ burger and the peanut butter bacon burger and the peanut butt","useful":0,"cool":0},"8R6L7GSKY0XIBKECl1LhDQ":{"text":"dive bar atmosphere with a damn good burger. wouldn't want to see the kitchen up close, bu","useful":0,"cool":0},"y-H1n2vchanKwGlLgKV8HQ":{"text":"The one pound burger was awful..over cooked and no juice to be found ..cheese was ordered ","useful":0,"cool":0},"qTjNQXTxCmiYxKMGg6oZBg":{"text":"Great burger!  My husband has been talking to ever local he could find 2 is this location.","useful":0,"cool":0},"_W244w8N8KsssmMKAZDEPQ":{"text":"Nice local bar with great burgers. Try the peanut butter hamburger. It's delish","useful":0,"cool":0},"Aw2ki3TfvAWMfQ9ykbklOw":{"text":"Peanut butter burger time! \n\nPEANUT BUTTER BURGER TIME!!\n\n\nNo seriously, so maybe you've h","useful":2,"cool":2},"tushC8y0pKxgQu3NZnoM_w":{"text":"My fiance and I recently visited New Orleans while photographing a wedding and, to our sur","useful":0,"cool":0},"6G3WBg0piUBvCHvW5yhk9w":{"text":"I am rating them on food/drink alone, as I think they could have had better music in the j","useful":0,"cool":0},"YQafqD0Mqv5YxicTKRSfcA":{"text":"After skimming all those review, I wish I tried the burgers. I was there for Crawfish boil","useful":1,"cool":1},"5oX9FSC11aJWnn56UZny6A":{"text":"Seriously the best burger I've had in a long time!  Great food, great service, great atmos","useful":0,"cool":0},"_OjnzxCn08qolxTGohFzXA":{"text":"Before my last trip to New Orleans, my boyfriend insisted on trying the peanut butter baco","useful":0,"cool":0},"LkNun4AlkwSLVCXomWoQGA":{"text":"The burgers and loaded potatoes are amazing...love every one of the burgers and  it's all ","useful":0,"cool":0},"_OaVEpwdbROGli9SD3kVGg":{"text":"After visiting New Orleans too many times to count or remember a stop at Yo Mama's is a mu","useful":0,"cool":0},"tVtymrge6TSToIoPhWq4pw":{"text":"Stopped by during our visit to New Orleans (mainly because of the reviews on Yelp).  Order","useful":0,"cool":0},"wJre5BcnR5bJ-BoMmp2p9Q":{"text":"Being in the French Quarter and wanting a burger, we walked over to Yo Mama's.  Hadn't bee","useful":0,"cool":0},"C39PoZF2vfLeMKWDi11BEw":{"text":"This place is so down-to-earth and friendly! The hot sauce is AMAZING! The burgers are coo","useful":1,"cool":1},"c6BKLg3tjjiDIL8R2-yIZg":{"text":"Julia (real sweetheart, purple hair), Emily (sweet, pretty brunette), Angela (older brunet","useful":0,"cool":0},"LWOJNUZ2TEgQOG1VGS6L0Q":{"text":"My friend Phil's dad is an amazing cook and a big foodie. Apparently he had been raving ab","useful":2,"cool":2},"hgTzV2aFj47ELkyIepJqHQ":{"text":"We stopped here for dinner on a Friday evening.  My husband ordered the peanut butter baco","useful":1,"cool":1},"fF-jrdzT4NN8SZghQs6kfA":{"text":"Best burgers in town.  Place is kind of a dive bar, but what should you expect right off o","useful":1,"cool":1},"CxPLDuZ5i78Ill2bjzJgyQ":{"text":"OMG AMAZING!!!  Best Hamburger Hands Down!  If you want posh, upscale place then stay away","useful":0,"cool":0},"LXf_wXpETwAXnhe4W3sLtA":{"text":"Good burger, not great. Cool, super divey atmosphere. Full bar.","useful":0,"cool":0},"4MkHc9QpEl4cXydxY_MHlg":{"text":"Service: Extremely friendly and will answer all of your questions and make recommendations","useful":1,"cool":1},"4HSA50ghkhxhmfp4JOsNTQ":{"text":"Peanut Butter Burger. Yea I had it or should I say that it had me. First off, it is delici","useful":1,"cool":1},"quacc5cudFvhxUpAY-BMUQ":{"text":"The peanut burger and bacon burger were both out of this world! Needed a break from all th","useful":0,"cool":0},"zt9L_OiPCKIgAi0smId0SA":{"text":"Let's get down to it.\n\nThis is a real locals place. You want locals place, you got it. I d","useful":1,"cool":1},"L0XmhFy29Da7nzwEZZ7Y0g":{"text":"I have been to this bar a number of times.  I would give it 5 stars if it weren't for the ","useful":0,"cool":0},"Z7Wu_XsLIRIQgg041ns5Zw":{"text":"Great burgers! We tried the peanut butter and bacon and it's very good. It's really not as","useful":0,"cool":0},"F-Y1pJdZxA-zvQrErWvKPQ":{"text":"Good burger, loaded baked potato was really awesome. The only thing I was a little disappo","useful":2,"cool":0},"Y8sI0hp63t20aWKPSZlfvg":{"text":"Awesome burgers!  This place holds up to the famous Port of Call any day of the week and t","useful":0,"cool":0},"It2w5XcZq30T9O-9BLlc6A":{"text":"Only in New Orleans for 2 days but so glad I stopped here! Such a chill atmosphere and I j","useful":0,"cool":0},"iQWttfs2HFZVUINBBxv4dA":{"text":"We visited with our kids after the Krewe de Vieux. Of course no minors are allowed due to ","useful":0,"cool":0},"wJLVs4wJ50urKO1KkJB--Q":{"text":"Stopped in for lunch because we heard so much about the burgers. They were big and good. H","useful":0,"cool":0},"gITW5b6YFiznSdJ5xOpX7g":{"text":"This place is great!\n\nHonestly we sort of got tired of the cajun/creole thing because that","useful":1,"cool":0},"cM6WYM5-30INQwoqYpyRIA":{"text":"Had the peanut butter burger. It's good, but not $13 good. Really nothing special. It's no","useful":0,"cool":0},"NrYNJj2zYlEeRy8x6KU99Q":{"text":"Thank you Yelpers for discovering this place!\n\nThere are so many great restaurants in NOLA","useful":0,"cool":0},"lHt8KRP1jR8l2YLCZ5sGRQ":{"text":"Not sure what everybody is raving about.  I got a burger and asked for the onions to be gr","useful":0,"cool":0},"ZAbr74cRJ5DcWLBnb5D7iA":{"text":"Awesome dive bar serving up excellent food. I tried the hyped peanut butter and bacon burg","useful":3,"cool":2},"ubgZyefASD3K_JzAUbdrzQ":{"text":"the best hamburger in nola. port o call has nothing on yo mammas. The difference is a bett","useful":3,"cool":1},"tJfpSa54WOauV-Fb-p9ivw":{"text":"Dear Peanut Butter Lovers,\n\nYes, this place has a peanut butter burger. Yes, it has bacon ","useful":2,"cool":0},"hgf0k5pz924tSrZcubelzw":{"text":"I'll preface this by saying we had a great time and the service was great. But a Yelp sear","useful":2,"cool":0},"1eVL2m01Gj_CUVR43hAIFw":{"text":"I went to Yo Mama's because it's \"Hot on Yelp\" right now; and I was intrigued by the revie","useful":2,"cool":0},"QsQyOnuqFS80XvJ_fTZ16A":{"text":"Good food, good bar. Nothing really special about it. The burgers are better than most bur","useful":1,"cool":0},"Ol35XMM1ABFwas4ezA0WLg":{"text":"The burgers are huge and damn good! I ordered the The Bull Fighter and it did not disappoi","useful":0,"cool":0},"u-96Gt5vYuSQHBC4IRUQQQ":{"text":"I was traveling alone and was told to go here.  Seriously.  Great bar.  Food was good.  We","useful":0,"cool":0},"xZfBmGX_uScHD9vPZ0CGEA":{"text":"Can't say enough about Yo Mama! lol The service food and drinks were great, timing was som","useful":0,"cool":0},"0LC3qiBkh5K_eBGH8KhIvg":{"text":"The burger was pretty dang good. The food took forever though and the service royally suck","useful":0,"cool":0},"lb0LXURxMLTkqVnGn9CPAA":{"text":"Burger was delicious. Loved it and fries are fresh. Just order the burger shut up and eat ","useful":1,"cool":0},"YNjsMwYdDp6xKHyvmg0Wgg":{"text":"Ok, I'm not a peanut butter fan, so probably should not have let all the \"you'll love the ","useful":0,"cool":0},"BQnWrK-lGcD_tZd60uUkOg":{"text":"Just finished eating here.  The peanut   butter & bacon burger was very unique and tasty. ","useful":4,"cool":1},"esaBSwVVmj0-HWOSpDvR5w":{"text":"Stopped in for lunch has the bacon cheese burger with BBQ sauce,  baked tater with an in g","useful":0,"cool":1},"-rXqzZbZ-N5tdpd3AE82sA":{"text":"Chicken cordon blue Sammie, Mac & chz with andouille sausage special order.  All very tast","useful":0,"cool":0},"J2C7UmzPqnNIKmEVAMTbSw":{"text":"The burgers were utterly mouth-watering and the loaded baked potato that comes with them c","useful":0,"cool":0},"4-wXg6BaFs-zvH895JRwvQ":{"text":"It took 1.5 hours to get 3 burgers. My burger was completely messed up- it had onions and ","useful":3,"cool":0},"hGhMo6sCOT3rOWod9QGzNA":{"text":"Awesome little dive bar with great burgers.  Rolled back into town around midnight after L","useful":0,"cool":0},"3-40xQN-turq0Q2_muMaEg":{"text":"The Best Burger I Have Ever Eaten. \n\nI am ashamed that I have been to New Orleans a dozen ","useful":0,"cool":2},"hyw-1Yu2XyWnJr2bSKxQIA":{"text":"Our stay was an adult vaca from 8/16- 8/19..... \n\nUpon entry we happened upon a man who wa","useful":2,"cool":1},"tJmR6QLk2hAR6HqKnmYwJw":{"text":"After the most boring burger of my life at O'Henry's, I started craving Yo Momma's. Then i","useful":1,"cool":0},"bzZfFZyqlGw-lkLjYaZR_w":{"text":"Make sure you wear your fat kid pants and bring a bib. You will leave here greasy from the","useful":0,"cool":0},"uRECqjOIBJ90RwwgMIryyg":{"text":"Very poor service we waited over 40 minutes for our burgers and then the Mac n Cheese was ","useful":0,"cool":0},"oqG_qcEtTeNvRrjrwRF_2Q":{"text":"One of the best burgers that I have had ever!\nTraveling to a new city we thought that we w","useful":1,"cool":0},"7QTCmETEresso9IqbAUTQw":{"text":"I came here in the summer of 2011 and had the best burger of my life.  Reading the reviews","useful":2,"cool":0},"qmk5w73cj2wj0txhVDW0OQ":{"text":"It was late and I was hungry. With 200 4-star Yelp reviews, I decided it was worth an adve","useful":4,"cool":1},"6gNTTqt4SZn8ecTdkrBGNQ":{"text":"As a vegetarian: being in the south can prove extremely difficult... But this place blew m","useful":0,"cool":1},"SuHnZVBVe0Gmv3K7nis08g":{"text":"Came here to try the Peanut butter and Bacon Burger and was not disappointed.  The burgers","useful":0,"cool":0},"7rfuVXMZKuXEPix6wBWElQ":{"text":"I have always had the greatest experiences here. I expected more of a restaurant but actua","useful":0,"cool":0},"FKX0f7dU_j3SqarYthg1Bg":{"text":"Warm ooey-gooey peanut butter drizzled generously atop a beefy jalapeno covered patty, YO-","useful":3,"cool":2},"OqKYydkPAUpsTbeULRc9aQ":{"text":"Mac and cheese isn't special. The service was special in that it was the worst I've ever e","useful":0,"cool":0},"XN-DjC6PD7kbVXLAQUQgTQ":{"text":"We waited an hour and half while 3 other groups of guests received their orders before us.","useful":0,"cool":0},"xngGNkYEG5hqdt100vUJqw":{"text":"We stumbled on this place. We were like 3 doors down and asked a couple people if they kne","useful":1,"cool":1},"mMoPfkpJen8-TREyuTxvTA":{"text":"Yo, this is my favorite hamburger joint in the city! Why? Class and character. \n\nUpstairs ","useful":2,"cool":2},"XGKaGnQgnjyQy_X-TxxAOg":{"text":"I popped into Yo Mama's for a burger over the weekend during another trip to NOLA.  A bart","useful":3,"cool":1},"gJB9_YNqyCs38DTD-s-dvg":{"text":"I eat here every time I'm in the quarter...it's a ton of food for not too much cash!  I've","useful":0,"cool":0},"17nKCED9Etf436BuYCw62Q":{"text":"Pretty good burger place.  I'd heard so much talk about the peanut butter burger...tried i","useful":0,"cool":0},"D-ZAYzEohv22AOh-ZPBlBw":{"text":"Had the peanut butter and bacon burger and loved it!  They were out of Mac and Cheese and ","useful":0,"cool":0},"mpE4439vApkQdAXhcGLwrg":{"text":"First place we went to eat after checking into our hotel. awesome, cozy little dive bar wi","useful":1,"cool":1},"k7oiGDEIu--lztJmGZ6i0Q":{"text":"I'm not really a burger person, but this place is worth a visit. The mac n' cheese was goo","useful":0,"cool":0},"KPC9GkP3Xf5Gy8El3nICWA":{"text":"We ate here on a recommendation from a friend. It was ok, not great. It's definitely a div","useful":0,"cool":0},"Fa1Iie66C08LLxhEElhM_Q":{"text":"I stopped by Yo Mama's Bar & Grill for a burger and the choices seemed endless.  I decided","useful":2,"cool":1},"jOFTuTfaY--s27B2ZaYYCA":{"text":"When this place is not so jammed that you cant get in it still features what I think is th","useful":3,"cool":0},"YCyTkDfVQag7uGtnVVXCBw":{"text":"We stopped in for a cold beer and a place to rest after walking around all day.  Jessica w","useful":0,"cool":0},"T_xcuXBIzHX8pijSvduNCA":{"text":"Get the peanut butter burger and a fully dressed bake potato. You can thank me later.","useful":0,"cool":0},"eG5c3WDvXJyZ1b5KL-BOow":{"text":"Burger was seasoned well the sides were very good a definite quick eat option.","useful":0,"cool":0},"FzvBjMZ1DU37ciW5BRcJWQ":{"text":"Go here! Just do it.\n\nI stumbled in here about 10 years ago, and it has turned into a must","useful":2,"cool":0},"sSuQPwtDXIZh95LcB1efpQ":{"text":"A great local dive bar with some stellar food. We were given this recommendation as a good","useful":0,"cool":0},"r-S0QEDcMjpdlcz-qvAZ0g":{"text":"After seeing four stars we decided to pop in for a late night bite. Good beer and perfectl","useful":0,"cool":0},"qGBIvMbXlDObQmuol2q2nQ":{"text":"burgers were pretty fat and tasty, reasonably affordable for the French Quarter. our drink","useful":1,"cool":1},"4kFItyi-B_AyttcCWKXg-g":{"text":"I came here around 1pm on a Friday and they were very very busy. There is also only 2 tabl","useful":0,"cool":0},"1KN5adaUmbkxroNqvVf1CA":{"text":"Very good place to eat highly recommend the peanut butter and bacon hamburger their drinks","useful":0,"cool":0},"Fnd0VM22aq98s44Wt96FyQ":{"text":"Get the peanut butter burger, I can't stress this enough. Yes, it sounds gross BUT it is o","useful":0,"cool":0},"LVpQFYyft9inhsx5p2iXGw":{"text":"I became a regular in this place during my 5-day stay in New Orleans.  First off, the bar ","useful":4,"cool":2},"cqx_dVqna8NbooHlL3JTUw":{"text":"Every time I'm in the city and craving a really awesome burger, Yo Mamma is the place I he","useful":0,"cool":0},"BlMyCbqq8ECbbSMIoVsrXw":{"text":"Small place with awesome food well worth the wait. Peanut butter bacon burger, not a likel","useful":0,"cool":0},"jhYNKLxXkL-k6bcaDPw3gA":{"text":"Amaaaazing burgers and loaded baked potatoes. Plus, it's haunted!! That's what the haunted","useful":1,"cool":1},"MkBE2QyJV3oXanMTJ4MeXg":{"text":"I retract my previous statement about not getting the peanut butter bacon burger again, it","useful":1,"cool":1},"4rcznzuz8HjiEDUqWR_iAg":{"text":"its not yo mammas no mo   but same cookin crew  big bad ass burgers  and the peanut butter","useful":0,"cool":0},"pJjUfl3J4fUrieAyFBDJQA":{"text":"Peanut Butter Burger that's all I have to say! Amazing! Must try!!! Fast service cold drin","useful":0,"cool":0},"_Y0m8EYVB0lP5063bST0Sg":{"text":"We asked for a burger recommendation from our friendly Confederacy of Bike Tours guide and","useful":0,"cool":0},"bzjL6NuOcNaKkjAnk-YS-Q":{"text":"their burger with p-nut butter ans bacon was the best burger I've ever had. The server sug","useful":1,"cool":0},"dSuXkO50GRYmkiT3aA_8mw":{"text":"It is what it is. This place makes a solid burger.\n\nWe had the blue cheese and the peanut ","useful":1,"cool":0},"DQGo8EOOXHbX46ZH0tmqDA":{"text":"We have local friend that were showing us around and what bars and restaurants to go to. W","useful":0,"cool":0},"WeCBDmjoDIOsZx_cXy_02w":{"text":"Great bar without a lot of the fanfare and chaos of some of the other near by places.  \n\nM","useful":0,"cool":0},"oW8P6_PQA3W56OzlyDltxw":{"text":"Didn't even get inside, rudest \"host\" ever. Explained that I wanted to grab a beer while I","useful":1,"cool":0},"JoRLcVfI05l9IeokxtK4wQ":{"text":"I love this little hole in the wall bar, and the burgers are amazing!\n\nI have tried the ba","useful":0,"cool":0},"mqfOTZPFPY1Nk-_FEcpN-Q":{"text":"Bailed out of the over crowded pat obriens walked across the street and had some good drin","useful":0,"cool":0},"_3n2zHaHcpM9ZQdBZ2DY5A":{"text":"Wow. The music is piercingly loud and the general atmosphere is uncomfortable. Forget bein","useful":0,"cool":0},"dBrLYIKkLxvAdVBOxnp2JA":{"text":"Food: 4 stars\nService: 3 stars (friendly)\nAmbiance: 3 stars (it's good for a dive bar.. cl","useful":0,"cool":0},"GK4r2SzOw_aKKqMVFqXY2Q":{"text":"This place looks like a biker's bar, but dont let that intimidate you.  I like to go there","useful":1,"cool":1},"t2L5yw-171Mlth5r0RlckA":{"text":"Total dive. If you can look past that you will have the best burger of your life! Trust me","useful":0,"cool":0},"9TuNambnvHYrZCS2UxXH4w":{"text":"I didnt believe the hype, but peanut butter bacon burger is one of the best things i have ","useful":0,"cool":0},"eyPKGEmoCO4GzqW7RAT7HA":{"text":"Dive Bar for a quick and easy bite to eat and drink. It was good but nothing to write home","useful":0,"cool":0},"4OEehTx-Bwhhdo4c6IIMgw":{"text":"Yes the peanut butter hamburger is good...very good. Great charbroiled flavor.  Loved the ","useful":0,"cool":0},"seZgmGPLMe3cGCv5Eo5Gzw":{"text":"Blue cheese bacon burger was pretty damn good but the bun is crumbly which kinda sucks bec","useful":0,"cool":0},"9q7UHqAwfFkBFCM2jpX3gA":{"text":"So I'm use to the Asian seasoning type of crawfish where they use garlic and cajun seasoni","useful":2,"cool":1},"z1UlVCbtsKvoUZdtkJ1V0Q":{"text":"22 Jul 2014, 08:00p\n\nWhile barhopping we polled the locals on some good non-tourist restau","useful":0,"cool":0},"kDd1FbcXTCy_2OnCZvFzvg":{"text":"At the recommendation of a friend, I checked out Yo Mamas Bar & Grill while on business in","useful":1,"cool":0},"Yb07zrUbbgtSQZolHQKGgA":{"text":"I have to say I was pretty excited to go here. A friend and I were visiting from out of to","useful":0,"cool":0},"6X0pxMb5KcEaOGbnyxPDpA":{"text":"Peanut butter bacon burger!!!! Need I say more? Sounds gross, but tastes like heaven. The ","useful":0,"cool":0},"PyOMxQmT-40InItA9-7OtA":{"text":"Best burgers in the quarter. Burgers are juicy and well cooked. Salads are fresh and green","useful":0,"cool":0},"QZ-EZ4DMam8fyZmyXpvrEA":{"text":"I'm so excited!  My husband and I were in NOLA two years ago with a group of friends and f","useful":0,"cool":0},"Ia9dHPdj_sDNDEL_zMUO5A":{"text":"So here's the deal...\n\nFirst off I want to qualify my 4 stars. It would take an out of bod","useful":1,"cool":1},"NKjesZ_uk7p0It_eURtilw":{"text":"This place was absolutely amazing.   Fabulous food,  great drinks and a fun atmosphere.   ","useful":0,"cool":0},"OLpTXf0iBYHEUp5Q3tXdkg":{"text":"A must visit. Great food and super drinks- don't bring your grandmaw... Interesting decor ","useful":0,"cool":0},"PLXZd6_bqPlSIwvSQGZO5Q":{"text":"3am? On or near Bourbon street? Had a few Hand Grenades?? I thought so. Then you NEED to C","useful":0,"cool":0},"JMXskAPihTWn-iFBOVANlw":{"text":"Quaint little dive by that we found when looking for a burger! Burgers come with baked pot","useful":0,"cool":0},"OoTRzY_7M8OF3DB40wBm9g":{"text":"My lunch companion and I came to Yo Mama's Bar & Grill on the recommendation that their Pe","useful":0,"cool":0},"XTyOAJ9Q5eLkbQuWJvZXSQ":{"text":"I have been wanting to try out this place for the past few months to see what the crave wa","useful":0,"cool":0},"SzWrQvkBxYNWRLKBwXwm6w":{"text":"Wow this place looked like a hole in the wall but, it was the best burger I have ever had.","useful":0,"cool":0},"V9WxvyuFn4lMJTgJ1DldSg":{"text":"After hearing these were the best burgers in the city, we decided to try it.  The staff is","useful":2,"cool":0},"2j18UTYp1espHb4SOLI6LA":{"text":"I use to always eat here until they fired there old staff and rehired new ones. The new st","useful":0,"cool":0},"3P8xwXC2iuY9C3bAaYc8Rw":{"text":"I had lunch at Yo Mama's last week.  It was the best meal I had in NO, and I ate at both G","useful":0,"cool":0},"0W7xTEMhT2UirBmjJagQTg":{"text":"A local sent us to Yo Mama's during a visit to New Orleans and we weren't disappointed. Th","useful":0,"cool":0},"dnGKdY0UprYBIEaIzFzgqQ":{"text":"Was back in New Orleans this summer and of course I had to stop by my favorite burger join","useful":1,"cool":0},"TOU-FHYsFS6F7zDv46PqXA":{"text":"All dive bars are great for drinking, but Yo Mama's has the food to go with it. Bring your","useful":0,"cool":0},"HZ39gkvV-nSwAvEkXC35NA":{"text":"good burger made better by having to wait like 2 hours for it!  maybe that's the secret.  ","useful":0,"cool":0},"jQkWKKGMS06LRTdMTABtBA":{"text":"As a bar: awesome; something like 50 types of very good Tequila to try.\n\nAs a burger joint","useful":7,"cool":1},"x8KQuKz1StoJrY6CEvA3jA":{"text":"Arrived at 10pm on a Monday night. Not crowded, good location, friendly staff & a good fee","useful":0,"cool":0},"jTmBsqxdWnwzx8lvavBsFg":{"text":"I'm not a peanut butter burger kind of guy but that's not why I go here.  I have my staple","useful":1,"cool":0},"MoL4eOxyIzeqO8tbaoQ1FQ":{"text":"Amazing peanut butter burger! Interesting pairing with loaded baked potato instead of frie","useful":0,"cool":0},"HFa4-YLxHUqodjWsdol-0w":{"text":"On our last full day in NOLA we were a lil tired of creole, cajun and the local fried spec","useful":1,"cool":0},"dLqUzPlFSug0ZaiNdHLoLw":{"text":"if there is one immutable thing about me, it's this: i *heart* tequila. \n\ni blame my brief","useful":0,"cool":1},"PS5U8Rcf3RcjufbmwRqHIQ":{"text":"As a bar this place is ok but if you go upstairs to get some burgers. Even if you don't ea","useful":0,"cool":0},"sV9ZqfhSpBRjJeswTdYWYQ":{"text":"I really wanted to try Yo-Mama's burger with peanut butter on it.  When we showed up to th","useful":1,"cool":2},"OF0Se2TnomC0pKs2BYZfIg":{"text":"At some point in time, ancient history, a New Orleans restaurant, most likely Port of Call","useful":1,"cool":1},"tsIG0oBygX5cVpQj_gJPmg":{"text":"Don't cheat yourself. Just order it and await bliss.......You know what I'm talking about.","useful":0,"cool":0},"i8PDSv-Y8dy0-QlB9gifog":{"text":"Peanut butter bacon burger is the best.  And Angela is the best bartender in town.","useful":1,"cool":1},"RLnseqvYTfscgxRXUSf-jA":{"text":"I love, love, love Yo Mamas!!!! The peanut butter burger changed my life. Awesome tequila ","useful":0,"cool":0},"TNUFXYpTYXg6V0BZXKPOBQ":{"text":"Yo Mama's is perfectly dark, dingy, divey and delicious. I feel it embodies the gritty nat","useful":0,"cool":0},"lQCh2-UK7xy25xCFrTRaLQ":{"text":"Want a sloppy burger that hit's the spot in a laid back atmosphere. THIS IS IT... Not only","useful":0,"cool":0},"zy8Rw9sFjvwenoUgxMLj9Q":{"text":"Every time I come here, I order the same thing--the blue-cheese burger. It's SO GOOD.  Bes","useful":2,"cool":1},"zRc7ZWepe7hGwqQh9JkyAg":{"text":"Went in for a late night burger. Food took forever, it came out cold, service was eh. Seem","useful":0,"cool":0},"DEHfKUdLeX109DHxEqMWaQ":{"text":"Came here on our last night in New Orleans. I ordered the peanut butter burger, let me say","useful":0,"cool":0},"hLVJNUa_ePnw1FjFwxlDkA":{"text":"Ok ok ok the peanut butter bacon burger is the sh-t. This is the best burger in all of New","useful":0,"cool":0},"leR1P_OJC0C6M8mK4arTvQ":{"text":"Amazing burgers!!!!! I absolutely loved my bacon cheeseburger. My husband had a peanutbutt","useful":0,"cool":0},"hZL-RsPyoJY_o3L9o1oBuQ":{"text":"Great place! The burgers are wonderful and served with choice of baked potato, potato sala","useful":0,"cool":0},"N6LsvfypOJsXM_bH_dh9aQ":{"text":"I don't know what makes these burgers so good, but they sure are. This coming from a forme","useful":1,"cool":0},"E59Pp0anQREULZLaV0zeNw":{"text":"Burger was excellent.  My husband and I split the bacon burger (added cheese) and it was p","useful":0,"cool":0},"mHXhnwIQI_NrShsh1DHF7g":{"text":"Roaches. That's all I have to say. \n\nWell, maybe not. Roach problem aside, I don't underst","useful":0,"cool":0},"_NFhvbvZInEYIxSSNBn-Rw":{"text":"Burgers and mac n cheese are pricey and overrated. I had the one with avocado and jalapeño","useful":0,"cool":0},"4zhe3lNjkKOy2jlaVmi5dA":{"text":"Damn good burger and baked potato. Was always a Port of Call fan but they give them a run ","useful":0,"cool":0},"EPjuZEH-ZIovqIqtRo3Ifg":{"text":"One word: peanutbutterbaconburger \n\nGreat food, fun, laid back bar atmosphere. Go here.","useful":0,"cool":0},"uF1TUYiCYBLIX65qR1iyVg":{"text":"Best Tequilla bar in the Quarter.  Oh yeah, and their burgers are to die for!","useful":0,"cool":0},"1v-tpOlRqKuH0h5zhurkYA":{"text":"I LOVE their peanut butter bacon burger. You definitely get the sweet, the salty, the juic","useful":1,"cool":2},"tJMbrdXOI_Kl7XMg9UkNOg":{"text":"This place contends with Port of Call for \"best of New Orleans\".  The inclusion of a garde","useful":1,"cool":0},"TscxycD9lKuiKY3G4saL_g":{"text":"Great atmosphere with an amazing bartender, Rose.  The peanut butter and bacon burger is d","useful":0,"cool":1},"I19CrwKw-nHnZfG4ofncJQ":{"text":"I ordered a plain burger with bacon only.  When it was brought to the table it had peanut ","useful":1,"cool":0},"E33kAnZG1H-L9vPl7gIxFw":{"text":"I was in the Quarter for five days and I think I was in this bar at least four times.  I l","useful":0,"cool":0},"04iEMUl3B1n12UvT7LRhgA":{"text":"I think I may have drooled upon opening the menu. Though I did not go with the Bacon PB Bu","useful":0,"cool":1},"EfBwTK9tzyrXhRGtd8ZGJQ":{"text":"Cool place to stop and have a good burger and a few beers.  Food is more than above averag","useful":0,"cool":0},"OG9V15S66dsREHSP-kLSKQ":{"text":"BEST.BURGERS.EVER. Cool divey bar that is perfect for a bite night or day. Oh-And the bath","useful":0,"cool":0},"0XtPtnakewMlcJEsONznig":{"text":"Literally the best burger we have ever had. My friends ate the peanut butter burger while ","useful":0,"cool":1},"T3H2eFp-mszGqvzVjOgfRw":{"text":"As a Latina I never thought I'd make my last meal a burger, until I had Yo Mama's....I thi","useful":3,"cool":2},"EXV7eIhO3gS-0EUN5-OmMg":{"text":"YUMM! I had a Cheddar Burger here- after my fiends and I waited to get a table in the incr","useful":0,"cool":0},"NHfFfCoP8rcmunc--hPYoQ":{"text":"What a gem!  Thanks to Yelpers for helping us find this place.  Its an authentic Nola food","useful":0,"cool":0},"C71Dw34YsodsN9Cf6SqurQ":{"text":"Came here at the end of the night twice. There is something really comforting about burger","useful":2,"cool":1},"yRAUZLWvzbjnqYS_m_777w":{"text":"Dam good burgers!!! Had the Bacon with american cheese with the loaded bake potato and it ","useful":0,"cool":0},"QS-tLs4s9QB5hK-yWnXOjA":{"text":"The peanut butter burger was one of my favorite meals while in New Orleans. Do your self a","useful":0,"cool":0},"uqTcK4jN4DEzruh9-n1RKA":{"text":"This was my first stop in NOLA. We arrived late at night, and were desperately looking for","useful":0,"cool":0},"1sUPeCKzDnhdWSOtwR_Gcw":{"text":"We attempted to try the food based on all of the awesome reviews about their burgers.  We ","useful":2,"cool":0},"UFzC0ssnJgxz-Vox19Vjgw":{"text":"We were referred for the gumbo.  Not only was it great but the burgers were out of this wo","useful":0,"cool":0},"cbVSNa6zW7EBrQjCGSBeiQ":{"text":"We stopped in here one night based on the good reviews on yelp. We had heard of a peanut b","useful":0,"cool":0},"re0qS4ch0O41s_duQRW2Fw":{"text":"We stumbled in here during a long afternoon of drinking around town, very happy we checked","useful":0,"cool":0},"SoLRrW8wakzk7LIippWJ3A":{"text":"We ordered two burgers and had to wait over 30 minutes (the place was not full) and so I w","useful":0,"cool":0},"pV622tiYi68ts5Bnm1wBhQ":{"text":"All of the reviews are correct - peanut butter burger is fantastic!","useful":0,"cool":0},"1dUM6hq-p_5aGb2eDdbsmg":{"text":"The best & only peanut burger have ever had.\nThe magic is upstairs...very nice setting. A ","useful":0,"cool":0},"M3g_X0lMXqaC99Ug6rfatA":{"text":"This was my first burger in over a year with a bun (I usually eat lettuce wrapped burgers)","useful":1,"cool":0},"LIsn-ozxYp69h9DrCn0ziQ":{"text":"THANK YOU YELPERS FOR MAKING ME AWARE OF THIS PLACE!!!\n\nI am wrapping up a four-day stay i","useful":0,"cool":1},"EPxgyTMqiwq5Qb9n3b_7GA":{"text":"Best burger in NOLA? uhhhhhhhh really? \n\nMaybe the chef was out that day. My little mama b","useful":1,"cool":0},"vSM2UHpEv0ihfAEALYCIpQ":{"text":"Yet another place that tempts me not to cook in the Quarter. Being only a few block away, ","useful":5,"cool":3},"7laL94uLi4GpYEdPNmK6qg":{"text":"Friendly service, but the on-tap beer selection was lacking.  (What do you expect from a b","useful":0,"cool":0},"E1hkOtD8aNZWn7H2aS3lSw":{"text":"The burgers were awesome and the service was really good.","useful":0,"cool":0},"xjPmrtDGfOOU13jKOEyjgw":{"text":"Every time I go to New Orleans, I crave Port of Call.  This time, someone recommended Yo M","useful":0,"cool":0},"0X-1fUSTuLFfu1gOuM0d4w":{"text":"I came here a few times over the last several years, and considered it to be one of the be","useful":0,"cool":0},"ESwzTM7k9H6fUDqZOH_6hA":{"text":"Ive been gone from NOLA for two days and I cant stop raving about these burgers. They were","useful":0,"cool":0},"KSi8W9bdHSAiKwtcFTBZuQ":{"text":"Giving a 5 star based on taste of food .. Every time we visit NOLA we make it a point to s","useful":0,"cool":0},"ANWd6sCrotn50q-npKiYjg":{"text":"The only thing you need to know is that they have a peanut butter bacon burger, which soun","useful":0,"cool":0},"vXGuIVLjYMs6vzW_0P17WA":{"text":"I was super excited to go to Yo Mama's after reading reviews.  It seemed like the kind of ","useful":3,"cool":2},"Yq1CoNclfIkz4wNA0XOMsg":{"text":"We decided to drop in for a burger last night at the recommendation of our friend and it w","useful":0,"cool":0},"8RbgayqIuGgD7ZnfrKKJZQ":{"text":"Peanut Butter Bacon Burger, AWESOME!  Especially after a long night on Bourbon St.  I used","useful":0,"cool":0},"BqAfK5vrQeKLBZ0TJpYH_g":{"text":"I thought the peanut butter burger was weird but it was so highly recommended that I tried","useful":0,"cool":0},"9JtMfKULDAdJWt-PWNVjLA":{"text":"This place had an interesting vibe. It looks like a sketchy dive bar. It's dark, has red l","useful":2,"cool":0},"b_HWOdlqla7bBnLMPX1OZw":{"text":"I got a bacon cheeseburger and baked potato.  It was very crowded when I came in, as I fou","useful":0,"cool":0},"1fsjZat0Hr4VSDEfmW0ZRw":{"text":"Let the Gambit and Zagat and others play politics with food, but if you want the best hamb","useful":0,"cool":0},"y8eImhpLG4ZNRMr25gKrPA":{"text":"Went on a Sunday night at 7pm.  Upstairs server suggested we go elsewhere (three adults in","useful":0,"cool":0},"op3FhQCHdLn6qNqyQzjElw":{"text":"I really liked the atmosphere; great music. I had the peanut butter bacon Burger, and it w","useful":0,"cool":0},"PD1_rsgzrQOhDIy5Tl6AYQ":{"text":"The burger is really excellently prepared and seasoned. The bun leaves something to be des","useful":0,"cool":0},"N3zp3o0xHDI8FzIOFmo4gw":{"text":"Don't miss it! Best little bar in the quarter! Peanut butter burger worth a try for all pb","useful":0,"cool":0},"UIJMg8Jd7RgUWYDBBN55mg":{"text":"There is a reason that I visit Yo Mamas every time I come to New Orleans: the Peanut Butte","useful":0,"cool":0},"PrqkQvFGT7MYqHG5571PmQ":{"text":"I have a hard time believing Port of Call makes a better burger than Yo Mama.  I don't kno","useful":0,"cool":0},"ME6d-UiBhVM9mzEcXPb2wA":{"text":"Peanut Butter and Bacon Burger is an experience I share with anyone new I bring. \n\nGo sit ","useful":1,"cool":1},"pTAkxWC-oMs974_qe6_9bw":{"text":"I didn't venture out too far with their burgers, just settled on a cheddar burger.  It was","useful":2,"cool":1},"65rCllDSmwdLqYr5aRxBrQ":{"text":"We went for lunch hoping for a good experience.  We were very saddened.  Burger was ok.  B","useful":0,"cool":0},"WSkBxtwr-ZVz4f4LuJDtGA":{"text":"My dining companion and I arrived in New Orleans around 11:30 PM on a week night. Hopping ","useful":0,"cool":0},"Y4Nc1pSZnaTWxCXfML8-7g":{"text":"I had the peanut butter bacon burger. I was really scared but it turned out to be awesome.","useful":0,"cool":1},"OHS2Hu93QFJ1uouyU1CO9g":{"text":"I walked in with a friend on a somewhat busy weekend night. We were starving. The bartende","useful":0,"cool":0},"WkuGJbPDCTBdrRYhnNi5ag":{"text":"Dive bar, dim lighting.  Good service.  Worst turkey burger (mostly filler) I have ever ha","useful":1,"cool":0},"wCbNB-fDzRvK1gxKeYqAew":{"text":"We were starving so my husband and I sat at the bar, got the bartender's attention and got","useful":0,"cool":0},"VV7mdTW62B1zLtjpDxoYUw":{"text":"Been there twice and last time a friend and I split the Peanut butter bacon burger at the ","useful":0,"cool":0},"TrYzrSW3X7Le5YIriBzp7w":{"text":"Hells yes.  They serve till 2 am and I ALWAYS get a yo mama burger when I'm home in New Or","useful":0,"cool":0},"vrjF4IJtzIYmtrz9g1nY0g":{"text":"I walk by here everyday (in order to get to work) and, I stop by every so often to get a d","useful":3,"cool":1},"Z4FiHvAjUVKeH0ybaKEPTg":{"text":"We tried the peanut butter bacon burger, blue cheese burger, baked potato, and gumbo. I li","useful":1,"cool":0},"dN6tbEQKRn-4niGWyzHqGw":{"text":"Old Brothel turns Dive Bar = One great burger.  I have one recommendation: GET. THE. PEANU","useful":2,"cool":1},"D9DcQNA1lsOx5jFa-jL_dw":{"text":"We stayed at a hotel not far from this place but did not feel like walking anymore. Thank ","useful":1,"cool":0},"VSPhdN7w0pSX5bRNYc_yZA":{"text":"I have been to Yo Mama's several times with friends and have never been let down by the qu","useful":1,"cool":1},"6KltO4fSTl6uBqxm0crstg":{"text":"Rudest bartender ever! After waiting for some time,  I tried to wave down the bartender ( ","useful":0,"cool":0},"AbyNDKD2_hbOGiW0wd5Dng":{"text":"After tasting a friend's Peanut Butter Burger 6 years ago I have never ordered anything el","useful":1,"cool":1},"Sb8ZfyRP6M78esRzo4W_4g":{"text":"Great burgers. Great price. The people here are really fun and give great service. If I ha","useful":0,"cool":0},"MbHeS04V27O6bsIPQSx3LQ":{"text":"tried to place an order for delivery and was told they were too busy.  with that kind of b","useful":0,"cool":0},"OrL3v-NOsDH38jimhOAuxw":{"text":"The owners went on some insane rampage and fired all the long time staff in this once grea","useful":6,"cool":3},"MLyakcGGUDZ9KXSnyBQNMQ":{"text":"Possibly one of the best bar burgers in the FQ. \n\nI love Yo Mama's because it's open late ","useful":0,"cool":0},"z4DOP_NilAq3Gb0sKX6DEA":{"text":"Ok, went back to Yo-Mama's on Saturday evening for dinner.  Laughed as my husband and I pa","useful":0,"cool":0},"2_Iq0D5F2tlLH_u_qfPNBA":{"text":"Went here the other night before driving to Biloxi after reading other Yelpers reviews. \nS","useful":3,"cool":0},"faFYrIDG_93vvyLdroni3w":{"text":"I don't care for NOLA and even less about bourbon street. This isn't on Bourbon but is clo","useful":0,"cool":0},"gzB8r0S1vMfqgz-OM_9ByA":{"text":"best loaded potato at 2 in the mornin'...hand down! FQ's best!","useful":0,"cool":0},"stkubcthn11RqFtsF2vggA":{"text":"I love Yo Mama's.   Great Burgers, huge tequila list and a little something different than","useful":0,"cool":0},"COdzSTgJuXRfh_EFLUB0ag":{"text":"Best damn burger...\nWe ate here twice on our vacation to NOLA. Yes it is a dive bar but th","useful":0,"cool":0},"GzD4R80YBP7iQUl0qjmbfA":{"text":"Take a chance and order the peanut butter burger. The baked potatoes were also awesome.","useful":0,"cool":0},"CBm1QzVi2nhcIjjiw9NOJw":{"text":"One of the best mushroom burgers I have EVER had....seriously!!! The mushroom burger is to","useful":2,"cool":1},"FfnEXFRZkH-8i96QCJ5hlg":{"text":"Peanut butter burger is fantastic.   Get it with the loaded baked potato and a Day of the ","useful":0,"cool":0},"Ud1b924td5GqxeYcpx4jlg":{"text":"Recommended by a local, this place has fantastic hamburgers! \n\nWe told ourselves we would ","useful":0,"cool":0},"PyJo2ZgIUFC3wHLELdcpNw":{"text":"I'm not a big burger girl, but when I was in NOLA for Mardi Gras, this place was the perfe","useful":0,"cool":0},"LlPCyvo3VVXehQ9Vg_47zg":{"text":"Best gumbo in town. Guaranteed. Just get ready for a little bit of a wait, but it's well w","useful":0,"cool":0},"Ug9Z63ooynd86wQbeQx1pA":{"text":"Latenight looking for anything to eat, finally found somewhere open. The burger, to be hon","useful":1,"cool":0},"h0iKYrxjdrHoceZpkoM0dQ":{"text":"Went for lunch and ordered their Yo Mama mega burger. Holy smoke was it big. It was a grea","useful":0,"cool":0},"kQGrWPOK3z0uHq2BDgvzcg":{"text":"We went while in the French quarter on our honeymoon. It's a total dive bar and smoking is","useful":0,"cool":0},"LFgV-RSR4BfghPOtfdp9xw":{"text":"Fun place to check out when you're in the French Quarter. I definitely vote for them over ","useful":0,"cool":0},"Cwmq5q2-p6RNtZvENTduSw":{"text":"Yes I tried the peanut butter burger and it was interesting to say the least. Texture was ","useful":0,"cool":0},"MPjP3l68SHPSlHi-D4xAhQ":{"text":"1. I don't want to write this because I don't want tourists to find out about it more than","useful":2,"cool":3},"w5rdE2_YDY4Msv2cvs4JSA":{"text":"I had the peanut butter burger with mac and cheese and it was delicious. Nice hole in the ","useful":0,"cool":0},"l01VXiOh49Ue8vuyHBw1Vg":{"text":"Not sure what the hype is about. Burgers were barely ok. Service: absolutely horrible. Eve","useful":0,"cool":0},"iMrrKYC_Wba7J-96t4-o4A":{"text":"Peanut Butter Bacon Burger was awesome!  I wished I had had time to get another one while ","useful":0,"cool":1},"WOvUdkc51M-Y_xRQifA_xw":{"text":"Talk about a place where the bartenders take on the role of yo mama. The prices aren't the","useful":1,"cool":0},"z2_cN9sdtNJWRJ5G5PI4cA":{"text":"Absolutely love this place!! The burger and baked potato was amazing!! Will absolutely vis","useful":0,"cool":0},"A6Y2LcNRa-7ZiYbbkBFBMg":{"text":"Drinks were weak, but cheap.  Can't comment on the food because we didn't eat.  The \"artwo","useful":0,"cool":0},"q9eXdEserVRO8Ou7fvSmtA":{"text":"Went there last night after a night of drinking beers.  Needed a big juicy burger.  I orde","useful":0,"cool":0},"UCV1bEPfyo_7puL5Qzzgmg":{"text":"An alright place to go. Classic hole in the wall, dive bar. Had a nice leisurely lunch her","useful":0,"cool":0},"LaXPo9L0VKCFhNN7VX6zcA":{"text":"We ordered burgers and they were pretty good burgers! Quality meat, fresh toppings, nice b","useful":0,"cool":0},"gcSvhP1fkqWGYFLee-Nq1g":{"text":"We went here on 4th of July weekend. I was in the mood for something at a decent price. Th","useful":0,"cool":0},"ssoa_mBNWPdIAiTaKK-5Hg":{"text":"Great burgers! Seriously, they're delicious. Served with baked potato, such a good combina","useful":0,"cool":0},"oU4x_tO6QYY0xfWsHi2kXw":{"text":"I lived in New Orleans for six years.  I went to Yo Mama's a few times while out and about","useful":0,"cool":0},"RLW0Uskhns_v2JM65V6S9Q":{"text":"Ive been here a number of times and yes peanuty goodness describes  the famous Peanut Butt","useful":3,"cool":2},"GhVaf6m5v9qcbFCfzmRn1A":{"text":"Great late night burger n baked potato after bourbon street drinks all night, don't try to","useful":0,"cool":0},"CH74RTaT8SpzmVEy4nV6ZA":{"text":"Had been decent. Not so good now. Its been a few months. They got rid of a lot of the peop","useful":4,"cool":0},"P8XGVhSmWGDi_nM1aBPDAw":{"text":"Burgers - Excellent! My Bartender/Waitress (She's originally from Albany, NY) - I can't re","useful":0,"cool":0},"yLsiweMBMIvTdh9V4E2V4w":{"text":"This was my first meal in New Orleans this trip and it did NOT disappoint.  I was slightly","useful":0,"cool":0},"QAIkzTL-Qa3tQJ9AYGYYCw":{"text":"Burgers were on point. The food was delicious I tried the peanut butter bacon burger which","useful":1,"cool":0},"t1WYoanRkhMi_r95E5Dwvg":{"text":"This was a pretty decent burger and really easy to find.  Right across from preservation h","useful":0,"cool":0},"x4o00JUd89kAzUt6eb2W1A":{"text":"I really liked this place and see myself coming back. The cheese burger was awesome! The b","useful":0,"cool":0},"n517iT2-j_NhmSTgNhLQ4g":{"text":"We went to ya mama's after being highly recommended by a waiter at Pat O Briens accross th","useful":1,"cool":0},"wCRZnXS-wbv4F5e4_sOhPA":{"text":"The peanut butter bacon burger may sound weird, but it's pure genius. This is my second ti","useful":0,"cool":0},"BOKFFkK2NpMxbappaIurQw":{"text":"I don't know if it was the time of night we went or what.  The service was mediocre and ou","useful":1,"cool":0},"0FekC9YOhEwqDwZRNE1cGA":{"text":"I'm in town for business and when not working looking for the best burger in NOLA (pub atm","useful":1,"cool":0},"M1G8QTRgmRq5H8pLGMvV1A":{"text":"We have eaten here several times. The food Is great! Service not so much.  The LEAST the s","useful":0,"cool":0},"JsLjYYDl-ss7oFfwSCYE4g":{"text":"We came back in here because the food and the ambiance is great! Service is outstanding. L","useful":0,"cool":0},"Gt1WnYSfIIecebfIEdhzWQ":{"text":"Hot damn - the peanut butter burger here is really off the hook! Those two flavors married","useful":4,"cool":4},"HzKtDX79kcgXzL7DeOzE3Q":{"text":"Good burger, cooked how I ordered it, a famous peanut butter bacon.  Service was good.  I ","useful":0,"cool":0},"ZY3T_VFVMy1Av3qoCu5CzA":{"text":"I've had two burgers here and enjoyed them both.\n\nThe peanut butter burger had a little to","useful":0,"cool":0},"C8DY-RyGsq5wSblMH0l1AQ":{"text":"Love, love, love their burgers, especially the bleu burger.  Consistent food.  Don't expec","useful":0,"cool":0},"tMdfi-zX7gIKpP9yWuT7eQ":{"text":"Personable staff.  Best burgers in New Orleans.  Great choices.  Great food.  Great prices","useful":0,"cool":0},"0yRxC3znLFcp9408X9gK3A":{"text":"Definitely a dive bar. Food was made fresh, though took 30 minutes to come out. Good quali","useful":0,"cool":0},"-DHKOMRZDg8TeNckr4TNQw":{"text":"Loved this place!! The burgers were perfectly cooked with amazing flavor!!! We went here b","useful":0,"cool":0},"s-uQO5e41FJo3p0b1bqdQQ":{"text":"Definitely best burger in Nola but absolutely the best gumbo in the USA.  After a month lo","useful":0,"cool":0},"N4qWGm9li-pd4SK1M1pLjQ":{"text":"Visited Yo-Mamma's with some friends in August and had a great time. We tried to go for di","useful":1,"cool":1},"AVdtjapZ56mb3M18y3fF4g":{"text":"This used to be one of my favorite places in NOLA. I returned to have my favorite baked po","useful":0,"cool":0},"SmpmL1_NOJ9-fsHOv6wQnw":{"text":"This was the best burger i ever had. It was tremendous and flavor filled. It had any toppi","useful":0,"cool":0},"9qtOW-SO75ISbGp5ZoLWKw":{"text":"Peanut butter Burger!!! Yes please. This burger was freakin' AWESOME!!!!! Great atmosphere","useful":0,"cool":0},"B1aNe6Zkwdaj2Wz-43hAqw":{"text":"Love this place !\nI stumbled upon this place by accident when I moved to New Orleans ! \nIf","useful":0,"cool":0},"csshWISQfQas92JX0ENv8w":{"text":"During our decadent little tripnto New Orleans we ate at many great places...even though i","useful":0,"cool":0},"0XEIENoMnSZ7y9384p-8yA":{"text":"Boyfriend got Bullfighter burger and he said it was the best burger he's had for long time","useful":0,"cool":0},"mE4NacfOlAQ7FAjQad4YLA":{"text":"This is a tiny, dumpy looking dive bar right in the middle the French Quarter.  We heard i","useful":1,"cool":1},"32Cuyz9l-zpjm65fNHPW1g":{"text":"My mom and me were looking for somewhere to eat so we chose here. At first she told me it ","useful":0,"cool":0},"U2-YLuDQcU2O3jw03TW-Ig":{"text":"This is an NC-17 burger joint, which instantly makes it better than any chain burger resta","useful":0,"cool":1},"jds5pr7DKRQbQMv6TD8DaA":{"text":"I have to agree with Tiffany on this.  In fact, this place is in my top five for bars in N","useful":1,"cool":0},"sfPcDElKP6MlwhQpqf9Opg":{"text":"I'd just as soon come here to Yo-Mama's than wait in line at Port-o-Call. The hamburgers h","useful":0,"cool":2},"9dXsPexA7GVK5tJnxg1dbw":{"text":"This place was good the food was awesome, the black lighting upstairs kind of tripped me o","useful":0,"cool":0},"4k2nmC7x29dG6-sbUctudQ":{"text":"I've been coming here for 10 yrs. This is an other must stop for me.  This is a dive bar. ","useful":0,"cool":0},"RywmKa2w1713CMMmGgVYKA":{"text":"As soon as we arrived to New Orleans we made it a point to ask the locals what was the bes","useful":0,"cool":0},"aiXUMXd0frvZbsVsuQEJvQ":{"text":"Great burger had the classic cheddar burger. Going to try the peanut butter one tomorrow. ","useful":1,"cool":0},"RWGvAaBhG7Qt6pFpiriJUA":{"text":"Call it a dive if you want, but, it's not. it's a  block  off of bourbon street, and serve","useful":1,"cool":0},"DzHcGXjwurJRefgTvT7mwQ":{"text":"One of the best burgers in NOLA by far!!!  Huge sides that could be a meal in themselves. ","useful":2,"cool":1},"Ysmp3wCjHEuVT1LCXtIjmg":{"text":"The service was typical of a small bar, but the Peanut Butter burger is what gets this fiv","useful":0,"cool":0},"OPHq0PoWBXukxuvk5HeL7g":{"text":"Like a moth to the fucking flame I ended up eating my first meal at Yo-Mama's... I drove 9","useful":3,"cool":1},"Zzjq-hhCJio6smIYBu0f4A":{"text":"OMG the peanut butter burger was to diiieeee for.  This bar was worth my little walk.  Alt","useful":0,"cool":0},"MVAa3mX1W8edZjSItK05Wg":{"text":"Wonderful food and great service. Burgers are huge!! Place is small so it would be hard to","useful":1,"cool":0},"7fkR0sEEsZn6PNibd21VOA":{"text":"When i walked into the bar setting with people smoking i wasnt looking forward to eating h","useful":1,"cool":0},"BAAZM16zYUY5pQszDQFoVg":{"text":"Let's just establish this as the bar to beat for great dive bars with kick ass burgers.\n\nH","useful":4,"cool":1},"M9s3IY7bn5hvcPY_X8Z32g":{"text":"Once I heard that Yo Mama's had a peanut butter bacon burger on the menu, I knew I had to ","useful":0,"cool":0},"F7GAXT8PQbocQsU-UVd98Q":{"text":"I have to admit, I was a little nervous walking in. Blazing hot, sticky, oddly decorated -","useful":0,"cool":0},"znf8zkjbBIO6UteqOXta6g":{"text":"Try the Peanut Butter Burger, try the Peanut Butter Burger, try the Peanut Butter Burger, ","useful":0,"cool":0},"7DaRqBfu4Chjd0jxscpa9Q":{"text":"The peanut butter burger and the service was 4.5 stars.   However, the accompanying mac & ","useful":0,"cool":0},"tTq5TESS8yDEDQMlj31ZfA":{"text":"THANKS YELPERS FOR A GREAT FIND!\nThis was by far the best burger I have ever eaten.  Thick","useful":0,"cool":0},"mKahoyCu27o1WK77NRqR9w":{"text":"Badass mac and cheese! Huge, delicious loaded baked potatoes. Burgers = amazing. It's a li","useful":0,"cool":0},"KFzF6Y5CgKhnfYQVd3_Y8w":{"text":"Huge, delicious burgers! If only they made them like this in Cali. Friendly service and am","useful":1,"cool":0},"OEk6xH6zuugdlefjl4a9ow":{"text":"Awesome.  They keep it simple with only a few menu items, but many options of how to dress","useful":0,"cool":0},"g1LGvbqWkx8DItoJUwjvoQ":{"text":"Had the Bull Fighter. Was so good I had to go get it  again the very next night. Substitut","useful":1,"cool":0},"2EgCzF8rI8usuiHObJ9zkg":{"text":"Chili cheeseburger and potato. First visit. \nBacon Cheeseburger and Mac n cheese. Excellen","useful":0,"cool":0},"wmuSiAeUEWpXYZAjRNEQqA":{"text":"Hand down the BEST burgers in NOLA!!! I highly recommend the peanut burger & bacon which i","useful":1,"cool":1},"BEJyFCd923_nOGEx95nuNA":{"text":"Worst food I have eaten in Nola. undercooked burger, No sides available (chips only- and n","useful":0,"cool":0},"YvvbglBSMRIRp-vL6hRmFQ":{"text":"Burger was 4 stars, but service was off. Bartender was overwhelmed, come to find out it wa","useful":0,"cool":0},"vwhA28uVbTISfX1tL9Ueiw":{"text":"I yelped this place while here in new orleans for a wedding.  My friends and I wanted burg","useful":0,"cool":0},"jrWKHIAo57eGURtsPoszJA":{"text":"HORRIBLE DO NOT GO!!! Waited over 75 MINS for a burger!!!!! It was cold they then three th","useful":0,"cool":0},"D7yFhSubQDd_VoYbalZuNQ":{"text":"Very Tasty Burgers.\n\nWorth a wait for sure.  Another great little bar just off of Bourbon ","useful":0,"cool":0},"0VL3xaNl8JxDWNTC-rHXTQ":{"text":"Sad to say but the last two times the fiance and I visited what was our favorite burger jo","useful":0,"cool":0},"VyW9nuuqAY453F16reVAng":{"text":"My husband and I popped in this afternoon to split a burger.  To me, it's usually a good s","useful":1,"cool":0},"os3fPHxyuIiEoYX12rIbEA":{"text":"Burgers are legit. Had the cheddar cheese burger w/Mac and cheese. Burger was cooked a nic","useful":0,"cool":0},"6KKWwIuuAjaDqUCVSSN3hQ":{"text":"I had heard great things about their burgers, so last time I was in the Quarter I thought ","useful":1,"cool":0},"i_sQ94LVI_BJ7wbLYsFsJg":{"text":"Better than port of call!  More selection and real bacon bits!  Cant wait to go back and t","useful":0,"cool":0},"cAMZ8jMsTEuBPdQS6PebDA":{"text":"I went with my husband and parents while vacationing in New Horizons for the weekend and w","useful":0,"cool":0},"uoblkmDBXIkCZHVf2noXTQ":{"text":"We came here after a bartender at Johnny White's told us this was the best crawfish boil i","useful":1,"cool":0},"FrU_v1cLQlrBkXLuCYM9Fw":{"text":"Nothing like late night boozy snacking and craving a hamburger. We tried the peanut butter","useful":0,"cool":0},"z9VMLJXgB1nQ6Tjzy7cnDw":{"text":"We were walking down the street trying to find this place and walked right by it. It is ea","useful":0,"cool":0},"IvLOPU3jGDmz6M1x--mj3Q":{"text":"This place has, by far, the BEST hamburger that I have ever eaten!!!  A small group of fri","useful":0,"cool":0},"v0UQxm-Gjq63UJPq6VrDIg":{"text":"My favorite burger and Mac and cheese anywhere.  I typically get the chili cheeseburger, b","useful":0,"cool":0},"flzq-S4fzkId-kcQes-2sg":{"text":"I've been here a few times and I've never ordered anything but the peanut butter burger. I","useful":2,"cool":1},"i1Dmkp27cfixYg2VJ7Jr3g":{"text":"Yo Mama's is a good value off Bourbon for a quick and basic meal. That's why I decided to ","useful":5,"cool":3},"fnTzp7Hd_-tRcTkUCphGEw":{"text":"If you are desperate and hungover in the Quarter, you absolutely need to get a peanut butt","useful":0,"cool":1},"E_oO1sA4JkzzSTxJ6GqDKg":{"text":"Great burgers. I got the yo mama. It was so tender and juicy, I kept checking to make sure","useful":0,"cool":0},"o0o_ZCEu7ZLQdj_U63xMqg":{"text":"The Peanut Butter Burger is as good as they say. \nMy boyfriend and I went to New Orleans o","useful":0,"cool":0},"Zp73GTlOKHUHPaNUonBreA":{"text":"The reputation of this place is getting too big while the size of this place is way too sm","useful":3,"cool":0},"VgG2b4j1umY71FoPHah2Ng":{"text":"Ok so the basis of the poor review isn't the food, I'd give that a solid 3.5-4 (though if ","useful":0,"cool":0},"hEQeCz6c1tOKCDoONNQ_5g":{"text":"Visiting New Orleans again and this place is as great as ever.  We sat at the bar and had ","useful":0,"cool":0},"c1tFfre9Xb5dmhHvCyWVWw":{"text":"best cheese burger I've ever had. same goes for the baked potato.","useful":0,"cool":0},"TXh4GASpgH8ME943ejRcoA":{"text":"Holy Amazing burger! This little bar just off bourbon is a gem. The prices were reasonable","useful":0,"cool":0},"axJ8QDxqOQfnjjvhcNHXcw":{"text":"When I crave a burger in this city, this is where I want it from. I love how this place is","useful":1,"cool":0},"eHBlp_0yxHlI_b34nhrO3Q":{"text":"I absolutely love this place! The food is great, the bartenders are great and the atmosphe","useful":0,"cool":1},"tNJImLWIgA_ZBebwPz4SyA":{"text":"Great dive bar in the Quarter.  Delicious burgers and mac 'n' cheese.\n\nInteresting decor c","useful":1,"cool":0},"6W9pd8R3vxmvFRQq23P7Gg":{"text":"Amazing peanut butter burger and loaded baked potato!  It is a very small place-we sat at ","useful":0,"cool":0},"XIsMXHRgtmMs9Ig5w9nJfQ":{"text":"Great divey place to stumble in to when you been boozing it up in the French Quarter. I he","useful":2,"cool":1},"PcKToNVQWxhTmgx_hvMp7w":{"text":"So I picked my friend up from the airport and wasn't able to make it out here, but luckily","useful":0,"cool":0},"mdO1n4eBgs2zH7dy7rUt2Q":{"text":"The service is great and the burgers are one of the best in the quarter! They make sure th","useful":0,"cool":0},"7OXoI-rThXczl1D-EzJZ0w":{"text":"We came here twice on our trip.  Once was at night for drinks. The beer is cheap and the a","useful":0,"cool":0},"6pd45IuecNkAYhS-KZB1-A":{"text":"Late at night and need food, pretty good here. I had a great loaded baked potato and my hu","useful":0,"cool":0},"p6aD_OEFG8s0ZVxBgvY2bA":{"text":"Great burger bar in NOLA!  We tried the peanut butter bacon burger and the chili cheese bu","useful":2,"cool":0},"YcfWsHkGeeKI9jAy8LQcyA":{"text":"Had a great burger here (bullfighter) and the baked potato was a nice addition.  Cold Abit","useful":0,"cool":0},"AP2b6y7adcEcJRv0qiPOeQ":{"text":"While on my honeymoon and touring the French quarter my husband and I were recommended thi","useful":0,"cool":0},"Z6vf0SBG3JMSrQL-7vdx0w":{"text":"Yes I know the Peanut Butter & Bacon Burger sounds odd, but I promise you it was sooo good","useful":1,"cool":0},"E0OKv_Z2j1EUrz2u8hofNA":{"text":"Some friends took me here.  Oh WOW.   Great burger.  Had the mushroom burger with swiss ch","useful":1,"cool":0},"kAObO3WfNIZ_1_qUQ87kBg":{"text":"We came here because I was craving one of their make-your-own baked potato; we stayed beca","useful":3,"cool":3},"olKQYu6A_ZdZCZo61Pu-QA":{"text":"Came here looking specifically for the caviar & sour cream burger. It was nowhere to be se","useful":3,"cool":1},"d99BEHPP8VCU04RamEWnxg":{"text":"Best burgers! Yes, even the peanut butter bacon burger. I will admit the red light atmosph","useful":0,"cool":0},"ODbqL8JSWjHnlFDi5sXTNg":{"text":"I was super excited to try this place after reading some of the reviews. My roommate and I","useful":2,"cool":0},"aoaIbxAP-WsWODseKxkUHA":{"text":"place is grungy but what do you expect it's a bar\n\nyou can upstairs or downstairs\n\nyou hav","useful":0,"cool":0},"8kUTYaMe3F7tVDrztrC7fw":{"text":"We had the best time at \"Yo Mama\" with delicious tequila, bloody Mary's, simple grilled tu","useful":0,"cool":0},"8xoFoGqJFIKm-lCTuTKi_g":{"text":"Amazing burgers, server/bartender was so nice great girl!! We had the mushroom burger with","useful":0,"cool":0},"sQNygesb5WjRDuYrhWT-0w":{"text":"Slow service but excellent burgers & gumbo. Definitely a loud dive bar but would go here a","useful":0,"cool":0},"ljYhPWYno_74rCpaIuYQfw":{"text":"We went here around 9 on a Thursday and sat upstairs. The service was great. We had the gu","useful":4,"cool":0},"ULszKRX8e02eQfoRYB5bOg":{"text":"Have you ever thought of having a bacon peanut butter burger? I hadn't either. Separately ","useful":1,"cool":0},"0hH0cj2HGT6tg12pHnBJ5Q":{"text":"Do yourself a favor, or should I say flavor, and try the peanut butter bacon burger.  It w","useful":1,"cool":1},"hxLxoQEviE8ikR-jwQ_4JQ":{"text":"There are a number of places in the french quarter to grab a burger, with Port of Call usu","useful":3,"cool":1},"PYtaYE3MTLDdKFk7ASQykw":{"text":"Fun Fun Fun!!!! I needed a place to get a bite to eat during my first trip to New Orleans.","useful":0,"cool":0},"JO5j_xrVoZCw_Hx_VcxNtA":{"text":"One of the top burger places in the city. This is the place where I go when in need of a t","useful":0,"cool":0},"VMExi57_iFtQMDxBxNdU8Q":{"text":"Great place to have a beer and burger, watch the game, and wait to get in line for the nex","useful":0,"cool":0},"HMU7wAKkWtSn-gq5MJ3vFQ":{"text":"The first place we head when we get off the plane In New Orleans is to Yo Moma's Bar & Gri","useful":0,"cool":0},"HRVKcfqh3VQ5eeUZbLoeAw":{"text":"I had given up beef burgers for a long time until I had a burger here.  Now I crave them o","useful":0,"cool":0},"GLXXKHD9EPhO-h1RVnsO2g":{"text":"Awesome burgers. Had just a regular cheese burger and a peanut butter burger and they were","useful":0,"cool":0},"INljmMxSbc1Yfddazqv2MA":{"text":"there is a niche that only yo mama's can fill in my gastronomical checklist:\n\nit is the pl","useful":2,"cool":1},"za45FE0efF-hkeue0mQ9ig":{"text":"Definitely waited an hour and still no food. The waitress was nice however she waited 45 m","useful":0,"cool":0},"g2lkU-wSF5I2CS8EEGrFcw":{"text":"What the heck?!  Peanut Butter Bacon Burger is absolutely YUMMY!\n\nSo, after walking Bourbo","useful":4,"cool":3},"7iGgsIZEe9HQRrohKjMr5g":{"text":"I remember coming hear years ago. I remember having a delicious thick juicy late night bur","useful":0,"cool":0},"9c_ZttTTnaFOc7ryxz_hog":{"text":"Meh. I've been to this place twice now and while it's not the worst food I have ever eaten","useful":0,"cool":0},"JEojjtjzFfKtNN3U8arSxw":{"text":"We didn't have the same experience others have had. We were told that they make the best b","useful":0,"cool":0},"K_tvZga1iGXU6ux-Q4n5aw":{"text":"The food was fantastic, but the waitress/bartender was rude and SLOW as hell! She totally ","useful":0,"cool":0},"qPtaeUjIS2fpmcDTSV9Llg":{"text":"Seriously not only the best meal I may have had in New Orleans, but maybe best burger I ha","useful":0,"cool":0},"5pnOPbtEC04287wPiFkaXA":{"text":"One of the best burgers i have ever had and it has peanut butter on it? Crazy!! \n\nHuge sel","useful":1,"cool":0},"8UoCstiv_JvcCOcIg4UU7g":{"text":"The portions are huge and the prices reasonable. A very small establishment like many in t","useful":0,"cool":0},"zKQppTEDKa4FPcnYZjC-eA":{"text":"The hamburgers were surprisingly good. The potato salad was better than the recent ones I ","useful":0,"cool":0},"nZYxYNa13LtxMAIALFFAig":{"text":"Oh man the peanut butter and bacon burger is slamming. Besides a burger I had in Portugal,","useful":0,"cool":0},"2KHMi2N4iuEYh8z9o9AQYQ":{"text":"Had dinner tonight at about 6 or so and it was amazing! They were willing to split checks ","useful":0,"cool":0},"Qr-R2eSCRjB6OittJ7NCgQ":{"text":"My boyfriend and I decided to try this spot since we had a constant burger craving! It did","useful":0,"cool":0},"uGTLJ6ePfntMSc_Smw9gXQ":{"text":"The PB Burger sounds odd but it's AWESOME!!! The baked potato kicks ass, it's a cool staff","useful":0,"cool":0},"IJD696cKW9gJnf_sjeNdbw":{"text":"great find - tavern atmosphere, great food - i'd asked several servers / bartenders where ","useful":0,"cool":0},"L5CdKFhNLDYNiDCwh2Cr_w":{"text":"Peanut butter burger with bacon, need I say more? \n\nThe main attraction to this place is t","useful":1,"cool":1},"1UV53QKC_2RBPfCSp-waeg":{"text":"Cold food, bad service and indigestion later.","useful":0,"cool":0},"uDrGosxEoYXIi6WwDa7zbw":{"text":"Well I was in town for the Jazz Festival so after reading the reviews I had to go. I went ","useful":0,"cool":0},"L4_bwoudsNxn48ckrA95wA":{"text":"Decent place just a few blocks from the craziness of Bourbon St.  Had some huge, decent bu","useful":0,"cool":0},"3y42djFoPNnGs9cOwDs6Dw":{"text":"Great burgers, all made to order!\n\nSkip the sides and go straight for the beef!\n\nPB, bacon","useful":0,"cool":0},"_YIotBbNtDqHu-0HCluGTg":{"text":"Worst burger of my LIFE! Over priced MESS. How can you mess up a burger?  Dude! Greasy sog","useful":1,"cool":0},"zxoPHHXYJk6Ew1m98R1YLw":{"text":"I didn't eat here, but wanted to announce they stopped doing the crawfish boil. That is al","useful":2,"cool":0},"1wwwDo_Pnv4BHw7uILRecA":{"text":"I went here so I could have a peanut butter burger. I wasn't expecting the creepy stage up","useful":1,"cool":0},"PArzGW_dzu2GpjDsHERPFQ":{"text":"I actually ate there this morning. It's incredible to say the least. The food is good and ","useful":0,"cool":0},"ItuQys7yqmLHRSSXzts5uQ":{"text":"You must try the Peanut Butter Bacon burger.  It was so good I got one to go on another ni","useful":0,"cool":0},"nQvSLKGbJDfFo_R6GgR-ig":{"text":"Not a damn bad thing about this place.\n\nI can easily vote this the best burger dive in New","useful":2,"cool":2},"JyyeW1APgWZmyuxhDBwGPQ":{"text":"I have come here on every trip to NOLA I have taken. Tiny little dive, always hard to find","useful":1,"cool":2},"uyBHMjBpbpdVVeuiGRBXKw":{"text":"Burgers where the sun don't shine baby. \nSo much more than the 655 reviews can pen.\nPenise","useful":3,"cool":4},"6fxZIQ8Aj9F0lkWIRFoeXA":{"text":"Just had the peanut butter bacon burger.  Not bad. Burger was juicy.  Bun was lacking.  To","useful":0,"cool":0},"WdIh2-apkCXJOkm6IXdGvg":{"text":"Peanut Butter Bacon Burger FTW!\n\nI stopped in based on the strong yelp reviews and was not","useful":3,"cool":1},"upVAVhIbx0TTpSalcax7pA":{"text":"Four words: Peanut Butter Bacon Burger. Sounds crazy, and it is, crazy good.  Served with ","useful":0,"cool":0},"u5wfaWGe6Dll-yoZvt9jpw":{"text":"First off, I think the actual name of this joint is \"NOT Yo Mama's Place,\" but I could be ","useful":1,"cool":0},"7pwR14qPOqZFrmLt27UgBg":{"text":"We were told this was the best place in town for a burger. Well I wouldnt say it was the b","useful":0,"cool":0},"ZeNR-pX5-i_baBaCcfJQqw":{"text":"Huge beefy burgers and you can REALLY taste the meat which I thought was excellent quality","useful":0,"cool":0},"XHM7VLn5V5emsf1VuTteyA":{"text":"While on vacation in the french quarter we decided to hang back and watch presentational d","useful":0,"cool":0},"i1A0HLt2lFGhYPqkSAYIwQ":{"text":"Call me skeptical. Peanut Butter and Bacon on a burger. Ok, we went in with open minds.\n\nY","useful":3,"cool":0},"tYCXLXd5ZfVkiWWx9vCceg":{"text":"I'm not really a burger guy, so you'll have to take this review with a grain of salt. On t","useful":0,"cool":0},"43C2GTIPHd-7CaiXrB4i_A":{"text":"This establishment under promises (from the looks of it) and over delivers (on service, fo","useful":0,"cool":0},"M9JP5LRc9nJSMOO2N3Rizw":{"text":"This place is definitely a small little dive bar. Great music, and chill.\n\nI had the peanu","useful":0,"cool":0},"Qn_d7-4GQq9qWFU-J_GfNQ":{"text":"I was surprised to see that the name of this business has changed. But, the food is just a","useful":0,"cool":0},"cDTM9GYE7RvBYHZ1iPB7mA":{"text":"THE. BEST. BURGER. I'VE. EVER. HAD. PERIOD. \nSeriously, no lie, the best burger I've ever ","useful":3,"cool":2},"0l3Ybm9DE22nZNRhh_esAw":{"text":"Perfect dive bar in the madness of the french quarter. Quick friendly service, good prices","useful":1,"cool":1},"H2urF8XDunTRlwG2_weXMA":{"text":"Didn't even get seated the Waitresses/bartenders were brain dead we set there for 10 min a","useful":0,"cool":0},"8aHLllIEMvYpLyVnqbBVbg":{"text":"While the burgers here are pretty good (not great, but pretty good), the service we receiv","useful":3,"cool":0},"UVJhATI9BjlygsY6VhY2sg":{"text":"Mighty fine bacon cheeseburgers here.  It's a half-pounder, but in a thinner, broader patt","useful":0,"cool":0},"QopOjdYumq3LCIk0KnEDBA":{"text":"I never had the chance to try their food, but on my visit, I was ushered upstairs where th","useful":1,"cool":1},"P5SQofycEqpFSguv1X-NQg":{"text":"How this place is rate so high, I have no clue.   The burgers were seasoned good, but if y","useful":0,"cool":0},"BgMeMCn_c3ueIp5pvyvRZw":{"text":"I loved this place. It was comfortable, kind of dark seating but the bar is fantastic! Dri","useful":0,"cool":0},"BdK8oAyVCP7XmOkDcR5XMw":{"text":"Late night during Mardi Gras heard good reviews and they didn't disappoint got the Texas b","useful":1,"cool":0},"U7QM00JzwH2Q0wa-vzVmZA":{"text":"Awesome late night burgers, great staff and a relaxed, divey atmosphere. Love this place!","useful":0,"cool":0},"dvBiM5TvZNbFHivvSzr6_Q":{"text":"Pretty awesome burgers and a 92 tequila selection, impressive! stopped in on our new orlea","useful":1,"cool":2},"XozbjCVw8vZMFqE2gXUjdA":{"text":"I am going to preface all of my burger reviews by saying that I am a total burger aficiona","useful":0,"cool":0},"SfOIvfl-Ug6PL2S3I81MRQ":{"text":"Don't be fooled by appearances. This isn't a typical NOLA dive bar. We found out about thi","useful":0,"cool":0},"iY5INRnZ09yuwQK6koClBg":{"text":"A big surprise - this place looks like it's just a hip dive bar, but it's hiding a fantast","useful":1,"cool":0},"nmnZlQqsyy977tWm5Sf_XA":{"text":"I went to this joint after some restaurant review lists and i was skeptic when I got there","useful":0,"cool":0},"yrwOo2U_ZF70Xf0JFc73pw":{"text":"A MUST every time we are in Nola.  The perfect cure for a New Orleans hangover!  A Divey l","useful":0,"cool":0},"HTjVtLVD9-AizlKArRpJEA":{"text":"My go-to burger joint. Quick delivery, great burger, good potato, huge portions, good cust","useful":1,"cool":1},"aNmIKs_yYhMlTR9JGojEYA":{"text":"Burger was quite good; if that were the sole contributor to this review, i might rate it 4","useful":1,"cool":0},"7_ch0FJpKUfWlNV5zhhlrg":{"text":"Unapologetic dive bar with an extensive burger menu.\n\n.....but don't waste your time. Ther","useful":0,"cool":0},"HlVVrJ6REDHGAZ32Gx4Ikg":{"text":"I will be concise with this one, peanut butter burger. After scoffing at such a creation I","useful":1,"cool":1},"Lf0tq5bZJ-gQGQP0Qqns7A":{"text":"All the reviews were accurate--funky joint with great burgers (and baked potatoes!) I had ","useful":1,"cool":0},"XpbytK2dxgkDGBfcBs1WbA":{"text":"If it wasn't for the peanut bacon burger and the nice bartender/waitress I'd probably give","useful":0,"cool":0},"okjWRXO6vrZ-5sSQs_i7hA":{"text":"We went to New Orleans for only two nights and ended up going twice. Small place and a lit","useful":0,"cool":0},"ss4FFW5Q-NbVXZznsyJk8w":{"text":"Slightly edges Camilia grill for best burger in the city. Burgers are HUGE! I consider mys","useful":1,"cool":0},"TkZ3kc0dJrkfABoYrL8bdg":{"text":"I used to absolutely LOVE Yo Mama's! I would get the peanut butter bacon burger every time","useful":4,"cool":0},"LA_F6cCgkqqMBULkFZKZXQ":{"text":"Definitley more of a bar set up than a restaurant, however friendly service and pretty goo","useful":0,"cool":0},"kfPaFbU0z56WeyKW0TUw_w":{"text":"This is a fun dive bar tucked away off Bourbon Street. I definitely recommend it! The food","useful":0,"cool":0},"ULHiuYeo7wZGjnbMCPSRyg":{"text":"I was looking online for the name of this place and i finally typed in peanut butter burge","useful":0,"cool":0},"F_h2LoGwPxD-Mg7CMOqg1Q":{"text":"It reminded me of being 19 in 1991.  Lots of angst pumping out of the stereo upstairs Satu","useful":1,"cool":0},"mneiIzIxPpg4VM-cicwHTQ":{"text":"No joke!!! Late night eats ... PB burger was on hit.. Wifey and I LOVED IT!!!! Dinner @ 1a","useful":0,"cool":0},"G76D3zwt7Qz40cJbZ76Mhw":{"text":"We had a great experience. Our visit took place on a Friday at 9pm. The staff was friendly","useful":0,"cool":0},"6L-QbjEhSwhk3lt9E3Ifvw":{"text":"Loved it here. A dive bar with interesting burgers. On a cold January night on a Friday th","useful":0,"cool":2},"pllB-3zxgftX-Ztd2Y-AMQ":{"text":"Very friendly staff and the chili and cheese burger was great.","useful":0,"cool":0},"KD1DEtWZBukPT4pTqxwxoQ":{"text":"Looks like every other dive in the Quarter, good burger, very friendly service. Nice place","useful":0,"cool":0},"CsI-Cyx0mdY7haZ1o6VmKg":{"text":"You should go for 1 of 2 reasons..\n\n#1  Tequila. There is a ton of it..\n\n#2 Burgers. This ","useful":1,"cool":1},"XGfPaupwr6FqIsh_X5vvGw":{"text":"You won't leave hungry!  Roquefort burger and mushroom burgers are both delicious. Neither","useful":0,"cool":0},"W8NcyX06gi44-WMxy9yCKw":{"text":"This dive bar has a sort of rude charm.  The staff isn't outgoing but i think that is thei","useful":0,"cool":0},"v75QOwt3BKdIiYOY1rVD8w":{"text":"This place serves food at a bar, hence \"Bar and Grill\" but don't let that fool you. It's a","useful":0,"cool":0},"8l9Sw3-t8Zty8OCewQZqBQ":{"text":"Its been 5 months since i've been to yo mama's for the first time and I am STILL talking a","useful":0,"cool":0},"F7gO3fKEktSgKvB_KkVNNg":{"text":"Now it's called Port St Peter! Not closed!!! Just a new name. Same burgers :) The best bur","useful":1,"cool":0},"618GBDNugHaY0UD7cw02cw":{"text":"You don't need to look at a menu.  Just order the peanut butter and bacon burger.  Thank m","useful":0,"cool":0},"AH9g5Yah371sZeUwqUQ-cQ":{"text":"This place is pretty cool. Upstairs in a red light bar area with all kinds of randomness o","useful":0,"cool":0},"UtTO-vfU27U8pdvNZLB9gQ":{"text":"While walking around the Quarter, I planned on eat at Port of Call. Got there and it was p","useful":1,"cool":1},"YJK7SndFzeKg2ao8O72p-w":{"text":"I was aiming at Port o Call but only people who are not from here recommended it, all the ","useful":7,"cool":3},"4AiwVujKhXpth9pPRN_f9Q":{"text":"I wasn't a big fan of the weird red lights every where it kinda gave me a headache. The dr","useful":0,"cool":0},"ajlOBBVYgzfqMZHX4voFaQ":{"text":"We didn't want to leave! \n\nThe bartenders are whats up here. Our #1 bartender Becky was ve","useful":0,"cool":1},"PzUt9a0I8YUYzYHqlPYSLg":{"text":"Had a burger and a baked potato here after (and by after I mean during) an absolutely fuck","useful":1,"cool":1},"5G-IBo7yRyOjvYFA4ii1Sw":{"text":"We got the bacon cheese burger and a loaded baked potato. The burger was very good and big","useful":0,"cool":0},"J1kDuMCii_sBozzEmexjFQ":{"text":"I haven't been to Yo Mama's in over 2 years, and I am still raving about the Peanut Butter","useful":0,"cool":2},"AwnucsxsEijt_rYStnSYlA":{"text":"The burgers are awesome and so is the music.  Get the mac and cheese side, really good.","useful":0,"cool":0},"vGX9_EDdFonj1iKTxpEwhg":{"text":"Usually I'm NOT a big fan of eating at a bar...but I'm SO glad I got past that because OMG","useful":0,"cool":0},"SMTz2jt7hUqCQyenDA_1kg":{"text":"Beers and a Hurricane! Burgers are amazing along with the biggest baked potatoes I've ever","useful":0,"cool":0},"P-EAfYF-FX2Q9kp1U0Iytw":{"text":"Wow!! Great peanut butter burger. My loaded baked potato was also amazing. Great service. ","useful":0,"cool":0},"axRiogDTMn63Y5NujI9D9Q":{"text":"Food was good. Elaine our waitress was super nice.  She did not know how to make a Malibu ","useful":1,"cool":0},"hm2mJ1XY3vwiwWWst0kucA":{"text":"Love the peanut butter bacon burger! So good. Also, they have a wide variety of cocktails ","useful":0,"cool":0},"fWvzNNj2XFJSP9j6Ze4iaw":{"text":"My fiance and I went here for dinner last night. the customer service was horrible!  I ask","useful":1,"cool":0},"PSc_-xLt1InjZVw5CY651A":{"text":"Gonna keep this review short and sweet. Was recently in NOLA and one night was in the mood","useful":0,"cool":0},"oArZXbR4Mws5ss0MuTPucQ":{"text":"Are you even kidding me right now with peanut butter burgers?! Ho. Lee. Shit. Get your 600","useful":0,"cool":1},"BxeRSXLzOtODap1g20Hlaw":{"text":"Peanut Butter and Bacon Burger = ooh la la\nSkeptical? So was I.   \n\nAlso, the potato salad","useful":2,"cool":2},"sepf8HLAfTT6hidDNkfIFw":{"text":"I don't know if any place in NOLA is tourist free, but this has a laid back locals feel (r","useful":0,"cool":0},"vekmvai7ejL5mTkKxMW96Q":{"text":"I will say this. I remember very little about my experience here due to the amount of beer","useful":0,"cool":0},"ltq7zjdkrVsX72tnQtQx7g":{"text":"Split the peanut butter burger with a friend who convinced me it was a must try. Burger wa","useful":0,"cool":0},"Z1Ff20tgS3et2QabwlYKoA":{"text":"Like what most reviews said, it's a dive bar.  A very loud dive bar. \n\nIf you expect good ","useful":1,"cool":0},"elqGUue4KKzRc3k19rVd0g":{"text":"I literally cried thinking about this burger. Not figuratively. Literal tears falling from","useful":0,"cool":0},"Wc51P-ZO6AcR3qgC17jUJQ":{"text":"Great burgers and drinks.  A good raunchy dive style bar/restaurant in the French Quarter.","useful":1,"cool":0},"yJZRPeEeOjDs9Ef4oV0s6Q":{"text":"The burgers are fantastic and they will even cook them rare properly. The gator and craw d","useful":0,"cool":0},"00ZW8ctRwkc_OldpODyiiw":{"text":"My friends and I were there for the first time Saturday late afternoon.  Never heard of th","useful":0,"cool":0},"9eJJx18noBUaQTpcJQcIoQ":{"text":"It's a bar across the street from Pat O'Brians. Great burger. I tried the Peanut butter an","useful":0,"cool":0},"szbcJ-dWx9QcJk8Qsne4sQ":{"text":"Outstanding burgers! This is a classic New Orleans hole-in-the-wall joint. It is a great p","useful":0,"cool":0},"_r-157J7UcG0U4s92EB4TQ":{"text":"Now THIS is a burger place.  Try the PB and bacon burger.  Sounds weird, tastes weird.  Ye","useful":1,"cool":0},"ovrGLkVIYi11iDyk_BoJBQ":{"text":"----  the gumbo here was amazing ---  the food is just soooo good .... the only downside w","useful":1,"cool":1},"sjLYMQMG2BaS35Lxd-4HQA":{"text":"First trip to New Orleans and decided to try this place because it came recommended and af","useful":0,"cool":0},"lXhTU2K2Hqh_aCjtdTNGiw":{"text":"We ate here for lunch on a Saturday.  My coworker and I both ordered a hamburger with (loa","useful":0,"cool":1},"mb9bUBOiDcferqNxn8bGXA":{"text":"Natürlich kommt man für den Peanut Butter Bacon Burger hierher und es ist wirklich ein Erl","useful":0,"cool":0},"0_LX55_M_LLnIIiurkzAOw":{"text":"I stopped here with my friend from out of town later in the evening while we were bar hopp","useful":0,"cool":0},"_GgiupDtisM8-lQoHKUgkA":{"text":"My boyfriend and I have been going to NOLA for a couple of years now and last year was the","useful":0,"cool":0},"HWvvBE3PPLvSTDQ3ahXKVQ":{"text":"Came on the recommendation of a local for the peanut butter and bacon crumble hamburger.  ","useful":0,"cool":0},"qKc_4WHibzM3ganuJaayig":{"text":"My fiance and I have been to Yo-Mama's a few times. We first went based on the recommendat","useful":0,"cool":0},"hXvMm6P3xvwbxKBVx733iA":{"text":"We went to New Orleans for the weekend and had been hearing about this peanut butter burge","useful":0,"cool":0},"tmnUTHA5zNljer-GgHsIgg":{"text":"We stumbled upon this place on a Thursday afternoon during a recent visit. Honestly at fir","useful":0,"cool":0},"VUkYhKP-841eyPJmaP8s5w":{"text":"Not a burger person but WOW the burgers in this bar are amazing.  I usually try to avoid e","useful":0,"cool":0},"jdhNd-Fo2ZNDdEUUMUWV1A":{"text":"A small bar in the Quarter with 3 booths and room at the bar for lunch.  They do have a fe","useful":2,"cool":1},"xvMvLgsM-AaqiCp1tQV0nA":{"text":"I was recently in NOLO for conference.  We were out late one night and I asked the valet a","useful":0,"cool":0},"P-P64zEdAmM1_-hJ9NYjLQ":{"text":"The food was good, nothing to rave about.  We went for the Peanut Butter and Bacon Burger ","useful":0,"cool":0},"z2JMP9nB_njMtO4B-XZuqw":{"text":"Just ate one awesome burger with a loaded up mashed potato! Great place great staff must s","useful":0,"cool":0},"Udkd5Jl3bMmcvw5mgMSjlg":{"text":"This is a divy bar with great burgers and sandwiches.  I got the bbq chicken sandwich and ","useful":0,"cool":0},"1EWS5hwZHKQGkRSmFBnF6w":{"text":"Great food- we had the crawfish and alligator sausage to start then I had a bacon cheesebu","useful":0,"cool":0},"6CXejgZi-RqbBY8qXLxg0A":{"text":"So this is a bit of a dive bar but the burger menu is out of this world, I had the chilli ","useful":0,"cool":0},"RpWNRBWzeSEOdGS6QHVQFA":{"text":"Dear cheddar burger,\nNothing Compares To You.\n\nStumbled, quite literally, into this joint ","useful":1,"cool":1},"XkVkv7cLcanzHQ-_I1zQtA":{"text":"Yo Mama's has an amazing burger. They use really high quality beef that comes out perfect.","useful":0,"cool":0},"jWwieyAlBFE48BL2jt9zRA":{"text":"The burgers are so good and the service is excellent. I have been here every time I am in ","useful":0,"cool":0},"9Hcl86uqfsLxM7HYXWh8Jg":{"text":"Very divey.  The peanut butter burger wasn't as good as everyone would have you believe.  ","useful":0,"cool":0},"sJiXPdIsiUo-_7xZ5-iSwQ":{"text":"I know there's a rivalry between Yo Mama's and Port of Call so let me set it up by saying ","useful":3,"cool":1},"W_E7B91ouaItcxLRjTwQXg":{"text":"Just ate here. Had just gotten off work and really wanted a burger. Heard good things abou","useful":0,"cool":0},"yFlweeMjd_Yb8tBWO6AqrA":{"text":"I was here for a convention and was intrigued by the idea of a peanut butter bacon burger ","useful":1,"cool":0},"BDzHa5Epg-F8mxNcTdbVuA":{"text":"First things first. Locals do NOT eat here. Yes, some might just as some locals might eat ","useful":1,"cool":0},"nCc9_1o05dLA0NA1A1Y13A":{"text":"peanut butter and bacon burger + mac & cheese = heaven!","useful":2,"cool":0},"0tdGzdunYqSjBAt10eTzTw":{"text":"You cannot ask more from a burger than the Bacon PeanutButter burger. I split it with a fr","useful":0,"cool":0},"FBNW-Z6_kvxD-hgDUbEZYA":{"text":"Recently being touted as the 'Best Burger in the Quarter', we decide to go try this place ","useful":0,"cool":0},"c_TRSuNUyqRMXXFak9hxaw":{"text":"No, I did not eat here but my friends said their burgers were yummy. Even more exciting, t","useful":0,"cool":0},"blLQtQUkBEhnpuW4LpBSpw":{"text":"This is a great dive bar with great food.  I work in the quarter so when I'm craving beef ","useful":0,"cool":0},"wB4JyWBDTPYR7GOHtknm1A":{"text":"Don't get us wrong!  This is a really awesome burger 100% 4 reel 4 ever, et al.\n\nWe can't ","useful":0,"cool":0},"WCHqAo5F0-Go2OFq-_sznw":{"text":"Yo-Mama's was our favorite bar in the FQ. We went back every single night we were there. T","useful":1,"cool":1},"mqWwyG736eGBCcUlwzpjcw":{"text":"I'm local, live a few blocks away; the burger I had tonight (BBQ, bacon, provolone) was on","useful":0,"cool":0},"XyA71Bz_TjD5h96-HB1xqQ":{"text":"Best burger and baked potato in the FQ!  We stumbled on this place last year and came back","useful":0,"cool":0},"148AgYZen5Fagm8MYc-_AQ":{"text":"my feet hurt, and i was mildly hungover and it was about 110 degrees outside.  one might s","useful":7,"cool":8},"adrLbXBkggWAplulw899yA":{"text":"Delicious burgers and awesome service. Great place to go to for a late night meal without ","useful":0,"cool":0},"inZQk3I8ZnR1T2QYz1Z63A":{"text":"What in god's name was someone thinking when they made the peanut burger?! I was naturally","useful":0,"cool":0},"WlBuN56V-E0zz8UxYuytUA":{"text":"I had to make sure this place was one of my stops on my recent trip to NoLa.\n\nI love Burge","useful":1,"cool":1},"hbJ0xCHOiWolrRLx9AN_Og":{"text":"I went with a friend on Wednesday and got the Mushroom Burger. It was pretty awesome. We w","useful":0,"cool":0},"i5eWFpw0f21a7zp0mX5puQ":{"text":"Wow! If you need a quick bite to sober up, have the Peanut Butter burger. It sounds weird ","useful":0,"cool":0},"RfFnqeW_AJmiNO6yEcoMlQ":{"text":"One of the great undiscovered places in the quarter.  \n\nThe burgers are as good (imo) as P","useful":0,"cool":0},"UP4BYthHXPxTdGekZUwBmA":{"text":"The peanut butter burger is honestly the best in the house. It shouldn't taste good but it","useful":0,"cool":0},"TsjO04ZNNE4E6x-RiO7gRg":{"text":"The burgers are decent.  The staff is genuinely friendly, a rarity for the Quarter.  The t","useful":0,"cool":1},"z_RK86e6ilr57CRtDAJzwA":{"text":"Excellent burgers! Try the peanut butter Bacon Burger with added jalapenos!  And the burge","useful":0,"cool":1},"fz_AfeGsmS0YSlW7IFhqEA":{"text":"Went there last night as I was told they had wicked hamburgers. Brie was our bartender, su","useful":2,"cool":2},"hH5nhrouaUzwjt_f5bTw8w":{"text":"I found this place while perusing many a Thrillist list before my husband and I visited NO","useful":0,"cool":0},"PXSr3vHa1_kn6eNiRzaddw":{"text":"I may be slightly partial to this funky little bar/grill since I live less than a block aw","useful":1,"cool":0},"gBvcCN-ZlBSb0QjIW5b40g":{"text":"It's definitely not the type of bar and grill my mama would have, but if she did have one ","useful":1,"cool":0},"A_qcT7f-1XpxBow7RFcqeA":{"text":"Peanut Butter Bacon Burger...had to try it out and have been back twice. So it's a bar rig","useful":0,"cool":2},"vE1m8_6vK_4wZE92c5MEcg":{"text":"Burger #146: Caviar & Sour Cream\n\nI toiled for weeks trying to pick the right burger to ea","useful":10,"cool":6},"AWthA0iCH-3ALn3BTQintQ":{"text":"First let me say that our server was super nice, attentive, and new. The food was awesome.","useful":3,"cool":1},"OccA2NP5qOlkqUzegRC5iQ":{"text":"Literally the best bacon I've ever had. Peanut butter bacon burger from yo mamas is hands ","useful":1,"cool":0},"tUMLdOsGAlyFyU-fJVADrQ":{"text":"Five stars because their peanut butter burger will change your life. That is the end of th","useful":6,"cool":3},"7XUFBPtio5Pfl5bpFcoqyg":{"text":"This is a bar that also has really good food.  They have boca burgers for vegetarians and ","useful":0,"cool":0},"MGlqjx6TAKREvSH6tBamOg":{"text":"Folks . The best burgers ,baked potato meal money can buy. The place is just a few steps a","useful":0,"cool":0},"WHzLwJ_G7DIU-dJjLNxWAg":{"text":"Small hole in the wall joint with awesome burgers that come with a baked potato!  We got o","useful":0,"cool":0},"4WCuTs3KRGWzm8eY5dDAGA":{"text":"Had the peanut butter burger and it was different than expected. I think I would've enjoye","useful":0,"cool":0},"wHHNVI-yZlu1ymh57ujuSA":{"text":"The story you are about to read is true.\n\n12:18pm. My partner and I have been running the ","useful":0,"cool":0},"2DqJpA4GxNFVMiRyguJC9g":{"text":"A total hole-in-the-wall in the French Quarter, with killer burgers.  I wasn't in the mood","useful":1,"cool":2},"-N6C8wRRo-LYdw0ZqCXfXg":{"text":"Peanut Butter Bacon Burger... my mouth waters every time I think about it. I first heard o","useful":0,"cool":0},"5M4jSxvXdy5vh_EqJdvxUA":{"text":"FANTASTIC late night food!!! Best veggie burger in all of New Orleans!  The \"Little Taste ","useful":0,"cool":0},"vKpCAfxeCEQPjYbbia71zA":{"text":"As a 15 year veteran of Port of Call, I am sad to say goodbye.  I had two of the most perf","useful":5,"cool":0},"eICcV0V3svX4WJw3mkyrZQ":{"text":"I really wanted to love the peanut butter and bacon burger but I couldn't get down with it","useful":0,"cool":0},"7-Ay0n-EcbR9TPjUogqp1w":{"text":"I was in NOLA for 7 days, I had a burger here on 3 of those days. Who goes to New Orleans ","useful":1,"cool":1},"mgU6VPCjtPwVweDS-Sa-ow":{"text":"On vacation in NOLA w/ my friend and we took a nap and woke up at 1am, starving. The local","useful":0,"cool":0},"Nu4D60UpEdsT_BJgzPmXbw":{"text":"Yo mama is so tight that she could be a burger at this joint. Get a chili cheeseburger and","useful":1,"cool":0},"hm7G8FxhxxshTMvaGyHAUg":{"text":"I went to Yo Mama's way back in February...  and still thinking about it.  Being from Chic","useful":0,"cool":0},"BUoYk9Lj2AtLX5k01EzaQQ":{"text":"I used to come to this place years ago when it was the fatted calf. Now all I read was abo","useful":0,"cool":0},"5l_bF_5oJ9MUaDkOHFptVw":{"text":"Yo mama's never fails, a great burger every time and I have been many times. Sometimes the","useful":1,"cool":2},"mhooxd_YXupgUjTLCiY2HQ":{"text":"I eat VERY little red meat, but I make an exception for Yo Mama's. Their burgers are as go","useful":0,"cool":0},"LTkeFWl-2rXpzAXeOU7nTg":{"text":"I just had one of the best burgers here!  This was one of the restaurants I wanted to chec","useful":1,"cool":1},"yKE5J-ePrHzciLwm0ho92A":{"text":"My girlfriend and I came here because she had seen it on TV somewhere and she had wanted t","useful":0,"cool":0},"Gm5M4peZ4ferAZ8EAebO3g":{"text":"Great burgers and sides, the mac and cheese is great, I should know. Sit at the bar and ex","useful":0,"cool":0},"-ej5zOjJMyCBJIOJJtsGFw":{"text":"A great bar with terrific bartenders and even better burgers. One of those \"best burger\" p","useful":0,"cool":0},"7RT2fUTL5KQD7yyFjTm6Ow":{"text":"After a long day touring around New Orleans in January and looking for a place to eat afte","useful":0,"cool":0},"unpyDcTLwjj1dfdWsFn-YA":{"text":"I love a good burger and a dive bar, this place didn't rock my world on either front.\n\nThe","useful":0,"cool":0},"BHo4_Yi80xauJT733TZqlQ":{"text":"We went to all the places you were supposed to go to in NOLA.  Some we liked and some we d","useful":2,"cool":0},"86ILtVoKZ8lixWbOHYVEUw":{"text":"I had to do it.  Peanut butter bacon cheeseburger is delisch!!!  I'm not just saying that.","useful":0,"cool":0},"dQPw32Y_vI-oJLfu4P9E9w":{"text":"Amazing burgers and delicious loaded baked potatoes....what are you waiting for???!!!  Ser","useful":0,"cool":0},"gT7jbmNPlfCUdTdPfmfkow":{"text":"Great burger! Huge, quality beef that's super flavorful. Great find off of Bourbon St. Onl","useful":0,"cool":0},"0VJ0MfGL7--hHMzNTO8otQ":{"text":"It's bittersweet. Not only does New Orlean have the best traditional food but they have th","useful":1,"cool":0},"o0YMs6gbpLc-g63QtuDkLg":{"text":"I've been here three times in four years visiting from florida . First and second visit \nN","useful":1,"cool":0},"ryfhYuemUUPcR4H7Cp6hmw":{"text":"Peanut butter bacon burger!!!  \n\nI was craving a good all american burger in Cajun town an","useful":2,"cool":2},"NagXwbsqABIUEqGdgRD1Ig":{"text":"This location is NOT CLOSED. The new owner simply changed the name when he took over. The ","useful":12,"cool":0},"HGwZB7FT7ZjH0-By5lBUqA":{"text":"Good hamburgers decent prices for the French quarter.alittle bit overrated.but good if you","useful":0,"cool":0},"hIg1_UAjbQf6hR_1d9adHw":{"text":"We went to Yo Mama's with high expectations as it was recommended by friends.  Our experie","useful":0,"cool":0},"_OCG16Q0U4dKR7jDrHAzdg":{"text":"This place came highly recommended by a few people. The food was pretty good - I got the T","useful":0,"cool":0},"SsL7zmMAonlPX9If98HOBg":{"text":"I know you're reading my review and wondering what I think of the burger's at Yo Mama's. B","useful":0,"cool":0},"YtKpQ4YPhEwFnNsbPE2OjQ":{"text":"No jokes about Yo Mama!  The burger was fantastic..I had the Blue Cheese burger. I plan on","useful":0,"cool":0},"BZ8rCq0iQ3ZH26YYJJcB3A":{"text":"FINALLY!  After years of hearing about how fantastic Yo Mama's food is, I got to check it ","useful":12,"cool":8},"NvhCGxin3JmE4gJNvRt_yw":{"text":"I have been to this place 5 times and have never been disappointed! Best burger ever!!!! I","useful":0,"cool":0},"G1RPE_sUj3vtRsZQkVUFdA":{"text":"Yo Mamas was yo'tastic!! My husband and I split the peanut butter,bacon cheeseburger with ","useful":0,"cool":0},"cw2gbL-GoT50guGiVNdcPA":{"text":"If there was 10 stars I would have chosen that option! ! Get the peanut butter and bacon b","useful":0,"cool":0},"AxChU7DnB6WJfFE-t18vCg":{"text":"Yes, I ate the Peanut Butter Burger, and it was good, like a beef satay with peanut sauce ","useful":5,"cool":6},"eLYeTDuOxsSRKrUUDXUyhw":{"text":"I loved this place. In fact it was my favorite place to eat in all of New Orleans. The bur","useful":1,"cool":0},"yiu4JMH_FWeuOcv6FYoN8w":{"text":"This tucked away place off the bustling street of Bourbon is a gem. It truly is! \n\nI came ","useful":1,"cool":3},"BgsFLo5TSOlIkLRWiv_gdw":{"text":"9:40 pm. My partner, my wife and I return to the scene for further investigation. The upst","useful":1,"cool":1},"lCcnXxR2ShDNNUlbP0ODjQ":{"text":"Sit upstairs if you can.  it may sound crazy...but try the peanut butter burger.  Of cours","useful":0,"cool":0},"vksOxTZjz6ePcpAOZWgqMg":{"text":"The food is good here. Great burgers, and good vegetarian options too. The bartender/ wait","useful":0,"cool":0},"-R-ayOD5bzNJXB3NDuZl0A":{"text":"This place was fantastic. Everything looks great and comfy. Very relaxed and chilled out. ","useful":0,"cool":0},"UV6nNRyIwcSe6Td16IOw2A":{"text":"Since you probably have never encountered or even fathomed a Peanut Butter Bacon Burger, I","useful":0,"cool":1},"dMLmhH_IIAA7kx1_qp2IwQ":{"text":"skip port of call, go to yo mama's... less attitude, and lots of tequila.  best selection ","useful":0,"cool":0},"xO17tN1AUUUbHRysseoL8Q":{"text":"Tired of cajun food?  Have gumbo pouring our of your eye sockets?  Need something normal t","useful":1,"cool":3},"ZE0vElLzqhsopNpCaYqMVQ":{"text":"Peanut butter bacon burger. You'll die and go to heaven and come back for some more.\n\nOH M","useful":6,"cool":1},"MoXV2jztXzBq93ZtvhQ1NA":{"text":"I was thrilled to try the burgers at Yo Mama. It did not disappoint. The burger patty was ","useful":0,"cool":0},"Ov4E83HGv4rZLHlqWh_6ZQ":{"text":"Best burger in Nola. \n\nDon't listen to your friends about Port of Call being the best burg","useful":0,"cool":0},"3jb-0mswz20aWJyY4R_BPw":{"text":"GREAT peanut butter bacon burger. Super service. Just an incredible non touristy place.","useful":0,"cool":0},"cyJz9WqDE3sTZb1A20OwYQ":{"text":"My husband and I just got back from a quick weekend in New Orleans and of course our first","useful":1,"cool":0},"5PRMf9yTFi1rSIXcnVhWQA":{"text":"Just an average burger joint with questionable hygiene and public health practices. I got ","useful":0,"cool":0},"2JPHpYjTXRBofuqhsMCP1Q":{"text":"Yeah, it's a dive bar with a grill and a stripper pole upstairs, but what notorious, great","useful":3,"cool":0},"vWYZjn1NMemS9G0hde6hKA":{"text":"Complete dive bar but great place for late night eats. The burgers are fantastic, large, a","useful":0,"cool":0},"zICVxrgvejdlqBEQAbA8Rw":{"text":"Tried the Peanut butter, bacon burger....surprisingly delicious! Definitely recommend afte","useful":0,"cool":0},"eH9dUdPsNnQGkSPjzhTTwg":{"text":"I got the peanut butter burger and it was delicious! They card everyone who walks in so be","useful":0,"cool":0},"3ENqYSlU1aia7g53ej5b8g":{"text":"Had the peanut butter burger upstairs with rum and coke.  They definitely weren't stingy a","useful":0,"cool":0},"_iM_8pMOg1AYiwmZUdTwxg":{"text":"I've been Yo Mama's a few times but never knew the name of it until my most recent trip to","useful":0,"cool":0},"NRt799fIcR9rbZ6QR18QCw":{"text":"We went to Port Of Call first but after we found out that the wait was an hour and a half ","useful":0,"cool":0},"-bKznBOJyqJYeqsA18RpjA":{"text":"Recommended by our Haunted History Tour Guide, we stopped by Yo-mama's for a couple drinks","useful":0,"cool":1},"70m_54iNGZPpw3LHDniODQ":{"text":"Best grilled chicken sandwich I ever had in my life! Burgers are great, too. Bathrooms are","useful":0,"cool":0},"zcec9qjrzw0-RSb1iOhsKQ":{"text":"I was referred to this place and so glad I went.  This is a great locals place, divey on t","useful":0,"cool":0},"DIu0bTfBtQGawR2ZvdfTjA":{"text":"I came here by myself on the Thursday afternoon just before Mardi Gras 2013 as I landed ho","useful":2,"cool":1},"OnfnWCWCgLkUKoc99MLkeQ":{"text":"Absolutely the best burger I have tested in years... It was amazing to find such a delight","useful":2,"cool":1},"LZBHcdlY4S7jNmMyUySVmw":{"text":"Awesome, amazing burgers. Great tasting and filling. Loaded  baked potato was fantastic. E","useful":0,"cool":0},"d_m_8KzCG-kg-vOAnOQgMg":{"text":"Thanks yelpers- reviews well done! Yo Mama did NOT disapoint! Split the Diablo burger with","useful":0,"cool":1},"_d2IBs0fnyrYskfAP-A-Tw":{"text":"In hindsight, I feel like I failed my Yo Mama's experience. How could I possibly go to thi","useful":4,"cool":3},"5FCy9pUqGmG5Ntnnd4nqAQ":{"text":"We had just arrived in NOLA after an exhausting two flight legs from Melbourne and were lo","useful":0,"cool":0},"QDd6iJBDLPRzHoeIk_CUqg":{"text":"Real tasty burger. I had the one with peanut butter and bacon... it was great. Friendly se","useful":1,"cool":0},"Yxgn6MClnm9zYYrrg5_ivQ":{"text":"We happened to stumble upon this place while wandering around the French Quarter. We walke","useful":2,"cool":0},"kmF7YIR21mjmRtm2f3dlnA":{"text":"When I was in New Orleans I have to say Momma's rocks! Their burgers are def delisious and","useful":0,"cool":0},"_t68vEFyCdil1fIh3ciSLw":{"text":"One of the best burgers I ever had! You have to get the peanut butter burger with bacon.. ","useful":0,"cool":0},"EniCg1FgtjQHssPQ_7OEzg":{"text":"My girl, Amber, really likes this place. She swears by their mac-n-cheese, which isn't on ","useful":0,"cool":0},"7C-4_OMmKlwByWlxGq4CVw":{"text":"Strolling through the Quarter late night and looking for a good burger, the bartender at t","useful":0,"cool":0},"eUzGYPulD4xJuEypenHATA":{"text":"Really long wait for a burger that certainly wasn't worth it.  They have one waitress for ","useful":0,"cool":0},"fZx_tQ-hG5ug4vNLUEu3yw":{"text":"It was alright, nothing spectacular.  Love a great burger but just wasn't outstanding.  No","useful":0,"cool":0},"--nAqDHbFYY3t8NIezQcng":{"text":"This is a great place to get a drink before you go into Preservation Hall, which do not se","useful":1,"cool":1},"6AJKTgphT2x70GaTVXfccg":{"text":"Ok ok ok the peanut butter bacon burger is the sh-t. This is the best burger in all of New","useful":0,"cool":0},"9pk68DaKFXYk8uzRj3C05w":{"text":"Lots of burger choices and one of the last places serving food at night in the quarter. It","useful":0,"cool":0},"ghF5Q_j8p077x00VCJXptg":{"text":"This place was awesome! Came here starving after a fun night out. I had the peanut butter/","useful":0,"cool":0},"O8JN4dE_3F634rfEHfHe0A":{"text":"Honestly hands down one of the best burgers I have ever had. Also great staff, and locatio","useful":0,"cool":0},"oeFdZEMZ5FoAOy9V1iCb4A":{"text":"Quick friendly service and very tasty food. We ordered the bacon peanut butter hamburger, ","useful":0,"cool":0},"EHWC6Rog0OE2PBShM3-1mQ":{"text":"Dude, Yo Mama's Peanut Butter burger.  Seriously, freaking order this thing.  It is crazy ","useful":5,"cool":2},"DcGwEx1XnvB_8a79brG_uA":{"text":"So in my quest for the perfect burger here in New Orleans, I landed at Yo Mama's with a ne","useful":0,"cool":0},"Lu0h04geYtlhKfKMR9XzTw":{"text":"First time here, had the chilli cheddar burger. It was fantastic! It should come with a bi","useful":0,"cool":0},"ei_4xj1zfVEczaJV7ZdsNA":{"text":"I ate here a year ago after a woman on my walking tour suggested the peanut butter burger.","useful":0,"cool":0},"b6-4MECtiJTKwiXOSTRfcQ":{"text":"Don't waste your time. Poor service and a long long wait time to get a burger.  Other patr","useful":0,"cool":0},"ojUsWNUI8uTrNGKZBw2Zxg":{"text":"The \"Yo Mama's burger\" is huge, tasty, and one of the Best Burgers in NOLA. You can't make","useful":0,"cool":0},"ZuZPkU8rlKBRmMhXuxKKtA":{"text":"Yo Mama's, home to the peanut butter and bacon burger. Which I ordered, of course.  It was","useful":1,"cool":0},"QrjM5WbXtYz4BlcFoYcZpQ":{"text":"Elvis will be proud!\n\nServed in a dark witchcraft velvet underground venue, A sloppy tease","useful":1,"cool":0},"So5EEQHT4WBlUrW5Q7SO9A":{"text":"This place is a small hole in wall and totally stands up to its 4 star rating on yelp! My ","useful":0,"cool":0},"MzKmBzkU1vgITYj_28JBoQ":{"text":"On my last night in New Orleans I made it out to Yo Mama's after hearing a few people tell","useful":0,"cool":0},"TIXfrP9XImwBCwRn9tk5gg":{"text":"Seriously, what's not to love about a place called Yo Mama's???  Ok well if that don't do ","useful":0,"cool":0},"LjJiiRNnIxhMELFJ3LZZWQ":{"text":"So my wife is attending a conference in New Orleans and I came along for the ride. Whilst ","useful":1,"cool":1},"3POB1KL_3bWy_mUgPYLT_Q":{"text":"first the burger- you must order the peanut butter burger..it is truly to die for...not to","useful":0,"cool":0},"wx9mzbRbRekPMvxgOYLJxQ":{"text":"If your hungry, and you really appreciate good bar food, this is the place.  Awesome burge","useful":0,"cool":0},"BCb7Vt0LvcSDRngIbG7t4Q":{"text":"Doesn't even deserve the one star I'm giving it. Waited for 30 minutes very hungry. Only t","useful":1,"cool":0},"5BlWiopm0fexT6O9EJxhVA":{"text":"Nice little spot to grab a delicious burger.  Only downer is no fries available, only pota","useful":0,"cool":0},"Q22oBKEwzSkEZCVZ9JG0gA":{"text":"I got the Peanut butter burger and my wife got the Texas or something burger. BOTH WERE AM","useful":0,"cool":0},"F8DhD9Jfr1NJN5cYzLFejw":{"text":"While the peanut butter bacon burger is good...in the past two years they have been progre","useful":1,"cool":1},"-lOiewjLNVorJPTM7uYAVg":{"text":"This place is a \"hole in the wall\" with good burgers. I would have given four stars but th","useful":1,"cool":1},"RsTmuLW2LRqPIugpkcDYCQ":{"text":"Last nights bartender was terrible. She ignored us for so long that we left. I guess she w","useful":0,"cool":0},"txoICnrBoSdJBKk2c0fwsw":{"text":"One of the best surprises of my trip to New Orleans. Small, one row bar near Pat O's. Went","useful":0,"cool":0},"FWA5A-ED5rQ572sV6rDTnw":{"text":"Without a doubt the best burger in New Orleans.  I've had Port of Call, Capdeville, etc...","useful":0,"cool":0},"DJsscj5hP9kV_b18H1vQmQ":{"text":"Ignored me trying to order food right until after the kitchen closed.... Fantastic skills ","useful":0,"cool":0},"c20BvUSSFbeBL3KiTdyelw":{"text":"This is stand by location for locals to stop and grab a bite while drinking in the quarter","useful":1,"cool":1},"mn7VtWpF-z4dNp_YvwjXjQ":{"text":"This is my first Yelp review but I was forced to write this review based my experience. I ","useful":0,"cool":0},"8GBDTQzU1_XBg-Vi65V9Dw":{"text":"Hamburgers so good, make you wanna slap YO Mama.\nI was killing time in the quarter and thi","useful":0,"cool":0},"rG0cyKYIjsQ8EpPnScZdTQ":{"text":"Can't believe this place has closed. I had a very good burger here, better than the one at","useful":2,"cool":2},"bCTY2o0S8wodSWvcGBYjQA":{"text":"Good grief.  I went here today based on good reviews and I was SO DISAPPOINTED.\n\nFirst, I ","useful":1,"cool":0},"S-KtjCkl5wraBxNrBY_uCQ":{"text":"Just buy the peanut butter and bacon burger and eat it with great gusto.  It's one of the ","useful":0,"cool":0},"J8jUQddafGTzCLJskEdRWg":{"text":"Let me put things this way...the peanut butter bacon burger is NOT for everyone. But, if y","useful":0,"cool":0},"egOmc5Rdi6EG2um2yMqCzw":{"text":"had an amazing burger here and potato salad. I'm pretty sure the secret ingredient there w","useful":0,"cool":0},"i4Jq9eK9ooqJGNtll8E6nw":{"text":"What a great place to start my first trip to Bourbon Street!  The burgers were everything ","useful":0,"cool":0},"F-QOWnb9x3kImDt9cx_LpA":{"text":"Hell! Yo Mama's so fat by the time she turn around it be yer birthday again...\n\nAnd here's","useful":2,"cool":1},"bT-iuxTpmrjIIzIIdnA_Mg":{"text":"We stumbled in here on a Wednesday night to try out the famous peanut butter bacon burger.","useful":1,"cool":3},"Gy_5eTI3_YyYurFR1u-Fxw":{"text":"Yo-Mama's is a great burger joint!  We were hungry after a night of fun in the French Quar","useful":1,"cool":0},"q5yrEL7PkBQdcOjjVgqCog":{"text":"Burger is good in a area accessible if your staying in the French Quarter and the lady who","useful":0,"cool":0},"5NW_kyvAmDq4HvdOjToLYw":{"text":"Yo Mama's is one of my favorite places in New Orleans to grab a burger. You can order one ","useful":1,"cool":0},"U52weUckiU4P3FJuLovd0w":{"text":"Best Peanut Butter Burger Ever!!!!! Met a bartender from Jax there too, she was awesome!","useful":0,"cool":0},"-3hZ_j-uVE_ZesuFYi4CUg":{"text":"i consider myself a burger aficionado , and this was a great burger a busy area there near","useful":0,"cool":0},"dqqepVG1bhLoXQR0WP8jdQ":{"text":"*Vegetarian Review*\n\nWe went for lunch....OK, I get that this place is a dive bar....but d","useful":2,"cool":0},"rKp6lJkaWSeTmseXn5-k6g":{"text":"New Years Day. Hungover as hell. Want to die. Need grease. Our cab driver had recommended ","useful":2,"cool":2},"3twOL-zzi-DpMqdsa7da5A":{"text":"If adversity produces strange bedfellows then the peanut butter on a hamburgerNever though","useful":0,"cool":0},"1DRtFoTtVtclKx5bDcF2mQ":{"text":"This place would've been 5 stars if it wasn't for the lack of seating and the long wait! B","useful":2,"cool":1},"JRpHdkiY7TprFCZsbD-lXg":{"text":"tried the infamous peanut butter/bacon burger   nah  i think ill stick with the basic chee","useful":1,"cool":1},"qsZ7RAKEAd8bfCcS1y6wlw":{"text":"I dug this place for a number of reasons.\n\n1) it's called Yo Mama's.  I mean really, that ","useful":1,"cool":2},"DtxPJAo7BoYYrZVCqgy4qA":{"text":"This is definitely a dive bar: dank, dirty, and dark. At one point smoke was pouring out o","useful":0,"cool":0},"S5GPMdty8-vDN9RAjombhw":{"text":"I know a place is good when I've eaten something that is completely not what I was looking","useful":3,"cool":3},"3esrVd96HYAuL0_on6SppA":{"text":"Good job on the burgers! So good.. If we lived here, we would def come back! It is a dive ","useful":1,"cool":0},"Ili6zd3OwwpkdEzwbbXlBQ":{"text":"I don't know who came up with the idea to put peanut butter on a burger, but its the best ","useful":0,"cool":0},"wfsVONZ-1mPj7Poy8MXjcQ":{"text":"Probably one of the best burgers that I have had in a LONG time!\n\nYo Mama's has some reall","useful":0,"cool":0},"IcDNNkzzhm0QW_eslsfYYA":{"text":"I do love Port of Call but Yo Mama's is so good they overlap on who has the best burger. A","useful":1,"cool":2},"w5SxWUwXxF1ZhdH6qvgDYQ":{"text":"I guess I disturbed the bartenders lunch...  But in the end the burger was great...","useful":0,"cool":0},"cBr7Zb9youVT6JnwWIdx3w":{"text":"We're local, and we go here a lot. It's teeny, so there might be a wait, but get a drink a","useful":2,"cool":0},"uBcEfKyRifr99GcZeGZKww":{"text":"Biggest chicken breast on a sandwich I've ever seen! Hubby had to have the peanut butter b","useful":0,"cool":0},"u9f_Yze9JP_YKMn4wTMu2Q":{"text":"So I was on Yelp while in NO and discovered this place... a peanut butter bacon burger, sa","useful":0,"cool":0},"nEF-OeNwwbI7N-On9q6B2w":{"text":"Yo Mamas kicks!!! I had the peanut Bacon Burger with a LOADED baked tater. Unbelievable. I","useful":0,"cool":0},"s2EuXQvWFQ2krI9-sJn-Og":{"text":"Local hole in the wall dive place, burgers are ok, Port of Call is definitely much better.","useful":0,"cool":0},"5Cu_E_ns5t8W82cxIPk8iQ":{"text":"\"Hot damn, this place looks like an S&M MYOO-zee-um!\" - declared the big ol' Texan saddled","useful":1,"cool":0},"Ihd4V3-NEWmXe3faMHTlFw":{"text":"This has got to be hands down the best burger joint in the city, or maybe even the world. ","useful":0,"cool":0},"XVh7r0KqxqmJazxgty_BaA":{"text":"Best hamburger I have ever eaten!!!  \nThe first time I found this place I was  a little dr","useful":0,"cool":0},"G508KnF9TjTqO4hA2jcUpg":{"text":"Yet another review about the Peanut Butter Bacon Burger.....\n\nThought I'd at least give it","useful":0,"cool":0},"zJ2AnhEmCb4TQyPmVVPldA":{"text":"Went on a Sunday night - place was nearly empty. Jamie the bartender was great. The burger","useful":0,"cool":0},"qxY5LJqVNSsladNYIkrgzA":{"text":"Sooooo, I came here after a couple of Hurricanes...hey, what can I say?  It was my first t","useful":1,"cool":1},"_vwaMnxNiHDA-DwrxxNIEA":{"text":"In town for Jazz Fest! While my peeps were still sleeping off the previous night's shenani","useful":0,"cool":0},"bHFPb97JMGw7P0bhlQfs_A":{"text":"A friend had suggested we try their cheeseburger. The place is small, dark and packed on t","useful":0,"cool":0},"x250_On4Cbw9HCpFhgIlhA":{"text":"This was my favorite place in New Orleans, hands down.\n\nThe gator sausage was amazing!!!\n\n","useful":1,"cool":1},"0jZUNGtZqxMgaeANNsyCew":{"text":"A colleague had been to Yo Mama's on a prior trip and raved about the peanut butter burger","useful":1,"cool":1},"ossaSvWAo_7PD51kfkSPhg":{"text":"Hands down best hamburger I have ever had.  Granted, I've never actually seen what I'm eat","useful":0,"cool":0},"qgEDWMMHKO2xUORatdNMow":{"text":"Visiting from DC I decided to stop to this place. I had the best bacon burger of my life. ","useful":0,"cool":0},"h9qTdK9G9dsHgSGX8BJtHQ":{"text":"The best burger in NOLA.  It's more bar than restaurant, and usually there is a line of mo","useful":1,"cool":1},"Zgq9JmyERpTgKq3vvxOXKg":{"text":"Decent burger but a weird atmosphere. Small place with maybe 5 tables. I would think there","useful":0,"cool":0},"J6Ae8GEmdWnxsmOhhNgQYQ":{"text":"Huge juicy burgers are the specialty here. Just as good as port of call without the wait. ","useful":0,"cool":0},"QWBFF88A3X8WSPuKpx3zDQ":{"text":"Today we were pleasantly surprised with a well seasoned, mouth watering burger.  You'd pro","useful":1,"cool":0},"wxP0Uoy3kNs38cE_4Un12A":{"text":"My friends and I tried this place because of the reviews on yelp.  I must say that we were","useful":0,"cool":0},"xBx3ZjLH6a9KxJOLKk6EAw":{"text":"peanut butter burger - enough said. \nsounds ridiculous but oh so good. get a baked potato ","useful":0,"cool":0},"qlwazZdGNXk5Q0pWme-QNQ":{"text":"We were out of towners miami and md ppl looking for dinner. We found this place on yelp an","useful":0,"cool":0},"A1oBqH0tCpTQAisJp0_ieQ":{"text":"I read reviews about the peanut butter burger and was really intrigued. I feel like that k","useful":0,"cool":0},"idjcnaJyDP-b47CMKvn_eQ":{"text":"Hold on, the two stars aren't based on the food...\n\nI LOVE their burgers!! So much!! But, ","useful":2,"cool":0},"Ftpo3Uw6ywLW0dDfzYjLlg":{"text":"After reading reviews, we elected to have lunch here. We arrived just as it opened. It's a","useful":0,"cool":0},"hfFJdCTed_zAzXRvfYwcAg":{"text":"When you come to New Orleans, you go to the Quarter....at least once.\n\nThere is an abundan","useful":3,"cool":1},"nFPVUWRHkJGzprGWuwuMzA":{"text":"Ok, so I was drawn in by the whole Peanut Butter Bacon burger thing.  What can I say?  It ","useful":5,"cool":3},"vKM5uIwcZntSw2LXFOjVEQ":{"text":"Best Burger in the quarter. Having a bad day? No worries! Hilllllllary the bartender will ","useful":0,"cool":0},"a4ruyVY3rLD2nZ6r6KokQA":{"text":"I found this place and was amazed. It's the type of place you always want to find.  I woul","useful":0,"cool":0},"Yq0Y-id68p5THILxRGZfQQ":{"text":"My friend who lives here suggested we go to Yo Mama's  because it's a cool dive bar and ha","useful":1,"cool":0},"IYajAUL4ja2IRTwQOo3DKw":{"text":"We had fantastic burgers here! The baked potatoes are loaded and delicious. I had a tradit","useful":0,"cool":0},"8nD1YycTBl6qdEc3voUBOg":{"text":"Didn't want to eat burgers- or non authentic Cajun food while I was in town.  I ate the pe","useful":0,"cool":0},"FI2IqxoLd2tDho3zVHHeWg":{"text":"I would give it no stars if I could.  Would like to be able to say anything about food but","useful":0,"cool":1},"DYE4brJ470Jd5q-2gunRvA":{"text":"This tiny dive joint with the rickety comedy club upstairs is one of my absolute favorite ","useful":1,"cool":0},"9y9xO7vnX_NT1mkZ4x9y_Q":{"text":"FREAKING AMAZING!!!! The best bacon cheeseburger I've ever had, and the most incredible (f","useful":2,"cool":0},"yqOAaP_rruBlMuh1kGbmiw":{"text":"It was late and after searching wildly through Yelp, I found Yo Mama.\n\nIt's off Bourbon, a","useful":2,"cool":0},"NOax70MOz9lV8loqCA-1Vg":{"text":"My friends and I ended up here on a recommendation of others - what a great recommendation","useful":0,"cool":0},"G9cFQTGeRCbo1BHPRRna6Q":{"text":"Love this bar!! Best burgers in Nola and now Ribs!! Great staff super friendly great atmos","useful":0,"cool":0},"knLxTFCYzA8As-0ZSDz3FQ":{"text":"Yo Mama will not disappoint, especially if you order the Peanut Butter Burger. Just delici","useful":0,"cool":0},"XADVLvboxZRw7HObeINoCA":{"text":"This place has some really generic burgers that are offered by many other places, but ther","useful":1,"cool":0},"yriApgxknyL8UEO0ejuDxg":{"text":"The burgers are Delish!!!! Loaded baked potato was amazing! My only complaint the bar was ","useful":1,"cool":0},"wE8qdcLTZZbQbxavYO-sKg":{"text":"Came in here on a weekday for lunch and it wasnt that busy the one thing we noticed immedi","useful":1,"cool":2},"C6xuIHFJp-xYnCvK3G5tMQ":{"text":"I was actually referred here by a waiter at Pat O'Brien. He told me they make the best bur","useful":0,"cool":0},"I8NpAQZVkkK_AjmK4xnQjg":{"text":"Visiting New Orleans and walking through Bourbon street my friend told me of a place that ","useful":2,"cool":1},"WlEAntPG0Gz13M4_LrWf_A":{"text":"I was there last year and tried the Peanut butter hamburger....OMG!!! I would eat that eve","useful":0,"cool":0},"4KpKYBEyCzqT2LAU14D7jw":{"text":"Terrible staff","useful":0,"cool":0},"nWtobvub9GAE577k9o0R3w":{"text":"Can't be more positive about this place.  We went for the peanut butter bacon jalapeno bur","useful":0,"cool":0},"erb64aaLadzftIxAXnPSMQ":{"text":"I used to live across the street from Yo Mama's, and I miss it. I LOVE the peanut butter b","useful":0,"cool":0},"P8UXo5g2FBFsEu4SozX6jA":{"text":"For years I have been hearing how great Yo Mama's was and have been anxious to try their b","useful":6,"cool":3},"J9_Mnx-tlhz65NL4czDN_g":{"text":"O M G this was an amazing burger. As soon as my family and I arrived in NOLA we were all f","useful":1,"cool":1},"r9j4xba4gZGwYie4Nwpo1A":{"text":"A haiku for Yo Mama's Bar & Grill:\n\nCheap, legit burgers\nWhat you said 'bout my mama?\nJuke","useful":7,"cool":6},"XOStAk79kPalHERkhFcYOA":{"text":"I am so sorry to disappoint alot of you...........First thing first, I absolutely love the","useful":0,"cool":0},"IAfYHzslKUx3ieMeVaJVSQ":{"text":"Great burgers. Don't be turned off by the area. This place is a hidden gem. Had the chili ","useful":0,"cool":1},"7_IAwZq2_ZFmteALD7F6wQ":{"text":"Oh my god!!! If they make burgers in heaven this is what they would taste like. I better g","useful":0,"cool":0},"2a6OZfLDmLcHtdfPXMg3ag":{"text":"This bad had an amazing staff with delicious food! Thanks for all the amazing service, sto","useful":0,"cool":0},"P_m3EIpp-6ap6xcNypxDJg":{"text":"PEANUT BUTTER BACON BURGER is their hallmark: yum!\nSURPASSES Port O'Call by far as best bu","useful":6,"cool":3},"SiM_eQbBGKq0R15gQ9zalg":{"text":"The burgers in this place are the best I have ever had!! The only reason I am giving the b","useful":0,"cool":0},"ugJ5Tw0gETusC5PsvCyasw":{"text":"If i could rate this place food, atmosphere and employees I would give it less then 1 star","useful":0,"cool":0},"38MQE5CAl5-Y1y6jK9GXpg":{"text":"Peanut butter bacon burger.  That's why you come here at 12am after a pub crawl.\nPeople (t","useful":1,"cool":1},"bt4pzlyCopDAaAm5qluODQ":{"text":"Believe the hype!! The peanut butter burgers are oddly delightful!!\n\nThis place has wonder","useful":5,"cool":3},"7QN64SZutgxEuKUumShdaA":{"text":"Gargantuan burgers served by a chubby waitress with a muffin top and an exposed butt crack","useful":1,"cool":1},"r_LC-Q0ARYIoZAuHeXqxHg":{"text":"YO MAMA'S A HO \nYet another FQ locals' hangout that has succumbed to nouveau-riche redneck","useful":9,"cool":5},"a576b1jVEnIb2jTlXZOonw":{"text":"Abita Amber on tap!!\nand\nAwesome Burgers!!\n\nThe peanut butter and bacon burger is pretty u","useful":3,"cool":2},"8lfXxxZF20i1ueZqtaH4Xw":{"text":"Yes, I came here for the famous Peanut Butter Burger. Got it, the mac n cheese, and a few ","useful":0,"cool":0},"ngkDpAsoeestOdaerMlb3Q":{"text":"Not a kid friendly joint. We have never brought the kids, but just letting first timers kn","useful":1,"cool":1},"rYf4G5CywKU6uV95NgpPPg":{"text":"Yo Mama's Bar & Grill is certainly better than most things named after Yo Mama. And by mos","useful":5,"cool":2},"qXAJ2JjpGSEWUS-R5Znojg":{"text":"Sweet! Peanut butter bacon burger interesting and yummy","useful":0,"cool":0},"mWhXkMfPIe4o8rYeMtbG9Q":{"text":"Probably the best place to eat in the quarter really.  Peanut butter and bacon burger is d","useful":1,"cool":1},"5BKnc-x5cDqrQqtIoiM8Bw":{"text":"Great burger, local beer and a very friendly staff. Located in the heart of the French qua","useful":1,"cool":0},"mWrgM8U9s9dW3b2zU7-qbg":{"text":"Came here based on the yelp reviews.  Thank you once again hive mind.  This is one of the ","useful":2,"cool":3},"lQC4hlUn8BpfyF-4_yjs_A":{"text":"Huge burgers. Bacon burger and loaded potato = SOOO much bacon. This place was pretty cool","useful":1,"cool":0},"92Vy1-AzbsYa5Nc-xQsQCA":{"text":"YO MAMA'S SO PHAT, with a PH. \n\nSeriously, I miss this place.  Best burger and baked potat","useful":0,"cool":1},"jqkkeaRiWhXom7HWelJzwQ":{"text":"Definitely recommend giving this place a try! We ate there late at night after bar hopping","useful":0,"cool":0},"bn8I0b-OlZ1bcCdFBv58qg":{"text":"Must stop here while in new Orleans! Mike the bartender is fun, friendly and makes great d","useful":0,"cool":0},"ZviVDEy1igTebjJEH5BxyA":{"text":"Back in my meat eating days, I lived for the jalapeno, avocado burger. It has fresh Serran","useful":3,"cool":1},"rqP8AAeiVT92rUTgoKCtcA":{"text":"This is an excellent little bar and grill a few doors away from Bourbon Street.\n\nBefore I ","useful":3,"cool":1},"A9qYp9Lm-dwaPyKTY81Y0Q":{"text":"They had the absolute best hamburger I've ever had. It was a peanut butter bacon burger!! ","useful":0,"cool":0},"e_m1Y5Mqh1wg-RDdNeTrXg":{"text":"Admittedly, I was a bit skeptical heading into this place. A Peanut Butter and bacon toppe","useful":1,"cool":0},"IFq_K2NeOBzlmzYPuOMWBQ":{"text":"One of my local staples here in the 1/4. Yo Mama's is a must for the tourist, like me, wan","useful":0,"cool":1},"lDNJV6_z_mjEySS2W76XFg":{"text":"How we found out about Yo Mama's was we were walking by it after our night on Bourbon stre","useful":2,"cool":0},"iqgzCK-LC-MBjI1rbXFIkA":{"text":"The bartenders at this bar were so much fun. They were so friendly and funny and really ma","useful":3,"cool":3},"KUHgfu35MZ-lCD52Lh1d6A":{"text":"my father took me to yo mamas on my first trip to Nola and I didnt want the peanut butter ","useful":0,"cool":0},"21bs_ZmkdLigWiuo1JQ09g":{"text":"I ate here during Mardi Gras and  when we walked up the guy told us a 45 minute wait and t","useful":3,"cool":2},"RlYLC_P7o_J1u517kdkIvA":{"text":"I tried the blue cheese burger and added bacon. It was a big burger! It was juicy. It was ","useful":4,"cool":3},"mmMyhB43JTdgAmgYDONdPQ":{"text":"I DO like this place...stopped in a coupla times and am glad I found it...1st time was bac","useful":2,"cool":3},"TljRZ6PP04XZoXlQVJQDkA":{"text":"Omgggggggggg you have to come here heaven in yo mouth I'm sure you try anything you will b","useful":0,"cool":0},"byDV3MkrVV3YH-yGob_wEw":{"text":"Came to New Orleans for a boys lime. Yo Mamma's is de f***ing greatest!!! The PEANUT BUTTE","useful":0,"cool":0},"vO5x8fJBMVPDthFSxNH_DA":{"text":"Fun, chill atmosphere with great baked potatoes, amazing ribs, personable staff, and relia","useful":0,"cool":0},"QehQe3dMKfy65uOw7Xgh1w":{"text":"I've always wanted to try out this place and I finally did today.  I've heard highly about","useful":0,"cool":0},"ayn3d0jpQAxa9W6p4YNfyg":{"text":"Total dive bar, but this place has by far the best burgers my husband and I have ever had.","useful":0,"cool":0},"Wfx3hp2-Mkn1OX6FYqQ3vA":{"text":"This is such a weird coincidence. Yo Mama's is exactly like MY mama's house! \n\nLit only by","useful":9,"cool":11}}