{"mupk-qUx21FCVUu3qH23HQ":{"text":"Our food was just okay I had the chicken sandwich and fries.  I ended up leaving my bin an","useful":0,"cool":0},"5ypNiPCHZ-oys4TrYy30Nw":{"text":"Great Bloody Mary!   If you like these at all, try theirs.  Good po boy.  Great catfish.  ","useful":0,"cool":0},"nSHS8CFWnP3ThGleaYSFTg":{"text":"The worst meal we have had in the 30+ years we have been visiting this lovely city!!\nNo oy","useful":0,"cool":0},"MLNL0kymMnvzNxya008L5Q":{"text":"Not great...would have been one star, except our waitress was good.  My food was clearly m","useful":1,"cool":0},"fO9vq_Q_qZb8TdpktU09Aw":{"text":"People... seriously? You need to review a place for what it is. This isn't brunch at the R","useful":1,"cool":2},"Fx7G9du8p5SPGGDMQRIy7Q":{"text":"This was was the BOMB! I had the blackened shrimp nachos, the game day platter and this dr","useful":0,"cool":0},"MZnp-WzC1mTvk2aZPiXbwQ":{"text":"Stopped here a couple times, just passing by.\n\nFirst time was just to kill time before a t","useful":0,"cool":0},"UVigapES2VWWUQRg0uMviw":{"text":"Had to wait 20 mins, while there were 7 free tables, not reserved. We left because the hos","useful":1,"cool":0},"8fiHrt4MaxLxf_ppKJJsGw":{"text":"The Sampler is $20 but two people can easily split it and have a great taste of NOLA cuisi","useful":0,"cool":0},"YzHc3B9OZDUU236EJSpoOw":{"text":"Our waitress, Angie, was gracious and friendly, and so helpful. The wait staff makes me wa","useful":0,"cool":0},"vRTrQ1lvEnOO6qSwr12xTw":{"text":"I wanted to go to café du monde, but the damn line was down the street, and it was raining","useful":0,"cool":0},"o361Rt0UGOc11uA0CPRgdg":{"text":"The food looked good but the service horrendous.\nIt took several minutes to get seated wit","useful":2,"cool":0},"3i6Bim_RzVOSJB7tkbbZZA":{"text":"We came here a few years ago and had some delicious hurricanes and amazing Oysters. This t","useful":0,"cool":0},"643KKUP2QHZ70Pl3wM2n5g":{"text":"Avoid this place at all costs. Food mediocre and kitchen ridiculously slow. We stopped in ","useful":0,"cool":0},"tMQKcoUx39FuNUGOrixZ1Q":{"text":"This place is disgusting.  Terrible food and the rudest manager I have ever encountered in","useful":1,"cool":0},"Ybkg4rtqT6S3VmYMoSNgOw":{"text":"Stay away!  My family and I ate at this overpriced restaurant because the location was con","useful":0,"cool":0},"NhysPUxdqZyTrMg5Cv8ClQ":{"text":"While waiting for the St Paddy's parade tonight we decided on an early dinner. Right on th","useful":0,"cool":0},"TRk6R1FkkwadjTM25Sr0Gg":{"text":"My last day of New Orleans. A bittersweet moment. I was low on money, and my stomach was g","useful":1,"cool":1},"vbNva_fFirvd6EiLicO6Eg":{"text":"Can only comment on the drinks as we just stopped in to rest our feet and have a morning c","useful":0,"cool":0},"1UAF2TX3FSF29gEXVp5qug":{"text":"I had the seafood jumbalaya, and to be honest, it tasted JUST like boxed Zataran's jumbala","useful":0,"cool":0},"oM1anYLAwkPGYZdK-xwLEQ":{"text":"Not the best stop we've been to on our trip. Although we got seated right away, it took a ","useful":0,"cool":0},"kzXmf7GiZTxwDA_BAlNM4w":{"text":"In the tourist area. No parking obviously. We got there before the crowd around 11:30 AM. ","useful":0,"cool":0},"j9sbLhXgurv1JLRBq4qThA":{"text":"Twenty pirates walk in a bar was the highlight of our dining experience on Halloween night","useful":1,"cool":0},"La0kwwRyGHn73zK8zDxkrg":{"text":"Sad service, super slow on everything. Waitress looked like she was having a bad day... an","useful":0,"cool":0},"7VM_lJna53y_QdBLFBRoNw":{"text":"Kathleen was our server. She gave us great advice on our food choices and she was right!  ","useful":0,"cool":0},"sTpNJYUESLYn532IrqrdRA":{"text":"2 and a half... Really?  This place has the best food. Period. Great service, great taste.","useful":0,"cool":0},"19u4Nmhu-qWn--t7wBQx1w":{"text":"Zero stars: The absolute WORST food experience of our Essence Trip. The service was medioc","useful":1,"cool":0},"_uwderdOb7zjKOoEbe_AlA":{"text":"We dropped in here for a quick bite after frolicking on Royal at a few art galleries. The ","useful":2,"cool":1},"7uC-zui_I1QTOFYPIwwDgg":{"text":"We were in here on a Thursday night and our service was great, our waitress was awesome an","useful":1,"cool":0},"l4lKAMUDBd34LfHbAUyQBw":{"text":"Located right next to Jackson Square, this restaurant should be a great place...but it is ","useful":1,"cool":0},"pCgJTFGJkscEQADwUQxXCA":{"text":"Oyster Bloody Mary was great and so was the alligator bites. Service was decent. Worth the","useful":0,"cool":0},"oxPgUs66fnQb27LZq5Jogg":{"text":"We stopped by here while walking by and it was quite busy so we figured it would be a grea","useful":2,"cool":1},"VRYf-en1x7unMvuvK8ibuA":{"text":"Delicious food! If you can, sit at one of Karen's tablew, she did such an excellent job an","useful":0,"cool":0},"X-M3nphl45TbelFtpITZWA":{"text":"We stopped in here with 8 of us in tow (3 were children) and were seated fast.  It took a ","useful":0,"cool":0},"55SyLJOCvyGxq-HCbRhVwQ":{"text":"Not flexible. Would not let me sub anything. Food was OK. Coke was flat. No waiting but I ","useful":0,"cool":0},"1DFZ1LxeJLMVm7GmlPcn8w":{"text":"I'm not one to complain about restaurants and service.  However, this experience was absol","useful":1,"cool":0},"K86wONAwk5JDuBKKZ4thjQ":{"text":"I stopped in to the Corner Oyster House on a recent trip to New Orleans with some friends.","useful":0,"cool":0},"aRMS0z1f09DDYxQ2xn-dQg":{"text":"Hope you've read this before they've handed you one of their filthy menus.  Please walk aw","useful":0,"cool":0},"Y3K_EeDml1Gv23bFAsZs3A":{"text":"These reviewers are idiots - this is why yelp needs some type of 'review-school'.  Reviewi","useful":1,"cool":2},"Wo9876giX-hrAPvMfqsLVg":{"text":"this is absolutely the worst resturant i have ever been to. no one knows how to do their j","useful":0,"cool":0},"0T0xluYMeJg3-OlnpX7CmQ":{"text":"This place is extremely unhygienic and unprofessional. One should stay away from this. We ","useful":0,"cool":0},"UVaYTWULlABgbjsakwpuJw":{"text":"Gumbalaya...no, that's not a typo...that's the fabulous plate of welcome to New Orleans I ","useful":0,"cool":1},"7Wd9NkAtz4t5TM55gaZkpg":{"text":"If you just need drinks, stop here.  They are reasonably priced and a good place to cool o","useful":0,"cool":0},"8vyxOJEze-AwLobUF8jaAw":{"text":"Quick pit stop. Gumbo was good, not great. Service was friendly. Ask for the salad dressin","useful":0,"cool":0},"6bO5B6xqhW__Yz39sOxbyg":{"text":"We stopped in here because it was raining and didn't feel like walking too far for food, e","useful":3,"cool":0},"PfPwCiOwgu360piPJpxlLQ":{"text":"Had to walk out. Was sat quickly and given a drink, but the waitress never came back. The ","useful":0,"cool":0},"yZNL3vfh-KRUcPyZMKfZyg":{"text":"Walking in the Quarter and wanted something quick and good with a drink. \n\nI got better th","useful":0,"cool":0},"U4Kse4cdmNQFom1l_mNBFQ":{"text":"I have been to New Orleans on numerous occasions and been to quite a few establishments an","useful":0,"cool":0},"ryBEdo3FknI97KWn2QxuEA":{"text":"I would be eating oysters; but, the Corner Oyster House is out of Oysters on the half shel","useful":2,"cool":0},"SI7lQ-LAwqx_il_W9S1WFQ":{"text":"Yay, Im a lil bit of fan...i have nothing important to say but they want more words...i ha","useful":0,"cool":0},"SJr6I-Z6LRFy-MnNUi8cSg":{"text":"Tried the Gumbalaya on a quiet Thursday afternoon. Friendly staff and tasty food and drink","useful":0,"cool":0},"xGKaKdioYcckEecIu2K1YA":{"text":"Left this place without even ordering ! Walked in and had to wait at the front door while ","useful":1,"cool":0},"bw10uXwMa3ITw3MIPRMBFg":{"text":"We were looking for a place to watch the game and happened to walk by this place. Had to w","useful":0,"cool":0},"iul3dhoJz2arrmA7kPv8Ag":{"text":"Love the bloody mary's. It is punch right in the mouth. Perfect after church beverage.","useful":0,"cool":0},"S2-MyBU9dUqXzVgByd7gAQ":{"text":"The host and server greeted me promptly.  Nice atmosphere.  The appetizer plate was tasty,","useful":0,"cool":0},"Y1i3pPK9OIcq_rllVtkoLA":{"text":"The food is just not that good....sorry, but it is true!  Had the Gumbolaya and it almost ","useful":1,"cool":0},"ClrFdEWR-9HKIGlhqx5FFg":{"text":"Best bloody mary in the US. The lady that made the recipe is extremely nice and great at b","useful":1,"cool":0},"aX2me7V0bwYxMM69kY0rgw":{"text":"After a morning of shopping and doing the things one does in the Quarter during the daytim","useful":1,"cool":0},"0rzyIA_vCKKdoizBA28DcQ":{"text":"'Drinks to go'. Waited 5 minutes while the bartender finished three Hurricanes, made a Tan","useful":0,"cool":0},"OZd_-zL0p2aTofBQc7nd-w":{"text":"Hands down this place has the best Bloody Mary in the city!  The other drinks have some ki","useful":0,"cool":0},"AL1wPEOwKmrUEZHclpO8SA":{"text":"We loved this place on our stopover for Mardi Gras, right next to Jackson Square and close","useful":0,"cool":0},"_K11-d_hjGzUmqF_MX75dQ":{"text":"To be honest with you I was very disappointed in the food, both my wife and I were actuall","useful":0,"cool":0},"9CVk5vIHRRlbE0ldTJgv9g":{"text":"No one was friendly. Our waitress had moments where she seemed friendly but then she would","useful":3,"cool":0},"_3BZ-hAfkrixM1cPl2j5LQ":{"text":"Fabulous staff! Good beer and game day feeling.  Food below average.  Second time in,  bot","useful":0,"cool":0},"xt9Q3tFFqMzr7Eq-aJNhnA":{"text":"Gumbalya, sausage po-boy, and chicken quesadilla were great!!!  However, the muffuletta wa","useful":0,"cool":0},"-hNp0YWoSeklxMFG-8KU_w":{"text":"This is mostly a tourist destination but it is well located in the Quarter.  The food is d","useful":5,"cool":2},"LB6AkhEzGwPFOYjFwQaYMw":{"text":"The lunch and dinner was simply delicious. I had the plate that came with white rice, red ","useful":0,"cool":0},"tu54ivti1kM4qiQN0216uw":{"text":"It took a long time to get our food (20 minutes)... alligator bites and gumbalaya was cold","useful":2,"cool":0},"4K4ewqTc5hJD1HbdP2Nd8A":{"text":"Great food comes in very big portions.  The price is reasonable.   Service is really frien","useful":0,"cool":0},"ijUdQxunvGtv29ccTLb0zw":{"text":"Oysters wrapped in bacon awesome. Waitress not so much. If you want to save on your tip, a","useful":0,"cool":0},"6uvvu1bGbbapT7Hf87DuFw":{"text":"Extremely slow service. They completely forgot about us after we were seated. New people w","useful":0,"cool":0},"JraEnI7s3Q_pO-heUszAWg":{"text":"My review is about the Bloody Mary's and Stephanie (we did not eat). Stephanie, the barten","useful":0,"cool":0},"faa1_HjOc9P0K2jA4AV2TQ":{"text":"They didn't want to sit us at the bar because the day bartender was leaving soon. Not a bi","useful":0,"cool":0},"mPKSwVYBL4ylPrvrFZnGGw":{"text":"Went in for lunch. We ordered a pizza and a quesadilla. It took about 45 minutes before we","useful":0,"cool":0},"Zdvf67bx5dPcgxVdHw7cPg":{"text":"I would literally rather go hungry then ever eat here again. And I'm being totally honest.","useful":0,"cool":0},"iOlnlVqxUwS4_EL6936Iag":{"text":"Zero Stars... Had to wait about 20 minutes to order after being seated because our waitres","useful":2,"cool":0},"e8Ud2Hc2bI7NmhSUYuRPpA":{"text":"Do not eat here. The place is understaffed and the food is terrible. It took us over an ho","useful":2,"cool":0},"ubs5K51Zx5ps7ViLN1szig":{"text":"I feel bad about it...but I really didn't like it here.  The service sucked...the food was","useful":0,"cool":0},"pystFn3gKgHz06Dt_OaxHA":{"text":"First  off, ordered drinks and they were out of lemonade. Then, ordered a cheeseburger, ou","useful":0,"cool":1},"QewvG_WjQvF25pT1w_zJUg":{"text":"Meh. The fried pickles were disappointing. The fries were tasteless. However, the catfish ","useful":1,"cool":0},"HD1UF8Cn0gOBJ6z0vF0JTQ":{"text":"THIS PLACE WAS TERRIBLE!! Do not waste your money or time here! Took over an hour to get m","useful":0,"cool":0},"WfDC3X4RpTtP4lSpIE4y0Q":{"text":"Wait staff very nice.  Drinks were never empty.  Food was good.  We expected typical bar f","useful":0,"cool":0},"69YfA8d5VJxim6sx7XuSzQ":{"text":"Don't waste your time.  It took 45 minutes to get our food.  The manager said that is what","useful":0,"cool":0},"F3PMEXdSbHSCBwajcedzHA":{"text":"If you love gumbo and jambalaya, get the Gumbalaya!! I took my cousin here after a four-da","useful":0,"cool":0},"RK2aBUVt7slnCFOpHjtfzA":{"text":"It was ok.  The omelets were better at River's Edge across the square.  The hash browns we","useful":0,"cool":0},"fOT_uVcKqbgxUZRNN8mgVw":{"text":"Service was friendly-ordered the fried pickles which were mediocre-the asparagus and oyste","useful":0,"cool":0},"G1CUEoY_uSS44sskdGFSqg":{"text":"Wow this food is nasty. Went in starving and left hungry too because neither myself or my ","useful":0,"cool":0},"YiA-VQGVaXgIe0Z8DRAV1w":{"text":"Been here two hours no food yet server just told us kitchen staff can't read to manager tr","useful":0,"cool":0},"D3ueD3mVCg7xbsJ2_WfwqA":{"text":"We stopped here because we were extremely hungry and headed to Jackson square. We ordered ","useful":2,"cool":0},"vRAvDfLQebnYPmpYKWs1mQ":{"text":"Walked in with a group of 11, took 20 minutes to just get water (many tables available, wa","useful":0,"cool":0},"URBAJjFjSRTDg0oblvNWQA":{"text":"I am going to go against the grain and say that I actually enjoyed my experience at this l","useful":0,"cool":0},"vVmQwGz813DT_aj2rqigOQ":{"text":"After our horrendous experience at Coops place , I wanted to go to Cafe Maspero but hubby ","useful":1,"cool":0},"c7a__R_F8SLNHPCUXlZxeA":{"text":"Really wanted to like this place but the only thing that was good was the oyster /advocati","useful":1,"cool":0},"xyZzCBlgVegM8Z8bU9KeQg":{"text":"To ring in 2011 the right way, the girlfriend & I spent the week around New Year's Eve in ","useful":0,"cool":0},"asB_-dRieDLmj90qOi193w":{"text":"Sat down, ordered drinks and beignet fries waited about 10 mins for the drinks. One of the","useful":1,"cool":0},"jlWZlJT0xa8FwE66iQdA1Q":{"text":"Andrea is the biggest sweetheart, and she is a great bartender - she made me the most awes","useful":0,"cool":0},"uiWbdTXN6Uz3BHiDNuGxqQ":{"text":"As an experienced visitor to the French Quarter I should have known better.  I've learned ","useful":3,"cool":0},"xhHVKLewByQyIi_G6PYTpA":{"text":"Great charbroiled oysters! My server Christopher worked his butt off and provided excellen","useful":0,"cool":0},"ZbD582zpP70g0to_BBo0yQ":{"text":"Was in New Orleans this past weekend and had the opportunity to eat at several places.  We","useful":0,"cool":0},"rWcNZrr-TkjNO9DXONGxuw":{"text":"Service was weak, food was cold and uninspired.  The beignet fries were good.","useful":0,"cool":0},"0VpJIJ6XTF3zOVt2CIUWMg":{"text":"It was just this past Tuesday (07-17-18) night I'm VERY hungry and in need of some good ol","useful":0,"cool":0},"8Fzj_-eh-eN8lDH4F9j4Dw":{"text":"We found this place on Sat., Jan 27. It was rainy and dark outside, but inside everyone wa","useful":0,"cool":0},"vTHS5uKIKBMcmAuSh0lXRg":{"text":"Awesome service and great location!! Ask to see if Angie is working and ask her about the ","useful":0,"cool":0},"T_LBqXUtyGOExrwTir57yg":{"text":"The General Manager Bruce....is a complete jerk!!! i was simply calling to confirm a pick ","useful":2,"cool":0},"iOUEukY9RjFLRvZrX8hPSw":{"text":"For having the name \"Corner Oyster bar & grill\" the oysters were very sub par. My fiancé a","useful":0,"cool":0},"FatyJ2W3rniy578_3MCZHQ":{"text":"Took 45 min for the food to come out BUT OMG..When the waitress brought out my coke and pl","useful":1,"cool":0},"iqDd1lr0T-sQyfqn9pU0jQ":{"text":"Unfortunately we should have checked the reviews before we came....they are accurate. Poor","useful":0,"cool":0},"wROauyhDGWc7QMz_a9hZCg":{"text":"I had the New Orleans sampler and wife had shrimp/oyster poboy.   I would have to be drunk","useful":1,"cool":0},"NZdUC-GevgadMUPo0K42Sw":{"text":"Holy Gumbalaya !!!! This place had the most amazing food and their drinks were to die for!","useful":1,"cool":1},"i776Q2ZM6rX0rMdlRKLk2w":{"text":"Bottom line: NO. Just... no. Go across the street to The Jackson Brewery.\n\nFound a crumple","useful":2,"cool":0},"Y5J8x56X4AX7tmpOV65Z0A":{"text":"Group of 11 came here for lunch. Everyone loves their food, from poboys to the sampler pla","useful":0,"cool":0},"UsOMWTLJeuuBFgmwm7qIfw":{"text":"Had a great time at The Corner Oyster Bar. Great service and good food. The drinks were ve","useful":0,"cool":0},"sk7ZOn94cc7-ej2JRnqr0g":{"text":"This was one of the worst restaurants I've ever been to. Our server ignored us for 30 minu","useful":0,"cool":0},"LwrGBbdp1HgkcT9f0j3Wyw":{"text":"Stopped in here on a whim during our vacation in New Orleans. Food and drinks were excelle","useful":0,"cool":0},"4HTYqG90rdEDqqUfR0Yghw":{"text":"Just came by for drinks. It was pretty good. Very friendly bartender. I enjoyed my drink a","useful":0,"cool":0},"c7HJyr7P2FJWUc4leAzbZQ":{"text":"This had to be the worst service, or should I say non-service, I've ever received. As some","useful":0,"cool":0},"jSQwPtz4ZPvZGOP7d6WOJw":{"text":"Love this place! Service is always fast and friendly . Oysters on the half she'll is alway","useful":0,"cool":0},"4fINNMJe3Hm2mNJE0H11ig":{"text":"I love bloody Mary's but I was completely disappointed with both the bloody Mary's and ser","useful":2,"cool":1},"lU6aUMX7MMTB092j6TrnrA":{"text":"The food we had went from a touch below average (tempura crab sandwich) to a touch above a","useful":0,"cool":0},"s7n8PrOfiZzsfJZZxTjr2Q":{"text":"My friend & I stopped into the Corner Oyster House on a whim just to have coffee, because ","useful":0,"cool":0},"id-rP54yNDyD0CQ2zcUK1A":{"text":"So I was walking around with my girlfriend when she decided that she had to use the restro","useful":0,"cool":0},"1CNV3PD8EYa-2gYvZ9kOSw":{"text":"I've never had a meal at the Corner Oyster House, unless you count a Bloody Mary as breakf","useful":14,"cool":6},"fVFKp7VvG6wddbToIi9lKA":{"text":"This was the best place we ate in the french quarter! Angie was awesome! The food was amaz","useful":0,"cool":0},"JK7ZiXhO0JbngCZ9m2KUVQ":{"text":"One fine afternoon, as we strolled along Decatur and French Quarter, looking for a place t","useful":0,"cool":0},"iDD7Ukg7g42lYW8keNig8g":{"text":"We had a disappointing experience in this place . BBQ Shrimp dish not as described on menu","useful":0,"cool":0},"-qe_7RvWI45wAkcJTMh1ZQ":{"text":"We had a fantastic afternoon here during a recent trip to New Orleans! We intended to stop","useful":1,"cool":0},"SWc1PRRPRkApOBCvuxcUFg":{"text":"Great food and good prices. I've eaten here both years we've come to New Orleans and it's ","useful":1,"cool":0},"4cjFjU71rnILxld6b9NMDg":{"text":"The Corner Oyster House was ok...it was the first place we ran into on a Saturday morning ","useful":0,"cool":0},"nlDWrthHDxqzpcm4rLpQJg":{"text":"\"The Corner\" in New Orleans should rename itself \"Lame Rip Off.\"  \n\n   I was drawn in beca","useful":3,"cool":0},"7PN_DJn_3QS8UX8gv1ay3g":{"text":"Got food poisoning after eating the boiled shrimp. The restaurant was unclean and so were ","useful":0,"cool":0},"UPZRjfgWbZ1ZaGV34civNg":{"text":"This place is in a prime location right next to Jackson square. When we got there we stood","useful":0,"cool":0},"2fcA6dFAYLHKmqMPZBHTYw":{"text":"I like to eat healthy,  but these portions are too small. Service is atrocious.  There are","useful":1,"cool":0},"G6RHVxOKF5ae5_SUG5JC2Q":{"text":"TERRIBLE! We ordered a few sampler platters for a large group and a pound of boiled shrimp","useful":0,"cool":0},"Go-FAF32NDT6VYmd1vf7OQ":{"text":"We were here for drinks only. Our service was very bad and slow. It wasn't busy at all dur","useful":2,"cool":0},"KiTfYwS7LzuSilkmf9XpFw":{"text":"The chargrilled oysters were amazing. Large, plump, juicy oysters that tasted like the gri","useful":0,"cool":0},"CrbPGe0dDUFaPMRxIoGSsg":{"text":"an open letter to the owners of the corner bar and grille:\n\nDear Corner Bar and Grille Pro","useful":4,"cool":3},"CKagrCmkAOPIGZoUghBB-w":{"text":"Drinks were good! Bar staff was speedy and friendly. I'd recommend stopping in for a speci","useful":0,"cool":0},"vBK2jjmpPP6oGg8dRYo2Ng":{"text":"Me been a local I was very disappointed with the food here .... I only order the BBQ shrim","useful":0,"cool":0},"hi71Q7zwMcREfTqhMPjnHQ":{"text":"This was the worst place we have tried in New Orleans. We were extremely disappointed. The","useful":0,"cool":0},"uBADvIa1ab_kOdJDHKeGtQ":{"text":"EXTREMELY slow service. Food came out cold and took forever. Appetizer was brought with fo","useful":0,"cool":0},"_MCN6VEx-OYjL9KUx2N2Eg":{"text":"Stopped in for lunch and it was crowded, which we took as a good sign. In the case of this","useful":0,"cool":0},"xPKpD4SIrURf5qwz70lfcA":{"text":"PLEASE DO NOT WASTE YOUR TIME HERE. We had Calvin as our server and he was NOT happy to be","useful":0,"cool":0},"f1bbxpwKeHL0daMkwIftvg":{"text":"This place was awesome. Walked around for a while  looking for a good spot to eat, drink a","useful":0,"cool":0},"jkPoJ-wm_auc2FgGjYt4nA":{"text":"Went on a super slow, Tuesday night. All the food and drinks were delicious. I had the oys","useful":0,"cool":0},"fe9Mf0idNkGm-_8vBjy2Pg":{"text":"Delicious lunch for my family of 4! My husband had the oyster po'boy, my son got alligator","useful":0,"cool":0},"slF4-4YO8PGxoZXq6LGdvQ":{"text":"Oysters weren't grilled enough- bordering raw!  Gumbo was broth with lacking content.  Jam","useful":0,"cool":0},"ji6R2s23uOXHgC76Gb-FIw":{"text":"This place has some of the worst service I've ever had. We had to find the bartender/waitr","useful":1,"cool":1},"2fGbUqorert8Sv34JfmHPg":{"text":"We came in here with the intentions of drinks, appetizers, and a meal, but left after the ","useful":0,"cool":0},"zQV67xJdudJm_bG3yRAYDA":{"text":"Pretty Ok, not bad. Would probably be a worse rating if they staff wasn't so polite. \n\nIt'","useful":1,"cool":0},"Z0l6IB9zaklf2SH0J0Yp4A":{"text":"Gumbalaya was amazing. Great service during a busy weekend night. Drinks were on the weak ","useful":0,"cool":0},"jhs3BTzq7ZoV65aH3CmXXQ":{"text":"So me and my crew stopped in for a quick cup of Gumbo before our ride to Whitney Plantatio","useful":0,"cool":0},"60OOgGAyB5vqS_i8CEongg":{"text":"No crawfish... no oysters... but the service was ok and they had tv's to watch football ga","useful":1,"cool":0},"7RFWZpdr6OUfWzwdzEuyLA":{"text":"This place has some of the worst service I've ever had. We had to find the bartender/waitr","useful":2,"cool":0},"fTsWLJ0sheHWT6oQfoq41Q":{"text":"Not good, smelled bad and the food was just mediocre at best. I ordered a omelette that wa","useful":0,"cool":0},"-JA5WlFdiekx5_pN5ZdIBQ":{"text":"Staff is great. Food is so sub par... what a disappointment. I got the fried shrimp po boy","useful":0,"cool":0},"PRL-8chIB1_B2Ru6lGfXCQ":{"text":"Visited for breakfast this morning. The floor was filthy and the table was sticky. They se","useful":3,"cool":0},"OYVT89TkWwIZiP5s616E_g":{"text":"After chugging down several glasses of water during our hot & humid walk through French Qu","useful":3,"cool":0},"B1ZGuWUhtgXGP-PP-7wfhg":{"text":"It was ok. Oysters were GIGANTIC!!!! Chicken salad was blah. Only good thing about this pl","useful":0,"cool":0},"fumhekeqoNH1EkLJVMcj1Q":{"text":"Excellent (strong) bloody mary's. They will make it a \"double\" for an extra $3. Bartender ","useful":0,"cool":0},"t9kFDmnlHWmbThkrAkKAqw":{"text":"I haven't seen a wait line yet for this place, but that's probably because the food is not","useful":0,"cool":0},"0A2WNYWmOAxfelxsEkbwAA":{"text":"Okay I am a fan of 2 things! Their Crawfish Chicken and the waitress that recommended it! ","useful":0,"cool":0},"_Bfgx-44Js-3-_cUFMbdpQ":{"text":"AVOID AT ALL COST!!!!!! Should have judge a book by its cover! This bar had a low rating a","useful":1,"cool":0},"QelWS8dwFAhVSuhb5kxhuw":{"text":"The grilled oysters were amazing as well as the cruzan punch.  We were a little weary beca","useful":0,"cool":0},"h6tD-JjzrWi6NYV11M_MgA":{"text":"The food was amazing, I had the Catfish Decatur. It was the best dish that I had in New Or","useful":0,"cool":0},"CbcYfhlVpqRYcqfmIsd7rQ":{"text":"The service here was pretty horrible.  The waitress seemed to think she didn't need to wri","useful":4,"cool":0},"hkFQViLeNhgmgSxQvpFdNQ":{"text":"Ended up at Corner Oyster House after unsuccessfully finding a place nearby that could sea","useful":1,"cool":0},"xrpr03xZKz1lf4H3PxdnuQ":{"text":"We ended up here on a Sunday evening when most everything else was closed.  Ordered po' bo","useful":0,"cool":0},"QWue786CHozrJ6ovu9YMlQ":{"text":"Collette our server was absolutely Wonderful and Amazing.  She made our experience the ult","useful":1,"cool":1},"gFsgBkPJQlv3vVZRJnV40g":{"text":"Do not eat here. This is my first post ever. Very poor management.  Charred oysters were b","useful":0,"cool":0},"lh1AdZG4nyumcdQRWNa3AA":{"text":"Treat staff shitty, roaches in the kitchen as well as rodents. Food is prepped by so many ","useful":1,"cool":0},"vWnTnXD-hkZiDg_njsPLBQ":{"text":"I tried the sampler and it was off the chain!!! Huge dish!! And i eat a lot! Very flavorfu","useful":0,"cool":0},"7QSq6hX78Iwsu00GAzdXfA":{"text":"My fella and I ate here the other day and did not know what to expect in a touristy part o","useful":1,"cool":0},"-sjxuk8HsG4r45iLIVsUrQ":{"text":"We did not eat. \nThe drinks are very pricey, but worth the cost. \nThis place knows how to ","useful":0,"cool":0},"UIG4Mi7807CLV7nI2Yw1AA":{"text":"I love the convenient location of Corner Oyster! I usually find myself here in need of a t","useful":0,"cool":0},"VEfnrZrSZSf0utJLYaonag":{"text":"Stopped in for some delicious mimosas late one morning the last weekend of December and or","useful":0,"cool":0},"N-Eh4Y75jFEwBK2eCpogkw":{"text":"We went for lunch on a Saturday and were promptly seated in a high top in the bar area.  T","useful":3,"cool":2},"MYpzQQhMbYfxfivPMf9sFg":{"text":"This place has a great location -- on the corner of Jackson Square -- but NOTHING else goi","useful":0,"cool":0},"O2CYRjLeeHSFMkM-CZ4yzw":{"text":"Excellent chicken and sausage gumbo! Dark spicy redux! Hard to find gumbo without seafood ","useful":0,"cool":0},"-VznAuBJ0X8kUSkJsKKAHA":{"text":"Horrible food and horrible service! I should have known better, but after a late night and","useful":2,"cool":0},"DQGHFnDv2f-wkWbLhusPyA":{"text":"We loved the fried shrimp platters and the eggs Benedict, and the cool inside of this plac","useful":0,"cool":0},"P1krI5QqrQ_WONR1JzpaUQ":{"text":"We stopped in specifically for the boiled shrimp and oysters. We ordered drinks (the blood","useful":0,"cool":0},"Q3aFjFlTaN8UYFFQ2zfrpw":{"text":"We were seated quickly and our waitress seemed nice enough, once we ordered our drinks the","useful":0,"cool":0},"YF5GmVyd5KZjILRG0icp9Q":{"text":"Good place to stop in for a mid tour cocktail. Bloody's are good and made with homemade mi","useful":0,"cool":0},"hdq6hhtgB2KOqdWbfBQUWA":{"text":"Pasta was swimming in sauce. Nachos had cheap nasty cheese. Shrimp had heads. Jambalaya wa","useful":0,"cool":0},"kb0E-a0pRw4wZqp_XjR-sg":{"text":"Omg the chargrilled oysters were phenomenal! And the decateur gator bites were so good too","useful":1,"cool":0},"PpMnWkAt3F6Hk9cItoKbaA":{"text":"We stopped here for dinner tonight. There were 10 in our party so we understand we would h","useful":1,"cool":0},"ipvaXAP-smuyMvc98k7pSw":{"text":"I was in New Orleans for a girls trip and we ate here on the first night. I got some sort ","useful":0,"cool":0},"5ykyryHsj0NJw0sTGX-NpA":{"text":"Food was ok, have had much better for much less.  Service was terrible, gratuity is automa","useful":0,"cool":0},"a2L-CG0PXGsEgOETaTZj4g":{"text":"We only got drinks here, but they were strong and good. Decent service and great location ","useful":0,"cool":0},"yE3_iyhiiPrLOolqSLNOKg":{"text":"Had the alligator bites, they came out cold, literally baby bites (they were like little e","useful":1,"cool":0},"k6AXT9V8khmGS9ANWlxgpw":{"text":"Just had dessert here. I was craving some NOLA sweets and ended up here as it was rather l","useful":0,"cool":0},"FDUTcJrpCj7Oc_-WKl_gng":{"text":"Glad we did not listen to the reviews. Gumbalaya was amazing! Great portion for $11. Our s","useful":0,"cool":0},"kcnKe8_cGinx29NC1bfu5w":{"text":"Very nice, cozy breakfast/lunch place with good food. Gumbolaya is a must-try. It is a fus","useful":0,"cool":0},"omc9av93IcfV8gCmYkgLhw":{"text":"While on our honeymoon in New Orleans, we frantically looked for a bar with NFL Sunday tic","useful":1,"cool":0},"XKtGEQPtBayk-6i96yDn4Q":{"text":"My BF had the jambalaya, it looked great. He had about 4 bites and that was it. I tried it","useful":1,"cool":1},"O0TKO6u8mSOLeyiw6xkS1A":{"text":"I really don't know why this place has such a bad rating. First of all, our server was ah-","useful":0,"cool":0},"TzaKuMFCao42d9vlsyR90g":{"text":"Stopped in for lunch with the wife, niece and grandbaby. Ordered shrimp poboys, it wasn't ","useful":0,"cool":0},"Ii8R_sOR_0vLiE022TPsHw":{"text":"Stopped in for lunch and it was crowded, which we took as a good sign. In the case of this","useful":1,"cool":0},"_ZE4eb8uA01yFCrUalovpg":{"text":"We forgot to yelp this place.  The location was convenient and the restaurant looked busy.","useful":0,"cool":0},"6C4aLDfe43zj4AWWbZ_c6w":{"text":"Worst experience ever! Too many great places for food and drink in NO to bother with this ","useful":1,"cool":0},"De478UWatBCydSOqaS2BXw":{"text":"Started with a pound of boiled shrimp, they tasted very chalky.  Their specialty is charbr","useful":0,"cool":0},"e0EARI2WrpfguA8MfXr5ug":{"text":"My wife and I loved this place. The customer service was through the roof!! Food was incre","useful":0,"cool":0},"YXGCVpSGPkoc1qGc_zd_8g":{"text":"went there twice while down there. The sampler platter was a  bit of all the New Orleans f","useful":0,"cool":0},"xCy5nOWEz60XgLzBydaWDw":{"text":"Best oysters I've had in New Orleans. Both raw and chargrilled were amazing! They have gre","useful":1,"cool":0},"bg5rW_hEhGcsSoqvdVZ97g":{"text":"We came here on a whim a group of 6 friends. After being seated our server Angie (highly r","useful":0,"cool":0},"fDswbCq8jhveI-i2leZKlw":{"text":"Server was great.\n \nMom got bloody mary and gumbo.  Hubby got chicken paneed with cheesy n","useful":0,"cool":0},"r6MshPF1lrjYgAgPiYSnAw":{"text":"First off, our waiter was amazing.  He was honest and funny.  He recommended a few drinks ","useful":0,"cool":0},"fJdBfSxXH35uCi--sKv6sw":{"text":"Location of this place is good and their fried fish that's about it.  THE CRAWFISH for $13","useful":1,"cool":0},"vhtTAZM5H9B8qdTdMRHzbw":{"text":"One of our favorite stops in NOLA. The food is good, especially the fried pickles, potato ","useful":0,"cool":0},"9yhwO4y11YsO1S3s7e0mxw":{"text":"Wow!  the charbroiled oysters are hands down the best in New Orleans.  we tried them at th","useful":0,"cool":0},"QCYLhzMaYH-0OKmSnGeSKQ":{"text":"Had early lunch here on a Saturday. This place has a prime location in the French Quarter ","useful":0,"cool":0},"ks_ob5fgdw3WM5pXUF85xg":{"text":"The only good thing is the drinks. My order was completely wrong with a well done hamburge","useful":0,"cool":0},"nOmPwPmogFQx46T4ai4AIQ":{"text":"Angela our server was incredibly warm and friendly, made us really feel at home. Real Sout","useful":0,"cool":0},"iciBFSMvxKF7FvhslHR6BA":{"text":"Server was great, food was very tasty. Downfall was prices for the portions given, besides","useful":0,"cool":0},"6ilik_02POqLPhZWG88SOg":{"text":"Absolutely regret eating here. Completely flavorless. Crawfish étouffée, fries, and shrimp","useful":0,"cool":0},"3nDVCHvi1UhDgH_l6FUUXw":{"text":"Not good at all.  Okay for a beer, but skip the food. We split the crawfish, crab cake and","useful":0,"cool":0},"rWVB9la4UgXuLwBWuHXs0A":{"text":"The biggest regret of my trip to NOLA was coming to this place. Really wish we had checked","useful":0,"cool":0},"V13cJAg4qWPFP_Zh5VdHHA":{"text":"All imma say is the shrimp and grits lord it's good..loving the atmosphere so decent..host","useful":0,"cool":0},"NKE5pGjm6OxEdQgHyEbkow":{"text":"Gumbo had way too much thyme(I think) for me. Was thick as if roux was not cooked long eno","useful":0,"cool":0},"f_hVE9z5g7xBoCyIDjXukA":{"text":"Wow, I had a much better experience here than most. Here's how it went down...\n\nSilly tour","useful":1,"cool":1},"ef9rEyLUrDEuilrD6utIFg":{"text":"This place was pretty nice and inexpensive. Only giving 5 stars because of the GUMBO!! It ","useful":0,"cool":0},"WuNrvqBZyP9gqbyFfGJK5w":{"text":"There was a mouse underneath the table across from us. When I flagged down one of the serv","useful":0,"cool":0},"b_FP5T5k6nEsUukQ4Uj6oQ":{"text":"After 45 minutes my salad arrived minus the oysters - that took another 5 minutes for the ","useful":1,"cool":0},"Uu9NoKWab54i1mCzaihlmg":{"text":"This place is NOT a sports bar! They have TVs that may or may not be tuned to sports, but ","useful":0,"cool":0},"WA6KKYjpFVMmaMis8sUnig":{"text":"Service was horrible (our waitress disappeared for 10 minutes after getting us our drinks ","useful":0,"cool":0},"BMy0pLxyJuYy0SX5n6aRwA":{"text":"Food was fresh & hot, took a while to get. I really didnt see what was the hold up, but th","useful":0,"cool":0},"RCjfJLLmTrnnaiPWhEYlWA":{"text":"Horrible. Just keep on walking. Food was way over cooked. You couldn't even peel the shrim","useful":0,"cool":1},"ws3nSHej_edB2qo7vZuOAg":{"text":"The Worst Hurricane drink ever! I have been drinking hurricanes for 30 years and this by f","useful":1,"cool":0},"JLkb76JRY_rxkYJNSo2yIQ":{"text":"The service walking in was horrible.  The hostess told us to seat ourselves and we waited ","useful":2,"cool":0},"_kqtw9oCnf5Utbzhz6sKMg":{"text":"Was getting cold and we needed a fresh beer so we popped in this place.  The first bartend","useful":0,"cool":0},"VPbIcecYsSAaeG3TsvPEAw":{"text":"Had lunch here today and really enjoyed it.  It was not very busy when we walked in, but b","useful":0,"cool":0},"0ABU8uAUvhgHbhSEHB3R4w":{"text":"This place is the worst. The food is decent, it is over priced and everybody who works her","useful":0,"cool":0},"p0niAjYPA5QDw_wtoZNRgA":{"text":"Great place, drinks were good.  Gumbo was great.  Awesome location.  Dan helped us at the ","useful":0,"cool":0},"EXQoqzP5tF6uvUyafyh8EA":{"text":"ok I would tell you def pass on this place. $10 signature drinks really tasted like water ","useful":0,"cool":0},"4bBjojc9GW88NuHAsbrljg":{"text":"I'm leaving one star because I can't leave 0! This place was horrible . Please do not wast","useful":0,"cool":0},"Ki4b3UEeKB_gcn5tTLVZzA":{"text":"Hole in the wall, this place is indeed.  In fact, it's easy to overlook the hole in the wa","useful":0,"cool":1},"2RmzmvR3pEP6br6_030kTA":{"text":"Worst service ever.  Felt like eating oysters, so saw this place.  Biggest mistake ever!  ","useful":0,"cool":0},"5_SIeHIKE-XKOMvjaRoekw":{"text":"We wandered in from the cold for a quick bite and decide to go with what their famous for,","useful":0,"cool":0},"l6UzE8TKSDaggSuHTAkwzg":{"text":"My wife and I  walked in after ten pm and we're served promptly with courtesy and professi","useful":0,"cool":0},"r9Ielo-r-c6vN7Mu5oB_aw":{"text":"Absolutely awful, we waited over an hour and a half for the food to come out, and when it ","useful":0,"cool":0},"2d5jRlKG0vjCH3DYDtKKvw":{"text":"Waiting for friends to get back from a swamp tour (I have been on one on a previous visit)","useful":0,"cool":0},"OQJo89PSge5QRL1JyAJzaA":{"text":"Excellent Alligator Bites. Yum! Just stopped by for a drink and a light bite. Nice windows","useful":0,"cool":0},"IiU26HEPcrBY_NiUme5-0Q":{"text":"This is my hubby's third visit here. He's in crutches so needed a place to perch while the","useful":0,"cool":0},"gE5ZwqR79VYelfioXXnFKg":{"text":"We spent 4 days in New Orleans and this was by far the worst meal. I ordered a hurricane t","useful":0,"cool":0},"47nrv3DU7n5iQm8WEaqenw":{"text":"It was late and we were wanting some Cajun fare. This place really hit the spot. We stood ","useful":0,"cool":0},"nYoS7Uvz4KL8urOvqEQICA":{"text":"Literally waited over an hour for food and never got anything. Miss Tara T was completely ","useful":0,"cool":0},"AEl0pAmwj-mqpuSZodtg9Q":{"text":"The only reason that they are getting 2 stars is because the food was decent once we final","useful":1,"cool":0},"9oHFHqPRtrC3Z5UwGULwJw":{"text":"We stopped by here while walking by and it was quite busy so we figured it would be a grea","useful":0,"cool":0},"quhDtiU--T37nfX6pEOK0A":{"text":"Stopped in here on a Tuesday early eve. We were sat right away at the only booth as we had","useful":0,"cool":0},"WXh05SBSMhavSD98gBFRBA":{"text":"Well, this place had a solid roof (it was raining pretty heavily) and no line. Rude entran","useful":0,"cool":0},"iYIjJk_6bP-g5H1JmMjiNQ":{"text":"F'ing horrific. One if the worst dining decisions I've ever made. \n10 minutes to get our w","useful":1,"cool":0},"v2lXvrp2M5WiJdVp1cdLCg":{"text":"In town for the Super Bowl, couldn't find anything open with a TV after the game that serv","useful":2,"cool":0},"yB5uEaeLIYDCGc6GOoj8TQ":{"text":"Been to New Orleans many times, tried a bunch of spots... this is the only time i didn't e","useful":0,"cool":0},"q9BpNUzo6asTwIirkocp9Q":{"text":"Just met Christian (except he spells it sand the t, minus an f, and with a y and stuff. An","useful":0,"cool":0},"FiyRGBtiSyL0YkaNNz8OXw":{"text":"I can understand the low ratings from previous yelpers. However,  my experience was pleasa","useful":0,"cool":0},"HxytcbtQ6fBiNfiYTlPaFQ":{"text":"Miss Angie is craaaazy. Shes dope though really hooked us up. Shes got that weird crazy pe","useful":0,"cool":0},"nJGdMJ-tnv2_JbGPtwbJGA":{"text":"Just happened on this restaurant while walking down the street.  Our pizza was barely warm","useful":0,"cool":0},"KbdxRvGLyuG-SgUwtvtZyg":{"text":"Service was below average; out waiter also had to help out in the kitchen. Food was subpar","useful":0,"cool":0},"z3gOrtjze6sFt8xPhlj3Fg":{"text":"We waited for probably half an hour to get our food after ordering twice because they were","useful":0,"cool":0},"k4hwFZvYOTuzczjrSrEfiA":{"text":"Just got a couple of cocktails from here..wanted to pick up something to go. The service w","useful":0,"cool":0},"xcHPlljCbiRkPiTfXSBV3g":{"text":"My mother and i had never been to New Orleans, and we started off our dinner really enjoyi","useful":0,"cool":0},"Ct48DbTijV3ayfqJTpXC-Q":{"text":"Waited 2 minutes at the door, finally someone approached the hostess stand and didn't gree","useful":0,"cool":0},"u8l5O-oX409SNX7XhVTUBQ":{"text":"NOLA....Seems the restaurantshere are love em or hate em.  WELL......this one totally left","useful":1,"cool":0},"C8OakWkkFeHXVCpqieKQOg":{"text":"The roast beef po'boy was a little chewy, and the French bread easily made soggy by the gr","useful":0,"cool":0},"ttmS7GfYbPWboG0j-nNbpQ":{"text":"1.) IF you like to wait 5 min. to be seated when no one else is in front of you, only to h","useful":0,"cool":0},"_SByQfx7gx1UGcrOEAio-g":{"text":"I probably just had the worst bread pudding I have ever tried. There was absolutely no fla","useful":0,"cool":0},"nqINh90JHhW13KRUTeNHkg":{"text":"This was terrible...  I expected a lot better food for the location and the price...  so d","useful":1,"cool":0},"as07SpU4aI_zeZhk2QEUww":{"text":"I had a couple of dozen oysters raw and my wife had a shrimp poboy.  Overall the food was ","useful":0,"cool":0},"itCUE4gINSd8ZR0m7iM5PQ":{"text":"Traveling with a large group and failing to make a reservation in advance we found ourselv","useful":0,"cool":0},"3q-JBlq_X6UbWZRdQH3Vkg":{"text":"We had the pleasure of having a great waitress , but to be honest they all seem nice. Food","useful":0,"cool":0},"77jkntvuSH9smL8SkbYpxg":{"text":"The manager of this restaurant is a complete scumbag. I walked in and headed to the restro","useful":0,"cool":0},"gVCYaTJ2EZAq-M9_PjUuUw":{"text":"À oublier. Le service est tellement lent que nous sommes partis sans manger. Après plusieu","useful":0,"cool":0},"jHLc4uiKNVDieyS2aLIQOw":{"text":"I actually don't have a whole lot to add to my first review, I just really think it deserv","useful":0,"cool":0},"D1Z1oDsz2pQiB84WqMK4sA":{"text":"Good for drinks and about nothing else.  My husband and I popped in here for a quick drink","useful":0,"cool":0},"Qpsl-OM8ZLcgzeZSF7Tc8Q":{"text":"Oysters at the Corner Oyster House.. The oysters aren't that great.. at all. You get what ","useful":1,"cool":0},"VPSAe7ucfh7lA86SbvGwnQ":{"text":"I ordered the crawfish crab cake pasta, there was a bug in my food. The wait staff was nic","useful":0,"cool":0},"5PLILaqKO3xlUyXnPte4pQ":{"text":"The host and server greeted me promptly.  Nice atmosphere.  The appetizer plate was tasty,","useful":0,"cool":0},"x3F5qzZBkjgb00GMfOLL9A":{"text":"when i asked for water,i was promptly told that they did not serve tap water, i was told t","useful":0,"cool":0},"nFKMi-eaXj9spShWKwdenQ":{"text":"This was a good spot to stop for a good old dive bar drink.  They have sit down tables for","useful":0,"cool":0},"U6LupWVnSVDN6fAkMlZkKg":{"text":"They must capitalize on their location, because the food and drinks are not that good. Sav","useful":1,"cool":0},"CTYR2u3W7XTjULD74C5bGg":{"text":"When I walked into the Corner Oyster House, I expected to have a decent meal. What I got w","useful":0,"cool":0},"Eb5SvZCh79S3bvFUXYNA4Q":{"text":"This place is an excellent place to have a cocktail and watch the people pass by. The food","useful":0,"cool":0},"qx-7rlt1LPXRwlj_ubmU0A":{"text":"My family and I visited New Orleans this past Sunday. Upon the referral of a stranger, we ","useful":0,"cool":0},"Q5xA4pIQv65Gd-K9cVk32Q":{"text":"Have you ever walked into a place and just know that it's not going to be a good experienc","useful":6,"cool":2},"3bQ1arljoDyluGxH9BfTVQ":{"text":"Love this place.  During family vacation a year or so ago we made a point of coming here t","useful":0,"cool":0},"SnTGCVKpcQ81BiMMBQZsug":{"text":"Although the food here is decent for a touristy spot, this review is about our server, Joy","useful":0,"cool":0},"N7V4JJA3eef0VMg4HqG5eg":{"text":"We took a day trip to New Orleans and of course wanted oysters. We came across Corner Oyst","useful":0,"cool":0},"m5V1Gf4B5xqVMkjVXt9BAA":{"text":"Good not great.\nNice bar atmosphere and staff but the food was just OK.","useful":0,"cool":0},"NgHbKjeYERSPPRpMWvOPrQ":{"text":"Once again, a great experience. So much better than Cafe Pontalba, and an amazingly reason","useful":0,"cool":0},"XnuCTD8Hp4oNvd0tfcQEBA":{"text":"Good spot to duck off in & refuel.  Food was sub par.  Service was slow. Not too crowded. ","useful":0,"cool":0},"m4WeH3CcNstOuxdTJZZSGQ":{"text":"DON'T TAKE CHILDREN HERE.\n\nI've never written a Yelp review before, but I felt like I need","useful":0,"cool":0},"ZyF-Nhc_4-N7CGwytfEieA":{"text":"My first trip to New Orleans was with my best friends Bachelorette party and after walking","useful":4,"cool":1},"2deP9vuaia4UICDBkPcwbg":{"text":"Sat down and ordered a shrimp appetizer and salad. It's been 40 mins now and no sign of fo","useful":0,"cool":0},"0I5Nl7gtYhfuv_vU7SeRWQ":{"text":"First of all, it took forever to order and pay for our drinks at the bar. We wanted to gra","useful":4,"cool":3},"rrsAOgwyXFlbYDtl09jOHg":{"text":"This was an AMAZING experience all around! Oysters were amazing, the VooDoo Brew is out of","useful":0,"cool":0},"NFv7ht1t0Mbru_NRInJlxA":{"text":"Food was ok, nothing special. The service was terrible. One food order didn't come out and","useful":0,"cool":0},"nlIE6BYfzymebjgJ3uvVUQ":{"text":"Service here is always a joke when we go and u hate that because I love to eat here. They ","useful":0,"cool":0},"5Eb2nsYxjM25TjhiJcYPyg":{"text":"They may not have the best food in french quarter but they sure have a great service. I ma","useful":0,"cool":0},"6mVMDPJK31QPJKR54uMIfQ":{"text":"Great place to eat breakfast here. We tried the Bayou omelette with grits/ hash browns. Th","useful":2,"cool":1},"sL0roTOtr3mGMl_vlfwCwQ":{"text":"The seafood sampler special I had was well worth the $23. Huge helping of food and you cou","useful":0,"cool":0},"X4TOnigMpIyPNf0ZqIcspw":{"text":"Better than I expected.  Given the location, thought this would be a tourist trap.  But th","useful":0,"cool":0},"gKQswIvTAWZoChRv7wJLeA":{"text":"The absolute best Bloody Mary on the planet. Grabbed one to go..and enjoyed a nice cigar i","useful":0,"cool":0},"9VPtDv9zRNzQQlpxHThKKQ":{"text":"The Corner is the best place in the French Quarter!! The charbroiled oysters are the best ","useful":0,"cool":0},"pU1nEA0tOMcFCCWOgqtC9g":{"text":"Great Gumbo and Seafood Pasta. We ate here 3 out of 5 of the days we were in town. Plus th","useful":0,"cool":0},"flPKeKaYslvVPmqIT9H6aQ":{"text":"One of the best places I ate during my stay. Make sure Angie is working and specifically r","useful":0,"cool":0},"qZP8WGu74J8qu8-FWDDV5A":{"text":"CRAPPY CRAPPY CRAPPY!\n\n1. Our server was drunk and very obvious about it.\n2. The food was ","useful":0,"cool":0},"zxx7j1bcxAdvqYs-py7rZg":{"text":"Skip! Fell into the tourist trap with this one and wished I waited until I found something","useful":3,"cool":1},"DDtpEIHdztNbMztn3cIJHQ":{"text":"It was hot outside, the A/C was cold and the overpriced drinks where ok and in to-go cups.","useful":0,"cool":0},"ojnsp7znCSEhN2xxuR8RCA":{"text":"Seriously, fuck this place. You're going to ignore my table through an entire football gam","useful":2,"cool":1},"pvvdDaouwtEvSQOWNbSaDw":{"text":"I am in disbelief about how terrible this restaurant is. We didn't expect a 5 star experie","useful":0,"cool":0},"pMtYlnZvspkenThxuntrkQ":{"text":"Do not stop here! Asked for a grey goose and seltzer with lime and got a glass of ice wate","useful":0,"cool":0},"4BA5bc3k0gdkcLzChOyKOw":{"text":"We stopped in for a rest, a beer and a snack. The wings weren't that great. But the drinks","useful":0,"cool":0},"Qb0Hvaf-G9mTZryoYOB7kQ":{"text":"This rating is for bloody Mary's only. My wife loves bloody Mary's and I am not a big fan ","useful":0,"cool":0},"2KIIeyPtjfpSAPB_CTh0cA":{"text":"Service was very slow and not very friendly. The food was only ok and expensive. The locat","useful":0,"cool":0},"KCfEsqfXim04c7DBYrUG8g":{"text":"Horrible service, waited for an hour at a table and our food had not even been made yet. W","useful":0,"cool":0},"vf8dOW9WUnB6KMMzVa2n0w":{"text":"We are glad to have found this  lace when we saw the Cafe du Monde line was at least 45 mi","useful":0,"cool":0},"3gQudGeVGUftBublCB7iDA":{"text":"Everything was delicious! The service was wonderful as well. The Gumbolaya was my favorite","useful":0,"cool":0},"sSikJXRR94vF6LIlj-I7Lg":{"text":"I can't believe that of all the places I could have walked into, I chose this place... Wha","useful":4,"cool":0},"obYyDptl-a8TjY2jyGGFBg":{"text":"Nice ambience for a sports bar - tall windowed doors looking out onto Decatur St, historic","useful":1,"cool":1},"6GjlpnlgaV71WEcokPhlPA":{"text":"Super surprised at the reviews for this place!! We ordered the Chargrilled Oysters and the","useful":0,"cool":0},"8HftuD3qiVYkJBEkk5NZvQ":{"text":"We had to wait over an hour for our food. Our server did a good job of constantly checking","useful":0,"cool":0},"IDFeNlowyyvUJ8Wshv38cg":{"text":"Food was good. Had 1/2 oyster,1/2 shrimp po-boy. It was pretty good. I ate at the bar and ","useful":0,"cool":0},"5vN18bbLCxXSuAAfK2p4nQ":{"text":"Great shrimp creole and gumbulaya.  Idk Why people didn't like this.  We thought it was aw","useful":1,"cool":0},"IlKH0-koSA35rP7DDMuHsA":{"text":"AVOID AT ALL COSTS!\n\nWe walked in and waited about 20 min to be seated, even though there ","useful":1,"cool":0},"_8u9uYrvx-epKv62FCdhSg":{"text":"Slow evening with no wait to get a table. Our waiter was nice and very Friendly. The after","useful":0,"cool":0},"fOceQXauuHFh9_g6F3xzRA":{"text":"Just avoid this place.  It's a tourist trap designed to take advantage of people who reall","useful":1,"cool":0},"_mbq0coscW_cGJUn7Qa4Sw":{"text":"Seated quickly and good service through the time spent there.\n\nOrdered oysters for the tab","useful":2,"cool":0},"DnKdf2BEgE5cBwRQMc7okg":{"text":"This place gets two stars for having a good waitress. The food and drinks on the other han","useful":1,"cool":0},"nO-yimzhT4mLUa5rZ5w7rw":{"text":"Well,I'd give more of a review if I had been able to signal any one of the three servers o","useful":2,"cool":0},"Ta9R_4TrsrZro_6aqnTy7g":{"text":"We had the chargrilled cooked oysters and shrimp nachos. It was delish. This was my first ","useful":0,"cool":0},"Dg2Zp3yki10D9gf0owO_PA":{"text":"Experienced terrible service when we ate dinner here tonight. Found out the crawfish was o","useful":0,"cool":0},"zgBbgobc3c9pq_iYAbTQbA":{"text":"Terrible place . Wasted over an hour to get a burnt sandwich. Good oysters though but ever","useful":1,"cool":0},"x_od4Dx6Kowzww7wKi5gIA":{"text":"It was almost a one-star... as the service was horrible. We get there and the man that sea","useful":0,"cool":0},"ue5MTJhtkFZxhjvkBLAUMA":{"text":"This place is great to stop in for a cold drink!!!!! I ask for the Voodoo Brew........mmmm","useful":0,"cool":0},"qODmNM1cJc60kZYiOsZY_w":{"text":"Food is so-so. Typical bar-seafood joint for tourists, but the Bloody Mary is out of this ","useful":1,"cool":0},"3tyLQs9ZOHJhx1zEqEKuwA":{"text":"We sat down and it took 20 mins to get drinks. The manager said there was a miscommunicati","useful":0,"cool":0},"OOk9ErLgN7966NPuc1JXwA":{"text":"This place is the reason I try and read reviews before I walk-in. More servers than seated","useful":0,"cool":0},"-7xDK5vACmVZ1RA7rPU4LQ":{"text":"Nice staff and delicious crawfish! We shared one plate to try it out and we were all happy","useful":0,"cool":0},"GNBvqVILYR-xVQW6ND81qA":{"text":"Me and a group of friends decided to stop in late one night to grab a bite to eat.  We ord","useful":0,"cool":0},"kQp_-Z55zmVoHuQ7878psg":{"text":"HUGE TOURIST TRAP. Do not come here unless you just can't wait and are starving. \n\n\nMy fri","useful":0,"cool":0},"qRgC5gdITV08w0F-s4txIQ":{"text":"Eh food was subpar but fast and good staff.. The shrimps were questionable and didn't seem","useful":0,"cool":0},"lpHKqgsfJCVdjDNrIoKORw":{"text":"We ate here and had an awesome experience. The food was good. We had gumbo, wings, catfish","useful":0,"cool":0},"tLrRQNT0fbA1kxuhw47dqg":{"text":"A beautifully rustic ambiance with a touch of celebratory viberance! Located right across ","useful":0,"cool":0},"JBuk166bc0te2a6VR2jcxA":{"text":"The Caesar salad with blackened chicken was pretty bad, chicken tasted like an eraser, cro","useful":0,"cool":0},"Pczf2UjWuBACv8petvsEnw":{"text":"Walked in bc there was not much open on a Wednesday evening about 9pm. Glad they had their","useful":0,"cool":0},"Lu6UuclV5dP9yKtZraXWRQ":{"text":"What a shame a wonderful location is used by a mundane bar.  Poor beer selection and greas","useful":0,"cool":0},"tYsunpNPOVvHIKE3--ZkJQ":{"text":"The worst eating experience during my four day trip to New Orleans. The appetizers were an","useful":3,"cool":1},"Ebe0e4zR-2S45dLMMLnUOw":{"text":"I really wish I could give Corner Oyster House a better review. I always try and find a re","useful":1,"cool":0},"_7iLWZjNhD-f-JN2u3aQJw":{"text":"We ordered appetizer of char grilled oysters a beer and ordered food for a meal for two.  ","useful":0,"cool":0},"w7pDS3ReoSu5Fb9GxtnwTg":{"text":"There are way better places, keep walking.\n\nOur table, including drinks, food, and phones ","useful":3,"cool":0},"JQToAg8TAErLg2c4S8H_6Q":{"text":"During my meal, a server reaches across me while I'm eating to get the ketchup bottle to t","useful":1,"cool":1},"Bb11r4vBNJzqTNqC6LG0IA":{"text":"Excuse the hyperbole, but this place has the BEST BLOODY MARY'S EVER.  \n\nI don't know what","useful":1,"cool":0},"QBhbl-72HPUaSkMy844N-Q":{"text":"I honestly feel like the one star is even being generous, we had a TERRIBLE experience at ","useful":0,"cool":0},"wXKpN2Z6tm6WJ4Xrb1p2tg":{"text":"cold beer, no wi fi no Big ten network....thumbs down!","useful":0,"cool":0},"vKyrU60TO1DjzMjOSi7zdw":{"text":"went there last Thursday and everything was OK. 2 kids ordered the pizza. and mozz sticks ","useful":1,"cool":0},"1hrq4n2lGXKmeXR37m_nIQ":{"text":"Went to them today. Ordered the  Seafood Gumbo it was not ready. We order other food and o","useful":2,"cool":0},"N5IheZeK5hTwFI8UL-i7wg":{"text":"Nothing good to say about this restuarant. Service was horrible. Did not have several menu","useful":0,"cool":0},"4ifsFjQLCiwN0jqlWZ7N6w":{"text":"Visiting New Orleans for Mardi Gras this weekend from Miami. I have a service animal, he's","useful":0,"cool":0},"YpGWirJGBBmzWXorFg6X2Q":{"text":"Bloody Mary was really good! The \"Gumbalaya\" was phenomenal!! I'll definitely eat here aga","useful":0,"cool":0},"fbwPyBJUG3ZN2dS_cwe7jw":{"text":"I don't understand how the Manager (red hair) can walk by our table as we're asking the ba","useful":1,"cool":0},"Lm6z61V1eeETdxqi5zRglQ":{"text":"Stopped in here for dinner after walking around for a while. Waiters seemed confused on wh","useful":0,"cool":0},"FFJ3TQdbmex9tpT8h5Gkiw":{"text":"I stopped in here solo one weekday night while visiting NOLA. The Corner is located next t","useful":0,"cool":0},"XqnbOGDxQU9iKreicP7o0Q":{"text":"Love the grilled oysters and my favorite bartender, Stephanie!!! From Houston with love...","useful":0,"cool":0},"lh5iLhR0ZYSgDZkiYu6uOQ":{"text":"Was going to give this a five star review because we went in at night and had an amazing e","useful":0,"cool":0},"q0ak4j9BNWab_URnB8mnuQ":{"text":"I had the shrimp & catfish plate and thought is was excellent.  Everyone in our group real","useful":0,"cool":0},"3OPIHSEANdueHjVUDSeMiw":{"text":"I like this place and don't get the bad reviews.  It's a sports themed bar with a great dr","useful":0,"cool":0},"-W0Mz-9TteybNpPT65IHUA":{"text":"Did not get a good vibe from server Dustin or the hostess up front. It's 12:40 on a weekda","useful":0,"cool":0},"auQKkH8F06lw6AYghlALFg":{"text":"I guess according to some of the other reviews, we caught this place on a good day. We rea","useful":1,"cool":1},"39_QcwbZqpn0KzQsnzqfbw":{"text":"Ordered a $16 seafood omelet with toast and grits. They brought out stale fries instead. S","useful":0,"cool":0},"mH_-uDFl0bQn23NCK6s49A":{"text":"I must have hit them on a good day. Service was great. I had shrimp Creole and was very im","useful":0,"cool":0},"IrDufk7Ijq_Wd1ry3Is6aw":{"text":"Terrible service. A friend and I went there at 1PM on Dec 27th and ordered plates of Jamba","useful":0,"cool":0},"IqyeCXq3DkGTQOLLIv69kA":{"text":"I have to update this review. A year ago i came here a put up with bad service to get the ","useful":1,"cool":0},"NXg0pubG1yvwfwjWjQNqKA":{"text":"Excellent Jambalaya!!  Relaxed and casual atmosphere right in the heart of the French Quar","useful":0,"cool":0},"4qgOqg8wbXQWbTJEo72jqw":{"text":"I agree with Joe C.  I LOVE their Bloody Marys!  I have a certain way that I have always i","useful":0,"cool":1},"7rJGvtHGfEjvcvErcekqQA":{"text":"Hands down the best charbroiled oysters and yes I've had Drago's.  Great food and if you a","useful":0,"cool":0},"ZdscOdIu-vEfIZYJOg5PQw":{"text":"This is the place for the char-grilled oysters.  Best in the city by far.  We were there o","useful":0,"cool":0},"BL9A10-vf6oUlYmZ2d1M_A":{"text":"Me and a couple of hostel roommates were walking around looking for a place to eat and eve","useful":0,"cool":0},"X-PTfNsbP5Nh3Z_KB0Dkow":{"text":"We stopped here for a mid afternoon snack after a long walk around the French Quarter. For","useful":0,"cool":0},"eT5frMp-xs1Tp3lSHWJTPA":{"text":"Stopped in for a bite to eat after a Yelp even touring some Royal Street galleries. I thin","useful":2,"cool":0},"kqYG-Br1Kz-LygS4gSbgjg":{"text":"This was the most horrendous experience I've ever had at a restaurant in my LIFE. Cockroac","useful":1,"cool":0},"fHvlnaIy5aw43yrsYdw9MQ":{"text":"food was good on a chilly night. reviews were ok, but I went anyways. i liked it. personal","useful":0,"cool":0},"5-d8F5Xm5Z5VyW5R5gAbcg":{"text":"Always like this place. Good food and drinks. Gumbo. Charbroiled oysters..alligator. Yum","useful":1,"cool":0},"t-jPrWPmkNKHwmNlsx6ifA":{"text":"Had dinner Christmas Eve. The wait was over an hour for food. They said they were short st","useful":0,"cool":0},"3KPJtYOhF209vpOxnAITBQ":{"text":"Food was good, service was good. Was goad we ignored the other reviews. I saw them and fre","useful":0,"cool":0},"9YbLPGO4RPkObAXBHCZx0w":{"text":"Came in here a two weekends ago after seeing a Mardi Gras parade and it was the worst meal","useful":2,"cool":3},"osjgMoQUQSzc1lhzq-pLvg":{"text":"Wonderful morning in the French Quarter.  Watched the boats on the river a while and then ","useful":0,"cool":0},"ugstyAjpALNk6ALMQk04pQ":{"text":"It gets a star due to the nice waitress staff. Other than that the food is not that good a","useful":1,"cool":0},"43oEsBtNNlt5RQkryr1bMg":{"text":"I've eaten here quite a few times. So why would a go back to a 1 star joint? I don't alway","useful":3,"cool":1},"nAVuuHjs8a1vxLn0aBhLUw":{"text":"Had the bacon wrapped oysters and a blackened chicken po boy.  It was all good and average","useful":0,"cool":0},"HMtvRENphnC2izOW8lFv1A":{"text":"Poor service, poor food, no accommodations, unwilling to make any changes. Will never eat ","useful":2,"cool":0},"HoDbKoR5KXEYYQwJzTm2_Q":{"text":"Went in just for drinks and decided to get an appetizer. The amazing bartender suggested t","useful":1,"cool":0},"2DjwyRNfgQI4DZK-SGHsNA":{"text":"I looked forward to enjoying the food at this restaurant. The experience was mediocre at b","useful":0,"cool":0},"dewsJpOo5aZ7T31xtQ5Gdw":{"text":"I can only blame myself for this...This was on a whim, and I didn't check Yelp for what I ","useful":3,"cool":1},"2YleQudQRtUdeo7khivREQ":{"text":"I came by twice for drinks to go while exploring the French Quarter.  The Hurricane was to","useful":0,"cool":0},"WBsAXxr3N3kNctE1RDkLlA":{"text":"This was the first restaurant I ate at in New Orleans, and I'm disappointed I stopped here","useful":0,"cool":0},"XAHxFTAdq05ursUQCBfkLA":{"text":"Had the char grilled oysters no flavor at all Acme blows them away the jambalaya was soooo","useful":0,"cool":0},"H9bcpwPmpV5MIwVIfalFeA":{"text":"The worse experience ever. I sat down for 20 mins before even getting a simple drink. I'm ","useful":0,"cool":0},"NkaG7o21wy4T1zuaiALeDw":{"text":"My friend & I split the sample platter (fried oysters, catfish, jumbo shrimp & gulf shrimp","useful":0,"cool":1},"JiVaXrrnUcnvGSyxHM8OVw":{"text":"Can't rate the food because we wound up walking out due to the INCREDIBLY OUT OF THIS WORL","useful":0,"cool":0},"YIf9gHderyEadLJX_IgFHg":{"text":"This place was awful. The floors were greasy and slippery. The bathrooms were disgusting. ","useful":1,"cool":0},"MHJ-ds66B83S-_CRH7ly6Q":{"text":"My daughter and I were craving oysters on the half shell (NOLA is so famous for).  We wait","useful":0,"cool":0},"5pO_rZyvB1SeNTs-sePtVQ":{"text":"My sister and I enjoyed our hilarious and incredibly sweet sever . I recall his name as Ky","useful":0,"cool":0},"p_5XOxcwqpKpf5_7iWUOjw":{"text":"Excellent service and food. Cliff was my server and was very knowledgeable and charismatic","useful":0,"cool":0},"NGUomK6_VeiBCX_zxsZr7w":{"text":"DO NOT COME HERE FOR OYSTERS.  We came for a nice oyster dinner, and thought where better ","useful":1,"cool":1},"gnmZ6h-Zrb1Zhh2xLAdfPw":{"text":"I would give this place zero stars if I could.  The worst experience I ever remember havin","useful":0,"cool":0},"VMCsdDUnj78x5twIvINSFA":{"text":"Absolutely dreadful. What a waste of a dinner in New Orleans. There were four of us and al","useful":0,"cool":0},"xtjBTYfUNdkdyQFCWvWmMA":{"text":"This palace was recommended to us for the char-grilled oysters.  We sat at the bar so we w","useful":0,"cool":0},"MWRoJ6Lo_FEcMF0SnXv8nQ":{"text":"Meh. Fast food quality at fine dining prices. Staff was nice and helpful but some of the d","useful":0,"cool":0},"YD2fOz_xZrW2_2B-9A1n4A":{"text":"YES, YES, YES!!! Down home GOOD! Great southern hospitality! Great eclectic feel from all ","useful":0,"cool":0},"jS81bSbiq5-3KuYfn51daA":{"text":"When we arrived, there was no host at the front and we seated ourselves. Our waitress, Ari","useful":0,"cool":0},"zorIi9X68GAXXNGaiL5r8A":{"text":"Besides the fact my party had the most amazing/sweetest waitress Brianna this place was Go","useful":1,"cool":0},"3nOuSgLYGylsoftOsY4WKw":{"text":"Visited for the 1st time only bc we were starving and it was the closest place. We weren't","useful":0,"cool":1},"KdnW_zUDNIx5q2RHVFFo9Q":{"text":"Disappointed. Great serving staff. The Margarita was good. The oysters excellent. The rest","useful":0,"cool":0},"xxpLnBKAklv-8Mg0u4wnOA":{"text":"Got the burger and the service was terrible and we waited so long the food came out cold. ","useful":0,"cool":0},"n1AJZzlpTgQulr6op2yH8A":{"text":"I should say up front that I did not eat or drink here. That is because I walked out befor","useful":0,"cool":0},"du-1fmo1aqcLs7q7Cxn-fw":{"text":"The oysters and the VooDoo Brew were awesome. And our waitress was so fun and outgoing! Lo","useful":0,"cool":0},"_QZZOEYkmKbLfj5j2wbqDA":{"text":"The only reason I'm giving the place 1 star is because I can't give it zero. Worst service","useful":0,"cool":0},"ZUF4Z1SlaeeHyNXHg9pFAQ":{"text":"Let's start off saying the food is very bland I order shrimp Alfredo. No spice, no flavor.","useful":0,"cool":0},"t5WRyBzNykT2Ti7dbwEaqg":{"text":"Stopped in to watch a NCAA game and it took around 15 minutes to get a drink at the bar. B","useful":0,"cool":0},"QxRY0qds50BKAxnqTwUJSw":{"text":"Over one hour for eggs and gumbo is hard to understand.  But there was plenty of time to w","useful":1,"cool":0},"IzPVoEpaGVGGRT_vcUMYBQ":{"text":"Worst experience in New Orleans. Went to Corner Oyster House last night. Fat Tuesday I exp","useful":0,"cool":0},"9gu7YqEZ15BDqMf5E3HZNw":{"text":"I will preface this by saying, I downloaded the app specifically to chronicle my family's ","useful":1,"cool":1},"b9Q-v8DRATcAa3f8OXXfvg":{"text":"The restaurant was OK.  It was not amazing or special. The soft shell crab platter was goo","useful":0,"cool":0},"h79qLWUfjjvKe8uXwKs6xw":{"text":"If I could, I would give less than one star.  OUr waitress, when asked questions about the","useful":0,"cool":0},"A4x5REmuvHtzXx4X1Xpt1w":{"text":"I stopped into the Royal Street location July 2017.  It was a last short beer stop before ","useful":0,"cool":0},"PLYQWsFZhgGMd68SLEiQMg":{"text":"The service here was absolutely horrendous. We were the only people in the place and the w","useful":1,"cool":0},"kvO5ya5aCLyRl3VZ2Of6vA":{"text":"Came in and ordered three expensive meals and drinks. One of our party had a chicken strip","useful":0,"cool":0},"z1bURQk3kKOxrs7nA7422w":{"text":"A bit disappointed we were told for a Sunday they were out of oysters.  We were seated rig","useful":0,"cool":0},"5FzsOsJiySuM87gIZ71GVQ":{"text":"DO NOT GO TO LANDRY'S. Had a horribly slow, unapologetic, and terrible experience and afte","useful":0,"cool":0},"7Noy92_g_LX_HR4P0fbaXA":{"text":"Stopped in after our haunted tour and are so glad we did.   Dece was friendly and welcomin","useful":0,"cool":0},"52vNlJYKGrj9plnMdDX_Tw":{"text":"Went for brunch Saturday. Service was terrible. Food was terrible. Manager saw that we wer","useful":0,"cool":0},"OxZc_8kP5L2_N7w-Vcw5yA":{"text":"Hard pass. With so many great places to eat in New Orleans, this is one of them places you","useful":1,"cool":0},"RfpWnB6H4JTOO-PdQHBKpw":{"text":"Usually this place is great, but after my horrible experience tonight, I will NEVER go bac","useful":1,"cool":0},"UC5-7VkAIa-ya1z4j-rbmA":{"text":"We stopped in for lunch--simply for the grilled oysters on their menu. (We almost passed b","useful":0,"cool":0},"Gs7hGxjd9OIgYzpN5WAaTA":{"text":"Great place, drinks were good.  Gumbo was great.  Awesome location.  Dan helped us at the ","useful":1,"cool":1},"gA3bbrKiLjKWIdGGJ1YAbA":{"text":"This is a nice little bar in New Orleans with good poboys, and great coffee. They serve br","useful":3,"cool":1},"2scIt9SMmjB29cupT5qSgQ":{"text":"Our second stop of the day.   Raw and chargrilled oysters.   The chargrilled oysters were ","useful":1,"cool":0},"i0uJ7Z92eFpOVw2NYF65kA":{"text":"We LOVED this place while we were visiting from Austin, TX! We came back for breakfast twi","useful":0,"cool":0},"GKTyQgODIgX5F-z8rwDvow":{"text":"We are traveling from the East Coast to Texas and stopped in New Orleans for the night. We","useful":0,"cool":0},"j-xkEpGU6MLcIXYkcOljbA":{"text":"A waiter at another restaurant recommended that we try their gator appetizer and it was pr","useful":0,"cool":0},"_ssdEy5yhORBXAXYyag1PQ":{"text":"Our server Calvin was awesome! Gave us great food & drink recommendations!! Try the Voodoo","useful":0,"cool":0},"Y9VOQvbyeHQTIJHUp20Y5w":{"text":"So I'm not exactly sure ... either I got lucky or they read the reviews and changed. I had","useful":0,"cool":0},"1dBZaQcmTI0uFYOa4cN64g":{"text":"Me and my boyfriend are visiting from Houston and we were looking for some good Cajun food","useful":1,"cool":0},"-Zy8CbdUEb2x5qX5S3B8Bw":{"text":"Stopped in for a drink or two and catch a little football. Jen was the bartender and provi","useful":0,"cool":0},"p5QI9ZYAShahrd9NvLNacw":{"text":"We were informed that the food would take about an hour which was fine. We waited ten minu","useful":0,"cool":0},"CrhDLwENEancSGQe41czQA":{"text":"Restaurant itself is pretty nice in a good location, but that is where the compliments end","useful":0,"cool":0},"73uyBJIDAP9zjvnsBwfYRA":{"text":"One word \"Disappointed\". Had the New Orleans sampler and the portion was great for $21 but","useful":0,"cool":0},"G_jqgm3oQ584OkbkDyeoxg":{"text":"This restaurant is always a good choice. However, the bartender could have been friendlier","useful":0,"cool":0},"ytqxO7o0s1_CvnnFLaCPlA":{"text":"Nice, non-sterile atmosphere. Hypnotically Cajun. The water is strikingly overpriced and a","useful":0,"cool":0},"6oWHo7uNox7_AqL0s-heIQ":{"text":"Jennifer is one of the best bartenders ever! Very nice! Great service. Great cocktails. Gr","useful":0,"cool":0},"awChJR_esrz81q5A5KeTBQ":{"text":"The New Orleans sampler with jambalaya, shrimp etouffee, red beans & rice, gumbo, and  bre","useful":0,"cool":0},"FsU1XBYdm4NZ0DWd_RhW3A":{"text":"Might be one of the worst sausages I've had in my life. I knew this would be a tourist spo","useful":1,"cool":1},"_oaToBgX0lZwVSYx5mrzng":{"text":"Jonathan, dece, and Don we all amazing servers! They each made our short experience memora","useful":0,"cool":0},"FaDW2Eu_k9LfylEIoh1hLA":{"text":"Stopped in here for an appetizer late lunch & a couple of drinks. A half lb of shrimp & a ","useful":0,"cool":0},"NzIvwR6xYOe91gYqA1YqQw":{"text":"This place gets a bad rap. The brunch was surprisingly good. I would suggest getting one o","useful":0,"cool":0},"T7bYQNwXmw-8_yxjCmOXNA":{"text":"Well.  \n\nI love New Orleans.  I love the history. I love the electricity. I love the FOOD.","useful":1,"cool":0},"tGmuzUfeWilWbZuOo0yFjQ":{"text":"Basically inedible. We ordered the chicken nachos and onion rings and were VERY disappoint","useful":2,"cool":0},"P948FjhxXdxagd9O3UwF2A":{"text":"Not a bad  place to stop for a casual drink and snack in area.  Standard pub grub menu.  F","useful":1,"cool":0},"kxrvLZyb5Qkn7e5ipMs7cg":{"text":"Best chargrilled oysters!  My daughter and I went with the recommendation of our waiter Ca","useful":0,"cool":0},"BdsdvXQxQEAoMx_KYY_ACg":{"text":"We were seated immediately & only wanted something to drink while we took a pit stop. We o","useful":0,"cool":0},"1FW7xd_G4L4S--6kkYIq2Q":{"text":"I didn't check the reviews of this place until we were already sitting and by that point m","useful":0,"cool":0},"iifKHLQzWOH8L6FQ5p1_eA":{"text":"Great location, horrible service and management. Do not get the charbroiled oysters as the","useful":0,"cool":0},"lHTm6ZKWZhBKsMAqVokP3Q":{"text":"I just want to start by saying the food was good but that's about the only positive thing ","useful":0,"cool":0},"66Xb4oj069iOWK9ObSEN3A":{"text":"Something was odd about this place... it smelled really weird. We couldn't figure out if i","useful":0,"cool":0},"5Kje_lOUEzlhxoCLd9zh8g":{"text":"Dined here on Tuesday and it was TERRIBLE!! Don't waste your time or money. Shrimp, crawfi","useful":0,"cool":0},"PPJLfoO8F-DzUCLL_PHJdw":{"text":"Place is advertising breakfast , it was bit crowded and they had empty tables. Major mista","useful":0,"cool":0},"VSgN9pQJViOSVn61-VMfJA":{"text":"My wife and her four friend sat at the bar for 15 minutes waiting on a drink. I showed up ","useful":0,"cool":0},"8nlZ2W0ZajgV92jTiSynYQ":{"text":"Visited this restaurant yesterday and had the catfish po-boy. It was ok but it didn't wow ","useful":0,"cool":0},"Zf7D-RMlAauUOsJaJjsTxw":{"text":"We couldn't decide where to eat and considering this is at a prime location we thought the","useful":0,"cool":0},"FiHLlcEM2DwARZ1ZNvmH1Q":{"text":"Voodoo Brew- highly recommend if you want a fun drink that won't knock you out! \n\nChar-Bro","useful":1,"cool":0},"tH2zMMFsJ85AW4HI8IKM1A":{"text":"Tourist TRAP! Convenient location, LOOKS nice... but compared to some of the AMAZING food ","useful":2,"cool":1},"K9fWRU3YjJA7g8j3-YA2oQ":{"text":"Wish I had read some of the other reviews before we came in here. The fried pickles were e","useful":2,"cool":1},"ro5gcrNRrEueT6hvrMRIuQ":{"text":"Last food stop before heading home. Gumbo. Excellent choice. Would recommend and come agai","useful":0,"cool":0},"v5gzeS3rON-rtvrO_dk9Jw":{"text":"Absolutely nothing special about this restaurant.. restaurant is strictly for tourist that","useful":2,"cool":0},"CFQ-whADNDsRQ0zHAIiuSg":{"text":"I came to NOLA unexpectedly for a short & sweet trip. Of course, I needed to have some cre","useful":0,"cool":0},"1N53v7g41IBx3MmDFQY0Fw":{"text":"Great food at a reasonable price. \n\nWent here on a long weekend vacation with my wife, who","useful":0,"cool":0},"YRpxs_Tof4EUjZiFHvlbEQ":{"text":"Stay way if you want to eat!  The only thing this place has is a good bloody Mary and Stra","useful":2,"cool":0},"IhDVkEOhriPThml18WS0zA":{"text":"The service here is horrible. We waited 25 minutes for soup and chips. They were very shor","useful":0,"cool":0},"pTEtRC-o9IdHQkWxQRbNVw":{"text":"The worst place I have ever been to in anywhere around the world. We waited nearly for 2 h","useful":0,"cool":0},"BmJq39LjkuDvudRy6ESN1w":{"text":"Underestimated from the reviews! BEST chargrilled oysters we had all trip! Went 3 times an","useful":0,"cool":0},"0BIEzW3BHqFayB9kdAz0hA":{"text":"Strolled into this restaurant while touring the area. It was packed so we had to wait at t","useful":6,"cool":3},"ADIs3opvA7SZ_4F6IgOOHQ":{"text":"It was a cold and rainy night. We had just finished a nighttime walking tour of the French","useful":0,"cool":0},"577sv8APJ6r0JgH2M8XZ1Q":{"text":"We stopped here for lunch on a nice fall day in New Orleans. I had the fried oysters with ","useful":1,"cool":0},"M7xTXSZS1JvPM8THJtuBfA":{"text":"Salt, salt, and more salt. Our waitress reeked of cannibis, but staff was nonetheless fair","useful":0,"cool":0},"5amEP8OAMAX8mjhXa-PZFA":{"text":"Waited at host stand for about 8 minutes, before someone walked over lazily. I wasn't give","useful":0,"cool":0},"htxv4DwfDGO-lwzYZcTIgg":{"text":"The Rockefeller oysters and the mix shrimp and catfish po'boys were delicious!!! That is a","useful":0,"cool":0},"CisBi35v5_cqUgeRRqsuog":{"text":"Oh. My. God. I got the Mardi Gras pasta and it was the best thing I ate in my time here in","useful":0,"cool":0},"Jyx_FKovTZeLzcJtcCnGmg":{"text":"We found this little place while walking around New Orleans.\n\nThe chargrilled oysters are ","useful":0,"cool":0},"-6fWsWAYwvJ_CRugqimznQ":{"text":"This food is subpar. The Alfredo pasta tastes like it came out of the jar. The onion rings","useful":0,"cool":0},"eqnUx2V_evSXK7n5gwGj4g":{"text":"DO NOT ORDER DRINKS HERE. \n\nThis place ruined my sister's experience here in New Orleans. ","useful":0,"cool":0},"ducfVCNGIOoRdkjqyIVOUw":{"text":"The wait time for our food was amazingly long.   The waitress was quick to take the order ","useful":0,"cool":0},"VEinrtSryQZVtEKWdqH0Ug":{"text":"Maybe oysters are their specialty because breakfast is not! We waited 45 minutes for an in","useful":1,"cool":0},"W_-ZKULRDSFNALLc_jVwWw":{"text":"This place is solid! Nothing fancy but the food is great. The oysters are some of the best","useful":0,"cool":0},"8YUXUb0oqioy2dsF2aH1Ew":{"text":"The staff is amazing, that's the only reason I gave two stars. The chargrilled oysters wer","useful":0,"cool":0},"eZmcotdukbN_m8Cwr0tusA":{"text":"Very nice server and great location! However, an omelet and grits took over an hour - appa","useful":0,"cool":0},"iGOqZE7SAZx17PkkAVf8Fw":{"text":"Food was overpriced, they ran out of mostly everything. Definitely was not worth the time ","useful":0,"cool":0},"8tXCExJKatRD0eJulN_rCw":{"text":"This was a horrible experience. We waited 1 hour for our food to come out for it to be col","useful":0,"cool":0},"wcmmkyMWx6LQj_0AG3HzHg":{"text":"Two simple suggestions: Voodoo Brew and Gumbolaya.\n\nVoodoo Brew: sneaks up on you and bett","useful":0,"cool":0},"gLL7Zy_cLyOZPUxq6t0-bA":{"text":"Pretty sure the only reason this place survives is because of its location. We sat down an","useful":0,"cool":0},"LVOpDNNwKklcfOQP8cgzbA":{"text":"We were seated quickly upon arrival and our drink order was taken. We ordered a round of r","useful":0,"cool":0},"N4z0UJ8ysWN04noIXhFCSQ":{"text":"This place is a COMPLETE FAIL!!!! I had not heard good things about this place from more t","useful":0,"cool":0},"5bS5Ewdh7lUVhJUC0HGXkg":{"text":"The absolute worst experience I have ever had in a restaurant. The raw oysters served were","useful":0,"cool":0},"DBusUoW0GJXeu5js5qu83w":{"text":"Any review that is under 4 stars is full of garbage. Jennifer was an excellent bar tender.","useful":0,"cool":0},"cc3gup85dFRH1YI0FRXMpA":{"text":"Me and my friends were just looking for a nice place to catch a quick dinner and drinks an","useful":0,"cool":0},"hw49vltZKGTLjmWEWuMvsQ":{"text":"Just stopped in for oyster shooters & a Hurricane. Yummmmyyyyyyy! Friendly staff & bartend","useful":0,"cool":0},"uwZ8pAvUzpFfSxzf_Uv4kw":{"text":"Service was fine. Food price was okay but it was underwhelming and awful. The drinks were ","useful":0,"cool":0},"46jdE-R6S9GfANpThBD6_g":{"text":"Yes my favorite seafood  gumbo ever so far it was my first place to experience a seafood g","useful":0,"cool":0},"-hDqmpkC8UwRDq59uNq6jw":{"text":"This place was decent but the wait for the food wasn't really worth it. The burger was goo","useful":0,"cool":0},"aOwl7tOpwvAvu1BkBPLzhg":{"text":"Worst experience I've ever had at a restaurant. I wish I would have read the reviews befor","useful":4,"cool":1},"QuoXOVhz4dK2ribrrIuiAg":{"text":"By and large the worst food, and at the same time the most amazing dining experience of my","useful":0,"cool":0},"ONE5N9_-XfCNTiU80sYAQQ":{"text":"If I could give this place zero stars I would.  This is not authentic Cajun cuisine.  It t","useful":0,"cool":0},"-qf2PBKoi04pUM_gvgShvA":{"text":"Epic fail. \nWe were very hungry and desperately searching for food after the Ruby Slipper ","useful":1,"cool":0},"Ll_p66fv9_iHOxUzWhpOyQ":{"text":"The ratings on this place were pretty spot on. I was in between giving it one or two stars","useful":1,"cool":0},"SlkmAESihTLRZAJtVc9aYg":{"text":"TURN BACK NOW.  I cannot fathom how this place keeps its doors open, except for it's locat","useful":0,"cool":0},"VromQ9RLx5F9uXCoHLixVQ":{"text":"Don't waste your time or money. From my understanding, this used to be a place worth visit","useful":1,"cool":0},"qnHF7C55gOE9R_fWN-WFNg":{"text":"Had a fantastic time! Loved the super fresh oysters!","useful":0,"cool":0},"bhll92oPcyy24vKV3TJdpQ":{"text":"The service is well provided by Jennifer. The food is okay - the Jambalaya is okay, howeve","useful":0,"cool":0},"0CLntHIBZsVY8BGMMpK73w":{"text":"Our waiter was amazing and kind.  Food was served promptly. The best char broiled oyster y","useful":1,"cool":1},"r1CGcL1E9o5tfF0OuWGY3w":{"text":"We wandered into this restaurant after strolling through the French Quarter and were reall","useful":0,"cool":0},"OWSzStMnW5hq_5fl7mFgGQ":{"text":"They had huge char grilled oysters that my husband says were very good. And they're the fi","useful":0,"cool":0},"A0xtfjC3XfBQfAII0LgP6g":{"text":"Charcoal oysters were delicious. Drinks were great. Nice casual atmosphere. However, the w","useful":0,"cool":0},"mYcSfqNVZZrfkgzCsPY86Q":{"text":"Outstanding place! It is now one of our go to places when we visit New Orleans!  Beignet F","useful":0,"cool":0},"7Mnve1uysdrWylaJrdEPaA":{"text":"Mediocre and overpriced. Don't waste your time unless you are looking for a location to pe","useful":0,"cool":0},"t6xSJlKufuXkTFUtLH_AKw":{"text":"Excellent food and reasonable priced. Great service. Wonderful window seating. Had breakfa","useful":0,"cool":0},"UqrdNtrqiojKfRxY7wOxrA":{"text":"Stopped in while walking in French Q, not knowing what to expect. \n\nJenna was absolutely p","useful":2,"cool":0},"iPYUFu_YUMjxQCM3MvAQBg":{"text":"We arrived around 11:15 pm the place was busy but most tables were finishing up. There was","useful":0,"cool":0},"0WbwwEAYo6JCMDwPi_hh5Q":{"text":"The food was SPECTACULAR and the location was incredibly close to our hotel, however Calvi","useful":0,"cool":0},"wslXwHgQSCYs-8_wsz4lLw":{"text":"So, we saw the sign for alligator at the corner of Jackson Square and were both hungry and","useful":0,"cool":0},"4i9lfjmfs02oBa5UQh3dNg":{"text":"The breakfast was good. The staff was friendly and helpful. There was no wait which was gr","useful":0,"cool":0},"k3xHk1vkpGE0g5LXo9tdsg":{"text":"Great find! We wondered for awhile passing several restaurants and then came upon The Corn","useful":0,"cool":0},"dA6MWMa_JXNfIMQqEYsCRg":{"text":"The charbroiled oysters are amazing! We've had them all over the country and hands-down th","useful":0,"cool":0},"_VMqDjOiViW1TXNLPKScCQ":{"text":"Went there to get a drink, seafood poor boy, and a cheesburger to go. The food took 20 to ","useful":0,"cool":0},"bO2EeJoZ6cOxGxekzEc6vQ":{"text":"The Corner Oyster House is where it's at! Go on in get you a tables! And enjoy the sights ","useful":1,"cool":0},"X73FvuBF3lTYbIqOQlfLGA":{"text":"Terrible service, cold food, and i especially did not appreciate the waiter lying to me ab","useful":0,"cool":0},"GUwV1GQKtc_obvItetlJrA":{"text":"Oyster Basket was very good. The batter was amazing. The Bayou Omelet and their Bloody Mar","useful":0,"cool":0},"r4IeMSez28Au74qpZjDqmQ":{"text":"I was drawn in by the \"breakfast all day\" and sat before reading reviews. Not sure why it ","useful":0,"cool":0},"Y9_l8U7alXqN-FvIFyLrzw":{"text":"Ended up getting drinks here before hopping on a donkey drawn carriage ride. When we retur","useful":0,"cool":0},"R4BP81SCpnS0i66hapHaUg":{"text":"This is a small ordinary bar on Decatur Street right next to Jackson Square. You  get very","useful":0,"cool":0},"JYMHEdrXQndSUNy4eNMIeA":{"text":"I'm writing at I sit at the table. Slow and horrible service. They told us it will take 45","useful":0,"cool":0},"K9A_2HoxQJnwU0Vjvud3mg":{"text":"Disastrous table service!!!!!! But a decent breakfast with surprisingly good grits. Still,","useful":1,"cool":0},"wwMR6Fsx1gqAAQcH01qo3g":{"text":"The breakfast was good. The staff was friendly and helpful. There was no wait which was gr","useful":0,"cool":0},"3AC39DCWwa4IeS_duy-tMQ":{"text":"Great location. We ordered salads, gumbo, grilled oysters, alligator bites and stuffed mus","useful":0,"cool":0},"xkUWG-KZjHZaJT64xEpygQ":{"text":"I can't speak for the rest of the food, I only tried the oysters, but as far as oysters go","useful":0,"cool":0},"InfM19xA5cABi63fKRCifg":{"text":"Went for brunch, I had Big Easy breakfast, it was okay, croissant was perfect. The grits h","useful":0,"cool":0},"zEKRpL2AwGvlrNCPaC5f3w":{"text":"Stopped in to try their oyster shooters. They were delicious!! Bartender/waitress were ver","useful":0,"cool":0},"Ow9bp5nuNY3LgDgYgcovPg":{"text":"4/2021- walked in & sat down, waited over 15 min while several wait staff looked at us but","useful":0,"cool":0},"tu7ZpkST0amcuW7bf_AzaQ":{"text":"This was a nightmare experience.  If you want Oysters walk another 4 blocks and go to Ed's","useful":1,"cool":0},"N6A4dQxKHRm4o--IOlW1tg":{"text":"I give it 5 stars. Jenna B. was the best.  She didn't judge when we were ordering 2 alcoho","useful":0,"cool":0},"0VX3s56wl4gdeglGkjsB-Q":{"text":"I ordered the New Orleans Sampler. Gumbo, Shrimp Creole, Red Beans , Jambalaya, Rice and b","useful":0,"cool":0},"XtqJBVwDXPrF71ilZ_Pd4w":{"text":"We were visiting NOLA and tried this place. It was horrible! I ordered shrimp creole and c","useful":0,"cool":0},"cc0-w2cr85t0M90b_LqSwQ":{"text":"OK, first off, the food - great.  Good seafood, well prepared.  That's where the good revi","useful":3,"cool":1},"_g35SpokTPTcUMjguclP2Q":{"text":"The food was good, the service was slow (we were there 1 1/2 hours and it was far from a f","useful":1,"cool":1},"SdyZ64Uf8_3Dh0Qzv6sabw":{"text":"TERRIBLE!!! Please stay away from this restaurant if you care about your health and you wa","useful":0,"cool":0},"Jgd73pXFAP5dqt2Bdlp1-w":{"text":"I wouldn't even give this place 1 star. Horrible food. Horrible service. Do not go here. I","useful":0,"cool":0},"Su9LjXyV_QvtChCdcCdByQ":{"text":"We had 5 in our party. One person ordered a chicken po boy sandwich. About 30 minutes afte","useful":0,"cool":0},"nmAkbz9Zx_k5Wowpc8cYag":{"text":"We found ourselves looking for dinner in the heat of June and wandered into this place. Th","useful":0,"cool":0},"k0rIulJfmOOO8hRtyCIQEg":{"text":"Long long long wait, three our order away before he turned it in. Came back 20 min later a","useful":0,"cool":0},"AHsbBVnT2LbT9TF_mNQNNA":{"text":"Beware of this place! My wife and I had to wait almost an hour for our omelette breakfast ","useful":0,"cool":0},"NR81UIRXbdnSyNJCucUPew":{"text":"I came her just to get a drink. I advise you to only drink a beer or a straight/on the roc","useful":1,"cool":0},"yXmnlJlNEcMXLLOQXPA0Uw":{"text":"were offered only breakfast menus. We saw after we ordered that others had dinner menus. I","useful":0,"cool":0},"IXiPeyTiMPB1cGg5LAGVyQ":{"text":"Love , love ,love the Chargrilled Oyster rich with butter, garlic , and  Parmesan cheese .","useful":0,"cool":0},"NLf-JV6q7q0dvjZYXL1bhQ":{"text":"Waited for over half an hour to even see a menus when waitress came over she was yelling a","useful":0,"cool":0},"xN0r26SuuVuR-D5zQ_bTEQ":{"text":"This place go ahead and keep walking ijs....the end...just one thing shrimp nachos with ch","useful":1,"cool":0},"RfdQWM8kls6x1eo6m0nJqQ":{"text":"We walked into the Corner Oyster House and though I'm not a fan of sports bars, we decided","useful":0,"cool":0},"3DPdm5-fOFQeMwVk45qFag":{"text":"The charbroiled oysters were very good - we ordered another 1/2 dozen after the 1st 1/2 do","useful":0,"cool":0},"cEm4Xs_E6hemNzcV94hUaw":{"text":"This place sucks. Our waiter messed up our drink order & the raw oysters looked old. We as","useful":0,"cool":0},"Qx2u6lwpZ14tcqIN-GzpGQ":{"text":"This place sucks ass. They need to fire that manager they have. He is a complete ass hole.","useful":0,"cool":0},"ELdIif4YjnV5_7yZ4D_E_g":{"text":"I never post nor review anything about my own experiences in a business but chose this pla","useful":0,"cool":0},"SVmUB97qMzhlWb1fw0x0oQ":{"text":"SO TERRIBLE. Longest wait of my life. Took an hour to get our food out. Waiter kept messin","useful":0,"cool":0},"HgRTQvYwiU04dCFXXm1fmA":{"text":"I didn't like most of the food, it was mostly bland and forgetful. The beignet fries were ","useful":0,"cool":0},"uig6NAAZhg5BzCeWV6aAvQ":{"text":"Overcooked eggs and bad service. Omelette took a long time (20min) and was very mediocre. ","useful":0,"cool":0},"zTJRTZE1FS1YBeRr47XLHg":{"text":"Don't do it.  Just don't.\n\nThe reviews are real.  This place doesn't have it together and ","useful":16,"cool":5},"6qKZKXLm6m-dpRBG-qoTsg":{"text":"I love this place and the friendliness of the staff!!!!!!!! AWESOME service , food and dri","useful":0,"cool":0},"dB3LDp6GwIWpdu_lYQrPlQ":{"text":"So first off i don't understand why this place has a low rating...this place deserves a 5 ","useful":0,"cool":0},"6O_QrphnlA6hCbAa95uQWA":{"text":"It was tough getting in here. They were so busy or short staffed that no one was acknowled","useful":0,"cool":0},"q5XcjqG9KCAEQP0NOA5UWw":{"text":"My husband and I had visited NOLA. We decided to stop at the corner oyster. When we got th","useful":0,"cool":0},"9Q3iUOY-t3Eu624LdlXFbg":{"text":"dont go to this greasy spoon garbage can restaurant.  the food is not fresh and it is drow","useful":1,"cool":1},"QQTnsYSBXBlrdcrTtU4YYg":{"text":"I wish I took pictures because the food was amazing! This was the first time I tried oyste","useful":0,"cool":0},"8tz12o4e3ou8QZH60AUlNw":{"text":"OMG! First of all, the food was AH-MAZING! But most importantly Jenna was the best waitres","useful":1,"cool":0},"i2lkK9YRTYu0rp9ubBm03Q":{"text":"Prepare to have to wait a little bit. There was a sign explaining that they are short staf","useful":0,"cool":0},"J4tpk9SnfNi7o2mnYfDCDQ":{"text":"After aimlessly walking trying to find somewhere to eat, my husband and I ended up here. W","useful":1,"cool":0},"sGCLE3zIv7G076g7gybXKw":{"text":"Had to come here for the oyster shooters  The girls get them every time we have come down ","useful":2,"cool":2},"4oSK319uJdV_sWZzEN3qow":{"text":"When the majority of reviews are poor, believe them. The food and service were equally bad","useful":2,"cool":0},"hnD9tWzSJl6dSrN5vnfq_A":{"text":"My friends and I JUST walked out of this restaurant 5 mins ago. We ordered our drinks, and","useful":0,"cool":0},"tIC4Y2JGcx1a2tSXeTBGXg":{"text":"This was an experience we managed to avoid just in time. Located at the corner of Jackson ","useful":2,"cool":0},"PYU1oD2KLOx8vYjf8f_OBQ":{"text":"The food was... just food.  It was average but nothing to go out of your way for.  If you ","useful":0,"cool":0},"OeSzbLMxOdjSa3pYDoSRpg":{"text":"After putting our name on a waitlist down the street my Wife and I began to explore the st","useful":0,"cool":0},"CEwvHLMin8GwJIJFa7_Img":{"text":"Stopped by this sport while visiting New Orleans this weekend. We got appetizers which wer","useful":0,"cool":0},"C-nJNU4O1ucbYbBM1gHDzw":{"text":"We stopped in for drinks and snacks for the kids.  The service is slow.  The wait staff is","useful":0,"cool":0},"Nn6vgVhXaB3jrGRQOl5LXg":{"text":"Best gator I've had in Nola.  Tender meats that pears delicious Lee with their homemade ho","useful":0,"cool":0},"wlIzuALFjsHjD3-h_Bu_bg":{"text":"I am so disappointed that of all the places to eat in The Quarter we stopped here. Surpris","useful":4,"cool":0},"-sfllcj0isRSYA1LGAFdyQ":{"text":"Waited for over an hour for food. Waitress didn't check in more than once. One of my raw o","useful":0,"cool":0},"_Zyn-eeBYxitBDk2FFgbYQ":{"text":"I would not recommend this oyster house to my worst enemy. \nFirst of all I waited in line ","useful":1,"cool":0},"5kLI9XQXkJwE0TM7b3jLQQ":{"text":"Arrived in NOLA today and went to grab some food and that's exactly what I got food, just ","useful":0,"cool":0},"NL5nbMo37M-uiicTNNOJQA":{"text":"If you are displaced due to a natural disaster (hurricane Laura) I advise you to not spend","useful":1,"cool":0},"qe7UTKXSu1G0rkS0LzDNgA":{"text":"Waited over an hour for food, despite seeing around a dozen people in the kitchen. Disappo","useful":0,"cool":0},"b0JaehTJw1mrDAaD27GG1g":{"text":"We had the best experience here at corners. Not only is the food fantastic but the service","useful":0,"cool":0},"wf6mSZ_vUENOBmYGZFFosg":{"text":"Don't come here. Just don't. I've been waiting an hour for appetizers. It's not even busy.","useful":1,"cool":0},"x1Ocq6j_WjolFjU-iYDztw":{"text":"The line wasn't long so we thought we'd give it a shot. Seated fairly quickly and orders w","useful":0,"cool":0},"azxZ36yBZDEqDLHyBJAzJA":{"text":"We came in and sat at the bar. Emily was our bartender and she was absolutely fantastic. S","useful":2,"cool":2},"XRn_76lVTs7pNHiZh5WF6Q":{"text":"My service was lovely and the drinks are strong in collectable cups.  I didn't eat,  and m","useful":0,"cool":1},"ZMab5kj7KpQZ3jYp1xTtIQ":{"text":"Terrible service here, they were not busy, I ordered 1 drink and 1 entre. They totally for","useful":0,"cool":0},"Z0a4L7tIgouaKhWjjbJcPQ":{"text":"I stopped here for their oysters, but they were seriously overpriced (market pricing) at $","useful":2,"cool":0},"qeyj-ceOLavCU4gtf8eNeQ":{"text":"Came here for dinner around 9 p.m.  Had a dozen raw oyster, the best oysters I have eaten.","useful":0,"cool":1},"a4HtCcbW3Wj-Sr5SPIAEJw":{"text":"Charbroiled OystersThe best Oysters I've ever had. My wife had been previously, she told m","useful":0,"cool":0},"9e7V-hTL2A5UcZEtYOXeCA":{"text":"Stopped in for a quick bite to eat before the drive back to Dallas. We arrived about 10:45","useful":0,"cool":0},"Z6iALChr6qFf7lNRWCnA_w":{"text":"We were so hungry so we popped in to   Have a bloody and a bite to eat. What a mistake tha","useful":1,"cool":0},"SfX7tpn_4msXbrVb8TJ5ig":{"text":"Dece, Jonathan, and Don were the best!!! They really made our experience memorable and wen","useful":0,"cool":0},"v3UO_nTg3dTyER5c68rCpA":{"text":"Tara was our waitress, she was so sweet and helpful! The food was delicious, it was nice a","useful":0,"cool":0},"hRqu57_twOx5CJYuUwMH6Q":{"text":"I can't rate the food because me, like the  20 people around me, could never get seated. N","useful":0,"cool":0},"0dTbj0PiyKgXAel4-Gu6hg":{"text":"Ate here two days in a row. Very impressed with the staff, super friendly and knowledge ab","useful":0,"cool":0},"tBErxtqgO0tEi4EuVBtvbg":{"text":"Perfect location as it is situated in Jackson Square with street views facing the river. T","useful":1,"cool":1},"IFAWKj6vpjkPCKvDAIGwVw":{"text":"Literally would never recommend this place to anyone. Waited for over 30 mins for someone ","useful":1,"cool":0},"4-sgGSAv2cXM__9bGP5K7Q":{"text":"I have been here before but the service has gone down. We waited an extremely long time ju","useful":4,"cool":4},"qX4JsOL5DhNRDQZfvaxEmA":{"text":"Don't waste your money Chargrilled oysters the worst I've ever had. No free refills, no pi","useful":0,"cool":0},"CUOxkID3uD9wqASUOk-ChQ":{"text":"Had the char grilled oysters, they are not the best oysters in town. That was a lie. Go to","useful":0,"cool":0},"Y87zxmfELS8LQljzuJXtDQ":{"text":"Our first night in New Orleans and we were just looking for dinner. Popped our head in and","useful":0,"cool":0},"2xuuEEQtQF0NsdkPYypxjQ":{"text":"Great service!!! Staff was phenomenal and helpful!! Jenna B. was awesome!! Food was amazin","useful":0,"cool":0},"etuLGqnu2dAQl8rlpUZQMA":{"text":"We were ignored.. drinks were pricy and food was mediocre..Carolyn totally ignored us, but","useful":0,"cool":0},"z3h4q9Owl7H1yWa2KdEq4A":{"text":"I have strolled past this place more times than I can count with my fingers. I never even ","useful":9,"cool":7},"WBpONrAj3a8Vf3xcDUYIaQ":{"text":"I went here for lunch. The service was great and the bartender was wonderful, but the food","useful":0,"cool":0},"eBoQHxcrfCmOPAmr6EDO0g":{"text":"So I stumbled upon this place while shopping for souvenirs. It is obviously an older estab","useful":0,"cool":0},"9GGTs5DOzUOUppBB4riqzQ":{"text":"Stopped in for a snack and a drink early in the evening (7-8PM).  Food took forever to del","useful":0,"cool":0},"l4ukJd0Ay99FaXiEd3pU_A":{"text":"Don't make the mistake of passing this place up due to the yelp ratings. Having traveled a","useful":1,"cool":1},"emnaHRBCL7la_pej0B1aFQ":{"text":"The food was acceptable.   We enjoyed the oyster shooters and the catfish decatur.  But th","useful":1,"cool":0},"w50_75dYPaqu0B9kukYBfQ":{"text":"By far the very worst meal we had our most recent trip to New Orleans. We had 2 go-to brea","useful":0,"cool":1},"CACmpeidC39ZyTmVLac3dQ":{"text":"Horrible food, poor service. I almost feel ashamed to tell anyone we spent nearly $150 her","useful":0,"cool":0},"9f2tbW8Xm685S0v-cDoufw":{"text":"Ate here two days in a row. Very impressed with the staff, super friendly and knowledge ab","useful":1,"cool":1},"aI6xmuOAKza-a_cTpzAhxg":{"text":"You have to have the charbroiled oysters and the pasta! Everything was great including the","useful":0,"cool":0},"DoZbLOkInm7_V2v_Li9D0Q":{"text":"Great food and service. Would recommend if In New Orleans. Jambalaya was amazing and my da","useful":0,"cool":0},"qaVl4FgRm3jmhc81t_JdLA":{"text":"Not even a glass of water?\nWent here on Monday for brunch. Sign says' 'we are short staffe","useful":1,"cool":0},"pFQW7sKpZk9qoCiqf1VWqg":{"text":"Good Bloody Mary - stopped for dinner since we did not make reservations and could not fin","useful":0,"cool":0},"3gnubsJ87hTLMJOdBlgT5w":{"text":"We understand and didn't know they stopped serving at 8:30 p.m., but for the love of god d","useful":0,"cool":0},"nHhS4Pjwxm2vuutV4nQffQ":{"text":"We stopped into Corner Oyster House today for a little breakfast before heading out for a ","useful":0,"cool":0},"vAJIXpGJWP-QAHY5vAYw-g":{"text":"This place was a disappointment from the start. Our server was slow to greet us, slow to t","useful":2,"cool":1},"XZtnbmzRhdG0JaeCPmFZpQ":{"text":"NO NO NO NO NO. My wife and I went there late to get some food take out and tried to order","useful":1,"cool":0},"gt5ZhhzcFV2UrQHxduxK5A":{"text":"I came in around 2:30pm on a Saturday and ordered the shrimp po-boy and their chargrilled ","useful":0,"cool":0},"fg7M_9HLCHNLvPKFUTRofw":{"text":"This is a good place to go to if you are hungry and don't want to wait. Our waitress was v","useful":1,"cool":0},"iAzo3PeUHJfuQ2wiulb9cw":{"text":"We came here in the evening on a Saturday and got stuck with the bottom of the barrel food","useful":0,"cool":0},"fSH-XqpZDujyA6vGyDxf-w":{"text":"Sports bar, ok for fried food, not good for other cuisine. The house salad for $7.00 was a","useful":0,"cool":0},"a9IKLrg4POfmmU4mhlC3sw":{"text":"I truly do not understand the poor Yelp reviews here. We have been here numerous times and","useful":1,"cool":0},"xFvqgZQx0WBlnaE7eli-VA":{"text":"So I read the reviews while I was in here and immediately got turned off but listen, I'm f","useful":1,"cool":1},"4onvtGhoyW_qDbrNge9X7w":{"text":"This place is great! You have to try the alligator bite. First time I ever had them grille","useful":0,"cool":0},"CUYIxSPR_t5g9hf28q2ErA":{"text":"A don't miss.  Ask for Jenna. She will take care of u!\nCan't go wrong with chargrilled oys","useful":1,"cool":0},"eFkxFXwlhP7OALZgoGOCzQ":{"text":"This place is a ripoff we ask for 2 hurricanes menus states $8.00 each we got charged $18.","useful":0,"cool":0},"GGMLIiq7anQZ-MKMZFlEMQ":{"text":"I recently visited this establishment with my family and a few friends was skeptical becau","useful":0,"cool":0},"d0Zb6Bi5ZyEG3YPPaB5ktg":{"text":"Well, we stopped because they served breakfast and my grandchildren are fussy eaters. \n\nTh","useful":3,"cool":1},"NKTWu-r7x9DHUnfbfLmkow":{"text":"Love the charbroiled Oysters ,buttery ,garlicy with great spice perfect with a Nola Blonde","useful":0,"cool":0},"Z_2EW0ggaCSSa_q43O2hiA":{"text":"The Steamboat drink (discontinued but they'll make it if you ask) is delicious. The two la","useful":0,"cool":0},"SAmP7Gv6tPyGFm7kG6DG5g":{"text":"I don't wish I could leave zero stars, I wish they could be hit by lightning!\nAvoid, Avoid","useful":1,"cool":0},"0X2QtHJqaDNSPR4jBb4uNQ":{"text":"We ordered Seafood GumboRed Beans and Rice, the place was really busy and cosy. The food i","useful":0,"cool":0},"yGdejurDI8XSlIkKYOkr0w":{"text":"First timers here at Corner Oyster House. We were there a little before opening so we took","useful":1,"cool":0},"VejFon0XtdBmQ179FLfhOQ":{"text":"Piss poor. 10 minutes to get even acknowledged. 20 minutes to even get drinks. Pathetic. S","useful":0,"cool":0},"L5D2rAFcO6Ust85Mot4arw":{"text":"I love this place. It makes the best fried oysters in the French quarter. It also makes th","useful":0,"cool":0},"L9LgX1TwZiFtHMELKPqDfQ":{"text":"Terrible. Male bartender was rude and forgot our order of wings. After 35 minutes I told h","useful":4,"cool":0},"rGC8DIvWt5nt6nWgZaB1Ig":{"text":"One of my favorite places because it's relatively fast. I always get the beignet fries bec","useful":0,"cool":0},"h4h0-qCBBzQ9EtPpRPDWsg":{"text":"There was so much RIGHT about our meal at Corner Oyster House, but a few hiccups keep it f","useful":2,"cool":2},"5s7vdwq1o0K_9QrK_Qo3jg":{"text":"I was in New Orleans and hungry and decided to stop somewhere to eat. I should have known ","useful":3,"cool":0},"L2r5PYXB0_UvpRVAqaKUpg":{"text":"Good location in French quarter, casual down home ambiance.  Staff is nice but service is ","useful":0,"cool":0},"X8GQ1pcGOCoW_cpwNd18cA":{"text":"TOURIST TRAP: extraordinaire, no locals eat at this faux-authentic hash house;\nLOCATION: l","useful":3,"cool":1},"IWt5oMCbg4-cx1ryp3EH0w":{"text":"On my trip to New Orleans I came here twice. The first time the service took a while but t","useful":0,"cool":1},"frgEufAO-PUsIAZ-PPABHQ":{"text":"Expensive hurricane that had no alcohol whatsoever. Sat at the bar, was ignored by the rud","useful":1,"cool":0}}