{"ZrRZFuAEKRfnUP5zQ_07VQ":{"text":"Fantastic location! It's on the corner of bourbon and canal.\n3-3.5 ish \ndrawbacks & tips \n","useful":1,"cool":0},"SW4B9HNatIvKlS5Tj8M_Pg":{"text":"super close to all the action... friendly knowledgeable staff. nice room. Will definitely ","useful":0,"cool":0},"7gVOeh2pBR46PWoF6E1utA":{"text":"Oh honey. No. What is this? What's going on here?! Do not stay anywhere near burbon, let a","useful":0,"cool":0},"5cPj_l2sGMI_D0rfczxoeQ":{"text":"Great location! Room kinda small but very nice and clean. We could hear nothing from bourb","useful":0,"cool":1},"U8cJxV56wRDaPkY4gV9Ytg":{"text":"Stayed here Christmas day 2015 and day after.  The location is great; one door leads out t","useful":0,"cool":0},"wYFmk3EbxqCXXmGTfk_Plw":{"text":"Stayed for 3 nights as part of a bachelor party. The location is great. There's a late nig","useful":2,"cool":0},"3idput1I0awcVG9NoWb49Q":{"text":"Great location. Just at the start of crazy Bourbon Street. We could walk just about anywhe","useful":3,"cool":0},"spqdDMu_xKFM_BLMr4PGYQ":{"text":"A little nervous checking in here after reading some the reviews, but honestly, it was a n","useful":1,"cool":0},"YhHTZ-vshxS9s7BG6dBvKw":{"text":"Great location!! The hotel is on Canal Street, right by bourbon street and the French Quar","useful":12,"cool":11},"3oimDUj5AiYIre0BlkoCdw":{"text":"Overall this hotel is a 3 star! Not bad at all just fell a little short of a 4 star rating","useful":2,"cool":0},"1WM6wk1LptUTBcDv3YUlfA":{"text":"Una terribile esperienza! \nLa hall dell'albergo è l'unica parte dello stesso ben tenuta e ","useful":0,"cool":0},"oH0fESHBoP2aeaP5HjYS8Q":{"text":"Got this hotel last minute (literally a few hours before check-in) for NYE 2013 with a few","useful":0,"cool":0},"1A-dFbRyYd6LumR_4Z5nCA":{"text":"I didn't stay overnight at the Astor, but I did attend a 3-day conference and meetings her","useful":0,"cool":0},"V8hv0CCYq8A6Ncn177avRQ":{"text":"Centrally located and the staff here are wonderful (especially Deanna, who found me a quie","useful":1,"cool":0},"1MemgJaFZQ2a6XzkoeO99Q":{"text":"The lobby is fairly nice and the rooms are comfortable so you wont be staying in a dump bu","useful":0,"cool":0},"0HC-V2LI5T6AtZuFBgQ6Mg":{"text":"Great location.  That's about it.  Went to check in and room was not ready by 4:45.  We we","useful":1,"cool":0},"QrtcmrJmck6ZNkMKiHwDjA":{"text":"This hotel was great. Location was wonderful. One block over and you're on Bourbon Street.","useful":0,"cool":0},"hTAwZgwmET35uZ1kyg3zJw":{"text":"Good news, you're in New Orleans so you won't be spending a lot of time in your room.  Why","useful":1,"cool":1},"Z_H50QkXHhxr6IXOpUPTzw":{"text":"This hotel is OK, not great, not horrible.  The room itself was pretty basic and needed up","useful":0,"cool":0},"U4wLL88wxhNFY_YsKZijqA":{"text":"I would give 0star if I can, but I obviously dont have that option. We got here at 1:15am,","useful":1,"cool":0},"1kCg5lBV1Ah42hPb7jB8HQ":{"text":"You literally could not ask for a better location, if Bourbon Street is where you want to ","useful":3,"cool":1},"b3I-h2aQ9TM6AslsReYarQ":{"text":"Brought a group here last week.  15 people\n\nNice room rate but be careful of their breakfa","useful":4,"cool":0},"CEFgf1zsYoRBBmHbYFRY3w":{"text":"Great central location, on the corner of bourbon street, straddling the central business d","useful":0,"cool":0},"CVizk2wHDSxKMVSrySUocA":{"text":"An older, completely renovated hotel. At great location in French Quarter (Canal Street, o","useful":1,"cool":1},"1u-XmNvBfJMY5GLNPoSCCg":{"text":"The staff is very good here and it seems like a newly renovated hotel but still feels kind","useful":0,"cool":0},"IkhL4URTEXlwnAW-dUqlhg":{"text":"Great value for the money!  Is it a 5 star hotel?  No, but you aren't paying for a 5 star ","useful":1,"cool":0},"rC3N3xKTLwiEf8a8AX3EUw":{"text":"2 stars is for the extreme mice and helpful staff.  We were excited to only have paid $99/","useful":0,"cool":0},"vTCwfMBnFrJiB40X1T8K1Q":{"text":"My boyfriend and I stayed at this hotel for our last night in New Orleans. We both enjoyed","useful":2,"cool":0},"AAH8j8gmZaGKE5wc3p8lvA":{"text":"Classic Elegance, tastefully appointed Hotel on the corner of Canal and Burbon...you could","useful":0,"cool":0},"PPeAA0291TWW4lMDd_eZbA":{"text":"I paid $79 a night for this hotel via group on so my review is based on that price. \n\nFirs","useful":0,"cool":0},"aAdqX36diEpWmmUoTx-Szg":{"text":"Had a great experience. Hotel is nice and clean and our room was ready early so we could c","useful":0,"cool":0},"5YTZzsft6EER_pHXJGasEQ":{"text":"We were in new orleans for my birthday and I chose the plaza thinking it would be an upsca","useful":0,"cool":0},"6WUvAUL87X0XlLkfi6IphA":{"text":"Do not stay here. The bath rooms have mold in them and the workers here are useless.the em","useful":0,"cool":0},"sjceSMvooCYkrvNSNlCC1w":{"text":"I recently stayed here while down in New Orleans for a bachelor party.\n\nThe price for the ","useful":2,"cool":0},"-OZ00dJo2RLZeBsz4rM89A":{"text":"So many, many things went wrong at the start of my trip. So many. Broken door (didn't lock","useful":0,"cool":0},"ciLqRJkSUhmXxULfr8CY1A":{"text":"I read reviews for everything and I was sincerely freaking out about staying here. I was c","useful":2,"cool":1},"CVRxCm1jeiUs0YsP6dFNbg":{"text":"Had a really great experience. Was a little nervous after reading reviews... Room was grea","useful":1,"cool":0},"pzvxWAkhQiLrXexEy-bRKA":{"text":"I just want to say that the staffs here are friendly and helpful, so this review have noth","useful":2,"cool":0},"5e8nnXH_3J8pL89anx49Eg":{"text":"This place is AWFUL. never cleaned our room - after multiple times asking.  Cockroaches in","useful":1,"cool":0},"_HsOaYWz40T-sVm0BKtFFw":{"text":"The Astor Crowne's Location couldn't have been better.  The front of this hotel sits on Ca","useful":0,"cool":0},"HTm44w2qlwmSS_7kWr3zYQ":{"text":"Location, comfort, and well, location!\n\n4 night stay for vacation.  \"Name your own price\" ","useful":4,"cool":0},"36uU_QHLfGi30xTrgH9CEQ":{"text":"Beautiful hotel with a very friendly staff. Our room was newly renovated and the view was ","useful":1,"cool":0},"aefqlNOdARtKfka0ihtLUg":{"text":"Location: wonderful. Street car literally right outside your door to take you to the fairg","useful":0,"cool":0},"TjchAFFm0dpwz25SRCwenw":{"text":"I really thought about this review before I did it. I visit the French quarter often so I ","useful":0,"cool":1},"uD0dnGha9nwqTf2EsoF_Iw":{"text":"I was in New Orleans for a wedding this past weekend and opted to stay at the Astor Crowne","useful":1,"cool":1},"ql7TBoHh8Y9N3jFIiZ26Ag":{"text":"Although this hotel is excellently located, staff and service made our stay less than enjo","useful":2,"cool":0},"Ro73RE5lAvfl00qk821Jow":{"text":"We checked in 9:30pm on a Wednesday night. There were three people in the hotel lobby that","useful":2,"cool":0},"t15WmcWpw0RqKjBP0_x4wg":{"text":"We spent a lot on this hotel and it wasn't the best.\n\nIt was nice enough, but the front de","useful":0,"cool":0},"1BHk7hvXtyg5KssVeNJXLQ":{"text":"I cannot believe the train wreck that is this hotel.  First off, you are a major chain hot","useful":15,"cool":3},"S2bNtADoJGeMX7cLuvBtIA":{"text":"This hotel has a great location for sure. When we arrived it was buzzing, a lot of people ","useful":3,"cool":1},"iOxbUdDM4sBpEygAOCFn5w":{"text":"This is a pending review: \n\nI, unfortunately read these reviews after booking through Hotw","useful":1,"cool":0},"n4ZLqTqeRBGYo9YU_qYxqQ":{"text":"Great location,  amazing hotel suite spacious and very nice decor and service on point the","useful":0,"cool":0},"1-DBRprkiIwdTgiYCNNKrg":{"text":"So....\n\nPros:\n\n- great location.\n- friendly staff.\n- great restaurant downstairs.\n- pretty","useful":0,"cool":0},"BmeJQmJXVN0lDgK_j4GBWQ":{"text":"The Crowne Plaza in New Orleans is a pretty good property, but is always packed. The major","useful":0,"cool":0},"cZ1X5RM5n7DuJjqYS8mg_Q":{"text":"I was here for a convention. It happened to be the same weekend that our group (drinking c","useful":1,"cool":2},"w5MCz9RCHq25MprJBi0uxQ":{"text":"Late Review!\n\nMy husband and I stayed here for our first Mardi Gras. We arrived Friday and","useful":1,"cool":0},"82GhdlAhoPdS_RcBKZPo3A":{"text":"Check in took over and hour . And still can't find reservation. Front desk was unprofessio","useful":0,"cool":0},"wqJU2NcwehjC-9Ef5JYdhg":{"text":"Room is spacious, but beds are very high, hard, and squeaky. Front desk had attitude. Bour","useful":0,"cool":0},"vpy_HyNh4Z7TEsiUGmsV4Q":{"text":"Love this hotel. This is always my go to when I come to visit. Super great location...who ","useful":0,"cool":0},"3q3M1ZbgLmRTdS47h6s7tg":{"text":"Great location, side door opens out onto bourbon street! Kinda like a Monet painting, look","useful":4,"cool":0},"mfngv1ev4fydy_3AcGA4VA":{"text":"Very disappointed. I booked through Groupon a secret 4 star hotel. When I found it was cro","useful":3,"cool":0},"gxChcENKBDVMf1p65TuykQ":{"text":"This hotel is located in the French Quarter and its really close to everything.  It is rig","useful":1,"cool":1},"V8G2ChUJFJrmxqE507S8kw":{"text":"I live in New Orleans and stayed here for one night, just because Priceline had a great ra","useful":0,"cool":0},"H43_S5MYA7-sJ6a6LImCug":{"text":"Found this place on a last minute on a Priceline.com last minute bookings. We booked this ","useful":1,"cool":0},"z_Cc_2lK4nT4wK6XiIqGiw":{"text":"Staff is very kind and friendly, Great location and clean bathrooms. I have stayed at leas","useful":0,"cool":0},"YhevugA1huNh9x74UpuIYw":{"text":"Shithole, told us we couldn't smoke on the balcony, so a homeless person spilled our drink","useful":2,"cool":0},"GPY1gZGbe90r-QOkO0JICg":{"text":"The wife and I celebrated our tenth anniversary and chose New Orleans to drink and eat our","useful":1,"cool":0},"dzhQnFkc_ZnErQr5-P4row":{"text":"Nice hotel, nice room, great location. Staff definitely needs some work and attitude adjus","useful":0,"cool":0},"Nh87H7cVB2LgZWc0obS5dw":{"text":"Bumped up to 4 stars for customer service, historic old south building, beds and location.","useful":0,"cool":0},"z_LxAYsPGhbczd3s1TCglw":{"text":"The hotel was clean and is in a great location. The customer service by the employees were","useful":0,"cool":0},"0nIwCNidA1KYV1Uv8uljlw":{"text":"Do Not park the valet! They use the parking garage in the back. These assholes don't know ","useful":0,"cool":0},"urby3fgl8fpvedEZJZ92aQ":{"text":"3 stars for a great location. Fast service when things need to be fixed. \nIssue #1:Toilet ","useful":1,"cool":0},"j_6I4MWwHUiErIjaoyYfaQ":{"text":"Stayed at this hotel for Essence Festival 2015.  It was one of 4 hotels to choose from the","useful":7,"cool":0},"DxhmPHmTLO2hNPSCQFpiOA":{"text":"I attended a govt. funded event and my service at the front desk was ridiculously rude and","useful":0,"cool":0},"mB2037mESoBEU8GTGkSnYA":{"text":"Loved my stay in this hotel. Very centric and very elegant. The staff was nice and the roo","useful":0,"cool":0},"saQdDlbC1Nu_TMn4ZpJM_A":{"text":"I was here for a week and prior to my arrival I read the negative reviews and was terrifie","useful":0,"cool":0},"XFEJKjkkDGtVBzvEJeY2aA":{"text":"We arrived here for two nights the hotel was clean the parking issue is what set me off it","useful":1,"cool":0},"v9HzTH_0qQKHhv3G4IbPFg":{"text":"Not a good check in experience at all 30 people in line to check in 3 people working the d","useful":0,"cool":0},"dKBycRezv6ocSCOWKZfEdg":{"text":"I wish there was something positive to say. The only word of caution I would give is that ","useful":1,"cool":0},"_o_SXz1OUBx7gJ8WAnFuEg":{"text":"Spent three nights here for a conference.  As a conference hotel, it worked well.  It pass","useful":0,"cool":0},"Qn9eU4mPlmuEq68ioznPwg":{"text":"Oh NOLA, sweet NOLA!  The hubs and I escaped to NOLA for our honeymoon because my original","useful":5,"cool":6},"hqO9U9-XqFsAI6-wPztCzQ":{"text":"I booked my room in advanced; however, my room was not ready and the hotel was sold out. T","useful":0,"cool":0},"HpxPEy-g-zCKAqXNmaNSPA":{"text":"A room with a double bed. It's spacious. Has a huge flatscreen tv...table with desk, and a","useful":1,"cool":1},"PVpU-kcl5P-US_BzadSyjQ":{"text":"Poor service- old and dirty rooms\nFront desk staff who are rude and unhelpful-  \nI made a ","useful":1,"cool":0},"7XseLxhaR0c64sfuKeyiLQ":{"text":"Great hotel if you're looking to stay near French Quarter. It's literally at the edge of F","useful":2,"cool":2},"Wr-IY9ta385Ga8ojcnkE8A":{"text":"I don't know why I waited so long to draft this review, I was really pleased with this pla","useful":0,"cool":0},"iO2aaohx-FMYEFwNukGBtA":{"text":"Service: The staff at the desk were so freaking rude. There were two people at the check-i","useful":0,"cool":0},"lypqHDRoQkxeiJ7okH6R8w":{"text":"The location is perfect if you want to be right by the French Quarter.\nThe hotel was well ","useful":0,"cool":0},"u_sxtU_vIaAGQehMeY1STg":{"text":"If I could give this zero stars I would. We came down with a large group for a conference ","useful":0,"cool":0},"vA6oyiO55bG9NabgndOIeg":{"text":"Decent hotel in the heart of the city. The bathroom does lack ventilation so it gets steam","useful":0,"cool":0},"KxLEmmRtDTQ0ZUOtZZsKvg":{"text":"Initially booked 8/15-17 but extended our stay an extra night. My dad referred the Astor b","useful":1,"cool":0},"hlnuI0sjz9kX7Oh2mRle_w":{"text":"We arrived on November 20th 2014. That evening we noticed that the safe didn't work. Appea","useful":1,"cool":0},"hpV2oHUG_Xbdxc8JW5E82w":{"text":"No comprehension of customer service. Three separate attendants were openly rude to me bef","useful":0,"cool":0},"-M6rj5KCZQTD8Ah5p9gO7w":{"text":"This was my first stay at this hotel, and it was a very pleasant one.  The hotel is quite ","useful":0,"cool":0},"cb0FHWeN7CGzEpOq7qfLTw":{"text":"My first time staying here and definitely not my last. This hotel is in the perfect locati","useful":0,"cool":0},"Yxb8YI9VUPuqCiwOHk64mA":{"text":"To every yelper this place is truly garbage!!!!\n\nI only save my garbage descriptions to re","useful":8,"cool":0},"e1xgArPbrkvFYg5cUCzFZQ":{"text":"Conclusion- stolen Rolex, IHG Customer Support social and other channels left me to fend f","useful":5,"cool":0},"S8m9HJeW_Cf3hpX4ijN61g":{"text":"Horrified to have to jam a towel under my 9th floor Hotel room door at the ASTOR CROWN PLA","useful":4,"cool":0},"xh3mqTJsNICtacN_KdsP9g":{"text":"Very courteous staff very elegant lobby area spacious elevators and rooms. Very clean, bed","useful":1,"cool":0},"LFzQgrMzdLU_yi1ERB2cLg":{"text":"I've stayed here twice.  Knowing better, I booked rooms and asked not to face Canal or Bou","useful":1,"cool":0},"sVSBjaIRA-titDz6j5OGOg":{"text":"My wife and I have stayed at this hotel before and never had an issue.   Hotel is in the p","useful":0,"cool":0},"U5TdtW1IdxpftmhQeVmtlA":{"text":"We were disappointed with this hotel from the minute we arrived until the minute we left. ","useful":0,"cool":0},"xMe2CafPafnhuaBluZcO1Q":{"text":"Stayed here as part of a wedding, and my short & sweet answer is that it's a nice hotel, b","useful":1,"cool":0},"Ty3zBbfGFaGz9R6WmxNOXg":{"text":"So far so good ...they're done renovations. My biggest issue is check in. The person that ","useful":2,"cool":0},"MK7B8-TZZBk03hVaaa3k_g":{"text":"Initially this hotel seemed very nice. The rooms are spacious and about what you would exp","useful":1,"cool":0},"xC3NKpsmDdjWYMUgYR__ng":{"text":"Excellent rooms, comfy beds & pillows, helpful doormen and a great location. The rates wer","useful":0,"cool":0},"uenNZgsACLFr7vr6bsgsOQ":{"text":"On Friday 27, 2017 at 1 PM I attempted to check into our hotel the Crown Plaza Astor. We w","useful":0,"cool":0},"TLlGhrREzJj8EoKe5UXktA":{"text":"I booked this hotel for a work trip and didn't read the Yelp reviews beforehand. If I had,","useful":0,"cool":0},"uo7mbEAqpMuKiIMTkzhpQQ":{"text":"When we checked in, there was a blackout (so we couldn't actually check in) but they let u","useful":0,"cool":0},"0LFSv0sQOvHrtF5WdtjDwQ":{"text":"So I booked this before getting into the weeds of reviews, which i don't think I would've ","useful":0,"cool":0},"cfMfD8ZW6MqBa00R53nNrA":{"text":"Very convenient location. Room in older section facing into light well lacked ambience but","useful":0,"cool":0},"6060yiKsy8ZjGYXw3nrJ7w":{"text":"You get what you pay for! Our hotel room was 74° for two days until maintenance came up an","useful":2,"cool":0},"9Uw4Vyyg4p8vqwwRWoozIQ":{"text":"Checked into the hotel,  no hello or anything from the desk clerk, no acknowledgement of m","useful":0,"cool":0},"JpwK1dx-QZ1RPTFFPlmjCw":{"text":"I booked this hotel via a Living Social deal before checking the reviews.  I was quite ner","useful":1,"cool":0},"y_DQHEoWH_kFoTlyRTv3GA":{"text":"Horrified to have to jam a towel under my 9th floor Hotel room door at the ASTOR CROWN PLA","useful":4,"cool":0},"pKoSshTVEovkN6wNbfvaoA":{"text":"If you don't want to sleep and love partying, then this is the place for you! Stayed two n","useful":0,"cool":0},"7XHusmdVdJAtVDKKvYoIYA":{"text":"Pros: \n- Convenient on Canal Street, close proximity to Bourbon Street and Jackson Square\n","useful":2,"cool":0},"lsv8PW6gGDjZZ8RPJvkHkw":{"text":"There was a ~60 person line just to check in the hotel. Since we pre- paid we had no optio","useful":0,"cool":0},"Vc6G_JCXS-HiwfIE6Pb34w":{"text":"I was pleasantly surprised with this hotel. I took a chance and did the name your own pric","useful":3,"cool":0},"wDLuL2K1b8DR39lYK8a7cg":{"text":"It is important to realize what this place is, and what it is not. What it is is a clean h","useful":0,"cool":0},"3EnZGx_WjB5KRHqocAFjAg":{"text":"I booked this hotel through priceline.com. I tried to cancel the reservation to book a dif","useful":0,"cool":0},"Vi2gDSIjKgAD75bN8sWeBA":{"text":"I found the hotel to be clean and the staff very friendly. My room was very very quiet and","useful":0,"cool":0},"lOjnJBjhRFC7RRzh2w82OA":{"text":"As soon as you entered the room, it has a mildew smell. Then last night Humm...HUmmm....{{","useful":0,"cool":0},"BkyewZGHItKygV1xGK_AkA":{"text":"My wife and I were wrapping up our vacation with a few days in NOLA. I picked this locatio","useful":1,"cool":1},"loIkkyfUhXpGfOxuAudYwg":{"text":"Beware ye hotel guests -- Here be Bedbugs! Check under your mattress for tiny bloodstains ","useful":4,"cool":0},"weSbAiBVm2KReWGZ4GjJsA":{"text":"Sure, book me in an executive club level floor, but then tell me at check-in that the club","useful":3,"cool":2},"4TD6Ac85RElPXrF_sIuLZQ":{"text":"To be kind, I acknowledge that the hotel has recently changed ownership and is clearly in ","useful":0,"cool":0},"JtpKPoXLVxVA13rY704tuQ":{"text":"They lost my car in valet parking. It took 2 hours to locate the lost car . The lack of ef","useful":2,"cool":0},"6Vzbaq11FQcrCzoXeTmbNQ":{"text":"I did not stay here but we needed some food quickly before going to our convention and the","useful":1,"cool":0},"1QFeer_2BcP6-g-82NjKPA":{"text":"The wife and I usually take a trip to New Orleans at least once or twice a year, and usual","useful":0,"cool":0},"CiCJWI9mm5P9O-uVAJ8jIw":{"text":"Location is great however if you like a hard mattress or pillows that aren't broken in sta","useful":2,"cool":0},"KYZ6m948Q0IRVX5g9B4cLg":{"text":"So much potential but a bit of a letdown.  Astor Crown Plaza is located at the end of Bour","useful":1,"cool":1},"xO_eLRDhy7U4PyPHLAesBg":{"text":"I wasn't expecting such a great room and such great service from the staff at the Astor Cr","useful":0,"cool":0},"OWYBtkttxbFZMjB3WLDVIQ":{"text":"Best price hotel for staying in a good hotel on Bourbon St. It's much bigger than it looks","useful":0,"cool":0},"qrIfIgBY2UHBBHFm6Z6_TQ":{"text":"Every year my fraternity does our formal dinner in NOLA and this is where we stay. The pla","useful":2,"cool":0},"pDz0UpP3dMBJNX87IxUWVg":{"text":"This was listed as a 4 star hotel and it really was not.  The location was good, on Canal ","useful":5,"cool":0},"_VOysunEvW-Gs375lBOtgg":{"text":"this place needs the hotel makeover guy.  It has so much potential but the place is real d","useful":0,"cool":0},"icx-CzSGDGUktFHxEdQFXA":{"text":"There were mice in my room. I stayed here in a king suite for 3 nights and on the second n","useful":0,"cool":0},"QY5J86PrKZNKGi7vdCW29g":{"text":"Less than I expected for a Crowne Plaza. I understand that the building is old but the roo","useful":4,"cool":0},"joSPTClId1Kro0TbiaWryw":{"text":"So I get what I think is a pretty good deal on priceline for $70. $90 with taxes. The room","useful":0,"cool":0},"EN_RteaJFB9jIDdHp793sg":{"text":"Like others have written it's an OK hotel with a great location! A lot needs to be done to","useful":0,"cool":0},"swcPvKU0cceBweXfIu0XBA":{"text":"The good:\nRight on Canal Street near/in the French Quarter\nComfy, marshmallow-ey beds\nSupe","useful":6,"cool":2},"tUHu-AJ7qzJGderPfFHRAA":{"text":"So coming from LA to NOLA for the first time, I wasn't sure what to expect. I was greeted ","useful":0,"cool":0},"gOn7O5Z4BSzpJ05sCN3dTA":{"text":"The location of this hotel is wonderful however, that is the only positive comment that ca","useful":2,"cool":0},"q67V4ATqW5v3jCy3nwAKAA":{"text":"It is ok, for a place to crash after a day enjoying all that New Orleans has to offer.  Be","useful":0,"cool":0},"SbMP3A87jaHrkj27wPxpJQ":{"text":"Pool is unavailable at this time and hotel does not make guest aware on site or when check","useful":1,"cool":0},"GBAfXZZqWrTI36SEeqqTng":{"text":"Sitting in my room stewing at 3am. Booked through hotels.com, $250 a night. Our room is ti","useful":1,"cool":0},"2HI2h2kPxjytxYOwcoAuHQ":{"text":"Stayed from May 29-June 1 and experienced numerous problems, primarily the lack of hot wat","useful":0,"cool":0},"3oQDnO241cbN-k-J0GfO0g":{"text":"Good for boozers and losers. This place was not worth the hype for me, or the price. The v","useful":0,"cool":0},"xJkLIe9Vf40RO68W09fywg":{"text":"Average to less than mediocre amenities are what propel this rating to a two.  Uncleaned b","useful":0,"cool":0},"dTEUdrhCs85gdimPGRTjqg":{"text":"This was a great place to stay.  Everyone was very friendly and helpful.  The Valet person","useful":0,"cool":0},"GszN2B1T9zfIK3Gj-nkCpA":{"text":"Stayed here for a conference; there were mixed reviews, and one of my co-workers actually ","useful":5,"cool":0},"1vEtq4TCmoVdzpmsVGdQ9Q":{"text":"Sure, it smells like puke and rancid garbage right outside the door, but that's on the loc","useful":5,"cool":2},"uTjT9PLK6_KDwQOkdyvZlw":{"text":"What can I say about this Crowne Plaza? Frankly, a lot. Both the good and the bad. Why? Be","useful":0,"cool":0},"0X-wRp-8QAz3IcDyTnblmA":{"text":"This hotel is right at the corner of Canal and Bourbon street which is perfect! The hotel ","useful":1,"cool":0},"vKAcbOPYTOK5Zg1mlkE8Hw":{"text":"So maybe it was the location of our room but it was extremely noisy and every time someone","useful":0,"cool":0},"vHYEBA62vEFYwtqH20O3vQ":{"text":"Not impressed, especially considering this is a \"four star\" hotel. Where to start? Staff w","useful":3,"cool":0},"ULNYY7k1LLQehuKtLg9dcQ":{"text":"Stayed here for 2 nights 3 days end of August. We arrived around 12 pm and was able to che","useful":0,"cool":0},"nBT7hGi4BKIGqhvEygioJg":{"text":"Stayed here with my work company for a weekend so the rates and amenities given to us mayb","useful":0,"cool":0},"1WHMBsNq5nI-OF_oKGlYEw":{"text":"Dirty room? Check.  Noisy? Check. Rude staff? Check.  Soft water? Check.  Terrible water p","useful":2,"cool":1},"X0FjDdAjQuTz4I1nlSqEtQ":{"text":"The hotel is very nice overall.  The bellmen and car attendants are amazing however gave 3","useful":0,"cool":0},"S1UCNOMN4svflj2wqaJfJg":{"text":"Don't stay here. There are so many other and nicer places to stay. The reception desk is s","useful":1,"cool":0},"IdFYbj0yAbXnN3AWw09Dsg":{"text":"I wasn't a fan.  Bourbon Street is definitely not for me, and I ended up here because of a","useful":0,"cool":0},"AoEG5oZSHc2rDcMZYBlQ0w":{"text":"Great customer service. Kind people. Beds were horrible. Our king bed had a broken spring ","useful":0,"cool":0},"RvqZo6mAN1fv1AiKi3ST6A":{"text":"Room 1205 on 5/9/16\n\nThank you for such a great experience for our one night in town for m","useful":0,"cool":0},"-PUfwKchUjfSduHNuDnudw":{"text":"Trying my best to only speak positively about things, no matter what. Nothing is coming to","useful":0,"cool":0},"rztXgyjrA7zBp0awokSe9w":{"text":"Every time I come down to New Orleans I always stay at this hotel just for the simple fact","useful":0,"cool":0},"iZd4OUCU8XtY3gg6Xlyjag":{"text":"Not a high end hotel. The Valet service is awful and expensive. It took me 50 minutes for ","useful":0,"cool":0},"J5emf3QE4uJOk6K1SdrSuA":{"text":"This place really didn't match the price I paid for my room in terms of amenities or any e","useful":0,"cool":0},"n1r4HPQQq27ZpEK4JIpcHQ":{"text":"Insane expensive parking situation, but a beautiful hotel and a great room. We've booked o","useful":1,"cool":0},"-R2vkbsOy_kfJsn3hxMVSA":{"text":"This hotel looks really awesome from the outside and the lobby but our room was so small i","useful":1,"cool":0},"bJJxBGODatiynEPOvNEirA":{"text":"First of all, there is a recently renovated part of the hotel (YAY!!) And an as of yet unr","useful":1,"cool":0},"2vs8m43Ir0RuDV195qRISA":{"text":"I didn't stay here, but a friend did and I visited the room. Not much to brag about here. ","useful":0,"cool":0},"gshT6hR7vcNulyhgEkeh4A":{"text":"Recommend staying anywhere besides here. Stayed here for a bachelorette party this weekend","useful":6,"cool":0},"8DUpKYpMw24VOpgaCGyT1A":{"text":"The staff is extremely rude and unprofessional. The front desk staff were gossiping about ","useful":0,"cool":0},"b4GIoYjAYgb7YrzySBH-Xw":{"text":"Per your direction, I contacted the email address that was supplied my review, and they ne","useful":0,"cool":0},"Z0JTRFt-ZyHLvw3_vrjigw":{"text":"This is my 2nd visit at this hotel. The first visit was better. I wish they had a microwav","useful":0,"cool":0},"E1W4nv_FLTZnUWf8ujJjqQ":{"text":"We stayed here a few weeks for nothing more than a girls trip. I booked in advance and my ","useful":1,"cool":0},"OamC3P5KUhA1j_swPZXwGg":{"text":"DO NOT STAY HERE. this place stole money from me. I had to pay 60odd USD Per night on top ","useful":2,"cool":0},"MAN-JNAOTQgq1wBvcwN_bQ":{"text":"For those who enjoy partying it up on Bourbon Street, the location of this hotel alone war","useful":0,"cool":0},"6rLXINbObAV5BvouMv04SQ":{"text":"Very comfortable hotel. I felt we got a lot for the price. The best and worst thing about ","useful":0,"cool":0},"kM88qtAPz2HoYvuC5O44Qw":{"text":"My husband and I stayed here for two nights right after getting married in January 2011...","useful":1,"cool":0},"j6kfS4u5hzLzI2zoeHW80Q":{"text":"Unfortunately, my stay at the Astor crowne plaza was not at all what I would expect from a","useful":1,"cool":0},"xPpe7WOaC1On4-8zFdurYA":{"text":"Spoiler alert: rodents \n\nThis is my last night staying here. Stayed here all week and will","useful":0,"cool":0},"Dcwr6yZZp6DClV2bg-Mz6Q":{"text":"I'll start with the best and that's courtesy and friendly service from our check-in upon a","useful":0,"cool":0},"ZBZp2ohPx1UGOT6b9KEsJw":{"text":"This is one of the worst hotels I have ever stayed at. People at the front desk seemed nic","useful":0,"cool":0},"FHrRpIbEJKX2mqRsXehh0Q":{"text":"When we arrived at the hotel room on Saturday, the room smelled moldy. We turned a blind e","useful":0,"cool":0},"WGez8jF16RsLLdiQet1DnA":{"text":"We booked this hotel because it was advertised as quiet and it was NOT. The ground floor i","useful":2,"cool":0},"b7dND_8H94fyI5IbgC6quA":{"text":"I follow 4/5star review booked trip stay this hotel. As soon as arrive hotel main counter ","useful":0,"cool":0},"PFJTRIDaAvW-zXcjr3rGXA":{"text":"I would love to give this location 5 stars, but I can't. Location is the sole reason for t","useful":4,"cool":2},"MtZB09tTBPPTpAhuhRTbMQ":{"text":"I'm sorry to give such a low rating, but this hotel truly does not live up to its 4-4.5 st","useful":1,"cool":0},"Q2WHplrAMEzGO1HJonPhpQ":{"text":"Astor Hotel\n\nMy wife and I stayed here for 3 nights prior to a Mississippi River Cruise. W","useful":0,"cool":0},"dTwvvfnodVpE2r0cpL5gUA":{"text":"While the location is fabulous, the hotel itself is less than fabulous.  First of all, the","useful":1,"cool":0},"nQfAIs2DzxbAxIMhrt6tvQ":{"text":"Nice rooms and great location, but I'm pretty sure the maid stole my vodka and they closed","useful":1,"cool":0},"6vKAcnWwKzg4CCZ_wXysoA":{"text":"having never been to N'alands (new orleans) befo', i was super curious about the hotel's l","useful":0,"cool":1},"rKtUlNMuGFPwN3YrOOPVSw":{"text":"Si la habitación da al bourbon street, date por jodido. Gym muy muy normalito para los usa","useful":0,"cool":0},"Kqb1aqnbrEkB_kbGfu1yZw":{"text":"I really enjoyed my stay here. We stayed 4 nights and had no issues. The room was clean an","useful":0,"cool":0},"iHTIB2tKqZ9HUjXR8t2Y1Q":{"text":"3 stars: no fridge or microwave, and we did not see any wifi, very strange that a hotel do","useful":1,"cool":0},"h8rN6Jpj5SewPw6oiZrcGQ":{"text":"Very clean and cool looking hotel! Our stay was too short to get to check out the pool but","useful":0,"cool":0},"j1bvcB9rl5D8SPmwcwNT-A":{"text":"After reading mostly negatively reviews, I was embracing myself in case for a bad experien","useful":7,"cool":1},"xhQs1y8ONpk0hYVjbyiFlA":{"text":"I stayed here during a conference, not as a tourist. I was blocked from entering the hotel","useful":0,"cool":0},"o90OVxFX6ksphgwWBCJaUw":{"text":"Not the newest or nicest hotel in town, but it is one of the best locations!\n\nOn the corne","useful":0,"cool":0},"yaiYkxZPhP7BbS4A_VlaTg":{"text":"Right in the heart of all the action, staff is good, the lobby is nice, and the restaurant","useful":2,"cool":0},"fBo1dwqA6Tctr-JhbyQ7Rg":{"text":"Very nice hotel and the staff are very hospitable! Perks: restaurant is located in the hot","useful":0,"cool":0},"yKKGTvr3sXcjj4QtPGqK6g":{"text":"We were in town for a week to attend a conference held at the hotel. I'll admit, I was a l","useful":0,"cool":0},"QBrNb6m0MigR5SiayxhtOA":{"text":"I recently stayed at this hotel and  will never go back even if its a free stay. The only ","useful":2,"cool":1},"wmGDjHf79uJ-viJfVszcHQ":{"text":"Really the worst.  Do not stay here. \n\nI went with three of my friends for Jazzfest.  We a","useful":17,"cool":0},"oQwWiwPpo4GZ3J9zLFgkrA":{"text":"We definitely enjoyed our stay here. Upon arrival, we were met by Bull (our bellman). He h","useful":0,"cool":0},"ZC6PtXq-KEziPNycWNCMDw":{"text":"Location is the best! Right on bourbon, door opens up to Red Fish Cafe, which has great bu","useful":1,"cool":0},"ogA-Kfm6k8ROfnXSWxQv4w":{"text":"AWESOME location.  Pretty interior.  Very fancy shmancy considering it's at the corner on ","useful":0,"cool":0},"2zfklPJq6W7l37BP112umw":{"text":"Looks good from the outside, but if you're looking for great service, pleasant service sta","useful":4,"cool":0},"T2iZOXnYAKq0vIAO6uuBDA":{"text":"Wish I wrote this sooner.  I stayed here in June and it was the worst stay I've ever had. ","useful":0,"cool":0},"V4Xq2oYcefsD96JetaVPxA":{"text":"This a very pretty hotel, has an old grandeur of history and class throughout. The staff w","useful":4,"cool":1},"8EgjRMAKoneXG7ksFYcphQ":{"text":"Very quiet, friendly, comfortable. A sanctuary in New Orleans! Highly recommend.","useful":0,"cool":0},"YtqcwrMPEDiVL_7pUFaLHA":{"text":"We bought through Groupon (they suck, too).  We arrived about 10:30 in the evening on a We","useful":0,"cool":0},"4M23beVJIUCG3Q9xMnMsjA":{"text":"Not very impressed.  I thought the hotel was an upscale dump.  Employees were rude and par","useful":1,"cool":0},"RlD7CveaEWzPeJGovfgOpg":{"text":"I was visiting New Orleans for the first time with 5 other girlfriends, and ended up at th","useful":5,"cool":0},"F8FJ4y982ygvVE54zLjSPA":{"text":"Enjoyed my stay. Huge room. Very clean. High beds. Loved the decor. Classy modern sophisti","useful":1,"cool":1},"oP5OUhHvrVdZuMK-XnxX1w":{"text":"The customer service manager made our stay. She was warm, friendly and quite welcoming. We","useful":2,"cool":0},"UfyI8yzZpHB1s819FcgzXg":{"text":"Almost 5 stars for me but few things can be improved. \nLocation wise - literally around th","useful":1,"cool":0},"mz50ocX-X7TWPj_Fuusjvw":{"text":"Staying at the Astor Crowne Plaza was a hassle. Right off the bat I'm told I need to put d","useful":3,"cool":0},"gdPQD0kf0UkHIpgtrqV_iA":{"text":"Rude rude rude. Attitude is \"I don't give a....\" Hotel looks nice, the security guards see","useful":1,"cool":0},"1Pf2S2YJ-K67Ke5KjoiQMA":{"text":"It could use a little sprucing up on the 4th floor, but no complaints from me! Perfect loc","useful":0,"cool":0},"p5ScatdiQIOe10-8qtDMfA":{"text":"Absolutely no complaints! We had a king room with a bed that is actually a king size bed! ","useful":1,"cool":0},"k-GXTACP3pHZJVAPM5LZyw":{"text":"To start, they do a great job at keeping the lobby cool even when it's like 90 degrees out","useful":1,"cool":1},"6W01yiucn5B08UKr3pzQDA":{"text":"Pros - location\nJust at the end of the French Quarter on Canal & Bourbon.\nOne of the cheap","useful":0,"cool":1},"8CTqcjSw6b3XuwCf080g7Q":{"text":"I have stayed here many many times for work, never really had any complaints as my stays w","useful":1,"cool":1},"_4pS1MP60AZFsORhyqQubg":{"text":"If you are looking for a hotel that has really good location in New Orleans, this is where","useful":0,"cool":0},"a1tGGYl2BDo_qLeLGyWCvA":{"text":"Based off of some reviews that I've read about this hotel, I was concerned. However, I was","useful":1,"cool":0},"tGw_qwwU8HYA3Wy9xEu09w":{"text":"Right in the French Quarter on canal street. This was a great hotel to stay in. Literally ","useful":1,"cool":1},"B0IlPtp6xPfQ2qXvJkefqA":{"text":"The hotel was not as bad as I read on line 'thank Goodness' The rooms where clean and the ","useful":0,"cool":0},"XAAAyApwa1VtqyXf-b5hJA":{"text":"Awesome view to the bourbon street from the balcony. Great location.\nnot too noisy inside ","useful":0,"cool":0},"n6pjCNNV_ayCvoMGkKQGww":{"text":"I've stayed at multiple Crowne Plaza hotels and this is the worse. The bed feels like I'm ","useful":1,"cool":0},"8y0s177GqdImfq1x17yZLg":{"text":"Would not stay here again based on this room. I have already posted the picture of \"our vi","useful":4,"cool":0},"x45TNMKYNulkJETLzXjbBg":{"text":"Great location and convenient to the French quarter, Harrah's and the business district. I","useful":1,"cool":1},"iyYoDvoQX_1qIaiwv-HyVQ":{"text":"As others have said the location is perfect. Across the street from the streetcar and trol","useful":2,"cool":0},"CBD6KSsTmD4tOncS1cv24g":{"text":"The Astor is entirely too expensive regardless of location. It's also very loud. If anyone","useful":1,"cool":0},"6CMZXaMLxKBzYsWUDOt8IA":{"text":"3 stars only because this is supposed to be a Crowne Plaza hotel.... \n\nCons: no refrigerat","useful":0,"cool":0},"QWmCWRPLKiVaDnatTgSwqA":{"text":"We prepaid for our room 2 months in advance. After a long flight  and arriving at 10:00 pm","useful":0,"cool":0},"V641nhmkAkohfnl59TtdGw":{"text":"I read quite a few bad reviews...but my room was nonrefundable through Hotwire and I got i","useful":0,"cool":0},"BCeQL46qGejxCKNeq4ynJw":{"text":"We were able to swing a 3 day weekend trip to New Orleans by getting cheap flights, howeve","useful":2,"cool":0},"zSS5y3Gttu3FQ49FYAP_OA":{"text":"Most awful hotel experience every experienced. My friend opened the door to leave the room","useful":1,"cool":0},"xJWpn1UUbT2-RcnX6ugFyA":{"text":"The place was nice and it was close to everything. The service was good. The room was pret","useful":0,"cool":0},"M0zHNQDdB-Q4EH9AoWnizw":{"text":"We spent a long weekend celebrating our moms 70th birthday in New Orleans and this is the ","useful":0,"cool":0},"ozAjxLQ3E0vu9l3kyH-Qpw":{"text":"Very nice hotel especially if you plan to spend your time on Bourbon St and in the French ","useful":0,"cool":0},"oTrSBntaxsJGIBB5ljWkIw":{"text":"This review is about the hotel location and facilities. I was at the hotel for a conferenc","useful":0,"cool":0},"HzJ3B6L4i0EnfKeaj20U8A":{"text":"This hotel has a beautiful lobby. The rooms were clean and looked nice. Excellent water pr","useful":1,"cool":0},"59vwcSHL_YOB94foegKufA":{"text":"Do not stay here if you can avoid it. We stayed athe Crowne Plaza for a wedding. Thank goo","useful":0,"cool":0},"jaZ6lIbSmkqgjvfhxFwafQ":{"text":"Ghetto. For this price your shampoo should not be bolted into the shower. Your view should","useful":1,"cool":1},"LYb3y09khgEjVUzqvXnMnQ":{"text":"I'm very impressed with the Crowne Plaza. Upon check in, I was advised I lucked out to be ","useful":5,"cool":0},"cn88NKYt08mFqvQhHcUWdw":{"text":"Pretty & Clean rooms right next to all the action. Don't try to take a shower between 8-10","useful":0,"cool":0},"3EOv-UXSI0yyyhwJ8TloPg":{"text":"Been coming here for 5 consecutive years in a row and have notice this great located hotel","useful":7,"cool":0},"sqX5JdDVPvroZbjm09P_2g":{"text":"One word:  DATED!!  The bathrooms are horrific and I had a small mouse  that kept running ","useful":0,"cool":0},"F2Gnat9YHTFGI0ehtFl2Ow":{"text":"OMG...this is considered a 4-star hotel????  yikes!  i've stayed in Super 8 Motels that we","useful":1,"cool":0},"EygpmMZonOa-Qt0d1vvUdw":{"text":"Stayed in this hotel with a Hotwire deal. The hotel is older and the rooms are very dated ","useful":0,"cool":0},"ZqWFum2Is6go_naBz4sZCw":{"text":"Pros: Convenient to Bourbon Street, rooms are decent, love that you get linen spray and ey","useful":2,"cool":0},"D58EQ8MNFqDU0yiYkh8Cww":{"text":"Ok hotel, had some issues with the shower, but it wasn't a big deal. Also had trash left o","useful":0,"cool":0},"w86BV7VTWMjvkt1NhA8jVA":{"text":"I recently spent 3 nights at the Astor and very much enjoyed my time there. I found the st","useful":0,"cool":0},"YnZ7nJPeAon5yfB6_aPlIg":{"text":"We came to New Orleans for business, and upon checking into our room our room had just had","useful":2,"cool":0},"1UjFgELkQJDcVavFmfz-9g":{"text":"Horrified to have to jam a towel under my 9th floor Hotel room door at the ASTOR CROWN PLA","useful":1,"cool":0},"xPHT0lLB-yOtna-EiaGWsw":{"text":"We stayed here during our visit and for the price we paid for, I was really excited. We or","useful":1,"cool":1},"lpqqwzgswffekD6lcd2xuQ":{"text":"This hotel isn't perfect but it has a fantastic location and a great staff. The restaurant","useful":1,"cool":0},"a8wysjLfoTgFxUEHcz4XVA":{"text":"This place was really good. Anyone checking yelp for reviews ignore the negative reviews. ","useful":0,"cool":0},"NLHG4-94GTJ83h41Lw5fog":{"text":"We had a great suite.  The bellman was fast and efficient.  The pool was comfortable.\n\nThe","useful":0,"cool":0},"_Qs63pbvQqXNK3Gvx7A-JQ":{"text":"I'm booked for 5 days to stay in this hotel and so far I've been very disappointed. My fir","useful":0,"cool":0},"hdMHW1ncQDMDN8c-bqKRKA":{"text":"Very nice and clean hotel. Was placed on the 14th floor which is the highest level. Water ","useful":2,"cool":0},"jXEb5Q3VzkRuvTkvBVQQqw":{"text":"Nice place. Clean and good staff. Rooms show a little wear mostly the carpet but the beds ","useful":0,"cool":0},"zU7BkB1fCUcod_ZM0h1IMQ":{"text":"This hotel is in a great, convenient location - on Canal @ Bourbon St.  You can just walk ","useful":1,"cool":0},"VHXwjGmKQrx_opqvRwgn1g":{"text":"As a prestigious hotel in the French Quarter, my expectations were not met, especially sin","useful":1,"cool":0},"EMASaeNSZALuXl5MTzo6TQ":{"text":"i am not sure how many stars astor crowne plaza is but if it were 3 stars then it would be","useful":1,"cool":0},"V2FWZqKy4CZ7IuMPWmRIjQ":{"text":"Rude staff, pool sucks, $40 a night for parking and nothing makes up for it. Choose anothe","useful":1,"cool":0},"0ep3-oVWPRy636kZIinIxA":{"text":"With room rates of $220 - to $470 a night the least they could do is not charge $10 a day ","useful":0,"cool":0},"jXzVwyZxT-bjqaMB1iVT-g":{"text":"Excellent hotel, staff is amazing.  Everyone is helpful and pleasing. Very well kept, clea","useful":0,"cool":0},"pKXJ1z8rxtinY5pzozqS8Q":{"text":"This 'hotel' CLEARLY has a MICE PROBLEM!!! Mice were seen in our suite on numerous occasio","useful":0,"cool":0},"oUkrwALyRV8m8VJAWcPW1g":{"text":"Do not stay here.A member of the staff barred themselves in our room ,and held the door cl","useful":1,"cool":0},"0haRZJuhJ19_YPudrZR4TA":{"text":"The hotel have very nice rooms and the location is fabulous however the customer service a","useful":0,"cool":0},"d-Y-prhBx7BdMQco-dlIKQ":{"text":"Found the front desk staff to be slow and rude. Drinks over priced. Pool is small the wate","useful":3,"cool":0},"GxPB1xR-BU0_vjBN5zVB7g":{"text":"This is the worst hotel I've ever stayed in.   The room smells horrible, it's hot and if 8","useful":2,"cool":0},"WtRIitPmOl6fGec8OyjAfw":{"text":"The service was second to none the room was clean the location is prime, it has a restaura","useful":0,"cool":0},"tkqj1llmfHMGH3OpmzxYZQ":{"text":"I stayed here 1 night for work, after checking out the next day I notice items missing fro","useful":0,"cool":0},"5oxeCxqbNcxPUggk7mXhbA":{"text":"Great hotel with great staff. Nice rooms. Hallways could use some updating.","useful":1,"cool":0},"5mntyJVPdc_vZbZkrTBJyg":{"text":"This hotel was super comfortable, clean, quiet, etc.  It was nice to have such a clean and","useful":0,"cool":0},"tNdcMoOkyCvhjXb4tHcULw":{"text":"I was in the French Quarter just for one night and stayed at the Astor Crowne Plaza.  I wa","useful":0,"cool":0},"k_VbbdjX91r4nxsCTA3dvg":{"text":"I stayed at the hotel during a recent conference. It's my fourth time staying here and eac","useful":0,"cool":0},"iATbBL-OWqcpPvAyv9KDcg":{"text":"First night we got there was the night of a College Football game so it was packed! The lo","useful":1,"cool":0},"23jhbYNeWC9JKLn5ob1YDA":{"text":"I have always read the bad reviews first on any place I'm going. I'm sure you have too. Th","useful":3,"cool":0},"BirQpmZ53YZPS5fVVt-7_g":{"text":"On the plus side - great location on the corner of Canal and Bourbon Street. With that com","useful":0,"cool":0},"GEHUZHq0Kis3rDFBDZR6wQ":{"text":"Door was open when we got to our room, bed spread was on the floor, toilet seat was wet. T","useful":2,"cool":0},"ECK-vtUrV0tG_l4JflGBxQ":{"text":"IF YOU HAVEN'T BOOKED YOUR ROOM - DON'T\n\nIF YOU ALREADY HAVE - Here's a few things to look","useful":6,"cool":0},"rTkabon8Q1899r6W5cjQMw":{"text":"My wife and I checked in over a busy Memorial Day weekend. As soon as we arrived, Demond a","useful":0,"cool":0},"0ZVs4qyTga4-0z34YsV50A":{"text":"During this past holiday, we took a trip to New Orleans. For the vast majority of our stay","useful":3,"cool":0},"gC3nQ_3wCuQjJ2c3uECT_w":{"text":"I booked this hotel from booking.com. I called 3 different times and they said come on dow","useful":1,"cool":0},"WxjQcrIIPO9SerWvtg-HcQ":{"text":"Large clean rooms, friendly staff.  The restaurant in the lobby had great food.  I never d","useful":0,"cool":0},"V1WsBag1krt31X35kBO2DQ":{"text":"Ok, where to begin. First off, the location being on the corner of Canal and Bourbon seems","useful":1,"cool":0},"TmZSY21IAfzAxhLqV5SYlQ":{"text":"Beautiful room & nicely restored ! The rooms were clean,tastefully decorated and VERY comf","useful":1,"cool":0},"4EuQCTUJtYzqm4TZvbbcVQ":{"text":"Garbage. If you are coming to NOLA and plan on being completely drunk and oblivious the en","useful":2,"cool":0},"lGZ_pltM1auh5jJSxh5Xsw":{"text":"Nice rooms, but there were zero rolls of toilet paper in my room when I checked in. How is","useful":0,"cool":0},"AO53XXA_GD4ZlpFw9IMCEQ":{"text":"PLEASE SEE THE PICTURES I HAVE POSTED TO GET A BETTER UNDERSTANDING. I am actually embarra","useful":5,"cool":0},"qIUfpTuAWk89T9k2vOKpyw":{"text":"Expensive. No breakfast.  No room refrigerator.  Clean rooms, good beds. Great location. A","useful":0,"cool":0},"2v9Sz8-rs55_ecmEl2mraw":{"text":"We've stayed here about 10 years ago with no complaints.  This time was a disaster.  The f","useful":0,"cool":0},"k9SYAJ0miGlIVijX8vD3lA":{"text":"As always,  great stay at a great hotel.   The front desk was accommodating on my room cha","useful":2,"cool":0},"XMHANGMFPDDLOE6UDETzlw":{"text":"Nice, clean hotel with very courteous staff and concierge.  In my opinion, it is a little ","useful":1,"cool":0},"1VqmriSwZi_HGuZGqVDU5Q":{"text":"We loved everything about this hotel. It was amazing. The staff was amazing. The front des","useful":0,"cool":0},"K7HpN4hQM0EttHKL0ApySw":{"text":"This hotel has a beautiful facade as you enter, the rooms are decorated very well and our ","useful":0,"cool":0},"b-WCPspax2-hEhrE-c7boA":{"text":"My husband and I stayed here for 5 nights during our NOLA trip from Christmas to new year.","useful":0,"cool":0},"qlgD74nifMwhaSbOK25nIw":{"text":"This property is awful.  Horrible room (#6626) had no dresser and a view of a white wall. ","useful":0,"cool":0},"ITCYVtvTzHinLsUPNU1dSA":{"text":"I had accommodations booked at the Astor for three nights. On the day of my arrival I call","useful":0,"cool":0},"3NuqYA24nmk21EtxlNRFYw":{"text":"This place almost ruined my whole experience. As soon as I walk in the room is dirty and t","useful":4,"cool":0},"xdsad6xLHOIMnrSkzLPvDQ":{"text":"Maids never say good morning or hi, never show smile, never bring some stuff we called aft","useful":0,"cool":0},"gFJBl-bowpx5QKZicnEwNA":{"text":"Before I begin, I want to thank Kai (Kie) who served us at check in. She was very friendly","useful":2,"cool":1},"tf816ZVUhgp55Q9Xy1li0w":{"text":"Got a great deal on a 2 queen bed room for $129 as part of a festival deal.  Room tax $18.","useful":0,"cool":0},"7yzFqwWMMMicI-2ghj5lnA":{"text":"Beautiful hotel located right in the French Quarter, Starbucks is right across the street.","useful":0,"cool":0},"DUDj0QvizMRb_0qKqT7auw":{"text":"Pro: Right on Bourbon Street. Close to all the bars and parties,etc. Beautiful hotel and n","useful":2,"cool":0},"aIKbGv_eRAiQ10-azJiRHA":{"text":"Marvelous location, poor parking situation. Over 3 days it has taken 20-40 minutes to get ","useful":0,"cool":0},"nQd4KM56U6kE-mwYB9j1Xg":{"text":"I'm writing this review based not on a stay here but the valet out front. Let me just say ","useful":1,"cool":0},"WXy-FrgYOlWFn48AWg_Qww":{"text":"Love this hotel. Perfect location. The Canal & St. Louis streetcars run right in front and","useful":0,"cool":0},"XlPsfAkLnbq3eeqqNQqHfQ":{"text":"I was expecting stellar service and I was quite disappointed. I do understand that constru","useful":0,"cool":0},"9h9SIPZ2AcV02zA1P-BSnA":{"text":"Convenient location!!!\n\nI stayed here for two nights and enjoyed my stay. Our room faced B","useful":0,"cool":0},"-zJni5ww61RDIqHVoUogmA":{"text":"My wife and I read the reviews on this hotel and called ahead to the front desk before we ","useful":2,"cool":0},"TlwazGhZhEln8rBLdDv4BQ":{"text":"Just returned from a week's stay for a work conference. Fabulous hotel. Spacious rooms, aw","useful":0,"cool":0},"xTCvwxB4c9k4kH2D66rWmw":{"text":"I stayed here for a conference at the recommendation of a coworker. \n\nPros - Staff is very","useful":2,"cool":0},"FY4i71iFw7Mc4J2cclZNKg":{"text":"Great location. Literally couldn't ask for better. The hotel is aesthetically very nice an","useful":1,"cool":0},"ayqzSnmd9hv0IWbhi4dflQ":{"text":"We had a great time here, in the middle of everything. We arrived early on a Fri, they let","useful":0,"cool":0},"t9J3QLU7Pm62ipgUHJTkNA":{"text":"I've seen the bad reviews but honestly I had a fab time.  It doesn't have old world charm ","useful":0,"cool":0},"tC1st3QDcn-f0WfngtN_CA":{"text":"Only thing fancy is the name. The rooms are old, the carpets faded, and an inch of dust in","useful":6,"cool":0},"DJ6bc8TbBy2k_m4Z51ckQQ":{"text":"After reading mostly negatively reviews, I was embracing myself in case for a bad experien","useful":2,"cool":0},"1StB-Gb3DUm277g4Fv9psg":{"text":"I am two nights into a four night stay. I am compelled to write my review new since I have","useful":2,"cool":0},"SSXQv_bxyUu5ICcka-84DQ":{"text":"This is one of the worst hotels I have stayed at, and I have paid for a lot less than this","useful":3,"cool":0},"adT0xV1VN2YX77eUzI8Kmg":{"text":"Beautiful hotel that's located in the middle of all of the popular locations. Came here fo","useful":0,"cool":0},"dhaB2j6kmxM1mctzD_xrJA":{"text":"I have now stayed here twice, once when my Gators were in the Sugar Bowl, and again this p","useful":2,"cool":2},"HwfKYjQwUV4kh--DvGfJ6g":{"text":"Great location! But...\n     In 3 days, our room keys quit working 3 times. Each time we ha","useful":1,"cool":0},"8woEy8POsShLeC_BjIhpZg":{"text":"This is my very first negative review. \n\nI'm a pretty laid back and understanding fellow, ","useful":6,"cool":1},"_PRVthRE0M7C3lU_VwDX_w":{"text":"I am usually one of those who read endless reviews on Trip Advisor before settling for a h","useful":4,"cool":1},"swntcZfbKz1r9oZ2miz62A":{"text":"Excellent location in the French quarter on the corner of Bourbon street. Our room was nic","useful":0,"cool":0},"N9q-2ce0Q7jeMCkjbGOLRA":{"text":"I am not familiar with other hotels in the area so it's hard for me to review it. Maybe I ","useful":0,"cool":0},"Wk_Qv4mbXTf-3vK37GlFdw":{"text":"My boyfriend and I were thrilled to find a deal for this hotel on Priceline when we visite","useful":2,"cool":0},"LXFFPIblG2siY3zz7WXetg":{"text":"The hotel and amenities were fine. The folks at the front desk were very nice and very hel","useful":3,"cool":0},"WDGrEfAaai3xIzrUhGgkpA":{"text":"Multiple issues with inadequately trained staff, poor management oversight.\n\nRoom containe","useful":0,"cool":0},"a_OzypvkNW8q5sQ98AmSyQ":{"text":"Pleasantly surprised! Pricelined this room at the last minute, this is a old huge property","useful":0,"cool":0},"7jxYTmsCBbGsmwmCdVwcDQ":{"text":"My friend's laptop and camera were stolen from the room.  Luckily we used the safe for all","useful":2,"cool":0},"orZ-mRH_4XbcZQAcX3RohQ":{"text":"Stayed here for two nights. Clean and conveniently located. But housekeeping left no towel","useful":0,"cool":0},"WhZjwrXP38xGq79QX8P0XQ":{"text":"We really enjoyed our stay at this hotel. The location is very convenient, and the staff i","useful":0,"cool":0},"LTJhNS4U9IJr7TQrc52hsA":{"text":"When I read the reviews for this hotel I was kicking myself in the head for booking it. We","useful":0,"cool":0},"B5_GUR_wu6kUPvrAFZvBrQ":{"text":"Located on the corner of Canal & Bourbon, the entryway to Bourbon Street and the French Qu","useful":2,"cool":2},"MVE2HQkl6BnNefNyi04btw":{"text":"I don't know what else you could want in a hotel? It's in the area of the French Quarter, ","useful":0,"cool":0},"_nUYcn9C8sxNO4YW9bu6oA":{"text":"This hotel, although a bit pricier then other options in the local area, was a very nice s","useful":0,"cool":0},"VZBLwt0F6CKx6ojo1ws-yw":{"text":"It's clean and it's decently located. It's a bit over priced and the rooms in the newer ad","useful":0,"cool":0},"FlSur5ZWifT41Yk7ELX2hQ":{"text":"Absolute worst hotel stay.  Ever. I came to celebrate my 40th birthday.  I was there from ","useful":6,"cool":0},"s25nq8-8D0jwicfbbNdy6Q":{"text":"excellent location, nice lobby friendly staff, the rooms always are somewhat dirty tho, li","useful":0,"cool":0},"O0jSkQuiZvTiz_q2qGh0yw":{"text":"The hotel itself was quite nice and clean, but no parking and $42 vallet (after tax and bs","useful":0,"cool":0},"B12GQ3-_9pXqZU0vbm4HSw":{"text":"Expensive. Was told there was room service but when i tried to order the only choices were","useful":0,"cool":0},"o0mer1w3PZpxxqgZI7cxBA":{"text":"Staff is friendly but not informed! Called several times prior to my trip to gather necess","useful":0,"cool":0},"NdMZLHPFthbnQfjEz8cRpA":{"text":"This visit and stay at the Crowne plaza was probably one of my worst hotel experiences I h","useful":3,"cool":0},"dqw6WDVyKIO_Z2hmfQKeWQ":{"text":"First this hotel is in an excellent location. Once you arrive they park your car (for a fe","useful":0,"cool":0},"vtaLo-wW1Xj26fEz0fm37w":{"text":"Great location if your looking to party that's for sure. We on the other hand do more peop","useful":2,"cool":1},"ExlHvoJIIb6EzzSwg7JlYQ":{"text":"Not a bad place at all. There's a pool on the 3rd floor, I didn't get to use it since I le","useful":4,"cool":2},"xuNlCa-Vspw5mCqgkxK2Wg":{"text":"Very nice, clean, and quiet.  Beautiful lobby with marble.  I was very comfortable here.","useful":0,"cool":0},"9qhkBf1iuvga26iFdeyQNg":{"text":"Perfect location! I stayed there for a conference (which was held at the hotel). I really ","useful":0,"cool":0},"PVEK18bNqp_lIbBBp0wJ8A":{"text":"The hotel itself was nice.. however, I had multiple items stolen from my room.  I had an e","useful":1,"cool":0},"Ea67hpwwggJv98p8226vdA":{"text":"This was a mistake,  the website say they just finished a 11.000.000 renovation, but they ","useful":1,"cool":0},"S2MC2tkfqSagvBXruvETLQ":{"text":"Front desk was very nice and professional. \n\nPool on 4th floor was pretty cool. Hotel bar/","useful":1,"cool":2},"LaHwf59ptzoPBUxocGzc_w":{"text":"We had a lovely time at our stay! The newly renovated rooms are beautiful and customer ser","useful":0,"cool":0},"qC2fW_ZY_clUac-QCNcPMQ":{"text":"This hotel was GREAT! I was coming to New Orleans with my boyfriend so I wanted to stay so","useful":0,"cool":0},"tm7F52B1RU1mR4t3Dl7GPA":{"text":"NOTE: This is the MYSTERY HOTEL advertised on BOOKIT.COM.  \n\nWARNING: DO NOT book reservat","useful":3,"cool":1},"K7mNePmFUv2xV0WeU-U1rQ":{"text":"Great location, corner of canal & bourbon what more can you ask for.  Rooms were clean, be","useful":0,"cool":0},"wAphWPEnqrBf55FOdOovEQ":{"text":"This hotel is average at best and should be in the same class with Holiday Inn. Full payme","useful":0,"cool":0},"09yv8a87Jgn7P62elh2jzw":{"text":"When you check in it's industry standard to provide a credit card for incidentals. This ho","useful":1,"cool":0},"SX7gRo94ZGSxRUNHOaVmNw":{"text":"Rather unimpressed with my stay here. For a nicer Hotel I was expecting a nicer experience","useful":0,"cool":1},"3a13c_o3ZzUIeaZR8DrUDQ":{"text":"We stayed at this hotel because we had a Groupon, the price was great because of this and ","useful":1,"cool":0},"-WGdjBqf9lTuPxxrFyxaJA":{"text":"Similar to other reviewers, I too got this hotel via a mystery-booking for $110/ish a nigh","useful":1,"cool":0},"NV2Y13NRpNT25CbaLxK9-Q":{"text":"I stayed here for a friend's wedding. They were able to secure a great price for a block o","useful":0,"cool":0},"JQJlRlPYC216zPmXRqTfSw":{"text":"We paid months in advance. The first night I put out the placard for do not disturb but gr","useful":0,"cool":0},"mSwI3euqGcR_olxkDqOjDQ":{"text":"If you are cool with your stuff getting stolen from your room then by all means this is yo","useful":0,"cool":0},"rC9AWfRaniDTvD4yL7ixUg":{"text":"This hotel is in a perfect location, conveniently located in the French Quarter of New Orl","useful":0,"cool":0},"ttqupaBb0j81CfeJzjgQNg":{"text":"Big rooms! Friendliest staff! Very clean and organised.\n\nLiterally right on the corner / s","useful":0,"cool":0},"PNnkqr6qcvENdxhxojb-kw":{"text":"I was really torn on whether to rate 3 or 4 stars. Really liked the spaciousness of the ro","useful":4,"cool":1},"SsAf2-imWn22K_jqj_sNew":{"text":"Nothing special but the location.     \nNice lobby, stress free experience parking and chec","useful":0,"cool":0},"g3OQ5BiBGr2kvBa_cyvQcw":{"text":"I'm NEVER staying here again! This is the worst experience I've had at a hotel, and it mak","useful":2,"cool":1},"IBQx7EkXXXooTiaSFZ7DyQ":{"text":"I'm currently waiting for security to let me into my room, as my card suddenly doesn't wor","useful":0,"cool":0},"LNy_bGKfZCmNaaYeovgr9A":{"text":"To be fair, it's more 3 1/2 but I'll round up.  I'm waiting for the airport shuttle, so ra","useful":3,"cool":0},"nnzldVOJcNblN1R2xnU-xw":{"text":"EXCELLENT LOCATION\n\nBut.....Blood stain on sheets on the second bed \nRusted mirror. Rusted","useful":1,"cool":0},"1h_sDrSB-EXpVEJo1L1ZyQ":{"text":"Stayed here from June 30th to July 4th 2016 during Essence. The front desk staff was atten","useful":0,"cool":0},"yyd_ZloeVqagDNm0ZWYG_Q":{"text":"Really deserves 2.5, but I'm bumping it up for location, location, location. Located on th","useful":1,"cool":1},"vtxiXe-nqHvvPcGegYrMUA":{"text":"Just found out that I have a bacterial infection from the bedbug bites. The hotel hasn't c","useful":11,"cool":0},"e8u3kem2oTiKzSqDkW4ZJA":{"text":"BEDBUGS!!! Don't stay here! They really don't care about their guests. Unfriendly service.","useful":0,"cool":0},"bWaafQF87ep0dtOtjyRTow":{"text":"I attended a conference at this place and it was dirty!! When I arrived I was told I could","useful":1,"cool":0},"GTZadgaL_sPEjKgdCj5NSg":{"text":"I recently moved to Baton Rouge and decided to stay the night in New Orleans for my birthd","useful":1,"cool":0},"tdQhc1Wtf-QY-8pTTOWegQ":{"text":"Hotel is old, worn out and it feels unsafe walking around in the hotel. As you walk down t","useful":0,"cool":0},"94LS5NMbzKq1UcCFDZXITA":{"text":"Located at the corner of Canal & Boubon Street. The lobby is luxurious and well-appointed ","useful":0,"cool":0},"iLqd97B32sRm_Y88nVBEDg":{"text":"Booked as a hidden rate on another travel site NEVER AGAIN! We arrived around 10PM after o","useful":1,"cool":0},"m7SDK-NNspzLjzxIIKQfuQ":{"text":"Recently spent 3 nights for my daughter's wedding.  While there I was extremely impressed ","useful":0,"cool":0},"Z9wJ-60nJrylFS0plvjRQw":{"text":"Location: canal and bourbon. Very convenient. You can come in/get out from Bourbon or Cana","useful":0,"cool":0},"p3XAbvNrKgFiiykrX-lFBA":{"text":"Beautiful hotel within walking distance of everything touristy. You can tell that it's an ","useful":1,"cool":0},"0hDNzzqMq3if7WX9pfGUkQ":{"text":"Lovely hotel with tons of charm and a fantastic location. Check in staff was friendly and ","useful":0,"cool":0},"zygxpyZhexIvitiXvciESA":{"text":"My stay here on most levels was fine. Great location, hotel service was adequate, doormen ","useful":10,"cool":0},"PRWOIcj9qWX9KZPXA--zPA":{"text":"So far so good ...they're done renovations. My biggest issue is check in. The person that ","useful":0,"cool":0},"y8JMvaGnpyuEQNec791XgA":{"text":"There's a hard life, for every silver spoon. And there's an easy way of taking advantage o","useful":6,"cool":0},"62nSDCBEvYcySWqi3o949w":{"text":"When we arrived we were given a filthy room that had no yet been cleaned. After talking to","useful":0,"cool":0},"t4kQDYqeaabYZaPhkZVp4w":{"text":"The hotel's location was great, right at the beginning of Bourbon St and across lots of sh","useful":0,"cool":0},"haP4ZoLKhkEY5cBh6j5hUg":{"text":"I was a bit hesitant to book here after reading some of the reviews. I really felt at just","useful":3,"cool":0},"tlkDunGfyLZVrEeNEJb6Xw":{"text":"By far the worst hotel experience I have had in many years. We got here on Friday for a se","useful":0,"cool":0},"n36ySkbQ7NA-dK1GwxFWfg":{"text":"Nope. Don't do it. Lousiest service EVER!  From the desk to the bar to the restaurant to t","useful":0,"cool":0},"X8qzUOG057Bl2HJV8jaocA":{"text":"Stayed here Friday to Tuesday for my boyfriend's 40th birthday.\n\nLocation is awesome for F","useful":0,"cool":0},"dlhcRwVi_6m72G0ueoQ-Ig":{"text":"Beautiful hotel in a perfect location!! I was little nervous when we booked bc some of the","useful":0,"cool":0},"QhcpDZIhWN5VJ7z5iVK_7g":{"text":"Although I went to the Astor Crowne Plaza in New Orleans for a conference, it is also idea","useful":0,"cool":0},"crlolpPJ53dVk4TA8po0bg":{"text":"I booked around 40 plus rooms here for my wedding that took place over Memorial day weeken","useful":0,"cool":0},"gF_UaF9teMO7g_m4saxZzw":{"text":"Louisiana... the big EZ. They sure do take that slogan to heart. It took us about 1 hour t","useful":2,"cool":0},"Xh9AuJ1oRIg89fMu3vGLgQ":{"text":"Read some of the reviews and it scared me to death. I got a great deal off priceline and c","useful":0,"cool":0},"JTYLq7yHWJVSG30S-F7ERA":{"text":"The location couldn't have been more perfect. Right on the corner of bourbon street, but f","useful":1,"cool":1},"vOszZ9mlnzCcFr35uSMfcA":{"text":"Keyvonna the receptionist failed to give me my keys to the room by stating that \" there is","useful":0,"cool":0},"sVw0vqR3gVM0iaK71Kmwqw":{"text":"This review is long overdue, and for that, fellow travelers, I apologize.  My fiance and I","useful":7,"cool":4},"yg0xSLzLbmO0mUIzk_60Fw":{"text":"I asked for and was told I was given a newly renovated room with a view at check in. All s","useful":0,"cool":0},"rmCrQHs3enyh7YEKxY4icw":{"text":"I really wanted to give this place a better review, but I couldn't bring myself to give it","useful":1,"cool":2},"MM59A9x0Z5pwL8j3naNGDw":{"text":"This is the perfect hotel for a NOLA trip.  Its on the corner of Canal and Bourbon.  Its r","useful":1,"cool":0},"RmY0M3jxS1Q1raIl7ZVvtw":{"text":"First of all, this hotel is really beautiful. I got a great deal and surprised my gf with ","useful":0,"cool":0},"q6B7VsmFK_4D4MGsJQuX-Q":{"text":"There were several disappointments with our stay their but the biggest one was after check","useful":0,"cool":0},"IWYTI4mr3t6CuaGAS8Evig":{"text":"Although this hotel is excellently located, staff and service made our stay less than enjo","useful":1,"cool":0},"roK05CyOm51wYMAstNI1Yw":{"text":"Pro: Location Location Location. This hotel is at the very start of Burbon.\nCon: Location ","useful":1,"cool":0},"DcrbXw08BqvXOVsu4fh2nQ":{"text":"SAVE YOUR MONEY! Do not stay here. \nThe staff is all in all LAZY and disrespectful! You ar","useful":6,"cool":0},"rnW8UtJKO040jFZ0Pu_IuQ":{"text":"Although the location is fantastic within the French Quarter and Bourbon Street at $200+ d","useful":0,"cool":0},"XuB-xYRErWF9Xm06Ycz_4Q":{"text":"If you want to be close to the party then this location is a good one. Clean nice rooms wi","useful":0,"cool":0},"9T93Vb7exL9qBklhGkE4-A":{"text":"The hotel is in a great location if you are planning to go around the Bourbon St bars and ","useful":0,"cool":0},"8wvxhPsj6bgxNGGkAr9d-A":{"text":"Incredibly unprofessional, selfish and moronic staff. \n\nDuring my stay over Voodoo fest we","useful":2,"cool":0},"Irm6RRYVRVjhOmIQ3Dj3bQ":{"text":"The lobby is beautiful and the location is great. The rooms and restrooms however need som","useful":3,"cool":0},"Icx2gLblYB-PvMYJjswdug":{"text":"Reservation was totally messed up.  Took 1.5 hours to straighten up.  Some of the desk sta","useful":1,"cool":0},"sJlo_OQbHmJpZ83CO_TqGg":{"text":"The worst experience I ever had with Valet with jamar and another attendee and Matt. The t","useful":0,"cool":0},"NRf46m3rYLF-Xi3H5OK8Fw":{"text":"Worst experience I've ever had staying at a hotel. I've been going to New Orleans every ye","useful":4,"cool":2},"flf0FwaUTxKZ_ASeFGU6uA":{"text":"Terrible customer service. Forgot to give us wristbands and made us stand in line for 30 m","useful":1,"cool":0},"vzd5ewA1065EVxIaLDL7rA":{"text":"It is a nicely decorated hotel at the corner of Canal and Bourbon street.  We have been wa","useful":1,"cool":0},"Sy_RyaCvTelijIDkQ7tOJg":{"text":"This is kind of a hard one to write because there are a lot of things to rate.\n\nLOCATION i","useful":4,"cool":0},"k3KHoBzpfgUdhbLHfpAimw":{"text":"Follow up to my review on 11/8/2014.  We finally found someone who actually cared about th","useful":0,"cool":0},"cQZeW4ViJONkUOI3iwfnKw":{"text":"This is a beautiful hotel in the perfect location. Check in was fast and easy, the front d","useful":1,"cool":0},"7ko31UrLS3WanXeG4AwamQ":{"text":"I have tried 4 times to call and make a reservation. After leaving 2 messages, being hung ","useful":0,"cool":0},"KlT2qZ0MEYw5Bfy-HeophQ":{"text":"Enjoyed our stay during our short visit to New Orleans.  Very clean and a great location. ","useful":1,"cool":0},"lVjlpbDLmD9PzlEcVc_DCg":{"text":"Got a groupon deal for my birthday andbit was great...the ladies at the front desk were ve","useful":0,"cool":0},"COgWhbqA0UaF5vXEOjNqag":{"text":"Worst customer service ever! Especially the front desk manager Michael!! Not one ounce of ","useful":1,"cool":0},"nXCm8MacjHTp2jABc-2ALw":{"text":"DO NOT STAY ON FLOOR 9. We stayed on the 9th floor and in the morning when I was in bed ha","useful":0,"cool":0},"glZk4T8Q5oqK0muryDAKTQ":{"text":"This Hotel ended up calling me about my keys and they are sending them back to me with no ","useful":1,"cool":0},"O-bfA7XC7c0V2KLpk4o-vw":{"text":"I only stayed there because I was speaking at a conference. But I checked out in my mind t","useful":0,"cool":0},"x5WQRQ3Ir4akkEzbFTb5_w":{"text":"Great location, right in the middle of it all.   Clean rooms.  Only complaint is to be sur","useful":0,"cool":0},"TJwCTC_xAMb2WknUe3w_bA":{"text":"This hotel has broken a few laws and they'll pay for it later.\nIf you are seriously ill wi","useful":0,"cool":0},"DFdn3mfyxP-wGpYENYOepQ":{"text":"The most awful, overpriced hotel experience I could've had. I've stayed at Wyndam Garden I","useful":4,"cool":1},"SG5TulnbwiDLdRJ-FsWtgA":{"text":"Cons: Dirty sheets (see picture below), stain on pillow, no towels, no lotion, rude staff,","useful":2,"cool":0},"VD-5klNqacijnlBrb3frog":{"text":"WARNING: If I could give this hotel 0 stars I would. We stayed in Astor Crowne Plaza Room ","useful":5,"cool":0},"_vll8I41u4w2hAlsFYfj3g":{"text":"I love this place!! It's like everything you can look for  is all in one big area. Bourbon","useful":0,"cool":0},"F3mG0LYc3U3JLPon9QBAaw":{"text":"Before my final night's stay here and before my credit card was actually charged, I'd say ","useful":4,"cool":0},"2Shds_hdlkGIGQ64DYviOA":{"text":"I still don't get it,, you're already right smack down in the middle of the action and peo","useful":15,"cool":7},"dtCBB_-xbTNAgu1b0if75Q":{"text":"I've got to give some love to this 2.5 star rated hotel. The other reviews are scary....I'","useful":4,"cool":0},"t1PFrRXfEO9MTOEUOdXBig":{"text":"DO NOT STAY HERE!!! These people are straight thieves!! They charged my card $500 for a fi","useful":1,"cool":0},"oxcMS4g4PJUBLGxVMafXgA":{"text":"This was my 3rd time at this location for the Crown Plaza. The rooms and amenities are ok ","useful":2,"cool":0},"0q_jOIXG57kjBhgGnNFYLA":{"text":"This a crappy hotel for the price .... stay away unless there's nothing else but the stree","useful":1,"cool":0},"m-LvTI28CWS3wdmf6Rs-DQ":{"text":"My friends told me such great things about this hotel. So we booked it for labor day weeke","useful":1,"cool":0},"kzapt_o8O10TXD1ZJSnNsA":{"text":"We were treated very poorly...\nWe got there and the lady that was checking us in had a ver","useful":1,"cool":0},"yUz3eHrHuuZS239hjBMrjQ":{"text":"When we first arrived the front desk was very hospitable.  We received a free upgrade to a","useful":1,"cool":0},"u_Zj-WMbnge96-PIOhWbEg":{"text":"Didn't quite get the bad review of this place.  It was a decent place to stay for the pric","useful":5,"cool":0},"WUg5-CnI1aL5PSFAsXeV2g":{"text":"Worst experience I have ever had checking into a hotel. The hotel didn't have my reservati","useful":0,"cool":0},"zKCitP9Y_w-MmDtevZ44AQ":{"text":"Very nice hotel and nice staff. The Bourbon House restaurant has great food! Clean rooms a","useful":2,"cool":0},"xM8FrcZH4EluZsSmYBXh1Q":{"text":"Reservations were made 8 months ago. We arrive to find our room is tiny in the old side of","useful":2,"cool":0},"M7vxS6EeTAqCDx1EiopA4g":{"text":"First impression as we walked through the door were two \"ladies of the evening\" walking in","useful":1,"cool":0},"k7xHbv5RFJ6te7ISvIj7pg":{"text":"3 star hotel, at best.  I stayed here on New Years Eve.  The bathroom was small, the tub w","useful":1,"cool":0},"Me5d-XSYpObHBA_m4Yp5Yg":{"text":"This was my first and last stay in a Crowne Plaza hotel. I thought Crowne Plaza was suppos","useful":2,"cool":0},"TvjYDW0-J5hAdCdVEZG-hg":{"text":"I should've updated this awhile  ago but Just FYI I never got my keys back...... so I put ","useful":0,"cool":0},"78MCwAvZ3BAhiLXoRLttlg":{"text":"No hot water, ripped sheets, no actual warmer blankets... and loud frat bros screaming \"co","useful":1,"cool":0},"_mfOjcAcMX7ybgo-CaOsEg":{"text":"I stayed here mid-May for a long birthday celebration. The hotel is located on Bourbon str","useful":2,"cool":1},"qS2BPQz9S-JObL9FRSwyQg":{"text":"Stay away!  I stayed for a conference this past week and I definitely choose the wrong hot","useful":3,"cool":0},"xplLzYjducIMIJIEVv0qDA":{"text":"Location is good. That is the only good part. Poorly run, in disrepair, unfriendly staff t","useful":0,"cool":0},"65UxW9HhL4av2p3zS_xsLw":{"text":"If you want to feel like you're in a third world country airport or prison-- stay here. Th","useful":1,"cool":0},"lNnxTYT96PAmQmQrbao1CA":{"text":"3 stars, bumped up for the customer service.\n\nWe recently stayed here on our honeymoon. Ov","useful":4,"cool":0},"fwNu63wZh76w_wj3zpWg8w":{"text":"Although the hotel is nice and the rooms were decent, our CHECK IN was absolutely the wors","useful":2,"cool":0},"ty_HaDZnSU-H6S9ro5kxnQ":{"text":"I was in town for a conference located in the hotel. Large inviting conference rooms. Very","useful":0,"cool":0},"8i0EI7FcIq4EaS0rqtzeMw":{"text":"Looks pretty nice... on the outside. The bar attached is great. It's in a good location...","useful":0,"cool":0},"b-PR4WIPMHgzWby0tIpwag":{"text":"This hotel has a decent location, close to restaurants. The staff is friendly enough. But ","useful":0,"cool":0},"YgV2dsNiTAuSN-OUWfyIUQ":{"text":"I received a \"wake up call\" which I did not order to my room at 4am. When we didn't respon","useful":0,"cool":0},"WDwzB4icOaLU5RiaJi3vvA":{"text":"The only good thing about the hotel is the location. When we got to the hotel our room was","useful":3,"cool":0},"TThtUtiZ91KqRNbhfzgrcg":{"text":"Stayed at this hotel March 23-26, 2018. The hotel itself is a nice hotel, that's pretty mu","useful":2,"cool":0},"7-PWUfFoC1v8y7C5drgiTA":{"text":"UPDATE:\nThe front desk manager addressed this issue as soon as she knew about.  She apolog","useful":1,"cool":0},"Hqyu3eRm1JNIQ6J8QwEQnQ":{"text":"I was pleasantly surprised at how quiet it was to stay here despite being on Bourbon and C","useful":0,"cool":0},"_WV_59t-MGTAeOmSMuxtZA":{"text":"The room was nice the location was perfect. Right in walking distance of the Bourbon st an","useful":0,"cool":0},"8FNzYmAS4OJqh5IwdUsK3A":{"text":"It's the little things. Employee attitude. Up to date hotel information books   Even pens ","useful":1,"cool":0},"rE2YTj53mxwwonYpJhQhXA":{"text":"Great location to/from Bourbon Street! \n\nThis hotel does not mention that there is MAJOR C","useful":0,"cool":0},"_sS0AMV1MNrU-G08v3mRhA":{"text":"Hotel is really old and I don't think it is that clean but it is acceptable. It is afforda","useful":0,"cool":0},"Hr8VArQwEsJDjB6xX5wxyA":{"text":"It's just an average hotel with average rooms. The bed was hard, woke up every morning wit","useful":1,"cool":1},"DF578KLErZOQavmHcleE6g":{"text":"If you enjoy mice, you'll LOVE this hotel!  Found mouse running around our 4th floor suite","useful":0,"cool":0},"M2ZyPqL-wAX4BghPemzoNw":{"text":"My wife and I either stay here or at the Intercontinental when we travel to New Orleans.  ","useful":2,"cool":0},"YqvfDEinLdFVnDpxZyEzcA":{"text":"Don't waste your time or energy with even booking this place. I'm writing a review now and","useful":1,"cool":0},"yW4YJE9xx6QjdSLU8Ws_tg":{"text":"The positives-great location, right in the heart of the French quarter. The restaurant in ","useful":1,"cool":1},"OJJsTrH-xMTpi9XyuVq49w":{"text":"If you are looking for convenience to Bourbon street, this is a great location.  The rooms","useful":1,"cool":0},"sGmwVUUwRdfsOM2tdQRs3A":{"text":"Truly, I'm not very picky.  But I stayed at this hotel 18 months ago and it was about a B-","useful":1,"cool":0},"0Bso34HZBoVjsw5KnzbBFQ":{"text":"Good location, but not quiet at all.  I know it's in the French Quarter, but I'm talking a","useful":0,"cool":0},"2Y0EQ4QHGNY6WZPTF0tMgQ":{"text":"It's not the Ritz or the Roosevelt, but it's a good, moderately upscale hotel with a great","useful":1,"cool":0},"cs6NwC24ymvb7KYcUYmaDw":{"text":"When I arrived to my room the air temp was 80.  I turned t-stat Down to 65 and went out.  ","useful":2,"cool":0},"N8OIJ7pHc97Ad9iXtyK25A":{"text":"Booked this Hotel thru Groupon & Luv'd it!! Arrived at 4pm on a Saturday, no line checking","useful":0,"cool":0},"WnkuI1oq77C75VkIgWsotw":{"text":"I am an IHG Spire Elite member who spends 150 nights a year in hotel rooms. This is the wo","useful":6,"cool":2},"wSvwcw5X7UutaOop39M6bA":{"text":"Fantastic hotel! They put us in a different room than I booked, but changed right away! Be","useful":0,"cool":0},"ltKAXu4d1Teo-dSHMIE-jg":{"text":"The location of this hotel is prime. It's walking distance to most of the city's attractio","useful":2,"cool":1},"Jhxw1jUIYpJ85OescEjUfQ":{"text":"We won't stay here again. Ice machine area remained flooded for two days, and we waited ov","useful":0,"cool":0},"cEMOVSmBleAzloCFBmj1LQ":{"text":"I've been an IHG customer for years and this was the worst property I've ever stayed while","useful":0,"cool":0},"srdGvs_BaTDsNBhKT2viuQ":{"text":"Stayed one night coming through on the I-10 on our way to California decided to stop in an","useful":1,"cool":0},"rTKvFicaNDeCY0W0anOIfg":{"text":"Great place to stay.  Wish they had a balcony but if you go to second floor there is one t","useful":2,"cool":0},"MWw4fktNWdBqKYRUUOpwVA":{"text":"Stayed here for 1 night because my bf and I wanted to stay on Bourbon street after the Fre","useful":4,"cool":1},"PuC-_5e4La64pP13C2wUmg":{"text":"Great location! Right on Bourbon st and everything you need is right there for a classic N","useful":2,"cool":1},"kKGQsRZKD5CUhSp1M_RkTQ":{"text":"Booked this hotel through blind booking for a cheaper rate from another site. A few weeks ","useful":0,"cool":0},"iNHi6fX-JRzHHVi0d-o3aw":{"text":"Staff was friendly and accommodating. The location was convenient. And it was connected to","useful":0,"cool":0},"CG2ykhvXEHFUvlOHZAVc5A":{"text":"September 21-23 my friends and I stayed at the Crowne Plaza New Orleans French Quarter for","useful":1,"cool":0},"QkOISRtFPb4AG-x6Ogy-Hw":{"text":"I'm really annoyed with this place. First of all the front desk lady could not speak Engli","useful":1,"cool":0},"l_u9fIP4edXqPSgCp9GF4g":{"text":"Location of the hotel is amazing.  You are in the heart of the French Quarter, which allow","useful":1,"cool":0},"KddmgD-pcOIwPhDGfrOHHg":{"text":"Location is good if you want to be close to Bourbon St. Room is dated. Shower fixture is r","useful":0,"cool":0},"0HbI4dp3DUC1VreskmF_XQ":{"text":"I realize this is New Orleans, the Big Easy, but my recent stay here was not the most plea","useful":2,"cool":0},"xyUofEZtWfp65uEFlLAXsw":{"text":"Booked this hotel number of months before arriving..they called two weeks before to tell u","useful":1,"cool":0},"EVoC5xj0fq0fiBX3IB-_Ew":{"text":"Was a guest there from 10/14/19 -10/18/19. Came home with BEDBUGS! Called hotel manager fo","useful":0,"cool":0},"VbNsCPClaNam4F1EsbMbWw":{"text":"Very rude and unorganized staff!! Definitely not the 4 star hotel they advertise themselve","useful":0,"cool":0},"S_WaGMNo9HbCuxP-Okn2PQ":{"text":"The bed and thin blanket were uncomfortable. The air conditioning did not seem to work pro","useful":0,"cool":0},"C66JqFpbqXYiJ1_RgLPbAA":{"text":"If you like horrible service and lack of communication amongst the staff then this is your","useful":1,"cool":0},"_Z0dhUp69H6Uamk8S2NG3g":{"text":"Was a guest there from 10/14/19 -10/18/19. Came home with BEDBUGS! Called hotel manager fo","useful":0,"cool":0},"raJqf1sSV7j0Ct2e2G-sxA":{"text":"Check in was very slow and someone in this hotel needs to learn how to smile.  It is the c","useful":0,"cool":0},"LE6YDfkQ15x_LWwBkXwKJw":{"text":"I stayed here on September 20, 2019, with my two friends for 3 nights. Idk what ya'll talk","useful":0,"cool":0},"2QmqZ9K-YrB7OI6j6G5jGw":{"text":"Horrible experience, worst hotel I've stayed and total ripoff. Not even close to normal Cr","useful":0,"cool":0},"4X7mTcQtfaQ6LzNHq-SBrg":{"text":"**HORRIBLE SERVICE**\nEverything was great...quick 2 day vacation with my girls. Until the ","useful":3,"cool":1},"g5t4qIAOfg1AlHKIFnSBmw":{"text":"This is my go-to hotel when staying in New Orleans.  It's basically ON Bourbon St...althou","useful":3,"cool":2},"VbYQGLhuLndmzQHAsyimmg":{"text":"DO NOT STAY HERE. Night staff was very unavailable. I called the front desk multiple times","useful":0,"cool":0},"kW5EQ7xbTP-jbFWXYfWXTQ":{"text":"The worst run hotel ever. They issued a key to our room to someone else who came to our ro","useful":0,"cool":0},"pLB1SezNc_uTfNiRiKvRJQ":{"text":"Horrible horrible..! Dirty and loud !  Guests throwing up ...can hear everything from the ","useful":0,"cool":0},"70aEtQBe1csTTCms4nYZmw":{"text":"It's a generic, replaceable hotel asking for irreplaceable money for irrelevant bits.  I d","useful":2,"cool":0},"_PU-EOKpNsOtBINZ4QAzaA":{"text":"This hotel is alright. Air conditioning can't keep up, the room is in need of updates. Cam","useful":0,"cool":0},"9INnbZSBDFYHMWm0iVIZRA":{"text":"Dirty Room! Horrible service. Tried many times for resolution. Housekeeping, front desk, m","useful":1,"cool":0},"vRIfCyIPpMnIMX12RjSSwA":{"text":"Location, location, location!!!!  Just off bourbon St, close walk to Jackson square, perfe","useful":0,"cool":1},"_SdHpeFUCs-4UqhauAtu8A":{"text":"We stayed in a newly renovated tower.  Room was nice and clean.  Staff was polite and atte","useful":0,"cool":0},"teth6U_0QqknJIG3RCS7-A":{"text":"Positive Points: Located in the heart of Bourbon & Canal Street. Close to CVS, Walgreens &","useful":4,"cool":0},"4mk46NrtE4QTPBrd8QGcUA":{"text":"Rained in our room every morning! Let staff know and it was completely over looked. The sa","useful":2,"cool":1},"5jX5KtY4egSZRd3KSvuI4A":{"text":"This hotel is very unprofessional & happen to have rats!I am disgusted and not satisfied w","useful":0,"cool":0},"x2vqMVYaWUYHff39V-N6ng":{"text":"We've stayed in NOLA a lot, and this was one of the best hotels we've ever had. It was EXT","useful":0,"cool":0},"jAZGRIkcmQ-WTXLXH1yJ-Q":{"text":"I would not recommend staying at this hotel. The cons: screwed up our reservation\nHomeless","useful":1,"cool":0},"fW_shdXSokYLtPcdke_nhA":{"text":"A great location for French Quarter activities.  Close enough to everything and yet not su","useful":0,"cool":1},"-n8JubWTZ5gkXG69iPUQPQ":{"text":"The hotel is in a really great location on bourbon St. The room was very clean and beautif","useful":5,"cool":0},"ovC-DzTyPFpAL0m46mGmdQ":{"text":"Okay so I just got here, so I'll reserve an update to this until I leave 3 nights from now","useful":1,"cool":0},"3BjCJUUQyx4xIi6re_RmxA":{"text":"3 plus. A good conference hotel in a great location.\n\nPool is too small and only sunny a p","useful":2,"cool":1},"NqS-AC4KAgPJdPUk5R3JZw":{"text":"If you don't mind hidden charges and rooms with non-functioning air conditioning, this is ","useful":0,"cool":0},"dSxVd405a2j0jPv7sDLGQg":{"text":"Looks can be deceiving... beautiful hotel perfectly located to all French Quarter amenitie","useful":1,"cool":0},"cfRx7aMN5OhyFsciz4LSDw":{"text":"Stayed here for a 4 day conference last wk.\n\nLocation is fantastic.  Right on the corner o","useful":2,"cool":0},"A2J4gV0s_r1EfLekA0lDfA":{"text":"My biggest problem with this place is that it is listed as a four star hotel (should have ","useful":5,"cool":0},"StsMUU6XXbFakQ4Jk0vHCA":{"text":"We booked and prepaid a room through Priceline as this was a last minute trip and we would","useful":2,"cool":0},"3TSlGk1CaXwUBL-HIHbpCA":{"text":"On the upside:  grand(ish) hotel with a nice, if a bit worn, lobby, nice little outdoor po","useful":1,"cool":1},"FpxZWSKf0sUUSVs6HGvJkA":{"text":"My feelings are a little bit of a mix for this place... \n\nI love Crowne Plazas and I trust","useful":2,"cool":0},"NXI1NQ1L_1qTPiFiL0h8wg":{"text":"The only positive comment I have to offer is the location is perfect if you want convenien","useful":0,"cool":0},"e-j-hEKTAz5QLP7L3bQx7w":{"text":"Was a guest there from 10/14/19 -10/18/19. Came home with BEDBUGS! Called hotel manager fo","useful":0,"cool":0},"LfrSxzXqe20ZGKOBr8Xh9w":{"text":"My cousin and I travel to NOLA quite frequently.  We have stayed at the Astor several time","useful":0,"cool":0},"9Y5xNxGQK7m-xgV9xpN4DQ":{"text":"Have stayed here more than any other hotel when visiting new Orleans.  Great spot at canal","useful":0,"cool":0},"AJn7AMCPv1wf5NV0z0Iqww":{"text":"I stayed in the Astor Crown Plaza in New Orleans, LA last night and I am only giving this ","useful":1,"cool":0},"bVHio8Q9aUvNO2fGv46l3A":{"text":"Never come to this hotel. Room service food sucks. I had a nasty dead roach in my napkin!!","useful":0,"cool":0},"6qs1rqr-6zPjiS-vFqWVnw":{"text":"I never take the time to write reviews; however, this experience was horrible. We arrived ","useful":1,"cool":0},"1AL2Fe4fBzMJ2oP5g1E69Q":{"text":"Mediocre hotel but great location. Rooms are somewhat stuffy and dirty, accented with pill","useful":2,"cool":0},"_b2ijUrAPAZClxZC4ZJL0g":{"text":"Comfy hotel, nice location if you want to be close to Bourbon Street.","useful":0,"cool":0},"41i-68pD0v1ckovoJKHO0w":{"text":"The hotel is not as bad as the reviews made it seem. I came with my family and they compla","useful":0,"cool":0},"83Od_Ga2xigsrlbuyk09Pg":{"text":"The location was good, and that deserve one star, but the service and security was horribl","useful":4,"cool":0},"LuZl8TcN436CzzB_eaauyA":{"text":"Wow where to start. I was on a business trip for the first time ever to New Orleans. Check","useful":0,"cool":0},"C0OzxAHFZk9VGAcMWFlrUQ":{"text":"The hotel left much to be desired with the fact that the maid never came to clean the room","useful":1,"cool":0},"TU4ty6Lx9VYHEYDAv4fpUg":{"text":"This is by far one of the worst hotel I've ever stayed in. I travel a great deal of the wo","useful":0,"cool":0},"Xczcxx3JUq0MrwcIN0EvVw":{"text":"This is a nice, clean hotel with a decent lobby and a good staff. The only problem is the ","useful":0,"cool":0},"4mj7lmIfvqtseBRJa6ESaw":{"text":"Seconds from bourbon street this is a great location. It's a solid hotel for a place to ca","useful":1,"cool":0},"ISYybg3uYee9eQOEQ06MVw":{"text":"Service was excellent. Room was okay. Door handle fell off when we walked in. Beds were cl","useful":0,"cool":0},"RuTn3TWuyAXCMAa2Qy8apA":{"text":"Absolutely HORRIBLE customer service. Laughable. Never ever book an event here. We had 30 ","useful":1,"cool":0},"b9Nqfp6Bmbf9P-bl9s0r9A":{"text":"Just back from our third stay at this hotel. Happy to be on an upper floor and could not h","useful":4,"cool":0},"IndJHqijOGQ28tfZ4QOleA":{"text":"I came here for a four day stay and feel like I got a pretty good feel for the hotel.\n\nFir","useful":1,"cool":0},"VZ8oNFRflFL4jPvMVnqcZg":{"text":"A surprisingly well polished hotel, given its close proximity to one of America's most not","useful":2,"cool":2},"jdnc7OU383eDOGg-h1dK8g":{"text":"The location is perfect; right on the corner of bourbon st. A lot of food & shops steps fr","useful":0,"cool":0},"Hrk9RQp7I3hFoAc3Wi11Ng":{"text":"This was not the experience I was expecting. And, to be honest, I didn't have super high e","useful":2,"cool":0},"h5vIVfDPH4STyMkDoH3izQ":{"text":"Average hotel, good location, bad service. The front desk staff clearly does not want to b","useful":0,"cool":0},"YVZ1dfVJ3RAGmav0enG_Aw":{"text":"Hotel is on corner of Canal and Bourbon st.  Lots of homeless, pimps, hookers and crack he","useful":1,"cool":0},"B7C4LOAjZknYpHdNJeYCew":{"text":"Cleans rooms, beautiful lobby, nice but small outdoor pool, in the center of New Orleans (","useful":0,"cool":0},"YdPO-AS_xU0MNFxfUf9xSA":{"text":"All I have to say is that the Hotels Location is WONDERFUL! It's on Canal st right where B","useful":2,"cool":1},"zAnUH3uI3TWZZDX4fqqAAg":{"text":"Stayed here one night with my husband. It has the perfect location and we received wonderf","useful":0,"cool":0},"nA0K8B2eqY-bG9nmzYxlZg":{"text":"Visited NOLA for the first time earlier this month , stayed at the Astor and had a blast !","useful":1,"cool":0},"iNbDpFHS4kkjzUWWJVEZsg":{"text":"I had the opportunity to stay in this hotel when I was in New Orleans for the first time o","useful":7,"cool":3},"B0ghB82XM5E5pp2l0VPM4A":{"text":"Don't go here if you need to sleep. The hotel itself was wonderful and the staff was great","useful":0,"cool":0},"N_oSAKwEHcKAgeeda8dXaA":{"text":"We chose the Astor Crowne Plaza primarily for its great location near all the action on Bo","useful":0,"cool":0},"uCpcSDSg5P5Yd-WP_ZjKvw":{"text":"This has been the worst hotel experience of my life. 1. They don't tell you about the $60/","useful":0,"cool":0},"ameROwhscLxlbtLrjDJnfw":{"text":"Well. We stayed on the third floor. All was well until a mouse decided to room with us. Th","useful":2,"cool":0},"4txsCy5gRI7CL9AOX-cR8Q":{"text":"From the moment we checked in with our front desk agent Katie she was wonderful. She gave ","useful":0,"cool":0},"fa17YPNdYLiXrEMxvtgBdg":{"text":"Perfectly located hotel!\n\nThis hotel is right off of Canal with Bourbon street next door. ","useful":4,"cool":0},"zfajHVnznBa6sNyyaduPcg":{"text":"Not very pleased with this hotel. If you are looking for a place to stay, you can do much ","useful":1,"cool":0},"eo3t6Ou7pnXLqaCsHMB8oA":{"text":"Add $50 PER night to your reservation for parking.  No frig in the room. Location is good ","useful":1,"cool":0},"cy9Q_nDk4l2bFjIthQQldg":{"text":"Stayed here this week end. \n1.  Do not waste time asking for more coffee.  I walked downst","useful":0,"cool":0},"KDCtDI3YaTdRaAxGgd4nwQ":{"text":"This is the noisiest hotel I've ever been in. Went to go to bed about 1030 to the pounding","useful":2,"cool":0},"Fhnt-rjHqGWo5j_6oA2E4Q":{"text":"Terrible front desk check in lady.  She was not friendly at all.  Put us on the most noisy","useful":2,"cool":0},"77wSPJdjYb6Etw-qjAb7Ww":{"text":"When you travel you want to have the comforts of home when you're away FROM home. That's g","useful":2,"cool":0},"vJ_8-tTxIlwQ3R9_7sbpRQ":{"text":"This is a mixed review.  First the positive part, I booked a room at the Astor crowne plaz","useful":1,"cool":0},"Bw7d-2f33yRAbuNW2WKdhA":{"text":"Keyvonna the receptionist failed to give me my keys to the room by stating that \" there is","useful":1,"cool":0},"meuXrP4UblaGbH9Wv_RwFA":{"text":"Worst hotel stay ever.  Paid extra for room with a view.  What I got was a room with a vie","useful":1,"cool":0},"9eKS-PzszrBT1TSiX1dSdA":{"text":"Awesome hotel @ the corner of Canal & Bourbon. Stunningly beautiful. \n\nThe room we had was","useful":4,"cool":2},"89U2dOPqqqRRfSz63dARqw":{"text":"This was a stop on our family vacation road trip and if your NOT an IHG member I suggest y","useful":0,"cool":0},"og4tLquTG1-qreKkCChPZg":{"text":"Don't book here!! Made a 6 night reservation, my plans changed and needed to cancel, they ","useful":1,"cool":0},"Hx1M7UJm07KVQCehkPn2sg":{"text":"The hotel is in a great area if you want to be in the thick of Bourbon Street in the extre","useful":0,"cool":0},"JBCqYLs053qHzzqsw7Jf9g":{"text":"The entire hotel smelled like mold and mildew and it was even worse in the rooms than in t","useful":0,"cool":0},"maSiil2Wfig3JEBgpIUeaQ":{"text":"We didn't stay here but had a very bad experience with the security of the hotel. My husba","useful":5,"cool":0},"x3uL1MqxNOzH4JjQ4ruyaw":{"text":"If you like extremely rude service and unprofessional staff then this is your place! We ca","useful":1,"cool":0},"a0lhe_4DOYOTu3rBgS4gZg":{"text":"I actually really enjoyed my stay here.  It's right on the corner of canal and bourbon str","useful":12,"cool":6},"a2CHrH29Ax79qvFZSdJxvg":{"text":"This place looks nice, but poor service and evidently have old equipment that is in dire n","useful":1,"cool":0},"t-Xfyf6zN9ztnQv2mlxm6A":{"text":"I will never stay here again! First of all the hotel was completely booked with students o","useful":0,"cool":0},"xMeR5WRR4NPnNDC4kASwCg":{"text":"DO NOT -- I REPEAT, DO NOT BOOK THIS HOTEL. \nthey steal your money and there is ZERO custo","useful":2,"cool":0},"g6eeLn1lxUCMVedbTXqvQA":{"text":"If your here for Mardi Gras room 1302 over looks Canal Street which means you can look fro","useful":5,"cool":2},"tas5QFDEPQfydFqXub1e3A":{"text":"The experience here was the absolute worst. After waiting in line 1/2 hour to get to the c","useful":1,"cool":0},"gpkCYxVA45y3SkwWmNlhcw":{"text":"This is the worst hotel I have every stayed at ! We were stranded in Houston  because of w","useful":1,"cool":0},"k1jPhyEsQXPA1QsRt4rbvQ":{"text":"I have NEVER had such a bad experience in all of my adult life.  \nI contacted hotel 2 mths","useful":3,"cool":0},"PcOrBnfow8zUtiBu-ArWZQ":{"text":"The air quality in the rooms is bad and smells strongly of mildew. This issue is bad enoug","useful":0,"cool":0},"ckYXJaUisHlFGzGY8BekBQ":{"text":"Do yourself a favor, save your money and go elsewhere!\n\nIncredibly upsetting to have to wr","useful":3,"cool":0},"KT6hRJp0_Jggn503hBjv1g":{"text":"Isabelle, the concierge made our trip perfect.  Her assistance in getting dinner reservati","useful":0,"cool":1},"ldup-ujCaEgQjJfwcv8e_g":{"text":"Staying here was a decent experience. The rooms were better sized than most around The Fre","useful":1,"cool":0},"TdaH_uLA9A4Xb7tAsScxjQ":{"text":"Do not stay here. I am stuck here for the next four days and I am considering eating the c","useful":4,"cool":0},"fGSqMpVYfcW9EbJMJ--1iA":{"text":"I would have given this a 1 star review had it not been for their very nice and informativ","useful":0,"cool":0},"cKpyd17jHOQ9z9mI7GYy6Q":{"text":"I am in New Orleans quite frequently and if I stay at a hotel I usually like this one. How","useful":0,"cool":0},"xX8DmXHQfWGLJznhoSOWGA":{"text":"A couple of reasons why I only gave it a 2 star. 1.) The sink handles were broken in our b","useful":0,"cool":0},"Tg8hkAVjKYBGZStbYGLncA":{"text":"My friend and I came to stay at this hotel because it was close to everything. When we got","useful":0,"cool":0},"MZGdu5AtHyQEepahVe1QMg":{"text":"Happened to stay there during a conference in  New Orleans. Checked in late night on 12 Oc","useful":0,"cool":0},"iA0Qnmhz_P5g7G50r1EcxQ":{"text":"We made a great choice with the Astor Crown Plaza. The location is near everything yet qui","useful":0,"cool":0},"BT06mRDOtueQyuzhwjlCOQ":{"text":"This hotel\nIs perfect    First the staff is so accommodating and friendly.  \nThe rooms are","useful":0,"cool":0},"yhvXBx62SjJYlHjUZvQf4g":{"text":"I should have checked these horrible reviews before we booked. No surprise it's only 2 sta","useful":2,"cool":0},"vP9XCYjS4Uovtf9TLkcO_A":{"text":"I've been to New Orleans quite a few times now. Over the past few years, most of the times","useful":64,"cool":60},"JJ5Nsy0tXJBYe6lzLpD5gA":{"text":"Okay. So this location is AMAZING. One of the closest hotels to Bourbon street (the second","useful":0,"cool":0},"y6_Gi3ADpwG4xRIN-OPJaw":{"text":"Great location but unless you like mice in your room don't stay here. We were on the fifth","useful":4,"cool":0},"s7Cst2NQgfLeh9Yw4wZCDA":{"text":"Terrible customer service. Employees have serious attitude problems. If I could give 0 I w","useful":2,"cool":0},"gjXWh__CrU0F-Aw7jvypLA":{"text":"So I booked my room in October for Mardi Gras, I didnt look at the reviews until January. ","useful":3,"cool":3},"hN6HgnPIrPV6XPdOeAp65Q":{"text":"I really wanted to give the hotel a 4 star rating. When I walked through the door, I was v","useful":1,"cool":0},"yK6cqcUJy3KA7R8_JS-grQ":{"text":"We spent Valentines Day weekend here and the accommodations were outstanding. We tend not ","useful":0,"cool":0},"aXLBSAbfGkWQvNZjM8KDMQ":{"text":"WORST HOTEL EXPERIENCE EVER! Service was non existent! Stayed here for five nights... Aske","useful":0,"cool":0},"sO42XC6AHafai6Tpe613WA":{"text":"Would leave 0 stars if i could. The absolute worst hotel I have ever stayed in. This place","useful":0,"cool":0},"1fc2mQlKNOwBMJH2lc2lBQ":{"text":"Ok, I'm usually very hard on Hotels reviews, but I got to tell you we picked the right hot","useful":1,"cool":0},"72BdJVL61El77J6j1sbHUQ":{"text":"I stayed here for 5 nights for a conference that was hosted by the hotel.\n\nI showed up on ","useful":3,"cool":0},"xji2fqBwJUgsHJ_tkauXIQ":{"text":"All of the negative reviews of this place had me scared and ready to reconsider our weeken","useful":3,"cool":0},"j6_AI_walyQT_9lOgcZxOA":{"text":"On the amenities listed for this hotel, it says \"shuttle\". Stayed there last week, and The","useful":0,"cool":0},"3DdciGYYVejV7cGN1qnc2A":{"text":"Just got to our room and the staff was very friendly! Waited about 10 minutes to check in ","useful":6,"cool":2},"Gx7A-YYJ2bbwPewI3Ubrig":{"text":"Perfect location on the corner of Canal and Bourbon. Bourbon House restaurant is attached.","useful":1,"cool":2},"aBcQNkXiTzZBpfC-17g9Nw":{"text":"We stayed here a couple weeks ago for our first trip to NOLA. I did a lot of research on w","useful":0,"cool":0},"OSMsUmokIHAYchQ_KAIOJQ":{"text":"I stayed here recently on my trip to New Orleans. I am a Holiday Inn rewards member, and t","useful":3,"cool":2},"EvOLBq8aY3wY1V6NU7J9oQ":{"text":"This hotel pretty much met my expectations for a hotel located right off of Bourbon street","useful":0,"cool":0},"onYhGFjU4ev5k-krVnMfPA":{"text":"First of all- The staff is so unfriendly.\nWhen they cleaned our rooms, they didn't even wi","useful":1,"cool":0},"pM4CLbhp7DIEy7xq1rS69A":{"text":"Horrible experience! Our room was next to the elevator so all you heard was the elevator s","useful":2,"cool":0},"1WhCtMJkaM9K62MRIIOwUw":{"text":"I was very disappointed with this hotel from start to finish, and at around $200/night I e","useful":0,"cool":0},"4DdQH5acu3j5PMwfXvepCw":{"text":"Everything that had to do with this hotel was a nightmare. We arrived in NOLA around 6:30p","useful":1,"cool":0},"XkspnMNnnAfvf4tHwyXSOg":{"text":"The person that booked the reservation made a mistake and did it on another name which is ","useful":0,"cool":0},"tFnxdZ_fp3xS396zN_0-eQ":{"text":"I stayed one night during Mardi Gras with a Groupon for a room with a king bed for $79, cr","useful":1,"cool":0},"Uz7H8vWiYp3CiKqWTXbYwg":{"text":"We booked this hotel using Hotwire. You never know what you're going to end up with. \n\nThe","useful":11,"cool":6},"WJ_x5VTmoU_n5Qesewqi-A":{"text":"Very convenient location for a great stay. Located right next to Bourbon, allowing you to ","useful":0,"cool":1},"vicItyH99z6W-GLalgC6jg":{"text":"(Visit: Jun 2016) Got a GREAT deal on Groupon.  If we'd paid more, I would have been disap","useful":0,"cool":0},"4ic9OcqNqa3wEKqeCNLUIw":{"text":"DO NOT STAY HERE. Me and 2 friends books this hotel for a week. We had issues every single","useful":0,"cool":0},"uIBsFTpnZr_2SME7DzYGuw":{"text":"Astor Crowne Plaza is a disaster.  Stayed for five days, only one day they cleaned the roo","useful":0,"cool":0},"OhI_gqP76Z77Y5N5nVeCDA":{"text":"The location is great, but that's about all. The rooms were dated, and although I wouldn't","useful":0,"cool":0},"M7nhVDSiNVbvqKYpFQhHaw":{"text":"If you have any problems at this hotel, ask to speak with Trisha. She is the front desk ma","useful":0,"cool":0},"qBGH-Dg4kmrs3UeuCw7vrA":{"text":"I was traveling through for work and stayed here. So I stop after a 9 hours drive to rest ","useful":2,"cool":0},"KDoRzlA2ESps8PP-lB6J8A":{"text":"Location, location, location. Why I chose the hotel, excellent to walk right on/off bourbo","useful":0,"cool":0},"19MBWfrOmzYpqRJ4XA1YQA":{"text":"Found this deal on Groupon. Groupon said this is a \"four-star top secret hotel.\" I've seen","useful":4,"cool":1},"ek0fzCMHfbn1J0-palAY7Q":{"text":"Very nice and pleasant staff. Great location. Parking is 4 blocks away BUT after all the e","useful":0,"cool":0},"iEGRoROiJ3WW2Vgq10vDrA":{"text":"It's amazing how terrible this hotel turned out to be, you walk into a grand lobby however","useful":1,"cool":0},"r3oCfBvK3uhCJ5GfHnJkxQ":{"text":"Hotel was not what we expected stayed from Thursday to Sunday. There was no amenities that","useful":1,"cool":0},"pS11GByZyqu-GDt42V7oww":{"text":"The experience was just.... eh. I'm not convinced anyone that we encountered that works th","useful":0,"cool":0},"BiIfV8DfpjT6e1lkS_FNGA":{"text":"I am a spirit elite member and I will be bringing my business elsewhere. Before arriving t","useful":0,"cool":0},"Y5pLrsc6jBljLpxSGGViQQ":{"text":"They had the pool, workout room and room service closed due to covid (even though other ch","useful":2,"cool":1},"Sc12vFKxMzkr7MO3lxkATQ":{"text":"This hotel was a very last minute resort for us. We were originally booked to stay at Bour","useful":0,"cool":0},"DJiCuzNlidnI3yctuf5Kmw":{"text":"Avoid this hotel, extremely overrated. Checked in for a six night stay with a king bed, 1s","useful":0,"cool":0},"w-5p5dWgkkCm4qy1G-XA8w":{"text":"Friendliest staff, beautiful room, and overall wonderful atmosphere. Very clean, and so cl","useful":1,"cool":0},"GbFfOrKFOloyqelnhItxcw":{"text":"I've stayed here a few times now and it has its good points and bad points.  \n\nIf you want","useful":6,"cool":2},"TAdNuiw6seUzWJkfeopG-g":{"text":"This place was perfect, reasonable pricing and walkable distance to Bourbon St for those f","useful":8,"cool":7},"qNCQU_mUEnBOpRkN7BLHbQ":{"text":"After driving 10 hours from dropping my daughter off this was a very big disappointment. I","useful":0,"cool":0},"61ZUQpQZBtqjW_z7TBYmJg":{"text":"Upon checking in we had to wait for what seemed forever for a room. They were so behind on","useful":1,"cool":0},"9q5R9CnkseD_f6Zo9WDdfA":{"text":"Located in the heart of New Orleans. This spot is a prime one and walking distance to most","useful":1,"cool":0},"ZxTjPR6ExKNXDr4n4144SA":{"text":"Took hubby for his big 5-0 Bday wknd to visit New Orleans. Landed a great deal & I see why","useful":1,"cool":1},"_E27BAoIk5NQFOK1KV4RJg":{"text":"My stay was nice, house keeping did a great job keeping our room clean when we asked due t","useful":0,"cool":0},"X0lERJm0WtmAzdsufgBZ9w":{"text":"Good location right on corner of Canal st. And bourbon. Went for Mardi Gras! Good time! Ho","useful":0,"cool":0},"dq7zedJPR9EgNo1bPsEoDA":{"text":"The restaurant is amazing. The rooms are a different ball game.  The rodent problem is rea","useful":0,"cool":0},"dMzOsxe_dF62mvh786oTYw":{"text":"For starters the location is perfect if you're going to be eating and drinking on Bourbon,","useful":0,"cool":0},"ig55dVt3Foh8u0o1C61QQg":{"text":"The Astor sits in the middle of it all, Bourbon and Canal, central to the Vieux Carre/Fren","useful":10,"cool":6},"7knhzNlHgLrNX5fG_3z1zA":{"text":"Stayed here our last night in NOLA. Got a really good deal for the night on a double room.","useful":3,"cool":2},"Qrq2sOyrzw3yxY0fP5qbiQ":{"text":"Aside from the hotel location, there is nothing redeeming about this hotel,  It is old and","useful":0,"cool":0},"3p2Q8Dof7a54Cm2KC64dXw":{"text":"Ahhh, New Orleans. This hotel honestly couldn't get much better. It's on THE CORNER of Can","useful":0,"cool":0},"zGh97gk4LPmaeDFUhc9_xA":{"text":"This place was very disappointing . The pictures do it no justice , looks way nicer in the","useful":0,"cool":1},"HlE9KHlzKvjS83NbO6kBIA":{"text":"The staff here was very nice and helpful. The lobby is gorgeous with its New Orleans charm","useful":2,"cool":1},"F3cihjvmhWv6GdFYkTCPFQ":{"text":"I'm unsure of what people are talking about when they say they had rude customer service, ","useful":0,"cool":0},"wsCKpKHpOHUubyhplAvUNw":{"text":"Contacted IHG and they offered me \"points\" for their rewards program, took the points. Wou","useful":0,"cool":0},"Dix-n2el4u6ij5cGSPjByg":{"text":"Overall the hotel experience was not bad but the housekeeping wasn't so great. First off, ","useful":2,"cool":1},"NBg3DZ-Bt8A8oYvrMZGqog":{"text":"I totally forgot to review this place last weekend while in New Orleans. My friend and I l","useful":2,"cool":2},"aqVSUuw6XG-CvVMF1eLoTQ":{"text":"I honestly expected a lot more from this place seeing as it was listed as a four star hote","useful":5,"cool":3},"6HxM3eKW5xPyF6FSsjEJew":{"text":"Wedding Night from Hell:\nWe booked our room for our honeymoon weekend. We booked the room ","useful":0,"cool":0},"StY8SjCOmhv7NGzpYuSW9g":{"text":"The reviews on here scared me straight! Why did ya'll do that to me? I was going to cancel","useful":6,"cool":3},"EFTdBclCoRV57MJiX3CfWA":{"text":"I don't know how to put in words the great service we received by Keionne at the front des","useful":0,"cool":0},"9G6D6qfjX9osD302gxc6iQ":{"text":"This was my second visit at this hotel. The room looked very nice. The bed was horrible an","useful":0,"cool":0},"H0tUkv6i2N8rrC3rxIyteA":{"text":"Should've read the reviews first.  No shuttle service as told there would be when I made m","useful":1,"cool":0},"OkhJJYtwpiZYCkASgXEvdg":{"text":"This is an ok hotel... the lobby is beautiful, but once you get up to your room, it's noth","useful":0,"cool":0},"ZaGG7nkzGlwBTWbLdmCZ0g":{"text":"All I can say about the Astor Crowne Plaza is location, location, location, location, loca","useful":1,"cool":0},"XmXp5dLO9YL9q-f4qRUsag":{"text":"I was torn between 3-4 stars,  I've seen some people have gotten a room here for about $10","useful":6,"cool":0},"xWjfqNr-BtwuZgieLFNhQw":{"text":"Wish I could put a zero star review. Lobby is gorgeous but went up to our room and it was ","useful":0,"cool":0},"X-9Qz-FYf15jq4oV1iUQxg":{"text":"If you are wanting a good nights sleep, then move on down the road. Here is the pros and c","useful":0,"cool":0},"5iS6QHJv2OwzDqNooTreDg":{"text":"Worst hotel ever. Apparently management changed so for the price of $400 plus dollars duri","useful":0,"cool":0},"YRbQdPYuRWdOwz0ynG4F1g":{"text":"LIVID! We reserved the biggest room, they confirmed it and gave us a small standard double","useful":0,"cool":0},"Q9KcZEweOEs5YFG6Reqs2w":{"text":"We booked a two night stay here via Expedia.  I regret that we did not read the yelp revie","useful":2,"cool":0},"w03JpCwiFTf8xe7Z5XnK1g":{"text":"I will say that the hotel was very clean, the beds are comfortable. However the lighting w","useful":0,"cool":0},"uSRBvDEJgma-LPbNXwic6w":{"text":"If you have an opportunity to stay at a nice hotel in NOLA, do not choose this hotel. I re","useful":0,"cool":0},"nYIg1GD2jq3Z9Y4VOZGzNQ":{"text":"We stayed April 30th through May 2nd. Had a wonderful experience. Room was clean and nice.","useful":0,"cool":0},"Yl1TSrZ0lB5H9DUhAwgRXg":{"text":"We were placed at this hotel after signing up for a time share presentation we found on Ha","useful":16,"cool":15},"7XiGyH6ypUoInfZP1uaBzg":{"text":"From staying here before, I knew the customer service would be a hot mess express. \n\nCheck","useful":4,"cool":1},"Q3npBvSRy3N9GvQ9lbVlgg":{"text":"Upon leaving the hotel my vehicle was returned by the valet with a shattered drivers side ","useful":0,"cool":0},"oJ6w-CVZMyt6s8bZBHy1Xw":{"text":"Dated, old hotel with really uncomfortable beds. It did have a nice sized TV, but staying ","useful":3,"cool":1},"_avDW3d9dcvpjFpzTKOAwA":{"text":"First time stay at Crowne Plaza Née Orleans but not my first trip. \n\nThis hotel is located","useful":1,"cool":0},"DEb_pomKhvrfYix5K0dHZQ":{"text":"I stay here for Mardi Gras and booked a king suite. The room was nice right on the corner ","useful":0,"cool":0},"AIdvHVsM-nLykor77t5Zhw":{"text":"While proceeding through the check-in process our less than helpful staffer refused to loo","useful":0,"cool":0},"82tXVwIfPXKTEYytyrYhAg":{"text":"Nine of us  planned a 3 night stay at this hotel due to the good reviews but we should've ","useful":0,"cool":0},"6EPrQ062l86s_mMf-5G2qQ":{"text":"From the start, this hotel was great. The security guard at the front was super friendly a","useful":0,"cool":0},"Hj6QDg9YX3DJHEhIoGAMZg":{"text":"My wife and I were in town for a convention and stayed at the Astor Crown Plaza. As an IHG","useful":1,"cool":2},"TX0kU2CXrPPI2Tfv9kLwnA":{"text":"My wife and I stayed at the Astor for one night recently on our way to Georgia. It was a l","useful":0,"cool":0},"tEzXtA9sC_E8ni-0B7IAQg":{"text":"I just got home yesterday after a three night stay at this hotel.  Let me start by saying ","useful":2,"cool":0},"-6e7i2rfXidjT5xcjHnnxw":{"text":"DON\"T stay in this hotel !!!!!! Our children treated my wife and I to a stay in the hotel ","useful":1,"cool":0},"DXL2ZjufLK-80XUkw7qj9w":{"text":"Don't let the pictures fool you. This is actually a very old building. Probably the only t","useful":0,"cool":0},"SgpkbYT09DIQiR0ltov-XA":{"text":"My room was average at best.  The shower head and valve were broken, and I was barely able","useful":0,"cool":0},"PhNHtf1OM73htALW-9wybQ":{"text":"RUDE front desk people. They totally screwed up our payments and we tried to talk through ","useful":0,"cool":1},"ofVe-uGInFEBzghY5rBwKg":{"text":"My family and I stayed here while visiting my brother for his birthday weekend. Our flight","useful":1,"cool":0},"c6lbFhZUckMJoMnc7AWgrg":{"text":"Well after a week's stay at Aster Crowne I have decided to post on our stay. I have stayed","useful":1,"cool":0},"8y1jpOlOGgCQbDS1IUhT-A":{"text":"The staff can care less that your there and are rude, unhelpful, unprofessional, and simpl","useful":2,"cool":1},"fJ4xlyqhl6C-DSmbLYYF6Q":{"text":"For starters the location is perfect if you're going to be eating and drinking on Bourbon,","useful":0,"cool":0},"PLd0PoCadeoxG8DKq-M4Pw":{"text":"Great location, literally 10 steps away from bourbon st (French Quarter) \n\nThe staff at th","useful":0,"cool":0},"IfPkOtti6TX7qVWjW8plxw":{"text":"Omg... this is one of the worst hotels I have ever been to. And I'm not just saying that b","useful":0,"cool":0},"RF4VbJnPMNO_4N6rSN3BHg":{"text":"This hotel seems nice in the lobby but once you get to your room it smells dirty the carpe","useful":0,"cool":0},"--lyKdZAvCDyoqXxqmU3lw":{"text":"The hotel was actually really nice my friend stayed at the one in vegas and it wasn't as n","useful":2,"cool":0},"J7VQOqCwNoxQ3JVgY4Whog":{"text":"It would be less but the i couldn't try out the gym and the location is very good. If you'","useful":0,"cool":0},"giU1hOw_ZEiyKz3tp4nZoA":{"text":"Booked one night stay to end my boyfriends and I spring break. We were promised a nice roo","useful":2,"cool":1},"MKE7A4YgQa8R8XL14QTS9w":{"text":"I have to be honest, I was not a fan of this place. The check-in and room experience was f","useful":2,"cool":0},"sEmh2YSJZJy4lD5Eusif4w":{"text":"AMAZING LOCATION! But When you go to New Orleans, expect to be thrown in to the New Orlean","useful":0,"cool":0},"78y3kgEdyXqdJWRtgBEz4g":{"text":"When you think the \"Crown Plaza\" you thinking your stay will be extravagant. Well the vale","useful":0,"cool":0},"iORAnFJOhYG07DIiexUpPQ":{"text":"Great location next to Bourbon Street in the French Quarter and a large clean spacious roo","useful":2,"cool":1},"-vZrsT6y5iTu9WxZb7gtnw":{"text":"This is a nice hotel. I could not decide between a 3 or 4 star review as we enjoy the loca","useful":2,"cool":0},"l2qZOxB59L4LecA1eiJi9Q":{"text":"I'm someone who RARELY gives two stars...look at my profile for proof. I'm not one of thos","useful":4,"cool":0},"dY-1sDpF8EvqZwTuGQ5ObA":{"text":"This was my First time in NOLA! Stayed at the Crowne Plaza French Quarter the only good ab","useful":0,"cool":0},"uhJgLNRdvegxsuS--7P9tA":{"text":"I've stayed here a few times now and I can say that it's a nice spot if you want to be wit","useful":7,"cool":5},"M-vHTvBm3X4jJYZRE7ONuw":{"text":"Here for the Sugar Bowl. Paid super premium for this room.  Upon arrival we learn that val","useful":0,"cool":0},"GPvAs7n3bYcclfUiuRW2Vw":{"text":"Great spot for the price and location. Located right between Bourbon and Canal Streets, yo","useful":3,"cool":2},"yCwX3Dr_5thVLG9qrO3rRw":{"text":"This is a perfectly-placed hotel for out-of-towners for events like Jazz Fest, Mardi Gras,","useful":1,"cool":0},"ZiU5_Bk-iMdxhypzTr9pRA":{"text":"This is the absolute worst hotel I have ever been at. I am here now. I didn't make the res","useful":0,"cool":0},"QidlBcDgJJNknspKNVVMwQ":{"text":"Shitty service, if you lock your key in your room don't bother using the phone in the hall","useful":4,"cool":0},"Zc30tpHbew_ptgEEO7LpDQ":{"text":"I recently stayed at the hotel and while the room was okay, the odd thermostat, the spotty","useful":1,"cool":0},"SWZGi0iyy7dTfTv55661Mg":{"text":"Our stay at the Astor Crowne Plaza was very pleasant. We stayed three days two night. We d","useful":3,"cool":2},"rPbC9Nhxnb9hUrHNC6Nn9w":{"text":"I'm being generous giving them three stars. We arrived and everyone was nice when checking","useful":1,"cool":0},"SUQz-LQnNO2b94-ufyt_SQ":{"text":"I have stayed at this hotel twice. Once was with a formal and once was with a group of fri","useful":0,"cool":0},"vAJ-RieJGHbv1kPCpUCLeQ":{"text":"I give two stars because the Hotel is beautiful and located in a prime location. \n\nHowever","useful":1,"cool":0},"aSsnje_7ZNnfLCFlBNAT6Q":{"text":"I came here during the Christmas Holidays and really loved this place. Great service, frie","useful":1,"cool":0},"x0HVaqM3slBvlu82C7ShuQ":{"text":"Perfectly situated hotel. In the evening they have an officer in the lobby ensuring the cr","useful":3,"cool":1},"Qfvf3fi7VV3VXWwDRP3pCQ":{"text":"I stayed here for 8 days in early June. I am a Spire Elite member of the IHG rewards club,","useful":4,"cool":6},"HYZh3QpTCj17uAOBod3R8w":{"text":"Very nice hotel,  I'm a rewards gold elite member so I'm accustomed to this chains hotels.","useful":5,"cool":2},"hQutOyGtk_axXuERANMNnQ":{"text":"So please read everything before booking here even though I am giving it four stars. \nThe ","useful":4,"cool":1}}