{"P3okr6Um6lOHp5UZvgnu0g":{"text":"One of the best parades in town featuring the treasured cabbage throw.","useful":1,"cool":1},"Uhe_pk0cV5dDtrp8ZWPdQA":{"text":"This is a fabulous day long celebration of St. Patrick's Day.  Pretty much every bar and b","useful":2,"cool":1},"WuFvMFCxiRSJzHNRt9ITkg":{"text":"The St. Patrick's day parade is a lot of fun.\n\nWhile technically a parade, it has more of ","useful":7,"cool":7},"siPPQYnKFsx9cxKkl8p5Yg":{"text":"I might be talking about a different parade than the posts from last year, because the loc","useful":1,"cool":1},"POecrSTTOslHnsTtZrP3Aw":{"text":"Not the best NOLA parade, but worth a look if you want some of that classic American-Irish","useful":2,"cool":2},"_WCIK_FdLcvvD4B2VAgvPA":{"text":"Gotta love the Irish Channel St. Patty's Day parade!! I like that this year they added bar","useful":2,"cool":2},"ghgygHj7sl8SnT5xGvRWbg":{"text":"The parade is just, meh, but the party is a blast.  It's no surprise that the floats are s","useful":3,"cool":2},"hfSKP4LQJNwXT6zTd4r6Sw":{"text":"Why the sudden drop of two stars? My past review still stands as a hell-of-a St. Patrick's","useful":8,"cool":3},"ZMV7nwEmlcUQ8qmuPtRNEg":{"text":"I guess if I want to review parade I have to add them. I accidentally added my photos to t","useful":5,"cool":4},"Q8-Bsa1wGRNtGOpIMtv3eQ":{"text":"A great day parade that weens you off Mardi Gras! \n\nSo a week or so after Fat Tuesday, Car","useful":9,"cool":10},"btJ79-UB5DHGVNuxGGcecA":{"text":"A parade in New Orleans evokes a certain mental picture -- huge intricately decorated floa","useful":6,"cool":6},"g9YN7WmLZlLfNv1KwIDhcQ":{"text":"This parade has got to be one of the reasons why New Orleans was recently ranked the 2nd b","useful":3,"cool":2},"kDoY9JSmipCv5xybZqRdDA":{"text":"Had an awesome day with my family watching the Irish parade. I caught a few cabbages. I'm ","useful":1,"cool":1},"hKxMCxIrTUa6dDGqVZdXOg":{"text":"I had heard stories of the St Patricks parade, throwing cabbages, kissing on the cheek for","useful":10,"cool":9},"NKmgNxobCyqt_Du4DReesA":{"text":"Oh look. It's time for more parades. But this is a totally different experience than most ","useful":5,"cool":5},"-i3YZWC-hTt7j6Vw-RNdSQ":{"text":"This is a true New Orleanian parade with most of the tourists gone through the neighborhoo","useful":15,"cool":16},"aRzUbtlGYQKktYNY7_eJSA":{"text":"This is one of my absolute favorite days of the year.  It is a non-stop fun and insane tim","useful":2,"cool":2},"GlBSWOHqrq1aofvH_HBHEQ":{"text":"I feel like New Orleanian's motto should be \"Can't stop, Won't stop\" Just having survived ","useful":2,"cool":1}}