{"TjsAslzgIYTp_usYF6pkMg":{"text":"I just returned to Chicago from a 14-day road trip that led me into the French Quarter in ","useful":0,"cool":0},"b0gccjHYYBOYUl98W-nXQg":{"text":"Overall this place is great... I'm not a fan of tofu, they put it on a poboy with avocado ","useful":0,"cool":0},"oNlMnDuWgg7i6o2o3xXcSQ":{"text":"Came here as a drunk tourist on a whim, but the vegan deluxe bagel sandwich was pretty goo","useful":1,"cool":1},"MIWLoKTTm8jd8G75k6xvIQ":{"text":"When they say \"small mart,\" they mean a couple of bananas and some candy bars. I can't rev","useful":0,"cool":0},"lxBoJXAqwT3OXYeoN_-qXA":{"text":"Hidden gem among the bustling generic restaurants and tourist traps.\n\nWe came for some wat","useful":2,"cool":1},"axaH2mDSFCYaki6GTreGJA":{"text":"Small Mart is such a breath of fresh air. Flavorful fresh AFFORDABLE food made daily, tuck","useful":3,"cool":2},"cBRiPj7ul2G82JMNbBhUXA":{"text":"I've pretty much eaten all the bagels this city has to offer, and Small Mart, after much a","useful":2,"cool":6},"9luNDhVeRZt3UDvuMmR0QQ":{"text":"This is an appreciation review for really one item that I've been getting two days in a ro","useful":0,"cool":0},"_p7EB8R0Adn8sUBD4dMibg":{"text":"Love this little shop! I eat breakfast here on my way to work almost every day. They make ","useful":0,"cool":0},"AmEKTM6neRBzuItemNmeHQ":{"text":"Love! Delicious vegan bagel (reaaal bagels!) \n\nHaven't tried the curry yet but it's on my ","useful":0,"cool":0},"nP6ZTWnqKWkwbFesQuoGTg":{"text":"Tried all of vegan baked goods, had a oatmilk chai, and went back again the next day! Had ","useful":0,"cool":0},"BN9fcjjfl3PPQt1ZxC-J2Q":{"text":"This place has delicious food, but a solid 75% of the time, are out of honey walnut cream ","useful":0,"cool":0},"H3qKmQzAaPIc_zUDFJ8wkA":{"text":"Wow! That's all I gotta say, just wow! \n\nOne employee, his muscles were INCREDIBLE, he lit","useful":1,"cool":2},"eILwiyRIS3X2bF70CxW6Rg":{"text":"This place is a blessing and the owner, Bryant is a glorious angel of a human. Definitely ","useful":0,"cool":0},"eh3Dm693BfFQ1a-136-kMA":{"text":"Best bagel place in quarter. After several days of eating out at breakfast places I wanted","useful":2,"cool":2},"xqKV_tKYxM2gRtaZefda4w":{"text":"Whoa.  Blown away with how good their curry was.  In love after one bite.  Top 3 curries o","useful":1,"cool":0},"KuVCScU-9rPw4XLo5ovkPQ":{"text":"Just spent a week in New Orleans and got a bagel from small mart almost everyday. Bagels a","useful":1,"cool":2},"iZ6EKBmifsyfRpUv-pK2FA":{"text":"I loved Small Mart and their cute little  vegetarian sign right on an awning on Decatur St","useful":0,"cool":1},"B9DCoxzNdqGJot9YiKNeFA":{"text":"Wow!  I've been here twice and it's just great. The first time was for breakfast and I wen","useful":0,"cool":0},"3Fa3GzvJPB8pE3VHfMdslA":{"text":"stumbled into small mart because the vegetarian sign outside caught my eye. this store has","useful":8,"cool":3},"dMvzdeRlBE6ZFE_2xg8Jqg":{"text":"Amazing variety of offerings in this tiny establishment. Pumpernickel Bagels! Wish it was ","useful":0,"cool":0},"a_p1bNAdKQFepeio1Yqoaw":{"text":"As I was leaving the quarter, we popped in here because we needed beverages and what did I","useful":4,"cool":4},"MaOXOYh15__EjcGiB8PzOw":{"text":"The bagels are amazing with a great selection on cream cheese and add ons! As a guy from t","useful":1,"cool":1},"VANNukNruazL5jbDUpclVw":{"text":"As a vegetarian having just moved here, this place is a godsend.  Vegetarian, healthy, and","useful":1,"cool":1},"1LQIFLY4x2lZe0JZyXg2Jw":{"text":"Fantastic GF food!! I highly recommend this spot. Fantastic simple and fast!! Definitely a","useful":0,"cool":0},"eihYfXUIbRRAk5xCwUrYRw":{"text":"Loved this place! I ordered the vegetarian PO boy with avocado, chips, and a green apple F","useful":0,"cool":0},"gUpmCjm9KaXPMw5GvIieqA":{"text":"Excellent Food. Great prices, quick and friendly service. Chaat bowl and Tofu Poboy were b","useful":0,"cool":0},"qtS5srXEBJfLmFUtCizXnA":{"text":"The best damn bagels in the city. They have the most variety and best quality of bagels an","useful":1,"cool":1},"oGcpR1XA1oEkrcIScB6wUA":{"text":"I eat here 4-5 times each time I visit New Orleans. The vegan po-boy and the curry dishes ","useful":0,"cool":1},"2qMX4sJCkZEz5OTEFO5z2A":{"text":"Simply the only place to get a proper bagel downtown. The coffee is also tasty, and the pe","useful":2,"cool":2},"0sGMQvuPUek0Bbo-qHelqw":{"text":"Wow. Overrated and overpriced with a side of unfriendly service!","useful":0,"cool":0},"N5UL2TMG09XBVGjoGus47w":{"text":"Why'd y'all leave Decatur? You filled such a need in the community. Also there was no noti","useful":1,"cool":0},"FAWCtaoJI0mc0gazHQ1e3Q":{"text":"I moved to the French Quarter from the New York area four years ago, and I have spent thes","useful":2,"cool":1},"xwsf3Q4WE0L_FYHDa4rpKQ":{"text":"A must-try eatery in nola! Bryan has a diverse menu for all diet enthusiast! Amazing custo","useful":1,"cool":1},"VKyVFYK1YnzF94OElU7PHA":{"text":"First the bagels are super fresh and the schmear is liberally applied.  No beer keeps the ","useful":1,"cool":0},"VYYEwZcK0LLeJ5nDYwhEcA":{"text":"Great food but prices has gone up!! $31 for 2 fancy bagels without service and eating on t","useful":0,"cool":0},"bDXD1BWw6Q3gTjbKL9mz6A":{"text":"the service was great, the Norwegian was to die for, and the mango lassi was the perfect p","useful":0,"cool":1},"7X_Ew5MSI3o5jSwj1H_KXA":{"text":"Haven't had a good sesame seed bagel since college in NY 10 years ago. Delicious bagels an","useful":0,"cool":0},"_rx2mGTtMlNjgp6ML-Rk4w":{"text":"tl;dr New York bagels (seriously, they are boiled in NYC and then baked here) with a super","useful":4,"cool":6},"zf-Cks6CnaL-XOn_LfwQ5Q":{"text":"This little spot is amazing! The customer service is top notch and the food is incredible.","useful":0,"cool":0},"NRe5uQmmu_-86r0FrnaBCw":{"text":"This place was recommended to us by the guy who works at Green Goddess. Don't be deceived ","useful":2,"cool":2},"YjYuUG_6nTzB4tMjuGUP0w":{"text":"A friend recommended this place for the kombucha on tap but after the delicious bagels and","useful":2,"cool":1},"bY99dKjFkW4g3OgFnRRT2g":{"text":"*Moved to 2700 Chartres \n\nThe vegan poboy (I got pakora instead of baked tofu) is worth th","useful":1,"cool":0},"KTervpH-2fhZR1w1nSt-7Q":{"text":"I finally went to this place after hearing raves from people I know who live or work in th","useful":2,"cool":1},"-1-1xznfWiQHxGzDE8bC3A":{"text":"I cannot say enough about this place!  The owner, Bryant, is such a great guy and so accom","useful":0,"cool":0},"Eiex4qjwGwhJWhWtSfLtIw":{"text":"The vegan vegetable curry is fast, delicious, seemingly healthy, and it costs $6. I honest","useful":3,"cool":3},"I3BgnJfHngdU07DYxQNjhA":{"text":"Wow. The best vegan food I've had in many years. The pakora samosa combo with rice was del","useful":0,"cool":1},"cpBjkXz2HzVqdsMyxVOj1A":{"text":"I love there vanilla cappuccino amazing  no bitter taste and Service was very nice\n\nThank ","useful":0,"cool":1},"H4RyyTFLHDJXjofUTZsTLA":{"text":"Incredibly nice people & amazingly delicious food! The sammies are perfect. My favorites a","useful":0,"cool":0},"-cen9nQPE3UUM75AucjZEQ":{"text":"Fantastic bagel sandwiches! I recommend the Mediterranean (bagel/lox/cucumber) but my wife","useful":0,"cool":0},"46nWURu5wc7dowj-NoDJgQ":{"text":"Shhhh hidden gem in the French quarter! If you are vegan or vegetarian RUN here!!! New Yor","useful":0,"cool":0},"9Y7drNPndUH7VB1cH06C2A":{"text":"I was having a meeting in the neighborhood and was looking for a veggie-friendly place and","useful":1,"cool":1},"ffGS-yy2mH_lG1L66tS8EA":{"text":"small mart is the saving grace of lower decatur. everything is delicious and it's a safe h","useful":0,"cool":0},"LN3-Z1Vr4rON4HEUx-zPPg":{"text":"If you want the best bagel in town, stop here. I can't recommend this place enough. Also, ","useful":0,"cool":0},"pbRh6ryAi5s3EmpppAVqoQ":{"text":"I got the Chaat Bowl and I was pleasantly surprised at how good it was! It's all vegan and","useful":1,"cool":3},"AVFnjsPJYPleVYZbyIu8Kw":{"text":"A vegan po-boy for Joi?! Small Mart opening up just a hop skip and jump from my house is a","useful":24,"cool":24},"heR6-8S-11xri3MX9kwh3w":{"text":"This is my favorite little food spot by the Marigny/Bywater. Lots of great vegan and pesca","useful":1,"cool":1},"zF12v7t6KUhXOsd-la9GCw":{"text":"I really enjoy small businesses and supporting them. The staff at the new location of Smal","useful":0,"cool":0},"YgMTsDSeW9bzstQvx74Y1A":{"text":"I got the Norwegian bagel sandwich, a brownie, and an iced coffee. The sandwich was great.","useful":4,"cool":3},"ZAKGXYUuHXtUpSIE5vh_pw":{"text":"Definitely one of the best veggie burgers in town! I absolutely love this place, the india","useful":0,"cool":1},"nZkZiqoJWEWhCLRQfcEiPA":{"text":"Excited to have Small Mart in the neighborhood I frequent. Its a great place for vegans an","useful":0,"cool":1},"X-13BGeScL1krGZypsUzsg":{"text":"We walked over with 4 kinds under 3 years old and they were so nice and accommodating. The","useful":0,"cool":0},"hLsw5LmCkH-e7GdcYLuVXg":{"text":"The new location is bigger and brighter but still pleasantly low key. Nothing fancy but yo","useful":0,"cool":0},"b5tHSOtAExOINBHKeVtjUA":{"text":"I'm not even a vegetarian and this is some of the best food I've had in awhile. I got the ","useful":0,"cool":0},"-IJ9rDQJ3as8FC9UuJEbAQ":{"text":"Small Mart is THE hidden gem of New Orleans!!!!!! Open 8-8 everyday, with the MOST amazing","useful":5,"cool":4},"IgEXManQG5PAhx0OY_B_hg":{"text":"As a recent re-arrival to New Orleans after 27 years in Manhattan, I set out to find the b","useful":3,"cool":1},"65fqS7u7tXmo8G1RzAsWCg":{"text":"Pretty delicious bagels! I had the onion bagel with chives cream cheese with salmon and it","useful":0,"cool":0},"AaVm3GwZ1poqzhGpUS_QXg":{"text":"I ordered the Norwegian. The sandwich was good but definitely overpriced. They gave me 1 s","useful":1,"cool":1},"_4NfH_h_C3c5Zn4wVUrOGw":{"text":"I love Small Mart so much that I hesitate to write this review and reveal how amazing they","useful":4,"cool":4},"qZ1VIx5SYO5lzOAHJdeGGQ":{"text":"Wow!!! So upon a recommendation today we tried small mart for a quick bite while our on ou","useful":0,"cool":0},"dHAN3tVFhNu45dQ3oG0sqw":{"text":"This is a lovely place for getting snacks and breakfast. I no longer eat bagels but I've h","useful":1,"cool":1},"8mA_WfWjbFEu_AvbhMn-cA":{"text":"Wonderful freshly in-house-made bagels. Delicious vegan foods. Very good friendly service.","useful":0,"cool":0},"rOwgMRclFeDzW6u_uaBgQw":{"text":"Stopped in after a day of biking around the city. A friend of a friend suggested we checke","useful":0,"cool":0},"OHMk1F8vd9TWVv2mpYdoRw":{"text":"Friendly staff, delicious food, fast service, and plenty of options for vegans and non-veg","useful":1,"cool":2},"qqQuOix5D_yVHwPS_QiwJQ":{"text":"This place is fair to good depending on what you're getting. I've tried most of what's on ","useful":0,"cool":1},"KctrmJGnYLzcgKIwOYHRAA":{"text":"Where do I even begin?!? Small mart is amazing, the owner works super hard and is always t","useful":0,"cool":1},"8Fc6IBbNXsmls_7TriuYyQ":{"text":"Everything is so good here!!\nsuch a gem!!!\nGreat lunch spot!!\n my girlfriend is not vegan ","useful":0,"cool":0},"QS_2EGsDT_qFp-W9rg8tbg":{"text":"One of my favorite spots! Doing the best and most during COVID and still serving with a sm","useful":0,"cool":1},"zsiywojOV7VZCj_lhQjHsg":{"text":"Small Mart is the most wonderful hidden gem! They're a staple in my week. They offer the m","useful":0,"cool":1},"4BHUG34D3fXIHA26DQc-PA":{"text":"Update: bagel also slaps (is very good) . Both actual bagel and bagel prep are on point ba","useful":0,"cool":0},"pB8Zsx9UT1-vys0Xrj1KwQ":{"text":"Great indian food, seriously great indian food. The spice - just right , even for a gringo","useful":0,"cool":1},"Kv5WJajZIvmEworZlX0LPQ":{"text":"I just have to re-review Small Mart bc it is my absolute FAVORITE and I so appreciate all ","useful":12,"cool":10},"OwiJITzxaUg07yNVcI4pYg":{"text":"Delicious - the best bagel I have had in years. I asked for extra veggies on the Gringo ba","useful":0,"cool":0}}