{"ZHKsXoNnjGo9QBHuoCZCUQ":{"text":"So so hotel. Room a good size.  Air conditioning not great.  Very busy hotel it seems.  No","useful":0,"cool":0},"h4JmFHOzhjSAqpa9bQ7lGw":{"text":"I stayed at the W Hotel during my visit to New Orleans for Mardi Gras.. The location was g","useful":1,"cool":1},"5EKVY3OQoJSBhPlvS1F_Mw":{"text":"I'm staying here for business because I prefer Starwood and we get a good rate. Plus I lik","useful":0,"cool":0},"on1Lqf1-eK3WniOcRUNiGg":{"text":"A perfect New Orleans hotel.  The room is a nice size, they have a mounted plasma, a full ","useful":1,"cool":1},"ykjxwAG2VrU_uQ-WQ0seMw":{"text":"I had a great stay at the W New Orleans!\nBefore even arriving, customer service was workin","useful":0,"cool":0},"hpcjSomJhGhecPF2xVLrOQ":{"text":"I love the w and they are pet friendly even with my 3 dogs - always great service no matte","useful":0,"cool":0},"KyY07tbBptANoib_oX5c1g":{"text":"My first experience at a W hotel, staying six nights ostensibly for business with nightly ","useful":0,"cool":1},"lQSYOM8Rn47_0_rhRHSkiQ":{"text":"Stayed here with 5 friends on my recent trip to New Orleans.\n\nOur relationship with this h","useful":3,"cool":1},"zsdiMeEVGunbEtAWcCeG4A":{"text":"This place needs a GBU review, so here goes: \n\nThe Good:  \nThe staff here is wonderful.  A","useful":0,"cool":0},"te5JN5edSqKtobIhipqbsA":{"text":"I stayed here a week about a year ago for a convention for work. The convention was actual","useful":0,"cool":0},"6tyTaiJtmMJNjIg1dWthEg":{"text":"Although. Am not updating my number of stars I will commend them for responding to my emai","useful":1,"cool":0},"Zac1TrmAo8ME2hz8nVYrgQ":{"text":"The rooms are average but the great customer service is why I give the W New Orleans 4 sta","useful":0,"cool":0},"J9OofQbNm6Dk_-eiF9tdyQ":{"text":"Love this trendy hotel with a great location. \n\nThe only complaint I have is every time we","useful":0,"cool":0},"u9aLn0a1WD2Oh0Pe7_DfOw":{"text":"The rooms were reasonably large, the bed decent, the staff friendly and helpful. But this ","useful":0,"cool":0},"rU9lfKhG1Le9fo2zvFBkmw":{"text":"One of the nicer W hotels we've stayed in - more because of what they don't do rather than","useful":1,"cool":0},"oCaJUs47s6IqVjaqCD1HOQ":{"text":"I'm a big fan of Starwood hotels and W Hotels in particular. This was a disappointing expe","useful":0,"cool":0},"PVZsC_C5U2ukA2W_9Fq4nA":{"text":"I haven't stayed here yet but I want to give a review because the sales office, Beth-Anne ","useful":1,"cool":0},"ikaCBR68-q_j-SozgmrPnA":{"text":"I went here 6 months ago and I enjoyed my stay. I went again in June 2014 and it has turne","useful":0,"cool":0},"AVbtlHjdBGSVlWRhzgpQYQ":{"text":"I was expecting this hotel to be like the one in Union Square in NYC, it is in decor but t","useful":0,"cool":0},"vLEzzfPIaYjnjhZU6PqT6Q":{"text":"Two highlights of our stay at the W are:\n\nTim - the young valet guy who was a sweetheart.\n","useful":0,"cool":0},"2TZ3avEyzIrEbnX-myNrng":{"text":"I just love W Hotels.  I have not been to a bad one yet.  As mentioned in many of the othe","useful":0,"cool":0},"q8VgBCNbrrQy3GJ3VGuCkA":{"text":"I love the W Hotel with their Whenever/Whatever attitude, however it just didnt have the s","useful":0,"cool":0},"e3JrJimruNtIeVVw7_ZI-w":{"text":"Room 807 has an immaculate view of a parking lot. Not very clean. According to wifey-the B","useful":0,"cool":0},"lsu3IUmCG8gIuCyX8GYqQA":{"text":"- Comfortable rooms\n- Great A/C control - I got my room down to 64 (which is needed in thi","useful":0,"cool":0},"KNtt_SPFqNHl8B1rakRf4g":{"text":"I need to confess something, W New Orleans. I - ahem, we - did something naughty. \n\nWe wer","useful":10,"cool":9},"HxDFnCQp9L_XEmEAcYCpBQ":{"text":"I've stayed here three times over three years for business meetings, so I have a bit of an","useful":2,"cool":0},"TQibbV8yBA2UAz-mitQE5g":{"text":"I'll start by saying that I loved the decor of the hotel, the room was relatively big, and","useful":1,"cool":1},"mWcLPy0WKD-5-EZWExgVEQ":{"text":"I was really impressed with my stay at the W on Poydras. The staff was extremely friendly,","useful":0,"cool":0},"TYLfG-rUs1Sc0Uw28H6tyQ":{"text":"One word: DIRTY. I would never stay here again and would not recommend to anyone. \n\nPROS: ","useful":1,"cool":0},"groG76du2Guz7cZjCf3shQ":{"text":"For location this place would get 5 stars. Across from Harrah's casino, easy to find.\nTHE ","useful":0,"cool":0},"e3bUoxkgDmC7Blos1Wwsuw":{"text":"This is my first W experience. While I like the lobby and stuff, i am not the biggest fan ","useful":1,"cool":0},"4xzLKyqq7BZd6l9j1KrHtQ":{"text":"Class A DUMP!!!\n\nPutting a sexy bar and lobby in doesnt take away from the fact that this ","useful":1,"cool":0},"vmTVT2uW3hPjRBI8Gw0YLQ":{"text":"Ok, so the location is perfect. The rooms are nice. And there's a great gym, pool, restaur","useful":0,"cool":0},"h8a9ZBwp5SMeP84o1bHn4A":{"text":"I'm not into staying at fancy overpriced hotels. A Best Western would suit me fine, but my","useful":2,"cool":0},"Uf27KgcwASRRs21YT-Z1bw":{"text":"** Travel Advisory **\n\nThis hotel is currently under construction. \n\nI am in New Orleans f","useful":0,"cool":0},"XOFjxCLl5nyerpQN_kdUQg":{"text":"I have been to a lot of W hotels for events and the like, but had yet to stay in one as I ","useful":0,"cool":0},"-F7Gop6beix4Aq19fu_vTA":{"text":"This is easy for me, since I paid the family rates for this room when I stayed back in Jun","useful":1,"cool":0},"0xJYARjImiY6QQTNFB93Dg":{"text":"I just wanted to give a kudos to the entire staff of the W New Orleans. I had an awesome s","useful":2,"cool":0},"xWeEc4vZo0Yx1g0FXVdiOw":{"text":"NEVER STAY HERE. DO NOT WASTE YOUR MONEY. THERE ARE MANY OTHER VERY NICE AND ACCOMMODATING","useful":1,"cool":0},"lZ07kaUQljwmNieItn2-BQ":{"text":"W Hotels have a higher expectation for me than this one delivered.  The only good things w","useful":1,"cool":0},"W_hAqCF4_4Lo8DTpAiVB0A":{"text":"**3.5 stars**\n\nI can't say I don't have a thing for trendy hotels, but I do so I was drawn","useful":5,"cool":2},"inMnkvUZxBW3gcrXbyuNAA":{"text":"The common areas of this hotel are beautiful.  The rooms are a little worn though.\n\nThe po","useful":1,"cool":1},"HH3dszi1DLClaQ6qBW1FzA":{"text":"I had to write more after we had finished our stay, I hate reviews that say things ar bad ","useful":1,"cool":0},"hT88gDRGztUvRrg6Cy3kfQ":{"text":"PROS:\nLocation - quiet area but walking distance to attractions/nightlife.\nConcierge was f","useful":0,"cool":0},"9FbQ8UaM9HbR51UQ2C81YA":{"text":"This is not one of my favorite W's, but not the worst either.  I stayed here for three nig","useful":0,"cool":0},"2j4cosXogoIH-VLr0G9ehQ":{"text":"I really wasn't impressed with this W hotel. The did offer a complimentary Acura shuttle t","useful":1,"cool":0},"Vm889JNOz6xjpwdK4L-Vwg":{"text":"Apparently they think if you paint things  black that makes it 'classy'. The hotel is way ","useful":0,"cool":0},"MByWRd6GpWdn_IlXXHYxxQ":{"text":"If I ever get back to N.O. I want to stay here.\n\nPro:\nWalking distance from The French Qua","useful":1,"cool":0},"inoCabPYPY8_aHoZiw9myg":{"text":"I didn't stay at the W but I did attend an event there so I can only speak to those parts ","useful":1,"cool":0},"E9dY4Bk_Uh0HVIseJhhMBA":{"text":"wow.  an entrance can say so many things, and I'm not talking mine.  I walked into this wo","useful":2,"cool":2},"857IHGMvRXJ1i0jSLPnizQ":{"text":"Stayed here in last week through a deal I got with my sister. It is a great location, with","useful":0,"cool":0},"tBYDK6MJIJfBn3Yu5KV5Xg":{"text":"This hotel is simply meh. The common areas are beautiful. The guest rooms are tiny. It's l","useful":1,"cool":0},"Poq_OxSc9J9DF2uMmYlTDw":{"text":"My husband and I, spent 3 nights at this hotel.  Since we were traveling from the West Coa","useful":1,"cool":1},"qY6aJSS0NUz_M0RsiH8HCw":{"text":"So glad we decided to try the W.  Got lucky with a room upgrade through American Express t","useful":0,"cool":0},"EZZNoaa9d3T0CHH8IdHfdQ":{"text":"Do not stay here with high expectations! The room was dirty, the floor stained and bed sid","useful":4,"cool":0},"Dk9CGUE14THEsM-KInnAKw":{"text":"I stayed at this location on a Harrah's comp. Upon arrival (this was my first stay at this","useful":2,"cool":1},"Sp-NyPPmPW2t-ZdZMM6ppw":{"text":"i had a beautiful room, a nice view of the river, and easy access to the business district","useful":0,"cool":0},"OYhCpWHa2NQtzz2B78ytHw":{"text":"Horrible experience at this hotel.  Room service is a joke (the salad was hot, the cheeseb","useful":2,"cool":0},"Uhr7W4r-Tyd-6zqtJwohpg":{"text":"This was my first experience staying at a W Hotel, and I'll admit that I was expecting bet","useful":1,"cool":0},"SzfQ6e9iHh4yHhYThG-wog":{"text":"I want to be clear: these two stars are for the brave employees who are suffering through ","useful":1,"cool":0},"wJrQBqaxuH7UWIRs9aQQVQ":{"text":"I'm a preferred member and this is by far the WORST W I've ever stayed at. The vents in th","useful":0,"cool":0},"04Slxt2OSfUeVL2wWjtXBQ":{"text":"If the proof in the proverbial hotel pudding is the size of the room, this W would have th","useful":3,"cool":3},"UtVolOBW7jlmIN-eVCkxeg":{"text":"Great location, just steps from the quarter.  Next to the casino and Mother's restaurant. ","useful":0,"cool":0},"HxGj6gi_4s2N8qV2dZOeFA":{"text":"I absolutely loved the Whisky Bar would stay here again just for it.  The room was nice bu","useful":0,"cool":0},"kWLNHM7y_lmMELfxu9ahGg":{"text":"Worst W ever. If you expect crisp service, avoid this hotel. Based on our experience today","useful":1,"cool":0},"R5-UaKa9Is3-5EoPtvfSNA":{"text":"Run down\nDirty bathrooms + carpets \nThey don't replace your robes.\n1 reception attendee\nNo","useful":0,"cool":0},"MyQpUIEecHlaOcJN1CSHow":{"text":"This was a great hotel centrally located to a lot of places I wanted to visit. The time I ","useful":0,"cool":0},"3y35QkSuk2wlA33S3Iz_rQ":{"text":"Unfortunately this W hotel just doesn't make the cut. It is unlike any other W hotel I hav","useful":1,"cool":1},"2AB_I1a-A5I1-j-QkhMZzw":{"text":"I stayed here a couple weeks ago.  The hotel itself is very nice but our group had a coupl","useful":1,"cool":0},"aTxo4Jy0VJzmMiSeybAwKQ":{"text":"I like W's, and the lobby & location are very good.  I really enjoyed the pool cabana, whi","useful":2,"cool":0},"8ffnOLyOFAQTq17V2OOJ3A":{"text":"I like this W better than the one in TimesSquare.  The layout is a lot better with good pl","useful":2,"cool":0},"BCGCEQPEe_eWsqwJmU1VLw":{"text":"Unfortunately, this hotel is in bad need of an update (which was already underway during o","useful":1,"cool":0},"2uh-5B5h9w8mAdnXR1US3Q":{"text":"This is my 3rd stay at this \"W\" and I'm sorry to say that this particular hotel no longer ","useful":0,"cool":0},"1eWRxzEbbP9IFyCZNG7AGA":{"text":"Location was great - easy to get to the French Quarter, close enough to trolley and bus st","useful":1,"cool":1},"7A7tEW5P1hk7f2hpwuDatg":{"text":"THERE'S ABSOLUTELY NO Reason to write a long, deep explanation on this hotel. It's current","useful":1,"cool":0},"-mTGfQ-ZO-f5irU-umRyOw":{"text":"I have to qualify my review as we did not stay there, however, it was the first W Hotel we","useful":0,"cool":1},"i9SVSiFmfk66PTAMjdV7xA":{"text":"Was in New Orleans for work and spent the night at the W.   I've stayed at a number of W's","useful":1,"cool":0},"QIjiJRbFc3YXaK3rNGrvGg":{"text":"Great hotel. We received a really nice suite for a five day stay.  The front desk was prof","useful":0,"cool":0},"nYa53xRX8T5snSapNTXJtg":{"text":"I have stayed at a number of 4-5 star hotels and by far this has been the worst. Went duri","useful":0,"cool":0},"ZepksIbtffYQS1UJC4VT6w":{"text":"Was there for a wedding in NOLA this past weekend.  We occupied about 20 rooms for 3-4 nig","useful":3,"cool":0},"iRAGkQ6OvZMcHRqSMW10KA":{"text":"I'm surprised by the negative reviews. Man, I loved this place. I stayed in one of the cor","useful":0,"cool":0},"kMHrHbxmOEjtKXE58v9Uqg":{"text":"This is the worst hotel experience I have ever dealt with. The valet service killed the ba","useful":2,"cool":0},"QFhwncrmjAtPimyrKIYljA":{"text":"3 stars is very appropriate.\n\nLet me lay the decision tree out:\n\nAre you a starwood prefer","useful":3,"cool":1},"MQ9GDJfByYh8G8aiN_TO8Q":{"text":"There are so many other wonderful places to stay in the city.  Please don't waste your tim","useful":0,"cool":0},"iZc4mjljnnDcJrh_suTkJA":{"text":"I like the location of this W Hotel because it's very close to the French quarter which is","useful":1,"cool":1},"4JUYJrEPiOKhsCA1y4myiA":{"text":"I've stayed at the W New Orleans on a couple of occasions. The proximity to the Quarter an","useful":0,"cool":0},"C6Nn9K7Tq5ALMLwLP12Suw":{"text":"All W Hotels are pretty swanky so  I expected much of the same at the NOLA location.  A se","useful":2,"cool":0},"OVs3Ax--lFczHcVdN4YW0g":{"text":"I expected a lot more from a W hotel. The lobby is fine, the staff is very nice and the lo","useful":0,"cool":0},"ht0DYBZat47JwWHuvDyy_A":{"text":"Not the best hotel I've stayed at. It's a bit old and the inbetween process from the W Hot","useful":0,"cool":0},"BgxLkHke2dsZkLzNr3CWkw":{"text":"We stayed at the W New Orleans in Feb 11 and had a great experience.  \n\nFirst, I had made ","useful":0,"cool":0},"GOXca1gIrsd5_-NokawP9Q":{"text":"I seem to spend a lot of time at the W. I love the atmosphere. Nice set-up, the lobby look","useful":4,"cool":3},"P-5V6HVEd8gan0YQj42aAA":{"text":"Really great experience. The staff was always in a positive mood and always willing to hel","useful":0,"cool":0},"nLnfOnP6tME7R4Yai8x9og":{"text":"I would not recommend anyone stay here.  The hotel is dirty, in need of maintenance, and n","useful":0,"cool":0},"4L_BUC3IXtb1usPEh8LjNg":{"text":"For an expensive hotel that is off the path for party goers in New Orleans I had expected ","useful":0,"cool":0},"AFxYoxULj7RLMmefXhfhsg":{"text":"Had a very pleasant time at this hotel.\n\nLocated perfectly for good times in French quarte","useful":2,"cool":0},"qWUAwFegZuhFnvILboChDg":{"text":"If you're under 25 and you plan to spend your entire time in New Orleans drunk, you'll pro","useful":2,"cool":0},"p614-IYPFlk4u6bewWrYCg":{"text":"A nice hotel but in need of some upgrades mainly in the bathroom. We had problems turning ","useful":0,"cool":0},"6O-y1pfzspPdlHtZ-kpRqA":{"text":"We stayed here 12/24-12/25 so the hotel wasn't particularly busy.  I wish I had read the p","useful":1,"cool":1},"v4_uhEjFD8YGrxTwB3aSPg":{"text":"I have never written a negative review before. That being said, I would say that I am not ","useful":1,"cool":0},"9DDIoNyWFrCh_WzDg-Y_Qw":{"text":"This W Hotel has seen better days.  The rooms do not conform to the typical W standards an","useful":0,"cool":0},"gPtWjd3Qn4Y-M6Oop4ub-A":{"text":"This hotel has great promise - good location, good affiliation with Starwood and remodelin","useful":1,"cool":0},"2-dY8YYdEz-LRyGmOZkNnA":{"text":"The bed was great, but nothing else lived up to our expectations.  Our shower broke the fi","useful":0,"cool":0},"d_dM2DT_jjc569JzSqTL4g":{"text":"Great atmosphere.  Great location from the convention center. Great service. A few hiccups","useful":1,"cool":0},"xzaRTJmIxGP2pdh5v1e9ZA":{"text":"They need an update of the rooms yesterday. Dirty walls, dirty floors and just a little ti","useful":1,"cool":0},"vaQop1dgZ5UAu8tixlKKDA":{"text":"Arranged travel for my film crew. When we arrived at the Hotel New Orleans, we were shocke","useful":2,"cool":0},"BT4xrrEgDMgmZaEQzluaWg":{"text":"Awesome people and close to Harrahs casino.","useful":0,"cool":1},"iVOwruZDcDESr7u1He3nug":{"text":"I'm so glad my wife found a package deal for a hotel through JetBlue that somehow included","useful":1,"cool":1},"SEA33SOIZt0k2_OPxY1fIA":{"text":"I'm just completing a 1-night Sat stay here. (Friday night was at the Westin.)\n\nBut based ","useful":5,"cool":3},"68-3N4hdCTT9pf_KGzMQ9g":{"text":"Great hotel. Nice location and look out for deals. It's only a couple blocks from bourbon ","useful":0,"cool":0},"4Aa-PbiFnbFo72bKN3MAVQ":{"text":"First, the only reason this hotel gets a 2 is because of the location.  It is across from ","useful":0,"cool":0},"dxIDRTW8lulu9ymIofnqIQ":{"text":"While the staff was super nice and as helpful as they could be, this hotel - for the price","useful":1,"cool":0},"NdyuMLTaR2vEnzq2vRVWlA":{"text":"Me giving the W a two star rating is so unusual...but here we are. \n\nWhy the lackluster ra","useful":8,"cool":2},"eig47e9A9h0yhMOT_qgZFA":{"text":"Lovely hotel - well located - away from the craziness of the French Quarter, but close eno","useful":1,"cool":0},"wFz20S6BV5A3LndyMqCe-A":{"text":"I love New Orleans, but the W brand of hotels just doesn't do it for me, and the whole pla","useful":0,"cool":0},"OzaYwfVAz-4ZPUxh5Rmwmg":{"text":"I had an overall decent stay at the W over Christmas weekend. The hotel reminds me of a fa","useful":1,"cool":0},"AFJXh2Q9JqUZBwiKRR4F6A":{"text":"We were in New Orleans for the first time with 2 small kids, We booked our 3 nights stay a","useful":0,"cool":0},"rtHiRonc7dfL-CNQA8mWqQ":{"text":"I usually like the reliability of W Hotels. I was shocked at the inconsistency here. \n\nPRO","useful":8,"cool":0},"xoLtiaBed7_8FTQjn9HBKw":{"text":"Nice swanky hotel. The greeting area is pretty impressive. The bar downstairs is a nice ch","useful":1,"cool":0},"Odj-ipoM79D7Tr-rYPzqcQ":{"text":"Worst hotel I have EVER stayed at in my entire life. It was my boyfriend's 21st birthday s","useful":0,"cool":0},"ptbudxngASNL3FrDDZLZSA":{"text":"Not their finest hour, the lobby, bar and restaurant were all re-done and done well, howev","useful":0,"cool":0},"p7a6TG3WbsJ82Zraq-ZrRA":{"text":"We really enjoyed our stay here. The location is great, the employees were all SUPER nice.","useful":3,"cool":0},"RMce8WfdDHOnHbkSczcTaQ":{"text":"I love W Hotels... esp for their bathroom and Bliss products alone.\nAlthough some may call","useful":0,"cool":0},"It5s5c1dMVhGleZ6LOt3gg":{"text":"Came here from December 19th-23rd and decided to stay at the W because it's supposed to be","useful":2,"cool":1},"p6UVssbHtPc5wIAcch7Y1A":{"text":"I have stayed at several W hotels in the past but this was by far the worst I have experie","useful":2,"cool":0},"3sQvS_SzF6Pw5MujbI2TVw":{"text":"If you like dirty rooms and noise this is the place for you. I felt like it was Spring Bre","useful":0,"cool":0},"IwsnSm5IPITeJMtJCfELcQ":{"text":"Let's get the good out of the way first. This place is close to most anything you would wa","useful":2,"cool":0},"sQOOWxlIx7GuwVenVBf1aA":{"text":"Stay was nothing special. Was there for 4 nights and there were definitely a few hiccups t","useful":1,"cool":0},"jDom-TUlzyInJpiTPyLRYw":{"text":"So sad. My first W experience and it was unbelievably poor.  Upon entering the room, I fou","useful":0,"cool":1},"6QdFkOlTWAe7q9xq55CICw":{"text":"In town for the NADA convention. Very disappointed in this hotel. Terrible service, tired ","useful":1,"cool":0},"D0gMAstLxxkKChzuLV8JyQ":{"text":"Had to cancel my reservation at the W because the costs for pets to stay are about as much","useful":2,"cool":0},"SR5RFFDPRCJbCL3ZG6KyFQ":{"text":"For the price, I had expected something much better. First, bathroom was dirty upon arriva","useful":0,"cool":0},"6xfLEdoaDjGUVg2MI7n-Rw":{"text":"we stayed at the w new orleans during jazz fest in april 2004 and although we usually stay","useful":0,"cool":0},"v7lD3-FHAhMpWRk21LLNYQ":{"text":"I'm torn - I love BLISS products, so the W gets an extra star for that but this place is k","useful":6,"cool":10},"blewVnjs4bzhLiCx7uTT8g":{"text":"W - on Poydras in the CBD (Central Business District) - I really like this place - staff i","useful":1,"cool":0},"hX6uN6nSfaeujjtmdPxejQ":{"text":"Beside the expected nice lobby with W signature vibe, it's a disappointment. However the b","useful":0,"cool":0},"kgGgiZN4zJn6tfNjuYx-tA":{"text":"I love the W Hotel.  I understand that the pool isn't palacial, that the lobby is loud, an","useful":4,"cool":6},"8W6sBZry6fj5iZlcj6kyOw":{"text":"I am so disgusted with this W Hotel!! \nCheck in and the bath tub is dirty & has \npubic hai","useful":0,"cool":0},"KDkpzuE9l9J6YY-t_LRSQA":{"text":"Not all W hotels are equal. It was evident that this location has not been renovated for a","useful":2,"cool":0},"FHic1Pp8fjtxyDcykL9umQ":{"text":"Such a convenient location! This hotel is right across the street from a HardRock like cas","useful":3,"cool":4},"9lpYN6kGOt7Oq4SDJiFTEA":{"text":"Save your money.  This hotel property is tired.  \n\nPros: staff was great. Gym is nice and ","useful":1,"cool":0},"tU_eAmD7yR0GiWdASkMaZA":{"text":"My favorite Starwood in the Big Easy...\n\nThis is one of the first W's. It has a great loca","useful":0,"cool":0},"V0j-APV-d01aAb4JCUKDYQ":{"text":"I'm a Sheraton Preferred Member and love the W properties. \n\nThis hotel is much bigger and","useful":3,"cool":1},"tgdsbgQUkMJOBJgLIOFrbA":{"text":"NEW ORLEANS: I like the W properties by and large.  They have a lot more personality than ","useful":1,"cool":1},"4Z4Hko6d0SCqWldAYA2dDg":{"text":"Awesome as usual, but they don't allow nudity at the pool...WTF? this is the Big Easy...th","useful":0,"cool":0},"YBUBRAQUdeyOgHPQlbIwmA":{"text":"This HOTEL IS TERRBILE....here is the email that I sent to the General Manager at the hote","useful":1,"cool":0},"Ta5zsgsvpCGp13edrsUXJA":{"text":"This was a good place for us to stay while on vacation in New Orleans. We walked everywher","useful":0,"cool":0},"kBKMAxMQlDBzpnWobvld8w":{"text":"A fine hotel with a bit of a different eclectic flavor.  All around a great place to stay.","useful":0,"cool":0},"qzFMEvhPa1cEN0ph8aerGQ":{"text":"So I just recently came back from my trip to New Orleans (a few hours ago in fact) and luc","useful":5,"cool":1},"h1uN19_87AKJbYxIE-24GQ":{"text":"It's a W how could I not be a fan?!  SWANK to the fullest degree as far as hotels in NOLA ","useful":0,"cool":0},"c7gsH89Nd1oFzuFEqW3DHg":{"text":"I write this from the living room at this very hotel, the only place with free wifi.  The ","useful":3,"cool":0},"10FLw22caEzTAVCki7ofJg":{"text":"For the money I give this place one star.  Rooms are tiny, a/c sucked, loud, bathrooms suc","useful":4,"cool":0},"YEncWbHTyswzURj3KRqi2g":{"text":"I have nothing but love for the W New Orleans.  As usual, the staff exceeded expectations.","useful":0,"cool":0},"X-yb-eHNk3X0fECqrzvh-w":{"text":"Shockingly disappointing.  I have never stayed at a W, but from all the hype and pictures,","useful":4,"cool":0},"nyhflTNjiJELfwgimndyQw":{"text":"Free pool parties on Sundays all summer!\nDownstairs bar has $3 craft beers for happy hour.","useful":1,"cool":0},"5_fjdf8WjjQk18nAg2ElSg":{"text":"Nice room, bathroom needs to be updated and thoroughly cleaned. For a W, I was disappointe","useful":0,"cool":0},"i4vW8n4jYvpDctmYOnlGCw":{"text":"Nice hotel, but I was, I don't know, expecting better service from a W.\n\nFirst off, the de","useful":3,"cool":0},"RkC3SW5e5nT60XtDbvuugg":{"text":"I stayed here on a Thursday night and paid $130 for a room. I have stayed at the W before ","useful":0,"cool":0},"GnUgXCIxoPIvKVjxiWNovA":{"text":"Location excellent.   Lobby nice.  Acura experience fantastic extra. But based on 2 things","useful":1,"cool":1},"AnRRH7qDL7vWTshh19Aj6Q":{"text":"Suites are sweet!  The rooms are simple but nicely decorated.  Had a slight dated feel rel","useful":0,"cool":0},"OPgeDNe9Ai5WkN-G61sc7A":{"text":"I know I disappoint everyone with my impression of this place, but it wasn't all that and ","useful":0,"cool":0},"J0_A_jJDj9JhvZujR5Q-Sg":{"text":"One word....GHETTO! \n\nI stayed at this hotel about 10 years ago and I don't recall it bein","useful":6,"cool":0},"qF1wd6xbF8iE1MHfpTRadw":{"text":"Just a bit of a letdown but overall a decent stay.  \n\nIce machine broken on the 4th floor ","useful":1,"cool":0},"CJtjyC4FghqWw-b23pwyDA":{"text":"My husband and I stayed here for three nights on the second leg of our 10-day, 2100-mile r","useful":0,"cool":1},"94zRY_mGjMGXPfK97N_Gsg":{"text":"Not the cleanest but the bliss bathroom products smell great.","useful":1,"cool":1},"wzN_3HsFc2Minvccustv5g":{"text":"When you first walk in -Striking\n\nWhen you go see the sign for the gym and the pool (sweat","useful":2,"cool":0},"5xqOpZzfvj0fRkfhYgDQVw":{"text":"The location is ammmazing for this hotel; across the street from Mother's Restaurant, at t","useful":1,"cool":1},"iQecx23bNlOdj5WAmeO62w":{"text":"Lately, I've been staying at Starwood properties almost exclusively. The goal? Platinum st","useful":13,"cool":6},"oLS13lak5FF8-dkbZN4ZDw":{"text":"The only two reasons why this hotel is getting a one star review is 1) the staff here is w","useful":1,"cool":0},"GvSDHWyK62tEY1fL7lKjuA":{"text":"Not worth the price. Slow as slow can be when asking for anything. Also they charged me fu","useful":0,"cool":0},"6OQ92g-mJtJ39mGERcEAxg":{"text":"If I can imagine the most amazing hotel ever, this wasn't too far behind.  The rooms were ","useful":0,"cool":0},"XF22Sy3019fTk_FSplM5Og":{"text":"While the lobby service is extremely attentive, accommodating & friendly, the rooms leave ","useful":1,"cool":2},"LdT2vtx8BA4oJApIZoiQ-g":{"text":"I'm upgrading my score on a sentimental note: nine months after our stay, we welcomed our ","useful":0,"cool":3},"3pRh5QxZ8iSNdYRURpxEMQ":{"text":"Great hotel, staff and location\n\nAcross the street from mothers (10 times better then any ","useful":0,"cool":0},"qvh90iqOYoKE_WDsEwhjyA":{"text":"I want to start off by saying I dig Mod hotels like the W.  Far better than the big preten","useful":4,"cool":2},"m4sUAShYzDXNX5TLDZL0qg":{"text":"OK, i wrote this on tripadvisor.com but felt that it should be repurposed here on yelp.  I","useful":1,"cool":0},"U6uQn6_NDz1K0WCuykXYPQ":{"text":"I really want to like this hotel more than I did. In fact, I'm torn whether to give this W","useful":4,"cool":1},"ZvH1Hh3x6yEy6N6qvN4B0A":{"text":"Well I kind of fell victim to the old bait and switch here.  When I originally booked this","useful":4,"cool":1},"1cdz6xwj_Q65sleVf1JGfw":{"text":"Stayed at @starwoodbuzz W in NOLA. This hotel is better than my stay at the last W in anot","useful":0,"cool":0},"X6-_d52TbbGH2FrN2cOR4A":{"text":"Dreadful experience at a supposedly high end hotel. Took an hour to check-in because they ","useful":0,"cool":0},"9EWe-O2KGrCSv9dZNZufig":{"text":"I don't understand the appeal of W hotels in general and this one in particular. \n\nIf you'","useful":2,"cool":0},"XTIf9lNJ_yLoCY0SSzDWlQ":{"text":"All the free wet naps in the world cannot make me want to stay at this hotel again. Yes, t","useful":3,"cool":0},"vONITe7rAIBnJCbSGi0RDA":{"text":"Mon-Thu stay, frequent business traveler, first time here.\n\nChosen when I was shut out of ","useful":1,"cool":0},"pDmAJfw2fN-efZrBNfU1dw":{"text":"Stayed here last week for a large convention.  It is a very tired hotel.  The location is ","useful":1,"cool":0},"wBPe0inGpRWxGRJzLPKdOQ":{"text":"Truly one of my better W experiences and I think that had a lot to with the fact that the ","useful":5,"cool":2},"mx1oh6tGt_8sLhLisfRUdQ":{"text":"Stayed here during Tales of the Cocktail. Rooms were really small  and electrical outlets ","useful":0,"cool":0},"e7Q1EM7CMsEVT6X4AG5CjA":{"text":"Decent price on a pretty cool hotel.  Walking distance from French Quarter and across from","useful":0,"cool":0},"d_GYrzbQzEvWKcwPAxORhw":{"text":"To me the W Brand has always been a great one. I have stayed at the W in many other cities","useful":4,"cool":0},"9vDqOVFPYjhrLO9LqF9F0g":{"text":"Stayed here in September and can't believe I forgot to YELP! it! Booo me! :) \n\nStayed at t","useful":2,"cool":2},"IJNzQG_ohIkplXttrZRdyQ":{"text":"I've now stayed in a handful of W's and this property is starting to show some age, not in","useful":2,"cool":1},"ZUwC0pxhPh74rFNkqOHEfw":{"text":"I booked this hotel a few weeks ago on Hotwire, first time I'd ever used it.  I was worrie","useful":0,"cool":1},"hJne0tJbkvcWP5ARf_UVoA":{"text":"Worst W I've ever been to.  Worst hotel I've stayed in for the money.  I come to New Orlea","useful":0,"cool":0},"sxaxzKOfy_BJ4nWQXtASnQ":{"text":"Let me just preface this review with the fact that I have had prior experience with the W ","useful":1,"cool":0},"2CAVnFsQEEE__35h2zZGCQ":{"text":"Wife and I stayed at the W New Orleans for 6 nights.  We expected something a bit more for","useful":2,"cool":0},"0pRRceev5Or0sLQxHPtY9Q":{"text":"Staff was nice, one guy in particular was a little too friendly with my wife, I don't reme","useful":2,"cool":0},"wPHHcuFtD-ChBRwmPnwb8A":{"text":"I love W Hotels. LOVE them. I've stayed in them all over the world, and I'm known to check","useful":3,"cool":1},"l4cZsI3FPuVQBsj4WHxD5w":{"text":"We stayed here over Christmas.  Fantastic!  Room was a little small but the staff was so a","useful":3,"cool":0},"3EmoXse00l2x0VKp_ljXig":{"text":"I stayed here last weekend w/ a couple of friends. It was a nice trendy hotel w/ very good","useful":0,"cool":0},"mIjVcZBeFflbiJGCXUaI0Q":{"text":"I was at this hotel for a week for a business trip. To be fair, this hotel was not my firs","useful":0,"cool":0},"KYLdaXd1DF5kkX9zHuPR5w":{"text":"this hotel is just a name now in New Orleans...the hotel is old and needs to be renovated.","useful":1,"cool":0},"pqf_Uehatw2B0kQZdooGZg":{"text":"I am severely disappointed at my stay here. This was a stay-cation for my husband and I fo","useful":1,"cool":0},"gmSt3YEnTRheEx-SkXXgrg":{"text":"BED BUGS!!! Stained carpet. There was hair all over the floor when I checked on. When I re","useful":4,"cool":0},"Ko8PWHvPH0FoAUFnjvWr8w":{"text":"I've stayed here twice, once in 2006 and once in 2010. I am a sucker for the fabulous Blis","useful":3,"cool":3},"44mN9_YxLP2GRFB4gMesyA":{"text":"During the planning stages of a long-weekend to New Orleans, we managed to find a ridiculo","useful":2,"cool":0},"p1YZzBBxQvgLuMWr3sLErg":{"text":"I hate to pile on, but I just returned from NOLA and stayed at the W New Orleans for 3 nig","useful":0,"cool":0},"bqFEBeutP7B5rzac9mRzBA":{"text":"My friend stayed here so I spent a bunch of time in her room.\n\nPros:\nNice soft beds\nClean ","useful":2,"cool":0},"LhwW90X5GRufRWYGiBdaRQ":{"text":"I only found out that Britney Spears and her host of dancers were staying in our hotel on ","useful":1,"cool":1},"XlTAMclPmY6qOqXt83HAQg":{"text":"Loved it.   Clean lovely place with very attentive staff.  It is close enough to the Frenc","useful":0,"cool":0},"YA5ECAb8AJ6DZAp0w4waUA":{"text":"Comparable to the W in Time Square: Dirty, dirty dirty.\n\nI walked into my FIRST room (i wa","useful":2,"cool":1},"A8SZ42buinf34agJo2vJmg":{"text":"I first stayed at this hotel in 2004 and just spent last night there. The changes are evid","useful":1,"cool":0},"o5uJImG9a1VExBSHKNxCGQ":{"text":"Stayed there last night due to Mardi Gras parades. There is no longer free access to the c","useful":2,"cool":0}}