{"qOkxHKyC2JVGfVRV3_gAVQ":{"text":"They are masters at there craft.  We have an 180 lb mastiff that we greatly enjoy spending","useful":0,"cool":0},"UB1CUScsLSLI1T5F2O3EZA":{"text":"We've been using K9 Second Line for about 3 years now and have enjoyed them since the begi","useful":0,"cool":0},"-5t63XqLJFFdBXqO7DLZSA":{"text":"Brendan and his team are excellent! We went on vacation last week and had to leave our pit","useful":1,"cool":0},"ECUXicT5b_Jumc5lz-rlDw":{"text":"This service is awesome! The staff treat our pooches like their own. The system they have ","useful":0,"cool":0},"ex5nuHO8vMOzb0zIGZ1Qtw":{"text":"My wife and I have been using K9 Second Line for over a year now. We have both a dog and a","useful":1,"cool":0},"V8t72sa5GrWgpO4oYNzPMQ":{"text":"Recently worked with K9 second line while we were away for a week on our honeymoon. Brenda","useful":0,"cool":1},"ysIm53MfEvV_9op-OBNBDw":{"text":"We just moved to New Orleans with my wife less than a month ago. We have never used a serv","useful":1,"cool":0},"gkNbDuRx_40Y_vWB0gO0Tg":{"text":"Their communication with the customer sets them apart.  The owner of the company interview","useful":0,"cool":0},"s_cy-C_Zn_gSeOoNH32jKg":{"text":"I hired K9 Second Line to take care of my cat whenever I go on vacation, and it has been n","useful":0,"cool":0},"hW4JMBtP3bwBRLU6Q0U-oQ":{"text":"This review is from a past employee and client standpoint. \n\nWorking for K9 Second Line wa","useful":1,"cool":0},"JafDEBO8Qag0pi-k1Xy-qQ":{"text":"They have been great with our Siberian husky. We have used them for their walking services","useful":0,"cool":0},"AZRradlh2IgQb9x6Q5TEIw":{"text":"I could not have been more satisfied with my experience with this service. \n\nI found them ","useful":2,"cool":0},"TKBJPyRHlL1P5MqypIWxWQ":{"text":"K9 truly is as good as it gets!  The very best attributes about this business are their co","useful":0,"cool":0},"CN3Hzl99Y1VnnZMKPAjJoQ":{"text":"I am a penny-pincher and never thought I would hire a dog walking/pet sitting service. Whe","useful":1,"cool":0}}