{"tl18TLogVYNLAItUwN51NA":{"text":"Amazing place with a ton of Vegan options, both crepes and milkshakes. I had the Vegan Pes","useful":0,"cool":0},"2_Rs8c2Zdp8pO7Guh10eiA":{"text":"This place is a gem. So far, we've ordered:\n\n1) Ham, eggs, and cheese\n2) Broccoli/pesto \n3","useful":0,"cool":0},"hic3b6o0xGsEolaWuaQq9A":{"text":"I never write yelp reviews, but I want this place to succeed. This location is brand new, ","useful":0,"cool":0},"3JOCUUunWe279zJPcthFWw":{"text":"A great new breakfast option in Bywater. Large savory crepes that make for a meal, sweet c","useful":1,"cool":1},"BlcrmXoGA12pbkKI9LYCLw":{"text":"Clean, friendly, yummy food. What more could you want? You won't get full off of just one ","useful":7,"cool":6},"0K55MatRKQF190aX62eeFw":{"text":"Just a few blocks away, I finally got to try this place and it was GREAT!  Some of the bes","useful":2,"cool":1},"jJ9Tr8oOVpu2a1lxtA4E5g":{"text":"Coffee is pretty pricey. 4.50 au lait in my own thermos. plus tip. \nUsually much less else","useful":0,"cool":1},"F_rSRvklqh8QRI8QlXR9PA":{"text":"Great new spot! We went yesterday and tried one sweet crepe -- nutella and strawberry -- a","useful":1,"cool":0},"kjN_pyVPI1E5KfcuCrCEkw":{"text":"Great service, friendly, & gluten free! Went above and beyond! had my order ready quickly","useful":1,"cool":1},"a9p4G6tT0hY1TIoPMMkMiQ":{"text":"They have the best crepes! I always enjoyed the crepes from their cart in the French Marke","useful":11,"cool":6},"vJp3CGzFaGRsYTWqSuQWDA":{"text":"I stopped by here this morning after the gym. Although I wouldn't consider myself a crepe ","useful":3,"cool":1},"eiBW1Rsei_0dfAMWCqQUmA":{"text":"Butter and sugar crepe is the real thing. The Hummus with the gluten free crust makes me w","useful":0,"cool":0},"4e8-qNOgvhon5sY1Gvjwvg":{"text":"Absolutely love this place. The crepes are delicious and filling. My favorite is the Capre","useful":0,"cool":1},"MmIKoQC-dNz-_jhfxxlaDQ":{"text":"Great place. Great crepes. Kaitlynn Champagne was so nice and friendly and made awesome cr","useful":0,"cool":1},"YtG0QQCW7Opy-p6njVHnQw":{"text":"This is a hidden gem they have great crepes and a very relaxed atmosphere. The crepes I ha","useful":0,"cool":0},"UnQRP0KSQnjoyFIt_EjHtA":{"text":"Hands down the best crepe I ever had! I have the gluten free crepe and it tasted amazing! ","useful":0,"cool":0},"c_GpsV5pLWECFJw-68cjVQ":{"text":"My boyfriend and I stopped here to wait for check in at our airbnb. There's a relaxing vib","useful":0,"cool":0},"DDRXGEq7VG7wxMLba9vR-A":{"text":"Aptly named, this cafe is on a residential street in Bywater past where most people would ","useful":3,"cool":3},"d6Rxpcyis8H3K-iebv8U1A":{"text":"Far and away the best crepe I've had in my life. I had the garden veggie-- the dill and pe","useful":0,"cool":0},"XH1I9XxopW7UEE54sWE_Qw":{"text":"Been twice, will be here again.  Good coffee, excellent crepes, and dog-friendly!  I liked","useful":0,"cool":1},"7mNRdqzWTMqJf08aUatvZg":{"text":"Awesome spot in Bywater. Crepes are unreal!\n\nGreat service and ambiance. A must visit in B","useful":0,"cool":0},"d1es1csctSOzNVpEAWXAsA":{"text":"Great crepes and coffee but TERRIBLE customer service! I had almost the exact experience b","useful":1,"cool":0},"Ry94Sc4dd6KVR7NVE6oRpw":{"text":"amazing sweet and savory crepes! Atmosphere was uniquely New Orleans! Dirty Chai was my fa","useful":0,"cool":0},"7cXFLO_lXYg-eEUdAy2N7g":{"text":"I have to say, if you are in the greater New Orleans area, wether you live here or are vis","useful":0,"cool":1},"KRb2yYzZHEE7vWdXUBhB9Q":{"text":"Wonderful neighborhood spot!  Delicious crepes and very dog and kid friendly.  Great place","useful":0,"cool":0},"HXrOYYEMMj5ThZUF1cKLWw":{"text":"Bright, open and airy space, very enjoyable setting. A little disappointed by the food. It","useful":0,"cool":0},"kCA6gUCBSh9WP2ZbTpEMag":{"text":"Fantastic place! Absolutely love crepes, and believe it or not people screw them up quite ","useful":0,"cool":0},"YDmDEzPezGSH6Igpxn6i_Q":{"text":"I had been wanting to stop and try this place from the first time I saw it opened. Finally","useful":1,"cool":0},"KAXB_JBB9NftsVIAsU87gA":{"text":"We walked by this place on the way to our Airbnb the first day we were here and noted that","useful":0,"cool":0},"A9MzEPzbo2JB3mXJGFxB5w":{"text":"This place is awesome not just because of the location but the atmosphere is great for som","useful":0,"cool":0},"3dzgLDR9aqU1nU6_2p0n0A":{"text":"This place is amazing! Love it! Huge fan of crepes and it doesn't disappoint. It's a cute ","useful":0,"cool":0},"2dVuUgtKUZQteCbNMePhxA":{"text":"World's slowest barista. \n\nCertainly friendly, crepes are tasty, good selections... someho","useful":0,"cool":0},"VfmHIim0HwRAZnkVfXXx1Q":{"text":"Oh my god yes!!! Sweet service, great food, and puppies are allowed! \n\nThe Elvis is amazin","useful":0,"cool":0},"fmV7jkOhd6otuExskZMusQ":{"text":"My new obsession. The Crêpe Place is a newish brick & mortar for The Crêpe Cart located in","useful":16,"cool":13},"FIWkQ6am4thQKXbbN5FiAg":{"text":"So I saw the Yelp reviews for this place and wanted to try it out for myself. It's all on-","useful":1,"cool":1},"1tA7sOoW_xE-UxOnbDK6Og":{"text":"Great laid back atmosphere not crowded like most places. Got a sweet and savory crepe and ","useful":0,"cool":0},"lBjEpaTzd-upSgkYkuk6Nw":{"text":"Extraordinary!! So happy this place is in my hood. Beautiful sunny space, dog friendly, ki","useful":1,"cool":1},"Jd2IDSvRSA3eZ0knNNADKg":{"text":"Formerly known as the crepe place, the bywater hideout has a great atmosphere and friendly","useful":0,"cool":0},"akWD32UtlkNWof_ndE5Xew":{"text":"The crepes were awesome but as far as the service, one word \"nonchalant\". We weren't greet","useful":0,"cool":0},"i4L-4rovYUNg09ORgRtorg":{"text":"My favorite breakfast place in NOLA! Cooked to order in front of you. Amazing ingredients ","useful":0,"cool":0},"co6XivQ9IeA3IGsfT_z6MA":{"text":"Was really happy to see a crepe place open near me and also am just always happy to see ne","useful":1,"cool":0},"2dBZxuuNMCBK5inTF8w1lg":{"text":"This place is great! Cool vibe, while feeling very welcoming. The ladies working here are ","useful":0,"cool":0},"jhvd-BZm_9lCiY5VmNbYrg":{"text":"It's nice inside, free wifi, nice owner, and there is a cute kitty named Waffle inside. I ","useful":0,"cool":0},"rY48Tc2CLb8RMd2S6cwCjg":{"text":"Amazing crepes. Perfect recreation of the street food but too limp.  We had the banana cin","useful":0,"cool":0},"ki7jFGyQie6cWxN2okCONw":{"text":"Good place for savory and sweet crepes. I had the hummus flaxseed crepe and the pesto pani","useful":1,"cool":0},"SM7noXvNYTwFPz_cDpJqNA":{"text":"I've been dairy free for almost a month and usual my eat at home. I was excited to try out","useful":1,"cool":1},"sOsAgodRV-zVFMfjGGHy8Q":{"text":"I was so excited to try out this Creperie from the moment I first read about it online. Cr","useful":1,"cool":1},"Iwj49ywsGdmjl14UhX00Uw":{"text":"Gluten free crepes? Yes please!  This place is so cute and homey. They have delicious crep","useful":3,"cool":2}}