{"BQ5e9QAOF8jPE52O5UfuAQ":{"text":"Super slow slow slow cook. Great bar otherwise. Need better service. Wish I could review t","useful":1,"cool":0},"471QumsNMaSK3ZAZnwUunw":{"text":"Amazing sports bar!!  Super accommodating in the games we were trying to watch even though","useful":0,"cool":0},"mJPtVEBATZCHYuw5FBb0-Q":{"text":"What can I say except cheese wiz. The mac and cheese tasted like they just dumped the nood","useful":0,"cool":0},"UpDvj7MEtJCtK8vP97ZyQg":{"text":"Great place to watch the game! Fried pickles are made fresh not frozen!  I also had the bl","useful":0,"cool":0},"fzsYNZmQaN3dhqi-aTw4EQ":{"text":"Such a great time here during our visit!! Loved the bartender, Jonathan!\n\nI dragged my fri","useful":3,"cool":3},"fCMhe63PM-MLky2h5uiZ8g":{"text":"Service was good. Food was mediocre at best. TV's and set up was probably the best part.","useful":0,"cool":0},"_g7wYoh-EBchLG_L2KiBNg":{"text":"Consistently the best sports bar in the Quarter since it opened last year and getting bett","useful":2,"cool":0},"XXQRLeIJhAUCdRTdktkTkw":{"text":"This is as great a menu fare for a bar as you can find around   The chef is very talented ","useful":0,"cool":0},"KWDw0BKbf8UlXWEA42-hAQ":{"text":"Great location in the French Quarter and always a good mix between tourists and locals.  L","useful":0,"cool":0},"SKKaYQ-QWpO5qPR4oo_D-w":{"text":"I'm not one to be shitty with reviews but this place was truly disappointing for me at lea","useful":0,"cool":0},"p3_j2LkIUdi5TamIDOuZRA":{"text":"Great (clean) sports bar!!  They have plenty of TVs so everyone can watch their games.  Th","useful":2,"cool":0},"vqndmxoK0dCc1JygVBWDWA":{"text":"I'm all about the experience and this place delivered. We wanted a good spot to catch the ","useful":0,"cool":0},"49fUde5Fa58TggEI0PeWIA":{"text":"Happen to find this gem by just walking around and so lucky we did. We watched all the mor","useful":1,"cool":0},"WM_3vlYkp0r5Bzz2nxcDEg":{"text":"The bar wasn't even half packed and we placed our order on time and waited 45 minutes and ","useful":0,"cool":0},"TTJDYNOYxqsqrvGEXlynZQ":{"text":"This place is a hidden gem in the French Quarter. There is a beautiful balcony with plenty","useful":1,"cool":0},"DVdDRsJ8wMsY2xb7wYLcZw":{"text":"More bar than restaurant. Device was slow and drinks were over priced. There are much bett","useful":0,"cool":0},"EB57FfhUn-7ODpjsOfzOpg":{"text":"This is my favorite place to watch games in New Orleans.  Every time I come here, I have a","useful":0,"cool":0},"iWoZfKQbTrNgy0NWsVEUqQ":{"text":"Killer bar and vibe. Great barkeep- checking all the time on quality and quantity. I total","useful":0,"cool":0},"IpOas-Kr6bKaSidU9ftq6Q":{"text":"I don't give five stars lightly.  I give these guy 5 only because they are unique..  Yes t","useful":5,"cool":1},"qMx7VzbLq0ERhVKq2t8TTg":{"text":"Stopped in last night to catch the Canelo vs GGG fight they had a 30$ cover upstairs to wa","useful":0,"cool":0},"JXgKm5tX3debdR3WnOW2MQ":{"text":"This sports bar was recommended to us by the bike rental place after hearing that we wante","useful":1,"cool":0},"oVxDj-HKThp0F3ahAeY30w":{"text":"Cute, little sports bar with lots of tv's and they actually show UFC fights! I had the BBQ","useful":0,"cool":1},"l09uAosQPF7x1lFhWVeQSQ":{"text":"Wow. This bar is amazing! The owner and the bartender Steve...just a perfect team. I legit","useful":1,"cool":1},"nEztuRqEPf__YEHOtMvsYQ":{"text":"This is a good place to watch a game (18 screens), and have some snacks. \n\nThe burgers are","useful":0,"cool":0},"H1seyyBtZ5gk8yLUP2-I6w":{"text":"Great sports bar. Great atmosphere! Open air. Great 2nd floor balcony! We're often in town","useful":0,"cool":0},"dttqcUOalCpA5gHClqthsA":{"text":"Good atmosphere, but a bit loud.  Great place for rowdy fans.  The ladies may want to leav","useful":0,"cool":0},"biPCeFw87TXD2Z3yrBmX4w":{"text":"It's our first time in New Orleans and we hear of this great weekday oyster special!  But ","useful":0,"cool":0},"yIxJ6jiVOjs-3IIijm2fgg":{"text":"We got to this bar 2 hours before the start of a game 7 NHL team to secure our spot. We we","useful":2,"cool":0},"3jDvwb6rS4k3PkIKIf0OZA":{"text":"Awesome place to watch football games in and near by the French Quarter. Huge Tv's which I","useful":1,"cool":0},"MKPe3RQSMOsPOD6kVThuVQ":{"text":"Great place to watch a game! TVs all over the place!.. even upstairs. Friendly staff and g","useful":0,"cool":0},"U6pCtWEMF4sVjAF_jrlcdQ":{"text":"Visiting for New Years and the Sugar Bowl... looked on Yelp for a good spot to watch the g","useful":0,"cool":0},"9wmlz4WJJy89IZL4gUfRAA":{"text":"A S S. Bar catered to our football needs. Robert is a great guy/owner. We spent 11 hrs the","useful":0,"cool":0},"UA0FNjPd1g40k2fyr9rPPg":{"text":"This place is a disaster.  Waited 10 minutes before someone took our drink order.  Took an","useful":1,"cool":0},"jXTxrDIN0ezfEkcXjrZKqQ":{"text":"Stopped by here a couple times for some football watching while on a business trip. Solid ","useful":1,"cool":0},"R6sIbDlf68G7drE0JN9XGw":{"text":"Great service, food and drinks. Great experience for a first timer. Bartender came to tabl","useful":0,"cool":0},"0QVPN7Op1K_Xk6-W0136zg":{"text":"Had such a fantastic time watching the Saints game here Sunday. The food was awesome and i","useful":0,"cool":1},"vng-i67buj5mgiiEyv-btQ":{"text":"Visiting from out of town and was excited this place would play the Warriors game! Drinks ","useful":0,"cool":0},"Zkm0oFAbLQsRdxuOio2lHg":{"text":"Great place to watch a game and the service is excellent.  The food was not good.  The nac","useful":0,"cool":0},"avNxo-p9t1UyGiUS82MKhA":{"text":"If you are looking for a great, clean bar in the French Quarter to watch any sports game w","useful":1,"cool":0},"4YwmY8FSJKi8eWvKjK1g5w":{"text":"Had a great time hanging out at this place! I have been a few times before and sat on the ","useful":0,"cool":0},"K58teTBEhNW5ty6NeS2eAw":{"text":"This is a fantastic sports bar! They show all the day's games. The bar is smoke free and t","useful":2,"cool":0},"Zr6yEA-OmBoMRlMydu1H8g":{"text":"Been to NOLA for 17 years...did the whole bourbon street, voodoo, Krystal burger, Mardi Gr","useful":2,"cool":0},"GPnx1uN-FbT_OcF9bzrkxA":{"text":"Came here on our first day (a week ago) in New Orleans to scout it out ready for the McGre","useful":1,"cool":0},"wF9EzE_gF6KULteAL6Llug":{"text":"Just left this place. I left specifically because the owner was waaaay too chatty. Give me","useful":7,"cool":0},"t6cMB9s-RFw4tHAzJl5hKQ":{"text":"First let me say sports bars aren't my regular 24/7 jam. \nBut I reality wanted this spot t","useful":0,"cool":0},"W_og1smH1peohoVIL2lNBA":{"text":"Came in to watch a Duke basketball game on Saturday afternoon and the owner?/manager? Grac","useful":2,"cool":1},"CEgMxpIsSoHYQXWIe7tTEg":{"text":"Wings were pretty solid, not spicy enough for my tastes.  Service was great.","useful":0,"cool":0},"8emGUmSIvpzJY_Oo9lm5qA":{"text":"Came in the evening on 2/14 for a college basketball game since they had Big Ten Network. ","useful":0,"cool":0},"rndLgWN3EEsKkoI3F4RHrw":{"text":"They have tvs on the patio which is awesome.  Though you feel like any second the patio ca","useful":0,"cool":0},"E85cGE7EKEDSWCcxAKJMGQ":{"text":"It's a really comfortable place to duck into and watch a game, but the draught selection l","useful":0,"cool":0},"GFL0mu7LLoIRMP5nBeGJJQ":{"text":"First hangout spot after a long day and we were not disappointed.  We stayed 1 Block from ","useful":0,"cool":0},"-LnRg-lsv4qSaz_Juiqo5Q":{"text":"Made a reservation here for the Superbowl. I elected to sit outside like a dumbass because","useful":0,"cool":0},"qZJv-j9Hi5udzXqlVuqqbw":{"text":"By far the best sports bar we have ever been to!!! The staff is top notch, drinks are amaz","useful":0,"cool":0},"YtZqXOLGneqtsqjb5OW8eQ":{"text":"Great for sports events! Went here to watch WrestleMania. Service was great and good deals","useful":0,"cool":0},"CKXEr7jIDweyPqgux4bPTw":{"text":"Great sports bar! Great service! Great prices! We enjoyed watching NFL playoffs  here!","useful":2,"cool":0},"VNN-WKswDCPJrw1G_ZP04Q":{"text":"Watched the NCAA Championship game here and had a great time.  Great mix of locals and tou","useful":0,"cool":0},"9h-kHFs5UBHnJW1-D0tpPQ":{"text":"Let me just say that the bartenders are terrific. They are very friendly, smile a lot, alw","useful":0,"cool":0},"iwY85VRId_TqNa2QA6BYMQ":{"text":"Great service & food! LOVE the garlic & parm wings! AWESOME crawfish boil on Thursdays ( c","useful":2,"cool":1},"tmOf-AoitAItUoKz_UM0tg":{"text":"Highly disappointed in the service. The manager/owner is really nice, but had big issues c","useful":1,"cool":0},"Qfl5722BXeS4oEgb_3OUdw":{"text":"The weakest drink in New Orleans . Cost 6.00 bucks guess they thought we were tourist ....","useful":15,"cool":0},"0i2of2AEKIHbPTHA_XDOTQ":{"text":"Ordered mozzarella sticks and I'm pretty sure it was monterrey jack fried in a light fish ","useful":1,"cool":1},"xUOaXmWE78o7PiL8FLddrw":{"text":"Looked the sports bars up on yelp in the Quarter because it's the start of the ACC tourney","useful":2,"cool":1},"DF-_0A39AFdF6gWFSW7m7A":{"text":"The quarter needed a good sports bar and one that served food. This place has a lot of goo","useful":0,"cool":0},"nINALBSY4H-is7giJsvwlA":{"text":"Absolutely terrible experience! Our out of town group of 13 visited here to watch a footba","useful":0,"cool":0},"GuO3GysLvAyL-X4gxxUIUQ":{"text":"I wandered down to the French quarter to watch a hockey game and voila (no pun intended) t","useful":0,"cool":0},"xTN-xdVnihTbKS7C0JTM-A":{"text":"It was girls weekend in New Orleans during Memorial weekend! Everyone was into the ghost, ","useful":0,"cool":0},"B4xnZNkv4vBSl6z1iE-pfg":{"text":"Service is poor!  Save yourself some time and hit another place in the FQ.","useful":0,"cool":0},"l583EXdDM3sZevsumxzVJA":{"text":"Friendly staff. Decent food (recommend the jalapeno burger). Exactly what we were looking ","useful":0,"cool":0},"3o-rTFfIftisiZBFrNMZpQ":{"text":"Went to this bar today, and Rachel was the best bartender I've ever met in my entire life.","useful":0,"cool":0},"6T0PIsIGaHbVqHGmrkUZpw":{"text":"They played Michigan fight song to troll OSU fans whenever we got scored on. Michigan wasn","useful":0,"cool":0},"sEqpwSprSkD1yN7oOaU4OQ":{"text":"American Sports Saloon is the best sports spot in the Quarter. I live here and I know! Gre","useful":2,"cool":0},"q2tsK3KyD_jfAwa1CDtlHg":{"text":"Terrible service. Out of their drink ingredients on a Saturday afternoon. Had to ask them ","useful":0,"cool":0},"Ps9uYuQtt74gN9XHlDdnQg":{"text":"Jamison, bartender, BROUGHT THE BOOZE!! He's awesome! The Ass bar, lol, is LUCKY to have h","useful":0,"cool":0},"cetLpaFlPqorjW5zHHYAHA":{"text":"Great place to go if you are a Patriots fan.  Food was average, standard bar fare, but the","useful":0,"cool":0},"M3XDwOeohc4oPWOIFhGmng":{"text":"Top sports bar in New Orleans! \nNo matter who your team is or what your sport is you will ","useful":0,"cool":0},"wyEMC9nYejBWpJCYtUEklA":{"text":"Best bar in the quarter to watch sports. Plenty of elbow room, TVs on the balcony, great s","useful":0,"cool":0},"Gt04HHRpVhxIrNsmaTrNnQ":{"text":"This place has it all. Great ambiance, awesome staff, great beer selection and food that i","useful":3,"cool":0},"-4T8nJ8KJIlhthmJ3WJV7g":{"text":"We visited the American Sports Saloon over the Veteran's Day holiday from Spokane.  The fo","useful":0,"cool":0},"4GixWuc4ZdSOXzOc8RmhZA":{"text":"Watched the Warriors @ Houston game and had a ball. My aunt who was ill, was taken care of","useful":0,"cool":0},"cIl6qoog1lB4gTgvS9-4xA":{"text":"This is a great place located in the French quarter. This is pretty much the quintessentia","useful":1,"cool":1},"S16-Slg9ykTBb0BGMqKrng":{"text":"Our man Jonathan not only served us delicious Bloody Mary's, he also recommended the crawf","useful":1,"cool":1},"0EQgOg-tkVpbforKSSCjqA":{"text":"Love this place,  first time there,  but Mary behind the bar was great and made me feel ve","useful":0,"cool":0},"Jg44XmBpiGNDAXL7WouRTw":{"text":"Good place with a nice terasse close enough to enjoy street jazz band and take a rest afte","useful":0,"cool":0},"2F4Dh6mK6MTHMOEZqioRtA":{"text":"Really bad food, service was even worse. T honestly felt as if our server was high. Would ","useful":0,"cool":0},"3t09h2QbbSwK7WyEimFIXQ":{"text":"Can't beat the half dozen oysters for $3 during happy hour. Their food is good and they ha","useful":0,"cool":0},"MDrvF_So29auruPXtbIO3w":{"text":"The bartender  Sean is a bad ass bartender, he should own the place. His bad ass lemonade ","useful":0,"cool":0},"19q_B6UC2tWozMutJxIz5w":{"text":"This place has TONS of TVs, friendly and attentive staff, smoke free and clean environment","useful":1,"cool":1},"Qnm0Sa0E8oikWtZy6p9Ijw":{"text":"Really neat little Bar Rescue project. Went in with a group for a quick cocktail and were ","useful":0,"cool":0},"EuiZ8eM2M8LCPY_m3ZxMTg":{"text":"Best sports bar in the Quarter. New ownership has reinvigorated this place. The upstairs b","useful":0,"cool":0},"Y66ZXk6R2A5Er-zD37l3HQ":{"text":"Fun lively sports bar by the French Market. \n\nHighlights:\n- Lots of large tvs and room to ","useful":0,"cool":0},"xST6kEymXLh4NDgQar7bag":{"text":"This place was the best. Great service and so accommodating with the games. If you want to","useful":1,"cool":0},"QJtieHh-2fjFD4IQZL2a8w":{"text":"Christy was absolutely amazing!!! If you are ever in New Orleans stop in and ask for her. ","useful":0,"cool":0},"5qwvGF991hrdAhwJCHTsFA":{"text":"I am a recent transplant from SoCal and this is now my second home. Kristi is the sweetest","useful":0,"cool":0},"y7irmJp-tnLNXxcxbaKWag":{"text":"This place was a lot of fun. From the food to the service all around good time. The only t","useful":0,"cool":0},"X6oQ-AeaUuY2yHE5Ycy4Xg":{"text":"I was searching for a place in NOLA to watch my hometown Oilers when I saw this place onli","useful":0,"cool":0},"OWL4_SPcF7ET_BP__8aMKQ":{"text":"Male bartender was very nice, food was decent and Tv's were plentiful. \n\nHOWEVER - female ","useful":3,"cool":1},"0phedwapBzKhLTLdztDl3w":{"text":"We stopped in 10/7 to watch some of the games during the afternoon and ended up returning ","useful":0,"cool":0},"dTFqEBz46Ma1szOLhrHR-A":{"text":"This is a good place to catch a game. Lots of tvs and outdoor seating. Food was alright. C","useful":0,"cool":0},"91iQOiRQ3yyXfd1rsFkinw":{"text":"Only go here if you want to be treated very poorly.  It's a sports bar and they refused to","useful":0,"cool":0},"7EX43R1ccyuZOoQ4OivYFw":{"text":"Don't eat here go across the street to the French Market and enjoy something better.\n\nWent","useful":0,"cool":0},"GX8ofJhB6Ai1KUtuwawSrA":{"text":"Beer was flat we tried four different beers either they were flat or they were missed labe","useful":0,"cool":0},"njhvHSS_Gb_9TOC91FUwiw":{"text":"Great atmosphere for Sunday football!  No shortage of TVs, beer food or service!  Attentiv","useful":0,"cool":0},"BsPxdiuMQboPNr0r9Xx02Q":{"text":"This place is so bad it's hilarious. This is a great place to come if you want to stay sob","useful":2,"cool":0},"9O9f2mGxl081w_jOI7E8JA":{"text":"I'm a tourist and was searching the street for a good 10 minutes then entered the bar to u","useful":0,"cool":0},"Yr-qPuOYQiyAyP6LRlwnpg":{"text":"We had a great night watching the Alabama Sooners game. Our waitress Michelle was fun and ","useful":0,"cool":0},"r-sgwCnAQP-2NJc7yJHwjg":{"text":"The food is amazing! It's a bit pricey, but trust me when I say you are getting what you p","useful":0,"cool":0},"vjjNGSIJZrFEu6CMCsS-MA":{"text":"I'm giving this place 2 stars for one single reason. The owner was a complete jerk. We cam","useful":0,"cool":0},"eyuXLnvSz5nHzsAYh6boOg":{"text":"My husband and I came here recently and sat upstairs on the balcony. We had SUCH a good ti","useful":1,"cool":1},"zkVnWqwrzMLOTbZab5dchQ":{"text":"Great place to watch FOOTBALL! We had a balcony table which w GREAT but we got rained out!","useful":0,"cool":0},"-O_Hi1m8Y38zEM64ub01wg":{"text":"Wow - I've never seen such horrible wait staff that really just didn't care. Food order ha","useful":0,"cool":1},"aKJ6eddZhcLGO8N4Vy-azg":{"text":"Best happy hour in the French quarter.  Kristi was awesome!  She makes the best drinks by ","useful":0,"cool":1},"1ZgBo7N69ZA1o6kg0JCeLA":{"text":"Horrible customer service. Came for football, seating outside was cool, that's where cool ","useful":0,"cool":0},"1zEYl14Cne_BSrfInvubCw":{"text":"Best sports bar in town where you can enjoy the great weather and your favorite team's gam","useful":1,"cool":0},"yWlvxyH69D_qGUjcP5pkXA":{"text":"This bar does have every game on NFL Sunday. Good staff as well and food is okay. However,","useful":0,"cool":0},"QlNtyJTbOmk-GPDVnVOMaQ":{"text":"Came in with some friends for the Fight , we only had reservations for 7 people but ended ","useful":1,"cool":0},"V3QErMk88I5RvM09-uw3bg":{"text":"What a great place to \"relax\"!!  Go there early to watch baseball and the staff couldn't h","useful":0,"cool":0},"WdK67T99rgHSNnH96E0jIQ":{"text":"Best sports bar we have ever been!!!! Great set up! So many TV's. So much space! Love how ","useful":0,"cool":0},"HlZMZB8-_JRbMuY6yhpjOQ":{"text":"I'm in New Orleans often so these places i'm Very familiar with.  By these places i mean a","useful":0,"cool":0},"i987cg4UeklkOx07_A552Q":{"text":"Great Atmosphere!! \n\nNice TV's line the walls. The bartenders are awesome. Drinks are reas","useful":0,"cool":0},"U0lU49yv3MhhjhHBlGSzzQ":{"text":"Clean sports bar in the French Quarter. Decent selection of local and national drafts.\nDid","useful":3,"cool":0},"hqYWO6rK-yzSlA2sltcHTw":{"text":"Great place to watch the game! The place is big with a downstairs bar/dining and upstairs ","useful":0,"cool":0},"P34HwfOZBqJbrI4M1CK2jw":{"text":"Husband and I were in NOLA for our anniversary Dec. 20th We stayed close by and were told ","useful":2,"cool":0},"Q0qRW13DRkv_rYpmmhN4SA":{"text":"Visited here for the first time for a Seinfeld trivia night. Its an unassuming bar from th","useful":2,"cool":3},"MrjSwCm6acWus1cdEd9I9g":{"text":"First let me say sports bars aren't my regular 24/7 jam. \nBut I reality wanted this spot t","useful":2,"cool":2},"aGhh9MnCsOOndP51tEnjRQ":{"text":"American Sports Saloon is hands down has the best balcony in the French Quarter but barten","useful":0,"cool":0},"OvfrbhxMd2WJ9On_S5YyqA":{"text":"Don't waste your time! ..... Reserved a table for the Cowboys/Saints game on the balcony. ","useful":0,"cool":0},"Gev7w68UbxPOMwLaHttCQw":{"text":"The American Sports Bar is the best sports bar on Frenchman's street! The most friendly sp","useful":0,"cool":0},"aGrrcjyV5xGbhrkKiebdbg":{"text":"Wanted to stop in here and spend the evening watching the entire Cavs vs. Raptors NBA East","useful":0,"cool":0},"KarvsmU9q8h3iaHKzaa2jQ":{"text":"Fantastic bar. Had a great time watching the Steelers game on Sunday. Lots of TVs and they","useful":0,"cool":0},"wZUbHj7jHR_6JlPPVQPhIw":{"text":"This is another spot we went to a few years ago when we went to NOLA. At that time, it was","useful":3,"cool":1},"PckXrnyCkOu9a_RPm4-xUA":{"text":"The only reason I gave it 4 stars, is because the service was slow, and pretty much nonexi","useful":2,"cool":2},"q_NBQb3J3qwPFmEFemlmzw":{"text":"No good if you're not a local! Waitress must have recognised that we weren't from nearby, ","useful":0,"cool":0},"hlJjLFF5prr6dcVMXNCVfQ":{"text":"Discrimination and poor customer service ruin any good quality food this place may have. T","useful":0,"cool":0},"1A6vXPMczu_jEmN0JYcnOg":{"text":"The food was pretty good and the manager here is top notch, but our server LOST MY CARD. I","useful":2,"cool":0},"QxBa7H9fBFPlSLJta3L1qQ":{"text":"What a fun place!  Food and service was exceptional..  Not to mention great tv watching.  ","useful":1,"cool":0},"mjv4-EOvJN91K9tzrqkk3A":{"text":"Came here on my birthday, 11/11. I really wanted to love this place. Really. It had a grea","useful":0,"cool":0},"O6Z4WpkNE_dwtaq_jJPCpA":{"text":"We went here because of a recommendation from someone else from another bar. We arrived an","useful":1,"cool":0},"XatyBtyPrdjR3rsH8EdD3Q":{"text":"Shanna & Rachel, best fucken people in NO. They are the best crew in town. Great drinks, g","useful":1,"cool":0},"bWe2S9RbYafp-acvBvqqBw":{"text":"Awesome place for fans of all teams.  We had Kelly as our waitress and she rocked it!  Rec","useful":0,"cool":0},"bS0XdhTK00PN4mLg516F_Q":{"text":"The only reason we stayed here is because they played sound for the Dallas Cowboys game. T","useful":0,"cool":0},"FQ9bDiEhuevXR6TBV36zfA":{"text":"I really liked this place. Was in from out of town and was looking for a place to watch th","useful":0,"cool":0},"zZ3d6rTvVMCPX1Sd4UY5kQ":{"text":"Steelers fans from Pittsburgh.  Very disappointed with the service. When it takes 40+ mins","useful":0,"cool":0},"LapglDHCq6Y484F5Xy9rUg":{"text":"Best sports bar around, nice homey feel and good staff. Also the out side TVs on the balco","useful":0,"cool":0},"lURH2hapm5KbgUMTP1yHXw":{"text":"I don't even know what to say.  The waitress is high and she's being disrespectful to cust","useful":1,"cool":0},"B0hOSPV9m0fk6dTvHVvIvg":{"text":"The bar was dirty and the services was way too slow. This wasn't even during a busy time o","useful":0,"cool":0},"U2G_MJeNiyqJiD2Im4jPDQ":{"text":"Really nice place with a local feel.  Came here for evening dinner the night saints were p","useful":0,"cool":0},"9f7UFIk5AWRXuFBOf-vY8w":{"text":"Great place to watch sports! The prices are good and they have very friendly staff and own","useful":0,"cool":0},"burH4OCdTsAYGYHkFpNkxA":{"text":"The beer was cold, but waiting for your food was unacceptable. We order a bucket of beer a","useful":0,"cool":0},"mUPwRdZJ9XTKHh7sjoplGA":{"text":"Not because I know the owners (Robert and Jim...great guys)...but if you want great drinks","useful":0,"cool":1},"4NSWx8phShzg0Cfe2hgeGA":{"text":"The guy in the saints jersey was AWESOME. He was genuine and funny, truly! I had red stag,","useful":1,"cool":2},"OZ_Tnw1BTDMLjzbLpjbKqA":{"text":"Went here for the Patriots vs. Cowboys game and the service was horrible.  Second floor wa","useful":0,"cool":0},"C5qTnkbEQo_798OA6wALaQ":{"text":"Alot of TV's. Alot of games to watch. Had a great past weekend there!... Must visit for al","useful":0,"cool":0},"7Eo4pMHYsH2xeSV2o7xaeQ":{"text":"YAY........finally the sports bar the French Quarter has so long needed!  I'm a local who ","useful":10,"cool":2},"vn7l_0wcnAfDjoqstsu1kg":{"text":"The official patriots bar of New Orleans. Huge crowd of Patriots fans from all over, every","useful":1,"cool":0},"hexkxcwxylHa86EKpQfHAQ":{"text":"We had a great time here while visiting NO. The Bartender was great and talked us into try","useful":0,"cool":0},"i30iAMWmCmH7-uKmRpWf0A":{"text":"Came to watch the NBA finals game when the bartender couldn't assist me with removing a da","useful":1,"cool":0},"RWsi3RNaaxRD1NGBwuUEGw":{"text":"First time in New Orleans and I ended up going here two days in a row! Service, food, and ","useful":0,"cool":0},"pX3v5il2tM1XOiR_g4VXoQ":{"text":"We stopped by on the last Saturday of 2017 after the New Orleans Pelicans basketball game ","useful":0,"cool":0},"OTiuOqvjmpTOuS7dxj5YJg":{"text":"The owner and staff are friendly and helpful and go out of their way to ensure you have a ","useful":0,"cool":0},"IpLkeHiJPl7GcMa09M8Vqw":{"text":"Service is average& food needs serious work!\nOverpriced draft beer ($7) Horrible nachos!\n\n","useful":0,"cool":0},"6kkQ10zCNvcShJ1mhrP0sQ":{"text":"Great food. Horrible bartender/server. Jessica was our server the night of the office triv","useful":1,"cool":0},"D2k5GMb9yY3X0ATY4zIXvQ":{"text":"5 stars for staff and decore. Tvs and couches on the balcony was a great way to watch a sp","useful":0,"cool":0},"LOfAZTzzgqL_G-Hj_KitCw":{"text":"With the hustle and bustle of NOLA I don't expect super great service, but this place was ","useful":1,"cool":0},"IrrCsFdcpJKwqIlZ56znZw":{"text":"The bartender was a bisnatch! \n\nWe asked if the shots were buy one get one.  \n\nResponse: w","useful":4,"cool":0},"rSLb7T8Qf_0LeetKMFCQfg":{"text":"Awful service. Ordered food that never came. Half the staff was drunk or drinking. The you","useful":0,"cool":0},"npA3u57naa5UrT_y-xQ9kA":{"text":"The views were great, they had all the games on. The food was great and decently priced. T","useful":0,"cool":0},"ALDCyFCq-8qd_sxLckSucA":{"text":"Can watch anything sports, yes the have ESPN Ocho! Bar food good. Balcony and setting fant","useful":0,"cool":0},"UQrOK6Lpr1lLy4hsoER3MQ":{"text":"This. Place. Is great. Simple clean decor. Plenty of TVs. On the edge of the beaten path, ","useful":3,"cool":0},"a1M_BncGX3z3nekoa4X7yQ":{"text":"This has been the best sports bar in the French Quarter, for years.  With the multiple tel","useful":0,"cool":0},"D_rA3wG65qXEWHMjpsLq3A":{"text":"Came here for my friends dirty 30 and we stumbled into this amazing bar with awesome drink","useful":0,"cool":0},"rwJ0b60QvbZC3-R0JbWaIA":{"text":"When we were visiting New Orleans for an Eagles game, we went to American Sports Saloon tw","useful":0,"cool":0},"v0mtywPZU3fmB1w4QzS0uQ":{"text":"This is an amazing place.  Great food, great drinks and an awesome place to hang out.  The","useful":0,"cool":0},"kWJF5TcV7BHIuC4um496dw":{"text":"If you're visiting New Orleans and in between drinking and partying, you would like to cat","useful":0,"cool":0},"hbyBgh8iNitedHJrbp1nFg":{"text":"First review ever, anywhere and I dine out a few times a week personal and business. Bar r","useful":0,"cool":0},"s_6GyUdVZggdhr4u58b0-A":{"text":"Super fun football bar for day drinking on sundays. Great service upstairs from Daniel. To","useful":0,"cool":0},"5Bcgrgc0dIBiGxRZL4upYw":{"text":"Seriously poor customer service. We called ahead to ask if a particular SEC game was going","useful":2,"cool":0},"nt5t3uoyXQdH9AZNlBSWGA":{"text":"As far as the venue it was a good place to watch the 7th game for the world series with al","useful":0,"cool":0},"KXXB1EnHK72fo-PtMCeB7A":{"text":"Awesome place to watch a game!! We absolutely loved the patio with private TVs for each ta","useful":0,"cool":0},"qCjof214lCED7DcVdoGPtg":{"text":"This place is awesome! Lots of T.V.'s to cover a wide variety of games. This is where us l","useful":0,"cool":0},"e6iYEGkcCVbHmfJShJV8Qg":{"text":"PATS NATION!!!! It's so cool traveling the country and having a Pats bar everywhere we go!","useful":1,"cool":0},"ssH7dMVI_EVQG6qfOef-ng":{"text":"A great sports bar on the edge of the Quarter.  This is a go-to place to watch a game, hav","useful":2,"cool":0},"yLOA2nqdTGTvL_lKAoCgQw":{"text":"After you leave a review for this establishment, expect to get a profanity laced response ","useful":1,"cool":0},"5zR_gnitrrd97RmYR21dCw":{"text":"This place was pretty damn cool last weekend. The tvs were the best quality. Danielle was ","useful":0,"cool":0},"S7MYUJV3Vu1uUTxX5YRIHQ":{"text":"Such a great place to watch sports and just hang out. Every single person working there wa","useful":0,"cool":0},"Y2J7uJfm8s9YpQrIZywjHA":{"text":"Fun fun fun fun! Balcony with TVs  right in the quarter!! This spot is great! It's in the ","useful":4,"cool":1},"WkwtRQClQZa3CaSe3G2s1A":{"text":"We have been going to this place every weekend since August. We have brought friends snd r","useful":0,"cool":0},"dSU1c_wRmaiaFbt2Ms6D0A":{"text":"My first visit to NOLA and this spot is a MUST! It reminded me of a usual dive bar, but th","useful":5,"cool":1},"3QafsUeK5WdbcsFOTZCO4w":{"text":"Owner is ammmmazzziiing!!!---had the hot dog with pretzel bun--awesome and had any sportin","useful":0,"cool":0},"756ejW39FS6vk6uJjVCrPg":{"text":"There are 8 of us here to watch hockey and all we hear is NBA... do you want us to stay? D","useful":1,"cool":0},"v3Zq7JWKWS4-fM49gBoPaw":{"text":"This is a great place to watch sports! They have TVs everywhere and the service is outstan","useful":0,"cool":0},"Z4ronFLd3Lg0X0HNu2HGFQ":{"text":"USE CASH ONLY!!!!!\nTour guide took our group here as a pit stop during a Ghost Tour.   We ","useful":3,"cool":1},"LZf0pF7A46JvxiHIoxBSTg":{"text":"nice, clean, awesome bar on lower d. ... glad to see new places open up! service industry ","useful":1,"cool":0},"mhmDVl_QG2fTtoYptWRNmA":{"text":"Pros:\n-Good drink specials\n-decent cheap good food \n-away from the craziness of Bourbon St","useful":1,"cool":0},"8mclcM79t0KwNYhh-RiRNA":{"text":"The American sporting saloon is  Is a cool place to watch the games no matter if it's coll","useful":11,"cool":9},"4fAhqBYFHK0Mw7b0qOZQlw":{"text":"If you want to watch your waiter drink beer at noon and flirt with the hot bartender this ","useful":0,"cool":0},"8lAipl6bqQ0nShZiDfEW3A":{"text":"Do you like sportsing? Great! Because you'll love American Sports Saloon! They sports so h","useful":1,"cool":1},"YewIGTVTjvSKU0idSKMzRg":{"text":"My wife and I just stopped in to watch the College World Series, have some food and a few ","useful":0,"cool":0},"Xs_lNZrhlLv37SiLzqD3hw":{"text":"We came here for our first, and last time. Not only were they out of most food items, but ","useful":0,"cool":0},"RtwB1bOZTE0sMDA0xjQhxA":{"text":"We were looking for a good spot to watch Thursday night Football during our visit and stum","useful":1,"cool":1},"UhH5qbmGLVYhs9opuwCRfQ":{"text":"Shanna was awesome! Drinks were amazing.... $5 mimosas, LOVED the pulled pork nachos. Then","useful":0,"cool":0},"YHNgmetAXFYjyLQY9X5XPg":{"text":"My husband and I stopped in here for a quick appetizer before our tour that was meeting at","useful":0,"cool":0},"opRur9PU8_cOAe5MYlAV6A":{"text":"Had a great experience here.  As soon as I walked in I was greeted by one of the owners, R","useful":21,"cool":25},"77LSOe3gqUGZyBIjrbFYyA":{"text":"Four of us stopped in on Sunday, Seot 21, 2014 in the afternoon. We waited at the bar for ","useful":0,"cool":0},"NTcGSQUvn9c1e2cJGPNKvg":{"text":"As a part-time NOLA resident, I am always trying to keep up on my hometown sports. The fir","useful":0,"cool":0},"EXPPWtwFP6T25MRDrCBB5A":{"text":"So went to the bar during Mardi Gras with a few friends to watch the Wilder vs Fury fight ","useful":0,"cool":0},"pkIxGcq6Hn27bl_PCt3C0w":{"text":"The bar was awesome and so many televisions. We had no problem watching the game we wanted","useful":0,"cool":0},"dcH7Krif2WfKKkM0r-DsJg":{"text":"This restaurant was THE BEST SERVICE WE HAVE EVERY RECEIVED!! We had Tabitha as our servic","useful":1,"cool":0},"bwPeB1lDmSqImdhmllRg7g":{"text":"Known locally as a Packers bar, and normally packed with the sports bar type, we ducked in","useful":3,"cool":2},"tg1IUi8sNFvIsqRi4EhkOQ":{"text":"The day after superbowl we stopped in to watch a soccer match.  We were the only people in","useful":0,"cool":0},"Fp1992dpjenugW8mzn391A":{"text":"My friend and I were stranded in NOLA after Hurricane Ida, we stumbled upon this place, be","useful":1,"cool":0},"PhAUokdwdMpbyaHkJasSjw":{"text":"A few blocks from Jackson Square, this is a hidden gem for locals. Loud music, a balcony a","useful":0,"cool":0},"TkeORYZv0ggRbImP7fmdwg":{"text":"The food is not great and the menu is pretty small. Drinks were not strong at all. It's a ","useful":1,"cool":0},"ZJeKQD0WJ4DK2l2Bxkeifw":{"text":"I went here recently to watch the Conor mcgregor/Poirier ufc mixed martial arts fight. Tab","useful":0,"cool":0},"ErFM9Yh3bhej6OImhOQ5MA":{"text":"When you're going to choose a place to eat this may not be the place. We visited here for ","useful":0,"cool":0},"4dmLASYiuSjSFyfX7h7YZQ":{"text":"Amazing customer service, great food, and great drinks! Thank you to the awesome workers f","useful":0,"cool":0},"3SAyvGyBluaRjtOnctcelQ":{"text":"Never wrote a review before but was very upset after this spot. Visiting New Orleans wante","useful":0,"cool":0},"w_ZpjgyTzIBNUJS17aSisw":{"text":"This is a great place to watch a game, plenty of TVs and outdoor seating. The food could u","useful":0,"cool":0},"zYgxBESiKEfYSsbi7N3Zrw":{"text":"Went there for the Saints vs Cowboys game about three to four weeks ago.  Was not approach","useful":0,"cool":0},"R19nZmsXfyXC6hudALv7aw":{"text":"One of the best places in the quarter to watch a football game. The place is huge with scr","useful":1,"cool":0},"fziVLkU0p6MTRiheIVZ5YQ":{"text":"Love the bar food here. Jumbo pretzel, parmesan truffle oil waffle fries, any burger, and ","useful":2,"cool":1},"sWlAe8Ey-qUnw6ToAwW6gQ":{"text":"My fiancé and I were looking for a place to sit and eat on this lovely Sunday - our goal w","useful":0,"cool":0},"IFrDWwcgAzteaQG9oJfNAQ":{"text":"First time coming to this sports saloon. Our waitress was borderline rude, and obviously e","useful":1,"cool":0},"QPrL2o2NA0PWCB4BNFnpIg":{"text":"Came here to celebrate my dirty thirty and ended up staying for hours because my girlfrien","useful":0,"cool":0},"F-3xqldUK6GFPjo1V2_D5Q":{"text":"Picture it. \n\nNew Orleans. It's Fat Tuesday and sunny yet cold. Costumes are all over the ","useful":1,"cool":0},"xtm0vp9v2EeAES_GNdmEug":{"text":"An older white gentlemen Billy whom I assumed was the manager escorted my husband and I to","useful":0,"cool":0},"y1bBM1LT60VVjrWd8ZmmVg":{"text":"I was able to reserve a table via email request with no problem. Problem is when I arrived","useful":0,"cool":0},"QKap1isS3jowbmLWlojxWA":{"text":"Good spot for a beer and wings. The balcony was a nice spot to hang out and people watch a","useful":1,"cool":0},"-nk_URtzwDGQ4dQx7jJG7Q":{"text":"Okay so last Sunday, which was also 10/25, I've wanted to give this place another shot.  S","useful":0,"cool":0},"AA7-XveIlQ01oywOrThjvA":{"text":"Becca has been absolutely amazing. Steve at the bar has been the opposite. When I asked fo","useful":0,"cool":0},"wF3GvdztTIlVe2ofsghl0A":{"text":"Gotta knock y'all down a notch because of the cold stale waffle fries that you insist on s","useful":1,"cool":1},"UbgqEletA86Y6mEiBZLq9g":{"text":"Outdoor balcony was great! We loved the individual tv's at the tables outside. We watched ","useful":0,"cool":0},"ENH2wupkjvUSERtJBUP6tA":{"text":"American Sports Saloon is located down Decatur close to the French Market area. \n\nLots of ","useful":4,"cool":4},"CeQpoVCH8TSFYq7biIuRQA":{"text":"Well let me see. Anyplace that has no Tea, Ketchup,  only 4 of the 6 apps, 2 of the 3 sand","useful":0,"cool":0},"xeVI8Se66XFaJPwBXnkrkg":{"text":"Fun place to meet up with friends or find new ones. good service and tasty bites. Bartende","useful":0,"cool":0},"5PQ7X7VUokTW03rnOtlnQg":{"text":"Nice sports bar. Plenty of televisions. Great burgers. \n\nhttps://blainerestaurantreport.wo","useful":0,"cool":0},"CcRos2PvpLb_pGb8R9lIaA":{"text":"Lisa is a GREAT bartender ! Has great knowledge of you don't know what to order ! Very fri","useful":0,"cool":0},"RB0Jw7VImz-_Eqto8hPO0Q":{"text":"Top ranked sports bar in NOLA for good reason!  Great place to catch your favorite game, i","useful":3,"cool":1}}