{"hNnJbvk0O0Wp_O8SeobrcA":{"text":"If I could give this hotel more stars I would. Lovely experience, lovely staff. We were on","useful":1,"cool":0},"bl6INdFHDOwKjIJNs7Nnkg":{"text":"Wonderful staff! The hotel's theme is so unique and it flows throughout the hotel. Everyon","useful":0,"cool":0},"nSs4yA50EU50_9kHtXsSAA":{"text":"This hotel is BEAUTIFUL! The staff is friendly, helpful and HAPPY! It's very clean and com","useful":0,"cool":0},"gO6gnLYALh30tsi3i6LmAw":{"text":"What a wonderful surprise in the edge of the Warehouse District near the French Quarter! N","useful":3,"cool":2},"SwI53vxYe4Jac5xAiRwjHA":{"text":"Fantastic hotel with outstanding service. Everyone was friendly and personable. The room a","useful":2,"cool":1},"dIrnEUh6GMXss9UALKXKog":{"text":"My family arrived at the Cambria to be greeted by Kayla's smile and pleasant demeanor. She","useful":0,"cool":0},"k5W3nf90OwqL9lRe_pMGiw":{"text":"Excellent hotel and conveniently located! Will and Jazmine at the front desk started our s","useful":1,"cool":0},"Dh6Z42TOWake2m-7Us3iQA":{"text":"We stayed at Cambria before our recent cruise from New Orleans. This is a BEAUTIFUL hotel ","useful":4,"cool":2},"liiirPcLeXRLw2GWL9s1IQ":{"text":"Cambria Hotel is the only place I will stay from now on! Not only for its swanky NOLO bout","useful":0,"cool":0},"NM3KX7DpNW2Q8uRWAs1FHw":{"text":"Very friendly hostess, Mary, that checked us in.\nMary was very helpful and showed us how t","useful":0,"cool":0},"wpPf6uj5udIIP199yOfi0Q":{"text":"Stay far away from this hotel! The cancellation policy is absolutely ridiculous. I cancele","useful":1,"cool":0},"q6gOXYhx7w2qa0aFLCxkLg":{"text":"This is by far the best hotel stay we've had in our many trips to NOLA. Location is great ","useful":0,"cool":0},"1EeGLZoI3SGioyo-zHpsLQ":{"text":"Love love love this property. The staff is friendly and helpful we had breakfast here twic","useful":0,"cool":0},"H2hdFoZ8IFsUnLnopqammA":{"text":"This was one of my favorite hotels I've ever stayed at. It's really stunning inside and ev","useful":1,"cool":1},"W2mzDodf7-2aK2m89qVTiA":{"text":"This is one of the nicest hotels I've been to. Very cool local style and decor. Very clean","useful":4,"cool":1},"6yLjnQjlmtNhRoQ2fnmjMg":{"text":"Beautiful decor and great location I came down for work and choose this one based on revie","useful":0,"cool":0},"Of_1jKws4T1lQ9H5Wd3kHg":{"text":"The front desk was very welcoming and let us in our room at 10am even though we had 3pm ch","useful":0,"cool":0},"rrVyzR7v6HUakyMLv_EfiA":{"text":"This was a great hotel. I stayed here for two nights this week while in town on business. ","useful":6,"cool":5},"sPo5hD440hkbJ3DHN5wPSQ":{"text":"This place was great! Can't speak to the value as we stayed as part of a timeshare present","useful":0,"cool":0},"wmkHON57Tw0KFFYFXD3lPA":{"text":"This is my second time to stay here. I love the location as it's across the street from my","useful":2,"cool":0},"otGQiVUFpufqAD5oHGmWJg":{"text":"Great hotel:  walking distance to French Quarter, Harrah's Casino and other local attracti","useful":0,"cool":0},"IDSami_3Xgp1orWRx6FMcw":{"text":"Your Hotel is pretty, but I wouldn't tell anyone to stay there because you give people's c","useful":3,"cool":0},"y6fqjxh_9g8Lsg3hh88c3g":{"text":"The hotel was very nice and clean. The location was great and walking distance to many res","useful":0,"cool":0},"9N1-GSVAVgBWOE3yF9LRhg":{"text":"We really enjoyed our stay. The amenities were nice. Onsite bar and restaurant. The staff ","useful":1,"cool":0},"PzH1q8Zed0ml2_xbPeArag":{"text":"Beautiful hotel and spacious room. Especially the bathroom with two shower heads. Loved th","useful":0,"cool":0},"3NWpa0p6NwmZBqMjrbNgWA":{"text":"I liked this hotel and it's in a perfect location that is close to the French Quarter and ","useful":1,"cool":0},"tx3vMc7mj5wsUUQSVgCF4g":{"text":"Basic yet at least it was modern and with updated décor.  We had a view of a nearby roof (","useful":0,"cool":0},"tUZAlw2Hrk7bRYes05Stcw":{"text":"For this visit to New Orleans, I decided to go with a new, yet boutique hotel (my last vis","useful":8,"cool":4},"mA_kGIm24NLfFYwrdUrPCg":{"text":"I was curious what it would be like to stay in the #1 rated hotel in NOLA on a recent busi","useful":0,"cool":0},"bXLHxBsPQs5qT46cRtBwyQ":{"text":"BUYER BEWARE! They charged $250 \"room hold\" and kept it. They do this to improve profits. ","useful":0,"cool":0},"1L2Z-bLRzv0cd8ppX_Jrpg":{"text":"I stayed at the Cambria for four days and three nights. Let me just say that pictures do n","useful":6,"cool":4},"WNcgDSkmiY502AjqUBUrgA":{"text":"Location was perfect! Staff was extremely friendly. Room was incredible. Beds clean and so","useful":0,"cool":0},"m_JSoG1MKr3Y0DuiqVTchg":{"text":"***MAJOR NOTE*** Hotel address puts you at the back entrance, so tell your uber/lyft drive","useful":4,"cool":2},"JX0KhQXu_srd8dU6j1hZCQ":{"text":"I recently stayed here for a wedding. The staff was absolutely amazing. Sharon? SHARON!! S","useful":1,"cool":1},"f5-Tig4TXWOG18COENuyOQ":{"text":"Very friendly and welcoming staff! Room was spacious and contemporary, neat theme of concr","useful":0,"cool":0},"g7BiKjfK_hglnR6JzfKXsg":{"text":"The Cambria Hotel in downtown New Orleans gave myself and my Board of Directors an amazing","useful":0,"cool":0},"Osmg6d70itl4ACxybXeNyw":{"text":"Hotel doesn't have a spa nor does it have a shower in its gym.  They also don't have in ro","useful":0,"cool":0},"06vMEzzSp4N0Ci8oZNPLZg":{"text":"Got overly excited for the wife and I to stay here since this will be our very first time ","useful":2,"cool":0},"Dnh5Ppq1fPCbsbEBm32hYA":{"text":"From the moment we rolled up to the check in place, we were greeted warmly by the valet an","useful":3,"cool":2},"3E6IYXMTGpfonMHggizX_w":{"text":"Nice hotel in the quieter warehouse district.  Easy walking distance to French Quarter or ","useful":0,"cool":0},"l3TGJ0lHLe3UrwELVdct6Q":{"text":"Great boutique hotel. The rooms are clean and beautiful. I loved the exposed brick and cem","useful":2,"cool":1},"Ifu-ba0dDQjZ-2DGeyl0eQ":{"text":"We were in town for a wedding and the staff here was amazing and so accommodating. Mary at","useful":0,"cool":0},"LUqb7F7lLiwVCNSlvGCWjA":{"text":"This place is absolutely beautiful. The pictures from the website are exactly what you get","useful":0,"cool":0},"RNZl9fc4g-9TRudRAa3Dxg":{"text":"I loved this hotel.  Best part was the amazing bartender who dealt with our crew for an en","useful":2,"cool":1},"ANJaIS2tbOhmJqcAiXhk0Q":{"text":"Love this hotel!!! It's modern, sleek, artsy, clean, quiet and in the middle of everything","useful":0,"cool":0},"8lcUy30JztUZRSP0udzeWw":{"text":"My husband and I stayed here for 4 nights when he had a conference in the downtown area an","useful":16,"cool":17},"_5P2Vz_4WPGmgK-pk9kjWw":{"text":"We were so happy that we chose Cambria Hotel!!! \n\nWe stayed at the Cambria Hotel, New Orle","useful":0,"cool":0},"q_yZgJ_1OAjeCgH0nUT_iQ":{"text":"Great location, walking distance for all your needs. Nice rooms that are very quiet with g","useful":0,"cool":0},"j5rkiwMmydXVzqnajjGu-Q":{"text":"I wanted to like this place. I love New Orleans & this would be my first time staying in t","useful":1,"cool":0},"du1W1jjxCzYr3gSXLLKgKw":{"text":"This is our favorite Hotel in New Orleans. The customer service goes above and beyond. The","useful":0,"cool":0},"Br0rMLjQLUInaKnyrorUEg":{"text":"I stayed at Cambria for over a week for the conference. The staff went above and beyond to","useful":0,"cool":0},"rKZY57mE1xf8Bz1i1bYasw":{"text":"Overall a good stay for a quick overnight. Bar/food was closed pretty early for the area, ","useful":0,"cool":0},"WD6C7ErVhwGkNus0V0kaCg":{"text":"My daughter chose this place in the warehouse district out of several I found due to the d","useful":1,"cool":0},"o0ChGjnDtsk0iC90SDbGkw":{"text":"Upon entering the hotel I saw glorious decorations around the hotel lobby and the smell wa","useful":1,"cool":0},"fV5o27-FX8uZMO8FFM-Jcg":{"text":"Stayed here for three nights. The hotel is definitely modern and in a good location. The f","useful":11,"cool":7},"mrNU-wK09axqWdvYa4XJJw":{"text":"We enjoyed staying here. It has a different vibe and decor. Very New Orleans I guess. Room","useful":1,"cool":0},"vnMI9f88dX3U2wou5883gA":{"text":"First, I wasn't told there was a fee for valet parking, then the valets damaged my car, an","useful":1,"cool":0},"2CxfcGFLnt_T_quZxIMO0A":{"text":"Our stay was wonderful. The staff was really friendly and the hotel is beautiful. The bar ","useful":1,"cool":1},"OC0HYvik3RQ2WJZ7-cm9og":{"text":"Great hotel located in New Orleans Warehouse District - walking distance to the French Qua","useful":0,"cool":0},"p9MvKvy1SZs1nq_LXA_ZOg":{"text":"Stopped in New Orleans to stay for the night. Found this hotel through Expedia and booked ","useful":3,"cool":1},"FGA5y8Ps3aSFzvAiR1KYCg":{"text":"This is probably one of the best places I've stayed. The service was phenomenal and the co","useful":1,"cool":1},"B9gt-up3daHFj6koN34uLw":{"text":"Love this hotel and Love the staff here!!! Sharon and Will were so hospitable! I forgot fo","useful":1,"cool":0},"0xqxxpL0MQTlcf92vgqc4w":{"text":"This is one of the best hotels I've ever stayed in. The decor & attention to detail makes ","useful":1,"cool":0},"X-jKJhbij-U54cDQ7a6ZHw":{"text":"It's been 7 days since hurricane ida an I just wanna say that the staff have made my over ","useful":3,"cool":1},"pdu0nbLa86DSla6O_6FpHg":{"text":"The hotel and the staff were superb! The hotel room was very modern, spacious and clean (n","useful":1,"cool":0},"uqF568RHAZKYwbo5cf-_Rg":{"text":"The customer service we received from Max and Will was outstanding. Even before we arrived","useful":0,"cool":1},"QE6JRJDIkDHWj-bbph7WJg":{"text":"Huge room and very updated decor. Location makes easy access to the River, the French Quar","useful":0,"cool":0},"npy-mGNe5QrzqSBsCxswSg":{"text":"I very much enjoyed the stay at the Cambria. The staff was very friendly and even went out","useful":0,"cool":0},"RbaoyrQpXTcH7EfUfrA7_w":{"text":"The Cambria Hotel is a beautiful hotel located in the Arts District of New Orleans.  As so","useful":5,"cool":3},"CaMtf8mHg1j9_KN6VDz_3A":{"text":"I love a nicely crafted converted warehouse space as a hotel. They are usually artfully do","useful":0,"cool":0},"SsiksKwItKiA_nVq42aRmw":{"text":"The hotel is in a great location just a short walk from the riverfront, bars, restaurants ","useful":1,"cool":0},"Kt79P8ihPrqYzMUDAHYGTA":{"text":"Stayed here for New Years for four nights and it was such a great stay. Purchased on Price","useful":2,"cool":0},"MosF5nUFy_FIqbNo95eubA":{"text":"Literally the worst customer service I have *ever* encountered - and I have stayed at a lo","useful":2,"cool":0},"R3GiwXntjmBsNLrkR4jz_A":{"text":"Great hotel. Friendly and helpful front desk staff and also valet driver. Would definitely","useful":0,"cool":0},"ZRYHQkdppW-vf1b_29NXDA":{"text":"Okay, a beautiful hotel, great location, and very trendy. Hence, the two stars. But, the r","useful":1,"cool":0},"S0klQW-qBz7PyvcX4D54IA":{"text":"We absolutely loved this hotel. Spacious King Suite with a large television, sectional & m","useful":1,"cool":0},"pXkEsBDdZjDE-QsQkjq6tA":{"text":"This is by far the best hotel stay we've had in our many trips to NOLA. Location is great ","useful":2,"cool":0}}