{"FDWiRygraQmVWCoac3_2Xw":{"text":"Everything about this place is great. The first time I went I walked in trying to grab som","useful":1,"cool":0},"b5uzpvBh-9l11Wf2kegkBQ":{"text":"Nothing to write home about. Food was basic and underwhelming. Drinks were weak. Our serve","useful":0,"cool":0},"GKbSP7shgIEZsyyrOXGQhw":{"text":"Not sure how a restaurant in New Orleans can serve bland, slightly undercooked shrimp - bu","useful":0,"cool":0},"hEIws0KQh3t5eRURYf8Ssw":{"text":"We ran into this restaurant for a quick meal. The server came over to our table immediatel","useful":0,"cool":0},"O4eR2TS0cNuZ3_803EwV6A":{"text":"Great margaritas and great fajitas!  The shrimp was particularly tasty, along with the que","useful":0,"cool":0},"FWBLOJf2xeR3-0Xb-uBQJA":{"text":"Super-solid Mexican option either Uptown or Metairie. Won't blow your mind, but definitely","useful":0,"cool":0},"McgZ8gQ7WmPNzrS1QDIXQg":{"text":"This place has great Mexican food. We just popped in during covid mind you and decided to ","useful":0,"cool":0},"ptx6ycQoUujQRGVETw98xA":{"text":"Happy to have stopped by here for lunch. Delicious!! Friendly service, extremely clean res","useful":0,"cool":0},"KNWs7CRHsPEi5ZOZ7M6Dew":{"text":"Because The Rum House is the more preferred spot for adults without children, I decided to","useful":0,"cool":0},"piUwzKGOWLhaZEZ4IYInJw":{"text":"Alright service but worst El Paso I've ever been to. The food wasn't great and I actually ","useful":0,"cool":0},"dS-2qg9QPAKixTqfWDr4Bw":{"text":"Love Tex Mex and this place does not disappoint. \nI literally come here once a week and de","useful":0,"cool":0},"lUo4UgGsg3PneXc3pIut8g":{"text":"We picked up some food from\nmag st location- it was fabulous! We got 2 orders of the tacos","useful":1,"cool":0},"yrBBp_4iWcPQMEj3E7H8qg":{"text":"Update: My 6 year old is still up with an upset stomach at 11:30 pm from this terrible foo","useful":0,"cool":0},"c4WHHoHS0MCrbjKn1iYhgQ":{"text":"Excellent Mexican food. Friendly staff, large portions and literally right around the corn","useful":2,"cool":0},"HnOLl_iKcfUDerUtvKLoww":{"text":"Ordered Uber Eats and was so pleased! Ordered a large queso, bean dip, and veggie fajitas.","useful":4,"cool":3},"ApOGw8rSCUV7xnKUIFVH4A":{"text":"In a city known for food, well maybe not traditionally Mexican food, this place delivered.","useful":1,"cool":0},"YISOJbZh-ZAmDoEPfAT_tA":{"text":"Their fajita is great - I am not going to lie. Their complimentary chips and salsa are gre","useful":3,"cool":0},"AptuUTFl_0hG7lv72Q0WzQ":{"text":"I enjoyed this place. The service was great. The food came out really fast. Each table was","useful":1,"cool":1},"6IQaE3jBwUyUkUYdNaHDAg":{"text":"Had take out today, first time. Never going back. Worst Tex Mex I've ever had! Please, rea","useful":0,"cool":0},"m6Ljj2i2UkkNbJAqoNV-ag":{"text":"Service is always great here and the food and drinks are affordable. I ordered the Caramar","useful":1,"cool":1},"OHh6LQdxkv9Rp6n7u1m9NQ":{"text":"Great service, amazing street tacos, all the fixings, and great location right along magaz","useful":5,"cool":4},"vejRWn7VfnmvWj5mGc1vGw":{"text":"El Paso is a decent option for Mexican near the Garden District. We stopped in for a coupl","useful":0,"cool":0},"4LgOgsTU3jAPznop3BkQJg":{"text":"Awesome new Mexican restaurant on Magazine St! The food was delicious, the service was fas","useful":3,"cool":1},"seuYBRuVZM4G242EMuLAMQ":{"text":"I kept bouncing between a 4 and 5 star but tbh, I always end up leaving feeling hella good","useful":19,"cool":16},"Qkyj-WpxVUK6gSarPlX9Bw":{"text":"The corn carnitas tacos was everything I expected and more! I'm glad me and my friend went","useful":0,"cool":0},"jgVsu_bI-DgJPoz2DZP16A":{"text":"Went there on Thursday evening for the first time... take out order. The staff was great .","useful":0,"cool":0},"QEF9uAolnWUkY5j2TSxD6Q":{"text":"Best margs ever! The food was amazing but the margaritas were even better. Our service was","useful":0,"cool":0},"SJXY9FFcw4QySG37T9GrxQ":{"text":"Finally found a different texmex restaurant in NO. Forced to venture out because everythin","useful":0,"cool":0},"UAwdGKy2gyDgIkJAhyf64g":{"text":"Went on a road trip and didn't know where to eat. We stumbled onto El Paso Mexican Grill. ","useful":0,"cool":0},"AMaSZsbKQG_Xf3oVIDRs1Q":{"text":"Disrespectful business, and denies customers because of political beliefs. I will never re","useful":0,"cool":0},"ns77n5BvYvbttzl-DI1I6Q":{"text":"This was the first time at the Magazine location. The service was very quick and the food ","useful":4,"cool":2},"CDFKtV2Y1Mg6o6dqfTED5g":{"text":"This was the most outstanding and memorable restaurant meal of my entire half-century of e","useful":7,"cool":5}}