{"KNzYJjdQCzbRKaxsI3BvTg":{"text":"For over 10 years this has been my coffee shop of choice. Recent management changes has so","useful":0,"cool":0},"5NrqlE_7a6GLL9SNObZPRA":{"text":"I really like going to this coffee shop but it has its ups and downs. The upside is the pe","useful":0,"cool":0},"ZV8C4kaGOGP_YrixHQk0-Q":{"text":"Quiet little coffee house off the beaten path...the blueberry muffin was delicious, moist ","useful":0,"cool":0},"304rnIENo0r7poUC9SNMZw":{"text":"This is a great location. I have noticed that my friends call this the straight location. ","useful":0,"cool":0},"DwGccAgxQEo2ZNBoaVt-xA":{"text":"I have a soft spot for this CC's as I have spent lots of time here during college. I would","useful":4,"cool":0},"R5aeZ3fzzH3blnENUvPOew":{"text":"CC's is my regular spot to hit up for coffee during the week.  I work right next to Loyola","useful":1,"cool":1},"s_1WS8jV8fwn_9k97SLIFA":{"text":"Everytime I come here I am greeted with smiles and prompt service! The set up is roomy and","useful":0,"cool":0},"wz47bBZq9QIAk_qb5VPBBg":{"text":"I had a meeting at this CC's recently and it turned out to be the perfect place to grab a ","useful":9,"cool":8},"jF6kYbQA32LjHj_UA_4HYQ":{"text":"Now I'm screwed.\n\nI stop here to get coffee so I don't have to buy 1/2 & 1/2. Long story; ","useful":2,"cool":0},"hZFiyJBecRp4lD1uOIc2sA":{"text":"Friendly staff, friendly customers , and great coffee!! Nice place to sit down and study !","useful":0,"cool":0},"kx6Y6GcySRBkt666IgvbDg":{"text":"Stopped by CC's during my weekend visit to New Orleans. I wanted to crank out some work so","useful":0,"cool":0},"MP3Ezafq3nimMq1846Kdng":{"text":"If there's going to be corporate coffee I can not only tolerate but frequent, it's going t","useful":12,"cool":7},"yGp23ZSyqrT7LnVF2gTXEg":{"text":"Friendly, fast, nice selection, free refills!","useful":0,"cool":0},"FFUIKbrG3oV3Be35quJ2hQ":{"text":"Of all the chain coffee shops in town, this particular location of CCs is probably my favo","useful":0,"cool":0},"Ov39az7Pn9iBBtaI7dTo6w":{"text":"My favorite cc in nola. Great coffee. Great selection of muffins and cakes. Great trinkets","useful":1,"cool":0},"zt4kgPFIex8De_bSlkQasg":{"text":"Ew... what a depressing coffee place!  No smiles, no warmth, no music... nothing but borin","useful":0,"cool":0},"ZxTOvKxj0hzGnk9NY5oo3Q":{"text":"At children's hospital between appointments we had an hour to get snacks. I needed a coffe","useful":0,"cool":0},"TGry58JI4vfK-TPK3Eu7ZA":{"text":"Great neighborhood spot. Well staffed with polite attractive barristas. Modest pastry sele","useful":1,"cool":1},"ZH7skLxfk1whAQOWdPNxHQ":{"text":"Nice staff, plenty of tables, reliable free wifi, and plenty of outlets. Slightly too cold","useful":0,"cool":0},"bhUMGfiHAlj2LkXVmnF0vQ":{"text":"I like this coffee shop because it has good coffee, nice people, lots of tables with lots ","useful":2,"cool":0},"FZPGHW3B8vQ1eYuy6-Scrw":{"text":"At CC's coffee house on corner of Jefferson and Magazine on a Sunday evening. I am very ch","useful":0,"cool":0},"7zGeL9yUAv_cF_cpxXIF7Q":{"text":"I recently conducted two interviews here for prospective students to my college alma mater","useful":2,"cool":1},"otqx3cbiKGAA6g8TeLFGpQ":{"text":"I grew up drinking coffee milk in Louisiana (Community, always) and progressed to regular ","useful":3,"cool":0},"COyu_4-EcGn4kweXFFzA2g":{"text":"I have to say... Not at all impressed. \n\nI am from South Louisiana and I grew up on CC's c","useful":3,"cool":1},"TK9IhfxxUbbWdoCfMnR0gw":{"text":"Just want to do a shout out to 2 fabulous baristas! I'm from out of town visiting for Mard","useful":0,"cool":0},"HsW7Nfwg2uHja_QPjAm5Iw":{"text":"The cold brewed coffee was delicious. They sell the whole bean blend in a 12 ounce package","useful":0,"cool":0},"9j4FmE0jC_g1iqQybluHGA":{"text":"How can it be that I don't have a review for this coffee shop? Seriously, I think Yelp eat","useful":10,"cool":7},"DCF_Iz-fe3uIKkc2RsWaFQ":{"text":"National tea day? Who knew? My trip here for one latte turned into a drink buffet of one l","useful":0,"cool":0},"7ProjBqyx6uozfaN3gimVQ":{"text":"Need a quiet early morning study spot? This place is perfect.. especially now that the Gar","useful":0,"cool":0},"PGCsAi7i8fgAIVaYBdKMbQ":{"text":"Nice local chain. Love the classical music humming overhead. Incredibly friendly service. ","useful":1,"cool":0},"-aTVNZKaHLWvaf7SmIou-g":{"text":"Wishing this location would reopen after the other one closed on magazine street! There is","useful":0,"cool":0},"1N7Fu1ZxjRJv3RB3AGw_2w":{"text":"I can't quite put my finger on it, but so far this is my favorite coffee shop in NOLA. We'","useful":2,"cool":1},"7JPCP6flX26miI7fHJjKjA":{"text":"I've always liked Community Coffee but this was my first time visiting a CC's.  Here's a r","useful":9,"cool":12},"z7_uZg5Xj7C2em8go8DuHg":{"text":"You know when I'm out strolling before I make groceries, CCs is always a great idea. \n\nIt'","useful":1,"cool":0},"gmvtDWD1ofpyC9h6n82SlA":{"text":"CC's Community Coffee House is a great place to grab a warm drink after strolling down Mag","useful":1,"cool":1}}