{"TK3togG5jRld_Atj2Wysow":{"text":"Wonderful atmosphere, great service, homemade condiments to go along with really yummy foo","useful":0,"cool":0},"a6p9OOBGAqZFgD2_xcG8jQ":{"text":"Favorite place to go to lunch or dinner. Their specials are always great and they have ama","useful":0,"cool":0},"2a-ObqSZYz49S3r9Jt_uEQ":{"text":"My family and I kind of live here. We love The High Hat. We are also really predictable in","useful":4,"cool":4},"kOHbbvqVOSzNgYUe3IZNhQ":{"text":"I just stopped by here to get a Gumbo to go for lunch. I ordered a bowl of $8 gumbo and it","useful":3,"cool":1},"wormEkV-DpoQeM95R9jtCg":{"text":"A nice neighborhood restaurant with local dishes you would expect.  The BBQ Shrimp is grea","useful":1,"cool":1},"JU4JnWRVj3vGNTZyYFPNwg":{"text":"When my mom, sister, and I arrived at the High Hat Cafe at about 7 pm on Tuesday, 3/22, it","useful":1,"cool":0},"vgu65EaSk6_z2NbQqV0GaA":{"text":"Always looking for a hidden gem in a city with so many good restaurants that are often too","useful":0,"cool":0},"Xahf3XsjW0Vrzpe3hSLobA":{"text":"Very good.  Staff was extremely nice.  The slow roasted pork was great.  Very tender and j","useful":0,"cool":0},"a6vUsmOTHXYneVdYWAVXmA":{"text":"The Oyster Po-Boy.. best po-boy I've ever had in my life. Unbelievably moist, perfect crus","useful":0,"cool":0},"hHXP2qmxX1NupL0UqNTnMg":{"text":"My dad and I discovered this place after trying to go to Company Burger and finding them c","useful":4,"cool":1},"9Zp_6zi1g8YT7qgdBXTR4g":{"text":"We've discussed going here a few times before, but never managed to make it. We had planne","useful":0,"cool":0},"ZNT5WnGhqM0VLy4i9om2bQ":{"text":"I was a tourist who ventured out of the typical New Orleans food scene. We went on a Frida","useful":0,"cool":0},"FngF6i1a-oRsGvC7uvfW8w":{"text":"I ate at High Hat today for the third time.  I really like it.  First of all, it's in that","useful":2,"cool":1},"Zkv6JSJVb2LAQ9KoWlv4Cg":{"text":"Twice in one week.. what can I say... the Algiers Key Lime Pie rocks!  I like the nostalgi","useful":0,"cool":2},"E41DHAwo1JkCc34OfXYaYA":{"text":"My family and I love the brunch here. The chicken and waffle, Cuban sandwich, shrimp remou","useful":0,"cool":0},"5HTqkzrwmK8AZZmHgj1DHw":{"text":"Very happy with this after three tests.  Many name chefs open up informal restaurants offe","useful":0,"cool":0},"WVU4kk2XhQfbhUMC7Mw8hg":{"text":"A friend goes there just for the Happy Hour. He says the drinks are great, but then, this ","useful":1,"cool":0},"in7SPUVfuOZbIEZbpneGKA":{"text":"Highly recommend the burger here. Got the slow roasted pork added on. It's a big bite burg","useful":0,"cool":0},"PAHCK2KGJ8z0vhdFxq4OJA":{"text":"I had a wonderful experience here. The food was great, the service was great. . I will def","useful":1,"cool":1},"1Cn-_VrTdUOhDRjDUhWP6g":{"text":"When passing by this quaint corner resturant on Ferret St, seeing the 50s retro tile floor","useful":0,"cool":0},"Fis--zOBRl3lNfC-9JmDQw":{"text":"The food was good, homemade pickled pickles were yummy, my only issue was the shrimp hash ","useful":0,"cool":0},"58-BCn1AfVzF-Vlhnb44aw":{"text":"My husband and I have brunch at High Hat every time we go to New Orleans! The staff is fri","useful":0,"cool":0},"OoY5fHp4jV4SGydMjBLXDg":{"text":"My mother, toddler and infant were in New Orleans had a late lunch at High Hat Cafe. My mo","useful":0,"cool":0},"cIfG9j40TlYsQbPukpZMJw":{"text":"Delicious southern comfort food. Don't miss out on their homemade pickles. I had them the ","useful":0,"cool":0},"c6B_RoigFccFCyz5MwkTkA":{"text":"My wife and I stumbled upon High Hat Cafe when had come to find out that Company Burger do","useful":3,"cool":1},"30OdsaWVsx8qPnVddAkh1g":{"text":"Outstanding lunch! We had the pimento burger and catfish plate, yummy.... Everything is ma","useful":2,"cool":1},"Xrar5pOjm806MHICtiCZMA":{"text":"Busy Freret corner cafe that's been on my South Shore wishlist.  We went on a whim during ","useful":0,"cool":1},"ZI2MpSBdZ4Az2REHso_-dQ":{"text":"The food was MEH and service was MEH, went here because my friend said he heard good thing","useful":0,"cool":0},"rjQjUV2yWTvTAZZkKmTAbg":{"text":"Visit was on 5/14. I live about 3 blocks from this place and have never gone before today ","useful":0,"cool":0},"j1Pl5cTH0MwjWPZGA3VlKA":{"text":"Tonight we experienced some true New Orleans food! I had the BBQ Gulf Shrimp-it was FABULO","useful":0,"cool":0},"ycA6Mr-NTeTCC78e1BrVRQ":{"text":"This is an excellent place to eat lunch or dinner, the menu is a mix of local and standard","useful":1,"cool":1},"lg7MUEVwzGgsG0nDby0fyg":{"text":"If I'm craving a catfish poboy, I know exactly where to go. It helps that their food is al","useful":0,"cool":0},"IxoU6gtL7CfJKjBguhFvXA":{"text":"We tried this place near my home when we had family in town. There were five of us and eve","useful":0,"cool":0},"jwxs5MKVnzJFTNcjZ8nXWA":{"text":"I had lunch here the other day and I must say it was amazing. Try the pimento burger or th","useful":1,"cool":1},"S8N076KKdc0PFy6WT68Ypg":{"text":"I hold High Hat in high regard. \n\nAside from their delicious brunch and overall tasty food","useful":8,"cool":7},"trqM-eevT041IK2tYrRI2Q":{"text":"Great service, alright food. I had a fried oyster poboy with sweet potato fries (which wer","useful":0,"cool":0},"AxNPMixb3k3Dk25jQAB-1g":{"text":"Holy wow, I was really not expecting the food to be quite this good. I ordered a burger an","useful":0,"cool":0},"aFrDSnQC0PsOyAiCax73EA":{"text":"I make a point of getting to High Hat each time I am in New Orleans. Simple menu with trad","useful":0,"cool":0},"D_csGAFBISIoEWIR_sI78w":{"text":"Excellent catfish and hushpuppies done in the MS Delta/Memphis style of home!  Hushpuppies","useful":1,"cool":1},"6DHk13v9Yicj2ZTuawHSEA":{"text":"On a short stay in NOLA, we were fortunate to be steered by very savvy local friends to th","useful":0,"cool":0},"RtKEMSeSTsbLT6enB_bFHQ":{"text":"Delicious southern homestyle food. AMAZING cornmeal fried chicken- classic but not too gre","useful":1,"cool":0},"V7hZTxx3ktk4n727EwL5nA":{"text":"I've been to High Hat twice recently and had a wonderful experience both times. The first ","useful":0,"cool":0},"dJckVwCWk0_PRs4nANzYJA":{"text":"I went here once several months back with some friends eating full dinner but I just had s","useful":4,"cool":1},"hMefQqTzuvhWTAc4EJOv1w":{"text":"Loved it! It felt a little off the beaten path from where we stayed in the garden district","useful":0,"cool":0},"LkXGBbR62_M1AjjuLJIaOg":{"text":"Casual, comfortable Southern-style diner with old-fashioned charm. High Hat is one of the ","useful":7,"cool":2},"q3mKpQX7qIFjb0GBWed-Sg":{"text":"We really enjoy this little strip on Feret St.  I always see people at High Hat on our way","useful":2,"cool":3},"-x3MzpdWCCEV1L0KMDXGKA":{"text":"Over the years, the High Hat Cafe had seriously picked up it's southern comfort food game.","useful":0,"cool":1},"8lu-j2a6t7jALvO4vRuRUA":{"text":"Delicious! Some of the best BBQ shrimp I've had from a restaurant. Fabulous menu items lik","useful":0,"cool":0},"SPxnq5nj0JOqeEKpGlrq0w":{"text":"This place is darn good. I had an amazing Cuban sandwich with perfect vegetarian green bea","useful":1,"cool":0},"JbIgKFt5ium-tzpYNnB-3A":{"text":"Excellent grilled and fried catfish. Delicious fries and hush puppies. Tasty blood orange ","useful":1,"cool":1},"riYVf5m0H-DPHb_rlv_bjw":{"text":"Great food and service.  Fried catfish is the best in the area.  Mac and Cheese made with ","useful":0,"cool":0},"PJP_sZuhZSbMxlRlyN58wg":{"text":"This place was pretty good!(: My boyfriend and I both got the BBQ Burger he got with fries","useful":0,"cool":0},"XX21s9Pb5Ky8jhupPJjfqA":{"text":"The food was excellent. Best fried oyster Po boy I have ever had.  The waitstaff and Brook","useful":0,"cool":0},"HBKcjILiWFfIBp-DgeFtig":{"text":"I like High Hat, don't get me wrong. The meatloaf special I had was great. Never had I exp","useful":2,"cool":0},"AKTXBfj_xS1hH56kNdZkOw":{"text":"My review is only based upon their fried chicken, green beans with ham and their mac-n-che","useful":2,"cool":0},"c8j8gRLvLgN9TB-iW5FO9g":{"text":"Delicious food every time I've been here. The owner greets you personally at the door - a ","useful":0,"cool":0},"E5UshsXOpD_xmNikDsSuOQ":{"text":"I wanted to try something new, my friend suggested trying this place. As we walked in it f","useful":1,"cool":0},"_Ac37N6EiORevW6yCSFyZQ":{"text":"We had the roasted chicken, pimento deviled ham and cheese plate! \nOh my goodness so yummy","useful":1,"cool":1},"tP6dAOboLEh3MECHYO3TWw":{"text":"Do you like to go to restaurants where you're treated better than just a giant, indiscrimi","useful":5,"cool":4},"fIX3FgsEbpZWYmnx8JtUPQ":{"text":"Get the oysters they were awesome. Be aware of the greens they tasted like leather shoes. ","useful":0,"cool":0},"i2kTZQupKksMi_56JQAS9g":{"text":"I've gone here for the fried chicken day and brunch a million times. The chicken is on poi","useful":0,"cool":0},"mVXExMH8IpKPkG9OyGTCrg":{"text":"One of my fav spots in Nola. Greats: fried catfish, shrimp remoulade salad, margaritas, an","useful":0,"cool":0},"m7flVBI0sfAA-GHt-7V4tw":{"text":"Southern delights in a comfortable setting! After happy hour at Cure, my friends and I wer","useful":0,"cool":0},"hTTaJkFZHPL_6R_U-A0SVQ":{"text":"Good food and a place we like to go.  We had a family of 6 and was seated promptly with no","useful":0,"cool":0},"2vxuFEptrJF_ICtTKm-XKg":{"text":"I went there couple of weeks ago and can not wait to go back for the best Reuben sandwich ","useful":0,"cool":0},"MB9fw0upugzAza6Zjz6XpQ":{"text":"This is by far one of the BEST restaurants I have experienced. Savannah was AMAZEBALLS. Sh","useful":1,"cool":0},"uRmd_WD8gP1bur9CuwStYw":{"text":"I have eaten here about 15 times. The first few times were really great, truly 5 stars, bu","useful":0,"cool":0},"UBflBA5QCfDPhTQ17nBMBg":{"text":"Service was quick and the bartender was quite friendly, but the food was not that great. \n","useful":0,"cool":0},"chdY9IreuWkl9f8VLBbkow":{"text":"I think their burgers are the best in town. Check out their fish and specials they're fabu","useful":0,"cool":1},"WZ2v5EoHP-bkE9XxyQg-tw":{"text":"I visited again on 5/29 and ate at the bar for the first time. I ordered the burger with p","useful":0,"cool":0},"gmHXTvqTHZ7NXvsHK-uSoA":{"text":"The good is consistently outstanding, pork, fish... I would happily order the deviled egg ","useful":0,"cool":0},"oIzhQm7qce50O4MN9OZIBQ":{"text":"I wanted to love this place I really did.  But I just can't get over is the food that was ","useful":3,"cool":1},"6TCJglMcvFC2MMJH9axGVw":{"text":"Best mac n' cheese on the planet!! High Hat has great service...the owner is almost always","useful":2,"cool":1},"FkuxXOTuqTXSNpVYQgS4eQ":{"text":"It's good. I've been hear a couple of times at varying degrees of sobriety, and the servic","useful":6,"cool":3},"m4M_RyRx3ukqnVu_F2oHLg":{"text":"Ordered the catfish basket, pretty standard but subbed the fries for the sweet potato sala","useful":0,"cool":0},"OPi2Gi0_zTdVuQxlMae_Cw":{"text":"Always a great meal and fantastic service. I suggest the Okra and tomatoes. They are well ","useful":1,"cool":0},"6OjGC_ePYjDdqg9q8fX1vQ":{"text":"I just recently got back from NOLA!!! The whole purpose of my trip was to experience the c","useful":2,"cool":2},"_BYt4bIcy2GSK5Q6Eed0nA":{"text":"Delicious food! My friend and I got the catfish plate and a veggie plate and shared them s","useful":1,"cool":1},"52WmCfigcnETiIsUbhthAg":{"text":"Good food and good service-- had the chicken waffles and eggs and my husband had the Cuban","useful":0,"cool":0},"v5zf9Ew-1FZXlLdrA57dmA":{"text":"SOME OF THE BEST FOOD IVE EVER HAD IN MY LIFE!!!!!!!!!! I'm not exaggerating when I said t","useful":0,"cool":0},"5007WWXyi529dxNjrahgPQ":{"text":"Every time I visit I normally get the same thing the thin catfish with the pimento Mac & c","useful":3,"cool":3},"237uI1pT9i4HdI3mK2RKpg":{"text":"I gave this restaurant 3 stars because the lady who seated us was very rude. We walked in ","useful":0,"cool":0},"e-ZpXOJ9Dn8lbv5bsTvpDg":{"text":"Amazing fried chicken special the night we were there.  Good drinks, friendly service.  I ","useful":0,"cool":0},"hGoe1KVYe77H-Bnz2tMLzg":{"text":"We went for the catfish and it happend to be \"Fried Chicken Tuesday\" - lucky for us!  So o","useful":2,"cool":2},"ha6oHUwErgYaXnDHeYPsBw":{"text":"As a visitor to NOLA I've been to this restaurant twice.  The first visit easily convinced","useful":0,"cool":0},"y8S5u0xVjPLYlbzZa2uFAw":{"text":"We absolutely loved this place!\nDiner- CHECK\nGreat food- CHECK\nAmazing service- CHECK\nFast","useful":0,"cool":0},"-ywefMiYX7lc6FAEPuV9MQ":{"text":"Best burger in town, hands down. I love this place, great service and great for kids as we","useful":0,"cool":0},"YKVb_YqoOWPpd100K2bRIg":{"text":"We did take-out here and were very impressed. Good southern comfort food but not overrun w","useful":0,"cool":0},"pgeRmULwXSgLn8XirlvWJg":{"text":"Best fries in the city. Specials are always a great combo of food. Friends and I were here","useful":0,"cool":0},"B7fWiFBoymUC_Dk-Xz8mcg":{"text":"Great food, decent prices, but kinda loud. My fiance had to have her 11am conference call ","useful":0,"cool":0},"BJAJqJxqFNeshWJB84rRyQ":{"text":"So after the Saints beat Carolina I was hungry so I decided to hop on over to Feret St and","useful":0,"cool":0},"DXR01VHXdvUiWUExNf5rLA":{"text":"The Grillswith is a divine treat. The perfect caramelized donut - crunch and gooey inside ","useful":0,"cool":0},"z4JW56zvZlSP47yunxZpGw":{"text":"Second visit, not disappointed. Excellent service, delicious food. We brought friends from","useful":0,"cool":0},"i3IrsR0avZykeFSjWH3-qA":{"text":"Went for lunch again, this place is always on point! There is not much to say that I have ","useful":1,"cool":2},"CZVx08xB95nE2FxMpXbz0g":{"text":"The gumbo was far too salty for me and the collard greens a bit too mushy. But the ginger ","useful":0,"cool":0},"q3-6u6T8nIu0Obnn1ZNJuA":{"text":"Thank goodness there are places like the High Hat still around. Diner vibe, amazing southe","useful":0,"cool":0},"cW9vjNQj5jWA_rFJQzujUQ":{"text":"Im absolutley blown away.  This is by far the best meal i have had here in the city.  We l","useful":1,"cool":1},"WMxU3iaZtZpR_VVd9q9IbQ":{"text":"This place was super fun. Food was very good. Lots of flavor. Interesting drinks and food ","useful":0,"cool":0},"Rga6Ad2V2AotZ-6KfcPljQ":{"text":"This is a yelp review update:\n\nMy GF and I have been here probably 20X.  More than that pr","useful":2,"cool":1},"VYe4EKzFhQHoomZuBu4igQ":{"text":"Went up to Freret Street for lunch and tried the High Hat.  First off though, what an amaz","useful":1,"cool":0},"KsXFXEbRUh_s0yrCiqbtGQ":{"text":"I met a few friends here for brunch and was pleasantly surprised at how quickly we got a t","useful":4,"cool":1},"7kB15LwRZ2EfZZ7lp4uDSg":{"text":"My mom was in town and wanted an oyster po' boy. After walking around the Quarter for an h","useful":0,"cool":0},"ErtWXuVeyAriFeTSAxtlog":{"text":"Saw this place on Burgers brews amd Que.  The Oyster Poboy was tasty.  Hot buttered rum wa","useful":1,"cool":0},"-S0sCF_w6TG1gzAYhwEqBQ":{"text":"All Around Terrific!. Very juicy pan fried chicken is a can't miss item on Wednesdays or w","useful":0,"cool":0},"4yCiDCWtwYwb_jUD-SC0LA":{"text":"Brunch....Cornmeal Pancakes and a Rosemary Ginger Tea...That is all.","useful":0,"cool":0},"QsY4YcOSDYB018tFlHGFqA":{"text":"Very friendly and welcoming atmosphere. My husband loves the pimento cheeseburger. I love ","useful":1,"cool":1},"mJUlnWIzhwJaMdQ1gdT-cA":{"text":"I am surprised by some of the negative reviews. We have been here twice and have been noth","useful":2,"cool":0},"UgtLDtEWk5NjeAlMRKCZ5Q":{"text":"If your grandmother isn't from the south, give it a try.  Otherwise, you will probably be ","useful":0,"cool":0},"kbr1HO9bcPVdOYyG09emJw":{"text":"I went with a large group and we closed the place--thanks to High Hat for letting us take ","useful":0,"cool":0},"D8hWp3jVO9z4fI7E2jIMBQ":{"text":"We came here with two other friends for the fried chicken!!! It was very, very good. We co","useful":2,"cool":2},"jn87npPTtYT141A9oxmSKg":{"text":"I have been hitting the burger places in town as there are all these new chic places for t","useful":1,"cool":0},"CBiTU-1Iz3SBHiVKinkKKA":{"text":"I came here on a visit to the city.  The food was great home made New Orleans but I was es","useful":2,"cool":0},"BZtxSz_B_79dYRo3JClG_A":{"text":"20 Jul 2014, 07:30p\n\nOur local friend brought us here since it's one of his favorite resta","useful":0,"cool":0},"mFDGQJv5cazEWzsydIMX7A":{"text":"My quest for the most amazing hamburger in New Orleans brought me to High Hat.  I did my r","useful":4,"cool":1},"YNoBkV5jLVK_agAZWapsLw":{"text":"The server was a gem. Very real, attentive and welcoming. \nThe menu selection is also a pl","useful":0,"cool":0},"Yng29n4Em1j9wGyn1_wnwQ":{"text":"4.5 stars. Really good place. Solid food all around with some really delicious things - al","useful":1,"cool":0},"sRivgG5OL-GJShQy80MC_w":{"text":"I've only eaten there a couple of times but loved it each time. I and enjoyed everything o","useful":0,"cool":0},"Sjmv7CR51eP7c2C445HUxg":{"text":"Blend, Space too big no cache and expensive. No neighborhood restaurant spirit.","useful":1,"cool":0},"BO_yaqqxLtkbtbXKEIwJoQ":{"text":"I was out to celebrate my friend new job position and we were looking for soul food so i w","useful":1,"cool":1},"xqjXLGb94lVVS4TbgF3UdA":{"text":"Love this restaurant! Great diner style southern find food fabulous crafted cocktails woul","useful":1,"cool":0},"tDW2Tmjmkehgj-X6-nlxKQ":{"text":"Eight of us went to the High Hat for the first time last night and everyone thought it was","useful":4,"cool":2},"r08l5iqYIsLWGvi7koTe1A":{"text":"Tasty food and cocktails!  I really really enjoyed the dinner salad with the fried catdish","useful":1,"cool":1},"ISjoVf9h1y3SPX_IradpYw":{"text":"Yay for pimento mac and cheese!  Got the pork plate,  and seriously,  it's a huge slab of ","useful":0,"cool":0},"BmeU1wCW4iScUwlSUPXoLA":{"text":"Stayed at a hotel around the corner and had dinner at this restaurant two nights in a row.","useful":1,"cool":0},"6ViQvgR79_cDOwhBTsUMsg":{"text":"Great down home cooked meals . Everything they have is excellent. The owner is always ther","useful":0,"cool":0},"3ylWEx-qOhxB9YnYcUyv0Q":{"text":"We came in for lunch on their first Sunday.  E got the vegetable plate and the server was ","useful":7,"cool":2},"qxdatUGtXX-6kDd0Mq7dhg":{"text":"The place is nice. The food is good. The shrimp remoulade salad is amazing. The flat top b","useful":0,"cool":0},"rtdXbVWEGdZ1aJKhI1hcVA":{"text":"First off, I like this place because they had strawberry abita when ancora didn't. The bar","useful":0,"cool":0},"Kynyc_DxtZ3nRw6pO74BEQ":{"text":"Everything here is so good. We have been numerous times and are never disappointed. We alw","useful":0,"cool":0},"-oThBDQmyAr2FpNDciZ8TQ":{"text":"Oyster soup with bacon and greens was very good.  Had a dinner salad with fried oysters - ","useful":0,"cool":0},"gSvjVxzuBbTJpJFzRJyRBg":{"text":"Went in with friends tonight.  We were seated immediately and our waitress was excellent- ","useful":0,"cool":1},"iVXUjPS5rJ82R2B0yxfSuQ":{"text":"Didn't eat here, only had drinks so i can't comment on the food, only the cool cocktails. ","useful":0,"cool":0},"v-sKeXkQuRc334nBHLhRMw":{"text":"Best Cuban sandwich in New Orleans!  Burger is awesome too, just make sure you have extra ","useful":0,"cool":0},"REnJhr08vJUf3dIsT5maXg":{"text":"First off, their strawberry mint lemonade was ungodly. I only needed one drink because it ","useful":1,"cool":0},"-qcBlHcnmml9IgmoOaOXWA":{"text":"Absolutely my favorite place to eat in New Orleans! The fried chicken and hamburgers are t","useful":0,"cool":0},"TZjzJGTYCcz80YR1_RE1Aw":{"text":"Truly the best burger of my entire life.  High hat burger with pimento cheese is their spe","useful":2,"cool":1},"NXQSRJu_3yWCXc4X_yH1vw":{"text":"I would actually go 4.5 stars but that wasn't an option so I rounded up. \n\nOkay this was a","useful":0,"cool":0},"THt5mAkZzsuheb8kM3gpBA":{"text":"Did I say I love this restaurant previously?  Yes I did.  Is EVERYTHING here the best dish","useful":2,"cool":2},"Onebk3H0T53QiGWcYKm5hw":{"text":"Had a Friday off work and as usual I just started driving around town trying to decide wha","useful":1,"cool":0},"wyUoJsVbVqSxP5dozLjCJg":{"text":"A late afternoon Sunday lunch that is always great at this establishment. It was not packe","useful":0,"cool":0},"2dfd8UladM5SPM5NwKyzog":{"text":"We walked in about 30 mins before they closed and we were seated promptly. Our waitress wa","useful":1,"cool":1},"85NoxtU6LovYpPK-n9Jz_w":{"text":"Superb food + service. My party of 6 ordered the catfish, pulled pork, and a few reubens. ","useful":0,"cool":0},"tThi2OO-_Aftve6P_627Ow":{"text":"The food was terrific, though on the pricey side for what it is. I really wish I came with","useful":1,"cool":0},"0snH_qgJyFrXER3xu5NqGg":{"text":"\"THAT'S a roux!\"\n\nGreat cocktails, delicious food, we even like their beets. And that quot","useful":1,"cool":1},"TGCCykjXTMRsO7ktHRzYfQ":{"text":"This is a great neighborhood spot! We were staying close by and walked there. We had the b","useful":0,"cool":0},"p2Zo_EiWdxykeCd5CGxo_g":{"text":"Oh my goodness. This place is so delicious, I don't know where to begin. We went here for ","useful":1,"cool":0},"NMgMmOf-fzUGzqKL1FNQKA":{"text":"Went for brunch yesterday and had the pork debris and the oyster soup. I thought both were","useful":1,"cool":0},"0FXYG2wBQJCXKxCCW_bQrQ":{"text":"I've eaten at High Hat twice.  Both times I've had the catfish.  Although I am happy for t","useful":2,"cool":1},"qhBBHRVHbtdu68mvhrF1bg":{"text":"Best sweet tea in the city!!! Try the fried donut with ice cream!!!!","useful":1,"cool":1},"PZMB6ypks5v-BVqbpA3ThQ":{"text":"Mostly delicious fare save the dry hush puppies.  unlike the usual sweet ones, these have ","useful":0,"cool":0},"Ta7nD8yqT5m0RPVdgWwE2Q":{"text":"Although the atmosphere and staff were great, I was not completely satisfied with the menu","useful":1,"cool":1},"XpSke_NW3arAvek591zwMQ":{"text":"The waitress and I bonded over pimento cheese dreams. (We both have them.) High Hat is tha","useful":12,"cool":8},"kLcxFOtiDQQGyl5ih493DA":{"text":"We went for the fried chicken, but it was the wrong day. So, we ordered Fried Catfish and ","useful":0,"cool":0},"SCJQtLE1UYrftXxZCGQDRA":{"text":"The BBQ shrimp was good but didn't have enough kick. The cheese grits were delicious and h","useful":0,"cool":0},"qgPN-ClPnHhojGnwP5tY2g":{"text":"Just had lunch here. Best catfish in town. Cole slaw was good. The fries changes depending","useful":0,"cool":0},"TclrZencNyzEPHA_GGv4iA":{"text":"This place does regional dishes really well. And because it's off the beaten tourist path ","useful":0,"cool":0},"hCj6y9e1v_Q_IPsEEwfa_w":{"text":"Was headed to Freret St.  to try Company Burger, only to find out it was closed on Tuesday","useful":0,"cool":0},"AmPtNfcuWATWvcx1ic6hvA":{"text":"On a recent rendezvous to New Orleans, my cousins (Nola locals) recommended we stop by Hig","useful":0,"cool":1},"n6gZG5PzNrMcR9z_XsCpJw":{"text":"I had dinner here last night and the food was OK. I had the boudin for appetizers, which I","useful":0,"cool":0},"FPmzLktXHt851mhwp_vBiw":{"text":"Had lunch at this wonderful little restaurant. \nSpecials were diverse and food was excelle","useful":0,"cool":0},"LZov-gP6LwimMAN6VrtoZQ":{"text":"I've been to New Orleans a total of 12 times. I've done a lot of the restaurants in the mo","useful":0,"cool":0},"y5RK6Q6w1OS_A6YDJAf9vg":{"text":"Overall, food was enjoyable but nothing spectacular. Their watermelon mint lemonade was go","useful":0,"cool":0},"qO5CRGMvsiNLABkYeHbF6A":{"text":"I convinced my sister (who isn't and never will be as cool as me) to join me for lunch.  I","useful":4,"cool":3},"8bL9eIagnahhcELEpLxNCQ":{"text":"One of my favorite places in NOLA. I come here every time I visit; breakfast, lunch and di","useful":0,"cool":0},"eh8_SBcA47eTIDeLLr19Fw":{"text":"This place was definitely on my list to try.  I looked over their menu and they had the mo","useful":0,"cool":0},"SRQumThR6t6I8NK1M79S5A":{"text":"I really like this place, and end up bringing out of town guests here often.  It is a grea","useful":0,"cool":0},"tXuN0zID1Yx_nJfeqciScg":{"text":"Just like my daddy used to make!  The BEST catfish, hush puppies, and fries.  If you are v","useful":0,"cool":0},"W6z5V4krFxjpHDzW9pVQPg":{"text":"Omg! The mac & cheese, the cheese fries was so delicious! It was my first time here. There","useful":0,"cool":0},"1-Tyjqw6PXiFMGfDi5DvGw":{"text":"Absolutely loved this place! I had the rosemary ginger iced tea and it was delicious. Just","useful":0,"cool":0},"TJZcYywGRlvrYqxktGx9XQ":{"text":"The pimento cheese burger is one of the best in the city. Pimento cheese on its own- meh. ","useful":1,"cool":0},"bWFqNtxtT8zLIr7rd1xTDw":{"text":"Start with the sampler plate that features deviled ham, pimento cheese, and their specialt","useful":0,"cool":0},"DUVf58NRYq1M1cBPgY_62w":{"text":"We stayed at a hotel near by. Walking around we happened upon this place. Probably the bes","useful":0,"cool":0},"Bc3bOP18sK2NiESY9j7lhg":{"text":"One of my favorite restaurants. I love how the dishes on the menu are so creative and very","useful":0,"cool":0},"ilOOpEfFkCVMnNuUYq1Wxg":{"text":"I am so sorry to write this review, I come here quite often. Lately I have been disappoint","useful":0,"cool":0},"r6IFZozXOaf7yQWkZEBU2w":{"text":"One of my goals during my trip to Nola was to try bbq shrimp... since our uber driver was ","useful":0,"cool":1},"cBGvq5BP7uhD1HLVMtaj1g":{"text":"A great neighborhood corner joint. The good is standard quality in a city filled with unpa","useful":0,"cool":1},"A5eUfGALhtl3qpnf6r5_ZQ":{"text":"I had been hearing good things about High Hat and finally decided to go one day for an ear","useful":4,"cool":2},"Ll2sZ5ETr2MFi2nE1VdjmA":{"text":"High Hat hits the mark on all fronts...food, drinks, atmosphere, service...just an all-aro","useful":2,"cool":2},"oF3anOHk_NG0PmGHJzfejQ":{"text":"Stumbled onto this place after trying to avoid the French Quarter. \n\nBest. Detour. Ever. \n","useful":3,"cool":2},"ob-YsrRxfnO69X1AekHhvQ":{"text":"The food here is very good.  For lunch, it's a tad pricey - most everything is in the $10 ","useful":1,"cool":0},"_r1ZS1q6YrC_scWe18ML_A":{"text":"The service was awful, took over an hour to get our food. Waitress was rude and had attitu","useful":0,"cool":0},"Deotm3ByQUfV7aHqjNCU_w":{"text":"Great service, good drinks, okay food.\n\nLike the majority of restaurants in NOLA, High Hat","useful":9,"cool":9},"aQXWfFodWD1r_5QKZgB6pQ":{"text":"I fully expect High Hat to be 4 stars soon enough but they are still working some things o","useful":4,"cool":0},"ZGy_1pmnzysC_HW-E-mWeQ":{"text":"I have now been to Hi Hat several times and really wish I could scooch that rating to 4 1/","useful":0,"cool":0},"UkeXVlbxDXlG3KeUmGyokA":{"text":"Highly recommend the cocktails.  One of the manager infuses his own special liqueurs that ","useful":0,"cool":0},"7qzYCzVJIrXvYkNJnvUc2Q":{"text":"One if my favorite restaurants in the city. My most recent experience was for my birthday ","useful":0,"cool":0},"qU68d_dWasoj5cTJGBXt9A":{"text":"I was extremely impressed by the service which i noticed right off the bat.   very good ho","useful":0,"cool":0},"0YRnkiPKLh0AxpBxHcOMVA":{"text":"Good things come to those who wait, and the wait is over.  You must go to the High Hat and","useful":6,"cool":2},"joOx_or9MgIYtChbNFzC4Q":{"text":"I have been here probably 3 or 4 times.\n\nThe craft cocktails ARE very good, and they're co","useful":1,"cool":0},"06FJZfsqJiMpwndDaopBWw":{"text":"I've been twice now, on two separate visits to the amazing city, and this is one of my fav","useful":1,"cool":1},"DMjApAdnE5GcyNIxP3kGuQ":{"text":"First timer.  Savannah, the bartender, was very nice and explained the good the bad and th","useful":0,"cool":0},"WwDcUQ72LJKnQtDXOcGR_Q":{"text":"Institution ! Fried chicken is my fave ! It's not Willie Mae's chicken but it's still qual","useful":0,"cool":0},"9TDBbsRpwMvvQt2TZ8Kc9Q":{"text":"On a newly-opened street in Uptown NOLA, High Hat is a great place if you're looking for a","useful":0,"cool":0},"JLuKiP2QIgtZhmWGYLfVjg":{"text":"Pretty good soul food. Pimento Mac and Cheese was to die for. BBQ Shrimp a little over coo","useful":0,"cool":0},"cXB3m5g0bkCf0X_-EIFTlA":{"text":"Great food. Great drinks. Great prices. The atmosphere could stand to be updated and the g","useful":0,"cool":0},"4zZSXwmdhcJliXoTWriq4g":{"text":"This place is so adorable! \nTo start, I had a hibiscus iced tea. First let me say this- I ","useful":0,"cool":1},"jox9CSa1nF0T_UOQq5UArg":{"text":"Went by today to try it out and was pleased to see a Saturday brunch menu. After a quick p","useful":0,"cool":0},"rjUo0-QqrJ-h7nfk3QnAEQ":{"text":"Had the fried oyster remoulade po-boy today and it was easily THE BEST po-boy I've ever ha","useful":0,"cool":0},"4ymr6v1RmlJR4CQRK3jNEw":{"text":"The High Hat Burger is precisely what you need in your life! I am a fan of Port of Call bu","useful":1,"cool":1},"bu3FDDxwz7u9dn8vzGs6dA":{"text":"The food was only mediocre, and certainly not worth the price. While the entrees are only ","useful":1,"cool":0},"R-dk_JbiWcsnKKTvXtDf2g":{"text":"We've been semi-regulars at High Hat for the last few years and I just realized that my ea","useful":1,"cool":0},"m2AmzcVT9OTJdl3lg1kHtw":{"text":"I love this place, and love the people here.\n\nHave probably been here over 50 times.\n\nAwes","useful":4,"cool":4},"nYilj2iyrS8T69jo0onQzQ":{"text":"I really liked the food only my husband & I both ordered hamburgers medium & we got medium","useful":0,"cool":0},"FIPBmhqn3YimO6vJrjA7Ng":{"text":"Whole catfish is hard to find, but I found it here and it was delicious along with the hom","useful":0,"cool":0},"XOdIj2IN0LKAa1aGgk0zxw":{"text":"OMG!!  I've had some of the Best Burgers in the South,  or so I thought! I recently moved ","useful":3,"cool":0},"rPtC9KoIM1YN08Ofj7L3bQ":{"text":"Pulled pork poboy was delicious and must have desert called grillswith. Burger was a bit o","useful":0,"cool":0},"pwplB0RnKMuKiHNdyS6wCQ":{"text":"Ok, but not great. Let's focus on the great: my drink, the 4500 outstanding, the green bea","useful":1,"cool":0},"VcYSKWpuz_HpDPewIHAM8Q":{"text":"It's taken me awhile to try out High Hat since moving into the neighborhood, but I was ple","useful":1,"cool":2},"4fbe5g-03CoJgEScsTbf4g":{"text":"Service was amazing.. I got the strawberry mint lemonade and it was delicious. I also got ","useful":0,"cool":0},"kIop3_eCGDJ8z8ex6xZxrw":{"text":"Our first trip to High Hat and while I can't say I'll never be back, I won't be rushing ba","useful":0,"cool":0},"iszUJB5dimSqiMaeuKHSug":{"text":"Four stars for the cuban sandwich （beyond expectation）and three stars for the high hat bur","useful":1,"cool":0},"bu6SdLBiCd2GPZNN8ib_BQ":{"text":"Daughter and I love their Sunday brunch, they have the best Oak meal pancake. Their homema","useful":0,"cool":0},"kpNQKuPll6LwO16IozQ-OQ":{"text":"It's not bad. The oyster poboy was pretty good as well as their fried okra. Unfortunately ","useful":1,"cool":1},"SRXnH60D07UyLwKYkyuUyg":{"text":"I had the perfect Reuben here at the High Hat Cafe. They let me substitute pimento Mac n c","useful":0,"cool":0},"Xw3nYUbDpDwNAiAwE3bdAw":{"text":"After our first experience, we went to High Hat maybe another handful of times.  And the f","useful":9,"cool":1},"fIyhJ7btkCI4MfduICTOxA":{"text":"Fast and friendly service, casual atmosphere, thirst-quenching \"fresh-squoze\" lemonade.   ","useful":2,"cool":1},"EAxTcowZDvEV_Bs-5f4leA":{"text":"Went here on a date a few days ago, and loved absolutely  everything.  We had to wait for ","useful":0,"cool":0},"FiXaukaazear_atlRhi_wQ":{"text":"I've eaten here a couple of times. It's definitely gotten better. I had the soft shell cra","useful":0,"cool":0},"wGseO0Tj0BSjgwPe3Jr_Ng":{"text":"Went here with my family fro a late lunch on Saturday.  Had to wait for a table it took ab","useful":6,"cool":1},"dkZ2JAAbJUrrupuKbsPRDA":{"text":"Our server, Lee, was very helpful and excited to be there. She did a great job but, there ","useful":0,"cool":0},"wLBxPKVmbEWzci9nq2cd0g":{"text":"My first meal in NOLA was here at High Hat Cafe suggested by our local friend. We arrived ","useful":3,"cool":1},"B8n9VnO006iNIKx5CPH0wg":{"text":"The Pimento cheese burger is the best hamburger in the city of New Orleans.\n\nI've had them","useful":1,"cool":0},"ZvI2ZeHakUWkE2u3h8R4rA":{"text":"The food wasn't bad, but it didn't amaze me, and neither did the service.\n\nWhen I asked if","useful":1,"cool":1},"_HLK8A1TcaCG387xuJVSjA":{"text":"MEH\n\nI ordered fried fish and baked mac and cheese. \n\nMac and cheese was fine but the frie","useful":1,"cool":0},"WeLVxf7kFQnnNa8nt3-5Aw":{"text":"The food was absolutely amazing! The pimento cheese grits are the bomb! The waitress was s","useful":0,"cool":0},"UZC-hR3TBylQPLLX_I8cSA":{"text":"High Hat is a really cute little eatery on Freret Street that exudes quite the opposite of","useful":0,"cool":0},"WPa6kiab1fFazL6UuhGUVg":{"text":"Let me just say this: fresh, house made pickles!  What an awesome, underrated spot!  Inspi","useful":0,"cool":0},"eOW4r8rQssc1gS1bMyUysg":{"text":"**three star deduction**\n\nI've given High Hat some pretty awesome and detailed reviews and","useful":9,"cool":5},"-VeGx2m0q99Ny2Dv9J2kqg":{"text":"Absolutely love this place. It was my first time here and I will definitely be back with f","useful":0,"cool":0},"R3bwLhBv92toTzrgDSRaaw":{"text":"Adolfo Garcia shows us his version of traditional southern cuisine on the Freret St. Love ","useful":0,"cool":0},"4YCvAZYpK_atP8_Rli0U1Q":{"text":"I tend to only write reviews when I find a place that really deserves it and I stay away f","useful":1,"cool":0},"Bqs6fVfhlzt_YCUo0PjhmA":{"text":"Can't say enough great things about High Hat Cafe!  Very friendly staff.  Food was excelle","useful":0,"cool":0},"z8k1i5-iQLjCYuWjyMIk7w":{"text":"This Is a casual neighborhood eatery with excellent food and interesting cocktails. I've d","useful":0,"cool":0},"wWTL7PTLdh03SEQNHOZdnw":{"text":"Food lovers' paradise of the highest quality.  Fresh locally sourced ingredients. \nIncredi","useful":2,"cool":0},"WfV-AG1tT4YXos8hY_1ksg":{"text":"The absolute best macaroni and cheese I've ever had. I could have eaten an entire bowl as ","useful":1,"cool":1},"uD5hPAIv9ODHYEbHy7I2Kw":{"text":"I came in on a very busy night. The service was very attentive without being overbearing. ","useful":2,"cool":1},"xFqHSu55OzyV4ubhMJUhIw":{"text":"The boudin was darn tasty.  I had the catfish. Really light and crispy.  Highly recommende","useful":0,"cool":0},"h753mBcbgLhlrDl2tHfDVQ":{"text":"My simple check-in kinda said it all: \"yum, yum, wow. Go here.\"\n\nI had a burger and fries,","useful":0,"cool":0},"fO5sZxCGFfe18BxWcKwaFQ":{"text":"High Hat is not high on my list to eat at again. In a town where there is so much good foo","useful":0,"cool":0},"RE1617wUY2MSGsRKKW9MXA":{"text":"My friends and I went to the High Hat Cafe while in New Orleans visiting a localè. The gum","useful":0,"cool":0},"wN5033RJoLIJatYtKMY2Yg":{"text":"Everything was GREAT! Fried Okra, Oyster Po Boys, One-Eyed Burger, Catish basket, green be","useful":0,"cool":0},"YV2G7N1zk52EC4H_K5WWSQ":{"text":"Call ahead and see of they have fried chicken. If they do, sprint over there. If they don'","useful":1,"cool":1},"WiGyKVa0lL4DODmZ6FpI1Q":{"text":"Don't get up to Freret very often, but if I'm in the neighborhood, this is where I stop fo","useful":0,"cool":0},"GUsi_u9gFADcVhZhz18YBw":{"text":"High-Hat is a throw-back Southern restaurant in the trendy Freret St. area.  The decor is ","useful":1,"cool":0},"11QSwuJXKZDWo4JuRZSJKA":{"text":"Here tonite for the fried chicken dinner with pimento Mac and cheese, greens, and crispy o","useful":0,"cool":0},"LEV_cFyvi_4exuNc8BD1_Q":{"text":"3.50*, fish was on point, chicken was cooked well but,  flavor was not there.\n\nFancy cockt","useful":0,"cool":0},"72sLtAkYLL4O5tK-UZqGzw":{"text":"I tried High Hat for the first time today for lunch. Since it was Sunday, they had some br","useful":0,"cool":0},"WGP607Ebhwjar0DA5Z0wCw":{"text":"I ate the best bacon cheese burger I've ever eaten my life.  Everything was perfection!","useful":0,"cool":0},"jka3zBLjIKG3njNwKHR6Jg":{"text":"I think I've decide that High Hat is just that OK. I still go here when friends want to gi","useful":3,"cool":0},"I6xcOLgserHZ6G2aBhAPiQ":{"text":"Seriously delish gumbo, made with a dark roux!  The tossed salad was fresh and plentiful. ","useful":0,"cool":0},"yOgPZMahfyk1Udr79cqK9Q":{"text":"Becky was awesome! She was our waitress.....I had the grilled catfish with the pimento mac","useful":0,"cool":0},"FSxlDVsokMaDwIwtKlrgmQ":{"text":"So this place has an undeniable Hipster vibe to it. Don't let that discourage, or encourag","useful":0,"cool":0},"EXPgic_yvqK_MIrFU8V5rQ":{"text":"Until last night I had never heard of High Hat but I have a feeling we're going to get wel","useful":2,"cool":0},"B_PzjeiudRZG2TXKuDde1w":{"text":"Ok. I went here for lunch today and it was amazing as usual. I live really close and go he","useful":2,"cool":1},"GMxMw6KNeEIFt9r7eJnlYQ":{"text":"The food was amazing our waitress was really helpful and nice but the host was terrible si","useful":0,"cool":0},"yJCskW6GSgyIKsEuLbK0ng":{"text":"I've only been to High Hat once for dinner, and I got a reuben.  It's my favorite deli san","useful":8,"cool":5},"I4-r2sCtZ1BP7evpiw32Yg":{"text":"We had slow roasted pork w/ mustard greens and fried catfish w/ fries.  Liked both very mu","useful":0,"cool":0},"uExuNW0pGzG7GIk9DcORaA":{"text":"Whenever I visit a new city, I make it a point to get away from the tourist attractions an","useful":10,"cool":7},"Tmav_Ouh2_YaPgBQcvaNCg":{"text":"High Hat has the best BBQ Shrimp in New Orleans, trust me. It is so good I don't even know","useful":1,"cool":0},"iUxu3aqrB3Bst-Ca700wdg":{"text":"Worst. Service. Ever. We left after 45 minutes of waiting for our food and being promised ","useful":1,"cool":0},"P_IfjoNZnne6Aj5tpd_xgw":{"text":"Found this semi family style restaurant  by word of mouth. I had the High Hat burger & it ","useful":0,"cool":1},"u-YKo0p_l8xXpeDgK5Wdig":{"text":"Thanks yelp for helping us find this place. Best greens I have had in a long time. We will","useful":0,"cool":0},"ABuvKzSCv2ltioinoP-zfA":{"text":"We love this place!  First of all, Chip, the owner, took pity on us and sold us drinks whi","useful":0,"cool":0},"5w53XUMZBQEFqkizO_ek2w":{"text":"Went in for quick bite a friend told me to try their Flat top burger. It's a decent sized ","useful":1,"cool":0},"4LVOVWm_0jnIUON7wW6-Pg":{"text":"Our first night in New Orleans we ate here. Service was good, food was excellent. We also ","useful":0,"cool":0},"PWgnTTovkaouuwEryZtQNw":{"text":"The shrimp remoulade salad was absolutely the best! The remoulade dressing is a vinaigrett","useful":0,"cool":0},"Je2sniLmMYKayaM_135_hA":{"text":"This place is a hidden gem! Unlike over hyped places in the French quarter, this place act","useful":1,"cool":0},"N-34DYcRqG4g4mKialycHg":{"text":"The Good-My wife and I got the whole catfish, crispy and delicious, with stewed tomato and","useful":1,"cool":0},"5GoWplDY5BxGTu_FASeevw":{"text":"A friend and I went in today for lunch. My girlfriend had been in the day before, came hom","useful":1,"cool":0},"uG6vZxgYWd3P3slG_OgHQg":{"text":"Great service! We ordered the fried oyster po' boy and it did not disappoint! The waitress","useful":0,"cool":0},"qb-aSFn9PNVGYK7QjskNfA":{"text":"Came here during a weekend visit in the hopes of having good southern diner food while dod","useful":2,"cool":1},"hpYH-4WNI1m89GNjnPP1Gg":{"text":"I had the shrimp po'boy and it rocked my world.  I guess it should be noted that I was sta","useful":2,"cool":1},"SMZZD9gofyd9Bpu3eG2HPA":{"text":"Yummy. Had Southern style veggie platter. Corn meal battered whole okra, pimento cheese st","useful":0,"cool":0},"7GgLyea1P2Vk3sTHt4n4XA":{"text":"High Hat has earned its position as our \"go-to\" neighborhood restaurant.  The pimento mac'","useful":0,"cool":0},"4hbUsxT5A011UEpg6Cd-Pg":{"text":"Cocktails with seasonal, local ingredients and homemade cola are so good. The 4500 is my f","useful":1,"cool":1},"WvtQWUE5ZoU-1uQ6l7K9sQ":{"text":"High Hat is a newly opened little place on Freret street. The food was very ok (in a good ","useful":1,"cool":1},"a-_mVfvAy-d8jKjIR8K4pw":{"text":"Solid all around. Drinks are great. Best margarita in Nola which is a little surprising. F","useful":0,"cool":0},"_PrYAf1NJ9BnqP3q--rwLQ":{"text":"This place was awesome. Very happy we found this place. Deviled eggs were delicious.","useful":3,"cool":0},"V_rUUY15gUOcSp-9-D9Y1Q":{"text":"I feel like this is my favorite place on Freret St. HANDS DOWN!\n\nI absolutely love this pl","useful":3,"cool":2},"vMjowyqYO_-OvYgdQ8GK5Q":{"text":"High Hat has been on my list of places to try for a long time so I am happy to finally say","useful":5,"cool":4},"0zLskNfiW9f1IO6met0rWQ":{"text":"This place is LITERALLY THE BEST PLACE EVER!!!!! The BBQ shrimp will change your life!! I'","useful":0,"cool":0},"lyJa36Ah8pKEAstWFjQXOg":{"text":"I was excited about this place and it looked promising, but it was such a dissapointment. ","useful":1,"cool":1},"AMCZutIaoMjEeohgwBGV1Q":{"text":"This place was very nice. If you want to impress your date, I would recommend this place. ","useful":1,"cool":1},"-XWQ1QGVWv5oUgOwEyJdRw":{"text":"I found the Hi-Hat on Yelp & wanted to try it. It definitely did not disappoint. The atmos","useful":0,"cool":0},"rVMqOENHCPXSJvKZUo_HLg":{"text":"Okay, I've only been once but I'll definately return with my sweetheart, who will be in ch","useful":3,"cool":1},"MHi4rWYIz1Pvg6ovT-Xrqw":{"text":"This is quickly becoming one of my favorite go to places to eat!  Every time I come here t","useful":0,"cool":0},"6ik31-knzoYCwivtCChniA":{"text":"The High Hat cafe is my favorite place to eat while in New Orleans! Everything I have eate","useful":0,"cool":0},"zrT2sU3QUZaOZr2B8jsWzA":{"text":"UPDATE:  The place has taken a jump ahead.  The place is most similar to the Southern Cuis","useful":2,"cool":0},"M1dG240_g1Kv9MU-annq-g":{"text":"Wow!! We , literally stumbled into this hidden gem. The food, service and drinks were STEL","useful":0,"cool":0},"TDXX73rUKgppaQMV-j1cCg":{"text":"YUM!!!!! on our way to the Freret St Market (Freretstivus  Dec 10th market) we walked by &","useful":3,"cool":1},"y6i0LRKrHZYPeIqrIffVZg":{"text":"Let's start with what was hands down the best single dish I have had in NOLA: the oysters,","useful":0,"cool":0},"rXi-UMEz5vF7I6ARp2aQkw":{"text":"So servers were nice and understanding. It's a quaint little cafe with a diner feel. I had","useful":0,"cool":0},"5ixpBvjPT4D--ncajpROZQ":{"text":"YUMMY! This is now one of my favorite go-to places in NOLA. The corner store set up within","useful":0,"cool":1},"7ETxHynETL-a2hiVsQC-HQ":{"text":"Everything was fresh! They shop local farmers markets and prepare specials. The fried okra","useful":1,"cool":1},"s0lU-ZUvYkpKYYs6z3lnag":{"text":"Well the food was good, but if you bring kids with you and they eat off the kids menu they","useful":1,"cool":0},"avYUa1tx5dH2yk_JgFk_aQ":{"text":"We love this place! The fried chicken, the burgers (esp with the pimento cheese), the dess","useful":0,"cool":0},"fGYuPqKTmXI3Uw9Ca5j67Q":{"text":"I came in on a Saturday morning and ordered the pork plate.  First, understand that I have","useful":1,"cool":0},"hcQluQiMAzW6xkRjRBMSpg":{"text":"Was probably the best meal of my trip. Fresh ingredients with a nice twist on traditional ","useful":0,"cool":0},"oka47joso9INNXnp0t9-Lw":{"text":"One of the best oyster po boys we've had in New Orleans.  Great atmosphere for Saturday lu","useful":0,"cool":0},"TPtK0rfdi-uo5AwzT9_g4g":{"text":"If you haven't eaten here please do!  Tonight I had the bacon wrapped meatloaf with creamy","useful":2,"cool":0},"E7ZYGfr39BpYSOY55t0BjQ":{"text":"My neighborhood favorite. My tried and true. Love everything, especially the rosemary, gin","useful":1,"cool":0},"Kxg-TDk7SVsRrQA6m4TQEw":{"text":"As glowing as this review will be, the words and pictures will not do this place justice. ","useful":4,"cool":2},"wXkdDHdT8zI2Qe5rZgFr3w":{"text":"I suppose I have a Midwestern Palat ( I come by that honestly). New Orlins is a beautiful ","useful":2,"cool":0},"MTyhIYhj8aFAoqj1UtXdDw":{"text":"High Hat is really good, I just think they need to offer more healty options on the menu. ","useful":1,"cool":1},"fjEYhLuahlRP9InYGbR_2A":{"text":"We were very disappointed in High Hat.  It has lovely tile floors but no curtains to help ","useful":1,"cool":0},"b6ZqE59GYxgDE-twBs4MhA":{"text":"I've been driving by High Hat on my way to the other Freret streets restaurant and finally","useful":2,"cool":1},"D87rKtpDULzAeKwvSwGL5A":{"text":"High Hat does Southern right. This is my second visit and each time was worth writing back","useful":1,"cool":0},"mEixzm--ookjNEA3PUTkKg":{"text":"Okay, I've put off writing the review because I thought maybe I just came on an off night.","useful":1,"cool":0},"PUs8Fsx1knuXxYAjSAb0Gw":{"text":"Friday Shrimp Creole is excellent, wife's fav.  Oyster remoulade po-boy delicious, but be ","useful":1,"cool":0},"bqSbwOLRv7P7Aw9u6aoHWw":{"text":"This is a great little place on Freret. Cool ambiance. The food was definitely a 5. Two of","useful":0,"cool":0},"S4NuBEKAlAD-0nYTf9YJnw":{"text":"Great atmosphere, friendly staff, great drinks and food. Everything we ordered was very ta","useful":0,"cool":0},"Y3FBUhTQj30Uvamew6NfNQ":{"text":"My new favorite restaurant-- tasty, creative versions of Southern classics. Friendly staff","useful":0,"cool":0},"GZ-qlGz8uQvILHuEKviAjg":{"text":"For years and years I would pass this place and always see it packed every weekend . So I ","useful":0,"cool":0},"GZS5sQlDrxg38dPdFZKUqw":{"text":"Called to order a pie more than 24 hours in advance. The manager refused to sell the pie b","useful":0,"cool":0},"8v5dkZ__Xj4k5RBtArWYyA":{"text":"Fried Chicken!. The menu at High Hat is southern food at its finest. Everything we have tr","useful":0,"cool":0},"4T8cHOUEZZDXeYsP4__pNw":{"text":"I love High Hat! High hat is such a good representation of the revitalization of Freret st","useful":0,"cool":0},"KcIM-YINm1MmvLzZcKI6Sw":{"text":"I had a great lunch at High Hat.\n\nThe shrimp poboy was really good.  The shrimp were cooke","useful":2,"cool":2},"Ho2PovoycXgfKqmExUSWuQ":{"text":"Inexpensive and delicious. My husband had the smoked 1/2 chicken with fries, he really enj","useful":0,"cool":0},"tQW6UL76Pcjm1vxD4NtqEw":{"text":"My first time here yesterday and I'm already a big fan.  II had a great lunch and really l","useful":3,"cool":1},"lPeYIJ7Wm_m1pYewZLQHNw":{"text":"This was our first dinner in NOLA and it set the bar pretty high. We tried so many differe","useful":2,"cool":1},"trM2yQ2fxLtMjCFLkwFRZQ":{"text":"Great food - good size portions.   Very friendly and prompt service.  Decent variety for a","useful":2,"cool":1},"Ly1pa8H5YG1mi1ba7m7t6A":{"text":"We were looking for fried chicken that didn't come from a gas station. The High Hat sure d","useful":0,"cool":0},"wKdkkEyslqy7lBMY-2YnhQ":{"text":"Hands down the best Casual Restaurant in New Orleans!! Lets say Chef Adolfo has brought al","useful":4,"cool":0},"cJqg0ug9JYKTeAGTevzt1g":{"text":"As a vegetarian I feel like I can't even really review this place because there were 0 opt","useful":2,"cool":1},"4iZfJfU6Jh1YPY2qcjN38Q":{"text":"I defiantly wasn't expecting what I got! I love trying places I have never been too and th","useful":1,"cool":0},"zijsz51v7f06M7URMva7Aw":{"text":"In a recent trip with a group of 14 friends, we visited High Hat Cafe for Sunday Brunch.  ","useful":1,"cool":0},"P8Bio1wIP1GRxNmnYQmAzA":{"text":"High Hat!!!! One of my favorite places. Go on Tuesday for fried chicken night! I seriously","useful":1,"cool":0},"hra5zJtKJrLzpj1RVUNkCw":{"text":"Walked in with no expectation and the food and service blew us away.  We ordered from thei","useful":0,"cool":0},"miZk-gtURwcOYdZyjqfS4A":{"text":"The food here is second to none, dined here many times and I've had specials and usual men","useful":0,"cool":0},"Vreg4czRB1fBeo07pe1tNQ":{"text":"Mediocre food and drinks. \nCool atmosphere if that's what you're into. \nI'm torn on the se","useful":0,"cool":1},"f2EK5jH2vjioSuPOSm3mAg":{"text":"Loved this spot! Got the blackened fish, Mac & cheese. My boyfriend got the Po Boy with ve","useful":0,"cool":0},"TbpdGb0ZtSAbDuYm3G6Mog":{"text":"I've been here three times so I figured its time for a review!\n\nFirst off, you must get th","useful":5,"cool":2},"d-d3g8Nqu5Rtevsp_Yg-7g":{"text":"The BEST poboy ever, got fried catfish, dressed, with their homemade pickles...SO GOOD. Ca","useful":1,"cool":1},"3AFqXkDRj-7I8-JatR_9CA":{"text":"This will be quick. Make sure before you go you have a snack because the portions are so s","useful":2,"cool":0},"mYT_O74Q3_WKk34vrMfs2Q":{"text":"Delicious!   Went off Yelp reviews from other diners.  Not a huge fan normally but braised","useful":0,"cool":0},"PT6NtUFqDahlnM1nOKKeXg":{"text":"After reminiscing about all the great food we ate on our trip to New Orleans my girlfriend","useful":1,"cool":0},"GLnnMSn93xcFRl_wvbI3Nw":{"text":"Love the food. Love the owners. Like the vibe. Great recipes, good quality control.  Best ","useful":5,"cool":1},"zITB6g1RuDk-ZjBcknl3Aw":{"text":"stopped into High Hat for the first time today. two lunch specials tempted me (desconstruc","useful":2,"cool":0},"n1yKfBFfJxafR_V-fS17uA":{"text":"Had the shrimp po boy, comes with fries or your choice of another side. It was very good. ","useful":2,"cool":2},"uWWmZIRkO4azEpwfmIIDSA":{"text":"Great local spot. Good burgers and the drum fish (minus the chili oil) was sooo good. Nice","useful":0,"cool":0},"HJKxFLk-H5hKVEytl8wh-A":{"text":"Terrific neighborhood establishment. Our waitress was wonderful - she was friendly, prompt","useful":1,"cool":1},"jVzPlqnnVvypvcin5zI4TA":{"text":"I read about the top 11 fried chicken places in NOLA, and hi hat came up. \n My girl and I ","useful":1,"cool":0},"1f7LqsXqUQGP0EVSLYH8EA":{"text":"This was the first place I ate at after I moved to NOLA and after being there for almost a","useful":1,"cool":1},"9XGGl8ma_30KShhp1YTudQ":{"text":"The food was very good. It was a short walk from the Alden hotel. The waitress was great a","useful":0,"cool":0},"fox7IeSKTgcZJyM7edz8jw":{"text":"We live very close, and you can dress very casually to dine, so we were excited to try it ","useful":5,"cool":0},"OA9wLkp8ChzDqSxw3bMUvA":{"text":"Great lunch. The pimento Mac and cheese was amazing. The shrimp poboy was also phenomenal.","useful":0,"cool":0},"DoeEEKntE-jtlOv00xIEWg":{"text":"We were looking to get out of the French Quarter and see a different area of New Orleans a","useful":0,"cool":0},"G-qwihZBRyOZcPw0MOmeXQ":{"text":"I used to live fairly close to High Hat and go somewhat frequently with my roommates, but ","useful":1,"cool":0},"oCbyD1rhhX9P51sSX1kMhQ":{"text":"Very friendly staff and owner. Amazing food. Visited during bachelor party trip to New Orl","useful":1,"cool":1},"Rxwuimwad8ihA2g1K2LuRA":{"text":"If you have a craving of southern food with a twist this is a great place to grab somethin","useful":0,"cool":0},"s6YPsjQ_aZoex4AHIVXXhw":{"text":"We decided to get out of the French Quarter for dinner but then were inundated with the op","useful":1,"cool":0},"RN-UNpWGupgZc6ywwK01cA":{"text":"The food was not anything to write home about, but was okay.  The server charged my friend","useful":2,"cool":0},"BOqkKP_FHwdVc_WK0EeDvA":{"text":"Look for really good southern cooking. Don't miss the Peanut Butter Pie. Sinful. But can't","useful":0,"cool":0},"Sir_T7p3jFW6g_rPZW7XfA":{"text":"What could be better than Delta Hot Tamales, BBQ Shrimp, Pimento Cheese with Ham Salad, Ch","useful":0,"cool":0},"70cUwKP8BFXeMHDoZ9nhog":{"text":"Decided on High Hat for lunch to go. Ordered the shrimp remoulade wedge salad. Received 4 ","useful":6,"cool":1},"ET1h5-ebXRRuQm-gcivdjQ":{"text":"I couldn't make a choice!! So many great menu items. I settled (but after one bite it wasn","useful":0,"cool":0},"kxO1n6Z3-yDObF5yC9cEYQ":{"text":"I've been there about a half dozen times and they have the best pies in the city BUT, last","useful":0,"cool":0},"r6wVO_7oLmrgEC0hvUzNRQ":{"text":"This is one of my favorite go to date nights or lunch dates. Comfort food to the max. Remi","useful":2,"cool":1},"PhzER8iXvSbFzIHTHET42w":{"text":"I would have to say service was ok. Definitely overpriced our Po- boy was awful, dry and a","useful":3,"cool":0},"0Qrr_jPSBPHrvYGJcwRQ3A":{"text":"Wonderful surprise for dinner. Busy little place with lots of specials of the day! Cocktai","useful":0,"cool":0},"WoVNKKb6OwS8ySqAmIVRRQ":{"text":"Food was pretty good, the service was good with the exception of one woman. She was short ","useful":1,"cool":0},"e4TOlguuLjR07rIDQY6T_Q":{"text":"Very rude server, the wait time for food was outrageous. We waited at least an hour for sa","useful":0,"cool":0},"Mfnyl2nDgtbhtEp6BsJheA":{"text":"A cute restaurant,  really convenient to our hotel. \n\nThe first time we ate here we had ju","useful":0,"cool":0},"bLSiTTf1FC7sJk3sZT4wMQ":{"text":"This was a great pre parade spot for us. Good spicy Bloody Mary and refreshing strawberry ","useful":1,"cool":1},"Y8QpmHA74fcQAi6tjRMSIg":{"text":"There so many High-quality restaurants in New Orleans. My honest opinion, High Hat does no","useful":0,"cool":0},"JUaoSpNfAfvRI5U8FFQmnw":{"text":"The wait staff was very friendly but the food was the worst I've had in NOLA or anywhere I","useful":1,"cool":0},"tp76mSv3L9eMIMKLI_fTpA":{"text":"Went here for the first time tonight.  The host at the door convinced me that their friend","useful":2,"cool":0},"EtyL6ilHTrdNxpagz-Fcqg":{"text":"My granddaughter and I have brunch every Sunday after church.  High Hat Cafe was introduce","useful":0,"cool":0},"ox2KapKFY866G_e5uZIO0w":{"text":"Best fried chicken and Mac and cheese ever! That's it. I know I should write more but seri","useful":1,"cool":0},"12AYz78lYa5_bkEQGJhD2g":{"text":"Grabbed a bite to eat with my hubby and decided to check out a new place we have never bee","useful":0,"cool":0},"rnSSps5egs8erKueS_arOQ":{"text":"This gem is right by my house, and yet somehow I always forget about it. This review is me","useful":0,"cool":0},"Lq8mYaxcW23hB3bvOtyuOQ":{"text":"Tried to go here a few times but never made it out until yesterday evening. On Yelp, all t","useful":1,"cool":0},"41f9odPCISui8aluKsGSYQ":{"text":"The Good:  This place has the look and feel of your standard Southern Diner (if there is s","useful":5,"cool":0},"KwNXpphxkXctgM1sduOPqA":{"text":"So I came for an afternoon burger and mac & cheese. It cost me $20 to get a burger an orde","useful":1,"cool":0},"J2J178fR20lHbTtVJautBA":{"text":"Quite possibly the worst service I've ever had, surly, slow and sloppy. I had to wait 10 m","useful":0,"cool":0},"2R1aF4sozn5QmAB8enhedQ":{"text":"Love this place!! Always a great experience! Ann, our server was fantastic and recommended","useful":0,"cool":0},"kJFPi77R2OrJPIn7HJsZXA":{"text":"Fried chicken, pimento Mac and cheese, and collard greens Tuesday special are a hit. Check","useful":0,"cool":0},"9aWCy-swCt5heb1Vb11J6Q":{"text":"My friends and I annual girls trip is in New Orleans this year.  We are all excited to try","useful":4,"cool":0},"q7Glf1X_CCCQLhL7xe3vQw":{"text":"My granddaughter and I have brunch every Sunday after church.  High Hat Cafe was introduce","useful":0,"cool":0},"Mt_0akhmeTBZOWxRS1oEUg":{"text":"I had the pea salad and it was decent. My daughter had the burger and she didn't brag abou","useful":0,"cool":0},"iwzVKIqWm9_1u2kQjRbEhA":{"text":"Local restaurant on Famous Freret Street that serves a hodge-podge of food; any and every ","useful":11,"cool":7},"LRsZ5QVY099PnGi1TEdBWA":{"text":"Popped in for brunch to catch up with a friend. We grabbed seats at the bar, ordered some ","useful":0,"cool":0},"Tt1dAuci-JxyCMeHzsG21A":{"text":"great red beans. great serving bc i never found the bottom of the bowl. this is a must sto","useful":0,"cool":0},"8NS6qNeax3MDcmqaXUQU3A":{"text":"Our Uber driver actually told us about this location and we decided to check it out. Our o","useful":0,"cool":0},"U4Ju1M9ZfC4tGrrYYCnQfQ":{"text":"One of my absolute favorite places to grab a juicy burger with mouth-watering pimento chee","useful":1,"cool":0},"Bixv-ulhC956VkrdIE2vnQ":{"text":"The best shrimp poboy in NOLA! Unlike majority of shrimp poboys, high hat uses cornmeal to","useful":12,"cool":7},"B4JARbd_5xr-kf7xotivKA":{"text":"We have gone here so many times and each time we have enjoyed  our meals. Friday night spe","useful":0,"cool":0},"9RWZTIGxL-6O_B2wSZRQ1Q":{"text":"Great casual New Orleans food. Never failed me. Shrimp creole, short ribs, catfish, and po","useful":0,"cool":0},"bjDBO8n-TwHz94EV3bvvOA":{"text":"Overcooked dry fish. Slow slow slow service we waited an hour for our meal while other par","useful":2,"cool":0},"5LXIVERJT-WSj0WYPiiIRA":{"text":"Excellent fresh home cooking or as close as it gets.\n\nThe Ginger Rosemary Iced Tea is a gr","useful":0,"cool":0},"giY2l7S9INoAMRx7goS9lw":{"text":"Leaves a lot to be desired.   Gumbo is not quite gumbo...  but on the sludgey side... need","useful":0,"cool":0},"99BuvyEPvEGjO8wnO_YNRQ":{"text":"Service was great! This was our first stop in New Orleans since our hotel was within walki","useful":0,"cool":0},"N0ovTzERlELjwWJHLlMJXQ":{"text":"Excellent catfish and fries. The Vegetable Plate was a delight! I had the amazing vegetari","useful":0,"cool":0},"qq5oQxKbeX4wf38__3MeJA":{"text":"Ambiance is family friendly. The bartenders are friendly and knowledgeable on the food and","useful":0,"cool":0},"rp8wfNSXZrDZ_IQlqU9j2g":{"text":"High Hat has delicious food- everything I had was tasty! The location on Freret Street is ","useful":3,"cool":0},"h8FCZDxiWibUCHtP57IY9Q":{"text":"I gave High Hat 4 stars because the green beans and poboys were really good. I did not lik","useful":0,"cool":0},"GOSfntzEAr-mreutrBjK3Q":{"text":"Loved the retro atmosphere.  Delicious fried catfish at lunch.  Perfect service.  I hear t","useful":0,"cool":0},"w4BzVH35ld2oVlQaF9EFDg":{"text":"So good, just perfect!!! Catfish, gumbo, fries....just perfect!!! Atmosphere is nice and s","useful":0,"cool":0},"iUl6tb5LN1f_AnTUe__-pg":{"text":"Amazing food, the best fried chicken that I've ever had that my grandmother didn't cook. E","useful":0,"cool":0},"Pznku7tQ6wepjvTXtwXLng":{"text":"A new episode in the Freret Renaissance is a pair of restaurants where Antoine's Bakery wa","useful":5,"cool":0},"ZpBl3GK92lM4WTHjK8UfJw":{"text":"This is one of my all-time favorite restaurants. The high hat burger and macaroni and chee","useful":0,"cool":0},"B8GSFwMT6vZnGmZ-gY6LdA":{"text":"In my quest to try all the new restaurants Freret street. I decided to give this place a t","useful":5,"cool":4},"gTXp6js7MGVQgQg7MsNn0Q":{"text":"Just had our first meal at High Hat and it was great. My wife ordered a One eye beacon bur","useful":1,"cool":1},"_hTRhCNnrlVYzBBPsI5elQ":{"text":"We both had the catfish basket with a side of greens and sweet potato salad. The restauran","useful":0,"cool":1},"hEViuCzuRtrvANQrsVlkyQ":{"text":"It all started when we were seated and had high hopes. Our hopes stayed alive with the Del","useful":5,"cool":0},"0STEbe6GkM_QH-t7Mb7U5w":{"text":"Service was really just so good. Our waiter was super kind and helpful. BBQ shrimp, catfis","useful":0,"cool":0},"3UogNTOQ3G7a1R8r5JIt3A":{"text":"Consistently great service and a delicious, exciting menu. High Hat is a regular dinner sp","useful":0,"cool":0},"mbUVriXh9FvMWTBh-H6hdQ":{"text":"I normally would not give this good of a recommendation for this young of a restaurant, ye","useful":2,"cool":1},"iwIO14GLEwyVFkvLVO6hdA":{"text":"This is a tough call between a three and a four for High Hat. I'm going with three simply ","useful":4,"cool":2},"M9L0Jm_I6ba23rcpD1U7Kw":{"text":"Good food Bailey at the bar is great. Always has a smile and great customer service. Other","useful":1,"cool":0},"r0YbykNiUJDB4JPZhgT1Yg":{"text":"While this place looks really good on the outside, its actually a really old fashioned spo","useful":1,"cool":0},"zF3uI37ZPa-h3kvqM0KXmA":{"text":"Ordered the BBQ shrimp, BBQ Bacon Cheeseburger and Chicken and Sausage Gumbo. We also got ","useful":0,"cool":0},"akZZvzJtXISsyX67cvBvIg":{"text":"This place is no kidding good. I felt like I was sitting at my mama's kitchen table having","useful":0,"cool":0},"c9iYUcm6OrmqIIdDUyv8zg":{"text":"High hat is a spot I always see on freret and today I stopped in. I had the large catfish ","useful":2,"cool":0},"4bhsSP6moENZmXr67CaVew":{"text":"Of all the places we ate at during our stay in New Orleans, High Hat had the absolute best","useful":0,"cool":0},"jhzkETMH8L6jzFflFJWjkA":{"text":"We went to High Hat last Sunday for dinner with some friends. It had been described to me ","useful":5,"cool":3},"mBZAbxiwGKaG4kBRXxKx2g":{"text":"Everything was really yummy! It was all seemingly fresh ingredients, which is a nice chang","useful":0,"cool":0},"oFUq2xA-0KH2S9SEhE065Q":{"text":"The food is always hot, fresh and delicious! The service is typically quick and friendly n","useful":0,"cool":0},"JrneVUM6f47EHAy0B5aQVQ":{"text":"Went to High Hat Cafe before but didn't stay because of the wait time, but I knew I wanted","useful":0,"cool":0},"ACkjVZW8rL_OSP-KNEN9kw":{"text":"Great shrimp and ravioli dish I had which was the special. Very good flavoring and enjoyab","useful":0,"cool":0},"Nw2-6ve-tqZeWpd5fnQDSg":{"text":"I ended up here by accident one evening when I got stiffed , or so I thought, by Ignatius ","useful":3,"cool":0},"NZoL2aTZ-FD_FavVHkjb0A":{"text":"I normally get the high hat burger here which is definitely one of the best in NOLA. Howev","useful":1,"cool":0},"1oh6v3ij2oCAmYJg1WZXug":{"text":"I was with a group of 14 women visiting from baltimore. We arrived about 10minutes before ","useful":6,"cool":0},"xsg-T8sAKC7g3lY6L9Uapw":{"text":"I grew up here, so I have had my share of good oyster poor boys, but High Hat's version wi","useful":0,"cool":0},"tKN_M3PjrjaSxvVj4wahNw":{"text":"My wife and I were in town for the weekend, and wanted something casual and low-key. We ha","useful":0,"cool":0},"aCki_6EGyHTrGLN-VbcsWA":{"text":"Last night first visit we were impressed from when we walked in. We were told 30 minute wa","useful":0,"cool":0},"kruCC4d1dgI2Cwm4lb9SBw":{"text":"Espectacular restaurante de barrio que encontramos por casualidad. Precioso ambiente que t","useful":0,"cool":0},"xQDYDhOXKZx81s_5p9PpYw":{"text":"Just had a late lunch here. Amazing experience. The cocktails are awesome and the food is ","useful":0,"cool":1},"iU-5HRsFCL5bU9wiJ8F5gg":{"text":"My dinner guest really liked this restaurant and I expect they would give is 4 or 5 stars,","useful":1,"cool":0},"yUy_vjp7ZyFJLa0PDxdyuQ":{"text":"Brunch! Oh how I love you.  \n\nThe SO and I came to high hat for the first time for a brunc","useful":1,"cool":0},"i8JtTElKwekWi4IP-OCNvg":{"text":"High Hat is a cool little place. I love the feel on the inside. Old style tile floors line","useful":3,"cool":1},"FLjQ-eq7mf5YLjUldD6rtA":{"text":"Checked out this spot with a few friends.  there is limited street parking so be prepared.","useful":1,"cool":2},"yVodXoeAmLMezXtKVyzoTw":{"text":"I love The High Hat Cafe so I can only imagine that when they open there doors Nov. 3rd at","useful":1,"cool":1},"Gx3Gkzei0gknpPTXlOTWHw":{"text":"I was a little doubtful about this place because the menu didn't look that great at first ","useful":1,"cool":1},"q9p8KBdA9fPV6Yq5f9pnHQ":{"text":"I heard a lot about this restaurant so my expectations was pretty high. \nFirst off, let's ","useful":1,"cool":0},"KU9LILARBe53czqdO2TYeA":{"text":"First time here. Food was decent. Chicken dinner was flavorful- smoked; a bit greasy Floun","useful":1,"cool":0},"0NVqJulXDh2sZSoUheU59A":{"text":"I love this place. My husband and I come here all the time, and I've never had a bad meal.","useful":0,"cool":1},"7kI3b4cvzqJIdPlAXCW0cw":{"text":"High Hat is very yummy. Though definitely not at all dietetic. Even the vegetable plate ca","useful":2,"cool":1},"rCTmNvGrU37o2YhNDbNs6Q":{"text":"This is my kids (5 & 6 yo's) favorite restaurant.  I like the cheeseburger with bacon and ","useful":0,"cool":0},"I3FEYfiDOx8joy-gmkUtbg":{"text":"Perfection!  From the barrel aged old Fashioneds to the great chicken with greens to the m","useful":0,"cool":0},"z2-RvO56uyDbnMZQdlr2OQ":{"text":"My sister and I are visiting from Miami and we're given a recommendation to come to this c","useful":0,"cool":0},"6t_vx0iDFRiH-isEsgMnLQ":{"text":"What a fun place.  Reminiscent of old school diners.  The staff are friendly and attentive","useful":1,"cool":1},"xLCdeO9adOf3cdZm2kPA1w":{"text":"I've been coming to this restaurant since it first opened and have largely ignored the cri","useful":4,"cool":1},"LgugAA90PRYOyDdHdF64ag":{"text":"Just based off of reviews and the pictures, I knew I'd like High Hat. What I didn't antici","useful":0,"cool":0},"nwzMjq_k-KgzhRjZhoPdAA":{"text":"Well what can I say?! We've been here 4 times in 2 weeks! Aside for the fact it is walking","useful":0,"cool":0},"eKJHj7ue8wSnOS6uyWwnhA":{"text":"Best fried catfish and pimento cheese grits!! They really capture the feeling of New Orlea","useful":0,"cool":0},"ymME3gcU_iy4WQZhazWx7w":{"text":"In this age of Coronavirus High Hat is a good choice. There are a lot of non-sandwich choi","useful":0,"cool":0},"IGfbFA-uJtFzYCLQ-E-MyQ":{"text":"After a morning at the zoo, we decided to get a late lunch at high hat cafe which was half","useful":0,"cool":0},"-yfglWAEqiGY3NDXBcmoHA":{"text":"We had a nice dinner at this restaurant.  Only a 2 block walk from The Alder Hotel.  We ha","useful":0,"cool":0},"qQ7YGyKCx0zWQK2bcCGXUg":{"text":"I had the Angus cheese burger, it was very delicious. The meat had great seasoned perfectl","useful":0,"cool":0},"cVCzEWDVx2iajVhSq00Z4A":{"text":"Food-5\nAmbience-3\nService-4\n\nThe pictures of their food had me itching to go to this place","useful":2,"cool":1},"P64zbFJ5HDRa_OoMzu-jpw":{"text":"The best fried chicken ever! I think it's the cornmeal they add to the crusty batter. Love","useful":0,"cool":0},"6hrVefQhaVHooCcwT3E9NA":{"text":"Amazing food and service. Had the fried chicken and wedge salad. Even with my pickiness, t","useful":0,"cool":0},"GKN6cXrNjjtJAlfv2fgpOA":{"text":"Really enjoy this place. I had a Cuban and it was simply a high quality sandwich. There's ","useful":1,"cool":0},"ZeVeBCKDgd0MTV3NsCxhXg":{"text":"Delicious. Really like the High Hat Burger which has pimento cheese on it. So yummy! The s","useful":0,"cool":0},"PyY4Kh-dEo3a499MyLqV5w":{"text":"I've lost count of how many times I've been to High Hat. It's absolutely my favorite resta","useful":2,"cool":1},"DOp-IL4zFaFw1Omic8ZPoA":{"text":"I've been to High Hat many times. The food is solid with great catfish, ridiculous Mac & c","useful":1,"cool":2},"u3z_6W7zYFdNwsh4LPHmWw":{"text":"My group ordered the gumbo, the catfish platter, and the roast pork. Catfish was so bland ","useful":0,"cool":0},"p5-Waptybgh2kw65qXMUVw":{"text":"Always make a point to go to the High Hat when we are in NOLA.  Delicious fried chicken (m","useful":0,"cool":0},"op3eF7lAksdk2PA6ji6MNA":{"text":"I have been meaning to go to High Hat for years. Every time I walk past it is always packe","useful":0,"cool":0},"LxOrVlCajwvgfyOHXqrrvg":{"text":"This is one of my favorite places on Freret St. My go to is the catfish basket with the Pi","useful":5,"cool":2},"Ud2AE-clA5pSQrP-cSiSSQ":{"text":"Absolutely looooove the food, decor, and specialty drinks-- but what's the deal with the w","useful":0,"cool":0},"cnK865ltB_3HSG41SKIDTw":{"text":"I did a pick up from High Hat- 1st time to try it. Outstanding. We had wedge salad, gumbo,","useful":0,"cool":1},"PjpPtrQz2h90LNLy-VPuvA":{"text":"My dinner tonite was fresh soft shell crab on top of grits with beure blanc sauce and topp","useful":1,"cool":1},"emuqEgsIolTamCTrfayYow":{"text":"This place was excellent. I had the shrimp and it was delicious. Their grits...the best gr","useful":0,"cool":1},"c0tFGRSEi1BUB1Dj6AwjwQ":{"text":"Great food for a great price and really good service too!\n\nWe ordered the Boudin appetizer","useful":0,"cool":0},"LP57rrLgeEf1_2PSc-UFdg":{"text":"It's a dream come true to live right down the street from this place! The fried okra is th","useful":0,"cool":0},"38v3W1MLkBasGXAzp2MhXA":{"text":"Exceeded my expectations.  Having passed by this place, thinking it looked like a nondescr","useful":1,"cool":1},"ReadNS-L8Sss-sCTdr6j8Q":{"text":"Late August summer lunch splendor! Service was fantastic, Gumbo a wonderful starter and th","useful":0,"cool":0},"Xztr9YKKItR0tUT6DNe_Tg":{"text":"nice restaurant with outdoor tables and roomy inside too. Very accommodating staff. Good c","useful":0,"cool":0},"wqkmMsk3nKD9WgO3Weho9A":{"text":"I've been on a Mac and Cheese hunt this week which started out with Rocky and Carlos. Thei","useful":0,"cool":1},"Na75X5coWWQW7vK1EtFsZA":{"text":"The rumors are true and the wait was worth it. The High Hat Cafe SLAYED US. For a place th","useful":2,"cool":1},"7Mgf17sLdlTkE_sJQjm8ew":{"text":"What a stellar surprise here. My BF and I are trying to try somewhere new and local each w","useful":1,"cool":1},"4BBDojnyp_F3f6r9_4oJig":{"text":"I've been twice to High Hat and both experiences were good, not great. I really appreciate","useful":1,"cool":0},"c7e1I-ALEUSj_hafJsfgOA":{"text":"All food was delicious, customer service for pick up was great and I would suggest anyone ","useful":0,"cool":0},"m3bW0Tym8Fq6rih1kNCW1A":{"text":"After browsing some of the other reviews, I was intrigued by the sweet potato salad. So I ","useful":2,"cool":0},"qZ_hhzUYcamw7ksKx_NaXw":{"text":"The foos was terrible. Ryan the manager didn't do anything to help. I tried to ask for som","useful":2,"cool":0},"dyi51ZFIvDZ48rpYNR6KBw":{"text":"The five stars are because this is our go to place for a low key homey restaurant. Fried c","useful":0,"cool":0},"ifVhsIN-AVjUxoTp2MLeNw":{"text":"I'm in love! I ordered the fried catfish which made me feel like I was back home in the co","useful":1,"cool":1},"YoXRZF5QaOloDM3MHFI5Cg":{"text":"My family and I decided to grab dinner on a Friday night outside of the typical tourist ar","useful":2,"cool":1},"dtXBBc0coTVwl7LqxyEvJA":{"text":"Maybe it was an off night - but my experience here was terrible, overall. \n\nI'll start off","useful":0,"cool":0},"izqVtMSdcVeCn9ILpEy7Mg":{"text":"One of the best burgers in town. I always sit at bar so I can get my alcohol a bit faster ","useful":0,"cool":0},"EpStnn_Y7iFRfG9J_fczTw":{"text":"My best friend & I visited today. The service ambience and great food was a wonderful mix ","useful":0,"cool":0},"asD4Kkb6_WCF9Lr8lwdyag":{"text":"We just moved to town, and High Hat is already becoming one of our favorite lunch spots.  ","useful":1,"cool":1},"vrJ4-vNdNg1cxr3KOXL6Ug":{"text":"Everything from the menu was good! Ranging from the pimento cheese plate, the chicken and ","useful":0,"cool":0},"G49YCgSfchpgklGxlio8BA":{"text":"Mom and I were craving a good hamburger and came across high hat. When we arrived they wer","useful":1,"cool":0},"LUSqfWxBjBaWxLVIU_Y4wA":{"text":"The rating might be affected because i wasn't feeling too well. HOWEVER, it was good. I'm ","useful":0,"cool":0},"pvd6ZeSxx9b9OTzB8m6uaQ":{"text":"This was my second visit to High Hat, and it was enjoyable. My husband and I ordered the B","useful":2,"cool":1},"8VxpCEe2ilRuuWyPBvVfLA":{"text":"This was an impromptu dinner after arriving in the city. \n\nWe started with deviled eggs an","useful":0,"cool":0},"o43w5sx-o1m-3Z80994pEg":{"text":"Great brunch spot on Sunday. Went as a recommendation from our Uber driver and did not dis","useful":0,"cool":0},"BLSFVptHhGafmsg5enNvSw":{"text":"So our initial plan was to go to Willa Mae's.  We were on our first trip to NoLa and wante","useful":5,"cool":2},"qn85gE217Bakp6M_HEA-cA":{"text":"Super easy to order amazing food and service! Will surely be back! Ordered pimento Mac and","useful":0,"cool":0},"jPJsi8hjxMdEOy4PosuyTQ":{"text":"Really good food overall. Get anything with pimento cheese and you'll have a great time.","useful":0,"cool":0},"-La2QKXcost_gxDjDhLDJw":{"text":"Casual, great dinner, local fare. I had the special of white fish with veggies (sorry, can","useful":0,"cool":0},"fZ6sgihCNpdcBodlyM2n_w":{"text":"First full meal we all finish in New Orleans!!!\n\nIt's a neighborhood spot, staff is friend","useful":0,"cool":0},"nAzaf5s0nECbwCRn061BLQ":{"text":"Great grits and service   Had the bbq jumbo shrimp. Giant with heads has a nice feel and g","useful":0,"cool":0},"6GaWObgkaBBRc8BLQwJ62A":{"text":"Vegetable plate amazing. Best hush puppies I've ever had. Service is spotty but nice. Skip","useful":0,"cool":0},"2yk1Ufb0f3Fyg2gteuji6w":{"text":"My granddaughter and I have brunch every Sunday after church.  High Hat Cafe was introduce","useful":1,"cool":0},"RTb7OZGiJX4MRzzR1PutgA":{"text":"I love High Hat. I come here almost every visit to NoLa. My sister lives right down the st","useful":0,"cool":1},"qIIn_CrmG6f0uPbm-ktoiw":{"text":"Great food, and always friendly service! The covid cleanings of tables meets satisfactory ","useful":0,"cool":0},"rjBrsHJo9jHHd-jgkWcDEw":{"text":"High Hat never fails to satisfy me. Before quarantine I would dine at least once a month. ","useful":0,"cool":0},"MtFyVAPFExr9S9YlFT3hZw":{"text":"Food was alright. Service was horrible. Our waitress said the rudest thing when we were do","useful":0,"cool":0},"FrTjnWyy1uqKWG8L2VhLog":{"text":"Just about the best roast smoked chicken I have ever tasted! Very good and cordial service","useful":0,"cool":0},"UhVDNCV0OebzB9S34EvLRg":{"text":"I've been to High Hat dozens of times and their brunch cannot be beat! It always feels lik","useful":4,"cool":1},"uZYJmpsXAM3qgkSLCaa5jA":{"text":"One of the WORST services I've ever had .  I wanted to just walk out but I calmed myself d","useful":1,"cool":0},"58bL_NVK1PginkR2Aj89og":{"text":"Stopped in for a quick take out order and was overall happy with the food and prices here.","useful":2,"cool":2},"JsuidF-_b3z-Ta41-EolTg":{"text":"We sat at the bar and we each ordered a cheeseburger, I got mine with fries & my hubby got","useful":0,"cool":0},"CdirHn-OT5uO7130DRUGyA":{"text":"Freaking awesome!  I was there on Sunday, June 21.   I consider myself a burger conossieur","useful":2,"cool":0},"1KPs9HSzvJqgEc1DDfz2bg":{"text":"The fried chicken was not all that , my take out was not good, chicken was fried in burned","useful":0,"cool":0},"wBvJRWTD9xMLCoTBd68R7A":{"text":"I came to High Hat looking for classic, tasty Southern food. It was Saturday noon and it w","useful":2,"cool":0},"rd17T-GHo8pEOEB8Rf5TLg":{"text":"This little diner seems like a terrific neighborhood gem. The place was packed, absolutely","useful":1,"cool":1},"HpsKRa4xELB6K3n3zn9C-Q":{"text":"The food was cold and the juices from the greens had mixed with the fish. Made everything ","useful":0,"cool":0},"bCuYXv8kU987fUz3D7dqcg":{"text":"Wow this place is amazing! We came into here at 2pm which was an odd time for lunch. Super","useful":0,"cool":0},"i_mx_K2Drcrp-9cGC6I3nA":{"text":"My review of High Hat, a restaurant which people either seem to love, or hate.\nWhen a good","useful":2,"cool":1},"LPfOnPwx_NnY31fnY0J8WA":{"text":"Had dinner here for the first time with a few friends on a Saturday evening. Big open dini","useful":0,"cool":0},"sCSJF0wvLlm_-xS-WVT93Q":{"text":"Outstanding southern cooking. Great service and reasonable prices. Shrimp poboy and pan fr","useful":0,"cool":0},"achKEWB_mKVGd_dk4RTxTQ":{"text":"Definitely overrated.\nGreeter was very friendly and showed us the specials for the day. Lo","useful":0,"cool":0},"7p9EOWYqmzUFeOxPkppDNg":{"text":"First impression was horrible by the manager. The servers and food is excellent. The manag","useful":0,"cool":0},"Sc_jpSTbylsz4BKZLD5X6A":{"text":"Holy cow! I want to live here! Think they'd let me? My catfish basket was so good. I even ","useful":8,"cool":6},"KrRrVqxsT-VLzFLRx4s6FQ":{"text":"Good place for lunch!  We love coming here and I love sitting outside when we can because ","useful":2,"cool":0},"gEUz8AV08ITVKvVDJTRA3A":{"text":"I've always loved High Hat! This is no exception and I haven't even received my food yet. ","useful":2,"cool":0},"fAQe71o2s9DP0-WxlAgmlA":{"text":"I want you to be better, high hat.  \n\nI want your menu to be more robust, for you to dance","useful":6,"cool":4},"NSGAEYh9-aKW9zbTIDZ3yw":{"text":"OVER PRICED YET MEDIOCRE High Hat is quixotically about 15-20% more expensive than similar","useful":9,"cool":3},"sJeygd8hpSB1LZIrp8V87g":{"text":"The 3 Pcs Catfish basket was yummy with a simple slaw and really flavorful hush puppies. T","useful":0,"cool":0},"9ZUsKtmA0cbb5NyVeqIIRg":{"text":"Eight years (!) later, the previous review from 2011 remains current.  That's consistency.","useful":2,"cool":2},"qUI9ZHp7OiRc5Cj-o_sHfQ":{"text":"I have been going here for 6 years now, and have never had a bad meal. Not sure who is giv","useful":0,"cool":1},"RrfIp5lJPAs0RZtZUH9YAQ":{"text":"The special today was fried soft shell crab with succotash.  It was absolutely delicious. ","useful":3,"cool":1},"FczOkSwluc7v_Y4ffomxew":{"text":"Um....yum! The only issue is I wanted EVERYTHING on the menu. We wanted to get food to go ","useful":3,"cool":1},"3_iZVIAEu3t5bGQwnWyWhw":{"text":"We have eaten at High Hat a few times recently. Delicious Southern food, decidedly unfussy","useful":0,"cool":0},"4i8gIXNqdGauZzjOs7D9Ug":{"text":"High Hat definitely exceeded my expectations. A group of colleagues visited the unassuming","useful":2,"cool":1},"QcdT52sGUrnIDYRS4Mzg-g":{"text":"One of the amazingly fun places that have developed along Freret Street in the last ten ye","useful":2,"cool":2},"pbxLIQtgdXEFxVSz5vpFRA":{"text":"I don't have the words to describe how good the BBQ shrimp is. I feel like up to this poin","useful":3,"cool":4},"Hl-5OeDjC_14UAEGBTgAEQ":{"text":"One of the amazingly fun places that have developed along Freret Street in the last ten ye","useful":0,"cool":0},"pXudifsOgXhlv6ctutvBmg":{"text":"I've been here a couple of times now. The service is good, the food mediocre. I do not get","useful":0,"cool":0},"3VhVPEYBdYCUnwqe_EWgrQ":{"text":"Ok so this place was a \"you have to go if you are in NOLA\" so we took a Lyft to High Hat C","useful":1,"cool":1},"5Wb35Ag6_yw4gPlPS-Tutg":{"text":"If good southern food is what you want, this is the place. The fried chicken is perfect. R","useful":0,"cool":0},"BqIXiVbef2wr5Ywl2jopDw":{"text":"Ambiance was amazing in here. Ppl are lively, and it's bustling. We came at prime weekend ","useful":1,"cool":1},"C8O8GklUoljQdyFCLbR6bg":{"text":"This cafe is amazing. I am so familiar with the Freret street drag but have never tried it","useful":2,"cool":0},"5uelpNNiI-08Ao3Ywcpdyw":{"text":"Another update!  Still five stars, everything previously submitted still applies.  \n\nBut, ","useful":1,"cool":2},"I_jMtvps0zeBh7GqCk-bhw":{"text":"I used to go here a lot when working in the neighborhood even though the portions are unco","useful":1,"cool":0},"bgPf0Pzv_vSO275_s1psVg":{"text":"I took my kids here a couple of weeks ago after we realized that Company Burger didn't ope","useful":2,"cool":1},"i6R_-ORLc1v9BhoYLUTrsw":{"text":"Food was alright but everyone in my party of 6 had something cooked wrong. Waitress made s","useful":0,"cool":0},"CJAqDNsO_0gufzgFG450PA":{"text":"Delicious pimento cheese and pork board for appetizer. Followed by strong service, a tasty","useful":0,"cool":0},"MJiMA9uS0zimlkkZNtONtw":{"text":"Best Shrimp creole in the city! \nLove all the sides, and daily specials too\n great service","useful":0,"cool":0},"c6C9TM-zQvqEVzQrurND7Q":{"text":"Loved loved this place!!! We visited here after the recommendation of a friend. My son and","useful":4,"cool":2},"lHHD6lPnaw7L85RclcgcNA":{"text":"My wife and I have eaten at the High Hat at every opportunity since we discovered it in su","useful":0,"cool":0},"oFAD4wq7C8vr-_RxWiNcWQ":{"text":"Phenomenal spot for lunch or brunch! We stopped in on Lundi Gras. So we were not surprised","useful":1,"cool":2},"WBkavMmlHAFKrJuXtSBgvg":{"text":"Still five stars and doing a brilliant job with safety--best place in New Orleans on that ","useful":3,"cool":3},"vhDSuCucBIDLFtZ7LD4taA":{"text":"It's currently carnival season in New Orleans. My friend and I decided to grab dinner here","useful":2,"cool":0},"Z2DuT_ZKlU5y8pa8TaFT1w":{"text":"I really wanted to love this place. I must admit my expectations were set pretty high from","useful":1,"cool":1},"2d5wvF5iaOIwN5LoQFu_oA":{"text":"We have dined at High Hat a number of times and have always enjoyed the experience, but ye","useful":0,"cool":0},"OqZDPyYL4spC8M1kml4N0Q":{"text":"EXTRA STAR \nbecause everyone I know loves this place, and I'm often invited as \"odd girl\" ","useful":8,"cool":3},"Qwz1Gjf7hR1ta_SLQxMp8Q":{"text":"We have seen this place on TV since we lived in NYC, and came across it last week and were","useful":1,"cool":1},"1H4qnES8OckTtgHQudh4gA":{"text":"Best fried chicken in town, staff is always friendly. Allison takes care of us a lot! She'","useful":0,"cool":0},"ewB71KFouwlvR8cgV77H7A":{"text":"Stopped in here for dinner on a Monday night. Service was great. I enjoyed that multiple s","useful":0,"cool":2},"yKUa_XPuu0bPz3ISf_wFBg":{"text":"Everyone had been talking about High Hat and how good it was.  I have to admit, I'd never ","useful":4,"cool":2},"FsEQ0GqFNUhN91T9DYe4Vg":{"text":"Socially distancing and friendly staff. Chicken n Waffles meh. Leg & wing w a flat waffle.","useful":0,"cool":0},"pbo4MoqYuq43nZSZHdettg":{"text":"We learned of this restaurant from the Food Network and decided to try it. They were follo","useful":2,"cool":0},"h9bkCP45LushKuV6oCRu6Q":{"text":"I love this place! It's been a favorite for years. Ignore any negative 2021 comments. Ever","useful":0,"cool":0},"b385v0ejxP7FyxHbtOQrQg":{"text":"Excellent service by the food servers and manager.  Very polite and considerate.  Aimed to","useful":0,"cool":0},"H8Fg9xNnYNxMkLcijR6tYA":{"text":"This place was exactly what I hoped--local, delicious, and creative. The fried chicken was","useful":2,"cool":0},"lO3xdWR5RPUlWKZtTnmP0Q":{"text":"I love this place. High hat is the perfect place if you want authentic New Orleans cooking","useful":4,"cool":3},"0Ymo5e9v7WBVK8XaWKOcXg":{"text":"Not good, overly greasy. Poor management and ownership. Do not recommend, especially with ","useful":0,"cool":0},"884CduRv1duw7psflu1XDw":{"text":"They have the best fried chicken I ever had! No place compares to high hat cafe also their","useful":0,"cool":0},"JPiR0WHYlxlACh4wY_pM0Q":{"text":"We really enjoyed HH. Staff very courteous. Food excellent. We'll be back soon.\nHave been ","useful":0,"cool":0},"MDKRjKgvYBKEFY2mvhQXMQ":{"text":"High Hat always delivers some wonderful food.  A relaxed casual atmosphere with some solid","useful":4,"cool":3},"EaWhoPtB0WMqQrbHG6a_XQ":{"text":"Excellent, excellent food with wonderful service. Everything was clean, very clean except ","useful":0,"cool":0},"P-g4xVfnDofF7r_4F5mmdQ":{"text":"This was my third visit and by far the most memorable! I was a little disappointed that my","useful":0,"cool":0},"N6LROTDnQIjTqHrj0IdhHg":{"text":"Highhat has a little bit of everything. Their fries are awesome, their burger is one of my","useful":0,"cool":0},"wOJrgajyIufOcqy-xqJHHQ":{"text":"All of the yelp reviews raved about fried chicken so we stopped in because I wanted delici","useful":0,"cool":0},"mbsBzhVYSVO8zzZ4f_empA":{"text":"Came in on a Saturday.  The place had plenty of empty tables.  I asked to get a table for ","useful":2,"cool":0},"2YAeywYH0olpKfsci0O4gw":{"text":"The burgers, fried catfish basket, Cuban sandwich, fried chicken, Reuben's, butterscotch p","useful":0,"cool":0},"oBWnt92Vjg2TLs490V5l-g":{"text":"Outstanding food and the staff goes above and beyond to ensure the restaurant is COVID saf","useful":0,"cool":0},"VelQP_58Jm9lO6Te_Dm4MQ":{"text":"Excellent!  \nWe have eaten here several times.  Every time we have been pleased.  The rest","useful":0,"cool":0},"30rn5H18_t_GIKlo3dvkPA":{"text":"What a cool spot. Food is delicious. Friendly-low key atmosphere. Old time vibe that takes","useful":1,"cool":2},"dO_mB-2n9PLawV_Rs91uNg":{"text":"Ate at your restaurant today and had burgers and Mac and cheese and cole slaw and tons of ","useful":0,"cool":0},"AC_Y8wb1Xzj9zgRVUAUbTQ":{"text":"Eh. We ordered over $100 of food from High Hat a few nights ago. Most items were somewhere","useful":3,"cool":0},"69nyol1fGQid_mmh1UZODw":{"text":"Reply good!! Pimento Mac and cheese was delicious, fried catfish, one eyed bacon burger an","useful":0,"cool":0},"x2Mut1OJGaFt8Ek3rlKQbQ":{"text":"This was my first time trying a poboy sandwich, and it was delicious. I got the shrimp. Th","useful":5,"cool":5},"9-81G1IWwEd4-xtXI4_AZA":{"text":"Fried oyster remoulade poboy was outstanding. I was skeptical about ordering it, thinking ","useful":3,"cool":1},"Zn8d7FroCozugZC6REHM4Q":{"text":"This place was close to where we were staying on Freret so we decided to give it a try for","useful":2,"cool":2},"K3p5m4GiMqTeNsL-tCKX0g":{"text":"Exceptional service and great burgers. This is the place to stop by if you've had a sip or","useful":5,"cool":4},"aj65LSYr6LrPEVzfc4ugHQ":{"text":"UPDATE:Came again for lunch. Return air grill was spotless!had fried catfish today and it ","useful":0,"cool":0},"RzNCy2bha-cB6AbZZ00FwA":{"text":"High Hat is one of those places that you could take friends who are visiting NOLA and are ","useful":0,"cool":0},"NhqM_B3LJgVV4jrXbmDyig":{"text":"So delish! We tried this restaurant on a whim and so glad we did. The catfish platter is s","useful":3,"cool":0},"i9LzJWiLkq3qEsNg_NF5hA":{"text":"We have always loved High Hat, and had another great experience ordering takeout last week","useful":0,"cool":0},"gJs6gPay0ExnCxfLnl9ZTQ":{"text":"We had a casual girls brunch a few weeks ago. They had a quite a list of specials, make su","useful":1,"cool":0},"gaqGgWZUBCfOcGWLMR0R4w":{"text":"Seriously was surprised it was as good as it was. Had the Reuben, fries, and the green bea","useful":1,"cool":0},"DYRto4F-o5KhlZzYePfdQg":{"text":"Hi Hat serves comfort food, and does it well.  \n\nOn our first visit, the pork plate arrive","useful":2,"cool":1},"-cMTsyZcm03Hl3G8xEaNYA":{"text":"This place got a 5- star rating. I give a lot of 4s- 5 is high praise.\nThe thing about thi","useful":1,"cool":1}}