{"BkhHrHpZh4HNcMT-bO0wJg":{"text":"3.25/5 dark and intimate\n\nreservoir cafe (#rescaf?) isn't quite my spot, but the folks wor","useful":4,"cool":2},"dNiRr1NUp1x54KE11gB0VA":{"text":"adorable local coffee shop, great selection of snacks, pastries, sandwiches, and they have","useful":1,"cool":0},"dobbCcqshQwnC4C9YgSk1g":{"text":"Okay! I'll finally leave a review, after 2 tips over the last year or two (already?). Anyw","useful":0,"cool":0},"748EhN_nhvJmL-fX15uvpQ":{"text":"Ok, this place gets like +20 points for being adorable. By which I mean it's a really low-","useful":1,"cool":2},"lrr1to0CHYJD2FR72k8Q-w":{"text":"Funky, friendly New Orleans coffee shop.\n\nEats: Coffee drinks are consistently good. For-h","useful":0,"cool":0},"cIa9YRoNBNt7-z3RS6uHWw":{"text":"We were on a stroll through the Garden District on a very hot day, in need of cold beverag","useful":0,"cool":0},"y53jBM1omn8pyTdgwrWfhg":{"text":"Keep walking, the staff is so unfriendly it's not worth stopping in.","useful":2,"cool":0},"G-ppUR86UXY8eEwndM5ing":{"text":"I dig this place. A lot. The location is ideal if you're talking a walk around the Garden ","useful":1,"cool":0},"2t093Reb6JzeafOJ2IRuBw":{"text":"Finally checked out this funky independent cafe that opened up down the street from my hou","useful":1,"cool":1},"73jyL8WF9O2JP-JA8hwn6w":{"text":"I got an awesome winter coat from here. I have never gotten so many compliments on a piece","useful":2,"cool":1},"-HbNinio10lBe2e2IY3iuA":{"text":"I really enjoy this place. Close to my house. The staff is friendly. The mocha Blanca is s","useful":0,"cool":0},"WxlewrgrllbfbGlqD6kf9w":{"text":"A great place to get some work done, sip coffee, wake up and easy going.\n\nIt's dug into a ","useful":0,"cool":0},"_Q0rgbYf_ipcsQjzQqnseg":{"text":"I am a breakfast person so having only tacos is not ideal for me. However the tacos were p","useful":1,"cool":0},"LMTKMD3lDsoTRgYD88IP7g":{"text":"Great little coffee coffee shop, the service was friendly and fast. I only had the drip br","useful":1,"cool":0},"owz-CF5ZnrdwLq7cDh9S1g":{"text":"I think I have found my new Uptown coffee house hang out.\n\nEver since Rue De La Course on ","useful":4,"cool":4},"HTjUw15EQpVv7Xs77ZMnZg":{"text":"Great atmosphere.  Starbucks meets Central Perk.","useful":0,"cool":0},"cdFk6JcXUqDrm7J_-h6lJw":{"text":"Finally had a chance to stop by this popular spot on the way to work.  Parking to tough in","useful":2,"cool":1},"V8imn_LMeB2M8cCoxrOCFg":{"text":"The shake (I think there is only one flavor... coffee) is really good. If I still lived in","useful":1,"cool":0},"Ravx-iFhoruC7geKqdnJHQ":{"text":"I cannot say that I challenged the barista w my order, by she did an Ok job.","useful":0,"cool":0},"zGuOg_JBJtu9UfxheJuCow":{"text":"Dark interior, nothing fancy on the inside, but the coffee is spot on. Some of the staff i","useful":0,"cool":0},"XPhjfGWK4YpzF_V5MV7ASQ":{"text":"Here comes another review for another pretty great coffee shop on lower Magazine, with a t","useful":9,"cool":13},"4TtMvMSLTx-zIjUHLmSzPA":{"text":"A quaint, Bohemian coffee shop great for a bagel breakfast and it has WiFi.  What more do ","useful":2,"cool":1},"a15Bpg-hujQOppRLZLnHQQ":{"text":"Everything you would look for in a neighborhood coffee shop.  I'm far from a coffee connoi","useful":1,"cool":1},"VL6_11FbD37QsQTHUKJ9QA":{"text":"I used to live on Carrollton, so this place reminds me of a mezcla of Zotz and Rue.\n\nI had","useful":0,"cool":0},"t3Q3AKoUN6NSq5YwMVXw6Q":{"text":"Only been there once (yesterday), but I plan to go back there today to satisfy my coffee c","useful":1,"cool":1},"gaLtLe3lwSSrmS3bzkz48Q":{"text":"down to earth staff, warm bread chocolate bread in two words deliciously good, chocolate s","useful":0,"cool":0},"pklIELAYOfK4O4aTY1cYmQ":{"text":"Nice, warm, funky New Orleans place. Coffee was good, staff was friendly. Menu was limited","useful":1,"cool":0},"BgU0Tiq5Lg0f8OYre2oiug":{"text":"visited my boyfriend in New Orleans over summer and fell in love with the taste of this co","useful":0,"cool":0},"3gLJO6q91yYJZwSGKpEUlg":{"text":"BREAKFAST. TACOS. y'all. they have breakfast tacos. and delicious coffee. And anyone who k","useful":2,"cool":2},"I855mDOD5wkaOphZShauTQ":{"text":"I love Reservoir. It has great coffee and a great atmosphere. The LGD has a plethora of am","useful":0,"cool":0},"BuIyacgvbPGFvKRyZ1iaBQ":{"text":"Came here everyday during my stay in New Orleans. It has everything I look for in a coffee","useful":0,"cool":0},"qWjFIlWXirHX4jLeZUvW6Q":{"text":"BLUF:  Cheap good coffee with no dbags and good outdoor seating.\n\nDingy place but cool.  F","useful":0,"cool":0},"xe_zpy5g02T7P00ygUkmCQ":{"text":"I've not yet gotten the feel for the reservoir cafe. It might be I only started trying thi","useful":0,"cool":0},"qwFELD95hA5clBZNew8WpQ":{"text":"The coffee was good but they were busy when I was in here and the staff were snapping at c","useful":0,"cool":0},"ZEUPrHoWqvEbSDLhp9hF4w":{"text":"Small but really comfortable booths.\nColorful walls covered in interesting art.\nShakes, ca","useful":1,"cool":0},"0TzNGzf3i-DXJ1J6ietW1w":{"text":"This is a neat little gem set in the heart of Magazine. Its location next to my salon, Col","useful":3,"cool":1},"uJYZnKa1fQu7khiZq7RjyA":{"text":"The coffee is pretty bad, the staff is pretty rude, and they charged me three different pr","useful":1,"cool":0},"S-JBQCoKAuyKWjRp92dBYA":{"text":"I had a blast shopping at Reservoir on my trip to NOLA. It's now my favorite shop there! I","useful":0,"cool":0}}