{"AP-PUew2r-ufCERJjrkgTg":{"text":"Great museum!  The movie Beyond All Boundaries is a must. A informative film narrated by T","useful":0,"cool":0},"Ezxd3nRDs4dy0y-s5VlNfw":{"text":"So unfortunately I only carved myself out a couple hours for this museum. I was thinking t","useful":0,"cool":0},"Q2KJG2fn7xT0OfujIIh-Qw":{"text":"The best museum I have ever been to. I was worried i would be bored and I was blown away. ","useful":0,"cool":0},"d7xqavF_LN_Q6304yMJAeQ":{"text":"Loved the displays and stories throughout the museum.  World War II was so important to ou","useful":0,"cool":0},"gvGijfxn7PSYI_znQIpD1A":{"text":"Excellent museum, definitely a top attraction in New Orleans.  Plan on spending at least h","useful":0,"cool":0},"1dauvzvxEIcmh2Fjs_vuKw":{"text":"I stand among a very small crowd when I saw that I wasn't that impressed by this museum. I","useful":4,"cool":0},"09toBKNhedN4-4FnA7Teug":{"text":"A must see attraction when visiting New Orleans. The 4D movie Beyond all Boundaries is exc","useful":0,"cool":0},"2tDjGTGepPHLvuLh-sxGXQ":{"text":"Must visit for a history lover","useful":0,"cool":0},"H_omEbdXn7wA1JrlhS1cFw":{"text":"This place is HUGE. You could probably spend a few days here if you really cared to look a","useful":1,"cool":0},"gYnKSmAjHBL0t70u6sYc1g":{"text":"- TIP:  Allow at least 2 hours.  There are 2 sections: Berlin & Tokyo.  Split your time ev","useful":1,"cool":0},"nb2yrNAesCt8dRwnB16tQQ":{"text":"Wonderful museum, and worth a visit for anyone who lives in NOLA or is just passing throug","useful":0,"cool":0},"eaimuemThJN317LBJP8CfQ":{"text":"Great museum, with numerous informative displays.  The movie is worth seeing, as well, an ","useful":1,"cool":0},"cgHF-wmmX4tEqoNfp6wd6w":{"text":"Received a personal call from the online manager. She upgraded the shipment of my item to ","useful":0,"cool":0},"c37C_7kRkcMiMUnxWjxsiQ":{"text":"20 minute walk or so from French quarter. Get the most expensive pass which gets you a 30 ","useful":0,"cool":0},"DVtYD4RfOH77puB0JdF-jQ":{"text":"Do not miss this museum.  Plan a full day and see the 4d movie.  You will learn more about","useful":0,"cool":0},"Sq8HN1hUtjaM2Df1JcdlMA":{"text":"Si vous êtes passionné d'histoire ou de guerre, ce musée est fait pour vous! Il est vraime","useful":2,"cool":1},"4Nr_4w9nnVUGwOlZa22Sng":{"text":"Awesome! Huge! Make sure you plan for at least half a day. Solid beer selection if you nee","useful":0,"cool":0},"e_Cc-768Kt77mhnNYubsqQ":{"text":"Obviously WWII is an almost incomprehensible event in our country's history, and for all o","useful":1,"cool":0},"U5ejM4PSXE_vth2Y8B3nyA":{"text":"Fantastic museum and wonderful interactive areas to feel fully immersed during the 1940's.","useful":0,"cool":0},"_GvlDYPhm4F4uAm4mkTy-A":{"text":"Visiting NOLA I saw advertisements for the WW II Museum around town so I decided to check ","useful":0,"cool":0},"DiuNosJD55IkyWUnJEEuhA":{"text":"Please do not skip the beyond all boundaries 4D movie, you will not regret it. It's the hi","useful":0,"cool":0},"546kypL8H50KcMjYWGfkPA":{"text":"First things first: If you go, see the movie as well. It is absolutely one of the best add","useful":4,"cool":1},"Syl-Yh5brOaSLPDC4v5cIg":{"text":"This museum is NO national treasure.  It is overpriced and overrated.  We were surprised t","useful":2,"cool":0},"hjrLK93Jnls0furOqV2NGg":{"text":"Too expensive for the small number of period artifacts. Lots of repros, blown up photos an","useful":0,"cool":0},"oOUhuE1jYWYmT4ZdpahaEQ":{"text":"This is a terrific museum and well worth a visit while you're in New Orleans. The exhibits","useful":1,"cool":0},"z1O8ZUi2JRlEoblQ70rO4Q":{"text":"Definitely a must stop when visiting or even a resident of New Orleans.  Very humbling exp","useful":0,"cool":0},"Y_ePq22MNzF5DikevtNYsw":{"text":"Very good experience. \nExhibitions are very interesting and well-made. Many objects are au","useful":0,"cool":0},"jjfJ0UTMZzA-nkTvMG7pSQ":{"text":"Really fascinating place. They've been doing a lot of construction in/around it recently b","useful":0,"cool":0},"TSkAs0rWF27jUMRtE0UxhA":{"text":"Great museum for the whole family. As good as Smithsonian! Lots of interactive activities.","useful":0,"cool":0},"Y8JXqxdL1jwGcIrF2mTPPw":{"text":"This museum is very well done and covers all aspects of the war.  Loved all the personal s","useful":0,"cool":0},"6uNUnV_xi1bbwid73HB5aQ":{"text":"Never expected the place to be so good.   Start of in a train and your assigned a person f","useful":1,"cool":0},"S6kBM4Cx1AmWU_x-d9dnBA":{"text":"Uno cree que se las sabe todas... y no... nunca será así.... \n\nEstuve con mi hijo en este ","useful":0,"cool":0},"-53ilLLz_e2SsfSz2eF_vA":{"text":"I'm not a huge History buff or well educated on World war II but this museum is beyond wha","useful":0,"cool":0},"G2qF8i2KQ89LuzeG7oYe9A":{"text":"Wow. The minds behind putting this together are impressive ones. The interactive, immersiv","useful":0,"cool":0},"xg1zIqo3pNite3GbFFnIWA":{"text":"Well done museum. Had some interesting displays and graphics, and each individual  exhibit","useful":0,"cool":0},"gbf2zcqYIv_hZGsAHEmYWw":{"text":"If you like history, especially about World War II, then this is a must stop when you visi","useful":0,"cool":1},"nWJo-fk0AwgqRQppHwcKPg":{"text":"I wish we had more time to walk through the museum!  As a veteran and proud serving member","useful":0,"cool":0},"Z4bj21ofEjw9k8iNJFekFQ":{"text":"Great experience! The movie is awesome!  Go early, you can stay all day and not see everyt","useful":0,"cool":0},"NbL4ePOBegq9fLK_Jo-lLA":{"text":"What an incredible space!  Knew nothing about it until this visit, and here it's the 3rd m","useful":0,"cool":0},"mu-RnU6LlDrvj252o14YMA":{"text":"We spent two days there visiting and enjoying the museum. We even had toddlers with us. Th","useful":0,"cool":0},"5RbG2V9nlMnqG7ATX4R8Nw":{"text":"I was blown away by the amazing World War 2 museum in New Orleans. Our trip started with a","useful":0,"cool":0},"KY2oS7oLE4RuaurOGbUppw":{"text":"This place is amazing.  So many wonderful stories and items to see.  It is emotional so br","useful":0,"cool":0},"56fSLlnE2tNbfPJlJuGrhw":{"text":"Fantastic. Unbelievable exhibits. Increasing American pride, deepens your knowledge on the","useful":0,"cool":0},"gGoISYUWXmVOwThYCXl8Eg":{"text":"While in town I decided to take some time and visit this museum. I am glad I did. They hav","useful":11,"cool":7},"jNDwIlOGRYnz0tdo8pmn0g":{"text":"I found this to be an interesting and well done adventure for a World War 2 museum in the ","useful":0,"cool":1},"j6VgNvi38oywuOQ5vYYToQ":{"text":"A must see for all. Be ready to spend your whole day there. 4 buildings of history, person","useful":2,"cool":0},"h_zR9kdteri0ZhqjJSXIjA":{"text":"Had everything you were ever curious about this war.  Planned a 2 hour visit here, but end","useful":0,"cool":0},"bnVoPjkTkYwKwJY4Gq_cEw":{"text":"The most organized and informative museum I've ever been to! Each section shows you chrono","useful":0,"cool":0},"gd0a5Z4qHNCQUupPZtcKKw":{"text":"This museum will rock your ass!  A bit depressing, as it's supposed to be, but will fill y","useful":0,"cool":0},"qk_ooRmrWWfhC3UU1YAiXg":{"text":"Beautiful museum. Very moving. It was such an interactive experience. We spent hours there","useful":0,"cool":0},"D7tnQyu9n28Z-1X2yDHMLQ":{"text":"One of the best museums in the country that keeps getting better.","useful":4,"cool":1},"2jMlmxGMN5dcfhjj59LjOQ":{"text":"This is a really nice museum. Well put together and very interesting. There is a lot to se","useful":0,"cool":0},"hXF5IwWjZf0jVA4ytlTozQ":{"text":"Prévoir plusieurs heures pour visiter cet excellent musée sur la seconde guerre mondial. L","useful":0,"cool":0},"wnFYbPXiKV0Y5rJQiODbvg":{"text":"So....now you know why Grandpa is still fighting the invisible Germans.  This really is an","useful":0,"cool":0},"6jwO0fI0_BD7XDuBquouRg":{"text":"WW2 history doesn't typically interest me but I had heard such wonderful things about this","useful":0,"cool":0},"H-W_L3vGTetFgYyGS8iRMg":{"text":"Excellent must-see museum and mood. Was very impressed with the WW II movie and how much i","useful":0,"cool":0},"TIm5gGbuwZ_5QK0PZ-iPNw":{"text":"Absolutely brilliant!! Give yourself a good 3-4 hours. I am not a museum buff by any means","useful":0,"cool":0},"xENClO_D2T5mL_sf8jG4zw":{"text":"Outstanding!  Spent 5 hours here and could easily spend 2 more. We had college age individ","useful":0,"cool":0},"W-M-vi1s9B-72Yv96bkA3g":{"text":"A deep history lesson awaits you at the gem in the Warehouse district in NOLA.  If you're ","useful":0,"cool":0},"-AiXHCrK6zsuZM7f69UEyw":{"text":"An incredibly detailed museum! Had to brush up on my WWII history and this museum through ","useful":1,"cool":0},"-gBKWCdIDWq-nyVSo8CE6g":{"text":"We spent a whole day at the museum and did not see it all. We boarded the train at the beg","useful":0,"cool":0},"g7rA-iTOy4s2_CybjhXRxA":{"text":"It's a beautiful exhibit, really well done throughout multiple buildings. Will take you an","useful":0,"cool":0},"ZRFTlEGYMqh6_1l38J-zmw":{"text":"TICKETS - if you want to see everything but want to split it into 2 days, get the Second D","useful":0,"cool":0},"lZJD0qRBvrIyj_etmRyPPQ":{"text":"This museum gave me the chills. I felt a bit overwhelmed learning about the past and havin","useful":0,"cool":0},"NmPKpOEcFqfE7FyA4_hLrg":{"text":"All the good things said by others apply. Although a bit pricey, there is a small discount","useful":0,"cool":0},"7WOhXb5db67ls0NB8XmGIg":{"text":"Wonderfully put together museum, good for all ages.  Good for a few hours or an entire day","useful":0,"cool":0},"fMuJuXNhKxtrPYbhjHl9lw":{"text":"This is for the 4D film, \"Beyond All Boundaries\". See this film alongside veteran visitors","useful":0,"cool":0},"j_6HRX-AjipHn2LKnAHAIg":{"text":"My mom and I came here one Friday afternoon to see what we could see. My grandfather serve","useful":1,"cool":1},"IfHvfdhQhysSq4SMrf7gKw":{"text":"If you are in New Orleans and you have any interest in visiting a museum this is a great c","useful":1,"cool":0},"ajzCV68eJq9qDGge-UQALQ":{"text":"Must go if you are in New Orleans. It is packed with history. The artifacts are just a gri","useful":0,"cool":0},"vGe5FYxfmAegbt4WASToew":{"text":"The film was awesome! Everyone needs to go see it. The museum has so much info you could m","useful":0,"cool":0},"rq66vLCxn7jEDJl35qNBFA":{"text":"I didn't go here but my husband spent the whole day.  He saw so much and was very impresse","useful":1,"cool":0},"HRvJw9sqWhUr_c2RofpOxw":{"text":"This was, bar none, the most engaging, educational and moving museum that I have ever visi","useful":0,"cool":0},"phx72WDGKJuih2BzncrsKw":{"text":"My friend and I who are both military decided to visit the museum. Upon receiving the inst","useful":0,"cool":0},"avJaFSsDv2_5s0svlFJzXA":{"text":"What an experience. I recommend everyone visiting new orleans to go to  the the WWII museu","useful":0,"cool":0},"M_9CKOXZNCqudnxfS4aHbA":{"text":"Was here for a conference, and one night they had the event / drinks and dinner here.  \n\nT","useful":0,"cool":0},"wgZDXAn5pdi9qlaYFHDYMg":{"text":"They recommend 2-3 hours a visit. Really, you need more than that if you really want the f","useful":0,"cool":0},"C7Yki4SchIrM7BOjzuEDxw":{"text":"I attended the museum when it first opened up several years ago. To see the change and phe","useful":0,"cool":0},"nrpXs2R4kQf-uLDwqpJ6DA":{"text":"OMG.....amazing!  And it is more than worth the extra $5 to see Beyond all Boundaries.  It","useful":1,"cool":0},"9mrlasXND0UuxTw4lMSojg":{"text":"My family has been a sponsor of the National World War II Museum (formerly the National D ","useful":4,"cool":3},"4jpdtbjB_iHiVRiKqWAXLg":{"text":"The exhibits are great but the navigation is not clear at all. The series of interconnecte","useful":0,"cool":0},"6hxBhhkxRfkz3nAaC2XnmQ":{"text":"We definitely did not allow enough time for this place, I could have stayed here all day!!","useful":0,"cool":0},"FrZiSoYtj0vZdBPNaDGI_w":{"text":"This was an awesome experience! Loved loved love the 4D experience with Tom hanks. It gave","useful":0,"cool":0},"6cD-zm8LNSDmOfx89bKBkw":{"text":"This museum is amazing!! If you love history this is a must see attraction in New Orleans.","useful":0,"cool":0},"wSjQUOr1NfWrgxpmyIFQEA":{"text":"AS good as any museum I have been to.  They display  the aircraft so you can see them from","useful":0,"cool":0},"4dM4as4VFghB__mLTRBaiw":{"text":"Over-excite, tepidly deliver.\n\nI came to the museum really stoked. WW2 has become probably","useful":1,"cool":0},"9pr-Ew42lCqZbT55OCKwJw":{"text":"If you are coming to visit New Orleans you must stop at the museum. It is one of the best ","useful":0,"cool":0},"6oMrfVWGig-qYiz7sDnV1Q":{"text":"I promise theres a lot more to New Orleans that just drinking on Bourbon street. Thats wha","useful":2,"cool":3},"A5Q9VkZkIBQnBKnEze9VwA":{"text":"The Museum is a great family outing.  Exhibits are interesting and the dog tag feature has","useful":0,"cool":0},"UOqLk3_de2Wwc8vUjVyv6Q":{"text":"This is a must see museum. We took about 3 hrs to go through it all. The museum is well or","useful":0,"cool":0},"M7eAlTJbG5qzqaAIWbiILA":{"text":"Everything about this Museum is Outstanding. Every American should visit at least once in ","useful":0,"cool":0},"-dkrPtXgzQk6nvFC972uNw":{"text":"Arranged like a campus, this museum explores the European and Pacific Theatres, the homefr","useful":0,"cool":0},"vbeFWg5Yp8hf3CWXfKc4Ng":{"text":"What more can be said about one of the best museums in the United States? People rating it","useful":0,"cool":0},"0RNrzlAxH3ggNADSbPWT-Q":{"text":"Beautiful museum!!! Friendly staff and wonderful experience. It's very heart touching.","useful":0,"cool":0},"NUAfVlcr7-dKeqsWutUFvw":{"text":"Nice place, but plan to spend several hours to do it right.  One of the best museums I hav","useful":0,"cool":0},"Y3oSiURUzqRE6rnj5gQ6gQ":{"text":"Nice museum and well organized. It is mainly focused on the US army and not mentioning all","useful":0,"cool":0},"8A_Gq9mO9ogQwsapCBTiwg":{"text":"Perhaps the best museum I've found in the U.S., certainly the best military museum by far.","useful":0,"cool":0},"A0TbCepYIMPMYQmAhOZk7g":{"text":"Truly awesome,  I've never been in a truly submersive history meuseum. The movie beyond al","useful":0,"cool":0},"0ulU3MqWkYMtnT4DTK6EYw":{"text":"This museum deserves a 5 Star rating because of their interactive tour and exhibits. This ","useful":1,"cool":0},"5rNdscJIvnDf8cvrGD52pw":{"text":"Loved this place. Very enlightening. The warning it gives in the beginning about propagand","useful":0,"cool":0},"cBB6lZk8i7-xJqHwvSq4BQ":{"text":"wow the avg is 4.5 stars, really? uh ok .. well for me it is a solid 3 stars, that's nothi","useful":7,"cool":6},"JxlI4-91-l8eASberHnnJQ":{"text":"amazing place this place is fantastic and i recommend the videos they show you and it is s","useful":0,"cool":0},"4JJU3BpH6NY5NE9Q2X9UUg":{"text":"A must see if you cone to NOLA! Plan on at least a day and you will need several more!","useful":0,"cool":0},"2v7P_xtfrqh4-lOEk3L-4Q":{"text":"Before you come, make sure you allocate at least three hours of your time...there is so mu","useful":0,"cool":0},"JEHXGPUEw_fJ10rNWRsxYg":{"text":"Since several of my relatives were WWII vets, I have always been interested in learning mo","useful":2,"cool":2},"ie_q492WwXGpfIHXqgpYKA":{"text":"Excellent! Excellent! Excellent! \n\nThe amount of detail these folks put into the exhibits ","useful":1,"cool":0},"h-LxVCTNl1a9R_Z_OqIgSQ":{"text":"This is not your grandfathers museum, even though it may be about them.\n\nThis is the first","useful":1,"cool":0},"_Yp3sl2j8kXtR2gSCMhy-A":{"text":"Pretty amazing tribute to the heroes of WWII. Interactive experiences along the way help y","useful":0,"cool":0},"Db2giTalaxsqc_p2I1Avyg":{"text":"This should not be called a museum; it should be called a repository for memories.  As the","useful":1,"cool":0},"TiOOgFNiOM-jelEIAKAdIw":{"text":"When and if you're ever in New Orleans, be sure to check out The National World War II Mus","useful":5,"cool":4},"AoaNBnCYBO7KRhT7kZ4Dlw":{"text":"This is a very good museum that is very humbling to go through. It made me ponder the sacr","useful":3,"cool":1},"f8x2glivbSQMP-hUmk_AgA":{"text":"This is the most impressive museum I've ever been to.  It's vast and very well done.  They","useful":0,"cool":0},"bjXUN6tPDfpPdde8AbBiZw":{"text":"Not a fan. As a history teacher I was excited but that ended quickly. It was crowded and p","useful":0,"cool":0},"aPgIWiNqpQTQpC8aTTkvlA":{"text":"A must see! The whole family will enjoy this museum. I was there for about 3 hours, but co","useful":0,"cool":0},"igj2bC7F4DQLd1aFj0By7g":{"text":"I can't leave a complete review because we really didn't get to experience everything this","useful":0,"cool":0},"fTi1oPbUaPh6rmKnq5aEwA":{"text":"Well worth it.   It takes quite a few hours to see but provides a \" big picture\" of the ti","useful":0,"cool":0},"CI8j09aFQXwM4itUN_jXCw":{"text":"Best: film narrated by Tom Hanks.  Outstanding.  Buildings clean, modern, exhibits very ev","useful":0,"cool":0},"o7M5y0_6C1NxXdivSWHPdw":{"text":"After finding out that this museum was considered one of the best in the world, it kind of","useful":1,"cool":1},"UQV1M5SYcWPWkP_2e4JdKQ":{"text":"Anyone who visits New Orleans should check out the museum. The movie is a must see. It's h","useful":0,"cool":0},"ZnvFTVuf_6ceBs5qYxgxaA":{"text":"Urgh! Educational! No! Just kidding - the National World War II Museum should entertain th","useful":4,"cool":1},"hSeJCPc0V-1A7uUaki18aA":{"text":"Very interesting and interactive. I learned a great deal more than I knew going in. Especi","useful":0,"cool":0},"HLkwflIluLYiDTJxjNmapg":{"text":"Definitely check out the movie Beyond All Boundaries. It was really cool. A lot of 3D effe","useful":0,"cool":0},"lEIMw3xu4qkM0KHoaYat8g":{"text":"Fun and informative museum. You can spend a whole day there if you want. The road to Berli","useful":0,"cool":0},"CLVY8hvWyu1MNlRj0_Fwxg":{"text":"Don't miss the Beyond all Boundaries. That is the highlight of the Museum. A lot of the pr","useful":1,"cool":0},"mgwXHMIf98uX9QysyoFljg":{"text":"This is an awesome place for all history buffs. Great for the whole family. We visited ear","useful":0,"cool":0},"bRmhdmx_QTS42-H4rkCcGQ":{"text":"May be one of the best museums I have visited. Very informative, I learned so many small d","useful":0,"cool":0},"v5_enrAoCJG_X3RrW5_XrQ":{"text":"This is called time well spent . This is no 2 attraction in country for a reson . Unbeliev","useful":3,"cool":3},"gA7dmw2wUeENh_bc_9yw9Q":{"text":"This museum costs $22 with the AAA discount.  As with all war museums, it tells a distinct","useful":1,"cool":0},"wfnNSUV9_N2DDFlqQvDNnQ":{"text":"Hands down THE best museum I've gone to.  What an incredible asset to New Orleans. Through","useful":0,"cool":0},"uOZZEOsnj1eCC0JT1QuRPA":{"text":"I was skeptical about coming here, but it was raining, and the museum had great reviews. T","useful":2,"cool":6},"euaACYbOFMhagJoFFx9gwg":{"text":"This is an impressively funded museum.  The buildings that store the exhibitions were impr","useful":0,"cool":0},"d5h78X0CnQy3FD7uqQzIHw":{"text":"Great and in depth museum about every thing WW2. I spent about two hours walking through t","useful":0,"cool":0},"T07MX2a-zhe4GOVEqryq3A":{"text":"You simply have to come. I've lived in Nola for two years now and I make a point of bringi","useful":0,"cool":0},"FCKboDdVcAfKbFVhMrpM1Q":{"text":"Came here on the day we were leaving NOLA and I wish I had visited earlier, only a few hou","useful":0,"cool":0},"I13TNwL-HOdPm47hD5wLzw":{"text":"This museum is sometimes advertised as the \"D-Day\" museum (as opposed to the \"WW II\" museu","useful":0,"cool":0},"gHvd9gD8HWL9maTWN5Iv-Q":{"text":"You are definitely getting your money's worth. There is LOADS of information! It was reall","useful":0,"cool":0},"XDD6VB_CWd3QGmJoJavGNw":{"text":"The BF really wanted to go to The National WWII Museum while we vacationed in New Orlean's","useful":7,"cool":4},"SGzZBLF4xInLdHR4pG6VNw":{"text":"Overall, well worth the trip.  Well delivered experience. \n\nBeyond all Boundaries is a mus","useful":0,"cool":0},"6VJqENyTTKsNQrspClxQrQ":{"text":"3-4 hours and you'll see everything in this place. Overall this was a nice experience. I d","useful":0,"cool":0},"CPOHqezGUFdjiyqH8zPllg":{"text":"This place is like WW2 utopia. Get here early because spending 4-6hrs going through the mu","useful":0,"cool":0},"xogud-Sj-neyXei2I79j3w":{"text":"I had a great experience @ the National World War II Museum.  They have a little film narr","useful":0,"cool":0},"DGALXqlqgtSSzyE9r7zDQw":{"text":"Great museum for both military and non military WW II history buffs.  Located not far from","useful":1,"cool":2},"r8BeHvyxfNw08vP09_sbiw":{"text":"Fabulous. The Beyond the Boundary show was immersive and educational while not being exces","useful":0,"cool":0},"A-M5IyHsfPpelMWkQzm8HA":{"text":"Came here for Museum Day so it was $Free.99.  I found the exhibit very information.  Had s","useful":0,"cool":0},"ZbFFK6riq7S5SR5LXGHxPQ":{"text":"My dad trained to be a fighter pilot in WWII, so the the Museum is one of those places I'v","useful":0,"cool":0},"pR2sZoXzZaAFTvgyv_KTEA":{"text":"I have been to this museum on 4 different visits over several years, and it never disappoi","useful":2,"cool":1},"meE9yhaK6VlmSaOP_l9O1Q":{"text":"Totally amazing. The sacrifices that our family has made for us. The movie is a must see t","useful":0,"cool":0},"5zehlOyQ4SovJA44SmDiHQ":{"text":"After waiting in line for about 30 minuets or so to purchase our tickets in the main entra","useful":0,"cool":0},"vHyhVBg7HqqB0xtmreerDg":{"text":"4/5 educational and entertaining\n\ni've visited the space a few times, but really didn't wa","useful":5,"cool":1},"9rrWMZCgAyLF0bdZE9jJdA":{"text":"Very well assembled, and well curated, exhibits. Moving interpretations that help us remem","useful":0,"cool":0},"Kq3IsVZBrJvR2IHJSGRtLg":{"text":"The museum was extremely educational and inspiring.  We added both movies to our base tick","useful":0,"cool":0},"yjzj6YoFrjm-mm2e43_rZw":{"text":"Go!  Just go, for your own sake. Don't cut your time, because after you see the \"Boundarie","useful":0,"cool":0},"XKavxnQXOPZ9IEJNNr2v1Q":{"text":"My wife and I always visit at least one museum while on vacation, this time it was The Nat","useful":0,"cool":0},"deb4sRHpL2AHGlwvzkK0qQ":{"text":"I've been to almost all the museums in the NOLA area, the D-Day Museum is hands down my fa","useful":0,"cool":0},"UbMjAricZUSpoPNs7gEQKA":{"text":"Really wanted to give this museum 5 stars as it had all of the right components to be a to","useful":0,"cool":0},"ONqbVidYXj0uZf0QN0srxQ":{"text":"This is one of the most immersive museums I've ever been in. You feel the temperature drop","useful":1,"cool":0},"tvnO_YBWisCq8tAHhtyvnA":{"text":"A beautiful museum for everyone!  A must see if you're in the area. Plan on a few hours to","useful":0,"cool":0},"UElBIivyj-S1O8STMHxGIQ":{"text":"Very cool museum! I learned quite a bit from what was presented. I only did the exhibit po","useful":0,"cool":0},"-ZuRctDcwuj8t5z3B98FLA":{"text":"First of all, it is FREE to all active duty military men and women to enter the museum. Fo","useful":3,"cool":0},"-FaMnY5PH-Q4L5D5VZkTtg":{"text":"Really great place to visit. There's so much to do here, you could easily spend a few days","useful":0,"cool":0},"oPcJIJ-7TdZAmPfqm_GoEA":{"text":"Enjoy a good food experience in the awesome WW 2 museum cafe. The food prices are moderate","useful":0,"cool":0},"IfEaTwhXfrn9HNk3KQ2J6A":{"text":"Okay, so this review is from my husband, who loved this museum. He'd visited it before but","useful":0,"cool":0},"avk-BwEthVuDM71zZA0rWw":{"text":"We gave ourselves some extra time and thought 3.5 hours would be enough... We could've spe","useful":0,"cool":0},"Z78lKT34WPXiEGQGIvrxbg":{"text":"Simply overwhelming. Plan on at least 4 hours to see it completely. We should have purchas","useful":0,"cool":0},"ingzsPokjimbWtQn0TsT-Q":{"text":"If you want to see this entire museum, plan to arrive when it opens and leave when it clos","useful":1,"cool":1},"40_t-DYwBkSNXUYMIbGIag":{"text":"I've been wanting to visit here for years and finally got to make the trip. The whole expe","useful":0,"cool":1},"gyEPi62S_4ZY6eD388cqIw":{"text":"Worth a visit . airplane exhibit was  very cool.  Went to the show how and had dinner ther","useful":0,"cool":0},"P0TrlGDsGi9SM2Z5R4pqMw":{"text":"My boyfriend and I drove in for the day and decided we would visit the museum. Oh wow! Wha","useful":3,"cool":0},"0zL4XqdFetnoQSw0T0jADQ":{"text":"This museum is awesome, in every sense of the word. The interactive exhibits, movies, vide","useful":0,"cool":0},"Hb24rJOLRuLb2q7EbGSsnw":{"text":"This museum is worth every cent.  My dad and I only had 2 hours to spend so we only got to","useful":0,"cool":0},"udOKcczD1ChHYnjaydxQyQ":{"text":"This place is an all day event, there is so much to see and it's very interesting. The mus","useful":0,"cool":0},"d99lRZO2StQB3nCcfRxz3w":{"text":"Took my parents to the museum today.  I'm a history person and so is my Dad.  Mom had uncl","useful":2,"cool":1},"_jMZFYV9dloJnKQX73AZCg":{"text":"Awesome museum!! Go early as it gets very crowded and it will take you several hours to se","useful":0,"cool":0},"fyOlkEQ4UpaXkLIXEeLVNQ":{"text":"Incredible museum. It's worth a visit when in New Orleans. It's a huge facility with a lot","useful":0,"cool":0},"9Fo4xGh5CeRV97j60FwyfQ":{"text":"An absolutely must do when visiting New Orleans. There is so much to see, it's an all day ","useful":0,"cool":0},"AUGpCJspWzQJFq0zW4KgAw":{"text":"Great museum! I wish I would have had the whole day to go through the whole place to have ","useful":0,"cool":0},"9VvHZ28jwniBVgdooPpRoQ":{"text":"We spent about 3 hours visiting this museum, but could have spent at least twice that much","useful":1,"cool":1},"9sa9t0Ur4kSqm8EbYK9JQw":{"text":"As a secret WWII history buff, I made it a point to come to this place and was very please","useful":5,"cool":1},"COYQnZxIAZKgarmg_2fcBw":{"text":"This is a well- designed museum allowing visitors to move at their own pace and focus on s","useful":0,"cool":0},"qxqbl0JNYPMQ7mGix7wAzw":{"text":"Amazing   Plan on having at least 3hrs to take it in without rushing and even at that you ","useful":0,"cool":0},"_T05kMBhkzsS6tQHOcRcIw":{"text":"It's going to be Five Stars when it's done. Right now it is too much reading and video. Th","useful":0,"cool":0},"fIiXf5kTfGww4VS5yEHNrg":{"text":"I wanted to do something away from the more touristic area of New Orleans , so I decided t","useful":1,"cool":0},"VG-14W-Wkq5_IH8TaWfNRA":{"text":"Unbelievably well done displays and actual equipment from World War II.  Truly does justic","useful":0,"cool":0},"avVhYAesVQj7fRkEx75wGA":{"text":"Amazing museum. Well organized and quite comprehensive. Could have stayed there all day. A","useful":0,"cool":0},"gGP28RsLhoYtnR3GlkQ_Uw":{"text":"Great decor to set the tone, peppered with modern and enthralling videos and maps. Road to","useful":0,"cool":0},"LyEYFyhPdAr61ySXpWr9xQ":{"text":"We finally went after hearing so many good things about this museum. \n\nAnd we were not dis","useful":3,"cool":1},"wbZI-wEpu-yjt0VLTbfq8A":{"text":"Unlike my trip to the Houston MFA, there were no guards here hovering behind me or telling","useful":0,"cool":0},"Ix36zK3v-By3eEyDhw1jbA":{"text":"This museum focuses on D-Day and of course has the massive Boeing exhibit. I struggle with","useful":3,"cool":0},"Y2fHwIZNP4cMHSSHjLBF4Q":{"text":"My wife and I were blown away by the exhibits and the Beyond all Boundaries video. I perso","useful":0,"cool":0},"k6PswQfQM4XMeyMxpEJ70g":{"text":"wow.\n\nWhen Tom Brokaw described those who grew up in this generation through depression an","useful":1,"cool":0},"R4lZWFGRI3O42bEyfmPCwg":{"text":"The BEST museum I have ever been too.  Spent 2 hours absorbed in all the historic pieces, ","useful":0,"cool":0},"XInqeBOQP2AJCIICsgDr4g":{"text":"A pretty new and informative museum! I was a little hesitant about going here since (let's","useful":1,"cool":0},"t4pWTnLSRHIZl2oQyV6Wyw":{"text":"I came with pretty low expectations having never previously been (or really heard about) t","useful":0,"cool":0},"R8fBo2tgc3N-xLHOAdC1RQ":{"text":"Was very good and very informative. Spent half the day there and I just overall enjoyed it","useful":0,"cool":0},"KCsfQhzQ-ZOsrkLjPHbOrQ":{"text":"Definitely do the movie!!!!  Probably the most interactive museum I've been to and I defin","useful":0,"cool":0},"VxtT8UR5fb8rLRYkfXk4xA":{"text":"I'm so glad we were able to see this museum while in town. It's very very well done! I can","useful":0,"cool":0},"RDjvbP-_LLIBilQSuB4MsQ":{"text":"Very educational!\nI actually really enjoyed the D-Day/US side of the exhibit. It felt olde","useful":1,"cool":0},"8afKQ17d4VoivmY7MTszRw":{"text":"I don't hand out negative reviews without great consideration, but I really don't think th","useful":0,"cool":0},"0yhANvfvzkAjMrwXsHPwIw":{"text":"My husband is a veteran so he loves this kind of stuff. All I have to say is WOW! This pla","useful":0,"cool":0},"qrgUgO4Wp5WR3BE3CaIHcw":{"text":"This is a spectacular museum that is done in a tasteful and educational manner. I only spe","useful":3,"cool":0},"2EtDbFDplTsZE5WTmilPKg":{"text":"What to say, it is overwhelming, amazing, proud of the sacrifices made by the men and wome","useful":0,"cool":1},"Gcc9QiccvYvPfPV1LJkk1w":{"text":"Very educational, interactive and fun. Worth the $ and time. I would give it a 5 star exce","useful":0,"cool":0},"Vtw7URV8Yguh60GSWUED5A":{"text":"Could very possibly be my favorite museum ever. I am also a WWII nut. But still. Amazing m","useful":1,"cool":2},"Z_SYgKvxPELuGVRW794y1A":{"text":"One of the best museums I have ever experienced. I went on Election Day 2012 and appreciat","useful":1,"cool":1},"7dAt9mKXugZ44wF9mP4A0w":{"text":"We got to the museum at 9:10am.  They had to kick us out at 5pm.  We spent about 8 hours i","useful":4,"cool":3},"Qn6_KX-FPGxYHDGH5_oLRw":{"text":"There's so much to see here! Most of it was videos that you would have to either sit (if y","useful":0,"cool":0},"ysDTEZmikqyxTr3kxW5-0w":{"text":"This is the GREATEST and most informational world was II museum I've ever been to! The aud","useful":1,"cool":0},"Xk5A4PaKx2i_nb5EqPz-Jw":{"text":"An impressive, sobering reminder of how dangerous the world was in the 1940s, the museum h","useful":3,"cool":0},"WVH6AAaK5YjRNP15PaQ_LQ":{"text":"Worth visiting. I visited about 2 years ago and it was \"Meh\". They've now made improvement","useful":0,"cool":0},"0m8kI-WV9Ij5L90toh65eQ":{"text":"This is hands down the best museum I've ever been to and I've been to most of the Smithson","useful":0,"cool":0},"JR4aXN-tb8ztDoknScRT-g":{"text":"Let's be honest, I am not a student of history. I just can't seem to remember dates, corre","useful":4,"cool":4},"5jJb9RlOzNKpLY3XrQAGqA":{"text":"This is one of the best museums. The articulation of artifacts, from the history of our be","useful":0,"cool":0},"Ea2HemLkzHKivqEpSmCVHA":{"text":"Fantastic museum!  I loved how individual stories are mixed into the various stories about","useful":0,"cool":0},"hgnpZ1Wv_HLGxJtmQ3OeBQ":{"text":"A great museum to visit if you are in New Orleans.  We spent a little over six hours there","useful":0,"cool":0},"Umlv8y1W4a-u6xzir2GW1A":{"text":"The National WWII Museum is an comprehensive history lesson in WWII. Four (4) whole buildi","useful":11,"cool":12},"Zs3hVmbtiXj4wVhqu4YLLA":{"text":"Highly recommended! Everything is well organized here, beginning with the \"train ride\" and","useful":1,"cool":0},"newtGV3zy0sYDmeSVS5PrQ":{"text":"I found this place to be a bit intense. All the sights, sounds, displays were very interac","useful":1,"cool":1},"MAXe1J1yEiR19Hq-96x1QA":{"text":"This museum is quite impressive and I highly recommend seeing it if you're ever in New Orl","useful":4,"cool":4},"MD_hG6O65y9fXqaKCZY43Q":{"text":"When I go to New Orleans it is to eat char-grilled oysters, visit Bourbon Street and catch","useful":0,"cool":0},"h5TAMau9Jas_guCz7Mge8A":{"text":"Great WWII museum, only wished I'd planned more time there!  I only had 3 hours, but I sho","useful":0,"cool":0},"7JCEnyUPdhxuVPDR962j0w":{"text":"This was one of the highlights of our trip to New Orleans.  We had not planned on visiting","useful":1,"cool":1},"oBRfTdia55kGcAXECJs1pA":{"text":"A must see in Nola and you could spend days here.  The building with tanks and planes was ","useful":0,"cool":0},"s8wxu4USGVPoGMs8VqW1Yg":{"text":"A wonderful must stop visit if you're in New Orleans, highly recommended for all the WWII ","useful":0,"cool":0},"0POTE3X3T5ZTAx04AAH89g":{"text":"One of the best museums I have been to!\n\nAs soon as you walk in, you're amazed by the plan","useful":0,"cool":1},"btBHE4Ma_FjSV2yLkUiFRg":{"text":"This is a must for anyone in New Orleans. You can easily spend a full day here appreciatin","useful":0,"cool":0},"CUaR0DxkpCoWLqA54Jla2w":{"text":"So this is an ALL day kind of thing. I like the dog tag idea but wish I could do more with","useful":0,"cool":0},"w02pQ0zeVGzoeEgQf8FIDQ":{"text":"OMG.....amazing!  And it is more than worth the extra $5 to see Beyond all Boundaries.  It","useful":0,"cool":0},"JHm0aC_EuUrj1aQvj77RDg":{"text":"Great museum, full of some great history. If you are checking this place out I would recom","useful":2,"cool":0},"4GCh0gTNk7avVkcYYfDWcg":{"text":"This place is amazing!  The history, the story, the artifacts, the knowledge. There is so ","useful":0,"cool":0},"q0qWFgq0Nc2rAIZNuGLpkg":{"text":"I cleared up a number of misconceptions about the war while I was here, and enjoyed myself","useful":1,"cool":1},"Wh7bD3Bgz88Rnrxn-0Z9Ag":{"text":"I thought I knew a lot about WW2 until I visited here. This place is an amazing museum wit","useful":0,"cool":0},"TJvgX9SJg4LTC8UUWRO3_w":{"text":"Such a fantastic museum! The layout is different from any museum I've been to. I enjoyed s","useful":0,"cool":0},"9oGBfKvxFoysrwh2bwnl8A":{"text":"This is a must see for anybody visiting NOLA.\nVery good tribute to those who served. Take ","useful":0,"cool":0},"O-MwmBZaOqsKOJwKd7Qqhg":{"text":"I had a great time at the war museum. It was $25 for an adult but worth the price of admis","useful":1,"cool":0},"MhQL5FoU-i6S14f6mgGu7g":{"text":"The Museum is excellent as a military history of WWII by and for the \"home team\" in the US","useful":0,"cool":0},"D86D94Svqf8f5Kv1EiVcJw":{"text":"The National WWII Museum is so large that if you are going to go give youself about 3 plus","useful":0,"cool":0},"txNpOrhjdUXD_2CiUYu8ow":{"text":"This place needs some editing.  There is just way too much.  Have been here twice and left","useful":0,"cool":0},"-cszXo86o2XCww0OTz1DqQ":{"text":"A comprehensive, powerful, state of the art history of World War Two. Not something to be ","useful":0,"cool":0},"RCxsdKKoWtgxqjv4D_ei0g":{"text":"Hands down one of the most amazing museums I've ever been to. For a relatively low price, ","useful":0,"cool":0},"RIr7tAnU4wK1YEEPnRgeTQ":{"text":"Great experience honoring the Greatest Generation!!!! Some of the exhibits are redundant b","useful":0,"cool":0},"N9RyOx_Hr_QE5dW6_KnJ3A":{"text":"If you are into American history you can't miss this place. It does a great job of coverin","useful":0,"cool":0},"Vi2WOuCBCc2TJu32Nx-Aag":{"text":"I highly recommend a visit... Great exhibits! \n\nSome tips... Go early. We came after lunch","useful":0,"cool":0},"3z_xGfsHgcUkjVSxou_aYw":{"text":"This museum is top notch!!!! \nEven the wife said it was great and she is not a huge histor","useful":0,"cool":0},"V7TXXGm1BjMR0c-Gf9ldHA":{"text":"Can't say enough about this wonderful museum. A must is the 4-D movie.. What a great exper","useful":0,"cool":0},"IdXI59_OY0fOcvKaF9rSbw":{"text":"Einen sehr beeindruckenden Beitrag zur Aufarbeitung der Geschichte bietet das WWII-Museum ","useful":0,"cool":0},"P8g4v-BQhhR4_kVSfAQ8Vw":{"text":"My wife and I enjoyed walking through the museum and taking it all in. I would recommend g","useful":0,"cool":0},"N5uMq4XnQE4AfTcW5IEl3A":{"text":"My friend and I from Canada spent portions of 2 days here and you could spend a lot more. ","useful":0,"cool":0},"LMGQRGwvNc2W6FcnTQoP-g":{"text":"Beyond all Boundaries is a MUST SEE. Super cool museum, the boyfriend and I are glad that ","useful":3,"cool":3},"GOYoijA4ZLLxGh3o4UpyxA":{"text":"If you are a military history buff you will love this place. Go see the re-enactment a blo","useful":0,"cool":0},"MmbQ8VCXHDnXeb7SkGMDSQ":{"text":"Getting to this Museum was a feat in itself.  It was a sweaty hot and humid day in New Orl","useful":2,"cool":0},"Z9E3N6ST25NbYPTW5ARh0A":{"text":"A must visit for anyone coming to New Orleans that even has the slightest interest in worl","useful":0,"cool":0},"5xJ97oxTA_M5hAf_0UPUKQ":{"text":"This review will be long, but there's a lot of backstory.\n\nI went on a high school trip to","useful":16,"cool":5},"XHDt2IMjmJzv12m_W9v7sg":{"text":"Please do yourself a favor and go to this museum, it's amazing. Plan at least 5 hours beca","useful":0,"cool":0},"vakuj0dD61T3mt-Bp1ChAQ":{"text":"This museum has four buildings with different artifacts from WWII. After purchasing your t","useful":0,"cool":0},"09cLCG5H1ykUogCT1g8fQA":{"text":"Amazing.  I have been to a lot of museums and I think this one ranks up there with the Smi","useful":0,"cool":0},"-tBvkQlPK4PereSZx4qrlA":{"text":"Great museum!  I really got a lot out of the personal stories and quotes throughout the mu","useful":0,"cool":0},"gSrpvbseTG0KcluIU5NCRQ":{"text":"Great experience but skip the \"train\" at the beginning. It's a rouse to capture your email","useful":0,"cool":0},"90rIKHC3-hf52agq4kjm6A":{"text":"Pretty good museum, though we noticed more than a few inaccuracies as we walked through an","useful":4,"cool":3},"lVmQBcT_zpTB35CgOhOGDg":{"text":"Lots to see and really cool exhibits with artifacts. We went on New Year's Eve (day) and i","useful":2,"cool":1},"Vz3sebJuLn7O6JFpDzt3nA":{"text":"The museum itself has impressive displays and artifacts.  The dogtags that allow you to fo","useful":0,"cool":0},"ic-BHX2mppKAPUWZEDmxFQ":{"text":"This is a terrific museum and worth the visit.  The museum tells the story of WW 2 from a ","useful":0,"cool":0},"559UNQDgWmJbxa_fj5ewvw":{"text":"Go early!  We didn't give it enough time and felt rushed.  This museum was incredible and ","useful":0,"cool":0},"sz9mFGn1bpdZBEduC51rVw":{"text":"My husband and I squeezed this museum in our visit because some of his friends are raving ","useful":0,"cool":0},"ff999yDYwEnERHGBhXnjRg":{"text":"Wow. Amazing museum. The planes are impressively hung from the ceilings, as if they are fl","useful":9,"cool":6},"TnLatYbWxpu5XVr8UT3NiA":{"text":"Incredibly well done! Plan to be here several hours. This high tech museum will immerse yo","useful":0,"cool":0},"EJZkylrPLruDErnY5nt9Gw":{"text":"This is a terrific museum for history buffs, but anyone should find it interesting.  The \"","useful":0,"cool":0},"1zq7bWVxWZ4mg6BQeNw5kg":{"text":"Great place! Restaurant downstairs is a must visit. Best burger I have had in a long time.","useful":0,"cool":0},"YPiIf8OazWMG7lhgfb83pw":{"text":"The World War II Museum in New Orleans should be a \"Must-Visit\" for everyone if you have t","useful":1,"cool":1},"aj-P46XbZpExTMPt3vzI9w":{"text":"Wow, wow, wow.  Read the reviews and devoted time to this museum, but still could have use","useful":0,"cool":0},"_NoGDwVfbCPs445pnxdyCA":{"text":"Great museum and definitely worth the price for a great combination of historical artifact","useful":0,"cool":0},"2iINwGAbdQkr7GUZ6ac2sQ":{"text":"This is a really nice museum. Well put together and very interesting. There is a lot to se","useful":0,"cool":0},"kM7MUPQrvT5cG-gii0QNyA":{"text":"This is a fantastic museum and it is filled with tons of facts about the second world war ","useful":0,"cool":0},"fQN8bGhRkYzsg0CFxFIi1Q":{"text":"What a great museum!  If it's a rainy day, this is a great place to be because you can spe","useful":0,"cool":0},"geoBRYXOKWjIzIlSdomz7g":{"text":"As history geeks, my wife and I had always planned on visiting the D-Day Museum, but someh","useful":0,"cool":0},"08_OseimBYkKptPhAjDwQA":{"text":"Pro-tip: if you, like me, have an early AirBnB checkout but a late flight, save this museu","useful":0,"cool":0},"4N7hNuQbZPXihjQnwrEXJw":{"text":"I loved touring this museum.  We got the standard ticket, as we didnt have a spare 45 minu","useful":0,"cool":0},"EdRygcyB4v0CYCjSzfFpSQ":{"text":"Too much to see in a single visit if you like to see it all. I tried and it's hard to do w","useful":0,"cool":0},"22vQ0JBHk2mk1wt8lJJE-w":{"text":"An absolutely well done and educational institution. This is a must see! I was left more e","useful":0,"cool":1},"7sK3TxSrHVUPwxIO6y-sUA":{"text":"Loved this place. I always was fascinated with its history and now was able to show my dau","useful":0,"cool":0},"MDB2mklHABjlIViSgosYTg":{"text":"Definitely worth a visit. Budget about 2.5-3 hours for the museum and then another hour fo","useful":1,"cool":0},"XSRQnvX35vx869df56Tpag":{"text":"Great memorabilia on display with a good organization to the displays. \n\nDont forget to lo","useful":0,"cool":0},"XzRddGEBtZWZhqicfC-G0A":{"text":"This museum is so educational and well put together, it sure opened my eyes to a lot of hi","useful":0,"cool":0},"3jYuzq7WyFgOOfbd1ecUZg":{"text":"This is an absolutely beautiful museum. My wife and I visited here during our recent visit","useful":0,"cool":0},"UyTn4vGfp8oBuBQbzErHNw":{"text":"Fantastic museum! We only gave ourselves 4 hours the first day, expecting that was enough ","useful":0,"cool":0},"K9s4S0UAupv2v9Jk51zlQg":{"text":"My favorite part of the museum - all of the audio recollections from veterans and others w","useful":0,"cool":0},"tBmZ7wsIxDAkbJdO0Myk1g":{"text":"I agree with the reviews to splurge on the Beyond Borders movie but the final mission wasn","useful":0,"cool":0},"IUEVVJn2Nu6uK8YLr5VsFQ":{"text":"Pre-ordered my tickets on the internet and had to wait in the regular line to get them (wh","useful":0,"cool":1},"l8wbkPy-Kxy6Hzhq8CMosw":{"text":"Humbling very humbling. So much information. They had a table set up when you walk in to t","useful":0,"cool":0},"y39CxjakwqOhPPaEvsd8lQ":{"text":"*UPDATE* I've recently been since my last review. The non-happy people have been replaced.","useful":3,"cool":0},"qNuVH89wIuFnG1ULeoiv2g":{"text":"This was a great museum for people of all ages. It had interesting multimedia exhibits, a ","useful":0,"cool":0},"hmRQnKZ7ivNIToIF8Hdb-Q":{"text":"One of the best museums I have ever been to! It's interactive, detail-oriented, well-desig","useful":0,"cool":0},"YxB2nhDIi96Q7CxjaP2ZWg":{"text":"The National World War II Museum is a \"must visit\" when you come to New Orleans.\n\nI have b","useful":6,"cool":4},"J_VAPVg_bOOh-YEe-c_EdA":{"text":"At over $70 for two people, this museum is not cheap. That being said - it's a beautiful f","useful":0,"cool":0},"Ep5Bsvm4mBZOgQPmz0kxDA":{"text":"A must stop when you are in New Orleans.  This is one of my most favorite museums in the w","useful":1,"cool":1},"wsjs48MZvgRnQ1uMJ68T9Q":{"text":"This is a class act, with accurate history, displays, commentary from individuals on film ","useful":0,"cool":0},"T6erEvZkvhUorDnZEj2ocQ":{"text":"You Definitely got to check this place out if you are in New Orleans. It was such a great ","useful":0,"cool":0},"QegTtYwxHItutvGmrtTBKQ":{"text":"I'm glad it rained during my first day in New Orleans because I had the opportunity to exp","useful":1,"cool":1},"0GowNUOczGpsmMPANvHZhQ":{"text":"First, if you're visiting the museum, make sure you spend a few extra dollars to see \"Beyo","useful":0,"cool":0},"SliHUBkNmPUqQEGQo5VcZQ":{"text":"Wonderful museum with lots of volunteers to answer questions. The movie with Tom Hanks nar","useful":0,"cool":0},"lF0g9D2G_4VWQscPKRE2dA":{"text":"Outstanding visit.  I recommend the museum for all ages, however parents of small children","useful":0,"cool":0},"kn6p3HI7XE2RQ0P7JysnvQ":{"text":"This is a world class museum. I am proud that it is located here in New Orleans.   People ","useful":14,"cool":9},"DtGL-AgMI35K2DL5rF6hSQ":{"text":"I'm not a history buff - AT ALL, but this is a definite must do if you are visiting Nola. ","useful":0,"cool":0},"xwDeFWD8GjhPCZXY0gVeNA":{"text":"The most incredible musem I've been to.  It will blow your breathe away with an emotional ","useful":1,"cool":1},"i3hNEf9Qj-s9elXIzunkOQ":{"text":"Loved this museum - visited on a weekend trip to NOLA and it was one of my favorite stops!","useful":0,"cool":0},"kmynde0vi4XErQZq4gTf1Q":{"text":"This was a great tiur, I suggerst auditorium fistm == eat in th may pkas n the mddle","useful":0,"cool":0},"UJ7q0awXbhpV5a7wTR7eYQ":{"text":"Second time to this amazing museum and it was even better than the first time! The way the","useful":0,"cool":0},"uSpyClB4Y-G880OUYHFtUA":{"text":"Went in with high expectations as this is supposedly the third best museum in the US. I fo","useful":0,"cool":0},"zObvkb3opQtEGRiRhI5d1w":{"text":"The WWII museum is so completely well-done. This is a MUST-SEE when you are in New Orleans","useful":0,"cool":0},"xnmA0RzZYPFemews8lgrkg":{"text":"I love visiting new cities and exploring their WWII museums. One of my favorite museums so","useful":0,"cool":0},"L_ut_Q2d8UpgNVWiW2K8vQ":{"text":"Utterly amazing. They explained D-Day extremely well and I loved how they had different 2 ","useful":2,"cool":0},"QIC7d3GCrRsBXzh4FypAqQ":{"text":"Why a place.  This museum was formerly known as the D-Day Museum and to some considered th","useful":1,"cool":1},"L1PbrDVg-fd21lDiL8DfSw":{"text":"** Great Museum, Must Check Out Tom Hanks Movie **\n\nIt's a relatively new building with lo","useful":0,"cool":0},"Ch1fXcr7mhuFB09LQ-2Low":{"text":"This is a FANTASTIC museum in NOLA that you must find time to visit! Even if it is for onl","useful":2,"cool":0},"gMDDHBkW5GPZLtSj76yBEA":{"text":"What a fabulous tribute to the veterans of World War 2!  We brought our father here, a par","useful":0,"cool":0},"CxBq8Y9dFrVcozryOHovKQ":{"text":"I LOVED this museum. It is very well put together. You can spend a lot of time there. The ","useful":0,"cool":0},"7az_1cBbyLsa8hrcEWJfiw":{"text":"Like most museums, this one commands reverence as soon as you enter it.\nI immediately felt","useful":2,"cool":0},"8wfoFhIFgAexaY6tHCF_Sg":{"text":"This museum is amazing.  The quality of the displays exceeds the Smithsonian museums -- my","useful":0,"cool":0},"5Aile9Y6xYKqVobj53jU7Q":{"text":"This is such a great museum!! Give yourself at least a full day (10am-5pm), perhaps two, e","useful":2,"cool":1},"uIWeNb3WwRMs2Qx9vArmIQ":{"text":"This is a wonderful building filled with displays of national historical information.  To ","useful":0,"cool":0},"lBNBpZV0Ubv6l5S2y0OADg":{"text":"Visited the WWII museum on a recent trip to NOLA for the Sugar Bowl.\n\nOverall it was a gre","useful":2,"cool":1},"AUHhfCYTUZrlEdUVsqnsjA":{"text":"It was interesting to see this part of history through the american eyes. The new building","useful":0,"cool":0},"L6P_guBIw18qEYjz6svxQg":{"text":"A friend of mine was in New Orleans over Thanksgiving and told me to stop by the WWII Muse","useful":5,"cool":5},"8WawL8coImV1J4hKjG0mWA":{"text":"Awesome museum.   My daughter loves the history of world war 2 and we got there at three o","useful":1,"cool":0},"zcLyWA_cSb7zpN_wLHIu-Q":{"text":"Such a great museum! Definitely go here if you are in New Orleans. We only had an hour and","useful":0,"cool":0},"oaX32yS768pruqUR3kuplQ":{"text":"This was an awesome time well spent go to. My dad was in the Navy in the South Pacific, hi","useful":0,"cool":0},"m4WWZIVa2i9tOYXkpUODrg":{"text":"This is one of the best museums I have ever visited. It was thorough, interactive and inte","useful":0,"cool":0},"6Qp2UhCN_3YvcWhh7d9wcA":{"text":"I spent two days touring the exhibits at the Nat'l WWII Museum.  The \"Road to Berlin\" exhi","useful":0,"cool":0},"hxdh3EVjQPYPgQMfbWKLtg":{"text":"Incredible experience!!! Recommended by several friends & am so glad to have had the chanc","useful":0,"cool":0},"f0-hNeUKOzDT5QWz-VKE1A":{"text":"Wowers. I'm not known as a museuem lover - but there's been a few times when I've been wow","useful":8,"cool":6},"5UpjUIoxoKY4WnZ82ickZA":{"text":"What a moving, emotional and inspiring exhibit! The exhibit was designed to take the visit","useful":1,"cool":0},"v_TEzGM6hf4YTXNezTerfA":{"text":"Amazing!!! You cannot miss this museum if you are in New Orleans. Plan for a whole day vis","useful":0,"cool":0},"TSZUPk7-xwsud7jGMmCl5g":{"text":"this place is great! very informative and interactive. i really enjoyed my time here and h","useful":0,"cool":0},"P3WZGi2TwgGJJDZ8AZzJQw":{"text":"An incredible walk through history. Not often you can see the types of artifacts housed th","useful":0,"cool":0},"kYk6r1osYeMCqfd3Ej_-7w":{"text":"Long after this review gets buried in the hundreds to follow, I'll still remember the plac","useful":12,"cool":3},"vTAuExzkNqCf8SfSBlKMrw":{"text":"Not much I can add about the museum to the other reviews- it's a great facility and offers","useful":0,"cool":0},"kYUMxApfsnHwScXxwtJDJA":{"text":"I was born just after WW 2 ended.  Every adult male and many women of my parent' s generat","useful":0,"cool":0},"Ijw3hAsNpdEsembR_60yEg":{"text":"A great experience overall, in particular the 4D movie which makes for a great overview of","useful":1,"cool":0},"nFun5Wli1A-V1rBEhw3FAw":{"text":"Very educational. Very well structured, exhibits were nice and functional. Admission is a ","useful":0,"cool":0},"5DnvldHFjcmij0Uys-Y4lA":{"text":"I finally get why there are so many WWII movies still being made, they were truly an amazi","useful":0,"cool":0},"BY7Gte6Pz3Ho2pNtky1OzA":{"text":"We spent 6 hrs here and it was unexpectedly the best part of our long weekend in NOLA.  Ev","useful":2,"cool":0},"ypoMqSncRRMEpJuKxbzU7g":{"text":"Incredible movie! Should be part of every history curriculum in US high schools. 45 minute","useful":0,"cool":0},"2492sjLWBpTlm126anJchw":{"text":"Wow, bombers? YES! crazy weapons and style and food? oh my, YES! I need to go back for the","useful":2,"cool":1},"bS9fSSPH-x12S2arDS6Q7g":{"text":"5 out of 5 - no question.  On caliber with Smithsonian and better in many ways.  Loved the","useful":0,"cool":0},"WoHPOUEUu0oQrRNy-92L9Q":{"text":"I was humbled by me experience at this museum and realized that I owe my freedom to the ve","useful":0,"cool":0},"YX7DnBZGmn4ShStvJTOhsA":{"text":"ABSOLUTELY AMAZING!\n\nThe Boeing exhibit was incredible. So many planes & you could look at","useful":0,"cool":0},"bHEUtHZ4brxneGT9pNWKWA":{"text":"Very good place to learn the history of WWII. The settings were nice and helped to create ","useful":0,"cool":0},"DE5AaHAtPSywBEaYHoBwSQ":{"text":"I don't know of another museum like this so I don't have anything to compare it to but thi","useful":0,"cool":0},"fM-yYcpBgfXecYhwLqa06A":{"text":"Awesome!  Spectacular! Amazing. It's a whole day adventure for sure. The extra expense to ","useful":0,"cool":0},"OsGF6MruHwfrBCBc7LTwKw":{"text":"very very educational, must watch the documentary on WWII narrated by Tom Hanks, so much h","useful":0,"cool":0},"5cScJMeujWwrnGxj9SjPHQ":{"text":"What a place to visit.i was overcome with everything I saw.the videos where everywear.clip","useful":0,"cool":0},"_6kNAGDgNaOic6-7QeRmzA":{"text":"Loved the museum - very comprehensive of all aspects of World War II from the American per","useful":1,"cool":1},"uq8g4eS3LH69K86pGdSpjA":{"text":"65,000,000\n\nLet that sink in. 65,000,000 souls were lost during World War II. Can we even ","useful":0,"cool":1},"UzJxoRPEkgdGt1ohin78dA":{"text":"This was the most amazing museum I have ever visited, but it was also one of the most inte","useful":0,"cool":0},"ppyhV9cdSKXhf_kF2qc67g":{"text":"This is the best museum I've ever experienced, and I grew up in Chicago and have been to D","useful":0,"cool":0},"TP64sTF99foFfOkhE80j9w":{"text":"This is one of the most amazing museums I have ever visited. Even if you are not a fan of ","useful":2,"cool":3},"j1J-VCrFwgtNllmPTDlEtw":{"text":"While I was down in New Orleans with my Father we went to the National World War II Museum","useful":1,"cool":2},"Kz15ESVt_0QFWE-fVXsN0A":{"text":"What a moving experience - especially since my dear dad was in WWII - museum is state of t","useful":0,"cool":0},"ogGkwtycdUDyDJ8iJ9KPaQ":{"text":"One of the best museums I've ever been to and worth every penny! I don't think I've ever s","useful":0,"cool":0},"eh3PsBPwf2Fuj9ZhNdrFoQ":{"text":"My grandfather was unimpressed with the format and presentation. It was very crowded on a ","useful":0,"cool":0},"zVtjUVoxRDOeLOujg5XmVQ":{"text":"I'm not a big fan of museums. The last museum I enjoyed visiting was the Museum of Natural","useful":1,"cool":0},"9Ozf6czaKoaVBRmV9n_64A":{"text":"I am critical of war-themed museums (Military History degree).  This museum is among the b","useful":0,"cool":0},"eisxohlrljf6QlpsRifJZw":{"text":"A huge museum with a lot of history and great exhibits. My girlfriend and I went there on ","useful":1,"cool":0},"qdcBGRQlYxmit1CNaX7Vrw":{"text":"This place is awesome! Very education. See the movie first. The rest has great food too.","useful":0,"cool":0},"moMx7qQbnRAcNdRbsxgepA":{"text":"TL;DR -- Must visit for NOLA trips\n\n5 buildings\nawesome, personalized content\nSmithsonian ","useful":0,"cool":0},"ZIY9Us5oKTe-U2SnTlQ93g":{"text":"It was really tight.  Its really big.  Make a day out of it.  Maybe take something to help","useful":0,"cool":0},"QBTv7LrMih2UnZ_ZJm61MQ":{"text":"Overall a great museum packed with lots of interesting displays.  We went early and the cr","useful":1,"cool":0},"4W8HB75-wpx8q9r4mlrz8Q":{"text":"Excellent museum to visit.  Wear comfortable walking shoes and the exhibits have quite a l","useful":1,"cool":1},"V7CR4dP6X-AsyCEcSLFaOg":{"text":"The museum is well worth the visit and a great attraction.  Be sure to catch \"Beyond All B","useful":2,"cool":0},"hj_C9pDA3MaTFhnpbt6-Dg":{"text":"The Best Museum of its Kind!!!  I've never been to a museum that put things so into perspe","useful":0,"cool":0},"kiYtBiTkF4lV6HCy64FQNg":{"text":"Very interactive. Tells the whole story. Amazing hiw they've been able to put all this tog","useful":0,"cool":0},"205lCQrm6kIZycW_M1UzgQ":{"text":"Wow so much to see here. Volunteers were helpful and knowledgeable. Interactive exhibits a","useful":0,"cool":0},"-IwmwyR_7admBjeSXZcu4Q":{"text":"This is a MUST when visiting NOLA.  That should be the end of my review.  It takes more th","useful":0,"cool":0},"G-IaQtm9iKnrVGQ-G5O5rQ":{"text":"We stopped into the museum on a rainy Sunday. Both of us are history buffs , so we were ex","useful":1,"cool":0},"WHBp8EefafTlgvLMr5CU-g":{"text":"Absolutely amazing. This museum was better than any I've been too. It covers any persons p","useful":0,"cool":0},"XiJolw3yxwNQ_Xctgu064w":{"text":"This is probably the best $10 you can spend in New Orleans.  Unlike other places you can v","useful":4,"cool":4},"8I-gdvRGXKC25BTWGrFE3g":{"text":"Having gone to this place, I now wish I had paid more attention in High School history cla","useful":0,"cool":0},"SZ73H5gzoZJK0lqrLZclVw":{"text":"A must see if you are in the area. See the movie MANDATORY. Hosted by Tom Hanks they call ","useful":1,"cool":0},"wmsoyI4CCGvxDqmFYMLcrQ":{"text":"Incredible! Definitely a highlight of our trip to New Orleans. The facility spans multipke","useful":0,"cool":0},"hb-mQaLKRSIwfosDWTnqgA":{"text":"The content, such as the videos, text, and feeling of the exhibits is really top notch. If","useful":0,"cool":0},"KYHieKpfs5_b6qkL_Ve0yA":{"text":"I've been to several WWII museums both in the US & in France, this by far blew my mind awa","useful":1,"cool":0},"HwSYEV65r6WB6n4hho2noA":{"text":"This is an absolute must when visiting New Orleans, the detail of the battles the mistakes","useful":0,"cool":0},"myn3IkEY31WEVA9Y5rzLUg":{"text":"Immersive 4-D movie experience as well as 3-D exhibits\n\nOur group recently was able to tou","useful":0,"cool":0},"z8GuYbH3KZwOPl9zOvQ6oQ":{"text":"Located in Downtown NOLA. Make sure to reserve the entire day to check out this amazing mu","useful":8,"cool":4},"C5MvVjmQT6tFIDe_Oxm2BQ":{"text":"Quite an engaging musuem. I was absorbed for 6hrs straight and even skipped lunch.","useful":0,"cool":0},"G6aYsumuuL0mFE1DDlSCYg":{"text":"This museum is a must in New Orleans. I think everyone should go and learn the history of ","useful":2,"cool":1},"mebZALLwK5dahfZZx9hh1w":{"text":"Everyone with any interest in WWII should make this a top priority when visiting New Orlea","useful":0,"cool":0},"V6W-F9b4eBQlFe6sZys_zQ":{"text":"If you are in or near New Orleans, WWII museum is worth the visit. Our freedom did not com","useful":0,"cool":1},"5G-XvYoHWppSlhRc1TiJnw":{"text":"Hands down the best museum I have ever visited and I have visited plenty.  This is a desti","useful":4,"cool":5},"i9E6p5CMniTb_J1zTtEetw":{"text":"Very well put together museum, nice mix of static displays, oral histories on demand, hand","useful":0,"cool":1},"A4bdjAAVtfBXwnjwu8g1WQ":{"text":"If you are a history person or looking to get away from the putrid smell of vomit from all","useful":1,"cool":1},"bvn9qP8pOqFSpiq9R1efYQ":{"text":"Words can't express how amazing and expansive this museum is. Gorgeous architecture. Amazi","useful":1,"cool":0},"uoanuKzfuZcL2oNbrHKFMw":{"text":"The best museum I've ever been to!\nIs not your regular boring museum, this is the museum t","useful":0,"cool":0},"0bUIPf9zLj9rwnTJKL-quQ":{"text":"Well worth the time!! An excellent museum that really thoroughly covers this time period i","useful":0,"cool":0},"FOSlW2D0w_Az83sJHT6a7Q":{"text":"I take students to Washington, DC every year. The National WWII museum surpasses all of th","useful":0,"cool":0},"fhL_SV_WI_rLnSvj5hIQJQ":{"text":"Felt the $22 admission was an expensive waste of money, although I dislike museums in gene","useful":0,"cool":0},"LmJj25L8TgiHYpn414obAQ":{"text":"This place doesn't need my 5 star rating because no matter what I rate it, it's a 5-star m","useful":0,"cool":0},"BI0J98iY7Wa2klfoqpPooQ":{"text":"If you love WW II, you'll love this place. It places a stronger emphasis on the European t","useful":0,"cool":0},"hwuzOKl2QgqESGetKCG55g":{"text":"Great experience!  They do a nice job of walking through the sequence of events. Even if y","useful":0,"cool":0},"RcpWUIE6l3q9YocPk3Qxeg":{"text":"A very honorable tribute to the greatest men and women that fought for our freedom in WWII","useful":1,"cool":0},"AqkGn3nkD9QnmcumxftcNg":{"text":"For those of you, like myself, who were wondering why the National Museum is in New Orlean","useful":0,"cool":0},"xsodNYiYXtZn25N8ivM4Dg":{"text":"Wow, what a great museum! I remember learning about WWII in high school...but that was aro","useful":3,"cool":2},"FPPyKc4wEeObSbmLto9MJA":{"text":"When the National D Day Museum opened in 2000, I was there at the opening ceremony. Tourin","useful":7,"cool":4},"mfGtBICjUaZlNMoiSgLVBg":{"text":"If you are visiting New Orleans or live here, I HIGHLY RECOMMEND EVERYONE TO SEE THIS FIRS","useful":0,"cool":0},"gk_AvLZgoGP0ANwKj3dYsA":{"text":"Fabulous museum, with so many exhibits and buildings that hubby and I spent 7 hours there!","useful":1,"cool":1},"NfDb3D-zoWjSjrsL64OGoA":{"text":"This is a wonderful museum, that is growing. Going to the museum and not seeing the movie ","useful":2,"cool":1},"6o5jO_NPLJ7Z1-qh79KgPg":{"text":"My babe and I spent two full days here (12 hrs).  As a patriotic American I cannot get eno","useful":28,"cool":27},"T0DoXDWFdeMrB8HKNOafVA":{"text":"One of the best museums in the country. The movie is a must if you visit this museum. Very","useful":0,"cool":0},"YlV_9f8DEJeNO9a-WaSohQ":{"text":"I really enjoyed the 4D movie and learned some new interesting things about WWII.  It's re","useful":0,"cool":0},"fs_R3T52rb9dSd3yjEiy4w":{"text":"We didn't spend nearly enough time here because of poor planning, but this place is incred","useful":0,"cool":0},"vkAcr0HAJWjsgG6pzbtrKQ":{"text":"Very moving. Took WWII from macro to micro for me. \n\nWorth the 3 hours it takes.","useful":0,"cool":0},"nW3sGwQJK2xSquZgT_0csA":{"text":"Top museum for war buffs and amateur historians alike.  Great restaurant, great staff and ","useful":0,"cool":0},"Z9sSdXzrOXMCxLk81hYTYA":{"text":"Don't leave NOLA until you get here! Come early because you can spend all day in here. AMA","useful":0,"cool":0},"8lZx5GSpjhhSn1sBrKTIGA":{"text":"My kiddo is a trombone player, and enjoys a wide range of music. To celebrate his finishin","useful":3,"cool":2},"WbhaAt9O-8aZbMujnl1e0w":{"text":"My 18 year old son chose this museum as his must do thing to do after touring Tulane. He w","useful":0,"cool":0},"7vIBSjKKZLCWViHObNWBjg":{"text":"Amazing! Don't make the mistake of visiting New Orleans and not taking a full day to visit","useful":0,"cool":0},"_YQnvN1dXWe4U8NNF6k6xQ":{"text":"The greatest experience that a museum has ever given me.\nWe thought 3 hours would be enoug","useful":0,"cool":0},"1qThORT-oVmHMmOkF1vbOw":{"text":"This is a must see if you're visiting New Orleans! The exhibits were awesome. Bring a came","useful":0,"cool":0},"E-MYr8mIiDJeUtn7TCY8vQ":{"text":"If you are history buff this is a must see! This is a wonderful interactive museum. Its al","useful":0,"cool":0},"F2qazNtMbAm2tmnP8Mk6uw":{"text":"Really well done museum! I enjoyed the Dog Tag experience and the 48 minute long 4-D museu","useful":2,"cool":0},"yJQjdSwfv_THyg0ujqf5rg":{"text":"Originally, we had no plans on visiting the WW2 Museum, but I am SO glad that a random guy","useful":0,"cool":0},"sSsfA4ZFtYu3nei2mzKi_w":{"text":"A fascinating trip through history in an unlikely place.  I would expect a D-Day museum in","useful":5,"cool":3},"ySFO95JDyhxaW9jwKHErqA":{"text":"Really interesting.  It wan't a planned visit, but I don't regret stumbling into it.  \n\nI ","useful":0,"cool":0},"D71NPJlh9_kQMN0lFDXChw":{"text":"Well done!!!! What a nice way to learn about our history. Felt like I stepped back in time","useful":0,"cool":0},"m9bx97ePtFqcYcq9xrtr6Q":{"text":"Incredible museum to visit while in NOLA. They have great exhibits and movies. We saw the ","useful":0,"cool":0},"E3XwaeEImuT9lV1H_Qiwjw":{"text":"an exhaustive look at commemorating the world conflict (European / Pacific theaters) from ","useful":2,"cool":1},"W76i0Tzu99k-sG6OCQoy6g":{"text":"I really enjoyed the museum. Many of the other reviews made it seem as though you need the","useful":0,"cool":0},"fErygHBVek7xM7yA2NqWJg":{"text":"Great museum! i just visited couple days ago and they had this train which was great   was","useful":0,"cool":0},"7OSf4zXBeGC2LIWxq2uQXQ":{"text":"This is a must see! Give yourself plenty of time to be able to really soak up all of the i","useful":0,"cool":0},"Sv24shubO-yXgAmea2ty8A":{"text":"Plan to spend the whole day here; there is so much to see and so many interactive exhibits","useful":1,"cool":0},"V2rv9MMSWpBQRhAJMVd6Lw":{"text":"Wow! So glad we visited!! Plan for a day, take your time, drink in the experience. A histo","useful":0,"cool":0},"2hFZmQmfesismy6C7H6bHQ":{"text":"Went here with my 83 year old father, who was born in England and lived through the war. H","useful":1,"cool":0},"o5NGpz7tzJcTSKwVLmnVDA":{"text":"Came here again this past weekend. What an incredible museum! It's ranked #4 in museums in","useful":13,"cool":9},"ZMCorMg5DgjeqXZ6ayJuAw":{"text":"This is a great museum.  Well thought out exhibits and organized presentation.  We were th","useful":0,"cool":0},"U8STW6zCMEXa1wuAc5mrnw":{"text":"I'm a sucker for history museums and made a conscious effort to visit here while in NOLA. ","useful":3,"cool":1},"GiR7LPnJyfvyvRbQYwb4tQ":{"text":"Does exactly what it says - tells the american side of the story, why we joined, and how w","useful":0,"cool":0},"Pp4rflvJIWqSmbGsBwfYTw":{"text":"Surprisingly good museum in the heart of New Orleans.  While I'm a fan of military history","useful":4,"cool":3},"h4AQCyOrdoF1obsKWPDU_A":{"text":"The best part are the personal stories of the heroes that wore or used the items that were","useful":0,"cool":0},"bCKd1XbBru0raqu-7KxAwg":{"text":"This was such a great visit and I highhhhly recommend  stopping by even with the ticket pr","useful":1,"cool":1},"aN_5xqBEXrwViUuN40kalg":{"text":"Excellent.   I allowed 2 hours, and they recommend 4.   Try to go first thing in the morni","useful":0,"cool":0},"tvOw0QrulGayP-b5yFTl2Q":{"text":"This is an amazing museum, and one of the best World War II museums I've ever been to. The","useful":0,"cool":0},"4bCkgc1KHBU9WUaPi4SQcQ":{"text":"It was definitely a great experience. I arrived 2-3 hours before closing and so I did not ","useful":0,"cool":0},"jsJdt6kiBXpFLRGQR7gBtw":{"text":"I learned a lot about the history of the world war 2 and would highly recommend this museu","useful":0,"cool":0},"rqE6SYtV-VScs6oMhM7JQQ":{"text":"We spent 6 hours here. We did eat lunch (a little pricey and mediocre service ) and saw/di","useful":1,"cool":1},"6QO1znAPH84tpDW_0cPVKw":{"text":"Moving. Powerful. Gut-wrenching. There isn't much else one can say. Definitely go. You'll ","useful":0,"cool":0},"NaLqLqH7NTuQ_430nWjJkw":{"text":"This museum is AMAZING. We didn't have enough time to see the whole thing because we took ","useful":0,"cool":0},"ftFPgT_Xx1XWTZArhFArcQ":{"text":"1st the good. really great place to see. if you're in NOLA you should definitely go.  it's","useful":0,"cool":0},"HA-mDSRuaRsGhRI8zlZpMw":{"text":"Was visiting New Orleans from California.  On a rainy Thursday afternoon, we decided to vi","useful":1,"cool":0},"IZQCgW9vBB-L-Pi5ZrFHAA":{"text":"Phenomenal museum, one of the best we've ever been to! It's a sobering place, but so fasci","useful":0,"cool":0},"9rJfKOffwsTUhHt0pvIwtQ":{"text":"Amazing museum...and its not even done yet.  I am not that into military history so I was ","useful":1,"cool":1},"_eKNuzFF3SkgOt2UEWPGHA":{"text":"Easily one of the best museums I've visited in the world. Like many other Yelpers, I wasn'","useful":0,"cool":0},"DO_4c5h5SNTU13q2SBWb0w":{"text":"WOW!!! I love this place! You really could spend two days here as there is so much to read","useful":0,"cool":0},"3jjplBcIVUjej01s2stgGg":{"text":"Excellent Museum. A must see when in New Orleans.One of the best museums we have visited.T","useful":0,"cool":0},"sjE6DoHNfPZEmjg9gZbDUA":{"text":"Largest collection of World War II history I have ever seen.  All the exhibits are very in","useful":0,"cool":0},"b0PzI7WRql4vEYSZ586ZMQ":{"text":"Came here on a random whim during my first visit to New Orleans and I am so glad I did. Th","useful":0,"cool":0},"MFT-WtH3NaiipxLq3Iu0fw":{"text":"Awesome! Must see in New Orleans! Well laid out and presented to enhance the experience.","useful":0,"cool":0},"GYv_VGqCrI4GNvP25NIc4Q":{"text":"This place is great. Have always been extremely interested in WWII and this is the place t","useful":0,"cool":0},"Sz8q0s-GOeLDAq8cYTT0vw":{"text":"Very new museum with great story-telling capabilities of what happened during WWII from di","useful":0,"cool":0},"vtynPTqhgQWimp-dY4W4Gw":{"text":"You MUST see the documentary in their theatre. It is worth the ticket and then some. The s","useful":2,"cool":1},"s8Urc58NBRDkszazTa9ixA":{"text":"Great museum!  We really enjoyed it and wished we had more time. Wasn't able to see the fi","useful":0,"cool":0},"_bCvc8ze0VUlWunALPHgIA":{"text":"Wow great job whoever designed this museum and thought up the concept of the 360 display. ","useful":0,"cool":0},"TtvpSNiKhk2d_Wb4dEqj9w":{"text":"The museum was great. The train was pointless, but the Tom Hanks movie was terrific and re","useful":0,"cool":0},"o-Y6sSR6-GjFxxM_d0NCew":{"text":"If you go to New Orleans, you MUST visit this museum.  The exhibits are really well done, ","useful":1,"cool":0},"koBkg5Wt2KV9KzPX0QUcJA":{"text":"My fiance enjoys historical stuff much, much more than myself, but we both enjoyed our fir","useful":6,"cool":5},"ZQb1kKyDjW4Bho6A4zfVVQ":{"text":"This place is amazing!  We paid extra for the sub and movie experience and it was well wor","useful":0,"cool":0},"n2oFqQdyn_-ZI5OUYMtwuA":{"text":"Awesome! Great 35 minute film that explains the history of WWII starting with the great de","useful":0,"cool":0},"VjiUbvCzI66V-TxcqAs7dQ":{"text":"A must see and do when in NOLA.  We didn't do the add on for the movies, but evidently the","useful":0,"cool":0},"4-bY82jJ20zLsMDQ2hzf2A":{"text":"What an absolutely fantastic museum. The entire museum was incredibly well done, and had m","useful":0,"cool":0},"C-ixgo1qKfOsedHG5Em-jQ":{"text":"Ok. This place is amazing. The displays are educational and the whole thing is a wonderful","useful":1,"cool":0},"r4C5DP6IdYSIKw-3EF09hA":{"text":"We visited this museum on our last day in New Orleans and we were so happy that we did. Th","useful":0,"cool":0},"gLdUJY_d1FFwAQWoqdZmuA":{"text":"Such a cool place, and a must see for anyone that likes history.\nWhen I was down in NO thi","useful":0,"cool":0},"gZCcAjlP8TRSOC8H197zQg":{"text":"Our Family visited New Orleans for a long weekend in February.  We had a great time overal","useful":0,"cool":0},"8fw9r414g1fBxpVnqLL6Gg":{"text":"What an amazing experience of what a museum can be! We only had time to see the first hall","useful":0,"cool":0},"Z1FuT1PzV6i30LbfKMGbYw":{"text":"I went to the museum based solely on the Yelp reviews I read and I guess I expected more. ","useful":1,"cool":0},"Bqh4NQlhFADglLKJbYiGQw":{"text":"The Tom Hank's movie \"Beyond all Boundaries\", is a MUST see.  And I never rate anything...","useful":0,"cool":0},"tOMML6z-zLyMeQf_iV-5Uw":{"text":"My husband and I went to this since it was so highly recommended by other people and frien","useful":1,"cool":0},"eWowxK7tM1VCeF_-MVwTqw":{"text":"One of the best museums I've been to. I truly believe every president and any one in the a","useful":0,"cool":0},"K3cs6KUnCj-bOscrxZyuhw":{"text":"First off, this place is HUGE! You could spend the whole day there, although we had other ","useful":1,"cool":0},"sZgye8cndF0nYq4Sl-lZBg":{"text":"Incredibly informative, educational, and sobering, the WWII museum was a fantastic refuge ","useful":1,"cool":1},"_7qtpJbIacLyQ8-biLSsNw":{"text":"Note that I am not at all a history buff nor am I a fan of war.  \n\nThis was my mom's choic","useful":1,"cool":1},"rw7OXaTMYcd-fLMkTuF-Cg":{"text":"Very educational. The 4d show was good but skip the submarine show. Don't go on busy day, ","useful":1,"cool":1},"gluEfjGMzM9QGKkZbs_eqQ":{"text":"This museum is top of the line when it comes to wanting to know more info about WWII. It w","useful":0,"cool":0},"sEp-YpSRaWYZ8Ui65aNjCg":{"text":"I recently attended a special event here and it was awesome. I had an chance to experience","useful":4,"cool":2},"sn0-sKnRLLzUcTWXtiKRHg":{"text":"This place is amazing!  We paid extra for the sub and movie experience and it was well wor","useful":0,"cool":0},"s-Tw8nTPlIClbvdugwcvvQ":{"text":"\"Beyond All Boundaries\", a 45 minute movie, is definitely worth the $5. It was better than","useful":3,"cool":2},"yVG1kvGzWoJjJ1j9lryuDw":{"text":"Breathtakingly done. We were blown away. The movie is well worth the extra $5 and was visu","useful":1,"cool":1},"4t-SlPzWL0-59vVclaS2Rw":{"text":"I understand why this museum ranks one of the top museums in the U.S. now. Excellently cur","useful":1,"cool":0},"_kz1VjN9RjzVW9ZloytcgQ":{"text":"I truly wish there was 6 stars I could give to this museum. This was undoubtedly the most ","useful":0,"cool":0},"OuGJ-IKYx4-N5yt0d1ptQA":{"text":"This is a must go to when in New Orleans.\n\nAnything I say would not be giving this museum ","useful":2,"cool":1},"PV6c5BXbojjpYxniq6r3Nw":{"text":"Fantastic museum. Can't wait to go back. Food at The American Sector was really good. Truf","useful":0,"cool":0},"Wz63Sm4nMoVd3MjW0SYhaQ":{"text":"Great museum and Beyond All Boundaries was amazing. The USS Tang sub attraction was highly","useful":0,"cool":0},"tfAeL-fqHOJmwGMInziHkw":{"text":"If I could give this place six stars, I would without question. I recall going last Friday","useful":1,"cool":0},"jWnMy6WT62yfIyErLM_pJw":{"text":"Easy enough to take the St. Charles street car line and get off just before the Robert E. ","useful":0,"cool":0},"bSnCzHbhSFqj4fFSjbL0sA":{"text":"Phenomenal! Make sure not to miss the 4D movie. Touching, amazing production level, and ve","useful":0,"cool":0},"3PVjis2WVwZO3hqi5br-Xw":{"text":"I dont get the hype of this museum.. Its not bad but its not amazing either.. I guess once","useful":0,"cool":0},"HB0RspBwGMeJPehsQOtheQ":{"text":"- Road to Berlin is one o fthe best museum exhbits/set ups I've ever been to\n- Leave yours","useful":0,"cool":0},"mSFR2uNyLBz9QZbGC1DW0Q":{"text":"Best part of my visit to New Orleans. I spent 3+ hours roaming the museum and ran out of t","useful":0,"cool":0},"sUOfvd1cLRP3Ti2uPPqUaw":{"text":"Absolutely amazing!! A definite must see in New Orleans. As someone who works in the museu","useful":1,"cool":0},"KpV0HwQ0cGlVofpX-5IyiQ":{"text":"The National WWII Museum is a national treasure.  Since my last visit, a year or two after","useful":4,"cool":1},"mwKCnGBV8q8f0aAK76y4-Q":{"text":"This was an amazing experience. The artifacts, informative videos and interactive displays","useful":0,"cool":0},"FT239wIuY7oGCLZsU0u_pw":{"text":"THIS PLACE ABSOLUTELY DESERVES 5 STARS. If you don't give it 5 stars, what the #$@! are yo","useful":6,"cool":1},"Jgi-ISqCtqhuKr8fD8W73Q":{"text":"Stunning in all facets. All Americans should experience this museum. Besides being the sin","useful":1,"cool":0},"9BkOrMKF7Sgv4Kc_yeKjIQ":{"text":"This museum brought my mom (grandpa is a WW2 hero and corsair pilot) to tears. The 4D movi","useful":0,"cool":0},"CHGRByOASDhN3ql8XDwzYQ":{"text":"This place was so awesome! So much cool stuff to see. You could easily spend 3 hours in th","useful":0,"cool":0},"tZgLKvvDmmhf_QJ4c4Y3fQ":{"text":"I had passed over this museum during my first visit to NOLA in the interest of time, but I","useful":1,"cool":0},"8MSwyWxVGbrqqc2QVhV6rg":{"text":"This museum is extremely well done. A great mix of photography with captions for reading, ","useful":0,"cool":0},"kjLnMTBcAO837ODEYiYqbQ":{"text":"Ok I'm gonna be a critic. \n\nAs an avid amateur historian on WW2, I was excited to find tim","useful":0,"cool":0},"Xyf8UHMM62AR-NuR-PIC4Q":{"text":"Has a lot of exhibits of real WWII trucks planes and guns and other stuff. And it had some","useful":0,"cool":0},"vu_5dZm7J_XAMIY330kcrg":{"text":"To say the least, I am not a big history buff. In fact, I rather avoid historical readings","useful":3,"cool":0},"mUs51tjykdG93riXaSMcJQ":{"text":"One of the best museum's I've ever been to! The exhibits are so awesome to see. I recommen","useful":0,"cool":0},"3WKs159WHyEZEx_f48GwVQ":{"text":"One of the best war museums in the country. If you're in NOLA, take a couple of hours to g","useful":1,"cool":0},"tjzBMryK8pyzrDw2ibXnng":{"text":"I expected more. This museum does a great job of walking you through the war, but I would ","useful":0,"cool":0},"4H5dzU1okGiLZJeNqc8jVw":{"text":"Everyone should go to this museum if they have the chance.  it was exceptional and educati","useful":0,"cool":0},"b-6QHUrI6ekjryYz2ZodYA":{"text":"Any history geek should go and plan to attend the day. Take grandkids or kids. I was amaze","useful":0,"cool":0},"UD-Bgly68DF9bDZvLsoI5Q":{"text":"WOW. This museum is incredible. We almost skipped it on our trip in New Orleans but we wer","useful":3,"cool":0},"ihYRIfCGliflyEe1ZprdSQ":{"text":"Erm, well. I don't know where to begin on this one. I feel highly uncomfortable with ratin","useful":1,"cool":0},"AcO887YZBGsoi5I2gZIXiw":{"text":"Just awesome and a must see for New Orleans especially the \"Beyond All Boundaries\" in 4D. ","useful":0,"cool":0},"3g5krcwaiCizv0V766fq6Q":{"text":"Huge visual encyclopedia of history.\nWe went here during the holidays on a cold rainy day ","useful":0,"cool":0},"g8U2K1O6CzqkFr2E7JPg8Q":{"text":"This museum is pretty fantastic. There are a ton of reviews already so I don't have that m","useful":0,"cool":0},"el5Le3ACcFHpuxccIWwDNA":{"text":"My girlfriend and I visited on a Monday. Despite not visiting on a weekend, it was PACKED!","useful":0,"cool":0},"6yfad5QV2U2J3AH0bLwRxQ":{"text":"If you can only pick one attraction to visit in New Orleans, I'd go see this one.  It's hu","useful":1,"cool":0},"H8e-aarhD8rawHgoraVTuA":{"text":"We allowed ourselves 4 hours and couldn't get through it all.  I'd plan for an entire day ","useful":0,"cool":1},"D3Qm5WgdFXfB3_nwBEJz9Q":{"text":"Great was to spend a hot day in NOLA. Well thought out exhibits that are set up very theat","useful":0,"cool":0},"JNH0nWVGcnfyEqaDHDLTxg":{"text":"Awesome experience, although transparency requires me to confess I am an avid WWII amateur","useful":1,"cool":0},"XRaQCxsktCyx8lfi5KYsKA":{"text":"I'm not too much of a WWII history buff, but I've been to his museum a few times and I'd h","useful":1,"cool":2},"DCr2OlJWHvVGIygqGYzg9A":{"text":"Wow. This museum was awesome! We went to see the 4D Beyond all Boundaries movie narrated b","useful":1,"cool":0},"IyGHZ1AiMIPY94i3PnFGOQ":{"text":"First, thank you to all who served in WW II, Second I am sorry this is how we honored your","useful":0,"cool":0},"2DuqXTKnno7S12CC3ybi2Q":{"text":"This was one of the highlights of my trip to NOLA, and it is still not completed.  This is","useful":0,"cool":1},"973YbTSo_D6UqAI3njuAFQ":{"text":"This is a must if going to NOLA. Wish I would have planned 2 days here.\nI understand why i","useful":2,"cool":0},"aKU17HtmucOD2tGbMJ7zOQ":{"text":"A must see.\n\nOne visit did what 4 years of public high school history couldn't.  \n\nVery hi","useful":1,"cool":0},"wwNe_hLc1fhU5yXviS3D5g":{"text":"We had a hard time navigating. It didn't seem very organized. We enjoyed the stories of WW","useful":0,"cool":0},"us8NUev9mjnop38A4XpiTw":{"text":"This is a must visit for every American. \n\nI know. You come to New Orleans to get your dri","useful":4,"cool":4},"XvfCns2jqA2LvPi8cpTL6g":{"text":"This is one of the better museums to go to in the state, It is very interactive and entert","useful":0,"cool":0},"_BgQYA24PJEOS-MHHsR1Xg":{"text":"I really hate to be negative here, but this place is a cash cow. We waited in line for a t","useful":1,"cool":0},"YHtR-r9UtTlY99lApLrpCQ":{"text":"If you haven't been here yet,  you need to.  No matter what you feel about war.  This plac","useful":1,"cool":0},"P1nYoI6by6nv2rFXytP0Ag":{"text":"Must visit!  Great exhibits and very informative.  My 11 and 14 year old highly enjoyed th","useful":0,"cool":0},"0DqDrZo-8-x-tor3gE9sTg":{"text":"Great museum and Beyond All Boundaries was amazing. The USS Tang sub attraction was highly","useful":0,"cool":0},"G4lsvb3GLwLnzN6b2QWobg":{"text":"Probably my favorite museum that I have ever visited. The parking garage is huge and liter","useful":0,"cool":0},"u9h-CEGq5WDUj6mK7SBhew":{"text":"Typical museum displays on the main entrance side of the museum. \n\nWhat is unique is the B","useful":0,"cool":0},"gcXPjDjsKvbcj8CtUqfulA":{"text":"Fascinating trip to learn all about War World 2, the place was busy on Good Friday but it ","useful":0,"cool":0},"-Lb5Jb2JFXYZ_4E10yknuw":{"text":"Your experience will depend upon your expectations.  I had hoped to learn more about a par","useful":0,"cool":0},"gXT9G7lD9o4SdY59lP31cA":{"text":"This museum is awesome, they have introductory, 3D movies, personal stories and special ef","useful":0,"cool":0},"iBYKkoquaYe3e6ohymi_VA":{"text":"Excellent material and very engaging.   It is a huge museum.  I took an 11 year old and 8 ","useful":1,"cool":0},"T4XLFmS3Vj1b83hf6Xcefg":{"text":"I went with a handful of relatives while we were in town for a wedding. I really liked it.","useful":3,"cool":1},"y6tlx82AlfRU8wHe5xkZ0w":{"text":"This is probably the best museum I've ever been to along with the American Museum of Natur","useful":7,"cool":5},"j6jncK-TYbhQxbBCXtnzVQ":{"text":"Don't understand the hype around this place. Pricier than most other museums we've been to","useful":4,"cool":0},"S5OofqgdLSkmgWPhccocig":{"text":"Outstanding experience. Make sure you leave yourself a couple days to really see everythin","useful":1,"cool":0},"SOMooVDuHsi3mFM3y-zKIA":{"text":"Unbelievable, and it keeps getting better.  Was there five years ago, and they added more ","useful":0,"cool":0},"k80cXCftaSpMCv7dBXkS5g":{"text":"As of this writing, the WWII museum is in expansion mode and massive construction is under","useful":3,"cool":3},"ugxjUkF6ps-5gAw3YjunyA":{"text":"Beat museum in NO.  Takes all day or 2 if you have time.  Two separate wings each focus on","useful":0,"cool":0},"3Ibt_cp4dfX6U0YulrOptQ":{"text":"Take the kids!\n\nI was amazed by our experience at the museum.  Well worth the time and mon","useful":0,"cool":0},"OIxF3Fv1iFPHyQY3qywjYw":{"text":"Excellent WWII museum! Plan to spend a minimum of 3 hours. Four hours would give you enoug","useful":0,"cool":0},"ceLYXLFsQbMPO-DPH0oJsA":{"text":"Great museum experience, all the way down to the restaurant. Lots of information, photos, ","useful":0,"cool":0},"UIq2CHdrEWIWMWJTwmppjA":{"text":"Giant museum!!!! I was greeted by WWII vets who had stories to share. The admission is on ","useful":0,"cool":0},"JnGGIgzttIfFwZu4apg5rg":{"text":"This is a great museum. You gotta go if you are at all interested in WWII history. There i","useful":0,"cool":0},"-i3-c7wD09t--V4zdyMe1Q":{"text":"Wonderful museum. Every building is well thought out and extremely thorough. If you love h","useful":0,"cool":0},"8-CIHTBnsqKWasgjPeb_Gw":{"text":"Impressive and you could spend days here.  My wife and I learned much about the war that w","useful":0,"cool":0},"k2pHwMLiAjr60EpMNxWLXA":{"text":"Fresh and interactive for all ages! Excellent and informative exhibits. My favorite is the","useful":0,"cool":0},"4s6Bg6KAdf3H3hDgGpwCZg":{"text":"Reasonably priced. I got through the Road to Berlin (European Theater Galleries) section i","useful":0,"cool":0},"8vRIsAkulRCcXITyXjhEUw":{"text":"This is a fantastic museum.  You will need at least half a day to get through it all. It i","useful":0,"cool":0},"3SgsghyWZaQqZY3uT4CWNw":{"text":"Wow what an amazing experience. They really did a wonderful job on this museum. I unfortun","useful":2,"cool":1},"lgWN5MP-WC0MYNk1UBMmdQ":{"text":"Plan to spend an entire day here if you want to fully enjoy it and see everything. They of","useful":1,"cool":0},"del52NbHDPvi1SpRAyjJrw":{"text":"Spent an entire day (from open to close) at this museum--even ate lunch at their Soda Pop ","useful":0,"cool":0},"OFnlbntaAAJVzy5lc7DBHQ":{"text":"OK, I'm going to lay it out there- GO TO THIS MUSEUM!! I don't care if you're really not i","useful":2,"cool":1},"X6XMxzrGyCbtH1Dry-8-BQ":{"text":"Best history museum ever been to. The 4D movie was phenomenal! Worth the $5 but worth so m","useful":0,"cool":0},"GZGLsq7AwbdM2LLTD0FiMA":{"text":"Outstanding historical museum. It contains a plethora of artifacts and exhibitions about W","useful":0,"cool":0},"Znta22h1BNZSZwlq8AqU5A":{"text":"i could have easily spent the entire day or trip here. the exhibits are detailed and enter","useful":1,"cool":0},"8P8-kfzPut30LwhTfd_N3A":{"text":"This experience was one that I will never forget. Truly immersing you in the Second World ","useful":0,"cool":0},"ukuxY3M2SG6PNSzGulCuWQ":{"text":"Really cool museum; very well done. It was packed even though we went in the middle of the","useful":0,"cool":0},"vKhLceXU9aRm1PW_6DedPA":{"text":"This museum was large and interesting to walk through. There was a ton to learn from and a","useful":0,"cool":0},"NtFnqW28c2qPxD5BOtO05w":{"text":"Gee, I was disappointed.  I could be accused of having a vested interest because my father","useful":0,"cool":0},"Ld0f5AHU5EWGW5023ZPTuA":{"text":"Awesome place to visit. I live in New Orleans and I went there one week ago that was my se","useful":0,"cool":0},"lZcSmHHUna4C6UInI0B3bQ":{"text":"I spent the whole day at this museum when I was in town for a conference for my wife and s","useful":0,"cool":0},"GcJ1yNGi3hAyHSguu2cd0g":{"text":"This was the best WWII museum I've ever been to - and I've been to a few really good ones ","useful":0,"cool":0},"ZXqDOAC5-OMUVtEGLMUChg":{"text":"Amazingly detailed areas which looked like the parts of the campaigns they were meant to p","useful":0,"cool":0},"zHfVIV5R2zxT1m9-LQc7UA":{"text":"The WW2 is a must for anyone visiting NOLA. It's a hidden gem. \n\nWe had no idea this was t","useful":1,"cool":0},"dBkMqWP6sCsCs2dSFnBTAw":{"text":"Before I came here, I wasn't sure if I would learn anything here since \n\n1) I'm a history ","useful":3,"cool":1},"pBujbCGwGw8o6T3dIZKa9A":{"text":"if you are a history buff you need go to this museum.  There were 3 floors of exhibits plu","useful":0,"cool":0},"zQT6pMpdt9nJAFha_EZXCg":{"text":"The film is amazing. Truly amazing.\n\nThis film needs to be seen.\n\nThe museum is also breat","useful":1,"cool":0},"-L9E6FV_-EXDY9EZQoL4Tw":{"text":"This was one of our favorite stops of our trips to New Orleans. And I'll be honest when go","useful":1,"cool":0},"rgaqHlERpvmB2g9vV0Id_w":{"text":"The museum is my favorite spot to visit in New Orleans, and I consider it a must see!\n\nThe","useful":0,"cool":0},"0mNKpkTCGDmX-mO7iOSv-g":{"text":"Amazing museum. Very linear, in a great way. Head straight to the \"Road to Tokyo\" or \"Road","useful":0,"cool":0},"RzeHPP7DFzWZBGRlh52ltQ":{"text":"This is a great museum! We took our two tweens and they are not great museum goers. But th","useful":0,"cool":0},"m3MaGEqdtYDXcEbzBQyXrg":{"text":"Wow.   What a quality museum. Great place to learn about WWII and the events and battle st","useful":0,"cool":0},"lxgkfiocRx4GFziHPPie7w":{"text":"Amazing museum packed with exhibits and interactive activities/shows. We definitely should","useful":0,"cool":0},"RNLW8lBZ7t0dRUlvueLtHw":{"text":"For all the times I stopped listening in history class this museum filled the missing gaps","useful":0,"cool":0},"LViiRy3srcBc2Y03LxhxLA":{"text":"Very cool museum, but they really need a person limit in the place. My wife and I went tod","useful":0,"cool":0},"O1qnBeEJaIkMCVW_X-n6LA":{"text":"This is a great museum and much larger than expected. Definitely do the \"beyond all  borde","useful":0,"cool":1},"bVaDtsLQ7OF7XP4io0ig7Q":{"text":"I wasnt expecting too much when I heard about a national war museum but I was shocked at h","useful":0,"cool":0},"lnQpqmwqg3i7oEniztld7A":{"text":"If you are a history buff or just want to see what WWII was all about, this is the place. ","useful":0,"cool":0},"KEXRhp9H8r6O4qVRYrFyZQ":{"text":"The details, the information, the movie and the volunteers. A great experience from beginn","useful":0,"cool":0},"8BccvI8mHnIxclvTIcMTDw":{"text":"World War II is my favorite war. I realize that might sound strange but hear me out. I hav","useful":0,"cool":0},"Cue-gSBTjnSgOwtEIS9f2A":{"text":"Review by B:\n\nI'm a huge WWII buff (completely obsessed with WWII propaganda) and was so e","useful":14,"cool":10},"5ckj0ZxH0l3I4sAov937Fw":{"text":"This was one of our favorite stops.  We both have an appreciation for history, so we enjoy","useful":0,"cool":0},"df0j-X8_cU_7ejL9RuQFlw":{"text":"Amazing facility good to see history in a way that I can understand it better so hopefully","useful":0,"cool":0},"yxzeFesoswTYkgk_Iy7G1Q":{"text":"This museum is amazing. We spent 4 hours on a Friday afternoon and barely scratched the su","useful":2,"cool":0},"bAWvbwrTTSqH9gmGzgteDg":{"text":"My husband & I recently spent a 3-day weekend in NOLA, and made the mistake of only allowi","useful":0,"cool":0},"K_DQf43uMue86JUcZ-MJ3w":{"text":"Wonderfully made displays, they truly looked like pieces of art. There were multiple volun","useful":0,"cool":0},"AobSmXb2rz6rdBFDnxkWDg":{"text":"Avis mitigé sur le lieu. \nPour : ce musée est vraiment bien fait et on sent qu'il y a un g","useful":3,"cool":1},"aw4QTZfM8EYluwBe7xalBA":{"text":"the museum was very informative in regards to all sides...German, japan and the USA.  The ","useful":1,"cool":0},"tBn29drOfwwDbVaWCYKexA":{"text":"Awesome museum - thoroughly enjoyed my visit here.\n\nHow it could be better:\n1) Have a sear","useful":0,"cool":0},"qLIIwcQ16Zp4lIl_MNLApw":{"text":"Hands down best museum I've ever been to. There's a plethora of WWII artifacts which is al","useful":1,"cool":1},"Xss1H9I9aGRjHfrQDoR8XA":{"text":"This is a very interesting museum if you're interested in the American warfare aspect of W","useful":0,"cool":0},"N2o6e_-pfxeswWDfWVAW3Q":{"text":"We really enjoyed the museum and both learned more about the war. The movie was great and ","useful":0,"cool":0},"SVw1e2n6MtqfYdwqtT98ig":{"text":"This is rated as one of the best museums in the world for good reason. \n\nThe museum covers","useful":0,"cool":0},"acrS6ud_vJx8-ExY5pE63g":{"text":"I am not a history buff at all, but I found this museum incredibly emotional and fascinati","useful":0,"cool":0},"3Gh-2Ntw7yt35bcLt2aSrQ":{"text":"Good information and content- I really did enjoy the exhibits- but very poorly laid out.  ","useful":0,"cool":0},"5cQWIpYtWVfbGn68FCa-Aw":{"text":"One thing I enjoy about this place is that the museum presents itself with a story. Upon e","useful":4,"cool":0},"qg3swg7Lrm1ZsL30tZqEfA":{"text":"I highly recommend to anyone visiting New Orleans.  Plan on at least a half of day if you ","useful":0,"cool":0},"Z3tkMlakZtUvM2GeAZ-M_g":{"text":"My wife and I were on vacation in New Orleans and saw that this museum was a \"Must See\"\n\nI","useful":1,"cool":1},"s9kwxZjJ9nsiVugtsKSM0A":{"text":"Amazing place to visit -- don't miss it if you come to New Orleans.. the aircraft gallerie","useful":0,"cool":1},"SEt83TNPoKMwoigE6oDnqA":{"text":"I've more appreciation of the freedom we are enjoying today. This was a real eye opener. T","useful":0,"cool":0},"I5TMQGHDcKmwte8vK60NBQ":{"text":"I'm a WWII junkie, I loved this place, they have a lot of exhibitions, trucks, machine gun","useful":0,"cool":0},"wY2U6d0pB-DPw6FUGKj3qw":{"text":"We love traveling and seeing places you can go and learn and enjoy all at once. You need a","useful":0,"cool":0},"q2ONW75je_37ODBcByBJJg":{"text":"Arguably the best museum I have ever visited, I just wish I would have came with more time","useful":1,"cool":0},"kfGmBZZPD2mQ1Yx59W3VJg":{"text":"Very informative and well-organized exhibit. Great collection of memorabilia, artifacts, p","useful":2,"cool":1},"BoVzeV2pfpUwHvTnj4XNQw":{"text":"I enjoyed the reverance of this tourist attraction, as a museum it falls short. There shou","useful":0,"cool":0},"q-IEbpyCe87AxBAMfdXOTQ":{"text":"Cool experience. Definitely recommend paying the extra 5 bucks to watch beyond all boundar","useful":1,"cool":2},"UmvFjYVLkVfzjM6Dvkw6HQ":{"text":"Great place to spend the day. the place is huge and filled with hardware, uniforms and mem","useful":0,"cool":0},"yRpHGnK6s4brjf0rdz5FoQ":{"text":"I'm in the military and I have to say this museum is well done. It makes me proud to see a","useful":0,"cool":0},"V3rZVsU7R8P5iNM-aF9Z0w":{"text":"The World War 2 Museum (also referred to as the D-Day Museum) is an exceptional treasure t","useful":1,"cool":0},"FBygSeT5Hefn2VzHie9unw":{"text":"I can't imagine a more complete experience short of standing on the actual grounds. I also","useful":1,"cool":1},"OkgdLrXeuP1K4cPnvYZQvw":{"text":"This is a must see--and don't miss the movie, it is amazing!  Learning history lessons thi","useful":0,"cool":0},"kQJV6FSekV2UWRu4Xh737A":{"text":"My rating is based on an after hours, catered party held here.\nBy far one of the best attr","useful":0,"cool":0},"Fu4og0AaCx_KTGj-BYpBmQ":{"text":"I love museums. While visiting New Orleans in 1 week, I visited 9 museums. This one was, b","useful":0,"cool":0},"acXUMYWhG9IOsEFGmwW35A":{"text":"This place was nice. We brought the little one. We met a few WWII vets and the volunteers ","useful":0,"cool":0},"P88jm3tS57zA6wHX-gzk_w":{"text":"Amazing Experience! If you are going to be visiting NOLA this should definitely be on the ","useful":0,"cool":1},"UhFZNUJ8X6b4dYXM0qPkDQ":{"text":"I'm giving this 5 stars because the content is amazing. The fact that I was unable to see ","useful":0,"cool":0},"e4zTLxKkd2V0F2k0uexFqQ":{"text":"Simply fabulous museum.  It has grown from just the original building and being the D-Day ","useful":0,"cool":0},"xPf3xnQ2dIYOXfMCGDHygw":{"text":"Très beau musé.\nRien n'est traduit dans aucune langue.\nvaux le détour","useful":0,"cool":0},"hFp4FxqftRAwnRYcDuWwuA":{"text":"It's worth going to see the beyond all boundaries movie. It's on a huge screen with pop up","useful":1,"cool":0},"ce1_pnM4lcAbciHzRNLa8Q":{"text":"Rated as New Orlean's number one attraction on TripAdvisor, I was excited to pay this reno","useful":10,"cool":7},"cSlMiqKeTZazwcpdsnzo6A":{"text":"I've been to many museums, this definitely is in the top 3. \nEach person in my family was ","useful":0,"cool":0},"qduS-_O1Vgb6JR0I9x26kQ":{"text":"Plenty of exhibits, and very thorough walkthrough about the War.  The 4D experience is wor","useful":0,"cool":0},"HDisUTwgDlGzjiFSnTi7FQ":{"text":"We visited with a 5th grade field trip. This museum is packed with interesting artifacts. ","useful":0,"cool":0},"XDY3P8vK8BOfV-SUeqt_IQ":{"text":"I am blown away by this museum. It is a must-see if you are in the area! It is extremely w","useful":4,"cool":0},"haDMmX_S1l7HyFBh3bK-dg":{"text":"I would consider myself a history buff and love WWII history in particular, so I was excit","useful":1,"cool":0},"0AZkOX84HzS9kCvMThBy4Q":{"text":"This museum is a MUST if you're visiting NOLA and love America. My wife and I absolutely l","useful":0,"cool":0},"BrZkD8i6wmC9PpFDXjT72g":{"text":"This was a heart wrenching museum to walk through.  My boyfriend and I were both emotional","useful":0,"cool":0},"gH4baUS06k-k2X0yn3bXTQ":{"text":"This museum will absolutely astonish you. It is enormous and you could easily spend an ent","useful":0,"cool":0},"MfdbCpAQuG274FDjw3zOXA":{"text":"Loved this entire museum! The 4D movie \"Beyond All Boundaries\" is a must see!! I didn't li","useful":0,"cool":0},"B7lkQ0N6qGsI0cbDpSEBLg":{"text":"Beautifully done.   Make sure you plan to spend the day.  I didn't get it done in a 4 hour","useful":4,"cool":2},"ATkAWWZwby8LOjz-WjvKXQ":{"text":"I am a big history fan and I had heard about this museum for a few years.  I had some time","useful":2,"cool":1},"aiV-AnyuVmqW2D3_GekI5g":{"text":"I had no idea how incredible this museum was. Wow! It was an amazing experience for me on ","useful":0,"cool":0},"xqouyt5tPp8ulOb-9txRWg":{"text":"We started with the \"Beyond All Boundaries\" film. It's 4D, between that and the collection","useful":2,"cool":1},"o62lAg9vf48Z3Vg0V0P-uA":{"text":"I took my husband here for his birthday. He loved it. It it an excellent experience. The b","useful":0,"cool":0},"J_6ld3TSTH6mk4S1-7DkVg":{"text":"very well done. well thought out. their service was amazing. BUT since it is only national","useful":0,"cool":0},"4qp210I0Ga11EjA35pdKlQ":{"text":"Love this museum! It is large and informative and changes pretty often, so you can return ","useful":0,"cool":0},"nQlEXG_c-Ue2pgEzS1J6kQ":{"text":"This is the BEST museum I have ever been to. They have a wealth of information and it is s","useful":0,"cool":0},"h0BgULIDggyqrZf2scipFQ":{"text":"Must go in Nola! It'll probably take you at least 3-4 hours there if not more, and I'm not","useful":5,"cool":2},"jKcJ5y7lGl5TVGJTjOiYRw":{"text":"As a WW2 buff and the son of a WW2 vet I always wanted to see this museum, but the cost is","useful":0,"cool":0},"deg11qQdl6-z7YB4g9Grcw":{"text":"A phenomenal experience. We were able to see the whole museum in one day, but just barely.","useful":1,"cool":0},"eNd55_EposJ6445DMYWqQQ":{"text":"HUGE museum with tons to see. Be sure to carve out a few hours of your day to go here. So ","useful":0,"cool":0},"JshSwW7Jztvz5Q9whfQQSg":{"text":"I'm not a WWII buff or a particular lover of this part of American History, but I found th","useful":1,"cool":0},"BhP5KhBq8B--SOJ4j1gvEQ":{"text":"Go Go Go!  But if you do buy tickets online and pickup at will call.  If you forget-- do i","useful":0,"cool":0},"jfftc1HK9qjs6ZXK9NV-8Q":{"text":"This was a must visit for me. All the people working here were very friendly and helpful. ","useful":0,"cool":0},"Fhd4mqN1Yv5SY6SqGjgJIA":{"text":"Breathtaking. A venue perfect for any event, any visit, any age, any time. Such a great re","useful":0,"cool":0},"mscMKsjlV8zBTX-arr7Qbg":{"text":"I'm in a minority with my opinion of this museum but we just didn't find it to be very imp","useful":3,"cool":0},"jfuGrcYng62BXuxziFukCw":{"text":"To me, the perfect WWII Museum experience would include seeing the documentary in the \"4D\"","useful":2,"cool":2},"OcoyOeqFWDhYKPzBNLhSMQ":{"text":"I can't say enough good things about the National WWII Museum in New Orleans. We spent alm","useful":0,"cool":0},"_4qxCBDPphhmOii80oRLUw":{"text":"Museum: 3.5 stars\nBeyond All Boundaries: 5 stars!\n\nI thought the museum was overhyped. The","useful":1,"cool":1},"Y9Hl9XBGS6V5NBU9stepeQ":{"text":"The National World War II Museum is one of the best museums I have ever been to.  It reall","useful":3,"cool":1},"aE8za3W2HfyJKkuasUemOA":{"text":"Great place to visit and learn about world war 2.  Take the family and the kids spend the ","useful":0,"cool":0},"OqNQI-gL5I2fnK7NzpqLHQ":{"text":"i'm a huge history nerd and have been to tons of museums in dc, chicago, new york, etc. so","useful":0,"cool":0},"FJ180SEwjnk0WdHqBy1pOw":{"text":"The museum is a blast, nice to go back in time to see things from that era and to see all ","useful":0,"cool":0},"XtPxmOHAk43RIAnmPhkQXA":{"text":"We enjoyed the museum.  Their coverage of Normandy invasion and the Battle in Pacific were","useful":0,"cool":0},"aJJ9gnfs63NkpLKR0YezZA":{"text":"OMG!!!! FANTASTIC!!!!!  I plan to visit NOLA again and bring friends just to have more tim","useful":0,"cool":0},"t_l2ZIUuig81lTM_9KOMSg":{"text":"The price of freedom can be viewed here!\n\nWe were in New Orleans for a convention at the e","useful":0,"cool":0},"SCzgnd_W5Ymkps9FzJcSHg":{"text":"My visit was a few years prior to my Yelping days, but this museum had me feeling all sort","useful":3,"cool":2},"EMyK7Q0UNRJ8UXgE35zDLA":{"text":"Very informative and wonderfully explained. My 7 yr-old enjoyed immensely.\nThe dog tag fea","useful":0,"cool":0},"NMTRrEGUhECrDsi28NDrxg":{"text":"Words can not adequately describe the experience. This museum is absolutely fantastic. Onl","useful":0,"cool":0},"nh2RLUoyhfWIvhly61XCiw":{"text":"If you are interested in history or want to learn about WWII, this is the place to go. The","useful":0,"cool":0},"Xy7hA20ozFI8th-IcVKSmQ":{"text":"This museum is one of the best, if not the best, WWII Museum in the US. Don't expect to he","useful":0,"cool":0},"apYqCsYFRonx4DR9BfN7Kw":{"text":"Should you find yourself in New Orleans, you should go here.  Period.  You can drink all y","useful":1,"cool":1},"yFEzdOdvtUlwq3t4BVOHFA":{"text":"My husband and I spent a few hours in the WWII Museum while we were in NOLA and we really ","useful":0,"cool":1},"SX7vdl7ZbTStu47I3DtYBg":{"text":"I came to New Orleans eagerly awaiting the National World War II Museum. While the exhibit","useful":0,"cool":0},"eftBixVIxDkaiPMgnoMOSw":{"text":"What a cool place to visit! It takes you back in time to see how it all began. The train c","useful":0,"cool":1},"TOImAaCEI7q60MnO7DD9ng":{"text":"This place is a must go for anyone who even remotely enjoys museums or learning about hist","useful":0,"cool":0},"G3QytuHlg8yR74q45UPx9A":{"text":"This place is Amazing!! The museum is huge (it has several different buildings) and you ca","useful":0,"cool":0},"kN3s7KZQXT-9CeExG-xr-g":{"text":"This is easily the best historical museum I've ever been to. I wasn't really looking forwa","useful":0,"cool":0},"t1zFxYAMK9eDZUDLZj0Qbw":{"text":"I have been twice- awesome. The docents and staff are very helpful and knowledgeable, and ","useful":1,"cool":0},"hB8xhRs3JkaSadNKhtKsMA":{"text":"I think this is one of the best museums I have been to in a while and one of the biggest. ","useful":0,"cool":0},"QeWFuwWt2Akpamxqv_iUAg":{"text":"The smithsonian grade exhibit is the most comprehensive WWII memorial I have been to. You ","useful":0,"cool":0},"FneblmyeeF31AA6kXU-iHQ":{"text":"Wayyyy to crowded, not much to look at , a lot of reading mostly. The buildings are huge b","useful":0,"cool":0},"9Mn2XGJ0krpZa3FHOwfheg":{"text":"Admission is around $25 a person, but there are discounts available for members, college s","useful":2,"cool":1},"qqWgGLQPhYcfn_FNDsh4Iw":{"text":"Im not really a museum lover, so maybe this should be 4 stars.\n\nThis museum is very large ","useful":1,"cool":0},"1MCaqp77f1auB4bm4zRmQw":{"text":"This by far is one of the most well done museums in the country. If you begin with the fil","useful":0,"cool":0},"umRybnsDoVn35mO7UM-9RA":{"text":"Absolutely one of the best museums we have ever been to. Highly recommend visiting.   Very","useful":0,"cool":0},"SrQYmdSGxOkgBKCvnWBsFQ":{"text":"The movie with tom hanks was amazing. It was well made and the experience was not to be mi","useful":0,"cool":0},"0MO83Vxv-inX9168DvJLKg":{"text":"I am not a history buff, but enjoyed this museum. My favorite is the Imperial War Museum i","useful":0,"cool":0},"dIsg8fKr_m9Sjddj-mRXdQ":{"text":"This is a unique museum because it is specific WWII.  There is so much to see and do AND i","useful":0,"cool":0},"zfUVOgY0pZ0PNSyX2OhcRQ":{"text":"So I'll add to the love fest.  What I love about the National WWII Museum (formerly the D-","useful":3,"cool":2},"DIXWjuh-qTmVTANv_7_7-w":{"text":"My fiance is really into history, so I put on my game face and went with him to the WWII m","useful":2,"cool":2},"J7qmPfHzXebA_xpZ0Hz19Q":{"text":"Extremely moving experience. You must take time out of your binge drinking to visit here. ","useful":1,"cool":0},"THndpuxZgX0KdXhXYHP7eg":{"text":"One of my favorite stops in NOLA! We got the 4D experience plus the museum - definitely wo","useful":0,"cool":1},"A3sHA3MqQqloewN2q1QUBQ":{"text":"You get a definite sense of grandeur and epic sweep when you enter the huge entrance hall.","useful":0,"cool":0},"wFwLT3dfpLARhOeAby5_3A":{"text":"So much to take in. Plan for a full day here. I wandered from exhibit to exhibit. I sat so","useful":0,"cool":0},"KnHZF8IMgIxwWxP6CoaPPg":{"text":"Definitely worth seeing! I came to this Museum when visiting New Orleans and I was very im","useful":0,"cool":0},"u5XxRBdBGnX6ZeuQcISa0A":{"text":"Love it!  Highly recommend this place.  My son thinks this place is better than the museum","useful":0,"cool":0},"sa_3sagoOkHrhkQ9gW_Sww":{"text":"Learn & Remember!  Should be a required high school class trip.  It starts with a \"4D\" pre","useful":0,"cool":0},"9OSzvrRIQFeWxGQHTMJFfw":{"text":"There was a REALLY long line to buy tickets, so we purchased the tickets online (via iphon","useful":8,"cool":6},"_DPvMc1ajlAL3ZDN_s8LaQ":{"text":"This was one of the best historical museums I have been to.  It is comprehensive and inter","useful":0,"cool":0},"dWffyJcrgKMqMOKeJvx09Q":{"text":"I'm definitely not a museum/history buff but everyone kept telling us we had to visit the ","useful":0,"cool":0},"jzaICpDHDFjc9M3i-VH-bw":{"text":"This was a very well designed museum. The tour was self-guided but engaging due to the way","useful":0,"cool":0},"c4se14-_Vd-5VVCqKKXBNw":{"text":"On a recent trip to New Orleans, we began forming an itinerary of must-do's. This was one ","useful":3,"cool":1},"rrpRiYxVOG5AEybj2q_Otg":{"text":"Get there early or go during a weekday because you can easily spend the whole day there an","useful":0,"cool":0},"gBx72-Bb8bzqJgJzceCM9A":{"text":"Just returned from my second full day visit to the National Wold War II Museum in NOLA.\n\nT","useful":0,"cool":0},"9wssPHJOVjq_lMxzta857Q":{"text":"If you like military history, you are in for a treat at the WW2 Museum. This place is huge","useful":0,"cool":0},"-J5Mwy4qNtU-gwt555Y90Q":{"text":"Great museum! Helpful hint: if there is a long line, buy your tickets online and go to wil","useful":0,"cool":0},"meQErYkZ60kMFUJPC1DBCw":{"text":"This museum is a must see on a trip to New Orleans with any history buff or anyone vaguely","useful":0,"cool":0},"i5eg9Dc6goAIhV9-LCP92g":{"text":"Wow. I came here when it first opened. They have done some amazing work to the museum. It ","useful":0,"cool":0},"QvNfhIFy8wDGD2SbSPXwvg":{"text":"WOW! Been to many historic museums but this one really blew me away. The details and plann","useful":0,"cool":0},"mKVqQN3gwbxsLV44rORL2Q":{"text":"I was interested in visiting this museum after seeing advertisements at the MSY airport fo","useful":0,"cool":0},"1ueULxM8kUL9uxTrI-hUzA":{"text":"I have been to a few museums in my time and I will say this was one of the best. Expertly ","useful":0,"cool":0},"KSkev8ps31pR-Po4srXCpw":{"text":"This is a very interesting museum, it's like a scavenger hunt throughout the place and you","useful":0,"cool":0},"5KBL3upgmO0nkELqtzAf1w":{"text":"This museum is amazing! It could easily take someone 3-5 hours to get through. Unfortunate","useful":0,"cool":0},"6RKFsOxs17lFgSjiHD7R_A":{"text":"Man am I pleased I found this museum, especially because I was looking for something meani","useful":4,"cool":4},"CwphHQ7JCIJKR67wVw86dQ":{"text":"The best thing in New Orleans other than the food!  Plan for 3 hours in the museum and the","useful":2,"cool":1},"ZpdPsD55iElPDt_HZ0MZcQ":{"text":"I love museums and being that I was going to be in New Orleans with a free afternoon, I bo","useful":1,"cool":1},"NGT2jwBjGykLwDUZBvRUHg":{"text":"This is a great museum that you can spend a couple hours to a day.  War is not pretty and ","useful":1,"cool":1},"we4DJnSPCLdnBC0QtUmLiw":{"text":"A must see if for no other reason than the movie.  You GOTTA see the movie.  It is not lon","useful":0,"cool":0},"wnuXDsgWS6FQpLa0Tp_U6A":{"text":"The movie was wonderful.  It gets really crowded really quickly and if you have children t","useful":1,"cool":0},"A9ihePIqMgtahYk_817gcg":{"text":"Great museum and glad we went. The interactive dog tag experience was a great feature. The","useful":0,"cool":0},"jPPpAhgjXMLN12XvieLTfg":{"text":"My husband is a member of the Museum and we were both very much looking forward to going t","useful":0,"cool":0},"2ooKp57quYkIRIhBai0h0Q":{"text":"I feel bad for rating this two stars, but this is not a child friendly interactive museum.","useful":0,"cool":0},"7m-OM4sNE2_q7fI9qAobqw":{"text":"This museum was amazing and had an incredible amount of exhibits to see, you can definitel","useful":0,"cool":0},"JotlD7iuVWgpcH0-udmxGA":{"text":"One of the top places to visit in the city - a must-do for any trip to New Orleans!  This ","useful":1,"cool":2},"3Hao0efZVSXXoyKu_UKm8g":{"text":"Wow. I can't say much that wasn't previously stated- but if you are in NOLA and don't go h","useful":0,"cool":0},"hAX_ZiKTh2J2LD50lUbwaA":{"text":"One of the best and most modern museums I have ever been to.  \n\nNew Orleans seems like an ","useful":0,"cool":0},"u1PRWRmLg2e2iANRxBi6kg":{"text":"How could you not give this beautiful museum 5 stars? The Boeing museum had to be my favor","useful":1,"cool":0},"UemhK0I3ojGBQ1huMGLzEw":{"text":"A wonderful collection of all things WWII. I was lucky enough to visit on the anniversary ","useful":0,"cool":0},"Q1p1VH1FKxbE9s_pVcraeQ":{"text":"I was really looking forward to this visit before I landed in NO, and it did not disappoin","useful":0,"cool":1},"iKUeirxsltbojFoT_AFDdg":{"text":"I am a self admitted history dork, seeing as it was one of my undergraduate majors.  So th","useful":1,"cool":1},"5MVJp2OP2G6bMdWjheE1Aw":{"text":"This is a must see when in NOLA! It's amazing. Prepare to spend a solid 5 hours there, or ","useful":0,"cool":0},"-jaLdt9w90G4uH2vOk7JAA":{"text":"I came here with one of the friends I am on travel with. We had nothing scheduled in the a","useful":0,"cool":0},"ERv_tgQnkyfyBUobwyK0yA":{"text":"This is one of my husband's must go to while in New Orleans on vacation and I must say it ","useful":0,"cool":0},"2gA9dOL_4lTZgG-EBzzVlw":{"text":"The museum was interesting and very informative. I was amazed. The museum had a lot of ama","useful":1,"cool":0},"-uyrhIzmvENHUw0iI8dzoA":{"text":"Educational, informative, and thorough.  Don't roll your eyes, but this is exactly what yo","useful":3,"cool":2},"Earv3N5fGbwBUaibXkRDdA":{"text":"Si te gusta el tema, reservate un par de horas (al menos 3,en realidad) para descubrir est","useful":0,"cool":0},"hN2roc35G7CxlBVbOeXiWg":{"text":"Are you kidding me???\n\nThis place is unreal. The rawness of the films/pictures is mindblow","useful":0,"cool":0},"iwMBMfwrVw1JgE9RAoT-qg":{"text":"Absolutely incredible!  A fantastic museum giving one an informative overview of what lead","useful":3,"cool":1},"rBN8XwUvR1NYQiZ_i8v5BQ":{"text":"This museum hands down was the best museum I have ever had the privilege to attend. As a p","useful":0,"cool":1},"2tMnVt8nEXHIquJX8i2L7g":{"text":"I have never learned so much about the 442nd battalion! This was such a wonderful experien","useful":0,"cool":0},"5Gge1vSWnAwWOQRCIFSS8A":{"text":"Been to New Orleans a number of times but never took the time to see this. Major Mistake.\n","useful":1,"cool":0},"dnSixlobE-fkW5uZ-xbQAA":{"text":"!!  The BEST  !!.. the 4D movie is worth the money. The Japanese internment camps exhibit ","useful":0,"cool":0},"DdaS_Gj_sk4sRZTTJRTGaw":{"text":"First of all, Congratulations to every single person who made this museum a reality. And, ","useful":0,"cool":0},"EXYC8Dm77Lmvzd19WJ7enA":{"text":"We spent 6 hours here just walking through everything. If you actually stopped at each exh","useful":0,"cool":0},"bdCiZ5Df_rUmOg8k_br5sg":{"text":"For my 300th review I really pondered what I was going to write about.  This one is specia","useful":8,"cool":8},"NO1D47vysMgqd22meZ6CRA":{"text":"A mixed experience at best. The artifacts are well displayed, the planes are spectacular, ","useful":2,"cool":0},"T6462CdTicjYMaEcbe1TaQ":{"text":"Very eye opening. Lots of great exhibits with letters from family and troops. Tom Hanks fi","useful":0,"cool":0},"Qm5c8DH_SrRDPzoDXgUuMg":{"text":"I wish I could give 6 stars for this amazing place.  The WWII Museum in New Orleans exceed","useful":0,"cool":0},"gJY8Z-xMm2ItQkFcgPNi0w":{"text":"I recommend seeing Beyond all Boundaries when you are here! Great movie! It reminds you of","useful":0,"cool":0},"mHklCaw5cJBosVt200_veQ":{"text":"If there could be a complaint it has nothing to do with the museum except to say how great","useful":0,"cool":0},"Yc2zC21RhuTEMsXyNgCh-w":{"text":"This wasn't on our original plan so we sort of stumbled on to it, but we're glad we did.  ","useful":1,"cool":0},"bA2eisp9R6PkjSsF0Lo_nA":{"text":"For some reason, Yelp lists this as \"Good for kids.\"  It is most definitely NOT.\n\nI saw a ","useful":5,"cool":2},"ZXWoml8IxM6bvoKM8iGDwQ":{"text":"I am by no means a military history aficionado. But this place captured my attention for h","useful":2,"cool":0},"raYAVy7PxzC1X0yGHCuWxg":{"text":"While visiting New Orleans we went to the museum. I must admit, I've never been big on mus","useful":0,"cool":0},"Wp_4LNefG99a53Dq2sQMEw":{"text":"There was a time when it seemed as if America stood as its own memorial to WWII.  Some of ","useful":0,"cool":1},"42Ii80TkRjbOCWQgxUPJKg":{"text":"Great experience here. I hated museums and used to be a walking dead when I went one. This","useful":0,"cool":0},"ynamNmzfzWAhKN6zhgd_pg":{"text":"My friends and I visited the National World War II Museum on a rainy Saturday with just ab","useful":0,"cool":0},"sxCeuuMS6vNJoy1SPM_Wnw":{"text":"I am NOT a museum person and neither is the rest of my family generally, but my dad is an ","useful":0,"cool":0},"lPatWVvD_mR429S-zVRvkQ":{"text":"This museum blew me away. What an incredible place- I was surprised to discover this was h","useful":0,"cool":1},"Os_qLCgdWqhW1JqRaQo1sg":{"text":"We planned to only spend part of the day but were there until they kicked us out to close.","useful":0,"cool":0},"1vVb66UfmpvhI-9tXK2FuA":{"text":"Great place if you love history.  Wish I had more time to see everything.  This is full da","useful":0,"cool":0},"clf3bHJCIAU-IKf7FQZLjg":{"text":"We came to NOLA for my birthday.  I picked NOLA for two reasons: GW Fins (yum!!!) and the ","useful":0,"cool":0},"urUL8TF-RBRQbghk42pWRA":{"text":"If I am able to, I try to squeeze in a museum visit when I am a tourist. The National WWII","useful":1,"cool":1},"lG3yR5DPBN3tV--lX5s1qQ":{"text":"We spent  4 hours at the museum - there was so much detail to see, we could have taken lon","useful":0,"cool":0},"-M6eEe-zPTTmJ1tnqtWFtg":{"text":"It's a wonderful museum documenting the history of World War II. Our visit started with wa","useful":0,"cool":0},"-EbzUBO0fh5U1MRr1jkx4A":{"text":"Very nice museum.  Just be prepare to walk. Is very big \nDo not waste time in the train ex","useful":0,"cool":0},"esnx09NNNcO2B7F1Gwt-Mw":{"text":"What a museum experience! This museum really immerses you in the WWII experience and leave","useful":1,"cool":2},"QVDhW52oD3qvYxdpDVo-Ug":{"text":"A must see museum if you are visiting New Orleans.  It does a good job telling the story a","useful":0,"cool":0},"zwO-LHghOWZG7ow57PJ_sg":{"text":"Go here. This place is amazing. They put thought and money into the museum. We spent only ","useful":2,"cool":1},"h811q3RHLQ1Yk_euTO1jQA":{"text":"AN ALMOST FABULOUS MUSEUM\n\nThe exhibits were incredible and showed recreations of the equi","useful":0,"cool":0},"Rw11ZfYYB1XFU3OP4gl17Q":{"text":"Probably the best museum regarding world war 2, extremely well curated, good at spacing. G","useful":0,"cool":0},"BU29R9oUXnEpADpfbFJxEg":{"text":"Amazing!!  This is a must see attraction in New Orleans.  I wish I went sooner.  We brough","useful":0,"cool":0},"FFt3GGFjL_3WUMPQ67iF0w":{"text":"I took a group of 25 older adults to the WWII Museum, and it garnered rave reviews from ev","useful":3,"cool":1},"4EPeaRAeU9QCpbjeX3Grcw":{"text":"We visited NOLA as tourists and first heard about this museum at the airport. Rather on a ","useful":0,"cool":0},"09eYUAJgO6jwhkCbFrqqOQ":{"text":"A world-class museum in a world-class city. We enjoyed our visit here all the way from NYC","useful":3,"cool":1},"mYRTQeQTe9CkvE1h3oe_Ng":{"text":"We were surprised and delighted at how much we enjoyed this museum - especially as we are ","useful":0,"cool":0},"-HYcMBbU1SOdbjHb7nFG4Q":{"text":"I would like to go one day without my children so I can really give this place the time it","useful":0,"cool":0},"OhbjaCVRzu98p7wx9rsiAw":{"text":"An overall very moving and educationalo experience.   It's more of an audio-visual tour of","useful":1,"cool":0},"2UaRsLcI2R-iyh9rp-fyzw":{"text":"We have visited New Orleans numerous times, and finally decided to visit this museum, and ","useful":1,"cool":1},"P2H87bk4xnucxMiFn302gA":{"text":"This museum is wonderfully immersive. You're not just looking at photos and reading captio","useful":0,"cool":0},"tRgZKAYDWUxoJ-tsGRskaw":{"text":"The entryway alone is breathtaking - the content worth every cent - and location within th","useful":0,"cool":0},"LHjCvwjhiMfdrNUox6x_BQ":{"text":"Excellent and well thought out museum...we only got to spend 3 hours in the exhibit portio","useful":1,"cool":1},"_eubkCuljB2lR8JbSV0Eog":{"text":"Outstanding museum with great movies and demonstrations! Very interactive and engaging wit","useful":0,"cool":0},"CUs1KiXcGZqr8UyJUHykDQ":{"text":"This museum is amazing.  I was only there a few hours but could have spent all day.  There","useful":1,"cool":0},"ByGdW_zCnj9Au_53rkLTbw":{"text":"Definitely a must see attraction when in NOLA. The depth of history and amount of artifact","useful":0,"cool":1},"dZuMTdcxqhqaXHcnJcJ7xg":{"text":"The D-Day museum is a must see for any war history nerd (to which I confess).  A variety o","useful":0,"cool":0},"k2jo-LhjNgsKRCgXlJI9EA":{"text":"One of the best museum visits ever. Spread across four buildings, the numerous exhibits, f","useful":1,"cool":2},"aeKBC7g0jQbjfMLteNji_A":{"text":"Fantastic experience. Wife and I both have ww2 vets in our family and this place did an un","useful":0,"cool":0},"FtVygVUNlFxwJ7CPv849uA":{"text":"Our visit to New Orleans this week included a visit to the WWII Museum and the visit alone","useful":0,"cool":0},"NmmuZ8FfavilEW_-uS6w7A":{"text":"Oh my!  This needs to be included in your plans when you come to New Orleans!  And make su","useful":0,"cool":0},"GuQyD6BNZ4HZix-Eu3LXEA":{"text":"This museum should be on everyone's \"must see list\" in NOLA, especially if you want to exp","useful":0,"cool":0},"Tm26P9BpyjouThQXhFeOsA":{"text":"Okay, I'm no fan of military museums, of military history, weapons, etc. But I like histor","useful":0,"cool":2},"Y8sP5Oo8Bz9gOeD-FNZcag":{"text":"What an amazing museum! There is a lot to see so it will definitely take a good chunk of y","useful":1,"cool":0},"8HFr3zj0ShOdsKIaFcI4DQ":{"text":"Perhaps the best secret of the city. Trip Advisor rates it as #1 of 383 things to do in Ne","useful":0,"cool":0},"5RIMCM5_qAEeGyAvb-RdOg":{"text":"My husband is the history buff and I have to go these museums all of the time. But the Bey","useful":2,"cool":0},"mWK7p09VbddhoC8eZURwFA":{"text":"Loved the Beyond Borders movie by Tom Hanks.  Gives a great history of the war, builds pat","useful":3,"cool":1},"QqIMoCpL6ssPq2rti513Vw":{"text":"Fantastic museum! We went on a rainy day and it was packed. But I hope it would still be p","useful":0,"cool":0},"8k-cbrWAJsVPWxb1zMvJ4Q":{"text":"I think everyone should go there at least once. Plan to spend at least one full day, with ","useful":0,"cool":0},"ARs3meLPLg_1mHvrUTOvKg":{"text":"It had amazing information and a good flow of the museum.  However, it was spread over 3 b","useful":0,"cool":0},"lBtHBZk-iWDg4lZdBNN--g":{"text":"Incredible experience, first class!  4-D movie was excellent. So disappointing that I (and","useful":0,"cool":0},"Bi7l7Re9buKMeNHNNQjs5g":{"text":"No matter how brief your trip to New Orleans, you *must* pay a visit to The National WWII ","useful":1,"cool":0},"1Z8HLZPRspDc61FvS1_Z2w":{"text":"Give yourself plenty of time to visit. There are MANY exhibits and short movies to see. We","useful":0,"cool":0},"9_7sFMm3g5z_beihulkeLA":{"text":"This place in incredible. The Tom Hanks movie is a MUST see. The workers were as friendly ","useful":0,"cool":0},"bbdVxDnlE_QPb3Gu-d0stw":{"text":"Complete and moving tribute to those members of the Greatest Generation who sacrificed so ","useful":0,"cool":0},"fyNhT5FOlJvLPwPnqtSC2w":{"text":"Others have written much better reviews of the museum itself so I want to tell you about t","useful":0,"cool":2},"28oX31Rqk3fv_gdK2rVidg":{"text":"What a great experience! My father and I came here during our three-day stay in New Orlean","useful":0,"cool":0},"V1Xmc61dKGeDJLaiOx09Yw":{"text":"When in New Orleans, one must visit this museum. It has so much history and a really cool ","useful":2,"cool":2},"cFniIrWVss3dInLAwSjJDg":{"text":"I was not expecting to enjoy this museum as much as I did. World War II museum in New Orle","useful":0,"cool":0},"8bgTJfnReyROLJx75xpiuw":{"text":"This museum is a must see in NoLA. It provides a fantastic narrative of the pacific and Eu","useful":0,"cool":0},"EighZP-a5ze4S4kEDRoNmA":{"text":"This was one of the real highlights of our trip to New Orleans this year. (Aside from bein","useful":0,"cool":0},"l1D_VmC0NFiWpCHaZdvgRQ":{"text":"5 stars IF you see the movie.  Aboslutely amazing experience.  Quite moving filmwork.  I s","useful":0,"cool":0},"hVDn3ZhXp0CKBuSVGK84-A":{"text":"Don't miss this on your trip to New Orleans. If you're moving quick you can probably get t","useful":0,"cool":0},"FdEWbHqBxo73AaInZHuK4Q":{"text":"Lots of interactive content. Good overview of the war, plus in-depth exhibits for a few su","useful":0,"cool":0},"VKqYl5LgB9wCs7rigT_YAg":{"text":"This is a wonderful museum filled with plenty to see and do.  Other reviews cover all that","useful":1,"cool":0},"KLr6kl8s4g8iyfaOMzrBgA":{"text":"Particularly if you are a history buff this museum is a must-see when you are in New Orlea","useful":24,"cool":22},"ysp-zuEGjfoiXeA_kkk_RA":{"text":"This Museum has grown to seven buildings. When you enter at the main entrance, there is a ","useful":0,"cool":0},"XdcPNzzZGSp-4x_4WU1aiQ":{"text":"Wonderful little surprise during my trip to New Orleans. I had no idea something like this","useful":0,"cool":0},"ijFxdMKa0zH5Yr-6UvyvbQ":{"text":"Was detailed, great videos, only thing was that i left wanting more. \nThere'd were a lot o","useful":0,"cool":0},"D22gelWotbPvnxk_HykV4w":{"text":"So much history packed into one place, or I should say several buildings. We only had 2 ho","useful":1,"cool":0},"Veebb_b4CwbtHmYKa3eLHg":{"text":"Very well done. Great exhibits and so much education. I can not express how good the \"Beyo","useful":0,"cool":0},"901ZiLS7f1enT_t4DdoXAg":{"text":"Very well laid out museum.  The beyond all boundaries narrated by Tom Hanks was well worth","useful":2,"cool":1},"OThh6cpQCUu1JA3eQBvegw":{"text":"Moved to tears.     To those writing poor reviews how about you just say \"thank you\" to th","useful":1,"cool":1},"iI1pzAj-kx3sLUXGt9dxHA":{"text":"The most incredible museum I have ever been to. The military history with artifacts were a","useful":0,"cool":0},"khcEwO9xJL00oOenMeN77g":{"text":"I've been to over hundreds of museums all around the world, and this museum was by far the","useful":4,"cool":3},"FceXcT_XWC-kyg74hb9oYw":{"text":"I love this place and what they have done. They are adding new things all the time whether","useful":0,"cool":0},"m2wzPFjiL7TgVpZS_KQAhA":{"text":"With rain being forecasted, I decided to hit both my indoor activities on the same day and","useful":1,"cool":0},"St-IIghp4TmYZ62Jp6tYeQ":{"text":"Having had a father and Mother in world war two, When we asked our cab diver ( a local) wh","useful":0,"cool":0},"lBEGDjHyOmoi4jHBBkLVHA":{"text":"This museum exceeded my expectations.\n\nI particularly enjoyed the Arsenal of Democracy sec","useful":0,"cool":0},"r8xpIqf2DDzwQbwIiMbi8A":{"text":"Incredible recreations of WWII scenery along with real footage of the war. The film by Tom","useful":0,"cool":0},"RPPAvj7wbMMazjfEwyWi2w":{"text":"Must must do in New Orleans. Huge venue that is clean and well cared for. Staff is very kn","useful":0,"cool":0},"vdu3EP4Io0LsJOA-Cjn6bw":{"text":"This is one of the best museum I've ever visited. We started with the 4D movie, which I hi","useful":0,"cool":0},"PEMlrqIw4jiuR0E8uOPdVw":{"text":"Loved this museum!! We did not have much time and we went straight to the Tokyo and Berlin","useful":0,"cool":0},"RM1MrFbz0B3Bf81dYhxY9A":{"text":"The museum itself was great.  Awesome exhibits, great audio and visuals, authentic, and tr","useful":0,"cool":0},"0VzYOZn60XougeuROBxsuQ":{"text":"My wife is a history buff so we went for a visit since this was part of our three day City","useful":0,"cool":0},"GAylHtBX3yLoTqOKyyAylw":{"text":"Visiting the WWII museum was the key part of my trip to New Orleans.\n\nI went with a friend","useful":2,"cool":0},"P6PBJbt6IjJ7eha8O2jZgQ":{"text":"Beautiful and educational. I really liked the experience we had here learning about the wa","useful":1,"cool":0},"ao_YpNDysuO6okcPxJsRkA":{"text":"Quite simply one of the best museums I have ever been to. It is very interactive and illum","useful":0,"cool":0},"qGCiRizUNxhoTo8h9RvtCg":{"text":"Reading other reviews I can see where this COULD have been a better experience than we had","useful":2,"cool":0},"Jc5FORowwp7fzy_ubK3SOw":{"text":"The name gives away what it is---a museum dedicated to the United States' efforts in WWII.","useful":3,"cool":1},"_NpTUUzCzyFx3da4N-rkVQ":{"text":"Wow! I was so impressed by the quality of this museum and I could instantly understand why","useful":0,"cool":0},"PwbbqgTR2GeFXcd7lRkxaw":{"text":"Give yourself 3 hours minimum (not including the movie). \n\nWe thought the museum was reall","useful":1,"cool":0},"fUlS5ErfL2j7Xad66u4xOQ":{"text":"On a rainy day this place was crowded to say the least! There was a lot of stuff that I wa","useful":0,"cool":0},"frOOyjF8kjMm8HfLJ_lM0w":{"text":"The husband is a Marine and we both come from military families (his grandfather was at No","useful":1,"cool":1},"2jOQViDCIRTXhMgWVob0Gw":{"text":"To be honest, I was discouraged by the first few exhibits I checked out.  The content was ","useful":0,"cool":0},"tuZ5ZU-U448jXuU0StKDGw":{"text":"I'm only giving 4 stars because I didn't get to visit all buildings. What I did get to see","useful":0,"cool":0},"yWNBaSHqO-vJU_OAyzSO7A":{"text":"Surely the most important global event of the 20th century, one could dedicate an entire c","useful":0,"cool":0},"is4smaD8N0y-7v-dfHUTJg":{"text":"Everyone said to allot two days but we attempted in one\nNowhere near enough time!!!\n\nAmazi","useful":0,"cool":0},"4on11oxz1JBgbKNfQCCnpA":{"text":"unreal lines & wait times to exhibits at end of december 2018.  disappointing artifacts e.","useful":0,"cool":0},"5JHq6nyopaT8pDRIELC8XQ":{"text":"Large museum! You buy your tickets and hop on a fake train to \"set the mood.\" You are assi","useful":1,"cool":0},"3xMJNrc1JqBZncnCIm_wgA":{"text":"As an avid museum-goer, this is one of the best museums out there. As a WWII history buff,","useful":1,"cool":0},"LbCSU61TjRH1p8nkEsyg6w":{"text":"This place is incredible.  And if you try to tackle it all in one day you will miss a lot ","useful":0,"cool":0},"qPVmkYYv4AZD-zR3B1MyiA":{"text":"What an AMAZING museum to visit!! It definitely took the entire day. My wife and I are not","useful":2,"cool":0},"Q32j-DIhrLYM69RNat4bsw":{"text":"I really didn't think I would enjoy this, but I was pleasantly surprised. I learned so muc","useful":1,"cool":0},"Yqo6q7KplJt0EZb_ZnMdTw":{"text":"My daughter is a WWII history buff and for spring break we decided to check out the WWII m","useful":2,"cool":1},"7P0umrbJPYQxC344CzXnUw":{"text":"If I could give this place 6 stars, I would. This museum is so well put together, i was th","useful":4,"cool":1},"WWnIxBHdFo-_qMPInNlNRQ":{"text":"The museum was amazing. I loved all the details, the replicas, the mini movies, the diagra","useful":0,"cool":1},"r897d6rT1wgW8wOsBXxfHw":{"text":"Please don't go to the teddy bear tea. They were very late getting us in the door and had ","useful":0,"cool":0},"x3tHL5fE2lqA84hTTOOKXw":{"text":"This museum is probably one of the best I've ever been to. My fiancé really loves history ","useful":3,"cool":1},"fkrVUwQ0i53K4lIPSZv0dg":{"text":"Must see if you are at New Orleans. One of the best WWII national museums. Have got a lot ","useful":4,"cool":1},"iDn286HBKyjxSXmFJt2uxQ":{"text":"Wow! Completely blow away! (Pun intended. Oh wait- too soon for a World War II joke?) \nAny","useful":7,"cool":4},"f6ihay5fTyVtMbleRt9VbQ":{"text":"A must see! It is interactive and keeps your attention on many levels. Go early because it","useful":0,"cool":0},"kEifN5wgp1ZK7_6qXIrqGQ":{"text":"While I was in New Orleans, I saw many signs for the National WWII Museum, and I had seen ","useful":4,"cool":2},"qPiZnes1mLfWYCm9mk0tWw":{"text":"Such an amazing amount of details hard to get through all of the details in one day. Very ","useful":0,"cool":0},"hm3yN96Yoku0nPwVYzxvoQ":{"text":"A good place to check out because there will be something interesting for everyone. I'm no","useful":1,"cool":1},"-17Ijx3l1BzxNMDTeeprlw":{"text":"This place is pretty cool. Lots to see in all of the buildings, plenty of restrooms (for t","useful":0,"cool":0},"HXE_7laNweR3VRj6OkOH3g":{"text":"Very interesting museum. Dedicated volunteers. Went on a rainy day so it was quite crowded","useful":0,"cool":0},"ntivZA6MwtKMDiLKlxhVMw":{"text":"If you are a history buff and/or have a deep fascination for anything military, you will l","useful":1,"cool":0},"1fPgNWfdEl7ghpwFIDWaAw":{"text":"The Second World War really affected everybody living after that event. For one thing, it ","useful":10,"cool":9},"yMKGAmujI23CN5zkw7Rxzw":{"text":"I cannot begin to say how much I enjoyed this museum.  Hands down the best government/nati","useful":0,"cool":0},"WTNIEjrO0YeVHg5LvFdQqA":{"text":"Admission: $27 Adult, $23.50 Seniors (65+), $17.50 Students and Military, and free for WWI","useful":8,"cool":3},"16ryh_ZoZIOkRqycxy-r-A":{"text":"Not fan of war museums but they did really good job with this one, had the submarine final","useful":1,"cool":1},"us65Vib7Kee5lDcMi_kMPA":{"text":"This is something you have to do, but you're not gonna love it.  It's a necessary thing to","useful":1,"cool":1},"JuQM4cAMeymjCghHBHI3Lw":{"text":"Better learning than your High School history class.  \nAn amazing museum to immerse yourse","useful":0,"cool":0},"mMvzpbnBjw0M5qy8hkmX6A":{"text":"Very cool place. Prepare to spend the day. You have to prepare to do a lot of reading.. bu","useful":0,"cool":0},"OG0dK-936vz62VwbQW9OFA":{"text":"5 stars because...America. You owe it to yourself to visit this museum. Take your family, ","useful":0,"cool":0},"4iwhB9XLoEQzQDG59hUNrA":{"text":"Muy pero muy bueno ! \nTe cuenta la historia a lo EEUU de los sucesos de la Segunda Guerra ","useful":0,"cool":0},"s61XdHM-14bl-XTZvm33eQ":{"text":"This place is amazing. Being a person who did not at all like history classes in high scho","useful":0,"cool":0},"RcdSGLNbj3KMm4UoIXNwVQ":{"text":"Amazing place to walk around and spend the day. You're able to get a discount if your are ","useful":0,"cool":0},"mgpLJ0CBmHuZgSWsx01Eyg":{"text":"Had I not been to the Imperial War Museum in London or the Museum of American History in D","useful":0,"cool":0},"vKh_W5rujd_UznwJQXB4MA":{"text":"This was a great museum. If you pan to go to the 4D movie leave at least 3 hours of time s","useful":0,"cool":0},"bJO6Vrg9bdI3bvQnO4lmlg":{"text":"I've never to a museum with so much detail that you feel as if you're in the experience it","useful":1,"cool":1},"TLVckhOYEmApMhDA5sTZfw":{"text":"Phenomenal exhibits! Could have spent days there. Well worth the price. Had lunch at the A","useful":0,"cool":0},"uQz3pLfvbe3QhrGoxcob1A":{"text":"As someone with an avid interest in WWII books, movies, museums, etc., it was inevitable t","useful":0,"cool":0},"PGzVmZtUSuSd2_9b5-V6DQ":{"text":"Who is my second time here and I really enjoyed the visit. They have even more content thi","useful":0,"cool":0},"9K6yjQ_IMJzgv2d-8aRIcQ":{"text":"I'd like to say I loved it but...seen one wwii museum, you've seen them all? However, this","useful":1,"cool":1},"uuwoE43Vk_nR4maIk3iL9w":{"text":"It was recommended that I visit this museum and I have to say This is THE best museum I ha","useful":0,"cool":0},"Lz-vf3PCIFOOV3VBt-Xmuw":{"text":"Amazing! If you are ever in NOLA this is a must do. It will make your trip experience much","useful":1,"cool":0},"ToLtxdN0YSqwjbAuBqNGtw":{"text":"Fact: more people from Louisiana fought in WWII than from any other state. \n\nThe WWII muse","useful":3,"cool":3},"-K-YpqfXEwHv6Kx9O5iIVQ":{"text":"Incredible display. The movie was excellent as were the exhibits. Wouldn't do the submarin","useful":0,"cool":0},"xryTpuMjpcFOa8eBkrQYeQ":{"text":"I was really surprised to find the National WWII museum in New Orleans, but I found out NO","useful":4,"cool":1},"e396OpVVgqOj85AX5r2q0Q":{"text":"There is no way to describe this experience. You come to realize how selfless people can b","useful":1,"cool":1},"zAl0FhmWuoMNyEs21MQ27g":{"text":"I would give the National World War II Museum 6 stars if I could. That's how fantastic and","useful":4,"cool":3},"ilsR-CXt6pwqHky09Q-mPA":{"text":"One of if not the best war museum I've been too. This is only rivaled by the Australian Wa","useful":0,"cool":0},"roTWC81fAe004qy-IJ5VPQ":{"text":"Different from any of the museums I've visited. It was an intellectually stimulating and i","useful":0,"cool":0},"IxUhgqlfT8ErgfKlcZJn5w":{"text":"Amazing exhibits. Don't miss the 4D Movie. However, their version of crowd control is LONG","useful":0,"cool":0},"5lu56l1wQADdGLUS1PoFkQ":{"text":"Incredible museum!!! Equal to any of the Smithsonians in DC or the science and industry mu","useful":0,"cool":0},"xXI_H3ZonGvYyhatGY3-pg":{"text":"Thank you to the men and women that fought for, and continue to keep us safe. \n\nI had an a","useful":58,"cool":47},"LUP5ucYpL6oupllzFyBWOQ":{"text":"An amazing experience. Take the time to chat with WW2 vets when you enter the museum, we w","useful":0,"cool":0},"dG2SvIWV_tdo-Yx_ZGexEQ":{"text":"This is definitely one of the best museums I've been to. If you're a student, be sure to l","useful":13,"cool":7},"Us2FQHkh45nVj1yW0ZjEYw":{"text":"The movie which was 5 years in the making, narrated by Tom Hanks (hottie)  was outstanding","useful":2,"cool":2},"4IcUKgOxJ1QowGk53GtvFQ":{"text":"This place is nothing short of amazing. I love how experiential it is and provides differe","useful":0,"cool":0},"zZwndLLutCO_WlqWqlsqHQ":{"text":"This was definitely a highlight of the trip to Nola. Got there right when it opened and wa","useful":0,"cool":0},"nNRitVNrZz-29c2u5EenQw":{"text":"Very good museum with world class displays. I would recommend you go as early as possible ","useful":1,"cool":0},"njFUPbCp-5u8HWhcdSRXUA":{"text":"Even while renovating and adding exhibits, this museum is excellent. If you're a history o","useful":0,"cool":0},"o3AKJX7p77xoat3LP1OJXw":{"text":"This museum is fantastic! It is very large so plan enough time to get through it all. It's","useful":0,"cool":0},"qDTdpbIwykdeN2iEQ2OI7w":{"text":"Spent a day here and could have stayed longer. The two movies are great but Beyond All Bou","useful":0,"cool":0},"EzlsamQwbQDBbsq3FZSpMQ":{"text":"I learned a lot about World War II. Things you will never learn in school. You can see per","useful":1,"cool":0},"IJzYuWQ_woxLmCtl17CJzQ":{"text":"This was our first visit to this museum.  The first thing to do is to go into the train ca","useful":1,"cool":1},"y11kWRBTkj09eiU-OyNXEA":{"text":"My husband loves history and was in absolute delight being able to visit this museum. I'm ","useful":4,"cool":2},"uihyCFnCYOfABoDQwF-pZQ":{"text":"You should plan on a full day as I didn't know what to expect. I'm not much of a history b","useful":0,"cool":0},"jRMVuGoaanOJsU1_9PM55A":{"text":"Absolutely one of the best museums I've ever visited.  You do not have to be a \"history bu","useful":1,"cool":0},"f4ohagUJeE6yMCXRTaiG6w":{"text":"I'm not usually a huge fan of museums. But when searching for things to do in NOLA aside f","useful":5,"cool":3},"pS9tDIHjYVDo1dOoqxCLvw":{"text":"Wow, wow, wow!!!!!! This is an absolutely incredible museum. Truly remarkable! It's massiv","useful":0,"cool":0},"4f_8smOxUsO_DCTK0VkxYQ":{"text":"I really found this museum educational and enjoyed how they took you on the journey of war","useful":0,"cool":0},"27D4xP9Ve9opTACvL257pw":{"text":"We visited the WWII Museum on Memorial Day simply because we happened to be there that par","useful":0,"cool":0},"1EcT4-O9xGCTM30gFcinoA":{"text":"Who would have ever thought that the WW2 museum would be in New Orleans of all places.\n\nTh","useful":2,"cool":1},"bZxaYM6CdEBh7tcqM9lxBw":{"text":"Went through the Tokyo tour and the road to Berlin. Both tours were very informative howev","useful":1,"cool":0},"1AicTl7kNyAepkU4OujVXw":{"text":"Amazing museum plain and simple.  The exhibits are both informative and meaningful, the vo","useful":0,"cool":0},"E-04LqORMa4KznpKXhqpyw":{"text":"What a great way to spend time in NOLA (when not in the French quarter).\n\nThe \"Beyond Boun","useful":0,"cool":0},"AL-1M05238bOatZcUPJdTQ":{"text":"The newer exhibits (Road to Berlin and Road to Toyko in the Campaigns of Courage pavilion)","useful":0,"cool":0},"kT5V6IXlmXE9xBHOrUnKCw":{"text":"My father was an Omaha Beach H +10 hour survivor. The trip was a follow up to our Normandy","useful":2,"cool":0},"jt-HVZo3VhslsgddfQJkLg":{"text":"It's about $19 a person, so a bit pricey so we only went when I received a complimentary t","useful":0,"cool":0},"IKCHBs7rZtvO8RaXWaDEIw":{"text":"This museum definitely needs at least 4 hours to get through. The Beyond boundaries 4d mov","useful":0,"cool":0},"0Bs94w6DADw_xtWeY3jQJg":{"text":"This was a great way to spend 4 hours of a rainy day. As a tourist in NOLA, this museum ca","useful":0,"cool":1},"0SOmG4-4iCYqOq_QOdNcvQ":{"text":"Wonderful museum and the exhibits were interactive and very informative! There's so much t","useful":0,"cool":0},"oOH7ufc_l36r_j9Ycf5kRw":{"text":"This museum is huge and really well done. I came on a Thursday afternoon and it was pretty","useful":0,"cool":0},"rQO8e2cWMzdnH53VRFll0w":{"text":"A must see in NO\nOur generation has forgotten the horrors of this war\nThis is a great muse","useful":0,"cool":0},"Ia4aPL9pYn4JNFk09KcmUQ":{"text":"What a great time, the newly opened exhibit with the planes hanging in it is a site to be ","useful":0,"cool":0},"Q6u-h-J3Aib-Ij8tP4bh3w":{"text":"This place was insane! There's just so much to do and see that you need wayyyyyy more than","useful":1,"cool":0},"yC_XmUTvG9ZwYQ15y-o34g":{"text":"I do not even know where to begin talking about how awesome this place is.  Wether your a ","useful":4,"cool":2},"Jr4EaPPce7f6ekWNAKXBjw":{"text":"Great museum. The movie is extra but one not to miss. It was amazing. There are so many ar","useful":0,"cool":0},"bFH5xmrCYULJtjbGoEX_yQ":{"text":"It was pretty cool to see my province (Bataan) in the city which now claims my heart! With","useful":4,"cool":1},"NRx9XG9fzqe3EqVO0MbiDA":{"text":"French Quarter is NOLA's most well-known destination, but the National WWII Museum should ","useful":2,"cool":2},"j5cnP6E2ta0Do6DOR7x1eQ":{"text":"Cool museum with a great mix of exhibits, artifacts and shops. Worth the price of admissio","useful":0,"cool":0},"dldUtRLMXmvkxOZev3cskA":{"text":"This is a well organized, clean, spacious and well laid-out museum. There is a $7 up charg","useful":0,"cool":0},"22YvWsIxf9n4M5bMeG9Biw":{"text":"Visiting the National WWII Museum is what I structured my weekend New Orleans visit around","useful":8,"cool":10},"_dUw2KhGJDKWmyBk1FJwYQ":{"text":"This is a well thought out and huge museum. Plenty to see and do and they have great docen","useful":0,"cool":0},"k7qNA1SE9qoFSXNmmLyu_Q":{"text":"The last  time we were in NOLA this was called the D-Day Museum.  We went through it compl","useful":16,"cool":11},"EhYspdAfbqHZ8EyPD1C1rQ":{"text":"I'm not much of a fan when it comes to museums in general. However, this is the exception.","useful":1,"cool":0},"NXXQeGDp7VqNM_KBb7hmBw":{"text":"The WWII museum is a must visit for any history buff visiting New Orleans. Having been to ","useful":0,"cool":0},"9SwpAG-RPnxdGVBu6BJAqg":{"text":"This was so beautifully done.  Having recently toured the 911 Memorial I was ready for the","useful":1,"cool":0},"HRgK5wixZCtJQ7TcVRdpLQ":{"text":"The museum is fantastic. It's amazing how many wonderful volunteers help make it go (thank","useful":1,"cool":0},"xHi7iZDaXB4bG4tSfzSKPQ":{"text":"This was an amazing experience! I loved the interactivity of the space. Very well done!!","useful":0,"cool":0},"xOa2mQzUfEpC8g3yZCI88A":{"text":"One day is not enough to take in all this history, I suggest you visit several times with ","useful":3,"cool":0},"M1MHrpqsYw-kDUSKMPWwWg":{"text":"Would give it five stars but lots of the museum is currently closed.  It is well curated a","useful":0,"cool":0},"ZQ0bUECOPwxKuFa3vaz8ww":{"text":"Great museum.\nGreat value\nVery informative.\n\nPay the extra for the Tom hanks narrated vide","useful":0,"cool":0},"28OmkUeqOiFGZy6uVkTHsQ":{"text":"Absolutely a great way to spend the day.  Beautiful place, so much to see and don't miss \"","useful":0,"cool":0},"4pI39BrkByWPdsyduvPDBA":{"text":"The National WWII Museum is well worth a visit. Striking and informative displays, interes","useful":0,"cool":0},"8KlR5e44seICe0IokBV7XA":{"text":"The museum was a let-down to me but that might be because of the high expectations after r","useful":0,"cool":0},"q_cD6cjqsYwZEDw6Z8s53Q":{"text":"I must admit I only went to The National WWII Museum because the weather forecast called f","useful":0,"cool":0},"t4o-tV3Ds3fC9HmM6aj5Vg":{"text":"You can spend hours at this museum. There are multiple buildings to explore and lots of in","useful":0,"cool":0},"5Ih89o5xjEpGkEFTuYqjyA":{"text":"I have been fortunate to travel the US and world and this is one of the best museums ever.","useful":0,"cool":0},"J2IUkzc6pQTyxHXOdvMnRw":{"text":"It's very interesting and very sad to think of what went on during the war. Very informati","useful":0,"cool":0},"UW6do_knLCh39jr-m-OCtw":{"text":"It may still be under construction in some areas but the amount of history in the knowledg","useful":0,"cool":0},"pI8uQErqw_FLolF4vA7qSg":{"text":"Absolutely fantastic experience! The employees/volunteers are extraordinarily helpful. The","useful":0,"cool":0},"ZR8ULsJCJscxx_To9SZdaA":{"text":"Absolutely amazing museum. The artifacts were so interesting and the videos were knowledge","useful":0,"cool":0},"g2XOXZ8fXvKjmhK4ToMQCQ":{"text":"You gotta take your appropriate age children here to view the amazingly detailed historica","useful":2,"cool":2},"2_kc5PCZOKJDA1pwvOX1RQ":{"text":"Were in town on other business, remembered it was 75th anniversary of D-Day so made it a p","useful":0,"cool":0},"3TIjzxk4yj39z1bkY0x7QQ":{"text":"The \"Not to be Missed\" museum in NOLA.  Outstanding, and Tom Hank's movie \"Beyond all Boun","useful":0,"cool":0},"M0FrFucceoVdaPMlFV4ruA":{"text":"The work put into this museum is absolutely amazing. It takes a full day for sure if you w","useful":0,"cool":0},"NxIe0NCdCSwdy-f-edrAJw":{"text":"Absolutely phenomenal!!!!!!! Words can't express it does take awhile to take everything in","useful":0,"cool":0},"T9MHoWVF3KsCzVWvUZ_q5w":{"text":"TL;DR Dudes. If you're in New Orleans, you absolutely MUST come here. It doesn't matter if","useful":1,"cool":2},"vVeeDj7art66-AskPXDusA":{"text":"Deservedly New Orleans' most visited attraction -- and much more interesting and affordabl","useful":0,"cool":0},"8tRmmjJER1jjxF_CZ9XBhg":{"text":"I think we are the one of the few people who didn't love this place! Everybody else we tal","useful":2,"cool":0},"U5i1_JzexqlJv3p425_Jow":{"text":"Amazing! See the movie in the victory theater if you have time. And go to the top level of","useful":0,"cool":0},"jDBJMNKB_2UfWBklhh8akg":{"text":"Stunning museum: my advice, get the two-day ticket as I spent all day there and still didn","useful":0,"cool":0},"jtztCHtSF051l061AEznYg":{"text":"One of the best museum's I've ever visited! They walk through the story and give all the d","useful":0,"cool":0},"f4CzfOgQ0IaArrVMfFsMbw":{"text":"Decent.  Note: I did not see the Beyond All Boundaries since after waiting 30 minutes in l","useful":0,"cool":0},"uGfeBV899CERJG-uBO7ZNw":{"text":"Really..... This place is a 15+.   We visit military museums A LOT and this was by far is ","useful":0,"cool":0},"ItWxrh7LuFlRnwbibYKMug":{"text":"This is the BEST museum I've ever been to. If you love history, you'll love your experienc","useful":0,"cool":0},"3IrCNOjMcYmb8vUuZ9Sqwg":{"text":"I cannot explain how awesome this place is.i am not a museum person at all, I avoid them, ","useful":0,"cool":0},"LnYF6SwteX7FrfsNIXyB4w":{"text":"The movie was good. The campaigns of courage was well done. This museum it TOTALLY from a ","useful":1,"cool":0},"wY0j_E5nCGij0Sq-QBxlEw":{"text":"Great museum! All artifacts are well presented and documentaries are well made. I was real","useful":0,"cool":0},"B3toXIvdDTP8FQJGiDyhog":{"text":"I've been to the museum twice and its amazing how much more they have added. My favorite p","useful":0,"cool":0},"UzIt188J1Jt6L3wwGa_FeA":{"text":"What an amazing tribute to our men and women that served on WWII for our great nation. You","useful":0,"cool":0},"_uWuZZ3EYstzC-OzkejdfQ":{"text":"One of the best museums I've ever been to. It made me so proud of my grandparents who serv","useful":0,"cool":0},"8sjCXTlbh6UNfT3rh7FoKg":{"text":"We needed a place to explore yet hide us from the weather. A friend recommended the World ","useful":2,"cool":1},"ln1YabdL0LVs6HSriTkeJw":{"text":"Overall, this museum is curated in a way that glamorizes war and violence.  It's basically","useful":1,"cool":0},"e9Uj5M58a4_wZC0KtskUjw":{"text":"Wear comfortable shoes!! So much to see. We were there for 4 hours. Rich military history.","useful":0,"cool":0},"09KP9ExiAi2lmT6TIJV-wQ":{"text":"Highly recommend this museum. A bunch of informative exhibits to visit and most importantl","useful":0,"cool":0},"1I3qsRoku1QoXP6drM-3Ew":{"text":"As someone who has been fascinated by World War II since I was about ten years old, I was ","useful":6,"cool":4},"2aIWTIm_Do6sf8QbxYXljw":{"text":"Great museum - interactive with oral histories and immersive backdrops for the short films","useful":0,"cool":0},"t-wCcURwL-xY2KkOUU38BQ":{"text":"Why does this place need reviews?  It's great.  Go.","useful":0,"cool":0},"FpRQF2pSpiVXSMfZ8Pi4fQ":{"text":"A must see! Plan to spend at least 4 hours because there is so much to see. Well kept and ","useful":0,"cool":0},"YTsKjLy-3E0crw9oPkaCpA":{"text":"Absolutely amazing wonderful experience. I highly recommend arriving early to enjoy every ","useful":0,"cool":0},"946iKOkTz-Vk53qnzk1faQ":{"text":"I don't go to museums very often but I was blown away by the WWII museum! There is SO much","useful":0,"cool":0},"_nRdsZzz2PYH_xbcJEgt_w":{"text":"A must see if in Nee Orleans. The museum is done with modern tech but has that old feel to","useful":0,"cool":0},"_HwsRopgtJpxlX2bMlcw0Q":{"text":"What an amazing way to experience history! You could spend an entire day between the exhib","useful":0,"cool":0},"FcbZ-TA-xTzIHJifx9KKXw":{"text":"Plan to spend all day! This place is big and there is a lot to read, view and take in. Def","useful":1,"cool":1},"8mY7tHf6uwtQtpIwW-Qz4w":{"text":"I am not a history buff, but this place is amazing!!!! DEFINITELY catch the 4D Tom Hanks f","useful":0,"cool":0},"5rVGLSzBzcLC8ktxcGRc9A":{"text":"This is super worth it. As a matter of fact get a second day pass because you can barely e","useful":0,"cool":0},"cqxmc0outHAMRTC4aQC7hQ":{"text":"There are so many good reviews on here for the National WWII Museum, but my husband and I ","useful":4,"cool":1},"drPihl5VqHAm6SuFj6InUg":{"text":"This is my second time visiting this extraordinary museum, but it has improved greatly sin","useful":1,"cool":1},"ySnLRT7MTRJQ4h_inOjFbA":{"text":"$57 for 2 people. But the extent of design, 5 buildings, decorations, and information make","useful":0,"cool":0},"HTcUHNB94uC8LrO28g7y8Q":{"text":"Definitely go for beyond the boundaries experience. Very detailed explanations of the Seco","useful":0,"cool":0},"lE80pTU7gjVuv985kWznAw":{"text":"There's really no words to describe it. It was very memorable. So well put together. The m","useful":0,"cool":0},"rEO7FQzCMAjqql-DoUAAPA":{"text":"Great just like a museum should be. Part of it were sad like looking into kids gas mask an","useful":0,"cool":0},"eV8xUxquldHbGxctOSTtTA":{"text":"This museum was very informative. I came with my two teenage boys who really enjoyed this ","useful":0,"cool":0},"POf0b8_q4NOE44LDOGgA0Q":{"text":"I'm not sure why it took us so long to visit this amazing museum. My DH and I decided to t","useful":1,"cool":1},"Wx8taiDKhzwrqi3PvYQ81g":{"text":"This place is just awesome. We spent nearly 4 1/2 hours there, and we skipped through some","useful":0,"cool":0},"A_JsYIIhwIOESh9xoQVxDg":{"text":"The best history museum....ever.  It has always been my dream to go here as a student of W","useful":0,"cool":0},"fGD8KdVdjqXFpZedc-mnHg":{"text":"A great interactive learning experience. You can be assigned a person and follow them thro","useful":0,"cool":0},"OaH01Sx86zBmvM2brZJ6Rg":{"text":"[Visitor from CA review]\n\nAbsolutely worth the time to go to this museum even if history i","useful":7,"cool":5},"I8JXNCq_tQHbf_p70RbqFQ":{"text":"The Merchant Marine exhibit is displayed well on the bridge connecting the two main buildi","useful":0,"cool":0},"VslkbohY3FOACqrgGD5vDA":{"text":"This is worth walking to. So much history, statues, and monuments! Plan on spending half a","useful":0,"cool":0},"f9ukXUKdBdzE1758k3k8aw":{"text":"This museum is fantastic. My wife and I could have spent way more time than we did in this","useful":0,"cool":0},"sVQN7RbFZ22m-lZ9d20Nww":{"text":"I enjoyed it!  Plan on several hours even if you don't stop to read things.  If you look a","useful":0,"cool":0},"0eRyDCYioFgcCT8WFPM5hw":{"text":"This place is absolutely incredible. A little pricey but worth it. If you want the full ex","useful":0,"cool":0},"eIQ_zCISuZc-_EkTW1sQNQ":{"text":"Absolutely beautiful museum. One of my favorite museums and it's not only visually appeali","useful":1,"cool":0},"XSqh7Pqu44T478Gsi7HoNw":{"text":"Love the WWII museum! How can you not? I've been here a handful of times and I find someth","useful":1,"cool":1},"AXquqih1BV4085NqJl3hLw":{"text":"We watched the movie and that was a great investment. Museum is very well done. Everyone s","useful":0,"cool":0},"euK1BUQYWgDDbghhAuuS2Q":{"text":"Very informative. Learned alot. Watched the \"Beyond All Boundaries\" 4D movie which was gre","useful":0,"cool":0},"nVQS4ZeVOhpYrYEuC12NPg":{"text":"This is an excellent museum and tribute to our soldiers.  The day we went  it was packed s","useful":2,"cool":1},"Vb06jeETGGDf4TWPXuqmfA":{"text":"Spent all day here. Can't say enough. Wonderful and moving experience. My father served an","useful":0,"cool":0},"45_R0qPKqSv25TRajfodng":{"text":"Outstanding exhibits and short films. There are two main buildings to explore, the theater","useful":0,"cool":0},"AvtIDYo-BW-HVy8OUyA9jw":{"text":"A must when visiting New Orleans. You can spend days here, there is so much to see. Very i","useful":0,"cool":0},"hvFg2eP2GWq0SPUBGAuo5A":{"text":"Great museum.    A complete look at WWII.  From a more thoughtful perspective than most mu","useful":0,"cool":0},"lsz5dxQZeJCbn0JefvXVtw":{"text":"This was in one word- phenomenal. I recommend going here for everyone. Truthfully, I am no","useful":0,"cool":0},"jNiHH3pzMP5YZsBVJCDNQQ":{"text":"This is a must see. Largest WWII museum in America-4 large buildings. We didn't have time ","useful":0,"cool":0},"XQuxo_qo59U7Dxl00LCGjQ":{"text":"By far the best and most important museum experience I have ever been privileged to visit.","useful":1,"cool":1},"-70D4cEkFIGOKSd1kFhKLw":{"text":"We happened to be here on Veteran's Day and I'm glad we took the time to visit the museum.","useful":1,"cool":0},"XJx1GP4uO-7DX9dZxyO7Cw":{"text":"The National WWII Museum is a must-see in New Orleans. It's a large, interactive museum an","useful":7,"cool":3},"V0Znix4Zp90Aiht0QVqd3w":{"text":"So much history and behind the story of each events. I really enjoyed our movie that was n","useful":1,"cool":1},"-s5nwQjY6y6bepcSycMfNQ":{"text":"Definitely worth a trip if you are visiting NOLA. It's very interesting with great details","useful":1,"cool":2},"tlE7dx8M06pGAkPBBPRUSA":{"text":"A short walk from The Eliza Jane Hotel which is also on a Magazine St.  WOW, this museum i","useful":0,"cool":0},"wvJUGFX6uVYoMsaVoY1Aww":{"text":"What a great place to visit. I wish I planned for more time. This feels like multiple muse","useful":0,"cool":0},"jkix7ftGLpkdCjg0k9rk_w":{"text":"Phenomenal museum of WWII history!! We loved the exhibition and the interactive displays. ","useful":0,"cool":0},"UbX0oUMlUuRWr4i3pYDlpQ":{"text":"Whether a veteran or not this is a place to see. We was probably there 3.5 hrs and guarant","useful":0,"cool":0},"xH_N4WFYiQceVqUG8lFekw":{"text":"Great museum!  I would suggest starting at the Museum Entrance (there are several entry do","useful":0,"cool":1},"Cpqri03-n7qeeLL_08OSPA":{"text":"I enjoyed the museum even though it's about the war was still entertaining.lots of it was ","useful":0,"cool":0},"dKAKyO7ileRJt1myh0pc5Q":{"text":"The World War II museum was, in one word, awesome! Make the stop, watch the films that alw","useful":2,"cool":0},"qdm0_5o6mb1znnWn7VH0_A":{"text":"I purchased the $28 admission and then the $7 second day. So in total I paid $35 plus tax.","useful":0,"cool":0},"aBaIdkGIe5vXxWdClKG8VA":{"text":"Wow. A must see if you are in the area and worth a special trip if you aren't.  The layout","useful":0,"cool":1},"6UOzPTPjR0zLBWU7jE8glQ":{"text":"The museum is huge and very spread out in multiple buildings. We were there when there was","useful":0,"cool":0},"QGA8ZcAu7GOfelPaG8iBmw":{"text":"If you're ever in NOLA, this Museum is a must stop, from the movie, exhibits and replica c","useful":0,"cool":0},"S2HW1jyeqnJO0Q4MOyaqjQ":{"text":"Blah.\n\nThough it was a pretty good museum with several interactive and interesting compone","useful":4,"cool":1},"c4ErRaq6gDEGPsP87qKc2Q":{"text":"I've been enthralled with WWII history since I was little and my Papa shared with me about","useful":2,"cool":0},"Hom8v789mwI8yJSROnGSiQ":{"text":"This is not to be missed when in New Orleans. Wow. Pay the extra money to see the Tom Hank","useful":0,"cool":0},"rAD8K97KweCGWP-U2It2tQ":{"text":"If they allowed us to pay $10 just to see the 4D film, that'd be great.  Unfortunately it ","useful":4,"cool":0},"C6yFFWsq0fyTzledUxxGeg":{"text":"Excellent interactive learning experience.  We thought we knew a lot about WW2 but heard n","useful":0,"cool":0},"QDAkhcMF9DCsAX52pApIXQ":{"text":"We host the National World War I museum in my home of Kansas City, so I had to visit this ","useful":3,"cool":1},"aR5PtaNhf22UYdjBWKcIaA":{"text":"Amazing telling of history.  Some of the video displays actually brought tears to my eyes.","useful":0,"cool":0},"3ukbe-i1Dz-vEsaEooDBZg":{"text":"This is billed as one of the best museums in the country and it did not disappoint.  This ","useful":0,"cool":1},"2dCkGT_1MEptrgGdOp55Eg":{"text":"Wow\nNot sure if its right say Wow about an emotional experience.  You must go and feel thi","useful":1,"cool":0},"csl8FH2YMJCDZ1TSdNObFA":{"text":"It is very big but very disorganized and they need to have more items on display.  With so","useful":0,"cool":0},"DwYoLNVdHC8u7ao6Z1K61Q":{"text":"Great place to visit, especially on a rainy day. We enjoyed following along with a soldier","useful":0,"cool":0},"uF4ZQ0wdaSjW3nl913uIow":{"text":"Its great my uncle helped build (the replica of the higgins boat) I was there as well, and","useful":0,"cool":0},"gZTBXHCij8kk-9UxhFNe4w":{"text":"The WWII Museum is a must visit attraction in New Orleans. Growing up, I visited the museu","useful":0,"cool":0},"mj-XACHtiinSmao4PKK9HQ":{"text":"Feeling shamed that I hadn't visited any museums on my New Orleans trip, I decided to sque","useful":2,"cool":2},"fB0CTMn2TFEIjw01sJgLqw":{"text":"Great museum! Very cool exhibits and the train you start in was a nice touch. You will rea","useful":1,"cool":1},"0Dm22Q8HcycH-m6M-LRPgg":{"text":"WE came to the WWII museum yesterday. It is a very humbling experience. We learned a lot a","useful":0,"cool":0},"kptc4ilwWdDSkE4qNm2LYg":{"text":"Came here on Memorial day. As expected, It was crowded which made the pace through the exh","useful":2,"cool":2},"tPt_A4e0sGI4ItNADrDNSA":{"text":"I was so happy to go here! I had a high expectation and it was met. We saw the show \"beyon","useful":0,"cool":0},"tYiorE59_7EbNOtLpw0ePA":{"text":"I did not expect to love every minute of this experience! Wow! The museum is beautiful and","useful":0,"cool":0},"Xb8otBngC5898AGfke-8qQ":{"text":"This was an interesting little detour from the larger trip to New Orleans - flew JetBlue f","useful":0,"cool":0},"PpwyfBN5k66b1dlQBwG27g":{"text":"Totally worth your time. The entrance fee is a bit expensive but totally worth it. Be prep","useful":0,"cool":0},"o0HrQJJRvudhNTjtPd79dA":{"text":"Went to WWII museum years ago when I made New Orleans my home and enjoyed it. This time, w","useful":0,"cool":0},"9VKgzeX2uyoSLYivyH5DxA":{"text":"This museum was the highlight of New Orleans. Got to do both the road to Berlin and the Ro","useful":2,"cool":1},"rgRgO4PdB3HYucKAfGlbgA":{"text":"I'm wavering between 4 and 5 stars.  On the one hand, is this one of the best museums I ha","useful":7,"cool":1},"PZZtdGf196OAobd02qzS3Q":{"text":"Reiterating what everyone else said.  While there is lots of history and culture in New Or","useful":0,"cool":0},"snSpnqbalb0aH5CFWoWvzQ":{"text":"Get your walking shoes on and go to this museum.  Right now!  Multiple buildings, multiple","useful":3,"cool":3},"suh-6DDusuYiEeQ9UauScg":{"text":"Beautiful Museum! I enjoyed the movie and all the exhibits. The Dog Tag Experience was won","useful":0,"cool":0},"XkGGH59H_iJPMs15TaTxrQ":{"text":"This museum is everything you want, end of story.\n\nWorld War II is a complicated and well-","useful":2,"cool":1},"oDvkpU9ZJfCHsUGP9xLL3w":{"text":"Großartiges Museum, dass jeden Cent des auf den ersten Blick teuren Eintritt wert ist. Tie","useful":0,"cool":0},"EHEH3VcN3RxMhP2p7rWtFQ":{"text":"Sounds boring. But this is the \"National\" WWII museum and it is so worth it.  I'm still no","useful":1,"cool":1},"y-O9v6iNvmgJi1987S9ueg":{"text":"This \"museum\" was unbalanced and more of a theme park designed around the American campaig","useful":0,"cool":0},"AvDxfAWFRbI_xcupCL8sCQ":{"text":"The museum is great, but the people visiting are prejudice as hell. I'm not even Japanese,","useful":4,"cool":0},"QVyodDd34Fu3motX9m5fjw":{"text":"This is my first time here, and it won't be my last!! The overall experience of this place","useful":0,"cool":0},"T_vguAeXXRI06lhy41NydA":{"text":"We went the the National WWII Museum with our family.  The museum exceeded our expectation","useful":0,"cool":0},"ZwM081px-UrX5NZPXPIIHg":{"text":"Amazing museum and great time to appreciate American history! \nThey offer student and vete","useful":0,"cool":0},"WBT9KVa_lVpFZyOAlbd8Vw":{"text":"Love this place so cool and clean! I bought a sweatshirt, I don't mind paying more for som","useful":0,"cool":0},"JD2lH0OGAyUjJgIgi5XH-g":{"text":"Excellent museum but they need to redesign the layout for better flow or come up with some","useful":0,"cool":1},"z3EEyvBWJnZiAkudlNQXRg":{"text":"We had just wrapped up lunch when it decided to downpour.  The museum wasn't in the plans ","useful":0,"cool":0},"sfjLsReWT59WBoPVDh6yaQ":{"text":"A waste of time and money.  Worst designed museum / experience I have ever been to.  Don't","useful":0,"cool":0},"3lQfaxz1m1sHTAZoBkPeyg":{"text":"This is one of the coolest museums I've been to.  It's a huge museum and you can probably ","useful":1,"cool":0},"-V9B1uZeHbwgH3Qs4B286Q":{"text":"This is not an excellent museum, it is not a superb museum. It is an astoundingly wonderfu","useful":1,"cool":1},"hkNDYKitMT03S-9mZpfZfg":{"text":"Must see! This is my favorite museum in the country! I loved the Smithsonian museums in DC","useful":0,"cool":1},"osGrXuLyyVNhwgdlPCkjdQ":{"text":"What a great museum for WWII .. The 4D theater is absolutely a unique experience (thank yo","useful":0,"cool":0},"whW9iXOI3FgFbbGn3d3GXg":{"text":"Wow,  just wow.  We got there at 10:30 am, left at 5:00 pm and couldn't see it all. No bre","useful":0,"cool":0},"JKw3ZG1Srcf9iqtixueK9A":{"text":"If an American, or our allies in the war, can go through this museum and not come out the ","useful":0,"cool":0},"BYVcHcVuVAic7Xax46Z0sw":{"text":"First of all, it costs $28 to go in. Then $7 more to see the movie which is so loud that I","useful":0,"cool":0},"T4N3OPZzF69IDa-7G6MJ8A":{"text":"Been two years since my last visit. The museum has expanded beautifully. More interesting ","useful":3,"cool":4},"XA3p1Uk10dDDQXlvZgdRGg":{"text":"If you love history, have an interest in WWII or have time to spend indoors in New Orleans","useful":2,"cool":1},"y4nnwnuQnjf8N8M7_acf3Q":{"text":"If you're in NOLA be sure to take some time out from Bourbon Street, the Garden District, ","useful":1,"cool":1},"cKIzwU2xZ5on8y0zPQCYqg":{"text":"What a pleasant surprise during our trip to NOLA.  For starters, Beyond Boundaries movie i","useful":1,"cool":0},"q5kygYteWIZWxiH45t2UBQ":{"text":"Definitely a worthy place to visit, just not during peak hours (it can feel like a manhatt","useful":0,"cool":0},"SGbcjf0cuRSXpvzOXhSKmg":{"text":"Fun experience for the whole family. Really enjoyed the 4D movie. Even though it was reall","useful":0,"cool":0},"XPXY6kPrN6wo9FSlQydMXg":{"text":"Excellent museum no wonder is one of the best in the country. All the history in one place","useful":0,"cool":0},"3wy4RajZ4OEAjz3qi-fuAA":{"text":"Do yourself a favor and spend a sobering day learning about the people who continue to mak","useful":0,"cool":0},"9FztepusUGpRTlQrqgTffA":{"text":"A must see in New Orleans. Takes up a good part of your day but definitely worth it.\n\nWe w","useful":0,"cool":0},"22elZa4OpeeqfOSLGzRt7A":{"text":"Great museum. Unfortunately, I only had an hour here because we got held up somewhere. I'd","useful":0,"cool":1},"dFWOaVznowfDDADr71eWDw":{"text":"A massive four-building compound located just beyond walking distance from the French Quar","useful":0,"cool":0},"Gu9scInXsJw_Aiv-J7nifA":{"text":"I'm going to write two reviews, with different ratings. This review is for the \"original\" ","useful":0,"cool":0},"J-RiJguDyOCa8ecnpG-LrA":{"text":"Great modern museum portraying World War II exhibits. I just wish I had more time! I could","useful":0,"cool":0},"i8tjdQTzp1YRK7EzSbYERw":{"text":"Wow! What a great place to visit. The museum boasts a very spacious footprint which allows","useful":0,"cool":0},"nanexTO8zyvWR2m9kxSocQ":{"text":"This museum is beautiful, its exhibits modern, well-done, and engaging. They manage to pac","useful":0,"cool":0},"MzFmY4UHM5amGMIDvH_ezA":{"text":"Very well done, highly informative a bit pricy, but worth it.  They are trying to expand t","useful":0,"cool":0},"XcS8eR3Q3sCq6QbgKJtd_g":{"text":"The Best of Sinatra show at BB's Stage Door Cantina in the WWII Museum is excellent. Spenc","useful":0,"cool":0},"G7I0bHrqFkurGet3EcwMNQ":{"text":"Excellent museum with an enormous budget. Loved the gift shops and the film.\n\nI was frustr","useful":0,"cool":0},"pHj-dp1iJdJzkMZybfo8HA":{"text":"Went based in the reviews but wasn't expecting much wadi wrong!!  This is a fabulous museu","useful":0,"cool":0},"evX1AL-OtUhFdGZAu6r4Ew":{"text":"Great museum!  Soo much history to see and read about WWII.  Many generous vets donated th","useful":1,"cool":0},"WzGgy2NqISc9kP_UTRE8rw":{"text":"3 of 5 starsReviewed April 5, 2014 NEW\nEveryone had advised me to go to this museum when i","useful":2,"cool":0},"W5QcLBGxjTFdJY10zzidKg":{"text":"I really enjoyed this interactive museum and found the displays to be beautiful, creative ","useful":0,"cool":0},"kHD-uTdrZuoX31YVLgA2Bg":{"text":"Nicely done. Several things I have read said 2-3 hours. I would suggest allowing much more","useful":0,"cool":0},"-cRyftmJ-FlCsqKtTL46xQ":{"text":"Do the movie plus the museum.  I learned more here than I did in AP US History.  'nuff sai","useful":1,"cool":0},"tmVe5VvxP_o-SE5jhvsJyg":{"text":"The museum does a very good job of putting you in the shoes of the everyday American befor","useful":0,"cool":0},"o4_ocJJmGvuV_bfiS3rpnw":{"text":"This was a great museum to visit. A lot to see and do although we ran out of time after sp","useful":0,"cool":0},"XMCEilreTR-BobZGb1MIfA":{"text":"One of the best museum's my husband and I have ever been to. We spent 3-4 wonderful and ed","useful":0,"cool":0},"-3t2V2YDzpzaq0n54OU0Mw":{"text":"Three buildings of memorial. The airplane exhibit is outstanding.  Many great stories of o","useful":0,"cool":0},"i9WVrxau4KGqW8-PtcWALg":{"text":"My husband and I purchased Behind the Lines tickets.  My husband is a huge history buff an","useful":0,"cool":0},"HjOIjEv9JPw14cMvbMzGbQ":{"text":"Could spend an entire day here. It's the production; everything is very well done, educati","useful":0,"cool":0},"6yBzlq-cPNBVWWdBQ3vieA":{"text":"Excellent!! Enough said. If you like history feel free to lose yourself here. We could eas","useful":0,"cool":0},"6bWZCBniSqPoWQXZuAhNeg":{"text":"I only had the privilege of visiting once in 2012, but I plan to return in two weeks. This","useful":0,"cool":0},"kL2Gk1WXVZ4z_kOgSp6xqg":{"text":"Being that the National World War II Museum is ranked #1 in TripAdvisor's list of top thin","useful":2,"cool":0},"pL6Tmm7D01Van2TKFkoBew":{"text":"We had a fantastic experience at the National WWII Museum.  We arrived around 3:00 and sta","useful":0,"cool":0},"CSiTAIWfFZlvjfbSzQuNpQ":{"text":"At the age of 50, I learned more here at the museum than I have in my entire life. You hav","useful":1,"cool":1},"-zh2DpxgBfh7o6aKjotkxQ":{"text":"This is place is so well thought out. The experiences as your walking through the Road to ","useful":0,"cool":0},"84DAxrZ3hwTeTsGTKzVTUg":{"text":"This museum was a \"must see\" on my New Orleans Bucket List and it did not disappoint. Even","useful":0,"cool":0},"aH-hywsgY1PEH66vEXaagA":{"text":"This is one of the best museums I've visited outside of the DC area.  For the subject matt","useful":0,"cool":0},"K3qEDtHfmOxh1_yiVzJr5A":{"text":"This museum is da bomb!(see what I did there?) We love puns. Hehehehe My 12yr old son love","useful":0,"cool":0},"ZeBVOehbvjf4nI7mJkzrhw":{"text":"Very well executed could easily spend a day or more. Realistic with great attention to det","useful":0,"cool":0},"ySXDq3IlWJp7pq5qkNCAHg":{"text":"Surprisingly good. We took the kids there on a whim (my son is into WWII stuff after watch","useful":0,"cool":1},"F63F6Ow1J1hqweR28MY61Q":{"text":"What an amazing museum. I loved the video exhibits and many of the displays. I was fascina","useful":0,"cool":0},"1JXfG1CBp8eJAXXesbfW1g":{"text":"Initially I was not that impressed when I walked in and had to climb some stairs and a a s","useful":2,"cool":0},"d80kyft9tAHoqy01ZZjPKw":{"text":"Paul's Yelp Elite Rating: 4.5 Stars, Rounded UP to 5\n\nThis USED to be called the D-Day Mus","useful":3,"cool":3},"pYYqUbwaPulpuyPYNBcC1Q":{"text":"Go see the movie... If you don't have time to tour the entire musuem at least stop by to s","useful":2,"cool":2},"iMHpOBVNANJJRXTWQZodKg":{"text":"I remember going on tons of field trips here back when it was just \"The D-Day Museum\". Of ","useful":0,"cool":0},"qW_3YaNxH0umpdnbf0w9Mw":{"text":"Probably the best thought out and engaging museum I have been to!  There's so much to do a","useful":0,"cool":0},"hDZRMxY-9-iIZ__CcMXu6g":{"text":"This is one of the better museums we have visited recently. Excellent written and visual d","useful":0,"cool":0},"7ALG-4i00jHRfLVcUpqDKw":{"text":"Awesome!  Take the time and spend a few hours here.  Very good movie.  Great explanations ","useful":0,"cool":0},"3Dyy-XqNF01rQKZkaG0kUA":{"text":"Visited on 1/6 just after opening.  I was here 10 yrs ago when it was called the D-Day Mus","useful":0,"cool":0},"qzmNnSQLscz0298O9eoqnw":{"text":"We spent about 3 to 4 hours here at this museum.  It was very educational and tons of arti","useful":1,"cool":1},"UJSGE2W4YIGU-OR6kqo6fA":{"text":"This is a great museum highlighting some aspects of the war.  The movie was very well done","useful":1,"cool":0},"UKKf4CU250zxMBzTVLqGwg":{"text":"really interesting! we don't normally go to museums, but this was rated #1 on trip adviser","useful":0,"cool":0},"P5s3Aq29Jn1oMKbgdi536g":{"text":"This is one of the best museums I have ever visited. It was well built and organized. The ","useful":0,"cool":0},"AAhNo8nrs5cYxU7cjYSW8g":{"text":"Located in the Central Business District of New Orleans, this museum, formerly known as th","useful":1,"cool":0},"wiWILBPN_DiiKeZ4Q5sfpA":{"text":"One of the best WWII museums I've been to in a long time.  The text is extensive, but neve","useful":1,"cool":1},"RtoR6R3mButD5z20amkhmg":{"text":"Coming back for future visits to get the full sense if WWII. This museum started out as a ","useful":0,"cool":0},"KfA808AWvwo6evOFUMPWrg":{"text":"Wow! Where do I start? This is one of the greatest museums I have been to, thus far. The v","useful":2,"cool":0},"aYY5U7R_34JcR6PiuOAGDA":{"text":"This place is full of great historical sights and information. The staff is friendly and f","useful":0,"cool":0},"LSUti-3Q3kg00Dz4KaYfng":{"text":"Outstanding museum. I was impressed by the presentation from the first minute walking in.\n","useful":1,"cool":0},"VmASc05QqaKGLUOaSwtlGA":{"text":"Superbly down museum that is a must visit. The only downside is that its so big you litera","useful":0,"cool":0},"TgES7XRI49EVr9EcuZw1wg":{"text":"First of all, it costs $28 to go in. Then $7 more to see the movie which is so loud that I","useful":0,"cool":0},"WHVfUZD2PnecnGeYUrr_jg":{"text":"Enjoyed. Like the fact that all sides were represented. Showed clips from different countr","useful":0,"cool":0},"gMcmDJp10ZejDdmNBwOmpQ":{"text":"My wife and I went in not sure what to expect, esp given admission price.  However, we som","useful":0,"cool":0},"Uv7gN-tql9k1GF8MjhhsQw":{"text":"took the st charles bus (since the street car is under construction) to the museum. $21 fo","useful":0,"cool":0},"JYfml3KyeNUNGzEZIHPXJQ":{"text":"If you do it right, you can't do this museum in just one day.  This museum expansive, enga","useful":0,"cool":0},"Gf3K9jOaqKp9WPitiJzUAg":{"text":"To be corny, This place makes history fun. To be serious, this place fills one with extrem","useful":1,"cool":2},"e09-07Qylxf18b5cBYd2Og":{"text":"I think my dad would LOVE this place.\nI was told by tons of people that i need to make sur","useful":2,"cool":0},"x9JKLR6ORDnQjp6sw3MAQw":{"text":"It's extremely well done.  Very thorough for the basics and some deep cuts of WWII.  Worth","useful":1,"cool":0},"bJOR0znhtLUaLu3XPNrOtg":{"text":"This review is for the museum store at the National WW2 museum.\n\nI ordered an item on 12/1","useful":0,"cool":0},"-w5JmPX4EBB4WPTn6iQ4AQ":{"text":"A nice attempt at telling the stories of the European and Japanese invasions to those of u","useful":0,"cool":0},"qLESDl57DYmM0_ISagiHnQ":{"text":"I cannot say enough about this place. The museum is amazing and I loved touring it. I lear","useful":0,"cool":0},"xIfz6SeP8_t48Qzg-Zqdhg":{"text":"History in front of your eyes . This experience makes you feel like you were there when ma","useful":0,"cool":0},"KYukU3oha57vNQ5svq5pSQ":{"text":"Very nice museum.. the staff pleasant with some wwll veterans there to answer any question","useful":1,"cool":1},"cHBic8UEDsAW2RcPbJMlEg":{"text":"I did not expect to be as mesmerized by the exhibits in this museum. It takes more than 1 ","useful":2,"cool":3},"yzxEUbI0WXiwgkcpjFljXw":{"text":"This place is amazing!!! We had a blast. The beyond all boundaries movie is definitely wor","useful":1,"cool":0},"TehRjcx4mg3gsBNj8mpBUA":{"text":"The staff was pleasant and helpful.  The setup was gorgeous. The displays were very intere","useful":0,"cool":0},"AiU7HR4_LEHE7PHiz9qSRA":{"text":"Best attraction in New Orleans. See the Tom Hanks movie. Allocate at least 3 hours to see ","useful":0,"cool":0},"xlf98IHDN0cMSWj40Nuypg":{"text":"TIP: go to neworleansonline.com for a $2 off admission coupon that can be used by showing ","useful":3,"cool":0},"YYW5RqTdJqhgc-Aw6aLlVg":{"text":"Really a great museum to honor World War II.  The 4D movie narrated by Tom Hanks is a must","useful":1,"cool":0},"0s--a4rOhZSTCRCWP8fEVw":{"text":"We are able to speak to the last of the 'Greatest Generation' - the volunteers who give fi","useful":6,"cool":0},"rRVAkJOuTaLPnpyxq_9Ojw":{"text":"This is an experience that everyone should treat themselves to.  We did not know much abou","useful":0,"cool":0},"NQQ48z1SMU-SVuzvdt0Mtw":{"text":"Huge huge huge museum!!! Like massive! We were there for 3 hours and didn't see close to e","useful":0,"cool":0},"3GYEdbmMhNPX2qB6vqDAxg":{"text":"This Veterans' Day made me think about the wonderful experience I had a couple of months a","useful":1,"cool":2},"KBdy6OdaYeDf9_VauBdNbg":{"text":"This is the best interactive museum I have ever visited. From the dog tag train ride to th","useful":0,"cool":0},"uZSkd8y7xDQriVOHzbHRCg":{"text":"This was a great museum to visit. I made the mistake of not having enough time to explore ","useful":0,"cool":0},"OJxIpli7uqeBQ7TCnxJ2lw":{"text":"One of the best museums I've ever been to.  Spent an entire day there and didn't get a cha","useful":0,"cool":0},"yuookZtcvpdMzJ8-AREdCw":{"text":"This museum blows many of the National museums in DC out of the water! As a 4th generation","useful":0,"cool":0},"1KAceUEXUAfv0mni3_GThw":{"text":"Very interesting. Lots to do and see. At least an half day adventure. Stop and grab a beer","useful":0,"cool":0},"fX6NSCMLYRkEeWs9i1ib7w":{"text":"Amazing museum, the themed rooms were great and the information for each piece helped pain","useful":0,"cool":0},"LbkullahYdKO2CVXjGZs7A":{"text":"There is a reason this museum is rated one of the top museums in the country. This is one ","useful":0,"cool":0},"e_s2kqLacMgEb7SUfTWxVg":{"text":"A visit to The National WWII Museum is a very emotional and thought provoking experience; ","useful":4,"cool":6},"3Gy2BnVRSkmk3KdDnHQo2Q":{"text":"Absolutely fabulous!  I'm not a history buff, but this museum is dedicated to educating ev","useful":0,"cool":0},"5e3fWavsPjeCG4Gcn_PlGg":{"text":"Having gone to this place, I now wish I had paid more attention in High School history cla","useful":1,"cool":1},"gt5u8OxCdf5315pMh2gwqw":{"text":"The National WWII Museum is a moving and very thorough experience. I was so pleased my kid","useful":1,"cool":0},"dW6DzSAlc1VjWOcbN8oeaw":{"text":"As a veteran i had to go to the museum when i was in town. we got there around 130pm, we g","useful":0,"cool":0},"Pia8XW3w1zOU6FQt4ih46Q":{"text":"I'm not sure why this is one of the top spots to visit in NOLA on yelp and trip adviser. T","useful":1,"cool":0},"i5TjHbL7h0gmozIU3B9e4w":{"text":"I had a first date here once... \n\nWalking into the lobby, I was greeted with impressive ma","useful":6,"cool":3},"AIqGvOKU42iFe2WoW45nOQ":{"text":"Beautiful museum, definitely need to go when in NOLA. It's about 2/5 hours of you really w","useful":0,"cool":0},"2KUsFe5QcKP2dwDHRyUsDA":{"text":"Really great way to beat the oppressive heat for a couple of hours. There's a lot of memor","useful":1,"cool":1},"E4kSf0FSCXFiprz1Fztk6Q":{"text":"I knew that I had to visit the Museum while here. Wanted to see if it paid homage to the h","useful":0,"cool":0},"wTpDl7IZQpk9Cs4nXesgZA":{"text":"This was a great attraction. We didn't even know about it until we got here and was worth ","useful":0,"cool":0},"aRqj0ar2LcS52GtRk4IUgg":{"text":"This is a well-assembled learning opportunity to discover what it was like to live the war","useful":1,"cool":1},"Zzg5hR3LoNaMHZb0taM9rw":{"text":"7 stars if I could give them.  The National WWII Museum did not disappoint, and it came hi","useful":2,"cool":3},"jpJF0RjSo8dhCPI1ozfLaA":{"text":"It is recommended to book your ticket online so you skip the line. The museum offers a lot","useful":0,"cool":0},"8LIoTjzM6HnVBHZRSzkaYw":{"text":"Ohhhh myyyy Gawd.  This place is amazing and I honestly don't even really consider myself ","useful":0,"cool":0},"rA2e044Fy21IQps5GxzIGw":{"text":"I have heard about this great museum for a while now. I finally got to spend a full day an","useful":0,"cool":1},"sGhMdjZTPRkVuu7br41X9g":{"text":"There's something about a great museum.\n\nThe stories are told well, in a variety of ways. ","useful":13,"cool":12},"QwwEhDRUxbI02S84OTqbqQ":{"text":"This is for the history buffs! Forget New Orlean's as just a party spot. New Orlean's is f","useful":0,"cool":0},"K4BmteG0-WUjkFvQJ8KyHg":{"text":"This museum is definitely worth seeing. I was only able to spend a little over two hours t","useful":1,"cool":1},"htlE3OaFsFOczx2d-XsNKQ":{"text":"Can't say enough great things, You board 'a train  \" to be taken to war, ' Be sure to see ","useful":1,"cool":1},"YMSHDcfcx8bGsdpyTGedaw":{"text":"What an amazing way to experience history! You could spend an entire day between the exhib","useful":0,"cool":0},"ciQHqLNxCtlWDFGkkkGKtg":{"text":"Emotional journey through time . Highly educational experience would reccomend a few hours","useful":0,"cool":0},"imB41grNnAdK2aYfW2g_HQ":{"text":"Fantastic!! Very informative, the staff was friendly and helpful. The museum was spacious ","useful":0,"cool":0},"TadMn7SbjpEPHXboP60P5w":{"text":"A fascinating and extremely well done museum that truly describes the WWII story by bringi","useful":0,"cool":0},"TZhbq8HT-6DxRB6doLRb7Q":{"text":"love, Love, LOVE... I wrote a paper on WWII when I was in 8th grade so revisiting this tim","useful":4,"cool":5},"Xw1TqUYiY-fgJTvtkDRFrw":{"text":"I've heard that this was one of the best museums in the country but actually believing it ","useful":3,"cool":1},"JR3h2mmgETJyMKF2kvKgbA":{"text":"Absolutely amazing museum! Truly brings it to life. Exhibits are detailed and informative.","useful":0,"cool":0},"nPHyH3if76LWTcs-YE_6WQ":{"text":"This place is EASILY a 5/5. Even if you aren't a war buff, this place is a must see. There","useful":0,"cool":0},"Xpqq6cBTyXgk81YxEG-M3A":{"text":"We went today and things started great because they give discount to military personnel! I","useful":0,"cool":0},"SFzzqUNd-AcOnzUk8pXC9g":{"text":"Very well done museum. We visited for 5 hours but could have stayed much longer. Come prep","useful":0,"cool":0},"XnEgqoEm_aZLGRaP4p2jlw":{"text":"Wow, this museum is awesome, i paid 34 dlls to get into the museum (beyond all boundaries ","useful":0,"cool":0},"iqMkgIsJGwoatczSKFNIKA":{"text":"We spent an entire morning here and both my mum and I agree that the experience was breath","useful":0,"cool":1},"P8Rj2n6Yq7cFqnka1tF_ww":{"text":"This museum is an incredible tribute to the men and women who served during World War II, ","useful":0,"cool":0},"rN75oIanNe08G4qT8_73dw":{"text":"This museum is so amazing! It far exceeded my expectations and I wish I had more time to r","useful":2,"cool":1},"gtIMVG0T9pxBZi51paU5oQ":{"text":"I've visited the WWII Museum twice and have yet to finish the entire thing (probably becau","useful":1,"cool":1},"rf1lPqImhr7hDDIEONSfhQ":{"text":"Best of the best. This museum was our favorite part of our recent trip to NOLA. Hands-down","useful":4,"cool":2},"c4a5Hx23RI1LJ5bi1xh4jw":{"text":"The National World War 2 Museum really deserves more than 5 stars, and since I have to giv","useful":0,"cool":0},"Wp9czMG-0Rcgif-G8TLiwg":{"text":"Amazing place. Killed it with all the details and innovative displays. They have hands on ","useful":0,"cool":0},"CtuZwgXcmBzcOrEVZ6J4Bw":{"text":"Really fantastic museum!  Be prepared to spend a whole day there.  I enjoyed both the Road","useful":1,"cool":0},"MOjZIMM4uViuXg0C1o6OYg":{"text":"This place is rich in history. I was surprised with the facilities. The staff is friendly ","useful":0,"cool":0},"9l0ianVEpExQoENMevaWcw":{"text":"When my husband and his friend first told us to go to the WWII museum when we visit New Or","useful":2,"cool":0},"Nf8vJzMWxgiCLp7_gJiBDQ":{"text":"AWESOME museum! Very cool. We spent around 3.5-4hrs here. We liked how interactive each ex","useful":1,"cool":1},"qsHO3A6HABU6t04uuOXHCQ":{"text":"Very nice. Seemed a little expensive to me though. We added the 4d show and really enjoyed","useful":0,"cool":0},"WRLCBh8PRZ34lkR6DIwlMQ":{"text":"A great museum! It shows the american perspective of World War II. It's a lot of informati","useful":0,"cool":0},"HoLpJrCq8XHnTZjPY30aww":{"text":"Extremely crowded to the point of not being able to navigate  the exhibits.  Flow was very","useful":0,"cool":0},"3TWMis-p0tAlkJqw7vRk_Q":{"text":"Definitely worth the trip. very in depth tour of ww2 spent a good couple hours going throu","useful":3,"cool":3},"28fSKok8JocK7b_FCsGYfQ":{"text":"It is worth the afternoon. This place has lots of authentic WWII memorabilia and did keep ","useful":0,"cool":0},"c8a3IZ89gYRjZUryUcZb4w":{"text":"Obsessed with the Pacific part of the war and was very excited to see that section of the ","useful":2,"cool":1},"VN9_cW0t0K5yO96CMYWCHg":{"text":"This place is a must visit if you have any family members that fought in WWII or you have ","useful":5,"cool":2},"c0UafVQwHHiZV2YQ6itvpw":{"text":"This was a REALLY nice museum. There was so much detail in the displays and there is so mu","useful":0,"cool":0},"XimabhjQiDhon_M0DKvpWQ":{"text":"This was a beautiful museum, and an even more beautiful way to spend the day. We started o","useful":0,"cool":0},"X87iQqn6eixr0w6x5s4fUA":{"text":"OK this in the number 2 museum on TripAdvisor. I have mixed feeling having attend almost t","useful":2,"cool":0},"cPxyXeuBlxJzdST-SmhI2g":{"text":"We spent a day at the WWII Museum and were not disappointed. We took most of the day to lo","useful":0,"cool":0},"eykaEAW-KFYQ6VdaI5jqCg":{"text":"This is an extraordinary museum and probably one of the best history museums I've been to ","useful":1,"cool":0},"zf2U6lfXLG6m91jCHoCxEA":{"text":"Visited the museum on a rainy day in NOLA.   Given the rain it was a bit crowded but I was","useful":0,"cool":0},"-chWCghK51szxgHepgZKUw":{"text":"You can't do it all on a weekend visit to NOLA but you will have missed a great experience","useful":1,"cool":0},"-hJHVb7BsuC8h82aeyAAkw":{"text":"Pricey to get in, especially for a family of four. The museum has lots of information and ","useful":0,"cool":0},"D-yocJwcXk2fkQnaRaVB5Q":{"text":"This place is incredible.  Two days gave us enough time to see everything.  We skipped the","useful":0,"cool":0},"9fowZJDbwPxEEGV8j7ZYMA":{"text":"Wow.  Where to start.  First off this place is expensive, even with a Veterans discount.  ","useful":6,"cool":0},"BHV-sf-LCXbhBqYu_eLEqA":{"text":"First of all, the National WWII Museum is HUGE. It is composed of multiple building and mu","useful":0,"cool":0},"zsyo9fYsy3zow62EjG1d-g":{"text":"I visited the the World War II museum on Memorial Day and they had an event going on, a tr","useful":0,"cool":0},"pFtK7pTOCsuewBwyKmhVuw":{"text":"The museum had a lot of interesting artifacts and exhibits that were very informative. But","useful":0,"cool":0},"LcaKEqL5mo1d9cd9ye9U8g":{"text":"It's a pretty high bar for me but I have to say that this might be in my top three museums","useful":0,"cool":0},"SDtzco_vEKvEY2eD6g_3wg":{"text":"This is one of the best museums in the country! I just returned from my third visit and am","useful":0,"cool":0},"3r_rQq_uE1wUdrDdNA79ag":{"text":"Absolutely overwhelming and emotional overcoming even if you have not lost a family member","useful":0,"cool":0},"GKlJEnzudTUX89gZ1pDIMA":{"text":"One of the best museums I've been to in my entire life. Gives a great picture of the US an","useful":0,"cool":0},"TbIiJMK3lFG4DEpCRyztyg":{"text":"So worth the visit!!  I'm a HUGE history fan...I have a degree in History even.  :)  \n\nThe","useful":0,"cool":0},"INfh9iBbtzVUBFQbuJADUA":{"text":"This was a last minute thing... but I'm glad I went ... so much history and so interesting","useful":0,"cool":0},"usCvh_cDG7Z9vktMn9z7FA":{"text":"So this place is awesome!  I took my 8 yr old and my 11 yr old sons a few months ago.  The","useful":1,"cool":1},"Q944C7H5vsQKBsXHcBCsiQ":{"text":"Visiting this museum was the highlight of our trip. It does take a couple days to go throu","useful":0,"cool":0},"5m3GlzpYBaHeB5vxM7fOZQ":{"text":"What an amazing place. Highly educational. Do yourself a favor and upgrade to the \"Beyond ","useful":0,"cool":0},"viDHX2LeDwICEWlEz5momQ":{"text":"Honestly one of the best museums I have ever been to. Amazing displays put you into that t","useful":0,"cool":0},"B4Vt3L4cGuXdc9Uv6Lfg1Q":{"text":"This museum was incredible! Their was and abundance of artifacts to view. The 4-D movie wa","useful":0,"cool":0},"SGK5vF1SXnjxDrpx-XsTAQ":{"text":"This is a neat place to learn and pass time.  If you don't want to rush, wear good walking","useful":0,"cool":0},"V0tKCyLT6uzvj-lnBB8UZQ":{"text":"Spent 5 hours here today and still needed more time. Such detailed and interesting display","useful":1,"cool":0},"ZJKzE8BAJuCkAfjBmEmFdA":{"text":"Without question, this is THE best WWII museum I have ever been lucky enough to visit. \nHi","useful":1,"cool":0},"Fg8Swg5yocPGuYaeCq3zvg":{"text":"This is an absolute MUST visit when you come to NOLA. So much history, and above all, the ","useful":0,"cool":0},"MpT3sbkvtscU4NEqm6DICA":{"text":"Remarkable collection of artifacts and explanatory materials, text and AV, covering the US","useful":0,"cool":0},"VHnm3S8nxEtLyZq3Vcu2ww":{"text":"Nothing better than learning about our freedoms and those that fought and died for them.  ","useful":0,"cool":0},"XI3YHDtVUUlhyvQQSPMkrg":{"text":"The museum is massive with exhaustive materials and installation. Great curation of storyl","useful":0,"cool":0},"mNixAZ_9b7Nh0_b_FLi0Lw":{"text":"Amazing!  Spent the afternoon with my wife this Veterans Day remembering - those who serve","useful":0,"cool":0},"f-usTv1u8lLsqlqAY5Cvtw":{"text":"Phenomenal museum! The experience includes layers of engagement throughout the visit: enga","useful":0,"cool":0},"d0NXs0g7S3rbHmQQ7j4zCQ":{"text":"Hear ye, hear ye!  Any trip to NOLA without visiting the National World War II museum woul","useful":4,"cool":5},"xfFHvbaDr0xc4zcnd1ermw":{"text":"This place was absolutely amazing.  I have never been to another museum like it and we are","useful":0,"cool":0},"rIq7R2XoR0F3Z5WL5WHsHg":{"text":"Good to visit if you're a history fan.  If history makes you yawn, so will this museum.  I","useful":0,"cool":0},"HFUUX43k478gaES8iLsUqg":{"text":"Amazing interactive & visual museum!\n\nLoved this museum & meeting the WW2 veterans on the ","useful":0,"cool":0},"5nklUML4NTuGNwgavxky_Q":{"text":"Awesome collection of stories and artifacts! We actually came back a second day so we coul","useful":0,"cool":0},"9CG8poii7sthfY7nAUlaUA":{"text":"Wow! Pleasantly surprised...\n\n\"Why would the National WW2 museum be in NOLA?\" one might as","useful":6,"cool":1},"lvnDKF-B-RztQfrDByVdVg":{"text":"Definitely a must see when you go to New Orleans! They showed film footage I had never see","useful":0,"cool":0},"HlJf-FY-lF8IWa9nara3vQ":{"text":"Fantastic and definitely worth a visit!  \n\nJust wanted to say that Anthony who works there","useful":0,"cool":0},"5UtiAUEOiNEEFCwM-EwgjQ":{"text":"Friends of mine told me I had to check out the museum during my recent visit. Ok, I though","useful":2,"cool":3},"oc2IYYV_21w0DYJ0x-Z5sQ":{"text":"I haven't been here in over 10yrs!! Wow, they have come a long way!! They have added numer","useful":1,"cool":1},"k0i5yigzkzi0uCySXRA7eQ":{"text":"Don't judge a book by its cover! The exterior looked pretty underwhelming but goodness me ","useful":0,"cool":1},"bsfYxlKrFMr0V2VzDnfkOg":{"text":"Excellent place to visit and educate yourself on what people in military had to give up ba","useful":1,"cool":0},"IpSZArVddy1OO1uhBhgkqw":{"text":"Everyone was welcoming, masks worn, very clean facility, restaurant was great, we did the ","useful":0,"cool":0},"F2rSfL1CiCbVosKLCbxFUQ":{"text":"Moved by the veterans who volunteered to come in and spend time as well as a great museum.","useful":0,"cool":0},"WbCIb8yL-h2Lq0tTV3SUqA":{"text":"Have always wanted to come here and so glad our schedule allowed for it today.  The campus","useful":0,"cool":0},"ZkPl9z4VsEP4_c7M1OVdSA":{"text":"A MUST SEE! \n\nI learned more about WW2 in the 4 hours we spent here than I learned in over","useful":0,"cool":0},"1B6TAOdYqlM7Or4A1MC9IQ":{"text":"Wow a must see! The movie with Tom Hanks was amazing 4d experience! You need to definitely","useful":1,"cool":1},"gjCVssg2zO1m80xCYwhSsA":{"text":"A great place to spend the afternoon learning about WWII history.  Although it felt sad, i","useful":0,"cool":0},"UaxMV0LEspRxpte72HxWhg":{"text":"This museum is beautiful and worth a visit! \n\nIt's location is on the calmer, quieter side","useful":1,"cool":1},"bwG2VWWpHdSxTN-_D6SFVA":{"text":"One of the greatest WWII museums. Worth visiting two times. Anyone planning to visit must ","useful":0,"cool":0},"0rfnAz2TMySB14HsMc0zhg":{"text":"I went and they were closed. No issues. I understand. However, SHAME on this company for n","useful":0,"cool":0},"xt4AvMF-GypUp3TqIymmDg":{"text":"Wow!! just wow!! This place was amazing! From the moment you step in, there is a gentleman","useful":0,"cool":0},"139ldfIX7b8SpWVPOSIfAg":{"text":"I am ashamed to say I have been to New Orleans many times and never set foot in this museu","useful":2,"cool":1},"tpKET_xHb6M4ZfCgye972g":{"text":"This is an amazing museum. It makes you feel like you are there. My grandfather died in WW","useful":0,"cool":0},"DMKGg0BnzU6nBnu4-et8xg":{"text":"Worth the price! It took us almost 4 hours to tour the entire museum!!! Tons of info about","useful":0,"cool":0},"qHg64UCllSVfBpuKPoO_sA":{"text":"Amazing stories and exhibits!\n\nWe meant to come here on our first visit to NOLA last year ","useful":44,"cool":44},"1D7fun5umrk0HTtfo1j5LA":{"text":"Great museum! We didn't get there till about 12:30pm and it was not enough time to see eve","useful":0,"cool":0},"WXaWp-Ua_DzdN7R-Z2h24w":{"text":"Really interesting museum,so Much I didn't know about WW2.see the beyond the boundaries vi","useful":0,"cool":0},"X2Mx28M2mO0NGpCrh1u6pQ":{"text":"You could spend the whole day here! The exhibitions are interactive! You will find documen","useful":3,"cool":1},"ocnan6A6aj5xKDzlYS6ueg":{"text":"A must for all history buffs. Thrilled to hear that they are consistently expanding with n","useful":6,"cool":4},"x55s27f4yl28yuB4Z5703g":{"text":"I highly recommend visiting this place even if you aren't a history buff. The museum is hu","useful":0,"cool":0},"zBmqLYF2Ujz7l-ykshsJdQ":{"text":"This place was awesome, from the people who worked at the different stations to the materi","useful":9,"cool":9},"AyieXItlleKui9cVGPdfOA":{"text":"Everything you need to know about WWII could be found here, it is a military history museu","useful":14,"cool":15},"9l_pcKkImM3-9NnIPh2wUA":{"text":"This museum was a great stop during my visit to New Orleans. I enjoyed the great presentat","useful":13,"cool":10},"dZzAmZR7_afsCtc5YwMBvw":{"text":"We looked up how long most people spend in the museum (3-4 hours). We were there for 5 hou","useful":0,"cool":0},"ZwPmSGTAe9hIV0a-Tt-LVQ":{"text":"This museum is huge dedicated primarily to everything that has to do with world war second","useful":0,"cool":0},"h4BH-4V8GzNnFb-9_e3v4w":{"text":"Very cool museum with interactive exhibits, friendly staff, unique perspectives, and a lit","useful":0,"cool":0},"zj2ShKRb9PsO6LO9oyqEDw":{"text":"This was incredible and I encourage everyone to visit this museum. There is a train, sever","useful":2,"cool":0},"8R_QCLv0ARjg43b8X_VFIw":{"text":"OMG we went to the National WWII Museum today... holy moly. This is an immersive interacti","useful":0,"cool":1},"gE18D15TJHa4wKePwLx83w":{"text":"Totally not what I expected when visiting the museum.  I expected it to be a museum from t","useful":3,"cool":1},"BSqsW8jS_dU93n9hu6Iazg":{"text":"This was a great museum with a lot to see. If you want to properly see everything, plan to","useful":0,"cool":0},"CAcYQIp_1KxeKKiRirrTtQ":{"text":"An incredible documentation of the war that made the world the way it remains today. Const","useful":0,"cool":0},"vD_L5QrQbNZW5qlflIckTw":{"text":"This is an exquisite museum for both history buffs and people who just like museums. It ha","useful":1,"cool":1},"TvoZzMRubv9ftkM4jynXKw":{"text":"Muy interesante, vale la pena tomarse el tiempo y verlo todo muy bien llevando. Excelente ","useful":0,"cool":0},"r0C31mmKJZ3IL9ZT9572gw":{"text":"This is one of the most interesting museums I've ever seen, with so much to see & learn fr","useful":1,"cool":1},"fG2L8WSsPqD_prDMfJ6mjQ":{"text":"Great museum to visit if you are in New Orleans. The artifacts, stories, machines, tools a","useful":7,"cool":5},"Gk1zOIb0RrE6d_AhXLBG4Q":{"text":"This museum was really good at giving a voice to all the soldiers who were over looked. Yo","useful":0,"cool":1},"DAGyvSRVzJsJYcKYQYvm2A":{"text":"Incredible!!!  The National World War II Museum is a huge, multi-media treasure trove of p","useful":15,"cool":18},"JDdcX0n6Y9PlZSPWxIBRGA":{"text":"Incredible. Words cannot describe how thorough and large and amazing and well kept this mu","useful":2,"cool":3},"BWAXwjoHDvQeuGMHblpoFA":{"text":"Very disappointed that they downplayed the horrors of war. The only mention of the holocau","useful":3,"cool":0},"2r-vMh4hxBjWeqBGOySiuA":{"text":"Okay, this is tough.\n\nI LOVE museums, but I've been disappointed by the recent trend of mu","useful":5,"cool":3},"oib_D_MetQFcrTYHAQHYXA":{"text":"We loved the WWII Museum, but went there not well informed. We had no idea how extensive t","useful":0,"cool":0},"D7s9VexaBapGREnm3r8mSQ":{"text":"Really cool place with awesome interaction and history. But expensive especially for a fam","useful":0,"cool":0},"12Cx0Q7txABrEaEhn6OAgA":{"text":"a Smithsonian museum that is a world wide destination museum and well worth the trip, call","useful":0,"cool":0},"8MIM7bnEL7TAp9PrKoZKzg":{"text":"For a good understanding of the breadth and scope of the war. Covers both the global and t","useful":1,"cool":1},"3rMvRzuRoJJqIhKihA-SyQ":{"text":"This place is a true treasure in NOLA!  I didn't know what to expect, but after spending 5","useful":0,"cool":0},"5kyyBAoyUnNnhwiDaOU2Vg":{"text":"A great visit (for me) to an updated and renovated National WWII Museum.  It has been a fe","useful":0,"cool":0},"R6ix668exzyf6vrFMyzBSA":{"text":"Super elaborate museum. Would highly recommend this well thought out and interactive museu","useful":0,"cool":0},"upesDBfhFBCRWtcl6pDG0A":{"text":"Walked 20 minutes from our timeshare condo on the edge of the French Quarter to get here, ","useful":46,"cool":48},"PuMTazEiotH0f0NyknXF-w":{"text":"I'm sure this place is better than what I walked away with. I have been to a lot of WWII m","useful":0,"cool":0},"HG_FLm6SLD8asie3_q9rLg":{"text":"Make sure you give yourself lots of time here, because there is a TON to see! \n\nThis is ha","useful":1,"cool":0},"InTiblo8GZ4SHe18NdyAxA":{"text":"If it has an engine, I'm in! If it flies, even better!\n\nThere's a decent discount for mili","useful":2,"cool":2},"FwD7kW32yNvGXV6PkJ2wmA":{"text":"Visited NOLA February this year.   My husband has a love for history as most men do.  This","useful":0,"cool":0},"JQ564Ozw5JH7rQ0U7LXWlQ":{"text":"I loved this.  I have been to WWII Museums in France and England and this one is just as a","useful":0,"cool":0},"fFMFRED9D6uW15lFEm1LBA":{"text":"I went to the museum for an afternoon after a tour in the French Quarter in the morning. A","useful":1,"cool":0},"rixJWwOpdG1hJhGtSVnH7Q":{"text":"Having recently just been to the \"free\" museum district in Houston, any museum that wants ","useful":1,"cool":1},"coi4Umt4R6xfBfTXIGmSBQ":{"text":"Above Mardi Gras\nB-17 Fly-Over\nNOLA's Spirit Soars\n\n#NOLA_Haiku\n@wwiimuseum #NewOrleans #N","useful":0,"cool":0},"j2L0UGqircXiOyh8X9SUsA":{"text":"We did a nice leisurely afternoon here. And you can do two days for the price of one. We a","useful":2,"cool":2},"aqpuz7QTFl_BHxVsA73PxA":{"text":"The museum originally opened as the D-Day museum, but has since expanded to cover the enti","useful":2,"cool":2},"1QSmCveQACCMHYr234Eubw":{"text":"Their customer service is amazing! As an active duty military, my parents were visiting an","useful":1,"cool":0},"t_FSZbbkA7KvwauFcqVRAw":{"text":"Truly a remarkable museum. We started in the campaigns of courage, which I would say is a ","useful":0,"cool":0},"o5xqdIcbm1irmNf_yFNWvg":{"text":"Definitely worth the visit with a great display. It is very awe-inspiring and educational ","useful":0,"cool":0},"r97KrkGpkuNjAD8gk4edeA":{"text":"Truly a 5 star Museum that has become a New Orleans staple and landmark. The museum has gr","useful":2,"cool":2},"nqB4snzk8u2VtadsDk4m6Q":{"text":"The only negative thing I have for this is my Lord you need a three day pass to finish his","useful":0,"cool":0},"zLN2AH8R8VNGE4fc1qJI7g":{"text":"This museum is BEAUTIFUL! We were there for two hours and that wasn't near long enough! We","useful":0,"cool":0},"XFXMdaFbnIJX0O1x2OPEoA":{"text":"We love this museum. Even if you are not a history buff, this place is worth the trip. One","useful":0,"cool":0},"hBpfJnIPecEP4-k0TeWZxQ":{"text":"I was visiting New Orleans and wanted to make sure that my friend and I got to see the WWI","useful":3,"cool":0},"b7fLrrKpQiIU1lSVxyH9PQ":{"text":"We learned a lot , everything was clean and organized .\nAwesome customer service .\nIt was ","useful":0,"cool":0},"tck08eOS0ecmpn-QccnfFA":{"text":"This is a national museum located in New Orleans, Louisiana close to the downtown area. I ","useful":1,"cool":0},"9vF-hhGclneGCGnITg4CcQ":{"text":"Historical place to be when in New Orleans!\n\nI think the only worthy museum to visit when ","useful":10,"cool":11},"l8Nm_CXZ2iiC13DxHtyT5Q":{"text":"Good experience, I wouldn't buy the submarine experience. Came on news years and was a lot","useful":0,"cool":0},"opUnSwgnfaceIwn56TsIAw":{"text":"Amazing experience!!! Love it. Show respect to the men and women who BUILT this country.","useful":0,"cool":0},"4wHEhR8wPqZzdOiSYnPq2Q":{"text":"One of, if not the best put together museum we have been to! The place is very clean, well","useful":0,"cool":1},"Txb7bz2_0yITkgJjeG5cfg":{"text":"Start early and reserve a good portion of the day for this! A very thoughtful and immersiv","useful":0,"cool":0},"l5Qcvq5tGOWdImijgUe-gA":{"text":"I don't give many 5 stars but this is a great museum!!! I highly recommend watching the mo","useful":0,"cool":0},"81poic94MAAwiFLtXktUUQ":{"text":"Informational!! Enjoyed the experience, the highlight was the train introduction. \n\nI espe","useful":0,"cool":0},"vD8y8MqLcXQT3cR6-8JRtA":{"text":"This place was AMAZING! I have studied WWII for a long time and this was amazing! Some of ","useful":1,"cool":1},"nUhJqCrb-ZQspsW3FTBtgw":{"text":"Visited this museum a month ago on a trip to New Orleans and would definitely says it's a ","useful":0,"cool":0},"jSzBL7uORXF0LofRnnP9cA":{"text":"One of the top four museums in the United States.  Come pay respect to the greatest genera","useful":8,"cool":4},"ww_4X7pOjPswh_no1UgkGg":{"text":"While on a vacation solo in New Orleans I visited this World War II museum. I would have t","useful":0,"cool":0},"zgBRcvQd1fweQ3aISQQ7hA":{"text":"This is a must see! Originally opened on June 6th 2000 as a National D-Day Museum, in 2003","useful":3,"cool":1},"znsi-VFen6N3phBnWGhhWQ":{"text":"First things first - if I could live in a museum, I totally would.\n\nThis museum campus is ","useful":0,"cool":0},"e3ot98z8800ezwM2ABnkOg":{"text":"First of all, who gave this museum less than five stars? They probably don't like history ","useful":0,"cool":0},"02ActgQEBzQVANuffOU9uw":{"text":"The museum is well-organized, friendly and helpful staff. The information on the war is va","useful":0,"cool":0},"9ohgZ2QyFfBya3sVCJ3aSw":{"text":"The museum seems to be ever growing and they are adding more pieces to it all the time.  T","useful":2,"cool":1},"-JkLNWO26pRTN9Vv1K34CQ":{"text":"Awesome place to visit. Very clean and informative. They have WW2 vets there. Go while the","useful":0,"cool":0},"_5FWI6HuIYhXI4pS3QIKPg":{"text":"You can tell NOLA really takes ride in this national museum. \n\nOn entry, I was greeted imm","useful":13,"cool":9},"lITN8rv9PvmO9S3zeYpI6A":{"text":"Great museum. Don't spend your hard earned money in the The American Sector restaurant on ","useful":0,"cool":0},"2irkN-sphRgTprtq7V6v-A":{"text":"This museum provides little context and grossly skips out on non-American views. It really","useful":0,"cool":0},"dqUWByhyuehCSmvlQZIcnQ":{"text":"I thoroughly enjoyed New Orleans' biggest attraction. \nIt was extremely informative and ey","useful":10,"cool":6},"X-lucJak9kvbqdVDToZlvw":{"text":"This is really an excellent museum.  We spent over 5 hours and did not get to see it all. ","useful":0,"cool":0},"KoyZrVNRN8MQY_QWhW1R7w":{"text":"Large museum that covers all things related to world war 2.  Spent longer here than I expe","useful":0,"cool":0},"72PXjsRGNogrTXrks-lctw":{"text":"I'm not a history buff and I didn't visit the museum itself. I did watch Beyond All Bounda","useful":3,"cool":1},"J4-8kzmcWH7miwwc-_lYeg":{"text":"Wow! This is a great museum! It is made up of about four different buildings filled with i","useful":1,"cool":1},"6l_IYo7NbGPLmUqPq7ZyKg":{"text":"I have to say history bores me. I'd rather go to the dentist than spend a day in a history","useful":5,"cool":6},"8n-Gn-2saa4A0wDLLYBbEg":{"text":"I believe we can best achieve a sustaining reverence for the sacrifices that our men and w","useful":1,"cool":2},"m3OFpAhNqoghk3FfYahmvw":{"text":"Hands down the coolest museum I've ever been too. You could easily spend an entire day her","useful":0,"cool":0},"AybzRUQC_FoCUPXoa4Xm9w":{"text":"It's a huge museum spanning multiple buildings and floors. The \"train\" ride in the beginni","useful":1,"cool":1},"RC3T49Nb-GREgbOyNx2wmQ":{"text":"COVID-19 notes: While the museum has taken some steps to make its galleries safe (for exam","useful":6,"cool":0},"SKnzCgfaP2PGN6pFgSMFCQ":{"text":"Allow yourself an entire day for this incredible experience. It's so well done. For many w","useful":1,"cool":1},"B1niI796t1Qr2mqEePaC4w":{"text":"We came to New Orleans for this museum! My husband and young boys love history, especially","useful":0,"cool":0},"MOtTuoN7oIxez8dBexXhqA":{"text":"The most well laid-out, well-decorated and thorough museum I can recall...and one of the h","useful":2,"cool":1},"zDCoAh_Z6Xg951zIXHhbCg":{"text":"What a treasure! We really enjoyed our time at this museum. We spent about 3 hours and cou","useful":0,"cool":0},"aeQeaqdS8D_uveZmrIzXeQ":{"text":"I have been coming here since they first opened many years ago. I brought my wife here for","useful":4,"cool":5},"L0d1i157s4orVy1EHIg2GA":{"text":"As a service member And museum fanatic I can tell you straight up this museum is my all ti","useful":1,"cool":0},"eiIoPHItzytPPt2FOFsXPg":{"text":"A must see if your in New Orleans. Having both our parents that served in this war, it was","useful":0,"cool":0},"uv-OhGMbzPjUS5VMglo1Ug":{"text":"The National WWII Museum is packed with lots of history. Whoever created the museum did a ","useful":15,"cool":13},"YkBLGExEeEdsCHkLY_qHWg":{"text":"Had a great time. I learned so much. Please watch the videos and listen to the audio whene","useful":0,"cool":0},"pFMGPPlMdJDUzE-9BgZMRg":{"text":"Visited once years ago.  It was okay.  \n\nSecond visit was very different experience.  The ","useful":0,"cool":0},"afH2-rs-pq_FV-SAv4KTAw":{"text":"This is a great museum.  We were there for almost 4 hours and could have easily stayed lon","useful":2,"cool":1},"wO3SHsZ1u5gRS-D9UW8ZhA":{"text":"As a history nerd I enjoyed this place. They have one of the few remaining Enigma machines","useful":1,"cool":0},"nIpiS7CFRYUNnJaBsbdHwg":{"text":"Hello everyone!!\n\nSo visited this great museum with my wife and I am a huge fan of the his","useful":1,"cool":1},"Nb6niM7-tJmyQqgg1-FJ0A":{"text":"Incredible, a must for anyones but especially a young adult who will never be taught what ","useful":0,"cool":0},"6c4xhwIFWEDJlkAabkG4wg":{"text":"Super cool. If you're on a time crunch, this is not for you. I spent 4 hours there and sti","useful":0,"cool":0},"UCWB8rwVYtL6FrvO1Stphw":{"text":"Honestly, I don't even like history or would ever set foot in a WWII Museum... but my youn","useful":11,"cool":10},"oNriCE-5GBWNN5c9I8D6Zw":{"text":"Prepare to be jolted back in time to World War II and be thrown right into the middle of t","useful":3,"cool":1},"1_a1o0_oxCjAT10hozG9cA":{"text":"I'm a local, but I live visiting this museum.  The exhibits are amazing and the entertainm","useful":1,"cool":0},"23mij7uFmmw3ISzjFEUf3w":{"text":"This museum is pretty awesome. The photos I have posted really don't compare to seeing it ","useful":0,"cool":0},"Abo7Ho6frVMnk4x-QRsq4Q":{"text":"Oddly enough, this museum is what impressed me the most during my trip to New Orleans. I'm","useful":25,"cool":21},"FeC1w6-KTrCc_UNEVCPFOg":{"text":"We spent the day here and will finish it off tomorrow great place and will finish tomorrow","useful":0,"cool":0},"0hWLh1nT4GVjIo-vvyjbdQ":{"text":"ABSOLUTELY UNDERWHELMING.\nWe felt cheated out of our money.\nWe were so excited to finally ","useful":0,"cool":0},"cZUuIESTCxaVmMkVlvwraw":{"text":"*pre covid review*\n\n\nMy favorite museum to date. If you love history and learning about wa","useful":0,"cool":0},"SkuiqZA1lnIoAUN8feDu1A":{"text":"It had been a good 15 years since I've visited this museum. It has grown by leaps and boun","useful":0,"cool":0},"_62CQ2ZVUJb_Es-Gq1zfFw":{"text":"I don't know what I was expecting. This museum is curated towards a certain nationalist wa","useful":0,"cool":0},"3hNRJ8KUFjp8hcePVjd2bw":{"text":"What better way to celebrate memorial day than to visit the National World War II Museum?!","useful":1,"cool":1},"KJT_zq5Bqv-KoMyKWlLaUQ":{"text":"My husband and I spent 5 hours here and could have spent more! As a history teacher I was ","useful":0,"cool":0},"okDC0zCfCrUYkS3_RQRMHg":{"text":"The exhibits and models were very realistic and the environments drew me into the atmosphe","useful":0,"cool":0},"MLJ267q8JAmh4QfmpxGfHA":{"text":"This is one of the best museums I've been to. It's just very well done with lots of multim","useful":0,"cool":0},"VIetMXrdOqUZxGvROPJaLw":{"text":"Having visited several other WWII museums, including the Hawaii attractions, I can safely ","useful":12,"cool":1},"bcbbZVwGPUillSBQKQdjDQ":{"text":"So we came here for a world of history date. \n\nWhen we walked in, I kinda had an idea of w","useful":0,"cool":0},"tQOnQsqZkAPU9LliKnIU7Q":{"text":"This was an amazing museum! Everyone was nice and friendly. The 4D movie is totally worth ","useful":0,"cool":0},"jX7Brszf6sfTKg0mOVplaQ":{"text":"I wish I could give this museum more than 5 stars. One of the nicest, most extensive, best","useful":0,"cool":0},"k1azpZyftVrvimOarwM22w":{"text":"To truly appreciate this museum, take an entire day or break it up into a couple of days. ","useful":0,"cool":1},"hCp0ACDhMoMg0LO7AVHXIA":{"text":"Amazing is the word that comes to mind when talking about the National WWII Museum. So wel","useful":0,"cool":0},"rqDH4QAVWZlc-q2rfo6efw":{"text":"Man what a great tribute to these american hero's. A large place and alot to see. One of t","useful":0,"cool":0},"wXXIPT_5XjEOXDXWAWwCog":{"text":"It's worth seeing though it holds no candle at all to the Imperial War Museum in England. ","useful":6,"cool":5},"rkluB2tNBECv_5bW6b31rg":{"text":"A great museum, full of well-constructed and thought-provoking exhibits. Although it is sl","useful":0,"cool":2},"xMUMUdxLOz5e-DY4CqsAIw":{"text":"Larry Dembrun\nWWII Museum is very educational for all ages!","useful":0,"cool":0},"uT4WZlUc5vkc_pXOfmDQNA":{"text":"This place is overwhelming in size and content. I learned so much and I love history so th","useful":0,"cool":0},"hB8vuJKMsjMHMB6YPukSlw":{"text":"This has to be one of the best museums I have ever visited.  We happened to come on the D-","useful":4,"cool":0},"CFyPHoClTwqbdQBt0N7_eg":{"text":"Okay, if you like history, you like WWII, if you just like something cool. This is the pla","useful":1,"cool":1},"qS9x5AoGPQGN3BmT4A_WhQ":{"text":"The most comprehensive WW2 museum anywhere.  I recommend planning for two full days.  The ","useful":1,"cool":1},"3u0niCga7OMnTXWLYOMhVQ":{"text":"Wow, one of the best museums I've been to. The WWII museum is massive and it really takes ","useful":3,"cool":1},"qjTL1WxrYkva03kbNT7rsA":{"text":"Informative museum about what our country had to go through to rise from the 18th (in arms","useful":4,"cool":3},"TM3NdIEGDIC_qvScLwRb6g":{"text":"During WWII, the world was at war. (Strong emphasis on \"world\".) However, few films tell t","useful":4,"cool":0},"kyZW3YuvgylzNOJrxrvU4Q":{"text":"Excellent museum, had tickets at 11:30 and had I known how crowded it would be (my fault -","useful":0,"cool":0},"yp3jiSuu2H4LtVL_mfoYOA":{"text":"This has got to be one of the coolest museums in the US. The entire facility is so big you","useful":2,"cool":0},"tyRufGpVo37-QH8F7i5Lvg":{"text":"Never thought I could spend all day in a museum but I did! Highly recommend the movie it i","useful":0,"cool":0},"uK7ivld-HEGgr_PKMxH4Hg":{"text":"This museum is enormous! So well-done with a warm and welcoming staff who are passionate a","useful":0,"cool":0},"KHJoe7ckN-iBR_qaokZoiQ":{"text":"Wonderful interactive. Awesome staff food was pretty good. Loved the interactive questions","useful":0,"cool":0},"SXEnv-jUgV5xb1K-zE8GEg":{"text":"Incredible experience! \n3 hours and we hardly got through the eastern theater. The amount ","useful":1,"cool":0},"8nyfwGrtE7qHm7ECKHnWrg":{"text":"after a big fried chicken lunch we wanted to walk around and this place was the perfect pl","useful":0,"cool":0},"cMABJEXyEKffKhZ33WHcvg":{"text":"This was an absolutely beautiful tribute to veterans of World War II. Informational, inter","useful":0,"cool":0},"DhyhirwbWI-a3v1xBaQtFg":{"text":"Awesome museum for anyone who has had a relative serve in the military or just curious abo","useful":0,"cool":0},"FlZhoxACWVK1-fS4oaWJ4w":{"text":"I hate History but this place makes learning about World War II super fascinating! I was b","useful":2,"cool":2},"ae7wn4-jp6QXkj5YuVTvkg":{"text":"This place  is so amazing  one of the best war museums .every different  section campaigns","useful":0,"cool":0},"toT6cmMuArT6LRJ-4HRD-g":{"text":"Fantastic Museum, I spent the entire day there...","useful":0,"cool":0},"-i1OSDS9fAxMSWVcTM7H9Q":{"text":"Wonderful museum. Really great restaurant attached.  Takes hours to go through. Really tho","useful":0,"cool":0},"n-2YMZqRVqqSMGY_QricQg":{"text":"It was a really great experience! The atmosphere around the displays it was enthralling an","useful":0,"cool":0},"QINBZDRNzHbN1YEUUm9vqQ":{"text":"National World War II Museum -  945 Magazine St.,New Orleans, LA  Warehouse District\n\nMrs.","useful":0,"cool":0},"YUGM15W-CAeMTEiefRndIg":{"text":"A must see in New Orleans! I'd suggest leaving atleast 4 hours to get through it all as th","useful":1,"cool":0},"3Ga85dKtu9M8vkw77Wg7pg":{"text":"Our first visit here so signed up for guided tour and movie... Movie is a MUST see ! So Wo","useful":0,"cool":0},"YFo4_2L0wUYa4VzhKDWfWg":{"text":"While had some cool exhibits and videos, it wasn't organized as well as it could've been. ","useful":4,"cool":3},"jB9e5C1mm6PSrgQ9qsMYZg":{"text":"Words cannot explain the experience and the amount of emotion from being here. It really i","useful":0,"cool":0},"NqDMCkK4fC3vcVJdM5qGEw":{"text":"Excellent museum.  Extremely informative. It touches on every part of the war you can imag","useful":0,"cool":0},"pya2mJE0FiD5tZfJSo_Olw":{"text":"I have mixed feelings about visiting the museum. This was definitely at the top of my list","useful":0,"cool":0},"uy2X3iVbq2R_ASIBoVE6bg":{"text":"This place is fantastic if you're only visiting NOLA and have a short time to visit; or, i","useful":0,"cool":0},"hAZ3U37lx_KBhWditXNjtg":{"text":"Impressed by the many exhibits and accurate models. It was obvious that a lot of effort an","useful":0,"cool":0},"nV5d5DUUCUkNkEkGe8BCOQ":{"text":"KYLE on the customer service line was so helpful during the 2 times I called about using m","useful":0,"cool":0},"TlymxyfalBXArjhgITkfpA":{"text":"THought it was an odd location to have this museum in New Orleans, as I don't associate th","useful":0,"cool":0},"Ei4Pt7sjqf3LD-hvJif0uQ":{"text":"The National WWII Museum is a must visit attraction for tourists, locals, and everyone in ","useful":22,"cool":19},"b5Gh9rrFsJ5yGGsruzlDHw":{"text":"This is such a great museum. \n\nThank you for your service!\n\nUSA! USA! USA!","useful":2,"cool":1},"HqtXAbwovuhqQH8SLzPcRw":{"text":"Interesting that this attraction was voted the #1 tourist attraction in NOLA. Obviously th","useful":4,"cool":3},"2MfSxBe1PZPr2r75eePsUA":{"text":"I love this place!! Being a combat Veteran and a History nerd, I can appreciate what the m","useful":4,"cool":1},"sEb1EaiaNIFY87hMzkvEMQ":{"text":"Beautiful museum with fascinating exhibits, but they really need to limit the number of ti","useful":1,"cool":0},"aR-mzD-cBnArtG-bF6k7hA":{"text":"You've probably been looking at the other reviews talking about how massive this museum is","useful":3,"cool":4},"LLhSGOS2UeUEcpZjW8YOwA":{"text":"Designed very well. There are multiple buildings on this campus-like space. It takes up tw","useful":1,"cool":0},"Mdjt0dHzo_E3CBDI0AD31A":{"text":"It's been a few months since my visit to The National WWII Museum and I'm still catching m","useful":20,"cool":15},"5iRFm5D2iqh9yF-xJFpQqw":{"text":"This will be the reason I go back to New Orleans. I could not get enough of this place. I ","useful":2,"cool":1},"B6AShNxneHL2F2L-u3D8Kw":{"text":"I have been very into learning about WW2 for a while now, especially having learned that m","useful":0,"cool":0},"3giY_cGlHriU4uKeoZvJbQ":{"text":"This is a wonderful \"must visit\" for anyone visiting NOLA. Be sure to watch the \"Beyond Al","useful":1,"cool":0},"RO8ZuVMSrfsNBjX5MB7hdQ":{"text":"I was very impressed with this museum. The exhibits are great... and it's a good amount of","useful":1,"cool":0},"UaORqKNH2mfWYXxeIJZa2g":{"text":"Of all the Smithsonians, this one is pretty impressive. It spans several buildings, and th","useful":1,"cool":2},"Ga-dWLIDeqaft09-dTxdLQ":{"text":"World class museum that explores WWII in breadth and depth!  Physical displays are spectac","useful":0,"cool":1},"iWU5OrL_2DAH6H8Cgl4dUw":{"text":"Great museum.If you area a WW2 buff, you must visit here. You may know all of the facts at","useful":1,"cool":0},"5-Kub-V7cQmK2ERp5qEieA":{"text":"This place is a must see if you are vacationing in New Orleans or if you are a local. The ","useful":1,"cool":1},"8AQVGJ79a1G2KtJzbVZ4mg":{"text":"Not sure about all the positive reviews on here. I've been here twice now and it was awful","useful":3,"cool":0},"pGryaoGE5DB5d4mpwytbZw":{"text":"It's taken me a few years to write this review, but my visit to the National WWII Museum w","useful":3,"cool":2},"Xb3FaTkg3ElmUIw9k0bFmw":{"text":"A great option for a rainy day in New Orleans, especially if you're a fan of WWII history.","useful":6,"cool":8},"pxi2lSTzf5NL1VI1BqcBXw":{"text":"An absolute must stop when you're visiting New Orleans.  Take a break from all the wonderf","useful":19,"cool":13},"E21waNx8DF0FW0M9LYP33w":{"text":"This place is amazing for all those whom have an appreciatipn of American history and WW2.","useful":1,"cool":0},"S_8BIHLG69qlOJAi7TTiXQ":{"text":"AMAZING experience. So many artifacts and we really got a feel for what took place around ","useful":0,"cool":0},"wn8XoNRB8MZ6UVnaeZRQsQ":{"text":"With a few hours to spare before my flight home, I decided to check out the WWII Museum.  ","useful":2,"cool":1},"Hr4Pc4r2UB7cg9ftT2MgSA":{"text":"Great museum with so much history about the world war 2 events and battles. But there is s","useful":0,"cool":0},"RJCeDtTSq9RCVZjUqfV2yA":{"text":"A great attraction and museum down here in New Orleans. There was so many exhibits to see ","useful":0,"cool":0},"eEzce19AlM93DfjOPB5WlQ":{"text":"Our family visits every historical museum we can find, and we had heard wonderful things a","useful":0,"cool":0},"fGfo0QIozWMRJLxNUO_fAA":{"text":"This is the single most well-curated museum I've ever been to.  The experience is designed","useful":0,"cool":0},"_0zN5lK2v8QvGc6pvoddOw":{"text":"There is SO much to see here.  Both my husband and my families have extensive military bac","useful":1,"cool":1},"_1b9LndDF3NnR3W7d2GgUg":{"text":"I think most people don't come to New Orleans to go to a museum and learn about WWII. That","useful":0,"cool":0},"Ete7kZAFGAztgx_9Q19cpA":{"text":"Absolutely amazing! I don't want to ruin too much, but they have this thing called \"the do","useful":0,"cool":0},"xX45ZREAkM11IbpDYqKgmQ":{"text":"This was the 1st thing that we did as soon as we arrived in New Orleans and my son was sup","useful":0,"cool":0},"isMhmDc8_0ggOC7avr4h8A":{"text":"I am a History nerd and this museum is by far one of the best museums I've ever visited. G","useful":0,"cool":0},"MJ0ZyQgcHJy-aEDRMI_j3Q":{"text":"What a wonderful step back in time through history. The world war 2 museum is filled with ","useful":1,"cool":1},"K7E2dB-bvsAWcsenqVnoCg":{"text":"Was here for a night event. The venue has a perfect size area for my company to rent out a","useful":1,"cool":1},"QCirZJUdav06513pG6GP7Q":{"text":"There's not much I can add about this world-class museum. Whether you're a WWII buff or no","useful":1,"cool":0},"7GYUkvRhtGse-ZnCsliGvQ":{"text":"I've taught high school social studies for 10 years and used to frequent the D.C. museums ","useful":1,"cool":1},"luEGu0MakR9nCnKML-t8Mg":{"text":"The World War II Museum should be mandatory for children to attend sometime before they gr","useful":2,"cool":0},"xVdGuEns3ecDIv4pO28RUg":{"text":"What a great place to learn about WWII history and the cost of freedom! Plan to be here an","useful":0,"cool":0},"EQyocBzhC0H7plQ_-27OAw":{"text":"This has to be one of the greatest museums I have ever visited. \n\nI have to say, it's huge","useful":2,"cool":0},"ASUayLTtklHrQlJk76WnrQ":{"text":"I would have definitely never considered visiting a WWII Museum while on vacation in New O","useful":10,"cool":9},"kOurWkXjDmtTN-OO5Wb3xQ":{"text":"This is a large place with many videos from the World War era including some rather graphi","useful":2,"cool":2},"DrdQIAI4o7o_3jBFXhKdMA":{"text":"I spent 2 days here and only touched on what is available for viewing. As a history enthus","useful":0,"cool":0},"IssoGF62pdybNnjyPvbIPg":{"text":"Absolute highlight of the trip. Powerfully presented historical overview of the magnitude ","useful":0,"cool":1},"k_cySCTv3mFcZKTsA9w7tg":{"text":"Very informative and educational. The museum appeared clean. Only recommendation is not to","useful":0,"cool":0},"LQb0TLTQnTwxtvSmHPB6qQ":{"text":"The best place to go to in New Orleans. Excellent museum with a lot of detail regarding Am","useful":0,"cool":0},"9XtceZ3tzeX29f_i4yJcXg":{"text":"I did not plan on going to the National WWII Museum when we visited NOLA, but I am very gl","useful":0,"cool":1},"gad3eOVO7XX-OWVVep1f4Q":{"text":"Amazing!  I was in awe the whole time.  Allow at least 3+ hours.  There is so many exhibit","useful":0,"cool":0},"IgP6f1Shr-CfKoUuFbuwfg":{"text":"Incredible, worth every penny and it provides significant detail that will give you a grea","useful":0,"cool":0},"I4xrTwMDnhaYwBWof3ieyw":{"text":"Don't shortchange yourself. Make sure you give yourself an easy 6 hours to explore this am","useful":0,"cool":0},"wQd4ARP57GpzBkhh02rxdw":{"text":"Very informative and a lot of great videos to learn from. I learned so much and I'm so gla","useful":0,"cool":0},"o6yE8PoMkfewJCCSVVuomQ":{"text":"This museum is a must see if you're in New Orleans. The experience here is just phenomenal","useful":0,"cool":0},"9SZfBjz9UbujO3CgtaZYXA":{"text":"I have been here 3 times throughout the years and have yet to finish it! The museum is hug","useful":0,"cool":0},"CSc1Pik9nAjd5QgGyFrLPA":{"text":"Wow what an experience. My mother in-law raved about this place a few months ago, so when ","useful":2,"cool":1},"hNUYJQ5pU3V8yQK-n28TJA":{"text":"Visited the National World War II museum today.  The special effects in the exhibits were ","useful":4,"cool":0},"OIoLi5f-a5_85txSbvKKBw":{"text":"As a huge (HUGE) history buff, I can proudly say this might be the best military museum I'","useful":0,"cool":0},"gr0KsOL6nNRcSlxtayGRMA":{"text":"A must see while in NOLA.  We owe it to our veterans who served and continue to serve.  A ","useful":0,"cool":0},"YeP6dRhJTob52ZvBDRZyZg":{"text":"This is literally the best museum I have visited. Wife and I go here every year and it nev","useful":1,"cool":0},"9YmeppvDukWMInhiFMnHag":{"text":"4.5 \n\nThis museum is jam packed with personal artifacts, videos, and informational graphic","useful":0,"cool":1},"Z5oYUS-McKw7cl3IAQXy0g":{"text":"ONE DAY? HERE'S HOW I'D TACKLE IT:\nThis is a huge campus, currently housed in 4 buildings ","useful":14,"cool":2},"nn6xnjwGbYSIiqZmYbVQbg":{"text":"This museum is awesome! It is very humbling. I would recommend planning to spend most of t","useful":0,"cool":0},"opS7ci_fyQYVyMtieSLpDQ":{"text":"Truly a gem amongst museums. Plan to spend at least a day or so, I've spent two whole days","useful":0,"cool":0},"1C1Vk6nuqx4WOscfZ2HaIQ":{"text":"This was my first time going to a World War II Museum. It was captivating, to say the leas","useful":4,"cool":3},"MZOplk4ZbAVnWlZNkX-7HA":{"text":"This is hands down the best history museum I've attended. It starts with boarding a train ","useful":1,"cool":1},"mWprF6zGF5XKeUAjeGOYPA":{"text":"I have been here many times, and this is my oldest nephew's favorite museum, most recently","useful":17,"cool":16},"VfKAhx9AhV9RJ7ONwGMjiQ":{"text":"This place was so cool! The video they show you was amazing, powerful, and emotional. All ","useful":0,"cool":0},"tsHxXVJHc07s3wNnEOaUdA":{"text":"Had a great time here this is a must-see if you are in New Orleans. The exhibits are first","useful":0,"cool":0},"csGgz7rhL_V5YPnt3S8u9A":{"text":"One of the best museums in the country. We spent 5 hours at this museum. Very, very well d","useful":0,"cool":0},"t6fc6lfwQ4xyenqmhm0PWA":{"text":"Very interesting museum. Big place with lots to see.","useful":0,"cool":0},"qadtuOX0CmT74v5JMgo8bg":{"text":"This was my second visit here and I absolutely adore it.\n\nStudents and active military are","useful":2,"cool":2},"6df6nur-_Pz8LkA-yCUJVA":{"text":"This museum is a great reminder that we are not \"entitled\" to the standard of living we en","useful":0,"cool":0},"_EadDfvogpLRQzRTzPVFlA":{"text":"100% must stop. Breathtaking. Seeing Beyond all Boundaries is a must, as well. This could ","useful":0,"cool":0},"QBrALTnFGDaBarb7BuNUGw":{"text":"Loved this well-designed museum. I was impressed with the number of exhibits they had, the","useful":3,"cool":3},"HszWWMnBpDL5EXuuoDcZoA":{"text":"One of the best WWII museums that exists in the world. I have been a huge fan ever since i","useful":0,"cool":0},"MqqEPz2H1BUhXJDmBYOLVQ":{"text":"Worth the trip. Plan at least 4 hours and learn a lot.\n\nA great deal of history and a bett","useful":0,"cool":0},"DBs95LAugZXKEqmofnreJw":{"text":"I'm so glad we visited on Veterans Day. This museum is huge, there is so much information-","useful":0,"cool":0},"8BCd6FzAlAAzO7I9JCddig":{"text":"**ONE OF MY FAVORITE HISTORY MUSEUMS**\n\nAs a history buff, this is definitely one of my\nfa","useful":25,"cool":25},"XcJ5JTY-oe0UE8QpnNCJ5A":{"text":"I generally don't like museums at all but I enjoyed every minute of the 4 hours we spent h","useful":2,"cool":1},"T9YJZUfERBHB3Bv1ovY7BA":{"text":"This is a wonderful museum experience! My daughter's HS history teacher heard that we were","useful":1,"cool":1},"HbbQfZ4hnDc6AhteD57wcQ":{"text":"An amazing collection of both stories and artifacts. If you really want to experience it, ","useful":0,"cool":0},"Gg6wFsb8h-cnbjKAXTvJOA":{"text":"I loved The National WWll Museum. It is huge and if you want to see everything plan on spe","useful":64,"cool":63},"tGrmHcS-0f8gB2jgEnMP0g":{"text":"This was my second time in NOLA and I finally got to see this museum. Very interesting. I ","useful":2,"cool":3},"IlqDrQ2ruu7DsI0lgfpGag":{"text":"Overdue review of the Greatest museum this side of the Smithsonian! Spent most of a day he","useful":0,"cool":0},"7PQxiWr8pN1H7lB-MyQnng":{"text":"A chilling, informative, and overall humbling experience. The \"Greatest Generation\".....","useful":0,"cool":0},"z7V3kQUOU-mfyZ6zTihS4A":{"text":"Spent the day today at the National World War II Museum in New Orleans. This museum is rat","useful":2,"cool":2},"8T1kq5LuMsquwlbjkAf6hw":{"text":"One of the best museums I have ever been to! This conveniently located museum on Magazine ","useful":1,"cool":0},"uNncdka_THmU2zbeKp6hSw":{"text":"I do have to say right off the bat that you are getting your money's worth at this museum.","useful":2,"cool":1},"BufxyfJyamybtm-GDCw7aA":{"text":"This is honestly one of my favorite places in the whole world. We had our big Yelp soiree ","useful":2,"cool":0},"zMV1eaG6it9CFGdX48NedQ":{"text":"Wow this place is stunning!  Normandy exhibit was exceptional and I learned so much.  Grat","useful":0,"cool":0},"6F12ZzNO0T7lPfau0LaEEA":{"text":"By far the best museum I have ever been to. The museum is curated like a movie set instead","useful":1,"cool":1},"bdGGhew4RYPwDjgZ2Ttn6Q":{"text":"Utterly amazing. \n\nThe time and effort used to put this place together is second to none. ","useful":1,"cool":0},"SDke5N7KoiWO76g2VR-WjQ":{"text":"How you enjoy this will depends on your personality and attention span. I have a short att","useful":0,"cool":0},"nt4TRRcYrItw8IFjZ1-JUg":{"text":"This museum was very immersive, educational and  the attention to detail is outstanding. \n","useful":1,"cool":1},"cNfijEhw0u7iXajGF2Xy9g":{"text":"This museum was so well organized and put together. It begins with you receiving a dog tag","useful":0,"cool":0},"1lfqRonKfaWXPaHvxDRHFg":{"text":"I love historical museums, and was excited to experience the WWII. My experience was prett","useful":4,"cool":0},"pXnl4_PaVF269q6ZhmNHVA":{"text":"This place is huge and full of information and military trinkets in the gift shops. I am n","useful":0,"cool":0},"Dc4q8X1o_FtpaW7YjEbDfQ":{"text":"Definitely a must see! Admission is very reasonable. The museum has a lot of exhibits. The","useful":65,"cool":58},"uEYSBACokcl67BZAohsblg":{"text":"Awesome museum with interactive exhibits. Great student discount and learning opportunitie","useful":1,"cool":1},"6w6MhpoDt9lAcJCYwv8Hnw":{"text":"Great experience! Plan to spend at least 4-5 hours hereI highly recommend the $7 4D movie,","useful":0,"cool":0},"c6zNGoHoXjm9J3dFWl5Vsw":{"text":"Wow! My father and husband are history buffs so at their urging I spent a Monday alone her","useful":1,"cool":1},"bgJoreVQqENvPxYd66q3VQ":{"text":"Amazing museum!!!\n  My nine-year-old twins repeatedly exclaimed, \"I love this place!!\" (Th","useful":1,"cool":0},"D01ZKxNfHsbnnZNWmOI8EA":{"text":"Beware the rude staff. Just upon entering, the person who checked our reservation was very","useful":0,"cool":0},"YksL09kmtVHjqpMgXEZzNg":{"text":"Amazing Museum!  I have been to many in my life and this one is one of the best ever.  Exh","useful":0,"cool":0},"xjWLAHxpGd-KjluDDltoRQ":{"text":"For anyone with an interest in the history and events surrounding WWII, this is a must do.","useful":1,"cool":0},"ECaPPbS_KUszc24bwblLlg":{"text":"My husband and I visited the WWII Museum on a recent trip to New Orleans after hearing a l","useful":4,"cool":3},"TCELfrDCGjm9rmH_OXWnUA":{"text":"The World War II Museum in New Orleans is one of the largest museums in the country that c","useful":7,"cool":7},"nrv-HTy-m_jwr3uKfF8ZGA":{"text":"This originally wasn't on the itinerary for my NOLA trip, but I'm so happy my friends and ","useful":0,"cool":0},"_M6N9ifXY9kv1GfXnOZNjg":{"text":"This museum is a must see! Very well thought out and informational videos about each part ","useful":0,"cool":0},"3iE9vdrUrC3Bn4vqzFrGhg":{"text":"Museum 2 for 2020\n\nThis place is a time capsule. You step back into a time literally witne","useful":1,"cool":0},"hdYGOR5-9Y_n8SIMzSJOSg":{"text":"It's tremendous. Having teenagers, we felt it was a good time to take them to the museum. ","useful":0,"cool":0},"xCHv_sOTPHl4uFLjvj3aDg":{"text":"A definite must see when visiting New Orleans. \n\nWhy was New Orleans selected for the Nati","useful":1,"cool":0},"4B30RrgGrVnAHPCCVGYZkw":{"text":"Only 3% of them are still alive, and 350 of them die every day. \n\nWho are we talking about","useful":12,"cool":10},"co41CEyU_WCo5wfc_smqdw":{"text":"Highly recommended, for anybody! such a  great experience into the history of our role in ","useful":0,"cool":0},"hu_iqJHc03MTFQn3OdlJZg":{"text":"Amazing. The Tim Hanks video and show was so touching. This place is huge and filled with ","useful":0,"cool":0},"NPcshMdBJDulRSf64HXyeA":{"text":"Happened to visit on June 6th 2021 and of course the museum was packed. The staff are frie","useful":0,"cool":0},"dhCKcbqLpxwxn11RIUureg":{"text":"Somber feeling. Rich in history. Multiple buildings, lots of reading, pictures, artifacts ","useful":1,"cool":2},"WYtNMsqoDpQ0F1aRPB-YLA":{"text":"We completely lost track of time and spent 4 hrs here.  So much information.  It was fanta","useful":0,"cool":0},"RGhAt6pbciN1MkGlRqi5hw":{"text":"As a veteran, visiting the museum was a \"Command Performance,\" in other words, a \"must\" vi","useful":2,"cool":0},"L_Rtq_tWpq9oNMf46NcRzQ":{"text":"Wow! This museum will pluck you out of your reality and place you back in 1939-1945. Every","useful":0,"cool":0},"a9Ez7J63uEJ2ShI-jmtr6g":{"text":"Great museum!! A must see when you are in New Orleans. Plan on spending 4+ hours at the mu","useful":0,"cool":0},"fJlg5Rjaji6Wh1B4E8zLgw":{"text":"Every American should visit. It takes a day to do this museum and it's worth it. I'd say k","useful":1,"cool":0},"FN8f4Tl5Yq5SPhpJJmmw5w":{"text":"Very well organized and run museum and a must for any history lover visiting New Orleans. ","useful":0,"cool":0},"sltCQA0J-Tyj-f2fPrJvZA":{"text":"my friend wanted to go here--not high on my list--but I did have family members in the war","useful":2,"cool":0},"IQvfD6eDHyGFru4jiTcn5Q":{"text":"This place is truly amazing. If you're a history buff this is the place to come. I haven't","useful":0,"cool":0},"77ECKOttY2vg76Dwhsec0A":{"text":"Really just a wonderful museum. I'm not even into history but I found it quite interesting","useful":1,"cool":1},"y5SXo1wtpKKyLuiOg2YwZA":{"text":"This museum is absolutely massive! There are six buildings all jam packed with information","useful":0,"cool":0},"MMumfV59Rgm-tIDx3-QS3A":{"text":"The museum has added a LOT more to their collection and it seems to be ever growing and th","useful":5,"cool":3},"q_FPuu9p1DwLX64DSML3rQ":{"text":"We had heard from several people how good this museum is so we went. We were very disappoi","useful":0,"cool":0},"TcGtbFQ6k0UUVHBid4l9pw":{"text":"Bring tissues.  Lots of them.  If you have any heart at all, you will cry at the National ","useful":3,"cool":1},"0G-PcPkveWhGE4dPtwixQg":{"text":"Awesome experience. They took care of service members here, were very accommodating. As fa","useful":0,"cool":0},"YkCixhlSPQmBuHw-qBCgBw":{"text":"The pictures don't do it justice. Much better than I expected. The museum really tries to ","useful":0,"cool":0},"jZwozGYHcBn-zm-7uREChw":{"text":"A must see when in New Orleans! It's so well done with an attention to detail that will le","useful":4,"cool":4},"jm17QS4UqEvW_NS4Z-NTmg":{"text":"This museum is definitely worth it but I'm giving 4 stars because I wish it was more inter","useful":2,"cool":1},"ggjAatyAxuh6O7H9nocFfw":{"text":"Wow, you know - I'm not even into museums and I thoroughly enjoyed my experience here. Unf","useful":2,"cool":1},"-zNmhaqDipX3gh1rERVAww":{"text":"Fine museum for the exhaustive coverage of the history of the war. But no post war perspec","useful":0,"cool":0},"ZRRKm28ioz-kWE3P8bWCng":{"text":"I wasn't sure whether or not to add this to our 'to do' list while we were in town.  For o","useful":2,"cool":0},"9G8D6ZIslJVHn1w46ODDGA":{"text":"Plan for more than one day. Wonderful experience. The folks at the museum are very nice an","useful":0,"cool":0},"q2Gx6G6rIZnJUm1pWebn5A":{"text":"Outstanding in every way. My 3rd trip and it has been completely different each time. They","useful":0,"cool":0},"K5ejz5gAH8Q86-4xs-qZ_w":{"text":"A must visit museum in NOLA. For someone who don't usually like to go to a museum, this pl","useful":1,"cool":1},"M6Mf5oqZ8BJDIT65D4h5_w":{"text":"Outstanding!  So glad we chose to do this.  We did the full day and included the movie and","useful":0,"cool":0},"jh8N2IOx3Dmsoc0ra74NiA":{"text":"Perhaps one of the best museum experiences I've had. From the train ride, to the palm tree","useful":1,"cool":0},"PlMOd2f8_VszpqM3G8EVJg":{"text":"A stunning visual and emotional adventure throughout the most pivotal moment in world hist","useful":4,"cool":1},"QaqDP3fqHg9nrvazNT-MpQ":{"text":"Place is  amazing. Should be a requirement for every citizen to come here at least once an","useful":0,"cool":0},"ysivk82yzCgYZ_UJEuE3Xg":{"text":"I could have easily spent my whole day here. There are buildings upon buildings of exhibit","useful":1,"cool":2},"ppVLUBViTQ9w5Ec0monpXA":{"text":"Wow! I would consider myself a huge history and military fan. This museum truly tops all t","useful":2,"cool":1},"qntCY0em6q2XJi4EBy9IvQ":{"text":"All I can say is Wow. This museum exceeded my expectations by miles. There is so much to s","useful":1,"cool":1},"mVCecMi4jm3oUWGC9rn-rg":{"text":"Four hours, easy. Even if you move quickly through the exhibits, you'll need a good four h","useful":14,"cool":12},"JJbMcghbNKzgLEZdEywFUg":{"text":"AMERICA! FUCK YEAH!!\n\nSeriously though, this museum rules. The volunteer guides are awesom","useful":4,"cool":4},"OWEjvbTImbu4UfVgVsg8nQ":{"text":"Loved this museum! We had been wanting to go for a while and finally seized a day off to g","useful":1,"cool":0},"i1mNEyfNlfodcBQry0-zTA":{"text":"This museum is actually a complex consisting of a movie theater, an administration buildin","useful":2,"cool":1},"iem9NqBb3zWOBj88c1GFbA":{"text":"I'll throw in another positive review for the National World War II Museum.  It was a blis","useful":4,"cool":2},"steFJUiGlZh43gIoJECh-A":{"text":"Order your tickets online and pick them up at Will Call.  No reason to wait an hour in lin","useful":9,"cool":7},"hin_Mt2XWK-NyoZjscaErQ":{"text":"I'm a big history buff and was a bit disappointed with the experience.  The whole complex ","useful":0,"cool":0},"WpBD-0dPZTd4Tjq8A86YcA":{"text":"For history lovers, esp WWII history, this is a neat spot. It's a lot of info to take in b","useful":1,"cool":1},"6AaDBU_0drCSzXqwWpFvxg":{"text":"This museum was a great stop to kill a few hours in the afternoon. First if you haven't se","useful":1,"cool":0},"K2Su-uP4WZ85mCn_MxNQxQ":{"text":"This is a must see for everyone. World War II was such a significant part of American hist","useful":4,"cool":2},"ocM0kOYLvzJSdbRD1XOSzA":{"text":"Visited on November 9, 2021. Was a bit skeptical about coming here but figured my 3rd time","useful":1,"cool":1},"lZMqXb3uShI1Fvb2tkpMtw":{"text":"Great museum with many interactive experiences. Especially enjoyed the Tom Hank's 4D movie","useful":0,"cool":0},"yPgaZtThHIShdJLxj7d6UA":{"text":"The is a great museum for any WWII fanatic. Set aside a few hours to make sure you are abl","useful":0,"cool":1},"uQ5lUc2REugtv60-UL17zw":{"text":"IMO, \"a-ok\" is the right rating for this museum. \n\nThere's much to enjoy here but to be ve","useful":6,"cool":3},"CRm7tCnKRNdP263ZMivcjw":{"text":"The National WW2 Museum is the most engrossing and best designed museum I have ever visite","useful":1,"cool":1},"9E4MDcoTFB6ifP0DtfK4Cw":{"text":"If you have an extra few hours in NOLA, the WWII museum can make your trip very well round","useful":1,"cool":0},"UY4Doiszs1DoEZNwGaxmRw":{"text":"I am not a huge history person. It's not something that really grabs me. But my boss is su","useful":0,"cool":0},"W9a80h7qpSYohGrL9irgmg":{"text":"They should rename this museum \"USA was Awesome in WWII\" and drop flag confetti from the c","useful":5,"cool":0},"9Ptt3HCEA_Xuv1T-Wcb1Qg":{"text":"I've seen this museum, for years, and never had the time to stop in to see it. It's truly ","useful":9,"cool":5},"-X9tOgOclcUXHcF7nKaYZA":{"text":"Wonderful experience- Worth a stop!! Absolutely beautiful museum. Some rooms are incredibl","useful":0,"cool":0},"eaDcpe4-GM1pXN8jjb1vAg":{"text":"This place was amazing! I would have never expected a 4D movie like this in NOLA! I couldn","useful":0,"cool":0},"a3ngL4xImG5iZ8eNbN2hNw":{"text":"I have done a great deal of traveling and visiting historical sites and museums. I am also","useful":1,"cool":2},"10xluwT2_47V3oHp3VyW5w":{"text":"Extremely overwhelming, way too much is placed in one room. Such as multiple TVs playing d","useful":0,"cool":0},"1E6LlBi1lBS9qDC4BHXAPw":{"text":"Huge museum very well done as far as artifacts and interactive exhibits and films.  There ","useful":0,"cool":0},"PSwRjWOXMOmIiegXiPKQ0Q":{"text":"This is a must see museum. We started out by seeing the film Beyond All Boundaries. It's a","useful":1,"cool":1},"qTKgaGugdFjbjz56-mCReg":{"text":"I am no history buff by any means, but happily tagged along with my hubby. From that persp","useful":8,"cool":8},"YmFV0pSTWXK1LWdt4Gd_fw":{"text":"I learned I should have told my daughter about the holocaust earlier - she spent 1/4 of th","useful":1,"cool":0},"Dk-0n1jS6rSqkr1C6NgGXw":{"text":"Despite ordering and paying for tickets online in advance for both general admission and t","useful":0,"cool":0},"3ZLHL9TeyYenpbWHEmabHg":{"text":"The BEST WWII MUSEUM IN THE WORLD. I learned more in the day I spent at the museum than I ","useful":0,"cool":0},"DNbWWT_9OeghEvQI-bTVfQ":{"text":"It was deeply troubling to be in a museum dedicated to national sacrifice yet there were s","useful":0,"cool":0},"Bbwhj_b6QEXdBbDR7HCIdw":{"text":"The museum is a must see in my opinion if you are in the area. I don't think you will find","useful":19,"cool":18},"Sc_xod0vLsauBAOm2_PCBw":{"text":"This Museum is constantly changing and provides amazing insight in to WWII.  Not only the ","useful":3,"cool":2},"1FAowdLMlt5KZ5_cD8SfJg":{"text":"What an incredible museum. This is probably the best, most organized and planned out museu","useful":5,"cool":2},"Tsj6K6hLZ7RzchujvlNnvA":{"text":"A great experience for history lovers, military supporters, service members past, present ","useful":1,"cool":1},"jy0AKgOfbsGzacf7_0ARIw":{"text":"I'm not sure how often high schools take their field trips to the Nat'l WWII Museum, but t","useful":2,"cool":1},"5Im9i42uphPXBnaw1AdL3A":{"text":"Really enjoyed the museum. I thought the layout was great especially the pacific and Europ","useful":0,"cool":0},"j7anTYJCy0NBdzTh4dPeQA":{"text":"What an incredible experience. the National  WW 11 experience. Just starting the tour. Jus","useful":7,"cool":3},"GYOXxOU59TUWRbVgy4I0Dg":{"text":"Where do I begin!!! This was the highlight of our entire New Orleans trip! It's just amazi","useful":1,"cool":0},"_5LSv-HO4EHT0PG5shiWKA":{"text":"This is one of the best museums I have ever been to. My only complaint is that it is so in","useful":1,"cool":0},"l9yUuZFne1GATaQY_vRP6g":{"text":"We spent half day at the National WWII Museum at New Orleans, days after visiting the Alab","useful":0,"cool":0},"D_iPbCTj9M7qAcvT1xWlRA":{"text":"I'm not a huge museum fan, but this is a museum that I had been meaning to visit in my las","useful":3,"cool":2},"U_gM9SogGiRAmYeVKBg1KQ":{"text":"This museum is really well-executed. It is no surprise that Congress has poured money to f","useful":3,"cool":4},"ok3FjtogkinMPiLo_UOrYg":{"text":"We recently had the opportunity to bring my father, a WWII vet, to see the museum.  As he ","useful":0,"cool":0},"KeOGb-BRszVMRa7zfLedmw":{"text":"Made sure to stop by the WWII Museum while we were in NOLA. The museum is very thoughtfull","useful":1,"cool":1},"atMEcNaaaZnUpEHvZXHeQQ":{"text":"At the risk of redundancy, I'll add my well-deserved five-star review to the list and just","useful":23,"cool":20},"twvcxE0-9IG3zIav9GhUIA":{"text":"I didn't even know they had a WW II museum in New Orleans until my LA native seat mate on ","useful":3,"cool":1},"-LdjSl13XMYtwtDDn8wfPQ":{"text":"WOW!!!!\n When traveling to New Orleans The National WWII Museum has to be on the list of t","useful":2,"cool":1},"41IMAOwb9Tpqbq8xL6iq7A":{"text":"Wow. If I could give this place 10 stars I would. \n\nWe decided to include this as part of ","useful":4,"cool":1},"RSTEi8B0Rg7JRMTw3DUgtw":{"text":"No visit to New Orleans would be complete without visiting the wonderful National WWII Mus","useful":6,"cool":3},"mQTakY4SIEihITO8y_eRMA":{"text":"I loved this Museum.  I spent 5 hours here and could have spent more.  I do not think the ","useful":4,"cool":3},"jpUf0ugt-Gyno9gbdAOhpQ":{"text":"What an incredibly humbling experience. Although most of us have a general idea of what ha","useful":3,"cool":1},"x_qxtVWBoR-Xpiv5luyv5Q":{"text":"A must to visit every time I'm in town. Wonderfully done and very humbling. \n\nEnsure that ","useful":2,"cool":1},"pguD3vY5RznBvem7FPiahw":{"text":"I'm so glad we went to the National WWII Museum during our stay in New Orleans. This museu","useful":4,"cool":3},"PFz3jn8147Af-60APQV64A":{"text":"I took my uncle to this museum on his last visit. He was a marine and my grandfather along","useful":0,"cool":0},"4xSWxqvfkHAgHtflSfXEfw":{"text":"An amazing place and a great thing to experience.  Super education and interesting. There ","useful":3,"cool":0},"6TFHHeilWCO2wqSEiN-B-Q":{"text":"First off, let me say a few things.\n- I am not a history buff\n- I don't typically like mus","useful":8,"cool":4},"JB0uVM6i4L-oxFaWTLOC0g":{"text":"We decided to take our family of 5 to this museum on one of the days of our visit to New O","useful":0,"cool":0},"jVRWKr5LOPWjY0ap5ppeUw":{"text":"Really cool and informative museum to visit.  I had forgotten soooo much since my high sch","useful":0,"cool":0},"srTJllvJqwy94YqcYI8qgQ":{"text":"Plan to spend at least 4 hrs here minimum. The museum is well curated and filled with arti","useful":3,"cool":1},"uGK6Yl4I9jVBkS2gYmQbDQ":{"text":"What a moving, emotional visit to this museum.  Recommended by many of my friends after me","useful":1,"cool":1},"xrfJUH7ZD9IRv_e3sbPdcw":{"text":"I cannot recommend this museum more! What an incredible and comprehensive display of the y","useful":0,"cool":0},"8Y-0U2zUadNBsBss-T2eKQ":{"text":"I don't think anyone can say enough great things about this museum. I was in charge of pla","useful":3,"cool":1},"S-OX5WVZ1DntD2yUau6t7Q":{"text":"Wonderful Museum with lots of informative videos showing and telling you what is also writ","useful":0,"cool":1},"Huey9NaDQ-ONqJe2LGTgOQ":{"text":"Multiple friends recommended this museum before we arrived. I am not a huge fan of museums","useful":1,"cool":1},"Qgny4_Cf-P8yj2zQkG4tfg":{"text":"WOWWWWW! I've been four times now and each time I see something new, different and moving.","useful":2,"cool":1},"qQfGCKwqYjLbWnWTIv8GAg":{"text":"This is a good place to take the kids. I have read dozens and dozens of books about WW 2 f","useful":3,"cool":1},"II6Jka1Hr10Kv9zJXq8GDQ":{"text":"I learned so much from my visit! I wish I had more time to explore. We watched the movie a","useful":0,"cool":1},"eG88HycGFgxaM5DqGRx7qg":{"text":"Overall:  Well done museum that is worth the trip, time, and money.  My colleague and I sp","useful":1,"cool":1},"5qaO_ULyu-_TFHTj3TMjHQ":{"text":"Experience the war that changed the world through this museum. It really allows you to con","useful":10,"cool":10}}