{"kZ4wZdiVWtq3au-e0A8-hw":{"text":"I couldn't have asked for a more stress-free move. These guys were awesome. Because of ext","useful":4,"cool":1},"mk6jE5NCS2gjEXi-YqXPQg":{"text":"Nice Guys Movers just moved three rooms of my house in under two hours. Great service and ","useful":1,"cool":0},"K-CzE7D505N3W1sHvRFe7Q":{"text":"They live up to their name. Personable, professional, and punctual, I definitely recommend","useful":1,"cool":0},"vKWHJ1fxRu6yhXU9v0MVaQ":{"text":"Edgar came out and carted away 6 months worth of a stressful move and now I don't feel lik","useful":1,"cool":0},"qF_ONU4BiHkcF2p5BipqyA":{"text":"Very impressed with this moving company! Two days before my scheduled move, my Fiancé was ","useful":3,"cool":0},"c-bpLbVWfzSthOBiy1HNmQ":{"text":"Edgar and his team at Nice Guys Movers are friendly, professional, easy going and a total ","useful":1,"cool":0},"NnwTRtqpmaUQvMDS_BfwyA":{"text":"I just can't say enough good things about this company.  They were prompt, my move started","useful":1,"cool":0},"gH9YNc5q_o27ylO7YBFkhw":{"text":"I highly recommend Nice Guy Movers. They were efficient with the moving process (careful w","useful":1,"cool":0},"bmfC9yXEhWe1U5j7NeHD8Q":{"text":"Edgar quoted us time for the move that was about half of the other movers I called  .  Our","useful":1,"cool":0},"k9dHCPzUzWxx83xkFTOfgQ":{"text":"They were scheduled to haul away my old sofa on day 1 of the Sneauxpocalypse.  Weather pre","useful":0,"cool":0},"JXSBvmovTPREAPMcI8QKKg":{"text":"Moving sucks, but this move was as pleasant as it can get due to Nice Guys Movers. The guy","useful":2,"cool":0},"_rFrTEiB4jwNd3AO3Jxceg":{"text":"This moving company couldn't be more aptly named.  Truly nice guys.  Courteous, fast, and ","useful":1,"cool":0},"6cuxx5-tbTyPTEckCjFTSw":{"text":"Out of all my experiences moving, this was hands down the best experience I've had. They w","useful":1,"cool":0},"52AXkQylKLLnZV8iINu2pQ":{"text":"These guys were so nice and extremely efficient! Nicely priced. They had my one bedroom (o","useful":0,"cool":0},"yWSL5qo9NFMddSFVpRUthA":{"text":"These guys were the best movers I have ever hired! I called the day before I had to move a","useful":1,"cool":0},"s6N-i4kskVOiMnzybUpBQw":{"text":"Edgar and his crew were friendly, professional, and extremely efficient. He quoted me thre","useful":3,"cool":0},"_TuzjKlJ3TLvkCyTlEgcsQ":{"text":"Could not have had a better experience. The two movers were super friendly. They worked qu","useful":1,"cool":0},"W8fp9AorbS1coQl4Mup8xA":{"text":"Edgar and his crew were not only \"nice,\" they were downright awesome! We were originally s","useful":1,"cool":0},"KRHCKIen2GzH_l_sEmSfYQ":{"text":"I ordered a sectional couch Monday night, and needed it to be delivered to be residence. I","useful":2,"cool":1},"i4VW9BwbRZ355ajNMkXkJA":{"text":"Edgar and Don are terrific!!! If I could give them more stars, I definitely would. Edgar i","useful":0,"cool":0},"qFoUd-EK78v0_Sn1tkyZ6A":{"text":"These guys are LIFESAVERS. They were extremely flexible when I had to change my moving dat","useful":3,"cool":0},"EryU1upWwmcyL80u71sRJw":{"text":"The sales call was amazing.  Then it went down hill, fast after that.  They missed a confi","useful":0,"cool":0},"5GJETSV4Uh5bPoOEW-T8Rg":{"text":"Edgar came to my house to give me an accurate quote, and I stupidly chose Precision Movers","useful":4,"cool":0},"NNCHonybZGhvJvpjDjWmHw":{"text":"Edgar was amazing! Made my move such a breeze. Professional and got the job done. Made the","useful":0,"cool":0},"-PxBxHhBHT1q8QItyPZD1g":{"text":"These guys are the best!!! They were prompt and very nice and professional. They moved me ","useful":1,"cool":0},"OlUb4lBrNJqcd8ySSob74Q":{"text":"They were punctual, efficient, and polite. Made our move easier. Definitely a 5 star servi","useful":0,"cool":0},"5u-sF81gaTm3wbd5o1S8Dw":{"text":"Don was fabulous. We moved an office over the course of a day and everything was done prof","useful":0,"cool":0},"_flsPO9GKqfBXIwznOTR6A":{"text":"The most important thing about these guys is that they're 100% business. It's great to get","useful":1,"cool":0},"aLvjjAdHxuqwCgh4ME3Q0Q":{"text":"They do truly live up to their name. I recently hired Nice Guys to unload a POD container ","useful":1,"cool":0},"sIZI5gm4pzclQdsIZYGanA":{"text":"We have used Edgar and Nice Guy Movers twice.  Once for a biggish move from one end of upt","useful":6,"cool":5},"uqcuqgqpy9ke1U935o4Olg":{"text":"These guys were everything I want in moving labor. We had all of our boxes ready to go and","useful":0,"cool":1},"3LNSqXgAWG87T69RKIOO6Q":{"text":"We are so glad we hired Nice Guys to help us with our move. They arrived right on time and","useful":0,"cool":0},"5wyXMpbgmfY8wudchkQHKw":{"text":"This is a great moving company! The movers (Bobby, Chris, and Edgar) all arrived on time a","useful":1,"cool":0},"Id9uPLi69xxt5ckGw-7kww":{"text":"They showed up 10 min early, worked efficiently and were very careful with nice and valuab","useful":0,"cool":0},"tsshz4nYJULXlc42mXC6rg":{"text":"Edgar and his \"singing\" crew were amazing.  We had to re-schedule 2 times because of the r","useful":0,"cool":0},"4kcPDBlpq8ELnTuLx658ug":{"text":"Everyone was nice, so their name is correct.  However, the movers scratched our 5 month ol","useful":1,"cool":0},"kb-EuYVCsIwy28K8oGAhog":{"text":"If I had to pick three words to describe these guys I'd go with timely, efficient, and kin","useful":1,"cool":0}}