{"mDjngIfRTtAeDmJXtMC1Lg":{"text":"I was there this past Saturday evening around 7pm with two others. One of us ordered the s","useful":1,"cool":0},"QHBpvzQQtUcsq_x4dY2DUQ":{"text":"Love the food , service is great and the atmosphere sets the tone for a great time . I lov","useful":0,"cool":0},"nYjKh9u4lzlJERMIgGG44Q":{"text":"I really did forget this place reopened until I started searching creole food. I really re","useful":6,"cool":6},"6fuPQ-UgCJfBiTCpsvaE6w":{"text":"The gumbo was very .  The fired shrimp platter was delicious as well, but the portion-size","useful":1,"cool":0},"zHhPSC63SOsBpNmSD8DJ4A":{"text":"Stopped for brunch. Ordered chicken & waffles ($9). The chicken was really good. It came o","useful":3,"cool":2},"dbSbNufy_xCI1v4EJ9QJwA":{"text":"In town so I wanted to try the best of the best.  This place was recommended so we stopped","useful":1,"cool":0},"bEqEbLkQuqkM9Ry6CSvE-A":{"text":"This entire experience was a Major Disappointment. 1st with No party ahead of us & empty t","useful":1,"cool":0},"oddWPxWhkZuGGBx9puwwQQ":{"text":"Enjoyed a delicious and very substantial lunch of Lima beans with shrimp and fried drum. T","useful":2,"cool":0},"YnB28e4CQDU9PU8kjnttsg":{"text":"This was my first time here. Food was absolutely delicious. Gumbo seasoned just right. Hot","useful":4,"cool":1},"YMLKKGVHe_nIL95jxCKrpQ":{"text":"We got grubhub to deliver from here. The food was really good. But the red beans had spill","useful":0,"cool":0},"IDSObUMnGhEiVfwp90Cdfg":{"text":"There are very few restaurants these days where you can get fried chicken that has been pr","useful":0,"cool":0},"Stbe7UC6ZfP0GVqImCEYFw":{"text":"Came here on a recommendation. Food and service are decent. Decent prices. Available menu ","useful":1,"cool":1},"duOXT_rp12zXv3OABLZFyw":{"text":"Tues Aug 20, 2019... We ate at Dunbar's using a Groupon... No hiccups. Wait time was avera","useful":1,"cool":1},"Z8tO_5Mv1ZXCt1Ye8WWp-Q":{"text":"Just as good as it always was. I had the red beans, smoked sausage, potato salad, and corn","useful":1,"cool":0},"zx81NAsJ3fXVwFjzVA75Sw":{"text":"This place is amazing! I'm from Baton Rouge and i got the seafood pasta and the spinach di","useful":1,"cool":1},"LYCBpDfuS8pKC261386WGw":{"text":"Left overs from Seafood Platter: 2 fish, 7 shrimp, 4 oysters, 3 crab balls. And I ate a co","useful":1,"cool":1},"nv2T1g52SvzrtUTg13Zx0g":{"text":"WELCOME BACK!!! We missed you!!!! And it's evident in the patronage.  I personally had to ","useful":13,"cool":12},"MyW3LXPeh6fKfZOL6nrUJA":{"text":"I had heard some raves about this place, but I was skeptical because $14 for a catfish pla","useful":10,"cool":6},"MKXtyLTAINRgX9ZlggoAVg":{"text":"The food is delicious and consistent. The atmosphere was very at home like. My favorite is","useful":1,"cool":0},"IuXyLsY_6wleXHvBIy-xrA":{"text":"Really Good Lunch!!!  I had the red beans and rice and white meat chicken cooked to order.","useful":0,"cool":0},"CXeDhYwrLFA16e_tBp1spg":{"text":"All of our breakfast dishes were awesome. Biscuits were off the chain. The fried fish is o","useful":0,"cool":0},"_ajoEmZHU_9TXoc0YuOkdQ":{"text":"I absolutely loveeeeeee the breakfast here . I haven't actually been inside and always ord","useful":1,"cool":0},"7LRT6rlsxMgbEkapyPCcvA":{"text":"Perhaps I came on an off night, but my experience at Dunbar's was not great. I went for a ","useful":10,"cool":2},"RmShOriRfxqscCoXIEdSBA":{"text":"THE ONLY BAD THING I HAVE TO SAY IS PARKING IT'S SPOTTY DURING THE DAY!!! There's other bu","useful":1,"cool":1},"1oL9M6Og3ogN76k0ZLTXig":{"text":"Stopped by for New Year's Day.  They were opened and advertise a good meal.  This place wa","useful":1,"cool":0},"QBmSWfqFAFNFrqwDCBbMwA":{"text":"We have been here 3 times. The first 2 times would have gotten a 5 star review. The fried ","useful":5,"cool":1},"_tvwmHjytyGYggqNHFpLMQ":{"text":"I visited based on hearing good things about Dunbar's and how good they were before the hu","useful":0,"cool":0},"2JcmGYuseIn9g2EnQsy8SA":{"text":"I finally tried Dunbar's Cajun cuisine and was very pleased. The smothered okra it was del","useful":0,"cool":0},"IeSV-wak3fqt3J7qvS0yHQ":{"text":"The red beans and rice with fried chicken and corn bread is awesome. The oyster poboy was ","useful":1,"cool":0},"vcOhLfa6diCiVT_wu5iRYA":{"text":"Dunbars has came through for me more often than not.  From .99cent breakfast awesome.  To ","useful":1,"cool":0},"U7TBaiy2EP2z-fb39bAMWg":{"text":"Everything was delicious. My son & I dined in early June 2018 & ordered a to-go plate for ","useful":0,"cool":0},"SrDbdgXtITV9TIoJWpYWDg":{"text":"Just so happen to drive by and noticed they advertised a .99cents breakfast. It comes with","useful":0,"cool":0},"Br7Au-LyA3mstug4vCY_YQ":{"text":"This place is great. Perfect seasoning. Seafood stuffed baked potato is a must. Creole fri","useful":0,"cool":0},"3G61WNqPcTa9l8ZWPWVoTg":{"text":"Fried chicken mac and cheese. It's felt like I was in my kitchen. It was so good . Hubby a","useful":1,"cool":1},"Aeyf5OMS1TlOrzYCtoLuSg":{"text":"Their food is absolutely amazing! The presentation of the food is great upon serving, even","useful":3,"cool":1},"0hLktQpoqM2YG7rT5Hsg3w":{"text":"The fried chicken here is incredible!!! The three piece dark is so juicy and flavorful. Th","useful":0,"cool":0},"FNBDCBVM2Ps-7VXk7LzVhQ":{"text":"Went late and the food took forever and tasted like it had been sitting all day.  I do not","useful":0,"cool":1},"ThWqBbY0OxIlf991muPELw":{"text":"The food was absolutely delicious! We really loved everything and the staff was very frien","useful":3,"cool":0},"ubklZmTsUX5kShJb7YnjAQ":{"text":"Absolutely great meal. No matter when you go and what you get, you'll always leave full..\n","useful":1,"cool":1},"u7PnBLQ3nK073cDB7BpuTA":{"text":"Dunbar's has the most amazing food and desserts created and served by the most amazing peo","useful":0,"cool":0},"XO0HwT7qqLUg8-B_J4o5Mw":{"text":"This is probably my favorite restaurant in town. If you're going to splurge, this is the p","useful":0,"cool":0},"0Nno0x1kav6jpiJorqXdZQ":{"text":"I'm glad they were able to finally re-open! I'm sure there will be improvements along the ","useful":3,"cool":0},"C3u0K7dO9T0DLZWnGlgeQQ":{"text":"Won't be back, if you are with several people your whole table should be eating at the sam","useful":4,"cool":0},"l-ZOaBpB4i23UR9hnd1bYQ":{"text":"I'm very happy to see Dunbar's reopen, and was a fan and patron of the old restaraunt on F","useful":0,"cool":0},"PSOdLs_5hFCadpqEISSTlA":{"text":"I've looked forward to the reopening of Dunbar's, they were great when they were located u","useful":8,"cool":1},"6tjvJM-8a0uG4-bU4wrPAA":{"text":"BEST CATFISH hands down in New Orleans!! Our Uber driver recommended Dunbar's as a great c","useful":0,"cool":0},"t9kV3uiBUjPrn8fbmhUTqQ":{"text":"Food was largely quite wonderful at a very reasonable price point, and we were having a gr","useful":5,"cool":2},"jeVVItroId2CTvI87F-S7w":{"text":"Came here on a hunch before going to a seminar. Only had $6 to spend on breakfast to no be","useful":1,"cool":1},"n99wveArF4XXiCzmq1mszw":{"text":"You can never go wrong with this place. The good is delicious and affordable! They have so","useful":0,"cool":0},"pkKuwVC0uoE9fpRUv4wFmg":{"text":"If you are visiting NOLA and don't go to Dunbar's, you are missing one of the great food e","useful":0,"cool":0},"1jkBzIRJqWZi7RRPxP5qXg":{"text":"Ok, Thursday's menu is hands-down the best. The \"only\" thing anyone should order this day ","useful":1,"cool":1},"vPq0IDN3VhYvgGwzmRL7fw":{"text":"I enjoyed this spot.  Like I really loved The Seafood platter. So y'all let me say this...","useful":8,"cool":5},"3Q1Lj1ZvMU3q5z9bwa-s9Q":{"text":"I really wanted to love this place due to the positive reviews I've seen everywhere else. ","useful":0,"cool":0},"Z6fqK8pFxLLnHZ6Ld7D84Q":{"text":"Do not try the salmon here. It was dry and over cooked. The side dishes came in very small","useful":0,"cool":0},"JE4_23C5LvJgvnCSI7Q8YQ":{"text":"I only tired their catfish sandwich which was so yummy and also the cornbread was a five s","useful":0,"cool":0},"QmsM4DCXIowQCUMu5aFZdg":{"text":"What a great experience here! My coworkers and I had a group lunch here recently and every","useful":1,"cool":3},"lAutzr4QHTUilGXjgvAicg":{"text":"Comedy Night at Dunbar's @Dunbarscreolecuisine 2.3.18!! Doors open at 8PM Show starts at 9","useful":0,"cool":0},"gMvV-CR8aA5I94ucIWpQJg":{"text":"Absolute worst service I've ever experienced. We went her in attempt to support and with b","useful":0,"cool":0},"47FH6Ekt1byGJoxEDyWUTQ":{"text":"Dunbar's has long been famous for their Creole food, fried chicken and daily specials.  Th","useful":5,"cool":4},"yC4XI3HUqq6V4OKRkEj4Tg":{"text":"I frequently order the 3 pc fried chicken meal with Mac and cheese, red beans, yams and co","useful":1,"cool":1},"XiWOlr6zUCKjIM4xCswEAw":{"text":"Food was okay. This is probably lunch spot for folks who work near. Maybe I'll be back if ","useful":3,"cool":0},"nVsyK7n7F6--AqETEMhaTg":{"text":"Came in during our visit to New Orleans from L.A. and everything we tried was excellent! F","useful":3,"cool":0},"oBAOvMc3uviu4WTgaf8aGQ":{"text":"I got the food delivered to the hotel I was staying at. i ordered catfish poboy, chicken w","useful":0,"cool":0},"nH3Hb2WRA3W7Oqgt14THBg":{"text":"When you walk into a restaurant and it doesn't smell like food...turn around like I wish w","useful":0,"cool":0},"ROiYjHwp-Ga06YzZjliIsw":{"text":"If you miss that old school cooking , come here . Every bite I took brought me back to my ","useful":1,"cool":0},"4evQEPJJCkfFm0cNNmbcdQ":{"text":"We really enjoyed the red beans and rice and fried chicken. My wife had a stuff seafood be","useful":0,"cool":0},"wEqOMJDTYNSKtX2S5x3cOQ":{"text":"The chicken was seasoned pretty well, moist, and crunchy. However, I ordered white meat an","useful":1,"cool":0},"modYXAtuQ3FWEGynp8YOnw":{"text":"Dunbar's is by far the best meal I've had in New Orleans so far. The red beans and rice wi","useful":0,"cool":0},"OY0y19GbtNIxTCMd8_dbkQ":{"text":"The best breakfast in the neighborhood.  Their pancake meal is without comparison.  I also","useful":0,"cool":0},"ml4h__ESByfwxbRP0ua_Pw":{"text":"Stopped in quick while in town.  I had the shrimp po boy and my wife had the seafood pasta","useful":2,"cool":2},"J1VX3GEZN4xmtVrmTVN1ow":{"text":"I absolutely love and missed Dunbar's.  I got a chance to go back for the first time since","useful":1,"cool":1},"VN98ftNEkba4X6RSB2sHUg":{"text":"Good food and great service on top of all that we saw Juvenile. I will be back for the red","useful":1,"cool":0},"v-tUu-TY8zXgj0Jc4jbGRw":{"text":"AMAZING catfish !!! came here 2 mornings in a row !! \nfirst morning i ordered cart fish an","useful":4,"cool":1},"64EVvY8XBsGhepxKnDHIYQ":{"text":"I just left the restaurant and I am highly dissatisfied. I decided to try the smothered ok","useful":0,"cool":0},"k3xurTq_35Xe7VamWEIvRg":{"text":"I usually go into each restaurant giving them 5 stars. I love food, I want them to be good","useful":5,"cool":0},"zqRWOvf2JO9xr5aZmKL3Sg":{"text":"Servers are wearing no mask. And obviously they dont take orders from certain people who a","useful":1,"cool":0},"K21kK151liX6UNI_XCUTTA":{"text":"First time visiting on Sunday and they had only a Brunch menu with limited menu.  Ordered ","useful":0,"cool":0},"sXldqT_ZqeaaiDquvqQO3Q":{"text":"Best authentic NOLA food. Everything is delicious and taste like someone grandma made ever","useful":0,"cool":2},"pSh7vDV7px2T70nctiuqxg":{"text":"Overjoyed!!! Sooooo everyone from New Orleans knows that Monday is Red Beans and Rice day,","useful":0,"cool":0},"WHokUkrEuyLgGPdQ8IQ5bA":{"text":"I would recommend this restaurant if you have nothing but time on your hands! The food was","useful":1,"cool":0},"vwW_GdlIFaskPyWOMB1uwQ":{"text":"Food was ok, but the service was really slow. Not to steal another review, but Dosh W. did","useful":0,"cool":0},"fLCW3HBrDTHmDPD_xzKb2w":{"text":"I rarely post such a positive response, but for this meal I have made an exception.  \nFrie","useful":0,"cool":1},"f8NWV4VZaSMrKmI0HurerA":{"text":"Very tasty food, but obviously, as most restaurants, extra slow with all the COVID-19 proc","useful":3,"cool":0},"Ox4UKiBHXOxNL2bT669ffg":{"text":"Great breakfast! A lot of my classmates recommended this place so I decided to give it a t","useful":0,"cool":0},"Ob2PIOFCMJJ_nolrGxoV8Q":{"text":"I frequented this restaurant when it was located on Freret and cant recall ever having an ","useful":3,"cool":0},"TPShvOTsPljnRQmlnSvn3g":{"text":"Service was great and the food is amazing! We were seated immediately with a smile. I had ","useful":0,"cool":1},"GwvF6GLoKtBYq5okjxdBBA":{"text":"Wow, the food here is absolutely delicious. The establishment was clean. The staff was fri","useful":1,"cool":0},"Gs4m0DmHacAmAzY_i_nb-A":{"text":"We had the shrimp & grits and baked salmon w/ peas and spicy fried rice. I also had an Arn","useful":3,"cool":2},"p73WRcZCE3Jmh0Hjen9Vgg":{"text":"Dunbar's is EXCEPTIONAL.\n\nMy dad first told me about Dunbar's because of their super cheap","useful":16,"cool":10},"02_VEevLKM2U-N6UYSzeRQ":{"text":"I was told this site would be good to get the traditional  on New Year's meal but that was","useful":0,"cool":0}}