{"0QbACWno-B54PuMJL6P_7Q":{"text":"I went there this past weekend and while I'm not use to cover charges the price was not ba","useful":1,"cool":0},"qf6-zQtaOb9opnRaQl6tow":{"text":"We had our best night in NO in dba, listening to the Glen David Andrews Band. A great time","useful":0,"cool":1},"sFAiCE3hxd3uga-MxbVG_Q":{"text":"Came here on both Friday and Saturday night of Jazz fest weekend. On Friday the Wolfman wa","useful":3,"cool":5},"UpwpAWL2j2z_NeAfg_lkdg":{"text":"Best place in the city. The band was great and most important thing is the beer selection!","useful":1,"cool":0},"5ldyNkMw3NCqEUs7FRKmLg":{"text":"The fact that this place is smoke free in a city where dry shampoo seems like a reasonable","useful":1,"cool":1},"TZ_YUblb5XvuTpVApcQIiA":{"text":"I love the craft beer selection and live music, but the staff has a \"I don't give a crap i","useful":3,"cool":1},"JhjXk5QZI56z5p4Ka8sthg":{"text":"Fantastic music venue.  Tons of room so you don't feel like the crowd is sweating on you w","useful":3,"cool":0},"obUDPfjnoAb1ppVRA8rs8w":{"text":"Great bar with a huge number of beers, on tap and in bottles. They had Chimay on tap, whic","useful":1,"cool":0},"NbpiQiMQ2iNIWQbsp1Cl8Q":{"text":"Caught two acts...both good\n\nWine and beer selections both plentiful and reasonable \n\nWill","useful":0,"cool":0},"kZA9Aa-_YJbRcPJWNObt9Q":{"text":"d.b.a will always have a special place in my heart. I came here with my wife and some frie","useful":10,"cool":8},"SLZtRqNhyI7kxMcLlshNEA":{"text":"Started out with five stars, just for the beer selection (maybe the best we've experienced","useful":1,"cool":0},"IZj5SfZBoxzYWx5uqffg6A":{"text":"Le premier soir ou je suis passée devant ce bar, il y avait un cover de 10$ pour voir des ","useful":2,"cool":1},"jv5JdGQn1MdqWriIRjmCwg":{"text":"Probably my favorite club in New Orleans, it gets crowded at times and it can be tough to ","useful":3,"cool":0},"BORhbryXwN-YDQqSYbAVyg":{"text":"Cool place, but don't accidentally forget to close your tab at the end of the night. The b","useful":1,"cool":0},"o0Mv5Ik2pS6s_QQxi7dWrQ":{"text":"Wasn't as good as I had hoped. Decent beer selection. The chairs at the bar are less than ","useful":0,"cool":0},"uFGpA2rQMOfV7TGY8bjCjw":{"text":"Having now been to all three DBA locations (I used to live right down the street from the ","useful":0,"cool":1},"uEF2J9IGbtx4kONPPKbU0Q":{"text":"Classic New Orleans Jazz Club Bar. They appear to attract the most talent and one of the f","useful":1,"cool":1},"CQ-P2LCq-OJMBf2fAvB8Hw":{"text":"Why is this place so awesome?  Ummm, could it be that it has a huge selection of internati","useful":0,"cool":2},"Bhy9QpUfc2-wxWmLkA44JA":{"text":"Popped in at around midnight after The Spotted Cat. Getting a drink was neither as impossi","useful":0,"cool":0},"holqt3CyIh3YsrOdCmgT9w":{"text":"Treme Brass Band on Tuesday night. That is all!","useful":0,"cool":0},"El94b2RRPdqZPKsbJsGZ4g":{"text":"I like the window banquettes which seem far removed from the bar and are the perfect hidea","useful":0,"cool":1},"HRybplvcTIDw6nCeWbGDDA":{"text":"Stopped in on a Wed. night and the band was really good.   Lots of drink choices, and the ","useful":1,"cool":0},"u_4FYh1ITDo4Wg758LdNPA":{"text":"Awesome beer selection & $5 Tito's dranks!? Sign me up! \n\nLive tunes were great- they brou","useful":1,"cool":0},"CEEPAr0_2Q2UZ_xwYJob-w":{"text":"Agree with the other reviewers that this is a great music venue.  Unlike other places on F","useful":2,"cool":0},"KCkK5-CKI6wzw9ksrPu4RQ":{"text":"LOVED the vibe at this venu. We went to hear live music (can't remember the band name, FAI","useful":1,"cool":1},"GIey_4wE1qHUSV0li_OaJw":{"text":"I came to Frenchmen's for good jazz, that includes music and vibe.  D.B.A. definitely disa","useful":0,"cool":1},"r5QwjnqymRDyTESqw53AnQ":{"text":"Came in for a Lambic and had to leave my driver's license since I was just walking through","useful":0,"cool":0},"7VCAyr0JfVV1ngxFJUHRoQ":{"text":"Great jazz bar in N.O.  a bit of a walk if you're staying near Bourbon street, but well, w","useful":3,"cool":0},"4R6L4fub4i-30R1FQmEqdA":{"text":"TREME BRASS BAND!!!  \n\nWhat a party band!!!  Doesnt get any better!\n\nJust be prepared to e","useful":1,"cool":0},"N9pM7V3GSKF_M51VD1bm_Q":{"text":"My husband and I got out for a date night and while walking to our dinner destination,  no","useful":1,"cool":1},"yfBzewatLcjyZjXyFCBFLQ":{"text":"Great Beer and solid Whiskey Selection. These two things seem hard to find in New Orleans ","useful":2,"cool":0},"qZkp2GOZuGoaKwCSnUHC8Q":{"text":"Great Bar. But I was in DBA the evening of Sunday, May 18 for about three hours, and I did","useful":2,"cool":0},"Z66wzG_BNj53V9a1DtG9Nw":{"text":"Another great place for local, live New Orleans music every night of the week.  There's a ","useful":2,"cool":1},"S8Hvb6w2UXDu7bQyj__4eA":{"text":"DBA was the only bar in NO where I was able to find fernet to drink.  Yay fernet!","useful":0,"cool":2},"pd6LiYVW3n7C-0s6ARDpMw":{"text":"THE place to drink in the French Quarter. Diverse beer selection as well as plenty of liqu","useful":1,"cool":1},"BhO5geVjhKU9w_1LJSze8A":{"text":"I'd first like to start out by saying that this is THE FIRST bad review that I have ever w","useful":3,"cool":2},"xDF1SN2bjpZA8CSR6UzIaA":{"text":"One of the best bars in NO for a wide array of good beer & spirits.  Great craft & import ","useful":0,"cool":1},"c_b9B5H6hfZub4EV0j2ASg":{"text":"Ah, DBA. I actually would have given this place 5 stars if the awesome jazz band didn't st","useful":1,"cool":1},"guZq-K6O1qyvZTs8eQsYvQ":{"text":"Best. Bar. Menu. Ever.\nIt's as simple as that. Find any beer/wine/spirit you could possibl","useful":5,"cool":5},"NagrHaUJPvLid1p5qy9tVg":{"text":"I love everything about this place.\n\nI discovered d.b.a. by just walking down Frenchman St","useful":0,"cool":1},"7niQ2bdUQL0Q70PNXujo3A":{"text":"So I'm in New Orleans for the first time looking for good music.  I'm with a buddy of mine","useful":0,"cool":0},"h-Q8FTY-p2KMEkUORPUbaw":{"text":"This place reminds me of a bar in Chicago, Quenchers.  It has a huge selection of beer and","useful":1,"cool":0},"lkFS3X28XKp_N1nRy9phAg":{"text":"My favorite bar hands down. They make great cocktails and have a huge selection. Try the p","useful":0,"cool":0},"dnNYgjrlQc8XdtZ0CXjlpg":{"text":"This place is fantastic.  Our bartender at the W French Quarter told us to check it out on","useful":0,"cool":1},"nRdqLKvWFmuCRaVap9WVNQ":{"text":"If you are down in NOLA a big part of the city is it's music. Down in Frenchmen Street and","useful":1,"cool":0},"yUkiG0KgmVPP8Kc8l8Op9w":{"text":"Great space for superb live music.  The $5 cover was completely reasonable.  We originally","useful":1,"cool":1},"ZnzxUDNK2xYvgK97_RMkaw":{"text":"This was my first exposure to a jazz club on Frenchmen street and it converted me for life","useful":0,"cool":1},"82QJ5dzF_Lnzv6PC0QPwUg":{"text":"A classic! Great, dark, divish bar with live music. A must if on Frenchman, or in NoLA","useful":1,"cool":0},"mTqgH6auLWIrENnG_zaftQ":{"text":"Always amazing musicians playing. A beer list you couldn't imagine if you tried. Affordabl","useful":0,"cool":0},"Jx3VfKKTyhMiu36RGteW2Q":{"text":"NOW SMOKE FREE!!\n\nDBA is one of my favorite places to enjoy live music.  They have a fanta","useful":13,"cool":7},"AeB2RH8EdaKsgfc9DWUUhw":{"text":"Amazing!!!!!!!!!!!!!!!!!!!!! What a great music venue! the music was wonderful. A bit loud","useful":2,"cool":0},"lV6X21sSVjaa3UJ_EBmRlg":{"text":"We came here for the music which was lovely. When we were their they were playing traditio","useful":1,"cool":0},"4V4gLbi-g7ckii0ZDCeIjA":{"text":"Great selection of wine! They have vinho verde which is so refreshing and very seldom foun","useful":2,"cool":0},"NakloSGmJmF8Axe6QcERqA":{"text":"I have to say after frequenting this bar, and introducing it to my honey (who is a program","useful":1,"cool":0},"NIb7NvyMZBDuTmgwlXwaYQ":{"text":"Awesome beer selection & $5 Tito's dranks!? Sign me up! \n\nLive tunes were great- they brou","useful":3,"cool":0},"aI04iCKe1tRqdFLkthQozA":{"text":"This is one of the best live music spots in New Orleans. John Boutte comes in every week. ","useful":1,"cool":0},"E8On6_w-8KXWT8MpKySRdg":{"text":"The Jazzman were playing when I arrived at 4 pm on Saturday afternoon. They boasted that t","useful":0,"cool":0},"8FQX-WBgVN-VHz8OPrvS8w":{"text":"This will be a short and sweet review about my new found love of d.b.a. I went to d.b.a. f","useful":1,"cool":1},"QkLPp9IvC2f8HQafyc40VA":{"text":"Huge booze and beer list and decent prices make this place a must-see in Marigny.  We arri","useful":2,"cool":0},"H0UlYBbgYXDrqs_rbT8b0w":{"text":"If you love beer, then this is the New Orleans bar for you.  They have a large bottle list","useful":0,"cool":1},"aPZejm6W7yYwTmhpX5_dNg":{"text":"d.b.a and the Spotted Cat really seem to be the nexus of action on Frenchman St.  I feel l","useful":3,"cool":2},"QIFhCWxDR4YcaAFe1w4mWw":{"text":"Thursday night - Alexis and the Samurai.  I could watch them perform a million times and i","useful":0,"cool":0},"M62g3P3XL9I1ywrs3rxpzQ":{"text":"This was an impromptu stop on our last night in NOLA. We went on a ghost tour (another rev","useful":3,"cool":0},"Rr9x3WF73_8JuiwSm4Jkbw":{"text":"DBA is a nice bar with one of the largest beer selections you'll find in the city (I even ","useful":0,"cool":1},"uuAbLVXchNUQQwiVThd7xw":{"text":"Great live music with Danceable drinkable jazz. Lively and lovely wooden room... Great pou","useful":0,"cool":1},"17Zy7OA1wL5uWnLmUcZcnQ":{"text":"This place was a great spot to duck in, grab a drink and cool off. The band was amazing! S","useful":0,"cool":0},"R5M70By1bhz3oIVT7tXQLA":{"text":"Nice spot, with a great beer selection. The crowd the night I went was a little hit or mis","useful":0,"cool":0},"9WFRBRSVggsQbeJI08OAmg":{"text":"This is easily the best place to see live jazz in New Orleans. They typically have a cover","useful":1,"cool":0},"hku-3KQqg2a057xIqb7sZw":{"text":"Love this place, great choice of beer and wines.  The cover/door price varies depending on","useful":0,"cool":1},"JSdt7CVg_KULDTTTwB_zbw":{"text":"Nice air conditioned venue with the smell of hardwood and a chill ambiance. The bar select","useful":0,"cool":0},"l6hU2NDmyOc40t5kg3L2vw":{"text":"Went to see the Rebirth Jazz Band Saturday night show and loved the show. The bar is great","useful":1,"cool":0},"VEyO9UWDefzwbuP8B-vcvQ":{"text":"A place to kick back, relax and drink a cold one with the locals. Definitely a gem on Fren","useful":3,"cool":1},"EBr5I8NfvCgHHgJ4OIYalA":{"text":"Hands down, my favorite bar on Frenchman to hear great live music. They have a great bar a","useful":1,"cool":1},"2Jm2bC_MQ6sLUwML4mmE_w":{"text":"We hoofed it here from the FQ after seeing the huge array of beers on tap. Well worth it! ","useful":0,"cool":0},"AFdjV_ovkyqjB8jCk2iH3w":{"text":"Used to be one of my fave bars when in the city that I love, but apparently some things ha","useful":2,"cool":2},"zRhTvTGIPi_ghWOVV8VS5A":{"text":"As poorly run of an establishment as I have ever encountered, the staff was rude \nand eith","useful":2,"cool":2},"pVABfiaR2B73LOM_kxjryA":{"text":"d.b.a. is one of the coolest spots on Frenchmen. We love that they often have 7p or 8p sho","useful":1,"cool":2},"Hp8SVsASHJKEAF8ECqTxHg":{"text":"Amazing selection of liquor and beer.  Bartender is one of the most awful people I have ev","useful":2,"cool":1},"fyGaK3UfPy59OH_zCzrjuA":{"text":"I am super fond of this place for 3 reasons: first, on Sundays at 6pm when Linnzi Zaorski ","useful":0,"cool":2},"6zZw35EjX4xx_JoYTi7BNA":{"text":"Has great live music every night I believe.  One of my favorite Frenchman stops. \n\nFavorit","useful":1,"cool":0},"laTrRVneGuuUnklwFoVAgQ":{"text":"Frenchman Street is the place to be in New Orleans and this is the place to be on Frenchma","useful":0,"cool":1},"Kr0L2Ka-TjMAE-bMYlR5tw":{"text":"Went in to see a jazz band play, left after only a few minutes. We ordered a round and pul","useful":3,"cool":2},"WiSMMOT9z8rcG5bGqOrgUQ":{"text":"D.B.A. is another cool bar/music venue on Frenchman St.\n\nFor this year's Krewe du Vieux pa","useful":6,"cool":3},"3MoxDFHPDc4rB6pX_787vA":{"text":"Best burgers in town! Good music venue as well!","useful":0,"cool":0},"PpAxYS4O_-H-N4Mb3zPiww":{"text":"Very chill off the strip Atmosphere. Still fun and very reasonable drinks. Lots to choose ","useful":0,"cool":0},"TiSW4ioOW_YFQtieNFmEDA":{"text":"Drank lots here...lots of craft beers available and listened to more bluesy jazz here. Goo","useful":3,"cool":1},"Y8AQu6kusvhY7LhRzdlN8g":{"text":"Great place to stop and unwind before next flight . Amazing and knowledgeable staff, great","useful":0,"cool":0},"6vB6Lyo-p8i6iqZRVnYjwQ":{"text":"Love Treme Brass Band and this was my second time to see them tonight. They get five stars","useful":3,"cool":1},"PGPQM2IEKLVLdJtnuK-baQ":{"text":"Best bar I have been to on Frenchmen Street! Awesome selection of beers and great live mus","useful":0,"cool":1},"mZmm_eI8oWDP0w5AigETfQ":{"text":"We ended up spending a lot of our time on Frenchman Street, because it is such a different","useful":1,"cool":1},"x9zoQErRvCPMco_DcP8C0w":{"text":"good variety of live music. tip tip tip.","useful":1,"cool":1},"j5N3RsI9ADXUeuUkS-5S4w":{"text":"This place is spacious and has live music. Huge selection of alcohol to choose from and th","useful":0,"cool":0},"MTQBHbLvZuHWrklRtY85XQ":{"text":"I would definately agree that this is iconic New Orleans, and I do love finishing out a ni","useful":0,"cool":1},"ZWePlzlcNzcjQn8b-k2n1Q":{"text":"I'd give this zero stars if I could.  Tried to take a party of 7 inside, but was told it w","useful":2,"cool":0},"BDmLNJiysGvVDPrwvzkCGQ":{"text":"Treme Brass Band made my night and it happened at d.b.a. Not only is there excellent music","useful":2,"cool":0},"-GjFwPV6WaXovXQAcdYY5A":{"text":"Craft Brews, well made cocktails, great live music, nice staff, AND the NY Rangers on TV. ","useful":2,"cool":0},"dMvp0zZYRz8vMWVRMNpvVw":{"text":"This is my favorite live music venue in NOLA - a must for visitors seeking lively jazz. \n\n","useful":10,"cool":7},"Hsxr3XP1mpwU7L_2gqH0Sw":{"text":"Do yourself a favor when you come to New Orleans.... venture outside the Quarter!\n\nWhen I ","useful":4,"cool":1},"NnrG5UfvRyBFPT0PSLBTkg":{"text":"I ran into one of the actors from \"The Wire\" while at D.B.A for my first time.  And I was ","useful":0,"cool":0},"M515jMIMnYSusArI70_atw":{"text":"Aside from serving up some of the best beer in town (including the Tramp Stamp | Clown Sho","useful":1,"cool":0},"YAc51jVZNk8mSh9PLGBAgA":{"text":"Fan effin tastic music. Great price on drinks. \n\nThe only thing that could have made me do","useful":1,"cool":0},"Ajlsv2mlF1nbGbId3R_Qcg":{"text":"I hang out at dba most Wednesdays for Walter Wolfman Washington and the Roadmasters. They ","useful":3,"cool":0},"SxHbL-PBcBqfxwnWxLzZSQ":{"text":"An evening with John Boutte -- terrific. Wished the bar did a little more to shush the amb","useful":0,"cool":1},"sPlfGaS_01Puoo3tg8tvzQ":{"text":"I really enjoyed myself at DBAs - wouldn't necessarily call it an upscale bar though - but","useful":3,"cool":3},"ut0IMBwZhbaX7fwSmbOCww":{"text":"The night life here in New Orleans is second to none. There's plenty of places to stop to ","useful":0,"cool":0},"A8OJ6XFEt6jZf8aRtLu-pA":{"text":"MUST DO!\n\nTue 10pm $5 Treme Brass Band\n\nJust Do It!","useful":8,"cool":7},"WwQSyuvZqLc2pyZzqU8PeA":{"text":"I love D.B.A. When they went smoke-free, I loved them even more.\nGreat music and drinks.\n\n","useful":4,"cool":3},"HVl0hjKB71wI7GGsUEMGDQ":{"text":"First off, if you're going to be in New Orleans, you have to go by Frenchman St! It's less","useful":2,"cool":0},"0awah-3uTlzcc2455j6NIg":{"text":"Rarely do I not have a good time here. \nNow smoke free? It just got a whole lot better.","useful":2,"cool":0},"H755lXHCzR9ex6Rt__wmgQ":{"text":"Awesome music and awesome beers.  Make sure you check out the lindy hoppers on tuesday nig","useful":0,"cool":0},"dvK2Hl6OxY85z88NkRT9GQ":{"text":"Go where the locals go! $5 cover for great local artists at d.b.a on Frenchman street. Lov","useful":1,"cool":2},"ndR_mNMNMEVFBt6r5oJ0CA":{"text":"I didn't spend as much time here as at Spotted Cat, but this is another winner for a place","useful":1,"cool":0},"PDbDcr2m6ap181DulmlWbA":{"text":"Great little bar away from the craziness of bourbon street. My husband and I relaxed here ","useful":1,"cool":0},"3k7L8yl66NZ7hlSDZAdlaA":{"text":"One of my favorite stops in NOLA. We were looking for live music, and happened upon this p","useful":2,"cool":0},"A3c_nEVRv5YsZ7K9lMSfUA":{"text":"This place was the highlight of our trip to New Orleans. Right acrss the artist market spa","useful":0,"cool":0},"K2-SOR3cY9ik6upxeW29iQ":{"text":"A Frenchman Street staple for great jazz.\n\nA Blues group from Washington DC was here when ","useful":0,"cool":0},"zQvB4HgEq_Tr2OiLP-eExg":{"text":"A great place to see live music.\nReasonably priced bar with a GREAT selection of beers and","useful":1,"cool":0},"qHnaMjwcZFgBcKGo-0SP5g":{"text":"Wandering aimless down Frenchman in an attempt to avoid the amateurs on , we popped into t","useful":1,"cool":1},"Oc1-6hzPhcby68gExGqFIA":{"text":"Every visit to DBA was enjoyable!  Conveniently located between or rental and our daily ex","useful":1,"cool":0},"MghOKinxNUC2104z6ohioQ":{"text":"Had average experiences here. Some good music, some not so much. No outside alcohol allowe","useful":1,"cool":1},"KMtZyQoO9dlvtZhPT0ZzdQ":{"text":"When we went, there was no cover, just tipping recommended per set (depending on who's per","useful":1,"cool":0},"sAjvNm0RICVbScFTFygJ3w":{"text":"DBA is located along Frenchmen St., which is essentially the part of the French Quarter wh","useful":1,"cool":0},"YX_SuQloLdFkvYtQbeBtJQ":{"text":"Pros:\n-The beer and especially the bourbon/whiskey menus were great.\n-The place didn't see","useful":2,"cool":1},"SmKQ2lP0vFDsdxbT8NEiwQ":{"text":"The entire time in NOLA my S.O.kept saying how he thought NOLA was a \"beer desert\" Even th","useful":0,"cool":0},"4jMR_YPX0zplEBxeNN2UJw":{"text":"Had a great time here a few weeks back watching the Iguanas. Had a roadhouse feel and a de","useful":0,"cool":0},"AFLUHX42bR6ofnOEaEfS3w":{"text":"Fantastic! Off the tourist beat, great music, local bars, art markets, and this is the emb","useful":1,"cool":0},"l13Bxt1s7OCi0wE7IXwq7Q":{"text":"I was wavering between four and five stars and am going with the FIVE, because it is great","useful":3,"cool":1},"dSb-0R-7jWRdZZBAXz3Glw":{"text":"Living in New York, I have frequented d.b.a bar in the east village many times. Thus, on m","useful":1,"cool":2},"84j_BRMUdOTwUDW5pQAE0A":{"text":"Great vibe and with a huge drink selection that is almost overwhelming. Unfortunately the ","useful":1,"cool":0},"BisuDu-gqPtYlLnrXT1nmg":{"text":"amazing beer selections, friendly and attentive staff, and one of the premier intimate gig","useful":1,"cool":0},"L2k0zEYuSGDMkl8adQZUoQ":{"text":"I went to D.B.A the day after Christmas '17 and I couldn't believe how live this spot was ","useful":0,"cool":0},"60AV-8NIkIumIS3xfEwg4A":{"text":"I want to go back, I want to go back, I want to go back. I loved hanging around in this pl","useful":1,"cool":1},"cD74Oe1zudld_W1JGoR8KA":{"text":"This place is the culture!! The beer menu is extensive and the live band was incredible. T","useful":1,"cool":0},"1og7tEjBvhV2MyIAQa3f0A":{"text":"I'm not much of a bar guy (sometimes bars scare me), but d.b.a is seriously an amazing pla","useful":1,"cool":2},"BFQZU9x6aOCbEWUd7DJJXQ":{"text":"This was our second and last music stop for the night. In theory, there was a $5 cover, bu","useful":3,"cool":2},"4xjaL1CG3PW0srKNMvsK6g":{"text":"Very disappointing for New Years Eve Dec. 31st, 2017.  We paid $15.00 cover charge at 1030","useful":0,"cool":0},"xtcthuRmr0akQqF5c7q9Yw":{"text":"Their beer and liquor selection is THE SHIT.  They have everything. (Everything good, that","useful":0,"cool":0},"tCd99O310uxgDfIrQm9eZA":{"text":"For a beer aficionado, their beer selection is a dream come true.  Popped in to hear NOLA ","useful":7,"cool":3},"zR1lHaX8tEutP_MJa64rDQ":{"text":"My fella & I frequent dba. I like the bartenders & the atmosphere here. There is always a ","useful":0,"cool":0},"ykqJ_FPDvBcbGHZls9N6WQ":{"text":"Fantastic!\nWent here while on honeymoon in Jan. Hubby wanted to hear some music and Preser","useful":2,"cool":1},"nXjVA6JtyAHVO6BCbUthqA":{"text":"Really good atmosphere here. There was live music and the bar is really cool all in wood.","useful":1,"cool":0},"2r334kYH6Js7f_r-Kuyd3w":{"text":"This is the real New Orleans night life. Frenchmen street is where it's at. Lots and lots ","useful":0,"cool":3},"sgdVmmwTyldYO1xHFW2Apw":{"text":"Stopped by last Thursday for a couple of drinks.  I've been to the d.b.a locations in NY a","useful":1,"cool":0},"SftsdnELtXZzCtYBqRKzKA":{"text":"I always look forward to time spent on Frenchman's, normally we go to Maison, this time we","useful":4,"cool":1},"wCN_EBMJlO6Eo_hibP0_AA":{"text":"Came here to see Glen David Andrews during his Monday night residency ($5 cover). Was surp","useful":2,"cool":1},"7fGSpeoRqIRBz4VOfXkq6g":{"text":"Stopped in on a whim and caught Tin Man playing. If you're not familiar with them, they're","useful":1,"cool":0},"wvNG1c4gqcfSjkFqu539vA":{"text":"Unfortunately I went to this place when there wasn't any live music so I can't review on t","useful":2,"cool":0},"-AFsmdpW-0uroTJY_0eOgg":{"text":"Great bar with a terrific beer and wine selection and a no cover early performance -- you ","useful":0,"cool":0},"JSfMVpDulz8BMSNy_YahfQ":{"text":"After much help from some of the New Orleans Yelpers, Frenchmen street was named as a good","useful":2,"cool":1},"KZuxWfvr1iRq13zZpX2EFQ":{"text":"I don't want this to become touristy but I was a tourist when I went and this place should","useful":1,"cool":0},"b5Yan4kAkRiZ_R6VIEJ8hQ":{"text":"Exceptional evening listening to Little Freddie King on his 78th birthday!  Good times wit","useful":1,"cool":1},"ixbqHrNow7rjJheguCaA1A":{"text":"Good music. Pretentious servers that apparently think they're cooler than everyone else be","useful":1,"cool":1},"6paMYrUSmhzY5EX6ktkAjw":{"text":"went bere theee nights paid one 5$ cover others were free, has a good vibe seems like it a","useful":1,"cool":0},"gcAWEw8LB9tz8Yp74_lJ_A":{"text":"as the other reviewers said, the decor and drink selection make this a great place to be.\n","useful":1,"cool":0},"DMehOzifJLqndnLmhzlKBg":{"text":"I have been seeing the best of d.b.a. over the past five years. The regular shows are the ","useful":1,"cool":1},"nlK_r2AOfH2SASXqArcqeA":{"text":"This place oozes class, pure and simple. My friends and I were on a road trip from Santa C","useful":2,"cool":3},"IkkrTFqngwk9ceYlRPebJw":{"text":"I REALLY liked this place.  Our bartender from Desire's on Bourbon St. told us if we want ","useful":5,"cool":1},"sQXQyMLmejJ0ShEktsrQrg":{"text":"I am more familiar with the East Village, New York location of d.b.a.  That place is small","useful":0,"cool":1},"eke-JeHhv51LtQ3jTWoHnQ":{"text":"Delicious food. Had the fried chicken with mashed potatoes & collard greens . Also had a S","useful":1,"cool":0},"jDUCVuByupK8QnWG4K0jYg":{"text":"First timer and it was amazing.  I'm from NY and have never been to the one here.  \n\nWill ","useful":1,"cool":2},"v1ooShBDvlXaarhZLggWng":{"text":"I'm with you Jessica R. How have I not written about d.b.a. yet? Definitely one of my favo","useful":1,"cool":1},"1D9XWiW7aEBfrNbyHmuDgw":{"text":"Smoke free, stage for live music, upscale vibe for Frenchmen Street. Two separate bars, on","useful":1,"cool":1},"bo1dj4VH6QnVjb3M_JIopA":{"text":"Hands down my favorite bar in New Orleans.  The beer and booze list is top notch as is the","useful":0,"cool":1},"_Z8Q2tGQF1YS3Hw9narawg":{"text":"The legendary dba...a great place to see live music.  The acoustics are fantastic - it's a","useful":3,"cool":0},"O5vIRLymVsYguxyll5I3SQ":{"text":"Large variety of drinks on one side, then step over to the band side and not so nice barte","useful":0,"cool":2},"zS2lzjHqCdTBAGzSZ4gnCg":{"text":"Definitely a stop you want to make on Frenchman Street. Cheap cover, good drinks, wonderfu","useful":1,"cool":0},"9Ky-Detx77oipRKntBBJ4Q":{"text":"Probably my favorite place in NOLA thanks to the bartender JULIE!!\nShe is the bomb!\nThe So","useful":0,"cool":1},"VHsmzPet2w6A2Zzxh9Ly5Q":{"text":"Great music, decent drinks, fun crowd.  We saw the Treme Brass Band--they were a lot of fu","useful":1,"cool":0},"9VPo04L4M5TMTzMwfbcB2w":{"text":"Looking for a spot with great music in New Orleans? They have a large selection of beers a","useful":0,"cool":1},"j4fb7EqSEnyIymcSNBudHA":{"text":"great beer selection.  good music.  \nsmoke free a plus.","useful":0,"cool":1},"l_kTGzzbcEm0j0QVWRAZBA":{"text":"I LOVE this bar. I have been there when it was packed 5 deep on a busy weekend and when it","useful":4,"cool":1},"I2Vz_2njNl97xhutSQIstg":{"text":"This place is completely ridiculous. My friends were all here and having fun until some du","useful":2,"cool":2},"vvo7hKpUa33P0KP_EaaNYA":{"text":"It was a Tuesday night in NOLA and we just finished a great dinner at Adolfo's above the A","useful":0,"cool":0},"4gdFUf2MxzA8JTumTRAdeg":{"text":"This was one of my favorite venues in New Orleans.  The venue is very chill and relaxed, w","useful":3,"cool":2},"ALPOnR-XNLsoCPD5ubNvrQ":{"text":"Excellent bar with live music nightly. Stocked with incredible variety of drafts (includin","useful":1,"cool":0},"MnOvOKja3FxK2Q7KLFk-8Q":{"text":"One of my favorite places to sit down and drink in NOLA. Great beer and liquor selection a","useful":1,"cool":1},"DmAf9O5lseBYhDv0e2KS2w":{"text":"Glen David Andrews blows the roof off this place on Monday nights. Cover is only $5 and wo","useful":1,"cool":1},"E8s_ufYmjdJqSSgl_yS4Hw":{"text":"LOVE this bar!!! We were there before there was a cover charge which was great. The beer s","useful":1,"cool":0},"zkiIpnwnRhLacbOkhsgqYg":{"text":"Rally enjoyed our night at D.b.a. Cocktails were well made and service was excellent. Foun","useful":0,"cool":0},"hSOQAWkn66p7BqAIPJIK1g":{"text":"It is a slow night. I am alone at the bar. I leave a $3 tip on a $7 drink and instead of m","useful":3,"cool":2},"fh8jfRLal-36RF0gv0fQHg":{"text":"Hard to mess up dba but bartender on 2/26/2015 surely did. \n\nThe place has amazing sound, ","useful":5,"cool":0},"RcJSFTxYD8fEcHqZwhguAg":{"text":"Thank you Mister Bartender\n\nDBA  is definatley worth the visit.  We went  when a Salsa Fus","useful":0,"cool":1},"CuzKH6RLVyctKL2OIy2z0A":{"text":"I came on Halloween so it was predictably crazy, I didn't get to try any new beers simply ","useful":2,"cool":0},"K2CSX55wteU3jTjYnUJAVw":{"text":"Have always gone here every time I visit.\nLong lists of beers.\nHave a cover charge for Fri","useful":2,"cool":1},"5rYF3kBNQJ8TXrzihq-0DA":{"text":"This looks like just another bar from the outside. Who could tell that it happens to be on","useful":6,"cool":2},"K6xt2CJqJdRhLmEzWbw5mA":{"text":"I had the pleasure to make it to Frenchman and so happy I did. We ended up here b/c we wan","useful":1,"cool":0},"rtTLCaKMPfjbC9SJedmPow":{"text":"$15 cover? Better have BB King playing. Go next door or across the street for free music. ","useful":3,"cool":1},"56lq3VITogVUN5cCeKKJQg":{"text":"The Blues at this joint made my trip to NO worth it. \n\nThe beer selection was fantastic. T","useful":4,"cool":2},"goxipz5B1mnpwIkXNdNG8w":{"text":"Another review for bars on Frenchman...most of which I was sure I had reviewed. I think Ye","useful":5,"cool":4},"aBE6evgnxJCiihNIbWufew":{"text":"This place is awful. We ordered 4 drinks and 4 waters (trying to stay hydrated, you know!)","useful":0,"cool":0},"eSBbFRD5cmRTmP1FvBuvZA":{"text":"Always fun at d.b.a.! Great beer selection, awesome bartenders and the music? It's amazing","useful":0,"cool":0},"VHfDfK-plFeIZBZwNtXnMA":{"text":"Would not waste my time. Bartenders were to busy staring off into space and the door man w","useful":4,"cool":1},"-jTwb586DWpDGnNXc9MNPg":{"text":"We are from Chicago , so many of our friends recommended this place to us.   We were so ex","useful":2,"cool":3},"q_iqsm18WRmfszXU20PCDw":{"text":"I send all the tourists I run into to d.b.a.  First, because you got to get them off Bourb","useful":3,"cool":1},"YIlUUZjo5YnV--WZYePuNg":{"text":"4 stars only because when I opened a tab, the bartender forgot who I was and where to add ","useful":1,"cool":0},"2yRdF5veYZwvRlKp3eiP8g":{"text":"Dusky, musky, low--key and laid-back. \n\nLots to choose from - a great option for those gro","useful":3,"cool":0},"TCJighXzptmzrp-u-19Yfg":{"text":"GO! Awesome live music and you can dance all night. There is always a crowd no matter who ","useful":0,"cool":0},"bhT-_7IfIYdqrs162GH7Bw":{"text":"There was a 1-1.5 inch roach on the counter and they never flinched. They were legit not c","useful":2,"cool":2},"WaKcUSPsOvxWF_OfayhN8g":{"text":"This place is spacious and has live music. Huge selection of alcohol to choose from and th","useful":0,"cool":0},"2dKM_MBgEfljDfDOK3tkfQ":{"text":"This is the place to be for the local music scene. Get out of the Quarter and head to Fren","useful":1,"cool":0},"ZOmhcuZcAstXFLewOnG2sA":{"text":"This *might* be my favorite venue on Frenchmen Street, although, I didn't go to one that I","useful":4,"cool":2},"ubeVsnud93aD430xqg1kFg":{"text":"Great music venue on Frenchman! I have to check out whoever is playing here whenever in NO","useful":0,"cool":0},"ycivA-IRwgJGUJSb5Jj-QA":{"text":"READ THE WHOLE THING, Went there at 4pm last week to check it out, heard good thing about ","useful":4,"cool":0},"bmm3Gz__Z7ka65gNWKjiLQ":{"text":"I saw John Boutte last night..... saw him but could barely hear him.  I would see him some","useful":3,"cool":2},"H0o-pTRe5xmJQSrNG9RrHA":{"text":"Shout out to Brian!\n\nMy bff and I were in town for Mardi Gras and wandered into DBA while ","useful":2,"cool":2},"vi8fHEDKtwpeoRZJuTN3ag":{"text":"Great beer selection, fun bartenders and the live music was fantastic. Really enjoyed hang","useful":2,"cool":0},"MzvKwkYy1QEgmG5aB4LVyw":{"text":"One of the better places to catch real music in New Orleans.  Locals of course know better","useful":1,"cool":1},"vNxvZ5_JfTfWxB1Aqzd5hQ":{"text":"If you want to experience what New Orleans is all about, go to Frenchman Street.  I wish w","useful":0,"cool":1},"W_XDFnUqptkUGlMexaGt3A":{"text":"great live music, stiff drinks, just another new orleans gem","useful":0,"cool":0},"XeMIf9O6X-npsEQJMFbSNQ":{"text":"Had a great time with the other sitting in the \"fish bowl\" window people watching.","useful":0,"cool":1},"OyIUP1Ebn_fJWeyRJpB3Zw":{"text":"You can pick this place up and put it in Los Angeles, San Francisco or New York and it wou","useful":2,"cool":2},"lhbq5f2Ht0C2b9W6d9srqg":{"text":"Fantastic beer selection, world-class local talent, and fun crowds make d.b.a. a must-stop","useful":3,"cool":1},"3Z5578bsyZCudez1f59PDw":{"text":"Went to d.b.a. on a Sunday night with a group of friends.  We were all from out of town, a","useful":1,"cool":1},"CmpHwp5EAwbwHn4V3aVytw":{"text":"If I could give no stars that would be generous. Worst bartenders in town. Bad attituded a","useful":2,"cool":2},"SKSl4ruSDFnaWXgJMHeNgg":{"text":"How do I love thee? Let me count the ways? 1. you have one of the best beer lists in the c","useful":2,"cool":1},"Qe4rALqBnZfuPC2H0WkCmw":{"text":"Seriously good bar.  This review may only be intelligible to those who are in the SF area,","useful":5,"cool":4},"aJp5Ku-qWKcu5cOa4Hcy5A":{"text":"Great club! We enjoyed music so much!!\nGroup Debauch Russian maffia!!! Fun!!!!\nWe stayed t","useful":2,"cool":1},"GrMFP55PBhOpCYRuZ5mw6A":{"text":"D.B.A. charges a $5 cover on Thursday nights but for live music why not? Truth be told, th","useful":1,"cool":2},"PQXQEOYs28_h_eo2YCqpHw":{"text":"So many awesome ciders. Barkeeps are very nice and great atmosphere. Drink options for day","useful":1,"cool":0},"O_jVVQSKoObWA5qERN9msg":{"text":"I was in town with my mom and sisters, and several people had recommended we check out Fre","useful":0,"cool":2},"LVVGCteGPVcjUEteTUBkUw":{"text":"Great setting, a good mix of people (not exclusively young or old), and the opposite of Bo","useful":3,"cool":2},"L98aY_YT8d7gZxArhMpdfQ":{"text":"First time on Frenchman street.  Nice place love the drink menu. Not crowded when we went ","useful":1,"cool":0},"ULuRy2lfC-CrjlLlq3vmHQ":{"text":"I love the whole vibe of this bar. \nFirst visit and one of the best- they had a great bar ","useful":2,"cool":0},"_o5jDjhYQZCqqS7DPZboAQ":{"text":"Is it possible I haven't written a review for d.b.a yet? Crazy. Well, here goes....\n\nd.b.a","useful":8,"cool":3},"v8isALP9QZ3yjziia3SmHw":{"text":"Huge beer selection including a lot of craft options. Live music is common and tonight's v","useful":1,"cool":0},"uI2NQktbEPRc0FnJspring":{"text":"Our best night in New Orleans involved d.b.a. The night before we checked out the Blue Nil","useful":1,"cool":0},"MSyzsRM8edP7pVK4C958RA":{"text":"We picked up and selected this place randomly while bar hopping on Frenchman. It had a $10","useful":0,"cool":1},"bZGYckUqzEyFKrffpnhUkw":{"text":"One of the best bars I went to on Frenchmen Street. The beer selection was overwhelming an","useful":2,"cool":0},"6yhUGuX0VZXO12-a8HNTUQ":{"text":"Had sooooooo much fun here!! They have so many choices of beer, if you like to try differe","useful":1,"cool":0},"sowARSjXpuB7tHK1ZhZeMw":{"text":"Great place to see live music.  Amazing, huge selection of beers on a chalkboard above the","useful":0,"cool":0},"bJiBuPt7EaCHaFYqIMrefw":{"text":"One of our fav bars in NOLA! We came here on Saturday Oct 29th for a show with Papa Mali, ","useful":1,"cool":0},"nHFXaMlNU_RFvQTxUsD12w":{"text":"Great selection of craft beers at a reasonable price! We lucked out and got there before t","useful":1,"cool":0},"BOHo81Fe51yO-nSKH34hSQ":{"text":"Great drinks menu which is full of serious single malts or anything else that you fancy. A","useful":0,"cool":1},"idLHfD-dYpzKo-4L9gMk0Q":{"text":"So when i first visited nola, i loved this place....since then, albeit i'm not a marigny f","useful":1,"cool":0},"G86I23hHL3_RaSA60YrjaQ":{"text":"Worth a stop to see who is playing when on Frenchmen. The side of the bar with the stage i","useful":1,"cool":0},"e3KHcz8CJwT78TX0nC-zrQ":{"text":"I went in on a Tuesday night to watch the Treme Brass Band.   The first thing I noticed wa","useful":5,"cool":1},"HIcbKHNgTukQJSGDXnGwxg":{"text":"Impressive drink menu and local beer, fast bartenders, and $5 cover to see Wolfman Washing","useful":0,"cool":0},"5Wd3njuwi7oe_uyLa4lcrA":{"text":"Loud & proud, rock, blues, jazz!\nIf you are tatted, pierced, and like really good music (b","useful":2,"cool":0},"QDI1Qjw1AfDh21lt8R-fLA":{"text":"This is my favorite Bar on frenchman street. The music is good and the selection is great.","useful":1,"cool":1},"M314dhTSRLhiV-UZj4XowA":{"text":"Lovely bar away from the main tourist strip of New Orleans. The atmosphere is laid back, a","useful":1,"cool":2},"22uG_PtljDwtNxKWIZa1bA":{"text":"We just visited from Florida and heard Tuba Skinny here.  Great band, great bar!  Amazing ","useful":1,"cool":0},"uHawAAfFDIRUVTk4n2U5Vg":{"text":"I really enjoyed going to d.b.a. before HBO started airing \"Treme\" and I didn't have to fi","useful":0,"cool":1},"VqtpnlkDb2HqZEKS1J71Vg":{"text":"Stopped in with a couple of friends and they have an excellent beer an scotch selection.  ","useful":1,"cool":1},"auE18blnYfGkFrt9AJ-tLg":{"text":"went here for a business trip... asked around for a good local jazz place and DBA along wi","useful":0,"cool":0},"UmypHqvBYHRkCXksBaw1qQ":{"text":"This spot was recommended to me by the fine people at the India House on their \"where to c","useful":3,"cool":0},"5BJzUZ1Zn-HuX6t-UzWmVg":{"text":"A good long walk from the madness of Bourbon arrives you at Frenchman Street. This area of","useful":4,"cool":1},"_WBcbpcoMnC0Dy-Mn0iOXA":{"text":"This is a great bar/music venue on Frenchmen Street. Prepare to pay a cover but it is wort","useful":1,"cool":0},"ECg1W2oU0h6ecl0-gtVnAQ":{"text":"d.b.a. has the largest drink menu that I have seen so far in New Orleans. The cover was $5","useful":0,"cool":1},"IeodeKuZwbzX91Ekb5Ceuw":{"text":"This place. Man oh man. The music and the beer selection is amazing. We saw Andrew Duhon a","useful":4,"cool":1},"UUlo-4Q8YpMBHZHfRUS5fg":{"text":"There is just no other place in NO to go to for great beer selection and great live music ","useful":2,"cool":0},"QX3-C7NXiik8QgclPWggiw":{"text":"I love this place I've been here 3 times on 3 separate visits to NO. The music is always g","useful":2,"cool":0},"JQTQcgJulF86_ZFf0fIizw":{"text":"John Boutte played d.b.a last night, I think his first show in about three months?  We got","useful":1,"cool":2},"WO0yDkxJbz11OMmi_tm_tg":{"text":"Probably my favorite of all the bars I went to in NO. An amazing beer selection with a gre","useful":0,"cool":0},"iCsCDGBxcbFuAATW2w_iFg":{"text":"My second time in NOLA I was looking for something a little different from the norm and I ","useful":3,"cool":2},"D3B1r0yqIUcsgKzPG6Z-6w":{"text":"Been here twice now - solid music and great selection of beer. There is a cover charge but","useful":1,"cool":0},"u_t__ylWC-ZqAy4NmwrBRw":{"text":"Great atmosphere, bartenders are amazing and the live music was excellent! Brian was a won","useful":0,"cool":0},"DqOEpLKwDbarQTiZ56jPhQ":{"text":"d.b.a. is one of the best places in NOLA to see a band. They have plenty of room (unlike T","useful":1,"cool":0},"6Lxj6JsbsyBntEah66PIxA":{"text":"This place is my favorite. I go usually when there is no cover (for some acts, they do a $","useful":2,"cool":1},"Gd4cT-xO_6CI8614iBPfMg":{"text":"Great beer selection. Excellent bands. Good NOLA place all around. Except when Tuba Skinny","useful":0,"cool":0},"BQTGvEIMUUf3mtxT14diqA":{"text":"Large and open, with a beautiful stage that looks like a real theater.  There is limited s","useful":3,"cool":1},"kMR8TGKhP9TznJJintX7aA":{"text":"I didn't know where to go, so we asked the taxi cab driver & this is the spot we were take","useful":2,"cool":0},"XCdLrL3kYy6EKAM8ggvZgg":{"text":"Awesome place for live music. We spent $5 and saw a jazz band on a Tuesday night. \nIt was ","useful":1,"cool":0},"oC6VnXNU9WcfyuFRel4NpA":{"text":"Disappointed int his place.  Mostly young crowd. No band from 9pm to 10pm.  Was supposed t","useful":2,"cool":2},"erSEiVFjcqqn_z6DKK13Bw":{"text":"d.b.a. New Orleans is one of my favorite Frenchmen Street music venues and I have made it ","useful":4,"cool":0},"fa4_7LNoiUuhpVgVgUR4Vw":{"text":"Band was fine, but the bartenders were too busy drinking their own product to pay much att","useful":2,"cool":3},"t-gOGYbBWwFiDfH9hPcBcg":{"text":"If you're in town for topless bars and karaoke, don't even think about coming down to Fren","useful":4,"cool":3},"5-LrK9ofVO_16ACt2s-9mA":{"text":"An amazing place to see a show, or get a drink and hang out...or both.  Two rooms with a b","useful":3,"cool":1},"4aXAiuBK4m0etbYAJY1DjQ":{"text":"My review is mainly on the entertainment which was great. The jazz band that was performin","useful":0,"cool":0},"uR1rTA4X0KJreCeoi4NFTw":{"text":"We wondered in to this bar and were seriously impressed by the huge selection of beers on ","useful":0,"cool":0},"eis4rqk107u9tmN9TrlEcA":{"text":"Love d.b.a.! We loved Luke Winslow King who plays here for free there Monday at 7. Great b","useful":1,"cool":0},"XxPsgZNwROyFRFRj6AOeyw":{"text":"I have lived in New Orleans for 10 years. I've gone to DBA quite a few times. It is. Cool ","useful":5,"cool":3},"qG0cTEJ04lk3xX7x1kTxTA":{"text":"Old school Frenchmen Street New Orleans.\n\nMy favorite place to go to on Frenchmen street. ","useful":1,"cool":2},"Vse8KKXT6mlc1LZDOLu45A":{"text":"Wow, what a great place. Saw a couple excellent bands and had a couple reasonably priced d","useful":1,"cool":0},"6-xmIJJnjAosI162Op058Q":{"text":"The first thing I noticed about d.b.a. was the beer list. As a certified beer snob, I was ","useful":1,"cool":0},"9V-e_eT7jsdHE8XO9zwcZg":{"text":"I've been a long time fan of dba in NY (and just recently went to their location in Willia","useful":9,"cool":8},"GhQXSPAYO5Khrj4UuPxGNQ":{"text":"Wish I could remember more about this place! It had a great vibe, live music and I think t","useful":0,"cool":1},"pR2DuwbfsnErDc3MEdw4dw":{"text":"Fantastic music. Perfect dance floor. Great bourbon selection. Bartenders? Not good. I kno","useful":4,"cool":0},"AuBufYxUy4pqmYvvms0eQw":{"text":"Great bar. Had so much fun went back for a second night, but unfortunately day two wasn't ","useful":7,"cool":3},"dY2g4FkTdzmqS0sMMmO3wQ":{"text":"Good spot. Go early and claim a good spot / avoid high cover. A large drink selection and ","useful":0,"cool":1},"vMt5rGyOp92olVbCyZX2lQ":{"text":"If I lived in New Orleans, this would be my place. I'd heard good things but was not famil","useful":4,"cool":3},"4pXDbOl4GviwNZw1K-FNkg":{"text":"I wasn't in this place long enough to give it 4 or 5 stars, or to write a longer review. W","useful":0,"cool":0},"ftjW2YgXaP5d0EIvqGwEHQ":{"text":"During our night on the town on Frenchman we dropped into D.B.A.\n\nWith a $5 cover, we expe","useful":3,"cool":4},"zw6lJTbZfWROsqzOEKq5Tg":{"text":"Great tunes, great beer selection. To wit, one of my friends tried to order a Coors Light.","useful":1,"cool":1},"SyXMfeI3rTEMdjQhhstBuQ":{"text":"Best people watching bar on Frenchmen! This bar has 2 sides: one for a more relaxed bar fe","useful":2,"cool":0},"9W4XdKLIj_mZLIRyZoRU2w":{"text":"Tired of the ghettoness of Bourbon street?  Looking for something a tad more upscale than ","useful":3,"cool":3},"_Pv63blHSUJD-arl--2x9Q":{"text":"Mostly standing room, but decent floor size. I think there should be a rule that all tall ","useful":1,"cool":0},"JF1YJtkUFi90yCa0GNfhJg":{"text":"Awesome shows...but always a cover and the bar prices aren't great.","useful":0,"cool":0},"Wfqqb97Xpo2NTCBEKJWLyQ":{"text":"This is supposedly where the locals like to go.  Then again, most of the people in there w","useful":0,"cool":1},"X5ho-Q6hryTENCsej_YkYw":{"text":"By far the best music venue we went to in NOLA.  This is New Orleans at its finest.  A lar","useful":1,"cool":1},"XyNRfWb0v26npYXetkXSAQ":{"text":"I have never seen a bad show here. No matter what time of day, day of week, time of year, ","useful":1,"cool":1},"VudPNqJhimwO1RgQJzGP3w":{"text":"It's a shame that the staff is so cranky because the music was great! There are way too ma","useful":2,"cool":1},"_Gz1YSknMRgjpTxKq3G3gA":{"text":"Great spot for music on Frenchmen street. I've seen so many great acts here and often for ","useful":2,"cool":2},"vJugEDCnyHjK0S5lcZ1d6A":{"text":"Great selection of bourbons, much cheaper and friendlier place on Frenchman's than anythin","useful":1,"cool":0},"U7cGYfY6VO5LiF80TPySww":{"text":"Wow. Never in my life. We came to New Orleans and have had nothing but the most incredible","useful":3,"cool":2},"cUALWkByCey58XCl_PE6Ug":{"text":"Our favorite spot on Frenchman Street. DBA has a great beer list and consistently offers s","useful":0,"cool":1},"SDn587DlgUHlC_zzwva6Qw":{"text":"Came here two nights during Mardi Gras and saw great shows both times. Looks like a few of","useful":2,"cool":0},"xzp7Eu5XlvlF1w-t4wClDw":{"text":"Live music in the big easy is in abundant supply, but this spot has that authentic feel to","useful":1,"cool":0},"UdxGOcvlIuWBLkx-xoXBJw":{"text":"I love the live music here! This bar is awesome and the drinks taste amazing. I love the e","useful":0,"cool":0},"P6LxR-vYjXR_I6OXVqFwMQ":{"text":"love love love this place  one of the best times on my trip  ill be back in sept","useful":0,"cool":0},"sndCytcEa-s1Z2NnZ9KK5Q":{"text":"Unusually clean for a bar...non smoking too!  Live music is smoking though, as is the beer","useful":0,"cool":1},"N-KBwnHXip0lrTCfeb9j-w":{"text":"I enjoy local Jazzy / Blues.  The d.b.a. is one of my favorite spots to hit when roaming F","useful":0,"cool":1},"9XXYr4W1rNr8deosCz6ZuA":{"text":"Another famous place that I've only recently attended. \n\nThey have a huge beer selection, ","useful":2,"cool":1},"T5vMGheb9erSh_bvLjMzXA":{"text":"Stopped by DBA to hear the Palmetto Bug Stompers with Washboard Chaz. The music was amazin","useful":0,"cool":0},"nlcWLs1nY8nccj4jlHpc_A":{"text":"This place was very cool.  Our last night in Nola we hitched a uber ride to this area a li","useful":2,"cool":0},"uCKYE_i9apUreF5VOqrodw":{"text":"favorite spot in frenchmen.\n\nprivate booths, great bartenders, best music on the strip, an","useful":3,"cool":1},"J3ZlZHentZ1sZFc8A-4mAg":{"text":"As an IPA drinker, the beer selection left a bit to be desired for me, but it was really h","useful":2,"cool":0},"sHM6xuF2qnkBDloaavukWA":{"text":"As a 37 year old who wanted a bar that was a little more upscale, but still felt like New ","useful":4,"cool":4},"98v7EDzb63PyOm9F1atvhw":{"text":"It is absurd and loud and crowded and I loved it. While the wait time to get a drink is ob","useful":0,"cool":1},"Vyfe3nRSe9DSKIQDwLWQPw":{"text":"There was a really great band, Tuba Skinny, playing on Friday night and the old fashioned ","useful":5,"cool":1},"kBhTIVYEg7ZtOsUcNlIJmw":{"text":"Best music I heard in NOLA - super cool vibe every night I was there. Drinks were pretty g","useful":0,"cool":0},"v2BGMHt_fp3HQAPIaEu85g":{"text":"DBA is probably the bar I like the best on Frenchmen as they have a great beer selection a","useful":2,"cool":1},"FRwnb6lQWPEDLHXhRsAFWA":{"text":"Check the bar's calendar before you go! I really wanted to go to check out the music, but ","useful":1,"cool":0},"p-Fg4W-K5Q1jGNwm-lvBEw":{"text":"I'm not a beer drinker but I love live music and this spot has some of the best, but then ","useful":1,"cool":2},"uWqK78ilr7TuTJAma6L-DQ":{"text":"Came here to listen to the Cottonmouth Kings (formerly the New Orleans Jazz Vipers). This ","useful":1,"cool":1},"Pma2g_0Ntt1vrYyw-Y5Dsw":{"text":"Great music, great venue and great prices.  The night we were there Dr. John strolled in t","useful":0,"cool":0},"FP2ajLyJxEIbmwHcXq6zNw":{"text":"So just yesterday I found some cell video I'd taken here of a Walter \"Wolfman\" Washington ","useful":0,"cool":0},"_5d3fR4T1N6QLHCaqboJcg":{"text":"Great variety of liquor and beer. Chill spot with a nice atmosphere. Cover charges are a b","useful":2,"cool":0},"PtvYo6lt-Y9pERhGdKRiVw":{"text":"Great place to watch a live show and have a nice Craft Beer. \n\nThe music here is awesome w","useful":1,"cool":0},"EyGmOiczrn52moVPLFCVmQ":{"text":"Great place to listen to awesome jazz music and eat crawfish. My friends and I came on a S","useful":2,"cool":0},"jyTDcF1UF3hkHGcqqKX6Dg":{"text":"Best music and bar spot I went to in NOLA. Just don't listen to the junk on Bourbon Street","useful":2,"cool":0},"V06mfeLcHi9Fq39FL5XIrA":{"text":"Found this place on yelp and it was a Monday night with Glen David Andrews ($5 cover). We ","useful":1,"cool":0},"mqGjZwDFXYMs42o9NgfNEA":{"text":"Seven years (and dozens of visits) since I've last reviewed DBA? How is that even possible","useful":24,"cool":20},"VR9eP8VEuW6LrZ-XExO38A":{"text":"To me, this bar is just \"okay\".  I'm not sure how else to explain it.  \n\nI've only been in","useful":4,"cool":2},"uR1POSWhWG5uNs6T_5UpuA":{"text":"Music like you can only dream of in New Orleans, really absolutely fantastic. Drinks are g","useful":1,"cool":0},"-_KTR-_NL9nJgvbz2uIViA":{"text":"No trip to New Orleans would be complete without a night out on Frenchmen Street. DBA is o","useful":1,"cool":1},"nKo7ryPGgtRtIkwIpx4Tmg":{"text":"Way cool! d.b.a. did have a cover the night we were there but it was only $10 and boy was ","useful":3,"cool":2},"T1HjDCLKQqiopKUktv8IFA":{"text":"Woooooooooooooo!!!\n\nMy neighbor John M was spot-on....so is MSG. Back in the day, when War","useful":7,"cool":5},"GDVs_LEtprfLRj8QOEHGKA":{"text":"Amazing venue. This is going to be, if not already, an iconic New Orleans place. I think i","useful":0,"cool":1},"HVgwlU5GMyVCuObsNjz4bQ":{"text":"The only reason I gave this place 2 stars is because they have a decent craft beer selecti","useful":2,"cool":2},"sKmojr_05Xdl_o7cAWfsIg":{"text":"Out of all the bars we visited while in the area, this was the nicest one. It's small but ","useful":2,"cool":0},"yiHBXFJM46-Cx8pw39gbwQ":{"text":"LOVED IT!!\nFrenchman Street at it's best. The music is consistently good. Love me some hor","useful":3,"cool":2},"kuIYVF2Vzz1sT0RjajsFZQ":{"text":"The real deal.  d.b.a. cannot be missed if you are in New Orleans.  \n\nWas here last night ","useful":0,"cool":1},"U7RBbNXBxX2nQc64nCN-sg":{"text":"We went here to check out a band we heard at Voodoo that was playing late night.  It was a","useful":0,"cool":0},"7VDSYs6R1m0LnQqFt38ALA":{"text":"If you're thinking of going to DBA or Frenchman...just do it, you probably didn't need Yel","useful":0,"cool":0},"VWsQwGoqwW_b77vJyUL1sg":{"text":"You simply must experience traditional south Louisiana LIVE MUSIC here. It's real...it's r","useful":0,"cool":0},"vyK01D2Q2CCWjSCjbkGbNw":{"text":"I almost don't want to tell anybody about this place. Frenchman St is where it's at and it","useful":1,"cool":0},"BCtePFWkt5ypg2o3eX27SQ":{"text":"This bar was amazing. I was visiting from out of town and landed here for the evening. Che","useful":3,"cool":0},"eLiiW_F4snWhvidHS8KAug":{"text":"Definitely my favorite on Frenchman and, thus, my favorite place to see music in New Orlea","useful":1,"cool":2},"6K9Tq1wh_eWGwu-huViMUA":{"text":"A very nice music club. They usually charge a small cover and seem to have top bands here.","useful":4,"cool":1},"MP8nXpoM5I0KR0QxozPwag":{"text":"This place is where the real jazz fans in New Orleans go, much more down to earth than tou","useful":3,"cool":0},"Ufqhqfz0Ivt15-xUdmplQw":{"text":"I'm not even sure where to begin since everything about this place is rad.\n\n A friend reco","useful":0,"cool":1},"56eRgL8Rdfs3lZKwSmKuhA":{"text":"I had a hell of a time here as I got to see Glen David Andrews on Monday night!\nHe is an a","useful":6,"cool":5},"EEdpNHxQJmA4xGEX0r00Cw":{"text":"Wonderful live music and a good beer selection, just $5 cover. A great way to cap off our ","useful":1,"cool":0},"fsxQMYnQBIrbQ2doGhWlqA":{"text":"Favorite beer bar in New Orleans.  Always a great selection, good live music and worth a s","useful":2,"cool":0},"rsMkIvIE7CrkzrY186e9XA":{"text":"A fantastic place on Frenchman. Excellent place to listen some really good live bands, enj","useful":0,"cool":0},"ZEY4p8TTUeDwqG7qx3AkNA":{"text":"i was predisposed to like this place because i used to live in nyc, in the east village, a","useful":2,"cool":3},"DHjYcwwGwtVxuEpO_S0DRw":{"text":"I highly recommend this place. One of the best music joints in New Orleans. They have a gr","useful":0,"cool":0},"uxPWUMFHNEugR6ksAOav4Q":{"text":"This is certainly the best live music bar in New Orleans I absolutely make it a must to tr","useful":2,"cool":4},"p7xnUMv8ZnhuRDr-2lRLbw":{"text":"They keep this place nice and cold during the day (bring a sweatshirt), great selection of","useful":0,"cool":0},"TxOpY6VCIzB9nDjDRJVr_w":{"text":"Wandering Frenchmen with friends (not French men, alas), we bounced between a few cover-le","useful":2,"cool":2},"Jv7-ppvTM_JPmz77t7WAvg":{"text":"We were told by a local that we'd met the night before that this was THE place to go to ge","useful":2,"cool":1},"bpLwh4pDdjtPJ22YRWGvoQ":{"text":"GREAT live music venue.\n\ngreat atmosphere, great beer selection, and a strategically place","useful":1,"cool":0},"U_LpCGiKj6fmN4MDDlmHtg":{"text":"Good drinks and music! Have been here every time I visit NOLA and keep wanting to go back!","useful":0,"cool":0},"LEu4jJwnjBdfULZDTtrVqA":{"text":"Everyone said, \"Go to Frenchman Street!\", and we did, and we loved it.\n\nSpent most of the ","useful":0,"cool":1},"5euENl3ZaohA9xtYBmJuew":{"text":"I would like to encourage all my local friends, and any who visits the area, to join me as","useful":2,"cool":0},"51TQ9bdEmCQjoP6LAZxYeA":{"text":"Love.\n\nHit up d.b.a. twice on a recent trip to New Orleans and had a great time both night","useful":0,"cool":1},"lW0yyJ7yl9qzz7FGlTfz9A":{"text":"We initially attempted to hit the Spotted Cat, but it was jam-packed, so we ambled across ","useful":9,"cool":2},"n1ittsnhDqYqV8R5VT_1Fw":{"text":"Normally I wouldn't give a place like this 4 stars more like a 2, but it's New Orleans. It","useful":3,"cool":4},"pAwC03iOVf9zzw9NFVTP_w":{"text":"Had an absolutely lovely time here last (!) night. After walking down the tourist trap tha","useful":1,"cool":0},"2VM9DN5JdpEqCPPWtNCVPA":{"text":"Great place for live music and drinks. It's a small place but you will have a good time.","useful":1,"cool":0},"U0ODZgshzMSYqPxVU6EEBg":{"text":"I hate places where you have stand and listen to music. Don't get me wrong, the music was ","useful":3,"cool":2},"2pzoANx4rd-mQHpHqitHCg":{"text":"We we're told to visit Frenchman Street where the locals hang out. We being a family group","useful":6,"cool":0},"ZRMF68I9mYLl4nr7WVydTQ":{"text":"Best beer selection on Frenchmen and anywhere in the area. It's also a nice mid-size music","useful":7,"cool":7},"kmw5DXoeoZ9vOiEI8ZyteQ":{"text":"This was a very cool live music venue. The drinks were great and we watched a very cool lo","useful":1,"cool":0},"2O3_TvgVB_U05eNkCvVGEA":{"text":"One of the coolest spots on frenchman street, with room for dancing and a great beer selec","useful":0,"cool":0},"_R7i0BgwIELIiEI6Wc5YuQ":{"text":"My first DBA crawfish boil! I have dances the night away here to some NOLA greats a hundre","useful":1,"cool":0},"jGQItbSnjB-wC_6I79MeDg":{"text":"WE DON'T SERVE MILLER LITE, BUD LITE OR COORS LIGHT!! I'm in. Great place for live music. ","useful":0,"cool":0},"pXKwqKueysDeFgXqxABB9Q":{"text":"D.B.A. is an awesome place! I've aged out of most of the Bourbon Street stuff by now, and ","useful":0,"cool":0},"nZrnynU2FlKbt2e1Xzme_w":{"text":"Great music and a vast drink menu especially in the beer department. Good service. The atm","useful":0,"cool":0},"N0VPcnV5yoy0SNjQSgTvdQ":{"text":"This was one of the coolest bars I've ever been to. I watched two bands over a period of s","useful":0,"cool":0},"rCbz3t2wI3a9CoSPLh_J7w":{"text":"The bar itself, the atmosphere and the music were wonderful. But the bartenders bring this","useful":2,"cool":0},"bm0i-PiskjhwVqJA7Nd2Mw":{"text":"This is a great place for live music! I like to sit at the booths in the front to people w","useful":3,"cool":2},"1Vc_nxHdCdgZMkSRjnvdrw":{"text":"Twas the night before Halloween, when all through the Quarter\nNot a creature was sober, no","useful":7,"cool":15},"2MK_r_S0mm7bxmaA1X2Ucg":{"text":"like this venue. spacious. easy to get a drink.","useful":2,"cool":1},"mwAhi0Mo55Rp1atIfeCsyg":{"text":"We happened on this place early in the evening thinking we'd get a \"to go\" drink and had a","useful":0,"cool":0},"-kbkLkp9zqykAcpH4UE9Ew":{"text":"Great place, great beer and liquor list, great music.  The bar divides the space in half, ","useful":0,"cool":0},"dpFKofDdMdRfaAozKxCQwg":{"text":"Great bar, excellent bartenders! The jazz band was great but rude! Asked for requests and ","useful":0,"cool":0},"mEtJKKHmDL_PYwq8lRZkeA":{"text":"Nice ambience!!... And the thing I liked the most was that there are drinks from everywher","useful":1,"cool":0},"kgm8_BztY8z3IahBwpESlw":{"text":"A cool hep with an e spot for sure. Large, dark, lots of wood, short on seating, tons of v","useful":3,"cool":0},"SweGHRR1M6FbE08EpQ_BIA":{"text":"Great atmosphere! Hot 8 Brass band was the spit! The plethora of drinks that are available","useful":1,"cool":0},"I_0hbQM3_Mt8Zzku1K3B6g":{"text":"For the music, it is hard to beat but prepared to stand.  That said, don't use their ATM a","useful":0,"cool":0},"M8V9QBaEECsSYiW5PFkY7w":{"text":"They get five stars for the beer selection alone. The rest is just icing on the cake. The ","useful":1,"cool":0},"S8qkDKwF6VXEi6qurfVbIA":{"text":"Whoever designed d.b.a got it exactly right.  The wood, little cut-out nooks, split sided ","useful":2,"cool":1},"UFOW9Eiimnt5OtJB7zzhTQ":{"text":"We saw Charles Elam and then the house band.  They were both fantastic!! New, casual and w","useful":0,"cool":0},"95U3qmEc9vI_NiOZjbIMKw":{"text":"d.b.a. is an awesome venue on Frenchman. The layout is pretty interesting; there is a bar ","useful":5,"cool":0},"eAOaFR68msUffnNbZ6346A":{"text":"So I've been here many times in the last 4 years and have had some good times, but honestl","useful":3,"cool":2},"EI3d9kCeKdvKZTM2lXJy8Q":{"text":"Between work and play I probably spend more time in music venues than anywhere else.  Thou","useful":0,"cool":0},"Zd7VNvTrdB6Qdp9WkVqCMw":{"text":"Always have a good time at DBA, but definitely prefer the early shows (I'm old). No fault ","useful":1,"cool":0},"lyOAzEhSn4xySVaOMisSkA":{"text":"I was on a business trip with others. We found this place on Yelp and it lived up to the r","useful":0,"cool":0},"uEc75aP_AG1t6NN8ALA43g":{"text":"I frequent d.b.a every time I want to hear good music - swing, hill country blues, western","useful":1,"cool":0},"81Df7TqXP7a0hyZRUQFWjg":{"text":"Loved the live music here","useful":1,"cool":0},"P2AYSYZIsbS3XvCXTpT4Pw":{"text":"Great place to enjoy live local music. The bar selection is deep but they don't have many ","useful":4,"cool":3},"g_TSsSsx-W_O7SrgT9G9Qg":{"text":"The music was GREAT! There was no cover charge, you only had to buy a drink. Unfortunately","useful":0,"cool":0},"7Ux-3ixGh3JgJOWhjJzhmA":{"text":"Came on a saturday night where there was live jazz playing. The music was amazing (like li","useful":0,"cool":0},"vx58vHAIwk4jj5ETdMpmpQ":{"text":"I don't know why they have less reviews and stars than Spotted Cat Music Club. the music i","useful":0,"cool":1},"jldMtmdlzCxyGyFbuVyO0g":{"text":"One of my top priorities (aside from eating everything in sight) was to see a Jazz band du","useful":8,"cool":4},"C9y4AXW1Omba5mSn_YFicQ":{"text":"Stopped at this bar for a drink before our dinner reservation down the street. Very lively","useful":0,"cool":1},"6NCKb9kojkKmKoqG4QoK7A":{"text":"I have a soft spot in my heart for D.B.A.. It's always the first place we go to on our fir","useful":3,"cool":0},"PpEYAt-z888dcBl7-dAxUw":{"text":"Neighborhoody, laidback, roomy, and full of random types (a bodybuilder, a lesbian cowgirl","useful":0,"cool":1},"1O2ZnH3AHbZSU99fEsJFPA":{"text":"this place is hella fun at all hours! good music, huge selection of alcohol (catdaddy moon","useful":1,"cool":0},"ggsjW5dq-3ltocNgCagnPg":{"text":"Wow, shockingly bad and racist experience at dba this evening. We came in to hear John Bou","useful":8,"cool":0},"8XGNHBWDL3bL0Fx6lXLb2A":{"text":"Not often would I conflate NYC & NOLA... but here, it works. I never would have imagined s","useful":10,"cool":6},"VB7Wp5nCN1T6ugsxw59AFQ":{"text":"dba has been my favorite Marigny bar ever since it opened.\n\nThe staff is amazing, their ba","useful":3,"cool":0},"rd7J5g9hOdWikM45WTMwRw":{"text":"d.b.a is awesome--probably the best bar that we went to during our stay in New Orleans. I ","useful":1,"cool":0},"L2E8PhjSsqakAwEAsJBtaQ":{"text":"Awesome selection of beers and ciders. Great music. My favorite spot on Frenchmen St. Trem","useful":1,"cool":0},"Fl7Iaev1LL3Tf15E5Ko0Gg":{"text":"It's called getting \"A Wild Hair\", otherwise known as no I'm going to chill and stay in to","useful":17,"cool":12},"zfz4pw83UJToisRTrLVPnQ":{"text":"Nice little bar to have a drink and listen to the bad.  There is a cover charge but its wo","useful":0,"cool":0},"d-Ayh597eRxzLU-CLlk0_g":{"text":"Good band and nice space.  Trumpet Black and the Heart Attack was playing.  Good sound, a ","useful":4,"cool":2},"VqsFuPRFt-4blHH0zcZeUA":{"text":"Very racist. My non-Caucasian friend got LOCKED out of the bar for no reason at all. The b","useful":0,"cool":0},"6NAjrUhGMguI6YFF1a_0pA":{"text":"Tuba Skinny was playing on the Saturday night I stopped in and the music was fantastic. Th","useful":1,"cool":0},"IbWIPuuRZgsjCFkWMzf4bg":{"text":"How to win my heart over in a few easy steps:\n\n1. Have a rad bourbon selection. In fact, h","useful":12,"cool":10},"zQiX4KyiHFa4IQ3dWCcRBw":{"text":"Saw John Boutte perform there on a Saturday night made my trip to New Orleans complete.","useful":0,"cool":1},"chsi-BKzMjCoO4xM0ZyUWQ":{"text":"This was one of my favorite bars on Frenchman St. The ambiance is great--Huge space, 2 bar","useful":2,"cool":2},"GpzaRoRgZwnupUI8npQGrQ":{"text":"Its always a pleasure to enter this great establishment on Frenchman Street, as they not o","useful":0,"cool":2},"jaAa3-3V_imoi85vBRov5Q":{"text":"No trip to New Orleans is complete without hearing some LIVE MUSIC on Frenchman's Street! ","useful":4,"cool":1},"p1ikouZ6TM6JSwfxjZC7gQ":{"text":"Totally blown away by how good this place was.  Worth the walk from French Quarter through","useful":1,"cool":1},"Zqhfq-RIDlc4-e6NssdOMg":{"text":"Best live music experience in New Orleans. Came  on a Monday night to check out Glen David","useful":2,"cool":2},"h7CSO_xbtgA_6hTc7O-sFg":{"text":"A 100 different types of beer and live music- what's not to love?? I was able to escape fo","useful":1,"cool":1},"_8UlKYCrqlxz6xpPEZctUw":{"text":"If I felt any more at home here, I'd have dropped by to pick up my mail: I adored d.b.a fo","useful":3,"cool":4},"9E3oQ9jJ9ggR3rh0SPD-KA":{"text":"Forget the other streets, Frenchmen is the place to go in NOLA. d.b.a. gave us a great nig","useful":15,"cool":13},"OXEzfiGKNNZdOSqf4ARNxA":{"text":"This place was never really my style. That, and it was WAY too cold for me in there. I wou","useful":1,"cool":2},"WQbrVc0o07RnDxc9DchmQg":{"text":"This is how a Blues Bar should be dark and a little \"seedy\" ( in a nice way)with  a band p","useful":0,"cool":0},"ZK1GbVqGEOfvQArcJnQXDw":{"text":"First off, I'll say that this place is a million times better than the sister one in NY wh","useful":1,"cool":2},"gjic_uey1sxAwIP_doeZkQ":{"text":"Randomly found this place earlier tonight and was greeted by an extremely rude bouncer and","useful":1,"cool":0},"ahk7lRng7DcuespYtCckwQ":{"text":"I'm a very big fan of d.b.a in NY - both the Williamsburg and East Village locations are f","useful":2,"cool":1},"4QSgy5nk3LzerFkmrD_niA":{"text":"Far and away my favorite Frenchman Street venue. Don't even bother checking who's playing ","useful":7,"cool":0},"qIO4fneXLOxyGVz7U3Ittg":{"text":"Came in and got some strong drinks, listened to some amazing live music, watched drunk peo","useful":0,"cool":0},"R8XYzSzhAMzGwREWB_Lqpw":{"text":"Obviously a happening place on Frenchmen St.  It is an enjoyable spot, bur far from my fav","useful":2,"cool":1},"D4XUUm3RNZbPKd5Cvs8Fgw":{"text":"Came here on the recommendation of a friend last Thursday. It did not disappoint. Their dr","useful":1,"cool":0},"I0wlMwtRc98mhQ_kx-qAug":{"text":"To ring in 2011 the right way, the girlfriend & I spent the week around New Year's Eve in ","useful":2,"cool":1},"MbXeJ-ppWdrwmLbXJTqBpw":{"text":"We came here after doing in at Spotted Cat. Still had great music, pretty cheap drinks and","useful":0,"cool":1},"Dau872ISPo3sWQGPXQ3EnQ":{"text":"This looks and feels like a dive bar, right down my alley. The decor makes me feel like I'","useful":0,"cool":0},"iXncHcsZ-SLB1kcIzZ1lRg":{"text":"Let's face it, people. I am the best. You know it, and I know it. The world has never seen","useful":13,"cool":17},"cM_XLMXCyevKsmxgr1O94Q":{"text":"Great jazz place, about as good as it gets Great jazz place, about as good as it gets Grea","useful":0,"cool":0},"ARfqVVJ4vzVxcMH2uyYKEw":{"text":"Normally a great place. \n\nHowever, with their $5 door charge, rude bartenders, and $1 per ","useful":2,"cool":0},"W3l9VwAcLViFfDLD9FpHBA":{"text":"This is by far my favorite spot on Frenchmen St. Granted there is almost always a door fee","useful":2,"cool":0},"DDe2A1oMBJJFngwY_rDwkQ":{"text":"DBA New Orleans is a great small venue to have a drink and listen to music. The night we w","useful":10,"cool":9},"-xHjtMIgIc1O2tXaEiSV4A":{"text":"$20 cover and not much to offer in beers. I'm not a hard alcohol person. Young and older f","useful":0,"cool":0},"SrtTRA87PFJkj3vrHz7YTw":{"text":"I love this bar. I love the beer list, I love the wine list, I love the jazz, I love the d","useful":0,"cool":0},"1UX7g9FmmQOgn_eFZg6FWg":{"text":"LOVE their beer selection! There's a $5 cover charge - and I did not mind paying it. I rea","useful":2,"cool":0},"MxoYr8kMiqyo5lpj9q7_HA":{"text":"Stopped in for a drink to kill time before our tour and ten minutes in this place I was re","useful":0,"cool":0},"JxWco4ZxwP9Tia6TPily0g":{"text":"Great beer selection and live music.  I didn't see the number of beers on many menus at ot","useful":1,"cool":0},"Aq-mecqp-bKMd0JZVJXx-g":{"text":"Touted as one of the few non-smoking live music/bar/eateries in Frenchman Street we may ha","useful":4,"cool":3},"2ZLqnvRD70Q5sY-IgwPWUg":{"text":"i'm usually not a fan of live music, but this bar blew my mind!!! the energy and talent on","useful":5,"cool":3},"Iz0TUxu8f6GYq1Tzo4qtPQ":{"text":"We had such a great time here! We saw the Glen David Andrews band on a Monday night. Only ","useful":1,"cool":0},"Z8ujJQwvbugEkT7cMJrW3A":{"text":"Stopped in to see Little Freddie King and have some drinks. He is the real deal, Good acou","useful":1,"cool":0},"JahPHEUqQSEoXrdRDcGW4A":{"text":"This club is doing things right! We were able to enjoy a few outdoor jazz and blues concer","useful":1,"cool":0},"0uoIHl5NiA8oIiWUUcl_8A":{"text":"Bang for your buck: 8/10\nQuality: 9/10\nService: 6/10\nAmbiance/Location: 10/10\nOverall: 8/1","useful":1,"cool":2},"MYDA4Or3v9L62DiCaL7Azg":{"text":"Just downriver from the Quarter lies the densest concentration of awesome. Step away from ","useful":7,"cool":8},"yITwQQWjvWNgI3lRlBeREw":{"text":"D.B.A. Always has great bands and I really enjoy the space. Drinks are reasonably priced c","useful":0,"cool":0},"_dqG502FWoknltjKSJR1rQ":{"text":"We went to D.B.A to see the Swingin' Gypsies on a Fri night. We were aware there was no co","useful":3,"cool":0},"TjqPDbSi9JeEs8vpYagQ8A":{"text":"Wandered in off the street to catch Treme at d.b.a. on a Tuesday night. \n\nOk, that's not e","useful":4,"cool":0},"wyki5H8YD783m1YvQHAk6w":{"text":"Spent NYE here & heard the Dirty Dozen Brass band. My friends & I loved the band and the b","useful":1,"cool":0},"QOx8CPR3sMGXrmK0vXzQGw":{"text":"Attentive, if not overly friendly bar staff. A drink menu that goes for days - truly somet","useful":2,"cool":0},"FMNNQgiuUAt2UDzYAn-uXQ":{"text":"I'm unsure why it has taken me all of these years to write a review of dba... but no matte","useful":1,"cool":1},"BteSoVSRtow0q_WUlmu-jA":{"text":"d.b.a. is my favorite live music venue in New Orleans. It's a small, intimate venue, with ","useful":10,"cool":4},"xicUOWiOc3t26vHK13i_yA":{"text":"While most music on Frenchmen is free, it will nearly never be at d.b.a, but consider too ","useful":13,"cool":10},"bYXBieHyg9zdR_yTqUn5sQ":{"text":"Great place with decent shows. We went here on a special night with John boutte. The show ","useful":0,"cool":0},"n5HnbX36M7rWwJNObh0pJw":{"text":"The band that was playing was great!  There were no tables, just a couple benches and bar ","useful":1,"cool":0},"-DNVac1fk1EWGkh-1Vz_RA":{"text":"Yes, there was a $15 cover on Friday night but we were far enough into the night that we w","useful":2,"cool":0},"enriUl9dxMxQYNxJby1YMw":{"text":"We were told to come here for the best music in NOLA.\nDBA did not disappoint for entertain","useful":2,"cool":2}}