{"6JlqBQgiG2s0tHkfWYIqAQ":{"text":"Their Sunday vegan brunch is amazing! A lot of vegan spots rely on meat substitues, but no","useful":0,"cool":0},"utwbaEr4uq9-gv8mB3eQsA":{"text":"This place is an institution in empowering a community. My friend and I received incredibl","useful":3,"cool":2},"TGiDiy3p-zA1OfWCmmjt5w":{"text":"Absolutely wonderful! I stumbled upon this hidden gem while walking my dog near my rental ","useful":1,"cool":0},"aPljLjwfSpS5hoI4inEJEg":{"text":"Went here for an open mic back in February! Wish we could bring them down here to South Fl","useful":1,"cool":0},"gnR5kuyBKNcEQb5LCafT4g":{"text":"Honestly more people need to come give this place a try. I promise you their sandwiches ar","useful":0,"cool":0},"QfbQjyrXvStxYKCeiSwuLQ":{"text":"Where to begin... Between the one of a kind drinks, the ever surrounding feeling of love, ","useful":0,"cool":0},"HN3x8JZsUsUtBidnn1Dxaw":{"text":"So many good things to be said about this place. The vegan brunch is what originally spark","useful":4,"cool":2},"VpXLweLS_cQbi6ASy5y75g":{"text":"I've been to this establishment twice. The first time I had the vegan hot sausage sandwich","useful":1,"cool":0},"UTaZwyCFMKxVuy6I_mYznA":{"text":"I enjoyed every moment spent at Black Star Books & caffe. Check out the four course vegan ","useful":3,"cool":0},"FlhojryaTrvidiMkur0PGw":{"text":"Randomly wandered in out of the rain. The owner was incredibly friendly, he was teaching h","useful":3,"cool":0},"94oUACd3L_Rw7R7Sy5w5HA":{"text":"The most welcoming, inviting place. The owner really takes pride in his business. Soul Sal","useful":2,"cool":0},"rBL-jy--Pf1FZht9rA0Tbw":{"text":"Loved this cool Cafe!  The owners showed me such beautiful hospitality.  I loved that they","useful":1,"cool":0},"M-qkm2rucHi9rRb-4C69mg":{"text":"AMAZING 4 course vegan brunch on Sunday!  (Or you can order each course separately)  and t","useful":1,"cool":0},"zW3c6OsuH7Z6C4WjmGLpxg":{"text":"The staff were so welcoming and nice. A friend and I walked over there a bit after 1 on a ","useful":0,"cool":0},"ABTRF1IpyPrRtzDLnl9sGg":{"text":"I love love this jewel of a place! Positive vibes, love the books and paintings on the wal","useful":0,"cool":0},"Q8EF1bAquL-vl2FtJtY1nQ":{"text":"Very Afro-Centric establishment with poetry readings to help give back to the community. P","useful":3,"cool":1},"ioIxIp1faDeLWqh0oPk8Sg":{"text":"The energy here speaks for itself. The food is the added bonus. Good energy, culture and f","useful":0,"cool":0},"4Mk69XqM2T3FfzVKZUaKHg":{"text":"I've never felt so comfortable at a cafe before. The owner is amazing and full of wisdom- ","useful":3,"cool":2},"G02Z0S9AnuCEttLTFhfNfQ":{"text":"Go check out their brunch on Sunday's! Best thing smokin for $15 bucks \n\nWe go here a few ","useful":7,"cool":3},"8lm8IyrMjSZ_51Twb2OC9A":{"text":"One of the best places I've been in New Orleans.  Great atmosphere. Great host and owner. ","useful":0,"cool":0},"NXxqglkCcVxDR7Pg4yOB5w":{"text":"This hidden treasure is the cultural jewel of the westbank. In a sea of monotony that is A","useful":14,"cool":9}}