{"Xl1742h5hmxsIPAAzIpWug":{"text":"I was highly impressed with the communications with Abba movers.  They were simply fantast","useful":0,"cool":0},"_DF9YuvCeAlYBzEmr9umVg":{"text":"December 13-Nick, Initial contact-easy. Initial estimate-easy. \nDecember 15-David and Movi","useful":1,"cool":0},"E4ALWNn2cmJdvIGZ-NISHw":{"text":"Great guys. Not the speediest of movers (which isn't great when you're paying hourly) but ","useful":0,"cool":1},"RvYGa_BjSOLkwtpIjdjTmQ":{"text":"My experience with Abba movers was excellent. Moving is super stressful, so I really appre","useful":0,"cool":0},"HrCSKvbZwPYBNKIBouS5Cw":{"text":"My friend had a confluence of frustrations descend on her. She had to have surgery and sho","useful":0,"cool":0},"RhKYFziKP9awQqMnbMOWlA":{"text":"These guys were great! Showed up with 2 men, good size truck and their own equipment. They","useful":0,"cool":0},"bNJ_kQ578pUohs-MfW3YnA":{"text":"I recently purchased my first property and was excited about getting into it but unfortuna","useful":0,"cool":0},"EAV5u9dxe-_ZlOYGxlXQQg":{"text":"The Abba Movers were the greatest.  They loaded a moving Pod for me, they were very fast a","useful":2,"cool":0},"Xj8TtrMba9UZcPzw5KtkhA":{"text":"Moving is never easy, but these guys helped make it less worrisome. Nick is quick to respo","useful":0,"cool":0},"fVuYpZhrGvvlxICmwut-zQ":{"text":"Crew was excellent and efficient. There was a lot of location issues with the move in and ","useful":1,"cool":1},"ePu85O-82_NwWr4OIy4Wrw":{"text":"ABBA Movers gave us a great move from New Orleans to Columbia, SC. Every step of the way t","useful":0,"cool":0},"BG4B004AGpMl7Nu2ZkypIw":{"text":"Found these guys on Thumbtack. They were highly recommended and did not disappoint. I've h","useful":1,"cool":0},"4gnIV-L1NdNjVmk7HoY6Pw":{"text":"I had an excellent experience with this company. Setting up my appointment was a breeze an","useful":0,"cool":0},"sQAVtCVlTJMKv-Tw2fL8fQ":{"text":"Previous left a detailed review about the service. \n\nThey did come pick up and repair the ","useful":0,"cool":0},"UmN87bQoumWX_iH33OfMqg":{"text":"Excellent movers!! Nick was quick to respond to emails and phone calls, and very polite an","useful":1,"cool":0},"8bWydQumF-cw3zmUcpe9MA":{"text":"We have moved nine times over the years.  Abba doing the last move was the best service an","useful":0,"cool":0},"1oNxcU6qpIIttSl4rJefiw":{"text":"I'm a first time user of Abba Movers and would recommend them to everyone.  Responsive fro","useful":1,"cool":0},"J8bQuRv_JfSy_9pd11KO3g":{"text":"First I wanna say I recommend them 100%! Very professional and reliable! You wont be disap","useful":0,"cool":0},"EC9GsljDkFHYoF3FGa63KA":{"text":"Fast response and very reasonable quote. Great job moving my household items from the Nava","useful":1,"cool":0},"cRb8uCfJOdA7pv-bpZR3nA":{"text":"First and foremost, Nick was awesome from the very beginning with answering emails in a pr","useful":1,"cool":0},"5u67kkxDBKaVwBfA531Ktg":{"text":"I hired Abba because of there great reviews so I want to leave mine.  I never hired movers","useful":0,"cool":0},"pJ96KxWO99-TywSRGUQGLA":{"text":"Move from New Orleans to Houston with out any problems. This was the second time using Abb","useful":2,"cool":1},"9kfq3KI-8AMGre0nMIJBTg":{"text":"Top notch with a great staff. Prompt, efficient, and super nice.  Would recommend them for","useful":0,"cool":0},"B1islwI-KsxBET6raWBB9A":{"text":"AbbA movers are the best.  The 3 man team of Adolfo, Jimmy and JP moved us from Baton Roug","useful":3,"cool":0},"0SM-DMiB7N8sf5EV17-2JA":{"text":"Do not use this moving company! I cannot tell you the number of items they broke or damage","useful":2,"cool":0},"Gdxj5ZpcgRe-bf_mJ5cQYA":{"text":"If I could give a negative 5 stars I would. I'm sorry. We booked them a month in advance, ","useful":0,"cool":0},"FNrd6c9vi7hfDicaiaejAQ":{"text":"Stop searching right now. These are the BEST, most professional, hardest working movers I ","useful":2,"cool":0},"C84kAaijH2U_4tzbk0Ktdw":{"text":"This is the second time I've used Abba, and they're great! Punctual, friendly, and compete","useful":0,"cool":0},"IBL6koK53uBv3vIxMuBPAg":{"text":"I used Abba Movers this past Saturday and was very pleased with some aspects and disappoin","useful":2,"cool":0},"WS43J56M5B7snswAIjNu6w":{"text":"We were very pleased with ABBA movers for our local move in New Orleans. The booking proce","useful":0,"cool":0},"0A3X-OERVkRNiTveiHEmYg":{"text":"The owner Nick is very helpful and cordial. He always replies your messages promptly, very","useful":0,"cool":0},"1CUX7kCi-rBINNmZ2sLnww":{"text":"Whoever answers their phone and gives people quotes should not be representing the company","useful":0,"cool":0},"phfjTGsOZJTwjN6QSbXDuQ":{"text":"I have used Abba twice in the last 6 months. Their service is exceptional. They are punctu","useful":0,"cool":0},"_3lBa44lmKUsSVHYnoZdIA":{"text":"This is a smaller operation with a fantastic service. They picked up a smallish number of ","useful":0,"cool":0},"1tPVGYGOfzxUOGJAJJvESw":{"text":"From the first inquiry with Nick's rapid response all the way to the last item off the tru","useful":0,"cool":0},"5Pmaxj6XcQQWrv-k9azjCg":{"text":"I used this company almost a year ago. They showed up 2 hours late, took a 2 hour \"lunch b","useful":4,"cool":0},"tJp12Wvx2zOPmer3EyhX6A":{"text":"We moved from the French Quarter to Baton Rouge. This is my third time using Abba Movers a","useful":0,"cool":0},"p9ksOg5mqHWccvuo6bLWSg":{"text":"Professional, affordable, and friendly. ABBA movers exceeded my expectations. Thank you fo","useful":0,"cool":0},"tX4j95s04gZ-8KVaZ55PFw":{"text":"I wish I could give this company 10 stars!!! They were professional from inquiring about p","useful":1,"cool":1},"BjPdaLn4XnY4MGgntc5zvw":{"text":"What a horror story.  Hired them to help me move and boy do I regret it.  I was told they ","useful":2,"cool":0},"Q2FdELgyTOsXakruTnbjAQ":{"text":"I arranged my move with Nick, and he sent a great crew to move my furniture. The crew was ","useful":4,"cool":0},"AzdTTeZvDgB1nAEbxrfxlg":{"text":"I have only amazing things to say about Abba Movers for my in-town move. They were communi","useful":0,"cool":0},"uBMg6Wi75S2jB27IKGdGug":{"text":"I have used this moving company several times in the last 2 years and have been very happy","useful":0,"cool":0},"KneNdo0ilEJTRU7rRBGpWQ":{"text":"Abba did a great job with my move. I read reviews for a lot of moving companies before I p","useful":0,"cool":0},"sDcpXotSIqvShkl9ejvN3Q":{"text":"Overall a good experience with a professionalrchfutnebm crew. Miguel was great and all fou","useful":1,"cool":1},"L_D_ww3WmybyjuI2iQVLzA":{"text":"Abba Movers are responsive, efficient and professional. I moved on the hottest day of the ","useful":6,"cool":4},"NJm5LVzLon5ZEyj07vC-vg":{"text":"Take the stress out of your move. Use Abba! I moved from NOLA to San Francisco. Did my usu","useful":1,"cool":0},"FmCBqVsry4mSrWRw7kFRAg":{"text":"Mamma Mia--my mover no-call-no-showed on me! Left me sending out S.O.S. next-day estimate ","useful":0,"cool":0},"F0FWhb45NraxRs6s1oC3oQ":{"text":"Francisco and Juan moved several large and heavy pieces from our upstairs to the first flo","useful":3,"cool":0},"i5D5M6gV8Up2B9UvU4-D0g":{"text":"We used Abba to move from a 3 BR apartment to a house. The 3 movers, led by Mike, we're on","useful":0,"cool":0},"V3N4o7ShKKhF0qR3pKdYVw":{"text":"Abba Movers were amazing! I had a two man crew, both named David! They were polite, helpfu","useful":0,"cool":0},"4atB6Da3CDLndYqes0I-Tg":{"text":"I purchased a bedroom set from Restoration Hardware and didn't have the best experience wi","useful":1,"cool":0},"Alhf6DJI9q-6hosiNNCxfA":{"text":"Showed up on time, we went over the scope of work and they accomplished the move without i","useful":0,"cool":0},"2DsxoNUO6x21cZm-RLmLgA":{"text":"We used Abba Movers twice and had a great experience both times. All the movers were hardw","useful":2,"cool":1},"BN746rfuU8pNAMB6dWpVrg":{"text":"Our move was so easy thanks to Nick and crew. He was responsive via phone and professional","useful":0,"cool":0},"RlYDocGmzHEzXeVudVO9qA":{"text":"We hired Abba to move my daughter and her roommate to another apartment. The movers were p","useful":0,"cool":0}}