{"kq57fGVTvMNVeJnK0qnYMw":{"text":"I'm terribly disappointed to see how badly this place has declined. It seems that since th","useful":7,"cool":2},"q-gwjrXV1CywilE2r8vFdA":{"text":"Good food. Abusive service. Calas are weird.","useful":0,"cool":0},"Kuv2gZ4fnYtl-QkdSOVE4g":{"text":"Solid breakfast place right near Pat Os. Not a bad line and the back room is kinda outside","useful":0,"cool":0},"Oi3Quzafu1HBHDbZtIqrOA":{"text":"Found this place looking for gumbo when we were in New Orleans and we loved it.  The serve","useful":2,"cool":1},"BlupmpmM9ynuISELkwy5_A":{"text":"Dinner was fair. Nothing great about the meal except the bread pudding. Service was medioc","useful":1,"cool":0},"cZJbgoA4VZbdi51ufNJasw":{"text":"So happy my boyfriend and I got to experience this gem. The staff is extremely friendly an","useful":0,"cool":0},"Cg-R8Od0XrcJVHK14AoHvw":{"text":"Oir first day in NOLA amd stopped here for\nLunch. Had a hurricane and it was the best one ","useful":0,"cool":0},"RZ7jcyAJ-0Oucd6V77ANUg":{"text":"The story of this place is great food, great atmosphere, slow service. It's NOLA. Get over","useful":0,"cool":0},"F9UGTmPx_-WOjp7Xq4YIGw":{"text":"Service amazing, singin  waitress is the bomb,drinks are off the hook and food heavenly! C","useful":0,"cool":1},"dcBIMTMQLAKE_XFnbPYKfA":{"text":"Breakfast here was AMAZING!  Please check out the food and the amazing pipes on one of the","useful":0,"cool":0},"kcR8YP-kWHzsfa0NWeobWQ":{"text":"I had the calla cakes with pecans, which were really good, though I don't have a point of ","useful":0,"cool":0},"_jZFheycwldj2b4i49VoBw":{"text":"Food was very good as is usually the case here but the wait staff must be trained to be th","useful":0,"cool":0},"nKgFZJAK4aR6HLuwuUv6Mg":{"text":"I think this was the best gumbo I had while visiting New Orleans. Spicy and chocked full o","useful":1,"cool":1},"eFCWDmccQ1MuCycPqk3BxA":{"text":"AMAZING comfort breakfasts.  Thinking about this place makes my mouth water.  I can't wait","useful":1,"cool":1},"g0lECizm8-mtMtw9BYRWag":{"text":"Best Crab Balls ever. The ambiance is nice and they have great food. I will go back.","useful":0,"cool":0},"8enr4IQxUFHDp0l3tjwfqg":{"text":"The service wasn't service. The worst service I have experienced that made my party and I ","useful":1,"cool":1},"z28mF91Q_Ce7G4uTd6rifg":{"text":"Poor menu\nNot very many choices. \nStaff is over at bar reading newspaper instead of workin","useful":0,"cool":0},"Gd_mXuNxOsNbLNHaP5w8Mg":{"text":"The food and atmosphere is great.  The waitress was great and I will always come back for ","useful":1,"cool":0},"5P99dsCFrPj7Js5s3kS-vA":{"text":"Good for breakfast / brunch. Went there for dinner and it was mediocre. If you like french","useful":0,"cool":0},"0WYhH-Rj5X5MMe7-i40xvg":{"text":"We came here for a late-ish breakfast and were not disappointed.  Much like you'd except f","useful":0,"cool":0},"9rGHYqSgSyaILR30sMgqzQ":{"text":"Food horrible.  Seemed like it is precooked and then heated.  Both dishes we ordered came ","useful":0,"cool":0},"MX8Amj2OS6Ctg8E_BRzQnw":{"text":"Surely after your drunken debaucherous escapades in the French Quarter you'll be requiring","useful":0,"cool":0},"Ec_Y12VazQsFGOWOiBtYaA":{"text":"Great food but terrible service from Menia. No offer to refill coffee. Couldn't find her w","useful":1,"cool":0},"yS-TVhSEFFI36rUPs0fScg":{"text":"Absolutely loved it.  Great location and good food.  The only downside was the singing wai","useful":0,"cool":0},"b5JBg4jAfSAb4lR4n_iABQ":{"text":"I was recently in the French Quarter and was walking around on a Wednesday morning with my","useful":0,"cool":0},"_Unb2Rqc0BdI7ZGT3Ie7WQ":{"text":"We were greeted by the most kurt unfriendly waitress.  They didn't bring my wife's bacon. ","useful":2,"cool":1},"HEu07xmKEnA1CgKXpFE-cg":{"text":"I'm a foodie, so trust me when I say this place has the best grits, corn beef hash, biscui","useful":1,"cool":0},"qWtUCFARghZ_8kI_eKOD9Q":{"text":"I really wanted this to be a good experience.  We had a group of 7 people and the food too","useful":0,"cool":0},"FQCeic3I68BUQNANXycDxw":{"text":"I loved The Old Coffee Pot! I had breakfast 2 days in a row here. I usually don't do that,","useful":1,"cool":1},"PTll2YhDAb4qw1tzvy-bPg":{"text":"Came in during the late afternoon to have a quick bite.  Fries are very good, so is the ch","useful":0,"cool":0},"HyjXg4NY7uqcIcwklgStHw":{"text":"The breakfast was fantastic. I had the lost bread french toast and hubbs had the biscuits ","useful":2,"cool":0},"9-Nt_xTqNmOcXEqAHURTaQ":{"text":"This place is unreal. We walk in and nobody was here and we almost left, but sat down and ","useful":1,"cool":0},"UiyjXnq4n4Rj3IZSMHwGgQ":{"text":"Now I know why I've never been in The Old Coffee Pot Restaurant... food marginal at best. ","useful":1,"cool":1},"TxkqRGBt_HR8qXp_JO56xA":{"text":"So I was in NO with 7 other friends to celebrate over the weekend prior to the weekend bef","useful":0,"cool":0},"6zxeEowHsgyTwzUMHkjRHg":{"text":"This place was a pleasant surprise this AM. Also a quick walk from Bourbon Orleans Hotel. ","useful":0,"cool":0},"i1nNvyl_Vlz2sSCam4iDxg":{"text":"Hit this place up on a Sunday around noon.  Service was awful, but the food was worse.  Th","useful":1,"cool":1},"0ttvt1MMv9oaatxpsSJgHg":{"text":"First of all, if you visit NOLA you need to understand there's two types of servers. One i","useful":1,"cool":1},"whbNj08bHKrRI0hVSg_kbw":{"text":"Went for breakfast and was really disappointed. I expected good eats based on the reviews ","useful":2,"cool":0},"t76KPUrl32yLFzP9tQsxgg":{"text":"Took a little bit to get seated, but service was great afterwards, and oh what good food. ","useful":1,"cool":0},"6j3t70M2-GvOQlCPwXOGKQ":{"text":"C'est Bon! My favorite place for a delicious quick bite to eat. Their cornbread tastes so ","useful":0,"cool":0},"XeZkUljpkyTfLJOEmQl0Hw":{"text":"Here's a bit of advice:  If a restaurant is named \"The Old Coffee Pot,\" don't go there for","useful":0,"cool":0},"ych1xaoZBevAUvtprSXCYg":{"text":"I want to love this place. It's quaint, family owned and the waitresses are personable and","useful":0,"cool":0},"Zavc8nub5mB4Qy0JYgt73Q":{"text":"\"Feel the love\" that's their motto and you sure will feel it from the staff and from the f","useful":0,"cool":0},"M5HO_FSE5Wq2MDaI5ARq5g":{"text":"Being obsessed with New Orleans culture and history, we made our first stop on our 2-day, ","useful":0,"cool":0},"tH3qp8ykefuguTewMAzeSw":{"text":"Food well below average. Had the Eggs Jonathan. Poach eggs where pretty much hard boiled; ","useful":2,"cool":1},"-dLaUidz_8hhp9nMM_lZRA":{"text":"Ask for Pearl.  I have been going to here since 1993.  I often get the jumbalaya or the gu","useful":1,"cool":1},"4R4jhaSyechHZy9lzfoPAA":{"text":"Pretty good food.  The wait staff is pretty interesting.  We were kind of scared of our wa","useful":0,"cool":0},"ZXsJloLZVm-XK9T2aSaeuQ":{"text":"We stopped by  for lunch on our way out of New Orleans. The food was great, We had crawfis","useful":0,"cool":0},"8mmioJHMRXeynwii-pnuow":{"text":"Wow , what can I say?! The only plus about this place is the building layout which is nice","useful":5,"cool":1},"kChaqUQqSmFJ0Wl5aRztEg":{"text":"Delicious. Shrimp and grits and chicken stuffed with crab, green bean casserole, a plump j","useful":1,"cool":0},"sQwwR81nWCNLywWgfVg39A":{"text":"I love the look of this place and the food was promising. Cash only tho! Make sure to brin","useful":0,"cool":1},"Odc8FPszQ_kUXzOi6KyKTQ":{"text":"Brunch here is pretty good.  My bf's catfish po boy was better than my cala cakes but we w","useful":2,"cool":1},"G7ENUi0xCjBgstfOyB-bZw":{"text":"Although there appears to be a problem among management for retaining enough service staff","useful":0,"cool":0},"vWpjY8N7WNR20JQ93weemg":{"text":"This location was one of the stops on the food tour that I went on, but the food was so go","useful":1,"cool":1},"KwyKWtIR9KWm12riV58Dlg":{"text":"Great spot tucked away next to the scary Bourbon Street \nNot a fancy place , and that's ho","useful":0,"cool":0},"nIme2vxXemF-4WIm5XasSg":{"text":"First class food. Every time we come to New Orleans we have breakfast here. Willa mae is t","useful":0,"cool":0},"1AWGvfDjHORUwmv_vuMxIw":{"text":"Getting a table is not the easiest. They have a sign asking you to wait to be seated but d","useful":0,"cool":0},"lHoVsE1g4sn8VbAOVHcPVw":{"text":"What a great place for breakfast. Unique creole dishes to match the friendly staff. From c","useful":1,"cool":0},"z729m0BuI8j5hcamqy9a-A":{"text":"Came here for lunch because we were in the French Quarter and the name stood out because i","useful":0,"cool":0},"md30sWrAkjftD4dMT28G2A":{"text":"we are locals and we love our city and our food. we saw a show about this place ,so we gav","useful":3,"cool":1},"A_k1T4zOyuANTHn610jEiA":{"text":"My good friend and I decided to have breakfast at this quaint cafe in the Quarter. We're b","useful":1,"cool":1},"ZYYw2RAAzHwooGQthZQ1Jw":{"text":"While in New Orleans this past October my friends and I decided to try the Old Coffee Pot ","useful":0,"cool":0},"-VEAQQp_TLQfE350_k69Iw":{"text":"So disappointing! Our first night in New Orleans and we stumbled in here. I wish we hadn't","useful":0,"cool":0},"mzWVnpgBinYzPJ3tDI-Gog":{"text":"Great service and amazing food in a nice small, quaint restaurant.  You have to order the ","useful":0,"cool":0},"V0TCd9pCEMFm99-9e7dIVQ":{"text":"This place is wonderful.  I went there for dinner one day and then breakfast the next.  Fo","useful":0,"cool":0},"6XPLbJOKVoGus3xZXAk5lw":{"text":"Had breakfast here one morning simply because I wanted an omelet and after seeing pictures","useful":1,"cool":1},"Mbk8IwowcgLPyuaOuRDaVg":{"text":"Sorry to say but we just had a bad experience with the wait staff. Greeted warmly, made to","useful":1,"cool":1},"zTeAZQhGeNyHh5qQgE-QaA":{"text":"I loved the food, the coffee, the atmosphere, everything. I ordered the breakfast combo wh","useful":0,"cool":0},"XV7ilUvWHbym3v83O6znyw":{"text":"Overrated..not good at all, dont even come here,prices dont fit the food...very disappoint","useful":1,"cool":1},"Cslyo2LBBWkrUyoWFP19xw":{"text":"All I can say is the breakfast was out of this world. It's a really small restaurant you w","useful":1,"cool":0},"uyaw07k20y2TJRO8aZDC4g":{"text":"Love this place. Stopped by for lunch. The \"Triple D\" entree was perfectly prepared and se","useful":0,"cool":0},"C-At1O1qcQWEeVbQ6MO5hQ":{"text":"Had a wonderful breakfast with my fiancé at this French quarter hangout on Monday morning.","useful":0,"cool":0},"moOsJApYLdMlTzqgtKm10g":{"text":"I asked more than a handful of guides/locals where the best gumbo and jambalaya can be fou","useful":6,"cool":7},"W3281-L1HnqXO8rkwHSqsw":{"text":"This is a must stop for brunch every time I'm in NOLA. Great food, great service and a hom","useful":1,"cool":0},"H8GUn0Q9NOF0Ib_nEvFkqQ":{"text":"Quaint old local favorite. We both ordered fleur de lis chicken. It was absolutely everyth","useful":0,"cool":0},"tTH22XB2pTOFLYMJnxhEcw":{"text":"VEGANS!! You CAN eat with your friends in the French Quarter! Among a growing number of ve","useful":0,"cool":0},"WrVZE7ub09Fv-p2RAsCKYw":{"text":"Service was great and super friendly.  There was a line for brunch.  I had the creole styl","useful":0,"cool":0},"8wst7fE9Dmu39DEk-jEh0w":{"text":"Love this little Dinners Drive-Ins and Dives spot. Accidentally stumbled on it years ago a","useful":0,"cool":0},"v99lOvMhNodLgut93BLpwQ":{"text":"Callas cakes: cinnamon rice cakes with optional addition of pecans. Served with powdered s","useful":0,"cool":0},"-c_O5L-BUHRbNe1lBWkM4A":{"text":"Went here because we got it confused with the Gumbo Shop.  I've been to New Orleans a ton ","useful":2,"cool":0},"h7duY9UwG4TPpcnu2iyGbQ":{"text":"Worst service ever. Poor excuse of waiters antagonize customers. Forgot to bring biscuits ","useful":2,"cool":2},"EkuMM25470xjDLWLZgD5Uw":{"text":"AUTOMATIC TIP SCAM! \n\nThis place automatically charges you a \"service charge\" for every me","useful":8,"cool":1},"Kh6mtzgAPoFeBnHz9n37lg":{"text":"I must have eaten here 20 times and I've never had a bad experience or one bite of food th","useful":0,"cool":0},"-yiqqAxron0PFXqWMyhxLg":{"text":"Calas, grits and a Bloody Mary!  You can't and won't go wrong with this trio.  The service","useful":0,"cool":0},"iclvxkdb2YPtOcFjd8wl4w":{"text":"Tried the calas cakes with pecan nuts.  I'm not a big fried food fan but felt I had to hav","useful":0,"cool":0},"Kj9ZOuChnLb5l51KTLfUcA":{"text":"Came here for breakfast on a Tuesday.  The menu offers a lot of options for breakfast lunc","useful":0,"cool":0},"JOc7ttt5_gAiij_EsV7vig":{"text":"The service was less than exceptional. Because the menu's state breakfast is over at a cer","useful":0,"cool":0},"NHXGfs-zPDrEffRYFdUAHA":{"text":"Love it! We had an amazing breakfast. Calla cakes and po'boy French toast. Good New Orlean","useful":0,"cool":0},"HbEcFgyA0E_rGE-d0aieUA":{"text":"I ordered delivery which took about an hour and the food was cold when it got here (I was ","useful":1,"cool":0},"MyHVPTtjgkQE_S5Wgt4Oaw":{"text":"Enjoyed a lovely breakfast with some good ole smack talking! Wonderful crab cake benedict ","useful":0,"cool":0},"CR3dOORRPtf1YAwn4Wc1lA":{"text":"This place is actually called The Old Coffee Pot Restaurant.  Sit in the courtyard and ord","useful":0,"cool":0},"YwHP_4Ov30-dGTBE4Quycg":{"text":"This place was amazing. The servers had a slight brashness mixed with southern hospitality","useful":0,"cool":0},"946ELjxyVWdiE6FC7usC-A":{"text":"This was the worst service I have ever received in a restaurant, ever. The waitress slappe","useful":6,"cool":1},"trhN1p-i2H6-r0B4VUmFfA":{"text":"Cute, quaint place tucked away on St Peter Street. (If you blink, you will walk right past","useful":1,"cool":0},"U7_Cmy1kWTSWhcJModmu2w":{"text":"Ordered the crab cakes with sweet potato hash and green bean casserole. All were delicious","useful":0,"cool":0},"ekeJ3AfNFkGn1uUSOI4S4Q":{"text":"Tasty Po Boys and very delicious crepes but prices were on the higher side. Cute atmospher","useful":0,"cool":0},"8YGTQtBvIWZSPUh4wEYmpA":{"text":"Wonderful (sassy) staff. We went for a bachelorette weekend brunch and they actually seren","useful":0,"cool":0},"KdwufM6IqgduZxd16mgxiw":{"text":"Awesome biscuits and omelets in a place with a lot of local charm. I had a shrimp omelet a","useful":0,"cool":0},"rEPRjh2clz-yjqNRcyQnhw":{"text":"Maybe we were just starving, but I thought this place was delicious!  After we were too la","useful":1,"cool":0},"PKgDVvdv-Ivqn3Q58yridw":{"text":"The customer service is not the old coffee pot, Sorry I won't be back.","useful":1,"cool":1},"8Lym2-9eGrSgLH4KVeowag":{"text":"right in the middle of New Orleans French Quarter. nice dinning atmosphere, food is good a","useful":0,"cool":0},"6_ujW6fT9ZORn-V3v6XXgA":{"text":"The Colonel and I went here several times during out NOLA vacation last July. Delicious, e","useful":0,"cool":0},"GXsxoJB5xGy5iWbSqVyS_w":{"text":"The best gumbo in New Orleans '!and the ladies will treat you right dining there is like d","useful":1,"cool":0},"OQS2E6vhX_eyA9jKxErihg":{"text":"My boyfriend and I asked the guy at the front desk of our hotel for a good breakfast spot ","useful":0,"cool":0},"0n0axGGEpnSHd5g3coevkA":{"text":"Loved this place for dinner.  The waitress was fantastic, the shrimp and grits so tasty, t","useful":1,"cool":0},"3FxDmE3YielohYnhV2jaSA":{"text":"Saw this place on Diners, Drive-ins, and Dives, and decided to stop by.  Had the Triple D ","useful":0,"cool":0},"z0QjyDc0NeTPqNKQ-c0KnQ":{"text":"Michael had the crab balls, which he loved and I had breakfast for dinner. I ordered scram","useful":15,"cool":3},"ibaHxf_Rrr245UgUNt6hiw":{"text":"I first heard about this restaurant on a television program talking about the historical s","useful":0,"cool":0},"rK6PgoudpiBmSq2IZ6_tTw":{"text":"Trying to find any restaurant that wasn't insanely loud or a long line, we decided on this","useful":10,"cool":2},"uyon7ZjjBzsOWfl8jIUBvA":{"text":"Great location and atmosphere.  The service isn't exactly efficient, but friendly. The foo","useful":0,"cool":0},"O58fP6iyVo6d2lWQibl5_Q":{"text":"Weird on the seating. There is no hostess; just busy waitresses yelling at you to wait out","useful":0,"cool":0},"3ohBisFWmYfaCV5K9zbtQw":{"text":"We enjoyed this place. The food and location were great. Also our waitress was sweet. She ","useful":0,"cool":0},"xB9tseJA1k0ZpHR8L_cw0g":{"text":"Seriously, don't waste your time or money.\nPoached eggs were more like hard boiled,  break","useful":1,"cool":1},"vwJNnWu5D5s4gUQAXGuGHw":{"text":"Great food, great people! Truly felt like a home away from home, a comfy kickback to enjoy","useful":0,"cool":0},"MuN8sAdPrL4o25pYO6c3ig":{"text":"Good food and atmosphere. Solid breakfast with a little New Orleans twist. Service was poo","useful":0,"cool":0},"mqJY3BuNc0h-laeibWqAJw":{"text":"Good place to go and listened to good live music. The band had lots of funny jokes and kep","useful":0,"cool":0},"adVCVak8mqXGJgqmFaTkHA":{"text":"Wow! Great meal at this place and I'm picky! The Fleur de Lis chicken was awesome!! One of","useful":0,"cool":0},"TjsoCzSuDbWk9SmCfkA5zg":{"text":"We recently ate breakfast here.  Jonathan was our amazing and most genial server.  Our shr","useful":0,"cool":0},"eYAatZkYYGufe46fu8M3pQ":{"text":"I have to agree with the other reviews...good food...terrible service. All the wait staff ","useful":0,"cool":0},"PBr-SUt5U81OJy3HbF1VnQ":{"text":"Have been eating here every trip for many many years.  The staff is one reason why.  Love ","useful":2,"cool":1},"rMd_FaCSM2m-5wew28NJJw":{"text":"Amazing breakfast.  Best grits I've ever had in my life.  Service is warm,  Southern and f","useful":0,"cool":0},"qzl78ndrD0x46RHS2WzdLQ":{"text":"Very disappointed. I had seen this restaurant on Diner's, Drive-in's and Dive's and the wa","useful":3,"cool":1},"9yOzW-EOla_Dd_E8yEOgNQ":{"text":"This place was worth the wait!\n\nThe waitress were friendly and did impromptu signing.  We ","useful":0,"cool":0},"ZFhOJDLgKlenhfvsiNMVuQ":{"text":"only went here to try their callas cakes for dessert after dinner at another restaurant. u","useful":0,"cool":0},"Lxe5N8zATKb-27fs0ODp-w":{"text":"Great Breakfast, excellent homemade biscuit.\n\nI had Eggs Sardou which is a pouched egg ove","useful":1,"cool":1},"uTlO_nyLsbFAN02xoCNwBA":{"text":"Tried to get into The Gumbo Shop down the street but the wait was too long. Initially appr","useful":1,"cool":0},"YmyDNeFXBIeaaLQF42JquA":{"text":"Calla cakes were something never tried before and definitely give you the sugar rush. The ","useful":0,"cool":1},"1GLmTJdhOoy0s00ISdlijA":{"text":"One hungry morning roaming around the French Quarter on vacation, we stumbled upon this pl","useful":0,"cool":0},"fMJ43TcYdSybFHhIEAVLjA":{"text":"I'm happy with the service and the attitude! It is a good place to start your day!","useful":0,"cool":0},"EDu-aF2zNP_p2mP2IrUxwg":{"text":"Just ok. We were excited after we see the long line earlier in the day, but was disappoint","useful":0,"cool":0},"3jgRwEkgF42gfTJ6rtjRXg":{"text":"Saw a recent episode of Diners, Drive-ins, and Dives that featured The Old Coffee Pot rest","useful":1,"cool":0},"LaepgLYqAblmzawAD9a4nw":{"text":"Great place to stop and eat while in the Quarter. We had breakfast...portion size was good","useful":0,"cool":0},"AJt3JhZs0ij37ZZb4EqZ3g":{"text":"Wer die Wahl hat, hat die Qual. Im French Quarter in New Orleans trifft das in Bezug auf d","useful":0,"cool":0},"XM1U2mrEK-1pV_ebqWRiVg":{"text":"10/15/16, 2 people, 6:30pm, dinner\n\nAmbiance: 2\nfood: 4\nService: 4\n\nWhile this place lacks","useful":0,"cool":1},"KO--c92QWqyZCO1eCgAN2A":{"text":"This had been recommended by friends for breakfast and it was so good that we ate breakfas","useful":0,"cool":0},"Sc3NNfkQvJV_lq6IN2Tf6A":{"text":"This place has the best crab cakes and gumbo that I've eaten while here in New Orleans.","useful":0,"cool":0},"9hBIYX7bVfLwpYNProhDFw":{"text":"Finally, we have missed Petunia's for breakfast but the search is over! The Old Coffee Pot","useful":0,"cool":0},"GpeADwXf8witvy6fBEkY0A":{"text":"I've heard this is a great place to stop for breakfast, but sadly I was there for a late l","useful":1,"cool":0},"EFiKPOSoCzC1r7e2TQZqOQ":{"text":"Great restaurant tucked away on Saint Peter Street. Hubby and I had lunch there on our las","useful":0,"cool":0},"QZf5CxusWglPxOsfWOxWLQ":{"text":"It was the best gumbo i had while in new orleans betting out Bourbon house (too thick/slim","useful":0,"cool":0},"bcKFyxnTcLG12EItAYxznA":{"text":"I just returned from New Orleans, the whole trip being slightly disappointing for someone ","useful":2,"cool":2},"KdCn-Iv0fEne8dw0CT6PYw":{"text":"Stopped for a midday snack.  We were able to have breakfast items.  I have never had grits","useful":0,"cool":0},"IlqsFIC5pw5OBnJCQONRUQ":{"text":"OMG...I ordered the Plantation Breakfast- Two eggs , ham steak, a calla cake served with g","useful":1,"cool":0},"G4niisoeWvLDQhPiil2fAQ":{"text":"We went based on a few reviews above and the fact that this is noted as a less touristy pl","useful":0,"cool":0},"1l_TcMFiFQyq9NO_rb50vQ":{"text":"(3.5 stars)\nWent here based on my girl Shanna's suggestion. The waitstaff kinda just does ","useful":3,"cool":2},"xYC5ogDRIsQ_XJs3udwY7w":{"text":"The Corn and Crab chowder as well as the Chicken Gumbo were AMAZING!!! Julie, our server, ","useful":0,"cool":0},"f21rVKp7Hg2uUsbZ_Zi2Mw":{"text":"Calles cakes are amazing! But do not pass on the coffee....so delicious and smooth! the om","useful":0,"cool":0},"CwWXvC4euU6t19nkjjzvKQ":{"text":"Cute atmosphere, great food (best jambalaya I had in New Orleans), but terrible service. I","useful":0,"cool":0},"JF2gNQFIaOlKWJZZTynk5g":{"text":"Good food... Nice staff but day cook talks on his cell phone instead of cooking. 45 minute","useful":0,"cool":0},"GoTABV5HG3b2_HRJYZJTDQ":{"text":"The corn and crab soup was outstanding.  We had the catfish Po-Boy and crab balls. Both we","useful":0,"cool":0},"JTUFHGQJrQD4_9Y_bWEfgA":{"text":"Only redeeming quality was our server, Brock. \n\nWe went out for dinner after driving down ","useful":3,"cool":1},"bdD6nHeYWi7yZWX57tOe-g":{"text":"absolutely awful experience.  Hostess was nice. Server was unfriendly.  Got the Eggs sardo","useful":4,"cool":1},"1-3cE-Lk_FSAgBRBXVmIbQ":{"text":"We were so excited to try this place between the reviews on Yelp and their appearance on D","useful":2,"cool":0},"xsgYb9Q0IIzwmbwoxjmgJg":{"text":"As this is being my first time in New Orleans, it is only right for me to try the gumbo. T","useful":0,"cool":0},"rqMR3CIG0M_NyDimQNTJgQ":{"text":"We finally made it into the Old Coffeepot for breakfast on a Monday morning when there wer","useful":0,"cool":0},"WunwpHbRxHzF2txKDfs_ZQ":{"text":"Great french quarter breakfast spot with good prices! After reading mixed reviews, I was a","useful":0,"cool":0},"sfSHX09XXnML_zSwnoRgbw":{"text":"I have to eat at least once or twice every time I come to NOLA. \n\nI adore the women who wo","useful":0,"cool":1},"s03qk-j_Q-M9m9khw_Wqng":{"text":"Enjoyed this small restaurant for a nice brunch with friends. Business was very slow as it","useful":1,"cool":0},"sg_TRfMkdasaDYmQGvTSYQ":{"text":"Had a great breakfast here today.  The three of us each ordered something different. All w","useful":0,"cool":0},"_zp2ygFh6ZNpImQCTdmFMQ":{"text":"I got the trio appetizer which had: creole, red beans and rice and crawfish etoufee (sp?).","useful":0,"cool":0},"p1Lx3QNnbRpGhSE1tb1C2w":{"text":"Came in on a Saturday, around noon, on a recommendation from a friend and was severely dis","useful":1,"cool":1},"jRdHUmBhUtu7MIt-nvO9Kw":{"text":"Absolute biggest waste of money in our food tour of New Orleans, Memphis, and Chicago. It ","useful":4,"cool":2},"-w1HydRfWDbHQfPsM-IIKg":{"text":"This place had the best Gumbo that I've ever tasted. I stopped here as a part of a food to","useful":0,"cool":0},"eNE-ZXM1BI5kL5KJrOKTqA":{"text":"Wanted a draft beer but our server did not know if any draft beer was on tap.  \nLong wait ","useful":4,"cool":0},"4GJw_hOiAhzAaPKwlCk7OA":{"text":"A good spot for lunch in the French Quarter. We sat in the courtyard and had jambalaya and","useful":0,"cool":0},"yfm4YTLeaemwkorSpJjtCA":{"text":"The Old Coffee Pot has both indoor and court yard seating.  I have been there several time","useful":0,"cool":0},"5_UKhKASoZJ7zn8sxxGVaw":{"text":"So sad that this place changed to try to fit in with the status quo...the old rose chandel","useful":0,"cool":0},"wMsYwZ1k-WCuwd24nKBXOg":{"text":"3 stars for the food but 5 stars for the coffee! The signature coffee pot drink was AMAZIN","useful":0,"cool":0},"7tU9z0TS_kv7yvimIx0wRA":{"text":"We found this place by accident and I'm glad we did- it was a quiet, quaint place with a g","useful":0,"cool":0},"KMJd4AIeeg8dNDW2l0Tkeg":{"text":"we travel to new orleans every year and try creole cuisine...we ordered plantation breakfa","useful":0,"cool":0},"EXLvm6pTSxZi9bnA6FJF8Q":{"text":"Two stars for the atmosphere and no stars for anything else. The food was tasteless (I got","useful":0,"cool":0},"fpVHb5Yz-zuE7u91EpuMEQ":{"text":"The food was pretty good, but pricey. Service was less so, and they forced 18% tip. Very s","useful":0,"cool":0},"hFcskiDstam-i315_BOoqA":{"text":"This place is really good. Love the re model of it I came in for my birthday brunch and ou","useful":0,"cool":0},"AutwF7heq8KixsLHH2H5vw":{"text":"How many things could I say wrong about this place?\n\nWe were a larger group, seating at tw","useful":1,"cool":1},"dO-dMq_Lj1LXmwjkEzTq0A":{"text":"We loved this place. I really felt the best  part was our server. She was funny, bossy and","useful":0,"cool":0},"weWVZafE1u0PiawdVQGBZg":{"text":"horrible, horrible, horrible.  waited an hour for food that was...you guessed it, horrible","useful":1,"cool":1},"onFP4SVNTwc952a9phoWdg":{"text":"Not sure what has happened but this place definitely isn't as good as it used to be. The e","useful":0,"cool":0},"_GYpIWn8R4wntEHxTHcuhA":{"text":"WOW, this place was so delicious! We wondered into for dinner, and were so impressed with ","useful":0,"cool":0},"rEmkeqIgccZWQ0Q64tb41w":{"text":"We love this place. It just take so long to get menus and for them to take your order. How","useful":0,"cool":0},"Y19HNTKFTP9xBFQZ3YtbZw":{"text":"Service was... Different than what I'm use to. I some people may be offended by the bluntn","useful":0,"cool":0},"_iUhktbPX2ceooXbf2midA":{"text":"Are here a couple times for brekky. Had a great blintzes (Mascarpone filled crepes) and eg","useful":0,"cool":0},"3ALLLZZR0vujWfStELzR_w":{"text":"Came here for breakfast. The menu looked extensive but I didn't really want anything but g","useful":0,"cool":0},"usYadbLHNpyrHcaS8xIZLw":{"text":"Had dinner here on our first night in New Orleans (a Friday night) based on a recommendati","useful":2,"cool":0},"5a69vOqCL1RjMpoPeuM0BQ":{"text":"Excellent for breakfast and brunch. Down south style home cooked soul food. Serves are sup","useful":0,"cool":0},"QBEhu-eNXpzgtectkwXttA":{"text":"Read some reviews and thought we try it. Thursday, August 3, 2011 at 7:40 pm. The waitress","useful":1,"cool":1},"y1i6eA4NnMmQhhsmMeGMvA":{"text":"Old fashioned and cosy cuisine and setting, really liked the sense of history and continui","useful":0,"cool":0},"Anvgvo7GlR3sRYVcv59dYQ":{"text":"We went for dinner and I had Jambalaya Pasta, it was very good. Waitress said this place i","useful":0,"cool":0},"_-e47gccceq646coL3hNGQ":{"text":"Over rated. The coffee tastes like it was in fact brewed in an old coffee pot that hasn't ","useful":0,"cool":0},"G_-5jlMTXoNGswAiv1nfwA":{"text":"Great service, old New Orleans flair and unbeatable food! Would eat here all day if they w","useful":0,"cool":0},"nG-0Vq0SUkiaRY-otYG1tQ":{"text":"Our waitress was a staple of the restaurant and so sweet. She made us feel welcome and lik","useful":0,"cool":0},"PBQgTx8MIRFlYfyda6o4lA":{"text":"Very disappointed! Tried the Triple D, and the only thing I ate were the green beans. The ","useful":1,"cool":1},"VZduI-HKDX3LUTrBBc4k2Q":{"text":"We visited NOLA right after Christmas, but I forgot to do some of my reviews.... And I am ","useful":2,"cool":0},"tlubux6NYzUxrPzPLxs-1Q":{"text":"So gooooooood that I created this account to give this place a five star review.\n\nThe food","useful":1,"cool":0},"k_i4QVWKKxcxTkvthZh0Ww":{"text":"Amazing food, great bloody Mary's and a friendly atmosphere! The service is pretty good. G","useful":1,"cool":0},"ri_9fST_PHpdDnxSKuihzw":{"text":"I'll start the review off by saying that when my husband asked for a rum and coke with dar","useful":1,"cool":0},"fYLpaSZNs5D1Zu0isFQ-Dw":{"text":"Overall I would have to say the service was lacking as the other reviews state. There was ","useful":0,"cool":0},"K9W6ZxwnMokuwD3_CIFR2g":{"text":"Es hat uns nicht so gut gefallen. Dies lag daran dass der Kellner extrem überfordert war u","useful":0,"cool":0},"mMBjlj-UW9Z8FcC7CI_3kA":{"text":"Not the best meal. Salad was late coming out and it had little flavor. Meal was much overp","useful":0,"cool":0},"dKcDM9AuiPnEh_F8fKIOsA":{"text":"We came in see the real New Orleans so we asked the locals were they would eat. We were di","useful":0,"cool":0},"uQhKoI9J3q3H5kqFoiQjiA":{"text":"During my trip 1st trip to NOLA with you sisters we planned our day around visiting this r","useful":0,"cool":0},"rOms-_D_dG-LzoFx0Vv6yA":{"text":"Fleur de lis chicken and cup o chicken and andouille gumbo...if you want a taste of New Or","useful":0,"cool":1},"6ESbvtlFpKuAqOf3Nlfaew":{"text":"Loud, friendly service. The waitresses refer to patrons as \"baby\" or \"darling\". The food i","useful":0,"cool":0},"Gvo-b_IxAQe75M4RCvhqgQ":{"text":"Delicious food! The wait staff has great personalities and are very attentive. The buildin","useful":0,"cool":0},"_tVggwD7kYPH8yqFR_VAsA":{"text":"This is a very underrated establishment. I will be honest to tell you that I've only ever ","useful":0,"cool":0},"bY2uUXhZTP-PIrEcwkDB6w":{"text":"Although the wait was long, it was first come first serve which worked out better for our ","useful":0,"cool":0},"JK-YhyDUGoofZH7V2YwUxQ":{"text":"Solid breakfast spot, we've eaten here any time we're in town and I recommend it to anyone","useful":0,"cool":0},"1D1IyJ9O1ckEOLloFCOgCQ":{"text":"We stopped in really quickly before going on a walking tour that started just up the stree","useful":0,"cool":0},"KM0yjhIO0Vu-B1vxpSP3KQ":{"text":"I thought that this was a coffee place, that is why I stopped in. Lucky for me the owner, ","useful":1,"cool":0},"SoKq_W7T8-O8splr7V2bxQ":{"text":"When you've partied too much in the Quarter and need to chill out and recover try their Re","useful":0,"cool":0},"IqYAHxV1Wy603d60C8zdgg":{"text":"Callas Cakes clearly called me through a calling. I dropped on in for these items, and I r","useful":1,"cool":0},"Jx0th1rptP_WWwGjgm6bFg":{"text":"Recommended by hotel. Coffee had an off-putting flavor and aroma. Ordered Eggs Sardu, simi","useful":0,"cool":0},"BFgO9wKQz7iQuys2P6ruVQ":{"text":"Abrasive service in exchange for mediocre and expensive food.","useful":3,"cool":1},"DCa1SrcjMmIcGFzILIjbCw":{"text":"Loved this place.  My wife and I enjoy going to places featured on triple d and, while mos","useful":0,"cool":0},"jhuxOGLLV_IVomEVzc4YgQ":{"text":"Amazing food. Had the oyster Rockefeller omelette. Filled with fresh briny oysters topped ","useful":0,"cool":0},"DPh7RwZoTorA8Pyh2hmxng":{"text":"Jambalaya was extremely dry. Red beans and rice were ok, but I didn't get the NOLA vibe fr","useful":0,"cool":0},"BjSM7QD-C0iXgyoQGJVPAg":{"text":"Great breakfast place in the heart of french quarter. Simple, and very tasteful. The staff","useful":0,"cool":0},"2IoohyDDWGJm-VN134AiRg":{"text":"Tried this place on the Tastebuds food tour.  Enjoyed the seafood gumbo so much we came ba","useful":0,"cool":0},"2nHuHwUgZzqWzSMMAW4Zag":{"text":"Husband and I had an early lunch here. I had the Jambalaya pasta and he had the roast beef","useful":0,"cool":0},"eKTvzV-aMj1cJIhaWgBuZA":{"text":"This place is amazing! I got \"The Lost Bread\" which is like a french toast with po-boy bre","useful":0,"cool":0},"1_nFGPKj8qtgquZLonAVaQ":{"text":"As a New Orleans native I was in the neighborhood and figured I would give this a shot sin","useful":1,"cool":0},"Zo9_NRG-qP6AjTGlMzzj_Q":{"text":"Amazing food! This place laid back and relaxing. A nice pace change from the high speed bo","useful":0,"cool":0},"hbiZ4ZMWIcyKs0uGf-pMng":{"text":"This place was excellent - reading all the reviews of breakfast, I'm definitely jealous th","useful":1,"cool":1},"zzOGIGYacmj9Pzy8uaHHFg":{"text":"Folksy little place with great food and good service. My Bienville omlet (shrimp) was grea","useful":0,"cool":0},"0BcfI1Mk20QMhg3zD00SOg":{"text":"We had a friendly waitress, but the food was so bad, they should feel embarrassed to serve","useful":1,"cool":1},"tIgCCYr6X6eMeT36cQtpgA":{"text":"Don't waste your time on this place.  I recently saw it on Diners, Drive-ins and Dives.  T","useful":2,"cool":1},"0Tc0JKtRUZVeiT6jWudQHg":{"text":"Anyone who gives this place less than 4 stars must have gone on a bad day. Yes you'll wait","useful":1,"cool":1},"zQkK_UicQDBmOc9iDdu97w":{"text":"we were introduced to The Old Coffee Pot by friends....Had a wonderful breakfast!  The blo","useful":0,"cool":0},"gOchHxkcQEnCcM6mS-uB2Q":{"text":"Oh my goodness!  The food, the atmosphere and the staff are all fabulous!!  Even when a cr","useful":0,"cool":0},"tcxjGz56HSXAW2cbl_DlnQ":{"text":"I had lunch here a couple years ago and fell in love with the seafood gumbo. I found mysel","useful":0,"cool":0},"H7cVFbodEDPelHdiqBHnVQ":{"text":"Maybe we were here on an off day because our food was not tasty all. We were coming off a ","useful":1,"cool":0},"Qgm24HL1g2-w-2Oq0vEAcQ":{"text":"I got up early for a walk down bourbon street (I'm too old for a night pass - and had no b","useful":0,"cool":0},"sFt_jfU-UxAHojSE-NUQow":{"text":"I visited the coffee pot on a rainy Saturday while in New Orleans. First of all I'm not a ","useful":1,"cool":0},"Wh71DH47ZDp9Mh_MBD-BDw":{"text":"Worst service I've had in any restaurant.\n\nIt took a long time to get waited on. There wer","useful":1,"cool":1},"oUFR-R3CRfyFEuwy1USFdA":{"text":"Great service...friendly. Ordered steak and eggs and it was ok. Nothing special. Steak was","useful":0,"cool":0},"bx1T3NiwREQzN-eVGMdDNA":{"text":"If it was an option, I would rate this place with ZERO stars! \n\nWARNING TO ALL WHO DINE HE","useful":3,"cool":1},"sfa3xiydDYPQL35UdU1G8g":{"text":"I expected more from a spot that was featured on diner drive ins and dives. I had the bien","useful":0,"cool":0},"k7DNEwAtiTBy6g8rDu1-Ig":{"text":"We went to the restaurant it was very busy mid morning.  Two waitresses and one cook. So y","useful":0,"cool":0},"XauBCRHZVTyC0O1AQEmZZQ":{"text":"My friends and I went here one morning because we heard it was featured on the food channe","useful":3,"cool":1},"hlvEnqZ6zy_FJffkQqIM7g":{"text":"Slow, staggered meal. We got 3 of our 7 meals about 10 minutes after our first 4 came. The","useful":0,"cool":0},"rtO11sUE0mc5AdkEEDW1mA":{"text":"I enjoyed a delicious Sunday breakfast  at this very casual, relaxed restaurant. The waits","useful":0,"cool":0},"5s432iNb0TXeCW3ch7SC9w":{"text":"The Old Coffee Pot Restaurant does have traditional New Orleans charm from the decoration,","useful":2,"cool":1},"KDXmIYEvTCdEzc8m-U3u1Q":{"text":"So very disappointing! We've been coming here for over 25 years and looked forward to eati","useful":0,"cool":0},"GvSq891fEl8D4b09hK5_zA":{"text":"Service? To say it was lacking is an understatement. The food was okay, nothing great. I h","useful":2,"cool":0},"Kb0KYsu8ce2wkFsJPeg7mw":{"text":"Visited 2x during a one week visit to NOLA (per my families request as they really enjoyed","useful":1,"cool":0},"NiYJowiqgXF-FyyqBaC2Og":{"text":"Have been here for Brunch and planning to go back this week when we visit NOLA again. Fun ","useful":2,"cool":0},"twrz9A5Yb-eKmlkNiE91Sg":{"text":"Worst service ever and food was definitely not worth the wait. Go down the street to Gumbo","useful":1,"cool":1},"V2DEJq0y4VMYglqOKBPstA":{"text":"I didn't eat the food, but I had the best time last night just hanging out with the barten","useful":0,"cool":0},"FJWXcTOdxrqA2V1iXJx5jg":{"text":"Table for three, 10 PM, Saturday evening after attending a play at Le Petit Theatre (which","useful":0,"cool":0},"dXqO6k7VVZgvSyNvInK11g":{"text":"Great banana foster French toast.  Husband liked his gravy and biscuits.  Attentive waitre","useful":0,"cool":0},"5e1LJGqU8exEX9KcA-lyLg":{"text":"Totally recommend friendly service and delicious Louisiana Breakfast. Great stop before he","useful":0,"cool":0},"pUp6ljOIs2ypNKca80Lrjw":{"text":"Brunch here was hands down one of my most memorable experiences during my first visit to N","useful":2,"cool":1},"mxV_39uQg4mXL9jsUGJhMg":{"text":"All of the staff was amazing. The food and drinks were perfect. The gumbo was by far the b","useful":0,"cool":0},"MVGq6naQpnAnMBM5AMlapQ":{"text":"Excellent authentic Nar'lins food. The jambalaya was awesome.  Service was good and prices","useful":0,"cool":0},"KHVcmsvAmg-1ASfdmkfI8Q":{"text":"WOW! \n\nCame here for a birthday lunch. Seriously stunning. \n\nChicken was hot, crispy, and ","useful":0,"cool":0},"iPxBT9yQy6UF5vDfeDtS_A":{"text":"Food is delicious.  The biscuits are so good I wanted to tuck an extra in my bag to go.  A","useful":0,"cool":0},"LPYfQTHVFJGbFJx7dcOriA":{"text":"Wow. Food was pretty bad. Jambalaya - rice was over cooked, chicken was over cooked too. F","useful":2,"cool":1},"Zl9kC6IOFw8xVA-SLVl9jg":{"text":"Pretty good. Cute little outdoor courtyard.  Food was good and fast. Kinda hard to find so","useful":0,"cool":0},"6ymdD6h2BvVR8NlW6TijRw":{"text":"Had the Triple D and it was pretty good. The only thing that disappointed me was the crab ","useful":0,"cool":0},"yl_x6FrP2lYrEu2yNkptWQ":{"text":"The best chicken gumbo in the world","useful":2,"cool":1},"SvXVm4l5FSpnuTgyV5RYHA":{"text":"Crab balls are amazing. Also loved the BBQ shrimp. Add a side of onion rings, you won't re","useful":0,"cool":0},"1Pi9wFTvQjc5nKGzVKukVg":{"text":"Went to this because it appeared in a blue moon guide and had good reviews in yelp.  Arriv","useful":0,"cool":0},"mhvagCdZgp6hVcdUdNNANA":{"text":"Here for lunch. I had a half oyster half shrimp po-boy. It was good. My friend ordered a s","useful":0,"cool":0},"KR-wH3zyWmm78QixA3eYeA":{"text":"I loved this place. The food was great and the staff was awesome. There was a specific wai","useful":0,"cool":0},"_DUyrDpnflxN-cFbkrDcTQ":{"text":"This place is a must! The waitresses are friendly and welcoming. We visited twice for brea","useful":0,"cool":0},"Sx5z5fzCTEUqwA85l6GbIA":{"text":"This was my only attempt at breakfast during my trip to New Orleans, because who the hell ","useful":1,"cool":0},"CjhCrsWZ7wA7FSoudhMKNQ":{"text":"Let me start with food is outstanding.  Ordered the Cheese Blintzes and coffee.  Perfect f","useful":0,"cool":0},"AtgInn8dzaHcfc3-ODPBIg":{"text":"A little hung over, tired, grouchy, we popped in the Coffee Pot for a late breakfast, on t","useful":1,"cool":1},"fBKWcgy8cc9SfWcwW_QDZA":{"text":"I was looking for somewhere to have some hot soup before work and stumbled upon this place","useful":0,"cool":0},"LbTe1dtRDHJMdFF0TGxBdA":{"text":"Not terrible but not great either. I guess this place was on Diners, Drive Ins and Dives a","useful":0,"cool":0},"J2gsWPqAnQMGe4WAz0lIfA":{"text":"This was okay, not great. The poached eggs were over cooked and hard. The coffee was okay.","useful":0,"cool":0},"iEzpujGyDh_BYUnJBB0A6w":{"text":"We had an early dinner there, sat at a table in the window.  Waiter was very nice.  Servic","useful":0,"cool":0},"FvGsUaCZA0j4yXNObBI7vw":{"text":"I LOOOOOOOOOVE this place for breakfast!!!  The service is so delightful.  The team of wai","useful":3,"cool":1},"C_7WojDLPgqL-CIGXAsHeQ":{"text":"Came here on recommendation of someone I know. The food was great, but even better than am","useful":0,"cool":0},"m3e4OiVwYByLh5_4pt4scw":{"text":"Been to NO a few times, but this trip was the first visit to The Old Coffee Pot. We went f","useful":0,"cool":0},"txb1KUVkbt7Nb09nJaeXdQ":{"text":"Grits!!!!  I love grits.  I eat them all the time.  These grits were phenomenal - creamy a","useful":0,"cool":0},"X2b4ZrgEVuKex6kO_T8Cyg":{"text":"Great place to eat if you are around Jackson square. There is usually a wait but we'll wor","useful":0,"cool":0},"it3cZ2i-kNtykqU-c8v6HQ":{"text":"Staff is still excellent.  Location is right in the french quarter.  This time around I ha","useful":1,"cool":1},"QZ-ndRdgpPac5lINQ37MLw":{"text":"We came here on the taste of New Orleans tour and had to come back, the seafood gumbo was ","useful":0,"cool":0},"CNdYrsRrKYmaJHvbtN8hUg":{"text":"Great crawfish pie & jambayala. Drinks excessively over priced. Good bread pudding. Old ho","useful":0,"cool":0},"OImgcudrlfLe9SwkqckibA":{"text":"Loved the wait staff, the atmosphere and the food! Thanks Troy (desk clerk extraordinaire ","useful":1,"cool":0},"yJjhgAY4F2w1fi1JnpjOLQ":{"text":"Ambiance is great. \nVery sassy and the wait staff are friendly and full of life! Have a bi","useful":1,"cool":0},"GxIVcIJ-Gvtxix81szPJDg":{"text":"Saw this on Diners, Drive-ins and Dives, had to try it out. I had the omelette Rockefeller","useful":0,"cool":0},"YdbZijVP1oBOxnAXtFgwDw":{"text":"IT'S MY 200TH REVIEW YA'LL!\n(I don't know why but for some reason, I just can't pull off s","useful":0,"cool":0},"yTLeVR-MtD_Vl8sUVKj4Mw":{"text":"We went here as part of a food tour and were served gumbo and jambalaya. The gumbo was ok,","useful":0,"cool":0},"ya-hFPxueKpuFaXN7hltbg":{"text":"Old Restaurant right next the the famous Pat O'Briens Bar !","useful":1,"cool":0},"ZvQ55PFhEhK5koSoplV1MQ":{"text":"It can be crowded and noisy.  Service is pretty good and the food is very good.  I've been","useful":1,"cool":0},"LvCabXxh7nmpN-IaALrg0Q":{"text":"Poor service at a not-so-busy time.  30-minutes after sitting down two waitresses came by ","useful":0,"cool":0},"aGSsPP-Nwsd0Ft9mhnNEfA":{"text":"We wanted to stop somewhere to grab a quick bite and escape the cold weather conditions fo","useful":4,"cool":2},"HxpRC-BijxG919DHukh2Fw":{"text":"I visited for a lunch one day and sat outside in the tiny courtyard off the main restauran","useful":0,"cool":0},"slAKofB_qw5aS5U4f7LQKg":{"text":"This was my first trip to New Orleans and I did not know what to expect. I did know that t","useful":0,"cool":0},"BKTsQpJLJB1Uo2QCQdggCg":{"text":"My breakfast was so so, I felt like it was old.. the biscuit was definitely not fresh, and","useful":0,"cool":0},"nCgAiaeI699EnY1VtKeigw":{"text":"I had the Eggs Sardou. It was an excellent spin off the very typical eggs Benedict. Super ","useful":1,"cool":0},"19jUYv_jwUmWlCu2ab4lOw":{"text":"We stopped by here for breakfast one morning-we were seated immediately and given menus. M","useful":1,"cool":0},"v-YteMh2gkmd7KbyfaBuoA":{"text":"It's a must every time I visit.  I love the old ladies that serve you and their great Sout","useful":0,"cool":0},"YHRnjFyOC72jeq0a2nYyTA":{"text":"eh, no complaints, but nothing to write home about. To be fair, I ate some pretty incredib","useful":0,"cool":0},"Mc3gvbioPZbek_Ir2KerwA":{"text":"We ate here twice during our recent visit to New Orleans, and both times were awesome. I h","useful":1,"cool":0},"uMR4V6D3WFbJbp164kq4Bw":{"text":"They do some mean grits and mixed with a poached egg - oh yes thank you very much.\n\nLove t","useful":5,"cool":5},"lla0RjRbz_VFAYTu9bjEuA":{"text":"Nice quite place with reasonable food prices. Seafood gumbo yum. Get the crab balls made f","useful":0,"cool":0},"V-Hnf55oHIOUjJ5YMBDQOQ":{"text":"pretty tiny, wait staff were great though and super personable","useful":0,"cool":0},"0gf6DPp6f7vEbi3eU1-Wdg":{"text":"Interesting food, interesting service, but by no means stellar.  I had the eggs conti whic","useful":0,"cool":0},"z3nK7POFylWsXJSSVLDidg":{"text":"Omg the cornbeef hash is incredible!! And they make the cream spinach to order and boy I t","useful":0,"cool":0},"7YrSCgmhPNeFdv9pyMewWA":{"text":"Came in, got a seat for two, placed our orders. This was within the first 10 minutes or so","useful":1,"cool":1},"jTiDtPC_b_coN_v6FFl8Mg":{"text":"We ate there twice this past week, the food was good but the service was horrible!  Paid $","useful":0,"cool":0},"7d6NzQD-pdAoLIpe2WuD7Q":{"text":"This restaurant used to have the best Red Beans and Rice.  Not anymore..  Red beans no fla","useful":1,"cool":1},"9ESGfvBMGX1umqYGHpJg9w":{"text":"Not sure if they are just blind or hate people here. I had to check to see if was dead and","useful":1,"cool":1},"5xDaVCNUtwpdJOyPfho1CA":{"text":"Open for breakfast, lunch, and dinner.\n\nFeatured on Diners, Drive Ins, and Dives.. They ma","useful":0,"cool":0},"m7pPqt6UY-S1Wy0iR2IqZA":{"text":"I remember this used to be a great place to get breakfast but this visit I had horrible ex","useful":1,"cool":1},"JaN_4RdxARGfgJZ50Ysd3g":{"text":"Between a 3 and 4. Recommended! Had 2 wonderful brunches. First one, I ordered pancakes an","useful":2,"cool":0},"mfRhzeXzwedVQo7UQLj0zQ":{"text":"The food here was exquisite and our waiter, Brock was so hospitable and a joy to be around","useful":0,"cool":1},"GtAqg01SELmXvMpR3t1Taw":{"text":"I learned about The Old Coffee Pot because I'm a Diners, Drive-in's and Dives addict. The ","useful":0,"cool":0},"_tQvqbw8DG5DhrurJOumZA":{"text":"** 3.5 stars **\n\nThis old-fashioned Cajun-Creole restaurant in the French Quarter has been","useful":0,"cool":0},"dgK3Awawi6IQ6V1Y0iRQxQ":{"text":"Every single time we are in New Orleans we dont have to worry about where to have breakfas","useful":0,"cool":0},"ILlDdlJNowp0DfO-8xkVXQ":{"text":"Stopped here for breakfast during our first full day in NOLA. I wasn't aware that DDD had ","useful":0,"cool":0},"bWGDzQPo-HdrT1lAsGMfeA":{"text":"Was able to accommodate our large party on a Friday, everyone loved the jambalaya and the ","useful":0,"cool":0},"7sPrSrxeKjV1ZDaYxxON7g":{"text":"While the food was quite good, the service was not. The first time, we were told to leave.","useful":0,"cool":0},"kKUHBbNG5V2BGv85Ht2lHA":{"text":"Where to begin is terribly difficult. Was seated right away inside and were given menus. L","useful":4,"cool":1},"vCTo9tGCe3vVYTiOAKgBcw":{"text":"Yum!!!! We came here for breakfast. What an awesome way to start our day of adventuring ou","useful":0,"cool":0},"jl6WmV9tlRrr8F0jbVQHTw":{"text":"Went for the first time today to have Breakfast. I was thoroughly impressed with the Butte","useful":0,"cool":0},"Je65ySt0dP5dgqU2ENZ37w":{"text":"Best beignet that I had in New Orleans was at this place.\n\nWe tried Cafe dumond, Cafe beig","useful":2,"cool":0},"6RWRLl-iemN5WZxyIJPqSA":{"text":"Service-wise, this is the worst restaurant I have ever been to in New Orleans, and I know ","useful":8,"cool":1},"tSAuTSqrQc44TC9sMP1-rg":{"text":"Did have to wait for a short amount of time (they were packed and a 9 top was before is) b","useful":0,"cool":0},"tTNMfhYIJBcd405aJdU4Eg":{"text":"Pretty bland. Eggs were not good. Had the conti and was terrible. French toast the bread w","useful":0,"cool":0},"dSXmm5xcEfObHx20GIYeCw":{"text":"Great food - Lost Bread is alway epic and Biscuits are killer. \n\nExpect good service - not","useful":0,"cool":0},"4o2qb_k_6bVA90Oj-tDAbw":{"text":"Try this place for a unique New Orleans breakfast. The Rockefeller omelette with grits was","useful":1,"cool":0},"YTOnUidRFk7xu2mgRsK8eg":{"text":"The food is EXCELLENT!!! The service SUCKS!!! The waitress gets loud with you when you get","useful":0,"cool":0},"q9usZiThGqqs7HxEFib9eA":{"text":"Best breakfast place ever. In expensive, great service \nI would definitely recommend 100%.","useful":0,"cool":0},"d7JVMDXqg-bwEcjI3utnog":{"text":"Love this place!! Great breakfasts and atmosphere. The waitresses are old school and funny","useful":0,"cool":0},"FDGT7WyOMil_2U3fDPAP_Q":{"text":"Hope the food is good as the wait is horrible. If you're popular why don't you get more wa","useful":1,"cool":1},"RrjBbMA-xTYAd-dQNpqjgA":{"text":"This review is for Callas cakes and coffee only since that is why I went there. I came in ","useful":1,"cool":1},"ZWXLpI6croCfPL3Ud2DyOQ":{"text":"We enjoyed a well earned breakfast at this place after driving through miles and miles of ","useful":0,"cool":0},"dFqpA-O5fv6PO_CAs2ZEwg":{"text":"After watching Gordan Ramsay 24 Hours to Hell and Back, this was my first meal in NOLA\n Th","useful":3,"cool":1},"ha_r8N8SAiHUFAPTnDfsNw":{"text":"We went based on a recommendation from a local. I had Eggs Jonathan, basically eggs Benedi","useful":0,"cool":0},"px9_K9kKGe6WTU5HOGakMA":{"text":"The food here was good but the service was subpar. Our waitress was continually short with","useful":0,"cool":0},"Az4S_y65WCRaFVDQQQ1WYg":{"text":"This place is a little divey. We went on a Wednesday night and the food was just ok and th","useful":0,"cool":0},"mYQY1-EbJhpqgHSqbzgLlw":{"text":"Great little place. Prices are more reasonable than other joints In downtown. Only \"gotcha","useful":0,"cool":0},"JHpzzz8nE2NsEbPwSskrbg":{"text":"After a weekend of great food and fun, a group of four of us were nearing the end of our t","useful":0,"cool":0},"bsYtcjJXk99kzTMYLBw6jQ":{"text":"We ate there on a Saturday morning so they were busy, but service was good and our waitres","useful":0,"cool":0},"-oZrqVOnRG4GLqmxOq301Q":{"text":"Eh, the food was ok.  We came in since we didn't have anywhere else in mind and someone on","useful":0,"cool":0},"39kCnVC0sugMKUml_8kwbQ":{"text":"How could anyone rate this place less than five stars!?!? Absolutely amazing. The chicken ","useful":0,"cool":0},"m_3kHRLyiGVA-vZjZBUY9A":{"text":"Breakfast was D-E-L-I-C-I-O-U-S!  I had poached eggs on English muffins with artichoke hea","useful":2,"cool":0},"a1wskJj0JnvQCHSF9bOB_g":{"text":"Great food, but soured by the attitude of the staff. I heard so many great things about th","useful":0,"cool":0},"syYpqhkEtLdMEqHbp4OGgw":{"text":"Big fan of their breakfast/brunch, and especially of the Cala Cakes. \n\nDinner was pretty g","useful":0,"cool":1},"8kN_Y5uz_mBE-Dycv7Dseg":{"text":"Wow. I have eaten here many times before, but, not in the last year. Had company here from","useful":1,"cool":0},"O_o9pjRFhROXa65Ibmrh4Q":{"text":"Was in New Orleans at the French Quarter one weekend celebrating a friend's 40th birthday,","useful":0,"cool":0},"bWTL7cS2HOgZ_egIcjvdVg":{"text":"My Jambalaya was bone dry, as though it was a leftover from the day before and nuked in th","useful":0,"cool":0},"CCLHHkHY3MtWvgBRMriIMQ":{"text":"I am not a sensitive person, yet the service here literally almost made me cry! My husband","useful":1,"cool":1},"tNbiC_2lFm6fjZGZo1_tIA":{"text":"A group of us came out to New Orleans for good food and libations.  A friend recommended w","useful":1,"cool":0},"rs0YzAzkjXIEMeBFyYs2LQ":{"text":"This place was on diners drive inn and dives so we gave it a try.  Just ok. Food decent bu","useful":0,"cool":0},"kRzZcKPyxFtXK5OIVvqK7A":{"text":"First of all, I almost didn't agree to come here because of the name.  I wanted a real, si","useful":1,"cool":0},"6VMk7HwmgDHtjtXTgEvRjQ":{"text":"Last weekend we stopped on for breakfast, there was not a wait but every table was taken. ","useful":2,"cool":1},"OphleTKmN1pY8Lf6UNJgdQ":{"text":"What a difference a couple years make. Last time here, we ate our way thru the breakfast m","useful":1,"cool":1},"FFQWws4UX_sZacKPxOo44w":{"text":"Our last stop in New Orleans for my birthday breakfast!! One of our annual stops! always g","useful":1,"cool":1},"vsnymvZK3-11gzQnqloKAQ":{"text":"Excellent service, food was absolutely fantastic. Our table enjoyed the triple D, red bean","useful":0,"cool":0},"iJpA1oVVH5r7HSPx70cvCw":{"text":"Best place for food, you may have a wait but completely worth it! Best Red Beans N Rice! O","useful":0,"cool":0},"4kOr1X4XedNscs0Mii4AJw":{"text":"Crab cakes-a bit wet for me.  Great sweet potato hash.  Good green bean casserole.","useful":0,"cool":0},"M9aJAO-1H10NOxw9anS36g":{"text":"I love the Old Coffee Pot, from the dusty inside to the small courtyard right down to the ","useful":0,"cool":0},"Kv-xRz3VRGoSXF9nIMluWA":{"text":"The po boy sandwiches are very good. They were a good size and came with fries. Very reaso","useful":0,"cool":0},"x0XqQ2O2FPj2uj82qlhIxQ":{"text":"Ate there last night. Terrible terrible place. We had a party of 9. First off both servers","useful":2,"cool":1},"pIhvM_C3TFE_kqUxvraIeQ":{"text":"Sigh.\n\nThis place will pull you in with it's decor. Quaint and beautiful. Ignore the rats ","useful":1,"cool":0},"KE61EWr5HFrTEKOTq4Xa0g":{"text":"This place rocks. I just came back from NOLA and one night my friend and I were walking ab","useful":0,"cool":0},"ROQqk6z1WE2KkaPkqEvClg":{"text":"Great food nice staff definitely coming back the next time we are in new Orleans We Had Th","useful":0,"cool":0},"f-rqgiTtF748OOqpeeiL7w":{"text":"We went here for breakfast after a long night out. The service was very good and food was ","useful":0,"cool":0},"NQ36Sl4OhM5VTKAOVpaYog":{"text":"After walking around for a while my friends and I got hungry for lunch. We saw this place ","useful":0,"cool":0},"qCfWPtr_OiwKWonJjkDAmQ":{"text":"Christina (aka Nina) was a fun and friendly server the food was good we had a table of 7 a","useful":0,"cool":0},"1D6NbHAVGnOdG-h8M47CXA":{"text":"Service was very poor....servers were nice, but it was OH-SO-SLOW!!!  We got the chicken f","useful":0,"cool":0},"CGY9xEXPK7K5fBl8ywcPwg":{"text":"After the mixed reviews I was so glad we ended up stopping in. We stopped in on ash Wednes","useful":0,"cool":0},"rig2oVFckQG-H1SRmxz71Q":{"text":"We walked in the other day.  The waitress was singing.  Loudly and badly.  The diners look","useful":1,"cool":1},"CwfRa5CeF_A8BhxiHOxpSQ":{"text":"Almost didn't come here because of the poor reviews. Took a chance on a recommendation fro","useful":0,"cool":1},"oMoctxld09JdWP5B4zJSrw":{"text":"Great service just as you would imagine. Outstanding food in a quaint setting. Must try wh","useful":0,"cool":0},"nEWTkkLTedL9M-7noTgzWg":{"text":"Seated right away. Menus and water right away. Drink order right away. Food order taken ri","useful":0,"cool":0},"htMB2sA5fHIdfH8JPlM6Aw":{"text":"So sad that this place changed to try to fit in with the status quo...the old rose chandel","useful":0,"cool":0},"kMUNYg329aLE_xrH5AYaDw":{"text":"Whenever you tell someone you're going to New Orleans, you always get suggestions on where","useful":0,"cool":0},"C5zqOuLH-TFrKgXQOMjDdQ":{"text":"This place is unreal. We walk in and nobody was here and we almost left, but sat down and ","useful":0,"cool":0},"jy6awm7_MI1-gq1Z_NBaMg":{"text":"Our first meal in new Orleans amazing food. Banana pancakes are delicious, people are very","useful":0,"cool":0},"VmzzZ1Ml2RNyb7uwxeayHA":{"text":"Definitely worth the wait. The food was great and the service when we were sitting was goo","useful":0,"cool":0},"E2aKP9e-UmFCXbU3eb7x7Q":{"text":"This was a lovely spot for breakfast. The banana blitzes were amazing, the mimosas were ju","useful":0,"cool":0},"tV7ri0pQR3srN5b4ivnHNQ":{"text":"Of all the places I ate in New Orleans - this was probably one of the worst.  We only went","useful":4,"cool":0},"frc_XPrJ4AeaWuR8quuL6w":{"text":"Took over two hours to have breakfast. There was only one couple in front of us for a tabl","useful":0,"cool":0},"S9ycvHvx9ECZ4E_wzgNhtw":{"text":"My food was actually ok, but the whole experience was very bizarre.  I was looking for a b","useful":0,"cool":0},"P2AWUKcwHJSewLJGtAPD1Q":{"text":"We had breakfast here one morning before taking the streetcar uptown to the zoo. We were l","useful":0,"cool":0},"M2CCD8RH9LM0-9PKtX9hYA":{"text":"Meh. Super touristy, and the line was seriously 40 minutes long on a random Thursday at 10","useful":1,"cool":0},"GBJW63Pp4GF5K_Mb7puLQw":{"text":"Beautiful building, sassy waitresses and cheap, good food. What more do you need? Great br","useful":1,"cool":0},"sqTPw51Y5LnTdfA4BYqpuA":{"text":"My husband and I were a little wary since some of the reviews seems iffy... But I read tha","useful":0,"cool":0},"bPmq9TdCTIY5yeGEfsUqcA":{"text":"We had a late lunch at \"The Old Coffee Pot Restaurant\". I think it's also called the Comma","useful":0,"cool":0},"CBFznM5Yhv6gIjlEIxS2Kw":{"text":"Love the food and the ladies here are always super nice. You have to try the Lost Bread!!!","useful":0,"cool":0},"sABFSQv2rvuAsI7R1VnoTw":{"text":"This was a hidden away gem as we walked along the busy street. The food was excellent as w","useful":4,"cool":0},"4CYbmB_x5nMdr5YkBtxTlw":{"text":"The food was excellent - if you go there, you have to try the Fleur de Lis Chicken! Everyt","useful":0,"cool":0},"UuJoD6zFMIHvtGDqnl4vaA":{"text":"Our first taste of New Orleans food.\nMy friend had brilliant meal, mine good, coffee not s","useful":0,"cool":0},"qy0ZCTmAf7MfstfcCjSWJw":{"text":"Totally cool place!  Great wait staff!  Truly old New Orleans.  Great food!","useful":0,"cool":0},"xV6kcK6nBlob6JwsuG-2Fg":{"text":"We were on our honeymoon, and had just got off our cruise ship and had to wait to check in","useful":3,"cool":1},"C0guPd5ecvxclf5g4ajdkw":{"text":"Sadly hardly any coffee but a decent alternative to the busy Pat Obriens next door. Choose","useful":1,"cool":0},"KdP3eVW62GXyFIAZ0FXegg":{"text":"Best fried eggs and grits I have had in a long time!  Really enjoyed every bite!  Next tim","useful":0,"cool":0},"9tRTIWToHpxDenmusFsHjQ":{"text":"I've been here twice since October - both times the waitstaff was very slow. Food was okay","useful":0,"cool":0},"FqP-18ZXq9zC49a-eJrcDw":{"text":"Triple D. So Damn good I almost got aroused. my waiter even comp'd me a bowl of panty-drop","useful":0,"cool":0},"p80c_UOJuE606qfmEL8cHQ":{"text":"Excellent breakfast choices. Traditional New Orleans dishes like Eggs Sardou and Eggs Cont","useful":0,"cool":0},"bvXKmMbglJ4zTufMMcutRA":{"text":"To the people who complain about the slow service,\n\nGO SOMEWHERE ELSE\n\nThis is New Orleans","useful":2,"cool":3},"-DyLIlZ2vNf3R5dg8B21QQ":{"text":"Went here from a recommendation from a local and were not disappointed. My fiancé got a Cr","useful":0,"cool":0},"RSeN7HE4En4fEa1btWSiqQ":{"text":"Nice little spot, friendly servers, and a simple menu. Sometimes that's all you need! We o","useful":0,"cool":0},"hg6JN0TnusxGgvD87WS6Kg":{"text":"Yelp never fails! The staff was sooooooooo nice and friendly! The food was delicious! I go","useful":0,"cool":0},"QYBE015Y3RyyYXizcq198g":{"text":"There wasn't anything wrong, but there really was nothing great about the Old Coffee Pot. ","useful":0,"cool":0},"yTBGDzfPsAxme5ncl-HIfg":{"text":"Best omelette I ever had! The shrimp omelette had just the right amount of ingredients. Po","useful":0,"cool":0},"HLpBeOxfgZ1aZXWCCfLypQ":{"text":"What is going on in NOLa with restaurants?!?!  NOLa... the tourist are the ones eating in ","useful":1,"cool":1},"AUj8Jrfg6UgeheCYF8_D1Q":{"text":"Good food but a little more on the low-key side than expected. The gumbo was very, very th","useful":1,"cool":0},"F1kHMsmU76N8gYSTnO09QA":{"text":"I have really mixed feelings about the coffee pot....\n\nTo start, their A/C (if they have a","useful":2,"cool":2},"2sJqbt9uAvMEg8dg0XcdGQ":{"text":"In search of some breakfast, once again the girlfriend and I followed the advice of savvy ","useful":4,"cool":2},"1IVkZhv9_Wfvalow9UGWxg":{"text":"I had a great experience here. We grabbed a table by the window, and even though they were","useful":0,"cool":0},"ACoT1pmIRzKDEh70lOUyrg":{"text":"Deyamm! Great down home Louisiana breakfasts! Had the fried chicken and buttermilk biscuit","useful":2,"cool":0},"B1WfNTZZVNW41nYAZ9BUvg":{"text":"The moment we arrived we knew we'd made the right choice coming here, it had such old sout","useful":0,"cool":0},"Vw29gbDtqMaC6TY4tJVJ0g":{"text":"I went with my sisters and we decided to get the catfish poboy, crab balls and gumbo.  I m","useful":1,"cool":0},"qN0ONr8saD6M7pUe01LTuQ":{"text":"I got the pancakes but ended up eating my sisters drunken bread ! So deliciously sweet ! \n","useful":0,"cool":0},"y1tA4xROTwnsU4ATBzQ-Jg":{"text":"We live in NOLA, and this is Our favorite place for breakfast in the FQ, not only because ","useful":0,"cool":1},"Iy9iUDFFtBDISjnM6SfNaA":{"text":"Went there for breakfast and stood in line for around 20 minutes before finally seating ou","useful":1,"cool":1},"mAbO3MoLG7xZyoj8Mgn1dg":{"text":"This restaurant is as cute as can be!  Apparently, it's pretty popular too... so get there","useful":1,"cool":0},"PwLJb0ThCPe2_aNgKP-BzQ":{"text":"The food was good service was good but kinda slow. I had a horrible issue when I purchased","useful":1,"cool":0},"vhJS1VeFZmm2aRAfWQeYXA":{"text":"the food was okay. not my favorite jumbalaya or gumbo, but the fried chicken was delicious","useful":0,"cool":0},"_ERB3s2IoDL-tAam1WPNNg":{"text":"\"the best breakfast in the french quarter\"\ni have not tried every breakfast place in the f","useful":0,"cool":0},"Wj70yQR9sgj4WrlIkh5uWA":{"text":"Great food!!! Jumbalya was amazing chicken and biscuits were amazing biscuits could have b","useful":0,"cool":0},"OOudaAA3udurpC0XVLQwjg":{"text":"Lovely courtyard breakfast.  Those Callas Cakes are worth the wait!  However, there was no","useful":0,"cool":0},"D2Dq8_VWnkP1vNc_4aEOmQ":{"text":"Amazing experience ! The food , the wait staff and the atmosphere were fantastic! I had th","useful":0,"cool":0},"lbM0ct4KC6qhcxLUxve98g":{"text":"We were recommended to this spot by a local and The Old Coffee Pot was better than expecte","useful":0,"cool":0},"RSn87c6HGjR-FDvmnbXLLA":{"text":"What a great find. Perfect breakfast of crab cake eggs Benedict. Great staff. So many grea","useful":0,"cool":0},"zXnkN5PuMFuCuPh6n86Etg":{"text":"Eggs Sardou still in the menu but the menu is a shadow of it's former self. There had been","useful":0,"cool":0},"fu0_s3eon6w9qJU8QXPqGQ":{"text":"My husband and I walked here from our hotel wanting some breakfast and we found a gem! The","useful":0,"cool":0},"triHj0qu25IzZC4n2yqYrA":{"text":"This would be four stars for breakfast and two for dinner. Grits are awesome and eggs and ","useful":0,"cool":0},"pFEZ_ZeuX_BkHYMAKxBevA":{"text":"Saddens me to say the last time I ate here since the change it wasn't nearly as good. The ","useful":1,"cool":0},"302bhdZhWVVOSJAH4vOv6g":{"text":"My taste buds actually stood up and applauded after eating the eggs Sardou at the Old Coff","useful":0,"cool":0},"fHH1Q2NnvnhuxM5eWvOC1g":{"text":"Excellent service, excellent food, excellent atmosphere. I had the Eggs Jonathan, and it d","useful":0,"cool":0},"2yn1hgq7brBEMl33dM2vkQ":{"text":"Awesome jambalaya. The wait staff was fantastic and prices were reasonable. If you want to","useful":0,"cool":0},"40tmpPl33PwCnsyfk_V2PQ":{"text":"Can I give 0 stars? I can't actually say the service was bad, because there was no service","useful":1,"cool":1},"Gg8kzzDMVjqJlnGWmiijfw":{"text":"What a surprising find down near Bourbon Street .  Had a wonderful blackened fish , shrimp","useful":1,"cool":0},"8JEUUVa5zjM34G-PVHckyA":{"text":"So we saw this place on Diners Drive-Ins, and Dives and it was right down the street from ","useful":0,"cool":0},"nC3zM9xc2cOreh8X_PefSw":{"text":"Wow! This place definitely has that old New Orleans charm, right down to the nice old skoo","useful":1,"cool":0},"862CCWjHJq5cm0ScCzhABg":{"text":"Absolutely love The Coffee Pot. I will not eat anywhere but here in the French quarter for","useful":0,"cool":0},"yrPOvD64xNWrwzU-9pluhQ":{"text":"Great food and atmosphere, there is one waitress there that makes the experience one of th","useful":0,"cool":0},"Wd6v6g3mQZVC11I_8R-d5g":{"text":"We came here for breakfast and had a great experience.  The no nonesense waitress had us l","useful":0,"cool":0},"JQ5Iblr5xsfUyjjJvQHiEQ":{"text":"My comrades and I stopped in here on recommendation from a cute bartender over at Pat O'Br","useful":0,"cool":0},"MH0fhvyyqkzDDOx28fkPQw":{"text":"As a displaced Southerner (on a field trip from N.J.), the staff \"snuck\" off to this AMAZI","useful":0,"cool":0},"1US6EbzcdhF5DCJYzIyyBw":{"text":"Absolutely PHENOMENAL!!!  My man has been talking about this place and its \"Lost Bread\" fo","useful":0,"cool":0},"0OvGUQCK5UaqqudHqhfCPQ":{"text":"\"Woohoo!  As good as it gets!\"  is right!  I've dined here for both breakfast and dinner, ","useful":0,"cool":0},"uqsKUfE2HVEt9bvmwpUNbQ":{"text":"One of my most favorite breakfast locations in the French Quarter of New Orleans!!!\n\nGreat","useful":2,"cool":0},"_XkJMj-sPOCALbi1uDroKw":{"text":"Good Spot! Breakfast was good. We had the eggs Benedict with crab cakes, shrimp and grits.","useful":0,"cool":0},"kUsvHV7aElZ7xGdHjRyY3A":{"text":"This has always been one of my favorite breakfast spots in New Orleans! \nI have been a cus","useful":0,"cool":0},"GHLaDVkK7dp-YtiNZdRNLA":{"text":"The food was really good but the service was not. We waited for a good half hour just for ","useful":2,"cool":0},"-g4PqVfgkjc8eMlU4rMtHA":{"text":"My 3rd time in 5 years (I'm not a local) at The Old Coffee Pot. Love the people who work h","useful":0,"cool":0},"Ux8yOwe7yJitJOC8BCwIEg":{"text":"Was wandering down bourbon early in the morning looking for a place that was open before 1","useful":2,"cool":0},"YIdnBEgYoGel3UvAvwmaNA":{"text":"This place was very busy for breakfast. They didn't have a big staff but they kept up. The","useful":0,"cool":0},"pjBpY6VAB1AhrzzyCjemJw":{"text":"This was the first restaurant I ate at on my first trip to NO back in '87. \n\nSome things c","useful":1,"cool":0},"NtTe3ueHAGVEkyvczNnnfw":{"text":"From a food perspective, this place is nothing too out of the ordinary when it comes to br","useful":4,"cool":2},"7x7jcTSyajmlXxA7dj_k-A":{"text":"I am southern born and bred and they have the best grits I have ever had anywhere....don't","useful":0,"cool":0},"cDdoD6p7wWFR-0pJ4F6hgQ":{"text":"The food here is excellent and has no need to wait in the longline. Nice food and location","useful":0,"cool":0},"S0LClzensZxXwfZ_i7sKSA":{"text":"Staff is extremely rude!!!! Food is good. Don't ask for any type of customer service with ","useful":0,"cool":0},"8Eh2ahVv8oxJDykJY9ZXTg":{"text":"Overall, we enjoyed our experience and may come back again. We were mainly attracted to th","useful":0,"cool":0},"DvQcRWCYY88_JapioIaJOQ":{"text":"This has been our go to place for breakfast and we had missed our last visit so we were fo","useful":0,"cool":0},"PKZe7vfT5IBET3ZqRxWG0g":{"text":"This place has quintessential New Orleans food, if you are looking to try some creole flav","useful":1,"cool":0},"C3QHkWAEJf77CqbYZWO2yg":{"text":"Came here early morning on Lundi Gras to grab some breakfast before heading out for the da","useful":4,"cool":1},"y_Kj4UrHGdNvjz_YoCHEzQ":{"text":"We love the Old Coffee Pot.  We eat there when we are in town.  I love the Eggs Conti.  No","useful":1,"cool":0},"zRxj-Gw9iwWbafKfZ_-yzQ":{"text":"Good food, good service, and a great atmosphere. Waited about half an hour for a table but","useful":0,"cool":0},"gi-qZthKlnqPnchUeYGezQ":{"text":"Great food! AWESOME SERVICE!!!!!! I would definitely recommend this restaurant! \n\nShrimp a","useful":0,"cool":0},"sDyJQk_R2hrcm9g6BF0iNw":{"text":"Horrible service. No coke products. Never again. \n\n\n25 minutes to get a beer after they to","useful":1,"cool":1},"l6Hm7jzIqU7vDFZlOgvv8g":{"text":"Hmmmmm...this place caught my attention when I saw it on DDD. I had to come see what the c","useful":0,"cool":0},"qiBecsGGdOUcziLgN-NEIQ":{"text":"Awsome food! gumbo, corn/crab chowder, roast beef sandwich were spectacular!!!!! Vegetable","useful":1,"cool":0},"W7NPMt44Cai_7pOJXV8Fmg":{"text":"The gf and I were walking in the quarter on a beautiful cool Sunday morning after mass whe","useful":5,"cool":4},"5lzlOWFuAKvr0NxBRDwKbA":{"text":"Probably one of the best places in the French Quarter for delicious authentic creole & Caj","useful":0,"cool":0},"tAZYEZmSW1mm7cON1yFaFA":{"text":"I saw this place on the Food Network and I knew I had to try it. The service was SLOW and ","useful":1,"cool":0},"JttQbK_Pwr_ISfR5HzzPQA":{"text":"We were doing the cement your and asked the tour guide where to have a good Gumbo. She men","useful":0,"cool":0},"GBvlNFC9am4wg7RxHao7-g":{"text":"Best seafood gumbo in New Orleans!  Sinfully delicious, and I felt like licking the bowl c","useful":0,"cool":1},"oHsTE65YRWX-4imoKAB04A":{"text":"I came here admittedly because I saw it on Diners, Drive-Ins, and Dives... certainly well ","useful":0,"cool":0},"D1wygdFotRimjaYzkiqZqw":{"text":"The food was good. The service was non existant, literally. Our waiter left after bringing","useful":0,"cool":0},"EoOrr8wfpCa19IUiVIV0hA":{"text":"We had dinner.  The food and drinks were wonderful.  Prince range included drink, soup, an","useful":0,"cool":0},"pXU3U7KL1lrN1W_vi0DfkA":{"text":"We loved this place. The atmosphere, the people who work there, the menu, the food... all ","useful":3,"cool":3},"PiRqfUmHmkbMMlu2LkZ3tA":{"text":"Eggs Creole with a healthy dash of Tabasco is my favorite breakfast in New Orleans. We sit","useful":0,"cool":0},"S1JING_4pRGSo7QjfYMzqA":{"text":"Avoid this tourist trap and clip joint at all costs.  Very over-priced, surly and lazy ser","useful":4,"cool":1},"A65ekRydDOUP2TL8Sc_Xxw":{"text":"Talk about southern charm and hospitality... I've never been called baby, honey, and sugar","useful":1,"cool":0},"4sslA2_-aIQdhZHWgsHy3w":{"text":"Amazing! Delicious food, knowledgable wait staff and well priced. We had the Parmesan Crus","useful":0,"cool":0},"VUX8Qv-tCXsm_mcTWuY2ZA":{"text":"Would not recommend. Food was ok but service was lacking. We were waiting to be seated and","useful":0,"cool":0},"Suoh_aUDIRlDLw9HJOWCaA":{"text":"Grits. That's all I needed after five hours of sleep after a drunken night. The service he","useful":2,"cool":4},"ogYmQK9oBdh7Sfn5txDwTQ":{"text":"We must have hit a bad night, I can't believe the Reviews.\n\nMy wife waited over an hour fo","useful":6,"cool":1},"DI2zT98gfeIApGBrgw-3Ow":{"text":"We went here for mardi gras back in march and got dinner. The pasta was cold and food tast","useful":3,"cool":1},"LHtWgYdAhBRz4GIqFPCpxA":{"text":"Cosy little space with sweet staff. Food was ok not necessarily anything great. The Cala c","useful":0,"cool":0},"QtFsEeEbHDwbRtxa80q1dw":{"text":"We went here on the Great Road Trip because my wife's aunt recommended it. I should have p","useful":0,"cool":0},"O8yTlyW3L7iLdnvtIcKMng":{"text":"We went because of our love for Gordon Ramsey! We enjoyed our experience. Tried new food a","useful":0,"cool":0},"PVKtwG_8YRxFoXD1Ha2Nqg":{"text":"Initially came here as part of the Tastebud Tours to try out their gumbo and their jambala","useful":0,"cool":0},"S8E5r-vhl7RnfX0Vjm74Fg":{"text":"A completely casual breakfast spot in the Quarter. Another place I frequent with each visi","useful":3,"cool":2},"wfoEFyt6dyRW_bIRa5dWfA":{"text":"Eggs Creole was very good. Eggs were cooked perfect. The coffee was a little bland, and th","useful":0,"cool":0},"w2RPRM4L6nmO7QvSJm40Ig":{"text":"Excellent jambalaya, seafood gumbo and crab balls. I thought I didn't like this kind of fo","useful":0,"cool":0},"4JtLx_2m6K4bpl5ZfYNCng":{"text":"I would stay far away from this restaurant.  The food is OK but the service is HORRIBLE an","useful":4,"cool":1},"d3a7K6bkfSUVEv4rKqo9ww":{"text":"Good food. One person in the group got the Lost bread it was to die for. Biscuit was excel","useful":0,"cool":0},"Fo-LrA3e-uB8YSzdOLxb_Q":{"text":"The best food in the French Quarters!!!! The wait staff is wonderful, friendly and comical","useful":0,"cool":0},"KW-xUv_CPYYihQfZL_3OXQ":{"text":"overall great place eat great food great atmosphere, didn't like the stairway to go to the","useful":0,"cool":0},"tZ-B0EyX684OaoRR0Fgy9g":{"text":"After a night of drinking, comfort food hit the spot! Great homecooked breakfast, nothing ","useful":0,"cool":0},"uRIUyVwrSOM9yqWicgd_5g":{"text":"Had dinner here, it's pretty bad. They hawk the place based on it having once been on \"din","useful":2,"cool":0},"6cHk59w2U-JP2knoYAcp-g":{"text":"Accidentally ate here while trying to end up at the gumbo shop. After receiving my soup co","useful":1,"cool":1},"b_wUg1n35FYJ60Jr504mnw":{"text":"The biscuits here are luscious, light as air and large...  If I lived in NOLA I would be a","useful":0,"cool":0},"-6P9cFezGTOdEp4YguBpHg":{"text":"Went here on a recommendation from DDD. It was good but not fantastic. I had the Fluer d L","useful":0,"cool":0},"emxgob9eWVImPsN2sXtpRw":{"text":"A colleague said the seafood gumbo at the Old Coffee Pot was to die for.   Oh yeah I almos","useful":4,"cool":1},"s-3og7uDTJlrJidxwZ9X1w":{"text":"Absolutely loved this place.  Great food and wonderful service, right in the heart of the ","useful":0,"cool":0},"v_Rs2XKBgUM-qyLt4d1B4g":{"text":"This was our first brunch place for our NOLA vacation.\nAnd this place has the best grits e","useful":0,"cool":0},"ixf6c_lctHz4_JGjSHwH2g":{"text":"Dropped in last Wednesday night based by the looks of the place.  A group of us sat down a","useful":0,"cool":0},"wqpl9enwiE79es4sbF4a-g":{"text":"Having recently been in New Orleans for business, I was in need of a great breakfast spot ","useful":0,"cool":1},"wUH4FrPA2RE2MWHQzJRp_w":{"text":"This is the best brunch I've had in a long time. I ordered the Eggs Jonathan, which is bas","useful":0,"cool":0},"8ob758TivOX0Et_hITLFvw":{"text":"We are early risers in nola, and this is a great spot for steak and eggs and the lost brea","useful":0,"cool":0},"KpGIs7gsHQzdfKdCNtV4tg":{"text":"Food was decent and the wait staff friendly. Atmosphere was a bit noisy (echo baffles in t","useful":0,"cool":0},"4wmhhA7rn_eyBQUlYYG6TQ":{"text":"Was not impressed. Service was horrible. Very friendly atmosphere at first, but quickly de","useful":2,"cool":1},"VvIfFBP5yF5UMKJGwLdoeg":{"text":"The courtyard dinning caught my eye and drew me in and boy was it deceiving. I agree with ","useful":1,"cool":1},"F3nlMzJ1WLFOAXGKDf4KoQ":{"text":"If I happen to run across a place where triple D has gone I'll stop by and check out the f","useful":0,"cool":0},"j4lCV7qZ-0KzNvaPHAENVw":{"text":"Excellent breakfast, great service and tasty bloody mary's - can't ask for much else!","useful":0,"cool":0},"zZPY2IFaf2GfdtAXzpukcQ":{"text":"Slow service and cafeteria quality food.  Would rather eat at mcdonalds and save the 15 do","useful":2,"cool":1},"t97RYpgjbDeSfTXtyVvg7g":{"text":"How this is not a 5 star review from everyone I'll never understand.  This is a New Orlean","useful":0,"cool":0},"XL1GfuzxQSNdYra37xCwSQ":{"text":"I went here on my last trip to New Orleans in May and can't wait til I am back. Don't let ","useful":0,"cool":2},"AkUIMKi64BAom66Jhh00pw":{"text":"A small place that really packs 'em in. An inherently New Orleans place with absolutely st","useful":0,"cool":0},"YnI-Q2Lfv1XvVVvkK8lhsA":{"text":"Avoid this place.  Service terrible - read the whole newspaper before someone took the ord","useful":4,"cool":1},"reggpv_HUunUD3qzcCw5Fg":{"text":"This place was wonderful!  Best grits I've had anywhere in the south.  We were there the m","useful":0,"cool":0},"ubsvl6L-LqvqiXRoojieMg":{"text":"I grew up in New Orleans, and this is definitely my go to breakfast anytime I return to vi","useful":0,"cool":0},"b75kRUS3bFr1kheDNoggiw":{"text":"Super solid breakfast/brunch spot. Calla cakes are a nice ending if you want something swe","useful":1,"cool":0},"wdjgRhQem0cpQVt9V5BP-g":{"text":"We went here 3 times while in new Orleans for a 4 days trip. It's that GOOD. Best seafood ","useful":1,"cool":0},"mZxOygJXuiPKn_B7p1WsIg":{"text":"We had breakfast and it was great!\nI had the shrimp omelette with Cajun potatoes.\nWait sta","useful":0,"cool":0},"3Xei7LMN0UIA5CyZgZOpIQ":{"text":"I became familiar with this restaurant during my taste bud tour in NOLA.  I had tried a fe","useful":0,"cool":0},"_FCN9bg5p1-pyRiZgX9ilQ":{"text":"Love this place! It's very close to Jackson Square, but tucked away so that it's not too m","useful":1,"cool":0},"mLU8OX3qv_EYDWpyVy3kwA":{"text":"My favorite breakfast recovery place in the French Quarter.  Eggs Jonathan is my pick.","useful":0,"cool":0},"YGGGESKHZGe7b_QJPNl0og":{"text":"The space is beautiful. The weather was a bit chilly during my visit, or I would have opte","useful":0,"cool":0},"GC9aPffb260ShU7JNf2GIg":{"text":"Good bloody Mary's, but the atmosphere and food are outstanding. Great waiter who catered ","useful":0,"cool":0},"OQlFWG9efRuCBSPcqcGB2g":{"text":"One of the best breakfasts I've had here in New Orleans. I ordered the eggs Jonathan, whic","useful":0,"cool":0},"zOJSawgTFYS2LB2_qWmtRg":{"text":"My mom and I visited this restaurant for breakfast. The service left a really sour impress","useful":1,"cool":1},"Qaxgxaiufv2VPl9vPBuTJQ":{"text":"Eggs sardou is amazing.  Tastes like spinach artichoke dip!","useful":0,"cool":0},"U51xbePjCl_nQ0th-EjcDQ":{"text":"Very Rude waitress, and service. Do NOT go to this hole in the wall.\nwe waited an hour to ","useful":1,"cool":1},"6srcrs-TAL7oP4RF59r-Dw":{"text":"My sister had a great experience here in October so today we decided to check it out for d","useful":6,"cool":0},"7QDeGKepgtybHegG4gHvsQ":{"text":"Lost bread, coffee pot, bread pudding! Bread pudding was good but not great. Not quite as ","useful":0,"cool":0},"xs4nUO8AnmPXWRo-bu77pw":{"text":"Went here because it was listed as a gluten free option. Not much in the way of gluten fre","useful":0,"cool":0},"lO3PmTvqcUZ8xo6mp0Acgw":{"text":"Our recent visit to New Orleans - this place was recomended to us by our hotel, in the Fre","useful":2,"cool":0},"q5AQDR_AlPZT5l8xs37XeQ":{"text":"We tried this place for breakfast one morning because my girl is gluten-free, and I had he","useful":0,"cool":0},"LQ8wpqstj2kRz57edWpz3w":{"text":"This was some of, if not the worst service I've ever received at a restaurant. The staff w","useful":2,"cool":1},"cJRATHZEeNyz1wes083i2w":{"text":"Don't be fooled by the \"wait to be seated sign,\" because you will probably be there for a ","useful":1,"cool":0},"SMcXpc3z0B0a0hFbb8wnaw":{"text":"Awful! !! Had no idea this place was featured on diners drive ins and dives!! I would put ","useful":1,"cool":1},"MeLWNowoudODVKG4Loy-cg":{"text":"Ate here this morning for breakfast.  They open at 8am, and it filled up fast.  Very small","useful":0,"cool":0},"h22Wwd2JHjM-IZYSXBa2VA":{"text":"We walked in the restaurant and received a very unwelcome vibe. We had to seat ourselves o","useful":1,"cool":1},"T6W5YKSHlkwyPUAd7PcdyQ":{"text":"Came for brunch with friends.  I would highly  suggest the seafood gumbo and the bar b que","useful":0,"cool":0},"_e2pcX5xArxHlN8P0h7Qjw":{"text":"I got the crab cake eggs benedict and the strawberry mimosa. The benedict was really good ","useful":0,"cool":0},"ttQRWK_wheLFPMo1SCzrxw":{"text":"Loved it. We stopped in here on our first night after seeing the Diners, Drive-Ins, and Di","useful":0,"cool":0},"7-PT8Fa3j-kpPV0i3EJSxA":{"text":"Cash only. Breakfast is great and the portions are generous. I had eggs creole with grits ","useful":0,"cool":0},"HvujHsl67sLjhAsTtaqXuw":{"text":"I'd give it no stars of I could. Waited 20 minutes to order. Waited another 45 for the foo","useful":2,"cool":1},"bSYJuoi9mBsTGvQEx97rAA":{"text":"My husband and I were in New Orleans from SoCal for just a few days to attend our Daughter","useful":1,"cool":0},"VgXCRPKO-wjVeiXe_-wvQg":{"text":"It is a decent restaurant...good location but it isn't one of Nola's best. We ordered trad","useful":0,"cool":0},"H_kFD3xu1zrP5ANtJCtiqQ":{"text":"Had the jambalaya and the catfish wasn't anything great had better service was good the po","useful":0,"cool":0},"n7kk1gUY2k6km3O2a_7DSg":{"text":"Found this place extremely rude. Came in by myself for a table and was given a dismissive ","useful":3,"cool":0},"kxTMSQ-kq7ejGSeRIDPbMQ":{"text":"Food was ok. But was double charged. A coworker also had a problem with his bill. Be catio","useful":0,"cool":0},"h2fW3qN4BO9is6Hj6zWTzA":{"text":"Found this place on our initial stroll down Bourbon street. It stuck out because of the la","useful":0,"cool":0},"9gOuMKaKWHZ32hYsKu2ZKQ":{"text":"The service was abysmal. Got a stuffed mushroom cap/ oyster salad with no oysters. The  wa","useful":2,"cool":1},"U4iLmDOQjeMRNSbOHWZmvw":{"text":"Decided to stop by the Old Coffee Pot for breakfast. Their biscuits and gravy was amazing.","useful":1,"cool":0},"qBJuieepHuyGEMsvwvfSZA":{"text":"If you're ever in New Orleans you have to stop here! Their food is amazing, good ole south","useful":1,"cool":1},"5DWIlYWyh4znGfMkeEUp1g":{"text":"My hubby and I were starving and ran across this little spot. From the outside it was a re","useful":1,"cool":1},"YtloU6n-Ga8GULOsy6f0Mg":{"text":"Great food in a historic building!  Super friendly staff and great service made the fabulo","useful":0,"cool":0},"Zr85WcSW9aCi-v7oAgDMSg":{"text":"This is the best breakfast place we have had in NOLA, the lost bread,  callas, and blintze","useful":0,"cool":0},"-KSDthNLddJNHnxAk2o5Iw":{"text":"Cute ambiance, great jambalaya and red beans and rice. However,  we had to ask for our cof","useful":2,"cool":0},"3-bHtDH2Uwc-vBiZ3Lo7Ew":{"text":"The service is absolutely terrible they are so slow. Server seems to have woken up on the ","useful":3,"cool":0},"aFykkRfKLit_0pxEdy12tQ":{"text":"Don't let the \"Diners Drive-ins and Dives\" claim to fame hook you.\n\nTime of visit: 11:00 a","useful":3,"cool":0},"KplI5Oc1fqB22_2080vcZg":{"text":"All servers are bad especially the young man.   They are very unorganized.  Nothing is qui","useful":0,"cool":0},"l07GxBJ_oCIGSuBYQ5CQFQ":{"text":"The service and food was okay.  It was very difficult to enjoy ourselves since the inside ","useful":1,"cool":0},"F-FK5kkckKWhm2_w1XRT6A":{"text":"Small wait (5-10 min) which wasn't bad for a Sunday. Waitress was very blunt and borderlin","useful":0,"cool":0},"KBxhF5V4H0arysi7-3C0tw":{"text":"After more than a half-dozen trips to NOLA & always saying, \"We ought to try that place,\" ","useful":2,"cool":1},"yRFpdJHfDjtA19RH9sEA2g":{"text":"Out in the quarter for breakfast with a fellow hotel/concierge friend, we decided to try T","useful":7,"cool":2},"j4KsvHE0tsANBXevDUlQAQ":{"text":"There are times when reading other Yelpers' reviews gives you a really negative bias again","useful":0,"cool":0},"U5v3uGnxMjSHXGa9I_zo0Q":{"text":"Wonderful lunch! We had the delicious buttermilk chicken and biscuits followed by a to-die","useful":0,"cool":0},"m2oj8gh7UtGlfeWUICIuDg":{"text":"Food was OK, sat fairly quickly and then waited almost an hour for a po' boy to be made","useful":0,"cool":0},"DWfpiywPjLeV9_RqUi05gg":{"text":"We came in here to try the old school n'awlins breakfast - calas and of course the coffee.","useful":0,"cool":0},"Q1PHlbuhVTCZr6x2zZQeNw":{"text":"Descent poboys for the price. Service was ok- too many distractions I guess. Waitstaff cha","useful":6,"cool":2},"x9bghy_RMNzQ3-ssGinBow":{"text":"Lost bread was great, amazing crab balls, good jambalaya, yummy cheesy grits, awesome corn","useful":0,"cool":0},"Uqzd3ZrxC1XZNQOSFSeR5g":{"text":"The Old Coffee Pot Restaurant was one of the best breakfast places to eat in the French Qu","useful":0,"cool":0},"8TLok2NHr_UDr1-P5echPg":{"text":"After seeing this place featured on DDD, we just had to try it for dessert.  The servers w","useful":0,"cool":0},"CKfWkQRoBFVOcrYeRusuSQ":{"text":"I have adopted a new grandmother at this place.  I could go on and on about it, but suffic","useful":0,"cool":0},"sR1EFpJSGdcEjeWdH9JFQg":{"text":"I should kick this review off by saying the food here was amazing!  Having my own southern","useful":2,"cool":1},"9poxG37if25i0NqPMDW1Fg":{"text":"Had breakfast there this past Sunday, so I don't know about lunch...but I will go back to ","useful":2,"cool":2},"2iacSubZ3Q4cpMSA1KE15Q":{"text":"As far as the food goes, this place had great seafood gumbo and crab balls. However, the s","useful":2,"cool":2},"MvU-ntwXO5UlHjcukv2KUw":{"text":"Very expensive for a very small amount of food. The food was so basic I could have made it","useful":1,"cool":0},"W8PZeQhyUydwuIG6X4OdLw":{"text":"This is it. You want a local breakfast place without the foofy stuff.  Eggs Jonathan, creo","useful":0,"cool":0},"k9lsyOu0Z1KSL_8bpmf6Fg":{"text":"This place has some good food. Great for lunch. I ordered the shrimp po boy w/ potato sala","useful":0,"cool":0},"_Yrw7s9zhblNf17HhhYP8g":{"text":"We had been told by someone from Austin that the breakfast was good here (although the loc","useful":0,"cool":0},"APMMvjwxnszpBYMiB_aFSg":{"text":"Decent food, but horrible service. No one sat us, no menus brought, took forever for the f","useful":2,"cool":0},"XBdJsTd7ujhzOnVPqPA7yw":{"text":"Excellent breakfast! Not sure what the other reviews are about the service but we experien","useful":0,"cool":0},"Dyv-EyRxMCmrMpU0yR2kLw":{"text":"Ate breakfast with a large group of hungover men on a bachelor party trip.  Omelets were e","useful":0,"cool":0},"hlnd7gZPzW10kR9TsZVe6w":{"text":"The food is excellent! Thank you Gordon Ramsay for coming and putting this place where it ","useful":0,"cool":0},"KHdmlJ_9ZE4qRskAYGkk3Q":{"text":"Service had the typical French quarter attitude of waiters who act like they could care le","useful":0,"cool":0},"X-KBrVOBQx_JtM0CoCa9Wg":{"text":"Terrible service. Went in to eat there were no signs about seating so found a table. There","useful":11,"cool":1},"3qhqyaod7ycJ693al3CeBQ":{"text":"Ate there today and left a little disappointed. The service was less than average and the ","useful":2,"cool":0},"Zrj9zHmHIMm0390c7_0oew":{"text":"Best breakfast of our trip! The crab cake benedict was amazing. We loved our waitress! She","useful":0,"cool":0},"VaoAxo4Fl6hxqC40p-BZrg":{"text":"Lower your expectations and you will like this place.  Chefs were upstairs hanging out smo","useful":2,"cool":1},"ocCaRAJYZGaFFeykc4w3pQ":{"text":"Wasn't too hungry when we piled in here mid morning with a big group in the middle of a ra","useful":0,"cool":0},"C2tLdzYNVFGoZA2a_bAp5A":{"text":"The jambalaya and catfish were great! My husband had the chicken gumbo and said it was als","useful":0,"cool":0},"hPu8EXzS8PPLykYFhuHELQ":{"text":"As I sit under a chirping smoke alarm that needs tending to, I'm taking the time to reflec","useful":3,"cool":0},"q-1NqDr7f-bjUcsIzMLzFQ":{"text":"Some of the food came out really hot the rest just warm. Our waitress was less then friend","useful":0,"cool":0},"XAxVQpzjuAUz_oBJrP3lWg":{"text":"We went to this restaurant with the hopes of experiencing another great New Orleans breakf","useful":6,"cool":1},"rVTjRT1EECslWHqWn2VYCQ":{"text":"They get their flavors, seasonings and spices right. Their food is tasty, but that's the o","useful":5,"cool":0},"nQH9cH7e3_s8tdQAtw84CA":{"text":"Meh.  Food was alright but they don't work very hard when the tip is included automaticall","useful":2,"cool":0},"FzITVsNiSKHl9GwEfRyVGg":{"text":"We had dinner here. The service was good but the food not so much. Although my husband lov","useful":1,"cool":0},"sAg2Bga8BDDCmCjTsTAVPg":{"text":"Great breakfast spot!  Amazing service and excellent meal.  I am not big on cooked bananas","useful":0,"cool":0},"a9trezMoATRKpGPGP-Ev7A":{"text":"I have to give this place a 2 star review solely based on their lackluster service! First ","useful":0,"cool":0},"U_m2rkfa4buCNkO9mGD9IA":{"text":"So let me start by saying the only reason I went to this place was because I Saw it got a ","useful":8,"cool":0},"wy4aSR-E-SlfUfmjImJFEQ":{"text":"Nice old place in the French Quarter.  A lot of people seem to be complaining about the se","useful":9,"cool":3},"0KmGydeNd_iEp-z1aYhHVg":{"text":"We went yesterday and got the rice balls that were delicious. We also had chicken and eggs","useful":0,"cool":0},"I8ZA_qi6xjgt_b2fbkQ8Og":{"text":"I draw the line on hair on the plate of food. Then they take the plate to the back and mov","useful":4,"cool":0},"8lG9Y_OlrLJyRuFwjzS0Gw":{"text":"NEVER AGAIN.  \n\nOur elderly African American waitress was hands down the rudest server (he","useful":22,"cool":2},"5hhQSdFS_rgWR0JcpW18WA":{"text":"Great spot for breakfast. Not a really busy place. I had the reg breakfast(eggs, bacon, & ","useful":0,"cool":0},"BdgWAMh0eiC2HRNiPwOMTQ":{"text":"My most disappointing meal in NOLA, was here at TOCPR.  Anyone who knows me, knows I love ","useful":4,"cool":1},"sdGJ122PHavLShbuDd2kkg":{"text":"Coffee wasn't great and the mimosa stop coming at her 1 round because they ran out of cham","useful":1,"cool":1},"-uXqx7EPylzugsH9oCup1g":{"text":"My boyfriend and I just stopped in on a whim and I am soo glad we did! The fried chicken i","useful":0,"cool":0},"Rruvg61rU6FyDCRMuU9EmQ":{"text":"We should have seen the red flag raised when it took 20 minutes for a waitress to come to ","useful":7,"cool":0},"d1o9Eob3z7Hc3H4xbukecg":{"text":"Best crepes we have ever had by far. Corn beef hash was excellent and loved the callus. We","useful":0,"cool":0},"ZOxQVU6uJLVrw8MvsbVCtw":{"text":"Food was great and the service was friendly. It was a little slow, and I have a feeling it","useful":1,"cool":0},"SSChvfPbvdxuDsalph8O1Q":{"text":"My partner and I went here for breakfast this morning, and we were disappointed. The food ","useful":2,"cool":1},"6RgcmLZkf-9LVwCMEL7o2g":{"text":"had a great brunch here - the plantation breakfast was tremendous and the eggs Jonathan (e","useful":0,"cool":0},"R9safwuAJH6OO_aTzxSKzg":{"text":"The food is phenomenal. Started with mimosas and the biscuits are real southern biscuits. ","useful":0,"cool":0},"ZnwU7MJWFl32WinaoT9cFQ":{"text":"Dropped in here to have a quick brunch. Moderately crowded seated quickly but service is t","useful":0,"cool":0},"kKBLy11OQs5FqVpJYnzqqA":{"text":"Would love to give this place a good review...but I simply don't know. Went, sat down with","useful":2,"cool":0},"GOls8YThbrhCTdIcSex4hQ":{"text":"Favorite seafood gumbo in the Quarter. Great service. We make sure to come here at least o","useful":1,"cool":0},"bBZ2DDVMQaNrbkHNYWfvNA":{"text":"All I can say is we ate here 3 out of the 4 days we were in town. On this my 3rd trip to N","useful":0,"cool":0},"fzImWbjFkDAP_OA3nLDJpQ":{"text":"Great food. No lines or waiting. Just as good as Diners Drive Ins and Dives described it!","useful":0,"cool":0},"TdsrTzLB3NLb8ts3KAfNew":{"text":"A big no if you look spanish or Indian. The place is run by 2 old ladies and I havn't come","useful":3,"cool":1},"en3UnP9m8mGX1BnA9C3rxw":{"text":"sooo this place was not as good as I thought it was going to be - especially about a lot o","useful":1,"cool":0},"EjcSMj3KVpFb1OHCic1Ihg":{"text":"We went here for breakfast.  The waitresses were very sweet and had wonderful personalitie","useful":1,"cool":0},"hKlC660xARHCxhDx8n6c1Q":{"text":"Tried the eggs Jonathan and wished there was more flavor. Add some salt or something. Sorr","useful":0,"cool":0},"Pm--nXUbP7Bb5Mzrm2lsuw":{"text":"Awful all around- the staff is super slow and forgetful, the food borderline awful no flav","useful":3,"cool":0},"f00mq0LeTzX2Hxg_hPBs0Q":{"text":"Very loud. Couldn't hear my wife across the table from me. The food was cold to include th","useful":0,"cool":0},"fHAXkOy0ZDTv3PF72pz_HA":{"text":"Tried to come here for lunch. Walked in, was told to sit anywhere. We went to the courtyar","useful":5,"cool":0},"DKvMsQWjAoww2hQ7m6YBYg":{"text":"We were really excited to try this place since it was Gordon Ramsey's kitchen nightmares a","useful":11,"cool":1},"PRDHFt-bcGjmvqqgiHfJhg":{"text":"Walked out after sitting there for 10 mins watching two servers argue about not waiting on","useful":4,"cool":2},"jKUupyqWd2eaSwYCE98qmw":{"text":"Terrible service. Rude waitress. She yelled at my mother. \"I heard you!\"... arguing with u","useful":11,"cool":1},"SmBMYqvDs4TWAOURKJM2nw":{"text":"AVOID. As this was our last in New Orleans before flying home, we were all expecting a com","useful":3,"cool":0},"ZNiaFeUPTJqw1URsDGvoeQ":{"text":"This place has amazing food! Its been over a year since we've been there and the jambalaya","useful":0,"cool":0},"w8TG2ojbmj9ZurJRZyi2-g":{"text":"Wanted to try this place again after seeing the Gordon Ramsey show. Last time we ate here ","useful":6,"cool":0},"0p5-_yS1V2Vcr5oJ7G0ZRw":{"text":"Perfectly prepared Gumbo and jambalaya paired with chicken and crab cakes. Decor is a litt","useful":0,"cool":0},"LSwPCnCg10RNnx54AyX9Hw":{"text":"Had the breakfast: chicken Benedict and crab cake Johnathan. Food was definitely 4 stars b","useful":1,"cool":0},"ZqQ6Tk2JrHlI3HZj9wDSMQ":{"text":"Probably one of our new breakfast favorites.\nDefinitely a spot I'd hit again when in the a","useful":8,"cool":2},"GlJXSEZpssSBCC2ryH7cWQ":{"text":"Worst service and no way worth the price. Usually if the prices are high but the service i","useful":2,"cool":1},"hA7u5SJGP0oSUEyPY9sdpA":{"text":"This hidden place in the Quarter was fine. Not bad, not amazing, but perfectly fine. My hu","useful":2,"cool":0},"WHebxU-UcKp7fAV4aom1dA":{"text":"This place is really nice!  Service is very friendly, very attentive.  Wonderful flavors, ","useful":1,"cool":0},"XdxQgY1ab6K-q8mggriDvw":{"text":"Now, let me start off by saying that the only reason this isn't a four or five star review","useful":0,"cool":1},"SL0wgRvhc8HXzrFp3t88uQ":{"text":"This place was a bit of a disappointment. Underseasoned fries. Boring po boy. And the seaf","useful":1,"cool":0},"pVsHPT1qWhv_ZmGSLGq_4w":{"text":"BEWARE - waitress stole my credit card info.  We ate here on 2/21/11 based on the reviews ","useful":7,"cool":1},"a8rH4-TlUEEdos3H_FKs8g":{"text":"Service here is horrible.   Besides being sat then watching subsequently arriving guests g","useful":4,"cool":0},"IdIdcYV6Bzh5CbizpPALpA":{"text":"I got the catfish jambalaya, the chef dustin gumbo, and the beignet bites and they were al","useful":6,"cool":2},"B5hodIyFRJHFpAySszDurQ":{"text":"This place was just ok for me. Went with a large group on a weekday, had the steak and egg","useful":5,"cool":2},"szLvJrAYY5VN4nTbYpEKOw":{"text":"I don't usually write reviews, but I made an exception for this one. My friend and I decid","useful":3,"cool":0},"MuE5yzCz1BX415bsCJbWSg":{"text":"Worst restaurant experience in New Orleans. Just went there 2.5 hours ago, and it took tha","useful":1,"cool":0},"m01htH90qSlHfFTNSDdcfA":{"text":"The French quarter of New Orleans is always busy year round. Not a ton of that business is","useful":1,"cool":1},"SmvegkU1VhhQYqO18MBwmg":{"text":"Food was good but over priced. But than again you are in New Orleans. The service was good","useful":0,"cool":0},"V9m7htH6WDeRatsUSt4qiQ":{"text":"The owner is sooo nice! We had the fried chicken...it came boneless with gravy on top of b","useful":0,"cool":0},"2Qx_wC82Bdq3oa32tcPkJg":{"text":"Great little out of the way place for breakfast, nothing earth shattering but good, solid ","useful":0,"cool":0},"LZRnhMRw-NLU4MdIA61j0g":{"text":"Ordered the beans as a side which cost $6.50... Over priced! And the flavor was plain and ","useful":1,"cool":1},"yTyPSDJKy3Qz25OOseKugQ":{"text":"For all the hype, this place ended up being terrible. Our server forgot half our order, ha","useful":2,"cool":1},"2sgrY5AotYl1-kfGZxU4MA":{"text":"Service moved at a glacial pace at this place. Sorry, I really wanted to like it and the s","useful":1,"cool":0},"RTWAwN12Avsru5JYZN5J4w":{"text":"well just walked past there today and saw that Cafe Beignet took it over... guess Ramsey's","useful":0,"cool":0},"SsZyV0EG7llHbSKnQ7CRYQ":{"text":"They wouldnt let us sit outside. Explained to the hostess that we have a pet. Chose this r","useful":7,"cool":0},"77I--vz1eN6epz4ozbfcXw":{"text":"I debated between 3 and 4 stars. The food was great, the servers were very nice, and it's ","useful":1,"cool":0},"wM6M6fD0FhPMpsNwtpLj-Q":{"text":"Whoa. Talk about deceiving appearances. Looking at the restaurant gives one the sense of a","useful":0,"cool":0},"LIMnK2_Uf1k05qOA2Q1jDQ":{"text":"Ate 3 Times here -- delicious food. \nLovely service. Great coffee. \nA stone's throw from P","useful":3,"cool":0},"_vY4EDg4zIjoHIZ1_Jd8xg":{"text":"Up early and greeted as soon as we walked a few steps in.  Offered a seat outside under th","useful":0,"cool":0},"TTom77tzR9HBdeslM6obIw":{"text":"10 years ago I thought this place had the best breakfast in New Orleans.\n\nAfter my recent ","useful":2,"cool":0},"eAQ79jIxbmZwafU9tzg5-w":{"text":"Nothing spectacular.  It was recent featured on \"Diners, Drive-ins, and Dives\" so that cau","useful":2,"cool":0},"ikX0fLctCptStkUCnzKYnA":{"text":"this was my favorite breakfast place. the other night i saw that Gordon Ramsey was giving ","useful":0,"cool":0},"S5U5rYFIpXCDk-wek6ZfXA":{"text":"This restaurant had THE WORST SERVICE. It took 15 minutes to get coffee. another full 10 m","useful":0,"cool":0},"lOg-CWAu7l7o-IKuKlT3kw":{"text":"Okay so just before you read this I literally had a Bloody Mary,  but it was enough for a ","useful":7,"cool":1},"QhuqYVHNc0eG1ncbQ67Srg":{"text":"Unlike other reviews I found the service to be fast, friendly and sincere. Stopped in at 9","useful":0,"cool":0},"a3xQA9bL3YxBVHmE8-7AaA":{"text":"Crap food, crap service, crap 18% automatic gratuity for a group of 2. Absolutely not wort","useful":6,"cool":1},"IdE5oqAaSd6C86EOkt_6Mg":{"text":"So, there are 2 different experiences when you come to this place.. first impression: the ","useful":0,"cool":0},"G1AERPUaE85w0ZRKn_W08Q":{"text":"This was such an amazing breakfast.  It reminded me of a trip I made to Italy.  Quant envi","useful":3,"cool":0},"ngZdJa60IcfnfHYKAmlBWw":{"text":"The service is awful. My girlfriend and I were seated right away only to watch 3 varying s","useful":0,"cool":0},"nuQ6qoso694xYThlTmLZ9g":{"text":"Ate here a few years ago and it was very good. My first introduction to poached eggs. Nice","useful":0,"cool":0},"wSsP7x-MMSNov0KuVrcitg":{"text":"What a wonderful place!!!  Breakfast and dinner in one day plus breakfast the next day... ","useful":0,"cool":0},"8xdv16dWM_nSo7N7jjpXyg":{"text":"Good food the \"Soul Omelette\" is well prepared and when served with Grits the breakfast wa","useful":2,"cool":2},"ELFaCWBSY1Jw9lEJCS1rgA":{"text":"Came here on a food tour. Their gumbo was very good. The broth was delicious and the shrim","useful":1,"cool":1},"3SLTW9k7nWy0VFxYCFkiHQ":{"text":"I ate lunch at The Old Coffee Pot in New Orleans, LA on 4/15/2015.  It was my 1st  time th","useful":1,"cool":1},"fg_9QgXnnT0VFPWdlsPolw":{"text":"Such a cute place and amazing food here. The reason for four stars is as one of the review","useful":0,"cool":1},"QXlVLUzGVvz3j8LKczqstw":{"text":"Seriously. Please don't go here just because it was featured on a few tv shows or because ","useful":18,"cool":0},"09nNFiPyi54TQp8eJaJnjg":{"text":"it was delicious make sure u eat at this place!\nfood was delish! will definitely be coming","useful":0,"cool":0},"aCd2GUoyNy6WATozfqnRZw":{"text":"Waited in a substantial line to get in and my expectations were pretty high. Unfortunately","useful":3,"cool":0},"ZuidapoGqQiSe7FKuYV3IA":{"text":"Enjoyed breakfast in this intimate restaurant, but saw they have a beautiful covered and h","useful":2,"cool":1},"wdyzdkDsp8ul35lJhRUmeQ":{"text":"Such a great pity ! We went for breakfast after walking past and thinking \"what a lovely l","useful":0,"cool":0},"zZ6w-ookfccbp9VVkvmmMA":{"text":"I really want to give this place more stars, I really do. The problem is that we had to wa","useful":1,"cool":1},"czuq2YGOKrfJzStqnZospQ":{"text":"This place has been a favorite of mine for over 5 years. Living in the French Quarter you ","useful":0,"cool":0},"_b3_cz_FMRSYLkXF87tO4Q":{"text":"THIS PLACE IS THE SH*T!\n\nFood comes immediately, service is excellent, and the food is mag","useful":3,"cool":2},"GuGlWA0sgHyNN8dSpj6AMQ":{"text":"I don't know how the food is there but the waiter was extremely rude to me about my servic","useful":4,"cool":0},"It2R6E9NKBaEvVZB1GNo3A":{"text":"I ordered delivery. I was dumbfounded when it arrived.\n\nThe shrimp po-boy has no dressing ","useful":4,"cool":0},"LFG4s0UHBREfEHahO4xpcQ":{"text":"While doing the French Quarter thing, we stopped to check out the menu at the window and t","useful":1,"cool":0},"FqCBGuSE5GHOrTNQ4ACxhA":{"text":"Great restaurant and great location! The atmosphere was super chill and relaxing when I we","useful":0,"cool":0},"_tdTe7nm-F9cAn1aNjunog":{"text":"The Old Coffee Pot as a name should have tipped me off that the place, like its namesake, ","useful":14,"cool":0},"32bExYyZfI9F3Ac5TLJ6fg":{"text":"Everything in NOLA is delicious, but when you want a traditional american breakfast, that ","useful":1,"cool":1},"WZ4alJuD7pmpb7dPtyfyEw":{"text":"I loved this spot when I visited it years ago, especially with my fiancé. I'm very sad to ","useful":0,"cool":0},"apwCiO0_wB43eRqMw1ulfA":{"text":"Well what can I say... SMH. \n\nTwo years ago I came here and totally enjoyed my food.... My","useful":1,"cool":2},"Bk5udP8hvoDaGuVn6mr4nw":{"text":"So we met a lovely lady on a night at Johnny White's sports bar and she said she works at ","useful":2,"cool":0},"WepZRwbxFyA4zWokqfGbxw":{"text":"This was quite possibly the WORST service that I've ever had at a restaurant. I would reco","useful":2,"cool":1},"Q7yfRWddlrargdh6ZQ8oWw":{"text":"I've seen reviews that say this place is mediocre.  I disagree!! We went next-door to Pat ","useful":0,"cool":0},"eU43Y1FVc3ao_JKGdu56sw":{"text":"While I'm haven't eaten yet.  The menu is fairly limited.  But worse the older lady waitre","useful":12,"cool":0},"ZZGWrx4ABlWaPzEFYHfE2A":{"text":"This is essentially a tale of two visits. My girlfriend and 1st dined at The Old Coffee Po","useful":3,"cool":1},"dnU6ouL4EyIIlk4CuA2mnw":{"text":"I saw this place on Diners, Drive-Ins and Dives and swore that I would eat there should I ","useful":5,"cool":1},"UZhxh9F3QjaC3L3veggZQw":{"text":"Anywhere else I'd give this a 3 star but there's just SO MANY  great places in NOLA that I","useful":0,"cool":0},"PyN13XefgRyZ1G8Xu83yPQ":{"text":"I could sum up my experience at The Old Coffee Pot with one sentence: Dang tasty food with","useful":2,"cool":0},"Ap5W7tv1LCPMIFlioHwuxQ":{"text":"TERRIBLE!!! Don't waste your time with a Guy Fieri recommendation. This place was the wors","useful":4,"cool":1},"YvsiLARoQXbqw0y5IxxyNQ":{"text":"Had a wonderful lunch with my family. Great shrimp and grits! Wonderful seafood plate. Bre","useful":0,"cool":0},"yN925cNHDlLGYQyJNhbaiw":{"text":"This place came highly recommended to us, however we were a tad disappointed. I got the ch","useful":4,"cool":1},"JdeAWO3Rw_qF2W9nFOz_XA":{"text":"Very friendly service; we were seated quickly and food service. great outdoor seating spac","useful":0,"cool":1},"19xNTr93DJERWNxmqk9Fnw":{"text":"I asked the locals at my hotel when I was staying in NOLA where the ultimate best gumbo/ja","useful":3,"cool":1},"FHCSpdf-09HOOPODQL4azA":{"text":"One of the best breakfasts I've had in a long time. I got the Cala cakes, which were treme","useful":0,"cool":0},"qTdKeMp5VIngSCkx5AlLMg":{"text":"Read Jill's review. She nailed it! At least with the description of the service. (However,","useful":12,"cool":2},"-1zrbvd01zNp-4DOUwlPbQ":{"text":"This is a local place recommended by a local. The bathrooms were gross. The staff was plea","useful":0,"cool":0},"yrhBxwWQoKgd9xigOQi1ag":{"text":"Had the jambalaya and the roasted vegetable platter. Jambalaya was very good, but a little","useful":0,"cool":0},"udNaEHXmKGDgFAZd1gCT_A":{"text":"I ended up ordering red beans and rice from this place b/c the GUMBO shop, 1 block away di","useful":0,"cool":0},"N4MY9YPouJzCUznpiVF8Ug":{"text":"Made reservations for brunch at this place with a large party before the airing of 24 Hour","useful":46,"cool":4},"DUiwO2ij-r4RjSfXXC2oIg":{"text":"I should have known that when I walked into the place at 8pm and there was only one other ","useful":1,"cool":0},"FXD12sNKN4tKhKw7izGGjw":{"text":"Arrived at 7:30. It's 10:00 pm and we still can't get the check. Food was not even mediocr","useful":1,"cool":0},"DBOdoX3MFETCNoURfFeIpQ":{"text":"We arrived at 6 pm on January 2nd, 2011. We (2) were seated at a small uncomfortable table","useful":1,"cool":0},"Hgb8RRc4183i4W5VCKc9pw":{"text":"Absolutely the WORST service I have ever had. All the waiters bicker with each other and i","useful":3,"cool":1},"sq1YNyuED7Zl5o-RvWphZQ":{"text":"What was I thinking? I should have known better. My gut tells me whenever a restaurant is ","useful":3,"cool":1},"s-mue-auqYiiSTzu63d44g":{"text":"Popped in for lunch on Wednesday. Went in hungry and adventurous and came out hungry and d","useful":4,"cool":1},"uPUorzq-HRsmJLBTnjhMzA":{"text":"Had breakfast here on a Saturday morning with no wait! Food was good! Service was decent.","useful":0,"cool":1},"UCKvvLmcv7AvUUzfSw0xxA":{"text":"A group of my friends and I stopped in here minutes before our Haunted Tour was set to beg","useful":3,"cool":1},"vBP0EIpvPocw_-LTp5Cu6w":{"text":"Um. Blech. That's almost all I have to say. This place is disgusting. The food came out cr","useful":3,"cool":1},"_hBLBFHqRBPQpYdv7iB38A":{"text":"I believe this is the last remaining spot in the French Quarter that regularly serves cala","useful":17,"cool":12},"-1-0cb9yEZWMHA6xOjYk5w":{"text":"How do I even describe my experience at The Old Coffee Pot Restaurant?\n\nIf I'd known this ","useful":9,"cool":3},"QnR_rvey398Ii--z56DWHg":{"text":"First restaurant we went to upon our arrival in NOLA! We were so excited for our trip but ","useful":11,"cool":0},"lSnyL1kjMl6sC4ZIHd1zww":{"text":"We didn't end up getting our food because the service was awfully slow. The place wasn't e","useful":4,"cool":1},"JwgWrXveq3ebsxF1Av5f2Q":{"text":"I loved this place for the breakfast food! I ordered the Jonathan and it was the best brea","useful":0,"cool":0},"iRPkiVRNUglJb1CkNl3bkA":{"text":"If you're looking for a standard but not spectacular breakfast, The Old Coffee Pot will do","useful":0,"cool":0},"WHvW_RicDrRG5IWTVS2dXg":{"text":"I rarely give poor reviews, at least this poor, but this place was probably the worse plac","useful":3,"cool":1},"AZDAMONllK6c-jnzlBwXOw":{"text":"We dine here often when we're in town, and have always left happy. The breakfast here is g","useful":1,"cool":1},"Ri9EStsHCEmB0ME-BXh-Vw":{"text":"Great spot in the Quarter for breakfast. The atmosphere was great. We were told about this","useful":0,"cool":0},"4B7PrQ4GmHp5TTUiJxQyXw":{"text":"delicious breakfast with a good cup of coffee. Be sure to try their Plantation Breakfast p","useful":0,"cool":0},"BzDrTjwJtIAewa9UeM4eCw":{"text":"Good food, service needs work. That seems to be the theme of other reviews too.\n\nWe went i","useful":0,"cool":0},"6xVhgd6LWDS9UFWFPOc_QA":{"text":"My mom and I visited New Orleans and picked this place for breakfast off of the Yelp revie","useful":0,"cool":0},"FzDzMbyaWDECgKXH7iT-mg":{"text":"Poor service.  We had something floating in our glass of water. Finally flagged down the w","useful":1,"cool":1},"0bTus5-4JD2nFh7dnYA3bg":{"text":"My boyfriend and I had a terrible experience here on March 16th, 2016.  We were led here b","useful":8,"cool":1},"NHc6e5iEGyuu0wJUqCtXkA":{"text":"Gentleman standing outside recommended this place and he was right. Bloody Mary was perfec","useful":0,"cool":0},"sknh5AKDBk6cb5sOVzn_4w":{"text":"Worst Service In The French Quarter. If you don't mind waiting 15 minutes to have your ord","useful":8,"cool":1},"dvUMCdwI1numsax5WAeqkw":{"text":"We loved the original decor, atmosphere, and the southern vernacular. The comfort food tas","useful":0,"cool":0},"6NSe8KHJ_DHJ-41eLDrp6Q":{"text":"@Eating.Drinking:\n\n\"The Best Breakfast in the French Quarter.\" This is exactly what @oldco","useful":2,"cool":2},"cZIqs-WmSm_GfyOpaJY9QQ":{"text":"I wouldn't go back. The food was fine, but Elizabeth's and other brunch places are just wa","useful":3,"cool":0},"bajcr4Yn5LlB6mHHw3d_pg":{"text":"This place is a relatively undiscovered gem. I've been here many times over the past 30 ye","useful":0,"cool":0},"GjfavD_j9PCY_pOW0vdOew":{"text":"Seafood Gumbo was totally worth it, so much there was nothing left (close to licking the b","useful":0,"cool":1},"G3Oza2EKVSOBaaWZguE5ww":{"text":"This was pretty bad. We first walked in and saw it was cash only. That's fine they had an ","useful":0,"cool":0},"Fisi9sORjZ7OqfCUNmF0SA":{"text":"I went for breakfast.. had the soul food omelette & potatoes.  I didnt have to use any con","useful":0,"cool":0},"wow7cPNui0jV5ZaPW2AF4w":{"text":"Was in NOLA for New Years Eve, came to this place for dinner on a Saturday.  We called ahe","useful":0,"cool":0},"VY2POlnaoRNU01T0wKBvFA":{"text":"Was on a walking tour and asked to use the bathroom. Lady said \"nope you gotta order somet","useful":1,"cool":1},"PsdmvPsrxgcO5OEgz6Q63w":{"text":"Amazing food and quaint modern decor.  What a gem!  Fried chicken is tasty and leaves you ","useful":0,"cool":0},"Vbw_UU5_tHsh6inItEynbQ":{"text":"This was another stop on our food tour. The restaurant was actually closed for the day but","useful":0,"cool":1},"I-3cOS_JxHLLlpJQ_dSlOA":{"text":"I went for breakfast.. had the soul food omelette & potatoes.  I didnt have to use any con","useful":1,"cool":0},"6k0NkNdB9CeeqU5QOZ1WLQ":{"text":"I needed a quaint, homecooked meal off the beaten path and away from the chaos of Bourbon ","useful":0,"cool":0}}