{"7hIcjJrDzrsmkBX-HK9BTw":{"text":"I needed an oil change and don't have a regular oil change place since I recently moved to","useful":2,"cool":0},"XL5ddo5yjc8Gya8lyfruoA":{"text":"I was past due for an oil change and I live just a few blocks away from this location so I","useful":4,"cool":0},"mIJJYrae9eCSucTqdsGAgg":{"text":"Thanks guys! Everytime I visit you all you treat me Caddy truck like a princess! xoxo","useful":0,"cool":1},"VSG1xXSApPrA2LnUjX8ROA":{"text":"Oil change was quick and easy here! The staff were kind and entertaining, and even offered","useful":1,"cool":1},"zp3h9Jrvb7m_LzLd3Vjy2Q":{"text":"very friendly professional service. I didn't get pressured into extra servicesike most pla","useful":1,"cool":0},"iBH1ULnchB_jzFmnWOSgqA":{"text":"Great service and very fast. Always easy. They also gave me a complimentary bottle of cold","useful":1,"cool":0},"j04cGEJxr6liI6gbsSjOOg":{"text":"Let me start by saying that this place actually lived up to their name. It only took about","useful":6,"cool":2},"KEBCw0YLty5Ck6mLq3T1fg":{"text":"These gentlemen were great. Fast, informative and to the point with no fluff or haggling. ","useful":0,"cool":0},"coGhyMYOuZfUCfgYoLkahQ":{"text":"nicest workers and best service. a little pricey but you are paying for convenience. you d","useful":1,"cool":1},"xdFifYsYxicmzv-QZk4vCQ":{"text":"Got an oil change. He left the gasket on from the old oil filter....aka there were two gas","useful":0,"cool":1},"LYIJNjclywg4jQAOpcYw6Q":{"text":"They scan your VIN number and told me that I would have to pay an extra $5 for the oil fil","useful":0,"cool":0},"5nbs1STQee9bKmfuT9M6kQ":{"text":"Went last month to get a full synthetic oil change as that is what my vehicle calls for. W","useful":0,"cool":0},"pCETrLTvUsHhxOjqCVv75Q":{"text":"Dwight was wonderful during my quick oil change- fast and friendly service that I would de","useful":0,"cool":0},"tOdgnWD23I8eNsEA0RVVqQ":{"text":"Great service today! Making a 9 hour drive tomorrow and needed my oil changed. Dwight was ","useful":0,"cool":0},"7htoPrlDkUzOHqTI1vCPOw":{"text":"This is not the first, or last time I've stopped at this place. Service has always been ex","useful":0,"cool":0},"7K53x5lRJMdXWtEk9bckQA":{"text":"Very professional and efficient service. My host was very knowledgeable of all options and","useful":0,"cool":0},"xlO7-dg7Cq7c6EKxRkyyLg":{"text":"Wow!! These guys were awesome! So prompt and super efficient! Bryce was friendly and very ","useful":0,"cool":0},"kzpeiL3o8qkUmqifTUYaZQ":{"text":"Super-slow and unprofessional... Maybe because I'm from the Midwest and 5-minute oil chang","useful":0,"cool":1},"wmqLOUdtYjmtN9XVNNEO4w":{"text":"Great service from Dwight and everyone at Take 5! Quick, clean and courteous. What else yo","useful":2,"cool":1},"5HMWVTvtJcv86nqmLHvsWQ":{"text":"Awesome service. Dwight is always incredibly helpful whenever I stop by. Can't believe how","useful":0,"cool":0},"JwynpPAh8hRoK6R65P3eoQ":{"text":"My car was in desperate need for an oil change. I saw this place as I was driving and it l","useful":0,"cool":0},"Ygt80_iuQhQ5cNtmxM4qCQ":{"text":"Great service. Very speedy. They gave me bottled water cause it's hot af outchea. They giv","useful":0,"cool":0},"v7MHgIicyqTxKesPv-98CQ":{"text":"After spending $150 you would think that the could manage the little things as well. I spe","useful":2,"cool":1},"jUuTc257ogrdpAYd8yl71A":{"text":"Went to the five minute oil change on Carrollton today. Did not have big expectations, and","useful":0,"cool":0},"lTFB5ylvVJBIr3HR1qQYxA":{"text":"Go to this Take 5 on a Sunday; it's quite deserted and the guys are so efficient and frien","useful":0,"cool":0},"u-hTWcklTGEL5c97AFGgVA":{"text":"I had a great experience. Was there for about 15 minutes. ( don't now why they call it 5 m","useful":0,"cool":0},"eScXtX59327o3B9Q-v_f_A":{"text":"These guys aren't too friendly, but at least they don't care enough to try and sell you on","useful":4,"cool":3},"mTpP9GAzVbQzqDWEkJTwwQ":{"text":"This is my first yelp review ever! But Devin this morning was so kind along with everyone ","useful":0,"cool":0},"Ljqy-dzf2uZYVN1616KRrg":{"text":"Dear people of the world: where are these cheaper oil change places that you guys seem to ","useful":5,"cool":3},"WegYrYldn7nSl2HSu96tDQ":{"text":"Service was great and very friendly. Dwight was especially helpful with getting us everyth","useful":2,"cool":1},"pkjCzZ9smsgWxNQDtQdc5g":{"text":"Friendly enough, and this time they didn't try to get me to buy a new air filter. My prima","useful":1,"cool":0},"oKnGPITGzHHzR4B5XmdydQ":{"text":"My girlfriend needed to get an oil change and we went to the place that was most convenien","useful":0,"cool":0},"LfmduOSciPcC8nHhueUlBg":{"text":"Great and quick service. Tried to up sell but weren't pushy at all. Incredibly nice servic","useful":0,"cool":0},"W1r9C68srkISLmePqLQ5NQ":{"text":"The staff is super polite, very knowledgeable, and does NOT try to upsell unless it is app","useful":2,"cool":1},"F3nZ-Zu58XQ7kTCTmB3qag":{"text":"Awesome service. Quick and polite. They even offered coupons! I have never had this easy o","useful":0,"cool":0},"UWUFxTLjgjeXco8dVBcdZQ":{"text":"Update: Unbelievable!!!! My low tire had less than 10lb of pressure! These guys actually d","useful":2,"cool":1},"gmhU_yNAeDTkrfX8yAj-bQ":{"text":"I had my oil changed here and it was the most professional, friendly and fast service that","useful":0,"cool":0},"EBCulS83NDpHe09Ejsdilw":{"text":"The puzzle is complete.  After decades of blight on this last of the four commercial corne","useful":5,"cool":1},"j4HMfZfbcv4BRuwohCQf5g":{"text":"the best oil change experience. friendly employees, quick turn around time, fair prices (t","useful":1,"cool":0},"4FnKj2aE057MJlK-z3wh5Q":{"text":"Just left this place and went down the street to a different place. There were three guys ","useful":0,"cool":0},"_igRbuyGYAL9BU84T6xkHA":{"text":"So i arrived and there was three cars under being worked on.. 1 car following behind each ","useful":0,"cool":1},"6YI3qoli0O0fUcYQ7f_V4w":{"text":"The staff was very friendly and professional. Great service. You stay in your car when the","useful":0,"cool":0},"ysgokPjRTZ6Thdlv6ltisQ":{"text":"Amazing customer service! Thank you! Great communication and offers without pushing produc","useful":0,"cool":0},"1utv6Nvb72XjrR_XoFvyrA":{"text":"I pulled in with a \" change engine oil\" light... \nI pulled out with a \"change engine oil\" ","useful":0,"cool":2},"aAkogNRLItupOqpJKs8gtg":{"text":"Wow, the other guy's review was mainly about how much he likes the building and not about ","useful":9,"cool":1},"mM1oX7oh8-hYud3xZqe9VQ":{"text":"Always have great service when I come here! Super nice people and a quick oil change. And ","useful":0,"cool":0},"Js3UKpNnae_r9dGFRtyEmw":{"text":"Super fast service. Very professional staff . My car always leaves much happier than it ca","useful":0,"cool":0},"4W9vI-kpCbhfCSqmVPWdLA":{"text":"5 Minute Oil Change is more expensive than most oil change places but the convenience of b","useful":3,"cool":0},"lUfvCfwSWhKLlhI9-ZxqMw":{"text":"Quick, friendly, competent service, reasonable price for the speed, and a free cup of Barq","useful":1,"cool":0},"7N-a0POUqcbRDIThM1mnrg":{"text":"Literally from start to finish, 13 minutes. Amazingly fast service. Topped off everything ","useful":0,"cool":0},"CnThLI_Nw8_SbJbAPRzWlQ":{"text":"I've been here multiple times and the service is always excellent. They are always extreme","useful":0,"cool":0},"I8CRbN3nMXPJeJI32wK3xw":{"text":"This is the fastest place in town, hands down. Plus they are always super friendly and don","useful":0,"cool":0},"me48cukvUgDqYpfEwq1wxw":{"text":"Horrible! Five minutes? Try 35 and a month later my car had no oil in it - when I had to t","useful":3,"cool":0},"C7uRCIzfrcjZ-94Bah1bwA":{"text":"Another very pleasant experience at this Take 5! I've been getting my oil changed here exc","useful":5,"cool":2},"F_fH4rC6KC-V6m3oObiI5Q":{"text":"Have used this business twice and both visits were great. They are fast, courteous, and pr","useful":1,"cool":0},"R-_k4KYXzjgF7CS9xbVNAg":{"text":"Came here to get my oil changed and loved my experience! They had me stay in the car as th","useful":0,"cool":0},"Znr189Ck0P51YTnUl6py_w":{"text":"I like this place. They have good attitudes and take care of business. What more can you w","useful":0,"cool":0},"CNtfhEqjXphQPQh-IekNyw":{"text":"This place is the BEST! Quick, efficient, everything you need. And the people are wonderfu","useful":0,"cool":0},"PVshzY5LIG8clO_WtALhsA":{"text":"This was probably the fastest service I've ever had. I arrived just after the shop opened,","useful":4,"cool":2},"oZjvbav_0OHN_FMqresMgQ":{"text":"This was my 5th or 6th visit and I had previous been happy with the service.  My unpleasan","useful":1,"cool":0},"XKksFYNWbFISgWvTUV4GnQ":{"text":"Unacceptable. Came here this morning at 7 for an oil change. Because that's what time it s","useful":2,"cool":0},"I61npESOoL19qkxQ5YAg-Q":{"text":"I've been going here for three years now and every visit has been top notch. They have all","useful":0,"cool":0},"yKjgY0ffyy1nBG-ougyZtg":{"text":"I never write reviews but these guys were just so nice. A little more expensive than other","useful":0,"cool":0},"apvKfJc7gVCDypfXyop9NQ":{"text":"This place is great- the customer service is the best I've received getting an oil change.","useful":0,"cool":1},"UqBe8RgWQqGlhh5CdATgpw":{"text":"Pulled into take 5 oil change at 9:03. It is now 9:44 and I'm still parked waiting to be s","useful":0,"cool":0},"vq1t4CbP8TuqBI6ACXSRRA":{"text":"Not recommended. Owner's manual for my vehicle states correct oil is 5W-30 with 5 quart ca","useful":1,"cool":0},"igg6V-aWaPu2mBJkPR7jvA":{"text":"I needed an oil change really quickly and conveniently and most places are not open past 5","useful":0,"cool":0},"JDGHaqtPojyWu1d0hkKqxA":{"text":"I pulled up with a flat tire and just asked them if I could put some air in before my long","useful":2,"cool":2},"esjORgDJCIcKK_sqmnCcpw":{"text":"So INCREDIBLY slow.  Be prepared for a 5 minute oil to take an hour.\nI had to add more tex","useful":0,"cool":0},"pfKhuIrIdA7o4m1TiU5K7w":{"text":"This is my second time coming to this location and I absolutely love it. Every single empl","useful":0,"cool":0},"g5hLL6iR1I1f2NCIWgTzJw":{"text":"Oh my Lord this is the slowest place ever. Pulled in 40 minutes ago. Still waiting. Trappe","useful":0,"cool":0},"v131X32aH5lLW0FnF_N-Bw":{"text":"Service was very fast and efficient, and customer service was friendly and helpful.  I'm d","useful":0,"cool":0},"jhEjB6CpnR0ZevXq_DIbMQ":{"text":"If you want a oil change that is fast, real fast, expensive , real expensive (89.00) for s","useful":1,"cool":0},"a2Ok55ZyzyqgWXRyRFWTcA":{"text":"Had to wait over an hour and a half just for an oil change. I was disappointed with the wa","useful":0,"cool":0},"_YeKWzKPetx78Y91JSnZjQ":{"text":"I wish I could give them no stars. Got an oil change here before leaving on a road trip. T","useful":0,"cool":0},"E-ccTS9FO5x4yo4ypom8CQ":{"text":"We had issues with our services with this place. We left a bad review due to the inconveni","useful":1,"cool":0},"wK21gcQvJ9nG_ncVJpuyIg":{"text":"Came in because I get my oil changed here and noticed my skid plate was low and dragging o","useful":0,"cool":1},"VgjHyEgBtyloLArZYbJcAg":{"text":"Excellent service!!! So thoughtful and nice. \nIt was my daughter's birthday, they noticed ","useful":0,"cool":0},"bhz0SgPtXV8rVcyV0WoQDA":{"text":"Yall honestly, I've never had a bad time here. Sure, there's a wait. Sure an oil change is","useful":0,"cool":0},"yOelsVyjDzi9Av3muln3Ww":{"text":"We took one of our company trucks to this location to have our oil changed. Our plug was s","useful":0,"cool":0},"nLPOrLEh6CsVHqOWSOb7KQ":{"text":"I mistakenly went here on a Saturday, so they were extremely busy. I was super aggravated ","useful":0,"cool":0},"6-IPovu7TaEQO-IW2PVQOg":{"text":"This was my first time using a drive thru oil change service. I honestly didn't know they ","useful":3,"cool":2},"1TTSi5IW8L2MnG3ly269tg":{"text":"My husband just had the most wonderful experience here! Smooth sailing, great management, ","useful":3,"cool":0},"_dBpjqxhKbtfe6S221pkSg":{"text":"I need an oil change in uptown, so first things first, hit up the Yelp app.  Take 5 was in","useful":4,"cool":1},"DOcam3Cj-UjUog5boga1ig":{"text":"Here's the thing, I understand that we're in a pandemic, but if you choose to change your ","useful":0,"cool":0},"ueIixNt2z61PklEqrlHmig":{"text":"If you are fine with having parts STOLEN off your car, this is the place for you. I took m","useful":2,"cool":0},"hv6hrTwoEFVCgi5ftihX0w":{"text":"Great service,\n\nTook a little long about an hour with 3 cars in front of me.\n\nBut Austin w","useful":0,"cool":0},"tblYsgBLspDNFBk4KwYe5w":{"text":"Had to wait over an hour and a half just for an oil change. The oil change was about 30 mi","useful":0,"cool":0},"l7nboixfXDbeCFtBE7lraA":{"text":"Brandon, Kim, and Levi provided excellent service to my old Honda CR-V, and even cleaned m","useful":1,"cool":0},"rBY7m-3io6ubfp_u2hT65g":{"text":"They changed the oil on my Audi Q7 TDI.  They had to ask me how many quarts to use...I tol","useful":2,"cool":0},"oRPHccwXusDrYndWcuoPxw":{"text":"Staff was super friendly and helpful. I had a check engine light on which they graciously ","useful":0,"cool":0},"3gyaGpV3nXBYyCtRDwVxKw":{"text":"Great service, quick, don't try to over sell you things. And bottled water while you wait!","useful":3,"cool":3},"igVBn1jgT2Gi2yll8e8vWQ":{"text":"I have been going to this Take Five for several years. I love the convenience and great se","useful":0,"cool":0},"Vt19JT-3US33REQH05R4rw":{"text":"This is easily the best place to get your oil changed. They're obviously fast as the name ","useful":0,"cool":0},"GUHPMoPLsh6i5SWmPawr_A":{"text":"I took my car in for an oil change this week and as part of the service they offered to ad","useful":1,"cool":0},"087Gd9Rx2HcDK92I5uRh3g":{"text":"First, I was pleasantly surprised at how little wait time there was for their various serv","useful":0,"cool":0},"3PIFmXE6Z19r5u1A1-59-A":{"text":"Super quick service, everyone is so friendly and helpful! I love that it's a drive through","useful":0,"cool":0},"KKqYZab3OwoboGkhqnfBGQ":{"text":"I took my car here and they were pretty backed up which was not a problem. But then after ","useful":1,"cool":0},"P_KV-KkjMOk7ADZXxkqKtQ":{"text":"Quick, easy and affordable! The staff was wonderful. One employee, Stedman, stood out. Abs","useful":1,"cool":1},"PIw1amA-x2czpUfUXFLM7w":{"text":"It's been 8 months and this Take 5 has yet to answer my emails. Ended up wasting my $80. R","useful":0,"cool":0},"PQaf2WKJKK4g3JK3WPhF7w":{"text":"I came in for an oil change today and had awesome service. The line was super long, and th","useful":1,"cool":1},"dUPIGwY2drte5KMCTNho8w":{"text":"Austin was great!!\nThe crew was wonderful and Austin really took the time to walk me throu","useful":0,"cool":0},"XkldFbbSzdA5Ue5wRYOeyg":{"text":"Take 5 is the place to go if you need your oil changed. \nThey're quick, will help you deci","useful":1,"cool":0},"NPSm6kuLPQFXutjLdPRNIw":{"text":"I usually go here for an oil change, but the last time I went I guess they thought they co","useful":0,"cool":0},"lGeOwwioYPg4galr7d0LVg":{"text":"Waited out front for 25min, and nobody came out to greet me. They took 2 cars through one ","useful":2,"cool":0}}