{"-M6y-yFPKVouD2NNOKcT_w":{"text":"Very good breakfast. Within walking distance of our hotel. Had the crepes with fruit. Woul","useful":0,"cool":0},"4XibNqBQSFbBQ2hvXBUbEg":{"text":"Food was great!!!! I had the crab cake Benedict and it was delicious! Great service and sm","useful":0,"cool":0},"DjZ6zc-kLXw1sOSVV_jwPw":{"text":"Breakfast was above average and reasonably priced, especially considering the options avai","useful":0,"cool":0},"v9e5CP88B5n9aH2X_vbuLw":{"text":"It was great.  I had crab Benedict. Just the kind of place i was looking for. Paud parking","useful":0,"cool":0},"SJfOQSSWfRteW9LcOuCCSQ":{"text":"Great omelets and grits. We try to stop here when in the area for breakfast. Pretty yummy ","useful":0,"cool":0},"GRD1OrZYbmAUYMmSlEsqBQ":{"text":"This place is situated inside of a building, not easily seen from the street. Food is good","useful":0,"cool":0},"pEoBDYyhvWcMZ4-sCPNUxg":{"text":"I'm sure the food is great - it's too bad I didn't have a chance to try it. The service wa","useful":1,"cool":1},"TiYL1SVTH1iQRX7sta5jkA":{"text":"Great breakfast! Service was wonderful and met one of the \"chicks\". She was delightful to ","useful":0,"cool":0},"mEPiV8Sl1inK9OLoj1u_0g":{"text":"Staying around the convention center has it perks, unfortunately trying to find a good bit","useful":1,"cool":0},"4ZvuaTwRfSWnHxfYT412Cg":{"text":"Usually packed with conference/event attendees from the nearby Convention Center. Totally ","useful":0,"cool":0},"02Ui0QH1ovE-f3XV_RhSHg":{"text":"Glad we found this place. Great breakfast. Fresh squeezed OJ, fresh juiced smoothie. Fast ","useful":0,"cool":0},"GchOdBuIVIrUv1_sUteJWw":{"text":"I got the shrimp and grits!! Omg so amazing!! I was so full and yet I couldn't stop eating","useful":0,"cool":0},"Um6bDrNJkRVoy8bMMwYx3g":{"text":"Great breakfast spot. The goat cheese omelette and hatchery sandwich are delicious. Conven","useful":1,"cool":0},"zpWhBak9ux8A42K7470etQ":{"text":"I have been to this restaurant at least five times and have never been disappointed. They ","useful":0,"cool":0},"qiEVj0f2uPB-Y1E2REUSNA":{"text":"Nice hole in the wall brunch place with great specials! I'd recommend the Barbecue Shrimp ","useful":0,"cool":0},"bwFgsSQqXRYv-g5To188xw":{"text":"Cute interior/creative space. The location was a little off convention center Blvd hidden ","useful":1,"cool":2},"fQkH3STY3pMO_5kYmvxkXQ":{"text":"Food was great! I visited with my mother and sister and we all got omelettes, different on","useful":0,"cool":0},"NMcA43JO3zXKIWc3ICrT1Q":{"text":"Called in an order for a large group with a variety of requests; was not dissappointed. Ev","useful":0,"cool":0},"xfG3MLFJpEeS_GqX36yGmw":{"text":"Food was good overall. Not sure why we had to wait 30 minutes till we got it. Took way to ","useful":0,"cool":0},"8ZKkxoxjuZDIQQKeBsDBfA":{"text":"Excellent! The crab cakes benedict are outstanding, the best benedict I have had.  Highly ","useful":0,"cool":0},"aouuO25k5W1xCSosnbm1rA":{"text":"Just had an excellent lunch here. I got the veggie sandwich. It comes with small green sal","useful":1,"cool":0},"jP8A3-knvGera7gkIhcHFg":{"text":"A quaint & warm atmosphere, friendly servers and awesome food.  Echoing the previous revie","useful":0,"cool":0},"6hdNuZoJN1jhpfG3bBUT8A":{"text":"We had the Crunchy French Toast and the Barn Sandwich and both were very delicious. Try a ","useful":0,"cool":0},"pmUVvZSkWHTFlNsnR6YX2A":{"text":"The two chicks welcome you into their new business with smiling faces. The atmosphere is e","useful":0,"cool":0},"ZnYdJBJ8zAoeSiKUaTylNg":{"text":"Redemption! Not just because it was playing in the cafe either. This was my second visit h","useful":3,"cool":0},"EMx47KtdJRD33CzYx11Zuw":{"text":"Called in an order for a large group with a variety of requests; was not dissappointed. Ev","useful":0,"cool":0},"wd9lXs3b0etOAEiaAu9JXw":{"text":"I decided to give this place another shot because I know they have good quality food. As l","useful":0,"cool":0},"l3ExmzJzhX1suCFiU1b8CQ":{"text":"Amazingly delicious place for breakfast, beautifully decorated, every detail is gorgeous! ","useful":0,"cool":0},"FHliDQBrlXPQLnJt7t3psg":{"text":"The andoullie sausage is amazing and tasty. We also enjoyed the pancakes and potatoes. Eve","useful":0,"cool":0},"faOPbpNQnBb-4kg4QSLX2A":{"text":"Whoa...this food was so damn good that I forgot to take a picture. First of all, the ladie","useful":0,"cool":0},"Q_wQyTi-Ize1JOdYyNhihw":{"text":"My food was totally excellent! Had the seafood omelet which was great!my wife had the vegg","useful":0,"cool":1},"CZ6V7SZP1TBXI86cvaK00Q":{"text":"Nice place and the food was good. Ordered the crab cake Benedict. Service was a bit slow b","useful":1,"cool":0},"RH9VD7pMw0R8F0vFpF6NkA":{"text":"We got lucky to get two seats at the bar right away.  We got there around 10:30am. The pla","useful":0,"cool":0},"ZurC7FCr63wZnESPYDW0KA":{"text":"Came here for Breakfast for my sister and I birthday! It was amazing!! So tasty, great ser","useful":0,"cool":0},"bx9XeoEIWYsKbo_Y-ShSkw":{"text":"Ate here for brunch with friends/co-workers. Really good brunch spot with a relaxed atmosp","useful":1,"cool":2},"BjKbGTAKDvCfsTH9pB5L7Q":{"text":"First time to try seafood crepe and it was delicious, loaded with shrimp  and crab meet , ","useful":0,"cool":0},"H1Sx-AsvtXuDV1Yl5zKCZw":{"text":"Stopped by this little joint on the way into the convention center. Really fast service an","useful":0,"cool":0},"LNqImS-3_m3tJh-er1SWOg":{"text":"The dish was presented very well. The decor is super cute and the food was delicious. I wi","useful":0,"cool":0},"trEpsxnJrdtl6_Mm9pKJtA":{"text":"Tried to have breakfast at this restaurant because it was close to my fiancé's conference ","useful":0,"cool":1},"axoGpA0pJre8AfjIisN52g":{"text":"After a quick Yelp search for breakfast/brunch, I found Two Chicks.  Upon entering the cle","useful":1,"cool":0},"_rhvgtWpGzjg7EDXIxYy5w":{"text":"Very good breakfast!! I would definitely eat here again. I had the French toast and it was","useful":0,"cool":0},"6Kic_E-M7oX5kX_FgqkCIA":{"text":"My boyfriend and I needed a place to eat before work and yelp let us here! It was a great ","useful":0,"cool":0},"pdOq_OnH3iEtgAsNY4Kq6w":{"text":"So the service was very good. I think a 4 star rating in this town is so common that to ea","useful":0,"cool":0},"fIazVOeZg9mTmYXmkbp88A":{"text":"Always good and fresh food! Best grits in town.  And the good service makes it better.","useful":0,"cool":0},"wE9GovALIqtVu59w-1GalQ":{"text":"We have come here two days in a row now. Great food both times and a great atmosphere. Def","useful":1,"cool":0},"w6-XG8AuaCFDip745q8ghg":{"text":"The food was great and the service was wonderful.  There food was made from scratch, taste","useful":1,"cool":0},"ZqMUzVcbmhZg48lAf7onIw":{"text":"We had less than a 5 minute wait on a Sunday morning   The atmosphere is cozy and quaint. ","useful":0,"cool":0},"UF_0Blwcv_wYqRXy0ZN1SQ":{"text":"Great breakfast spot and we went during the week so it was not crowded at all! Let me tell","useful":0,"cool":0},"45s9li7dIdaygvgTlIXXZg":{"text":"Great place to start the day. Really good food and great service. Got here relatively earl","useful":1,"cool":0},"ifLQcgeFRFOj1zUVZ0Gqtg":{"text":"Breakfast service was very slow\nNeeded to ask for coffee cream, butter, & a fork\nPower dri","useful":0,"cool":0},"3XlOe_S1VCC7J_Q2q_Gvhw":{"text":"So, ate here for breakfast one morning as it was close to the convention. \n\nI ordered the ","useful":0,"cool":0},"DksGbyRMmhTKxVgcpd5mZA":{"text":"Papa's French toast was delicious!! I don't normally like French toast but I decided to tr","useful":0,"cool":0},"pFLSybdYZJol19Ej_faynw":{"text":"Food was wonderful. I had the traditional Egg Benedict. It was incredibly tasty. Good atmo","useful":0,"cool":0},"LHx0LTcePYtQ7hLauj4VnA":{"text":"Simple and yummy breakfast. Really liked the variety of fresh squeezed juices and smoothie","useful":0,"cool":1},"8AlCFODKOqKIsVkUEsL5fA":{"text":"Absolutely loved this place! Quaint welcoming feel to it, colorful wall murals, and friend","useful":0,"cool":0},"rx6gK1CLPoiV159HqRS3Gg":{"text":"Was here for about 12 days for a convention and came here almost every single day, and it ","useful":0,"cool":1},"Ueazq73RafrJvcl-dR1Ksw":{"text":"Really enjoyed our breakfast at Two Chicks. I had the Under the Sea omelette and it was de","useful":0,"cool":0},"_ic39spW-hmy-gHAEtczFA":{"text":"Great atmosphere and style. Ladies running the cafe are delightful. I live a couple blocks","useful":2,"cool":1},"NK1I7T_JZXrjxxV19pJArw":{"text":"I ordered the Hatchery and it was amazing! The goat cheese was so good, I loved it. The se","useful":0,"cool":0},"BR2HYRgTqameMncR2ttEmA":{"text":"The shrimp and grits were awesome! Best I have had in a long time. My wife and son had the","useful":1,"cool":0},"BZThmuoAMvN8LA10sN43kQ":{"text":"Omg! I've been trying to get her for about a year.! Well, it was more than I expected. I h","useful":3,"cool":2},"Yop6rZ7sJRXeMe-DnQtR_g":{"text":"Great place for lunch or brunch. Their green juices were delicious and very healthy. I had","useful":0,"cool":0},"7fe0lgxVzAfaeDdJI9f0JQ":{"text":"Do not be put off by the look of the building housing this restaurant. Amazingly fresh and","useful":1,"cool":0},"MD6L9csVDswofJNF_zntJA":{"text":"There are some places that just catch your attention.  Some places that you walk out sayin","useful":3,"cool":3},"KvYTD2V1rzCamkkB5sUvfw":{"text":"So far this is my favorite brunch places in the area. Being an European native, food satis","useful":0,"cool":1},"9y0XpKy9emxPjS1eGG71Yg":{"text":"This is a fantastic breakfast spot. Either some people below don't know what they're talki","useful":3,"cool":1},"tpD9ZWXfNAHFPGtjo-nFlw":{"text":"Awesome Cajun eggs benedict with yummy grits!!!! Perfect for lunch...especially when tryin","useful":0,"cool":0},"QKHYF4VwDubOF7vWLPpJCg":{"text":"We got lunch there at 12 PM. The service was fast and friendly. I got the Caesar salad wit","useful":0,"cool":0},"fK0Y5q_KeDK88cqJJjohiQ":{"text":"This was the worst grilled cheese I've EVER eaten!! Cheese wasn't melted but my bread was ","useful":1,"cool":0},"z3xH0wpymMDW-UkDNJC9og":{"text":"This place probably is the best place for breakfast/brunch in this area! Their omelet is j","useful":0,"cool":0},"0MVjqBXw7BRUkoSX5NU36w":{"text":"What a great find!  Super cute and sooo good!  Traditional eggs benny!  PERFECTLY cooked e","useful":0,"cool":0},"Sqq2p41XlJVZtYhztOht-w":{"text":"Delicious Papa's French Toast for me and Pancakes for my son.  The French Toast was topped","useful":2,"cool":0},"T6Fgc3FTYOlGfOq0cpyJKg":{"text":"Delicious French toast with very attentive service.  We sat at the bar area.  Would certai","useful":1,"cool":0},"96wvehP4eyRyDpcffTeeNg":{"text":"Absolutely delicious! Such a cute place! Veggie benedict is sooo good! And the fresh juice","useful":1,"cool":0},"FE9ni6qZVnJAtwLmIQmWjg":{"text":"We went here twice and it was lovely both times. I ordered a savoury buckwheat crepe with ","useful":1,"cool":0},"kkvx5jhrO2gAsHffsgckvQ":{"text":"This was a great find. The flavor in their menu was awesome, best grits hands down in Nola","useful":0,"cool":0},"8bjj51BFiUySjyXB_tErtw":{"text":"Very nice place for breakfast. Quick service, good food and reasonable pricing. Great opti","useful":1,"cool":0},"GP1pfW8wnTot1DHUk_C8Ug":{"text":"The best grits I've ever had...EVER!\n\nGreat food, great service, and even better managemen","useful":2,"cool":1},"-PkngpT89Y1cEd3GLrxg1w":{"text":"We went for breakfast 3 times in N.O. (to 3 diff places) and this place was easily the bes","useful":0,"cool":0},"bM22v7_cFr7UxKFtyyhR9A":{"text":"This place is awesome. The food tastes homecooked and seems to use good ingredients. They ","useful":0,"cool":0},"NqRae1aMs2gGC_IYhnXH9w":{"text":"Tried this place because I was too hungry to wait on line elsewhere. I created my own omel","useful":1,"cool":0},"k8R3hWzlaDrbXF2twsvjrg":{"text":"We are first-timers in New Orleans with just 36 hours in town. We chose Two Chicks Café be","useful":2,"cool":0},"Ge8w5XOGiQZxqKhnPni8VQ":{"text":"Best Mimosas I've had for brunch. The Andouille sausage was on point. Cute brunch date pla","useful":0,"cool":0},"sEYL4T2Sj2KhmCibFW6O1A":{"text":"We looked up a breakfast place around us since we are staying around the corner, it was de","useful":0,"cool":0},"9Lqh0fRkcC8oez9E_BqtQg":{"text":"Came here on a Saturday morning and only had to wait 20 minutes. Had great service from th","useful":0,"cool":0},"VhST-qBAr3l8ysI_QrBTDA":{"text":"Had a nice breakfast there. Their crabcake benedict with an interesting twist on hollandai","useful":1,"cool":1},"HL9OwFwc8suVhPEQC_zOsw":{"text":"While upon approach it appears the location is on the lobby level of condos or offices whe","useful":0,"cool":0},"zR33oCM4LtazABawQDLXXg":{"text":"This is a solid place for breakfast with very friendly and fast service. I had the build y","useful":2,"cool":1},"GmOgB9UWINYxqau1LySMFA":{"text":"Two Chicks is A FANTASTIC taste of NOLA. We loved the service and the food. It's light on ","useful":0,"cool":0},"6W9PoH07hQfjtxOzbsXy4A":{"text":"I've been here twice,  and it just gets better. Friendly staff, quick service, and welcomi","useful":0,"cool":0},"2t4dp9lqg1i4_28cLU8MqQ":{"text":"In NOLA for a couple days and wanted some \"local\" food. The reviews on Two Chick's Cafe su","useful":3,"cool":0},"ijEnhiC1C8YuAC5DXtbkxA":{"text":"Truly delicious breakfast and great service!  My son & I happened upon Two Chicks from our","useful":1,"cool":0},"UGknGu1-nHF18u4WTgFa6Q":{"text":"This place exceeded our expectations for a simple cafe. Do their \"build your own\" omelette","useful":1,"cool":0},"KStTs1Xx_bM1e7SSopWVWg":{"text":"We had breakfast there. It was really good quality food for a good price. I had the Tradit","useful":0,"cool":0},"naMo_ozh1ujME039vBPD2w":{"text":"Quaint little startup serving breakfast every day in the warehouse district.  They put out","useful":0,"cool":1},"cnAXBM4l1_e2wyNGdqhmGQ":{"text":"Loved the cheesy grits here. Great lunch option if you're attending a conference in town.","useful":2,"cool":1},"vN_nFjhH41n9NO815El6Ug":{"text":"Amazing food!! There was a little wait but definitely worth it. The service was great. The","useful":0,"cool":0},"2xNivso9S52vrm-o50zSzw":{"text":"This is a nice low key restaurant with good quality food and friendly staff. Their breakfa","useful":0,"cool":0},"zs_2C5kmNijR-m88-cG5yg":{"text":"Great place to eat! The fresh squeezed orange juice is delicious and the grits are yummy.","useful":0,"cool":0},"al4NwzogBqNnnrY70BiLMg":{"text":"It was good, but not mind blowing. It was a cute little place, but being open to a buildin","useful":0,"cool":0},"BblI0JqIt8KLGaDC9nSucg":{"text":"Great breakfast. Veggie Benedict with Cajun hollandaise very good. Belt (blt plus egg) ver","useful":0,"cool":0},"qY11QD0JVNNuB9ObWDzBsQ":{"text":"The food was just okay. I had much higher hopes for this place; on the other hand, the ser","useful":0,"cool":0},"ivFzuR6N5TUhZ5TheohhDw":{"text":"Everything I ordered (including juice mix) was absolutely delicious, service was outstandi","useful":1,"cool":0},"LRKri9dM9rsXni9_L6pwnA":{"text":"This was convenient and such an nice place. The workers there are friendly and treated my ","useful":0,"cool":0},"9wWuZFkfrS5M__R_MZm_JA":{"text":"Found this place on Yelp looking for nearby breakfast places. The place was full when we g","useful":3,"cool":3},"3MnMDEmkIWHj8qeuUH4gIQ":{"text":"I really liked this place. Cafe atmosphere, nice waitstaff\nGood food and that makes me hap","useful":0,"cool":0},"tdhIcBphgZT0Jgf9Rro7qA":{"text":"After gorging the previous day on good ol southern heavy Cajun food,  I was in need of som","useful":1,"cool":0},"O92x7qm9Pec4cniIB2Kb6Q":{"text":"From Dc. I had frech toast and quinoa salade. I visited there becase of high rate. But fro","useful":1,"cool":0},"LBAV7p3EVr13BLkJ6NKiNg":{"text":"So good! This quiet and unassuming spot has the most scrumptious food. I enjoyed it so muc","useful":0,"cool":0},"YpvXnq6kE4aVXaPE-AobcQ":{"text":"This place was really cozy, and had a nice atmosphere. Two Chicks was clean, and the staff","useful":0,"cool":0},"erN9uW9FBcNEUSuN8Tddow":{"text":"This restaurant is excellent! It's adorable and chic, the food is delicious and the servic","useful":1,"cool":2},"RWjb6k_TY3oaBlL7oql0Yg":{"text":"I and my girlfriend went for breakfast today, having read rave reviews of their breakfast ","useful":2,"cool":0},"ch2wdmxe9mVgRnrHDqGt7Q":{"text":"If you don't try this spot...you're a fool!   AMAZING !!!\nFrench Toast is Great...service ","useful":0,"cool":0},"WW2vtQ67GhM2-Gu9txtGog":{"text":"Came here for brunch and wasn't disappointed. Plenty of options, even gluten-free. I had t","useful":0,"cool":0},"jUR1S-7P_XkcvPBQob24OQ":{"text":"What a fun place and charming atmosphere. Very welcoming. Cool to watch them blend your ju","useful":0,"cool":0},"tWVOU6wq4mhyF-1bsBmAiw":{"text":"Cute place with pretty painted walls and nice flowery decor. I had the veggie Benedict whi","useful":0,"cool":0},"uzPzKGGGL1Ev0tCGJ66F_Q":{"text":"First time to eat at this small quaint establishment. Ate here for breakfast and had the m","useful":1,"cool":0},"m7pfqgoK4k8Wyanz7gMXSA":{"text":"Great food with healthy and delicious options and a really cute feel. Had an amazing smoot","useful":1,"cool":0},"xDiDoHbP7jLX2V8tR1F18Q":{"text":"We were glad we made the walk to Two Chicks. We heard the CCB was awesome, and this wasn't","useful":1,"cool":0},"hBLCg6DQQFp4jE6G4leLlA":{"text":"The food was amazing. You could definitely taste that the food was made with fresh ingredi","useful":0,"cool":0},"flvfTSaOXkjB9MeXLJf2kg":{"text":"Great spot for coffee and hearty breakfast! Cozy and close to the conference center! Servi","useful":0,"cool":0},"DLtq5ODL1YDfLVCuslZ9eg":{"text":"Food was great. I had the kickin chicken omelette and my boyfriend had the build your own ","useful":0,"cool":0},"pXqHeBc-a89D0dLjytGhWw":{"text":"Great grits and food!!! Yummy!! Price are reasonable also it's a quiet location. Food was ","useful":0,"cool":0},"KKRFCDk4HASXgDj-5G1MNg":{"text":"When folks found out that I was heading to NOLA this weekend, \" Oh, you've GOT to eat at T","useful":3,"cool":0},"cC-ohu6uF-4_3H-sKYIoKw":{"text":"Wonderful place, the French toast was awesome, ambience very pleasant, service was terrifi","useful":0,"cool":0},"xoNXfv-dUEbcvuW3qpjmpw":{"text":"In town for the National Beta convention, found this jewel for brunch our first day. Great","useful":0,"cool":0},"rrjm3bZmXNJxmDf3f1l7Ng":{"text":"I'm visiting from out of town and this cafe was only 6 blocks from my hotel. Service was p","useful":4,"cool":0},"5TE22dHDBAXfwwaxOsGTiA":{"text":"My daughter and I had breakfast here this morning - YUM! I built my own omelet, she had th","useful":1,"cool":0},"wNlEAYoIQW_NIgq6pqw0kw":{"text":"Excellent eggs benny! Perfect place for weekend brunch. Convention center prices but you k","useful":0,"cool":0},"ijqxoLxqGYC2VaG8bQam9Q":{"text":"Thanks again fellow Yelpers! Had a veggies omelet with spinach mushrooms green onion and g","useful":0,"cool":0},"1NpykdFsxGvDy0iV-gL7Ew":{"text":"Awesome brunch place. Try the Farmhouse Omelet with Turkey if your a fan of Gouda cheese i","useful":1,"cool":0},"YC1KLr5cRF9-YGCfwCsklA":{"text":"This was a great place (breakfast), there was a short wait (10 minutes) around 9:30am/Sund","useful":0,"cool":0},"ie8AZGpP_ZWqWlwhid2s1A":{"text":"Everything here is simply delicious. This is our breakfast stop every time we come to New ","useful":0,"cool":0},"bvsATh5eJhztduyLMl9x6Q":{"text":"Awesome place! Had a create your own omelet, eggs whites with crab...DELISH!  Huge bowl of","useful":2,"cool":0},"uWcJtYvXzI1-YmsZaHLrFw":{"text":"Excellent shrimp & crab omelet, grits, and BBQ shrimp grits!! Freshly squeezed orange juic","useful":1,"cool":1},"tgGf7PJMq9OyBJsudtc3nA":{"text":"Flew in the day after Mardi Gras and just wanted a place to grab a quick bite before headi","useful":3,"cool":1},"aocHKwQRZfiEp74J0yWVmw":{"text":"The BBQ shrimp & grits are outstanding! Friendly staff and owner Lauren is GREAT. I will d","useful":0,"cool":0},"dwFVOyfd5iS-KxPee4WWxQ":{"text":"I had the chicken panini. It was delicious!  Also had the green juice.  Very tasty.  Would","useful":0,"cool":0},"M5RCZciUQAgQfhDWi88QRA":{"text":"I had the BBQ Shrimp and Grits! The shrimp was so well seasoned and the grits were so crea","useful":1,"cool":1},"Zovi90qSIF_frgWM8HAk3w":{"text":"This little gem was so fantastic and unique that it inspired me to create a Yelp account a","useful":0,"cool":0},"ptqzWbMlCLFUJFcAOgZ1Cg":{"text":"They have the best iced coffee! I tried one of the breakfast sandwiches, although they ran","useful":0,"cool":0},"TVzeuIfsZnMvJvtpNQ_9Ew":{"text":"WOW incredible food. The bbq shrimp and grits here was probably my favorite thing that I a","useful":2,"cool":0},"mEmJiAMZ0uPRimTIRz2byg":{"text":"This is my favorite breakfast spot in all of New Orleans. After living in New Orleans for ","useful":0,"cool":0},"ge_pmtUJcmE5ce1593mafQ":{"text":"Went with a group of 8 people during brunch on a Sunday. Staff was friendly and accommodat","useful":1,"cool":1},"Xupk7B2utw_QQPPUlbVt4A":{"text":"My friends and I came here for the last meal of our Bachelorette weekend, and we could not","useful":1,"cool":1},"Kc4kd9746jmaA-FmQsB98g":{"text":"This place is so cute. I loved the atmosphere and the staff was very friendly. My husband ","useful":1,"cool":0},"zkmWZlWFbr3nHcSO8PEDSA":{"text":"Terrible. Couldn't even get in the door\n\nIt was extremely unorganized. Never have I seen a","useful":0,"cool":0},"IMcEIMPqfHw8ZWlNmHx-GA":{"text":"Great service and the food was delicious. A short walk from the convention center and way ","useful":0,"cool":0},"gYVJ77Q1pi-MAaZYnxchBQ":{"text":"Great service, delicious coffee and food. Food was quick and served hot. I had the the shr","useful":1,"cool":0},"BjzGWgcpv5sSARrSRp-AiA":{"text":"I expected too much. Lively fresh concept but execution of a poached egg is not done well.","useful":0,"cool":0},"cBAxjVIVM9xtfMRJ2-YDxg":{"text":"The Crab Cake Benedict was AMAZING! Fresh squeezed orange juice and delicious bloody Mary'","useful":0,"cool":0},"APOx9m6ZPzGZ-_jQXUg_9g":{"text":"Great breakfast! I ordered the iron chick, my husband had coffee and we split the crab cak","useful":0,"cool":0},"eGn51RhM_jTW2HTV_vgO4Q":{"text":"Came here for brunch before work and it was so worth it.\n\nIf you get there early enough yo","useful":1,"cool":0},"0yO-UtE-K_O5YqtPGxmQeA":{"text":"Hands down one of New Orleans best brunch spots.  While the location is on the smaller sid","useful":0,"cool":0},"ZewZXWRPr4A7wceg3Y8WRw":{"text":"Two Chicks Cafe was different. In a good way. I checked out the menu online before going a","useful":0,"cool":0},"V9hB8qDSYgDFlQCLx3vW1w":{"text":"Stumbled across this funky cafe while on a break from a convention across the street.  Gre","useful":0,"cool":0},"GYOTyI5qabRQxYJWe2uQ2A":{"text":"This is a great breakfast place! A lot newer and cleaner than most places in New Orleans. ","useful":1,"cool":0},"ZYWZIoY_3tC2ucwT9Jmxsg":{"text":"This place is a must if you enjoy superb food, great flavor combinations, and excellent se","useful":1,"cool":0},"N9BfxGXRVHYtXxf909N3IQ":{"text":"Very tasty. Had the shrimp and grits and a friend had the crab melt. Both were great. Staf","useful":1,"cool":0},"Xx1h9FE5KBndgOGYjs4TQw":{"text":"Best meal I've had since arriving in NOLA. Creative, fresh, and healthy!  Fresh juices fro","useful":1,"cool":0},"TpCboHBu-LOrzaZOkqNF5A":{"text":"This place was amazing! The grits were delicious & I loved the mimosa, the sweet crepes an","useful":0,"cool":0},"irY-tQmbgBJKOhQNGI_LkA":{"text":"Found this place while on our never-ending quest for breakfast spots. I did not realize th","useful":0,"cool":0},"TFrfSI8kxCfcLFACv-KszA":{"text":"I really want to give 5 stars. But it wasn't pure perfection. \n\nI had the BBQ shrimp and g","useful":1,"cool":0},"unvkdNWU0iotAQNZvojaRQ":{"text":"Really delighted to find the diamond in the rough. Cafe breakfast cooked perfectly and gre","useful":0,"cool":0},"VXTLToCxAtNlIvI9u5vcWg":{"text":"This little place was awesome! So cute and quaint! The food was great and the service was ","useful":0,"cool":0},"ty0xLu769i9xyIGamhBAyA":{"text":"Using my yelp app to find different places to eat worked out well this morning.  Me and my","useful":2,"cool":0},"csFdmbveu9LzxH7a1ZhthQ":{"text":"Very nice place. It is on the small side so you may have to wait. It isn't the typical in ","useful":0,"cool":0},"50DppHxA41ss7lRjsa3n1A":{"text":"Mapping shows it to be farther from the convention center than it is. Cross street is Diam","useful":1,"cool":0},"rv5vQ9rcD-3RzRhABQL-zw":{"text":"Had brunch here with a friend and we had the Crab Cake Benedict and the Veggie Benedict an","useful":0,"cool":0},"yKqlgwPSfE_8xsWE7TGnUA":{"text":"If breakfast is your favorite meal then, unless you live in New Orleans, stay away from Tw","useful":1,"cool":0},"IImk1uSfd9Lh65AQRuaJhg":{"text":"My wife and I were looking for a breakfast place when we stumbled on this gem.  The eggs w","useful":0,"cool":0},"DHAAtkDuI8SWqyGQPgRUaQ":{"text":"Amazing! My wife and I both loved it. We had the Traditional Eggs Benidict  and the Farm H","useful":0,"cool":0},"sfwh20ZaM2h8XDlYFB63OQ":{"text":"The food was good here, the grits were great. I give this place a 3 star because the staff","useful":2,"cool":0},"yb7QbXrs2pv_maF9aycPpw":{"text":"I went in to Two Chicks Cafe hoping for an exciting experience. My breakfast from the day ","useful":1,"cool":0},"MEneWf6OCH957n-MS6jgqQ":{"text":"Breakfast was great at this little spot. We got there just before a line started to form a","useful":0,"cool":0},"msr6Ak1LMRcVH_kpyxE7hQ":{"text":"Cute little tucked away cafe perfect for a delicious breakfast. Located right next to the ","useful":0,"cool":0},"-jj0ntS417Jzqm157fgA2g":{"text":"Omg!!!!! The best corn flake French toast I've ever had in life. I was not expecting the f","useful":0,"cool":0},"h7Jsb-wogzS68E-lG3MGSg":{"text":"After traveling to visit my sister for some much needed r and r, we needed a quick refuel ","useful":1,"cool":3},"WfzM3SwPYYX0u6ldkSSCxw":{"text":"Had a great breakfast here this morning. The Crab cakes Benedict on a croissant with a sid","useful":1,"cool":0},"MreRc00-RIsT4a7pJ7Mkow":{"text":"I usually don't write reviews, but this place absolutely deserves my recognition. The menu","useful":0,"cool":1},"y9xFT-6RimH7Pm2nQraOEw":{"text":"The place to go for great breakfast and great service if you're around the convention cent","useful":1,"cool":0},"hk7l3l47rQPw2laBAD6RSA":{"text":"This restaurant food is amazingly good. I had the \" Hatchery \" breakfast sandwich. It trul","useful":0,"cool":0},"WJBnnhSSGDqCI-Y2hjJxAg":{"text":"Nous sommes allés déjeuner deux fois et ce fut tout aussi bon d'une fois à l'autre. Beau c","useful":0,"cool":0},"a1PUloX-8p2-0C4IRWAezQ":{"text":"I love that breakfast is served all day.  The eggs were prepared just the way I ordered an","useful":0,"cool":0},"jxNhqTqydQcQyMPwWCW-HQ":{"text":"Had breakfast 2 times there in my last stay in New Orleans! Small place but great food and","useful":0,"cool":0},"o3QxsiCwOUpew2UPicGgqw":{"text":"Fun, friendly breakfast and lunch spot. Delicious spicy Thai Po boy &  Homemade lemonade.","useful":0,"cool":0},"2TgBxunV6W_zL1NTya2zVg":{"text":"Visited Two Chicks Cafe for lunch because of its close proximity to the Conference Center.","useful":1,"cool":0},"FaVCsyHaZNxZiupvNcxcGA":{"text":"During our four days in the Central Business District we are three meals here, and they we","useful":1,"cool":0},"yXJB0V5qZuIAs6-T_Cv3SA":{"text":"Super super terrific. Amazing service- really went above and beyond to accommodate our tab","useful":0,"cool":0},"YrXCsZymDmLOQkIW2CPuLw":{"text":"Sunday morning at 9:30am, party of two. Server quoted us a 10-15 minute wait, but it was o","useful":0,"cool":0},"95t-dCq728p1RersZsNmzg":{"text":"Was not worth the hype or the wait. I sat at the bar and my food arrived pretty quickly. T","useful":2,"cool":0},"Rz-rRq4wwUkWBz_r7_glbQ":{"text":"Awesome omelette! But more amazing thing is their fresh squeezed juice. One with apple gra","useful":0,"cool":0},"-7F9wfiiYA_dtpTZn64hHA":{"text":"The food is pretty basic. My homegirl had BBQ shrimp and grits that she said was excellent","useful":0,"cool":0},"15R9VPFF-C35simWPHMCiA":{"text":"OMG! This place is a hidden gem! Its a small place, but really worth the wait. There were ","useful":0,"cool":0},"XbiRqsIOK5qiao7dD3-W0Q":{"text":"I was expecting it to be all hype but I actually really loved the food here! I had the far","useful":0,"cool":0},"YHP4ZnMdo649xE2hqjwG8Q":{"text":"This fine establishment is owned by two women! Need I say more? Perfect farm to table feel","useful":0,"cool":0},"4XJZaxxpyAtIBx7V9B1pOA":{"text":"I was staying across from the convention center and ate breakfast here two days in a row. ","useful":1,"cool":0},"-RZXj8rMcWjOY0F0tKkNTw":{"text":"The food was really good, we got the French toast and the crab cake eggs benedict with the","useful":1,"cool":0},"aXBNbMtbVyp-EmL9AIT2EA":{"text":"Small place but good fresh food. Not a large menu but def can find something you like. Hub","useful":0,"cool":0},"y0dj70hE5W6cbD4RkbVpSA":{"text":"Delicious.  We were weary and starving after flying into town, and this was just down the ","useful":1,"cool":0},"rdClTGPGjpudXWyVlBZqPg":{"text":"BBQ Shrimp and grits here are definitely something worth getting here. They have some pret","useful":0,"cool":0},"GOqu-4oBiLxZngCZJEcAwg":{"text":"Love this place. Great coffee and food!! The French toast is a must every time I come. Whe","useful":0,"cool":0},"uMcdI48iAc7ATTEWtovWlQ":{"text":"Bad service, underwhelming food, food was barely warm when brought to the table. Don't und","useful":0,"cool":0},"m3Z2W4CS0YhZrJFy6ufTrg":{"text":"Food was good, service friendly and quick. Nice atmosphere. Although it was raining it did","useful":1,"cool":1},"toW6Q60ew7c2ddGfsTYakA":{"text":"Great breakfast walking distance from the convention center . Dont waste your time eating ","useful":0,"cool":0},"yK05NNTrvxTTFJP6UNwJYA":{"text":"Great place for an interesting and different -- and delicious lunch. I had the grilled che","useful":0,"cool":0},"seDnh5X16iY5-vcL7cEbqA":{"text":"Great breakfast, with a unique menu.  Had awesome french toast with fresh-squeezed OJ.  My","useful":0,"cool":0},"9nlOoPTafxYVKcYaGjuYqA":{"text":"We came here after searching for a quick breakfast place near our hotel. Two Chicks Cafe i","useful":3,"cool":1},"CAZ2v-GVSSFYTVg5Pb1aew":{"text":"At a conference in the Convention Center. While standing in line for the only Starbucks ki","useful":0,"cool":0},"kCUBYBkvcdWKyWlwzaqR7g":{"text":"Great coffee, smooth creamy grits, flavorful seafood omelet, fresh squeezed orange juice. ","useful":0,"cool":0},"p2D_WBtD1jMi7EbfrbjtnQ":{"text":"I giving them two start because the food was good, small but good. However, they took lite","useful":1,"cool":0},"6OfbuxvN7VJUvHeAay062g":{"text":"Came here for brunch on a Saturday. There was no wait which was nice, service was fantasti","useful":1,"cool":0},"BHe2D0yQgtSG_YzeLxuhBQ":{"text":"An amazing place to eat in Nola. Owners and workers are friendly. Food is so tasty and a g","useful":0,"cool":0},"Uzf9mJoDc2SPKOTsDS8Ogw":{"text":"What a wonderful, healthy breakfast place on my last day in New Orleans! \n\nMy omelette was","useful":0,"cool":0},"GzXTK7GKh4jvGDD-2B5wTQ":{"text":"Amazing food and atmosphere! Owners are warm and friendly! Go check this gem out. The Fren","useful":0,"cool":0},"tQI74m0yqF_wBylgyi0zOQ":{"text":"Great little spot for breakfast. Very cute atmosphere - reminds me of something Joanna Gai","useful":0,"cool":0},"M0Ovgcv0sE5gw6ml4aGpLQ":{"text":"Delicious breakfast! The shrimp and grits were very flavorful with large, good quality shr","useful":0,"cool":0},"pwoSuBe9DX-LV8vxaQw7gA":{"text":"Great food. Bad directions. We walked from our hotel by Yelp's directions. Fortunately I c","useful":0,"cool":1},"y0GDPc9jYnqhp93X2edfHA":{"text":"Decided to try this spot after reading other Yelper reviews.  I think I have to disagree w","useful":0,"cool":0},"VoR9muqMAh3odm63_xaiMA":{"text":"The Thai Shrimp Poboy at Two Chicks Cafe is hands down the best in NOLA. Two Chicks Cafe i","useful":1,"cool":0},"_CRRgtTRd_U_typSp2O_Ww":{"text":"Two words: Eggs benedict!\n\nI had the traditional benedict and my friends had the crab cake","useful":1,"cool":1},"y3WXIHDo_zf2S30dLwg76Q":{"text":"Best grits in the city, hands down. Always sweet and attentive staff and the owners are on","useful":0,"cool":0},"qsLHQ2TjnEOBiEvu7kFRGQ":{"text":"Such an awesome Cafe! I was looking for breakfast at a conference I'm attending (and decid","useful":0,"cool":0},"j1h1YWdqsDq5V-ErxtmojQ":{"text":"After several lackluster breakfasts I checked out this cafe, very glad I did. Super close ","useful":1,"cool":0},"XA_dPS8-_ouGITJBnf4dIQ":{"text":"We drove all the way from Austin,Texas to try the food and heard all about the eggs benedi","useful":0,"cool":0},"ky0PIxicoWMYkhh5AI9DTA":{"text":"Food was five stars, service I give 4 stars, the wait was okay and the food was very good.","useful":1,"cool":0},"v8OL_qMb0qupjEoAeY_C8w":{"text":"Few times do I take the time to write reviews on restaurants however this place is amazing","useful":1,"cool":0},"TgwhTUT-SeOvuL1mPROjqA":{"text":"Good food, awesome orange juicer, attentive and friendly staff. If you stay in any of the ","useful":0,"cool":0},"FXL3vcPhUxaRuaq8VGI_fg":{"text":"Stumbled onto this new place on a Saturday morning. Great service. Great food. No wait. It","useful":0,"cool":0},"p-PU4LPMblXeipAzE0VLzg":{"text":"Neat little place. Great juice selection.\nGood value and convenient to convention center.","useful":0,"cool":0},"Ba0d1ks6RAo8uFj3qxRSAg":{"text":"I came here for breakfast after my redeye flight. The waitress said the shrimp and grits w","useful":3,"cool":2},"tDxMZ0-wLjMCIijpralKBQ":{"text":"Great place for breakfast.  Eggs Benedict was prepared perfectly.  Not a grits fan, but ha","useful":1,"cool":0},"Ywhd_knd-KHBt7GC5dXUOg":{"text":"Not sure if we hit it on a bad day or what, but we came here with about an hour available.","useful":1,"cool":0},"KCUbh2sxc9cQn8GeQaoESg":{"text":"Love the Veggie Benedict however I am not a fan of their potatoes served on the side; they","useful":0,"cool":0},"9iSmxyedzoEnExWiWZhZFQ":{"text":"Yum. Yum. Yum. This struck me as being in the strangest of locations. A year ago, we parke","useful":0,"cool":0},"qkxigbJzT8QkTSfPVH-pRQ":{"text":"Great little place close to convention center. Breakfast was fantastic with some unique me","useful":0,"cool":0},"agF5wqaAaTCCIkb0LYAXmg":{"text":"The crab cake benedict and the crab melt were very very good. The portions of crab was ver","useful":0,"cool":0},"rn6Wy5LCy4r_y8b3lxO_fg":{"text":"Great place for breakfast and fresh juices right across the convention center. The decor i","useful":1,"cool":1},"a9SxM1zXKr6DE-WpY0MJbQ":{"text":"Good food. Great service. The only thing that would make this place unbeatable would be a ","useful":0,"cool":0},"OKmHLkyaev38IXB0rjgUbw":{"text":"Seriously this place is the BEST! Visiting New Orleans for a convention and found this lit","useful":1,"cool":0},"0KbiiLJZ2IP3sQfNGQCUSw":{"text":"Hair in food and customer service awful!  Still charged me. Tough because it was a cute pl","useful":0,"cool":0},"92sTO0lCCTnvR7j262VwxQ":{"text":"Excellent option for breakfast, very close to the Convention Center.  After trying the bre","useful":1,"cool":0},"9zsN5LuUl232aVyDywn7lA":{"text":"Ok. So I had to eat nearby the Hyatt Place cus that's where I had to be after lunch. From ","useful":3,"cool":0},"Gu5JyfE8G2ldAelmxS7Dzg":{"text":"We chose  2 Chicks because it was about a 15 minute walk from the hotel and had good revie","useful":1,"cool":0},"NUUZCgLLfwWcLOGIH9z9Pw":{"text":"Loved this find!  Cheery, friendly, healthy and delicious!  I built my own omelet and it w","useful":1,"cool":0},"VpqlBWqnq9ZpKLUh783Ywg":{"text":"If you are pressed for time and/or want to do a to go order, this is NOT the place for you","useful":3,"cool":0},"GG1o5tmfPACV3zFfJWOAhw":{"text":"Although getting to this restaurant was a bit of a hassle (its on the corner of fulton and","useful":1,"cool":1},"-NkV1N6vrZlaXOhY2vpaKw":{"text":"I got the seafood buckwheat crepe ($9.50+tax+tip). It was average in both taste and quanti","useful":0,"cool":0},"POwFBwMI6trIbyf10X52vA":{"text":"Yessssss great food. Line out the door, but moves at a decent pace. Will be back for sure.","useful":1,"cool":0},"A8vciHs6_QVz_YZW0ypnhg":{"text":"Great, friendly service! GIRL POWER! :) I had the traditional eggs Benedict and it was ver","useful":2,"cool":1},"V0GL_dsp_9XVU-Fw9YE6gw":{"text":"This place is great! Delicious food (I recommend the buttermilk pancakes), fresh juice and","useful":0,"cool":0},"-g2-2j3PsLwSlXR6g2aLMw":{"text":"I had their grits the other morning and they were hands down the BEST grits I've ever had.","useful":4,"cool":1},"0SDcrKSXdPL1amDH_ACbNQ":{"text":"Food was phenomenal, crab cake Benedict was the best! Service was excellent!!!!! Neat litt","useful":0,"cool":0},"mGOfzSrm6mrHoj4zDhSI8Q":{"text":"In town for a convention, ate here twice.  Had the shrimp & grits as well as the Crab Cake","useful":2,"cool":0},"7iFZYnv0uSGqh-HxTa8O4w":{"text":"Great service and good value. Perfectly cooked poached eggs. Fried eggs not at all greasy.","useful":1,"cool":0},"BMGuyw-67mF9seQiQK0R6g":{"text":"I had the Crab Benedict and cheesy grits. Everything was amazing and I would definitely re","useful":0,"cool":0},"fEdV_f6cwAnG4XLklwdLtw":{"text":"So, I was really looking forward to eating here given all the great reviews. My wife and I","useful":0,"cool":0},"wS7A6mWvByF6GgB-rFqs_g":{"text":"My mom and I were passing through and found this amazing restaurant!  The staff was very s","useful":0,"cool":0},"wr105nBf40d-btdddlfMKw":{"text":"My husband, a friend and I had a delicious breakfast there yesterday. We all were very imp","useful":0,"cool":0},"CLM63NJPAyAxnhZMyXwcPA":{"text":"Came here for brunch while visiting for a conference. The shrimp and grits are truly life ","useful":0,"cool":0},"EAi1uo-RVITx8-zn8F8b9g":{"text":"Lawd have mercy.  The pics didn't look out of this world for the BBQ Shrimp & Grits but I ","useful":0,"cool":0},"_9WkpZW7g8cemGvcO4ERbg":{"text":"Excellent food along with excellent service. The grown up grill cheese is amazing. I highl","useful":0,"cool":0},"Q6oqwLNzFfHthUS73PbfWA":{"text":"This is a great little place for brunch. They have a little bit of everything. I tried a s","useful":0,"cool":0},"kTZ7mtbFbRfYAVVATQ8ASQ":{"text":"Good food near the convention center in the Warehouse District.\n\nQuite a line in between s","useful":0,"cool":0},"fp8rbEjSr_LLdO6ADWi8vQ":{"text":"Super good!! Got the crab bennie and was so in love with the croissant. Delicious, buttery","useful":0,"cool":0},"T054jg5JjdNKc1_FGJEuGA":{"text":"Was hoping this place would be good. It was a  no go. I'm only giving it two stars for fre","useful":2,"cool":0},"he-Hx9UY6cSYEuRyOM26Gg":{"text":"Delicious food and cordial staff. French toast was amazing. Coffee is freshly brewed. High","useful":1,"cool":1},"DnkCT6rIKgoCwlgRjKF0lw":{"text":"Excellent place to grab breakfast, location is convenient if you're near the Warehouse dis","useful":3,"cool":3},"Eti84YBQaW6ROntjZK6OGw":{"text":"This place is my favorite restaurant for lunch so far! I had a turkey crepe. The crepe is ","useful":1,"cool":0},"1dd9HDQmNFj_klVxyHfA1Q":{"text":"Great place!!  Excellent food at a good price.  Spoke with one of the owners casually, she","useful":1,"cool":0},"yBqrRdqYc2CAGWnxYQALHQ":{"text":"Very tasty breakfast brunch. Crepe and juice for the SO, and the delicious crab cake bened","useful":2,"cool":1},"aeawVlRlV7c5c2_3Cfmdng":{"text":"Breakfast at Two Chicks Cafe was absolutely delicious! I had the Crab Cake Eggs Benedict a","useful":1,"cool":0},"UNVygJHgJvZ2-TpFPqkrUQ":{"text":"Fresh and fast - the way b-fast is supposed to be.  The 2 chicks are very pretty as well!","useful":0,"cool":0},"L4AOVg47LXv_XqQo9LeI9w":{"text":"Great service and food! Atmosphere is awesome and very welcoming. I had the BBQ shrimp and","useful":0,"cool":0},"XA5s71fwoqqB1JBOCelu3Q":{"text":"My husband and I are on a pretty serious health kick and found that healthy options were a","useful":0,"cool":0},"VdhGtnkBx5Box36v_jdOPw":{"text":"YUM!!!!!!! Plain and simple. What other words do you need to describe one of the most awes","useful":0,"cool":0},"VKNy46hchV7xiVVos2qgjA":{"text":"I was staying in the area for the weekend and stumbled upon this place the first morning I","useful":1,"cool":1},"rsCGOgCcWrGEzWqkAZsRmw":{"text":"This place was great! Our table had iced coffee, crepe with crab and shrimp, crab cake egg","useful":0,"cool":0},"pUcyI-7fsVkUC3jPCUqWhg":{"text":"The waitresses were all really nice! Took a while to decide what I wanted to eat because e","useful":0,"cool":0},"JH6w8QVbBvLxLB8pClhT6g":{"text":"Visiting from Chicago, there weren't too many places near our hotel serving breakfast. So ","useful":0,"cool":0},"8l689l89f_rtQqRoT4FI7g":{"text":"Stayed down the street and found this place- great smoothie options and I had the grilled ","useful":0,"cool":0},"qt5DmesyTpHVS0CCfj1IOg":{"text":"Love this place. Sat at the bar with a friend of mine. Got to talk to one of the owners. S","useful":3,"cool":0},"0q-b9as_Q_jU8D2UHfNrdg":{"text":"I had the Barnyard Eggwich and the Cucumber  Lemonade. Both were delicious, I really liked","useful":1,"cool":0},"NJv8NUXssGAOPXA6m_RFYA":{"text":"Accepted my very large order gracefully and had everything ready for me when I arrived to ","useful":1,"cool":0},"GrX6tRlxUUxnuPOWHKDsjw":{"text":"The food was awesome!!! I had the crab cakes Benedict and grits and it gave me life!!!","useful":1,"cool":0},"OMsoHA54uZ0EmqjwYSuYug":{"text":"Food was excellent ! You should note it's in a hotel lobby so I did not notice a bathroom ","useful":1,"cool":1},"09CzRBBV2lxUNNKJ-ZtGTQ":{"text":"Had lunch here a few days ago and had a great chicken panini.  Today we came back for brea","useful":2,"cool":0},"lw7e0EfKHg2S7FUXI35ETA":{"text":"The atmosphere is charming but the tables, when the cafe is full, are too close together. ","useful":0,"cool":0},"SSJ350OMVZpV0LqclyEn5w":{"text":"There breakfast is the bomb! I built my own omelette and I added everything I could think ","useful":1,"cool":0},"URsO_lTdxrgaYqF6_7V2Ag":{"text":"Amazingly fresh and healthy options...quite a refreshing treat tucked in among all the oth","useful":0,"cool":0},"MZ6tmUOP873VmiRT2wH49A":{"text":"Yes yes yes, I came in during a busy breakfast.  I was shocked how quickly my food came!  ","useful":0,"cool":0},"pg2Ac6fGfBkQpWih98L_tw":{"text":"Cute cafe with pleasant servers. Good location in the garden district. Love the decor.\n\nVe","useful":1,"cool":0},"rqfVUWtcJMFIcXftZOBxMQ":{"text":"Delicious cute breakfast spot in a convenient area! Make sure you plan ahead as they are q","useful":0,"cool":1},"gb9f4QM8xKWKyEToKT092Q":{"text":"We walked a good ways for breakfast here this morning and it was very yummy! The Bloody Ma","useful":1,"cool":0},"_jIf6DERKaosf2Rke3AiEQ":{"text":"So this place is really busy. You have to have patience. It is so worth the wait. Great fo","useful":1,"cool":0},"1Y-_FvI0DgNRdqEHoQ2rJQ":{"text":"I met two colleagues for breakfast this morning, and was surprised by the line out the doo","useful":1,"cool":0},"Ln6c-IED9jqjHKKSb76UVQ":{"text":"Weak drinks and terrible attitudes from the staff. We had arrived early to New Orleans and","useful":1,"cool":0},"Ot2-JeYm3uILc18OFzdLbg":{"text":"We find this gem near the Convention Center.  We have eaten here twice over the weekend.  ","useful":1,"cool":1},"0ik58GBBs_t7zHqZvSy9Cg":{"text":"I was surprised that it was inside of a business-y building, but it was actually very cute","useful":0,"cool":0},"qYbXxApE0oQBMKBz242wbQ":{"text":"Food was delicious! Had the crab cake benedict with creamy grits. Highly recommend it! Ser","useful":0,"cool":0},"UCicaePiUPZmPJX5IVWuZw":{"text":"We sat at the bar - Service was pretty quick and welcoming! Papa's French Toast and the fr","useful":0,"cool":0},"VPV-JQNAEsIBBbYpXMzwkA":{"text":"Really good breakfast. I had french toast and it was awesome. Bf had crab ehhs Benedict he","useful":2,"cool":0},"B6R8Y2ewNsoDga6S3MN7sw":{"text":"Was a good breakfast place, hit it up just before going to the WWII museum just down the s","useful":0,"cool":0},"hOvr58m_sbb9zQt-pl_WZA":{"text":"I had the vegetarian Benedict served on croissant...great dish and attentive service. Nice","useful":1,"cool":0},"1J8u0Lsa1hFTZCQ8GwSF9w":{"text":"Located in a convenient place right across from the convention center.  Try the eggs Bened","useful":0,"cool":0},"UraNsVEy2TBJ8tOJWDvU1g":{"text":"Great breakfasts with a funky disco beat!  Fresh squeezed OJ and coffee with Chuck Brown a","useful":2,"cool":0},"lXIQQGJBsrp2XZ2SjzPVRQ":{"text":"Wow! This NOLA small cafe is big in portions and flavor! The grits are insanely delicious ","useful":0,"cool":0},"9k4PUeno5oM092iJCj-Kww":{"text":"Wonderful breakfast! Discovered this delightful spot on yelp while on vacation in New Orle","useful":0,"cool":0},"uWk9WFh5LmFX_SWXrkmFpw":{"text":"If I could give this zero stars, I would. Horrible service. 40 minutes to get 2 poached eg","useful":0,"cool":0},"WFbkzMOlSvTtiwYZiYvyBA":{"text":"Ate the hatchery eggwich, OMG it's AMAZING!!! So good! The \"two chicks\" are super nice and","useful":1,"cool":0},"R29D2fdYJAlwDYD450OSCw":{"text":"A great breakfast spot. Diverse selection of foods with great prices. They make fresh juic","useful":0,"cool":1},"cCXqroy3mT_2jahwg8qEPw":{"text":"I came here for lunch while on a trip to NOLA because it was close to my hotel. I ordered ","useful":0,"cool":0},"s706KVz0-LmZ3mLpwKyoWw":{"text":"This place is such a gem- especially after a night of drinking!  I had an omelette, severa","useful":0,"cool":0},"PMmMqr7TcSUVJ5A0kxJrsA":{"text":"Stopped for breakfast based on the yelp reviews. Ordered the seafood crepe. The crepes wer","useful":0,"cool":0},"5CZzGIrs2RMZuHvOT66QAw":{"text":"Love the look and feel of the restaurant, very cute. As for the food, I got the kickin' ch","useful":0,"cool":0},"JvHGR2J2NZ_RObyfXpL4MQ":{"text":"Great breakfast and amazing service. Took some employees to breakfast while in New Orleans","useful":0,"cool":0},"pX3RNw1Of64JdLnoTGcMhg":{"text":"The food was great and the service even better. What a beautiful place to start your day.","useful":0,"cool":0},"DkOoaLI8oigMgw2iXfqavw":{"text":"I was impressed by the look of the food. But when I went to put my fork in my fruit and lo","useful":0,"cool":0},"v2J_iS7IhfO-TZ_Ssum63w":{"text":"Best place for breakfast!  Very tastey, filling, and a great variety to select from. I had","useful":1,"cool":0},"rmUGNu7vpT37ePdwUneuIw":{"text":"If you don't try this spot...you're a fool!   AMAZING !!!\nFrench Toast is Great...service ","useful":0,"cool":0},"0qfJeOB6u5FA27KgTa53Yw":{"text":"Only opened for 3weeks, these girls have it going on. Very tasty food on a limited breakfa","useful":1,"cool":0},"TWJuuXcKYNlAr2ReHRC2ww":{"text":"Amazing lunch and breakfast. This place will not disappoint! Crab salad on Texas toast is ","useful":0,"cool":0},"yT24dbVGZAd4_OEpR_nJyw":{"text":"My favorite place in New Orleans. It gets busy, but all the ladies work hard to keep every","useful":0,"cool":0},"O0om3dQNL19J50PqaI-IUQ":{"text":"This food was delicious, and the servers were super nice.  We were visiting this city and ","useful":0,"cool":0},"3_SgY9X16jnOM8BWy7wNWA":{"text":"I went to this restaurant while in New Orleans . First the wait was too long the place is ","useful":0,"cool":0},"NdEiuPR-KE_Zfh2fOI_sfw":{"text":"If you're in search for a hearty delicious breakfast then Two Chicks Café is one of the be","useful":2,"cool":1},"IkDuDsSv2I0gBLMTiLndZg":{"text":"Delicious! The po-boy was amazing and the crepes were perfectly done. Staff and service we","useful":2,"cool":0},"RONBn8sPxUdFwn1FO2hFAw":{"text":"The Shrimp & Grits has the right amount of kick of spice to make it AMAZING!!\n\nthe Thai Sh","useful":0,"cool":0},"pyyPCIt1XouI6-XnhHpEpw":{"text":"Two words: Fantastic Food! The Kickin Chicken omelette with a side of Andouille Sausage wa","useful":0,"cool":0},"OEudfYcARuxMTeHj2F8Tqg":{"text":"Amazing! All ingredients were fresh. I thought i would get jalapenos from the jar. Nope th","useful":2,"cool":2},"2Jon5A5QG3v6lJld7nkUYg":{"text":"Food was good. The waitress seemed hesitant to ask the cook to make a meal gluten-free bec","useful":1,"cool":0},"XvrCOpMDQnH8yzWwquqkpw":{"text":"I get no pleasure resorting to harsh criticism.  My wife and I ordered a complete breakfas","useful":1,"cool":0},"6iw0mDuneWcDIXwjmN_RpQ":{"text":"Great food! Very fresh and unique selections like buckwheat crepe. Portion sizes are great","useful":1,"cool":0},"_1xKcgvClBhlE1ttWx4UQw":{"text":"Great location and athmospher, be prepared to pay upto $6.00 for on the street parking for","useful":1,"cool":0},"tkrhbMsUO2icKXcEnDAsiQ":{"text":"I came here during the Collision conference bc all the food cart inside were terrible. \n\nT","useful":5,"cool":1},"5doy7RMwkn71Y9C7QvlBOw":{"text":"Try the creamy grits, tell are really good. Under the sea omelette was a new take on the o","useful":0,"cool":0},"mMQBSF-kJqjWNbudYqFDvg":{"text":"Came across this place looking for kombucha and decided to get food too. We were very sati","useful":3,"cool":0},"VvQOi1H9jByFvI6is3nBUg":{"text":"Definitely a salad place to grab brunch if you're in the area but be warned that the ambie","useful":0,"cool":0},"en68F18V52d2X0NujpTqnA":{"text":"One of the best places for breakfast in the city! The food is always consistent and delici","useful":0,"cool":0},"nJ_JTp7cPrXzFygh6X7iKg":{"text":"Very nice place with a friendly weight staff, but the food did not sit well with me. I am ","useful":0,"cool":0},"2sH2u3_lHHjARkNLnnLnYQ":{"text":"Really tasty creole. Convenient to the convention center, and gets busy, so skip a session","useful":1,"cool":0},"v_OSPntcwJa1NihlMDJq6g":{"text":"Great experience, fresh food, fast service.  Highly recommended for groups four or less.  ","useful":0,"cool":0},"R21cd56S_QU49vOoUeI6lw":{"text":"Three breakfasts, two lunches over four days. Great food, super service.  Oh, and they pla","useful":0,"cool":0},"Hx4EsdxPsrZwmdRXBWkk9g":{"text":"Food is amazing, service is amazing.. Even the music is good! \n\nWe had the traditional egg","useful":4,"cool":0},"dHN1FBkL9Glf-xBtOKXadw":{"text":"Delicious. Just went here with two work friends during #kidneyweek. Great service, fast se","useful":0,"cool":0},"SJd5geytf0j6gAFZhfq3tg":{"text":"I found this walking down the convention center. We were staying at the Hyatt right in fro","useful":1,"cool":0},"cTi_Y_F9in_8gp5vMWzblQ":{"text":"First time and will not be our last. Great to find a breakfast place in New Orleans that h","useful":0,"cool":0},"qTt3mKyR8uzzgqI-dMJcBw":{"text":"A gem. Went back many times during my stay in the French Quarter simply because this place","useful":1,"cool":0},"IRwQkcs-dq-UUoKW27uHAw":{"text":"Was here for a conference and wanted something other than an overpriced hotel buffet. This","useful":0,"cool":0},"cz4_iOA5_5yXDdlYzhWPoQ":{"text":"Shrimp & Grits were 100% satisfying. Definitely recommend this cute, little gem.","useful":0,"cool":0},"3UJyX6zv9luzr6rToPq5lQ":{"text":"1st ever breakfast in NOLA. Mostly empty at 9:30 on a Tuesday so service was immediate. Or","useful":1,"cool":1},"XD9brJdWCorqD1IcmG80aw":{"text":"Great food, perfect for a quick bite. Very nice people. I got the chicken panini and it wa","useful":0,"cool":0},"_teiAHeS-XJdTdXhw4K1kQ":{"text":"Great healthy options and very conveniently located next to the convention center. I order","useful":0,"cool":0},"Lmic58ELMQg6E7gJt7t_Tw":{"text":"I don't understand the great reviews...not that great and there are much better places in ","useful":0,"cool":0},"S6OgXHyRoqgWbVeQU2LFKQ":{"text":"Awesome!!! Best grits ever!!!! Fast and great service. Everything we ordered was crazy goo","useful":0,"cool":0},"VQSbbC8Hk4fznuYjFg6H9w":{"text":"i was there for three days for a covention and had breakfast everyday and king of miss thi","useful":0,"cool":0},"lrKjydwtszO7DMDgJgZX2Q":{"text":"A little gem off the beaten path!  Fresh juices, packed flavorful omelettes, my Papa's Fre","useful":0,"cool":0},"FU9qcIxbhhvIVHzmBn06Iw":{"text":"This place is in my top 5 list of amazing breakfasts. I normally don't take the time to re","useful":2,"cool":1},"Wm_MzGRxTrqZQsj0dU5rTQ":{"text":"WOW! Food was amazing. Quick service and everyone was friendly. They even offered me a to ","useful":1,"cool":1},"3uZRpDYRLjSHbFhFCQQmVw":{"text":"Excellent menu. Delicious coffee. Food served extremely quick. I would recommend this spot","useful":0,"cool":0},"qyp1UEOHbrtaSmDrKt22nw":{"text":"Great breakfast, brunch and lunch.  Stumbled into this place and was pleasantly surprised!","useful":0,"cool":0},"NFNFw3iMscXbFPF-iMSq4w":{"text":"We visited just before heading to the airport. I'm so glad we managed to squeeze a visit i","useful":0,"cool":0},"w5wMaHGKw9NVIcP1LOaxlw":{"text":"Delicious food. Our waiter Daisy was very accommodating with our rushed schedule. They del","useful":0,"cool":0},"U4ZkMiNn_gJYrjX2-8dqJA":{"text":"The place looks old and run down from the outside but not too bad on the inside. It was ve","useful":2,"cool":1},"89mzzqf2Mw7bGNB8EnIIeg":{"text":"This is cafe is convenient to the convention center. I had the crab cake benedict and I wo","useful":0,"cool":0},"l33wrD2Yfz3oS4dqW0sh9w":{"text":"Have eaten here twice in the 4 days of visiting town. So yum! Service is quick and friendl","useful":1,"cool":1},"8rUbXwQYW5f-go4_Dl3alQ":{"text":"Had the eggs Benedict and a blue chick smoothie and everything came out perfect. Smoothie ","useful":1,"cool":0},"0hm_lP6rvJ9yu9Yok_11ow":{"text":"This pleasant little cafe is tucked away from the craziness of the French Quarter. The ser","useful":0,"cool":1},"CjXPtWj9VIO9EesT4RAvdg":{"text":"Absolutely delicious. There was a long line but we managed to get the last two seats at th","useful":1,"cool":0},"MA8FJXOMHRiXREgIM2iorw":{"text":"Funny story...Two Chicks was next to our hotel.  The first morning we stopped by and all t","useful":0,"cool":0},"o7APoMndWKP1nz5JyE4m_g":{"text":"Went here for lunch.  Food was outstanding!  Got the Thai shrimp Po boy and it was great. ","useful":0,"cool":0},"XdJy7ikxhJDjEDCdSiODcA":{"text":"Surprised by how much we liked this place! Chosen on the fly for a quick breakfast and tot","useful":1,"cool":0},"HlFxyDDH_f4V2RQgouiU8Q":{"text":"Just a short walk from the hotel I stayed in over the weekend and a group of 7 of us ate b","useful":2,"cool":1},"e4IHbLYC_JpbzMuA3MQYdQ":{"text":"I had the turkey panini and I really liked the fresh goat cheese and fig spread, along wit","useful":0,"cool":0},"Wc2t5cc6r0OhlWBP-Bkl0w":{"text":"Terrific breakfast- lunch spot with a nice variety of items for both areas of choice. Had ","useful":0,"cool":0},"Yx4CDgFZnvff3PrjwkDrmg":{"text":"Amazing food! We were craving breakfast but there isn't a lot of places to go. We found th","useful":0,"cool":0},"LSoqKe3CLfCzsMc3un0-HA":{"text":"Our hotel concierge had recommended this place for breakfast sandwiches and brunch.  It wa","useful":0,"cool":0},"9eMYK-3Cjo1RWJoxSlcK3A":{"text":"Not a bad place, but not great if you have specific macronutrient preferences or requireme","useful":0,"cool":1},"2uFXdB3F0tG64YXT2wTFKA":{"text":"Food and service were fantastic. We were seated promptly, ordered taken and food arrived s","useful":0,"cool":0},"CsPBPHUF1615HLsbjQURgQ":{"text":"Came here for brunch on a Saturday. Thought here would be a wait but was seated almost imm","useful":0,"cool":0},"RGr4hyP8Zng8AmcruAY2HA":{"text":"Had the 2 scrambled, sausage, fruit and toast with fresh squeezed orange juice. Fruit and ","useful":1,"cool":0},"Q1LMV90-0kCBBzbGuQqYqA":{"text":"The Papas French toast and veggies Benedict with hollandaise sauce was excellent! Sunday m","useful":1,"cool":0},"HYyy9ZaQm9MsE_2_6flOnQ":{"text":"Had breakfast here every morning while on vacation. It's a quaint cafe' outside of the con","useful":0,"cool":0},"OrMhdxzvnx1t9mJewLINng":{"text":"Delicious cute breakfast spot in the warehouse district. Highly recommend the crab cake Be","useful":0,"cool":0},"EkGrvBAvxINeFrkPMZgRVA":{"text":"Oh my yum! We knew the moment we saw the line outside that this restaurant was a hit! Fres","useful":4,"cool":3},"Jm3CtuXrjAEbJVZLDdE7zw":{"text":"French toast, dipped in cornflakes with fresh fruit & dusted with confectioners sugar- YUM","useful":0,"cool":0},"fVSnpb9K-ehg0OGh113t9Q":{"text":"Saw this place on the news and added it to my list of food places to try. We had a friend ","useful":0,"cool":0},"tec87IyM1K1gRQqRtvraog":{"text":"LOVE this new cafe! The food is very fresh and tasty, and the wait staff is friendly and a","useful":2,"cool":0},"vVWlG9ipxwgvqa1OOz9Cew":{"text":"Great food for an affordable price. This was so far the cheapest food we have found during","useful":0,"cool":0},"zoBUJPDbRan7jJ59G8ffdw":{"text":"I was in town for a convention this week and just ate the crappy food from there until the","useful":0,"cool":1},"k0vfXIrjHCJCIiccfxUusg":{"text":"We had an OK meal at Two Chicks.  It's a cute place, but it's right next to an open termin","useful":2,"cool":1},"KkXKF4fpRJvGCbUq-hZ1Yg":{"text":"Amazing food! We enjoyed a very FULL breakfast which was absolutely delicious!  There are ","useful":0,"cool":0},"4beIr7Tyz3dxOhe9PWTtRg":{"text":"This place is awesome. Perfect when you want a break from the heavy greasy food and actual","useful":2,"cool":2},"NdFaeYNnQHW2X9G2Ft5faw":{"text":"Outstanding breakfast across the street from the convention center.  We ate there 3 mornin","useful":0,"cool":0},"SJeOn-AkcXQ069SvywHtIA":{"text":"Ok sandwich and smoothie place close to convention center.  The veggie sandwich was expans","useful":0,"cool":0},"wt9MF9OZ4cTfKYEo81_t4g":{"text":"Everything was fresh and delicious! I had the veggie benedict with fruit. It was exactly w","useful":0,"cool":0},"Bqn8psEmvYTO7izrnGNgqg":{"text":"We tried this place on our first trip to New Orleans! It was super cute, first of all. The","useful":1,"cool":0},"TtNfM6AaoFlbipSc1cv1zw":{"text":"This place was adorable. The decor was cute and ecclectic... the breakfast sandwich was am","useful":0,"cool":0},"ujhZwcJ1NjYcRg1e9m3ayQ":{"text":"Great food great service. We are from Cincinnati and decided to take a walk until we found","useful":0,"cool":0},"bh9qBBQuH7K-35AEWE50gA":{"text":"Best breakfast ive had. Friendly and efficient service. Good food. Strong coffee. Their fr","useful":0,"cool":0},"piyuEORpA6tuyK2IUFKJfw":{"text":"This is a fabulous breakfast spot in the warehouse district! The Hatchery is a splendid pa","useful":2,"cool":0},"NRgEjH6qin6Arx438OZH4Q":{"text":"I was looking for a breakfast spot and came across this place and the reviews were good. T","useful":0,"cool":0},"yuWvFvurUO5uEZw708Jr1g":{"text":"I enjoyed this brunch spot! The French toast was delicious & the orange juice and grapefru","useful":0,"cool":0},"ulJFinIQtuz3FDe9R5YK3Q":{"text":"Super nice staff and bomb af food I could not recommend this place enough! If you are in t","useful":0,"cool":0},"yU2Z72f4f5_F6gYEOgvsbw":{"text":"Just ate brunch at Two Chicks, and I have to say that when they say \"whatever men can do, ","useful":0,"cool":0},"9g3rQ-I3lueTKc-N3yQzaQ":{"text":"What a trendy, fun vibe. The staff was so attentive and the food was delish!  Sad we found","useful":0,"cool":0},"yJuwcVnAQQw1E7AqQa7C5Q":{"text":"10 out 10 would not recommend. They packed five of us at a 4 seater, fine. After sitting t","useful":0,"cool":0},"ifT83fuH9O9jeABSqdO-PA":{"text":"I ate at the convention center my first day and it was horrible.  Two chicks is refreshing","useful":0,"cool":0},"6ah7i3wDorUf1_EdN13LfQ":{"text":"Food was amazing and the spot was really cute! Really recommend the breakfast and shrimp a","useful":0,"cool":0},"Z9a1UFPbdxtiFxgY4pLUHA":{"text":"We were in town for the Sugar Bowl and came across Two Chicks Cafe here on Yelp. We arrive","useful":1,"cool":0},"Py2-tKvlFCM_n2-C7ARWdw":{"text":"Very delicious and close to the conference center!! A great value for your money. The sala","useful":0,"cool":0},"kEPqtQwMHUJejHrjS8aZYw":{"text":"Cafe close to the convention center. I stopped here for breakfast. I had the crab cakes wi","useful":0,"cool":0},"185NXeTLWVupKBi5lMRgGg":{"text":"A must go to for breakfast if your out here. Crab cakes Benedict's and corn flake French t","useful":1,"cool":0},"P5LHV07zd6s26n-vmU3dpA":{"text":"Omelette you in on a secret. This is the Best. Breakfast. Spot. Eva. My family met here fo","useful":1,"cool":0},"4SqBHemQ4UO1ZvSmQJD5Dg":{"text":"Best breakfast place in the Warehouse District. Fresh squeezed juice and awesome omelettes","useful":0,"cool":0},"eMOw9Z7ZOgKjZ0hIul-H4Q":{"text":"This is a great place for lunch!   The omelet was amazing, the fruit was fresh and my co-w","useful":0,"cool":0},"XXZw1TfYLs-TUXhfFVZxAw":{"text":"Friendly, fast, and accommodating service. Delicious food. I only tried the veggies eggs B","useful":0,"cool":1},"iVNB3m_Dzc05ldM3HZjrsA":{"text":"Couldn't decide what to get. Everything looked good. Went with the cafe breakfast with gri","useful":0,"cool":0},"ygy5hW3owDyMzbI-3QWxXg":{"text":"I seriously love little independent breakfast places when I'm traveling and Two Chicks Caf","useful":2,"cool":0},"zGa9g8Yvv8H6VBQanHAvQA":{"text":"Way overpriced. The food was edible but salty. The omelets were nothing to write home abou","useful":0,"cool":0},"yyQ2Dn7QhUWTfIKY_clO-Q":{"text":"Great Thai shrimp PO boy Sandwich. Very nice staff and great service. Convenient location ","useful":0,"cool":0},"MFW7Ur1uQoKrLrEdmhUcPg":{"text":"Great Brunch on Saturday at Two Chicks Cafe. We stayed at the Hilton Garden and Suites nea","useful":1,"cool":0},"BXYZgVagYayLucf0-yzpsw":{"text":"Food, vibe, and service were great! My gf and I found this gem after searching for a nice ","useful":2,"cool":0},"TSyDW7HVhG0uyeCfvchKTw":{"text":"Delicious brunch and lunch option close to the convention center! The chicken club on jala","useful":0,"cool":0},"9LOmPUIq40jdz6_zZIcPSA":{"text":"Really nice spot for breakfast if you are in the warehouse district. The crab cake Benedic","useful":2,"cool":0},"a86sKbwUf509-C23ie9iDQ":{"text":"Not a bad spot to stop in for a quick breakfast if you're on the south end of the French Q","useful":1,"cool":0},"tvYAaRe_OtGsZQMTEo2nmQ":{"text":"I'm gonna give this place a solid 4 stars.\n\nSo this place is a great hole in the wall. The","useful":1,"cool":1},"56_sXxoOowV0AdYMQefnBw":{"text":"Great place to stop when at convention center and in warehouse district.  I had the chia p","useful":0,"cool":0},"105_IN4N3U2GEj8hTqZV7g":{"text":"Really nice cafe vibe. Great fresh juice. Not a long wait. Friendly service. I had the cra","useful":0,"cool":0},"q8KBuSDn8VHPQhV7ihOMqg":{"text":"Very friendly and helpful staff. I love the fact that it's run by women and it's efficient","useful":0,"cool":0},"onPMivEIPvMdvnJsazDoEg":{"text":"Wonderful breakfast and lunch spot!  Had the turkey savory buckwheat crepe and a side of g","useful":0,"cool":0},"fiEY6rAvc4mJj5W9kpEfow":{"text":"Great food and super friendly service. Randomly stopped in there for lunch during a conven","useful":1,"cool":0},"VX582ChR88vyjb_8znkY6Q":{"text":"Had a amazing French toast - was worried about being dipped in cornflakes but added a grea","useful":1,"cool":0},"jAbCTlac0IJfP4avGk6K1g":{"text":"Great portions, huge thick peices of gouda on their sandwiches.  Fruit as a side was super","useful":1,"cool":0},"Bu27HELU7rTmiTqsKNyA7Q":{"text":"These chicks put their foot in it!! I came to NOLA for a convention and the NOLA conventio","useful":2,"cool":2},"vqjrTNOlD86Xtz93jACQBA":{"text":"Service was slow and horrible. There were very few tables and we had to wait but were will","useful":0,"cool":0},"7zHA-xoxWI-tm8ErFHbXKg":{"text":"Great breakfast. Wish I lived here to go through the whole menu. I had the Chicken omelet ","useful":0,"cool":0},"hU1BYdEEks1f5ETC2Y3Skg":{"text":"We stayed at a hotel nearby for a conference and we visited Two Chicks twice. I really enj","useful":0,"cool":0},"dmpgNgYrp1sPPDSO92BUxw":{"text":"Update yelp. Paid for a pricey cab to eat at your establishment only to find it closed for","useful":0,"cool":0},"FHEQIooKUjsOQ0eg886RGA":{"text":"Wow!!!! We had crab cake Benedict and the under the sea omelette and both were fantastic. ","useful":0,"cool":0},"uWWkKVv8zH7Nn7aivDyC8w":{"text":"Went to this restaurant while on vacation everyday for our trip to NO. It was within walki","useful":0,"cool":0},"MuqczFwGtkTW0dbmFpWMXQ":{"text":"Came here for Sunday brunch before my cruise and had a delicious mimosa with fresh squeeze","useful":0,"cool":0},"AJfRC1Qf_NDNqsru-CTT4g":{"text":"This little cafe is the best breakfast/brunch spot in NOLA.  They treat you like royalty a","useful":0,"cool":0},"DiODb_ymZ42eP5RoLdIWbg":{"text":"First spot we stopped by in New Orleans right next to our hotel and it did not disappoint!","useful":0,"cool":0},"8f6Z2NLEGK5a7Hv73ihV8w":{"text":"Two Chicks Cafe is awesome. As a traveling California girl, I loved the atmosphere. The me","useful":0,"cool":0},"UTfvE4YQYOiOm-ehpLLGYw":{"text":"Love this place. Great vibe and service. Food is wonderful.","useful":1,"cool":0},"x04fz5Ci-WhV7wDOWq-U8g":{"text":"Packed due to NADA Convention, The staff did well managing the crowd and got creative by p","useful":1,"cool":0},"1GT6PAmx5DXTWw-6btyBsw":{"text":"Chose this place as it was an easy walk from the hotel on a Sunday morning and it had good","useful":0,"cool":0},"RUwVC-wdirmQw0uCaCrtpg":{"text":"Two Chicks Cafe is my favorite place to get brunch when I'm in New Orleans! It's very popu","useful":5,"cool":1},"hInWrvnpAEiD2hrUVYOsew":{"text":"Delish!! I had the belt and ice coffee! We went back a second day and got the Cajun eggs B","useful":0,"cool":0},"qjOEalFVXyTGNj1G4L66ig":{"text":"Awful service and unimpressive breakfast. Shrimp and grits came with overly spiced sauce. ","useful":0,"cool":0},"LQwFd-2lVyyaTWq1JsOLHg":{"text":"This cafe is a great stop if you are looking for a place to have lunch/breakfast! I was lo","useful":0,"cool":0},"OoeKZzJI71p8KyvA9bOXPw":{"text":"Delicious lunch and excellent, friendly service. Fresh, tasty and healthy food. Accidental","useful":2,"cool":0},"IjNrUlKiLL7kjUmc_cCb4A":{"text":"Great spot that some unique dishes.  The seafood omelet and crab cake Benedict are my favo","useful":0,"cool":0},"PD8Uh0VctmHXVXapi4_HUg":{"text":"I am tempted to go back to New Orleans just so I can go back here. The shrimp and grits...","useful":0,"cool":0},"tekdS3gpyM1Off9bN9EP5Q":{"text":"I just love this place, fresh juices, croissant with eggs, thai shrimp poboy... You name i","useful":0,"cool":0},"tMlosDTaKnM1UAqHihachA":{"text":"Really amazing food. Greatly recommend this place to everyone. We had breakfast there yest","useful":0,"cool":0},"P1m0q8D5EWJMSauhXPmdAQ":{"text":"Walked across the street from the convention center for a place to have a quick breakfast ","useful":1,"cool":0},"9LR2mr2Ut_JUxxDJZq5UIw":{"text":"OMG! This place is a hidden gem! Its a small place, but really worth the wait. There were ","useful":0,"cool":0},"ELwYQ4V8tmuqD7PZB-IXRA":{"text":"The waitress made sure we had a place to set and eat. The menu is not too busy to read. I ","useful":0,"cool":0},"VHxfNt-sv67LdgSABXE8ew":{"text":"Very good food and service, the poppas french toast was amazing! \nCame here after horrific","useful":1,"cool":0},"FDie9ceUUTkzdH-Raxf9-g":{"text":"Best Shrimp and Grits in NOLA!! My second time here and im never disappointed. The Nutella","useful":0,"cool":0},"EQ4SPYMJa-Rw3zVakr7EEQ":{"text":"Let me start off by saying this, I did not like my food but I don't know what the other st","useful":1,"cool":0},"WiMHeKCgzdL_lZiwniPzJw":{"text":"This restaurant is a great surprise and off the beaten path. The barbecue shrimp and grits","useful":0,"cool":0},"rJGcrW6UddppKenR5P8D7A":{"text":"Great place next to all the Marriotts. The coffee was excellent and the French toast is a ","useful":0,"cool":0},"-1K6J163X0aWceq6vjuSjg":{"text":"Stumbled upon this place while attending a conference across the street. Such a find! \nI b","useful":1,"cool":0},"AEO4NYkB6H0MvIGvAqXn-A":{"text":"Very good breakfast spot right across from the convention center. It's nothing fancy but t","useful":0,"cool":0},"3GtdNbxQNsOtFcKtIEr5_g":{"text":"Really good, I got the crab cake Benedict and the Green Blast juice. Refreshing juice, hea","useful":0,"cool":0},"jVz81Hq5UxZGjxo5ZGIlfA":{"text":"An amazing place to eat in Nola. Owners and workers are friendly. Food is so tasty and a g","useful":2,"cool":0},"ZdNXdas2N2IxIIu1Xu9jvQ":{"text":"Absolutely delicious! Great Gluten Free crepes and the staff is all extremely knowledgeabl","useful":0,"cool":0},"1S0wcdjMAysCYlZ5GT8Lnw":{"text":"Small little cafe. Service is impeccable and the food was amazing. I had a build your own ","useful":0,"cool":0},"XfzHtyuTKgeiRNA80e8RBQ":{"text":"Cute decor friendly service enjoyable breakfast place when visiting the area.  Would love ","useful":0,"cool":0},"uZks4iXSDoYWgFJ0QRhv9Q":{"text":"Yum! Great food and customer service. We had to wait about 10 min for a table. I would rec","useful":0,"cool":0},"F39in4J-XOjiKUYXuaY3dg":{"text":"Had their kickin chicken omelet and it was great! I would definitely recommend this place.","useful":1,"cool":0},"GBEPClr0BzPj3eWSPwLnjA":{"text":"Excellent place for breakfast.  Very boho lovely.  Fresh made juices, fruit choice for mea","useful":0,"cool":0},"PAALglJxgwLRuSR5saTjmw":{"text":"I went twice in one week and would've gone a third time if I could've. That's how deliciou","useful":2,"cool":0},"RFm6sJVnGCkfzc2_9eADbw":{"text":"This little place has a nice variety for breakfast and such a friendly staff!  My breakfas","useful":0,"cool":0},"N5gieG5paMeg0RlcN9R_ew":{"text":"A little respite of excellent and clean food in New Orleans. They have a Thai Shrimp Po' B","useful":2,"cool":3},"wZZhzZu--6EaTGvEW-dpWA":{"text":"My family and I loved this cute little cafe! Really nice inside and the waitresses were su","useful":0,"cool":0},"L67-ZcLbfhHu-khqN2kcKg":{"text":"Ate the shrimp n grits and it was amazing. Did not get 5 stars because we had to wait FORE","useful":0,"cool":0},"uUhsLHNS1Q03tOz0DF_UYA":{"text":"This spot is such a great find. Right next to generic subway sandwiches is this awesome pl","useful":0,"cool":0},"7mO0pGwy2PkIkC1pMcCamQ":{"text":"I found this place just a couple of blocks from my hotel and decided to give it a try for ","useful":0,"cool":0},"_le_QaWCqcoNU8QEnzCqgw":{"text":"This is my husband & I favorite breakfast spot when we both are off from work. The employe","useful":0,"cool":0},"5u0WaVIKVeSCQpdNSK90ww":{"text":"Went here on a Saturday morning around 8:45 before checking out the WWII museum. It was pr","useful":0,"cool":0},"64-BJU4Pj8Eh9fimYGUP8A":{"text":"I decided to try this place based on the reviews and location across from the convention c","useful":0,"cool":0},"mo3yvxv08GNqUO4F5NsHTg":{"text":"This was a true find! Amazing homemade food. The wait staff were friendly, eager to please","useful":0,"cool":0},"VmLhhpWEzeTA95ultnRfXQ":{"text":"Got right in. Great service. We had  the crab cake benedict, French toast and OJ. All were","useful":0,"cool":0},"CkHtPSAJBBxzoOdjtJozYw":{"text":"Favorite spot in Nola, very delicious but a tad bit far from tourist areas which makes it ","useful":0,"cool":0},"xhn58ePWwyuCGhp1cdkN_w":{"text":"Excellent service, Great food, good coffee.  First time in NO ans stumbled upon this place","useful":0,"cool":0},"_2DOe_eWfvEIc0kOvxsdbA":{"text":"Best breakfast of our trip in October.  Every single item we ordered was full of excellent","useful":1,"cool":1},"I0VhdOxBBXW1IJ_B0M1nJA":{"text":"The lunch was very good. I had a chicken panini. My husband had a Cajun sandwich. Both wer","useful":0,"cool":0},"LLqdLrJUUZM9L-jo08ulgg":{"text":"Quaint and cozy. The service was prompt and the food tasty. Today's lunch for me was the T","useful":0,"cool":0},"n3Jv2NYX_NYn9FwcOEidFQ":{"text":"Best breakfast wrap I've ever had!!! Amazingly cheesy and greasy but not too much. Perfect","useful":0,"cool":0},"jDJfK-WnPjM7a36tEPUfRw":{"text":"Food-4\nAmbience-3\nService-4\n\nMy grandfather wanted to take me out for breakfast while I wa","useful":2,"cool":0},"TrHAVHTpHWY7GMWRw_R9WA":{"text":"Yum yum yum! It was worth the one hour wait time. Everything was fresh and delicious. Mimo","useful":0,"cool":0},"EXw4UDPfPYyJ53wB7jhtOA":{"text":"Incredible food and fantastic service.  If you're at the convention center don't settle fo","useful":1,"cool":1},"ya_avBoXtLo2HTovYtLQLw":{"text":"I can't say enough about this place. The breakfast was quickly prepared and delicious. The","useful":0,"cool":0},"nCIKNXFYJtfXZrl-m-kgAw":{"text":"Great spot for breakfast. We were in town for a convention and wanted something close to t","useful":0,"cool":0},"L_E65QPsCcqlYoC8twMybg":{"text":"I wish I found this place day 1 of my 5 day stay in town....instead I found it my last day","useful":1,"cool":0},"kri5CFoSZSnJXY15gQk7yA":{"text":"I was at the convention center next door and not in the mood for a po boy but rather somet","useful":0,"cool":0},"JMN9XL2fHtUOqrIjrCH1mw":{"text":"I really enjoyed my visit the 2 chicks. They had this really cool old fashioned way of mak","useful":2,"cool":0},"D7oGyaFQ_XtYZKuD0EU3PQ":{"text":"A little more veggie than I like for my breakfasts, but overall great flavored food.  Frie","useful":2,"cool":1},"-cxe4lwCxFIiLhJywk26-g":{"text":"Food was pretty good for the most part. I had the chicken panini and the chicken was a tad","useful":0,"cool":0},"eVpCl8bdqkiYM9o2mzI0kw":{"text":"I was stoked to find a place with good clean food... Haha... The south isn't exactly known","useful":1,"cool":0},"2F01BIwJIN1wHI_X6qLNtg":{"text":"The food was well-prepared and tasty.  Saw this place on Yelp and decided to try it out.  ","useful":0,"cool":0},"RPJ2pY9cHxiBC6lryT2sww":{"text":"Great place! The staff was very friendly and the BBQ Shrimp and Grits were the best that I","useful":0,"cool":0},"OPYcEX06E5V8W4o82tDLqg":{"text":"Iron chick drink was the perfect balance, the beet juice was noticeable but not overpoweri","useful":0,"cool":1},"4GARoYRYRIwHPQ4g9j8TPA":{"text":"I know you F***ing lien! Yelp how does this place have almost 5 stars!! This must be a lis","useful":0,"cool":1},"wfWqyjdrXKa2sHQn1wtKXg":{"text":"Great place for breakfast right by the convention center you know.  Extensive menu and we ","useful":1,"cool":1},"hXZ-UY_CcFDpXiUsGWFfaQ":{"text":"First time visiting, the wait to get was about 10-20 mins so make sure to get here a bit e","useful":1,"cool":1},"ZpY5cVqxG5vsMH1SCoo-CQ":{"text":"Good breakfast. Prices good, food good just service is spotty. If you are in hurry I would","useful":0,"cool":0},"wgvcVZFzFrDRjlQVUuFfPQ":{"text":"We ordered 3 plates of shrimps and grits and a few drinks. Main dish was too sour and not ","useful":1,"cool":0},"0IFQKWkYQzsoQcecZxLwQg":{"text":"Forget pictures of the food. Here is the aftermath. Oops, they took my plate away too soon","useful":0,"cool":0},"XxWgE0FDa1dx7Fh-lTUX0Q":{"text":"I cannot say enough good things about this place! Went to brunch on Saturday during Mardi ","useful":0,"cool":0},"yqbf-sCH06drUUV-4PrKFw":{"text":"Great location across from the convention center. I was so in love with the breakfast sand","useful":0,"cool":0},"YWHMPbOu73gE8GfougprHA":{"text":"I had the BBQ shrimp and grits. It was amazing. Definitely worth trying. \n\nAtmosphere is l","useful":1,"cool":1},"_xOUoe9YQQuZnkkQWxlQ5A":{"text":"Wonderful breakfast! Cute atmosphere. Waitress was incredibly kind and attentive. Would ab","useful":0,"cool":0},"Q-1SQMFhjrYWxsEwCdtnOQ":{"text":"I would give this place six stars if I could! The food was FABULOUS! My husband ordered an","useful":0,"cool":0},"XyXlJCD29wAXTDWbuI68Yw":{"text":"Amazing breakfast and great service! The shrimp and grits were the best I've had by far.","useful":0,"cool":0},"eKzb7V9_TmNHn4YE3iXR2Q":{"text":"Great classic breakfast with nice and friendly service. If you're looking for a casual and","useful":0,"cool":0},"mS_GUv3TSHDGgpK3vVTTUA":{"text":"One of the 4 breakfast places we tried in NOLA! We had the Veggie Benedict, Papa's French ","useful":0,"cool":0},"V1jQbDsgZN-ES6OVxnrzIw":{"text":"decent lunch or breakfast spot in the convention center area. not much around thats close ","useful":0,"cool":0},"_xDlrcHG-Amugd51Oijomg":{"text":"Excellent veggie Binny the Cajun hollandaise sauce was out of this world. The only reason ","useful":0,"cool":0},"gjXqWpxHv1chuGLqfZznoA":{"text":"the flavor was so good - real crab meat in a gluten free crepe.\nthen the fresh juice saved","useful":0,"cool":0},"9fDtYWN1FpDDiqenFULrJQ":{"text":"I love this place! My first visit was for a late lunch after my conference. As New Orleans","useful":4,"cool":0},"Zokq_WgYhECCHs6nCuBagw":{"text":"Everything I ordered was beyond delicious! Corn flakes crusted French toast , cheese omele","useful":0,"cool":0},"M2xVnO6UcNYpK3Pt9rneuw":{"text":"Such a cute place. Welcoming staff and environment. I ordered take outs, while waiting the","useful":0,"cool":0},"hpu5ht_BA0wdaxHVR7RwMA":{"text":"Great food and service!\n\nWe ordered the Papa's French toast and crab cake benedict. The fr","useful":1,"cool":0},"tVHUJUpbi6KYSUmGMjggLw":{"text":"Soooo delicious. This was my first stop in NOLA and it was the perfect choice. I created m","useful":0,"cool":0},"9PZS33DDhf4yg9RDznpMDA":{"text":"Oh fuck yes, delicious but well worth the wait. Omelette was so delicious.","useful":1,"cool":1},"ep_mnvFayXB_89CBo0v82g":{"text":"Such a cute restaurant! I ordered the under the sea omelette and was quite satisfied! The ","useful":2,"cool":1},"HSME67hFzsgpBiKImrOHYg":{"text":"I have to hand it to this place. Absolutely swamped during lunch hour today and they manag","useful":0,"cool":0},"vGtqh2v2VtWAUSIlTbEUjw":{"text":"This place was close by the hotel that we stayed at! It was in walking distance and we had","useful":2,"cool":2},"UaQfBgjo-bV2tEduQsoh8A":{"text":"They use fresh fruit for all of their smoothies. I added a pic of them juicing said fruits","useful":0,"cool":0},"mcWVD_blj3YyDphM0LfOZA":{"text":"Food, staff and drinks are A+. 10/10 po boy bread was amazing. Hurricane was delicious and","useful":0,"cool":0},"bz82B1N2ePZJHZowDaDhMg":{"text":"Delicious food, bustling but nice ambience, and lovely, attentive staff!!\nThey even gave m","useful":0,"cool":0},"-VzDSkB_d6quWCK5LALngw":{"text":"It's a hidden gem....I stumbled at this cafe and it was worth the trip. I'm local so I kno","useful":1,"cool":0},"UdUHJwdl_s1upGkcT7bwgw":{"text":"Cute decor and atmosphere. Service was very friendly and coffee was hot. Good variety in t","useful":0,"cool":0},"anyUhevpimF-qbJA5flSng":{"text":"Went here while stopping in NOLA for two days. Upon arrival there was a line that we decid","useful":0,"cool":0},"oCaOYS7IKtNAUz3CFUpahg":{"text":"I wish I lived next door to this place. Came here two days in a row during a recent trip t","useful":0,"cool":0},"mVs8JZg-ZPatxOJPlRUxHA":{"text":"Best breakfast ever!! Delicious food that was tasty and prepared to perfection. I'm going ","useful":1,"cool":0},"jUwgXgKj6CJeSfmCEiCELw":{"text":"My wife was at a medical conference at the convention center, so I was always on my own fo","useful":0,"cool":0},"mIfVIufk7pazBI1XSNUDCw":{"text":"What a surprising gem this place was. We were starving and this was the only place around ","useful":0,"cool":0},"NJj9qFL4KZ8qfLep5E1w0A":{"text":"Stumbled upon this place by accident and fell in love. The quality of the food served was ","useful":0,"cool":0},"t7gZfya1G2pbVtD5WWkJYg":{"text":"I was very pleased with the food and service. I went shortly before July 4th and was seeki","useful":0,"cool":0},"sxO2hAKOmAEC2EZ8sxPX1Q":{"text":"Fantastic breakfast with a tasty green smoothie. Definitely coming back to this amazing pl","useful":0,"cool":0},"FNmw9jQuys60uzbB-KkOJw":{"text":"Awesome service . You have to find this place . Because of the construction on convention ","useful":0,"cool":0},"58yvL7WYcYoCmFNWVKd4mg":{"text":"Great service great food just wish the one location was a bit bigger. This is a fantastic ","useful":0,"cool":0},"qDFizhv5koLoF4XVFcIwxg":{"text":"yup! this place is legit. we ate here before a week long cruise. we ate here again about 9","useful":0,"cool":0},"-HQ1OIiGamaxPZ4BE3vwhg":{"text":"If you are at the convention center and want a good breakfast from a local spot, check out","useful":4,"cool":0},"LAYVRY-7SUSwvknDOY7nlg":{"text":"Great food. The omelette was delicious and fresh! The crab salad sandwich was a favorite f","useful":0,"cool":0},"WH0MWSKDZ3IyiFe68JcvTQ":{"text":"We had to wait like 30 minutes for a table but it was worth it! I had the egg, spinach, mu","useful":0,"cool":0},"q4ohqrm1qusYBgIwlKtyaQ":{"text":"Was in NOLA for 10 days for work and wanted to change up the breakfast scene and got tired","useful":4,"cool":3},"qJ_XyFfpwsWNyeGgibKqDg":{"text":"Went to the new location, just as good, if not better, than the original!! Food is great, ","useful":0,"cool":0},"mnJ2DT9ulvKIDwm_KK74uA":{"text":"I came here for breakfast one day, and it was so fabulous that I came back for lunch the n","useful":0,"cool":0},"SF1jU6O_vTrIPYWtNkDYuA":{"text":"When we were seated our table was still dirty and we asked to be wiped with a response of ","useful":1,"cool":0},"EnEhjNCTeYm6ejWOfxmxXA":{"text":"This place is a great escape from the convention center and bustle outside. Directly acros","useful":2,"cool":0},"Cf-V-VHWVWkDjAi5ArQxDQ":{"text":"Great spot for breakfast and brunch.  Small but comfortable.  Friendly wait staff. Good va","useful":0,"cool":0},"rXZ03VKebMzwVDZSoFgFvQ":{"text":"Great food and fast service. The waitress paid more attention to the cute young men, ensur","useful":0,"cool":0},"_cHbNAI7iC5aiwAkysrTEw":{"text":"Had the veggies Benedict and shared with my sweetheart in exchange for some of his French ","useful":0,"cool":0},"3FMgEWOzyLv1eCSDJddFEQ":{"text":"We stopped here while on a family vacation in New Orleans. The food was good but not the g","useful":0,"cool":0},"8GbCfAX8DjyRQjNZfgc1mg":{"text":"The line was long,about a twenty minute wait. Totally worth it! The food was all so good. ","useful":1,"cool":0},"i_MpHGmfd2yy1qhyklQFUA":{"text":"Our waitress/ the staff was really great. The food was large portion, especially for the p","useful":0,"cool":0},"VRVhDThMh3Cva7okGFMu2A":{"text":"Super busy at breakfast. I was there at opening and it quickly filled up, and now I know w","useful":0,"cool":0},"MvkWtd8EfOIu0LfNev8soA":{"text":"Both had the cafe breakfast was pretty good. The grits were so creamy and delicious as the","useful":0,"cool":0},"HNxvNCplX0B2sIsFCytd4A":{"text":"This is a delicious, amazing hidden gem in CBD. Amazing prices and portions, and the servi","useful":0,"cool":0},"syKsdrBYXOj4_GVz8V1cCA":{"text":"We asked at our hotel where to go for a great breakfast, and they suggested Two Chicks. I ","useful":0,"cool":0},"UkMVehXvcmM33TXFL3yOrg":{"text":"This is a great breakfast spot! The grits were the best that I have ever had! We were with","useful":1,"cool":1},"LAnAdcFKe3wc7r0ZZESGyA":{"text":"Outstanding food and service. Fresh food made to order. Great find off the beat and path o","useful":0,"cool":0},"WQN8jVXngqXdStgADFfHpA":{"text":"In town for WizardWorld and Two Chicks is always good.   Breakfast all day, nutella as sta","useful":0,"cool":0},"xuzoXFAO57vTDCsrC7sPyg":{"text":"Two Chick's is very close to the convention center and is a great place to stop by for lun","useful":0,"cool":0},"qcscCmzJDGOLaTnMrKCDRQ":{"text":"This restaurant was awesome. The 1st restaurant I've found that have gluten free options i","useful":0,"cool":0},"Cszkmr0hfU3tW5byVWrSQg":{"text":"I loved the juices and chia pudding! I went here three times when I was in town for a conf","useful":0,"cool":0},"tKBxET-g1iuLDnQbrrkE2w":{"text":"Kind of good food. But, very limited menu specially for kids. Expensive for the food they ","useful":0,"cool":0},"9KjVRaUcy8YHclOJ_KU8Ng":{"text":"5 stars for service, hands down. Our waitress was very sweet - exactly what I expect when ","useful":1,"cool":1},"GBQcTfQy9V3mJYrOwx81sw":{"text":"The BBQ shrimp and grits were amazing! Friendly staff and great drinks make it a worthy pl","useful":0,"cool":0},"rD9IdBAfdEbhxSQF5b_GpQ":{"text":"The food was good. Nothing to rave about to justify the wait time. It gets busy for breakf","useful":2,"cool":2},"2j4W_ccZYzrdkZaztRrQTQ":{"text":"Went to brunch here today and it was just ok. I had the upstream omelette with potatoes.","useful":0,"cool":0},"yaoqSUHPHPdKBU4h1VIXgg":{"text":"Breakfast is my favorite meal, and I'm always bummed when a place lets me down. Not Two Ch","useful":2,"cool":2},"sXMxn_IQ0PGJKVPiCYrH0g":{"text":"Probably one of the most amazing breakfasts I have ever had! The food was so flavorful and","useful":0,"cool":0},"0t84gGhzV9BsB9ySlClwmA":{"text":"This is an delightful restaurant! The menu is creative and every item looks delicious. The","useful":1,"cool":1},"_v6sRC7AOydhMQul-6pl1g":{"text":"Loved this place. It's in the bottom of the parking garage by FedEx and subway. We took a ","useful":0,"cool":0},"eBNd4zRIp1u73JQUfDJNvA":{"text":"Tried this spot for lunch when I couldn't take the convention center cafeteria food anymor","useful":1,"cool":0},"GW1wz6Nenyj-OhWH0tC1VQ":{"text":"Went for brunch with my Aunt ; she had a blueberry smoothie and an eggs Benedict, I had a ","useful":0,"cool":0},"E7sf1KMqh4y4T9StlfLc7w":{"text":"Excellent experience and service with Daisy. The Iron Chick Juice was amazing and tastes j","useful":0,"cool":0},"YhDornq_S8N34kv1JU-2aQ":{"text":"Shrimp & grits for breakfast!!! Place was great! Was there for a convention, we went out o","useful":0,"cool":0},"SgA5Gi0GgC7d4Jum8HlNeQ":{"text":"I liked the idea, but the menu was not to my liking. They offer very unique options.  I'm ","useful":0,"cool":0},"w2EFn21S8Eho1iIs7ofBOw":{"text":"This place is simple cafe that offers great breakfast with a reasonably price. They have a","useful":2,"cool":1},"hvMjR2BKHUtzpJJ3oFX0cA":{"text":"This place was surprisingly amazing ! Very small , very few seats but the wait didn't take","useful":0,"cool":0},"zfqNlSePqk87M5YjrQvzBQ":{"text":"Looked for a good breakfast place in New Orleans by the convention center. Found this gem.","useful":1,"cool":0},"Nxb-tGcFkJJLimeLWgmCJg":{"text":"Freshest orange juice ever. They have the coolest orange juicer that runs constantly. They","useful":7,"cool":3},"KSpv-CmDouXD-arRwDg0BQ":{"text":"This is a solid breakfast place. The benedict with creole hollandaise is delicious and the","useful":0,"cool":0},"Fv-t4GC72rqGvBfoDR2aCA":{"text":"Fantastic brunch!  We had both savory crepes and shared. Delicious!  Great atmosphere and ","useful":0,"cool":0},"ykVqb-qXCTtiEGseQFEewg":{"text":"Really cute little cafe with great service, yummy food and cute ambiance. My mom ordered t","useful":1,"cool":0},"e2V2Y-2M5i9zTT2T5W10Og":{"text":"A nice brunch/ breakfast spot if you are looking for something very casual, heathy-ish and","useful":0,"cool":0},"sQoWxCVx3FabbyA11IenaA":{"text":"Great little hidden breakfast place, friendly atmosphere and fresh made breakfast, with th","useful":0,"cool":1},"ABFuFatgJ-dLcfP4zxA9jw":{"text":"Finally found a place have some veggie and fresh fruits for breakfast! Recommend their veg","useful":0,"cool":0},"ukvQpypScamDaYojqVCNsA":{"text":"I went in for a late breakfast on a Sunday morning. I was seated immediately at the counte","useful":0,"cool":0},"vUMt_gShTPQ4Z287QWK7zw":{"text":"I was in town and looked online to find an establishment. It was well reviewed. What was m","useful":0,"cool":0},"PpOOCIXyXjDiePC65c7zpw":{"text":"The fresh juices are amazing, my favorite is the Ginger Sun. I had the Crab Cake Benedict ","useful":0,"cool":0},"YmDk0B9LovNEw28dvg4Y0A":{"text":"Cafe has healthy options for breakfast, including gluten free crepes. Had the crab and shr","useful":1,"cool":0},"w0twXU-UBba7pdeUoVXwUw":{"text":"The food was excellent and a lot of traditional options with great twists.   I really love","useful":0,"cool":0},"TvabOuq5WgLwKD5Rz0eI9w":{"text":"We tried this for breakfast since our hotel did not have a complimentary breakfast availab","useful":0,"cool":0},"55_BFkzNtLtg1S4bRpXlqw":{"text":"Amazing customer service. A must visit if your in New Orleans. The shrimp and grits were t","useful":0,"cool":0},"Fa9G6Pyl1Hj-nhccaM9FNw":{"text":"Two dope chicks of New Orleans was great. Service was top notch and the food incredibly.","useful":0,"cool":0},"xSt1GUd-ZiTubGE2LuaDkQ":{"text":"I had an omelet and grits... the best omelet I've had in a while. Went on the recommendati","useful":0,"cool":0},"M-s-slPZgRXMNa8CcdV5MQ":{"text":"A bright, cheerful and super clean little French restaurant. The service was excellent and","useful":0,"cool":0},"R9j29sSuV5P8atgWx0NDTg":{"text":"Very good food. The only complaint is that my wife's eggs were over cooked (ordered over e","useful":0,"cool":0},"8P5IroSGMKevTEY-XYqpxA":{"text":"My husband and I cone to New Orleans about every  4 to 6 weeks. This is the breakfast spot","useful":0,"cool":0},"3atWnkuXJ7n88Qz5UiomYA":{"text":"This has been my favorite brunch place in town. The mimosa was HUGE and delicious. My frie","useful":1,"cool":0},"NAnOR6_YLtyX2Q-avustkw":{"text":"First time trying this restaurant. Food was really good though they did run out of bananas","useful":0,"cool":0},"L3ZP7pZQ8gpOTw6HHIHmBQ":{"text":"So glad to have Yelp as a guide to good dining options in different locations. This place ","useful":1,"cool":0},"iBLlrf2BEzVFHcvr36uCQw":{"text":"I thoroughly enjoyed breakfact at Two Chicks Cafe...\n\nIt wasn't the easiest place to find ","useful":0,"cool":0},"SH_7OtSK9fwdu4j_UG7EwQ":{"text":"Excellent smoothies. Great customer service!\nThey pretty much have anything for everyone '","useful":0,"cool":0},"3Bo_wsFkf2fv25zuOeC_EQ":{"text":"Service was fabulous. Staff care that you have a good experience. Grits were so good I wan","useful":0,"cool":0},"6jH8GGnrP-A_e1XaBQp9-w":{"text":"Nice breakfast place near the Convention Center. I had spicy sausage, toast, eggs, etc. It","useful":1,"cool":0},"9uC6jivZUhJWpEKuFzPj-Q":{"text":"It seems that I'm in the minority based on the reviews but I wasn't that impressed with th","useful":0,"cool":0},"Mq9Op6kw48OE3Jq7zDMCng":{"text":"I live just down the street, and I really love this place for breakfast/brunch.  All of th","useful":0,"cool":0},"gkVNTxdYubY8k1MdSvgPuA":{"text":"I found the Two Chicks Cafe to be just ok. Needed a quick lunch nearby during a conference","useful":0,"cool":0},"vSVNLBHDe273BJykefUhvg":{"text":"This place is great. Awesome, clean food. The smoothies are great. And the staff is very f","useful":0,"cool":0},"9mJewIHfVpgTpxNBrVbiXQ":{"text":"Cute decor. The fresh squeezed orange juice came with ice. So ask for no ice!\n\nThe crepe w","useful":0,"cool":0},"6GMHEwP_71gcGCozuBz9wQ":{"text":"If you're looking for a nice break from all the heavy Southern food in NOLA, Two Chicks Ca","useful":5,"cool":3},"VCfgBGVy2mikjfuJ-HhAhg":{"text":"Found this in my way to the convention center it was ideal as it was quick, clean, and fil","useful":0,"cool":0},"QlHfj77Y3r6zPt0_xf3eig":{"text":"Found this place based on 2 thing. Yelp review and the fact we had parked our car in the F","useful":0,"cool":0},"VFaHwPzIK0SMr-_L8pSGIA":{"text":"Small cafe with friendly staff, always a line but it moves fast.  Tell hostess #in your pa","useful":0,"cool":0},"Ug0q1oLpLWCxlYFnF7ISdQ":{"text":"I went to this place with a group of 7 people for brunch on a Sunday. It wasn't planned we","useful":1,"cool":0},"qBFdHb-Qbr-sAU4HkVydKw":{"text":"Great little breakfast place! I want to come back and try several other things on their me","useful":0,"cool":0},"rbaTbQqLx0-G696oSJ0maQ":{"text":"Best place in town to treat those hangovers! We walked in to buy a breakfast fast sandwich","useful":0,"cool":0},"GgOWjPin5kjR6PLgtbW2KQ":{"text":"This place is so cute and hip! Love the decor, very friendly staff and delicious vegetaria","useful":0,"cool":0},"NAeBpD_1glhAlHD7PE69gA":{"text":"Great place for breakfast in the warehouse district.  There was a little wait at about 10:","useful":0,"cool":0},"C9FuyhKhj3m0JwnT-uIE4A":{"text":"Here again....  I am cutting and pasting the same review.  They remembered us!  This littl","useful":0,"cool":0},"6WfZRgZx7aXc6sZi4efvqw":{"text":"Food was so so, the location is pretty bad in that the restrooms are gross and not connect","useful":0,"cool":0},"0alOqfR1QAMdjLyhz_6WNg":{"text":"Went for breakfast and it was ok. I was disappointed in the potatoes that I opted for inst","useful":0,"cool":0},"yNxvCEz5gMTR-jyjX_M6Aw":{"text":"Two chick cafe is a home bass spot for us. We get our same seats and treated like family. ","useful":0,"cool":0},"txFIGrbCGnoBUJjzDFrYbw":{"text":"Never work a trade show in NOLA without at least one visit or more to this gem. Fast frien","useful":0,"cool":0},"03kTRmPkJ_xEVmdGrTEWrg":{"text":"Awesome Bbq shrimp and grits for breakfast, very convenient, and the service was quick and","useful":2,"cool":2},"bHNewasQ-0RS_qaqrXHCQw":{"text":"It's the best traditional breakfast spot within a decent walking distance.  Better than a ","useful":2,"cool":2},"hkbA2SJ6py9tMUu0aXuUyw":{"text":"Easy to get to from the convention centre. Service was initially great and food came quick","useful":0,"cool":0},"OK2xHf26xFJ80us-A_ROIQ":{"text":"My favorite breakfast. I'm a simple eater. I love basics and strawberries with bananas are","useful":0,"cool":0},"C41l2jiznx1EO9DeeA1IVA":{"text":"I love this place ... the food is amazing I had grits & French toast and mimosas ... I don","useful":0,"cool":0},"n_srz3opiAWOxuqeWFNS9w":{"text":"By far the best omelette and crab cake benedict we have ever had! Staff was amazing and of","useful":0,"cool":0},"KqzMfbMVzFjonmqxbMEugQ":{"text":"Nothing here blew me away, but the service was quick and friendly, and the food was quite ","useful":1,"cool":0},"q7oc5VsSDXWXsQNZ1SIPxg":{"text":"Awesome service and the breakfast rocked! Great place to go for breakfast. Will have to tr","useful":0,"cool":0},"cItMD34m1wAVzj3y3B2Y8A":{"text":"Food was solid, but this is not a destination. I came here on one of my \"rest\" days during","useful":6,"cool":5},"V4bTSWRTAGXWgeZDKH22ig":{"text":"Super cute place!! Food is fresh and reasonably priced.\nIt's the perfect amount of food!! ","useful":0,"cool":0},"buG6smulNvNztk7b9W5HnA":{"text":"The omelet was fire and the mojito was on point. Really good food especially for a random ","useful":0,"cool":0},"RQ3rR5sQ2Cyc4B68p0oXCQ":{"text":"Great place to eat small but mighty. Service was great food was excellent. My favorite was","useful":0,"cool":0},"bZRtWHwjfwW_tN2gjXrvuQ":{"text":"Cozy, quaint and eclectic! The French toast was amazing!!!! The veggie Benedict was good b","useful":0,"cool":0},"3DARPX88Yr8nI2Q2OaAsiA":{"text":"Just went there for lunch and I will definitely be back. All of us ate every drop of food ","useful":1,"cool":0},"UlXnHnRDKmFbHmhFFQ-Ceg":{"text":"Enjoyed breakfast here on the advice of a local colleague​.\nI'm in town for a convention t","useful":0,"cool":0},"38kVb63A8ZxFLgg3LLlu1A":{"text":"Favorite of the weekend. They got my egg order correct!!!! This rarely happened and the fo","useful":0,"cool":0},"IDrxBImkMQwKxoOvWYxfKQ":{"text":"We loved this cafe so much we came in twice during our trip. Cool little cafe located acro","useful":0,"cool":0},"yH0iWDL47KuM8XF3Cro1GA":{"text":"Healthy options in this cute cafe.  I had the turkey crepe and a green blast drink.  Both ","useful":0,"cool":0},"C9xzwmAJPaRoOvmc6jyRbw":{"text":"What an amazing brunch spot! There are lots of vegetarian friendly options on the menu. Fr","useful":0,"cool":0},"V5xf3kHgBVRYCIhLLN4JvA":{"text":"Decided to try this place because it is very near the convention center.  Came in 8 am on ","useful":0,"cool":0},"eVd1CKImMNMTDl0FeoZHeg":{"text":"Cute little place. Our waiter Carla was very nice and attentive. The food was delicious to","useful":0,"cool":0},"2tElV6HHOckC54pyQUzY5w":{"text":"Fantastic breakfast! French toast dipped in corn flakes...yum! Plus, a really great server","useful":0,"cool":0},"QkL-qC4u_0jfSVhWe88Vrg":{"text":"This was probably the best breakfast place I've been to in a long time. Cozy cute cafe wit","useful":0,"cool":0},"ZYMiOPOhStYjuPz87DJnAA":{"text":"Absolutely loved it...make sure to try the french toast and the freshly squeezed juice...1","useful":0,"cool":0},"2DYAeh_eSN-vhwAZBvhrmw":{"text":"Great great food!! This is a must visit place in NOLA for great brunch. I ordered the \"bui","useful":0,"cool":0},"rW-S9k_Ve5jV_wEdNP1uQA":{"text":"Great food! Best French toast I have ever had! Cute quaint place.  Came here 2 years ago w","useful":0,"cool":0},"BQhiHzYI4YY6xjIsdR9SOw":{"text":"The Creamy Grits got me the Pancake was fluffy and delicious, not all places make good pan","useful":1,"cool":1},"SOwsnONha-x6dDwFwTmNcQ":{"text":"Small business off  Street .Get there early as it geys crowded. Breakfast dishes all fresh","useful":0,"cool":0},"Iib96IhvHGRXUfI_eX6gig":{"text":"i discovered this place thanks to this app and let me tell you, I went 3 times! Had the op","useful":0,"cool":1},"LN85wZX2l24yX1L8YE6s1Q":{"text":"Loved this place! Delicious foods for breakfast and lunch - visited two days in a row. Cof","useful":0,"cool":0},"KsBCJHbh3kXBrXakJmGZEg":{"text":"This one is more like a 3.5 - but the service was spectacular so I nudged it up. \n\nHad the","useful":1,"cool":1},"U2WoKxGUK7ol5TWxXQdLGQ":{"text":"This place was walking distance from our hotel. The outside of the building is not appeali","useful":0,"cool":0},"Dc8uDYNHrKM6rwumpErDJA":{"text":"The veggie Benedict with the Cajun hollandaise sauce is absolutely AMAZING!! Whenever I ea","useful":1,"cool":0},"2yM7X3QGXywfGsY9-VOwOQ":{"text":"Our breakfast was AMAZING...  fresh and healthy! Service was fast and friendly too. Would ","useful":1,"cool":1},"APK1zRI8YITNTbn6opcb0A":{"text":"Yummy brunch and awesome service. We had turkey crepe and breakfast plate. We will definit","useful":0,"cool":0},"fUs0h2MjY5QbsjnSBFyMeQ":{"text":"We managed to stop in here for brunch as it was just a block away from our hotel. The coff","useful":0,"cool":0},"gNJIsVpKDKvH7suewgNU6g":{"text":"So glad we found this spot. I really wanted to maximize my New Orleans experience and try ","useful":17,"cool":20},"RIruhrYlqAD-FQXVmrO29g":{"text":"Had a delicious breakfast here with my family. All their juices are fresh squeeze and good","useful":0,"cool":0},"xpkspn7qbNVOd4pr-D6byA":{"text":"Only a 20 minute wait on Saturday morning - that's something. The omelets are worth waitin","useful":0,"cool":0},"5SHS-q4ZStJT4dSgKNebiA":{"text":"Was recommended by hotel staff checked it out since it was near. There was a wait, didn't ","useful":0,"cool":0},"NtjW-FGy1PQ5T7SbX795Zg":{"text":"The omelettes were great.  I got a veggie one and my boyfriend got the seafood omelette.  ","useful":0,"cool":0},"ozFeNKcOebD7d9v6tW5SWQ":{"text":"Best place to go for brunch! Very cute and eclectic place to go. My friend and I walked ab","useful":4,"cool":1},"Vw5UUIrSeHTbh0PIfZKHfg":{"text":"We came here and got breakfast to go as we were in a rush before a tour. We got the Hatche","useful":0,"cool":0},"smZd8bJ57awn9MDHjlv3OQ":{"text":"Best bfast IN TOWN hands down!!! Staff are all amazing and work hard to make a great atmos","useful":0,"cool":0},"1j7fydgtG1-77rMJg2IVKA":{"text":"Recommend the Kickin Chicken Omelette over Crab Cake Benedict... it was prime time. Also g","useful":0,"cool":0},"KMDgVsACrmed6tMEDT33Sg":{"text":"Super delightful place hidden in an unlikely corner of New Orleans! For those in the mid-S","useful":2,"cool":1},"eQjRvvBhJ5jQPY212Vppow":{"text":"Food was very tasty and conveniently located just a few steps away from the convention cen","useful":0,"cool":0},"j21ELPRHCMc2yDBWIjNTmg":{"text":"It's a little embarrassing to admit that of the four mornings I've spent in New Orleans on","useful":0,"cool":0},"neffD8ORSCdQ-CvM46qKVQ":{"text":"After reading the reviews we decided to get up early and be there by 8:30 on a Sunday. We ","useful":0,"cool":0},"-bDmGo693gdkSoVV1muEQw":{"text":"It's conveniently located across the street from the convention center and perfect for bre","useful":1,"cool":1},"2Su0h2Hj3vWYsJvYEs-g1A":{"text":"A really great breakfast with fresh squeezed orange juice and apple juice. A great price a","useful":1,"cool":0},"LSdJw4tOFBmr30FKGKGJbg":{"text":"We just dropped in to try to catch breakfast/brunch without a long line. We were happy to ","useful":2,"cool":0},"NLjDczPctmO9JjG71rKmLw":{"text":"Great breakfast location! My brother found his  French toast really good. My niece's panca","useful":0,"cool":0},"DW-fOD9LmUzriNdibh9z_Q":{"text":"A*M*A*Z*I*N*G ..... I came to NoLa for a music concert. Got in a little earlier than my fr","useful":2,"cool":1},"xJ2pUQNKScyZW6Vw07M5SA":{"text":"I had the make your own omelette with toast and grits. When I tell you that the grits were","useful":3,"cool":0},"RNlnVvEERoqXfoaV_evBDA":{"text":"Both my wife and I had the under the sea omelette with a side of fruit. Very delicious and","useful":1,"cool":1},"HH9A0hWFLg0pbCdrAj6qhA":{"text":"Cute place. Good food. Inside a building that houses a hotel. A few different items on the","useful":1,"cool":0},"UolOIIDwlZkb6-jhd2zrKQ":{"text":"Food was okay, our waitress was terrible and not friendly. Wouldn't go back, mostly becaus","useful":1,"cool":0},"7xKmk-lduAV8a-nmBCWc8w":{"text":"Cons: This review is based on experience. We went on a Sunday morning at around 11:30am. T","useful":1,"cool":0},"S_Jn2zcLvVtHBvcVdkPJ2A":{"text":"Really good food but get ready for a line.","useful":1,"cool":0},"Z3Yip9goR7YK9bq7lWesfA":{"text":"After a night out in the city and waking up late, I wanted breakfast food. I got in Yelp a","useful":1,"cool":1},"ZHk255kG62cOnKpDQ1YP1A":{"text":"I'm 74 years old and love eggs Benedict.  I've eaten hundreds and can say without reservat","useful":0,"cool":0},"InnuhK3PybThkj-DVZkEUA":{"text":"DUUUUUUUUDE. Dude. This shrimp and grits is now on the list of best things I have ever eat","useful":0,"cool":0},"WU1moWpmmm-JMmF28j2xJg":{"text":"This is a really cute cafe with amazing service. The French toast is to die for so get it!","useful":0,"cool":1},"tiHv2xfaY8XXUcSnyiQVKw":{"text":"Total hidden GEM.  Amazing food, staff, ambiance.  This will be your favorite place for br","useful":0,"cool":0},"OJiM-pVYNt6dgNgaE32XBg":{"text":"This place doesn't seem like much from the outside, but it's a hidden gem. There was a lot","useful":1,"cool":0},"3o3zZsSwG72yUNbnZlg45w":{"text":"Very good experience. Ended up here after a bad wait experience somewhere else. My group o","useful":0,"cool":0},"nVOiPMlAomD3GWeJ2o_XRw":{"text":"This place just happened to be around the corner of where we stayed and I'm so happy to sa","useful":1,"cool":0},"C4nzHQa9FcJvIOJZswNG6w":{"text":"What a fantastic breakfast spot! Had the Hatchery and what a great combination. My waitres","useful":0,"cool":0},"vTCSj7q-YOG8IpXEKoxUcQ":{"text":"I love this place!! I ate here every day for two week when I was working nearby. They have","useful":0,"cool":0},"s8RcSMHD-i30m7kvGjiicg":{"text":"In a city full of fried food and lots of new eclectic (rich) cuisine, we were looking for ","useful":0,"cool":1},"VW84CAEINILNcC8LGxnjFw":{"text":"Great spot after getting off the cruise ship. Excellent eggs Benedict, omelette, iced tea.","useful":0,"cool":0},"m95R7riOH32oyNFN2zXR1Q":{"text":"Okay this place is a.m.a.z.i.n.g. the food is delightful the service is amazing and the wa","useful":0,"cool":0},"7AoKBiVvur0rKl72dk0G3Q":{"text":"We ate here for lunch after sleeping in late after the Sugar Bowl. We enjoyed the food and","useful":0,"cool":0},"E3Y9vM8__rpPg1_tN4nZeQ":{"text":"Delicious breakfast. I'm glad to find this hidden gem.\nThe smooth jazz music played over t","useful":0,"cool":0},"QsFTR2frKSwNmnRYkW4tOA":{"text":"I got the belt eggwich and really liked it. The bread was nothing special, but there bacon","useful":2,"cool":1},"2MSsZQ-HGP6hE7q_BiLUNA":{"text":"This sweet, unassuming cafe right across the street from the NOLA Convention Center is pro","useful":1,"cool":1},"XgwX3lHr4SfJzkevDWQ59A":{"text":"Service - worst I've ever had. I went in a group and no one came to greet us or tell us ho","useful":1,"cool":0},"2eyFGLC2eHV0_SvHHDSVog":{"text":"Came here right from the airport and had the crab cake Cajun eggs Benedict- TO DIE FOR!!! ","useful":0,"cool":0},"1VAmAfl6kiyJJ6sMkaCCcA":{"text":"It's a hidden gem....I stumbled at this cafe and it was worth the trip. I'm local so I kno","useful":0,"cool":0},"4MU6iV8snDpYR6bqxgP68w":{"text":"Great, local breakfast option if you're in the vicinity of New Orleans' Convention Center!","useful":0,"cool":0},"xocQcen6Tgh9JP6Nlllr_A":{"text":"Hello this was our last day as a family here in NOLA, we should have eaten here earlier. T","useful":0,"cool":0},"nFeFyTGfjpmg3yWkQd6mAA":{"text":"Everything about this place is amazing.  Crab cake benedicts, bloody Mary's, juice, chia p","useful":0,"cool":0},"HP9c1z-u-D1mRkPjLJBlKw":{"text":"Simple and sweet place with good food. Serve was quick and prompt. The smoothies looked go","useful":0,"cool":0},"my1-i6MrZ2grF5T42t3s-Q":{"text":"Great food and atmosphere.   Enjoy a Pimms Cup made the right way with some Cajun crab cak","useful":0,"cool":0},"YKLgscRB6EWcP0m_OmUEkQ":{"text":"Amazing! Mixed party of 8, adults, teens, and youth for breakfast. Entire party was happy ","useful":1,"cool":0},"kUiN5joqvMDAGSJYz_xkKA":{"text":"Delicious. Came here either my friend for breakfast. She had the shrimp and grits. I got t","useful":0,"cool":0},"3R68j-FRE9a4tCcscbq8oQ":{"text":"Breakfast was great.  I ordered the Crab Cake Benedict and it was absolutely flavorful.  W","useful":0,"cool":0},"3OHYxL1u28Q_L2OuzSrOfA":{"text":"Great little Cafe. We stopped in here after driving 3 hours to New Orleans. The staff was ","useful":0,"cool":0},"1wc16aI6xJYQ-np2pG5NUA":{"text":"I love brunch in New Orleans, and Two Chicks Cafe is another brunch spot I'm adding to my ","useful":11,"cool":5},"e_1nkkC4MMMf4168NPu5Kg":{"text":"Do it. Seriously. Husband and I went this afternoon and this is what we ordered: barnyard ","useful":1,"cool":0},"VM5OhalHy3x47nuSC-zy_A":{"text":"The breakfast is great! The grits are amazing! The under the sea omelette was my favorite!","useful":0,"cool":0},"Bb4ih_kij9r6-oznBz0kgw":{"text":"This cafe shares an open space on the ground level of a big downtown building near the con","useful":2,"cool":1},"sKJMK1QfMGq1yhO4i0xQ1Q":{"text":"Last minute decided to go here with a couple friends!  The place was a lot smaller than I ","useful":0,"cool":0},"QUCUGBu6h0BmMOEEyxGjAg":{"text":"I was really excited about trying this restaurant! We actually stayed downtown during this","useful":2,"cool":1},"Law2C20By12zbf8u6BoQSg":{"text":"We had the Under the Sea omelet and Papa's French toast. I love places with unique flavors","useful":1,"cool":0},"8eY_ddTux2mvRL6Zsw1Aww":{"text":"Fantastic new local cafe across from the Hyatt Place and Convention Center. Great for brea","useful":1,"cool":0},"I2IvreX5xPlAB5Sic5kIFg":{"text":"After having a stressful morning getting my rental car from Hertz, the wonderful experienc","useful":0,"cool":0},"TbvO1iaZ7c-Q4Y8FleIFuA":{"text":"Loved the crab eggs Benedict and I don't even eat them that way typically.  You may have t","useful":0,"cool":0},"5Cf2q8XPXqCyspNlapktKg":{"text":"We were running super late to a ticketed event and realized we needed to get something to ","useful":0,"cool":0},"ScLGWXevOMLNqR9F0od25A":{"text":"Burnt toast. Burnt eggs. Cold awful potatoes. Took forever. My nine year old makes better ","useful":0,"cool":0},"Zi3cNY6a2xycLVcTejtAuQ":{"text":"Had a wonderful brunch experience. The service was fast (not many people there) and the fo","useful":0,"cool":0},"Giv2B8uMv3FDSZq8NJ8ekw":{"text":"Great food but I was really struck by the great service.  Everyone was smiling, nice and a","useful":0,"cool":0},"kOoVNsn8aTqdVR_F-0tSzA":{"text":"Unreal! This place is a total sleeper in the CBD. Best brunch in the city in my opinion. W","useful":0,"cool":0},"7x9ge0-Xd5P2VVUTKEalOw":{"text":"Good food, despite some of the other reviews it was a pleasant experience for my husband a","useful":0,"cool":0},"-6JixFnx8qhzaGt2_AWFtA":{"text":"Mixed reviews about this place. The veggies Benedict was awesome but the side of potatoes ","useful":1,"cool":0},"dSJ92aRuQ7whA-hFiu2Olw":{"text":"Great food, but our waitress was busy with a big table and all the other wait staff comple","useful":0,"cool":0},"ZT0s3q-UbYtpsFAyl9txEw":{"text":"Had breakfast and it was great. The service was excellent and so was the food!  I would de","useful":2,"cool":1},"oWqOJWXtmANXg6U59tjadg":{"text":"Best grits I've ever had! Everything is so fresh and flavorful from the entrees to the bev","useful":4,"cool":3},"i6gGLTg3LJp_wAlnoWCCvw":{"text":"My family and I were visiting from San Diego and Connecticut and this was our favorite spo","useful":0,"cool":0},"jha78SE5PkhuLH8itZfNMA":{"text":"We had a great breakfast two mornings in a row.  The location was very busy, but our servi","useful":0,"cool":0},"ga09S87FR2orkFvhJEhR3A":{"text":"I got my good delivered so I didn't actually get to go. Tho I vaguely remember physically ","useful":0,"cool":0},"nMIOPmdK3KayS3jfWpTFBg":{"text":"Pretty great food and service! Service was great. I had no issues here. It was a pretty gr","useful":0,"cool":0},"bF5nhihWRqPV5csqb6Qlfg":{"text":"Smile, smile , smile... when your first meal of the day is awesome. Good java and natural ","useful":0,"cool":0},"8NAdCqnt3AHeQ9xN-dIn3A":{"text":"Outstanding breakfast! Be prepared for a wait - it's not very spacious but worth a wait. S","useful":0,"cool":0},"vAzqX-wbO9ER8v4VwEmPvA":{"text":"My husband stumbled upon this place and I am so glad he did. There are two locations but w","useful":2,"cool":1},"TP8XtJqeC3Hx48Zc6BLiYA":{"text":"Friendly staff, quick service, fresh food, good-sized portions.  Great place for brunch or","useful":0,"cool":0},"ej1LnMvF1GUmU9Vu1njikg":{"text":"Amazing small and inviting place. Service was excellent, they are fast servers and nice am","useful":2,"cool":1},"6gpAo1XK8xE6zmIDLGIlpQ":{"text":"I was in town for a convention, and had breakfast here my last day after slogging through ","useful":0,"cool":0},"vvivlxJrwqoNtlVYoneg8A":{"text":"Great food tucked away in a small space. Atmosphere was great , customer service was amazi","useful":0,"cool":0},"AHUrQ9-k3VRB7C0l1TY-SQ":{"text":"Such a cute local brunch spot. Food was amazing and so were the cocktails. Short walk from","useful":0,"cool":0},"pm4vk1ETN8rcqzvu_8DeMA":{"text":"Doesn't look like much from outside but this cafe is so cute! Let's start with the drinks.","useful":0,"cool":0},"uMzlxSrDNUihv8JaKS3bCg":{"text":"4.5 stars.  Thanks to Yelp I got breakfast here one morning while at a conference.  The Be","useful":0,"cool":0},"qm6vgG4Wn6UPla3BTyt8dg":{"text":"Looking for smoothies in New Orleans is hard - but I did it!\n\nI really want to ckme back h","useful":1,"cool":1},"gQ0_pamTB-P6HQZ9c6sCOw":{"text":"We stopped in on our way to Mardi Gras World. It's in an odd location near the convention ","useful":0,"cool":0},"TCdH3OH_jYmx70OIXGXTRA":{"text":"Oh yum! The crabcake Benedict was delicious and while the fruit might be a nutritious choi","useful":0,"cool":0},"q9LI3bFHZ7L4B2qVh2GL1g":{"text":"So we decided to start our three year anniversary off here with some good breakfast, great","useful":2,"cool":1},"eyNbqRThOnbJe5SE78kTSQ":{"text":"Food was great. No long waits. Waiters coat a little more attention to the table needs. Ha","useful":0,"cool":0},"rG7-nt_2Ergc4yDG-rF5sA":{"text":"First, we waited for 15+ minutes for someone to acknowledge us. They walked right in front","useful":0,"cool":0},"VBdzsTqxSuBmAYZgPp7d8A":{"text":"French toast dipped in corn flakes were really tasty!  Traditional eggs bene very good too","useful":0,"cool":0},"d9pIOFtduZHVlx_fE6CkJg":{"text":"This was a great breakfast spot! It's small so there is always a wait for seating. We sat ","useful":0,"cool":0},"6245cQlo-N5xC3Vpq_IVEw":{"text":"Nice cozy environment. Nice menu selection, friendly staff. The french toast was very good","useful":0,"cool":0},"F-PKt_lfqVdts5pxi5pjCw":{"text":"How blatant can a business be to NOT be open during the Essence Festival 2018. Evil begets","useful":1,"cool":0},"9mNY-LkMM38YxHESaAzTaA":{"text":"This place was close to our hotel and had great reviews. It exceeded our expectations in t","useful":0,"cool":0},"jkh_Ukw2QmBTmpRMytoqEw":{"text":"Considering the line, got in quickly and enjoyed a vegetarian buckwheat crepe, a side of p","useful":0,"cool":0},"zHdnr9nhhMFYaLM0zNdJIA":{"text":"Great find during our visit to New Orleans! Worth the wait in line...yummy breakfast optio","useful":0,"cool":0},"_djP-l_Cbr6tt7j3j_5B-w":{"text":"Everything was fantastic. Great atmosphere in a space that has a lot of character. Service","useful":0,"cool":0},"hcG8wq0k6Qy7EItLtO6G6Q":{"text":"Another late, late post. I've been to this location twice and once to the other. If someon","useful":1,"cool":1},"SLRSshVeEKFmV5s3uFhYNA":{"text":"Best crab cake Benedict ever! Bloody Mary was awesome as well!! Highly recommend!! Everyth","useful":0,"cool":0},"7gH-bTwFDHp096xYDD9kyg":{"text":"This Hidden Gem omg Heaven please don't judge this place from cover HEAVEN good good good","useful":0,"cool":0},"hJYg32oG--L74KTNOxxVFw":{"text":"Tucked under an office building, I was delighted by one of the best breakfasts that I've h","useful":12,"cool":12},"XjYyMxOJs9Mq9v5iH6SV4g":{"text":"The line moves very fast the service was amazing the shrimp are not fried so be ready for ","useful":0,"cool":1},"adXIUne4tYBju6TxKxiyVg":{"text":"This is easily one of the best breakfast meals I've ever had.  The french toast was awesom","useful":2,"cool":2},"BDdptQ1OYr3wo6FHr9nQiQ":{"text":"I felt let down by all of the reviews I've read. The food was just \"meh\" and the smoothie ","useful":1,"cool":0},"x5B5NidF3om0043rYmeAqw":{"text":"OMG this place was absolutely awesome !!I had the veggie omelette a side of andouille saus","useful":0,"cool":0},"a6i53UvtNOOIpcx5I7J5Tg":{"text":"Cute, small place with great options! The Crab Cake Benedict was delicious! The bread it w","useful":0,"cool":0},"kSz1BWX50pd-qzlViXdysw":{"text":"The food was great. The server was friendly. There was a wait before we were actually addr","useful":0,"cool":0},"kfeLGr-9PdJmTldQ9CTRdw":{"text":"Cute, quaint little spot for breakfast. The wait was long (40mins), but after being seated","useful":0,"cool":0},"xEQV3oUyqo_RVAjoBEKncw":{"text":"BEST BREAKFAST IN NOLA!!  Love this place! Service, food and atmosphere is perfect! We go ","useful":0,"cool":0},"sZ4xMkNMZi8FhI1O43iNwQ":{"text":"I had the \"make\" your own omelette, hot and very tasty. Waitress was very friendly and Ser","useful":0,"cool":0},"9cKIpuvgLj-Zts4mVSdAZA":{"text":"The French Toast was very good. I also enjoyed the fresh squeezed orange juice and friendl","useful":0,"cool":0},"0V3sEVemfTnsBx1yEDg-vw":{"text":"BBQ Shrimp & Grits are beyond AMAZING!!!! I wish they could ship them!! We are here almost","useful":0,"cool":0},"WhzXUoMOKywQGW6QqPb8Nw":{"text":"I ordered Uber eats and ask for ketchup and utensils.  I got nothing I order pancake and F","useful":0,"cool":0},"Uu7K_0QBFHN_6Kqbp1Zolg":{"text":"Went to Two Chicks for brunch and it was DELICIOUS! I got the traditional eggs Benedict an","useful":0,"cool":0},"NNnBsnOzNx2FPX6XOacwsw":{"text":"It's a great place. Been here two days in the row and food is always tasty. The staff is a","useful":0,"cool":0},"wKrVaciBM_Wlv7-x2jncZQ":{"text":"Super good & great price. I would've liked to try more than just breakfast. I had the chic","useful":0,"cool":0},"Un7Z3YVj69fCN9QKItlKhg":{"text":"Our go to breakfast spot in the warehouse district. Food is fresh and service is friendly!","useful":0,"cool":0},"JOdednUkINnNysWsd3pR0w":{"text":"In town with a couple of buddies and what does everybody want after a night on bourbon str","useful":3,"cool":0},"abThHMIun2VVbX8DnM9yEQ":{"text":"This wasn't as good as we expected. We went for breakfast and got pancakes and crepes. The","useful":0,"cool":0},"-1goMzR0fpSuDWJz0IM9iQ":{"text":"This is probably the best breakfast I've ever eaten in my whole entire life. I would eat h","useful":0,"cool":0},"KeJMe2-JCGgoIvLNM1l-aw":{"text":"Great food, wonderful owners, and calm atmosphere. There may be a wait ... It's worth it.","useful":0,"cool":0},"Bk38klUmF50jFwIS1vHbYg":{"text":"This place is awesome! Stayed at a hotel nearby and ate here everyday during the conventio","useful":0,"cool":0},"WxaH8g6aIoBxWJHxpWfWdw":{"text":"Food was great...Kickin Chicken omelette!  The service gets 1 star, and I am being generou","useful":1,"cool":0},"GOL8ybcW9Iz3nVYqsDmVOg":{"text":"Best place for lunch within walking distance from Convention Center. Second convention in ","useful":0,"cool":0},"8W3MndDp85aUQTi0pG-I0A":{"text":"Great quality and value. Delicious find across from Convention Center next door to our Her","useful":1,"cool":0},"4J386zxP9Ys79D3-CyOGyg":{"text":"We tried out this new spot this past Sunday. When we walked in the tables were spread out ","useful":0,"cool":0},"wCZvSrT2m7PjzAbnJfi3UA":{"text":"Went for quick bite while in town for a convention. Been here before. I didn't take pictur","useful":0,"cool":0},"DM-jXhZLArv5CRG78M_MRw":{"text":"Just spent a few days in the French Quarter New Orleans. If you go anywhere go here. The b","useful":0,"cool":0},"jrral02jUrsoaEW97_sk5w":{"text":"Two. Chicks Cafe is located in the Howard building. The place was very nice and the servic","useful":0,"cool":0},"vPcFgnRcFWe8395fV0SJgA":{"text":"Stood by \"wait here\" sign for 15 minutes. 4 people working. Tables open. All of them looke","useful":0,"cool":0},"BXkM1mPQ43TNW3kVXvxXIQ":{"text":"Cute little breakfast/lunch place near convention center. Had the seafood omelet and it wa","useful":1,"cool":1},"ofF99zGInx0BJt0ffHguNw":{"text":"The food was delicious. We ordered the omelet and egg sandwich with sides of grits. It all","useful":0,"cool":0},"HqvuaKVA7ulW_5kSNXle-Q":{"text":"Good fresh food. Sit at the counter for conversation with others. Orders take a while, how","useful":1,"cool":1},"B5ej__RN54nSkcpMeAve1g":{"text":"Food was delicious! Atmosphere great and staff very nice. Tucked away in the convention ce","useful":0,"cool":0},"7fZ44Nuwd9qPhAI4nvL3cA":{"text":"review is for Brunch only: \nFirst restaurant we tried in NOLA. Very cute place by the conv","useful":2,"cool":1},"uc35p_mmnn8kZkkyMXI2Aw":{"text":"The place is small so be ready to be in line.  If you are not in a rush, stop by.  The lin","useful":2,"cool":2},"K3vp9DdsEXgR5Wj2eE8H_g":{"text":"I'm currently seated at the bar on only their SECOND day in business, enjoying a refreshin","useful":0,"cool":0},"3Y4o9GV_aginA_LS6Ld7ww":{"text":"After 2 whole days in New Orleans without having encountered a fruit or raw vegetable, I w","useful":0,"cool":0},"nDDfkW0-6sl8NNU14RQsWw":{"text":"Birdy's is for the birds! Two Chicks rocks! Great service. Staff very welcoming. Breakfast","useful":0,"cool":0},"2otvlsNjemR98chDM5U_pA":{"text":"Omg! The food was amazing! I enjoyed the atmosphere and vibe. Felt like our waitress overl","useful":0,"cool":0},"8PEFV0nJan057BfjWeAcmw":{"text":"Two Chicks is a pretty decent cafe near the Convention Center. I came for brunch before a ","useful":1,"cool":0},"P-yaF7N2yeiY27m4erAzxQ":{"text":"Delicious. The grits are so savory and somehow their line to sit and eat moved faster than","useful":1,"cool":1},"eiTXwf-pjSBIgN45kv7JhA":{"text":"Two chicks cafe needs to turn into 5 chicks cafe. The line/wait was madd long, and we were","useful":2,"cool":0},"i7IU65-QtzIDLXDBYGMB6g":{"text":"This was such a cute brunch place in the Central Business District! The prices are very re","useful":3,"cool":1},"o1RbWl56KbL_ti6s94hEZw":{"text":"Awesome breakfast spot!\n\nI had two friends in town and when I dropped them off for their c","useful":3,"cool":1},"MuqxFSMI5P-AdWusOotRYA":{"text":"I arrived here around noon on a Saturday. After being told there was a 30 min wait, we wer","useful":0,"cool":0},"sTSDDxvBEO3FDFEebKByEw":{"text":"Amazing food and coffee ! Kids loved this place , we did go early to be there when they op","useful":0,"cool":0},"sivI0bAck_JPq9UJ0GxUpg":{"text":"Best scrambled eggs in town and tasty drinks. I had a Mojito and white vine Sangria. Too b","useful":0,"cool":0},"pjSn2Sync2FRNMXXpxjK8A":{"text":"I love eggs benedict and I order it wherever I go. Two Chicks Cafe gave me the best eggs b","useful":3,"cool":0},"wopdGDdY9nTnwB1R2H-pEg":{"text":"Amazing food and service. Doesn't look like much from the outside, but when you enter it i","useful":0,"cool":0},"NolrtKcv-qbkq1Nd01aqHg":{"text":"Oh my, Papa's French Toast was amazing!!! Had a side of eggs and potatoes, very well done ","useful":0,"cool":0},"MFA2DD2CdeQIXlqrcWLQRw":{"text":"If you're looking for a mom/pop homestyle cooking with very reasonable prices, great servi","useful":6,"cool":6},"kmu2kWtmYMOhmi-Hqa6ePA":{"text":"Best breakfast spot hands down in downtown New Orleans.  I was in town for race weekend wi","useful":6,"cool":5},"Kjzfc_5L9jgz4XY9RLX6-g":{"text":"Cute breakfast place near the cruise ship ports. It's small so get there early to get a ta","useful":2,"cool":0},"Dxu6mpn441DJtczXhdVkQA":{"text":"I had to give a shout out to this little cafe across from the NOLA Convention Center. The ","useful":1,"cool":0},"Qy9OQ-Q2dG58pQldIcbkhA":{"text":"If you are in the mood for a simple and tasty brunch then Two Chicks Cafe is an excellent ","useful":1,"cool":0},"wUYn97_G7cXDBs7TBVi11Q":{"text":"So this place is INSANELY busy on a Saturday so be aware of that. It's the only place near","useful":1,"cool":0},"_U3-4L05dlS18_oF15BTdw":{"text":"On our way to our cruise, looked up something close to our shuttle and Two Chicks was supe","useful":0,"cool":0},"c6_B17nZN9M9g8Zrod_apA":{"text":"Great cafe vibe with unique decor and great music. Perfect for a quick but good breakfast ","useful":1,"cool":1},"5HjRSsgK963vzzx9QLRk_w":{"text":"This cafe is delightful though service is a bit slow as they are understaffed. My spouse a","useful":0,"cool":0},"qqKu-s6Q5r6VRcHIbddlxg":{"text":"I am  so glad that I stumbled across this place on Yelp, and then, someone from the hotel ","useful":1,"cool":1},"rPqwi6exXS-rnQA7ezzWVA":{"text":"Great breakfast & brunch spot in New Orleans. I stayed at the Hilton Garden Inn Convention","useful":0,"cool":0},"6e42z60U5gjEwIWh51_gxw":{"text":"Solid food at reasonable prices. The crab cake eggs Benedict was pretty good. I liked the ","useful":0,"cool":0},"jaVl8Et8SHij6fBKyWTzlQ":{"text":"So great. The food is killer and the service is amazing. Awesome.","useful":0,"cool":0},"ouqS4LrEX6VP3pse9NABPw":{"text":"This is really convenient to most area's around the Garden District and the Business Distr","useful":1,"cool":0},"eWD5tZ8YAx8dpLmikMLZ1w":{"text":"Lovely experience here today. Quiet cute space with great food and friendly staff. We both","useful":0,"cool":0},"2PlEoDzQVQznoOMpVIlBXQ":{"text":"We were in the area for Bloody Mary Fest and decided to go in here! Breakfast was amazing ","useful":1,"cool":0},"WGJpVBx-i5JDza2OVSA8UQ":{"text":"NICER THAN SUBWAY FOR BREAKFAST\nA much needed cafe to complement lunch at \"Cochon Butcher\"","useful":5,"cool":3},"681-uakHhj3WuStgM4R22Q":{"text":"The cafe was nicely decorated. The people were extremely friendly and and the food was gre","useful":0,"cool":0},"tQt-1-es3pPS25M2mCxWdA":{"text":"Great place. Ate there 4 times in 3 days. Very fresh food. Highly recommended for awesome ","useful":0,"cool":0},"sxQfmfNXajP2qXz6SflUyw":{"text":"Simple. Friendly. Inexpensive. Fast service. The space is great for groups of all sizes. T","useful":1,"cool":1},"OxtZVWBwRENDt7z8-6W17w":{"text":"Service 5 stars. I rarely order coffee at breakfast places (I drink it black over ice) bec","useful":2,"cool":1},"TV7fsQH-YggCPMhsiaGmfQ":{"text":"Food was great very appealing, service was friendly and fast. Great lunch spot!! Pancakes ","useful":0,"cool":0},"b9shhVHhA-7LM77vjqSWqA":{"text":"By far the best restaurant I've been too in New Orleans. Everything from the omelette to t","useful":1,"cool":1},"nx0X59cTj5ZKyP65YTzdBg":{"text":"Loved it here! Stopped here while on a short stay in NOLA for breakfast. Service was great","useful":1,"cool":0},"XWyGkXgTqxSUEPLhYfOeeQ":{"text":"So many good places to eat breakfast / brunch in New Orleans its ridiculous...\n\nI had to l","useful":6,"cool":2},"vgR3hul1vgrCtxxv6ccPkw":{"text":"terrible service. my poached eggs were cold as if they were in an ice bath and  just had s","useful":0,"cool":0},"m9uBRgPYsiaUnbeJrllLXg":{"text":"Sat down for 30 minutes and left unattended. Had to walk out of the restaurant because no ","useful":0,"cool":0},"N8ICRTHew6cGrg1ghg3I6A":{"text":"Really good place to go for breakfast, brunch, and lunch near the convention center.","useful":1,"cool":1},"RlLHhgbBegJRhMj4_nszlw":{"text":"Great service! The French toast was just okay though and I think would benefit from some r","useful":0,"cool":0},"nh2wECR7-EP2NgchIfUm1A":{"text":"This little hidden gem is like no other place. Everything is fresh and it takes some time.","useful":2,"cool":2},"KHxOT-9SgDJQ7srTQjji-g":{"text":"It's a small little place, the people are very friendly, food is great , and very clean.  ","useful":0,"cool":0},"YXrU_ODITXfVq0aEjgNPKQ":{"text":"The French Toast was incredible!!! Very special and tasty. The Eggs Benedict dish was also","useful":0,"cool":0},"WuXR26djaSiBIg4PvRot6w":{"text":"When i was in town i went here at least three different times. It was close to my hotel an","useful":1,"cool":0},"M1FYCe5OS3DL5RSR-I0NSQ":{"text":"Pretty good breakfast joint. The buttermilk pancakes and crepes were a bit over cooked but","useful":0,"cool":0},"1AMrc9Omm8fhZWBbRiTB7A":{"text":"This place is nearly perfect. The food is perfect, the service is perfect , and the only t","useful":0,"cool":0},"iQSXM_R0XRtIHkV1ZpjAYQ":{"text":"Amazingly friendly staff- omelets superb- breakfast sandwich w goat cheese and spinach was","useful":0,"cool":0},"817D2lqPIBwhVTzHpYC7YQ":{"text":"Warning: this review is a bit of an ode to my love for properly made grits. I may go overb","useful":24,"cool":23},"mfBt-JzKQjVWpfRHrxXKxw":{"text":"I was staying close to NOLA convention center and found this cute cafe . Only about 6 min ","useful":0,"cool":0},"YiDGvB16EJwSRU_F7cDQRQ":{"text":"We found this near our hotel. Breakfast was delicious. I had the crab cakes Benedict and a","useful":0,"cool":0},"POiCFxT48Bqf6d0llUGcfg":{"text":"I am sorry to report that I have been caught by the wave of growth , the ladies are workin","useful":3,"cool":0},"X6WPgeub4vllB23Gg2evcA":{"text":"WOW!!!! Part of me regrets going here because now any other breakfast place I go to will j","useful":2,"cool":0},"fjuWDfFuvhJSqVHEgXFzWg":{"text":"Always the best place for Brunch when in NoLa. \nThis location is amazing as there are plen","useful":0,"cool":0},"T4ckiGeqylBF9s1DHhl7Gg":{"text":"This place was highly recommended from a friend of mine. Located right next to the Convent","useful":1,"cool":0},"Z-qX0vo7ROFqIAQWM1KK9w":{"text":"Great service! Their breakfast is the best in New Orleans. So good!!!!!! Their grits were ","useful":0,"cool":0},"9PtWvd8T4284pXS8jR0ZoA":{"text":"We came to this little breakfast spot while we were on vacation in New Orleans. First I wa","useful":1,"cool":1},"_0CP_MVC4qk_9GfyFidbNQ":{"text":"Two Chicks is a cute, eclectic brunch place tucked into business-like center... but don't ","useful":2,"cool":1},"PTP7LBrsMWj8dQtX5Z0SUg":{"text":"I give this place a ten. It was busy and had a wait but not too long. The place is cute th","useful":0,"cool":0},"8v0hHAl005zuXjFypN_-CQ":{"text":"BREAKFAST OR BUST?!\n***\nOne thing's for sure, you're going to wait in a line to eat in whi","useful":4,"cool":4},"qrgacsY_4y_WpEpdGJmtOw":{"text":"Such a cute place! With great flavors and unique dishes. This is a great piece of NOLA. Th","useful":2,"cool":1},"Wu6Oc3xWH9oO_XI3Yu38UQ":{"text":"This establishment is tucked away and is quaint. Per usual, there is a wait. But it is wor","useful":2,"cool":1},"NzrwnoQe5WjCqGocyJ0zkg":{"text":"Very cozy spot across from the convention center. They had all of the World Cup games on s","useful":0,"cool":0},"R7J09uGsvoQWVceqU5dYGg":{"text":"We decided to have brunch here on a Sunday morning after arriving the evening before. Ever","useful":3,"cool":1},"72USbGeLWT_Mtqwokix7IA":{"text":"Spent 6 days in NOLA and came across this place. I have ate here twice and don't regret it","useful":0,"cool":0},"6eu2s0lpQV440-vQ0X2sTw":{"text":"I love this place. Their creamy grits are to die for. Everything in the menu I've tried wa","useful":1,"cool":0},"lFmUdNal7XjEfrsNwcCzvQ":{"text":"I absolutely love the food!\nOur first experience was 2 weeks ago while traveling with my f","useful":2,"cool":0},"UgX03LoZTWB-OGjSsab7Qw":{"text":"Not sure if it was worth the hype. The food was sort of bland but the community coffee was","useful":0,"cool":0},"wCFbg4dbqMzn1XpcS3u45g":{"text":"Wow!  We had the French toast, Omelet and a breakfast sandwich.  They were all amazing.","useful":0,"cool":0},"isH9qImbMzB79GLnK2AWXg":{"text":"Stumbled into this gem.  Breakfast was delicious. The grits awesome the benefit amazing.  ","useful":1,"cool":1},"G5DS3Ue534JeDfErpR8VUA":{"text":"I had the field green salad with grilled chicken & it was great! Very tasty & quick servic","useful":0,"cool":0},"WiqaOkzPab7aTfGNHe1xww":{"text":"Food was decent for being a diner near the convention center. I had a pretty good egg sand","useful":1,"cool":0},"7uSVvbOPtW_6GukF_PkG1Q":{"text":"This place had been in my New Orleans bookmarks for the longest, and I finally got to chec","useful":0,"cool":0},"Qo679qi0K6Bkf_2uh3PvFQ":{"text":"If this were merely based on food, I would give it a 4. We ordered the Under the Sea Omele","useful":0,"cool":0},"9xeRGZcEVc4sqDVlduU8_Q":{"text":"This was absolutely amazing, I got the chicken club with a fried egg and it was so good! T","useful":0,"cool":0},"1IQHcyoJnI83T0mO09xaPA":{"text":"Two Chicks is right across from the convention center and just a few blocks from my hotel ","useful":6,"cool":5},"sE6lHTlf0m70YSzruAZA5g":{"text":"The chicken omelette here is absolutely amazing. I also love that you can choose between f","useful":0,"cool":0},"zfZ8q8OiFxKmMHgkrC2s4A":{"text":"Food was great very clean wasn't busy would recommend for someone looking for a good break","useful":0,"cool":0},"TwnkDs5xEt27mNtBSwAqvw":{"text":"Came in on my own, and was seated right away! My server came over and was very nice. She h","useful":0,"cool":0},"nC9DxRVATo1naOr7OAEvkA":{"text":"While the food was above average and the coffee was high quality (Lavazza), this restauran","useful":0,"cool":0},"HY9KPxo8o6hpKjokhcpGkA":{"text":"I was hoping that this would be a great experience with awesome food as I've read. I've be","useful":6,"cool":2},"O6qq95pOx5d2nwERgWna4w":{"text":"This place was really good! And prices were really affordable too ! Wish on Sunday they wo","useful":1,"cool":1},"uQWxGzojw8QFBlWJVgb6gg":{"text":"Went here on a Friday morning for breakfast and then back again for Saturday brunch becaus","useful":2,"cool":2}}