{"Sl05IckkIYIj6711DyO8ug":{"text":"Thanks Raymond for taking care of us tonight. \nGreat customer service. You deserve a medal","useful":0,"cool":0},"0o_uJkL6-F8ggCc3QHWU5w":{"text":"Great courtyard and better food and service. It's a great change of pace from the more con","useful":0,"cool":0},"xJTYRMhYmDSLSz7Q8dHjxA":{"text":"This is my all time favorite hotdog place ever. It caters to not only meat eaters but also","useful":0,"cool":0},"oEuGVjECNqCNkzuZxChGcw":{"text":"Great hot dogs with a good variety of sausages and toppings. We had the crayfish dog and t","useful":0,"cool":0},"ho3Wr_Rw25vv1-IsUWYjHQ":{"text":"I loved this place! \n\nI'm vegan and Dat Dog came as a recommendation from a friend. They h","useful":1,"cool":0},"vaopQpUrMyTnOk3AF3vEwQ":{"text":"There is absolutely nothing healthy on the menu, and it is wonderful. \n\nDescribing Dat Dog","useful":0,"cool":0},"Im4AekiT6H6h4GjA7Usi9g":{"text":"We drove two hours just to eat here again for Father's Day.   The service was just as good","useful":0,"cool":0},"rEP7-nkGPwL_-5VIjHUxSA":{"text":"Best fucking hot dogs for late night munchies. I had the alligator with sauerkraut and ket","useful":0,"cool":0},"gEgUiKPS6LMipI9s_ZgiyQ":{"text":"I would happily eat here every day of my life. I went with a large group (10 people) that ","useful":0,"cool":0},"4dpH7RO-30UP28huqvcUUw":{"text":"Alligator sausage with crawfish etoufee, guacamole, and creole mustard? Only at Dat Dog wi","useful":0,"cool":0},"TFxLwCVYZz6zDSo_z7112A":{"text":"Bread on the dog is so good. Really that's the only thing that stood out. I had the crawfi","useful":0,"cool":0},"6XNYt0TzQr9hxJ3WoBEF-w":{"text":"The kitchen staff made excellent suggestions.  Asked what I thought looked interesting and","useful":0,"cool":0},"AVc40Nv8xlDO5HJImc9JQg":{"text":"Had to stop by here after reading about all of the different sausages and fry toppings. I ","useful":0,"cool":0},"K-Y66kSm66QE1Iy26HRw7Q":{"text":"Came in for lunch at Dat dog on a Monday and it was quite busy.  Atmosphere was great as w","useful":0,"cool":0},"Oz5H_RcwgW0s_ay4hepCDg":{"text":"I don't understand this location and I don't know why I keep coming back. The food is good","useful":0,"cool":0},"OkrDQq_iSBQ4qklsbX2oDw":{"text":"Here with my family. We got a bunch of Dat Dogs. We went Dat crazy!!! The cheddar bacon ra","useful":0,"cool":0},"2u2hO-H8Aqvm7PVQkhEbxQ":{"text":"Good hot dogs, polite staff. 4 stars because it took almost 10 minutes to get my hot dog. ","useful":0,"cool":0},"7zgNjMsFLWdrAFRkfTDxcQ":{"text":"This is for the new Dat Dog on Magazine. It's as good as the original on Freret, but I pre","useful":3,"cool":1},"2MnvM5RGH0KrU0MIkM68gw":{"text":"Great hot dogs, okay fries. We were walking down Magazine Street, and we were starving. Da","useful":0,"cool":0},"k37ycIDSmxHk7yGbcv6C2w":{"text":"It is funny to me that designer hot dog places are growing in scope and popularity. It is ","useful":1,"cool":0},"gyXXd6YPEjM4a1BIQL1ljg":{"text":"I can go and on about how great Dat Dog is. Service can sometimes be a little slow, but th","useful":2,"cool":2},"ApQcKBC0mcSrbyvAQZzJZg":{"text":"First time, food was great. The dogs are pretty massive and filling, wife and i split one ","useful":0,"cool":0},"LuOnu97vz0SjSA8sT-uqPQ":{"text":"Great food. Beer is expensive though. I love that there are changing tables in both the me","useful":0,"cool":1},"YYcet4WwwjZvPsiThSKhJg":{"text":"The toppings variety was great! I just wish the veggie dog was like an actual dog and not ","useful":0,"cool":0},"670nj0Yrq7La-cj2Ymmgdg":{"text":"This place was pretty good; great ambiance, location (had to check out Frenchmen!), and go","useful":2,"cool":0},"iwp7fpcu2_ozQ5qZPyDkKw":{"text":"This was by far the MOST AMAZING HOT DOG EVER!!!!!! The creole mustard is amazeballs! I go","useful":0,"cool":0},"yCE0M4xKeoQZRgJ_EdlrSg":{"text":"A great hotdog place to grab a bite.  All the dogs we tried were delicious.  The Saint was","useful":0,"cool":0},"EsPxvAQqxoNTHQl3sxjqgw":{"text":"Bacon werewolf, poppy tookem fries. The dog was delicious and the fries were very good. Wi","useful":0,"cool":0},"QSJjDAp-iTuw9dB8RUpaJA":{"text":"I never had a hot dog done like this before. I had the étouffée hot dog it was crawfish sa","useful":1,"cool":0},"4OVrYC768s-jPEQ5HGXxMg":{"text":"Food is fun and the atmosphere is great. Everything takes forever. I ordered one hotdog an","useful":0,"cool":0},"D2vL4mJYBgbULEWGCNKL0g":{"text":"Yummy! If you're into hot dogs or sausages, then you might consider this place heaven. \n\nW","useful":1,"cool":0},"OrFFicGyHjFPRussaSwGtw":{"text":"This place is super cool and laid back. The food and  service was amazing!!! The bartender","useful":0,"cool":0},"mHu5_55sI7Qug0ZT6HfcDw":{"text":"I had wanted to try Dat Dog for a long time. What a disappointment. It was nearly empty at","useful":2,"cool":0},"6iW-S5HE8D7tWPFulcyZ3Q":{"text":"Very cool place with an interesting variety on dogs. A little pricey for the portion size ","useful":0,"cool":0},"54PcPN_kN6qIxcUydjcxIQ":{"text":"Ths is the first Dat Dog that I went to...I tried the crawfish eutofee dog which was prett","useful":0,"cool":0},"Dbz62ObyROc5hGHJq8F3cA":{"text":"Dat Dog is a fun spot for drinks or a high end Hot Dog or Brat of your choosing. Almost an","useful":0,"cool":0},"Xk6gd3JkyyYxqlAtnjq4mA":{"text":"Dog, why get rid of the Asian slaw?!    Would have been nice to hear the Saints game not s","useful":0,"cool":0},"HwB4B61wVrxV6bE3Q6T2Sw":{"text":"Solid hot dogs - with a variety of options available. We had the smoked sausage with creol","useful":0,"cool":0},"hB2eNwxp5Q1sXmHRIQhUdA":{"text":"We stopped in after checking out the art market outside on a Sunday. Tried the crawfish et","useful":0,"cool":0},"K1GAqRTj77aS2ldWKDp9QA":{"text":"I went in here earlier and had the crawfish sausage hot dog and it really tasted great for","useful":0,"cool":0},"LTi_k2PkN8XHNzguKoq0yA":{"text":"I've been a fan of Dat Dog since its humble beginnings, which is why I was so bitterly dis","useful":0,"cool":0},"m4pzH6CiTBVMlM_u5PoePA":{"text":"Had the duck special here which was amazing. Would definitely get it again if it's availab","useful":0,"cool":0},"n4bEyVlwFrfWGIypWy508g":{"text":"Delicious food! Outside eating area was super clean, surprisinlyg clean especially for an ","useful":0,"cool":0},"3849XRMZrWnhW_bu7MJcDg":{"text":"Tons of unique hot dogs! I was super skeptical when my sister said she wanted to take me t","useful":0,"cool":0},"xjGXxuBzQ4OcRh6DZtkXJA":{"text":"Dat Dog has got to be the best hot dog joint EVER!!!! From the dozens of topping, literall","useful":0,"cool":0},"zziEDZhP158WimemGPvy7A":{"text":"Stopped by Dat Dog on a food tour of Magazine Street so this is a limited review.  Tried t","useful":0,"cool":0},"leUbBUefHBWB4VKw9PY-DQ":{"text":"I love Dat Dog.  New food truck at Tulane is clutch. Always go chefs choice...they know wh","useful":0,"cool":0},"quz5CpZiJ1lvuFFg30aKIQ":{"text":"Finally made it to the Magazine location.  Big fan of the one on Freret, and the Magazine ","useful":0,"cool":0},"suKmOYRnr-8aV_1PPIjhRQ":{"text":"This place was better than the famous Pinks Hot dogs in Hollywood. Love their toppings and","useful":0,"cool":0},"mXetboE9HCrqfVSLphEJ-A":{"text":"It could have been that my group just lucked out and chose winning combinations, but we we","useful":0,"cool":0},"dFK_2cGddv0BgqdUQ7-EMQ":{"text":"Amazing hot dogs with a ton of topping choices! I love how you can out as many toppings as","useful":0,"cool":0},"VFxRrXIRIc1cpzwRgchpmw":{"text":"On our hop on hop off bus tour, we decided to stop by Dat Dog to try some specialty hot do","useful":1,"cool":0},"HLTj9CYwSPhVcXArgI4C9A":{"text":"Great unqunie place to get to get a hot dog in NOLA. You are sure to find something differ","useful":0,"cool":0},"SoqIQfWfqo15xvTTQzQUIg":{"text":"This gourmet hot dog shop was a perfect treat on a rainy Saturday. Unfortunately the art m","useful":0,"cool":0},"wruDgm0zRPfszX5KlYpIdw":{"text":"I paid for it so I ate it. Does not work as an NYC type of hot dog (the carts are much bet","useful":1,"cool":0},"tFHarS6I3cSO6X8ibE2-Vg":{"text":"Dat Dog is awesome! I've been to hot dog places throughout the country and Dat Dog is trul","useful":0,"cool":0},"IaIwPEKMWy2bCBDvbCQEIA":{"text":"First I want to state I'm not a hot dog fan so rather than my initial 3 I'm giving Datdog ","useful":0,"cool":0},"azhCO8-v4OY8bPS5mxJ9Lw":{"text":"Not too shabby although the place was empty. The hot dogs is yummy with the shakes! I will","useful":3,"cool":1},"bIoARNQnQk7l7HvxeseaPg":{"text":"Great hotdog/sausage place with a fun relaxed atmosphere and good customer service both at","useful":1,"cool":0},"Vu0BE7A5JCUMDTxQJgEYtg":{"text":"Yeah sorry, wasnt impressed. Not serving alcohol yet, no menus, hotdog was pretty small, f","useful":3,"cool":0},"aXnHRv_oYVargb5fZmS96A":{"text":"Walking down Magazine and were entranced by the vibrant colors and joyous noise pouring ou","useful":1,"cool":0},"YZB-8P1lflT9l0njYHPsZA":{"text":"The place wasn't packed but there was a regular flow of patrons... I got a seat on the bar","useful":0,"cool":0},"7hejRgJxXrgfkrtHvDosMA":{"text":"Not impressed by the selection. The weiner, sausage, hot dog- whatever you choose- is a gr","useful":0,"cool":0},"eVSaW3vn8grIJCt6yAxnFw":{"text":"This place is very friendly and the staff is very accommodating. They let us bring in outs","useful":0,"cool":0},"pnquqf-Agj3-mFatMjZVOA":{"text":"Dat Dog Haikus part II \n\nPart I is here - http://www.yelp.com/biz/dat-dog-new-orleans-2?hr","useful":6,"cool":4},"ZDjimUWXPP0Op-Jf3o1Mkw":{"text":"This place is funky and fun with good prices and a bunch of toppings to choose from. I got","useful":0,"cool":0},"9vF_5o_taxa5ZN61qzu7eA":{"text":"Best wiener in town!! Wish we have this in Cali!! So many options to choose from.  Place i","useful":0,"cool":0},"qr3AIaoXyJo1TzWlyxMsjA":{"text":"Really love this place. I've had the polish sausage and the Slovenian both excellent.  The","useful":1,"cool":1},"rTd_bu2i-RhXO1O8IODbNA":{"text":"Dat Dog is awesome. There are many dogs to choose from and no matter which you choose you ","useful":0,"cool":0},"8f5AsBRPQC5MbzPdTuzwmQ":{"text":"What a shame this place has gone downhill\nWe used to walk up here 2-3 times a week\nNow, ma","useful":2,"cool":0},"JUJHIuw-WDlW2zLPtvD5Og":{"text":"Saw this place on a Youtube food review show called Day of Gluttony. I've been to both the","useful":1,"cool":1},"2BC-M7J4aYDz5pk650G1Kw":{"text":"After exploring the Garden District for several hours we decided to look for a late aftern","useful":0,"cool":0},"ar5VRy_pcHZaqEh2tJC__g":{"text":"The food is excellent and the staff are friendly. The only thing keeping them from getting","useful":0,"cool":0},"MhWrUbcpqnSGBI2RHcQeFQ":{"text":"The food was pretty good but I haven't had such unfriendly service anywhere else in New Or","useful":0,"cool":0},"IwCCp0USDYGg2_sKYrZylA":{"text":"3 stars because the vegan hot dogs are just Field Roast sausages - nothing special or exci","useful":0,"cool":0},"HbFTBde0HedDhYOYXEp-KQ":{"text":"This place is truly a unique place to enjoy something other than the norm.  Seriously, whe","useful":0,"cool":0},"-AXE7-zxThUyVUWpSIqvZA":{"text":"I had a BLT on a hot dog. My man had the ranch bacon cheese fries. Calorific Glory! Lots o","useful":0,"cool":1},"nuw13OPz9f-QoXjgQ7ug3A":{"text":"I've been to Dat Dog so many times. It's so simple, ask yourself, would you go to the groc","useful":0,"cool":0},"ABVTzt2ST-6MlLCPrZXaAQ":{"text":"I had been wanting to visit Dat Dog with my weenie dog for a while now (yes, I am that sor","useful":0,"cool":0},"roQyCZyOXpyqHqEgSWlT-w":{"text":"Me and my dude just sampled the gator dog with andouille sauce, étouffée, creole mustard, ","useful":1,"cool":0},"P6TmD0qsc06EsXxYHL0X0Q":{"text":"Dat Dog. Dat Doooog. On Magazine St. is a little Dat Dog! \n\nGet it? Like Cat Dog! I think ","useful":5,"cool":3},"2GR36uYCkiUKmp5Ll7eXYQ":{"text":"Hot dogs and sausages are among my favorite things to eat. I've eaten at most of the highe","useful":0,"cool":0},"Ix6RhfyT8LISYHecFVYvSA":{"text":"Whoa this place is basically like hot dog on crack.  You basically choose the type of meat","useful":1,"cool":0},"pInM28hlVFqsmubwpUa90g":{"text":"Simple place to stop as your tour the Garden District- sit in their huge patio and enjoy o","useful":2,"cool":3},"FAvL2wgqD50jnyXZh-e2sA":{"text":"How can you not love this place good dogs good beer good crew","useful":1,"cool":0},"2WdVyzwHoQBdyzvTbA5OzQ":{"text":"Fun atmosphere, fun menu, great for kids. That being said, I thought my guinness dog was j","useful":0,"cool":0},"TKueWUh7G03mgPnE2Ptnsg":{"text":"I love being able to say I've had an 'Alligator Meat Hot Dog' thanks to this place. It was","useful":1,"cool":0},"iLF-TpEojuwyUnsYkAS3qQ":{"text":"This place is AWESOME!!! They have a wide variety of beers, sausages, and toppings to choo","useful":1,"cool":0},"MPeENXCOlj7hXsnHOo48Ug":{"text":"Great hot dogs! So tasty!\n\nI loved the alligator sausage and the crawfish hot dog. \n\nNever","useful":0,"cool":0},"6z5XGMC6HhD3rbWzc6uGMA":{"text":"I love all Dat Dogs. The food is delicious. It's the only dog I even find worth eating any","useful":0,"cool":0},"GVOzzKtbT-pG_-lplgARwA":{"text":"Very good dogs!  I tried the duck dog fixed their way, and it was outstanding.  Wife and k","useful":0,"cool":0},"QoWYvqtz_wHUkFLxicqA7w":{"text":"This place is awesome! Went right before thanksgiving and they had a special thanksgiving ","useful":0,"cool":0},"6cIAMclt3UT_cP7k1YPyNA":{"text":"Very tasty smoked brat - needs just a little more  caraway to be perfect. Spicy fries are ","useful":0,"cool":0},"wZ6GiV0uLx2YRF6F37-SnA":{"text":"Yup ... King Hawaian bread buns , amazing ingredients and veggie dogs!\n\n\n$8 each but no si","useful":0,"cool":0},"inBDb4-eSqwUWLXdYceRPw":{"text":"I visited their spot on Freret before moving away. Imagine my surprise to see this awesome","useful":0,"cool":0},"oKEhfnmZmMIH8YVGAyhgLg":{"text":"Two important developments have happened that merit an update of my review:\n\n1) They take ","useful":1,"cool":0},"Zeckbqek41jtz7Tj1Akjxg":{"text":"What a fun spot! It's exactly as advertised :) great spot and family friendly with a bar f","useful":0,"cool":0},"EO1kYREr3rBqTrr5cbYl_A":{"text":"This is simple stated the best hot dog I have ever eaten.  From the bread, to the toppings","useful":0,"cool":0},"vB7Mph9B6NJwcLy22tBumA":{"text":"Just as good as Dat Dog I, if not better. Bigger beer selection and just as delicious food","useful":2,"cool":1},"iPNUi6BQzjRFmseveiJo3Q":{"text":"A hip, funky joint with unique dogs! I wasn't feeling very adventurous so I only had a ver","useful":0,"cool":0},"7wxf9qGpKuUSfHcbk1zZQQ":{"text":"Really good and cool hotdogs! What sold me is the huge outdoor space and how chill the env","useful":0,"cool":0},"9TQHoPzxkUV8SuZdzGqDiw":{"text":"The hype is real y'all! I got here a few minutes before they opened looking at the menu. I","useful":1,"cool":1},"SpA8AsM-UrdkTRgOQad2vg":{"text":"Wow, wow, wow.  \n\nIncredible hot dogs made out of incredible ingredients and extremely rea","useful":0,"cool":0},"1DSwFRj-j3ED0ZAwYs9hkQ":{"text":"I must admit, I was a little hesitant to get excited about a hot dog restaurant but this p","useful":1,"cool":0},"PAVsvpPZGCT5oE5TLj_AEg":{"text":"I mean what can I say...Dat Dog is AH-MAZ-ING! I absolutely love the magazine location... ","useful":0,"cool":0},"2OdgfTQGVn5-U3q2OuNBGQ":{"text":"4 stars because I felt like it was about a 3 and my husband thought it was a 5. My hot dog","useful":0,"cool":0},"xtZzKXBAMgWUNdf9Mb2eGQ":{"text":"People might not think about going here for the beer but it is great!  The beer list is ex","useful":0,"cool":1},"DaIxBYz-uaQjMM1zBWIODA":{"text":"Really enjoyed this hot dog joint. Veg friendly although the veggie dog was a tad bit disa","useful":0,"cool":0},"D86rDcfhXU2kRghiXp9DZw":{"text":"Went in for a late night snack and was not disappointed. My husband had the Guinness dog a","useful":0,"cool":0},"jrR8_jMEgO1lGTwiDSm-Yg":{"text":"We came upon this place as part of a tour we did. BIG SCORE! Our meal was chosen for us wh","useful":0,"cool":0},"amaMV0H4BjYyqsq5b0b1ng":{"text":"I have been trying to get to Dat Dog since they opened, however Magazine Street traffic ha","useful":1,"cool":1},"wDVKt2skT9gqgUxr6v8LEw":{"text":"I'm a longtime fan of Dat Dog Uptown and the Magazine location is no exception to the enjo","useful":19,"cool":12},"V4_beDfKozfz-tRFQmU7cg":{"text":"The food here is great.  It's overpriced for what it is.  $7.50 for a Chicago dog was a hu","useful":0,"cool":0},"r9mxZ6AmXUjzruDkrBPrRQ":{"text":"Let me be honest, I would normally give 5 stars, but they totally buckled to some idiot. T","useful":1,"cool":0},"VBLcDUytrj32mcQ3iE8VBw":{"text":"I know, hot dogs right?  Much more... Awesome menu of sausages, dogs, burgers and great co","useful":2,"cool":1},"WCO1N-_U1sgLcVddAze1jA":{"text":"Don't let this one slip by! The hot dogs are almost 8 but they do have a happy hour M-F 4-","useful":0,"cool":1},"lCU1PKXyU2aYRruFR7HR2g":{"text":"Good hot dogs and service at a reasonable price. The amazing thing about Dat Dog is no mat","useful":0,"cool":0},"XplXosUmtP3eAcdHeCycBQ":{"text":"If you're looking for something out of the ordinary, try Dat Dog. They have so many differ","useful":1,"cool":1},"8yzr9K1cFyLW50WHM-SVxg":{"text":"The veggie dog is misleading. It isn't a dog at all but a cut up veggie patty disappointin","useful":0,"cool":0},"HaT0oU3pC7U1keJHlsVhaQ":{"text":"I went to dat dog today and I haven't been in so long. I didn't really know what I wanted ","useful":0,"cool":0},"5skAEWd_N0FBOZhGWCVItg":{"text":"We wanted to try alligator and found this place on Yelp. Decided to give it a try.   We ha","useful":0,"cool":1},"5hgDU14wVCu8ZZRLLGPeFw":{"text":"Visited this location while in NOLA for a girls trip and was so amazed by the deliciousnes","useful":0,"cool":0},"xgC1pjFgpvsG1x37CH4afA":{"text":"I love Dat Dog's creative take on hot dogs/brats/weiners, etc. Excellent place if you're h","useful":0,"cool":0},"GoBeEQDeW4IHvFD8Edzzcg":{"text":"I have patronized this business many a time but I can promise the faithful readers of yelp","useful":0,"cool":0},"k9eiQdi6Pbn4uUlPIpHu3Q":{"text":"Dogs were great. Loaded fries were awesome. Great atmosphere. Will return, had so many opt","useful":1,"cool":0},"oYfhnKEi3BJADWEn6r8jjQ":{"text":"Always fast service and friendly people. Great atmosphere. I always get the brat with saue","useful":0,"cool":0},"V16uDKkWfsIvIEJ0izPX6g":{"text":"It was okay. I had the crawfish étouffée dog, which was good. My friend got the classic do","useful":0,"cool":0},"x2M7hZehIxp-yoHdIBh2kw":{"text":"I'm not much of a hot dog person (I'm a vegetarian), but I do love Dat Dog.\n\nThe chipotle ","useful":1,"cool":0},"4DqVRobNWavCetJC0wFeuA":{"text":"I was feeling indecisive, so decided to go out of my mustard/chili comfort zone and get \"T","useful":1,"cool":0},"s_8zYX-K-rDYPIq9wBeAKQ":{"text":"Definitely my favorite Dat Dog location. The service here is super friendly and fast. I wo","useful":0,"cool":0},"F7jgoM9pTpB7NLiYYuE9XA":{"text":"I've been a visitor to the Freret St location for some time now. The menu is the same, whi","useful":2,"cool":0},"Ov_ZXsAoJQgiyuy9-hHwRQ":{"text":"Food was great. Actually tried four different dogs. Phenomenal from the first to the last.","useful":0,"cool":0},"OdkxJDoZ3bFzUOXDODczlQ":{"text":"This is THE BEST place to absolutely pig out at. Every dog is just amazing. I used to be a","useful":0,"cool":0},"18wtvMnOYtQJZpfGdurSFA":{"text":"Love the design of these restaurants! My partner reveals the handcrafted sodas are amazing","useful":0,"cool":0},"Jdb-1Yym9G3nzuNASp7AcQ":{"text":"If It were up to me, I would eat here every single day. \n\nAll I want are these hot dogs. O","useful":0,"cool":1},"PK7RQ83BvULBSgEBEs_8yA":{"text":"Dat dog is simply great. I had the seafood dog and the chipotle veggie dog, and both taste","useful":0,"cool":0},"6BA3XpItZuq47wz4C3iQ-A":{"text":"New Orleans \"Left\" meets \"Animal House\" and decide to sell really good hotdogs. Colorfully","useful":0,"cool":0},"SAccO2QVjfcuYdXY5me1CA":{"text":"Stopped in for an afternoon snack at about noonsh. I wish we were more hungry because the ","useful":0,"cool":0},"oOJJZLJY1FSP52DGqge8gQ":{"text":"We came during the St. Paddy's day parade along Magazine. Although the place was packed, w","useful":0,"cool":0},"Hd9Rm1_XjoZESyWgziQQKg":{"text":"Wow, Dat Dog was very impressive!  First of all, it was a lot of fun, a festive and upbeat","useful":0,"cool":0},"B6YIAC_66By9xcA8278XPQ":{"text":"You absolutely can't go wrong with anything on this menu. I took a chance and got a crawfi","useful":0,"cool":0},"EsCJWXgxWmwNU4NxngyicA":{"text":"I should've written this review as soon as I got back from NOLA. I remember ordering two d","useful":0,"cool":0},"EUMx6R9LgoELRVgixTXuqQ":{"text":"Dat Dog is a great local hotdog joint in New Orleans. They have Trivia on Wednesday night.","useful":0,"cool":0},"RqdRb1tzlbBJM66MjgdHag":{"text":"A bit dirty inside but the atmosphere was great. Aside from the sticky tables the restaura","useful":0,"cool":0},"qDlmi_vEa4XSaXYhVhdP1Q":{"text":"This place is so great! Probably 2nd to 3rd best food place I've tried in NOLA. The food i","useful":0,"cool":0},"jJ7KMMHuoJcOkiNVlkbzvA":{"text":"We had the alligator sausage and had the chef dress them up - my boyfriend got jalapenos, ","useful":0,"cool":0},"wgt-KreVP6JWg5_vY-6y1w":{"text":"The turdunken was delicious. Fun atmosphere. Trivia on Wednesday's at 7:00 pm.","useful":0,"cool":0},"ticgtt8TCQOW7_50lNQxoQ":{"text":"Had a chili cheese dog. The buns are great and really adds to the dog. Good atmosphere wit","useful":0,"cool":0},"t0BgbE7vewMRc_tVhvrvmQ":{"text":"The best dog in NOLA! It is a quick walk from the St. Charles Streetcar. I recommend getti","useful":0,"cool":0},"62AmZzra2D04s_xgyCJJ_w":{"text":"Crawfish étouffée on a Hot Dog?  Need I say more?  Great place to eat in the heart of Maga","useful":0,"cool":0},"CSlxoI8JAisQ2CXLCqooCA":{"text":"They serve Field Roast vegan sausages here, which are probably the best brand of veggie do","useful":0,"cool":0},"EG2Tl6Q5aTwD6borZByuQA":{"text":"I was in New Orleans for vacation and wanted something out of the ordinary. I enjoyed this","useful":0,"cool":0},"TIiKL38GHfAXiL9Pa2Z_SQ":{"text":"Dat Dog has hands down the best hotdogs I've ever had. You can get creative with the numer","useful":0,"cool":0},"LrqiSE7wOTHXIRuFgj2TAw":{"text":"Stopped by for a quick bite to eat and loved it. The staff was extremely friendly and real","useful":0,"cool":0},"NrqABImClqMOr1kyk0ndWQ":{"text":"Get the alligator sausage hot dog and let the chef choose the toppings for you because the","useful":0,"cool":0},"65OE_HecaYWyDSqT5pKrvA":{"text":"First time here...will definitely be back! Crawfish Étouffée Dog was OUT OF THIS WORLD! Ve","useful":0,"cool":0},"cFBsSqcbm03ubFY-4J_OEw":{"text":"Hadn't been to Dat Dog in a while and was craving the bacon, cheddar, ranch fries so I wen","useful":0,"cool":0},"z784ReJc80K34ax5TlARvA":{"text":"We came here on a recommendation and it was so good! Get a dog \"chef choice,\" best decisio","useful":0,"cool":0},"T4KzjlvTnkYGAdeKRKAgJg":{"text":"We wanted a lighter dinner one night during our visit to NOLA and this place was recommend","useful":0,"cool":0},"OrVMNYz-_bimNh1y51Obnw":{"text":"I have been to all of the Dat Dog locations. This one is the worst because of an experienc","useful":0,"cool":0},"RiM9z2o3qetG7D0ZHaZ_wA":{"text":"Wow! You can't go wrong with anything on their menu. Best dogs I've had since 1990 never!","useful":0,"cool":0},"b2lgpDDF2D2pP-TUNP-y-A":{"text":"I love the ambiance here! The food is consistently food and quick and the service is so fu","useful":0,"cool":0},"6Jyn13ciqvZP7VyWPlsyOQ":{"text":"While strolling around Magazine Street and wanting an inexpensive dinner, Dat Dog made an ","useful":2,"cool":2},"6gOStzKCaa4WAGY2-ApAug":{"text":"Awesome service. I'm fortunate enough to work in the area and can stop by on my lunch brea","useful":1,"cool":1},"qg7gEm8e22qlJ5sTntgjbA":{"text":"This place is pretty good. It is that time of year where bar trivia is best held outside. ","useful":0,"cool":0},"07GEDKBSyiqiIaD2a8x37w":{"text":"This place was great! You can build your own hot dog! They had a bunch of different stuff ","useful":1,"cool":0},"ETL6t74xoceqvaa1Q_FvVA":{"text":"Dat Dog offers a bunch of meaty hot dogs, but I go right for the veggie.  These suckers ar","useful":0,"cool":0},"qV24QySZLt2VeKKVp9h8rA":{"text":"Great place to watch a sporting event.  Reasonably priced food there very creative.  Great","useful":0,"cool":0},"328ADKYFiKAs_w5SyJjjdA":{"text":"I live for these warm wieners in my mouth. The sauerkraut is fresh and I love how they lay","useful":0,"cool":0},"eRQUUqCLgvekfSolcFDluw":{"text":"Came here on a Sunday at 1pm so it was busy. Order took about 10 minutess so its not as fa","useful":0,"cool":0},"qOvtJdOZjcKl7bt6iKPrQA":{"text":"This place is one of the most unique restaurants I have visited. We decided to give it a t","useful":0,"cool":0},"0PhRdPNlZcaDtnjVrn8h-A":{"text":"Dat Dog is Funky Wiener Heaven.  The etoufee fries are wild and delicious.  This is a plac","useful":0,"cool":0},"wX1TVO9R_JVOa4xt05igVw":{"text":"We're in from Kentucky and a friend recommended Dat Dog. When we got out of the cab, the p","useful":0,"cool":0},"79vsvpQofB2r57Pvvd8sEQ":{"text":"I'm from Chicago.  Land of sausages and hot dog joints both pedestrian and haute.  I've on","useful":1,"cool":0},"4VsDspuAHzlTQGPGWoYkHw":{"text":"It was freezing so we decided to step inside! Super relaxed vibe, everyone was enjoying th","useful":0,"cool":0},"KR6qiltIFG_FL1bJUXx3tg":{"text":"Crawfish sausage - DELICIOUS.  Great fries.  Food is fantastic if a bit pricey.  Fun atmos","useful":0,"cool":0},"uoWI7cACAs8uiW111fMJsw":{"text":"They now accept CREDIT CARDS!!! Yes!!!!! I love Dat Dog! If you love fluffy chewy got dog ","useful":0,"cool":0},"E-YOTNYyvaYg3qSEAkllSg":{"text":"Disappointing, needs improvement, horrible toppings, however the staff is friendly and pro","useful":0,"cool":0},"Wylt-Pb6w6JfEur3nZX7Kg":{"text":"Was looking forward to coming here for a couple of days. I ordered my food and my buddy di","useful":1,"cool":0},"DitGnlrNknWUpAXswj1V6A":{"text":"Awesome low-key vibe and the hot dogs are great too. We happened to be in at happy hour an","useful":0,"cool":0},"JBvB5C8AE4QVwqbiO4DvXg":{"text":"I like this place, the atmosphere is nice and chill & all the employees are cool.The food ","useful":3,"cool":2},"pguNyfe5ofEx8Blq-TopUg":{"text":"I love dat dog. I go anytime I'm downtown and in need of a quick bite. Have never had a ba","useful":0,"cool":0},"jcnuzBiKJbddXfc0o1bf5w":{"text":"Overpriced with attitude.  7.95 for a hot dog!  Nothing special about either other than lo","useful":0,"cool":0},"EMralq4JLUDbfnBm09_39w":{"text":"you need that fix.  One of those you're not sure what then it must be Dat Dog.  They have ","useful":0,"cool":0},"w8Yn8bFJZ4CXQ-E4dgDJOw":{"text":"So now I know what a $8 hotdog taste like. Just like the $1.50 hotdog I would pay for at C","useful":0,"cool":0},"pQmhLK6r32YKjVlEOklDFw":{"text":"Im a sucker for a good hot diggity dog. And the bread melts in your mouth. I haven't been ","useful":1,"cool":1},"00j78ApPshZ-Uz4bVBjbeA":{"text":"Wow!! Most amazing hot dogs of my life and fries étouffée!! Totally surprised after just s","useful":0,"cool":0},"GMBxZq-koymhvrzImOaQbw":{"text":"Yummy hot dogs - all kinds.  We had the Sea Dog (battered cod & tartar sauce), polish with","useful":0,"cool":0},"nmjaAxY2GBJgBQ5cIf01gg":{"text":"This is always one of the places I recommend for anyone traveling to NOLA to stop and eat.","useful":0,"cool":0},"0e4kRlYmKkw4-vxxEOButw":{"text":"This place is amazing. If they ever start franchising these things out I'll be at the blac","useful":0,"cool":0},"UQYISyI1eFJYMnKbQ5stfQ":{"text":"The veggie dogs were great and cheese fries are not to be missed! Quick service and delici","useful":0,"cool":0},"u3fiVrvHtHGTYssjqFTLrw":{"text":"First impressions. ..I like the outdoor seating, colorful benches, bike rack, patio style ","useful":1,"cool":1},"ZvA2axp8BOWeMJyLJoNVew":{"text":"The bit of gristle in my dog, and the fact that the cheese didn't stick to their fries cos","useful":0,"cool":0},"_IDNTABMC5lRDYk9bwkbYA":{"text":"Place had good beer and the crawfish ettouffe hot dog was absolutely delicious! Must try i","useful":0,"cool":0},"fcg0wTmtW9BNyqvJ62YB9A":{"text":"This place was amazing,there's something on the menu for everyone. We had the Guinness dog","useful":0,"cool":0},"fO_xcfTXhjUErrnLBJ4aGQ":{"text":"2 words: Etoufee Fries. \n\nOrder them. Love them. (oh and the hot dogs are good too, obviou","useful":0,"cool":0},"szCbBROUINNVlOOODmO2dg":{"text":"Try the crawfish dog! Fantasic vibe. Very chill location...great dogs and staff. The hot d","useful":0,"cool":0},"eZTQ6KRNAFhUc-eO6aMK3g":{"text":"always friendly service & very helpful. great atmosphere and the Best cod fish dogs! One t","useful":1,"cool":1},"g1b_LaIhIojHS2fyq_ip6g":{"text":"Most favorite place we ate at in New Orleans! The creative options for customizing your ho","useful":0,"cool":0},"kczK197OMPY67bay05ANsA":{"text":"What a fun place! I've been to a lot of hot dog places while traveling, but I love the hug","useful":0,"cool":0},"vLN1Ma1qdBSuJnXh6eTafg":{"text":"A very popular place for the late night crowd. We ended up here after a night out and an a","useful":0,"cool":0},"VlrIWEqFA__w6npUNbbdOA":{"text":"Came here for the chocolate shake that used to be bomb but now it sucks. Bartender barely ","useful":0,"cool":0},"r93WRee2tmUCMSasMuXLOw":{"text":"We really enjoyed everything we ate here. The best hot dog was the one we let the chef dre","useful":0,"cool":0},"4_V7jeqhQ6V89NPJODfrBw":{"text":"I love this place! I don't eat meat and this restaurant has the BEST veggie dogs! The menu","useful":0,"cool":0},"LVOuyFi21-TRXyMEsM5Kdg":{"text":"Service was pretty good but kind of awkward. The registers were closed so we were instruct","useful":0,"cool":0},"Q8Aj7ipUKo4SCJq_kwoBjg":{"text":"Had the alligator hot dog with etouffee topping and was the best hot dog I've had. Bun was","useful":0,"cool":0},"3B-8P2mPIKQ3U7hmGXsU1g":{"text":"You can have the best hot dog in town here.\nThey have different type of hot dogs and they ","useful":1,"cool":0},"7yFeD6XnvIVPIlKyze1kCQ":{"text":"This is such a fun place to eat. It is colorful and lit up with lights outside, and also d","useful":0,"cool":0},"oM1GAPsPSKDww7-0zfIbuw":{"text":"We went after a trip to the zoo and it wasn't really busy.  We ordered at the back counter","useful":0,"cool":0},"W3_EzbIWKDYkBQtQ85HvIw":{"text":"This review is mainly for drinks and the service\nWe didn't eat any food. \n\nThe outdoor bar","useful":0,"cool":0},"n_aZEW5AI2304sN0_gLpQQ":{"text":"Is it a nice day? Want the cheapest and most delicious meal possible? Eat here. You will n","useful":1,"cool":0},"U0u4LaZxbVz4ku7T1ivNgg":{"text":"Dat Dog is so amazing! The Chili Cheese Fries.... omg.. the dogs.. so good.. Best drunk fo","useful":0,"cool":0},"mEP1a_uzymPgkilSsuedZA":{"text":"Interesting twist on a hot dog!  My husband and I got the Guinness Dog (sausage dog soaked","useful":0,"cool":0},"NTbHO1R0AbpiCaJ0jEEubw":{"text":"I had the burger dog with cheese, onions and bacon and it was soo good! I also had the bac","useful":0,"cool":0},"N-svhj_orB1hO6_DkBw85w":{"text":"My boyfriend and I stopped in because I have been craving it. I typically can eat meat, bu","useful":0,"cool":0},"nYYNTwwP16GdsMXceJNgMg":{"text":"I finally made it here because of a Louisiana Beer Coalition meeting. I should have gotten","useful":1,"cool":2},"tHsQZuvVB94jPBrz4qAxNQ":{"text":"Definitely delicious loved the Alligator Sausage with  the the Etouffee topping my daughte","useful":0,"cool":0},"dnaGBLlxVzYJq0tLeX9l0g":{"text":"Great scene for Sunday Funday! Lounge at the outdoor bar and scarf up some hot dogs and be","useful":0,"cool":1},"eWDXXNuHHzFKpjgwB9hbLA":{"text":"Came here for there gator dog. Saw that it contained pork and was concerned it would be mo","useful":0,"cool":0},"w-PSBgimy8KXz9rouhShwg":{"text":"During Mardi Gras it was refreshing to find a little peace and quiet. Not that I didn't en","useful":0,"cool":0},"gPCewPeC4cy3K1k49iupEw":{"text":"This place was yummy!!!! Made to order dogs however you want it! They have amazing chili c","useful":0,"cool":0},"aAR5pLZO8LC5IVeEt-tcJA":{"text":"This was the sloppiest hot dog I've ever had. Needed a fork to eat it. That's just the way","useful":1,"cool":0},"qX6WVMl01rXp6hsOoIL65Q":{"text":"Wow, fantastic neighborhood gem. Excellent food. Great for kids/families. Nice bar.\n\nI'm n","useful":0,"cool":0},"vQttlZT93Tgmd871rXplXQ":{"text":"I will always support this place. Try the gueniess special. Every dog they make is special","useful":0,"cool":0},"qZtHKzdiak6uxUb1XylqzA":{"text":"The fantastic patio/beer garden drew us in on Sunday. It was a gorgeous day to sit outside","useful":2,"cool":0},"d6aBFShfydD907YdC3hZvw":{"text":"Etoufee fries? YES!\n\nDrunk or not, these fries are BOMB! I crave this from time to time. T","useful":0,"cool":0},"uwHQLvq_bLC_VhS9rmvx_A":{"text":"Solid hotdogs at a decent price! The cheese fries were really tasty as well. The staff was","useful":0,"cool":0},"55LN7duDUdBhJA8PA5xBlQ":{"text":"When multiple tour guides tell you to come here, you come here. We had the gator dogs with","useful":1,"cool":1},"xakjsV2zsv3CUgRojNZHpQ":{"text":"Great fries and large beer selection, just popped in for a drink while waiting for a tour ","useful":0,"cool":0},"c204OdU-scyZM45pMtyfFA":{"text":"Stopped here during the Blood Mary Extravaganza of 2016. Truly a decadent beast of a drink","useful":2,"cool":1},"XNN6BtVctsS558291rOodQ":{"text":"Delicious! Reminds me of Destination Dogs in the Northeast. So many sausage options and po","useful":0,"cool":0},"9EBo8xQGNueg8J_XNS2OYQ":{"text":"Good vegan dog option, but rather expensive. I can buy a whole package of Field Roast \"sau","useful":1,"cool":1},"uRR75tdd6LvS5K5oMlNEtQ":{"text":"Always cool meeting wonderful people in a strange city. It's even better when they're your","useful":0,"cool":0},"bmQAR5uVfqSkkvk4MkuuwQ":{"text":"Friday night after drink dinner of choice! The foods great, the late 90's Rock/pop brings ","useful":0,"cool":0},"KdoJBhwOIJnpc-Dq8bv6XA":{"text":"This place was amazing!  Went there on hop oinn hop off tour.   We tried several different","useful":0,"cool":0},"qHwrZCW-3Vsxy9F9fxSdiQ":{"text":"If I could give more stars I would but yelp stops me at 5!\n\nDo you want an Alligator Sausa","useful":1,"cool":0},"ndm5ummFTbvoOhnvcivXIg":{"text":"My husband and I live around the corner and were there day 1 We had our kids come in from ","useful":1,"cool":0},"szBdq01Yjudng69mxLNofA":{"text":"Awesome hot dogs and environment.\nHad the crawfish dog, cod dog and chicken dog - all deli","useful":0,"cool":0},"zFyknrZ8l399BqV8dLN6fA":{"text":"Came here for my first meal in NoLa as I was starving and needed something quick before I ","useful":0,"cool":0},"-ISleFHMK1nPf5g3eNc6Fg":{"text":"Only grabbed a beer here, can't comment on the food. Good beer selection, large outdoor se","useful":0,"cool":0},"kvAHQgOmFxwm-9PCx2IDJg":{"text":"Dat Dog II is open! Clean, spacious, & still smells of fresh paint. Had to choose between ","useful":0,"cool":0},"QIzlkP19jK2JYhaBU26AQw":{"text":"Great dogs and great service. My beer was accidently thrown away and they gave me a new on","useful":0,"cool":0},"mG0Mw91Fvto2oawEeoLe1w":{"text":"$40 dollars for 2 hot dogs, 2 beers, and french fries. .... $40. Dollars. The place is fin","useful":0,"cool":0},"yMKKzl572LV7V744Kv2fjw":{"text":"had the étouffée hot dog .... crawfish sausage topped with étouffée and toppings","useful":0,"cool":0},"UcSvE42CzWfQK_s1XPCLLw":{"text":"A trip to New Orleans just doesn't feel complete without a visit to Dat Dog. The funky, co","useful":1,"cool":1},"O8RBZsqghJm2g4RAgsmpDQ":{"text":"Loved it.  Am I biased towards hotdogs....whoa yeah.  Dat dog was an excellent place to gr","useful":1,"cool":1},"b__vQjUleYw2CUNRDKfzdw":{"text":"This was easily, hands down, the best hot dog I've ever had and will probably always be. I","useful":0,"cool":0},"5hI-vO-xSuik0SfWqnM8iw":{"text":"Five stars from me!\n\nI am from California and when I found out I needed to go to New Orlea","useful":1,"cool":1},"nGJxdjXgjUk41aZWiCvJmA":{"text":"Never been here so wasn't sure what to order.  The Hop On Hop Off bus guide recommended th","useful":1,"cool":0},"Dm1Hvm5zJhblwKS-PNdWEQ":{"text":"Lots of crazy hot dog options here; it was a bit overwhelming at first. My group tried a m","useful":1,"cool":0},"JLh45nkdJUcbS8c3Po7a7Q":{"text":"Philly girl meets gator. The rest is history. If you are feeling adventurous, or know you ","useful":3,"cool":2},"bf-XzM4x7SrWpnfMbWbcZg":{"text":"If you're looking for something out of the ordinary, try Dat Dog. They have so many differ","useful":0,"cool":1},"SB-6oD2IgjxpTjpMFLvLRQ":{"text":"Stumbled upon this place because I refused to wait to eat at a popular nearby brunch spot.","useful":0,"cool":0},"dTyYiQ_mP3QlMMPlVL7Aug":{"text":"The place is cool!  On Magazine Street...cool!  Courtyard full of umbrellas...cool!\n\nThe b","useful":0,"cool":0},"Jj9LjCk71iGExRWnl8Y4VQ":{"text":"I went with my wife last Sunday and had just a beer and Anna's WTF. The beer, fries and th","useful":0,"cool":0},"Huwd1wcrGM3LdZfT_HFQJA":{"text":"Bartender sucks (guy with thick glasses that looks like he needed to bathe). Ordered a dri","useful":0,"cool":0},"VVtaYAGZtDFnNcR-_tFHyw":{"text":"Just want to say I started this yelp account just because of the great experience I had to","useful":0,"cool":0},"gmV7a28H8pyMo57c9RaZug":{"text":"What fun place over 50beers from around the world & tons & tons of dogs \nChili cheese frie","useful":2,"cool":1},"rFy-IhA3YLFxsxp5GMkxRA":{"text":"I have been reading about this place for a few weeks now, really looking forward to trying","useful":2,"cool":0},"rik-2GFbscbegieQs3xJUg":{"text":"I have visited dat dog a few times now and it never disappoints. The last time I went was ","useful":0,"cool":0},"h7hnpK2qTxneNIbI8d7F0A":{"text":"Awesome is an understatement. Besides a great location I think it's one of the cleanest pl","useful":0,"cool":0},"LuS2IWSnK8n7ONthYIGr4A":{"text":"These are the best hot dogs EVER!\nfirst off, let me just say that the hot dog but is so so","useful":0,"cool":0},"YMQWT64aMJr7T3pJWXTrDw":{"text":"Consider stopping at this very funky hot dog joint on Magazine street. You won't be disapp","useful":0,"cool":0},"59CssZoaPpapBTxKspgEZw":{"text":"I don't eat traditional hotdogs.  But I love sausages and beer and Dat Dog absolutely has ","useful":1,"cool":0},"N8wt-rdVk2RlUZ7Ap9iG_A":{"text":"I came here as a recommendation from a local friend. He was telling me about the different","useful":0,"cool":0},"-HP3qPqZf6JvDW28ZQvm4w":{"text":"Chefs special with alligator sausage was amazing .... But I have no idea what was on it. I","useful":0,"cool":0},"G_9Ebz3p0t0kCNssxKwc3Q":{"text":"What an awesome authentic NOLA place to visit on Magazine Street! The market area there is","useful":0,"cool":0},"xR-slKYzszg8sLXwGRCVDQ":{"text":"Wednesday is trivia. Duck special is amazing. Every time I go to Dat Dog I try something d","useful":1,"cool":0},"HxHdMpgDzomJ00m163MAVQ":{"text":"Best hot dog I've ever had. Hands down. We both ordered the smoked sausage, me with your b","useful":0,"cool":0},"gXoxSXvCapb4wwEYPvoWLw":{"text":"NOTE: Worth the Mud Butt that usually follows a visit here. \n\nIt's also best to have had s","useful":2,"cool":2},"kLUFa8AdmMIgGBotvAkuiQ":{"text":"A man can only eat so many po-boys, and Dat Dog is a great change of pace if you're in NoL","useful":0,"cool":0},"z4_iWYZqtU9j0YvaTtlkxQ":{"text":"My husband and I came to New Orleans for our honeymoon and Dat Dog was the first place I w","useful":0,"cool":0},"RedMXlw4hD3JCPZUGPVttg":{"text":"On a recent trip my wife and I with friends stopped in on a whim and we all tried the craw","useful":0,"cool":0},"Eq4XHWq2XPyxLqqfoJwfrQ":{"text":"I've been wanting to try Dat Dog for awhile. We stopped in after a visit to the zoo. Well ","useful":0,"cool":0},"h_d9Q4vgJiKr8ofFcLlEbA":{"text":"I've been here many times and it was always been very satisfying.  It can get very busy on","useful":0,"cool":0},"uGzunL6xDDe8MOhaC89fnA":{"text":"Fun place, sit outside in their side yard. Delicious combos of dogs!  Good fries too. Very","useful":0,"cool":0},"T2uJLjlPEV7KR9AbmvonoA":{"text":"Hot dog heaven..... Unique hot dogs with your choice of any toppings you want !  The chipo","useful":1,"cool":1},"LwFIyO7dau4dQ3Pgtc9hdA":{"text":"Love the food at Dat Dog! Music is horrible though, it sounds depressing. I do understand ","useful":0,"cool":0},"brwfWPJqC-kLZxL0WRkJGQ":{"text":"It's hot dogs & beer absolutely nothing to hate about that plus the have a huge and I mean","useful":0,"cool":0},"6tFFH7JeoQJLN6eX8MJmow":{"text":"Wow Dat Dog. I cannot say enough good things about this place. Being from Chicago, I know ","useful":0,"cool":0},"HTPXEg1hk54ldmGPaSf2HQ":{"text":"I'm sorry but $50 for hot dogs and fries for 3 adults and a 2 year old is too expensive in","useful":0,"cool":0},"EaorvzHIW3Y6blieWoMW0A":{"text":"I had one of the most unique and delicious hot dog experiences here! Gator dog with etoufe","useful":0,"cool":0},"UMKvnZKkadroEDZfhxs2RQ":{"text":"On my never ending quest to eat at all the places you absolutely have to eat at in New Orl","useful":0,"cool":0},"xAyRzJP4tIQ0ln4s-d9b0g":{"text":"An extensive array of sausages and toppings combined with a great atmosphere make Dat Dog ","useful":0,"cool":1},"67hjAjRxIROwr77Qi0fDXw":{"text":"Visiting New Orleans we stopped in here randomly for lunch! SO glad we did!! The duck saus","useful":0,"cool":0},"kQ2pdrvxzXItbEZOsLSzZA":{"text":"I like the space of this location better than the Freret location because the patio is rea","useful":3,"cool":4},"maHq7ADoolFA9Cu3PVxLDg":{"text":"The patio was the most memorable part of our first trip to Dat Dog. I think about it regul","useful":0,"cool":0},"iAjgk8PaSyNIp7oe6bAuOg":{"text":"I have to admit the idea of a fancy hot dog joint seemed pretty silly to me. I hadn't  bou","useful":11,"cool":9},"w2fhTCydB5G915ES_r99bg":{"text":"Great drinks, great looking bartenders. Notably Denzel. Strange selection of hot dogs but ","useful":0,"cool":0},"Ht5_6PGgomWcjQ5xoEU-aA":{"text":"I had the Crawfish sausage with étouffée topping . Also crawfish étouffée, sour cream and ","useful":0,"cool":0},"kEsYrTnXFnDGumNuocdgxg":{"text":"I ordered the german wiener dog and it is SOOOO GOOD! I love that they have a variety of t","useful":0,"cool":0},"nbmcssjvbl0iPYtEDaOViQ":{"text":"Im placing this review after my second visit. My first visit my girlfriend and I went and ","useful":0,"cool":0},"cwJ41qIC8B8-GEtv1zzJjg":{"text":"4 girls + 4 hot dogs + fries = destroyed.\nCali girls trying gator dogs, who would've thoug","useful":1,"cool":2},"j-w1Qn2CxBAUSC8K-TEdZw":{"text":"Visiting a friend in NOLA and he brought us here for dogs and trivia and to our surprise..","useful":0,"cool":0},"R6XdRUfhZV962ktF0ijD7w":{"text":"Trendy ambience, good drunk food, terrible bar service.\n\nGreat outdoor patio area with cov","useful":0,"cool":0},"bJxz5GtCXK6k1-xTpNHhPg":{"text":"Creative concoctions here. Never had anything I didn't want a second or third time. We pic","useful":0,"cool":0},"92aV5CD-oFOx91gHq3MwLA":{"text":"Nothing special, but good.  They are dressed up hotdogs with some pretty creative ingredie","useful":0,"cool":0},"D87Idsb2kXJ27XpqDVF41A":{"text":"Such an awesome place! I had ordered their turducken hotdog special that was topped with t","useful":0,"cool":0},"RYFfS4KdV6TuNpgXyGHw6w":{"text":"Fantastic selection. Amazing bartender. Great recommendations from him as far as beer and ","useful":0,"cool":0},"ohhgixerMUweS_dqqfBtfg":{"text":"Tired of super expensive seafood on your New Orleans trip like my husband and I were? Dat ","useful":0,"cool":0},"LXlyBx-VcsCvnqabmvGC4A":{"text":"The veggie dog was wonderful. The openness was great. The Crawfish Etouffe' Fries were awe","useful":2,"cool":2},"80g-0Gfj7cI8mQgJkA6dfg":{"text":"Tried this place for the first time for the Fourth of July and I enjoyed my food. \n\nI had ","useful":0,"cool":0},"aqbBQVuxwkNnOnqHQYLfxA":{"text":"You cannot go wrong with hot dog, which means...you have to mutate your hot dogs to someth","useful":0,"cool":0},"7Xw_01jywNgtS223Afn5uQ":{"text":"Dat Dog created the gourmet hot dog market in New Orleans and they definitely own it.  The","useful":2,"cool":0},"nvaRNYV2zAWrU-2rOH-0Nw":{"text":"We ate at the magazine location and it was awesome.   We will definitely be back before we","useful":0,"cool":0},"LRmQTAUIizlxcFtqo2UpSQ":{"text":"Soft spot in my heart for this place...\nI love hot dogs but do not eat pork or beef anymor","useful":2,"cool":1},"cMLDba37fXGDUMPzEJwtUQ":{"text":"Well worth a visit!! Such a authentic feeling place for what is now a chain, I think.\nGrea","useful":0,"cool":0},"uluFyRGZvCI1WhcT9dqUOg":{"text":"Hot dog heaven too many choices so little time. German with yellow mustard,pickle re lish ","useful":0,"cool":0},"zyaWGDtJaFRbfbGMIRlTlw":{"text":"This place is so fun!! Bright colors and a friendly environment was enhanced by delicious ","useful":0,"cool":0},"8UrVrWrvp8kIiUPxKc_UeQ":{"text":"Great place to stop by and grab a delicious hot dog while you walk the garden district.\n\nD","useful":2,"cool":1},"qOOzTPcpUSaKzDwbf8xbig":{"text":"Went here for the first time today with my sister since we heard a lot about it from frien","useful":0,"cool":0},"fUxt5RstT76OEHueCvq6UQ":{"text":"You can't beat the great ambience and service of the restaurant, but you can probably get ","useful":0,"cool":0},"8CTUWNE72vgQbwddLPANfg":{"text":"Dat Dog is the best I have ever had. I realize that there's not much you can do to a hot d","useful":0,"cool":0},"Vdb9gjLoMvDjZ3SH7N3OQQ":{"text":"I had a really good time here and I find myself craving Dat Dog from time to time.  The do","useful":2,"cool":0},"FbmFAajhg14lpSkKxR6gSQ":{"text":"Amazing good food and great service. Awesome atmosphere and we sat outside on the patio. D","useful":0,"cool":0},"qotndHSsJYNJDkqvYkL9Cw":{"text":"Love Dat dog but last night 06/05/2018 around 8:40pm me and my friend went to order our do","useful":1,"cool":0},"xqFJkg__ZmKrRCFqY6hLxw":{"text":"Very good dogs and very good brews. Heidi was an excellent bartender. Service was great an","useful":0,"cool":0},"ZIqnAttcNisV0PFu7aazHA":{"text":"Love this place. Great beer options. Great outdoor patio (with games to play). Kid friendl","useful":0,"cool":0},"V5Cw-9ajAoVo8cRez9FTZg":{"text":"Not a fan of the prices but I understand having to make up for the free toppings. The firs","useful":0,"cool":0},"uigMVewk3XO3JrZbAcc6mQ":{"text":"Great food , bad bartender. Had to move to the other side of the bar to even get her atten","useful":0,"cool":0},"toVndSa6ZFlVlFTEbMYg4Q":{"text":"Very interesting flavor and topping combinations. The cooking time was long without too mu","useful":0,"cool":0},"VnOXDedxMQfWtASk0cpd4A":{"text":"Stan the man and bar staff  were top notch\nFood I give 9 service 10+\nJimmy seahawk was hap","useful":0,"cool":0},"gJhg1FRlriwIQl1ob7YFnw":{"text":"We love the alligator dogs and all the toppings including andouille sauce, creole mustard ","useful":0,"cool":0},"XvtqBBs8rA4vjElVslzkzw":{"text":"Love this not your typical hot dog, and well its bit pricier as well. The bacon cheddar ra","useful":0,"cool":0},"dbFrxYdLRSohCBONpqw-Jw":{"text":"My fiance and I have long been fans of Dat Dog, since it occupied a miniscule space on Fre","useful":2,"cool":2},"J3X1bViMs2FtBUHLRcfvQA":{"text":"We celebrate my boyfriends birthday here every year! I always contact them a week or so in","useful":0,"cool":0},"ZWXqyc-GHrsMtVbLMqedeg":{"text":"Our first choice for lunch had a looonnggg wait time of 1.5 hours, so we walked along Maga","useful":3,"cool":3},"nhZfOUpt3LUHR-5BCoM8HQ":{"text":"An amazing hot dog at an amazing place! I love magazine street and it was so fun to explor","useful":0,"cool":0},"HdwF8zFmvQWWrpA70hY2LA":{"text":"The crawfish sausage was really good and the bun it comes on was equally delicious!  My fr","useful":0,"cool":0},"dn9bVBO4_KmPWYoAvNMkKg":{"text":"Umm. . yea.  Awesome.\n\nThis place has everything for hot dog purists and those totally wil","useful":0,"cool":0},"o7PjP63YWSdZtYfNoHDCMw":{"text":"Tried this place for the first time yesterday: absolutely loved it. I am not the biggest h","useful":0,"cool":0},"1Oob6_icDDLSwHnYieo9xQ":{"text":"What can I say except FREAKIN AMAZING! I mean ya it's hotdog, but there are so many differ","useful":0,"cool":0},"OhjLwj8lYgQnD8xKmgKwaw":{"text":"Holy crap how amazing is this place?  I'm taking at least a couple months off my life ever","useful":0,"cool":0},"rvRe95ZWItban6wTLLDUHA":{"text":"I've gone back since I left my last review about the slow and impersonal bar service: huge","useful":0,"cool":0},"LM7S5WRJBsPeQfNWN5XvJw":{"text":"Very unique hot dog eatery with way too many options to choose from. It took us longer to ","useful":1,"cool":0},"PVU7kGUSMnfcpLPXAxOvhg":{"text":"Slowest hotdog. \nIt took 25 min, and the places wasn't busy. \nWe missed out Uber ride","useful":0,"cool":0},"0em5yXneCc8UgJj3F4MhFA":{"text":"Who is this \"Nicole\"?! (Whose name I only got after asking another employee.) If I could g","useful":0,"cool":0},"lX5Pjni79D6sLmD894czPA":{"text":"I've had alligator many times; grilled, deep fried and blackened but in a sausage? Oooh Ye","useful":0,"cool":0},"Ytb6THaVUKBnHmrjz3akSA":{"text":"Wow what a great little place where it's all about the hot dog! Choose your dog type from ","useful":0,"cool":0},"ikoK8yBAIA0PA5Xc6u8byg":{"text":"DAMNNNN good hot dogs. Great location. Dog friendly which is great. The dat chick is my go","useful":0,"cool":0},"h-pxssP6HxCaslrwv1KRCQ":{"text":"Great food and friendly atmosphere. The bartender I believe goes by the name Taylor... was","useful":0,"cool":0},"kLZ2KKRUrBYhJ5kh3J7QEg":{"text":"HAWT DAWG!!!!! \n\nYUMMOOOO This place is delish! I came here with friends after a day of ex","useful":3,"cool":1},"HVk-Ifg3mHYRKq2QprZ47g":{"text":"Its the best Hot Dog in New Orleans, hands down. The selection is fantastic, the beef and ","useful":0,"cool":0},"tb89X6fZaCKRazSNhLoEOA":{"text":"OMG. The food here was to die for. Like seriously good to die for. I am not a hot dog fan,","useful":0,"cool":1},"zII7rTs-k6U0vrRrv6qX8Q":{"text":"i moved to nola from chicago, so it's very hard for me to: \n\na) pay this much for hot dogs","useful":0,"cool":0},"WURo0DlOA6ipaiiBnl5AHg":{"text":"I dont think that there is a better Hot Dog place than Dat Dog.  For those of you not fami","useful":0,"cool":0},"ittrd7i1H_OFrYmair7Nzg":{"text":"It was our first time so we were excited \nClean place, friendly staff and the food came ou","useful":0,"cool":0},"OeJRHMYq18r5jaXJD2uiLw":{"text":"Quite simply, a fun place for visitors and locals alike. On 12 August my wife and I stoppe","useful":1,"cool":0},"-FU4_er08JtANSCjNojMzQ":{"text":"Come one come all and take a bite of 'Dat Dog' one of a staple must try in New Orleans. I ","useful":1,"cool":0},"7QRqFRpIWnE93--gtzxLVw":{"text":"Loved Dat Dog on Magazine St. Overall the street seemed to be a normal street with normal ","useful":0,"cool":0},"MGbMYlajD4ncJtmeQb8PRA":{"text":"Love the variety, chili fries with guac on top, and cute outdoor sitting area! :) \n\n4 out ","useful":0,"cool":0},"PsnS3nvaQbpWP2zr6aIWSw":{"text":"I love Dat Dog. I come to NOLA at least a dozen times a year for work and I always hit thi","useful":0,"cool":0},"OBojeznu-838ZvjdHCmKxQ":{"text":"The best vegan hot dog I've ever had. Great service and great food. Ate at Dat Dog twice i","useful":0,"cool":0},"JoWcvHyz4e5CXnlAi11Zpw":{"text":"Really, Dat Dog! This is a great place if you are looking for a special hot dog experience","useful":0,"cool":1},"Q9UOzqZO4UCCOztMvAQoLQ":{"text":"The dogs are delicious and beautifully presented. The service was great and we never had t","useful":1,"cool":0},"CRlO3yfRa_NfC4yD7-9F3g":{"text":"Being from the Chicago-area, I tried their Chicago Hot Dog and prayed it would be amazing.","useful":0,"cool":1},"G6Bsgj5uRtEwXC1uxrurqg":{"text":"For 8 dollars you expect a perfect dog with great tasting mEat, warm bun and fresh ingredi","useful":1,"cool":0},"2mQx3OWwdvr8BlQUSJhuiw":{"text":"First time to NOLA.  First time at a dat dog. Loved it. I'd be a regular if I lived down t","useful":0,"cool":0},"ZAPZR-qRxJ39Cq_BwpkrIQ":{"text":"Their patio is huge, and awesome! One of the best in the city... The dogs are great and un","useful":0,"cool":0},"x6UHKE9UQefOXLLNeRxzlg":{"text":"I only go back to New Orleans once a year, and the Freret St. Dat Dog is always on my list","useful":4,"cool":3},"XkQMG5qR5TVhfpiKI5bN6g":{"text":"Dat Dog is a wonderfully fun place where you can get a belly full of comforting food virtu","useful":1,"cool":0},"9ukhfohIRBRlr0DLxebxyA":{"text":"I recommend Dat Dog to anyone visiting or living in NOLA. Gourmet hot dogs that make my li","useful":2,"cool":1},"ZnhDnerGqOPq5k5AIO4fEg":{"text":"I love Dat Dog!  They do an excellent job of creating a unique and delicious menu.  I high","useful":0,"cool":0},"WpJ6EJnQT-kcI8UzVYC_Nw":{"text":"Dat Dog surprised me. It is SO much more than just a hotdog stop...this place offers a hug","useful":0,"cool":0},"UuFkn8chfSvva-tDRejwyA":{"text":"Holy cow. Amazing stuff here. Eclectic place with fantastic staff. Do yourself a favor and","useful":0,"cool":0},"D5s0Z2-NFgygOrg4kxW-JQ":{"text":"Wow! crawfish etouffee dog! Great atmosphere, bar, service, and dogs. Worth putting on you","useful":0,"cool":0},"Nh4Ut5Cnk40eLQCud4CK1A":{"text":"Omg! This place is amazing. The hot dogs are delicious, the fries are bomb, and the atmosp","useful":0,"cool":0},"UCrOk69oA6aaQlBYV2HO4g":{"text":"Out exploring around Magazine St. and decided to stop in. Looked like it could be good and","useful":0,"cool":0},"QZTcXkpUT43SYMMVqcj9Fw":{"text":"I was looking for something on the cheaper side and relaxed for my first night here in new","useful":0,"cool":0},"9NDeUnkyKHW3weXN3GC3Nw":{"text":"MY favorite place to get hot dogs!!! This is by far my favorite location (magazine). Every","useful":4,"cool":1},"6OTO8VOqj2j0mVnPtBHsjA":{"text":"Who is this \"Nicole\"?! (Whose name I only got after asking another employee.) If I could g","useful":0,"cool":0},"YVJwPEEJty3yl5-qhRlRPQ":{"text":"Ok... just Awesome!!   Had the Chicago dog and the wife had the Crawfish Etiouffee dog.  A","useful":0,"cool":0},"FSLP6ca0V0-Oa04sMEKgYg":{"text":"Update: (After this post I went back and now étouffée has the accents..either coincidence ","useful":3,"cool":4},"_RpNErVKH_fO1yCq-wAFVA":{"text":"Finally! A hot dog/sausage place that gets it!! Next time I'm in NOLA I'll definitely be r","useful":0,"cool":0},"MBYzxEH2_SYz4kXkjAp0Ig":{"text":"Long wait but well worth it! I am not from New Orleans and this place was highly recommend","useful":0,"cool":0},"d3dkYY-qNCN-4qbh3Wycug":{"text":"Nice restaurant. Dogs are good. I had the bacon werewolf and it was good. Would I come bac","useful":0,"cool":0},"-O5rphu8Ngg1b7jVPUbzdA":{"text":"What can you say? THE place for gourmet and even quirky dogs. Don't really have a favorite","useful":0,"cool":0},"8RTfyQW-JoiYEHoVGDxT6g":{"text":"I was there 2 weeks ago. They have unusual sausages on the menu. Alligators and duck etc. ","useful":0,"cool":0},"XwdDsSvNOJlNf_Zd0ewang":{"text":"Employee recommended Chipotle dog for the extra spice. Crazy how it's vegetarian! It's a b","useful":1,"cool":1},"fNONzh9dt_ydbFR-VL85hQ":{"text":"A great place to bring friends for something special. They make a simple meal into a memor","useful":0,"cool":0},"SRDi1hgYaUhqzYuBVs614g":{"text":"I strongly recommend Dat Dog to everyone to try in New Orleans, the unique selections on t","useful":0,"cool":0},"PfF_NY-FT4wuZbNpYmcDLQ":{"text":"I finished the DatDog DatZilla challenge, which became my 1st food challenge win in the st","useful":0,"cool":0},"QDHrCX_k7I1eG1YVMI4YxA":{"text":"The space is great and the fries are great but I'm not sure what the hype is about over th","useful":0,"cool":0},"Po0x-OTXl7hnezInzhebXA":{"text":"Excellent menu variety. I had the smoked sausage, it was really good. Nice place to eat, f","useful":0,"cool":0},"j1UA8nLEvE-GG6OWSuawJA":{"text":"Bacon Werewolf and Classic Dat Burger were delicious. Cool atmosphere and good bar options","useful":0,"cool":0},"dqWwdfMyZ6Tx9kGFgde0og":{"text":"One of my favorite places to eat in New Orleans! Highly recommend the crawfish etouffe dog","useful":0,"cool":0},"I2Xq5vqUQFNLY94h9bMdXg":{"text":"Only problem is they leave the bartender door open and people smoke cigarettes outside. Na","useful":0,"cool":0},"Ht41XsSmNkB61HlPzolx-g":{"text":"Not into hot dogs?  Promise, Dat ain't Dogs.  So many kinds of protein to choose from - al","useful":1,"cool":1},"so1ZBHYdXuWK5j1yO_PbNA":{"text":"Standard hot dog fare; I LOVE hot dogs...so in my book it should be 5 stars...but isn't di","useful":2,"cool":0},"mKYDNmSS1YYgub6b4ugIlA":{"text":"This was my first visit! I must say I have always wanted to visit, but never really got th","useful":1,"cool":0},"QNAh42sqOONSN1vC9YuIBg":{"text":"So I am an avid Dat Dog fan! Y'all were on my \"must eat\" list for my out of town wedding g","useful":0,"cool":0},"ZKKOs8Xr-xBYrqKWtcKRNA":{"text":"This is the first time I've been here with my parents. It was REALLY good. The menu is a l","useful":0,"cool":0},"X71WhyDi-VJvyJWyIznvtA":{"text":"Not what I really expected. It was okay. Personally I think for a hotdog fries and one dri","useful":0,"cool":0},"zgKU_HgL1MDya4Rq-RWnWA":{"text":"I love this place! I love the atmosphere and the food! The hotdogs are phenomenal!! Get th","useful":0,"cool":0},"8etAxSM-i4VGb2ujbsUf_A":{"text":"I visited this location during Mardi Gras. It came with raving reviews. However, the revie","useful":0,"cool":0},"PsDByX0SXcfRvB3w7f1BOA":{"text":"Alligator hot dogs? Sign me up. While some of their drinks definitely have too much sugar/","useful":0,"cool":0},"YIcgywVDuYCOL1ybEbynRw":{"text":"Best hot dog I've ever had! Fun atmosphere and staff and great beer selection. Can't wait ","useful":1,"cool":1},"8dSNJzRGuCZPzSGtLZwFQw":{"text":"If I was Kanye West and I tried this hotdog id immediately walk up to Nathan's hot dogs an","useful":1,"cool":0},"OAG3X-v8RjQHDc0RE6ZfQQ":{"text":"I love the overall atmosphere, very chill and it's a great place to have a snack. \nSpeakin","useful":0,"cool":0},"PN9erqGZnqQFlbzS-idWwg":{"text":"Dat Dog is always a favorite!  Laid back, family friendly restaurant.  Great variety of do","useful":0,"cool":0},"xzC5xRr_5haN17fDMj4s-g":{"text":"I love a good hot dog but after eating a Chicago Dog at Dat Dog I thought had died and gon","useful":0,"cool":0},"nAVRelj9vAchprADIlHcuw":{"text":"My friend who lives in New Orleans recommended this place so we stopped by. I got the Chic","useful":0,"cool":0},"5Ufd1_ju55h2WPTcGr2Rdg":{"text":"I had very VERY high expectations for this place . But alas, my hopes were severely dashed","useful":0,"cool":0},"W15H1TKE7n9eOrL0VAHl7A":{"text":"I only came here once and did not try any hot dogs (boo hoo!) but there were a couple thin","useful":3,"cool":1},"_xzy2Zgcgt4rlSH5ECxtcA":{"text":"Dat Dog is as New Orleans as it comes. Surprised that I would say that about a fancy shman","useful":6,"cool":5},"mnhU-aMCF3B9d3kZleADmQ":{"text":"We went in to eat on the day of the Irish Channel parade. Ya'll were packed, and ridiculou","useful":0,"cool":1},"PWRXzc0r04iFTTm1qT4W1w":{"text":"I seriously love this place. It is so awesome! I love that I can bring my pup! The locatio","useful":0,"cool":1},"A6LlmGLVWXrQ-iFVFLx__g":{"text":"Eric was very helpful in our first time visit - awesome variety of flavors on the Chicago ","useful":0,"cool":0},"wr37zzGENnlGx1z76Kb8zg":{"text":"Perfect lunch stop for a school field trip to NOLA. Our 8th graders loved the variety of f","useful":0,"cool":0},"WUboYB1V6-AKpdgn_hXlTw":{"text":"Great service, very friendly. Excellent dogs and chili cheese fries. Didn't get to savor t","useful":0,"cool":0},"S6s1ttjrGXdDZssald6fNg":{"text":"Oh, Dat Dog. I give you points for your originality. You could be great if you'd clean up ","useful":0,"cool":0},"qhdvxKk4onjI5oGJtWe6RQ":{"text":"To be honest, the thought of hot dogs scares me. Every time my parents would make them for","useful":0,"cool":0},"wVmEVWuuTYVaD81ZWEYsTQ":{"text":"When I first moved to this neighborhood, I experienced great service at this location and ","useful":0,"cool":0},"qy1yaFVWGoAlzPF3PaIhxA":{"text":"The Basics: Dat Dog is located on Magazine Street. There is outdoor patio and indoor seati","useful":2,"cool":1},"m3ixHTUE0LgmPaiSu0mfqg":{"text":"Some really fun hot dog options and standard drinks. I tried the shrimp etouffe dog, which","useful":0,"cool":0},"BBcH_7H9VHVoh_wmoxc_hg":{"text":"Great place for day drinking and delicious dogs on a beautiful Saturday afternoon in NOLA!","useful":2,"cool":2},"VaaBR_H3ZgM1njAMwFxq_g":{"text":"Overpriced‍‍‍...... and it took like 45 min for our food and the place was empty. The only","useful":0,"cool":0},"LjYyRxv5Z7cCkJbgCUJbvA":{"text":"Nom nom nom. \n\nSo good! We got the cheese and etoufee tots with a chick dog and a werewolf","useful":1,"cool":0},"kKfhkrewt0E-vW4cDZBOWg":{"text":"Absolutely loved this place -- and I would not have thought a hot dog place would be THIS ","useful":1,"cool":1},"ZEfvCgxJxoMxhFX-EDIAFg":{"text":"Service suck these two assholes totally ignored our presence and offered POLITE service to","useful":0,"cool":0},"WsbD5GDvnKYfUHMztdvfWQ":{"text":"A little small and cramped....but I'll deal with that just to eat the food here. Had the c","useful":0,"cool":0},"M_833a9VT-VAZyp0IOHKfQ":{"text":"I attended the Zatarain's party here when they teamed up with Dat Dog to bring back Chow C","useful":0,"cool":0},"GFhciu1hQK-M0uceEYfvOQ":{"text":"Always great place for an afternoon snack.  The new tots are to die for.  I always eat the","useful":1,"cool":0},"uja-3pz9GjUbmLWkjgRC7Q":{"text":"The quality of food was great. In fact, the entire vibe of the place is awesome. I am from","useful":0,"cool":0},"AhN51MguXIH56SrCDv8_TA":{"text":"Stopped at Dat Dog for a quick snack and beverage after walking around in the heat, and it","useful":0,"cool":0},"PaSDdt83qzLyJaYOdVxyJQ":{"text":"Who doesn't visit this place every chance they get. The quality, quantity bang for your bu","useful":0,"cool":0},"olhMlXnzzvPBD4zJOHl9cA":{"text":"What a great little find in that garden district. I saw a recommendation for this spot on ","useful":0,"cool":0},"xQFOiOX2fNQGTd7u8zvIDQ":{"text":"Dat Dog is like that cute girl you broke up with two years  ago. You see her again and thi","useful":0,"cool":0},"L9zR7QeBV8f3FlZNrdtnBg":{"text":"Oh my god - I love the people working here! And the food, oh lord. I got the Buffalo Chick","useful":2,"cool":1},"HFZO1pzyyqENk5mBZM8Kvw":{"text":"Great place for a gourmet hotdog. Nothing better then getting a nice loaded up dog. I reco","useful":1,"cool":0},"b-wATIrVRjX6cQu3JQ6cXg":{"text":"It's a little perplexing that a weenie joint can be a success in New Orleans, but Dat Dog ","useful":5,"cool":1},"h64eKks_m22hcqO0I8s6kg":{"text":"Heard such great things from the locals plus they have been on Food Network. So it must be","useful":0,"cool":0},"yK4VHzS2nD1gGop_sG7WQg":{"text":"I LOVE DAT DOG. The only hot dogs I eat. Service is astounding, I've even ordered just the","useful":0,"cool":0},"lHczLU7y5ySkLTHoU6QZKQ":{"text":"I always stop by this place when I am visiting Nola! \nCool set up inside and outside! \nThe","useful":0,"cool":0},"tCUXAhwtl7hIcyJMFLUucA":{"text":"Dat Dog is solid and never disappoints. The price is right, but do yourself a favor and ge","useful":1,"cool":0},"Vn9cFwSa2ojqVrPFSQOP-g":{"text":"I love this place. So many kinds of dogs to choose from,  but the alligator and bacon were","useful":0,"cool":0},"Nk3GAHeMImgdncekks1ONw":{"text":"Excellent food! I'm a vegetarian and they had plenty or vegetarian and vegan options! Woul","useful":0,"cool":0},"AjEY2GkPg-c9nyUnnrDkUQ":{"text":"Love the ample outdoor seating at this location! A great place to go grab a bite of you wa","useful":0,"cool":1},"fmmzAm2C0I0nMM_sI1HNlw":{"text":"I loved this place! Being a traveling vegetarian can get hard but this spot was absolutely","useful":0,"cool":0},"dd_FqsZQXAzS4ko6SzxTvQ":{"text":"Cute little patio (dog friendly!!) and a good looking bar that can be accessed from outsid","useful":0,"cool":0},"VtxCC1t_VL58H2Qc5KvUxg":{"text":"From looking at the photos you would think this place would be pretty amazing, but it surp","useful":0,"cool":0},"ztYSfnmCGuXu3SyctO-Xtg":{"text":"This place is so good. Had Jimmy's Chicago Dog (pictured), the Guinness Special and tater ","useful":0,"cool":0},"bC1k_TFI2ueEE1DeYzsYJA":{"text":"A very different twist on a hot dog. Fun vibe, lots of seating. We were there during saint","useful":0,"cool":0},"cqXsOUG0RA5WCMuqrD9iAA":{"text":"I was here on Friday, February 5th, 2019 and I destroyed their Datzilla challenge. The Dat","useful":1,"cool":2},"MX7DUhFms31PFRXuvH0DPQ":{"text":"Good food with lots of topping options. Fun atmosphere and nice patio area. Definitely a g","useful":0,"cool":0},"UXVBY5oM2_beTrO8zX-52A":{"text":"Very fast and efficient service although our original bartender double charged us by mista","useful":0,"cool":0},"D8PSDoazlZMcWGb-ExE-0w":{"text":"We live nearby to dat dog so we eat here quite frequently. They have a good selection of d","useful":1,"cool":1},"sHT1XPXl_H0Ve3B1OxtfaA":{"text":"Soooooo good! Fun idea, colorful bar lots of seating options. I like it a lot. ...........","useful":0,"cool":0},"gIabM97Alsi3FFyE89DHaA":{"text":"So good! Came here for the alligator sausage & a drink. Did not disappoint . Also have Hap","useful":0,"cool":0},"H9Vyv5Wbo0IVRjLAjRwe2w":{"text":"They offer a creative, vast selection of hot dogs from traditional to speciality dogs like","useful":0,"cool":0},"I_Qe-bktNaR3jr99GjgeDQ":{"text":"Had the Alligator Hot Dog, and if you ask me it tastes a lot like pork.  Upon biting, the ","useful":1,"cool":1},"GcxwU7kA5bfkv3cJjnAa1w":{"text":"This place is much bigger than I expected. It's a casual spot with seating inside and outs","useful":2,"cool":1},"ATHI4_pl7W-9AcPHwbH6Bw":{"text":"Ok so let me start off this review by saying that I AM NOT A HOTDOG PERSON; however I came","useful":1,"cool":1},"qOvAE2aXnl72syIvYucLZw":{"text":"Fast casual innovative hot dogs!\n\nFood: Alligator sausage and crawfish etouffee. The allig","useful":1,"cool":1},"MxEywrBRR1fOvykuVm4hsg":{"text":"The food is outstanding, but not worth a 45 min wait in line. Get it together dat dog, get","useful":2,"cool":0},"RDESNeL0n8rorARNXMWpuA":{"text":"They have more restrictions than the city is mandating. If you are unvaccinated, do not go","useful":0,"cool":0},"Vd0eyXbtN-WsvAT-qMSCmA":{"text":"Woowee!  Glad we tried this place. I had the bacon dog and it was so full of flavor. The b","useful":0,"cool":0},"3SCYCPnZvDd0UA59EKdqmw":{"text":"AMAZING the hot dogs are so flavorful and the fries are the best I've ever had. I get a be","useful":0,"cool":0},"V1oNF3m3VouyIr-tM03z6A":{"text":"I come to dat dog for the marketing. i just love the instagram stuff soo much.. 5 stars, w","useful":0,"cool":0},"fCkGRClxLrFpinBC9ZpPRg":{"text":"This is a fun place on Magazine Street with lots of personality!  The hot dogs are great a","useful":1,"cool":1},"UFpEMf72vAkvjgI9rzuvnA":{"text":"I used to really enjoy Dat Dog, but Covid restrictions have put a huge damper on the fun e","useful":0,"cool":0},"qD4E7sHs2TzlsgNDTHl0Lg":{"text":"nice and spicy for the vegan dogs, tots were amazing - super soft in the inside and super ","useful":0,"cool":0},"08dKC4_IgVa2sZvIM142Ig":{"text":"Time to eat my words. Ignore my previous quibbles about the not-so-great veggie dogs here,","useful":14,"cool":13},"O04vlYLI-eXIBbvvanWs8w":{"text":"Love this place for its large outdoor spacious patio perfect for feeling safe during Covid","useful":0,"cool":0},"tZedDjWwfXpAl1YS6N8eRw":{"text":"The vibe & bartenders here are HANDS DOWN fantastic! We had the crawfish étouffée fries an","useful":1,"cool":1},"kSXcxgnqkhChizaOLSsnMA":{"text":"I love Dat Dog so much. It's always a pleasure to go to a reasonably priced establishment ","useful":1,"cool":0},"K-MM_muD7RPgwwrr1ef5yA":{"text":"After hearing all of the good things, we had to give it a try.  It is okay, nothing that s","useful":0,"cool":0},"JXzKtdSF_ps-9zng5eUTwg":{"text":"Went in for a quick lunch while we were picking up a few things in the area. They're curre","useful":10,"cool":7},"qf5Ku37rckoGIpZmge7sGQ":{"text":"Love everything about this place.... Great beer amazing selection for the hotdog there's e","useful":1,"cool":0},"WZr5bXyxoyDoWVUSVDRGCA":{"text":"We ordered 3 make your own hotdogs online. The site we used wasn't working so we called to","useful":0,"cool":0},"llRVDIQVezv2PfAh5yWHBQ":{"text":"Great, fun place in NO! I like their take in hot dogs and they provide very flavorful saus","useful":0,"cool":0},"dKwHFdDyoA3HAUIkp4rWfQ":{"text":"Great place to watch a Gator game if you are a fan. Fun place to watch any televised game.","useful":1,"cool":1},"CD5aa7MXz7oIrTSXIpG6Qw":{"text":"Dat Dog is one of my personal favorites in New Orleans, so any time I'm in the city I find","useful":0,"cool":0},"MPmRW8sCAv9VFkKTcxIlDA":{"text":"Visiting from NY and we don't have anything like this up there. I ordered the alligator sa","useful":0,"cool":0},"liiDPT4h91Dyhs1x6TgyBA":{"text":"Okay okay okay! This is NOT just another hot dog. If you've ever enjoyed any kind of hot d","useful":0,"cool":0},"BW6W8ECGTiOg9EeTNp2yrg":{"text":"THE BEST HOT DOGS EVER SERVED IN THE CITY OF NEW ORLEANS. The bun is fluffy cloud of carbo","useful":6,"cool":3},"6tJva389X-XsyHp5SW5auw":{"text":"I think there was a period of time when I did not like Dat Dog because I went almost every","useful":1,"cool":2},"G51cRNpjpqVElsKQ2tWnBA":{"text":"There are so many hot dog flavors to choose from. We got the \"Son of the Saints\" dog and i","useful":1,"cool":0},"-OjM5nOqegTWTXRX2DFGYQ":{"text":"Can't say enough good things about Dat Dog. Embarrassed I haven't yet done a Yelp review! ","useful":0,"cool":1},"8PTNoGcyQuEQs09_YreJzw":{"text":"Came across this place in a travel blog and it did not disappoint!  \nBoth outside patio an","useful":0,"cool":0},"Dlgw1LB7I4d52216VPCnOA":{"text":"They do accept credit cards, at least since this past week!  Ok this place is amazing and ","useful":1,"cool":0},"J46P1gB17RgEtkU2SmDgww":{"text":"Have visited here a view times and not sure why it's not more frequent. Trivia is on Thurs","useful":1,"cool":1},"N9AMw6EUVrft7Dt8l4MQ0g":{"text":"Visited Monday Jan 4. I love that it's dog friendly & has an outdoor seating. I don't like","useful":0,"cool":0},"C8aaZOY9hmHkbnhAKlcKAg":{"text":"I really enjoyed this place. Get past the fact that they serve hot dogs. It's waaay more t","useful":3,"cool":1},"3HBIdQThGkWwUGLLA0zcnA":{"text":"Matt got the grilled chicken. Friendly service and spacious outdoor area. Yelp told me to ","useful":0,"cool":0},"gS3L2V88z4i_7s6Af4PFKw":{"text":"Cute outside patio and great food! Loved just taking a moment and getting a quick bite wit","useful":0,"cool":0},"2CiyA4SsvdE8UjNkNCAwCg":{"text":"This is one of the little whole in the wall places that has \n\nan extensive hot dog sausage","useful":0,"cool":0},"ZAuPoZbrbTA-pu4wr1rZWQ":{"text":"2nd stop of our New Orleans Secrets Food Tour!  It's more than just a hot dog!   It's mout","useful":0,"cool":0},"jYtpJHHK8RgL_8JUkEE-FA":{"text":"Loved it here. Huge hot dog menu. Delicious food. Cute interior. Small bar inside, outdoor","useful":0,"cool":0},"Nua8fYnkOXLgiRLtk8JfEw":{"text":"The coolest place to grab a bite. Totally worth running into this place on my last visit t","useful":0,"cool":0},"s-5dkj4FIysRY6zuqZNlog":{"text":"Although the ability to make a reservation on Opentable at all three locations has been av","useful":3,"cool":1},"RHv79ZAeMtndLINq7aXbDg":{"text":"Happy Mardi Gras 2021 to me!! Yum! Love the hamburger on the hot dog. My new fav! \nHad to ","useful":0,"cool":0},"1U3bnZUA1SqigfXFL-rZrA":{"text":"They got good wieners!!! Im not gunna lie, I like their Wieners... Buns are butter toasted","useful":0,"cool":0},"HdRYSKS65GRmWiB1SRb3gQ":{"text":"I remember when Dat Dog was just a pup taking cash on Freret in their little store with a ","useful":12,"cool":7},"BhhCHN0u8rQUaVZpX43L6A":{"text":"Dat Dog is still very good. Really like how the pickled jalapeños are actually spicy, and ","useful":0,"cool":1},"x3LusD0evYb-fFHcbL4aPw":{"text":"I've never had a hot dog that was different and tasted that good! First food dish in NOLA ","useful":0,"cool":0},"ep2qD8POK5KaDKUNnW_Usg":{"text":"Stopped by with my husband and daughter for lunch, and we were not disappointed. I'm not u","useful":0,"cool":0},"KF1z2y3vrqQeaOTBa971aQ":{"text":"Fun atmosphere with lots of outdoor seating.  Tasty eclectic mix of types of dogs includin","useful":0,"cool":0},"dkt9sS5880MotCx5D6esbg":{"text":"Always gotta love dat dog!  Such a fun concept for food and environment to be in.  Also, w","useful":1,"cool":1},"pBYLon4OGtvJUg45S03PtQ":{"text":"Dat Dog is a gourmet hot dog shop located along Magazine St. in New Orleans. The name help","useful":7,"cool":4},"UTCMSLPVjZeRG-1BFbzwCg":{"text":"Great beer and their chilly tater tots are out of this world! Awesome vibes with chill isl","useful":0,"cool":0},"abVwNvZx48Ln4yb8wW2PNQ":{"text":"My biggest pet peeve is when a restaurant closes at 10.  Their door is open, with a sign t","useful":0,"cool":0},"kCm0ERpz5KQcOdAhRBQ94g":{"text":"Let me say that the customer service was great. I had the hotdog with alligator sausage it","useful":0,"cool":0},"KFby6OvSYOrL3rXsiWUIKw":{"text":"Yum!!! Visited Dat Dog for the first time & it was SOOO good!!! I'm still thinking about t","useful":0,"cool":0},"CTs3zm6TmwYb7muTMWEtYA":{"text":"Hot dogs are my guilty pleasure and Dat Dog surpassed all expectations for what a quality ","useful":0,"cool":0},"z7tT8Dv2Hk6-MsXJ0_iWQg":{"text":"THE 3-LEGGED DOG'S LEAP-BIRTHDAY PARTY\nhad to be at Dat Dog. And not just any Dat Dog, but","useful":6,"cool":4},"9ya7velBNGWogDFFDwKnBA":{"text":"Man, I never thought I'd be giving a hot dog joint 5 stars, but here we are.  We're throug","useful":0,"cool":0},"Qf2AhZgMWJU8I9VzXfHP-g":{"text":"Was walking down Magazine and debating what to do for lunch. Saw this place and decided to","useful":0,"cool":1},"9iZl8STrO0un8qhl1ttOSA":{"text":"Amazing hot dogs. It was my first time trying the alligator hotdog and oh my it was wonder","useful":0,"cool":0},"KTCK6JhVC6qF19hfFEg96g":{"text":"Now let me tell you, I didn't need more reasons to love Nola. This place is AMAZING! If yo","useful":0,"cool":0},"42qQ_5QhH0d0eXoqjVqz_Q":{"text":"What an utter disappointment.  Had a friend from Chicago swear we had to stop by and have ","useful":0,"cool":0},"pXR3ZB_uvh0P8w0udqwi4Q":{"text":"After meandering along Magazine St. for a bit, I worked up a bit of an appetite. I had hea","useful":6,"cool":5},"LNv-jTtAJoZpo1D0SelqFQ":{"text":"coming to Dat Dog for years, but always the Frenchman location; this one on Magazine is ve","useful":4,"cool":3},"FHc6iGF0cpTtEtG4ddK92A":{"text":"Ridiculous wait for two hot dogs. No one can answer the question of when we will get our f","useful":0,"cool":0},"y861WnypYnCrrAwO-Hf_rg":{"text":"I'm a fan. The fries are extra special and so is the vibe. Island means Nola = a place you","useful":2,"cool":2},"7xi6GBgXu0cq2Jyxh6DH-A":{"text":"Last time I went the tots and fries were cold and it took a while to get food and it wasn'","useful":0,"cool":0},"-OtMOE03IXk87abRNkiGGw":{"text":"Dat Dog Dat Dog Dat Dog\n they made you out of meat\nDat Dog Dat Dog Dat Dog \nwith a beer I ","useful":6,"cool":5},"1n7u1vmqF85afr99P2PZTA":{"text":"The crawfish etouffee fries are delicious! The strawberry daiquiri is also yummy! You have","useful":0,"cool":0},"MGyGmF6tIT7I93WGsddbzg":{"text":"Such a unique concept! I was loving all the options! We decided to go with anything contai","useful":0,"cool":0},"yGe3a7L_m5nkQ9yvQY-Qgw":{"text":"Food was delicious.  Unfortunately I literally took an hour and a half to get our food.  Y","useful":0,"cool":0},"HsndNgRmMl8yDJtDVgQDGg":{"text":"so much goodness here! every location is fun and cool, but i love the magazine one! so man","useful":0,"cool":0},"78St09IjYBUAyQ05_fLcLA":{"text":"Fun spot! They were very well set up for all covid precautions. Staff was friendly and ser","useful":0,"cool":0},"M5YxL7IFfquCyAIvA5FKQQ":{"text":"Whenever I hear Dat Dog, it makes me think of the New Orleans Saints. Who dat! Back before","useful":3,"cool":2},"xXS9709qdtx0XHgk34ay8Q":{"text":"I don't eat Hotdogs, so I was glad when I seen sausages on the menu. WOW! I was pleased wi","useful":0,"cool":0},"4fWEe2uOGfakkDzKrRsZUw":{"text":"I enjoyed my meal.\nI was disappointed in the restroom having no hand towels and no TP in o","useful":0,"cool":0},"oYiTOYq-hPgiNrUEa7CDTg":{"text":"OMG these hot dogs are amazing! A bit pricey and the service was so-so but would return fo","useful":0,"cool":0},"u14y3x9T0FYvvn_z60cInQ":{"text":"Wow Really? Quality ingredient you say? Cause I got a stomache after eating from here.","useful":0,"cool":0},"J5BOBNfvT2BXC8_kJw73pQ":{"text":"A must do. We had this further down on our listt due to wanting to inhale as much gumbo/ja","useful":0,"cool":0},"GJN8HuqmoO91iaaXG_NuJA":{"text":"The service here is terrible. I'm literally writing this while I'm waiting on my food. Tha","useful":0,"cool":0},"aQwY8rNxO2N_uRIxB8TFnQ":{"text":"I've never really gone to a gourmet hot dog place before unless you count the ballpark.  I","useful":1,"cool":1},"j1ZK3ghYXuItjJp-K7IHvQ":{"text":"I've been going to Dat Dog for years!  \nI don't eat hot dogs, but I like the look of them ","useful":0,"cool":0},"wxDC1MTdBsSgvDPcByCPbQ":{"text":"Had a Chicago dog and a Bratz.  Both were excellent.  Also recommend the chili cheese tots","useful":0,"cool":0},"pIMoN9X2cy22J9wXa7GN1g":{"text":"Loved this little place! As a vegetarian, I don't get to have a hot dog very often. I had ","useful":0,"cool":0},"3QGAKwoyxLqtR778xSNWtg":{"text":"I came I for a quick drink (rode my bike and found plenty of bike parking here), but ended","useful":1,"cool":1},"wdzF7kWddQZPX5BEA6kHEw":{"text":"We were actually goin to Boil Seafood House next door that had an hour wait. So being the ","useful":0,"cool":0},"Hzs0NegfmtfFwu9ZIKBuvw":{"text":"I went here for a quick dinner on my trip in NOLA in the French quarter. I am a vegetarian","useful":0,"cool":0},"YWwMqb3B2KmxIIb8hR7_xA":{"text":"I really enjoy the outside patio at this location. The environment is welcoming and the st","useful":0,"cool":0},"fnDcZDwhXufrtyd-xDwimg":{"text":"Post-Covid, not quite as seamless an experience, but still hot dog perfection! I made a re","useful":1,"cool":0},"IsccsSdKRjB0662DZJTTCw":{"text":"The food was awesome the service was very crappy at least the male who took our order. He ","useful":0,"cool":0},"03bYimDrtqbMJlA4ju_aYA":{"text":"Everything was awesome! Loved the shrimp dog! Great atmosphere, good beers, good service a","useful":0,"cool":0},"HhUrcHovSrs9dSF-5fW8bg":{"text":"Very expensive. Over $30 for two hot dogs and fries. The hot dogs were not dressed like it","useful":1,"cool":0},"hSSIB5emHw1YIvsjDWbe_g":{"text":"We were thrilled to find a place with vegan hotdogs, and this place definitely delivered! ","useful":1,"cool":1},"xrwuAMD65YKyy_Q0h-RAgQ":{"text":"The dogs are delicious and customizable, and the bartenders at the location on magazine st","useful":1,"cool":0},"sHcw_C6wbGWHHUq0fLN0_g":{"text":"Dat Dog never fails me! Food is always fresh and ready to consume! I'm not sure what was g","useful":0,"cool":0},"nVV8N0YOLAh9sa9D0zWU3g":{"text":"Bravo! These dogs were so damn good! I ordered a duck and a beef option and both were to d","useful":0,"cool":1},"cG1unQ0koTvVOJoz0XyWoA":{"text":"Oh Dat Dog, Dat Dang Diggity Dog!\n\nIt bit me, as sure as Jazz plays on the streets in NOLA","useful":1,"cool":1},"jrzrnLW0lm4i8O8f6T8buw":{"text":"I'm still a fan and find their options/ toppings to be rather unique. And this is coming f","useful":8,"cool":7},"KktmadQgPjU5Xem3BcNWTQ":{"text":"Honestly, the hot dog was okay. I ordered the one on the house specials list and the toppi","useful":0,"cool":0},"1chx-TXR6S6O0kk7VaHHVw":{"text":"Alex and the manager were super rude to us! They both had attitudes and didn't even give u","useful":0,"cool":0},"BQNExpTIpoP59FIWT4EUSw":{"text":"Oh, Dat Dog.  Back when I was low carbing, you were one of the few places that I went to o","useful":1,"cool":1},"fHmgNNAF1oiWyHc1cpkRNA":{"text":"Probably the best greasy food in Nola! Dat Dog is one of a kind, and have so much variety ","useful":1,"cool":0},"mPrQXfKKbierYgbg0UUJJg":{"text":"Reading the reviews one could not wait to eat an amazing glizzy in the great city of New O","useful":0,"cool":0},"sCacRI8cbQhJPfK-YSVnGg":{"text":"Always a good choice for a delicious meal. \nWe went for a quick dinner and ordered the Gui","useful":2,"cool":0},"r0MgcBljRlaN3GQ_Nyu0ww":{"text":"Another small, local chain of restaurant/bars.  This place does it right.  Don't go expect","useful":2,"cool":1},"K1Wy8SKN35CBHC5vODf4sg":{"text":"While the price was a bit lofty, the options were top notch.  I had the Turducken sausage,","useful":1,"cool":0},"r-mR6htMCmXuCCV7WMyFJw":{"text":"I have only been here once and that time was on Mardi Gras. However, we had a great experi","useful":1,"cool":1},"QxYYld1ZMHIspHqdrco8Ng":{"text":"Dat Dog is solid. The more often I go, the more I appreciate the variety of options and th","useful":3,"cool":1},"Cbg6kivbwFl0IMmOrxT7gg":{"text":"The only place I will eat a hot dog. We got their chili cheese fries. Bacon Werewolf with ","useful":0,"cool":0},"aCNK1VY_vcDH9d0WC6-2Jg":{"text":"Later I say. Well it's later.  I'm in New Orleans. Fifty hot dog combos. I had a Chicago d","useful":1,"cool":1}}