{"eRl36IuVADz7B56NhVKs6g":{"text":"Come here every time I am in NOLA, nice change of pace from the fried evenings and everyth","useful":2,"cool":1},"I_rjZNMr8E-cijFGcxPxKg":{"text":"Meh. I get the concept, and even though I'm not a vegan I typically like fresh and healthy","useful":0,"cool":1},"pZrJAiHRdh_p071gBB5AUQ":{"text":"I wish I could give this place even more stars. It is sooooo good! Went there while visiti","useful":0,"cool":0},"fXI7HfZ_qL8RES3xBIh6-w":{"text":"Fantastic find off the normal Nola cuisine beaten path. Great vegetarian and vegan options","useful":0,"cool":0},"T-dN_cvt6baPUTjpIX9EpA":{"text":"What a delight! The food was so fresh, yummy, and interesting. The staff was so kind and f","useful":0,"cool":0},"7f51hcYckRP5URxLn-3VrA":{"text":"One of my favorite restaurants in the NOLAN culinary landscape. From the acarajé pea fritt","useful":0,"cool":0},"VYrTf3ti1UAO_iFhvr44lw":{"text":"FRESH, FLAVORFUL, FANTASTIC!! Thank goodness this place exists.  It is so hard to find hea","useful":0,"cool":0},"jGS1lAlCFOoctHA_5T9e1w":{"text":"One of my favorite places for date night! Parking is street parking but after 7pm, it's fr","useful":1,"cool":0},"eyOoAxh9lpRSwEcHOZaSNg":{"text":"I got the pork rico. It had a good serving of pulled pork and the plantains were tasty. Th","useful":0,"cool":0},"emiJ8phvDevQM2XyCRfMDg":{"text":"Delicious! My family has eaten here twice in one week! Fresh great food! We love this plac","useful":0,"cool":0},"4dbNMfcjD9nQUo7lGHFw_g":{"text":"Carmo is an absolute delight in New Orleans. If you are tired of getting the not-so-health","useful":2,"cool":3},"m-lZtCGIwWTBYNgbSU_MTA":{"text":"Light. Fresh. And heartily crafted. In a city full of tasty yet unhealthy food... this pla","useful":1,"cool":1},"_SVEU4b1oRYFugc41gnWoQ":{"text":"Wow such a cute and vibrant restaurant with an amazing selection of vegan food on the menu","useful":1,"cool":1},"gSNIy1a850ihwkU7fUYD4w":{"text":"I first went to Carmo a few weeks ago and have been looking for an excuse to drag someone ","useful":0,"cool":0},"T6hRooEN4niBlDca_BCzFg":{"text":"Decent food, nice server. They don't bring you water automatically, which is fine...but th","useful":0,"cool":0},"qGEoaZRhH085Z2FyTIK-0w":{"text":"Words to describe Carmo: fresh, delicious, light, full of flavor, wonderful!\n\nFive stars f","useful":0,"cool":0},"VfaAuuSR53u0ydzUscP_Cg":{"text":"I am a vegetarian and in NOLA finding Carmo on Yelp was like an oasis in the desert.  I am","useful":2,"cool":1},"9xhP3cs_xkRydyBUTXHy-g":{"text":"YUM!! I love the salads here and the drinks are all superb. Pan de Quiejo is alright but t","useful":0,"cool":0},"e0bTTP_6H3QT4gtQXpuV-g":{"text":"Very cool folks who know how to show some vegan love.  Sit at the bar and order some cocon","useful":0,"cool":0},"FhlDaotd9ZtSb9MubgHrSg":{"text":"Enjoyed a vegetarian dinner in a city where finding great food without meat or seafood is ","useful":1,"cool":0},"L_NPUBqOYOvLrpquc2p_XQ":{"text":"Fantastic vegan ceviche.  Great Pao de Queijo(cheesy bread).  My father had the kottu and ","useful":0,"cool":0},"8aSdsFfCTWVDAFxl34pAZg":{"text":"Ive eaten here several times and almost always left satisfied with my meal. They are prett","useful":0,"cool":0},"wsYjgWutvwlc1S_dDKEKFg":{"text":"Carmo is AMAZING. There were a few vegetarians in my group, and they were also amazed at C","useful":1,"cool":0},"vYsJqwicIE5cQKJGyDGGbw":{"text":"I was visiting for a conference and was searching for an authentic New Orleans experience ","useful":1,"cool":0},"BVsJbFrj3ZVTnJ9JopLUIA":{"text":"This place is amazing!!  The vegan options are phenomenal--for breakfast, lunch, and dinne","useful":0,"cool":0},"mL5MhEgDT0wDPVK-lVmllA":{"text":"The only place I had the chance to eat at during a short trip in NOLA. Amazing food... Lit","useful":0,"cool":0},"7LCaxvhFkeZbBu-YyDPapQ":{"text":"This is one of my favorite restaurants, in life, period.  The food is unique, fresh, and m","useful":0,"cool":0},"vBnqfLC_JLqFYolt1-hatg":{"text":"Eating my way through New Orleans. Yes...there is vegan food in NOLA!! I love discovering ","useful":1,"cool":0},"1OTsl42jiOiTO_NXW1Dp3A":{"text":"A mainly vegetarian eatery that combines unpretentious charm with really good food. The ru","useful":0,"cool":0},"sZkwMaB1824tRnI5ciY0Qg":{"text":"They seated us across from a woman who had vomited on herself and was passed out. We infor","useful":2,"cool":1},"Zt9qiRFv1yrEOcig9UUP8Q":{"text":"Shame on the Esmeralda salad.\n\nThe full size salad was tiny, unfulfilling, and boring. Fla","useful":1,"cool":0},"NJmJxPXAgPB5C5GWItGMQg":{"text":"Great food. Great folks. A casual dining room with a super talented kitchen. Not super sup","useful":0,"cool":0},"p0qNiAx-ty-OAlg44GzriQ":{"text":"I had the Esmeralda salad - which was delicious - and Graviola juice. My friend recommende","useful":0,"cool":0},"4VrUZO2BinOjMaKezBiSOA":{"text":"I love them! The food tastes as good as it is presented, and the staff is lovely too! It i","useful":0,"cool":0},"6RG3RWWNSq42oyRnXSmuWg":{"text":"Met my college friend who lives in Nola here for drinks. \n\nFirst, what a wonderful restaur","useful":1,"cool":0},"NUC2bu46fohsl_dkWblwtA":{"text":"Fresh, light, delicious. Carmo is a welcome change from the sea of fried food and grease t","useful":0,"cool":0},"s8psNGIIEgU3kOlgyrQF6Q":{"text":"Very vegan friendly and yummy. Also great cocktails, wonderful service, great atmosphere!","useful":1,"cool":0},"DMDXVxhp-bhf0fq9BNFEEA":{"text":"Cute spot for a bite. I got the Carmo salad which was a bit too much rice for my liking bu","useful":0,"cool":0},"sAhUOOxpuiIlSaWLqgaw-A":{"text":"The food here is quite good and vegetarian friendly. The juices are amazing. We had the ri","useful":0,"cool":0},"Je9cKUO3DPMPs4jpGG27ZQ":{"text":"Great vegan food, can be a bit pricey for the served ammount BUT it is so delicious it mak","useful":0,"cool":0},"C9tBaUBxExZt7-uR0RFNNg":{"text":"The fare at Carmo is hard to pin down.  In short, it's pretty good.  Carmo reminds me of a","useful":3,"cool":0},"s645c1luxLEVV9isW_FZfQ":{"text":"Delicious, imaginative dishes, great service, and cool vibe. Our experience at Carmo could","useful":0,"cool":0},"p6Sp2vAhb32CPALZ64S7VQ":{"text":"Awesome spot for a light, fresh meal in the CBD area - especially for lunch. Unique menu w","useful":1,"cool":0},"e7IlJX_q5-awr7dINz5ptg":{"text":"My Friend and I wanted to Give Carmo a Try because It was only maybe 3 to 4 blocks from ou","useful":0,"cool":0},"1dUkfVOplf59ha8G4UHAIg":{"text":"I love this spot! It has a ton of vegan options but also good for your meat eating friends","useful":0,"cool":0},"AnTdqqvofnC8Gw7SY1vCCA":{"text":"Amazing food and juices. Please try everything you have a chance to try I was fortunate en","useful":0,"cool":0},"7xLV8mjcpfEkJkKaBvn3Ag":{"text":"So disappointing. We had high hopes after seeing a long line out the door during lunch, an","useful":1,"cool":0},"OFeig7geFIKoRVmxS5hcWg":{"text":"So I thought this was a fancier place than it was but they did not disappoint me or my dat","useful":0,"cool":0},"JnEfjMyseJ-pEi0Gs-pYvQ":{"text":"Loved this place. Great options for vegans and carnivores alike. The food is delicious, in","useful":0,"cool":0},"3SvGwX9K_rfQXbB3_EM3Ug":{"text":"Favorites salpicao and banquette w havarti.  Service is good and staff are friendly just d","useful":0,"cool":0},"LQXG4--ejUi-Abr_Oe6Ofg":{"text":"i love this place. i have been to new orleans about 4 times in the past 3 years, and i was","useful":0,"cool":0},"ktWBYMb5Jgkisakc51NB5A":{"text":"This place is so great. We wanted a break from the filling southern food for a few days an","useful":0,"cool":0},"kaCcsU5wlXDdbwDjck7sWw":{"text":"Café Carmo is a South American eatery on the Arts District area of Atlanta, near many of t","useful":2,"cool":0},"RtvQXagzkjOCpPhWR026XQ":{"text":"Holler at ya Rico sandwich y'all!  It's freaking delicious, even at room temperature (my f","useful":3,"cool":1},"fSZaqVS9q030I_S6KnUYog":{"text":"All around really incredible restaurant. Service was prompt and helpful. They had a water ","useful":0,"cool":0},"jlOK5L-9Uagc0JOcbKNStg":{"text":"I dig the vibe, and the staff are friendly and inviting, but my food (the Broken Noodle Sa","useful":0,"cool":0},"TBl0-bEofwPfvG_jqRSn4Q":{"text":"So delicious! Great vibe and a fun spot for lunch. We had the Rico and the banana/cinnamon","useful":0,"cool":0},"OjYvfFa5X-lXIA328S0JAQ":{"text":"Food is amazing, great unique flavors! Great ambiance and service. Must get the cheese bal","useful":0,"cool":0},"qpXiQwJrfQObzTwdL1Z2Rg":{"text":"I had possibly the most delicious salad of my life.  Normally salads are what I eat when I","useful":0,"cool":1},"5ecKG4rq5lktYBo7yRHn_Q":{"text":"I never knew I could love vegan food so much until now!  I absolutely love Carmo and I'm n","useful":2,"cool":1},"8wwxyj4l6p8yq_F5xIffCg":{"text":"Stopped in for a late lunch bite while visiting NOLA and was greeted with friendly faces a","useful":0,"cool":0},"8VOnBIsbikWQpvxdCv-X8A":{"text":"Being from Boston I wish Carmo would relocate to my home town. I would eat here every day!","useful":0,"cool":0},"xb1g-KTra0olyrmzfrLzWQ":{"text":"Went here last night on a recommendation.  So glad we did!  Great service and excellent fo","useful":0,"cool":0},"Tt8xfmpDlTQMk89puuOObw":{"text":"Was REALLY looking forward to this place, and, after reading up on it quite a bit, I thoug","useful":0,"cool":0},"ixsRZ5rgcyUgIm3WQfgo7w":{"text":"Delicious! Vegan options for lunch, dinner and dessert! I have heard great things about it","useful":0,"cool":0},"HfUBV18n_YE311cX-CyX5g":{"text":"This food was amazing. One of the best meals I've had in a long time.  I had the RICO sand","useful":0,"cool":0},"udJ-SQCDxax-ki32fKxWKg":{"text":"Not a \"vegan\" restaurant, but a restaurant that serves vegetarian, vegan and carnivorous v","useful":0,"cool":0},"Olq0dosXlUMwXXg63gRw-w":{"text":"My local fav spot. I always go back in Nola. Food is clean, fresh, and delicious. Vegan, g","useful":0,"cool":0},"1HKkAXYVAsQZbnrhmwSJhA":{"text":"i was very pleased with my lunch here. i'd definitely go back if i'm in the French Quarter","useful":0,"cool":0},"CV36mM87IGUG_z_6CY4dxQ":{"text":"We have awesome vegan fare in Chicago.  For such a huge meat and potatoes city, a huge cou","useful":1,"cool":0},"bYAZMUo19WyDp8knhpTvZg":{"text":"Whenever in New Orleans we do tend to stuff ourselves with excellent French food, great po","useful":0,"cool":0},"rIe3tIS34WtxBDVjoUNvrA":{"text":"Ordered the Carmo Salad, Esmeralda Salad, Rico Sandwich, and Maqaquito for take-out. The C","useful":0,"cool":0},"64_ALPzF1PKwy1irhlefEw":{"text":"Marvelous!\n\nCarmo is the choice dive stop for vegetarian, vegan, and gluten-free options i","useful":1,"cool":0},"X844-Tf5S67ZIloHZM9aJg":{"text":"This is a funky little vegan-friendly restaurant that I found within easy walking distance","useful":0,"cool":0},"HnqR1xcTo2zYMCqD1WYJiw":{"text":"Food was great, but portions too small.  21/2 blocks after leaving the place we went into ","useful":1,"cool":0},"cfsKZLyHs3zgbb1dEhSR9g":{"text":"Warm staff and unique flavorful food! I had the Esmeralda and the soup du jour which was a","useful":0,"cool":0},"N5JY5ZB4aczA3eMZnW7E2w":{"text":"The vibe at the eatery was so cool and laid back. My food and iced tea was out of this wor","useful":0,"cool":0},"RHEsRq_QnUrdaJQls6BM7Q":{"text":"Yummm-- so many good options here, it was hard to pick.  So I had to go for two!  Got the ","useful":1,"cool":0},"SQ8ih_RD3NAHoNsxTrq6UQ":{"text":"Delicious food, lovely servers, strong drinks! We had the Peruvian ceviche, fish fritters,","useful":0,"cool":0},"oQD1EE9CZ6phJhBv3MBHHA":{"text":"I went here twice while on a business trip! I'm a pescatarian who doesn't eat much fried f","useful":0,"cool":0},"9p2h8Jdb0mq56BqxkCpOIg":{"text":"Just amazing place! Great broken noodle salad! Order small plate if you are not insanely h","useful":0,"cool":0},"Yvb7QD6VnD8dfCex_yzG1A":{"text":"Finding vegan food is not the easiest task in New Orleans, but this restaurant offers an a","useful":0,"cool":0},"uLKr31RYlghneX_g62yvxw":{"text":"The customer service here is terrible. I came here for lunch today and they were out of ev","useful":1,"cool":0},"-tw6r7SzcEt5ncvD9lKweg":{"text":"This was the first place I ate in NOLA thanks to its proximity to my hotel, and I wasn't d","useful":0,"cool":0},"sfhRTqTZfbwEzMHaULXN2A":{"text":"If you're looking for a delicious New Orleans meal with tons of flavor, that won't weigh y","useful":0,"cool":0},"dyHVpB-kUp86gGhMCsu0eQ":{"text":"Delicious!! Very interesting menu with a variety of choices from veg to vegan to meaty or ","useful":0,"cool":0},"1hWC1ENjHq3PapR8lcIQfw":{"text":"I was looking for a restaurant with creative vegan menu and liked what i saw on yelp, so w","useful":0,"cool":0},"p0G0EJ04dPsX7l7EYz_I_w":{"text":"My boyfriend and I were planning on heading to Wednesdays at the Park and decided to look ","useful":0,"cool":0},"w4ZaB7xSCYauO0bJclHyKQ":{"text":"Delicious vegan fare, very nice and laidback, cosy vibe. Super friendly staff, price/ qual","useful":0,"cool":0},"IX84xTwm4IINKnpJtQ96zA":{"text":"I had a Acarajé that's so damn good, but I more like the Plain bread. Friendly service and","useful":0,"cool":0},"DvY8uEPivKfr-w0nl3ZBCg":{"text":"This place is amazing. The smoked fish fritters were to die for. Also, the ceviche and ent","useful":0,"cool":0},"c2MzdBc5dFS4HQxEy1ggrQ":{"text":"Just a quick update to share my recent stellar experience with you. Carmo is great for lar","useful":11,"cool":10},"XAMPNt-cL4A_UF30mLQx9A":{"text":"Terrific little cafe! I really enjoyed the traditional Carmo salad and their bread! The me","useful":1,"cool":1},"H9NwYf88M2cV6Sr5u8JcBg":{"text":"Really great restaurant.  Unique menu, fresh ingredients.  I had the Rico, which is an inc","useful":0,"cool":0},"AEXZB-bQgb2RWb_MWjxxlw":{"text":"Had no idea this even existed, I drive right past every night with the legions crossing th","useful":0,"cool":0},"WSQtwjgtUcqZZhYfcdHfAw":{"text":"***Outstanding Esmeralda Salad***  (Quinoa, black beans, corn, peppers & cilantro. Tossed ","useful":2,"cool":2},"gPgDbvZ7lVxETZu5Xb_K-w":{"text":"This is a fantastic cafe on a quiet block of the Warehouse District.\n\n- Food: Caribbean/Br","useful":0,"cool":0},"VkRXD2ekdO6kgQ9-PunKhg":{"text":"the food as okay.. but i wouldnt call it tropical... bruchetta and the flat bread was good","useful":1,"cool":1},"pmJmDYh0INRFq1D_av39nA":{"text":"Carmo has become one of my favorite restaurants in the city. The dishes are creative, tast","useful":1,"cool":0},"QFgmvvFSZcsd4EdQoCrq8Q":{"text":"I've probably been here 20 times. It's always a great go-to. For their location, heir pric","useful":0,"cool":0},"w6qMQnxJNymBDcNHK0ljqQ":{"text":"Yummy food! Great options. Decided to order something with ingredients I liked, but all in","useful":1,"cool":0},"HxpveHlzSxBqCCTdZ1BIfA":{"text":"Absolutely amazing: food, service, ambiance. The Rico (I had it vegetarian) was out of thi","useful":0,"cool":0},"NC4IOdzJv-xKNbTtXAsQnQ":{"text":"Last time we stayed in NOLA for longer than 2 days, I was in a severe vegetable deficit. T","useful":2,"cool":0},"5827amG7swtyPX7mQ58wxg":{"text":"Five stars for the food!!   Creative and unique and very tasty.   Also the calm ambience w","useful":0,"cool":0},"8UlVfWumz1-sFqdMjnWnqw":{"text":"Finally a good vegetarian spot in NOLA. Great ambience and food options. Service was great","useful":0,"cool":0},"ShgQOYOKCaf_ckeY_C_qDA":{"text":"Good food. It was unique. Liked the seared avocado... Worth the try! Service was friendly ","useful":0,"cool":0},"d51qoJQD9fZlRFv-ZDdyIA":{"text":"Loved this place walked by it many times & even during White Linen Night. Had a Cubano San","useful":0,"cool":0},"y8tB37qiXw4-Vr-KkJySSg":{"text":"Wow! Incredibly tasty dishes. All the other reviews were spot on when they said to try the","useful":0,"cool":1},"dQHA_pV898Km4iukQ6e2Yw":{"text":"The setting was just as relaxed as the ordering.  On the other hand, the food was just as ","useful":0,"cool":0},"XcJ9Ib5QaM3ih9UJFxONdw":{"text":"Food is good, but I don't love it. It cannot reach my expectation. If you are meat hunter,","useful":0,"cool":0},"5y9LY5K9wjeVjzUqHme-Dw":{"text":"Food took a lot of time and my Singapore chili was a bit more salty than expected. I did l","useful":0,"cool":0},"wzX1bQu95S8wK_au05CWKA":{"text":"Five stars for an unbeatable combination of great service (often supplied by a partner) de","useful":2,"cool":1},"jg77WjGG1KXiKrZsVQHICQ":{"text":"We were wanting something a little different than normal Cajun items. This Brazilian flavo","useful":0,"cool":0},"h5RdOdecituO0qIn0nVMpw":{"text":"Thank you, Carmo! My vegan, vegetarian, and non-vegetarian party of 8 all left very happy.","useful":2,"cool":1},"J0Sm43ENoHgeWeKnG1mhoA":{"text":"The Rico is so flavorsome and has such a unique blend of flavors. Cool atmosphere and grea","useful":0,"cool":0},"-W05naTHsjsPZKr5JiOBLw":{"text":"Located more in the business downtown district of New Orleans, this place is convenient fo","useful":0,"cool":0},"LL3kinSt0hSbF2KRbJf1CQ":{"text":"Ordered the broken noodle salad with tofu. Had one single 1cm cube of tofu. Also the sauce","useful":0,"cool":0},"zaOjXcmQl-NGGhzulmX7jQ":{"text":"The staff was super friendly and accommodating. The food was fresh, original and top notch","useful":0,"cool":0},"065nVF6qI5tuQ3oALAKEuA":{"text":"I absolutely loved this place. As soon as you walk in you feel a vibe of goodness relaxed ","useful":0,"cool":0},"U_lMPfGHrkHY_5LO0grcUw":{"text":"The menu makes you wish you had a second stomach. I had the ceviche, which was perfectly d","useful":0,"cool":0},"BBy_rH19eOKaUAYZPRAJWA":{"text":"Gotta try this place, especially if you've had enough of the regular gumbo, fried seafood ","useful":0,"cool":0},"7bMATQw4vy2sGCH4AzYSVA":{"text":"I've been meaning to write something for a long, long time for Carmo. This place has so ma","useful":1,"cool":1},"scUX0rJ6X-XYFluuclUW-A":{"text":"What a find!  The food is fresh, as in seasonal and not fried,  and delicious. The bartend","useful":0,"cool":0},"yKb5QiJu8rUqhtdt6MXN4g":{"text":"We ate here for dinner and I was uninspired and underwhelmed. We ordered a salad which was","useful":0,"cool":1},"PWEr1WAQqM_9KaIGlJd9fg":{"text":"Amazing food, amazing service, amazing atmosphere.This place has become my go whenever I'm","useful":0,"cool":0},"OglGHi-Q8QzZg9SDl0DhIg":{"text":"Went to this place a few nights ago and had an awful experience. I order the Cuban ceviche","useful":1,"cool":1},"csp6e1NtB4DvJXoUl2JjDg":{"text":"!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nI ORDERED ALL THE THINGS.\n\nOkay, not ALL but a LOT of ","useful":5,"cool":2},"nzGFBm4eEtpg9Bvf6O02RA":{"text":"After eating much of the heavy traditional NOLA food for several days, we were grateful to","useful":0,"cool":0},"lrgg6YGiQvD51BQZnth0pA":{"text":"between 3/4 stars. Food was good. Had tuna salad and i really enjoyed it. Venue felt like ","useful":0,"cool":0},"2VJg3n-YURcdNtDoXiVMlw":{"text":"Carmo is an outstanding seafood and vegan restaurant in the French quarter of New Orleans.","useful":7,"cool":5},"JFGtPjJP3DTl1ym3LT9ypg":{"text":"Great beer selection. Fun staff. Had an Indonesian food that was as good as food I had in ","useful":0,"cool":0},"nykT_jWgc0Ui5JEwy8MfsA":{"text":"My wife and I came by during their busy lunch hour. We both had Rico which was out this wo","useful":0,"cool":0},"bEK-R6xgRjzJsdqgc03Npg":{"text":"The food was very flavorful and fresh. It was perfect for a hot summer day. If you are try","useful":1,"cool":0},"AKOpIwQ3_4zPnHrvvuJ1MQ":{"text":"Was visiting on a work trip and had the Rico sandwich.  It was flavorful and delicious.   ","useful":1,"cool":0},"c2gqOhajq5Kjj7AxefPmAg":{"text":"Our favorite spot in New Orleans so far. Cool staff, intriguing menu, utter perfection in ","useful":0,"cool":0},"xoTqN8rgbEJ4OFT0FWRUJw":{"text":"A great find in the Warehouse districts.  Everything on the menu sounded amazing, the staf","useful":0,"cool":0},"VBLF5UjVS-rFJlKGTfXJUQ":{"text":"Excellent food! Service was amazing as well as the food. So refreshing to have a change fr","useful":0,"cool":0},"JBVRQUlTdLhhr6sQpV0woQ":{"text":"Chick ambiance, very interesting freshly squeezed tropical juices of excotic fruits I had ","useful":0,"cool":0},"LGZuL8wSkamGBqBaoWaHUQ":{"text":"Absolutely delicious. The RICO \"sandwich\" is amazing. Plantain party, pulled pork. Best th","useful":0,"cool":0},"ntMn84F0IW2-001rs6Mv3A":{"text":"I wish I could comment on the food, but unfortunately we could not be served at this estab","useful":1,"cool":0},"hYPVW0VqI5gA-h6-0ijg_A":{"text":"I'm glad Carmo exists, but I don't know if I'll be joining them for another meal any time ","useful":8,"cool":4},"gE8TaSmd0GDWsvzPU-dNbg":{"text":"Phenomenal. Absolutely phenomenal. Wish you existed in San Francisco but alas, guess I'll ","useful":0,"cool":1},"QUVhsLRO3IHlvqUueUaCdA":{"text":"Ambience: visual, auditory, taste, scents. This place has it all, and without being overwh","useful":0,"cool":0},"NAk30K5H-2zLJId54JzTQw":{"text":"I am so enthusiastic about my experience at Carmo. You order at the counter and then sit a","useful":0,"cool":1},"UQWNFCR0ZkUof0VUVhfa_A":{"text":"Good ambience, nicely prepared meals, just a bit overpriced, example Beans and rice plate ","useful":0,"cool":0},"OtPR_PmCRK2_yiSuEsrc1g":{"text":"I really wanted to like this place. I liked that they had plenty of vegan options on the m","useful":1,"cool":0},"wNYkaw4Pin32P82SzErJfA":{"text":"Amazing place to sit down and enjoy a great variety of salads and vegetarian options. The ","useful":0,"cool":0},"VhcMt4m1-NPBHvpTJGzlfQ":{"text":"Great location, nice funky and laid back atmosphere. Menu was eclectic, and the food was g","useful":0,"cool":0},"lAGvnB5YV5Cf9-yp1-_Qaw":{"text":"One of the few vegan restaurants in NOLA and it turned out to be a good one. The vibes in ","useful":0,"cool":0},"UpDDScCmuZR4gjSgZ5LVFQ":{"text":"Wonderful combinations of flavors and ingredients. Vegan/vegetarian friendly. Homemade des","useful":0,"cool":0},"Kl1xR5AgdX5tPal6rq3wsw":{"text":"I initially found this place while walking to a conference, and decided I absolutely had c","useful":0,"cool":0},"4A4Gca-M0oc1Iiu-c262nA":{"text":"Excellent vegan food ( and items for those who like animals). \nSmall, one table outdoor se","useful":0,"cool":0},"x77EhEpLtrM_atDerSjN9g":{"text":"If I had one word to describe this place, it would be \"crunchy.\" Sustainable this and low-","useful":0,"cool":0},"wgI7rtIBy7Azw73ad4N8ow":{"text":"We were visiting New Orleans and wanted a place with vegetarian and seafood options.. The ","useful":0,"cool":0},"B6E7D_Bt9nEr73DY3wioxw":{"text":"In town for a quick visit.  Stopped by local Yoga Studio for practice and asked for restau","useful":0,"cool":0},"mTjUYviXHR-sEOMcS9k2Hw":{"text":"I really enjoyed the food at this place. When my friends and I first walked in the hostess","useful":0,"cool":0},"LhW3zogmP-zn6GHlT-EnvQ":{"text":"Very impressed.  Vegan rico was not really what I was expecting from the menu description ","useful":0,"cool":1},"JBnoh46g7wC0GEK_zxYivw":{"text":"I was looking for something vegan downtown close to work and came across this cool spot. T","useful":0,"cool":0},"8XXSRy408Jos4wxth7aWVA":{"text":"I wish I could give it a 5, but the great food and cocktails doesn't overshadow the warm d","useful":3,"cool":1},"SiclUxd3xgFSz2UOpNBxJA":{"text":"Food was great and a nice change from the typical fried food in NOLA. Service and cocktail","useful":0,"cool":0},"-ewgRl4tzhAHuWpQdLLebA":{"text":"The Carmo salad is AMAZING. In fact, I believe that all of the salads are delicious! Three","useful":0,"cool":0},"XaFRDcBO2XrvnKsmrZ-BIg":{"text":"I got the Vegan Rico. One of my top 10 dishes of all time!!! The dressing on the salad was","useful":0,"cool":0},"YaCOLeuZ683N4PIxS70C3Q":{"text":"Amazingly tasty vegetarian/vegan/generally healthy food. Fresh juices are strange and wond","useful":0,"cool":0},"8UHvCK1vuz8KX-8L7WnsNQ":{"text":"High quality food! Good for vegans and omnivores alike. The kottu appetizer was amazing. A","useful":0,"cool":0},"-qHKa51hYiswRxWVtHCLKA":{"text":"This may have been the culinary highlight of our trip to NOLA. We stumbled upon it and are","useful":0,"cool":0},"tpT_IxNZP2RH77Hw5DlMDg":{"text":"Love love love!  Give your stomach a break from all the rich New Orleans food and awaken y","useful":0,"cool":0},"fFSZateSwvXcWLDUa-Z-gg":{"text":"Carmo has a WONDERFUL vegan/vegetarian selection! The food is amazingly delicious. Friendl","useful":0,"cool":0},"0boTVOKt49YJ8FmLJr6X5g":{"text":"This was delightful. Well worth it.  Very cool, everything we had here was well-thought-ou","useful":0,"cool":0},"z3n5povvZ2rwBADT91DIGQ":{"text":"\"Veggies go nuts here\" is an underplay to the food you get here. The creative cocktails an","useful":0,"cool":0},"Nv6RyirkV6zQmMtRuVBsBA":{"text":"A real oasis for a vegan in New Orleans:  wonderful Carmo salad was light and filling.  Ve","useful":0,"cool":0},"_uW4hQ1pg0RhjHBxs0zHrA":{"text":"Everyone was super nice but the food and drinks took forever to arrive and the food when i","useful":0,"cool":0},"Ydyq7rchSJL3rheIqyMXWw":{"text":"We had a healthy tasty lunch here. Food was quick to reach our table and the cafe style di","useful":0,"cool":0},"FAPYom0VrPnI75e3VCDP2g":{"text":"I got the Rico sandwich this time and it was delicious and more than enough food. Maybe th","useful":0,"cool":1},"VYopLaMmsn97O22dh1c4Uw":{"text":"Been here 3 times while working in NOLA. If you want something aside from another derivati","useful":1,"cool":0},"SQjnyEHgAfEsgcYpEKobTQ":{"text":"Delicious! Great change of pace from the typical New Orleans cuisine. Staff is super frien","useful":1,"cool":1},"nTo-YtY0RmOnEPvU1QDFcw":{"text":"Amazing food and fresh juices. I highly recommend the coconut which is freshly cracked ope","useful":2,"cool":1},"dKFZ_itJM5vDeOzGFwmPog":{"text":"We really enjoyed our meal here.  They are one of the few veggie-friendly restaurants in N","useful":0,"cool":0},"Ir9BagpkYcMPS-vnD0TejA":{"text":"If you're vegan, go and get a vegan banquette bread - very tasty and worth it! I got the C","useful":0,"cool":0},"PmmNZrFz9jj1xlJ0Xn04IQ":{"text":"Go here.  Just go.  Hard to explain.  Nothing normal or traditional about this menu.  Was ","useful":2,"cool":1},"7sEbM6EIy_QOuguleoXAMA":{"text":"While waiting for our son to finish his orientation, so the wife and I decided to check ou","useful":2,"cool":2},"IjPqb2dlR3486l_FC4Sv8g":{"text":"This place is trendy with an exotic menu. Everything I tasted was delicious and fresh. The","useful":0,"cool":0},"n3YwYViF9ukqwnox7BC8hQ":{"text":"Oh my gaaaawd this place is amazing! I got the Peruvian bowl and it was delicious. A littl","useful":0,"cool":0},"Hnw1ME3XXBwKPgjIzvY3Sw":{"text":"My vegan relative was in town and wanted some good vegan food that I brag about.  We stopp","useful":0,"cool":0},"FacCXcYxCN31EETKnEtiPg":{"text":"WOW!!! I wish there was an option for more stars! This place is so fresh. The yellowfin tu","useful":2,"cool":0},"fjShCCkGnuPt6dmqKwvTYg":{"text":"Wow... I've been here twice in the last four years. I would gladly come back once a month ","useful":0,"cool":0},"uJ5Hx-bt4wSBu-DNwXAZFw":{"text":"Loved the food! Got the Rico sandwich which i made vegetarian and it was so good! Just the","useful":0,"cool":0},"RpSFtLg0z7JZ9MWW-YFRVA":{"text":"Some friends took me here because they wanted to go to a vegan place. I agreed to go becau","useful":1,"cool":1},"NNSAhhXkGuq5ZhC_Azssfw":{"text":"Food was very good, service very polite. However, after a pretty extensive wait for the fo","useful":0,"cool":0},"EKGMrrm8BHo0GzwUR3ICig":{"text":"Great veggie/vegan attitude & options that still welcomes carnivores! I was torn between t","useful":0,"cool":0},"Coc4QSG9haIomtXxxFKVkQ":{"text":"This new restaurant is located downtown. It's a very cute restaurant with roll up doors. W","useful":0,"cool":0},"40IHZVeJ0z1C0yUsLoTjCQ":{"text":"My wife and I are thrilled to have found this place. We both spend a lot of time in Latin ","useful":0,"cool":0},"o-EGcqQJtTovBIC0T1tP8w":{"text":"Great lunch spot just up the street from my hotel. I had the broken noodle salad and it wa","useful":1,"cool":0},"NcIgAsFQCE_YaUlWdjzn-g":{"text":"Bottom line: A bit out of the way, and that makes it that much better. Delicate dishes in ","useful":0,"cool":0},"h_4zRXh3yveBIwkqqTc_Kw":{"text":"The staff and food at this establishment are great. We were greeted warmly and presented w","useful":0,"cool":0},"0Kk_3YVJBVmt7rdAuwu_sg":{"text":"I ordered a ceviche. The amount of food for the price is really not great during lunch tim","useful":0,"cool":0},"gp06tm0BRehmWsa2h0aFXQ":{"text":"The only thing that I would suggest to the folks who own this restaurant is that they rais","useful":0,"cool":1},"XSCbKiFYjx-QSozrDzTIBA":{"text":"Amazing food! The Brazilian food was different from anything I have had before and was del","useful":0,"cool":0},"0ul_jzJbjz-4A0R2mTSEIA":{"text":"The best food I ever had keep doing what your doing so yummy and fill. When walked out of ","useful":0,"cool":0},"LoQ00Md-JIuEbMFQAdtphg":{"text":"I loved this place. I am not one for beans or veggies but this place changed my mind so fa","useful":0,"cool":0},"2Zy9UFH6gRV6s8tqJIWwgQ":{"text":"Amazing ! So many vegan options and non vegan options , large salads fresh juices and staf","useful":2,"cool":1},"JzPI5GVYpyW4BhHULOBU-A":{"text":"The food is incredible. Theres no doubt about that. Bummed about 3 things: (1) our meal to","useful":0,"cool":0},"Es-9b-xJDuxKUTZ1h0Kb5A":{"text":"Great, healthy, imaginative food. Slow service. My friend is a vegan and I eat paleo. We b","useful":0,"cool":0},"jz6vstwRUV-t7p_lKKyJNA":{"text":"Loved it - as a non dairy person, i am not surprised if a server at a restaurant looks at ","useful":12,"cool":6},"UGGu083vCgB9y-DbLebJMA":{"text":"This place is a GEM! Of course my eyes are bigger than my stomach, but I wanted everything","useful":0,"cool":0},"H7jYBn-o9dKwQ6H9WjIM0A":{"text":"Yes, yes, yes\nIn a city where we left our diets at the airport, it was nice to have a fres","useful":2,"cool":0},"ufmO5XnH3zP48Cg8HfNUZA":{"text":"Carmo was everything I had hoped for! Great drinks and amazing, fresh vegetarian food. My ","useful":0,"cool":0},"XIMiQXMEILDgqt39V6PQxA":{"text":"Maria was a great waitress. We allowed her order everything for us. Best meal in New Orlea","useful":0,"cool":0},"kkd85FfdcgQwLVEjmJGHzQ":{"text":"This place can take some getting used to. \n\nYou have to know to order up front. Someone be","useful":6,"cool":1},"18KLJKjrzCQtV27J1oi-tg":{"text":"My new favorite place to eat in New Orleans and a new reason to want to move there.  Had t","useful":0,"cool":0},"Twyuqm-HglmbZZAF9O7rFA":{"text":"One of our favorite meals in New Orleans! The owners are great people and the menu is fres","useful":0,"cool":0},"hTEmJ3dKT5LA_l-PChOYdw":{"text":"Best food we've had on our visit to NOLA. The Esmerelda salad was so good. So much flavor ","useful":0,"cool":0},"LtAINRdNkbqK7AFc_Yj8ow":{"text":"Love this place. Amazing food with many vegetarian and vegan options available. Hippy staf","useful":0,"cool":0},"sV03fovTMkKpctkrGoAB7g":{"text":"This was our first visit, stopped in for lunch. The food was unique and thoroughly enjoyab","useful":0,"cool":0},"Ezekv9h4HnpkudUcES9ieQ":{"text":"Ate Carmo's Rico sandwich and I j!zzed in my pants.\n\nReally, it's that good.\n\nSo is everyt","useful":0,"cool":1},"YVGHi0L0Ph9OwZ9VeqBgMA":{"text":"While walking to the WWII museum we stumbled on this awesome place with a garage door in t","useful":0,"cool":0},"AmWk34a1hD91CdIRC4bgGg":{"text":"I had heard so many good things about Carmo for so long, so I made a reservation during my","useful":0,"cool":0},"xomdnxyuHzkXb-gOt-apIA":{"text":"The staff are very friendly and helpful. The atmosphere is artsy and fun and the food is d","useful":1,"cool":1},"ezm_ItpQhjK0PmvObmbZ4g":{"text":"Owned by a Brazilian, this place was just amazing! Everything was delicious and, as Brazil","useful":0,"cool":0},"S9KzAwho0bygL0mZk8MNYA":{"text":"One of my favorite Nola restaurants. All of the food tastes fresh, and they have nutrition","useful":0,"cool":0},"Fhqi4zNnhS41WBZ0XwQ1pA":{"text":"So torn on how to rate this place. The food is amazing! Seriously, it's AMAZING! So is the","useful":1,"cool":0},"NqpGTxK0JArNmLN98Trb2Q":{"text":"My secret spot in the warehouse district! What a gem. The eclectic latin/ Asian inspired m","useful":0,"cool":0},"d3SViLfNCTbrWFRrg99QrA":{"text":"Unbelievably great value for New Orleans. Freshest, high quality ingredients, great staff ","useful":0,"cool":0},"PqPcQE7SJqsj_d3rgtJ6GA":{"text":"Vegetarian and Vegans rejoice! This is such an amazing find I'm surprised I didn't come he","useful":0,"cool":0},"EJPwpz_bP_QuDCgFUuaCoA":{"text":"Soooo good! After days of eating too much fried food, I was desperately craving something ","useful":0,"cool":0},"kX4_WqZU5SE0EZRkBe9-1w":{"text":"The food in the service was excellent. Everything on the menu could be turned vegan and ju","useful":0,"cool":0},"KOAK5XqBkSSElKas-R2jAA":{"text":"This restaurant has a 'pan-tropical' inspiration, but I would say the dominant theme is No","useful":0,"cool":0},"rt9Bil7oJUQlQV6zBJ8xMA":{"text":"Food was absolutely amazing! Tons of great vegan options and a full bar with good beer and","useful":0,"cool":0},"bhynWAtHFmDOxAWEXJFTaw":{"text":"I don't get what people love about this place. We paid $75 for a dinner of mostly salad, f","useful":1,"cool":1},"kllfUrYXaoEiVDK-MRtycQ":{"text":"Loved this place so much that I ate there twice during my 4-day trip to NOLA. The Carmo sa","useful":0,"cool":0},"H985bgLReZSQVuYpNj2-kw":{"text":"Hooooray for more Carmo! This is definitely my favorite place to get lunch in the CBD. \n\nY","useful":12,"cool":10},"6yGswlD6Wx3GyAYPToazYA":{"text":"Delicious, healthy and fresh!  They were literally cutting the onion slices off the onion ","useful":3,"cool":4},"tmIvcXzQXSDlQGifOVza7Q":{"text":"We love Carmo!  This was our second time back, bringing guest from out of town.  Everyone ","useful":0,"cool":0},"XTtWUYC2Wbmnll7_DczgJQ":{"text":"Here's the story that led me to Carmo. My wife and I live in Mississippi and the number of","useful":0,"cool":0},"0yT1okzRExYQHEWdwFhp0Q":{"text":"Very nice place. Interesting, different, and very tasty food. A little odd that you choose","useful":1,"cool":0},"kLAdTeENTHddu9GSnkEzGA":{"text":"Wanted to visit this place for a while & finally went yesterday. \nIts perfect for lunch. S","useful":1,"cool":1},"-TpPrGnUtV_0vPTwadFPuA":{"text":"Popular hipster eatery, fun, unusual fare requiring a sense of adventure. I enjoyed the Ri","useful":1,"cool":1},"Iev00I5NK8d5BL0xd8lQkQ":{"text":"Delicious, hip, and fresh!\n\nMy girlfriend and I stumbled across Carmo while walking toward","useful":1,"cool":0},"QKFuio_SlFrSd-CxBIR8xA":{"text":"The food is great, and delicious. Best part the cashier will tell you how the new greens o","useful":0,"cool":0},"LLws7jRKG0C7xgRVmBVyog":{"text":"The food & drink were great and I loved that there was something for everyone in our group","useful":0,"cool":0},"OO9LioN6PEWKZcA8WOMMUg":{"text":"Amazing! I love this place! The food is really good, the juices are exotic, and their cock","useful":0,"cool":0},"LcdT_WLB_gbIQpOpaUCCTQ":{"text":"Delicious Broken noodle salad - would definitely order it again.  The Rico sandwich was no","useful":0,"cool":1},"aDRsU-_I3qiQgS50tWSFog":{"text":"Very special menu and very great mix of flavors. Very happy with the food and well priced","useful":0,"cool":0},"9sfrwoaonYXGxUpV7SKWig":{"text":"Found this place on Yelp for lunch and was not disappointed. I got the fish curry bowl and","useful":0,"cool":0},"ldvdcc7k1VdqeFJn1Hkejg":{"text":"great for vegetarians or vegans or those with gluten free diets!  Kind of a run down place","useful":0,"cool":0},"9sdAuU_oCeqR8IH3blGOQw":{"text":"Roommates and I found it because we were looking for a good chill place with vegan options","useful":0,"cool":0},"1qCrs7kziP_7uJUgArB1pQ":{"text":"Great food everything was good my girl a vegan and they had everything she could enjoy whi","useful":0,"cool":0},"FaiBGP0uNerhqhGYurXXMg":{"text":"They seated us across from a woman who had vomited on herself and was passed out. We infor","useful":3,"cool":0},"SDWKfKIqtIPP5ouAQjPIpA":{"text":"SO GOOD! That's all I have to say. Go here and try their food. My boyfriend and I came her","useful":0,"cool":0},"sAOdb3Nzjt8N6WhEZbuE0Q":{"text":"Awesome food and beer.\nEveryone is nice and helpful.\nReally pretty and calming feel inside","useful":0,"cool":0},"HmOACAaTkUI3K7UlYPcxlA":{"text":"Quinoa salad and Rico pulled pork open faced sandwich were delicious. We'll definitely com","useful":0,"cool":0},"F85xKkBWqUTrm_f99Zjc-w":{"text":"I love this place. Food is good and not the norm. Great options for vegan/vegetarian!","useful":0,"cool":0},"GSDK-5WiMTlr6xc-R2J6AA":{"text":"We went on a Friday brunch - it was a casual vibe, tasty food that you can make vegan. The","useful":0,"cool":0},"WdPlO6VftjJf3HqDh_zlrQ":{"text":"Very unique flavors! We came in around 9pm and had no problem ordering and quickly recievi","useful":0,"cool":0},"j7OYCmgUDOn0NBHFW3n5OQ":{"text":"I'm so in love! This place is just awesome for finding something for someone with a gluten","useful":2,"cool":1},"GmP-46ybEOmioLVid5UI6g":{"text":"Carmo is without a doubt our favorite place to have dinner in New Orleans. We go every Tue","useful":0,"cool":0},"JIONgMNGBE86oQy0-i7JaQ":{"text":"Food was okay; good ambience and juices.\n\nPros: Variety of dishes(cuisines) to try from.\nC","useful":0,"cool":0},"f15LT-3w_ENoVOf-b4SvFA":{"text":"Excellent\nStaff was friendly   Food was really wonderful.   Atmosphere was relaxing and co","useful":0,"cool":0},"RItV9zsGinL_Pf0OBYhVrw":{"text":"Went here yesterday for lunch and it was pretty good! As you walk in, you have to go to th","useful":2,"cool":1},"YOPzjTxu0SlV_blnQ3v7dA":{"text":"Menu is somewhat limited for me given my allergies to coconut and different types of nuts.","useful":0,"cool":0},"SRR3-5_h2bzYCSS_VM16Gw":{"text":"The food is eclectic and flavorful.  Dining with our baby in tow worked out wonderfully.  ","useful":0,"cool":0},"vJ0dA-2d9zJF9L-3c_mEMQ":{"text":"Great little find in Nola on my global quest for healthy vegan options. Funky inside and l","useful":0,"cool":0},"SpB1TawTqIUhO3LdwAU6ZA":{"text":"Excellent vegetarian food - I loved loved the Peruvian corn, quinoa, potato soup! The Esme","useful":2,"cool":1},"JqDCAAPhVcRgtZ6DOq22tA":{"text":"This spot was my food highlight from New Orleans.  Highly recommended and will go back nex","useful":0,"cool":0},"Yxvj8fwtSvp4MVbR20rGTw":{"text":"Good vibe, nice staff, unique menu. I ordered a rather boring sandwich and regretted it im","useful":2,"cool":3},"QK3AMglNpRg6tmTkTmsQqg":{"text":"My husband and I love this place. I have Celiacs Disease and they totally get it. I can go","useful":0,"cool":0},"7GRaohxlM4dZkvNaxQtDNg":{"text":"Delicious!!!!! The Mofongo is the greatest thing ever! Great drinks, service, and atmosphe","useful":0,"cool":0},"fHKEtn1lkDnoX0aj0mgMRw":{"text":"After moving to New Orleans (possibly the most difficult place to dine out if you are vege","useful":0,"cool":0},"y--1oqmB1lxk_GNAZA4EiA":{"text":"We were so excited to find this restaurant right after we arrived in NO.  My husband & I b","useful":0,"cool":0},"ilsf4BdNj47-pXhPCOWtTw":{"text":"If you are a vegetarian, maybe you will like this place. But if you are not, please do not","useful":1,"cool":0},"1MX4MR-Q2aJAUpwcSfYeog":{"text":"My friend and I ate at Carmo our first night visiting NOLA. The food and service is amazin","useful":0,"cool":0},"94GwNIATreme3JeGhxChAQ":{"text":"So New Orleans was fun and all, and I certainly would like to visit again someday for a va","useful":1,"cool":0},"pHeYKTqMGZQAcPYr6SYxwg":{"text":"Delicious food. Good vegetarian, vegan and gluten-free options. Great service. Decent pric","useful":0,"cool":0},"HkUS7yNguseHVHokEFRvHQ":{"text":"never would i have thought that i would be in new orleans getting brazilian food as a vege","useful":1,"cool":0},"QgHyoSHQRq7uOlAfVqo8gw":{"text":"A co-worker friend and I were in New Orleans for work. Her being a vegetarian and me not s","useful":3,"cool":1},"i9bMVKUh340B8n-3mPAtkA":{"text":"We were so excited to find a vegan place in New Orleans!!!!  I love Carmo.  The people are","useful":0,"cool":0},"FvSWHa9qCfVZ8d85AuK5dg":{"text":"Eating at Carmo was a great change of pace from the typical hearty New Orleans food. Altho","useful":0,"cool":0},"UBBnYe04V7j60jYPuRMBQA":{"text":"Lunch on a Saturday, the eatery was half full but a short line at the counter, so the kitc","useful":0,"cool":0},"4DIrLpXijwMJwsBBBS2M0w":{"text":"Our family has to eat Gluten Free, and we are grateful for the culinary creativity at Carm","useful":0,"cool":0},"BMqf2hiODzRBO_ZYDV_2sQ":{"text":"I ordered the vegan Esmeralda salad as my entree. Visually it's not a very exciting lookin","useful":0,"cool":0},"KpsbACdogSNcqWsceNNEcA":{"text":"Came here on Friday night without reservations. We were first told that it will be an hour","useful":1,"cool":0},"lMx9PbwyEAmC7OttChH1Uw":{"text":"Been here many many years!  Can't figure out what's going on but employees don't seem to k","useful":0,"cool":0},"fcrwqdPMYsMkpyBByq8szA":{"text":"Great spot to grab a quick lunch if you are ever in the area. Stopped here after a trip to","useful":1,"cool":1},"CxgyKqCaVG2KEsCcYdzxZw":{"text":"This is a very cute and tasty little spot!  I had the Esmeralda Salad vegan-style which wa","useful":0,"cool":0},"_g5sa-_w6CtA01lL1s5iVA":{"text":"Ate here last night when searching for vegan options. Was yummy- no complaints. Staff was ","useful":0,"cool":0},"GEwT98OtLLGUMotVTAFQ3w":{"text":"Omg the food at carmo is so fresh. The juices are a must! So yummy! I also like that the p","useful":0,"cool":0},"ffMAKcEMapiqp0mzjXgo1g":{"text":"What a cute little spot! It's so great to find a awesome variety of healthy food in New Or","useful":3,"cool":1},"QlkGEGrDk8ziSYkftWRDyw":{"text":"This place has one of the most delicious drinks I have ever tasted..... The passion fruit ","useful":3,"cool":2},"MxW1qgGthWdTgyeLC-objw":{"text":"Tried Carmo out after taking the usual hour to try to decide where to go for dinner (there","useful":1,"cool":0},"8_R__Ju4T58ALoUeukjszw":{"text":"I had the black eyed pea fritters at Jazz Fest and they were yummy but it was the Esmerald","useful":1,"cool":1},"V6n8uFhWkN9s6pwyUp3sVQ":{"text":"so expensive for not much, service during lunch was horrible! I had a green salad in which","useful":1,"cool":0},"aHSuWf4TDtGu-h2nnIcNJQ":{"text":"Absolutely love this place. Only been here twice...but everything is so fresh and creative","useful":0,"cool":0},"0eKfVZB6vbQkW0nzpZtxFA":{"text":"I love this place from the bottom of my heart. I live in the neighborhood and sometimes co","useful":0,"cool":0},"Sq7nWsmpDoNBrsH7DQqFVA":{"text":"amazing! I had the vegan fejoada and the brazilian cheese breads and everything was fantas","useful":0,"cool":0},"GiQDUN61RyJ2_IVVMCIeXA":{"text":"This is a beautiful modern space with a great staff that serves food that made us speechle","useful":0,"cool":0},"aiPqe_oQV1J_NBJEtyXXNQ":{"text":"I adore this place and want to bring it back with me to New York!  Carmo is an eclectic, f","useful":0,"cool":0},"fuhYfcPsYwisxeTzQBWxwQ":{"text":"Really just fine food, nothing too special, but I suppose it's filling a niche in a city d","useful":2,"cool":0},"iIppVajMgrwBltVR0rF92g":{"text":"I had the vegan Rico sandwich and tamarind margarita. The food was great, and several peop","useful":0,"cool":0},"GRe26vejiTxwY--xrsfapA":{"text":"My first time visiting New Orleans and my expectations were not high for vegan options. Fo","useful":0,"cool":0},"qBOlm5mOsOBtHNsQNoSRrA":{"text":"Tried based on previous reviews and we were not disappointed. The food is excellent and th","useful":0,"cool":0},"tMPhgH3KWX2abPsnQ54FBQ":{"text":"Guys, DO NOT GO HERE if you want hearty food, generous portions, functioning air condition","useful":0,"cool":0},"sDCFefItBL5vdMvKNDhzvA":{"text":"This place is so darn good. I've now gone while on two trips to NOLA, it's great for vegan","useful":0,"cool":0},"U8nnG5canh1pOJSucwzSrg":{"text":"Delicious salad. Full of flavor and tasted very fresh. The whole menu looked delicious.  C","useful":0,"cool":0},"4kOZJt5O8FKjWYB5Jvt5KA":{"text":"Sensational! is the word that comes to mind when I think of my meal at Carmo. The overall ","useful":6,"cool":5},"f-X_SHHi8jayh_X6Upkv_Q":{"text":"I was here the last time I visited NOLA and am so happy I found it again! You order at the","useful":0,"cool":0},"T6a2vXaQTcs8wsQzhOySyg":{"text":"With limited vegan options, we decided to stop by Carmo on our way out of town. \nYou have ","useful":3,"cool":2},"d1tYyMYg15YxW76Wr2jYwA":{"text":"Nice ambiance... Food was good, not great perhaps, but it is definitely nice to have a goo","useful":0,"cool":0},"DQVhBA1eYZelExDcYdN0gQ":{"text":"PROS- tasty food, colourful place , VEGETARIAN too, pleasant host, must go.\n\nCONS- not muc","useful":0,"cool":0},"5G6wpp6grEkCpy8K3OFQ3A":{"text":"I wanted to love this place, because there are so few places in New Orleans that realize v","useful":1,"cool":0},"kudYl2BfRyasUL1thLYfvQ":{"text":"Friendly staffs and delicious dishes! 8 couldn't give five stars because my friend complai","useful":0,"cool":0},"KrrNxO-2_3s66yA-u9MxFA":{"text":"Excellent Vegan Restaurant \nThe food is delicious and I can't wait to return.\nOne of my fa","useful":0,"cool":0},"bvByaQ5spS1D4taqz4FBNA":{"text":"Great local food. Excellent choices for vegetarian and meat eaters. Cool area in warehouse","useful":0,"cool":1},"Fecp9Ou07vjXuGIZu-NH-Q":{"text":"I have only been here once, and I was a little confused on how ordering food worked becaus","useful":0,"cool":0},"JFrkon16kWydbKkeh5nUcA":{"text":"Excellent food, vegan/vegetarian options which is a rare find in New Orleans.  Most dishes","useful":0,"cool":0},"fF42r99zDhqQYzoe06X62A":{"text":"Best vegan friendly restaurant in the vicinity! Great wine selection. Incredibly flavorful","useful":0,"cool":0},"HHXbRNwdSJiDqcockUO4LQ":{"text":"How is this SE Asian place so good? They don't even look like they should be serving Asian","useful":1,"cool":1},"XHrbYyw7YodddaFBhAvv4w":{"text":"My lunch here was terrific!  I started with their signature cocktail: Cajulia- Cashew frui","useful":1,"cool":0},"0zB-xBKjooXz5KvIpj_Llw":{"text":"AMAZINGLY GOOD.  The food, the service, the ambience = freakin fantastic.  We ordered a se","useful":0,"cool":0},"u8ZWAUphHZ30B5yHAT7Osg":{"text":"Very good.  I will definitely try again and hope to up the rating to perfect!  The Carmo s","useful":1,"cool":0},"MXdpQb5pAaD_vbihN3UwIw":{"text":"Hi Carmo,\n\nPleased to make your acquaintance.  It's thrilling to find a veggie friendly re","useful":0,"cool":0},"InrJrXhP0GYQauE47lt_9Q":{"text":"A CBD gem! Everything I've tried has been absolutely wonderful. I love real food, and this","useful":0,"cool":0},"zCgldyFxfNWPqtbBVed6pg":{"text":"Hey, you do NOT have to be vegetarian to enjoy Carmo.  The space is great, the staff is at","useful":0,"cool":0},"d7nvPmM9M33UcsDtaZxisQ":{"text":"What a wonderful place.  Delicious soups, salads and desserts in a very friendly and welco","useful":1,"cool":0},"APbRfRmAXscleiKT_3fMRg":{"text":"This was easily one of the best restaurant experiences, not just meals, that I've had in m","useful":0,"cool":0},"mLl3gf6pmw2qnyYPU5EYFA":{"text":"I'm just getting around to writing this review but came here a few months ago with a group","useful":0,"cool":0},"p4mVfTJZQlp2-X7Gis7QLQ":{"text":"Very unique place with a local and hippie vibe! They are vegetarian and vegan friendly and","useful":0,"cool":0},"y_ExD-9raQjGaYxHK9qsvg":{"text":"My dinner yesterday at Carmo was wonderful.  Excellent service!  Delicious food!  Their me","useful":0,"cool":0},"usckKpgJJ9cZWf490tWURA":{"text":"You know when you are at a great restaurant and you are eating the amazing food and you st","useful":1,"cool":1},"wGH7a2NjK_2Ex9XHM-AyoQ":{"text":"Wow, what a refreshing and healthy alternative to the usual Nola cuisine! Love the interio","useful":3,"cool":1},"YvRlCIkJ_Sgsix7Ndq7mnQ":{"text":"visiting NOLA and alone on a cold rainy night, staying in CBD. couldn't be bothered to go ","useful":0,"cool":0},"rQ5lumV4zF9crJ4QZ-LIFw":{"text":"Pure and freshest juices from the tropics.  The ingredients used are healthy, multi-grain,","useful":1,"cool":1},"5iNP78wJbBag21uP12Y3Uw":{"text":"Excellent cubed. The staff was very friendly and very helpful. We were glad to fund a plac","useful":1,"cool":0},"dsM9hVfF9FG_BJCvbL3RpQ":{"text":"I have no choice but to bump up my review to 5 stars.  The food here is really incredible,","useful":0,"cool":0},"vOIKDxrpQ4re7i-k6PXCDg":{"text":"Delicious vegetarian/vegan street food from around the world. Excellent salads. Especially","useful":0,"cool":0},"dIT8YK0QEVkZ8jwbgtn9hQ":{"text":"Really delicious fresh food. Tasted green, tangy and like just what I needed on a business","useful":0,"cool":0},"t1xP9FOiOlZQm7FdCxuTjg":{"text":"I was so happy to eat here!  Good music, relaxed & funky setting, great food.  It was easy","useful":0,"cool":0},"OP7g0sXAWy-fQl5GgLdYNw":{"text":"We were soooo tired when we reached NOLA, but I'm celiac, so finding a place that does glu","useful":1,"cool":1},"GXB-vrbpVGunfH2PaL8eTw":{"text":"Be brave and order something unfamiliar.  I was happy every time.  That peanut drink was i","useful":0,"cool":0},"LtIKI40r5wB7iWx6Lm4mYA":{"text":"OMG the food was glorious!!!! I got the vegan Rico and a Caribbean banana cake! Service wa","useful":0,"cool":0},"iSmOOJviPJ8CZo8ODKvFig":{"text":"I'm not vegan but if I was I think I would practically eat here everyday! Their food is pa","useful":5,"cool":1},"KcJ_RmNGW-vS9Po0UWIddg":{"text":"I'm not sure what the best part of Carmo is as it was all divine. From service to the artw","useful":0,"cool":0},"aEB0IShq25j3D_q48qt6xA":{"text":"Wow, just wow! I've read nothing but good reviews from my Yelp buddies about this place. W","useful":1,"cool":2},"0nMYFt_EpYWwhQ6QAnxsRQ":{"text":"I noticed this tiny little storefront tucked away amidst the art galleries on Julia Street","useful":3,"cool":0},"_9CoG1s2vGMq6gUmBZrusw":{"text":"I don't think I've met a kinder and funnier staff before! A friend of mine suggested it an","useful":0,"cool":0},"qTzuKM4NwSX6e7EXBiXHxQ":{"text":"Incredible. I came here on a friend's glowing recommendation and was not disappointed. I g","useful":1,"cool":0},"Ss82MgjdPrnnT7dXXNIhCw":{"text":"Was happy to find an eatery with tons of vegan/vegetarian options in NOLA!  I heard great ","useful":1,"cool":1},"i3vl5hdpZE4ESDjQp-9Tog":{"text":"Food was excellent. Customer service was poor. After having waited over 20 minutes for a s","useful":2,"cool":0},"UQELhIUY0PE5DbnVNW0nHg":{"text":"I was visiting from out of town and decided to stop here for lunch. The food was fantastic","useful":0,"cool":0},"usd30thF3AUDSpjaAZv26w":{"text":"Hippt lunchhak med god mat och sjysst atmosfär. Åt en vegetarisk glasnudelsallad ($11). Vi","useful":0,"cool":1},"gg2dXrsAX1NLuTopXoqpcg":{"text":"One word: amazing! Had the Rico, Sos Pwa as entrees and the Oh La La and CaCalvin drinks. ","useful":0,"cool":0},"E920K2fhq0anfSYjyfZF7w":{"text":"This place right near the World War II museum is so unexpected from New Orleans. The menu ","useful":0,"cool":0},"L5YCeCflLMufF21QV9LsZw":{"text":"This is by far my favorite restaurant I've been to in New Orleans. The service, drinks, fo","useful":0,"cool":0},"1M7k49ueFWwDrpsnPJCxoA":{"text":"I would give zero stars if possible \nWe ordered takeout to walk-in while they were prepari","useful":0,"cool":0},"xHmQXiRbXDcjrm3BL0L6EA":{"text":"I had vegetarian tastes from all over the world while sitting at the bar. Lentil soup appe","useful":0,"cool":0},"U4nFPB71GeRf75Q9ygcfHg":{"text":"My friend had the seafood gumbo.  I had the feijoada.  Both excellent.  Finished up with a","useful":0,"cool":0},"-z03Yd4Q3nl8QLeKGYbBCg":{"text":"We all sampled separate dishes and enjoyed every one. We also loved the super casual, frie","useful":0,"cool":0},"Jxwj1rJqGJaZZveOTGgNow":{"text":"Excellent food and service. One of the few healthy options in NOLA. Try the Esmeralda Sala","useful":1,"cool":1},"l_QWg0YTjz_3gafGNxdxXA":{"text":"Delicious food and great service! I love the specials that they have... it's always exciti","useful":0,"cool":0},"IIgM2R1Husb1tlvSGJQjBA":{"text":"This was above and beyond the best restaurant I've eaten at - the food was unparalleled in","useful":0,"cool":0},"Oxk1JWSPud0fwN1rVk68Ew":{"text":"Yum! Delicious, creative, healthy lunch options, and great coffee and juice too! The cockt","useful":0,"cool":0},"7S7aZTBlkQjfDtxu_wnh3g":{"text":"The food was creative and complex in both taste and presentation, yet simultaneously casua","useful":0,"cool":0},"qnbgCJ8OIoo5QVpGTyiySA":{"text":"Amazing. Was in New Orleans for 3 days and needed a break from all the super rich food I w","useful":0,"cool":0},"CWiHwUc0rqSijRe8NGE3Dg":{"text":"Delicious food with great healthy vegetarian, and vegan options. Ample menu options. Comfo","useful":0,"cool":0},"8Ee9JbxYW3nl39rSL00BxQ":{"text":"Having been in NOLA for two days, I just couldn't handle another decadent meal and despera","useful":0,"cool":0},"sP4izvskDlg85IQtYxi0TQ":{"text":"We just arrived in NOLA and found this gem on Yelp.   I had the Seafood Jollof and my fian","useful":0,"cool":0},"WTA8ev-PPIdvSURrOkm0qQ":{"text":"what to do when you visit New Orleans besides eating Cajun/beignets/and other local famous","useful":0,"cool":0},"EVL_WM5qr2FUC1cO9291Bw":{"text":"Vegan friendly plus amazing smoked seafood options - will definitely come back.  Very crea","useful":0,"cool":0},"oIRdrWmONu3IkfYPt9H6Yg":{"text":"Some of my fellow conference goers were on the hunt for a restaurant that was vegetarian a","useful":1,"cool":0},"3hTk3vTcYhOrZ__dB0y0AQ":{"text":"Multiple reasons for the rating : 1) salads were ok 2) liars... I specifically called them","useful":1,"cool":0},"tWnR_Z7cL_Rjj-swlhQM_A":{"text":"One of the freshest, most delicious places I've ever eaten. Fresh, clean ingredients with ","useful":0,"cool":0},"jIP5qpeTzz28Hz4-fMH-kA":{"text":"Yes.  Go.  Vegans and animal eaters alike will love this place.  Flavors explode in your m","useful":0,"cool":0},"u0n9QnXE8JKe_AKtmhnF7g":{"text":"I've been wanting to try this place out since reading about it in the Gambit and after I t","useful":0,"cool":0},"16GPiPUbGkjZszl9MSG0lA":{"text":"I looked slightly cross-eyed at this cafe at first, wondering what exactly is a \"tropical\"","useful":3,"cool":1},"BzGosq-vHti4b9AA9CF7qg":{"text":"Im glad I gave this place a second chance. The first time I went was quite a while ago... ","useful":0,"cool":0},"Gemkj4o4GnN4FAa5IMEcrA":{"text":"NOLA in itself is a treat for vegetarians and Carmo was a complete delight. Evrything in t","useful":0,"cool":0},"5_5ixFb27FlUumXmayVfWg":{"text":"Fast service, good food.\n\nWe got the cheese bread, roti, Brussel sprouts, Rico, Cambodian ","useful":0,"cool":0},"4pqzaq4qaMOf1A4rDyE2aQ":{"text":"One of the few healthy eateries in New Orleans. I actually feel good after I eat here AND ","useful":1,"cool":0},"yQF3mPZJdI6p50g5cIisdQ":{"text":"My wife & I had lunch here. Compared to some of the other vegetarian restaurants in New Or","useful":0,"cool":0},"7d-5OP0kDBHh1HqN_lOmyw":{"text":"In response to jmf f.s' (??) request for the public's affirmation of their issue with Carm","useful":0,"cool":0},"amqI04xe0Z-bkLvqZSbuPg":{"text":"Absolutely blown away by everything from\nService to food to drinks! I would come here ever","useful":1,"cool":1},"2EsttbW33seZ0njVDrppGw":{"text":"I was in need of good vegan food while visiting New Orleans and had high hopes but the ser","useful":0,"cool":0},"AOxcGrWOKXAfeXF_1A3cGQ":{"text":"This is my first visit but won't be my last. My server (Hannah) was wonderful, explained h","useful":0,"cool":0},"n-huctU0_xR_4fMahXqxhw":{"text":"Very interesting food, especially for vegetarians.\n\nTheir menu looks exciting. They are un","useful":0,"cool":1},"da_9MDULO2CxLX7U9T6xjQ":{"text":"Great food and service. I ordered the tea leaf salad ($14) and sweet potato/quinoa fritter","useful":0,"cool":0},"6hwrw9oF-F-RxJAKkI7bwQ":{"text":"Carmo is a small vegan friendly restaurant with tropical influences.  They have an open ki","useful":0,"cool":0},"DQlDv2D04kJLI_9F8o9NkQ":{"text":"Good food selection\nComfort food. We tried the Moroccan lentil soup which was just perfect","useful":1,"cool":1},"MIgWqcdeyPpKlY-jSoFzKA":{"text":"Since my veggie daughter was not finding NOLA food choices to be vegetarian friendly, I fo","useful":0,"cool":0},"mepOblwV4fdjp5VW71PWaw":{"text":"So good! i don't eat meat very often, but I got the Rico with pork, wanting to try it un t","useful":1,"cool":1},"71A4C7W8cFQ9SZvHt2-A3w":{"text":"Just a great experience here last night - before our banging evening at Republic.   Wonder","useful":0,"cool":0},"QyPUH_GWM5XjTcyouSbK6w":{"text":"While you can tell this place serves fresh ingredients, I wasn't overly impressed with my ","useful":1,"cool":0},"h_HQxIdUIbeN0aXHM1Z8lA":{"text":"Went to Carmo for our company holiday party.  The staff was awesome!  The menu was diverse","useful":1,"cool":0},"ujOdo6AOQY73LNWYCa5LGQ":{"text":"Delicious and healthy, yes! Every time I'm in NOLA I spend the first few days eating so mu","useful":1,"cool":0},"FteAHlVVKbkB6qhYPasBdQ":{"text":"Went here tonight with 3 people. 2 of which were gluten free and vegetarian so me and my b","useful":0,"cool":0},"QIsnM4TuQV6KxBG4CFARUg":{"text":"One star is generous for what turned out to be the WORST experience we've had at a restaur","useful":0,"cool":0},"36UR-0yWBzh4hik_rvFIhg":{"text":"Ive been back to Carmo a few times since my initial review and plan to go many, many more ","useful":0,"cool":0},"D1I9xLM3dG30sMFp4pk51g":{"text":"Great restaurant with great options for gfree people too!  The 4 bread bites were amazing!","useful":0,"cool":0},"B1X4IScOeTHT_7HXsSNUHA":{"text":"Wonderful find in NOLA.  Wish I had discovered this restaurant earlier during my week ther","useful":0,"cool":0},"v620tBnihZtPzgsWnSG7CA":{"text":"I ordered the Rico. Since they call themselves Brazilian Restaurant I went to check it out","useful":0,"cool":0},"TGI1agArKoUulq37nrsrrQ":{"text":"I am a vegetarian (sometimes a vegan) who traveled to New Orleans in March of 2013. This w","useful":0,"cool":0},"LF_hWcHtD7BL-Q-2tdU-mw":{"text":"We ate here last night. We chose it based on the vegetarian options but they have plenty o","useful":0,"cool":0},"GPTeHzvffrX44R7dXfNx6g":{"text":"Great local spot to eat. Went with a group of friends and we all enjoyed what we ordered. ","useful":0,"cool":0},"pTxKe_8v49QeMrTq2Ckc9g":{"text":"I love it, try the fresh Brazilian juices, just heaven.","useful":0,"cool":0},"0TU4Os_0OrUEEWZyQaqHXg":{"text":"When I review places, I base a five star rating on how close a place comes to meeting it's","useful":1,"cool":0},"N0uPLhWxyWMVY_hQ35vBdg":{"text":"Excellent. Staff is over the top friendly. Oh LA LA  was very refreshing. Carmo salad and ","useful":1,"cool":0},"07cmEWa7WnzlMeRojsV6FQ":{"text":"One of the most unique and interesting restaurants I've ever eaten at. The dishes here wer","useful":0,"cool":0},"A85RXVm1FD_7nsZOHzB6FA":{"text":"We found this place by accident and what a pleasant accident it was. Eating at Carmo felt ","useful":0,"cool":0},"SFeupPwH-nPDvFRzXnEepg":{"text":"Super delish bunless sandwich. Didn't fill me up tho for the price. Cute setup tho.","useful":0,"cool":0},"wyafYREYAmHB-609JmbZWg":{"text":"The food was really good, awesome vegan options.  Definitely took a long time for everythi","useful":0,"cool":0},"otiz3gxQcJveOtt9J7iPcw":{"text":"I'm a little perplexed by this place. I was suuuuper excited to eat her on my final night ","useful":0,"cool":0},"4014jJoYg8lBv36T_0Ukbg":{"text":"Needed a salad after all the salty foods in this city . I had a full broken noodle with sh","useful":0,"cool":0},"W25IzgKJ0Z3ZTZPuktcg7g":{"text":"Fresh, nutritious and flavorful vegan/vegetarian food in New Orleans? Yes please! In a cit","useful":0,"cool":0},"6ZoDIbnTViS023aCAb4l5A":{"text":"It's been a really long time since I've had a meal this good in New Orleans. The food was ","useful":0,"cool":0},"3FwMcHIicweVQxCSBTK1YA":{"text":"We loved this place! The Esmeralda salad was amazing!! So was the Yellowfin tuna salad. We","useful":0,"cool":0},"C7PUEzeXOHZfO_5t-9DADw":{"text":"I've eaten there many times and the food always impresses.  I can always taste the time an","useful":5,"cool":1},"keKe8ydxB6SouVyac0Q2Aw":{"text":"Delicious!  I love that Carmo has amazing selections for both vegans and non-vegans, so ev","useful":0,"cool":0},"LAkTj1OuLZanmMLZeDjuOQ":{"text":"The food was very flavorful and fresh. It was perfect for a hot summer day. If you are try","useful":1,"cool":0},"ycvAN5bnCd5amzCOFsQyIw":{"text":"If this is what vegetarian brazilian food tastes like I can't wait to eat more. In fact,  ","useful":0,"cool":0},"sdMYc-vCPbrDwizrDq-WPA":{"text":"Oh yum...  Carmo is a fun, quirky place to have a creative flavorful Brazilian meal.  They","useful":0,"cool":0},"GyI5QjLX8QIt880Tq6iGCQ":{"text":"We had a great experience at Carmo last night. Peanut cocktail!!! This place is folksy and","useful":0,"cool":0},"oG5GmS4m-mJ-r0PIO4p5Ew":{"text":"This was probably my favorite meal while in Nola this week. I had the vegan Rico and loved","useful":0,"cool":0},"x4jfNgoTVTBQ9M1qjRv92g":{"text":"This place is really good, with a nice exotic menu. I do try to eat vegan while going out,","useful":0,"cool":0},"VawOSyCU5kFcOrtCscW3ZA":{"text":"Great place for lunch, the flavors of tropical countries and southern spices fit sooooo we","useful":0,"cool":0},"jqB1RplDq6vjWPEPjxzatQ":{"text":"Had the rico sandwich and it was really delicious. Sweet plantains, savory, succulent pork","useful":0,"cool":0},"GsmObUyWUt6GOJmeAofxQw":{"text":"I've been eating at Carmo since it first opened and was a tiny space serving food on very ","useful":0,"cool":0},"_fX08UumkyHlC-BjCoDVZw":{"text":"Carmo was a refreshing restaurant with delicious, healthier food than I'd been finding in ","useful":0,"cool":0},"27eYBpkAW3zqANJe4D76-A":{"text":"Loved this restaurant. If I could have licked my plate clean, I would have. Try the creole","useful":0,"cool":0},"kMynoTfRwQhC9djs9HrM8g":{"text":"Dinner here was amazing!  Both hubby and I are veg. They offer some meat dishes, but have ","useful":0,"cool":0},"8Ffpx-zQTIsa7t8tehF2Uw":{"text":"I knew it would be hard to find vegetarian food in NOLA but luckily we stayed in a hotel a","useful":0,"cool":0},"fKKrQAr26fTTpXfznDGo6Q":{"text":"Food was excellent, creative & inspired. I loved the veggie substitutions, it was great to","useful":0,"cool":0},"6HV-TgB5aCUjEyRIAWNHuQ":{"text":"I had a hunkering for good vegetarian food, so whipped open Yelp and based on the reviews ","useful":0,"cool":0},"DjW_utjiimFybjRfXadEIA":{"text":"The food is really good. Started with the Pão de Queijo, the Brazilian (I believe) cheesy ","useful":3,"cool":1},"em1fEDow5i4Hdl7QTDY7uA":{"text":"Our dinner was delicious, the service was awesome, and the atmosphere so chill and relaxin","useful":0,"cool":0},"cHBUSuTWgMCK87mAgwL0ZQ":{"text":"After eating fatty and fried foods over the course of several days, we wanted a fresh and ","useful":0,"cool":0},"e9qjxccNCrQo6ggH50SH5A":{"text":"Four of us went to Carmo last night and had an excellent dinner. They were super busy and ","useful":0,"cool":0},"JEN9jDWrhaZ-1-M-ErF8gw":{"text":"We ate at Carmo 3 times while visiting New Orleans (and previously during a trip in 2016) ","useful":1,"cool":0},"eokzTS_ceQ2jBqP5hz1T3g":{"text":"Very flavorful and fresh tasting food.  Don't miss out on some great food at this little r","useful":0,"cool":0},"riIueYEqwAyoUEz4MStoiQ":{"text":"Eritrean special with the crab fish and shrimp was awesome! My boyfriend got th Rico with ","useful":0,"cool":0},"YFeNEQRdLKoTwukKvSXVBA":{"text":"I've been hearing mixed reviews about this spot but I wanted a grunchy/granola type sandwi","useful":4,"cool":5},"RY372RtLS9VTjP9FZlOXyw":{"text":"I can't say enough good things about this restaurant. My family is very restricted on what","useful":0,"cool":0},"9v7zvqKRyCpMi6XR7jGLvQ":{"text":"I am vegetarian and i have been to a few vegan/vegetarian places. This is the worst restau","useful":0,"cool":0},"J6djxzKwB8CkBx-R5OD_5w":{"text":"Delicious!!'delicious delicious! Yummy, food was amazing, great staff and good service. I ","useful":0,"cool":0},"QQWlFjJhHuwA7g3AfJLnhA":{"text":"The vegan \"meat\" substitutes that this place has are amazing. The Carmo salad with fake po","useful":0,"cool":0},"zirstRvcmGMUvxExKKOeYg":{"text":"Two famished vegetarians decided to try Brazilian food for the first time in my favorite c","useful":1,"cool":0},"tisbMFmFotUFlwV10gcmmA":{"text":"Amazing gluten free food. Fried tomatoes were not the best but at least they were gluten f","useful":0,"cool":1},"LKFkEL8OUTTwf1HJJGmmVw":{"text":"Difficult to find good vegetarian food in New Orleans but boy, this place is terrific. Had","useful":0,"cool":0},"Y4jGm1CUWM3xUJko8h806A":{"text":"Great find in the warehouse district! My boyfriend and I really enjoyed Carmo's for lunch!","useful":0,"cool":0},"q3KB58TPRwNcnVePWX9SSQ":{"text":"A vegetarian option in NOLA! I loved it and my meat-eater fiancé loved it. I had a vegetar","useful":0,"cool":0},"ZW1HtMh0vt1sP2tgMeqRAg":{"text":"So ridiculously delicious!!! I am meat eater, but this place would make it really easy to ","useful":6,"cool":6},"cEV6V-tTExkyjpunvxoxGg":{"text":"Not an expert on Caribbean and South American food, but I liked this place a lot. Some of ","useful":1,"cool":0},"9L0v6AevJsuCIYNzGWSVQA":{"text":"Was craving greens after too much rich fried foods. Great salad choices, vegan and vegetar","useful":1,"cool":0},"wjBIk10r7GXgVF8NWM7GXw":{"text":"Great, friendly staff. Great tasting food! Would have love coffee/latte option as well as ","useful":0,"cool":0},"ryU7xTXgG_nHINekCbBBqw":{"text":"Wow! Just wow! We stopped here on our way out of New Orleans. We were looking for a place ","useful":1,"cool":1},"SPxaKSoTHxywXUtgYZDPbw":{"text":"I got the Acaraje, and it was honestly pretty flavorless.  Out table used the entire bottl","useful":2,"cool":3},"8IH8OxmKHE6wNR_0P0hZpQ":{"text":"This is one of the few places in New Orleans that has vegan dishes. The broken noodle sala","useful":0,"cool":0},"sXhLDxk7uAaJ5lzrKrRUGg":{"text":"Delicious food. Healthy as well, which is a nice break from New Orleans fried everything..","useful":0,"cool":0},"Zd6nqYelpwn2w4J2LIA8XQ":{"text":"You know, I hate it when people write Yelp reviews claiming that some dish or another was ","useful":1,"cool":0},"ASZ1AnjW5L8NalYBpq2ARw":{"text":"The food is great, the staff is great, but if you are coming for dinner be prepared to wai","useful":2,"cool":0},"DCC2RzdX8UreXQD36Q-pjQ":{"text":"Such an awesome place. Service is top notch and their Rico is to die for. Only little thin","useful":0,"cool":0},"QCj3HEqXCPuDxmOYDzhnCw":{"text":"What a delightful find! Tucked away in the Arts District on Julia St., Carmo is a welcome ","useful":1,"cool":2},"EpEgCQP2G7AvuwCEIE5-hQ":{"text":"Their list of cocktails was interesting. There were some made with nuts. I definitely pick","useful":1,"cool":0},"xZhZNhGkF1k_JTEOD7KCuQ":{"text":"A special place in our heart is here as it was our first meal together in New Orleans.  We","useful":0,"cool":0},"hg8OHx-8UI6dKP7mGrxE9Q":{"text":"The perfect (healthy) end to a gluttonous trip.  Delicious Brazilian food served fresh.  W","useful":0,"cool":1},"RRMSj5qo1M2Iq3_NfoMpiQ":{"text":"This place is amazing for vegans and vegetarians. So many options on the menu. There are m","useful":0,"cool":0},"A5jtnE-7HJSZpGkaeCTboA":{"text":"Charming cafe in the Arts district with South American inspired food. Very vegan friendly ","useful":0,"cool":0},"QgwfW43F-8Z8kDlaYPjwpg":{"text":"If ever I'm downtown and I'm hungry, this is in my top 10 of places to munch. The menu isn","useful":1,"cool":0},"-AT7Gd50mmz_1EHN6UiVVg":{"text":"I'm really glad this place exists in this city where it is so hard to find good, healthy, ","useful":0,"cool":0},"3JjC89Rb-jnxuJ1yHGoPlQ":{"text":"It is easy to find the richest most decadent food in New Orleans. A little harder to find ","useful":2,"cool":2},"s7219Eo15cc1wCOVf_KNIQ":{"text":"Loved this place!\n\nCasual atmosphere.  You order food at the counter and they will bring i","useful":0,"cool":0},"kDd7mbIbeNSnS3DS_SjnbA":{"text":"My order - Carmo salad, veggie sandwich and passion fruit juice\n\nTaste - Decent. Wide opti","useful":0,"cool":0},"LENRThJVQi69sNhaltBtRg":{"text":"While the food was excellent, the service, wait time and overall ambiance were sub par. We","useful":3,"cool":2},"3mepcG3yV8XZqn1VQeNHsg":{"text":"I very much make a point of eating in this out-of-the-way café for healthy, vibrant, and u","useful":0,"cool":0},"fLvGSI8gfJPk-CoHUWM12w":{"text":"Was in town from Baton Rouge and wanted to try something new. The menu is extensive and ve","useful":0,"cool":0},"uaETRFM8yhUl0Z6IZKPDAg":{"text":"Excellent choice of vegetarian and vegan food.\nThe Cajun seared avocado is amazing. \nExcel","useful":2,"cool":0},"bbpdj49dpYbeSlJKSSqnbg":{"text":"The daily special is always a treat. Great to have a place that I can order from w/o worry","useful":0,"cool":0},"2Z396U4DORA1UavQqt2WKQ":{"text":"Went here last night first night on our trip.   With someone who has allergies to gluten, ","useful":0,"cool":0},"wH5T_J5M3pXTIm7RXGWxIg":{"text":"Vegan Rico FTW!!! It feels authentic and yet it's vegan. Very subtle flavors and perfect f","useful":0,"cool":0},"A_1vdBrKcr0S8uqf1H284Q":{"text":"Service was good and food was a little bit dry. Ordered : mofongo and Panamanian ceviche  ","useful":0,"cool":0},"b2UOp-J_pyY_JVVvDMW62Q":{"text":"My daughter is vegan and we chose Carmo because of the good reviews.  I had the Carmo sala","useful":0,"cool":0},"Aox3QYpCtZVD3xEHUUFm1g":{"text":"Seriously so good! Well be returning on my trip...incredible flavors, really nice staff an","useful":0,"cool":0},"AAyF50WKk_0iwYA1X-qxaA":{"text":"Delicious food, great vibe, tasty drinks, excellent service. Can't go wrong. My wife is a ","useful":0,"cool":0},"whJbzjcfdXNBHNkjTm1QSg":{"text":"Yum! What a great lunch we had. The Esmeralda salad is to die for.","useful":0,"cool":0},"NWCausn9lrlYvUr3AfFsbw":{"text":"We loved the diversity of foods from different Latin influence as well as Asia. We shared ","useful":0,"cool":0},"_86Q1dDUnNtxPYRo-uKWyw":{"text":"I am in New Orleans for the first time... Love it!\n\nExcept for the food.  As a vegetarian,","useful":0,"cool":0},"l_qGw26ote5-zDaYNMylXg":{"text":"It was alright. I was hungry so I ate it but it wasn't delicious. I had the vegan version ","useful":0,"cool":0},"eASnn19MhJoX-DDoBwu0sw":{"text":"What was I thinking?! How could it have been this long before I found myself in Carmo? I d","useful":5,"cool":2},"GC34og4rVOFizMoW3sZ5Nw":{"text":"I love this place. Kottu is a must try and the vegan options are plentiful. The food taste","useful":2,"cool":1},"1BmTXYclnYDeIuZODAsJkQ":{"text":"YES YES YES!!!  This place has fresh juices AND fresh food!  I love bringing my mother her","useful":0,"cool":0},"j75NZQ8tPrfcg1Nkho8T-g":{"text":"Its a pretty hipstery place and those usually make me feel uncomfortable,however, the peop","useful":0,"cool":0},"jVHs7WlyKvn_G4THNJfuOQ":{"text":"Amazing food and service!! My husband has a lot if dietary restrictions, but they took per","useful":0,"cool":0},"W7Ac3fes9k7NH8MqP2voFA":{"text":"Best. Restaurant. Ever; and I'm not even overexaggerating! This restaurant is a unique tas","useful":0,"cool":0},"yROeQKToIA-SU71fWcLROQ":{"text":"Very cute Brazilian cafe with a fantastic selection of vegan and vegetarian  options. They","useful":2,"cool":0},"80m6kbXQ-tMuMRBx-efZZA":{"text":"Loved Carmo. The natural juices (passion fruit) are delicious. The food is great. We all a","useful":0,"cool":0},"IhQ35qeaPV6YB1AJmsMhEQ":{"text":"It is not easy to eat as a vegetarian in the Big Easy. I found Carmo through the Happy Cow","useful":0,"cool":0},"qxi7rrzjkwWvzxWX6vnLjQ":{"text":"I went to Carmo about a year ago for the first time and really enjoyed my Esmerelda salad ","useful":2,"cool":0},"671hYbLGvd8SUL9NktwQHQ":{"text":"My whole omnivore family with young picky kids loved this place! As a vegetarian visiting ","useful":0,"cool":0},"n0PeTugruakmbPDZ66E9Nw":{"text":"I'm sooo happy I came across this place in New Orleans vegan food YESSSS!!!","useful":0,"cool":0},"5tsKCyf4EH2e1Kc30XOyRA":{"text":"The restaurant itself is a beautiful bright and Airy space, but once you take your first b","useful":0,"cool":0},"yquvN5f7D0cFXU35f4gCYQ":{"text":"If I had a dime for every time I heard some variation of the following: \"it's impossible t","useful":13,"cool":6},"zIm-UG_oRQn8lzWfa5T8SA":{"text":"Nice people. Doing my best to say something good about this restaurant but can't. Had lent","useful":0,"cool":0},"dxdY_f1KY7zDJRHtgFuw2Q":{"text":"Service was good and food was a little bit dry. Ordered : mofongo and Panamanian ceviche .","useful":0,"cool":0},"sHUl_ujkfBGA-0oIv7N6UQ":{"text":"We happened upon this restaurant while on a walk to visit the WW2 museum and stopped in fo","useful":0,"cool":0},"erRTlj0gQu5gaMAFZn9Hfg":{"text":"The food is great for healthier, GF, Vegan options in this area of the city. But the servi","useful":0,"cool":0},"_wxnvqKzQV-XCmq3WBhu7A":{"text":"My absolute favorite meals of my recent NOLA trip came from this restaurant, goodness nr! ","useful":0,"cool":0},"SWmYGU-qdbJy2SV8BhDiiQ":{"text":"We ate here last night because we're so sick of the same New Orleans style food and wanted","useful":0,"cool":0},"oRtu_DrZudyVnTVxb5H5DA":{"text":"When I first came across Carmo I was super excited about the concept and the location. Unf","useful":0,"cool":0},"VJvlaGQqBtbprHaqTSbPkg":{"text":"An absolute jewel of the museum district.  Who knew New Orleans could brew up serious Vega","useful":0,"cool":0},"YbNkoiKcA8LB7tNbHCPLXg":{"text":"YUM! The food here was fresh, healthy, delicious and literally just bursting with flavor. ","useful":3,"cool":3},"x6q_VYjUy6mYl23ua5Wa-g":{"text":"Don't miss this place if you're looking for something different in NOLA! Great vegetarian ","useful":0,"cool":0},"ptt5SiTPZSgVqWzQGr9NaA":{"text":"Never had a chance to eat at the restaurant.  Despite my reservation, the hostess insisted","useful":0,"cool":0},"z8cGbsyoUffBXvfrc8w0Ag":{"text":"Nothing really to say.... one of the best Veggie spots in New Orleans.","useful":1,"cool":0},"Fd6siOl6MT1H36CbKPPDeA":{"text":"Bottom line: we ate here 3 times during a stay in NOLA.  Why?\n\nOne, wonderful menu and cle","useful":0,"cool":0},"hHFVNcVm9_JRTYt5xeIyww":{"text":"We were in town for a convention and decided to try Carmo for lunch. It's not the typical ","useful":0,"cool":0},"6AECtRm44nlIZIZCw8_7qg":{"text":"Whether you're an omnivore, vegetarian or vegan, the food is tasty, full of texture and su","useful":0,"cool":0},"G4WsIQ_pktFp3aQTqfqtQg":{"text":"Friendly people, nice location, 'hipster'ish ambience, an innovative fusion cuisine and th","useful":1,"cool":0},"7OKMM4uALgaOiZMl6FVoZw":{"text":"Very good lunch.  Ultrafriendly staff.  Order at the counter and they deliver.  We were he","useful":0,"cool":0},"-nfBuQSS2g-kPHtDHnWYyQ":{"text":"amazingly friendly people, awesome vegan options.","useful":0,"cool":0},"eewz0So1XMAZDyuZlcCWog":{"text":"Highly recommended!! We had two salads - both absolutely wonderful! One was based on avoca","useful":0,"cool":0},"SMGQTs18Cx0z_uOrmMlSCA":{"text":"Lovely meal. I had the curry shrimp, wife had black beans with tofu sausage. Yum yum to al","useful":0,"cool":0},"gDEaND1EDunwPgsjpFM4fw":{"text":"Hands down best food I've had in the city! Everything is fresh and has a great flavor. You","useful":1,"cool":0},"9L1d_ORTC6JIKevj6dP6vw":{"text":"This review is for tourists.\n\nWe came scouting for some fresh greens after several days of","useful":0,"cool":1},"cBM7PF4lMBRaAKqQbFyoWQ":{"text":"Oh my tofu. This place was so good! New Orleans is pretty much a meat and cheese fest - wi","useful":0,"cool":0},"d9mEJYVbs6sJA1z0ekeadQ":{"text":"If you're vegan and a person who likes to eat a lot, do yourselves the favor and don't eat","useful":2,"cool":0},"O7C9CnY79GFmxll2KjpcuA":{"text":"I just love Carmo!  Definitely a wide mix of  yummy cultural influences!  The food is alwa","useful":1,"cool":1},"OYpIrpbfvgiyT8k1CoNpJg":{"text":"Awesome awesome awesome!!! Visiting New Orleans as a die hard vegan can be difficult. But ","useful":0,"cool":0},"vhec_ZHnN6jnNAr_rmFi-w":{"text":"We have been here 3 times. Each time was amazing! First the staff is so nice.  They name y","useful":1,"cool":1},"gg40Q3bNTbCB9AqtV3mxzw":{"text":"My one regret is that we found this place on our last day here in New Orleans.  The Carmo ","useful":1,"cool":0},"W0XyZAySz8sq25PEfJwpEQ":{"text":"During my time of following a vegan diet, about 8 months, this was the place I called home","useful":0,"cool":0},"0F6le77K2RW-VnGrsZd_nw":{"text":"Found this spot on our last night in NOLA and couldn't have been happier. Service was exce","useful":0,"cool":0},"rAYRueC9umCnuCg4VIfxqQ":{"text":"How do you spell clean foodie love, it is spelled CARMO! Amazing! Ham sandwich with real h","useful":1,"cool":1},"OS6DKkcxWdthF5AsznshSA":{"text":"So impressed with this place! I got the vegan rico and it was one of the best meals I've h","useful":0,"cool":0},"KQAt5mGRlglv8NASrfK25A":{"text":"I don't know how I lived in New Orleans for over a year as a vegetarian and didn't find th","useful":0,"cool":0},"qj1PZzYQNZuss0-8AryF0g":{"text":"A great find!  Healthy food that doesn't sacrifice flavor.  I came in looking for some goo","useful":0,"cool":0},"leB-3R2ckwCiLJkd4bnnnA":{"text":"I had the vegan Rico that everyone seemed to be raving about and it was amazing!! Bursting","useful":2,"cool":2},"RsKGmOx_bZu0tiK8d1Eugw":{"text":"Let me paint you a unnecessarily complicated picture of what you get when you eat at this ","useful":0,"cool":0},"AroRP79oSkJzfO5oBDwKiQ":{"text":"We visited NOLA for the first time...looked for restaurants with good vegetarian options a","useful":1,"cool":0},"aAow890hi1woLzmwh82x3Q":{"text":"This beautiful place is a breath of fresh and delicious air. I visited with four other fri","useful":0,"cool":0},"yfBEhsuflTCt8Ea-u6tDqg":{"text":"So cute, fresh & different.  It's a perfect lunch place during the workweek.  The tropical","useful":2,"cool":0},"9MVyHjBDod4rdNv6NvqBGQ":{"text":"Inexpensive, fresh, and delicious. Got the Carmo salad and fresh young coconut. Wish I had","useful":0,"cool":0},"dfxlzCvo1kPLuW2kkDz7Og":{"text":"Our second night in New Orleans. Had a big lunch and wanted a small dinner. We walked by C","useful":0,"cool":0},"Hx9g1PGNvTt00WRRWFLLWw":{"text":"I'm so in love with this place! I was so glad to find a mostly vegan restaurant in NOLA an","useful":0,"cool":0},"gfy4_YBcmrdzMPWraH_MdQ":{"text":"I greatly enjoyed this Caribbean-themed lunch and dinner spot. For vegans, there are sever","useful":1,"cool":0},"TedJoS_C7VrLLB6jlsjmrA":{"text":"The vegan Rico might have been the most delicious thing I've ever put in my mouth.","useful":1,"cool":0},"a3FGsTByntQRImVtHStdeQ":{"text":"The food and service are always excellent. Some of the most creative cooking in the city.","useful":0,"cool":0},"3W3pwGGgKWKrtwdeLWdTQA":{"text":"Amazing restaurant! Awesome service and great food. We showed up with a large group and th","useful":0,"cool":0},"QCtcjDNOntjGG28EwNuRaQ":{"text":"Food was delicious (best food I have had in NOLA) and the service incredible! Looking forw","useful":0,"cool":0},"n4oVUSrrpiHCySaWzap_cQ":{"text":"This is the best vegan meal I've had in my life. I ate here two months ago, and was sooo i","useful":0,"cool":0},"Lp2kmPWjIck1WtD1quAmzw":{"text":"Yumm! Super cute place, a hippie vibe. Great service and food.  \n\nHubs had the Rico, I had","useful":0,"cool":0},"6cssyvZf2jcHZDDXuFymbg":{"text":"Started off my trip in NOLA with dinner at Carmo! We ordered:\n\n-Black bean soup: Nothing s","useful":0,"cool":0},"xrOhgONK3Wff4BLS7QN2lg":{"text":"I went back to Carmo and really liked the dishes I ordered this time around. My meat-eatin","useful":0,"cool":0},"myljsllBnfJRaKuEAy8Sgg":{"text":"Une très bonne adresse pour manger sainement à la Nouvelle Orléans.\n\nNe vous inquiétez pas","useful":1,"cool":0},"6INFOKPVhIZEQE8hsseC4A":{"text":"So Delicious!  Everything  tasted so fresh and crisp. I had the noodle bowl and added shri","useful":0,"cool":0},"RjE8yDWu02_8oEWgNo9Fug":{"text":"The food here is amazing! The restaurant has great philosophies around food and sustainabi","useful":1,"cool":1},"qOZmuvwFgUfTXn7VoknbuA":{"text":"I went there for a lunch on Wednesday. I ordered gluten free Vegan Rico and Tuna sandwiche","useful":0,"cool":0},"hlW2KV3XM59MzCbRtkhWzQ":{"text":"Ok.  So we have been hearing about Carmo for a little bit now and we just ate there today.","useful":0,"cool":0},"KybdtctQwfecbACSMXY07g":{"text":"I like the laid back Caribbean feel to it. The staff is pretty freaking awesome as well. T","useful":0,"cool":0},"qrf61PV9gLYP9Ile07dYpw":{"text":"Every time we visit New Orleans, we visit this restaurants atleast a couple time. The carm","useful":0,"cool":0},"F7WXqWMOhE02QNeOjM95Wg":{"text":"Amazing! Went here for the second time in a year (hailing from Nashville) and it was great","useful":1,"cool":0},"-zXvcwG5WGWx-4TxSIIAsw":{"text":"I had a larger group with me and we were lucky enough to get squeezed into Carmo. They cou","useful":0,"cool":0},"qAQuQEoW1zG2sXkRQx8KGQ":{"text":"Great little place away from busy Bourbon Street. They had a wonderful selection of vegan ","useful":0,"cool":0},"WYKrMk8gdBoBlshhei5xmQ":{"text":"So, I lived in Brazil and know good Brazilian food.  I had never tried Acaraje while I was","useful":0,"cool":0},"wkpu-k8owYIiwspmCmIoBw":{"text":"My mom is vegetarian, and vegetarian-friendly restaurants are really hard to come across i","useful":0,"cool":0},"dtefNMMSHBssVSjJ-72wNg":{"text":"What a great find - this cool space w magnificent innovative Brazilian food and drinks wou","useful":0,"cool":0},"o-S5NJm2tG3RoC5GVFhYUw":{"text":"It is a walkable distance from the Hilton Riverside Hotel.  Very casual alternative lifest","useful":0,"cool":0},"Ppr2nT0qFUwWndN-uR780A":{"text":"Favorite NOLA palette cleanser to break up the heavy and rich meals - especially the rice ","useful":0,"cool":0},"hbiRZM_JxSvlGkgG0yPS1Q":{"text":"As a vegetarian in Nola, I was really excited to try this restaurant for a long time befor","useful":1,"cool":0},"oLOp4M2qoxJ_cY0vHHxWKg":{"text":"1st time here after reading the good reviews I wanted to try it. Needless to say I won't e","useful":0,"cool":0},"vfRV5LFwB9POyAj8FeHi6Q":{"text":"This place was amazing! It's a cute little quaint place that felt very friendly but not ov","useful":0,"cool":0},"uW0aHbul0yjm2d8QjRD56w":{"text":"Loved this place!  Food was incredibly fresh, delicious, and beautifully presented.  Great","useful":0,"cool":0},"-OihQBdJnWpnjbCpiQZfZQ":{"text":"An unexpected find in New Orleans (Cajuns aren't exactly know for being vegetarian friendl","useful":0,"cool":0},"04FsSIviQ4BqXaz9WqLLUw":{"text":"I love this place. It's difficult to clarify what cuisine, probably international. The dis","useful":2,"cool":0},"GvQOJr2_v2xBlrSXeQABJg":{"text":"My partner and I loved Carmo! They had plenty of vegan and healthy options for us. We have","useful":0,"cool":0},"x4l312Le8UnT4XqQFRH1Eg":{"text":"The best food in this district. Well worth the price.  If you like south Asian food, it's ","useful":0,"cool":0},"DJQqDndalsWYnOJAiTz6YQ":{"text":"This place was a great find. My wife and I were looking for something light and a little d","useful":0,"cool":0},"oAzK5W5M3cGzFRkgG7FtLw":{"text":"We read  Yelp reviews about the delicious vegan/vegetarian dishes this place served, as we","useful":0,"cool":0},"jX6iQ0rmTYaflVTIxQ7aTg":{"text":"We enjoyed our meals but relative to all the other great food we've had in NOLA this was j","useful":1,"cool":0},"Mpk1uVpBCfqUqyY4d_sWYw":{"text":"I had the special, which was a savory bread pudding in a spinach cream sauce topped with f","useful":0,"cool":0},"oIa5VpJlfwH3DSHM4WIFKw":{"text":"Great oasis of vegetarian food in New Orleans","useful":0,"cool":0},"WHjw03cNcn5wCcft_PZFMg":{"text":"For vegans and vegetarians visiting New Orleans, this is a restaurant that shouldn't be mi","useful":0,"cool":0},"59R0ISSUBRRpiMFqyN7E4A":{"text":"Excellent food but the service was a bit disjointed as far as how to get a cocktail. If yo","useful":0,"cool":0},"3dOwVoBRqbaHpQEsvwVBrg":{"text":"I had been to this place a few years, and loved it then. It was very pleasing to see that ","useful":0,"cool":0},"UjMvjZIuL_idWY9YBh5cvQ":{"text":"We had a fantastic meal here! The vegan options were just incredible and so delicious. Our","useful":0,"cool":0},"wE_Yi5d30TvQlYdAvvEeng":{"text":"This is a great place. Period. The food is thoughtfully conceived, responsibly generated, ","useful":0,"cool":0},"NieO0ELGierdRAp3rs7oYg":{"text":"The Elizabeth salad was delicious! I was impressed at how many ingredients came together s","useful":0,"cool":0},"w9Fc037NDMM3I-Qs17QfvQ":{"text":"My husband and I walked in and we were told to sit anywhere, so we sat down and waited ten","useful":0,"cool":0},"CKku2oi2iUgzS8BUOILcmw":{"text":"Great food, moderate service. Don't miss out on the deserts, we ordered 3 for the table an","useful":0,"cool":0},"Kcj4fUnBhW3d92DswoHccg":{"text":"I would give this place more stars if I could. My dinner, in a word, was amazing! The brok","useful":0,"cool":0},"9vSu9KMmKp5GH0cl2W3rNQ":{"text":"This place has a cool vibe and great food with fresh ingredients. Love the Carmo salad...","useful":0,"cool":0},"lONYfBjB_zwXt0wZzSbkjw":{"text":"I've been meaning to try Carmo for a while now and I'm so glad I finally did! The food her","useful":2,"cool":0},"VjtLbr8lrflJnAAgSutXvQ":{"text":"Really yummy food, as a vegan I loved the Rico sandwich!  Husband (who is not vegan) got t","useful":1,"cool":1},"aasvhgm0nujGMEEMDuwjkQ":{"text":"I ate here in February after too many rich meals and a need to strip it back to clean heal","useful":0,"cool":0},"ux0xHUzSJQS2uQbOTzMf_Q":{"text":"Really good and unique restaurant. Had the rico. Which was great. You can pretty much get ","useful":0,"cool":0},"NlkEhN5v7DG5ACDwVU5Nog":{"text":"If you thought Nola had no vegetarian food, think again. Carmo's unique food was divine. I","useful":0,"cool":0},"a_lR4eka6k5D2_LTxEG5kA":{"text":"I had a list of \" must try\" restaurants in NOLA; Carmo's was on it! The service, people, a","useful":0,"cool":0},"dx0Wajh8hznenRYTBr5gPA":{"text":"Fantastic place with clean fresh food. Go here if you're tiered of the beige and bland.\nTh","useful":0,"cool":0},"YM_6X2Z5LqYv2iDqeRC5BQ":{"text":"I really used to love this place. They have a lot of vegan options and are doing great thi","useful":4,"cool":0},"DXy_M4xwp0Usru390EPgDA":{"text":"New to vegan scene (by way of my Son) the shrimp/crab soup was awesome. I ordered house sp","useful":0,"cool":0},"EM5BqUe2WvLICC7iLexuVQ":{"text":"I lived in Brazil for a year and from time to time, I seriously crave authentic Brazilian ","useful":0,"cool":0},"qogy-AJzg_iMV3Vbb9pgZA":{"text":"I want to start off by saying, my food was delicious. This was a unique experience. The pl","useful":0,"cool":0},"u1SHgVZfhBrlYK2aAV_yHg":{"text":"Is it possible to become a regular if you are only in town for a week? YUM! This is the ty","useful":0,"cool":0},"n_qD01RmwLwi91TvIiA-6A":{"text":"We had the mushroom soap, Singapore style shrimp, and wild boar. Top that with home grown ","useful":0,"cool":0},"EDliJMVYTMvikAnqEvpgEw":{"text":"This place is very friendly.  Casual and kid friendly.  Sit in the back room with wide spa","useful":0,"cool":0},"ygspo9mZ6hLymFwvacMb3Q":{"text":"Carmo is an excellent spot for interesting vegan food. The space is comfortable and casual","useful":0,"cool":0},"9hRkIBf4VVA_-fnqzLcNiA":{"text":"Everything was great. Taste very homemade and authentic. Super fresh. Great atmosphere. Ca","useful":1,"cool":0},"NwDz2PPcY7cJbkyyyQ1jlw":{"text":"Nice place to get a healthy lunch.  It has many options for meateaters and vegans alike.  ","useful":0,"cool":0},"LepKtDWnuFYN-TJff61Scw":{"text":"A reasonable trek from the Civic Theatre, Carmo was the ideal option for me to fill my bel","useful":0,"cool":1},"IrJd2VR5CyW3XIlTGeUB1Q":{"text":"I came for lunch a couple days ago and wasn't really all that impressed.  Neither the menu","useful":4,"cool":1},"AT1AojnLCg7ctGmTq3cxag":{"text":"This was my first meal in NOLA & it superseded all of the foodie hype that this city gets.","useful":0,"cool":0},"iR8zUi6kWNk1CwVuJnweOA":{"text":"Don't know how I missed this one when I was here 3 years back.\n\nLoved the Veggie gumbo, Br","useful":1,"cool":0},"A6ILktx9qhuI_6EIKXSJig":{"text":"We ate a lot of great food while in NOLA but Carmo was my favorite.  Burmese Tea Leaf Sala","useful":0,"cool":0},"_j2sPiI2hTuMkUrbkOCg-Q":{"text":"I'm not going to talk about the food because  it's clear the food is delicious. The proble","useful":1,"cool":0},"4lx1AH-K0SJtrK7_cpsBUA":{"text":"We went here for my wife's birthday.  At mango alcoholic drinks there were excellent. Then","useful":0,"cool":0},"_AZDE3wmv1CYrt0wOhingA":{"text":"This place is amazing. I got the Rico sandwhich with meat, absolutely amazing. I also got ","useful":0,"cool":0},"ugrtqmlEFI5UQxGt9LqU3Q":{"text":"Let me tell you about friendliness.\n\nI was in town for a convention, and am vegan. Choices","useful":0,"cool":1},"bAcdWuyYMDzlTZPtOJhkpQ":{"text":"This place was excellent. We arrived at 9 p.m., which is when they close, however one of t","useful":0,"cool":0},"CkFX2NgHXLtqItljpRVSww":{"text":"If the seafood gumbo they served today at the Creole Festival is any indication of the gum","useful":1,"cool":1},"YQS2oNrrvJMHvliMIqHbPw":{"text":"Food was good but one of the employees came to us and took half of our napkins and told us","useful":1,"cool":0},"d8JZHIXGX9lg9twDUBq0-A":{"text":"We were looking for a healthy option and found it here!! Just read everyone else's glowing","useful":0,"cool":0},"STM5XmGlHRREhnpXTPkElQ":{"text":"Love Carmo. I'm a lunch regular here and am never disappointed. Food is fresh and affordab","useful":0,"cool":0},"mrkurqEOWcc2fVpT71aI0w":{"text":"We had lunch at Carmo earlier in the week and decided to come for dinner. Loved our very a","useful":0,"cool":0},"fsPtuUSp4sjyw6286hGifQ":{"text":"Came here with my friends to try it out for breakfast. I had peruano with soft boiled eggs","useful":0,"cool":0},"F9cloI_HSD7tmsnyrzIbyQ":{"text":"While the food is excellent and menu diverse, one cannot help withholding a star for this ","useful":0,"cool":0},"3lbaT16AJBPfEkIYZf5q5A":{"text":"Fun & funky cafe with delicious food! Had the delicious soup of the day, the cheese bread,","useful":0,"cool":0},"oeSTOnVzqzCAn61oQ2kgjA":{"text":"Fresh food...One of my favorite places in to eat in New Orleans. Of course, there are plen","useful":2,"cool":2},"dfp9JwOH61NULqyLXLD2sw":{"text":"This place was so good that we ate here two nights in a row! It was just plate after plate","useful":0,"cool":0},"W7YjlsDUdhBWRMC8ngn7qA":{"text":"MUITO BEM! I had a great lunch today at Carmo and I absolutely recommend it! I have spent ","useful":0,"cool":0},"WGdECZd-7GyKPR104-_TYA":{"text":"Fresh and creative food with lots of vegetarian choices.  I had the Esmerelda Salad and lo","useful":0,"cool":0},"WY8qxIHzi5XQj6Zir3-47g":{"text":"I always look up vegan restaurants on happycow.net before traveling to a new city, and so ","useful":0,"cool":0},"bxDrmQVDo1o8IS7NFmD-yQ":{"text":"I have not been this disappointed in a Yelp Darling restaurant since the lemon steak medal","useful":19,"cool":7},"L4vJpUgD4YvdTnmlTAKxqw":{"text":"Was in NOLA for a conference at the Hyatt Regency and was desperately in search of food no","useful":0,"cool":0},"UZX-YQh2gGFSyAwdRgn2hQ":{"text":"My bf, his nephew and I decided to give this place a try. We are not from the state we are","useful":2,"cool":2},"_L1rlklw-vUwXiQ0VRDVCg":{"text":"Stopped by here for lunch when we first arrived in New Orleans. I was in the mood for some","useful":1,"cool":0},"Vcsiwn2m8i0YhlUImdxwCQ":{"text":"Loved everything about this place. We had 2 different types of Ceviche, Singaporean Shirin","useful":0,"cool":0},"g_xnkqurdNoUtpKdiYYcJw":{"text":"We really loved this place. Good was exceptional, creative and high quality. Service was a","useful":0,"cool":0},"yuxy6SzBfxxZ3-HzjeKUtQ":{"text":"Such a great little restaurant- the staff were friendly and food was amazing!!! Found this","useful":1,"cool":0},"T2Bb_wsl27XuDBDkXhqC2w":{"text":"Amazing...definetly check this place out...especially if you eat vegan or gluten free...af","useful":0,"cool":0},"ilB0dga_42HeDlpqEnBAKA":{"text":"Loved the atmosphere here! The artwork, music, and furniture is fantastic. The food was to","useful":0,"cool":0},"c19jMumAcmTg1MVs7dfvBg":{"text":"This place was great for vegans and non vegans alike. I wouldn't describe my lunch as vega","useful":0,"cool":0},"gVPhq9OCA-9EEY8OCMJkqQ":{"text":"Great food, spartan atmosphere, limited menu. Offerings are fresh, creative and unique. St","useful":0,"cool":0},"UCmhgFaZmeo9A8Jzzj74Sw":{"text":"I find myself returning to Carmo to eat when I am in New Orleans, a city that isn't exactl","useful":0,"cool":0},"UmoielMkOK5v3Z21u8zptg":{"text":"Went here for a dinner before a night out with a group of friends.\nOn the positive:\nthe dr","useful":0,"cool":0},"boGPltALrJM1Sd37f1u7yw":{"text":"Carmo is not the kind of place I would normally frequent. While the Yelp listing lists it ","useful":3,"cool":4},"lbd7Wy__91JcMZI4YWRwWg":{"text":"Cute restaurant, able to accomodate large party, noodle salad was tasty and filling, frien","useful":0,"cool":0},"fp0hipBVyw26Xv2NmwGhVw":{"text":"Stopped in last night for a late night bite, just before closing. Had the broken noodle sa","useful":0,"cool":0},"QkEMydLmQUjxnBOcWO1S2w":{"text":"Excellent juices, breakfast, & lunch options! The food is so fresh and so clean clean, I c","useful":0,"cool":0},"5IiGcZoOwab-R02b6Itlqg":{"text":"The Goat was most excellent pleased with the very tasty Vegan food as this most superior a","useful":4,"cool":3},"8fAeivkTlJdHtpujRqUtLA":{"text":"My last review talked some about the weird traffic flow that was the dinner situation at C","useful":5,"cool":3},"6yHbgFl65hRJVhZDi0zMSg":{"text":"Okra soup was awesome. And the Trini curry was good, I would have enjoyed it more rice. Wo","useful":0,"cool":0},"7DksWQQxbfsfO45pKC3ljA":{"text":"Awesome!  The reviews are spot on.... Fantastic food, friendly service, casual low key atm","useful":0,"cool":0},"rB44Z9o1xaYFnFhkIkY_gQ":{"text":"Amazing!  The food is fantastic, as are the cocktails.  If you're a vegan/vegetarian and w","useful":1,"cool":0},"7xv5apAf3rayDtoQtgf_0w":{"text":"Fake meat heaven. Try the vegetarian Rico sandwich, made with a rich and tender veggie pul","useful":1,"cool":1},"BF7TrUwOg7qpEUn0CzZ6kg":{"text":"I really wanted to like Carmo, but unfortunately it just fell short. My food was mediocre,","useful":0,"cool":0},"BrEMKjfWT6DkAOrhFmarNQ":{"text":"We were visiting NOLA, and this place came highly recommended for a place to get vegetaria","useful":0,"cool":0},"cidzeYNJBBKNosDoo0Fbiw":{"text":"A wonderful and light meal where you can taste every ingredient and understand why it was ","useful":0,"cool":0},"QPaI7XlEE_T5j3XGwLZvLw":{"text":"Not really my thing. The gumbo was decent and the green salad was presented nicely and was","useful":0,"cool":0},"bpJN06IrwI8CbJGOAWOimw":{"text":"I was visting from Los Angeles and found Carmo on Yelp.  I had know idea I was about to ea","useful":0,"cool":0},"OeA6y9_sHsnI-TciB9ingg":{"text":"Sweet service and delicious menu. Limited menu but any choice will satisfy. Reminds me of ","useful":0,"cool":0},"IRO6lTUl6xt9iXYhh4Twvw":{"text":"Dang!  If not for the poor service, this place would've been a 5.\n\nI'm always excited to f","useful":0,"cool":0},"1Odmscm-7bQCDhnj1IdjOA":{"text":"restaurant quality food with self-service is a winner in my book!  they even have a full b","useful":1,"cool":0},"tVjGnAzqpiNb_WwaxsZhLQ":{"text":"Excellent food and service. The broken noodle salad was subtle in flavor but so so so deli","useful":0,"cool":0},"PzgvOn6AQZqRzxknKk7MMQ":{"text":"This was such an amazing surprise to find in New Orleans. It was a quick walk from our hot","useful":0,"cool":0},"EbSC5ffYbGbfG1yB3jnGig":{"text":"The food is awesome.  You'll need to go with an open mind - this is not your typical Latin","useful":0,"cool":0},"bb4vglIf-RiUK5DXOOe1Lw":{"text":"Mixed feelings... Had to wait 30 mins for a table despite having made a review on Yelp. It","useful":0,"cool":0},"Bh9hBnL5TyqvejFgNfQlXw":{"text":"We enjoyed our food here, but even as vegans used to not consuming a Standard American Die","useful":1,"cool":0},"VytK3O4-ov6XzpID38AtYw":{"text":"Great food. Healthy, tasty, well prepared presentation- friendly service in a positively c","useful":0,"cool":0},"gaN8pliR8cSTIJB5Y_zHIg":{"text":"Great vegan and vegetarians options. Awesome tropical drinks especially the sugar cane dri","useful":0,"cool":0},"R44AE5UQpt37SpJdjKkT9Q":{"text":"The vegan rico and the bhutanese special of the day, phagsha pa, were our favorites! Servi","useful":0,"cool":0},"moDeU3QqYiyhcQMwjAje7w":{"text":"This is a must go place to eat if you are in NOLA . I am a strict vegetarian and have a ha","useful":0,"cool":0},"WSHxBiUkR1KKdC1DQky6Yw":{"text":"Excellent restaurant! Had 1 vegetarian and 1 non-veggie in the group. Split an appetizer a","useful":0,"cool":0},"EKEaVQSBwDaRT6Y_DQu2lg":{"text":"The Carmo salad is nice and there are some other interesting things on the menu. I'll prob","useful":0,"cool":0},"tWhm5upgpObnT39iqgROBw":{"text":"Esmeralda salad is spicy, crunchy and can be made vegan! Seating is ample, but in the back","useful":0,"cool":0},"L38s6GCessWRb0LcLvXuYA":{"text":"Food and cocktails were amazing! Gretchen was so accommodating when more people than I int","useful":1,"cool":0},"rgz8ydMRB34msuYB29-5cg":{"text":"I tried srilankan vegetarian dish kottu rotti which was amazing. Never had anything like t","useful":0,"cool":0},"5YcvPqfLmnr4N0LsCLI6sA":{"text":"Service is a bit slow but the food makes it all worth it. It's wholesome good quality food","useful":0,"cool":0},"swNFY1NzPWY-Tm5sCuynEQ":{"text":"Ditto all the great reviews here on yelp. Yelpers are truly accurate - even the one about ","useful":0,"cool":0},"tkzf_EiVulrKtl3MlKslFw":{"text":"Solid healthy and yummy option.  The fact that they have real fruit juices and gone out of","useful":0,"cool":0},"wg71CZeWr6VIc79ZxglTqg":{"text":"Had a really good lunch here today. Very fresh food and great vegetarian and vegan options","useful":0,"cool":0},"OZVM_A9jGR6TaJoW3Oqypg":{"text":"Eclectic and quaint, we were very happy with our selection.  An Egyptian special was very ","useful":0,"cool":0},"pBoWONGezb6svOw_Lwv3wQ":{"text":"Enjoyed this place! I came early for My Reservation but they seated me with no problem. \nH","useful":0,"cool":1},"ycOCA3nbhKx0FkqXT4g35Q":{"text":"Highly recommended to me, and by no means did the high expectations fall short; I went in ","useful":0,"cool":0},"Lg2HU-BiaHy2G7F0MiJFdg":{"text":"Decent ambiance and decent food. Nice art gallery next door.","useful":0,"cool":0},"4UWR9gXSjhfgV0W7MNq0ig":{"text":"Wonderful change from NOLA's common food options, Carmo has vegan versions that are AMAZIN","useful":0,"cool":0},"pNvXi93dQ5y6fShMoW817Q":{"text":"The food was absolutely fantastic !!!! They had such a great menu . The reason I rated car","useful":0,"cool":0},"Gl887frF08eAZD4ibF7wlA":{"text":"Incredible vegetarian food. Excellent service. They stayed open till 1015 to let us get a ","useful":0,"cool":0},"LQ_a6FB70QzhyyEcsrr0_w":{"text":"A total original, we have nothing else like this in NOLA. They give exotic food a new name","useful":0,"cool":0},"bD_Vz6aKu56RhLEPoEkfhw":{"text":"They were so good to me when I came in and told them I was vegan and had little to eat for","useful":1,"cool":1},"52VM1qhDipTfbzpfjDDfXw":{"text":"Awesome place food was certainly worth a repeat visit.","useful":0,"cool":0},"MmzM2ssRjRO6RnspuUer_A":{"text":"Best meal in NOLA thus far. Fresh food, ethical sourcing, kind staff and streetside seatin","useful":0,"cool":0},"Vk11beKaBb24rQqJ0gYvbw":{"text":"Poor service and overpriced. I ordered the regular curry and when the bill arrived they ad","useful":1,"cool":0},"kNyRO4sK0AvZ52ikTrZbZA":{"text":"This is a healthy vegetable focused joint that throws a bit of meat in some dishes but off","useful":2,"cool":0},"w3DyeY4qn978z5_V4viYIQ":{"text":"Casual, with fresh and healthful food, bursting with tropical flavor. Had bean soup, super","useful":0,"cool":0},"orelaFE_PXKcPFYtx_GREw":{"text":"Not sure if people like this BC of the lack of vegan or vegetarian friendly places in NOLA","useful":2,"cool":1},"nY5mDJ3biOm7BVK0jcedrg":{"text":"Carmo has been on my list of \"must trys\" for a while now, so i was pretty excited when we ","useful":10,"cool":9},"z12f7G-EtzBhwtoVk-woPA":{"text":"Esmeralda salad is a must this place is a gem. Also for dessert you have to try the Caribb","useful":0,"cool":1},"E29vUVCKi3fGVLoZfUWewQ":{"text":"DeLicious! Broken Noodle salad and Acaraje...Super fresh and bursting with flavor. Great d","useful":0,"cool":0},"RYQaqQbXZiUGi6EGKPLydg":{"text":"I went to NOLA to see the Dalai Lama speak and met a group of like minded friends afterwar","useful":1,"cool":0},"Jj1emLlW2A0cDpLHDPRl1Q":{"text":"Great place for sure, but in my opinion (obviously since this is my review) it also needs ","useful":2,"cool":0},"LBXLDEw0IHmieq2cMDn_cw":{"text":"Outstanding!  I was looking for healthy, fresh food to counter all of the unhealthy food i","useful":0,"cool":0},"CuL9GLai8eA0Y4i14rYXJQ":{"text":"Loved Carmo from the minute I stepped in:) Super friendly staff. I was recomended the soup","useful":0,"cool":2},"U0z8m32AQhCeDWUrvrn_1g":{"text":"Such high hopes for this place. I think something was off when we went. Reservations highl","useful":0,"cool":0},"QtjwITAbycrWL6i0dwoGsw":{"text":"Ordered chicken curry special and a deli sandwich. Food was fresh, tasty, healthy and the ","useful":0,"cool":0},"pNtQ2CqDm-8_qoWI9wRnQg":{"text":"Delicious food! Being vegan in New Orleans is not always easy but Carmo has amazing option","useful":0,"cool":0},"-mGEzAUyagGcQconabtkOA":{"text":"Amazing little restaurant that never fails to please.\nLaid back atmosphere with order and ","useful":0,"cool":0},"YEUAyRdQ9r8D8ra_tc5OJQ":{"text":"Well, I wanted to love it, but it just didn't happen. Wait for drink and food was way too ","useful":0,"cool":0},"BV2DdPEWjH57mrHA0AABnQ":{"text":"Searching for a nice, vegetarian-friendly restaurant for my birthday brought me to this ye","useful":1,"cool":2},"F3sHdsMyIubyiFHTVFsxXw":{"text":"Another place that doesn't really scream traditional New Orleans, a Carmo is a vegan-frien","useful":0,"cool":1},"_B35vnRqqP0q5d5JdahH1Q":{"text":"Great people and great food. Glad I stopped in! It's a nice quiet out of the way spot wort","useful":0,"cool":0},"LsIA4VP6RTc3gxwMC1flxw":{"text":"It is very sad for me to write this - a year ago this was one of our favorite places- bein","useful":0,"cool":0},"WXY11tqHIE-sVPb1_emjlw":{"text":"Full disclosure... I did not eat here. Waited in a long line to be told they didn't have a","useful":1,"cool":1},"p2s8gA4MsPVJ-phgzUh_EQ":{"text":"Delicious and unique food and drink. Noodle salad needed more ginger flavor and more tofu ","useful":0,"cool":0},"pgabnBxtFYzN8NwwqnOeEQ":{"text":"We ate here on the last day of our New Orleans trip. The brunch was so refreshing for 2 re","useful":0,"cool":0},"A48z9vFTNBwZ2tKtSI_rqA":{"text":"I don't particularly care about vegan options, but the Rico salad (pulled pork) is so good","useful":1,"cool":0},"bcEBCQQEXHCaMr60Ad-74w":{"text":"Just finished a wonderful meal here with my daughter and toddler grandson. We came at 5 pm","useful":0,"cool":0},"uMxupWHDoyo5BNkuv_AiAw":{"text":"We ate at Carmo's 2 times on recent trip to New Orleans. We found the food to be fresh and","useful":0,"cool":0},"MBgVvk8q2oCcuqVobBsjnA":{"text":"I just inhaled an entire glorious Esmerelda salad and the vegan Rico... Plus that coconut/","useful":10,"cool":8},"jefudjNnQ7RES4v9tjCsIA":{"text":"Delicious vegetarian and other options.  Gets crowded quickly.  make reservations.","useful":0,"cool":0},"YJpOeeHe8LU6KpqVlRo-GQ":{"text":"This place is amazing!!!! I am not a vegan or a vegetarian so I just accidentally stumbled","useful":0,"cool":0},"mY_wwUYS0PXTvroy49lwBQ":{"text":"Tasty food even for vegetarians. The Rico was very good albeit the portion a bit small. Pa","useful":0,"cool":0},"LbUHMu0XypsC-NcaOVjM6g":{"text":"I have a gluten sensitivity so I can only eat things marked GF. The Mofongo Relleno, Pao d","useful":0,"cool":0},"IAwxUsZOOUe40uPcJCfXvg":{"text":"Cannot recommend this place enough. It has food for everyone: vegan, vegetarian and gluten","useful":0,"cool":0},"tp3vii_JGCaexiHLqFblBQ":{"text":"What a great spot. The minute you walk in you immediately feel open and light. This is one","useful":1,"cool":1},"udzDp2m2XW-O-VlUR3Onmg":{"text":"Many good vegetarian choices but portions are a little small! Nice staff & good atmosphere","useful":0,"cool":0},"dJ8JFLEnGwx9TL3EAhyATA":{"text":"Great healthy food!  We got the Esmeralda which was fantastic - great flavor and spice whi","useful":0,"cool":0},"DaJ37Z6ALp83Wd8NTAKVPA":{"text":"Great place! The caipirinhas are excellent. 100% authentic. We also had the house Pinot Gr","useful":0,"cool":0},"fa-Fkzzj4vpZRJxcs8NemA":{"text":"If you like Latin food you need to check this place out!  I chose this restaurant because ","useful":0,"cool":0},"hJFzeZN96vr4VGXYgngnzw":{"text":"Let's start by WOW, What a find. \n\nWhile doing some business in New Orleans my family and ","useful":1,"cool":0},"6ZxHCkMacVZrmAFLGWxg8Q":{"text":"I'm extremely saddened to have to update my review based on my most recent experience. Alt","useful":2,"cool":0},"iKE2OhsIF2Lkpewn3VB1ow":{"text":"Venessa was great.  They were full on tables and only had the lobby tables open.  They sat","useful":0,"cool":0},"rZhHFJ0sAcBEFybSoa-mgw":{"text":"I just got the Esmerelda Salad here and while it had a really great flavor and the perfect","useful":0,"cool":0},"8WPh6fKdefL4OpxsE7qEsg":{"text":"I had the Esmeralda Quinoa salad and it was was delicious!!! The place was clean and had a","useful":0,"cool":1},"p78msduYs5nFCnh8nopFyw":{"text":"Great food with vegan and vegetarian options.","useful":0,"cool":0},"Y5S7_7oeNUDC9JoGK8idOA":{"text":"Ya'll, one of the waitresses here told me I must not read well . I've never felt more disr","useful":0,"cool":0},"v4Dso2IgVSMHFDj82zwh2w":{"text":"I was dining with a gluten free diner as well as a vegetarian...stumbled upon this place d","useful":0,"cool":0},"xouywhUFNcJZOfSkjn25tw":{"text":"We came here on our second night in New Orleans and I really didn't want to depart from tr","useful":0,"cool":0},"DNnXkWXX5aLLP3hPH8OceQ":{"text":"This place was recommended to me a few times but now that I've eaten here I'm confused. Go","useful":0,"cool":0},"9gkhz91S0fgvWkTzDEtRDg":{"text":"highly recommended！！love the tropical juices and the fishes there. will definitely go ther","useful":0,"cool":0},"CKRrGWMYUBeyXEmo1j_r8g":{"text":"I am so loving this place!!!  Going back tomorrow for Lunch!  Service was AMAZING!\n\nFresh,","useful":0,"cool":0},"g-FfhK0ypd8DBbZQwn3EVA":{"text":"In a city of great food, this may be my favorite place. The vegan gumbo was incredible","useful":0,"cool":1},"bae0800oSViHUdmQAvqAXQ":{"text":"We were on the hunt for a vegan friendly cafe for a friend, and THANK GOD we stumbled acro","useful":3,"cool":1},"cIIl8A9Rw967zbCnh3hAxA":{"text":"Amazing unique Louisiana food and amazing service, also amazingly for my non-veg husband, ","useful":0,"cool":0},"OiH49DsMAcYAJgeRwaWvuA":{"text":"Pensez à faire votre Check in pour avoir 10% de réduction sur la note \nLes plats sont symp","useful":2,"cool":2},"rtoBMZopmyX1K4cinInBww":{"text":"Some of the best food I had in New Orleans. We were worried my wife's vegetarian options w","useful":0,"cool":0},"gCPoG_yN20O6ArsVC52dOQ":{"text":"Excelent food. Highly recommended for vegan and vegetarians. \nStaff is extremely friendly ","useful":0,"cool":0},"7AAxyUkyOengCBfYQYjYkQ":{"text":"This place was all I hoped for and more!!! They hosted a reception for my professional org","useful":0,"cool":0},"XoBAKspQo4xrwDJLKzskvg":{"text":"One of my favorite restaurants in New Orleans. Fresh fruit juices, light and flavorful ent","useful":2,"cool":1},"bT3MnO9RB0nMpoNU5RwJ-Q":{"text":"I ordered Daily Curry and my husband ordered Vegetarian Rico. The both tasted so good and ","useful":0,"cool":0},"ULVdcg_Owt-c7B7WQmEjGg":{"text":"Enjoying amazing Brazilian fruit juice! \nWanda is amazing, she hooked up some samples and ","useful":0,"cool":1},"g-HBlJjLen81FKywCKZuZg":{"text":"Amazing. I recommend Carmo to anyone looking to try something different since they have op","useful":0,"cool":0},"rfUe0V3kerysfYieUi6T_A":{"text":"Fantastic and healthy food. Had the noodles, perfect. Great staff. Also recommend the frui","useful":1,"cool":1},"TVWlFViElE9Amvh9_y4BNQ":{"text":"Easy walking distance from the conference center. Food was excellent and the staff very fr","useful":0,"cool":0},"3CvSHcB742T6_0P44B5ARQ":{"text":"Carmo has delicious food, and for a town with a Caribbean heritage, we're nowhere near sat","useful":2,"cool":1},"0JKzXUwdODkIAXdPbtCPrQ":{"text":"Excellent food! Great atmosphere! Was a perfect spot for a large group. Our server was ver","useful":0,"cool":0},"g5AEWOZlTN7pRMFk8nCzjQ":{"text":"Amazing! The food is wonderful and the vibe makes you feel like you're on an island! We ha","useful":0,"cool":0},"2E-dTDmCmRSqNKvhTkEGDg":{"text":"Carmo is an interesting little restaurant on Julia. The atmosphere is very hippie and mell","useful":3,"cool":1},"yms8SW7J6WXDezuUNtdDow":{"text":"I use to belief and many people always said bad food in NO, never, well this place was clo","useful":0,"cool":0},"AdrebFQjNWd2NtYG_2SsIw":{"text":"Love this place. So many great vegan options. And options for meat eaters! Hadn't been in ","useful":0,"cool":0},"oWE5aVwox4XSE9iVqPIlbw":{"text":"If you are vegetarian or vegan, this is the best place in NOLA to try out. The quinoa swee","useful":0,"cool":0},"xtwJD1ZXmw-AYfAyY6wUnQ":{"text":"Delicious and clean food with great service and atmosphere. The Carmo Salad is the best! W","useful":0,"cool":0},"88WYy_sGZQ4RVvd-HrZ3DA":{"text":"[edit] Either you have a bad memory or you are straight out lying about your original resp","useful":12,"cool":2},"WPtDJoXr8X4ibdL_S2GnrA":{"text":"We got there about 20 minutes after they opened. We loved this place, the gentleman at the","useful":0,"cool":0},"4Ivg7rmbMqupA-vr6bez_Q":{"text":"I was so excited to find a place in New Orleans that both vegans and carnivores could be s","useful":0,"cool":0},"oVpRhVIxA9CRNCZ5kccQGQ":{"text":"This place is the bomb! Period. I strongly recommend the Veggie Rico. Bartender made a nic","useful":0,"cool":0},"xP7xdlywTTKq2OIk7IuwyQ":{"text":"I had the BBQ pork special, and it was amazing - very flavorful and savory with a smoky ca","useful":0,"cool":0},"vb0ZeaHf_k3ZQmHOQBZAag":{"text":"Delicious and varied vegetarian and vegan options. Excellent craft cocktails.","useful":0,"cool":0},"doGTyXBc8ySIwZjZxHxxOQ":{"text":"I order the Rico which had a unique combo of flavors. Went during lunch and had to order f","useful":0,"cool":0},"7ljtv4IPT_IiCr2UmgHOYA":{"text":"I came here again for lunch a few weeks ago and had yet another good salad.  I got the Esm","useful":2,"cool":2},"ODUD5lVyT-NM5kZdt4lnNw":{"text":"Wow...the entire experience from the front door to the end of the meal, was spectacular. W","useful":0,"cool":0},"fAsm4BIOh8rH4JnFkIbm7A":{"text":"If you're a vegetarian travelling to NOLA, good luck finding a decent meal.  I just spent ","useful":0,"cool":0},"9I8qhSfLnwJ4XjAVjgmEng":{"text":"Carmo was so incredibly fab that we ate here 2 nights in a row, during our New Orleans vac","useful":6,"cool":3},"edQUQX4Q2Egnw3xuT3ODgg":{"text":"Wow found this hidden gem threw Yelp and food was delicious extremely artistic and service","useful":0,"cool":0},"5UEWkhfAg6D-EUzb3pc25g":{"text":"We loved the flavors and variety. The Vietnamese flatbread was the voted group favorite, f","useful":4,"cool":3},"tIfjnWINCQV8smBXSYlwFw":{"text":"As an islander (Filipina) who loves the food scene in New Orleans, I am so in love with Ca","useful":1,"cool":0},"Xgf5o_Mt6nRgLr7w5h1eqw":{"text":"My husband and I spent the day at the WWII Museum ( well worth a visit). We needed a lunch","useful":0,"cool":0},"eWijFzZEGsOnk5Bru9gt0w":{"text":"Super Nummy Food at a great price.  My favorite place to eat in New Orleans.  The bartende","useful":0,"cool":0},"fTSSOD7PfTiRaWaumevtFQ":{"text":"Great place for an artistic meal with friends.  Casual and cute with mouth watering Rico o","useful":0,"cool":2},"P4h-d7aXGa4sC-AIjzqQhg":{"text":"Great vibe in a nice part of town. 5 stars for the scene.  We were pleased going in. The f","useful":0,"cool":0},"NiGkYPk4BhQX1EbrKDX8kQ":{"text":"A huge THANK YOU to Dana and his team for providing an excellent experience during a compa","useful":0,"cool":0},"sVOMHTjtuANGLSkzJZ2Hkg":{"text":"I've gone in about a dozen times and I really love this place! Can't recommend it enough t","useful":1,"cool":0},"iXbylHTKDEIvbI4x1NHivQ":{"text":"Super cool restaurant and very busy on Christmas Eve. Imagine! That's crazy for New Orlean","useful":0,"cool":1},"te6WdRcDd5OEz7XvlkY5Mg":{"text":"Average food and service took 2+ hours on a Tuesday night. I wouldn't recommend or come ba","useful":0,"cool":0},"CdqZJnpTagh-njLLw-NJjQ":{"text":"Might be my favorite restaurant in New Orleans!\n\nMeat eaters and vegetarians alike can enj","useful":2,"cool":3},"6kkqOH7bl27VH-2JCAK5sA":{"text":"I loved this place so much that, in reviewing it, I wanted to revert back to middle school","useful":2,"cool":2},"qhd4jO0TTyjYY8taEVfz7w":{"text":"Went here with a group of 5 and everyone found something they loved! My diet is pretty res","useful":0,"cool":0},"1iz2Fe0BBgsZEomyneRspg":{"text":"Superb and healthy food. I got the Rico Plate with pork and it was mouthwatering. I don't ","useful":0,"cool":0},"nD3c5AcobN9CXUO-g1KUcg":{"text":"Food: 5 +++\nStaff: 5 +++ s/o to Isaiah, kindest person ever\nVibe: 5 +++\n\nCame to NOLA for ","useful":1,"cool":1},"mMSkCBvlaN_cz3l40-Hdlg":{"text":"Great vegetarian options. Bread is amazing portions big  even vegan cheese. Good curry and","useful":1,"cool":1},"SsuXj97XyJMi0X4YFFQPag":{"text":"Great selection of vegetarian options. Great service and ambiance. Drinks were awesome too","useful":0,"cool":0},"RaNHymWPbOux1Zes2TaYYg":{"text":"Delicious! Loved the vegan Rico plate and the vegan Brazilian cheese bread. Can't wait to ","useful":0,"cool":0},"WsWkBJ7gi4-mR6f5NI-bmQ":{"text":"This place had a lot of hype going into it, and ultimately it did come through on the food","useful":1,"cool":0},"RqMM9zeRCTC86MMY_3ez5Q":{"text":"A wonderful place! Food was fresh, excellent and creative! Our server was so helpful and k","useful":0,"cool":2},"JflOh7XDqV8SlQBIDyC0wA":{"text":"If you are vegetarian / vegan visiting New Orleans, you need to check this place out! Inte","useful":0,"cool":0},"JPZPJ0AmsBo-qmvcDgrb8g":{"text":"First time celebrating my husbands birthday. Every dish was delicious. I definitely will r","useful":0,"cool":0},"bBlxuiypQjU1LTVqe9oHwQ":{"text":"Need a change of pace from the typical heavy NOLA culinary options, this is it. Fresh, lig","useful":0,"cool":0},"hQFbGNpSjjdeL1kKGe26jw":{"text":"My absolute favorite restaurant in the city! I love this place so much, there are many veg","useful":0,"cool":0},"5lg50Cq1UdjBBxUqLnGFlg":{"text":"Wow. If ever I had a \"best of times/worst of times\" experience at a restaurant, this was i","useful":1,"cool":0},"3Y_XnaSgkGfEyfWOt7Uu1g":{"text":"Delicious appetizers.  Open, airy, eclectic atmosphere.  Easy parking.  Highly recommend f","useful":0,"cool":0},"sOveKPqsgpw52EXPcbtCaQ":{"text":"I came here by accident as the other spot that was closer to my hotel was closed for the e","useful":2,"cool":2},"XQKQ7Dn_7Gtl-i_7WgBP3Q":{"text":"Wowza, this place is phenomenal. The owner is a really kind man, very interested in pleasi","useful":1,"cool":1},"oXo5OG5kr2nYy5QDUcPlzQ":{"text":"Here are the downsides: small portions, big prices, and despite being vegan-friendly, the ","useful":0,"cool":0},"nx2V9nlZtHrY4fOIticV_w":{"text":"So glad we found this great vegan-friendly spot on our trip to New Orleans.  It was totall","useful":0,"cool":0},"U_ffl4vERZ84qPXoBXsXog":{"text":"It's not easy to find tasty vegetarian food in this city, and I love the food here! Their ","useful":0,"cool":0},"xbTev07HA5cxy92gDEVVLw":{"text":"Wow!! My friend and I shared the Cuban ceviche, Brussel sprouts and chicken curry. The foo","useful":0,"cool":0},"Ivux5HZgYMnZLqD0-D41sQ":{"text":"As soon as I arrived in NOLA, anyone who has ever heard I'm vegan told me I \"must try Carm","useful":3,"cool":1},"JsUZTgSmv0HTSyolt4kwPw":{"text":"I can't believe we didn't discover this place until now! We had the kottu, Esmeralda salad","useful":0,"cool":0},"nvRRWhvD6XEMnSY5O27dbg":{"text":"This Place is amazing! The food is so different and delightful! The waitress gave great re","useful":0,"cool":0},"DztRFTl-htxsQsQiL4W3Zw":{"text":"I was looking for an allergy friendly restaurant and found Carmo, I was not disappointed! ","useful":0,"cool":0},"xxd5sfkuNQti6ilHCU3iSw":{"text":"Dear Carmo,\nPlease forgive me for not getting pictures of all my food. I was too busy eati","useful":0,"cool":0},"BkiYbnxigS-nnXd9IMp2AA":{"text":"Interesting atmosphere.  Make reservations if you want to get seated.  They have a variety","useful":0,"cool":0},"BAHo8T0peWq-6SnKMSGujg":{"text":"Very cute and unique place. The food was good, the service too. After seeing some pictures","useful":1,"cool":0},"ME58LAnEJxfET8etavmk7w":{"text":"I love this place! It has an earthy tropical vibe with really cool and friendly staff memb","useful":0,"cool":0},"9QPYoDRhxvyNZAAcyjM1Zw":{"text":"There's a good possibility that this is one of my new favorite places to eat in New Orlean","useful":3,"cool":1},"JJHtEhQG9WqVAyDcrXZUGw":{"text":"Everytime I come here I have a great experience. The food is always super yummy and the at","useful":0,"cool":0},"jpCz4Ls_kGH9LL9SmN0fKw":{"text":"Confession. I've been sleeping on this spot. You see, my friends and coworkers have been m","useful":3,"cool":2},"BnmUhE4wbRZYVJj8bJX6jg":{"text":"Came here during a 5 day vacation in NOLA, experienced restaurants 2-3 times per day and C","useful":0,"cool":0},"5CGn1P2v9xfSR_tTO49wbw":{"text":"We got the mango and passion fruit juices from here. Simply delicious and refreshing!! The","useful":0,"cool":0},"bSSUgzNHUktLxOwVDZVcnQ":{"text":"Excellent atmosphere.  Very casual.  Loved the decor.  Enjoyable for kids as there is a \"l","useful":0,"cool":0},"m8u-TvtS3q-QLfeBjLZbqQ":{"text":"One if my favorites in New Orleans. Great location, awesome decor, quick and friendly serv","useful":0,"cool":0},"M9egs4yvJcszH5zNlMRjyQ":{"text":"I happened into this place AND I am so glad I did.  The Kottu is amazing.  Thank you for m","useful":0,"cool":0},"gsstGc5N4HE6nL0csdk4Gw":{"text":"We were greeted by a friendly, engaging server/ bartender.  With vegetarian and gluten fre","useful":1,"cool":0},"OWJE9AGND6PavjN6a8VAAw":{"text":"Just stopped in early for a cocktail and a snack. Ordered the Cuban ceviche which was deli","useful":0,"cool":0},"dks1ZM5GquKk0zeoGZMRXw":{"text":"Interesting cuisine. Perhaps over-focused on gluten free and vegan.  \n\nMy Brazilian chicke","useful":0,"cool":0},"zJy9zD7KKxTKI79FjBszVQ":{"text":"Very nice atmosphere and good food. The service is good and wait staff were great. I loved","useful":0,"cool":0},"LVJOr2qND1WpfHPuBmUFUQ":{"text":"Loved this quaint eatery. The vibe is low key and sultry. Nice place for a date. The menu ","useful":0,"cool":0},"yqa_S91ikyyYQXO-qVcX0Q":{"text":"The ceviche was fresh but small! We spent $15 for a dish that left us hungry. Staff was fr","useful":0,"cool":0},"lE02Z7XDgUprjARrag0e9g":{"text":"A great find for vegetarians! I really enjoyed the combination of flavors/textures in the ","useful":4,"cool":3},"QOI4t29jRuwWUaunUFGt1A":{"text":"I came to NOLA for the weekend & was looking for a great vegan lunch. Was excited to go to","useful":0,"cool":0},"YZKhSkLS6_tKnlamI3tXaQ":{"text":"While my friends and I enjoyed the meals we were served, we were quite alarmed by the cond","useful":0,"cool":0},"291_quGf1084GaMiMthEbQ":{"text":"A gem in the area. The food was some of the best we had in New Orleans. Skip the crappy re","useful":0,"cool":0},"_XaK0Tqd42j1f6hhNduiZw":{"text":"I had to order a second vegan Rico to go just so I could eat it again later. And then came","useful":1,"cool":0},"5TCznJUepTdsRcf86mIYhw":{"text":"I tried  not to let one bad meal change my opinion, but it was a bad enough experience to ","useful":0,"cool":0},"G0QPiCmxk2PruIZgM2sOqA":{"text":"Had the tiradito, Vietnamese banquette bread, and a shrimp dish in a tomato based sauce wi","useful":0,"cool":0},"RK1kwG0HnlBfOHmVs7IO7A":{"text":"The meal at Carmo was the best meal I have had in a long time. The pork Rico was so full o","useful":2,"cool":0},"VqRXGuVSeiFKsEZ6WgMwkw":{"text":"We had the broken noodle salad and cuban ceviche, both were amazing! Very glad we found th","useful":0,"cool":0},"lY4vnzIhix_GkwalFXLhQQ":{"text":"Love the smoked tuna salad! Also the vibe is very laid back and the staff is always friend","useful":0,"cool":0},"drY3ZAeOXjzQanuxSklevw":{"text":"Went here with my daughter... we satires with a lentil soup, was tasty but little bit spic","useful":0,"cool":0},"UPKjbntayfZPdey8Yc1uAw":{"text":"Good food, horrible attitudes and service. Rude, arrogant, ruined the experience of food. ","useful":0,"cool":0},"u7LqvYuDhdchWwWdGqt3mA":{"text":"Awesome atmosphere great diet food. Good vegetarian environment also Vegan friendly with a","useful":0,"cool":0},"OVpKbQ_H-hq6guffQCKXIA":{"text":"One of my favorite Nola restaurants. Everything is so fresh and I like that they try to lo","useful":0,"cool":0},"j9-4x3dH-Xknk0prRdyckw":{"text":"Customer service was excellent and food was perfect!! Ordered pork dish of the day and veg","useful":0,"cool":0},"qa6qlwlAbIZ2KZ7bF92MbA":{"text":"Hooooooolyyyyy shit. I can't believe how amazing everything was. We started with their tun","useful":0,"cool":1},"47w81MnLSO_FXZ6wlAwykw":{"text":"If you are looking for a tropical destination in the middle of New Orleans, you will need ","useful":0,"cool":0},"R7XAA3UPcgVW_D-3TiCYAw":{"text":"My favorite restaurant in New Orleans, hands down. Their fresh dishes have love in every b","useful":0,"cool":0},"kUYmzXkCEGpEu1LjqyQq6A":{"text":"Carmo is one of my favorite restaurants in New Orleans. After eating heavy meals all week,","useful":0,"cool":0},"C11dymxTB-gwZCkZWM35_Q":{"text":"We found this place on yelp. Glad we visited. It was pretty busy, even for a Wed night (th","useful":1,"cool":0},"cTNAN3ulT5wJYL67s8vFqg":{"text":"Special thanks to Sammy and Dana for an excellent birthday weekend! \nLove always, \nMs. Gre","useful":0,"cool":0},"P8ZD7Z1yDUkO9GbN-7n-qw":{"text":"Wow the food here is very, very good. And reasonably priced!\n\nThe ingredients are fresh, t","useful":1,"cool":1},"cufTTwi93msUe9YEgv7xNA":{"text":"Went here with 3 friends on a Saturday night.  We had the Burmese Tea Leaf salad first, an","useful":0,"cool":0},"7vUu9neGnV9A2WFSbi_kNw":{"text":"\"Smoked tuna\" comes from a a can.\nLettuce was old and dying on my plate\nReally sad dish, r","useful":0,"cool":0},"su4frxqVwMdyk7a5Ppg18A":{"text":"Refreshing, tasty, unique options! Lots of fresh healthy options and off the beaten path. ","useful":0,"cool":0},"fmuoYe3nyLKt1PJ-IVBvUw":{"text":"the noodle salad was good the Brussels weren't bad and the drink was strong. I was hoping ","useful":0,"cool":0},"xgKB_WIUlVAos6FBUc_j1g":{"text":"First of all the food is different and delicious! The reason if just giving 2 stars is bec","useful":1,"cool":0},"TedF6XAcUYnyfxbqvyggyw":{"text":"My friend has been raving about this vegan friendly place in the CBD so we went for lunch.","useful":1,"cool":0},"nmZWOnJUwLZaQMs4K0jZIA":{"text":"We had a fantastic time, everything was amazing. Nice atmosphere, and really good food. Bi","useful":0,"cool":0},"OBwc87xL9MfhYbLxWXCCXg":{"text":"Fantastic food and service! Balil was awesome with recommendations and the kids loved the ","useful":0,"cool":0},"P-YX3-xZfpYDFIRFRajR0w":{"text":"After gorging ourselves on BBQ meats and cheeses for a week straight, the BF and I decided","useful":1,"cool":0},"UkFtxWULFcUt6kmeCwsepA":{"text":"Extensive vegan and GF menu. Reasonable prices. Kitchen was SO FAST. Went here for my birt","useful":0,"cool":0},"3Ts_LiVQvu4rtCXYLt-q1Q":{"text":"These are some reasons I love Carmo:\n-Preferential support for local farmers and fishermen","useful":3,"cool":4},"9tNSKPzSgkfAVH2xkCEkew":{"text":"It really is \"all that and a bag of chips\".\n\nWithout even trying,  I ended up dining at Ca","useful":1,"cool":0},"ThqVAMNFUPIFYQrjarSxwQ":{"text":"Please come and check out this cool, chill place and say hello to Sammy! We stopped by for","useful":0,"cool":0},"gl5ItBiq0OObSpIllWtYPQ":{"text":"Yum, this place was really good! We stopped here on Wednesday for lunch on our way through","useful":2,"cool":2},"StbLATY5prMfFIi_WO1anQ":{"text":"We went to carmo looking at the great reviews and knowing it was vegetarian friendly we we","useful":0,"cool":0},"b0ap9gEmciV8ld3blXWDCw":{"text":"Just ordered the Burmese tea salad which I love and is $16 and added chicken for another $","useful":0,"cool":0},"JR9XV2Az3MOMRNpFbBHobA":{"text":"We loved Carmo. It's always tricky finding restaurants when we travel as a vegetarian/vega","useful":1,"cool":0},"q-iKu-02vD-xRNoIwZIb8w":{"text":"Wow!  Talk about fresh and healthy.  This is just a short walk from the quarter but super ","useful":1,"cool":0},"BHfHRdUMU32_Vik_mVNmug":{"text":"Great place to wine and dine food was great inside is comfortable feel music in the backgr","useful":0,"cool":0},"dEZtbmLvecqaDIHFdGxNYA":{"text":"This is a very refreshing restaurant to visit in a city that loves fried food. They have e","useful":0,"cool":0},"CmpeZ-J6PCkHiFLtZpVwjw":{"text":"Amazing atmosphere, super friendly waitresses, and delicious food.  Plenty of options for ","useful":0,"cool":0},"ZTYKRqPwZ7zEJxxd64QJww":{"text":"We made a reservation for 8:00 PM when we arrived we were immediately seated. We ordered t","useful":0,"cool":0},"wslTglfATgH1BpOaVlkC-g":{"text":"Very good place to try if you want something different than the typical New Orleans fare. ","useful":1,"cool":0},"Rk4C-o5FEnMINJXd2q8saA":{"text":"Carmo had a very tasty menu.  Fresh salads and very interesting dishes.  We tired the heir","useful":0,"cool":0},"73SSd5t9SPZvmGXNwcbLJQ":{"text":"Service was pretty good.  Food was pretty good.  We started with quinoa sweet potato fritt","useful":1,"cool":1},"tzHA5bzV7hDnyNrVE8duIg":{"text":"Carmo is so, so, so good! So good, in fact, that my husband and I visited two nights in a ","useful":1,"cool":0},"n12v1fPAQ5dm282MhufB3g":{"text":"I googled \"Vegan Restaurants in New Orleans\" & Carmo was a short walk from our hotel for a","useful":0,"cool":0},"qX8hWgf_SDmkrm15Bihbxw":{"text":"Definitely one of my favorite healthy food places in New Orleans.  I used to live there an","useful":0,"cool":0},"NBdWxGftbHiFvU6L_xrHTQ":{"text":"On my travels in New Orleans I found the food to be rather rich so Carmo was recommended t","useful":0,"cool":0},"wtn89cSqpLvVUSovT2T-mA":{"text":"This is my first visit and what a wonderful experience.  \nSammy made us feel totally welco","useful":0,"cool":0},"Pxyov2OGP5c1zAJ4XSavSw":{"text":"Of all the great spots to dine in New Orleans, I make Carmo a regular spot on my frequent ","useful":1,"cool":0},"TaICiJbpKoxW6jyg5TFx_w":{"text":"Sadly.... Despite the yelp shout outs, I didn't find them vegan/gluten free friendly. Ther","useful":5,"cool":2},"2i9OK8uWrPe84QzFQKsdjw":{"text":"And In Conclusion......\nI'd like to go here every day. We decided to  sit at the bar, whic","useful":0,"cool":1},"_SQfpJB72cP7C32LQTBHrg":{"text":"It was a bit of a splurge for us, but the asthetics and thoughtfulness of the menu  made t","useful":0,"cool":0},"RcAgfc2v4kQEPfzBh-miTQ":{"text":"Excellent place with great food. Lots of vegan and GF choices which is amazing considering","useful":0,"cool":0},"u8iOhJ3yQiK8RIALbdYJEQ":{"text":"Loveeeeeeeee this place! Loved the vast amount of vegan options and how eclectic the menu ","useful":0,"cool":0},"JxoX76IbiiZoFFisbn3SXw":{"text":"FANTASTIC food, very different than what you might at \"traditional\" places. Veggie and veg","useful":0,"cool":0},"4jPmhc_Gxw610H1eth_Bvg":{"text":"Gahhhhhdamn this place is tasty! Had the daily lunch special with a juice I asked the serv","useful":0,"cool":0},"LFqfDRlHrYCaIYjdXokZgw":{"text":"I was in town with my husband. Met here with a friend from NOLA who is a vegetarian. I was","useful":0,"cool":0},"ILEGxw1zzXr_4Zz--Zdv8Q":{"text":"The food is incredible and both veggie and vegan friendly. Wide range of dishes and an ope","useful":0,"cool":0},"Zm9TY9phHMFr7dld-MEJ8A":{"text":"Amazing. Blown away by the menu. So unique and refreshing. Everything we had was out of th","useful":1,"cool":1},"zqaIE8QkoCed_XvBGh_Zsg":{"text":"Carmo has a creative menu with amazingly executed vegetarian and pescatarian food with ins","useful":0,"cool":0},"R8l7lE5SPgjgfHXbzgXUog":{"text":"This place was amazing, wish I found it earlier during my trip. Amazing food options that ","useful":0,"cool":0},"7SDlrbL0uAqgS_tYdaIQiQ":{"text":"Our server was Bilal, more like Bil-WOW!!! Excellent service, great entertainer. Fantastic","useful":1,"cool":2},"ZJ3ss2SFpKfpAp-cRsj5mQ":{"text":"Phenomenal! First restaurant we stopped at after arriving in Nola. The service was so fast","useful":0,"cool":0},"NVNeAyPPoJ9Csmu783lijQ":{"text":"Loved the lunch menu , and the cheerful vibe with the samba band! Sammy our host for the d","useful":0,"cool":0},"UT6g9YRw7S7EG7rQbgQMZw":{"text":"This was my favorite restaurant during my trip. The service was great, staff were extremel","useful":0,"cool":0},"RV52j3vUeejvRSML49lBOg":{"text":"healthy and AMAZING. The broken noodle salad is my favorite. It just has all types of amaz","useful":0,"cool":0},"C8oLuSqc6FBGD5ZDv72pYg":{"text":"We went to Carmo for our friend's birthday dinner. The atmosphere was nice, server was ple","useful":1,"cool":0},"jA8XcjCHNNKlw3ONatsf2A":{"text":"Excellent variety to suite all pallets\n\nGood food. We had Ceviche, Mofongo, Kottu, Chicken","useful":0,"cool":0},"lo83N0HCyE1cxBHK6c2KAg":{"text":"This is our second time to Carmo and it won't be our last! Perfect for the those who want ","useful":0,"cool":0},"hKLa11ryUFpcIzsCOI3GqA":{"text":"Very good food. Fresh ingredients. Our waitress was very nice, friendly and atrentive. My ","useful":0,"cool":0},"E3qXeldHNnwBOPeANu9pBQ":{"text":"OMG this place is fabulous! Lita was our server and was helpful in our selection, did not ","useful":0,"cool":0},"VG8-xCbDGtvl-GA0oNm5VA":{"text":"The food here is amazing. Such a great spot in the city for a vegan date. Can't recommend ","useful":0,"cool":0},"rnyRFmQAy71p7QNjLMCDVQ":{"text":"Fantastic food at an unbelievably low price.\n\nCame here yesterday with my wife and 16 mont","useful":0,"cool":0},"SRu1ps-ukUkI9s96JbE6Yg":{"text":"Terrible. I'm not sure how there are such good reviews for this restaurant. From the momen","useful":1,"cool":0},"XOaUxug6njCEuSvdVd_zbQ":{"text":"Omg this has been by far the best food we have tried in New Orleans! The prices are pretty","useful":0,"cool":0},"7PQ5grATgfK7ccFbmrHIBA":{"text":"I've always loved this place but I have a hard time talking people into trying it.  My boy","useful":1,"cool":1},"VtUGB9SmKA-HEqtg7-fSqQ":{"text":"Awful experience.  Super expensive. Chunks of shell in the crab cakes. All food was cold. ","useful":0,"cool":0},"MlEdteoC7KPKGpZdKzOLEA":{"text":"Everything we had at Carmo was delicious!  There was a grilled gulf fish with lemon slices","useful":0,"cool":0},"5f_pe76tjDLpE6k2WC4HFQ":{"text":"On our first visit to NOLA, this place was recommended to us by our Lyft driver because I ","useful":2,"cool":0},"sbhDCyJZmKjYhJk0DM5-kw":{"text":"Quaint and casual. The menu is very inclusive, great for vegans and meat eaters alike and ","useful":0,"cool":0},"pdgqj--MYauLiSkboUwHPg":{"text":"I recently dined at Carmo again for the first time in a few years. I ordered the Veggie Ri","useful":1,"cool":0},"hvKJmdN4RmnBqDZz-7Qk5w":{"text":"What a beautiful place! The food has an abundance of flavors, fresh and delicious. The res","useful":0,"cool":0},"rdF6mnKVCRfagsrUta0MuQ":{"text":"There are frequently few creative options for vegetarians. The South American vibe offers ","useful":0,"cool":0},"LDtFW1MSYKGSem4ATPNiYw":{"text":"Good selection of sandwiches and salads. This place sources their menu locally which aided","useful":0,"cool":0},"Bu94SB3ZtIiZ6V2d_Ap2uw":{"text":"My wife and I spent the day at the WW2 Museum and walked here after (only 2-3 blocks).  It","useful":0,"cool":0},"yFMEVE1VHQzC3RxhVepUlw":{"text":"This is by far one of my fave restaurants. It's a great place with vegan options as well a","useful":0,"cool":0},"z9ZMK_NU3HnnXXoxinLRzA":{"text":"I'm a vegetarian, so this place was a real treat. They have so many vegetarian and vegan v","useful":0,"cool":0},"EYlowQFiM38i5j6Xxn-TBg":{"text":"I walked in and placed a carry out order for a half Esmeralda salad with chicken. Within a","useful":0,"cool":0},"R1R1YL2l_ZfF8bN_CRgsIg":{"text":"My friends and I made reservations here and were super excited to eat! Through the reviews","useful":3,"cool":0},"luG4CmKl8hu3NWaaWv_uiw":{"text":"Get the Rico--thank me later! This is hands down one of the best restaurants in the city.","useful":0,"cool":0},"GfCfDhcmaUaTMtrsGUJlHQ":{"text":"Great service by Lita and food that is truly outstanding.  The banquette bread was a surpr","useful":1,"cool":0},"R9NTiyIrN0MR3614RZtb_g":{"text":"Mmmmmm!!!  We loved our lunch here!  The setting and vibe provided a perfect resting spot,","useful":0,"cool":0},"OvES_vefh4GA5nF7CUpLpw":{"text":"Ordered today's special, the curry chicken and it taste so good...the flavors are all on p","useful":0,"cool":0},"vGs0cJjREV9xoyVDSCLitA":{"text":"After checking Yelp and seeing the reviews, I took a look at the menu and was surprised to","useful":0,"cool":0},"0-pFEi7nAOqP8tq_u4az4A":{"text":"It is our last night in New Orleans. I didn't feel willing to compromise on quality when i","useful":0,"cool":0},"pVRI-P49b0zFzYXsieOSyg":{"text":"Been here twice and it hasn't disappointed. \n\nI love how the menu evolves with new flavors","useful":2,"cool":2},"0MZoEM-axqZnqi-rH3LkxA":{"text":"We went to Carmo because it was highly recommended for vegans and vegetarians. It was...fi","useful":1,"cool":0},"enA6r2ePZVUEMSluGB8o9g":{"text":"A deliciously delightful meal. We ordered from the specials - Seafood Gumbo - an nice flav","useful":0,"cool":0},"s3ysl1u0qvpEYKpUNPjg_Q":{"text":"Amazing meal and fantastic service by the little powerhouse named Emma. We asked her to re","useful":0,"cool":0},"HN8QkYCj9SzYe2AaWuwljQ":{"text":"Even though I've been to NOLA numerous times, i was excited to try Carmo for the first tim","useful":0,"cool":0},"HMDY8MLK4GWDp9BE48fkeA":{"text":"This is a great place for vegans and vegetarians in New Orleans. The menu is interesting a","useful":0,"cool":0},"1VRbuJQkcXVzkSX6VQiueQ":{"text":"Excellent food with great vegan options! Sadly, I am only here for business but would defi","useful":1,"cool":1},"MinDiatRfIPpOEJhvwWXRA":{"text":"Loved this place! While attending a conference at the convention center it was an easy wal","useful":0,"cool":0},"gBKaYbgYxClqnNWPBw6KTw":{"text":"I cannot speak highly enough if Carmo. It's one of those restaurants where you can go and ","useful":0,"cool":0},"5FqGWV7c7WpmJfJgDKcajw":{"text":"I. Love. This. Place. \n\nI've been here twice now. The first time, I got the Rico with the ","useful":0,"cool":0},"dNFguQx2KD6vYyjlDWppeA":{"text":"Great experience, live music, a theater room and kids play room. Great drinks and even bet","useful":1,"cool":0},"RKfzHAi2ZtEsRcYZEQmpMg":{"text":"My vegetarian mother suffered through a week of Louisiana food with me. Not to disparage t","useful":0,"cool":0},"BfiNO0g-kH34v3MBHGX3-w":{"text":"Truly one of the better meals we had. Very accommodating and if you can overlook the wonky","useful":1,"cool":0},"6rFJ8-gSMworFz6VKBOzmA":{"text":"Awesome food. Great service. Friendly staff. \n\nGo for the Rico ...or the Kottu... or the s","useful":0,"cool":0},"cBg69lJwapYeizI-uISgVA":{"text":"Had such an amazing vegetarian meal here!! I find it so rare that I really leave a restaur","useful":0,"cool":0},"nyjJznqNvJGuInoDhCoGvw":{"text":"This was an absolutely incredible place.  Having the ability to make dishes vegan, or thro","useful":0,"cool":0},"9lJ-qDNwOo3AUl-_4VMubw":{"text":"Delicious drinks and awesome sashimi raw bar. Samuel was our server was our server and mad","useful":0,"cool":0},"PZabITGLKDMZSbhZM_RBPw":{"text":"Came here with a group (had a reservation).  Service was a little slow and awkward althoug","useful":0,"cool":0},"GLa3tWrz5nhtbjekfpdCkg":{"text":"Perfect for a light lunch. Lots of vegetarian options which is awesome. Loved how refreshi","useful":0,"cool":0},"Chue0SDwrfJspGHEF9iquQ":{"text":"This is one of those situations where I could/should have had so many more pictures of our","useful":1,"cool":0},"dqIiS_azGWy4Eyo681-I6Q":{"text":"This is my other go-to when I need some healthy food intake. Being in Cajun country is dif","useful":0,"cool":0},"XXfqkKryQW6-UgAkqB2qZw":{"text":"A suggestion from a local, a few friends and I stopped in while visiting the area for a co","useful":1,"cool":0},"ibnEbcpfCPTwgnlgUDBf_g":{"text":"Amazing! Best overall dining experience we had throughout our trip to this special and fan","useful":0,"cool":0},"b2SWfJa41gRDtzumIjoWGw":{"text":"I ordered delivery from nolafooddelivery.com and while the flat delivery fee brought my to","useful":0,"cool":1},"ckFXh0urdbIfTXxGI58LFQ":{"text":"We had a great meal here. The cheesy bread with scallions was fantastic and so were the en","useful":0,"cool":0},"wVlgzyXP5Ghfbrdht2Olgg":{"text":"This place is phenomenal!!! Quality for price is unreal! It was the perfect amount of food","useful":1,"cool":1},"0r35bh9leGH1qf2h_gf8fw":{"text":"I like the space here. When you first walk in and smell the kitchen, it smells great. \nWe ","useful":2,"cool":0},"dTld00godmwJqDr1f-wcCg":{"text":"It was nice to find a place in NOLA with some decent vegetarian food. Great drinks and coc","useful":1,"cool":1},"hrBGbV_9Gvb_iLUKD2GFgA":{"text":"Absolutely worst food I ever tasted in my life. I picked up this place based on so many ra","useful":0,"cool":0},"Z360IL1Nzy7lVgACc59IPg":{"text":"Good food but dam price is way to high once was to much I will never return plus you don't","useful":0,"cool":0},"K1QoP9f2N9SVf6klHE8dCQ":{"text":"Ate (and loved) every single crumb of the Rico plate. Incredible flavors - loved the plant","useful":0,"cool":0},"PU5JxgmMcR2zxxpgbT-chg":{"text":"Great vegan food. They made a mistake on my order and comped it. Great friendly service. W","useful":1,"cool":0},"C6UUYCQzVPVh8v05GyvXow":{"text":"4 stars because I feel it's a little overpriced and I don't understand why they need your ","useful":0,"cool":0},"mpt7W56YNzgg39wD36FVtQ":{"text":"I'd heard good things about Carmo, so I was excited to try it. The restaurant is cute, the","useful":0,"cool":0},"N0FBUBOCU2Dh8Ujbqr2z3w":{"text":"Amazing atmosphere clean environment, very accommodating staff very friendly. CHECK THIS P","useful":0,"cool":0},"z88BS-bajFLX8sAhB2G0Vw":{"text":"Carmo has a bit of a hole in the wall feel with a hippy vibe. I like that you can opt to m","useful":0,"cool":0},"yKBZF3hIl1fo1gUyKx1BGw":{"text":"Stopped by to check out some Brazilian food and was not disappointed at all. Rice and bean","useful":0,"cool":0},"mlWYMiR2dFralxbeGzURzg":{"text":"Carmo is one of those places where all the rave reviews are spot on. My husband had some f","useful":3,"cool":1},"dAI1UnUp5k9bLrk2iaZ87w":{"text":"Amazing food for vegans and meat eaters! The waitress was friendly and helpful when naviga","useful":0,"cool":0},"qlvG3n0v4uBCFkzHKtzzow":{"text":"Extremely inventive and delicious vegan options here. Came in with a group for lunch today","useful":0,"cool":0},"0ECk4KcQU0aV8a3ElWf3Rg":{"text":"Usually when I am in New Orleans I eat in the French Quarter.  Located in the Central Busi","useful":1,"cool":0},"PykG5ykU7izfLtHpzHCpjA":{"text":"The drinks were great. But... they came after we finished our meal. The food itself was no","useful":0,"cool":0},"a0bTIh6e8AA3Wdbn9O8uKA":{"text":"DEVINE.  Got the Rico, the most popular item for lunch. It was piled high with pulled  por","useful":1,"cool":0},"QZW_BDUK96XUbvKnTWOQUg":{"text":"I was incredibly impressed with Carmo- more so than almost any other restaurant I have din","useful":3,"cool":2},"VI_OlTOVBbxEgHjyxZE88A":{"text":"vegan options + cute cozy atmosphere = great place to grab a bite with friends\n\nI love tha","useful":2,"cool":1},"VS2zQkfH4aKoFHjZC-6aVA":{"text":"So good.  A new favorite for when I'm in town.  Great atmosphere and better food.  Had the","useful":0,"cool":0},"aSjM5YyYj5whsOUiTM4n6g":{"text":"I love that this place is still serving food and dinning in. They were polite and fast. Th","useful":2,"cool":0},"v9j0_TdOPmDmxpO77Rregw":{"text":"Worthy of plenty praise. It's coolinary month now (aug 1-sept 13) and the menu options wer","useful":0,"cool":1},"WpgCYg1jg_03mZ5dizvzxA":{"text":"I had been wanting to try Carmo for quite a while now and I'm so sorry I waited this long.","useful":2,"cool":3},"MfW0JtWMrBrCW73zaym9QA":{"text":"Carmo is just one of those restaurants in the city that never disappoints; it's always a p","useful":1,"cool":0},"oSfDu8qJhjvdd98l0anV5g":{"text":"LOVE this restaurant. the food is amazing, and the environment is incredible. it's a beaut","useful":0,"cool":1},"cy5q65MnyxzLpuZxKwXSRA":{"text":"Great atmosphere and friendly staff from the moment you walk in. Our server was very knowl","useful":0,"cool":0},"XMSxQ0jXqqsJWwFptZrg8w":{"text":"Amazing amazing! I stumbled upon this restaurant when Pechê was too full, and I'm so glad ","useful":1,"cool":2},"5946bDWwyHc3m3qRGjkoWg":{"text":"I really enjoyed this restaurant.  All the food was excellent as well reasonably-priced.  ","useful":0,"cool":0},"m_YWLIR54cj2yp7VIXOLYg":{"text":"Food is great and good options. Service is not very friendly. Woman with braids is rude. T","useful":0,"cool":0},"vTvNcqbOpeDiI8nWqIh4tw":{"text":"Who dat says gonna beat dis food.. who dat?! Who dat?!  So awesome vegetarian choices n ot","useful":1,"cool":0},"ZehQWxrS2D_TvFhfGtJSTQ":{"text":"A great option for Brazilian, vegetarian, vegan and gluten-free dining. Unlike other resta","useful":2,"cool":1},"ZW22hWbTsiptb0YQhK2Jbw":{"text":"I'd have rated 3 stars but added one more because the raw fish menu is excellent and we wi","useful":0,"cool":0},"JY-7epIqFl385I4ImRuCxw":{"text":"We walked by Carmo to and from the apartment we rented on Julia several times before check","useful":0,"cool":0},"yDJ_sYDAFTvdy2WBiH_HlQ":{"text":"Such a gem! I can't speak highly enough fo this place. All of the food is amazing. I love ","useful":0,"cool":0},"Wc1fDSdgMru7hlCj4FYG4Q":{"text":"This may very well be one of my new favorite restaurants in New Orleans. Tropical and isla","useful":1,"cool":0},"pNDA98OSSxdM_YxxnaAODw":{"text":"Really very impressed. The menu had so many tasty vegetarian options it was incredibly dif","useful":0,"cool":0},"ntJWWrPNTWNqchNzJXj7cg":{"text":"On a recent trip to NOLA, we had eaten our weight in jambalaya, gumbo, po boys, and oyster","useful":1,"cool":0},"9haejWURSXT1bGi7J_U2rQ":{"text":"This place is one of my neighborhood favorites. Love their fresh caipirinhas and sashimi d","useful":0,"cool":0},"eczeKOIiVSqzWwwiq19alw":{"text":"Great vegan food. We ordered food from Carmo for a work lunch and everyone (even the meat ","useful":1,"cool":1},"KEfSZyqN9ifMwolJMvuEFA":{"text":"Best customer service! We stumbled upon this place just walking down the street. The peopl","useful":1,"cool":2},"m1G9F2g7hl0W5AX9G3vl3A":{"text":"Incredibly disappointed, especially with all of the wonderful reviews.  I had a tea leaf s","useful":1,"cool":0},"I6AGNyxzEv7tDAJ9YZj4Dw":{"text":"Place is so cute, and the food is to die for. We stopped in for lunch and they had so many","useful":1,"cool":1},"swXEmymSCVg0uTr0m4CsXQ":{"text":"Has a great time at Nolé our waitress Sade was amazing !! The food was great! The cheese d","useful":0,"cool":0},"dGYvr8zHTJN-rRuVTAeCfA":{"text":"Came here with my fiance looking for some really great food that's vegan and vegetarian fr","useful":0,"cool":0},"pvXwMiPhw6vytX80rnl_mw":{"text":"Cute little restaurant in an area populated with so many unique restaurants and places.  T","useful":1,"cool":2},"bAnSGb7HsAsAlHkMuuLq3w":{"text":"Pretty good food and many different cuisines represented. Cocktails stood out as really go","useful":0,"cool":0},"vQ7K5U5mY1aZXr6FuBrYyw":{"text":"We ate here while on vacation.  I chose the place based on an old Rick Steves review.  We ","useful":2,"cool":0},"TjTpR5VzAZbivTnrfcLzoQ":{"text":"Went here to get away from the craziness of the week before Mardi Gras. I was here for a w","useful":0,"cool":0},"xihu3WdJpsDkZSHgnazM9A":{"text":"This place is a heaven for a gourmand like myself. We ordered the Broken Noodle Salad, the","useful":0,"cool":0},"Oplln4EEQH6opNaWsVtiRQ":{"text":"Very unique menu with lots of interesting stuff.\nFood was delicious!\nSuper cool restaurant","useful":0,"cool":0},"ibWpKMpg73Wnh6MQuYN4Fw":{"text":"Carmo really has become my favorite place in New Orleans for vegan dining. I had such a sp","useful":20,"cool":17},"XJ8YO6jyV_BGJqPY2HD0mA":{"text":"Fantastic vegan options!\n\nThe food was amazing, the staff is incredible, and the atmospher","useful":1,"cool":1},"mkBKsCg0h0Zg7TGk3aG5_g":{"text":"Great place for lunch for gluten free/dairy free food.  Fantastic flavors. Nice walking di","useful":1,"cool":0},"W3pOUNl-jOUUkxYfLjI1ug":{"text":"Kottu Roti! I wish I could remember what else we ordered, but I will say the menu is eclec","useful":1,"cool":0},"j6xxwXwZQXCJdn14gHYzEQ":{"text":"Visiting from out of town and wanted to try Carmo for dinner on our first night in NOLA ba","useful":1,"cool":0},"HC9HUSZD_1Y4X2CFND8spw":{"text":"At first I was deterred by the long line at lunch time... didn't realize there is both a g","useful":0,"cool":1},"57uKKssQ3idf0Ctvx_VUGQ":{"text":"The service was excellent. Absolutely no pressure. Very casual atmosphere. Great music in ","useful":1,"cool":0},"d5wBYgI_kydePy9WEtCqLg":{"text":"AMAZING vegan dishes! I couldn't get over how many vegan options we had.. the flavors of e","useful":1,"cool":0},"mEN7pQn2VhQvRLZQEBQerw":{"text":"Delicious!! The food was beyond my expectations, and the drink!! If I wasn't by myself I w","useful":1,"cool":2},"8sXWkwPegnSGMnM2QNH-GA":{"text":"What a great find!  This restaurant is a bit unusual in that you order at the counter and ","useful":1,"cool":2},"Gr56vdiPZW1bed0zzXx6WA":{"text":"Delicious, healthy salads and juices (and more).  We had excellent salads that are made to","useful":0,"cool":0},"UP0YerNsUnQjApFdXmnujg":{"text":"Will start with good: drink was well made. The bad : the food quality was bad at best. Not","useful":1,"cool":0},"ZWFaEd_T7NUPK3zHiVeeYA":{"text":"Great food, excellent service, artsy vibe, diverse crowd. The Rico on the flattened planta","useful":0,"cool":0},"qosjS4mK-reqHKcx4HdcOA":{"text":"Amazing food! We were saying on Canal St for almost a week and we walked the 8 blocks to t","useful":0,"cool":0},"hjt9Ya07FQx0DXTh39w8vQ":{"text":"Just found it and had lunch there today and it was an authentic souvenir of my travel to L","useful":1,"cool":0},"at2o6pPCWYOLJrOd70ng3Q":{"text":"Our hotel was one block away, and Carmo has good reviews. We decided to give it a try and ","useful":1,"cool":0},"m8cDp8QHYPPxOhBcPxJk7Q":{"text":"Fantastic food!  Perfect mix of fresh air and intimate setting.  Thanks for a great welcom","useful":0,"cool":0},"kT0PN1A_XvTDnTfCWgtNyg":{"text":"Been a good long while since I've been back here. Happy to say it was as good as I remembe","useful":0,"cool":1},"G9D-Ie72W55Y0AYEnVgtCA":{"text":"Carmo gets 5 stars for its Brazilian cheesy bread (Pao de Queijo), with no consideration f","useful":5,"cool":4},"lz4HPBIOjbxfzzkXpFVI4g":{"text":"As a vegetarian, it's fun to eat at places where they can make many of their menu items ve","useful":0,"cool":0},"SdJKiU9dTVpp5PE8CV66cA":{"text":"DEVINE.  Got the Rico, the most popular item for lunch. It was piled high with pulled  por","useful":1,"cool":0},"s93EznfEp5gI6zHq9oR4OA":{"text":"My husband and I went here to celebrate his birthday. In all actually he wanted to come he","useful":1,"cool":1},"EdJ3tw6j2r7h6G-XLIe_Jg":{"text":"This place was AWESOME! food and drinks were so very yummy! The kutto was excellent & we l","useful":0,"cool":0},"nTh70sq5gdUETU36aoUp_A":{"text":"Over the top great food! My partner was needing gluten free because she has celiac. We usu","useful":0,"cool":0},"T7M2JV1390yDPRzEBhqCaQ":{"text":"Carmo had some delightful moments, and some less delightful ones. We arrived at this fun a","useful":0,"cool":1},"jRKZgzcR0faVlB1b94AFSA":{"text":"Aaaand yet more love for my favorite vegan-friendly restaurant in New Orleans! Carmo, you'","useful":19,"cool":17},"sl5JVQk1uHJiXCsO8xENNw":{"text":"I messed up my reservation & came on the wrong night. They were super nice about it! I got","useful":0,"cool":0},"A1lFARa_dJop6WB3H5mXLA":{"text":"Fun atmosphere with interesting art in the walls and different types of seating available ","useful":0,"cool":0},"AYoOVCqljfRJiKqCkz-ufg":{"text":"I loved Carmo so much!!! The food and atmosphere were fantastic and our server Sammy was t","useful":0,"cool":0},"JZut9HLfMqiLAH0nSV7ulg":{"text":"Everything about this place was amazing until (sadly) the very end. I opted to come here f","useful":1,"cool":0},"xCLSyjsCpUFY56Lz3h-J7Q":{"text":"I am obsessed with this restaurant! They have everything I love and more. During my recent","useful":7,"cool":5},"8euCysoJYFj4kY1cD7nCSw":{"text":"Wow wow wow! This is my new favorite restaurant. The service and food was exceptional. Eve","useful":2,"cool":0},"vvRlPisNICo6p2Tnrap99Q":{"text":"This spot has a lovely scenery and lighting during the day. Pretty art everywhere. The foo","useful":0,"cool":0},"x69_QmDxREfkSbh9q4RR6A":{"text":"I've eaten here several times in the last few years, and always been impressed with how go","useful":1,"cool":1},"EF8twyvsFdiQQqvCjZ86Cw":{"text":"Ah-maz-Ing! Food and drinks are to die for! Our service sitting at the bar was great thank","useful":0,"cool":0},"SlDCSoCa6y29Z2BbPQXM1Q":{"text":"DO NOT ASK FOR THE FREE DRINK OR 10% YELP DISCOUNT. It is a trick. They gave 2 drinks for ","useful":4,"cool":0},"JOYRaUsjJc38zoJGY3ClNg":{"text":"The food at Carmo is extremely vibrant and fresh! So far I've tried the Rico, ceviche and ","useful":0,"cool":0},"6LbP-YbRVhLaNAi28WngYw":{"text":"This place has a very earthy vibe to it. They have lots of vegan and gluten free options w","useful":0,"cool":1},"8_UoOXEjc515_NoH7zh72g":{"text":"This place is amazing. The food is amazing. The service is amazing. The atmosphere is amaz","useful":0,"cool":0},"3n315o3iSDnVQ8KKK7Yq8g":{"text":"Amazing find! Love everything about this place. Food, atmosphere, staff are wonderful.","useful":0,"cool":0},"AvnA7HBKMNsxngZn0PO6Ug":{"text":"A big wow for this restaurant. The atmosphere was amazing and so relaxed. I love that all ","useful":1,"cool":0},"Ta37ZsTYccP6OMNT0HZvog":{"text":"Every time I am satisfied and overjoyed. I took my foodie friends there and they loved it ","useful":0,"cool":0},"-tbACrn3NZzxK3SAyJAs4w":{"text":"Carmo absolutely met up to its hype!!\n\nAll of the flavors in the different dishes are rich","useful":0,"cool":0},"_0rwuSn6liLsY2MpUvTsMg":{"text":"The main dish I ordered, Rico, was DISGUSTINGLY greasy. It was 85% grease. The side salad ","useful":1,"cool":0},"6H7PU-AkyfQ7Q5i7AWJY0A":{"text":"Great place if you want a súper light and fresh ceviche meal. Tried three different items:","useful":0,"cool":0},"L-ZqXFLw5lTgBvNQjKKZow":{"text":"Gonna make this review short and sweet. The place is kind of a healthy hippy vibe type spo","useful":1,"cool":0},"14YyGE2taiXacPg7RStzQA":{"text":"My salad was so good! I never would have imagined pineapple on a salad, but I am a fan! \n\n","useful":0,"cool":0},"dvhGcQtDGnaVeBAePavXDw":{"text":"Tried this place out when we were in the area for a little trip. Loved the vibe and aesthe","useful":0,"cool":0},"8cO9SMinNNRgMqcXY408qw":{"text":"Carmo is absolutely amazing - the flavor combinations are out of this world and the drinks","useful":0,"cool":0},"D8GXhENMs6SZ7h8LUz2DJw":{"text":"Absolutely delicious food every time I visit. This area was not a food destination when th","useful":1,"cool":1},"WADPxOLrIbsdmQC65awr6A":{"text":"Carmo is probably built into the New Orleans dining scene business model. You come to New ","useful":9,"cool":11},"EU--kazF377kK0Zjb4JmYQ":{"text":"Loved the vegan options here! Everything was so fresh. The menu is clearly labeled with ve","useful":1,"cool":1},"keMK5gU_6S8tZj93hSdJGg":{"text":"I stumbled on this place by accident. But I'm glad I did. It was a unique tropical paradis","useful":2,"cool":0},"UI47XG-cxTI_zfFEswCFAw":{"text":"We had dinner at Carmo last night and the experience and food were both excellent.\n\nWe sco","useful":12,"cool":8},"DSWsXHnRIBTS5TlJGjtsOA":{"text":"If you are in need of some fresh sea food and quality ingredients, you have to stop here! ","useful":0,"cool":0},"1cHpUS89aXXh40Ik0EatRQ":{"text":"This restaurant is EVERYTHING. I was a bit disappointed by the food options available duri","useful":6,"cool":3},"zq3TGZFhhvcUt_d-zZXKvA":{"text":"We had reservations for 6:30 and we were so glad we made them. Although there wasn't anyon","useful":0,"cool":0},"jC2DHa7TdsafiMArOMd8iA":{"text":"You know those restaurants that nail their concept and execution so perfectly that you wan","useful":0,"cool":0},"OB0NQZMiiODfKBW1qZaQHA":{"text":"Total 5 star place. Great Vegan food and options for those who are not vegan. Food is crea","useful":0,"cool":0},"vjRu8mSEnaMYtJPRrgXDKg":{"text":"I've been to Carmo thrice and I want to give it 5 stars so badly, but I've had the same op","useful":0,"cool":0},"DeLOxKIaDBEUYikw4srIrg":{"text":"I've gone to this place many times. Great food. Great atmosphere. Great owner. Try the veg","useful":7,"cool":2},"x1KPATeen5kmd3vDJEyi7A":{"text":"A number of vegetarian options and interesting atmosphere. Not sure I'd go back but it's a","useful":0,"cool":0},"ph_qMFRhiJ9OEEEE502mWg":{"text":"Wonderful place.  Tropical food is an unusual theme, and you wouldn't necessarily think it","useful":0,"cool":0},"S6HgT3Qu0OR5E-LszU2OzQ":{"text":"This was a fabulous experience. The staff was very attentive and knowledgeable, we were bl","useful":2,"cool":1},"iOeH7R6L8NLbPcd8n4FQUA":{"text":"Good and bad! It was so great to find some vegan options in NOLA but in my opinion it was ","useful":0,"cool":0},"FNdHSXfFOqtR9hICb9eVpw":{"text":"Absolutely delicious! The speciality cocktails are a unique and tasty! The little library ","useful":1,"cool":0},"u7CsaDZNLO_BNvcpltQNdg":{"text":"The best selection if vegetarian dishes I've seen anywhere!  Fresh ingredients, creatively","useful":1,"cool":1},"Ceo5vEw5owdzyAxTTNNSsQ":{"text":"I can't say enough about this place.  Delicious and healthy food (the Esmeralda salad is a","useful":3,"cool":1},"HNY4-v5EyukZUo5N6Oe6pA":{"text":"We were expecting so much more from this place from reading the other reviews. The food wa","useful":0,"cool":0},"HIsyBro35Bh1EYULir5YSA":{"text":"Really amazing food! We started with the vegan ceviche, and then had the Vegan rico plate ","useful":2,"cool":3},"I1jblE6kpi9J4S_MjhXPhA":{"text":"I have been here a few times, and keep waiting for the other shoe to drop. There is NO WAY","useful":11,"cool":9},"qpr_cPf1XpZ5fX87r5cpbg":{"text":"You kidding me? Had me at the first sight of food. Was looking for New Orleans style food,","useful":1,"cool":0},"0NsbQZjNBnrNYWmW7e4_fg":{"text":"Yum Yum and more Yum. We Vegetarians did not go hungry here. The full lineup included the ","useful":0,"cool":0},"jDvVXP54JmFwOBPDVsSJOg":{"text":"Whoa. That was an amazing meal. I feel like I had one of everything and none of it disappo","useful":1,"cool":0},"6yaFH6ypMi-D5wKvMvTFow":{"text":"Highly recommend for vegetarians, vegans, people eating gluten-free and with food sensitiv","useful":0,"cool":0},"BuTGaDVzRitW5L7DO-n_gg":{"text":"The drinks!!! Also the food was all very fresh and served timely. They have a nice raw men","useful":0,"cool":0},"MekSpxwFWb_P53oE0wdVoQ":{"text":"This place does not disappoint with flavor and freshness. We chose carmo because we had ve","useful":1,"cool":1},"BVZ5HNh_Az13pngv3cTG2w":{"text":"This place was such a disappointment. First of all it's way more expensive than it should ","useful":2,"cool":0},"Ofo1pH1K-0BPGcmqFLImDw":{"text":"I only got two things here which were the Vegan Ceviche and a Capirinha cocktail. Both wer","useful":2,"cool":2},"8NBsMOI81-SHdb22QxWZUA":{"text":"The food was tasty as far as vegan food goes. I'm vegan so it was fine for me. The service","useful":2,"cool":1},"IUzaabsTIvQdBymxbiUouA":{"text":"I was in New Orleans for a work trip and decided to check this place out based on the menu","useful":1,"cool":0},"CnrQk4aXRBPAdkfDuDAcow":{"text":"Thoroughly enjoyed eating here. Service is informal but good, the food flavorful and diffe","useful":2,"cool":0},"cyG4VeemqJgnRwSUAAKhQA":{"text":"Great food, close to The World War two Museum. Great place to hang out after the tour.","useful":0,"cool":0},"f-K5A7xl9PWLo1liDBjPsA":{"text":"Rico was tasty and healthy.  Soy/Tofu protein or pulled pork on a bed of smashed fried pla","useful":3,"cool":0},"zS7P9PGFWY6GrZjXCax8QA":{"text":"We found Carmo through Yelp while searching for a restaurant to eat dinner. I somehow thou","useful":1,"cool":0},"kvIOU1Cqt139OscYicYFOw":{"text":"Man, oh man, I can't tell you how much I despise using the \"V\" word. No, not \"vagina\" or \"","useful":11,"cool":7},"PFzcFZlV6CY4QQK4pTwKNw":{"text":"Great meal!  Being vegan, you never know how good the meal will be this one dies not disap","useful":0,"cool":1},"Zez6zApfaxHPJ8WPy74gFQ":{"text":"Amazing food!!! Just the right mix of flavors, aroma and spices! Just the taste of home ma","useful":2,"cool":0},"embuQqw8ZXgiUDbiBDD1Ew":{"text":"I enjoy this place when I visit New Orleans. Funky dishes with full flavor. Welcoming staf","useful":1,"cool":1},"-6O9-lXwxCJ0ypz_SdAlsw":{"text":"This is a restaurant that draws food inspiration from Southeast Asia to West Africa, the C","useful":3,"cool":2},"a_YdYMb6-CrRUBS3aPdN7Q":{"text":"We took the City of New Orleans train from Chicago, researching restaurants on the way, an","useful":0,"cool":0},"Plk1PsyXTvWnaGIBiUj4Zw":{"text":"This was my first time having their food.  I ordered delivery.  Oh my gosh was I pleased! ","useful":1,"cool":1},"2XX8j90382htblLVQ8nfAg":{"text":"One of my favorites, completely different from anywhere else, ingredients that blend to ta","useful":0,"cool":0},"s_LtcXHBpOC43zC7At0Wfw":{"text":"OMG this place was amazing. We really struggled to decide what to order. We started with t","useful":0,"cool":0},"W9-a-AGNg8SO2DebA0ZL-A":{"text":"Food was amazing but the service was lacking.  It was beautiful place great decor and musi","useful":2,"cool":1},"HLB7UzHqDt0BkTCcztEd6Q":{"text":"I came here to celebrate my wonderful friend who is getting married. It was a group of 10 ","useful":1,"cool":2},"hGOAQREBzJbeJnY2M6idVQ":{"text":"We were looking for a gluten free restaurant and found this place. The food was awesome! W","useful":0,"cool":0},"rC8Vk-q0cehWUbTvNxlo-g":{"text":"The food here was amazing. So fresh and so much flavour. Highly recommend. Great atmospher","useful":0,"cool":0},"TwrjCj9wxYI3EInVgU92aQ":{"text":"I wasn't expecting to have really good raw/vegan world cuisine in the heart of New Orleans","useful":1,"cool":2},"mrFWpFrFJpbd53ydyvmtzw":{"text":"Carmo was an incredible dining experience that far exceeded any possible expectation I'd h","useful":0,"cool":0},"YqaRaYeIEeWostWHNUUjBg":{"text":"The veggie place down the street. Love that there's a veggie place that's so good and so a","useful":1,"cool":1},"B3FPfwV4e8nnlU1lxvbigA":{"text":"My husband and I have been on the road moving cross country. We needed a place to refuel, ","useful":0,"cool":0},"ozfceQDyD4GB8t7scVzNnQ":{"text":"This place is amazing, the customer service is amazing, environment and the food! I would ","useful":0,"cool":0},"DuhooTw6IHfPPu6eP7-oPQ":{"text":"What an adorable little place! Thanks to Lyndsey Y for introducing me to Carmo, by way of ","useful":10,"cool":7},"lZMlq-9fiLfrSeuRsP43dA":{"text":"Carmo is great! I have been here before for dinner a couple years ago but never made a rev","useful":0,"cool":0},"U_b4Jhtuo76kXyh6v7HlZw":{"text":"This place is amazing in a town full of amazing food.  I had Armenian flatbread with Navar","useful":2,"cool":0},"U4z0aINL0Lihdw5J2lOLSg":{"text":"I wish you had been as attentive and present in your restaurant as you are on Yelp. \n\nYou ","useful":9,"cool":1},"PVZvBwpS7WQVvbTrqEneTQ":{"text":"Fantastic meal (Rico + Curry) and cocktail (mojito), and the decor in the restaurant was v","useful":0,"cool":0},"mgfop7AC9R2Eo3bRyLHWPQ":{"text":"It's weird.. I like thee food but I have to say the service is ridiculous!!! Rude, inatten","useful":0,"cool":0},"pn6_0JHVQLuUYFFCdL66lQ":{"text":"Wow, I can't believe we've been holding out on going to Carmo for so long-it was like a de","useful":1,"cool":2},"QCMWZwKJqakOiE76RIvBsg":{"text":"I have never had such an amazing meal and service! Everyone here was so nice and the food ","useful":0,"cool":0},"KIuK2-SJ-4KhDvD-lUGeqQ":{"text":"If you think you might not be open then don't advertise you will. The fact of the matter i","useful":0,"cool":0},"SOe6jPr_VpqgsUeTk8M1AQ":{"text":"I was blown away by this restaurant! It features savory South American dishes with healthy","useful":1,"cool":0},"gN9uGWeKuX4YatJ3WA2A7w":{"text":"If I could give negative stars I would. I am a foodie who loves going out to eat. I love t","useful":0,"cool":1},"4Lr_7JDBA3AD4Z0Qczff4Q":{"text":"I've been here a few times now and still cannot give more than 3 stars when compared to ot","useful":2,"cool":0},"2Z5YCC8dDKmw-4d_E-JhFg":{"text":"We have to keep ourselves from coming every week! The food is absolutely delicious and you","useful":0,"cool":0},"s0w77rX1Gqsc_IEUcaebJQ":{"text":"I went with a couple of girlfriends for a birthday & we shared a bunch of dishes (vegan/no","useful":1,"cool":1},"9JJU1SYlFfU9fIl4oTgsAw":{"text":"Bumped up to a 4 star: Dana from Carmo was kind enough to touch base with me in regards to","useful":11,"cool":5},"w820UsmQWtzDqF1w3CS1bw":{"text":"Good news for all of you counter ordering haters; they have gotten rid of it! They now hav","useful":6,"cool":4},"j68Ccm337jbD7DxbKmM-qA":{"text":"I love this place! They have something for everyone whether you're vegan or not. The food ","useful":0,"cool":0},"9WI4bLdXs0e3_jdj5kx73g":{"text":"Absolutely an amazing meal, cannot say enough about this place, I am from New Orleans born","useful":0,"cool":0},"By8rFybwHUej_ifMOXAI-A":{"text":"I was SO excited to try this place given its description of colorful, Caribbean cuisine. A","useful":3,"cool":2},"QSwJmevIGIU5NUw5nBomvw":{"text":"Everything here is so fresh and fabulous! The ordering style is a bit unique but refreshin","useful":1,"cool":0},"sxwNSIwYBuDKsVRgDGZCsw":{"text":"Our group was in town for a conference. A few of us went to Carmo the first day we were he","useful":0,"cool":0},"9ANOo0SluaCJ3Bdz_TKt4g":{"text":"When you walk in it seems like a very small deli type place where people are lined up to p","useful":0,"cool":0},"W3xvXZhEuRIhRNZV2bD4pw":{"text":"I am in love with this place. We walked here after checking out the WWII museum, and it wa","useful":1,"cool":1},"skwBg7yPFN0DW9qVXYMb2w":{"text":"My husband and I enjoyed a great meal at Carmo. We loved the eclectic menu with bold flavo","useful":0,"cool":0},"cIiUjLMvZ9usMXYFPJ8YCA":{"text":"Very nice vegan options, jazz trio on Friday night was a nice surprise. Cocktails could be","useful":0,"cool":0},"YD0MzwV9AJBItdNlN-LfYQ":{"text":"Yes, yes, yes, finally a win for vegetarians in New Orleans. I love NOLA, but have always ","useful":1,"cool":2},"718JL3h1MSPKRYuHQjAb5A":{"text":"My husband and I went August 2020, this place is a nice change from all the heavy/fried fo","useful":0,"cool":0},"EGRl0p13IatBHcAt_u7W9g":{"text":"A very cute and clean restaurant with a lot of art. Love music was good. Main con would be","useful":0,"cool":0},"gdKDf18IKra_DZ8atELoqA":{"text":"Incredible food, great prices, and always willing to adjust for vegan or gluten free optio","useful":0,"cool":0},"wgDmvy4j2guXOgqIUeDEUg":{"text":"I had the broken noodles salad for lunch today at Carmo and it was delicious. It was clear","useful":0,"cool":0},"_Uz6CO2lKzRKSTyCy5lO1A":{"text":"Doesn't look like much when you walk by but we were just thinking of having drinks only.  ","useful":0,"cool":0},"vTH0ZnNbxlfhPfGJs_C1VQ":{"text":"I have always loved this restaurant! \nI was able to take part in the COOLINARY August  lun","useful":3,"cool":0},"0fDa7ihxPj8g_v5KdDFtpQ":{"text":"One of the best Gluten Free places in NOLA! My husband was hesitant to come here, saying t","useful":1,"cool":0},"gIBcsXUenfeIPCzWSlE5LQ":{"text":"A wonderful experience!!  My niece is Vegan and ensuring she has a wonderful dining experi","useful":0,"cool":0},"dgXCQkOjO-AO1AkJIyZo8g":{"text":"Warm and welcoming service, adventurous food and a fun atmosphere. Satisfying for vegans a","useful":1,"cool":0},"VFA--6K_yMLLyWQvKP9a0A":{"text":"Excellent food with incredible flavor.  Had the passion fruit pulled pork over a plantain.","useful":2,"cool":1},"EfoGL24U8L35gTJBICv7og":{"text":"After a day of exhausting project planning, my vegan friend and I were hungry and decided ","useful":1,"cool":0},"f1G7ZUeZHio3xGkd3cvifw":{"text":"This was just all wrong. We were walking on Julia street and noticed the cool atmosphere h","useful":1,"cool":0},"gXDsOiDoBfdw9QGy5va6Gg":{"text":"Slowest place in CBD. While the food is good you should not wait 30 minutes for a salad of","useful":0,"cool":0},"PEVWsxz6_WaPZxwYj1yHlQ":{"text":"What a quaint, lovely place. We entered the restaurant wherein there was a small line. One","useful":1,"cool":1},"vqj5kQfdhirl1_4dFkxteg":{"text":"This is a must-visit anytime I'm in NOLA. It has great vegan and gluten free options, but ","useful":1,"cool":0},"9QpligCn83X-ibPdNuLrKg":{"text":"Carmo is one of my favorite cafes in New Orleans. I strongly recommend it. Plenty of healt","useful":0,"cool":0},"09lMqEtP3NP7vb3hl0_qyQ":{"text":"I choose a beautiful day to take on this tropical Cafe in the city. To start we tried the ","useful":0,"cool":0},"I55nOnBA8tXOnDrd1MFuYQ":{"text":"Oh my gash if your in NEw Orleans you need to stop here! The best vegan place ever. You ca","useful":0,"cool":0},"cfpuuq03Jd4Ra0SsiOnaQA":{"text":"Wonderful food and service. We had the Creole flatbread and broken noodle salad. Both were","useful":0,"cool":1},"ylLOMhvdb1LG3loWMZjNgQ":{"text":"Great hidden gem in the Mecca of great food.\n\nHighly recommend asking for Sammy if it's yo","useful":1,"cool":0},"FIJoHo2fFMiElB4OWyEp3w":{"text":"Found this place on Yelp (of course) while looking for something close to our hotel in NOL","useful":1,"cool":0},"rqayjUrmPgN-APJ7NXhKOQ":{"text":"Absolute great experience. I am Gluten-free & my partner is vegetarian so finding places t","useful":4,"cool":0},"2ENYF8EhPhx6BGKoCiY7-A":{"text":"Serving vegan options, this restaurant provides so much taste and flavor in their dish. I ","useful":1,"cool":0},"ve4R1PcPGzwzWt_eurtdKQ":{"text":"This was a great find in the New Orleans French Quarter for those looking for a gluten-fre","useful":0,"cool":0},"A01xqpMeot_4lFs22fTmuw":{"text":"After my second trip to Carmo, I now understand the hype. \n\nOn my first trip I had a sandw","useful":12,"cool":6},"GzHxizeZUQvLSNT71U2cKg":{"text":"Mostly all good! I am delighted that they provide VEGAN and VEGETARIAN options, what a won","useful":1,"cool":1},"zAMI2kFIrEi9-xshowTmOg":{"text":"Woah! A place in NOLA that serves healthy stuff including vegetables and fresh squeezed ju","useful":1,"cool":1},"HnD-Xcn-qKz6OGReQHdAAQ":{"text":"I ventured to this restaurant for the acaraje, which I was told they no longer serve. I at","useful":0,"cool":0},"mROPRYNiuB-NwkAuEh-9lg":{"text":"Carmo is a fantastic place for lunch in the CBD. They've got a great selection of fresh, m","useful":0,"cool":0},"7EzZujcNLPERJ3TlXdk6xg":{"text":"Wonderful spot for dinner if you are looking for a great fusion of world cuisines.  The me","useful":5,"cool":2},"RAoTPbCgTSzPUagEkkATYw":{"text":"BEST SALAD I HAD OUT OF 150 RESTAURANTS THAT I TRIED IN 2013!\nBLOWS GREEN GODDESS OUTTA DA","useful":8,"cool":2},"LTp5q4LBqw8aovr_TJioPA":{"text":"I'm not vegetarian by any means, but Carmo was a serious GODSEND during my trip to New Orl","useful":9,"cool":9},"Yxn9slraO5IfuRX_njEsvA":{"text":"Such a great place! Loved how fresh and clean all the food is. The Peruvian ceviche is to ","useful":0,"cool":0},"KITiNPJVRiqmrw2PJXTkgA":{"text":"I'm so happy I decided to let @cafecarmo do all the cooking tonight. Sis needed a break pl","useful":3,"cool":0},"oOS6N2TQW7guTd-9m5X4vA":{"text":"My friends and I are visiting New Orleans for the first time. I am vegan and it was my tur","useful":0,"cool":0},"Hx3EyxAmfBC781gUXVfRLA":{"text":"I was surprised how good this was! Carmo is vegan/vegetarian friendly, but has meat and fi","useful":4,"cool":1},"OfJOr3faFXr-Yj1nT0_OUQ":{"text":"Thanks to a good friend of mine for introducing me to this vegetarian/vegan place! When we","useful":1,"cool":1},"2asqLldLsE7vYoYRd3Yiyg":{"text":"We came in on a very busy Monday evening and service was painfully slow as a result. Howev","useful":1,"cool":1},"e6zRPN3blUs9OYDmN07vXQ":{"text":"Having visited years before, Carmo continues to be fabulous (I mean come on, look at Joi B","useful":3,"cool":1},"Y9FTgYYoFxolWNi8GNbFjg":{"text":"Great Place! Great vegan choices super cool space nice place to chill off our cruise ship ","useful":0,"cool":0},"39f_3Wv9-V1j0I9XS5ImmA":{"text":"Oh my yum. Loved my carmo salad. If you are like me and thinking you won't be full, you ar","useful":1,"cool":1},"NzDArnDGy2YA1kJFGLVV8Q":{"text":"Wow! We were walking around the warehouse district looking for something different and we ","useful":1,"cool":1},"t2pJjy0awLoz7cLqevo19w":{"text":"Since i have vegetarian/vegan friends in town, I was excited to check out all of these fun","useful":4,"cool":4},"XN2RXTEbQI3m1vsdKjaGRg":{"text":"Carmo is one of those restaurants that are difficult to find. When I went it was very pack","useful":1,"cool":1},"KEF0RCH73ycw33RlBvLcXQ":{"text":"Had a great lunch experience here. Stopped in for a late lunch, had a few drinks and some ","useful":4,"cool":3},"NhVrrAAgT_s_QfjiXxAkvg":{"text":"This is exactly the kind of restaurant experience I have come to expect and love from NOLA","useful":0,"cool":0},"lpeDQJf_OEAMMTF1IS7e6g":{"text":"The food was fresh, delicious, and colorful. We enjoyed the Veggie Rico, Fish Fritters, an","useful":0,"cool":0},"dbFn23zKeUW8A7I_z0PmEA":{"text":"This place came highly recommended on Yelp. That and quiet a few Yelpers told me about thi","useful":3,"cool":1},"4E1XnwV4asOtHIRNEYcU2Q":{"text":"This restaurant has very unique dishes, from countries all around the equator. Each was de","useful":0,"cool":0},"lo7nk0f3Fv-1cG06Z8boPA":{"text":"Thank you Yelp for helping me find this gem. After a lot of butter and salt from a binge o","useful":4,"cool":0},"0v1aKWSNZniW0cPT0GVYzA":{"text":"What a stunner! We went with completely raw entrees - tea salad and two versions of cevich","useful":0,"cool":0},"AIa78tWRW1tchCSXoY1TTQ":{"text":"It had been a while since my last trip to Carmo and I was happy to find that the quality f","useful":2,"cool":1},"Xd02zOS6Ab_qGFWHGHuxOQ":{"text":"Goodness gracious, don't come here for a birthday dinner. My husband secretly asked for a ","useful":5,"cool":0},"lu35ias2_vLdqLvP4Y3MLA":{"text":"We went here when we were visiting new orleans for a quick weekend getaway and as you can ","useful":3,"cool":2},"IRmun1r0evtdT3CH3qkftw":{"text":"I'm embar rassed to say that this was my very first experience with ceviche but I'm glad i","useful":2,"cool":1},"SSNWwy5AHRosZxz0LbCJvw":{"text":"I think about Carmo every.single.day. And I'm not even joking.\nI've started asking people ","useful":12,"cool":11},"Yv0EgFQ3oM8R51NHdEd2fQ":{"text":"Live, laugh, Carmo?\nLet me paint the scene, it's a Friday night  you've made the proper re","useful":2,"cool":0},"ePArevpjAUxL6AaOtYgWmQ":{"text":"This was an excellent meal but I was enjoying the conversation with my friends so much tha","useful":8,"cool":7},"khc4MsgztolS8_qS-z3ayw":{"text":"This is a jewel of the warehouse district. With all the heavy, rich food everywhere else i","useful":0,"cool":0},"99FDUCNS4chr-KZ-ZcJK2A":{"text":"Good was unique and delicious. Service was wonderful. Sat outside on a perfect fall night.","useful":0,"cool":0},"QC2NdoJmdn81b1VSiGyvMg":{"text":"Fantastic open-air ambiance, attentive & helpful staff, and remarkable global menu & drink","useful":2,"cool":1},"5je5Hoe2X7i5BbbZD0fyqA":{"text":"Great place!\nGreat vegan choices!\nSuper cool space\nNice place to chill off our cruise ship","useful":1,"cool":2}}