{"EFPa-IMOTYjBxTlc37C0ZA":{"text":"Really nice spot!\n\nMy husband and I spent some days in this hotel for our first vacation i","useful":0,"cool":0},"dZPjt_Ebulf3V4J6EBhBbg":{"text":"What is not to love about this little gem? It is a boutique hotel in a great spot in NOLA,","useful":0,"cool":0},"cIYooz9ecdWJ4c4RFz5Drw":{"text":"By far the best boutique I've stayed at for some time and I love boutique hotels. Loved th","useful":0,"cool":0},"Zk7B5n0bboHMZXcPDUqTiQ":{"text":"We loved this place. Rooms were cool and the bar waitstaff and food were even better! Get ","useful":0,"cool":0},"NpiUutGA4f3B151FFRTvmA":{"text":"What a cool hotel!  Located in two(!) 19th century buildings across an alley from each oth","useful":0,"cool":0},"PboQSNTbh1IuSko7Vwbd_A":{"text":"I have stayed at the Hotel twice in the past 3 years (both times for 3 nights during Jazz ","useful":1,"cool":0},"MvOW9n_NE_GKSNnOkx8vSA":{"text":"Got a good room rate a few weeks in advance. Service was great at the counter; check in wa","useful":0,"cool":1},"8eVlvNtgMB1RNw-8yerSnw":{"text":"This Hotel if you want to call it that...... is terrible!  Staff lacks knowledge and manag","useful":1,"cool":0},"9Nf6vFPn_78ThCl8cSQfmw":{"text":"Great location, but that's about it. Room is SMALL, and was dirty upon check-in. After req","useful":1,"cool":0},"vUSOHR4Ay9ArJGjtj6oAwg":{"text":"After reading the reviews I was really looking forward to my stay at The Q&C for French Qu","useful":0,"cool":0},"upU9u0R5b6D6bt1UGsfHZA":{"text":"What an awesome hotel! The staff is so friendly! The rooms are so nice! The bar and food i","useful":3,"cool":0},"TyMSkJNDPKjYQO_lB5dHSA":{"text":"Stayed here for Courtney and Joe Pipers Wedding on PI day/ St.Paddys weekend! \nI am so mad","useful":3,"cool":0},"RHkgqDMcNU7xQ37XxMstxQ":{"text":"We had originally planned to stay somewhere else, but had to change plans at the last minu","useful":1,"cool":0},"iurH3haYRGXTpSk1Bb8bpQ":{"text":"This was our second visit to NOLA and found this gem on KAYAK. Great rates and attracted b","useful":1,"cool":0},"Y_Khhv_WoZruumWBpT8j6Q":{"text":"Hands down the worst experience I have ever had at a hotel in my life. From a pipe busting","useful":1,"cool":0},"KaZcbMIhosvYGJwL10_3tg":{"text":"Poor customer service. I had a do not disturb sign on my door left room and room service s","useful":1,"cool":0},"zXWuavvTfzpgTS3w4LF_Cw":{"text":"Hands down my favorite hotel I have ever stayed in.  I booked recently for an anniversary ","useful":1,"cool":0},"TWgn-yeqZh0qm1PQeNROEA":{"text":"3.5 stars\n\nThe cleaning person did not clean our room. She made the bed and gave us new to","useful":3,"cool":0},"7LTga_FSteea-ZdRjBBnoA":{"text":"I loved this hotel but the reason I had to give Queen and Crescent only 2 stars instead of","useful":2,"cool":1},"L06TZySer1yVSX4KQTxrmg":{"text":"If I could give less than I star, I would.  Positively awful experience.  Unfriendly, rude","useful":1,"cool":0},"g_hEbl5ZzP208R5fkHSdcw":{"text":"Visited New Orleans for the first time 2 weeks ago, and unfortunately I have to say that s","useful":3,"cool":0},"k2DDjvcTGDoOaKlPnvGkNg":{"text":"Valet scratched my rental car and took forever for someone to address. This caused us to g","useful":2,"cool":0},"Lg6Zqcy8RxbTMuqHYONK5g":{"text":"Great staff, nice spacious room.  Not a big fan of cement floors without carpeting, cold o","useful":1,"cool":0},"IUQc6iPE79taHnOtd9ElOQ":{"text":"Stayed here one night because our other hotel did not availability.  Hotel has a nice rust","useful":0,"cool":0},"OCM9-T4KeH5gRTHH0lULaA":{"text":"Sold our room to someone for a more expensive price and took the liberty of booking us at ","useful":3,"cool":0},"DlK2IKZU0MNNBs52aHKA5A":{"text":"Casual modern, pet friendly hotel, well located walkable distance to the french quarter. W","useful":2,"cool":0},"GXmZml0_al1PNTsMhOaigQ":{"text":"Not a 5-star experience but nice boutique hotel.  Room was small but fairly well appointed","useful":0,"cool":0},"MfU1jH5go0DVF3Q5JduzUQ":{"text":"This hotel was amazing and in a great location. Walking distance to all the fun but in a q","useful":1,"cool":0},"eI8cj2R0qAD6ADpvD3YfUA":{"text":"Seriously beautiful and modern.  Post renovation each room is breathtakingly sleek, with c","useful":1,"cool":0},"nUx2ySzHf-mNnfmxkXdIWQ":{"text":"Loved our stay. The room slept four comfortably and the staff were courteous. We were clos","useful":2,"cool":0},"M8nwYCZrtxGPCN2AwZ4jGQ":{"text":"This hotel lacks service, service and cleanliness! Our personal bathroom never had tissue ","useful":0,"cool":0},"ha5uv_4rmzPy2iy3Qo9ttA":{"text":"It's taken me almost two years to write this review...life just got away from me. But, it'","useful":0,"cool":0},"OUQpIJrFPvArnvqi4kNQ6w":{"text":"Nice, big rooms including all daily necessary luxury. Also the location, walking distance ","useful":0,"cool":0},"dIVSJdhge94qN8ZKu83CJg":{"text":"I can not articulate how wonderful this hotel is. I will admit I was hesitant about stayin","useful":4,"cool":1},"HpT6bWcFramvrpyY9EuAcw":{"text":"This was a last second decision hotel in New Orleans, all of our mother options fell throu","useful":1,"cool":0},"9hvdyvXAszBa1G1WrAUnUg":{"text":"So disappointed by my stay after seeing wonderful reviews online. I booked my reservation ","useful":1,"cool":0},"A7T0Y0ekXAJqWf6bjGWOlw":{"text":"This is a really nice hotel, it's the exact hotel appearance wise that you would want to s","useful":2,"cool":0},"hOl2340oj2UZEbR28xDciQ":{"text":"Let me start by saying that the staff was great. Very friendly and helpful but... Not only","useful":0,"cool":0},"HqCgJMNK4IuOkwa0x6uUrQ":{"text":"Things that need to be improved:\n1. Better customer service: we had to wait forever for va","useful":0,"cool":0},"7UUtU0vvSu3Bh2fsnCJzCw":{"text":"I didn't stay at this hotel but I did eat at the restaurant in the lobby and the food was ","useful":1,"cool":0},"nYcaAPfXgstHakTu1YdghA":{"text":"We loved everything about our stay at the Q&C. We brought 5 rooms worth of Friends & Famil","useful":1,"cool":0},"I42_2iaxqWiP7ichU2zhXw":{"text":"Beautiful hotel. Trendy. Has that Northwestern feel, like the Ace Hotel brand. Perfectly a","useful":0,"cool":0},"nQRP0amH45aSSp8FO06nWw":{"text":"We requested a board room and full dining service for a staff meeting over a month in adva","useful":0,"cool":0},"n7loPhmrKHxw0r202AV5iA":{"text":"Great location\nNice decor\n\nBad service from front desk to valet.\n\nProbably would not retur","useful":0,"cool":0},"lDNZoPclboAD-tw_tsLMCA":{"text":"Queen & Crescent (Q&C) is what I'd called hipstoric (hipster + historic). Like a page out ","useful":2,"cool":0},"84tHrI57dO-d5ADSem27XA":{"text":"We stayed here in late June and had an amazing experience. The hotel was gorgeous and in g","useful":0,"cool":0},"84qgKNVcVlitXeCPVw450g":{"text":"Let me start with the good.  All of the staff is very friendly and welcoming.  The doormen","useful":0,"cool":0},"_a8Rr9rYhGMBrwG2mqdlzQ":{"text":"I stayed at the Q & C while in town for a wedding. The location is great and certainly it'","useful":1,"cool":0},"dC8RLJ01oveto6LFMdqbzw":{"text":"My wonderful, organized friend did a lot of research on picking out a hotel for my 30th bi","useful":0,"cool":0},"VxHEU3KaeeZi34eMS6UMGQ":{"text":"2.5\nPositives: rooms are sleek and modern and a good location \nNegatives: customer service","useful":0,"cool":0},"dAkqMfAwdGfywjmu5Npbgw":{"text":"We have stayed here twice in the last 6 months. Highley recommend staying here. A short wa","useful":1,"cool":0},"0oQpoGCpYXqmoWb6pL8NfQ":{"text":"A very unique Marriott property in a building that used to be HQ for Q&C Railroad.  A lot ","useful":0,"cool":0},"y4iLc4AhENyCSyFphSEPvw":{"text":"This hotel is gorgeous! I think the negative reviews are before the renovations, or maybe ","useful":1,"cool":0},"vbVdpOkMSzajm4wRGVXT7g":{"text":"My stay at Q & C was a very pleasant one. The staff was extremely friendly & helpful. If I","useful":0,"cool":0},"ZgSTpovIY1TfBArl1BV0gw":{"text":"We will not be back to the Q&C hotel. Let me start with positives. 1) location. 5 minute w","useful":7,"cool":1},"jrSSKA1xnlZJ8pCclLX_KA":{"text":"Remarkable!!! All the way around...drinks, customer service, room...great stay!!!we couldn","useful":0,"cool":0},"75SZWr-CnOHaFB0nwFeNXg":{"text":"Just look at the photos of this place. SO COOL! The rooms are super trendy yet comfy. It a","useful":1,"cool":0},"sqTm1-PgqI6dzg3o2WEgiQ":{"text":"This hotel blends trendiness among everyday-ness. The lobby is full of tattoo'd hipster, m","useful":1,"cool":0},"l3UMTkGPTzePebd6yhyuEA":{"text":"Loved this hotel! It was the perfect location - located close to the French Quarter (3 blo","useful":1,"cool":0},"V6j02ydX0jrIDhQY_JquYg":{"text":"Came here for a long weekend and was pleasantly surprised! The style of the hotel is reall","useful":0,"cool":0},"1FwhKDnRbY-namqLGgOI3Q":{"text":"We thoroughly enjoyed our stay at the Queen and Crescent! First of all, the location is pe","useful":1,"cool":0},"kPvu-TioNHsaH1HHxXPGBg":{"text":"I just adore this hotel! The entire hotel was pristine and the service was perfect. I foun","useful":0,"cool":0},"TsQUAHmgzn7UzvOQpLhehA":{"text":"Best hotel we've stayed in thus far. When you first walk into the hotel you will immediate","useful":3,"cool":0},"n87UGq-TurXlrhgpua2JzQ":{"text":"Adorable hotel totally renovated. Fabulous staff. Great location. Love the exposed brick a","useful":0,"cool":0},"NLmYtEx6F5Rn71Z7Yq5mqw":{"text":"The staff was great! Juana in particular really took care of us. Even the cleaning staff w","useful":0,"cool":0},"PW3o6lEaNmeNoatm-VHEOg":{"text":"Staff is a 10!! so sweet. the customer service is awesome. it's it's a great little boutiq","useful":0,"cool":0},"pVoL28CzLsPwMLT9YPh-Xg":{"text":"Stayed here Saturday night. GORGEOUS AND CHEAP, AND VERY WELL LOCATED. No meals but you sh","useful":2,"cool":0},"0LZj8N7UI9dUA-Y_5ndXgA":{"text":"Loved this hotel! Great location and dog friendly. We fought our 80lb boy and they were so","useful":0,"cool":0},"C0FdfFa_V6iXjMirfzgQ0g":{"text":"Super cute hotel! Very comfy, warm, and inviting. The only issue I had was the gym. It was","useful":0,"cool":0},"zfa9XFtQlTj7C-0GC9UyWQ":{"text":"Really cool hotel, loved the style and ambiance of Q&C. A friend checked-in to our room be","useful":2,"cool":0},"QIEen_Co2kAZv9_Jg7esVw":{"text":"Checked in for what was suppose to have been a 3 night stay.  Checked out after only one n","useful":0,"cool":0},"gfR4T8ZTRUfdUXQu7vek_Q":{"text":"Just stayed at this amazing hotel with my boyfriend for three nights.. Everyone was amazin","useful":0,"cool":0},"qQr1l5WYrYPfnmeoRu4lZg":{"text":"This review is post renovation - many of the low star/poor reviews are pre renovation (pre","useful":7,"cool":1},"B0KPzex6LSHVZ5Pm6D_sSw":{"text":"Great place! Beautiful rooms and lounge/bar/restaurant area. Walking distance to the frenc","useful":2,"cool":1},"jm-n3pfcg67blhALSCbumw":{"text":"I wanted to like my stay at the Q&C since the people that work there are fantastic. And th","useful":0,"cool":0},"92HzPrRMBL2NvmXAmpA6eg":{"text":"Just stayed at this hotel during Mardi Gras and really enjoyed it! Rooms were small but cl","useful":1,"cool":0},"TBJPzkhEaieBvBatFdQ1fA":{"text":"This is an excellent choice for those who want to bring pets on vacation. The building is ","useful":0,"cool":0},"heRlZX4-IicZO_6BOH1ePQ":{"text":"I've gone back and forth on what rating to leave Q&C. The staff was excellent and deserve ","useful":0,"cool":0},"giz7kXMgBAUHE869v3Uycg":{"text":"I really enjoyed the stay.  The rooms were nice and the staff was very pleasant and helpfu","useful":0,"cool":0},"ashc2HduR87jtntOSnImcg":{"text":"We loved the location of the Q&C, we were just a short leisurely stroll to the French Quar","useful":0,"cool":0},"M8AgOuZ1p2ogIYuor7bsQA":{"text":"Great place!  From Max at the door to Irash at the desk and Stephen at the bar and all of ","useful":1,"cool":0},"ladQwC0cJgbXwXXJRtgYqw":{"text":"This place is newly renovated and wow... They did an amazing job. The hotel itself looks l","useful":0,"cool":0},"B3mVymE6FGCWItZar49ZnQ":{"text":"A great independent hotel locally very conveniently to the French Quarter and plenty of ta","useful":1,"cool":1},"xy6kOSfyZMRuHGvwVZVcvw":{"text":"The old reveiws should be thrown away. Our room showed off the building's old wood an bric","useful":2,"cool":0},"u8BKb0igznVut_8whMCWkw":{"text":"Absolutely loved our stay at the Q and C. I got a good deal through bookit.com and at firs","useful":0,"cool":0},"HyhNJR1UFnk11Ot24PQz9g":{"text":"We stayed at Q & C this weekend.  Check in and out were a breeze.  Great front desk, bell ","useful":0,"cool":0},"plLcp-BoNLgGrjoac4t5eg":{"text":"This hotel is wonderful! We arrived very early in the morning and we were allowed to check","useful":1,"cool":0},"YWUQLRn353Az-BR8iTmidg":{"text":"We stayed here for 4 nights in the wonderful city of New Orleans and enjoyed the wonderful","useful":0,"cool":1},"Xlz85LgClY9-zqtHl6LoRA":{"text":"Terrible customer service.  We reserved a room for our party of three several months ago. ","useful":1,"cool":0},"P3Uz3SNVPrC-6saI3H7v1A":{"text":"Nice folks and manager, they were having a computer glitch and did the best they could. \nR","useful":0,"cool":0},"YXPVRpOz_Wla3c0kUzGcfg":{"text":"Coolest hotel I've stayed in. The moment you walk into the lobby or the lounge you're imme","useful":1,"cool":0},"bHKusw926YEzjQp0LLqaEw":{"text":"My wife and I came here for a much needed honeymoon/vacation. We throughly enjoyed our sta","useful":1,"cool":0},"31QGBkaVNRrTMoxYpeAtjA":{"text":"This place was amazing! We stayed there for a bachelorette trip! Our AC wasn't working and","useful":0,"cool":0},"iQ2lJvDvmwinAyljvwv0uw":{"text":"This hotel as actually very beautiful and locally own. Inside they have amazing design tha","useful":0,"cool":0},"QctGTiofd5SpKgcSRa7XKg":{"text":"Nice place to stay when you name your price on priceline. Not The fanciest but not into al","useful":0,"cool":0},"4Okp8Ro95oJY5HMKVhYebg":{"text":"Staff was super friendly, the room was adorable, and Nick at the front desk is my homie no","useful":0,"cool":0},"orwuczQ2RGayXSUv_2MuHw":{"text":"Awesome, hospitality when traveling to the French Quarters. We used our Marriot points.","useful":0,"cool":0},"VSUPkze57dn3fEmgmWyauQ":{"text":"Labor Day 2015 stay was awesome! Hotel is very modern yey welcoming and homey. Check in wa","useful":1,"cool":0},"2w9ZVFAAoxcfaoZvdCT4UQ":{"text":"Really stylish, comfortable, clean hotel at New Orleans, French Quarter. Located close to ","useful":2,"cool":1},"V803pq8QvzwR_RChhiN08w":{"text":"Business and leisure trip, 7 nights.  Excellent customer service at every level.  Chef Jos","useful":3,"cool":1},"lpL8_zGqMWE_4k5ftwN43w":{"text":"We loved this hotel. Friendly staff, awesome Decora,\nGreat nightly rate. The bed was so co","useful":0,"cool":0},"T-YIOVoNp9MuT4G9D5b3rg":{"text":"The property is very contemporary and perfect for those looking for a smaller property awa","useful":7,"cool":3},"2IU0Z-9isw1Y-ofNu9JMKg":{"text":"This is our second time to stay here and we found it as accommodating this time as it was ","useful":1,"cool":1},"CtiX5p8HNtFUVylwjJnYwQ":{"text":"Love this hotel - Will be visiting again.\n\nStaff is super friendly and very informative an","useful":0,"cool":0},"QpihOOiqBpLQowKHeI9rbA":{"text":"Great location.  Walk to everything.  Cool NY style loft rooms.  Staff is great.  Staying ","useful":0,"cool":0},"jPFGIsMif2fTmtak7zavGQ":{"text":"First Time is a Charm: For my first time visiting New Orleans the Q&C Hotel in the Central","useful":0,"cool":0},"UgIorFYhdaujjViLaWfLag":{"text":"I thoroughly enjoyed my time at this cute boutique hotel. The staff was super friendly, an","useful":0,"cool":0},"bxIsSgFRMGIAn1k5cs2-Xg":{"text":"Yay!\n\nThis newly renovated hotel is an Instagrammer's paradise. The decor is v. old worldl","useful":3,"cool":0},"3n0EK7HQZfVe_tcR_KQ_LA":{"text":"Not impressed, especially for the cost!!  Stayed in a king room. Didn't realize I needed t","useful":0,"cool":0},"k9Xgf5PwZLpw5qfgthq67w":{"text":"What a gem! I love this place! Very clean and very well planned. I love how the taps to th","useful":1,"cool":0},"taDEC_XuLMy6417l895FJQ":{"text":"Have stayed a few time, this time not so good. My room is very cranmped, and in poor worki","useful":0,"cool":0},"N71vrGwVRqgOnkHYTp4MXg":{"text":"I want to give 3.5 stars but that is not an option. \n\nSince checking in this afternoon, I'","useful":0,"cool":0},"YUzCOcS687EFl4mH1Gp7dA":{"text":"My boyfriend and I booked our stay here through hotels.com because of the location. I didn","useful":0,"cool":1},"wGQy3vDJhveIk21Hk9auAg":{"text":"The hotel is in a couple old buildings that have been renovated. It is downtown and within","useful":0,"cool":1},"khqnGuCSlb9kwsMy-02UwQ":{"text":"Newly renovated, super comfortable and hip.  In town for business WITH our baby, so wanted","useful":1,"cool":0},"PR7nlIU5NbhZ9LcsguPq0w":{"text":"The hubby and I absolutely loved the rustic yet modern vibe of this boutiquy hotel. Exquis","useful":0,"cool":0},"s_Pbve4gvLgZQHBaQRYoKQ":{"text":"I really wanted to love the newly renovated q&c, but after our recent visit, I'm just in \"","useful":0,"cool":0},"zCy3NRG5v89GUhSlcnf9yg":{"text":"My boyfriend and I stayed here for a weekend while in town for a friend's wedding. It took","useful":2,"cool":0},"oLYknd-ZUyuLSy_PTiazQg":{"text":"Man oh man, I think I found a new collection of hotels that I'm going to stay in more ofte","useful":3,"cool":2},"Y45oYggCWdU3gVM7v-AmNw":{"text":"The hotel is at a great location. Incredibly walkable but just far enough off of the Frenc","useful":0,"cool":0},"iCtVaChrps4nzCvb0ydCIw":{"text":"The hotel is cute, clean and modern but the hotel staff really takes it up a notch. They a","useful":0,"cool":0},"Quv1YEZyFl8rHn8hDA4YVw":{"text":"This is my second stay at the Q&C hotel, and I will definitely come back every time I visi","useful":1,"cool":0},"I-sMuTD7GEENo5lIqNceog":{"text":"This hotel has minor problems and the maintenance and lack of upkeep was noticeable. I had","useful":2,"cool":0},"whWjH4d8G9gwVoB3EZg6yw":{"text":"Pretty cool hotel. Nice room with great bathroom layout. I would have given a 4th star but","useful":1,"cool":0},"KT7uP0AFYSC9hB00quZUQA":{"text":"Cons: First night the Air Conditioning did not work. The second night the air conditioning","useful":1,"cool":0},"Tyv2WguZ9peipIvcbReHfg":{"text":"My husband and I have stayed in many hotels and we both agree that this is the best experi","useful":1,"cool":0},"CMrgfXUGuc68mXBTQ4gSKw":{"text":"I can't compliment this hotel more. A true boutique hotel. Perfect for a couples weekend g","useful":2,"cool":0},"d1Kijg89aJkqbKLYZNcdgQ":{"text":"A gorgeous and unique hotel. Stayed here with a large group for a bachelor party and we al","useful":0,"cool":0},"e89gsxfLT4Ko6sGdUJRlew":{"text":"Michael is great! 11/10 customer service. The room was roomy and clean. The lobby is cool ","useful":0,"cool":0},"4uV3j7oO0PobwDcwuejTfA":{"text":"Very nice place to stay. Rooms are unique, not the average \"cookie cutter\" hotel. Staff wa","useful":0,"cool":0},"9Slb_El_D_a9fc49rkP2Yw":{"text":"What a place and what a great staff, just close enough to Bourbon Street yet far enough aw","useful":1,"cool":0},"jwlL4YeAZ-8C65Es74aJOg":{"text":"absolutely a great hotel if you want to visit NO. location was fantastic, rooms were comfo","useful":3,"cool":0},"oqNE9MnYpnJ2jLG5rutaFA":{"text":"This is one of the best/coolest hotels that I have stayed in and I have stayed in a lot of","useful":2,"cool":1},"5OTWagbDdxXVSxs2A3midA":{"text":"Swank hotel with an amazing staff! From the doormen, the reception desk, bartenders, the h","useful":2,"cool":1},"p0JQLbCRrZ6TxE0Ku5oFkA":{"text":"I read the reviews... what people were saying about the bathroom\\shower, closet etc. & res","useful":8,"cool":3},"BOX5kVjopYVpUcoOLnFYdw":{"text":"Fabulous boutique hotel, fun rooms, well appointed and oh so comfy!\nThe staff was outstand","useful":0,"cool":1},"suX--FBBKXwiIoCPmc3cYA":{"text":"This hotel is gorgeous and let me be clear as to why I'm giving it 5 stars: Deonna the fro","useful":0,"cool":0},"JvNFWIbIUPRgxvmGZLlvjw":{"text":"Honestly this hotel has been an amazing highlight to our trip. It is very newly renovated,","useful":3,"cool":0},"1J3_FNvyoqcqoTWL_aUyfg":{"text":"This was our third time in NOLA, and by far the best place we've staid. Staff was very hel","useful":0,"cool":0},"u5OJhSSSZsMcvKj_7mzKHQ":{"text":"This hotel was absolutely wonderful. Clean rooms, excellent decor and fun staff. The hotel","useful":0,"cool":0},"DIszI1CqRvZQzlwcFjh8wA":{"text":"My husband and I stayed here for a Christmas vacation and loved it. Very trendy, clean and","useful":0,"cool":0},"OE8ik7BdClwMltfe2YWb_g":{"text":"Room is very nice. Front desk service was all over the place. Had some great folks who wer","useful":0,"cool":0},"hNEsr8YAcY_x3CR1pxSO6A":{"text":"Great location, clean, comfortable, great service, parking's a bit steep, but valet is rel","useful":0,"cool":1},"YiFz6IIBd61CzanaVqWAvw":{"text":"We loved the Room decor, beds were so comfortable, nice tv, staff was do helpful and accom","useful":2,"cool":0},"E4PO4o1J-LJyRK3I6271ag":{"text":"I loved the look and feel of this hotel. The bed was nice, the room was clean and I especi","useful":1,"cool":0},"h7IsSDVO1rBHFXmkdr73LQ":{"text":"As a business traveler who travels every week,  you hook up with new brands and their bett","useful":2,"cool":0},"3Pr74cVZf1h32EpOSIVEUg":{"text":"I love love loved this hotel! It is exactly what I wanted for my trip to New Orleans. Step","useful":3,"cool":1},"CZ8GdqVaFG3QdOLIy7hoIQ":{"text":"This was such a beautiful hotel with really great staff! I thought the room size and bathr","useful":0,"cool":0},"L9hVhlcdg4dFwRqZjfXR2w":{"text":"These guys are fabulous! And I'm saying that based on a hotel room with no windows. They'r","useful":0,"cool":0},"QyxruEtWQUAiiu6P9Kk_CQ":{"text":"The hotel rooms are really cute and modern, providing a really good ambiance. The price wa","useful":1,"cool":0},"6vsRYTEWEnT7RQY_epOkNQ":{"text":"Went on a weekend vacation to New Orleans with my girlfriend; we chose the Q&C because it ","useful":0,"cool":0},"b1b5PWKONJ9akrmY0v3H1g":{"text":"Best Pizza I have ever had (really).  Very friendly staff. Shower could have been hotter.","useful":0,"cool":1},"NEcxwKCHUDD1grizScIW-g":{"text":"This was our second time staying at this hotel. The first time was about 4 years ago, befo","useful":0,"cool":0},"Kb_wxTsixvoCzfrkJXotJA":{"text":"I have to say, I've changed my tune about the QandC. A few years ago I visited New Orleans","useful":0,"cool":0},"2ZpaWp6oA2iP_Nz4sh8iiw":{"text":"Stayed there in March. \nNo construction\nAir conditioning was excellent\nPlenty of hot water","useful":0,"cool":0},"YG-AMilxRul5-hWlo_NNjg":{"text":"My wife and I stayed here for our honeymoon.  The hotel has a lot of charm and is close to","useful":1,"cool":0},"1DiPDQCm2PYLiKo_8OGuFg":{"text":"Welcomed from the moment we drove up at 11:00 pm. \nFriendly staff, extremely kind front de","useful":3,"cool":0},"wSJzXp4f1URsZLHi-szKxg":{"text":"Read reviews and was a bit nervous about our decision. However, I have no idea what anyone","useful":1,"cool":0},"cT7y0HmQUHVjXkyv2GwMNQ":{"text":"I chose this hotel for my family's one night stay in New Orleans because of all the great ","useful":0,"cool":0},"cHQQOaSj-yALp_4A-BZg3A":{"text":"I stayed at the Q & C hotel while traveling for a work conference that was held at the Int","useful":1,"cool":0},"F9N83buuK09eAHXQtZepHQ":{"text":"Smaller boutique hotel which is part of the Marriott Autograph group of hotels.\n\nThe Q&C i","useful":0,"cool":0},"8CTqmM1URBQfsNG2n6_PQQ":{"text":"I have visited this hotel at least 3 times. Its in the middle of downtown and has a NOLA v","useful":0,"cool":0},"GjfD9mxLK2wp5O1fWdOhgg":{"text":"The staff were very nice at check-in, however, my room is tiny.  The closet door and bathr","useful":2,"cool":0},"xWhi0W20166YNRWW8voeQQ":{"text":"Q&C, I wanted to love you, but there was always something that expressed \"not meant to be.","useful":3,"cool":1},"weXfbniXiBqAvLhPr5gYIw":{"text":"I have mixed feelings on this hotel. I arrived and the receptionist didn't greet us well, ","useful":0,"cool":0},"4dgUl-DCuxYj8ZGs4kP5yQ":{"text":"Our entire experience with this hotel was incredible. I was hosting my sister's bacheloret","useful":1,"cool":0},"wIRjZhwzY-d53ZixLCL6nQ":{"text":"Unbelievable how unprepared this hotel is for business. It's the Sugar Bowl. Happens every","useful":1,"cool":0},"o-krYFVJTCel1TryFphX8Q":{"text":"Although my husband and I did not stay at the hotel, we did want to check it out. We asked","useful":0,"cool":0},"a2TQb1BZ0DFzoTJVbciX4Q":{"text":"I stayed here with some friends on a girls trip.  They had stayed here before and really l","useful":1,"cool":1},"vffaRSwW8GrJh00ggWGocQ":{"text":"I don't know what to think of this place. The remodel was done well in terms of workmanshi","useful":2,"cool":0},"jsuN1CPQYicCc0Kn2vim4g":{"text":"Stayed 1/16 - 1/17: Q&C is an amazing hotel and I would definitely return on my next stay.","useful":0,"cool":1},"mtnVHtxwmra1AvI8cxW8nA":{"text":"My partner was so generous to book us a wonderful NOLA trip for my birthday, and I'm so di","useful":6,"cool":0},"_fvQqXNLxJknb7DEw7KuPw":{"text":"Me and my girlfriend stayed here for a night in the city and loved the place. The food and","useful":0,"cool":0},"qx-mElAykNkh4JhOKwugyw":{"text":"The decor was nice, breakfast was good and the public spaces were laid out well. However, ","useful":1,"cool":0},"JmCn29iOYXo81fE--g_5Tw":{"text":"This hotel is amazing! The staff is the best!!! Shawan is most caring person I met in New ","useful":1,"cool":0},"NWkJmfr5HlHv49yeEUS08A":{"text":"Located walking distance to Bourbon, French Quarter and the WWII museum location is great.","useful":2,"cool":1},"eeok-7_HW8BdGKyNsWKliw":{"text":"This place was PERFECT for our trip to New Orleans. Rooms are a little on the small side, ","useful":2,"cool":1},"sLEdypKNKGctTLnngjPAzw":{"text":"Had a phenomenal experience here. The bed was so comfortable and the room was not large bu","useful":1,"cool":1},"YEG0G9iXWQrKRf8T8zkz3w":{"text":"Love this hotel! The front desk staff were so welcoming and caring- especially CHRIS!  Gre","useful":2,"cool":0},"NXrZeijuci_x9B8IsZWjVw":{"text":"I want to give this place a higher rating but, there was no hot water during my entire sta","useful":0,"cool":0},"ozjuqVCMzJ3FC-Dsg9AVZA":{"text":"GREAT HOTEL!!! We would literally come all the way back to NOLA to stay here. I LOVE that ","useful":5,"cool":1},"zr-NzF30_MZuyvKQHC0C9w":{"text":"My husband and I stayed at the Q&C from November 15-19. This may be a bold statement, but ","useful":3,"cool":2},"UrqIEWebo0z--PJBmn2cLw":{"text":"For my trip to New Orleans, I wanted a hotel that was close enough to the action of the Fr","useful":3,"cool":3},"M2hVpMk-37i0jjkJiyXuEQ":{"text":"We stayed her for my wife's (GF at the time) birthday. That happens to be over New Years. ","useful":1,"cool":1},"b885zR_XeFCg1K9ugprMAw":{"text":"Absolutely love this boutique hotel. Super cute and cozy. The staff was beyond helpful wit","useful":3,"cool":2},"evwFjKEDXLDUFuFkq87H6g":{"text":"We LOVE this hotel. I literally can't say enough good things about it. The ambiance, the s","useful":0,"cool":0},"e7SN5c6rBGbwVd8t90xxHg":{"text":"Avoid this hotel at all costs.\n\nThe rooms are very small. I was told I got an upgrade beca","useful":7,"cool":0},"tKlciE-Uk-AkQDKAJIOPYw":{"text":"The location is great. Close enough to the quarter you can walk everywhere and far enough ","useful":0,"cool":0},"0WHSSTljg2FINRB1YoB8LQ":{"text":"The hotel is cute and quaint, however the hotel is really small. I'd guess 10 rooms on a f","useful":0,"cool":0},"bMsRgvOsSQPUJXBy98mJ3Q":{"text":"Very solid 4-stars. We loved that it was located really close to the action (5-15 mins the","useful":0,"cool":0},"g_lDgrh76fs9LSQaR5jGdA":{"text":"My reservation was for 2 King rooms but I arrived very late on our first night so there we","useful":1,"cool":1},"dQMiNT3asJ2MxOdLx0t04g":{"text":"I enjoyed my stay at Q and C mostly because of the great location and insanely comfy bed! ","useful":3,"cool":0},"e3NBeRledDnaQLkmumvz1g":{"text":"Hotel was nice, staff were super friendly, helpful and accommodating. My only complaints a","useful":0,"cool":0},"8MGJAtZmhT5yMmcG_5mVQQ":{"text":"Q&C is a boutique hotel designed to evoke the New Orleans of years past, which sounded gre","useful":1,"cool":0},"NQE0wmVibKGqu8tq0z5Www":{"text":"Think Ace Hotel + Spitafield - pretentious & lofty price tag x a dab of Southern charm. \n\n","useful":7,"cool":1},"zNmiQ3e5VCmTmTjnXCNzWA":{"text":"Perfect place to stay in N.O. Close to everything. John is the best server, very engaging.","useful":0,"cool":0},"df7bZKwPR0oMeWDmDRHRAQ":{"text":"On the website, the extended King room has like beautiful exposed brick, and looks new and","useful":0,"cool":0},"BT7d7BsRCMIfH1k8bJFR-w":{"text":"So the good news is the hotel has a nice lobby bar and the staff is very professional and ","useful":0,"cool":0},"8a_HR-r-jTRWw4EU4c2UNw":{"text":"CUTE little hotel! It was like staying in a piece of history. Such a beautiful building, i","useful":1,"cool":2},"DRs7aVaXKCOeCE2EY3uz7w":{"text":"I fell in love with this hotel. It was not perfect, but was so vintage and classic NOLA th","useful":0,"cool":0},"onmIuSy7rCI3i_LSa2_BwQ":{"text":"Stayed here for Jazz Fest weekend 2015. Let me first say this hotel has renovated and is a","useful":0,"cool":0},"6VPBEdmEoBgjh95led8pVQ":{"text":"This hotel has a very fun vibe and trendy feel with a very lively but compact lobby.  What","useful":0,"cool":0},"HTlR__u7mJXvWw7TMAGpwg":{"text":"I stayed two nights at this hotel in New Orleans. First, I must state that the two stars g","useful":1,"cool":0},"7CTRnKIliguJEnmbG8kFHg":{"text":"Autograph hotels are know for their trendiness and themes. Personally, I've have found mos","useful":1,"cool":0},"ydiLkSqpEJtwmCiXeS78BQ":{"text":"This hotel is a great location and value when you consider its location to Bourbon Street!","useful":5,"cool":0},"OgR5dp36Ct9mznwp0YHNAg":{"text":"We had an awesome stay at the Q & C. In a town where the tourist vibe dominates this hotel","useful":0,"cool":0},"dxINZXG5-dKQMa15N2WxFw":{"text":"I travel to New Orleans frequently. I've tried the Ritz, the JW, and random other marriott","useful":2,"cool":0},"fMfbYYPPQbMvUN6m4T1GFw":{"text":"If you are looking for a cute looking hotel with poor service and issues... this is the pl","useful":5,"cool":1},"y99J_cTBy4WfPP8EfYwErQ":{"text":"Adorable hotel, the decorations are beautiful. The bed was comfortable with nice linens. L","useful":0,"cool":1},"N2rtc4R5w3B_BfuKUrFEnw":{"text":"I booked on Priceline for 1 night at $102. Although I had trouble finding the entrance, th","useful":0,"cool":0},"Lulswc8D4RQzQ-bhP6ZFSQ":{"text":"I could not be more happy with our stay! The staff was phenomenal, friendly and had wonder","useful":0,"cool":0},"YR70OY2XEENJzFVVfeawMg":{"text":"Beautiful property. Tiny rooms. The lobby is beautiful but the hotel sits a few blocks off","useful":0,"cool":0},"4q1S9KNNYCWCyiSABz3HJQ":{"text":"The room is quite nice and clean, and the bed is comfortable for me. And it's relatively q","useful":0,"cool":0},"fynubU2ZWTy0EUOYmIN1-A":{"text":"This place is rad. From the moment you walk in, everyone goes out of their way to make you","useful":0,"cool":0},"G3-mTJE2yiHeIfS4vJJcAQ":{"text":"I usually stay here when in Nawlins. I love the contemporary feel and the rooms. Beware th","useful":0,"cool":0},"NkQx1XClGPVSkaWDG38kGg":{"text":"This hotel itself was pretty quaint. The front desk staff and the the guys who help with l","useful":2,"cool":0},"cw8nxUkWZISTtpNx7Na4ug":{"text":"Stopped here for a beer one night and came back the next few nights. Bartender is wonderfu","useful":0,"cool":0},"K_Rv7PNhKpYnkDTniTKS8Q":{"text":"Very nice hotel. I really enjoy the old bricks and original structure incorporated into th","useful":0,"cool":0},"EX9YRya1vH4ek4ZRGoNhMQ":{"text":"Stayed for the first time recently and it will be our regular spot from now on when visiti","useful":0,"cool":0},"ghoL2Ex32Nb4F_99MoUOLQ":{"text":"I love staying at the Q&C. It's my go to hotel when in NOLA. I've been staying here for ye","useful":0,"cool":0},"jQVAjAPRO6irqK2enV7aMg":{"text":"Had a great stay. Loved our room.\nStaff were friendly. Comfortable room. Clean. Our room w","useful":0,"cool":0},"K7nGKJYSbCx8a9TxozYpFw":{"text":"Amazing historic hotel in a fantastic location.  Central to everything you must see in New","useful":1,"cool":0},"Fjj19ng_68-73nvfakAPEQ":{"text":"Very cute place to stay while in town. Historical area brings an authentic feel to the pla","useful":0,"cool":0},"IA7WEQPAsyQRxb31IbsuXw":{"text":"Yes, I know the past reviews are horrible, but I gotta admit they renovated the place quit","useful":3,"cool":0},"iAAtQi1gdWKOwGa3Uzhpaw":{"text":"Pretty great hotel, best I've ever stayed at. The staff isn't all obnoxious & in your face","useful":1,"cool":0},"yJWWM1cDtgjKOWvY7-3JkA":{"text":"This is a great boutique hipster hotel on the upper end of the hotel zone between Canal an","useful":8,"cool":4},"DAkvnji-yaEM1d87iasYQg":{"text":"I really like this hotel, for the price it's great and the location is close enough but no","useful":0,"cool":1},"3Z69UlGhxDO4zVofNiB2eA":{"text":"This hotel is in an old building office building  that was updated and made into a hotel. ","useful":1,"cool":0},"juFudbPpWCStsegLQyGmuw":{"text":"I always find home away from home in NoLa. It's right here at the Q&C. I love these people","useful":0,"cool":0},"lM5_TOW3QiAKlAph2NadRA":{"text":"After staying at another Autograph Collection Hotel in Chicago and loving it, I really wan","useful":3,"cool":2},"pc-5qvxze2G3QpX9HaMBxw":{"text":"This hotel has gone way downhill. Poor customer service. No housekeeping in spite of havin","useful":1,"cool":1},"37Ug4eKGgQp4ndlmVf_ctQ":{"text":"I used a group booking company for my wedding and chose this location. I am so thrilled th","useful":2,"cool":2},"6sI0JAWMkxYi6DyCu-Au8Q":{"text":"Love this gem in the central business district! Great 5 min walk to the French quarter wit","useful":0,"cool":0},"rIZkzK7hvzx8EWakyM29SA":{"text":"Friendly staff, clean hotel, cozy room a few blocks from bourbon street and other attracti","useful":3,"cool":2},"6ipv4PvwEyW8_KRvnbHEkA":{"text":"Great Location: 10-20 mins of walk from the French Quarter. 20 mins walk to WWII Museum. T","useful":0,"cool":0}}