{"SLkyYs58B7IWl6sSJdJ1LA":{"text":"The emperor has no clothes.  This is not a fancy restaurant.  It's basically upscale casua","useful":0,"cool":0},"7PUup9wkBhRgY3pFl1XPrg":{"text":"The reviews were good so we decided to check to check this place for lunch. We shared an o","useful":0,"cool":0},"nzJo9RO7uflAxTc7vjlf6A":{"text":"The sweet potato pecan pie is a must have! It comes with whip cream on the side.  The wait","useful":1,"cool":1},"sMVwY0ngzTF2eX_yYoViRQ":{"text":"This is my favorite restaurant in New Orleans! However, skip the over priced dinner and go","useful":1,"cool":2},"9Ewa9eiwr9qGNnCpsPSmLg":{"text":"We made reservations during restaurant week.  We were not given the restaurant week menu w","useful":0,"cool":0},"_IAv8nOoujyTr6bj91IfEA":{"text":"Fantastic, fantastic, fantastic. Cannot recommend a place higher. Wife got surf and turf, ","useful":0,"cool":0},"f1AQDR1o_6YTpwUQth9xmA":{"text":"Had Fried green tomatoe as appetizer. Main course jambalaya  with flounder and shrimp. Wif","useful":0,"cool":0},"MEXJYwQAXgm-ugkF2CMznw":{"text":"An eating tour of the French Quarter isn't complete without a stop at K-Paul's.  The food ","useful":0,"cool":0},"jUWD0LYpG-R4OaUq0ZR4-Q":{"text":"The staff was amazing from the host to waitress and all those along this culinary adventur","useful":0,"cool":0},"DtNAbAQMkeSsxIz0Cqstfw":{"text":"My review is for Sheila the waitress. Wow she is just terrific. She has been working there","useful":0,"cool":0},"OI8d2dyF4JAAc66psjMPHw":{"text":"Some of the best versions of classic New Orleans cooking that can be found.  Prudhomme him","useful":1,"cool":0},"hhTLvQ2SzF0-PvsQej2V7g":{"text":"Our waiter at K-Paul's was really great and made the dining experience really good. We had","useful":0,"cool":0},"83IgJZNcpJR9K_DsT3XLJA":{"text":"On December 27, 2013 I ate K Paul's, Chief Paul Prudhomme's restaurant in the French Quart","useful":3,"cool":0},"8s4hRQtinjikUitDd4dM2Q":{"text":"It was a toss up between K-Paul and Mr B's Bistro. K-Paul won on the sheer fact I saw soft","useful":3,"cool":1},"nYtPQk35h8Z8Y8px1vYk4A":{"text":"If I could give more than 5 stars, I would.  But that's all that yelp allows.\n\nLet me star","useful":1,"cool":0},"rLlXZZi2rUU253tzHTw9GQ":{"text":"I went to K-Paul's on a Tuesday and still faced a 45 min wait, so I was expecting somethin","useful":0,"cool":0},"r46ARFx4W0xUhOYCRb5JZQ":{"text":"I know there were lots of good reviews for this place, and we may have been there on an of","useful":3,"cool":2},"rtf9lOVEHHxnWHfuX8WzXQ":{"text":"Start to finish is a delight on the taste buds. Classy, great service, I recommend eating ","useful":0,"cool":0},"J7S5wRz_OEsvuZknccvnbg":{"text":"Very disappointed\nCame for lunch as dinner is near impossible to get into, besides it bein","useful":0,"cool":0},"9QOK4mGwmyG234UdbVEXXA":{"text":"The best meal I had in New Orleans! \nWe came here for dinner on our wedding anniversary tr","useful":0,"cool":0},"yrwDnsEno_PuMRU9pS9CLw":{"text":"who doesn't love paul?  nobody i want to be pals with, that's for sure.\n\ni've only been to","useful":0,"cool":1},"sGiSAbA9BSDWhO-klR6DiA":{"text":"The beef medallions in debris sauce is absolutely amazing!!!!  Great ambiance and would be","useful":0,"cool":0},"WZVsL4VvZctKX5a4b41W5w":{"text":"A-OK.  I wish I could say it was better.  Being in New Orleans, we thought it best to eat ","useful":0,"cool":0},"F9QqHebSa0RZ3s6krpLT-Q":{"text":"Great food and service !!! My husband and I were indecisive about what to order and Sheila","useful":0,"cool":2},"ItTVClaHwhZLrp49gyNXTQ":{"text":"Okay, I hate to not give K-Paul's a five star rating, but I've been there twice now and th","useful":1,"cool":1},"ZJzPwXpwFst3a0AKAkMY1Q":{"text":"My first meal in New Orleans, and it was great and very filling.\n\nAfter a ten hour flight ","useful":1,"cool":1},"7LB99h9KmZcg9QLk-ymwKg":{"text":"Frog legs, jambalaya, grilled ribeye with brown butter... all amazing. Friendly staff. Fun","useful":0,"cool":0},"830-XPiA3B-9LL6SQozcsg":{"text":"I love this place! I have to take a trip to K-Paul whenever I am in New Orleans. The food,","useful":0,"cool":0},"335-VU_6RRMcHfUS8ZSIvg":{"text":"Absolutely outstanding! Went here two nights in a row because the food was SO delicious. T","useful":0,"cool":0},"dJmS4tb3rCL98KIbe6Ajvw":{"text":"Yum! Loved this place when we went the last time we visited New Orleans. The bread basket ","useful":1,"cool":0},"0lZvyL_isLWbvzxx4J6FUQ":{"text":"Dined here for the third time last night. Recommend to call for a reservation as even on a","useful":0,"cool":0},"17QnVW_R9Y-dLw-4Y-Ekxg":{"text":"Whenever I've visited New Orleans over the last 20 years I've had dinner at K-Paul's and e","useful":0,"cool":0},"stv8sNggvF4ARCaUjkocGg":{"text":"We got here without a reservation. The wait was only about 15 minutes, so not bad at all. ","useful":0,"cool":0},"7rBWmS4qPBuUIflekLEI2A":{"text":"On our first night in town, the group I was traveling with was at our hotel bar and the ba","useful":0,"cool":0},"u_vuSmc6mCIEjvnczm8LXw":{"text":"The food melted in my mouth.  The sauces exploded with every bite. Both the blackened fish","useful":1,"cool":0},"D5t9xDtbdCcIW2b3eQ5T8w":{"text":"Really really awesome meal ! We had gumbo, spinach salad (dressing was so good), duck,ando","useful":0,"cool":0},"8oFLda4D2fjf3UXegGw0sQ":{"text":"Our meal was EXCELLENT!.....the best we've had in New Orleans!  Rachel was our waitress.  ","useful":0,"cool":0},"hPS21waAdYznKumHRJiZzg":{"text":"We came here for lunch on a locals recommendation. We've been waiting for 30 minutes for t","useful":1,"cool":0},"iofObFUOoY5gR_qoaMuHGA":{"text":"Three stars is not damning.  It means \"A-OK\", which is A-OK.  And this place is A-OK. \n\nTh","useful":1,"cool":1},"18q7fktRYh2RRo_RNwTsvQ":{"text":"My wife and I stopped here for the deli style lunch before heading over to the WWII museum","useful":3,"cool":0},"4NlacEXcI_JKnqckfvKCvQ":{"text":"Cute place. Food was yummy. Fun decor (paintings of animals with the recipies... Of how th","useful":1,"cool":0},"mJ48j-9OWZeg6c0ldXe9rA":{"text":"Dinner was amazing. Melissa our waitress was fabulous. The only down side was the lady at ","useful":0,"cool":0},"B59suknv9WHDKfLHE60Vvg":{"text":"Wow!!! One of the best meals I've ever had. The sausage and fried green tomato appetizer w","useful":0,"cool":0},"55NS4W9mGRbab6KcgyfZHA":{"text":"My husband and I decided to go here for dinner after walking by one afternoon. I made a ca","useful":0,"cool":0},"Rf3B5lVk8AGLX8N3F1gnpw":{"text":"Service was great, very professional yet lots of fun, not uptight and stiff.  The basket o","useful":0,"cool":0},"9ZF4pNy4Ya-JdQLMsfZLYQ":{"text":"I have eaten some truly memorable and outstanding meals here. The restaurant is deceptive,","useful":3,"cool":2},"w_grUowIdTPj4ieSSRhjIg":{"text":"We got in without reservation, but it'll be good to call ahead. Our Uber driver had nothin","useful":0,"cool":0},"Y95HdBbDptoVxOwsNMpobQ":{"text":"This was hands down the best meal I have EVER had. Even the bread basket was divine. Carro","useful":0,"cool":0},"L3Mx93dqDRJxbTlj-VQcWg":{"text":"Had the most amazing meals in New Orleans we saved this for our last vacation meal. It was","useful":0,"cool":0},"QmndzoFjjgTcExYt4dINag":{"text":"K-Paul's is a must in new orleans.  i had been before but had to take my lady cuz she had ","useful":1,"cool":0},"1a7V4DQ674js5yPJCfEecQ":{"text":"Rather disappointing. Food was a step above good but nothing special. Will not eat here ag","useful":0,"cool":0},"8e3uzi8RIJrtYDCqBgfKqw":{"text":"We've been going to New Orleans 2-3 times a year for the past 7 years, and discovered K-Pa","useful":0,"cool":1},"iMOZeXrzRDYriCbFmlmm9w":{"text":"deeeeellliiiish!!!\n\nit was our first night in town and we wanted to start w a good meal. b","useful":1,"cool":0},"TnoSG_UHttpXw4RmAHT3KQ":{"text":"Maybe one of my top meals in Nola. Even the bread basket alone was to die for! I got the J","useful":0,"cool":0},"GEWLq0U7QZmNnPsuiYH3CQ":{"text":"Can I just say how grateful I am that I scheduled this dinner reservation as my last meal ","useful":2,"cool":2},"DGUNdlBMjTE6Y-1PZNx2MA":{"text":"Came here as highly recommended. Glad I ate here. Ordered a bunch of different foods with ","useful":0,"cool":0},"8Kr5BfQLHr9nJOgKmTWwJg":{"text":"I really enjoyed my meal at K-Paul's.  The service was excellent, the ambiance was wonderf","useful":1,"cool":1},"Qq1rfUwXLnRoKOjanzEG-g":{"text":"My husband a and I have just returned from having a wonderful dinner at K -Paul's Kitchen.","useful":0,"cool":0},"mWhNnqZlDBiAcOSUMr0QsA":{"text":"Let's hope my girlfriend forgives me for ruining her 30th birthday. Pretty bad dining expe","useful":3,"cool":0},"riKC8cdWzgJRI5fPOffZ9g":{"text":"The history behind K Pauls is fascinating: Chef Paul Prudhomme is a legend in Louisiana, H","useful":0,"cool":0},"XqcnZhMQFUcWUPrpcVeqcw":{"text":"This place is great. My date and I had ourselves some fried green tomatos to start off and","useful":0,"cool":0},"g_glCrVRmqQRUeGZA95Vow":{"text":"I just can't say enough about K-Paul's and how they made an evening with my family, truly ","useful":0,"cool":1},"Rx7OamEplH-lTZwm5TDQgw":{"text":"My dad came to K-Paul's 25 years ago while passing through(having bought a cookbook and fa","useful":0,"cool":0},"aeI2UAVYFQIzQ69JkisExA":{"text":"What can be said? This is an iconic establishment in New Orleans French Quarter with argua","useful":1,"cool":0},"K-wT3oXROucNyH98KmkkEQ":{"text":"This may be the best meal in New Orleans.  Wonderfully prepared meals,  fresh cuisine and ","useful":1,"cool":0},"YNHRTZSdTNGrVrNVNinzKA":{"text":"Came here for lunch twice in a row for the BBQ Shrimp & Grits with Potato Skins. Once of t","useful":0,"cool":0},"3-leDY0BXfh6AY1Mvd0mNg":{"text":"Probably the best meal I have had in NOLA. Fried green tomatoes are insanely good. The bla","useful":0,"cool":0},"-B838QC3Yu6bTI_gcqVB4Q":{"text":"A-M-A-Z-I-N-G!! Our favorite restaurant and a must stop for dinner when in NOLA. The food ","useful":0,"cool":0},"22fXaSR0gyGsonFpgh5z3g":{"text":"What a disappointment!!!! Years ago, when we traveled back and forth to NOLA for vacations","useful":1,"cool":0},"_LhdLLKVKDSLfvSPyeytFg":{"text":"Very disappointing. We made reservations since we weren't able to get in last year when we","useful":0,"cool":0},"gwKpX97ug9tjZ0joiPazYQ":{"text":"Stay clear of apathetic management and angry to be a server (Patricia). Requested front of","useful":0,"cool":0},"bxU3xKzmmHGsFg1BfkMhHA":{"text":"Nice french quarter restaurant. I loved that the kitchen is open, so guests can see what i","useful":0,"cool":0},"s_xjCbvl8kK7s7ay6zQgYQ":{"text":"Always happy here. A neat atmosphere of home cooking and white table cloth. This is Cajun.","useful":0,"cool":0},"VZy6qXtvf_go-cSFsJqmXQ":{"text":"I have never had a bad meal at K-Paul's and I eat there 4 to 6 times a year.  Tonight must","useful":0,"cool":0},"50PtxklH3bfX80BCBLNh8A":{"text":"My all time favorite restaurant in New Orleans. I have never had a bad meal here. I have s","useful":1,"cool":0},"Vly1bIDGxq4ipASqvaHdEA":{"text":"Wow this place rocks. Had the blackened Drum fish. It was moist and tasty not over seasone","useful":0,"cool":0},"XIazxQdyL1EMSFXbVGW8Zw":{"text":"Awful! This place has gone waaay downhill. Don't waste your time or money here! Got a huge","useful":2,"cool":1},"wFmmD7TqGofLZguLZ0fY9w":{"text":"This is one of the must go to restaurants in NOLA for me.  Paul Prudhomme is/was NOLA food","useful":0,"cool":0},"fhn1Hk-kPHRvF9oxBI9hDg":{"text":"I have been going to K-Pauls for over 30 years now. For many years, it was truly a delight","useful":0,"cool":0},"ME3hBRhruZvpQv_z15TT4w":{"text":"Even though this is a well known chef, the food wasn't outstanding. The waitress talked so","useful":0,"cool":0},"Q3JP_juE4XcARY2bLu8k-g":{"text":"Had a good meal but than at the end I gave her my debit card and realized I made a mistake","useful":0,"cool":0},"akkl3KGshtYvg8AYFI7n3w":{"text":"There are so many places to eat in New Orleans\nMade the mistake of coming to K Paul's\nArri","useful":1,"cool":0},"3FfzOC7fIsEImSfwg35ZHg":{"text":"K-Paul's was a culinary experience! The food was incredible. The blackened twin filet with","useful":3,"cool":2},"CnTPaUSWhb2Y4-BY20TW1g":{"text":"Spectacular restaurant and fantastic personal!!!\n\nWe had four different meals and everyone","useful":0,"cool":0},"j4cuyxYVoiggkXu6Fg_fKg":{"text":"Walked over here last night after cocktail hour at a conference I am attending. When I got","useful":0,"cool":0},"ttjHa0Z3nVerPXmvFRNExQ":{"text":"Loved their food the most during my stay at NOLA. blackened fish, shrimp remoulade, creme ","useful":0,"cool":0},"Ro9CKEqayInpvV1TvscbRA":{"text":"It's certainly not haute cuisine but they do a pretty good job of making traditional food ","useful":0,"cool":0},"Wavr39LLz2xh14j1t4CNMQ":{"text":"My husband and I ate dinner at the bar.   We felt kinda awkward b/c we were wearing our to","useful":0,"cool":0},"yc8T0TpZGngotYkx_JwoWA":{"text":"K-Paul's Louisiana Kitchen has been a staple in New Orleans cuisine for such a long time t","useful":1,"cool":1},"5xF-ItyuwqViVJXyXJmddA":{"text":"Fabulous meal and very reasonably priced considering the outstanding quality of the cuisin","useful":0,"cool":0},"wcZpZ7VnXRB6qhpH3qAIYA":{"text":"I went there with Katie O. and back everything she wrote in her extensive review.  The foo","useful":0,"cool":0},"RENUqMOgWhfLTmxnV_zcDw":{"text":"After debating with myself about whether to have a steak at Ruth Chris Steakhouse or K-Pau","useful":0,"cool":0},"a2Oa7jcZP9onwC6yxzfQbg":{"text":"Wow,  such a fantastic place. Some of the best food I've ever had.  Both my wife and I had","useful":0,"cool":0},"H_FJKoiyI0Ar7v0xb6NY1w":{"text":"Came here for a bachelor's party. The decor and atmosphere was excellent for a classy and ","useful":0,"cool":0},"WNDYsaqlp0MbYa6Y6RckEQ":{"text":"Wow, best lunch that we have every had in New Orleans. My husband and I shared the shrimp ","useful":0,"cool":0},"Xbqpit3S54HIFY7j3zKaZA":{"text":"The food and service here is excellent.  Our experience at this restaurant has left us wan","useful":1,"cool":1},"596WQkQ-5rXxrlxYQsY1-w":{"text":"K-Paul's....smack- dab in the middle of the historic French Quarter in N.O. ........Chef P","useful":1,"cool":1},"8_nlzEa-r9ksH7R8d9i3vQ":{"text":"If you are a visitor you would love this place.  Chef Paul created the blackened dishes.  ","useful":1,"cool":0},"Yuzq04IxHbeN9a8R2QW3KA":{"text":"My husband and I had dinner here on a recent Monday on the tail end of a trip to NOLA. We ","useful":0,"cool":0},"gsyTOH1pZgxaAvCiPIFNsg":{"text":"The ceilings are too low, the waitstaff too not-spectacular, and the wine too merely accep","useful":0,"cool":1},"Kbapw1PlciS97qdfC-Q4Kw":{"text":"I just returned to K-Paul's after visiting it several times pre-Katrina.  The good news is","useful":1,"cool":0},"snzo0eoCk20_DWXvVkf9ug":{"text":"Absolutely love their deli-style lunch! This is my go-to place to take visitors for a po-b","useful":2,"cool":1},"EDo_zEq73WtFjBhUPZZ57Q":{"text":"Went for the first time to celebrate a birthday.  The food was delicious, and like other r","useful":0,"cool":0},"jPd5ZdhcfbEsozeqmFW1Xg":{"text":"Our last night in New Orleans we managed to get an early reservation to K-Paul's. So happy","useful":2,"cool":0},"rsr074B1pNCk18WC5YWPAQ":{"text":"A must do when in NOLA.  Went there for the second time last night and wondered why I wait","useful":1,"cool":0},"Gq9F_ETQYlL0wRV95AZABQ":{"text":"fantastic atmosphere, loved the art on the walls, and the food was served hot and tasted d","useful":0,"cool":0},"h68vOvwU4ogb3rajl9rDag":{"text":"My first time dining in New Orleans and from talking to people, I expected exceptional foo","useful":0,"cool":0},"p3iWDQ9fRRfwH3DCKytCyg":{"text":"Excellent restaurant and food choices and tastefulness. Service a bit slow but understood ","useful":0,"cool":0},"1vFKJSVNiHGq332AIIfBaQ":{"text":"Food - The Duck and Shrimp Dulac was a very nice dish. I'm not too familiar with Louisiana","useful":0,"cool":0},"pbRSi8Wgh1oViH5lEG4KZA":{"text":"Food was hearty and delicious. All of the typical dishes had a twist that made them so spe","useful":0,"cool":0},"MfZCYi-l6US-g7POH7rp5Q":{"text":"Loved this place so much my boyfriend and I came two times. We had the best service. Our w","useful":0,"cool":0},"1FQped_lGkH_oGkeSDKIMA":{"text":"We have dined at K-Paul's three times since December. Every visit has been absolutely wond","useful":0,"cool":0},"GR2E8AOeaAbbpazXg93ctA":{"text":"I don't know what dizzy tourists leave 4-5 stars for a restaurant serving on plastic silve","useful":0,"cool":0},"pU9EnLPuw06_FSGSc5RCFQ":{"text":"Dinner was amazing and I just had appetizers! But what was even more unique and special wa","useful":0,"cool":0},"L8u7fkZusb2A0hITHJn3FA":{"text":"We had an awesome lunch here on a Saturday afternoon. Got there at just the right time as ","useful":0,"cool":0},"D0qwMxJcqVt60mh4synJeQ":{"text":"Many highlights to our four night stay in New Orleans but this was the best restaurant exp","useful":0,"cool":0},"Ti2RpxhgP22UAQwIaUR7kA":{"text":"Blackened Stuffed Pork Chop Marchand de Vin or Blackened Twin Beef Tenders with Debris?\n\nG","useful":1,"cool":0},"DtbBfnUEeOEiuGwu34rRLQ":{"text":"Had lunch here twice while in New Orleans.  Was my favorite meal while I was there. Had th","useful":0,"cool":0},"lBTijLb595Z8azFoG3ve6w":{"text":"Excellent food but very pricey.  I was with a group of 10 and we did have a reservation.  ","useful":1,"cool":0},"LNRENgZ6DHadvpHvdoY4Sg":{"text":"My husband and I have walked past K Paul's at least 100 times on our many trips to Nola. I","useful":0,"cool":0},"XyGX08ItpAiLKnmFQWOmPQ":{"text":"The stuffed pork chop was excellent and service just as good. All the food was good, defin","useful":0,"cool":0},"H-G3Bzr0UcS3xUbZWk8epQ":{"text":"Great atmosphere!  Tried some of everything...gumbo was rich and full of flavor. Shrimp en","useful":2,"cool":1},"gFUpBDqLjSjvgbBtEgAj-A":{"text":"Terrible. Way over priced. Paper plates. Plastic utensils.  Place your own order at a bar ","useful":0,"cool":0},"aJeHetQn5DJ3ispH7dYk1g":{"text":"Was not impressed.  I had high expectations.  I enjoyed the fried green tomatoes.  Frog le","useful":0,"cool":0},"GH6GoYLQJNuvMhyW6_H7yQ":{"text":"Very authentic Louisiana kitchen. I love the hint of spice in the dishes. Shout out to our","useful":0,"cool":0},"z2YPLDDQsxHdMVq6o4uLfg":{"text":"Ok dinner was an entirely different affair (see my lunch review below)! Dinner at K-Pauls ","useful":0,"cool":0},"zxOm-A2x90l8GduvOUVQ_g":{"text":"This was some of the best food I had ever had. Like seriously, I might put this in my abou","useful":0,"cool":0},"Uj9dkBX7fUf88ccbrrzBEw":{"text":"I first went to this restaurant soon after they opened in the 80's. The fabulous, creative","useful":2,"cool":0},"4w4zNrdO6BK-Qh3P-mVszw":{"text":"We went there to celebrate my birthday.  Waiter and food great.  It was a rainy night and ","useful":0,"cool":0},"GMEfYMLK7CkT5g7gWyYLfA":{"text":"First time in New Orleans and first place we ate at shortly after our arrival.  Do not be ","useful":1,"cool":1},"OFD7hmH8jBoeoP-HEG66Pw":{"text":"Fried oysters for appetizer was decent.  Came with complementary basket with an assortment","useful":0,"cool":0},"Y5V2klO5qnScFW6vCW1p6Q":{"text":"We took a wild chance to visit K-Paul's on a Saturday night without a reservation. To our ","useful":0,"cool":0},"snTeJJWC0BmmdJyW2cPx3A":{"text":"Hands down our favorite restaurant in New Orleans. We first ate here back in 2002 and have","useful":0,"cool":0},"ap-mPBWdHa3y7oM_aaackQ":{"text":"Given the length of time that this reataurant has been in existence, and given its renown,","useful":1,"cool":0},"WoXdsD_3MNDwd6YAB6CRfA":{"text":"There's nothing I can say except -- amazing!  5-stars in every category.  Don't miss the f","useful":0,"cool":0},"8rnW_go_wH1AijRU9xJKfg":{"text":"Great place to dine. The entree prices are a bit high at $29-34, but the portions are gene","useful":0,"cool":0},"f__lyur3lFXDN7b7_b5RRg":{"text":"Went tonight after sampling Emeril and Besh, thinking I'd not like Prudhomme at all, and t","useful":1,"cool":0},"QGwP46GVMkrD4KXvDbztjQ":{"text":"Every time I meet my parents in New Orleans, they want to eat at K Paul's LA Kitchen. The ","useful":2,"cool":0},"wcClYIGriERKsj-6FYvWbg":{"text":"Delicious food, great atmosphere and attentive waitstaff. We ordered the deep fried crab f","useful":0,"cool":0},"ZAgCUZEoqT1xn2X6mM63Rg":{"text":"We were walk-ins and they seated us quite promptly. Servers was helpful. Food was outstand","useful":0,"cool":0},"bymSwr_dZfPArfsbuREnTw":{"text":"Good food in a crowded and loud environment.  Long lines waiting to get inside, perhaps in","useful":0,"cool":0},"b1JLCQYXGTYr1zpIlLHmsw":{"text":"Gumbo 7/10. Very chunky with sausage and chicken. A little on the salty side. In fact a lo","useful":0,"cool":0},"7nUVyk-z6BdhAZsPnbWrxg":{"text":"Recommended by many when we asked about places to dine in new orleans.  K-Pauls has a full","useful":3,"cool":3},"h6YKNUEIU1Kxp4P1FyOdpg":{"text":"K-Paul invented blackened fish, and if you are in New Orleans you really should have at le","useful":0,"cool":0},"Wk3Kve2shqtuLNGQpKn2jg":{"text":"i wanted to have one good, fancy, sit-down meal before I left the Big Eaty, I mean Easy.  ","useful":0,"cool":0},"6sJ3UJRACrd16QFouotx7w":{"text":"Fantastic, I have been here three times and it never disappoints.  Be sure to have the fri","useful":0,"cool":0},"Ic1QlJMjx7mNTcxwhDTFcA":{"text":"DO NOT ENTER for lunch.  This is basically cafeteria food that is just average.... all the","useful":1,"cool":0},"HN0qNi7eaab8f4jF5A92kg":{"text":"Went to K Paul's for our anniversary and really enjoyed the food and service, both were ex","useful":0,"cool":1},"GjIoCnvO2m-D0xGKXV-fUQ":{"text":"This is my favorite restaurant in New Orleans. I am a huge Paul  Prudehomme fan, and think","useful":0,"cool":0},"zO3ZtNFamhpSidluKe4b2A":{"text":"Delicious food and perfect service. Best meals from Louisiana we have eaten.\nTry the Crawf","useful":0,"cool":0},"SBQALeS_9Vset-aL-sUh6A":{"text":"I've been here twice.  Once was amazing.  The other time was one of the worst dining exper","useful":0,"cool":0},"GRF_3W0JVutATiF9jM7msg":{"text":"The staff managed to squeeze us in on a Saturday night and although the staff wasn't spect","useful":0,"cool":0},"lUYLHxJubm2JyBl3INcrgg":{"text":"Not very impressed.  The entree was decent but the accompanying vegetables were awful.  Th","useful":0,"cool":0},"BckJ0Dd_SkUGgiUxtXYCzw":{"text":"My husband and I went for our anniversary dinner and although it was pricey it was worth e","useful":0,"cool":0},"kb8JH5nGqQhOjAx6mSncIQ":{"text":"Awesome dinner!  I had the shrimp and corn Maque Choux, loved it, and my friend had the gu","useful":0,"cool":0},"SZL9j7r_T1PTIug8LFqrVQ":{"text":"K-Paul's was lovely like before.  This time, I had a mixed drink that in retrospect, I was","useful":0,"cool":0},"N9NiZ5OlKe8Ybc0Kq8JDMg":{"text":"Nice looking restaurant with fairly friendly staff, but not as warm as all the other venue","useful":0,"cool":1},"MJmS6DJ1VlGaJUMOsZIVyA":{"text":"FOOD & SERVICE: \n\nI was so so so sooooo excited to come and eat at K-Paul. My party of 11 ","useful":0,"cool":0},"8oXbSq9gjl3lNWPolGj4Vw":{"text":"I wish I could come back and listen to Louisianans say \"etoufee\" over and over again. And ","useful":2,"cool":2},"swnVlnOsugpop4wqIGTiUQ":{"text":"Love this place. Golden Chicken Breast with Shrimp pasta was Awesome","useful":0,"cool":0},"e0fYxx9xglNufGOtqbiYhA":{"text":"First time here ... Came here because seven people wanted seven different types of food.  ","useful":2,"cool":1},"WV4o5rFQccLJbkEKOx-Ciw":{"text":"We were looking for a tasty, local meal to take out of town company visiting the French Qu","useful":0,"cool":0},"ddrWwwPJ1cFVyg4gYH90lQ":{"text":"This was the best.  A family friend gave us a recommendation to come here and he was right","useful":0,"cool":0},"fxS7RhzaTRBHJ4OjhtjleQ":{"text":"Ate the duck, veal, andouille and shrimp St. Rose. It may have been the best meal I've eve","useful":2,"cool":2},"wTRx_5jItZBeMmQgA27zZA":{"text":"Three of your employees were just smoking pot across the street from Naplolen House by the","useful":1,"cool":0},"MwoyMvu3DpsGXs5t5ChreA":{"text":"I ordered a duck and shrimp based dish.  The duck was overcooked though they did not ask m","useful":0,"cool":0},"r9PZwD9cWg_Pui6pxNonGg":{"text":"We spent the weekend in New Orleans and made it our goal to try as many Po' Boys and Bread","useful":2,"cool":1},"eBqWB8d67feHTOHMCfa1fw":{"text":"Only had 2 nights in NOLA and chose our dinner reservations carefully. K-Paul did not disa","useful":3,"cool":1},"POUv5Ng87KJEr5aUPGMGqw":{"text":"When we are in Nola, our trip is not complete without a meal here. Everything you order wi","useful":0,"cool":0},"WY83Ck8hExcmJiDp2bRveQ":{"text":"My husband and I ate here over 20 years ago when you had to wait in line, had community se","useful":0,"cool":0},"6lwWeffkd32H1JPDpTGzVQ":{"text":"Excellent hospitality! Portions were humongous, absolutely amazing. We were able to take a","useful":0,"cool":0},"rNY_NKGbsUskMBNuMBK03Q":{"text":"A restaurant is for feeding (that's the first star).  A revered, top level (pricey) restau","useful":0,"cool":0},"z1EZWuyZp_g2FDYf9f02DA":{"text":"My company held their xmas party here and it was really good. We had a nice sized party ro","useful":1,"cool":1},"DaKASMzL42WuYYjNqkSxpQ":{"text":"Monday 7-14-14 a group of 30 of us went to K Paul's for dinner...\nbeing we had reservation","useful":0,"cool":0},"lG6mNOrufgRZPUJMpDO8kQ":{"text":"Our second trip to K-Pauls.  Getting in was tough even with a weeks notice.  Had a late di","useful":0,"cool":0},"4NMLKd7V9MPykPiG530Oqw":{"text":"Amazing, amazing, amazing. One of the top 3 meals of my life! Thank you K-Paul! \nThe bread","useful":1,"cool":1},"OoPSBeArqX-Ed2FEMuTOmw":{"text":"3.5 stars probably the right rating.  Really hyped up and expensive.  Food is decent to go","useful":0,"cool":0},"UGJiVwhc0ABM3qAqWOVbfQ":{"text":"We thoroughly enjoyed our even at K-Paul's.  Our server, Mary, was pleasant helpful and en","useful":0,"cool":0},"eBbcjwZQcyMYedwvS7Wd4A":{"text":"K-Paul's is an absolutely outstanding restaurant that isn't completely off the beaten path","useful":0,"cool":0},"VIYLwd5lHb9A0IrwTVj9mg":{"text":"The food here offers less of a value preposition than many other restaurants at New Orlean","useful":3,"cool":2},"zfVFn1TnWaEAHCoG54xzig":{"text":"My husband and I were vacationing in New Orleans and had to try some top rated Cajun resta","useful":0,"cool":0},"tzqdoYvK96cx6ruJNEVPoQ":{"text":"This was my second visit to K-Paul's and I'll be back someday again.  We were lucky and ab","useful":0,"cool":0},"5UIhjom5pZCW3MJ2TEu0zw":{"text":"I have to say this was my other favorite meal from my trip.  We made reservations for dinn","useful":4,"cool":3},"iBLaxLXIDreRguqdr2UaRA":{"text":"K Paul's has been on my radar for years and finally went last night. A big fan of the foun","useful":0,"cool":0},"R0-r1ZQTZsMydtcZktKXTw":{"text":"Amazing food! The service was excellent, they took really good care of us and although the","useful":0,"cool":0},"rkwPWizOaSkgtgYSL6tbpw":{"text":"We have tried a lot of different restaurants New Orleans and there are a lot of good resta","useful":0,"cool":0},"vx6f-xe5R5GnJ2DdNxSxYA":{"text":"I came here this last Monday with my mom. It was our first time in New Orleans and we hear","useful":2,"cool":0},"QhdBSlIT1DICVig4jedOlw":{"text":"Solid restaurant. House salad with Bleu cheese dressing was excellent. Whiskey sour had re","useful":0,"cool":0},"6dQGM2PeKQ4E4dnvo24f4g":{"text":"Fabulous Red Beans and Rice with sweet potato fries. Shrimp po boy and onion rings was equ","useful":0,"cool":0},"e-zyRyGuFXVd9FXzI0DlEQ":{"text":"We came to eat here for the first time on Friday, and we're so blown away by the delicious","useful":0,"cool":0},"fViIfcPyItX8rOVo5Wc2wQ":{"text":"My dining experience at Chef Paul Prudhomme's restaurant was the absolute culinary highlig","useful":0,"cool":1},"y1LttkmfTCdTuS0hwfhJYg":{"text":"great but heavy. avoid if you are trying to watch your weight or blood pressure or salt in","useful":0,"cool":0},"lFP8H0Wym-NWZEq1nTYU-A":{"text":"So when you start out by meeting legendary Chef Paul on the way into his restaurant you ar","useful":1,"cool":2},"_7LYpGGtSBq0ajjd3bG8IQ":{"text":"K-Paul's was our first meal during our trip to New Orleans.  The only reason this spot was","useful":0,"cool":0},"XrEORUnTVjlmXpktyeKpZg":{"text":"Good atmosphere. Good bread basket. Great pasta served with the rabbit (which was fair). A","useful":0,"cool":0},"rzqo2Qsfkcvy_HgpHAK_iA":{"text":"They didn't know who they were dealing with\nWhat a sham organization, catering to the tour","useful":0,"cool":0},"DElFKc8jIT3DmjmdU_iCQw":{"text":"Yum! The jalapeño bread is to die for. The best gumbo I have ever had and I'm from LA. Fro","useful":0,"cool":0},"fXmSrs-2CQdPQrUqmasxyg":{"text":"My absolute favorite gumbo.  Everything on the menu is full of flavor.    Was easy to get ","useful":0,"cool":0},"COsJDV0v3-CSb5me3CyV8A":{"text":"We had a group meal and everything was great stuff Porkchop is amazing very good I would r","useful":0,"cool":0},"a1A73WE8WfURe2igHJrvTA":{"text":"Food was tired, the presentation lazy, and the service blasé. So sad to see a legend go do","useful":0,"cool":0},"pVAf9cMpcEniAUB09x3gSg":{"text":"Best meal we had in NOLA and we ate for 6 days! For appetizer I ordered crayfish stuffed a","useful":0,"cool":0},"eAtKBj41UTsl3bf2NDC4pQ":{"text":"Absolutely the best restaurant in New Orleans! I highly recommend it! Had the turtle soup,","useful":0,"cool":0},"h99ftthaRI4xpeOU1ugoHg":{"text":"K Paul's is never a disappointment! The menu is updated daily to include the freshest ingr","useful":1,"cool":1},"bn7Ijs8aws3vEDLof_YLZg":{"text":"They made us a fried tomato po boy since we're vegetarian! They were very accommodating an","useful":0,"cool":0},"-yJ2m9XbtwR3jVxFxo6SZw":{"text":"It was OK.  I expected better actually.  Really nice atmosphere, great service.  But the f","useful":0,"cool":0},"Gbt-fcqRWjSTQmmBZqKaGg":{"text":"Extremely poor service! No smiles! Be careful with the blackened stuff (if you have not tr","useful":0,"cool":0},"Ncel8zN19gpbkadY1cm45Q":{"text":"I was sitting at the bar on the second floor. Really neat, nice athmosphere. Food was more","useful":0,"cool":0},"jo1yr-l5ZxR_Gv0Lgprvrg":{"text":"Gluten free food. Loved this place. Food and service was outstanding. Its a must when in N","useful":0,"cool":0},"oFT3zxVWWiwgwNFSrCcUEg":{"text":"We sampled at the small bar on the first floor and we enjoyed 2 appetixzers......The Fried","useful":0,"cool":0},"Id2L7_9V4OCDxnlK-W5vqQ":{"text":"As a native New Orleanian quite honestly I was shocked at how outstanding the food and ser","useful":2,"cool":0},"kT4mx8lOOFbv2djSX-EBSQ":{"text":"MMM...to the warm basket of assorted homemade bread that they gave us when we sat down.  \n","useful":2,"cool":1},"Eb7D-3un8tcf6U0wKh1H-A":{"text":"Another fabulous meal in NOLA. My wife and I split the fried oysters. She had the fried ch","useful":0,"cool":0},"32ekvf8z7uM8yzjPh9a9pw":{"text":"Terrible. I used to love this place. But after two bad experiences in a row, it's safe to ","useful":2,"cool":0},"n2jj0VuQbDro5rBEykOQgg":{"text":"Good service, really good food.  Menu changes everyday.  I had the drum (fish) and it was ","useful":0,"cool":0},"8myap7mVNDhTqqy3TsDTuA":{"text":"My fiancé and I came here for lunch while in New Orleans. Walking in we really didn't expe","useful":0,"cool":0},"22EkQ438LLC8flM24Z_JXw":{"text":"Might very well be the best meal I have ever had.  The breads and food were amazing. We or","useful":0,"cool":0},"amqjjLRV4mqrrS4HHXQJdg":{"text":"What can be said that hasn't already been.. a dining experience like no other! A monument ","useful":0,"cool":0},"vfW0jWAjqJ9S3KGHk4OuIA":{"text":"Do NOT come here. Lunch is served deli style, very limited menu. Everything is served with","useful":0,"cool":0},"WFDNHuHh8vR3rvEmsGaL6g":{"text":"This is fine dining at its best.  Everything my entire group had was amazing - I was espec","useful":0,"cool":0},"9uukrx_SbyJvZN6MtxzEmA":{"text":"We got a reservation for 11 and they seated us in the back in this pseudo-backyard garden ","useful":0,"cool":0},"zcSoi6h7d3poRXLQtT9BPg":{"text":"Love the food (gumbo, shrimp étouffée, blackened drum and the best sweet potato pecan pie)","useful":0,"cool":0},"HJTkleSDh61lxQR5o44gmg":{"text":"Went to K-Paul's for dinner on 5/19/2010. Everything was great! They have the most amazing","useful":0,"cool":0},"CUWng4fsRd0FhH2evmTNLQ":{"text":"K Paul's often gets overlooked by the locals. We had not been there pre Katrina. We had on","useful":0,"cool":0},"4aDu4-0OfYGLMdrkd5vfsw":{"text":"Might be the first 5 star rating I have ever given but this place earned it.  From the sta","useful":0,"cool":0},"wjFh3AKel4toXXQEL_8X4Q":{"text":"Came here on my birthday and was not disappointed. The gumbo was good, but my friend raved","useful":0,"cool":0},"MHZ6L2uhyVRtfuyy_z4ftw":{"text":"Had dinner here last Friday, first time ever. I had quite a build up in my mind for the ob","useful":0,"cool":0},"VgHMSfnaztgsf0LNPfiFgQ":{"text":"Consistently good. Not life changing, but a NOLA staple. Home of blackening.","useful":0,"cool":0},"jwqBBazqhNRCABeQqkSj4g":{"text":"My wife and I have been enjoying some of New Orleans' great restaurants this past week, an","useful":0,"cool":0},"VrjHFsdb9yDqzqeC9HwklA":{"text":"Mushroom soup off the charts delicious. A basket of small breads and mini muffins, again f","useful":1,"cool":0},"J3rbeoXQa2db-AaMddW53g":{"text":"OMG!!!! \nMy friends and I were going to NO for a conference so decided to make dinner plan","useful":2,"cool":2},"DXKRgmjbJvHmZAtAGCnpmw":{"text":"Came here at the recommendation of a waitress at Kingfish for some down home, true Nawlins","useful":0,"cool":0},"NWD_GanfitexA9ecxXVrlQ":{"text":"AMAZING!! That is a simple sum-up. I went here with a couple of friends for dinner and wen","useful":1,"cool":0},"0qiYY6lh9FXnqI5_zEqgqA":{"text":"I've eaten at K-Paul's several times when visiting New Orleans.  Every time the service ha","useful":0,"cool":0},"pslF9fZeYzifor6IrgJfBg":{"text":"First stop on our foodie tour and it was just like we imagined. Fantastic service and grea","useful":0,"cool":0},"88rEx_1PFgXHhpt7Cy3YOw":{"text":"This was my first experience with southern food....and I think I set the bar too high! The","useful":0,"cool":0},"EK1wXHrf3rZ3-HF1HTxxgw":{"text":"We ate there Friday Oct 25th and it was outstanding.  Though restaurant was full, it wasn'","useful":0,"cool":0},"9aimmMwq8VWIvFAjFG4Ocw":{"text":"One of the better restaurants in the Quarter.\n\n- The shrimp maque choux was delicious.  Lo","useful":0,"cool":0},"jXhbBMxjaeqGyZNm0H09_A":{"text":"This is the first place we stopped at on a visit to NO... and mannnnnnnnnnnn THE BREAD PUD","useful":0,"cool":0},"y2-p1WlIbHpEEtWpHoC3Uw":{"text":"Went here for lunch.  Nothing planned, other than we were walking by  and it was lunch tim","useful":0,"cool":0},"mfCSsO2iIXWSXeuejo46Gw":{"text":"A bit chaotic at lunchtime b/c you have to order at the counter, and it was pretty crowded","useful":0,"cool":0},"I4_dtr_LZGCI0CvYdNOhgQ":{"text":"This is a Louisiana staple and not to be missed. I had the blackened redfish, invented by ","useful":1,"cool":1},"3HUjOWOl4r3ks7n4eJuk0Q":{"text":"Shrimp etoufee is simply the best thing I ever put in my mouth...if only the flavor and te","useful":1,"cool":0},"i-0Es64qTKFP6RxbpOE3Yg":{"text":"My husband and I ate here on our honeymoon during the French Quarter Festival. The service","useful":0,"cool":0},"NVGkFkAKhWFRb5TFYio8Wg":{"text":"K-Paul's Louisiana Kitchen seems to be a New Orleans landmark- one of those places everyon","useful":0,"cool":0},"gb2LasnY0dwv2Xq-rp-nPg":{"text":"On a great tip from my globe trottin' parents, I made a reservation at K-pauls for a Satur","useful":0,"cool":0},"ceUGVzgNFZaba3kyxdguiQ":{"text":"Wow!  This place is INCREDIBLE!  Easily the best meal I've had in months.   The venue is g","useful":0,"cool":0},"0MzP3d_Xt_U3CWh6m-gNFg":{"text":"Awesome food at dinner.  Had the blackened tenderloins and then the bread pudding.  Wife h","useful":0,"cool":0},"7i_SrtFrN0qkPMeuyuEZQw":{"text":"Shelby Shelby Shelby! She was our server. Massive shout out to her for such a wonderful ex","useful":1,"cool":1},"Py9UNnkXno_U8BY5S6KsNw":{"text":"Famous restaurant of Paul Prudhomme. A trend setting restaurant in the 80's that still ser","useful":0,"cool":0},"etSMy-nzHEykf-b-EAX0eQ":{"text":"This was absolutely hands down my best meal during a week's stay in NOLA.  The food was be","useful":0,"cool":0},"VVqF_sE77DawvB9fqGTRMA":{"text":"Meh. Good food. Mediocre dining experience. Appetizers were served about 30 seconds after ","useful":0,"cool":0},"Y2CC_Kc6jScJAOmnhoqxrA":{"text":"This place was featured on Food Network, so I had to try it. The blackened louisiana drum ","useful":0,"cool":0},"QRtTNwWZlWJHl7Nk1JsARg":{"text":"EVERYTHING here was amazing! \n\nAppetizers: Turtle Soup, Seafood Gumbo, Frog Legs with Onio","useful":2,"cool":1},"q0R_jmF8wLH3X5knNpQ91A":{"text":"What do you expect from the man you learned to cook with along with Julia Child and Jacque","useful":0,"cool":0},"Kvc89QYb0f-bQlDe1tB8mg":{"text":"K-Paul's was a recommendation from a local and I was pleasantly impressed. Definitely wort","useful":0,"cool":0},"Zd27EjZsJmuP9uXZfCs4fA":{"text":"Love everything about K-Paul's!  They definitely made my family and I (native Los Angeleno","useful":4,"cool":2},"usG7s9nrIps_4y8N_E1d2g":{"text":"An Original of New Orleans, you can't go wrong at K Pauls, the turtle soup in outstanding ","useful":0,"cool":0},"Jk8uVsaF1n4bpWuoEEFqog":{"text":"We were recommended K-Paul by a colleague's family, and since it was a short walk from our","useful":1,"cool":0},"zQDPXVaRS8ZOzzXq-XDW0A":{"text":"Greate food, Over the top service, Don't miss this place\nMake a reservation","useful":0,"cool":0},"WTfX7XSrrDvp1I3cnpKkZA":{"text":"I went to New Orleans with a couple of friends over the first weekend of November 2013. Th","useful":0,"cool":0},"OxJNqC_fhzph07RDFqNNyQ":{"text":"Terrific meal. Bread, appetizers, and entrees were all 5 star. We us a party of 9 and all ","useful":0,"cool":0},"ofGEqYLSqNLRKV3qXCr7YA":{"text":"Absolutely delicious beef tenderloin! Service and ambiance was perfect.  If you're looking","useful":0,"cool":0},"crmkUjSQdBQD0n-tW8jaoA":{"text":"This visit was a long time coming and I wish we had gone sooner. Chef Prudhommes legacy li","useful":0,"cool":0},"C2rjxyIABLX7GY3QQoa66A":{"text":"Ambience was missing, really- food is good although super heavy. After the starters we cou","useful":0,"cool":0},"lh_W8cAL20B6LBG8Q_yYMQ":{"text":"Great Louisiana cuisine in a classy yet comfortable environment.  I'd recommend to anyone ","useful":0,"cool":0},"59ff6-wLo4KQV_0fFq_IdQ":{"text":"You will leave stuffed with delicious food. I ate so much that I couldn't walk around the ","useful":0,"cool":0},"_2jdFkXIS-1eDj3wvT9bdQ":{"text":"Regrettably, Paul P is gone and this place ought to give up the ghost.  They'll slap some ","useful":0,"cool":0},"zb5bxw5jTygBKkN_kvP4HQ":{"text":"I WOULD SAY A 3.5-3.6 \n\nTHE FOOD IS GREAT! DEFINITELY GET THE BLACKEND DRUM!!!!!!  \n\nservi","useful":0,"cool":0},"jLCDfTDdI-LBQFi3xEkI-A":{"text":"Had the stuffed soft shell crab with fried shrimp and jambalaya!  Incredible tastes throug","useful":0,"cool":0},"w-rBrMm9qVv7evgnNqxtYQ":{"text":"Top notch food and service. I took a group of 20 to dinner here. The only inconvenience is","useful":0,"cool":0},"TqEncslXPnLIki3aALBWbg":{"text":"Dining experience - 10/26/09\n\nThis is by far the best complete meal that I had in NOLA. \n\n","useful":2,"cool":1},"j-wBLuO_xXulM_K09TjY3Q":{"text":"We made reservations a month out.  We were seated promptly. Our waiter was Vincent very pl","useful":0,"cool":0},"M2mmz5A7O8iC-6zJtqOpgA":{"text":"Celebrated my bday here & what a great dinning experience it was. Nicole, our server was e","useful":0,"cool":0},"m3mfRrqJggvKGEio-_SnBw":{"text":"Touristy, overpriced. Can't believe this is 4 stars on Yelp. Are all these people out-of-t","useful":0,"cool":0},"uQ_M4Vr3SvAeLZnT_-sCEw":{"text":"The craziest thing about NO is that it is eenie-mermaid-moe when picking a restaurant and ","useful":0,"cool":0},"GQbEy1uUCNk0dKbrhVzrMA":{"text":"My favorite restaurant in New Orleans.  Best bread basket I've ever had in my entire life,","useful":1,"cool":1},"R0StipWoxSp1N8dYdgo41A":{"text":"One word \"Jambalaya\" to die for...they also give u little packets of food seasoning to tak","useful":0,"cool":0},"SqCBNQ4n46OaxGyRDBpb3g":{"text":"We were super hungry between meals so we stopped here to get a drink and Fried Green Tomat","useful":0,"cool":0},"9L14aC4b30GaN7ON1cvadQ":{"text":"I came here with work friends for dinner. We had a party of 12 and they sat us relatively ","useful":0,"cool":0},"Jg3halgjM6VhcGoymleiYA":{"text":"I had fond memories of kpauls ordering the most memorable gumbo and jambalaya about 15 yea","useful":0,"cool":0},"YHaUSZ2A63YBLTVShLWCcw":{"text":"Called for reservations.  We were seated immediately upon arrival.  The night we were ther","useful":0,"cool":0},"K0UEDElyMwhy_8U_yh-lXg":{"text":"Wow, a cafeteria that serves beer!! It doesn't take much to earn 4 stars these days. Order","useful":0,"cool":0},"X0I_-F3Kle8sqP1k-qrBOQ":{"text":"Our food was delicious !!! We have an special ( the duck ) and it was very well done !!! I","useful":0,"cool":0},"vXCYQO31SayqvtIfi-00pA":{"text":"came at around 930 on sat night there were a couple tables open so we decided to have some","useful":0,"cool":0},"sK5oN2qsk0xEwabr9taPKg":{"text":"The food was delicious, perhaps the most perfectly cooked medium rare blackened steak I ha","useful":0,"cool":0},"o70NTznnyXaeMcmUCKOmQQ":{"text":"Maybe it was just an off night, but I've found that the food was really overpriced for wha","useful":0,"cool":0},"B8SOo6tX-eTGTbFQzy88sA":{"text":"Yummmmmmmm! Go here for lunch and leave wowed! I ordered the most delicious bean salad in ","useful":0,"cool":0},"rO6Fo7VZCM-h4QTjCCmotA":{"text":"Had a wonderful lunch here!  The slow roasted chicken with shrimp cornbread stuffing is a ","useful":0,"cool":0},"EhHii5P6Wuq0hMQmVfG2gg":{"text":"I'll be honest, I'm probably one of the few people in the world that had never heard of th","useful":0,"cool":0},"5Z1bpTGk0mQN5DqlMBqUBw":{"text":"This was my favorite real sit down and eat place in New Orleans. \n\nI don't know if I loved","useful":3,"cool":3},"Eho0Pqu55WWkPfSDUdyHoQ":{"text":"I've been coming here longer than I can remember and it's always on the list of restaurant","useful":2,"cool":2},"LVKZQMA9yxKqck49dlQcTw":{"text":"There was a good selection on the menu, we ordered the Blacken Drum with filet, duck and f","useful":0,"cool":0},"o6M4bS4udRDHo7YZC51rnA":{"text":"I was recently in New Orleans for a convention and was told by a local that we had to have","useful":0,"cool":0},"lFb3Sb0vg_Ddw_UdBCO7WA":{"text":"I decided to make K-pauls the location of my engagement on my girlfriend and I's trip to N","useful":0,"cool":1},"xLcSi4mYKC-I2au1O8kC8w":{"text":"The food here was delicious! However, I felt like a second class citizen visiting this pla","useful":1,"cool":0},"sNxaA80poz2izOuzDo789Q":{"text":"Everything we ate was what I think of when I think of quintessential New Orleans food.  St","useful":0,"cool":0},"GcvL6fkf0HLbbMOAIk5MaQ":{"text":"Possibly the best meal I have ever eaten. I had the blackened ribeye,and my wife had the s","useful":2,"cool":0},"V4E1-XPOFikGiyshspm20w":{"text":"Went to New Orleans on a business trip.  Vendor chose K-Paul's for first night's dinner.\nU","useful":0,"cool":0},"Fwi1_eGcM5P3rI_EM0mLMg":{"text":"This is an awesome restaurant. The service is amazing and the food is exquisite. I would r","useful":0,"cool":0},"mPxm3v2bVcZo8YNcFNacCg":{"text":"K Paul's was a wonderful evening out in the French Quarter. It was our last night in NOLA ","useful":0,"cool":0},"E5x1IpZrpnOVBgz2rX-oFQ":{"text":"Visited during lunch. The food was OK , Not much service. We Had  to order at the bar and ","useful":0,"cool":0},"m1uKjNlabj13I6iLdmqqZQ":{"text":"I was in New Orleans for a week and went to a lot of really nice restaurants. This was my ","useful":0,"cool":0},"18lhiQZcVmsRSYOLkSM7Yg":{"text":"I heard afterwards that it is a very touristy place, but I loved it.  I thought the food w","useful":0,"cool":0},"SMhSz8VX7feELZ24eCacUQ":{"text":"This was my favorite meal in NOLA and I tried many, many delicious restaurants on my visit","useful":1,"cool":0},"dR7pMTGoE3SoX0AG54UyEw":{"text":"This is justifiably the most famous cajun restaurant in New Orleans.  Chef Paul's restaura","useful":12,"cool":8},"L7tFSwGwZkIPYPDzm9VMoA":{"text":"Prompt service and impressive provenance. The breads served prior to the meal were all fan","useful":0,"cool":0},"t1SR-LtjMhB-qtakYZueKQ":{"text":"One of the have to visit restaurants in New Orleans.  I had dinner at K-Paul's almost 5 ye","useful":0,"cool":0},"XPrGkbIdQ5MzEPFX1BR6RA":{"text":"Great dinner here last night.  Walked in without a reservation and were seated promptly (a","useful":1,"cool":0},"zPfCdQamnOi6LQ9ybttQIw":{"text":"Shelia was amazing, as the first meal in NOLA it was hard to top! We had wonderful house s","useful":0,"cool":0},"OUZ0fFWx9SgHcE_fq48mnA":{"text":"Came here last year September, I don't know why this place gets only 4 stars, you got me. ","useful":0,"cool":0},"W_VxYOmURq6w8MMc8FNUNw":{"text":"A must while in NOLA. Outstanding food and service. Our waitress, Karleigh, was outstandin","useful":0,"cool":0},"0qAHo1Ko39yeJJCAspMbrw":{"text":"We went for our 15th wedding anniversary. The staff were excellent hosts. Our server, Shei","useful":1,"cool":1},"pP_Xd-b1KKkmL8f9GWnQEw":{"text":"Okay, I hate to admit this.. but my husband usually plans the details (where we eat, what ","useful":0,"cool":0},"5AuYNHS4Aj4nXZR3b_5Ivw":{"text":"I had heard about Chef Paul Prudhomme. Although he has passed on, his restaurant continues","useful":0,"cool":0},"wpcmB9iWJ9jax5OXhTLKUw":{"text":"Had a great dinner here with friends over Halloween weekend.  Our waiter, Jan, was great. ","useful":0,"cool":0},"6ZQIV0DtvDpw-uGvtzry6A":{"text":"Lunch is order at the bar, take a number and find a seat. Traditional fried shrimp PoBoy (","useful":0,"cool":0},"PIoyv0ZRV898XrBUWvFHVw":{"text":"Best place in NOLA. Got the Ahi Tuna, but every dish we ordered was superb. And completely","useful":0,"cool":0},"9WbbkafvymZG0-OIzNwXUw":{"text":"What a lovely restaurant to sit down and enjoy my first dinner in New Orleans. I loved how","useful":1,"cool":0},"WzwVlHImfWgtoOjLO6szug":{"text":"One of the best meals I've had in Louisiana.\n\nFood is absolutely amazing. I've gone for di","useful":1,"cool":0},"KggEM2IKc8Tstt23Mv5qgw":{"text":"I was so disappointed with our dinner. We started off fairly well with the fried green tom","useful":0,"cool":0},"Oc-2Tv_EuCDFkJpuMCOPLw":{"text":"Classy clean and the food was amazing. Not too spicy, not too bland. The shrimp etouffe wa","useful":1,"cool":0},"45phiKskCVedGr44rC5SUg":{"text":"On recommendation of a local we met at the casino, we went to K-Paul's. \n\nUpon walking in ","useful":0,"cool":0},"P_FEu48byyK7jkUOp7fSQg":{"text":"Great service and meal. I had the smothered pork chop, stuffed with yummies. It was pretty","useful":1,"cool":0},"RqgMXJOoCMM5nRembKCLDA":{"text":"Was in New Orleans for 4 days, and had my favorite meal of the trip at K-Paul's. Had the f","useful":0,"cool":0},"-l7LvaMAnTplSyiUvp6eAQ":{"text":"Excellent.....as many times I have visited Nola I've always rolled my eyes and passed this","useful":0,"cool":0},"iBpol-vPph2dAL5R7oli8g":{"text":"This was all I expected, fun, excellent service, superior food , he is a master of the rou","useful":0,"cool":0},"XTev9ikxczYRpSl5RFCROA":{"text":"So good!! I'm definitely coming back. I recommend the ribeye. It was perfectly cooked. The","useful":0,"cool":0},"EvtEBSi1wT_AMJrtqI6VnA":{"text":"I have no idea what the hype is for this place. The kitchen is beautiful but I didn't see ","useful":0,"cool":0},"mOYiMQCo-suFTtmvY6adCg":{"text":"Paul P is still out there but not cooking -- he walked in and posed for a few pics and was","useful":0,"cool":0},"oVVfEjydY6hg0ZNV5_aTZw":{"text":"The best food in New Orleans by far! I come here every time I come to New Orleans and it n","useful":0,"cool":0},"djrBxB9HVnnI-5qM7RZ9FQ":{"text":"The food is great. I had blackened drum fish for the main menu and fried green tomatoes fo","useful":1,"cool":0},"T1GOxTTFzBm926hzTOsAig":{"text":"Food delicious. We had theFrog legs and onion rings. Then k Paul's salad withe the pesto a","useful":0,"cool":0},"yidOOH0nwVjfYjgtsM3lkg":{"text":"I was in NOLa this last weekend for a bachelor party and this was one of the best dinning ","useful":0,"cool":0},"eeA8ZaXTDlcgC5PltuZK6A":{"text":"First time in NOLA with a large group of friends. Atmosphere was great and food was good. ","useful":0,"cool":0},"_6AeGM5cfqoiOZ9eKj2-Xw":{"text":"Food is generally tasty, and the experience usually top notch.  Food is admittedly pricey,","useful":0,"cool":0},"RreQw6RZRTg2skBQKDSc0g":{"text":"Great service. Food not so much. Not bold or unique. Paul would be very disappointed.","useful":0,"cool":0},"VW-0jzKMkpCl0h2j-VMUNQ":{"text":"I love this restaurant! It was amazing! One of my favorites.  True new orleans cooking. I ","useful":0,"cool":0},"towY1k7HAjhGuC1A_zXIuQ":{"text":"This place was pretty good.  A little on the expensive side for what you get, but the food","useful":1,"cool":1},"xChMObt9ZnF8mhekiNkxDg":{"text":"Hands down one of the best meals I have ever had. The stuffed pork chop and the drum were ","useful":0,"cool":0},"mo7I8xkIJuZ8q53xX0kUuQ":{"text":"The best food I ever ate hands down in my entire life!!!!! You have to go eat here if you ","useful":0,"cool":1},"WkdZP7sHHDBVGlmKvOL9bA":{"text":"I had lunch at K-Paul's today with the boy and two of our wonderful friends and their 6-mo","useful":0,"cool":1},"eCNQ3pCrCWth21M9Lv_ivw":{"text":"Finished a week long trip to NOLA and this was the best cajun I had in the French Quarter.","useful":1,"cool":0},"c4k-ZpzxI-rv83UIHDAjuQ":{"text":"I had always heard about K Paul's and it did not disappoint. Very nice and friendly staff.","useful":0,"cool":0},"uRCt9QYyAVeiphBeg1GU2A":{"text":"The butter beans were surprisingly good and more like a meal than a side. The cheese grits","useful":0,"cool":0},"sTb1gnx-9IxNc2YPp1SFdw":{"text":"Blackened drum, is one of the best fish dishes anywhere. They accomodated a large group fo","useful":0,"cool":0},"yJdVayqM0aSAP_gDmzHylQ":{"text":"Phenominal food without the pretentiousness of the other fine dining in the French Quarter","useful":0,"cool":0},"E7y8cnewUqbMq9vRHd-cNg":{"text":"K-Paul's was recommended to me by Yelp, a New Orleans native and a few friends- so obvious","useful":2,"cool":1},"dbAXbPvXSIUyIYaR-IYqoA":{"text":"Best dinner we have had so far in New Orleans.The steaks were amazing cooked to perfection","useful":0,"cool":0},"yWq_vZJh_RcKzgR_276WFA":{"text":"K-Paul's is just one of those restaurants that must be experienced, and more than once.  W","useful":3,"cool":3},"74SeYhBhhszrh81uyC3slA":{"text":"The bread basket is a meal in itself; a combination of homestyle biscuits, spicy rolls, an","useful":0,"cool":0},"VMUPxyTZZWh_Me-F8Q8jWw":{"text":"Eating here is a religious experience!\n\nWe go to New Orleans about once/year during the \"o","useful":0,"cool":0},"-dYjSbYW6QAoOh3xO0jRRg":{"text":"It's been close to ten years since I visited this place, once .  Nonetheless, I have to sa","useful":0,"cool":0},"WFD8MpfiBbwyNqd0MKh5Yg":{"text":"This was my 2nd favorite place to eat during our trip and I would definitely go back. Staf","useful":0,"cool":0},"yr7ySYdooKAQANft71bvFQ":{"text":"Everything about this experience was five star, starting with our charming server who made","useful":0,"cool":0},"8CTT5oAN2hobNtMIlUGwTA":{"text":"We had a magical night at K Paul's last evening. We came to New Orleans to celebrate my fr","useful":0,"cool":1},"t1F7vQmTo-UhhYE81e37bg":{"text":"Don't get me wrong, the food was good. However, the waiter we head was very rude, he smell","useful":0,"cool":0},"CAlOTdhZbvedXmUBaJzo1Q":{"text":"ATMOSPHERE:  The atmosphere was warm and inviting. It was our first time here. You definit","useful":1,"cool":1},"SwRtdl-bcxsE4iUjfKAxZw":{"text":"I'm a Nola native that now lives in Charlotte , NC. For whatever reason I have never been ","useful":0,"cool":0},"H8OJmpOe1GdQ2omWJBG7ew":{"text":"We didn't stop for dinner, it was only lunch.\n\nThe lunch is set up like a sandwich counter","useful":0,"cool":0},"XgqK6pYfj6uWGboe40RlNg":{"text":"I was sadly disappointed with my experience at k Paul's Louisiana kitchen last night\nFrom ","useful":4,"cool":0},"CXqpY5p9GiSJA3qAgx51eA":{"text":"The start was not impressive - gumbo had tough chicken, pear salad seemed to have canned p","useful":0,"cool":0},"lVzoGeJL479LMgVxuAwcSw":{"text":"This was probably the best meal I ever had.  I had the gumbo, surf and turf (blackened dru","useful":0,"cool":0},"PLUVUXetpcC99BPD7tK-Yw":{"text":"We discovered K Paul's lunch a couple of years ago when visiting New Orleans and had to re","useful":1,"cool":0},"YaYrIYWYSiyazUI9siewkg":{"text":"For a Thursday night they where completely booked from 6pm until closing which is generall","useful":1,"cool":0},"4D_NEIO_H1nx1_otWtyizA":{"text":"Food was great but I cannot rate this restaurant highly due to the rude and unprofessional","useful":0,"cool":0},"QGRNa61HDMXjGcAAdAMRXg":{"text":"So I have lived in New Orleans for 6 years and have always loved KPauls. The food was exce","useful":0,"cool":0},"bzpkP3AlaAQhls8VxLjwzA":{"text":"Blackened drum po boy is hands down the best po boy I've ever had and, being married to a ","useful":0,"cool":0},"_j6Va4VGzaRW3mUeyYI-NQ":{"text":"New Orleans is one of the best places to go if you want to gain 10 lbs quick. Most of the ","useful":2,"cool":1},"rnLJgGGf8gCmGe_tWzgieg":{"text":"We were in New Orleans for a bachelor party and around 9:30 on a Saturday night, 4 of us w","useful":0,"cool":0},"0bnkWlamnbDVW8pJCD-scA":{"text":"Simply amazing. Wow. Two thumbs up, all day. I could not get enough of this food, I left s","useful":4,"cool":2},"dSHgdazEJWlHCZqSU278Ng":{"text":"K-Paul's has become tradition! Sheila and Leroy are the friendliest souls you'll ever enco","useful":0,"cool":0},"_lzutwbun3o8Yql2-nm8OA":{"text":"I don't know why I haven't reviewed this place yet, but I was here in May during a work tr","useful":0,"cool":0},"U07CmFPq1Ou0gpmkChHNgQ":{"text":"This is perhaps the best restaurant I have ever been to!  My boyfriend and I recently spen","useful":0,"cool":0},"Te3G4lvVwUV4wHyodnCKDw":{"text":"A gem in the French quarters.  You want good food then come here.  You'll get great food f","useful":1,"cool":1},"a8_QI4EpqePPEUcrawtejQ":{"text":"Amazing blackened drum , rib eye, Yummey \nNot over spiced just right spice savory not hot.","useful":0,"cool":0},"4jmVlg6M4r_Gyj_gnyuwtQ":{"text":"Wasn't excited 'about it I felt it was just played cafeteria food I had so much food left ","useful":0,"cool":0},"hsZ_sm0E5WiN8a5zrxh1qQ":{"text":"Outstanding, just a beautiful place, amazing food and great service. The Beef Tenderloins ","useful":0,"cool":0},"lHHFlRFna3W-l3aGlrdvMg":{"text":"The food and decor were deserving of a better rating, however, our husky waiter with facia","useful":1,"cool":0},"RGMcTQ5vcqD6OmUNKN_X2Q":{"text":"Marvelous experience in K-Paul's. This was our first night in New Orleans, and if rest of ","useful":1,"cool":0},"Qvsb6q-_0r9rXvbWHOqb0Q":{"text":"Eh. Not sure what the hype is about. Nothing that inspiring. Not bad at all. But not great","useful":0,"cool":0},"6h62bYVUMJnRqJC4phS3fQ":{"text":"Original review:\n\nunfortunately (for dining opportunities) the only time i was i new Orlea","useful":0,"cool":1},"2TIOx0smF1dNqsZ1aH8I8g":{"text":"The Manager should not have lead us on thinking we would get in on a Friday Night. If they","useful":0,"cool":0},"NjuP3a_SAPrspMG9M6eoHQ":{"text":"We were recommended this restaurant by a sweet young lady at the Riverboat cruises name Ai","useful":0,"cool":0},"Qf9kB2m5CioYMRsTukLE7g":{"text":"This place is worth trying - you do not need reservations, but it would not hurt to have t","useful":0,"cool":0},"hfp45ysabHHXuotk0mQlFg":{"text":"One of the best fish dishes I have ever had. Definitely worth a visit if you are a seafood","useful":0,"cool":0},"FQ0dxsRJ8eqPgKMagtzX-Q":{"text":"Friends from out of town want to try authentic New Orleans food. Suggestion from a local f","useful":0,"cool":0},"jscNekjBotcAH6KasK7P9g":{"text":"I was really expecting something better when I went here.  I personally LOVE the seasoning","useful":4,"cool":3},"brA3iKWBRV-Iqvq5jk6B7Q":{"text":"I feel badly for 3 starring K-Paul because from what I understand it is an NO institution.","useful":2,"cool":0},"AfjXczNVoV7gCcKHsb2qow":{"text":"One of the worst experiences I've had in Nola. I have been coming to Nola for 20 years, an","useful":0,"cool":0},"xXo9fggWhy9MZ-NCtf99pw":{"text":"Went there Saturday evening and had Shelby as our waitress. Big mistake. We were all mid l","useful":0,"cool":0},"u538z9YOx-nkoxlcZ99KUw":{"text":"Great place!  Great service!  This is surely one of the best places to eat in New Orleans ","useful":4,"cool":5},"lY95PpZI8P9dGaLJZJRrEQ":{"text":"I wish I could give 4 1/2.  First the disappointments. $10 for a well gin and tonic is exc","useful":1,"cool":0},"ZCboZtSFFFWNgTYhEVX4kA":{"text":"Went here for dinner with friends and family. Overall the food was rather decent, but the ","useful":0,"cool":0},"fu3EukLu6x5W6iYneE6x3g":{"text":"Just went here to try their bread pudding. Delicious! A fancy atmosphere. I'm sure delicio","useful":0,"cool":0},"KB43aAMjEiXn3X1R2uoaeA":{"text":"One of my favorite \"fancy restaurants\". Not only is the food delicious but they give you s","useful":0,"cool":0},"qwtTv0s_cEBfaCD3eWQ8DQ":{"text":"I went here for lunch with a colleague and desperately wanted to go back for dinner but di","useful":0,"cool":0},"DwcFMOAVBbCdlaPaLmUdww":{"text":"some of the best damned food i have ever had. turtle soup was awesome. fish was pretty goo","useful":0,"cool":0},"p2AJsUmhOLgfdnL6gLy7gA":{"text":"We had Valentine's dinner here just this past weekend, and this place never disappoints! F","useful":0,"cool":0},"4UFNC9YH8Fl1SERSyMQdzg":{"text":"Read lots of great reviews and decided to have dinner with my wife here on her birthday. W","useful":0,"cool":0},"NtH9F27qGk1tl-h9kI27-A":{"text":"My dad grew up in New Orleans and told me K-Paul's was his favorite restaurant back in the","useful":0,"cool":0},"RwxdYeKRSQpCN1nZa4BBYw":{"text":"This is my absolute favorite restaurant in NOLA. It is a real highlight of our trips to on","useful":0,"cool":0},"FWKrbU-_U9qvVlIJq-akiw":{"text":"Outstanding food quality, excellent service and I cannot wait to return!  Keep up the grea","useful":0,"cool":0},"6Yrc2Kz8dwEAYeuVA3ND5A":{"text":"I went with my family on the advice of a friend.  It turned out to be expensive for horrib","useful":0,"cool":0},"Jyir9fsrGFyWG5uhr5ER8w":{"text":"I have been using Chef Paul's blackening seasoning on fish at home for years so I wanted t","useful":1,"cool":0},"-c86xWDOWI0MpEtx9nXAIg":{"text":"We managed to get a reservation during Jazzfest weekend and it was a great meal.  We sat u","useful":0,"cool":0},"JJHElSYJ3Aw1daM35vmaqA":{"text":"Once again... a PERFECT experience!!!\n\nWent for an early dinner on my birthday (Tuesday, J","useful":3,"cool":0},"8Xvu9WhkysdZU4D8DzP40A":{"text":"Amazing!! Best meal ever! Sheila, our server was incredible! Love this restaurant. Had the","useful":0,"cool":0},"xsgxASKUbjCWboToywKCTQ":{"text":"We stopped in for lunch and while it was a little off putting to have to order and pay at ","useful":0,"cool":0},"hbtfkrICCKX2XhvaJGjjGg":{"text":"A must-do when in New Orleans.  Drinks are excellent, and the blackened movement started r","useful":0,"cool":1},"5SC3TPuQZPBg58R6GqoHMA":{"text":"Amazing!!!! If you go to New Orleans this must have. It was our anniversary and they broug","useful":1,"cool":1},"hukKNIhWh1KlK6ld6N9rQA":{"text":"Stopped by for lunch with coworkers, great food, friendly staff. Kind of an odd restaurant","useful":0,"cool":0},"-QqOKmO4FujWkEr053IbUQ":{"text":"K-Paul's is a fantastic place.  The setting is great and the food is superb.  There is zer","useful":0,"cool":0},"igADm2RtBr5CyQ44-IAKVw":{"text":"Hands down the best meal my husband and I have had in New Orleans! Our waitress, Sheila, w","useful":1,"cool":0},"6-2tj7Vulpq65GELTZLO-w":{"text":"Wow, the food here was unreal!! One of the pricier restaurants in New Orleans but definite","useful":0,"cool":0},"oV2kv9YMbc5XqbFtQ30-uw":{"text":"This place is resting on its laurels.  I had a piece of flounder with a sauce that contain","useful":0,"cool":0},"iotLzNqgpfTJ58sr3JT4lA":{"text":"Well, this place is a Louisiana institution. Chef Paul Prudhomme was responsible (and also","useful":1,"cool":0},"k-eXQyn-e289QvLc2YOI3A":{"text":"Tried two things here and both were amazing -- \nBlackened drum was excellent\nFried green t","useful":1,"cool":0},"hhuFfNGi8z3N2k5Ma2qJ7A":{"text":"Chef Paul looks like such a nice man in the picture :D The fact that he changed the culina","useful":1,"cool":1},"vsIAUrtLPI1uazPlP14PpA":{"text":"I went for lunch on a Saturday and the experience was only so-so. You have to order at the","useful":0,"cool":1},"xFX5Zzy9V9vUkeOJshXz7w":{"text":"K-Paul's always pleases me every time I am in NOLA.  Last month was no exception.  While i","useful":0,"cool":1},"LO6ciVu68xzpCWzy2WtBFA":{"text":"My boyfriend and I went here last night for our date night. After seeing it on TV and hear","useful":2,"cool":1},"QDYKc_cVA7nfhs1vGa-tFw":{"text":"This is honestly one of my FAVORITE meals during my trip to NOLA. We made reservations (it","useful":1,"cool":1},"XjoiWJhHPHaLbFYkXLD-Lg":{"text":"I probably haven't eaten at enough places in New Orleans to make good comparison, but the ","useful":0,"cool":1},"SFf-gV_vZb96ohsVeQbvHg":{"text":"K-Paul's has been on my \"must eat\" list since I moved here years ago. There are so many gr","useful":2,"cool":1},"O2TialPcqqaURGR6hbycgQ":{"text":"I have loved Chef Paul's food since his Louisiana Kitchen cookbook came out in the 1980's.","useful":1,"cool":0},"8vXtXpvA3ZfVgjgLSrK-4g":{"text":"A truly memorable experience. We were seated right away, without a reservation. If you cou","useful":0,"cool":0},"38D0tJIV8w-OI2RmVUXjng":{"text":"This is simply one place you can not miss.  From when you walk in the door till you have t","useful":0,"cool":0},"n53w-XmkGKvdQF-SrsZ9kQ":{"text":"Jambalaya is delightful, shrimp po'boy is alright. Nice baked chicken. We went at lunchtim","useful":0,"cool":0},"pk3hvPWw9IhtXdFR4ubnCA":{"text":"Best meal of our trip.  Best gumbo.  Bread sampler was very nice.  Best jambalaya (by far)","useful":0,"cool":0},"tALxLfQ6Xr3uB5uLuWVrXw":{"text":"My husband and I ate here a during a long weekend in New Orleans. The ambiance is nice and","useful":0,"cool":0},"4-rr0y5Fh6DVvqqaiioKeA":{"text":"I was really looking forward to this. Bit of a bummer. We sat at the table in front of the","useful":0,"cool":0},"3dzRqEbaSj3XcEYHMoeAHg":{"text":"During a recent visit for business and pleasure we ate here on a Friday night.  Knowing it","useful":0,"cool":0},"nWhDwk7b2EcmCoReLUgHiw":{"text":"K'Pauls is definitely one of the best restaurants I have been to (I would put it up there ","useful":0,"cool":0},"9_GuUdEu7Lk7yrD50BA8Ew":{"text":"When I'm asked what kind of food I like the most for the main course, my answer has always","useful":0,"cool":0},"vvis4qBZewXqSW_NcPE9Wg":{"text":"One of the best places I at at while in New Orleans. The services is good and food is deli","useful":0,"cool":0},"B9qgr8Sg-LsePiFcis6qKg":{"text":"I've been going to New Orleans all my life and have eaten at many New Orleans resturants, ","useful":0,"cool":0},"8PoML9XLp8RZC9Lc_upqNg":{"text":"This review is for their picnic-lunch (discounted lunch). They have this promotion going o","useful":1,"cool":0},"tcLDYnRk8j-Rh680Cok1kg":{"text":"The drum (fish) was awesome; definitely try and fried green tomatoes appetizer. Also, the ","useful":0,"cool":0},"N22yyIY6smI5D0vanq-HCA":{"text":"Excellent service, great food.\nI know it sounds weird, but you have to try the mashed pota","useful":0,"cool":0},"gjdztJaLZcNkNKw0_zzsrQ":{"text":"We went with 3 friends to try this place out. Have been hearing of Chef Paul our whole liv","useful":0,"cool":0},"LHh4I9hAGrj8ni_U9F_ySQ":{"text":"Went on March 19 for a Girl's night out. Kaiser was our waiter and he is THE MAN. Great se","useful":0,"cool":0},"hRHhB5J0YI1kRzPjVSujIw":{"text":"This is by far, my favorite restaurant in New Orleans! My husband and I quite literally wa","useful":0,"cool":0},"QoBoxwE6x765GnC5Hhya3Q":{"text":"Another NOLA gem!   Menu is fresh daily and so is the food!  Ambiance is very nice and liv","useful":0,"cool":0},"m7fZk1zvFhvOrdg6VPDAIg":{"text":"The first time I tried to go to K. Paul's I was in town for a tradeshow.  When you're in N","useful":0,"cool":0},"1paLWJGpQhvEFRjfa5Jgxg":{"text":"I really wanted to love the fish here, but it was way to sauced up and way too salty. The ","useful":0,"cool":0},"TNGBlFUbnSjHEb5XdDTsqA":{"text":"Sublime. I hade the delicious blackened drum. My dining companions had a wide range of dis","useful":0,"cool":0},"iv79a6FvVbO2g4rdhnvmcA":{"text":"This was my umpteen at this restaurant and it just gets better.  Sheila is the best wait p","useful":1,"cool":0},"_pZmAzTuqJQ6i4cQedjLDw":{"text":"I came in here on a Friday around lunch time and I must say I was extremely satisfied! My ","useful":1,"cool":0},"RGGEymYu8Vsm5aPc8o8Mrg":{"text":"Gotta admit that on our jaunt to NO for jazz fest I was most looking forward to eating her","useful":0,"cool":0},"lAqf7aLPmy8PygWFcI13SA":{"text":"Everything is very fresh. Be careful- It's easy to fill up on those molasses muffins befor","useful":2,"cool":0},"o-fRuqJcSbgj4qdJW-5fPA":{"text":"We went to K Paul's for lunch for the first time. Many dinners over the years, never lunch","useful":0,"cool":0},"f5jE5nPRUag_t7-Xfpb03Q":{"text":"The pictures look good, right? The food was what you expected, good. Nothing more. The ser","useful":0,"cool":0},"bjpewnYgOnC0NC9TEAs5Iw":{"text":"This was definitely one of my favorite meals in NOLA this past trip. I was originally goin","useful":15,"cool":16},"B59UC1DXAN8zANXLMoZC9Q":{"text":"The few nights that we were in New Orleans we were not able to get dinner reservations due","useful":0,"cool":0},"yXMYj4MaMgrzPNJp07PSOg":{"text":"K-Pauls Louisiana Kitchen is a nice, upscale French Quarter restaurant that still has a ca","useful":0,"cool":0},"-4Tw0XAw6_Vadin7GzMjIw":{"text":"Came here for the bread basket but they didn't have it for lunch. Bummer. \n\nThe jerk chick","useful":0,"cool":0},"SDVKtTulCZdtEo9PymbqAw":{"text":"Food Road Trip: New Orleans, LA Day 10\n\nWhile relaxing back at the hotel, we see on TV a p","useful":0,"cool":0},"gmYaOOZknhAWzfPjpu-qaQ":{"text":"Fantastic dinner spot. Highly recommend the restaurant. The shrimp with pesto sauce is fan","useful":0,"cool":0},"D0CtH01K7TTnrKoZx4naqg":{"text":"Very small friendly place. Food was super good. Seafood was very fresh but the magic happe","useful":0,"cool":0},"13vWjMzCeuBPZmYShaPhBQ":{"text":"We came here for our last night in New Orleans and let me say the phrase \"save the best fo","useful":0,"cool":0},"4iq-ODnlkNeZTUssIznGMA":{"text":"K-Pauls has been my husband's and my all time favorite restaurant.  We have gone multiple ","useful":0,"cool":0},"PhXOzx1yNmVa4_I6iSuWZA":{"text":"When you find you are watching the staff watching the mice and watching you watch the mice","useful":0,"cool":0},"w326P2dXljduorxoPthMHA":{"text":"Tried this place while in New Orleans because it was recommend.  What a mistake, service h","useful":1,"cool":0},"qJo-vcYI173XWFyUISNNBw":{"text":"Lunch was such a treat! Excellent gumbo and the best onion rings ever! Restaurant was very","useful":1,"cool":0},"BMq64_xKCw-vrrxuZztBdw":{"text":"Loved the red beans and rice here, they're so creamy, dreamy and perfect on top of the dir","useful":0,"cool":0},"JBX_c49cbH8kxUT3bJ0lbg":{"text":"Fantastic experience overall. The atmosphere was lively but intimate. The food was decadan","useful":0,"cool":0},"-u6EPQ12ffFXCld-1SKKFg":{"text":"Wow! We loved it!   I would recommend K Pauls over NOLA.\n\nThe six of us arrived on Sat. 1-","useful":1,"cool":0},"bY0oWrSiFZlTwVDQ2TSMNQ":{"text":"Meh. \n\nJust returned from a great weekend in NOLA with my girls and K Paul's was the turd ","useful":1,"cool":1},"jj7s6abqNRbE6ewqQgSLYA":{"text":"Wife and I had dinner here a few nights ago while staying in the French Quarter and it was","useful":0,"cool":0},"m7FkFHk_cGagxEZXB56a9A":{"text":"We liked kPauls . It's classic New Orleans. When we made our reservation the person on the","useful":0,"cool":0},"Zz8yENK53tezM_XOFwGnKQ":{"text":"My wife and I went here our first night in New Orleans, unfortunately we did not have rese","useful":2,"cool":0},"C3pt672G72QeKfBQuEHKnQ":{"text":"Delicious, and to someone who's not super familiar with cajun cuisine, it seemed creative.","useful":2,"cool":0},"qVsVk0g3cK5Zp0PjND_7Gw":{"text":"K-Paul's is my favorite restaurant in the world (and yes, I travel the world for my work).","useful":1,"cool":0},"uPd4F8kQnssl_1uahGqghg":{"text":"well worth the price!  great waiter.  relaxing jaz played as we ate our food.  4 types of ","useful":0,"cool":0},"9uoJ8A6cPfUrHrJ-1VGcag":{"text":"my one issue with the cooking in N.O. is the richness. i do love to eat, but my transplant","useful":0,"cool":0},"EnwCS98VE7Oz13Ki9VioBg":{"text":"Superb food preparation.  Got the Surf and Turf:\nSteak was prepared seared on outside, med","useful":0,"cool":0},"BBM055IIWCHnIvDh246sOg":{"text":"Made same day reservation for 5, so that was a plus. \n For years I have wanted to try K-Pa","useful":0,"cool":0},"wCFWRrWpqntkYbLL1b-CHQ":{"text":"Absolutely delicious! The filet was the best filet I've ever eaten! Definitely get it!! Th","useful":0,"cool":0},"SV3tZUb50FMG7ctMsDMljA":{"text":"This is my FAVORITE French Quarter restraunt.  I've been a couple of times - every time I'","useful":0,"cool":0},"rtGyREj9LZpk141fGW_CVQ":{"text":"Awesome Fish with crawfish & a homemade butter, filet, mashed potatoes & broccoli! Chocola","useful":0,"cool":0},"ZEjslueISMGobcb7jrOGUg":{"text":"Stop reading reviews right now and get there before they close! Astonishing food!","useful":0,"cool":0},"ETo2WmfPdPeybbCT-NHnpQ":{"text":"After SoBou we went for some sweet potato pie at K-Paul's. We were disappointed by too muc","useful":0,"cool":0},"ebztMzDwSlpBEYdbyG9mXw":{"text":"K-Paul's Louisiana Kitchen is Chef Paul Prudhomme's New Orleans restaurant.  K-Paul's is f","useful":3,"cool":2},"7gkkB1Ob92P1AzpZbs-GjA":{"text":"Our service was great but I wasn't overly thrilled with the food, especially since I becam","useful":0,"cool":0},"96S-prcve1FYE21mKU4Awg":{"text":"Great good and spectacular service. Sheila was one of the best servers we ever had. Loved ","useful":0,"cool":0},"nP4k3_-rmbrY-hjOZ8O_mg":{"text":"This has got to be one of my all time favorite restaurants... had a fantastic birthday din","useful":0,"cool":0},"tnN-nV0pYMtInFf6ENEhFA":{"text":"Best Gumbo and the breads are delicious! Especially the jalapeno bread.. The food is a lit","useful":1,"cool":0},"2pc9CdVqjB4LrgV56qEa1A":{"text":"Maybe the best meal I had I NOLA, but also the most expensive one - but it was worth every","useful":0,"cool":0},"Hse4us9uf-ginHjjQ824Pw":{"text":"Had dinner here last night and the food was amazing!  The fried green tomatoes with shrimp","useful":0,"cool":0},"FEhKBn6UEIiwvfWVpnrU5g":{"text":"I would never visit NOLA, and skip a dinner @ K-Paul's. K-Paul's is still my fave NOLA res","useful":0,"cool":0},"kCMaSGxuM5eBJe9NHOv2Pw":{"text":"Great space, service, and food.  Went with a large group (there were 10 in our party).  St","useful":0,"cool":0},"_jqSNe6V5FQ9wb-YY8mhTA":{"text":"Simply put--World Class.  If you have the money, the food and service is absolutely worth ","useful":0,"cool":0},"myTWFoZLz8khUzL5tM_OGA":{"text":"I love the atmosphere in this place, the artwork is great.  Try to not load up on the brea","useful":0,"cool":0},"ZRvJRGJl-g4FPEm0VjBqyg":{"text":"My favorite restaurant in NOLA to date great cocktails, gumbo, fried green tomatoes, I am ","useful":0,"cool":0},"rlaUMqDHwlrNOXQ83dkhtg":{"text":"My husband and I have visited K-Paul's restaurant for over the past twenty years. Unfortun","useful":0,"cool":0},"oG5c1oX9iKt-f-Q0j0RUyQ":{"text":"My meal was delicious- I got the salmon (pescatarian and only really 2 options due to Vera","useful":0,"cool":0},"WWwP2eANl_-2VZ1q4yaEVg":{"text":"I'm no N'orluns veteran -- this was my first real meal in the city, on my first visit.\n\nTh","useful":0,"cool":0},"PLAdq6gbiQe7EUvgRVf5jg":{"text":"Terrible experience!  We went tonight for our 41st Anniversary and were extremely disappoi","useful":0,"cool":0},"SVHg4Kf6xYAjk57ld4X2yw":{"text":"Excellent gumbo and excellent Turtle Soup. My wife and I shared both as a starter at this ","useful":0,"cool":0},"4vV0kQ6fUaAFs1_hek2VbA":{"text":"Not what it used to be....\nWe just arrived to New Orleans and came here for lunch, place w","useful":2,"cool":0},"TdKmwK_cbgaGltjg10jOsQ":{"text":"If not for excellent service + delicious bread, it would've been 2 stars. \n\nWe were a grou","useful":0,"cool":0},"KcoKmJRiq1-MYV3-F5UWww":{"text":"This place is amazing. Easily the best food we've ever had. The staff is super friendly. W","useful":0,"cool":0},"mUaSUdFWS_NGz-z3uZj2Rw":{"text":"- Chicken and Andouille Gumbo\n- Bronzed Spice-Cured Salmon Salad\n- Grilled Peach and Feta ","useful":0,"cool":0},"rkateNmA9ViG9CFOrK21ug":{"text":"Awesome! You definitely need to make a reservation, and you should be aware that there is ","useful":2,"cool":1},"W-61IQcw2dh0V5mI-31DJg":{"text":"*Vegetarian Review*\nFirst things first....I've been a Yelp reviewer for many years. My hus","useful":4,"cool":1},"iUDo5n8HIky6LKElXq1D_Q":{"text":"Ate here recently because I had family visiting from out of town. The food was pretty good","useful":0,"cool":0},"TTKQa8vksNDn69BPZKXYwA":{"text":"Food: 5 stars\nService: 5 stars\nAmbiance: 5 stars\nOverall: 5 stars\n\nWe dropped by the night","useful":0,"cool":0},"EwVM7sycR976eODX4RQQSQ":{"text":"I was really looking forward to this but left quite disappointed. Wife had the pork chop. ","useful":0,"cool":0},"uohwjB6uzi3tFBlBWyER6Q":{"text":"Well, another must see (eat) dining experience in new Orleans.  It was well worth the wait","useful":0,"cool":0},"kKnbr8KIjXuMwr9N_nzi-Q":{"text":"Good service, great Cajun Martini.  Great fried green tomatoes with chipotle sauce and fil","useful":0,"cool":0},"8aHTjgVUvL_7xjAyV-iJJw":{"text":"Not crazy about the flounder but the Tasso hash was great.  Gravy great.  Not expecting to","useful":0,"cool":0},"bUbCnYFmnQJyBZ3E5DnZNA":{"text":"Excellent amazing food paired with bad service and atmosphere. Pains me to leave this revi","useful":0,"cool":0},"z9mQsb3IHWyqen5cK8IxTA":{"text":"Just walked into this great restaurant without a reservation. Had an amazing duck dish. Gr","useful":0,"cool":0},"vSOqsOIiV9-Y-r19kYBmHw":{"text":"I've been waiting to come here for years and reserved a table for our last night (you know","useful":0,"cool":0},"qgOPJEe_7ZP_mK-dcJVKzQ":{"text":"Some of the best gumbo in the City.  Damn good gumbo.  Sweet potato pie.  YUM!  I don't kn","useful":0,"cool":0},"cg7lJeRuHRfMokl0tz8POw":{"text":"They were out of 2 of their 3 signature dishes  Food we ordered was good but hearing the w","useful":0,"cool":0},"o-mS1pLszhDac5KVTbyDww":{"text":"Believe all the hype about this place, it is freaking delicious!!! My dad realized that th","useful":3,"cool":0},"uLlBqcSGzw4RHjzbexSs_Q":{"text":"I was shocked by lunch. The oyster Caesar salad batter was gummy, the croutons soggy. The ","useful":0,"cool":0},"Ew0xkkKuIXj87ml3QAtSXw":{"text":"K-Paul's is excellent on all counts and has become one of my all-time favorite restaurants","useful":1,"cool":0},"-HIArBg1uGyBeOgt-sSGSg":{"text":"We enjoyed dinner at K-Paul's during Coolinary 2018. What a deal! Excellent oyster first c","useful":0,"cool":0},"BEFWmG9vbwY8zyl_dSDLeQ":{"text":"Seriously, one of the best restaurants in New Orleans, and we go out of our way to hit thi","useful":0,"cool":1},"Lh3LqYCpokAleoSdO5sDfA":{"text":"Turtle soup was good. Everything else was not worth the premium. Wait staff didn't seem pr","useful":0,"cool":0},"388TNCmo7DMYxhVM-ySlTw":{"text":"More than a meal, this was an experience.  My guess is there's nothing bad on the menu but","useful":0,"cool":0},"9xogntLx9EXr0ZUBY1dvFg":{"text":"Fantastic dinner - best I have had in the French Quarter.  Rachel our waitress was excepti","useful":0,"cool":0},"G1b57QnY_0KrsNeS7f0nmw":{"text":"This was single handedly the greatest meal of my life. Being from NYC I've had many delici","useful":0,"cool":0},"CYedMkk2Ul-6n4qwWHvi_g":{"text":"When I finally made it to New Orleans for Jazz Fest earlier this month I had to come and d","useful":0,"cool":0},"P_vEVl3lr0emAyH4zvZ6mg":{"text":"Second time dining here and the food was as good as the first.  The blackened twin beef te","useful":1,"cool":0},"sA3IYKj43QbYDhavN2fOww":{"text":"While my husband and I were visiting friends in New Orleans during Mardi Gras, this was wh","useful":8,"cool":8},"zbg_mM1ZC63rP1h56u8l-A":{"text":"This place is fantastic. I had the rabbit, which I have never had anywhere. It was delicio","useful":1,"cool":0},"iNvbrWOmPrfct3tMzeEdDQ":{"text":"This review is for the Deli Style Lunch Menu. I was so disappointed by this experience and","useful":0,"cool":0},"-2GQxp2lX-IZM-UmNQdROw":{"text":"TOURIST TRAP.  I REPEAT TOURIST TRAP.  \nI went to K Paul's for dinner about a week ago and","useful":3,"cool":0},"uX-OF3z5ncdcr0ULe9LQ9A":{"text":"K-Paul's is certainly still the icon we know and love. First no parking advertised. We par","useful":0,"cool":0},"WIWi3E9AqaDnmWx82qpsuA":{"text":"Wow!\n\nWalked in without a reservation and were treated to smiles and excellent service. \n\n","useful":0,"cool":0},"DyoIBSEQeOUn__tL08IoCQ":{"text":"Amazing ambiance and service!!! The best meal I have had. Our server Vincent was knowledge","useful":0,"cool":0},"o8kmj9cDdtiPmyhfsiQQSQ":{"text":"Wow, that's some pretty bad gumbo. It tastes like small pieces of sausages and very little","useful":0,"cool":0},"Dau5-06FhWrIUhMLG_o1Ow":{"text":"Food was really good - our waiter (Michael) was a little snarky - we had a party if 12 and","useful":1,"cool":0},"WW1wmxDdaKUheg51c7yISw":{"text":"My first experience with K-Paul's was so long ago that it escapes me at the moment. The ex","useful":6,"cool":4},"Kqv_mvm97znD4Xd0wjf1Jw":{"text":"What happened?!? I had such high hopes. My server was terrible, i actually asked her if th","useful":0,"cool":0},"CDRFcxSoJkoIYyROpuCLEw":{"text":"The food is amazing, service is friendly, and the interior radiates classy Southern hospit","useful":0,"cool":1},"RpuQyykYBggJ5fQrkI6q0g":{"text":"You hear and read about this place so much that you feel you must try.\n\nWe did on our seco","useful":1,"cool":1},"BO-N6fdRe3lcJR2_itoyOQ":{"text":"The food was great!  I went for an early dinner and didn't have to wait at all. Service wa","useful":0,"cool":0},"DcTyCFhfo7yLL8KwiC_Y4g":{"text":"So their bread basket is probably the best bread basket I have ever seen.  they had jalape","useful":3,"cool":0},"y1ugsg9xoMQ8LvR6sOgt7w":{"text":"My wife and I dined here on a Wednesday evening.  The food and service were fabulous!  Thi","useful":1,"cool":1},"rmPWv1oUzB9_TbzfqgTQgg":{"text":"My husband and I tried K-Paul's in New Orleans based on the rave reviews of a friend. One ","useful":1,"cool":0},"deTO8t8pXt6-bFjSPq9K8g":{"text":"We came here for one of our first dinners on our trip to New Orleans. It was crowded, but ","useful":0,"cool":0},"f_vuFm4fKbRjTO0q4Rio1w":{"text":"Incredible food and service all around. Now, my fav restaurant in Nola","useful":0,"cool":0},"v7eEqiQWTGTob3Z9XqJfmQ":{"text":"Food was good.  Have been there twice.  Can't go wrong, but was not overwhelmed.","useful":0,"cool":0},"4AxnC4mNLoiXsBjbjVecRA":{"text":"Man what a disappointment!  granted I'm from the SF Bay Area and I can be a bit jaded.  Ou","useful":2,"cool":0},"uEgqQp7oK9xSRvpWBNY4GA":{"text":"Very good! I would give 4.5 stars. \n\nOur waitress was very friendly and attentive, and bas","useful":0,"cool":0},"9izhk9B26zMAbfR0aMRVxQ":{"text":"There are no other restaurants!  If you have never tried turtle soup then stop and eat!  M","useful":0,"cool":0},"0ljv2yUrwo87bVFJ5uIqRg":{"text":"Best Cajun restaurant in the city! I dined here back in August when they did the coolinary","useful":0,"cool":0},"QjABwLHtebha1a9MY-wZbw":{"text":"Great service! We were in a big group and Marcelo was EXCELLENT! The food came out quickly","useful":0,"cool":0},"5-4wuMsfjwkDkIsEHGkUIg":{"text":"Service was wonderful. I ordered the blackened tenders (filet mignon). It was good. Nothin","useful":0,"cool":0},"VB0AvB6ewcP3gri08B0UZQ":{"text":"WOW, so disappointed!  Always wanted to eat at this famous spot and wish I had a great exp","useful":0,"cool":0},"7Ejk4fTUN_aKj8EZONvk7A":{"text":"I remembered seeing Chef paul on TV back when I was a little tyke. He was enormous in his ","useful":0,"cool":0},"6-2Yb5cyTPBoZ3_bNFI6AQ":{"text":"Had three different appetizers and each one was delicious!  Very attentive and friendly st","useful":0,"cool":0},"yXsZF4s95RBDda5YuPFc1w":{"text":"I have been here before and this really was a 4 1/2 for me. I had the drum fish, very good","useful":3,"cool":1},"XkfEw1wBTZi5UvMWyAJJMA":{"text":"Delicious! After spending the last 27 years watching Chef Paul and living in New Orleans, ","useful":0,"cool":0},"XW8twud7JSnMiPidXljiuw":{"text":"What can I say?  I come from a family of excellent Creole cooks but this is the best food ","useful":0,"cool":0},"UVpfQmcMgqhDNhE7xg4ZiQ":{"text":"Come here for a delicious and classy dinner. The service throughout the whole restaurant w","useful":0,"cool":0},"VXVg-Nlx8Wfvh37tob9uFg":{"text":"This was one of the best places we have ever been to. We had Edgar as a waiter who went so","useful":0,"cool":0},"vFUT5mKCAu211zieiC29nA":{"text":"Was better in the early days when the Fat Man ran the kitchen.\n\nK Pauls has gone upscale y","useful":1,"cool":0},"SOBhKfTUSDdWcB6Luny74Q":{"text":"I've dined at K Paul's over a dozen times starting when Paul Prudhomme was the size of a s","useful":2,"cool":1},"24fVfad_fR6-DTOvwSJrwg":{"text":"Sorry to say our dinner was very disappointing.  My salmon arrived raw not pink and flaky.","useful":1,"cool":0},"fUwhlng0NMG0rPNdYWGQxQ":{"text":"Sweet baby Jesus, this was a delicious meal.  We all had to share what we ordered: Rib eye","useful":0,"cool":0},"DJNsoZEQmPnK5jQsthcN5Q":{"text":"Great desert Chocolate Cake & Bread Pudding was to die for!","useful":0,"cool":0},"E_z2oDBWaJUmDsGHudgHXg":{"text":"This place was great! A little upscale setting, but casual fun-living crew. The Jambalaya ","useful":0,"cool":0},"P_rjSK1ckA1s0ah3uf5g9Q":{"text":"Been here several times. Always make it a point to visit when passing through. Excellent f","useful":0,"cool":0},"2_dCOV4yQbnEN5y07hUSCw":{"text":"~Fried Green Tomatoes with Shrimp Caper Dill Remoulade\n~Roasted Pear, Pecan, and Bleu Chee","useful":1,"cool":0},"7N3yBmwTfscE_z2syJuROg":{"text":"Our first time in New Orleans and we were looking for authentic creole/Cajun food. K-Paul'","useful":0,"cool":0},"hx6sSfEdAdK6zu-ntgSlPA":{"text":"We didn't eat but espresso martinis are fab","useful":0,"cool":0},"LcZM7aSzSmI-f4MwZpnw2Q":{"text":"This is a note from my past self to my future self. This place is really good. Come back.","useful":0,"cool":0},"GhDooXY00V8BfChxBBu5Dw":{"text":"I would definitely recommend this restaurant for dinner.  This is one of the places I real","useful":0,"cool":0},"ytLMl2Lh9EjeUP2i8DCDDQ":{"text":"Wow. Absolutely fantastic southern Cajun style food. \n\nOur server Vincent was a great tour","useful":1,"cool":0},"mEGj0luspbjtS9_S2xWXoQ":{"text":"delish !  the pork chops with their potato concoction is absolutely amazing. Their various","useful":0,"cool":0},"aUYz1PONZ7yJfKHqK9MadQ":{"text":"Terrific service, great ambiance and delicious, authentic NOLA food. K-Paul's is definitel","useful":0,"cool":0},"15M_OcpNQD6Q_yk6m13y6g":{"text":"Blackened drum fish - tender fish, quite tasty although not as spicy as I'd imagined it wo","useful":0,"cool":0},"t_c46DHUvlceTXFhB6zddg":{"text":"This review is for lunch.\n\nWhich is served on styrofoam plates, with plastic knives and fo","useful":0,"cool":0},"SF3V3FZf84ep_eESdUrXcA":{"text":"This place is the most amazing! We've had the best time with amazing food, and the greates","useful":0,"cool":0},"yIIxlVZ301j_ZC5t8-MpRw":{"text":"I have wanted to come here my entire life!\nSo yesterday I did it for lunch and it was very","useful":0,"cool":0},"HxQ1syMhhaOBRAZmnwQ4_A":{"text":"It was good. Host was unorganized and took a while to seat us but one of the waitstaff res","useful":0,"cool":0},"XAnBOE9U31lQ7mWzWGP9dg":{"text":"In the immortal words of Metallica, \"color our world blackened.\" Run, don't walk to this r","useful":1,"cool":0},"zmk-fT_Y5vXIfB6e5fG4SQ":{"text":"all the hype was not warranted. Yes, we called four weeks in advance and got one of the re","useful":1,"cool":0},"u5R8RrMACVwmIHSVOFe5GQ":{"text":"I came here for lunch, which they serve maybe 3 days a week.  It was 1 pm and it wasn't cr","useful":1,"cool":0},"mdiHyqM_Y_1uragCuTcLfQ":{"text":"What a disappointment. This place was average at best and the service left much to be desi","useful":0,"cool":0},"DBIZ-1s2Dba4DiHwFeB37w":{"text":"I rarely give 5 stars but this place deserved it. Everyone is friendly and service oriente","useful":0,"cool":0},"nr4HvCLVUvToqd__pnDEDg":{"text":"Amazing!!! I'm speechless with this place!!! Great flavors, Great Service, Great atmospher","useful":0,"cool":0},"f9T3SQ6ONqYT9MEHwR5CTA":{"text":"Even after the loss of chef Paul this restaurant carries on very well in his shadow. The f","useful":0,"cool":0},"aONYJG4sqahZEQpK-Zxc5g":{"text":"Had been waiting for years to be back in NOLA and dine at k-pauls and finally had the chan","useful":0,"cool":0},"tkggHIqKq69eHrqPSnM_aQ":{"text":"What can I say but wow! I had known about this place and its late owner Paul Prudhomme for","useful":0,"cool":0},"NiSGRNWd_dSdTx8A7B2j3A":{"text":"Sadly, K-Paul's seems to have lost its direction.  With disorganized and unpolished servic","useful":0,"cool":0},"cn8Nb3iqI57HDuySPQCSAw":{"text":"This is the quintessential Cajun restaurant. Been trying to come here since 1992 and final","useful":0,"cool":0},"1d1yxrkFgJeFS0Y8tsjsIA":{"text":"The food was delicious but the menu was limited. My husband enjoyed his food. This place s","useful":0,"cool":0},"_TU-goKZ_S9UTzW0Q-j_gg":{"text":"Authentic, upscale  cajun cuisine, but far over priced.  I have no problem spending a lot ","useful":0,"cool":0},"tR_lk6QBet_qvge5jcvs7w":{"text":"I came to K-Paul Kitchen as part of a party, and the food was quite decent. I had the Blac","useful":0,"cool":0},"n2B_DG_ZZtA3cUBqCj0Bvw":{"text":"Best pork chop ever! I got stuffed pork chop and is was perfect. The decor of the place gr","useful":0,"cool":0},"Hwc9ZtpMACxmwddDXhNjnA":{"text":"K-Paul's is running a summer deli menu for lunch which means:\nno table service\ncheaper pri","useful":2,"cool":1},"7eCZANHsn9CmE2-IK236nQ":{"text":"Food was great. Service was not. Had a female server on the second floor Oct. 30th. Sat at","useful":0,"cool":0},"hvdOXNVzqjTo7xe7V-vsLg":{"text":"The food and service here are unbelievable!  Hands down the best food we had on our trip t","useful":0,"cool":0},"mCy9Fe6rwFd0tccrNtj-TQ":{"text":"Best restaurant EVER. You can't go wrong with this place. Close your eyes and just pick so","useful":0,"cool":0},"jPbKQPqaopqGq1_AWHpomQ":{"text":"What great food! The shrimp étouffé, butternut squash soup, rolls & bread pudding were del","useful":0,"cool":0},"6MHLbtX5WpcFqPEqLrN0ug":{"text":"This was the best meal I had the entire time I was in New Orleans.  The atmosphere is grea","useful":0,"cool":0},"GJUQ_StPn9qqs41dlkkAdw":{"text":"We had a great lunch hear-Gumbo and oyster po boys. I had kind of expected the food, serve","useful":0,"cool":0},"T1138sZGqgrZWas5ES-kiw":{"text":"Awesome place for a group. The servers are super attentive and friendly.\n\nI'm from CA so I","useful":0,"cool":1},"quSikJQz0-8WBS2DLDC-Xw":{"text":"Crappy inattentive service. Good food. Take your pick. There are better restaurants with c","useful":0,"cool":0},"3MG99hEOLcAXHwc5-nc5PA":{"text":"literally never disappointed here - every year when we visit NOLA we eat here and i absolu","useful":0,"cool":0},"NFR1cQ-OYjEqSNUzPi05xA":{"text":"Everything was fabulous!  We felt like if we had went to heaven, this is the type of food ","useful":0,"cool":0},"CZCT8KKfsSbccT3RmQzo2Q":{"text":"Absolutely every bite was perfection, from the huge basket of hot homemade breads (heavenl","useful":0,"cool":0},"_UXfFLk6vLu_yrL9Ck51Nw":{"text":"K-Paul's is a classic.  Very friendly wait staff and great food. We enjoyed the rabbit app","useful":1,"cool":0},"vCbUamSNLNdJEwqQM6Hmlg":{"text":"Started with a cucumber martini and the crab claws for an appetizer. Crab claws were aweso","useful":0,"cool":0},"ruUam9tY54xW-YjZpuPo6g":{"text":"friendly staff and amazing food; I had the rabbit, crawfish, andouille sausage entree and ","useful":0,"cool":0},"Y3-sWYWtogxI9WROHz8MJw":{"text":"Dinner was delicious. The cocktails were excellent.  Really enjoyed our meal and the servi","useful":0,"cool":0},"rsff3IryqnuK6NmaRdXWVQ":{"text":"Have been there a couple times\nLOVE IT, FOOD GREAT!!\nIf you are a cheapie & want something","useful":0,"cool":0},"IgJo2T-ETgQWQ3rhJtKwvw":{"text":"Had shrimp courtbouillon soup. It was delicious and reasonably priced. Staff was friendly ","useful":0,"cool":0},"NF_eGd21NEOKYqi8S3-_ug":{"text":"Phenomenal birthday dinner. The staff is pleasant, well informed about the menu which chan","useful":0,"cool":0},"G8groJmDtXNQNPgVB78kAg":{"text":"If you don't recognize the name Paul Prudhomme, you might recognize his face (albeit young","useful":1,"cool":0},"5hcxsJuFWxRUxG3kFMwFWQ":{"text":"This was one of those meals that was perfect from the moment you walk into the restaurant ","useful":10,"cool":4},"tecixbCxj0PL7J46wcMFfg":{"text":"If you're going to do cajun in new orleans, you might as well do it right. K-Paul's sets t","useful":0,"cool":0},"SCeLYgkf2z7aOJWN3VK2Aw":{"text":"Wow! This place is will make you feel like your taste buds have become Alice and they have","useful":0,"cool":0},"2t-S4PFXMoKVtd3-OtMiQA":{"text":"Truth be told I have eaten in this place on my NYE trip 2007/2008 but this dinner was memo","useful":0,"cool":0},"xzaNFsWIhh8p8kcH-WnJ9g":{"text":"Having learned to cook cajun from Paul Prudhomme's series of cookbooks and PBS cooking sho","useful":1,"cool":0},"N7Wm6KtcybLB7o8-FhQyxw":{"text":"This place isn't cheap but is definitely worth it. Portions are huge! They don't bring out","useful":0,"cool":0},"RT3kZUHYcHy-0xZcBqYmZA":{"text":"K-Pauls has awesome Cajun food. I have tried many of their sandwiches, entrees and dessert","useful":0,"cool":0},"z-CQcSTlzh6m8Ab9PMhIWw":{"text":"How sad is it that this, the priciest place we visited in Nola, was also the poorest? \n\nOu","useful":3,"cool":1},"0JEyRy1MetbmqjpvzmDeLg":{"text":"While it was wonderful to bring my family to a restaurant I went to 2x in spring of 1981..","useful":0,"cool":0},"t_YzmHdqNEpzeonxl3wesw":{"text":"Such fine hospitality in this LA Kitchen! This is what I realized AFTER my meal.  \nThis pl","useful":2,"cool":1},"fLY3ysEvVjhDjD2BHGHgYw":{"text":"Wonderful service provided by Jason.  Veal chop was huge, tender and excellent.  Sweet pot","useful":0,"cool":0},"pQFNH37uU50uHzOe5MCHkw":{"text":"Went here for dinner with the team. The food is great and the opera happy birthday singing","useful":0,"cool":0},"jLAbbyRm-wyTWILiQeYWaw":{"text":"I really enjoyed my visit here. The service was great,  and the blackened pork chop I had ","useful":0,"cool":0},"gSbXxwC28-t67GXTHbE6BA":{"text":"I really, really wanted to like this place. In fact, it pains me to give it only 2 stars. ","useful":1,"cool":0},"voD7P2pxucn38kJ4Sgdspg":{"text":"Wonderful place! Great food, great service, great atmosphere.  Sheila, our waitress, was o","useful":0,"cool":0},"VL4YGJ9EueyWZiPtIA83KQ":{"text":"Not impressed. I ordered the stuffed pork chop and it came out raw. The server was great a","useful":0,"cool":0},"q9yb9atJD8pdbpQtFt5ugg":{"text":"Came into town on Friday night, 8/21/15, and had a nice little dinner date with the BF at ","useful":0,"cool":0},"4IqJxQexnp8TYMyTmRyy8w":{"text":"We had the Chicken Andouille gumbo and Shrimp Po'boy and it was great.  They sat our party","useful":0,"cool":0},"9TNOgYvHxTdLOvNy2svRdA":{"text":"Call and get a reservation for the tables on the balcony.  \n\nGreat cajun food, very well p","useful":1,"cool":0},"tNXwugDaxbUttSkh6VXSlA":{"text":"3 stars for K-Paul's? But it's true. I ordered the fried flounder with jambalaya on the si","useful":0,"cool":0},"O496NKB4CQUq85BFKSrwPg":{"text":"I have to give credit to K-Paul's for making me like Louisiana cooking after a few disappo","useful":1,"cool":0},"_VwYnXpYtA4nuBO1NrxQVw":{"text":"Pretty yummy food although more 'american' than most other NO places I tried during my wee","useful":0,"cool":0},"R1nPeXsNLW03FwwZzqaHsQ":{"text":"Best food I've ever eaten in my 32 years of eating!  Great variety of bread, very fresh fi","useful":0,"cool":0},"8CfEirHBWlzk0OZzCczELg":{"text":"Really good Halloween dinner here. With advance reservations, we were able to secure a lov","useful":1,"cool":1},"YUiQLyZYOxcWccPfRzUI1g":{"text":"Best meal in New Orleans.  We have been all around the world and this ranks right up there","useful":0,"cool":0},"EstDwy3QDR09PnrkMmoE6g":{"text":"Heavenly to say the least. We had the blackened yellow fin tuna and crawfish étouffée....a","useful":1,"cool":1},"sBUMIXXh_U4EIztmjZcebg":{"text":"We visited K-Paul's on Oct 17th, our third night in NOLA. We arrived around 5:30 without r","useful":2,"cool":0},"214dL8c7srgBbNFzRyvlKg":{"text":"Amazing. Could cut my steak with a fork. Would come back any times. Vincent was a great se","useful":0,"cool":0},"8nTOKwUrYz9BQeJdpnLk-g":{"text":"The only star this place deserve is for the waitress, my wife and I had the pork chops and","useful":0,"cool":0},"iAG0cAASKVmBM0wR-cDi_Q":{"text":"I was actually looking forward to Commander's Palace much more than K Paul's but this was ","useful":0,"cool":0},"9XRcm6UDPfPUMTVcFPDufA":{"text":"Awesome food and fun experience! Shelia provided superb and fun experience! A must eat if ","useful":0,"cool":0},"MrHmLaXNsFciGph3awE2JA":{"text":"I have always heard wonderful things about KPAULS! I finally got the chance to go, and it ","useful":0,"cool":0},"iaDuLaBYuWA-Uk_7XdBjRQ":{"text":"The reason that this is a 2 star rating and not a 5 star rating is the saltiness of the ma","useful":0,"cool":0},"4_E9XeW62k6j65k9utfDvg":{"text":"We went here twice. Once for the dinner menu and for lunch.\n\nThe menu changes weekly but t","useful":2,"cool":0},"EctbXLfK1cbejVqisucmsQ":{"text":"Muy buen restaurat la atención muy buena y atenta . La cesta de pan excelente en variedad ","useful":0,"cool":0},"TIR55uAN8aL8O6yk1B3U0g":{"text":"You might think its touristy to go here, but please, don't pass this one up.  This is caju","useful":0,"cool":0},"_iDzl5navTPCZ9E4gbsTDw":{"text":"We loved our meal at K-Paul's. The service was impeccable and the food was delicious.  The","useful":2,"cool":0},"SKdmMAWkQp_muSyUD3q4HA":{"text":"I thought this would be awesome, it was really good, but awesome, no.  The frog legs were ","useful":0,"cool":0},"mLs4T9MmEKEW1Mny-6GXUg":{"text":"Followed Yelp's reviews and had turtle soup and it was great. Complimentary homemade jalap","useful":0,"cool":0},"HArNrU73dwAEk_WaG47gHg":{"text":"Dinner was outstanding !  Service was 10 out 10. Try the pork chop stuffed with 4 cheeses","useful":1,"cool":0},"f7g6S4bgmedWbpjGvGyuvg":{"text":"What a joy! Unlike other reviewers, I walked in at 6pm and sat right down, on a Friday nig","useful":0,"cool":0},"Ehqvwzqtjodh5w34906iEw":{"text":"I can't possibly add anything to the good reviews, but I must, since the overall star rati","useful":1,"cool":0},"K-gP9GeMk4KvgR9Ej2co-w":{"text":"Food was awesome! From the biscuits to the main course and desert. I had the blackened dru","useful":1,"cool":0},"ulhj98sMlH5cuDfqANoUPA":{"text":"Some of the best food I've had in a long time. I was nervous about trying the rabbit, but ","useful":0,"cool":0},"wu1k0-SP9wwkQjVONYotJw":{"text":"We stumbled in here on a Saturday night around 7pm, without a reservation. They politely t","useful":0,"cool":0},"5wcwUI9rNOEgKP16uZtioA":{"text":"Great food, great service and ambiance!\nThe fried green tomatoes (with shrimp chipotle ram","useful":0,"cool":0},"S9PNM3ht-YqXxmpofidTsA":{"text":"This place redefined my expectation of what a steak should be.  It's difficult to explain ","useful":0,"cool":0},"3PmF6Okgl00GyrBYTO7IBw":{"text":"My favorite restaurant in New Orleans.  Anything with fried oysters is wonderful - added t","useful":0,"cool":0},"qV_3PccYEhrrYMGtaagriA":{"text":"Excellent service, good food, especially the dessert, comfortable without being over the t","useful":0,"cool":0},"F_OruvqDpO-BIbco-BD_Bw":{"text":"I had a very pleasant experience during my visit last week. The ambiance and service was a","useful":0,"cool":0},"yjh0J3bnRYGR4lIQLz7iBQ":{"text":"Came here with the family during jazz fest weekend. Great choice. First of all the yeast r","useful":0,"cool":0},"ZeQdQXN_Y2yFTpWLWjcp8A":{"text":"After a French Quarter culinary history tour, we headed for K-Paul's, a famous restaurant ","useful":0,"cool":0},"ucJc3GnxL4JpJBPuTiwYKQ":{"text":"Fifth time in NoLa, tried K-Paul's for lunch and what a disappointment. No real plates, no","useful":0,"cool":0},"98PVzyMBWnnogPqSbvzMAw":{"text":"This place is old school creole-French cuisine and I say this with a smile on my face! Eve","useful":0,"cool":0},"4Yvj1SJvWbAjG9X9s_bePw":{"text":"Our Family's Favorite Restaurant, so far ever !!! On business I am always here when in NOL","useful":0,"cool":0},"lF0EqagV2uv3UdDWXqgFtg":{"text":"Ill make this short snd sweet.  The blackened drum and the stuffed pork chop are out of th","useful":1,"cool":0},"tORGOWYTSSdlt60OsG6UTw":{"text":"Famous but Overrated is an apt description of this restaurant. Went to New Orleans for a g","useful":1,"cool":0},"iazgntLb60FsRM1itElxRw":{"text":"Visited New Orleans for the first time and was recommended by a friend who's from New Orle","useful":0,"cool":0},"UqXCmohiaLPCNxCndb5ZLQ":{"text":"We came here for dinner. K-Paul's had been recommended by a couple of people. I found it t","useful":1,"cool":0},"0jAraJGn-qxGsLRtlB3eEw":{"text":"Locals here. We were seated upstairs (I didn't even know there was an upstairs) which is n","useful":0,"cool":0},"IOtQQvbIoJHAySw1t6Xw6w":{"text":"Favorite favorite of all 5 days in New Orleans. Take advantage of the free jalapeño dinner","useful":0,"cool":0},"x77ZYDlfFzH76VPIsT6czQ":{"text":"The food here was amazing. We loved the jalapeño cheddar rolls before the meal. The blacke","useful":0,"cool":0},"TM3hIdfQSXMObqI8J4Huqw":{"text":"I came here with a bachelorette party and we absolutely loved the food here. However, our ","useful":0,"cool":0},"LuCYrcpCQgTwV6n0Qs9gSQ":{"text":"The food was excellent.  Very good.  So why 2 stars?  The service!  Specifically our waite","useful":0,"cool":0},"CZJ4KEhFCA9yRoar2JU-JQ":{"text":"Make sure to order the bread pudding at the end of your dish.  The best bread pudding in A","useful":0,"cool":0},"ltP4MTxJBf1ztuhXCyHkNw":{"text":"My husband and I visited K-Pauls for the first time based on a friend's recommendation.  I","useful":0,"cool":0},"kDpHhc9d37uB9Hmekxiolg":{"text":"My friends and I went to New Orleans for vacation. Upon planning the trip everything we re","useful":1,"cool":0},"FxVLnxDp_yV6wO1o45UO2A":{"text":"Without a doubt, my favorite restaurant of all time. I never miss a visit to K-Paul's when","useful":4,"cool":0},"kNd5JFKbuno2V95_IArZ_g":{"text":"We made reservations a little over a week out and still was only able to get 9:30pm for 2 ","useful":0,"cool":0},"Z5vgqy7-l1Jxv109-okHmQ":{"text":"I've been to K-Paul's on just about every visit I've ever made to the Big Easy, and the fo","useful":0,"cool":0},"beW-H3FfcikCsNX1Y80qBw":{"text":"The food here was good but the server refused to pay attention to my wife and I.  She seem","useful":1,"cool":0},"Vos76bgiGmbOBuhqWwZMtg":{"text":"Salmon is a good choice along with the 4 bean salad and gumbo.  Then finish off with bread","useful":1,"cool":0},"4OhjxUv7xe5BsEFB7VRWxg":{"text":"We went last night, thinking we might be disappointed, since this restaurant has been so f","useful":0,"cool":0},"FDFl-MLybWWyeeULxMzD4Q":{"text":"Hands down the best meal of my life. Im not much of a pork gal, but I got the stuffed pork","useful":0,"cool":0},"GBxq4WUid0GrsOXCkAACQA":{"text":"Good, but certainly not excellent. Alarm bells went off when we were asked, \"How would you","useful":0,"cool":0},"akqewT2PesA8GBsnRdhv1g":{"text":"On our last vacation, we finally got to try K-Paul's and it was my FAVORITE!   We had an i","useful":0,"cool":0},"lsmqD7NPva2wdj0b0v65vw":{"text":"Just spent five nights in the quater and this was by far our best meal.  Fantastic......no","useful":0,"cool":0},"y8T4s7RmlT_XEaZfXWTuKw":{"text":"Everything was absolutely INCREDIBLE! The rolls melt in your mouth. We ordered 5 different","useful":0,"cool":0},"GlAwM260Knm-cmlNCgXugA":{"text":"*Lunch Review*\n\nThis was one of the most affordable places for a po-boy and gumbo that we ","useful":0,"cool":0},"jlaojps_YEfQU4WVY_japg":{"text":"Incredible food and service! Our waitress Sheila made us feel right at home and guided my ","useful":0,"cool":1},"KTsnFI7vDNCyv_T_9vl1yw":{"text":"Heavy salty food. My steak was not prepared correctly. It was overly cooked when I had ask","useful":0,"cool":0},"ztlCgnCcslx0XvaQGWJ22w":{"text":"K-Paul's is the exact 180 of the fine restaurants featured on one of those \"Kitchen Nightm","useful":0,"cool":0},"ju3RIrgrpJp2IkTl5o6q9Q":{"text":"This is a great restaurant, but it is on the pricey side. I ordered the jambalaya and it d","useful":0,"cool":0},"1qF0ObMco3VLshlmfLXmQg":{"text":"Probably my favorite NOLA dining experience on our recent road trip.\n\nI loved the decor, t","useful":2,"cool":2},"pksqH-UI-HbIMI4wCg8OJw":{"text":"Everything was fabulous met all our expectations. The creame brûlée is to die for. The wai","useful":0,"cool":0},"g5gxUB85qlcjAehZKzhTlw":{"text":"This is my favorite restaurant in the world, bar-none. The food is absolutely awesome! Go ","useful":0,"cool":0},"Pukmqfjz933pcKU40PyGGw":{"text":"So my buddy has been recommended K-Paul's to us for a while.  We all went the other night ","useful":3,"cool":1},"ROirMEI50Hi4hHceQsic2Q":{"text":"You'll pay the same for most any fine dining establishment experience, but you won't be as","useful":0,"cool":0},"s_WLttmiayaAenk26pLCPg":{"text":"This is still one of the better NOLA dining establishments, still going strong, and worth ","useful":2,"cool":1},"VLnyc8ZxKhBCr0RKhxig0g":{"text":"Overall the food and the drinks were mediocre at best. We started with a salad which was r","useful":0,"cool":0},"zPxcs-j7w2eM6NL8xhqPEQ":{"text":"A landmark for sure, but as with many older places.... its time has gone. Now when it star","useful":1,"cool":0},"pI5gWMTUR1xgTsUgx59seQ":{"text":"Had seen a smattering of negative reviews so was a little skittish about first visit. They","useful":1,"cool":0},"j7GGiJAVEgOEQ56F39H1bQ":{"text":"The best of the best. Book a balcony table and enjoy all that is New Orleans.\n\nPerfect in ","useful":0,"cool":0},"fKqWYePEwyf7Ut5UL1bQIA":{"text":"The Blackend Drum was so good that everything else paled in comparison ( and everything el","useful":0,"cool":0},"cB3VON13SuuaSth5j3OzPA":{"text":"Seeing as Paul Prudhomme is the reason my now husband and I clicked immediately when we fi","useful":2,"cool":3},"QYs1mx3TvwHOJHvmBe6VwQ":{"text":"My three stars is more like 3.5. This is an Acadian institution so I was really looking fo","useful":1,"cool":0},"ZT58mWr_5fBGTJyW3CqP7Q":{"text":"Went here for an anniversary dinner with my husband on our trip to NOLA. It was pouring ou","useful":0,"cool":0},"D0V7SyvgC0WSPz6ehu5Zkw":{"text":"We had lunch here on Oct. 25, 2014.  We usually stop here at least once for lunch on our t","useful":0,"cool":0},"rbOYV0C1MnSL4190Dkwcvg":{"text":"We stopped in here for lunch on a Friday and it was excellent.  It seemed to have a steady","useful":2,"cool":0},"bfZHN6KHIcAd57uhcD4H7A":{"text":"This place was ridiculously good! Came in with my family on chance as we stumbled across i","useful":0,"cool":0},"0tCjj7iWPA6auYvFWjy0pw":{"text":"The king made reservations here for date night. We arrived 10 minutes before our reservati","useful":7,"cool":1},"JeiLg8PKa8d0TziCcEzCGA":{"text":"Perfect finale to a fantastic long weekend in NOLA. K-Paul's was the perfect blend of seas","useful":2,"cool":0},"4IsiWWKjHS3n3U6rJlFyvg":{"text":"Unbelievable! One of the best meals I have ever had! Had the blackened drum and, as a loca","useful":0,"cool":0},"uxWvPjLaXZMSt_nncvbf6Q":{"text":"The food was classic New Orleans fare, but nothing incredible.  The service was attentive.","useful":0,"cool":0},"wXQbwiv5ixorKCt7Pq6ZSw":{"text":"I just realized I have never reviewed K-Paul's!\n\nI find that odd because I have had 3 meal","useful":2,"cool":1},"uLwsey7px5Q4f5KP9MsqjA":{"text":"Over priced for what you get--which appeared to be average FQ fare.  Had the shrimp ettouf","useful":0,"cool":0},"QbmE5iT-mGi68UdSk8nMiA":{"text":"I had the ribeye and I must say it was yummy...however, the freaking mashed potatoes were ","useful":0,"cool":0},"oVgcJqel9YncGMqmAdvLEg":{"text":"The reports of this place's culninary demise are greatly exaggerated. Becaused Tujaque's a","useful":0,"cool":0},"vPadX56EVFbrEzPdpHJxyg":{"text":"Found this restaurant on Yelp. Service was wonderful and the food was even better. We orde","useful":0,"cool":0},"QEMMX4A3ocSBpWTUCjnsdg":{"text":"This was my first visit to K-Paul's and I will definitely be coming back. If you like food","useful":0,"cool":0},"F7XT86LQBkP6xZ0RCQMpfw":{"text":"Have been coming since they opened. Met Chef Prudhomme many times. He passed 2 yrs ago & h","useful":2,"cool":0},"JAkvdDZz3_QnWjIkWcBCpg":{"text":"We had been eating in the best restaurants in New Orleans for 4 days before going to K-Pau","useful":0,"cool":0},"xFih3AsEMEwKd8svZOnoPg":{"text":"Went here with a group of 8. Everything from the apps to the entrees and dessert was excel","useful":0,"cool":0},"B8Yzk1Mt9ruJgibDhBQ2dg":{"text":"Stopped in here for a late dinner, as most places surprisingly closed @ 9pm on weeknights.","useful":2,"cool":0},"EABC9At308IpfziC-N7WsQ":{"text":"I love this restaurant! Had fried green tomatoes in a shrimp remoulade sauce with a Sazera","useful":0,"cool":0},"Ir0DPQJE5G8HOEF_2GHDNg":{"text":"So back in the day when paul launched his signature spices they set up a satellite restaur","useful":0,"cool":0},"wk7RANzIT1urJgu1zfYeBw":{"text":"A fantastic meal at K Paul's. Had out of town guest and wanted them to enjoy some of Chef ","useful":1,"cool":0},"xsUBzL3QW8eaZfzWmQwdXw":{"text":"AMAZING!!! Had the Eggplant Boat with fried shrimp and tenderloin strips with Cajun gravy!","useful":0,"cool":0},"1Hkvu3i4RRwUIjr7g2PDDQ":{"text":"Was recommended to go here.  Went in for Friday lunch and ordered corn macheux (something ","useful":0,"cool":0},"DzTUihK43oZ2Ot8tcAbbxw":{"text":"Had an amazing lunch here recently.  The bread pudding is to die for and the shrimp po boy","useful":0,"cool":0},"YMFeIdT3Nyh5DEJJIGFyVg":{"text":"A bit pricey for the area but really good food. I ordered the fried flounder with jambalay","useful":0,"cool":0},"vAdKVAUAtn5CDm45_ZLzxw":{"text":"A nice and elegant place. Decor is upscale urban contemporary with a NOLA touch. \nWe had a","useful":1,"cool":0},"XiFr2pWn1NJ_p4c4dYzaVw":{"text":"By far the best Gumbo I had in the city.  And I tried 5 different Restaurants.  Very authe","useful":0,"cool":0},"CwWp1fsU3YBu4tXObfbpgA":{"text":"We tried to get into a few restaurants without reservations and gave the hostess our numbe","useful":1,"cool":0},"n6DnKwl4fJUlNr-ScIIUug":{"text":"Stopped here while staying a few blocks away on Bourbon & Orleans in the heart of the Fren","useful":0,"cool":0},"LU_SDh3D1-RAo-B5bSOsng":{"text":"First off, I have to give a shout out to our waitress Sheila G. She is AWESOME! So friendl","useful":2,"cool":0},"m0LCU8omQTiKJy-RUhkUrQ":{"text":"My sister and I decided to eat here after seeing all of the great reviews. The service was","useful":0,"cool":0},"WduqTrnK1qXdsD9I_XWSdQ":{"text":"Hands down my favorite place to eat in New Orleans. Delicious food, great cocktails, and f","useful":0,"cool":0},"u55PiPC-S3jSSlAoQ1KRcg":{"text":"Best place in New Orleans.  I go here every time I'm in town.   There is simply no better ","useful":0,"cool":0},"hgQfgdPWEjO425id5cVuvw":{"text":"I have always wanted to come and now I can say I have. Food was awesome!  Paneed chicken a","useful":0,"cool":0},"5ZElFHkBnwqXLvBpS-o7Ww":{"text":"One of my favorites.... Molasses muffins, sticky chicken, blackened drum, sweet potato pec","useful":0,"cool":0},"HU5qEc2tEDhqlmur700BSg":{"text":"1st time in New Orleans and spent a great deal of time pre-trip researching our restaurant","useful":1,"cool":0},"JPhrfxAzra-EpddzhTIVvQ":{"text":"Best meal we had in town. Shared a salad with amazing green onion dressing and then had bl","useful":0,"cool":0},"Fx83N2iSHscLtv7jCQ4wcg":{"text":"I think this place was okay. Not too memorable. There were very unique bread flavors and t","useful":0,"cool":0},"AhfB2GA-5UklWIYeR00CLA":{"text":"I probably shouldn't be punishing K-Paul's for a trend that I actually experienced every p","useful":2,"cool":0},"ka74OfRwst33AiTYMXYcEA":{"text":"I cannot begin to describe how pleasantly surprised we were with our dining experience.  H","useful":2,"cool":0},"NMNzbWc49AwCGq_42ftYRA":{"text":"My family and I had such high hopes for this place. We've had a reservation since June. Un","useful":1,"cool":0},"PdsVS2XD1F_lD3WeM7_wVw":{"text":"This overpriced meal fell short of the rave reviews and expected quality of food. Strong o","useful":0,"cool":0},"rmId4VcDDGWcHAxve3Sc8Q":{"text":"After debating with myself about whether to have a steak at Ruth Chris Steakhouse or K-Pau","useful":0,"cool":0},"7Hcrz8VYtwZnL28Ih2KZOw":{"text":"Everything was fantastic!!! Patrick was super attentive and explained all entree inquiries","useful":0,"cool":0},"TzuH4vi9ECXRtyAO__HDdQ":{"text":"Oh my -  just ate off the appetizer menu & Jacque at the bar was our server. First the ser","useful":0,"cool":0},"diLInUf0FBaAeJby28XZvg":{"text":"If you can find a way to get into this place, it's life changing. We had Sheila as our ser","useful":0,"cool":0},"FuuNHsMEZru2s0UeUzAxDg":{"text":"The food is incredibly fresh and flavorful.  Fried green tomatoes are amazing to start the","useful":0,"cool":0},"Jt9hjKX8FVavfGu1NAddzQ":{"text":"Excellent food and service. The best fish (Blackened Louisiana Drum) I have ever eaten. I ","useful":0,"cool":0},"R459zqUbKFjIFsQ__4qHrg":{"text":"Ill will give my \"best gumbo\" award to this place.  The chicken and sausage gumbo is prepa","useful":0,"cool":0},"TjHoCNGM7P9MOWVcrz1zbg":{"text":"Had desserts this past Friday with terrible service and a ridiculous wait if you're a walk","useful":1,"cool":0},"UK8wYd47BZYtzGrfFRHaHg":{"text":"The food was amazing!  I had the beef with debris sauce and my husband had the rabbit.  We","useful":0,"cool":0},"rSpDTsvhLGXF58NGjg-p2w":{"text":"Best food iv had in New Orleans! I got the eggplant which was loaded with shrimp, scallops","useful":0,"cool":0},"3O5y5iZfVyo_JkeVUxMVUg":{"text":"I respect a $30 and up plate restaurant that can seat a guy in a muppet t-shirt and jeans ","useful":0,"cool":0},"5L-B7CzxiW4_FAh9WuPxFw":{"text":"5 STARS FOR Eric our server!  Great job buddy! ! Thank you for the recommendations for foo","useful":3,"cool":0},"jKkWYP1I6bE1kZq38h_B5w":{"text":"Unbelievable place - I can't express this enough. Definitely look forward to coming back h","useful":0,"cool":0},"CMifvyxgYB68bWZlgiRsPg":{"text":"Went there for dinner and the food and service was amazing.  I ordered the salmon and co-w","useful":0,"cool":0},"0QnVXb04Jy3ITla4Wj6jxw":{"text":"Donna was our waitress and she was AMAZING!  She provided such great service and was so sw","useful":1,"cool":0},"fVrZ8nQ309y5_QzLf9Mafw":{"text":"i came here with my boyfriend for what I wanted to be a nice, romantic, traditional creole","useful":0,"cool":0},"VkBR1sooayvHQe5fpSQv9w":{"text":"I just loved everything about this place. Light and airy when you walk in, friendly staff,","useful":2,"cool":0},"Zh5OE0onhg8tiIz7QHF6NA":{"text":"K-Paul's.  Saturday night for Mom's birthday dinner at K-Paul's.  As usual, service and fo","useful":0,"cool":1},"IL2i7X-0TpzHxNp6N7qgag":{"text":"Solid 3.3 for dinner after attending a performance at Pres Hall just blocks away. Service ","useful":3,"cool":3},"dQVRlkyIj60qyNb_sTAFwg":{"text":"I went here today for lunch with two friends for the deli lunch - it was great!  The chick","useful":1,"cool":0},"69R6tu4Y3HC5yMiIyLzq2w":{"text":"I have eaten here about 4 times and always enjoy the food. They have a good room upstairs ","useful":0,"cool":0},"_bPrnNKibTbUKun88JmWlg":{"text":"OMG. Literally OMG. Everything was just perfect and so good! Well...except for the crab ca","useful":0,"cool":0},"5bWinpwav7ks34HPI10DHQ":{"text":"Terrific. This was one restaurant I had to try when I first moved here.\n\nService. Polite a","useful":0,"cool":0},"CM02xkqcr4dPRwvW2wLq9w":{"text":"A pleasing meal in a clean, open space with room to sit, drink, dine and laugh amongst fri","useful":0,"cool":0},"la9XXuktOahcmp6Ych_OBg":{"text":"Went here when in New Orleans for a conference - was excellent! Had the gumbo and a shrimp","useful":0,"cool":0},"3ZE5kFrv82ndWxcPnI5WgA":{"text":"while in Ohio, drum was a fish from Lake Erie and it had been awhile since I had it.\n\nIt w","useful":0,"cool":0},"k8Y8UoQ0AnSbya4zIdPA2w":{"text":"We went to NOLA with a list of lesser known places to try, and so K-Paul's wasn't on the l","useful":1,"cool":1},"lDjz93pga3Gv1qA5vFF6eQ":{"text":"Local Review: This restaurant is so close to our apartment that I was looking for an excus","useful":7,"cool":4},"9bKzauqZHvNCJ4E5sNmnPg":{"text":"Wow, I really expected better but when we ate there this last weekend, there was not a sin","useful":0,"cool":1},"qga-iIWQJDCp_389egJ-cw":{"text":"This review is for the bread pudding only, as we ordered it to go. Best bread pudding I've","useful":0,"cool":0},"G3LU3wb4vcdm8ltyWZRD9Q":{"text":"Not sure what all the fuss was about. The food was average at best. Our server Patricia wa","useful":0,"cool":0},"W7LN3IkX4z9E0-eE1kdYvg":{"text":"Another wonderful dinner in NOLA!!  And definitely the fanciest meal I had on this trip.\nW","useful":4,"cool":4},"N1g2npcsOzdSoVS4-Xzqdw":{"text":"This is the last of my New Orleans trip food tour review, but I did save the best for last","useful":3,"cool":0},"VSGt_IBNe1sxOMDX-VI6Xg":{"text":"Great meal and outstanding service!!\n\nWe tried to get a reservation tonight (Mon) and were","useful":0,"cool":0},"1jD1__kBAbD2JU-DaUrLaQ":{"text":"Food - 5 stars\nService - 1 star\n\nCame here on a Friday night as a party of 4.  We shared t","useful":0,"cool":0},"wIUmGIWFaSNvSWH-wvU9zQ":{"text":"Iwent there with  group of people and every single person in our group loved the food and ","useful":1,"cool":0},"OvKxHbvGYI3jWhJIh_WJoQ":{"text":"The food is beautiful, totally wonderful. The drinks are fantastic as well. The service is","useful":0,"cool":0},"ZUe6aCZDvE53-LbUP7teKg":{"text":"K-Paul's has always been our must go to restaurant each time we come to New Orleans and it","useful":0,"cool":0},"czqrSAe0KBdUWKAnJQoXsA":{"text":"Wow.  Pleasant, extraordinary, tongue shattering delight.  This place was so tasty and an ","useful":0,"cool":0},"RfPaDjNICWZqSiBndawZ3g":{"text":"First - don't go for lunch, they do not serve the same food and it is very mediocre.\n\nDinn","useful":0,"cool":0},"PVjTnN1kQRj4tEM7h7TjFA":{"text":"Wow our first visit to New Orleans and we picked a great restaurant just off Bourbon st. S","useful":0,"cool":0},"ewr59GtuMD4bEIL9DD1Jvw":{"text":"Awesome !\nThis is a privately owned eatery.\nStarted out with the Blood orange cocktail.. g","useful":0,"cool":0},"oX9sPleokFPfJliEz9L1gw":{"text":"Everything we had here was a home run (turtle soup, avocado salad, surf & turf: blackened ","useful":0,"cool":0},"iQaeYxVOWBo7JxRxC9o04Q":{"text":"We had a fantastic experience at K-Paul's in May.  The service was top notch.  We ended up","useful":0,"cool":1},"FwUdpH208ya1gZU7jJW4Ww":{"text":"Good Food and Filling dont wear skinny jeans but your mouth will thank you!.., Had an appe","useful":0,"cool":0},"etLozCMw3ky116JWUHV5vg":{"text":"Lordy, that was a fine meal. I am stuffed.\n\nWhat did we eat, or talk about, or drink, or s","useful":0,"cool":0},"EMjrklEoI6-W20RGcYFOFg":{"text":"Incredible food - our table had: blackened drum, blackened beef tenders, and eggplant (not","useful":0,"cool":1},"Ylb9Zk9BJUJ3r4-P0I0Gsg":{"text":"In one word... scrumdiddlyumptious! Of all our meals this was the best. From the rolls and","useful":0,"cool":0},"NOPbLc9ywgbYnalZPBec-A":{"text":"Visited on our honeymoon and was not disappointed.  We ordered three courses and all were ","useful":0,"cool":0},"7HTh6mQkV4o8Jwx9rE6AVQ":{"text":"We went with a large group of people, which almost always turns into a disaster because th","useful":0,"cool":0},"ue2j6nnCsNdihuOZegVmeA":{"text":"I was in New Orleans on travel last week, so I made a reservation for this legendary resta","useful":0,"cool":1},"XzYbdJBUHQ-ORATwFixoMw":{"text":"Had high expectations for this place.  The service was friendly and attentive with very ni","useful":0,"cool":0},"t1PJYGIUjpxahJsRXnoc_A":{"text":"The best just get better, Eric is a top waiter, check the spice level before ordering","useful":0,"cool":0},"yUZuLP-S2TXvC4arlQQSvQ":{"text":"Yummy food with amazing service! Marcelo gave excellent advise on the dishes we selected..","useful":0,"cool":0},"Q-0l7clM-QXLA3kf2NdZiw":{"text":"What a disappointment tonight. K-Paul's has traditionally been a highlight of previous tri","useful":0,"cool":0},"1LLe0FAV1l1CCEQZKjHT0Q":{"text":"K Paul's, is a classy spot to bring a date or just sit by yourself at the small bar area. ","useful":1,"cool":0},"9h1Or3olMQlGw2oIiSaGig":{"text":"Their debris sauce takes three days to make - talk about passion! Food here is always exce","useful":1,"cool":1},"kvWWmIUL6R-34eU6GevVCg":{"text":"K-Paul's is really good but very pricey for what it is.  Dinner for four was $240 before t","useful":0,"cool":0},"u2ZlZvNEIQw8V8iYgX3VYg":{"text":"K-Paul's is my favorite French Quarter reataurant. This review is to promote the Coolinary","useful":0,"cool":0},"thyelaDPe6IT8sPeSCQNnA":{"text":"Usually I am the one who writes a better review than others but in this case.\n\nTHIS IS BY ","useful":2,"cool":1},"V8iuBpXyvA6c3lgizIiBbA":{"text":"Everything was fantastic. Turtle soup, Blackened white fish, and bread pudding hit the spo","useful":0,"cool":0},"d7n84WZ2bkZWvNYZSPEYQw":{"text":"First night back in NOLA, dinner at K-Paul's.  I sat at the bar with a local guy and a few","useful":1,"cool":1},"G_6yS--n01Otp0k4RIg4Vw":{"text":"The entrees remain good.  There was a mixup with one entree in our party so everyone got t","useful":0,"cool":0},"L7y7VbbhsYB34E7ug_6O8w":{"text":"I had the blackend drum and it was the best meal I have ever had in NOLA.  Can't wait to g","useful":0,"cool":0},"T-m3Ap3hhKKOLKcNBzQzkg":{"text":"Had to go as Chef Prudhomme once ran my foot over with his motorized scooter chair thing. ","useful":1,"cool":1},"FMoHMve25eKdSuWPoVOX5w":{"text":"Anyone that has been to New Orleans probably knows what it feels like to wake up in the mo","useful":2,"cool":2},"Agq_pp5fWiOneQlItLW94Q":{"text":"Simply delightful. I was hearing whispers of this restaurant from the locals during a busi","useful":0,"cool":0},"aF_GzAKCxdlrKNDph4yJ7g":{"text":"Save some money and just go to NOLAs. Though service was good here the food was lackluster","useful":0,"cool":0},"nb1HK-_osxlx0769Bg6_HA":{"text":"Tasty, yummy, fresh, friendly! What more could you ask for?  Attentive helpful staff.  We ","useful":0,"cool":0},"iGXqvaxGNfDYcLCHLjwxsw":{"text":"Service was good when we met the host (who was maybe the owner?) but then our actual serve","useful":0,"cool":0},"cVdctGQc69DWwKw1WC3SMw":{"text":"prices:  high, extremely fair for the quantity and quality of food you get\nfood: i'm drool","useful":0,"cool":0},"DNk5zxqyMHz6Yg4KSPsZpg":{"text":"I loved this place.  The food was amazing, and the service was the best I've ever had.  I ","useful":0,"cool":0},"A9SCIgu4KGIx0_o9iWs9Tg":{"text":"I went with a very large group. The leek mushroom soup was delicious. The bread was amazin","useful":0,"cool":0},"3at2bSbM7DDVf4d_jttDdA":{"text":"We just finished a very good dinner at K-Paul's. The buffalo frog legs were excellent! I h","useful":0,"cool":0},"ROe2d16LBtfAUVG1MgXpEQ":{"text":"Stopped in for a dessert fix with a few friends after getting our munch on elsewhere.  We ","useful":3,"cool":0},"uOblRu2ZoDnOz2MY7yuMKA":{"text":"Three of us had the Fried Green Tomatoes appetizer, the Soup sampler of excellent Corn Cho","useful":1,"cool":0},"xLTJoRouGh3sp6KnPyOugw":{"text":"My favorite fancy dinner spot in New Orleans.  The twin medallions with the potatoes and d","useful":0,"cool":0},"wvdlDf_fBP9uvgFGu24PgQ":{"text":"Went for dinner last night. Service stunk and the food was so-so. Very salty. Not worth th","useful":0,"cool":0},"qn4T4rgQENke_E1QXhF8GA":{"text":"Really good shrimp po boy and cheese grits.  Gumbo was so-so.  Very friendly staff.","useful":0,"cool":0},"rDQtGC40R6eRMldClLt2MA":{"text":"Wonderful service and amazing food. Everything from the bread they serve (3 kinds), to the","useful":2,"cool":1},"nrgb6jJCld2RRHz93dSmCw":{"text":"What a wonderful time we had last night.  The service was amazing.  The staff efficient, f","useful":0,"cool":0},"8b2hb7kQ7PcpT4YraVGH4A":{"text":"Wonderful experience tonight.  I had the blackened drum with a cup of gumbo.  The food was","useful":0,"cool":0},"KLGwV7xFvnNX7ksZf3FZTg":{"text":"Another great call by Rich! Best meal I had during our 3 day trip to New Orleans. Everythi","useful":0,"cool":0},"0g7ihl4PAOMWCBSCQoF4Pw":{"text":"The food and service are good, the atmosphere is great with seating available on the upsta","useful":1,"cool":0},"WXTUxwgyW5fAv0WsBvWWYg":{"text":"Good Louisiana cuisine, but a little bit on the pricey side. Staff is friendly and helpful","useful":0,"cool":0},"T93x64-xfFwk8ujLwvoBYg":{"text":"Maybe not trendy any more but the service was great and so was the food.  try not to eat t","useful":2,"cool":2},"uMbNjfTSu-OCfLzbK227PQ":{"text":"I love this place. Been going since 1999-2000 and even had them cater my wedding reception","useful":0,"cool":0},"gmnJgLdm5Unfh_YdR7qQHw":{"text":"Terrific dinner at K-Pauls.  Pleasantly surprised - typically such established places don'","useful":0,"cool":0},"GrNC6mEGS-yVL2L188JQPw":{"text":"I came in a party last night. While the other servers and restaurant staff were friendly, ","useful":1,"cool":2},"UinEXs_LK9usK9Cj4WDKuw":{"text":"This is the second time visiting NO. My first Trip here was seriously impressed by K Paul'","useful":1,"cool":0},"BtLQdJcJ9_1mbg9vWgU-0A":{"text":"Definitely recommend getting a reservation!\n\nI generally do not like to spend this much fo","useful":0,"cool":0},"0wi3DtZ0kysssr2YUJ3gdA":{"text":"Food : 5 stars, service 3 at best. We went for the deli style lunch. The price was Ok and ","useful":0,"cool":0},"5R-jai3UcTMxVaBlMMu2cg":{"text":"Great cocktails!!! Been eating here annually since early 80's. Now sine KPaul lettuce of a","useful":0,"cool":0},"bfYoj-_PgGQ5W4SyIUQbrA":{"text":"Usually not a fan of chicken breast, but their bronze chicken is out of this \"city\"...very","useful":0,"cool":0},"FIv42UiQeLJWF-owCuzgXw":{"text":"What a great dinner choice for mid week dinner. Rachel guided us through our dining experi","useful":0,"cool":0},"O7vCDVLeRzAjPK_RN1CXWQ":{"text":"Delicious!  We ate a variety of dishes and all were delicious.  The Bread Pudding was grea","useful":0,"cool":0},"xKnI55oCSJusYv9JZjaHYg":{"text":"Another great meal in nola. Amazing bread basket. Amazing sausage appetizer. The crab claw","useful":1,"cool":0},"Q2tAJyh1Yoc_qJiPj5Or7Q":{"text":"Now I had people from New Orleans tell me that there are better restaurants that KPauls - ","useful":0,"cool":0},"gg-ynniYZWylORffw5Y9Xw":{"text":"First time in the city with friends, and this was our first dinner stop.  Prices were very","useful":1,"cool":1},"zD1Zqc59gyCyuzvmik_NhA":{"text":"I've eaten here on an off for the past 25 years, and about 10 years ago thought the place ","useful":3,"cool":0},"LPOqw8TMtFYM9V7kqiGflA":{"text":"If you visit New Orleans, you MUST visit K-Paul's for dinner! It was the best meal we had ","useful":0,"cool":0},"Et2CQ9WTL28uwZ_S-b1sIg":{"text":"Stayed in NO for 5 days. Went here twice! Best meal in NO. Try the fried eggplant.","useful":0,"cool":0},"s2BCzLGBhgKtTrsXcxINHw":{"text":"Congratulations!  You made it to New Orleans.  Now where to eat?  Or, better question, whe","useful":1,"cool":0},"XKfMZjC-0Fkfwn5L1AlmzQ":{"text":"Food was amazing!  The server was awesome, extremely knowledgeable about both the menu and","useful":0,"cool":0},"HOMu4-oKBynjk-wByciZJQ":{"text":"Yum!  Went here last night with coworkers for my 2nd time.\n\nI had the drum fish and it was","useful":0,"cool":0},"Z4aiUQ7vis-cBJVrvfvvfQ":{"text":"Everything I wanted it to be (except for the cost).\n\nHere I near the big 4-0 and I'd never","useful":0,"cool":0},"SO9euz1TJ1LKVdkZggpblw":{"text":"Another recommendation! We came for lunch since we heard it was a bit more affordable. \n\nW","useful":2,"cool":2},"0w2gYiyWFurqw3Q5b1Kgxg":{"text":"Yes it's touristy.\n\nI had the gumbo as an appetizer and it was very good, spicy and hot!\n\n","useful":1,"cool":0},"VH47KK_QH_ghuiINd7OTXg":{"text":"Overpriced and Overprocessed. Everything was super fatty, overseasoned, and commericialize","useful":1,"cool":0},"pdjqjM9vFrFz3J8dJcQCjQ":{"text":"We had a wonderful experience at KPauls. My husband and I both ordered the surf and turf w","useful":0,"cool":0},"ZPwDFPISXCzLUiftvaMkkg":{"text":"Good food- the Louisiana drum fish is bomb. Honestly a bit over priced compared to some ot","useful":0,"cool":0},"2A3P3PZas35zOURsw1mwzA":{"text":"This was my fourth time in New Orleans and in the past, I had heard so much about Paul Pru","useful":3,"cool":2},"qYln4cyd1JiL0h37Bxhtjg":{"text":"This is the greatest dining experience in New Orleans for us. We've been several times, it","useful":0,"cool":0},"zwE0pj0EUWQ5DfHHewvMlg":{"text":"Told y'all I would come back if I was ever in town. This time, with a party of 8 for my fr","useful":0,"cool":0},"FA-cJ_9lEa1XqkFko4yCog":{"text":"So good!  It's not inexpensive, but it is a tremendous value.\n\nThey sat me at the bar whic","useful":1,"cool":0},"ey9FbtNBzreKb-vQJbv7Uw":{"text":"Favorite place for dinner on our trip. The stuffed, blackened pork chop and blackened redf","useful":0,"cool":0},"IrgiD7QFcnbUke5VXKgDeQ":{"text":"Eating at K-Paul's is a must in NOLA. There were 4 of us and we tried the Fried Green Toma","useful":0,"cool":0},"fSGbrdVHnNn3pY2P9jrP6w":{"text":"MONSTER cajun martinis.  And yes, I met HIM, him and his cane, the BIG man himself.\n\nHere'","useful":0,"cool":0},"-Zu1CDzSRjxBfuyNrN5WUg":{"text":"This place is a must have when in NOLA, everything is fresh and really good. I had the stu","useful":0,"cool":0},"sv9zdOAzH_7Q-HyTe35isQ":{"text":"I made the mistake of booking reservations at Clancy's the first night we arrived--and aft","useful":2,"cool":1},"cqKlOXHtfANnmvneE954HQ":{"text":"Took a rest during our walk. This day they were open for lunch. We only had a cup of Gumbo","useful":0,"cool":0},"5klFMnWMzGNkztSpqyYfdg":{"text":"K-Paul. Not the business!\n\nAppetizer: Fried Rabbit Tenderloin with mustard sauce.  Now, we","useful":2,"cool":1},"8oHzQm867jVG1GCUlmO0ZA":{"text":"I was lucky to been in New Orleans during Coolinary month and this was one of the great fi","useful":0,"cool":0},"dmAmbekh8MhIN208y3LzRg":{"text":"The best dinner I had on NOLA. Superb service. \n\nVery accommodating for my sister who has ","useful":0,"cool":0},"WYu-yLQZDwgthO6o-UMpGg":{"text":"We had a great experience at K Paul's.  We were seated at the front next to the windows wh","useful":0,"cool":0},"70p2TRw7T0H0ozMr2FnFNg":{"text":"Went here with very important business clients from the UK.  Chef Paul Prudhomme greeted u","useful":0,"cool":1},"bbN9IL8NkzMbZLWAX2BCTg":{"text":"I highly recommend this place. Great setting, love the atmosphere. The waiter was so so ki","useful":0,"cool":0},"EkQ1RQlAuxh0gKsFhnX7IA":{"text":"The best Cajun food in New Orleans. Every dish is excellent. The best value is the prefix ","useful":0,"cool":0},"YnIXpvlPPbF2n1mXPND0xg":{"text":"This was the first big dinner of the bachelor party we had, and I have to say, the toleran","useful":0,"cool":1},"cymRl5UMqT8p8iU3BA1xFw":{"text":"Wow - what a great place! We were in search of breakfast on Saturday morning and decided i","useful":0,"cool":1},"kKGaKdQrqUW-0H_AuPXVPA":{"text":"I went there for a meal with close friends and everyone was raving about the food. I had t","useful":0,"cool":0},"1_1tBodx57a2r1zvD0pQMw":{"text":"K-Paul's is spectacular. One of the best meals I have ever eaten. My husband said it was t","useful":0,"cool":0},"aOOg_ykUD0z-9pMndrteGQ":{"text":"Went on a girls weekend and all 4 of us agreed one of the best meals of our life!  Sheila ","useful":0,"cool":0},"s8GEQQwWFdE5pIf4oSYPkw":{"text":"K-Paul's is an absolute must when in New Orleans. The debris sauce was one of the best thi","useful":0,"cool":0},"HVwR0FKzZp2sdvP-Gp8LtA":{"text":"I really appreciated the assistance the staff gave me (on very short notice) in making my ","useful":0,"cool":0},"sJcFGYQXgwxyy-cByhClEQ":{"text":"One of the most famous chefs in NOLA, if not THE most famous.\n\nVery good food and service!","useful":0,"cool":1},"3zBtc38hnfsHo2Aewz9VaQ":{"text":"I am not a professional restaurant critic.  All I know is I ate with my husband at this re","useful":1,"cool":0},"hY4Lp-SNc7k7c3jcFj4_HA":{"text":"We had lunch at this restaurant and I have to admit that this was one of the best lunches ","useful":0,"cool":0},"k0o9999Fip-LfoBOQqawaA":{"text":"At times, K-Paul's is THE BEST DAMN RESTAURANT ON DA PLANET. I'm a foodie baby and some of","useful":0,"cool":0},"xTybxjymxg2kFPEeC2CIWw":{"text":"Great food and service.  The duck prawn vindaloo was an amazing combination of flavors and","useful":0,"cool":0},"WKMjInYVAxfW4o4PHkWq-Q":{"text":"Went there for lunch because a local recommend it. Went there, plates, cups and utensils a","useful":0,"cool":0},"S0r9q91jfZYyZFUV1KsAHg":{"text":"We spent a week in Nola, and chose this as our farewell dinner the night before we headed ","useful":0,"cool":0},"RL6rUyJ97FBsEKh5_rGGxQ":{"text":"I would have given 4 stars, maybe ....just maybe, 5 stars for the quality of the food. But","useful":0,"cool":0},"v_1ezBQsuj44q3Xt8WxPuw":{"text":"We planned our trip to New Orleans with an extra day so that we can have lunch at K-Pauls.","useful":0,"cool":0},"3UkfKT3Ga1ZcdlqrwqGx6g":{"text":"We were recommended this place for dinner and decided to give it a try. We reserved a tabl","useful":0,"cool":0},"ssJP3Qh1Qi8sjemRM8o2GA":{"text":"Well this was disappointing. It didn't taste like a $200+ dinner for three.\n\nI had the bla","useful":0,"cool":0},"RuZ2KXOSynuaIivJXuM0gg":{"text":"Ive been looking forward to eating at K Paul's for months now and i can gladly say i wasnt","useful":1,"cool":0},"198L7nkk5S29sqv1PGdWVQ":{"text":"Fantastic food with great service!  I had the Eggplant Pirogue with Seafood Atchafalaya. I","useful":0,"cool":0},"mhz0F3dnr7mRw6QfgfmjKw":{"text":"My boyfriend and I came here based on some other Yelp reviews, and I'm glad we did. It's F","useful":0,"cool":0},"qofNcTIC9YKxMHhDx8L4NQ":{"text":"Its been a while since I've eaten here but the Louisiana drum fish is fantastic. One of th","useful":0,"cool":0},"L2T2RDV51nniEDOzlYR7wQ":{"text":"Louisiana Blackened Drum!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Best fish I've ever had. Huge porti","useful":0,"cool":0},"2hPf0hNghXWz-8jHA2jrlg":{"text":"Great service. Delicious food. A bit pricey, but it's a high end experience.","useful":0,"cool":0},"IE7xdMrDI_Y_GIyLni7DIA":{"text":"August 2015 Delicious meal, attentive waiter and nice ambience.  Definitely worth putting ","useful":0,"cool":0},"ExTvfqtM9LUJwv6SDEFkLw":{"text":"A group of family and friends descended on NOLA for a long weekend and decided to do a spe","useful":2,"cool":0},"D-jF-_DM_5BfrB4-9BU1Hg":{"text":"OMG!!  This was the best, best, best place that I ate in NOLA.  \n\nYes, pricey but worth it","useful":1,"cool":1},"MxvVPzoIl2acdLrI3OnwNg":{"text":"I'm cool with the deli-style lunch service. I'm ok that it took forever to come out of the","useful":1,"cool":0},"mfa7pwES6HMaI70sGJQs6g":{"text":"We went for lunch on Friday.  It was great.  I had the roasted goat cheese and fried apple","useful":0,"cool":0},"chueIfL0PjjxajwecD0PHg":{"text":"K-Paul/s is always on our Must Do list when we go to NOLA....  \nYou can never go wrong wit","useful":0,"cool":0},"MuNpeEkJHmiJQz73BIv3-g":{"text":"Every spice used in \"Cajun\" cooking was used in their thick remoulade gravy or sauces on t","useful":0,"cool":0},"VcmANevPHVtgxArBOTjR3g":{"text":"What a profoundly disappointing experience! Recently I watched a Biography show about Paul","useful":3,"cool":0},"aI8jLxWd-ocwl5uIZmgTsQ":{"text":"Came here for lunch on a Saturday. My friend and I both loved what we ordered. I got the \n","useful":2,"cool":2},"qgmeeeDVmi5qiMXuOFFa-Q":{"text":"I would give this place 3.5 stars. I think there is some degree of hype. We dined as a lar","useful":2,"cool":1},"KlxqXXt-ngBKuuQ04Yb3EQ":{"text":"One night in the French Quarter? This is were you eat dinner, period.\n\nTurtle soup blows a","useful":0,"cool":0},"dupVa6ajzfJj-4XZXpwXcQ":{"text":"Any trip I booked to New Orleans usually went like this :\n\n1) buy air ticket\n2) make reser","useful":2,"cool":2},"YiE_zegKMsdYYSlgTRe9_A":{"text":"I toured several places in the French Quarter and beyond a few years ago (pre-Katrina) to ","useful":0,"cool":0},"mKZasP9N0EQP3kZ-BIuOVQ":{"text":"This is a mixed review. I am pre-disposed to like this place as I have cooked out of chef ","useful":0,"cool":0},"WwDUPOPoVYZ306cBaOU4jQ":{"text":"Is this a restaurant or a corner shop? The waiters are arrogant. The first question I've h","useful":0,"cool":0},"cRiWA_vaTB4vTszxqhtj4g":{"text":"We only had drinks and dessert here on our way to some jazz clubs. The place was packed wi","useful":0,"cool":0},"G0XV_gc08kXp0DJ9r5W7sQ":{"text":"This place has been around a long time and it is consistently excellent.  You know you are","useful":0,"cool":0},"0EVrEyNWvE5PjnPUIKYasg":{"text":"Our group of six people ate here on March 4th, 2011, which was just before \"Fat Tuesday\" (","useful":0,"cool":0},"1LGMcevxgAPU-U0Gj8PQTw":{"text":"K-Paul's was my first food-stop when I came to New Orleans this summer. My friend and I ca","useful":0,"cool":0},"fPijMlFfxNyJ4hpUd7neGw":{"text":"The food was great , the service was outstanding Hazen and Sawyer did a great job. Will go","useful":0,"cool":0},"gZr-BkXs9V1GtnkzZbtPEw":{"text":"Delish as always!  Every time I'm in NOLA this is the first place I go.  The gumbo is the ","useful":0,"cool":0},"TqjslYI0ppYWj-v-ubG2ng":{"text":"I know that Paul Prudhomme helped to bring Louisiana cuisine to the attention of the rest ","useful":1,"cool":1},"ppHEBIJOQ7xrS6qTD-1aPw":{"text":"I expected a up scale restaurant with marvellous but expensive food and that's what I got.","useful":0,"cool":0},"7TznmI6R805a6df0V9bttQ":{"text":"Great southern cuisine! The crawfish salad was fresh and so delicious. The blackened fish ","useful":0,"cool":0},"WLxToNQHo1xKqtQ7SJAFOA":{"text":"Great service !! Awesome food. Loved the desert!! \nCame here with a big group they did a g","useful":0,"cool":0},"haOxrSUuSsgZLDqXN-T-SQ":{"text":"I eat here every time I visit New Orleans. It's one of my favorite restaurants, but it var","useful":0,"cool":0},"PlWcTQLgj_gzqqdClKx7aw":{"text":"First off, I've dined\\wined in a lot of major cities. I love a lot of them, but New Orlean","useful":2,"cool":1},"fZpSpUN-8PV4kuuM2a_gRA":{"text":"Just excellent. Its been a few days since this meal and I still can't stop thinking about ","useful":1,"cool":1},"bDP1lSZajUuENN8EFfus_w":{"text":"At night, K-Paul's has exceptional atmosphere, service, and food.  At lunch on Saturdays, ","useful":0,"cool":0},"xNN4tfnaRikJd8MIowkjmA":{"text":"This place is amazing!!! I recently visited New Orleans and dined at this restaurant for d","useful":0,"cool":0},"ol92wLuU6ldyAj7hJZ0s5Q":{"text":"Had an amazing dinner at K-Paul's! We were in New Orleans for a week and heard so many goo","useful":0,"cool":0},"aeMskO0iKN-QrTRTGAyT1g":{"text":"I'll agree with the rest of the reviews, this place was scrumptious. A great quick stop fo","useful":0,"cool":0},"P2K66YLBEz9XRE95joQVUA":{"text":"Decided on a whim to go in and had the best stuffed pork chop. Also recommend the rabbit t","useful":0,"cool":0},"tvR6iGbfBvH40SjyvBtE0w":{"text":"The food was fantastic! Even the mash potatoes were out of this world. We loved everything","useful":0,"cool":0},"VfnqUghW2snt4jyIHqTctQ":{"text":"The food was unbelievably good. We had the fried green tomatoes, and we both had salads-sp","useful":0,"cool":0},"3vq_oosdogWg7xJh8nmUuA":{"text":"Hands down one of the best meals I have EVER had! Came with a group of 12 and the entire m","useful":0,"cool":0},"-QDTd24Y-pvMQ1G99ebkRQ":{"text":"4.0-k Paul's butterbeans and rice\n5.0-new Orleans chicken and grillades w cheddar cheese\n\n","useful":0,"cool":0},"nkm9F2Wn4Yph2SYRaEYDeA":{"text":"Dining at K-Paul's is something I have long wanted to do. Founded by legendary New Orleans","useful":0,"cool":0},"6vh-kZa9bU1YE0lw7llerQ":{"text":"Took myself to dinner here as I was visiting NOLA for work.  The food was AMAZING.  I was ","useful":0,"cool":0},"EkBUjWj2xc8SF6SZomRvWQ":{"text":"This place was good- I'm not going to go so far as great-but my husband and I had a perfec","useful":2,"cool":0},"BjY9lylJaVqUdNBS-gbyAQ":{"text":"I wish someone here would have warned me.\n\nAfter reading all the positive reviews and \"mus","useful":0,"cool":0},"BbMWvdd-56P6YZhMvo4Ysg":{"text":"Wow , what a fabulous place to eat  New Orleans style.  My husband and I had a fabulous me","useful":2,"cool":1},"HAIMPKYzGi-3kqZq3-179A":{"text":"In a city of great food, K-Paul's is a standout. Service was attentive, nicely timed, info","useful":0,"cool":0},"J2caCcfbwQbLL2a7pdyE0g":{"text":"We were told a little later in our vacation that \"the locals don't eat there.\" I don't bla","useful":0,"cool":0},"xI8mvLMQKJCG5LftRIPNwA":{"text":"I have been at this restaurant before and the food was decent. Unfortunately this time aro","useful":1,"cool":0},"3pwy2edi8SkxyPzACBWfFA":{"text":"For my last night in The Big Easy I wanted one last local flavor. So, I decided on K-Paul'","useful":0,"cool":0},"0yTUqJ_4-IY8ep6Bf5RdjQ":{"text":"High expectations were not met. Chicken gumbo was ok. Rabbit tender was ok too but the sid","useful":0,"cool":0},"f_vO-JNL7Z75rkitdzCToA":{"text":"This is a regular restaurant visit on my trips to New Orleans.  Service is always good.  A","useful":0,"cool":0},"roWYmyEgIkAC6SfEJQ3xCw":{"text":"The food was great the first time we came, second time not so much. Poor cuts of meat and ","useful":0,"cool":0},"72921S4HoUy-Um6ZOnwuYQ":{"text":"This was our choice for dinner our first night in New Orleans and it was AMAZING! We had a","useful":0,"cool":1},"57rGRkBLhDxK40wuEiCvsw":{"text":"I went there for dinner on a Friday night. Had the 3-course summer special. The turtle sou","useful":0,"cool":0},"1lS6WmXd2DbkrIENS7S3GA":{"text":"Go to K Pauls.  Ask for Sheila as your server.  Order whatever she recommends.  Then sit b","useful":0,"cool":0},"PuQJ58isZL2RcJtpzB68IA":{"text":"The waitress was a bit stoic when she came to our table, she was friendly in a condescendi","useful":1,"cool":1},"THQs59cjqjFeIYVm60wJGg":{"text":"Just ate lunch here with my wife. Rib Eye; great!! Flounder; great!! We just happened to w","useful":1,"cool":0},"RuY-6RLEWxVHyAFp8K5VAw":{"text":"We sure enjoyed our visit in Louisiana and New Orleans in particular.  My husband wanted t","useful":1,"cool":0},"71eIU7QBZLpz7srkup4bFw":{"text":"The flavors were good but the timing, delivery, and everything else was awful. Our order w","useful":0,"cool":0},"pPauHoc0U3Q7auoYwb2E9Q":{"text":"The food here really was good but the server refused to pay attention to my wife and I.  S","useful":0,"cool":0},"hqAUwmTifaJilxodJu_Ogw":{"text":"My personal favorite in Nola.  The atmosphere is modest and homie..very comfortable.  the ","useful":0,"cool":0},"srcUrIJjdNSYdOugFkNlrg":{"text":"We can't say enough how much we loved this place. The service was the best we ever had!  T","useful":0,"cool":0},"9vlIbPH7eoA0kCW8gxGCqg":{"text":"Our server Edgar was great! He recommended the \"Remoulade\" which was amazing! Thank you Ed","useful":0,"cool":0},"RlhNraC274ytoISvvnGn6A":{"text":"First I would like to pay tribute and respect to Chef Paul. He was a brilliant chef who se","useful":0,"cool":0},"aSuZqvv2iizi-NIMvUQq9g":{"text":"What would a trip to New Orleans be without visiting famous Chef Paul's place, so my expec","useful":0,"cool":0},"7vCJsirR8h3jLiO7XoZPGA":{"text":"If it wasn't for the mediocre (and almost hostile for some reason) service, I would be giv","useful":1,"cool":0},"srmBs8qbgV0M5KBi55NtnA":{"text":"Definitely a fan after dropping in late one night and enjoying their gumbo (fantastic!) an","useful":1,"cool":0},"dW2Vn2yI4BYPM5Jwseed_w":{"text":"Horrible experience ... pasta was inedible and the service was worse...  I realize everyon","useful":0,"cool":0},"1fNT628x9b42PAqS0N_NMQ":{"text":"I had heard about K Paul's from a friend and wanted to make sure to at least get a quick t","useful":0,"cool":0},"UHN9zhOhlmKmavCpTZnEPA":{"text":"If you're looking for a genuine New Orleans food experience, it doesn't get much better th","useful":0,"cool":0},"bYG2L3y-Rn9AAAHiVKqF6g":{"text":"Wait was 15 minutes. We got to sit upstairs which is usually for those with reservations o","useful":1,"cool":1},"j_h9hZNJIZBn6foS_cWuDA":{"text":"Amazing Louisiana cuisine, a bit expensive and you absolutely need a reservation to get in","useful":0,"cool":0},"Rk50ALSMP2YOVx1LeU4gRQ":{"text":"My family went for a weekend and we ended up being able to slide in without a reservation.","useful":0,"cool":0},"nQzm8jiamghIu5btCSJGhg":{"text":"I am a fan of Chef Paul's seasonings, but not sure if his restaurant is all that.\n\n1 star ","useful":1,"cool":0},"v26JZfvhcE2q2AjvfQU9HA":{"text":"Omg, we love this place! We are here every year, and I'm not sure if it is possible for it","useful":1,"cool":0},"kiKdWwSnG5PzDh00stjsaA":{"text":"While there are many restaurants to choose from in New Orleans, you would be remiss to not","useful":0,"cool":0},"R00IWj1a9rcO7-pSVTDKpQ":{"text":"This place was awesome lots of awesome food got the steak and white fish and crab cake and","useful":1,"cool":0},"UhdvMdRcgjN6n3Af-V6Rvw":{"text":"A special dining experience in this upscale restaurant. The portions are generous so if yo","useful":0,"cool":0},"qqcPSl84utZPVijpeCIxkQ":{"text":"Great food and the best part, show a Military ID and get a huge discount!  A must eat if y","useful":0,"cool":1},"uly9viVGEy16MIKOZVel5A":{"text":"Really enjoyed this restaurant.For an appetizer I tried the crab and corn bisque. It looks","useful":0,"cool":0},"WNo8NeKiEuXb8Jt2_88WbA":{"text":"This was the first meal my husband & I had in New Orleans after a 6 hr drive and it really","useful":0,"cool":0},"XPOsvDhRsz6CDHWNx9qmSw":{"text":"This was one of the best meals I have ever had in my entire life.  I was very nervous to t","useful":0,"cool":0},"dmcri66uyfspb0ij-USKSg":{"text":"I was in New Orleans and stayed in the French Quarters.  I was looking forward to going to","useful":1,"cool":0},"r0SRi8zwy_kTayDf3oLsvg":{"text":"This had been on my NOLA Bucket List for quite some time. We were not disappointed. Food &","useful":0,"cool":0},"4jOCeQ5pqyjvpTu5YT5JRQ":{"text":"Not that this place needs any more really great reviews... This was our first time visitin","useful":0,"cool":0},"nMLZuKSobnmzG85BqNjJag":{"text":"This restaurant is clean, great food, clean restroom, and great service. Ask for Grayson; ","useful":0,"cool":0},"MZ31N_BBu1wgNjpLQs8quw":{"text":"While good food and New Orleans go hand in hand, K-Paul's certainly stood out as a shining","useful":1,"cool":1},"jQyi8kDc5TMypPJEsi_iew":{"text":"Food was the worse meal I have had in New Orleans EVER and I live here.  The food was over","useful":2,"cool":0},"M9CHjBR71eDfFtNtNRClsQ":{"text":"Wow we love the food at K Paul's but tonight we were so disappointed.  A group of 10 of us","useful":0,"cool":0},"LeWui3KAd9IA2DapM7z1YA":{"text":"Amazing food!! I had veal with fried oysters on top!! Oh my!! It was amazing! My husband h","useful":0,"cool":0},"hbjPdhaPKUL1I7srJut3VQ":{"text":"I'll admit it - I'm completely biased.  But not in a way that you would expect.  I used to","useful":8,"cool":3},"mnMNOGE6pYcSMGKvAuymPQ":{"text":"The BEST bread basket ever! This restaurant is the birthplace of blackened fish. I've had ","useful":0,"cool":0},"jLs5ts7FC1C3g-n4kPSmzw":{"text":"We will always eat here each time we are in New Orleans, because of the bread pudding if n","useful":0,"cool":0},"dCmPCr09_Go7VVYABJTAsQ":{"text":"Blacken Drum fish and alligator soup were very good! The drum fish honestly melts in your ","useful":0,"cool":0},"Kpz4_-hdeN8gG0XYoJNpkA":{"text":"Food and service was pretty good.  Decor/atmosphere very dated, but clean, blades on the c","useful":0,"cool":0},"X0w7lrhIw_z3O6wysim4Aw":{"text":"Fish is, in general, healthy. I should like fish. I should be healthy. But...I don't like ","useful":1,"cool":0},"YUCbUKga7i4xe6eAjweA0Q":{"text":"first of all let me just say i effing love paul prudhomme- and if i thought i could pull o","useful":6,"cool":7},"sBOuC2spLCnG8sOI-bUlxQ":{"text":"Best food we have had in NOLA. Hubby's dream dinner. He idolized Paul Prudhomme and even a","useful":0,"cool":0},"gYFQfwUkwUYrrvYEd3wCdw":{"text":"The place was a lot fancier on the outside than the street it was on. The staff was very a","useful":1,"cool":0},"PZr9ey1A87IriCgRlGfzjQ":{"text":"So far, my favorite restaurant in New Orleans.  An outstanding cup of turtle soup, blacken","useful":0,"cool":0},"7Lexc4Srrra3Nn7rM-Vzrg":{"text":"Simply put, this is the best restaurant in The United States of America!  The food is 100%","useful":0,"cool":0},"tT4dYOKQFwk6vJFtIEy3bA":{"text":"This place was awesome lots of awesome food got the steak and white fish and crab cake and","useful":0,"cool":0},"IZWGXnZSuLsX6FOCoBXfTw":{"text":"This is the crown jewel! It continues to serve the best of the best in New Orleans!!! We h","useful":0,"cool":0},"-TJf9-B5qE1peJxbP5VtXw":{"text":"What a treat, our first time there and everything was so enjoyable and the atmosphere was ","useful":0,"cool":0},"kLeiEvchcooOw2EJLZzt-w":{"text":"I chose this place because my friends and I were on a trip as an early birthday celebratio","useful":2,"cool":0},"WSj-hPEMYU-KPIFlM8wkgQ":{"text":"Unbelievable...truly.\nWe are extremely picky diners as we cook ourselves. Everything from ","useful":0,"cool":0},"1eIUUS6_soxpDgmFG3icew":{"text":"Chef Paul Prudhomme will be sorely missed, however, his culinary legacy remains firmly int","useful":0,"cool":0},"JxuYi9FM0WEDwTdKZkpomg":{"text":"I was on a 4-day mission to eat and drink my way through the New Orleans' French Quarter, ","useful":4,"cool":3},"QGr9f_kxKcPNezBQiLdICw":{"text":"walked jn with an open table reservation, got asked to wait on the side while host let all","useful":1,"cool":0},"p2h24qUd6ciaolKx4NSi1A":{"text":"I had the chicken and andouille gumbo which was fantastic-the blackened stuffed pork chop ","useful":1,"cool":0},"BPLI2ccxpi1w9QzqFQ2_yw":{"text":"What to order:\nBlackened drum - put the butter in the mashed potatoes\nSit on the patio if ","useful":1,"cool":0},"fdSGPjVGdcrg_cms5GSg5g":{"text":"We had a family group recently in NOLA for a birthday celebration, and when the time came ","useful":0,"cool":0},"O21-M4vJHjeD0OvpiaxFSw":{"text":"I love love love this place! I've never had a bad food experience here. It's one of the be","useful":1,"cool":0},"_EPX78qE9fps11OkrmIwuQ":{"text":"We went here jan 2. The food was outstanding and the service was great as well. The bread ","useful":0,"cool":0},"XppJAJJLE_WfezAiT3oKMg":{"text":"K-Paul's was my first NOLA food spot. Expected a lot since a reservation was made, guests ","useful":0,"cool":0},"0od1S76O3UpWM5y80S50pg":{"text":"This is possibly the best place to eat on earth.  My wife and I have been here twice and i","useful":0,"cool":0},"qQYI9I1JY55KkfJnwEwULw":{"text":"Great for a large party of 6. They were able to accommodate my annoying soy allergy! Aweso","useful":0,"cool":0},"lePB1lTamhez9rPYoBSEtw":{"text":"I had two of the most unbelievable meals of my life at this restaurant, and although I am ","useful":1,"cool":1},"sdyoVqqgyXJtb1JNtVRsJw":{"text":"I have enjoyed K-Paul's for years, but tonight my dinner was not at all special and the se","useful":0,"cool":0},"851u4H1PKcUt80jFWcljmQ":{"text":"Best steak I've had since... well, I can't remember when I've had better actually. Melt in","useful":0,"cool":0},"3-N7d3H2dB4FSjb3qHpTgw":{"text":"Thank you Charles for an incredible experience tonight!!!  My new husband's comment was li","useful":0,"cool":0},"eLOio8toihkSSuA7Xxvnaw":{"text":"We ate here twice during a one week vacation because the blackened drum is just that good.","useful":0,"cool":0},"id9ter7IVWnPvHIWCovoOw":{"text":"Had dinner here with wifey. An amazing place with casual flair and charm. Brick interior w","useful":1,"cool":1},"rDo3AfzcEeaN2JndW9O9AQ":{"text":"Best meal I've had in NOLA. Server was incredibly friendly and knowledgeable. The jalapeño","useful":0,"cool":0},"FsQrqtj5oBRxKYu2KxfaZA":{"text":"Not impressed at all.  Are here on a Friday night.  For some reason the restaurant closes ","useful":0,"cool":0},"FECvuwxAJ_Hb--8Bhej-7w":{"text":"This place is definitely some great southern Nola cuisine. The stuffed chicken and po boys","useful":0,"cool":0},"-uiqIY9yDJwoo0IRgF_CHA":{"text":"Had a lot of great meals in New Orleans this week, but unfortunately this was not one of t","useful":0,"cool":0},"yCRpFTLOtNV4E-1uiS2CcQ":{"text":"Had heard goods things about this place but it definitely didn't meet expectations. Althou","useful":0,"cool":0},"KrpZ6XfC2sYrbheNlSb9Fw":{"text":"It's difficult for me to put into words how horrible the food and dining experience were a","useful":5,"cool":1},"0v8AI3GUC1NgY29-QHRD_w":{"text":"I know I'm a total tourist, but I love this place.  I realized today that I have been in N","useful":2,"cool":2},"Rma3sR5zbicjK7exrwyg-g":{"text":"Ate here for a large group dinner. Was my second time back. 1st time was ok...nothing memo","useful":0,"cool":0},"Irgqpy0DDf9X8o5AXzgT5A":{"text":"Our favorite dinner in NOLA. Excellent service and the food was amazing. Not my favorite G","useful":3,"cool":1},"qcsJuh3EmGtRZ3_uRKk1Pw":{"text":"Came here for lunch so they were serving lunch portions. I ordered the BBQ Shrimp and parm","useful":1,"cool":0},"9lMWsmmd22NEqlzinKZpIw":{"text":"After 3 days of lousy tourist traps, I died and went to heaven. K-Paul's has its share of ","useful":0,"cool":0},"ULR5QQTIk2CDCgxZ5-JiXg":{"text":"Ok folks....there is a reason Paul Prudomme has his signature seasonings in grocery stores","useful":0,"cool":0},"rxdPpJgQrHOZ8v9FTI3J_A":{"text":"K-Paul's was my first fine dining experience in New Orleans. Wow. I was so impressed with ","useful":0,"cool":0},"ICMdUhiSablN-UQAOqkwIA":{"text":"We visited New Orleans over Easter weekend from Los Angeles. As we walked toward to the Gu","useful":0,"cool":0},"Z3ujkA2v8rHssZZ7J6sxkg":{"text":"My fiancé and I came here for dinner during our most recent trip to New Orleans. We're so ","useful":0,"cool":0},"eSMYZQ8W7d56mG9o2tycoA":{"text":"I ate dinner here from the Coolinary menu, and the fried fish was the best I've ever had. ","useful":2,"cool":0},"y5fR3wkSoDBp4X4-TyVoqg":{"text":"Our tour guide recommended K-Paul's to us for the best creole/cajan food in the French Qua","useful":3,"cool":1},"BUgRRmkwk7NlLMN1oypPEA":{"text":"We stayed at nearby Marriot, arrived hungry, and wanted to walk just a few blocks for good","useful":0,"cool":0},"ZOLbbOOWXjwHk5XkrjkUCA":{"text":"The yummy soft jalapeño rolls in our bread basket were amazing! Blackened drum fish is ver","useful":1,"cool":0},"tL08wsSYmeS5TsvsaeEkgw":{"text":"What happened?? I've been coming here for years, and last nights experience was horrible.\n","useful":0,"cool":0},"pmibhjc5nuzs5seJjZoZiA":{"text":"A New Orleans must!  Although many visitors go to this place, it is NOT a tourist restaura","useful":0,"cool":0},"a8l5XydcpG4SjZaoMZi7Hw":{"text":"We ate at K-Paul's on 6/27, 2015 based on positive reviews online and we weren't disappoin","useful":0,"cool":0},"b4vMY_UKm9obfTO83rtNyA":{"text":"It was his jolly and bearded mug that dominated grocery isle before Newman decided to make","useful":3,"cool":3},"7gV1cig7ag5JaB5ugLKRdg":{"text":"Great service and meal of chicken grillades and grits that were delicious! Hubby had fried","useful":0,"cool":0},"amHRL0vMdDVl9jad0bCbiQ":{"text":"This is probably my 15th visit and I can't believe I've never written a review. \nExcellent","useful":0,"cool":0},"GQ5JjG1KTTRDXwlp_4mJ2g":{"text":"Been going there for years and it is always very good.  The service is not quite what it w","useful":0,"cool":0},"nwxfSWOytclnZQMapBrWfg":{"text":"The scene of another group dinner, this was by far the best restaurant I dined at during m","useful":0,"cool":0},"52u9nzb8DHrT5vNuesHppQ":{"text":"Went to a conference ended up going to K-Pauls for dinner. I had the Beef tenders with Deb","useful":0,"cool":0},"BbE-ZIhV8wwJFiSdADRKFw":{"text":"My third time here and it's always good.  I've used the cookbook for many years and needed","useful":1,"cool":0},"QLtE0C9dSZ5SXw6EKRzvJA":{"text":"Foods met our expectation of Cajun style cooking.  Place was attractive and busy.  Foods w","useful":0,"cool":0},"-R6mTyJD7kL8yqZyUOj4Tg":{"text":"This was by far the best meal we experienced in New Orleans. The chefs plate which isn't o","useful":0,"cool":0},"v7e8Boy3JUUNrR9XgmIu_w":{"text":"K-Paul manages to treat its diners to a cozy, quiet atmosphere and legitimate Cajun/French","useful":1,"cool":0},"YjIjO_RPvInwh8TakTW7Yg":{"text":"Been here a couple of times.  This time I had the blackened ribeye, and I also shared the ","useful":0,"cool":0},"4Oqaebe44HNGd-0rF_c4OQ":{"text":"Awesome meal, great service and good drinks.  We were in jeans and T-shirt's and they stil","useful":0,"cool":0},"nsHTAORuoEzkZ2EAOLtAQA":{"text":"This place is delicious. Everything we ordered was exceptional. The staff was very friendl","useful":0,"cool":0},"YRMVrFnTzUIZlfdz-7IHjw":{"text":"Food was 5 stars our waiter Kaiser was deplorable, forgot food orders,drinks and very inat","useful":0,"cool":0},"HZqbQS7EQTJ-C7O_rtD5GA":{"text":"Delicious!! This place has a big menu and lots to choose from. The staff are very good and","useful":0,"cool":0},"-Rc5a3B0LZgDj6tPSptBpQ":{"text":"K-Paul's never disappoints! We walked in after Jazz Fest with 5 people and they were able ","useful":0,"cool":0},"6g4--9PWHUeyGVy5IXaODg":{"text":"It was our first night in New Orleans. My wife and I were unable to get a reservation on s","useful":1,"cool":0},"AJAefInp3q6HceH_SEjcWA":{"text":"Make sure you have reservations. My wife, son, and I came by to eat at 5:45pm (15 minutes ","useful":0,"cool":0},"_xsJKCd8H8jb377wnkhQAg":{"text":"My fiancé and I went there the day before Valentines Day as we don't like to deal with the","useful":0,"cool":0},"b1GVnlxcaCF-SXr7keWdLw":{"text":"This place was recommended to us by a bartender and they didn't steer us wrong. Delicious ","useful":0,"cool":0},"dlCa9mwlcgzJSnNcvi0XZQ":{"text":"Food was ok, had a spinach salad with oysters. The rest of the table had pork chop and pot","useful":0,"cool":0},"l1__rRPuC9dXbi00hUQGMg":{"text":"Very disappointing!! I visited this place and I am a Latina but I felt horrible visiting t","useful":1,"cool":0},"lDZTK5ivPZSB8TW9ayR6YA":{"text":"This is what down home Cajun cooking is all about. Every dish that we ordered had a top le","useful":0,"cool":0},"tEsVljZfr9kwzd-CjngRUA":{"text":"We were a group of 6 and we dined at K Paul's for dinner twice. 4 of us had been to K Paul","useful":0,"cool":0},"zVBTIlRODet6GDiMjdW23Q":{"text":"This was our favorite experience in f our 3 days in New Orleans. The Louisiana Drum was ab","useful":1,"cool":0},"vAQlAAPbLvLZ3dhhKpTYZw":{"text":"This place has been on the top of my Nola restaurant list for years, and has yet to disapp","useful":1,"cool":0},"4vgBp2N2r7uz-ulUuNcZKw":{"text":"The bread was good. The Cesar salad was drowning in dressing and the blackened drum fish d","useful":0,"cool":0},"3zPzppwc0R9qJ3GhVb8flQ":{"text":"Absolutely a great dining experience. Our waitress, Shelia, was a gem. She made the experi","useful":0,"cool":0},"7ZY6f8gS1OHkbRF8KRXz4w":{"text":"Awesome food and great wait staff. We had fried green tomatoes appetizer.  I had salmon, m","useful":0,"cool":0},"ey2uKh8zIu_C_tD_Ugyl8A":{"text":"Why K-Paul was O-Kay:\n\n1)  Semi private room for a large group of ~20 people including kid","useful":4,"cool":1},"kxHjn9DFSrKCIwZ62H5TCA":{"text":"Amazing food with equally amazing service! We loved our waiter Thomas! Starting with the b","useful":0,"cool":0},"puE1JNR4bzRGQ8nxxNpKuA":{"text":"Not the restaurant it used to be. The food is still good but no longer great. The Chef Pau","useful":0,"cool":0},"fYFUTYOE-e5KVjBsi9vp6Q":{"text":"Came here for a quick lunch.  This is a great place and at lunch they have quick \"deli\" st","useful":0,"cool":0},"RNwH0reQQLZIW_YbIZiYKw":{"text":"We had a wonderful meal tonight with top notch service from Leighanne. We started with sau","useful":0,"cool":0},"mt-L4hYdBnAy1-3WZuQf4A":{"text":"I came here with my fiancé and I was so happy I did. Being from New Jersey I was excited t","useful":1,"cool":0},"yEhVqX7YKC6KWuShRaJmjw":{"text":"This is probably my 15th visit and I can't believe I've never written a review. \nExcellent","useful":2,"cool":2},"GDQivDS2hGHyG-f36_1FkA":{"text":"Myself and friends celebrated my birthday dinner at K-Paul's. It was everyone first time a","useful":0,"cool":0},"WqGJ7bmQ4aHkT4uAKJfsow":{"text":"Unfortunately, one star is far too generous of a review for a restaurant that has so littl","useful":2,"cool":1},"ALKZyh0o6C7NyDkfmeWevw":{"text":"The place that made blackened popular.  The food is fantastic!  This was the beast fish I'","useful":0,"cool":0},"5RXzWGg9Dv4ZK4gPNNiLcQ":{"text":"Absolutely delicious! We came on a busy Sat night and they kept apologizing for the wait. ","useful":0,"cool":0},"hQeBszTbpjROn4IJBoY-mg":{"text":"Excellent gumbo.  Rue was fantastic!!  Jumbolya was outstanding.  Great atmosphere  servic","useful":0,"cool":0},"1P3HmyXRB0cGQdTFBKXYAw":{"text":"When we first went there when chef Paul was still alive the food was awesome but over the ","useful":0,"cool":0},"M5PXnYIzjrsVyhyRAtPFYw":{"text":"Very very good food. Great service.. Highly recommend the turtle soup and make sure you ge","useful":0,"cool":0},"xJildfSAywTdtnta-Bpafw":{"text":"Ok, let's just say from starters to dessert all our meals were outstanding.  In particular","useful":0,"cool":1},"n92daifQvMPkbHKjEG5MOw":{"text":"Review is on the way tomorrow, midnight flight so this deserves a great review. Stay tuned","useful":1,"cool":2},"xzfUREuC0xW6NqBQqvMyZg":{"text":"This was easily one of the best meals me and my friends had in Nola. As long as you don't ","useful":2,"cool":0},"6HOCXP2pk4yPgb4V1fU2Ag":{"text":"This is one of my favorite stops when in NOLA. I was disappointed this time because of the","useful":0,"cool":1},"5sGJW2Bt-rWexR1QXZG8lA":{"text":"You have to make a reservation I believe but let me tell you it is well worth it. This is ","useful":0,"cool":0},"nCixqu7Pf5E5lA2tTLh1vw":{"text":"This place was awesome!  From food to atmosphere to service.  There were several options o","useful":1,"cool":0},"BAdf9eCBQje9djhp5nWyIA":{"text":"First off, the only reason why K Paul's did not get a full 5 stars is not the fault of our","useful":0,"cool":0},"fJ5MrjodbMzKLQ90COQ-Dg":{"text":"Restaurant month meal was the worst meal of the trip. Chef Paul is turning over in his res","useful":0,"cool":0},"2Gn1saWqzeJikmO7iN1zcQ":{"text":"This has been our 7th trip to New Orleans. We have always had at least one dinner at K Pau","useful":0,"cool":0},"EfV4UcJ2W_9y8yitKDDULQ":{"text":"Had a great meal ambiance greatly changed from the original back in 79 but very nice food ","useful":0,"cool":0},"Azwnp4ef4mHkpci7XKfc_Q":{"text":"Frogs leg appetizer was a prize winner. Entree of fish was a very large portion but came o","useful":0,"cool":0},"oOB0goZ-7cKiGWQoESiQXA":{"text":"Not what it used to be. I came here about 6 years ago and it was amazing. This time- good ","useful":1,"cool":0},"wx-T6ySsz7WbOwHe_Ta9HA":{"text":"Cool and iconic spot, however was disappointed with the food quality for the price. Turtle","useful":0,"cool":0},"VKLe-BUZwqAFFahvHV7DzQ":{"text":"Great food but huge portions! You can probably get away with an appetizer and splitting a ","useful":0,"cool":0},"W9mXe93_EA-4e4XcoYnDfg":{"text":"Good flavors and massive portions but the food was a little over seasoned.  Needed a lot o","useful":2,"cool":1},"_mIsUM-KaI0SZebP8U3GvA":{"text":"This is a great restaurant with a wonderful selection of dishes and drinks.  We ordered Fr","useful":0,"cool":0},"Vv03H666hy2cUzTmTItaCQ":{"text":"The place is beautiful as you walk in. We were seated upstairs by the window. Fried green ","useful":0,"cool":0},"d5Is4NHE1jdWQrYk-y7hrw":{"text":"The hype was paid for this place for classification food, it was very average person and p","useful":0,"cool":0},"Sb9jkUyv6GjhSUs5bY4Xzg":{"text":"As a 48.5 year old man, I figure that I have eaten approximately 53,000 meals to this poin","useful":3,"cool":2},"9-13qFeWLFALL8ziCT6VoA":{"text":"Visited K-Paul's this past weekend while in town. What a treat. Everything was pure perfec","useful":0,"cool":0},"UWa39t5yv2nHZPbQLXPcIw":{"text":"Soooo good! I had the Cajun drum and beef tenderloin. Sweet potato pecan pie so delicious!","useful":0,"cool":0},"dIyo2U6jbStgVktgMItd0w":{"text":"We had a lovely experience here. Sheila is a national treasure. The service really was imp","useful":0,"cool":0},"hxX0jBJI3aWzRwKkNRZQ1g":{"text":"Wonderful food, great service our best meal in NOLA! \nAmazing, baked on site bread selecti","useful":0,"cool":0},"BBUk6LhIKbI9qL76zr4GNg":{"text":"I had great gumbo and fantastic chicken.  The lunch set up is cafeteria style, but the foo","useful":0,"cool":0},"LskvZwL2EiKDZQ1vPB1mAA":{"text":"I wish i could submit 2 reviews, 1 for service and the other for food.  Lets start with ba","useful":0,"cool":0},"hvu9B6iWsa5nZlstzJH1ng":{"text":"K-Paul's was fabulous. At the recommendation of our waiter I had the Drumfish and was skep","useful":0,"cool":0},"f5Z4cxaFMK9Nk-nWRwYZsQ":{"text":"Have been going to K-Paul's for over twenty years and it is simply the best restaurant in ","useful":0,"cool":0},"Prz2jt2XfmRIaBfuwwY7_Q":{"text":"I was pleasantly surprised by my amazing tasting dinner the other night. I'm so glad my Ub","useful":0,"cool":0},"aYFtCwMgGOJ3FJ1vlq9htA":{"text":"What an incredible disappointment! We remembered this place as being incredible. This time","useful":0,"cool":0},"6-pQZ6gw79twTGwOiwHq3w":{"text":"Called day of to make a dinner reservation. We even got balcony seating. I loved this plac","useful":0,"cool":0},"Qv0cWvV28395W3MBDbZlKw":{"text":"Came here for lunch. Poboy.  Oyster was better than the shrimp. The crispy potato skins we","useful":0,"cool":0},"fQ8yq-YuzIV-9PRhxBj6xw":{"text":"Always great!  I love this restaurant and the food.  Service is always great and the food ","useful":0,"cool":0},"N902h3nunnVcL0_QVgaPiA":{"text":"I made a reservation on November 24 for December 26.  Tonight, upon arrival with my five o","useful":0,"cool":0},"fguljpO7RYUjJyAdQfkiuA":{"text":"Best mashed potatoes EVER! I love everything about this place and dine here every time I a","useful":0,"cool":0},"vXp9BtsUHV9r6bCmkL-dCw":{"text":"This is not going to be a traditional review. It's a long, touchy-feely story, and I'm a f","useful":8,"cool":11},"_ve6Yt1Xqagfd94SvZBIng":{"text":"Excellent meal and wait staff! \nI ordered a chicken dish with a peppery cream sauce, that ","useful":0,"cool":0},"LikEgwxJbWWqHB89ePX0fg":{"text":"Had a good meals. The apps were good.  The fried oysters were amazing.  I think the fried ","useful":0,"cool":0},"TauGm6LaiWRJHKsWEvy1Uw":{"text":"This place is great. We tried to get in to eat here during our honeymoon 3 years ago but c","useful":0,"cool":0},"wnc34Rb3j8ljKlxyKq0u4w":{"text":"Ordered the blackened ribeye and everything was amazing. Coming from California, I found i","useful":2,"cool":1},"JJ_CldtYpqWgYLfcR8lL0w":{"text":"What should be a 5 star review has been snapped in half because of the surprisingly terrib","useful":3,"cool":1},"CxiKWzRehov8nYUJTmuefA":{"text":"Where do I start!?\n\nAfter both emailing and then messaging the restaurant on Facebook to l","useful":0,"cool":0},"ZMNxHg5Gz3fmHFYf7sw-9A":{"text":"Had to try this place since it has such a great reputation. Did not disappoint as the food","useful":2,"cool":1},"NMhOU46h60vMlumouE92bg":{"text":"First of all, let me commend the waitstaff on a five star experience. Whatever you are doi","useful":0,"cool":0},"pKrtmIJeId0nlwBq2LSBxA":{"text":"Made a reservation and were seated upstairs.  Right off they had a Rombauer Chardonney by ","useful":0,"cool":0},"tSrUzibJyjYswLoVkcqNqQ":{"text":"I came here for lunch one Friday. It wasn't overly packed, but it was busy. The decor is n","useful":4,"cool":1},"PE602VLxSh2iY0yk1woQqw":{"text":"We booked this as our planned dinner out while we were visiting New Orleans and were not d","useful":0,"cool":0},"pesrl7Kj3CTW4FdUq7NOAw":{"text":"I'm so glad we ended up here. All the dinner choices were on recommended lists, but this w","useful":0,"cool":0},"DvvTorpyu0sWYmQfIa3OpQ":{"text":"The last time I was here it was the early 1980s.  Back then you couldn't make a reservatio","useful":5,"cool":0},"B0WieWTHstsjnWtZdnqE6A":{"text":"So last nite my family said we would try a new restaurant, so we made reservations to K-Pa","useful":0,"cool":0},"vL_MyBWwvm8EOqpdBfSsrA":{"text":"If you want classic tradition CAJUN food with an upscale flair K-Paul's Is it hands down..","useful":0,"cool":0},"RqwgScRTbnPkM8FPBC_sbw":{"text":"K-Paul's reputation is well-earned. Food and service were impeccable. I particularly enjoy","useful":0,"cool":0},"AjErKL3xesL3BE_daqADjA":{"text":"My first official night in New Orleans my colleagues insisted on going to K Paul's for din","useful":0,"cool":0},"CoZqR56MOcCw088iDsQi8w":{"text":"Overall fantastic experience here. The service was outstanding from the presentation and k","useful":0,"cool":0},"L8RYM5V5TG6Bc2fumnpSjA":{"text":"Disappointed. Not impressed with the service or food. We literally waited an hour between ","useful":0,"cool":0},"l-Caalq76XDxgSg3g2-H-g":{"text":"We tried to make a reservation on open table but couldn't. We called the restaurant & got ","useful":0,"cool":0},"MNtFHvnUWH6NT7iwgSsmbg":{"text":"Right now - grab a dictionary and look up \"fine dining\". You will find a menu from K-Paul'","useful":0,"cool":1},"DYD-UV7cgNLY_TgTRKPSdA":{"text":"We made a reservation for four and were there for their Coolinary menu.\nThis restaurant is","useful":0,"cool":0},"BFUuUjUHz5Nl1XKrEN-Ggg":{"text":"Not somewhere you can afford to go regularly, but a true NOLA experience with homestyle re","useful":2,"cool":0},"jOZIqWoM0NMH3yrBj4sM3A":{"text":"I was here during the lunch menu. Their menu is different than the dinner as we were hopin","useful":0,"cool":0},"6AiBt8r8fff1zKKqemg0dg":{"text":"Very good food. Service was superb. We had the rabbit appetizer, tomato salad and the blac","useful":1,"cool":1},"zG4eH5kVfl-pDZenVebpCw":{"text":"Our experience was mediocre; decent service and decent food. No more, no less. Breading wa","useful":0,"cool":0},"fCD1XUF4FBcUc6JCTBaqhg":{"text":"Enjoyed a solo dinner seated at the bar, waited on by Sean, who couldn't have had a better","useful":0,"cool":1},"Pm5ucIk2LIzLlbn42aHJeg":{"text":"This is still a good restaurant but you can tell the original chef is long gone. Most dish","useful":0,"cool":0},"YHn_tVQFPPpdGX98fZPDuQ":{"text":"Fried Green Tomatoes \n\nSurf and Turf (Blackened Drum & Beef Tenders with Debris)\n\nCreme Br","useful":1,"cool":1},"iVF6P7Cr5K64HWYXLYTIuw":{"text":"BBQ shrimp & oyster entree was  \"off the chart\" highly recommend this succulent dish . The","useful":1,"cool":0},"1LWIMmRrNNmr9hm3tcbJPQ":{"text":"I love this place and go every time I'm in NOLA. This is the place for fresh fish, done Cr","useful":3,"cool":1},"j26UqYbjGUwKas9fi1lL8A":{"text":"There was nothing at all to complain about.  The service was exceptional.  I like the 'one","useful":0,"cool":0},"6f7HO-8yXCkw7sTYVFq4jg":{"text":"I got curry duck and shrimp a tad spicy but good the bread basket brought to table was fil","useful":1,"cool":0},"YHQosKZvJjvmsrZEEnKyeA":{"text":"I started coming to K-Paul's over 20 years ago and I've enjoyed watching the transformatio","useful":0,"cool":0},"-y4neWh_PCNO64sXu7Sj2A":{"text":"From the sweet corn rolls to the melt in your mouth creme' brulee, K-Pauls does not disapp","useful":1,"cool":0},"ctMLR-CraWvdE3cymClOBQ":{"text":"Fantastic meal! Crawfish and corn macque Chou, followed by blackened drum topped with lump","useful":0,"cool":0},"QWhC8fDxAXvdF26uNfpZbQ":{"text":"Wow... Where to start. We made a booking for dinner and once discussing with the host and ","useful":2,"cool":1},"2UsXE3ZEQh_e6ChCIHDkpg":{"text":"I've been to this restaurant at least 5 times over the course of the years, vacationing in","useful":2,"cool":0},"GGV5pAO0hJOjkeBhrHMxWg":{"text":"I was glad I finally got to go to K-Paul's. However, it was pretty sad that he passed away","useful":1,"cool":0},"-4D7HbNjvl9pKY-Jp7cW5Q":{"text":"The food here was fantastic. Went with two others and everyone enjoyed there meal. I have ","useful":0,"cool":0},"ztQvZ7dTArtU5iHZ9ujZ_A":{"text":"What a great night! Food was AMAZING!! Am gluten free so had the blackened Red Fish OMGOSH","useful":3,"cool":0},"CJEp7JgY7fLDrlKuYz7okA":{"text":"I don't understand the hype.  the food was simply mediocre - the wait too long, the seatin","useful":1,"cool":0},"hAhiVT00JrUvBs4sXPA8-A":{"text":"The BF and I came here for our one year anniversary dinner and we loved EVERYTHING. I wish","useful":0,"cool":0},"EZCtPaVrnTsqRcSQSjNj8w":{"text":"Soooo FULL~!!!\n\n* WHY - Comp bread basket = sweet cornbread, jalapeno cheddar biscuit, car","useful":6,"cool":6},"9NDx33-k6DHCDAb9BgtlCg":{"text":"Date Visited: Saturday, April 18, 2009\nTime of Day: Lunch\n\nMy coworker suggested I visit K","useful":0,"cool":1},"X2ckInlot2FaEIpAqd9AJA":{"text":"Ask for the jambalaya! It wasn't on the menu as an individual item,  but they'll bring you","useful":0,"cool":0},"dy-3d37EuPhzljOWAJRd_g":{"text":"As good as it gets for Cajun/creole food.  Great service.  Good ambiance.  Very tasty and ","useful":2,"cool":2},"bm3RJczilwt8kAOzjaqprw":{"text":"Overwhelming menu for a newcomer - I wanted to try everything. I had the blackened strip s","useful":1,"cool":0},"j8b5cR_Njg7iBdvR0oYyYA":{"text":"The fried green tomato appetizer was really delicious and interestingly the sauce tasted a","useful":0,"cool":0},"X2IZSQuWasvOl5wCRSFjiw":{"text":"Enjoyed a delicious, high quality dinner last night at K-Paul's!  Read plenty of positive ","useful":0,"cool":0},"_NvJs4giZlk3Ioesm7P1Yw":{"text":"I was really excited to try this, it seemed like one of the few legit not touristy New Orl","useful":0,"cool":0},"YKNrjqOYry3GJ5Empq--qg":{"text":"My daughter and I have been coming here for the past 18 years.  When Paul Prudhomme was al","useful":0,"cool":0},"FPG0Od_Pocb3_leS7MTIZw":{"text":"The deli style lunch gave us the opportunity to have amazing food at reasonable prices.  S","useful":0,"cool":0},"yFPj-rO-N9JOwy7hMru5gA":{"text":"You have to stop here for dinner. This place is great. The wife and I enjoyed our meals. I","useful":0,"cool":0},"a_RQGcULIY7wFNf7-3mDYQ":{"text":"Truly an amazing dining experience. Make sure to ask for Eldric. He will make sure you hav","useful":1,"cool":1},"2yMiX6T7aCJYVi9PeEwwOA":{"text":"The gumbo here can't be beat.  So awesome.  The bread and biscuits also very good.   Littl","useful":1,"cool":0},"k_Fk3yfXQLT747q6bBW5fg":{"text":"The food was marvelous.... But our server- Sheila- was just extraordinary! Lovely evening ","useful":0,"cool":0},"yD7xjdAoNR6Ts-62_SdFQQ":{"text":"I didn't think that the prices were too bad. I had the Fried Sunken Eggplant Pirogue with ","useful":0,"cool":0},"2sZ4GBZb1LQIDTgiTdMN3w":{"text":"The food is phenomenal!!!!  I love the sweet potato pecan pie - what a treat!  The steak w","useful":0,"cool":0},"8-up9_BMOCb_5Y_cz5G-RQ":{"text":"Back in New Orleans again and went to K-Pauls for lunch twice and dinner once. They never ","useful":0,"cool":0},"sXaaFFmVq8wSrw8TvGp65A":{"text":"co-worker took us to this place.  Don't know how much it cost but I suspect it's $$$$.  Ha","useful":1,"cool":0},"FsrKPIRo8lEVcznjMpcUwg":{"text":"Upscale restaurant, entree portions were big.  Our waitress was incredible,  which is the ","useful":0,"cool":0},"BZ2yS7byYW5a5b2JnDtAQQ":{"text":"This is my favorite restaurant in New Orleans... and I get around. Almost all the entrées ","useful":0,"cool":0},"CcCff6lqy8RGzXhE0CcuEg":{"text":"The food here as particular flavor. Most of the menu is influence by Cajun roots. Honestly","useful":0,"cool":0},"WEDG6W6bNZantuGzQKz17w":{"text":"Learned about this restaurant on a Food Tour so I decided to come for dinner on my last ni","useful":0,"cool":0},"YFsoWEt6yd5R0d-eNdDpiA":{"text":"Service was great was there last year same time. Wasn't as happy this time ordered drum (f","useful":0,"cool":0},"Gzc3PDvtSarFfFFBh8Q01Q":{"text":"I was really looking forward to eating here. It was good but not great. Ambiance and servi","useful":0,"cool":0},"tfxIKC7oQKCKdQ9kbhJqQw":{"text":"I love K-Paul's. Everything I have ever eaten here has been exceptional. The service was s","useful":0,"cool":0},"jKwxA8qmxLId3VV5chnS3A":{"text":"Solid food - but not the cajun dream meal I was dreaming of..\n\nI made a reservation for Ma","useful":1,"cool":0},"XBUu-e8ozXOLyzEjldgdgQ":{"text":"This is one of New Orleans best restaurants. You will not leave hungry and it is consisten","useful":0,"cool":0},"Bkd2VSpJFwBEkrav2wUQ3g":{"text":"Cheap deep fried food from a box. No taste. I ordered the crab cake po boy and it was noth","useful":0,"cool":0},"30txygnSnhHALkguUCHdsg":{"text":"This restaurant is a solid 4.5 stars in my books, but I'm conservative when it comes to fo","useful":1,"cool":0},"V0aQEP1Ig0V-jNqyJ54pkA":{"text":"Great service, very good food.  I had the surf and turf which was tender beef and drum fis","useful":0,"cool":0},"3DyacfUY9xd8y2Yqcfcc9g":{"text":"On our first night in Nola we thought we would try K-Pauls to start our trip off with a re","useful":0,"cool":0},"Q3-DEBSqPkAXK9lCvLM3CA":{"text":"Gumbo was flavorful and hearty.  Jambalaya was really good and moist not dry like most res","useful":0,"cool":0},"Bf9h1zmaQLZgeJi6zdBa0w":{"text":"Who dat? He wit da full stu-mak! \n\nFantastic ambiance, friendly staff, and food that is sa","useful":2,"cool":0},"HI1QXGvaLzEIvuBcpkb55g":{"text":"The ONLY thing bad about K-Paul's is the fact that it's 400 miles away. With all the amazi","useful":4,"cool":5},"cWtdNc_PQPlT2Upv-Yogvw":{"text":"Colour me unimpressed. We got to New Orleans, and we were seated immediately. Go them. The","useful":0,"cool":0},"xlMF1O79g210wAZTi-rd4A":{"text":"I love Emeril and his restaurants. But some people forget that the renaissance in Cajun / ","useful":0,"cool":0},"nrLsWNmWOnXFfrjpiGhg2Q":{"text":"This spot is so delicious! We were looking for a place for dinner and ended up going back ","useful":0,"cool":0},"Wk8RhMZ_tyfGn_xFmjQO0A":{"text":"The magic seems to have passed, or at least lunch is not the meal to come for. This is my ","useful":1,"cool":0},"DrtH70wXpvCYuG256p67DQ":{"text":"Best meal during the 2012 NYE celebration weekend. The service was great, attentive but no","useful":1,"cool":0},"awkL5lo-M9nF5A9_gqjxfw":{"text":"Went for lunch on a Friday. Very disappointing. Fine dining but with plastic cutlery, cent","useful":0,"cool":0},"FQ7G-da9aznBfjWFueLbIw":{"text":"Enjoyed my meal at this restaurant. I ordered the Louisiana Blackened Drum for my main dis","useful":0,"cool":0},"b3MqUzv_qXMke9TZBdh7FA":{"text":"Walked right in without a reservation and landed a spot at the bar.  Dining solo is always","useful":0,"cool":0},"H3xuwNYaj28TNOgH-yrkfQ":{"text":"A must while in Nawlins. No reservations needed for lunch. Deli style service at the bar. ","useful":0,"cool":0},"gBOjiB8UJKK1YAA2-FH0Wg":{"text":"The worst service in the whole city. Our \"server,\" Trey had his head so far up his tush he","useful":0,"cool":0},"Td6wdOOghqb-zCe814_0qw":{"text":"We made reservations for Friday night. We arrived 10 minutes early, and we happily surpris","useful":0,"cool":0},"-1V-R7ktKPms7O_rk4UEvg":{"text":"Great tourist trap! Expensive and very mediocre restaurant. \n\nOur waitress could not weigh","useful":0,"cool":0},"yGaZTjfJ5eTNFOWfAvjrcA":{"text":"The fried green tomatoes were excellent, as was my entree but I think one of the highlight","useful":0,"cool":0},"omS-wTJ7SYUF_PQ9JDub3A":{"text":"K-Pauls was one of my favorite meals in New Orleans. It's 100 percent authentic and everyt","useful":0,"cool":1},"lVUsebDq18U3uRRuR9SN8A":{"text":"First time in New Orleans for me. EVERYTHING is AMAZING!!\nI had the chicken and andouille ","useful":0,"cool":0},"dM3Al8sMlNUoJ6BN0rTIig":{"text":"The food although good really wasn't up to our expectations, so really I'd give it 3.5, gi","useful":2,"cool":0},"aQbH07UZBMaKZnjTiZTY4A":{"text":"Wow. Just...wow. Hands down best meal in NOLA by far!!\n\nIf I could have eaten all of my di","useful":0,"cool":0},"83feGTuuFF2WtWcd0Vrttw":{"text":"A good meal can always be found at K-Paul's. The real treat is the service. Our server, Sh","useful":0,"cool":0},"U3w8dy6IyxByOCV1qsFbQA":{"text":"great food lots of choices, great cajun/creole flavors.\nservice was awesome..they have sea","useful":0,"cool":0},"nUQtoAlsu0HBY71Nstaxwg":{"text":"We went to K-Paul's on our honeymoon the last night that we were in NOLA. We were told by ","useful":1,"cool":0},"hRHc5MUqhqgvj2ablKfo6Q":{"text":"Dinner here at K-Paul's was the culinary highlight of our trip to Nawlins. \n\nThe restauran","useful":1,"cool":3},"orfNsY8xh8BlF0lDGbu7eQ":{"text":"Great food. I had the creole with duck and it was terrific. Fiancee had the filet and one ","useful":0,"cool":0},"fHwAfuzDt0W-iunejPYupQ":{"text":"Very good!!! Had the chicken and andouille, shrimp étouffée and the blackened beef and eve","useful":0,"cool":0},"BnDPAdbHZsc4eS636eByTQ":{"text":"Nice menu selection with local flavors. Food is good but not great. Good wine selection. A","useful":0,"cool":0},"gfwdy5A4sHWAm1mb7xH8tw":{"text":"Ordered the soft shell crab and the fried green tomatoes to start. The breadcrumbs used on","useful":0,"cool":0},"dGZKp3VgtGk1St2NyRowUQ":{"text":"Four of us went to K-Paul's on a Thursday evening during French Quarter fest.  Three of us","useful":3,"cool":1},"QN2T2aS1UFJfJV_feIAZIQ":{"text":"K Paul's is a great New Orleans Cajun eatery! Was just there on November 7 th with 2 other","useful":0,"cool":0},"MozXS41fgZkBdyLEALu1yg":{"text":"Made a reservation a month ahead, and had dinner at K-Pauls on the 6 oclock hour.  Greeted","useful":2,"cool":0},"uevDmnP9BtZq3Ds9N99FuA":{"text":"This is the best meal I had in New Orleans. I ordered the flounder with crab Diane, vegeta","useful":0,"cool":0},"8sYiWMS5jxv0svEWGMkFww":{"text":"The stuff pork chops and twice baked potatoes with the brown sauce!!!Superb!!!!\n\nAn excell","useful":0,"cool":0},"pzbTWoIhlv2xLioWKG5ntg":{"text":"Do not eat at K-Pauls. It used to be superb but is not good now. It is living on it's old ","useful":2,"cool":0},"XBhyNZSEOCqNkiwNts5CuA":{"text":"K Paul's has great food. For starters, their bread basket is amazing. I also ordered a Dec","useful":2,"cool":1},"18spGYGekGUdLPKNtWXBZQ":{"text":"This spot isn't 5 star already? Insanity! All of my family has been here on separate occas","useful":4,"cool":2},"rJqSt41DErDzy8xwTYa6Og":{"text":"K-Paul's is my favorite restaurant in the world! This was my first time since we needed a ","useful":4,"cool":1},"CWxpQUv0pWovNCa1f90Rtw":{"text":"Good food and good service, but  we felt like it was pricey and overrated. Can't complain ","useful":0,"cool":0},"chwQS3px0iFRbJfT-x3JUA":{"text":"This was the first nicer restaurant I dined at visiting NOLA years ago, and we come back e","useful":0,"cool":0},"B59nzjtqKVoLTx-Im8QRQA":{"text":"I came in late specifically for the sweet potato pecan pie and was not disappointed!  They","useful":0,"cool":0},"sxfREmIjT67rbRkuMhTX0w":{"text":"Do not miss the turtle soup! I was told the breads are made fresh daily. They were  served","useful":0,"cool":0},"RZAHXxRxcl1OdupgogObCg":{"text":"Had a reservation for one and when I showed up, the hostess \"politely\" suggested a bar sea","useful":0,"cool":0},"UhXKH0pXbhEHIvqxPAkeEQ":{"text":"I eat here every time I'm in NOLA. Never disappoints! The fried green tomatoes are my favo","useful":0,"cool":0},"HsMBESm1CqEdawf_5S61gg":{"text":"Delicious!!!!!!!!!!! The food was amazingly good. Good service and nice atmosphere. It was","useful":0,"cool":0},"hBaDar7hEgQ3uMo1zbHaNA":{"text":"Rumor has it that k-Paul's was once the gold standard of Cajun / creole food in New Orlean","useful":0,"cool":0},"pdTdzjyze4I2KNdg9gFzXQ":{"text":"This place really lived up to expectation. Their speciality is the gumbo and it was delici","useful":0,"cool":0},"BNlLouXncQMnoJzGSkcDcQ":{"text":"A classic for a reason it seems.  A group of four of us dined here last night, mostly allo","useful":1,"cool":1},"rh6PE8QrwvpdDdQPb1upwQ":{"text":"We made the major, catastrophic mistake of eating at Willie Mae's the same day that we had","useful":6,"cool":3},"rWcpI-pg9KXw_SeOGPQ0lQ":{"text":"We picked a great place to eat. The service was friendly and the food was fabulous. Great ","useful":0,"cool":0},"ZRJ551_p5r_hcvRoQh9k3Q":{"text":"Went late in the evening with a couple of friends after I arrived from a 3 week job offsho","useful":2,"cool":0},"V_XL8o6CceIe_oI-P2v1Mw":{"text":"K Paul's is one of the best restaurants that I've ever dined at. The food is absolutely fa","useful":0,"cool":0},"SCNjadFJR2k0FG0uy7LXDw":{"text":"I just had my second dining experience this year at K. Paul's and I was just as satisfied ","useful":1,"cool":0},"u8saQ2YRNiHau2EmBdZCuw":{"text":"This was such a disappointment the menu was not interesting and boring.  Service was ok we","useful":0,"cool":0},"aege7pgvxQj0rhXLIizsBw":{"text":"The best meal I have had in my life.  Considering what I pay for meals half as good in Chi","useful":0,"cool":0},"fc8TvdQ0s83eUBW9GkXa0w":{"text":"I would go back again anytime.  The main entrees were awesome but the bread at the table w","useful":0,"cool":0},"zhb6TlnFK9da82IffoImng":{"text":"I have been to New Orleans many times and tasted many restaurants.  I only ate the gumbo h","useful":0,"cool":0},"f1vfa7AhaKYI5mZIzla8zw":{"text":"Not a good experience.\nWe went there on an early Saturday night in April.  We were seated ","useful":2,"cool":1},"od-5yChItD9enjGNgjdGsQ":{"text":"Everyone needs to try the bread pudding!! One of the best desserts I've ever had. Same for","useful":0,"cool":0},"ItTASUK3lkmE8DRh2nUhqA":{"text":"The rabbit appetizer was amazing! Great bread bowl! Had the chicken with shrimp and the ja","useful":0,"cool":0},"XImodGCLF5j7ahjhq3fBxA":{"text":"EXPENSIVE!\n\nDad had the  fried soft shell crab with a bunch of sauce.  He was happy.  Mom ","useful":0,"cool":0},"rR6oaHnpmPSY3bRjbfSksg":{"text":"I made another trip to K-Paul's this weekend after a fantastic first experience. This roun","useful":0,"cool":0},"1zs3sZsjHlQXP8f3Ctgjmg":{"text":"We had 4 for dinner, with reservations at 8 pm. Restaurant was not busy at arrival time. W","useful":0,"cool":1},"JC_w4ipeMG4dDRNx0ywFHw":{"text":"I ate dinner at this restaurant one year ago and the food was outstanding as the service. ","useful":0,"cool":0},"5Klo4ighiz7MK5x6dwyDtQ":{"text":"Tourist trap. Beware. Food not fresh  lots of heavy sauces. Condescending wait staff. Paul","useful":0,"cool":0},"fFDwkLBpAf9IBE39w8ymAQ":{"text":"Seriously,  too full of themselves. Brenda the general manager couldn't care less about a ","useful":0,"cool":0},"D4WSzh-ueksX78t4nOXykA":{"text":"K-Paul's is one of those famous restaurants that you hear somewhat inconsistent reviews ab","useful":1,"cool":0},"ketxO9Z5CjJ9pk3yDx0icA":{"text":"I had shrimp etouffee and it was kind of ugly looking and tasted a bit boring to be honest","useful":0,"cool":0},"eoShvXRkT1Tg-xrKCvzWsA":{"text":"The food really is to die for.  Highly recommend the blackened drum.  I could eat that eve","useful":0,"cool":0},"0e-EZ9_sGMieU3QQ6MgMMQ":{"text":"This is one of the best places in French Qtr. Came highly recommended from the NOLA PD who","useful":0,"cool":0},"vFiGcurJTD89FnmtkQ3aeA":{"text":"My husband and I had the best meal of our lives here!!! The biscuits they bring out are to","useful":1,"cool":0},"M34SoI6rNKJ6vXloOkdWvQ":{"text":"LOVE K-Paul's! \n\nThe paneed rabbit was to die for! Also great Caesar salad with anchovies,","useful":0,"cool":0},"61MLYcz7MvwpfZYIGOVmrw":{"text":"We had a fantastic meal here. Recommend making reservations it was pretty slammed and they","useful":0,"cool":0},"4QL9QvNuBYztE5wk2oKgJA":{"text":"Love dining here any time I get a chance. Our last visit we ate at the bar to avoid a long","useful":7,"cool":6},"VEnE6SpvmIUsHuDtF9yW4Q":{"text":"Love the atmosphere. Our waiter was fantastic. Our food was better than our favorite usual","useful":0,"cool":0},"wWmkY5rmmOh6WPGDjgQewQ":{"text":"Great food and great service, every time I visit New Orleans I make sure I go to k Paul's.","useful":0,"cool":0},"ygc5KRb6YDv4h_knkGHxSg":{"text":"food was delicious. no complaints. fast service. true southern cooking. desserts were amaz","useful":0,"cool":0},"WWU6G0QQhtw29o_60LBCQA":{"text":"We went here per the recommendation of our tour guide today because he said it had the bes","useful":0,"cool":0},"62S0JYoIOdnbf97F2c8BMA":{"text":"I always assumed Dom DeLuise had a restaurant considering how often I bought those jars of","useful":4,"cool":3},"O1AsjzuMfiSlrIXLiH6M0Q":{"text":"This is and has been one of my favorite restaurants in New Orleans for many, many years. T","useful":1,"cool":1},"CXcHcXpXtjFKvd3VkbYGUQ":{"text":"This is my first trip to New Orleans, and K-Paul's kept showing up as an option, so i deci","useful":0,"cool":0},"Uo1QM3ADttvUj6X2r8pTyg":{"text":"I ordered a Knobby Ginger from the cocktail menu and the Fried Green Tomatoes with shrimp ","useful":0,"cool":0},"b-HgI5f2Na0TIcIJ54SK4A":{"text":"This is one of the best, and now it takes reservations.\n\nCookbook author, TV star Chef Pau","useful":2,"cool":0},"HNNUH77d8Bu3238FcDrafQ":{"text":"K-Paul's is a really interesting restaurant. I can't quite put a finger on what category i","useful":0,"cool":0},"WXiQlwkt7UUyHNSSs5shrA":{"text":"Went for lunch on a Saturday, best shrimp po boy ever.","useful":0,"cool":0},"gK-LJFMXaTdTs05xoLq4Fw":{"text":"This is my family and my favorite restaurant!! Everything was in point! From the delicious","useful":1,"cool":1},"jddc_H9ck3z9F9FpNSv97A":{"text":"Upon entering the restaurant we stood around waiting on the Maitre'd. When she finally app","useful":0,"cool":0},"pwsMIyqkb5yYRGvza3LhxQ":{"text":"K Paul's had been on my food list ever since we touched down in New Orleans, but it happen","useful":3,"cool":2},"B3KM48m2HJ-dZwzPT5OamA":{"text":"I bought a Groupon for K-Pauls and wow was I glad that I did.  This was probably one of th","useful":0,"cool":0},"YFPWO8jxUUrlMZiL4zFDLA":{"text":"Fresh food and kind staff. Very clean place and reasonable prices for lunch. We had a part","useful":0,"cool":0},"ljRjSFq5ZM8vLbryUy0-ig":{"text":"Absolutely phenomenal meal... highlights included the jalapeno rolls that came out, the gu","useful":0,"cool":0},"vA9vdcfi4tpuMWDCQDP61Q":{"text":"This place was phenomenal! Went here last night because my friend made a reservation when ","useful":0,"cool":0},"8yVWfhS0N5wjunnE5GtclA":{"text":"Went with a group of 18, and the service was remarkably even-paced for a group that size. ","useful":0,"cool":2},"AgyyHSbmF0hH_Sa_fLyMyQ":{"text":"I was very excited to try this restaurant when I came to NOLA. The food was OUTSTANDING. I","useful":0,"cool":0},"UOuqnfMxypFCE0Z3OCqizA":{"text":"After a disappointing dinner the previous night, I thought great cooking had left New Orle","useful":2,"cool":0},"Bm-RxLCLkk8M5KS3ODp0SQ":{"text":"You know a place is good when the line to get in starts 20 min before the place opens. Ama","useful":0,"cool":0},"wNnqY_lZIp9EZjrGIn_JNA":{"text":"I stopped here while on a work trip after getting some advice from a friend. K-Paul's is a","useful":0,"cool":0},"Io0t2U8wWyHIl18vuMKf-A":{"text":"Went there for Coolinary and the food was pretty good! Classic New Orleans style food in t","useful":0,"cool":0},"GECOqoZ_zAgUbYCaZ7Zrow":{"text":"My favorite cookbook of all time was Paul Prudhomme's first. ...(Sorry, Betty Crocker)\n\nI ","useful":1,"cool":1},"NNBh5aAgy7BQdMaD7ewQ2g":{"text":"Wow what a disappointment!  Of course we did go to Emeril's the night before so K Paul's h","useful":0,"cool":0},"PWM12SqU5v96BKOXrGnvqQ":{"text":"So we just happened to find this place on a limb and my partner and I absolutely loved eve","useful":2,"cool":0},"60N8d5pwizoTM6jxUQOwJA":{"text":"I called to see if they had a dress code and they said business casual so we dressed accor","useful":0,"cool":0},"CxjVD0sTFS-xxnNAnBI1fA":{"text":"Delicious and the service was spot on!!!  Made reservations a month in advance through the","useful":1,"cool":1},"Swnr-lSvnGSi1lYDfgbsmg":{"text":"Incredible food and service. Jason was our waiter and made the experience complete \n\nHad t","useful":0,"cool":0},"o8pAL28f9jSbsy6BYDfAiQ":{"text":"Was worried about the touristy-ness here, but the food was fantastic! 4.5 stars\n\nCost to w","useful":1,"cool":1},"Y640Ah2niLgajs0RwdWWmQ":{"text":"It was my first trip to New Orleans, a bucket list trip for me. I chose the second Jazz Fe","useful":2,"cool":3},"JMC5a6HqsEWKxKs3LrPphQ":{"text":"A vegan in New Orleans was a scary notion. I feared the thought of not having a good meal ","useful":1,"cool":1},"XdDHrX-u_2wE731g2clDrw":{"text":"My wife and I always come here whenever we get to New Orleans. Tonight our waiter was Thom","useful":0,"cool":0},"Jg2Ke-unitxT2K05Cv5UIQ":{"text":"Horrible service!  If you want to be ignored this is the place for you. We sat there for 1","useful":1,"cool":1},"DABKPp5gbRsZF6lnhALeeQ":{"text":"I always stick to the same places when I visit NOLA. I finally ventured out of my comfort ","useful":0,"cool":0},"bMpQQnvYBuYwNi_tld8GUw":{"text":"Excellent. I was torn between the swordfish and the steak. The waitress then offered a sur","useful":0,"cool":0},"miarUmknT_FD-xFm4jMQeg":{"text":"Outstanding!!!  Perfect, and exactly what we were seeking.  I've always been a fan of Paul","useful":0,"cool":1},"SiEv3kSaFCk4gNVjUs69yw":{"text":"We had an 8:15 reservation last night. We were quickly seated. Service was fantastic! Brea","useful":0,"cool":0},"RA8T0Qb2QcT8skGpf6z0Dg":{"text":"When asking my mom and husband what restaurants I needed to check out on my recent trip to","useful":3,"cool":1},"ReDXiEHi27o1R1dNph8b6Q":{"text":"Ok I admit it. I discovered K-Paul's while watching the Travel Channel show, \"Food Paradis","useful":3,"cool":4},"KO5XKfLgKJ1kKOBHHoK6sA":{"text":"Amazing food and even better service.. 5 star food with 5 star service. Ask for server Kei","useful":0,"cool":0},"8gYvy3HJMJzpSBV9VsEJMQ":{"text":"This place was great. Will absolutely be stopping by here every trip to NO. Right in the F","useful":0,"cool":0},"YUAZzTdXqzTWJFHwoPF4uQ":{"text":"Exceptional! Wow, true Louisiana cuisine. \nMake a reservation - restaurant is normally ver","useful":5,"cool":4},"7jgRaWMY-JrqqFmomqIW7Q":{"text":"Such a great place! Food was exactly what you hope to find when coming to New Orleans. Ver","useful":0,"cool":0},"TYcm0-TGCvqavEDSAdXPpg":{"text":"For finer dining in the French Quarter, K-Pauls creates some of the better dishes.  I had ","useful":0,"cool":0},"Ux_i7yOdmPCXs7LHeI0Ang":{"text":"I just received a memory in my phone from a meal I had at K Paul's two years ago. I've bee","useful":1,"cool":4},"vXCHF5lpKInHvZLYCw70iw":{"text":"Sheila was absolutely AMAZING! We weren't sure what to order so she hand picked our whole ","useful":0,"cool":0},"MzDH_rOHOr5-arw7YJPZwA":{"text":"Dined here for my birthday a couple of years ago and what a great experience.  Tried the f","useful":0,"cool":0},"6Hy5_TKN6YusbGBCtbVRfQ":{"text":"Nice atmosphere with great service but the food is more touristy than great. Nice wine lis","useful":0,"cool":0},"A4Qb4PK4ITC1ItYcpomjMA":{"text":"We looked forward to dining at K-Paul's for our last night in New Orleans but we're very d","useful":0,"cool":0},"yXKRsLqxJ3ut2uNrgjb8lw":{"text":"Enough can not be said about the amazing experience we had here. Absolutely one of our fav","useful":3,"cool":3},"NrNE0D2_gaXsaKKOjIwNOg":{"text":"Great service, nice ambiance!  The bread is so delicious!  The flounder was excellent.  Ja","useful":0,"cool":0},"yw0mES9KW81FrtBme7pK0g":{"text":"BEST DINNER in New Orleans and totally unexpected. I chose to go based on the Yelp reviews","useful":5,"cool":2},"9mqUqqIF-6ULQ-ITx3t5CA":{"text":"This is my second trip to K-Paul's.  Walked without reservation.  Seated promptly at a nic","useful":2,"cool":0},"ZaBAoi5mVhqesyL_ZoOF7w":{"text":"This restaurant has been on my bucket list for 20 years! Paul Prudhomme has been my idol t","useful":1,"cool":0},"UqdDE45qfrwCJwrgrPw-Aw":{"text":"Getting ready for a return trip to New Orleans and realize I never submitted a review for ","useful":0,"cool":0},"P3zsim2MSgUEu9OXDxHSnQ":{"text":"Ok, Ive been living in Atlanta for the last 10 years and finally I got the chance to visit","useful":2,"cool":1},"7pyhdSG7WXGC9B1BZIa0Qw":{"text":"Heard so much about K-Paul's back in Los Angeles that it was a must visit restaurant in NO","useful":0,"cool":0},"yBsT-9G6Qmpm2-QD5LNAQg":{"text":"Wonderful experience. Be sure to make reservations, the place filled up fast, even on a Tu","useful":0,"cool":0},"yHqlpTdSd83ImQjIMUoDQw":{"text":"The food was outstanding. We had the tuna with fried oysters, turtle soup, & duck. Everyth","useful":0,"cool":0},"67mLYwLDkgGN1xSRpgoq3g":{"text":"Upscale, classic cajun/creole dishes that leave you begging for more. \n\nGenerous portions ","useful":4,"cool":4},"YAYte8ciGj4_W4RtZkkTNw":{"text":"Not quite as happening as it was when Paul Prudhomme was turning it into a New Orleans lan","useful":7,"cool":5},"hEJnr9BLhcSV9ka9rLVZ-A":{"text":"My husband and I made reservations for our anniversary dinner here. Friends had recommende","useful":0,"cool":0},"uXEzywpFwgaGS4fTtPguCA":{"text":"K-Paul's was recommended to us along with a few other restaurants by a friend who is a loc","useful":1,"cool":0},"c5ZEn2IR6I-JWAT7rwG84g":{"text":"Excellent service!  The food was good, but my husband and I agree that it was a little on ","useful":0,"cool":0},"jXMmHQmk8o3hJ27ATtTX3Q":{"text":"Turtle soup was excellent. Fried green tomatoes lovely. The blackened drum lived up to the","useful":0,"cool":0},"hp5xPt5BsiHciZH9LnyxGg":{"text":"One of the more celebrated eateries in NOLA, founded by late Chef Paul Prudhomme. I'm glad","useful":0,"cool":0},"kRmsIWNMRnJsNDRRUBt3kw":{"text":"RIP Paul your famiily carries on your great tradition\nSorry to hear this place is closed f","useful":0,"cool":0},"Uj8A2JraU3xk7EqCGwtCMg":{"text":"Martin Luther King Jr. once gave a speech where he uttered the immortal words, \"I have a d","useful":1,"cool":1},"v3i4v_Hgul8pXz-GbW6d0A":{"text":"Just finished dinner. Writing this review as I'm in the restaurant. Service was - well he ","useful":1,"cool":0},"Z_XKLXOKAVdpWWpU-s9jbA":{"text":"4.5 Stars. The wait is over. I'm a fan and you will be too. Go in the evening time and enj","useful":1,"cool":1},"I3EaQRQdyJrmTFad-siUsA":{"text":"This restaurant is in the middle of downtown so be prepared to pay for parking or have to ","useful":0,"cool":1},"LlplLId64IHZeJtT4pGy3A":{"text":"I am way, way overdue to write a review of K-Paul's.  However, since my Yelp profile lists","useful":5,"cool":5},"z3CHtY9E_d-ivzyiKxTAdw":{"text":"Never fails to deliver an awesome dining experience! For all the WONDERFUL seafood dishes,","useful":0,"cool":0},"js5OT-UsXjVCBTu8tWQCcA":{"text":"This is my boyfriend's favorite restaurant in Nola. Notable favorites in list form: \n- Bre","useful":1,"cool":2},"NDGkRGSI9NV0sm4f6VlsQw":{"text":"Just phenomenal. Rabbit tenderloin appetizer with a creole mustard i wanted to drink. Gumb","useful":0,"cool":0},"Ad1D1lB9Eyxdds_Z3-S-fg":{"text":"The best Blakened fish I have ever had! The potatoe and leek soup and the turtle soup was ","useful":2,"cool":0},"7OvsFgpWaa4v31MjKxYfTA":{"text":"Excellent! Had curried chicken salad for lunch, best I've ever had. Like the informality o","useful":0,"cool":0},"uYdVK0_8BeJi4YGpc9xTKw":{"text":"From one of the best chefs I have experienced, the food at K-Paul's  is fantastic, overtly","useful":12,"cool":8},"ycIFgpkC5HuOCC32TTJHlA":{"text":"This was the best food I've ever had! First time going to NOLA and was told we had to chec","useful":0,"cool":0},"qDsmm3sAN8fdeu3B0xZEqg":{"text":"There was a lot of hype surrounding K-Paul's, and it did not disappoint! Came here for a w","useful":1,"cool":2},"TC8MRycwiGMGVJZ5pyuUBA":{"text":"The food was excellent, but the best part for me was the service. We took a leap of faith ","useful":1,"cool":2},"a4q59NugXSO73wsGwkXrKw":{"text":"Here's a disappointment, I selected this restaurant as I have eaten here many years back. ","useful":0,"cool":0},"RwdzbdXbjvSm9SqA3e6YQw":{"text":"We came to NOLA to celebrate our 5th Anniversary.  My husband and I have always been a fan","useful":1,"cool":0},"CULirDC4_aXpBC69dGLJIg":{"text":"Saturday night in August, 8:15pm reservation, seated at 8:19.  Our table was on the second","useful":0,"cool":1},"BjvMj5GlcJ_0HkikOjX_8g":{"text":"Bear with me on my review as I take awhile to get to the point (brevity is not my strong s","useful":1,"cool":1},"N6s1-ILqbxd0P1LoXceR2Q":{"text":"I have followed Chef Paul Prudhomme since I first lifted a spoon. Unfortunately, he has mo","useful":1,"cool":3},"ZjKiPPLVCSpy938luJ9sTw":{"text":"I was pretty excited to try out K Paul's after I read the menu online.  Sure, he's a celeb","useful":3,"cool":1},"1KoJ7oSCds9z-jSOLVam4w":{"text":"Stopped here for Valentine's Day. Great seating and lighting, perfect for a romantic night","useful":0,"cool":1},"M9B5TgRXK-qj4MBtra_HIg":{"text":"Wow! This was definitely my most memorable experience while visiting NOLA. The food was ex","useful":4,"cool":4},"Qq5mzcZZ3ArptAOGLcAOWw":{"text":"This was an adventure for me since I've never eaten \"southern\" food before, but I wanted t","useful":0,"cool":0},"_GSMNXeu7H04pPLF0YxNWg":{"text":"This place is amazing! The food is delicious with every bite! Our server Nicole was incred","useful":0,"cool":0},"oqJYjlqMicLinKwAy74vvw":{"text":"It's not the same joint as when the chef was  still about. Service had gone all self servi","useful":0,"cool":0},"IEaOcz4kogiceUIViQQFMg":{"text":"Fantastic food in a decent space with ambiance that tends towards more fun and casual than","useful":10,"cool":7},"_U9U46_NoaxmyTCPFjvU2Q":{"text":"K-Paul's has been a favorite of mine for years. While in the French Quarter I always make ","useful":29,"cool":24},"QVW32RUWT6-Uo25zW-RbFw":{"text":"It was our first time visiting New Orleans when we stumbled upon this restaurant. The food","useful":1,"cool":1},"RZXEuTU3SDgIyJwe7B2xzA":{"text":"Was seated immediately at about 9pm but waited a good 15 minutes to even see a sever ackno","useful":0,"cool":0},"HWNC_JIL134ensCtlbKXgA":{"text":"Holy Fuck!!! Magnificent food, service and ambiance. Wow, I'm blown away with everything K","useful":0,"cool":0},"hZZzSOCy2fjZ4TQeXKu85Q":{"text":"My boyfriend and I ate there for Valentine's Day and it was the perfect spot! An intimate ","useful":0,"cool":0},"eC_02hvyEO6pltKwYUzggg":{"text":"Wow!  This was a great place to visit and lives up to its name and legacy!  The staff are ","useful":1,"cool":0},"hi2TI9o2sVvRurSXyUpjvw":{"text":"Heartbroken this is closing down after 41 years....this place was amazing. Amazing food, w","useful":4,"cool":1},"TNRA2ujvWotwkn17eLyWgA":{"text":"Great food. Large portions. Amazing turtle soup and gumbo. The KPaul's surf and turf, blac","useful":0,"cool":0},"6NVXcGg3HJbOoRD5fnfVkg":{"text":"If in New Orleans without a heart condition this is a great place to get one. The food is ","useful":0,"cool":0},"bo9AnNYzDfY0l7e9tqaC5w":{"text":"My friend and I shared the fried eggplant seafood atchafalaya. It was amazing. Every bit o","useful":1,"cool":0},"pSLVhbe5hc8MRKOCjs-ytg":{"text":"LEGENDARY home of the \"blackening\" cooking method;\nDELI STYLE LUNCH MENU is haute cuisine ","useful":7,"cool":11},"pS2PYItqLym2ZuQ2qju6zA":{"text":"The waitress was a ding-bat...When we looked over the menu, the four of us ordered a few i","useful":0,"cool":0},"iqt3Dw_EyPWzi4FrS8HRsQ":{"text":"It's unfortunate that one of the waiters, Jason B, treats certain patrons with more respec","useful":2,"cool":0},"EXAWzuw4xgn0OA4-yOC-qg":{"text":"Fantastic food! Fantastic wait staff! Fantastic kitchen staff! 'Blackend dishes can really","useful":0,"cool":0},"fOLIIBOkN9v7EquB9secyg":{"text":"I had heard lots about K Paul's, from friends whose palates I respect, so we checked this ","useful":3,"cool":0},"0_YQ7unughtMsw5rbTasdg":{"text":"Came here as part of a big group and the food was awesome. The fried green tomatoes had on","useful":0,"cool":0},"2JnPGCK1DaI4EKKaUw44Mw":{"text":"LOVED everything about this meal! Fantastic service from start to finish by our server Day","useful":0,"cool":0},"VEM3MZ0CgWxuizx0FHqQXQ":{"text":"Haven't been here in many years and was disappointed this time around. In the past had alw","useful":1,"cool":0},"Z9PtKcNyqiPJF6dmAdFVpQ":{"text":"Compliments to the chef! This was delicious. I went for the salmon and fried oysters. It w","useful":1,"cool":1},"U4E4Zg1vDrB8x39ATI-lmw":{"text":"While in NOLA, we had to visit this restaurant. So many different sites said this place wa","useful":2,"cool":1},"lUmJ-krtK9QkTLUbQsbEFg":{"text":"Items ordered:\nJalapeno Roll, Butter Roll, Sweet Cornbread, Carrot Cake Pecan Bread with W","useful":7,"cool":5},"wZJxfPopjcMi6Actb8rA0A":{"text":"My friend kept raving about K-Paul's, and after so many days of eating southern food, this","useful":1,"cool":2},"Le8mH_jLbINdamw8rVetxw":{"text":"Tried K-Paul's last night for dinner. I am in New Orleans for a few days to celebrate the ","useful":2,"cool":0},"Ba0UnK3nFUZ9AiQcFFh8fg":{"text":"We have been going here literally for YEARS\nOnce again it never fails to disappoint.\nFirst","useful":0,"cool":0},"YlRadVSrIxMYoSygAg_gdQ":{"text":"We had a party of six here--not too big, and just the right size that you would think the ","useful":0,"cool":0},"b70z5A7U5eYULxub0HU-sw":{"text":"New favorite New Orleans dinner spot. I had the Blackened Ribeye. Delicious!!! Best steak ","useful":0,"cool":0},"CsGswKPW1dhvjToBFET_fg":{"text":"Very over rated and not so much blackened on the menu!  The drinks www the better than the","useful":0,"cool":0},"KfPTVf6OvSLQewwFEJQqUg":{"text":"The food was outstanding, as good as New Orleans cooking as you'll find anywhere in town. ","useful":0,"cool":0},"D3ot4HKeFvqR5FyO6V7tIw":{"text":"Transcendant food experience!\n\nChicken and andouille sausage gumbo\nI love the dark roux th","useful":4,"cool":2},"UvBGkHeBW3nuiiLxcLQvdQ":{"text":"We had a wonderful last evening in Louisiana thanks to K-Paul's. Our reservation was made ","useful":2,"cool":1},"FsT79Ay9wwnkUyJL1zhIjw":{"text":"Meh. The best part was the bread (really really good!). The atmosphere wasn't my favorite,","useful":1,"cool":0},"K5VkuvskymfSaSEJYtYoug":{"text":"This was my first time in K Paul's since chef Prudhomme passed away. It's just not the sam","useful":7,"cool":3},"v9AddGGil7hECdtHqmuYFg":{"text":"What a great restaurant this is! The small, simple & humble sign on the outside, gives no ","useful":1,"cool":1},"GzH-asGOBXk9C39EwXs-gw":{"text":"I have dined at K-Paul's many times through the years. I consider the late Paul Prudhomme ","useful":6,"cool":2},"atKdaxJzt4xKN9wQTfDSmA":{"text":"A complete disappointment. You would expect something really good from a place that has ac","useful":1,"cool":0},"rzIk6P1RtOIKc7QrB38XWg":{"text":"First time here.  Looking for a place that tops Louisiana Bistreaux's blackened ribeye in ","useful":2,"cool":0},"z8rwlgpm3RH32u_I2Rl--g":{"text":"Best turtle soup! The service was fantastic our waiter (Thomas???? Name???) was incredibly","useful":0,"cool":0},"b7loJeB_qfFL_PUZhLitVQ":{"text":"Food was amazing! Service was whack. \nWe had 8:15pm reservations with our guest of honor a","useful":4,"cool":0},"0KOb-LLEIQ9a6SsOI6WkgA":{"text":"K-Paul's is traditional cajun cooking at its best. The menu changes daily and the food is ","useful":0,"cool":0},"bqa69JnN3LFEpaDmA5V1Ow":{"text":"On our last night in New Orleans, my friends and I were debating on whether to go to Gumbo","useful":4,"cool":0},"gZhCA5sZMXdq026MLhGdkw":{"text":"One of my favorite restaurants of all time. Thank you for the memories. So sad to see this","useful":0,"cool":0},"oS9EOPjdffDYslE8NQDJGw":{"text":"K-Pauls was our first dinner after touching down at MSY. It came highly recommended to us ","useful":4,"cool":6},"NQFMHHR4Sn0FGCvDg-hxEg":{"text":"This may be a tourist trap but it's damn good!! First time I came here I ordered a vegan p","useful":1,"cool":0},"tQ76X7L6Wn_vu47qmDm6RQ":{"text":"This has jumped into my top 3 restaurants in New Orleans.  The fried green tomatoes where ","useful":0,"cool":0},"6SZrh3QHw9fdzhCe4bvgBw":{"text":"This place is overrated, overpriced and the food is below average. Especially if you are f","useful":0,"cool":0},"ZLY9b6EQbBhvhTKTchVwPw":{"text":"Fantastic place! It's been a long time since I've been there however I found a business ca","useful":0,"cool":0},"53O398YRkdQwG4KZGS6zlg":{"text":"K Paul's is an upscale restaurant with an authentic Louisiana style and taste. Their menu ","useful":0,"cool":0},"e12wv5a4trJsbX5HsfLXbw":{"text":"My wife and I found this place incredibly overrated. You get the feeling this is the kind ","useful":1,"cool":0},"5-jySKAL5ytcL3Dor3JQDg":{"text":"Unbelievable...truly.\nWe are extremely picky diners as we cook ourselves. Everything from ","useful":1,"cool":1},"a6UOKS_1UkYcf-iTOWBarg":{"text":"What a wonderful Place!!  I enjoyed the food and the atmosphere.  The manager, Morgan, was","useful":0,"cool":0},"YU9XufTb-kadu2tTWIGIPw":{"text":"Had a really good meal at K-paul.\n\nHad: \nRibeye: above expectations; very good \nEggplant d","useful":1,"cool":1},"kufsGZNLKR1S5KI6tBJq3A":{"text":"Went here for my cousins bachelor and loved it so much! Is there any recommendations for s","useful":0,"cool":0},"3mebK38Wqa6zAJr-Mjjxkw":{"text":"I got to be honest with you the best thing about this place was the waiter that I had a he","useful":3,"cool":2},"WFX5dzZ5bXSX9KHo2-w1Yw":{"text":"My cousin told me to check out this restaurant for lunch when I get to New Orleans. At fir","useful":4,"cool":1},"nqIiIxHxHgoXl7PZllfo7g":{"text":"\"Heroes get remembered. Legends never die.\"\n\nSadly this historic business could not surviv","useful":3,"cool":1},"hvBOWbfLW4A6K-ey4uobrg":{"text":"This food spoke to my soul through my stomach! These wonderful dishes make me feel happy w","useful":1,"cool":0},"W50HdDGPStv2G_K7pA82QQ":{"text":"K-Paul's is magic. Pure, unadulterated, ridonkulous magic.\n\nWe went here to celebrate my s","useful":19,"cool":18},"ijeKunX1pHneOxJEkmTnuw":{"text":"First off Arla was phenomenal. She was down to earth and gave us amazing suggestions. We g","useful":0,"cool":0},"5bsZ414iiom731dJO5pk8w":{"text":"My visit on July 27 2019 was not a good experience. It took a total of 55 minutes from pla","useful":0,"cool":0},"IHi28FbLvRVfZfTElUsY0Q":{"text":"I was here back in July, but still remember this night fondly. The menu changes but they h","useful":0,"cool":1},"-vWwqzQm444KwgDMAWkA6g":{"text":"The only thing that we had here was the bread pudding, but we'll definitely come here for ","useful":1,"cool":1},"2uvvv2paJ_IqzHfp8ZjkOw":{"text":"We visited K-Paul's during August '19 for coolinary month and definitely would recommend t","useful":1,"cool":0},"FUmHwQ2DyYCQqyy-h_yAZg":{"text":"Absolutely love this place and make it a point to go whenever we visit. I use up live in t","useful":27,"cool":23},"3rKNG0nP0_250jdzC5gBxA":{"text":"Everything is homemade. \nThe rolls for dinner are great especially the jalapeño rolls. Yum","useful":0,"cool":1},"DlFNfUJdPBWNvKflicShfg":{"text":"Some friends and I were visiting New Orleans and wanted to splurge on a classy meal at Eme","useful":3,"cool":0},"LDW0mNtLMl4IqHk3p6aIUg":{"text":"Top 5 meal of all time!  This along with Felix's Oyster House were my 2 favorites on my Ne","useful":1,"cool":0},"Emi3y7aQjrQOwbu3ERMBPg":{"text":"Chef Paul Prudhomme was a family inspiration growing up. Whether it was his spice selectio","useful":19,"cool":16},"-49g4Gq_wqadxKEAF2579A":{"text":"I semi grew up on Paul Prudhomme cookbooks. I have a couple, my dad has all of them, and t","useful":0,"cool":1},"wsA9wAqlC8RZrwc6qSFyfA":{"text":"Chef Paul Prudhomme has long been a legend in Louisiana, opening his first restaurant in 1","useful":5,"cool":4},"T1EsnUKbsqZEq7t-yRiBCw":{"text":"Every bite was delicious - - absolutely DELICIOUS!\nDidn't really have room for dessert, bu","useful":0,"cool":0},"2ZJbxkcgkn-ZeLPiYrp9hg":{"text":"Brenda Prudhomme reached out to me and made my day. She truly knows how to please customer","useful":1,"cool":0},"eEf3Ax8pTtggI1yoC9e-kw":{"text":"This restaurant makes a super star of local, seasonal ingredients in each of it's dishes. ","useful":2,"cool":1},"szjWZG1YQDXKxUUNaJlqUw":{"text":"One of the best places in New Orleans, a must stop every time I'm in the city.  All the fr","useful":1,"cool":1},"DsN9eNduT5d4j1DLaA_XaA":{"text":"I'm sure just about everyone has heard of or seen Chef Paul Prudhomme.  I've been looking ","useful":3,"cool":1},"VDsImTD5CDIEaRJEa2kiNg":{"text":"Been coming here for 30 years! Finally I get to give a proper thank you!  Sitting at the c","useful":3,"cool":2},"YFLCRLzKdRgMdIAAsdz3SA":{"text":"Don't assume that this place is touristy, and thus not particularly good. We've always had","useful":7,"cool":4},"vI1if2Cb2_8hphDxTAuEPw":{"text":"First visit to New Orleans for my wife and I, and this was our first dinner there. \n\nThe h","useful":3,"cool":1},"dBjKoWWpw3Qm-eIGeXA3hQ":{"text":"I stopped in to dessert and dash and ended up staying and chatting with the bartender and ","useful":1,"cool":1},"LnOq4S0Rgg8X-_NZJHYMcg":{"text":"This is still my favorite restaurant in New Orleans. The food is always outstanding! The f","useful":1,"cool":0},"6R6YHZiuIUn7uW-k4sidBQ":{"text":"It's Paul Prudhomme's place, so you know it's going to be something special. It's a cozy p","useful":1,"cool":0},"tzEIAWyHQG-pt2FYs5KZcw":{"text":"Husband and I made this our expensive night out. We were waiting outside when the restaura","useful":1,"cool":1},"DV7nXKiTVlhIhlpLW7RfmA":{"text":"Good chicken & andouille gumbo. Good selection of beer. Good service. \nThat's about it. Wa","useful":1,"cool":1},"lYE-t1hiPvVdl10m59LOhQ":{"text":"So let's start with what was wrong before I tell you all of the good stuff!\n\nOur waiter wa","useful":1,"cool":0},"NEEPdnRdy66XwQzkha-KSQ":{"text":"CoolinAry menu, can't pass up the deal.\nFor starters we had turtle soup & fried green toma","useful":2,"cool":0},"3q1Ox88eM8qA9WSvlmoETw":{"text":"From the time I met Chef Paul as a little kid, I always wanted to visit his restaurant. He","useful":3,"cool":2},"8PZ4QTDfZMSc0OyfoCgueA":{"text":"Not the best, not the worst.  Had a fried rabbit cutlet with jambalaya (which was supposed","useful":0,"cool":1},"UKdYoxw1i6VqtQThBI8B0Q":{"text":"THE BEST MEAL I HAD IN NOLA.  My friend and I were in search of a meal that would knock ou","useful":1,"cool":0},"cGohVexBGIhaEwPQWdQd_A":{"text":"Well worth the money-this place\nLives up to its reputation. Service was impeccable. It was","useful":1,"cool":0}}