{"AAe6l-fHmBSwlVqVZdKolA":{"text":"I was in one of my best friend's wedding in December. She picked out our dresses from Yvon","useful":1,"cool":0},"CCeNGS1ywalPW7qikppo8A":{"text":"Great store, great customer service. As soon as we walked in, everyone that worked there c","useful":1,"cool":2},"8PviGHUJGXfiagnnWO9doA":{"text":"I came here in my quest to fine \"the\" ball gown.  The selection was ok and they had some b","useful":1,"cool":0},"1v0xkcjrARkjqdZsX3HWxQ":{"text":"I am blown away by this exquisite New Orleans boutique. Not only did I fall in love with e","useful":0,"cool":0},"tPixqMRkIB3tsgA-HnpYrg":{"text":"I bought my debutante dress here and had a great experience. They have a huge selection wi","useful":1,"cool":0},"EdAQtob8PaIUfAfS38EBqA":{"text":"Five star service, always makes me feel special. The clothes are made of fabrics that feel","useful":0,"cool":0},"laeC_Sngywc4Vy1_512zEA":{"text":"Yvonne Lafleur is known as the poster woman for fashion in the New Orleans area.\n\nNot only","useful":7,"cool":2},"G-OF6SNsVHcMKvgXRfOF9g":{"text":"Yvonne LaFleur is simply the best. I went for a bridal appointment and was instantly wowed","useful":0,"cool":0},"SzjE42pXjYVMnji1vBmGAg":{"text":"Upon crossing the threshold of this shop you'll be transported into a world where debutant","useful":3,"cool":0},"l-fV8ImFcsyThlk7NDH3PA":{"text":"I've been visiting this shop since I was a child. I adore walking through and eyeing the g","useful":8,"cool":2},"X4v2BEiowFnXClEEPGgDxg":{"text":"I went in last month at the advice of my mom who is just obsessed with Yvonne Lafleur. Whe","useful":0,"cool":0},"piGNT3r4tSvJvzQzsUWjFQ":{"text":"I love Stella and Yvonne. I bought my wedding dress there, and I would go back for the res","useful":0,"cool":0},"lbbzImpQc5lReMOEX_HXNA":{"text":"I started my wedding dress journey in February 2016 for my November wedding. Yvonne LaFleu","useful":3,"cool":0},"4qgFRr3RXtFQ97sm_yFZLg":{"text":"Bought my wedding dress from here. I was helped by Ashley who was amazing. She took the ti","useful":0,"cool":0},"CQJwbsS9n_Wx5f_wlibXpw":{"text":"I just love Yvonne LaFleur's. \n\nI purchased a dress for my daughter's wedding. I wanted so","useful":0,"cool":0},"8z6aJGJGlplbHdBVcklzuQ":{"text":"Yvonne was so attentive and helped me pick the perfect mother of the bride dress I had bee","useful":1,"cool":0},"1Q_69rskDlj-AdV47D_UDw":{"text":"Of course I visited Yvonne LaFleur.  It's a \"must see\" in terms of New Orleans bridal stor","useful":1,"cool":0},"GoV0jR3w-2qR3bwKL0sxsA":{"text":"Has anybody noticed a difference in the Yvonne LaFleur spray perfume?  I've used that perf","useful":1,"cool":0},"p1ZDAlV6M2BnF965Z2lPfA":{"text":"Yvonne LaFleur in New Orleans is the worst bridal boutique shop i have ever dealt with in ","useful":5,"cool":1},"VlvRySdj5uSHTOyslYfEjQ":{"text":"This place is crazy. I hope you like the way her perfume smells because the whole place is","useful":9,"cool":1},"vlj4S-eUEUjvSH5gGgfFpw":{"text":"Stella and Yvonne are the sweetest. A divine, enchanted experience for finding your weddin","useful":1,"cool":0},"22vWWc_nckoYl6ji9BpHBg":{"text":"This place is possibly the worst place I've ever been in. Went looking for a wedding dress","useful":5,"cool":1},"OM0CK0QKeyBhNy-NB5VGtA":{"text":"Beware of Yvonne's collection bridal dresses!  Bought one 5 years ago and got ripped off.\n","useful":3,"cool":0},"coVR_hPyolS5w9sNKhUAFw":{"text":"Pushy as Ffffffff***** you are also not allowed to take pictures of the wedding gowns!!!!!","useful":7,"cool":1},"XcthQi6hpXTbtV-7S6zjTQ":{"text":"I was really excited to visit the store bc I heard they really work hard on making wedding","useful":8,"cool":2},"8S93Edih7LMLsZb5obamqA":{"text":"I wasn't pleased at all with this business. My family and I entered the space and never on","useful":2,"cool":1},"Lms1vN3_x4b5KQTL0BueBQ":{"text":"My wife and I have been shopping for months fo a mother of the groom dress! Yvonne was ver","useful":0,"cool":0},"nDgjfgbFYuc2OtV41B8FVA":{"text":"What a gem! I've been to thousands of boutiques, but this experience was by far my favorit","useful":2,"cool":2},"jO6NG4-_h2wvKtXVTkuWgA":{"text":"Last year I purchased a hat and dress at Yvonne's.  The dress was poorly made and my tailo","useful":5,"cool":0},"edUUrhiYpq_QnYi8DSj3jw":{"text":"Ok, this store is amazing. Here is how you know, I was there many years ago for a medical ","useful":0,"cool":0},"6I-Q0MwqUbfrE6FbfKDXQQ":{"text":"Yvonne, yvonne. The woman herself is a living attraction -- oozing Southern propriety, qui","useful":9,"cool":2},"awlpUFE0PWoyGVIbThoTPA":{"text":"Check out the hidden reviews at the bottom. Looks like I'm not the only one who saw that t","useful":5,"cool":0},"y4Q0RHLRxlyi4Qsk5LOpMg":{"text":"The shop itself can be very messy and walking around you often see things that are torn, s","useful":4,"cool":0},"LzZpSQimsY0qkWGwT06Ekw":{"text":"To the staff  - Did you attend my daughter's graduation??  Did you notice she was not wear","useful":4,"cool":0},"mLkkTGm9GLK1jnAWEzkACQ":{"text":"I am so excited to have found the wedding dress that is perfect for me. My grandmother in ","useful":0,"cool":0},"jNquOe7pq98Rgll99IOnIg":{"text":"I love Yvonne LaFleur!!! A New Orleans staple for over 50 years. Yvonne and her family are","useful":1,"cool":1},"3zsE57n_0XdnvDxrg9HX8Q":{"text":"Yvonne LaFleur has reasonably priced gowns, that are not worth the money you save.  I left","useful":5,"cool":0}}