{"W2yDTALZRj_3aXvojwOJgQ":{"text":"OK...First off, I'm suspicious of a store that doesn't have Cafe Bustelo on the shelves..a","useful":1,"cool":3},"0LWcwWPjNBD023opJR6qUg":{"text":"It's not a complete trip for me unless I find a supermarket and check out some of the loca","useful":1,"cool":0},"UrRTgRzZjQtNV5Zj1Ow58w":{"text":"great place to stock up on tourist provisions.  and local provisions as well.  security gu","useful":0,"cool":1},"42eS1AXXMQVfYxREkkLFFQ":{"text":"I'm from the Midwest, and places like Rouse's don't exist here. The closest thing I can de","useful":0,"cool":0},"3oAy241Rv0malstPAcCwGw":{"text":"This store reminds me of a Whole Foods but the name sounds fancier! \n\nBought a container o","useful":3,"cool":0},"mNQHN9CXpn4bPANWcu1GIA":{"text":"Don't go there.  Accused us of trying to take a bottle of pop we had purchased at another ","useful":0,"cool":0},"QJADNfVxyanThwAZhM7Nfw":{"text":"Their Rouses branded medium roast coffee is excellent.  Plus a large selection of regional","useful":0,"cool":0},"GTxbo2hahkoMHKVQ6s8f0g":{"text":"We sure got lucky getting pointed to this packed and perfect little grocery in the heart o","useful":2,"cool":0},"nxFl0Y7z2ko8gGJG64f7gQ":{"text":"This Rouse's was a super find for us over Mardi Gras.  We were staying at the Hilton Homew","useful":3,"cool":0},"UCCYKxW6n0J2BtLxKU6egg":{"text":"What an absolutely amazing grocery store. This place just blew away every expectation I've","useful":1,"cool":1},"r9cd-ePv19oUQGtdIdC1fg":{"text":"This place is truly amazing! Being from Southern California we have a health food store on","useful":0,"cool":0},"5UA2zftEuFipb2ua9l79dA":{"text":"Pretty packed 'regular' grocery store in the FQ. Presumably because of its prime location,","useful":1,"cool":1},"-FJMxN7mSw9YvvN-LpPM1g":{"text":"Blown away by the service and selection they have. Great salad bar that is open late, too!","useful":0,"cool":0},"dYOKxSFTT1Yx5PAz_YX07A":{"text":"Ok so I've been coming to this Rouse's since before it was Rouse's (A&P) LOL!\n\nI love this","useful":2,"cool":2},"y5p5UNkabJgPsaeGxsdWAg":{"text":"This is my neighborhood Rouses so I'm here a lot.  Today I ran in to grab a few essentials","useful":3,"cool":1},"GCEsMkFPUwq_Y-EV0eGR9A":{"text":"This little grocery store is a great place to pick up a quick snack while visiting the Fre","useful":1,"cool":1},"uXegVCbe8jBAvhGVXJorhQ":{"text":"What don't they have here?? Well, they go light on the fruits and vegetables, but they do ","useful":1,"cool":0},"QskYm7dqf996DOsJqGE0Tw":{"text":"Their king cake is absolutely delicious. The cake part is fresh and not dry at all and the","useful":1,"cool":0},"QNC37DvvdoaXPrZc5NfzhQ":{"text":"Came here a couple times on vacation for incidentals as it was only 1/2 mile from our hote","useful":2,"cool":2},"qt0BE4U5hoNlLPfaCo0i6Q":{"text":"Handy and well stocked but boy howdy is it Pricey. Pick up odds and ends but don't expect ","useful":0,"cool":0},"R7utF1asMfr9-ujBmjpmkg":{"text":"I thought this small grocery store was by far one of the best stocked and offering the mos","useful":7,"cool":4},"duubBPE2WXw43IKr_cOpQg":{"text":"This is a great store, and that says a lot since I come from the land of Publix.\n\nLots of ","useful":0,"cool":0},"Wrq6dRrsnDB2_aNhCj4EQQ":{"text":"This should be your first stop when you stay in New Orleans. Taking a look in this store i","useful":3,"cool":3},"nITk8Qs7Wq_obzDYnVfSWA":{"text":"Best market ever for the square footage. Had the best service today from this gentlmen nam","useful":0,"cool":0},"jl1FBiQpRD9yZV7O05mbQw":{"text":"I came here to get groceries for when I did not feel like eating out.  I got basic staples","useful":2,"cool":0},"53Ud_FlT_xRW31U1AD-vXQ":{"text":"This market had everything we needed, one block away from our hotel. Medicine, food, water","useful":0,"cool":0},"x4C4ncUam1eX62bo4heU7w":{"text":"I shop here all the time, the have pretty much all you need but the service is horrible. T","useful":2,"cool":2},"kqkK7MzylNnrCAdtXFE1yg":{"text":"If you don't want to go eat a big meal at a restaurant or want more of a healthy snack-typ","useful":0,"cool":0},"bvHCWs2jodKXEupYojpJJw":{"text":"Great service! Great variety! Great parking!  \n\nIf you're visiting, this is prob the best ","useful":0,"cool":0},"ZGnyK5dy5-fiV1hpWoIukg":{"text":"Amazing..amazing..did i mention awesome.??..i love the rouses on baronne...it has everythi","useful":1,"cool":0},"2C9Ue7ukdMMoHFkBymNuFg":{"text":"Overdue review but I loved Rouses! I stayed at the Le Pavillon hotel two blocks away so th","useful":1,"cool":1},"rrSdpHVdFgrYj2ZSeghFXQ":{"text":"4/5 right where I need it with late hours\n\nThis is super convenient to swing to after work","useful":5,"cool":3},"K6Fevs_UzJB2AC-bq0sW2g":{"text":"When you're stuck in downtown and need some water, razors, or even ibuprofen because you h","useful":3,"cool":2},"-Mx_ZX4GgwYuUP-7g7AWJw":{"text":"Such a convenient location! I bring my shopping bag with me, walk over, shop, and walk hom","useful":5,"cool":4},"lH4_Hs7ftnY81amG2-ToLw":{"text":"I guess you're a tourist looking to pick up a few things this rouses is okay but if you ac","useful":1,"cool":1},"VWxBrHCvhJIEb0-qWmQmLQ":{"text":"Probably the only grocery store in the CBD/FQ area - Rouses is a little more expensive bec","useful":2,"cool":0},"lye3CdL2WiMydV93zDVlkw":{"text":"As a visitor to NOLA staying in a hotel, I was looking for a place that had fresh produce,","useful":2,"cool":0},"7U7NF33s8X-cCblKrdiqAg":{"text":"Nicest Rouses I have ever been to and the only grocery in the CBD.  For the size of the pl","useful":1,"cool":1},"-3MVhqHg2pacyv__IBiLWg":{"text":"Rouses Market  has almost everything. (almost) because they have to! There are no health f","useful":5,"cool":5},"kCgc_0KWdmT0RrJtlsVtVw":{"text":"Love this place! Friendly employees! Best lunch spot in town! And one hell of a salad bar!","useful":1,"cool":0},"cidToRxmzNMT6weuDIrZLw":{"text":"This is not just to place to buy groceries during your trip; it is a great place to purcha","useful":0,"cool":1},"6gluZbyPP2BKyRJ7qdhtGg":{"text":"I was planning a swamp tour plantation trip for the following day which expressly made rep","useful":0,"cool":0},"b0HdaGTdDNZrZ2WGtFVdcQ":{"text":"This is probably the most comprehensive grocery store in the entire French Quarter while m","useful":4,"cool":1},"egB55BuhOERcnfYuTIrGaw":{"text":"I need to preface this with some background info about the state of grocery stores in the ","useful":4,"cool":2},"fZjjGQeJzGhYqzGdHVDZzA":{"text":"Great place a few blocks from our hotel. They have lots of things to stock up on, includin","useful":2,"cool":1},"zg5iA1-3eoozePgAS-9s3A":{"text":"Huge fan of this new, beautiful Rouses location! Until Whole Foods moves downtown, this is","useful":0,"cool":0},"n1Pa8QvdaCrAYIDqogyk8A":{"text":"The best Rouses in the city. Always fresh meat and produce here.","useful":1,"cool":0},"zhS7hpGfSJOxMJdBAbrgSw":{"text":"Rouses' is amazing.  The staff will do anything and everything to help you, and it's kind ","useful":1,"cool":0},"uBjsrJZc9ZAxxC8R77Mt0g":{"text":"I've got mad, mad love for the Rouses chain in general. My grandmother worked and retired ","useful":10,"cool":9},"_00mG2wmdBLFYmdcHU2DNg":{"text":"This is probably my least favorite food stop. Always crowded, cluttered, disorganized and ","useful":0,"cool":0},"y_UNOmiuEA_fEREnI8Qz_g":{"text":"I absolutely love this sophisticated looking Rouse's market! It has that modern day wareho","useful":0,"cool":0},"FHW3FsFSrKWJs-hfGexdEg":{"text":"This location is open late, within walking distance of most anywhere in the CBD, and has a","useful":2,"cool":1},"-JlIAodESpDWfI0WkcVkYw":{"text":"I have to write this review right now! I just ate my salad that I got for lunch at the sal","useful":4,"cool":2},"MA3hSHzkmmn_JREE_dlQDw":{"text":"If you're staying in the French Quarter (or close by on Canal), this is probably the best ","useful":0,"cool":0},"9vipqnKUUB0WgFncSmyeXA":{"text":"I finally got here. I was in bliss when we walked into the produce section. Especially aft","useful":3,"cool":1},"xTPKfOY6IQj2J3nslsoaxA":{"text":"This neighborhood market packs a powerful punch! Every aisle is jammed packed with grocery","useful":2,"cool":0},"8NbpdEDpM0iFAXeZlfS_1w":{"text":"The only thing that kept me from giving a 5 was the very small \"healthy\" and organic secti","useful":1,"cool":0},"QKw1uLfV7Cdq2XvFJd1gmg":{"text":"Today, I was completely dissatisfied with my experience at this particular location. This ","useful":9,"cool":2},"OawB_AIoPcYnduGPKx1RTw":{"text":"Okay. A limited review admittedly. But I had stopped to get a mint chocolate gelato. It wa","useful":1,"cool":0},"xOu-u5_NeDEvKfwjWtQkfA":{"text":"Better than every other Rouses in the city!!! The made to order food section is where I ge","useful":1,"cool":0},"PY9wFoRcvVXVlbAZrh5zNw":{"text":"This Rouse's is a fantastic addition to the downtown area - the building is an old car dea","useful":3,"cool":0},"WJuj00WvGl7uTpEmSnS-KA":{"text":"I hell heart Rouse's!\n \nThe staff here are a really great group of folks, day or night. \n\n","useful":3,"cool":0},"gQXxWyX-ksfVK4oDZUeEHQ":{"text":"Great place to get a snack and experience the local flavor. It's a mini mart grocery combo","useful":1,"cool":0},"hnNni5TurGl5MAAyA81P8g":{"text":"Great local market in the French Quarter. Tons of Cajun food and spices. They really pack ","useful":0,"cool":0},"gbtVcoXeG2q8QiOOQ5_8cQ":{"text":"I freaking love Rouses. I wish they had one in FL( Publix is fun but not the same). Y'all ","useful":0,"cool":0},"0GJGOkExzwkSyQx6UhHeSQ":{"text":"I love this Rouses. It has a little of everything. The organic/special diets food section ","useful":0,"cool":0},"1Q2x4gQ5Wb6wgQXw5cmjxw":{"text":"Great market located right in the CBD area...walking distance from the Hyatt if you're sta","useful":2,"cool":0},"8nc2S2l8q29a8t4lbHxMew":{"text":"OK this place is DABOMB.COM. They have a fabulous selection of food - both specialty, orga","useful":0,"cool":1},"0M3rDf74hL-zPLZfD18RVQ":{"text":"Fancy gourmet market found in the French Quarter.\n\nOne thing that I have noticed while vac","useful":3,"cool":2},"IgbroidfzKEMfhc8uRIRFA":{"text":"Rouses, you had me at Barrone St. I love how close you are to my house, and how easy it is","useful":3,"cool":2},"PLSqmYfE9GF5JpCqFaw27Q":{"text":"This place is a great grocery store, but the true hidden gem in this place is the deli sec","useful":2,"cool":0},"iH7yDkO70IR7ihY3b3DRLg":{"text":"What a great supermarket. Carries everything you need. The quantity and the quality of the","useful":0,"cool":0},"kD5lwTqW1_oIHHWENWHKbA":{"text":"The prices and quality are great.  The wine selection is amazing.  And FREE PARKING.  I li","useful":0,"cool":0},"gyMAhNXaVj5hJb-iiOINMg":{"text":"I know being on vacation means eating at new places and trying new things but I really jus","useful":0,"cool":0},"ZWjt8e-8NfBIkoLNUE3mvQ":{"text":"Spending a week renting a house in New Orleans with 6 girls. We stocked the place in two t","useful":4,"cool":0},"amAfl81ckfLZTjO2aMZUfA":{"text":"Sometimes you find yourself on vacation and say to yourself, \"I really want store bought p","useful":6,"cool":3},"jvkkEccTwEf6UuygPBzY8w":{"text":"We tried the king's bread here. Honestly what else can I say other than its just normal br","useful":0,"cool":0},"qWNZqRDtxSLyBkdXB3Oe2A":{"text":"What a gem of a place to find all your needs for a week stay. Wine selection is unbelievab","useful":0,"cool":0},"cUIUziY7CptKMgEi9VqWcw":{"text":"Italian food/deli/bakery items are top notch!  Excellent wine selections from high end to ","useful":0,"cool":0},"o9DGzQ3gwhIy92H6myMU-A":{"text":"Great local market in the middle of the French Quarter. We were staying in a hotel in the ","useful":0,"cool":0},"bdcq1_VLE7YVZSsMvee43A":{"text":"Great place for late coffee, especially lacking other establishments in the area. Located ","useful":0,"cool":0},"J0qfx54-XRZ65QV1mtxXig":{"text":"Very similar in concept to Whole Foods. Great selections and friendly staff, and in a grea","useful":0,"cool":0},"z2pKCG5dfv0MtW_k5-lsIw":{"text":"A tiny yet packed for of goodness grocery story in the heart of the French Quarter.  The p","useful":0,"cool":0},"AxwWCLOLOcAAy_4IQolANw":{"text":"Grocery shopping just got a bit fancy. I find that this rouses is for single people, coupl","useful":1,"cool":0},"lE7ptrIlql1d0VgWo5LAyA":{"text":"It's great to have a corner store in French Quarter just in case you want to pick up anyth","useful":4,"cool":1},"eKx8-qj-dTxHJ-uQ_GnGng":{"text":"My wife and I love this Market it was a great place to grab some fresh fruit &  salad and ","useful":2,"cool":0},"0atS2_CJxrGqOyESKjPOAA":{"text":"This downtown Rouses is a fantastic grocery store. It's a definite different feel from the","useful":3,"cool":1},"-v2Om8ZXgndr9UDp5NdHTw":{"text":"Clean, cute and upscale without being overpriced!\n\nNice wine selection, prepared foods and","useful":1,"cool":0},"ZghI3OuUM86hBdAQX3aRYg":{"text":"Just moved to the CBD. It seems to be the only grocery option around, so we went there for","useful":0,"cool":1},"5KaPNgKi_h4S8nlwO9evVg":{"text":"Despite being so tiny, they have everything i need. Which is really nice because I live in","useful":1,"cool":0},"K705AHs6lEnYYuCnBYS0yw":{"text":"Tourists/NOLA fans, this  is where you go to get your fill of New Orleans condiments and m","useful":1,"cool":0},"bfaPoesUkYeIac_AFh6HrA":{"text":"I stopped in here a few times to pick up drinks or a quick snack.  The location is super c","useful":0,"cool":0},"wGw7K9TLkUKVr3vfUB7FFg":{"text":"I like to call Rouses the \"local\" version of Whole Foods. They have a great selection of l","useful":3,"cool":0},"IEQT32khEgeF8Y14lQLMYg":{"text":"This Rouses is great!!! If you usually frequent the one on Royal by the French Quarter thi","useful":3,"cool":0},"ZPYMDad50jimLG1qiIO9TA":{"text":"Great selection of items and fresh snacks.  Stop by here if you're staying at a hotel in t","useful":0,"cool":0},"Aue-6GhnYAc7wM_owkQ2Dg":{"text":"First off...I miss the A&P. But Mr. B still works there and probably still throws shop-lif","useful":4,"cool":1},"Sk5UnA1m6ZSArUHE4awXEw":{"text":"I had just left Forever New Orleans who had pointed me to Rouse's after I'd asked them whe","useful":1,"cool":1},"tg3jZb8wkdRIwLqGiWklAQ":{"text":"This is a great grocery store for tourists, smack in the middle of the CBD/FQ area.  Skip ","useful":3,"cool":1},"cbLvA5bRF5GHd_IhM3R1UA":{"text":"It does have about anything you could need. Not everything was clearly marked. Isles are v","useful":0,"cool":0},"2B1NQa_SDX1id1CPBEbFMQ":{"text":"Cute neighborhood store (right on Royal where the street performers hang) that seemed to h","useful":0,"cool":0},"zISRQOiGW2VqCdh8-YeNXA":{"text":"I must say that each time i go here these lady's get nicer and sweeter.they make me feel a","useful":1,"cool":1},"cyhSBC1Q5DPJpw2rYWo1yg":{"text":"attention tourists: great in store bakery - you can order King Cakes off season with one d","useful":0,"cool":0},"Zcwa0SPF_cC0arZdV-oJ0A":{"text":"Hands down in the future when aging 21st century New Orleanians wonder how and why the War","useful":3,"cool":3},"hZHxlq3I-5x8Jua7vGMl_Q":{"text":"Costumer Service/ Cashiers (Females) are not well mannered. Not all but out of 5, 2 of the","useful":0,"cool":0},"UpBUhelw98ASpuTJPFKRSA":{"text":"Rouses in CBD works really well for out of town visitors that would rather not navigate ho","useful":0,"cool":0},"TqB-aDDkOyRucwKNs3qyEg":{"text":"I come in her about twice a week and try not to go broke because compared to what I'm used","useful":0,"cool":0},"m5hApiVo3nY0pu0LvCv_sw":{"text":"Even if I stock up on everything I need before I take a trip, there's always something I n","useful":2,"cool":0},"GLzif1Pj0_IskvRaWPf4Qw":{"text":"Most recent observation is all the hard liquor is in limited selection and quantity and on","useful":3,"cool":2},"sYfw7_qm1SrvzCJXlK2UXw":{"text":"Very impressive store. Great customer service. Tons of healthy choices and pre cut food. D","useful":0,"cool":0},"J0VuKoZaeMFNatWbk7eB7g":{"text":"While staying in the warehouse district a week, we shopped here often.  Love the wine sele","useful":0,"cool":0},"SWPt7eDmhBgza8Mau4yuhA":{"text":"Nice, clean, and reasonably priced.  Great place to get supplies and snacks when in the FQ","useful":1,"cool":0},"aT95FXtTruk1HwbygJNa5A":{"text":"Such a great resource while on vacation! Had everything we needed to supply our house duri","useful":0,"cool":0},"7edxSSTLjQzWnXVb8XwOCQ":{"text":"Helped me stay healthy while living in a hotel in the french quarter! Seriously, one more ","useful":1,"cool":0},"oW6EatuDf0QQtTqi7yfAwQ":{"text":"This is a Rouses on steroids.  They have an exotic meat section where they sell Vietnamese","useful":4,"cool":2},"FICCx3BDviyQVPy271jGvQ":{"text":"DO NOT EAT THE PHO.  \n\nI cannot stress this more.  If you read this and still get pho at t","useful":1,"cool":0},"1Hwun0L3Bj8qd2jy2Nfu8Q":{"text":"I can't believe it's taken so long for me to get over to the new fancy Rouse's. It was Chr","useful":6,"cool":2},"6TE4Kw_hqyNe5EQUvCpDug":{"text":"I have been going here since I started visiting my mother in New Orleans 4 years ago or so","useful":1,"cool":1},"CdrmJMgrs8ajejuYRovg0A":{"text":"Super fun market on Royal. Grab a bottle of wine and some cheese, head to Jackson Square, ","useful":0,"cool":0},"zYlLDe3uwoegNQkLOUueWA":{"text":"This is the place to shop for groceries in New Orleans. They have everything you think you","useful":0,"cool":1},"vntV-k6m_7dUqWQ5wzqDNw":{"text":"I love having a grocery store of this quality in CBD. I prefer smaller markets (I just mov","useful":0,"cool":1},"oa82jKegJbiTwKX1wEdn9A":{"text":"Pros:\n\n--It's pretty.\n--Employees are nice and they don't laugh at you when you get lost i","useful":3,"cool":1},"4Jcsd38bvy3mdn7P0f2STw":{"text":"omg the selection of seafood and prime meat are wonderful.  they also have duck breast and","useful":0,"cool":0},"_JjtYzzZfL_p9msR7yF9rA":{"text":"good place to pick up some booze or snacks at ok prices(for the Quarter) you can also find","useful":0,"cool":0},"hYCS_wqCctq_VKtIZIEPLA":{"text":"This might just be the cutest supermarket I have ever seen.\n\nRouses is tiny.  It's in the ","useful":1,"cool":0},"yTgGK4Uw49ZDmcx-f56SgQ":{"text":"Omg this place makes me soo happy! I love that you can get gelato at the coffee bar! I lov","useful":6,"cool":4},"IL6WTupo5yr4vjDHMC4geg":{"text":"Love this store everywhere but this location is awesome, especially for how small it is. I","useful":1,"cool":0},"v3ZByeSSL1wUEDrVi8byvA":{"text":"This little tiny corner grocery store has everything you need. The prices are very good fo","useful":6,"cool":1},"QgSJ46SeUf_Sv1oVcq6ERQ":{"text":"I love this place!  What an awesome grocery and the prices are really not bad especially w","useful":1,"cool":0},"SIDJoa-MTDb50JQfmE4A0Q":{"text":"DO NOT USE YOUR CREDIT/DEBIT CARDS! The cashier's here are thieves. I'm a local and used t","useful":5,"cool":0},"srzenWjFoI7BYpgZwfl-AA":{"text":"I was there today on their first day of opening. They will maintain the 5 stars if they do","useful":1,"cool":2},"12dnheD2AFeZpl6oz3we1Q":{"text":"I love, love, LOVE this Rouses! The staff is really friendly for the most part and I never","useful":7,"cool":3},"B6NiGki2UQmplR31bfdQsw":{"text":"Great place to stock up on staple items to keep in your room. Rouses is known for their se","useful":1,"cool":0},"K2iWY4ZAeslIRQalsUNXPw":{"text":"Rouses never disappoints. I always go here for lunch. They have a salad bar, sushi bar, ta","useful":2,"cool":1},"aX643m4_D0TrTssUFKBdeA":{"text":"This was the first time I had experienced a full-size supermarket in NOLA. I'm used to the","useful":1,"cool":0},"KSYXAILtruFPcUhL6V39Vg":{"text":"Reviewer Feira T. and I had the same problem with this Rouses: bag check. \nI'm a cyclist, ","useful":11,"cool":3},"m02FrhzfkQqHNXrS5qV2Uw":{"text":"I really like this neighborhood grocery store. Every time we stay in New Orleans, I stock ","useful":1,"cool":0},"nL6Cm72fVH4SQq2pYKAJaA":{"text":"I'm really excited to be the first reviewer of the new Rouses in the CBD because I have li","useful":3,"cool":2},"pfrXSyd3KW4rOl1u7EUl3Q":{"text":"All I can say is I can't wait until Whole Foods opens closer to me. This Rouses is by far ","useful":4,"cool":0},"B-6II0n4QdZIiw6g2m30QQ":{"text":"I enjoy coming here rougly once a week for lunch.  They always have a pretty good selectio","useful":0,"cool":0},"tVYAx-rE2UoT3PlhVdOzHw":{"text":"I'm so thrilled that Rouse's decided to invest in downtown! This is a pretty awesome Rouse","useful":5,"cool":2},"lMrIVi_tA6nOkitQKq0Mig":{"text":"So impressed with this local market.  Great wine selection & deli at very reasonable price","useful":0,"cool":0},"e-10ivEAHXKS6VFgh1w1ag":{"text":"I walked down the street from my hotel on my first night in, all the way down to Rouse's, ","useful":0,"cool":0},"RXZa94xIUoyQCh0Cof7hjw":{"text":"Lovely little market with everything I needed for my short stay on NOLA.  impressive produ","useful":0,"cool":0},"TNxLSyhrXPZCzTgmpqjeHg":{"text":"Why I'd opt to go to Rouses over Whole Foods:\n\n1. It's Louisiana-owned\n2. They have Cajun ","useful":25,"cool":18},"RdeGlS6IYRcwwo0SIQqgNA":{"text":"This is by far my favorite grocery store in the New Orleans area. It seems a little huge a","useful":1,"cool":0},"ZCw9rupS5ABr0IeslS_OAQ":{"text":"Love Rouses, but the one in CBD makes me feel claustrophobic. The store itself is pretty t","useful":0,"cool":1},"k-ZRr-cYLYPMYu0FXGWW7g":{"text":"Wow, just wow - I wish I'd found this place on the first day of our trip to New Orleans, i","useful":1,"cool":0},"NodURln2OprAwxADoRJlTw":{"text":"Rouse's rocks my world for all the reasons my fellow Yelpers mentioned and one more critic","useful":0,"cool":0},"qCew1g1m9JGOkNisPzk3Tw":{"text":"My husband loves this little grocery store so much he says he wants to work there when he ","useful":3,"cool":1},"-OM2ENvr9syYBEX9630v2g":{"text":"This was my first visit to the French Quarter and it was nice to have a market close by. T","useful":1,"cool":2},"0Cg6sP1cZ-4zGrL6eh_FEA":{"text":"A bit snarky custserv, but, they got what you need in a pinch (a last call sixer of Abita,","useful":1,"cool":0},"AFLzSjRIXb6Pxq2gsv0IQQ":{"text":"Came here to stock up on supplies while on vacation. Found everything we needed and the ch","useful":2,"cool":0},"QqVQsdCdwrNnAoIP1ExpKA":{"text":"If you are in the French Quarter and you have had your fill of Po Boy's and Gumbo and you ","useful":0,"cool":0},"QObVR1lSOy2XSMeWsauQUQ":{"text":"When you work downtown, you have many choices when it comes to meals. But sometimes (as is","useful":4,"cool":1},"oErDZqZmYCtaFPYrbEFrPQ":{"text":"Great market to buy some frog legs for cheap and bring back home for my family. Couldn't f","useful":0,"cool":0},"9RAdPRQkKt9Uj0T-RXgLxw":{"text":"Convenient to have a full service grocery store near our hotel. Took advantage of their pr","useful":1,"cool":0},"1IR4rGbCEWeM4N2xAj_Z9A":{"text":"Great market in the Quarter conveniently located on Royal Street, stocked with your favori","useful":0,"cool":1},"XN4s0PqMsuEcJHqR0pMwQw":{"text":"To me, the flagship Rouses is still the one on Tchoupitoulas, but this store takes it up a","useful":6,"cool":5},"UlX5F-vv6-2CbArC-DAiPg":{"text":"I agree with all the accolades mentioned.  All good things.  The only suggestion I have is","useful":1,"cool":0},"Kx77wch5d5hd0jUR1dthHg":{"text":"wonderful!  bought the freshest fruits, cool beers, hot sauce, olive salad, and healthy al","useful":0,"cool":1},"oCC_wqvaLRsLtZh_ABFo-g":{"text":"I was surprised when I walked in to see good that you would otherwise see in Whole Foods, ","useful":0,"cool":0},"nPwRU1ug5SJ4ODtI_l3PfA":{"text":"I must go in the store once a day the the lady's who work there are so sweet & friendly. T","useful":0,"cool":0},"s6zqpUq8c9SuxKMDjgWJKQ":{"text":"Great place near Bourbon to get everything you need. Fresh fruit and vegetables is a rare ","useful":0,"cool":0},"pgG75YpGtJ5NocPIN3KEuA":{"text":"Nice neighborhood market right in the Quarter. Very good selection of most everything you'","useful":3,"cool":1},"2gYzSuHxHG8txoyDeetrKA":{"text":"On my travels to New Orleans I always seem to find myself at Rouses pretty much daily to s","useful":1,"cool":1},"N5cOnkU0vD2l-vW2wYf_-A":{"text":"If we lived in NOLA, this would be our main market. \n\nI visited for the beer. This place h","useful":1,"cool":0},"ob0_SIRozo7x9lX56UTNqg":{"text":"Located in the french quarter--a local grocery store! I find reasonable price selection of","useful":0,"cool":0},"lq_TdPmEUhT5YddfRz_OHQ":{"text":"Has everything you need while spending a weekend or week in NOLA. Everything includes food","useful":0,"cool":0},"jYfVZSeP8BiATBgO-O1VmQ":{"text":"What a great addition to the CBD area! I work about 1 block away from here, so my coworker","useful":2,"cool":0},"lDh3SDtnl1PPqsVEjSuZLA":{"text":"This is where you can get a bottle of water and candy bar at normal convenience store pric","useful":1,"cool":0},"HxUmagDUezScGrk3g0989Q":{"text":"Hot bar has Indian food. There are other awesome things about this new store in the CBD bu","useful":1,"cool":1},"BEJBhFShg0mKpQXZzgfUqQ":{"text":"So glad this Rouses opened up. It's perfect for those living and working in the area. Perf","useful":1,"cool":1},"X5QYsGDav0Gjzj2erJc1Dw":{"text":"I went there today and was greeted with the best people who work there. The lady Sam is th","useful":0,"cool":0},"1UgvVomPYGSfxrHjK2GBKw":{"text":"I'm lazy and rarely get outside of the quarter when I travel to New Orleans. I am also bro","useful":4,"cool":0},"dMaHuHkPWlAWNouVY5vUbg":{"text":"This market is Uhhhhmazzzzing! My bf and I walked into this store and my jaw just dropped.","useful":5,"cool":1},"kvja5IZa_tU046CjRvxbLg":{"text":"Great grocery store! Tourists- do not buy hot sauce souvenirs at the gift stores! Come her","useful":1,"cool":1},"qSc1Dr5HgzXeJjrdMAyCUA":{"text":"The place looks a lot nicer after their renovations, but the service is still horrid and t","useful":2,"cool":0},"wvOwutVV2uiF3iOekcGJ_A":{"text":"This market has old world charm with new world choices.  You'd never know it was so big wh","useful":0,"cool":0},"IGUPwqSsR0iY6KfLYnT1mQ":{"text":"Outstanding prepared foods, extensive wine selection, thoughtfully arranged for convenient","useful":0,"cool":0},"KidFr_TSVIPNBSZI4XkmiQ":{"text":"It's not just the biggest grocery store in the French Quarter, it's also THE spot to purch","useful":1,"cool":0},"wqPhi-zUbvTE4kc7gZrfkA":{"text":"This was my first time going to the Rouses in the CBD and it was really great. I was in th","useful":4,"cool":3},"EV6k1Pq-Jfta_j7UxawxZg":{"text":"I finally checked this place out and I'm surprised at the amount of selection they have in","useful":2,"cool":2},"fGYJniSTRxVcBF__TZR6mQ":{"text":"Convenient, clean, and reasonably priced - what more could one ask for?  The employees wer","useful":0,"cool":0},"jP7cAAYE4bpopQYuogIuzg":{"text":"Love this place. They sell almost everything. Great wine selection, great coffee in the ca","useful":0,"cool":0},"XiIHQVeIiBl3GRP-hoGxVQ":{"text":"I'm fortunate to live in walking distance of this awesome market so I'm literally stopping","useful":3,"cool":0},"2bT3Tvgr3Z_upFblx8Gg8Q":{"text":"I liked this grocery store a lot. It is conveniently located near Jackson Square. It is a ","useful":0,"cool":0},"xI4KgwbJJpMCdjpNvDsRbA":{"text":"The market that has every pickin' thing.....including boiled seafood orders and KING CAKE!","useful":6,"cool":5},"_HdxcKAvNLWAIxaQtTbfnA":{"text":"My husband & I stop at Rouse's at least once every time we come to New Orleans. They have ","useful":1,"cool":0},"InhZ4Y_BX-i0tdymVJYeqw":{"text":"Everything you need! Just don't go if you have issues with tight spaces. I was able to buy","useful":0,"cool":0},"YLu_PU-vd7lRx_sOhLrVJw":{"text":"Open until 12 p.m and fresh food are the reasons why I really like rouses. Also, There are","useful":0,"cool":0},"5OnlxqNpcO7s1tXYVx6-EA":{"text":"Recent policy change, re: plastic cutlery. Now you have to pick up a packet at the gelato ","useful":7,"cool":5},"Z8yoOECX2PZioeic3wjdkA":{"text":"After spending four days in New Orleans, this is the only REAL grocery store that we were ","useful":0,"cool":1},"I_wX-gld2dZDZZhNrQfEuA":{"text":"Well placed market right in the FQ a few blocks from our hotel. Grabbed a quick muffelata ","useful":0,"cool":0},"UEFphHxGUCyTgh4cV9rhoA":{"text":"Nice place with a large selection of grocery and market type items you might need... Male ","useful":1,"cool":0},"O-qCFijwVhw4h9rT7OuQOA":{"text":"HALLELUJAH, HALLELUJAH!!\nRouses has fixed their security problem. Now, shoppers with large","useful":5,"cool":3},"gzbgKJgerrhe2X2UmBBKSw":{"text":"When we come to the Quarter, we generally stop in 2-3 times. Great market, reasonable pric","useful":1,"cool":0},"sv_MuOa0xBHGq0HmIOLa8g":{"text":"While I've happily embraced all of the culinary delights NOLA has to offer, my body immedi","useful":3,"cool":0},"HUEnTXu26v0jbgSV_MIHeg":{"text":"This place is great!\n\nI hit up this place for dinner supplies when I work evening shifts a","useful":4,"cool":0},"ispxaazAaz8Q8AaTO_-Ykw":{"text":"This Rouses is clean and still fairly new. \nIt kind of reminds me of a Whole Foods.\nThis s","useful":2,"cool":0},"KPHedV5gJCcyRyUpGEdwYw":{"text":"Awesome supermarket in the French quarter. Come here to stock up on everything New Orleans","useful":1,"cool":0},"VkJ2Z6akEJwW2vgYTgsF6Q":{"text":"Excellent location. Clean, well organized, well stocked, attractive produce. Excellent ser","useful":2,"cool":0},"lh5eJ17i-1UwZ5b9ggjHvg":{"text":"Hooray for this store! When you visit, you don't know where to go. I went to some of the s","useful":0,"cool":0},"tO5KgdviGzZMERjRBW716w":{"text":"A grocery store in the French Quarter! Awesome!  Sometimes it's hard to find regular-type ","useful":3,"cool":0},"gR2fGzz26szMBm2dpguJzw":{"text":"So nice and clean!  In walking distance from everything in the Business District or Wareho","useful":3,"cool":0},"YKwJI0g3Kc9KWZqRjgeQfA":{"text":"This place is adorable, and the perfect place to stock up on all the local items you'd pay","useful":1,"cool":1},"zfdPGaf4b3m4_s4BbKSk-A":{"text":"Five stars for the ready made hot foot. As a tourist I try everything when it come to food","useful":1,"cool":1},"AxwSVGUIjCZO2J1GUkfGZQ":{"text":"My mind is completely blown.\n\nFirst, the architecture and adaptive reuse of the building i","useful":2,"cool":2},"BctlnInrkJzmNbQR6yczRg":{"text":"Definitely NOT bike friendly. 2 double racks (4 bikes). One hard to reach behind tables an","useful":4,"cool":1},"D8HAL19EXd8TuznElp-Q_A":{"text":"Our go-to grocery store in the Quarter. Locally owned and carry most everything you need w","useful":0,"cool":0},"oVFAoZWTji09bcI0mPvsKA":{"text":"Yes, I have drunk the locally sourced, organic kool aid and have jumped on the the glitter","useful":3,"cool":2},"EFJtM4IChRblgmS7ahqfHA":{"text":"Very convenient location! Large selection of locally grown veggies. Great sandwich and bur","useful":3,"cool":1},"vxDwb2eEJIIqL9RBWZRHgA":{"text":"This is a super convenient Rouses right off of Poydras.  If you live in the area, and want","useful":3,"cool":0},"VOMPY_3J6q89U3ToSX6Glg":{"text":"Absolutely fantastic.  Their burrito bar has many selections, as their deli. Going back to","useful":0,"cool":0},"0dwpV3nouct4VCMH50pmWg":{"text":"Convenient and over priced just like you'd expect in the French Quarter. I was surprised, ","useful":1,"cool":1},"xtvOJYApNKcOMDqUcAAk7Q":{"text":"Nice small grocery market in the Quarter. I was able to find Boudin, Andouille and Tasso h","useful":1,"cool":0},"XSF-81Ddr6rVFidEmlNfDA":{"text":"If you live in the French Quarter (or even if you're just staying there), this is a great ","useful":0,"cool":0},"_5l31WvnWa7ZUFZQDa0l6A":{"text":"Convenient and right there when you need that 'must have' snack while you're out and about","useful":14,"cool":10},"u8lWbZDgFF-NTVuy4rMu5g":{"text":"This Rouses is located in the heart of the French Quarter and was the prefect local conven","useful":0,"cool":0},"dS7v8mLGmI6dhgb6JP8oDw":{"text":"So incredibly fab that there is one here in the Quarter! On same block as Preservation Hal","useful":4,"cool":2},"NsxPcNFiAc1jJn76U5cb7w":{"text":"What a breath of fresh air! Rouses on Barrone is my new favorite gorcery store. Living on ","useful":0,"cool":0},"HN0Kz6xJxrTRiKRwQsuUGw":{"text":"We were staying at the hotel nearby and needed some stuff, so we came here to get a few th","useful":15,"cool":15},"jmkFlEwU2JyySOsgJWfYlg":{"text":"This is a cute neighborhood grocery store that knows that there are tourists too. The pric","useful":4,"cool":0},"PdFrGeY4Ql-OfNhneqkb6w":{"text":"It's good considering that it has the most selections of groceries in the neighborhood. Ho","useful":0,"cool":0},"qx_f8wwE9yNHCfJjo8WTWQ":{"text":"Well stocked marked in downtown NOLA but be careful of expiration dates! Beer prices very ","useful":0,"cool":0},"W1YMTIxJTME8gioAqOzeDw":{"text":"When I travel, I really enjoy going to the local supermarket (call me strange, but I find ","useful":0,"cool":0},"UegrgY-1BlDYuD9xfBJYhQ":{"text":"Best grocery store in the French Quarter.  Good selection of items.  I found this store th","useful":1,"cool":0},"SN_2YXqN2K2WLHJRcXpHnQ":{"text":"Whether you're visiting the area or you're a regular around here, you must try the tacos. ","useful":0,"cool":0},"QA380py9WVzMjS_cV9WVpA":{"text":"Stopped by here to pick up a few groceries and was expecting only a small \"to-go\" mart, bu","useful":0,"cool":0},"xSOT5f_r6qLHJxGxPVeY_w":{"text":"I was pleasantly surprised when I stopped into Rouses Market. The market is close to a few","useful":1,"cool":0},"WhhXpEQ_mWTvAOYvvaDvAQ":{"text":"Everyone need to visit Rouses in the back CBD area. I'm from the lower 9th ward and i driv","useful":0,"cool":0},"jL2U8n46UpsVgse_3_oalg":{"text":"Ok, if you need to grab essentials in Bourbon St area. They don't hold a gun to your head ","useful":0,"cool":0},"2pfpn_0GHp-x3GXNGkMPxQ":{"text":"The absolute worst gelato I have ever put my lips on. Me and my girlfriend walked in after","useful":1,"cool":0},"N-ElFbjnlxhAhM4Dr-vjAw":{"text":"I was very happy that they had Kings cakes in off-season few months ago. However, their ki","useful":0,"cool":0},"r6NZyE-8wOgilwJKUyKmeQ":{"text":"Oh you fancy, huh?\nMaking groceries just got a make over. \nCheck it out, you won't be disa","useful":2,"cool":3},"rQLZ5ejqg1PGhSNnZNjO_A":{"text":"I work with a lot of guys who used to work at Sewell Cadillac. It was before my time, but ","useful":4,"cool":2},"jTLcnxj5eSfXUUdXnVik3g":{"text":"Rouses market is a staple in the French quarter that always has something you need. The em","useful":3,"cool":2},"U_jun3oYwxzozj0qVoAWGQ":{"text":"Cons:\n\nClaustrophobic \nBusy all the time \n\nPros:\n\nPrices don't suck\nGood beer selection\nLo","useful":0,"cool":0},"9SFL4OYuu7buJ9yiGwOOgA":{"text":"I've lived in the quarter for the past five years rouses is the only grocery store nearby.","useful":1,"cool":0},"wWCfjtAs7Bx1_4d2oYmJCA":{"text":"Good selection, but seeminly overpriced for the area, probably catering more to tourists?","useful":0,"cool":0},"BnAqfjaG-Bh-EQ_zJYaBrA":{"text":"Full disclosure here. I met the owner Tony Rouse while on a military history tour in Europ","useful":4,"cool":2},"uavefiDzNvIDUVI0JX77mQ":{"text":"MOLD! MOLD MOLD! \n\nDuring the week I was visiting from out of town, I went here twice and ","useful":0,"cool":0},"BkV0LQCekp9SSObA3MPLuQ":{"text":"What a quaint little store!  I was amazed at how many varieties of drinks/beverages/easy f","useful":1,"cool":0},"vqG6iZIuKSjHF_72zzjy3Q":{"text":"Why can't this grocery store be in my hood? The prepared foods section is awesome and I'm ","useful":1,"cool":0},"yaF_2oDLEuIP1WYu5yNBtA":{"text":"Update: A worker behind the deli counter says to me many times, \"I want you to go away hap","useful":5,"cool":0},"ph3LnoASZTAPD8DMQYWq9g":{"text":"I am bumping this to five stars for a really arbitrary reason: there are so many seriously","useful":3,"cool":1},"DrWNudUyrSYgTZMl3UAPVg":{"text":"This location is the best grocery store in the French Quarter. It's well-stocked, clean, a","useful":4,"cool":2},"wSaWnFaJu_0cRZc3bUe1Mw":{"text":"Clean, neat, helpful associates, great selection!","useful":0,"cool":0},"ZuwYPyF2zcDz5r8UKFpdYg":{"text":"Place is big and clean, good service, nice people ready to help you. \nThe market has a lot","useful":1,"cool":0},"M7vssALN94smSUUOQ7sNIA":{"text":"Good place open late but some price check I assume as a mistake took me by surprise.  =)","useful":0,"cool":0},"5-YuYsATOWRTqYtoZA4Ydg":{"text":"Great selection. Needed specific baking items such as coconut flour and liquid sweetener. ","useful":0,"cool":0},"icVyWhZjaTqafT1B4jfQ8A":{"text":"Staying in a timeshare with a small kitchen just outside the French Quarter so it was an e","useful":1,"cool":1},"Y3d1ud0eJSjmmmj3jn4s7A":{"text":"Ok, if you need to grab essentials in Bourbon St area. They don't hold a gun to your head ","useful":1,"cool":0},"Cfn6NLEdQ5k8rce124fWMQ":{"text":"We went in here to get some beer to walk around with and check out the tailgate parties go","useful":2,"cool":0},"FnSsNENKnlmlFNUcVY4EBg":{"text":"I love me sum Rouses on Barrone!! I live in the French Quarter and as we all know it is ve","useful":1,"cool":1},"F_ewXhnoDtezb8BXyTWZ3Q":{"text":"I always make my last stop out of New Orleans headed home at Rouses for all my Cajun food ","useful":1,"cool":1},"MjHd22zfkevzq57UHbEQ9g":{"text":"Yes you CAN get King Cake after Mardi Gras is over-right here!\n\nSmall, very small store-bu","useful":3,"cool":2},"AZdUNq1KZCFJNLychU23MA":{"text":"A really great grocery store that has a ton of prepared foods, as well as groceries. They ","useful":7,"cool":2},"fW3H6ZQ8VcBog-Hbl6NLEA":{"text":"Rouses is possibly the only \"real grocery store\" located in the French Quarter.  Sure you ","useful":1,"cool":0},"S50fNBxX0YL2F8v6LVp5hg":{"text":"To say overcrowded would be an understatement.  A delivery of goods blocked the entire pro","useful":1,"cool":0},"phIWfBYeCAyDY6F43Z2S-w":{"text":"A god send for people with no car and staying in NOLA central it like me staying  in Algie","useful":0,"cool":1},"-NsH-l8LB1B-jHxepDQFiQ":{"text":"This is literally the only grocery store in the French Quarter.. Your think I'm joking ask","useful":7,"cool":8},"mGdDmwJ7zlw7hJZoIgyR9w":{"text":"Awesome place of you want to buy som fresh fruit or other healthy/delicious grocery items ","useful":1,"cool":0},"_E-aMSGJdiSbO9YeGcUQSw":{"text":"I was in the area and decided to stop by for a bottle of water. The store was well kept an","useful":1,"cool":1},"TomvC6Vfxqa2GC4cvbALPQ":{"text":"This market is a lifesaver! Conveniently located by the bus/train terminal and the earlies","useful":1,"cool":0},"11XnrAjXUchZqEygCWfY8A":{"text":"This place is awesome. I'm from NYC and really appreciated finding a supermarket down here","useful":3,"cool":1},"gENP02d_rQqpVKEOg3GXRQ":{"text":"It was crunch time - slept too late, had a 945 walking tour, and no time for brunch at the","useful":1,"cool":0},"ynZFurcdAr1iHENnbh-BnA":{"text":"I like going here when i want to feel fancy about my mundane groceries without the high pr","useful":8,"cool":3},"w3F2vFoKtfWnf0FtXk0vkQ":{"text":"It's a blessing to have this store here in downtown. Prepared food is amazing and cheap co","useful":1,"cool":0},"wHIaWRFgsEl-7jneMdczBg":{"text":"If you need flowers for a special occasion or a Just Because surprise this is the place. \n","useful":5,"cool":1},"96c3QQf3PHULHL0u8ooh-Q":{"text":"This place is a grocery-store Tardis!!\n\nWhat appears at first to be a small, convenience-t","useful":3,"cool":1},"qabanMgnV4HOV5xLinR4Ww":{"text":"So I was talking to my friend---let's call him Steve.  So Steve and I are discussing where","useful":4,"cool":0},"NvwGBeejt8cArTLBez_ouw":{"text":"A small market located at a corner. Easily accessible! Nice selection of kombucha! Nice se","useful":13,"cool":12},"70ZeprnLEdFfy6j_S3KVLQ":{"text":"Really noT much more than a glorified overpriced convenience store. If you want a full ser","useful":0,"cool":0},"fXoBCMm3rvCjYXv1ZcfWUQ":{"text":"Love working with the concierge desk on special orders here. Easy to get in and out and th","useful":2,"cool":1},"PMpoJogV46PMw-8D4s31Nw":{"text":"The French Quarter is a touristy place. And when I say touristy, I mean that people will r","useful":16,"cool":9},"oNLgu7IlagowWXXnGIuhlQ":{"text":"Stopped for a quick ready-made breakfast. Biscuits were overcooked, but grits, eggs (from ","useful":0,"cool":1},"Dcg3vNAl-3EOxPC3rQ5P8Q":{"text":"It's always great to have a super market nearby when you're traveling. It's in walking dis","useful":1,"cool":2},"pGvoh_JeKaQyGzRGj97OBg":{"text":"What a terrific find, this local market, turned out to be! It was located within a short w","useful":1,"cool":0},"oRozpt5WTLXCe5Zfj30N4Q":{"text":"I'm here for work, and as AWESOME as the food is in NOLA, I'm not tryin' to gain 10 down h","useful":4,"cool":1},"PydTZkw2YQ_WDoSsL2KnIg":{"text":"I like this store because it is small. I can find everything that I need quickly. My probl","useful":2,"cool":0},"5o6JesOEcHMdwMyK2jAPbg":{"text":"Great selection of produce ,baked goods and meats. \nGreat service . The deli has many tast","useful":0,"cool":1},"5NecPURcULSLjGToKfodfQ":{"text":"This Rouses is delightful! I wish I lived down here, but my sig. other does and I love to ","useful":10,"cool":3},"EitHA5lgzZIkVM0Xlouomg":{"text":"It was my last night in New Orleans and between the allure of endless parties and deliciou","useful":1,"cool":0},"mLGcTeAVBwXPV2frEy3d3Q":{"text":"Quite unlike the other Rouses locations, including one not far away, this one is less a gr","useful":3,"cool":1},"vdEkZbKTcE02qq3r8ztGew":{"text":"Wow, happily surprised to see such a nice, newly renovated store in the Quarter. Rouse's h","useful":0,"cool":0},"dl0QRu6OgtQUOg_Tj08Cfg":{"text":"I have never been so mad I shop here a lot every other day live 5 blocks from this store h","useful":0,"cool":0},"uxp8FIOPXNHGLCYV4tGlqQ":{"text":"I was walking around Bourbon St in the French Quarter. Many people were drinking in the Fr","useful":0,"cool":0},"fmBGDgTb--VpMSdI4AtayQ":{"text":"What a gem in French quarter.  I was expecting they sell things with tourist price tag....","useful":0,"cool":0},"OSxRjVz166Te-hCsj54tUQ":{"text":"Very nice and welcoming. Parking is easy. Selection of products is diversified and fresh. ","useful":1,"cool":0},"VViqT5kmZAfWPdU3KHtSUQ":{"text":"This Rouse's was an absolute savior during our stay in New Orleans. Perfect location in th","useful":0,"cool":0},"v_9jtyi9ch8UEEDjXqwj0g":{"text":"Rouse's really did a first class job here. The building is really beautiful and the store ","useful":2,"cool":0},"mCPK3eWoOGKZcNO2SW_oHw":{"text":"Nice local grocery store. Convenient location.\nDecent prices. Adequate selection.\nI'll be ","useful":0,"cool":0},"a-N78gRuL2rkvvLFkXLkqw":{"text":"During a recent trip to New Orleans we stopped into Rouses Market specifically to pick up ","useful":3,"cool":2},"hx_-56iIGcqhM8OsaZPKoA":{"text":"I really liked this location when it first opened, the first year or so, but the quality h","useful":1,"cool":0},"I13RdvTKi4FHksjFLP2GLQ":{"text":"This place still sucks! No redemption! It is extremely classist and they execute a very di","useful":3,"cool":1},"IXPsGjgdNEn9vkCbkenKSw":{"text":"This market is amazing! I found many good foods here! Ready boiled crawfish was pretty che","useful":0,"cool":0},"FCybzEgxIDRvssMfCBDIgA":{"text":"Lived near this Rouses for 2 years now, it's a big reason why I moved into this area. This","useful":3,"cool":0},"eVg1IicQRT-l8_yBfNmMLg":{"text":"This place always does a great job. Always friendly, fast service. Great location on Royal","useful":1,"cool":1},"g72o_iR4i9DUzX7FnNc9eA":{"text":"Ordered a king cake to be delivered after trying locally in Atlanta--awful King Cakes!  Th","useful":2,"cool":0},"JzIlH_KVk-Lm43mqdvhtUA":{"text":"Rouses Market was an unexpected find.  \n\nThe French Quarter is filled with plenty of resta","useful":44,"cool":32},"JDt4T1xgDqOqlCoO53URqA":{"text":"Walking back to our hotel from dinner, my family and I walked into the store with our kids","useful":3,"cool":0},"_7asgCF5hOJceS5gTbseaw":{"text":"As someone just visiting, I was glad that there was a local market nearby where we could b","useful":3,"cool":3},"cOkDRdNrLPFwFVQgzEz_qg":{"text":"I was dying for a grocery store, because every place you eat in NOLA has no healthy option","useful":2,"cool":0},"tQxS-L11yk9__fm-iMqqKg":{"text":"Me? Write a review for a grocery store? IT'S MORE LIKELY THAN YOU THINK.\n\nI just moved int","useful":1,"cool":1},"hI_VqnNm4oye7yR5hq5_FA":{"text":"My mom loves visiting grocery stores as a tourist.  She's fascinated by all the different ","useful":3,"cool":2},"Ma_lKj1hvYmYmxIQx4teNQ":{"text":"I wrote a review in Nov about Rouses here is an update I feel I was way too harsh the next","useful":0,"cool":0},"E7zBzsDiAI8wbbW3rYfLsQ":{"text":"Very friendly staff, clean store, and nice selection for a neighborhood corner grocery sto","useful":0,"cool":0},"cgZI69xyHOsEwBp8NcVvgA":{"text":"Rouses used to be my favorite place for ordering King Cakes.  My whole family ordered from","useful":4,"cool":1},"KEP1WUUoh07ejYX5FBTTxw":{"text":"I gave it 4 stars because it's Rouses (and Rouses is my fave). My complaint with this loca","useful":0,"cool":0},"4m_2_i0x9CxQvkE5I7GhbQ":{"text":"Given it's actually pretty difficult to find a big grocery store in NOLA, Rouses came to o","useful":0,"cool":1},"9g8roLbTKc3J9WlFprTcVQ":{"text":"Purchased take out salads chicken etc- how cheap and greedy can they be? They charged for ","useful":1,"cool":0},"Z8T-I7H4XkTH7KuVXKNF5g":{"text":"Why in God's name would you permit customers to smoke cigars inside a grocery store?? I le","useful":1,"cool":0},"M2QBzNf_5dnKB3EyB2wJ4g":{"text":"This Rouse's location boasts exceptionally polite and helpful staff, as well as a pretty s","useful":0,"cool":0},"MsoMDN21S7UvIWdIhASWig":{"text":"Ahh downtown Rouses, please marry me and take me away from all the crappy Winn Dixies and ","useful":3,"cool":2},"n7LrffC-IseyC3PFzcGxrg":{"text":"A great little market within the French Quarter that is convenient to stop by for supplies","useful":2,"cool":0},"kLR7UeCq4ZBIRqqCC9cbHA":{"text":"Anybody who has been to the french quarter knows how expensive food is but if you want a f","useful":1,"cool":0},"4W7BjHUa6I6ikLEa3qkEdg":{"text":"CBD DELI IS HUGE and more impressive than Whole Foods or Fresh Market;\nANGUS STEAK, BAJA C","useful":2,"cool":1},"ykjdTyYo5TNcIAIoCNBnJg":{"text":"The market itself is great and sells cool local things like kings cake, red beans and craw","useful":3,"cool":3},"ZJQYcARHULBxF0tWDwYuxA":{"text":"Rouses Supermarkets are a chain of grocery markets in the U.S. states of Louisiana, Alabam","useful":3,"cool":1},"FEV-0qJuXehK2TN8Z2UAZA":{"text":"Rouses does a great job, given the limited square footage in this historic French Quarter ","useful":8,"cool":9},"aKI6SIFYSvpZRGtNd1H6Hg":{"text":"These people have no sense of customer service. Rude, condescending and completely unprofe","useful":2,"cool":0},"B3NqGuzmzOXCyOQS_zLX4Q":{"text":"******WARNING!! As of November 2016, the VAST MAJORITY of the 267 reviews found on this pa","useful":13,"cool":5},"rkmRVByBxMWNtmB6_DDplw":{"text":"Key things to know: \n* Open till 1 am. \n* In the quarter\n* decent selections\n* Bottled Alc","useful":16,"cool":13},"JyEAhZnzgiofFqGSd7pKYg":{"text":"Great grocery store in the quarter. Everything from fresh produce, to local Nola products,","useful":1,"cool":0},"G7sMgtr9UVMoWE5zwSu6_w":{"text":"OMFG! This is definitely the flagship of all the NOLA Rouse's! I looked like a damned tour","useful":8,"cool":4},"ZVYoH1ADBJ22Yth3B3hCGA":{"text":"This place sucks. Managers who work there are incompetent to say the least. Managers have ","useful":1,"cool":0},"c1LYvBEjtkiUEM3ynr1fZw":{"text":"Used to be the only place service industry people could shop at late night after work but ","useful":0,"cool":0},"3AWeFWmihNquFxRSacT5uA":{"text":"I LOVE Rouses in the FQ! It is by far the best grocery store in the quarter, especially si","useful":5,"cool":6},"Yp3GEcKHOgyERRoWMjM5mQ":{"text":"This grocery store is a saver. It's right smack in the middle of the French Quarter where ","useful":5,"cool":2},"iit36FsfnWP_cSt20htG8Q":{"text":"Great supermarket in the CBD and walking distance from the hotel so my colleague and I cou","useful":2,"cool":0},"kvpmPA5hyqNc_0a5n7DVhQ":{"text":"Great neighborhood market. Great sandwiches and bread. Large selection to cover most of yo","useful":1,"cool":0},"En29K81ae4qgQ3a2x7ZRlA":{"text":"This spot is an utter delight for the drunken traveler wandering aimlessly in the quarter.","useful":8,"cool":4},"1awgC26eD4m_BLtM-AK16Q":{"text":"WATCH YOUR FISH PURCHASE: Tonight for the third time at this particular Rouse's, I was ove","useful":2,"cool":0},"167UemFHIifq4avxP2j8Ww":{"text":"This market is so seriously good, that Rouses' butcher Brad-the-Rad has fans. I walked in ","useful":1,"cool":3},"bB4ectda5p9ItbSnSlDXiA":{"text":"What a hidden gem in the french quarter of Nola. We went in and shopped for some room supp","useful":0,"cool":0},"cL24hKNNOFOFNmsez-OaXQ":{"text":"I live at this Rouses location.  Ever since it opened my my debit card statement says Rous","useful":2,"cool":1},"BcELUTO6ueFEt0Nvlze48Q":{"text":"Like a lot of places, this Rouse's opened a few months ago with amazing service. But it's ","useful":0,"cool":0},"0dnFGkuv4587xZNI4AjB5Q":{"text":"Long story short.. finally a Rouses that isn't racist and friendly!! Yay! \nSeriously, from","useful":5,"cool":7},"BA3t_YE2vl7paI8FDfsSGA":{"text":"As soon as my sister and I walked in this bright, spotless market our eyes lit up and our ","useful":1,"cool":1},"VxbH-86mTDmCjWzgbO-LyQ":{"text":"One awesome place. Being in Nola for 2 months I had to get adapted to another grocery stor","useful":0,"cool":0},"onM-gCFtHYLCZlbSe0pYWg":{"text":"Any company that stands by its customers and employees in the wake of woke, is ok with me ","useful":0,"cool":0},"4FfXd_Xz6oZ4-4LIRcg1NQ":{"text":"This is my favorite gourmet grocery in the FQ. I always shop here when I visit & take a lo","useful":10,"cool":9},"ee_wdBixL1luAgTCa58anQ":{"text":"THE EMPEROR HAS NO CLOTHES! Rouses is jilting us with crap wrapped in gold:\n\n**NO FRESH GI","useful":10,"cool":5},"4r1eOnDpeRg7DISmOrrHzQ":{"text":"The \"honor\" bar at the Omni was cable tied shut which thankfully prevented us from wasting","useful":4,"cool":2}}