{"GM5ZBHKT-eJniKJQjgWRGA":{"text":"I've never felt compelled to leave a review about any place because I'm pretty easy going ","useful":12,"cool":2},"HINfhCcjUF2rTsTud7poug":{"text":"This place is great!! Great mimosas!! Great drag shows!! The drag queens walk around using","useful":0,"cool":0},"ZF6SChdCkNjShQHDRKCOpQ":{"text":"Went to eat st The Country Club last night, had the anniversary menu, 3 courses for 2 for ","useful":1,"cool":0},"ke4e_crI8j2JcXTq4NIBtQ":{"text":"This restaurant is located in a very nice building in Bywater, but that is the only thing ","useful":0,"cool":0},"fw4aBr2M8eB88MkFrKMdfw":{"text":"A stately restaurant with a swimming pool in the back!  How is that not awesome. Take your","useful":0,"cool":0},"lGaJxlFLa_77s6crRg4fMQ":{"text":"The food is excellent and reasonably priced. The best service I've had since my trip to NO","useful":0,"cool":0},"Lgld0KgxNSD-Sjld56o0Ag":{"text":"YUMMY YUMMY FOOD! Drinks were a bit watered down. But I'd definitely come back for the foo","useful":0,"cool":0},"euvAuGLMg8nIZ-Ln_Q03og":{"text":"Let me first start by saying that I LOVE the brunch here. The food is fantastic and the wa","useful":9,"cool":2},"Q54isxbnY_256Za_nvkKig":{"text":"Amazing food. Great ambience and decorations. New year's Eve we got the recommendation fro","useful":1,"cool":0},"mIhOYWNLTLLoAyG3QOHW4A":{"text":"I plan to go here a lot this summer.  European style swimming and plentiful and reasonable","useful":4,"cool":5},"Tg8yCa5x4c9AbQnd_cB6UQ":{"text":"One word... Bacon. Yes, the staff is super accommodating and friendly. They make sure your","useful":2,"cool":1},"NLe2ysYW3c3QLp_3cHNj7g":{"text":"First time there wont be the last. I've been hearing good reviews about all the food and h","useful":0,"cool":0},"p69TRQ6bIF-PZY_LOe5ppg":{"text":"Okay, I went out of curiosity, not hunger. Surprise. Surprise. The food was wonderful and ","useful":0,"cool":0},"yb9G3VTjImbWNcHgR3TpQA":{"text":"Set in an old Acadian mansion, the country club is one of the most amusing gay bars I've e","useful":3,"cool":3},"5rX8Mqx_jhSQQKJK4PueYw":{"text":"Free on my bday after a fabulous meal in the dining room.  Jacuzzi, pool, all clean. Nice ","useful":0,"cool":0},"vKToGKidp71SYtyfeVWNJw":{"text":"pretty amazing. i love it here so much its so awesome . i really enjoy the atmosphere . i ","useful":2,"cool":0},"tP6BkIX5ww0HHx9jmJx54w":{"text":"This review is for 4.5 stars.\n\nFantastic brunch - no complaints.  A bunch of sides, a few ","useful":0,"cool":0},"NpDfwoaAtPd0aGD94kUyNA":{"text":"Me and my friends had brunch at The Country Club on a Saturday at 10am.  For anyone with a","useful":0,"cool":0},"cH2qDnzWxk7aFZ9aeVr_Nw":{"text":"Wow! An amazing oasis away from the hustle and bustle of the French Quarter. We went to Co","useful":0,"cool":1},"eBFEb9rcVm_tE-_T1Auy2g":{"text":"Over cooked burgers, unfresh french fries (sitting on the fryer too long). Not a destinati","useful":1,"cool":0},"Q7F1CqG2wbqGJygCzMUTWg":{"text":"We ate here for brunch on a Thursday. The Bloody Mary's are amazing and the shrimp with gr","useful":0,"cool":1},"zO05XVa01lNWmyUDZXN0wQ":{"text":"My friends and I took an Uber to the Country Club, there was no way we were walking here f","useful":3,"cool":0},"D4AHW4QTJ8ZpLBQWbPh43Q":{"text":"We were told about this place by multiple people! We went for a late dinner and we were ex","useful":0,"cool":1},"Zhfc_URw-9pR_QBTHA-cng":{"text":"Way to bounce back. Y'all killin' it! \nFood is incredible. Service was flawless. \nMaybe on","useful":1,"cool":3},"qbzVWb6RHU73TVUgi__IRQ":{"text":"OHMAHGAWD.\nThe prom night you always dreamed of, but never had till now...\nJust go. Trust ","useful":5,"cool":1},"qUxdTD402pHo-wV3pZgkNw":{"text":"Country Club has long been a local favorite of mine, because I have always had excellent e","useful":0,"cool":1},"BcsanY3eotN7dhY1FZKK6g":{"text":"Turns out they randomly close the pool down when they feel like it. We just came in at 11:","useful":0,"cool":0},"hyS8iaeoaKULBSMzHIUlMA":{"text":"Great food, good times! Can't say enough about this place. I think for any visitor to New ","useful":0,"cool":0},"vjyYUioZtYAbJGM8zR41SQ":{"text":"I love these guys. Again, Wendy the host rocks the socks off of that place. We didn't have","useful":1,"cool":1},"pUqtee16a6geVMHpYeSNiQ":{"text":"Yes!!!!!!  Go go go.  Best experience in Nola hands-down.   Drag brunch every other Saturd","useful":0,"cool":0},"lbEGaDKkV4HHdcYJ22-mpA":{"text":"A must when in NOLA. The food was as amazing as the service and ambiance. Attended a Satur","useful":0,"cool":0},"yKtdbvO9gDzIUa0-TaxGMQ":{"text":"So great come here awesome drinks food people ambiance.i am a total prude and can hang her","useful":0,"cool":0},"iFn4DcI60Ld3_-SZlPha1w":{"text":"I used to eat here for free because my boss knew the owners and the one dish that stood ou","useful":0,"cool":0},"3n0yxBUwo19ML5u50PPzrg":{"text":"Was told about this place by someone at our bed and breakfast. Best time we had in New Orl","useful":0,"cool":0},"jz5Q62Dh1YKv9oj3LxXy0A":{"text":"We went for the Saturday drag brunch. Just an all around good experience! The food was gre","useful":1,"cool":0},"xfjodtijNoqBoHplvUWBqg":{"text":"I have ate here 2 times, the first time we had a full on dinner. And it was pretty good. B","useful":2,"cool":0},"E4BvL15c5EBIECD_PUkSVg":{"text":"Adore the Country Club! I love it so much I don't even want to tell you how awesome it is ","useful":3,"cool":2},"rKfxiBo2PMj8xLX-JOJ73w":{"text":"Such a cool and unique place. I was fortunate enough to have a friend tell me about the Co","useful":0,"cool":0},"h5KKVXsdJ89HdYj7xYXx0w":{"text":"If you're going for drag dinner/brunch and bottomless mimosas/wine here are my opinions. \n","useful":0,"cool":0},"9No3vmbGW0irnesNmzv8dQ":{"text":"Great HH place in the Bywater, has a pool for members only. The place has been updated and","useful":0,"cool":0},"E9tktJR1gGaxsPh09hI1FQ":{"text":"OK so I really love the country club, but this is NOT a place for everyone...AT ALL!! For ","useful":3,"cool":0},"q7Ys2mrD1dikGG34MRbbnw":{"text":"I had an absolutely fabulous time at the Country Club yesterday!  We went for brunch and s","useful":0,"cool":0},"EjUPlyPrrF7Q8AK16VCjHQ":{"text":"The Country Club is a big gay southern hug. \nThe staff is amazing, the food and drinks are","useful":6,"cool":0},"KNBgvRPklN8yG2SA6K7TYA":{"text":"It's been about 9 months since the last time I was in New Orleans, but I think about my ex","useful":0,"cool":0},"w8EyrKvWuRinJaWUbidqRw":{"text":"I FOUND HEAVEN!!! This place is EVERYTHING!!! \n\nLet's start by saying they are FAMILY FRIE","useful":1,"cool":0},"wICT7D2yLlUgJRfAcBUXHw":{"text":"We went here for brunch and after meeting the hostess, I knew I was going to love this pla","useful":0,"cool":0},"lPBZyG2-Dday90F32S3eMg":{"text":"Here's the thing, prior to one month ago I seriously would have given The Country Club 5 s","useful":6,"cool":2},"1A_wll6SL5QWUUrkKXhQlQ":{"text":"After making reservations weeks in advance for a Sunday morning on arrival the hostest cou","useful":2,"cool":2},"hSD6syQdZwnRyukbk1NKww":{"text":"Chill atmosphere! Music is great! Ambiance is nice! I really like what they did with the r","useful":0,"cool":0},"2hBdnC5RO_Y_RYkPuzJPZA":{"text":"Fun exterior of a building that looks grand in the neighborhood and the street in particul","useful":0,"cool":0},"04ADJwtWDo_tKruIaUehvw":{"text":"This place is awesome, I dropped by on my visit to New Orleans and felt so comfortable. Th","useful":1,"cool":0},"ueoiHmXiIwQcPiizZOHJUA":{"text":"If you're in nola for vacation, Def check out the country club! It's a great place to rela","useful":0,"cool":0},"r6zVWvwhzHOvXspe0MHX2g":{"text":"No nudity anymore and the grild cheese is teaxs toast big...if i wanted a loaf of bread wi","useful":0,"cool":0},"PzvV9u4z-97LVtQcTLDlGw":{"text":"What a great brunch! My friends took me here for my birthday and it was amazing. Fantastic","useful":0,"cool":0},"DM_EFKUakVIOxroouB0-JQ":{"text":"Atmosphere, service, & food was excellent. \nWe were greeted by a wonderful hostess, who af","useful":3,"cool":1},"QQyMgCNUer8Q8ryvmKuO4w":{"text":"Super laid-back (pool area with a very nice-sized pool is clothing optional) with great fo","useful":3,"cool":4},"8pzLKmXmIHZMrStD1d_ypw":{"text":"Went on a Sunday afternoon.  The brunch menu was short and full of classic brunchy dishes ","useful":10,"cool":7},"beRhWjxf-1Ylh4egRyPICg":{"text":"The food has definitely become a strong selling point for me at the Country Club. Great st","useful":1,"cool":0},"h1IXgxbaMV6CJN0RVOnoFA":{"text":"Great atmosphere, very generous portions. I was there for brunch with friends. I had the B","useful":0,"cool":0},"DedkxolD96QP1WdiqV_wNg":{"text":"Naked swimming. Yes please. Definitely one of my all time favorite hangouts in Nola. In th","useful":2,"cool":2},"gTAcaYndH7zUSGW9yryXEA":{"text":"Sitting at the bar is a great way to go at most restaruants, but especially pays off here ","useful":1,"cool":0},"7wgeOCUh1A6vSSeY_FJVOQ":{"text":"Really fun place and great staff. But for spending hours their and a lot of money they mak","useful":0,"cool":0},"RbsQ9BPNQ07moGLUotO6wQ":{"text":"Friendly, beautiful bar and restaurant. It's a gay bar but everyone is welcome. They show ","useful":0,"cool":0},"rvvi3mL1Rnqxa-tFKSw_XQ":{"text":"Great food and atmosphere.  Service could have been better. Recommended by the St James Ho","useful":0,"cool":0},"fHZvDo_UOIftuLa5woLI0Q":{"text":"This is a unique experience, not only in New Orleans, but in the entire U.S.  It's a resta","useful":2,"cool":2},"Zgv9gVbL9KVIQZh8G1mPWg":{"text":"Food: good\nService: good\nAmbiance: trendy / cool\n\nCame here with a group of 11 (girls week","useful":1,"cool":2},"kBM2iIcRgm83InCDkiqM4g":{"text":"Unfortunately we didnt experience the drag brunch but we enjoyed our regular brunch immens","useful":1,"cool":0},"jVRySpzUk8mM0cqFbZqnxg":{"text":"So.. my husband and I came here on one of the many extremely hot days of our one week vaca","useful":0,"cool":1},"2NfKi6e5SbwJvuFvew00Ng":{"text":"I love this place. I have never had a bad experience here! I recently had my birthday brun","useful":2,"cool":2},"bcUButiI8-SiU8I55bx-Lw":{"text":"Had drinks by the pool. Sunny, relaxed, friendly. The other guests were easy to chat with.","useful":0,"cool":0},"7OXXbAzJQ2HREVLLcUyR0g":{"text":"I don't know of a time where I had this much fun and enjoyed every last second of my visit","useful":1,"cool":0},"IES6q-2mzt9CjoAQO11mZg":{"text":"Alas. Second visit was a complete DISASTER...\n\nA good friend and I meet in New Orleans eve","useful":0,"cool":0},"0IyPcwxDT0UtBxTcaJ9ssA":{"text":"I was the MOH in my friends wedding and she had 20 (YES 20!) girls at the bachelorette in ","useful":0,"cool":0},"AAxE8myp6oggzfYWStpy-A":{"text":"This is the cutest place on earth. Went here for brunch with a bachelorette party and we h","useful":0,"cool":0},"Hx0Zx6u00y8ATpAFaMpcMQ":{"text":"Amazing vibe. Gorgeous pool. Food was delicious. I would absolutely recommend coming here ","useful":0,"cool":0},"w3-lLo9S2WPJXQThCojpjw":{"text":"Y'all...this is my happy place. We discovered The Country Club by accident, on our way to ","useful":0,"cool":1},"FvU3asijfO6T4u9Z-PkdWw":{"text":"We just finished a really good brunch. Unlimited mimosas were tasty. We ordered the chicke","useful":2,"cool":0},"i5eQtgX4FjLnSYs1EbQ0cQ":{"text":"Great bar, great food, great atmosphere, great people, and AMAZING new interior art and de","useful":0,"cool":0},"wD5jgqMrQN_KgGONHCYpwg":{"text":"Came here for the drag brunch as well as the pool! Drag brunch was very entertaining and w","useful":1,"cool":0},"e4BftucJtVj9QWYJDvxg5w":{"text":"The food was amazing and the staff very friendly. I had the crab cake and poached egg and ","useful":2,"cool":0},"j1FrwVMkjsBOmBt_IJV7xg":{"text":"I never visited before the clothing ban so I can't comment on that, but when I came for a ","useful":1,"cool":1},"ImbE7QGpKZrj-tMjrLvVpg":{"text":"Overall, I enjoyed the show. The MC was very friendly and offered to give change before th","useful":0,"cool":0},"LblQWBKZ-qhaCsdyjgm6Vw":{"text":"I love this place. It's fun, it's decadent, it's whatever you want it to be.\n\nObviously, i","useful":3,"cool":3},"8ybmVtsOpyhWOvT8vDPm-w":{"text":"Love the vibe at TCC. Arrived for Easter Brunch, looking forward to a relaxing and quiet m","useful":0,"cool":0},"gihvJIVvV6suHKz0K-l_tg":{"text":"I stopped in here one afternoon to have a couple of drinks with a friend.  The employees a","useful":0,"cool":0},"CmQUDHhgeUYpLxV1OvpAsA":{"text":"We didn't get to eat but the drinks were great and the pool was so fun! Wish we were in to","useful":0,"cool":0},"gaSNHwuDl0E1u5yWfJFhmQ":{"text":"Great lunch i had at the bar,great service and the food was divine,a salad with endive,app","useful":1,"cool":0},"HBy8NUjOza70uQZ_ILZK-g":{"text":"The Pool:\nI have been coming here for over a year now and I love this place!  My husband a","useful":11,"cool":9},"NFhRrZ_OD7rsXhJHsozaIw":{"text":"The drag brunch was better than I thought it would be, fun if you're with a group of peopl","useful":0,"cool":0},"sz_BW9eJ9BFXnZ4vQ-_OuA":{"text":"I've been here before but since they've done some updating, a few brief notes are in order","useful":2,"cool":1},"IfC9927Nk-BKeIl3xI0Pug":{"text":"Great food . I had the open face chicken sandwich on brioche . I'm already thinking about ","useful":1,"cool":0},"0Pnk48NtjxNgAkNOvXiOvg":{"text":"I've been through all the incarnations here, before and after katrina.  today, I went for ","useful":3,"cool":2},"Ha05PeKMbo-epIEr8KqDXA":{"text":"It seems strange that I haven't written a review for the Country Club yet. Since I have be","useful":4,"cool":4},"HEgMpPLcaXVMXgz290UDrw":{"text":"I had such a great time here. I visited with another friend and we practically had the poo","useful":0,"cool":0},"HF6VeLQ4u5eyAQlRl0UWwA":{"text":"Talk about a New Orleans experience more so talk about amazing food and a beautiful atmosp","useful":1,"cool":0},"p0H1PCxYjo-bhp4GmEwcVQ":{"text":"We had a wonderful experience for brunch at the Country Club. The wait staff was very atte","useful":0,"cool":0},"G0zIyBP70-tGiuHYIhpV9w":{"text":"I went for two Sunday brunches back to back to celebrate my birthday. The first time, not ","useful":1,"cool":0},"IH16AxVUOvqD1fu5Ih0MLw":{"text":"They have good food, and a good vibe outside by the pool (Which is Clothing optional) Spec","useful":1,"cool":0},"j0bSOgKbp0ktpJIWm9Vr2g":{"text":"My first review ever, and what a great place to start. The concept of good food, liquor, a","useful":0,"cool":0},"tUWzAeBW22jbaw2qp_cCEA":{"text":"We popped over to The Country Club for brunch last Sunday and HOLY COW was it amazing. The","useful":3,"cool":1},"Cg3p2hc0q_XR2ORSTRNXJw":{"text":"Two words: bottomless mimosas! That's kind of a big criteria for us when searching out a b","useful":0,"cool":0},"xY8NwLtxGt0bZFErMh2NOQ":{"text":"The Country Club is a great place to eat and get entertained. My wife and i had a really g","useful":0,"cool":0},"6bLt8qe-DbP8-Y4eH37ebA":{"text":"Probably my favorite experience during our trip to New Orleans was the drag brunch followe","useful":0,"cool":0},"EQkhGRed6XARtkbcqova-Q":{"text":"Neal and I were standing like two tourists at the side of the road scouring a map when a b","useful":1,"cool":0},"570hDRb2E0D8bMYPW1sWFQ":{"text":"Great entertainment, average food better had it not been cold. The service was absolutely ","useful":1,"cool":0},"ZI6nJWPiIa6Oq7l5hYyO9Q":{"text":"An excellent nearby retreat away from the drama and crowds of the Marigny and Quarter. Foo","useful":0,"cool":0},"hR_tMI8N9cN_P1jvuZWG6g":{"text":"Have only had the brunch but I will be back. Love the bottomless memosas. Staff is friendl","useful":1,"cool":0},"Yw_RfQnYEB8-XPUmDa-llA":{"text":"This place is fabulous! We went for a Coolinary dinner and started off with  party of 4 wh","useful":1,"cool":0},"EROAXbGaMpo4s_VhFyWuUg":{"text":"This was worth the cab out to the Bywater! The Country Club is a restaurant/bar/swimming s","useful":5,"cool":4},"xHHUHpbM1lxgDriVTUVrYA":{"text":"I love the Country Club and have been going there before I even moved to New Orleans. Back","useful":0,"cool":0},"dOzSstFS9xuaD5HI_YDdOA":{"text":"My daughters and I had Sunday brunch during our recent getaway to NOLA and our meal was ou","useful":2,"cool":0},"eEBr8VYkiq_wgtcufeOoIQ":{"text":"This place is just fabulous! LOVE, LOVE, LOVE, IT.  I feel like I am out of the city for t","useful":5,"cool":2},"9QjrejqimNWJd9um6kO3gw":{"text":"Excellent!! Try the Drag Show brunch. The food is good and the entertainment is great! Sea","useful":0,"cool":0},"45va2iEKDVYjV_BLuLIprQ":{"text":"you can't say you 'did' New Orleans without an afternoon here. great mimosas, great pool a","useful":1,"cool":0},"-0iyvZQ4gf7UTvlKVf36Bg":{"text":"We started off with the boudin boulettes. Three huge crispy pieces. The pepper jelly was a","useful":3,"cool":1},"_JsAUJs9coW9YdDmAKNlgA":{"text":"The place is gorgeous. \n\nFood was delicious. \n\nSound system not so great, but unlimited mi","useful":0,"cool":0},"LYMTowBOKEYtCsZ18nK5tQ":{"text":"Very strict no kids policy in the day time. Just a shout out to parents. I'd want the same","useful":0,"cool":0},"wbMw77CB3MAw05rj2dQLKQ":{"text":"Drag brunch- so yummy! And so fun! The power went out while we were there but the queen ke","useful":0,"cool":0},"snhj-_WOmm0BML9qR6Sa9g":{"text":"I absolutely adore this place. No better hangover cure than laying by the pool and having ","useful":0,"cool":0},"vy_b0qg2xRLIZmiO0LIWGg":{"text":"The food was amazing. We had the holy roller and the crab cake eggs Benedict. The holy rol","useful":0,"cool":0},"oNRuqyKpPGXoab4TgCoUZQ":{"text":"This place is a must visit! But be forewarned- make your reservations in advance because t","useful":1,"cool":1},"3jE2pEqQZ5Qycr4Rv8Bvkg":{"text":"I was writted off by the facility and its management. Yes, I talked to the manager, and wa","useful":1,"cool":0},"yCHE63m4v-B7prUsG8fsvA":{"text":"The crab bisque was good. Wish I could have eaten the $14 salad I ordered, but I got the w","useful":0,"cool":0},"g-_btUYLyM_Xedu_MxTk4Q":{"text":"What a cool place!  We sat on the porch and enjoyed a few drinks.  Next time we will bring","useful":0,"cool":0},"zg_-BXnat97SIdvWVMw3MA":{"text":"1) Yelp sucks, because I can't write a review, apparently, without installing their sucky ","useful":0,"cool":0},"ZJw3YaTardzHbh73ub34EQ":{"text":"Drag brunch is great! Good hardworking employees, fun pool, great cheap drinks. You have t","useful":2,"cool":2},"UsmWD479VgvpEfUnzvpsYg":{"text":"We've mainly gone for the heated pool and hot tub, but brunch is hard to say no to especia","useful":1,"cool":0},"23NCFhOQvwvQnTlCWX_DfA":{"text":"We had brunch here on a Sunday and it was excellent. I had the BEAT and fried green tomato","useful":0,"cool":0},"F9plmtJN-k9qvsj1tJco6g":{"text":"Wow during the weekend daylight hours this place has been taken over by hot women that lov","useful":4,"cool":3},"L03yQMX0meoQEv55YPCmkw":{"text":"Naked hot-tub/pool-party and cabana in a historic Plantation-style house, not pictured, fo","useful":5,"cool":2},"JRdWqMhHY8UJPcn_4j2Xvw":{"text":"Just, awesome. Bottomless mimosas on Sunday is great, and a great waitstaff.","useful":2,"cool":0},"Bs-I0ETGK4-dhSenUFL2BA":{"text":"Not even really sure how to draft this review.\n\nThis place is .... UNIQUE. Stumbled across","useful":3,"cool":4},"dHqROZ0qwjSvhiFp-LoRbA":{"text":"I came here with my bf for the day and we just hung out by the pool getting cocktails and ","useful":0,"cool":0},"RIGEv9kHaJBWXEr2U54tLg":{"text":"The best thing about this place is the bottomless mimosas and they make a killer bloody ma","useful":0,"cool":0},"zTnUvyb8pkJS_LCJ5Kv04g":{"text":"5 stars. Amazing!\nWe booked a reservation for Drag Brunch approximately 3 months in advanc","useful":0,"cool":0},"rt_pQvJMpPNOxtsKj7evFw":{"text":"Stumbled upon the County Club one Sunday morning looking for a place to have brunch.  Went","useful":2,"cool":1},"Wus6MJiVrorBL5MhA1Vhng":{"text":"Cool pool/ bar, except someone stole my pair of Birkenstocks within the first hour I was t","useful":0,"cool":0},"bImmTIsqEJ--qT8qqo2KLQ":{"text":"I'd like to give this place a better review because we ended up having a good time there b","useful":0,"cool":0},"LMH447gGT1jAgX6fxUaNPA":{"text":"Let me start this off with how much I love this place. We had a large group there for a wo","useful":0,"cool":0},"bZdXTGU1dBCnPAo1_Gv53g":{"text":"Must try this place out. Great food, energy and staff. Was our first stop in New Orleans a","useful":1,"cool":0},"1ya2j81FRBwnPNfE9i9FBg":{"text":"Truly wonderful brunch experience. Wait staff are fantastic, especially Sunshine! Food was","useful":0,"cool":0},"otrrmgUymq7RbIxx31RxzA":{"text":"Such an incredibly welcoming and chill place! This review is for the pool area only.  Kept","useful":1,"cool":1},"BuWsy66IJOHCXvoKGOlbWQ":{"text":"Change is the only constant. Change is good. Change has been good to The Country Club! \n\nI","useful":8,"cool":5},"Fb187axFp0YkPhgmQvj1yQ":{"text":"There is a poem by that states,\n\nGoing abruptly into a starry night\n It is ignorance we bl","useful":0,"cool":0},"rVLVFUBnQVc-5bA6h3FjEg":{"text":"Well, I feel like if you're a tourist and patronize the same place twice in a week, you're","useful":0,"cool":0},"GSKnxSodPxpSt965CrGevw":{"text":"We came all this way from the French quarter looking for something that's delicious and no","useful":2,"cool":1},"fgT12XDpnqW7wl_3z60nlg":{"text":"Orders house Bloody Mary's. made with Effin Vidka. Enjoyed the ceaser and  roasted corn sa","useful":0,"cool":0},"1guWO7vWYqC_g2HjhLD0IA":{"text":"I came here for one of the only public pools in New Orleans. This place is classic NOLA.\n\n","useful":1,"cool":1},"CU5Xu4w5b_NLIMOmVLdf-g":{"text":"Had a great meal here the other day on the front porch.  I got the fried green tomato appe","useful":0,"cool":0},"ofduUqfqlrrwFBfUI-CLPQ":{"text":"This place is amazing! From the beautiful yellow and green paint on the outside to the rem","useful":1,"cool":0},"utXkhRAIckGBCXbP8j4F7Q":{"text":"Oh my oh my, I LOVE this place! I came to Nola for the first time in February and I spent ","useful":0,"cool":0},"A-UiaFZlNeix5zjQUfHjhw":{"text":"Perfect Saturday afternoon spot. First time here.  Well looked after by the staff. Barman ","useful":0,"cool":1},"Gs5itwDizu1DoPaYNFcxYw":{"text":"Ok, So a freind calls us during Southern Decadance and tells us we have to come to The Cou","useful":3,"cool":2},"TU-Or4C9VMpIUQ9gREOajg":{"text":"So much fun!  We came here for the drag queen brunch & bottomless mimosas (1st & 3rd Satur","useful":1,"cool":0},"_ZUb86nH_bC78DX0IVrMrQ":{"text":"Best food and atmosphere! Hostess was very nice and the food was delicious! You get half o","useful":0,"cool":0},"uGg8eE6zbf8-vhniJmboBg":{"text":"The food was very good, however, my meal and starters were literally cold or perhaps barel","useful":0,"cool":0},"QnQzXRwp1TEOg60U3I494g":{"text":"There were four of us having brunch.  We wanted to have brunch on Saturday, but it was boo","useful":1,"cool":0},"BWz358zGLXVDPpu00MUPVg":{"text":"Hands down best brunch place!! Came here for a bachelorette party brunch and it was too mu","useful":2,"cool":2},"hJAVcTDBCAVxNbP_SfYseg":{"text":"This place is really fantastic most of the time. I do think that paying $15 just to swim i","useful":5,"cool":4},"14v3x6IfVx40_gbVhRs3BA":{"text":"Poolside drinks and the best burger I have ever had was by the pool! Effin mixed drink is ","useful":0,"cool":0},"hTFSIzptBW3tWCqzsmO8Ww":{"text":"We went there just this past Sunday to celebrate endless mimosas and the end of our stay i","useful":0,"cool":0},"tyrZmczVLN92kixlWQ-tLw":{"text":"I cannot say enough about this diamond in the rough. The pool, the drinks, the food and th","useful":1,"cool":1},"D1sGIs9xD4Nir4wWNG3kww":{"text":"I've hesitated to write this review for awhile because I wanted the initial nostalgia of t","useful":9,"cool":4},"inNaJXWeFFP53Y_i2Lwsbg":{"text":"Love the new look. Love the colors, love the walls with the beautiful painted birds, flowe","useful":0,"cool":0},"cVsTILRbc4iyH9lmZ0zvjw":{"text":"My fave hangout in NOLA! I visit here at least 2-3 times per trip to enjoy a cute brunch a","useful":1,"cool":1},"J3y5KPM9Cft5Yk2t_nToUA":{"text":"I love the country club! The concept is awesome, and well executed. The pool area is beaut","useful":0,"cool":0},"97gdCzEHpbnDDfcKlRsptQ":{"text":"Country Club is one of my favorite places in New Orleans.  \nThis is a review of the pool/s","useful":1,"cool":0},"gC_2V9WahgzZUt9yKge7TA":{"text":"I really, really wanted to like this place more than I did. My girlfriend went for brunch ","useful":4,"cool":3},"a8KCnE1qcI9d6KmAQbRoXA":{"text":"Thank you Yelpers for helping me locate another cool place to visit! I came here as part o","useful":1,"cool":0},"i17P2VQ4xPHrzjHZAyQaMw":{"text":"Simply put, if you go to one place in New Orleans, go here.\nDon't go to the park, THERE AR","useful":5,"cool":5},"dqrGHQ8iSK-vCk0umEU_GQ":{"text":"Fantastic spot for brunch! Wonderful service and atmosphere. Enjoy this little gem in NOLA","useful":2,"cool":2},"nQfXS-YLs4t7HinEDpGajg":{"text":"Came to New Orleans for vacation and came here twice! The drag brunch was so much fun I ju","useful":0,"cool":0},"gK58vBzpocOjceFVRS2w-g":{"text":"One of the best experiences while stating in nola. The building itself is beautiful and ex","useful":0,"cool":0},"d49pZksjdlnk0DbKTxnaPg":{"text":"Extremely impressed. Visited for brunch today and we sat at the bar, the staff was super f","useful":1,"cool":0},"ego7o-NZSV2RjMOnXKsqdw":{"text":"We are visiting New Orleans and are staying a few blocks away from The Country Club. We ha","useful":1,"cool":0},"OE--P17HBu8g_eMxGHE-qg":{"text":"The breakfast was awesome.  Fried green tomatoes with eggs Benedict without the bread. Del","useful":0,"cool":0},"gIcsYXHVlQl7JUDTLmFTYA":{"text":"Stopped in here for a drink after a satisfying meal at The Joint. While playing pool on th","useful":0,"cool":0},"7ZafoaPjRNkRYLgvxO3ybA":{"text":"The first time I visited this place was at a crazy Halloween party prior to Katrina.  This","useful":3,"cool":2},"tqshmsgQFGglqH2InLKMXg":{"text":"This place is hands down amazing. The chicken and waffles were to die for and the mimosas ","useful":0,"cool":0},"4jsl57ky6csgckcvo49tLw":{"text":"Drag Queen Brunch!  This is the second time we came here, the first time we had just the f","useful":0,"cool":0},"b3Pe0NZCueNerWWb5tQ_EA":{"text":"I love The Country Club!  I am a part time local resident, and have been to The Country Cl","useful":1,"cool":2},"g-VALJ_gjXxkVwkxsXhynw":{"text":"Food was delicious. Drinks were delicious. Boudin balls were perfectly cooked and flavorfu","useful":4,"cool":1},"sm9rps83JDdr5o8O7w98zg":{"text":"I heart The Country Club. That's just the way it is.\n\nA few months after I first moved to ","useful":10,"cool":9},"7eSo1qWtR_z074YO6EvRaw":{"text":"Soooo, I'll start out by saying I've been here for Brunch and it was quite good.  Not sure","useful":0,"cool":0},"lg8iJ7-4-U1ydvlBbjRCPg":{"text":"We had an amazing brunch out on the veranda for restaurant week. Our waiter, Juan Carlos w","useful":0,"cool":0},"awz3GqrZbfqmc8rC_8LIoQ":{"text":"went to the drag queen brunch. what can I say. we were a group of 14, the food was good, t","useful":0,"cool":1},"M2eG1NyaotNimaNkxtZwdQ":{"text":"This place is a slice of heaven. Of all the times we have been in NOLA we had never heard ","useful":1,"cool":0},"EVoePr8sNbJW8iaOdgF48w":{"text":"My first time everything was exceptional -the food was amazing the mimosa were fabulous an","useful":0,"cool":0},"0IOVrk9FwdDVO28ev7BI5A":{"text":"Our group of three went to the Saturday drag brunch on September 1st. 2018.  We had beef d","useful":0,"cool":0},"5ATk4abjLO07ql85UXR-0Q":{"text":"This review is purely for the restaurant.  The food is consistently good, fresh and flavor","useful":0,"cool":1},"lv1jz_3-fgKrncMbRQ9Unw":{"text":"Drag queen brunch ....need I say more?? Go for the queens and $10 bottomless mimosas and s","useful":2,"cool":0},"9-zhC9GgvlI24UQjS1JXwg":{"text":"I love the country club! This is one of the most welcoming environments ever and the staff","useful":0,"cool":1},"d_CqQa9zblzhRLpVn_XNJg":{"text":"I have to say that this was one of my favourite experiences in New Orleans and is a must d","useful":1,"cool":0},"H-xXiPwX7jQY0cF6tfCdUA":{"text":"Good food and fun concept.  Used to be a fun place but the employee morale has made it not","useful":0,"cool":0},"l1YsuPh9pDpmBvVnw_6JSA":{"text":"My friends and I came here for a 40th birthday celebration and absolutely loved it. Will d","useful":0,"cool":0},"AYdS8K0eCBHEC5soR_oPaQ":{"text":"This place is awful. I've been here for brunch at least 4 times (because friends made rese","useful":0,"cool":0},"8W_P2bH9Wow2tVTOYdi9BA":{"text":"We came hear during our weekend. Great find!  I had the ghost pepper margarita...delicious","useful":0,"cool":0},"mz2tiLIA6Zg9KnOCMEDFvA":{"text":"Group of us was visiting and this place was recommended. Pulled up and immediately reminde","useful":0,"cool":0},"thM7Z7re1aP2IS9ONtgVmw":{"text":"The pool is nice but way too hot for hot humid New Orleans summer days. It would be so gre","useful":0,"cool":0},"KlRIj6Ug3ssd7uA1lkmx-A":{"text":"This place is in a beautiful building in a nice quiet area of the bywater. The people that","useful":0,"cool":0},"VxPfvzEnWvpi0Veq1HN7XQ":{"text":"The Country Club is our favorite place in New Orleans, the food is fabulous and the staff ","useful":0,"cool":0},"0mzRGy6JGVA0LmUuejCsPQ":{"text":"FYI: This review is for weekend brunch only. I've come here twice in the last month and ha","useful":0,"cool":0},"r1CdUrtupBMNy21O9ezCAA":{"text":"I love this place! The interior has beautiful painted floral walls and bright cheerful col","useful":0,"cool":0},"p-6fZsqrBSUodBCpGrBDiw":{"text":"This is a little gem in the warehouse district. We parked our car here, ate, and then took","useful":0,"cool":0},"hHOZ_v-4WeTMLu7TSfJO-w":{"text":"Best shrimp and grits ever! Added bonus is the unlimited mimosas which you can take to go ","useful":1,"cool":0},"fYIh1XtiSDIEROa6WJQorg":{"text":"Stumbled across this place serendipitously on a Sunday. Went in because we needed to call ","useful":0,"cool":0},"MQarlJKS85uPLPL82QmJ5Q":{"text":"bartender was a mixologist with the drinks, ambiance was nice and food waas excellent. I w","useful":0,"cool":0},"YeLWoj_BDljXSskY_LbpAA":{"text":"Eh...so I really wanted to love this place, having heard about it from my boyfriend, who h","useful":3,"cool":2},"9xpJzXhhEW1hCYGEIHY_fA":{"text":"I highly enjoyed myself when I went the first few times. Very friendly atmosphere. Seems l","useful":0,"cool":0},"fgOsbWSyzTvVAqOsNGwpVw":{"text":"Thought we were coming here for a great brunch. The entire place was full of bachelorette ","useful":0,"cool":0},"Jtw-ZseYwtI5bV70zd-6xw":{"text":"Was in town for a week and decided to hit this place up after given a few recommendations ","useful":0,"cool":0},"16CnEYjZfQnhJ8RUBs8Q9A":{"text":"We were told it would be $20 for two to enter and were shocked because it's New Orleans an","useful":11,"cool":2},"9FO1eRotQOKZ0mzvr7rbHQ":{"text":"Love this place and super lgbt they know how to have fun I also had my first drank and ski","useful":0,"cool":0},"-_ZT9et7RM0E4a_GWaTqSQ":{"text":"This is a very difficult review to write.  I always say that a good server can rescue a ba","useful":25,"cool":2},"BpKWLSxNefrV_VwrSDT_4A":{"text":"THE Country Club is the most amazing haven in the world. You can get sauced and party with","useful":5,"cool":2},"4RKTHpS06vVpwBLfsB53hg":{"text":"Both the front and the back areas of this unique spot are killer!\n\nThe front hosts a fancy","useful":7,"cool":2},"HprpkKx6rtgsB88zUr5Kyg":{"text":"What a treat after a week of debauchery! We stopped in for a few hours Monday afternoon be","useful":0,"cool":0},"PMQM0_W7yJ6LiS-uKVrHxA":{"text":"Food was very decadent and reasonably priced. Decor was lovely. Didn't get to take advanta","useful":0,"cool":0},"cIdhd5TR-HE7G-2MrUJFDQ":{"text":"Everything was excellent! I had the Shrimp. Andouille & Stone Grits with a mimosa. This is","useful":0,"cool":0},"tmXPeYQzpjrBqtVTVbn8MQ":{"text":"A group of us went here for dinner this weekend. The menu was limited. Three of us got the","useful":0,"cool":0},"qzjsYCTAHHYAs3gn3cKuHg":{"text":"Great food always... come early shrimp and grits so amazing dont forget about the chicken ","useful":0,"cool":0},"okaPLE1mwBnMDVeTahwcFQ":{"text":"My first visit and Im already SOLD. It's everything I ever dreamed of for the perfect peop","useful":14,"cool":11},"LnRvTE6kn3n1gt0NdS4hKQ":{"text":"Beautiful setting, wonderful food, and warm, professional service. We had a walk-in of 10 ","useful":1,"cool":0},"AUzBLw_CZgMzwTpYkn3oCg":{"text":"The bottomless mimosas on Sunday were excellent -- and tasted great! The wait-staff was al","useful":0,"cool":0},"_bLRzHr2AWtZxhbdvkgI_g":{"text":"this place is super fun and the food is really good. have been here both just to the pool ","useful":0,"cool":0},"I3IyUecACOR9pKoCvlR_-g":{"text":"One of the best i had in 2016. The bottomless mimosas and we had the Benedict..The enterta","useful":2,"cool":0},"W3syqJ6m910p3co-m7sp8w":{"text":"Love their brunch, pool, and drag brunch!!! but since the menu revision I have been less i","useful":0,"cool":0},"agxxVbxBDAYOBl0m8KDAsg":{"text":"We stayed just up the street this past week and though we didn't take advantage of the poo","useful":0,"cool":0},"PkvMUpoZWgYlckM0ddeOZg":{"text":"This place rules! Best chicken and waffles of my life with bottomless mimosas mmm. This re","useful":0,"cool":0},"-yBMIABxXaso1ft7CNjhJg":{"text":"The drag singers are great.\n\nThe food was fine - nothing special.\n\nThe service was HORRIBL","useful":5,"cool":1},"ELIWUOGZm4YtAyecXACXtQ":{"text":"We came for drag brunch- the queens were amazing, and the food was ABSOLUTELY incredible. ","useful":0,"cool":0},"tzg2BcKzznPZ62GoGtj86A":{"text":"Delicious food and good service. We went with a big party for brunch and I ordered boudin ","useful":0,"cool":0},"-JtKscytgUAgww_MvSDh0Q":{"text":"I have been going to The Country Club since I was 18! Things have changed in 10 years and ","useful":17,"cool":9},"MFoxGVJq4GTn2NftRtadug":{"text":"We went for drag queen brunch on a Saturday.\nApparently they book all the tables for it li","useful":1,"cool":1},"v0ilzrWK3sV8FJwWrIwnzQ":{"text":"So i was kinda freaked out that this trio that was making like a human sandwich was starin","useful":1,"cool":1},"wqfNv-0yL27OiCxKoX_BwQ":{"text":"Well.... After dinner at The Country Club, I am convinced that the Bywater is the hidden f","useful":3,"cool":0},"HN12grGuzKpXqg9OiSQ4Mg":{"text":"I made a habit of coming here with the same group of friends nearly every  Saturday last s","useful":5,"cool":4},"pVWpdBYeSQjzOf2lADJsdg":{"text":"After several New Orleans friends telling me not so great things about this place. I had t","useful":4,"cool":2},"DymInnF42xVBwZyzBvOIiw":{"text":"Spent the day there laying poolside sipping cocktails and having some yummy food as well. ","useful":3,"cool":6},"2SUE_3QXaVbBqz0Ez-i3BQ":{"text":"Great place for brunch in New Orleans. Bottomless Mimosas and Bloody Mary bar. Fun atmosph","useful":0,"cool":0},"_e9hIqTgHlOelpqdqvkBDA":{"text":"Country Club is under renovations! Didn't stop me from having bottomless mimosas and a ban","useful":1,"cool":1},"okhODfAF6cLaJt-Lm0uErg":{"text":"The food and performances were great.  I got the pan roasted Louisiana White Shrimp and th","useful":1,"cool":1},"_PsPzl_t5wn1tsiVpYbrhA":{"text":"I love that the swimming pool is clothing optional.  They even are known to throw in some ","useful":5,"cool":2},"BGL8T5BrtP_tQLHwtndxxQ":{"text":"It's been 3 long years since I've been to the Country Club. They just recently renovated t","useful":3,"cool":4},"q9y38Dp1fT5nB9T6Dt1xyA":{"text":"When you hear the name of this restaurant, you expect something fancy. But, in true New Or","useful":1,"cool":0},"Z-L_xPlGHRnSmWJivwaB_A":{"text":"I created a Yelp account just so I could rave about this place.  We made a day of it -- sp","useful":0,"cool":0},"Nr6l1FqrRUDQxsJmzc88Rg":{"text":"The Goat had a fun prank pulled on him and was lured to this place by the promise of nice ","useful":6,"cool":2},"fF1k38jcgfXBQUcuJg97cg":{"text":"This review is only for the Saturday drag brunch.\n\nTip: a reservation is a must because it","useful":3,"cool":3},"o6_8oXaCPsxXiYNiTsGF7A":{"text":"I have been going to The Country Club since I was 18! Things have changed in 10 years and ","useful":0,"cool":0},"HDEVWlOFYmWFqNz3Vi77Wg":{"text":"Gorgeous atmosphere, delicious food and the friendliest people! Must stop in if you're in ","useful":0,"cool":0},"SrQnjOeWAsxhq1VmFxJ3Aw":{"text":"Food is ok, our waitress was awesome, she accommodated all my requests...but the noise lev","useful":1,"cool":0},"22TOkGeehF85lcWJrOSlEA":{"text":"Great food and a clothing optional pool and hot tub. What more could you want?","useful":2,"cool":0},"u0-tVjtF7mKSsBQNPlzAfg":{"text":"So much fun! Beautiful old mansion. Great brunch and the \"Girls\"  make your reservations e","useful":0,"cool":0},"gvmVq_Vty3fgpd_iOhYeHw":{"text":"What happened to the TOTS ... Bring them back! Mimosas and tots !! Love you guys but you a","useful":0,"cool":0},"bKhpSTFcKeoY5k2xBdwuFw":{"text":"I had such a great afternoon here. I arrive at 11 on a Sunday and it was easy to find park","useful":2,"cool":1},"hBUVO_WgcpdvM6s5YadUeQ":{"text":"Came here with a group of girls to use the pool. \n\nPros: pool is great, food tasted good, ","useful":0,"cool":0},"59vHCH0EDfSMMji3TNjWeA":{"text":"Great food, but terrible service.\n\nThe waiter, who never did tell us his name, just could ","useful":1,"cool":0},"JWYfkyI7miNHHAQRWGnhhA":{"text":"This place is great. Drag brunch, strong drinks, plus a pool out back-- genius! If you get","useful":0,"cool":0},"6g-d4XeirsIPegW0LN-Ghg":{"text":"I hadn't heard about this place before and a friend suggested we go for brunch. It was pac","useful":1,"cool":0},"S1RK9WfFRz6o8QGi2il3yw":{"text":"The food was very good, however, my meal and starters were literally cold or perhaps barel","useful":0,"cool":0},"7kcP-4IFtLCHJd9vi-vmHA":{"text":"As advertised! This gem in New Orleans ByWater is an excellent place for dinner...and for ","useful":1,"cool":0},"-4b9K33B_Rftz0ZjJP6Z-w":{"text":"Hello delicious brunch! I can't wait to go back. Our waitress was sunshine and she was a r","useful":0,"cool":0},"bsOWN6D8_CYW8Y7XOqwakw":{"text":"I normally have had great experiences at The Country Club, but this evening was a little d","useful":0,"cool":0},"obKBg19wcZRaurAyBcz_Dw":{"text":"Went for brunch for the first time today and got the potato gallette and grilled tomato be","useful":0,"cool":3},"sF_HXq-pSgo7poxguxbxwA":{"text":"I was really looking forward to going to The Country Club based on the overwhelmingly posi","useful":0,"cool":0},"ThWaUBvMShDCl7-gjqon0g":{"text":"My husband's fried chicken sandwich would be worth all five stars alone, so five stars it ","useful":0,"cool":0},"4opbVrrmeKXb7JI18E7S9Q":{"text":"Phil makes every trip to the country club a great one. He is an outstanding bartender and ","useful":2,"cool":0},"ABnNqT9s2ECuAkmh9Y_B4w":{"text":"While in NOLA for a bachelorette party we attended the Drag Brunch. Although the Drag Brun","useful":0,"cool":0},"chrDvVvOj5StFhZpV0kxCA":{"text":"The food wasnt as good as i was hoping. we didnt get to try their brunch or bloody marys w","useful":0,"cool":0},"k74W9F99zX4tK4F6OvUDaw":{"text":"Cool and funky spot with a pool, restaurant, and bar.  Gets busy and fun on the weekends a","useful":2,"cool":1},"2VWaJ1Ve0kNuxqJx03H1qw":{"text":"First time here & was really looking forward to the chicken & waffles. Waffles were great.","useful":0,"cool":0},"t_TN5kroHTHOzGOrgf7ycw":{"text":"What a beautiful place! From the entrance to the bar, dining area, pool, bathrooms....its ","useful":1,"cool":1},"gixeb6EBjlZUcGEHDU-2uA":{"text":"This place is awesome. You can spend the day at the pool and enjoy the hot tube and sauna ","useful":2,"cool":0},"nGcisLeLHvXGq9jPOrsI1w":{"text":"Had a great time at drag brunch today for my sister's bachelorette party. The food was del","useful":0,"cool":0},"IDCZVSZrUNnIvRAusjUirw":{"text":"I came here for the Saturday morning Drag brunch with my husband (we were in town celebrat","useful":2,"cool":2},"kvRSAiWAe4BEd-vTsLYLJQ":{"text":"I have nothing but good things to say about the country club. I usually go for brunch on e","useful":2,"cool":1},"Uv0Zo-HcHH6y78c2hOuUJQ":{"text":"How can this place get less than 5 Stars? \n\nHere goes... it's Saturday afternoon, My frien","useful":2,"cool":0},"K7Ij4m2x6G66_HqRWkh0yQ":{"text":"After telling myself for months that I needed to get over there, I finally visited The Cou","useful":7,"cool":3},"VgOpAVpebOlZlC-Lydt6lw":{"text":"Absolutely in love with this place food and atmosphere and people so affordable. I will de","useful":0,"cool":0},"ArL6VdIHiISgvwlRtteIXQ":{"text":"First of all, this place is super cute and everyone is so nice, but I got the chicken and ","useful":0,"cool":0},"V9_V4BQXFjdVLshVENVScg":{"text":"By far, the most fun I've had at brunch and quite possibly ever. We went for the drag quee","useful":0,"cool":0},"L1lXOsPuDDuK9PX8Svc_9w":{"text":"Great food! We tried to get in on a Saturday or Sunday and it happened during labor day we","useful":1,"cool":0},"ENWxxtNlO-09oLf6Zj2pjg":{"text":"This place should be five stars across the board! Such an absolutely amazing experience!\n\n","useful":0,"cool":0},"HhutrXWHB7pGAt4LBvmfpQ":{"text":"Loved the food! Had crab bisque, fried oyster app, and a virgin mojito. The hand painted w","useful":0,"cool":0},"GKJjrf-7hNv5CeKTfKUcvA":{"text":"My girls & I chose this place for brunch to kick off a bachelorette weekend and it was so ","useful":4,"cool":4},"dVFcAdjM0eT4YJpKWIoN1g":{"text":"It's summertime in the city... and you know what that means kids... it's time to search ou","useful":7,"cool":5},"Znafqn55p5DbCEqwhDqxTQ":{"text":"This spot is great for brunch - funky but with fresh fare...and bottomless mimosas for $15","useful":1,"cool":1},"7p-wIskwTcMKejXQwo7ERw":{"text":"UPDATE:\n\nBrunch is way overhyped. Had a miserable time at brunch. I went to Regular brunch","useful":0,"cool":0},"I5CKtf7xYDgYtGVzXnLmmw":{"text":"Some Sundays you just need to be catered to.... with an unlimited supply of mimosas, coffe","useful":2,"cool":1},"rDiI5ofCp5162YfR3hgEbg":{"text":"This is a really cute place to go hang out on a hot sunday afternoon, even though i went o","useful":2,"cool":1},"jHKxrWIvtLOS3e12bOnCRg":{"text":"What a fabulous old building renovated and modern. The ceiling are huge and the entire pla","useful":0,"cool":0},"GI2oiX0AbF3fSUzesK5Mig":{"text":"I've been going here for for nine years and the staff here is the best. Especially Mike P-","useful":1,"cool":1},"AID2fxjfKUKx5IKq4fp-tg":{"text":"This is not your average place to have a good time in New Orleans. Food was scrumptious, b","useful":0,"cool":0},"GqDP2U-toGsdXLeisC1mgg":{"text":"This is my favorite spot in the city. The drinks and atmosphere are out of this world! The","useful":0,"cool":0},"qt11CcEOSXz0fDzokYvg3Q":{"text":"I feel like this place is all you could ever dream of when it comes to brunch. You're sitt","useful":1,"cool":3},"z8QbKF6feFM6PqG3Ti8H8g":{"text":"The best part of this place is that they don't let anyone in under 21! Getting carded at t","useful":0,"cool":0},"Cjkq2rgo9lPfTyj0so4LRQ":{"text":"This place was so much fun!! We did the brunch unlimited mimosas were so good. I believe y","useful":0,"cool":0},"AOT_Uvq7h_03WjKEXJqgIg":{"text":"Came to the Country Club for the brunch drag show- and had an absolute blast! \n\nI made res","useful":0,"cool":0},"5Er53PzoDQa-ZbOfFxw8Qg":{"text":"I am re-reviewing my most recent pool experiences. Apparently the pick up place is the hot","useful":21,"cool":2},"XyMaBS6WF-fCDsI6tEML3A":{"text":"Oh hello, drag brunch. What more do I need to say?? Ok, ok, fine, I'll tell you more! A fr","useful":4,"cool":4},"z9vVyEx639_TmWW5Zp-hHg":{"text":"This was such a great find on my last visit to New Orleans! We went Sunday during regular ","useful":0,"cool":0},"vw6ZYhbUIW_W_NFoDd6yDg":{"text":"I can't comment on the restaurant as I have never eaten there even though I have been to t","useful":1,"cool":3},"a4ofhVz9VJuiZdlDuOpfig":{"text":"The outside of this place is really nice and almost out of place in the neighborhood. It's","useful":2,"cool":1},"LwSOxXgxsDAlGEwcZRZ3rA":{"text":"$10 bottomless mimosas on the weekends!!!! That is really all you need to know!!\n\nFood = Y","useful":3,"cool":3},"NnMZv9ItdB4Pa9zXngulSg":{"text":"Came here on a warm Thursday around 1 pm and this place was crowded! The reason I only giv","useful":0,"cool":0},"9Xy2g0Y_G900Tr6tgnnAZA":{"text":"Well, I really wanted to love this place but it leaves MUCH to be desired. The pool and ba","useful":4,"cool":2},"i9wT855-yPiTDI1XstXGOw":{"text":"So this restaurant is not in the French Quarter but we found it during our search for bott","useful":3,"cool":1},"bl2M3y3PkukWw7GZtlLLYw":{"text":"We almost decided to cancel our reservation for Sunday morning brunch because we stayed ou","useful":0,"cool":0},"agecLsVnwBpNgIw1Fd6Sag":{"text":"A fabulous, young, hip, chill, open minded restaurant. The name had my friends and I wanti","useful":0,"cool":1},"tJ2nTb0SWgC9At88lx7kmg":{"text":"This place is awesome on the weekend's!! I loved the Drag Show!!! This place is beautiful,","useful":1,"cool":1},"APYG7Mb3vh55B8Z6F1U3nA":{"text":"Awful. I had a reservation that I confirmed the day prior to my anticipated visit with fri","useful":1,"cool":0},"WrFxm33NrHEhrpnqIiwJTw":{"text":"If you're looking for a good time, I suggest heading to The Country Club for their Drag Br","useful":2,"cool":1},"8Q3Wg-rWYkBeyb4M8ZLHdQ":{"text":"So everyone knows, the high ratings on Yelp are NOT for the food, they are for the \"clothi","useful":1,"cool":0},"DjWj2JE0brO93jGsxyzahw":{"text":"I've been here probably 10 times before and after the \"clothing optional\" change.  Usually","useful":9,"cool":1},"f1ym4heFkFm2tlM-Ek-K-g":{"text":"This review is for the pool... And for the nekkid good times.\n\nI jest. I didn't get anywhe","useful":21,"cool":23},"WW6LJWFdiQWamQxo0dU79w":{"text":"I like many things.\nLike donuts, my wife, and Fridays at 5.\n\nBut I also like brunch. \nIt i","useful":4,"cool":3},"hT3xoigoyFVqe0JTKyeNZg":{"text":"Brunch one star for Cold hard as a rock waffle. Flat over cooked chicken. Sweet cream ice ","useful":0,"cool":0},"W5Q2c3Rgj1qASycaFMwxgA":{"text":"This is a must do for reveillon we had a super time in an incredibly prepared Reveillon ho","useful":0,"cool":0},"y6VKTUZ9G78cdVMn1T2TtQ":{"text":"This was such a great find on my last visit to New Orleans! We went Sunday during regular ","useful":0,"cool":0},"CI8PtPsVbF6mCiuSUTlb4A":{"text":"We had such a good time at drag brunch. The food was amazing, our bottomless mimosas were ","useful":0,"cool":0},"q3qqHxSxOAZ7yUtQCScVPw":{"text":"So visited the country club today and the service from beginning to end was amazing .. I w","useful":0,"cool":0},"PX3As9rrOty7yZvqpeIs3Q":{"text":"A friend who lives in the Marigny neighborhood of Mew Orleans wanted to enjoy the sauna, I","useful":1,"cool":0},"QjZoQ3xaTE3bDTic943t9w":{"text":"This is one of my favorite places to brunch. The building is an old New Orleans cottage wi","useful":2,"cool":1},"1j31NbQGj22XIRLQh8MrtA":{"text":"I love this place for so many different reasons. On Saints noon games, grabbing a seat at ","useful":6,"cool":6},"mzlzE5w_j3zHOV5b_CkZmw":{"text":"Reserved a table here during our girls trip. The food was AMAZING. I ordered the eggs Bene","useful":0,"cool":1},"HxN2ya5SmgiW3MoaQUjToA":{"text":"This place is amazing! We had the tuna and buratta tartine, fried oysters, and the tomato ","useful":1,"cool":0},"LyqxSdiTenbtDdKLnGMIXg":{"text":"Came here for my first time today, no membership, $10 entry and $2 for a towel. Yes, there","useful":4,"cool":1},"cAEEgsUfXBYAUDPEGlF2gQ":{"text":"I've been wanting to try this place for a long time and was finally passing through the ne","useful":0,"cool":0},"Wgi40Uh2qCmM2H45A93reQ":{"text":"UPDATE\nDinner better food than brunch but I would recommend.\n\nBrunch one star for Cold har","useful":0,"cool":0},"jv-QuzylqYH4U40H5UD6lA":{"text":"They do a mean brunch here! We had the crab cake starter, and then split the fried green t","useful":0,"cool":0},"wBi1CJ13Ft7wMGkpYsmKLA":{"text":"*Strictly a 21+ place - they ID you at the door*\n\nThis place is beautiful. Located in a re","useful":0,"cool":0},"qBALft6ikYI3G1swHm6E7A":{"text":"Today we went to the Country Club's pool for a relaxing afternoon. They gave me a free ent","useful":0,"cool":0},"JTOb_sHMZ2baE-3riy_FKA":{"text":"This restaurant is absolutely gorgeous! The food is upscale southern, smaller portions, co","useful":0,"cool":0},"IwyMIbCnl4M20iV6RlwFlQ":{"text":"Loved the vibe.  Boulettes were amazing and actually the reason I picked the place.  Cockt","useful":0,"cool":0},"tLJ6iVwIs6j1bSwbddojdw":{"text":"Girlfriends went to the Saturday Drag Brunch. Highly recommend!! Make sure you make reserv","useful":3,"cool":1},"c6apumpxXeHMXHUtlKtEBA":{"text":"We were down over Mardi Gras weekend and it was recommended to us that we had to go do the","useful":0,"cool":0},"PDiD321O6BTTQupiIWORvg":{"text":"I accompanied my wife and her best friend to the Drag brunch and it was a hell of an exper","useful":3,"cool":2},"x8V7zOumGRG4ZKvAp9OYkQ":{"text":"Very aesthetically pleasing! Our server was super sweet and accommodating. I do wish their","useful":0,"cool":0},"ykt0auUpahfiKAMcmwYhjQ":{"text":"Very trendy beautiful restaurant  in NOLA, it has a pool, however the staff is sort of rud","useful":1,"cool":0},"uzCzbiQPG80Pn0-huFkxzg":{"text":"Thoroughly enjoyed brunch at The Country club. The pictures of the inside don't do it just","useful":0,"cool":0},"mhUb6kvybkhW6B6_4PgKVg":{"text":"If Lilly Pulitzer were to eat brunch and go for a swim in New Orleans, it would be at The ","useful":1,"cool":0},"1pQZeVhLAWsVO6SseJziXA":{"text":"Went with 8 other ladies- we had a blast! Food was good and servers were very nice. I love","useful":0,"cool":0},"NI9qD6u7SzpFF2koSeQYeQ":{"text":"Very disappointed, we drove all the way here just to be told that they will not be able to","useful":2,"cool":1},"Wxws2YMv_Cs9TyuJkGlwcA":{"text":"What a beautiful place! The drinks and food are amazing and the bartenders are well versed","useful":0,"cool":0},"2UkuGO3j78TKLAT8rSHp-Q":{"text":"I had so much fun here! My bridesmaids did a mini bridal party for me here and it was so a","useful":0,"cool":0},"kOai9Ta_Hfsi1HVbkoqn0g":{"text":"A lot of fun, good people,. cheap cocktails.  Hot tub, pool noodles, etc. GOOD FOOD, too.","useful":2,"cool":1},"l6m9aTPhoAprYr5n8v0CMQ":{"text":"Awesome late afternoon Sunday brunch. No reservation so we ate at the bar. Keep your eyes ","useful":2,"cool":1},"dpoAkwypyphB0AV-xDwVlw":{"text":"OK. We just finished the Zombie Drag Brunch for our 2nd time in 3 years. First year we lov","useful":0,"cool":1},"-m7NVL6mvZvXlNcdzaf5-w":{"text":"Fun, fun, fun!!! Great atmosphere and good food. Host at the front had a bit of a 'tude bu","useful":0,"cool":0},"18OKPUeWO0IFcnyHaQKeuA":{"text":"It was very delicious, and they are very accommodating as well. They took care of our lugg","useful":0,"cool":0},"lxRPInfvWCDHc9I7-gx20Q":{"text":"Jonathan is the best bartender ever. He is attentive and patient. The steak was awesome. B","useful":0,"cool":0},"dP2jXEsaoPOFK58xJfy0-g":{"text":"Wow I've had so many fails in New Orleans with restaurants the country club really shows h","useful":0,"cool":0},"uHjNGzo2cND5ZXhSTvXsGA":{"text":"Disappointed to have to write this having come here two times before without any issues, b","useful":1,"cool":0},"lrBeUpKw10zDEbWKQWH7fw":{"text":"One of the cutest places in New Orleans!!! Very LGBTQIA friendly and we felt right at home","useful":2,"cool":0},"qVIgiIeiq8-N3vq9HYUt9A":{"text":"Good drinks and good food, bartenders are real nice and will assist your taste buds with w","useful":1,"cool":0},"NOstuVK9mH4vj4qS7dnPuw":{"text":"When I say I had the time of my life here, I'm not exaggerating.  I heard about The Countr","useful":3,"cool":2},"Axxjbn1d_V1XnFZHbcjCpA":{"text":"Loved the atmosphere here! It's a house turned into restaurant in a residential neighborho","useful":1,"cool":0},"P2A2Fx8ngae1tTj2dR-VMg":{"text":"Favorite place to go and relax by the pool or get a couple of drinks inside. Phil, one of ","useful":1,"cool":0},"ztRz1Ev0oA_7H6XIF9Ifww":{"text":"Finally got to go here for Drag Brunch and what an experience! Their brunch is definitely ","useful":1,"cool":0},"Qd82Kb0sK1eIvIchxNLoRg":{"text":"Great staff, wonderful brunch, fun times , amazing atmosphere.... Saints Sunday's are amaz","useful":0,"cool":0},"7TXesJfblaPvfrkw10k3mw":{"text":"This is one of the greatest places I've eaten in New Orleans. We went for the pool but sta","useful":1,"cool":0},"nAFFkvfEu8UoQHrwOUrtKQ":{"text":"OH MY GOD!!! This an underground Gem! Hidden deep in the Jungle!! LOVE THE FOOD and the am","useful":1,"cool":0},"4wR_EFWG-pRB1KhMOuQg-Q":{"text":"I love the paintings on the walls in this place! So cool being surrounded by giant murals ","useful":0,"cool":0},"hnCsYoImrN02jR72y5qiSw":{"text":"I can honestly say I haven't had a brunch experience as good as this before. I look at bru","useful":4,"cool":1},"KkxTFUrIEZZM-_MonFHiOg":{"text":"I can only talk about the pool since I have yet to have the food but where has this place ","useful":9,"cool":4},"YbT3zxY61ntjnAEDG17ftw":{"text":"Not at all what I expected when I made the brunch reservation. The name automatically make","useful":2,"cool":1},"xm2TEIm8sxdrgM52TUwJLA":{"text":"There was a nice ambiance, clean bathroom, and great food. I wish I got more with my shrim","useful":0,"cool":0},"cd91BQOCI_SoweOanik3-Q":{"text":"If your looking for a mature pool side bar environment this is definitely your place and w","useful":0,"cool":0},"oisS8enwYX3e3BwQ5kzZXg":{"text":"I was excited to check this place out as they have drag brunches-What could be better?!  T","useful":0,"cool":1},"Ts-wqBXMOWbFi9_Q6Ew1dQ":{"text":"The is one of the most beautiful restaurants I have ever been in! The walls are beautifull","useful":2,"cool":0},"VsLzcqjX4vJv87YT1q1gSA":{"text":"Me and my friends were visiting New Orleans for spring break this past week. We had an air","useful":0,"cool":1},"T2r1FOpU9lknKgmZKYlxKQ":{"text":"I really wanted to like this place more. It is really beautiful inside and out. I did not ","useful":0,"cool":0},"9kX20OJDVXUyUcv9T0eHEQ":{"text":"This review is for the pool.\n\nWhile visiting NOLA, a friend recommended this spot for some","useful":2,"cool":3},"-79FGnfTXiwo-j-oPMfzqw":{"text":"Every time i go to the country club i always get such awesome reasons to never come back.\n","useful":7,"cool":3},"PWUdagAkTiIwgKwddUc4Vg":{"text":"Totally awesome experience. Very New Orleans \"low brow\". Food is ok. The place could use a","useful":0,"cool":1},"L34UVl7L6JAM1S_3sxgKyQ":{"text":"The pool area has a relaxing friendly neighborhood feeling.  People are fairly social and ","useful":1,"cool":0},"ZXQGsQFwkBqsnpkkfqVLhw":{"text":"Amazing mimosas, amazing atmosphere, great food, fun people, perfect weather, absolute par","useful":3,"cool":1},"35MGiRMx1uD2VEH9IX6EHQ":{"text":"Currently sitting at brunch...still waiting for our bachelorette's entree...and waiting...","useful":0,"cool":0},"87VAIF5zpFSrEjn-p8FMYg":{"text":"Pretty unique spot - like a lot of places that we visited in New Orleans, you will drive t","useful":2,"cool":0},"jGBfvoxtwfVREIuSLzDUDQ":{"text":"We had the pleasure of dining in at The Country Club for Sunday breakfast. We made reserva","useful":0,"cool":0},"FjAfqaui-8kSVFFKDlQ2DQ":{"text":"Just left here and will definitely be back during my next visit.\n\nI only came for brunch, ","useful":0,"cool":0},"R8ARuzMBKHdf6mnGgrn6Kg":{"text":"This bar turned an otherwise fun and fascinating trip to NOLA into possibly the most life-","useful":5,"cool":4},"iufDVuL356dDhJzFUhFQhQ":{"text":"Beautiful place- found randomly while walking in Bywater. The bartender was so friendly an","useful":0,"cool":0},"MiyhGvdbFN0aKP-5DE-kAg":{"text":"Brunch amazing! Staff amazing! We had such a great time. The host was so friendly and cari","useful":0,"cool":0},"a1Hm-TTSLog05Be9G5I2IA":{"text":"Best brunch ever! We were three for a bachelorette and were treated like royalty. Everythi","useful":0,"cool":0},"LKQHzfY28zZMy_cji7n1YA":{"text":"This place is top notch. The cuisine is outstanding. The chef really puts a lot love and p","useful":0,"cool":2},"YZdwIr7gweYSbcz85PI9Ag":{"text":"I love the refreshing pool, cocktails, food and friendly staff at the Country Club.  The h","useful":5,"cool":1},"jjOCyHq7b6kUvGkdu9DVfQ":{"text":"One of my favorite Bywater places to visit. It is in a residential area so be courteous of","useful":1,"cool":0},"SVZgKUCHJnpGJOfDtZSFQQ":{"text":"Came here with 6 girlfriends for an afternoon lunch and drink outside.. Very cool space, w","useful":0,"cool":0},"ZZCmf1q-YlHGe9PPBwv7yQ":{"text":"LOVED this restaurant.  We went specifically for Reveillon and were delighted.  Those of u","useful":0,"cool":0},"9m-FrDY6S7VDwAy-L_TAlw":{"text":"The Country Club Nola is not what you would think of it by its name, other than it offers ","useful":1,"cool":0},"mUsqd9ZUvSCp69Aa4glM9g":{"text":"I came here for my bachelorette party with my friends during their drag brunch. I think ne","useful":0,"cool":0},"hFjrqJVsBkoQbqOWA8Ppfg":{"text":"Absolutely love this place! Perfect for a bachelorette party!! The performers are awesome ","useful":2,"cool":1},"2iUYnGZCLJvodehsw4dyrQ":{"text":"Brought a group here for a bachelorette brunch, and it was easily the best experience we a","useful":0,"cool":0},"vPKr5kFw4891B605jl5lDg":{"text":"\"Wanna go to this sort of gay bar/pool/hot tub that's clothing-optional?\" They asked.\n\n\"Ye","useful":7,"cool":4},"E9ZnoDliTQ9PN0SxyWTJBA":{"text":"An absolute ball.  We went for the drag brunch and laid out at the pool after.  So so so s","useful":0,"cool":0},"-JUQv5f1T-ltUaaFVYD7Ug":{"text":"The best food, service and cocktails in NOLA!  We had a wonderful corporate event there fo","useful":0,"cool":0},"y-GxYMNgw0leH7SPkz4d5w":{"text":"By far my favorite bar and grill, good food and drinks and i met some of the coolest peopl","useful":0,"cool":0},"O5oKrWTk6rEoFQicAlK2Kg":{"text":"This is one of the greatest places I've eaten in New Orleans. We went for the pool but sta","useful":1,"cool":0},"aom3nhInsC-N6HzRh3fWyQ":{"text":"Clinton and Nathan are the absolute best.  That's why I give this place a 5. The food is g","useful":0,"cool":0},"M0Z_Q_rJUpFHGOqlSH6Aiw":{"text":"This place is incredible. I go here every time I'm in town. The food is amazing and the at","useful":0,"cool":0},"wGdUJlDZ0AlkYbS04gPV6w":{"text":"I have to agree with Roxanne C....I've never visited before the clothing ban as well, but ","useful":2,"cool":0},"3OswoQqVdO3NxwNlJgNRsQ":{"text":"Very rude guy at bar takes you license as of you are a dishonest person.  Not a gay friend","useful":1,"cool":0},"CdRxMI-saRvp1mPV_BSrgA":{"text":"Worst ever meal in 20 years coming to NOLA, cold lamb chops, appetizer and entree served t","useful":1,"cool":0},"4LBJPSuWmo0XhNwYKKUDMg":{"text":"Came here for Sunday brunch. Did the bottomless mimosas (good balance for the strength of ","useful":0,"cool":0},"GD_UkPpeo5RGl4gfn2yyYQ":{"text":"Saw all the good reviews and thought lunch here should be half decent...nope!  Food was sa","useful":1,"cool":0},"5oIrAc_XpRr-rlkn_wzJQg":{"text":"Super fun eclectic restaurant and bar with an outdoor patio and gardens surrounding a for ","useful":1,"cool":0},"EtMK_6Lu-2sQkpwcibEgWg":{"text":"This was my favorite place to eat in New Orleans. The food is amazing, the staff is excell","useful":0,"cool":0},"QUH6lmXVb16OQ2OoSTOBag":{"text":"Stopped by with a friend and wanted to show him how pretty the back area was.  I explained","useful":5,"cool":0},"HD2d9TV8GgOyyIGLD_nozA":{"text":"It was very delicious, and they are very accommodating as well. They took care of our lugg","useful":1,"cool":0},"SniCtVvmnNxBOjE5E7iXOw":{"text":"My sister and I had an enjoyable time here during one of the Sunday brunches for the drag ","useful":1,"cool":0},"RgARljh_BcadtkCyxqdazA":{"text":"We didn't care for the table they had crammed the 4 of us into and they were gracious abou","useful":1,"cool":0},"pf9k-0HPzMokWIZ7KuB7rA":{"text":"Went here Saturday for drag brunch, we had 8 people and made a reservation 2 months in adv","useful":1,"cool":1},"GT_AIGkjkgW_y4AKjGz0SQ":{"text":"CHILAQUES!!! Literally the best thing on the menu!! Next to best on the menu is what I lik","useful":1,"cool":0},"_ZPqJ43U0owxgQlNesGoug":{"text":"We came to New Orleans for Wrestlemania from Minneapolis and this place was recommended by","useful":2,"cool":0},"HBwTcvWauSvoFxpjfoeaWA":{"text":"The greeter was very eager to ensure that we were seated promptly even without a reservati","useful":0,"cool":0},"_F-K0H1FMZd3GGBBvspFYw":{"text":"A few Saturdays ago I was treated to a surprise brunch with my closest friends.... Drag Qu","useful":0,"cool":1},"kvBuBPca8wqV-Fg_C0c7-w":{"text":"Very good food and ambiance. Reserve your space for convenience. Rob was a fabulous server","useful":0,"cool":0},"5A4NNtGs_mkzfBOcDwmQCg":{"text":"Great staff, wonderful brunch, fun times , amazing atmosphere.... Saints Sunday's are amaz","useful":0,"cool":0},"OthKopwlhxSmzOT_Wwhk-g":{"text":"Sad the service was so poor, NO dairy free options, in fact, the bartender acted annoyed t","useful":2,"cool":0},"LQsmyvlZEmbOxdTyQNN1TQ":{"text":"In August in New Orleans and that means good eats at the best restaurants in the city at d","useful":1,"cool":1},"K_uz81zix1zE-AOVv8xpHQ":{"text":"Ate at the bar late one evening.  The food was good, with a lot of healthy-esque options.\n","useful":2,"cool":2},"HEmpZSpdTbDlHv3DNSIbKw":{"text":"My visit here was the culmination of a 6 month waiting period from a September reservation","useful":0,"cool":0},"k18iZaR8nbG2PVCn0JRLew":{"text":"Another YUMMY meal at the \"CC\"! New chef, -to die for food- and fun atmosphere.  LOVE THE ","useful":0,"cool":0},"tgV5VeJqNu5Ng5NRAD3wnw":{"text":"The people who work here are great, the food is great, the bartender Heather is so welcomi","useful":0,"cool":2},"xR_TqnfOhHDCO2kifRraVw":{"text":"Had so much fun here! It was a cool thing to do in New Orleans. I've always wanted to go t","useful":1,"cool":1},"E1Tu79ks3cR-IiopwzGyiA":{"text":"Very friendly employees and customers. I was visiting the area with girlfriends and there ","useful":5,"cool":4},"bjU15jPCqjJV8aiz3bCOLQ":{"text":"Covid set up is impressive.  Felt safe. Food and service were both exceptional and prompt.","useful":0,"cool":1},"WhmTjT5iyaslxOILlwMQVA":{"text":"It's nice to have nighttime takeout near-Ish to the French Quarter. I've had a few things ","useful":0,"cool":0},"19bRzdZMmYcKjpvzYlku8Q":{"text":"This place is such a waste in the summer. By 10:30 the pool looks like a used hooker on Ch","useful":4,"cool":1},"5y8rYehYYprpGLO0I7dGkA":{"text":"**POST-COVID REVIEW**\n\nAs a self-proclaimed foodie, it means a lot to say that somewhere h","useful":2,"cool":2},"fmlINcprt7ITcknA4EfvIQ":{"text":"Very interesting atmosphere. We enjoyed our drinks while riding our bikes thru Bywater. Th","useful":1,"cool":0},"X6XnRfsEQppFkEbJRnoUqA":{"text":"What a great idea! I love it here! Redoing a beautiful, old home and opening it for pool t","useful":52,"cool":44},"9YX9oWKvvHuGj1vn_gQ-gw":{"text":"It's been a while since I have been to Country Club. Over the years they have had a variet","useful":7,"cool":5},"3oJXEOFbMsnwrifir9f-6w":{"text":"This place was amazing!! Great energy as soon as you walk through the doors. Even better p","useful":1,"cool":0},"gugdTHM3bu85He1mz6Fshw":{"text":"The crab beignets were wonderful and the best chateaubriand I have ever had! Even the au j","useful":2,"cool":0},"lEgbhiA-uIQHNvZBTFy3lw":{"text":"I never miss a chance to hit up this spot when visiting NOLA.  The food is delicious, the ","useful":0,"cool":1},"GSGMoarOxJbHIvRRf4lAqQ":{"text":"Nice relaxing place to come for lunch or dinner. The front porch is a wonderful lunch spot","useful":1,"cool":0},"0BqUbQvuorhMWzilpqn0aA":{"text":"Great spot to get away from the hustle and bustle of the French Quarter and Bourbon Street","useful":1,"cool":1},"pHoMKLPTYjM1QCaAbUQMEw":{"text":"Honestly one of the gems of New Orleans. There is no other place like it. Although I miss ","useful":3,"cool":5},"K8BhC4DeQLqE4_KoRD-19w":{"text":"I like the country club. This is my second time coming here. Good food and bottomless Mimo","useful":0,"cool":0},"OxCz91SaElRZKdMPrXNRMg":{"text":"I wrote and they listened. Members of the pool get members only access  after 11pm. The po","useful":0,"cool":2},"ImQhAx5XA_GUabaUnelHiQ":{"text":"I forgot my cell phone at the hotel and I was so sad because it was so beautiful inside! A","useful":1,"cool":0},"2dtraXsXj5Ut5kMGGvTCnw":{"text":"This is a beautiful location inside and out. Inside the murals on the walls of flowers are","useful":0,"cool":0},"TtgaeI0-_yQIBq0OPE2OiA":{"text":"Total thumbs down, let me tell you. Went in ordered a bellini said lite peach, as he was p","useful":1,"cool":0},"JpYi98Fg_DKEi8Dp7cfUOw":{"text":"I went for the drag brunch and it was so much fun!!!! $15 bottomless mimosas and pretty go","useful":2,"cool":1},"kMoU5WB3I57woLuIVE5XUA":{"text":"THE BEST BIRTHDAY DINNER EVER\nThe seating was glamorous, service suburb, the food was devi","useful":0,"cool":0},"6Px2CiZK1o_KSKXbwjjDFQ":{"text":"When you visit New Orleans you expect a culinary treat but this exceeded my expectations. ","useful":1,"cool":0},"yiAr2b7-RFQjlN9MeHM8fQ":{"text":"I hadn't been back to the country club since it became clothing required and I was actuall","useful":0,"cool":0},"6E4UuTM1y7CU3DDs3XlSMA":{"text":"Went to this establishment with a large group for brunch after being suggested here by our","useful":3,"cool":0},"drRuCSiCfWtzJzE8iD0Wpg":{"text":"My experience with Country Clubs begins and ends with 37 years of watching Caddyshack, so ","useful":5,"cool":2},"6ayHZcv6xRPqeNiSh4K_6A":{"text":"My review is solely on the pool experience and for a quick $15 entry you gain access to th","useful":17,"cool":8},"ihL3hLcdwbJxBRGE68Z6RA":{"text":"Nasty, rude, employees. The only person who wasn't a complete mean jerk was the very sweet","useful":4,"cool":0},"vaD20QY0BHNlGc0LFBkSjg":{"text":"Drag brunches are fun but Halloween themed drag brunches are everything! My friends and I ","useful":2,"cool":3},"9Zx0VCGnTFkkbWqMjuXijw":{"text":"I took my daughter here for her 21st birthday celebration, and couldn't have been happier ","useful":4,"cool":1},"m01Upe9wsbkc3cLRRv9jIw":{"text":"This place is so amazingly fun.  I came on a Sunday for a \" drag brunch\" it was Mardi Gras","useful":2,"cool":4},"Hjn4T9oGzHpEbRfbegr_eQ":{"text":"I heard they had some great drinking specials but I was just eating this morning... and th","useful":1,"cool":2},"EGQOXogi_dSiJ2RpY4nx0w":{"text":"Such a fun time! My husband and I recently ate lunch by the pool and were very impressed f","useful":0,"cool":1},"nyLRpOw3JaiaQO9CkDRL9w":{"text":"Loved everything about the Drag Brunch. Amazing experience, bottomless mimosas and great f","useful":1,"cool":0},"t1gAwLBlrXq-cRZAy2Kd4g":{"text":"Meee Ohhhh Myyyyy! This place.. There is nothing better than brunch with a show! First of ","useful":0,"cool":0},"jFnMKrAVRo6pIuB2zzsreA":{"text":"If I could give this staff a million stars, I would. We went for a Mardi Gras Krewe brunch","useful":1,"cool":2},"1cNyRdwWiWp8NKF5Cma_Nw":{"text":"If you are visiting New Orleans, you MUST come here. That is an order.\n\nI came on a Saturd","useful":3,"cool":1},"CSwYg-yuBx7gcqwJ0tO0hA":{"text":"Two Words: Drag Brunch. This amazing gem nestled in the Marigny Bywater is beyond descript","useful":2,"cool":0},"R4Msyh3eC6-EOKqythdJZg":{"text":"The food and service was great. Will be back again. Crab cakes and chilqulies. Great will ","useful":2,"cool":0},"zZeSVC010CHbZvEbsE65fQ":{"text":"I used to love the country club. Once the novelty wears off and you experience how terribl","useful":10,"cool":1},"vVLBvnuRiCs6r1iU-v0Oqw":{"text":"It's hard to rate this place. But it is in between a 3.5-4 for me, so I rounded up. After ","useful":9,"cool":4},"XgT5f0KDawO31s9j1wAosg":{"text":"It's a weird time, but The Country Club does it just right.  Beautiful set up outside, soc","useful":0,"cool":0},"FYPnAlBisXi_zRfUm0Y7YA":{"text":"I found this place on Instagram while working in N.O for three months. When I found the lo","useful":1,"cool":0},"XHQgzPvd0i5e1pqhDmpQPg":{"text":"What a fun brunch ! You have to experience the Drag Brunch at least once in your life! The","useful":1,"cool":0},"o7fFijmsDXC4PfG8yDX0bA":{"text":"It's nice to have nighttime takeout near-Ish to the French Quarter. I've had a few things ","useful":1,"cool":1},"zmYjP6DCOZZsEQOxXRgYKA":{"text":"Excellent food and service. \n\nhttps://blainerestaurantreport.wordpress.com/2021/10/15/the-","useful":0,"cool":0},"wtBPc5Ua8p5vXbq10S5p-A":{"text":"We made a reservation 6 months in advance to come for the drag brunch because they are so ","useful":1,"cool":0},"5mKeqrRuOEBleAXheDWrtQ":{"text":"Well-prepared food but they might make you wait awhile for it at busy weekend brunch times","useful":0,"cool":0},"zFOJINpnPfalw7b3z8Wm0Q":{"text":"I like the country club, but my issue is the cleanliness of the pool area. Nearly every ti","useful":2,"cool":1},"v4xVofrD4E1fbXXw9tAv6w":{"text":"One star only because doorman was nice. I tried to go for lunch yesterday, but they were c","useful":2,"cool":0},"gRNpSCxJ1umMZkW-iX-J9A":{"text":"The food and wait staff were great. We were served the wrong entree and management decided","useful":1,"cool":0},"eeUSckcwtPC1Q-aP58atiw":{"text":"This little cottage is tucked away in the heart of the Marigny community of New Orleans. M","useful":0,"cool":0},"aK-o3YzaWoHHk4RyVSRDCA":{"text":"The Country Club was so much fun for my sister's bachelorette! The walls are gorgeous, the","useful":2,"cool":1},"jN6aApt_8iTOy6DOY8bRGg":{"text":"Not really sure how I ended up here one night in New Orleans other than my friend saying \"","useful":5,"cool":5},"wK_qPLECNHM_IeQr-p19Gw":{"text":"Great food and waitress, would have been five stars but the girl at the front desk was so ","useful":2,"cool":0},"LKLaXcwJIIGS_N1ee6_ruQ":{"text":"This place for Drag Brunch was AUUUUHHMAZING! You have to book like 6 months in advance bu","useful":6,"cool":4},"3dAudOn2Yw4gQA7aLLKpug":{"text":"***previous review rejected for non-disclosed reasons\n\nBREEDERS FROM THE BOURGEY-WATER \n..","useful":21,"cool":11},"vR9mVlwu1PjNYTJRVtwdDg":{"text":"A drag queen and brunch go together like Big Freedia and twerkin. My cousin had her bday b","useful":1,"cool":0},"fJkwchw169mnRmlB1tJISQ":{"text":"Everything from the food, drinks, service and atmosphere, this place is amazing. \n\nTheir b","useful":0,"cool":0},"AOkabcT5LLf5Xt-HsJnSLg":{"text":"We went to this country club to enjoy the pool and the drag show and ended up being insult","useful":2,"cool":0},"3zmy-R4qmXY2afwcXCa-1w":{"text":"Another YUMMY meal at the \"CC\"! New chef, -to die for food- and fun atmosphere.  LOVE THE ","useful":1,"cool":0},"SWPuNX6ut1JFye7L02rvig":{"text":"The Country Club Drag Brunch was highly recommended me and I feel I wasted an entire morin","useful":1,"cool":0},"6l-ogrMnNL3SOPPn5At_fg":{"text":"This is my go to spot if I feel like going out! I love so much about The Country Club but ","useful":1,"cool":1},"RyHdqpKH0NGyB5Mgzc06XQ":{"text":"Very disappointingly slow service. We reserved our spot here weeks in advance. I feel like","useful":3,"cool":1},"f0emWfbk27QXDrjgnDgjaw":{"text":"As others have noted, the staff is extremely rude. My party was there for a Sunday brunch.","useful":1,"cool":0},"xGTjzh-ucr_ieaVPjIXYDQ":{"text":"Omg this place is a GEM! Amazing music! Bomb food! Eclectic diverse atmosphere and a heate","useful":2,"cool":0},"h3U-1yFjjEnAX4p-4cuigA":{"text":"From the second you walk up this place is so warm and welcoming. Amazing service and show.","useful":0,"cool":0},"egJVChCkI94lKMe1Cd-wtw":{"text":"Absolutely phenomenal! Came here right after a flight from Jersey and Jeremy made it feel ","useful":0,"cool":1},"JaTbhjTx83oRt7TiANnbcw":{"text":"When I was visiting NOLA, I was lucky enough to experience The Country Club for their drag","useful":1,"cool":0},"-RdbPoijvPVnH_JTN-7CYA":{"text":"My party of 13 decided to go to the Sunday brunch.  Only two Bottomless Mimosas were order","useful":8,"cool":0},"ycgC7OMICdBbCJ7g7H_3VQ":{"text":"Such a fun spot! Dropped by for happy hour (4pm-7pm for drinks and 4:30pm-7pm for food) ov","useful":4,"cool":0},"kXJJaDgeUuDmMI_nntCitA":{"text":"Came here with my sister and I can say it's a pleasant experience. You would have to make ","useful":1,"cool":1},"Qcjjp9Xhf0yWCilC13aO2A":{"text":"I really really want to give this place more stars, but after coming for Drag Brunch with ","useful":1,"cool":0},"17lf4ZrvXsBkOjZ4KK1M4Q":{"text":"We just had dinner here in this beautiful neighborhood! We had the crab beignets, fried gr","useful":0,"cool":0},"LPSlMzSqtE8a2t-lp5d-rg":{"text":"I enjoyed that this place is a pool and has food to eat also! You cannot eat in the pool s","useful":1,"cool":2},"2UhDIxd7VOs7dCG-rBOEqw":{"text":"We went here for my boyfriend's birthday brunch and loved it! Such a fun hidden gem. If we","useful":0,"cool":2},"u-FTv5YtrLmOb_QHeDyaxQ":{"text":"So glad to be back at The Country Club! Went for the pool, stayed for the vibes and brunch","useful":2,"cool":1},"2VCvrcPybTggFqvQWkwVrg":{"text":"We stopped into this place after seeing some reviews online and it was the cutest! Bywater","useful":2,"cool":1},"ooW5zNMXFcj_q6kuya1_lw":{"text":"Tl:dr - Any semblance of this place being a queer community hub, or really a cool place at","useful":2,"cool":0},"1_SbhCJNnO0EJG0d9Yr1Cg":{"text":"The rudest bartender I have ever met. We were staying across the street and thought a quie","useful":2,"cool":0},"ZkEmbKP4rpECnIRKUzS5Mw":{"text":"This place has changed so much. We refer to it as the AirBnB neighborhood pool now. It is ","useful":2,"cool":0},"htFRZf-UyDKph9JbCFBjHQ":{"text":"Locals Beware -- Very NOT New Orleans!\n\nI'd heard from neighbors this new version of the C","useful":4,"cool":0},"uqZHBi24fXDXOCz_s52i7g":{"text":"Love to dine in the Courtyard.... So beautiful . Great food and staff. Be sure and try the","useful":0,"cool":0},"kF9LCdDtzQjE5FAZHeeLRA":{"text":"We were greeted with so many smiles, the service was EXCEPTIONAL  I believe they were call","useful":0,"cool":0},"HYEL2fiwmY9D0x31nK4XKg":{"text":"Terrible will never go back. Bartenders are extremely rude. Our group of 6 were questioned","useful":3,"cool":1},"kzWdraDJ96P5agVoCWE05w":{"text":"Very disappointed. Had wanted to check out this place for a long time, and finally made it","useful":5,"cool":0},"v9yMEvwjJ8OcqEkywt0OvA":{"text":"This place was not how I expected I.T to be at all. While walking in there are beautiful p","useful":2,"cool":0},"XsId1NtMk5ezZUr9VILeqQ":{"text":"Ambiance and food here are an all time A+. Can't get back soon enough. Missed drag brunch ","useful":1,"cool":0},"Qw3YEp3PnQOo1LU69tMO-Q":{"text":"Amazing brunch with great service and food. Cody and Clinton were stellar!! Parmesan oyste","useful":0,"cool":0},"tIMTUmRxmCO7cWeGv_VrDw":{"text":"First time coming for the pool. They are doing temperature checks and they are limiting ca","useful":0,"cool":0},"2aNUwQEAAfm9DzcreZUwIQ":{"text":"I'm only giving one star because I enjoyed my food. I arrived with a party of 5, celebrati","useful":3,"cool":0},"5gmXMTV_t8Jg-I9EzZJF4g":{"text":"The architecture and interior design are beyond amazing, the staff are hospitable and acco","useful":0,"cool":0},"ea3a82pzBLFhga766_jWgQ":{"text":"It is a rarity that I give a 5 star review, but The Country Club totally deserves it. \nAtm","useful":2,"cool":1},"ZeYrKwJrpv1nQk8ZJL14mQ":{"text":"Absolutely magical. While some of my friends went to an after-party immediately following ","useful":1,"cool":0},"wU1ZzWcB5RjvCO-rFMgCgw":{"text":"I went for drag brunch and even though I didn't enjoy the drag I'm not removing points for","useful":0,"cool":0},"h3k1__bTwNxuTw9rhj6NZA":{"text":"Loved, Loved, Loved my experience here. We sat at the bar while the drag brunch was going ","useful":1,"cool":0},"lKljl48Wn5JgDiPLa6Er9w":{"text":"One of my favorite places in the city. Amazing vibes, great staff and delicious food. The ","useful":0,"cool":0},"N3VfOSZ3_5QE76hQeVPQVw":{"text":"This review is for Saturday morning brunch and drag show. My friend is a local to New Orle","useful":3,"cool":1},"S-Hc0QrRwJGfBKLPHy0edw":{"text":"Enjoyed my pool experience! Food was tasty and fresh! Extremely LGBTQIA+ and everyone is j","useful":0,"cool":0},"lfMpwWe8WmDLOiHGS4MIZw":{"text":"Came on a rainy Monday morning/afternoon with a group of 4. We were seated immediately and","useful":1,"cool":1},"RQcr3v6Y-RncI-OQKtFb-A":{"text":"Rude. Came here on a friend's recommendation w my father and we were treated very poorly. ","useful":2,"cool":0},"Ls7ahU4ZIluq_w6tYHEDug":{"text":"Checked out this spot thanks to my bf's fam in LA. A cool hangout spot to visit after a lo","useful":1,"cool":1},"J2k5I5QaQih2ec0XXgouOQ":{"text":"Elegant, casual and trendy spot perfect for cocktails, dinner or poolside fun. Rich in his","useful":2,"cool":1},"-rQCQYRrOf9LUypIfPleyw":{"text":"Came in on Monday night with my girlfriends for service industry night and was treated far","useful":1,"cool":0},"BOg2hCeUmXUim8rEOQ0iyA":{"text":"My friend and I were wandering through Bywater and looking at colorful houses when we got ","useful":2,"cool":1},"tjkoGzPD6aIPOJwS2MwoOg":{"text":"Hello I just called to make a reservation for my sisters bachelorette party. She has had t","useful":0,"cool":0},"ZflgZgwOE9ymvCCZG70_Xg":{"text":"The New Orleans Country Club is not queer friendly!!\n\n...the manager, Bert, would attempt ","useful":3,"cool":0},"BU4d8_8kI5RybzH0axW2jQ":{"text":"Drag brunch is what we expected this morning but guess what !!! No Drag brunch service was","useful":2,"cool":0},"Aj4FZupIi_uxK4twIMaLZw":{"text":"You have to experience it to understand.  Brunch was fabulous and the bottomless Mimosas i","useful":1,"cool":0},"vpGP-kWqt5UzGs3xpMEtyQ":{"text":"Went for brunch yesterday morning. They do have the best brunch food. I have been in many ","useful":2,"cool":1},"cduLoE9mhbqkGyfb74BpjA":{"text":"The service was great! I visited with some friends & our waiter was super sweet! Loved the","useful":0,"cool":0},"LlHV4391RXiJeRbXAoMQzQ":{"text":"Fun bachelorette brunch! Bellini carafe was absolutely amazing. The restaurant is absolute","useful":0,"cool":0},"WgrJC8BoHoNXxy5Dh-iKsg":{"text":"Nothing but fond memories from this spot. Great food Great service Great Party all day eve","useful":0,"cool":0},"WHZsQb3qSd1lHX24r8hv-Q":{"text":"The Club has lost its charm. \n\nWe originally fell in love with The Country Club in Novembe","useful":1,"cool":0},"xOmtpdczp-MRE_pAl27Ong":{"text":"I love the Country Club; one of my favorite places to go to during the summer and hang by ","useful":4,"cool":1},"WTbU9ghUiENV2C_WSXTGqA":{"text":"So this place appears to be awesome but it's a huge scam! I went there last Saturday with ","useful":2,"cool":0},"A6uDlXUToQvinka01TnAag":{"text":"Probably a very nice place . Bartender not so much. When drinks and small plates are the r","useful":4,"cool":0},"VzS9Gi3CoQ85XMQgnFrEuw":{"text":"Food was great! Service was great! Absolutely loved sitting out by the pool. \nOnly complai","useful":0,"cool":0},"_m9FQP3782DPwWQklR3F2A":{"text":"We aren't from the city but looked up places to go. We had planned to go to a place down t","useful":5,"cool":1},"OOVty2vGIlF84LP_tFAhgQ":{"text":"From the second you walk up this place is so warm and welcoming. Amazing service and show.","useful":0,"cool":1},"_9cz89Kyc7x7Z9Lk6NYGjQ":{"text":"The D list country club. Most unprofessional staff. Toothless security guard kicked me and","useful":1,"cool":0},"QcYcClN49vO9NM75v7qxFQ":{"text":"I have been here a few times for brunch but this past weekend got to experience the drag b","useful":1,"cool":0},"W9NdFo0Ehcgj_1FrAiO59Q":{"text":"Knowing nothing about New Orleans, I was excited to get off the main drags and head somepl","useful":4,"cool":1},"DFbhdWBVopWe9I4PR5U20w":{"text":"Was in town for a bachelorette party and found this place for brunch/afternoon fun cooking","useful":0,"cool":1},"wUpeiQ017Wt8ewugQv9y4g":{"text":"An entertaining experience with balanced flavors, great service, and a unique take on New ","useful":0,"cool":0},"gfWDJLcuI7Tie_BK1hw1Og":{"text":"Heat was out in the pool and hot tub, but that didn't deter me, and $20 is a small cover f","useful":0,"cool":0},"aiDLFXkOL2lZjGpqgirjYw":{"text":"Today was my first time at the country club. The vibe is great - you get a country club fe","useful":0,"cool":0},"W3Lj_HUM1wCjhvaTy4wZmg":{"text":"Wow! What a great time! We were in NOLA for the Sugar Bowl and made brunch reservations at","useful":0,"cool":0},"DL4-H60sEr2Wr91xUm4RwQ":{"text":"Do you want to feel like a fancy VIP while dressed down in your favorite t-shirt? You've f","useful":1,"cool":0},"ejz5bmUdrRGieOFUJ_rtzA":{"text":"Tim and Jonathan are top notch bartenders, and all around nice people.  Happy hour is the ","useful":1,"cool":1},"p1hBjrOkV2jg5lzJkjbbLw":{"text":"This was definitely an experience I will not forget. \n\nThe Country Club offers burlesque/d","useful":2,"cool":2},"1mRmzNIhur07-u4-vNQwZg":{"text":"Ate the course set items.\n\nWe were still hungry afterwards. I thought the food and experie","useful":0,"cool":0},"fnjBJqQImsJAjELC1feTPA":{"text":"All I could say was Wow! Brunch was excellent! I made a reservation through Open Table and","useful":1,"cool":1},"JPCpBo4NBcW__Rft3q7NKw":{"text":"Country club\n\nSometimes you and your girls just want to sit by the pool, enjoy some great ","useful":4,"cool":2},"FPK_T2SVM96_tZUZol_S7A":{"text":"I can really go on and on about this place...\nThey have my favorite wall. \nI LOVE their ba","useful":1,"cool":0},"N8LAy-HYuQkLkKasFspLSA":{"text":"Best Kept Secret in NOLA! \n\nWord has it that a former Sous Chef @ Commanders Palace has mo","useful":1,"cool":1},"jc1vRzjjA98-y-hh8LTl6w":{"text":"We were lucky enough to enjoy brunch at the Country Club on Lundi Gras. I had always heard","useful":2,"cool":1},"801hCTpIovSMuEXLiCkezQ":{"text":"I had never been here before and my friends brought me for the first time today.  It was a","useful":3,"cool":0},"swg2Hw-aKfYoAIy9ptH8hA":{"text":"GREAT brunch at the Country Club today. Food was totally decent and served in excellent po","useful":2,"cool":1},"rNyH8qs6IWv2COVfXMcAkg":{"text":"we went on 12/26 and 12/27, so both the restaurant and pool area were nearly private! the ","useful":0,"cool":0},"N92kUGuqyK310pd6hMs2kQ":{"text":"This place is amazing!! Great service and friendly staff. The bottomless mimosas where gre","useful":1,"cool":0},"pK7gyPgzRkGg1iMlTd0BkA":{"text":"Girls trip to Nola and came here for a brunch meal for my friends bday.  Upon arrival, the","useful":1,"cool":0},"mXOUie54XR-aRXeHuqdcpg":{"text":"So I have been to The Country Club twice, once for brunch and once for the Drag brunch. I ","useful":0,"cool":1},"C1K9v5URlZHodNRorBvNiw":{"text":"What a beautiful little restaurant found in the Marigny area.  It's located in a cute litt","useful":3,"cool":3},"Y_5xnsPiL1gkwMLKUt9vNA":{"text":"Our first visit,  being we were in the area for the weekend ...\n\nThe atmosphere is very mi","useful":2,"cool":1},"M5Im_bg9BBBL8qD-jjQPPw":{"text":"This is the coolest place ever. It's gorgeous and fun. Each room is painted so \"prettily\"(","useful":1,"cool":0},"aBvreyaCH2Ycb3hFwkIiSA":{"text":"More cities need a place like this.  I'm talking about the outdoor heated pool and the hot","useful":2,"cool":0},"A3jyQyG9nJitWXYF9QkP4g":{"text":"Getting around to leave my feedback of the \"May Incident\" as you blithely referred to it o","useful":3,"cool":1},"5iUieVfXfTjZSKtLItP9yg":{"text":"A PHENOMENAL restaurant!!!! My girls and I had a BLAST at this restaurant! They had a live","useful":6,"cool":2},"OU0sYjrUKellY7qm3NQgSw":{"text":"Planned my birthday brunch here on a Sunday morning before a Saints game.  Let me tell you","useful":2,"cool":1},"AfXT1KbitIFrYN0WnrdD7A":{"text":"We had made a reservation for drag brunch over 6 months ago so we were all really excited ","useful":1,"cool":1},"xWtyfkW-yLbcfvFoiTW0Qw":{"text":"Amazing spot for a drink outdoors or even brunch. The inside is also very cool. There is a","useful":2,"cool":2},"jNJ4RID_8EaiJcKTg1nKcw":{"text":"UPDATE 6/3/15: Since writing my review on 5/17, I've found out through friends in the gayb","useful":13,"cool":2},"AFBIGOnIx7NtlCarvuK9Yw":{"text":"This is my new favorite spot in New Orleans! So relaxing. My husband and I went on a perfe","useful":1,"cool":2},"FdnxLRlMcrsXtNhR4D5LTg":{"text":"For clarity this review is specific to the Drag Brunch. \n\nWe went to the 10 am time slot w","useful":1,"cool":0},"NAUbVB4As0ZQ79nCP68bqQ":{"text":"The atmosphere here never disappoints.  Plenty of Outside seating with a poolside view.  S","useful":1,"cool":0},"lwRNpfrtwl0d-Jpa3LS08g":{"text":"Yum to the tasty drinks and the awesome mac-n-cheese.  Love hanging out on the veranda in ","useful":6,"cool":6},"eDCjyweDxeOUXqKGJlwQPA":{"text":"Just got home from sunday brunch with Orangetheory Fitness christmas party. It was my 1st ","useful":3,"cool":0},"bU-r7qAcN8ZaxVuHrEHDwA":{"text":"Overall this place was pretty great. My friends and I tried it while visiting Nola over th","useful":1,"cool":0}}