{"s6ymRFtZ98KRtyYLhhiGSw":{"text":"Had another amazing meal!!!! Cantaloupe Caprese Salad, Pork Chop, Homemade Rigatoni, the f","useful":1,"cool":0},"Dw0mrDg-OcipeH76WkJKQg":{"text":"Most flavorful and enjoyable food! The tripe was outstanding and the zucchini bread was un","useful":0,"cool":1},"bSxZ49jl4h1_CBKMOv1Rbg":{"text":"This place kills it on food, drinks, and friendly service. What's not to love? I was only ","useful":0,"cool":0},"MO0khLL_w7m228MwPL4haQ":{"text":"I love this place and they definitely serve my favorite brunch in NOLA.  Great staff, grea","useful":1,"cool":0},"GXowShs-zKocahmiYmNKig":{"text":"I had the pleasure of eating here for brunch on my way through NOLA, and fell in love with","useful":0,"cool":0},"65byEQL_AEjdlL4V-h41mQ":{"text":"Went here for my friends birthday! Food and service was amazing. I will definitely be back","useful":1,"cool":0},"jWQiSL-syNh1VjYewYkXXw":{"text":"Made reservations for Sunday brunch and were not disappointed. We waited about 5-10 minute","useful":0,"cool":0},"Rg6NamMezSAn12hVLg3fWw":{"text":"I ordered the asparagus pizza and we had the tomatoe basil pizza too. We also ordered the ","useful":0,"cool":0},"Q2fEDm-MjHT6TQXKeYCd0g":{"text":"Place is fabulous, every single thing on all the menus. Brunch also, absolutely fabulous. ","useful":0,"cool":0},"j7IMEqKNslq_TM-YTCEaJA":{"text":"Friendly staff, and a mostly pleasant dining experience. I think the portion sizes are sma","useful":2,"cool":1},"2a58FroR3T8vnfJc23jX0A":{"text":"Love the interior, love the seating, received fantastic service. Pizza was excellent, nice","useful":1,"cool":0},"LB4caznIwWmHo8rna1H8ow":{"text":"Great place , decor and ambiance. The food is really good the prices are fair , is a great","useful":0,"cool":0},"JKgIc6a9aGU8pbgRFHiKBw":{"text":"Delicious! I damn near overdosed on traditional Cajun cuisine during my last trip to New O","useful":1,"cool":0},"VUsBddepiCvjJzo5LnZH1Q":{"text":"Perfect informal brunch. Our food was delicious, especially the Korean steak and eggs, lem","useful":0,"cool":0},"52Oi48OY5uPgCuIHmw6e-A":{"text":"Delicious trendy food spot. They have a local, fresh menu that updates every few weeks dep","useful":2,"cool":0},"ZRb3HAAovwk7aKEEVWjJgg":{"text":"I've been to Paladar 4 or 5 times now and consistently find it one of the most enjoyable d","useful":0,"cool":0},"m50D_Xgy2gt5MFS5rOS2Bw":{"text":"We went to Paladar 511 to have a girls Christmas brunch. I am so glad that we picked this ","useful":4,"cool":1},"_v9eB-b8HtSj1hZNXVbb4w":{"text":"Took my wife here for a birthday dinner last night. The staff was fantastic and the food w","useful":0,"cool":0},"akDWudA9jcE4glHe0_KnPQ":{"text":"I have been to this incredible restaurant 5 times. Everytime it has been stellar. I only y","useful":0,"cool":0},"GBuz9UpeHrGoxvdY6A2aDw":{"text":"OMG, brunch at Paladar 511. So. Good.\n\nLet me just say I was really glad I was with two pe","useful":1,"cool":2},"emo9TBLD8YyFQXSKhMjPTA":{"text":"Am amazing place to brunch! Some of the best breakfast potatoes I've ever had. The pancake","useful":0,"cool":0},"PoZlf_4ISclNnlmctOij0A":{"text":"Absolutely amazing in every way. Service by Noah, food and atmosphere too. Love love love.","useful":0,"cool":0},"ytFl-RplZSo9mdjv0Klexw":{"text":"So so so good!!! Came for brunch on a Saturday and was impressed! The menu definitely isn'","useful":0,"cool":0},"BbqP-4ihnzdGUJ44hKe7Dg":{"text":"I don't want this place to be too popular but seriously the best restaurant in New Orleans","useful":0,"cool":0},"_rS96tGKv1R_WQha8Faw4Q":{"text":"The pizza is absolutely delicious and has a lot of flavor. The dessert is also very good. ","useful":0,"cool":0},"C4qGcRGNxnJoxRWUiC0G6A":{"text":"I have had good experiences at Paladar 511. If you're looking for a small plate Italian pl","useful":3,"cool":0},"TJXxor8aXJqupgN4w9A1Cg":{"text":"We were disappointed in ourselves that we didn't eat here for all of our meals.  Excellent","useful":0,"cool":0},"l96AjZDmsjlAmipWe-FpmQ":{"text":"There is a new star in town and its Paladar 511. The space is within a converted warehouse","useful":4,"cool":0},"u1ZHhwnbBu-XR6OX1L0_Lw":{"text":"I turned up, all windswept from a boat trip but, even though I wasn't dressed as well as t","useful":0,"cool":0},"MC759TFq_YSWF8zh5F_wYw":{"text":"The best entertainment here is the open kitchen. Everyone that works here looks essential ","useful":3,"cool":1},"4p24tSNF8bZ1lXsswu3qDA":{"text":"Truly spectacular breakfast in Nola. We've always struggled for a good breakfast spot, whi","useful":0,"cool":0},"x60C56oJtQs9gz8rgwB5yw":{"text":"I came here a couple of months ago with my boyfriend- the food is absolutely amazing!\n\nWe ","useful":0,"cool":0},"wtpApa5TMdLAD7hwjtOspA":{"text":"one of the better meals i've had in a good bit. Everything was great but these stood out:\n","useful":1,"cool":1},"S9uGtSeSwJ4Ydp2BrKraRQ":{"text":"couldn't get better than this!  Blows Pizza D out of the water. everything was exceptional","useful":1,"cool":0},"Qiz82rrk7kPE-LLzKF3Vtw":{"text":"Paladar is now serving Brunch on weekends, and boy is it delicious.\n\nWe started off with v","useful":1,"cool":0},"0bLd7F5FcfZ3ugYUk_DEeg":{"text":"BLUF:  Crazy good everything.  Pizza, cocktails, apps.\n\nI love this part of town.  So much","useful":3,"cool":0},"yA93wkK4rqwgrYyNpXryEA":{"text":"OH WOW. \nI can't believe I have been missing out on this place all this time. Date-night w","useful":13,"cool":11},"NGg5Kqxy83qGKHJYDnxTkw":{"text":"5 stars forever. We ordered 8 different dishes family style including the rabbit, pizza, c","useful":0,"cool":0},"l76eMsw1YnlG8qIvM_VB9A":{"text":"Delicious for dinner! We had a lot of great things but highlights were the Fried Arancini ","useful":0,"cool":0},"xCk_jQG_YdZCmenUBHIvbw":{"text":"Open kitchen, great food. A friend recommended the lamb and it was excellent. The staff wa","useful":0,"cool":0},"D1-PQDgmnvfi5bSIG-9RfQ":{"text":"Awesome experience took us right away. Beef carpaccio was to die for and the pizza had ver","useful":0,"cool":0},"8KOisyfwn2nl3_q1JkBkBA":{"text":"Sunday brunch with some friends. The interior decoration is beautiful. Ordered coffee, lem","useful":0,"cool":0},"f-BVy98HmXEIvnAIpLyOwQ":{"text":"I had an amazing experience at Paladar. The food was incredible and the service was great.","useful":0,"cool":0},"bLUrVLEcH2F9DhcV8b_4QQ":{"text":"Great industrial atmosphere. Not too noisy given the exposed brick and steel dining room. ","useful":0,"cool":0},"wXFwDqKtcJgi7m-ydwg5Jw":{"text":"my new favorite restaurant in new orleans. excellent and attentive service, great wine and","useful":0,"cool":0},"QK_eik_i6wVpIL9KFveoJA":{"text":"I'm totally in love with this place...everything about it! The space is gorgeous with high","useful":3,"cool":0},"LeiFX_Vsb507tpbx2d922A":{"text":"I was smart enough to pick this place for my birthday dinner. We had a group of 12 people ","useful":2,"cool":0},"ktmVOVj0vskEA5d-Z8gQpg":{"text":"My fiance and I had a date night here. Every dish was fantastic. We started with a tuna co","useful":2,"cool":1},"uJzDKU7cBb57dKSNI1fNHw":{"text":"Best restaurant in New Orleans. The charred okra dish with the yogurt is possibly my favor","useful":3,"cool":0},"xhUyqTG0tXF6G5RfDAt9Hw":{"text":"This place was recommended by the bartender in our hotel and we scored an amazing find. Al","useful":0,"cool":0},"GeF_Yt4TwMlrYWFwslLsog":{"text":"This was an amazing meal! Every dish was fantastic. We had tuna crudo, arrancini, raviolo,","useful":2,"cool":1},"M713I_lOgYqx4-A4kcnFzw":{"text":"New restaurant for us to try and so glad we did!  Homemade pasta/ great pizza.  Interestin","useful":0,"cool":0},"w7dY021Sh6RkkxVVoQ4JWA":{"text":"Food was good but small menu, mainly brunch items. Some were large and others really small","useful":0,"cool":0},"WYKhGB9bTqRuE2JUbgEdUA":{"text":"I started to get hungry while exploring the Marigny one night, so I turned on my Yelp app ","useful":2,"cool":2},"efCFbcFK99jqqitxZPxtxA":{"text":"Incredible experience all around. Outstanding food, cocktails, service. We sat at the chef","useful":0,"cool":0},"sBAlKi3TZBlyTvuVIGBEmQ":{"text":"This was the best meal I've had in a long while! We started with a round of cocktails--all","useful":2,"cool":0},"yL1v1caXIKh1aMYdMg9qxA":{"text":"This place is a good find-seems like mostly locals, which always is good.\n\nThe best thing ","useful":0,"cool":0},"sa2miJpNjRn2mgLWkPwjjw":{"text":"Wow, the brunch here is... just amazing.  Definitely eat here.  Making a reservation is pr","useful":0,"cool":0},"LfAyK46o48vKse8E3svn9w":{"text":"A bit off fmFtenchmen st...around an empty lot is a glass door leading to a night of fresh","useful":1,"cool":0},"PrhYF9I7allIhnQdi2ZAcA":{"text":"The restaurant is cozy and pretty. We ordered about 18 items on the menu and everything wa","useful":1,"cool":0},"aE0YGsmQjrv1NI29jjjcTA":{"text":"My wife and I had low expectations due to the way too hipster crowd and location. We were ","useful":1,"cool":1},"_8rd4TIGe45Za9_VscYXOg":{"text":"Have been 3 times for dinner in the past month. Very good on all fronts.  Pizzas excellent","useful":0,"cool":0},"I4VzfMQhV6S-2ctGMPkTRg":{"text":"Love that we can enjoy light Italian or Mediterranean dishes as well as delicious pizza wi","useful":3,"cool":0},"4ib9iCskmdwzz4neQagKDQ":{"text":"This was an unexpected surprise. Due to a flash flood, we were able to get in without a re","useful":1,"cool":0},"ouhLxfLxY4eMXhHrBYzehg":{"text":"The food was totally delicious!  Fresh ingredients and such a great atmosphere.  They also","useful":4,"cool":1},"DuAHkV3QgWiJQ2YqC3Gwxw":{"text":"Yes, the tuna crudo is terrific - wish there were a few more pistachios in the dish but ov","useful":0,"cool":0},"PzVE1FB5xPZv1oiQ0DYExg":{"text":"We stopped here for an early dinner before heading to the early show at snug harbor. The i","useful":0,"cool":0},"G2XH6Diub1_n_isaqO4H7w":{"text":"Excellent! Excellent!! Tuna crudo, pork chop, salad, pappardelle  w sausage. Entire staff ","useful":0,"cool":0},"_D41MEUp_XM9NYxe4I0onw":{"text":"The ambience and the food was excellent and spot on!! We first got the naked and famous dr","useful":0,"cool":0},"NpkCgfLKyXmvQEVmgbof2Q":{"text":"Was brought here by my friend living in the French Quarter. This was an amazingly beautifu","useful":1,"cool":0},"5y2bcN76W3aAXWW3ZwosKg":{"text":"Had the huevos rancheros.... the best hangover cure ever. Incredibly delicious and really ","useful":0,"cool":0},"o2pygjoxEXosWxymiIef8Q":{"text":"I've been to Paladar a few times now, always for dinner. It's an incredibly versatile plac","useful":0,"cool":0},"2WJmaxB2qI6m31bpQsMW8Q":{"text":"Paladar 511 is one of my new favs!  They make amazing vegan pizzas (just ask for a vegan p","useful":0,"cool":0},"YG6EAuUDKmPSkYx9BgJDFg":{"text":"Amazing food, but not too many choices. I'll recommend you to sit at the bar and have a fr","useful":1,"cool":0},"RjZc0sEO4FvsKmmuzhZ-tg":{"text":"Came in early for brunch on a Sunday. The place was packed, but we were able to get a tabl","useful":0,"cool":0},"le_uSUUsqEMDx6QRPbNV9w":{"text":"Great atmosphere and the wait staff was attentive without being pushy. We got the lamb sau","useful":0,"cool":0},"kzUavg5PayVXtKDSMJYRwQ":{"text":"Small menu but everything done well. Pizza s are great. Great starters. Order dessert earl","useful":1,"cool":0},"ISxWrAsL3rpy7v1X6UE6xQ":{"text":"Simply delicious. Great atmosphere, friendly staff and excellent food & drinks! Can't wait","useful":0,"cool":0},"ORf3Q3a7zcxqtreP2KsxPg":{"text":"Amazing food and drinks. An interesting Mix of everything I love. The pizzas are to die fo","useful":0,"cool":0},"YmBO24c-D-F1Ee6ooXXEug":{"text":"Stopped in for dinner on a Monday night while staying in the Marigny area for dinner based","useful":1,"cool":0},"-UYZbB-jzB9VBgyX85a1Dg":{"text":"We love going to Palladar for happy hour snacks and drinks, and were pleasantly surprised ","useful":1,"cool":0},"wGMlY-80u7ylWr8YJK9UTw":{"text":"The food, ambiance, and architecture of Paladar 511 are excellent. A lovely wine selection","useful":2,"cool":0},"jhNef3hbGtnCcMgJtJvEJQ":{"text":"Amazing food, poor service. Our waitress was very nice but our food took over 50 minutes t","useful":0,"cool":0},"hFrInzH8P2UY4NSVaPnT_Q":{"text":"We loved this restaurant and look forward to visiting the chef's other restaurants in San ","useful":0,"cool":0},"oNMlozKxZENFxjmOUmcSTw":{"text":"Had the beet salad which was lite and good also had the spinach pizza which was great with","useful":0,"cool":0},"IjMdBHvWt5w1lV0c7wYVHA":{"text":"Highly recommend! We had the carrots & brocollini appetizer...both fabulous. I ordered the","useful":0,"cool":0},"8t5S3UwsL3Kd7rZscOJAAA":{"text":"There is a new star in town and its Paladar 511. The space is within a converted warehouse","useful":0,"cool":0},"o0mwKgFI2gAz9W9VCLdzuw":{"text":"Lovely food and experience a stones throw but in another world from the buzz of Frenchmen ","useful":0,"cool":0},"YRjwlvar8TjTZDToHNIDiA":{"text":"Terrific off-the-beaten path brunch spot. We built up an appetite walking here from the Ga","useful":1,"cool":2},"sfgRwjxS2w9uSMid11744w":{"text":"The Saints game was about to start and we did not want to leave the house. I called Palada","useful":1,"cool":0},"gJP9zOrboUi8U_frin2Y-g":{"text":"My friends and I had some fantastic food at Paladar.  We were a walk in group of four and ","useful":0,"cool":0},"ytB60Ytc5RWBXGovwEXQiA":{"text":"I love this place. Each drink is perfect and now there are even two beer taps. \nThe food! ","useful":2,"cool":0},"WRLUaiR2G0dx6l75WYe9iQ":{"text":"A well thought out and detailed space that creates comfort and a feeling of well being. Op","useful":0,"cool":0},"TtoEzF0j7YbOdo6z7pJJ2g":{"text":"Excellent place. Nice vibe, great staff and delicious food at decent prices. \n\nThe pizzas ","useful":3,"cool":0},"JhlH8exyJ3RAz9NxZogkcQ":{"text":"I wasn't sure what to expect when we went here for dinner with friends.  It was recommende","useful":2,"cool":0},"mUzPwjI-Zo82DY1M_-Ba4A":{"text":"First rate food and friendly service.  No wonder they are getting attention in the press. ","useful":0,"cool":0},"BBw8G3_RXmuUCxK71mfShQ":{"text":"Ok, so I know 5 stars may seem a lot for any restaurant, especially one that is newly open","useful":1,"cool":1},"rwoAWycd4ag8_9oancX0nw":{"text":"Apparently their are new dining rules in this city, according to our waitress!! We were no","useful":0,"cool":0},"sMx3sFgbzd1KWaxWvfRFmA":{"text":"I discovered this jewel about six months ago and I can't quit it!!! Best brunch in New Orl","useful":0,"cool":0},"njJ3Md6piwOnBKoHWiyfQQ":{"text":"Great food and atmosphere. My wife and I had he pizza with cauliflower and it was amazing.","useful":0,"cool":0},"BtCpN6UUvJeW8_dKsiJVew":{"text":"Excellent neighborhood feel--like you're invited to a good friend's home for dinner.  The ","useful":7,"cool":0},"DVjIGhJZZ2zPpuqmessfFw":{"text":"I was recently hired for a new job so my girlfriend and I decided to pick a place new to c","useful":5,"cool":2},"0ABrZ-FMoTlGtSsgfdVIPw":{"text":"Had dinner tonight @ Paladar511 for the first time since around Mardi Gras. Last meal was ","useful":0,"cool":0},"LllLyp06c8imMb34wuSv8Q":{"text":"I live in New Orleans, dine out several times a week, and really try to avoid going to one","useful":0,"cool":0},"366G7ti8nwj55mIh2xCCcw":{"text":"We came here for brunch and it did not disappoint! The only thing that would make it bette","useful":1,"cool":1},"odZJCeOWVsXsr8tL-umKFg":{"text":"Fantastic food.  Innovative. Unreal flavors. Very cool urban chic interior    Great staff.","useful":0,"cool":0},"VuKbGHGs-kXVnHZ3t36koQ":{"text":"What a wonderful \"hidden\" gem. Just a short walk from the Quarter and so very worth every ","useful":0,"cool":0},"HkG0eVtw7ko9KyHLvr5Zdw":{"text":"Absolutely delicious and fresh tasting dishes. We were just going for a few snacks and end","useful":3,"cool":1},"_uHg6L9VPPUob35edALX4Q":{"text":"My favorite place in New Orleans. Can't help myself from the Beef\n Carpaccio and Braised R","useful":1,"cool":0},"iORNCW3eE9zOBTQbitPHUg":{"text":"Absolutely fabulous.   The appetizers were phenomenal.   Our group of 4 had 5 appetizers a","useful":0,"cool":0},"obOsRt4oJEddqF7F-NvwzQ":{"text":"I have to admit I was a little drunk when I went here but from what I remember it was awes","useful":1,"cool":1},"MtrXdvGK9e1_kE7WlLknSw":{"text":"Five star. They were really nice and served our party as the kitchen was closing. Good por","useful":4,"cool":1},"iYA_at9pqimsjQO8Ov09yA":{"text":"Delicious food & drinks, great service and nice ambiance. No complaints, will definitely c","useful":0,"cool":0},"tuyxBdMtBGnAuiH3A3vjlQ":{"text":"Paladar is so cute, the location is beautiful! A friend and I came in around 6PM and were ","useful":2,"cool":0},"igasIvCBBYjhFeyPtye3wg":{"text":"This place is on the up and coming to being one of the hippest and yummiest places to visi","useful":5,"cool":0},"_rEEYy7evRCMJdaHc2eyKQ":{"text":"Absolutely delicious! I got the Korean Steak & Eggs and it was phenomenal. Would definitel","useful":0,"cool":0},"1WKFHONcFymHJwJk7_VeQw":{"text":"Great for brunch! I got the Crab Eggs Benedict which was delicious and had a really unique","useful":1,"cool":0},"prnIfLnrI-1u4D2-x4bsRQ":{"text":"First, you'll be struck by the gorgeous interior. I kept craning my neck to take it all in","useful":0,"cool":0},"Art763OakwfCgFaFMQm29Q":{"text":"omg. the korean steak and eggs. i think glitter exploded in my mouth when i ate it.  The s","useful":1,"cool":1},"FJGHUSKHh99B_HStNHKypQ":{"text":"My boyfriend and I chose Paladar somewhat randomly after reading about it on Nola Eater's ","useful":3,"cool":0},"V9UOjp3vNtPAX7Z5KLMbjg":{"text":"Had to write a review because this place and food just gave me all sorts of euphoric feels","useful":2,"cool":1},"NNHvatJmLYGKHCoVVZX3Kw":{"text":"DAMN!\n\nWhat can I say but a truly magical food experience at Paladar 511.\n\nThe food and se","useful":1,"cool":0},"8vmv_s9rvRbd9ybdL2SWGQ":{"text":"Six of us ordered all different dishes and every single one was amazing. So fresh, innovat","useful":1,"cool":0},"UUYfqY7FZV_8StZ7TkPa9A":{"text":"Absolutely wonderful food, service and atmosphere. Every minute of our experience here was","useful":0,"cool":0},"v8YDgCbB0vFJ02JPFU7QQg":{"text":"Had the clams to start. They took awhile but man were they good. Next we had the melon sad","useful":5,"cool":0},"GtA4mVbMrOYpcHtaXuHrWQ":{"text":"Absolutely amazing! My new favorite, hands down. Everything about this place stands out- t","useful":2,"cool":0},"GbzYVqwxZeZNOKb3REWmmA":{"text":"I have been here twice and both times I was very impressed with the food! So much  flavor,","useful":2,"cool":0},"HV1jW1bS4wfn_Md_K6y9yA":{"text":"Fun place with a very chill vibe. The food is good, but definitely better in the area if y","useful":0,"cool":2},"_MgTWFmrpmzGxetu6T2GCg":{"text":"One of THE BEST meals I've had in New Orleans hands down. Everything we ate was incredibly","useful":3,"cool":0},"A_EtBjhQNaNK6fRxSPu6PA":{"text":"Brunch review:\nApparently just started serving brunch and it was delicious! The farm egg p","useful":1,"cool":0},"T84p7WhUSAMVJrS4FxZRFg":{"text":"LOVE this place!!  \n-Always order the papardelle.  I just think it is the best I have ever","useful":0,"cool":0},"jBOb9E1MyeHgKjRuIM1v5A":{"text":"We had booked brunch at Paladar 511 for our grandsons Holy Communion brunch. The ceremony ","useful":0,"cool":0},"DZNigSDDfC7TlLw1arexaA":{"text":"The food here was tremendous. Flavor through out each dish. The basil aioli on the tuna wa","useful":1,"cool":0},"A-kLscOvSByXg3NhqDulrw":{"text":"We found this gem in Marigny.  Very original menu for Brunch.  Two blocks from Frenchman S","useful":0,"cool":0},"BpaxW_i-QBsCzLpa8LoVJg":{"text":"I love this restaurant. Every time I go I relax, settle in and enjoy the effortless comfor","useful":0,"cool":0},"GyFWut9O2wyjEePTUhFSCQ":{"text":"My family went here on a Wednesday night. The place was busy which was a good sign. We got","useful":1,"cool":0},"R61f2thd3xoonjM9FY-M7w":{"text":"Brunch is  Absolutely Amazing!!!!! We had the Eggs Benedict and Lemon Ricotta Pancakes. So","useful":0,"cool":0},"YvjIYHVUHuScVQIEIMvZLg":{"text":"I have been hearing great things about Paladar 511 for a few weeks now...so I decided to p","useful":3,"cool":0},"Qz3dS8mEM2fQBPuDP1WWVg":{"text":"Omg - prob one of the best meals I've ever had. We ordered the artichoke appetizer, I had ","useful":0,"cool":0},"aLnhPBjINPe-qgap0X2rhQ":{"text":"Great breakfast food!  The home fries we're outstanding.  Crisp outside, fully cooked stea","useful":0,"cool":0},"A3LCTFsvkH87Pgho91oLJg":{"text":"I've only heard good things about this place and I am soooo glad I stopped in. We made res","useful":3,"cool":0},"jCSyuk_o-cxfmkFxpCXcKQ":{"text":"Sunday brunch, drool-worthy. Short ribs are incredible. I've tried everything on the brunc","useful":0,"cool":0},"wSX8mkdQMHZXwklNxdTFew":{"text":"For the first time ever, we tried a new restaurant and didn't have a single complaint. Pal","useful":5,"cool":1},"QPAnLPwsc-Jr5-rOGwjB_Q":{"text":"Wonderful evening.  Fantastic food, service and atmosphere.  Grilled shrimp was amazing as","useful":0,"cool":0},"H66wFZnl9_wq2XZq22PFHg":{"text":"There is something to said about a place that constancy delivers fabulous food. I am able ","useful":1,"cool":3},"XmtWZX1hed_A86aG3MuwZA":{"text":"I love this place. Great for a date or with a group as all things can be shared.\n\nMy wife ","useful":5,"cool":6},"3zM0e9h7kj4vyAYXzC2Uog":{"text":"This is such a cool place! The vibe is upscale casual, with a very creative and hip menu f","useful":0,"cool":0},"Fksi48facxWYhAmR0Yejow":{"text":"Excellent FOOD!--You are greeted as if you have arrived at your families for dinner and wi","useful":0,"cool":2},"xlZHG3nN8TVCojuo32koog":{"text":"Went in for brunch on Saturday and started with the Brandy Milk Punch, very tasty! We orde","useful":3,"cool":0},"5mi1H_vaIyLxG2Rzi_SLqw":{"text":"So good.  Casual atmosphere with excellent food.  Loved it and only a couple blocks from F","useful":0,"cool":0},"n6xX5K47px84ASQs4fZ4-g":{"text":"Gorgeous decor and fresh delicious flavors. Had the goat sausage pizza with roasted red pe","useful":3,"cool":1},"2vpdFto58gHYfA7YxVJvcg":{"text":"You want to try everything - and the wait staff help you choose by knowing about what is o","useful":0,"cool":0},"vgTzh0vAScdRfbZf4IjbeA":{"text":"Brunch was great. Service was friendly and quick. Apple pecan bread was fabulous. Farm egg","useful":0,"cool":0},"3RhpbAFs9KwI0DZM48H84g":{"text":"Paladar is a very good place for diners. All of our appetizers, entrees and desert were fi","useful":2,"cool":0},"oDJahEbFXd1kk_yQUzUcSg":{"text":"My first (and as of yet only) visit here, was a few weeks ago. I went to meet friends for ","useful":0,"cool":0},"Cfv-wRhcY9w60PLfdDgqmQ":{"text":"I'm vegan so I absolutely couldn't eat here. :( Maybe the chef should add a vegan salad or","useful":0,"cool":0},"aEQ8dggYItf_pWEfk1uN4g":{"text":"Upon first glance, this restaurant is reminiscent of Mariza.  Similar to Mariza, the resta","useful":1,"cool":0},"x1bTxyJvmOo_Fl62-mTWSw":{"text":"Cocktail menu is all kind of trendy/quirky and I had hoped for more classic drinks. Pizza ","useful":0,"cool":0},"CdbQkYr1t65EBLYBdwlfSA":{"text":"Came here for breakfast, and as everything in New Orleans, we were not disappointed with t","useful":0,"cool":0},"yQDwaRT0K98e7QJolfnZYA":{"text":"Great atmosphere, great food. I tried the Korean steak and eggs and will probably be cravi","useful":1,"cool":0},"JfWtJ1cZ-xpslEw6i0nxsg":{"text":"Oh, man.  As stated before, I love New Orleans and visit 4 times a year or so.  I have my ","useful":3,"cool":3},"HND_j3dIIftxzQp4zcI9Fw":{"text":"Recommended by a local (after we mentioned we had reservations at a higher-rated spot in t","useful":0,"cool":0},"t-oQQQH9f2NaN3zYhPJASw":{"text":"Awesome place to have a great causal dinner! The chicken and Pork chops are so tender and ","useful":0,"cool":0},"PojMYkyluRaB6v5lKP7_-Q":{"text":"Food was outstanding, enjoyed literally every bite and more creative/sophisticated/complex","useful":0,"cool":0},"zH03eoGCCSAoxZxVgZUfPw":{"text":"Wow!  Great Italian wine, unbelievable appetizers and pizza really, really worth writing a","useful":0,"cool":0},"h3JBOqDrKburAZJctgqPMA":{"text":"We went here for brunch and loved it so much that we are going back for our rehearsal dinn","useful":0,"cool":0},"Cxb7MyCeSdj-zRujVjoqLw":{"text":"So I've been dying to go here. Waiting patiently for friends or someone to join me on this","useful":2,"cool":2},"fGUSL-fV0W5WPUpK3fzppw":{"text":"Solid 4, could even by a 5, but we don't just give them stars away. Great wine list, cool ","useful":0,"cool":0},"wLpdOhgEjzMPLkDLq0D3bA":{"text":"We had ravioli, pizza (lamb sausages), and pappardelle with homemade sausages. All of the ","useful":1,"cool":0},"Gg75_uVWzc6tkAXw75d-6Q":{"text":"Came here Wednesday evening and the atmosphere is like a modern rustic. The host greeted u","useful":4,"cool":3},"Z4RWA-jrFkFrqwuwvMCQYg":{"text":"Food is very good! However, not good good enough to atone for the sub par waitstaff (very ","useful":1,"cool":0},"tLmNK7n128-e3o0ZkFNueg":{"text":"I picked this restaurant for my birthday dinner, and it was the perfect choice! The vibe i","useful":1,"cool":0},"18YzA7-ORxxsjmjNw43DBg":{"text":"Great industrial atmosphere. Not too noisy given the exposed brick and steel dining room. ","useful":2,"cool":1},"9ebptlE0rACRCKa7U9O6ag":{"text":"This continues to wow me and my guests after having been open for a while, especially in N","useful":0,"cool":0},"4omAdB6VuHqW01BZdFKOhw":{"text":"Amazing pizzas and craft drinks for very reasonable prices. You can have a $9 watery marga","useful":1,"cool":1},"8JN6vr89pFQkWc3wvycJng":{"text":"We walked in on a Friday night and they were able to get use seated at the bar right away!","useful":2,"cool":2},"GsWHeJLPkEmjQG4hYsRNXw":{"text":"Loved it!! The atmosphere is great, well spaced, and the food was SO good. I got the pork ","useful":1,"cool":1},"dzgKoQ6HuUI-RFieCeqrbA":{"text":"I loved the decor and ambiance of this place. It's definitely more modern and chic. I made","useful":0,"cool":0},"jt1uajv_KbR-UL0bYw4z9Q":{"text":"My wife and I stopped by for an early dinner before heading to Frenchmen Street to listen ","useful":0,"cool":0},"_tBZivy3gsVOoi-AJ94TQg":{"text":"Stopped in to get a snack, delicious food (amazing salad with peaches, candied pecans and ","useful":1,"cool":0},"EHDXK0tQ0d21XpfrQXrzCA":{"text":"The entire experience was outstanding! Drinks were great and creative! The appetizers were","useful":0,"cool":0},"ae7utyKJ--AIhQpNEfDbaQ":{"text":"Love this place. Excellent food and service. Relaxed, neighborhood vibe. The breakfast piz","useful":0,"cool":0},"H6DPLyQOuQ6TmZ0HX7mMhw":{"text":"Excellent brunch place outside of the crazy touristic crowd. Fresh and inventive menu. Ver","useful":0,"cool":0},"n2X1KULMhvCFhbOWUiYNZg":{"text":"This place is incredible! Visited here on a cold January evening for a meeting with two ot","useful":0,"cool":0},"t4CAETJez-0S49oZ1to8hg":{"text":"Food was the best we had in all or New Orleans. A hidden gem you must visit. Highest quali","useful":1,"cool":1},"SdoJ9jkhyTnDEHWQGg8yXQ":{"text":"This place is the best. Great pizza, obviously, but the specials are winners every time to","useful":1,"cool":0},"AzZdVXMh7B-QyWUkAQaGUg":{"text":"What a rad location for new pizza place Palandar 511.  Right outside the triangle on Marig","useful":0,"cool":0},"wueGtnQzasDpifOyHISTSQ":{"text":"They accepted my reservations for 18 people for a welcome dinner for my destination weddin","useful":0,"cool":0},"Y3TEnx7AIxk2uUVleUi7ag":{"text":"Very slow service.  In spite of being almost empty for brunch, I had to request refills on","useful":1,"cool":0},"DqwVro0B_6dN1hr3nZ3-Uw":{"text":"Well, it doesn't get any better than this.  Atmosphere, food quality and service abound.  ","useful":0,"cool":0},"braR0dzeU_rT7x7vPM3uRw":{"text":"It was fine, really pretty, food was good, not the best ever over the moon, just good, lov","useful":1,"cool":0},"Ti9iboJaTWqGPSByNnyQ4w":{"text":"We had so much fun! We came for Easter brunch! Needless to say I was so full when I left!","useful":0,"cool":0},"SPgTqUno02tmi9d9DaGlLg":{"text":"Took some out of town friends here for dinner on Saturday night, and it was absolutely ama","useful":0,"cool":0},"3Qav04EG-21bCPt42GTTqw":{"text":"The Huevos Rancheros was amazing!!! Fresh ingredients and very tasty. Highly recommend the","useful":0,"cool":0},"tw9dktWihIKmplHddfJ8og":{"text":"Will never go to New Orleans again without visiting this place. Have been for brunch twice","useful":0,"cool":0},"kN9ksgpjItMqKKpMW-Rngw":{"text":"Notice: I'm upset that this place has chosen to not respect it's patrons and split the che","useful":1,"cool":0},"jns-wEF5mrpLUsfZKo-5Wg":{"text":"I'm an Atlanta native, but every time I visit NOLA I make it my mission to stop at Paladar","useful":0,"cool":1},"2vkSOV76ziqoBvfvuS6lZQ":{"text":"Located near the edge of Faubourg Marigny and not far from the river in a large warehouse ","useful":0,"cool":0},"iQ5ZCHWA1XLhNFLtAViHTw":{"text":"I don't understand how food this good exist!!!! Amazing. We started out with the yellowfin","useful":0,"cool":0},"-HLufP29GGS0sAasBrlAkA":{"text":"I arranged a large group (9) dinner here for my girlfriends and we had a wonderful experie","useful":0,"cool":0},"yk8XLmFlMkCdu2uYyLDA8w":{"text":"I was craving some authentic pizza and this place had five stars on yelp so I said why not","useful":2,"cool":0},"cX0Ci3V73qHpzItlQ6RsQA":{"text":"I remember when this place was an old second hand book store and bicycle repair shop.  Lov","useful":1,"cool":0},"3EnAb6KxzQV-UlpEVfdm8Q":{"text":"The space is really pretty and great for a casual date or meeting a group of friends.\n\nThe","useful":0,"cool":0},"eB0Xc0fmgdiqInGtX76KRQ":{"text":"Tucked away a couple blocks from Frenchman street, Paladar 511 is anything but touristy. F","useful":0,"cool":0},"hYCXqDLhWJfn4v3s1ctvvQ":{"text":"This place was wonderful! It had a great feel to it and was a beautiful place to see. We h","useful":1,"cool":0},"uMVHQvgamrAdPA2qP4sLpA":{"text":"The food is amazing! We found Paladar by chance last year and now whenever we are in Nola ","useful":1,"cool":1},"SzmpNCmQfgXSxmuEyhlIWQ":{"text":"Great food, well plated, with equally good service, decor, and atmosphere. Would love to c","useful":0,"cool":0},"8acZdEvhZFRhVW4xiBXBoQ":{"text":"Drawn in by the atmosphere, won over by the food, drinks, and excellent customer service. ","useful":0,"cool":0},"zO1plbqo8Zb9AgAbbW6zwQ":{"text":"Amazing meal. Call ahead...there will be a wait. Just a block away from Elysian Fields Ave","useful":0,"cool":0},"1ON2JA6Ql-NbjjEueh1BCA":{"text":"I ate at Paladar last night with two senior Southern Belles (aka Established Mississippi L","useful":0,"cool":0},"DmwThNyKsKePhh60EU0w8g":{"text":"Wow!  Absolutely everything was delicious- the place was beautiful & service was outstandi","useful":0,"cool":0},"L0cpW7wpPG07wbo-oukrFg":{"text":"Another outstanding meal, started with the tres colores salad and the house variation on a","useful":5,"cool":3},"dpUgRdkBWGtF-SYJ_zsv7A":{"text":"This place is getting 5 stars from me. Amazing food. Great atmosphere. Great drinks.\n\nMy b","useful":1,"cool":0},"lXr-fWzlIK1CdM4NNeZ4QQ":{"text":"OOOOO! This place is so good! We made a reservation last minute and I am so happy we did. ","useful":0,"cool":0},"aS-P4TU-p7h46nds9xu-EQ":{"text":"Came here for Easter brunch and it was so delicious. I had the Korean short rib dish and i","useful":0,"cool":0},"mz3x06lUJI7r_qfA36XOTQ":{"text":"Restaurant recommendation from a NOLA resident.  Food was awesome and service was excellen","useful":0,"cool":0},"TkFUYvhWnAbXb2hyaTpH7A":{"text":"Paladar comes through on Labor Day.  We were able to walk in and grab a seat at the commun","useful":3,"cool":0},"yQaT0p3RUznEk0QYN6BHrw":{"text":"the food is delicious, but the service is seriously lacking. Cold and disengaged servers t","useful":1,"cool":0},"iucTRiTjwOcqM2imdFp78Q":{"text":"Table of 10 on a Monday night. Amazing service and ambience. Most of the food was deliciou","useful":1,"cool":0},"XvNN63WkVt-hMDVZ7WlEVw":{"text":"Everything is great about this place-- well, almost. The food is superb, the space is a sh","useful":2,"cool":1},"iYgCUu1t4bqLIVg2-JOABw":{"text":"If I could eat paladar for all three meals everyday I would. It's the best in New Orleans.","useful":2,"cool":1},"vGFKHIntSZQRbhW8VNzJzg":{"text":"Love. Love. Love. This restaurant checks off all the marks. The restaurant itself is aesth","useful":0,"cool":1},"Mm95djJW4jQPEmxMURZTBA":{"text":"This place has the best food. I had the breakfast pizza and my friend had the breakfast sa","useful":0,"cool":0},"ulD_dniRiQl0idmvxeg3tg":{"text":"Awesome experience at this cool new restaurant. For starters, we got the Tuna Crudo (light","useful":2,"cool":0},"JbGD_oNGkrlJ_E7DP4h_kw":{"text":"Great food, super inattentive service. Busy brunch, menu has amazing range of options. Our","useful":1,"cool":0},"HTTWbneLwSKAMrE7KQ5qKQ":{"text":"Oh my, my Pappardelle Ragu was awesome.  Why oh why can't I cook like that?  Wine list was","useful":0,"cool":0},"VEYnxaIvprkbhU6mRP4qog":{"text":"Last night in NO and we ended it on the best meal! Ordered the little Gem lettuces salad, ","useful":0,"cool":0},"LYWFq4T_OnlujaUlUuJy9A":{"text":"Amazing! We came here for NYE dinner without a reservation but we were sat at the communit","useful":0,"cool":0},"VVf9kPP_MuHkLeDXxySBKw":{"text":"Tried to go to Three Muses but they were booked up, so the host suggested Paladar, and now","useful":2,"cool":0},"eW1EPVlh7c0lAGXC1fHJ8g":{"text":"Dined here on Sunday, April 2, 2017. Unassuming space in the Marigny w/ expansive dining a","useful":1,"cool":0},"AHX0LTHzFmQ-6Or95JUB5Q":{"text":"So we've heard people rave about this place and decided to give it a try for brunch.  Some","useful":0,"cool":1},"IstSQb4kr0cDiMHUwDyifw":{"text":"Great for brunch! Lemon ricotta pancakes and eggs Benedict were delicious. We also had the","useful":0,"cool":0},"aNEoIepUxxAGYUCbPaIYxw":{"text":"We treated our crew to dinner to celebrate the end of shooting on our TV SHOW. They prepar","useful":0,"cool":0},"T7BrAI_57SdfUExExhBrkA":{"text":"The place is lovely! But unfortunately poor customer service. The employees were rude, and","useful":4,"cool":0},"g9kApwJCwn6kBqcaYjdDnQ":{"text":"one word, three times: pancakes pancakes pancakes!  The lemon ricotta pancakes are a MUST ","useful":0,"cool":0},"E_mk0WvWiZDIToRaygAIcw":{"text":"This place has the California/New York vibe.  The atmosphere earns a 5 star in my opinion.","useful":0,"cool":0},"bSGQdhDdaZtP5t4n9eFMBg":{"text":"Best new restaurant in New Orleans! Not to be missed. Fresh, fresh, fresh! Delicious, deli","useful":0,"cool":0},"5CiHg6AyO-mxdBZn5gBi9g":{"text":"Had the Wagyu Steak sitting at the bar overlooking the kitchen.  \n\nGreat menu, and atmosph","useful":2,"cool":0},"WJvMkia09hbgA4g_QyKMfQ":{"text":"New York hip meets NOLO charm. Take an industrial chic-type open space, outfit it with lot","useful":0,"cool":0},"-wtzDHDDJqWnxPulNwWqCw":{"text":"This place is fantastic! The greatest chef / service ever. We got a the artichoke pizza an","useful":0,"cool":0},"2v_UaTBm9vXVCpCMD0iPgg":{"text":"My partner attempted to take me to a nice celebratory dinner at Paladar this week. He made","useful":1,"cool":0},"-Ws_IctIHc4LzWqs-1Xfgg":{"text":"This food, you guys. This food. It was so flavorful and perfect. I am dreaming about the a","useful":1,"cool":0},"qrvG7zd21gxYIqwY89fSfQ":{"text":"We stopped by for brunch after reading the great reviews.  Very cool space.  The food was ","useful":0,"cool":0},"7zmmdtMsyNBOEizhC-Uxaw":{"text":"Very attractive place. We sat in the loft, giving us a great view of the space from above.","useful":0,"cool":0},"9fTYlSthZqBfoCXNsiWhvw":{"text":"Disappointing...Nothing about Paladar 511 fits New Orleans or its historic neighborhoods. ","useful":0,"cool":0},"mZY0d9-4gk50x16gaRGTIA":{"text":"The food was good. The huevos rancheros are really good I'm told. If you have food allergi","useful":0,"cool":0},"NLJ0DK7IZFNBZZhWd06LMg":{"text":"To begin, the service was exceptional from start to finish, from the friendly hosts to the","useful":0,"cool":0},"GgCeveQDbqjQN3r95Qsi4Q":{"text":"This place was absolutely wonderful.  The ambiance inside is warm and inviting.  Love the ","useful":0,"cool":0},"yfWqr7jnFYekKKasf3-3BQ":{"text":"Last meal before heading to the airport. Glad we went for brunch. The service was friendly","useful":0,"cool":0},"KIkEatB1UjZoy5ToxNXkSA":{"text":"Great place, I've come here for brunch many times and it's wonderful. The home fries are u","useful":0,"cool":0},"Iaj2almahaN2EYWHMNK0Ug":{"text":"What a Gem, every now and then we the Dining Public happen upon a new place that hasn't be","useful":3,"cool":0},"ULvstVULvjj9F7I3HpriPA":{"text":"Paladar 511 holds everything I had hoped for and more. The balance of clean and delicious ","useful":9,"cool":5},"HMfzWeQ0bXn58mAD_JFkDA":{"text":"I really like it here, and it's reasonably priced to boot. the space is loud af - that's p","useful":1,"cool":1},"5CwFZfI40SKhx4yshZQqQg":{"text":"Ok, so this was a work thing, so no photos for this one. Sorry. But if I did have photos, ","useful":0,"cool":0},"Texcdu_LwK8yk5LRTMNEtQ":{"text":"A friend and I tried Paladar for brunch today and it will be our new favorite restaurant. ","useful":0,"cool":0},"Wa4PbAYfXn81vT18OLF_xQ":{"text":"Oh my LORD!  Best dinner I've had this year.  First of all, this space is gorgeous. All th","useful":15,"cool":13},"9kJ6i6d8USqkaoWx67_A9A":{"text":"We called and they mentioned only having spots at the bar, but we went anyways. Ended up a","useful":0,"cool":0},"wrfQHOWdDyQw1uY24E16xA":{"text":"Amazing dinner here. Delicious, friendly, unpretentious, and (at least per Chicago standar","useful":2,"cool":0},"IkC1M-7sVycz8EARcb-Rcg":{"text":"Hidden in the Marigny, Paladar 511 is an American fusion restaurant that was so delicious,","useful":1,"cool":1},"Q6hnnLbps8qZ1LYB5L5clg":{"text":"Great experience....special dinner place.....dedicated staff and serious attitude. casual ","useful":0,"cool":0},"LKbKDArcvO-bjEbxkPtcpw":{"text":"I've lived in NOLA for almost 2 years and this was the best dinner out yet! For the appeti","useful":0,"cool":0},"X3BI2L67gEg9OXjZdD_XPg":{"text":"This was one of the best meals I had while I was in New Orleans. A couple of my friends an","useful":1,"cool":0},"QkMkjSUqO8LseupiiIbyww":{"text":"I keep trying but I just don't love it. You cannot even get a really good dessert here.","useful":1,"cool":0},"jCqnuNX3XBC_up9AIkihUg":{"text":"I can't say enough great things about this place! Service was wonderful and the food was t","useful":0,"cool":0},"GaH8KjYJncYWya1inNiajA":{"text":"I tried a lot of what my friends ordered. Everything was so good. Waitress  was very infor","useful":0,"cool":0},"aoo6a_9c_09nT-LzhC09kg":{"text":"Perfect spot for a nice date night. The staff was really friendly and they helped us out w","useful":0,"cool":0},"dYIgH_bKIIJ9N5ncpiOumg":{"text":"This is my favorite new-school restaurant in New Orleans. Fresh, seasonal, creative, delic","useful":0,"cool":0},"9qFzP7SL08eTQoSq23e3Yg":{"text":"This is my new favorite go to spot in New Orleans. I love it. It's the kind of food you th","useful":0,"cool":1},"i7qNPBNo0F2ZTOFctHJCUw":{"text":"This place is off the beaten (tourist) route in Marigny, although it's only a short walk f","useful":1,"cool":0},"rC1DrO3RoZxzoWAHsoUKPw":{"text":"If we could give 6 stars, we would! Ham and cheese breakfast pizza was to die for. Chicken","useful":1,"cool":2},"vVlbvscoG85YxgsP-nzEzA":{"text":"Super impressed. The only reason my rating is not 5-stars is because I have to go back and","useful":1,"cool":1},"W3e6Y6iuPbOQOWs6cOCp8g":{"text":"This is one of those places that makes you wish there were more stars. Well balanced, uniq","useful":1,"cool":0},"Mkqz4O7B-CMNeicvF16iOQ":{"text":"Incredible atmosphere, super friendly staff, and delicious food - it checks all the boxes,","useful":0,"cool":0},"8KEZeipd04hIJ_wD4A5dnA":{"text":"I just can't stop coming to this place. Its one of my favorite brunch locations. It's real","useful":1,"cool":1},"GkttobX1n03bJmkHQIvrOw":{"text":"Delicious brunch in the marigny! I went with 3 friends for brunch one Sunday. We made rese","useful":1,"cool":0},"kzqpfkRdyyQJWsoiCZbFcA":{"text":"We had brunch on a Sunday afternoon and enjoyed every bite. Food and atmosphere were great","useful":0,"cool":0},"XAFfhdo5Bcb44H133RB8GQ":{"text":"Found this place while looking for a restaurant near Frenchman st. It was a little bit mor","useful":0,"cool":0},"wqYyymgSXcGPKXZNf90aWg":{"text":"Whenever traveling to New Orleans, traveling outside of the French Quarter is essential to","useful":0,"cool":0},"b3bLfRWY5iE0qScrFUUWyg":{"text":"My wife and I went for a late dinner. The staff was friendly, industrious, and with the op","useful":0,"cool":0},"Rfoe4-5aktFiKaYLHlHrhg":{"text":"Went for my birthday and was not disappointed! I had the squid ink pasta appetizer which w","useful":0,"cool":0},"4rekygxXQJ9s1UBHuEK9Xg":{"text":"Love. We walked in for a late Saturday night reservation and were delighted by how beautif","useful":1,"cool":0},"9u8qcJd1Azu9RH0dtVLZKA":{"text":"Have a lovely meal last night! Sat at the chef's bar. Tina crudo was heavenly!! Gazpacho a","useful":0,"cool":0},"IOmzU1JRR3K-Xmx5skFKWQ":{"text":"The food was over all absolutely delicious! They give you the option of a bottle of water ","useful":0,"cool":0},"2_pJluFYcmiDNwV19E20pw":{"text":"Three words: CRUNCHY HOME FRIES. They're salty, oily, herby and plentiful. These alone ran","useful":2,"cool":4},"UqV1XYbkE3HawmSVPfEQVw":{"text":"Came with a couple of friends, right when they opened for dinner. The place looked awesome","useful":5,"cool":3},"iAV3_P8P8-v_He2W1NkDng":{"text":"Beautiful menu, beautifully prepared, exquisite flavor and highly recommend. We found on y","useful":0,"cool":0},"_Ub1RxyX2A8GD0PlfFyV0A":{"text":"Loved the warehouse aesthetic and the service was good (not over the top, though.) The foo","useful":1,"cool":1},"ReKdLmO2KrPjRV5wxoKkDQ":{"text":"When someone tells you a restaurant is their favorite in New Orleans you listen and then y","useful":0,"cool":1},"4-OtGVCgiNbML9fGO35w3w":{"text":"In a sea of amazing restaurants this was my absolute favorite during our recent trip to Ne","useful":0,"cool":0},"jxb6vydCHQ0FRWH4gu5sTg":{"text":"I literally made a Yelp account just so that I could give this place 5 stars. The only thi","useful":4,"cool":1},"SJ-UZO7vx2ReLY_DwW0hiA":{"text":"My girlfriend and I were so impressed by Paladar that we went back for a second dinner on ","useful":2,"cool":1},"q4i__Y2NVrGJQO9O9qN2tg":{"text":"Excellent in every aspect. Drinks, decor, food, service and ambiance are off the charts. R","useful":0,"cool":0},"pVXjfrscjU0FG8qfIWGnfg":{"text":"My first time to NOLA and couldn't have picked a better place for my first meal. Honestly ","useful":0,"cool":0},"aBQLbML591G-4CbQMyLsFw":{"text":"Great food..... Just don't get the Pork Saltimbocca. It is a deep fried mess.A gross offer","useful":0,"cool":0},"FhkW1YshRoeomFJ232iVGg":{"text":"Paladar 511 should be on every foodies New Orleans must list. \nOpen kitchen concept is suc","useful":1,"cool":0},"XUlBnY0_Gv16imqoQCSlfA":{"text":"Recommended by a local and it was superb food. Would've been a perfect place had the staff","useful":0,"cool":0},"NIXaV76Hs_MM_7woUMCwUw":{"text":"A fantastic upscale Italian dinner! We came here on a Friday night and had such a good exp","useful":0,"cool":0},"TTnF8miz_s4XP9LJubkDeQ":{"text":"Love this place. If you're dining alone sit at the kitchen and enjoy your meal.","useful":0,"cool":0},"onk7uS6x4awkskn2-APysA":{"text":"My husband and I have visited quite often for the delicious breakfast. The lemon pancakes ","useful":0,"cool":0},"nqo5uSN1nEOILCVWZgoM1Q":{"text":"ZERO STAR! Worst brunch ever!!!  Called in at 12:45pm to see if they had a table available","useful":0,"cool":0},"pxeZKZJe-A9H0PTOUKDmgg":{"text":"Made 6:30pm reservations for a Friday night. Glad we did, because it was pretty full alrea","useful":1,"cool":1},"pfSSGN3VRU7uLmaeObIGtQ":{"text":"Order: Salad to share as an appetizer, House Made Papardelle, and Pizza with lamb sausage\n","useful":5,"cool":2},"KWMP8Y4G9NQIE7DleBfLGg":{"text":"Birthday dinner was AMAZING! Beef carpaccio was mouth watering, trout crudo was so light a","useful":0,"cool":0},"c16bOQFY8jtkA2peM2Ut2Q":{"text":"How refreshing and amazing to be in an open kitchen and bar space and see a kitchen and FO","useful":4,"cool":5},"UlL759HzydeXghCtKPKOnw":{"text":"Let me start off with the positives...super cool atmosphere and SUCH GOOD FOOD!\nBut the se","useful":1,"cool":0},"RqIuBRDD6n411NEmYWMaBQ":{"text":"Owner made us wait for an hour with next to no communication after saying it would \"5-10 m","useful":2,"cool":0},"R2jHfyD60QNgke-F7Hkkyg":{"text":"I love this place in the Marigny. I didnt realize they were open for breakfast (sorry, bru","useful":4,"cool":2},"ITe_73sJVOdthQFYENNpZQ":{"text":"Awesome restaurant. \nThe ambiance is so great and the staff were all very friendly and res","useful":2,"cool":0},"NYO-BsAkO44UKmVtwUY3oA":{"text":"I hate to do this because we absolutely love this place!  We had a last minute birthday ce","useful":2,"cool":0},"qjiJbTjK3j8TcJx2ufvhxA":{"text":"This is one of my favorite restaurants in NOLA. My parents enjoyed it too when they were v","useful":0,"cool":0},"EhM_AN-VdkZHdrXI46lDGQ":{"text":"I'm so happy we found this spot.  We were looking for an off the beaten path place that wa","useful":3,"cool":1},"KYBcLUG5ihRoy1fPMYB6YQ":{"text":"I've heard amazing things about Paladar 511, and finally got a chance to grab brunch with ","useful":19,"cool":16},"MQkJELcpdntTR5xEpTdmJw":{"text":"Absolutely outstanding! We were staying at the Frenchmen Hotel just a few blocks away, and","useful":2,"cool":2},"X2qPhA-oHVMN8a-S3HUipA":{"text":"I learned many things when ordering from @paladar511 during phase 1 of reopening.\n:\n1 Papa","useful":0,"cool":0},"IHvAfsnWhrT3mksTA_JTfw":{"text":"This gem is absolutely amazing. As most Yelpers have reviewed, it has an open kitchen conc","useful":3,"cool":1},"jqM7c4oUilVZHmVljF0HSw":{"text":"The night we tried Paladar, they were severely understaffed. However, we didn't mind the w","useful":0,"cool":0},"M03e5iFKbI-6W6Zci-Y5cg":{"text":"Wow. I don't really know what to say other than this is one of my favorite New Orleans din","useful":0,"cool":0},"dDX0DdIZYZ7Z6qPqr6yLvQ":{"text":"Even with COVID protocols in place this place still delivers a hip vibe and some fantastic","useful":0,"cool":0},"i7SjLX-q79sAkh5xnEPb-A":{"text":"****UPDATE. 8/8/18\n\nJust finished another fine meal at Paladar. I've updated this simply t","useful":0,"cool":0},"4wN15A8WGZO-CjyJAv7gTg":{"text":"I've eaten at numerous places around the world that leave an impression on me. The first t","useful":0,"cool":0},"pc7VVBV238yRFf8XWCoGEA":{"text":"The ambiance of this place is amazing. It's tucked away toward the end of the street an if","useful":4,"cool":2},"FTwgU3Lq_Cnxe7Thyy_0NQ":{"text":"We had a really pleasant dinner here in mid June. Definitely recommend getting a reservati","useful":1,"cool":0},"py6vMkaNpTlSOt8yvkwdGA":{"text":"My husband and I are currently on a year long trip around the US and we visited New Orlean","useful":3,"cool":0},"8kncdyL7UMlc-Uo8xbvwAw":{"text":"Average food, rude servers, to  cool for school. Rushed us and you have to order apps and ","useful":1,"cool":0},"NgDM1GxCCm6XGwmu5ExC4Q":{"text":"In my best Larry David voice, this place is prettaaayyy prettayyy good. \nFirst, love love ","useful":5,"cool":0},"izxBUbTRxmlDHLnOWnHk-g":{"text":"If I could give this zero or negative stars, I would.  While riding around the area on May","useful":2,"cool":0},"BVukrT3ANnMY0HPe6p0ECg":{"text":"Great service, food was perfect. I dined here 4 times in a week and every thing I ate was ","useful":1,"cool":1},"X9cW3_In39FddqJBCPl8JQ":{"text":"Believe every good thing you've heard about PALADAR 511!!! Marty started brunch with HUEVO","useful":3,"cool":0},"52VYEDWw77Sc4M1MuBRAag":{"text":"Chris Ball was a passenger next to us on the plane.  He recommended this place to us.  We ","useful":1,"cool":0},"QOy3Xfqmmumeo60FEv5QOQ":{"text":"I ordered the chicken sausage entre. It came in a bowl swimming in a white watery substanc","useful":1,"cool":0},"gFjbZT_34MbDSynlsZB03w":{"text":"Had the Korean beef, lemon ricotta pancakes and huevos rancheros. AMAZING! All of it!","useful":0,"cool":0},"6uM-ano1DXRERGcxjuiCrg":{"text":"Wow! The service and food...just wow. This was my first visit, and I definitely will be ba","useful":0,"cool":0},"AQY1wUg5OmhqXrwhb9kiWQ":{"text":"First of all, beautiful place, with a colorful clientele! I was a bit nervous about going ","useful":0,"cool":0},"IB1q9Jpc1MGQcX1mSS2RgQ":{"text":"So great! 10/10! Soup dumplings are amazing. Great, attentive service. I can't wait to go ","useful":0,"cool":0},"A18923Z_gWnP2ijJNIxJpw":{"text":"What an ambience!! My friends & I really enjoyed the garlic bread & fried cauliflower. Our","useful":0,"cool":0},"WFzcw_UcOOLeWH5Nl0K2rQ":{"text":"Warehouse space that has been updated into a restaurant space is the best way to describe ","useful":5,"cool":4},"Yw9dUMOT38mH2HSaMpyodA":{"text":"Loved the ambiance!\n\nFood was great, had huevos rancheros and a Mexican Coke while my frie","useful":0,"cool":0},"mEdY1KcIBqTL55r0yklkHw":{"text":"We went in for a brunch that lasted forever and nearly starved. I know many reviews given ","useful":0,"cool":0},"eiMWRcRvOEGFNtJk2RyHZg":{"text":"One of the public Marigny's finest places it's casual it's dressy it's fine it's yummy it'","useful":1,"cool":0},"YmLIJ7yyPjGBNo6B8Y8jcg":{"text":"Manager was the absolute worst. Please just go somewhere else in New Orleans so you don't ","useful":2,"cool":0},"_5_-rw6yJnhnuSrfMLBOgQ":{"text":"Obsessed with this place. Amazing ambiance. Great for a first date or with friends. The fo","useful":0,"cool":0},"fXaXBRojz_0W01mFY6c2sg":{"text":"Amazing! We had reservations for 2, changed the party to 5 and they accommodated us just f","useful":1,"cool":0},"Cbpj2XlVlpsNJ88PS9hrRg":{"text":"Coming from San Francisco I am used to good fresh food prepared well.  This place did not ","useful":0,"cool":0},"hcOiI_FxdgLds_G652vftg":{"text":"I'm on the way to Paladar 511 now.  Why?  Lemon Ricotta Pancakes!  Paladar 511 is,without ","useful":0,"cool":0},"RhtuGLiLIyJm_UjpRqRsCA":{"text":"Amazing! The sweet potato GNOCCHI, rabbit jus, fried brussels sprouts was to die for. We a","useful":0,"cool":0},"6rnHHsWpPvGT-pTVPkbsgw":{"text":"Great place to have dinner their menu is super interesting fresh and trendy. I got the mar","useful":1,"cool":0},"yeRCOqCmDqcR2Tr-puZzMQ":{"text":"Excellent vibe and food!  Located off the beaten path in a nondescript building, as we wal","useful":0,"cool":0},"Cbf59WYES4e39s5eUrC-WA":{"text":"A small group of us tried Paladar 511 for brunch, and everyone was thoroughly impressed. \n","useful":2,"cool":0},"HfOK2geLmv5FZSLNI0Y4yw":{"text":"Absolutely recommend! The restaurant is beautiful with ample seating. We sat upstairs and ","useful":0,"cool":0},"gsQISv9WOG7Fb5-OYeM4xw":{"text":"Great food, service and very COVID prepared. Staff was on spot with safety. Pizzas ans sal","useful":0,"cool":0},"ULjuv7_Fygn1LPS8J8zlGw":{"text":"Let me start on the positive all the food we ordered was extremely tasty and presented wel","useful":0,"cool":0},"qUB0M8KKQPh8TRVLfIdFjQ":{"text":"Wow...so I was originally going to have breakfast at another cafe nearby, but saw this on ","useful":0,"cool":0},"wJJHem1hhJz4cbO7yVcKLg":{"text":"We went here for our anniversary dinner and we were NOT disappointed. Their food was wonde","useful":0,"cool":0},"qU-85jznuShCsmknHGGn_g":{"text":"Paladar 511 is BOMB. Some of the best food I've had in New Orleans, and definitely one of ","useful":4,"cool":2},"ehbL2f88cMkHdK7Owht9-w":{"text":"Every time I return to Paladar I like it better. And that is saying a lot because I loved ","useful":2,"cool":1},"kXfG9v6zdo11N36J3zkmHw":{"text":"We stopped in for a bite to eat and really enjoyed our experience. Both the host and serve","useful":3,"cool":1},"e1St3XRw1s-xD3x9egEzWw":{"text":"The wife and I went here for the first time for our anniversary and we were both very impr","useful":1,"cool":0},"az3ErlkoBwNABNjq3OpajA":{"text":"The food is good, but I'm not overly impressed. The pizza is a bit doughy. And the staff s","useful":1,"cool":0},"wSsmtrp3TStbY6Shem68SA":{"text":"Why haven't you gone yet? What's wrong with you? Sit at the bar for an graceful orchestrat","useful":3,"cool":0},"G-Ct1WVw9-Se863apxrhYA":{"text":"My friend is moving away from NOLA and we asked her which restaurant will she miss for her","useful":1,"cool":1},"PvQMvyCkUGdp0gNFdEjKkw":{"text":"A group of us were in town for a conference, and one of them was referred to this restaura","useful":2,"cool":0},"KkK8IkJRYvkuJbhNS6Shcw":{"text":"Omg!  This was delicious!  We had the Bibb Salad, the focaccia and arancini to start. I ha","useful":0,"cool":0},"qP7w2EZ6Rmhrl3ugY4TbpA":{"text":"I love this place! I've only been here for brunch but it is always a happy time. I mean, t","useful":0,"cool":0},"ZUMzSV6dR78QZR0xy_Rlsw":{"text":"We dined at Paladar 511 this past weekend and thoroughly enjoyed our dining experience. Th","useful":0,"cool":1},"mK5IFe6ML9Kx2h8zomZAmQ":{"text":"Every single bite of food placed in front of me was transcendent. Like I was having an eth","useful":0,"cool":0},"OuZgey1JCejKXFzIGLl0ZA":{"text":"Pretentious host held tables for preferred customers alleging that they had \"reservations\"","useful":1,"cool":0},"ig40yojpQ9f8FuHBA-hexg":{"text":"How sad.  Dropping Paladar from five stars down to two due to Friday's dining experience. ","useful":3,"cool":0},"bWyg9lRLJsYIJ1oOF0ZoCA":{"text":"It's with a heavy heart to give any restaurant 1 star during these times, but the staff ea","useful":1,"cool":0},"D8tvVbqDW8tRG2c5Ur8yiQ":{"text":"Everything was delicious here! We basically got one of everything- I would highly recommen","useful":0,"cool":0},"AUaCJ_UrqV81KPBtjDEFIA":{"text":"I'm on the way to Paladar 511 now.  Why?  Lemon Ricotta Pancakes!  Paladar 511 is,without ","useful":0,"cool":0},"Ew1PCtMqGtr0wH2GZIFlkw":{"text":"Outstanding food, cocktails and service! The arancini is a must, along with the focaccia. ","useful":0,"cool":0},"u0y4GwpwG0DhPzEdBa2Inw":{"text":"We brought some Atlanta friends here for brunch.  I had passed it several times walking ba","useful":3,"cool":1},"L7CS0XXl5HV-PYdcVdJlWg":{"text":"This place is dope. It's a beautiful environment with well thought out, lovely dishes. Per","useful":0,"cool":0},"vv0T6Gh3VIZYcDg4-8S0ow":{"text":"I read earlier reviews and I knew the service would be pretty slow, but the food was great","useful":0,"cool":0},"UrapVf67LImJDlRSZtRV-w":{"text":"I've been here three times and am always impressed by the food as well as the service. My ","useful":0,"cool":0},"Vx_s_9MnTLX_c3zHhgf07A":{"text":"Wow first time here and was amazed by how lovely the interior was! Loved the natural light","useful":0,"cool":0},"ZV3WOmYQ5p65mplg62QbBg":{"text":"Friends and I come in often. We are all hospitality industry professionals. Worth the wait","useful":0,"cool":0},"i3gqMGEOwVG8BipKicug9A":{"text":"My daughter and I tried out Paladar during our trip to New Orleans, and it was wonderful! ","useful":0,"cool":0},"CjBtmw2c4cLsSGzVRDusng":{"text":"We have been here several times but this is the first review. Each time we have been here.","useful":5,"cool":4},"uSY_3n9RE4suzYwEoa_AsA":{"text":"Paladar 511 served us on of our favorite meals this year so far. Well done!! We had late n","useful":3,"cool":2},"T4I0iyndEkL27qnCpLivDw":{"text":"Everything about this place makes me feel at home. Food, wine, tea, desserts, staff.... it","useful":0,"cool":0},"Yv_ZwYn5XheS3gkFNxaE9w":{"text":"Go here! I can't believe it's taken me this long to review one of my favorite places and e","useful":0,"cool":0},"wSYJUk2ncplg7JRf8mCYeA":{"text":"This was a great choice for breakfast! Though we almost didn't eat here as we didn't reali","useful":0,"cool":0},"QfrPQOPnwoF95kp6e-WKqA":{"text":"This was my friend's and my first visit, but the reservation was made by a very good local","useful":0,"cool":0},"FfO5z-QV-DOtNcuktLKIqw":{"text":"We had an enjoyable meal. Upbeat place. Looks like a good place to work. Food was fresh an","useful":0,"cool":0},"QFTOlhXfxC0mDHD8qKZMIA":{"text":"Great Italian in New Orleans.  Not an easily walkable location from the Quarter but an eas","useful":0,"cool":0},"oyicK8wP40mUjlJDNmnmIQ":{"text":"I waited a few days to write my review because I needed to process how best to explain the","useful":1,"cool":0},"4k55keetLBVpAfHskNPYhA":{"text":"Paladar 511 is such a cute brunch spot that captures the New Orleans vibe perfectly!  \nThe","useful":1,"cool":0},"2VRKk7hwuxWQ05TkNNcQ_Q":{"text":"10/10 Ambiance -- 10/10 food -- 10/10 drinks, would definitely dine here again & next time","useful":0,"cool":0},"-HAO4a6DbY5OM8t-p5SSQg":{"text":"My boyfriend took me here and I was shocked he had found a place I have never heard of. Fi","useful":0,"cool":0},"kd6eHe8xx-o3NoQ5GxZqnQ":{"text":"If you asked me what my favorite restaurant is New Orleans is, Paladar 511 would definitel","useful":1,"cool":1},"kUMMccS9kuZB520fIhXrIg":{"text":"Omg.  What a meal!   We had the carpaccio and oysters (amazing), beet and burrata (so yum)","useful":0,"cool":0},"pw_zhR5qfDfUpzXR_hBQoQ":{"text":"We missed our reservation (which I texted to let them know) and this place used the Resy a","useful":1,"cool":1},"XwG3fmfYo_8oh7YzG_U5JA":{"text":"Ate there last nite for 3rd time.  Place is a home run!  Folks should go there before it g","useful":0,"cool":0},"bfaqfY50j5-aoK5nGy8cAg":{"text":"After going for a run this morning I decided to lower my rating on Paladar 511. I've been ","useful":2,"cool":1},"kyu83izsEKlJ4H6G3vOfoQ":{"text":"This was our first time going to Paladar 511, we went for my wife's birthday.\n\nThey had th","useful":0,"cool":0},"5opMVGwIW2ENWhbvb63ehQ":{"text":"First time reservations here for my husband's birthday.  Every experience we had from our ","useful":0,"cool":0},"SqO05lB4_Ks07TUM9GUriw":{"text":"From the two entrees I've tried, this restaurant is very tasty so please do not let my 1 s","useful":2,"cool":0},"Nh8NOREjucaLEDLgMDD8yA":{"text":"Today I walked in about 1:55, on a casual stroll with a friend who needed to eat we walked","useful":1,"cool":0},"XQDcPh4xS1JtCbC6NChlOQ":{"text":"This is a new place for me, its on the edge of the Marigny in a converted warehouse buildi","useful":1,"cool":2},"-gAktkLrquJZP17-bepx-Q":{"text":"It's a nice space and I found a parking spot relatively easily. Unfortunately, I felt rush","useful":1,"cool":0},"lfQUsEjoLqaBFzQ-aKLwfQ":{"text":"Everything we had here was delicious! The right amount of portion!  The service was great ","useful":4,"cool":1},"ixEdx2OInaSW81t3IInrMA":{"text":"Me and my wife went for the first time today for brunch. We were pleasantly surprised by t","useful":0,"cool":0},"eOb7KHRN29TUQYdEp3EJSw":{"text":"What a great first night dinner stop for our first time in New Orleans.  Got in mid evenin","useful":0,"cool":0},"fxbKJYAZzC3xnnrkF-KtYw":{"text":"@paladar511 is one of the best brunch spots in the city . I've had their infamous breakfas","useful":1,"cool":0},"6p_YM0GCSPbXVilK_oM72A":{"text":"What more can I say, this restaurant was excellent. We stopped by for brunch and were blow","useful":1,"cool":0},"qW1ef-EmLu2pgnnJC_6Q3w":{"text":"This is a hidden gem!  Paladar 511 boasts the feel of a turn-of-the-century industrial bui","useful":0,"cool":0},"g2NXX7-Q9khgtKtozoyC1w":{"text":"Zen Pizzas, - delicious, the mushroom was  to die for. We sat at the bar and watched the k","useful":0,"cool":0},"u45Q0jyBxM1WCtdriHtjkA":{"text":"OMG! So good. Run, don't walk to Paladar 511. \n\nWe met a couple friends tonight for dinner","useful":0,"cool":0},"R-Kk3BR6SF0gCFuMNUp06g":{"text":"Food is good but service is bad to the point of being hostile.  I am handicapped and tried","useful":1,"cool":0},"lnbGA0Bht125lDnyFoVGdQ":{"text":"Exceptional service. During Covid they all wore masks and had mask etiquette written on me","useful":2,"cool":2},"Ny24xpdfAXKlkP8cSmUkYg":{"text":"We loved it here! Stopped in for a walk-in dinner at the bar; we had the burrata appetizer","useful":0,"cool":0},"EodHkd5zyL9JLBoX7L_9XA":{"text":"Upscale Italian for the modern crowd. Situated in an industrial Bywater space, I dined on ","useful":0,"cool":0},"aGzWrbiACrzPO89Z1HxKRQ":{"text":"Really enjoyed this place! We had a grand dinner and will certainly make a return. \nJust a","useful":3,"cool":0},"9fBtD6ODk9nH3mNaAysDsQ":{"text":"We quit enjoyed this restaurant. We went to the restaurant with Group of 20 friends. They ","useful":3,"cool":2},"-Mz3HwvnISFQwUZIAQgpzg":{"text":"Really great food! The parpadelle was the best! The pizza was pretty good too but I could ","useful":0,"cool":0},"q-q45iDbvz75PThaQVWXGg":{"text":"Fresh. Great flavor. Delicious. Very calm and organized open kitchen. Beautiful renovation","useful":2,"cool":0},"e6ThGiEOwrshXwP1vkV4ZQ":{"text":"We went here for my friends birthday and I was a bit skeptical since I'd never heard of it","useful":2,"cool":2},"qsviec6msA9PXzOj2UchGw":{"text":"Fantastic spot, great wine and the food never disappoints. I don't often hit the same plac","useful":0,"cool":0},"NLusKP6ibdYruN0VIRaZLA":{"text":"I am literally obsessed with the meal I had here. I truly cannot stop thinking about it. I","useful":0,"cool":0},"KjEDyQwapTB0bE6lSA7r5Q":{"text":"Fell in love with this place!!!! So refreshing! Will have to make this my go-to restaurant","useful":0,"cool":0},"1KkWV2pYXPLyg4pm3pYi4Q":{"text":"I would rank this in one of my top 10, all time favorite restaurants. Everything our group","useful":0,"cool":0},"evnm4M5ql-XiaIlkEpVVNA":{"text":"Presentation of the Place: Spacious, a great modern vibe. I would recommend for dinner dat","useful":0,"cool":1},"Bx-mosMbAeVYqUDzh48anw":{"text":"I've had Paladar 511 bookmarked for a while and finally went. The food and service were bo","useful":0,"cool":0},"iKORcUGze4MmjYzpUv06IQ":{"text":"This place has the California/New York vibe.  The atmosphere earns a 5 star in my opinion.","useful":0,"cool":0},"TVBlKnRfXy-JsyhDkh_cEw":{"text":"My few favorite! Such an amazing, hip spot in the Marigny! The food was unique and every b","useful":1,"cool":1},"qxuAFq3ApgwlnrYtHATr7A":{"text":"Great restaurant. I got there as it opened on Friday after having been on Frenchman. I was","useful":0,"cool":0},"TrzoXPIPw-UWXON2KxggrQ":{"text":"One of our NOLA favorites. Every meal we have had here has been exceptional.  Supporting t","useful":0,"cool":0},"FeF-Y4MeOHbDvb9M6EWgcA":{"text":"We really liked this place! The ambience was very industrial, artsy, and hip. Try the lamb","useful":2,"cool":3},"mCPFweLFSGfjPSV5f_HC8w":{"text":"My utmost thanks to Paladar 511 and the awesome staff. I have so many things to share but ","useful":2,"cool":2},"bNwczjM_cp93teCDh5z0Bw":{"text":"Paladar is one of my all time favorites for brunch. My go to is the spicy breakfast pizza!","useful":0,"cool":0},"sD1iLCZk85ZIBqND5gXTxQ":{"text":"Highly recommend for a nice pizza and/or pasta dinner! Fancy, but not too overpriced. Real","useful":0,"cool":1},"s-eFaTxlNSt-VncevpldwQ":{"text":"The reviews are True! This spot is worthy of a bookmark for your next dine-in destination.","useful":4,"cool":0},"Ya2xLHowbFJakmvmTpKnHQ":{"text":"Had a celebratory date night here last night and it was just awesome. Super cool industria","useful":1,"cool":1},"V26oDSEfGNbEikUruRVWtQ":{"text":"a true gem, out by the Bywater. Here's to their seared lamb shoulder over labneh w/ eggpla","useful":1,"cool":0},"guy2mpVccG-C0njcGtBr8w":{"text":"Had dinner on Sunday night - beet salad, tuna appetizer, Cobia, and farm raised egg pizza.","useful":0,"cool":0},"6DNvx_kDvFs1CeYIKZ6ASg":{"text":"Beautiful restaurant hidden in the corner of the Marigny neighborhood! No parking lots, bu","useful":4,"cool":3},"ln4rbSCezVY0mqWHqO9C1A":{"text":"The food has an upscale vibe to it, and the dining area has a sophistication, yet the atmo","useful":0,"cool":0},"J9NMQNtqCf_udNojIuSqYg":{"text":"Amazing everything. Might of died during COVID if this place wasn't open and so so delicio","useful":0,"cool":0},"ORo0Ilj6vRjY--nNP0FEVA":{"text":"Was in town for the weekend from Lafayette, La. and since all of the restaurants on French","useful":2,"cool":0},"kny0Lx1OPCv-33hGLw73Lw":{"text":"Paladar 511's food was so good it should change its name to Paladar 5-star! Seriously thou","useful":4,"cool":3},"octTMpqEnNNGvs-fkwOL8g":{"text":"Just found it today and it was magnificent,that's all I can say Tuna cruda and pizza ,prob","useful":0,"cool":0},"8B7HeyelVkcbMrO9kt_Yvg":{"text":"Came here for brunch while on a girls weekend to New Orleans. The decor was cool. The drin","useful":0,"cool":1},"KpP2nDniPNJARra7O8krOg":{"text":"Paladar 511 is one of our favorite brunch spots in the city! They have exceptional brunch ","useful":0,"cool":0},"40YUGiJwcJg8Xs3LuYMTCQ":{"text":"I'm not sure Paladar 511 needs another raving review, but I want to re-live my experience ","useful":3,"cool":0},"3LkqqgdKPzdoL0OIIt15zg":{"text":"I had the braised rabbit, it was perfection......so why 2 stars, Our server Emma is either","useful":0,"cool":0},"9ITxXX8mIa5kj5aOdBP6ww":{"text":"Went on Saturday night and the food was great but, not so much with our server.  She acted","useful":1,"cool":0},"iDaHlpHuarjrxm0ylU5sVA":{"text":"This was a treat of a meal. The peace is beautiful, and open. It is crowded and quite loud","useful":3,"cool":0},"FZaQKf3jyukpZiRcVKqNUQ":{"text":"Amazing experience, visitors from out of state.  Great shareable dishes, impeccable servic","useful":1,"cool":0},"gST2qEQOOxxTNQtDqk5EOA":{"text":"The food at Paladar 511 is delicious! I have been twice for brunch and it was excellent bo","useful":1,"cool":0},"oopdEOAwZ7Mqi0R2aFWg3w":{"text":"Didn't even get a chance to try the food. Party of 2, 9pm on a Saturday night, waited at t","useful":1,"cool":0},"OtThRJjR76yB_5rjntsiJw":{"text":"Amazing meal!! I was so impressed with each dish we got here - the salad and cavatelli to ","useful":2,"cool":2},"JBlgmO81wkyyhkLdtAtKTw":{"text":"Loved this place. Hip but not pretentious. Came on Friday night without a reservation. We ","useful":1,"cool":1},"yU6tqvH-iOzDbYhsNZq6HA":{"text":"I sent this in a Facebook message a few weeks ago but never heard back to hoping it's seen","useful":0,"cool":0},"RHa-7NYTSSc7cX8pRkze0Q":{"text":"I can't even believe that it took me so long to finally discover the deliciousness of Pala","useful":8,"cool":6},"Fujsss1WNQbYBFHNQWmHvA":{"text":"Paladar 511 is a neighborhood favorite of many folks I know in the Marigny. We wandered in","useful":3,"cool":2},"BJWjniLOE9B3mAWeEywvvQ":{"text":"I highly recommend Paladar 511 for anyone traveling to New Orleans. My friends and I start","useful":0,"cool":1},"H3--mjxwAfvu7CyrZJUHVw":{"text":"4/5 solid dinner and a show\n\nit helps to have a reservation, if not hope that there's spac","useful":7,"cool":2},"_wAhYG1-Ge-BuRmI5RE7Bw":{"text":"We've been there 3 times now.  Dinner and brunch. Always the same experience.  Excellent f","useful":0,"cool":0},"Yn4izzYwDhlCzMm7vJCVpg":{"text":"Such a wonderful surprise to find this place...and how did we miss it until now!!!\n\nFive o","useful":1,"cool":0},"iBLVoKqGbCGLFmygaPXv3Q":{"text":"If you have the chance, eat here! We had the seared snapper and margarita pizza, so delici","useful":0,"cool":0},"bbLjTfqdXQMyvinPQ8Msmg":{"text":"We went for Mother's Day brunch. We had the spicey cocktails to start and a Pima cup. Both","useful":0,"cool":0},"7Ll13Sivr4rMR8_zmGbjIw":{"text":"The staff was so friendly and the food was great! I highly recommend the blueberry pie!! T","useful":0,"cool":0},"N5XEN4FJyzIQeNP9EQqdoQ":{"text":"Delicious foods. Every meal better than next. Good to share so you can experience differen","useful":0,"cool":0},"KIYDfHw-qbjCgtK2UVm8ow":{"text":"Great atmosphere, though a bit noisy. Servers very nice and attentive. Food was excellent ","useful":0,"cool":0},"poaY7UTRJwkGppoEy8DesA":{"text":"CAN NOT say more positive things about this place! I had a lovely Anniversary Dinner here ","useful":2,"cool":1},"-U3BFMS9a8_N-IcoPzqtTA":{"text":"I'm a complete failure for waiting so long to type up a review as well as not having taken","useful":3,"cool":2},"aBXgIe-waF1xNj-qz0ISnw":{"text":"We went for the first time for Valentines Day.  Was very impressed!  The arancini ball was","useful":0,"cool":0},"wgpA-Vd90orLOonxsq0rxw":{"text":"Came in with a friend for brunch, and the service was amazing, super attentive. We ordered","useful":2,"cool":1},"rT1eaNkLdUh8O_rxbyeexQ":{"text":"Been here twice for dinner and loved it both times. Great entrees, pizza, pasta and desser","useful":0,"cool":0},"VDPYqP3q2vP1EkJ49xxtkg":{"text":"The walk from our hotel was worth it! Wonderful service. Delicious food. Lgbt friendly! Th","useful":0,"cool":0},"7trbfXRKyN1A28fMfJJ7Qw":{"text":"Finally made my way out of my usual haunts to try a new restaurant! We couldn't get reserv","useful":4,"cool":1},"USbsB_Fv-6ja6F7zKKCSlg":{"text":"I love Paladar's ambiance and the decor/wood they have. I also love that you can see the k","useful":0,"cool":0},"gHCOaVRkrREl8Oi4yajmjQ":{"text":"OMG.  So we were told by the owner of Pepps bar that this was one of the best restaurants ","useful":1,"cool":0},"8QA9BXHS5UgvepP7aa-z_w":{"text":"Some of the best food I've eaten out in a while!!! All four of us were so very happy with ","useful":0,"cool":0},"qswebnGxHf9cqocokJJeEw":{"text":"Went here for dinner and everything was exceptional. The interior of the restaurant was go","useful":0,"cool":0},"tb8VuhwV-sJH2Bk81nWlVA":{"text":"Fabulous food, service and setting! Delicious crunchy brownie for dessert! Highly recommen","useful":0,"cool":0},"8mGkG_5aRsG9_RQ3sCrX9g":{"text":"My favorite restaurant in the city! The food never disappoints, such great variety, and th","useful":0,"cool":0},"Xzrz2c7pcJM3XCmNz8wyZw":{"text":"I LOVED THE FOOD HERE!! If I lived in New Orleans my husband and I would make this our fav","useful":0,"cool":0},"VBRxRZAW6ndMCCpwqgcO1Q":{"text":"I really like the food here first off, lots of small plates and the pizzas are always inte","useful":1,"cool":0},"OhFBZFy3ff04HKvwTiesKA":{"text":"This place is pretty awesome. The customer service and food is on point! I had the eggs be","useful":0,"cool":0},"Y8IlgoxxQuITb0B-y3YP2g":{"text":"Excellent experience. Sat at the bar and loved watching the kitchen's great teamwork. Ever","useful":0,"cool":0},"plAK-OuQMGT03a091Kbhrw":{"text":"Beautiful experience, great food. The potatoes were a little well done however it was my b","useful":0,"cool":0},"JdKGpGittzEFtNp4iJZfJg":{"text":"We had heard great things about this new restaurant and it did not disappoint. The room ha","useful":1,"cool":0},"XBbkcAjGeMT2uKTs73Abnw":{"text":"My not having reviewed this place is silly seeing as I go so often. It's a beautiful space","useful":2,"cool":0},"_flRu6CF2EmF0xFk62-8xw":{"text":"Fantastic service. Everything we tried was phenomenal. Curried carrots, the rabbit and gno","useful":0,"cool":0},"ynB0k1osjr2FW1fPS_rmuA":{"text":"Wow. Everything I ate was amazing. Was with a large group for a Bachelorette Party/Dinner.","useful":0,"cool":0},"dnwETJq7dY8K7wG8WSxaFQ":{"text":"Amazing ambiance, great music, friendly staff, phenomenal food. Loved the atmosphere.","useful":1,"cool":0},"NfVk6H-aNZ2CWjQ7K8HSEg":{"text":"Ended up here after a different restaurant we wanted to try off Frenchmen happened to be c","useful":1,"cool":1},"tptWgUYn4oamrh5x5Z7wfA":{"text":"Extremely bad customer service. The owner seems to be responsible for this culture. Sad to","useful":2,"cool":0},"1jtEU1cXnrQFHKSxOh_8kA":{"text":"Great brunch spot for a group of friends (and yes they take reservations!)  It's a small m","useful":1,"cool":1},"8XgaFLSo7GMRdW42GVluDw":{"text":"The menu offers food that is truly one of a kind! We ordered a couple of fun appetizers, a","useful":0,"cool":0},"AMtF14xkFdXX2uan9kUb6A":{"text":"Checked this place out for dinner with a group of 7 and it was a great experience for sure","useful":1,"cool":1},"Q9f66wEMLwjp0A-hqilyAg":{"text":"My boyfriend and I ate here for New Years and it was amazing. The booths are separated by ","useful":1,"cool":0},"9eQYlVC_OzzdoMMKRUEUbQ":{"text":"I had a phenomenal experience, the ingredients are fresh, creative and the service is outs","useful":0,"cool":0},"5kHl06LMPSa2HWVdrM31eg":{"text":"This place is walking distance from Royal Street, it's a hidden gem for sure.  The restaur","useful":2,"cool":0},"bRhB8YsoYyzuK6skUf6khw":{"text":"Pretty space, great drinks. I've found the food hit or miss. Pizza is reliable. On my last","useful":0,"cool":0},"BswonGir8GrOnq_DWlhV2w":{"text":"I don't know how I haven't reviewed Paladar yet! So happy it is back open post-Covid. Ther","useful":3,"cool":2},"p3iIUg4s38q2qhTyc5sLqQ":{"text":"One of the best restaurants I've been to! Everything was amazing! We ended up going two ni","useful":0,"cool":0},"QoIYAifslFEPdPJDD2g5YA":{"text":"During the pandemic I've been trying to spread my spending around, so I finally got around","useful":1,"cool":0},"uSORD1_WbIAfY5tpM4jKUQ":{"text":"First time at Paladar 511 and it was amazing! Hip vibe, knowledgeable staff, great cocktai","useful":0,"cool":0},"mALn3kvrNTzsPIf-fLACFg":{"text":"Everything about this place was perfect. My brother and I ate there last night. Tuna crudo","useful":1,"cool":0},"GRnrjDolzlj2WE5cZgfamQ":{"text":"Make your reservation right NOW!!! From the moment you walk in the ambience is on point. T","useful":2,"cool":2},"dKlQfuNmgpwOoDQKBzkIGg":{"text":"Brunch review! \nI headed over to Paladar with my friends on a rainy Sunday midday. We had ","useful":7,"cool":4},"EbefRr4ty1VqvtYOrchk5A":{"text":"Oh my gosh, Paladar lives up to the hype and more! I had been wanting to try Paladar for a","useful":11,"cool":6},"qeMDNGR8TkRo56FD5YheDg":{"text":"Our entire experience dining at Paladar 511 was perfect. Loved the vibe there, our server ","useful":0,"cool":0},"CbC6JpyvgA1Wjfya2vy_8w":{"text":"Love this place.  Atmosphere was amazing, service was spot on and the food spectacular.  W","useful":0,"cool":0},"7i_0fbP-GwcElypyIRKLFg":{"text":"Everything about this place was perfect. Food beyond belief, great vibes, awesome atmosphe","useful":0,"cool":0},"kgLNTMcMHCp0edGgD8vxqw":{"text":"Had brunch here this morning and it was delicious. I also like the set up of this restaura","useful":2,"cool":2},"5i93c_nwSNvVwW_5qew7RQ":{"text":"I would give a -10 review if I could. Do not come here!!! The wait staff is so RUDE! Worst","useful":2,"cool":0},"Qu8J7tzEbFKU1yoDbrVl1w":{"text":"Paladar 511 definitely exceeded my expectations. \n\nWent on a Wednesday night around 7:45 p","useful":1,"cool":0},"yqXqcjQ0JhruvjI4--IYdQ":{"text":"I've had Paladar bookmarked for months and decided that the end of the mask mandate was th","useful":12,"cool":13},"sUNnfFmc5go22A0LTJyGAQ":{"text":"Ok, so I have to start this review by saying that the food we received was great.\n\nThe rea","useful":0,"cool":0},"f3zJ070s3V2K6u0ll0t73Q":{"text":"Looking for a nice date spot, I found this place and decided to try! The atmosphere is fan","useful":0,"cool":0},"51UXjPIkmJVfvEFhyWU8Cg":{"text":"2nd visit to Paladar 511 for New Years Eve and was just as impressed as my first visit. Gr","useful":1,"cool":0},"CcIkiRIWtPxyHYkBLY4uAA":{"text":"Went in again recently(the oyster/beef dish is fire) and I'm still so appalled they never ","useful":2,"cool":0},"5NJ0L6XnWDnpRmuiRdQPOw":{"text":"Short rib meatball, ravioli, and the lamb pizza were magnificent. Great atmosphere and fri","useful":0,"cool":1},"XspyKZq110wxBGogtO3pEA":{"text":"Oh. My. \n\nYes. This place is that good. A little off the beaten path of the French Quarter","useful":1,"cool":0},"p3JT0aPhmvz7KRQt4O4JgQ":{"text":"Everything we tried was so delicious !  Everything! Squid ink spaghetti, Arancini, cavatel","useful":0,"cool":0},"g6DD6TuWgrt2d8Y03OBq8Q":{"text":"Brunch at Paladar 511 is a must-try! Two weekends ago, my family ventured into the Marigny","useful":0,"cool":0},"VR4R3nj2b9aQ_P8b4euycA":{"text":"Honestly, I can't imagine how this place could be better. The food was incredible! Get ton","useful":0,"cool":0},"U8caYaO7bDhrnzuBX-p7Zw":{"text":"After being told to try you, we finally did, and we had MANY things off your menu.  \n\nEnsa","useful":0,"cool":0}}