{"_5CeDAkukq_pQv-MbqX7Jw":{"text":"Most of New Orleans Yelp is a matter of way too many reviews for everything. Not so here. ","useful":5,"cool":1},"B5gcP6ICSAeMEvH7wYyHAg":{"text":"I don't think a trip to New Orleans is complete without stopping in here. This was absolut","useful":5,"cool":2},"QkK0aggKWO-JYnYiB3UHTg":{"text":"Used their location just to find the directions to the lower ninth. Was pleasantly surpris","useful":2,"cool":1},"_srbqBkbCWq_2cZJpCZ-VA":{"text":"This place should be a required stop for tourists to see the other side of New Orleans's r","useful":6,"cool":3},"b5XY5grBS71J2AXyOXr2NQ":{"text":"If you watched the Katrina disaster from afar as we did, you have a feeling that you're mi","useful":7,"cool":2},"EUGSNcs3g7wROzi5S9JQkA":{"text":"The Lower 9th Ward Living Museum covers the history of the 9th Ward as well as current cha","useful":5,"cool":3},"59i1HCYHJPHcJITpwHjQGw":{"text":"Really well organized. A must visit if you are interested in current social event history.","useful":4,"cool":1},"l9uoUL6x_UGdAgFwoHF4Cw":{"text":"Deeply moving. A testimony of what really happened after Katrina and a beautiful sharing o","useful":3,"cool":1},"IRpQS_1LKHbdqYpIb2-ppg":{"text":"This museum was great! Highly recommend it for anyone coming through New Orleans. Tells a ","useful":1,"cool":0},"CsULDwiSsbZxarhUL9tNTA":{"text":"We probably wouldn't have found this place without yelp. Small but very worth the visit. R","useful":4,"cool":0},"C-C5dTYzH6Bf_JrZVkm7hQ":{"text":"My wife and I visited this museum not knowing what to expect/feel.  After an hour and a ha","useful":10,"cool":2},"tRTMG0l2hZSgHkjUF4pYGQ":{"text":"Visiting the Lower 9th Ward Living Museum was such a valuable experience. A must see. As a","useful":4,"cool":2},"8yqE-PDU58E86dOCGNw64w":{"text":"Visited over MLK weekend.  Stayed in the Bywater district, wow a bridge can make a huge di","useful":9,"cool":3},"qpT0pWvGgxFhMZ5AR-Uhzw":{"text":"This is my 2nd time in NOLA. The last trip, I did Bourbon Street and Garden District. Fun,","useful":4,"cool":1},"FYyWJXggYKsc7rIn7pfl3A":{"text":"Small but moving.   A real experience off the main tourist road.   Just a short 15 minute ","useful":2,"cool":1},"raa3AtWwjqSUoigpiTRCzg":{"text":"This place will leave a mark on my heart forever! It sits in a neighborhood in the lower 9","useful":4,"cool":3},"O2RKQu-Uw0xZRSFWLQH2dg":{"text":"An amazing community museum that is telling a story that we all must hear.  My 13-year-old","useful":5,"cool":3},"-tRv8iOUxWNET1whoLKJFQ":{"text":"I came here with a couple friends. This is definitely a place to visit when you are in New","useful":2,"cool":0},"GaqYn3vHWVS1DxXSH6ZQFw":{"text":"Heartbreaking, elucidating and absolutely brilliant. Bless this community and these folks ","useful":2,"cool":0},"pJrxpiCVRjR_WhXGeq1BkQ":{"text":"It is a shame what happened in the Lower Ninth during Katrina. You take a population that ","useful":24,"cool":16},"CG8uw525gAnKjqpDZWUhiQ":{"text":"Powerful exhibit run by some truly extraordinary locals. Puts some authentic perspective o","useful":1,"cool":0},"O9PSh5OEaHLfDFNBkSAcYg":{"text":"A must for visiting New Orleans. The history they highlight is simply astounding. Even if ","useful":2,"cool":1},"W6TScr4ZZU5BKx2I1yu3jA":{"text":"A must visit place when traveling to New Orleans. \nI thoroughly  enjoyed my visit there, i","useful":2,"cool":0},"vzL7IHhUVa05LVtvczC3rg":{"text":"This place is absolutely a must see! This museum may be small, but it is mighty. If you wa","useful":1,"cool":0},"QxHOcJG3ozuldwg8Z9mL7w":{"text":"I was expecting a museum, not a house...initially we thought our Uber driver was lost. But","useful":5,"cool":0},"a7jWXut-UOqzlZ68ap-Z2A":{"text":"I appreciate the beauty of this place and the truths they display for the before and after","useful":5,"cool":0},"F9mPK3YqiYRqnXmAt0SQ7g":{"text":"Small, neighborhood museum of the Lower Ninth Ward. Warm and friendly with informative exh","useful":2,"cool":1},"sUt4dh_yLWnI1Qf0Igel8A":{"text":"A must-stop for anyone visiting New Orleans. It's definitely off the beaten path (we took ","useful":4,"cool":2},"KYETCGIT3P6pb3IR_9wHUQ":{"text":"This museum may not look like much from the outside, but it is full to bursting with impor","useful":1,"cool":0},"53hs7LGflpnxXZGuA8YmAQ":{"text":"A must see. You get true insight as to what life is like in the lower ninth ward. There is","useful":1,"cool":0},"6lLh4bXZLkTCLR947oOdzw":{"text":"A must see for locals and visitors alike. After looking at priceless photos, hearing local","useful":3,"cool":0},"whwrPYCekfxY9WuyoqzK1g":{"text":"The Lower Ninth Ward poses a conundrum. Its historic significance is obvious, and the deva","useful":5,"cool":2},"0Zslo-bqcU6dszp4zuRyRw":{"text":"Worth the Lyft ride from downtown and then some.  So much history & information.  I learne","useful":1,"cool":1},"pZSLgjUf5vi1dFT-ClyAMg":{"text":"Amazing Living History Museum for sure! Right in the heart of the Lower 9th Ward.  Graciou","useful":1,"cool":0},"ROGwG6RLgphaL2nPkSo2mg":{"text":"A well-crafted, powerful exhibit; a must for anyone who wants a more complete historical p","useful":1,"cool":0},"8c_Hqddo-KtRF6NLWE-BVg":{"text":"This was by far my favorite experience in New Orleans and I did A LOT!  3 plantations, swa","useful":3,"cool":1},"0RCo2-xXTEA89MSytAcLWA":{"text":"Because I've never really been able to see what exactly there has been done to not only ho","useful":19,"cool":8}}