{"sFQiK4DGoIrf9LLB4R3n5Q":{"text":"Dr Clisham is a great doctor !!!! I am so blessed to have a doctor like him ! I dont know ","useful":0,"cool":0},"q2wAyZOVXSbmFuHZwl4TLw":{"text":"Amazing clinic! I'm pregnant!! It was a great experience coming here, I will miss everyone","useful":2,"cool":1},"qhsOlXoB9xZlEVhJFJO0nw":{"text":"Ok ok... so thank God some people are honest. We did get over $3000 back after all things ","useful":0,"cool":0},"P9xs6TPRlt-Fcs661-gKEg":{"text":"I don't know about the reviewer above, but I had no issue of kindness of staff, rescheduli","useful":2,"cool":0},"W6CKNgoYjJe7A-k22w0stQ":{"text":"This clinic was so wonderful to my husband and I as we went through our fertility treatmen","useful":0,"cool":1},"okMD9hqH6lmRN845TcjpfQ":{"text":"I love this place. I work for a doctors office and just would like people to understand th","useful":2,"cool":1},"DrLTOdIvlFyMihkbtDBHSA":{"text":"Only losing a star due to the funky separation between Audubon and Vivere. The billing is ","useful":1,"cool":0},"InBnhjmeiK4uwPdqPa0dqg":{"text":"This place is a TOTAL NIGHTMARE. NEVER go here.  They are completely unable to return a ph","useful":10,"cool":0},"bVuFIq3G1JYCbMnISiykkw":{"text":"Originally went here for a basic test which turned into several.  The nurses at this clini","useful":1,"cool":0},"gWLL12FabzTmHIBFKyHgBQ":{"text":"Very happy with Dr Wells and the people at Audubon. Very friendly and attentive. We haven'","useful":1,"cool":0},"OOQLCX7FdWPCL-aO7ano8A":{"text":"So I was hoping to be able to write this review after getting a BPF... but anywho. Here we","useful":3,"cool":2},"GKPjDsstlGto2Pb_IKZmWQ":{"text":"Unfortuately I completely agree with C.H.  The staff is horrific with the exception of Kim","useful":4,"cool":0},"ITDt-FFPpg7RlTqnFg0FrA":{"text":"It is hard to believe anyone could have a bad experience here. Dr. Clisham and all the sta","useful":6,"cool":0},"BrMQ9KJqHwzwAW3DLkqmUg":{"text":"I am a physician myself and I am totally appalled by the experience we had. We only saw th","useful":2,"cool":0},"WFCEQEP3SArNclbSkl9LTA":{"text":"It is hard to believe anyone could have a bad experience here. Dr. Clisham and all the sta","useful":0,"cool":0},"alCx11UdAmz2g8fgXfTHSg":{"text":"The fertility process for us was daunting as a same-sex couple but Audubon Fertility made ","useful":1,"cool":0}}