{"1JWT5ztzHscUP6BxImAFRw":{"text":"I wanted to like this food, but cannot report that. Do not order the Kevin sandwich, so aw","useful":0,"cool":0},"_DQqC1qB5b028GlawLtukQ":{"text":"Walked in here not knowing what to expect and am totally blown away! Had the TASTE sandwic","useful":2,"cool":2},"TcrbjiZkIEFtWEG_e0gfIA":{"text":"This was the best sandwich I've ever had. The staff was beyond helpful and friendly. The s","useful":0,"cool":0},"pPuQDTyFAJLbdgt2JTs_eA":{"text":"Thank you Yelp. I was visiting town, needed lunch, and headed here because it was nearby. ","useful":0,"cool":0},"u-Q-fcCxzoQRWxHiWy8AbA":{"text":"Went to Part & Parcel for my girlfriend's birthday because she wanted to go somewhere we'd","useful":1,"cool":0},"8jiuEkt5jejUwFuDdF3x2Q":{"text":"Casual, counter service, cozy. Good option for lunch in the downtown/CBD area. I got the c","useful":1,"cool":1},"GC7ziM7j0hsonXbm319zTQ":{"text":"Ordered online and it seemed to have been 'delayed'. But that was ok.  The prices in gener","useful":0,"cool":0},"LD7z5hqxoOtjByvxmK95vA":{"text":"My wife and I enjoy trying new places and we were excited to try this restaurant based on ","useful":0,"cool":0},"ZmWUp4ZwLMQkQIiyxVSJhQ":{"text":"Delicious. Period. Happy to find new places in the area. Try the TASTE. It's amazing.","useful":0,"cool":0},"hiKzauqZ3BSnsnWxHbPhrw":{"text":"Absolutely delicious sandwiches!!! I didn't know a sandwich could taste so good. Very juic","useful":0,"cool":0},"DkLamUF9cB0Nx763oft--Q":{"text":"i've only been once, so far, so hopefully this is not premature. I just had the TASTE sand","useful":0,"cool":0},"tI76nHvLvDOcS3AMUJCpvg":{"text":"Super happy the place wasn't very busy. The service was great and very friendly. If you ma","useful":0,"cool":0},"yKOTM2Fq1hCyka5K4TKE0Q":{"text":"I only ordered the Italian Vegetable Stew to go, albeit it is very flavorful; however the ","useful":0,"cool":0},"cd6ou_uK0WTuxzUQTuj-pw":{"text":"The TASTE turkey sandwich is amazing!  That fried turkey is one of the best things I've ha","useful":0,"cool":1},"rZpNDCshH4YsRnu3ZxUP3A":{"text":"Overpriced and bloated sandwiches which felt\nlike all filler. I do wish there were better ","useful":0,"cool":0},"4d8UKpQOqZTk4QS-xwnP3A":{"text":"Really really good food and fresh. For this type of speed you would not necessarily expect","useful":0,"cool":0},"vTcnzkwJMIRI7E-VBOX86A":{"text":"Honestly give Part & Parcel 3.5/5 stars.\n\nT.A.S.T.E 13$; fried turkey, avocado, greens' sp","useful":2,"cool":0},"GBWj-2aXy60w4kUhJWjh8A":{"text":"Stopped by to grab a Godfather sandwich. I must admit that the sandwich was very very flav","useful":0,"cool":0},"o8CXA__XXbmWPyS1_JBM9Q":{"text":"I crave the food from P&P. They have a nice sized breads- toasty and supple .....and the j","useful":0,"cool":0},"rCTWOB-yhU4R4-WraF97yA":{"text":"I was only there for HH and not hungry enough to try the TASTE, which is most definitely w","useful":2,"cool":2},"PFN7xlQYq9wVqfPmrF8r4A":{"text":"Thought the food was amazing..I had The Godfather and the Corleone was great too..it's not","useful":1,"cool":0},"I6tG5osCNRY1_jxyfg4vbA":{"text":"Pleasant atmosphere, friendly staff. The Angelina is absolutely delicious. A nice hot meal","useful":0,"cool":0},"pDhDh6G8otUVLFLYsCPxig":{"text":"Stopped by to grab a Godfather sandwich. I must admit that the sandwich was very very flav","useful":0,"cool":0},"Yv61QA_9bv0xfiuz5NRCcw":{"text":"I have been here twice in the last couple of weeks. Stopped in the first time with a frien","useful":2,"cool":1},"CoqMZ2c4FTTbYlekP_loQw":{"text":"Tried this place for lunch, walked in when absolutely nobody was there except 1 person ord","useful":0,"cool":0},"VB-S5CZQyGoT022QYyXh6Q":{"text":"I've been SO pumped for this place to open and finally checked it out before the Saints ga","useful":0,"cool":0},"5q_qma8alUSI1q4AAoImaA":{"text":"Ive had many muffulettas in my life- from grocery store versions that barely meet the defi","useful":2,"cool":1},"UE1deQhwO_t1paUPfsrIdw":{"text":"First, I have to say that the food is delicious. I had the T.A.S.T.E. and my husband had t","useful":0,"cool":0},"PZZE34dIpr3TdxehBkdnjw":{"text":"Happy hour is so good. The bartender is my fav in the city, she works so hard and makes ex","useful":1,"cool":1},"nWnubrK5YQz2-Doi4RMpTw":{"text":"Great food.  Everything we had was amazing.  Bruschetta was especially wonderful.   \n\nMeat","useful":0,"cool":0},"nOXjRMZ36o5C-lAbIyqNeQ":{"text":"Awesome addition to \"lunch row\" in CBD! We went with a group of 5, you walk up to order an","useful":1,"cool":1},"BIMjwSS-nWXx4uM1TJnGtA":{"text":"Came here with a coworker for lunch.  We got the Angeline.  It was piping hot and deliciou","useful":0,"cool":0},"H4LoQ5KLUYU1TFEoyJCMvg":{"text":"We wanted to eat before our concert for NKOTB so we stop here to try out. Our bartender/wa","useful":1,"cool":1},"oc1znww0xbgt5Zg86fgXvA":{"text":"So underwhelming. I ordered a salad and I could have easily mistaken it for a dumped out b","useful":0,"cool":0},"Os4Q_Bi_8xRHWeeNQUdV9w":{"text":"Yet another option in SoMaNoLa. Only got to try the Tommy D, and it was very good, althoug","useful":1,"cool":1},"U1gR82PlCAk0_KUoB8zz9A":{"text":"My wife and I went to Part and Parcell last night for dinner. Located in the South Market ","useful":0,"cool":0},"2iafFsgIcU18bPH3TcMkSQ":{"text":"Delicious fresh sandwich's. This was on our list and we finally tried it. People are sayin","useful":1,"cool":1},"u64jezjY2Wu-Z0TZFITSSQ":{"text":"Another great addition to the up and coming South Market district (SoMa) area popped up th","useful":2,"cool":1},"BkJlR00zZ36jVw2jrJ1ggw":{"text":"Loved my first experience at Part & Parcel! After perusing the menu for a few minutes the ","useful":3,"cool":1},"Qleox1pwRLVH3vYUK1ObVg":{"text":"Before I get into it, this is just a review of my sandwich since I ordered thru Uber Eats ","useful":1,"cool":0},"tQCLpNSyO0kyHsWGO0EIKg":{"text":"NEW ORLEANS' MOST OVER-PRICED SANDWICHES.\nSince the majority of the sandwiches at murky Pa","useful":4,"cool":1},"xlrBSkOnBrveu_vZp40-UQ":{"text":"Awesome sandwiches!  If you are working at the dome or arena and want a good place to walk","useful":0,"cool":0}}