{"pKIhzUafLPAnz4cizdb42Q":{"text":"I do not like to write bad reviews but this place was disappointing.  We celebrated a bach","useful":0,"cool":0},"G3Gz6nJN6bMcCGJ1yj5IRA":{"text":"This place was recommended to us by a local of all people, so we were surprised at what a ","useful":0,"cool":0},"8tj4v3awghjGOxSRrlqhvg":{"text":"10/10 would recommend. I had the blackened fish and grits and crawfish platter and all was","useful":0,"cool":0},"m-4H_2EN8cuZPjSMkqkyMw":{"text":"The bar is swanky unlike any other bar on the strip. When we came in there was a party of ","useful":0,"cool":0},"6kPSsL8y7GuBHb10_w4SuA":{"text":"This place was deelish. We had the chargrilled oysters and red beans and rice were out of ","useful":0,"cool":0},"fB9YkcQyeZuIJ4XMBIxXsg":{"text":"The food was amazing! No complaints on any of the food, only praise. The service was not e","useful":0,"cool":0},"7HsPeeezWKWKx6kqUHzJjg":{"text":"So I was not impressed at all. I loved the decor of the bar but that's about it. I got 4 d","useful":2,"cool":1},"DSouxJdWGLOjrTjsAYgOLQ":{"text":"Awesome bar and restaurant on bourbon street. Great drinks. Awesome crawfish.\nIf you want ","useful":0,"cool":0},"Ge5PceYQ07v_SbyPjzRrTw":{"text":"Solo trip to NOLA! Stop here my second night in town due to powerful lightening storm that","useful":0,"cool":0},"vWCFvDJdpO6Rbt_FtdC4yQ":{"text":"The food and drinks were amazing. We had the crawfish boil and shrimp po boy. No complaint","useful":0,"cool":0},"Oho8rzD5-b5X6qYRDeSbEg":{"text":"I've been here before and it was good; this time it was even better! Our server David was ","useful":0,"cool":0},"IvJdrsEff9KGMUYMzGqcOQ":{"text":"More for the fans than the food, husband said crawfish pie was great, my jambalaya was jus","useful":0,"cool":0},"DDgqWhtnwMfHM4S1cNQQmg":{"text":"DAVID is amazing! He gives great advice in the menu and the area! Food was perfection! Lov","useful":0,"cool":0},"dSjXkrM_40F8WT3Es6Jf8Q":{"text":"My boyfriend and I were so happy to find this place because they seem to be the only place","useful":0,"cool":0},"hI54SuJrMZj3JhmOaP3PcA":{"text":"Not great.\nLooks cheaply done.\nThe bathroom doors are falling off the rollers they are on.","useful":1,"cool":1},"mTGZd65dKtKrkIvPfGdGEw":{"text":"Came here a couple days ago with my brother and the both of us had a wonderful experience.","useful":0,"cool":0},"-JdiJH51xF6ld-tMAk1LwA":{"text":"I booked the restaurant ahead of time because I am meeting up with my sister whom I have n","useful":0,"cool":0},"mHqB0gozDPbQZZz-STVNuw":{"text":"Good place for a team dinner.  Prices are reasonable and the food quality is great!  Try a","useful":1,"cool":0},"1P_1B-O2iuoTAFE0JvIGKQ":{"text":"My girl kami is top notch waitress in Nola. Food was great and service is even better! If ","useful":0,"cool":0},"RvZbaCxjhak7tkOQw4SYCQ":{"text":"Great atmosphere and awesome food.  The crawfish pie is delicious!!!! Servers are very att","useful":0,"cool":0},"8g3pIjkLucNv9iCV_D8CHA":{"text":"Terrence and David are what kept us here all afternoon. Seriously - the best entertainment","useful":0,"cool":0},"PM575LRz9pUpF7QE9ewjJw":{"text":"Rating is based purely on customer service as we didn't get to experience anything else (s","useful":0,"cool":0},"BkY2z7ibAb6G6RA7w_6JSQ":{"text":"Came in for a nice bachelor party meal. It took 2 hours and 40 minutes for our last plate ","useful":2,"cool":0},"jMdVedik8y5pbtyhq0wOyw":{"text":"This place was amazing!!! We sat at the bar, and the bartender was very helpful. We got th","useful":0,"cool":0},"GSbn3d_RX0d4OOCjpTQyng":{"text":"We enjoyed our night immensely!!!! We were treated to special treatment for our parade vie","useful":1,"cool":1},"gYwK-tiUxMTPkBvFvI3Ruw":{"text":"Garbage!!!!!\n\nIf you don't know the owners!!!\n\nDon't come here!!! \n\nIt's so rude it's craz","useful":3,"cool":0},"-_jJ3uDOPzJxyet4Jt7eng":{"text":"3.5 stars for your place, Mr. Channing Tatum!\n\nWe came here for one thing: crawfish boil. ","useful":0,"cool":0},"KsCHpqT-xl5a6PT0-bmiEA":{"text":"This place sits back slightly with the courtyard eating area in the front so unless you kn","useful":0,"cool":0},"HpDfxlEEuW-vLJJTJLdKRQ":{"text":"The service in the beginning wasn't that great, but they quickly made up for it. Food is a","useful":0,"cool":0},"rIF8c8pehCYw_0s9seM8rA":{"text":"Thumbs up to my crew on Monday night,  the 16th. You all were working as a team, busting y","useful":0,"cool":0},"plEuPx-FtBLdMtq3_d_xeA":{"text":"We came here after I observed the boiled crawfish sign on the street. I split this dish wi","useful":0,"cool":0},"KtC7YFM1mC8FXepMtj0tBw":{"text":"Very poor service. We were there 40 minutes. We got a menu and beer. Ready to order and ge","useful":2,"cool":0},"mUyi-wthslis6KiUF5LuWA":{"text":"Channing Tatum was not there lol.\n\nWe stopped in for dinner with no reservations and they ","useful":0,"cool":0},"OP0TIr6chKGeU9OO0xojRw":{"text":"I came out here for my friend's bachelorette weekend and we invested in bottle service. TH","useful":0,"cool":0},"OspmLZEhVxV2qRfrZ7Z7fQ":{"text":"In town for work and got some crawfish, good bang for your buck!! Great atmosphere good fo","useful":0,"cool":0},"k5mqfcmxMdgZNlBzEzWyfw":{"text":"Soooo good! Try the crawfish pie! Amazing!!! Our servers were awesome! Manny and Lindsey w","useful":0,"cool":0},"n_-f_4FrHtPKkvOf_t5JKA":{"text":"My friends and I discovered this great find yesterday while in New Orleans for the OU game","useful":0,"cool":0},"qmJj1xJz4qBI6OATy8PhLg":{"text":"This place is very nice . Alligator tail was absolutely tasteful. Dave the waiter was very","useful":0,"cool":0},"m9unmpa250r87uspXbhNcg":{"text":"This was ok - it was pretty low key for a Friday night on bourbon street so I should've kn","useful":0,"cool":0},"nR0s3cUASxs8sIkz_6uCWA":{"text":"The cheese kurds pulled us in but this place was such an awesome find on Bourbon St! We ad","useful":0,"cool":0},"59Gq1_j9KBL7aU60Wt6x1g":{"text":"First time in Nola and went to this bar solely because Channing Tatum owns it. \n\nDear Chan","useful":5,"cool":1},"loVrD7sbWBfkT_lhUguotQ":{"text":"We sat on the sidewalk terrace and watched the flotsam and jetsam of bourbon street roll p","useful":0,"cool":0},"C2OWOAx8ksj9A7tl74X-vQ":{"text":"We got seated and menus quickly. Hardly anyone in the place . Waited 15 minutes and never ","useful":1,"cool":0},"usraJAOXrf5qVak5Onbc9g":{"text":"I absolutely love the place. I've been a regular for several months. I saw the place befor","useful":3,"cool":3},"Vber2OXmipjMMVtwWEf9AQ":{"text":"My husband and I are 20-something foodies from California, and we just got back from an in","useful":1,"cool":0},"bc_HTM3x8Jk0bJmig6G8zA":{"text":"We could not resist the lure of boiled crawfish, especially as they are out of season. We ","useful":0,"cool":0},"zO1Kvv13U_cEwREb9vFCWQ":{"text":"This place is an absolute mess. Service was disorganized and terrible. The menu is small a","useful":0,"cool":0},"K1idAVAcgFj6yp7ieFSQ9g":{"text":"Welp I do not even write reviews, but I felt like I had to for this one, I love Channing a","useful":0,"cool":0},"sgUt8td3RNT0p1D6uR34Nw":{"text":"Excuse me, flew all the way here to see Channing but where was he?? Least I can say I've b","useful":0,"cool":0},"M2BhrvQmQFZqaA2t5xt5nw":{"text":"We are only in town a few days and have a busy schedule so we stopped by on a Wednesday ni","useful":1,"cool":0},"ZwdUHrKHdlNFTlchzWEIzA":{"text":"Was tasked with coordinating a bachelor party for nearly 20 people in New Orleans and duri","useful":0,"cool":0},"CEpsFY3ktqtJSNr3Bxperg":{"text":"This place had promise from the street,  good spot for people watching.  We were seated pr","useful":2,"cool":0},"utXSgt9INAggtcBtgjS9lQ":{"text":"3. Oh you want to know why? The DJ Axe is no compliment to clients. All I wanted was pony ","useful":2,"cool":1},"fd48UE8T8LQp6TCYnZf7Wg":{"text":"Utterly disappointing!  If you're coming to New Orleans, don't bother coming here. Channin","useful":0,"cool":0},"7MUadFLtjSSq9KeMAmdiKw":{"text":"Crawfish we're over cooked small... could barely get any meat out without falling apart. M","useful":0,"cool":0},"hDLGEzJy-q3RGU-xblPegg":{"text":"Scott took the time to explain west coasters how to eat crawfish, without judgement.  Over","useful":0,"cool":0},"apKvkHdQhURxKxf5luas1Q":{"text":"Honestly, this place wasn't what I expected it to be. It's very small inside. Although the","useful":0,"cool":0},"K7Cm07lEOzKYUgrqqdWBcA":{"text":"Great service, Eryionne was a sweetheart. Clean. My caesar salad was delicious- dressing w","useful":0,"cool":0},"kIdVZIDg0jjCax82S31aTw":{"text":"The food is excellent. The ambience is great. I will definitely return and will recommend ","useful":0,"cool":0},"-UvfnxIPOqlgMSTAT-B_Tw":{"text":"These guys are amazing!!!! \nWe showed up for a round of free shots \nThey said \" we will do","useful":0,"cool":0},"nqyUwdnFQfBblnx5eMoyWw":{"text":"The crawfish and Mac and cheese here is on point! Staff is extremely friendly and the atmo","useful":0,"cool":0},"w8qFZDK2IrCpaEZf_ZNCRQ":{"text":"Ordered shrimp tacos, tortillas were cold and overall the flavor was not so great...   the","useful":0,"cool":0},"HcdwK79p-sM57RqxUTLchQ":{"text":"I had never been to S&S before the Yelp event last week, mostly because I don't spend a wh","useful":3,"cool":3},"xBCVsT5vAqDQFT3r8Hf63A":{"text":"Wow is all I have to say! I had the crawfish platter, it was amazing it was pretty spicy b","useful":0,"cool":0},"BmPCVw8XndWR6RRwnlEJFQ":{"text":"The ambiance is very interesting and different, which i think makes it fun! This alone set","useful":0,"cool":0},"hMjV7yx0Fv0zkQamvLieVQ":{"text":"Took a couple days off and went to play in New Orleans.  \nCame across Saints and Sinners. ","useful":0,"cool":0},"OQ44OlUP7wQrOEIbGpyCZg":{"text":"I came to this bar on a Saturday night and it was busy but not too crazy Had a great time.","useful":0,"cool":0},"254_55CTVTH7Nk2JeR2e2g":{"text":"We went to this place only because Channing Tatum owns it. We had horrible service. I've n","useful":1,"cool":0},"KXyPrXmzuGHjhp-ZpI1h4w":{"text":"Five Stars for this one very important fact:\n\nWhen crawfish were out of season they had th","useful":0,"cool":0},"yxyxjVC4mwxbw5KGzXcudQ":{"text":"While it was hotter than Hades armpit in here... The staff was top notch. We came with a b","useful":0,"cool":0},"GXyqREXyVjk7KUMxtjzczA":{"text":"Drinks were subpar and the staff was too busy with their friends at the end of the bar plu","useful":0,"cool":0},"JKPYhnsrL1s1cgP3qYM4DQ":{"text":"Beautiful restaurant, great food and affordable prices!  The staff was friendly and the at","useful":0,"cool":0},"xVdr0zDbWHxULfxfE_7RjA":{"text":"Mediocre food and the service was trash. \n\nIf I could give this restaurant zero stars I wo","useful":1,"cool":0},"zyOusLLATLYFAcAmgNFZsA":{"text":"I can certainly see the marketing appeal for this place. I mean it's basically beaconing a","useful":1,"cool":1},"6eTRVCqn-FrSdDAZX60CAw":{"text":"To begin with, I booked a reservation for dinner and bottle service for a bachelorette mon","useful":0,"cool":0},"Y4DkxxYC5Wn7OxMkYPLaDg":{"text":"First time in New Orleans with the family. We were steered towards Saints and Sinners afte","useful":1,"cool":0},"2FCWjrjRMH3iXkXK1A3GJg":{"text":"Was the first restaurant we went to during our visit to New Orleans. Definitely gives you ","useful":0,"cool":0},"8pGK7ADIMvCB904QZFxL4g":{"text":"I stumbled upon this place during my bar hopping adventure in the French Quarter.  Reminds","useful":3,"cool":2},"1K_s-YhX5L6sCiyQE4PTMQ":{"text":"The music here was what we needed...they played hip hop/rap and we were milly rocking, nol","useful":0,"cool":0},"zk4IJcrD5X0ym3kYEPiICQ":{"text":"The name and decor is the best part of this restaurant. The food was mediocre at best and ","useful":0,"cool":0},"LbMvV9SnndhXzfg8HOLuog":{"text":"We were wandering Bourbon St. after the Packers/Saints game and immediately noticed the Gr","useful":1,"cool":0},"E6WZ96ODvKmf58QJSDwvvw":{"text":"The best crawfish I eaten in USA so far. There are not so many restaurants supplying crawf","useful":0,"cool":0},"EuOjq3qJdLk7j1lHK4A-nQ":{"text":"I came here with12 ladies for a bachelorette party. The bouncers were so cute and let us s","useful":0,"cool":0},"emTQ5dDmvZHu4EGhG3jHkw":{"text":"The place was a little hard to find, but we wandered in and found a table. The staff buste","useful":0,"cool":0},"1YpEvMJ0yG9YK5xqmKin-w":{"text":"Nice place. Food was great! Staff were very friendly. It's on Bourbon so it's going to be ","useful":0,"cool":0},"nUjfzkwKQ68XIInT5fSuDA":{"text":"This is a fun bar with nice atmosphere.  I recommend going here if you just want to enjoy ","useful":0,"cool":0},"UdFXhmml4OiOcVKjzbW7dA":{"text":"There's so much to say about this place! Food and signature drinks do not disappoint! If y","useful":0,"cool":0},"jbXIirC9B1BNKrybNG2JqQ":{"text":"Is it wrong to really love this bar?  I know I come here all the time I just don't recall ","useful":4,"cool":4},"wRDscX6PJqgFpyhck_LWwA":{"text":"Don't bother making reservations here. We did and showed up to find that without it saying","useful":0,"cool":0},"wR5fTaaXkeHF1GTba4JOiA":{"text":"My boyfriend and I were immediately drawn here by the smell of the crawfish boil taking pl","useful":0,"cool":0},"QJ7dztWml52CsatupHVuGA":{"text":"I wish I could give this place no stars. A group of 9 of us went for my sister's bachelore","useful":1,"cool":0},"UJLOfD-cNXMR0S5c0hUqDA":{"text":"We had reservations set for 8 through OpenTable, arrived a few minutes early, & they had a","useful":0,"cool":0},"dNymSR6TVZvghA04O_h5Mw":{"text":"Okay...I must admit, I wanted to eat at this restaurant because Channing Tatum is part own","useful":1,"cool":1},"Kgk6iIsCman3yBtrIgH_fg":{"text":"Don't let its bourbon street address scare you! Seriously the best gumbo I've had in a lon","useful":0,"cool":0},"unyFIOfGQn1cPTptmd2EGA":{"text":"The crawfish pie, chargrilled oysters, and bread pudding were amazing!! The drinks seems l","useful":0,"cool":0},"a5dT2jk9DMA74GHunGrgEg":{"text":"It gets a good crowd because of the owner. Food very bland and you can get better food in ","useful":1,"cool":1},"unMMkoZBo3Z5kvctfu21Rg":{"text":"went in because we were hungry not know this is channing tatum's restaurant. the food was ","useful":0,"cool":0},"zXi5zACB-3x1OQnzt2eYXQ":{"text":"Saints & Sinners is a Badgers/Packers bar. One of the co-owners  is from Sheboygan. \n \nAbi","useful":0,"cool":0},"WCiQ1xrKbE3mLHb0HwHcow":{"text":"Rating is reflective of the food.  I tried the Jambalaya.  It was good, but I felt I could","useful":1,"cool":0},"xDFl4DT-ibORFa6GlwLTMg":{"text":"Shoulda known. The attractive huckster that seduced us into coming inside as we walked by ","useful":0,"cool":0},"0SpkBpmuL00ZhwD6_RHovw":{"text":"This place sucks, we paid $660 for VIP and hated every second of it.  They advertise it as","useful":1,"cool":0},"toElSAh3JYaHxfco-b6NQg":{"text":"I was unexpectedly impressed with this spot. The gumbo was AMAZING. It wasn't as spicy as ","useful":0,"cool":0},"jmkv0LX52gs37y2dATZU6Q":{"text":"Bad service. Were confused about how to make a martini. Then served it in a plastic cup th","useful":0,"cool":0},"jxy6TNbp9_I9vtvNOM2Rpw":{"text":"We are in New Orleans for Mardi Gra and I really wanted to try this restaurant because its","useful":0,"cool":0},"MySUwnbCicSNC3xkw4t7pQ":{"text":"Crawfish were awesome! Great atmosphere & music! Will come back next time I am in NOLA!","useful":0,"cool":0},"KfEqux8XRGvSuMs9TBZtOg":{"text":"The place was fun, the staff was exceptional.   The crawfish....so.so.  An order of crawfi","useful":0,"cool":0},"1CUH-tfo9vbVRtle1MrZfA":{"text":"If you're looking for some amazing service on Bourbon Street, look no further!  Channing T","useful":0,"cool":0},"HE02wL5Y-LubrqFGL2DjLQ":{"text":"We stopped in for a drink or two and stayed a lot longer because the entire staff was so f","useful":0,"cool":0},"Tm_HMXxdh3H-6IBMS-AwTg":{"text":"The good: service ...bread...wings\n\nThe bad: Jambalaya was oily, bland, and rice wasn't fu","useful":2,"cool":0},"WVNuueH4ORAXRgwyri-DVg":{"text":"We ate here this past weekend.They over booked the private room and had one waitress for t","useful":0,"cool":0},"dbutxtJ5ZQ2wbbQJDhNMmQ":{"text":"Great place. Love the decor. I might wear all red next time. A bit disappointed to later f","useful":0,"cool":0},"LH_ielXMqpSpaM2SHPSAxw":{"text":"Crawfish was amazing! Large oysters that also were amazing! Service was great. Adam was al","useful":1,"cool":0},"_TnQpKvZtl_hjHW_ZuVHNw":{"text":"Absolutely the worse food I have ever eaten. The grits were watery and the shrimp under co","useful":0,"cool":0},"A32INl8J1yBAA6o5Y7cO_Q":{"text":"The crawfish pie as a starter was great, proly the highlight of our visit. Simply put, the","useful":0,"cool":0},"HqvpEroVywfimFzZ-0jo1w":{"text":"This place sucks, customer service is as close to 0 as you can, in California we take serv","useful":0,"cool":0},"xLslyLfb-8QdgDdJyT_zLw":{"text":"So upon discovering that Channing Tatum is the owner I just had to visit! Lol\nThe place is","useful":1,"cool":1},"jJd_ii0mzfNnLUGcjDJSWg":{"text":"Had the crawfish etouffe here. It was flavorful and jam packed with crawfish. Would have g","useful":0,"cool":0},"lXGDwArbX3d-9jNnHYagnw":{"text":"The crawfish pie was amazing, 4 stars because it was slightly too salty.\n\nThe crawfish pla","useful":0,"cool":0},"_p70jjj5WPi4Ro6ZkQ2U-w":{"text":"Just ate here tonight and it was the best crawfish I've ever had. The service was amazing!","useful":0,"cool":0},"n3OcuYDcc3p0FhHApsKtJQ":{"text":"My second time eating here. Both times excellent. Outstanding crawfish, chargrilled oyster","useful":0,"cool":0},"8ykT1UbrOZlnM3-1vMeIiA":{"text":"Excellent crawfish boil, charbroiled oysters, and drinks. A classy decor without the high ","useful":0,"cool":0},"l32btLozZEiJG4WD5WGOKg":{"text":"My friends and I stumbled upon Saints and Sinner and I am so grateful. The crawfish is sea","useful":1,"cool":0},"MvUdZ5YzyhC0b6BSJyUJDw":{"text":"Came here for the first time. Great crawfish and fried alligator tail!\nService was fast an","useful":0,"cool":0},"lywpJ3lq6lM7sJd5WroGpA":{"text":"GREAT food and atmosphere. Service was attentive, fast, and kind. We only had two days in ","useful":0,"cool":0},"o5qUsTcN_KCQ6Fw6VvfHLA":{"text":"Great restaurant with great customer service! Terrance is an awesome manager and David is ","useful":0,"cool":0},"VONjTZNMgvjWQHKX5l9Wmg":{"text":"Sara\nWe were in at approximately Dec 5 at 8pm. Manager did comp wings and drink which was ","useful":0,"cool":0},"cdktUD_8SFTwIcmdl-lpCQ":{"text":"Awesome! Small intimate place, dark lounge feel, huge menu of NOLA favorites that did not ","useful":0,"cool":0},"i1Xkc0_NQKbtOovq8HKYxg":{"text":"This place was great, we had the crawfish plate for $13.95 minus a10% coupon that was give","useful":0,"cool":0},"g2p5EKubEHarkkfndnuYcw":{"text":"Reply to Sara:\n\nAgain, check that video, please. Does it have sound too? My work is in com","useful":0,"cool":0},"cABYjf7YNgx7aZKW0bBtDw":{"text":":( we were so excited to come here for our \"stag and hen\" party. We made our reservation a","useful":1,"cool":0},"sNQR7cZ56fp-THJa9L1kkg":{"text":"So we came here because the gf wanted to go.  They oysters and gator bites were good.  I g","useful":2,"cool":0},"0tPCrxJtguLEurrHy-XmQw":{"text":"Went to this restaurant because I heard they has the No.1 Crawfish and Oyster in New   Orl","useful":1,"cool":0},"30Y1wPYJ6FMcHAmzpx8P5w":{"text":"My group of 8 beautiful women were offered free bottle service in order to attract other c","useful":2,"cool":0},"UT2hxZoCd_zje_DgYePNMA":{"text":"Fantastic food... two direct quotes from a food aficionado: Those oysters were the best I'","useful":0,"cool":0},"EH74GRqBHjOC_wNGCy-g-g":{"text":"Had a great dinner for my friend's bachelorette party. The food and drinks were great and ","useful":0,"cool":0},"UoCd6mqAJz_R-0ZyEyNeSg":{"text":"We spent most of the Red Dress Run upstairs watching from the balcony and hanging with the","useful":0,"cool":0},"DP-VKUd9ww-R3Y-Es-Nh7A":{"text":"Visited while we were in the Quarter to try a new restaurant.  Interesting and unique deco","useful":0,"cool":0},"yrLB8_qsQtBDmkGhJ4EwCQ":{"text":"Incredible chargrilled oysters.  First time I had ever had  them, and they were to die for","useful":0,"cool":0},"Zsdk9Hmb3JGl5k0SJbP6Zg":{"text":"Only a few years old to New Orleans it is a big hit. We went for the boiled craw fish. My ","useful":0,"cool":1},"ZTTA5G0182NwfbGeLDXBfw":{"text":"Charbroiled oysters were amazing bartender Peter will customize your drinks to fit your ta","useful":0,"cool":0},"RDNJoNe6YnDIKFGdwJULsg":{"text":"Atmosphere was awesome!! We went for a bachelorette dinner the music was energetic we coul","useful":0,"cool":0},"XVdTogtOFUE7sdmEq8ecGA":{"text":"They need to rename this place to Shits and Sinners.   The bathrooms are tiny, but immacul","useful":0,"cool":0},"jhdfSyQtg3NbeQu_ed2xIQ":{"text":"Ultimate Fail, worst experience I've ever had at a restaurant. I made reservations after s","useful":0,"cool":0},"Dsx3u6tNk744bCQZdyZpTA":{"text":"I wish I could give this place a zero. Here with a bachelorette party, Waited 45 minutes f","useful":0,"cool":0},"6fMzeAAL8JkNTle6MGBKoA":{"text":"We made a reservation the day before and were seated right away on a Saturday night. We sa","useful":0,"cool":0},"t4r1fWXMIs5pJlJK2I_P7A":{"text":"One of those dining experiences you will never forget- unbelievable food, passionate chef,","useful":0,"cool":0},"MkXXBLykwMCHOfNyXa-qkg":{"text":"It's not so bad. Maybe we had a fluke with good drinks and great service. Those two things","useful":2,"cool":1},"WvJQFiueVGciHqwzh94GGA":{"text":"Thank for this AMAZING, FLAVOR-ABLE, and GREAT AMBIENCE!!!! Will recommend to everyone. Ma","useful":0,"cool":0},"VAAsHX0UQMK2pRj3Go402w":{"text":"Went here last night with a couple of co workers. We went for the crawfish boil but when w","useful":0,"cool":0},"A2J6Z3Nqw_lELMFDnDOx1g":{"text":"Seafood is very fresh! Fun atmosphere! Crawfish platter is highly recommended... a little ","useful":0,"cool":0},"0-Zo1GBD7g-KWfL8aTJjEw":{"text":"All around great. We went in to get  appitizers and drinks and left full and satisfied. So","useful":0,"cool":0},"QqMTn7q2nvjzxWwoestKSA":{"text":"This place is incredible!  First the decor is unlike anything you will find around!  Secon","useful":0,"cool":0},"7T6Y9OAfI7SPEw7dwY8IKg":{"text":"came here for drinks only and they were delicious. I wish we had time to come here and eat","useful":0,"cool":0},"4wl5bijyHtluPVbQTjAEGQ":{"text":"Please offer a zero rating. \nJust experienced the worst night of dining in 30+ years of tr","useful":0,"cool":0},"6--iM2vpJBlrayUcQ9uKWA":{"text":"We had the most amazing food. The crawfish were fantastic, even though it isn't currently ","useful":0,"cool":1},"AkrCyYgAqSJv4ZcVMulXTA":{"text":"DELICIOUS CRAWFISH. DELICIOUS GATOR. Been to Nola 3 times and this was a delicious place t","useful":0,"cool":0},"WtmFpoxTkbrjXfMbn7qBcQ":{"text":"Amazing.  Beautiful New Orleans decor.  Delicious food and awesome staff!! I will be back!","useful":0,"cool":0},"8IRSbATgD4LksU0dk42IBw":{"text":"What can I say about Saints and sinners? Well... This place looks amazing.The atmosphere i","useful":0,"cool":0},"eYKkIn9zXnHaM1RjeoUj7g":{"text":"This restaurant is more than GREAT it is FANTASTIC and food is so good but more than that ","useful":0,"cool":0},"8U0uBrrvtlbteImiwlXYWQ":{"text":"I just moved here and ADAM, who was our server, and Mr. Julio the manager were amazing peo","useful":1,"cool":0},"cHBv0uvBsw0H_2rJdU5F7w":{"text":"The prices were a bit high and the food wasn't the best. A lot of the specialty drinks wer","useful":0,"cool":0},"76uRInE35od9ba_51K2cXA":{"text":"First time here. 9/17 (around 7pm) Food was Excellent. Wait was awful. I ordered to go. Th","useful":0,"cool":0},"zNpaYnJIzP14k8RmQn4B2Q":{"text":"Saints and Sinners has awesome drinks!  A very good pour compared to the other establishme","useful":0,"cool":0},"WpFj8tXn0FYB44oEAmB9Ug":{"text":"Great place to go, great atmosphere, service was great and the Channing Tatum cut out was ","useful":0,"cool":0},"Vqla87IXi1dMD1wvUeAkWg":{"text":"We came here for a bachelorette party. The food was excellent. Everyone ordered different ","useful":0,"cool":0},"Vx2nTn9lKiRov45lNKVTEQ":{"text":"Chris is an excellent waiter and the food is priced reasonably.  We had wings, a salad and","useful":0,"cool":0},"KEliNWhge3aP_qFMi27Tiw":{"text":"We got here just when crawfish season was over! We asked out bartender at our hotel which ","useful":0,"cool":0},"dvCss7OGLeVFJUCEIggyig":{"text":"Delicious food, they were slammed and offered us seating on the patio out front. Great ser","useful":0,"cool":0},"OhsEbEvaImQ1UzTmRXFGRA":{"text":"Stopped in to try their hurricane drink, and David not only made an amazing hurricane from","useful":0,"cool":0},"Ayl0se3NkgzS34JhE0b8UA":{"text":"We came here for dinner for my bachelorette party and had the best food and service we had","useful":0,"cool":0},"IOIUT18_J0ay97k9XRFBPg":{"text":"Update to previous review:\nThe manager, Joe, called me and handled the situation like a pr","useful":0,"cool":0},"6x265UBo-jRIQBaIG20j4g":{"text":"I was saddened that I was made to feel unwelcome here. Never been bitched out by a bartend","useful":0,"cool":0},"2kWkwTc7Yq8_s7sA0rfTcA":{"text":"Blech. Not my fav. Stopped in for a quick lunch. We ordered the tacos and gumbo. The shrim","useful":0,"cool":0},"yWr-LfjHm8qU-lb99QVy1g":{"text":"Visiting New Orleans for a quick girls trip. Crawfish are ok nicely spiced but not seasone","useful":0,"cool":0},"B-_1TTfKEDTUvLKewvYgiQ":{"text":"Heard about a male burlesque show that was going to be performing. Tried to call and make ","useful":1,"cool":0},"kKgGtTtPh4rrRymUOSIIyg":{"text":"So ive been here before because of the music and the whole party scene, but today was the ","useful":1,"cool":1},"xrGajS2rleuJRCsrziZPQA":{"text":"This was the absolute worst dining experience of my life. Had a reservation for 12. They w","useful":0,"cool":0},"k-1A7gIpOcon4hDfoj3r-Q":{"text":"Crawfish - Unreal. Wings - Unreal. The manager is super personable, and I still can't figu","useful":0,"cool":0},"GlfUokwLLvWkGK3MRubNPQ":{"text":"Worst experience ever!!! If I could give ZERO stars I would!!!! First off, the guy told us","useful":0,"cool":0},"UrngDU2limnQEjm-J5kNfw":{"text":"You have to try the crawfish pie! The chargrilled oysters are delicious. Top it off with t","useful":0,"cool":0},"P0YHhsNKIHtGzqs5kgxQug":{"text":"Solid meal. Got half a pound of crawfish (lots of flavor), fried alligator, and crawfish p","useful":0,"cool":0},"TDCIIOdbT151ubG6ZcSyig":{"text":"Visited in the winter when it was not crawfish season, so I knew ordering crawfish would b","useful":0,"cool":0},"FOjZrAzI_rB7_2zz5CYZjw":{"text":"Joe and Gina were excellent! Joe taught us how to eat crawfish. The service was impeccable","useful":0,"cool":0},"VFlAtzliO1fHZM0vXO82pg":{"text":"Great place!  Love the decor, drinks and strong and the food is delish.  The bartender Ash","useful":0,"cool":0},"1v0vx3IUdxP_-3UYhVyGGQ":{"text":"This restaurant has 5 star reviews because they ask you to put up a post on Yelp in exchan","useful":1,"cool":0},"MbFJ2AjH_N6wv1EfRWJPZw":{"text":"We had dinner there and the crawfish platter was good. Staff was ok. Crawfish is spicy wo ","useful":0,"cool":0},"FVJzS67NTXQXZrDm7XqkXA":{"text":"Sorry Channing, but this place needs work. I'm easy to please, but don't give out stars JU","useful":1,"cool":0},"9q39eWNHvnijs7UXbqF0_g":{"text":"This place is just as hot as Channing Tatum!! From the amazing crawfish to the delicious d","useful":0,"cool":0},"sKc4-1FvTG-lPgZNXXIDQQ":{"text":"The experience was awesome and they did a great job accommodating us drunk folk! Shountie ","useful":0,"cool":0},"0Mtx5BKV3luv0qnLpwOLtg":{"text":"Our waiter David made the dinning experience that much better ! He recommended his favorit","useful":0,"cool":0},"4aXtCTC9xLCkJRTvpV3HQw":{"text":"Channing if you own this place please note there's nothing magic happening here. Wait staf","useful":0,"cool":0},"H-JxizQpVBldGI2o3sxArA":{"text":"Such a fun place - great food! Crawfish pie is excellent!!Great service...David (at the ba","useful":0,"cool":0},"rgepQEE3AHCyZ8WcUoEnBQ":{"text":"We're in town from Wisconsin and heard Saints and Sinners is a Packer Bar (on game days an","useful":1,"cool":0},"a6LaajlTmqbS42st1GI0-g":{"text":"Terrible service. Terrible food. Channing Tatum should stick to acting... if anyone actual","useful":1,"cool":0},"OIfKAZ77d_iYE9lPsFLMQA":{"text":"The smell of crawfish from bourbon street lured us in. The service and friendly staff was ","useful":0,"cool":0},"xzPAemQTdhuQpikamuUpRQ":{"text":"Awesome!!! Get the crawfish boil and the gumbo... By far some of the best food I've had in","useful":0,"cool":0},"s84abyPQaEVak-7tPXTzYQ":{"text":"We came here with 20 awesome ladies for my bffs bachelorette and had the BEST WEEKEND EVER","useful":0,"cool":1},"8qoyl47Q7vDMjFQTtbOrIQ":{"text":"I kept looking around here thinking, wow, it kinda looks like a brothel in here. Well, duh","useful":1,"cool":0},"FohelzJSWIuRgv0FlKUaIw":{"text":"We had the most wonderful experience at this restaurant for my best friend's bachelorette ","useful":0,"cool":0},"rSi6RcJqawd50RhWTDdr7A":{"text":"I bought a drink there and my friend ask for water. This Michael Chiklis/Fred Durst wanna ","useful":0,"cool":0},"iY0ROAZwA5FIVZJzu-no0w":{"text":"Good food and the few private parties that I went to we had so much fun! Good Dj and good ","useful":0,"cool":0},"6ckL6Ag6v4HivV8C1V5GSA":{"text":"Partied my ass off here on a Saturday night during Mardi Gras. DJ was killing it with most","useful":0,"cool":0},"jCpBKAU1DbPqPw2aAET3Fg":{"text":"Awesome spot! Tried the oysters and the crawfish pie absolutely great! Next time in Nola w","useful":0,"cool":0},"SPuZrbPlxWvQy4TrKTpBCw":{"text":"Ate the crawfish  pie..first time to eat one   ..Was so delicious. ..I recommend  everyone","useful":0,"cool":0},"itQw18CBzuhYGM1l5pJ0ww":{"text":"A waitress recommended this club to us. This is really a review of all of Bourbon St. Walk","useful":0,"cool":0},"FnUcRb5ldBXzAn5tP7e9sQ":{"text":"the only thing missing was Channing Tatum :(((\n\ngreat location, very friendly staff, good ","useful":0,"cool":0},"1OmSOMGm38PQO5qk-06QOw":{"text":"I was there over Christmas vacation and this was the only place in town i could find live ","useful":0,"cool":0},"AMy3ZwzyJmYUVO_0R_FTWQ":{"text":"Came here expecting VIP treatment and a top notch environment which sadly did not live up ","useful":0,"cool":0},"RrpFrfz0Sb5MTQmInI9aTg":{"text":"My cousin and I had a great experience at Saints and Sinners on a recent Friday night.  We","useful":0,"cool":0},"IqtFrQQWcIwiVYCAUVNphQ":{"text":"Came to New Orleans for my 21st birthday and on my second day here we met a friend at Sain","useful":0,"cool":0},"C_uECqPrNQLC65n0A1Te9g":{"text":"This was by far our favorite meal of the night! We had blackened fish with gouda grits and","useful":0,"cool":0},"8msH_vrqg-TbBM2VCF43AQ":{"text":"I went in because I was told they were known for their crawfish. When i went in hostess sa","useful":0,"cool":0},"vkdCgYkyb8v8IpZQv5cLig":{"text":"Great appetizers especially the cheese curds and short pork ribs. The crust on the pork wa","useful":0,"cool":0},"6MzSpIjBS7CYJvqLKSsciQ":{"text":"Had the best time. Great food and great drinks. Ask Daniel for a Love Potion #10. We had t","useful":0,"cool":0},"4sC9z5LgkLzAqjHfbDePoQ":{"text":"Wow oh wow was the Chicken & Andouille Gumbo\nThe best gumbo in New Orleans ! The broth was","useful":7,"cool":5},"yrGPbYHQcr9IBJNvgkOKXQ":{"text":"We had a group of 14 girls with a dinner reservation for a bachelorette party. The service","useful":1,"cool":0},"q4qHLxtu_J9sjYbtzFEMaw":{"text":"Kami was the best !!  We are from Iowa and love crawfish!   She's the best and talked us i","useful":0,"cool":0},"eGfxhNIU4fOsXiPcLqphsw":{"text":"We stumbled upon Saints and Sinners and were pleasantly surprised.  We asked a crowd of pe","useful":0,"cool":0},"9swMtftXPLqIZwNSdYDx9A":{"text":"Nice decor! Cool staff. Crawfish was small and by the time I got my condiments they were c","useful":0,"cool":0},"elMCQap1vYZhl6vvrPKBwg":{"text":"Saints and Sinners was a dinner stop for my friend's bachelorette party, and we were extre","useful":0,"cool":0},"I1DqwPEUzSlgmZhm8rjmug":{"text":"Great fresh crawfish and oysters raw or baked. Authentic NOLA southern style cooking. One ","useful":1,"cool":0},"eWzgRvB9AmXuEn_0VwKZ-A":{"text":"Great atmosphere - feels quaint and unique when you walk in. They had very limited outdoor","useful":0,"cool":0},"pyRFFqigTwnYZbMVi7vp_A":{"text":"I LOVE this place. So much, that I had my bachelorette party here 2 years ago. We had a bl","useful":0,"cool":1},"BL2thegFJpiJR1VqQ2S0QQ":{"text":"Great service!  Wandered in on a Friday night and got the last table. Crawfish boil was AM","useful":0,"cool":0},"8-O6lGjMZvSBdx0MDtkmHA":{"text":"Stopped by for a quick drink and ended up staying for 2 hours. Light night due to the down","useful":0,"cool":0},"-NroGwkjx57m8bVqqhLCLQ":{"text":"I'm not the one to go hang out on Bourbon Street. It can be so much better than what it is","useful":9,"cool":7},"90udQ5ZD9RSQrd80bI9htg":{"text":"If you find yourself in New Orleans you need to try Saints and Sinners. Make sure you ask ","useful":0,"cool":0},"O5DdbvfLEMXrafuJA4DGVQ":{"text":"The music was at least better than at other booty-shaking clubs on Bourbon. The floors wer","useful":9,"cool":3},"5bYC88jyOo_RU_mh_Oz5Zw":{"text":"Pass. This place is not worth your time. Came for dinner, they were out of the Mac-n-chees","useful":0,"cool":0},"hlyrR4gJefZ2rKNyik9Fhw":{"text":"Great little bar on Bourbon. This was our first stop a few weeks ago. While on vacation we","useful":0,"cool":0},"8R8H0b5il63lA0365WVQzg":{"text":"This place was awful. Don't be lured in by Channing Tatum's name. We were so excited to tr","useful":0,"cool":0},"K_xIMMJgSV2Q56wZyaFiOQ":{"text":"my first time here ,they were having a crawfish boil , and could n't pass that one up, my ","useful":0,"cool":0},"0dsXXCkz62w2-ygVVBZPmw":{"text":"Had the best night for my birthday with my two friends! From Julio, the manager, Allison o","useful":0,"cool":0},"PssTPYD-LX9sE9-OkD_aqA":{"text":"The interior features a beautiful speakeasy decor. The speciality cocktails are the best o","useful":0,"cool":0},"GkpC7fLo5xRodpeSlQG6QA":{"text":"Stopped by because it was Channing Tatum's restaurant and we were not disappointed! David,","useful":0,"cool":0},"3BnSqVHaSDgG7in21ufkzA":{"text":"Great service from the time we walked into the bar. August was our server & she was so nic","useful":0,"cool":0},"1AYEBnifaoVGEA0yvDGaGg":{"text":"Best gator Po'Boy. Best Thai chili & best customer service on Bourbon! Great atmosphere to","useful":0,"cool":0},"94WsOQ47xh4gExctJM_rrg":{"text":"Loud and gross- typical for Bourbon st.  The shrimp tacos were gross- hard plastic disc fo","useful":0,"cool":0},"1QgRHUmh2ecn26kK2hpcbw":{"text":"There is a \"dancing\" pole and the servers know how to use it! Is it creepy if I want to co","useful":0,"cool":0},"OEbbDEYqrE9ihfJWxDrwwA":{"text":"I guess we must've stopped in on a night where all the friendly staff were off. Our waitre","useful":0,"cool":0},"N7QzwYlfLhyTTMYGpKW-cg":{"text":"The crawfish platter is awesome and crazy spicy. The grilled oyster are delicious. And the","useful":0,"cool":0},"el9Ss9RRRAh0DEvKhk6sSg":{"text":"My meal was phenomenal! I had shrimp and pasta. Also had oysters. I went with a large grou","useful":1,"cool":0},"mCIL80KoddykG4Y6Drf8ww":{"text":"Best Mac n cheese ever! Got to sample some fresh crawfish which was bomb. Just the right s","useful":0,"cool":0},"UZJ9Nui3tQTZZGxGHHX-Ew":{"text":"We had great service two days ago but... tonight we went hoping for the same. The place wa","useful":0,"cool":0},"i5lNw1zyEA2y4n9opqtojQ":{"text":"Overpriced. Excessively dirty bathrooms and the smell right outside is particularly horrib","useful":0,"cool":0},"lukxBV4jj4g94SEV58kQBw":{"text":"Early meal...will be back later to hang out...staff super friendly and the food is on poin","useful":0,"cool":0},"QE7J2A26Bb95g52RuttMwg":{"text":"What a great place! Sit outside and watch the colorful people go by while eating mouthwate","useful":0,"cool":0},"ANtM7tQNqmWEpL84TvgwdQ":{"text":"my group of 8 and i came here the two nights we were in NOLA - not really sure why actuall","useful":0,"cool":0},"N---0cIDepx4DMPvJz14pw":{"text":"Yes please! Fresh crawfish boil??!! Walking down Bourbon St, you can't miss Saints and Sin","useful":2,"cool":2},"XqLsEq2mv853hRAsrGSHbQ":{"text":"Channing has done a great job of owning a very chic, fun and popular club and bar right of","useful":0,"cool":0},"kUP_gHrDf5Ytv6JhsP3taA":{"text":"They were cooking crawfish outside and drawing a crowds and plenty customers.  Started wit","useful":5,"cool":1},"ZtQJ9TlZQ1lIF5ZK_UpLrQ":{"text":"We were looking for a later night spot to grab a bite, people watch and listen to some mus","useful":5,"cool":0},"v_ZkkZ-DdehgJJF7MsxA4g":{"text":"(This review was actually written on 11/6/12)\nIf you find yourself on Bourbon Street on a ","useful":0,"cool":0},"VZPmacWZi7QcakXEFEf_0A":{"text":"Stumbled - as one tends to do on Bourbon Street - into this place because we liked the neo","useful":0,"cool":0},"V_GQXTEfbAtY0llNqzoMIQ":{"text":"This place was the overrated and grossest place that I have ever had a meal at. I was ther","useful":0,"cool":0},"B0FE0Tk-wHvKY_9OqQAcRg":{"text":"Fantastic boil cooked in front of you if you happen to get a table outside! We were there ","useful":0,"cool":0},"OcMAGWnkOcM-MtMkZZ5ClA":{"text":"The decor of this place is reason enough to go here.  It was so cool looking inside!  My f","useful":0,"cool":0},"QaUCo-F3nrqW9QStrS0BjA":{"text":"I cannot say enough about this place!  They got us in randomly with the live crawfish...  ","useful":1,"cool":0},"D4nClRrMcwPXN_PDkwT6Og":{"text":"Had a friends bachelorette party dinner and drinks here - everything was great. The servic","useful":0,"cool":0},"vtOm3yS5p3q7Ou0rD9dw6g":{"text":"omg!!..restaurant was amaxing.. crawfish didn't owe me a rhing.. all workers were nice and","useful":0,"cool":0},"BzftAaPu0kaUarS1Ax9OQg":{"text":"We were here Saturday night - had a blast.  We then went back Sunday for brunch to a compl","useful":0,"cool":0},"PlBwJWJq6cgJE0nZndAHwg":{"text":"Walking Bourbon  and stumbled on this   jewel. I actually say a man standing outside boili","useful":0,"cool":0},"0WRMam-ZkPpfbwaHQCWBmQ":{"text":"I have no idea how staff working here have been described as friendly not unless they thre","useful":0,"cool":0},"CNuVbbwD5M0u1H9MmDaOLA":{"text":"Seafood Gumbo !!! The best seafood gumbo in New Orleans. Better than the gumbo shop by far","useful":0,"cool":0},"lms2H82jInfWA59RWYvmFw":{"text":"As I first walked into the bar I was greeted by one of the employees. He was dark and hand","useful":0,"cool":0},"LRjVPGE0oSMHNsXeJuqs8w":{"text":"The crawfish is really good and cheap --- 20$ for 1.5 pounds. Don't miss it if you like cr","useful":0,"cool":0},"DipbBdmZtjSlz2XO8n1uTw":{"text":"We stopped in for a beer on a Friday afternoon, the place was understandably empty. This p","useful":0,"cool":0},"lPVj8UlXINdyDLZNUdtJBw":{"text":"Awful place. Terrible staff. Terrible clientele. They only have bottled water. Real douche","useful":0,"cool":0},"LWR_ai_uTvzZ_SCl0fC4FA":{"text":"We only had drinks here but the food smelled amazing.  I was surprised and happy to see mo","useful":0,"cool":0},"FPOnUW_DKFVyXwg_sSpDBw":{"text":"One of the best cajun experiences of our trip!! The crawfish platter was exactly what I ex","useful":0,"cool":0},"cZQceiJVgfuT97kWCRZJmQ":{"text":"Horrible food and horrible service. Please don't waste your time or money going here!","useful":0,"cool":0},"G9KIcmjNdkFxNiWAO2PdKA":{"text":"I wasn't aware that Saints and Sinners even offered food until I made it there as part of ","useful":0,"cool":0},"nKeuEA0tlPRVbDj3-qE9ag":{"text":"Wife and I sat at the bar at 6:30 on a Wednesday.   Ordered Poboy and 1.5 pounds of crawfi","useful":0,"cool":0},"c5xbyckaanfEHh7NGcPo3g":{"text":"I was there 12/30/13, it was so bad I can not write the review now, I need to calm down to","useful":1,"cool":0},"wksyYyYuuaGNfS7l3vTwiw":{"text":"Boiled crawfish is the best in NOLA.  Atmosphere, drinks, staff are all the best example o","useful":0,"cool":0},"fP5gYAle6jJIO3OeuDLAWg":{"text":"Amazing restaurant. The food was excellent!!! The bartender Kami was great and made awesom","useful":0,"cool":0},"LCy7la6pm9c7NLVSqgw2Zg":{"text":"The food is amazing and the staff are exceptionally nice! There's also a specialty drink c","useful":0,"cool":0},"xnCpnyKz6cPCpVdG-nCmqw":{"text":"Very good and tons of food.  We had the alligator tail, shrimp po boy and the catfish po b","useful":0,"cool":0},"BxPmcQ14zqo6JUvXrjTn2w":{"text":"We stayed here longer than any other bar we went to while we were in town. The bartender w","useful":0,"cool":0},"cpJX5TsoZRzYcMXRBfq2CA":{"text":"Unless you're hoping that Channing Tatum is at the restaurant, I'd skip Saints and Sinners","useful":0,"cool":0},"TniH8shTm5o7M0Njulz3zg":{"text":"We decided to give Saints & Sinners a try on our first night in NO.  We were wanting somet","useful":0,"cool":0},"D7G14ibLL7f1wXwqs25RWw":{"text":"Great food and Kelsey was awesome. Good atmosphere! We try to stop by each time we come to","useful":0,"cool":0},"IF59AgWEbv5m7k6zQD9UUQ":{"text":"Baked oysters were good, I wasn't a fan of the gumbo, it was too salty. If you sit in the ","useful":1,"cool":0},"f48kpNpfkBi73Fz-6bB99Q":{"text":"This place will only make it from the tourists... Not a place for the locals! We went here","useful":3,"cool":0},"OvuN6XdLnnEAgjDX0GUXFg":{"text":"The crawfish Mac n cheez is to DIE for! sit out on the patio and order up a plate of crawf","useful":0,"cool":0},"BYTYqCBnyiUCurVn3mIpgg":{"text":"So we had a group of 20+ people and called to reserve a month ahead of time and reserved t","useful":0,"cool":0},"kfuJAAad2I0PbfS5TS_d6w":{"text":"This is my favorite place to just dive into a pound* and a half of crawfish, which by the ","useful":0,"cool":0},"FhrkxwIaVyAusNy7XHaZFw":{"text":"Crawfish was good. Jambalaya is amazing. The rest of the food bad. Service slow. There wer","useful":0,"cool":0},"uHaVkNzylcQUWvFkDfcQSg":{"text":"Quite disappointed. Shrimp and grits were less than average, nothing special about the gri","useful":1,"cool":0},"UoYYK30yFkTaT8mK0E_aiA":{"text":"Great experience, great food, great people.  I went for early dinner and was very impresse","useful":0,"cool":0},"mZpZAjqTE3zBZHQ-b1wvSQ":{"text":"A small little restaurant/nightclub stashed deep inside Bourbon street, offering both lavi","useful":0,"cool":0},"Y3F1DvQ7N71hf7jecpcd2Q":{"text":"We stopped here simply because of the crawfish swimming around outside and my lil guys wer","useful":0,"cool":0},"CjNgMreiwhMpnav89xIx2Q":{"text":"The service here is excelent. They need to be more mindful of the music playing, we happen","useful":0,"cool":0},"m_cIB4kxgFJkBlbqC5x33g":{"text":"David is a Saint. Great service with some amazing crawfish. The beer was cheap and cold an","useful":0,"cool":0},"a3oha8ckDVsRqFhfNv1EBA":{"text":"Horrible service from beginning to end.  Sadly I have nothing good to say about this estab","useful":0,"cool":0},"cHba82oKHuGsa8gkyi7kzQ":{"text":"Great quality food! Would recommend the Po Boy Shrimp & Jambalaya! A must to celebrate the","useful":0,"cool":0},"yCIdnLgW9cKA5Ek1MeNf7Q":{"text":"We had such  a  great  experience that we took some friends back during our stay in the Fr","useful":0,"cool":0},"RzmV_VnFsAEFQ_aKEmDBow":{"text":"Saints and Sinners has a cool name and menu, but their food just fell short overall for me","useful":7,"cool":2},"Xo3NmFK7SPuWocpwoUqylg":{"text":"LOL. I came here on a late night with my girlfriends to celebrate for a special occasion. ","useful":0,"cool":0},"hK0c4CD93VWS-DKUevcXGA":{"text":"We stumbled across this restaurant bar, with AMAZING Jambalaya. And mix in the GrownUp Mac","useful":0,"cool":0},"YfjH0vLN86UqmjeJScOyRA":{"text":"We stopped in New Orleans on our 2 week tour to sample the local foods and stumbled upon t","useful":0,"cool":0},"nS7Gn6VsN2-l3ybSN2oMEQ":{"text":"I'd rather laugh with the sinners than cry with the saints. I probably would have rather j","useful":5,"cool":2},"gXuURXPPtI4823BFxrBwdg":{"text":"The food is fabulous, the bloody marys are awful! The atmosphere is beautiful and is, know","useful":0,"cool":0},"3qqctrF51oguFqhhIk2DYQ":{"text":"I had boiled crawfish here. It was cooked the right way and they were tender and easy to p","useful":0,"cool":0},"4pD58qV3ZlcMTLOnMuFDBg":{"text":"The food here is great! We had the Thai chili wings. A sticky mess but worth the hassle. A","useful":0,"cool":0},"Kpz1U-C-oEsBmT6A1h0vXg":{"text":"I wish I could give 3.1/2 stars - because honestly, I think the food we had was quite good","useful":2,"cool":1},"nZijIjTL_-jvFs12vayEIA":{"text":"Wow, so my Fried catfish Po' Boy was the worst thing I've attempted to eat in a while. We ","useful":1,"cool":0},"BW5x_eitoGAwkNIo9DQUIg":{"text":"Saints and Sinners is quite amazing! The food was so delicious, the staff was friendly and","useful":0,"cool":0},"o6E8kKQkF9lfiMXc3B_V7w":{"text":"Always great food and great service ... Best Atmosphere on Bourbon !! Comfortable and Rela","useful":1,"cool":0},"0s3uScz6HsFG_eunmM0PmQ":{"text":"Our server, who I think is the bouncer was cool and nice. I wouldn't have come here, but t","useful":0,"cool":0},"CNmN7GWeqv0HjmqbTY1iHw":{"text":"Try the crawfish mac and cheese! So tasty. The manager/bartender was hilarious too.","useful":0,"cool":0},"f3imF_oIDBI-nbOS0XqVTA":{"text":"food was great. drinks were better. bartender was THE BEST! i helped him find his #1 NFL c","useful":0,"cool":0},"91QRHDy6UcLNctXIIJtakg":{"text":"Terrible service and the food was not even close to worth what you paid for. The waitress ","useful":1,"cool":0},"vElxmeznyO1xYS5bHLwhQw":{"text":"Crawfish platter: spicy and tasty- just like I like my man. Service: friendly, honest and ","useful":0,"cool":0},"naw9gX0ZnPiN8HCm01BAiQ":{"text":"Love this stop on our 3 day Bar Crawl. The bartender was awesome and patient with our grou","useful":0,"cool":0},"ELBNE75IIhxvvYvyH2YRow":{"text":"This was actually one of my favorites while in NOLA. The gumbo was superb (and I had gumbo","useful":0,"cool":0},"qzp37RbKNfJzxNI0kf4E7A":{"text":"Very, very impressed! Chris our server was top notch. Never had to wait on anything, and v","useful":0,"cool":0},"8PKHyyv6DHwbulcCkDP2iA":{"text":"My sister and I were in NOLA for 311 day and could not stop coming to this place for the c","useful":0,"cool":0},"3sq-Jk7Fg0Ami4eBuD5Qng":{"text":"We love going to New Orleans and this was our first time at saints and sinners we had a gr","useful":0,"cool":0},"1LaeoxHd1srXCzGcRVD2ZQ":{"text":"Came here with my wife and friends for my wife's birthday..and wow! The food here was GREA","useful":0,"cool":0},"0srwQiWpjhEjWQ-u8HPACg":{"text":"The crawfish are super spicy and super flavorful. I don't know what they put in their burg","useful":0,"cool":0},"ikr6gojVy9erf6LlfQbNXg":{"text":"Came here with a few friends for dinner. Their Shrimp & Grits were good, a little on the s","useful":0,"cool":0},"h3GIrbGM_UF7VuNeSUI30w":{"text":"Joe is the best. The tacos were the bomb dot com. It's like moulin rouge but with Channing","useful":0,"cool":0},"mvDfVyNop2HATqQFjiaedw":{"text":"Great service and great food! Best damn crawfish In the south!! The manager Julio and staf","useful":0,"cool":0},"xuqgbo37_gaHcTIj-8LDRw":{"text":"Great crawfish boil.  A little pricey but what can you do.  We sat outside n never got to ","useful":0,"cool":0},"ck4WWoVZekjdrk8pKRDdTw":{"text":"Only place we could find within the walking bourbon street area that had crawfish boil dur","useful":0,"cool":0},"-DR7DawbeZkHN3Qa8h7TGg":{"text":"Came last night with my sister's volleyball team - awesome!\nThe craziness that was bourbon","useful":0,"cool":0},"Pgi5v0MfcwC2iYJc_BYFaQ":{"text":"The food was Great.....But our server/bartender David was Outstanding! He was super nice r","useful":0,"cool":0},"c7MQhMRt6SPGhw3-YXzLGA":{"text":"Talk about an exceptional sensory experience! The scent of the boil drew us in from Bourbo","useful":0,"cool":1},"ghbl4unyDtB4dlma1S91yg":{"text":"Came here with some friends and my 18 year old daughter.  The bartender looked really busy","useful":1,"cool":0},"GOOCGl_DTWK3_BOmIKlJvg":{"text":"Food was very bland and nothing special. Had pulled pork poboy and crawfish mac & cheese. ","useful":0,"cool":0},"jSl_v0NL8MCGtnzFv9_npg":{"text":"Subpar. This place is dead every night but Friday- I guess it could be poppin' on Saturday","useful":5,"cool":5},"Z0IYlEj-FQJ1rVwKhg4j-w":{"text":"David  and Johnny and T  were amazing!!! How you can come to New Orleans and not try this ","useful":1,"cool":0},"Xlu0XZzeATXwdE55YqXZBQ":{"text":"Amazing! The food was phenomenal! Our server Allison was so knowledgable of the menu and h","useful":0,"cool":0},"U1hso5qrg-Wy8lrS7doWgw":{"text":"don't eat here. its extremely overpriced for meh food that will make you feel pukey and si","useful":0,"cool":0},"JVtG45QK_WGL7oFRi7DviA":{"text":"Amazing food, amazing bartender. Julio was super attentive as a manger to make sure my exp","useful":0,"cool":0},"JBnERV5OxAIc0M99QR5g8A":{"text":"Service was not the best and the craw fish was average, but the alligator tail was yummy.","useful":0,"cool":0},"Yi-0kjA7BOBaRzFYlm2WQA":{"text":"I give this place 4 stars due to location and the awesome customer service we received at ","useful":0,"cool":0},"NslOiaRbsbTVetBQrzigNw":{"text":"Bartender was friendly . Had only the crawfish and it was good . Great music in the backgr","useful":0,"cool":0},"P3NtNVi_BLp7goj_tI4mxw":{"text":"Service was very friendly, and food was good. I had the Politician's Special, which includ","useful":0,"cool":1},"zf_U1Y9djTkLcxRsUMbAug":{"text":"There's only one reason this place is in business: it's owned by Channing Tatum, and bache","useful":0,"cool":0},"Z8qrUHvqGuvZCkYn_Jnivw":{"text":"They just revamped their kitchen and it is AMAZING. Please give it a try. The time we went","useful":0,"cool":0},"g_VBox2qbKj-z_-Pb5Rp5Q":{"text":"Delicious food!! Everything we ordered was incredible. I've been to New Orleans several ti","useful":0,"cool":0},"OvwD2OVpkBYHdsNB4W2LRQ":{"text":"Food was okay! .., but Lewis was amazing! Super patient and allowed us to feel welcomed an","useful":0,"cool":0},"lPymyhQxwx4Y3Jk_6IX78w":{"text":"This place is SO great! The bartenders and door guys are all very nice. NO COVER! Drinks a","useful":0,"cool":0},"Uld_hT1VeIzsS-Gl_qKndA":{"text":"At first I thought this was going to be like Magic Mike - you know because Channing Tatum ","useful":2,"cool":3},"n3ogWbAIOOSRW6ng-jipRw":{"text":"Fantastic food, drinks, and service. Crawfish was the best I've ever had. Great ambiance, ","useful":0,"cool":0},"kIkXCQY3HLGMEj7CUb5TSw":{"text":"Spent Fourth of July weekend in NOLA and called at 7 on a Saturday just to try our luck wi","useful":0,"cool":0},"qRtetsXyNmfM8TIDWmwuLw":{"text":"There is one thing wrong with this place. The staff was amaizing! Every one was beyond nic","useful":0,"cool":0},"qNmV15Se0Drd-UXrOc_DOg":{"text":"I went here during my friend's bachelorette weekend and it was amazing! We were seated ups","useful":0,"cool":0},"twLTSqbAGzmMVHuFcp62mA":{"text":"It's a fun spot that is definitely helped out by having Channing Tatum as the owner. I per","useful":0,"cool":0},"1QdMeZ5ur-i3WWPbmryDxg":{"text":"Let me start by saying the manager or whomever runs the servers Is RUDE. I didn't have a c","useful":0,"cool":0},"uJwhaqsXdtzovlNCr8WbCA":{"text":"Nice cool lil cozy place for an ice cold beer and a snack like crawfish nachos...highly re","useful":0,"cool":0},"XNYZZ6V8Yb9VHIWsWoYLPA":{"text":"We loved it here!  Went for a girls weekend to Nola and stopped by in hopes of seeing our ","useful":0,"cool":0},"rZbQSlqDRUai1BvMMTcvEQ":{"text":"Will is an amazing barkeep ...along with T and David kept it flowing well.  Food was very ","useful":0,"cool":0},"Cw2ptRkzMvyn6EGb7A2CgA":{"text":"I ate crawfish at a few places and \"Saints and Sinners\" had the very best and only $7 a po","useful":0,"cool":0},"XMTfn3GYME2j6SORRBTqJA":{"text":"*Excellent service from Kelsey, my all-time favorite bartender*\nMy team and I stumbled upo","useful":0,"cool":0},"1VdfzmYV7VcdvWKApC_NjQ":{"text":"The service is always terrific! This place is cute and they have great drinks and food! It","useful":0,"cool":0},"aq5SRgAkKYMZThLoNvvoqQ":{"text":"We ate dinner here for a bachelorette party, I love Channing but the food is awful and so ","useful":0,"cool":0},"Itcx1P03xDDEH-QT0Y48_g":{"text":"The shrimp and grits are to die for! Very creamy grits so good! I had Joannie, great serve","useful":0,"cool":0},"pjMkp1VdoAgyoYuqSj3lWQ":{"text":"This placed rocked and the bartendress was very quick! The music was awesome and very loud","useful":0,"cool":0},"P08sazae7GX9QAblAQa9RQ":{"text":"We made reservations for my daughters 21st birthday this past weekend.  The manager, Drew ","useful":0,"cool":0},"9n-BreWJrjIzWCmzbQoRIg":{"text":"The only place that we could find crawfish everyday and it was really good.  The oysters a","useful":0,"cool":0},"Mb5jrAFQUxqmb3OXCht07A":{"text":"Omg first time ever in New Orleans and my mom brought me here! Service was excellent and K","useful":0,"cool":0},"IqQf9KfFs9HpfOAPUd6CtA":{"text":"Kianna and David are the best!!! David had the best music and Kianna is the best waitress!","useful":0,"cool":0},"IT0D6qDgBAxjoyY7jR_WrQ":{"text":"We had a very large party of 24 last weekend. We had made part of the reservation online t","useful":0,"cool":0},"AH408AbRftZHWML2dc9tgg":{"text":"Ate here with a group of 7. There was a large bachelorette party that arrived before us an","useful":0,"cool":0},"-yw5xIHGrWz-dvYvjUt6YQ":{"text":"This is a restaurant and bar and club.... supposedly OWNED by celebrity Channing Tatum. \n\n","useful":0,"cool":0},"BkB9FX8SgqpE8jZZyNskMw":{"text":"Horrible, horrible, horrible. I reserved VIP bottle service for myself and three friends. ","useful":0,"cool":0},"2aP2ifyv2Z661cEk1cvFMQ":{"text":"Impeccable service - David was incredibly kind and knowledgeable of the area (gave us some","useful":0,"cool":0},"A4DEAtY2setIDw2zpF2aew":{"text":"My friend and I went to this bar mostly for the same reason as everyone else--Channing Tat","useful":1,"cool":1},"g7y301zciB2n4za8edlCtg":{"text":"Nothing special......  The only difference between this bar vs the rest on Bourbon Street ","useful":0,"cool":0},"OcBZJeNoEBokXv-2QW7QDQ":{"text":"Very disappointed!!!!  Came here last year for Mardis Gras and had the best Crawfish I've ","useful":0,"cool":0},"qpBiOkfL-yOI2H2fqDEtcQ":{"text":"Waiter (David) was very good. Manager, T, also entertaining. The issue was the ambiance an","useful":0,"cool":0},"56dQSEyro-DMjqw_VIaEPQ":{"text":"I enjoyed my dinner at Saints and Sinners.  The location is prime, it is right on Bourbon ","useful":0,"cool":0},"ekCd5MSNGKXZiqyRMu-Mjg":{"text":"My husband and I had been dying to attend this restaurant ever since Chan opened it last y","useful":1,"cool":0},"zriNkFKU64Bp2KXWSA7bVQ":{"text":"Standard Bourbon Street bar. I wasn't really blown away by anything.\n\nI thought that the C","useful":0,"cool":0},"A_2_mM6o-x8u2yZeScqF0A":{"text":"I was extremely disappointed with the service. I took my boyfriend when he was in town and","useful":1,"cool":0},"J7oZ536TIlQIoPyfyAn5jA":{"text":"We had a fantastic experience! From California and Montana so we are new to crawfish, but ","useful":0,"cool":0},"lud669gaHDVGkLKtsIfvQw":{"text":"Yum!! Try the BBQ Shrimp and Grits with GOUDA grits. Delish. Great service too. This isn't","useful":0,"cool":0},"ORMbJwCkTUQKJBTs742G3w":{"text":"We made a reservation on the phone and received a confirmation via email. I read through s","useful":0,"cool":0},"-6G0VwodAzGGwTAuBlq6IQ":{"text":"The tarot card reader down the street directed us here. I guess she's pretty good because ","useful":0,"cool":0},"mXL6yd8Do5p7ZcglB63E_A":{"text":"So, as a Channing Tatum fan, I really wanted to try and like this place. :(  My friend and","useful":0,"cool":0},"Byak0FVgpzP0ki0xfFpJwQ":{"text":"Great classic burger and tasty fries. Really wonderful service!! Very accommodating to a p","useful":0,"cool":0},"Ugt6ovXhhCSnd9eCZ3sWRg":{"text":"Came here for dinner...I was intrigued by the cook doing a crawfish boil right out front. ","useful":0,"cool":0},"Zk6fR8Rbrh_bNdmwrmcFJQ":{"text":"Fun spot. Come here after you've had a few drinks, or anytime if you're part of a bachelor","useful":4,"cool":2},"iUVcdsTUa9XekFIERbAcSg":{"text":"What an awesome place! Great variety on the menu and thee crayfish were cook to the perfec","useful":0,"cool":0},"82Jv_1_LuWB5UUqem7SPtg":{"text":"Saints & Sinners is a decent size restaurant located at the heart of the action on Bourbon","useful":0,"cool":0},"SKB4LB_eAQz0GE-rFOjJSg":{"text":"It part angel, part sinner. Its a nice little place, has great specials and had a lot of r","useful":1,"cool":1},"63SLiufdqNE-PFEelmZIkg":{"text":"Excellent service. Had to wait a bit to receive the meal(s) but it was well worth it. The ","useful":0,"cool":0},"BSO9drPNnXpjQSMtCQXUPA":{"text":"The best place for crayfish on Bourbon Street! We were greeted by the manager at the door ","useful":1,"cool":0},"0swS2RsJ5nGLU43e9_1uvA":{"text":"First time in NO. Joe at the bar made me feel at home and welcome. We tried 3 bars before ","useful":0,"cool":0},"CTrs7OdHocnyjG9AFKFKrg":{"text":"The staff here are the nicest people who can find anywhere around. They were very accommod","useful":0,"cool":0},"fdmmp9WPXAFktRPORsnZvA":{"text":"Crawfish is definitely my favorite. And the crawfish pie is kind of crisp, much better tha","useful":0,"cool":0},"qt37hjxRTunazYT4UhNxeQ":{"text":"Overpriced, mediocre quality food, and pretty poor service.  We were there before the gran","useful":0,"cool":0},"Rh-kztM5CIlf3b6gMmyGbA":{"text":"I think I've found my go to restaurant for crawfish whenever I'm in NOLA. Saints and Sinne","useful":0,"cool":0},"8MwmyVAy4MphI-q75fwMmQ":{"text":"This review is for the night club, not the restaurant (we didn't eat food here). I was exp","useful":0,"cool":0},"yQ2Qu7i6vnN8yKdjtjt0_A":{"text":"Went in because the food smelt amazing and it was. Steph was adorable and an amazing barte","useful":0,"cool":0},"LrG_x8RysV-cqlOM7QvWJQ":{"text":"I love Channing Tatum so I had to go here and support him and tried his restaurant.  The c","useful":1,"cool":0},"Tzo-gsvMmMTuuSixzJPIFw":{"text":"Amazing!! Went early on a Sunday, delicious! Had the shrimp and grits! So wonderful. It wa","useful":0,"cool":0},"dia9wgB4mE5iOhlL1_Kjyw":{"text":"The best jambalaya I've ever had and David is the best host I've had in my many trips to N","useful":0,"cool":0},"ageBAjtw9gfwweI1BRlD3Q":{"text":"Our bartender David was awesome and personable! The place smelled so good of crawfish. We ","useful":0,"cool":0},"r9jgn19y1cQDEWCJzyEsCQ":{"text":"Best nightclub on bourbon by far. I came from Chicago for my bachelor party and we were lo","useful":0,"cool":0},"mqRMqXY8UV_enBrI-yE6Lg":{"text":"David at the bar has it going on! That's good, comfortable service. Great food good drinks","useful":0,"cool":0},"CzcXYYlAgBUNe-l-uyCIXw":{"text":"Don't order the crawfish. I am sure they have better options. Pictures i saw on yelp look ","useful":0,"cool":0},"YbZfMgp0F9QfDidLfbB3LQ":{"text":"Slowest service ever. When we walked in the hostess was confused when multiple parties wit","useful":0,"cool":0},"vPRZ5KryKubEdPWP426PCA":{"text":"Good location but overall bad experience. \n\nStopped for an early dinner after seeing the c","useful":0,"cool":0},"qpJIcWJxTxSNGLx_Ii_10w":{"text":"Don't think your coming to catch a glimpse of Channing Tatum. According to the staff he ve","useful":0,"cool":0},"uIU_HMFs73dXVsnKK_KFzw":{"text":"This is a great place for lunch. Good music. Circa 2000-2010.  Portions are perfect. Drink","useful":0,"cool":0},"gnn_z1EYrTmjbKe7kuWhwg":{"text":"We go to some great cajun restaurants and this not one of them. The gumbo was inedibly pep","useful":0,"cool":0},"9g7mxRxbH48aOK23GVTfvQ":{"text":"The service was really, really slow.  The staff was VERY friendly, but even though we were","useful":0,"cool":0},"nqxdKd_WEWth74HKblduhQ":{"text":"First time in New Orleans and heard good things about this place. Great service from David","useful":0,"cool":0},"0IcM8_cIlKJGnjVEL8VBRQ":{"text":"My wife and I eat hundreds of pounds of Crawfish year so I thought that there would be not","useful":1,"cool":0},"5VbsbFxTXgLtVMwmel-3VA":{"text":"Vibe- so cool!\nEnvironment- love it\nDecor- omg!!\nPrices- fair\nFood- decent but don't spilt","useful":0,"cool":0},"udvwfqB-jWSXR987woI7Xg":{"text":"The food was fabulous!!! We had the oysters, alligator tacos, alligator bites, gumbo and s","useful":0,"cool":0},"rTLcAw7POBDLltPb7k5S8g":{"text":"This place is the worst. \n\nI recently went on a road trip with several other friends to NO","useful":3,"cool":2},"JhpWUyVAgyQvZ-1RB_q1fQ":{"text":"Came here not once, but twice during Mardi Gras! Saints and Sinners boasts that they are t","useful":0,"cool":0},"212-R3fS9DJFu_AviM357w":{"text":"Cool atmosphere and good food.  Had a party of 13.  They put us upstairs and we were treat","useful":0,"cool":0},"vf2iqeGFrp_WvHiDgEf4Wg":{"text":"We stumbled in hoping that Channing Tatum would be in.... he wasn't, however we got the se","useful":0,"cool":0},"Cpa3PQH3R-l_xYczjN7Ngw":{"text":"The food wasn't really to my taste. Their salad was decent. We came for the crawfish boil,","useful":1,"cool":0},"wOuKpQoLENcCcUuAfZZ6fA":{"text":"David, the manager, is PHENOMENAL. Terrific. Can't find anything better south of the mason","useful":0,"cool":0},"y3bXmMGZzk8yDIbR-OBiPw":{"text":"Came here twice the weekend we were in town. Walked in because of the crawfish boil. Food ","useful":0,"cool":0},"rvjjzi6-qoNTVyyHcL3-xg":{"text":"Unapologetically terrible!\n\nAs with other reviews, we had a reservation, were seated promp","useful":1,"cool":0},"EvHhlb9Q5cx_wwnFFgOQ2g":{"text":"Sadly this place has gone downhill since my last visit 4 years ago. At that time you could","useful":0,"cool":0},"3OhYTSzuhUB0zJMN7u_KPA":{"text":"This place is great!! The food was amazing and the service was on point. I was there with ","useful":0,"cool":0},"IrfuzDYZDaC3bPbxMa3Xlw":{"text":"Loved the food and atmosphere and especially our server Steph! Great attitude! Truly one o","useful":0,"cool":0},"ru4e7hchWDAvEOk0J4vKqw":{"text":"I had the BBQ Shrimp & Grits, and it was ah-mazing!! Customer service was great! The resta","useful":0,"cool":0},"eHuPurCl4hvQ74WGMlA5Gw":{"text":"As good as it's going to get on Bourbon street. Crawfish boil and creme brulee were solid.","useful":0,"cool":0},"iriVpXdxew3t9fhCi06Owg":{"text":"Food was awful.  Should have known when no one was in there to run.  Got the grits and BBQ","useful":0,"cool":0},"CfbioBZsiUrFDzR05oN19w":{"text":"Food was good. We tried the charred oyster, fresh oyster, gator tail, crawfish pie, jambal","useful":1,"cool":1},"A-wq7pW8wUzY_UcJyyOAzQ":{"text":"Was pulled in by the Crawfish Boil right outside. They were so awesome and the chargrilled","useful":0,"cool":0},"-1Sh_mdZ_AWO94sbymx7nw":{"text":"The service here is terrible. \nWe had reservations and were seated right away but that's w","useful":0,"cool":0},"d6n9PpBnE3NQb3kni-yEfw":{"text":"The food was amazing!! Service was great. Would come back and recomended it to friends.","useful":0,"cool":0},"FX9KksQnAqsFyJ22NrLqfg":{"text":"Im from Las vegas and was in New Orleans for New Years Eve and Saints and Sinners was my G","useful":0,"cool":0},"T5APTr2O4KeBxfPXOKu5-A":{"text":"Terrible experience at this place.  Came here for my best friend's bachelorette and was ab","useful":3,"cool":0},"mtiNx-xPCf4FkMOVkHNuAA":{"text":"David.... amazing service, amazing food-kiddos to the kitchen staff, amazing conversation.","useful":0,"cool":0},"1IFrrlpa2noE0bTH-nBUnA":{"text":"I love the music here & the staff is great. The make good drink recommendations & Chad is ","useful":0,"cool":0},"yuscwp4WjWIBckN6txCLDQ":{"text":"This was a good little find on Bourbon Street. I was kind of wandering up and down  decidi","useful":0,"cool":0},"nXhFUv18IlN3iu4alo3CMQ":{"text":"First...Channing Tatum.\nSecond...this small establishment is a relaxing break from the mad","useful":0,"cool":0},"y6abLaY6nDFZi06hGtASwQ":{"text":"I went for a CMYE event and was pretty impressed. The staff was really nice, and the food ","useful":0,"cool":0},"f1-rPPzTMje-ljjPX3ITTw":{"text":"Had the triple combo appetizer ... delicious ! Service was excellent . Definitely deserve ","useful":0,"cool":0},"zdBuihY15rAp1MKf0lUKbg":{"text":"Overrated & generic. Maybe the expectations were set too high.\n\nSituated in the middle of ","useful":2,"cool":0},"78UZXaMaKKC_YHeZv3RI8Q":{"text":"Best part of the meal was our adorable waitress! Food was ok, I think most people go for t","useful":0,"cool":0},"YLO0lKZO1vFc9cqX3oaZRw":{"text":"Omg! This place is sooo good. There crawfish platter is sensational. I couldn't get enough","useful":0,"cool":0},"D1NSzxWvIeMThtCt09ztrQ":{"text":"Fantastic place for dinner and drinks. Everything was fantastic. Wil makes am incredible I","useful":0,"cool":0},"LMfk6ffg_OpTb75xudccXA":{"text":"What a fun place! The decor is rich, reminiscent of an intimate boudoir. Chris (our waiter","useful":0,"cool":0},"CbWlCTAxhypVwgPtdBZT4Q":{"text":"David - There are not enough words to describe how AWESOME David is. My boyfriend and I we","useful":1,"cool":1},"EQJHM1lqYd8yaxAEnhV-iA":{"text":"Slow service for dinner. Waiter was more interested in talking to the one other table of c","useful":1,"cool":0},"M1gv6UeQKOffiwjyCRNhCw":{"text":"The portions are HUGE, the drinks were great, the food is fantastic, and the service was g","useful":0,"cool":0},"R3JsLGG9qARIP3uXRV3CGw":{"text":"Celina was the bomb!!! She made sure we were accommodated properly even though we did not ","useful":0,"cool":0},"TpMjh7PFmvgdb3wmae7-fQ":{"text":"I attended a bachelorette party (you read that right!) and of course the ladies wanted to ","useful":1,"cool":0},"EmAI8OyXiJiTMFo0zzEJew":{"text":"Had a great time on our Thursday night. Great service and the food was really tasty. I wou","useful":0,"cool":0},"6stiw6OZL5MWX0xchUyHzw":{"text":"Stopped in here on May 28th around 7-ish and the place was full so we sat at the bar. The ","useful":0,"cool":0},"KGepUMh031XSQ5CqRg5BbA":{"text":"poor quality food, mediocre service and shitty decor. keep walking down bourbon street, wo","useful":0,"cool":0},"6Qsg1eTXL-Vj58T9aeJ5Ig":{"text":"I came here the first time in 2014 and it was a restaurant with no food but they had a hug","useful":0,"cool":0},"jBKvw3l1vqNoHUUpI5QxVw":{"text":"Overcrowded and a tourist trap. Even for bourbon street. Decent music, but couldn't even m","useful":0,"cool":0},"7SC-tl6SSBqlDErUCo4Pvw":{"text":"My party and I visited Saints and Sinners Saturday night for a bachelorette party. Based u","useful":0,"cool":0},"_SocIkkFhzp8BTxAuetWsg":{"text":"The best meal I had while in town. Hands down. Crawfish for sure. Thanks you Victor for co","useful":0,"cool":0},"1O0LouoAKxKYTGLBmFDDQA":{"text":"Had the crawfish with corn, sausage, and potatoes....EXCELLENT. Only drawback is it was on","useful":0,"cool":0},"dSJjSE6_r3Tv0I6CUUcuUw":{"text":"We got to New Orleans on a Monday night. Since that first day we have had HORRIBLE experie","useful":0,"cool":0},"qqhVT1BLYFYuPa79kou1ow":{"text":"If you're walking down Bourbon Street during the regular hours of revelry in the middle of","useful":1,"cool":0},"wIfvunank2diD_I63VK9Hg":{"text":"We tried to go here for dinner but the \"host\" wouldn't get off the phone and seat us, so w","useful":0,"cool":0},"WX9tBqKTEzQ6qfQpU7UrCg":{"text":"Bartender was a dick to customers because he can't handle being busy. Way to go on making ","useful":0,"cool":0},"qjgKatLDceZ7a6Drt3jOQw":{"text":"Best food we had in New Orleans.   The crawfish pie was delicious.  The alligator bites we","useful":0,"cool":0},"8afL-K7vqZjlAcR7JiMJWg":{"text":"Great place for a date night, good food, great cocktails, nice patio facing bourbon street","useful":0,"cool":0},"Xsa6bTNapqOp8VtMSXP0Tg":{"text":"Absolutely the worse food I have ever eaten. The grits were watery and the shrimp under co","useful":0,"cool":0},"XYHpVrmA4nlDPXsRG93j5A":{"text":"Last night I visited this restaurant with family and friends. We ordered the St Margaritas","useful":0,"cool":0},"rwFY00leEa9XC7fETLtm_Q":{"text":"Lunch during Mardi Gras,  restaurant was empty, yet, bathrooms were disgusting, service wa","useful":0,"cool":0},"w3Bhm8qzvrupWDb_i8TUvA":{"text":"Ate here last night and the Sioux chef, Tori, came out to visit. She shared her love for f","useful":0,"cool":0},"7tFbzcMRlQvOPmG4rI0JUQ":{"text":"Visited in the fall of 2012.  Had not been open long.  Food was pretty bad....and in New O","useful":0,"cool":0},"GrbLzcu_ZHoxrJtWVwMlOg":{"text":"That crawfish pie tho. Great service from the wait staff and managers. Crawfish reading do","useful":0,"cool":0},"h8l1K-xqxv71O4ym3qRzKA":{"text":"My party is in town for Essence Fest and we decided to make reservations to check this pla","useful":0,"cool":0},"nhKz6n1FImvvsRopf15uOg":{"text":"Outstanding crawfish.  The spice recipe is on point. Julio is the manager, super nice guy ","useful":0,"cool":0},"HKhyeBWMw4GiWvDHGmDq_w":{"text":"Came here the day before Mardi Gras (Lundi Gras) and had a blast. First of all I love the ","useful":0,"cool":1},"QgaJNIipjD2_xCWFEF7xeg":{"text":"Made a reservation through opentable for 7:15.  At 8:00 the drinks we ordered were still n","useful":0,"cool":0},"AdYsl1Tw5Qm1mjJmX60aCg":{"text":"I revisited this place during my most recent visit to New Orleans.  As always, the service","useful":0,"cool":0},"BJ3gCLRS68SsfYT0s9mJTQ":{"text":"The Mac and cheese was so good! The service was exceptional! We will be coming back tonigh","useful":0,"cool":0},"cFSdTFaE-GDWLametCA5nw":{"text":"I arrived at my bottle service yesterday evening to celebrate a bachelorette party for a c","useful":0,"cool":0},"tIu8xXWMy5GrstVcAUQneQ":{"text":"BEWARE POSSIBLE CREDIT CARD FRAUD\n\nYesterday I called the restaurant to make a reservation","useful":0,"cool":0},"ZDXKWUg73wLE2auxvctDZg":{"text":"S&S is fantastic!  Best part about it was Alison!  She's super sweet & really took care of","useful":0,"cool":0},"yOKYL5DnE3JhoaJlreIGZw":{"text":"In town for super bowl and in my opinion this is the only bar I would hang out at on bourb","useful":2,"cool":1},"xA-l0U2eENw4-rx1wA6zgg":{"text":"Happened upon this place for Sunday brunch. Food was fantastic...pulled pork was tender, d","useful":0,"cool":0},"uPbZcvUgrIX9fw44CXmkKw":{"text":"Wow the customer service here is beyond amazing!! \nFrom the second we walked in for our re","useful":0,"cool":0},"ODZx4eh7kKgepPRXuKyY2g":{"text":"As raunchy as a bourbon street bachelorette bar should be! \n\nWe paid for a VIP section and","useful":0,"cool":0},"d9cfEdL4JTL2HzWLHqgjyg":{"text":"I had a rad time here! You won't be disappointed. \n\nI was roaming around Bourbon street lo","useful":2,"cool":2},"wEkICEgxc5z89hEfgtQSQQ":{"text":"I was in last week Friday. Had the Chargrilled Oysters. Amazing!! They are so good. Some o","useful":0,"cool":0},"GMhebdhA7-liLgqDmyfUMw":{"text":"I had dinner here last night and it was my first meal in New Orleans. We had called ahead ","useful":1,"cool":0},"w7Dxaeuxh6vJKQ9uGis3VQ":{"text":"My Alligator PoBoy was absolutely amazing. I love buffalo, so of course I got a side of bu","useful":0,"cool":0},"laOOd4nBAP6_pUGYVn3tGw":{"text":"Nice atmosphere and they were boiling crawfish outside and we should've just ordered that ","useful":0,"cool":0},"FArKAxf8BhJMMgUCFKr2Hg":{"text":"Yes, I am aware that this lovely restaurant of Channing Tatum's is rated \"#1 Douchiest bar","useful":0,"cool":0},"MAgqWyDmTI99FpVN0Wxopg":{"text":"The food, atmosphere and service was amazing! My co workers and I went for a team dinner (","useful":0,"cool":0},"qlWRGhuYwNrhVVbeJ2oIzA":{"text":"I've been in this establishment a few times and they work towards producing a 1920's vibe.","useful":3,"cool":0},"kJdkANRMPv7RKmFHOBGcFQ":{"text":"This place sucks and is racist\n Great music, great crowd and vibe. I'm a doctor,  went to ","useful":0,"cool":0},"Xm45TprQgm0yB82qVvSTKQ":{"text":"Me and my girlfriend went here today and left immediately! We made reservations months ago","useful":0,"cool":0},"WxuABc055rkLRWx08lr8ZQ":{"text":"Absolutely the best place to eat and drink in New Orleans! I love this place!!!\nThe Bourbo","useful":2,"cool":2},"50WIlfGitd_NA1DpSj-ChQ":{"text":"excellent service! accommodated our needs with no hesitation! david was the best with help","useful":0,"cool":0},"oFLWVQ6iDS6EA4s9P9XFQg":{"text":"Great customer service! So delicious! Decent price and great tasting drinks. I just wanted","useful":0,"cool":0},"RWAuID8i2I5iHgBJ-8eHpA":{"text":"Where do I start...Saints and Sinners upon arriving was surprising. Red, stripper poles, a","useful":0,"cool":0},"teeZ3sPD1vfIZERxM6k4qw":{"text":"***The most important thing I can stress about this review is that I view this place as a ","useful":1,"cool":0},"G9oUdPZO49LHtrK4Ek0jMQ":{"text":"Coming from a native Louisianan, it's hard to find good Cajun food that meets your expecta","useful":0,"cool":0},"Ar4LmtasoSeNNQIbRjyRsA":{"text":"Best bartender in NOLA! My fiance and I came here for a drink on a thursday night. We just","useful":0,"cool":0},"i0NUCwqja3JGcXxuoAMQTQ":{"text":"Mixed reviews. We walked by this place twice and was drawn in by them cooking crawfish out","useful":0,"cool":0},"mUR5nZDSBvjZ_72QFv6O3A":{"text":"We only came in because the guys we were with really wanted to experience fresh crawdads a","useful":0,"cool":0},"bh-D-PL0hHRdxFUFBbg43g":{"text":"This place was  awsome!!. Stopped by for a quick beer and the girl running the place was s","useful":0,"cool":1},"_F4DPXrOqmuX81AT7skNng":{"text":"Jumbo mozzarella sticks! Everything we had here was amazing. They offer crawfish out of se","useful":0,"cool":0},"GKg10pSfMODuDg-s0q5olA":{"text":"Great experience and the food was delicious. Chris was our waiter. He was very respectful ","useful":0,"cool":0},"-Tzd9xEgwlNFXLCo-jr_CQ":{"text":"RACIST and NEVER RETURNING! My fiance and I walked up to the bar on a not-so-busy Saturday","useful":2,"cool":0},"w_IqwrkzEez4Y7F_IfubTg":{"text":"Great service and loved that they had fresh boiled crawfish!!!  Oysters were also good! A ","useful":0,"cool":0},"MSZ1Z7Qy3X05ZOEb8agMuQ":{"text":"The. place. to. be. They know how to make sure you're having fun. Inside is classy, but th","useful":0,"cool":0},"yd5wS-y39Sw_X7_NAOzPLQ":{"text":"Loud and gross- typical for Bourbon st.  The shrimp tacos were gross- hard plastic disc fo","useful":1,"cool":0},"nCAnUfK19hlFfsylyb7LlQ":{"text":"Visited Saints and Sinners recently during the French Quarter Festival and celebrating a g","useful":0,"cool":0},"otfiD-lv4pdfTq6HSx7Fxw":{"text":"Our group of girls intended on finding some food at the French Quarter Festival but we wer","useful":0,"cool":0},"yFbIW9pM51g_UqSN_VWOVw":{"text":"We had a large group come in for dinner and drinks. Our group had called ahead, and were t","useful":0,"cool":0},"MQrzaXHR4QBoIQFOikE-dA":{"text":"Stopped in with my sister and friends. The waitress was friendly and helpful. I ordered th","useful":0,"cool":0},"4f8Lff1lczSsAWQ3NRzQ6Q":{"text":"Came here for a bachelorette party and the service was so not good. Four people from our p","useful":0,"cool":0},"pq5OVhvjQ83eDGpIyFFpaA":{"text":"OK, before this trip, I had never heard of Channing Tatum.   We walked right up to his bar","useful":0,"cool":1},"X0c2rkQnO52LeUJkZsNSPw":{"text":"This is my very first trip to New Orleans! I couldn't wait to experience Bourbon street an","useful":0,"cool":0},"hVQ4mRuVeyWvfPyPzjtZoQ":{"text":"For now I'm giving Saints and Sinners a 3 1/2 stars. As of now, this place is a tad bit ov","useful":0,"cool":0},"WSW9U_7WG_SAgkT_TrBhSQ":{"text":"I have never been treated worse anywhere. Paid VIP to get on the balcony. The most rude ba","useful":1,"cool":0},"O4fnJVdmR92SsfBSZhd0WQ":{"text":"Even though the music was way too loud for dinner conversation, I liked this place. Came i","useful":0,"cool":0},"l_BJ5OIgsxubOmj7H8U9pA":{"text":"We walked out of this place last night. \nThe bartender was the rudest person I encountered","useful":0,"cool":0},"QinoyKo-mK0bLTSvhBtNlQ":{"text":"Very nice staff. The crawfish boil was exact to what i was looking forward to having.","useful":0,"cool":0},"QMu7FbcJwEd30-_knwBCIw":{"text":"Alligator biters were very good\nSinner drink was awesome\nCrawfish mc and cheese was awesom","useful":0,"cool":0},"i5AC0VUFBzPf8ZFMvBSY9w":{"text":"Went here for dinner with my family , food was great . The server was fantastic . My only ","useful":0,"cool":0},"fr4O7Ps7MBD5mpEuepZRqQ":{"text":"Saints and Sinners have two completely different atmospheres in the day and the night. In ","useful":1,"cool":0},"QtxFNUgWn_tUJ1A0gDn9TA":{"text":"The shrimp and pasta dish was INCREDIBLE!!! Best shrimp and pasta dish I have ever had! 5 ","useful":0,"cool":0},"R_0_wHyOpXRV3lfT7lmFvA":{"text":"The food was great! The service was lame. We were a group of 7 and gratuity was automatica","useful":0,"cool":0},"LNu6DLa_HJBLP0jyOmFGQg":{"text":"As a resident of New Orleans I know better than to try and eat anything on Bourbon St.  It","useful":4,"cool":0},"7YXHyokNMBOcCju8Nsvs_A":{"text":"This is Louisiana cooking...\n\nCrawfish boiling in the front, the guy boiling it was so coo","useful":0,"cool":0},"_VLrbOVAvEZLoJpO8Hao7w":{"text":"Amazing food , the host and bartender were extremely nice and accommodating , the craw fis","useful":0,"cool":0},"6p3Oro9bTBM39X19KgQJfA":{"text":"Went here for a bachelorette had setup dinner and bottle service online and spoke with Lin","useful":0,"cool":0},"IhxS7sHSXDYQZMeI0y8Zxg":{"text":"Services was good. Food was good but not much on the menu for kids. Would come back again.","useful":0,"cool":0},"MhpjRP3MrxyIRB6XEAxVyQ":{"text":"Hot n' Sweaty men all night long! Great crowd of people (both men and women)...now if only","useful":0,"cool":0},"KJXwbrIdCuURxg9bLVNqTw":{"text":"I just thought it was ok\nUmmmm\nMy friend is a fan of channing  Tatum\nI can take him or lea","useful":1,"cool":0},"P1xkbmoRUqQ57jyw-QN8uA":{"text":"Absolutely love LOVE this place!!! It's so sexy! It basically screams out SEX. After all, ","useful":3,"cool":2},"BUkFVcdf3K-2oryXEPoYqw":{"text":"Crawfish Pie in my mouth...so legit. Manager came over and ordered a round for the four of","useful":3,"cool":4},"FNGqkx-v7fsinGO6E41Raw":{"text":"Creepy place. There is an employee asking tips when using the bathroom. Service is bad. We","useful":0,"cool":0},"IN8dduCKQoMgGUQ12ylY4g":{"text":"Posto colorito e colorato. Chiassoso e divertente ma allo stesso offre del buon cibo.\nI cr","useful":1,"cool":1},"xSFLpsBB63P32J2_aKxTJA":{"text":"OH. MY. GAH! Everything here is amazing. Down to the cute cut-out of Channing in the corne","useful":0,"cool":0},"tkoy7Vcgmd562gGvW7lUdQ":{"text":"I went to this restaurant last Wednesday and it was hands down the worst restaurant and se","useful":0,"cool":0},"J3PPxKs7boobRkUMpecRIQ":{"text":"Listen here folks please don't waste your time or money at this \"establishment\". we saw th","useful":0,"cool":0},"aoiA1oL6koNIeTI4hgqzrg":{"text":"Great spot for drinks or food.  The crawfish are awesome and the drink prices are fair.","useful":0,"cool":0},"nq883KdvDMTsoez6evfhjQ":{"text":"Terrific food... waitress Jodi was was wonderfully attentive and made our evening SO much ","useful":0,"cool":0},"hT1rc3mf8UDSHODpqBE4IQ":{"text":"Hands down great place 5 stars. No doubt place hits the spot. Had the craw fish platter, c","useful":0,"cool":0},"Gj7FUfbsBI7eQyycTCmOFw":{"text":"Place was pretty good, excellent service. The seating outside is limited, but right on Bou","useful":1,"cool":1},"nZoCjZWQONCRtjLJ55OTmg":{"text":"No stars, is that an option??? Worst place ever... started a fight with us 50 year olds...","useful":1,"cool":0},"_w8-Tk67_zpp1wLGODqaoA":{"text":"The best shrimp and grits I've ever had! The barbque shrimp was luscious with just right a","useful":0,"cool":0},"gViUpAIIYOUWCdECEya-3w":{"text":"We came as a party of 15 for a bachelorette party all the way from Idaho only to be disapp","useful":0,"cool":0},"jPkK5Mmovs3j6LYalh1R_A":{"text":"Bad...just bad. I should have taken the bad reviews a little more seriously and just went ","useful":3,"cool":1},"I993eVsLGXS2jbZ6isZFJg":{"text":"Shame on this business for using Channing Tatum to increase business and not delivering! S","useful":0,"cool":0},"f7NyS9xsMzxWkBUhTmW7RA":{"text":"This was more of a seafood place, but I had a burger and it was outstanding! The other par","useful":0,"cool":0},"U5A4WZH9Pji_sfzvDRJ1bw":{"text":"Great food and service. They are located right on bourbon and the crawfish boiling outside","useful":0,"cool":0},"-R2GtgqHd6h3anhQqonuwQ":{"text":"I had high hopes for this place but unfortunately it came up short. First thing is it does","useful":0,"cool":0},"levoZ6mTayp_Idq7GGzxdg":{"text":"We stopped at S&S for some lunch early on during our trip with ~12 people, and they were q","useful":1,"cool":0},"123V8RfBTu6kKa2xYeGCdQ":{"text":"I really can't believe I didn't review this place sooner. Came here in August with my best","useful":3,"cool":2},"HalkHT_OMw-POwFTMRcg3w":{"text":"Crawfish platter!! \n\nAfter walking past this spot for a few days I had to pop in to try th","useful":0,"cool":0},"bonpC1E9oHo9B3gBuHVKHA":{"text":"Our server Jodie was amazing!!!! Attentive, funny, and made it the best birthday dinner ev","useful":0,"cool":0},"GAX1LRj2ZDeta7AfKTsSHw":{"text":"The reservations were fine and are seat time was OK. We waited about 15 minutes before som","useful":0,"cool":0},"l8ZkTjknsorOK-TAOH8GWQ":{"text":"Amazing food. Very friendly wait staff. I forgot my phone charging at the restaurant. I re","useful":0,"cool":0},"HE_pJYBF-CsuHFylAsYoyA":{"text":"Great service! We had hoped Channing Tatum would make a cameo, however, he did not. Otherw","useful":0,"cool":0},"MyB3_nI0RwZXpZJc5k3tDQ":{"text":"We went to Saints and Sinners for my bachelorette party, paid for bottle service, and it w","useful":0,"cool":0},"3-3nwBOCuLxeysclW0qG3w":{"text":"Great food, awesome specialty drinks, friendly staff and beautiful old New Orleans decor..","useful":0,"cool":0},"4WK1KwWSH0YVe7mLKdSmQA":{"text":"Soooo me and my friend a came here for Mardi Gras and it was a group of 9  and we had a bl","useful":0,"cool":0},"_yjvjuNOatsHQ_Xn_5gRFw":{"text":"Horrible service and a lot of mixed matches from staff about their policies. I wouldn't re","useful":0,"cool":0},"MwawI56iFobvzuB27ujNVQ":{"text":"Food was really good. The timeliness is the service was bad. 45 minutes to get food was ex","useful":0,"cool":0},"4Ft20TAyCmFkL5D-a5U4ZQ":{"text":"You know I love me some Channing Tatum baby, and when I heard that he was the owner of Sai","useful":2,"cool":0},"hwGPg5Yg7J8zXzxaQNV7PQ":{"text":"Bartender was was very entertaining. He kept everyone at the bar laughing and we really en","useful":0,"cool":0},"UA2V4lB-GP6IxddWSynaOQ":{"text":"The staff is great...super attentive but the food is only ok. It's a great spot to grab a ","useful":0,"cool":0},"-nR80r9Cwp36451IgeTiHQ":{"text":"I arrived at my bottle service yesterday evening to celebrate a bachelorette party for a c","useful":0,"cool":0},"FS26QajOtl05ZePD1sBXvA":{"text":"Food is good, but music blows a peener bigger than Channing Tatum's. Service receives a gr","useful":0,"cool":0},"kD2iV76og5OfK70Pe0TZrQ":{"text":"First off our service was shitty! And even after that my dish was BOMB! I ordered the home","useful":0,"cool":0},"UnzvFr_JeUZ4OYs-gTg78Q":{"text":"I'll say first that I've lived in New Orleans on and off for 20 years, but I'm not from he","useful":0,"cool":0},"zA3p2CRxbDRRoaabOn5LIw":{"text":"Ordered crawfish it was the best I had in such a long time. Everyone who came with loved t","useful":0,"cool":0},"qEFRBkTxRs3np6_xef8Iqw":{"text":"Really not my favorite as far as food/drink go - my margarita was not drinkable and my po ","useful":0,"cool":0},"i7pRd74dbp4tTGhtNoTt1A":{"text":"the crawfish pie was the greatest piece of food i have eaten in 5 years. also the sinner i","useful":0,"cool":0},"aZm92vmNze9Q0L58soHcyQ":{"text":"The place is pretty basic. I think there are a lot better options throughout the area than","useful":0,"cool":0},"9bkA8rY6CHWTV-dYGaEU7Q":{"text":"Terrible service, mediocre food. It was so bad we had to speak with the manager to let him","useful":1,"cool":0},"vUWTKx2qTGWkKmYX94ll6w":{"text":"David was an awesome server and the Crawfish pie will have you coming back again and again","useful":0,"cool":0},"GjLTs2HhB0w2tYe1Bi3XTQ":{"text":"My friend and I visited this restaurant last weekend. Everything seemed to be fine after s","useful":0,"cool":0},"WbH_Jj0hAVD2CUe4WYKGhg":{"text":"The place is very appealing both inside and out and well, that's about it.  I am for sure ","useful":0,"cool":0},"1_IaqhyypZ8R6qGdybifnQ":{"text":"Walked in for dinner was told had to have a reservation. Left, called the number on the ap","useful":0,"cool":0},"eoBhmVLTfCGCTiDUVFX8Ew":{"text":"Saints and Sinners is actually kind of cool.\n\nOk, there I said it. I am sure many locals w","useful":10,"cool":6},"OgrnOalp6fBfbeoNHd7PyA":{"text":"Came here for dinner before going out on Bourbon Street. I ordered the soup and sandwich w","useful":0,"cool":0},"teHxD1_EY53JByGdkxD-fw":{"text":"Not only is this place shitty, but they're super expensive for how shitty they are. The fo","useful":2,"cool":0},"gmZxhh_-zA3MBGzyT7Ee4Q":{"text":"Besides Lafitte's and The Funky Pirate, Saints and Sinners is pretty much the only other p","useful":12,"cool":11},"G6Fqxar6J9MT0ahtH4mfzg":{"text":"OMFG this place is amazing!!!! the staff is super friendly, they remember everyone, they a","useful":0,"cool":0},"LfT58J33XTcfZrs1X35Z3g":{"text":"Loved this place for the crawfish boil, crawfish pie and rum punch!!!  Food was fresh and ","useful":0,"cool":0},"DRzhct983dUlLnXi64H7PA":{"text":"Amazing food and Lindsay was super awesome!!\nCrawdads are juicy, oysters meaty, and everyt","useful":0,"cool":0},"mAMYyz7MovHfa_idHKhpBA":{"text":"This may have been one of the worst dinners we have been to in New Orleans. We visited NOL","useful":4,"cool":0},"t3qv-xNrOq-3kYGx0DiOHA":{"text":"Let me just this is a great place to just hang out and have some great food and drinks.   ","useful":0,"cool":0},"nw2to91Pj1n_KQBDGQC5vw":{"text":"Had a great time at this spot. Only had a chance to have a burger but it was definitely on","useful":1,"cool":0},"2Dt88vJuuCLW1PAowuQlHg":{"text":"Service sucked but the food was sooo good! From the gumbo, to the crawfish pie and pasta -","useful":0,"cool":0},"oxZTdhC03y6giphofu6-mA":{"text":"After being scammed at the first place I visited on Bourbon Street, I was pretty low and w","useful":0,"cool":0},"kHqHeZB-KQycs_4AiBkK3A":{"text":"The service was poor and the drinks terrible even though it was afternoon and they were no","useful":3,"cool":0},"yZbo3SWDVVtFiMFhMkdIhg":{"text":"This would of been 5 stars but the day we went ( Tuesday ) the service wasn't the best bec","useful":0,"cool":0},"H6tLeqSIRvz3Ehy5HJD5Xw":{"text":"tl;dr THE Packers bar in NOLA.\n\nStopped in at Saints and Sinners specifically to catch a P","useful":7,"cool":3},"4ZK5k4Xpe_2BCcAvcAQJTQ":{"text":"Great Packer Bar with fun Packer fans. The service was slow and the food was subpar. I hop","useful":0,"cool":0},"PXDC_faDUyYnwkRnNXvtMg":{"text":"The crawfish etouffee and gumbo were fabulous.  Michelle did a great job serving.  Fast an","useful":0,"cool":0},"gp3x71oDppLI5jNv0Vvkyg":{"text":"Excellent service from manager with the cornrows! Our group of 8 were seated promptly and ","useful":0,"cool":0},"_ZJOMh2GXtIJC0GwmS0HRw":{"text":"Meh. Not bad and not great. We did not eat here, but went in for a few drinks while stroll","useful":3,"cool":0},"9sMUqeV0P4nx0xjMWBLNOQ":{"text":"Had a reservation for 7 and when not everyone was there they sat us anyway which is a nice","useful":0,"cool":0},"gHEXkawAvTUjyESNyVbGmQ":{"text":"the restrooms not so great, but that is Bourbon Street.  if it is busy it just gets crazy ","useful":0,"cool":0},"U0g2aeFm2Z_EBgR3UK7WxA":{"text":"Lindsay was great, the food was awesome, & we enjoyed the cocktails. We will definitely be","useful":0,"cool":0},"UN-5XgABzeMPOGOFVjVp4A":{"text":"I had a blast at Saints and Sinners last Saturday night for my girls bachlorette party! \n\n","useful":1,"cool":0},"J_G2Q3CwYqGGi99uVMXGig":{"text":"This has become an annual outing for my wife and I. It isn't Mardi Gras without lunch at S","useful":0,"cool":0},"r3MhkQyUYRVZwMkYeHJPNg":{"text":"Came here on a Sunday night and it was amazing! They had delicious crawfish and po boys an","useful":0,"cool":0},"mKo3zYJfCfCrLrL9QFYZ2A":{"text":"Saints and Sinners is great for what it is: a small, cute place in the middle of Bourbon t","useful":0,"cool":0},"GcgB3053ReIeW9MMLv41NQ":{"text":"Oh boy....let me just say this was not what I was expecting. The restaurant was trying v h","useful":0,"cool":0},"h-9djvuyo1c6g1D6VZYI8A":{"text":"(01.12.19)Horrible service and a lot of mixed matches from staff about their policies. I w","useful":4,"cool":0},"WVWUnw9c8Z3urkwB_y-D2g":{"text":"Probably one of the worst experience while in NOLA. Obviously throwing Channing Tatum's na","useful":4,"cool":0},"t4X6SezPZszv9eHz2tKtAA":{"text":"David rocks!!! He was awesome and drinks were great!!  Go to place for a snack and a cockt","useful":0,"cool":0},"SYRIRDhaHK84ej4-BYx9WQ":{"text":"Mmmm gumbo. Came here on Halloween and it was packed but we got a table upstairs pretty qu","useful":0,"cool":1},"FFd_5IQgBW_3kSmyQJQ-vA":{"text":"Yet another stumble-into place that was extraordinary in NoLa. The inside isn't that surpr","useful":0,"cool":0},"nYpxCxMvcTMkFUcBwJUTfQ":{"text":"My favorite spot in NOLA! Best crawfish I had in town, it was so spicy it had me drooling!","useful":0,"cool":0},"xrTGojnyePKtR75_B0SUZQ":{"text":"The crawfish was a joke. Tiny and over cooked. And service was terrible. Even though we th","useful":0,"cool":0},"BYdPFunl-e1O9wovy61BAg":{"text":"Madison was the best waitress that I've ever had. Shrimp and grits were AMAZING! Great dri","useful":0,"cool":0},"lwF9hNEol8GukIlzlbGq7A":{"text":"David was a PHENOMENAL host! Went there on a work conference and he took excellent care of","useful":0,"cool":0},"2qjoDfT6EIn_xjcAUY8Utw":{"text":"The crawfish was so spicy I could only eat one. We were not impressed with the venue. Staf","useful":0,"cool":0},"nXhbhkqBSO42ipDovSkKVg":{"text":"Food was so-so as was the service. The hostess who seated us was nice, but the waitress wh","useful":0,"cool":0},"vuO0X7gpHJ4sK58TgvijjQ":{"text":"First off....who cares who owns this place. Is Channing behind the bar? Are you going to s","useful":3,"cool":0},"GU0TFdZXeFGfsG2MEUbJpw":{"text":"Channning Tatum I'm disappointed.... the food came out at all different times and the silv","useful":0,"cool":0},"Nhc6BttOp0vGBW452EmANQ":{"text":"Has the crawfish platter. The waitress warned us that it would be spicy. She was not kiddi","useful":0,"cool":0},"NaoXa9_UyqcdYQK2jYvFiw":{"text":"This was the best spot on Bourbon St. during our stay in New Orleans. During the day they ","useful":0,"cool":0},"ZNTG0KYCoNV9znXBfNm73w":{"text":"Fried Kurtz (curds breaded and deep fried) appetizer was great!  Food was comfort food wit","useful":0,"cool":0},"-F3gANIfIN_nEtwHHadU2w":{"text":"I had the Bar B Que shrimp and grits. Hubby had the the crawfish platter followed another ","useful":0,"cool":0},"J8EzesW3JSTD7pmHUXlixA":{"text":"Fantastic chicken sandwich & hamburger! David the bartender makes you feel welcome..incred","useful":1,"cool":1},"EYidZL2YYuO3bwHNoXWPgA":{"text":"A+++... Excellent... Amazing food, staff, service... Definitely a spot to check out while ","useful":0,"cool":0},"ykHwoKWePDaOiKGOQqbRAg":{"text":"Couldn't keep the bartender's attention long enough to actually make the drinks we ordered","useful":0,"cool":0},"4vAQ2BAa2A3_NPKW30Kj6Q":{"text":"Awesome food and excellent service. Dallas was an amazing server and treated us well! The ","useful":0,"cool":0},"Xuz-5RKrhPr_Ff-vauafOg":{"text":"The shrimp and pasta dish was INCREDIBLE!!! Best shrimp and pasta dish I have ever had! 5 ","useful":0,"cool":0},"FD8l1HbWUoKqWMP9mo5HSQ":{"text":"Zero stars!!!!! That's right. Went here with my sister in law looking for a fun time. I bo","useful":1,"cool":0},"eqnxvxR5UvseblIA8Ga3MA":{"text":"Solid crawfish platter and great service! I highly recommend checking this spot out if you","useful":0,"cool":0},"vA7DHr5GfrBgdF8N3Hdutw":{"text":"The shrimps and grits are well worth the price. My sister finished all her craw fish. Serv","useful":0,"cool":0},"Cd6oNMbavgn6V5LKtb_VHQ":{"text":"The red glow, coming from the door, beckoned us in...\n\nOnce inside we were met with red da","useful":2,"cool":0},"FyTo5pk1rBjE_VOXtgwxHA":{"text":"Staff was so friendly!! Great place to have fun on Bourbon ST! \n\nI went to S&S with a larg","useful":0,"cool":0},"PNbPbyXeEGd3Vsoq8vHt6g":{"text":"Quick trip to NOLA last week and stumbled (literally) in to this place. Couldn't have been","useful":2,"cool":0},"N3fSF3rYpiOQ_IDJrEHX3w":{"text":"Our waitress was amazing, the drinks were awesome, and the location is a perfect place to ","useful":0,"cool":0},"XFVwTzGB1l-RACvi-n_7nw":{"text":"Great food and atmosphere. They had the right idea cooking the food in front of the restau","useful":0,"cool":0},"GXPnWMlBjPdSmksR2vDPPw":{"text":"This bar is quickly becoming one of my bourbon street favorites. I've only been here a han","useful":1,"cool":1},"DzrLexqR2OqlPjYfVtLK6Q":{"text":"This was extremely SALTY! That's all you taste. We made a huge mistake by ordering two of ","useful":0,"cool":0},"CQza62q7CHNkgrkXRczsCQ":{"text":"I would go back to this place not only because of the delicious food but for the amazing s","useful":0,"cool":0},"02ne6jvMbNnD3sFK7OwGQg":{"text":"Came in for lunch, great atmosphere and food. David, our waiter AND bartender, was great. ","useful":2,"cool":0},"ZMySsyzcCwY1fMZbqrBrzQ":{"text":"There is no way to avoid this spot due to the alluring fragrance of fresh seafoods. I trie","useful":0,"cool":0},"oD228TIuECEWePmCpnC5FA":{"text":"Very typical of Bourbon Street restaurants. The food was really good. The crawfish pie is ","useful":0,"cool":0},"mlTHFkFreNE_9rBucmZapg":{"text":"We tried this place again and my wife s steak was luke warm. My shrimp and grits was just ","useful":0,"cool":0},"6m7jmbZpTaDqx3TVDv9Wow":{"text":"This place is garbage. Waited 2 hours for crappy food. The guy in front with the live craw","useful":0,"cool":0},"lQuC-feScv1QxbxS2WodcA":{"text":"This place is wonderful including our bartender and server David. He was very insightful a","useful":0,"cool":0},"pXhRKrGdrKJIaZKoUS1YPw":{"text":"Service was great and the food was delicious! Would definitely recommend stopping in for t","useful":0,"cool":0},"Iq0kIyDh9LpnBpkZWnQryQ":{"text":"Came for my daughter's 21st bday......it sucked Channing. Food was not good at all. No one","useful":0,"cool":0},"R2hR-aDX_anJK64Ed5y2XA":{"text":"Of course a place called Saints and Sinners in the French Quarter of New Orleans is a... P","useful":0,"cool":1},"iqgUppIoOyUELLFIdavx4A":{"text":"Thanks, Joe, but this is nothing but \"she said, he said\" at this point. Our behavior was i","useful":2,"cool":0},"Smbprl600PjDgfKiI6TtZg":{"text":"My wife and I got into town on a Sunday morning and were looking for a place to watch the ","useful":0,"cool":0},"ufBjhzpU4tv9yNvZ-NNGSQ":{"text":"this is the worst place ever. do not come. we made a reservation & were told there was a $","useful":0,"cool":0},"bZpee9VxOPh_W41FwGHt_w":{"text":"This place is awesome! Small and quaint with great service and food. Try the crawfish they","useful":0,"cool":0},"ilsuAR-Ezb9AVWB1aWnJTw":{"text":"I was very skeptical about coming to this restaurant! Being from Louisiana and frequenting","useful":0,"cool":0},"nSjTPdWgKdHoAaRgTfs2wA":{"text":"Went there during our stay for Mardi Gras 2013. I must say the crab cakes were FRIGGIN AWE","useful":0,"cool":0},"lXEQxGmsMv1T9EddEc8Xqw":{"text":"This place is one of the best on bourbon! David was SO helpful and so awesome to us. He le","useful":0,"cool":0},"3qJDJ_kw9-z-6CXLvSbynw":{"text":"Poor service and horrible attitude.  Waited 32 minutes for reservation and the lead person","useful":2,"cool":0},"yK87JIgvllmCWMyjZyuCQg":{"text":"The Crawfish Pie and Gumbo Poutine is amazing! The bartender, David is amazing! He had me ","useful":0,"cool":0},"r3PDIhk7XcbfHdOPaFeJqg":{"text":"In response to Joe P -  Would you mind sharing the security footage with me? I understand ","useful":0,"cool":0},"uyXbJKq-Bpljij3a9nNOgw":{"text":"I saw the warning reviews and ignored them when I suggested this spot to our bachelorette ","useful":5,"cool":3},"U6GRd0FG_67vzA_o0txaYg":{"text":"Food was really good. The timeliness is the service was bad. 45 minutes to get food was ex","useful":0,"cool":0},"EXyL2y0zuBWd8JHrRhmjuw":{"text":"We visited this location on our recent trip to New Orleans. It was nice to see after two y","useful":0,"cool":0},"7mnauBdigpSXUH7towQiZw":{"text":"Amazing Crawfish broil! So good.Fun atmosphere and good food. Friends ordered crawfish pie","useful":1,"cool":0},"c9-k1t40AXKhnQIOKrCbAg":{"text":"My phone was stolen out of my zipped, cross body purse from this bar. I was sober and payi","useful":1,"cool":0},"eXoBEQcLuQqBPabiCYWrIQ":{"text":"Just watched the owner 'roid rage out on someone. Made my whole party uncomfortable. Not t","useful":1,"cool":0},"h58k2LNHtoY1cI8D4x8D9Q":{"text":"The wife and I stopped in here for a mid-afternoon snack and we were pleasantly surprised.","useful":0,"cool":0},"ihD24ktBfvJ5HuEh8bXZNg":{"text":"This catches your attention from Bourbon St because they are set up to make the crawfish o","useful":0,"cool":0},"qZfwTBWen3S_iJlrgOm3qw":{"text":"The food was AMAZING! if you want your eyes to roll in the back of your head eat here; tha","useful":0,"cool":0},"RFD_2zC4rkotoz93taQwfg":{"text":"My friend & I came here for lunch & a day later I'm craving more! For starters we had the ","useful":4,"cool":2},"dAN9Voj0Koxy_-_09XQ2BA":{"text":"Initially, I was looking for a place that had steamed crawfish platters, but once We went ","useful":0,"cool":0},"CExTUbzZdsWfSIuQ6VtObw":{"text":"My family and I came here on a Sunday night September first. We went specifically for the ","useful":0,"cool":0},"8mjf1Qu-98Rg_hObyHe6yw":{"text":"Good but not great. How did you allow your restaurant to run out of ice cream on a June da","useful":0,"cool":0},"IqnQphDObUryB7Pj8hT9YA":{"text":"Pros: the crawfish was pretty good. And I was the only crawfish in town that we can find. ","useful":0,"cool":0},"bph8JPOIpVYoryc7B-4EMA":{"text":"Don't go by the reviews but ask folks and you'll hear that Saints and Sinners is an iconic","useful":2,"cool":2},"yX4GXYOf-spcruWFj5XwGw":{"text":"Honestly, I was really excited about this place because online it looked really fun and pe","useful":0,"cool":0},"8uJg6thX27aBNj9ZrTDV3Q":{"text":"I can't go to New Orleans without visiting here. The crawfish boil platter is my favorite.","useful":0,"cool":0},"NKvAotxLuYk2CtxmY9asPQ":{"text":"We didn't get a chance to try the food here but it's literally one of the best dance spots","useful":1,"cool":0},"fFbOa7XJChVKm1jMtuWOKA":{"text":"Walked in to see what it was like, since it's Channing Tatum owned. Floor was wet and stic","useful":2,"cool":1},"7FHqK6sm55e6e-E4jO2vNA":{"text":"Overall, the experience was so-so. The staff weren't unfriendly, but they seemed blasé at ","useful":0,"cool":0},"qJE2AAX5QR9pa3C2YduFmw":{"text":"I had went to New Orleans for my friends bachelorette party, We had went to Saints and Sin","useful":5,"cool":0},"fSdfrfCSc2SNhYG1xir4uQ":{"text":"Holy HELL! Sadly I wanted to try this place based on Channing Tatum....I know I know...wea","useful":2,"cool":1},"NDK_ftErDb4fa4vcLVqDBg":{"text":"Such a great spot! Drinks were really good, we got nachos and fresh crawfish, great flavor","useful":0,"cool":0},"mnjCFxIeAolplXL0QDwNOQ":{"text":"We stopped in because we are on the hunt for great chargrilled oysters while we are in the","useful":0,"cool":0},"AGMmwoqlaU07x9pvdFmA0A":{"text":"This was my second time coming to New Orleans and also to Saints & Sinners. They have grea","useful":1,"cool":0},"PQoxvyp3XSyQaTXRbna15g":{"text":"Best place for a bachelorette party. Staff was more than willing to help with our scavenge","useful":0,"cool":0},"uOjQtFU3I_UT4hLxtZhovQ":{"text":"Still chillin. I think I like this place to hang out. I used to do Last Call. Maybe I'm ge","useful":1,"cool":1},"DVYSsYd5lNs2xE5GHtrkRw":{"text":"Walking down Bourbon street, aka stinky version of the Vegas strip, I was just looking to ","useful":0,"cool":0},"6caI_RxL5JZqV7wX1dRNuw":{"text":"I read a lot of reviews about this place. And they run the gamut from \"time of my life\" to","useful":1,"cool":1},"ecRaYrmDBqCRFhFza7DdZw":{"text":"where are the tatum tots?!?! i came here for tatum tots. my friend john cöte promised me t","useful":0,"cool":0},"nGJ3f0t_hg00A_37XakAJg":{"text":"We couldn't walk by the opportunity to stop by Channing Tatum's restaurant located in the ","useful":0,"cool":1},"sK-IgP9IHONq1HPuEKzKng":{"text":"This place is a germ... Not sure why ratings are bad. The Crawfish platter was AMAZING!!!!","useful":2,"cool":0},"FEWJII-3oZzX7qtvykNXDw":{"text":"We stumbled upon this place while searching for somewhere to eat. The menu is pretty good ","useful":0,"cool":0},"WiSYoZOu6QGitUkgDNHc1w":{"text":"I must admit that one of the only reasons that we came here was because it is owned by Cha","useful":1,"cool":0},"Js6bQYn8hD10X7sr3tlB4Q":{"text":"this place is a joke. we spent $500 here on dinner and we were here as it became a club. o","useful":0,"cool":0},"3LHRXBP0rhsup2Yspk8LlA":{"text":"Do not ever reserve \"bottle service\" with this place. It is not bottle service. They just ","useful":0,"cool":0},"J45Hv163r4RzyyoTovUkvg":{"text":"I was walking down bourbon street craving a crawfish bowl. I haven't had one yet since my ","useful":0,"cool":0},"oIco2KpFD0V8xGTdn-2uNg":{"text":"My cousin was harassed by one of the bartenders. She asked for water, and he responded by ","useful":0,"cool":0},"7APlmfcXFAkKvVASjQfeqQ":{"text":"Best crawfish dish in town. My husband and I are major foodies and stopped in for a drink.","useful":0,"cool":0},"wNVei-KDuBFuegdeyaCVNA":{"text":"One of the douchiest bars on Bourbon street. Which is no easy feat. They gave a friend of ","useful":4,"cool":0},"CJ6GMNwKjO_KwONlrULesA":{"text":"Me and 6 of my girlfriends came here for dinner, located in the French Quarters.  We had r","useful":1,"cool":1},"izxBpWYPtoQ-MvFQZ9S90A":{"text":"I generally avoid restaurants on Bourbon Street, but Saints and Sinners has a very interes","useful":11,"cool":9},"BwWEHG3W_Nez2T3mpVqb5A":{"text":"Worst crawfish I've ever had. Totally overcooked  and mushy. Manager wouldn't refund money","useful":1,"cool":0},"kBxPG1zbwREOSLoPYiasTA":{"text":"Absolute trash. This place could've been fun if they had new management. The dj was very n","useful":6,"cool":0},"vSouQzBMrapMsSfZtcw9RQ":{"text":"We came on a football Sunday and had an amazing time! Despite COVID we were welcomed to si","useful":1,"cool":0},"DJ88WWTNnhP0ZIH3XYpb_A":{"text":"Located right on Bourbon St. In the middle of all the action. As we were walking down Bour","useful":2,"cool":1},"5vQ4wgv23DxNrl-o4DfgxQ":{"text":"I had read on Eater NOLA that this place had already had a soft opening and we were anxiou","useful":7,"cool":5},"7uktIgxbSYtHlwYcEoXRDA":{"text":"Had to take my wife to see her favorite man's bar Saints and Sinners to enjoy a drink and ","useful":1,"cool":0},"JU5CR3iAr7gQBc1DfXilhw":{"text":"Jambalaya was to die for. I could've eaten two bowls of it. My friends loved their shrimp ","useful":0,"cool":0},"C7DsKCCHBlXCcWw4bs_9vw":{"text":"Newer bar on Bourbon. It's owned by some Hollywood type, as if that's supposed to make it ","useful":1,"cool":0},"OVEc2iJWKxNfcd1v4nq6SA":{"text":"What an awesome spot! From the second we stepped in we were greeted with kindness. Startin","useful":0,"cool":0},"I5Z2j6-U94U6dp3G2Ze6hg":{"text":"This was the worst experience I could ever imagine. We came in last night for dinner. Here","useful":2,"cool":0},"CAkAh_yyIaWP9taslV0V0Q":{"text":"The Jambalaya was pretty good - not spicy for those faint of heart (and stomach), the gato","useful":0,"cool":0},"lyxXzRHDczfDHh4msOWoaw":{"text":"Great food! And even better service, with Kami as your waitress you will not be disappoint","useful":0,"cool":0},"nwVTtQF_NspVYQVSJ1HLGA":{"text":"This place is fantastic! Service was great and don't worry they clean the tables,l. Had a ","useful":0,"cool":1},"0JQxfPveB-KQUkz-wGfZmQ":{"text":"Went there on Fat Tuesday for a good meal and it was the worst service in the area. Small ","useful":1,"cool":1},"0GwXOiWdCQqdoT9dBnPJzg":{"text":"All I have to say is... juicy,  spicey , satisfying!! If you have or have not tried crawfi","useful":0,"cool":0},"G-G_COkmLR6oGLYJ66I97Q":{"text":"Staff is excellent. The waiter greeted us and seated us .The food was a authentic Louisian","useful":0,"cool":0},"nLyd8tQZ5ocaJSm6elFEQQ":{"text":"Place was dead when I went in. Drinks were overpriced considering the menu says they have ","useful":3,"cool":1},"dKTxvUmJILbxTLwqYlAOaA":{"text":"Delicious crawfish, friendly (and patient) staff, great music, and beautiful bar! We had c","useful":0,"cool":0},"dK0PSMDNOX70yLks8qFj2A":{"text":"Wish I could gove zero stars & will never return. Granted my friends and I were very intox","useful":0,"cool":0},"k_iCd2I7gY79jPGNNX31YA":{"text":"My friends and I all stopped here for our dinner for one friend's bachelorette party. From","useful":2,"cool":0},"-tFbnBde74Q7JZJYg0Gmtw":{"text":"On a positive note the chargrilled oyster and crawfish pie were very good! But the jambala","useful":1,"cool":1},"fZZioVw59ieCQQOh9twKrw":{"text":"We had a great time at Channing Tatum's restaurant! Our bachelorette group was pretty big ","useful":4,"cool":2},"DejmZ3bnhGkQTeXT1UZLHQ":{"text":"I was in NOLA for a bachelorette party (16 girls) and we came here for dinner / dancing on","useful":1,"cool":1},"BOKQDa4WHH4Nu80uuvODAA":{"text":"Great spot for crawfish.  I had the charbroiled oysters...i dont think they were charbroil","useful":0,"cool":0},"wMwC8PTbztGvHXs0uMf5ug":{"text":"Total disappointment. We went on a busy Sunday in the French quarter. This restaurant was ","useful":1,"cool":0},"alv0Yq56XQRCFK5ZgPG4Dg":{"text":"My friends and I went here after a spooky tour this past Sunday, around 10-11PM? It wasn't","useful":1,"cool":0},"DfSjQgfCDc9_JrL0Of5Sjw":{"text":"Gator nuggets and sinner drink. Service was casual/ down to earth. Food was ok, the drink ","useful":0,"cool":0},"lqUfh4HtADUg3EyUoaz-zw":{"text":"I'd give this place ZERO STARS if I could.  I'm not sure how Channing Tatum aligns his a n","useful":1,"cool":0},"WdIXyn0fdn2I9MChCT5u-g":{"text":"Popped in to grab a drink and eat, figured if Channing being part owner and Fluffy said th","useful":0,"cool":0},"i65mGq1l61vXjHPbA51xGA":{"text":"Hands down the best service we had in new orleans! This is a place where litetally everyth","useful":0,"cool":0},"CIpecnaGEfHSMc10dOasjg":{"text":"The food was absolutely amazing!!! And the drinks were good. The waitress even gave us a d","useful":0,"cool":0},"QRskPz3STAmYayJS335xnQ":{"text":"Absolutely amazing!!!!!  Great food and unbelievable cocktails. I loved the Cajun Sinner, ","useful":0,"cool":0},"irgOlAQ1uUve9RWXbiZbGg":{"text":"Well....well.....their menu mostly had crawfish dishes, a mac/cheese you can add a meat li","useful":3,"cool":0},"3u3OsgVGurn_9Kf0V-1lMw":{"text":"Coming to NOLA during the winter season, I wasn't really expecting to find crawfish boil a","useful":5,"cool":1},"tqea0JJ9J51aNMKLAzabMA":{"text":"5 star review because Kasey was cooking up what smelled like the best crawfish in New Orle","useful":0,"cool":1},"LeGC9gXoYFvrXxao-4A8Jg":{"text":"We were there around 2pm on a Tuesday-NO WAIT! I have 2 words---THE CRAWFISH!!!! OMG!! The","useful":0,"cool":0},"8K17M-609YPzEEf15p_oMA":{"text":"The crawfish, the mozzarella sticks and the charbroiled oysters are DELICIOUS! And ask for","useful":0,"cool":0},"_29tO015SPO3cVKULWLx_A":{"text":"We wandered into this place to grab a bite to eat knowing nothing about the joint. It turn","useful":0,"cool":0},"gl9cl7AufPupzueyM_OFpw":{"text":"We came here last night for a bachelorette party and I've honestly never had a more disast","useful":0,"cool":0},"SJCYbvnKx9JJ6YCZM85JZw":{"text":"Absolutely one of the worst meals we had while in MSY!  Crawfish were to small to even mes","useful":0,"cool":0},"0DVxnWrQn95J2dEjt9oafw":{"text":"Highly recommend, great service and great food . Good music , not loud. Try Crawfish platt","useful":0,"cool":0},"ZQsYHnGaSdz2lgLuT130BA":{"text":"The only difference between Saints and Sinners is that every saint has a past, while every","useful":13,"cool":8},"MpmYUxz0ddItUq9jDYzl1A":{"text":"Well this was our first and last time going here other then freezing cold the menu was not","useful":0,"cool":0},"XazfXKs2BaQfqJv0OIOg1Q":{"text":"Wow. Downhill over the last year or so. Jambalaya was cold, dry and nasty. Tvs were blinki","useful":2,"cool":0},"ozOEnt9SaFaSCr9KMwnd-g":{"text":"Great atmosphere and friendly staff! Crawfish platter was excellent! David  is great!","useful":0,"cool":0},"VTNM9qubra0RUG0TERcY0A":{"text":"If you're lucky David will be there. Best bartender in the French quarter. This place has ","useful":0,"cool":0},"G3GlXhTNVhpwg-6qvMbZfA":{"text":"Had a blast it was a fun and wonderful time here our server/bartender it David is one of t","useful":0,"cool":0},"vQHo_zlrRslwAp7nOXmvUQ":{"text":"Today I came across the ONLY place in NOLA that actually had crawfish. After 5 days of sea","useful":0,"cool":0},"VOJu6j9qgEPlLIuA46Q-sw":{"text":"Don't go. Please, don't go.  We had reservations for 8:00 PM, Friday night.  We were usher","useful":1,"cool":0},"h84d_lJQi9fxmITLzKy7lw":{"text":"This is beyond the best experience we have ever had here... our Bartender, David, was so f","useful":0,"cool":0},"3AkfZenmENJAflWZwCFioQ":{"text":"I was there tonight for a bachelorette party and it was horrible. We ordered nachos as an ","useful":1,"cool":0},"eOnzqjA3ltCQM0yndgTndQ":{"text":"Apparently, there is a cover charge to go upstairs for anyone who's not a regular. Oh, and","useful":4,"cool":0},"k6adMyzLTdHg0gIMGH7KdQ":{"text":"The menu is limited due to COVID. This should be noted if you have been before and are mak","useful":3,"cool":1},"BIKVhaWEcdZjqtmIIWKODQ":{"text":"Had a good experience at restaurant. The food was good but the gumbo had a peculiar taste ","useful":0,"cool":0},"aVEK0x5CslV2Png0hIK3eA":{"text":"Our waitress was great. And the food was tasty. I ordered the blackened fish and Gouda gri","useful":0,"cool":0},"Ilagm_5wXyg2qDmTPZgT5A":{"text":"I've been to New Orleans twice and both times I've been to this restaurant  & love the foo","useful":0,"cool":0},"nZMCg6yFpwF134Avz1Tc2w":{"text":"I'm so glad I came here . The food and hospitality was great . David was excellent ,funny ","useful":0,"cool":0},"Qz70Ec0emwrqch24Ya0eDw":{"text":"It was Friday around 1am when our walking of Borbon street lead us into the Channing Tatum","useful":1,"cool":1},"ofhcVz0-E1s4I_-TpdH7MQ":{"text":"Even though the place was packed and the kitchen and staff slammed, the staff took great c","useful":0,"cool":0},"mrIxotZ-ZGRwh2GG_l7ucQ":{"text":"David the manager is absolutely adorable.....Jodi took excellent care of me and my group d","useful":0,"cool":0},"npt8WTc_r0cTYWnRxhqNCQ":{"text":"Service was terrible. The bartender/server guy was a piece of shit. He was rude and mean f","useful":0,"cool":0},"_Xk4z5cn3YGQccmt7LvBig":{"text":"The streetside crawfish boiling & smelling great brought me in. I didn't mind the small wa","useful":1,"cool":1},"x5YIMpzRFz5LEAFf23i90A":{"text":"Super fun! Ambiance was fun! Drinks were fun! Food was ... say it with me, super fun! Serv","useful":1,"cool":0},"2TbSgr4klbk8SpHjbe0ozA":{"text":"Dear Channing Tatum,\nFirst of all, the Eagle is a goddam good movie. However,  the return ","useful":1,"cool":1},"Ldjl0mHWUJpmmSyToHA06g":{"text":"T and David....they take care of you and are the BEST!!! Head to the bar and ask for, \"the","useful":0,"cool":0},"DgZNWYyWuFa-1J86w_uccA":{"text":"The cheese kurtz were very flavorful and very plentiful. The perfect snack when drinking o","useful":0,"cool":1},"vLeDFZ7dvi9g9R3SxbF3Kg":{"text":"We came here in May with a group for a bachelorette party. We had a reservation to come he","useful":1,"cool":0},"OE2ipXPkZKmUwZdx7ae3pA":{"text":"I'm a little surprised to find all the good reviews on here go r this place, it makes me t","useful":0,"cool":0},"bd-c5Vssen0FZxOAxyXaVw":{"text":"I came here with my girlfriends we flew in from Florida. I was walking by and that's when ","useful":1,"cool":1},"ygTl3LTiDK8EPP7Q2jv4_w":{"text":"dis place incredible! i eaten a nice a crawfishes and a alligator! david was a mos welcomi","useful":1,"cool":0},"QeYL344jugHwpTVgZRpUEQ":{"text":"This is only a review of the bar:\n\nMy girlfriend and I were visiting the French Quarter, a","useful":1,"cool":1},"5WM38KjxroS9Y_3B_0inSg":{"text":"What a great experience! Boiled crayfish, cooked out front  on Bourbon Street. The scent f","useful":0,"cool":1},"km_fvWKF1sOgoEosKsh3MQ":{"text":"Love LOVE this place, great atmosphere, the service is amazing. Every server was kind, con","useful":0,"cool":0},"WGYNWYVYErtWKTdWmbtH3A":{"text":"Can't beat the prices. Great crawfish pie and it's only 13.00, wow. Oysters on the half sh","useful":0,"cool":0},"FtHGgzTqmpb0eXWY5WPeCA":{"text":"Lured in by the large pot of crayfish being steamed out on the front porch ......both the ","useful":0,"cool":0},"zNHr0DClGoNr-3FZzjYgwQ":{"text":"Called ahead on a Friday evening to see if we could make a reservation for two. The man th","useful":0,"cool":0},"qsbvOssofOowGSw4tL1qfg":{"text":"Competent bar, but the food seems like a direct-from-freezer afterthought. The ambiance is","useful":0,"cool":0},"tfLgd4dE7YimBOswDa6_gQ":{"text":"Superb service, great scenery, and authentic New Orleans fare. Shountie our waitress was s","useful":0,"cool":0},"tqMPHXxAFm9rXF-RyFPVNQ":{"text":"This was my first dining experience.  The Jumbalia is incredible and their Sinner drink is","useful":0,"cool":0},"VYcmhH1ioM7SfSCIQTj5VA":{"text":"Bourbon Street has been dying for a place like this.  The decor and vibe were like no othe","useful":2,"cool":0},"jVvhXYnCzTqinH6QMetVTQ":{"text":"I need to start out by saying what great service we received from David.  Genuine, honest ","useful":0,"cool":0},"iIHOY728Js6AWMuZRVyRpQ":{"text":"Don't go. Just don't. Too many tourists, too loud. What I ordered looked like someone thre","useful":1,"cool":0},"nrL8h6_synjFOa1ghbpF7Q":{"text":"Cannot stress enough how bad this food is.  Bad doesn't even express how unpalatable the f","useful":0,"cool":0},"PHD-T0L3HikKYVmrKlGZ3A":{"text":"Bourbon street, enough said. Cool place to hang out, good music, and friendly staff. I ord","useful":1,"cool":0},"bht73atBWtcWHgwOWaHm_Q":{"text":"I have mixed emotions about this place.  There is no doubt that I enjoyed this place, but ","useful":8,"cool":6},"NikbWOkBp4NKIq0BAwtQ9A":{"text":"Had a fabulous meal here last night. The crawfish was good and spicy and we were attended ","useful":0,"cool":1},"h5p5WmF93gH6kgSK1ESnKQ":{"text":"The music brought us in, and the drinks/dance floor kept us there. Great staff! Epic night","useful":0,"cool":0},"x3x_jzvC5wLKUQ7aHS3lgg":{"text":"Considered VIP seating for a bachelorette party. Glad I didn't. Got free VIP because they ","useful":0,"cool":0},"aH2pwCDnJdTNQxubdlmnhA":{"text":"Came here for evening appetizers and drinks with some coworkers since being in town for a ","useful":1,"cool":2},"sSuhb2xipGZcSOF1cMfoeg":{"text":"Very lively. Everyone is awake and friendly. Loved this place. Servers were quick and frie","useful":0,"cool":0},"2OatltfknrdhjQe3wc1NrA":{"text":"Saint and sinners is an amazing restaurant and great for groups. Their raw and grilled oys","useful":1,"cool":2},"1JDNeyjK-7cl6BG9CG2wSA":{"text":"This place was a lot of fun! We had our friend's bachelorette party in their back room. It","useful":0,"cool":0},"I68lvX1-DVe_5eabQl7TEQ":{"text":"I'm putting the S & S in at a weak 3...showed up here post Yelpy awards...close to 9ish...","useful":4,"cool":2},"jEFq3gk4E5S81EIFyKH78g":{"text":"I'll keep this short and sweet. After walking around aimlessly tired and hungry, this was ","useful":3,"cool":0},"RWvhZRjII-J__8Qe8lVCWA":{"text":"This place doesn't even deserve 1 star!!\n\nFor starters the place needs an uplift.  I know ","useful":3,"cool":1},"E0N4yrEjjNfmrjG9M5uKRg":{"text":"My friends and I came here on our trip to New Orleans for a conference!  We were walking o","useful":6,"cool":3},"2JOBP4_gorJI66KS5I932Q":{"text":"My friends arranged to have dinner here for 12 of us during my bachelorette trip and we ha","useful":1,"cool":0},"1VR_TeBvkW3AiEumXnd1cA":{"text":"I visited this bar because I heard of a possible owner and thought it would be a cool plac","useful":1,"cool":0},"NI1jgu_U3i0fZAqJcG6usQ":{"text":"So they have this thing where they tell ppl they're fully booked without a reservation, bu","useful":0,"cool":1},"5ClzaVBLNPmFBGFf-ZVp-Q":{"text":"Absolutely amazing restaurant. Food was superb, and incredibly reasonably priced. I had th","useful":0,"cool":0},"73ZVZRfGGM_Zi39eJFRGFQ":{"text":"We stumbled upon this place walking down Bourbon because they had a man outside cooking a ","useful":1,"cool":2},"rHgYielGMp2VxkDdp0G-6g":{"text":"This place has such a fun vibe! Some friends and I stopped in here for lunch and drinks, a","useful":0,"cool":0},"9zJRJQEXnyJIjI5zPXJJzA":{"text":"Came here for a bachelorette dinner based on their promotions of this being the spot to be","useful":3,"cool":2},"XbBqF7tgAScIEX8rQ1eArg":{"text":"This is one of my absolute FAVORITE places in New Orleans!! Terrific food,  fantastic drin","useful":0,"cool":0},"awuY77U5WV81-h--RAhbtA":{"text":"Packers fans unite! This is a true Packers bar: sound on, full of fans, and cheese curds a","useful":0,"cool":0},"o_1A2KvRZmqwRDCyCLHPOQ":{"text":"Its all about the hype and using Channing Tatum name to make money. The food is overly pri","useful":1,"cool":0},"hCKriTHqiu3JqcwRhIkZiw":{"text":"Stopped in back on 6/2/13 when I had the boy with me for his 1st time in NOLA/The Quarter.","useful":7,"cool":6},"o4KdmO4Gvz91ZnX6Q2BRUg":{"text":"I don't know if I could anything about this place that hasn't already been said.\n\nIt's not","useful":7,"cool":3},"IZUIRDEQYZ3QtI_SG8XnAw":{"text":"Let me first tell you how I am justifying the 2 stars. \n\nFirst, this place is a restaurant","useful":1,"cool":0}}