{"XVKNvjCJBxzBzy1PG-uNig":{"text":"Showed up at 7:30 for an 8:30 reservation and planned on spending 1 hour at the bar.  Spen","useful":0,"cool":0},"LDvMFmkHcw3BHsAPLlx4eg":{"text":"I went with a group of 8 people on opening night.  We elected to go \"family style\" and ord","useful":0,"cool":0},"XdykHzoZlGqvGHD_qaANRA":{"text":"It's a good restaurant, the setup and decor remind me of Emeril's version of Peche - and b","useful":2,"cool":0},"tqEusasTitcCmNNkMEQ5qQ":{"text":"We were 2 ladies at the bar for drinks and a few bites to eat.  Service at the bar was alm","useful":0,"cool":0},"rPpEsHaRUhbq2gwCIM2iRw":{"text":"Cornbread, get in my belly!  Seriously though everything we tried on the menu was excellen","useful":0,"cool":0},"XTwcZMdmnSvIR7p23gBe0g":{"text":"Went to Meril on Wednesday 3/1 for a birthday celebration!  Everything from the cocktails ","useful":0,"cool":0},"Iy6rVMqET_kJVlSlis_MJg":{"text":"The Boudin Tamales are to die for!  Great service!  The plates are small but it's nice sin","useful":1,"cool":0},"wQPfLwVFuD_U4SQHLT5tOA":{"text":"This was excellent. I sat at the bar overlooking the kitchen and got to interact with the ","useful":0,"cool":0},"YGvkWsztwr3CIkzGEJoZlA":{"text":"Great dinner last night at Meril.  Fantastic wine and beer list. I had the Portuguese alva","useful":0,"cool":0},"5TGzKsVKDV2qNXGoFwKl4A":{"text":"Excellent service at not crazy prices! Great service by all the staff but also Texas our s","useful":0,"cool":0},"aDeMwSI7AD4Wa1oS8lhxXQ":{"text":"We went to Merils at 5pm, prefect timing,  it was happy hour,  we had $5 wine by the glass","useful":1,"cool":0},"c1FJeVM0l-UgzCrQosxPXQ":{"text":"So glad we decided to visit this place for lunch. We started with the smoked gulf fish dip","useful":2,"cool":0},"w8GKNsy8Nb_2LiixZnuS0w":{"text":"I very much enjoyed my meal at Meril. The ambiance was casual yet classy, the food was del","useful":0,"cool":0},"rPcd_w_zzp3no5ELL_KtPw":{"text":"Food amazing. Service good. Drinks okay. Edamame salad, beet pasta amazing. Skip dessert a","useful":0,"cool":0},"BBIRQhE7rwLTpr265ovccQ":{"text":"This place is great. Atmosphere is so fun! You can go casual or dressy. The drinks are per","useful":1,"cool":1},"gpwxnFmcpaXTN4TJFK5DSg":{"text":"This was probably the most fun of all the Emeril places I have been to. Small plates, lots","useful":0,"cool":0},"vMvTx3CCk8J7Cn6EilxzNA":{"text":"Great ambiance! We celebrated a birthday and it was a great choice! Tamales were delicious","useful":0,"cool":0},"EpadFsa4xH3DM3uNxMgZRw":{"text":"We called to let them know we would be 5 minutes late due to traffic and rainy road condit","useful":0,"cool":0},"qhxlmAP5IZx_kJrchttqQA":{"text":"This is an awesome spot. The atmosphere is inviting from the music, decor, and ambiance. T","useful":0,"cool":0},"wtlYlucLFy5sXFtutWGYKg":{"text":"Meril's hmmmm...where do I begin... the ambience is amazing and the service was superb. I ","useful":0,"cool":0},"h5r0OPOYiX157vyXnEJSXw":{"text":"Delicious meal and typical of fancy restaurants portions will not leave you feeling bloate","useful":0,"cool":0},"LliWbg6KJpAU50u4wPyTAA":{"text":"Perfect service very quick meal. Maybe a little to quick hadn't finished salads before oth","useful":0,"cool":0},"nimhn3yPGtZoohzJCWSr2Q":{"text":"The music, the food, the atmosphere was everything! We went for my cousin's birthday and t","useful":1,"cool":1},"iHMDB561pcIcGT0LdsO_QQ":{"text":"Went last night and had a mediocre experience. \nService and atmosphere were great. It's a ","useful":0,"cool":0},"dQrb4wCkbGddVTZK0q0ZBQ":{"text":"Very Nice place. So crowded we had to sit facing the kitchen which was cramped but kind of","useful":0,"cool":0},"ik4Y0gL_VogMI2mY3ATITA":{"text":"this place gave our group such an amazing dinner! we arrived with a large group and it was","useful":0,"cool":0},"JZC5cw1e758dx-TgBIcJgw":{"text":"My sister and I were visiting from San Francisco and were told to check this place out by ","useful":0,"cool":0},"gw3d32Y6lgTamYCjQbBmrA":{"text":"Went for Sunday brunch to visit the new spot and Chef Darren.  I could ramble on about whi","useful":0,"cool":0},"GPXFHraRiDcngmhGwocdQA":{"text":"Ambiance was great. Thought it was more upscale being an Emile associated establishment. R","useful":3,"cool":3},"cVKKa7reOMClyEdP_qhOaA":{"text":"Disappointed. ...have dined at three of Emeril's other restaurants and the  food and servi","useful":0,"cool":0},"TBmr0lWT66430P-I-gBcKg":{"text":"While visiting Nola with friends during Essence Festival, we decided to dine at Meril for ","useful":2,"cool":1},"yVbRqqKh7zV7U7xbFVQFeA":{"text":"Enjoyed my meal very much. Everything is a small plate which means you can try several dis","useful":0,"cool":0},"DUeKQEd4AfaoYD40feebRg":{"text":"Went here for lunch on our last day in New Orleans and we definitely SAVED THE BEST FOR LA","useful":0,"cool":0},"5qGwD6mBEcjvQUYEsZgStQ":{"text":"had a wonderful late lunch at Meril. really enjoyed the experience, which was facilitated ","useful":0,"cool":0},"e83-FtCHnKoAZzRv0gEP7Q":{"text":"Underwhelming. Small portions with subpar quality priced as exceptional dining. \nCould get","useful":3,"cool":0},"6ephqtBGARQGVgUH1WuW-w":{"text":"I hope you made your reservations!!! Emril did a great job with this restaurant! I love th","useful":0,"cool":0},"PnEASP9eZKO7b0_AG2mZ2w":{"text":"Service was excellent - thanks Corey and Mike! They were nice to my special needs brother ","useful":0,"cool":0},"0hYDUv3e8-nV-IdJ5fh-4w":{"text":"This should be on your list for New Orleans restaurants to return to on every visit. Somet","useful":0,"cool":0},"OGHIYtskATzxZEFGdHOzmA":{"text":"Overall experience was okay. Great service though. Hubby and I ordered fries with lemon ma","useful":0,"cool":0},"ihHgu7WMNxtwGYe4KGel-Q":{"text":"Pretty disappointed considering the food was probably 8/10 stars. Service was no where up ","useful":1,"cool":0},"qk89zcDJrDlD771RJEdv2w":{"text":"We love coming back here weekly if we can.  The lamb pappardelle is my latest obsession !","useful":0,"cool":0},"edu8VLjQz9iDqCbptW4KzA":{"text":"Had a very good meal here with a large group of friends.  We ordered a bunch of small dish","useful":0,"cool":0},"x2pXPxI2Bo3qjZCRPOwCbg":{"text":"Excellent first meal in New Orleans on this trip. Four of us split the roasted Brussels sp","useful":0,"cool":0},"AqPAJORDHnbEAQth9jqtZg":{"text":"From the moment we entered we were treated to a relaxing evening that nonetheless met ever","useful":2,"cool":1},"thhNQ7jEvJ9c7w9za3fi6Q":{"text":"I thought this restaurant was super fun! The service was amazing from start to finish. The","useful":0,"cool":0},"VPT3UoQAd5rmugUk_LVqeQ":{"text":"Outstanding food! Wonderful service!\nOur party of six ordered the fried chicken livers (a ","useful":0,"cool":0},"eisp6eEHNYKJRUKDNpypEg":{"text":"1st time and it def won't be my last! My boyfriend and I started out with the chorizo flat","useful":0,"cool":0},"PhU2ecqvO5Nu3A7BryQUKQ":{"text":"This place is a casual gourmet cutting edge spot in a beautiful new space. It is a small p","useful":0,"cool":0},"COO24AZ51at2hD1OIwitVg":{"text":"I really like the food here. It is a shame to give it one star but I have to because about","useful":0,"cool":0},"muKmxcn_BHE9cx0e1AhDKA":{"text":"Food was solid, with shrimp dishes being the highlight. Try the rock shrimp tacos as a sta","useful":0,"cool":1},"2NRgZkal1HX63MGPtQ_aDQ":{"text":"Great service , drinks are great reason for the 3 Stars is the food is good but consider t","useful":0,"cool":0},"qPcG7ukLNuK2JeK0JCPxWw":{"text":"We had heard a lot of good things about this new restaurant, and were excited to try it ou","useful":0,"cool":0},"dsTkaPpPhFdCsL4nxJMMVw":{"text":"This was not what I expected from an Emeril restaurant.  It seemed like they just tried to","useful":0,"cool":0},"61-HQsOEsZhyUuFO0Gnmjg":{"text":"We only went for dessert, but we walked in without a reservation on a Saturday night and t","useful":0,"cool":0},"K169gX9L3buiZUgM3rws9A":{"text":"This place is amazing all the plates are great and the food is delicious. Nothing we ate w","useful":0,"cool":0},"SeKb7WT_DTt3BFPlPbH5lg":{"text":"Great food and great cocktail list. Perfect place to bring company when they are visiting ","useful":0,"cool":0},"ONRz_0DAs61G2U2XySo2IA":{"text":"Great atmosphere! Loved the open view to the kitchen. We tried the deviled eggs, shrimp ta","useful":0,"cool":0},"c7ZoY_ZkrRSRHgBYF2v4Nw":{"text":"Very cool environment and the food was outstanding. Drinks were very well crafted as well.","useful":0,"cool":0},"KOV-x5r6ShOFsqgHi_E6Sw":{"text":"I would go back just for the deserts! We had the bread pudding and the lemon pie...its was","useful":0,"cool":0},"mz_i9sNIKuTtEuHxDgu7Cg":{"text":"Food is great & service is even better!! Gets really loud which is sometimes annoying when","useful":1,"cool":1},"izoT38akLTc0Ze1fVo-dsg":{"text":"Meril was great.  It's a big beautiful storefront in the warehouse district, right off of ","useful":0,"cool":0},"-FDhTZvyVLCTgnMGdn2yTA":{"text":"I was hoping to eat here during the second half of NFL Sunday night game. Given the late d","useful":0,"cool":0},"DJ2LNWlHqppL9IVOvVit8g":{"text":"I loved the ambiance & staff. The parking could be a little challenging because of the loc","useful":0,"cool":0},"AZrvq1eUsAh0T0veS2s-aA":{"text":"Eaten at Meril twice now and enjoyed it but it is a bit odd to be perfectly honest.  The r","useful":1,"cool":0},"Hq794qaFXOigSr8mdnyTfw":{"text":"Excited to go to my first Emeril LaGasse restaurant.  Great atmosphere and decor.  Best di","useful":0,"cool":0},"EgETnTZiAFrJKK6BYu1kYA":{"text":"Great food, good drinks, but hands-down the loudest restaurant I've eaten at in New Orlean","useful":0,"cool":0},"zte_nouZKc7n2KkYOg-aWA":{"text":"Good place. I came with no reservations for lunch and the staff has been really welcoming ","useful":2,"cool":1},"zJhr900sS36p3Z5RHys6Rg":{"text":"I must admit that I was highly disappointed. The food was not what I expected. (To be fair","useful":0,"cool":0},"hV1EIvc_RRnUIO7OHswMpw":{"text":"Meril is Emeril Lagasse's newest outpost in New Orleans and I must say I was pleasantly su","useful":0,"cool":1},"c3bAYjiDeYY-w10buILUiQ":{"text":"This place was AWESOME! The staff was really friendly and helpful. Our waiter really knew ","useful":0,"cool":0},"PJOk1zXMK2HVKnbNDExGbw":{"text":"Molten lava cake?? More like room temperature river cake... still tasty though and good dr","useful":0,"cool":0},"7CxRQ_lOfiiSfRVydZDtPA":{"text":"First time at Meril tonight. I was very impressed with the style, the restaurant, the good","useful":1,"cool":0},"Fmt1mp3Nt3PEHWJ10qotWg":{"text":"Comfort food Super Spin! Most dishes are just creative enough to be slightly surprising; a","useful":0,"cool":0},"GKMkYsN_0WbX3JNcHWCCgg":{"text":"Ambience no so perfect! Service is good. The food portion is perfectly measured. Servers a","useful":0,"cool":0},"pDBVbW4x_HymiXQ0Nv4mcQ":{"text":"Great experience! My waiter was very good. My favorite starter was the boudin tamale. Riga","useful":0,"cool":0},"QFIL0keRx_J5dYy4qzZy4Q":{"text":"Yummy! We came here with no real plan and we were super happy that we did. We didn't have ","useful":0,"cool":0},"1CvEkd56ZUQOckhTWUnSHw":{"text":"We went there for brunch. First of all we come in and the place is largely empty. They put","useful":1,"cool":0},"Ae_dfGKYY2ljEsjWJMR5vA":{"text":"We thoroughly enjoyed Meril's.  My daughter had the meatball appetizer and said they were ","useful":0,"cool":0},"o8M1PEcVeT0I2OaFiI7rMg":{"text":"A group of coworkers and I ordered a bunch of appetizers/small plates and everything was f","useful":0,"cool":0},"iXCRxz9huzpgjsr2dI2M1g":{"text":"Love the food, drinks, the atmosphere, and the menu. They have such an amazing variety to ","useful":0,"cool":0},"I0QIj3-jTIRi5N2eQoVWsw":{"text":"Had the Soft shell crab with alligator sausage and crawfish tails in a Creole cream sauce.","useful":0,"cool":0},"2B7FdLVcBtwqhSQPaiLNrg":{"text":"Delicious food and amazing service!!! We had the bbq chicken thighs, Mexican corn on the c","useful":0,"cool":0},"n4nyDb0xWL7zEoUTow-bng":{"text":"I wasn't a fan of going to this place at first.  It was at the end of the night and the wa","useful":0,"cool":0},"2ODvmdUiT9v9I_-JIa52Ng":{"text":"Large restaurant so we found a table for 7 easily. Fun food. Great service. Reasonable pri","useful":0,"cool":0},"qrBlAzPMONG88bMOE5DmtQ":{"text":"This new hot spot is the ish.  Everything is so right. The food is Delish and the drinks a","useful":0,"cool":0},"fBt2qDcywxZ9AfvUodLieA":{"text":"Had an amazing meal last night. Our waiter Jerren was the best. He knew the menu well! I w","useful":0,"cool":0},"-sJYl_Exq-1tvt_HeeV4-g":{"text":"Oh Meril, thank you for being born. My boyfriend and I came here one night to celebrate me","useful":2,"cool":2},"XU0B0R9Cb9oTAi3pVYbnvA":{"text":"My daughter lives in New Orleans and go visit her quite often and have gone to many of the","useful":0,"cool":0},"63cO09poHo14jksy0CqWuA":{"text":"Meril is by far one of my favorite restaurants in New Orleans. It is my family's go-to pla","useful":0,"cool":0},"8BGTXEscUdhAN8rsUKdm1w":{"text":"I was part of a party of seven. We had a reservation for 6 at 7 pm but were seated quickly","useful":0,"cool":0},"qDAvZbCIzxBA9_xt81qhuw":{"text":"We had a celebration Sunday lunch at Meril today. It was a delightful experience. We were ","useful":0,"cool":0},"OiSvedTjw_NRBkx1iQ-iEQ":{"text":"We went there for dinner.  The small plates were great.  The main courses not so much.   M","useful":0,"cool":0},"7F96VUnZXxooX4889EvLOQ":{"text":"Great food tapas style. Great service. We had two waiters! Loved the muffuletta flatbread.","useful":0,"cool":0},"TVBzCgsE6zxuyIrQ22JrCA":{"text":"Very disappointing, not a taste of Nawlin's at all.  Small portions, noisy, and undercooke","useful":1,"cool":1},"x_49jk2b6b4lP_E04uzYBg":{"text":"We really enjoyed this place. It serves small plates and a really wide variety of types of","useful":0,"cool":0},"Hh9iMmZNbjns5DfmCvbodQ":{"text":"The food was delicious and the service was great. We split a bunch of different items and ","useful":0,"cool":0},"AeT2k0ngu7VM7M8eMfiYsw":{"text":"This was such a great find and very close to our hotel. We came in right before the lunch ","useful":0,"cool":0},"-a5N2WS9ni9FMVcedr86vg":{"text":"Not many chefs can make a turkey neck this tasty! I want to go back to New Orleans just to","useful":0,"cool":0},"6KmWPpb7eLCAtwJf2eLn5A":{"text":"I've got to say, Emeril was gone small on the portions for the full entree price here. Eve","useful":0,"cool":0},"6EiH5VHRqIZc8HaWrnoMrQ":{"text":"The only thing worse than the food was the service.  Went there on a recommendation from t","useful":0,"cool":0},"etyMKr735ELMy-hNcnkMtA":{"text":"Awesome lunch at Meril's. We had the shrimp tacos, brussels sprouts and Mexican corn which","useful":0,"cool":0},"qLofUJIfeoO-6UaA5N3ehA":{"text":"Went for my birthday. Loved every damn thing. The fried chicken salad is surprisingly awes","useful":0,"cool":0},"pQCF4Dscda5ZlUfX2nk1eA":{"text":"Incredible!! Celebrated my 3 year wedding anniversary here while on vacation to NOLA with ","useful":0,"cool":0},"rUA9GaWHZrNYYluYjSA4iw":{"text":"The food was excellent. The service was good. What was not good is that the bartender char","useful":0,"cool":0},"fZ6U6gZ44YhQtsNVEw6ghg":{"text":"We just arrive in NOLA & found Meril on the app. This place has a wonderful atmosphere. Si","useful":0,"cool":0},"Nz5GNlvCndqn7KXVW9Llxg":{"text":"Chic ambience and the crab fettuccini pasta I am already craving again! Also delicious was","useful":0,"cool":0},"i4QLMeS3MVAysykvj7pb3w":{"text":"In town for business and recommended.  Great atmosphere and very tasty food offering.  Pri","useful":0,"cool":0},"eFcyqVnpp5wNwZCDnUewxQ":{"text":"We had heard of Meril and were happy that when stopped in for a late lunch that they had s","useful":1,"cool":1},"_5YNY7Cebt4T1jbZ91Qsdw":{"text":"Lousy drinks but good food. Had the short rib and the linguine which were both delicious. ","useful":0,"cool":0},"KU6VFrNqEjbKLzGkfLvysQ":{"text":"Ate here for a friend's birthday, loved the cotton candy & sparkler! So cute! I am vegan s","useful":0,"cool":0},"iojescvlpSJzywjpvgYqlw":{"text":"A series of miscommunication regarding food restrictions led to a less than stellar gradua","useful":0,"cool":0},"uwv0h70AJJ8WAInLREBSnA":{"text":"If you are contemplating coming here for a meal... Just do it. Everything we tried was ama","useful":0,"cool":0},"10Eoz0j-gRTx8QR_9BORJg":{"text":"Great concept but average food. I usually like Emeril's restaurants so I was excited to tr","useful":0,"cool":0},"zHKpGfqfEt5va4lG8F9FOw":{"text":"We came to this restaurant because Nola was closed. We tryed and shared many dishes and al","useful":1,"cool":0},"HLBXP7DToKd-UWbpGTnQ-w":{"text":"AMAZING FIRST TIME EXPERIENCE! FOOD IS AMAZING! Our server was Ryan and he did a great job","useful":0,"cool":0},"iQ49x5YTSBNTTzG9Yx8HTA":{"text":"This is probably one of the best places to eat to have a girls night out! My friends & I w","useful":0,"cool":0},"6WdEsk9ubn768Sm6eZ4RnQ":{"text":"Great bar/restaurant if you want a modern place to sit, stand, and hang out.\n\nSadly we wen","useful":3,"cool":1},"1d6j5HOyk203MwPdmgZkUA":{"text":"This is a great new restaurant for the Emeril restaurant group. The food is excellent. The","useful":1,"cool":1},"BJV6NE33B58M6ud0bprXRg":{"text":"Texas was a phenomenal waiter. Professional, knowledgable and kind.. Felix was amazing as ","useful":1,"cool":0},"kyKVEfapKrLuUgSI4b66uw":{"text":"I had a wonderful lunch. The restaurant is beautiful. We went for lunch but wish I had tim","useful":0,"cool":0},"Fx6X-6R331HH74e3WFgKpw":{"text":"It was ok! Small plates a bit pricey for the amount of food you get. Service was mediocre!","useful":0,"cool":0},"2oWoFvkuPzl6KsX5kDc_6Q":{"text":"Food was good, not blown away like I have been at other Emeril restaurants in the city. Th","useful":1,"cool":0},"wGrvzJtgaPKC2pIoxyLsAQ":{"text":"I went to this place for a lunch meeting and oh gosh, amazing dishes there! We started wit","useful":2,"cool":0},"WMFlmcGFWfSg6_VHzxfOiQ":{"text":"The food was very good, but not as good as NOLA. We got the Brussel sprouts as an appetize","useful":0,"cool":0},"ptkwaD7F4IDxSlDgmblP3Q":{"text":"We came here with a large group and the food was great. The servers were quick and helpful","useful":0,"cool":0},"z9_I5K4nr8iSP8vIROdNmQ":{"text":"Small plates make it so easy to try a ton of different dishes here. We like grabbing a sea","useful":2,"cool":1},"UCSpsiQJXQ0ldWJrDlqNtA":{"text":"Hard to say if this deserves 3 or 4 stars. The gnocchetini was so salty it was absolutely ","useful":0,"cool":0},"VqeyZqnJ7aWosS6HRxbmUQ":{"text":"My husband and I went here for Mother's Day.  SUCH good food!  We ordered three plates of ","useful":0,"cool":0},"Blr4LReImNW5BZFlBDqoAw":{"text":"Tried Meril for the first time last night...after I got over the initial shock of lots of ","useful":0,"cool":0},"mqeBxBugnJw3wndQI6lenQ":{"text":"Fantastic!!! The waitresses and staff were great!!! Food was sooooo good and the desserts ","useful":0,"cool":0},"CTkvC49mZyA69L30wPikxw":{"text":"Amazing lunch!! The break pudding, the oysters, corn, cauliflower, everything we had was s","useful":1,"cool":1},"aEhw_Lb7LSevEhxcb_4KdQ":{"text":"I loved everything about this place except the lukewarm reception from the hostess. No wel","useful":0,"cool":0},"59G6GhDIGbGZF_Q55K1Rig":{"text":"We celebrated are daughters birthday at Meril last night. We are from New Orleans. The old","useful":0,"cool":0},"DYC5_2_O3e_YSZaoS4iGyw":{"text":"The flatbread special during happy hour is a great deal! I walked over after work one day ","useful":4,"cool":3},"o3Z-UJCdypn8AeclSsH3Ig":{"text":"Trendy spot with delicious food. Diverse menu and I love that they offer a 8oz wine pour. ","useful":0,"cool":0},"_jbS3a1VWge8OYn0VhNf9w":{"text":"Brussel sprout and sweet potato salad was delicious. My wagyu beef was a little over cooke","useful":0,"cool":0},"_S6FIHnuXVcymwhiFgBwTg":{"text":"Food & service was stellar. Thanks to the team for letting us sit at the kitchen bar even ","useful":0,"cool":0},"1gFhaa1GdIVmEq4gI1c8NA":{"text":"Excellent food and beautiful service and friendly \nPeople. Went there with my son and his ","useful":0,"cool":0},"V5tsQ102Z0sq9YnmobiJ9g":{"text":"Don't go here I'd you expect good attentive service. Our waiter was nice but clearly did n","useful":0,"cool":0},"Twf6u0aslZUwQXWwkMf03Q":{"text":"I had an amazing experience here. The service was fabulous. Our waiter was super nice and ","useful":0,"cool":0},"dsibbZ1DEDGJnWG1S9kcEw":{"text":"I can't wait to come back! I loved the atmosphere and am looking for an excuse to return w","useful":0,"cool":0},"jTLjF_jvUHMjOikxXKAGDA":{"text":"I faithfully watched Emeril Live and have incorporated Emeril's recipes into our weekly me","useful":0,"cool":0},"sJF7_qgdkT-AWU0X8WkaFw":{"text":"My friends and I had he pleasure of dinning here when visiting from out of town. It was a ","useful":0,"cool":0},"0nh3gaqeuYQ0jZADZOXUqQ":{"text":"A truly awesome meal made even better by great service!  Some unique food offerings paired","useful":0,"cool":0},"0sZW0ob2aFTTVYGFkIAcrw":{"text":"Just got back from New Orleans yesterday. We went to dinner at Meril one of the nights on ","useful":0,"cool":0},"5MiBwqJEIUjpmehSLrjmQA":{"text":"What can I say? The food was amazing! We went for lunch and order a bunch of small plates ","useful":1,"cool":0},"MJwlRYyq01holNbkRplwig":{"text":"We arrived for our reservation for seven by telling the host that we needed to add one mor","useful":0,"cool":0},"Wr-43s48I5jhA__oBUPChQ":{"text":"I have come to Meril multiple times.. some for an occasion and some for just a nice evenin","useful":0,"cool":0},"jth_5tdyJTYJFi6W6jUnsQ":{"text":"This was such a great and different experience restaurant wise! I loved the idea of small ","useful":0,"cool":0},"75Lz5utFuGWmBpbdV5RCvw":{"text":"It had been over a decade since I last visited an Emeril restaurant. This time we ran into","useful":0,"cool":0},"L8GYe7rzjQ44kmMrYa1DXw":{"text":"1 word: CORNBREAD. Oh the Cornbread. Little heavenly goodness. Insane bursts of flavor in ","useful":1,"cool":1},"Tslt_umcwQAS1L9qyXySlw":{"text":"Our first time in New Orleans and we couldn't have picked a better place!! Four of us, wal","useful":0,"cool":0},"0xDxOxAa1pfagjGc2mPX2A":{"text":"They are shortly open and just might be the best restaurant in Nola! Haven't tried them al","useful":1,"cool":0},"gPA3R32fAIoUTZiUycfkug":{"text":"First, the good:  I thought the fried chicken salad was really amazing.  I was expecting t","useful":0,"cool":0},"g5PD8ycIfSX4SBzOce8Rrw":{"text":"Went for happy hour and sat at the bar. Damian was our bartender/server and I highly recom","useful":2,"cool":0},"uiz8z9Z4nLFpkAkMQuFJjQ":{"text":"Went to Meril after the WW II museum.  It was a great way to top a wonderful museum experi","useful":0,"cool":0},"_1Qfd4XOVv0c9IipR0KxzA":{"text":"Excellent service by Megan, spot on customer service. Food was good, service was better","useful":0,"cool":0},"fN8-F4OxHq1pOSIxJMI8Cg":{"text":"Had a great experience. The food was not disappointing at all and the service was bubbly a","useful":1,"cool":0},"4KcoWK-cVJvugiMIKhjiyQ":{"text":"The food was delicious and the service was way better than most of the restaurants I tried","useful":0,"cool":0},"8XqhU1NMQJDfor-_n-3bPg":{"text":"Good times celebrating our daughter's birthday.  We took the recommendation of a traveling","useful":1,"cool":0},"zHRbPNU_k5zP5lrwefIlnA":{"text":"I was extremely pumped to try this place after looking at an awesome menu with lots to cho","useful":0,"cool":0},"YG6Z5O45-PYAR9Bsr4iCfQ":{"text":"Excited to try Emeril's latest restaurant and it was delicious as expected. Less expensive","useful":1,"cool":2},"h4n30Qt6m52mwBOE0TrJzg":{"text":"Had a fun time dining at Meril with a group. (We were in town for a conference.) I had the","useful":1,"cool":0},"pEeIg-21EwJCpfPh9cWrvw":{"text":"Great menu! Favorites: Shrimp avocado salad, manchego croquettes, and freshest calamari ev","useful":0,"cool":0},"qLvJZj2x6H3p-KhLf12hXA":{"text":"Drinks were good, food was good to great (flatbread was especially tasty) but the service ","useful":0,"cool":0},"HZugDrCGepVykjaWtxAh0Q":{"text":"This place is really a joke. It's just goes to show how washed up and mainstream Emeril ha","useful":0,"cool":0},"bketbuMV03fQq79qz0BOuQ":{"text":"Fantastic food, great service, not a bad thing to say about this place! Came with two girl","useful":0,"cool":0},"cq2mVJcz-s9nzb3CcgLG3A":{"text":"WOW. This place was absolutely incredible. One of the best salads I've had in my life. Lig","useful":0,"cool":0},"Bies6NcG0J9AFqoP8YUIyA":{"text":"I really liked the atmosphere. Cool and trendy with good music. Also had a nice white wine","useful":1,"cool":0},"nklpkY1s9WySkJ1v4VCJiA":{"text":"We spent a long weekend in New Orleans. We went to Meril on the advice of friends and hote","useful":0,"cool":0},"rLnpTmXKP3PRd7fuoQzmAw":{"text":"I don't even know where to begin. This place was amazing! I went with 6 of my girlfriends ","useful":0,"cool":0},"01-OsQUScvk7HhDcdkAsJg":{"text":"This is a must go if you are in New Orleans. Expertly produced food at a good value. Excep","useful":0,"cool":0},"VJlnSnUS7LqKh0v6x4AEXQ":{"text":"Visited on a whim and was pleasantly surprised. The service from Mark and Felix was perfec","useful":0,"cool":0},"fNHj5t5zC_4ufwn-oLoWIQ":{"text":"The place was packed and there were only reservations seating however the host offered us ","useful":0,"cool":0},"3efT-57N3uv4PC8bkspZJw":{"text":"Beautiful restaurant in the warehouse district. Great, varied menu well executed. Everythi","useful":0,"cool":0},"bzqTrXMubGHAcuLskSPZcA":{"text":"The best drum I've ever had, easily. That's coming from a NOLA native who has a family of ","useful":0,"cool":0},"PDwLFsEIqqy5vcwQTjUXXA":{"text":"Meril was a delightful restaurant with excellent food.  There were two servers helping us ","useful":0,"cool":0},"ebRhiQIbfvNtAW4lndf0pw":{"text":"The food was fine. The drinks were meh. But the waiter was rude (jarrod). Told us to pleas","useful":0,"cool":0},"PxlE1qmO6baJvBoNygaSlA":{"text":"I want to start off by saying that the service here was spectacular and the interior was c","useful":0,"cool":0},"GcfpqGFzLHOwLRIRIRIIFg":{"text":"We last ate here a little  more than a year ago when it first opened.  It was less crowded","useful":0,"cool":0},"pVItXsczYwCJ_ufHcmCJMA":{"text":"Been here twice and the whole experience is great. It's awesome to see the young local tal","useful":0,"cool":0},"E0dNVV9m8OlCLg5fJtza8g":{"text":"Came here on my birthday weekend. Really nice spot, cool neighborhood. We had to wait a fe","useful":0,"cool":0},"yTpdfY7HxSN6Rn4foqk6tw":{"text":"I did not have really high hopes. We stopped in because we were hungry and tired of walkin","useful":1,"cool":0},"U1XUudHBwMuQqNpwaW80yw":{"text":"The ambience of this place is great, and menu looked delicious, however, the food was disa","useful":0,"cool":0},"5N88Zw-a4FakOjUaH4tZrQ":{"text":"Experience was pretty good. Prices were very good but for a place outside the French quart","useful":0,"cool":0},"MoLgDMyyUu4Pach2zq_p3A":{"text":"We had a pretty good experience at Meril. I would rate 3.5 stars.\n\nThe service was good an","useful":0,"cool":0},"ILFwN_1haUkvUiFgzm8feQ":{"text":"Just finished with my meal. $50 bucks down the drain. The portions they serve could actual","useful":0,"cool":0},"1_O-MmhVajjW05BQ6HTJ6w":{"text":"Really nice place. Very sleek on the inside. The menu features a lot of small plates, whic","useful":0,"cool":0},"np393AgfsrIIzyiJY_OPMQ":{"text":"Great food. Trendy, tasty and modern.\nSmall perfect portion size with amazing taste. \nHigh","useful":0,"cool":0},"QI18Nh2Cdfo45oAJf-pDNQ":{"text":"Spirited but slow service of desperately bland small portions. Messily presented calamari ","useful":0,"cool":0},"cMS3xzA7x1BXthp_GtnPiQ":{"text":"I went in for my birthday, I was late to my reservation but they where very accommodating ","useful":0,"cool":0},"gbx5uioKNCa5AQsoF41v2g":{"text":"Had dinner last night at Emeril's latest New Orleans restaurant Merils and it was fabulous","useful":0,"cool":0},"nWVnNo-pmF-R5dac0ycKLw":{"text":"This was my favorite meal in New Orleans. I will return when I go back to NOLA. \n\nWe had t","useful":1,"cool":1},"vtrk1FqxCYhlazr94Z4NVg":{"text":"Awful. Micky was horrible to deal with.. horrible.. will not be back. Every time I've been","useful":0,"cool":0},"vZkLj1GCdxZxb04OTfKWwA":{"text":"Moderately priced and great service. Six of us shared appetizers, had entrees, drinks and ","useful":0,"cool":0},"9yomV1jP3mQSRn9v1oFLLw":{"text":"Group of 6 had dinner before LSU game.  Great service, fantastic food.  Server recommended","useful":0,"cool":0},"U78fwcPUUx56v88Yk0fqLA":{"text":"SO FLIPPIN GOOD.  The attention to detail from the wait staff to the food and portions.  G","useful":0,"cool":0},"GnHdSZ8DXpeg4M0Tfmbpvw":{"text":"Service and drinks are excellent, food is good ( not great ) and portions are pathetic.  R","useful":0,"cool":0},"Qhzuw28nAMvF1zGjpCE3Gw":{"text":"Really wonderful food and service. We enjoyed everything we ordered so much! The gigantic ","useful":0,"cool":0},"7JHLfcgNenW6V9E8UtAoOg":{"text":"I love the atmosphere here...so different than the other Emeril restaurants. Very warehous","useful":0,"cool":0},"oVHNXjjvQ8Jva1y6zUqPxQ":{"text":"My take on this restaurant was that you get a four star restaurant service, atmosphere, an","useful":1,"cool":0},"W2-SOupkkfqf8Ypth6_PAw":{"text":"I went here for my birthday and got a lovely seat without a reservation. The staff were ve","useful":0,"cool":0},"Al-TWoqPX_fweyPIvvT2Zg":{"text":"I've never felt compelled to write a review of any other restaurant, but Meril's inspired ","useful":0,"cool":0},"Qr56Iq1jgnYBDk3kL_fNcw":{"text":"Interesting place. Not overpriced for a specialty restaurant. Small portions averaging aro","useful":0,"cool":0},"rnPaq5vhPReJNjCav_JrmA":{"text":"Amazing atmosphere , food and service . I would recommend to everyone and thank you for ma","useful":0,"cool":0},"LhVeOwXNdTu4CPwyaArG7Q":{"text":"I was in NOLA for a quick meeting and stayed nearly.  I visited twice.  Ate at the bar.  \n","useful":1,"cool":1},"h2l5d-K5xxwS-pT3v7GKAA":{"text":"Okay. Let me start by saying I looooooved this place. Nice and clean. Kind of rustic chic ","useful":0,"cool":0},"MmBhOXw6XGV3mwU3hGjA_w":{"text":"It's a great place to share a whole bunch of dishes!! The Brussel sprouts with bacon vineg","useful":0,"cool":0},"tVtszEjmfoaJe3E1RKu5pA":{"text":"Bravo Emril! Ridiculous how amazing this meal was. The Saffron Pappardelle was fantastic. ","useful":0,"cool":0},"SjOWEdn-jWy14H5XHbczJA":{"text":"So fun trying different tapas! We liked this better than his Emeril New Orleans restaurant","useful":0,"cool":0},"ozwCKTHMZ0kLewag3HnDjg":{"text":"We were a party of four with a reservation that was made 6 weeks in advance. We were taken","useful":0,"cool":0},"Q6Z8fUQ7EVFgeAAMdau_kQ":{"text":"Edgy, young, and hip, Emeril knocks this new restaurant out of the park. Great menu variet","useful":0,"cool":0},"uc1JEIdubiMq_62onhJcVQ":{"text":"The place is really nice, good service but the food, I was expecting much more because thi","useful":0,"cool":0},"_vhjsFBUlflKduWusyimeQ":{"text":"The food is delicious, but a little pricy for what your getting. The atmosphere is happy, ","useful":0,"cool":0},"6rymvMJXZebYdYI419GcqQ":{"text":"Emeril does it again with his newest restaurant. The food was amazing and service was grea","useful":1,"cool":1},"EV8ts_zO1BodXF5dFAcQbw":{"text":"I have been to all of Emeril's restaurants and with the exception of Delmonicos they were ","useful":0,"cool":0},"BWeXeYB-64nug-6hpIH5vw":{"text":"My friends and I had quite the feast at Meril's Chef Emeril Lagasse's  newest New Orleans ","useful":1,"cool":1},"3-uIJ8M5IbUyqQNNot-22w":{"text":"The food was decent but the service was absolutely terrible. Our waiter brought us an appe","useful":0,"cool":0},"GOwjmPvNOyVzbJ6XmZaowA":{"text":"We were intrigued to try this version of an Emeril restaurant, within walking distance of ","useful":0,"cool":0},"Ce48QhaZrJu2i_FNgQg21g":{"text":"This was my first time eating at one of Emeril's restaurants and I was very excited. Unfor","useful":3,"cool":0},"KaD7bOP4DD9GWEaqqZMtoQ":{"text":"I expected way more from an Emeril establishment. Cocktails were excellent, meatball appet","useful":0,"cool":0},"sU0vDdxl2xU1pU6FfoHDyw":{"text":"Firing on all cylinders! I've been here 3 times now and all 3 were great experiences. The ","useful":0,"cool":0},"ve83bHixHAk1h_0V93x9XA":{"text":"Not bad. I went with my sister in law for lunch on a Monday. The restaurant only had a few","useful":0,"cool":0},"76KXMUNpxR1tvGN6mdqh2A":{"text":"AMAING FOOD! Mexican Corn : MUST GET! Short ribs awesome! And .... the fries , idk what th","useful":0,"cool":0},"gLjPa5gqdFXDlwEYHaZy6g":{"text":"AMAZING food experience !!!!! We had Felix as a server -the turkey necks were impeccable a","useful":0,"cool":0},"7yETa5ZbobKu5hKYQRgQlg":{"text":"This is a tapas small plates restaurant. \nWe ordered the linguine with crab meat and it wa","useful":0,"cool":1},"UIbN8r2O-3PWAn_SAhkIdw":{"text":"I cannot say enough good things about Meril. Seriously- The food was so good that we were ","useful":3,"cool":2},"bwfSDlsEL7v4KwnMANBcxg":{"text":"We had numerous appetizers but the only one that was very good was the crab croquet, the r","useful":0,"cool":0},"eCt0EIS93ohM7o7pjeBjDQ":{"text":"Excellent!  We sat at the Chef's counter and had a great meal with Sean and Vidal.  Their ","useful":0,"cool":0},"lmSXctVy3q002zBsJSXOSg":{"text":"Loved the decor and the wait staff was friendly. Food was just average and it took a long ","useful":0,"cool":0},"zt7eMoTcmmLLDpaaSxiXkw":{"text":"Very nice ambience. My sister & I ordered a few dishes to split and they were all great. B","useful":0,"cool":0},"WCaPiccoZwDIj--qPT0uww":{"text":"Great food and drinks. Staff was attentive and friendly. Had lunch here and would definite","useful":0,"cool":0},"7_rDsM2aMip_eEjIopho3A":{"text":"Everything about Meril is gorgeous. The murals are enthralling and exquisitely executed. T","useful":2,"cool":1},"71fnFO68xMVf_4OKVxlLtA":{"text":"We thought Meril was average. Food certainly wasn't bad, but didn't blow us away either. W","useful":0,"cool":0},"r2YQOgJfnCKVgyE4FtLiWQ":{"text":"OK for drinks.  Not fine dining\n\nWhen the server says \"We recommend sharing plates,\" I fee","useful":1,"cool":0},"EylKRpMo3VJ8uUF6ha9cZg":{"text":"I was really excited to try the new Emeril restaurant during my recent visit to New Orlean","useful":0,"cool":0},"11vymXvdp1RqecRz8VR3Sw":{"text":"We enjoyed all the many dishes;\nCornbread\nChorizo Flatbread\nHanger steak\nShort ribs\nChicke","useful":0,"cool":0},"ZxH3c5Swhvrp_xqw8zaAJQ":{"text":"We chose Meril at the last minute based on the yelp reviews and we were not disappointed! ","useful":0,"cool":0},"MlmQtqRRngSdixGd5jt5Ng":{"text":"I was impressed by the demeanor and professionalism of the staff at Meril. They were all w","useful":1,"cool":0},"RgyJhXQI9ltaZD424c5lKg":{"text":"Absolutely loved Meril. The atmosphere is great for a night out with friends. The food is ","useful":0,"cool":0},"U_Or0allz-hRUA0P3q_KCg":{"text":"Excellent service. Amazing dinner. Fun open kitchen & lively atmosphere.  Wood burning ove","useful":0,"cool":0},"csObTK679UO7ynlCzuhopA":{"text":"So it's time to eat again, where to go oh where to go???? So many choices but we decide to","useful":0,"cool":1},"Qx7VtW5gGAkcI_7QbFaxMA":{"text":"One of the many fantastic places to eat in New Orleans! At every plate you get amazing fla","useful":0,"cool":0},"nhbGvPg9NnlP33ldHK-KGQ":{"text":"Casual yet upscale atmosphere. Bar has TV's but still avoids a \"sports bar\" feel. Food is ","useful":0,"cool":0},"WuvLCGuga_qT-JN_dUhJgw":{"text":"We went Meril for my daughter's birthday while visiting her in New Orleans. My wife and I ","useful":3,"cool":0},"UogPBbjZ7wmHN00VJ7FdIw":{"text":"If you are looking for a fun, upbeat and slightly louder atmosphere, this is it. We were s","useful":0,"cool":0},"U86K4utcXRwiGIH-QKajmA":{"text":"First time in NOLA and so glad to have chosen this place! Tried a few cocktails and food i","useful":0,"cool":0},"_MrwzvzyT8TctxX4QYyjxg":{"text":"Great dinner option! Really neat atmosphere, we were able to watch our meals being prepare","useful":1,"cool":0},"roFcpezDR-F3lv3-acL9hw":{"text":"Another winner for Emeril in New Orleans... this is a big, airy space, just noisy enough f","useful":0,"cool":0},"VyFxuArn-lFhbWZHcLjqlA":{"text":"Great food, great for birthday dinners! Really can be affordable, some tasty drinks. Been ","useful":0,"cool":0},"ZvbLR1OxItiNW7b6rf5KCQ":{"text":"Excellent food, inexpensive and a new concept for Emerald.  I wish he would open one in De","useful":0,"cool":0},"KdNTeqac9jYXk2GnoKYtgg":{"text":"Tiny portions. Undercooked, tough, under seasoned Korean short ribs were a huge disappoint","useful":0,"cool":0},"TDdDre2rX6d8tyCpU7kxpw":{"text":"Off the beaten path, so the clientele was not your typical Bourbon Street crowd. \nExcellen","useful":0,"cool":0},"YDt_fJMwiv-S82Xm09jUMw":{"text":"We had dinner here before the Aaron Lewis concert. First off, the atmosphere was wonderful","useful":0,"cool":0},"Ll_FqRZ3KD8Q8yKu2kjTqg":{"text":"What a fantastic evening at Meril on Thursday night !! We had a brief wait for our reserva","useful":1,"cool":0},"v1Uwkcsuch86IexoTYcXbQ":{"text":"Our best meal in New Orleans. Tapas style restaurant with a little bit of everything. Exce","useful":0,"cool":0},"6VxUBPq82pzmSNPXiFP12w":{"text":"So we just had a few snacks but can't wait to come back here.   Chicken liver side dish wa","useful":0,"cool":0},"mGxkeJyW7Iw4jazRwOwveQ":{"text":"Restaurant open for 2 day and off to great start. Great casual atmosphere, contemporary an","useful":0,"cool":0},"J0k_gMyJzi8yYZbaBGKKGg":{"text":"From the service at the bar to the meal we had for dinner this is a must visit in New Orle","useful":0,"cool":0},"AS9pnKUqMyWvmWKKXN7tug":{"text":"Basically an expensive Applebee's.\n\nWe had limited choices on a Jazz Fest Saturday and end","useful":2,"cool":0},"DFMZmqR4FlC57euUzHdI-g":{"text":"You must get the pineapple upside down cornbread!! Clean, great ambience, full bar, amazin","useful":1,"cool":0},"H-OCITSuVrDIwBZaP84F9Q":{"text":"Meril is the kind of place that serves small portions of deliciously trendy food in an env","useful":0,"cool":0},"Flw3f4FqCL97SGahWwOMqQ":{"text":"Fabulous menu, very noisy atmosphere and service was truly terrible...6:30 reservation on ","useful":0,"cool":0},"s5psFn0v6rfSKee08jlsTg":{"text":"Went in for happy hour and the happy hour specials are great. $5 flatbreads were delicious","useful":0,"cool":0},"OL_o4Gjkpd0882Izq1ErdQ":{"text":"My hubs and I stopped in for lunch, excited to check out Emril's newest place. The service","useful":2,"cool":0},"iW-A5Y01qC0yPCtTn5pqbg":{"text":"Fantastic experience! Food, service and atmosphere are top notch. I recommend the tuna app","useful":0,"cool":0},"geW8T1togTd3RmO6LeFxPw":{"text":"The atmosphere was friendly, outgoing, fun and very polite. The pasta was delicious. They ","useful":0,"cool":0},"4UA2j40q0CVAjQaCqVylPA":{"text":"Made a reservation last Saturday and although the food was great, I was really disappointe","useful":0,"cool":0},"Tm5s8pmdExJOzNIRdkUu7w":{"text":"We just visited New Orleans and decided to try out Meril. \nPros: Gorgeous restaurant. I ha","useful":0,"cool":0},"pQlqJ6OfP4X253t3lr4yoQ":{"text":"I was really excited to try Meril but overall felt disappointed. I dined alone (in town on","useful":1,"cool":1},"QKRZl2Ee0CHNf2fbP0NARg":{"text":"This is one of Emeril's several restaurants in the NOLA area.  We visited as a group of fo","useful":0,"cool":0},"JW-48mJ8iXnYSffJ52ltaQ":{"text":"This place gets super busy and packed for Happy Hour. I must say. I got the best Bubbly ch","useful":3,"cool":1},"vO5JHibc0TcapKyTlZIxpA":{"text":"I stumbled across Meril on Easter Sunday.  Our normal go to restaurant was closed for the ","useful":2,"cool":0},"IGWg3W0_qWrlAxhb84XgHg":{"text":"Basketball game on the TV, cold food, thong panties and butt cracks.... That about sums it","useful":0,"cool":0},"qXu1ODs6Vo7q_UJuWafLRQ":{"text":"This is a must have dining experience! My best friend and I had several of their dishes an","useful":0,"cool":0},"yC78Z2zpMrnFt3GlBwKipg":{"text":"Meril has such a fun atmosphere on a Friday night. There were a lot of birthdays and bachl","useful":0,"cool":0},"j7o0pIFRHb23a4JVXDrl1g":{"text":"First off, let me say that I really enjoyed the food. The service, however, is what made t","useful":0,"cool":0},"Ac-S0sw3afScdN55sg6UzQ":{"text":"Very nice place, very clean. We enjoyed the pasta dishes and it exceeded our expectations.","useful":0,"cool":0},"TPfpcLd8pIZlh_jTTsp22g":{"text":"Great spot for drinks and dinner!  Cool atmosphere, good food.  Brussels sprouts salad was","useful":0,"cool":0},"YtVpNXnMXVvrEhqLfWdkBA":{"text":"I came here for lunch with 2 other people from work.  They had the Brussels sprouts salad ","useful":5,"cool":0},"64ARbZwIIc-reBLfLWvEzQ":{"text":"The food!!! This has to be one of the best culinary experiences ever. The staff were atten","useful":0,"cool":0},"d7xZ04vx8oJgtrzPUHoC_Q":{"text":"Meril is an absolute homerun.  A delicious fried chicken salad, plantains and truffle chip","useful":1,"cool":0},"wtKo0Ji3MYAhUfcn_WuEVg":{"text":"We were headed somewhere else and asked a local about it and he suggested we come here!! S","useful":1,"cool":1},"wdPXaWos0_RUn-XduFfVEA":{"text":"We love Meril! Great food and service. Lauren, our waitress, was awesome. She was informat","useful":0,"cool":0},"ls-nh-CMuf5bRxA5JfyY6Q":{"text":"This place has great murals on the walls and contemporary furnishings and accents and feel","useful":1,"cool":1},"xyP-QTyyAerBzqWRiGj_Xw":{"text":"After hearing so many positive reviews, I decided to give this place a try. Wow!  This pla","useful":0,"cool":0},"xrEfqGx9OCR1thzsy0nRKg":{"text":"Great atmosphere, nice portion sizes. Service a little slow but good. Interesting menu and","useful":0,"cool":0},"EByAjKSGak1sngvg2RX-Yw":{"text":"Food and ambiance were very good. Loved the deviled eggs, chicken legs, ahi and awesome Fr","useful":1,"cool":1},"36MuOuYhQRqtmADpm-Njdw":{"text":"I had an enjoyable meal with friends at this Emeril's concept. Lots of hits and a few miss","useful":2,"cool":2},"ubhoIbC5TTAApk4dkFhJkQ":{"text":"Awesome experience all the way around. Best restaurant service I've ever had. Food was del","useful":0,"cool":0},"okQgv1uGnx7JjzgKD2rEHA":{"text":"This place was amazing.  We were in town for a conference.  Super chill and laid back as f","useful":0,"cool":0},"kqr9AhFi5K-d7ZwoKAtqfQ":{"text":"Not my favorite tapas place.  We heard good things about this restaurant but were somewhat","useful":0,"cool":0},"AXZynPjm7vrScb764pB1SQ":{"text":"Highly recommended .. with a  stylish interior which works well for the restaurant .. and ","useful":0,"cool":0},"vvJpK0AzdaYe-YpW6FotCg":{"text":"Texas was a phenomenal waiter. Professional, knowledgable and kind.. Felix was amazing as ","useful":0,"cool":0},"LqljY3AGM_laR9VATmK7hw":{"text":"Great menu with delicious variety of all kinds of food. I had Oysters and Korean Pork foll","useful":0,"cool":0},"PIuc9q1cE69j3XBySIu1tg":{"text":"Good vibes and good drinks. Food was very average besides the Saffron Pappardelle which wa","useful":0,"cool":0},"rKjFZuvbaCGCnUzFbEP4Cg":{"text":"This was hands down one of the best meals in NOLA. The menu was creative and perfectly exe","useful":1,"cool":1},"hDgY24JeZpU7HxWSlgUTbg":{"text":"Food was delicious, but...it was about three bites of food. Not worth the wait and money. ","useful":0,"cool":0},"600NLEwRaeQRyaIPIDdi8w":{"text":"Had fantastic meal Friday night. Tried the Turkey Necks as a appetizer . FANTASTIC . Try t","useful":0,"cool":0},"OR__DeJrWZPWZIk2ly7Tzw":{"text":"Korean chicken was very good. The cheese board came with fruits and chocolate and the lemo","useful":0,"cool":0},"7gjb3a7l4I61wvxtbOJS6g":{"text":"I was extremely pumped to try this place after looking at an awesome menu with lots to cho","useful":0,"cool":0},"ysSERQ6zjU7nsbvgUkGv7w":{"text":"Emeril is one of my favorite chefs. I was looking forward to a mind blowing experience. \n\n","useful":0,"cool":0},"sQg8LzTRH9LlnBfhkRn7KA":{"text":"I've been to Meril twice and have decided this is my favorite restaurant in NOLA! I was ab","useful":0,"cool":0},"sEkFshBAVs924aDKIylq2g":{"text":"So disappointing. We wanted a light dinner and got the Tuscan kale salad, crab croquettes,","useful":0,"cool":0},"78kGcqMRyB2qbpjCSF3R5Q":{"text":"A new entry from Emeril Lagasse in a nice section of New Orleans. The resto features a bea","useful":2,"cool":1},"FhQvB3tK_fkNYjJ4JxxnFA":{"text":"I was here on a Friday for business lunch. Service was excellent and educated on the fun t","useful":0,"cool":0},"GlszD0YWrduO0Z2G9iO2uQ":{"text":"After reading some of the negative reviews, I was a little concerned after making the rese","useful":0,"cool":0},"uyXdCQkSccFsd9f_anDmfg":{"text":"Love this place! Great service, great food, reasonable prices. I came here one night attem","useful":4,"cool":4},"lbeUb9X6PpShd9q60ZgNAQ":{"text":"So the food is amazing - Korean short ribs, Brussels sprouts to die for - such a great and","useful":2,"cool":1},"9Pyj0LOu9qbc6lCFCo92qg":{"text":"Ice crab noodles is really good! Freshly made! Corn good but a bit messy! Oysters is okay.","useful":1,"cool":0},"XIeQxKZae0OckaAH-S83YA":{"text":"Amazing... Candied pork ribs, corn on the cob was delish, pork tamale, and a few items on ","useful":1,"cool":1},"Ko7ryDEMsQ3nEQ8gG6GFAw":{"text":"They accommodated us for a party of 16 on relatively short notice. Food was prix fixe but ","useful":1,"cool":0},"QHYip8VBqMP8ZWylWrfiTg":{"text":"Stopped in today for lunch. The restaurant is well designed and comfortable. Our server wa","useful":0,"cool":0},"rCkdK80C9fEvPh9GwVKE9A":{"text":"This restaurant is amazing. It's food is from another planet. Highly recommended, with a g","useful":0,"cool":0},"WGmkHW208QN1MlDKk-vwQg":{"text":"Amazing, worth our wait, prices were insanely low compared to quality of food!! Will go he","useful":0,"cool":0},"BvGAiQvk1zHHOg8L71OdFA":{"text":"We had such a great meal here! The service was phenomenal and we were given so many food r","useful":0,"cool":0},"jlbPvLHHU2GAy9KGpk2QoQ":{"text":"A new Emeril's concept with little plates where I still ended up eating too much.  My frie","useful":1,"cool":0},"OBS0fOb6PVXhMFurQr_y6g":{"text":"Food was perfect-wish I could have tried more items from the menu. The pasta special had c","useful":0,"cool":0},"1ordxfbhm9A0FUD4rCoamA":{"text":"I took my Dad as we were down in New Orleans celebrating his retirement. We were a big fan","useful":0,"cool":0},"HMNUvLwOLJfKm8MjEXkY6w":{"text":"Interesting menu.  Cool ambient, and service was good. Had Korean fried chicken and Korean","useful":0,"cool":0},"qcPNVHkgF_SD5f3sdkrpyg":{"text":"Service is really good and thoughtful: it was our anniversary and they provided us a treat","useful":1,"cool":0},"c4R_sTP1viHKx4MtjLJhrA":{"text":"Modern look with an old school twist. Great food. Personable service. Perfect for celebrat","useful":0,"cool":0},"RzxoAtwHgEsGgSOix_quQg":{"text":"ent for drinks before dinner somewhere else. Had a little time left on happy hour so my si","useful":0,"cool":0},"Xk1nc08f9QRrg9MjttNahQ":{"text":"Success, Meril is an important and current addition to Emeril's restaurants. Don't come he","useful":0,"cool":0},"g202B2Xb5r8KKgSO342CyA":{"text":"Delicious and very interesting food.  We didn't have a reservation but since there were ju","useful":0,"cool":0},"mZ41ILAfAoWss52MDph_Tw":{"text":"What an experience!! For only being open for less than two weeks this place hums. The food","useful":0,"cool":0},"jNgV2Tf72nGdNuMQtKdDug":{"text":"We were disappointed by the food here. It sounds amazing but it tastes like its institutio","useful":0,"cool":0},"rftLQDmdqeDn88GREAsCkg":{"text":"We sat at the tables by the bar, so couldn't really see the main dining area.  What little","useful":2,"cool":0},"SE2LAx99CqiVGtQoS4ob4w":{"text":"Ok, I literally LOVE this place! Everything they have is so good. I love the variety of th","useful":5,"cool":1},"t4LdPirNd-VxcjUCSY6oEQ":{"text":"Food was great! Tuna, biscuits, and crab croquettes were all fantastic! The main dining ar","useful":0,"cool":0},"VEwqvxKOiQ-nPvw-uEBrmA":{"text":"I thought that this was a very good atmosphere ... my style of interior, music, etc. I tri","useful":0,"cool":0},"Hq0WnaFVSxGPU086kQsucw":{"text":"Meril's did not meet my expectations. Service was really slow and they weren't that busy. ","useful":0,"cool":0},"Tm3pa1LlwdtjtD0LFJj6Tw":{"text":"Delicious! Meril's has a gorgeous space, cute waiters, and good food. The only drawback wa","useful":1,"cool":0},"I_5M7UkfPE7uZSvYSsLBgQ":{"text":"Had the opportunity to try out the new Meril restaurant with my family the other week. Thi","useful":0,"cool":0},"GutmuV_M0lRPgOFfrmoxSA":{"text":"I have been in New Orleans for almost a week and this is my favorite dinner place i have e","useful":0,"cool":0},"uF-3d4qUGOOOcmoa252jcA":{"text":"This place is awesome and I will be back, the menu was amazing and I believe they wait tab","useful":0,"cool":0},"aUhc8UR9GUGU-ibvLPCCZw":{"text":"Probably need a few more visits to get this to a 5 star.   Food and service excellent.  Ha","useful":0,"cool":0},"0miI__4bg4AypuHev_bzxA":{"text":"Hopping. Great menu choices, tapas style.  Good beer selection.  Place to go with friends,","useful":0,"cool":0},"KyJZLh0xA-U9sUaUuB7l2g":{"text":"We were so excited to try Meril. The Brussel sprouts salad & side were excellent; same wit","useful":0,"cool":0},"s_lSLnHZtkHP6nhVAQ_cWQ":{"text":"I've been to Meril's a couple times and the few times the food is very good. The service c","useful":0,"cool":0},"ESfGegp4RC-pwDIBNNW_GA":{"text":"I'm a big Emeril Lagasse fan and have eaten at almost all of his restaurants in Vegas and ","useful":1,"cool":0},"_z3lCz157wtyCh3fDNArDA":{"text":"I suggested Meril to a group of friends, for our annual holiday dinner and they enjoyed it","useful":0,"cool":0},"MJbnMtxeWn1OOLSOuxviyw":{"text":"The food was amazing but the service was lacking.  Drinks were slow, appetizer was quick, ","useful":0,"cool":0},"1UM59tswYSk1K2UaAoAVbg":{"text":"So...I'm in New Orleans on business and remembered that I got an email about Meril being o","useful":1,"cool":0},"w4kiCQwT_UcQ6qazimjDPQ":{"text":"Food subpar. Overpriced. Oysters terrible. Brussel sprouts pretty good and short ribs very","useful":0,"cool":1},"dZYPxHUW7z4M3LM1UEPmrw":{"text":"This is an Emeril restaurant and it was delicious. I really like the atmosphere here and t","useful":0,"cool":0},"D5fL564GJo9d0fAUYKfp6w":{"text":"Party of 4 went back in July, it was wonderful. Service and food was great, remember, thes","useful":0,"cool":0},"mZLIB7wbj50NZLNazZSYag":{"text":"The most perfect experience! Hubby and I decided on a night out, dinner and drinks. My coc","useful":1,"cool":0},"SI35T1PpuEWFPzlVDKYR0g":{"text":"The food is awesome!!  Great quality for the price. We had the crab croquette, flatbread s","useful":0,"cool":0},"31cSDITvmvfxYrdJSypMog":{"text":"We visited in the first week of December 2018 for dinner and had the \n1. Crab Croquettes\n2","useful":0,"cool":0},"hbE6peVBMEYf2lOM76ONSw":{"text":"Meril is my favorite of all the Emeril Lagasse restaurants in New Orleans. \n\nOutstanding s","useful":2,"cool":0},"sxt5iO3DKtnJqqSwrwrtnQ":{"text":"You look at the menu and what to try it all! Well, their small plate concept allows you to","useful":0,"cool":0},"Oc89WBABJmYUcYmh9CZG4A":{"text":"Favorite meal in NOLA! The service was excellent. The food was delicious without being ove","useful":0,"cool":0},"4_VSLQfcsAu8lddMymjlFw":{"text":"Emeril must be a great chef.  I'm not a fine food connoisseur but I've definitely been aro","useful":1,"cool":0},"hHo8nxBC71sPmvwf_JgdQA":{"text":"Super excited to come out to the newest New Orleans restaurant that's owned by Emeril and ","useful":1,"cool":0},"iKHKbClym7jZlLvOGTRiPA":{"text":"Beautiful restaurant in the Warehouse District. Cool and cozy interior with an open kitche","useful":0,"cool":0},"1-ZQNhGaj77eN0W5zapnKg":{"text":"WOW!!! I'm spent 35 hrs. In New Orleans for work and had the unbelievable pleasure of eati","useful":1,"cool":0},"UVZPY36_03JmWj01ZqZTQw":{"text":"My friends got together and gave me a surprise going away dinner here before I moved to Da","useful":0,"cool":0},"YbHll2EmzIQF7mfywhTw0Q":{"text":"Had the best meal.  Best waiter - Patrick- really knew his stuff !! Made great recommendat","useful":0,"cool":0},"2F5FUYsjH8f7h8Q7uorBuQ":{"text":"I absolutely loved this restaurant!  It is Emeril Lagasse's restaurant and it certainly li","useful":0,"cool":0},"hhx6hKLAepGU31FoUgDtsA":{"text":"The good first...rock shrimp tacos, yellowtail wraps and tuna poke! So good!!\n\nSadly, the ","useful":0,"cool":0},"_MuoOEhsK_KR9nqwpgY9RA":{"text":"Decided to head over the Causeway and have dinner here last minute. We ordered the Meatbal","useful":2,"cool":0},"N0qJAX1SSJe49YS6ZLWFrg":{"text":"Meril is very popular with the people. Good location in the Warehouse district good wine g","useful":1,"cool":1},"m1wU379JR4nlcxvPn4BxsQ":{"text":"Serendipitously stumbled upon this place after doing the WW2 museum, as it was one of the ","useful":3,"cool":1},"yiquaAq0vV_lV8GCKujGxw":{"text":"All I can say is WOW most incredible food, amazing ambiance, top notch service! I went her","useful":0,"cool":0},"Yn6xIB8paLWPri5nHX3IHQ":{"text":"I can't say anything about the food, because I never got to try it.  We made a reservation","useful":0,"cool":0},"gnL4XMaD7JyOngD-ZYVkOw":{"text":"Great show sitting at the kitchen bar.  Just the two of us, no reservations.\nTerrific serv","useful":1,"cool":0},"vpHsk4E43EnZHcMIW0TKUg":{"text":"Excellent location, decor, wait staff and delicious, unique cuisine. Really loved the art ","useful":0,"cool":0},"HZHgcYtzSkIox4KJ_ZRaRg":{"text":"The restaurant is absolutely beautiful and full of fun! It was a great dining experience w","useful":0,"cool":0},"jm5pKfExH9KnhWfOJiGoBA":{"text":"This is a beautiful restaurant and we loved our time here. We would recommend the calamari","useful":0,"cool":0},"K1vdmk4F7XXoeYbLmp8TEQ":{"text":"We absolutely loved eating at Emeril's during my last visit to NO. So this time I decided ","useful":0,"cool":0},"LkUMYN3F-3K_yRViFdCfdQ":{"text":"Great atmosphere with fantastic service! Portions were a little small, but the food was de","useful":0,"cool":0},"M-4OP4-qMbjJFpkw4GxZxA":{"text":"We tried Meril a few nights ago.  This is Emeril's new NOLA restaurant (#4).  Excellent.  ","useful":4,"cool":2},"_tkLvjUeOyUp6ZFmT9y3HQ":{"text":"Came here for lunch on a Sunday when there was nothing else open. I was desperate, and giv","useful":2,"cool":0},"anPQEalZtTVDNng3Wc2ObA":{"text":"Emeril has done it again. A delicious, creative, small bites dinner spot with great servic","useful":0,"cool":0},"wMHLdMqCIIItwjAn9gxYUA":{"text":"Totally fun place to din. Great staff great atmosphere and great food. Our entire group of","useful":0,"cool":0},"KusBe8GGmiESFU2hxaeSyA":{"text":"The service was above average. The food was mediocre to above average. The muffuletta flat","useful":0,"cool":0},"8aG8MXI-sauJwmx55ZOVtw":{"text":"Such a great place for groups and celebrating! The atmosphere is very chill and social. Th","useful":2,"cool":1},"wtIPWjHPZTKa6HMBpWnKzA":{"text":"What can I say. The service was amazing the food was over the top perfect and we had a big","useful":0,"cool":0},"Yn1qVjF60Cu0mwWn7QB3PQ":{"text":"food  here is excellent and well prepared with a great menu. The drinks are wonderful. The","useful":1,"cool":0},"tCm9mzU_3YM9I9VaYtI_kA":{"text":"Wasn't very hungry when we got there for happy hour but really wanted to try out the food.","useful":0,"cool":0},"gFy745Qago9V5_9kDOwV-A":{"text":"Oh Meril... you didn't succeed at impressing us. \n\nWhile in NOLA, we tried all the local f","useful":1,"cool":0},"JDxGLqfLnj3dVHYjB6Vg7A":{"text":"Place: AWESOME. Ask to sit at the chefs counter it definitely enhances the experience!\n\nFo","useful":0,"cool":0},"zFbANm-RjXP2cFP4DZdMkA":{"text":"Lively scene with great food and very attentive service. We surprisingly enjoyed sitting i","useful":0,"cool":0},"La-C3J24mp1wRBlHhkzHhg":{"text":"I had dinner here two days ago. Under normal circumstances should there be any kind of iss","useful":0,"cool":0},"gvcwqxrIGIsbKFgUWu5AfA":{"text":"Great atmosphere. Energetic wait staff and the variety of food is amazing. It's like takin","useful":1,"cool":0},"SQONKob7I62_OLgt07JcUA":{"text":"Pretty much everything on the menu sounded wonderful, and everything we tried was great. T","useful":0,"cool":0},"IrOHHxMJdAftQZOAJmv0Mw":{"text":"My favorite of all the Emerils. A new concept for a Emerils restaurant. Beers on tap, ice ","useful":2,"cool":1},"5vCb6dWcTlaDMzGwbyMvqg":{"text":"My husband and I visited Meril on our getaway trip to NOLA. I called to make reservations ","useful":0,"cool":0},"pa8USNhmbEcuWeMo9yOvHw":{"text":"Service was great. Very patient in answering lots of questions.  Our party of 7 all were v","useful":0,"cool":0},"8lKzQPNxOY2vgF7yXCG5oQ":{"text":"On my trip to New Orleans I wanted to have an experience with Emeril Lagasse and his resta","useful":0,"cool":0},"jdUmIuXEF-cwoe2gVIM1Hg":{"text":"We came without reservation Saturday night and were seated almost immediately, bridal part","useful":1,"cool":1},"nXfQrMyYZebG8IPGpGkhvg":{"text":"Service at the bar was excellent. The local New Orleans beer was surprisingly good, and so","useful":0,"cool":0},"c6U7vot8J5s7Y4BYhh2-dQ":{"text":"One of my new favorite places in New Orleans! Super cute place with great food. We tried s","useful":0,"cool":0},"hVuw-L1lXsXFISfv2iFK5Q":{"text":"Gotta preface this by saying I've never been a fan of Emril's restaurants in the past. I w","useful":0,"cool":1},"hH2qHl0Imr7TdZ6N9jGHeA":{"text":"Meril's is a nice place yo have a good dinner. The staff is very nice and helpful in descr","useful":0,"cool":0},"B_LuqTlKb7jzP6-JSDjLDQ":{"text":"My first visit here was amazing. Appetizers, entrées, and dessert was on point. We ordered","useful":0,"cool":0},"NbfzhbaQSKGRwruNW_bX8A":{"text":"Food was good but nothing spectacular. Service was same. Portions are small and the flavor","useful":0,"cool":0},"-knDS_td2RZG5elKrT25bw":{"text":"My wife and I tried Meril last evening. We thoroughly enjoyed the experience. The restaura","useful":0,"cool":0},"KaeH9Z-CkRefcXuCbq1IMA":{"text":"Food was great and also the drink. Great ambiance & atmosphere. Very sad that they dont ha","useful":0,"cool":0},"-n80W72nEszUDAIOjZMsvQ":{"text":"Never again. From slow service (over an hour for food), to a drink with a fly in it , to a","useful":0,"cool":0},"nhPglOy9Uy-dFmop3X8SNA":{"text":"Absolutely incredible. A NOLA must... 2nd time.. Emeril doesn't fail.... The waitstaff is ","useful":0,"cool":0},"77U926wTwIKVjxNs47VZWA":{"text":"Such an awesome place. This is a must to for New Orleans. Delicious and affordable and bea","useful":0,"cool":0},"CV_zc864WRr7Mte5rjPInQ":{"text":"I loved this place! I went with a few girlfriends on a Friday night and we had such a grea","useful":0,"cool":2},"XjSC6wE5maBuD7nz-EOnfA":{"text":"I love the food here, but the service is so bad it's astonishing. It ruined our meal tonig","useful":0,"cool":0},"An37JmwDrGDRBLkFqPrvpA":{"text":"Fabulous!  Went for an early lunch on a Friday during Jazz Fest.  Walked in and got a seat","useful":0,"cool":0},"BgrqtmLXjj6TCxfIppNVpA":{"text":"Wow. First time here and I can tell you the food is amazing and the selection of items you","useful":0,"cool":0},"V03Qu0y22qMiktYpmf1atw":{"text":"Meril provides great flavor rich food in a nice atmosphere. I tried their Saffron Papparda","useful":0,"cool":0},"cMeWPuLbnP9L6B-3Ih7hqw":{"text":"Went with a group. Loved the small items so we could try different items. The truffle chip","useful":0,"cool":0},"KlFKMKNHv12rCzOF9i5D9Q":{"text":"Meril offers the whole package... as I like to say it's the triple threat: awesome ambianc","useful":0,"cool":0},"JtqtH723nLUD46XQoO7boA":{"text":"1st Dinner in NOLA & at a EL restaurant. Being a small plate joint - we did our best to sa","useful":1,"cool":0},"7YIfd-hdtUTRFJdbeh7cMQ":{"text":"Very cool small plate restaurant. Different interpretations on different foods. So good. J","useful":1,"cool":0},"D11AwEnbdvQiAMTX6160pQ":{"text":"Loved our evening at Meril. Food was outstanding and service was exceptional. As much as w","useful":0,"cool":0},"oOJW1nmFAq09AD4tBBqYVw":{"text":"This is my favorite place to eat when I'm in NOLA! I usually sit at the bar when I'm alone","useful":0,"cool":0},"YM37COgjfUUjxY9vNcfc0A":{"text":"Crappy but Expensive\n\nGiving this two stars because the cocktails were good and the people","useful":1,"cool":0},"ornZlhEZifJbzZXJbqloNg":{"text":"I love this place and will be going back! Such a nice experience and delicious drinks! (te","useful":0,"cool":0},"Z6E9a0lgwfFLHjCY952XwQ":{"text":"My boyfriend and I went to Meril for a date night on our trip to New Orleans. We were able","useful":0,"cool":0},"ZrmWEy5-Azv8AB39LvASsA":{"text":"I've never established my favorite restaurant of all time...that is until I traveled to Lo","useful":5,"cool":0},"VZR7--8KkglJyPIoovOpjQ":{"text":"Cannot say enough how much we enjoyed our experience here, from the staff to the food ever","useful":0,"cool":0},"3b3d6Gsws1gFBBU1iNNI_A":{"text":"This has been One of my favorite restaurants in New Orleans so far! Great service, winners","useful":0,"cool":0},"d2mCZm5tr6QCMsqaJNY_7Q":{"text":"One of my favorite places to dine in NOLA. Every time I come here (almost always to celebr","useful":1,"cool":0},"O-FpuDKh-7dbNKDdU8iEwA":{"text":"We were in town to celebrate my boyfriend and I's 30th birthday and were recommended to ch","useful":0,"cool":0},"poDLjGxmT2ujCDM2bjs7Vg":{"text":"Not a five star place because of the food but rather the staff and the food. Super friendl","useful":0,"cool":0},"SPoJ0UJhCTFMp2fucUNAfQ":{"text":"Great food & service. We had the ribs, fettuccini Nero, and a few other dishes. All were g","useful":0,"cool":0},"yNZeLWavU9o7o4pJvjavPQ":{"text":"This not for anyone looking for a typical Emeril restaurant.  More relaxed and casual than","useful":0,"cool":0},"KfcDdLsyHT64ZXcYqk14pw":{"text":"I came here with seven family members on a Friday evening. You would expect poor and slow ","useful":0,"cool":0},"8ASK1spvxfZiN3a4SNo8YQ":{"text":"Another great experience!\n\nI have eaten at Meril's about 6 times over the last year and a ","useful":0,"cool":0},"fEv7q53m5cg815JXgEBFJw":{"text":"Our favorite meal of the trip, our favorite dinner that is.  Love the ambiance and decor i","useful":1,"cool":1},"IihoBUWO_mj_3b1un6OPaA":{"text":"Food was a bit too salty. I had the lamb dish and w felt sick shortly after. Appetizers li","useful":0,"cool":0},"Z59rqLWPKw6a-_vA3jT6Fw":{"text":"We love this place. But, ahem. The food is good, worth the price (overly salted, but that'","useful":0,"cool":0},"AmVeJ7ewJ30wkiKrOJuPEQ":{"text":"Meril is Emeril's newest restaurant in New Orleans.  The happy hour was just implemented i","useful":2,"cool":1},"HXNrxYCY9QnI5xx1c68qQQ":{"text":"Nice drinks for happy hour\nGreat flat bread\nWonderful atmosphere great place to come chill","useful":0,"cool":0},"3K_C4Fw-Yca-aYXDV0-vXA":{"text":"Extra credit for operating under extraordinary circumstances.  Pervasive street flooding m","useful":0,"cool":0},"ammbNwGkxa_o0eqL_DHhnA":{"text":"Love this place. Basically a tapas bar. They have great food, wonderful wait staff and goo","useful":0,"cool":0},"Cdkk1TlbVjumxVSdHS6lqA":{"text":"Made last minute reservations for a group of 4. Arrived early, but had to wait for the res","useful":4,"cool":3},"3TMf9B2DI_mTONPWhmMX0A":{"text":"OMG... don't even know where to start. Everything on this menu was amazing. From the tequi","useful":0,"cool":0},"HpNYY2oW6np3P5r4gUY2NA":{"text":"The food was edible & the service was horrible. Our food came out before our cocktails and","useful":0,"cool":0},"3eakyTe3ozrBG2jQxSlsRw":{"text":"The food was good and the staff was very nice.  Small plates but the prices are not small.","useful":0,"cool":0},"mNMS-iRhss9b_dca6vTO3g":{"text":"A new favorite in Nola for me! Food was a mix of everything.. great craft drinks also!","useful":0,"cool":0},"3a6NCl_e3bLGCprUobE5kA":{"text":"Our best meal in New Orleans. Not touristy, no gimmicks, just great food, service, and dec","useful":0,"cool":0},"xdzsufnUy-dD5HB2xY05CQ":{"text":"This restaurant was recommended to us by a friend after a trip here in New Orleans. They s","useful":0,"cool":0},"v-ksT0cel017aCh9eBkx6A":{"text":"I really enjoyed the pork belly with the soba noodles (they have chopsticks). I think I'm ","useful":0,"cool":0},"iZf_vbCLMrUEht4vR4-gMQ":{"text":"Exceptional for lunch!  Great atmosphere. Attentive service. Excellent flavors across a va","useful":0,"cool":0},"CS2ETaN7Cnsfk20spcUqEA":{"text":"We stopped here for lunch while on vacation and exploring the Arts District in New Orleans","useful":0,"cool":0},"nYGceSE_vv8gBeEqB8S4Wg":{"text":"Food is excellent! Service is interesting.  Prompt when you arrive. No follow up afterward","useful":0,"cool":0},"BNcCqwDRDMmx15sufQzPsA":{"text":"Has one of the best shrimp tacos that is what I would recommend \n\nAlso very good tameles t","useful":0,"cool":0},"H2GLCUzXoIO4sHvsnbp6HQ":{"text":"The cocktails and food were amazing with an unexpected level of flavor depth. Food came ou","useful":0,"cool":0},"0SfzXfAfnd0e3c_HD8V-wg":{"text":"Came here Saturday with a friend.  Got seated right away.  We were in the back by the kitc","useful":2,"cool":5},"5kU4_owMzvavD_hivCetpQ":{"text":"Service and food both excellent. Highly recommend. Very interesting menu with large variet","useful":0,"cool":0},"-2DDFMReePs1vuqlxVgCXA":{"text":"First time in New Orleans and this place is awesome! Loved the Dixie Lagar. The snapper wa","useful":2,"cool":0},"OW-m7Jn9I2D9RMzbPShs7A":{"text":"This place is really nice with a really cool atmosphere. I really enjoyed the smoked fish ","useful":0,"cool":0},"ewtajlMSSwABACf95ws0dg":{"text":"The decor is upscale modern bar.  Sat at the bar as the host said it would be a 45 minute ","useful":1,"cool":0},"AKwNKd4Vp5hMbePf_UE42w":{"text":"Great staff, super friendly but gave you plenty of space. Music was top notch and most imp","useful":0,"cool":0},"ZS5LiEYGKEaz0Aiey3O3YA":{"text":"Very overpriced for what we ate. Food was subpar at best. Very dry chicken and an expensiv","useful":0,"cool":0},"8NNy8ku1V94rppqMdIoaeg":{"text":"Came on a Friday evening and the atmosphere was really buzzing. We are still thinking abou","useful":0,"cool":0},"aEHOY2FZOqlQUQw1QoGzSw":{"text":"LOVED the crispy turkey necks, deviled eggs and Brazilian shrimp and grits.  Topped it off","useful":0,"cool":0},"xJyxEtKMhh47EIJbZtq83Q":{"text":"Bottom line first:  tapas, good food and service, LOUD\n\nWe made a reservation for a expect","useful":3,"cool":0},"kUqerc9gsoKGpxXKxWArvw":{"text":"Went for drinks last night and finished up having dinner. Great atmosphere and amazing foo","useful":0,"cool":0},"J3rNaAxhDQDKq0cpQ5F1Gg":{"text":"I am not a big fan of Emiril's restaurants because I usually think you pay way too much fo","useful":1,"cool":0},"_2jeEhXrKOSTV7qJlDIhVw":{"text":"Meril is, by far, one of my favorite restaurants in the city. I love the diversity in the ","useful":0,"cool":0},"ip2qHVAbcnTa59Ld5lS8qQ":{"text":"Fantastic food and service.\n\nPortions are smaller so we could handle starters mains cheese","useful":0,"cool":0},"oawqNMK6oLxoJeQY33Cv8w":{"text":"Excellent staff and service. The dishes are well thought out and delicious. This is the so","useful":0,"cool":0},"nUoGzzGw2Wg20qqmyIrOpg":{"text":"Delicious birthday dinner. Love the snacks to share. Food is so flavorful!!! Will be back!","useful":0,"cool":0},"F8xMd1LyPnyrfzQ8xMW56A":{"text":"I was totally surprised when we came to this place, the atmosphere, music and crowd is ama","useful":0,"cool":0},"0_P9zMhDYs0SW7d1bobnmg":{"text":"Let me start with Jason. He was amazing! Informative,  helpful, and hospitable.  The food ","useful":0,"cool":0},"1nD8BBYvuQEdYCC03Hx82Q":{"text":"Went here for dinner on a Saturday night. Had a reservation and were seated right away. Re","useful":0,"cool":0},"foO1n5VLAhuMNp_U19Gj6g":{"text":"The ambiance was perfect. The food danced across my taste buds with flavors hitting on dif","useful":0,"cool":0},"wtDmCD3d4NPP084NSpMsJw":{"text":"Our first time in NOLA and I a huge fan of Emeril since he started his show back in the da","useful":0,"cool":0},"59Xx7LcnLE80fZVTI3P73g":{"text":"!!!! I BET MY REVIEW MUST BE REALLY HELPFUL FOR THOSE WHO DONT WANT TO BE IN A TERRIBLE SE","useful":0,"cool":0},"54_V-JhjQS0LpF7EJrmfVQ":{"text":"I'm only reviewing the bar and two cocktails because it was the worst bar service I have e","useful":1,"cool":0},"eAm6o8Vk5xVQ1YFtWBSjFA":{"text":"What an honor to eat at one of Emeril's restaurants! We were not disappointed. The salads ","useful":0,"cool":0},"mjh973mTW0XLiF8dC6d4Yg":{"text":"So, I made a reservation for 9 people around 9:30pm a week prior and we got seated around ","useful":1,"cool":1},"VRpTAYhKo0HA2yaJPc3zrw":{"text":"We just keep coming back to Meril. It is so much fun to be in this great, lively food pala","useful":1,"cool":0},"uIMEADP6ST27oDcqk46fFQ":{"text":"Excellent atmosphere, great ambiance, tasty food, great selection... Very eclectic. Great ","useful":2,"cool":2},"IucqdaJ2OUPVR1X_Tj_FKw":{"text":"Food was excellent and the service was top notch. \n\nWill add more soon.\n\nWill also add inf","useful":0,"cool":0},"w6tqlLJO9F0978hSDeBk7g":{"text":"When presented with a restaurant that has the option to sit in front of the open kitchen a","useful":2,"cool":1},"KSVhKt8IYfdZ4Axph_KPzw":{"text":"Fantastic dinner, many small and medium\nplates,  perfect for sharing. Excellent, upbeat an","useful":0,"cool":0},"tKTqIezIEowDxX3BatT9aA":{"text":"Fantastic food, fantastic drinks, fantastic service. Got a reservation at the last minute.","useful":0,"cool":0},"86LzE-9b8vjbsrylDlWM3A":{"text":"Emeril Lagasse's restaurant group has a new addition: Meril's. It joins Emeril's Delmonico","useful":1,"cool":1},"2daoaT6bPrGGk--NkhWBxQ":{"text":"My friends and I were looking for a cute Saturday night dinner spot with the good vibes. I","useful":0,"cool":0},"fcRHFtL_ShBWS6djsUy13Q":{"text":"I am so mad this was my last stop in NOLA. I would have eaten here on more than one occasi","useful":0,"cool":0},"NkhEPXUWIgG7tyQM_cOTwg":{"text":"The food was delicious! I had the red pepper and corn chowder and the fettuccine. I wish t","useful":0,"cool":0},"gwpIHuLvkwY4d1fdSMB12Q":{"text":"I wanted to eat everything on the menu and wish I did! Save a little room for dessert -- t","useful":1,"cool":0},"ffgcbwlPHKWB7c2KOBJOaw":{"text":"I was pretty impressed with Meril - in general the food was really good, and a good value ","useful":6,"cool":4},"gp7IfMwHUucKas3YJ6SinA":{"text":"This is a beautiful space and a fun and lively scene.    The service was quite good as wel","useful":0,"cool":0},"ixI_W1PjJjsvsWHYxtaD-g":{"text":"Amazing and affordable restaurant from Meril! I got the daily special pasta, fried blue cr","useful":1,"cool":0},"kSW-m29epopRWNfef1ILww":{"text":"Absolutely worst service I have ever had. The food was okay and it took about 45 minutes t","useful":0,"cool":0},"Xp0K1orAsILig3NxqeY0AA":{"text":"I honestly don't know how this place stays open-not one dish was good.  The drinks were wo","useful":0,"cool":0},"huYOglvQLk3TDuGz35dtzw":{"text":"The food was pretty amazing. Since it was all tapas like, we ordered a whole bunch of dish","useful":0,"cool":0},"Z1j9idwF-vVmogplhX2n-w":{"text":"We stopped for Happy Hour cocktails and a couple apps.  After tasting the veggie flatbread","useful":0,"cool":0},"Szz6MkyGtDzi_QMy2V7hUQ":{"text":"Meril was moderately good. I will note-- walking in I had high expectations as it is one o","useful":0,"cool":0},"JOxN0jnvwRPJUZUUM6pF8A":{"text":"One word. AMAZING. I absolutely loved Meril. The reviews that I read did not disappoint. M","useful":0,"cool":0},"BRkEq8gHekeHKm1P2kw-gw":{"text":"Amazing food and service team. Our waitress went out of her way to add extra items to fit ","useful":0,"cool":0},"U3nMx-51_3Vyr3xgK9ayZQ":{"text":"This is how casual dining should be. Not meant to be overly formal or stuffy but rest assu","useful":0,"cool":0},"cY-tadz4NTQucJClXzQkgg":{"text":"I really enjoy everything there \nPrice is good service is fast atmosphere is perfect \nBath","useful":0,"cool":0},"iGfPvquc16i1f-gOxWFplQ":{"text":"I'm surprised there aren't more 5 star reviews. I loved everything about Meril. To start, ","useful":1,"cool":0},"phWiC-ZCG8Cq2HtMLemuPQ":{"text":"One of my favorite spots in downtown NOLA. Always friendly, fun staff with consistently qu","useful":0,"cool":0},"l3dPmUYggi4XSaX8IffD-A":{"text":"I thought this place was good, but not so good that it needs to be on your New Orleans buc","useful":0,"cool":1},"B-5PDoM2NCtVjATqjFhDYg":{"text":"If I Could give less stars I would. This is the worst restaurant in the city. I'm a huge E","useful":0,"cool":0},"N8etClIxHwXZ5TCeIIqgLg":{"text":"Merli is the newest restaurant by chef Emeril located in the warehouse district of New Orl","useful":0,"cool":0},"5p03AKP35ALFPLp10ERfVQ":{"text":"We came with a group of friends for dinner. The place is really nice with full table setti","useful":0,"cool":0},"2Ev9gAUgSG0dubJuCb1jUg":{"text":"Spent several hours enjoying  a few small plates. Five stars for the food, it was so good!","useful":0,"cool":0},"qOPStMN1t9etxMwbmnHytg":{"text":"Menu changes frequently so these items might not be there for long. Turkey necks have to b","useful":0,"cool":0},"SOpU1Xksn2rC6dT49WKHcA":{"text":"First time here and really enjoyed it! Our favorites were the candies ribs and Mexican sty","useful":1,"cool":1},"uLcQp_v4Cp9XGD_8uKNuMQ":{"text":"Happy new year from what might be my new favorite restaurant!  Start with a bloody and ord","useful":1,"cool":1},"IXZufdfjjbts2PFrAaN-tA":{"text":"When in NOLA this is a good spot to visit. Service was fantastic, the ambiance is very nic","useful":0,"cool":0},"bBuQztAUVLpcqr148oJcwQ":{"text":"If you like small plates, meril is the place to go. Great bar and ambiance, good food with","useful":0,"cool":0},"53bAQRnGDYa1xVFs9FkTkw":{"text":"I'm not a fan of small plate meals, but the food here is of such excellent quality. The de","useful":0,"cool":0},"IEM8bvFkZFZVnj1LV0iYTg":{"text":"This is the first time I have ever written a bad review of a restaurant, however Meril man","useful":0,"cool":0},"2lgmY-ebSWHwoZ8bFHBoLw":{"text":"I was in NOLA for a quick meeting and stayed nearby.  I visited twice.  Ate at the bar.  \n","useful":2,"cool":1},"-uB5KdKP_pUbT2eTGrwOVw":{"text":"Great restaurant to try a bunch of different items! Fun atmosphere and fun to go with a gr","useful":0,"cool":0},"Da37GLOK0659QN3OyRlO4Q":{"text":"Great food, decent price, good drink menu, meh service.\n\nOrdered a couple small plates and","useful":1,"cool":0},"jzc1g3aYQn3cuBCx1Dht_w":{"text":"After already eating such great meals around New Orleans I didn't think it could get any b","useful":0,"cool":0},"IlQbC1zqxPdSlUhSrXp9jA":{"text":"This was our favorite meal in New Orleans. Casual, upscale atmosphere. Attentive service. ","useful":0,"cool":0},"S_VHPJvgpTEnqeEbebpE7w":{"text":"My daughter and I had lunch here on Mardi Gras last week.  The people were welcoming and k","useful":0,"cool":0},"EX2Me2yFsFp_kKnIfn1qnQ":{"text":"This place is expensive but you know it is already since it's Meril. The staff is exceptio","useful":0,"cool":1},"FS-_ccqP5aawbvMGf0TQxQ":{"text":"Great food to share. Nice ambiance. We came on a Wednesday night (Ash Wednesday) and didn'","useful":1,"cool":0},"xlcgLF3YphG-eTQU1s6Y8g":{"text":"Small plate oasis.   Their veggie choices are amazing. It's easy to stay on a diet program","useful":0,"cool":0},"JywlgIRkGmsaVpKqfnPENw":{"text":"Service is 5-star but a signature dish (the Korean bbq wings) was not hot, fresh and on-po","useful":0,"cool":0},"Gb_9Yq5BZUUFLSlLd-xCSg":{"text":"We came here for lunch on Saturday. The place was pretty full and had a great vibe. \n\nFood","useful":0,"cool":0},"t5cO62ZHLSAhQmWWSi2t3Q":{"text":"Love this place. Been here 4x now and every time it never disappoints. Every bite is delic","useful":0,"cool":0},"y0yTHls0t-boP_s2uhj2QQ":{"text":"Agh, I can't remember the last time I did a little dance while eating! Such delicious food","useful":3,"cool":1},"3QlJNn3Lirg4O7x5vOfOjw":{"text":"The upside down cornbread was amazing. I actually ordered a second one because it was so g","useful":0,"cool":0},"9voCZu8cmsayGbJlsEY5RA":{"text":"Tuesday night. We had reservations. Arrived about 7 minutes early. WAITED 50 MINUTES for o","useful":0,"cool":0},"H07JjvbiY7JuusamPqhKfg":{"text":"We came in not having a reservation, just having spotted it while driving past. Parked clo","useful":0,"cool":0},"5famwxZefB7-rYWxYL4_XA":{"text":"Fantastic! Nice food/drink variety and pricing. Lobster cake and Korean fried chicken were","useful":0,"cool":0},"rojjvwsz8kw86VatGEWdWg":{"text":"Was really looking forward to this place since we had not had time to come our last trip. ","useful":1,"cool":0},"bRIqUv6JqmaxvdAEXAccKg":{"text":"Amazing and affordable restaurant from Meril! I got the daily special pasta, fried blue cr","useful":0,"cool":0},"a3StfbwlJ_I45JtikbwR6w":{"text":"Really delicious food at (seemingly) reasonable prices.  Everything I had at Meril was exc","useful":0,"cool":0},"xg32hrWh8Qog2bXIzqqXxQ":{"text":"Food was really good! But I am giving it two stars due to the atmosphere and service. Serv","useful":3,"cool":1},"m8pUP8Y8k6I9e1nGtJ4uTg":{"text":"I came here for my birthday Sunday night. Everything was great! What really caught my atte","useful":0,"cool":0},"XATUdRfLPy1R2Aa4H7KSdg":{"text":"So, I am currently here and it's my birthday Dinner. The service is amazing!! Like they gi","useful":0,"cool":0},"UEBNGZe2BfXWyf09Zz-KVg":{"text":"Made reservations for 6 about three weeks in advance. Meril is within walking distance of ","useful":0,"cool":0},"LIc26tVXvtsy4AKUmsHXgA":{"text":"Excellent restaurant. Went here Saturday for lunch before seeing the Hamilton show. We lov","useful":0,"cool":0},"OzEdJvwdAUq1By5tajxF-A":{"text":"We were turned on to Meril a few weeks ago when we were in town for meetings. It had been ","useful":0,"cool":0},"66PxwGYbHdSbEa0DM7QbZA":{"text":"OMG! Don't miss this place! Great service,  even better food! Shrimp tacos,  fried oysters","useful":0,"cool":0},"viQENUwLH5J_aWYwNNjDtg":{"text":"We arrived about 10 minutes early for our reservation, and was asked to wait which I can u","useful":0,"cool":0},"3U0tzhN2GhSKDZ7eqm8tWw":{"text":"Sometime you want to love a place and it doesnt work out.  If you want something different","useful":0,"cool":0},"Kh_Yp0NKJiaH1u588oN94A":{"text":"So many great things to say about this restaurant.  Incredible concept menu that seems to ","useful":0,"cool":0},"f42kBLtmQcxUG6axEotKGg":{"text":"This is the kind of restaurant I would never return for. I've been eating out a lot and tr","useful":3,"cool":0},"BmJCtbihmudpgLhmrWtklA":{"text":"Awesome spot I'm told mostly locals frequent, food quality and service, value all excellen","useful":0,"cool":0},"RHdj1hcnf5eRatACB1zcjg":{"text":"Meril was outstanding!! The service was incredible and the food was amazing. We had a few ","useful":0,"cool":0},"31pLsreGgbqOp7rT6p1tng":{"text":"Went for an early dinner on a Friday night for a light dinner.   First time.\n\nCool decor. ","useful":1,"cool":0},"PrG-GNBvPRs3huILx1QL7Q":{"text":"Holy smokes - Emeril NAILED it with this restaurant. \nFood is tapas style, so order everyt","useful":0,"cool":0},"gBZyuFBMCEFPI8QpKwrTYg":{"text":"Since the restaurant is pretty new, my friend and I wanted to try everything on the menu. ","useful":1,"cool":1},"oMLseRxVNko2GVRxIzn_ig":{"text":"Crappy but Expensive\n\nGiving this two stars because the cocktails were good and the people","useful":3,"cool":0},"d_Cy8mvP0qAk0sqYBh-2Rw":{"text":"I like to go here for happy hour and order the flat bread. Dave the bartender is awesome a","useful":0,"cool":0},"6uvcp96VCrvGpV2nT_SSSw":{"text":"I went to Meril with 2 friends for dinner and I was pleasantly surprised. Since I'd heard ","useful":3,"cool":1},"s750zlp1I3wzToiIijbnbw":{"text":"NOTICE !!! DO NOT MISS THIS PLACE IF YOUR A FOODIE !!! New Orleans you have so many greats","useful":2,"cool":1},"FqLdQYwgwkzrno8jMOt_pg":{"text":"LOVED this place! As our last night in NOLA we were wanting something besides local food. ","useful":0,"cool":0},"NE7eRa46Bb2NGL6XEwrpwg":{"text":"I really love places like Meril! This cuisine is really good and if you visit NOLA you def","useful":0,"cool":0},"zxya2aQId2xRsp5yMHCgew":{"text":"Pretentious staff, super small portions... awesome decor. My son and I went and had to ask","useful":0,"cool":0},"uaUCi_C8LR27sPHAzIU4Lg":{"text":"This is one of Emeril Lagasse's Restaurant serving small plates with some Asian influence ","useful":0,"cool":0},"3LGbEPcpPu5EQnGCwTEqxg":{"text":"Amazing food and atmosphere. I can't say enough good things about this place. Tucked away ","useful":2,"cool":2},"exd0z47G4ltAe2jLBI4QCg":{"text":"This place is terrible. I usually do not write reviews. I was very disappointed. The food ","useful":0,"cool":0},"Hlrxal3Adt2iS1Fdu6HC8w":{"text":"The food was good but pretty small portions. It took way too long for our food to get to u","useful":0,"cool":0},"U5B_eMXP-GivT9Qo0YGSFA":{"text":"Waited over an hour... said no tables where available. What are these?  Horrible service. ","useful":0,"cool":0},"ESp-qXPy25dsP6-ffCvp-Q":{"text":"Food is excellent! Service is interesting.  Prompt when you arrive. No follow up afterward","useful":0,"cool":0},"rSyss7ZXBAIorW8edhjR5Q":{"text":"I've never written a review ever in my life. But this place is something else. I just want","useful":0,"cool":0},"73v5w7WWSXx21h3QbhVOgQ":{"text":"Chef de Cuisine Will Avela has created a twist on southern cuisine and does an excellent j","useful":0,"cool":1},"eS9rhqm_kmuj-uG6hY1sqA":{"text":"Visited the restaurant with a family of 8 for my bday dinner. Service and wait time was ex","useful":0,"cool":0},"RD5Wq6GjnX4v46PzGGulxA":{"text":"Dropped in for lunch, as usual another Emeril restaurant that did not disappoint. Much mor","useful":0,"cool":0},"_3EeLkEQfHF60QfDHh63YA":{"text":"Love the decor our server Yasmine was lovely very attentive.  good food first time experie","useful":0,"cool":0},"y-tk9mnMObdQvqi8ntGZag":{"text":"Of all of the nicer restaurants in New Orleans, I have easily been here the most. Other th","useful":3,"cool":1},"GvgGSh1wyJaDLFdSDqZMAw":{"text":"What a great surprise is Meril. We expected one of those over the top celebrity chef encou","useful":1,"cool":1},"wz-zR0zqseU6jXf9LuvNQA":{"text":"This place is so much fun and the food is wonderful. We tried the flat breads, Korean shor","useful":0,"cool":0},"ZYqA4C6UpltGOdeVYQ_-Jg":{"text":"This was the first place in New Orleans where a group of New Yorkers didn't feel too loud.","useful":0,"cool":0},"LqX7lNGArMcRepFgQKLyYg":{"text":"I came here with a party of 8 this weekend. The restaurant has a nice bar with some good s","useful":0,"cool":0},"s_7ie3aYtUR9wWVJWXbkug":{"text":"Delicious and great service. Deviled eggs and fish dip are a must. The pumpkin ice cream s","useful":0,"cool":0},"aH3ErNPcH9QuHRZJWFOaKw":{"text":"I think Meril gets 5 stars for ambiance and decor. This place is gorgeous. I love what the","useful":1,"cool":1},"vK1TG7gZwPkW41Iby0CPcw":{"text":"Strongly suggest making reservations, especially on weekends.  Atmosphere is upscale casua","useful":0,"cool":0},"tD0Zqyl3K7HDq2D9M4zG1g":{"text":"The food was absolutely amazing, and if you are having the special of the day it is incred","useful":2,"cool":0},"zmNwb2mQJ8ckuHSY5274_Q":{"text":"An offbeat but satisfying menu (we went to their Easter brunch) and good service make Emer","useful":0,"cool":0},"AVpelzz2-Qprn_Sk7P_HpA":{"text":"Very cool looking restaurant, and a hot spot for a good looking and vibrant crowd. Service","useful":0,"cool":0},"5cRlseJRoDKw5WRDFOMDkQ":{"text":"Great atmosphere, great food. Kind of an eclectic menu, but everything I tasted was delici","useful":1,"cool":0},"wkMsTTCx2PAffa0p3R7-kA":{"text":"It's basically a tapas place that is a little overpriced. \nWe got 4 small plates between t","useful":2,"cool":1},"MAWhMz1ZzzDNW9Tnoh8K1Q":{"text":"Great contemporary restaurant that rotates seasonal dishes while also keeping its roots by","useful":1,"cool":1},"huLooBMdJPEsunFq86UdLA":{"text":"disastrous lunch... made a reservation for 12 people and they put us at two 6-tops that we","useful":0,"cool":0},"VOrMbX82jR76awtWLkOWBQ":{"text":"Came to Meril over an extended weekend to New Orleans. The service, food, atmosphere and c","useful":0,"cool":0},"kaOFA0FUBWVgXakcGXhF8A":{"text":"********Celiacs beware********if a waiter tells you that fried oysters with modification c","useful":0,"cool":0},"9XBs-oXC1Bsqc4ITgWanzA":{"text":"Came in on a Saturday night at 8:00 pm with a reservation. I was in town for a bachelorett","useful":5,"cool":4},"uFJikqAZYVyfVzykItXodQ":{"text":"Arrived in New Orleans around 4pm. We had an early reservation at Meril, couldn't wait to ","useful":1,"cool":1},"d1851-aHgbUt0U6dlvFZPw":{"text":"We went to Emeril's for lunch but they closed at 2 and suggested Meril and we were not dis","useful":0,"cool":0},"z9k14M9wq5O6D16zVFCYtA":{"text":"Oh. My. God. Everything was amazing. We visited from Sacramento to celebrate my husband's ","useful":0,"cool":0},"368QPlLB44h-9xnbDh1o8w":{"text":"Terrible service!  I order the pork porterhouse which was the special of the day. It came ","useful":0,"cool":0},"nEz0ECX4YJw2FIT5OKdMXA":{"text":"I went here on NYE and it was excellent. It being a larger restaurant, I didn't have high ","useful":0,"cool":0},"ubOdKwAqa8U6hEze52Smsg":{"text":"Great lunch spot. The atmosphere is very nice, feels very open. The food was outstanding, ","useful":1,"cool":0},"HAKmlphiuD159LPMGUBBJg":{"text":"Came straight from work. Had one drink and our table got cut off.  Really???  Never coming","useful":0,"cool":0},"c9YWEM3YdijfjiBr5Uv1Mw":{"text":"We went for a late lunch on a Monday afternoon.  We were looking forward to this place aft","useful":0,"cool":0},"D52RH394xSsgjuV9OzCcqg":{"text":"Okay Meril.  We loved our food, service, drinks,  but you HAVE to do something about the n","useful":0,"cool":0},"wRUnHtV8D6FjUIY5Y6Uk3w":{"text":"I went to Meril for dinner based on the recommendations of a friend. The experience was qu","useful":0,"cool":0},"Tngs8LPkBY3hIW6kFvQLyA":{"text":"Went this weekend to try Emeril's new restaurant and like his other restaurants - it was a","useful":2,"cool":1},"lWLv4rmwGUfjLNKpkWSeXQ":{"text":"First time here sat at the bar on Sunday To watch some of the games. We ordered a few drin","useful":0,"cool":0},"feQNZm5TVZlpK891vQMMZg":{"text":"What an experience! Our server, George, is probably the single-best server in the city. Ha","useful":0,"cool":0},"GUx2nWQcQTnW5G9sTdLe1w":{"text":"Yes yes yes. We had an amazing dinner here. Came in Monday after jazzfest with 6 people, b","useful":0,"cool":0},"qgnrB-_cQsfkBS-0sZXN-w":{"text":"We had reservations but ended up with bar seats because they were open and we prefer bar s","useful":0,"cool":0},"iVADSlDtRayIRD9QlsC0lA":{"text":"Birthday girls and boys beware: Disappointed by the service tonight. We made reservations ","useful":0,"cool":0},"hhYmLZwvzkqP1xsvsfSLRw":{"text":"My husband and I went here for a special dinner on our last night in New Orleans, and it d","useful":0,"cool":0},"f2UhV9XzrQl8j4-DAwoexg":{"text":"Spirited but slow service of desperately bland small portions. Messily presented calamari ","useful":0,"cool":0},"LT65chHLfDLbJ-F2bg34GQ":{"text":"Food is excellent! Service is interesting.  Prompt when you arrive. No follow up afterward","useful":0,"cool":0},"5-br9ZbT2kNcBsY_zV70Fw":{"text":"Holding our breath, hearts heavy with anticipation, me and my partner's parents were final","useful":0,"cool":0},"9bXsZr-WoaT0BZnTBfz6dA":{"text":"Love the atmosphere and food! Had the devil eggs, ribs and shared the Korean chicken. Ever","useful":0,"cool":0},"SHldhhCyW319m5SIgqv95Q":{"text":"I came to this restaurant last week based on recommendations and I was severely disappoint","useful":0,"cool":0},"0_cznvIgxDy9Nc5CNTWocA":{"text":"Amazing food.  Ordered 4 dishes, my top two: lobster cake and shrimp tacos. 2nd two: Wise ","useful":0,"cool":0},"0fne6Sth9OtY4-ulSEvtAw":{"text":"2 of us \"foodies\" had a fabulous meal. The tapas style selections were awesome. We can't w","useful":0,"cool":0},"IYnQXAbL2EqFRFQhVzpxyg":{"text":"Amazing food, perfect portions, and the Tres Leche King Cake couldn't have been better!","useful":0,"cool":0},"JZCtYAdk6oiANcSBZ3_jfw":{"text":"I LOVE this two year old restaurant. It's located near the Garden District near the WWII M","useful":1,"cool":0},"YUy-SHlzq1X-nnu1j9mDqg":{"text":"I came here for a friend's birthday. \nLet me start with the wait staff and people working ","useful":0,"cool":0},"qpH3W2rMQ8fRI6Y4yhqquA":{"text":"Excellent service, creative shareable dishes and a festive atmosphere make this an afforda","useful":0,"cool":0},"E50mTABmPmo2mihzYcA4-Q":{"text":"First impressions matter. When I went to be seated my chair had crumbs which I could brush","useful":0,"cool":0},"9bJMm0uBXszzhjS6EwrjBg":{"text":"Our group of 7 got a late reservation for 8:15, arrived early and killed some time at the ","useful":1,"cool":0},"lr5gTgHwgJn7EpIQcq6tJw":{"text":"Very cool vibe here. I wish we had found it sooner for another meal here!  Our friend need","useful":0,"cool":0},"7RiEvqKl-z0dlPanhMuHkw":{"text":"Very disappointed in Meril. I have been to almost all of Emeril's locations and this has b","useful":0,"cool":0},"oHZkAPSNIviePoBEhz0Taw":{"text":"I was looking for something  different and decided to check this place out. It is a very n","useful":0,"cool":0},"9QLvjfAeIxYR8SK4MBRHGA":{"text":"First of all, it took me an hour being there, and knowing fully that it was an Emeril rest","useful":3,"cool":2},"ZHeHtgEXSU86USbvyrA3dg":{"text":"What an experience! I'm from nyc  and came down here to visit! Since love Emeril want to c","useful":0,"cool":0},"cSsRZ8KdPkRQwQTcwVPDkg":{"text":"Amazing food and excellent service!\nEvery dish we had were sooooo yummy!!\nWe were so impre","useful":0,"cool":0},"l-gxw9iIb1YXIyqegA46gQ":{"text":"We ate here last night and the food was good. It's a tapas style. The chef was very accomm","useful":0,"cool":0},"zCLfMN_jmAASCWysWBSmXQ":{"text":"We had reservations for my 50th birthday here tonight. Service was horrible and some of th","useful":1,"cool":0},"CY1fIrDUd4C66UJ_p9peaQ":{"text":"Merit is in the Warehouse section of New Orleans and I enjoyed the area. The restaurant wa","useful":1,"cool":0},"aj_NmgIloXcfge6VbF-t4Q":{"text":"Whoever owns this joint needs a management shakeup. \n\nEntry: Very nice folks with pleasant","useful":1,"cool":1},"wskLocRnPyk7VNDQbubj_g":{"text":"Visited here with some life long friends and wanted to enjoy it, but so many better places","useful":0,"cool":0},"xJ178lb3GZWDSQffDJDObw":{"text":"Great night out, loved their craft cocktails, #50 with grapefruit and prosecco was my favo","useful":0,"cool":0},"sUbn4emeJpkHxpafh7uBHQ":{"text":"First the food is amazing and the servers are so attentive (and ours -Key- made the evenin","useful":0,"cool":0},"t3N_oUkIl6NEdKwHBrGxCA":{"text":"Food was pretty good overall. With the exception that there was egg shell in the deviled e","useful":1,"cool":0},"jwh89Pmh5jTGu7jv0WohXQ":{"text":"We were in town, looking for brunch! The French Quarter Restaurants were booked....lucky f","useful":1,"cool":1},"1DI0X_ML78g-46YIfdo8uA":{"text":"Such a nice place but it does get pack and loud quick. I definitely recommend making a res","useful":2,"cool":0},"0Vr9Rmyz6mzwSyQkQVsQxg":{"text":"Server said our meals were coming and then she realized she didn't put our starters in....","useful":0,"cool":0},"JOBkb0CnuHSl2D4eeE5nRQ":{"text":"As a local foodie I was extremely disappointed with the food.  Ordered a salad as a beginn","useful":0,"cool":0},"wd0DVMsYLlIFILM1-ZI2Jw":{"text":"Not to much more to say, wait staff were professional, helpful. The food was phenomenal!","useful":0,"cool":0},"u9Y1NjCHtuNZkwrBAowwKQ":{"text":"Absolute best place for friends to gather , y'all , drink and have a good time. Small tast","useful":0,"cool":0},"BETA78mIKvYcjvVAPhKJMA":{"text":"Truly deserved 5 star experience. Meril is a must for anyone in New Orleans. From the drin","useful":0,"cool":0},"3aZeIq78MI3G12yDeR0Xqg":{"text":"Loved the atmosphere.  Food was great and staff was friendly.  Cotton candy sparkler the s","useful":0,"cool":0},"0Dx26QOgCSGw21D4BtdVbQ":{"text":"Incredible high end cuisine. If I lived here, I would return often!  The service was top n","useful":0,"cool":0},"0MMDHn-gBHkQrmUTTvJbSQ":{"text":"Wasn't blown away by anything. It was a nice meal & fun for a birthday as they bring you c","useful":0,"cool":0},"Z2tw7ARXAlZWObERZ43ckQ":{"text":"Our first stop in New Orleans. The restaurant was one of the very few places that was open","useful":1,"cool":2},"XiclCy4jjcNWSjvEQTd9Ew":{"text":"Recommended by a friend for a memorable dinner, I was excited to try Meril's, this tapas-s","useful":0,"cool":0},"BDhb9_BadtfBPTidFPGuFw":{"text":"Atmosphere: 4.5/5 I actually really enjoyed the space. Very open and inviting and they als","useful":3,"cool":0},"EXF-db68cMyugXU8Mll1ow":{"text":"I visited Meril on a Saturday night with colleagues after we arrived late in New Orleans f","useful":0,"cool":0},"IZtdSys22wo0e1yBe6wA5g":{"text":"This is my current favorite restaurant in New Orleans. I love bringing people who visit Ne","useful":0,"cool":0},"axYbhPceT-zthgw6G5BPMQ":{"text":"This is a hard review to write. Let me start with saying that the food at Meril is fantast","useful":2,"cool":0},"ld2NMCVZEdWAJDwY1HygNw":{"text":"The food was good but portion sizes were small. I got the chicken under a brick and that's","useful":0,"cool":0},"ejPROISZ9uVhvqvdh-qFpw":{"text":"Food was amazing!!\nAtmosphere amazing!!\nServer was very knowledgeable but could have stood","useful":0,"cool":0},"UNwIJkZx2T-cCNfSDbBGBw":{"text":"I had been trying to make a reservation for 5 days with zero help from anyone on staff at ","useful":0,"cool":0},"0dM7x4w25McA9RBgg1hvNg":{"text":"Where do I begin? Absolutely loved this place! I was with a party of 9, and although we we","useful":0,"cool":1},"XVSb3N-YP_cyZfSxB3OQkA":{"text":"My least favorite Emeril's restaurant.  Food was mediocre and our waitress was having a ba","useful":0,"cool":0},"vGRZkPPLH98b5kA4QOnHIA":{"text":"Definitely worth a trip if you're looking for something delicious, filling and a trendy sp","useful":1,"cool":0},"F7REUlxWRMBRRr5kM8kj3Q":{"text":"It's awful. Bad service and cheap food quality. The food doesn't worth the money you pay h","useful":0,"cool":0},"mt8gzBvsPJXEXmeck-areg":{"text":"I absolutely love this restaurant! I tried a variety of dishes and none of them disappoint","useful":0,"cool":0},"I6XxKhmVd5vSj2VQJKaAQg":{"text":"This was a very interesting dining experience! The inspiration for the restaurant itself s","useful":0,"cool":0},"ashkE-6Xbf-q7BKOkRbHsw":{"text":"Emeril, you did the damn thing with this one. The street corn, the brussel sprouts, THE CO","useful":0,"cool":0},"6YyctnispN3i7C-exv8WTg":{"text":"Amazing. Everything about our visit to Meril was spectacular. The service was great, above","useful":0,"cool":1},"0Ut2CbtkJUW_IIITw2KRlg":{"text":"Visited Meril with a table of 8-\nOrdered more food than we could eat and it was all very g","useful":0,"cool":0},"ZtRDff5MwmSMNWPZh0s2dA":{"text":"Very unique dining experience.  Small portion plates is the design and it allows you to tr","useful":0,"cool":0},"mfb5Dnvt2z9GkbAX6S1c0g":{"text":"Fabulous service! Food was incredible not one thing that any of us ordered was bad. True s","useful":0,"cool":0},"ulbezYe5d_96xTqGzRFa5w":{"text":"For the snacks we had the deviled eggs and Korean Fried Chicken! Both were VERY delicious!","useful":0,"cool":0},"qvS3lLqrcWy0KMWjv0sp3w":{"text":"I always have a bit of trepidation when I visit one of my culinary hero's \"joints\".  I've ","useful":1,"cool":1},"vFnKyQ5ZTn6uGqG4fSLYbQ":{"text":"Let me start by saying the service at Meril was by far the best service I have ever experi","useful":0,"cool":0},"fs1iGLMDbDT2UDaKrfKwbw":{"text":"I really wanted to like Meril. Unfortunately, that didn't happen. First of all, the waitre","useful":0,"cool":0},"SwWNFS4A1t_5rPSWVf5HMA":{"text":"Ok, you people must've been drunk...this place had bland, horrible food!!  I think if you'","useful":0,"cool":0},"PKiEJTeppZCyI_dL7RFWjQ":{"text":"Whatever we ordered they didn't have. Servers totally unprofessional.   We walked out afte","useful":0,"cool":0},"2RcHaqwBiL3NgoBm2xRZpg":{"text":"If you're looking for contemporary or modern American food with a twist, this is your plac","useful":0,"cool":0},"ZngBQlWWpVEJ0c-f_dVwxQ":{"text":"Absolutely loved the food!! We literally ordered everything from the menu and it was excep","useful":1,"cool":1},"kifQmF9ibS64zU-RvFWA4g":{"text":"While a super busy hipster, loud place on a Fri night, it was also delicious! We ended up ","useful":0,"cool":0},"4MdDmb1YPO0UeGUD8WNJ9Q":{"text":"Emeril was in the kitchen, BAM! I expected magic and was sorely disappointed. We asked for","useful":2,"cool":2},"dZhLPqq6y1uZN1anzQD-fQ":{"text":"Really noisy-- high ceilings with lots of echo. \nFood very good. Anticipate ordering for t","useful":0,"cool":0},"zL-ovNyy8LkshsJq6rTYwA":{"text":"One of my favorite restaurants by far. I have been here twice and I have enjoyed every sin","useful":0,"cool":0},"Ciei5KLeohJjBQmst-vF4w":{"text":"Delicious dishes and wonderful service m. Glad we tried this Emeril restaurant on our trip","useful":0,"cool":0},"JTJJpZLp3aJK-7wyStPFLA":{"text":"Great ambiance, good food, and great service.  \nFor Our party of five : We tried the yello","useful":0,"cool":0},"3zra2Rt1emodlUmgIqr_rA":{"text":"I was so looking forward to dining at Meril's. Popped in on a Saturday and was able to get","useful":1,"cool":0},"6YlHYVftvoYZ0RCShnDshw":{"text":"The food served here was amazing, well cooked and the flavors were great. The deserts were","useful":0,"cool":0},"B5JwlSkkBDDzGGMcSy3BLA":{"text":"Great  atmosphere and food & drinks! no 20 gin cocktail is great!!! Tuna wraps & flatbread","useful":0,"cool":0},"-z0sXoTAwICj_dKNyEGeZQ":{"text":"First time I've tried an Emeril Lagasse restaurant. As described by their website, they ar","useful":1,"cool":0},"LL6yLUguXrZee624c8LWQA":{"text":"I absolutely loved this place.... friends discouraged me from going, but I am glad I did. ","useful":3,"cool":1},"t5C8x8A-1LykxNFTtx9WDQ":{"text":"Wow wow and more wow!!! I absolutely loved my entire experience at Meril's. Its a very cla","useful":2,"cool":1},"k-jHgMwCcthA8_7VGFdVVg":{"text":"I had a great anniversary dinner at Meril! This was hands down our favorite dining experie","useful":0,"cool":0},"d9iGGW6IQ0B41j6OwrhUbQ":{"text":"Had a great meal last year while visiting. Back this year and decided to bring a group of ","useful":0,"cool":0},"mCAi-xLOzNY5eSs6vVL9Ow":{"text":"Meril is one of my recommendations anytime someone asks \"where should I go eat in NOLA.\" T","useful":0,"cool":0},"3YbeVFcaDxiEnRSLs6RDzg":{"text":"I was really looking forward to a meal here .  I was really disappointed , not in the serv","useful":0,"cool":0},"gcp535ZdwBsNy4WktMgCzA":{"text":"Tonight was one of the few times we've eaten in a restaurant since the pandemic began. If ","useful":0,"cool":0},"xbrTLyahjVYpShfGpZL_4g":{"text":"We came here on our last night in New Orleans. This happened to be our cheapest dinner and","useful":0,"cool":0},"yRW1qtvagaimThBOLNMrHA":{"text":"The service was awesome and the food was tasty! I would recommend the mint brownie ice cre","useful":0,"cool":0},"G7K-mME_LE_CP0ob2iGXEg":{"text":"Ready for COVID staffing issues to be over which I'm sure was the issue. Appetizer came ou","useful":0,"cool":0},"hU4oaLfSvQxGmdKHS7q2dw":{"text":"Phenomenal service, delicious cocktails, and a lively atmosphere. \n\nFood: Upside-down corn","useful":1,"cool":0},"n-_i-ZZjWTgTswmh6zdOPA":{"text":"After a morning at the WWII museum, lunch was in order, and Meril was only a few blocks aw","useful":0,"cool":2},"kxGiiTDffH7c5wXJlV7cFQ":{"text":"There is a whole lotta good about this place. Great menu variety, fun, contemporary play o","useful":2,"cool":3},"8fCxkRjqjocn9uo_Mh0MRQ":{"text":"Service, quality, and portions were excellent.  We had a table of 5, and they portioned ev","useful":0,"cool":0},"Rv5R203iXpQ7j891Ugu2TA":{"text":"It was so disappointing. I have always loved Emrils restaurants but this one was over pric","useful":1,"cool":0},"J48qYhX61HY3t6fgdieAdw":{"text":"Just had to share a couple of photos from this\nIncredible restaurant when I dined there ba","useful":1,"cool":1},"TAIq-crIZabMy14XdJr04w":{"text":"My husband and I visited New Orleans for my birthday for the first time last weekend and o","useful":1,"cool":0},"YU-PeljGUy2mVSOSCbPXKA":{"text":"Meril's is always a favorite go to.  The food tastes great.  The candied ribs everyone sho","useful":1,"cool":0},"XB113NsbeFrR2dtxvv7ULg":{"text":"Delish! The waitstaff had impeccable timing and kept the flow of lunch going seamlessly.  ","useful":1,"cool":1},"xUtJ-s-vwZ0UPrIn7oXc-Q":{"text":"My 3rd time there and boy, was i disappointed! Table wasnt ready so we had to stand around","useful":0,"cool":0},"BfduJaxgRD8qR9wgzviA8w":{"text":"Meril was so delightful.  The newest restaurant in Emeril Lagasse's empire is 10 months ol","useful":0,"cool":0},"p7X6z2zpPF50k_6nxuHJCw":{"text":"The beautiful decor, diverse menu, expansive cocktail possibilities, and price point makes","useful":0,"cool":0},"elUuBLR1zLQNP8q2ZYi5Pg":{"text":"Meril is an awesome concept. Everything is a la carte and made to share. My coworkers and ","useful":1,"cool":2},"tU-YfJiAtIDKIdLJMJVvUg":{"text":"Wow, what an experience this restaurant provides. From the time we were greeted (host w/th","useful":0,"cool":0},"UGJqSE_nEg95P_mreCkhag":{"text":"It's a nice space with great service. Food was a little underwhelming for what we were exp","useful":0,"cool":0},"Xgv0meXyuGWqcz9MMWnGJA":{"text":"Good food, great service and nice atmosphere. We had lots of fun coming here w out of town","useful":0,"cool":0},"jfVk5bk42TIT5Oyf-HdoeA":{"text":"Meril was the very first Emeril Restaurants that I've been too and it was really great! Th","useful":0,"cool":0},"v7JnNsKzokJKBom4M14mKQ":{"text":"Very nice place! Went for my birthday and enjoyed it. I love the idea of small plates for ","useful":1,"cool":0},"Oyq7WurB2ieaqAT99n4wXw":{"text":"Great atmosphere and food. I was visiting NOLA and a fried recommended this place. I now r","useful":0,"cool":0},"lPvQSUE_sRJ8D-12C8ygrw":{"text":"I have never been a huge fan of the Emerils brand, however they won me over with Merils!  ","useful":1,"cool":0},"xodpt9xe6KPDxutwF9saVw":{"text":"One of Emerils restaurant - price a little bit high but food and service amazing. They Rec","useful":0,"cool":0},"l2W4yDYumKFHfkn-vIT8xg":{"text":"Don't recommend this  restaurant unless you want drinks and don't about noise snd food qua","useful":0,"cool":0},"pdHR8KJtPq70a2qb2i-mTQ":{"text":"We live next door to Emeril's so sure it is convenient.  But the food and impeccably graci","useful":12,"cool":10},"pcn0xkTGj7c02gwYevwwfQ":{"text":"If you're like me and the cold temps outside make you want cold sweet treats anymore, then","useful":3,"cool":2},"JXDtV5zA7JDUIuiPkw03zA":{"text":"Gosh I love Meril!  The small plates make for a feast when you share with friends. The coc","useful":0,"cool":0},"41u53iXsj-j1ngG3YrlXUA":{"text":"Just a few questions. Nothing major. Why does my server smell like an ash tray? \nWhy are y","useful":0,"cool":0},"sWfmfhDeGyVNWlH2bxywUw":{"text":"Amazing food, we went with a big group of 10 people and although there was definitely a wa","useful":0,"cool":0},"GaBy7qnY1_i7ujorqmF5gw":{"text":"Stopped in for a lite bite and a cold beer one afternoon & was pleasantly surprised. Super","useful":2,"cool":2},"oaJdxomPte6aEW5rxUhYbA":{"text":"Book elsewhere.  Seated us 20 minutes after our confirmed reservation. Service was beyond ","useful":0,"cool":0},"_FecXC8o6PYB6sLoxrfRxQ":{"text":"Let me start by saying this is my second visit at merils. It was a pleasant experience as ","useful":1,"cool":0},"VwrqezxcMiIdlUbqfAjcJQ":{"text":"Meril is awesome! My first time going we ordered sooo much food! This time we scaled back ","useful":0,"cool":0},"JZ8MMAUvFK2pgP2D6WDo4Q":{"text":"If you're looking for a detailed review, this is it! \nI had a reservation for my birthday ","useful":1,"cool":3},"pKzv6hvazMS9q1qnpd3-1g":{"text":"My husband and I really thought our experience here would be over five stars after reading","useful":0,"cool":0},"HBnfyi7GNy0TYBKzEXfRZw":{"text":"This place is the latest edition to the Emeril Empire of which I am a fan of NOLA for sure","useful":1,"cool":1},"xrYTG8g0vP8hSDYq8etSnQ":{"text":"Visited Meril on 11/1/2020 for their new brunch service with my brunch crew! Loved it! Del","useful":3,"cool":2},"7dy6UYlrctACetOQMS07yQ":{"text":"To be honest, the main reason I came to this place was because of the cute little sparkler","useful":1,"cool":1},"ZNFbdzHLBgO2GrsHCsrxQg":{"text":"Service and food was GREAT. Then I looked up in the kitchen to see one of cooks not wearin","useful":1,"cool":0},"-WfTWqjE01DgzdUalOfqNw":{"text":"Pretty much my favorite place for lunch in New Orleans.  $25 corkage so bring your own win","useful":0,"cool":0},"_wwEgRqmRSMorIr6SL87Dg":{"text":"Everything here was great! Made a reservation the night before very easily through OpenTab","useful":0,"cool":0},"-RXBxOSWAcYrOXgdr-9iRA":{"text":"Amazing happy hour deals but that wasn't even the best part. Our server, Danny, went above","useful":0,"cool":0},"9DMe1jtTwzwRauRwgM3gJg":{"text":"The food and ambiance were SO good. Our dishes were a tad salty, but the menu is diverse a","useful":1,"cool":0},"dt2ZPwq0SIVRS9tBwNvjWg":{"text":"I had a party of 8. Food came out in a timely fashion. For the most part everyone enjoyed ","useful":2,"cool":0},"eoSI7IIAXON-6UHkDP0lMA":{"text":"Great fine dining restaurant that is not overly expensive with good portion of food. The f","useful":1,"cool":1},"NEv6UIuCrjyMU6Xc0x33Sg":{"text":"I had dinner at Meril with the hubs and a couple of friends last night and loved it!\n\nFirs","useful":2,"cool":3},"8bF-9gszhpN8lBWwYWcSIA":{"text":"Where to start? I celebrated my birthday dinner at Meril in New Orleans and it was outstan","useful":0,"cool":1},"QqAakUXEuoBvMWBWmWj1Jw":{"text":"PORTION RIP OFF!!!!! \nFriendly staff, nice place. BUT the portion to price ratio is honest","useful":0,"cool":0},"td7kFDbvfJH4OQL0wAY5vw":{"text":"Don't you try to be nice to me...Where do I begin. Meril more like Purell... you need sani","useful":0,"cool":0},"qguWnPSpy8Q3csH8uXWPfQ":{"text":"Jeremy, Miranda and Marcus are so professional! Texas is truly the best server. Alaways a ","useful":0,"cool":0},"qkxMr77TsYg8cc49CenAdw":{"text":"I always enjoy myself at Meril! The staff is always friendly and complementary. \n\nChef Wil","useful":2,"cool":0},"KjDoBH4-VX0vvmlm0GVEIQ":{"text":"Went for Sunday brunch and the food was great, although they were out of shrimp for their ","useful":1,"cool":0},"ApgrnYVAWFiDppuJAFZ9TA":{"text":"I cannot say enough good things  about this restaurant! First off they let us add another ","useful":0,"cool":0},"Qce0vVDYfhLI9zmr6tyQkg":{"text":"Since the restaurant is pretty new, my friend and I wanted to try everything on the menu. ","useful":3,"cool":1},"OQ2VIBJbMLeudhi4BaiH-g":{"text":"I've dined at Meril on many occasions - for lunch, for dinner, for birthdays, and everythi","useful":2,"cool":1},"TEGKN-BLF3tQn0bT_Ct4zQ":{"text":"We went for a little birthday dinner and it was very nice. Made reservations on Open Table","useful":1,"cool":1},"kGHLRnhK-UbbbAx8Gm4hVA":{"text":"We had a very good meal at Meril. They have a diversified menu with many small plate offer","useful":1,"cool":0},"jwu_bOriGXA8z6IkxaTzLQ":{"text":"Terrific food, great service, tapas style and portions were just right, you may have to \"o","useful":0,"cool":0},"0p1rlTaBha6XvVMcal1ydg":{"text":"For Review 1600, I chose to review the newest Emeril restaurant in town.\n\nMy dad and I cam","useful":15,"cool":10},"51EKPeIwvaNVBlrEGXnG-g":{"text":"I have long anticipated dining at Meril. Unfortunately, it was not like I expected at all.","useful":0,"cool":0},"f0tQjrnBZgYxcNGQx28moA":{"text":"The food was absolutely orgasmic. We had the smoke fish dip as an appetizer and it was so ","useful":0,"cool":0},"sRUMCSaZZTrjn87E6kTIPw":{"text":"I'm not a person who writes reviews. I travel the country doing events 80% of the year and","useful":0,"cool":0},"0HtSAYmzcp-qgaJjibVIlQ":{"text":"This was an unexpected surprise, we stopped in for a drink and it just happened  happy hou","useful":1,"cool":1},"4thUgmijAYCmiMgFn_QzvQ":{"text":"It is a beautiful restaurant and pretty empty during lunch! The buttermilk biscuits are am","useful":0,"cool":0},"EssiYgIWBg27-wd9Zh5R3g":{"text":"First time at Meril's and upon entering the building is trendy and beautifully designed. O","useful":1,"cool":0},"JeYi6cTsorUrjpvNUlbCkQ":{"text":"We made reservations with another couple - plans fell through but we called and changed th","useful":1,"cool":0},"p6j4-lH3dRWKqviSlCKspA":{"text":"I had the best time at Meril. The service was impeccable. It exceeded my expectations. The","useful":2,"cool":2},"aNd7wVbVFcq7HQjyiWX_dw":{"text":"Sometime you want to love a place and it doesnt work out.  If you want something different","useful":1,"cool":0},"qnI8ys6Y6iTJy5INgmprKw":{"text":"Came here with a friend and split a few small plates. I had high hopes for Merils but was ","useful":2,"cool":0},"yE4zGsbrn5IYK8zWGirqjw":{"text":"So disappointed. I got the Linguini Nero and it tasted like oily noodles. It was supposed ","useful":0,"cool":0},"b20F7vOZ6HuSBZUHikG8sA":{"text":"After making a last minute reservation via Open Table, I had a great dinner with a group o","useful":12,"cool":9},"Hk5MS1a2KNLaE80RtcO18A":{"text":"Hands down one of the best meals I've had. The food was exceptional with a great mix of te","useful":0,"cool":0},"Nk1W64YtKHoZz_PXuKJCOA":{"text":"I sat at the counter facing the kitchen. The dessert person was kept busy making cotton ca","useful":0,"cool":0},"48NHbf08YSHmhJIW7zZOnQ":{"text":"I came here for a friend birthday dinner. The atmosphere of this place is pretty cool. You","useful":1,"cool":0},"8MK00LLpViLbpoDPTiVa1g":{"text":"I got the gf fettuccine nero and it was fabulous. Would 100% recommend for anyone who enjo","useful":0,"cool":0},"nCqhh2EqVzU-_zui_47ozA":{"text":"Lisa and I had an amazing experience last night at Meril's. EVERY member of the staff trea","useful":0,"cool":0},"sVFKHqBPx9HI1tKOFtYerQ":{"text":"This establishment is beautiful when arriving, the bar sits in the front as soon as you wa","useful":0,"cool":0},"ifNgUvyPMVhS9286F1EMvg":{"text":"First time here, don't know why we never made it here before.\n\nGreat ambiance and great fo","useful":2,"cool":2},"Pfw4wQW4iCDNYYkKii3XcA":{"text":"Went to Meril for a friend's birthday and started off with a few drinks that were deliciou","useful":0,"cool":0},"Ue7ATe57s-_0eYZ2SgIIaw":{"text":"EMERILS.. but without the E \nMERILS! I've ran across this place countless of times at nigh","useful":7,"cool":9},"G__2jK4qsaQ1r19qmB--ew":{"text":"A few colleagues came into town this week for a conference, and so it was up to me (the lo","useful":0,"cool":0},"EEXMjN6Bh5Sp8F582ZJWCg":{"text":"We ate there recently with a fairly large group.  The food was plentiful and very good, bu","useful":0,"cool":0},"wPCNCCs3S2-plW-Qp6GehA":{"text":"Good food, but the wait for our meals took way too long. Also they brought dishes out stag","useful":0,"cool":0},"0SAoTn6NCniTDJIPZIrQAw":{"text":"Dine here!  What an absolutely lovely experience!  Best service of our lives-- not an exag","useful":0,"cool":0},"_2AMi1ziQdVE1NYLOGpLPg":{"text":"Horrible and disappointing experience. \n\nWent here for my boyfriends bday. It took 10 minu","useful":0,"cool":0},"FEvMQX2fMQJg_EmRum3EMQ":{"text":"Meril is awesome for groups since mostly every item on the menu is perfect for sharing. Ou","useful":7,"cool":5},"jBpl2qUaLtPWT-t2A5j0hg":{"text":"Food was amazing and they even brought out cotton candy for our son. They did an amazing j","useful":0,"cool":0},"mAzxz_iJiX83X3KgdKEx5Q":{"text":"Way to busy, too loud and slow poor service.  Food wasn't nearly as good as other Emeril r","useful":0,"cool":0},"TAxbRAY_UGRIN3r8Ok1mOg":{"text":"If I could give this place ten stars, I would! The food was incredible.\nMeril is a modern,","useful":3,"cool":2},"hv0SJ1hVKvA8-zu8nkF8gQ":{"text":"This is my new favorite place! The space is beautiful, staff was super friendly and knowle","useful":1,"cool":0},"-jBVhJ_FiBlYXCqG4gbtgA":{"text":"Rich and wholesome! Freshly made beautiful wide Pappardelle noodles, Lamb Ragu, Pistachio ","useful":2,"cool":1},"n0uW9cMMV8sACzGEewSgMA":{"text":"We enjoyed everything about this neatly hidden jewel of uniqueness,first the drinks were s","useful":0,"cool":0},"SoBp1526d146Du4QY_q5xg":{"text":"This place gives new meaning to, \"the devil is in the details.\" Being in the restaurant bu","useful":3,"cool":0},"CQ-TN-cOqKB1LAE9X2pmug":{"text":"Everything front to back about our dinner was solid. Our waiter was friendly and knowledge","useful":1,"cool":0},"KgkVVNNgExbv9FbYSvtnYg":{"text":"Not bad, not excellent.\n\nThe cornbread app was okay. The bacon marmalade was so sticky swe","useful":1,"cool":1},"wMSt_S5o7oALsfppd1WNzw":{"text":"We decided to stop on our way to the parades and were covered in beads, so they sat us at ","useful":2,"cool":0},"can7OaIzqGnuBgS4iCwc3A":{"text":"The food was lovely. \nThe service was lovely. Until it wasn't. \nThere were 4 servers that ","useful":0,"cool":0},"wWtIyjzhFDfHEtpgDxwsRg":{"text":"What a beautiful restaurant! Hip, intimate, and awesome music, this was The Place To Be fo","useful":1,"cool":1},"HIGayRfFSHC0BJ1447V-Sg":{"text":"Meril came highly recommended and I went there with 3 other people, all of whom travel oft","useful":0,"cool":0},"rCRrBGbntYgI2JTjsBdDoQ":{"text":"Very good restaurant. Good music. Great service. Very nice layout. The food was very good.","useful":0,"cool":0},"SSfEx3rGEcvfnP1nwO1tQw":{"text":"I had a small birthday dinner here and it was nice. I love the idea of the small plates be","useful":2,"cool":1},"JPFg5RhAfDW8UEllJjJHVA":{"text":"Emeril's is a very welcoming restaurant in Nola.  The staff from host to servers were very","useful":1,"cool":0},"4pX0wFDV4EIqWFvXTGow9w":{"text":"*** Thank you Chef Will Avelar. You have made the kitchen bar at Meril one of my most favo","useful":2,"cool":1},"tJQLWJ3jZaDo7zTO3SbTag":{"text":"Meril did not disappoint! Amazing ambiance, amazing staff and wonderful food! The staff wa","useful":0,"cool":0},"fZFyAvt8_MUlufIlTtMCcQ":{"text":"Cool. Hip. Chic. Trendy. Another Emeril Restaurant that hits the nail on the head. Small p","useful":1,"cool":0},"-_WyyMplL6BFRX2df-h7Qw":{"text":"If I could give zero stars I would. Great food but terrible service. It's a tapas place, s","useful":0,"cool":0},"ubUk9RAQWvbtZxcsvVtVBg":{"text":"Excellent food and desserts!  I tried the Korean Fried Chicken and garlic fries as an appe","useful":1,"cool":0},"QmmtwRyvrHhLkTfhrARijw":{"text":"Food and service were excellent. The sound reverberated around the restaurant and even tho","useful":0,"cool":0},"9De0wxS1ZN2hyPU27R-foQ":{"text":"I've always wanted to visit one of Emeril's restaurants. Meril's is contemporary, sophisti","useful":0,"cool":0},"ODCO1bWhkFOt0qBxWLM6Pg":{"text":"My wife and I ordered takeout this evening and were incredibly impressed! \n\n* Service was ","useful":0,"cool":0},"WuJNVJycwhvBYA4XPMdg2g":{"text":"We made reservations at Meril for our anniversary dinner.  I'm a big fan of the Fettuccine","useful":0,"cool":0},"fM7kDAag1ReVrQsp5qWVZQ":{"text":"Meril was our first stop after a long day of travel from SFO. Walking in (around 9 PM), we","useful":1,"cool":1},"VZti29gN36hdrrKcN6MIWg":{"text":"We decided to splurge on a late lunch/early dinner here before the Krewe of Muses parade a","useful":1,"cool":0},"MNtBYIocBjfhS3fNJc2HBQ":{"text":"We are in New Orleans to go on a cruise and a friend recommended this place. So we walked ","useful":2,"cool":1},"9YzY0TkwigZ5eafVf6Hj_A":{"text":"Meril is a great place for large groups, birthdays, and if you enjoy tapas style eating. I","useful":1,"cool":1},"X4Og5fPiO6umf2Y7SWWAbw":{"text":"Please get their Korean fried chicken wings. I am serious. You just have to. It is an exce","useful":3,"cool":1},"Yb8CONXTHU4mObjU5t_upA":{"text":"Food was amazing! Service even better... go and ask for Kewanna.!! Best server EVER!!","useful":0,"cool":0},"4JnVq6FNh3JcVqsu0j26_A":{"text":"The Fettuccine Nero with blue crab, Calabrian chiles, arugula, and marcona almonds is an e","useful":0,"cool":0},"fTQTzEWhhLJT-gwojkLrgQ":{"text":"Meril is a tapas style restaurant which are my favorite kinds of restaurants because I get","useful":3,"cool":1},"51i5IvzZULlGfVbCrGvQsA":{"text":"Such a fun place to go for your birthday!  We did several snacks and they were all really ","useful":0,"cool":1},"mmVQz-iCv1zx-db5mpK6OA":{"text":"If I could go to Meril everyday I would. Drinks are phenomenal and food is delish. It's a ","useful":0,"cool":0},"Oay-U3LkimfXanOo5LWFVg":{"text":"Oysters and gumbo were so delicious, shrimp scampi was wonderfully garlicky, and drinks we","useful":2,"cool":2},"DewyNKROH4k3hpi6vWzO3Q":{"text":"It was about 9 ish on a Saturday night did not have reservations but walked right and was ","useful":0,"cool":0},"10stsudvPZMXM7uGvi-YPw":{"text":"Was staying at a nearby hotel and needed somewhere I could sit alone at a bar and eat.  Wa","useful":2,"cool":1},"PnlhbzhMVd2XF7elj7pdFg":{"text":"The smoked fish dip was great as was the candied pork ribs and half chicken (cooked under ","useful":0,"cool":0},"dYPmW8krj9w8BIYh9UETwA":{"text":"Came here for my sister's bday and everything we had was very good! The service was great ","useful":0,"cool":0},"bWVIII-gsIP8A2Na5Yo2JQ":{"text":"Took a group out for a birthday dinner. Menu had so many items we wanted to try so we orde","useful":1,"cool":0},"6ZV5v7dDdE1AQj1lb4mwUg":{"text":"Started with the Gumbo and it was delightful, so many layers of flavors bursting in your m","useful":0,"cool":0},"RwvBAq_Gv3o-QBUDvEpzVw":{"text":"First I must qualify this by explaining I lost 80% of my hearing in my right ear.  But I d","useful":0,"cool":0},"lRsqD3zmPNACbzBZ5YXvJA":{"text":"Meril's is our go to restaurant. We were so glad to see it open back up recently. The food","useful":0,"cool":0},"gpG_PfwaxcfcovV1Ix0lMw":{"text":"I visited Meril with some coworkers while on a business trip in NOLA. I have to say Meril ","useful":2,"cool":1},"p69RYOxUR6lslRZhft92WQ":{"text":"Dined here for a work dinner on a Monday in July with a party of 5. I would classify the c","useful":1,"cool":2},"jjcd6tlSRX-WFDw24_beHg":{"text":"I treated myself to lunch here for my bday. So glad i did this when i did since Covid19 ca","useful":4,"cool":0},"wG2gNTAopChyP8IClZNsDg":{"text":"We had reservations for six arrived 5 minutes prior and had to wait 10 minutes before bein","useful":0,"cool":0},"-XJ7m25oCJXO886Ui-viwA":{"text":"We waited past our reservation time but once seated the service was ok but not stellar on ","useful":2,"cool":2},"tFCdwQlkL7c2liTDtPiSeA":{"text":"Every time we come to NOLA we always find a new treasure and this go 'round it was Meril's","useful":2,"cool":1},"x_Jio4RdYZOBmKhKrAiHrQ":{"text":"The No.20 drink was delicious. The food wasn't my favorite. I got the shrimp and grits , t","useful":0,"cool":0},"QfoOrONcZjyEYvFuljKXfA":{"text":"Meril was a nice place for dinner in the warehouse district.  Menu is a bit limited and ev","useful":1,"cool":1},"Ddd5QyOgwGuF5RnDuVMUFQ":{"text":"Meril was recommended to us by a friend. Generally speaking, we've had good experiences wi","useful":0,"cool":0},"GxhpV7Db9ZXmddz-IKF4uw":{"text":"First meal in New Orleans, was fantastic, service was great and our waitress was very acco","useful":1,"cool":0},"MUOMRnjr8voot39tH-A2lQ":{"text":"This review is only for espresso & dessert: we stopped in late at night to grab a bite. Ha","useful":0,"cool":0},"RqbHy6Bu-rPkzDqQhquWuw":{"text":"Our recent lunch at Meril provided the single worst customer service experience I have enc","useful":4,"cool":0},"XMuolnyO1lMXyOB93CQvLw":{"text":"Post-Covid excellent experience! Having only been previously for lunch, I went for an earl","useful":2,"cool":2},"gYguZRP5OMZPg_UQn6cwQA":{"text":"The food and service was absolutely fantastic.  Caleb took absolute fantastic care of us. ","useful":1,"cool":0},"vcxJMTU5IpdZnnWIxSbmXw":{"text":"Went here on a Sunday around 5PM. Seated right away, no crowd. Very pleasant greeting and ","useful":2,"cool":1},"uuytu5enlv5IswS6FT5Jbw":{"text":"I wanted to check this spot out for awhile now. I went in to sample I had the fried chicke","useful":1,"cool":0},"FwU0i3gMwXztTt9_lv5seA":{"text":"Went last Wednesday evening, exhausted after four days at a trade show.\n\nBecause we were w","useful":0,"cool":0},"VVN9s-nxvqNptoPfbApU2w":{"text":"Excellent food. We tried the feied turkey necks, chicken livers, deviled eggs, lamb and Ne","useful":1,"cool":2},"9HNnKUN0n2PPkX5kOI_eXQ":{"text":"I was expecting to pay for the privilege to enjoy the food at Meril. To my delight and sur","useful":0,"cool":0},"Pq1nUiln0MoTlXLnJN3RDw":{"text":"One of my favorite spots! From the great hip hop/ rap music to the changing of the menu, M","useful":0,"cool":0},"RvZBHnpQz8dktOmHg7jvWA":{"text":"Very delicious! Kinda a loud restaurant.. we went on a Friday night and it was very noisy ","useful":0,"cool":0},"LJUa2Pj8CYaxfvjPTSxcfg":{"text":"Meril is Emeril's for the millennial generation with a strong emphasis on small plates and","useful":2,"cool":0},"LWI7c0_GwBdu6mwsYZ8Qsg":{"text":"We made Valentine's Day reservations with great anticipation, but this meal fell short ove","useful":0,"cool":0},"ckTbR6Gj0L-o0bQQa2l8JA":{"text":"Gem!  Great food. Excellent service. This is a perfect spot for delicious and creative NOL","useful":1,"cool":0},"h6LsdEk0Y-A9G8uMeSMr3Q":{"text":"Caroline our server was exceptional. She was hospitable, gave us amazing recommendations o","useful":1,"cool":2},"NIfcLnDNqzeqLia6hH2nBw":{"text":"Updating a one star to a three star because my issue was addressed perfectly by the COO, M","useful":0,"cool":0},"6i7oHXJ0HiEutcdsRwpK5Q":{"text":"5 Stars! All day! Came in on a Sunday Afternoon with no reservation, 10 of us, they sat us","useful":0,"cool":0},"MZ_zvg-Vs_fxGIv_f1unKg":{"text":"Food on point, service impeccable, drinks delightful, atmosphere poppin. Loved this place,","useful":0,"cool":0},"Tn_XBzc3fkVLlqbFs_LSCw":{"text":"There arent enough stars to rate Meril! We were in NOLA with our family to celebrate my hu","useful":0,"cool":0},"e0VKBcp9AKw3IdiGwO-oJw":{"text":"This review is about getting the Calamari as an appetizer.\n\nI think my favorite part of my","useful":1,"cool":1},"1hQtey2gJs9mf-9W_mC-6A":{"text":"Service was excellent and the front of house was very professional and friendly.  The menu","useful":3,"cool":2},"dW5DjEakFG2yKAGjl7FOHA":{"text":"I love the vibe of Meril's! It's casual but also fancy so good for just a dinner out as we","useful":0,"cool":0},"noM4DqIrldcVN0SksbM-lQ":{"text":"We enjoyed dining here after walking along the riverfront.  The environment is clean, live","useful":3,"cool":2},"MVuTS8pApKyXHZNtdrqQ2A":{"text":"Went with family to try their Sunday fried chicken special. Requested table by the open ki","useful":0,"cool":0},"NRDmdRLd2J_jXPlARGQLuw":{"text":"We were in from out of town. Friends took us to Meril. Emmeril happened to be in the resta","useful":1,"cool":0},"myONUd8x8OqcTjEuajVfPg":{"text":"I have NEVER been to a restaurant where the customer service was so HORRIBLE. One waiter (","useful":0,"cool":0},"jDevd1UyUfJXWJPLpxp-FA":{"text":"Love Meril's! \n\nMy friend and I split the carrots, Korean short ribs, and fusilli pasta wi","useful":6,"cool":4},"CWKzCyCO9GsFHolu8jzWqA":{"text":"We made reservations here for our last night in town.  We were seated right away but that ","useful":1,"cool":0},"L8uF0bcfddeApeB-yLPRGQ":{"text":"Meril is such a great restaurant for any celebration. Their shrimp tacos, candied pork rib","useful":1,"cool":0},"8hdFFiP5LZkkFlEE3IPeqA":{"text":"I am just shocked. our reservation clearly meant nothing to the staff of this restaurant. ","useful":0,"cool":0},"Sfk1tYtGwZzGoXy7Lr8A8A":{"text":"A group of 8 of us went to Merils last night. We ordered a set of appetizers for the table","useful":1,"cool":1},"lSaLHRHfX31FqG2F-f08yw":{"text":"I was very happy with this restaurant experience. Great food and reasonably priced. Our wa","useful":0,"cool":0},"7ozEAzlSOOJuSRVbKfCJtQ":{"text":"This place was amazing. All the food was so good. I came here with two friends and we got ","useful":1,"cool":1},"iZKxL-Pr_z4-H0ZCE0rhwg":{"text":"My wife and I are from LA and were exploring New Orleans on the trolley. We spent some tim","useful":1,"cool":0},"umB4HdaCScSkuXYn7Ow7fw":{"text":"The food is great. I am super impressed with how friendly and responsive the service is.","useful":0,"cool":0},"K9yx4sgGEJJaw4b0JXzmOA":{"text":"This place is sometimes a hit or miss. The one time last year I went for my birthday it wa","useful":4,"cool":3},"sYmbwuG3jDUZ1odLIW7vqQ":{"text":"We dined on a weekend which may not be reflective of the weekdays. However, the location p","useful":0,"cool":0},"vZnu8-iPPfHAzQhpVjHsTA":{"text":"GREAT CONCEPT BUT THE FOOD DISAPPOINTS:\nThe charred corn with cojita cheese and lime mayon","useful":6,"cool":1},"x3OiwfF29JVRVPgVLty0HQ":{"text":"Wow, the team at Meril did not miss a beat during a busy graduation weekend in New Orleans","useful":1,"cool":0},"qSCKUTMUNN5kUudh0mrrqQ":{"text":"Always yummy! Wish I could remember every side dish I have had there-suffice it to say tha","useful":0,"cool":1},"T0X1P6xb5im8FI0AEtIaLQ":{"text":"I had a high expectations for this place and I was very disappointed. The drink service wa","useful":4,"cool":1},"ufII4LCj_ew9SlVgOo9oFg":{"text":"This might have to be my favorite restaurant In New Orleans because of the reasonably pric","useful":1,"cool":0},"3Tkmo7Q_gvcyCLzLICePVw":{"text":"Second time eating here and I thoroughly enjoyed the atmosphere and the food! Our waitress","useful":0,"cool":0},"n4QOPW8XhibTih3ZW2NbeQ":{"text":"When you celebrate your birthday, you have to go to a place with style and food that will ","useful":5,"cool":2},"BNgLMO-JRkonMtK4b7vtTg":{"text":"Wonderful dining experience here! Easy A!! Everything, from food, service, scenery, music,","useful":3,"cool":2},"XblXCYeHmujhzzrDBATESQ":{"text":"Y'all. Sit down for a second. Let's talk about their potato-less gnocchi (mulfatti I think","useful":0,"cool":0},"LY7vkCYliPqwq5T0k-miVA":{"text":"Came here for my birthday one night many moons ago, this was when it first opened. I reall","useful":2,"cool":3},"Oq1X4J3NN4pJYKebfAXFtg":{"text":"The vibe of the place is cool, and they have good drinks. The food is overpriced and tiny.","useful":0,"cool":0},"EEQe4MafIEffa0h7c6-B7Q":{"text":"Love this place! The food is so delicious and the restaurant has a very good ambience. The","useful":0,"cool":0},"ITwydwk1auHh3ffBaH9NFA":{"text":"Great experience drinks and food was delicious.  I had the fish tacos my husband had the f","useful":0,"cool":0},"MeMEa7KUgk1tUqRNEGqeEg":{"text":"I'll be back. My first time going for lunch and I was impressed. I went with a few friends","useful":2,"cool":1},"ovhhj20L5F7qxF7weyL_4Q":{"text":"I had the pleasure of dining at this gem on its third open night and surprisingly found no","useful":1,"cool":0},"R1lTNufZbUojRi_yMODbdQ":{"text":"There were some very high points and some \"just okay\" points from my recent visit to Meril","useful":2,"cool":0},"ANCsRPxYAevUAmKCYoVjGg":{"text":"This was hands-down the best meal of my vacation in New Orleans.  \n\nStarted with one of th","useful":4,"cool":1},"NXDHSriUucgUEojDQdWFmA":{"text":"Honestly, Meril is consistently a five star experience for us. That rating is 40% for the ","useful":3,"cool":0},"G2VPt-V5nyF1hlG3NshG8A":{"text":"Quite the experience at Meril last night. About half way through our dinner we noticed tha","useful":4,"cool":2},"HRvEE4QIaJ8io6She96sng":{"text":"We visited here on white linen night and it was packed. The ambience is open, modern and g","useful":2,"cool":1},"0PYmDW8HQ6Nk6wmjuy9Blg":{"text":"My friends and I wanted to try an Emeril restaurant while we were in New Orleans and Meril","useful":2,"cool":1},"mAfftMqTCNxAh68xMONsoA":{"text":"This place was super fun and I'm glad we had a chance to stop by during our trip to NOLA. ","useful":3,"cool":0},"QLrI5fWWKsf2da6nEQd3zw":{"text":"Fabulous meal from start to finish! Baked cheese appetizer was delicious, and the crispy c","useful":0,"cool":1},"RQKspTtuwgO-xtEC5jVykQ":{"text":"I made a reservation online, when we arrived our reservation was lost and we had to wait f","useful":2,"cool":1},"okLAt6TgUw6d7tqNloUzYQ":{"text":"I definitely think this restaurant has the potential for five stars from me, but based on ","useful":1,"cool":1},"ulWANfmocfZuZSvu0b82Jw":{"text":"Enjoyed Sunday Lunch here during Mardi Gras with some friends and family. This restaurant ","useful":2,"cool":1},"Xt4fKYtU1RSUa5yDSguutQ":{"text":"We have been here twice and both experiences were very good!  As you enter you're struck b","useful":1,"cool":1},"QilIeDoSSBznKLefmuKB7Q":{"text":"I had been wanting to try this place for a while because I've heard such great things. We ","useful":1,"cool":0},"Y7Cu1cUhkILwBojSgSQGFQ":{"text":"Meh. Meril just doesn't do it for me but for some reason I've been at meril so many times ","useful":2,"cool":0},"IgLr2QEdkeDjuLZwFizswg":{"text":"The only knock I had on this place was that it can be super noisy.  Other than that, every","useful":1,"cool":1},"KkHbGbyYPI83jzTk_ZV8rQ":{"text":"I come to you as a native of New Orleans. The food was good. I was referred this place by ","useful":0,"cool":0},"StrTHQYs1irA_0WUzjNTMw":{"text":"Loud Crowd, Good Food\n\nFinally got to try this place for date night, after months of attem","useful":1,"cool":1},"rxhCY0119i-LsmvSac35bQ":{"text":"Came here for my birthday and it was such a fun celebration. Our waitress and server assis","useful":0,"cool":0},"iwgV9cVIs0wDWqVKWgg9sA":{"text":"LOVED this place! We tried a little bit of everything on the menu- shells, shrimp, and mus","useful":1,"cool":0},"AlSBABEsMhyRFaUgC650Kg":{"text":"We love eating at Emeril's restaurants so wanted to try this one for lunch.  The interior ","useful":1,"cool":0},"dvgMeCTm9aVdDovWPmsuXA":{"text":"The food here was amazing. We ordered lots of small plates so was great way to taste the m","useful":0,"cool":0},"Sj9ClyK_RZ9GRYLSq5pfPQ":{"text":"Having come in without a reservation, we were fortunate to get seats at the bar along the ","useful":1,"cool":2},"4Q5riUk4DEyw1aQt8wht9A":{"text":"I was recommended to come here by a local I met at the airport. After reading reviews- I h","useful":1,"cool":1},"iQJrRFm3dgruyXf4hye8fA":{"text":"We missed happy hour but it really didn't matter as the drinks and food are really reasona","useful":2,"cool":1},"1xpU1Z-psDfyFM_l9UlYtQ":{"text":"Definitely glad we made rsvp for dinner this past saturday. We were greeted by a friendly ","useful":2,"cool":1},"Wl5nf6gW7Z6rFha48IxDdg":{"text":"The place is really cute and a great place to celebrate a birthday. The food here is diffe","useful":1,"cool":1},"ZzytLiIxnbPj7MiErzi9mg":{"text":"We came to Meril's for my mom's birthday.  We had a group of six so we got the full tapas ","useful":3,"cool":1},"bamISv01z5NB77flKP2CWw":{"text":"Sadly, I wasn't crazy about Meril. It's good but not great. I went here once for dinner wh","useful":4,"cool":1},"B0MmYJZ_JQMpQaN5Tc7zwQ":{"text":"We chose this new Emeril eatery for our New Year's Eve meal and were very glad we did. The","useful":1,"cool":3},"aHe47WgA1c_LLIfBJoqgJw":{"text":"Ordered, baked oysters, clams and pasta, meatballs, 3 cheese board, asparagus, and Mexican","useful":1,"cool":0},"GbdoDdQwmqFs2cu-JcfhQw":{"text":"Came here per a recommendation and I was not disappointed! AJ and josh we're both excellen","useful":1,"cool":2},"FGhGC2WyeUKETaF_PFJPFg":{"text":"Great service, nice ambience, such basic food. The food is meh, and charge about triple wh","useful":1,"cool":0},"T9hPK7ARxkXweDIxcf6zZw":{"text":"SO SO GOOD. We stopped in without knowing that this is one of Emeril's restaurants, but we","useful":1,"cool":0},"BoU-UwgdS3NU29MX8BrmuQ":{"text":"I'm very disappointed that I didn't even have a chance to dine here.  Perhaps you shouldn'","useful":2,"cool":0},"R1DZQReST2p7iJJVsnqltw":{"text":"It was less business more casual than expected. Food was ok. Good ambiance and service.","useful":0,"cool":0},"dZslGY4fvcFZUl3cSNSRYg":{"text":"We loved our dinner here! Service was great and everything we had was delicious. The servi","useful":1,"cool":1},"Ry_JM4ZblCBwOx1gsdkiEQ":{"text":"We had a large party and they handled it great. Everyone enjoyed their food. Great atmosph","useful":0,"cool":0},"6_kWOU66hTlQpJompIeEZg":{"text":"Have  insured meril several times, and have always enjoyed the food and atmosphere here. L","useful":1,"cool":2},"aFJ8re69OWjqrdC_CZBP8w":{"text":"I can't say much for the food, but the desserts here are great!!\n\nWhile in town on busines","useful":1,"cool":1},"MFLDTsO_6EScVvP4ksgbOw":{"text":"Our second time around! Love the small plates variety ideas and almost everything we got a","useful":1,"cool":1},"yjT-VM3wPMVBKmCFKaU44Q":{"text":"The VIBES were so high in Meril's last night. It was a perfect Friday night friend-group e","useful":0,"cool":0},"DHbY3XtKY8rf2bzQrhhXuw":{"text":"Relied on my fellow yelpers to find this place. Was initially disappointed to realize it i","useful":1,"cool":1},"Mps4YU6Iyy0z2yv8YSs7ag":{"text":"I finally made it to the highly anticipated dinner at Meril! It was my big Sister's birthd","useful":1,"cool":1},"XEgt0QuUTWzwIJbirVApBA":{"text":"I went for a late lunch here with my girlfriend. We were able to walk in without reservati","useful":1,"cool":1},"GRt-sG7lS_Dp8IkkucqbPg":{"text":"I've been here many times through the span of its first opening. The dishes have not seeme","useful":2,"cool":1},"O6wu7msk7eLkTqgtLCCLhw":{"text":"First time here, and it was much better than expected. They had a great food and drink sel","useful":2,"cool":1},"DJQCv3Yg_jKaUunV0e8GHA":{"text":"If you're looking for a nicer atmosphere, really good food, even better drinks, and cotton","useful":1,"cool":0}}