{"XGE3yRMDwghKsL-WJXk1ww":{"text":"There's always lots of big white dudes hanging out here, and everyone I know knows someone","useful":3,"cool":1},"KDlHf4rLaMlxEbn3HoltFA":{"text":"I'm pretty fond of this place. I haven't been here recently, but I used to come here all t","useful":1,"cool":0},"AwgtOz5T8v_tfLn0XB0XIQ":{"text":"Fat Harry's is a very average bar in a good location especially during Mardi Gras. The foo","useful":0,"cool":0},"SLK0oodjKeIRIcpFJliJEw":{"text":"Great place to catch those away Saints games or some Monday night football! I think Monday","useful":0,"cool":0},"wWFYjNVI6QF642kP5Kh4vQ":{"text":"Just made a little stop here to have a drink while walking around in the Garden District. ","useful":0,"cool":0},"QPSgnXlbrSvcXzV2ZMdp8Q":{"text":"Friendly staff, good vibes, enough TVs to watch everything you need. Oh and really good wi","useful":0,"cool":0},"Fxa1ngpre-UWJCVie5MS2w":{"text":"OMG...  almost walked past this place, but asked a question to the lady outside.  She was ","useful":0,"cool":0},"KiEdf5Ap3cVve1MwvWiyhw":{"text":"Fat Harry's is one of my favorite places to grab a drink and food with friends for any occ","useful":0,"cool":0},"xuSlF__zWP4YXnTqC63pEg":{"text":"We came here to watch the Cubs championship game after a nearby bar filled up. We were abl","useful":1,"cool":1},"Rpw37MiXlXCnP2xjEFPIug":{"text":"I'm giving 4 stars because of the service and friendliness of the staff. The food was 3 st","useful":0,"cool":0},"_a-03zyfJsG8-IvjRcfR0Q":{"text":"Perfectly adequate dive bar uptown.  Tap beer selection leaves something to be desired. Fo","useful":0,"cool":0},"67vEvOe7ltWS0FATvcVFRg":{"text":"I love Fat Harry's- very accessible bar on St. Charles. It's slightly dive-y, and definite","useful":0,"cool":0},"Y6-L6PpwRL1KcgT2915otg":{"text":"I was definitely the minority there that night and had a tough time getting in. But no wor","useful":1,"cool":0},"a3O88VAOqEWDMYtY8nBpGg":{"text":"Nice bar staff is really cool peeps. The Cajun burger is good but don't get it on the onio","useful":0,"cool":0},"C1fvaR9dgonJtBRHQeg7Pg":{"text":"Fat Harry's is a great place to go on an off night.  I used to love getting pitchers of be","useful":1,"cool":0},"i9Iu4R0eXBCdO3MMKkOj2Q":{"text":"Always a great night.  I love the sitting out and people watching on a saturday afternoon.","useful":0,"cool":0},"VvSq3Q_AEMAd5li01Fa0oA":{"text":"Pretty pricey place to go and have a beer. Food menu is pretty good but is also pricey. I ","useful":0,"cool":0},"oIYqXrGhkkvdI04Sph4R6Q":{"text":"I actually have been going here for years and I'm sadly just getting around to reviewing i","useful":1,"cool":0},"GN-pWEAeB0VDkbR_r9Q6VA":{"text":"Great bar to watch some football and drink some decently priced beers with a pretty good s","useful":1,"cool":0},"wLYn6K6JVmi4eCgZcIcF5w":{"text":"Typical local college bar. chill. Damn good homemade chips... Five dollar BLT hit the spot","useful":0,"cool":0},"1aiEWGdomupIgAxcqdWH0g":{"text":"Bartender, gentleman with bald head and glasses; is by far, the most abrasive and unpleasa","useful":3,"cool":1},"KGA3pzQNfoeFurBKZsxopg":{"text":"This is bar restaurant for food I got pulled pork sandwich and it was great I love the fri","useful":0,"cool":0},"3A_kBTQi0f9HqyXJcM4igw":{"text":"Almost missed this place.  Happy Hour 4 to 7 on well drinks.  Wraps were good for a sports","useful":0,"cool":0},"6LqmMGk8wsM-M-ZZ-xlbSw":{"text":"\"Ripoff Scam and Terrible Management\"\nThis is a review that I wrote back in 2012 on Tripad","useful":1,"cool":0},"WT_lcYc-LQFovXVQiAukuw":{"text":"Even in college, I never hung out at FH. Sure I'd stop in when other folks wanted to but i","useful":3,"cool":1},"w-4t26NlJLsXUs9RyuHXqA":{"text":"Fat Harry's is one of the first bars I ever went to in my younger days (back when the drin","useful":2,"cool":1},"xn0OdLq0RgAe-n6EQ-D29Q":{"text":"My friend told me about Fat Harry's years ago and I've been back many times. Love this pla","useful":0,"cool":0},"lGLiiV8Sk7My64no3hLIXg":{"text":"New Orleans is full of great bars.  Some are beer bars like The Bulldog, Cooter Browns and","useful":2,"cool":1},"Bd35oHY_ULN7SJgcNbCkLA":{"text":"Great Staff, freindly bartenders...Definitely has its times as a young crowd, but everyday","useful":0,"cool":0},"NyXLVHpK_dATAiUgiKDH5A":{"text":"So I used to have mixed feelings about Fat Harry's but I've come here quite a few times re","useful":2,"cool":1},"5w7KEPaLVjjRERa_Cgx6bw":{"text":"Visited this location while on the Uptown Halloween Pub Crawl. Seemed okay. No egregious i","useful":0,"cool":0},"tE3S-MRKlXwVVuQheAyC6Q":{"text":"One of my favorite sports bars from around the city featuring great bar food, a huge bar a","useful":2,"cool":1},"2rIOo4GW3uhRo5bEFwBOdw":{"text":"I'm updating my review of this place because of recent experiences I had here during Mardi","useful":2,"cool":1},"kAKaXJqHUFFISJF06jXIfw":{"text":"I love this place! The bartenders are fantastic, the food is delicious, and they play Univ","useful":1,"cool":1},"6I90ud3TVm-u9rIpmhBaEg":{"text":"I've never been so insulted by an institution in my entire life. I was treated so poorly b","useful":1,"cool":0},"h7a_HRMQYWDSojcTiJEEpA":{"text":"I have been frequenting this joint for years. It is the quintessential bar for New Orleans","useful":2,"cool":0},"7mji7yXGzZGCMaYItNo7Ow":{"text":"They make a decent burger, but otherwise it is a seedy college bar with adult bar prices.","useful":2,"cool":1},"7Be8ISaHFyJS1oGZ_jPspg":{"text":"Decent Bar. fills with college kids on Friday and Saturday nights, so good to avoid it the","useful":2,"cool":2},"YlfYasaOoTgQg5woIJr6ug":{"text":"Very frat-y. I went here while still in college and I already felt old. Good if you like t","useful":3,"cool":1},"EIWZhQuuU1Z9S_gjfZ-NUg":{"text":"A good place for an afternoon pint with substantial beer selection and first rate bar food","useful":0,"cool":0},"W1OzLCdZWt-npK_aAII3KA":{"text":"Best Shrimp Quesadilla I have ever had. I went there during lunch and I had heard good thi","useful":1,"cool":0},"Q4y5jDQLLwZNl-KnJstotA":{"text":"I visited this bar on Thursday 1/9. I had a couple of beers and offered to buy a guy who I","useful":5,"cool":1},"uO8Y9xYoqH65zVJ_H1p0Cg":{"text":"Great bar if you like cosplay and hangin with fat nerdy dudes. Food is good...ish. Staff a","useful":1,"cool":0},"SWIwNGyKlPMH9ee4GcxIFg":{"text":"Fat Harry's is ingrained in every college student's memory.  A decent bar with decent pric","useful":0,"cool":0},"ESn6Y8_V8NcSa45LRerGTA":{"text":"It's not cheap by New Orleans standards.  We still paid $6+ for each beer, which seemed hi","useful":1,"cool":0},"YUKYxTkzmDyPpJ2MBsk8hA":{"text":"I have never encountered a more rude staff than at fat Harry's. The entire establishment w","useful":0,"cool":0},"Fb9_FxWh6FWPryTPC5tnbg":{"text":"Go there for a saints game. Pitchers are cheap, wings are great and the crowd is truly ama","useful":2,"cool":0},"LMQlrZqiSY2DbEOa7r1aag":{"text":"Here we definitely have a college bar. So you know what's coming next: it's definitely not","useful":6,"cool":1},"u4nGLP-tppSmJi075viQgg":{"text":"Rico love cajun hamburger here.  \n\nMany boys with big money who wear same clothes.  Maybe ","useful":1,"cool":0},"Y2uNX2uHFtG1_1ZzDnZUqA":{"text":"I spent many a night in Fat Harry's during my formative years. One of my distant cousins u","useful":3,"cool":5},"muI7775pFsT_lx9uTQIsSg":{"text":"Not a bad place to watch a game, grab a drink and get a bite to eat. \n\nMy college alumni f","useful":2,"cool":1},"C_9C73uIf-3-kOcsU4bdDg":{"text":"Another updated review of good ol' Fat's: it gets a stigma of being a college bar, but eve","useful":1,"cool":0},"PZya1bKH3DhYjZwwVGzD1g":{"text":"On the level...pretty good beer selection. Pretty laid back atmosphere, which I like, but ","useful":0,"cool":0},"obmahY6hJT2TDGd3sl86fg":{"text":"Was great when I was 18, but now I'm over being in bars filled with underage drunken kids ","useful":0,"cool":0},"6DEYeGjlSCfrQrWABLJ4VQ":{"text":"This is probably my favorite place to watch football on a Sunday. We can go and watch all ","useful":1,"cool":1},"Bog4zPtlkZuHHEH7rZdH8A":{"text":"The bar food is actually really good with a great selection. I like the buffalo wings and ","useful":0,"cool":0},"x1vsKD0UaCO6JWy9hpWu0Q":{"text":"A pretty basic dive bar that does what it needs to and no more. The beers are cheap, thoug","useful":1,"cool":0},"iq3vblPcfKQW8WpSp5AfAw":{"text":"Great bar! Good service. Good patrons. Always always say yes to the wings! My favorite is ","useful":0,"cool":0},"9CQ2_KZ25U7e5BwzgfQ2qQ":{"text":"Wings were underwhelming. Well-cooked. Crispy on the outside and nice and tender on the in","useful":2,"cool":1},"yvNsnPahLIb47Eb13hJ65Q":{"text":"A great  bar to watch sports on tv,fabulous food options and full service bar. My favorite","useful":0,"cool":0},"ZSTldozUkG3FNo2675qenQ":{"text":"This is the best bar in new orleans. Good drinks, love the people there, love the atmosphe","useful":0,"cool":1},"_vMO8Rp_TuXtXwsipF1R4Q":{"text":"Disclaimer: I had a really really bad experience, and while this is not necessarily repres","useful":6,"cool":0},"WWN6Kl3zJDkx5orqwVR5DA":{"text":"Friendly customers but by far the worst bar service in uptown. Great food.....","useful":1,"cool":0},"nJTrCLvQjrxrKLOWfhRh_w":{"text":"Best neighborhood bar around. Great staff, drinks, and food. Have every LSU sporting event","useful":1,"cool":1},"ki7z_WfYyuG1C79UKlkWBQ":{"text":"If I could give a negative review I would. The staff of this restaurant are irreprehensibl","useful":0,"cool":0},"h1ODZ4gsHTx677qySIyxDg":{"text":"So the scenery is not so great and there are usually somewhat fratty guys around, but the ","useful":0,"cool":0},"cmGJDcAJ41D1Inbv9G_LGQ":{"text":"Not sure if I've ever been here before, but I definitely want to start pretending to drive","useful":0,"cool":0},"Ml0pGRSWTgePpZhTMjDAzA":{"text":"Normally, I find myself in Fat Harry's when I am posted up outside for a parade and need t","useful":0,"cool":0},"5YEWSJxiNnTaqD_CBjymAw":{"text":"Absolute hands down my favorite bar in New Orleans! Being from up north I need to find a p","useful":0,"cool":0},"iky7OmQ2ALetFgIw0AsiMA":{"text":"The summer after my junior year of high school my friends and I got into a rut.  It would ","useful":1,"cool":1},"mlbVCwdIRB6H-eDnFdoffQ":{"text":"If I didn't have a group that met here on Tuesday nights I definitely wouldn't hang out he","useful":8,"cool":3},"AaOveW4Gcn-c9goBu42fLg":{"text":"Sliders were amazing and reasonably priced.  Bartender Ashley was very accommodating and k","useful":0,"cool":0},"fYd4wydbXTUb1HU_P0fiuQ":{"text":"This was such an unexpected surprise! My friend and I were looking for a bar within walkin","useful":0,"cool":0},"BxtOjvp6AYhpyfrqhzF1ZQ":{"text":"I visited this bar on Thursday 1/9. I had a couple of beers and offered to buy a guy who I","useful":3,"cool":0},"0ONzWzfC7sq1rrsnW-VlIQ":{"text":"Fantastic uptown neighborhood bar. Lots of different choices for beer and cocktails. Super","useful":0,"cool":0},"d1TgtA2SKB68wHSB3ftrdQ":{"text":"Yay for Fat Harry's for feeding Touro's ICU while we are overwhelmed during this pandemic.","useful":2,"cool":1},"qfTEEJPCqHfnCzyTjL6vsg":{"text":"Exactly what where you want to be for any sporting event! Great food! Great drinks! Great ","useful":0,"cool":0},"zAgW8KpF_z2JbyXD4MSq2A":{"text":"Fat Harry's has been around for as long as I can remember and it looks wonder after the fi","useful":5,"cool":4},"sIvxhwJrDxiMRgl2ZGSfaw":{"text":"i am so happy this bar is open during COVID, and i've been at least 4 times since being ba","useful":2,"cool":0},"phIZFh9BHN8kLh_l5-dqXw":{"text":"Lived near here years ago; had my first beer at the bar and immediately threw up all over ","useful":1,"cool":0},"VqLWkkZ7Kmdh9_HywOyezw":{"text":"The wings here make me wanna touch myself, they are so good. Like soooooooo good. Great be","useful":0,"cool":0},"lreEHXp3vtsAc8p90cOzdQ":{"text":"Fat Harry's was one of the first bars I got a drink at, underage, a long time ago during M","useful":8,"cool":1},"Ba6AImo7UvJdxIlg-LwN0A":{"text":"Zane and Ash made my day!!! They were so happy and had the best attitudes!! They were on t","useful":0,"cool":0},"ApfM6qXF6zL81PHt7tn6vA":{"text":"Great place to watch the Buffalo Bills game! (Even though there is no Buffalo Bills decor ","useful":1,"cool":0},"tj9rfE12KgVSGKez0a56eg":{"text":"Amazing bar! It has been my local bar for years. The food and staff are amazing! They have","useful":0,"cool":1},"KEZvbGM0QS1WOyaMuw-52g":{"text":"Awesome Bar, one of my favorites!! Ashleigh is an amazing bartender, and there isn't much ","useful":0,"cool":0},"_VAEbHxbXF17UjbEDsx1UQ":{"text":"Takes a licking and keeps on ticking comes to mind when I think of Fat's. How many times h","useful":1,"cool":1},"lrx51WarnNrTTyF62PsxrA":{"text":"Fat Harry's isn't a bad little place.\n\nWe stopped in here on Lundi Gras after parades. The","useful":5,"cool":0},"VcXAdYfCqGB-p36G0oIbuA":{"text":"Awful service. Waitress refused to change the tv to the NFL game I requested be put on. On","useful":2,"cool":0},"xnmD8pSkrVrXrFdQE5XM8Q":{"text":"Bad vibes from the moment we got there. It was Super Bowl Sunday and we had looked up a sp","useful":1,"cool":0},"tx80OnirNhPDgwrXiL5ZEw":{"text":"$10.25 THREE SLIDER COMBO WITH FRIES!\nThat's cheaper than Burger King! And even though the","useful":6,"cool":4},"yFssZafTOnZHYZ3jWXgoaw":{"text":"One of our favorite dive bars in New Orleans. \n\nEven during the pandemic, FH's is a cool s","useful":0,"cool":0},"bsdrOYgEaRt5UW1UddKcIw":{"text":"The wings are just how I like them, naked and extra crispy. They are simple buffalo wings,","useful":3,"cool":0},"2U8mC0lRxJ7apa60p5AOzw":{"text":"What can I say about Fat Harry's that hasn't already been said about some Fat guy named Ha","useful":5,"cool":4},"bhGnri-C1Vjd68-RWFQSXQ":{"text":"Probably the worst bar meal I've ever had. Ordered to go, and usually if the bar is backed","useful":4,"cool":0},"IRii7gm8xJD0zfoFnJFBCA":{"text":"Fat Harry's should be ashamed of itself having someone like Ashley working for them. She i","useful":0,"cool":0},"1uJCo309osQKY9uQDOVldg":{"text":"Shout out to Fat Harry's for all the love at parade time. So nice to get inside when it ra","useful":3,"cool":2},"rt4vLHL3hDWaLQk8sebNDQ":{"text":"the RUDEST staff i've ever come into contact with. one of the many (??) servers we had wal","useful":1,"cool":0},"yDPDtgKFNnPIHrNdTEHXJA":{"text":"For me to be writing this 1000 word essay on this beautiful Monday and being from New Orle","useful":4,"cool":0},"wNvz5LdK4aIfdip84AUEyg":{"text":"I have lived within walking distance to Fat Harry's for five years and I have visited this","useful":1,"cool":0},"3ttjejBlQY8EjSDN5ZkUtg":{"text":"For a sports bar, this place is literally ideal! Great divey ambiance with tons of TVs, an","useful":1,"cool":0},"LBVuESBpqNPqBqzCZwkgoA":{"text":"Yes, Fat Harry's is a dive bar. A dive bar with a good beer selection, better than average","useful":2,"cool":1},"LRX9hXMfKvAlT7MKEISosg":{"text":"Been coming to this bar since 1988. I hadn't been inside for the past few decades, but thi","useful":1,"cool":0},"_Pi0Kd5xtCQZqtoKGbCmuw":{"text":"Tourist cars be warned\nTow-trucks seek seasonal ca$h\nIt's Carnival Time!\n\n#NOLA_Haiku #Hai","useful":1,"cool":0}}