{"u1P6jZXt788DdFrxuMyISw":{"text":"A reasonable dinner (our first night out in NOLA). Between the four of us, we shared a num","useful":0,"cool":1},"jznMQo2L-G8OTPGR5XYzgg":{"text":"I've been twice now and everything I've tried was perfect. In fact, the chicken and dumpli","useful":1,"cool":0},"8Tb03cpmbuH50__H4OCWkg":{"text":"Had dinner here while visiting from out of town, and I think it was the best meal I've had","useful":2,"cool":0},"RTgF4He8unhTNBTqmDZ2XQ":{"text":"Everything we tried was awesome!  Friendly and attentive service.  Fun atmosphere. We enjo","useful":1,"cool":0},"tfYnlez1b74eqLXwmcwFig":{"text":"The menu is pretty small and the seating is a little odd. Food is decent but nothing to be","useful":0,"cool":0},"uy-SbtwnI2aD6PfyRHZ1RA":{"text":"We went in today because it was Restaurant Week and wanted to eat the special menu.  It wa","useful":0,"cool":0},"2M3O6HE9d_CvpxOsPL1m5w":{"text":"Went there for dinner last Sunday, best burger I've ever had, hubby got the duck and my so","useful":0,"cool":0},"cBPz7A-YZsbyRwA8tQDUYg":{"text":"Needed some gizzards and duck!  A bit of a walk from the trolly but great service, excelle","useful":1,"cool":0},"FbiiZWdt896klrah9-ka3Q":{"text":"What a hidden gem! Excellent service, delicious food and cocktails, perfect price point. W","useful":0,"cool":0},"xtqL3ebbfmP4UDlm5jRwmw":{"text":"Drove 2 hrs. with my family back to my hometown to check this place out after hearing abou","useful":1,"cool":0},"ZWnVaCUlSodRAza001oD4w":{"text":"We stumbled on this place and fell in love with it. Eric Cook the owner has something spec","useful":4,"cool":0},"2SKY57tjUUSogSRR2aVwvg":{"text":"They happily accommodated our party of eight on the upstairs patio. I ordered the Voodoo Q","useful":1,"cool":0},"Be9IUwONdomMz38vZ8u2nA":{"text":"Loved this place! I've wanted to go for a while and the stars finally aligned yesterday! G","useful":0,"cool":0},"hZvgZlblAgGDsuf4GEyxUg":{"text":"I don't even know where to start . I've had almost everything on the menu and I haven't fo","useful":2,"cool":1},"-EPayi4b_oAyWOti0kjmRw":{"text":"Hot damn\nThis place is explosive, i ordered shrimp, the gizzards and fish .\nI came back th","useful":1,"cool":0},"SaHGiV5HhNHiU_0XhxHclQ":{"text":"Fabulous food. Never fails to deliver. We split the roast beef po boy and the oyster po bo","useful":0,"cool":0},"XHoWJCGWIPMeT8SRKevPzg":{"text":"We sat at the chefs counter for the best view in the house. cracklings and cheese, Fried g","useful":0,"cool":0},"yZx1Fp7cCViOqv5I5XfPLg":{"text":"New Orleans has a lot of options. Gris Gris is  trying hard to compete. The food is good (","useful":3,"cool":0},"Z-oLAgZMfJgrSxaEHa7msg":{"text":"Rocked up for restaurant week. Sat at downstairs bar. Chicken & andouille gumbo was on poi","useful":1,"cool":0},"8z6mBUt1Y-vOKe3EvbByxw":{"text":"Don't miss out! This has only been open since August 1st and it is a find. Oyster BLT is a","useful":2,"cool":0},"zhR_kUOXwm0dIhP17FA5qw":{"text":"The chicken and andouille gumbo was incredible! The roux was dark, thick, and had tons of ","useful":1,"cool":0},"nn0C5RgnStdXe34no7NXDA":{"text":"This is a lovely place where our family had a great lunch. \nSince they do not take reserva","useful":0,"cool":0},"Kfib0eDeIPjDkT1bd3r7rA":{"text":"Round two just as good as the first time. Tried the pork belly with compressed watermelon ","useful":2,"cool":1},"N1IqsEuVQ4VWCrrCK0a9xw":{"text":"We came for lunch and I left hungry. The fried oyster/pork belly appetizer was very good. ","useful":1,"cool":0},"_b3161rIfNFyIbpdIosIdA":{"text":"Excellent food and drinks. Staff is very friendly! Honestly most friendly I've encountered","useful":0,"cool":0},"VGNZbDWFaHQ_lBWDyrkb7A":{"text":"Yesterday, was the first of the four event wine series at Gris Gris. Perfect event for the","useful":5,"cool":2},"6EOcq-esoOexeVgpPJFC5A":{"text":"Don't skip this restaurant on your visit to New Orleans. And if you plan to go, try to get","useful":3,"cool":1},"gOrOy9I1vKRsMQG-72NxLw":{"text":"There is a wonderful saying that I love: \"New Orleans is my Favorite Restaurant!\" We live ","useful":0,"cool":0},"AiG45KVRDv9cRuUfLglflg":{"text":"Another culinary gem in our town. The food dishes drinks and service are amazing. \n\nThis i","useful":2,"cool":0},"TBkxPjFj8SrUmiHeYyxyLw":{"text":"The gumbo, po'boy oyster sandwich and most importantly the service and chefs were amazing!","useful":0,"cool":0},"6urqzVnP1W6VCKJ__2rJCw":{"text":"My girl friend and I were visiting from out of state and looking for something to eat and ","useful":1,"cool":0},"OIvkh3VVe4oS4QUvzdawqQ":{"text":"Incredibly delicious selections served by friendly staff-- including the chef who came out","useful":0,"cool":0},"SqEJdrp1xJ3JgmiQkb_B_Q":{"text":"Great place in Lower Garden District. Sat outside on the upstairs patio. Cocktails were gr","useful":1,"cool":0},"d1ZzO-2wtjrGdEHDlnsHoA":{"text":"Amazingly good food. What you want and expect from a NOLA Native. Oyster BLT is literal pe","useful":2,"cool":0},"ZEx2EIi5bYQKil7eQGStJg":{"text":"Another lunch and another amazing lunch. Got seated around the kitchen table leave one, my","useful":0,"cool":0},"timi3Ot3Ck6oLjzFjQYvCw":{"text":"Gumbo \nShrimp and grits \nCinnamon bread pudding \n\nFound this on thrillist for one of the b","useful":0,"cool":0},"RB5Dl2BtVmLGCVsb23f16Q":{"text":"High quality ingredients and perfectly executed! Sat at chefs table and witnessed one of t","useful":0,"cool":0},"jKdpw2NDGveUMLBoclPygw":{"text":"This is my favorite new restaurant! It's hard to believe they've only been open for 12 day","useful":4,"cool":2},"1yx4R2a-I4b1ACRtclkYEA":{"text":"Staying at an Air B N B around the corner and saw this restaurant online and got really ex","useful":1,"cool":0},"Ltn4MgKD2cXIHFyiCbohgg":{"text":"The staff were great and very welcoming. The food was amazing and everything we tried and ","useful":1,"cool":0},"UXuxrboVFcyFWWLnGBGsOQ":{"text":"Gumbo and setting were excellent. The rest was very frustratingly subpar. Sat on the balco","useful":0,"cool":0},"BQ6cPlkJdf03dJi2fdwO2Q":{"text":"What a wonderful dining experience! Make sure to see Ethan and Danny upstairs for a great ","useful":1,"cool":1},"ltiYbuwX65A3nTgLxQCwhw":{"text":"Best.  Porkchop.  Ever.\nFinish it off with the bread pudding.  \nPonder whether you should ","useful":0,"cool":0},"3gduT2mawSIo9XpHyDA64Q":{"text":"I really wanted to like this place, but it was just so average. Small menu, which is fine ","useful":0,"cool":0},"1_cFZGfy3qEGrSFi156qbA":{"text":"This was a spur of the moment decision and we were so glad we stop. The food was amazing a","useful":0,"cool":0},"lngrMkDhmZY4f4yN41Cg5A":{"text":"Superb southern cuisine, hand crafted magic by Chef Eric.  Stuffed crab and Oyster BLT are","useful":1,"cool":0},"nVI3QKowgwAQG_Muhdayjw":{"text":"Was hesitant when we arrived and were seated at the counter overlooking the kitchen...it w","useful":1,"cool":0},"vuL931dViY3FgKnwSFZJVQ":{"text":"Epic may be close to the words I would use to describe. Just went tonight for my birthday.","useful":0,"cool":0},"FNVcXmN2s36V-0afJp_Teg":{"text":"Great food atmosphere and location. Stoped by for lunch after hearing Tom Fitzmorrus talk ","useful":0,"cool":0},"HE4OwPtr-TT-HrYV2znEtA":{"text":"Stumbled upon this gem after going on a little sightseeing while walking around. The food,","useful":1,"cool":0},"4Wk46cEDT3Vc5G7tf6wneg":{"text":"I love New Orleans.  I love the food.  But it CAN get a little repetitious.\n\nThe menu at G","useful":0,"cool":0},"KpAQsE50N7AaKNYH0x_Icw":{"text":"Had the appetizer shrimp with fried green tomatoes - exceptional!  Moms chicken and dumpli","useful":0,"cool":0},"BlYKO4nm4Iys1aZ_Lpe3AA":{"text":"Well made house cocktails and a very accommodating bartender upstairs...the bar is missing","useful":1,"cool":0},"v_exYEXO24H_GC5feuybQA":{"text":"Amazing food with an amazing experience. You get to sit and hang out with the chef as he p","useful":0,"cool":0},"pnhH3KX-xJFqeYNl_Bk0Cg":{"text":"Tried this restaurant because a friend recommended it and for the reviews. Food was very g","useful":0,"cool":0},"RhkO1MdRJey1HU84Ke2T0g":{"text":"One of my favorite new restaurants in NOLA.  Try the shrimp and grits, the bread pudding w","useful":1,"cool":0},"Xdn__DXFcboWYwGV8YTbaA":{"text":"All around great experience. It's truly wonderful when you see the chef involved proud of ","useful":0,"cool":0},"V_drPVaPjyLw-Nj8S96Szw":{"text":"We tried several appetizers and they were all delicious! Flavorful combinations you wouldn","useful":0,"cool":0},"IpQG36JvSyY-ZqHVf-Vv4w":{"text":"We only came in for a wee bite, but were blown away by this fried green tomato shrimp smok","useful":0,"cool":0},"Ys_Kxp08ety8g87V9q6Z3A":{"text":"Best meal I had in New Orleans! It was delish! The drinks were amazing too. We shared gumb","useful":0,"cool":0},"_8vGQNZ9TKNUOw-4uT_0EQ":{"text":"For a restaurant that's less than two weeks old they are doing really well. Oysters were f","useful":2,"cool":0},"Kp8WFkAyX2IRimTb-5rWvw":{"text":"Awesome food and atmosphere.  I was sad to see \nSquare root go but this is a much better u","useful":0,"cool":0},"iu5zu7WbJnb9mX702Mp_cg":{"text":"Wow - for a new restaurant open less than a month, they have their act together. We ordere","useful":1,"cool":0},"1JiKLybybo9fWASOCb8TGw":{"text":"Man. In a town full of amazing food, it's hard to get blown away. Just come in and order a","useful":1,"cool":1},"sn9xqiyr7x85FF845wHqcA":{"text":"Went here for restaurant week and had a truly delicious house salad and shrimp & grits. Th","useful":1,"cool":0},"sd4nrrvalMqAueBHwpXM4g":{"text":"I got knocked up by this restaurant.\n\n\nAmazing grilled fish, even better desserts. Friendl","useful":1,"cool":0},"6icUnWnt81xztLlVLoTEbg":{"text":"I had the stuffed crab, pork belly over watermelon and red beans and rice. It was incredib","useful":1,"cool":0},"p3MeN7WeOSV1rtjRk09jzw":{"text":"Just checked in after getting. Served a great gin and Elderflower cocktail and sexy fruity","useful":0,"cool":0},"4saCFcv5e8FDoiFF4yHK4w":{"text":"We enjoyed our meal and our waiter Glenn was really a pro. The food exceeded our expectati","useful":1,"cool":0},"R7vdhWs_qrLFOv7d8Da-vg":{"text":"Super good and yummy food and great service!!! Smallish menu which was maybe the only thin","useful":0,"cool":0},"y1F_YEQrL1wY6qGRuQ_w1w":{"text":"Had the pleasure of experiencing this foodie heaven as a result of a recommendation from t","useful":1,"cool":0},"UB741dWXgiyRnSM32dSooQ":{"text":"This, by far, has to be the BEST meal I have ever had. My husband and I are visiting in fr","useful":0,"cool":0},"tBsaGXtUCdchi0KWsShUIQ":{"text":"Amazing restaurant, food, atmosphere, experience, and on and on. The food was off the char","useful":1,"cool":1},"E_CIjq4maK8EJL2WIxKAdw":{"text":"Loved it! A friend and I went for opening night and had a wonderful time. The ambience, th","useful":0,"cool":0},"ZrtapvYrZ8PaBYvlZ7PIDA":{"text":"Gris-Gris is great.  It fits this area perfectly.  Flavorful and reasonably priced.  This ","useful":0,"cool":0},"G6FiW5T19bR8S9ElghZL6A":{"text":"The chicken and dumplings are amazing. Beautiful concept for a restaurant, it has an open ","useful":1,"cool":0},"8MnvrC8pJoO452QbYjaOBA":{"text":"Great location. We sat outside on the balcony.  The deviled eggs were good but salty. The ","useful":0,"cool":0},"AXEgSUtwhN1EaLUuNzYJuw":{"text":"Easy 5 stars here.  We were recommended by my husband's colleague for our anniversary trip","useful":0,"cool":0},"oeDbQ2SLTU7XOBiNUisuQA":{"text":"This is what my neighbor hood needs, a fairly priced restaurant where locals can keep comi","useful":0,"cool":0},"GwbqchVc2o_H_rOI7dsXQw":{"text":"While visiting a friend in town, we heard about Gris-Gris and had to try it out. We ate at","useful":1,"cool":0},"NGpK_WbxAWom5n-gy4j96Q":{"text":"Can you say yum?   I can, you say it \"Oyster BLT\".   I wish I had one right now!    It was","useful":2,"cool":0},"qUb_vGbli9c0AvhpM4OTNQ":{"text":"This restaurant is PHENOMENAL!!! It can't be easy to open a new restaurant in New Orleans ","useful":0,"cool":0},"vv-jDX9BhNu0FG01ZU2Pbw":{"text":"I know without any doubt when I visit the Metairie location, the food will always be delic","useful":2,"cool":2},"N-W-qBHy_O4jl7BNHFxuQA":{"text":"Went for lunch yesterday and truly enjoyed my meal!  While the lunch menu items are fairly","useful":11,"cool":8},"3Y0KeiAvTc81HrFfId43ZA":{"text":"Gris-Gris Restaurant offers several dining options: the upstairs outdoor patio with a view","useful":0,"cool":0},"_2ldwNLe0FoDbly-rarDTg":{"text":"Delicious! Very cool space, atmosphere, and staff. Put it at the very top of your foodie l","useful":3,"cool":0},"YYEwovf6_u2RJ9-rFUifDQ":{"text":"We happened upon this place after walking around the Garden District. I am a food snob and","useful":0,"cool":0},"HST7s2N33rCjn0CqCm2d_g":{"text":"Absolutely amazing meal! The bartenders upstairs were so entertaining as we waited for our","useful":1,"cool":0},"OmL4ZhRJHblmnh_97Lquww":{"text":"A must! We made reservations to sit at the 'chef's bar' and was able to watch all the dish","useful":0,"cool":0},"6ZE8AA-Le0fk7W6Zrj-dVg":{"text":"Gris-Gris had an awesome looking menu but I was not impressed.  I will say, there were spa","useful":4,"cool":3},"ucyFefxgtQn7Lb2yTgJcAw":{"text":"Tasty food. Nice bar tender.  Attentive. \nReception was a inhospitable... pretty much a we","useful":0,"cool":0},"2iFx0DSCaKmILkg2vNWydw":{"text":"Chef Cook's food is amazing (Oyster and Caviar poboy gets 2 thumbs up!) and the location, ","useful":3,"cool":0},"7XrHUJYEhJ_mP4WEkXEg5A":{"text":"This was the first place I went to for New Orleans food and I was skeptical at first becau","useful":0,"cool":0},"bNkLxWSDR0yXZm_tgTL7zA":{"text":"I come here pretty frequently and the food is always good! The service is always super fri","useful":4,"cool":1},"AfONtrtENVuGVRYzBpEJ8g":{"text":"If you appreciate food in any way shape or form you must eat here. Sit at the chef's bar a","useful":0,"cool":0},"28SvKhcwQrWLCCSuVgmqqw":{"text":"Fantastic place! Food is awesome! Great service! We will definitely be going back. Next ti","useful":0,"cool":0},"-Ae8RSnaq4sM-oHMuOXVxg":{"text":"Went there for a drink & snack after a tour of the garden district.  Upper patio was lovel","useful":1,"cool":0},"5PIcDh3tdRN7P-Zclunm2g":{"text":"Cool patio. Service was slow but i guess that normal in NOLA. I ordered the chicken & dump","useful":0,"cool":0},"xstMn8y7IYLhvyMMj0MVew":{"text":"We had lunch here on Monday, September 9, and it truly was the most enjoyable meal we had ","useful":1,"cool":0},"QoE7N3JHqKTE0nHNpd3DMQ":{"text":"I don't even know where to start . I've had almost everything on the menu and I haven't fo","useful":1,"cool":1},"I55GaATbJWzzQKVOAlmwog":{"text":"The food was AH-maxing! We had the shrimp & grits, oyster caviar po boy, fried green tomat","useful":0,"cool":0},"M-YLAA9LjQ5ddeeXmasE6Q":{"text":"New Orleans dining meets Iron Chef! Gris-Gris surprised us with its' front row counter sea","useful":1,"cool":1},"1yOEvhjwGhXnbi4VQVId4w":{"text":"This was a great place we lucked in to in the lower garden district. The food, the service","useful":0,"cool":0},"f25yNvUZ5enAL4WEEd_DOA":{"text":"The service here is among the best I've had in New Orleans. The menu is full of tasty New ","useful":0,"cool":0},"lSQpDjN8wXHirymKGl1hZA":{"text":"We went for lunch and were seated right away. The complimentary red beans were delicious! ","useful":0,"cool":0},"5VUI0feBo5Q-J9ARItYgpQ":{"text":"Let me just say, Gris Gris is a total GEM! The menu, though small, is well thought out and","useful":0,"cool":0},"x7Mp88CnWzYQHtfQrgDcqw":{"text":"Super cute place.  Stopped in for a quick bite.  Really liked the open kitchen design wher","useful":1,"cool":0},"KwWlHkAmqWs5mcMQoA8eQQ":{"text":"Just arrived in NOLA after a long plane ride. Walked around lower garden district and stum","useful":2,"cool":0},"VD7GdmQxNa5riKTIo0i9GA":{"text":"I only wish that we'd eaten here our first night in New Orleans, so we could have eaten ev","useful":0,"cool":0},"wWB6-8EsHWYAh2vyRgawDQ":{"text":"Terrible service. The worst I've seen. It began raining (not their fault) and we were info","useful":1,"cool":0},"FT2zFwxH-WiVtSCuXVfPMA":{"text":"Chef Eric Cook knows what's up.  Eat the Pork chop.  It'll change they way you look at lif","useful":1,"cool":1},"k7HsPanNI8J-TivG7Gwl3w":{"text":"We enjoyed our entire experience.  The chef made a vegan option rice dish for one of our p","useful":1,"cool":2},"mdTm2y5OcoWukCUhfC7M6Q":{"text":"The best meal I had in NOLA!  Fried oysters tender and delicious and gumbo to die for!  A ","useful":1,"cool":0},"NqPgbVaA8oUwAHnOJTU-yw":{"text":"Food was delicious and cocktails were tasty. Cool place on magazine street. About the only","useful":0,"cool":0},"Wezz_AeV05Cqygg67hXZIQ":{"text":"My wife and I went on date here by recommendation. Everything was amazing, from service, a","useful":0,"cool":0},"FeUKti47OOgO3uqea1-mRQ":{"text":"This a great find in the Garden District of New Orleans.  Owner/Chef Eric Cook has a gem o","useful":0,"cool":0},"-XnY7Un8SRmlma9MCd5l3Q":{"text":"The food was good! The cooks behind the downstairs bar were friendly! However, our server ","useful":1,"cool":0},"gdB4i_I3XujDLn5Cb4OWZQ":{"text":"Back to magazine Street in NO!\nMy wife and I, daughter and son-in-law decided to try a dif","useful":1,"cool":1},"FWpgTFT_7_1G56D_GsQ4mQ":{"text":"Great appetizers. BLT is fried oysters, pork belly and tomatoes and was delicious! We also","useful":0,"cool":0},"WBg-Ldw32SNpqtH0UOteaA":{"text":"We had a wonderful family dinner here. The service was impeccable. They were able to accom","useful":2,"cool":1},"0hJmU54a5rv61m5V_NabIQ":{"text":"We came here during Labor Day weekend for a late lunch. We were promptly seated and greete","useful":1,"cool":0},"XnQFfQhX_mmWgC37LGCK7g":{"text":"Good service and food.  Stopped by for lunch and sat on the patio.  Enjoyed oyster poboy a","useful":0,"cool":0},"vVTEfqRx_RnfMRnZczoNdA":{"text":"This was a fabulous place on Magazine st and was a great experience. The place is a bit sm","useful":0,"cool":0},"z5YgCZ5AQRelOxWe3VhaSw":{"text":"Rain made me run into the first restaurant I could find, and we hit the jackpot. The servi","useful":0,"cool":0},"lZsjYzX-U4xzhBxybT1Rxg":{"text":"Visiting from out of town and, while driving thru the Garden District, Yelped places for a","useful":0,"cool":0},"MdQzcuIXKQGoMt2p5wZT3w":{"text":"Everything was spectacular. We had the City-famous Gumbo, the Ousters BLT, deviled eggs, a","useful":0,"cool":0},"Y-zWPz3so8fvefcA_gs81Q":{"text":"I am from CA and I'm used to cooking my own healthy food, eating very lightly, and it was ","useful":2,"cool":0},"4y9N4uB_4sevu6gonZWKQw":{"text":"As soon as we told Brian, the bartender on the second floor, that we were only getting dri","useful":1,"cool":0},"JWBFVIgtr3sWBAs-3FfnNg":{"text":"This place is so good! The burger is out of this world. The pork belly with watermelon is ","useful":1,"cool":0},"5iYlQi12b5mRvj31hcdvFw":{"text":"We walked in to taste one of the cities best gumbo's but the gumbo was chicken and gravy. ","useful":0,"cool":0},"ZcZrZ-7nqaekQ4H0NnhIQw":{"text":"Absolutely incredible!  A true highlight of our New Orleans trip.  Food and service were p","useful":0,"cool":0},"-gGkG75HyIIhpi3NByXh8A":{"text":"the food was amazing!!!!!  i order  shrimp and griits  and is one of the best food i have ","useful":0,"cool":0},"hW1kwaBUhc-JoGdda3sD9w":{"text":"Had an incredible dinner here last night! Can't wait to go back and try the rest of the me","useful":3,"cool":0},"NxZjDT5lE3w9zUMhTjX08g":{"text":"This place was great, especially for being so new.  Friendly staff and chef.  The food was","useful":2,"cool":0},"61f8Y7Uo8NVOO8CFKH-Xzg":{"text":"Think its my last time patronizing Gris Gris- I've been there a few times for lunch. The f","useful":0,"cool":0},"ZoabXHtkZUI4RlWAmE9vLA":{"text":"The food is well prepared and very succulent. We had the shrimp the grits. The shrimp comp","useful":0,"cool":0},"q81X1EHND8AH7wA1Adfpfw":{"text":"Y'all! This food was amazing!! The vibe is chill. I love the open kitchen. The staff is ve","useful":0,"cool":0},"Pv0qbJpJXpboBnVRHNYMvg":{"text":"After a two hour flight delay into New Orleans, this was a wonderful introduction to the c","useful":0,"cool":0},"NNXuaFdvyxj6jdUjMvuSTA":{"text":"This place was okay. We only tried two dishes here, the gumbo and the shrimp and grits. Th","useful":0,"cool":0},"MdK_rW_iX2LgF3t8SFpojw":{"text":"wonderful bistro on magazine. fantastic staff. great cajun food options with a modern twis","useful":0,"cool":0},"DzwNFN8keqwfh4_sYnhrgQ":{"text":"Went for lunch, and it was delicious! Classic New Orleans cuisine, but with a twist. The c","useful":0,"cool":0},"BBPy9Zv3_eq6Xo1Mq09EMQ":{"text":"Shrimp and grits was on point. Great atmosphere too.  Friends had whole cooked Red Fish an","useful":1,"cool":0},"OZ3nQ8AcqqrAiQxJkzjD7w":{"text":"Stopped by for lunch during restaurant week and was able to knock G off my NOLA A-Z restau","useful":5,"cool":1},"QLRUjFFjIf_bxg4p9YHs1g":{"text":"I met a friend there for dinner and we both absolutely loved the food and the atmosphere. ","useful":0,"cool":0},"6W4jwqgMdz1-TCsYCm6J7A":{"text":"Outdoor seating upstairs is great. Also have sat at the downstairs bar and enjoyed he expe","useful":0,"cool":0},"UgEU-zbuvO53i59gb8i-8g":{"text":"Amazing! Authentic nola cuisine! I had shrimp and grits and it was DELICIOUS! The only qua","useful":0,"cool":0},"oaapNQ42L9nvMMn4onnOXg":{"text":"The highlight of our visit to NOLA!!  We went on a Thursday night and were lucky enough to","useful":0,"cool":0},"-5fqP77ADP82MSnkEf_IYA":{"text":"Absolutely phenomenal food and atmosphere. We came in for a late dinner at 9pm and were ac","useful":1,"cool":1},"vCJLXSe1lgzhzA7ryYgFog":{"text":"This restaurant with both a dining room and a counter that  allows you to watch the chef p","useful":0,"cool":0},"yR7nPex-XNWMHv4QnLVe2w":{"text":"WOW! There is a lot of great place to eat in Nee Orleans. This is my new favorite. Start b","useful":0,"cool":0},"CnzhtxFwhYRamC7vaVte_w":{"text":"On my most recent trip to NOLA, I took a cemetery tour guide with a cool guy named Loki (l","useful":2,"cool":0},"Qd4CsigGe20TTFILmtX6cA":{"text":"The miss and I went out this evening and we purchased:\nMojito ( really really not good at ","useful":1,"cool":0},"YAdytBoUog8MhgF8M-IHAg":{"text":"This place is amazing! If you're strolling around the area, definitely pop in. The food wa","useful":0,"cool":0},"1nbQDcnQ7ZlyexfuQaX6fw":{"text":"We had a wonderful NYE dinner!  Appetizers are the best! We shared small plates of the oys","useful":0,"cool":0},"VcsNycdXb-XmzkxrmFe6Yg":{"text":"Went with a group of friends and had the ridiculously stylish private room (with access to","useful":2,"cool":0},"juxmXMfpmlCzO9pIBVSapg":{"text":"This place seems nice enough. Nice menu...atmosphere and Waite staff were 5 star!! The foo","useful":2,"cool":0},"V7QoI0q25q1bq4KLMk6UIg":{"text":"I don't understand some of the reviews on here. This place was fantastic! Gumbo was some o","useful":1,"cool":0},"fP5d7tDAvsvV7PTjbTvh3w":{"text":"Wow wow wow!  Food is delicious!!!  Definitely a place to stop and visit if you're from ou","useful":2,"cool":0},"mXGLYPtzTwP15dTnHEH97g":{"text":"This is a very good restaurant. We sat at the chefs table and it was nice interacting with","useful":1,"cool":0},"L3NRdGYGxapZSnBqiV_EyQ":{"text":"The reason I love New Orleans is because the people are SO amazing. Unfortunately tonight ","useful":1,"cool":0},"F-oy3wZ9Od7mND9Z8lKfTg":{"text":"Wow!! That's really all I want to say, but I'll elaborate. I was in New Orleans on a work ","useful":3,"cool":2},"BMR4JgUxFdhASDCtr9YfJQ":{"text":"The chicken and andouille gumbo was very good. Just wish there was crawfish in it especial","useful":1,"cool":0},"2ptQb9whs-2ozN4flQzDuw":{"text":"Too much to say about Chef, Eric Cook, and his team at Gri-Gris. They have an incredible m","useful":1,"cool":1},"uY58wAtevwFFVvdPqxhkuA":{"text":"This place is fantastic.  The food was delicious. The service was absolutely perfect.  Our","useful":0,"cool":0},"CFViMzrsP_N3_dILC9OyCw":{"text":"Dined on Saturday 10/20. Called and made a reservation, told us we would be sitting at the","useful":2,"cool":0},"bk3-WK0pumfwrzVZvwRYTQ":{"text":"I love this place. I was only in town for one week and wanted to hit a lot of different sp","useful":0,"cool":0},"LQFfYnNWkUJ_4bV6TbC1Vg":{"text":"Restaurante com cozinha aberta em uma  esquina do Garden District, nessa rua tem varios co","useful":0,"cool":0},"lZFpAh01SXIg-ajKo2q5pQ":{"text":"Excellent food, service, and atmosphere! We had the shrimp and fried green tomatoes, the 1","useful":1,"cool":0},"fERf-r9iOczOcqOrOkN5Rg":{"text":"Treat yourself to this amazing hidden gem. I had the shrimp and gris gris grits with a lov","useful":0,"cool":0},"XXWrmkDwC6yUgWlHrAjZ1w":{"text":"Popped in after visiting the WWII museum (highly recommend). Short walk. I sat at the chef","useful":0,"cool":0},"P2ctR-W0VhUK-DiwCdVRzg":{"text":"I had been dying to go to Gris-Gris, based on all the wonderful things I had heard about i","useful":2,"cool":0},"AUpZyNvrtgWYEG4zppVyMw":{"text":"What a wonderful little spot! My daughter and I had roast beef poboy and oyster poboy for ","useful":0,"cool":0},"m_yAmdGi-dWw-xAWpXPuvA":{"text":"Recommended to me by a local friend and WOW!! What a gem. This place is amazing. Amazing f","useful":0,"cool":0},"d4rI54A2LebVAe__VZAnSw":{"text":"My compliments to Chef Eric Cook! Amazing food great service! Thanks Abbi! Highly recommen","useful":0,"cool":0},"SOsCa_-7guDVrTTFBMQ05w":{"text":"This one is tough to review for a few reasons:\n\n- it's really a great establishment, well ","useful":2,"cool":0},"T7qdcKJzcZxBKlxcf0ekgA":{"text":"I've been to Gris Gris three times and wanted to give this place a fair shot. I've sat ins","useful":2,"cool":0},"ZFGcJw2NsuKLM3YaposYug":{"text":"I took a walking tour of the Garden District and my tour guide (an 8th generation New Orle","useful":0,"cool":0},"YahqHvSqtoOZ38cH7OJsIQ":{"text":"What a night!\n\nWe had a team dinner for 16 in Gris Gris' large second floor room last nigh","useful":0,"cool":0},"NvFZ7XuLvTbEGKQMtVqOew":{"text":"New and hot does not equal OMG what a treat!! Tried almost everything. Will take another  ","useful":1,"cool":0},"8tFthO1dOzEB9r12e3sVFg":{"text":"For our last dinner here in NOLA, we've decided to check out one of the local spots near o","useful":0,"cool":0},"GlodySdktZK0N5AAGyp0-w":{"text":"I cannot say enough great things about last nights experience.  We had a birthday dinner i","useful":0,"cool":0},"AYAC0jwiqnWugaOxQJFb-Q":{"text":"I've heard of Gris-Gris for awhile and I finally took the opportunity to try it out when I","useful":1,"cool":1},"CUDct9uPZ8S5_Q5c4juUBA":{"text":"Top notch establishment. Service was fast, and friendly. The atmosphere was very relaxed, ","useful":0,"cool":0},"z4rxof1Emdi2N-1VfmKY6w":{"text":"Excellent service!\nExcellent food!\n\nWill make a point of going back when in NOLA again!","useful":0,"cool":0},"CdgXa7wdMAdAWAioGx69kQ":{"text":"Delicious!! This is definitely one my new favs here in Nola, me and friend popped in for h","useful":0,"cool":0},"NhTsjA1sWT0p_SdUAOgOKQ":{"text":"This place is fabulous.  I highly recommend you try it.  Sitting at the kitchen bar and wa","useful":0,"cool":0},"UWuTWdzNZXQyysNzcweXvQ":{"text":"The hubs and I stopped in for lunch and was so glad we did. Service and food were excellen","useful":0,"cool":0},"NYXaJFFEwiKRF0b3-wVD_A":{"text":"We were given complimentary bowls of gumbo that was delicious! The cocktail I had was amaz","useful":0,"cool":0},"YW1cOxti_cgCHjZ799tlpw":{"text":"We had my bday dinner here on 10/10, which was a redemption meal for the awful bday dinner","useful":0,"cool":0},"QJjTcFTs3-oVA71cfaAQuQ":{"text":"We came here as a family to celebrate a birthday.  I would not recommend coming here with ","useful":1,"cool":0},"TPa1qDUXWof98eAi3ZTU2w":{"text":"Went back again! The roast beef poboy is sooo good, and the fries were perfect. Can't wait","useful":2,"cool":0},"6a93NQfQfI6ehECYRwRsng":{"text":"Real good.  Unfortunately they had a heavy hand with the salt.  It was at the upper end fo","useful":0,"cool":0},"B7pmS33NG5kk8B7wfzgaaw":{"text":"Took my boyfriend here for a bday brunch and we LOVED every bite! We started with the Oyst","useful":1,"cool":1},"U8iYzrQU9vE68SSfDj_UMw":{"text":"Delicious Southern cuisine in the heart of the Garden District. The red beans and rice wer","useful":0,"cool":0},"hL0Uj8e1Dmkb-6JJdSCAmA":{"text":"I don't think I've ever used the phrase \"stupid good\" to describe, well, anything, but tha","useful":0,"cool":0},"1fe05UHUKxko1xOoeHrD7g":{"text":"I really wanted to like this place. Cute atmosphere and in my old neighborhood. Maybe I mi","useful":1,"cool":1},"6bpp7hOhCzqQKx0hCXzJGA":{"text":"First time here and will definitely be back.  Portions are generous (oyster po boy). Reall","useful":1,"cool":0},"62wXSMsMNzNcdn_x1WviWw":{"text":"Seldom do you get to really enjoy a dining experience vs just having another meal. Owner/c","useful":0,"cool":0},"1aiIXntF-jc8hH09rzJUHQ":{"text":"Amazing fried oyster po boy and chicken with dumplings.  The flavors were amazing. And the","useful":0,"cool":0},"ygJmeH5iZpnLtTe1acXeUg":{"text":"My husband and I went to Gris Gris for a last minute dinner.  Everything was well done!  T","useful":0,"cool":0},"Y4gE32ghrFnNur8ceMHAKg":{"text":"We took a group of 10 to Gris Gris on Friday October 25, we had reserved the chef's/kitche","useful":0,"cool":0},"RNx_IaCKzGjcPy3UMRu1Tg":{"text":"It is a busy restaurant. We called first to make a reservation but no answer. We left mass","useful":0,"cool":0},"u4yaebtgCAi4e83wsJAINw":{"text":"Oyster salad and po boy were great!\nGizzards didn't work for us... Mushy without flavor - ","useful":0,"cool":0},"OKTwa2acJ7GjXrI2bT1mFA":{"text":"Good happy hour, juicy fish, tasty chicken and dumplings, a funky bathroom and a great roo","useful":0,"cool":0},"K5m6vmRFMFXDFQPem48CFg":{"text":"The food here is incredible. We just had brunch for the first time and it was fabulous. I ","useful":0,"cool":0},"yPyaEh_15KyHR0SyOLeXGg":{"text":"I am not sure why there are so many 5-star reviews. The food was ok. The service was solid","useful":0,"cool":0},"5jdPGIQ6UNOk0HKef2VXJQ":{"text":"Great food. Great service. The blt appetizer was so yummy! Everything looked good! You can","useful":0,"cool":0},"k5w56ZEECOuSoVQvi7p_aQ":{"text":"Great food and great atmosphere.  My wife and I ordered the BBQ Pork Chop and the Rib Eye.","useful":0,"cool":0},"YsGS1KtZsaV__uF2OoLmSA":{"text":"This place had been on my list of new places to try since it first opened. Many of my frie","useful":1,"cool":0},"eB0qa4Ctr2nL4OEDVI1etw":{"text":"Currently dining here for the first time as the exterior captured us to walk in and grab a","useful":1,"cool":0},"0X8LBvxCyjbVSarFYGwq2A":{"text":"The pork chop and steak were amazing. However, the absolute best part of my dinner here wa","useful":1,"cool":0},"nJ-crDMoLldKEE3tqh5Yww":{"text":"This is what New Orleans has needed in a new restaurant that it hasn't seen in a while-goo","useful":1,"cool":0},"p_JohjNxsLWyPhVKBleigw":{"text":"We stopped in for a late dinner/snack as not much else was open or serving food just befor","useful":0,"cool":1},"2v6pG43J4Apa6B2CgTOmzA":{"text":"Had 7:30 p reservations on 11/23. Our server was great (thanks, Adrian!!) BUT our experien","useful":1,"cool":0},"vWVlKCxeTMm8_LNdloEtsA":{"text":"Food was phenomenal. Service was also exceptional. In a slightly odd turn of events, while","useful":0,"cool":1},"NwOTc0WtvljlQXf5ChTN1w":{"text":"I had lunch at Gris Gris today. This was my first visit to the restaurant. Because of my s","useful":0,"cool":0},"_NaB9NKgRrYtKGWFCLUBNA":{"text":"Good drinks. Food was decent but not out of this world (as we tend to get here in NOLA). E","useful":0,"cool":0},"wkhYKnLLLiLn7pfkeJtKjA":{"text":"Love this restaurant. The first time I tried it for dinner was on a Monday and what do we ","useful":1,"cool":0},"YcPtJc1Y6LHsxxS3LZPr3A":{"text":"I had the crab cakes and let me say.....the absolute best!!!   Thank you to the great wait","useful":0,"cool":0},"F_q8_sD3jhzP5x7jxUpxMQ":{"text":"Great little spot with character. We were seated upstairs and had the opportunity to sit a","useful":0,"cool":0},"f7EFFQnGth7iwE1NQjB0Cg":{"text":"When traveling, I always try to find some of the \"hot\" restaurants and Gris Gris was at th","useful":1,"cool":0},"LBLjQx7qMFtYyb0_JErqoQ":{"text":"Service was great! We loved the dishes we ordered! The fish was fresh and apps were flavor","useful":0,"cool":0},"3eNGSviMsucNK-ca_9UFmQ":{"text":"Soooooo, I know they are new...but they've got a few kinks to work out. Caesar salad was i","useful":4,"cool":0},"qV5qGkcY_eA5qjrdlkGoKw":{"text":"I got the gumbo and fried green tomatoes. WOWZA! The gumbo sure was number 1! It was the p","useful":0,"cool":1},"M1QTZQtfI7QALPBzdYZJzg":{"text":"We were on the waitlist and were seated quickly. We sat on the upstairs balcony and it was","useful":0,"cool":0},"-PtnUlVL7cZPd3PiiPvM2g":{"text":"The gumbo here is out-of-this world. You could go for it alone, and stay for the atmospher","useful":1,"cool":1},"2h03VbiSSN3jc0CiH4Nt8A":{"text":"Wow!  Just wow!!  The food is amazing.  We went here for brunch on Sunday and I am glad we","useful":1,"cool":0},"5QyalQc3nctVnZJeaqr06Q":{"text":"We came here with friends whom had came this week. We're visiting from Northern California","useful":1,"cool":0},"3D0PswYeMNu7cvD1A0lp_A":{"text":"Was very excited to try Gris Gris. Went one night with a few friends and ordered fish with","useful":1,"cool":0},"d93K3nOWHSVdlkNRAu2k9Q":{"text":"Going out can be a bit of dilemma for me. The food has to be better than anything dish I c","useful":1,"cool":0},"Id1sD1X5n8zZ6uwf1c3iBw":{"text":"A wonderful local restaurant.  The Chef owner Eric and his wife were super friendly.  The ","useful":0,"cool":0},"ig7MLdPXWE_R0PCTu4k7dw":{"text":"Wow... this place! Amazing flavors, good service, swanky spot, and so delicious! We ordere","useful":1,"cool":0},"hKQvw47s30XbsQ_CLbTspA":{"text":"GrisGris came highly recommended, and I was really looking forward to it, but it fell far ","useful":0,"cool":0},"eiwOipx45KOZrEliL-CePg":{"text":"First, I will say that the overall service was attentive and good.  When we arrived on tim","useful":0,"cool":0},"Qk-VbsKI55aRgCLQfujuAg":{"text":"Love this neighborhood place!  We shared some fantastic gumbo and an oyster po boy sandwic","useful":1,"cool":1},"5f7u5swIbfKrSGMDglCMAg":{"text":"A gem. We were promptly seated at the chefs counter, and given food and drink menus. The s","useful":2,"cool":1},"sPNIr0XFHJQXDVTk6DlLMg":{"text":"Came here for lunch today.  The menu is small.  The seating arrangement is awkward.  The c","useful":6,"cool":3},"JHisnTXRMkN3K-Rcmnpbfw":{"text":"One of New Orleans Finest!! Causual and inviting with a great downstairs bar and sitting u","useful":0,"cool":0},"ClHW69RHWaDiMvNwoQrD8w":{"text":"First experience was AMAZING! Real quick review... gumbo is a must have! Can't say enough ","useful":0,"cool":0},"n5tHIKkJcBNplO_c_zgYZg":{"text":"Walking to the end of Magazine street and thought we would drop in for a quick snack. Sat ","useful":1,"cool":0},"z-Z6i9_whn9kklmXsY_dCA":{"text":"First night in NOLA and decided to try this restaurant. First tip, sit downstairs where yo","useful":0,"cool":0},"XGV0hTS520DJ8HCguUpgTg":{"text":"Hands-down one of the most amazing restaurants in New Orleans. I've been coming to New Orl","useful":0,"cool":0},"hJxL8ZIbKUOpkirV2547iQ":{"text":"Two words: happy. hour. Gris-Gris def has one of the best in the city in addition to their","useful":3,"cool":1},"V2YcrILlX1By8Cesxj5a8g":{"text":"I enjoyed the coolinary menu. The waitress was really sweet, friendly and informative. Gre","useful":1,"cool":0},"mGAIdQs9tcceiV3JhR-trA":{"text":"Our fantastic city of culinary creations abundant in pleasure for our taste buds seems to ","useful":10,"cool":4},"PdEN9Jgn5p_d7YKbbgF_9Q":{"text":"I have walked past this restaurant multiple times but never stopped by but always planned ","useful":1,"cool":0},"Vfq-lu-3gCQvJ6QN-IwuKw":{"text":"We reserved a table for June 23rd at 6 pm on our last day on vacation only to drive over a","useful":0,"cool":0},"n64uUzhtq47LhUhzsywx7w":{"text":"Came back to NOLA for a visit after living here for 4 years, before Gris-Gris was around. ","useful":0,"cool":0},"_r1gABAO2bjdZMBcVHROoA":{"text":"Let's start with what Gris-gris does best: Gumbo.  I ate a lot of gumbo on my trip to New ","useful":0,"cool":0},"jYsTPp7PKnCpk2UhtBCAdA":{"text":"I visited Gris-Gris yesterday (Labor Day) and I had an incredible experience. We ordered t","useful":1,"cool":0},"1wPIC8hs0b6k3c4Wu0FBBQ":{"text":"Well after reading all the accolades, we made a reservation weeks before traveling to NOLA","useful":0,"cool":0},"RkH7syZOhVIIGnt8aXLf6A":{"text":"I have never been treated more poorly at a restaurant. An hour prior to our reservation we","useful":3,"cool":0},"koI6VXUEgvnegzc089QGLA":{"text":"This place was great! We sat on the balcony which was really nice and cozy since they have","useful":0,"cool":0},"zZltwCj92-nVRP4soqnU0g":{"text":"Full disclosure, the chef is an acquaintance. But that said, if you were friends with Mich","useful":0,"cool":0},"-aVAtD91JVF-JH8QJL5sXA":{"text":"Had the gizzard grillades and it hits all the texture of home and the flavors I expected o","useful":0,"cool":0},"3WNT7zu9wbjJjDlJ0n_fFQ":{"text":"YUM YUM YUM!!! Everything on the menu is delicious and authentic! Order anything and it wo","useful":0,"cool":0},"IILgXsTjjxYjpHK4mON_eQ":{"text":"We called about 30 minutes prior to get a reservation and the woman on the phone was able ","useful":0,"cool":0},"_uFQ9FxffLnu4U4uIsRJQA":{"text":"My husband and I are in town celebrating my birthday and read some great reviews about Gri","useful":0,"cool":0},"fdDs-1kuM9gIB3mcRaQ-jw":{"text":"Avoid the Sous Vide Chicken Gizzards at all costs.","useful":1,"cool":0},"fL4XJrU-0fvyIOiuDZaWPA":{"text":"I have actually been raving about the meal we ate here to anyone who will listen. We all e","useful":1,"cool":0},"9PB-z53kTiFjDoczBf6-PA":{"text":"We were able to sneak one last meal in before the city was shut down and it did not disapp","useful":3,"cool":2},"xKg6xtBPqlHTd9P2f1UiJQ":{"text":"The food and service was fantastic!!!\nWe tried the shrimp and fried green tomatoes and the","useful":0,"cool":0},"3fvO4n0tnm3tg6jf6qQ19w":{"text":"This place is a MUST ! So if you don't have a reservation go upstairs and eat and drink at","useful":0,"cool":0},"LWpyB7IcJ-7XgpHKzI4BQw":{"text":"Service was great. The waitress was attentive without being overwhelming. I got swordfish ","useful":0,"cool":0},"ZLuYCBgAxurgj90iS2sR-A":{"text":"OUTSTANDING!!! Had a res for lunch on Wednesday, July 7th after seeing the Chef / Owner on","useful":0,"cool":0},"TpODRKAxJWGDtY2etyAUDg":{"text":"Excellent food, comfortable venue, pleasant staff.  Have eaten Sunday brunch and other mea","useful":0,"cool":0},"gaR5306FEKTdmFoYlZBvzg":{"text":"Not doing much dining these days due to covid but GrisGris has a great outdoor setup that ","useful":4,"cool":1},"1-LCrOpcSIVfmxajgl8lkA":{"text":"This is interesting place on Magazine street.\n\nThe food is good, the menu like the place i","useful":0,"cool":0},"lHx9DZtxnsm_At07aoGu0Q":{"text":"Went back again here tonight for a work dinner with customers. Just wanted to update my re","useful":2,"cool":0},"bsmysBDmrIM4Cu4Yrvd44g":{"text":"Phenomenal. Phenomenal food, phenomenal atmosphere, phenomenal all around. With every dish","useful":0,"cool":0},"ZKVduKfvfzROqo7XCfGQ2g":{"text":"Amazing food, drinks, atmosphere, and service. We were treated like local friends, even as","useful":0,"cool":0},"JqJt2zzLJWXnl6J7TjmeTA":{"text":"What a charming - and clean - place to dine and drink alfresco along Magazine Street. We s","useful":9,"cool":7},"fi8BKfGMcvHrPUmeroWkjw":{"text":"I have been thinking about Gris Gris chicken & dumplings for months. The last time I visit","useful":1,"cool":2},"xBxK2D2VT61WzgX4-iOIXw":{"text":"The cup of gumbo was the best food we ordered the whole week we were in New Orleans . The ","useful":0,"cool":0},"Hfepn7J1yHaGoR0JAmu8kQ":{"text":"I went there with two friends. We ordered 2 appetizers: oyster blt (wonderful!) and Shrimp","useful":0,"cool":0},"1a2C1a-vHTmArmovimNiBA":{"text":"Great atmosphere, enjoyed the whole fried fish on the balcony as a wedding parade passed b","useful":0,"cool":0},"wMF-rNGovcblYhcJXpT_LQ":{"text":"From sitting outside to trying different items on the menu, all made for an awesome experi","useful":0,"cool":0},"7nG4smxvy7GFGYsE0edLBw":{"text":"After all of the hype, I was so excited to try Gris Gris. My family gave me a gift card fo","useful":0,"cool":0},"KDIoe1SVClhzKQJsOKTK-g":{"text":"STRONGLY recommend that you go dine at Gris Gris!!  Visited last evening and the Whole Exp","useful":1,"cool":0},"d7iDyWuHjBiRfVM2ifqKzQ":{"text":"Still sitting here and giving this review, that's how amazing it was! Came for a friend's ","useful":0,"cool":0},"4AibV9ImpsB2A2Uoj9MKFA":{"text":"AMAZING! This two story establishment delivered from beginning to end. I couldn't be more ","useful":4,"cool":4},"WzDz9CsFToC7m60f9a4Xlw":{"text":"I'm having a very hard time understanding why Gris-Gris currently has 4.5 stars.\n\nWe order","useful":4,"cool":0},"T1DOzPUc1z11xjeYpO6yHg":{"text":"Loved this. We sat down stair at the bar and got to watch all the action in the kitchen.","useful":0,"cool":0},"g8c8S0_ozTZLaBVA1dWDUg":{"text":"Wow!  Our first visit since they've reopened in the current COVID situation...Chef Eric an","useful":0,"cool":0},"3-QDB75FNW7itkRjIfvCdg":{"text":"I recently discovered this spot and now it's one of my local favorites.  My girlfriends an","useful":0,"cool":0},"Ov3Yl27Y60C-TA3XP0yrYg":{"text":"Excellent. Service was perfectly timed and attentive. Chef was accessible and personable. ","useful":0,"cool":0},"xsn6KyCvxd23q6bFik5XqQ":{"text":"A group of friends and I came here for dinner for my bachelorette party. The food was good","useful":0,"cool":0},"zV1juHE-MO-jIDqiNsfQ0Q":{"text":"Giving it a three because my husband's meal was really good. Mine was not worth eating. \n\n","useful":1,"cool":0},"Tt8loOPhVLzK6FhdpKylpg":{"text":"Popped in for some gumbo and a cocktail at the chefs table before a saints game. It was gr","useful":0,"cool":0},"CzoegZHXrceKfCilUfQcVw":{"text":"Sat outside on the balcony nice street view. Happy hour chicken wings were huge $1 each. G","useful":0,"cool":0},"_sRb6N_MB2Y2kUF3C1QDwQ":{"text":"I would have loved to give this a 5 star rating - had looked forward to it. Arrived right ","useful":0,"cool":0},"dsA5-HtYDZYoNMJCbYKDDg":{"text":"Started our anniversary eating here for lunch and they hit it out of the park. Tori was ou","useful":2,"cool":1},"x5llCSkmUID-3ASbOI2n5g":{"text":"I so wanted to love this place but sadly, the Caesar salad I ordered was sub-par.  The dre","useful":1,"cool":0},"f3IW1J-ZIYXMjJn9eW8Fpg":{"text":"Disappointed. We had reservations but arrived and they could only seat us outside. It was ","useful":0,"cool":0},"UZwPslnjc8sataWDsKuo2A":{"text":"By far the best restaurant dish we have had in our 7 day stay in New Orleans.  The Gris-Gr","useful":1,"cool":0},"mbS16fP9X539pX2iGTOjzQ":{"text":"I've always heard about this place but never got the chance to go, my sister came in town ","useful":0,"cool":0},"dB-Dm2hfHnym9cuWe3S8Ng":{"text":"Fantastic place review to come \nThe pork chop was perfectly cooked the gumbo was awesome","useful":4,"cool":3},"kb5tnaB0a7H45HHB4qJh4g":{"text":"The staff that \"greeted\" us at the hostess stand were not friendly at all, the guy with th","useful":0,"cool":0},"Hmyi29ITLlA725-XF2t5GQ":{"text":"My first time taking part in coolinary and it was really nice. Enjoyed the atmosphere, the","useful":1,"cool":1},"nWZZGsnTUz7mVB34TmfIoQ":{"text":"Overall, the food here was awesome - this was the first restaurant we stopped at as part o","useful":1,"cool":0},"IFahHmXDcPoUA6-JckAqGw":{"text":"This place is a gem. The food is great. And in my opinion, it's the best gumbo in the city","useful":0,"cool":0},"BO0nd0yTutk22RY21ESOGg":{"text":"Went here for my birthday. My girlfriends and I came here around 5:30pm. The hostess welco","useful":7,"cool":6},"1bDN3JT6p768cD3S0DHY-Q":{"text":"Yum yum yum yum yum \nYou can't go wrong. Unless you don't eat here. So just do it, delicio","useful":0,"cool":0},"UALLv1GFH5CcQN0mWUCaDg":{"text":"A relatively new and outstanding restaurant.  Owner and Chef Eric Cook has always been a g","useful":1,"cool":1},"UYpuV9jt_4bAMHXcMTrVmA":{"text":"I couldn't have asked for a better meal while visiting New Orleans! The food was amazing a","useful":0,"cool":0},"PvSkHmU_UrZe1lEZJgXSyw":{"text":"Amazing find.  They know what they do and do it right.  Had the shrimp Gris Gris grits.  I","useful":0,"cool":0},"MFxEfF3e0KtoRLoB6c7c-A":{"text":"Let's start at the beginning. The service was welcoming and pleasant. I started with the C","useful":0,"cool":0},"UfA9P5NrDrz78KWFO8c49g":{"text":"4/5 well-seasoned!\n\ni've eaten here a couple of times and across the dishes i've tried, i ","useful":6,"cool":5},"4d6TBIAsvLh5IFO3H3AKyA":{"text":"Had high hopes for this restaurant. Saw great reviews after its first opening but sadly to","useful":2,"cool":0},"f9Lhi4J6vDY4FjwURrbEyw":{"text":"Wonderful experience sat at the counter in front of the kitchen talk with the owner/chef. ","useful":0,"cool":0},"YYBRcmBASn2YSeiRLmR3Fg":{"text":"Had a memorable dinner there last night!  That's saying a lot in New Orleans!  Got there e","useful":0,"cool":0},"rJlP54-tsNJSi7wQx32lEQ":{"text":"This is a nice place to sit and enjoy the sights/sounds on magazine street. Located on a b","useful":0,"cool":0},"ILHvYSpdvTUl9v2vpuAg_Q":{"text":"Oh my! This place is great. We had the shrimp and fried green tomatoes to start and the fl","useful":1,"cool":0},"a6-om2dzOcsG8lebc_BITA":{"text":"Wonderful food , service, and atmosphere!\nThe family began with the delicious oyster appet","useful":1,"cool":0},"8jVwFWV5KsElWunD4EGpmQ":{"text":"Delicious delicious shrimp and grits. Like. YES. Also sitting on the balcony is divine. An","useful":1,"cool":0},"TCFOH9trBqLmhnXjNuhYOg":{"text":"On my way to the convention center and about to fall victim to the \"food is in front of me","useful":2,"cool":1},"MDIzzF72XDE3O4EWW73SdA":{"text":"Almost perfect. So many great NOLA restaurants and this is one of the best but a few dishe","useful":0,"cool":0},"XdZRzW5cmPCD-UiCsvAi-g":{"text":"Gris-Gris gets 5 stars because this was my favorite shrimp & grits dish of the weekend! Fo","useful":2,"cool":2},"KpgZvf0CPNPsuNszOr-tJA":{"text":"My husband chose this spot for my birthday dinner on. October 9th. I was not disappointed ","useful":1,"cool":0},"sHX-kIPg0jbL38ldStRJ7g":{"text":"I have waiting to try this place since it opened. I love the setup of the restaurant. Ther","useful":5,"cool":3},"MiPf8Bx2EDH4NsNWfAi-lA":{"text":"What a Gem if a find! Local chef to many others opens his own place ! Eric you have captur","useful":0,"cool":0},"KNjmNe4hm8azKwLNbZrgKQ":{"text":"Wanted to try authentic NOLA food and eat something out of my comfort zone. The Fish was A","useful":0,"cool":0},"UmXwpziIkxiO0IQPhuRviA":{"text":"I came here for happy hour one day and we got to sit upstairs on the balcony. I love balco","useful":9,"cool":6},"Rwh1vvvj9V2csQcNUDsKHg":{"text":"Perhaps the ugliest restaurant in New Orleans.  Waiter called me \"boss\" or \"chief\" every t","useful":5,"cool":2},"hVJlePFhq8nG3etbiAFOrA":{"text":"This was a really nice place to go on a Saturday night, with so much outdoor seating inclu","useful":1,"cool":0},"qhjArIAprbjVrnMRTB3o4g":{"text":"After looking forward to a dinner at Gris Gris during Jazz Fest with out-of-town foodie fr","useful":2,"cool":0},"n92vBfPf3ngLNb_42-cAsg":{"text":"I'm not sure the experience isn't a large part of the story....\nCalled around 6:45 (took 2","useful":0,"cool":0},"cOWPixlI9nLwxXEFqHSAsw":{"text":"Fantastic. If you can get a reservation, it's well worth the effort. And surprisingly good","useful":0,"cool":1},"rG1sHpHVKDG9UFo64wA6IA":{"text":"My friend and I went for lunch one day.  The building and ambiance is nice and we sat in t","useful":0,"cool":0},"fn1ridi2uLrPr2nn44vTWg":{"text":"We came in for a quick late lunch and were lucky enough to sit downstairs at the chef's ta","useful":2,"cool":1},"JxcQ5TSIaCynzXJlU6FCDA":{"text":"Do you want amazing food, chef tables and tasted beverages in the beautiful garden distric","useful":3,"cool":2},"BT-ISsnsKbKSusJIaOBSww":{"text":"Gris-Gris has the ju-ju!  I ate there twice during a recent visit to NOLA.\nThe service was","useful":0,"cool":0},"ODswfWpNbsLgRubRLduugA":{"text":"Gris Gris is a go to for delicious food & balcony seating. Highly recommend their oyster s","useful":2,"cool":0},"hyPWAjMXB3qkuP-_t8sy3w":{"text":"I really labored between a 4 and 5 on this one. \n\nWe were a group of 9 all seated at the c","useful":2,"cool":1},"2_S4vmJ-pkKWyQDfBmch0w":{"text":"Nice place, but I find it overpriced and the chop was overdone.  Will go back because I li","useful":0,"cool":0},"pnjvN5pBqIk-GqnZQFHu0Q":{"text":"Delicious new restaurant in the Lower Garden District neighborhood.\n\nWe came here on a Sun","useful":2,"cool":3},"2dS2hUCsNgOQSZJtRTMTyw":{"text":"With our anniversary approaching, my husband was overly excited to sell me on going to the","useful":1,"cool":0},"l0i46Sg99Ymw-MOVcOguUA":{"text":"Best place we ate in our week visiting the city. The menu has the best of New Orleans feat","useful":0,"cool":0},"qi6WPAW4t6xkPPax70bZug":{"text":"Favorite spot from our last visit in NOLA. Sat at the chef's table and definitely recommen","useful":0,"cool":0},"6SHTkWIQOLqb70JVsjBRdA":{"text":"I would like to give less....I am in New Orleans on vacation and decided to give Gris Gris","useful":1,"cool":0},"NTYuA9psQ9y212EQGFd4Eg":{"text":"Cornell... Iva... Mallory... icing on the cake!\nWonderful, immaculate service, perfect pou","useful":3,"cool":0},"60eGn9_ywiiO-SY_ZItycg":{"text":"This was my first visit. Now, I'm sure I'll have to make Gris-Gris my go to spot for a cut","useful":4,"cool":3},"Qlm8FbOgv81S0TZWYneGpg":{"text":"Good burgers and cool atmosphere. Showed up on a Friday night around 7:30 without a reserv","useful":0,"cool":0},"A7kepmQdtEf4HPrewctyAA":{"text":"Delicious food, excellent service, and surprisingly affordable prices! Don't miss this pla","useful":0,"cool":0},"UzXkP5SWbaqPmitQ8BtOiQ":{"text":"Loved this place. The oyster poboy and pie were phenomenal and the swordfish was some of t","useful":0,"cool":0},"gC5POGmVaDnVGBWcQ-h2Mg":{"text":"Love their outdoor seating area upstairs overlooking the street. \n\nTheir food and service ","useful":5,"cool":2},"WDQBDv8ykr6LjuPTKkrWLw":{"text":"I have eating in quite a few cities... And I've eaten at a ton here in NOLA, and this was ","useful":3,"cool":0},"se05nsx58oWSP46hhxkFGQ":{"text":"Randomly picked this place for dinner and it was amazing! Friendly service, from the staff","useful":0,"cool":1},"Z18geDk-WYhhnU7DvAbSFw":{"text":"I went to Gris Gris a while ago hearing about this new place that opened up and wanted to ","useful":1,"cool":0},"qJjutAVQzU84GUp26b-4Fg":{"text":"I don't usually visit a place twice in two days. This is an exception. Dinner and brunch a","useful":0,"cool":0},"-RWbXePB_SDMAvUwfbK5gQ":{"text":"Loved all the food on the lunch menu at Gris-Gris! We had the fried oyster salad, oyster b","useful":0,"cool":0},"PYgSKIS3cMa6vACBQVpGNg":{"text":"Gris Gris\n\n Looking for a great neighborhood restaurant? @grisgrisnola is the place!\n\n My ","useful":3,"cool":2},"ejoaEAvAcRZz7IO3ayFdvA":{"text":"Had Christmas Eve dinner at Gris Gris. The food was amazing as was the staff. We decided t","useful":5,"cool":2},"buWbXYszyWQa01YZdhOI-g":{"text":"I was last here in Oct'19 and have been wanting to return ever since, especially for the C","useful":1,"cool":0},"O3zAX7mVUIPhq9vZ9FEkSg":{"text":"This is hands down one of my favorite restaurants. We came here for brunch and I was blown","useful":0,"cool":0},"qM8geF53tPGyMwd0-zxvIg":{"text":"Best food in NOLA hands-down. We arrived in the rain only to discover that we accidentally","useful":1,"cool":0},"8rSG1SGEf_mEW2rkpGegVw":{"text":"We had been talking about trying this restaurant for a while and we finally went for lunch","useful":0,"cool":0},"x1NAUrhdrq8anTkACRylMw":{"text":"Wonderful meal. Po Boy is a must! Friendly waitress. Can't wait to return. Thank you!","useful":0,"cool":0},"qpD4RI1LAt6gblk3JV0JJQ":{"text":"Had a really great experience here. The food was delicious (particularly the chicken and d","useful":0,"cool":0},"ZafYhQe_hiKBljQoE1pGJw":{"text":"I honestly don't know where to start. This restaurant is one of the more unique ones I've ","useful":0,"cool":0},"72Cw87qnMBz0pSX4mLH_kA":{"text":"Shrimp and \"BLT\" appetizers were very good.\n\nFilet mignon and duck entrees were good (but ","useful":0,"cool":0},"HDHhsMx2HpOhqgNkSSk2HA":{"text":"Ratings\nFood 7/10\nService 10/10\n\nStopped by to try the different style of cuisine and it w","useful":0,"cool":0},"KoCccDPTZ-PDL0_POZx7Kg":{"text":"We were lucky enough to walk in and get a place at the counter. Fun to watch them prepare ","useful":0,"cool":0},"ygZ5RPWY6L4uEPU2JEb4Hg":{"text":"I really don't know where to begin. From front of house to the back, this establishment ha","useful":0,"cool":0},"mVI9Gom3lQEunbckpk-8Fg":{"text":"So I have to say this was more than disappointed with this experience. Obviously the owner","useful":0,"cool":0},"nHtWOgp2oLpANJ0FYcU_iA":{"text":"Ambiance was really nice, butch food choices were limited. Overall experience was good tho","useful":0,"cool":0},"-4cpvHoVxsVdJw5yjqIASg":{"text":"We went here on the recommendation of the owner of the B&B we are staying at (Kim at the P","useful":1,"cool":2},"MFLocmBGHbxotSI1BN3Ucg":{"text":"Located in the beautiful Garden District of Nola where amazing restaurants and shops exist","useful":1,"cool":0},"i5QEc3l8F0z8qWu4uswnRA":{"text":"Y'all!!! I gotta tell ya about their shrimp remolaude stuffed tomato, a new dish on the @g","useful":0,"cool":0},"yGFzAX70SVXSBMVA95hbcQ":{"text":"One of my first nights in New Orleans! A new friend brought me here and I loved it. We got","useful":0,"cool":0},"bRZ61C8QkzDkQDUbJ4ps3Q":{"text":"Stopped by for brunch today and had a great experience! We dined at the bar and had a grea","useful":0,"cool":0},"ixYaYMYyJmpM8v1M7qABZQ":{"text":"I visited Gris-Gris on 12/21 and had the holiday special menu with wine pairing. Simply pu","useful":0,"cool":0},"aKheZlkNcFbcO_jnyo_nFg":{"text":"We chose this restaurant after our Restaurant August reservations were canceled due to Cov","useful":0,"cool":0},"Za3YKSUYfOd4KVuQ1i25RQ":{"text":"This was a pretty cool spot in the lower garden district and the patio upstairs was great ","useful":2,"cool":0},"qNsyUSf5q5kF4pH4vCVq4A":{"text":"I have been thinking about Gris Gris chicken & dumplings for months. The last time I visit","useful":1,"cool":1},"SYp4BeziR4yleW9F73NoPg":{"text":"The gumbo was excellent ant the sword fish amazing. Chicken and dumplings are yummy also.","useful":0,"cool":0},"FBdYQCnw07RkIlpAUsxOWg":{"text":"This place is just awesome. First of all, I need Saturday brunch. They have Saturday and S","useful":3,"cool":2},"chv0FkPGkGj4zEtM_0dwDA":{"text":"Excellent food, with ambiance that was in line with New Orleans character. Great outdoor d","useful":0,"cool":0},"h5uWmcP-igNcu91WGp8_tg":{"text":"very nice ambiance. situated on the corner with upstairs balcony.  \n\nwent there on Sunday ","useful":0,"cool":0},"LqdDpJTDomcomfP_SuofMg":{"text":"I don't usually give a restaurant a 5 star review after just one visit, but this fabulous ","useful":5,"cool":2},"9cpL7KMpq-K_lwTzOH2yrQ":{"text":"My friends and I enjoyed the food and atmosphere at Gris-Gris. The service was also pretty","useful":3,"cool":2},"oOd8TNoWAUER8P_tTAPLYg":{"text":"We visited Gris Gris on the 4th of July.  We chose this restaurant based on the wonderful ","useful":1,"cool":0},"lf3ytABkqI3SI7ShojMlag":{"text":"They don't have it in the menu but they make a delicious vegetarian option (not vegan sorr","useful":0,"cool":0},"LpT_GABjFm2eUk-E51IHmA":{"text":"Very sleek looking place! Came for the last part of the brunch rush and was seated right a","useful":1,"cool":0},"wOVib22lb0O0TcWRLodQ8g":{"text":"Unfortunately we didn't get to try the food. Restaurant is reservations only even though t","useful":0,"cool":0},"Dd0gmbeO9WUg2QchuakC0w":{"text":"I've had reservations for Gris-Gris and have always had to cancel for some reason but toda","useful":1,"cool":1},"NvvvjB2xsSL6nEaSIhBaUA":{"text":"A very disappointing experience. Our party was seated for our 8pm reservation. Then we're ","useful":0,"cool":0},"IsSIzNgaAanbYzXt-vjhJg":{"text":"After having won several Best Restaurant of the Year awards, my husband and I HAD to give ","useful":2,"cool":1},"5hZLUN7pVRcLjjnCbUe9XQ":{"text":"I could tell you how delicious our recent dinner was. I could tell you how friendly and ac","useful":1,"cool":0},"dUhftSxh01xjLlafV_hU_Q":{"text":"Best meal I've eaten in New Orleans. Perfection. I had a good breakfast and wasn't famishe","useful":0,"cool":0},"fwglOSR3rHw5Fm6xFNduMg":{"text":"Such a tremendous disappointment. The only reason I am giving it 2 stars instead of 1 is o","useful":1,"cool":0},"Mc4EztdlGX_dltNswLAySQ":{"text":"Had a Friday night dinner at Gris-Gris and it was nothing short of spectacular. The open k","useful":0,"cool":0},"78x78yjsjRI35-icAWmZ_w":{"text":"We came on a Sunday night without reservations and were seated immediately.  The food was ","useful":1,"cool":2},"yXtUtl8_LSSZoGCX9_B3Gg":{"text":"We had dinner at the bar. We enjoyed watching the open kitchen. The food was delicious. I ","useful":0,"cool":0},"N7pvQBjGU9loXL3CGzxHDQ":{"text":"Stopped in at Gris Gris for happy hour and loved being able to enjoy the outdoor seating b","useful":0,"cool":0},"eIjEaXUKNiJoI-MXbvvUxg":{"text":"Went there for brunch. Excellent choice. Good cocktails. Food was amazing. Did the oyster ","useful":0,"cool":0},"54A3gqGGwrd2GG5BO4gDcA":{"text":"Meh... maybe I was expecting too much as I've heard nothing but great things about this pl","useful":0,"cool":0},"n9UGuDf0t9H0GXIAHPb_3g":{"text":"Gris-Gris is a cute little restaurant with a pretty balcony seating area. Being on the bal","useful":3,"cool":1},"_3EXtO2vqcsk-AobP-9-Qw":{"text":"The lunch I had at Gris-Gris was one of the best meals I've ever had in New Orleans--and I","useful":0,"cool":0},"cXo5cKo3e8-8k6j61w5lqg":{"text":"Can't give 3.5 so I considered \"would I make this a destination location for that extra 1/","useful":5,"cool":1},"FQwsaeaJdDDBeIU7Td6qWA":{"text":"Friendly staff directed me to the bar upstairs where i picked up some king cake daiquiris ","useful":1,"cool":0},"W8IJ7L_GtGa0bs2fTYs7SQ":{"text":"Walked in to and empty bar area was told \" let me check to see if there are any reservatio","useful":1,"cool":0},"V1k3EfjYwrfMh8Ml6kA-jw":{"text":"Really good cocktails. Decent food. Fantastic service. \n\nA bunch of friend and I rented a ","useful":1,"cool":0},"9Ly07rcnaOnAoppuG8ZLLA":{"text":"We went for lunch. It was a cold day and we were greeted warmly. It's a steep climb upstai","useful":0,"cool":0},"tLVmHtQewIVn-vMD9lyw5Q":{"text":"BEST DINING EXPERIENCE IN 2018\nSo I had 90 minutes to kill after dropping my phone to get ","useful":6,"cool":3},"HaZSCur7_sw3WvcL9n-IJw":{"text":"We decided to book this restaurant because they offer sidewalk and balcony dining. Unfortu","useful":2,"cool":0},"vkBQtlc2Ivddslh7xuiwag":{"text":"Gris-Gris is a hot spot. Whether dining inside or out on the balcony overlooking Magazine ","useful":0,"cool":0},"GtTT0ch_fldNW8VQJGVzRA":{"text":"My boyfriend and I come here all time! For brunch, lunch, and dinner. We always leave full","useful":1,"cool":0},"pU5YUtNafCp3LSrUjIgqCw":{"text":"Hello you creative and inspired menu!   Cool refined industrial decor with an open kitchen","useful":0,"cool":0},"ZU0CdZ8WhSrthJazkwKghA":{"text":"Outstanding food and atmosphere. The balcony on magazine is wonderful and everything we tr","useful":0,"cool":0},"2KlCawHka2uaih1ACvP0wg":{"text":"Best gumbo so far by a wide margin with considerable depth in flavor that was well balance","useful":1,"cool":0},"QqUzL6UZMe9CxDDa2GcbnA":{"text":"Very cool place. Open kitchen so you can see your food being prepared. Bar style decor is ","useful":3,"cool":1},"9lLHfnOP_8ZWirrN5QbA5A":{"text":"I have been hearing great things about this restaurant - It happens to be my neighbor's fa","useful":1,"cool":0},"WnjIta4HvS4YV4z0RHW5bw":{"text":"First time in New Orleans! And first time trying Gumbo! I will forever, each time I visit ","useful":2,"cool":0},"I3B4TR09fQylwWM0SjVXBg":{"text":"One of the most enjoyable meals I have ever had, and I have eaten at many wonderful restau","useful":0,"cool":1},"58o15mQDkkFo0Bgla23q-A":{"text":"The evening has started out poorly with management's shortcomings on service. The main iss","useful":2,"cool":0},"AH_1yDES2AghBnppkCW-KQ":{"text":"Consistently very good food.  The waitstaff is a little too laidback for my taste--even wh","useful":0,"cool":0},"Bk11__tBWJmfCK3w1ByFJg":{"text":"Had a fantastic experience at this restaurant! Try and make sure you get the Chefs Table s","useful":3,"cool":1},"cwDoFEFIUG-mVWP00aJU7w":{"text":"I had a good time here, the server was attentive and the open kitchen is nice. I especiall","useful":2,"cool":1},"0j6BQBIiyBGUH35qlaXZTA":{"text":"Gris Gris has a great brunch! After reading about how popular this place is, I had to chec","useful":1,"cool":1},"FBLhnPmCiUGkHHGi_5Vymw":{"text":"Slightly better than average dining experience overall. The happy hour is a good deal on t","useful":0,"cool":0},"mjar9i4LmdDjEr0Iho352A":{"text":"I'm writing this as I dream about an uncertain future where Gris-Gris has once again opene","useful":0,"cool":2},"uBixbz5uBCgmmjXaohXmjg":{"text":"I'm so glad our tour guy told us about this place. This is a top notch New Orleans food. G","useful":2,"cool":0},"wlwSWaKDjeafAuH19NcQng":{"text":"Great location, sitting on the corner of Magazine St and Hasting Place. Very nice restaura","useful":1,"cool":1},"HepVxQpiaCEw8gnSrWLbMA":{"text":"Holy Cripes this place stinks. They changed the happy hour rules yesterday but didn't info","useful":1,"cool":0},"6ewBPtNTkmgApIbPN8mBPA":{"text":"Went with friends and everyone enjoyed their dinner! This summer start with a bottle of sp","useful":0,"cool":0},"JkRihgwr_pf0w7DNwkr6VQ":{"text":"Went for Happy Hour to meet a friend and we were seated up on the balcony overlooking Maga","useful":3,"cool":3},"XFAIsbwovFaotOEKqJfNvA":{"text":"Absolutely fantastic! We tried a couple cocktails, split two appetizers, had our entrees a","useful":0,"cool":0},"y-46_akS-3LJ0huS_pRhaA":{"text":"I'm all about their happy hour y'all! I finally had the chance to dine here and we were ab","useful":21,"cool":9},"zxKVXxdmqFRRIcRFwVXtrQ":{"text":"Yes eat here! I saw the chef on Gordon Ramsay's Uncharted and decided to try it out. I'm a","useful":4,"cool":1},"f47dHV62qncrsG_K9q82fA":{"text":"Booked a reservation for 2 at the \"chef's table\" to celebrate my friend who flew in from L","useful":2,"cool":0},"iIePQCEs8XXzJ1GfSZlNiA":{"text":"They are open again and just as great as ever.  Same menu with some wonderful additions.  ","useful":1,"cool":0},"G6da5BqrEr2X0sYt-EkdgQ":{"text":"Delicious food, absolutely amazing service. Hayley and Matt are your go to for good conver","useful":0,"cool":0},"wh0sbQY0nT1tk7gB5Y_T1A":{"text":"So delicious! Man, the deviled eggs with pork belly were amazing. We had a party of 8 and ","useful":0,"cool":0},"NGR95i3raqjuCwcMM4PUEg":{"text":"What a disappointment. In town for the week and we made the mistake of dining here. Ordere","useful":4,"cool":0},"R75uyOJ8XEO9MWmZ398LSw":{"text":"COVID Takeout Review:\n\nTheir food is just as incredible to-go. I've had the chicken and du","useful":6,"cool":7},"s0Ggvj_QA5xiSafap6Z-VA":{"text":"Great service, awesome ambiance and the food was fantastic. They have happy hour from 4-7 ","useful":0,"cool":0},"MrOgRbkHiD0sTyiRUc6avQ":{"text":"Well I'm so excited that I was able to try this fabulous little bistro on this trip to New","useful":0,"cool":0},"WU-edv8b049xegBfpv-PFA":{"text":"Gris Gris is one of my favorite restaurants in New Orleans. I was introduced to this place","useful":3,"cool":2},"SN-3SWSO5Uh-YqhaZQ382A":{"text":"Gris-Gris do you love me? Are you riding?... lol I can't help put to say that. (Play on ra","useful":3,"cool":2},"r7kocv3VIX5VH3cUJa6e4g":{"text":"Came back for more!!! Safe to say i have now tried almost everything on their menu, never ","useful":2,"cool":0},"ahquGRzqA9YaMPHTWqJ0LQ":{"text":"Don't miss this place if you're in New Orleans.  Great spot in the garden district, so it'","useful":0,"cool":1},"irt6UEDLJvudXraZC5OZAA":{"text":"Attended a private party here. The service was excellent and the food was very good. Had t","useful":0,"cool":0},"5g4ru8xFd7igA2GdZCu_Rw":{"text":"Awesome restaurant, the Grits were amazing. The chef was fantastic and it was great to sit","useful":0,"cool":0},"sYOnAGXBQ864X8zqH7Ftew":{"text":"All this place got going on is its prime location, everything else is overpriced and subpa","useful":0,"cool":0},"AoQYt4g01L5zV2jt6IyUcQ":{"text":"Had the Redfish court boulion, fantastic. Sat downstairs at Chef's table lots of fun...","useful":0,"cool":0},"vjbdY9QLdDrdiRHCH9ryxw":{"text":"Let me tell you what!!  \n\nThis is a Gem in this area and if ONE food network/travel channe","useful":11,"cool":3},"nICrXMt4qMTUKFl0aGBI0A":{"text":"This spot is really good. Fast service, great cocktails and tasty food. I'd like to highli","useful":0,"cool":0},"OzQdzoMj-u92BaIa9zS6uA":{"text":"I don't know.   I'd heard amazing things about Gris Gris and was able to book a 8:45 reser","useful":0,"cool":0},"F6oWMMQR2KKrntGM944Wrg":{"text":"I was so looking forward to this experience... and perhaps it was just an \"off night\" for ","useful":0,"cool":0},"g5SjFRybAO8vcCrjLF3xNA":{"text":"I can't give this place a high enough review! We were in town celebrating my husbands birt","useful":0,"cool":0},"nFPVTsw_nNb9Z_FlozpApw":{"text":"Everyone in our party had a wonderful experience. We sat at the chefs table downstairs. Th","useful":0,"cool":0},"T-ehK7J-FBFPcFO1Rwj0vg":{"text":"Great food and even better hostess.  This was our first dinner stop on our vacation and it","useful":0,"cool":0},"F1L9hhHVhTtp6lnD_nzUEQ":{"text":"Everything about this place is five stars.\nThe servers and bartenders are awesome!\nThe foo","useful":1,"cool":0},"dzzuk2XE4OB_1LJVtcoU5Q":{"text":"Horrible service! Just plain rude! Had reservations at 7:30 and were ignored for 10 minute","useful":1,"cool":0},"EuItdGBib1my_OvE1UpoGw":{"text":"If you're looking for an amazing place, Gris-Gris is the one. Not only is their food amazi","useful":2,"cool":1},"3-HK-YsiVvjnQt2jE7jd_Q":{"text":"What a total gem! I had the pleasure of previewing their new event space, the Samedi Room.","useful":3,"cool":1},"_FMNaG5pc0kZusCRWYkasw":{"text":"Every time I walk past this place, I think \"I want to go in there so badly.\" Finally, I we","useful":0,"cool":0},"b7BktYjgfz1jf4zinO9wuQ":{"text":"This is a great place. But their lack of a vegetarian option is frankly offensive and shor","useful":0,"cool":0},"PvvsUlqjtzNA8Df-fLf5kw":{"text":"BBT! Bacon Basil Tomato Sandwich.  Everything at Gris Gris is excellent but this is my per","useful":1,"cool":1},"g8Kots6fTgsJuuZ_cZXHUg":{"text":"Stopped by last night because I've been dying to try their holiday cocktail flight!  It wa","useful":2,"cool":2},"8FMiBKDvpBTxJinhMSVJ5g":{"text":"I wish I could do a split review: 5 stars for the Christmas cocktail specials and 0 stars ","useful":2,"cool":2},"LWTNFX-SjzZ03yEcmJ3z7g":{"text":"Really tasty food. My husband is pretty picky and he adored the Pork chop. This restaurant","useful":0,"cool":0},"vI0n14prcYxMiBYSPtFPag":{"text":"Best red beans and rice I ever had. Good portions. Great food. Nice staff. Sat at the coun","useful":0,"cool":0},"vVovKgJSOofV_FDF22vwaA":{"text":"Best bread pudding in the city. Too good if I could bathe in the sauce I would it taste li","useful":0,"cool":0},"67Eilg4Qhu-51V3kJ_MO6Q":{"text":"Giving this place one star.  We actually only sat down and had a couple of sips of water b","useful":1,"cool":0},"Asq9LppPY3Oq2NAgt_5QSA":{"text":"This is an amazing restaurant.  The atmosphere is perfect.  In a small building with an op","useful":0,"cool":1},"kyMQ775toIMlMgn9HuQkEg":{"text":"Where to start??!! Let's start with our server. When I tell you he did not disappoint. He ","useful":0,"cool":1},"kexzAUxDKxvi5KlRtX8HTw":{"text":"Went to Gris Gris for Christmas Eve dinner.  I called to make reservations and requested t","useful":4,"cool":3},"CrM2QQFeyPcGLK8EgRpgEQ":{"text":"My friends and I made a reservation here to celebrate her birthday. We were fortunate to b","useful":0,"cool":0},"cGDfNtdhey0c3FrNUa2Yjw":{"text":"This is a cute lunch place to go to, their food were amazingly good and their patio was pe","useful":1,"cool":0},"WyRBwgJDOa5vBHAsF9jCRA":{"text":"If you are the type of review reader that only reads one line I would say to skip gris-gri","useful":1,"cool":0},"owmsFqoAPSrigWVWfiP97w":{"text":"Gris Gris serves refined Southern cuisine and is owned by Chef Eric Cook (what a great las","useful":0,"cool":0},"x3HWY3mgBNgOtnFBNEUW4A":{"text":"Gris Gris has become my \"Go To\" destination for incredible food in NOLA. Get a reservation","useful":1,"cool":0},"0_TXzkJI8l9oMKkF9dafIw":{"text":"So I have to say this was more than disappointed with this experience. Obviously the owner","useful":0,"cool":0},"m-UCs037XGzcK1fxfQathw":{"text":"I so wanted to love Gris-Gris.  The neighborhood is true NOLA, the menu had me eager to sh","useful":1,"cool":0},"AoPKPEhkI8ETTuWWcmW9jw":{"text":"Great food!! I had the duck, which was smaller portioned than I thought, but it was amazin","useful":0,"cool":0},"VvCwVjZ3uFKglY-73CM53w":{"text":"Everything we ordered was delicious and reasonably priced, including the wine. We sat down","useful":0,"cool":0},"un88_V5fotSKM-r0nWUiyg":{"text":"Gris-Gris is our \"go-to\" for everything from lunch to special occasions. We brought a \"fir","useful":3,"cool":0},"xd8sUPK7ryUn0C1Pq4vhWA":{"text":"Balcony reservations. Do it. Resy or open table I forget which one. We arrived at 5:00pm a","useful":0,"cool":0},"rY-gYXuqTIljGUkqjRyE0A":{"text":"Great food and drinks at Gris Gris! It was my first official restaurant dinner since befor","useful":10,"cool":10},"q82gG8fQVfKrYPKsnUu4LA":{"text":"I have had this place on my radar for about as long as it's been open.  And, much like oth","useful":2,"cool":0},"ndANbYosuHFd9a6xYrA7rw":{"text":"Seafood is good and we love our waiter. But could really use some masks in the kitchen","useful":0,"cool":0},"toUWz9ZRQgjJEoeed-gOFw":{"text":"Service is excellent. Highly recommend the Chicken & Dumplings. Absolutely phenomenal. Can","useful":0,"cool":0},"rUjRETUA32GcQQalBW3r4A":{"text":"Will never eat here again. Waited at the bar over 30 minutes for a take-out salad I ordere","useful":0,"cool":0},"isChjZm4qZheE_UKqpsv4Q":{"text":"Gris-Gris was absolutely delicious! We made a reservation for brunch (I would highly recom","useful":18,"cool":16},"mZaNhitDjgiWG8RJaChfpA":{"text":"WOW. I don't have the words to describe how delicious our late lunch at Gris-Gris was! We ","useful":0,"cool":0},"dt7x5nrK2DiimqkC8IYw5A":{"text":"Omg, so friends took us here, they are from out of town, I looked at the limited menu befo","useful":2,"cool":1},"K7skVwqXNj3LIB-BFKjWOQ":{"text":"So. Freaking. Bomb. After having dinner here once, I want to come back and try every singl","useful":2,"cool":2},"W1gEKvnBeE6xwd85ISI8CQ":{"text":"This was one of the worst experiences I've had at a restaurant in New Orleans...and I live","useful":0,"cool":0},"2GKxcObceEQKx4IYNQGYeg":{"text":"Walked in to and empty bar area was told \" let me check to see if there are any reservatio","useful":1,"cool":0},"VzVOr6Puw4uhLvzdbMg-Tg":{"text":"Gris-Gris, you have definitely cast a spell on me.\n\nAs soon as this spot opened and food g","useful":16,"cool":9},"D4AgNRlhI_Cdvv5tXq7oVg":{"text":"I am a food snob and if I recommend a place it's going to damn good and worth your money! ","useful":0,"cool":0},"nfTkmFWW7CxmyG1FGh_2nA":{"text":"I read such good things about this restaurant, and they were all true. We made reservation","useful":0,"cool":2},"o-dEdAkQ-xWr0o1gnO4ajA":{"text":"Small menu but great diversity something outstanding for everyone,  interesting concept in","useful":1,"cool":0},"LztBQpYP3256jRHfN0SkNA":{"text":"We had a fabulous experience here. The food was great (burger + shrimp & grits + oyster pi","useful":0,"cool":0},"dVTQDBB8J7Ta48sdGe0Ajg":{"text":"Enjoyed our March Brunch outing here with my brunch group. The food is delicious of course","useful":5,"cool":4},"T_-6cOwYhI07HiSceQQu2Q":{"text":"My friend and I went for lunch one day.  The building and ambiance is nice and we sat in t","useful":2,"cool":0},"Sn1b7dhulYUcBR01cJXtZQ":{"text":"Unbelievable! Tastebud explosion! New twist on the sazerac, cool decor and wonderful servi","useful":0,"cool":0},"1eumWruSuDPVVpiHX5OkIA":{"text":"My wife and I were here for lunch on August 10th. They hit it out of the ballpark AGAIN!!!","useful":2,"cool":0},"ALAxvnySL6IFouKPTGjjDA":{"text":"I'm having a really tough time deciding how many stars to give this place... We went with ","useful":5,"cool":0},"Civn_252cFcuSvx0mCvimg":{"text":"Sadly, GrisGris was underwhelming with food and service. Would not recommend based on incr","useful":1,"cool":0},"5axvBqJKq1hZ-60p5eNz-Q":{"text":"This place was amazing! We sat on the upstairs patio and with a heater was very pleasant. ","useful":1,"cool":1},"SMuE0NMGXgrGKOfzh5EpZg":{"text":"Whaaaaa? Can you say amazing? \nWe ordered the shrimp and grits, which was incredibly good.","useful":3,"cool":0},"V06XRAMxMrMR7_vkOuFghA":{"text":"We were a large party celebrating a wedding in New Orleans and decided to book a balcony t","useful":0,"cool":0},"hOSBNdk7Amx1qbRsoJHc-A":{"text":"Excellent Cuisines, Excellent service, Excellent atmosphere! You will not be disappointed.","useful":0,"cool":0},"JCBOrmgz8oEZdzx9uH6Cjw":{"text":"Gris-Gris Ratings: 4.4/5\n\nFood: 4.25/5 - Made a reservation at Gris-Gris for our last meal","useful":2,"cool":1},"3Thlt_k3EQbskV1UE_ld1g":{"text":"After nearly a week of outstanding New Orleans food, the bar was pretty high to meet or ce","useful":2,"cool":0},"VmNnJGpcY4eSQWeFi58CLA":{"text":"ATMOSPHERE:\nKinda modern hipster, classy restaurant-bar. Outdoor area downstairs and the b","useful":1,"cool":0}}