{"suMtrxm_nUiAQMu6ZfG5Wg":{"text":"Say you decide that you need a new door...and you only have $35.  Where do you go?  the Gr","useful":3,"cool":1},"1Zbs7Dlb9wJYS-lkTmBSkQ":{"text":"Great concept, inventory is always changing, affordable prices, and all while helping New ","useful":0,"cool":0},"4EExRjJLMQL6BUh1SRTnYQ":{"text":"I love this place so much. If you ever have an art project or if you want to fix up your h","useful":2,"cool":1},"22rYJQoNZHriAebvSsm1nA":{"text":"A great, affordable resource for home renovators on a budget.  A lot of their inventory is","useful":2,"cool":1},"qkv08_iREgIPCxHOyMxsuA":{"text":"The King of Salvaged Building Materials in New Orleans.\n\nThe Green Project has been promot","useful":3,"cool":1},"3CS4xiE5wq3chrBohPkvGQ":{"text":"Low cost supplies for materials for projects around your house. I gave 4 of 5 only because","useful":2,"cool":0},"LMAHeYh8Csxya77K29CFzg":{"text":"I love this place.  I use it for my home and business.  The staff is super friendly, the p","useful":1,"cool":1},"B2Su9hz7yAPzxhNkpbqsIw":{"text":"awesome. Buy recycled wood or widow frames or doors or fire places here. They also do recy","useful":1,"cool":0},"GgN_07nMkMIaBLCzbOAlJQ":{"text":"A must go to place for all your building needs. The Green Project is my favorite place to ","useful":3,"cool":1},"XGXz39-SFPBSg8gq2R-2xA":{"text":"Great Great find, especially Post Katrina.  This place is a hodge-podge of finds.  And to ","useful":3,"cool":3},"Z3WaHpTij_gXG5fgoYZkNA":{"text":"The Green Project runs a salvaged hardware store as well as a program called Recycle for t","useful":3,"cool":2},"R5w55Mv4vLYy_bRNZFbuNg":{"text":"If you're looking for extremely low cost paint, and aren't too particular about the exact ","useful":2,"cool":0},"6MMzQWjh5y8LMMBo01Bjbw":{"text":"I  absolutely love the Green Project. Last week I had the chance to volunteer and help do ","useful":5,"cool":4},"7Bs00kCZNy0YDgaCNsY6Og":{"text":"Still a great value and a GREAT place to donate used or unnecessary building supplies. Sin","useful":5,"cool":5},"vimRf-ezdn0j8MkTLa1Kng":{"text":"The staff is great.  The concept is of course wonderful.  I don't always find what I need ","useful":1,"cool":0},"tGHv3nBk1O01FbVx2rYp3g":{"text":"even though its a salvage store they are not super cheap...can find some decent stuff some","useful":0,"cool":0},"nmPC3wX6spkSo9NYGpEIKQ":{"text":"A bit dissapointed by the selection here.  For the quality I feel the prices were high.  H","useful":0,"cool":0},"HZKEFPiCcup7f4_fvilgqw":{"text":"I was recently in the process of revamping my rental property. I needed some new doors and","useful":3,"cool":1},"A3bI6EvwtaPHLhE5u6qtEQ":{"text":"What an amazing concept in New Orleans! I love this place!\nI have only used Sherwin Willia","useful":2,"cool":0},"ERZjQxDcIucFYNyGojFjhA":{"text":"Seriously they have just about everything and anything.  If you are rehabbing a home and n","useful":3,"cool":2},"iw_WYbMQ3X608S8Okxup1w":{"text":"Great place for DIY people. I found some cool old doors and windows and great paint for th","useful":1,"cool":1},"mwV9oDxu3S2jyT0Nh5fpIw":{"text":"In from out of town doing an artist residency for the month. I believe in supporting anyth","useful":4,"cool":1},"WHElb3w5Os3RLEijnTZ1RA":{"text":"If you need some odd piece of house building, decorating, repairing type thing...this is t","useful":2,"cool":1},"Uons3YzvdtEyNQC1TfyDqA":{"text":"Great concept.  Awesome place.  Friendly people.  Free/cheap weekend classes.  Cheap membe","useful":0,"cool":0},"q89A3SafmerqHpV-pnScWQ":{"text":"If I owned a house, I would be here all the time.\n\nThe inventory changes a lot, so if you ","useful":3,"cool":2},"z01PA1i5pBt72Bo9RGPcUQ":{"text":"This is one of those places where you can go back over and over again. It's constantly cha","useful":3,"cool":3},"RiY_aiC8rVJ4-PyLnCXe9g":{"text":"What's to love about The Green Project:\n\n- The Green Project is concerned about protecting","useful":9,"cool":4},"iyGrZrmaDaOX50U5vDRhLA":{"text":"I love this place. walk in with some imagination, and you can come out with a new house! A","useful":4,"cool":4},"XiGPl00SVv6FdTTtiWaFJw":{"text":"underwhelmed by this place. I have been many times and never purchased a thing. a lot of i","useful":1,"cool":0},"L7r0CW3nLCLk069AwQ21Jg":{"text":"If you're into building stuff, are an artist or artisan or contractor, or just like having","useful":9,"cool":5},"OUg-uTI7fgzHRmoI49FIfg":{"text":"The Green Project is as good as it gets for low cost hardware and building supply stores. ","useful":8,"cool":3},"0DLzi59p5clGgB457vbGzg":{"text":"A GREAT place to go for recycled material - every thing from doors to art supplies to safe","useful":0,"cool":0},"S2XkLFWzKYH8PoDDDphvIA":{"text":"There is so much cool shit here.  There are piles and piles of old bricks, badass decorati","useful":3,"cool":5},"S96Mf0fOYbqedvkXbTiWEQ":{"text":"They have an endless supply of used doors,  kitchen cabinets,  windows,  shutters,  lights","useful":3,"cool":2},"ENfYMijrhaDgUCp1CcoWkw":{"text":"We came here looking for some cool finds. Not as many options as we had hoped, but luckily","useful":0,"cool":0},"S08baiMzClv7A5ccwl-_fg":{"text":"I like this place. not only because it has so much random stuff, but because it is afforda","useful":4,"cool":3},"t1IzQ5rmusy6mb6dqTxQrQ":{"text":"So much more interesting than Lowe's or Home Depot!  Crazy array of doors, windows, shutte","useful":3,"cool":3},"rlbND1GJPOcahkCJMqnHXw":{"text":"Suprisingly well organized. I was just there to price out some projects I was considering ","useful":2,"cool":1},"xEipCG_9hzOm8bvxpoDMVA":{"text":"The sweetest and most outgoing people you will ever meet. I volunteered here for two days ","useful":0,"cool":1},"Xdzm9Wugnl1FHaHFwNPdPA":{"text":"I've been wanting to go to this location for at least 6 to 8 months, but due to auto immun","useful":1,"cool":0},"UQVnvewNCQ9IbUhyhv_HJQ":{"text":"Aside from the fact that I was disappointed to find out that the Green Project is NOT a me","useful":5,"cool":4}}