{"slE0DDjPefSStdL4DO9dxg":{"text":"Went to lunch today with some fella's.  we all got the Wednesday specials- I got the shrim","useful":3,"cool":1},"2MT8DR5kX_mI6JlHVYYcgQ":{"text":"This place is a great concept! The food was delicious and fresh. Service was prompt and co","useful":2,"cool":1},"ISSp9rsaJLEzkaJ-ZeIITQ":{"text":"It's hard to find Cafe Reconcile with its doors open, since it is only open for lunch on w","useful":1,"cool":0},"FS4ewsVRMHvTvKBVRkX8ew":{"text":"I didn't really read the reviews of this place before coming in, so I didn't even notice t","useful":5,"cool":2},"ct6htfblBMiR13zM6zhxfA":{"text":"Came here with my boyfriend on a trip to NOLA and the food was fantastic! So delicious, th","useful":0,"cool":0},"S7H0dvC4yHbCWPmjQJ1TRw":{"text":"This place is so freaking good. I haven't been to New Orleans in 5 years and I still talk/","useful":0,"cool":0},"O8W1GKBuq8gUL_oI-D6Mdw":{"text":"SO DELICIOUS!! We started of with the spinach and artichoke dip. Then my sister and I both","useful":0,"cool":0},"Zil5Tu4cR2YshQh77YJjiw":{"text":"Honestly the best food I've had here so far! Love the people and the idea behind the proje","useful":0,"cool":0},"kKjrZ3l_GjO7sH4MCrznQA":{"text":"Local who has visited this place 4 times and EVERYTIME it is absolutely amazing. From the ","useful":0,"cool":0},"2Za18_73vvMrTImL_aVKGQ":{"text":"Having visited New Orleans several times, I've had the pleasure of many superb meals. Cafe","useful":1,"cool":0},"IxjJhlaURP8_GJr-yVZCZg":{"text":"Really good food with an even better backstory! \nThere is a very local/community-driven vi","useful":4,"cool":2},"K9fShFH_N4nUOlJ1lYfZKA":{"text":"I've only been here once, but I'm definitely going back. I had the backed chicken, mac and","useful":2,"cool":1},"su8s_gQAuGXgBgicjekCaA":{"text":"Great cause, better food.  The neighborhood is not the best but do not let that detour you","useful":2,"cool":1},"Dsc8qnKR9f5BNaMk91R5rA":{"text":"Southern food cooked to perfection. The bananas foster was a bit too much, so bring a frie","useful":1,"cool":0},"SzIhvHc70Bg5q_UOpeVt3Q":{"text":"Food is great, the mission is even better. Check out their web site (or follow them on twi","useful":2,"cool":0},"Z191uB9T_iM7Ecgw8ke-dA":{"text":"I ordered the baked chicken, sweet potatoes, mac and cheese, and the greens, and I LOVED e","useful":0,"cool":0},"ycddQc9E2NNwSzevNkqVpQ":{"text":"Great place to encourage & support the local kids; it's a great cause! Food was pretty goo","useful":1,"cool":0},"7hGtprOjm1SJo1DLFTSRxg":{"text":"Not open for breakfast or dinner, only for lunch it seems.(11 - 3) At night the neighborho","useful":0,"cool":0},"Yaiql6wfgkHedIBkG9ClNw":{"text":"I think I was here on an off day. The famous bread pudding had curdled, and our bread and ","useful":4,"cool":0},"GrFqnlKxAUwqzmrMcF2qyw":{"text":"I have to say the food is a notch above mediocre, but there was absolutely nothing to comp","useful":0,"cool":0},"me3d7NR7MXH10menUwMkvA":{"text":"We had such a good meal today at Cafe Reconcile!  The staff was very polite and the servic","useful":1,"cool":0},"zrH7wJeztpm8VrorzynaQA":{"text":"Located between downtown and the Garden District, Cafe Reconcile is a great lunch place th","useful":0,"cool":0},"9CqDV6hEtx2F04UQYDk5QA":{"text":"I had an incredible time here. Not only did I love my meal (grilled catfish with man n che","useful":1,"cool":0},"NmFmLc0NmZg9daMAHdHjMQ":{"text":"This place has some of the best vegetables of any restaurant in NOLA.  I really love the m","useful":5,"cool":1},"p_nsEMa59P-hyFxLjuG9Vg":{"text":"The food is good -- we had the meatloaf special and the baked chicken -- and the price is ","useful":0,"cool":0},"mhXfKvBDx_45Gn-2kZDu5g":{"text":"Cafe Reconcile is a weekday lunch-only place so it's taken me a few years to eat here on N","useful":6,"cool":0},"8cwXlUiWCK2vXE0ElG-G7A":{"text":"Great mission, unfortunately horrible management.  We wanted to have Cafe Reconcile cater ","useful":0,"cool":0},"TdEm2rLHVEeHCyIZurLk3w":{"text":"We stumbled on Cafe Reconcile when looking for a place to grab a bite before our Garden Di","useful":0,"cool":1},"bpb3Kbzu1dglNYmyvRi0PQ":{"text":"I really enjoyed cafe Reconcile! Service was good and the chicken and waffles were great w","useful":0,"cool":0},"TOg8xb8ZBQ0GAAWWHwSCnw":{"text":"Heard about the concept of this resturant and thought it was really terrific. If you're lo","useful":0,"cool":0},"HzzIJLwwx9YyBJeucdxnuA":{"text":"Great food. Reasonably priced and the peach cobbler was as good as everyone said it was. S","useful":0,"cool":0},"0ST3GZTCbI7LgGaCEiP88Q":{"text":"Warning: the mac & cheese will change your life. \n\nOur whole experience was fabulous: grea","useful":0,"cool":0},"53omrvUpMx_zUqblGYKCdw":{"text":"Fee-nomenal. Drawn here by the story on Tony Bourdain's No Reservations and some glowing r","useful":2,"cool":4},"_gavPihmxx0ieFUz10l38Q":{"text":"Came by after the gym for a quick lunch with fam from out of town.  We were seated quickly","useful":0,"cool":0},"2M5uMT3kE4gXi3RNxiUpcg":{"text":"Decided to get out of the office with the other broads and decided to head over to the oth","useful":1,"cool":0},"wJjwodMWvqcy5f6Je_Xp9A":{"text":"Excellent place for lunch.  Loved the food and the premise of the place.  Kids learning sk","useful":0,"cool":0},"GNvFVQ-q5f79B80z6rqE-Q":{"text":"We just had Cafe Reconcile cater our wedding reception. It was a HUGE fit with our out-of-","useful":0,"cool":0},"BsauSLXfBRTjrWp2w-Bqrg":{"text":"I went to New Orleans in June 9, 2013.  I am from Dallas, TX.  I found Reconcile during an","useful":1,"cool":0},"yTmbDArjMtWAxPvtloYM1w":{"text":"CRAWFISH BISQUE!!!\n\nAnd an amazing mission. We were strongly recommended to check this pla","useful":0,"cool":0},"EAwKRLlZ8E7lx5poccQhJw":{"text":"This place is worth the visit. Everything tastes exactly how you would expect a southern m","useful":0,"cool":0},"Vos8zRgxirn_yIWHgYwI1A":{"text":"Hello, new favorite lunch place. Great food, great service, GREAT prices... we loved each ","useful":1,"cool":0},"deTuZboD38u-b0VtaKFuZw":{"text":"This restaurant has a vital mission that is important to support. The food was excellent. ","useful":1,"cool":0},"Xrj9nh8Kp_prEWYfcK8h6A":{"text":"Love this place. Awesome food that sticks to your ribs, nice people, great cause, pretty c","useful":3,"cool":0},"uYHuG5SsjSWaus7oy0MrMg":{"text":"This review is so overdue! I loved this restaurant. The service was awesome. I cannot wait","useful":0,"cool":0},"yzFZ8yOABTgZgfFVP9HlUA":{"text":"Eating good with a purpose. Fun environment for lunch and special occasions. Great work tr","useful":2,"cool":0},"tM9PAxMa9DVIVdnhkzmkmQ":{"text":"Not the best food or service by any stretch of the imagination but you have to go there at","useful":1,"cool":1},"9BwlI8pmcjWDUgjcS11ckg":{"text":"Just arrived from NYC and this was our 1st stop. The food was awesome.  I had the smothere","useful":1,"cool":0},"7Gr3R5Fkj72jIYkH14F6Vg":{"text":"Café Reconcile is a must-visit when in New Orleans! It's an easy walk from the St. Charles","useful":0,"cool":0},"sTm3WxUNzZLTdEjsysEXzw":{"text":"Delicious food , all well seasoned. The Bananas Foster Bread Pudding is a must try. Po Boy","useful":1,"cool":1},"NZWDCcmHIxLhRawmwC3QAg":{"text":"First things first...\nCafe Reconcile New Orleans transforms the lives of young adults (age","useful":3,"cool":4},"BeRplOGmmfBjOZHqrg6GGA":{"text":"Great concept providing restaurant skills to at risk young adults.  The food was good but ","useful":0,"cool":0},"QWa2hLGQHpCAhGVV_iWb_w":{"text":"Gorgeous renovation and the food is usually good and downhome. The space has been closed f","useful":3,"cool":0},"mVnmEPS9njEkqF7eZZtFVQ":{"text":"Cafe Reconcile catered our wedding at Race and Religious last weekend. Not only was their ","useful":1,"cool":0},"PsCNB54xfarYkKVCurwm2g":{"text":"I enjoyed my first visit to Cafe Reconcile. I ordered the vegetarian pasta and a side of a","useful":6,"cool":2},"QWApH2MVQfH-pFwAWlqyGw":{"text":"Delicious...I want to try everything on the menu.  I haven't had one bad experience.  The ","useful":1,"cool":1},"ljRkDYoZx6L20nRiuC9m2w":{"text":"Great cause! Food was pretty good, and the watermelon lemonade was delicious. Definitely a","useful":0,"cool":0},"GgsC_eI_V1OSDLZzAg7GFQ":{"text":"Delightful service and waitstaff, and while the food didn't floor me I still really enjoy ","useful":0,"cool":0},"fgHrc4guRq9jRTuvSs5amA":{"text":"This is one of my favorite restaurant's in the city. They have great veggie options, and t","useful":1,"cool":1},"-lkT6XSSpfKWd7RSUDb9rg":{"text":"I was steered to Cafe Reconcile by an out of town friend who had read about it and wanted ","useful":1,"cool":0},"G6KO6xL03ILO2lk1TyGpqg":{"text":"My friend and I both ordered the smothered chicken with chicken and smoked sausage jambala","useful":1,"cool":0},"QqnxsMqZIDubhAtZqxnw5g":{"text":"There are so many amazing places you hear about in Nola. But this is a true treasure. Anyb","useful":0,"cool":0},"_LSlcpqTG4xiRUZnBtzC1A":{"text":"The place has delicious New Orleans food, that goes from po boy's to jambalaya at a great ","useful":8,"cool":6},"lBj0ee8sQH8v7XZRsxsnug":{"text":"A must visit, the concept is just great.  The service is sometime a little overbearing but","useful":0,"cool":0},"z5ZHb035Ci9OADNkgGfx9w":{"text":"Party with a Purpose\n\nMy family celebrated this past weekend our TRIFECTA (Xavier graduati","useful":2,"cool":0},"svlRUkvlFzzDfDhWncoV9w":{"text":"Stumbled upon this Central City neighborhood gem while staying at an AirBnB around the cor","useful":0,"cool":0},"S_v5grDNKntRXXQSsctlJg":{"text":"Fried catfish + crawfish sauce; jumbayala + mac n cheese; gumbo; banana foster bread puddi","useful":3,"cool":0},"QpopRw3cq49dD1zf3w7tfQ":{"text":"I have never written a Yelp review in my life, but I had to write about how amazing this p","useful":1,"cool":0},"q5NkjE0z0vNmnPajpYCNSQ":{"text":"I ordered from Reconcile for catering pick-up for a board meeting. \n\nWe arrived before the","useful":2,"cool":1},"F2tkN70r2SPGUvJJHY3GkA":{"text":"It's was pretty good the pesto pasta was good the shrimp in it was great . Bread pudding w","useful":0,"cool":0},"zvyeskAOFMITXAE-dYfN9A":{"text":"First of all, it's an awesome, beloved program that is very much worth supporting.\n\nSecond","useful":2,"cool":2},"0M8OntJACpDYa6pUJlgROQ":{"text":"I love this idea, and the food is great. The service is learning but they are trying and i","useful":1,"cool":0},"VlYR8wg7zprQ82oX49EGHg":{"text":"I decided to try this place out today and was quite disappointed.  While I'm down with the","useful":1,"cool":0},"J0mt5sn6TL-tpC2MzexetA":{"text":"Always had a great experience there- before and after the storm. Have not had anything bad","useful":2,"cool":1},"nbKLLbefB9BwrRVXCe2ENw":{"text":"We were greeted nicely upon entering. It is an open\n airy and comfortable feel. The food w","useful":0,"cool":0},"VknbEs5fAHZyDdAyYOBKrw":{"text":"I'm so sad that we didn't get to eat here. We were quoted 15 minutes when we arrived aroun","useful":0,"cool":0},"zvVtFR7rH32gseCP_ffzwA":{"text":"Love this place! Great cause too. I wish they would extend their hours, but we went for lu","useful":1,"cool":1},"HhK9-BD0tTf7Jw_no1vSeQ":{"text":"The concept is great.  I went to a similar restaurant concept (helping street kids learn s","useful":3,"cool":1},"iGzfEBxxcV_DAayE6R5Gzw":{"text":"GREAT food!  The best food I've had in New Orleans!  Far better than any of the name resta","useful":1,"cool":0},"zpEUboQEfkxUPzJ1qA_Pwg":{"text":"First time to New Orleans, and I decided to visit a colleague of mine and take her to lunc","useful":4,"cool":1},"M9b6jucA9r9Gvi2Z-SRxqA":{"text":"The Fried catfish with crawfish sauce was excellent.  The dessert special today (Thursday)","useful":0,"cool":0},"D_fFs2M-ASY1-qTua-MJMA":{"text":"It's been a while since I came here, but I do remember the food being quite good, although","useful":0,"cool":0},"FfdmvGS3LbNJ3-G-bL5L1A":{"text":"If its possible to get away from the quarter or magazine district, please visit Cafe Recon","useful":1,"cool":1},"yaCxGmlVnr-EfGyA2m8prw":{"text":"This place was spot on. Service was excellent. Food was delicious. I had the southern clas","useful":2,"cool":0},"ylyg4Q0eTyGbEZMOxjqyFg":{"text":"Went here for a private wedding dinner, and the food was fantastic, and patio was lovely. ","useful":0,"cool":0},"gHTwuwHhUNtLlS9xlDLguw":{"text":"There is no better culinary service to our city than Cafe' Reconcile's looking forward per","useful":2,"cool":2},"kIMQiGNycPwMQ1qN8kevTw":{"text":"Cool atmosphere,  it feels like a restaurant that would fit somewhere in downtown Chicago.","useful":1,"cool":0},"Su51ylf2gCqAivIpK7-Jtw":{"text":"Enjoyed the food fest desert tasting. Beautiful restaurant and great service. Love the mis","useful":1,"cool":0},"wumaDfzujIWuP-DAae2kVQ":{"text":"This was a complete delight from the moment we walked in the door. The service was friendl","useful":1,"cool":1},"7PEc0lkyYX2fHXE94KqoDA":{"text":"This restaurant is a great community idea with equally as good food for a nice price point","useful":0,"cool":0},"5qLvEDYYn5tFIPhv-qW86A":{"text":"I wanted to try Cafe Reconcile because it's close to where I normally stay - St. Charles G","useful":0,"cool":0},"Qt2_6YASQqhlGw23jMZ13A":{"text":"DELICIOUS! \nRecently stopped in with coworkers, and we enjoyed a great lunch. Service is t","useful":2,"cool":2},"cJBTpoxWfaklVenZ6-TJzQ":{"text":"My family and I love this place when we visit Nawlins. What a genius cause Reconcile stand","useful":2,"cool":2},"tUpLBDbmLpo8RZz-0Ru8HA":{"text":"So grateful i was able to have lunch at Cafe Reconcile. I the gumbo was delicious, but the","useful":0,"cool":0},"ODZ7Td0tzxFp9hz8pj9URA":{"text":"Great food - great mission - our group was totally pleased.  All the desserts were great, ","useful":0,"cool":0},"XGA1GOVlS0PMRrGYVbS5KQ":{"text":"The Fried Shrimp Po Boy w/ Florentine Sauce - I got here was like no other. I could have e","useful":0,"cool":1},"LdCpIcGh1kq0qT8r90xndg":{"text":"In on a Five Star Spree I must say. Everywhere I have been for lunch has been so fun and f","useful":5,"cool":2},"xO7sh_pOATm82E4qMjwI_Q":{"text":"BLUF:  Great place in all aspects, especially in its heart.  Good atmosphere, good cliente","useful":0,"cool":0},"4ZqMWHfZ8ofxk5_dEYEkYA":{"text":"I love the concept- an organization with a great mission serving young people in the NOLA ","useful":1,"cool":0},"ddP35-1WWOg9HzbSP1naww":{"text":"Went here with my dad in a week day afternoon. Surprisingly there was a parking lot so tha","useful":0,"cool":0},"1H-LHDx8g9k_LIbeuJZBzQ":{"text":"Oh my goodness. My wife and I went for a late lunch and it was so worth the trip. Take tim","useful":2,"cool":1},"IYvLbsvPxWL5LAsCQbiulg":{"text":"I have been wanting to go here forever, especially since it supports 16-22 year-olds to le","useful":2,"cool":1},"S1ZqjnSpQUmZlDFrFl9Rbw":{"text":"Go.  If you are in town go support this amazing place!! You won't regret anything you eat!","useful":0,"cool":0},"zfOrBr7LYWm8x5fX33IN3g":{"text":"I would have given my experience 3 stars if it read something like \"could have been better","useful":2,"cool":1},"n9oL7NrJ0lKtUVmmYNi6bA":{"text":"I needed a quick early lunch before the Lafayette cemetery tour. After a quick search on y","useful":2,"cool":1},"CjhH2kjccTJ36vtpG2EtAA":{"text":"If you are in the area, forego the urge to have yet another meal in the French Quarter or ","useful":2,"cool":4},"QeaJK4OJWyAf6GT1hVTXGw":{"text":"Great concept, good food, fantastic prices, but the staff is a bit inexperienced - I think","useful":0,"cool":0},"A1yQrLb0KJ6qnscwIKujyg":{"text":"This place has some of the best vegetables of anyplace in NOLA.  I really love the mashed ","useful":1,"cool":0},"i35hwTn1NF3L1L97-4UtZA":{"text":"Rice and beans were amazing. Very friendly staff and cool atmosphere. Definitely recommend","useful":1,"cool":0},"kRQBP0iBo5_t0IzSjgPoow":{"text":"Great place.  I've gone here post-Katrina.  And they give you a lot of food for a very sma","useful":0,"cool":0},"Vg_QWSwnEcGxuXeu80bnrA":{"text":"Went there for valentine's day brunch!!!!!!fabulous place... food was excellent money well","useful":2,"cool":0},"LUwwrFZwohW8tzXyJPBTug":{"text":"Excellent food and service.   Worth the trip just for the bread pudding!","useful":0,"cool":1},"rJk1t6siQaNsryIJpTNGRg":{"text":"I ordered Chef Eugene's turkey necks (an appetizer special), a side of mac n cheese, and a","useful":0,"cool":0},"sMfQ3lD-8SYKDtZ1uE_W7A":{"text":"The concept for this restaurant is wonderful. I went to lunch and was told the work that t","useful":2,"cool":1},"_2A6-Wct9OeynQxA78Hafw":{"text":"Food with a mission. \n\nThis is another favorite haunt. Such an awesome concept - culinary ","useful":5,"cool":1},"4RYlkSTnPFVJWAMWimgQpw":{"text":"Great service.  Great food.  Great cause.\n\nThe food is traditional New Orleans comfort foo","useful":0,"cool":0},"xAJI1wapE2ll1CF5cnZ-bg":{"text":"Great spot on O.C. Haley. Had Poboys with a side of green beans. Amazing. Love the idea be","useful":0,"cool":0},"qg-yeQz-wBPwiSG_fixJYA":{"text":"This is an amazing concept of taking community youth and giving them a skill! The youth co","useful":0,"cool":1},"fX62mly5xI3H1-BcsYMX4Q":{"text":"This place is one of the most unique cafes in New Orleans. If you are visiting from out of","useful":3,"cool":1},"C6qcsETTEZ4h_9aGA6zg5w":{"text":"Their mission alone is enough reason to give Cafe Reconcile a try. Such an awesome communi","useful":3,"cool":0},"Lb2Ni9TlG5qjWuLhcMgkIA":{"text":"Finally made it to Café Reconcile which trains at-risk youth to work in the hospitality in","useful":0,"cool":0},"iFihCmvtASLVjY8CrIoQ5g":{"text":"The catfish, greens, and macaroni and cheese were delicious. Greens can be too vinegary or","useful":1,"cool":0},"RbHx_yjUfQDG-ABewsKk8A":{"text":"Jonshell was the nicest waitress! She has the best smile and was friendly and made our bre","useful":0,"cool":0},"rUign_RFPYWs4g7tVDWjog":{"text":"Awesome place. Great food, great people, really great mission. Strongly suggest the shrimp","useful":0,"cool":0},"bGrNXi8Uu-AZdjrXkpB4Zg":{"text":"A gem in an otherwise decrepit little area called Central City, reconcile serves normal di","useful":0,"cool":0},"RrXK8SMQItP9bP0r57cNWA":{"text":"A place to get a stick to your ribs meal and a very reasonable price and help some kids ou","useful":2,"cool":1},"sB0zYd_rgSza3fVBvkb7dg":{"text":"VERY good food.  But keep in mind that this restaurant is operated as a training place for","useful":0,"cool":0},"eU9a-GNpWmKuYaYK4e0aXQ":{"text":"This place was not on my radar but running btw mtgs ran in here for lunch. Gumbo was excel","useful":0,"cool":0},"7ZcZCfkwH26KwwVZZwPVLg":{"text":"I wasn't sure what to expect from this out of the way restaurant. On a Friday lunch time i","useful":3,"cool":2},"OU3uNg551F_EV3XiurhaCA":{"text":"Excellent food excellent service highly recommended you won't regret it trust me! Amazing ","useful":0,"cool":0},"IKywKQGfVoCSLt23nIrUHA":{"text":"SOME GREAT KIDS: sounds schmaltzy but I feel good taking part by dining here;\nWHY BUY FAST","useful":5,"cool":3},"l_UgIN02asTmVOnfTZmPmQ":{"text":"Hate to do this but quality has really gone down since the last time i was there....\n\nI wa","useful":7,"cool":2},"dpIWuh3sjvZsj9V6ZEGGxQ":{"text":"Go to Reconcile for lunch!! \n\nNot only is the food great (bread pudding was AMAZING) and w","useful":2,"cool":0},"oaQ0dL8rwvpF95XseQjSwg":{"text":"First off, I have to say that I love the mission behind this restaurant. It is super admir","useful":1,"cool":0},"RBNtqtg5wO-3dUcymnWNLw":{"text":"I've been working across the street for the last two weeks and have been taking advantage ","useful":0,"cool":0},"lIKy3MGDSt37KHGh0HN_Fg":{"text":"Man, man oh man, this place has been the best restaurant we have been to since our trip to","useful":0,"cool":0},"6b2N9D-E6r3X60Owedl_Xw":{"text":"I am giving 5 stars solely based on the organization and what they stand for. Their food w","useful":0,"cool":0},"YuaGT3YZgYUp5_nTkqCQkA":{"text":"This review is for the location as an event venue.  I was really surprised about how lovel","useful":7,"cool":3},"uMU6AG1zTQ5pI22oTJkyNw":{"text":"This is some of the best food in New Orleans, Even the simplest thing--- burgers and fries","useful":2,"cool":2},"bwWk8nkEwzYE1HxeJj1UzQ":{"text":"Saw this cafe across the street from Big Sexy Neon and the Fight Club when we had to bring","useful":1,"cool":1},"Jd1qBMay-DPUGfJnAi93Sg":{"text":"Stunning food. It will now be our go-to lunch spot since we live so close and the food is ","useful":1,"cool":0},"Qt4DwAPOnMQsCXZ2jFYC0w":{"text":"Please don't pass this place up if you're looking for lunch in the central city area! Quai","useful":3,"cool":1},"5QvzZUi-xlwV-nxcFT0uGw":{"text":"Oh the joys of Friday lunch at Café Reconcile! Why, you may ask?! Their special is Smother","useful":4,"cool":3},"cHuF1KS5paf5ZwHUH4jtVA":{"text":"This is the bf's favorite place to eat lunch in the city. Many other Yelpers have discusse","useful":2,"cool":0},"42B2qSbJmeUJLl6Gun7oyg":{"text":"I had the fried green tomato sandwich and gumbo they both were so delicious. The staff is ","useful":1,"cool":2},"OlNrKekRf0CuUZsqP5uUjA":{"text":"This restaurant not only has great food at a great price but also supports an amazing caus","useful":0,"cool":0},"uW7Oor6MWFd86rLszncEOQ":{"text":"This place was fantastic for a business lunch. The story behind it is awesome, and the foo","useful":1,"cool":1},"igVgGdhXGvYxim_WXbwx6g":{"text":"This was one of our most surprising NOLA eats.  We were recommended the eggplant Napoleon ","useful":2,"cool":2},"HwSKvC7SrevO65sgawdJew":{"text":"This place is amazing!!! The concept, atmosphere, staff, and students all make this place ","useful":1,"cool":0},"oxBn-EdtEJHZsVa0tUN-PA":{"text":"Made our reservation before our trip & glad we did.\nGood customers service abd food was de","useful":1,"cool":1},"TDlgQC6jfn8gntzrMjP1XA":{"text":"While the food is excellent, the young staff is welcoming and hard-working and the youth e","useful":2,"cool":2},"_ea_ZcERMuTc0_Gk0rcnBQ":{"text":"I love this place.  The food is good neighborhood Creole quality, reasonably priced (+/- $","useful":0,"cool":0},"m-nJIvBizYI3aFgPO_DtIg":{"text":"Love their mission and the opportunities they're providing to young adults! Friendly and c","useful":0,"cool":1},"j3u-AfWTnevSigqrmU1DGg":{"text":"Great food for a great cause! Cafe Reconcile is a culinary school/restaurant run by Jesuit","useful":1,"cool":0},"z5TlP_fdw2fSLQMSNlKRCQ":{"text":"Great food, try the pastalaya and the banana bread pudding. The waiter was very attentive ","useful":0,"cool":0}}