{"laD_q-cIhhPxUIXxaYe7PQ":{"text":"Great Vegetarian Choices, Addictively Delicious Hummus\n\nGreat Middle Eastern gem on Carrol","useful":0,"cool":0},"jQLvHv6kA3MAmWsNDlzdJQ":{"text":"Lebanon's is one of my favorite spots in the Uptown area of New Orleans.  Good prices and ","useful":0,"cool":0},"VS3ql_rZxChe0NL0OOrNsg":{"text":"I usually come in here for takeout. The atmosphere is nice, and the wait staff are profess","useful":0,"cool":0},"2EieFSw49Vh_XlnaBMQs4Q":{"text":"We could not say enough about Lebanon's Cafe!  Absolutely loved this place!  We visited it","useful":2,"cool":3},"l_mwwQlWztOKS7c8DK86BA":{"text":"This is my favorite restaurant in New Orleans/most places. The food is always delicious no","useful":0,"cool":0},"b2rI-f_XIZuZGvGhcxz8Rw":{"text":"It's simple, delicious , and FRESH...(the most important to me). It seems authentic to me.","useful":0,"cool":0},"wpqPm7og9vgb3b1DnuyGGw":{"text":"Have never gotten a bad meal here in 15 or so years. Always fresh, flavor is consistent, a","useful":0,"cool":0},"E9YelUrI5uUheS5Qw0XRHA":{"text":"I ate at Cleopatra's last night and though the lamb kabob was delicious, the baba ganouj l","useful":0,"cool":0},"I4r5oGJsLZuMi213uX7qDg":{"text":"Eat here almost any time I'm in this side of town.  Hummus is mild, creamy, and delicious.","useful":0,"cool":0},"68ocQt_Cf_-Jh4K0cbQB8w":{"text":"If i could eat here for breakfast lunch and dinner i would.  Best hummus best falafle best","useful":0,"cool":0},"HOf4YgJfk1SXQKV5WeP6lA":{"text":"Lebanon's Cafe was my choice for dinner a few nights ago and to say the least, I left a ve","useful":0,"cool":0},"HxVT8RSZFF6FvsGjHcjADA":{"text":"Lebanon's is in an area with various types of restaurants surrounding it, so it has to be ","useful":3,"cool":1},"M-_c18lJl2y-ImZRl8o4gA":{"text":"Decent food. Big portions and good prices. I got the chicken shawarma that came with hummu","useful":0,"cool":0},"CDmROcMXX1aC-lBh0MG8-Q":{"text":"This was my first experience with Lebanese food and I thought it was fantastic. We went wi","useful":1,"cool":0},"1mc9ZJ9WJBEazCzd4bBiRQ":{"text":"Lebanon's is as good as Mona's and a far superior choice over its cousin Babylon Cafe a fe","useful":0,"cool":0},"uZBi6gtyqsbakZgp7o-a7g":{"text":"Love the beef schwarma and falafel!  The hummus is perfect with just a touch of acidity.  ","useful":0,"cool":0},"4fUXalvGhZJQY5FH_hS_7Q":{"text":"I go here about once every two weeks and love it. Great food, good service and pretty chea","useful":0,"cool":0},"ZNVVVn3rFLoTNFU5b6AQdQ":{"text":"Best felafel in town. Best hummus in town. Great service, easy atmosphere. Walking distanc","useful":1,"cool":1},"oBmdKXGp777qYAc_K99UAA":{"text":"This was part of a three-part weekend adventure into NOLA's Middle Eastern offerings, and ","useful":0,"cool":0},"7hGEsNiizvFMrud-BbM2tg":{"text":"This is a great place for your first foray into Middle Eastern cuisine! I was absolutely c","useful":0,"cool":0},"hp7DuEmUKbgj6y8xjp-T_Q":{"text":"First time here and it was pretty dang good! Parking was pretty rough, we had to park a bl","useful":1,"cool":1},"UF1-fZAfpwYqATOczPlh3w":{"text":"I had take out. My friend had the chicken shawarma and I had the chicken teka. Everything ","useful":0,"cool":0},"98v1nRJAgK7h5lzyPd_pzA":{"text":"This is my favorite place for Mediterranean, I just like the way it's done here. The facil","useful":0,"cool":0},"gkYCkk7N3LIrArpXDBUy7Q":{"text":"I really like Lebanon.  One thing that I can definitely say is it's consistent.  That's im","useful":3,"cool":1},"nWH9C3C3Gu7ymsgiuxtrpA":{"text":"I've eaten at Lebanon's about a dozen times since moving to New Orleans in August! It's ve","useful":0,"cool":0},"P7uI714IzCC1f3kQlTJQBQ":{"text":"Very very good restaurant. My best was the Kebba and the way the cook the lamb kebabs... E","useful":0,"cool":0},"EVNvrlXEeEmQulRAgmg7uA":{"text":"Beyond amazing food this is the best food in New Orleans.  We were so glad that we saw thi","useful":0,"cool":0},"xCpUjb35LEwqk7GiZNbUUQ":{"text":"Really great flavors and atmosphere. Must try the Lebanese tea to drink and the gyro. Meat","useful":0,"cool":0},"mFskRyQsEVWJ_PsYS4N8tA":{"text":"This place makes me the happy. Their food is delicious, the prices are decent, and you get","useful":0,"cool":0},"_LflXUGixRR5BYND6r4jGg":{"text":"Lebanon's got value going for them, that's for sure.  For $12-$14, you can get a large chi","useful":0,"cool":0},"kebkqfS0lbVTXt9jdReBvg":{"text":"There are some restaurants that you go back to and you remember the food being a lot bette","useful":2,"cool":2},"KTGV6euHbdMuGRRgVsP9zg":{"text":"I ordered the chicken schwarma plate, the food was hot but the hummus was a little tangy, ","useful":1,"cool":0},"R2xtw4caAJvPA_ewkXKORw":{"text":"Recently, I decided to stop going to Mona's because I feel the quality of the food is decl","useful":2,"cool":1},"JdjbL8O7IcJ-7b9ApwD34g":{"text":"I love Lebanon's. I have definitely been converted from a Mona's regular to a Lebanon's re","useful":2,"cool":1},"Yb4M1Zpz6HhmqgwF72wJBg":{"text":"Went to Lebanon's again a few nights ago. Very good as I remembered. Salad was particularl","useful":1,"cool":0},"udyjYGYqUl8yVZzGXdaIEA":{"text":"I wish I could give this place 10 stars. I'm not even joking.\n\nI don't even live in New Or","useful":0,"cool":1},"M1ckCrUPVdPrg0j2mppNeQ":{"text":"FOOD? \nThe menu offers a wide selection of options, so depending on what you're in the moo","useful":1,"cool":0},"v9gtufJQucyA3rfFCGAQgA":{"text":"Nice Place, Mediocre Food\n\nOut of curiosity, I went here after looking over the menu onlin","useful":1,"cool":0},"kgTCDXzcdVSVe3MbVszuLA":{"text":"This place is delicious. I didn't know what to expect since I never had Lebanese food befo","useful":0,"cool":0},"uH1ZPU-HwaQLvynxlRGtFA":{"text":"The best hummus and middle eastern food in NOLA by far. The chicken is amazing. Hummus is ","useful":0,"cool":0},"_x_GORnFpKIZLbZw2okVLg":{"text":"I always leave this place feeling satisfied and full. Really, it's one of those places tha","useful":1,"cool":0},"r3adHjZchUwr8fXudaX77A":{"text":"Another happy face and all it took was to get the heck out of Vierre Carre away from the r","useful":0,"cool":0},"-GGuQfY44o25BJG8MDz1UQ":{"text":"The kabobs are great, as are everything else I've tried. I also really dig their Lebanese ","useful":0,"cool":0},"HapTcM0DAxXtJU3jWc-oBg":{"text":"I love this restaurant do much! I always get the chicken swarma and hummus. The Lebanese t","useful":0,"cool":0},"NBKvavNTYv50XZAQfR-kRA":{"text":"My first visit with a group of friends and we all really liked everything at the table, an","useful":0,"cool":0},"6vnbXh8IrGSwbJo7tvhrFw":{"text":"We loved the food here so much, we came for lunch two days in a row. And that's a lot to s","useful":0,"cool":0},"rDtv9xB6dc0y4XmDWZAVHw":{"text":"I rarely write reviews especially bad ones but I have to put this out there - the service ","useful":1,"cool":1},"LcYwBrGsK8JedNnIMypHlg":{"text":"This was my first experience with Lebanese food and it was delicious. Their homemade hummu","useful":0,"cool":0},"RxsjCcm7Jg_I8_YyBfGsqQ":{"text":"My husband and I tried this place for the first time today and it was AMAZING! We absolute","useful":0,"cool":0},"E7bioYnCqxCGSnGRuQ1RFg":{"text":"Falafel is really good, not too bitter, and the Lebanese iced tea is a real winner. Who kn","useful":0,"cool":0},"Aoc41vesLBtfX-WeCQmg8Q":{"text":"Take me back to Beit Sahour and Bethlehem in the Westbank! These folks make home made pita","useful":0,"cool":0},"UsymHkWTCeBRueb7Y1fk6Q":{"text":"One of my favorite cuisines at its best.  Lebanon's came recommended after a tough day of ","useful":0,"cool":0},"CEbEiKLatQRpPaTZMU8Spg":{"text":"Best Mediterranean food in NOLA. This is our go to lunch spot.\nMy wife isn't an adventurou","useful":0,"cool":0},"2W2uOolVbf0z0zmjHrYTPw":{"text":"Food was delicious, a reasonable price for the amount of food they sell. Service could've ","useful":0,"cool":0},"spnIkJITjyopDzu_fAH0LQ":{"text":"Mediterranean in the city!  The eggplant sandwich is just absolutely delicious! My husband","useful":0,"cool":0},"YoBHMdcW4vZlt2K5DxvP4g":{"text":"Great food!!! I'm a regular customer and dine here quite often. It's always my first choic","useful":0,"cool":0},"M2PmebgYDEN-Xn8VYN3-vg":{"text":"I moved to NOLA from NYC, and one of the (few!) things I miss about New York is the numero","useful":0,"cool":0},"Hjh6a36MBoOkXLuaTvxn2g":{"text":"Can't beat this place for quality of food and the cost!  I've visited nearly every major c","useful":0,"cool":0},"lmWFXr_KzOAWhWGU6zQoNA":{"text":"Awesome food. Every time!  Their chicken kabob is marinated awesomely and so very moist.  ","useful":0,"cool":0},"N9cHolisLdonnu4EHS2xJg":{"text":"I've been going to Lebanon's for over a decade. I LOVE the fact that I always know what I'","useful":0,"cool":0},"JXWdohCU0R-C5THTcSbznA":{"text":"Who knew New Orleans had GREAT lebanese/middle eastern food? Not me! This is a great place","useful":1,"cool":1},"LA6rhtKE0weDDlPU-vM8YA":{"text":"I don't know if it's the nostalgia of the places I ate at in Greenwich Village thirty year","useful":2,"cool":0},"rEXCIBuvIUfmgnS5nNOoPQ":{"text":"This place is a favorite for our family. The service is good. Food is consistently delicio","useful":0,"cool":0},"RAKJHxkQqLaaxGyKtCJ-Kg":{"text":"I've had their falafel several times now and it's always very dense (as opposed to Mona's,","useful":1,"cool":1},"L9ub7z1mRGjYIeipkhHo5g":{"text":"I have an interesting relationship with Lebanon's.  When the food is good, it is great.  T","useful":0,"cool":0},"0C1zvrI36gn2dOVt6d-VxQ":{"text":"Simply put, some of the best Lebanese/ Middle Eastern food in the city. I've never left di","useful":2,"cool":0},"cWwn0kuMnfstBe55zhNYDQ":{"text":"Every time I'm back in NOLA I have to come here. The food is amazing and I think it's the ","useful":0,"cool":0},"LhMHgDLEhs54yFPZgKgjAA":{"text":"A decent Middle Eastern restaurant (I wouldn't say this is \"Greek\" food) with very flavorf","useful":0,"cool":0},"hpDLk_-depO9UdLWfJaj8g":{"text":"I've been here twice, it's a neighborhood restaurant within walking distance from my place","useful":0,"cool":0},"rWzhrO1q1dZVkK6hdXL68Q":{"text":"The atmosphere... That, and the food, obviously, is why I come here.  They have 7 tables o","useful":1,"cool":1},"a_90_RziQvyWGW7RgFBHSw":{"text":"Always good, this is one of my neighborhood go-to restaurants.  Their approach to gyro mea","useful":1,"cool":0},"8CLSFsBOKuPoe1rGJTk84w":{"text":"I really don't understand why this place was so many positive reviews. Perhaps because the","useful":0,"cool":0},"pkELu8ExuZBAlKWTHoBWiA":{"text":"The owner is a huge jackass. First he wanted to charge my friends $2 for extra pine nuts i","useful":8,"cool":1},"CJC8GZ2AAyajkUzWS5EJ3Q":{"text":"Excellent food all round, but if you like your meats on the rare side of medium well be su","useful":0,"cool":0},"Vrv6r8dmeUgDIwthFhZoOw":{"text":"This place really did not cut it for authentic Lebanese food. We visited around lunch time","useful":0,"cool":0},"U9r10xyWb9bkW2rFE1Z5dw":{"text":"Food was great! Had the combination plate with beef, lamb & chicken. Will be back soon. Sa","useful":0,"cool":0},"Jyp0mDyFJnEhzbsSkiW1Rg":{"text":"everything was fresh, tasty, perfectly seasoned. the chicken shawarma platter was PERFECT.","useful":0,"cool":0},"s2DzgjBvz4Nn0EHICtfj0Q":{"text":"This is my favorite Mediterranean restaurant in New Orleans. The hummus is perfection- cre","useful":0,"cool":0},"TBmKBwk68BKJVVzVYpuPnA":{"text":"Holy Falafel Balls!!!! I write this review mere moments after the celestial deliciousness ","useful":3,"cool":1},"0YKIjmXQSvVPV3v0oO9sNg":{"text":"Best falafels ever! Awesome, juicy chicken. In shock and awe! Definitely will return soon.","useful":0,"cool":1},"nbp-lNpVme6cGLJgq2GA-A":{"text":"Lebanon's has always been a step above the other middle eastern in the area (all of which ","useful":2,"cool":1},"s-l7U8E-GIGG6elS_JmAEA":{"text":"Yummy! The food here is always great. The standouts for my palate include the chicken teck","useful":0,"cool":0},"958G_f-bJGkhLkvWqKg8qA":{"text":"great food! nice ambiance! loved their daily specials... the samosas!\nwe had falafel platt","useful":0,"cool":0},"GvDlwzb-C6Nyx2PxrYpw7A":{"text":"Food is fabulous. I'd come back to New Orleans just to eat here. Had the lamb and beef gyr","useful":0,"cool":0},"WqCNSTGpkQSAhaRQC_CW7w":{"text":"Lebanese tea w/ pinenuts!\n\nThis place does a great business and really has that uni feel t","useful":0,"cool":0},"6ppTMcWFoSEvY6xidcQQkw":{"text":"great food. I had the shrimp kabob plate with rice and salad. 8t was awesome,  I even had ","useful":0,"cool":0},"0zE09-K8PlGZA3juYZM31g":{"text":"Great food and service. I've been tons of times and I've never had a bad experience. The f","useful":1,"cool":0},"1mIO_Y0AapQb2JnpxKgT3w":{"text":"Must try: bathenjan dip, lentil soup apart from very flavorful entrees. A must if you are ","useful":0,"cool":0},"avTKqyue6a_X_0F0TGSI9w":{"text":"I never any complaints about this place. If you want some good Mediterranean in New Orlean","useful":0,"cool":1},"rJYYRIN5OIO7viaFUNoLVg":{"text":"By far the best lebanese food I had while in nola. The kibbe was perfect. Pretty decent gy","useful":0,"cool":0},"vs04wm9mo_3dyL4b7TSWIw":{"text":"First time here for a late lunch. Got outside and would not acknowledged until 10 minutes ","useful":1,"cool":0},"7FDQkNjUfphKSpNC-mAYDw":{"text":"Best Lubin I have ever had beyond my meema's. grape leaves were good as well.  I didn't ca","useful":0,"cool":0},"bIU85WkVZv4KzcyplpprWA":{"text":"I've eaten at Lebanon's several times, but this is my first review.  I ate lunch here with","useful":0,"cool":0},"6bPdqJ_1hYpvHlFu0BMOqg":{"text":"The lamb kabob is tasty. But the server had really bad attitude. I will suggest the food, ","useful":0,"cool":0},"YmSf9kIp5RZQsIDf-Q24cg":{"text":"It's an interesting restaurant, and I want to do a deeper exploration of the menu.  I orde","useful":0,"cool":0},"j9eXW60SRUo6lAc2U4AviQ":{"text":"I remember the old Lebanon's location in a tiny corner grocery store - this one is totally","useful":0,"cool":0},"zc0C-MnYBjtoKUnHeDnNBg":{"text":"Awesome. I am highly satisfied with this place after eating in the French Quarter the last","useful":0,"cool":0},"ewRJ4c4gwLDYsyiH1_uYLQ":{"text":"The best hummus and lamb meat. Literally my favorite dish at a restaurant. The warm juices","useful":0,"cool":0},"pcOfrKRLAVT2MeQOEOpENQ":{"text":"Had the lamb chops and a chicken shawarma plate...  Nuff said.  Truly unbelievable flavor.","useful":0,"cool":0},"QPCHy1QXQ8WEQ-ajJY1HQw":{"text":"Awesome food and service. Loved the hummus, please don't miss giving it a try. I will defi","useful":0,"cool":0},"PpsVEtJ-riJ9fF0cs4hXdw":{"text":"Delicious Mediterranean food for cheap prices. Sounds good, right? Then check out this pla","useful":0,"cool":0},"TSoalejN9UfDLyYl5FKurg":{"text":"My coworker is a former health inspector and recommended this place when she over heard me","useful":0,"cool":0},"gapfDzXN_UCq2LbYiBLcfw":{"text":"A lot of my friends work here and told me to come so I did! It was like a good food but it","useful":1,"cool":1},"9I-f4ICOyHzljX-F3Xo8Dg":{"text":"Awesome food. I like this place alot. Service is attentive but not very educated on their ","useful":0,"cool":0},"MoiQvx5m_fsbBy_vX9tx8w":{"text":"Fantastic food simply the best med food I've had since I travelled to Greece !!\nAuthentic ","useful":0,"cool":0},"PZBR3AUjXsrYf1TMlhgkiw":{"text":"Some of the best Middle Eastern food you can eat in New Orleans. I have been eating there ","useful":0,"cool":0},"sDzc20PIWFnMej_W-qU9-Q":{"text":"The food is almost always fantastic. I especially like the gyros and stuffed grape leaves.","useful":0,"cool":0},"g8WVDbbWZ6a3HoU-moxUDw":{"text":"I had lamb chops and my friend had chicken shawarma.. Chicken would deserve 4 stars but la","useful":0,"cool":0},"a4t4G7Dmb7Tb4Kq4N6JH3A":{"text":"I'm pretty obsessed with Leb Cafe. For the price, it can't be beat for Mediterranean food ","useful":1,"cool":1},"-xJ7rD9GLgbqEgBzst2ptg":{"text":"Again an awesome place for baba, hummus, beef n lamb, and chicken shawarma. In a red beans","useful":0,"cool":0},"axmNXsLkjdm_sLvwi3KFWQ":{"text":"My wife (who is Lebanese) and I came here for lunch one day expecting some authentic Leban","useful":3,"cool":0},"Uqs6Wv9Ym68lVwuFsVxsPw":{"text":"Absolutely delicious! It was my first visit so the boyfriend and I started out with the Ch","useful":0,"cool":0},"v64ki4T8AEaaSJH3qsBYnQ":{"text":"The place to go for yummy middle eastern food. Call in for take out or stop by and feast t","useful":0,"cool":0},"NdGKHE8xi2heTYyhYwBdWw":{"text":"This was a great find. Friendly service, open when other places aren't. We had the fresh w","useful":0,"cool":0},"-DPZLrtdKCSWsvSSIFGMNw":{"text":"Lebanon's is a place that I hadn't visited since before Katrina.  Friends from school orig","useful":2,"cool":1},"X0R4y9KUq6WjGYcFZGkWpQ":{"text":"Could this place get any better? Huge portions, BYOB(!!!!!!!!!) and delicious flavors. The","useful":0,"cool":0},"7kE7VGEHsaafircvxGxcYg":{"text":"Weekday lunch. Beef shawarma and hummus. Both very good. Service was good. Will go back.","useful":0,"cool":0},"AJOYA_BSWtUssrmbv_LSiQ":{"text":"This Place should have 5 stars...I eat here alot and I have ordered many things on the men","useful":1,"cool":1},"ZXGovih15E6ySfSSY3uPxw":{"text":"My favourite middle eastern restaurant in NOLA. Amazing food, excellent (happy!) staff, gr","useful":0,"cool":0},"aVLVv4WDbkf9x_RjnT81bQ":{"text":"One of my favorite spots for Middle Eastern food. I love the ambiance of the restaurant. I","useful":0,"cool":0},"eUzFZiOviQxATWHPpcezyA":{"text":"Consider me a new fan of this place!  I've driven by it, but Lebanese cuisine is never on ","useful":2,"cool":0},"qEmRbrOr9ra1opyb6B4DfA":{"text":"I loooove Lebanons. It's perfect for when you've got a big group of people or just a big a","useful":0,"cool":0},"Cy_dNRyNRsKPd6hAgkDisg":{"text":"I absolutely love Greek food. I could live on hummus dipped in pita bread alone and die ha","useful":14,"cool":10},"Z-1CcyXfSzuLIW6V5YvU4A":{"text":"Service can be sketchy at times but the food is wonderful! I come here often for lunch and","useful":1,"cool":1},"u5KESPkXWJFfhGSMzrA2PQ":{"text":"Yes...do it!  I ate nothing but this for like 2 weeks straight once.  Nice outdoor seating","useful":0,"cool":0},"3go1qBVqjfVtt0HeYvnq-Q":{"text":"Tasty local Middle Eastern food option. The food is standard Middle Eastern stuff, and it'","useful":0,"cool":0},"STTXQfxQG9ZgaEmgI4H2Yw":{"text":"We always go here when we need a Mediterranean fix. The staff is friendly, food is great a","useful":0,"cool":0},"2b7tJXnKqM6nlrkYDmp60Q":{"text":"i really don't understand the rave reviews.  this place is mediocre at best - nothing tast","useful":1,"cool":1},"sPypMOhoc7kxfSjPaXDOVQ":{"text":"My fiance and I eat here regularly. We had this for dinner just the other night. The food ","useful":0,"cool":0},"SGwo3Xg60lK67Bx7MGzrFA":{"text":"Freshly daily made . Healthy ,and delusions . Middle Eastern audience.prices are reasonabl","useful":0,"cool":0},"8D5-JOnCAYDO9TEYdSvIxA":{"text":"4/5 so so yum. yum. yum.\n\nobvi many reviews have already sung the praises of this place, b","useful":3,"cool":2},"r4xXqmiedXVh6L1xdxrH1g":{"text":"Oh my goodness !! The food was awesome and the service was just as good!! We were a table ","useful":0,"cool":0},"Cqb1GJR4k7pUWaHdKfmuYA":{"text":"This place is really good. I wish I would have remembered my server's name because the ser","useful":0,"cool":0},"8tMPhWkzA5C6oT5jiI7syA":{"text":"Excellent neighborhood restaurant. Consistently tasty and cheap! I missed this place a ton","useful":0,"cool":0},"ijr8zjmY7xhMwVqQQ0aQnw":{"text":"I love this place. I have been eating here for years and it has never lost its flavor. If ","useful":0,"cool":0},"zF-Xac7WBDLJ-G9KAlSv4Q":{"text":"This place is great. I usually have the lamb and hummus dish. It's excellent. You will def","useful":0,"cool":0},"kiY6GOk5hKd64-XmAACcCA":{"text":"Last night I was craving some falafel and lamb....So I dipped into Lebanon's Café and I wa","useful":2,"cool":3},"MjRE-56kDRjRxKTTv6-Zww":{"text":"One of my favorite places in town.  The hummus is especially delicious.  The tiki chicken ","useful":0,"cool":0},"1prVYghncwCSBFUigN6DeQ":{"text":"Wonderful!  I think this is the most consistent restaraunt in town. Everything is good I l","useful":0,"cool":0},"Fbgv68nnVniKdYnESpAiHQ":{"text":"Take out order. Great appetizers, loved kibby and cabbage rolls. Lula kebabs were okay, a ","useful":0,"cool":0},"agnYAVevK_poD_An3SavmA":{"text":"They've still got it. Big. Cheap. Don't order too much. Drink the bloody tea.","useful":1,"cool":1},"oUH4jIIQfvV2sHsYgooQnQ":{"text":"IMHO, the best hummus around.  Seriously.  I enjoy this particular spot being so close to ","useful":4,"cool":3},"Ol-gBX44vB9hxN9QoVDl_w":{"text":"I was surprised to see this Lebanese restaurant far more crowded than the Cajun one next d","useful":3,"cool":2},"0jN42nc9fi0jgt6OuB3l1w":{"text":"Hands down the best Mediterranean food in town.  Don't even bother to make your own hummus","useful":0,"cool":0},"v9mJwd0tSWH1o6ZpgJgQeg":{"text":"Best stuff so far in terms of Mediterranean food. The rose water tea is awesome! It's defi","useful":0,"cool":0},"gTFAOlDgMeU0KtRLWiPNGg":{"text":"Lebanon is good, but it's not outstanding. The lamb is and gyro are really really good, bu","useful":0,"cool":0},"jltQ-PToyGCY9CWU3BQHAA":{"text":"Lebanon Cafe has delicious food. I love how when you are finished eating your meal, they g","useful":0,"cool":0},"Ns1QifA1b_ldlQohvpWyCw":{"text":"I love Lebanon Cafe!  It is a great neighborhood joint. If you live in the area, it is a n","useful":0,"cool":0},"vt84bVoL8LQK5u59f0R7aw":{"text":"One of the bests restaurants I've been to. \nI'll advice for the Kifta kebab ;) \nThe best","useful":0,"cool":0},"eFoWdtluERbBaoabOMDlIw":{"text":"This is the only place I come to eat hummus, tabouleh, and chicken Schwarma. I give 4 star","useful":0,"cool":0},"d8Z2UvPC1uHcYmiSaBc2QA":{"text":"This place is so yummy! Gotta try the hummus. My favorite thing to order is the lamb. Its ","useful":0,"cool":0},"m_gGsp8vh7QK-oURThmC9A":{"text":"Of all the restaurants in New Orleans, this is the one I dream about 9 years after moving ","useful":0,"cool":0},"32iCJvx1ZfYt-GOJ0y2ITg":{"text":"Lebanon's is excellent food.  I've never been into that kind of food before I was dragged ","useful":1,"cool":0},"7z7etkyZwW8eQnmmyAlTCA":{"text":"Five out of six within our Lunch Bunch was new to Mediterranean food. Everyone enjoyed the","useful":1,"cool":1},"WCq9fLODhYUGWLgsV9N0mA":{"text":"Always a good place to grab authentic and quick Mediterranean. Consistently delicious.","useful":0,"cool":0},"gFdrKkrJnCNKwirmpbYfMg":{"text":"I eat here almost once a week and the food is always good. I love the veggie dinner plate,","useful":0,"cool":0},"oasYt42DdwzQDkCta5dAYw":{"text":"The best hummus I've had since my trip to the Middle East. A bit of spice with chiles on t","useful":0,"cool":0},"jlouzVvMGdXmtGWJKX1_GA":{"text":"My first full day in The Big Easy. After doing a bit of sightseeing my friend and guide su","useful":0,"cool":0},"vgE71zr_E7Cd2wx1_K8tJw":{"text":"fair prices and consistently good food: something i can say of only a handful of restauran","useful":1,"cool":0},"T-nREOS1F8ILWkq_uGCsVg":{"text":"Here's my favorite Greek/Lebanese restaurant in New Orleans. I went last night with my sis","useful":0,"cool":0},"bQnLTbBAoWdMEvAXV4Iwfw":{"text":"Delicious Authentic Lebanese food! The sautéed vegetable plate is large enough for two peo","useful":0,"cool":0},"pZmJj6-Y_2iylHHr7kMEaQ":{"text":"Out of all the middle eastern restaurants I have tried in New Orleans, this one is top not","useful":0,"cool":0},"Ueg1TaGG9IQLHZoeXDKIhg":{"text":"I loved it!!! They're infamous Lebanon tea is refreshing and as odd as it sounds they have","useful":0,"cool":0},"MPNNmPr-ZHui2IE1BqQhCA":{"text":"If there was a rating system on customer service only, I'd give it a 1 star. I'm a regular","useful":0,"cool":0},"WOi23xodvD0j49g-l1dVQg":{"text":"Normally my go-to place for Lebanese is Mona's or Pyramid, but one afternoon I decided to ","useful":2,"cool":0},"Q1YubLGTUjhu6QoEg_Tenw":{"text":"Lebanese Tea was awesome!\n\nFood was very tasty, the Gyro and the Chicken Shawarma were leg","useful":0,"cool":0},"QJghoPLxj2QNyQg1Kwm0Rw":{"text":"This place is great and is a favorite among my friends and I. Service is always quick even","useful":0,"cool":0},"pqRlJyMTn5hHX_enHDIz4A":{"text":"My family and me eat at Lebanon's Cafe every time we visit New Orleans. In a town with a h","useful":0,"cool":0},"zmrGC1eYCXi-nHd7tTp83Q":{"text":"I'm upgrading this to 5 stars because they just constantly deliver good, cheap food. Large","useful":2,"cool":0},"puz2qghgFjVUPSuaRZhqzA":{"text":"Relaxing neighborhood lunch spot.  I am obsessed with the Lebanese tea, especially on hot ","useful":0,"cool":0},"e9k6rMOMCwYhEZFDpP25EA":{"text":"One of my favorite meals in New Orleans.  We went for lunch and sat inside. As is common i","useful":0,"cool":0},"Zs_0g0GQLinC1Pb6iJFlxA":{"text":"Yummy!!  \n\nI had the Chicken Shawarma, and it was great!  The hummus is excellent, very ve","useful":0,"cool":1},"ITaV2Jg1RZqIpwUBYYg8Zg":{"text":"I have lived in nola for a year and a half and my boyfriend and i are addicted to the gyro","useful":0,"cool":0},"FkdvJWNYDp3hq1cavD6jbg":{"text":"I've been eating here on and off for 9 years, and I've never had a bad meal. I brought my ","useful":0,"cool":0},"GNb8Vt_qnt6e-LmJvJQQQQ":{"text":"Really good food! Quick service and it is a large portion for the price. Worth a visit if ","useful":0,"cool":0},"rd_BH0l-9RGlWQCnltuozQ":{"text":"Stuffed Grape Leaves were divine, pita fresh, salad flavorful, and these beautiful little ","useful":0,"cool":0},"7IS1OigcwruqfRhiqRJMgQ":{"text":"This place is pretty stellar. I just think that there is something to be said about a plac","useful":1,"cool":0},"_JZ05yiJVCVJcoa-AI1eXw":{"text":"Best Lebanese food in Nola.  Every time my husband and I go we start with the halloumi che","useful":0,"cool":0},"cfkgUM6XluR5tMYTHYrqKg":{"text":"Very healthy Mediterranean cuisine in a fun and lively atmosphere! Right on the streetcar ","useful":0,"cool":0},"UyMd8DgyzYaxc4JSGuZZ4w":{"text":"I really don't even know how to begin. This place has the best hummus I have ever had. In ","useful":0,"cool":1},"YjPL-ECfhXXBqdOk0FPsbQ":{"text":"Honestly one of my favorite restaurants in all of New Orleans. All of the food there is sp","useful":0,"cool":0},"bj-YvZE2BF-2RK-Z0Szgcg":{"text":"I was excited to try this place since there aren't that many middle eastern restaurants in","useful":1,"cool":0},"t_DHpC4MKoCQJsyQV-0SIw":{"text":"I do not understand how this place was one of the Top Picks in the Gambits 2010 New Orlean","useful":0,"cool":0},"dR7a-spiBuTt8lXJAssuoQ":{"text":"I used to go to this place every week.  But there comes a time when you just have to quit ","useful":0,"cool":0},"5JPkfHKFstwevd5GleEMCg":{"text":"Come here for your next Greek craving.\n\nI have never sat inside when dining here so I can ","useful":1,"cool":1},"Zwp7I3rvXMmM5_3QFjhggg":{"text":"My guard is completely down when it comes to Lebanon's Cafe. Authentic lentil soup gets me","useful":0,"cool":0},"71l8IMcP6MdR42cITd98Vg":{"text":"I went to Lebanon's Cafe on a busy Friday night. The restaurant was packed, with almost ev","useful":1,"cool":1},"IkbGjp4fs1xtChGPteCnLA":{"text":"I went during the day and had a Greek salad and a meat combo with, hummus, rice and bread.","useful":0,"cool":1},"_UZUTC1BA5w8kSrLir7IZA":{"text":"This is my go to place to eat out.  I can't put into words how much I love the Hummus here","useful":0,"cool":0},"nOEayZeAIJgIDi6ncWD0Iw":{"text":"I love Lebanon's.  Best hummus I've had.  The lentil soup is freaking amazing.  Plenty of ","useful":0,"cool":0},"fsNz37hr2sKKcVg9pjQ1Rw":{"text":"A friend and I went for Lunch on a Wednesday and ordered the appetizer platter for 2, a ch","useful":0,"cool":0},"NsmHYNem3aOt0pr3wPtk0A":{"text":"I think that I might have given this place 5 stars if they still had the roasted vegetable","useful":2,"cool":1},"DGoVEhaJlgnvN2ivV0WcqQ":{"text":"Perfect !!!\nUn vrai bon restaurant Libanais comme il se doit ...\nUn chawarma simple et eff","useful":0,"cool":0},"U593QJ8mSa48uHpRb1b8Ew":{"text":"I did have a nice meal. But something just seemed not right; the meat was not what I typic","useful":0,"cool":0},"ZzKqAvlquLd5d1_YgYn10g":{"text":"The food was even better than I expected even though I expected great food.\nWe had a spina","useful":0,"cool":0},"xFyO5JcMkEbQCq1x3EM6tQ":{"text":"Great med food. BYOB with no corkage fee. Awesome tabouli. Chicken shwarma is very good. B","useful":1,"cool":0},"h7mD8u79ulevVwJrNhDAnw":{"text":"I first dined here when I returned from the Navy in 2013. I have been to both Dubai and Ba","useful":0,"cool":0},"BQOU7OGG3ILMXAlitRVgrQ":{"text":"I love gyros. There is something about that \"sandwich\" that has me craving it at the weird","useful":5,"cool":4},"Ds7MitNv8JfXCMFEKlU2mw":{"text":"Deeeeeelish!!!! LOVED IT!!! Parking is kind of ehhhhh....BUT the food was soooo good!!!!!","useful":0,"cool":0},"M4r8voi46J6iyCmHhkPszA":{"text":"Awesome.  Lebanese tea is great.  And get the chicken tekka.  Delicious and big portions!","useful":0,"cool":0},"yJRvbYfLMS8XrLR4NQGlCg":{"text":"We dined outdoors along with many other patrons on a pleasant night out in New Orleans. We","useful":0,"cool":0},"GvwzANMxf6EiDWL1T3TQDw":{"text":"Love Lebanon's Cafe! By far my favorite of the Middle Eastern restaurants I have gone to. ","useful":2,"cool":2},"5U5gUSYvhd9-Y31JyG-lOA":{"text":"The service was excellent - especially remarkable since we sat outside - and the food was ","useful":0,"cool":0},"Q5FlrljCJVLD6qRc6jjsEg":{"text":"This place is only okay.\n\nToday I ordered the lamb with humus.  The lamb was cut up into v","useful":2,"cool":1},"od7moAnKAgnyHkhW6DWTCA":{"text":"Maybe I missed something when I came here... It's decent Mediterranean/Middle Eastern food","useful":0,"cool":0},"QRCkBACqoi1m7gt-E2C67Q":{"text":"The food is phenomenal.  This is some of the best hummus that I've ever had. Very smooth a","useful":0,"cool":0},"_C1FmuZ7LkyMmS29fYFqQQ":{"text":"This place is a gem on any night of the week for any occasion. It's byob, the portions are","useful":0,"cool":0},"wdahbg3prPqvUb4pUpZMlA":{"text":"Really great Lebanese food. Ordered the Chicken Tekka, which was so flavorful and amazing.","useful":0,"cool":0},"nxSVSzVeSzy5-VUwup96BQ":{"text":"Went for lunch with a friend who frequents this place. We split the hummus which was super","useful":0,"cool":0},"-p-IuPFCr-Rj0nXirqj1pA":{"text":"This is my favorite Mediterranean restaurant ever!  I have tried to find hummus even half ","useful":0,"cool":0},"JMQtCgr1S095bJbhq78T4w":{"text":"My go-to is usually Mona's when I'm in the mood for Middle Eastern but I thought I'd give ","useful":1,"cool":0},"doGW3fgmSumg8ahHu4VHbw":{"text":"Everything I've had here is good, but I like Mona's Fattoush salad better. But if you are ","useful":2,"cool":0},"I44yRTvGx7xVMNp6T2i0IA":{"text":"My favorite place in New Orleans! I love the Lebanese tea. I had everything on the menu th","useful":1,"cool":0},"hOyghswOh5KyWSydX09BpQ":{"text":"Great food! It's definetely worth walking/taking the cab. Food was amazing -felt at home w","useful":1,"cool":1},"nlFypkC8WA9gLNlidvoLXQ":{"text":"My first time at Lebanon Cafe.\n\nAt first entry, there was no one to greet us.  We seated o","useful":0,"cool":1},"qsDVq0vNR4UVdJnYaWLUug":{"text":"A solid choice for lunch, Lebanon's Cafe has a menu that is extensive and inexpensive. \n\nI","useful":6,"cool":4},"qYVWf9Pyzy82OU-ZnXjkpQ":{"text":"4 stars for the food 3 stars for the service and décor.  Not sure how clean this place was","useful":0,"cool":0},"L_GlFuqyGJv3b4qzejTbVA":{"text":"I go here often.  Best Lebanese food in town, hands down. Everything is good, service is q","useful":2,"cool":1},"ifQ07LtdKwvTBXmP4dBz5A":{"text":"My gyro was okay, I was going to order the lamb, but the waiter suggested the beef instead","useful":0,"cool":0},"DhxJ8WEjt1EqqsJvlVZxNg":{"text":"My husband and I eat here on a regular basis by dining in and getting take out. SOO good. ","useful":0,"cool":0},"llVW8k6zL1gNGBOomq3S_w":{"text":"This place is a gift. I visit my girlfriend near by that's vegetarian. Anytime I run out o","useful":0,"cool":0},"4-_VJ89IZFb6NPQcfwlV7g":{"text":"I came to NOLA for a visit this week. \nThis particular restaurant experience was an accide","useful":2,"cool":0},"elUAfDmJPwCUJfT8ksrKGg":{"text":"Stopped in for lunch had the Lula Kabob sandwich..  One word \"Delicious\".  The sweetened t","useful":0,"cool":0},"HBXmv_nzEMG0JEZXs738DQ":{"text":"This used to be my favorite place in the city. Lately, I feel like the food taste differen","useful":0,"cool":0},"uL-zOtn-TZGZ_hURYBBYqg":{"text":"A good alternative from all the cajun fodo in New Orleans.  We had the gyro and the chicke","useful":0,"cool":1},"57NqpEQic0SLH2DZgDwMNA":{"text":"Great food! Recommend trying Rosemary lamb. Another dish that is delicious is lamb shank. ","useful":0,"cool":0},"MzaG70Dnz6I_vDKlC3_czA":{"text":"Best Mediterranean food in N.O., best value in N.O. ... On days that they're really on, I'","useful":0,"cool":0},"KSBERjdWaPYZI6s01rZOpA":{"text":"My favorite Mediterranean restaurant! Food is always fresh, hot & nicely seasoned! My fav ","useful":0,"cool":0},"nzBkT4ZL_wz1x7guJB3_Nw":{"text":"I've been going here for years. They serve, quite simply, the best homemade hummus I've ev","useful":0,"cool":0},"lbz4FCTmtSPel-7CzHmY_w":{"text":"Have been trying to eat here for over a month and could never find parking. Thank you jazz","useful":0,"cool":0},"Y2W-0g8Rc7cnsVJRB0mfHg":{"text":"I can't say enough about how amazing the food at this place is. While the servers are typi","useful":0,"cool":0},"b3g46YwmQhe6vl29iLUtVA":{"text":"I like Lebanon's. The restaurant in general has a laid back attitude but servers here some","useful":0,"cool":0},"cHhdcHVNbVT_WWPNwcjmNg":{"text":"Friends, do not pass this place up!!  It is AWESOME!  Chicken kabob plate: tasty, moist, c","useful":0,"cool":0},"oG8X_l41MdI0Hr2OseW5mw":{"text":"This is my favorite restaurant. I have never had better hummus. I always get the chicken h","useful":0,"cool":0},"mux7wouNiTfb8E2bQbJ0ng":{"text":"Absolute best Middle Eastern/Mediterranean food in the city. The prices are right and the ","useful":0,"cool":0},"VuDNuinosXxNcjeOCcqk2A":{"text":"After living in New Orleans for 8 years, I have found the holy grail of Mediterranean food","useful":2,"cool":1},"ASQmFqsm4QKw_Il52kuBQw":{"text":"5 stars for the food. \n\n0 stars for the worst service. \nWaited over 10 minutes for someone","useful":0,"cool":0},"Kmw9a_AejF4qZOW5Gql3qA":{"text":"woohoo. I need to go back to place again soon! The portion size are great there and the pr","useful":1,"cool":0},"SYOkAO6WjgqbGG5lFOYuqA":{"text":"Very good for the prices! One of the best restaraunts I've tried in New Orleans, and defin","useful":0,"cool":0},"fGkWsgn8PYTs18y94eBjCw":{"text":"Lebanons has consistently served delicious plates at very reasonable prices. They have gre","useful":0,"cool":0},"yJkSH1eA_GNe9C8dDwYCLQ":{"text":"Wonderful food for a great value.  Service is friendly too.  We usually get the gyros and ","useful":0,"cool":0},"JL5MnTZ68h5pKb5GoE4zBA":{"text":"Really great food and the best thing, it's BYOB so you can bring your own bottle of wine, ","useful":0,"cool":0},"iO3rPE1-Le9UUEW9lgmqXA":{"text":"Decent hummus- but not the best I've had.  Good amount of pita bread served with it, maybe","useful":0,"cool":0},"NdEFuN3SpciOYycn9ivYtA":{"text":"This was our favorite meal of our entire week long stay in New Orleans.  WOW! So good.  \n\n","useful":2,"cool":0},"ZP_-9PxbLHS3_R8LBQYxgQ":{"text":"I've been to this restaurant twice and each time I had NO complaint!!!! I'm new to Middle ","useful":0,"cool":0},"eBcuf9dcjVG0KmICtDIgMQ":{"text":"Great prices. I always get the chicken/gyro salad- delicious. BYOB! The jordan almonds as ","useful":0,"cool":0},"iuFkhO14nUNU3cMmEsxqLw":{"text":"This place is located off the beaten path from the French Quarter, but well worth the driv","useful":0,"cool":0},"5ibHoHAR2IQ171ox6NInhw":{"text":"We had a great meal. \n\nThe first trip to this restaurant.  Parking is the usual hassle on ","useful":3,"cool":3},"BQtnjcDpe1JltjXiB2MRtA":{"text":"Three words: LAMB. WITH. HUMMUS.\n\nLebanon's is my go-to spot for Mediterranean takeout. I'","useful":0,"cool":0},"3d1_FvTZKU_rssY-ELL0GQ":{"text":"I have yet to find another place with better hummus, including the grocery and homemade. T","useful":0,"cool":0},"tKzebSS25KcVPzXq_KBpMA":{"text":"I grew up in the Middle East and let me tell you, this place is almost as good as it gets.","useful":0,"cool":0},"JHEMdS1JLVp9NB4yT0Gk1g":{"text":"Food and humus best I have Had. Service it's not that great hence the 4 stars.\nI would def","useful":0,"cool":0},"t2GAqBEQszcVNlPZnSmzgw":{"text":"Service is sometimes spotty-- I once got forgotten after stepping in and asking if they we","useful":0,"cool":0},"PKobOGyJ4s-ZM-KSi54VKQ":{"text":"2nd time eating here & i really like their food. The servers are always helpful, fast, and","useful":0,"cool":0},"mAmReK_I2GzW7HniO6rNsA":{"text":"This place is consistently good. I order the gyro salad and Lebanese tea. The price is a s","useful":0,"cool":0},"Aw1a8N1cKk3afP77hxpNZg":{"text":"In fairness, I should probably rank them higher since I go here so often. Lebanon's Cafe i","useful":0,"cool":0},"yoplppQkZ862VoXVuS9WZQ":{"text":"I'm a huge fan of the Chicken Kabobs from Lebanon on Carrolton. I get it with the rice and","useful":0,"cool":0},"M6WZKl9YGL3x8y0GCv1f0A":{"text":"Nice place for lunch, its cute and cozy too. Hands down the pomegranate chili sauce for th","useful":0,"cool":0},"xrXeyS5u7xZQV0Mz6pG_Jw":{"text":"Best Middle Eastern food in New Orleans by far and for a long time.  Everything on the men","useful":0,"cool":0},"U-1uz1uALun1ipynrVk8AA":{"text":"Love this place! My boyfriend and I get takeout from here at least once a week. Accurately","useful":0,"cool":0},"lvI7dQAK-rObsvqVOwcNvw":{"text":"I've been going here since I was an undergrad at Tulane.  10 years later and I still love ","useful":0,"cool":0},"1Tkgg-nr-ViksahE2ymHRQ":{"text":"It's true. After hearing rave reviews about Lebanon's for months, I checked out the place ","useful":0,"cool":0},"UF-JLCT93_C8B4vM3j31bA":{"text":"If you want consistently delicious, wonderful food, Lebanon is for you. Everything is wond","useful":0,"cool":0},"YOOSTKfM1QTjIk0wOgbjyg":{"text":"Don't go out of your way for this place. The service was terrible. The waitress brought ou","useful":1,"cool":0},"CqEHcx_WCbvNp-bUZiU0Eg":{"text":"It's not the best falafel (hence the 3 stars), but it's pretty good.  The eggplant sandwic","useful":0,"cool":0},"9ruvNz7plwxPwdbmKZ0OGQ":{"text":"I usually come in here late at night with friends after karate practice and it's always cr","useful":5,"cool":3},"6snkcaVgTBd2UVmCZrXaxA":{"text":"Decent selection with below average service. The overall disinterest in the food and the t","useful":0,"cool":0},"IFQrEP4CjEz0LROoxzuENw":{"text":"I had a pleasant experience here on a Saturday evening.  My professor and I arrived around","useful":0,"cool":0},"cn6X_ZB_ZM3yCQoqiFJwRg":{"text":"After moving here in January, and thanks to the Yelpers, I found this a very wonderful rep","useful":0,"cool":0},"FwsVxUeFNu-4aJ9TsxbFPw":{"text":"Best mediterranean restaurant in the city, hands down. Large portions, decent prices, and ","useful":3,"cool":1},"TXjLeyaBhMFj5B8alwOfpA":{"text":"Pretty good! Big portions and reasonably priced. I had the gyro and schwarmma combo plate,","useful":0,"cool":0},"Fca7Z1Jro5CuW5ZOj9jjbw":{"text":"Delicious!!! We were a larger party, but waited about 30 minutes for everyone to get there","useful":1,"cool":0},"B5gzpDP6xWWHJsF3LMzSBA":{"text":"Best Mediterranean food in the city!  Service is usually quick.  Not the friendliest servi","useful":1,"cool":1},"pETQOjwbqw_q6iBkHHxHrQ":{"text":"Three years later, I feel the same about this café as I did when we first ate there.  I li","useful":1,"cool":0},"713OQPIkoXRTn2G4Wr7k2g":{"text":"Lebanon's is my fav Greek/Labanese restaurant.  However, I experienced horrible service to","useful":0,"cool":0},"KD-_wwwfov-7YWaomWXnQw":{"text":"Lebanon's is optimally situated near me as I live in Mid-City so I think I've frequented i","useful":1,"cool":0},"OrhMdNnPEb0VmiMURHMGnQ":{"text":"I do love this place. The Sauteed Veggie plate is one of the the most decadent vegetarian ","useful":1,"cool":1},"QdfJ3KMNqpkJPBmVONLLqw":{"text":"The food plates n appetizers were served hot n fresh, and quickly too.\nThe service was fas","useful":0,"cool":0},"PYcxpNLW8mMIDHq9l1Amkg":{"text":"I arrived at Lebanon's cafe just after noon. Thankfully it wasn't too packed and my waitre","useful":2,"cool":3},"xVGoIbQM7pGziRmJF1wkQA":{"text":"I wasn't feeling to well, sore throat and stopped in for lentil soup. Exactly what I neede","useful":0,"cool":0},"ulMpDS4BkwHEWe1_PiEIRg":{"text":"Nothing too special. Decent food at a decent price with sometimes slower than wanted servi","useful":0,"cool":0},"4iR51d21zLZK3zP5pxmnkA":{"text":"I was not expecting to be enjoying Mediterranean food on my last night in New Orleans, but","useful":0,"cool":0},"gOliH1S7vrikQYs1Xmzidg":{"text":"It's just so good! As a lover of mediterranean food and particularly Lebanese, I've tried ","useful":0,"cool":0},"7m3PMWxlFD82aPlcP8tTcQ":{"text":"Hummus is worth the hype! I thought it would be good but it truly is the best I've ever ha","useful":0,"cool":0},"5AJobDBAfwiHsV8pnnIGRg":{"text":"I think Lebanon's is a solid, casual dining spot that I will frequent when we are craving ","useful":0,"cool":0},"mMn4_QGUhHQFJHRukcQ_hw":{"text":"I went to Lebanon's with a friend, her mother, and her boyfriend and it was very good! \n\nI","useful":0,"cool":0},"7b4ozday9vF8B7TsA2P3xQ":{"text":"New Orleans has not disappointed on food, this is my favorite thus far. I tried the Lebane","useful":0,"cool":0},"1xtpBB05dnhjAfvPAB24nQ":{"text":"I will brook no argument over whether Lebanon's Cafe is or isn't the best Middle Eastern r","useful":3,"cool":1},"SCoqlQixlwUJxjz7qSTNvA":{"text":"My luck with unplanned trips to restaurants has been stellar lately. The food gods are obv","useful":0,"cool":0},"CiU5PfC7DpjmwOnCcIx1tg":{"text":"We had the lamb kabob and chicken kabob. Hummus is delicious!  Bring your own wine!  They ","useful":0,"cool":0},"sSdo8GsgLlE1HOICZ_rIAg":{"text":"This place is amazing. Some of the best falaffel I've ever had. The service was excellent,","useful":0,"cool":0},"amEQ4WXX9bvN_sWq8POafA":{"text":"Great food and fast service.  Can get very packed at lunch and parking is a bear but well ","useful":0,"cool":0},"bmXjPh9T-9eGhNoVqBTdBA":{"text":"Food is amazing. If you eat meat, it's tender and juicy. If you don't the vegetarian optio","useful":1,"cool":0},"gMj_MGKGopy4tqZNJ_VTqw":{"text":"I love going to Lebanon's. It's always a great time and wonderful food. I recommend anythi","useful":0,"cool":0},"SABBnnrzT_CFZDrAnd70bg":{"text":"Best hummus I've had in awhile. Perfectly garlicy, with fresh pita. My falafel sandwich wa","useful":0,"cool":0},"WFTGZ0D1OD5pPs6uRLINhg":{"text":"This place was amazing!!! The service was great! We didn't have to wait long for our food!","useful":0,"cool":0},"XDuWwd9P8BE2Aef6Vx3Zug":{"text":"Really impressive mediterranean food. Service was efficient and polite, and the menu is im","useful":0,"cool":0},"vy3RkwI-KXaeL4MVRMXtCQ":{"text":"I'll start by saying I have not really eaten much Middle Eastern food and certainly never ","useful":0,"cool":0},"Cc-rYT1TsVrwx3sfGtQiTg":{"text":"This restaurant has the best Middle Eastern food in the city. I haven't had anything here ","useful":2,"cool":1},"UPMdiRuBJDI2-WYjZPuJkA":{"text":"Good food and priced to go with portions. Sometimes when it's busy, you may have to wait f","useful":0,"cool":0},"yYoEkiopVss5IumTKolD3Q":{"text":"Amazing food, surprisingly fast. Sautéed veggie plate -wow! Actually, everything is delici","useful":0,"cool":0},"6hlCWvm2ry6RNznyhvBvyQ":{"text":"Stopped in here with a friend after reading glowing Yelp reviews and was surprised to find","useful":1,"cool":0},"kc2f-z_Kiu0gfB8cN-FKnQ":{"text":"Unfortunately I have to drop a Star. And mostly because of Service. Food is still good alt","useful":3,"cool":1},"fU2yGU9aEG_ZXhnFkX9ncw":{"text":"Hands down best Middle Eastern food in New Orleans.  Baba Ganoush and Shawarma are fantast","useful":0,"cool":1},"ugR_S8FWzJt9no1WByZA5w":{"text":"I like coming to eat here by myself. I always grab a table outside and order a lentil soup","useful":4,"cool":2},"BzauSeRMjTiYoRRMRDblNw":{"text":"Delicious food, I've never had a complaint about that!  I have gone and gotten horrible se","useful":0,"cool":0},"nF4VtOUJ6b28BwqgVfzd0A":{"text":"My first time here last week and I really liked my vegetarian plate.  Hummus, baba ganouj,","useful":1,"cool":0},"4vlNvCe5oxnnQ5KQcxU5bw":{"text":"Attention if you are a single diner get ready to be ignored.Never assume anything I'm in t","useful":0,"cool":0},"LLIoGhXRn2nLlZ1u03JKOA":{"text":"This place will definitely scratch the itch for Lebanese food.  Their grape leaf rolls are","useful":0,"cool":0},"4SjxK4Dr4fXB_lQU0I9ATQ":{"text":"I love this place, the food is great. The parking situation makes for a few headaches, but","useful":1,"cool":0},"NUXmsx1UWi9eESB5EA8kLg":{"text":"Saw this place while going to a Mexican place and seeing the crowd decided to go here for ","useful":0,"cool":0},"jA5bLsHLKx1Mfyv_m0aU3A":{"text":"Humus tastes like real humus, full of flavor.\nWe had the beef shawarma, lamb kabob and bee","useful":0,"cool":0},"BiiVWBfPbtZkdSS6iGwM1Q":{"text":"This place pleases everyone: vegetarians, meat-eaters, hearty appetites, kids, and those w","useful":3,"cool":2},"TCBCE-9YNUIb4pUsl075Ug":{"text":"A friend and I went in on a Sunday. Ordered special Halloumi plate (fried cheese and grill","useful":0,"cool":1},"cGpen4qOPhdQbUFc1oWi6A":{"text":"In the four years I lived in New Orleans, this was definitely my favorite restaurant. In f","useful":1,"cool":0},"cw2Rlx5wv6111NQB5SG2UQ":{"text":"There honestly isn't anything about this restaurant I don't like. Granted I've only been t","useful":0,"cool":0},"JMXIsfM2Khi8FeRSuppYrQ":{"text":"Ate here for lunch just today. It is probably my favorite Lebanese restaurant.  The waitre","useful":0,"cool":0},"hNDc3ZZgT08PfUJ3l64Fww":{"text":"Went with the bf Saturday night. I had been there once before with some friends and it was","useful":0,"cool":0},"Wa75o-XdXVUdiTtP1EJtag":{"text":"great food; CRAP service.  without fail.  every time.\n\nthat said, the food really does mak","useful":2,"cool":1},"18W_mHmod43VGw9e9J_SGw":{"text":"Every time I make the trek from Chicago to New Orleans, I insist on a meal at Lebanon's. S","useful":0,"cool":0},"-HgGrg2UZgKA8iELR4rgEg":{"text":"This place is great!  Lebanese Tea and Gyro Sandwich for $8 and I always want to go back..","useful":0,"cool":0},"teaSKdXzZ0Du6AifjkMS6A":{"text":"Everything was delicious, could even just live on feta, oil and pita alone! Ordered the ch","useful":0,"cool":0},"VgXNvTXk1y3G8ZybrSxdYA":{"text":"I didn't even know I liked Lebanese food until I ate here.  The atmosphere is nice, the fo","useful":0,"cool":0},"c1-z7rL5LBCRU35p_8pRHA":{"text":"The hummus here is friggin ridiculous. Legit some of the best I have ever had. I wasn't to","useful":0,"cool":1},"M_7xnNID90ShVVnm-vxIew":{"text":"Really good food, parking on the street. Must try spinach pie. Also try the combination ka","useful":0,"cool":0},"saLAlb0AjmEbHs-UJiuACA":{"text":"This is the best lebanese food in town. Staff is friendly and provide excellent service. T","useful":0,"cool":0},"ZFvhvScHjd40zrP66DhMMw":{"text":"The best hummus I think I ever had was gotten at Lebanon's Cafe the other night. The mixed","useful":0,"cool":0},"XHKSlY7xze124VEQWLG94w":{"text":"My family and I have been going to Lebanon's Cafe forever.  We used to live 2 blocks away ","useful":1,"cool":2},"6MPmeD0q20Ldz-FNOtq8sw":{"text":"I use to frequent this place often when I lived in Louisiana. The atmosphere was quaint an","useful":0,"cool":0},"2TbYTxbW_IXy9sv6jelz1A":{"text":"THE BEST LEBANESE FOOD IN NOLA!\n\nThe food is so good it'll make you wanna smack your Mama!","useful":2,"cool":2},"4yqUPVlRyDV0kp7aVkd8Og":{"text":"My favorite !! Delicious hummus and pita, perfect lamb, and the Lebanese tea with the litt","useful":0,"cool":0},"tHkt-EgvSfjwsssfu9uw_w":{"text":"One word... PHENOMENAL!  Loved the atmosphere, the service,and the food. I usually have an","useful":1,"cool":1},"kNSrkwJUrKPKEAb0CsXTVg":{"text":"Fantastic hummus and the lamb was perfectly cooked.  Dinner for two under $20 and you can ","useful":0,"cool":0},"FBWDOMUFvUMrocS5OE8r-g":{"text":"I love Greek food, but I'm curiously not a hummus eater. Everyone who I've been here with ","useful":0,"cool":0},"j6URoFxvwLVOAaCa_pqOHQ":{"text":"My favorite Lebanese restaurant in the world. From the hummus to the tabouli to the chicke","useful":0,"cool":0},"bHPim3T4sXamFE8DLNjLcA":{"text":"Not the best Lebanese food that I've ever eaten, but the best non-creole/cajun/tourist-tra","useful":0,"cool":0},"8OD5UIwaNz_PMmWwfUMiAQ":{"text":"Tasty chicken shawarma and my favourite kind of hummus...super creamy and smooth and not t","useful":0,"cool":0},"XbOZpq18rQt7XMdlUYLGdg":{"text":"Combo plate with extra hummus & the olive/pickle appetizer. A Lebanese iced tea with pine ","useful":0,"cool":0},"OKgsXeDmQSMEWbdX6Bsacw":{"text":"This is my favorite mediterranean restaurant in New Orleans. I love the shrimp kabob salad","useful":2,"cool":0},"yoEx4rB5-igGffJUrH8_Rg":{"text":"As others have said, the place is great. As a big fan of mid-eastern food, I have been to ","useful":0,"cool":0},"WzRU4A8D9GQ9OMOvK7h07w":{"text":"What can I say about this place? The food is good, the prices are good, and the decor is c","useful":0,"cool":0},"iwNpsqar6ACWmUAG7QsrPg":{"text":"I love this place! The falafel is always good and on occasion I would get the eggplant san","useful":0,"cool":0},"YgOE4t-Qn-5CkPaWFjRngQ":{"text":"We went there as a group right before they closed and seat at one of the outside tables. T","useful":0,"cool":0},"Gf9ILw72ylXkOrNhPuG-Tw":{"text":"Love their food!!! Nothing like their tea! So good and their labna and hummus and bathengi","useful":0,"cool":0},"FLaobcZ7wAto6PPktbR49Q":{"text":"Really good falafel, but pretty bad service. Our waitress gave almost everybody at the tab","useful":0,"cool":0},"H_xaDBdUYq1sYuPCfMJUiQ":{"text":"Have been here a million times, has to be my favorite restaurant in the city.  The humas i","useful":0,"cool":0},"8w22UoJqE86mxsF0ylun7w":{"text":"Lebanon's Cafe really is one of the best Mediterranean joints here in New Orleans. The loc","useful":3,"cool":1},"dP9v8s9VYIM6Gk1_roaf7Q":{"text":"Most people don't think about Lebanese Food in the Big Easy. Think again, because right on","useful":0,"cool":0},"HuQHYTEJa0ZbpBO2kr1raA":{"text":"I've been spoiled for most of my life by amazing Middle Eastern food that can be found eve","useful":4,"cool":2},"5SbytON6_KGBjHCSbypG2w":{"text":"Solid Mediterranean food! I had been meaning to try this restaurant for a while and I'm gl","useful":0,"cool":0},"OugNr7bNAqqLSzFgZblUvw":{"text":"Very very delicious. A touch pricier than other similar restaurants in the area, but not t","useful":0,"cool":0},"v1EqPpNB5aSap2N3hpKIkw":{"text":"I have never had a bad meal here. I usually order the chicken schwarma and it is fantastic","useful":0,"cool":0},"LOR0HmqdDM5e8cYx834ymA":{"text":"Thankfully I live within walking distance. This is one of my favorite restaurants in town.","useful":0,"cool":0},"H57Vvd6dla-HmoaaBBrRnA":{"text":"I've been on a mission to find all the Mediterranean places to eat at in NOLA. This one's ","useful":4,"cool":3},"rCNcCXUfmflX5JidvHMESQ":{"text":"Lebanon's is really great, probably second only to Babylon. The food is excellent, althoug","useful":0,"cool":2},"T82tqFMCMk4VWO3CCeTLmQ":{"text":"Best hummus anywhere, ever. All of the meats are so delicious, perfectly seasoned and juic","useful":0,"cool":0},"NJVkRfe3ybiu84H2KnoMUA":{"text":"I've never had a bad meal here. The food is fresh and delicious, the service is friendly a","useful":0,"cool":0},"sj0CuVCVqY5UOfXz_KcwJw":{"text":"After all of my Middle Eastern food reviews I have been writing lately, a few people told ","useful":9,"cool":7},"bjC0X6dyjzqJ7M3u2YcK7w":{"text":"i get dine in and to go food from here all the time and its always delicous and fast and e","useful":0,"cool":0},"aaVuXiKS2mHMIa1o3iqOoQ":{"text":"Lots of options for my vegetarian wife and lots of other options for me.\n\nGlad we made the","useful":0,"cool":0},"psQLGou0tbCfgvvikOOtcw":{"text":"The halumi is amazing.  One of my favorite restaurants in the city.  Highly recommend","useful":0,"cool":0},"iTzjjf4JRZibCVDWU4R8cQ":{"text":"Best Mediterranean food in New Orleans. I love the Chicken Tecca and the Beef Schwarma. I ","useful":1,"cool":1},"QqjqcH-IM5D9SmSRTadXzw":{"text":"Awesome place if you have a vegetarian friend!\n\nAfter searching for veggie-friendly restau","useful":5,"cool":4},"tU-cuMFVGunHUlv7XcCjBQ":{"text":"One of my favorites in the area for middle eastern food! I work near by, so this is one of","useful":2,"cool":0},"zWI7sYYtIqmYd7KRqYKy4g":{"text":"This place is delicious. I got carry out which I didn't call-in and it did not take very l","useful":0,"cool":0},"qG9ja-WdEc_Biz60Qpdxuw":{"text":"Cute Mediterranean spot with outside seating! I had the lamb kebab and my friend had the b","useful":0,"cool":0},"lsWHzD7gygd8qbBjwKSufw":{"text":"Nice spot. Wonderful location. We got a table outside, on the sidewalk. The Lebanese tea..","useful":0,"cool":0},"KYwHUSWjWTmBcY3HHyuYQQ":{"text":"We stumbled upon Lebanon's cafe one night looking for something Mediterranean and cheap. W","useful":2,"cool":1},"AIbgWS7lZMqh4XGasEVd5w":{"text":"We found this place by accident in 2004 and make it a point to stop in every time we're ba","useful":0,"cool":0},"eUEyoNpv9BWBWnFMsRaHbA":{"text":"Excellent Mediterranean food, cool atmosphere and i love sitting outside on the sidewalk o","useful":1,"cool":0},"YO_fD2czgTdArHkTZNL6LA":{"text":"Very authentic and great tasting food. I went here for lunch and the place got crowded ver","useful":0,"cool":0},"er8yHCell3M0cosa5HmJ1A":{"text":"This was hands down THE BEST middle eastern restaurant I've ever been to!!!! The servings ","useful":0,"cool":0},"wplf0IjobB046PStDeJd_Q":{"text":"In my 3 years here, this is probably the restaurant I've been to the most in the city. The","useful":0,"cool":0},"cvP2wrYdPVTB5lQEnmaYXw":{"text":"I've always been a fan of Lebanon's but today i ordered a veggie plate and it was all cold","useful":1,"cool":0},"B-wp1NEoqcctRC5p0zyFMA":{"text":"This is my go-to restaurant for Lebanese food in New Orleans!  I am a creature of habit an","useful":1,"cool":0},"0M0LkYPJSWK1ehhLTb2ikg":{"text":"Excellent and authentic Mediterranean food. I came here for lunch with a friend and we sha","useful":0,"cool":0},"irgPah7wjmv_R6F8A9LQEw":{"text":"Food and service are simply the best! I have been coming to this place for over 10 years a","useful":0,"cool":0},"h2UEPG_0MDe7Fqf5HL3_tg":{"text":"Lebanon's cafe is set up in a quiet and calm environment to have dinner with your folks!\nS","useful":3,"cool":2},"QaC4whqXg_7y2LVnjbimbg":{"text":"Great Mediterranean fare. We went there on a Sunday evening. Pretty crowded and we waited ","useful":0,"cool":0},"_U2S-gWVqfLkcQdOstxdNA":{"text":"I absolutely love their food! Always fresh and of good quality. Service is always attentiv","useful":0,"cool":0},"GHEDBfnRxn_rqcfOqZxfVw":{"text":"The combination shawarma plate was great. When the food is this good you can really savor ","useful":0,"cool":0},"l82ygFVCHA4O6esD02O1eg":{"text":"Good food- bad service.\n\nMiranda ignored us for 20 minutes and was sarcastic when she even","useful":0,"cool":0},"f_t-xblQMdBYz-0FR83RAA":{"text":"this place is awesome! as a middle eastern, I was looking for a taste of home and I finall","useful":0,"cool":0},"bK_EDHXCaV5n7l_npL8bww":{"text":"Finally, a place that is not just another Mystery Middle Eastern cafe.  It's in the title:","useful":5,"cool":5},"NxkfVavq1LX1nBkNplw2Cw":{"text":"My husband and I come here all the time (we live a couple blocks away) and refuse to go an","useful":0,"cool":0},"AVTyGbAQHZ4K218fmy5xBA":{"text":"The kabobs are cooked on skewers over a charcoal grill. They're awesome.\n\nI kind of wish I","useful":0,"cool":0},"FsBWd6e_NI4MbbkiOqkzlQ":{"text":"SOOOO GOOD!  I went with my family and each of us got something different.  The sandwiches","useful":0,"cool":0},"M4dC1CIRj1bZFZKp9ZAFBQ":{"text":"Found this gem today and what a find!!!! I had the lamb kebabs and my hubby had the beef s","useful":0,"cool":0},"_scD1Tb_pdR3Dw4FsSb95Q":{"text":"Lebanon have some of the best hummus in the city. I love the fresh flavors of the tahini, ","useful":0,"cool":0},"6h-6i7Fhbd6h5TdzKpvCZA":{"text":"I had read the reviews of Lebanon's Café and it did not disappoint.\nMy wife, daughter and ","useful":0,"cool":0},"zARm9evJdmh3yuSBr9hslw":{"text":"Very good. My number one stop on trips to New Orleans. The Kibby was super and chicken coo","useful":0,"cool":0},"xlnMZjhNNwrKnSfp2idezw":{"text":"So I really like the food here. It's fresh and consistently good. Why the 3 stars? The ser","useful":2,"cool":2},"xyzk-34QSoscdxwu8wG1qQ":{"text":"I had the Lula and Lebanese Iced Tea. The Lula was ground beef and lamb cut into strips th","useful":0,"cool":0},"ZYU5FVVUtZGnR_8npOrDtw":{"text":"It's kind of loud, but the baba ghanoush is fantastic.\n\nAnd they were very generous with t","useful":0,"cool":0},"st3eOm0zQfBtQZncw7G0zA":{"text":"I love this place!! \n\nYesterday was my birthday and I didn't want a fancy dinner or anythi","useful":3,"cool":0},"eCGkjIreO3TTe-9fTU0qsA":{"text":"A classic place in New Orleans. After everyone telling me I needed to try it, I finally ma","useful":2,"cool":1},"vxqjni_qN5lfTCZO8uNzrw":{"text":"The food was good. We got the lamb hummus plate. I thought it tasted like a juicy Whopper ","useful":0,"cool":0},"pzL02ir2ua3e5dZlBdI1iQ":{"text":"One of my favorite lunch spots in New Orleans. You can't go wrong with the hummus and chic","useful":0,"cool":0},"hOBWDj7yjgu8Got6f8aBOg":{"text":"They wrap the wraps kind of fancy here, and they should, because the wraps are awesome.","useful":0,"cool":0},"ODVGqcCY-pEFIQuYiZT06g":{"text":"The best food ever!!!!! You need to come here and try their cauliflower hummus as well as ","useful":0,"cool":0},"gLfw4MXtOsXzym4jz8zR_w":{"text":"Lebanon's cafe is soooo good. My family and I enjoyed everything from the Lebanese tea to ","useful":0,"cool":0},"LKaZqLJwVVzAv44kg1f3dw":{"text":"Wow! So yummy!! Had the lentil soup, fattoush salad, and vegetarian plate with my sister. ","useful":0,"cool":0},"x_J66kvpeUh976yXRkGlZg":{"text":"Excellent food. Ive eaten here 30+ times, they have always been consistent. Humus with lam","useful":2,"cool":1},"HBuPDJ-Wsbpvv-uBYPFAUQ":{"text":"So here's my thing with Middle Eastern/Lebanese/Greek food. I love it, almost an unhealthy","useful":1,"cool":0},"hhNuITim-II8wO9LdpFh3A":{"text":"Lebanon's is definitely the best middle eastern food in new orleans. Hands down. I love tr","useful":2,"cool":1},"agRG9O2-qfWbw4NWfOemHw":{"text":"Love this place! I recently moved closer by and definitely know this will be a go to spot ","useful":0,"cool":0},"U0YSccTdm1aiafSKAEh8mQ":{"text":"This is the best Lebanese restaurant outside Lebanon. Every single plate is delicious and ","useful":0,"cool":0},"BlGhrlHrBu5jzUHYe6zGMg":{"text":"This is a great restaurant! Very inexpensive and huge portions. The hummus is off the chai","useful":0,"cool":0},"v2clI5YH5IZIS4p-_ExQVw":{"text":"Hummus with fried cauliflower and pomegranate. Incredible. Perfectly grilled cauliflower. ","useful":1,"cool":0},"wl9PxWxElhzn_P-pf-mP6g":{"text":"Very good food and very affordable. The tea was amazing, definitely a must try. People rea","useful":0,"cool":0},"PfoQ09cU-B3QaRTTw7Hm0g":{"text":"One of my favorite spots to visit for a quick lunch, date night or dinner with friends! Th","useful":1,"cool":0},"tWdWrdIjUubz8Td--xojhw":{"text":"Mediocre middle eastern food in uptown. Don't know why someone would choose to come here i","useful":2,"cool":0},"PN6F4VH7OVmzBEdErktIIQ":{"text":"Every time I go to Lebanon's the food is absolutely delicious.  The hummus is the best in ","useful":0,"cool":0},"5mx75ihV7W309AEJIyIDWQ":{"text":"first time ever i had this type of food.  man!!!  good stuff.  had humus, falafel, and spi","useful":1,"cool":1},"3miQF9rQrNqy9zq_K-GeoA":{"text":"This place  makes  me so happy. Ambience 10/10 \nWait staff are friendly and patient\nfood i","useful":0,"cool":0},"9IZUo2Wi2_eGP4NcKmtzNQ":{"text":"My SO and I came here for an impromptu date night a couple weeks ago.  I live well within ","useful":2,"cool":2},"WZFvu6pF8eZVarzZIRzBdQ":{"text":"This was exactly as I expected but with fresher ingredients and a great atmosphere.  Servi","useful":1,"cool":0},"_YC7Es5pOUVAVP_NQr2DbA":{"text":"Always a great meal here.  Sometimes the service is a bit slow, but the food is good enoug","useful":1,"cool":0},"8zCc_o1s3pldoNSpqoqtTw":{"text":"Had the pleasure of visiting this restaurant this past weekend while I was in New Orleans ","useful":1,"cool":1},"miUhk04K7ErKuJRRoPaoVQ":{"text":"Came here on a whim and glad I did.\n\nHad the falafel, hummus and fattoush. The hummus was ","useful":1,"cool":0},"3twIA27wx3ee60Nt18E5Cw":{"text":"A coworker brought me here a few days ago for lunch.  I seldom eat Mediterranean food, but","useful":0,"cool":0},"uUk30MDxLNrsCVRgxx2Lqg":{"text":"We live 5 blocks away and go for take out at least once a week and eat inside the restaura","useful":0,"cool":0},"ok6kS8fe-Yvij7ieQGTr6Q":{"text":"RIP falafel sandwich!\nThey took it off the menu and won't let you order it if you are eati","useful":1,"cool":1},"_Rwm5qkuUzWV4ZYsBxBFog":{"text":"Great food and service. Plenty of great vegetarian options and some of the best Mediterran","useful":0,"cool":0},"EdhKm_cZgK2qfSUglSwoAQ":{"text":"Every time we come for a visit, we hit this place. We've had lamb, chicken, artichoke ball","useful":0,"cool":0},"ggZmIrGCcswHyNsF6PS3IA":{"text":"My go to Mediterranean food the veggie rice plate is amazing!! And service is great too!","useful":0,"cool":0},"9SYAF3o0FfH3vl79Jdhnkg":{"text":"I love this place! I've been eating here practically since the year he opened, almost 20 y","useful":0,"cool":0},"nLRrR1JKF6d58gD3WxTyHA":{"text":"The food is delicious.  However I wouldn't recommend going in 35 minutes before closing.  ","useful":0,"cool":0},"J5CRQi0Q1oosnzMyq1ZvfA":{"text":"I first found this restaurant during my time at Tulane and have continued to visit years l","useful":1,"cool":1},"OTq3vQ__yJlrlW76Y2rlcw":{"text":"My go to cafe for delicious middle eastern delicacies!  Two favorites are Chicken Shawarma","useful":1,"cool":1},"sPytdtpMiFg28as9GlU-eQ":{"text":"A great lunch spot that will sure to please you! Make sure to start with their hummus with","useful":10,"cool":7},"AmqgZ_kjWPUrs87AV8eEYA":{"text":"Lebanon's Cafe serves up authentic Mediterranean food on Carrollton.  The restaurant is ni","useful":0,"cool":0},"cKtnr7xWi1sjCqU5dpCPOw":{"text":"I loooove Lebanons. It's perfect for when you've got a big group of people or just a big a","useful":1,"cool":1},"J-cDgPMX3rXxsTrmU5Fz1A":{"text":"Lebanon hands down, has the best Lebanese food in the city! Although I live in Metairie, I","useful":9,"cool":6},"Vx3xdBY0dBiV3_H2M2RTjw":{"text":"This is a neighborhood restaurant in the Carrollton area that is located next to and near ","useful":2,"cool":0},"zUJn6gfX3KdDq1KjCII-gg":{"text":"Great food and great service! I have ordered meat-stuffed grape leaves, but what I got was","useful":0,"cool":0},"XjJzWMvG9nLPeKoWkQOKGQ":{"text":"A must try place! My favorite lebanese restaurant in New Orleans, and they are BYO wine. I","useful":1,"cool":2},"VY35295bcP17ZKXiMNmHEg":{"text":"This place is open on the inside for covid and was a go-to for takeout for me during the h","useful":0,"cool":0},"avuLGG86n-gVubeoQkZIKg":{"text":"We found this place by accident in 2004 and make it a point to stop in every time we're ba","useful":0,"cool":0},"hwid_KKr5DmNKBKJEyaXVA":{"text":"I had the lamb and hummus plate and it was excellent. The servers are fast and professiona","useful":0,"cool":0},"Cp87xLvlhiRZ2eexkepflA":{"text":"this place is amazing.  be sure to try the rice.","useful":0,"cool":0},"JLEtbKeBt-IRh4mPJnVN6Q":{"text":"We've been visiting this restaurant for a few months now. Normally they are really good an","useful":0,"cool":0},"T7TB4g6f4QUrcnu4taZt1A":{"text":"Amazing every time. The gyro plate never disappoints. The hummus is so creamy. Can't go wr","useful":1,"cool":0},"C2-6SHBmpM45cesHBLgyrw":{"text":"I'm no Greek food connoisseur, but this place is soooo good.  The waitresses are always re","useful":1,"cool":0},"VScFXk8SYn3wUkOXo-shKw":{"text":"This place is amazing! As a Lebanese person, I love the food. THE LULA PLATTER IS A MUST f","useful":0,"cool":0},"aSy0KdUbw_WaP2jA_iC0yw":{"text":"This is my favorite Mediterranean restaurant in Nola! They serve the best cauliflower humm","useful":0,"cool":0},"0Lkqpsa4fz49bzsvuPt4sw":{"text":"First time here because I live on the north shore. It's very difficult to find good middle","useful":2,"cool":0},"hQQ9-ItOqWCFs68iVqjTHw":{"text":"I can't get enough of this place. It's become a frequent date night location for my partne","useful":1,"cool":0},"lasAKnNhnE_gMu_XcdLPLg":{"text":"Delicious food prepared quickly.  Great setup inside.  Missed a special request even after","useful":0,"cool":0},"gTDdlLqtArEyK3YQzOvCJQ":{"text":"Everyone always tells you to go to Mona's for middle Eastern, but I think this place beats","useful":1,"cool":0},"msjVc6luLcNvsCbBnV0YeA":{"text":"Love Love Love.........great service great outdoor seating.  Food is awesome!!!!!","useful":1,"cool":1},"6NS-k2ZtoWUDaMhud62Oxw":{"text":"Whew chile, I needed to take a break from all of the (delicious) butter-laden, cheese-dren","useful":1,"cool":1},"qcVjD1SPWFopdfc_EQDTkA":{"text":"Always a favorite- the hummus, Lebanese tea, lula kebab, gyro, and sautéed vegetables are ","useful":0,"cool":0},"sts0GnuivMNPf6n-XhJ7iQ":{"text":"Lebanon's cafe is always good! The portions are huge so I always leave with my swine or th","useful":0,"cool":0},"HDOTLZ_vL97q-bd6XELTXA":{"text":"This is the spot I had my first taste of Middle Eastern food and I've been a fan ever sinc","useful":4,"cool":1},"QGdqJol72Ayr9ieJr5dynw":{"text":"Awesome taste, must try spl falafel. Sooo tasty, price is also reasonable.... Nice ambienc","useful":0,"cool":0},"HWdVfqFrxM6s6h_AfSeDdQ":{"text":"I've eaten a lot of Mediterranean food in my life and this place serves some of the best I","useful":2,"cool":2},"4B7zvnOEvgCfMvXkfS1vGA":{"text":"I've only ordered food from here through uber eats which has never let me down and decided","useful":1,"cool":0},"CyqsoGnQY_pVLjETDAYtJQ":{"text":"Such a great gem in NOLA! Everything was delicious and the staff was wonderful. We ended u","useful":0,"cool":0},"inQHaQW3Zu0LzOcaIFGk5A":{"text":"This is place had amazing food and a great menu. Perfectly cooked falafel, and the fried c","useful":1,"cool":0},"FLoSpqJxC0MpzOQda-5wEA":{"text":"I must have missed something because I don't understand how this place has all these ravin","useful":0,"cool":0},"8Rd93Xih1BV1ryLmRvH9xA":{"text":"I have tried a few middle eastern restaurants but Lebanon's Cafe is my to go to spot. Best","useful":0,"cool":0},"nWR_kZzHR32PSDy4GzDSTQ":{"text":"The service was great. The place is big and roomy but best of all the food of great. We ha","useful":0,"cool":1},"JuQDw8RGTuNmahJDoXPOOQ":{"text":"Delicious spot for Mediterranean food in NOLA. My dish was very flavorful & I enjoyed it v","useful":0,"cool":0},"zS4cvUdjxmfErXVouyuP-w":{"text":"Delicious food and fast service. The chicken shawarma was excellent, very garlicky and com","useful":0,"cool":0},"ZO0qLFSz8jiMVROhmZPJGQ":{"text":"This place is fantastic.  The only complaint I could possibly have is that I couldn't find","useful":1,"cool":0},"qJGOCKyA6zHWIUf77361Bw":{"text":"I have been searching around New Orleans for Mediterranean food and found a few spots but ","useful":0,"cool":0},"z-IlviqODrGS5uWLPrs-3Q":{"text":"This might just be THE hidden gem of New Orleans. Charming outdoor seating with street car","useful":0,"cool":0},"6MjGON83T-kZdu6bAYeXow":{"text":"Which should I talk about first: the service or the food? Let's start with the food becaus","useful":0,"cool":0},"1qf8lVK5ZMMe09sNXxzGHw":{"text":"Lebanon's Cafe has some insanely good food. However, their pita is astonishingly bad, well","useful":0,"cool":0},"SdALe4oxAyETFuosOTXVSQ":{"text":"Stop thinking about it and just go!!\nFood was delicious super friendly staff. It was a bea","useful":0,"cool":0},"GNbDIacwJQZCKHz6JH6fHg":{"text":"This place has hands down the best labna in New Orleans. It's creamy, large portioned, and","useful":3,"cool":1},"9K18pN42fA1GqihRvOUl0Q":{"text":"I have been going to Lebanon's Cafe for years and it never disappoints. I recently went fo","useful":0,"cool":1},"kHMHekLPuzePKS1w_p-r3g":{"text":"The food was yummy. Every time I order from Lebanon's Cafe the quality, portion and taste ","useful":0,"cool":0},"VjVxy8yZ81DcnCRDpp5PPQ":{"text":"This place stays busy during the prime time dining hours and also has a brisk take out ser","useful":1,"cool":1},"azqhA_cDkjh9y3FNzwkUPQ":{"text":"This restaurant never disappoints! Always so fresh and delicious. I compare every other Le","useful":3,"cool":1},"QGBpdS5g5V9ZxCtuL3rVKA":{"text":"Kinda expensive, but I wasn't paying. Lamb kebabs were wonderful, also taboule and hummus,","useful":0,"cool":0},"VqvY_dcCWWmZE_3alIMwCQ":{"text":"Came with a group of 5 and everyone was very pleased. Obviously one of the best places to ","useful":0,"cool":0},"Pm5enkOEyMrj-spho2fuDA":{"text":"Overall, Lebanon's Cafe is an incredible place to grab some authentic Mediterranean food. ","useful":1,"cool":1},"PYkTBep4y0KDV_QEnq5IOQ":{"text":"Yummy! Food delicious. Nice outdoor seating. You can bring your own wine! Only reason I ga","useful":0,"cool":0},"F_WbdVy5aRmCWDD35gnA8g":{"text":"Lebanon's Cafe has the best Middle Eastern food in all of New Orleans. I have not found on","useful":1,"cool":0},"hKw6e-KbW_Syh_M8ja1RYQ":{"text":"Great food.  My only complaint is please stop providing plastic utensils for to go orders.","useful":0,"cool":0},"8O_MkWJ9vTw6FudH5Y88ew":{"text":"Solid middle eastern food.  The menu is not too different from the various locations of Mo","useful":4,"cool":1},"gFQ89xGZE24KcS7baJ_iLg":{"text":"Lebanon is a weekly staple for my family. The hummus, falafel, and vegetarian stuffed grap","useful":0,"cool":0},"EEgJXYgsndQVepMVtZNFzg":{"text":"The waitress named Alejandra needs to learn how to take orders properly and how to treat c","useful":0,"cool":0},"4sho2Lx3IbDlCoihvnYqsQ":{"text":"Sunday dinner? Yes please! Weekday lunch? Don't mind if I do.  Lebanon's is always there w","useful":1,"cool":1},"0fFmEbGWp98_Q1t8Lxy6Zw":{"text":"We eat here probably once a week! The hummus with chicken is my favorite with a Greek sala","useful":0,"cool":0},"0iIJ9OvkjmC2MCNDx0_mcA":{"text":"Totally satisfied with the food here. My friend Mitch told me about this spot last week an","useful":0,"cool":0},"IjpIfxbgkQOTfVvjGhWq5g":{"text":"Update- went back this weekend. Got Will as our waiter. He was great, knowledgeable and fu","useful":0,"cool":0},"gbAMIC1MuzgmrihySN0dhw":{"text":"Good food but the service is hit or miss depending on you waits on your table. Some server","useful":0,"cool":0},"qx2DuJAJXWw2hS8FsUXjcw":{"text":"All I have to say is Hummus and Lamb plate. I could live off this if it was realistic and ","useful":9,"cool":9},"HthVKN6Q-pBbtfliThvLzw":{"text":"This is the spot I had my first taste of Middle Eastern food and I've been a fan ever sinc","useful":3,"cool":2},"BONd68oP29pGO2sPTILv6A":{"text":"My boyfriend and I usually can agree easily on a place to grab lunch. The other day was no","useful":1,"cool":0},"fyPWNRY2tdmAgA7s3X779w":{"text":"By. Far. One of my favorite restaurants in New Orleans. It is sooo good - anything on the ","useful":1,"cool":0},"MscEJRwOzdyIjviFV02Lug":{"text":"Came back to Lebanon because its a favorite of my friends and I must admit I have found th","useful":7,"cool":6},"sehYr1A9HI3FOU3nDZOsDA":{"text":"Excellent dining experience. Our party was four. three.of us had the chicken shawarma  it ","useful":2,"cool":0},"R0P7_yHkzyInJZm86YdB3w":{"text":"Seriously, I haven't reviewed this?\n\nThat might be because the last time I ate here was ye","useful":4,"cool":3},"neRuHjvyRXm5u4W4V9HjtQ":{"text":"I love this place.  Not much in the way of decor, but that is not what I come for.  The fo","useful":0,"cool":0},"CEUNQfEnoHQ3SgQ_sz-jZQ":{"text":"I went here for take out a couple of weeks ago and have been slow on reviewing because I d","useful":0,"cool":0},"7xYQST58p7DlQBauqKj4Yg":{"text":"This was really really good. We had lunch mid-week and enjoyed it very much. We plan to ea","useful":0,"cool":0},"TiVKBehmrCV35g1ArWCj-w":{"text":"Food here and service is always good. I enjoy going here for fried cheese too. The tea is ","useful":0,"cool":0},"w8gTNscr2umtlZwi0Mhf0A":{"text":"Lebanon's came with a lot of hype and like most hyped places it failed to deliver on that ","useful":4,"cool":1},"U7k6N08Ex0bNBwqoRK97Xg":{"text":"Delicious food, different from what i typically eat. Very friendly staff.","useful":0,"cool":0},"ei9sut2qaI7utB7o_ACMoQ":{"text":"absolutely one of my favorite Greek restaurants. It's a little bit pricy for casual food, ","useful":0,"cool":0},"b3ViWS1SeCju5rLyKqJuSA":{"text":"Lebanon's Cafe has been our go-to for Mediterranean for the past several years.  My girlfr","useful":2,"cool":1},"P9J2cgOOsEAvkQT4fcRHyA":{"text":"I absolutely love this place. Their gyro platter is never a miss always spot on with the t","useful":0,"cool":0},"RZ-YpdAJ8Sj-jkrnsSFKGQ":{"text":"My first time here - and again the weather was great enough to sit outside. We ordered the","useful":0,"cool":1},"VJpum6JDc1JPEzqpgm1Y9w":{"text":"Lebanon's Café is worth every one of the 5 stars I'm giving it.  I have dined in and taken","useful":13,"cool":9},"8bmdzco-0yxR9ORDqG05DQ":{"text":"Had lunch there with a friend. Excellent hummus. Had the gyro plate. Tender and delicious.","useful":0,"cool":0},"JmIDKr5V2xz6LAwad0qWAA":{"text":"Fantastic chicken swarma and hummus. Probably the best Mediterranean food uptown.  If you'","useful":0,"cool":0},"lVX_xupjz-Ji6La3iDauug":{"text":"Great casual cafe.  The food is consistently very good, sometimes incredibly so.  The serv","useful":0,"cool":0},"9Ld_1jWQKyoVoIStuGQzTQ":{"text":"De-lici-ous! I decided on the combination kebab which was beef, chicken and lamb kebabs wi","useful":0,"cool":0},"O0wxFEeKkk5eVAR26T8g8w":{"text":"Heavy on the jalapeño instead of more subtle flavors.  Hummus accompanying chicken shawarm","useful":0,"cool":0},"Wkjx7zMzvDM9T9aU0GaTew":{"text":"One of the top 3 best Lebanese restaurants in the city. It's also been here for a long tim","useful":0,"cool":0},"nMKesRNgmU63KA4gVuN19A":{"text":"Lebanon's Cafe is DELICIOUS! I've been eating Mediterranean/Middle Eastern cuisine a LOT l","useful":3,"cool":1},"grb4b4-1cecEcFvnX3m7pw":{"text":"I have been enjoying Lebanon for over 10 years, and have never had a bad meal. But last ni","useful":0,"cool":0},"LGifK4GGprmAY_19gWTkOw":{"text":"Last night I overindulged in Lebanon's and the place is so amazing I'm craving it again to","useful":0,"cool":0},"9oItPxlr6rHQEuSq6RIWXg":{"text":"The BEST middle eastern restaurant in the city in my opinion. Their hummus is so addicting","useful":2,"cool":0},"LTUxZq7SyBMkhCAk8zLKHw":{"text":"Loved the food! Favorite Lebanese/Middle Eastern restaurant in New Orleans. The food & ser","useful":0,"cool":0},"M9whxO5lIXil_-t25fZ09Q":{"text":"Fantastic hummus!  Great takeout options for all. We get the gyro and chicken shawarma pla","useful":1,"cool":0},"NtgrZQ_eiD9-g8CUjp2ECA":{"text":"So... I'm new to eating fish.  Yeah, I know.  Weirdo.  \n\nI'm currently obsessed with salmo","useful":6,"cool":6},"M9hx20u9VFHVfzECqP05AA":{"text":"Hands down, our favorite Lebanese restaurant in our drivable vicinity. Probably our favori","useful":2,"cool":0},"LYVaGQjfljKcg3MNnjt-Pw":{"text":"i had written a previous review, but perhaps it was removed. It was not a positive review,","useful":1,"cool":1},"5jme6iOn2mdtc7gG-Sanjw":{"text":"Man, you would not believe what HELL I went through today, \n\nI am a starving student. I WA","useful":0,"cool":0},"nmA-uQARAmqKiGQVSaMlgg":{"text":"I've only been here once but I would like to come back again! I've always heard great revi","useful":1,"cool":1},"ZHVlsni4v3x9rVsBLfnVkA":{"text":"Has to be the stalwart in my short list of \"always good\" restaurants in town.  The chicken","useful":0,"cool":1},"Guk8YkZjCu1kARBnlxpu3A":{"text":"1st time here! Delicious falafel and hummus. Very friendly staff. They make you feel like ","useful":0,"cool":0},"jt6xr84InjuSUP2FYCqylA":{"text":"This is by far my favorite Lebanese restaurant. The food is so good! I order the gyro plat","useful":1,"cool":0},"hPw8Tq6ov2TFDVtx04RTLg":{"text":"If you're in a rush or need a evening out this is the place! Show up with your own booze a","useful":0,"cool":0},"nc5ex1f4whKj5MHSjf_yVg":{"text":"I ate there today with my wife and baby. Not only was the food superb as usual, It is the ","useful":0,"cool":0},"yP6wZL19_DNO6hg7j6pM4A":{"text":"The weather was perfect today, so we sat outside. Unsweet mint tea was so refreshing. Some","useful":0,"cool":0},"16b2qiYGSotXU5u2OS2K-Q":{"text":"best hummus, best Lebanese in New Orleans.  I recently moved to Kenner but its worth the t","useful":0,"cool":0},"8xB3EHL_OFEtqg68WNspXg":{"text":"Amazing! Amazing! Amazing!...great place! Better food! Awesome!...take a gyro plate!  You ","useful":1,"cool":0},"hTcOqQDTFtZZjjxuZuma0g":{"text":"Great outdoor seating that is Covid appropriate. Their food is pretty typical of the Medit","useful":0,"cool":1},"b1nUUn9kJKzyhoJ4gbhxdw":{"text":"A couple of friends and I went to Lebanon's Cafe- the food is amazing and it's a favorite ","useful":2,"cool":0},"pD-OMPWtYYGAO_i4HFMkFw":{"text":"Amazing! Do yourself a favor and try Lebanon's Cafe! Their hummus has a great heat and fla","useful":0,"cool":0},"8Wy_KSD1uxhtHuLx28MdpA":{"text":"I've been known to lick the last of the labna from the plate. It's that good. \n\nLebabnon's","useful":3,"cool":1},"orvjImxESreiC0hSssTKIA":{"text":"Food is good no complaints, proper social distancing measures being taken. \n\nGiving less s","useful":0,"cool":0},"dC3XR7uoEFzY6kEwd7Kkmg":{"text":"This is my favorite Mediterranean/Middle Eastern food in NOLA by far. This cute little caf","useful":1,"cool":1},"lWiCbUfHU_IKIgqTIcjhDw":{"text":"Very high quality generous portions good variety including sampler plates","useful":0,"cool":0},"cGInKzfFxVfRnpa6REXtQQ":{"text":"Quality of food is excellent as always but price has gone a little steep for my blood. I w","useful":7,"cool":4},"lgpMGyhDbphMH-O7KCBaZg":{"text":"Not only is this (potentially) the best Mediterranean food in New Orleans it's some of the","useful":0,"cool":0},"HfkqZG1VTW37aLqfJHkQcw":{"text":"The more delicious Chicken Shawarma in the city. Excellent atmosphere and a very long menu","useful":0,"cool":0},"3tn3nHuXpFie69dZKeRfbg":{"text":"Went to the cafe for the first time last night with my husband and son, and it was swell. ","useful":0,"cool":0},"wJmapnU7d-OSFaVi_N5mBg":{"text":"Service sucks, my wife and I felt unwelcomed here. We've been sitting for 30 something min","useful":0,"cool":0},"yLbJVi2MlET6PwP_OPIAFg":{"text":"Lebanon's is a go to since it's walking distance to my house. The cauliflower hummus is so","useful":1,"cool":1},"5r2xSwz2P9WlVIiky-Js1g":{"text":"It is okay, but kind of bland. Not the best Mediterranean food in the city, but you could ","useful":0,"cool":0},"r3apTEt1knJnE_yS0bsimw":{"text":"One of the best! Better lamb dishes than anywhere else (maybe it's the marinade?) But ever","useful":0,"cool":0},"v1nPJ_wk1j-Rgjk9LNeAww":{"text":"Wonderful food at a restaurant with such a relaxed atmosphere. Indoor and outdoor seating ","useful":2,"cool":0},"eR0SWCzDFWMjy7Y1l8KPww":{"text":"The food is great, but the service is the worst. Picked up my food tonight and got snark f","useful":0,"cool":0},"oawv7PjX2Mq3NK654Hk3iA":{"text":"This is my FAVORITE Mediterranean spot in the city. Always consistent and delicious. I get","useful":1,"cool":1},"Q_HDXbMQ53dgntSAhW57Mw":{"text":"Delicious, prompt, healthy, reasonable prices- have ordered here countless times before an","useful":0,"cool":0},"5octQIxdD-PE7rrByKMDiQ":{"text":"Must admit, we only wound up here because the place next door is a DD&D place and, contrar","useful":0,"cool":0},"mCfu0D2F56B_My8sKX0vZQ":{"text":"This place is conveniently located right on Carrollton by our apartment and the only reaso","useful":4,"cool":2},"AN_tAfu8zhrgVlVGdVekvg":{"text":"The grilled chicken and beef kabob meat is fine. \nThe lamb from the beef/chicken/lamb comb","useful":3,"cool":3},"SAS4qgXEF1MroWIDw4-ngw":{"text":"I like the food here. Its usually pretty good. Why are sandwiches no longer being served?","useful":0,"cool":0},"E2BzxsrHANR1NhrSaVQhrA":{"text":"I've eaten here a few time already and can say it is very good! I have never been disappoi","useful":0,"cool":0},"Xvm2LMORz1HMRBy1oc9u3Q":{"text":"Lebanon's Cafe IS excellent, but I do have some recommendations for a smoother experience ","useful":3,"cool":1},"iFS3_Hcl8Mp0nc5mEJ5DaA":{"text":"This is a pretty great medeteranian restaurant. They give you plenty of food for lunch at ","useful":0,"cool":0},"3S7gYM3vOrPdSwMfU5s3AQ":{"text":"Has been my favorite place to eat in nola for years. When friends come to town, I recommen","useful":0,"cool":0},"l9bOlIEePJQCYK-8jTklsg":{"text":"Let me start by saying we went on a busy (Covid restrictions lifted night). Food was amazi","useful":3,"cool":0},"80WRrqchiOdus8PXbWIz_w":{"text":"So if you are thinking about trying this place out here are the must try's... Lebanese tea","useful":1,"cool":0},"jpXZrngyzDDMMQ2uUbHhAg":{"text":"If Yelp gave half stars I'd give them 3.5 stars but i'm feeling generous and will bump the","useful":5,"cool":3},"rABLTARkTh8XZudfIg5-Gg":{"text":"Best Mediterranean food I have ever had! My fiancé raves about this place and I finally go","useful":4,"cool":1},"59-X_VCG-EyxEON8xCmodw":{"text":"I love how Mediterranean food can bring the carnivores and veg-ites together in harmony.  ","useful":3,"cool":2},"a7mUKgNGw-_jC5DO3PrNHw":{"text":"Don't ever order the beef shish kabob. Made the mistake of ordering the beef over the gyro","useful":0,"cool":0},"SR4Oirmb4FKSR3GndAv92g":{"text":"The food was so fresh and I loved the atmosphere. I ordered the veggie dish and it was awe","useful":0,"cool":0},"1ugUMA2BYlqn39X9uHip-w":{"text":"I ordered the gyro plate and husband ordered chicken kabobs- both great meals. Meat was ve","useful":2,"cool":0},"D6QqV_CyKu3V3k77YRB9rQ":{"text":"I've been getting take away for the past few months however for the first time I've sat in","useful":0,"cool":0},"hbP-RttFFMp8Z-fSkgySWw":{"text":"I got takeout from Lebanon and was quite impressed. The woman on the phone was so kind and","useful":3,"cool":2},"j89JYIvbh1_Zi4DDM_AA3w":{"text":"After a week out of town and an afternoon of travel my wife and I arrived home. We decided","useful":4,"cool":0},"LOzPZXORX04bgyX3rh4hZA":{"text":"I was very unsure of this place when we first came here. It doesn't look like much at all.","useful":2,"cool":2},"Ka38dn18Rly6hxIojtcUJw":{"text":"I thought NOLA was about Crawfish, Jambalaya, and Po' Boys.. but there's also great Middle","useful":7,"cool":5},"RDRXOr7y5_kqK0jmgQ-z6w":{"text":"Hmm. No more peta wraps or sandwiches after lunch hours. Dimner plates only. Disappointing","useful":2,"cool":2},"R_MXCNGoV7jCvBuXH1DgDw":{"text":"They never let me down all lamb dishes  better than.other mediteranian resrauarants terrif","useful":0,"cool":0},"nF5hieorENrmTOEQXGMQLw":{"text":"Absolutely delicious food...\n\nEverything from the hummus to the lamb to the Greek salad is","useful":2,"cool":3},"VjKuDJGaFkYRjSsgFpKY_g":{"text":"Never disappointed , they have the best Arabic food in Nola, I'm half Arab and lived all m","useful":0,"cool":1},"nljgSEuHLVMKQ_qNfGDrnQ":{"text":"It was lunch time and I could see a couple of vacant tables along the sidewalk in front of","useful":5,"cool":2},"Lca8sPK5-fOlHQETm0POjw":{"text":"My wife and I stopped in for a light dinner on a late Sunday afternoon.  We had thought ab","useful":1,"cool":0},"uczzNKTlnAljymQLIfC3kA":{"text":"I am a big fan of Lebanon's Cafe. Their food is always consistent, delicious, and an overa","useful":2,"cool":1},"OGz8UUM48KBkg9x-e14PjA":{"text":"Oh my gossssshhhhhhh. I love Middle Eastern food. Whenever I'm craving grape leaves--this ","useful":1,"cool":0},"-lIl6CKLCiTkSLNerjrgoQ":{"text":"Although the selection of Middle Eastern and Greek/Mediterranean style food, Lebanon's is ","useful":23,"cool":7},"YlGNgDlrIIG0ut8wHqyQHg":{"text":"I had a very mixed experience dining here, although the food was very good. When i walked ","useful":0,"cool":0},"EJGVBm35jamG4nX8NMiQsA":{"text":"3.5 food + 1 star service. I'll be nice and round up to a 3 overall. \n\nWe rolled in on a w","useful":1,"cool":1},"dDgniCtp7VFKfbGZg2hpmQ":{"text":"Authentic Mediterranean food.  This was amazing and made my taste buddy happy. I am curren","useful":0,"cool":0},"-2YnlrtxcNfZ4mKKX20zdQ":{"text":"Came over here to enjoy a meal, as one does at a restaurant.  There are some great Middle ","useful":0,"cool":0}}