{"eNaxu-CVRoXWrzMtQLeu4Q":{"text":"Everything we ordered was amazing. Honey shrimp, tuna roll and the shrimp tempura roll are","useful":0,"cool":0},"IurGxQivwk4mgCSH__Dgqg":{"text":"The best place for sushi anywhere near downtown.  Good specials.","useful":0,"cool":0},"Z9lXewpIt2KbJc3E0iuVDA":{"text":"been twice now. Staff isn't super nice, they insisted we sit at a two top when there was o","useful":0,"cool":0},"fjyAlbzNXytNAU4wvYXZow":{"text":"Had to have some sushi while staying in New Orleans.  It was worrisome to consider such a ","useful":1,"cool":0},"af_1n_aQXgZDz6rmHx8KuQ":{"text":"Not sure why there's so little love for this place. Maybe you can get better or cheaper su","useful":1,"cool":0},"2kr1_eXfnBBjQRefRLLozg":{"text":"I've eaten here twice. The first was for dinner -meh. The second was for lunch and it was ","useful":0,"cool":0},"e8CO4X4RMj3HH4Q0yAhQOQ":{"text":"Better than Ninja and Kyoto, by my estimation. I had the eel roll and yellowtail roll. Fri","useful":0,"cool":0},"cyehDrxQg6s495X95OVmFw":{"text":"I see people complaining about the price here, but I don't get it. Some of the rolls (the ","useful":0,"cool":0},"QRobSRXaCIuOoO22x6bEew":{"text":"Good sushi! Tried the LSU, assassin and a few others.  All very good! Staff is very friend","useful":0,"cool":0},"sJ0HIh1qXrn0HPQ-oDGLKA":{"text":"I eat here a lot because its close by.  The sushi I've had is mediocre to poor.  The quali","useful":0,"cool":0},"rNkXedAxGdlndAcTslKhEQ":{"text":"I came in at 8pm on a Thursday night. The lounge was virtually empty and the restaurant wa","useful":0,"cool":0},"LDiFVl64uVzoA-fqzlrsvw":{"text":"The place is quiet and low lit. The food quality is really good. The bar has a nice select","useful":0,"cool":1},"x1GgxLYroixqM4CAi4Cp9Q":{"text":"Ordered. Quick app and beer while deciding on my to go order.  Great food and great attent","useful":0,"cool":0},"GxsXGI9-FJFX59Bx6eaSDA":{"text":"Great food. We had a rainbow roll, a veggie roll, a cucumber roll, and we enjoyed their yo","useful":0,"cool":0},"uI0eCmFN7caWsLsn0JK0wA":{"text":"We love this place! Great food always & the service was great as well. The NOLA roll is sp","useful":0,"cool":0},"RKsK0attLN4hfYtVSWGTFA":{"text":"Sushi was OK. I kind of expected more from a restaurant right by the water, but it was not","useful":0,"cool":0},"B4XBMrbJTOK7iY51PIdwcA":{"text":"Updating my review because I've been having a Wasabi summer this year.. While perhaps not ","useful":0,"cool":0},"1DQplWjBf-T7jJA2lCJO8w":{"text":"Weak and overpriced!\n\nI guess being that this is in the Marigny, your sushi options are se","useful":2,"cool":0},"8r148H63LIlePAtHMdWjBQ":{"text":"Not worth a visit. Sushi chef was outside smoking when we walked up and I did not see him ","useful":0,"cool":0},"eXd0wTd1IprvsfURkQlVgA":{"text":"Not sure what has happened over the years but this place has gone so downhill. The food is","useful":0,"cool":0},"xNprEuprGeFW2AWnYLu3hA":{"text":"Wasabi is a cozy little place to eat sushi just outside of the quarter.\n\nI didn't go and o","useful":2,"cool":1},"xS_ArbgmZ5po4S6-4kr3Kg":{"text":"I can't believe Wasabi has an average of three stars. What Japanese restaurant in NOLA is ","useful":2,"cool":2},"__yALDIEfB5R0aOq_0evFw":{"text":"Well.. I read the reviews before coming here and they weren't great but thought I would ch","useful":0,"cool":0},"-DdxzbTCmfYz6-KUiKI_EA":{"text":"unable  to seat a group if 15 when it  was not busy does not take reservations.  BAD ATTIT","useful":2,"cool":0},"rml75TWyJ54du4_fHsI7hg":{"text":"Weird place. Always empty. Saw cockroaches crawling around the sushi bar. Best bet is to h","useful":1,"cool":0},"w45M3bF_serY-j-shXjclA":{"text":"After several pleasant-to-just-OK visits, Wife wanted to go there last evening early.\n\nHad","useful":2,"cool":0},"CLOMqY6nt1RCWMvL-ixTRw":{"text":"Best Sushi place I've been to in New Orleans! Friendly and quick service which I love. The","useful":0,"cool":0},"yELxFxYp8C7G4KAvuQN_pg":{"text":"its all good sitting at the bar (sushi or booze). \ni'm a regular (bimonthly) and have neve","useful":0,"cool":0},"kPHXF8yTqZkCZMcHgNyP5A":{"text":"I've had some really great meals here, with surprisingly fresh sushi and sashimi. The mari","useful":0,"cool":0},"G6RHnPOCf8vgx3bGomaXOg":{"text":"What is going on. I eat here several times a month last night a friend and I went . We wer","useful":0,"cool":0},"Lh5lQnaEIxKTFQIr0nKT8A":{"text":"Three stars is as three stars does!\n\nThe front bar area is more inviting than I'd expect i","useful":14,"cool":6},"lcZ6RUWZkfsfqP23tNyntA":{"text":"I gave Wasabi a 3, but only because I couldn't give it a 3 and 1/2. It's not quite a 4, bu","useful":0,"cool":0},"548J-3W_1V97Opc7JGD7_Q":{"text":"The best sushi I have had in the Cresent City.  The quantity, quality, and cost make it th","useful":0,"cool":0},"vdug0DTZc8ymnASQWLrmtw":{"text":"Extremely good - excellent menu  and great food.  The service is very attentive and atmosp","useful":0,"cool":0},"3HrmliWMDelXPI0NMRXHgg":{"text":"a gem of a sushi shack in the marigny.  ok, it's not a shack, but it's dark and low ceilin","useful":1,"cool":2},"P0wvSWCIdIC6EWjGqvzhHA":{"text":"Walked in tonight to a bartender I'd never seen before. Two people at the bar and two tabl","useful":1,"cool":0},"p1jqI0PxiFfNg6Ycd_EX7A":{"text":"Good lord, I wish this place would get their act together.  The food is great, but my GOD,","useful":5,"cool":1},"Z8NCB9GHyoJkzzXNcLCJlA":{"text":"Options for traditional sushi were limited, but the American style sushi was tasty. Got th","useful":0,"cool":0},"rNmmMbMZEaV_9eYp_32Opw":{"text":"Wasabi came through again last night. We live just outside of their delivery area but thei","useful":1,"cool":1},"8Q3bf50miv5N-gUfkVSahw":{"text":"Great Sushi!!!!  We had several different rolls, my favorite was the Dragon roll...DELICIO","useful":1,"cool":1},"WlBijAfDS81ibzyuejHDMA":{"text":"The sushi is delicious, plentiful and reasonably priced. Try the crawdad sushi. The fish s","useful":0,"cool":0},"e5kpYwIdWOvXtpd0YeWgGg":{"text":"This place needs to better understand what it means to treat people with respect and hospi","useful":0,"cool":0},"AWqEgj_pWCmJ-7Tf3Wqfaw":{"text":"I had heard many great things about this place and it took me awhile to finally meander my","useful":2,"cool":0},"uYEmNNW98hyVm5tqvBCkPQ":{"text":"The atmosphere was fairly depressed, there was almost no one there and I had a sinking fee","useful":1,"cool":0},"q_mJhlHQTftkeShxISg_aw":{"text":"Went for lunch and the Poke' Salad was yummy, the the rest was so-so. \n\n(And jeesums, woul","useful":2,"cool":0},"0QhYzbwSmkEwThmOrj9CYw":{"text":"I haven't actually eaten in the restaurant so this review is based on my take-out experien","useful":0,"cool":0},"uiOr5-SadNkg0erGFmUulA":{"text":"Great food and atmosphere, everything was clean, service was prompt and professional.   Ha","useful":1,"cool":0},"BTum6dJPF-pDXfrM9KCfpg":{"text":"Given the lack of Sushi options in this area, Wasabi is A-OK. More like a 2.5 star rating.","useful":5,"cool":1},"SVW1XvgdacImf95P3YEgVA":{"text":"3 stars only? You yelpers are rarely wrong but I've had nothing but great sushi and great ","useful":1,"cool":0},"ajeMcF0WWRPbFOVqbdkF_g":{"text":"I can't believe I'm the duchess here considering I think it's A-OK.  I think I eat here so","useful":1,"cool":0},"sZkn_dCLqqaiEFEm7zXVRQ":{"text":"Wow, Yahoo maps lists me as 2.09 miles away and you won't deliver? Maybe that's why you ha","useful":0,"cool":0},"6PZXYeMaEDNA-lKCeZFUag":{"text":"Came here via Groupon for my first experience in sushi. I absolutely loved the tuna sashim","useful":0,"cool":1},"rKm8as4yAK4lz-NFySZbKA":{"text":"Back before everyone was eating \"sushi\" this was the go-to place.  Wasabi has items on the","useful":1,"cool":1},"TBvXPQUpIfJ16Pepyp1AkA":{"text":"I ate here for dinner one night and the food was good. Howeer, the attitude I got from the","useful":0,"cool":0},"R6EctkdLgrUQug8tVth9SQ":{"text":"I have to say I felt pretty ripped off. I wanted to like this so badly because of the cute","useful":4,"cool":0},"o_8jO0iwoWAP5ZzjD1fIHQ":{"text":"Wasabi is one of my lesser favorite sushi restaurants. The decor is cute and cozy, but the","useful":0,"cool":0},"kf2H1R53t4Dq7iTusIgXkg":{"text":"Had a nice lunch there today. My coworker and I decided to splurge and we spent about $50 ","useful":1,"cool":0},"0naLoQjvL44a4OnMm2qzMA":{"text":"One of our local friends recommended to go to Frenchman St to listen to real jazz. She tol","useful":0,"cool":0},"eERuc20g4DNndg2YfTeodA":{"text":"I hate posting negative reviews. It's in the interest of my taste buds and my stomach to h","useful":1,"cool":0},"D2S693Yq8gx3CnBNETT3Rg":{"text":"The soup and sushi tasted fine, but the snowcrab in in our Special Box was a lil too cream","useful":1,"cool":0},"_YBaDHQ2CTgiEVHiZeOjxw":{"text":"There was a time where I would eat at this restaurant about once a week. That all changed ","useful":2,"cool":0},"3b8xIbqvOn4EVFVHS-WvPg":{"text":"I'm not sure what's happening to this place, but it seems to be declining rapidly. It had ","useful":0,"cool":0},"IbHQoaxkQf6q31xS1jf8PA":{"text":"We stopped in for a quick 3 rolls to share during their happy hour. They were all deliciou","useful":0,"cool":0},"P4s5Ds_drV0mFJJ9_YCHKQ":{"text":"Ok I came back and ate in the restaurant and it was awful.  The order of edamame was cover","useful":0,"cool":1},"FYhrYSWRK9UcMbXWPrNafA":{"text":"Decent sushi, I had the French quarter roll and sake. Very good price for the area. The pl","useful":2,"cool":0},"fC3Ub2thEhDd2wXjcJolEA":{"text":"Went to Wasabi for the first time last night, and I really enjoyed myself. We ordered gyoz","useful":1,"cool":0},"KkWgs8BcYwJ5aVFwV3IdQw":{"text":"I was craving sushi last night but really didn't feel like making the trek up to Sake Cafe","useful":0,"cool":0},"swrJMS4KnNPm4RsoqKnvuw":{"text":"EVERYONE FROM CALIFORNIA... please shut up. this is good sushi for new orleans. not amazin","useful":1,"cool":3},"___RvufxpVXgbg7zMEHKRA":{"text":"I eat at Wasabi frequently for dinner... though it's never been horrible it's never blown ","useful":3,"cool":0},"k_dcrI-19qZFg6ZrwwXHLg":{"text":"I'm surprised by the low reviews- we've always had great service here, and the fish is alw","useful":0,"cool":0},"X33KvVHT3uKj4-kjFTr2aA":{"text":"I've been searching for a good sushi place in NOLA for some time now. I uncovered this nam","useful":1,"cool":0},"TJ4vFtiDRJCHml9axr8JDQ":{"text":"I eat a lot of Sushi. Just having moved to the area from uptown and craving sushi I decide","useful":1,"cool":0},"WHDfq9O5USuGYv76dolqXw":{"text":"When you're in the Marigny and you're craving sushi before it's time to check out some jaz","useful":2,"cool":0},"ou7ffFqJctlG-sprweFH_A":{"text":"I've had sushi from just about every joint in town and this place is spot on. They've been","useful":0,"cool":0},"NY7ayQ9OmtyYl6oEQSUJ6Q":{"text":"We stumbled on this joint after a parade on Frenchman. Great wasabi appetizer and rolls. I","useful":0,"cool":0},"Nvhg6m-h5c-PcSkPuLT3TQ":{"text":"its a unique ducked off spot, very nice atmosphere,  friendly staff, quick speed of servic","useful":0,"cool":0},"x7MpWPMcvKyiz26nwPyJqw":{"text":"The clear soup was disgusting and tasted like straight fish and swamp water very disappoin","useful":0,"cool":0},"r4wmR6vsrAekTFmCjwZHmA":{"text":"Story time! \n\nI ordered food from Wasabi through a delivery app (something I do WAY too fr","useful":0,"cool":1},"j9fZpvGO0sh_zBcOk8sgPA":{"text":"I love this place because the fish is so fresh.  I simply don't know why it gets bad revie","useful":2,"cool":2},"tDN5SdFW5BBCjS7e45pBTw":{"text":"Like their fresh made rolls and pleasant server. Nice grilled whole squid. Order come a bi","useful":0,"cool":0},"XKNbvWmxwoj87bN7aI-HPA":{"text":"My first time here I really enjoyed my vegetable Fried Rice. I also tried the salmon neck ","useful":1,"cool":0},"V6NtjfOkEuC5AXFbSPxAkQ":{"text":"Overall, I'd say this was an okay visit. The shrimp and veggie tempura was actually delici","useful":1,"cool":0},"9ElOKPN2NDxfZ8nq7FNBGw":{"text":"This place, just... No. After a few mediocre experiences I stopped going to Wasabi, but to","useful":0,"cool":0},"jAzN2ErG0IG-_jbsMZ9CXg":{"text":"If you really want good sushi simple perfect fresh excellent this is the place to go. I go","useful":0,"cool":0},"78sw2BLQ_XNOK4zCASFlwA":{"text":"It's never good to see the staff out for a smoke before entering a restaurant. Our server ","useful":1,"cool":0},"jEv4bap2Li7Sm-kUQvdFkw":{"text":"came in on a not-so-busy saturday && ordered the gyoza soup and the tempura cheesecake . i","useful":0,"cool":0},"lIPZAewCA_wYkBFvhtX6JA":{"text":"I ordered from using Uber east and according to the person I spoke to on the phone after r","useful":0,"cool":0},"rrCoDIp3bzz5h4DcA2psdg":{"text":"Just got the Frenchmen Scallops and Lake Pontchartrain Roll, the roll was pretty good but ","useful":1,"cool":0},"TyYU5su0xqk_QRMmb3O6Eg":{"text":"3/5 it is what it is...like really.\n\ni wandered in here after my groupon expired, but i fi","useful":3,"cool":2},"JU6wN4HbKWaggUdp--5cGQ":{"text":"Tho I've always enjoyed it, I hadn't been to Wasabi in a while. On Saturday night, confron","useful":0,"cool":0},"j8e9daVYjvmf6afiSVsSEQ":{"text":"Wasabi is average for sushi.  I've been here a couple of times and tried the Big Easy roll","useful":1,"cool":0},"pLhBumz_bZmcsglqR40-bw":{"text":"Sushi isn't very good. Place is filthy along the windows. Dead bugs and dusty. Food was un","useful":0,"cool":0},"6uz6fEp_RIS3VlkjeTGivQ":{"text":"Came here for lunch was quite impressed. Have yet to come for dinner  but do look forward ","useful":0,"cool":0},"axn7aupBjH6osTI2tOGNhA":{"text":"Having family in the Faubourg Marigny makes Wasabi a fairly frequent venture for me, espec","useful":9,"cool":5},"rveyuW0TbwymgYJK3Xmq-g":{"text":"Since the closing of Kyoto all of the sushi joints are getting into the ahi poke salad bus","useful":4,"cool":2},"v2iuyJrCxH3DLosb3YNrmw":{"text":"So I start my reviews as I am waiting then I'll adjust my opinion lol. Been waiting on mis","useful":1,"cool":0},"Nlm0QGgsZ2Ci5G-b2QmFiw":{"text":"During Covid ordered takeout . A mixed tempura (shrimp and vegetable) appetizer, NOLA spec","useful":6,"cool":3},"jDm2iuQpRLMdrg1sz5HcoQ":{"text":"I came here quite often since it is the most convenient sushi place near my house. Their s","useful":0,"cool":0},"KV7GAtRIMCIudN9800-0Iw":{"text":"It's hard to find bad sushi in New Orleans, but it's also hard to find sushi this good. Ea","useful":0,"cool":0}}