{"g2Uk3p3nG57hFJtlSK64ww":{"text":"SHAME SHAME SHAME. I have not had trash picked up from my house SINCE I BOUGHT IT. It's Au","useful":1,"cool":0},"FGi83QZeqWQU5L1K02VI3A":{"text":"This place is terrible.  Avoid at all costs.  Got the city contract so they don't need to ","useful":2,"cool":0},"z-G9vRgKnUJnOxO2wJjQUQ":{"text":"Generally reliable on trash pickup in my neighborhood.\n\nBut I've got a dead animal in the ","useful":0,"cool":0},"pKVkIN7bea5Np9Ryh6faqA":{"text":"I am regularly harassed by this company's garbage truck driver's around the Freret area. M","useful":3,"cool":0},"rTxJa_Kz7gFrP8G9u7oRmQ":{"text":"Just as I was starting to write a bad review, because my trash can is sitting out in front","useful":2,"cool":0},"GJTVYDbhoXMUiK11TYYdiQ":{"text":"0 stars!!! My trash is not picked up multiple times each month. I have called the company ","useful":0,"cool":0},"5ovE01dIrmtTah8DNiu8mA":{"text":"I've never had so many issues with a trash service before. You'd think it'd be simple, lea","useful":4,"cool":1},"LlRsQSaIZOgs6oErn5QaFA":{"text":"Update: the supervisor did come out today and my trash is gone! Btw Linda at the office is","useful":1,"cool":0},"gU0geU401_dffKd2js2vAA":{"text":"I have never had so much trouble getting my trash picked up in any other city. This servic","useful":2,"cool":0},"Wq-f5FJAEmsGiol7LkWjOQ":{"text":"I ordered a trash can a month ago, and I am still waiting for it. It takes 7-10 \"service d","useful":2,"cool":0},"VO1HNyneo-UaX06s5mTE9w":{"text":"I called 3 times on Friday because there is a HUGE gash in our car from the recycle truck ","useful":4,"cool":0},"zSR7H4Snk518ki1WMLwFTw":{"text":"I would give them a 0 rating because they don't even deserve a single star.  My recycling ","useful":2,"cool":0},"0A_YDbItxYaJryoXi37bWQ":{"text":"Do you have a nice car parked on the street? You won't after Richard's Disposal is done wi","useful":1,"cool":0},"XwYaSxm0AdO8itM_9ZSmmw":{"text":"One of two subcontracts for city trash removal. If their number is on your city issued tra","useful":7,"cool":2},"Rq8MA2eJdAvUfkI5ww9oTw":{"text":"Pickup days for the trash are Wednesdays and Saturdays in my part of town. For some unknow","useful":4,"cool":1},"ERYz4rzohAXKiU6RP51A2w":{"text":"This is New Orleans, LA. It is the city I was born in and that I am in love with for so ma","useful":4,"cool":2},"1XN-n48_pCwoenYTs5IHwg":{"text":"Richard's provides trash pickup at my office. They took the old can over 3 weeks ago and, ","useful":2,"cool":0},"C6VO_eEXw5gDckEspX1Phw":{"text":"Has anyone else been scammed by Richards on a replacement trash can? They have done this t","useful":1,"cool":0},"BZzYfLo71HPrPqeW1nCaVA":{"text":"I love the idea of recycling & Richard's gets it done for me at my place of employment. \n\n","useful":9,"cool":8},"QVeQ2ECrl2Rmo4ykLA4hqw":{"text":"If arbitrary policy paired with spurious decision-making is your game then these guys are ","useful":5,"cool":0},"BR3vhojv5inpYyxVx4iAxA":{"text":"Just try getting your broken can replaced. It will never happen - we tried everything- cal","useful":0,"cool":0},"6ovanQrfXtYC7u9ua7flUw":{"text":"Unfortunately, our fair city has a pretty poor track record in rewarding contracts to sub-","useful":5,"cool":0},"dvvqGq39-5fCuQszG_sGsQ":{"text":"I truly don't understand why all my neighbors' trash cans are emptied, and mine isn't.  To","useful":2,"cool":0},"aRLDODO8sPRFvtJOMh3u6g":{"text":"You're lucky if they show up at all. I had garbage sitting in front of my house for a week","useful":0,"cool":0},"SOI4MND6LbemlBdtiAQHjw":{"text":"Still no pick up and terrible attitude from the workers on the customer service line at Ri","useful":0,"cool":0},"8VxtPv0xlZio8fI-y2O_ow":{"text":"Horrible service...they wouldn't pick up our recycling because \"there was too much in the ","useful":2,"cool":0},"-DzLG4z32h6bU6cCOM1--Q":{"text":"The service was signed up for through the S&WB of New Orleans in June 2018. Once service w","useful":0,"cool":0},"4B6cKbbemo9MlTWtlmAJIg":{"text":"We have been struggling with refuse pick-up for well over a year now. The management at th","useful":0,"cool":0}}