{"7krqaly9DaIVAiBAy65k7g":{"text":"Outstanding! Easily the best food I've had on this trip and I've done quite a bit of eatin","useful":0,"cool":0},"EPer7YaOAWZ5WxCNcj8OhA":{"text":"Loved it.  I had the CBD, eggs biscuit grits and bacon.  The biscuit and grits tasted just","useful":0,"cool":0},"B2GjmsB_VRsvowI6R1RJXA":{"text":"This was an awesome breakfast spot!  Right across from the Sheraton.  Our server was great","useful":1,"cool":1},"aC3xBa_JQ3xTFpD47OFrHQ":{"text":"Nonetheless disappointed-no gluten free bread but only deserts from the local gfree bakery","useful":4,"cool":0},"oE3v-7l-kmA7BFVkuEi8MA":{"text":"We were in town for Esssence Fest.  We came across this restaurant after leaving a nearby ","useful":1,"cool":1},"NrXDKyOir3YOAwGgOC5eQA":{"text":"In from Kansas City, MO, looking for some comfort food. So glad we stumbled on Red Gravy. ","useful":1,"cool":1},"XUdTqpAnp4ZYTs5-F9-Q9g":{"text":"I was looking for a quiet place for breakfast on a Sunday morning and found this restauran","useful":0,"cool":0},"Xam6mCJHIZMQOZw1n3PlKQ":{"text":"The food was mediocre and the food comes out very slow, but the ambiance of the restaurant","useful":0,"cool":0},"bQin0BjAcGgCVq388wX9fA":{"text":"My husband and I stumbled upon this great place during our trip here in NOLA. The original","useful":1,"cool":0},"HreeLqiFSOpY5rsO52GuBQ":{"text":"We arrived 8pm Thursday night, were quickly seated. They have a Market Salad/Market Price ","useful":12,"cool":2},"dwqxwKa-O4RAy9dVHr_JUw":{"text":"Food and service was great! I had uptown because I wanted to try the \"red gravy\" and I rea","useful":0,"cool":0},"DM9tEKfbN_xRIGt91QbrvA":{"text":"Great place!! Original recommended place was 1.5 hour wait... We walked and got here and a","useful":0,"cool":0},"0YAJv0tNdrucHijYrVZdmg":{"text":"I've been wanting to come to this restaurant ever since it opened, and then finally made a","useful":0,"cool":0},"reZHnv08u9A3U117tg5lbg":{"text":"Wonderful place for an interesting breakfast! We had Baci di Madre (Mother's kisses), whic","useful":1,"cool":1},"FCQpQotjOsKluDNb6HFGjg":{"text":"I had the Lafayette special and my husband had the sloppy joe. They were both different fr","useful":0,"cool":0},"0RhlmYFoMvrX8NlUntAzbQ":{"text":"LOVE this spot. Excellent breakfast and service, could not be better. Returned twice durin","useful":0,"cool":0},"-ocEknX70SUEeTeB9WL4Bg":{"text":"Incredible restaurant! We started our brunch with a delicious egg nog coffee garnished wit","useful":0,"cool":0},"A62t8Z4DatccqsGdJ7cE8g":{"text":"Yes! Yes! Yes!\n\nWe had breakfast here, and it was fresh and delicious! After breakfast, we","useful":1,"cool":2},"xilcEvY7hMqGMc6U09V3SQ":{"text":"This is truly a neighborhood gem. We had a party of eight for brunch on a Sunday morning. ","useful":0,"cool":0},"e_a__EgE29genKEzBK3Izg":{"text":"Amazing breakfast menu, delicious sandwiches and egg pies. The meatballs are a must. Great","useful":0,"cool":0},"FUnKUlejg-tKWlCR79gOog":{"text":"Really enjoyed our meals here. Everyone's plates were cleaned! I had and recommend the spa","useful":0,"cool":0},"L1UwfL4Q2tSUbEhok4Assg":{"text":"My daughter and I both have Celiacs so we had to find a place with GF food.  Also, hey, we","useful":0,"cool":0},"wGpQu-aep5NvBycH48ENwA":{"text":"Food is excellent but everything else is HORRIBLE!  Went with a party of 12, and before we","useful":13,"cool":2},"XG7tOWh2twuvSigsXdO7Yg":{"text":"This is an interesting spot with some unique breakfast choices. We ordered the eggs Sicili","useful":0,"cool":0},"1jN39OX8ufOppb78KgIa6Q":{"text":"Wonderful breakfast ,bring an appetite we ran out of time I would have loved to go back fo","useful":0,"cool":0},"HlzLFm6b08pPOpijmuZ0kA":{"text":"This place really has 3 things wrong with it.\n1) the items on the menu are deliberately we","useful":7,"cool":0},"WvfspcboRrk3S2ZxyekRAQ":{"text":"I kind of felt like a tourist coming to this place and standing in line bc that's all the ","useful":6,"cool":4},"-qvVuniDbnKKPbzdFl43WQ":{"text":"I thought based on the wait time this was going to be an amazing breakfast. It started off","useful":1,"cool":0},"AYItos5a3vrWZtSOsrkMmQ":{"text":"They have good food I won't take that away from them but the service is where they drastic","useful":10,"cool":0},"fT63XLEZ7KnOv_M6k2tPFQ":{"text":"Y'all - Roe's Breakfast has been changed. It's totally different now. There's no explanati","useful":5,"cool":1},"xNJfgMf3WcYrP8vz6qjA9A":{"text":"Hearing about all the food in New Orleans, I couldn't be more excited to eat everywhere. I","useful":2,"cool":2},"EF3LLdW9NialE7t2Raik9Q":{"text":"This place was a late night find and it was yummy! It's all fresh made pasta, the even off","useful":0,"cool":0},"BwnVJePQdLqPXPblRLHYIA":{"text":"Found this place when the wait time for Ruby Slipper was unbearable.  Cute and cozy little","useful":0,"cool":0},"TY3duwjdRlQYLdW0F7WDjA":{"text":"We were glad to find a brunch reservation here during JazzFest, and a live musician playin","useful":1,"cool":0},"3FrnsPUNAsAyd8QuShx0FA":{"text":"Delicious red gravy which is more like a marinara than a gravy! The omelette with meatball","useful":0,"cool":0},"AMwtAPmWY4a7636oBsUVUQ":{"text":"Benedict Cordon Bleu hit the spot with a biscuit on the side..worth the wait.","useful":0,"cool":0},"7aasfVNUjHAf9UIXfsK1Wg":{"text":"Neat little place for breakfast/brunch. Stumbled across it. The food was good, but not any","useful":1,"cool":0},"tfp4dVpGpjLreuS48Z-Etg":{"text":"We had a great breakfast at Red Gravy. I usually don't think of meatballs for breakfast bu","useful":0,"cool":0},"X--jzowsF0zZy-mJ6j6HrQ":{"text":"Was a great little spot that we stumbled on for breakfast. The food was amazing and the at","useful":1,"cool":1},"4FnCOAcb6uuIp7x4FCUTrw":{"text":"Being from New Jersey, I know good Italian food and stumbling upon this gem was the best e","useful":0,"cool":0},"7rRjXGA_m2iSs9XScNQrmA":{"text":"Terribly rude owner, lackadaisical service. Wish I got to eat there but after waiting 20 m","useful":8,"cool":0},"LWePoolhBjZhTZgBx6JIBw":{"text":"Small place, but the food was tasty. We were able to slip in for breakfast. Tried to go to","useful":0,"cool":0},"dJmjBBDpAMpnV_QdZoiTWA":{"text":"Came for brunch on a Saturday around 11:45. I was seated right away in the interesting & s","useful":2,"cool":0},"3ycIxZNx-N7XLFZCho12SA":{"text":"Great little find. Our waiter was very attentive and helpful. We ordered a plain breakfast","useful":2,"cool":0},"z6_fp1EmJjF1zRW-5leK0w":{"text":"I would like to start out by saying how wonderful the food and ambience was! This restaura","useful":0,"cool":0},"XJYJaNqEfQMTbkkh9nVlzw":{"text":"I hate writing these kinds of reviews.  I am all about the food, so I will overlook a lot ","useful":32,"cool":0},"4DDSw13IGPUlXqOUayb9bA":{"text":"Divine!!! Let there be no mistake, red gravy and meatballs for breakfast can be a little o","useful":1,"cool":0},"SqeUKA-Z6NJCJ5bOLq-4vw":{"text":"Twilight zone. We tried three different times to eat dinner here. They are only open thurs","useful":1,"cool":0},"H5K8SHbJkt1c1hND6qJuVw":{"text":"This is our first time in New Orleans and the Red Gravy  was our second choice of places t","useful":0,"cool":0},"SKVDymhWvR260B6GDq0bKg":{"text":"My expectations of this place started off high with the adorable New Orleans Italian name.","useful":8,"cool":0},"3KSqbpM27MjkWXUPVHpqCQ":{"text":"had lunch here today and split a pasta carbonna with my boyfriend. $20 is a bit high for a","useful":2,"cool":1},"hPjEYidZaMArDbCPiQ84hQ":{"text":"Horrible experience here, first we wait 45mins on a slow Sunday, then our party of 4, (2 a","useful":3,"cool":0},"4BM_4MblyxKI4IB2p4PtQw":{"text":"We happened on the Red Gravy because an Italian themed restaurant by a well known chef had","useful":1,"cool":0},"8ZrYcZBi_P9nK526lcpNhw":{"text":"This is my favorite Italian restaurant. Best bread ever and their lasagna is second to non","useful":0,"cool":0},"GdbzmZY9D6cgrwztwY_wTg":{"text":"We were looking for a place to brunch. There was no waiting line at red gravy and the wait","useful":1,"cool":0},"eA7a2efLmgZQ-mJR6CV9cg":{"text":"I had heard some chatter on TripAdvisor about Red Gravy, but never was in the area to test","useful":4,"cool":4},"3yDXdZSbr-fi6d9mwiHqdA":{"text":"This was hands down one of the rudest encounters of my life, and the food was just mediocr","useful":8,"cool":1},"Y1nBnPxQJtMLFxuCMQGPJA":{"text":"It's a cozy little restaurant. But they give you little food to match. I ordered home frie","useful":5,"cool":0},"OpWVEYP4kjbyIMs6x8y9Gg":{"text":"I had the Sicilian Egg Pie which was very good.  My only complaint was its a little pricey","useful":2,"cool":0},"Vqkz3rpQvVuCHaGuUZafFA":{"text":"If you are ever in town; this is a place to stop and have brunch. The service was not all ","useful":0,"cool":0},"Rp3EuKXZKKhiyWvcU-NwgA":{"text":"Delicious and different. Large portions. Very busy so be patient. It's definitely worth th","useful":1,"cool":0},"h7X09tXeSFGQ0WxH3c8AEA":{"text":"I went to brunch here today with some friends.  Food was good and I cannot wait to try som","useful":0,"cool":0},"ixrL1_F3ptcJ5V22F0ughA":{"text":"I had what may have been the most DELICIOUS breakfast of my entire life here. Unfortunatel","useful":0,"cool":0},"IChCr4r6TAXxld_-_HuD2g":{"text":"Seriously great food.   Server was very attentive.   Food came out quickly.   They handled","useful":0,"cool":0},"08ew8bJP0JWXTCbIUFNfNQ":{"text":"Wow!! I got the grits with Sausage and red gravy... so good - this might be my favorite me","useful":1,"cool":1},"NN2DF0A2EQ2_9SQ1P_IiMQ":{"text":"Stopped in for brunch on a lark. Everything we had was good, but Santa's Breakfast was bom","useful":0,"cool":0},"30SBBwzOtv9tXgAy9ZbxZg":{"text":"If you follow any special diet, be prepared, as they don't allow substitutions. (While I'm","useful":10,"cool":2},"B-iSLiucmjiklVbwBnnobQ":{"text":"Very small, quaint environment. Food was good but for the amount of the bill, I doubt we w","useful":0,"cool":0},"KtsWNQLnAJw7gh8GE7E4Ng":{"text":"Good food with a unique twist. The service staff was great and the restaurant was cute. Ho","useful":0,"cool":0},"Pp_ufg9PWLWN2wVWF8R-Gw":{"text":"Went to Red Gravy last night for dinner. We were greeted immediately by a very friendly st","useful":0,"cool":0},"ZP58rLG7TCf2lA0bAj6iNw":{"text":"Visited this restaurant twice during the Essence Music Festival weekend July 2014. The fir","useful":6,"cool":0},"dIghWzlb5ix9gmgaDgNlzw":{"text":"Great stop for lunch.  The red gravy was excellent.   We ordered the meatball sandwich and","useful":0,"cool":0},"tlEkW7Jc62AM1VgqFP3v8Q":{"text":"They were out of almost everything. Also my friends are gluten free and although they did ","useful":15,"cool":0},"4YvwqNlko8k923xV1hqxcw":{"text":"Sooooo, got back a week ago from New Orleans and while we (9 gal pals) were there, we made","useful":1,"cool":1},"nGS4ylmSejx-s4EonfaIQw":{"text":"The food was very good (rich!) and the service outstanding.  Even though the food was of h","useful":0,"cool":0},"iph-hI48V6fYrYjrfeolLw":{"text":"Very disappointed place. Slow service and overpriced. A pasta without meat is $20 and it t","useful":2,"cool":0},"fY_1jh1NBD-nGUVRh5lqgw":{"text":"This place is wonderful! The food is a pure treat to experience. The staff is attentive an","useful":1,"cool":0},"XkaCVYe6f4odZJuIe4TR7Q":{"text":"Excellent brunch. Very friendly/attentive staff, cute ambience, and delicious food. My boy","useful":2,"cool":0},"5VFxnuAHBpKZ-nDFHOY-Vg":{"text":"Best cheese & meat board ever \nGarlic bread was to die for \nBolognese has very homemade fl","useful":0,"cool":0},"UiS_8gGCcYA5ZWQ3-C2Bfw":{"text":"Today's Tip of the Hat goes to the happy little band of locals who run the charming Red Gr","useful":1,"cool":2},"TW-EVQogbHaqXKjLkKC2zw":{"text":"All the food was delicious, orange juice was fresh. The staff was nice and courteous. Frie","useful":1,"cool":1},"dEE2y8l2baJ-Q3F6myL64Q":{"text":"Funny story... My wife and I were eating breakfast and a gentleman walked in and sat down ","useful":0,"cool":0},"Z6cHslzNHF8sfdLQDEXPlw":{"text":"wonderful salad that I could eat everyday of my life.  creole tomato's with shaved mozzare","useful":4,"cool":3},"4sZkAAm3I1ydxs3LtfdYNw":{"text":"Arrived for breakfast and were greeted by a friendly hostess who took my cell # and said t","useful":0,"cool":0},"T7nY25U6Fol_V2l6xKzrag":{"text":"Are you kitten me right meow? \n\nThis little gem was amazing, what a find! Quiet, amazing f","useful":1,"cool":0},"3_nhZ7Y_7RYSvJVQg72jfw":{"text":"I rarely leave reviews, but this place was incredible for brunch.  We both had the Chicken","useful":0,"cool":0},"GSEvuHQEuJYV6XIr7wOa1Q":{"text":"We had an amazing brunch at red gravy! The restaurant is so cute, the owner makes all of t","useful":1,"cool":1},"MwsuifAdVqH6V-Ql2hD0EQ":{"text":"Absolutely spectacular breakfast.   All farm to table with an Italian flair.   Had the mea","useful":0,"cool":0},"u5ux7Foe9KI8RWLDxPNQxg":{"text":"Overpriced breakfast!!! Decent breakfast but not mind blowing. It was Sunday morning, and ","useful":1,"cool":0},"P4KWabJZgxSHPGeAplAABA":{"text":"Best breakfast & service we had while we were in NOLA.  Loved it so much, we went two days","useful":2,"cool":1},"8VKoXO28yo0Z2R_GWKJ4Jw":{"text":"Was on the way to  A place down the road but they had a long line as usual so decider to t","useful":0,"cool":0},"ffYXOc7o1lhBqkasifEwhA":{"text":"Pricey, but pretty good. So I had their signature dish the Red Gravy spaghetti, and was as","useful":0,"cool":0},"hi2H-T1t6WANIBiaShoqhA":{"text":"Fancy place, soft lighting. Avg food, high prices. More workers than necessary - a lot of ","useful":1,"cool":0},"kZWIuabekfvcpt-1eaw4CA":{"text":"This place running a dead heat for my favorite breakfast after a week exploring restaurant","useful":0,"cool":0},"RmMQJBRJ4Jj3WmTUPMN7gA":{"text":"Good brunch, but in terms of ambiance and quality of the food, it is a bit overpriced.   (","useful":2,"cool":0},"gSsiNTnlPm8BReb4sWA1MQ":{"text":"Well here is the dilito.  The food was amazing. I had chicken and waffles and the meatball","useful":6,"cool":0},"cwcpMmQrWqiBp61AzHwSfQ":{"text":"Meatball was amazing. Stopped in for brunch the day after Christmas and was greeted with s","useful":0,"cool":0},"gxdNtItlL-Ojq1XSx-Un5A":{"text":"Normally when a place closes at 2, they stop seating people at 2. This place closes earlie","useful":9,"cool":0},"CjMm1_SxRPO4XLo7zHomPQ":{"text":"Cool place! The 9th Street Philly was delicious. The Nancy was great too. Highly recommend","useful":0,"cool":0},"FsZB1HEVIRVz5pL-iTaUyg":{"text":"Amazing food, amazing service, great atmosphere, loved this place! Went here for breakfast","useful":1,"cool":0},"lBLVKhSXLPBlDLkaAoFmtw":{"text":"I just wandered into this place, as it was across the road from my hotel. I had breakfast,","useful":1,"cool":1},"dDuHlLjjC67OYHjo-AWBNQ":{"text":"Had an amazing breakfast here last weekend.. def order the polpetta! The \"red gravy\" is ac","useful":2,"cool":2},"I7JtPDMFzn6HbCh_OaKVtQ":{"text":"The food was good but the prices were way too high. We spent $90 on breakfast for two with","useful":3,"cool":1},"upVbUZfnSHJwMTIWd3XZMg":{"text":"Very delicious food and drinks!! Woke up and rolled over to get the hazelnut spiked coffee","useful":0,"cool":0},"Nat57SdJ_8nodIUwdjy45g":{"text":"Charming little place with a super friendly staff! I can not wait to go back. We went for ","useful":0,"cool":0},"0wBWleOQOBppSkKtSZhmvw":{"text":"Just started working in the CBD and was looking for a lunch place. I tried Red Gravy's mea","useful":1,"cool":0},"_wtsbMyHbPRWPawO7l849w":{"text":"Food delicious if they have it.\nWe arrived to a wait for the weekend brunch as expected. B","useful":1,"cool":0},"C8T-cUfLHn_4px8OLUPUZg":{"text":"Had lunch here..decor is descent..service is good...they have yummy Meatballs and pretty g","useful":0,"cool":0},"Tq2HJuvZcl8C4Ev4rv6VNA":{"text":"I stay at the hotel right across the street from RG and walked in on a Sunday morning with","useful":1,"cool":1},"bqMNPB2z1woNsv5ii_D2pg":{"text":"Brunch was fantastic . I usually go to ruby slippers but a friend told me about this littl","useful":0,"cool":0},"I6yAU2nlxmuacw-cVSsJgg":{"text":"We were staying at a hotel around the corner and saw another restaurant that was always ja","useful":4,"cool":1},"a-fOmZXWRYh5g43iSmjPNw":{"text":"My mistake this place closes at 2pm... Was not paying attention. Got here 1:45. Greeted wi","useful":2,"cool":0},"vmadk6m9aUW4rEiWsUeSlA":{"text":"Stumbled in at 11am on a Friday from my hotel around the corner. Dining room half empty, s","useful":1,"cool":1},"PFemXog5rnjs6aETxMAMCA":{"text":"Amazing atmosphere and outstanding service to compliment the delicious food! Grits are ama","useful":0,"cool":0},"wVSKzMWdeTTZIAKcnOEoZA":{"text":"If ruby slipper is full and you have a party of up to 4, definitely come here. Small, cozy","useful":0,"cool":0},"1rBMwVTm21hiktpGYSqDUQ":{"text":"First time at restaurant. Went for lunch on Lundy Gras.Excellent freshly made pasta was a ","useful":1,"cool":0},"jQA566wLtGj8JhbLezo4jw":{"text":"I had the carbonara, it was delightful. The noodles are homemade. The restaurant sources i","useful":0,"cool":0},"axSvfxbXhWH51UUzd1nJgw":{"text":"I was staying across the street at the Sheraton New Orleans Hotel on Canal St.\n\nWe were go","useful":1,"cool":1},"JqVRw_CT_wHy_n1E9bvtMQ":{"text":"Amazing! Amazing! Amazing! Live music. Great food. Friendly staff. Warm atmosphere. I rece","useful":2,"cool":1},"mUU0-qZuxLTwAKnPnfGI2A":{"text":"I ate here 3ish years ago, so 5 stars may be a little much, but I remember being very plea","useful":0,"cool":0},"aMEQzc4JKZDxhMSF7PR6dA":{"text":"Wow, I didn't realize what a great combination meatballs and eggs make at breakfast! I had","useful":3,"cool":1},"8mcDakhb04dIUbWOylWA-g":{"text":"The food here is mediocre. The omelet I ate was okay and didn't make me jump out of my sea","useful":1,"cool":0},"5hKXXwawqjqMTh7sL9GiUA":{"text":"Went to Red Gravy this morning with hopes to start the day on the right foot.   I wish it ","useful":12,"cool":0},"f55Qy1HOVmsYgnrf2tu0zA":{"text":"GLUTEN FREE CELIACS or PEOPLE WITH FOOD ALLERGIES DO NOT GO HERE!!!! I could see how this ","useful":11,"cool":2},"dFK-SaDKmuRLBOrBjoV5LQ":{"text":"Beautiful place, tastefully decorated and intimate. This is the second time we're having b","useful":1,"cool":0},"00XYblAyNDN7jP7KOn0asQ":{"text":"Great place for breakfast and don't worry about the construction near the restaurant as th","useful":1,"cool":1},"1hd6NekurL0v891ROC1Uaw":{"text":"I had the carbonara with gluten free pasta. It was excellent. My husband had the meatball ","useful":0,"cool":0},"ZrejWlhKXmYfA-uxsJ5bEg":{"text":"Portions are huge (seriously, my breakfast sandwich was a foot long) and the service is ex","useful":2,"cool":0},"e2R3unPT9lc8VnDiQiyUww":{"text":"-Cozy cafe /ecletic decor ex.( witch dolls above Bar station, Creamers and half & half pla","useful":0,"cool":0},"lKyDqPj2v9p9P1DtlCT4Kw":{"text":"Our server Gregory was amazing !  Prompt, courteous, and funny!  We tried Lou's Breakfast,","useful":0,"cool":0},"rJuIaA24VKsnTwqQmMMMRw":{"text":"Pleasantly surprised! It's a cute little restaurant with an awesome breakfast/brunch menu.","useful":0,"cool":0},"Qf_BKO_y5M77BSdkfAYXQA":{"text":"Apparently my review went into \"tips\" - whoops!","useful":0,"cool":0},"abCAbP9GrbgfDEYGMfLQjw":{"text":"This restaurant  owner doesn't understand that customers don't want to pay for bad food tw","useful":22,"cool":2},"88u3kLvSQHFlKVeHLv6F1Q":{"text":"This was a nice little surprise for us this morning. We are from the Memphis area and had ","useful":0,"cool":0},"pJAwXjeXsEgpokShbIO1XQ":{"text":"By far my favorite food experience on my latest New Orleans trip. I guess after a few disa","useful":2,"cool":2},"qV25XfqpIEpt4My5eiP9Fw":{"text":"Hands down the WORST service I have ever had at a restaurant.  I am just getting over the ","useful":11,"cool":0},"QpA-IvHubs3Gl-qgOkkJiw":{"text":"My first bad meal in New Orleans.  Place was recommended by a friend. I ordered the chicke","useful":10,"cool":0},"jtzAzCWFeihJuaJRWkC6kA":{"text":"Great music, cool a/c, great food and atmosphere. Waitstaff was awesome and the bathrooms ","useful":3,"cool":0},"cBk2yvhM7DjUCMsZpM4HSw":{"text":"We ate here at someone's recommendation for Brunch. My husband enjoyed the French Toast wi","useful":2,"cool":1},"7KPgW0-m98lGHkoKRC9lHw":{"text":"The \"Red Gravy\" my husband got was so good he asked for extra bread to mop up the sauce th","useful":0,"cool":0},"vBMjvb8bu99IjHiA_-eIGg":{"text":"I had Lou's breakfast. The pancakes were delicious. The syrup was thick and buttery and th","useful":0,"cool":0},"SUrLbs5UeG9qm-Iowb7vIQ":{"text":"My mother, two young children and I just got back from eating at Red Gravy for breakfast. ","useful":1,"cool":1},"Z4jH6sNYe8QC1mB5HotY7w":{"text":"Came here for breakfast. Terrible service. Got the order wrong twice! And there were only ","useful":18,"cool":2},"DXP8ool9q74QgSXCgZgZeA":{"text":"Really enjoyed our breakfast at Red Gravy! Not knowing that \"red gravy\" (as Italian tomato","useful":1,"cool":0},"CN67oBT7GJjbiTLof2Iq2A":{"text":"This was a good hole in the wall and better than most of it peers in the area.\n\nWe had the","useful":0,"cool":0},"gIj0YbELCNePWV0-PjLY8w":{"text":"Food is amazing! But the hostess is extremely rude, which is so rare in this city. Definit","useful":1,"cool":0},"89C7Map2Pfqm1cRNyX90jA":{"text":"Horrible experience!  Very long wait to look get menu and coffee.  Another v-e-r-y  l-o-n-","useful":4,"cool":0},"Hs80lnH_l_5mtfXesBYWAg":{"text":"The food here is ridiculously good. Authentic Italian bursting with goodness. Am way overd","useful":1,"cool":1},"Y7bLRnQU-iTxQs5GfBM-Cw":{"text":"Some of the best shrimp and grits I've had, to be compared to all other shrimp and grits I","useful":1,"cool":0},"hLwiW7ANyRrie3T7Xh_hWQ":{"text":"Convenient location near my hotel, but the food is wonderful! The CBD was on point! And th","useful":0,"cool":0},"QrmY0t2_KJkoo9mHKC830Q":{"text":"Best omelette ever!!!!! Came here twice during my four day stay to get breakfast here. Can","useful":0,"cool":0},"O6oDUsLvul-K756IB9M0OA":{"text":"All time the best breakfast I have ever had! The praline pancakes are to die for. Was able","useful":0,"cool":0},"VbAVxbM1v2mHrDNGMzGDDQ":{"text":"\"Red Gravy\". \n\nWhen you first see this, you think \"What kind of crazy strange gravy is thi","useful":2,"cool":1},"yORR5r4wZRRfbJc19EKLhA":{"text":"This restaurant is the best kept secret in NOLA!   The brunch is crazy good.  They do serv","useful":1,"cool":0},"UWlLlrYU4nHS4qv_fRiYyA":{"text":"WOW!\n\nI hadn't expected to have these great meatballs for breakfast with my eggs.  A super","useful":0,"cool":0},"EZ4GNCWCpJTnX9CAPA3Nvg":{"text":"Bar none, my favorite breakfast / brunch place around. Anytime a friend visits New Orleans","useful":0,"cool":0},"IFXcpXYWuSAAxaRAyEvaUw":{"text":"Delicious food, while they warned us the kitchen was backed up from the lunch rush (kudos ","useful":1,"cool":0},"zCW3TOuCnDR-wkjEoN7cXw":{"text":"Be sure to hit this local spot for a great meal. I stop in for breakfast and was blow away","useful":0,"cool":0},"ixDSWSyTGdlanAShJ135MA":{"text":"My partner and I enjoyed a wonderful breakfast at Red Gravy before boarding our cruise.  T","useful":0,"cool":0},"DciwGBY-3ncE3qXsHS2Kkg":{"text":"I absolutely LOVE this place!  Best red gravy that I've had in New Orleans yet.  \n\nI have ","useful":2,"cool":2},"XqNYcMVuRKHu38aenTO9fw":{"text":"Absolutely incredible!!  We've been here probably 6 times. Charming hostess/owner sat down","useful":0,"cool":0},"WOLb5M28vtVKlkYngNdjsg":{"text":"The beginning of our visit to Red Gravy was a little awkward.  We didn't have a reservatio","useful":1,"cool":1},"JunDhWzjYOpuQJVkaJw-ug":{"text":"Red Gravy is a fantastic spot for brunch! It was near our hotel so we frequented it while ","useful":0,"cool":0},"P5rJCtixXbeU_ikHUd2QUw":{"text":"Great breakfast! The ambiance is fantastic - small, low lit, great acoustic guitar player,","useful":1,"cool":0},"-wOEzTCXDi6Pq0yIG9EfCg":{"text":"Sautéed bananas with chocolate chips on browned buttered pancakes with a chocolate bourbon","useful":1,"cool":1},"xpt5pWWdTlFWWA5lWVWy3g":{"text":"I don't understand what is going on at this place. Clearly, after looking at all the revie","useful":12,"cool":0},"CxiE8t22XInWcTNT1aMKSg":{"text":"MIXED QUALITY FOOD - SERVICE - DECOR. Some of the dishes were really tasty, but overall we","useful":9,"cool":0},"ZHenGc7_q9fIpcckzSaNjA":{"text":"Was good but if had to choose between other place I have eaten in NOLA - it is not my favo","useful":2,"cool":1},"f5M8lOK2rTAqUF6xd8s1Kg":{"text":"First visit to NOLA - We collectively believe nothing on the menu will disappoint! Enjoyed","useful":0,"cool":0},"p-lwgLYaLeP99_EIYo8t7w":{"text":"The \"on the shore\" omelette was great, but the small stack of blueberry pancakes were way ","useful":1,"cool":0},"f0zDfI3bdpQdLtvcNrmE7w":{"text":"Each night in New Orleans I walked by this restaurant on Camp Street and finally decided i","useful":2,"cool":1},"IIwGr6cRA7-auZsXGPss7A":{"text":"Good local spot for breakfast. The staff there are very friendly. The waffles with fruit a","useful":0,"cool":0},"UJPEFYZgJ-a1j93UiTGzNg":{"text":"This place enjoys harassing its customers and they are unapologetic about it. My wife want","useful":9,"cool":0},"C51ibDG2rESWnTxaEyHWwg":{"text":"Wonderful, simple food in a homey atmosphere. I had the Lombardo-- grits topped with sausa","useful":2,"cool":1},"K9hCrcOx-wuSmlJTgFQEGA":{"text":"Can't say enough good things about my experience at Red Gravy!! Really nice place on the i","useful":1,"cool":0},"zZSPhOh_0shYCz9HHHFFMw":{"text":"Used to love this place, stress on the \"used to\".  \n\nThey used to have an amazing fried ch","useful":25,"cool":3},"6UncIGTKdw0ZqzPG3XtDHg":{"text":"If you are ever in New Orleans DO NOT eat at the red gravy restaurant. The manager is not ","useful":1,"cool":0},"PEAvT6LgrB3LWrR353hwhA":{"text":"This is the place for fantastic Italian brunch. A very talented musician entertains you wh","useful":0,"cool":0},"nxrEXpXOs14aky4AAXgOfw":{"text":"Red Gravy is a locally owned breakfast, brunch and lunch gem! You won't be disappointed!\nS","useful":0,"cool":0},"Mu9HcWuD7ERS__ayir_J0Q":{"text":"The drinks were swift, service was prompt friendly and polite. The decor was subtle and ve","useful":0,"cool":0},"Mxgn3w9_eGD-_zURS47rrg":{"text":"This is advertised as gluten-free. I ordered a gluten free spinach salad, it came with bre","useful":8,"cool":0},"kL84eP0y1pwkWNeKzQ5xbw":{"text":"Great Food, but make sure they are open! \nThis little place is great. Great fresh food and","useful":1,"cool":0},"4nhtFY56LjtVTAhzTGRVHg":{"text":"We noticed there was a short wait compared to Ruby Slipper (which is where we ate the prec","useful":3,"cool":0},"ESTwgq-wDrNUq0omMvkyRw":{"text":"This is a difficult review to leave.  My first handful of experiences with this restaurant","useful":2,"cool":0},"X0O5E32-xApnUUa8crVzHA":{"text":"best sauce and meatballs i've had in a while! Very easy to tell that food is fresh and mad","useful":1,"cool":0},"xaaNKAMpSfIKWzPMXZhOIg":{"text":"Patrick was awesome !! From the moment we walked in until we left he made sure we had what","useful":1,"cool":0},"hoIBGLjlfElCsCo0zSCjiA":{"text":"A gem in a city of gems.\nStep outside the normal for an omelette stuffed with meatball and","useful":0,"cool":0},"0DJWatMRkJiUzr5Z2ZOMvQ":{"text":"Good grits accompanied my meatball omelet with marinara-esque sauce.  The meatball was goo","useful":10,"cool":0},"BzVw4Kw2ehZ2yt4cJizxcQ":{"text":"We decided to come because our hotel was across the street and was rated great on Yelp. Bu","useful":4,"cool":0},"hd2B81afqx5ljQgB4RrV_g":{"text":"This is an absolute must! We heard about this place from friends and we are sure glad we d","useful":1,"cool":2},"SKBVStzk8-GmSHLHEK3Kyg":{"text":"This place was close to our hotel and offered a variety of fresh delicious breakfast optio","useful":0,"cool":0},"YLncszBtR3B7IjSLL_wA9w":{"text":"I like this place and the food is good, especially the homemade meatballs!  Couple of anno","useful":1,"cool":0},"Fofgnjzr4jbatFAqwNCRww":{"text":"Lovely little spot just steps from French Quarter. Our group of 5 had a very tasty breakfa","useful":0,"cool":0},"fOb1l-KlG4VmDzg2UDz-Ug":{"text":"Delicious!! The restaurant my friend and I wanted to go to had a 45 minute wait so that ho","useful":0,"cool":0},"JO5N5o2RcpLqRSWn5V69qg":{"text":"First off, I have had my fair share of good breakfast food...I mean, I make a pretty good ","useful":2,"cool":2},"IMRTFaMzzpLiNK_R3hcHDA":{"text":"Food and staff was fabulous! Ate breakfast there around 8:30am and still not hungry at 2:0","useful":1,"cool":0},"A9sO-ibItnsEqCpTcX1zLA":{"text":"Dinner!  From the reviews, you can get the impression it's just breakfast and lunch at Red","useful":1,"cool":1},"ij8o8Ri3XM8fsPYKG-eHHQ":{"text":"I had lunch at Red Gravy on a Saturday, the menu is broken down between weekday lunch and ","useful":1,"cool":1},"rKPJaIOg8_ITvn6YtOsT0w":{"text":"Extra points for originality! It is on the more expensive side of breakfasts and not your ","useful":0,"cool":0},"Q-FkKMPzM0qMkOCRnNT26w":{"text":"This review is 2 months late, but either way here goes.. one of the absolute best food rel","useful":1,"cool":1},"-mA0TlUk8YdoikesUd12cg":{"text":"Very rude waiter. Absolutely no flexibility with menu. Don't ask for fruit because it's no","useful":8,"cool":1},"PJ383HeJoKYMaPvDrlOUGA":{"text":"Great place for breakfast/brunch. I had the meatball sandwich and it was very good. Enough","useful":0,"cool":0},"6Vf1MkxDPrTcnuKYUldjFw":{"text":"We had food from this \"restaurant\" delivered to our office for a luncheon.  Big mistake.  ","useful":8,"cool":2},"aVicVPrjr6bs2uv63QVrGw":{"text":"Such a cute place!  Not a long wait and wonderful food!  Live music and great service.  Th","useful":0,"cool":0},"iN9Yg5OU7MCQDmsyuiMqQQ":{"text":"What a fantastic breakfast! We were greeted warmly  upon walking in and seated thereafter.","useful":0,"cool":0},"F3-PMYIpK2F624zxDEF4mA":{"text":"The hostess was a complete witch. Unprofessional....i would never recommend this place to ","useful":8,"cool":0},"cfqQ55AKmDpJF5h26Ali5g":{"text":"We loved our meals at Red Gravy. Yes, meals. The first time we wandered in the place was j","useful":0,"cool":0},"_s7SwwWeYcT72GD7OTjSYg":{"text":"I LOVE Red Gravy! The restaurant AND the sauce. Being from NJ, I'm accustomed to a certain","useful":3,"cool":2},"h9wDGCIhttlpS42KD9n_LQ":{"text":"Food was soooo very good and very healthy.  Waiter was exxellent. Very friendly and layed ","useful":0,"cool":0},"XrgI9PSBiwhBbAaVNBsaOw":{"text":"This is my essential breakfast for every day that I am in New Orleans.  I was treated to a","useful":0,"cool":0},"0EIqKsO6UhMj3gIgP4Jdng":{"text":"Hidden gem. Food, service, and ambiance were impeccable. We had the Polpetta omelette and ","useful":0,"cool":0},"hMZi7UwB8ckDQCJFVckGVw":{"text":"I was excited to try this place. I had the Nancy, which was a good grilled meatball sandwi","useful":1,"cool":0},"z2ZE9jyxpp_Hh8V0uSbFFg":{"text":"Anyone complaining about it taking a long time for the food to arrive needs to limit their","useful":1,"cool":1},"kmA7ScC2nRnoff1OX33wWw":{"text":"This used to be one of my NOLA favorites UNTIL the other morning for breakfast. I have nev","useful":9,"cool":0},"OwmK9lYmNeUg9kqZyxr5YA":{"text":"My first breakfast in NOLA on my last adventure. The parking is a hassle, you go to a coun","useful":0,"cool":0},"XMnrlTLF5_-umx3e1gGFJA":{"text":"Fabulous food, atmosphere and service!\nTop appetizers included the meatball and mussels - ","useful":0,"cool":0},"NDIK7LLr6ywN2r0JY3-GKg":{"text":"Food was decent but not remarkable by a far sight. Our service was fantastic but the serve","useful":6,"cool":0},"w_0iF9QwTPSMM1ft5q64Aw":{"text":"I'm honestly surprised this place has anything under 3 stars. Great food, excellent and fr","useful":0,"cool":0},"d7CGJgbFuC0AAzNe2yGO9Q":{"text":"I had the Justin.  I will think about this sandwich for years.  So good!  Staff was super ","useful":0,"cool":0},"ib6mHsXWwH_qMLdfNsLszQ":{"text":"My fiancé and I went to breakfast here based on a few reviews we read on the Internet. Thi","useful":0,"cool":0},"NZ6ZCIZfx1BVKuivhdj-7A":{"text":"The food is OK, but very overpriced based on the food they serviced. The price for special","useful":7,"cool":0},"6O3arXXaAIHdeB5CrxEuaQ":{"text":"Simply stunning breakfast--among the very best I've had in New Orleans. Careful and imagin","useful":0,"cool":0},"2BFOHk_PAoYDuCiQGlG7pg":{"text":"Absolutely delightful.   Great service.    It is an intimate, warm environment with charm ","useful":0,"cool":0},"kVM9RRU6N6GaagbxuFXuYA":{"text":"This place was a little spendy. $15 for oatmeal is a bit extreme. But! The other breakfast","useful":0,"cool":0},"in6Jt9nCeD95D5lnXh-w8Q":{"text":"Two words: cannoli  pancakes.  Came here for brunch. We only waited five minutes for a tab","useful":0,"cool":0},"V3COxEh_HJCxUD40dUDiEQ":{"text":"Good concept for a restaurant. Italian style breakfasts. I had and omelet which had garlic","useful":1,"cool":0},"TyUbNgSdUKi0eiKNFmkrGg":{"text":"A phenomenal dining experience.  Brought here by good friends during Decadence and every m","useful":1,"cool":0},"1M4xA5vSDe8PLDSVF8m5EQ":{"text":"Oh yyyeeeaaaa!!! a place called Red Gravy?!!! I am so THERE!!!! growing up in a northern I","useful":1,"cool":1},"LGF2K0WvMPOKAAyOqo-RmQ":{"text":"Went there with companions while on vacation. The breakfast was so tasty that we went back","useful":1,"cool":0},"O3XRfO2GfeYqMJqsLEuu8g":{"text":"Shrimp and grits are the best I have had so far. Custom omelette I ordered for my toddler ","useful":0,"cool":0},"7o0x_cNwMMKsekOJlmZnug":{"text":"There was a recently vacated table, right by the door upon our arrival. The young blonde h","useful":1,"cool":1},"lVwAKoK94QmIfMEGvJ31pw":{"text":"When you get tired of beignets, give Red Gravy your business.  GREAT breakfast, and intere","useful":0,"cool":0},"Ha_L1iAQba4oU212cK2EFA":{"text":"Red Gravy was a great find. I love that the food is fresh and is all local ingredients. Ev","useful":2,"cool":1},"cQkZP4ZYm16Db476-7-o0Q":{"text":"This was the BEST pancakes I have ever had. Kate is an amazing waitress. She took such goo","useful":0,"cool":0},"VhwG8IMc3_-tDeai-MFJHw":{"text":"We tried this restaurant on a recommendation while attending a conference nearby and wish ","useful":0,"cool":0},"FsFBoy1zsHWogmqjyQQNAA":{"text":"My wife and I had brunch here on a trip to NOLA with our 12 year old daughter and her frie","useful":0,"cool":0},"KZ04CqjDyyd-7qQsLP-W2Q":{"text":"Quaint small restaurant with excellent \"red gravy\" (spaghetti sauce). The meatball appetiz","useful":0,"cool":0},"dWDOuCjB5uf-W7IEjQ3VPA":{"text":"Outstanding!!! Lou's breakfast of pancakes eggs and Italian sausage was amazing. Best saus","useful":0,"cool":0},"gQmbBXJccy2mzLSS-WW6Ig":{"text":"A few friends and I grabbed an early lunch/late breakfast here after the Running of the Bu","useful":2,"cool":1},"zIkFmIjEoSLYDRZbDV9v7w":{"text":"Good breakfast (advertises as a brunch). Had the Lou's breakfast and it was solid. Wife ha","useful":7,"cool":0},"Kc_4kQmhsCJ67rhqV41cig":{"text":"Went here for an early lunch.  I've never encountered a hostess/possible owner? who is lit","useful":2,"cool":0},"gjxjIWLBTuexQyje1i3D5A":{"text":"This place is amazing.  Its a small space that puts out big flavors!  Meatballs are grass ","useful":0,"cool":0},"reeDWCCjc1WwUn7S0x--jg":{"text":"I would give the food a B+ here.  The service is respectable and the atmosphere is cozy.  ","useful":11,"cool":0},"B1qq4eq4fI-6-FsKXXYNxg":{"text":"Challenging review because the food is great, our waiter, Michael was phenomenal, but the ","useful":13,"cool":0},"Fdf329EV_dKC_8FNcAudYg":{"text":"We saw two groups look at the menu and leave because it wasn't \"normal\" brunch fare. Huge ","useful":0,"cool":0},"sIg6chO6xglhtY528khUpw":{"text":"What an amazing gem of a restaurant. We loved the food, the music and the passion of the o","useful":0,"cool":0},"SjnEShHenEz2B9UAw40M4A":{"text":"Friday night we had four families with 8 adults and 10 children. The restaurant owner said","useful":11,"cool":0},"CrAF5ZfcK1xsZmO8CtCtKA":{"text":"Totally amazing spot for breakfast brunch or lunch. A bit off the beaten path and easy to ","useful":0,"cool":0},"9_byKP9JbY7jyzuUzzAr1A":{"text":"We got to NOLA early on a Saturday morning and needed some good breakfast. Jimmy J's and D","useful":1,"cool":0},"CLJzxrw8jRbS4Xkwh34HLg":{"text":"wait times are crazy..  waited more than an hour when we were told estimated 35 min.. gave","useful":2,"cool":0},"sCY4bTSv3My-WHw7Mcbv9A":{"text":"Very cute place. Very sweet people. The Godiva hot chocolate is to die for. Omg the Rue's ","useful":0,"cool":0},"FoLtQxQeCxSVPW6Bx3esvQ":{"text":"Awesome food!!  The biscuits were amazing and the red gravy was perfect with my egg dish!","useful":1,"cool":0},"sJxhU8IsOQqEhdMYDAKamQ":{"text":"Red Gravy gave us a fabulous breakfast with great service. Our waiter was funny and gave g","useful":3,"cool":0},"yMqS5BsNsivUCTxb_TJd7g":{"text":"This place is absolutely delicious ! My husband and I stopped in for Sunday breakfast and ","useful":0,"cool":0},"392FThdkxvAVmbPX4Vj4UA":{"text":"The food is so amazing!! But the Soup Nazi runs the place, no substitutions nothing on the","useful":3,"cool":0},"i6HZh8N9ll799WpzyiKWXw":{"text":"Arrive early.  Only open until 2pm.  Drinks are pricey.  Bad service and appeared to only ","useful":3,"cool":1},"B9vUhA3IWDfdkA1iUIcBdw":{"text":"I was in town for a conference and staying at the hotel just around the corner. My friend ","useful":2,"cool":1},"u_wpeTuZUQ3aT4M5-oLnCw":{"text":"Highly recommend trying this place! The wait goes quickly and it's worth your time! Chicke","useful":0,"cool":0},"AtUseHHj5UybweT2sMXsDA":{"text":"Enjoyed every bite!  Great pancakes and I really enjoyed the cat playing the guitar.  The ","useful":0,"cool":0},"magTMjkDy7IkY_XUP6t7oQ":{"text":"Oh my God! Ok so our first morning in NOLA looking for breakfast I Yelp this spot and we f","useful":1,"cool":1},"f_YLZHuFYm9hwlEEI87A8A":{"text":"Had breakfast and it was very good. Place filled up fast, I suggest making reservations. I","useful":0,"cool":0},"F8cLp1-Vd5w0GoGjKaT0pA":{"text":".Everyone in my party liked the food besides myself. So considering the odds I would say m","useful":9,"cool":0},"cEveJWHWPYtpDhEkdHTu6A":{"text":"It's true, the food does take a while to come out; but it's so darn delicious that I can't","useful":1,"cool":1},"BMu9lo28nhjZulaYzFWmCw":{"text":"I really was looking forward to dining here. WOW, I should have read on down through the r","useful":7,"cool":0},"dP-DvEmSNHV7rhfNnXky9Q":{"text":"Very rude hostess. Slow service. Weird smell. \nThey charge 20% tip. \nFood was very average","useful":8,"cool":1},"Y8M0m1Egl4CZ86R3Xwi1vA":{"text":"This is a nice little place tucked just away from the French Quarter and Burbon street.  T","useful":0,"cool":0},"194ircOkVw4lL127w0ddrA":{"text":"Great food, great atmosphere. Needs 6 stars. The signature red gravy adds a unique layer o","useful":0,"cool":0},"cel8mZDg2NZsMrCVkDI25Q":{"text":"Excellent florentine eggs with a side of grits. Grits a bit dull, but creamy. Excellent st","useful":1,"cool":1},"yJS5DroouIfevhsvnRXxcQ":{"text":"Jersey Roll was amazingly flavorful. Chicken and waffle were the hands down winner. Both w","useful":2,"cool":2},"J1cjS8s0Ub2kFbFtt34xSA":{"text":"Best gluten free pasta in New Orleans! Cozy Christmas evening and a belly full of goodness","useful":1,"cool":0},"cN4uFCMGJ_aOD7XyQMd99g":{"text":"Best meatballs I've had in my life! And for breakfast! The restaurant is cozy and filled w","useful":0,"cool":0},"LIXS7_UDIouiPpTJnQnuEg":{"text":"SO good. Leave enough time for each dish to be cooked to order. The shirred eggs Florentin","useful":1,"cool":1},"cLvkaBGGFFJgbXFxhcVJsA":{"text":"Great alternative to the very busy red slipper. It's a short walk and a nice find. The spe","useful":0,"cool":0},"Hi-9w9m2Mt4B8gFql5ip0g":{"text":"Patrick was our waiter and he is amazing. The drinks were great and the food was even bett","useful":0,"cool":1},"eg934f260DjqJoaJWG4rVQ":{"text":"Slow service. Ended up canceling my food. Everyone was apologetic but this place is just n","useful":5,"cool":0},"6DDzziRe4giOWl-_wu0Xbg":{"text":"I left this place mad. I didn't want to and I don't like leaving such a poor review becaus","useful":5,"cool":1},"WlhPOqniFYRWpPeEX0tR3w":{"text":"Great ambiance and service! Highly recommend for a brunch or lunch with a flare that is di","useful":0,"cool":0},"e7Da7u7QX2H9eGMt2xi8Dw":{"text":"So I've slacked on adding a review for some time. \n\nThis is by far one of my utmost favori","useful":0,"cool":0},"YSoOPwx87rWt8THyo7VdVg":{"text":"This place was our favorite breakfast spot while on vacation. Let's see... my boyfriend ha","useful":1,"cool":0},"Lk-bXUXX_aJrIlgkAGqpyw":{"text":"Trying to eat at this place caused too much stress - something we do not need and expect w","useful":5,"cool":1},"rNhAZ2WJutvTpuxm_oFRgQ":{"text":"One of the worst dining experiences I have had in New Orleans. The hostess was terrified t","useful":8,"cool":1},"0-8MFk6Ut9n7yl2MOUPhVw":{"text":"True to its name, the tomato sauce is the best I've had in New Orleans. Everything is flav","useful":2,"cool":2},"Lw5vN8rjk_IU67sZwJmsRA":{"text":"This was a cute, quiet find in downtown New Orleans. \nA little pricey for lunch, but we we","useful":0,"cool":0},"MxdCZW1ON65rDtwj6D6aVQ":{"text":"Just wanted breakfast. Was hoping to get chicken and waffles. Walked in at 920am. Very nic","useful":6,"cool":0},"QzZMLEiyVRGmmvrdonxAfQ":{"text":"How good does a restaurant have to be to get 5 stars? Good enough that we visited it twice","useful":0,"cool":0},"VESaKZIfcUgAIf4k6Zwfhw":{"text":"We had an early morning breakfast here, so no problem getting seated.  The waiter was frie","useful":0,"cool":0},"y4BO-NVfszHzb7w9fB_KcA":{"text":"The ruby slipper was full, so we decided to try this Italian brunch restaurant. I'm a freq","useful":2,"cool":0},"G5QfEUAuHn6TqzTTpEgvZg":{"text":"First visit here and pretty disappointed! Was looking forward to going after all the great","useful":6,"cool":0},"cnRLZRM-A4JvbiDM8hDI5g":{"text":"During a five day trip to New Orleans, we ate breakfast here twice. Wonderful atmosphere a","useful":1,"cool":0},"8aU6elIE00YJQ8wqCwWiqA":{"text":"We sought out Red Gravy based on the name and reviews.\nIt is a quaint little Italian place","useful":3,"cool":0},"E59MnMXBo369y5QcwLDw-w":{"text":"Good meal. Sort of odd, slightly edgy and impersonal service that you might have to expect","useful":5,"cool":1},"XylJwBOv1Uu8t3gf6pPdNA":{"text":"We stumbled upon this restaurant for Sunday brunch because we couldn't find the other rest","useful":14,"cool":0},"sGEAzK4JB-tNvtWCR7FVXg":{"text":"Great food and what  looks like good desserts but when I asked about where the fruit came ","useful":7,"cool":2},"4pz7mazCDgyR9-_-6kBPBw":{"text":"I wanted chicken and waffles for Sunday Brunch in the French Quarter, and this was the onl","useful":0,"cool":0},"gQRDKSusqkFeKphs2gkd0Q":{"text":"The dough was partially baked, the egg white was completely runny, I left half of it on my","useful":1,"cool":0},"nbbWKOCNnI0DgEYz-18M-A":{"text":"My friends and I were in town for a conference & stumbled on Red Gravy. New Orleans is ful","useful":0,"cool":0},"nYHj3SNMmI6cRrG3NgCa4A":{"text":"Great place! Stumbled upon it after there was an hour wait at another famous spot a block ","useful":2,"cool":1},"az9zOfvP29xc-Sl8WnGp6A":{"text":"Service was excellent, and the eggs I ordered (The Benedict) were the best I've ever had! ","useful":2,"cool":0},"t7JMMRfT3LYRjusii0Z19g":{"text":"Really good food but overpriced, $30 for breakfast for one with no alcohol. It's also odd ","useful":0,"cool":0},"BU1eVWGDxzXSD8RnYvjAHw":{"text":"Stumbled into this place when we stayed in a CBD hotel.  So glaf we found it... We had the","useful":1,"cool":1},"-P5ZQu8y5qPMpckJA-svjQ":{"text":"Great food and great service. The waitress was very accommodating of our requests. We did ","useful":0,"cool":0},"sevbF9twGW4xheu11GOlTg":{"text":"Welcoming wait staff, quiet, relaxing atmosphere, great wine. I had the eggplant to start.","useful":2,"cool":0},"oc8Ylw9hZvkEOmKeHVqm-A":{"text":"Heaven. Brunch was amazing.  My husband ordered the Sicilian Pie and I had the waffle with","useful":1,"cool":0},"xGrLE2SeouZz9qUWcOljtQ":{"text":"We visited New Orleans for the International Rotary Convention in May so this review is la","useful":1,"cool":1},"9w3U30meBO9ILNShgHO8TA":{"text":"It's hard to say if the wait for this place was as long as it was due to trying to have br","useful":0,"cool":0},"COrmPNt4xN54hmGGExTx7A":{"text":"i discovered this restaurant while I was wandering down Canal street one warm afternoon wh","useful":2,"cool":0},"rRXtFiKrTJJtEW45vkI57g":{"text":"I feel a bit mixed about this place.  They didn't have any gluten free or vegetarian optio","useful":7,"cool":0},"9ViD_OzmCOYnp5Ut9ZPsJg":{"text":"Tried the hidden gem for the first time - it is DELISH !!!!!! Can't wait to go back next S","useful":0,"cool":0},"VKQTBiF-9h5OMLsFFrWGwQ":{"text":"The food quality was great. I was disappointed when the waiter touched my meatball when re","useful":0,"cool":0},"R8YcMV_CqTYWf54zXC1dPg":{"text":"Very cute, cozy restaurant.  We went for brunch on a Saturday so you will probably have to","useful":1,"cool":1},"g93UqL_jQEqKDdtrcoLnBg":{"text":"Our favorite breakfast spot in NOLA. The meatballs and the seaside stack are to die for","useful":1,"cool":1},"o4V1LVwSHgW4lBrXstXQEw":{"text":"Came here to be honest because the red ruby slipper was packed and we really wanted breakf","useful":1,"cool":0},"MvJ3U8R7GnXyKkeo8w6KsA":{"text":"What a marvelous restaurant. The meatball appetizer was delish and the breaded chicken bre","useful":0,"cool":0},"juiy9e_vQRw_0tjLbcAr6A":{"text":"We chose to eat here because it was right by our hotel without reading any reviews. From t","useful":6,"cool":0},"9DDIsqI3b5U1qmLAZb7UeA":{"text":"Amazing!!!! We were trying to go the ruby slipper and the line was too long so we kept wal","useful":0,"cool":0},"hugdvDVaKk--4gIuQPjNPQ":{"text":"A cozy and warm place. Grits were amazing. Prosciutto with over easy eggs and ricotta made","useful":1,"cool":0},"k58v0qGR9cPgON9JfX46fQ":{"text":"We decided to eat here for breakfast and I am so glad that we did! It was AMAZING! I had t","useful":0,"cool":0},"UcocUruAciNhRmaaFQdf2A":{"text":"This place is small, but cozy. The server was friendly and made us feel at home. The food ","useful":0,"cool":0},"ngUGE_LaJMCbldzzL22SDA":{"text":"I'm just back from my second visit to Red Gravy. First time was back in March and I loved ","useful":1,"cool":1},"ihGurWNBHHBgNwdyiBBhWw":{"text":"I was hunting for a good brunch spot with no line. I caught this place early and I'm glad ","useful":0,"cool":0},"gL5Ta2ZU-8eT0sBM89i8ww":{"text":"Fantastic  breakfast !  I had the Polpetta it was so delicious . i will definitely go back","useful":0,"cool":0},"SK2CyqdnZ_5u7YJW_7F0nA":{"text":"Had brunch on Saturday morning and it was awesome! We had a table of 10, great service, gr","useful":0,"cool":0},"Xrg0fKpn_72zoX6hBiOyOg":{"text":"To the owner's comment: ????\n\nTo Jim G. (who is CLEARLY the owner in \"disguise\"): Try chec","useful":25,"cool":5},"MZx7ZVanIogWlyIl9GFy6g":{"text":"I was happy to find Red Gravy during my visit to New Orleans. While on the smaller side, t","useful":0,"cool":0},"7oqOGxSLZ9KDjAOQbgY9yA":{"text":"Several months ago I visited this place and had a pleasant experience during off hours. Th","useful":6,"cool":0},"RoszRQIPAs6igef5Nv7ANw":{"text":"Last week I returned to Red Gravy after not having been there since October 2013. My first","useful":12,"cool":1},"YkQ1GiosQGCoW4Apmny4gA":{"text":"Just delicious!  A shredded egg on top of s meatball and crostini with mozzarella and a li","useful":0,"cool":0},"0BuaMePQsZJIRAXEowcHVA":{"text":"Stopped in here for Sunday brunch after finding it on Yelp. The place was full so we sat a","useful":1,"cool":1},"UnB7O3ZlK-YPWWVxdmiabw":{"text":"Make a reservation.  We did not, but were supposedly given the very last table available t","useful":0,"cool":0},"QQ4LLLLKVjsassOx6i60mQ":{"text":"Love this place!  Food was fantastic! And the whole experience was great.  You should try ","useful":0,"cool":0},"_7kimZosbzY2OU5eNfJZBw":{"text":"We had a party of 4 and no reservation on a Saturday night at 6 ish. The food was fantasti","useful":0,"cool":0},"UCIIICb4zR3qRVP8rU6pkg":{"text":"Just had a breakfast sandwich (the \"Bruce\") at this new CBD cafe and LOVED IT.  I was appa","useful":7,"cool":3},"0RRK6_pp1HlLDmjQst8hXA":{"text":"We stopped in because the rain was dumping on us big time. Our experience started at the c","useful":0,"cool":0},"mU-15gbmxAIYb1y5q27AXA":{"text":"Very cute homelike little place -- especially the dim area with the couch.  Service is pro","useful":1,"cool":0},"qx5-R3A9k7vDEHxq1r8SXQ":{"text":"Great breakfast. Not super cheap but well worth it. Very friendly service.","useful":0,"cool":0},"X0qBWgWJuzMrczrZZp6-Dw":{"text":"After my last experience with Red Gravy, the owner got in touch with me right away to reso","useful":1,"cool":1},"wE_PmfPVBTcxD1XtPYHxGw":{"text":"Good food. Good staff. Menu contains a variety of goods, breakfast, pasta dishes, burgers.","useful":0,"cool":0},"Q5FvtkzOnrDFJGNHPVpakw":{"text":"Went to this place because it was really close to the JW Marriott we were staying at aroun","useful":0,"cool":0},"ZR2YlGPOegRLbM7ZzIZT6w":{"text":"Waited 45 minutes for a table at lunch on a Wednesday. I ordered the BBQ Shrimp Po'Boy, wh","useful":6,"cool":1},"JUNf866YWQqEBdqJm5rH0Q":{"text":"We chose this place for lunch because it has recently won several awards, but it was defin","useful":5,"cool":1},"39Xg-R-qhMRpMZ9z2ILhWQ":{"text":"Fantastic!  We are coming back here for the rest of the Week, too many great things to try","useful":0,"cool":0},"qaAcRfVUYYh20cb0eQVZhg":{"text":"The food was excellent! I had the shrimp and grits and my wife had the \"only on camp st\". ","useful":0,"cool":0},"1L-9_pfMvq_1YlmCq4TmaA":{"text":"You must eat here to enjoy the best meatball around!  They are made with love and care and","useful":3,"cool":2},"W16IDiKTtgd7S16GOIN5Nw":{"text":"Went for brunch. Pouring rain and miserable out, about 3 other groups waiting, put our nam","useful":5,"cool":0},"r6UFUQZ8UZd3PNSSN9OCVg":{"text":"walked into this restaurant around the corner from my office today, wondering why i'd neve","useful":12,"cool":6},"OSmLN8QjhHedxdIc4_8QwA":{"text":"I am a breakfast guy, so this place is heaven to me. \n\nI had the shrimp and grits which wa","useful":2,"cool":2},"zwT5CEyBp-Vb7XheMnb47A":{"text":"Wonderful food and really nice service! We were Surprised by the fact that a lot of the pl","useful":0,"cool":0},"Tn4Tx9M7ZA1Ugp0ZL3KJ5Q":{"text":"Go here for breakfast and enjoy their meatball omelette with red sauce.  Just do it.","useful":1,"cool":0},"099lpgjQvmusl3BqmxXNxg":{"text":"I am a local, and I CRAVE Red Gravy spaghetti. Definitely my favorite Italian spot in town","useful":0,"cool":0},"ORslsnCe632Zhg1wCWbK0g":{"text":"I am a sauceaholic.\n\nI've been looking for a good lasagna since Soup du Jour left Common S","useful":3,"cool":3},"k0QdKMYLu9vTv1T6-X2vZg":{"text":"Ordered the 2 meatball po'boy. It was soooo good and covered in red gravy and mozzarella. ","useful":0,"cool":0},"0r5I2MJ7-5t6Ad7PKVUjbg":{"text":"Food was sooo good! We went here 3 days in a row for breakfast! I got the omelet  with mea","useful":1,"cool":0},"MJVbOy4J8E_TlUcHnVeAHQ":{"text":"Loved this place! Best breakfast I've had in New Orleans. Great casual place located near ","useful":0,"cool":0},"AaadlEQRMLMXaW4boxgyNg":{"text":"Ugh. Went on a Monday and place was 60% full. Waited 45+ minutes for basic lunch. Waiter w","useful":5,"cool":0},"85kCMeoYgtcRy_e97pXncw":{"text":"I came by for breakfast and thought the service and food was quite excellent. The portion ","useful":0,"cool":0},"dy0_Xzq95UWDYuW7Exw8eg":{"text":"The service was almost as bad as the food. Do not waste any dollars or vacation time on th","useful":9,"cool":3},"WTaNF-YFXbCN4yWCb1N8Vg":{"text":"We had great breakfast here.   A great waiter, probably Michael.....The tables are set so ","useful":0,"cool":0},"aK12ZugBozvQukGdLrvrKQ":{"text":"Great shrimp and grits, delicious biscuits. Nice brunch cocktails, really good service. A ","useful":2,"cool":1},"2mkXG7WxWdEoiKoT9kklFA":{"text":"Red Gravy is right off Canal Street, so it made for the perfect place to start of Mardi Gr","useful":0,"cool":0},"q6JtLjW9FGpujSgenC2t4A":{"text":"15 minutes to get a take out meatball sandwich.  Very unorganized.  They had run out of ne","useful":8,"cool":0},"1p7ZBqfzVzBR_HJXCd0QiA":{"text":"Wow! What can I not say about this place! It's close to the French Quarter, it has GREAT C","useful":2,"cool":0},"BxltsAuxYjxf4Ifqg_0E_w":{"text":"I found Red Gravy totally randomly!  I was walking with a friend to the Commerce Restauran","useful":6,"cool":3},"OpZ50sJygVLf9zVN7jBuvQ":{"text":"This was the best brunch in New Orleans! Never had grits like this! And get the meatball o","useful":0,"cool":0},"ALMpQmZQt8_JZMNjGrfIcQ":{"text":"I finally made it to this little Gem, despite leaving around the corner, and they did not ","useful":0,"cool":0},"2qotZ-gP2MUjrUgD8Lq5cw":{"text":"Excellent place to visit for brunch.  The meatball omelet and Roe's breakfast were amazing","useful":0,"cool":0},"jD8YFY9RI5dWHA1O3V01og":{"text":"Roseanne, the owner, responded in the same condescending and unapologetic manner that she ","useful":8,"cool":0},"mWFtlJPXC4MTNGcySIoEOQ":{"text":"Great lunch spot in the CBD offering very good Italian food. I love all of the salads and ","useful":1,"cool":0},"KAx2GYiq_sDVD53uU8Wsfg":{"text":"This place is great! Clean, good food. Wait staff is super nice and the owner comes out to","useful":0,"cool":0},"ttYPF-XNi-uoxqdel9a-Lw":{"text":"I have never posted a review but I was very disturbed by my interaction today.  The hostes","useful":2,"cool":0},"WlQLFtQMelwrOZaIZdqAew":{"text":"Ok place. Way overpriced. Comes with the territory, but there are better values nearby.","useful":1,"cool":0},"hxaxoXFCYy46zUBIqoErKw":{"text":"Excellent food and service, plus the interior is warm and friendly.  Highly recommended, a","useful":1,"cool":1},"qkUPzBuKhPO_0NZTjG2svw":{"text":"Good food, nice people. It's super-convenient to the Sheraton on Canal, and the food is fr","useful":1,"cool":1},"2UZkeUUfpJQ5ya2rl816yg":{"text":"We were the only ones waiting for a seat and were asked to wait outside on an unseasonably","useful":13,"cool":1},"0Hq3gS4vIHelEs4zvEg0xw":{"text":"I was excited to try this place, since it was near where we were staying, and I love Itali","useful":1,"cool":0},"KQ4sRH9-CiqyfoWkX5y0ZA":{"text":"Would not let me in with coffee that I had just purchased.  The service was good.  Overpri","useful":2,"cool":1},"puR-oJNYWQ1KmOb7VMg6XQ":{"text":"Our waitress was inattentive and seemed like her mind was elsewhere. She brought everythin","useful":8,"cool":1},"YRm_ZCJs1Cev5UZyEceBrw":{"text":"The Eggs Benedict. All I have to say. Get here for brunch, wait in the line no matter how ","useful":1,"cool":1},"SVGsMUaUgBGwjKs9DXAi8w":{"text":"The Polpetta Omelet is to die for! The meatballs and ricotta with red gravy (New Orleans s","useful":1,"cool":0},"tho71QSvc4U59qbwaqw3sw":{"text":"Because I can't give it less than one star. Waited 45 min like we were told it would be th","useful":4,"cool":0},"CVCVVgoQIBTmGcDs_1VaXg":{"text":"Hands down one of the best Italian meals I've had in a long time. And I'm an Italian from ","useful":2,"cool":0},"cOcV_l1-Ld-dFKKZ-2BKIw":{"text":"The food was DELICIOUS and also the staff were very sweet, when I vision New Orleans again","useful":0,"cool":0},"3WXbyw38d6p0LgTPoZBTNg":{"text":"Wonderful food and really nice service! We were Surprised by the fact that a lot of the pl","useful":0,"cool":0},"RCQG-o5wC4buRpvKFA9YBA":{"text":"Had a party of 8..don't think they like big parties. We waited outside for a table but 2 o","useful":4,"cool":1},"Q85UuLJpXEwXBaCZ569hOg":{"text":"I can't believe it has taken me so long to review Red Gravy, since this is one of my favor","useful":2,"cool":3},"j8AQTSjKTzXihAISLaRuiw":{"text":"Didn't want breakfast to end!  If you're looking for something different this is the place","useful":0,"cool":0},"8GlO4tBxHWMvlWFQctWpkA":{"text":"Absolutely fantastic meal!  Friends of ours took us here for the first time over New Years","useful":1,"cool":1},"2wu9SLuNqf-tdvG3hxCB7w":{"text":"It was worth the wait. I have been walking but this place for a week and finally got a cha","useful":0,"cool":0},"fnJ2Nv21h-I88D3g1cRI4w":{"text":"I am not a very big fan of Italian food.  That said, this place turns my bias on its head.","useful":1,"cool":0},"p34G72Nc0WtaDt7cNLMbYg":{"text":"Roseanne whips up some of the yummiest dishes in NOLA. We've gone back twice and each time","useful":2,"cool":0},"9h6UivWlr2beIfgaX64XKA":{"text":"ABSOLUTELY TERRIBLE! I have honestly NEVER been treated so rudely by anyone, especially a ","useful":24,"cool":9},"rvHFV04zPJx8aX2CVZ8l6A":{"text":"After reading several reviews regarding the owner of this place, I have to add my experien","useful":4,"cool":0},"DVM5RS-PPdiDVPPbb8ofIw":{"text":"Loved the gnocchi and the 3 ring circus. Inventive menu! Trish was enthusiastic, provided ","useful":0,"cool":0},"Mz4ijq56SfpWWDikr011Qw":{"text":"I LOVED this place, and am really sad that I'll never get to eat here again! What an amazi","useful":1,"cool":1},"uSN6qvUfrGUY_vUzP0taBA":{"text":"Amazing! I eat here every time I'm in Nola. Great twist on southern Italian. Wish they had","useful":0,"cool":0},"aP83viH36FfgE0s_cUR2Sw":{"text":"Arrived for a late breakfast around 11am on a Friday and had no wait and almost the entire","useful":1,"cool":0},"9T9feuk5FyX4d8OKUtWMlg":{"text":"I should say I usually don't complain, but sometimes there's an end even to my easygoingne","useful":6,"cool":0},"_z-rbpnzj-SskAg0Dgytmg":{"text":"Got the bolognese pasta with the paleo noodles (made with almond and arrowroot flour). It ","useful":0,"cool":0},"Im5fiYMzHzc4sg4UEGl0ww":{"text":"This was an over-the-top breakfast place.  We went back twice.  Everything we had, from th","useful":2,"cool":1},"gPycA9fob7kOp6ovBzOsbA":{"text":"Gross, greasy eggplant pasta dish, odd flavor to the \"gravy.\"  Asked for grated cheese for","useful":9,"cool":1},"S6oGpkHltMUPuF1W2JjmUw":{"text":"On our last day in New Orleans, we planned on stopping in at one of the quaint breakfast p","useful":0,"cool":0},"U-6bmz48q9gW2WFtw6bZJg":{"text":"Lovely little spot if you're taking a longer lunch in the CBD.  The lasagna on the special","useful":0,"cool":0},"XTBUS9yEndSr7mNjGzeTgw":{"text":"I love this little place. Second time to visit from out of town and both times great break","useful":1,"cool":0},"V_BSNjZsgSRzbslLRKP8MQ":{"text":"We had breakfast here on a recent trip to NOLA.  Food was good, people were friendly and i","useful":1,"cool":1},"0bGIfAEUaJ288M226sIBEw":{"text":"We will be back! Wonderful Florentine Egg dish with three cheese and reccota. Mid morning ","useful":0,"cool":0},"uhGwhz--c4Rm8HDceIFXkg":{"text":"The food here was really tasty. The wait time and service not so much. We were seated betw","useful":2,"cool":1},"pftxATcHc0pTvhsqQr_9Vw":{"text":"Fresh and fabulous.  We came in around brunch time. One of our kids is gluten-free and the","useful":0,"cool":0},"VPSWl2khUhD6L2trdfUs3A":{"text":"We had a great lunch here! Quiet and intimate but not too silent so you can have good conv","useful":6,"cool":3},"o07jlwvrTO2SkknigrZqMg":{"text":"Average Food +  Rude Tactless Service = Skip this place!\n\nBottom line:\n---------------\nThe","useful":15,"cool":0},"BZPk8b4WEg_4J24DX_yDJA":{"text":"We went in for breakfast there where 8 in our party.  The hostess explained that they woul","useful":13,"cool":1},"r0pOuQcDM5YMINWTzuEl-A":{"text":"Went there for breakfast. Before I as even greeted they told me I had to throw away my cof","useful":0,"cool":0},"Omf4cwa_mBA04qLWyE6sAg":{"text":"Went here for dinner and not a fan at all. Our waitress was kind and polite. The amount of","useful":6,"cool":0},"Qzysxf36Yi_Oetqv6vNU8Q":{"text":"I ordered the red gravy and meatballs with garlic bread which was pretty good.  I also ask","useful":5,"cool":1},"yD3NVCrGlrXY11zbNCN-Ow":{"text":"The red gravy @ Red Gravy continues to be out of this world. The owner has a new sit down ","useful":0,"cool":0},"OitvUcJs9n7toju7Z7bi2w":{"text":"AVOID AT ALL COSTS. Our only bad experience from 10 days in New Orleans. Wow- what a disap","useful":1,"cool":0},"Dh8YvFx46bas_oYlF9uWQw":{"text":"This place is ADORABLE. It is owned by an Italian woman from New Jersey, and she is also t","useful":0,"cool":0},"GMfGHzGYb71lyi47jXhIJA":{"text":"We came for breakfast and wish we were in town longer to eat here again! I had the praline","useful":0,"cool":0},"ZMvWfYDtYl_u1F7Gp9y9rA":{"text":"This is one of the best Italian meals I have eaten.  The pasta is hand made,  the tomato s","useful":0,"cool":0},"ZZY0BUO-hTOTwMKMy2dErQ":{"text":"We hadn't made plans for dinner Friday night and called about 8pm.  They could seat us rig","useful":0,"cool":0},"9iW2nNDnziHg0E61tNFokw":{"text":"Great brunch spot.  The Bloody Mary's are thick and chunky just the way I like them.  I ha","useful":1,"cool":2},"jIoAMj7NT-ILDr2RQN4Qzg":{"text":"Had breakfast here.  Couldn't get coffee or tea because machine was broken.  It took a whi","useful":3,"cool":1},"XeQuJZKLAD4Ui9RX7tRTOw":{"text":"We were drawn here by the lack of a line (we'd gotten on the No Wait list at Ruby Slipper ","useful":1,"cool":1},"0yhViZvlbNP5hz3tVbE_6A":{"text":"Wow do these people think highly of themselves. I'll give anyone a second chance. This pla","useful":15,"cool":0},"sd-XESoJv1G8TtCe8m7x7g":{"text":"Great Jersey menu in NO!  Upbeat staff. Very accommodating.  Coffee drinks were amazing. K","useful":0,"cool":0},"JbuG8pCRrKErGFnhW-75ug":{"text":"We were stoked to try this place.  We immediately ordered coffees waters and mimosas.  20 ","useful":2,"cool":0},"hejmyVRbLkXkZXOntPtMTQ":{"text":"I live in New Orleans and I always send visiting friends, family and co-workers here becau","useful":0,"cool":0},"QlKjjak8O4T6tSnXj0ZmxQ":{"text":"I had a hard time deciding on how many stars to give Red Gravy... based on food taste and ","useful":3,"cool":0},"vQ-EpCs-lTJGyjPGhQSEfw":{"text":"Food was good. Not amazing, good. Coming from the northeast we have had better \"red gravy\"","useful":1,"cool":0},"SO8DfjWmxLx9OnyrfqRJ0w":{"text":"Pasta - it's for breakfast!!  Such a cute place with great music, and delicious food. We h","useful":1,"cool":0},"XU_jPtnn4qGvJYxVoABlqw":{"text":"Horrible experience.  Hostess said he would be 25 minutes. Decided my sister and I would d","useful":5,"cool":0},"9k32QKFzuaKkQZp0AhEL5Q":{"text":"They said we'd get the next table and had us wait outside in a winter wind blowing 20 mph.","useful":5,"cool":1},"p2WpJcU1pacSyDdY_3katA":{"text":"We had a horrible experience at this restaurant. The owner/hostess was rude and down right","useful":0,"cool":0},"zYtTx6DfcX09Bp1l9U56Mg":{"text":"In brief, Food = not good.  Service = left a lot to be desired.  Took a recent quick trip ","useful":8,"cool":1},"KGLQWzi3p-uYxrYFpb1jwA":{"text":"This place was amazing. So far the best I've had since visiting New Orleans. If you're loo","useful":1,"cool":0},"7zgq7vNump1WOgzNWv0prA":{"text":"We have lived in New Orleans and often come back and like to sample new restaurants.  This","useful":0,"cool":0},"VBJ7JupgJlAcyK5_vPQiKg":{"text":"Ate here for brunch with one of my coolest friends ever... I'm new to all of this down her","useful":1,"cool":1},"6Yfe48Rmd1B5fMh_oKMCwQ":{"text":"Visited Red Gravy on a recommendation from a very good friend and we loved it. I ordered o","useful":0,"cool":0},"MRa8ylXbDH_3-yU13sVt0g":{"text":"We love this place. The grits are amazing and the meatballs were  delicious. We also had g","useful":0,"cool":0},"uhKPSkmwShddTwpl2449Dw":{"text":"This is an awesome breakfast, brunch and lunch restaurant!  Amazing message of inclusivene","useful":0,"cool":0},"fU41U-KG1o72kJ330zd0Rw":{"text":"Our waiter,  Michael  set the tone right away! He was personable, pleasant and efficient. ","useful":0,"cool":0},"qGVQBAWnwAYzYxVUZReNYg":{"text":"Overall, delicious and would definitely return!\n\nThree of us dined here for breakfast on a","useful":0,"cool":0},"MJMkqYHdBagiaWmTcnab7Q":{"text":"I wish I could give this place negative stars. The food here is ok enough, but the service","useful":6,"cool":0},"JR7-j_mzXjAhSxfyFDbbrg":{"text":"Amazing meatballs. Handmade pasta. Very good bloody mary's. Small so miss the local rush. ","useful":0,"cool":0},"LIm_m6vOgtha61DLOZ-AVQ":{"text":"Another tragic NOLA disappointment. Completely mismanaged, if managed at all. \n\nWe walked ","useful":9,"cool":1},"A77HB2A-FIaidKTzome0Bw":{"text":"Stopped in to escape the heat and grab a drink for a few.  Excellent Italian soda, also tr","useful":0,"cool":0},"3Nx8xWh-azz8JdwoazmfzQ":{"text":"This place has a great atmosphere and friendly attentive servers. I stop in every time I g","useful":1,"cool":0},"xm_R7ZDpRlgatux9xOGwUA":{"text":"Read the reviews and it looked promising.\nAll in all very disappointed. Service was medioc","useful":3,"cool":0},"3KXBPhTWKwMj_styVfIkMg":{"text":"If you go during a busy time, expect to wait, but that's what you should expect that at an","useful":0,"cool":0},"Rjr3M1J1V4WO7Qp8my2TFA":{"text":"Sunday morning brunch -- cannoli pancakes, pecan waffles, bowls of fruit and some of the b","useful":1,"cool":0},"jBpCpZ-FHwrKSY_0GxNGFg":{"text":"Wonderful new discovery. Atmosphere, staff, food all fantastic! Had breakfast and want to ","useful":0,"cool":0},"4dtvJYmqzs5IuTLsH8-ibQ":{"text":"Terrible service, terrible hostess, mediocre food. My last time eating here today. Always ","useful":4,"cool":0},"eFKtXWAoDwzZBtveg8pVvw":{"text":"Excellent little find! Food is prepared to order so may take a little while. Very fresh in","useful":0,"cool":0},"ejXsuQf7MVUqugAhDLT44w":{"text":"Our hotel suggested this place and said it was one of the best restaurants in the area and","useful":0,"cool":0},"FftQtxe2Ha83MgJjLRiJ9g":{"text":"Cute indoor decor! I have to say I was disappointed though. The sangria was mediocre and m","useful":0,"cool":0},"Rc280KJ2wsZH34UWA4O3Sw":{"text":"My overall experience was ok. The food was good, but not great. It is very expensive for w","useful":6,"cool":1},"R4q1wt8NNp52uMKjh9nKBQ":{"text":"We were pushed for time on a Sunday brunch, trying to catch a flight. These folks were awe","useful":0,"cool":0},"AePxNbWtqUeSOCbDWxnJjQ":{"text":"What can I say? I loved this place.\n\nI went for brunch and had one of their specials- shri","useful":0,"cool":1},"Jey6Ns45ZSa5G7TaMhjnGw":{"text":"Eggs, meatballs, ricotta, topped with red sauce = delicious!  Best meatball and ricotta mi","useful":0,"cool":0},"m77Qd3ELYezpVil6NiZe-w":{"text":"Hidden lil gem here in New Orleans. Quiet and intimate. My husband ordered the red gravy (","useful":1,"cool":1},"b2GNqiR_OjpnPPXNNWOIcQ":{"text":"I love to take weekend trips into New Orleans!  We always have so much fun and so much goo","useful":0,"cool":0},"lRMlkmjea3BHdYhuL1cWrg":{"text":"Italian for breakfast was perfect. The baked eggs florentine was cheesy perfection. Defini","useful":0,"cool":0},"nhGeOlLECLZ4BL1b6KjY8g":{"text":"Placed our name on the wait list, made us wait outside in the freezing cold. Said it would","useful":1,"cool":0},"KwA6TW9pEDHKFoE6tRInWQ":{"text":"Long lines and the brunch is not worth it. Mandatory surcharge during peak season that the","useful":0,"cool":0},"s4uax0sNM8h6ORoGxU3Apg":{"text":"I came here some time ago in the Summer and had a bad experience. We were highly pressured","useful":9,"cool":2},"AFgfAU0Z_mrEknbcD32lcA":{"text":"This is an awesome quaint place.  The waitress was a gem and the food was amazing.  Had th","useful":0,"cool":0},"7Ts-vsFU6ZrZC0GZil_DwQ":{"text":"Food was yummy, service was excellent. I hope I have time to go back and eat some of the f","useful":1,"cool":0},"8pGBLZfLRR1WTxNAzkUE2w":{"text":"Do not go without making a reservation, asking questions about the menu, or expecting a qu","useful":3,"cool":0},"BhvV5Oh5hiWMTwnXgKcWNA":{"text":"The best meatballs that I have ever had!!!  I will definitely go again and try something d","useful":0,"cool":0},"le_JzwJVVPMYAjvMlrFfQw":{"text":"The service here gets worse and worse every year. My girlfriends went (against my suggesti","useful":8,"cool":1},"nUcp5bjlhljh_dWkgptQvQ":{"text":"What a cozy spot tucked away in Camp St! We called before we came to see if we could make ","useful":2,"cool":2},"02vnwkZLnpd2jw-IkiNWIw":{"text":"The breakfast was AMAZING!!!  The staff was very pleasant and courteous. The only issue wa","useful":0,"cool":0},"lI41nK15Rgi31Hh7tM8bvA":{"text":"Breakfast lovers, this is your spot. It's a smallish restaurant with a large menu. It was ","useful":1,"cool":1},"GFrDPYoTE8eWTY4u3t_awA":{"text":"Delicious! Try the uptown, their famous meatball + garlic bread + eggs and of course the \"","useful":2,"cool":0},"BsY-O1Ze_JsnosYmwJIygw":{"text":"I knew I had to eat here after looking over the menu.  I'm glad I did.  Red Gravy is small","useful":0,"cool":1},"uf-d4_MjB-OuSrIHc4U-BA":{"text":"We stumbled onto this restaurant as we were walking the city. We were all hungry and decid","useful":2,"cool":0},"VN5c7toqpBEjnWwduXdsww":{"text":"My friends and I LOVE this place!! The music is great (can't complain about the Cure EVER)","useful":0,"cool":0},"pKbnljZ3Rrzcrxr5ZQu8LQ":{"text":"Run.  Don't walk!  Order ANYTHING on the menu and you will be plenty happy and full!  This","useful":0,"cool":0},"R_NVLMne_gp0EZf-QTQbwg":{"text":"This was the worst experience I've ever had. I had a party of 5, only 2 of us were in the ","useful":0,"cool":0},"8LUxLpEHpYKqQH9aLKNG-A":{"text":"This place had excellent service and the most delicious brunch I've ever had. The drinks a","useful":1,"cool":0},"sXQhLmEeSI7HW-eFck6Gig":{"text":"We sampled 3 different dishes for brunch: pancake cannelloni, breakfast spaghetti with a m","useful":0,"cool":0},"icg0OdtRRN42k0uEGCwBkw":{"text":"Unique a must try with any New Orleans trip. There is no restaurant like this I assure you","useful":0,"cool":0},"33zyATFjal6Xaq_ozRSOZQ":{"text":"We stopped by here because it was located right down the street from our hotel. \n\nIt is a ","useful":0,"cool":0},"OyzU5tTrHcdfwoj0pLRwgA":{"text":"Excellent food. Small quaint place. Great for intimate setting. I love their red sauce and","useful":0,"cool":0},"CRZuC05M6K6buooH2gCFSQ":{"text":"We had our son research a restaurant for our first trip to New Orleans. This was a great p","useful":0,"cool":0},"DoUPSwGIo3MVLORYhclmcg":{"text":"This is our second time here. If you love Italian this is your place. The Bloody Marys and","useful":0,"cool":0},"fKpF-4nAe-bxBz1aJpPsqA":{"text":"Good location just outside of the French Quarter in the Warehouse/CBD district.\nI had the ","useful":1,"cool":0},"YAzJERpm6Lj5GL5VZB_UXg":{"text":"What a wonderful gem this place is. New Orleans is of course a fantastic city for food, bu","useful":0,"cool":0},"4F_mTqAU8YhZti1m9IpXtw":{"text":"Visiting New Orleans and a friend recommended this place. Looking at the menu for brunch, ","useful":0,"cool":0},"PllCHSaxLUDbUskGimpycQ":{"text":"Over priced...! Two biscuits for 8$ that's kind of ridiculous ‍. To be frank the biscuits ","useful":8,"cool":1},"TSjWTnxKuX1668zuoav1gA":{"text":"I ate here a few months ago just haven't got a chance to write a review. A lot of the stuf","useful":1,"cool":0},"zTc5gjEiRGInMttWjVBQlA":{"text":"We asked what the restaurant was known for, the very nice waiter said meatballs and mozzar","useful":0,"cool":0},"zr-21Y7q6WUKa0d4Mwmi8A":{"text":"Have you ever been served spaghetti for breakfast?  Well this is the place!  A beautiful l","useful":0,"cool":0},"0fGNXLjrR0GkuACNv7NCQw":{"text":"This place is definitely one of my go-to brunch spots! Get there early or make a reservati","useful":1,"cool":1},"qMdRKdwRnhuqRPvH8GN6bg":{"text":"Have to give this place a huge shout out. First things first, super cute place with charm ","useful":1,"cool":0},"PnkMLI3MzlDHJhIYQ_4TCw":{"text":"Absolutely wonderful from start to finish!  We had the Roe's breakfast and Lou's breakfast","useful":2,"cool":0},"YmNjwKPGCv-uFeRSqTQIDg":{"text":"As a F&B professional arriving for a scheduled interview I was dismayed to find a young he","useful":2,"cool":0},"LMPs11W2xvTgXoHxIJg3-A":{"text":"My husband and I love this place! We've been to NOLA the past 3 spring breaks and have mad","useful":0,"cool":0},"GA-LMSh25hl8jrubzhrxAw":{"text":"The place looked like a great place to eat, until we walked in a met the manager/owner. Sh","useful":4,"cool":0},"CFUFFtTW6fP1HKsbkgSB0A":{"text":"Was worth the wait. Had polpeta, a delightful packet of flavor! A freekin meatball omelett","useful":0,"cool":0},"VsYx5E-bllJkPOk1nf14nQ":{"text":"Based on a recommendation from a stranger we checked out this restaurant for brunch.  It d","useful":0,"cool":0},"iq3JWQSeReG_vMdNvbDjYg":{"text":"The food here was truly exceptional. A bizarre and delicious twist on breakfast, I thoroug","useful":0,"cool":1},"CvtyFmnf78udF3vrjW3pmg":{"text":"The food was great, but an arrogant atmosphere.  I asked to add pecans to my pancake and w","useful":2,"cool":0},"laTmSqLtCoQVwxbSX2QhlA":{"text":"Neat spot. I went there for breakfast with a small group of people. Variety of options and","useful":0,"cool":0},"TmjOlUjvt7C97EtZOlJu1g":{"text":"Good food. A bit annoyed about the policy of not being able to bring in your own coffee si","useful":1,"cool":0},"cb6XPpDKrgxC5FBDe2podw":{"text":"Had breakfast/brunch here twice during my short stay in NOLA. The first time because it wa","useful":2,"cool":0},"qFoCzb-qHAXg_Bx0DF5L0g":{"text":"May be the worst meal I've ever had in a New Orleans restaurant.  And I've lived here for ","useful":3,"cool":0},"5hMyeCKItdqAvkTxoqldJw":{"text":"Mardi Gras day, 2013.  My husband and I got up early to have breakfast here before the par","useful":3,"cool":0},"X8o-e-imb092NCLaNe2noA":{"text":"The cannoli pancakes and grits were the best I ever had. Great food. Great atmosphere. Def","useful":0,"cool":0},"BcLd-ZyAQVzttOmayFRP0g":{"text":"Great local spot for flavorful & inventive menu with warm, attentive service. Don't moss t","useful":0,"cool":0},"Bx_zURj3CaWl4Xl9EAt14A":{"text":"As a F&B professional arriving for a scheduled interview I was dismayed to find a young he","useful":3,"cool":1},"6awJFOjdIIODFeriR8i9sQ":{"text":"BEST MEATBALLS OF MY LIFE! Seriously, if you think it's weird to order a meatball for brun","useful":0,"cool":0},"Ul8InCewTChbAKgzbMIloA":{"text":"Lived up to all of my expectations! i am born and raised in new Orleans, grew up in the re","useful":0,"cool":0},"9-LILXLCf_csbAxvsG1-FA":{"text":"Worst red sauce I've had in a long time. Their name is literally Red Gravy and it was terr","useful":17,"cool":3},"VgYMK4TNyzGVXQNepvliGA":{"text":"The brunch here is off the charts good! It is our go to spot the Saturday of Mardi Gras we","useful":0,"cool":0},"k8VqhK4JXus4aS-ZdDbGzg":{"text":"So. Unexpected. \nI was expecting this to be just some French Quarter tourist trap, and hon","useful":4,"cool":1},"3FEwRmc39_dLIrUcQpmH2w":{"text":"I happened to be in the CBD one morning so I stopped here for breakfast with a friend. She","useful":3,"cool":1},"e8wpqeORCi1F3o6s7pgNVQ":{"text":"Really!  I have to give this one star??  Absolutely horrible in both service and customer ","useful":2,"cool":0},"S1xRf2rudoZE8n_xM2W3Mw":{"text":"The best ever !! Everything so good.  Best meatballs ever !!  They're huge bit so deliciou","useful":0,"cool":0},"_rD3OB19q4cArSIBnO7zvQ":{"text":"Do not go here - the restaurant was extremely dirty and there were fruit flies hovering ar","useful":10,"cool":0},"EXvQkCMJJbM5S2NXkpKEeg":{"text":"This place is amazing! My wife and I are on our first vacation in 10 years and found this ","useful":0,"cool":0},"7Aoet1az4jdAC1Fom5WuHg":{"text":"This place is aaaamaaazing!!! \n\nAmbiance: super cute cozy feel. And live music which is al","useful":2,"cool":0},"jTSNvtrxxTgCWQ0GlM_4rw":{"text":"3.5 stars is too low for this place. In an desert of overpriced hotel restaurants, this wa","useful":0,"cool":0},"5ITHWzM2BbMyTZsfnxlomQ":{"text":"Unique brunch spot just outside the Quarter. Maybe a little on the pricier side but the qu","useful":0,"cool":0},"fz_ZddTinIYbVho4tuJBPw":{"text":"We found ourselves on the wrong side of the lunch hour during a freak power outage in the ","useful":7,"cool":1},"YF0EPUA9uTXy3keQQX0kMw":{"text":"One of the best breakfasts (meals) I've ever had!!   Don't wait for the Ruby Slipper!  Mak","useful":3,"cool":1},"Q74ffY1_wTq9MEcBuJJAlw":{"text":"As a F&B professional arriving for a scheduled interview I was dismayed to find a young he","useful":4,"cool":0},"-p5bh1Rji36A_nIh5JZ1Vg":{"text":"Just based on the name I wanted to come in here and eat. Saw the stars and thought eh I'm ","useful":0,"cool":0},"GQYVkEoreuC4xHB1SJ2qTA":{"text":"Absolutely the most arrogant bastards in New Orleans.  Screw them they can keep their frig","useful":5,"cool":0},"w23GaeEi3MQwUKu_3961lg":{"text":"This is a must for a wonderful start to your morning. Friendly staff. Great service.  Why ","useful":0,"cool":0},"TH7z9eBectHFGVZ6Dd8Aiw":{"text":"I can't comment on food because I didn't stay. I researched this place and was excited to ","useful":13,"cool":1},"4lX0JK7snpEqCPbQKWYfAw":{"text":"I am a visitor from out of town and we are visiting the city for a friends birthday celebr","useful":0,"cool":0},"2NcuhVRCH-tV7ifPF_gKEw":{"text":"So many stupid rules. Our waitress had two tables and she acted like she was in the weeds,","useful":7,"cool":1},"TDfK5saQx_xdv7DDdJ6_Ug":{"text":"My husband and I were craving pasta for brunch and were excited to find Red Gravy so close","useful":1,"cool":0},"093-6b0Cnm1QlJJ9-aEBoA":{"text":"What a joke I walk in at 10:40 on Jan 9th clearly before the end of their breakfast hours ","useful":20,"cool":2},"A-9HpI5OnWkT2q858DqF5g":{"text":"This is one of those forgettable places you regret wasting a NOLA meal at. ...Well, it wou","useful":8,"cool":2},"SOPaKLN2Btoi7_WgJo_PXw":{"text":"Very good food , good bloody Mary's with cherry pepper! A little pricey but well worth the","useful":1,"cool":0},"dwONq6MBy-hqVD2kxy7qhQ":{"text":"This place is not worth the visit... The food was gross and bland.. The service was subpar","useful":4,"cool":0},"VQFVbKcTzaR0sA5tixT1rg":{"text":"I've wanted to stop into Red Gravy for years - I love the name and red gravy is basically ","useful":2,"cool":2},"GJH7OwIc2PTMZftud2g42w":{"text":"Stumbled upon Red Gravy when we got frustrated with Mapquest directions to somewhere else.","useful":0,"cool":0},"kEJNkrh-P8sjMMha5YKCXQ":{"text":"What an experience! Red Gravy is easily one of the most memorable parts of my family's tri","useful":0,"cool":0},"0V1gA5UaFSs42bYm-Uq0yg":{"text":"Not a great experience.  I asked if the granola and fruit could come on the side in my Oat","useful":8,"cool":0},"M0WP9kFDvedjMQhgCQeaRg":{"text":"The Red Gravy in New Orleans is absolutely incredible. Everyone in the restaurant knows al","useful":2,"cool":0},"jCEEw7sPUrhdnfGJ_gA_iw":{"text":"I am shocked that they have a quote on their menu: \"Nice people make the best Nazis. My mo","useful":3,"cool":2},"a9fGsyfuGtZxrjKpvQS4uA":{"text":"This place was by far the Worst service experience we have ever had! To sum it up, first o","useful":13,"cool":2},"rNJftLZN-LiK7Rxak530jg":{"text":"We walked in at 1:40 and the hostess told us that they were closing soon. We asked if that","useful":8,"cool":0},"NRXzHaZEYVxdHrXt7jgnFw":{"text":"If you are Italian you must try this place for breakfast. I had the eggs and meatball....p","useful":0,"cool":0},"844x-pBx7DxbZ0kq20aAww":{"text":"We returned the next day for lunch.  Once again, it's sooooo gooood.  I had the Lou.  I wi","useful":1,"cool":0},"f5b4KdsmB5eaAL99SM0xbw":{"text":"I have always eaten at the Ruby Slipper but my wife and I had heard about this restaurant ","useful":0,"cool":0},"p023pcfgaQjlYdW-OmRZHg":{"text":"We were warmly greeted when we entered and seated immediately by the host. Brunch menu had","useful":0,"cool":0},"i6KD1yGEU1iqntVN6qmS-w":{"text":"23.5% PRICE INCREASE IN TWO YEARS!\nMy $17 shirred egg and meatball platter in 2014 now tot","useful":20,"cool":6},"f3fe9hKVWk9hR2OHSI2oLQ":{"text":"I came for lunch a few weeks ago craving a meatball sub, and was unimpressed. The bartende","useful":1,"cool":0},"BaTTH4vT6Ig0w_GrqhlNRA":{"text":"This place is okay for breakfast. Granted, we slid in before a large number of groups with","useful":0,"cool":0},"s6BexNMd9SORatSuoqGo3A":{"text":"Red Gravy - French Quarter\nWhat can I say? It was one of the best meals and experiences wh","useful":2,"cool":1},"CVA1Xqpe4fDSsyf9fMLvlA":{"text":"Not exactly what I was expecting but very good. We got a late start on a saturday and all ","useful":1,"cool":0},"5Tbb3BLXqHiEDEo2Bz-0fg":{"text":"A really cute place (small inside) with great food and service.  Interesting menu with lot","useful":0,"cool":0},"jsmPx6Wj6IjEmXPXzOCPVQ":{"text":"Great place for brunch on Sunday!! Patrick's Bloody Marys are amazing. Don't miss the brow","useful":0,"cool":0},"r0uzycXt8I_3Nz50i71uTg":{"text":"We came back! Red gravy is by far the best brunch place that my husband and I have tried! ","useful":1,"cool":0},"kPsVMWzd_0UBQ9BvMbY4Sw":{"text":"This was the most embarrassing dining experience  of  my life. My husband ordered the bris","useful":14,"cool":1},"eflmfo1l24Y9a1830U0jJg":{"text":"I wish there was a review lower than one star. This restaurants staff was the worst I've e","useful":1,"cool":0},"W5PeWSNAdN-cMczDGcyxKg":{"text":"My boyfriend picked this placed since it was away from Bourbon Street and we wanted to try","useful":0,"cool":0},"s6ZQRDn-MUhJsXTGvYGZ5w":{"text":"Small little spot but wow!!! Heard it was a great spot from locals and knew I needed to ge","useful":0,"cool":0},"nhjVe-cKVAidqe0pYYmBcQ":{"text":"Very good food , good bloody Mary's with cherry pepper! A little pricey but well worth th ","useful":0,"cool":0},"ch_2Y_u9X-g3g0V_bfOIQg":{"text":"Ate here yesterday and had the worst customer service experience with the chef/owner. We o","useful":9,"cool":0},"rWcAuQKcoT2BMTnmeUD_QQ":{"text":"The food is great, no questions asked.  However, unless you are independently wealthy and ","useful":10,"cool":0},"IaKh9nKOBfbEBUSoSPwb8w":{"text":"Very Inflexible Menu\n\nI am a vegetarian and was excited to order the Sicilian Egg Pie with","useful":0,"cool":1},"1piXkbXNvV2SarwCWFWaKg":{"text":"ILL-SUITED TO ITS TOURISTY LOCATION: Red Gravy is an excellent concept derived from its ow","useful":13,"cool":4},"Qkf1CUMYmTZWp58MeFTRBA":{"text":"Excellent food! We stayed at the nearby JW Marriott and walked to the Red Gravy for breakf","useful":1,"cool":0},"ar2dD6c2W45gBLvWj1yYwg":{"text":"I wish we never ate here, what was supposed to be a fun day in New Orleans turned into the","useful":13,"cool":2},"i_-zYLnVHEDcYIx2kGrAtQ":{"text":"Nice location with a good ambiance.  The food is good, though I was told I couldn't substi","useful":2,"cool":0},"EQSs323y6rekl8ad18ETgA":{"text":"If you like overpriced, pretentious food with a side of rude customer service then this pl","useful":1,"cool":0},"B3BKGjG_HTdQvP90DBH7oQ":{"text":"Had breakfast here this morning and are glad we did.  Portions are large--my friend's brea","useful":6,"cool":2},"KIfoAVZfbdWqV50fB-HQvA":{"text":"I had been wanting to try this place for awhile but the hours have always been inconvenien","useful":10,"cool":6},"_Y23oEow1dB_Jp5rSEfqHg":{"text":"Red Gravy is one of my faves! The omelette with the meatball and ricotta cheese is to die ","useful":2,"cool":1},"V2yRLQv3VeGUstl6W3771Q":{"text":"Yesterday was my first visit and the restaurant was quite close to the Hilton Garden Inn -","useful":0,"cool":0},"c9M3yVw02wCv2BtAP5tp7w":{"text":"Great food. The meatball omelette was fantastic. But as you would expect, this close to th","useful":0,"cool":0},"DOmwhYNH9Ju5NGpCqzNp5A":{"text":"This place SUCKS . Service is HORRENDOUS AWFUL. We went here right before we had to catch ","useful":5,"cool":1},"nOQvpHpCxP27n95LT48fhw":{"text":"I found this place a few months ago on a work trip. I must say awesome! One of the best br","useful":1,"cool":0},"xjpO_nGq0cEuuir2ICLNaA":{"text":"We came for brunch on Sunday and were very pleased with our meal. Especially when we drove","useful":1,"cool":0},"81nH5Lta-4cK9rOmbW00bQ":{"text":"The owner came out and loudly yelled at us because we asked if our brisket could be replac","useful":12,"cool":0},"6zYWSNl9XfozqAS31n5edw":{"text":"Had the Roe's breakfast.  The meatball was melt in your mouth.  The red sauce is like no o","useful":2,"cool":0},"vzHfx5cVq1omUx_x8Cv1bw":{"text":"The only thing that disappoints me is that I simply do not have the time to come here for ","useful":2,"cool":0},"oakT3eA2sSAgiX8eAzFTwg":{"text":"We enjoyed a lot of restaurants in New Orleans, this had to be the my least favourite one.","useful":8,"cool":0},"DMfz9AvRij7_9p5Cx5QbgA":{"text":"This is my first review of any kind for a food service establishment, much less here on ye","useful":0,"cool":0},"XNfaYMn6vVsOTOPXYA5SWQ":{"text":"Wait was crazy on a Sunday morning BUT we stuck it out to get our high calorie breakfast o","useful":1,"cool":0},"3OYt-BCZr8MMfWS4mlnXBQ":{"text":"Nice, cozy little Italian place right down the street from our hotel.  The special board o","useful":2,"cool":0},"giZRtrXQLgpCNv0nyOgiuQ":{"text":"We had great breakfast here.   A great waiter, probably Michael.....The tables are set so ","useful":3,"cool":0},"fs2jCfK5EvQpCdDdlU0MHw":{"text":"We just went to the Red Gravy Restaurant and dispite their signage and them claiming they ","useful":7,"cool":0},"IkTwUa0bsehYKg2DQCXTdg":{"text":"Pros: OK food, our water always stayed refilled, cute decor. \n\nCons: I asked what the side","useful":8,"cool":0},"_op98UMP0WSCW0EKF3FGvw":{"text":"How to square Red Gravy's presence on several \"Best Of\" lists with aggressively bad servic","useful":56,"cool":25},"IayhUWj4EHXzK_NvTFsLDQ":{"text":"The waiter (Gregory) was great, the food was okay. However the management/ cook was horrib","useful":4,"cool":0},"WrxSFZSJ7iPdJ28jMM61Rg":{"text":"If I could give this 0 stars I would. \n\nMy girlfriend and I flew to New Orleans and starte","useful":8,"cool":0},"kuZ0viin3hwH66MGAFuuww":{"text":"We come here at least twice a year after seeing our wonderful Saints play. I had the field","useful":2,"cool":0},"ES8IL7K4wQAuEVERHum8Ug":{"text":"I'm a born and raised New Orleanian, and if there's one thing I've learned in my life it's","useful":9,"cool":1},"zztcy3kk3Hw5w9WK5-3-ug":{"text":"Before even looking at the menu upon sitting a patron is handed rules of the restaurant. O","useful":3,"cool":0},"Bt3FuEzFsNGBoB7NG-lgzA":{"text":"Do yourself a favor. Get yourself a friend and share the pasta with clam sauce & the brusc","useful":0,"cool":0},"v6_akzPNpDUs1pjX6Qx_NQ":{"text":"Fantastic breakfast place in the CBD. There's usually a wait but it's completely worth it,","useful":1,"cool":0},"XV7AgUPVQKGZdkV7pcxI8w":{"text":"This place is pretty expensive for what it is.\n\nI was in town with some friends for a week","useful":10,"cool":1},"KhcNuSPsOM3jES7AMMBi7w":{"text":"FYI - Red Gravy hasn't closed. It moved to Magazine Street.","useful":0,"cool":0},"enzJxzhnOVuhYlpMQJKxZQ":{"text":"Red Gravy was on the list of places to eat when my friend and I visited NOLA in February. ","useful":3,"cool":1},"ZoysAyMEKbarMpFUkZvt6w":{"text":"Awesome food ! Awesome drinks!  the wait staff is prompt and courteous... love the quiet a","useful":3,"cool":2},"IqkzJ406IclUGXO66VIJBw":{"text":"This place was below AVERAGE. \n\nI think that the reason it's gotten so many stars is that ","useful":17,"cool":0},"SAHSxpXV8jwdz8DEmb-YAw":{"text":"Before Covid I stopped by here for a panini which I've done once before. Nothing remarkabl","useful":3,"cool":0},"XyhKm-PnJoXmIRr4dKLe7Q":{"text":"Was suprized no itallian seafood dishes in the morning...was weird choices of meatballs wi","useful":4,"cool":1},"nL54qBPJbHyF2ry2cKwN5A":{"text":"Avoid This Place!\n\nWe were on our last day of our Mardi Gras Trip and had to return our bi","useful":24,"cool":1},"x81VGRJcGpZmI6J4sLkemQ":{"text":"Arrived in rain, host was extremely unwelcoming on \"How long?\" and simple logistics (us w/","useful":8,"cool":0},"HGFySThhTaLKLfjfySy8sQ":{"text":"Today I went out to lunch by myself.\n\nI got up from the table to use the bathroom, and whe","useful":21,"cool":1},"xnVvBIK5hbWU_axVL1v42Q":{"text":"My omelet was appetizing and everyone's chicken and waffles look even better* \n\nGrits were","useful":2,"cool":1},"jtM_bLHjoiN96-Yr50ANUg":{"text":"When I visited NOLA last year during Mardi Gras season, I discovered this place. Both me a","useful":2,"cool":2},"AjomP1uHSPryEN7L07GRNw":{"text":"Breakfast was fabulous! Quaint little place for amazing food. I wish we were staying longe","useful":1,"cool":0},"4u9FYEv6XTEltJp-t7fPIg":{"text":"We are locals and we love Mardi Gras!  We have always found the New Orleans service indust","useful":2,"cool":0},"AV5ORMsXxSIICYKd8CjjYg":{"text":"The best word to describe breakfast/brunch at Red Gravy is \"weird\".  The concoctions they ","useful":5,"cool":0},"xxmyRRgXbt1OGzauyy4jXA":{"text":"I will say I was surprised.  Walking in was not what I was expecting and the prices were a","useful":1,"cool":1},"WuXoqYvmhyAmQQcYpZB06Q":{"text":"If you're in the area looking for a good meatball by all means waltz your way over to this","useful":4,"cool":0},"eYkNBPaJYgz0lU91ZcYh_Q":{"text":"Food good. Service is awful!!! The owner is rude. Disrespectful to customers and doesn't h","useful":4,"cool":1},"yun9AlEug7cWUxH-x08Ryg":{"text":"Highly over rated. We may have been swayed by the extreme good vs extreme bad reviews. Mak","useful":3,"cool":0},"sUREHZ9wqlFax1r8cd1ruA":{"text":"We were visiting New Orleans with six other friends and we had an Uber driver recommend th","useful":1,"cool":0},"7pBC1l2VFQs5Ln1rQvszIg":{"text":"I've always been curious about Red Gravy. On my quest to find the perfect meatball I poppe","useful":0,"cool":0},"2HoA4aCVVNBTyocFHtUAHw":{"text":"Just based on the name I wanted to come in here and eat. Saw the stars and thought eh I'm ","useful":0,"cool":0}}