{"VS2cMTMPT3yeGaZKVPKHRg":{"text":"I love tacos. That simple. Juan's offered me variety while still catering to my simplistic","useful":1,"cool":0},"JFI86VacdipiBh9MIOGFAQ":{"text":"Jauns is a great NOLA staple, I lived around  the corner from them and am a frequent visto","useful":1,"cool":1},"ZhfPhPNyGWnXZDf8CE3wbg":{"text":"Service here is pretty awful 75% of the time...Cool place and good food. Even had a server","useful":0,"cool":0},"lHVNShdbJCku0Tf8uaqOAQ":{"text":"Funky tex-mex place filled with tattoo covered waitresses. The food was very good, fresh i","useful":0,"cool":0},"9Q3rqoOpLNJAIlRrpUboHg":{"text":"Awesome place, generous amounts for a reasonable price. We went to the one on Magazine and","useful":1,"cool":0},"_FwpPMtWu2Ne6uBZ71yb0g":{"text":"I don't know how I've never reviewed this place!\n\nOne of my favorite places in the city, i","useful":3,"cool":1},"yWuemk3c_j4_p6W__xvH9w":{"text":"OMG freaking delicious!!! This place bills itself as a \"creole taqueria,\" and it delivers ","useful":0,"cool":0},"R6e_cZxdiPyED1jvmcAhaQ":{"text":"Love this place, but just wish I was a little more \"hipster\" to fit in with the crowd (not","useful":0,"cool":0},"9FDr6wEQHRS9gblntgjtyA":{"text":"Amazing food. I got the flying enchiladas and they were some of the best ones I've had! Cr","useful":0,"cool":0},"4ib3JOi-xJuJiJLzJiP27Q":{"text":"Absolutely amazing. They are a casual gutter punk themed Tex Mex restaurant. The food is s","useful":2,"cool":2},"qrUXBtJ-V3IAmX3-Fihx2w":{"text":"Pork tacos. Chips & green salsa. Draft beer. \nNeed I say more?  Also a big fan of the Juan","useful":0,"cool":0},"JL6IDtVKheobUeUv3IE4Ag":{"text":"Delicious and HUGE burrito. Very authentic compared to the \"mexican\" we get in Boston (whe","useful":0,"cool":0},"IF2bO6xLgDUbegeUTOHXQg":{"text":"Cool place.  Service was good/fun and friendly.  The customers all having a good time too.","useful":0,"cool":0},"mLxUESDgXZJ_3ZcY4yd12A":{"text":"After a less than stellar experience at the Mid City Juan's location, I still wanted to ea","useful":0,"cool":0},"wwkVeVS71rb0mLgFSAQMBA":{"text":"I love Juan's when I need some good, tasty food.  My favorite is a mango mojito (frozen of","useful":0,"cool":0},"c2gHJPsr567KOLQjnsNJZA":{"text":"Juan's is great. I recently moved to New Orleans and was craving some queso dip. I got a r","useful":0,"cool":0},"EzAjZxyXIaey4I5N_AUFkg":{"text":"Hawaii 504 nachos were awesome! Inexpensive margaritas. Definitely recommend","useful":0,"cool":0},"ZuDZtZMo60V7EfSfGsbVZg":{"text":"Omg I live this place the super green is AMAZING!! I was on heaven as I chowed down for 10","useful":0,"cool":0},"uSnY4L6PdpT1khxwUx_xoQ":{"text":"\"It's not like what we're used to, just a matter of being in New Orleans, but it does the ","useful":7,"cool":5},"shUq_O_L2MONBLPNTDFw_w":{"text":"It's always busy, but what's not to like?  Pretty good \"Tex Mex\" style food with reasonabl","useful":1,"cool":0},"A-3SsYR0M8FX9PBFAyhRZQ":{"text":"Cheap and great food! I've pretty much tried everything and everything is great. My favori","useful":0,"cool":0},"MSESXSiTy6QnAThaOHlM3g":{"text":"Fun, funky place in the Garden District.  The food is really fresh and good.  We went back","useful":0,"cool":0},"_-GdM5Bwr9rJdop2SeL-OQ":{"text":"The pork and slaw tacos were very good. They hit the spot! 4 stars bc I did take out and t","useful":0,"cool":0},"t5YcA-phs5B2IgQbF1HlyQ":{"text":"Not too bad, we had guac and chips + 2 entree (flying enchiladas and flying burrito). Quit","useful":0,"cool":0},"_j1AbvEpoSiQhxJq6EK4VQ":{"text":"Jerk chicken nachos, queso, chicken quesadilla--couldn't be any better! Amazing guac as we","useful":0,"cool":0},"5FCQlsuTCXoOMfGOcfORYQ":{"text":"Great food, shit music (heavy metal!?), and shitty of shittest service. Bar tender is awes","useful":0,"cool":0},"wf7iwdVfWd-VhS3rSQCn7g":{"text":"Good old trusty Juan's.  I've lived in the neighborhood for 8 years and cannot count how m","useful":2,"cool":1},"YM4eomfEbWZSh5-YI_i4zA":{"text":"I have to start this review by saying that we had just eaten at Commander's Palace the nig","useful":0,"cool":0},"vhDpJTC95X5pm-YOSyugBA":{"text":"Always nice! Really good food and the budget is \"easy!\" Bar/Waitress are good servers and ","useful":0,"cool":0},"pica5YIWhNQb6lNebt46Ww":{"text":"I love Juan's! One of my favorite Mexican spots in New Orleans. The one on Magazine has a ","useful":0,"cool":0},"gITz3mnjp5VD48P8VqAZQw":{"text":"Okay, so i've been here more than five times in the past month and a half so I feel like i","useful":0,"cool":0},"3IiRo_fuT0Qwdz_qanJUSA":{"text":"Wasn't too sure how much I'd like the place with a name like \"flying burrito\", but I reall","useful":1,"cool":0},"MS__YVK8CKZt52E-a1vGFg":{"text":"Every time I end up in NOLA, I hit up Juan's Flying Burrito. I'm from Los Angeles and Mexi","useful":0,"cool":0},"zLyIsjm-XM8iWZy1Jzva5w":{"text":"The food is decent, though by no means the greatest or most original burritos that I've se","useful":1,"cool":0},"R-V3GPUfWyDjMbJ-fT26cg":{"text":"Great food in a fun neighborhood. I may be giving this place a higher rating due to nostal","useful":0,"cool":0},"NXanrHOepsYDUlh-l5AiLg":{"text":"I love Juan's.  It may not be authentico, but it's fresh and the drinks are good.  The ser","useful":0,"cool":0},"BJfRaTDnQCwK2SawbWBcLg":{"text":"Growing up in Texas made me love Mexican food.  I've been to some good Mexican restaurants","useful":0,"cool":0},"WaXpAz49GnfgtLiumzBa6Q":{"text":"Love juans! Great food! Great drinks! Great atmosphere! Definitely will be a regular.","useful":2,"cool":1},"uCoiXsIOMGXyhMEjYv4jpQ":{"text":"Those of you seeking authentic, south-of-the-border Mexican may want to look elsewhere bec","useful":2,"cool":2},"NQAKg0CP17bOzUqeqogCKw":{"text":"Juan's is a staple here in Nola and after one visit you will see why. Everything on the me","useful":0,"cool":0},"akRwA_TYruKlnKLHlf8nfg":{"text":"Happy hour specials, including $1 PBRs if you wanna keep it cheap. Staff is very friendly ","useful":0,"cool":0},"r9HVlNTEMVExVkz2LFBsMw":{"text":"Been a few times, enjoyed the quesadillas and sangria pitcher. Might even be better than C","useful":0,"cool":0},"4lpUQ-171F5Aiv7G3uq6KA":{"text":"Oh yum!!! very good, very fresh!! We had the chips & salsa - the salsa was very tasty - go","useful":0,"cool":0},"bWZiaC4vI_fnB9dEuc2uTw":{"text":"I might be biased being from California, but Juan's doesn't do much for me in the burrito ","useful":1,"cool":0},"_fAB0Ri_xRNCtnzG5xq6yA":{"text":"I'm always sketchy about eating at new Mexican food places, but after going here with a fr","useful":1,"cool":1},"stJcbov45FMRnTWkGBHXNw":{"text":"Solid 4 star joint. Would give you 5, but your music can be too loud and I don't care for ","useful":0,"cool":0},"TawOqCQYeo0YsgPrAvgheg":{"text":"Yum... signature burrito. Juicy healthy. Just come and eat. Waitress nice service. We ate ","useful":1,"cool":0},"PvvCiHbyes_Pg9v3AQTy2Q":{"text":"Great. Great. Great. It's is great at what it seeks to be and prices are very fair. Nachos","useful":0,"cool":0},"L0WEMxoT4KyTrV2Cq7F9RA":{"text":"Came across this cute place and food was great! Service even better! Great assortment of t","useful":0,"cool":0},"aKHPTH_mdgC44p2huvRorw":{"text":"This place was actually good. The chips and queso were amazing. I had shrimp tacos that we","useful":0,"cool":0},"eS2p7en_llSETAaLHRvVlQ":{"text":"Juan's Flying Burrito was very good to eat at, but also muy hipsterville... not that that'","useful":0,"cool":0},"Ge2VGXGX-dSL0WIowFKxZg":{"text":"Went here for the first time last night and wasn't disappointed.  It was hoppin' (Saturday","useful":1,"cool":0},"lGyn8NcjDlUjcPrp5i04Cg":{"text":"First off. I am a huge Lucero fan and when you go into this place they have an old poster ","useful":0,"cool":0},"XryRGnIzinB-sxwEKAXcjA":{"text":"I was super happy with this restaurant! I went for the first time with friends and it was ","useful":0,"cool":1},"E3s4oanIldUpdeRzzULrwg":{"text":"My friends and I were wandering around the Garden District and stumbled on this place. Gre","useful":0,"cool":0},"s-UtNhp9Pf4ZFPN5jyLCjQ":{"text":"A great place to be. The motto should really be \"come hungry, leave happy\" because it's an","useful":0,"cool":0},"tAmfsAVb-WD4hLz6C5x2rg":{"text":"Yes, I am a fan of Juan's and have been for a very long time. I love its casual vibe and f","useful":4,"cool":1},"TyyARVsA6Phj-kc6hpMRiQ":{"text":"This place is one of my fiance's favorite places. The happy hour double shot house margari","useful":0,"cool":0},"G-P5U4a8DlGHEYY2A3oSlw":{"text":"Te amo, Juan's. Your burritos are filling, and your drinks are... I can't recall, but I kn","useful":0,"cool":0},"QNqqmPFZJ9a-vddFAjbZeA":{"text":"This place is still my go to Mexican restaurant, but I guess they're trying to appease whi","useful":0,"cool":0},"BZ301nVKuNr7OMDHCoGkwA":{"text":"I very seriously have no clue how people give this place a bad review. I moved to Louisian","useful":2,"cool":1},"EDffststuqwz4NfJHA7Tsw":{"text":"Invisible, clear cheese?  OK , Momma didn;t raise no fool.  I like cheese, that is why whe","useful":0,"cool":0},"3KQ3Ssbv4i7ddGVp0DClYw":{"text":"This is a great little New Orleans style neighborhood Mexican spot. It was one of the firs","useful":3,"cool":2},"YS8K2E-THG4czLcKxtR9Gg":{"text":"I had the gutter punk with  guac & chips. Juans keeps the food quality consistant & reason","useful":0,"cool":0},"ULAPxL8XKwtsMwzgrumPww":{"text":"This is the best Mexican place in town! The ambiance was great - it was a little dark, but","useful":1,"cool":1},"_jHewqWPb_0gGaBDyAlSaA":{"text":"I couldn't believe how inexpensive but awesome this place was! My gf & I had a great dinne","useful":0,"cool":0},"XSnXwKZAUxq4U5EBc55ElQ":{"text":"I've eaten here twice since moving to New Orleans, and I have to say I you can't go wrong ","useful":1,"cool":0},"7bpJ8qd7FJheFxSfdXHrYQ":{"text":"Juan's makes funky, delicious \"Mexican\" food.  I'm not sure what you really call it (punk-","useful":1,"cool":1},"PbBO1cNkAoCZpNNhi8l_zA":{"text":"Juan's is always a solid choice. Service is fast, menu is extensive, drinks are strong, an","useful":0,"cool":0},"eZW45QY_a2g39vZY8IjlFg":{"text":"punk rock beer and burrito dive, but great fold, was there way ahead of the burrito bar fa","useful":0,"cool":0},"derzy0cvI5b4GXPKDCTUNA":{"text":"Average Mexican - not sure why it has 4 stars?  We had the chips and guacamole and a chees","useful":0,"cool":0},"Qp-cvkg1YOPjhjUYMQ9vkQ":{"text":"CAN WE SAY THIS IS THE BEST RESTAURANT TRYING TO SERVE HISPANIC FOOD IN THE CITY?!?\n\nThe f","useful":1,"cool":1},"R36wyq2a0h330tWqQDyJEw":{"text":"Super tasty food, had the Wet burrito with steak and loved it but too much to finish it al","useful":0,"cool":0},"5ct80rujHJr4HEHco6GzGw":{"text":"Great tastey burrito's and quesadilla's.  I got my first burrito wet and came with a heapi","useful":0,"cool":0},"3NZS0ZuMUoNW70exZyadig":{"text":"Someone told me the other day that my Yelp reviews are \"too nice\". I'll admit that unless ","useful":6,"cool":3},"ufe8a1vk4Vqa6JtCk3me_w":{"text":"I was originally drawn to this restaurant because who doesn't want to try out a place that","useful":0,"cool":0},"60d_uDQshYQYX1umGhWMvg":{"text":"Juan's Flying Burrito, fell flat on its face.\nI had the enchiladas, and have had much bett","useful":1,"cool":0},"WjQfNZ5Jj9mbBjEE3G50lQ":{"text":"One of my favorite places to grab a meal with friends. Cannot beat the $1 PBRs!","useful":0,"cool":0},"BYpk57GquWAd719lcO7fGg":{"text":"We love this place! We visit from Los Angeles often and I never like to have food that we ","useful":0,"cool":0},"PZzBSj1Or_JRDNRlORVclA":{"text":"Juan's offers great food at very reasonable prices.\n\nI have been to Juan's several times, ","useful":4,"cool":2},"oroPJsdFSj6CLXL4ioTRlg":{"text":"i go to juans a lot.  the food is good and reasonably priced....but the waitstaff...ugh.\ni","useful":0,"cool":0},"gqjh_uxP5boMVd1jIzXDag":{"text":"HUGE. The burritos are huge! Love the location, uptown on magazine. The salsa with the chi","useful":0,"cool":0},"ZQCIY0tPKBauZ-_Qg7cfNg":{"text":"The first meal we had when we arrived in NOLA and I was beyond impressed. I got the flying","useful":0,"cool":0},"T4heWaOErqRJGgIfHmuCXA":{"text":"I'm from Houston and here for a conference and after 5 days, I needed some mexican food. T","useful":0,"cool":0},"q0DkMPyLxISvmU5r-g_Bcg":{"text":"Excellent vegetarian and vegan options. Loved the mild and slightly sour guacamole. Had th","useful":1,"cool":0},"o0S_gGcpX9genQ9RJ85yTg":{"text":"Love this place!!!! The only thing I can complain about is that their menue is always chan","useful":0,"cool":0},"IxTeNmfTScULGlo_0eyoMA":{"text":"the Kamehameha nachos are possibly the best nachos I've ever had.\n\ndear lord.\n\ncan be a bi","useful":1,"cool":0},"hG34KiXrfFy3Mt4CIROsgA":{"text":"A great vibrant place with amazing Mexican food with a modern infusion of great ingredient","useful":1,"cool":0},"AjBcyrCVDy0T5RZGHK-juA":{"text":"Juan's is solid. Out of all the Juan's, this is the best Juan. \nThe quality of the food an","useful":4,"cool":2},"1rFbH4LAqiAWxXx5rtPMNA":{"text":"Thoroughly enjoyed the shrimp tacos. The atmosphere and restaurant staff were pleasant wit","useful":0,"cool":0},"n3LROQbvf9qwaSwgICqyMg":{"text":"There's nothing wrong with the food, it's all pretty good. But I've noticed the servers ne","useful":0,"cool":0},"aBBrSNMcR9zbPc4eOBgxig":{"text":"It's simple food but it's good. I've had a a sort of day that I wanted to leave behind and","useful":4,"cool":5},"APt8ETKdnwfvxxofilxfEQ":{"text":"This is an awesome spot! Juan's Flying Burrito was recommended by our friend who lived in ","useful":0,"cool":0},"E18OmjQpMDgQwPwnyOQJ4A":{"text":"Maybe its because i was raised around authentic mexican food, having grown up in San Anton","useful":0,"cool":0},"lE6UtxETrROmcXQZK4GQqg":{"text":"Mmmmm.  Mexican.  Lots of it, in different ways, shapes and forms.  Fresh, comforting, del","useful":1,"cool":0},"Dx9cgunTwYFug3EG80jOSQ":{"text":"Always have a great experience at Juan's.  The food always comes so quick and is always de","useful":0,"cool":0},"eW5feGSVtWqr1_tU6QCVgg":{"text":"I've been having a hard time finding good Mexican food in New Orleans. After eating at JFB","useful":1,"cool":1},"-iylqyMvOvodCfW5ehGqSA":{"text":"$5 margaritas (in a pint glass)? $3 micheladas? An outdoor courtyard? What's not to like? ","useful":2,"cool":1},"Xvc3YlpamIEWjUolxoBbKA":{"text":"A refreshing break from some of the more traditional New Orleans cuisine.  This hits the s","useful":0,"cool":0},"6cmNeIxb9LU4vCJ4MI6H7Q":{"text":"not sure about all these rave reviews..if you ever make mexican food at home you can make ","useful":0,"cool":0},"ZUS01sCBqWE_8l15a4aruw":{"text":"Ok...I'm going to start by saying that the food was great!!! This is Not Authentic Mexican","useful":1,"cool":0},"v2mtGaXm8K3hd8LKYAkO8w":{"text":"If you want flavorful food with a kick, this is the spot!  The jerk chicken burritos never","useful":0,"cool":0},"RwBS7nDSIfGbSUG3Y8e3jQ":{"text":"Great! Food was great, our waiter Hilary was great, decor was great, even Simpsons on TV w","useful":1,"cool":1},"o_tg7cMJ61uNDtLY6H9ZGA":{"text":"If you like what's on the menu then you'll love it here. If you ever want them to make som","useful":0,"cool":0},"p8_tKdw6YJfJ7xWBeO7ZmA":{"text":"Juan's is great for Tex-Mex and drinks, and I've eaten here probably five times . Everythi","useful":0,"cool":0},"8KgWytT_41YVyu0f98i2NQ":{"text":"While 'burrito' is in its name, Juan's Flying Burrito (in the LGD) has some of the best ta","useful":1,"cool":0},"iFU8ErO7BTLTzjvI10VxXQ":{"text":"Super yummy. Also super cold, but the food-induced satisfaction outweighed that. I had the","useful":1,"cool":0},"ZOvq-r1lrcOdmOzPT9NwAg":{"text":"We had to wait about 20 minutes for a table.  The supreme grande nachos were excellant. I ","useful":0,"cool":0},"Z6tZtQ_P_dmDmyDlbaHk8g":{"text":"This place is absolutely delicious! Came here as it was close to where to I am staying and","useful":1,"cool":1},"UMSZ9zUtC_uyOo2Kw9ok1g":{"text":"Mouth watering just thinking about our last lunch here.  Great hangover spot, ultra fast s","useful":1,"cool":0},"m4bJuEpoAoJf8YypMNBwOA":{"text":"This was a great NOLA find when we needed a veg friendly place but really wanted Mexican f","useful":0,"cool":0},"DIJfbMmroZN4NQscjmgcKg":{"text":"Do not eat here if you have ever eaten real Mexican food.\n\nUnfortunately this may have bee","useful":0,"cool":0},"kgcE01SJiWlD-lShw54Xbg":{"text":"Juan's Flying Burrito blows all other New Orleans Mexican eateries out of the water and to","useful":0,"cool":0},"G4_ZiatDggo5rsrHGE2bTg":{"text":"Great spot for getting together with friends and having some delicious food and great drin","useful":0,"cool":0},"1sqPDeoeiV57RdZzO0TA7A":{"text":"Every time family comes to visit I take them on the double decker bus tour and every time ","useful":0,"cool":0},"yIHABZ-1wdbC4IBB0ATbzw":{"text":"The Western Burrito and a popstar. Man, I love these guys!\n\nDelicious food, good prices, F","useful":1,"cool":1},"scxhIKQiqPVlZEyammzcoQ":{"text":"We were visiting NOLA and were thrilled to find this joint within walking distance to our ","useful":1,"cool":1},"3T9BI0w0aWw100JyFHUhNA":{"text":"First time here with some co workers for lunch. Very cool atmosphere. Lots of different ta","useful":0,"cool":0},"YwaZakn6gGurbSK-SdGubg":{"text":"Juan's omg what a find. Just ask the mailman. On Magazine in the Garden District don't mis","useful":1,"cool":1},"g7-Vw2myD607ROvdrT5BVg":{"text":"Juan's never gets old. I love all of their food. I always start with the guacamole and que","useful":1,"cool":0},"yGBZiIoKkIVCAi7yXiNFqg":{"text":"It's alright. Out of a few visits (to other locations mainly) I've only ordered 1 entree t","useful":0,"cool":0},"SX2XV7solsMpmgBUwicdLw":{"text":"This is the ultimate mexican place in New Orleans. They have the best best vegan options. ","useful":0,"cool":0},"PsNVtAzY2hV7wZkTYz4zCw":{"text":"Juan's, I love your chips when they're still warm, and I love your salsa which is fresh an","useful":1,"cool":1},"XS_DoHuWlEHvqIaxh2_RKA":{"text":"Another place I never visit home without eating at. It has been a favorite since I was in ","useful":0,"cool":0},"ruOzwcW6x5IC3CJbhcx3MA":{"text":"This is my favorite Juan's location. Why? Great music, outdoor patio, no children. Staff i","useful":1,"cool":1},"Sv1l8bjw6wR61oVmXPjN_g":{"text":"I've heard (non-yelp) things before eating here and my food was better than expected. The ","useful":1,"cool":2},"GiFQmD1UxT60JrB5KR9i1Q":{"text":"Stopped in New Orleans to visit during a road trip. Found this place right before it was c","useful":0,"cool":0},"uVBzZbWlz41RXRwldhaULQ":{"text":"My husband and I stopped in last night for dinner and drinks. Started with the trio dip ap","useful":0,"cool":0},"JoJ0YPRb1phusG_5SwSNsg":{"text":"We stopped in a couple hours before the start of a parade and was pleased and kind of surp","useful":0,"cool":0},"tWX-fg9kDMHIfmmPKZCNSA":{"text":"The service was great and the location being on magazine st was really convenient, but ove","useful":2,"cool":2},"DciSrEPZ_XiLiFSuNPEQRg":{"text":"Jesus Christ, Juan's.\n\nThe saga continues. \n\nExcept, eff that. Tonight I went to Juan's in","useful":1,"cool":0},"2WLuIqBi2yGv2y91WwZF9g":{"text":"Fish Tacos my favorite thing there but the nachos are awesome as well","useful":0,"cool":0},"w0vX8iJwYxn6jFCvMMkuDg":{"text":"This review should be bad, but somehow its still good.\n\nI've been here a number of times a","useful":0,"cool":0},"ae6bcNo9sDGR1oQPEcplyQ":{"text":"Love this place! Just had a red chile chicken quesedilla--nice combination of flavors, ver","useful":0,"cool":0},"vMSM1EbkZDotnAzrPj947Q":{"text":"Great food. Plenty of choice for veggies which is a big deal when you're travelling in the","useful":0,"cool":1},"bq-IS2PvJvdLYrgW04kV-w":{"text":"We split nachos and the al pastor burrito. The burrito had a strange taste, but the nachos","useful":1,"cool":0},"y_hdGx-e8MOLPmgk307NEw":{"text":"A California native, I was looking forward to trying Juan's after all the hype built up ar","useful":0,"cool":0},"Hc7aG7raYsYgkvZPj4lbQA":{"text":"We went here with our friends that live in new orleans.  The place was packed on a Friday ","useful":0,"cool":0},"o7TvmYLdmj45EvzOCaotnA":{"text":"I spent 3 weeks in New Orleans and this quickly became one of my favorite places.  The nac","useful":0,"cool":0},"8A-Sy3s9UJckp3XICLSEMw":{"text":"This place is terrible. Not real Mexican food. They should start by improving the Burrito ","useful":0,"cool":0},"cfngAXI6rtj3wwhkZA153A":{"text":"We came in with a group, got seated right away and received AMAZING customer service from ","useful":0,"cool":0},"ivn-tTyb2EZ8alNKUvj71w":{"text":"My favorite burrito place in Nola. Food is always correct and hot. Also a nice full servic","useful":0,"cool":0},"V9xWY6RgaSn4HyyIiF-PoQ":{"text":"yum. yum. yum.\nchowed down on the indian tacos after a long day of dancing and damn, did t","useful":0,"cool":0},"Na2pzEWgaeB8BCNN89iTIw":{"text":"I just discovered this place 2 days ago, and we have eaten here twice already.  The food i","useful":0,"cool":0},"aY19tw1gROI2jFkpn4WVWg":{"text":"Stuck in California.  Really missing some Juan's.  \n\nThis is my favorite place in NOLA.","useful":0,"cool":0},"J2-NiwC_hE855YCZ1hZGFA":{"text":"Juan's was super memorable during last visit to New Orleans. I needed a break from all the","useful":3,"cool":1},"_pYBCIapXX2HlCdkDT1l3A":{"text":"First time at this location, they are just as good as the other location on Baronne! We or","useful":0,"cool":0},"3h51va9vkOI1l-L8nUymsQ":{"text":"Good solid burritos, didn't get to try other items.  Good options.","useful":0,"cool":0},"9avLRqt9dJcazGancCIXsg":{"text":"I wanted this to be my first review on Yelp. It's a staple for many NOLA folks, and certai","useful":0,"cool":0},"EU-obCA5V5H6fIgIKHNX1Q":{"text":"Went here for lunch and the door was locked! Arrived at 11:15 and we were denied access. S","useful":0,"cool":0},"jGBUOzhhUtoK0CPK6yqdmA":{"text":"Excellent environment and very trendy. Love the music- Can't go wrong with Jack White! Oh,","useful":0,"cool":0},"o4xnyBgd3vy_oJ7LWHTe-Q":{"text":"It is bad enough to be accosted by crusties at every intersection and sidewalk in New Orle","useful":4,"cool":0},"GzV4H92J1Oqkrrr21cXf5A":{"text":"The carnitas tacos were good, adding the house hot sauce pretty much made the tacos, crawf","useful":0,"cool":1},"OJAoHxDynLuHkwGbAhr5Gg":{"text":"A little wait upon arriving isn't always a problem. It means great food awaits. This resta","useful":0,"cool":0},"349V9YVH8gxjtZVxoxfKvA":{"text":"To start, I come here every time I'm\nI'm NOLA. For years I loved this place and always bri","useful":0,"cool":0},"4h-B8ry_D_sFG4VQlneAyA":{"text":"I loved this place so much. Started our meal with the trio of dips. The queso and guac wer","useful":0,"cool":0},"hgqeJEth5oG8X4eHqBivQw":{"text":"Dirty? Yes, it can be dirty. New Orleans is a dirty city. Have you ever been to the bathro","useful":1,"cool":0},"s8ICRIpLna5wa8FASJPEoQ":{"text":"I've only had a burrito and their fish tacos (that people rave about). The tortillas for t","useful":0,"cool":0},"XuoEsDhyEK3k_UC7eOeqlA":{"text":"I wish I could give Juan's on Magazine (not Carrollton location) ten stars. I love Mexican","useful":3,"cool":0},"jfnxe3fNB0VIyJcuyyHwDA":{"text":"Hello, I've always loved juans, normally going there at least once a week. The food and dr","useful":0,"cool":0},"PHErL3r24XP9zbAeC1mXRg":{"text":"Amazing quesadilla... average burrito. Good salsa and guac  the chips are great, light, an","useful":0,"cool":0},"VC7-UBVgH5YJkm7vyWJYew":{"text":"i really like this place - good food, drinks, and service with reasonable prices and gener","useful":0,"cool":0},"PU9rmxCdnbYb98ZfOB-OQw":{"text":"On the pricey side but so much food! And so delicious. Many many options for meat lovers a","useful":0,"cool":0},"Ze6Lw8guRuxqKElfedgmzQ":{"text":"This place is awesome!  Great drink menu, super friendly wait staff, eclectic decor, and a","useful":0,"cool":0},"goSDvfNl8fsCaud6oWVuWg":{"text":"I stopped in after a long shopping and walking day on Magazine St and in the garden distri","useful":0,"cool":0},"Gok5wCE1Vg5OLfkJcrmr8w":{"text":"I am by no means vegan, but I had the vegan burrito and it was great. Extremely rich but i","useful":0,"cool":0},"vZVgGwLPTSKNBC8T4M-dWQ":{"text":"First time here and had Taco Salad, it was so delicious with amazing flavor! Can't wait to","useful":0,"cool":0},"OXEEVNNOGjWsB58MrXiyuA":{"text":"Everybody kept telling us that this was a great place to go.  They were right!  The food w","useful":0,"cool":0},"fBo4aNe0DpZL32ijNmPoug":{"text":"I have been here several times and every time I'm amazed at how delicious everything is.  ","useful":0,"cool":0},"w2hB76U1oN6RGQAOwwRWqQ":{"text":"October 2015\n\nThe service was decent.  When I informed my server that I enjoy spicy food, ","useful":0,"cool":0},"6E7hiXCygarkkysyVz3n9Q":{"text":"Excellent tofu options. Good spice level. Enjoyed the veggie tacos. Chicken fajita was als","useful":0,"cool":0},"u8dyQjWaP5XxmYEEJyd0gw":{"text":"I eat here all the time so I guess I should finally pen a review.  \n\nThis place is great. ","useful":2,"cool":0},"Z4XoRVCQiaZG4IOT0EtkVQ":{"text":"I moved to Brooklyn 5 years ago and continue to wake up at night in a cold sweat craving a","useful":0,"cool":0},"GbLRuSohnvi_g8LlIlxISg":{"text":"Very funky restaurant in the Garden District. Casual atmosphere with some amazing Mexican ","useful":1,"cool":0},"rMhYp5oM_vDPgA7crebtIQ":{"text":"I just moved to Nola two weeks ago and have already been to Juan's Flying Burrito three ti","useful":1,"cool":0},"Jygw7HGdQaH9wQvBGt3W_A":{"text":"First challenge: Nearly everything on the menu sounds delicious.  \nSecond challenge: Nearl","useful":0,"cool":0},"9ZSYRSCWLjHi07Ofddlftw":{"text":"This place is is not you average Mexican food joint. The food is amazing with a different ","useful":0,"cool":0},"bkotNDJ0EVkU2TjCv5TmJA":{"text":"My family and I stumbled upon this nice little Gem after leaving a tattoo parlor down the ","useful":0,"cool":0},"qGgT2g8ItDcN-YXnHqDJmQ":{"text":"Love the Nachos here! They stack em high and will them with goodies. We think it's the bes","useful":0,"cool":0},"YTqUK6WeISpKeMWsUhtk0w":{"text":"DO NOT EAT HERE IF YOU ARE VEGETARIAN. \n\nThis review applies to this location and Barrone.","useful":2,"cool":0},"wHqf594FwHjaCC2nSNQjag":{"text":"Sub par service but the food was delicious and not too expensive.","useful":0,"cool":0},"oBebcRR0uk_WXrb773pETw":{"text":"Great food, great waiter, nice atmosphere. I'll definitely go here every time I visit NOLA","useful":0,"cool":0},"5ZFfGjpkYx-jNTy4xdYOLA":{"text":"If you haven't tried JFB, go now! Had their Jerk Chicken burrito and my friend had their A","useful":0,"cool":0},"u3AqPkVAD7nwomoD5ip1LA":{"text":"Found this hole in the wall place while exploring New Orleans looking for a cheap place to","useful":0,"cool":0},"UE0u_VBHe4KHMopVru9Rnw":{"text":"Pretty good food though not my favourite Mexican joint in town. The servers and cooks are ","useful":0,"cool":0},"pKCqIWdWsuAXpVxP5fnGVQ":{"text":"I'm from California and have been living in New Orleans for 5 months CRAVING good Mexican ","useful":1,"cool":1},"LCcG6-4cnu5j3k6tkl09sg":{"text":"Juan's is one of my go to spots for lunch, no matter if I'm famished or just peckish. look","useful":2,"cool":1},"nICwiz279le1MSqmbteSHw":{"text":"Who doesn't love JFB? My boyfriend eats there a minimum of 3 days a week. It's usually pre","useful":0,"cool":0},"CC4Ul1jElidO8BYXaw7lwQ":{"text":"The staff is attentive, the chips are fresh and warm, the dip is very tasty. The queso is ","useful":0,"cool":0},"DoF4lc8dumeTply89tmV0g":{"text":"I've been twice now to Juan's and definitely plan on making this one of my regular places.","useful":1,"cool":0},"TWTux8AOZTra3JpiJdbtZQ":{"text":"I was here last month and was told that this was one of the best spots to get Mexican food","useful":0,"cool":0},"JczsJcQLmFVoNmBq1dOqVQ":{"text":"Juans on magazine,  you are real cool.  Even though I wish some of your entrees were more ","useful":1,"cool":1},"k84UhOuqJQDQ7JGbXKPb8Q":{"text":"Love it love it fun. Good drinks casual great good come here a lot service very quick and ","useful":0,"cool":0},"CoE5g4qvT4SzvtLT4ZKoXw":{"text":"The nacho servings are enormous.  The burritos are huge.  They will allow you to mix and m","useful":0,"cool":0},"WNI69BZnfDCPnRTpXr2dHg":{"text":"The food can be good & is inexpensive but they are not careful with their food. I have had","useful":1,"cool":0},"rqlM1IhAUSXdVLHRBXTfqg":{"text":"Excellent Mexican food in NOLA! Had dinner at the Magazine Street location last night and ","useful":2,"cool":0},"cTz_mqx4EgrIWcHVYrj9rA":{"text":"Hubby and I visited  21 October 15, during the lunch rush, around 1200. We ordered the que","useful":1,"cool":1},"_3gQBCx-Up7eGT6bI9DPRA":{"text":"Do not sleep on this place! we were seated immediately,  our waitress was very attentive (","useful":1,"cool":1},"xdOShC8brBWHlRy-p4LF7w":{"text":"Consistently great, cheap and fresh.  Try the juaha rolls, the pork and slaw tacos, the ba","useful":0,"cool":0},"cL6faRH8ZtljZ5eJ1mhMMw":{"text":"Always a fantastic meal. Tries the quesadillas this time, and was not disappointed. And th","useful":0,"cool":0},"i42CuElByayo4bEUJkJPcQ":{"text":"I'm a bit of a type A, hands on, clearly outlined with color coded highlights list of plac","useful":1,"cool":1},"_cDISvJJP8WGRSmN3baVvQ":{"text":"YUMMO! That is what describes this fun restaurant. Our server was attentive and fast and t","useful":1,"cool":0},"GWecelJQkzS7c0hn5x97Kg":{"text":"We stumbled on this place today and found out it was a locals spot. Delicious food, we had","useful":0,"cool":0},"ZnNanRJ5466fVBnYsyi-7A":{"text":"I frequent this place at least twice a month. My favorite place in New Orleans for fish ta","useful":0,"cool":1},"lF07ZnVlbeLC2gITPEopSA":{"text":"The service is becoming atrocious. I seriously come here less and less because I don't wan","useful":3,"cool":1},"O3QVVwTF-3qFyZo09SOg9A":{"text":"Look, I don't want to bash Juans too much. I've been a regular since they opened. \nAlways ","useful":0,"cool":0},"5ygUzoKOIMUMic5M46WAEg":{"text":"LOVE THIS PLACE.  Fun look and location, such great food! Prices are reasonable,  and ever","useful":0,"cool":0},"B7dvomuxG0vXoxBSBCiTcQ":{"text":"Fun place! Georgia was our server and she was way fabulous! The food is unique and specifi","useful":1,"cool":0},"6wGjjZkbAhcPnorLeh6INg":{"text":"Great music, uber staff, oh and the food. Awesome. We normally start with guacamole, salsa","useful":1,"cool":0},"dpNftBSJXB_-x7lykO3CGA":{"text":"Let's start off with the food. As a starter, my top choice is the chorizo queso. The queso","useful":1,"cool":0},"W9xS_lZeMzdsxP1KksvHGQ":{"text":"We tried the Al Pastor burrito and loved the caramelization of the pork, the touch of swee","useful":0,"cool":0},"dOVzi3Ql5A59RtS6W8nsNA":{"text":"When I came to New Orleans two years ago, I went through some serious Chipotle withdrawal.","useful":0,"cool":0},"9hZBHhUhBBsj2vl8Go9RKA":{"text":"Just moved here from San Francisco, so I'm spoiled for good Mexican food. We had some bad ","useful":1,"cool":0},"CWsezLBQA0PGZXXUyI7djQ":{"text":"The food was fantastic and the relaxed atmosphere was just what i needed! Try the beef enc","useful":0,"cool":0},"42hrQdI1Ln4IVEP1lMwqSQ":{"text":"We look forward to visiting Juan's every time we travel to New Orleans.  We stumbled upon ","useful":0,"cool":0},"yuPQf5byRAgjx6OFdpDRiw":{"text":"Good prices, great margaritas, food is delicious. Rarely is there a kitchen backup, only s","useful":0,"cool":0},"2eLf13AWxqd4iKcYXPwzWQ":{"text":"Reasonably priced and sometimes crowded. I like to keep it simple with Mexican food.  Or s","useful":0,"cool":0},"tqlJx7dD3Y3B8e_Jrsn_hA":{"text":"Came here late one night. We were seated immediately. F had a big burrito that he loved I ","useful":0,"cool":0},"SskomdHHO6FEl1gOBGF6cg":{"text":"I get it now. \n\nI've jumped on the Juan's fan train and I don't see a stop anytime soon. W","useful":3,"cool":1},"E-qFbAw0Bt156OXBpZPlpg":{"text":"Went here today for lunch with a co-worker.  The \"hostess\" threw the 2 menus on the table ","useful":5,"cool":0},"XNcWGkaOGkKGxFSyFVETBQ":{"text":"The service here was lively and great. We got our food quick and it was really good. Price","useful":0,"cool":0},"-QFDybEdTTrBQfbEPs_iqQ":{"text":"Always great food. I've been going to Juan's for over ten years, but never had the Gutter ","useful":0,"cool":0},"W6UW9IyCKXzd4wwM4znSgA":{"text":"My boyfriend and I come here all the time when we want great food and a fun atmosphere. Th","useful":0,"cool":0},"yEjYuQa_W3Ifv2-vH8i4Jw":{"text":"Worst dining experience in NOLA, ever. Terrible music was too loud. was unsettling. So-so ","useful":0,"cool":0},"PnFV2zo_6snYQ4VMG1nLcw":{"text":"My first time here and couldn't have been happier the Restaurant across the street was clo","useful":0,"cool":0},"2rT49nnNeDWRf3lLCK_AEg":{"text":"Super excellent vegetarian and vegan options PLUS has the drinks to back it up. Staff are ","useful":0,"cool":0},"IBXP-s6Swc9S2DEqq4d2Ig":{"text":"Crawfish queso dip is pretty yummy! \nI have been twice while visiting New Orleans and have","useful":0,"cool":0},"7dzwB7i5Cc3BoaDs8zuxxg":{"text":"While I normally like Juan's, I had a pretty disappointing experience with the waitress to","useful":0,"cool":0},"kWDqV30HZBNmz_97sQThgA":{"text":"One of the best burrito place iv been to, and I'm from California/Arizona. Great funky pla","useful":0,"cool":0},"vvWX9xpPkqHkZucRiKOYfg":{"text":"I had the chile lime goat cheese quesadilla and chipotle shrimp and cheddar grits. Holy sm","useful":2,"cool":1},"eIsSW4no7Xw04IP6eXOZ7A":{"text":"The best margarita in town, plus the nicest wait staff. We go every week we love it that m","useful":0,"cool":0},"TK5yNHHwF3U-o_h4FlRPpQ":{"text":"I visited NOLA back in January for NYE. My boyfriend and I went here for dinner before we ","useful":0,"cool":0},"Q8rs24jdh08dL691t68FSQ":{"text":"I always order take-out from Juan's, because the place is often crowded, loud and full of ","useful":0,"cool":0},"yldFYgmtrWsRAlDFVB6LCg":{"text":"Its Juans, so it kicks ass! \nThe jerk chicken nachos would beat down any other nachos anyw","useful":2,"cool":2},"dBAsBSaCruhArvoTE6XxeQ":{"text":"The flying enchiladas are good. Priced pretty well and a good atmosphere. Doesn't have the","useful":0,"cool":0},"XRttZ8l0cxVJpS3Pb039gw":{"text":"Nice fusion of Mex/Carib/HealthyHipster. Had the Tacos with Jerk chicken. Very fresh & bur","useful":0,"cool":0},"Wl-Y3q-Wx2c1swQMgaIarw":{"text":"I went to Juan's today for lunch. I have always heard great things, but had never been mys","useful":2,"cool":3},"uPqIPN_khTYKiW24CWS8Rw":{"text":"Just ate there again tonight. Always a good experience. Food is consistent. Giving it 4 st","useful":0,"cool":0},"PCDdUSf4Zvf7k_z60Ez4lg":{"text":"Now... I was only in town for four days, but I ate a lot of food in New Orleans... That sa","useful":0,"cool":0},"6CYYtJpdom9PWgDzQTqLCQ":{"text":"I've been to Juan's twice and I've loved it both times. Although I'm not a huge burrito fa","useful":0,"cool":0},"ibglr9F-phX4rUI8xy4SUA":{"text":"I spend a lot of time right near this Juans so I come here a lot. I've never had a bad exp","useful":1,"cool":0},"pB5_SAnUhCnEoFh7uyYP-A":{"text":"Juan's was here when I moved into the neighborhood in 2000 and I was thrilled to find it s","useful":0,"cool":0},"kGX7fSc97eM-_SYYhDyzqw":{"text":"So good. Soo soo good. Decent prices, good and consistent food. Great atmosphere","useful":0,"cool":0},"0T3BIIFEnsgmBIHWCpILxQ":{"text":"It's just not fair to leave them at three stars when I've been back a couple times over th","useful":21,"cool":13},"OoM2gpCBAmdmddkKkAN_2A":{"text":"Now you're talkin. This place is fantastic. The shrimp fajitas are wonderful. They give yo","useful":0,"cool":0},"VSHHtTwfidfgpmdCYwWUVQ":{"text":"Muy Bueno!!! I'm talking tacos that are as good, or better, than any I've had in LA, Phoen","useful":0,"cool":0},"IpcLlSaw_OI8QBPCmVCSKg":{"text":"I'm kind of in the middle of the road on this joint.  It's around the corner, so we eat th","useful":1,"cool":1},"bZ3iWyZ_gdw4gtB6P6ZcVg":{"text":"Love this place! As a vegetarian, there are lots of options available (which I SO apprecia","useful":0,"cool":1},"Gw7WLzHsM8W071TLQj8goQ":{"text":"Love this place for cheap eats, great margaritas and even better guacamole. The magazine i","useful":0,"cool":0},"8WtPZ7iCm65zHsCEPuK9lw":{"text":"The uptown location on Magazine St is our go-to spot. The food is good, the veggie options","useful":0,"cool":0},"s_ZIui2K0AFNeqDQ1kuy4Q":{"text":"Casual, funky, yummy, great vibe! Really enjoyed the food, service and atmosphere... And t","useful":0,"cool":0},"TtFEXJzolFhpmd6zfr-JjQ":{"text":"I eat at the downtown location of Juan's frequently, and have no issues with the chain as ","useful":1,"cool":1},"U6Ybg62e74rFRCCX9x8V7g":{"text":"Great TexMex!!  The food was fresh and seasoned. Delicious. Friendly staff and a laid back","useful":0,"cool":0},"EPmzZiYhyqEQEFkjFBymNQ":{"text":"Dying of starvation after getting caught in traffic and luckily for us this place was in w","useful":0,"cool":0},"CsWijbjadvRqO2_5_R1tHw":{"text":"I have eaten here at least 10 times in the last year and I love it every time. I highly re","useful":1,"cool":0},"omcHnuPQf-AMQ4X24v656g":{"text":"Cool little place, fun waitress. Still thinking about the bean dip - it should always come","useful":0,"cool":0},"K3i0sbM95LhT_1rknogTBQ":{"text":"It was worth the trek out here to get a burrito! Even though it's a tourist trap, the burr","useful":0,"cool":0},"SWm5QPZnBSgR572jtTzkzw":{"text":"AWESOME...had the gutter punk burrito with ground beef...WOW!!!!...Highly recomend this pl","useful":0,"cool":0},"0B8KzeidSrBTmgyPez8xjQ":{"text":"Super solid! We have been eating here for years and it remains extremely consistent. We fr","useful":0,"cool":0},"JXa_l5J9pirwFAfne4YWKw":{"text":"I really like the food and the prices are pretty reasonable. I crave this place every now ","useful":2,"cool":0},"GC19ht-XarR80et0J8-b1Q":{"text":"Literally the best tex mex food around! Strong drinks & fast service! Highly recommend the","useful":0,"cool":0},"FgWqd9tldOcVHrJWNCA5uw":{"text":"Walked in here randomly when we were looking for a quick snack. Had the chorizo queso whic","useful":0,"cool":0},"aO-XQpGHpTnAaNOuPZ26EA":{"text":"Four stars for the drinks and three for the food.  The Magazine location is where I usuall","useful":1,"cool":1},"8vkb_XvjpECqyby7aF33KQ":{"text":"Good tacos. The Pork 'n' Slaw on corn tortillas are worth visiting for. They don't mess ar","useful":0,"cool":0},"AZqoPOHeV2VXp4bCJjj18A":{"text":"OMG..... BACON AZUL SUB GROUND BEEF FOR SHRIMP ( Changed my life!!!!!!!!!!!!) It was like ","useful":0,"cool":0},"CSdb6OfV9YtTKd32lH4K1A":{"text":"Delicious, fresh Mexican fare and great drinks.  If the crowded interior is packed, there'","useful":0,"cool":0},"CCb5549kOeI8QjUAlWOYow":{"text":"Recently visited Juan's with some friends on a Saturday. I expected seating to be beyond d","useful":1,"cool":0},"-uXxdL0MrloyArHv87qnMg":{"text":"Hipster burrito joint force for good with free refill on chips and housemade guac! Wife ha","useful":0,"cool":0},"oxqC5sSs1TGLMgkJzrwSAw":{"text":"Love the burritos at Juan's Flying Burrito.  I also like the chips with \"queso\" (melted ch","useful":0,"cool":0},"surTqdDOGi0VFuN3KxgA2Q":{"text":"Juan's is great. I eat here at least twice a week. They have margarita specials for happy ","useful":0,"cool":0},"zvyAB8mHN73i6gxZmd_leQ":{"text":"So, I moved away to another state for over two years, and this is one of the things I trul","useful":0,"cool":0},"orguOmf3IOCXfEmD_vaibw":{"text":"Quick tips: Delicious and deceivingly strong house margaritas. They have one of my favorit","useful":3,"cool":2},"-xDUuhjEgC7kRs4VH9amOA":{"text":"I've been here a few times. I liked the drinks. I remember the hawaiian nachos being good ","useful":0,"cool":0},"Pv3ole7-PzgAhtVY4s6l1w":{"text":"A very eclectic burrito shop in an interesting part of NOLA. We didn't know what to expect","useful":0,"cool":0},"svb8VCI0qcGfhxHN73-0Sg":{"text":"This restaraunt was absolutely amazing. Started off with chips and Queso and their Queso w","useful":0,"cool":0},"Gtq4ftuMoaRg3cR8BynXtA":{"text":"Juan's is a great go-to place for a good, quick bite. The margaritas are up to standard an","useful":0,"cool":0},"3XwOMC-95pojtVTtXr8qLg":{"text":"In a single, one-week trip to NOLA, I made it to Juan's twice.  Did I mention I was stayin","useful":1,"cool":0},"wR5Lxnbv83Diee60OieM_Q":{"text":"My favorite restaurant in all of Nola. My boyfriend and I moved down here in January and w","useful":0,"cool":0},"IXGo0wdYsm7uaA5f0pWeaQ":{"text":"The flying burrito and flying enchiladas ere both good. the side of beans and rice tasted ","useful":1,"cool":0},"ajUl-IuNWCJgHa3mO314mA":{"text":"I was amazed this week at how difficult it is to find a restaurant still serving breakfast","useful":0,"cool":0},"2BBXn86amHflLFhdIBX6WA":{"text":"Recently returned from a trip to New Orleans and decided to make a trip to this place. Cre","useful":0,"cool":0},"ZxpnevZv-vhA3c0Yu_-4Kg":{"text":"I've been eating here for years, but today I had a Jerk Gator Burrito and it was easily th","useful":2,"cool":3},"BYoXMbvanwrtJSXDhadD8g":{"text":"Juan's calling card is the fact that their menus combine creole influences with traditiona","useful":0,"cool":0},"IWinNZeRUPdCW7NYgaVBzQ":{"text":"I have been here twice and I am quite a fan! This is one of the few places I have found th","useful":1,"cool":1},"f_a-ZnVvjZ1t1e7GJLz-ig":{"text":"It's not exactly traditional tex-mex but this joint hits the spot with an edgy atmosphere ","useful":0,"cool":0},"qUWD_ZG_7NFchGrPNoJELQ":{"text":"On a whim (inspired by Yelp) I walked 1.7 miles to get one of these famed burritos. While ","useful":0,"cool":0},"szHPIi8KZC_g06EHxCAYIQ":{"text":"This is a great place for a quick lunch if you work in the city. The girls and I frequent ","useful":0,"cool":0},"bvIq1PdqLhWeHd2BFrfslQ":{"text":"Huge portions of deliciousness. If you leave here hungry it's your own fault. We had the j","useful":1,"cool":0},"0uZ1w_9GWKInq0ZzJCjLRg":{"text":"This place has some damn stellar texmex. The food is good, the staff is friendly and atten","useful":0,"cool":0},"-egtozAItvROvihycqm8BQ":{"text":"Oh yes....fresh, local, and amazing.  The vibe was cool, and everything we ordered was sha","useful":0,"cool":0},"y12MKKZeFgUVACjolhqlmA":{"text":"You could cram a lot of taco-lovers in this place.  There are some picnic tables out front","useful":0,"cool":0},"DAx-nGNi3HERfbrAnkucLA":{"text":"Delicious!!! After my friend and I checked into our hostel in NOLA, we asked for restauran","useful":0,"cool":0},"UxIoHFgFDJmeD01rkpYV8g":{"text":"We were looking for some lighter dairy-free and meat-free eats and found them here at Juan","useful":0,"cool":0},"7mckayqI531Whl-EbGDmLQ":{"text":"Have been to Juans more times that I can count because the food and drinks can be counted ","useful":0,"cool":0},"ENBYQ-QqAmdLZsJvOqnArQ":{"text":"Juan's is the best mexican food I've had so far in the city. It also has enough tequila fo","useful":0,"cool":0},"l6qYrTd22gQ93ylOUI6Ufw":{"text":"Awesome burritos!!!! Very detailed menus. A great deal to choose from. Wait staff was very","useful":0,"cool":0},"kNQIA1Y119smJStj4_CIEA":{"text":"I had just gotten to town and walked what felt like eight hundred miles. I was starving. M","useful":1,"cool":0},"LkDKuh0-PEyQQeT8LFjbXw":{"text":"Rude staff accusing customers of smoking which was a huge lie!! Still can't believe this h","useful":0,"cool":0},"5iDaDAEpSVrrzV0CVMka-Q":{"text":"*DISCLAIMER*\n\nIf you love death metal blasting your cochlear nerve to bits while you try t","useful":3,"cool":1},"09YBT7HDa5zDycj7DOgLxA":{"text":"Good food and margaritas! I had tacos - the Mardi Gras Indian, blackened fish and shrimp t","useful":0,"cool":0},"wd_JF4_umFs1b_vkKlBArg":{"text":"I came here about 3 years ago and the guacamole left a lasting impression ever since. My d","useful":1,"cool":0},"bLWkFhU9f5r-FV6TrtCmug":{"text":"Over rated.I you are in the immediate vicinity and have to have mexican food (tex-mex) sur","useful":1,"cool":0},"jFd8fgM1qrIt-1UylxSPGg":{"text":"Must Try:\n- Supreme Nachos\n- Jerk Nachos\n- Fish Tacos (we got the blackened)\n\nI'll Pass - ","useful":0,"cool":0},"E0u62KuulTYdXjISvJ1U9Q":{"text":"This is a mixed review. The good being the decor, location and food. The vego taco was gre","useful":0,"cool":0},"N2fcSNXCqlmUaL7xilPabg":{"text":"This place is really overrated in my opinion. Not that its bad, but I wasnt all that impre","useful":1,"cool":1},"tTWuOg5CchLCPSXYmv8gBw":{"text":"You know what's great about America? Food specialties of a particular region:\n\nTexas BBQ B","useful":2,"cool":2},"yQVfK4ts_xpRqGXc7f2W1A":{"text":"Awesome burritos and amazing frozen margaritas.  Flavor  in food was a 10 all the way!!  T","useful":0,"cool":0},"BcSeYQYzCN_lCgxalvAQgA":{"text":"Great spot for quick, reasonably priced, and tasty food! I've been to both the Magazine an","useful":0,"cool":0},"2RMQxvtrxXRCqfGAaN6vgQ":{"text":"Juan's is one of my favorite spots in New Orleans.  Food is consistently great (the Bacon ","useful":0,"cool":0},"pVIrXPplkQ7qjR1LiPS-1w":{"text":"I live very close to Juans. It's hard not to get addicted and go all the time. They are us","useful":2,"cool":1},"hoCOFsbG1k4kNVxLk17E_w":{"text":"I drive from Slidell at least once per week for their food. It is superb! I love their hou","useful":0,"cool":0},"gMTC7SUxfDLOrFKY56vlZQ":{"text":"This Juan in wayyyy better than the other Juan. Ha ha get it? But seriously the flying bur","useful":0,"cool":0},"nObC2xNRMmUfWFc0_vOjMw":{"text":"LOVED IT!!!!! Supreme nachos w/ shrimp :seasoned to perfection oh ADD cranch. Too bad I co","useful":1,"cool":0},"ph_dTEeHjPJLpMRWqtoC4Q":{"text":"Food was amazing....Right up my alley kind of spicy and tasty...New favorite place to go e","useful":0,"cool":0},"KddNMrNRtKwEq744x4atSw":{"text":"i got a burrito it was huge.. food was ok... but the decor and scene was awesome.. i will ","useful":0,"cool":0},"sRi2bYXjK4MsE_wE8PnSAg":{"text":"So unhappy with these guys.  The food is great but the service is beyond worthless.  I won","useful":0,"cool":0},"L_QSm2AuDfVkFCoFjlTWxw":{"text":"Really enjoyed the micheladas ($3) \nThe guacamole was awesome. \nThe service was also good\n","useful":0,"cool":0},"IVnZ-jV2ySaIyYYE4CVLGw":{"text":"Perhaps the ownership has changed, but the food just isn't the same qualify as it used to ","useful":0,"cool":0},"QXLp4uYcVIx9ZfdUhQM-ag":{"text":"I don't get it.  The food is bland and not particularly good yet a lot of my friends seem ","useful":3,"cool":0},"DoW6j6K4UahlxvKeVhWJlw":{"text":"I've boycotted Juan's for a couple of years now, based on some truly awful experiences the","useful":2,"cool":1},"nuKjesEbzJO-W1eWQs5CyA":{"text":"Busting Nola we went for dinner, had a great time both with the food and service. The serv","useful":0,"cool":0},"dn2YmPIwKN38Z8TGV4zclw":{"text":"Americanized Mexican fare, not super authentic, but still worthy. The margarita pitcher se","useful":0,"cool":0},"FuPRJOS7NVwQdg0fLDpcyg":{"text":"For starters, we got the Hawaii 5-0-4 nachos and it was the best nachos I've ever had! Han","useful":0,"cool":0},"coINsIiWbOn2KLZgTA1GRA":{"text":"I used to live a mere block from Juan's and am familiar with the lacking service and somet","useful":1,"cool":0},"sQ1kMinKSbJ8n1YPH_-avw":{"text":"Short summary: Go here. Go here and eat here. Then do it again, and again, and again.\n\nJua","useful":4,"cool":1},"lYzg1M8nc3ejPcaJSV_U0A":{"text":"A nice casual place to go with friends! It's normally pretty busy and popular but it's nic","useful":0,"cool":0},"xku0li_boW4bALuc6VkdkQ":{"text":"we got the trio but did the badass bean dip instead of the guac. I hade the el pastor it w","useful":0,"cool":0},"EbWkjQ9x-Of4FMzZfpUVHQ":{"text":"My family and I were rained in to the b&b we were staying at by the Hurricane Patricia, wh","useful":0,"cool":0},"NukKMKlAhcKctTMm7l0jhg":{"text":"Excellent food, waitress was great and food was inexpensive. Best chicken tacos ive ever h","useful":0,"cool":0},"GGVpRe-oeeidK-zQH02OLQ":{"text":"In the mood for burritos, we decided to venture to Juan's Flying Burrito located on Magazi","useful":2,"cool":0},"1JQ3RDG9MWZARnEe4PLVfA":{"text":"this place is pretty good. i usually go with a burrito, but recently i decided to try some","useful":1,"cool":1},"OBAItk47X3B2CKUkH_ug4g":{"text":"Good food and spin on traditional Mexican food. You have to get a burrito it and check out","useful":0,"cool":0},"l3UbX7AD7VIzfKyekBJYbw":{"text":"Juan's surprised me - the first time I went I got the flying burrito and I wasn't that imp","useful":0,"cool":0},"HLoiTpetMV3kyPNBOUuxdA":{"text":"Mmmm. So good.\n\nMy burrito was so huge and good. It was huge and good that afternoon, it w","useful":1,"cool":0},"ci-LUDuHFWvRNN_wPgWe6w":{"text":"Another in the \"finally got around to checking it out\" category. We thought it was really ","useful":0,"cool":0},"jWE6laBc-av3_9KD23xOMQ":{"text":"I ordered the signature Flying Burrito for $9.  Steak, chicken, shrimp, black beans, guaca","useful":0,"cool":0},"ariqX8Hod7M2ygArw1jq-Q":{"text":"Came here based on reviews, the staff was friendly and the food tasted great. For appetize","useful":0,"cool":0},"Ww447eS4H0gbp-o92MCeWg":{"text":"I would have given it four stars had it not been for the GOD AWFUL service!\n\nThe food is a","useful":0,"cool":0},"gnOImy_RPJkxXyqNT3LueQ":{"text":"Highly recommend this place. Food was great and didn't take long at all to get. The choriz","useful":0,"cool":0},"GsKbJqSFuKfWfM3QgllyFQ":{"text":"Fabulous Creole Mexican faire\n\nFOOD:\nTacos - Mardi Gras Indians \n\"roasted corn, pinto bean","useful":0,"cool":0},"Kk57crJd452HrYLH5l5VOA":{"text":"I just want to say that I love you guys! I appreciate that in the five years I've lived in","useful":0,"cool":0},"aG-hy0RgNDjcF4EvW1ss4g":{"text":"They let me use my groupon and the customer service was great. Planning on coming here to ","useful":0,"cool":0},"8koFLDiKQMzI9df1eYezFQ":{"text":"You are shopping on Magazine, your hungry, you need a margarita, you go here! It's as simp","useful":0,"cool":0},"py-Sf3Up33cw5mqH4J95gA":{"text":"Great value for the price. We got an appetizer, 2 entrees, 2 soft drinks, and a double mar","useful":0,"cool":0},"IiqTrHQtIqL6qBkNO__59g":{"text":"Very delicious and satisfying. I recommend getting a wet flying burrito. Staff are very fr","useful":0,"cool":0},"xzDgyU_PTqCzzR__bLCn1w":{"text":"Juan's is a great neighborhood joint. Prices are reasonable, service is friendly and fast.","useful":0,"cool":0},"iKn9WR5QsNMi0tkMpp2Nmg":{"text":"Juan's has never let me down, and my most recent experience was no exception.  A good frie","useful":0,"cool":0},"QWWNi9N1gqQ3XwA_aAWMCg":{"text":"I liked the hips and salsa but the food was so so. My husband swears by it, but I think he","useful":0,"cool":0},"G2bTOyYjoD-yEZOhblFbEQ":{"text":"I really loved the food here! It was an interesting blend of local NOLA flavor with tradit","useful":0,"cool":0},"KJk4hkgIZD90W9SQ4zG6Bg":{"text":"About 10 years ago, an old co-worker told me about Juan's late one night after we pulled a","useful":1,"cool":0},"luALbsnVKA0XTfaLajgAcA":{"text":"Service is always great, food always fresh. I eat here several times a week. They are on t","useful":0,"cool":0},"Oj5VOAbeJH2wN41Jgbmpng":{"text":"I love a good burrito, and Juan's has it.  I've eaten here only once so far, but I enjoyed","useful":1,"cool":0},"1fAa6NMaCcqcxKrxBwEPXA":{"text":"Me and my wife had the blackened fish tacos and the flying burrito. Both were exquisite! S","useful":1,"cool":1},"IoVSEbxyjm_Udsu5MrSVZw":{"text":"Oh man....my sister and I stumbled upon this place on our first night in Nola and it defin","useful":0,"cool":0},"o5CkrgfX0_yx5-d_AUa9hQ":{"text":"Generally, I'm not a huge fan of mexican food, but Juan's Flying Burrito is pretty freakin","useful":3,"cool":5},"MfYduygY6XB-NuHTJZqQeA":{"text":"This place is solid. I really enjoy walking down Magazine in general, and this is just a f","useful":1,"cool":1},"GRFxqrH8ewknbeMjuF5X1w":{"text":"Preface, I don't really dig this cuisine on the whole.  It's really hard to find really go","useful":1,"cool":2},"cWRMedjZvyMyoRd2QkMrEw":{"text":"This place was great! Mexican food was delish!!! The service was unbelievably fast! Seriou","useful":0,"cool":0},"g9zgchtqal4LbbfkP7Jlzw":{"text":"Been wanting to try this place, finally got the chance, but was not impressed.  We started","useful":3,"cool":1},"WKdqwUNUag1w37xxBDsqQg":{"text":"Have never been there sober, or able to eat all my food.  That said, I'm pretty sure it's ","useful":0,"cool":0},"oEZa1fTYy6stLKh04RdikA":{"text":"Oh where to start? \n\nI caught the tofu tacos. They are completely delish. The house Margar","useful":4,"cool":2},"QU3iUpDKJJju8m-ww-_PcA":{"text":"My fav place for Mexican. The cheese dip and guacamole are fantastic. There's nothing I ha","useful":0,"cool":0},"O6rhu4MPAKcZYmq93vsjtA":{"text":"Juan's flying burrito presents a delicious twist on Mexican fare with excellent portion si","useful":0,"cool":0},"1UWNnj3Kzt-4C-nBW7MIuA":{"text":"Pretty good.  After waiting for the bus for what felt like freaking forever, we ran to the","useful":0,"cool":0},"5jJ517HAC4i-F9MikYbxWg":{"text":"One of the better Mexican inspired restaurants in the city. The portions were very big and","useful":2,"cool":2},"1pwiLydTGTHMQBjznHUS5w":{"text":"Best.Tacos.Ever.   Every time I come in town, Juan's is my first stop on the way in from t","useful":0,"cool":0},"b-iP-mlZ2XVfZDDxmBB92A":{"text":"As a California resident , I can confidently say Juan's is one of the best Mexican restaur","useful":3,"cool":2},"wbBn1GdmFIyxMLF8xZi6_g":{"text":"This is a fun place to eat. I've had both eat in and take out, and both times the service ","useful":0,"cool":0},"OYHUZFyRj55f4iZnVIeE0Q":{"text":"Oh, Juan's. Your salsa and guac are fresh and light, your enchiladas with rice and beans a","useful":1,"cool":1},"IVeyQVWJ63tTd4UJuQWigw":{"text":"I just happened to be near here when I got hungry. I ended up getting \"The Flying Burrito\"","useful":0,"cool":0},"qzDWBqN5X-PNGvB64rN_6g":{"text":"Fresh food, great and friendly service, vegan and vegetarian options. Would highly recomme","useful":0,"cool":0},"BHHTFT2m4_rIIs9dQ5XXUA":{"text":"You know a place is good when you go there two days in a row. Huge burritos, solid fish ta","useful":0,"cool":0},"vGFDo1thFhBJhpDiMgvgjA":{"text":"The greatest burrito I've ever had was the \"Juan's flying burrito w/ green chili\". Outdoor","useful":0,"cool":0},"q3-VkIr0_LxgWukyUMoMcA":{"text":"We started with chips, salsa, and guac, wife had chicken quesadillas, and I had tacos.\nMy ","useful":0,"cool":0},"ZP9yaQmC5_uGWngfv2U65g":{"text":"Not bad for tex-mex cuisine at cheap prices and of course LARGE portions.  I came here a f","useful":2,"cool":1},"nCZIDhrifDEgwbMwpfZYXQ":{"text":"We decided to stop by randomly. Unlike most places in New Orleans we were seated immediate","useful":0,"cool":0},"Ts4JPqTH9raj1qBabchXYQ":{"text":"The Kamehameha Nachos are fabulous and filling.  I was a little worried about what New Orl","useful":0,"cool":0},"0wSaivO7qm6ZexBFmsBw9g":{"text":"The juans next to Whole Foods needs to do a better  job at hiring good waiters . The waite","useful":0,"cool":0},"XCwyGPcV6ysgBx0sgQlTqA":{"text":"It's rare that a San Diego boy stumbles across decent Mexican food outside the 619, so whe","useful":4,"cool":2},"_Tkxe23jXOI-pcnUjXAWSA":{"text":"We had the jerk nachos, which was delicious. it was layered with jerk chicken, guacamole, ","useful":1,"cool":1},"QbDjKq83Qtb1JQznPwnFdw":{"text":"Burritos are really good, but thats the only thing I would order besides tacos. Fajitas we","useful":0,"cool":0},"IH4VrWnkVRlOpW9DDoqHRQ":{"text":"Update: Wanted to correct the address to the one on Magazine...and Happy Hour at Juan's st","useful":2,"cool":1},"gUIJeKj1FuAP7A0FuDIp6A":{"text":"I obviously do not get it about this place because I think it is sub par.  I have eaten he","useful":1,"cool":0},"58TN1GVulklzHwHCKNnA7w":{"text":"I came here when I first visited NOLA, prior to moving here for grad school, and while I s","useful":0,"cool":0},"idZ3XmKbchkZzgdy4HjSgg":{"text":"I loved Juan's on Carrollton, so when I was in Uptown and hungry I convinced my friends th","useful":1,"cool":1},"R-uvnEl-Tmnv7eH2mpEh1g":{"text":"Great food but hit and miss service. The pork and slaw tacos are my favourite on the menu.","useful":0,"cool":0},"bV4rFAM8BSIMy_bl5wzn-g":{"text":"Juan's is the great spot with all the right amount of Portland / Williamsburg / Richmond /","useful":0,"cool":1},"23Wk_b36nhIiNeNVvIEo7w":{"text":"The only reason I'm not giving 5 stars is that you have to pay for chips and salsa. New Or","useful":0,"cool":0},"D9E3falmeIzLmsO3Z8uhvg":{"text":"We started our meal with crawfish queso and chips. Heavenly! My husband had the Luau quesa","useful":0,"cool":0},"D5kJDRySqPoUrVJRzaT-Qg":{"text":"I actually like this location better than the one on Carrollton, because the location on C","useful":0,"cool":0},"IBnui_Or0bmutwULJTL94A":{"text":"So being a picky vegetarian, I'm always looking for restaurants that have good protein opt","useful":0,"cool":0},"4TcgiCKdBYPFEEOzNvx56A":{"text":"Excellent Mexican food with fun vibe. Strong house margarita and great shrimp burrito. Sta","useful":0,"cool":0},"lWwM7qFAKpzY9M8lBjVUKQ":{"text":"\"Don't they have aluminum foil where you come from?\"\n\nThe aluminum foil here is seriously ","useful":2,"cool":2},"y7aPhfBvvsStGwQxx10ang":{"text":"Here's what we got:\n\nBacon Azul (3 big quesadilla triangles) - DELCIOUS & mouthwatering \n\n","useful":1,"cool":0},"YY9gbneHMH6jMRYuyuBp4g":{"text":"I may be biased because I'm from Texas where we have the best Mexican food and margaritas.","useful":0,"cool":0},"hTRmpioTAoe0Ceftjw79Tw":{"text":"First time to New Orleans were told by one of the local we need to try Juan's flying burri","useful":0,"cool":0},"aKNWmRTv1XIpduXT4jQf_A":{"text":"I've eaten here for the past few years about once every other week. Always a pleasant expe","useful":1,"cool":1},"ai-_sJDaWqXYccFEBosrpw":{"text":"Always an amazing experience!! Great staff, excellent margaritas, and delicious food...THE","useful":0,"cool":0},"jp-sF8jeC934wkEWwt4xxQ":{"text":"Chipotle without the chain feel.\n\nAbsolutely overweight, overstuffed, obese, whatever. Thi","useful":0,"cool":0},"gTh3DwYR5GdbhyoLxP7Bpw":{"text":"Brilliant.  Get the quesadillas and bacon.  LOVED IT\n\nI'm originally a northeastern er who","useful":0,"cool":0},"OxXqupugTCQLnkd4mUqsfg":{"text":"okay if you want real mexican food - this is probably not the place to go. also i think i ","useful":0,"cool":0},"ljQWdsQz9Mx0FZ9GyVHHEA":{"text":"The food is good but inconsistent. When it's good it's great. Unfortunately today the Mard","useful":0,"cool":0},"DLfS-ismoYoDovdOLD31qg":{"text":"Great spot. Had the chips and queso as an app. My wife had Juan's tacos and I had the Loui","useful":0,"cool":0},"LJpC2V0bbo0cwx1Rs3bgaA":{"text":"One of the first spots and New Orleans where there were tons of vegetarian options! Yay...","useful":1,"cool":0},"B8hoLaH7PSxirGipDfJVnA":{"text":"The service was great and the atmospherre was fun. We had the tacos and enchiladas with ri","useful":0,"cool":0},"RX1jxdvfusBq9QJeCUlVuA":{"text":"Got an Al Pastor Burrito to go based on the recommendation of my server. It was very tende","useful":0,"cool":0},"Eqa4v_Ti9v01zYXkX9ZOpA":{"text":"Oh man, the food is amazing! I got the jerk shrimp salad and it is so good! Service is fas","useful":0,"cool":0},"GCj67nZ245-jv3qjpcnv3w":{"text":"Ordered the Luau Quesadilla which had gulf shrimp, bacon, and pineapple salsa. The flavors","useful":0,"cool":0},"qqgnRN1eDVG6atNvo6DChw":{"text":"Let's get down to it.\n\nJuan's is one of the best in the city. Easily the best mex you are ","useful":0,"cool":0},"Y1LVyWp5dWMv08WpCiF0hQ":{"text":"Nom nom nommmm. Prepare yourself for a 20 min wait, but this can easily be accompanied by ","useful":0,"cool":0},"R7xqQsiJ23fMEPBQ1AJKZg":{"text":"Best food ever!! Unlimited queso refills can't get any better!! And the house rox margarit","useful":0,"cool":0},"f2s4v8d8ZAPo8pBot-3uAQ":{"text":"The tacos and the nachos! So much good food, come with friends and share all the things!","useful":0,"cool":0},"zUod28-Pt9GM2DqtJBkBrw":{"text":"This was the best Burrito I ever ate. \nI had the \"Gutter Punk Burrito\" and it was awesome.","useful":0,"cool":0},"NAL4mGTqVjj5QzDq0rcwzQ":{"text":"in 2005 i lived a few blocks from juan's. we (the woman who inexplicably loves me and her ","useful":1,"cool":1},"YUOi3c4cJcCM6DIbgp6yEQ":{"text":"Have been to Juans more times that I can count because the food and drinks can be counted ","useful":0,"cool":0},"rrYNDGk_D0UYYVN2M4WBSg":{"text":"Best. taco. ever.\n\nBest. Popsicle. Ever.\n\nMagazine street is cool as hell and this eatery ","useful":0,"cool":0},"fMb0ACdpOFY-vlwfs7Y2jg":{"text":"Love the burritos and cucumber margaritas. Food comes out fast and furious so if your on a","useful":0,"cool":0},"j4HDUYNh5kT7Z-05g-257w":{"text":"Juan's is by far one of my favorite inexpensive places to eat in New Orleans. I've brought","useful":0,"cool":1},"8LNijRk3PdSCu0qfuZjrgQ":{"text":"Really good food, chill vibe. Great prices.\n\nWe shared the Jerk Chicken Nachos to start. T","useful":0,"cool":0},"8e7APCGM4WFYuxybPoVYgw":{"text":"My parents brought me a kids bean and cheese burrito from this restaurant one afternoon wh","useful":4,"cool":4},"rhqC7tnNghteLYPm-ht8yg":{"text":"Really great drinks on the Happy Hour Menu. There's a double Margarita for $6 bucks and it","useful":3,"cool":0},"zO7srZdmLPv4ZaDkhW9-Tg":{"text":"Delicious! We started with crawfish queso which was a perfect way to try crawfish for the ","useful":0,"cool":0},"n7S_trGvlcLiwq5KtF3xmw":{"text":"The food was amazing me and my wife really enjoyed the food and it's very affordable. I gi","useful":0,"cool":0},"QD5MsRJLyAWprKpqrkqPKA":{"text":"Love this place. Great all around for meat eaters as well as vegans; creative twist on a c","useful":0,"cool":0},"IXhJuEeVAL9rK1YI3-VIng":{"text":"It was the donkey that drew me in.  Adorable!\n\nI'm the sort of person who buys things base","useful":4,"cool":2},"gEzytFgvVTUARFOkvPWphw":{"text":"Decent mex food, long wait, good drinks, bad service. Take your pick from the above. Also ","useful":0,"cool":0},"PCEWD853W88cwevb40msiw":{"text":"Props for the cheap-a$$ prices on food and drinks. Props for the tasty margaritas, chips a","useful":8,"cool":9},"A2W21ekVvGA09zQp1JUhbQ":{"text":"Good food.\nFun mash-up of central american fare and new orleans classics. Some original id","useful":0,"cool":0},"Z1aK8DB80E9dJg7zlcWK3w":{"text":"Update: they have really done a good job about telling me what has cilantro and so far I h","useful":0,"cool":0},"V9vdVLUMKUyddsn93vhrOQ":{"text":"I think Juan's gets a lot of unnecessary flack. It is what it is. I hate that saying but i","useful":4,"cool":1},"GwFGD3nr2Xv0-FaeGysthQ":{"text":"I'm still on the search for the best Mexican food in New Orleans.  Unfortunately, I did no","useful":0,"cool":0},"Dm6DDqXfNMqF-0GswW7XLg":{"text":"Love it! I havent been disappointed at either the Magazine location or the Carrollton site","useful":1,"cool":0},"CK8rx1RhPKQcTUPGi2i2Xw":{"text":"Nice chilled spot to eat, drink, and relax. Food is great esp the nachos. The prices is no","useful":0,"cool":0},"NLC2L6PPNaEvGRIMHZLHFg":{"text":"A Taco Tuesday tradition, Mardi Gras Indian tacos are a win. Delicious veggie tacos with p","useful":7,"cool":4},"XsUOhhXRXlFrhtqI_ngw9A":{"text":"This is one of our favorite places to eat. My husband (then boyfriend) and I used to walk ","useful":1,"cool":0},"3m8iWkZk5UrEOOG9v9VRtA":{"text":"Definitely recommend the frozen berry lemon margarita, it was delicious and just the right","useful":1,"cool":0},"OyHycIAwBPtA_WwE-Li7kw":{"text":"I cannot believe I've been coming here almost weekly (ok, honestly, many times twice a wee","useful":3,"cool":1},"HCf0NlbdB2oTE6gG4FoV1A":{"text":"I know a few of my friends in town are fans but I am not at all. \n\nA group of us went in a","useful":1,"cool":0},"4wpF4IWDr3pxbub2K5-mrw":{"text":"I searched Hipster New Orleans in google and came up with \"Hipster's Guide to New Orleans\"","useful":0,"cool":0},"tgHOXrDkljcllOWOWgMHzA":{"text":"We LOVED Juan's Flying Burrito while we were in New Orleans! The staff was friendly and th","useful":0,"cool":0},"5Oatzjx-I6HLuMlsrSx6rQ":{"text":"Awesome place! This place was recommended to us by the staff at our hostel and we loved it","useful":1,"cool":0},"0lUKgW-ocRho885JXl4-8g":{"text":"Cucumber Margarita....it's great. The burritos are awesome. Good option for a veghead like","useful":0,"cool":0},"7OtTk_Q73x6D8WU-ulwiFw":{"text":"Love Juan's!  Was the first place I ate in New Orleans when I moved here.  Is it Mexican f","useful":0,"cool":0},"CXM1johA8kQl1hwV_f_CCg":{"text":"Nothing like great comfort food after a lousy day. The burritos are stuffed with quality i","useful":0,"cool":0},"kNo0QZdmW5JmNN2AvMIWrA":{"text":"Had the fish tacos and asked for corn tortillas! It was fresh and flavorful! Service fanta","useful":0,"cool":0},"Cbu0Gsp-RQFg9YeL0paVEg":{"text":"My friends (who are from LA, MS, and AL) swear the burritos here are life changing.  While","useful":1,"cool":2},"BVMmazresUSh2Vn2qh6AKA":{"text":"A couple frozen margaritas with patron may have biased the experience a little, but I have","useful":0,"cool":0},"J0NOGDukzDJQj_pq_X6Ofw":{"text":"Awesome place! Must have the crawfish queso,when crawfish is in season. Also try any\nEntre","useful":0,"cool":0},"2eNPIzPlqdukQhGJenXSfQ":{"text":"No frills Tex-Mex with a New Orleans touch located in the LGD.  They have multiple margari","useful":3,"cool":1},"J12MFbPuCsXTuNFhwweIyw":{"text":"Service here is one of the worst I have experienced in my life. They simply don't care abo","useful":1,"cool":0},"uxrVkjYOJ0NIFLvEx-0R7A":{"text":"Went for lunch and took advantage of their all day Sunday happy hour. The shrimp nachos we","useful":0,"cool":0},"8BzRnKtrDoRHllgn9FBqvw":{"text":"I only go to this place to indulge my significant other, who loves it. After tonight, no m","useful":2,"cool":1},"_YCWyMr94hcC5vg3njRDWw":{"text":"While our meal was the least memorable of any during our extended stay in New Orleans it w","useful":1,"cool":0},"OzSV6JQxeyNx7oxGOOrVFA":{"text":"I adore Juan's! I have been going there the past 8 years and can't recall a time I was eve","useful":0,"cool":0},"zN22x1Ewj3UZjAuJBV-VOA":{"text":"Juan's can fly that food into my mouth anytime!!!!\nThe bad ass bacon bean dip started this","useful":0,"cool":0},"STtXO0oQKpKtGoRzrqS_cA":{"text":"Best burrito in New Orleans. Great neighborhood, quick service, and the portions are huge.","useful":0,"cool":0},"wnkbgnZbu8SYZoMAGk59wA":{"text":"Delicious shrimp burrito and tasty Hard Shine Lemonade!","useful":0,"cool":0},"GPl2gDFE7jbMEXVPBxl5ew":{"text":"Best burrito I've ever eaten in my life. I got the one named after the establishment and i","useful":1,"cool":0},"KMdV1EtrdYX1sXprspcofg":{"text":"Excellent Mexican restaurant. Food is excellent. Service is excellent. Be prepared to wait","useful":0,"cool":0},"ynArfZgHsJ61lK0fyPWh2Q":{"text":"I always recommend Juan's to visiting friends, describing it as \"New Orleans-style Mexican","useful":0,"cool":0},"jKroWXMHbo2GKMaI9McEDQ":{"text":"Veggie burritos!  Needing a quick lunch to-go, we had fate on our side when we walked past","useful":8,"cool":7},"wM1TsfzRORhuHW1jpbA_hg":{"text":"Frozen sangria? Are you kidding me?\n\nI've never had attitude problems with any of the staf","useful":0,"cool":0},"Mfwe8EWgzChlMUc251I8eA":{"text":"Totally looooove this place.....kool lunch spot","useful":0,"cool":0},"_hWWNzFg3KlVdP5Xemk85g":{"text":"Let me just say.... You won't be light enough to fly away after eating a burrito here. The","useful":0,"cool":0},"pOLVOVaNGleUveHtY6V9uw":{"text":"I used to work 3 doors down from this place and pretty much ate lunch there everyday. I wa","useful":0,"cool":0},"PgGoqADu_pnW5sRPWoS9eg":{"text":"Um... Yea Juan's is the sh*t!!! I ate there yesterday for the millions time and once again","useful":1,"cool":1},"16zTkz2-Y7yLQjFna6k5CA":{"text":"I've been here about 3 or 4 times and I've liked everything that I've had everytime. I rea","useful":2,"cool":1},"L_2BSdjSCNbC0-zxK8Shqg":{"text":"Very, very good innovation on the traditional burrito Tex-Mex formula.\n\nVisited this resta","useful":1,"cool":0},"GRjNX20_BKtOsYsHAW6eWw":{"text":"Not a bad place to grab a quick/cheap bite to eat, but nothing special either.  The waitst","useful":0,"cool":0},"iDGPHkoTQslUv1wi1G28lw":{"text":"Queso and chips were good, had a little jalapeño taste to them. Lots more chips than dip. ","useful":0,"cool":0},"0axqvXrecAfdlkzGsVdSTw":{"text":"Being a Mexican-American from Los Angeles on a vacation with my wife in New Orleans, I did","useful":0,"cool":0},"A2DP-Seuuktty4tpro8M5w":{"text":"Went here for dinner. They were very fast, although the place was packed. The service was ","useful":1,"cool":1},"oRBA4Feo1YW3-Qjcp6DU0A":{"text":"Food is great but service is very slow. Our drinks sat empty for a good 15 minutes before ","useful":0,"cool":0},"hM2QhZFAUUWybSeYAYxM7w":{"text":"Stumbled upon this place after getting tatted up over at idle hands. \n\nWe were looking for","useful":0,"cool":0},"PkTsU5yDcdLUtLNTLfycGg":{"text":"Ordered The Luau quesadilla, which was delicious and affordable. Great, friendly service a","useful":0,"cool":0},"MUjCuySt5VDcA3QFw7SDjw":{"text":"Drop the mic good! do your tastebuds a favor and go visit.","useful":0,"cool":0},"zR64dGt4b0v1cp8EAM8Khg":{"text":"The burrito is short and fat, like my uncle Tito. hehe  They use a humongous tortilla and ","useful":0,"cool":1},"bn3DECw2m2A9IyZJDPWpTA":{"text":"On a 5-day trip filled with absolutely stunning food, this stood out as perhaps the most s","useful":0,"cool":0},"h50Z9w3UWRA3wLlzYfZLoQ":{"text":"It's Friday night in New Orleans. Where am I headed ? Juan's! \nI always end my work week w","useful":0,"cool":0},"5GNbMPTKvKXLF2JJPKp_Wg":{"text":"I  LOVE JUANS! i normally go for the dip sampler for bigger groups and finish that up befo","useful":0,"cool":0},"yI2Thvh9f34VGRUAtksc1g":{"text":"The atmosphere is fun and the food is very tasty. The margaritas are also worth a try! It'","useful":0,"cool":0},"3RreInfn5ev0qAnnGQmmXw":{"text":"I haven't been to New Orleans in 6 years, but distinctly remember having the best veggie b","useful":1,"cool":1},"1MiMuEwuRwEWJbSxhQywnA":{"text":"Wow!  Went there on our first night in NOLA and will definitely be going back again...and ","useful":0,"cool":0},"tHZJc_wLMCGMS1KKSBGDJg":{"text":"I went for 11:15 AM early lunch. My order was the \"Gutter Punk\" burrito, which was huge an","useful":0,"cool":0},"MD2KiucJPreWrCfIwlTXHQ":{"text":"Flying Burrito was the bomb! Great punk music, cool staff and patrons!! The uuuuubes!","useful":0,"cool":0},"OMNXfz6mBjySwVwQcZa0OA":{"text":"Loved this place. We started with the trio app: guacamole, queso, and salsa with chips. Al","useful":0,"cool":0},"bQpyw9BCAmCgJw1YzVAPgQ":{"text":"Michelle was RIGHT on!!!!!\n\nI volunteered with a non-profit based on Magazine, knew people","useful":0,"cool":0},"4xPrDaN-bBxrq-K6G7UXeg":{"text":"It's definitely a good little Mexican restaurant. The food is pretty good but nothing mind","useful":0,"cool":0},"KWV-nzymxAUssU7sh9aSTA":{"text":"Loved this place.  The Dollar PBRs during happy hour were perfect.  I had the black and go","useful":0,"cool":0},"vNDwAvmR-MU5jWlUeqUYZA":{"text":"My friend was craving Mexican food after just moving from Los Angeles to New Orleans and s","useful":1,"cool":1},"NF2-uYXcyv7lK6oewZAJvQ":{"text":"Decided to drop by here and order for takeout since I usually see the \nhouse packed like a","useful":1,"cool":0},"hZDvij9AaVNp_QWNq3-guA":{"text":"I am not sure that one can really refer to Juan's Flying Burrito as a Mexican restaurant, ","useful":0,"cool":0},"Zp53yvogU8zKXQdCESXrrQ":{"text":"The Cucumber Margarita ($6) is delicious, the Chips & Salsa ($2.95) is good, and the so-ca","useful":1,"cool":1},"sLWkthf-vxSu1xN-KdzZjQ":{"text":"Where to start? Let me say that what I had to eat, shredded pork enchiladas, was tasty and","useful":0,"cool":0},"hdKjBR30jGhQHiv-9n3V9g":{"text":"Quesadillas and guac here were the perfect recovery meal. The salsa is delish. Good for pu","useful":0,"cool":0},"3juv_39E1toVl2pHu_kEkQ":{"text":"Food was ehhhh...although I wasn't expecting authentic Mexican food in New Orleans, it was","useful":1,"cool":1},"hah44mjBVXszGfYC0g0HzQ":{"text":"Seriously! BEST BURRITO! The flying burrito has been a staple of mine since I first came h","useful":0,"cool":0},"AUKvZTkUTm5yt1Z-rdWjHA":{"text":"Oh, so close to a 4 star review!  Food was fantastic, though the service was a little slow","useful":1,"cool":0},"ZhiiNC9XDOgx11RptH9XXQ":{"text":"I usually dine at the MidCity location but after dining here twice in as many as five days","useful":5,"cool":0},"Alo3AwR_n_i1B7fo2q3fLg":{"text":"This is the best Mexican food I've ever had... and I've been to Mexico.yelp won't let me p","useful":0,"cool":0},"49zkUxrQTtI9NoC3mhUs1w":{"text":"This was our first food stop when visiting Nola. Great vegetarian options. Highly recommen","useful":0,"cool":0},"pWtsOHAwNjvRvR6TSq4EdA":{"text":"I did not like my lemonade, it was sweet & sour mix with some fresh lemon eeew! I only tho","useful":1,"cool":0},"DwvAPCjE8XKkNJZ-HAukCg":{"text":"I wanted Soooo badly to love this place, just due to the shear facts that 1: it proudly of","useful":0,"cool":0},"Dm10O6F55C49TcaEnmTiww":{"text":"This eatery was a great choice for food when passing through the area (Uptown / Lower Gard","useful":0,"cool":0},"SOf3dmnxLq024DW5IN5rfg":{"text":"This review has to do with their burritos: unfortunately, the filling is a stew consistenc","useful":2,"cool":1},"WVhkcVEXR9UOqxWwCls-Yg":{"text":"I am like...89% sure everyone who waits tables here is stoned most of the time. And really","useful":7,"cool":4},"GVmGRxe70qAUK86h1bg07Q":{"text":"God I miss this place. I think my husband and I ate here at least once a week during colle","useful":0,"cool":0},"Qj0BSi-Kw-IJ12WdKZPrmw":{"text":"If Mexican food is your comfort food, this is your place. I've been here a few times, and ","useful":1,"cool":0},"Y0BDQwYJdKWskIy1iaurTA":{"text":"I haven't written a review for this place yet? Oops!\n\nWhat can I say about Juan's? It's ch","useful":0,"cool":0},"T19YwE_kOAjx1Ja_AQfGgA":{"text":"Oh Juan's...how I miss thee.  I had the great fortune of discovering Juan's on a recent tr","useful":1,"cool":1},"0hsYvKzMbb_bcUw5jLvZcA":{"text":"Very good menu, including the \"Supergreen\" burrito that can easily be made vegan. Service ","useful":0,"cool":0},"jg7tX7q6suAJUf17NzLhEw":{"text":"Hmm. I got Juan's steak tacos. The meat was odd. It tasted like something from a stew- not","useful":0,"cool":0},"bdgekluKcf6E9XSezFIJKw":{"text":"Great place if you're visiting NOLA. Close to tour the Garden district. Great food and dri","useful":0,"cool":0},"E5ctspgbu-gDvTtIuTGffw":{"text":"I wouldn't say I'm a huge Mexican fan, but that's usually in terms of the cheap chain Mexi","useful":0,"cool":0},"oLlpjiVS5YUX7-sb43Vy3w":{"text":"Excellent! Some of the best Mexican food we've found in LA.  Never had a bad meal.  Fantas","useful":0,"cool":0},"m_lsxwlhbsz2OybdCt8HJQ":{"text":"Love Juan's.  Great spot.  Goto Magazine IMHO because the Mid city one is hard to get in s","useful":0,"cool":0},"O92gQ0lRsynOjcrpodti9A":{"text":"I won't be coming back to this restaurant. Nothing bad (this is why I give them 3 starts) ","useful":0,"cool":0},"Jezskja6hp6_lTwZY6_PmA":{"text":"We all really liked the food, delicious, fresh and well prepared. Seriously yummy. \nOnly t","useful":2,"cool":0},"NSTRiqM0uGdS3neIaI8qrg":{"text":"During a recent weekend trip to NOLA we decided to forgo the tourist traps and explore the","useful":0,"cool":0},"tUxs0QeWStocaELxhTZJDQ":{"text":"Delicious food!!!! Very unique dishes and reasonable prices. The burritos are huge, tacos ","useful":0,"cool":0},"EGHImVgrmIgvw-R9i1lFVQ":{"text":"I live fairly close to their magazine street location and have eaten here often. Usually s","useful":0,"cool":0},"_HjGlPlkw5FKB5DnmL6OHQ":{"text":"I've been meaning to write a review for quite some time and it was probably going to be 4 ","useful":2,"cool":2},"8qmXfSsgfQ9alA4wEFMm5w":{"text":"I harbor a soft spot for Juan's on Magazine :)\n\nMy first visit way back in 2008 with my Am","useful":1,"cool":1},"9_0r-LuzYSscr8WTVcYG5g":{"text":"Oh juan's... how you have served me well.  Very very well.  I love your rock edge and you ","useful":0,"cool":0},"-uAZ085cyDe110RI8xvNTQ":{"text":"Like a lot of cool, popular restaurants or bars in NOLA, Juan's doesnt have to have amazin","useful":0,"cool":0},"DaKzl2VMZkjpkKLEh8jooQ":{"text":"this is one of my favorite lunch spots!  i love the veggie punk burrito and the mardi gras","useful":0,"cool":0},"NwaZtob_1ub2kwJow0a6Bw":{"text":"My boyfriend and I are in love with Juans! Whenever we are down near magazine street we al","useful":0,"cool":0},"uObmJfEURV8gq9kEK29TdQ":{"text":"Went in on a Saturday around 1, the place was pretty packed. However, the wait for two was","useful":0,"cool":0},"4WoM-ReZcHOi0ZZMIcHGfg":{"text":"A fun little option! Inexpensive food, some fun drink specials, and all of the food is tas","useful":0,"cool":0},"rtcZFk5fISZiSktjTaWMKw":{"text":"Absolutely amazing food, served quickly and not felted rushed. The house quesadilla was th","useful":0,"cool":1},"PyyeoxzeOEznjpCxOv2ccQ":{"text":"Great service, awesome margaritas and amazing Tex/Mex! I loved my Jerk Chicken Burrito.","useful":0,"cool":0},"5T8B27zKpCfELxFaO1iykQ":{"text":"good food. large amounts... great drink specials... fast service :)","useful":0,"cool":1},"3iZy1NawMIaqLZjSYr_9hg":{"text":"Good was mediocre at best.  Service was slow.  Salsa was good but we were unimpressed with","useful":0,"cool":0},"g4qx4tvZsdhoksUD85lVvg":{"text":"Everything about this place was excellent. Nice charming old New Orleans seating but every","useful":1,"cool":0},"MVmHBthNXAMUBmesNrQFfg":{"text":"Service is fast but food is average at best.  Juans flying burrito was pretty bland.  I fi","useful":0,"cool":0},"gDYhnsLGtbRUBfcTNx0f-A":{"text":"ME:\nWhat's the problem?\n\nFRIEND:\nI lost my ID..\n\nME:\nWell, then, I'll buy a margarita to-g","useful":0,"cool":0},"k0u6wdKKayiueXh4F_SurQ":{"text":"Wandered in after shopping... This place is outstanding. Yummy drinks, tacos, guacamole an","useful":0,"cool":0},"p6-m9IQxpl--WT7kTjoGdA":{"text":"After joining yelp I had so many options for lunch but I couldn't help stick to Juan's for","useful":0,"cool":0},"FqYgYssdJbMNlxQSUajmVA":{"text":"We met a friend who lives in New Orleans on our recent trip, and she suggested that we mee","useful":0,"cool":0},"NVxqVS3AtaFrkihrmAxx-A":{"text":"I have had my most unpleasant 'mexican inspired' food i have had in NOLA. I have visited a","useful":0,"cool":0},"SCZCjrtwlYp4p20hlQrlTw":{"text":"Great service, über accommodating staff and the food always, always hits the spot. The fly","useful":0,"cool":0},"gJsS8kUVny0sAp-Jc1oMuA":{"text":"First visit to Juan's. Ordered the Juaha Roll and it was delicious. The bar drinks did not","useful":0,"cool":0},"ahc4A-sbPL_msmSdhthHSA":{"text":"Hey Sarah it does not claim to be Mexican look at the menu it states creole taqueria.","useful":0,"cool":0},"9kygABxK4_Y5JZO2nkKX9Q":{"text":"My husband and I eat at Juan's flying burrito every time we visit New Orleans. They have s","useful":0,"cool":0},"wxtyANfvTLjC26Kn3zOSuw":{"text":"Only came for drinks - full bar small bar - but great drinks - I did taste the guacamole a","useful":0,"cool":0},"7-z6X03f_EB7owk31yHFnQ":{"text":"WOW! My husband and i have been eating more vegetarian lately and stopped in after other p","useful":0,"cool":0},"KiaSnuWWjGqRBEUbSiOLIw":{"text":"What better type of food to eat your first night in New Orleans than Mexican. Can't help i","useful":0,"cool":0},"k2lClY8d4HSBjje10ktkXA":{"text":"I had a great experience last time I was here. Our waitress was super nice and helpful, an","useful":2,"cool":2},"iOIKtjruOA3U9BvEpP_rNw":{"text":"Wow!! Excellent burritos and I'm from CA. Super fresh tortillas made it 5 stars. We got th","useful":0,"cool":0},"V3pw-2kX9v68tMP0iWxRwQ":{"text":"Sometimes Juan's will get on my nerves, but that is because I go here so much (the one on ","useful":0,"cool":0},"pyOEE5UQORZCmVwpgagGXA":{"text":"Steak shrimp chicken burrito was freaking awesome. Each by them self were great but combin","useful":1,"cool":0},"ho7Ui_iNe-m9Kr5ScuEs2w":{"text":"My first time going to Juan's, I order the name sake Burrito, it was not what i expected, ","useful":0,"cool":0},"bB6iM-t5KL1PF5vVz-BXKQ":{"text":"I had a lot of fun here. The service was quick and the nachos were gigantic. Great place t","useful":0,"cool":0},"27TnoHam3Uf2ihlJTeX5fg":{"text":"Had the black and gold burrito lunch special and added shrimp for a small fee of  $2.75.  ","useful":0,"cool":0},"WHjJodjECr6YoOR7nDZshg":{"text":"Long line for a Thursday dinner, but worth the wait.  Love their shrimp dishes and green h","useful":0,"cool":0},"rsqkmy6X25yiqJRzaPhVGA":{"text":"This review is a little late because I've been tied up with holidays.  One extremely slow ","useful":2,"cool":0},"TK--hS4u9pAwqHMFfHIYEg":{"text":"Stopped in on a hot humid day and was quickly seated. The decor is nice and relaxing with ","useful":0,"cool":0},"F8Llyq1tmPXTOf4DXVRitw":{"text":"Decent place with good food. The atmosphere was very much not authentic, with the restarau","useful":0,"cool":0},"QzGWBm_RzsjKgj1o8RJeJA":{"text":"The Jerk Chicken Burrito is awesome!!!!  Last time I was in NOLA I ordered 8 and brought h","useful":0,"cool":0},"cfopCvDGfjmknukVZOeBXg":{"text":"So... I've been going to Juan's at the various locations for years. Food is solid, price i","useful":1,"cool":0},"F3dDW_wM_IGJ6xk64ZplPg":{"text":"I had the flying burrito and, holy balls, that was amazing. As the family next to me got s","useful":0,"cool":0},"wwFm0iHhrpgfGluzf5odWA":{"text":"We ate here on a Saturday after a Scavenger Hunt Race. We were starving! We ordered the Gr","useful":0,"cool":0},"5Tf41AI4G3aXpG3X53QjHg":{"text":"The food was good. Not great, just good. And that is about where the happiness ends. \nThe ","useful":0,"cool":0},"iEBFmA_mlPHOqZC3o1u22g":{"text":"I was craving a good burrito while my boyfriend and I were visiting New Orleans. We read g","useful":0,"cool":0},"mHrF66XgSNq1r948lOk0BQ":{"text":"Happened upon this place on a recent trip to NOLA earlier this month.(Dec. 11th to be exac","useful":0,"cool":0},"zU10kZ54SUr8E5nC1Utebw":{"text":"Let me preface this with saying that i had heard about Juan's for years before actually co","useful":3,"cool":1},"w9ZvHM7yrSOIduQL7BSJwQ":{"text":"Magazine Street is a good bet for those looking to find good cheap food in New Orleans. Ju","useful":1,"cool":1},"8wXGYRWoEkYttaL2I61bbA":{"text":"I love coming here! I get the same thing EVERYTIME tho.. Hawaii 5-0-4 nachos and a double ","useful":0,"cool":0},"25OogIB3kEgvshlLhQVpxQ":{"text":"Our waiter Spencer was attentive and great with refills. Fair warning, the doubles on marg","useful":0,"cool":0},"1lfifPTmBrPWerRXlV0F5Q":{"text":"Went here with the boyfriend one night. I love the decor in here. I got the Al Pastor burr","useful":0,"cool":0},"07e7OIwldEP32cIdB-C9Kg":{"text":"Best Mexican food in New Orleans. Must have house rocks margaritas and dessert nachos as w","useful":1,"cool":1},"hr4CTeVWCbVuHZWVouFkFQ":{"text":"The food is good. The food is cheap.  The service is super fast and excellent.  But oh, my","useful":0,"cool":0},"oGYOhZ6--JsovjyoNMtkDg":{"text":"I don't love Mexican-inspired food, as it usually upsets my stomach, but Juan's Flying Bur","useful":0,"cool":0},"zQV73UpAUMGEdhWn2Drzjg":{"text":"oh boy was this California girl NERVOUS about eating Mexican in New Orleans... but all for","useful":4,"cool":4},"uWz16fapUsi0D-CLh7PHfA":{"text":"Incredible Mexican / Creole fusion. I'm from Tucson so I'm very very picky about Mexican f","useful":0,"cool":0},"Wt3o3oMsiGZx2Ff-H8Oizw":{"text":"We arrived at our hostel late one evening and Juan's was the only place that still served ","useful":1,"cool":0},"V3lfLs5vNjzSpTP636LOng":{"text":"I love Juan's.  Particularly this one.  The food is good, the drinks are good the atmosphe","useful":0,"cool":2},"aHg5MzxG-Erz394K91ZKsQ":{"text":"As a vegetarian on vacation, Juan's saved my life (okay, so that's a bit over the top..but","useful":0,"cool":0},"4cE1zZD96GqLtAbr9NLG6g":{"text":"Holy burrito! My husband and I went for dinner the other night and it was excellent!\n\nFirs","useful":1,"cool":0},"RNRC5-VxvQSPghRfWVPSvQ":{"text":"I absolutely love the food here but the service is terrible! Do not go to this one, go to ","useful":0,"cool":0},"EnFrgXoXYe2DeZ0POyVtxA":{"text":"First trip to New Orleans and wanted to check out all the communities. This cool and hip r","useful":0,"cool":0},"SzEmSOaQw9b4oY4x3e3Lcg":{"text":"This is a great local spot in the Mid-City section of NOLA. We ate here on our last night.","useful":0,"cool":0},"9i7ldGavI58IJ5ayAI77_A":{"text":"We tried this place a year back when we were on vacation in Louisiana, we liked this place","useful":0,"cool":0},"Ar_d_GjtI4jzVdXJJ8lY2Q":{"text":"The food was okay, but not worth the price. At one point it may have been four-five stars,","useful":0,"cool":0},"C9Tmw7R6LSidcwSOeXNpMA":{"text":"The wait was really long, but the food was overall fine. Not the greatest Mexican food I'v","useful":0,"cool":0},"tMmE4VQx3VGKUFoqLBBPqA":{"text":"We came to Juan's for a light meal, so we ordered chips and salsa, and split a Juan's Flyi","useful":0,"cool":0},"zM7_HMTS477CTSirPmohzg":{"text":"I really don't get it. There is absolutely nothing impressive about this place. I haven't ","useful":1,"cool":0},"17q-VqoSE7Vl-8ar7JBYrQ":{"text":"This is one of those places that is perfect for a quick, yummy dinner. \n\nOne of the favori","useful":0,"cool":0},"8diJdEZDiOyHrA2flV6lXQ":{"text":"My husband and I were visiting NOLA for vacation and saw this place and decided to stop fo","useful":0,"cool":0},"nnHum9I6NPW2D99w-k53_Q":{"text":"I liked the feel of this place, wait staff are super nice and friendly. The burritos are d","useful":0,"cool":0},"URtcwRzO6ZLlbsGRHhq1FA":{"text":"I go to Juan's once a week. Like clockwork. \"Oh you went running? Feeling like you might b","useful":2,"cool":3},"9rLqscKo-G6qQ2YGmKWLjw":{"text":"Great experience here!  Food was excellent.  I had a misunderstanding with my own (most li","useful":1,"cool":0},"Zq4x7VZXLmCCXvj5l9sjdg":{"text":"Oh Juan's, how much I love you, your funkiness and all. Juan's is my favorite place in the","useful":1,"cool":0},"8lGxJLuylQmpdph41NecDg":{"text":"Boring food, slow and loud panic inducing metal music. Waited 45 minutes for two bland bur","useful":0,"cool":0},"VBcIvkMvCYdgdhVDbVIHqA":{"text":"Good margaritas, good food, good prices, good service.\nPretty happy that I happened to mov","useful":0,"cool":0},"55hl7tormrIPJWHYX0HfyA":{"text":"My friend and I came here during her lunch break and the food was so good. We ordered chip","useful":1,"cool":1},"B12DgfLCSgUXHDZ1THs-Tw":{"text":"I am not sure if it's because we are from Texas or what, but we were less than impressed. ","useful":1,"cool":1},"0myqfq1SRavURIYWrZPhGw":{"text":"I have visited both Juan's locations and both visits were good dining experiences. The sta","useful":0,"cool":0},"DblaRTajOWE6eQh-7shahA":{"text":"Funky cool easy going great value or the price and wonderful attitude from the staff.  Cra","useful":0,"cool":1},"YD0116yNXZ62sA3N7C-fqA":{"text":"Amazing restaurant! The best Mexican food I have ever had! The queso is to die for, and th","useful":1,"cool":1},"0fmADM2O8AaWxe08El2GPA":{"text":"Absolutely love the food  I'd give this place 5 stars save for the drinks.  The margaritas","useful":0,"cool":0},"NOE7I_QJTsWS5gbzYRpL9Q":{"text":"I can't give a restaurant that I return to at least once a week less than four stars, but ","useful":2,"cool":0},"jjuQlTczj-dVlzijy3szJw":{"text":"Super solid Mexican option.  Good quesadillas, good frozen margaritas, good tacos!!  Not a","useful":0,"cool":0},"4p_5rns67zmwLWpU2TScZA":{"text":"I'm from TX and love mexican food... this was not very close. Not terrible, but I wanted m","useful":0,"cool":0},"ZC58On3BuHFxRQjJEpXdBg":{"text":"Wish I lived closer and I would frequent this spot more often.  The guacamole was fresh an","useful":0,"cool":0},"5PxbZMkRels8nSspZCkXoA":{"text":"First meal in NOLA since it was near my hostel. I virtually ate nothing but some fruit, so","useful":0,"cool":0},"Wypz9p_WTAdFjiSfgsKbiA":{"text":"I met my girlfriends here for some margaritas, chips, and smack-talking.  (I actually had ","useful":1,"cool":2},"rffo27-cm76R6wxDMs-oLw":{"text":"I can only give this location a 3.5 star rating due to the slow service we experienced thi","useful":0,"cool":0},"tgGuTUmjcuJOGTGpiTaeiA":{"text":"Best atmosphere, location and food. I just adore Juan's and I find myself going there more","useful":0,"cool":0},"P9Xd31q-HnCApAWvNOf-cQ":{"text":"Love this place.  Casual & inexpensive, not to mention the best mexican food I've had in N","useful":0,"cool":0},"gihCAtCRuQyHrNteBj-j7Q":{"text":"For any other vegan out there ... Juan's Veggie Punk Burrito, hold the cheese. The truth! ","useful":1,"cool":1},"IN2jaRWG7DH7C96ZIQ8_jw":{"text":"Traveled to NOLA for the Rock and Roll Half Marathon. Passed this restaurant several times","useful":0,"cool":0},"c0wd0VpTVzHOmKhtE9Jq-g":{"text":"Good eating for all. The kids menu is reasonable. Food was well worth it. Flying burrito i","useful":0,"cool":0},"eSWjNgOpO9KfdwFYV4QwUw":{"text":"Excellent burritos and quesadillas. A few outdoor seats (can't say anything about the indo","useful":0,"cool":0},"Wzk5N5Ds9WAYVw1sFBFEHg":{"text":"I know a lot of people really love this place, but I've had better burritos and better tex","useful":0,"cool":0},"utzj_VOzDv69VKA3XuJ9Sw":{"text":"I wish I had a bigger stomach so I could try more different menu items than one, but I can","useful":4,"cool":0},"ujJc6D3wB8kFqwk8ZvX3sA":{"text":"great cheap good food.   love your salsa and enchiladas....     a standard","useful":0,"cool":0},"Gez8ZOzewa91q_P5kO2arg":{"text":"A hole in the wall with good food!  The service wasn't stellar but we were taken care of, ","useful":0,"cool":0},"VwTzaZXtpmDCugNIoXSdVQ":{"text":"For lunch on Saturday my friend and I stopped in at the Flying Burrito.  We ordered some g","useful":3,"cool":2},"feMDUeFu0sfD6K-IictesQ":{"text":"Great name. Great service.Great drink specials. Great food. I've been coming here for 20+ ","useful":0,"cool":0},"U7xCkUCk4pvg69ZErICzGg":{"text":"We had a superb experience here twice in the last few days. A lunch and a dinner. The food","useful":0,"cool":0},"GuebbhIJOYOpSAbwmNryzg":{"text":"I frequent this location regularly and the staff is always great! I want to shed light on ","useful":0,"cool":0},"iRpvrI5-hXKMpL4VVT1erw":{"text":"Yummmmm Blackened Fish Tacos & Drinks (The \"Jackass\" is kickass!) Gotta go there to see wh","useful":0,"cool":0},"3pQW86otD_3RR14EYSUo5g":{"text":"The food was good the drinks were good. Tacos could have been better. Seating host wasn't ","useful":0,"cool":0},"08soYk15jFaTf7yYW7VQHQ":{"text":"For better or worse, I keep coming back to Juan's. Huge free refills on iced tea and lemon","useful":0,"cool":0},"riYUfoEWwFnRGx-AvnGHlg":{"text":"Best burrito joint in the South. Atmosphere is amazing food is priced very fairly yet you ","useful":0,"cool":0},"0dpuVy7w3CVuaM8NQVB1fA":{"text":"Delish \nHe got Super Nacho Grande.... perfection!\nI got Juanah Roll with Tofu!  Loved it!\n","useful":0,"cool":0},"Cq8C2ZNMeHF1_oKqFNwVMA":{"text":"I have been to Juan's (on Magazine) more times than I care to recall.  I love Mexican (and","useful":2,"cool":1},"2BskN2l9i-BkdGGsR7hThA":{"text":"This was my first time here but I heard a lot of great reviews so I decided to give them a","useful":0,"cool":0},"lk96-GDEtZ_nkIsNuzyH9w":{"text":"Great lunch.  Jerked nachos  and chicken juaha were incredible.  Margarita made it all the","useful":0,"cool":0},"hZB8NSIPjCOgVYlN3JhfYw":{"text":"Si!!!!! Fresh and yummy! A must-go-to place when I visit my hometown.","useful":0,"cool":0},"RGrmRlZGK7xw92CqrAZYSg":{"text":"We stopped in here for lunch while checking out the Garden  District. The waitress didn't ","useful":0,"cool":0},"tCcASq9QbqGWTzpyZRp5sw":{"text":"Props to Juan's for having vegan items on the menu!\n\nCame here on a vacation to NOLA, had ","useful":0,"cool":1},"GExEZlUhrB2kAg2n10wSsg":{"text":"Went twice in the three days I was in New Orleans. The jerk chicken burrito was great, as ","useful":0,"cool":0},"H-IC_Zyd8h4xj6TgqDGWgA":{"text":"You will not find more consistent excellence served on a plate for less than $13 anywhere.","useful":0,"cool":0},"XafSIugXZ0SY43HlDf5EXw":{"text":"hmmm i thought the burritos would taste like the ones from the bay! But it did not,queso i","useful":0,"cool":0},"hcxPVoWN8rF5455Xy2JUVA":{"text":"Great place for vegetarians!  Awesome hipster restaurant in the Garden District.  Deliciou","useful":0,"cool":0},"6nwICiIBD5EmiPtvnmWmNA":{"text":"I came in during happy hour. I got the nachos and it was a huge pile of awesomeness. Marga","useful":0,"cool":0},"ZVq2oyT1lEg5QOXC4WMiIw":{"text":"Awesome place for Mexican and drinks! Eat here atleast once a week for lunch. Try the gutt","useful":1,"cool":1},"WYe6ZNJmpYbAmbahYjJy5w":{"text":"I ordered their awesome Pork 'N Slaw.  It was GREAT!!! The atmosphere was perfect for our ","useful":1,"cool":0},"EbFgMPmWWqQwNjgvyj_CuA":{"text":"Juan's is a nice casual place to get some slightly above average Mexican food. I've been t","useful":0,"cool":0},"U3daIruoDs6zBDCfkMOwpQ":{"text":"I hold a pretty high standard for Mexican food, and this place was pretty good! The margar","useful":0,"cool":0},"25cb67tMXJ5Qlo7KfaILnA":{"text":"Stopped in for a quick drink and restroom stop. Place was cool but I ordered an $11.03 cuc","useful":0,"cool":1},"q-x2QEDoPb5Bogja9N_Oew":{"text":"Great Mexican food! Awesome service! \nMargaritas are too strong but, I guess that can't be","useful":0,"cool":0},"M18hNfwDC-tZChTMqoFSGA":{"text":"After a very long walk from the CBD, a filling and delicious burrito was just what we need","useful":0,"cool":0},"lac737gdCnsGw91edXnR1Q":{"text":"I'm currently pregnant and all I crave are burritos. With that being said I always get the","useful":1,"cool":0},"OGi8NhVY0SznbhlRSnrq3A":{"text":"Pretty good. Juan's enchiladas were good. Plenty of food. Kinda sloppy on the plate but go","useful":0,"cool":0},"VzD8siot161J-0RFypFPhg":{"text":"Bland city. The black beans have zero flavor. The margaritas are weak and kind of tasted l","useful":0,"cool":0},"GaE9qLe5F2ciCAjukZR1QQ":{"text":"First of all, the server was so immediately hostile I was really taken aback. We are trave","useful":0,"cool":0},"wVwE1i0Gjo4i7XV0N8mJig":{"text":"Second update and I'm restoring a star. Virtually no service issues in years, and the food","useful":0,"cool":0},"vG10md9O_O4xzsLgEJqw8g":{"text":"Oh how I love New Orleans. It's such a slow and sexy spot, with its weeping willows and ja","useful":0,"cool":0},"UlQShDzLIgj8TYOB78JQIg":{"text":"Okay, so I've had some good and bad experiences at Juan's. \nIf I always ordered out, I wou","useful":2,"cool":0},"wvWAiRpu1rGPaLmizo0MQg":{"text":"Worst. Food. Ever. Chicken Quesadillas were dry and tasteless. Avocado pieces were hard as","useful":0,"cool":0},"bIAzd5N49lrkyv3woo_kRg":{"text":"During my holiday break to my old stopping grounds in New Orleans, my girlfriend and I dec","useful":1,"cool":3},"VajYp7nOKYTcdUD7HvTscA":{"text":"This was my first time here but I heard a lot of great reviews so I decided to give them a","useful":0,"cool":0},"GKHB1iecVZiXlPQNiUQ53Q":{"text":"Juan's has turned into a routine Tuesday Happy Hour stop for me lately. They have pint-siz","useful":8,"cool":5},"geneiUY88t8Duy0dktt0Lw":{"text":"Whoa! This place is amazing! We came for a quick bite before the game and were blown away ","useful":0,"cool":0},"7WSyOqbq-riOkuJaBc-LnA":{"text":"Warning: if you think all people with tattoos are either felons or delinquents, this is no","useful":1,"cool":1},"QQiW3kTvzQt42z4zQKyF6Q":{"text":"I come from California which is practically the burrito capital of America.  Its pretty to","useful":0,"cool":0},"2MLop8kNmZrBfW20fMVg_g":{"text":"I really hesitate to do this, but I have to take one star off my review for a single reaso","useful":0,"cool":0},"Jm-IsY3KIGkh0z9Xo-vCHA":{"text":"I honestly have no clue how I have lived in New Orleans for so long and have yet to go to ","useful":0,"cool":0},"xfnGhbVZWCzUJ-yuIuwOGA":{"text":"I've been going to Juan's for a long time. I've lived in NOLA for almost ten years, been a","useful":1,"cool":0},"KSGlX7ED5gMNStkjgbpRAA":{"text":"This is by far my favorite spot when I visit New Orleans. Juan's takes Mexican good and re","useful":0,"cool":0},"Ec65UAt_f110p6oxbfaSPQ":{"text":"Yum! I love their shrimp quesadillas!!! Great service! Great atmosphere! Great food! Good ","useful":0,"cool":0},"JxY1daAb4hPpD2Kzg6a9WA":{"text":"Not sure how this place got 4stars I barely gave it three.  I don't pretend to be a Mexica","useful":0,"cool":0},"cNZY6QWYRpIcf9mElrZvhQ":{"text":"First off, I love Mexican-American food. With that being said, Juan's does an OK job of th","useful":0,"cool":0},"wjKBH9SLoMnMFarHrKDxGQ":{"text":"We were parked on their street looking at rugs at a rug sale and I looked up best restaura","useful":0,"cool":0},"1MrFsPpNuABGcFqSeFWO1g":{"text":"I used to LOVE Juan's pre-K.  Since...it's gotten a little more corporate (if you can say ","useful":2,"cool":2},"do-niIH9bSXq6nGJVe6ZqA":{"text":"Delicious! I have eaten here maybe 5 times but this is my first review.\n\nI ordered their I","useful":2,"cool":1},"fkHyXiVKMuvc_wn4IvLaAg":{"text":"We had a very filling and wonderful lunch here.   Nice server.   Efficient and the food wa","useful":0,"cool":0},"gMDz3yRLcZ6O0lX0w-Y4jw":{"text":"Guacamole made fresh daily it is not. Yellow and vinegary, it couldn't have been further f","useful":0,"cool":0},"GccIg9NQyMz_TX7pd7cQIw":{"text":"Oh man, this place is rockin'. If loving crawfish tails drowning in queso dip is wrong, I ","useful":1,"cool":0},"_ExVB3h2gfSzbVvfnuBjqg":{"text":"Love love love the blackened fish tacos - best I've had in the continental U.S.","useful":0,"cool":0},"8zXl7rkCt_wZ3zFfApOCeQ":{"text":"Juan's is my go to spot for Happy Hour! Casual atmosphere, best margaritas in town! The ba","useful":0,"cool":0},"ga5oNA2_Dnryr-nlySCt0g":{"text":"I go to Juan's every week. I'm addicted.\nI love the Green Goat with chicken, the huge ques","useful":1,"cool":0},"ulYvXU6MltHZ0aWIEl6_hQ":{"text":"Really good place to stop and grab a filling lunch. This was my first time exploring this ","useful":2,"cool":2},"nVlBd2XRuHOCEmeHgbQsWA":{"text":"Amazing stop for authentic Mexican food. It is a casual ambiance and do not need a reserva","useful":0,"cool":0},"PfFv2atOY-rUb0Imdx8Bug":{"text":"I throughly enjoyed the flying burrito and the queso with chorizo. Nice hipster burrito pl","useful":0,"cool":0},"oxF2DmUBcfmA4gzIbR5y0Q":{"text":"We went to two locations while we were in town, the LGD one we went to... maybe 3 times!! ","useful":0,"cool":1},"f4nE3UGUETzhq2Hy4l-HDw":{"text":"I was visiting New Orleans to see my friends and they suggested we visit Juan's Flying Bur","useful":0,"cool":0},"Ae3_SZsbkwE6A66WLvjpgQ":{"text":"Great place. The burritos and salsa are excellent, and the margaritas are very inexpensive","useful":1,"cool":0},"mKhZrd9DSe1rNa2IKhQkQg":{"text":"Everything I've tried here has always been spot on delicious. One of my fav's is the black","useful":0,"cool":0},"rmi1qM_NEUc0o8AkVjoZrg":{"text":"Great food,service,drinks, and customer experience will definitely be back for the steak f","useful":0,"cool":0},"07CrOt1ed8mgAaMcxYzl2Q":{"text":"I can't believe I haven't told you about Juan's yet, Yelp! Every year during Mardi Gras se","useful":0,"cool":0},"P_kuuQeNXz2WWiRs7eiZvw":{"text":"My girl was craving Mexican and there's only one place to go for me... Juan's!  Not only i","useful":0,"cool":0},"hBmqDqWnHvKcLz-9DJ-8fQ":{"text":"Late post...Came here with my sister when we were in town for the Mardi gras festivities. ","useful":0,"cool":0},"DZ_nnchfgo8-gCcC9nu7FQ":{"text":"Food was delicious. You get a lot for your $! I got the nachos with pineapple and mango lo","useful":1,"cool":1},"qUG5QbLH4bT8LZFrKw22Ww":{"text":"Mexican is usually great for vegan options but Juan's goes the extra mile by offering tofu","useful":1,"cool":1},"pfLIi02dFWpveWmRQL3ePw":{"text":"We had heard that this was a great place so we decided to go for lunch. We were not disapp","useful":0,"cool":1},"MDRk0uicfAr_jPFT98t3Fw":{"text":"Wow! Our first night in town and we decided to try out Juan's Flying Burrito. It was the r","useful":1,"cool":1},"PIPLWOCiZzlqgVJkNCaiOg":{"text":"This place is not bad, but it is not exceptionally noteworthy. The food is reasonably pric","useful":0,"cool":0},"tKznsGUIxkgKKS6weie8aQ":{"text":"According to my amex account, I have been to Juan's 32 times since moving to New Orleans i","useful":3,"cool":0},"Ax4hFZMgACC5POmuptAEBg":{"text":"I've eaten here several times and the food is always good, reasonably priced and the servi","useful":0,"cool":0},"Xc2iMVidBmliDG_yawp1bg":{"text":"Definitely one of my first suggestions when friends stop by my place looking for a spot to","useful":0,"cool":1},"UZLcb46i2NU71L8IF0Z-9w":{"text":"This was genuinely the best burrito I have ever had. I had the Flying Burrito and it was s","useful":1,"cool":0},"cX9ALgumHc3w4OGF0_OMvw":{"text":"A recent transplant from California, last night was my first... and last visit to Juan's F","useful":7,"cool":4},"qwuaWt9w7MoxTnHyPKVD_g":{"text":"Okay I love Juans but somebody's got to put a stop to this shitty coked out and angsty whi","useful":0,"cool":0},"Q6k1etsqfptVMXlO4Lg3sA":{"text":"The service here was terrible.  My lunch wasn't bad but there was a hair on the plate that","useful":0,"cool":0},"SEU-rE60UUCu7R9kbdTo0Q":{"text":"Ok. Fine. I'm being peer pressured into upping my rating for Juan's because I go so often ","useful":1,"cool":0},"FcCv_WH26Tq9TujlysikUw":{"text":"Super fun!  Great atmosphere of the local mojo of Magazine Street!  Safe!   Great food and","useful":1,"cool":0},"K3NrCCQXBFgu2JCpSoQPeA":{"text":"This has always been my go to place but I think with the pandemic, the good cooks are gone","useful":0,"cool":0},"oLGiopwxUgDRam8pw8N4rw":{"text":"Freirndly staff and good food. I had the blackened fish tacos and the mushrooms tacos were","useful":0,"cool":0},"z4pFU2cZ5CMBe9FdMVqU-Q":{"text":"Ok, so let's be real here: This is NOT authentic Mexican food. This is not to demean the e","useful":0,"cool":0},"vBOTKmaEW0ij4Q4hBBZhrg":{"text":"Dropped by since it was the closest restaurant at the end of our walking tour. Really glad","useful":0,"cool":0},"07akzdTh-11GpN7mX1k3fw":{"text":"Do order drinks, seasonal cocktails delicious\nDon't order enchiladas, uber dry tortillas l","useful":0,"cool":0},"KimNCXPYt9bHaiLhto9AHA":{"text":"The food was fine, pretty basic TexMex menu with all the typical options. What really surp","useful":0,"cool":0},"woA33mKUpkMcG0NKZFAJBQ":{"text":"Worst service I have ever witnessed at a restaurant. We felt like we were an inconvenience","useful":0,"cool":0},"QzUVOWhkXUThAsyKh_NG5g":{"text":"Chipotle or any other taco selling restaurant has NOTHING on Juan's! My vary first tome or","useful":0,"cool":0},"P43nYocJ6aZXi7v--92DzQ":{"text":"Juan's flying burrito is a fun place to hang out and get an interesting mix of New Orleans","useful":0,"cool":0},"vfm9ZlqK_s9wl8qTXeXzbA":{"text":"Happy hour is all day on Sunday, which means $1 PBR and $6 margs (they're gigantic and str","useful":0,"cool":0},"x5uTM1K9wNkOfDHZ_hjrdg":{"text":"Stopped in on our first night in New Orleans and it was awesome. Great atmosphere, great f","useful":0,"cool":0},"0psKDss8QNQbqA78WLQNfQ":{"text":"It's no secret that I love Mexican food.  In fact some might say that I'm obsessed with it","useful":3,"cool":3},"VZp3aJspp8ewhCrf1qS6cA":{"text":"Oh my god. I stumbled in here on a hot day after a 2 hour walking tour and am I glad I did","useful":1,"cool":1},"cJrQdqLH7BR5WjWfwvMF4g":{"text":"Too much hype... Went there for dinner and it was quite frankly, pretty bad. They must've ","useful":0,"cool":0},"m5OuaLtDth3MNgRwhKu_hA":{"text":"Fun, upbeat Mexican joint! The service was quick and great. I ordered the steak g...someth","useful":0,"cool":0},"bVGNPMuYuvTaR6hqBIU3Wg":{"text":"Every time I'm in New Orleans I go to Juan's! A trip is not complete unless I place an ord","useful":0,"cool":0},"achRsrJa8sxijrcpKFznQQ":{"text":"Our waiter was SO high. First of all. Let's just get that out of the way. This place was v","useful":0,"cool":0},"33hll_qUlwiz1qzhy9STBQ":{"text":"these people. literally every damn time i order they screw it up. my partner loves getting","useful":1,"cool":0},"HDmzMClohQCXAaGffTZ_Lg":{"text":"Delicious and very filling!\n\nWe split a chicken quesadilla and it was pretty large. I got ","useful":0,"cool":0},"sSIQwi2BfhgcYBYq2T28og":{"text":"Enjoyed this place for many reasons! The food that we chose was delicious. I would recomme","useful":0,"cool":0},"Fe0ScXOjuWI5tXBITsvBOg":{"text":"I asked the lady at the record store down the street where a good place to eat nearby was,","useful":0,"cool":0},"tLniBhThequViiQw7cOi6g":{"text":"Stoped by for some refreshment out of the heat. Great friendly place! Yummy margarita & ch","useful":0,"cool":0},"u9OxP2NMwnuYMDMGfU-whQ":{"text":"Not worth the hype. There are definitely way better tacos in the city. Margarita was just ","useful":1,"cool":0},"OiASaibnLsgcnnEuPi-Ivg":{"text":"I ate here for the first time last week Sat. And the food was so good I returned in less t","useful":0,"cool":0},"KpSseNlNLPjK2Mo7TjjpuQ":{"text":"Some friends took me to Juan's while I was visiting in New Orleans because of their large,","useful":3,"cool":0},"SkqW0OjSOR3jQjLfP6TgEw":{"text":"I like Juan's- great atmosphere, nice and chill. The food is good too and the price is rig","useful":0,"cool":0},"ZV6QsAWCYqRNuLlyd3YZKA":{"text":"I have never left here hungry.\n\nJuan's serves up the best burritos in the city. When in do","useful":0,"cool":0},"IJShnyM0IlAXhnGgCxAsHg":{"text":"So good! If you're on the fence, GO! \nHusband and I are in town from Texas. The original p","useful":0,"cool":0},"kq2q36MoqlzMN7TLUmo0eQ":{"text":"Most disgusting Mexican food I have ever eaten! And Mexican is my most favorite culture fo","useful":1,"cool":0},"t3m-isX9QRSYuRxlUNin9w":{"text":"Margaritas are amazing!!! Small but good! The food is good also!!!! But comes in big propo","useful":2,"cool":0},"lvsitlOoV-mNLZXj6-enyQ":{"text":"I will say the atmosphere and food were good, service on the other hand was terrible! Trul","useful":0,"cool":0},"NzP7NhzXgthyTo-aRqCHLw":{"text":"I ordered a build-it-yourself quesadilla to go: shrimp with black beans & cilantro on whea","useful":0,"cool":0},"tZFnD47MW7DP3tSdcKPgQw":{"text":"You won't find good Mexican food in New Orleans, but this is a good, fresh, fast option. J","useful":0,"cool":0},"-OqG8xOxRgTRx9gx4wNdbg":{"text":"Prefacing this whole review with the caveat that I lived in California for 8 years prior t","useful":0,"cool":0},"e3AYfOL73n7X60GdiIQmEg":{"text":"Great service even though we came just a bit before closing. DEFINITELY the best guac I've","useful":0,"cool":0},"R89DWnOkVbUlU45ITJbT4A":{"text":"Great Burrito, couldn't even finish it from its massive size, also a great family friendly","useful":0,"cool":0},"lXHNIRFx7Y5PGg3OFOkcew":{"text":"Wow \nI enjoyed the margarita Monday \nTacos were tasty \nSo many options from the menu \n\nThe","useful":1,"cool":1},"xtQIiQ0gHAPqL2jrARww4A":{"text":"Great service, quick and friendly. Ordered a drink I didn't like and they were very accomm","useful":0,"cool":0},"A8WEwXeurv_tY0uEakz4jQ":{"text":"Excellent bartendress here!  I'm going to miss sitting at the bar and talking with Lori an","useful":0,"cool":0},"hgF3KIK1qL0mCo3TNKX8UA":{"text":"This is as solid as it gets! Great New Orleans twist on Mexican food with great staff and ","useful":2,"cool":1},"uDA9w9dIUmjrcgHnIw2TnQ":{"text":"This used to be one of my favorite places in New Orleans, but I am finally done. It was al","useful":1,"cool":0},"tDMyqWBwGbPZ8P22YELi6Q":{"text":"Stopped in on a Saturday night, sat at the bar\nGreat bar tender\nNo free chips :(\nCaliente ","useful":1,"cool":0},"ISuOl8yHYQWiPsFOO29_7g":{"text":"Juan's Flying Burrito is a life-changing food experience! There is a lot of amazing food i","useful":0,"cool":0},"q-JT086VpdQTUMAYiwbFaQ":{"text":"Easily my favorite Mexican restaurant in town. Low-key, quick and always delicious. Only c","useful":0,"cool":0},"500vDjEgd6pTVeyWpZpfJA":{"text":"Great for families- my kids love the huge portions and the coloring page with crayons, chi","useful":2,"cool":1},"5pqmvnTQCOGIRUtYvrIWCg":{"text":"My go-to for American-Mexican. I'm always amazed by how small my check is at the end of th","useful":0,"cool":0},"ejwuUWwvvnu0o8WE7LEyUw":{"text":"This is my go to place when I have friends visit me in Nola.  The food is cheap, fresh, th","useful":1,"cool":0},"K0ivdcjNq0n-Sj2ezslJFw":{"text":"Amazing shrimp tacos! I ate here two times in a row when I was in New Orleans. It was that","useful":1,"cool":1},"_NUHUnfFdRDCeNaO0ESbaA":{"text":"This place had many good reviews so I decided to make this my last restaurant to try befor","useful":1,"cool":0},"bwfWss-5EhURqs3lGg2LRg":{"text":"I really enjoyed our time at Juan's!  The staff was very nice and it has a great divey gru","useful":2,"cool":2},"q7tR2g_9Xt3rjNuPKLf5DA":{"text":"THE WESTERN is to my palate the perfectly flavorful Tex-Mex burrito!\nEVERYBODY in town goe","useful":1,"cool":1},"d2Xd2VZI7bppSMwy_OsLsw":{"text":"The guacamole was just ok, I don't think the avocadoes were ripe, on top of that we had to","useful":0,"cool":0},"ynaig0c9cyHWcmYnlDBh-Q":{"text":"We stopped by this place for dinner on a Friday evening. Great place on Magazine St. with ","useful":0,"cool":0},"CrFSwpr5pjlpQUWfPHCitQ":{"text":"Wow \nI enjoyed the margarita Monday \nTacos were tasty \nSo many options from the menu \n\nThe","useful":0,"cool":0},"PaFD-LO1NlIuwonkxCeCpg":{"text":"Visit this place with your favorite hipster in mind. If you really love him/her, I would g","useful":0,"cool":1},"8gicmXjrXHWnr9OjSTKoXQ":{"text":"Being from Texas, I really enjoyed the Texmex with a Cajun twist! The Queso wss surprising","useful":0,"cool":0},"i-keTHxwR0ZeRLLnzU2ORw":{"text":"LOOOVE this place. I get the flying burrito and the flying enchiladas. Also the luau quesa","useful":0,"cool":0},"2fBNgMC97h2TsVRCTu5uiA":{"text":"Great trendy Mexican restaurant that has ALOT of options! The food proportion is good. The","useful":0,"cool":0},"4P9nIGQYOtDpTWFmjLXltg":{"text":"Unfortunately we didn't stay and have a sit down meal due to our schedule, but the atmosph","useful":0,"cool":0},"p6Pk5aoFxp_0vZ9AJK4rAw":{"text":"WOW - Just wow. \n\nI was visiting NOLA this weekend and decided to walk up Magazine street ","useful":1,"cool":1},"iJyl2KLzeV9CYkjF95X50Q":{"text":"Oh, Juan's. Old faithful. I've been a Juan's-goer for over 15 years now...definitely pre-K","useful":0,"cool":0},"yFoxcrpNz4tuukn1sZoBmA":{"text":"I'd like to preface this novel of a review by stating the two stars is *not* because the f","useful":3,"cool":0},"jJouEENUxdtn0k5k_FVvZw":{"text":"I went today for lunch. Had the flying enchiladas and a few of the house margaritas. It wa","useful":1,"cool":0},"9LNgt3t0YGt7OYWlikdkkg":{"text":"We got takeout and were running about 30 minutes late, but they kept the food waiting for ","useful":0,"cool":0},"HKfSv9IGJ0JDdCkRcdPo9w":{"text":"SO delicious. Never disappoints. Amazing flavors & atmosphere and a great bang for your bu","useful":0,"cool":0},"9JfmceUsma3wD9nsDxJ6WA":{"text":"Not bad not great. We got there close to opening and we were the only ones. Waitress was p","useful":0,"cool":0},"BCBvAxIHUlCE1WkeJcj-bw":{"text":"Since the pandering started an when placed opened up  with limited menus.  To my surprise ","useful":0,"cool":0},"F3Lqyp7NbM_-JxdHAiFAdg":{"text":"Ok, so let's be real here: This is NOT authentic Mexican food. This is not to demean the e","useful":0,"cool":0},"hScIHh6oN-lAnhruz1tqAg":{"text":"I ordered takeout from Juan's Flying Burrito for the first time and really enjoyed it! I a","useful":1,"cool":2},"OVJE4fExWNmgGaidg1x_6A":{"text":"Delicious! The food was flavorful, the drinks were tasty and the service was quick and fri","useful":0,"cool":0},"BVQ0CuodjhTop4JarjbSkw":{"text":"Trendy vibes & a huge menu selection made Juan's a great place for an early lunch & our pa","useful":0,"cool":0},"jdl3PUa5W-Uq-qEEqRoeEg":{"text":"Stay away this place is overpriced Taco Bell. Service and food was terrible. My food set i","useful":0,"cool":0},"4ntkCNvWyuA3JhsCv-9hvA":{"text":"The service was great, but the food wasn't. I was really craving Mexican food and was very","useful":0,"cool":0},"OL-eMmIfbMn1r8x0oW7saQ":{"text":"My favorite Mexican place in New Orleans!! The guac and queso are amazing, not to mention ","useful":0,"cool":0},"GrVTFzPpBD1MUt32SYu2Mg":{"text":"Rude employees, VERY small portions and clueless management. This is a culinary Black eye ","useful":0,"cool":0},"t5GLhPALcRbL_fPqVlH68g":{"text":"Juan's has a few locations in town.  We have eaten at the one next to Whole Food uptown th","useful":0,"cool":0},"whbW9slvvRglYA_zL2dUrw":{"text":"If you like burrito and taco with authentic flavor then check this place out. A friend rec","useful":2,"cool":1},"5U_JmAVK61WxxV4vuuNMNg":{"text":"Not your average Mexican. Everything was super delicious. We had the chips and salsa/guaca","useful":0,"cool":0},"wJ3ZYH8p3QcE46nQHfor-A":{"text":"Juan's is a cool spot with unique dishes, but average service. I've been coming here on an","useful":2,"cool":3},"D2fDB87S65WYnV_s0JYxJw":{"text":"Didn't love nor hate this place. It was just kinda so-so for me. It's a bit crowded inside","useful":1,"cool":1},"AApirOwmqUwJR06kNEfVWw":{"text":"Fair warning: this is a biased  review from someone that can not handle spicy food. \n\nEver","useful":0,"cool":0},"lxDcHNgshhsJYYZiEmiuVw":{"text":"Every time I eat a taco here I say \"dang, that was DELICIOUS!\" I don't feel the same about","useful":1,"cool":1},"0Jyu9KZ1aCLYn6xWWzjTlw":{"text":"Their blueberry margaritas and love it bowl are the reasons I go here! My husband gets the","useful":0,"cool":0},"rRjf8QVpfj-r_z84r2kepg":{"text":"Love Juan's chips and Queso as well as shrimp and chicken Quesadilla my family love that i","useful":0,"cool":0},"VZQF6TpQK2JbpGiyQ0JAcg":{"text":"Not only was the food delicious!!!, but the waitress was also extremely sweet. We came to ","useful":0,"cool":0},"-uNFWRad_U35oJBCROhX0A":{"text":"Easily my favorite Mexican restaurant in town. Low-key, quick and always delicious. Only c","useful":0,"cool":0},"r2eNdMm7CzcFGHO2I3Ds_w":{"text":"Good service. A little too many passers to eat outside and weren't allowing indoor seating","useful":0,"cool":0},"0BEzmbFud6QiA8aESGlScA":{"text":"This place is affordable and delicious! I really enjoyed the food and service. I had Juan'","useful":1,"cool":1},"fpeN_OpTLr1_9cjonqHhKA":{"text":"Having heard the hype for Juan's, I was excited to go after an afternoon at the pool, drin","useful":2,"cool":0},"2Iu4_S9FDXZXBojbpw6dgg":{"text":"Food:4.5\nService:1\n\nI ordered the al pastor burrito and I absolutely loved it. It was both","useful":4,"cool":1},"eEwFjbzFvm1puCv2gNinWg":{"text":"I can't believe I find this steel scrubber in my food. This could cause very serious probl","useful":0,"cool":0},"LucVzkyRvEiBmfJ0Z3kitg":{"text":"After a four year love affair with Juan's tacos (Pork & Slaw and Blackened Redfish are my ","useful":1,"cool":0},"quP94ubQ0LqdJ-LM_u0TkQ":{"text":"DISCLAIMER: Juan's Burrito's don't really fly. I know, very disappointing; however, the fo","useful":1,"cool":0},"-IzazikfKhO0My8diIpCDQ":{"text":"Prepare for a flavor explosion. Huge menu with Mexican meets Creole cushion. I got the Wes","useful":1,"cool":0},"KUFvSCY98SA7jsSQTUvFXg":{"text":"Happy Hour Review. \n\nWent there for the last 30 minutes of a happy hour on a Friday. Drink","useful":0,"cool":2},"1nbulCgjrbSB89bkdCcpRw":{"text":"What's not to love? Greta Mexican food, great cocktails, cool atmosphere, good price. We t","useful":1,"cool":1},"X5r22NPXDU8WMdHBVGVaxA":{"text":"We walked out tonight after they were out of tofu AGAIN.  So tired of trying to put decent","useful":2,"cool":0},"t8cYQZJYwOqTAfH0vLpPPQ":{"text":"I highly recommend the blackened fish tacos with jalapeño aioli and a side order of chips ","useful":1,"cool":0},"b77U7AOeaFz_S8EE-NTTjA":{"text":"Great taco salad. Was more than I could eat. Also had the trio appetizer and that was very","useful":0,"cool":1},"UgWBaSF-OY6ubGhwV4gv_w":{"text":"We stopped in here for lunch one day and it was great! The inside was a bit loud for us so","useful":2,"cool":1},"nmj73YmiNmNImfXqUBpn3A":{"text":"Customer service was horrible, first waiter, and the appetizer was mediocre. Would not rec","useful":0,"cool":0},"B74AN7XJp1JuUg4zLQlK6A":{"text":"This is my first Yelp review, and I thought that it should be to the restaurant that I fre","useful":0,"cool":0},"eUaioI0hIR-7FRAceRwHcA":{"text":"Margaritas and the happy hour is good but the  bar tender not too good\nNever offered more ","useful":0,"cool":0},"2ArB8M1B1MUBnToROLBsFw":{"text":"Hands down one of the best burritos I have had; coming from San Diego that is not easy to ","useful":1,"cool":0},"ssRellJAFEL7o3IfAUyuKg":{"text":"Love, love, love Juan's Flying Burrito! Please come to the SF Bay Area so I can enjoy more","useful":1,"cool":1},"-YMfUBtTXaWMEiruUndsxg":{"text":"Update:  I was so looking forward to my return trip to Juan's, but this time it was a tota","useful":1,"cool":0},"hqXSO3zx-ty3BtpRniWDew":{"text":"Juan's is definitely a safe bet for fresh, mexi style food in the Uptown area. \n\nI find it","useful":3,"cool":3},"wH071KFk1EM6WXf2Ny1OTA":{"text":"I can't speak on the menu in its entirety but what I can tell you is how I had two frozen ","useful":18,"cool":19},"Cq54lBB2qyUFj-Vho_Hwtg":{"text":"My friend and I went to Juan's today for lunch and had a very bad time. I've been to Juan'","useful":5,"cool":0},"ZrM-_R--NWoXtBHMAI62Mw":{"text":"Let's start with the bad: the Mexican chocolate Brownie. Tastes like somebody added a bit ","useful":1,"cool":0},"xez7hORw8a2EjvafhFVLsg":{"text":"Stopped in for a quick lunch while strolling through Magazine Street.\n\nDespite the great r","useful":6,"cool":6},"50489TBQQ8YeJaDHNmnntg":{"text":"This is my first time trying this place. The atmosphere was awesome!!! The waitress was gr","useful":0,"cool":0},"hC-MZay48WNck4RKzAWKeg":{"text":"I don't know how many times I've said this to myself over the past few years, but hopefull","useful":1,"cool":0},"b2OaCQDGFkbenPnlMV4fyA":{"text":"We came here because we really wanted to eat more Louisiana shrimp! I couldn't imagine goi","useful":2,"cool":1},"tBhZnCjlDeXWVcSaY7gcyg":{"text":"Worst tex mex I have ever eaten. Tacos were tiny and stale. Thimble full of shredded shoe ","useful":0,"cool":0}}