{"81polQdXPC66V12zGAJ0vQ":{"text":"On a recent trip to New Orleans I realized I left my dress shirt at home. My suit wouldn't","useful":3,"cool":3},"H1p-GdPmttGc2W-lRKgZdQ":{"text":"I had not visited Perlis in over thirty years and I now remember why. \n My mother used to ","useful":2,"cool":0},"Qv8ZdMC30GLw2QXCPrbtGg":{"text":"The sales portion of the store is full of nice clothing with sales associates tending to y","useful":2,"cool":0},"AaO0Lm55MgK8hGbqlapE_w":{"text":"This place makes J Crew look like Wall Mart.  They are the old guard haberdasher of Up Tow","useful":7,"cool":3},"iGUwVlhUyVima23a5wJIpg":{"text":"Went in for a last minute dress shirt. While expecting to be \"pretty woman'd\" due to looki","useful":0,"cool":0},"Y5TDHURhshjJEwtxpOTSnw":{"text":"The best in NOLA... ask for Jay. Great world famous logo of a crawfish. Clean store. Tailo","useful":0,"cool":0},"Xcp0auhwSg5SOCiemhWnHA":{"text":"If you are the kind of person that likes crawfish logo apparel then this shop is for you! ","useful":2,"cool":0},"ajKsSw0SXkX0O5bBSSWE-g":{"text":"The service at Perlis magazine is very good. The sweetest lady helped me and wasn't too pu","useful":3,"cool":1},"6s8BFDiUxOJBWcJyZlMLNQ":{"text":"Fantastic place to get a suit.  I walked in expecting one, and after a fair amount of back","useful":5,"cool":3},"YWL_f5xobuf4Ut0nOUxDgg":{"text":"I am not a clothes guy, in fact I like to joke the clothing sold by Cabelas is closer to m","useful":1,"cool":1},"-l5_newuC8kYiATTpk3D4g":{"text":"The go to place for men's suits in the city.  When my youngest brother graduated from coll","useful":8,"cool":5},"4Kf3ZQRrX7U_cEYNWX6MXA":{"text":"I love the clothing here, and I love the way my husband looks in everything from Perlis. B","useful":3,"cool":1},"ooFLWDuRP-XKLIUOG9UGWA":{"text":"Generally solid, but a few complaints. I have only rented a tux here, and therefore can on","useful":0,"cool":0},"j9yZmmC6D4uhqpIs3E2SpQ":{"text":"Sam at Perlis was so sweet and helpful today.  My daughter wanted a rugby shirt for Mardi ","useful":1,"cool":0},"bhP4v7K94XCpsSVsGIq92w":{"text":"While I do like some of their clothes their uppity demeanor is disgraceful.  Its not like ","useful":1,"cool":1},"C1fnLgtxWnX1mKl_0i3NjQ":{"text":"I had reserved two rental tuxedos for a mardi gras ball.  the shoes on the one for my son-","useful":3,"cool":0},"iluvNIYuyECk9P14ZQZXaA":{"text":"I came here to get a dress altered that was a size 4 because it was all the store had left","useful":1,"cool":0},"KimNW2hajNPAGoVtURa8Ng":{"text":"Perlis is a men's clothing store in New Orleans. Depending on whom you ask, it is THE men'","useful":5,"cool":0},"MckSbct-no2Y-VYMW_qoVQ":{"text":"Great place to pick up a few items for Mardi Gras season! The men's selection is expansive","useful":1,"cool":1},"JhR-OUNbZN3Ade3nA9t0jA":{"text":"I have to say, I've never been taken care of in the way I was treated at Perlis. I came in","useful":5,"cool":1},"tKCEuidTtVTDzNI59T5qfw":{"text":"What Ben Silver is to Charleston Perlis is to New Orleans. Upscale, high quality clothing ","useful":0,"cool":0},"y9f9D3WSplny04PqnhwFfw":{"text":"How could you not the crawfish brand / logo? Coupled with amazing customer service that is","useful":3,"cool":0},"5Ox6uRcx8TABiFcfYDqDXA":{"text":"Perlis is one of the better clothing stores in New Orleans.  They primarily focus on men's","useful":6,"cool":2},"Tg_L8d00-VYlWRnKFfku6A":{"text":"I went to Perlis to purchase a tuxedo for my wedding.  I've been shopping around different","useful":5,"cool":1},"PWNhRyiYZjbXQOtiYOTLRQ":{"text":"The clothing is nice but the employees need some training. The French Quarter store didn't","useful":0,"cool":0},"t8KqTXk4eCFVU8jRfw5kEw":{"text":"Service is very good ... personal. Over the years its the same people. They want to know y","useful":0,"cool":0},"TR_ui11IanTJrB86Bzvx1Q":{"text":"We came here on our recent trip to NOLA.  My hubby, who is tall and often has a difficult ","useful":6,"cool":5},"dH_KoAQ72fAQZ1VtsFLbPQ":{"text":"Do I shop here for women's clothes...no I do not. However they do indeed have women's clot","useful":3,"cool":3},"EfZNitzOySD9nCdppqSICQ":{"text":"Two times and they are out. This is my second attempt at Perlis. First was three years ago","useful":4,"cool":1},"JwuQ9T5-sLmiIsZhIHKzHA":{"text":"Maybe it was an off day. Maybe it wasn't. I came into the store looking for a tuxedo. Upon","useful":4,"cool":1},"6oWdLgMEZGcRXk-H7xufEg":{"text":"The $100 shirts I've bought from Perlis have horrible quality and craftsmanship. The knit ","useful":2,"cool":1},"QWZh4vLx7QGUTRtwDldSTA":{"text":"This is about my not so good and many others in our wedding parties issues. The people we ","useful":1,"cool":1},"rsuDUoJU2rPey-FO6-AteA":{"text":"So, keep in mind I don't live in New Orleans, but, I am from the south and I do help in ru","useful":3,"cool":1},"irAGUujeBUC_GBrU21Kkvw":{"text":"I went to Perlis today for the first time in many years. Although there are some nice clot","useful":5,"cool":1},"GoFO69njZqFBUUhTLI41Gw":{"text":"I buy something from Perlis every time I get to New Orleans and have ordered from online, ","useful":0,"cool":0},"rkw3cMzGpNis5Qy7T4b9RA":{"text":"I had rented a tuxedo from another establishment and picked it up 2 days before the weddin","useful":0,"cool":0},"5cTFdXiwNMAj31ZMTH6neg":{"text":"Perlis Clothing On Magazine St. In NOLA is an old style venerable local institution. You a","useful":6,"cool":5},"aL_UsH0TcHMIM-DnPf6qxw":{"text":"Every time I go into the store I get the same salesman and I have never been treated so po","useful":4,"cool":1},"_EoG0vWkx7NNl4-n3NnHQA":{"text":"This has been a favorite place to shop since I grew up in NO! After moving to Houston I co","useful":0,"cool":0},"m0b0dmGZ4g-lm_CWtj-iLw":{"text":"I have been a Perlis customer for almost all of my life.  Growing up in New Orleans I wore","useful":0,"cool":0}}