{"GHVh6R_l6kH-2-8bPZNxWA":{"text":"I had a leveling kit installed; along with an alignment and wheel balance. My truck looks ","useful":0,"cool":0},"vFojFQMizB0JCaoCH2qRqw":{"text":"I brought my car to Boudreaux's Collision and had a great experience. All of the employees","useful":0,"cool":0},"nxGy0wk_hql0u6nDrlny1A":{"text":"Someone rear ended my husband Jeff and I coming home from FL on Sunday. We were so sad bec","useful":2,"cool":1},"XS2IfufVRkaVktZkIErPZA":{"text":"Boudreaux Collision Center took care of my car back in August of last year and outside of ","useful":0,"cool":0},"9PNZz9ycNcoR_mZj6YzfvQ":{"text":"I got some body work done on my car at Boudreaux's and I have nothing but great things to ","useful":4,"cool":2},"UiyyQe5ZGcEqZfC5rVSt6w":{"text":"This community is lucky to have a place like Boudreaux's! They will go above and beyond to","useful":0,"cool":0},"RDX807ZvEZUbO-Cit6pqYQ":{"text":"Very impressed with the work and service. Got my car back and it looks brand new. Is wife'","useful":0,"cool":0},"qxYe9sM61Iu7z-YTJoTnmw":{"text":"Whatever you do.... do not go here. You'll be duped. They'll take every last dime from you","useful":2,"cool":0},"jwBGuEcpCLa96e6I4LAb-g":{"text":"Jenny was so nice and very fair. The work they did was impeccable and fast (they repaired ","useful":2,"cool":1},"86V3Cah5nrI-d-74R-gOyQ":{"text":"They quoted me $700 for paint scratches I needed buffed out. They were adamant that this c","useful":2,"cool":0},"q4B6pPU78bRtR_ZOnf1R3Q":{"text":"If you're looking for a great body shop,this is the place. After pricing a few different p","useful":0,"cool":0},"OYrpM14aZmku1Ymq6jNNFQ":{"text":"Wow. Amazing service. I'm super happy with the outcome. I dropped my car off at the shop M","useful":0,"cool":0},"XeOtpZLdv2Dv_o2noP4g_w":{"text":"I had to wait a few days to come on here and write my review due to how upset I was when I","useful":1,"cool":0},"xE5DMLyIw1A8STMO1hw1BQ":{"text":"Good, quality, and punctual work at an honest price. They were more than very accommodatin","useful":0,"cool":0}}