{"kwqL30r8ra330DDfZjYo_g":{"text":"OMG I love this place. So much so that I cannot believe I haven't written a review for it ","useful":13,"cool":7},"xyr9i-MvMfkK4tbRzgt3cA":{"text":"If you are staying at or near the aloft Hotel, go here for breakfast. The lady behind the ","useful":0,"cool":0},"chqTvnzM2hG0pgp-ofKG-w":{"text":"absolutely my favorite coffee shop in the central business district. It's a hip place with","useful":2,"cool":2},"XnX8N0usT0Yf2RFigPyZ9Q":{"text":"If you start to feel grease oozing out of your pores during your NOLA visit, consider star","useful":0,"cool":0},"Y_hTJjlaDX3-jrj7FhWHww":{"text":"LOVED THE ATMOSPHERE. Very modern, trendy, comfortable, interesting art on the walls.... E","useful":2,"cool":0},"h-WNfl1UFsJnT173Tb2T0g":{"text":"This place is cool.  Really sweet baristas, great coffee, and yummy crepes although they'r","useful":0,"cool":0},"w0z_jdnvtqPtKIdgrqwWdA":{"text":"Merchant is a hip little cafe with elegant breakfast choices.  Their coffees and teas are ","useful":1,"cool":0},"efYRDIOz2jtEDZ6bmqNSzA":{"text":"Two good reviews for our savory crepes and coffee. Rave reviews for my chocolate croissant","useful":0,"cool":0},"5EGQF6p1wP0_fZVUbYx70g":{"text":"Brand new to NOLA and wanted some delicious coffee and a breakfast sammy. Merchant was spo","useful":0,"cool":0},"03YV4toKhca5RDOPcn_Lvw":{"text":"The food at this place is way too overpriced to get snotty service. \n\nI ordered the ham & ","useful":0,"cool":0},"ueTM-s0_EBcAqHf8gqPYlA":{"text":"The crepes and coffee are super yummy!!! The coffee is a little pricey, especially for NoL","useful":2,"cool":0},"GIZA46qWyLPY633K7uQgOQ":{"text":"Such a nice spot. I had a savory crepe that was wonderful and came with a little side sala","useful":1,"cool":0},"ZmXC2ifA7mZhYo-nl7eijg":{"text":"Great crepes, coffee, and service. A little off the beaten path. Hip decor.","useful":1,"cool":1},"bEE9E08ecWCmqqTTLGQorg":{"text":"Oh dear, what an excellent cafe! It's located in CBD but just a short walk from the French","useful":1,"cool":1},"TztqUP6AhLHdxlxcelNTWQ":{"text":"Definitely a locals place. We were the only group not in business attire. The hostess reco","useful":3,"cool":2},"eIB017mArb5S5z9VBHseJw":{"text":"I know - its NOLA and I should be eating gumbo, crawfish and oysters. But I've now been he","useful":1,"cool":1},"cy07md0zgDqB_29qcnn-kQ":{"text":"This little cafe was our last stop in downtown before ending our vacation, and it was rema","useful":3,"cool":2},"Vq9t93BUFwlfjRn5rjO6sw":{"text":"My friend told me about this place. I tried one of there savory crepes and LOVED it! Also ","useful":0,"cool":0},"RtJnJRcK7XdArhz8dr9ewQ":{"text":"Awesome. Went here several times during my stay in New Orleans. Had two different crepes, ","useful":1,"cool":1},"WUdhTaalcSMwzYXcTlZ7kw":{"text":"I guess if I have to sum this place up, I'd just have to say it'll do- not too remarkable ","useful":0,"cool":0},"jTXY1URkmCFbEDv__b9Auw":{"text":"I really like the vibe here, but it's really packed usually and not terribly good for work","useful":0,"cool":0},"5VQ3HeZMAXQIhYfW0jFiCw":{"text":"only tried the french press cup coffee and almond croissant, croissant was really good, co","useful":0,"cool":0},"Qb35XH3uL-d33nxc-muO5g":{"text":"The duck confit was by far my favorite, though last I checked the menu I didn't see it on ","useful":0,"cool":0},"4MmtUfbebRTcoOalkmF5Xg":{"text":"The turkey fig goat cheese crepe was yummy and a generous portion. They had lots of option","useful":0,"cool":0},"tMLbiswEH0cD2UHWowLKAw":{"text":"Came here four yrs ago and I've been dying to come back to New Orleans just to enjoy a bre","useful":0,"cool":0},"IGioLimcB7YVI7wkgZdThA":{"text":"Chicory coffee is really not my thing, but this is a nice cafe so check it out. Very conve","useful":0,"cool":1},"oYAMceWoEXZnsxxXMXajzQ":{"text":"Ate breakfast twice while in NO for a conference.  Loved the DIY French press coffee.  Had","useful":0,"cool":0},"fJMIiYRQRsnIJvTDQq9-Sw":{"text":"This coffee shop was across the street from my hotel on a recent girls weekend. We were ju","useful":0,"cool":0},"bEg5OzUxQ28gd_7fbVi1Cw":{"text":"Very good food, clean trendy place with free wifi. Centrally located and easy to get to. F","useful":1,"cool":1},"cSOFD1CGk2exfDgHpwg53w":{"text":"Because NOLA lacks really high quality beans, my love for coffee has waxed and waned over ","useful":5,"cool":3},"3LMJ0G1Q2kKh7OR2DKBipA":{"text":"Excellent food - however the cashier gave herself a 20% tip without telling us and not kno","useful":0,"cool":0},"vkRRUB9dn8yGn6xWvaPZDQ":{"text":"My Matcha tea latte was nice and creamy. They clearly use quality matcha since I didn't ha","useful":3,"cool":3},"skKPRfVNVXisWIXq0jRCXg":{"text":"Great place. Menu is adventurous and very eclectic. Staff was very friendly. Very clean an","useful":0,"cool":0},"clVAqicjyxaLgkGJXFjg9g":{"text":"Great coffee, food, ambience, and people.  I couldn't ask for anything more. The Turk and ","useful":0,"cool":0},"VyCTFKePtodU8uVC3VABag":{"text":"A little more chic and a little less \"grit\" than I usually like in a coffee shop. Still, t","useful":0,"cool":0},"vJlA89AfLiE9d_eLPobXQA":{"text":"This is a great coffee place, clean and with very fresh ingredients. The crêpes are just a","useful":2,"cool":0},"Je-lR0d82STb3d_mKgcfUQ":{"text":"Excellent coffee (Illy cafe, for those keeping score), interesting modern decor, very frie","useful":2,"cool":0},"_zt8pgHdpWkJGaXNknWS-w":{"text":"Dropped in for a quick brunch before leaving New Orleans. First thing you see upon enterin","useful":2,"cool":1},"GONRTHg_ut4UWs2a4-12gg":{"text":"After you indulge on char grilled oyster all along Bourbon Street, visit this gem for dele","useful":0,"cool":0},"JLvK_nVAyxjGK5_n0aPfKw":{"text":"I'm hesitant to review places where I don't live, but over the course of this week, I've c","useful":2,"cool":0},"3h6jUnN73Trrl9-CUr_aeQ":{"text":"Amazing! Yogurt parfait was one of the freshest and tastiest I've ever had. The caprese sa","useful":0,"cool":0},"6UyzLI3kbxBYLsuzK2-csg":{"text":"We wandered into this little gem whilst looking for some caffeine one morning. What we fou","useful":2,"cool":3},"sClnM1jvPx1f5tnfCw5UGw":{"text":"Coffee and live music by talented musicians were the high points of our meal. We had brunc","useful":0,"cool":0},"RLLLobxHptPkgpNLuCb5DQ":{"text":"Amazing coffee and crepes. The staff took a lot of pride in the process of their food and ","useful":0,"cool":0},"3t6BVurWO7vRGflDpDzvVg":{"text":"Great lunch at their counter!  A break from the heavy, rich foods of New Orleans. Convenie","useful":2,"cool":0},"-ZPn-BbXitMnOZ1rtOD1Bg":{"text":"Really cute modern cafe. I came here on the recommendation of Peter D. while I was in town","useful":1,"cool":1},"mp3C70wfrePLwzBNfJL5dw":{"text":"Service: We called them to see if there was a wait time coz weekend mornings can be busy a","useful":1,"cool":0},"aqAZD0q3H7l_bymJ8lFhzQ":{"text":"Delicious coffee (one of the best lattes I've ever had) and lovely brunch food outside the","useful":0,"cool":0},"9GNIeGK3J8W88cvRN_NMow":{"text":"Slick decor and friendly staff.  Americano on the weak side.  I asked if they had fresh cr","useful":0,"cool":0},"OpNJZyDDBytHhKccrc9b7Q":{"text":"Cute little place, but do not attempt to go there during breakfast!  They have two 14\" cre","useful":1,"cool":1},"CTh7XhviF1Z_b6WavNvMZQ":{"text":"Got the Figamajig. Really very tasty on a croissant. A little heavy on the fig jam, but I ","useful":1,"cool":1},"9inekofo9OviZ-41vHLX4A":{"text":"Found this spot on a rainy day while we were in town. I absolutely love crepes, and I have","useful":1,"cool":1},"XTo91ueA-ssZR50ueIMnrA":{"text":"I just loved this place!\n\nIt's pretty hipster-y but very clean and the staff that were the","useful":0,"cool":0},"vB3Yeb7cTQXvEiBrqGhk4g":{"text":"I haven't spent much time in New Orleans, but I imagine this is probably the best place to","useful":0,"cool":0},"dSAQ5sgjY4NxFvrIzw0Puw":{"text":"I regretted to visit this place on my last day of the trip! Otherwise, I would come here f","useful":2,"cool":2},"NeqnoqsTCvqRkDDRFnEHCw":{"text":"Good dirty chai latte. Space was very clean. Would come back.","useful":0,"cool":0},"O8-qQ0kVPAB_F8LDLdt0HQ":{"text":"Coffee is better than Starbucks and their crepes are superb! A great light option to a hea","useful":0,"cool":0},"no1H8DelmiUULA8hYLD1vA":{"text":"Went in to try the Horchata pudding. This was not real Horchata pudding, I could only eat ","useful":0,"cool":0},"Vk8jOslShkPVLaKN-AzSkg":{"text":"I came back. Chai lattes here are indeed the best I've ever had. The atmosphere was a majo","useful":2,"cool":1},"5J14ytffiXvKW8_AIGPnsA":{"text":"Went here because I stayed at the Sheraton and the Starbucks line inside the hotel was too","useful":2,"cool":2},"r5dUj2Uh80gUPLlgFDqJ5Q":{"text":"Loved the Nutella and banana crepe for my 14-yr old daughter. I had the lox crostini. Both","useful":0,"cool":0},"FUfUsd8x4GxlruDgajOG4A":{"text":"In New Orleans on a business trip, and was looking for a cute little coffee shop to work i","useful":0,"cool":0},"vQykxAd9AHv45ZlKfp0jpA":{"text":"Trying the triple creme crepe... baked apples and honey :-)","useful":0,"cool":0},"Tk_5fAwgVuhFkl8xIdvGeA":{"text":"Absolutely delicious crepes and coffee away from crazy crowds. The space is modern and the","useful":1,"cool":0},"qCTqz4-IymOfvm458Y_rrQ":{"text":"Our last breakfast in NOLA. After going to the Ruby Slipper and Surrey's, it was going to ","useful":2,"cool":2},"XTu_VuQWr1dTgc9SARFjUA":{"text":"travelers come here for some insulation from the NOLA noise. you'll feel hip just by walki","useful":0,"cool":0},"mYKlRVI4dmvIqrEq2nMPCA":{"text":"Such a peaceful place to eat and great get away from the busy bourbon street. The atmosphe","useful":2,"cool":1},"yKIMtSSbb8dKcY6u2KpAeA":{"text":"This place ambiance reminds me of nyc! I don't know why?!! Anyhow, I always feel like I'm ","useful":0,"cool":0},"16WiyQtUXGzO6vFwCMaFhg":{"text":"I LOVE Illy coffee.  So it's always a travesty when the barista doesn't know how to steam ","useful":1,"cool":1},"JZxa_LV6NPOVutG5StYdFQ":{"text":"Hmmm.  Why does this place not open earlier?  What kind of coffee shop is closed until 9am","useful":1,"cool":1},"n-iHWccxdRSMimqGi1MWuw":{"text":"This adorable coffee shop is located across from the hotel I am staying at. It has been ca","useful":4,"cool":3},"JQB-uaiMVt1anD-BI2lbew":{"text":"The ingredients are good but the crepes are barely full! It doesn't make for a full meal a","useful":1,"cool":0},"j7edD64Eekenwt8WUaREsA":{"text":"Service: Good, however I deducted one star b/c they didn't know whether or not their grano","useful":0,"cool":1},"1vH4r23icECJX5dp5l0A3g":{"text":"Delicious and fresh breakfast. Not your usual.\nThe ham, cheese, tomato & egg on a crepe wa","useful":0,"cool":0},"txay9sdWOuJlu2bSSiMh-g":{"text":"I thought the proportions were pretty small.  Has a total hipster, clean, modern feel to i","useful":2,"cool":0},"JBBKB8oHUqAE6UJb6q3C4A":{"text":"This was right across from the hotel, super convenient! I got a large mocha and a muffin a","useful":0,"cool":0},"PnNySa1mnLSKmRiXySIqlA":{"text":"i ordered the triple cream crepe which was cold and rubbery. my boyfriend's duck confit cr","useful":0,"cool":0},"M2Tfs5jOC-sjZZCcLn2V1Q":{"text":"The food is absolutely delicious. I had the smoked salmon crostini with goat cheese and th","useful":1,"cool":0},"abFdLPoawYFKOF4sYv2rdA":{"text":"I was really looking forward to Merchant because of the reviews, but it wasn't mind-blowin","useful":1,"cool":0},"d4gK1hYgt7IRestTAd9h4A":{"text":"Great place for those looking for a gluten free bite in NOLA. \n\nStopped in for a mid-day N","useful":3,"cool":0},"HTtSZOCF6XPjooA0f8EVGQ":{"text":"I don't want to seem like the Grinch here, but I don't see what all the fuss is about! My ","useful":2,"cool":0},"CJS19bOo4achNBvwTm-icw":{"text":"Great quick-service hotspot that won't disappoint a traveler. Love everything about this p","useful":0,"cool":0},"arca4sgS8FjfHKqSbn1LWw":{"text":"I started this review yonks ago, and everything I wrote (in bullet-point form, because I'm","useful":4,"cool":2},"1bKQVpDOVi1E-8DmOoP8qg":{"text":"Modern style coffee bar in the financial district with some good eats. Good for chilling o","useful":1,"cool":0},"IrJWnFYAFzrvzZE5B5WwEg":{"text":"I'm not really some hipster coffee shop kinda guy but the breakfast food here is excellent","useful":1,"cool":1},"aLDV7uiDF_y0x0jnxlaMwA":{"text":"We stopped at Merchant for breakfast and our experience couldn't be any better. Very moder","useful":0,"cool":0},"jBQr13DFOiOm6nJggVZwMw":{"text":"Best breakfast place. They serve illy coffee, which is phenomenal. I couldn't stop craving","useful":2,"cool":1},"j4Zv4GoFOE1VcPcFk0avew":{"text":"Came here on a weekday morning while on a work trip in NO. It's a small location with coun","useful":1,"cool":0},"RviMxxwUMRQ6DUQsUELH2A":{"text":"\"This is the time on Sprockets when we dance\". I can barely comment on the food because I ","useful":5,"cool":0},"i-rnig66agFJoXLwuxfEmw":{"text":"Good coffee and good food. The turkey and fig crepe is nice. Service was good and reasonab","useful":1,"cool":0},"gGBAwr9kIW3GHhYGNZSKWA":{"text":"Had the egg and speck savory crepe- was delicious! Also had the dirty chai, was good for a","useful":0,"cool":0},"etuchokYhKJv5plcGfixEA":{"text":"Wandered by this place and stopped in for a bite.  I had the turkey and fig crepe. Hubby h","useful":0,"cool":0},"yKXqVTuo0WGz5q5GuxqTog":{"text":"Such a shame. We only had a few days in NOLA, and I was dying for good crepes. I have live","useful":0,"cool":0},"iTlMC_qQrlbuWH14dVi6TA":{"text":"Coffee and croissant were just okay. They were very slow to make the crepe and it was not ","useful":0,"cool":0},"LgpoI1aUJSWDwrb04mMebg":{"text":"I like this place.  Everything down to the high quality Illy USA napkins and tiny glass wa","useful":3,"cool":2},"Uy0hUUUmyoopeoezcXc29w":{"text":"Really needs to teach food handling standards to their employees. Food prep was handled by","useful":1,"cool":0},"Hy6j2hCPBnVe1h5CYW028Q":{"text":"Went here for a quick breakfast before we left New Orleans. It's a short walk from Bourbon","useful":1,"cool":1},"Z6jplxZIPs_oBaS458Ctlg":{"text":"Merchant is best described as a modern European coffee shop. They use Illy coffee and have","useful":4,"cool":2},"vArwTUjxmCJWy-HDGjaG3A":{"text":"Love Merchant! Great coffee, crepes, and service. Definitely one of our favorite spots in ","useful":0,"cool":0},"dCgE6k8fIJTGshlb5cU1eQ":{"text":"Friendly staff. Excellent coffee!  I had a double macchiato and it was pulled to perfectio","useful":0,"cool":0},"xzlt7XIkVsRRIYkzouxrjg":{"text":"I really needed a caffeine fix after a day of walking around. My fiancé decided to take me","useful":2,"cool":1},"4c3KuSrkUEaeDjyz3H5QXg":{"text":"this is a very cool place to eat when you don't want to eat another boring breakfast the g","useful":1,"cool":0},"j2MdD_VK1e3HCpzzpyOhLg":{"text":"On the pricey side. An iced coffee was around 4 bucks and the breakfast sandwich was aroun","useful":1,"cool":0},"J9l_FltOrjWMBRGLwwMQYA":{"text":"This place was very neat and trendy. The staff was very friendly and welcoming. The food w","useful":1,"cool":1},"x32ZazBGCOQBLnJjN-uOhA":{"text":"I ordered the decaf soy cappuccino and the Cure Crepe. After staying out all night I neede","useful":0,"cool":0},"nvFfxnaIflE8FoacEezTVg":{"text":"Wonderful lunchtime eatery. My companion and I shared a turkey and a caprese crepe. The tu","useful":0,"cool":0},"I_xVFsa-CBVQ_jp1gNkS7A":{"text":"Nice ambiance, mediocre food/service.  They charge$1.00 for 2 shots of simple syrup. TACKY","useful":0,"cool":0},"iP4DS54llgpovUGpUqr9sw":{"text":"We really enjoyed the sandwiches, very tasty, and the bread is delicious. I did not\nGive t","useful":1,"cool":0},"yZMTS1ejy2nE_9q8HdgOtw":{"text":"Super chill environment with some nice snacks that offer clean, fresh, goodness.  \n\n*** Fr","useful":1,"cool":0},"1bBHESk0wkfBAU_inzHV3g":{"text":"Service was great; coffee was great; duck confit was cold and though I like bleu cheese, i","useful":2,"cool":0},"7eY2nT2CDej1RiRC8fqWLw":{"text":"Tonight is my night to hand out five stars.  Merchant definitely deserves one for being a ","useful":0,"cool":3},"3iTe4FqznKGNzpgvKdvZNA":{"text":"After disappointingly eating subway for dinner in New Orleans, I was looking to have a fan","useful":0,"cool":0},"obZt9kLTTylqWhc2miVlRw":{"text":"The coffee at this place is perfection. Their food is amazing. Things are a little pricey,","useful":1,"cool":0},"NXkuwZsLbb-Ux-hPXfx1Jw":{"text":"Light breakfast in cool stylish setting. My husband and I were looking for a light breakfa","useful":1,"cool":1},"bqLm2k0QrSGOBPwJZeB99A":{"text":"On a 4 day trip to NOLA with my girlfriends, we unanimously decided to go here for 2 break","useful":1,"cool":0},"I-Ni3ak_5eVCFbY82YHWIA":{"text":"This place is bright, friendly and clean. Overstaffed to ensure you get good customer serv","useful":1,"cool":1},"fZXs6MSRFdbV69E1wKQy7g":{"text":"$4 for an Illy iced coffee..hmmm. The place is nice, clean and well laid out, some cool ar","useful":1,"cool":0},"6sdEjvmWX4oi_uqIUMy8Vw":{"text":"Never before have I had such indecision on what to eat for breakfast. Everything here is g","useful":0,"cool":0},"WvC_Qp7rfsxzTPnFxKvA2A":{"text":"When I found out about a place in the CBD that serves crepes I couldn't wait to go.  Unfor","useful":1,"cool":0},"IsRDfumTNsrZrHJzRON2SQ":{"text":"The absolute best thing about my hotel was this place across the street. I was in town for","useful":4,"cool":0},"BDLHa_FyKxr3yynczrMk4A":{"text":"My favorite breakfast spot in New Orleans for the days you don't want to start off your mo","useful":0,"cool":0},"hswv8bE51fuMg2GoNt-BjQ":{"text":"I love this place! The food is very affordable and tastes great! The best part is the staf","useful":4,"cool":4},"bvelr9wfxcU6hsS-ElKEOw":{"text":"In town for the weekend and this place is across from my hotel. Great service and food","useful":0,"cool":0},"EepTEA8tfSyhjY7yFPALRw":{"text":"This place made the best cappuccino I've ever had.  They have a small menu consisting of s","useful":1,"cool":1},"OQmH8RUUbDGT6Fweim4jaQ":{"text":"Very unique, stylish creperie/cafe in the heart of downtown New Orleans. \n\nIf you are tire","useful":3,"cool":2},"3ytTlojB8lglaH1u2AF3Jw":{"text":"Spinach + Goat Cheese + Fig Jam minus the turkey, it tasted like lunch meat...otherwise de","useful":0,"cool":0},"c60WttCh6JBMdw4ui900Gg":{"text":"I was SO tired of fried food!  Then I found Merchant.  Had a wonderful salad in a quiet en","useful":1,"cool":0},"QL6-NdLyKqYVG4dn0WZJkg":{"text":"I was in town for a conference and ended up eating here 3 mornings in a row. The food is d","useful":0,"cool":0},"R4MGIA-nhjiC-v3c2bZvhg":{"text":"Awful service... they forgot our last order. People who work here have no efficiency. They","useful":0,"cool":0},"ErvRfZL1ElQHGxYNFdEnDQ":{"text":"Set in the lobby of an apartment building. People walked pets right by us as we were eatin","useful":0,"cool":0},"ecOMuprAmG9yTP8F3IcsFg":{"text":"The food was pretty good, but you can't beat the atmosphere for a quiet calm breakfast in ","useful":0,"cool":0},"5v1yMhM9FTKkabeYn3NJ9w":{"text":"Awesome little place, I wish we had one back here in Philly.  Cappuccino was really good a","useful":3,"cool":2},"ahfWwcQbM_20DCjkisPq2g":{"text":"Excellent coffee and sandwiches. We had the figamajig and the veg on sprouted bread. Delic","useful":2,"cool":0},"z-m4qXXPnCV7pzTMTD2PRA":{"text":"Great breakfast stop with fantastic coffee.  Peaceful oasis when you just want to ease int","useful":2,"cool":2},"5VMqP8PoXG45pCukmwMCJw":{"text":"In all honesty, I am a bit on the fence about Merchant. It's a bright, airy spot to have b","useful":0,"cool":0},"y77LimUN-KXJk4dJdjXZsA":{"text":"My first stop here was a requirement to life. I was about to pass out from being awake too","useful":7,"cool":6},"-yMSYD0iPnr77xRst3IKpA":{"text":"GREAT coffee shop, good food. A nice like reprieve from the disgustingness of Bourbon Stre","useful":1,"cool":0},"jcJuQ2QsG0bkMGvwNrpL3A":{"text":"When in New Orleans and looking for the perfect birthday breakfast which isn't over the to","useful":0,"cool":0},"1hp4Mi049ZXCCn115H2QFA":{"text":"Great coffee in an ultra modern, almost antiseptic space. Seemed more like a San Francisco","useful":0,"cool":0},"KGIKtuErC5KbRaViE26CMQ":{"text":"Coffee was good, although the girl in dirty shirt ( I called her \"butcher's daughter to my","useful":0,"cool":0},"X9afaYYVw-LvCaMzTRBZag":{"text":"I came across this little place for lunch on a cool winter day. While most of the cafés ar","useful":0,"cool":0},"paBEqSW-G8QHY2xrr6yyLw":{"text":"Eww do not get a matcha latte from here. It's disgusting, pre-made culinary dark green goo","useful":0,"cool":0},"On9N1D1nZLcbad2gea4rSQ":{"text":"This is fun little breakfast/brunch spot. The creepes are delicious and perfectly made to ","useful":0,"cool":0},"tzFCmLfLiGLCGz6dWqQWkw":{"text":"Great find! I am a fan of illy coffee and was happy to see that they served it here. My si","useful":2,"cool":1},"DxXtdyBF9LkBS79BaeFG8w":{"text":"They were out of salmon when we dined here, so perhaps my disappointment with that colored","useful":0,"cool":0},"Mf-bZhpvcBKA5sOAXMFwnQ":{"text":"Great healthy food and nice service\nBeen looking for a healthy nice breakfast place and fi","useful":1,"cool":1},"w9bu2K7BPSeLqL4eHIDrdg":{"text":"We were hungry for creperie and this place had great reviews on yelp. It was close to our ","useful":0,"cool":0},"pd3iDoML1GRvQLIeYp6yuA":{"text":"Coffee was excellent. The veg breakfast sandwich was also quite tasty--though I found out ","useful":1,"cool":1},"WtErMBEqjteRd0VFiYTGOw":{"text":"Disappointed in this place... I had high expectations because of the reviews and 4 stars a","useful":0,"cool":0},"8iB7eAPAMLERf1m4JYFm1g":{"text":"Loved it. Cool art, great food, reasonable price, delicious coffee. Trendy but not rude.","useful":1,"cool":0},"0QINneOboM_uGdhwat7FrA":{"text":"Exceptional coffee in a really cool atmosphere. Immediately upon entering Merchant, you'll","useful":6,"cool":6},"eFwGd_8YxljaPR5osmgZaw":{"text":"Love this place.  Fun, clean and healthy!  Amazing coffee:). Try the breakfast turkey and ","useful":1,"cool":0},"EFLnHmtwp5HHalHBMJsEjg":{"text":"Winter (server) is super friendly and nice. Food is fresh and delicious. Stayed for four d","useful":0,"cool":1},"GRBm-Flux2X81hvNzNDRNQ":{"text":"Friendly staff,  Fantastic crepes (I had the turkey was the best and most creative crepe I","useful":0,"cool":0},"GbTq4KxWa_Et84ysUqAIpQ":{"text":"Staying at the Renassaince across the street and yelled gluten-free options. Pleasantly su","useful":1,"cool":1},"hM57sEDfHkIBjtX8YPZUyA":{"text":"Great spot for a quick bite!  I had the fig'ma jig breakfast sandwich, and it was really t","useful":1,"cool":1},"b-LsF0PqIqAaMevucjzcSg":{"text":"After posting my initial review where I gave them 1 star, I showed up to work 12 hours lat","useful":4,"cool":5},"95kJ4Rfm4BpJxMu3WlAopw":{"text":"Aw man this place is incredible.  The staff helped us plan our week by recommending places","useful":2,"cool":4},"ODkEVtk80X5Fcbr4ycDVpA":{"text":"Apparently, their chai is the only chai in the city that is made in-house. It was decent a","useful":6,"cool":4},"6gcU3OAZPuakEWpTAzLNMw":{"text":"came back, had to have the turkey one more time.  Had the turkey sandwich,  Stll very good","useful":0,"cool":0},"lRL7DSK7sHKllIjc5zkVLw":{"text":"Delicious. Loved my crepe with turkey and figs. Expertly crafted cappuccino!  Clean and co","useful":1,"cool":1},"rV1jsxRadFbASh6FkCxbhw":{"text":"Oh my! How I love this place! On looks alone it gets three stars, but the food. Oh, the fo","useful":2,"cool":1},"fUFbq2DAClQU-RhPRFaGFQ":{"text":"I got the Tempesta which is like a frapp and goat cheese salad. The Tempesta is sweetened ","useful":1,"cool":0},"-PMPSD293npVUedFw8mnpw":{"text":"This is my favorite coffee shop in New Orleans and def in the CBD.\n\nGreat food, amazing co","useful":4,"cool":0},"tZmi81oPOtv69nYln7KyBg":{"text":"Was excited about going based off great reviews. Ordered a French press and a panini. The ","useful":0,"cool":0},"u63VTedEh8ScvyAXkpjjDQ":{"text":"Happened to stumble on this hidden gem on Mother's Day while trying to find a good brunch ","useful":1,"cool":0},"TTZU5rT2AlcVBq5HOT-eWg":{"text":"Banana and nutella crepe. Made to order in front of me. Need I say more? Okay, so I will. ","useful":2,"cool":2},"ByvC-di2jvlJ2Xz5irROOw":{"text":"European vibes, delicious food,\nand awesome atmosphere. The Cure crepe was absolutely phen","useful":1,"cool":1},"nuraiuDrSUXc1fdfW9daBQ":{"text":"Excellent crepes and sandwiches served on a baguette. The baguette is the real deal. This ","useful":0,"cool":0},"jf1tf8AcoyMK3hMqfJmwZg":{"text":"What a cool spot.  Crepes were tasty and the Illy coffee was simply fantastic.  I was most","useful":2,"cool":2},"dVYi9bHL_vNMdCn9bMalHQ":{"text":"Last time I was in New Orleans, I visited Merchant at the strong recommendation of a frien","useful":5,"cool":3},"O5EBpsNWEIlHucmyfKXk1g":{"text":"Pretty disappointed by this place, the food was very average at best but the real problems","useful":0,"cool":0},"YNPUA88MKIG1XOODunLLQg":{"text":"What a great place! Delicious food that tastes light and fresh! Loved the turkey crepe. Pe","useful":0,"cool":0},"cHymAv1AxxExsrtydgH_GQ":{"text":"Lindísimo y moderno café en pleno centro de Nola.\nEstá en el lobby de un mega edificio de ","useful":3,"cool":4},"uso14SJ7kSppK1wHLk9Bow":{"text":"Loved the yogurt, berries & granola!  Plus the French press coffee was smooth & flavorful.","useful":0,"cool":0},"cplgnUmwJg0LT7hEg0KypQ":{"text":"We were in New Orleans for business over the week and pleasure over the weekend.  Being ti","useful":0,"cool":0},"0x9CFaqZ6Vt34aRZ4Hlz7A":{"text":"I love this little cafe.  I stop by every month when in town on business. Great coffee and","useful":4,"cool":2},"6PbPgWhl5bzFRIKgn4aPWg":{"text":"Enjoyable! Got the Fig-amajig (breakfast sandwich) and a green tea iced latte (which was m","useful":1,"cool":1},"_WihVGVK0FxJ4478dUBaxA":{"text":"Friendly staff, great crepes especially the Nutella/banana. Love that the savory crepes ar","useful":0,"cool":0},"63X3jdak0YbNbvpUv_aE5Q":{"text":"The food & drinks here are fabulous! I ordered the turkey & fig crepe, which was amazing. ","useful":0,"cool":0},"nMpuxYU9b0U_qtPp470zVA":{"text":"Beautifully designed European cafe! Stopped in for an iced cappuccino (perfectly  made wit","useful":3,"cool":0},"FPxkn3tcN4cifvgk2cVU6g":{"text":"Great breakfast/brunch spot. I got the crepes with Nutella and banana and it was delicious","useful":0,"cool":0},"_D1XteGgZgvHFEynpbACew":{"text":"Right by Wyndam Garden on Baronne which is where we stayed. Both mornings we took a mornin","useful":1,"cool":0},"QJsJQy9H27OP8i-E9EwYFg":{"text":"Wish there was on option for zero stars. Initially excited to see a coffee shop serve Illy","useful":1,"cool":0},"A9NF9cIZokAMkFqKMdSKmw":{"text":"I cannot believe what a pleasant lunch I had today.  Merchant, thank you so much for the d","useful":2,"cool":2},"SRcL6K-S2MCgpSksgbJprA":{"text":"Good coffee. Very very poor service. The people were not friendly to 'first timers' wanted","useful":2,"cool":0},"c3aOvZRhKoU0NJ_ZwPVFxQ":{"text":"from Seattle looking for a cute breakfast place for a quick bite and great coffee. This pl","useful":2,"cool":2},"D5KuYZ_hljVp3QpMSsRfDg":{"text":"Amazing spot! Great decor & ambiance. Highly recommend the mia copa croissant: eggs, spice","useful":2,"cool":0},"Wxf_tVjyRYoMjUGiEkpjyw":{"text":"Awesome Crepes!  Very modern and urban feel to the restaurant.  Crepes and coffee were ama","useful":5,"cool":1},"86KIwLb0zrD4TUjp1uTBTw":{"text":"This place felt like a little bit of home (Los Angeles) while roaming the street of NOLA. ","useful":2,"cool":0},"vIVEkO0vycTFkhbVyZDumA":{"text":"I am a coffee head yes indeed. I knew I wanted to visit at least one place in Orleans. Thi","useful":0,"cool":0},"vsVwFwyKto7wwgEhwVgeDA":{"text":"We had breakfast at Merchant and it was great. (It was not super efficient service as the ","useful":0,"cool":0},"dgTUAbNyEWjYdqUIUKgs-Q":{"text":"No wait, service with a smile. Strong coffee and savory breakfast sandwich. Delicious way ","useful":0,"cool":0},"rNRbuMyxbWb5A2qrdH2m2A":{"text":"Los Platos estában sucios , Lucian grasientos , la presentación muy mala , deberían de ofr","useful":0,"cool":0},"OFjAUSqKQkGJYonjQAwXJg":{"text":"I had the good fortune to visit New Orleans this past August, staying at a great hidden aw","useful":0,"cool":0},"DoRA7PSte8XgsSn7zLGmNw":{"text":"I can say that I more than enjoyed eating not just breakfast but also dinner all in the sa","useful":0,"cool":0},"7_32U81e16yfEV0Hso7-Sg":{"text":"We only had coffee here, but it tasted a little burnt. Cute on the inside and heard the fo","useful":0,"cool":0},"MTSaJjbcCByGgZ0pBh6kMw":{"text":"I stopped by this modest Café before an interview. The coffee options were reasonably impr","useful":0,"cool":0},"bbeg_RQn70zW9O9Dzk-dqA":{"text":"Friendly place that is serving fantastic sweet & savory crepes. Came here with a reasonabl","useful":0,"cool":0},"YoPw6HI0X00Mrpmzq8zX7w":{"text":"I wish I had found this place as soon as I arrived in NOLA. Go here. The food is fresh and","useful":3,"cool":2},"2uG8m8636Yhc93wycbCkfg":{"text":"I went in and sat at counter and watched four employees ignore me. After three or four min","useful":0,"cool":0},"LSUiA3SjtY1-WhMWlafvpw":{"text":"It's too bad. \nThe place has a great ambiance and illy brand is very good. \n\nThe croissant","useful":0,"cool":0},"97AceDiPVbL89wvZA4Qd2A":{"text":"The tempesta was good but VERY sweet - I would ask for them to make it with half the sugar","useful":0,"cool":0},"QVcqFVwhRXqfv4ugDmfLgQ":{"text":"Husband and I ate here three of our five mornings in New Orleans, so hopefully that speaks","useful":6,"cool":8},"2mjPpQAF163YyZIlWvok5g":{"text":"This restaurant was right across from my hotel, so we gave it a shot. Clean, new-looking a","useful":2,"cool":1},"EBjqz1Nnqp3cSPrlrKVgdA":{"text":"Anytime I travel, I always scope out the local coffee shops, and definitely make a special","useful":1,"cool":1},"p_r8t6hok88FR3AEdBwcwA":{"text":"Great lox panini and LOVE the Nutella/Banana crepe- coffees are highly recommended also! Y","useful":1,"cool":1},"cal7iUOO-JR-6vQWytWM8A":{"text":"Crispy, fatty chunks of salty bacon (strewn about so liberally that many morsels littered ","useful":10,"cool":5},"iqhRtfOl3GhsevkLC0NF0g":{"text":"Grabbed a quick bite here with my sister this morning. Had the \"Prosciutto\" crepe with pro","useful":1,"cool":1},"s1a939UXLMo1g5So6-qjug":{"text":"good place to work during the morning rush. free wi fi is a definite plus.\n\nas it comes of","useful":1,"cool":0},"s3WVMJk2Ork5NFUxZqg_pA":{"text":"Not a Louisiana traditional place. It's quite, clean,  and bright. I ordered the fig'a'ma'","useful":0,"cool":0},"rinVrmx8gvlYCJ6xivd6tA":{"text":"Great place. Very clean, modern place. The crepes are delicious!  Having gluten free optio","useful":1,"cool":0},"Z2MitaTPjbVafpEivBLytQ":{"text":"Coffee excellent.  Sandwiches delish.  Slowest service in the world.   Ordered 2 coffees a","useful":1,"cool":0},"kBvn9Dkfr99xIORb9MZpzw":{"text":"Visited here 2 times during my stay in New Orleans for breakfast.  The food is very good a","useful":7,"cool":3},"bHNtfYkWi-MBc1wGBzTJVQ":{"text":"Food was well prepared. Staff was nice. Just wish there was table service. If there were, ","useful":1,"cool":0},"bHqKRyBy5xALn5gyuNVJNQ":{"text":"I have been dying to try this place, and I just so happened to be stuck in the CBD this ev","useful":4,"cool":3},"rbePJ5JYU-8A6jJbuWFeOQ":{"text":"Great service + incredible ingredients = an awesome experience!  Winter is so much fun to ","useful":0,"cool":0},"5DhM64tBKcFs3VWXBaCgQg":{"text":"Beautiful clean design, convenient for downtown, would be great for early or afternoon bus","useful":7,"cool":3},"E8jam8NfSYyjbgJHIsohWg":{"text":"This is such a great lunch / brunch place for the area. Service is amazing, atmosphere is ","useful":4,"cool":3},"qkxmrDrl6XEv57wqpEcWRg":{"text":"Hilariously chosen by my friends parents from Yankeedom (after I'd labourisly listed sever","useful":3,"cool":3},"M-_k07sdKPAD2qXUJcLZYg":{"text":"I love this place. Coffee, crepes, sandwiches, and a very clean and bright environment.  T","useful":3,"cool":3},"7B9zuUOjJzhOZvmuPv-l5Q":{"text":"Looking  for a strong coffee? This is the spot. Don't be discouraged  by the line, it move","useful":0,"cool":0},"H_D7JZoCmfCE_AJawRGEqQ":{"text":"The turkey and egg breakfast was nice and tasted great. Why the two stars? The staff was r","useful":2,"cool":0},"qG4HaypznGjay6sb4OqY5g":{"text":"Great atmosphere with friendly/quick staff and good coffee. Good study spot","useful":0,"cool":0},"gOSMRiF1OLt2Bfu0upJ7GA":{"text":"Coffee and chai = 5 stars.\nAmbiance = sterile like, euro sterile with really comfy bar sto","useful":1,"cool":0},"NY9YDaNxRtqQN4oBa8Lnwg":{"text":"The place is very modern and clean. Good place to work if you are a freelancer like me... ","useful":1,"cool":0},"7yXUkCmZgNMUXUrOn1HEig":{"text":"Best coffee in the city!\n\nGreat staff and it has been nice to get to know the 'regulars'\n\n","useful":1,"cool":1},"oy8VBP-B_VZTrlwN-dedDg":{"text":"Yummy food. Strong coffee.  We went twice on our long weekend trip to NOLA.  The crepes we","useful":1,"cool":1},"-uFniiHqu5TupwJorBVg4g":{"text":"Prosciutto press and rose lemonade ate amazing!","useful":2,"cool":2},"VROD0iLe-Hmh5q_xM7DkGw":{"text":"I was here during mardi gras weekend and had the pleasure to be right near this awesome sp","useful":1,"cool":1},"YdJG5ut724GsBfbSkxOEsw":{"text":"Awesome place!! I was so excited to find this place. \n\nI've now been here a couple times a","useful":0,"cool":0},"biYwZux5OLr8zyMqufXw-A":{"text":"Fabulous coffee and super tasty breakfast or lunch sandwiches.  Crepes nice and thin with ","useful":0,"cool":0},"XfPnMDmQzp7W0jbJ2aXe9A":{"text":"My friend and I were going to try on bridesmaid dresses and the original brunch place we w","useful":0,"cool":0},"R5UzGr2jnAqsdr8d7sGBQw":{"text":"I came across Merchant while browsing on Yelp for a craft coffee shop while visiting (whil","useful":0,"cool":0},"1gxpw9vdUVu-d2p7Q5rhiA":{"text":"Nikos should be goddamn running this whole place. What an angel in a devilish disguise!","useful":0,"cool":0},"D-nWhaGEGJowLkU8nzR69Q":{"text":"Excellent customized crepes, staff is great and manager is too! Great music and great coff","useful":1,"cool":0},"PgV-qVrnhVQf0iFvnM173A":{"text":"Food, service, music all excellent.  This place hits the mark for a quick no nonsense crep","useful":0,"cool":0},"1G2Jv2xgqpPIbO1gJiuhTA":{"text":"Absolutely loved this place.  It was a little pricey but well worth it.  We got a nutella ","useful":2,"cool":0},"Fwb0a7T7T9PIKJ_rKD8C4Q":{"text":"Very cool little spot with a unique menu of gourmet crepes and press sandwiches.","useful":0,"cool":0},"Y_Gwi70bEyG3LhKt0q2AOA":{"text":"Delicious! One star knocked off due to limited seating & lack of juice options. The turkey","useful":0,"cool":0},"8dOwXvN0fwlblzsXCQrwsA":{"text":"Merchant's was recommended to me by a good friend who's been a Nola resident for 10 years ","useful":0,"cool":0},"9ef5QYIHom4x1M4T4G-YnA":{"text":"Very nice design and friendly staff.\nWe went for breakfast and the coffee and the sandwich","useful":0,"cool":0},"4kfkSpJ2Xl7VfXFIej_Vtg":{"text":"Got there 10 minutes before they close for a \"to go\" salad and they had decided to lock th","useful":1,"cool":0},"LptmwmRkHLz1GcZRUCrr-g":{"text":"Yum! Casual, modern, fast or slow depending on your needs. Eat in or take out.  Illy coffe","useful":3,"cool":2},"8QK7lw1zOL_F_E1adK4fVg":{"text":"Savory crepe had barely any goat cheese, and onion, with bad prosciutto-like ham (overpric","useful":1,"cool":0},"-VQ-xtQH4azKws0ea-1sMw":{"text":"Excellent customer service, delicious food, expertly made espresso drinks.\n\nI'm 8 months p","useful":0,"cool":0},"i1NmwyCucksyeHBKH73cgg":{"text":"Best breakfast around, specially for the one's avoiding pancakes, bacon and sausage. Food ","useful":2,"cool":0},"f8B1YtigcJpiWgdaOa8ZIA":{"text":"Perfect coffee stop around the corner from our hotel. Staff is so friendly and everything ","useful":2,"cool":1},"vEjxuN1LYzwrf9MWQW-MCQ":{"text":"Pretty trendy spot with some of the freshest coffee I've tasted. They grind it the Illy ri","useful":0,"cool":0},"siGz77ZATnJ8n9GvyFbejA":{"text":"Great coffee! Great food! Friendly people! This place will not screw up your morning.","useful":0,"cool":0},"KnyGt8deSgXykgEmAXBdzA":{"text":"I had some time to kill so I walked over to Merchant in the rain-- it was the highest rate","useful":2,"cool":0},"tRq9cObiks26z4a7-jSEyQ":{"text":"Fantastic coffee and great food. Best breakfast we've had in New Orleans. Any Kiwi or Auss","useful":0,"cool":0},"Dl_FsiA0u2SAUQV213hGwA":{"text":"Great breakfast, good service in a modern atmosphere! I really enjoyed this little cafe. I","useful":1,"cool":1},"LHEqL7nR7KDCkhIRpMc5jA":{"text":"Finding good coffee (i.e. European style) in the US is a challenge but this little place i","useful":1,"cool":1},"b1fPNllDhepMOnxNmiSwkA":{"text":"Really delicious and filling crepe of speck,  goat cheese,  egg,  and onion. Really cheap ","useful":1,"cool":1},"u-iXyvmSeEjlH7cCf5fCnQ":{"text":"Great coffee, fantastic simple fresh food. Well worth dropping in for breakfast.","useful":1,"cool":1},"mnmGh9YzqigGNx19UUsbHw":{"text":"This is my new favorite place. I got the Turkey and Fig crepe, which came with a small sid","useful":1,"cool":0},"nesnRyML_sW7RfyS8Zqxgg":{"text":"Fast and easy to grab when you are rushed.\nLoved the decor of this place and the staff was","useful":0,"cool":0},"m8E4CAQ1akZwcEnt20EgtA":{"text":"My wife and I were fortunate enough to discover Merchant on our first morning in NOLA, and","useful":0,"cool":0},"YYiS9DGgTF_ytiYwF9y-qA":{"text":"Great breakfast and coffee bar. Love the feel of this place fantastic crapes and Winter wh","useful":0,"cool":0},"pxpe77SjlYr91OyFolBxuw":{"text":"The food is ok. The coffee is meh. However the most disturbing issue is that the dishes st","useful":1,"cool":0},"iPHmCOu6WkXuEWruqNAw9Q":{"text":"While I loved experiencing the local flare of NOLA, Merchant was a much needed and appreci","useful":4,"cool":3},"1JpocTy5csX_XMlKgOBMdQ":{"text":"While visiting New Orleans, we were looking for some healthy and clean food and came acros","useful":0,"cool":0},"NTT71gWOzUt-8VI3VXVWuA":{"text":"I was looking for something light for breakfast but yummy. I had the loxsmith crepe with s","useful":0,"cool":1},"mj76wVm4R_eqZ7YeLm8RPw":{"text":"I got a vanilla latte and the fig'a'ma'jig on a croissant, which was the best breakfast I'","useful":1,"cool":0},"U_6oFV-G-LtJRRFttB4GwQ":{"text":"Euro-chic breakfast and brunch just west of the French Quarter. Just a counter and some ho","useful":1,"cool":1},"YmUHjh6EseqGFKVdetRB4g":{"text":"Nice interior, however their pricing is a joke. They charged $2.75 for these Grey Ghost co","useful":0,"cool":0},"BF1oVLtTkTYWuqTwYYLDPA":{"text":"When pure passion and wonderful people come together you get a place called The Merchant! ","useful":2,"cool":1},"Ldyqf09HIyzxoHB7PGMzIg":{"text":"A little pricey, but the quinoa kale salad was a nice change for breakfast.  Bright, moder","useful":0,"cool":0},"_CmeH1gHOVNxz1WcSimMcg":{"text":"As a self proclaimed coffee snob, I'm hard to impress but this was the best coffee we have","useful":1,"cool":1},"mtS9EoY-Ugt0EauM1-gO3g":{"text":"Food was delicious. ....good assortment of healthy and not so healthy breakfast choices...","useful":1,"cool":0},"9BmXuxDiZTgmz95qwNvKpw":{"text":"Amazing place!!!! Fresh fruit parfait bowl is so refreshing. Get it without the honey.   T","useful":0,"cool":0},"ozBuhnkyLAKTzdCWcDogSw":{"text":"Very modern and very \"up-scale\".  Very close to our hotel.  It was very clean, very friend","useful":1,"cool":0},"w6DWH1llyWxmux9_gqZ7mg":{"text":"So much good comes from this shop! Two co-workers ordered an iced cappuccino, which might ","useful":1,"cool":0},"5cO52Y3uvf0ml3VgV695hA":{"text":"I got the Egg + Speck crepe and my husband got the Biscoff. They were wonderful!! And the ","useful":0,"cool":0},"fnt0oZjtyqykriWRaEmgVw":{"text":"Really good nutella crepes. \nGood cappuccino drink.\nNice place to study, especially the ba","useful":2,"cool":2},"Eut3I9QDJ1KQeEerv9CAwg":{"text":"Yelp said they close at 5pm on fridays their website said they close at 5:30pm on fridays ","useful":0,"cool":0},"2brAwe2YgNEaDJzisVyAVQ":{"text":"Great little place in New Orleans. I came in while I was here for a conference nearby. The","useful":0,"cool":0},"stJ2jJZ-OJSga8hW7K9uEA":{"text":"I'm at the hotel around the corner for a meeting.  I decided to venture out for crepes and","useful":1,"cool":1},"Xp4kqkNS2Yw_vxuBjGpuag":{"text":"Prepare to be..whelmed. Foods not terrible, not great either, just kinda is. Also the serv","useful":0,"cool":0},"1UHqDffM7pdTRJnVu4OIxw":{"text":"Finally a decent coffee shop that serves real coffee.    Europeans & Antipodeans rejoice a","useful":2,"cool":1},"XLZQ0IbY5MPzo2OnLZy5wA":{"text":"The cinnamon apples in the crepe was undercooked and the crepes themselves were quite thic","useful":0,"cool":0},"qoLqIzPx8hM5A6ogoZvvcw":{"text":"This is a cute little cafe tucked away across bourbon street! A few friends and I are stay","useful":0,"cool":0},"QsOXTNYJFOCcddYN0QnsGw":{"text":"Oh my freaking goodness.  Quite possibly the be all end all of cafe/wine bars/creperies.\n\n","useful":2,"cool":1},"Feqpydk51YgB0eLpE3VSEw":{"text":"Great stop for fresh brunch. Clean and modern place. Go early because once they run out of","useful":0,"cool":1},"80CR7E75iMHig9onnNGNAg":{"text":"I have my favorite coffee shops in town in which to sit, socialize and/or work, but I can ","useful":11,"cool":5},"c1lFFXdOCsOkPk5ZNPJQlw":{"text":"This place is fantastic! I've tried many things on the menu and never had a complaint. The","useful":3,"cool":1},"pCaJBlrwNQ_GsEIeHM2UvQ":{"text":"See my comments.  A really exotic take on fine dining.  Delicious food, great service.","useful":0,"cool":1},"oMstaF9jTzI_wdzh3QASlw":{"text":"Delicious crepes with gluten free options! You can see them making everything. This place ","useful":0,"cool":0},"uKSukNj0bSXRiXA-XiYVcw":{"text":"I fricken love this place. The atmosphere is lovely, the service is great, and the crepes ","useful":1,"cool":1},"dHnXWQrxQF41jj-VTUcKTw":{"text":"Merchant is fantastic.  Great food....they even customized a sandwich for me because I cou","useful":0,"cool":0},"PAbDpwlWREgB72wqNAMU3A":{"text":"I stumbled upon this café and got a crêpe but I had already purchased a coffee from Starbu","useful":0,"cool":0},"-A9P68ow0Xr1cVjuJyFHnw":{"text":"Hipster coffeeshop (with wine) in CBD - it looks like it's out of a Scandanavian design ma","useful":1,"cool":1},"Y0vj1R6ZZGlYn1Ro4I9Qug":{"text":"Okay, today was my first time here and the experience was less than stellar. However, they","useful":1,"cool":0},"o7jyefOOEnUJO7EKiroMKQ":{"text":"Cappuccino was really tasty and so was the pancetta croissant i had. Bar stools at the fro","useful":0,"cool":0},"DdL0HN43kaDGwKyEvUXiIA":{"text":"It took me two days to finally try something relatively healthy for a change (love the foo","useful":0,"cool":0},"qrNuUL1euDBHLsKKHu8how":{"text":"Quaint coffee place with homemade food which was outstanding. Went here twice for breakfas","useful":2,"cool":0},"N3W9AHg7Hvbc09y3uZ44Hg":{"text":"what a great coffee place. I am not a coffee drinker, but I am a big tea fan. My boyfriend","useful":2,"cool":0},"tLL44cqXF21zcv_zq7EnGg":{"text":"I was in NOLA for a few days, and after reading reviews, I had to stop in. My friend and I","useful":0,"cool":0},"X3NiFMWb4nOgQDKh9jDETw":{"text":"Good food \nEvery things in white \nStting aria soo small\nThey but more tables in building h","useful":0,"cool":0},"BUSq_EF-0l00lUDjKhFe0g":{"text":"When  you need a break from deep fried NOLA, this  is a great place  to stop. I went for t","useful":9,"cool":5},"PRFphHg53pv-kBzpZjSKEw":{"text":"This place is a little off the beaten path but well worth the visit. The Fid a jama egg sa","useful":0,"cool":0},"wb-wgwX81v_Hc3e-A9aI2g":{"text":"Sadly this was a waste of a meal in Nola which is such a great foodie city! The crepe was ","useful":0,"cool":0},"6yNfD-MiUr0XRUjX1Xvh8w":{"text":"Food: good, healthy and fresh. Good crepes and sandwiches \nCoffee: illy \nService: friendly","useful":1,"cool":2},"Mme5mp_6CTbgaxeiI2rxxQ":{"text":"Great capuccino! The best I had in NoLa, and I'm an aficianado. The figamajig was also gre","useful":0,"cool":0},"X4hz2olQMb_x_jtnKe7gdw":{"text":"The coffee is good, however the service really lacks. Forget ordering any food that has to","useful":3,"cool":0},"HoSW51nFNdnuAyzV748gpw":{"text":"This place is something else - an oasis of modernity amid the old fashioned grittiness and","useful":3,"cool":1},"P6FILDnk9WY88feOfoKMbw":{"text":"They have good coffee, crepes, and service. This clean modern shop was close to our hotel ","useful":2,"cool":1},"Th7Q0Iy4X5yQNY9hjX3GLQ":{"text":"One of my new favorite places for coffee. The place is beautiful and inviting, the coffee ","useful":2,"cool":0},"EWuzj8rYk1Fc3vcGijC8Yg":{"text":"Nice coffee & lounge spot in the CBD. We had a meeting in the area & needed a place to rel","useful":3,"cool":2},"dGlLtE-leiOegMJBpOldeQ":{"text":"They are known for hot crepes and yummy french bread sandwiches. I've had the soup three t","useful":2,"cool":1},"WOK3ni4jDY5IvbFuoblTZw":{"text":"A little different than the usual Nola cuisine, but maybe something to set the bowels back","useful":0,"cool":0},"QL093hRyaf1jbInePxabVA":{"text":"Great coffee, Merchant is a nice NOLA java break... They push the crepes but IMHO a town w","useful":0,"cool":0},"I_AHOcX8-7IIgAqPMB32ww":{"text":"This place is not deserving of a 4.5 if you are looking at more than the food.  The pancet","useful":2,"cool":0},"BLnHSkVzUphl6vTFL6AfUQ":{"text":"Great place fir breakfast, lunch ir brunch! The crepes are bug and delicious, coffe superb","useful":0,"cool":0},"GU2cNTyRaWYz2f6s1SAzyg":{"text":"This place has such a relaxed vibe. My latte was good and I had the egg quinoa breakfast b","useful":1,"cool":1},"_2OJgwV104HSii__KvL8EA":{"text":"I am so happy my hubby is a seasoned yelper and found this place. What a gem!\nWe went for ","useful":2,"cool":2},"lI8KjWGlXdU-G4vivZ8irQ":{"text":"A modern cafe with great coffee and lots of seating! Definitely not cheap though.\n\nThe col","useful":0,"cool":0},"kXpDmmIzk-1VNt3JWSn9tw":{"text":"An ultra-modern, Eurostyle crêpe cafe downtown. Not a very comfortable atmosphere to kick ","useful":2,"cool":0},"W7Ro8fX7wXtkSxKXsqx86Q":{"text":"Good place for a quick breakfast.  Parfait had virtually no yogurt. Don't be surprised if ","useful":0,"cool":0},"lYGilgvsQc3jxsXdx9ocDg":{"text":"This is a great breakfast or coffee option in downtown.\n\nAtmosphere is modern, almost Scan","useful":1,"cool":1},"yDpsxHT2dpBkAPFP6V5h4Q":{"text":"If you're looking for European style modern cafe, this is the spot! I was dying for some f","useful":0,"cool":0},"Hmr8qpcg-YqfEio715-Rdw":{"text":"Thank God. I've been in NOLA for a week and forgot what produce looks like from all my del","useful":0,"cool":0},"WpUifcTTl4m2EGQL_SKYAg":{"text":"Modern. Clean. Fresh. Comes to mind when describing this place. It has a great contemporar","useful":4,"cool":3},"uE3G7XUSJb7Gvb73hgAfyQ":{"text":"What a hidden gem of a coffee shop.  Very friendly staff, great coffee, pastries and crepe","useful":1,"cool":1},"Pz7gsMZyexh7CjZrbytGQQ":{"text":"We were in a rush to grab something quick before a morning tour..  The food here was a ple","useful":2,"cool":0},"9U_VPYI4OiLvChzY0dSZsg":{"text":"Went on a quest for crepes.  That is all we ordered.  The place is very modern and reminde","useful":0,"cool":0},"tbm4PAxDx2yZwPe5HB1lJQ":{"text":"Nice cute place. Quiet. Staff not very friendly. Ordered off the ciabatta menu... no ciaba","useful":0,"cool":0},"xLephzEGExi_ugo1Qp-9Tw":{"text":"I love this place. We come every time we are in New Orleans. Their sandwiches and  granola","useful":2,"cool":2},"RL9e3vZJ6fOQ8vR8asAh-A":{"text":"We were staying in the area for a week. I came to Merchant every morning. By day 3 they re","useful":1,"cool":0},"Mcb5qaKiA7U9Kxdccsxa-A":{"text":"Cute coffee shop in the central business district of NOLA.  I visited while killing time b","useful":0,"cool":0},"i6dMF8vqCB39-V1NdKDLbA":{"text":"Boyfriend and I came here for our last meal in NOLA, and I liked that it had a communal ta","useful":0,"cool":0},"9rcmdyCZ1DLFUbH7pQQX_A":{"text":"Good coffee but food wasn't all that great. We had ciabattas and the bread was cut extreme","useful":0,"cool":0},"o2atq8eJF6PyOC3oaCZ0yQ":{"text":"We tried to go to Merchant but they had closed randomly for the summer (no notice, no voic","useful":0,"cool":0},"WC47wUXUUkYZd_Jo_DtLsw":{"text":"Food is ok and latte is really average. Thai location located at common street not a very ","useful":0,"cool":0},"_RudenKDf9a7B434ltDgLQ":{"text":"Excellent coffee, excellent breakfast.  I had a lemon and sugar crepe, hubby had a ham and","useful":1,"cool":0},"5aOsJR4hR9nVJr6DGEI5FA":{"text":"Was in NoLa for a conference during November 2015 and asked my hotel staff for recommendat","useful":2,"cool":2},"_lOYykvc9ZC6jeY85xGpKw":{"text":"If you like Crepes, you'll like this! They've got a wide range of excellent crepes that do","useful":3,"cool":1},"j-f4PerNlwgoFnr0XGu5eg":{"text":"Pretty good place if your looking for breakfast/brunch. Very modern and clean. The sweet c","useful":0,"cool":0},"3bH6S4ezKd8MAB_RCX23fQ":{"text":"A pleasant find walking to and from Bourbon St. and a nice break from all the rich foods N","useful":0,"cool":0},"qnmFT_bjAeYFlp4IxTnIRg":{"text":"A great little find. It was wildly busy but the staff was hopping and pleasant the whole t","useful":1,"cool":1},"zLjC2cgwiSZ_uRl7EJ5Zxw":{"text":"Beautiful place! We were staying at the hotel in front and went there for breakfast. We go","useful":1,"cool":1},"0HFb1JZYvn35dF5Atvk8lw":{"text":"I love this place. I come here every time I'm in New Orleans. My favorites are the banana ","useful":1,"cool":0},"c29ujYVqQdCilrt0MMKSRQ":{"text":"This place is great! My husband had celiac disease and they were very knowledgable about i","useful":0,"cool":0},"a93CLP1PfRPLkUHR8JTTfQ":{"text":"This is a fantastic, friendly, warm, and non-intrusive location for breakfast, close enoug","useful":0,"cool":1},"SCl_whaFQEuyNcWo7vyoow":{"text":"French breakfast. Crepes,  espresso unique sandwiches. Cool, modern atmosphere. Staff was ","useful":1,"cool":1},"93HMBzG21yEg7Sj9I7lM2A":{"text":"Visited during the second week of Mardis Gras and had a nice meal at the counter while lis","useful":0,"cool":0},"lpyAx8fu_4KGbJOgC3LPYg":{"text":"NIce ambience, Good coffee.\n\nHad a sandwich and side salad.  The lettuce was out of a bag,","useful":0,"cool":0},"RTENymHUcbKeK0V-eW6m0g":{"text":"Delicious and light lunch. We shared the turkey and fig crepe as well as a Nutella/banana ","useful":0,"cool":0},"YVduuzHmsXd52UkphiCMuA":{"text":"A fantastic way to start your day. This cute breakfast stop is French Quarter adjacent, se","useful":0,"cool":0},"56tFvM2MkpS_JKB-sPEbDA":{"text":"For yummy crepes and great coffee, this is the place.  Right outside the French Quarter, t","useful":1,"cool":1},"bV-yz6p1GKGQvAjtb14nVg":{"text":"We hit this place twice while we were in New Orleans.  Great food and service.  Would make","useful":1,"cool":1},"SXxKBtRj6IMvlRB3gGFJ0g":{"text":"Merchant takes itself a little too seriously.  We stopped in for a quick, to-go coffee and","useful":1,"cool":0},"JXZZrpAtzMyG7WD4f6MCqQ":{"text":"A friend and I are traveling in town from Colorado and saw that they have crepes here, the","useful":0,"cool":0},"2PWlm_IRHVnwEk6RRljb6g":{"text":"Don't get the açaí bowl. It's not like normal açaí bowls and it has zero flavor. Looks pre","useful":0,"cool":0},"_SJpCyjCLGMBSbnOOqq4YA":{"text":"Super friendly staff, they were very helpful for us and gave us a ton of pointers about th","useful":0,"cool":0},"xtQcLMAjYMEy9l_-0_6gtg":{"text":"Really good latte. The crepe I had was all right but if you're expecting a traditional Fre","useful":0,"cool":0},"ouz8lacoO6wXyufEWSNHLg":{"text":"Nice modern minimalist decoration. Good coffee drinks. Friendly service. Crepes were just ","useful":1,"cool":0},"jFAhHdVP-eDWiDURDlXj8A":{"text":"Being the only place to serve illy coffee, shouldn't be the only reason to visit. The staf","useful":1,"cool":1},"EG2iBLHVvuFjRTgSXaxMEw":{"text":"The location and inside is great. Very hipster, very clean. Inviting. The coffee was very ","useful":0,"cool":0},"IruWCjVupojV0xLYP3JUIw":{"text":"Very cool modern atmosphere in this breakfast/coffee shop. We came for the crepes. We find","useful":0,"cool":0},"s5bVs7XUkn8OPZtJyYywzg":{"text":"Very friendly staff with a modern design. Barstools setup by the window, which allows grea","useful":1,"cool":1},"roXX40_l55E0m3-dPvXfyg":{"text":"This is a nice casual quick breakfast spot. You order at the counter and then sit down wit","useful":0,"cool":0},"-k5BUJwO08ISwpT3vDMc-A":{"text":"Awesome crepes in particular the cookies and cream was a game changer. Also phenomenal Fre","useful":0,"cool":0},"e53tnuhVFI_eoANEsKMlAA":{"text":"Nice spot in the CBD to grab a tea, a coffee or a crepe.  Friendly staff.","useful":0,"cool":0},"0PGgZwVDGgthhltkjzTCrw":{"text":"This was a wonderful escape from thr deep fried fare in most of NO!  Although we only ate ","useful":4,"cool":2},"4dtuVjatu0sLhMQ3OSZyIQ":{"text":"I'm a vegetarian but I looovveee goat cheese and fig combo. The figamajig sounded like hea","useful":1,"cool":1},"6eBgmN43-q146TxpOS6iVw":{"text":"Cruel and callous leadership is setting a horrible example for the employees and the human","useful":0,"cool":0},"XoJ_oEpsFwcGZztBrzVyuA":{"text":"This was a nice place.  I was looking for a quick breakfast near the hotel, and this turne","useful":2,"cool":0},"ewZBZBasTUCxi0MtU5D09Q":{"text":"Beyond what others have already said, I will only say: Merchant's menu and kitchen puts it","useful":3,"cool":3},"jOI0yjz0syvuX4R4HRuwFw":{"text":"The bestest coffee there ever was.\nAlso, the salumi and egg crepe ( or coppa) is amazing. ","useful":5,"cool":3},"jtGNvEFOqcqqpGLyFz5TPg":{"text":"Not quite what I was expecting for breakfast in NOLA but impressed once I got past that. S","useful":2,"cool":1},"U-W-UEvch69-zjNayOhShA":{"text":"Coffee and pastry was great. Crepe was both slow and undercooked, and they weren't yet bus","useful":1,"cool":0},"dYDtvYDGy6qRrv2dTYKQAw":{"text":"We visited this location twice...and both times, it just took FOREVER. \n\nThe first day we ","useful":0,"cool":0},"7_Q8DLJnysvIdFAR2i6Mjw":{"text":"Serves Illy coffee and is a good place to mellow out for a few on the way to the office.","useful":2,"cool":1},"71uNQGEs1vJIp3l-lJRx9g":{"text":"Husband enjoyed his coffee. My tea was fine\n\nBut his yogurt parfait lacked enough yogurt a","useful":1,"cool":0},"tt7GdvBAZWKtRSwaiMSxFg":{"text":"Come here if you need grab a quick bite and coffee.  I ordered their chai drink and a frui","useful":0,"cool":0},"aj1n1F4h81jY7tmGluuOXg":{"text":"Great food, helpful and friendly staff. Had the turkey, goat cheese and fig crepe. One of ","useful":0,"cool":0},"LsXF2IHJjGjGIe6k-UfCOg":{"text":"This place was across the road from my hotel and I thought I would give it a try. I did an","useful":2,"cool":0},"Rug-irte5cvhh1-w4Wulwg":{"text":"I came here twice during my 4-day stay in New Orleans. The coffee is very good and service","useful":0,"cool":1},"KR7pS0gULxNtNPtV4N_RAg":{"text":"This review is solely based on the coffee and the veg breakfast sandwich.  The bread is IN","useful":0,"cool":0},"LSYXnKMbALf6quYQ-gimtw":{"text":"Great little find close to our hotel. Clean, modern coffee spot serving Illy coffee along ","useful":2,"cool":1},"N1FSeSsWD7Or2eRX1emKxA":{"text":"Coffee is just good .... we also ordered two crepes one sweet and one salty that were not ","useful":0,"cool":0},"YYF-8uUgP5P_xV2-F-bl3w":{"text":"Merchant serves Illy coffee, my favorite.The coffee cup seemed very small, however. I got ","useful":1,"cool":1},"6qkMVNlCe09VbS92X-4Lmw":{"text":"Merchant has a nice classy-cool vibe to it. The coffee is really good...very authentic. I ","useful":3,"cool":1},"KWDRnWiBFLhyJ5eimHhWOQ":{"text":"What an awesome way to start our Saturday morning! First, this is right around the corner ","useful":1,"cool":1},"c7zJ3wOrCdhR5DyOOzcL-Q":{"text":"Staff not welcoming or helpful. Decor sterile. The crepe I had was good but I don't think ","useful":1,"cool":0},"qMKKMWinkRdNbQvIGHAiWw":{"text":"Met a colleague for business networking in the mid afternoon. What few table there were we","useful":1,"cool":1},"cRgrev5Adjs4aXHfYIFDkw":{"text":"This was a great late morning stop with good food, and great atmosphere. I would assume it","useful":0,"cool":0},"xX8RVFFZ6wi_NZwKpI_pEA":{"text":"Awesome breakfast and the Chai Tea was fabulous!!! Wish I found this spot the first day I ","useful":0,"cool":0},"q-7XN407_5iITc5PUYHysw":{"text":"You've read all the accolades and most of them are true.\n\nA place that serves coffee, is s","useful":6,"cool":3},"nvMWYY8Q_PGg4Yo35WGhHg":{"text":"My boyfriend and I just recently moved from uptown to the CBD and are aggressively explori","useful":0,"cool":0},"fi8Z2c61ujqr36jfSWxEZg":{"text":"This little modern style crepery cafe is excellent. Great flavors and fresh ingredients. S","useful":0,"cool":0},"JJI-8mhIZ5LJSM-oKqM8_w":{"text":"Amazing breakfast. Amazing. Seriously, shockingly good. Had the turkey egg deliciousness t","useful":4,"cool":2},"4LQ8rpGlgduOzARAMJ97rA":{"text":"This place was a few steps from my hotel during a visit to New Orleans, and I consider mys","useful":2,"cool":1},"HCvZ60PAEZ-O-FnQO-_RHA":{"text":"I was in NOLA this past week staying at the Renaissance.  Discover Merchant right across t","useful":0,"cool":0},"4cHGYGNn450I0A7EI4W0WA":{"text":"Looking for available and interesting breakfast stops in New Orleans would seem rather eas","useful":0,"cool":0},"V2GWlCO9Nl2RB1aeBbFyuw":{"text":"this place is an absolute gem! gem I tell ya! ;p The staff is SOoooo genuinely friendly & ","useful":1,"cool":1},"M_NcaJoyJ-10oGRRqY4BNQ":{"text":"I entered Merchant having high expectations off the yelp reviews. This place is nice and m","useful":0,"cool":0},"qW3Iu5rt6SMAyPSPim_t_w":{"text":"Interesting concept. The food was good quality. The spacevis airy, a good place to stay a ","useful":2,"cool":0},"VbKMFF7ilPfmf-PZaaHq4w":{"text":"Awesome trendy brunch place in the heart of Nola. Highly recommend the goat cheese, baked ","useful":2,"cool":2},"jqtsGDR3zWqW20R8OCrwdw":{"text":"Came in during the weekday for Bfast. This cafe was located directly across the hotel I wa","useful":9,"cool":6},"ZU0slk1DnYY_D-jZCau7ag":{"text":"I came because it was a break from all the heavy foods. Interior was modern, minimal and c","useful":1,"cool":1},"T8h2ld42Yri6i0ivceLPbg":{"text":"One of the best coffee places in New Orleans! I work close by and I came here every day! (","useful":4,"cool":3},"finhHq4ovRy_SzonSEfloQ":{"text":"I ordered the Nutella-banana crepe and my friend ordered a veg breakfast sandwich on a cro","useful":0,"cool":0},"7iGb7wF2k3QlSx8K55pfcg":{"text":"We stopped by for a quick breakfast before the meeting. I enjoyed thier excellent latte an","useful":0,"cool":2},"L3set4QlXtjqzvj9gqXFBg":{"text":"I love this coffee shop. It's better each visit, as you learn the menu and uncover the inn","useful":1,"cool":1},"2oqgpFRSzsF9DrJlQhZIFg":{"text":"Stopped in here for a quick coffee one day, and breakfast the next. The vibe is very out o","useful":2,"cool":0},"7CuRHmqS0iQk217hz9kWjQ":{"text":"Such a great find for a quick bite. The gluten free crepe was delicious! It can be tricky ","useful":1,"cool":0},"xVgW2Lhle5K-jRhiBxTcVg":{"text":"When I move here from DC, I was disappointed to be leaving my favorite coffee shop but thi","useful":4,"cool":1},"R3zk4YGCOtDCbGmZfzLOGw":{"text":"Cute cafe with some decent cold brew. I got the caprese on baguette which was just ok, the","useful":0,"cool":0},"gU3fC6VUAtP-1QouoJRkFg":{"text":"There is a great atmosphere. There is free wifi. There is a large variety of crepes and th","useful":0,"cool":0},"pEs4KiWdlU93-Jo1osVm6g":{"text":"This place is really cool on the inside. The coffee is very good and the food is even bett","useful":2,"cool":1},"S3zTREQ_eAl2y80cS7GzxA":{"text":"Very friendly and genuine staff. While in town for my Grandmother's birthday, we ate here ","useful":3,"cool":3},"XJ8M0wxNlWvWGjf00q3clA":{"text":"So, generally I shy away from any place that has Illy coffee, cups and even napkins.  I al","useful":0,"cool":0},"5IqlB-1n6zgj50KwfeiRvA":{"text":"The coffee here is so far above most coffee shops in the area. The crepes look great, but ","useful":0,"cool":0},"YbqXVixb4XjzeZ2OsWos6A":{"text":"I stumbled upon Merchant while wandering around close to our hotel and I am so glad I did!","useful":1,"cool":0},"iXb7AttTMGX985J6N3U3kw":{"text":"Everyone behind the counter is SO NICE. The food is SO GOOD. the decor is SO CUTE. I heart","useful":2,"cool":3},"u73Vl6AGVD8wtXluMenbmg":{"text":"We hit this place like 10 times in 7 days.\n\nAwesome staff, food was delish and bevs were a","useful":1,"cool":1},"xO2jUArLCVRrJrfOsRapog":{"text":"I just attended a conference in this area and this coffee shop was the perfect escape! Gre","useful":3,"cool":2},"ZuGQCwbjKyOqfWS7aRYgaQ":{"text":"I go nuts for Illy so obviously, I was stoked to find out that this shop is 2 blocks from ","useful":1,"cool":0},"-jByvcGyvRIGN5Idw-B2aQ":{"text":"We were hungry looking for a brunch spot on a Saturday morning and found this spot on yelp","useful":0,"cool":0},"AFRBFVsuD6NsiHvVulHHlw":{"text":"Great coffee! Horrible service. The barista seemed extremely put out about my question and","useful":0,"cool":0},"P5UbFHynKLslrPXXKLMRKw":{"text":"Love the food. Coffee is ok. Very Modern in the design.  Not a fan of the bar seats.  Good","useful":1,"cool":0},"7ygWFv3NJ5co1HcjRKvFPw":{"text":"We came here for breakfast was not the greatest.The\nStaff looked tired and not very friend","useful":1,"cool":1},"jKLiNoa-Uu0TMXu_x2Lz-A":{"text":"i really truly loved this little cafe. it's modern and sort of swedish-esque (like ikea!) ","useful":1,"cool":1},"pCLXKPglRyed2uij_8TUsA":{"text":"The first true macchiato I have had in quite a while. The wife ordered an au lait and that","useful":1,"cool":0},"HrNwIPNIqPxO_YPDtsyUkw":{"text":"Came here for a late breakfast at the end of our trip.  The menu was actually a really nic","useful":1,"cool":2},"y-kQOjMjiYzHUM-bBriZcw":{"text":"Definitely the best coffee in the CBD and probably all of New Orleans. The food is great a","useful":4,"cool":3},"kYMBfJSBhWn00qg40m71TA":{"text":"Yelp doesn't usually steer me wrong and Merchant was no exception--delightfully cheery sta","useful":3,"cool":2},"V-puPdNstEktVAYbPBEpcQ":{"text":"Place got great reviews so we went for breakfast. We were expecting a little cafe but it i","useful":0,"cool":0},"lEjlcsbZEVH_zkmaB_sG_Q":{"text":"Love this new addition to the CBD! I love that it's walkable from Tulane hospital, which u","useful":2,"cool":1},"HRkYe2F8Kfdoth7rN9WsgA":{"text":"Every time I go to Merchant I have an all around great experience -- the customer service,","useful":4,"cool":3},"NtsFoF-y6pWHwuNrFwewow":{"text":"Awesome cafe!! My boyfriend and I were looking for a place for a quick, but solid breakfas","useful":0,"cool":0},"D46yl_sll9aWBV3gKdhvUA":{"text":"Cool little place for a brunch. Good coffee. I liked the crepes here, but there's more foo","useful":2,"cool":2},"1ypp8Ax2eWNpre_V3__3uA":{"text":"Great breakfast spot. Refills are free and iced tea is super cheap. The figgy croissant is","useful":1,"cool":1},"QDyEXN83TMEeF4CcEIn6eA":{"text":"If you like uppity posh looking ambiance then this will be right up your alley. Very yuppy","useful":0,"cool":0},"DeQ40t4aHvkTJl12ZdRqvA":{"text":"Found this place on our last morning in Nola.  I had the pancetta crepe even though it is ","useful":1,"cool":0},"M5myZcCUUx7qG1nhIuctZQ":{"text":"Delicious Illy coffee done just right.\n\nInventive crepe combinations that were very tasty.","useful":0,"cool":0},"EfmHMS5NVDCQa4GC8P9UmQ":{"text":"Aw man this place was such a nice break from the heavy and fried foods we'd been eating al","useful":0,"cool":0},"jnI1sGBZCk1WhqM6BNCEHg":{"text":"We had just moved in to the CBD the week before  Hurricane Issac.  Finding ourselves with ","useful":4,"cool":5},"Q7sZfeXYbFiC2YG4wS2Qfg":{"text":"We stumbled across this place and so glad we did! It became our go-to breakfast & coffee p","useful":3,"cool":3},"v_lnoINl0bObThTnPH7WFQ":{"text":"A wonderful discovery off the beaten path that put the lobby outposts of ubiquitous bad, b","useful":1,"cool":0},"gqE5IpbpOCCb60zC8N0qiw":{"text":"let me always preface my coffee reviews with, i don't like coffee. I call it oily bean bat","useful":0,"cool":0},"OW4cQAKtLGmpF2Ss-hZdkg":{"text":"If you want a break from fried, heavy food, this is a good alternative. I tried to be adve","useful":0,"cool":0},"17ShBCTGmdjEIWpLDzAwyg":{"text":"Probably visited this cute coffee bar with amazing crepe offerings (Gluten Free Avail and ","useful":0,"cool":0},"aeForJqJbuuVqfHT2AGDOw":{"text":"Ahhhhh freakin mazing.... Absolutely blown away by the service, the friendliness, and the ","useful":1,"cool":1},"XG3Q0evBDw9PS-8Z7yjSmg":{"text":"Very good food , fancy and nice ambience. Extremely low service.","useful":0,"cool":0},"Otru3rrsQRsBmuN8zwDC9Q":{"text":"This is the best little diner, with fantastic food. I went for a gluten free Nutella banan","useful":2,"cool":2},"ErRd9qjS1C3osPfYMEIz8w":{"text":"I was expecting a lot more. Thi place definitely didn't live up to what I thought it was g","useful":0,"cool":0},"JDlYhdCcBJ5FsoqNpZk8iA":{"text":"Thought I'd try again during the week. After watching the barista who made my cappuccino w","useful":2,"cool":1},"go9f3Mosnb95N1jcS847Jg":{"text":"The food is passable and the atmosphere is inoffensively banal. But the staff is rude as c","useful":0,"cool":0},"IF1RlnRpZvilfS_35e97Rg":{"text":"I used to work near this place and would stop in from time to time. Not sure why it took m","useful":2,"cool":0},"JwuTRk1iD0caWEKAdWlDEw":{"text":"Dont be fooled by the high reviews - this place is a waste of your money and time. On Mond","useful":0,"cool":0},"TIeiK-Ejp7K_29FHGDnjUQ":{"text":"Very, very trendy decor and incredible smell greet you as you walk in the door!! A smiling","useful":1,"cool":1},"hl8X9LvvQusSuG0fOvhZ8A":{"text":"Food is EXCELLENT.  I had the Pancetta crepe:  roasted tomato, basil and mozzarella. Great","useful":1,"cool":1},"wJSD6bSiTPJohzP_k86bZQ":{"text":"Why are you so slow?\n\nWhy can't you make coffee?\n\nWhy is it so full it spills for one and ","useful":0,"cool":0},"LVDGkvmGWmHweh03l1M3rQ":{"text":"Absolutely phenomenal sandwiches and crepes. Don't forget the coffee - I'll be eating here","useful":2,"cool":0},"b_OcVecvew7HXKwNFEjjXw":{"text":"After reading reviews expected a long wait. Luckily (thou not usually a good sign) we were","useful":1,"cool":0},"KkDfxXu4VP4RczjChgxUKA":{"text":"I've been wanting to try Merchant for quite some time now.  However, even though it's clos","useful":8,"cool":1},"TQv3oNubpH01OColhcGDHA":{"text":"This was a great place to stop and get a snack! My sister and I stopped here on a trip to ","useful":0,"cool":0},"jprLKMxRRuNB2CkSdvxNng":{"text":"Great spot for a quick delicious bite and coffee!! I ordered the turkey and goat cheese cr","useful":0,"cool":0},"gu7XH0TkIAxpEcFkB9SuQg":{"text":"Came to town for a business conference and found this place via Yelp.\n\nI arrived mid-day a","useful":0,"cool":0},"pg10_VqhFidP8YfWElqUXQ":{"text":"Went at 1 pm, no wait today. Coffee was fine, service no problem. We both ordered turkey, ","useful":0,"cool":0},"QDEuDc_N8385vLLY58wD9Q":{"text":"In New Orleans and Yelped coffee nearby the hotel and Merchants popped up.  The shop is we","useful":1,"cool":1},"YfwUqCYwoXiqAzqCUxRyhA":{"text":"Love this place. I stop by every time I get my hair done by the goddesses next door at Mai","useful":1,"cool":2},"DyUHl7WQEWJtZvlKVBuPXQ":{"text":"What a wonderful gem tucked away for us to discover!  The Illy is amazing and fantastic ev","useful":1,"cool":0},"FgXN7aCerwoS0yFDKKhZTg":{"text":"The food was good, the coffee was ok....the prices were ridiculously high AND they charge ","useful":0,"cool":0},"zY1YQTYRz-HW-awy3ksJQg":{"text":"We stayed around the corner from Merchant and happened upon the first morning, after our f","useful":0,"cool":0},"FUtC8L_OZyesnMdCvjz42A":{"text":"Cute coffee and breakfast spot! Their customer service was exceptional! Their coffee was a","useful":0,"cool":0},"YLj2fEwSsvNtbTAXn29btg":{"text":"Best cappuccino ive ever had!!! The egg and speck crepe was amazing. Loved this place!","useful":0,"cool":0},"7S4x2yVQk1vs15iuDlaAgw":{"text":"This place has everything: style, humor, great food for vegans and carnivores alike, cool ","useful":1,"cool":0},"xzhFSnx9gaPzZves8Io0wA":{"text":"Found this little gem on Yelp - thanks Yelpers!\n\nMy friend and I I wanted a light breakfas","useful":7,"cool":6},"kY6kgkzazpX2-soVfygi9w":{"text":"I have yet to try the food here, but the crepes sure look good! I have been here a few tim","useful":5,"cool":1},"YWGl6DFGc2EXl--LqAqNvg":{"text":"Very good coffee and delicious crepes.. Very impressed with this hidden gem\nDefinitely rec","useful":1,"cool":1},"dWfXNIJR2gmcnQGABVdgsw":{"text":"Absolutely terrific! I came here for breakfast/brunch when I was staying at the Roosevelt ","useful":2,"cool":2},"BJXhD7cOQa-3YQ4WJbEGjw":{"text":"Rude lady at the counter, dry crepes, the bourn giorno was just edible with an egg, cold s","useful":0,"cool":0},"8vdO662tgz1t6PHvowR7bg":{"text":"A cute little cafe, they have a variety of choices that can be on your choice of bread or ","useful":1,"cool":0},"s7_L0CkMFUnHv5v0Tls5dg":{"text":"Definitely the best coffee in New Orleans and the food is good. The main problem is sanita","useful":0,"cool":0},"BBD1aC0Z7YzRtIC4gtuEHw":{"text":"What a beautiful little spot for coffee. There is a case of pastries should you wish to en","useful":5,"cool":6},"SEiw3i7LLG50rS0vHyWyAQ":{"text":"Amazing soup and sandwiches. Great for the health conscious. Nice size portions. It valida","useful":0,"cool":0},"nFd1F6_M7Lg5hUxzB1y3jw":{"text":"The coffee at Merchant is so good that it makes me actually look forward to going to work ","useful":5,"cool":0},"-QwmN8RFoFTphAYJPwznBg":{"text":"I loved this place.  And would happily have eaten breakfast there every morning if I had d","useful":1,"cool":0},"tBqYyi73DbSetaA9vNp1XQ":{"text":"This place was a gem! It was around the corner from our hotel. I'm bummed I didn't get a c","useful":1,"cool":0},"oCI8HThFFUyhj5596dftAw":{"text":"Wir waren zwei Mal zum Frühstück da, weil einerseits die moderne Einrichtung sehr anziehen","useful":1,"cool":2},"i3CcovguGZPd1AzCyPyerg":{"text":"Um. Egg, Prosciutto and fig?? Yes please!\n\nOk, so I created my own sandwich. Yeah-I'm that","useful":8,"cool":6},"5OcTsXBDsND1Z9CZNXDRQA":{"text":"With all the delicious fare in New Orleans, I still opted to eat breakfast at Merchant *tw","useful":6,"cool":6},"z40yUPRdbG5v6TT9k5dXgA":{"text":"Visiting and wanted a light breakfast...this was amazing. Great options from crepes to aça","useful":0,"cool":0},"0qSq5efueZ0EqHYaLRMe7w":{"text":"Loxsmith on croissant = Delicious! \nFood and cappuccinos made quickly and the staff was ve","useful":0,"cool":0},"QwqVr2hJhzXMhhPcOetfXg":{"text":"This place is OK. Read some good press and decided to check it out. Service is slow and st","useful":2,"cool":0},"AWKvJu7OShEi3XJ4GQ7Aqg":{"text":"Wonderful spot in Nola for a delicious breakfast or lunch.  The croissant with turkey, goa","useful":0,"cool":0},"h7fna-lY-L7rVtbMGmnvDA":{"text":"I work right next to Merchant so I go here quite a bit. It has a modern style and a lot mo","useful":0,"cool":0},"5ZW6j5Wz7s19u1E_Yd9Alw":{"text":"Chic little cafe for your coffee/breakfast fix.\nLarge sitting area, friendly staff, reason","useful":0,"cool":0},"Gu0ZrGNKGt0UmOyybBwHwQ":{"text":"This is a great way to start the day.  Great coffee, crepes & pastries.  I had the breakfa","useful":1,"cool":0},"LlBeDSB5YZjmPGpX73R3rg":{"text":"The only thing that make me give 2 stars is a lady who served us well when we put the orde","useful":0,"cool":0},"S03Y1KVTd7CvNqg5B9WeLQ":{"text":"I know few people as \"form over function\" as I am, so Merchant hits all my notes. Super mo","useful":4,"cool":0},"ZRyKuYt5M2cIwlPk3seoZw":{"text":"The portions are generous, the staff was very friendly, and my dirty chai was amazing. All","useful":0,"cool":0},"gkb1FlYBhRB-2JSsKKjhuw":{"text":"The coffee is delicious and the shop has a quiet serenity you rarely find in a coffee shop","useful":0,"cool":0},"ms8ezbxYIOUfCBmTwavdSQ":{"text":"Awesome local coffee shop. Great atmosphere and music. Great coffee and tasty crepes. Frie","useful":0,"cool":0},"4EWIGS4Y8DzW0q3AS1pvlw":{"text":"Wow just had the most outrageous experience here. Ordered two lattes and two sandwiches. A","useful":0,"cool":0},"Oiam8EMRITApQxQo52djWg":{"text":"Most pretentious place I've ever been to. Beautiful interiors, but something is just off. ","useful":0,"cool":0},"qg7XeSVhzUsyKIqHaoLn6Q":{"text":"Think I just found my most fav bfast place ever!!! And while I'm not that picky, I'm also ","useful":1,"cool":0},"kgujamWbHqOJnbaHozZ1fA":{"text":"Going to New Orleans for a weekend usually requires some early week dieting to prepare my ","useful":2,"cool":3},"R2O0gmYvZLYL9jfhnK9FQg":{"text":"Started out good, excellent espresso, ended up bad with trash in the salad. Did not remake","useful":0,"cool":0},"DH0Ii8VIiy9k_GOXGry_2A":{"text":"Crepes & breakfast sandwiches were amazing! Great coffee! Lemon curd crepe is a must try!!","useful":3,"cool":2},"UlneQQ3iNGyMEeUdLsFpuA":{"text":"This is honestly one of the best coffee shops/cafes. I first came here at the recommendati","useful":1,"cool":1},"tX2QUoelgNA7UDKtkUwC2g":{"text":"Fabulous selection of breakfast, brunch and lunch items. Everyone in our group found somet","useful":0,"cool":0},"u4a-FChUkBGsGlmdVtniXQ":{"text":"Clean, simple espresso making skills are on point.  The non pretentious welcoming to (new ","useful":0,"cool":0},"lzVR_XYKVNP6JqV8QIowtg":{"text":"Walked into this place the other day for breakfast and had a pretty good experience. The d","useful":0,"cool":1},"r1BT6d_wVPigtTBnHqhcNw":{"text":"Popped in briefly just for some warm, caffeinated drinks. Despite being cold outside the p","useful":0,"cool":0},"-WYokKSpSiMe8j4EWGP4rg":{"text":"The food was very good, but service needs some work! I ordered a sandwich from the menu mi","useful":0,"cool":0},"asZNby32RiNx_Uy1X6uzug":{"text":"What is this person talking about with the \"banal\" atmosphere and \"passable food\"?? I inst","useful":1,"cool":0},"V6hB3YzkFRROIMIUw4M-CQ":{"text":"Stopped here for breakfast based on the reviews here on yelp. Our family here in new Orlea","useful":3,"cool":3},"SUDxSzJh2f7I3i5pHuJ-6g":{"text":"Everything is soooo good! I had the biscoff crepe which was a bite of heaven! My mom had t","useful":1,"cool":1},"b7ocEiGsnqe7_IXU2_wFJA":{"text":"Felt like home when i stopped in each morning of my vacation to get my morning cup of caff","useful":1,"cool":1},"zH8EmZ2Zqhg-_q1f-SaSzw":{"text":"Very nice ambiance, quiet and relaxing, and the crepe we got was tasty! Friendly service t","useful":0,"cool":0},"j9_GPOrbs7G56p82wbhnTg":{"text":"Definitely a good stop for the out of towner from a big city for great coffee and espresso","useful":1,"cool":1},"7XOrM0JFjmJ3xe8r_8d6sQ":{"text":"We stopped here for breakfast because it was walking distance from the hotel we stayed at.","useful":0,"cool":0},"fDSOZbIV4PfiDsAOCWcBlA":{"text":"I have had breakfast and lunch here. The crepes are delicious . My favorites are turkey&fi","useful":0,"cool":0},"rMlv2fDWRGA4L6f-LxLUHg":{"text":"The food and the service was beyond compare. The  crepe with the cocoa and seasonal berrie","useful":0,"cool":0},"yjOjv7Am8jOF4hSibMCbnA":{"text":"Great coffee! We liked our crepes a lot (the almond one gets 5 stars, the nutella and bana","useful":0,"cool":0},"GCaEQrgt8jnoEyBea_pVjw":{"text":"Loved this place!  I couldn't make up my mind when ordering and the cashier suggested I tr","useful":5,"cool":2},"m-UyGTwt0aTvC64t5RFPjQ":{"text":"Great little breakfast and lunch spot in the CBD. It was within walking distance of our ho","useful":0,"cool":0},"k6LHGE8H6qm19KmVZJ6mSw":{"text":"The vibe in here almost has a diner like feel with a modern twist sans horrible fried food","useful":4,"cool":3},"TqcARvqs7Y6z9VuGNtRdjA":{"text":"Went to this place on a Saturday morning ! This was a cool little cafe and has a real cool","useful":1,"cool":1},"GV__wJLtvRIyNqE_Vsz6iw":{"text":"Yes, Merchant is painfully hip with their modern feel and their uber bad ass Ipad signatur","useful":1,"cool":0},"gboBoziXwr8ME6Zl8aeKFw":{"text":"Subpar customer service. Subpar quality,  and racially biased establishment. Will never pa","useful":0,"cool":0},"HArSaAI82JPOzCP6IzkbGA":{"text":"Awesome place for breakfast with a neat interior. Stopped by with my friend the other day ","useful":1,"cool":0},"0P_Tlchq3n5YrC3ps-tKhw":{"text":"Stopped by while on vacation due to the reviews. Wanted the lemon curd crepe but they were","useful":0,"cool":0},"bR7E2uPwX0HpS1Vz_Y2CQw":{"text":"Very smooth coffee. I seriously can't get enough of this place! Great space to get a lil w","useful":1,"cool":0},"kAJzlwJfxX8UfXwGYwot_A":{"text":"I do not understand the plethora of positive reviews. Did the owners hire a fake review ma","useful":0,"cool":0},"dUnGzMq32l17kSXejgKnPA":{"text":"Atmosphere was good; the food was mediocre at best hence no pictures; when I was there, th","useful":0,"cool":0},"nISoMEY_UrgfzNc329ngLg":{"text":"In an effort at understatement, I'll say that my breakfast at Merchant was just fine.   Me","useful":4,"cool":3},"5ODGOFb7mJSFVPWRtwPPxA":{"text":"Great fresh ingredients! I was craving something healthy after traveling and eating sodium","useful":0,"cool":0},"ndukMsvsJCSNQtfygQyJ5g":{"text":"Decent crepes, nice atmosphere, ok staff. My friend and I both ordered lunch crepes. She a","useful":0,"cool":0},"ehFkeuBLI7natD2cpx8aTA":{"text":"In negative situations, both parties have done something that escalated the situation. So ","useful":3,"cool":0},"aRNWMROKzepsnqefacal0g":{"text":"Stopped by for breakfast. Had a soy latte and the fig-a-ma-jig sandwich. The sandwich was ","useful":0,"cool":0},"DXoNsnu04FdlWK5lK1BoSg":{"text":"Acai chia pudding was delicious! Employees were super friendly and helpful by giving us ti","useful":1,"cool":1},"58fGLP5NsJko_s2cKohnHg":{"text":"My husband and I ate here for our last breakfast in NOLA. I had the turkey and fig crepe. ","useful":0,"cool":1},"SWX99S5g6AthjOD_l0k8oQ":{"text":"Nice crêpes, amazing coffee, great staff!","useful":2,"cool":1},"tcRuYj-iVgoLxbKEIohJTg":{"text":"Cute little coffee shop with an amazing breakfast menu! I recommend the quinoa breakfast b","useful":1,"cool":1},"UoRNPZRypH9BgeMdRv6kKg":{"text":"Good crepes, although a little pricey. Convenient to the hotel I was staying at. Note: the","useful":2,"cool":1},"GP8NS_C0MxfiMYB3qBB5rw":{"text":"Illy coffee, which I liked. Ordered the crepe breakfast Sandwich with turkey, and fig. It ","useful":0,"cool":0},"byr1hgm67q2rG7GiACmvuw":{"text":"Convenience brought me here as I was staying close by but the great food and friendly serv","useful":0,"cool":0},"0SUb9MqcjngwvnaJmZAUTA":{"text":"Place was clean. Staff was friendly. Those crepes were amazing! The coffee was good. The a","useful":0,"cool":0},"HgMFmpYYNlPpM9CCL2hLjQ":{"text":"Visiting New Orleans and stopped by Merchants for an afternoon crepe. It exceeded my expec","useful":0,"cool":0},"76cbNMgz_ATWfwKy_xipQQ":{"text":"I was insanely impressed with Merchant! The place is beautifully decorated in fresh white ","useful":0,"cool":0},"syK4xH7vD1qwkw6Z88Ne7g":{"text":"My husband and I came in here for coffee and to unwind. The vibe is mellow and relaxing. T","useful":0,"cool":0},"fp6PvxBlL2ODkNitv5jFXg":{"text":"We stopped by this cute little place during our morning stroll in New Orleans. The food wa","useful":1,"cool":0},"yE4NwHC60eH6EkI8bkQLsw":{"text":"This is the best coffee spot in the city.  \n\nThey're not only using the best coffee/espres","useful":0,"cool":1},"u1Ih79eoSlycuetyr01CfQ":{"text":"I found this place while visiting NOLA last week. I LOVE Illy coffee because it's always m","useful":1,"cool":0},"wSLEA7wa07sG2iwreKGWAg":{"text":"Merchant was nice find during my brief trip to New Orleans. \n\nThis small cafe is very mode","useful":1,"cool":1},"AJw8ZONP7SOL9tHQ6D8n5A":{"text":"Cool, out-of-the way local eatery. Ham & cheese croissant was really good. Apple & cheese ","useful":2,"cool":0},"z_HCna1ps4kuyMCcHi6vNA":{"text":"My kids devoured the huge Nutella and banana crepe. My hubby had the Parma crepe which was","useful":0,"cool":0},"TlGr4vVcl-uGzVH-Z8wFSQ":{"text":"I see all these pictures and the food looks good so I decided maybe i'll try it next time ","useful":4,"cool":2},"5REP9d--ZWVwChyaSJ521A":{"text":"Very cute welcoming atmosphere! Besides the obviously new cashier the staff was friendly. ","useful":0,"cool":0},"UnWR0bYA7wKAQJznXZBaSQ":{"text":"If your looking for something satisfying and healthy after all the beignets, gumbo and cha","useful":1,"cool":0},"pVKjnUg06mguUq7yKmuaLQ":{"text":"Having tried the latte at Merchant a few weeks ago, I have been successfully ruined. I thi","useful":1,"cool":1},"xIX244h0KkjRFrHMjk5eHQ":{"text":"Amazinggg breakfast/lunch spot with seriously yummy food and a friendly and attentive staf","useful":3,"cool":1},"LK6r4E_zqU0xYeVm5OYWiw":{"text":"Cute atmosphere. \nMy crepe was room temperature and the ham inside was cold, the cheese wa","useful":1,"cool":0},"M1utqPvgK692a2OXUJpAaQ":{"text":"Needed a cup of coffee and bite before starting the day, and this place was only a few pac","useful":3,"cool":2},"YQpZLcJrli3eyCINxG4oTA":{"text":"I came here for a quick early morning breakfast before a tour and this was like a godsend.","useful":0,"cool":0},"8TiOEpPXT2Jo1Fp9h9ZMZA":{"text":"We stumbled upon this place as it was close by to where we were staying and it was great. ","useful":0,"cool":0},"5T4ntd54udqS3_Y7X69-lg":{"text":"SLOW!!! We had to wait an hour to order, wait and get our food. That is unacceptable for c","useful":0,"cool":0},"vixZo0kJc76ihr6m80LKgg":{"text":"Place was clean. Staff was friendly. Those crepes were amazing! The coffee was good. The a","useful":0,"cool":0},"CBJWpGBlWVO5FiWOCO_lFA":{"text":"Great place, very clean. Super modern. Had some good vegan options which was just what we ","useful":1,"cool":0},"aEset8WnVqzewkmx6hTL3Q":{"text":"I ate here two days in a row for lunch. We sampled lots of different dishes and I have no ","useful":2,"cool":1},"RBgEnWFXTxE_Hd3klh3j1A":{"text":"I want to start by saying that I love the atmosphere of this place! Very relaxing and the ","useful":0,"cool":0},"nFUaqX3yYLv0LBx4CkLQxg":{"text":"Stay away from the quinoa bowl. It's literally a bedding of dry raw spinach, then a layer ","useful":0,"cool":0},"aycg5ZAvVGG4ZXwgPaKU5g":{"text":"Had some good gluten free crepes. Delicious and savory. The salad was a little dry though.","useful":0,"cool":0},"tJAJxvpigkPNmC1DqMTfvA":{"text":"So good!  Friendly place with lots of options. I had the lemon curd crepe for breakfast. M","useful":1,"cool":0},"1dfp0SuD2my8LQ5H1cG2NA":{"text":"What a downer! Employees look like they hate working there. Crepes are the worst I've ever","useful":0,"cool":0},"tYGxB04mVBMiQZAFgAc5-A":{"text":"Thanks to Yelp for this hidden gem.  Tucked away in an apartment building in the business ","useful":0,"cool":0},"gVlxa1Jj-_HYQNO6zItKHg":{"text":"Lovely place for a filling but not overwhelming breakfast! The people working her were sup","useful":0,"cool":1},"brXubjlk5A-CPKXWAW8qEg":{"text":"Illy coffee - so much better than Starbucks please if you're in CBD go here (you won't be ","useful":0,"cool":0},"-ocgOFpb43KpQrT3LWqIVw":{"text":"Quaint little cafe located in the CBD. I ordered the prosciutto sandwich along with a side","useful":1,"cool":0},"K301zAmoWTNUm7BGdOt1OQ":{"text":"Amazing place for breakfast down the street from our Airbnb. The owner was super friendly ","useful":3,"cool":2},"j9qnN_fuAqW5nOBoV0C7mA":{"text":"Just went out for a quick breakfast spots that had Crêpes and coffee and this one did not ","useful":0,"cool":0},"woSeT-SYk0LlJE-xNF2tLQ":{"text":"This place was amazing! Nice clean look with great food. We ordered the Egg+Speck crepe an","useful":1,"cool":1},"jfM4kqc-dSsEFLhPX_u4Gg":{"text":"This is in the space that was formerly the Common St. Cafe which had some of the best frie","useful":7,"cool":4},"r2MacozrHODtJat1Bga4hA":{"text":"My friend Pat dropped me off at Lee Circle to have breakfast at NOCHI for their GF waffles","useful":1,"cool":0},"ysWm8cq1i8E_ZSTtp2hS0Q":{"text":"Great food and coffee. The best is the friendly staff! Great location and ambiance too.","useful":1,"cool":0},"EpZ9Psj7P3sE90kVIlO7kw":{"text":"I came here with a friend, and let me say that the friend loved it. She has been dying to ","useful":0,"cool":0},"BYmDkAu4lzNBlkjlYN1tGQ":{"text":"Came here after a few other brunch places were packed. I was glad to see there's actually ","useful":1,"cool":1},"oX7LY5ipCswsy2HnlCPtjQ":{"text":"I got a latte and a lox sandwich on a croissant. It's definitely worth trying on a croissa","useful":0,"cool":0},"0JQlior1367Vc9fMjeOJXA":{"text":"Great little place in CBD.  Staff were very welcoming and efficient.  The espresso is grea","useful":0,"cool":0},"7xga8r6sXSCsfOt1YAL1vQ":{"text":"Was in the mood for an acai bowl and found Merchant via Yelp. Their good reviews must be b","useful":0,"cool":0},"q5A9aS4fkTXVQToFgDXTyQ":{"text":"If I were at this half of the CBD, I would come here for lunch. I got the duck confit croq","useful":3,"cool":2},"1KZ9pdj4qbKgX7-WVVQe6w":{"text":"Good place for a quick breakfast \n\n- Nice Staff \n- not than many options for breakfast \n- ","useful":0,"cool":0},"2BQE5NzvqZgCi8pdFMOfLA":{"text":"Things I loved: location, the walk up and order style dining. Seating area...modern atmosp","useful":0,"cool":0},"DRFB3hptV7QXkDtlVseSNQ":{"text":"Perfect spot to grab a bite just away from Bourbon Street. Great coffee, excellent food, a","useful":0,"cool":0},"_IZnvGcY23TUG3oA3wxEdw":{"text":"A small modern crepe, coffee and tea place near French quarter. Americano was bitter but g","useful":0,"cool":0},"PcFw8UjXZkrkmyPPn1hTKA":{"text":"Continuing my crepe kick after visiting the French Market, I was glad to find a coffee sho","useful":1,"cool":1},"unXg7cThCVqTOFp21cdy2Q":{"text":"Overall fantastic place!! Crepes were delicious, ambiance was perfect for a late morning s","useful":1,"cool":0},"97MKIaRZhCs7jYMOVRQWLg":{"text":"Great option for a light and healthy option during a trip to NOLA! This little cafe was ri","useful":1,"cool":1},"7sZrkkH7fkILZlKZR7bJqA":{"text":"Went for the crepes, and they did not disappoint. Shared the Prosciutto and Lemon Curd, an","useful":1,"cool":0},"8OMQJVUSFEHdaqnx14HUTA":{"text":"Food and service wonderful! Crepes were delicious! My daughter ate her Nutella banana crep","useful":0,"cool":0},"8XN7mcz7V09Kmov6kNqOSA":{"text":"Beat coffee in town! Staff is amazing! Highly recommend the Fig-A-Ma-Jig on a croissant!!!","useful":0,"cool":0},"eSx4LkJKmPIyBp-FFTo-xA":{"text":"Stopped here early morning for a quick bite before our adventures begin for the day. Absol","useful":1,"cool":1},"HWSOjfVbpaT6W50zIyIbBQ":{"text":"Probably one of the few places in New Orleans that offer healthy alternatives. When you ge","useful":2,"cool":3},"P8R1AjInhP3dImhihS5_ZA":{"text":"Had a very poor experience at this place. Their acai chia bowl is really strange - it has ","useful":4,"cool":2},"h_5amEjP-OJYaG4DKOwzwQ":{"text":"I was really looking forward to having an Açaí bowl this morning so I decided to try this ","useful":1,"cool":0},"ayArRPBMwu0DKQJ3ra1odA":{"text":"Great price for tasty crepes. We went for savory - speck, goat cheese and egg. Really good","useful":1,"cool":0},"3F0YpwNBCXyP6-rWbmDmZQ":{"text":"Daughter is a fan of the Nutella crepe, no discount if you omit the banana. Espresso coffe","useful":0,"cool":0},"KSFJpk0TIhGezLPdioHlww":{"text":"Duck confit croque baton was perfect!  Balanced flavorful bites of duck confit with chevre","useful":3,"cool":2},"H2ZdAYNgzo9FeHoGya7jqw":{"text":"Cute little breakfast and/or lunch spot right around the corner from my hotel. I had the c","useful":2,"cool":0},"l2dgrU1TYwyJTLwrJXKZVw":{"text":"During my visit to the big easy I had Merchat bookmarked as a breakfast option and I'm gla","useful":13,"cool":10},"aoH4QW-0Yh54Xak7po-uNg":{"text":"I've been coming to Merchant for as long as I've lived in New Orleans and it's easily my f","useful":0,"cool":0},"V7FdVFHCIjqNn9EzyfRjFA":{"text":"Merchant is a clean modern French-inspired cafe tucked away in the Central Business Distri","useful":1,"cool":0},"hYEMXy2N1sN9-7I9eRc0XQ":{"text":"My wife and I were in a rush to get to the pickup spot for our swamp airboat gator tour. T","useful":1,"cool":1},"81LZu9NMP83oszquslkyHA":{"text":"This is a wonderfully quaint cafe with a small menu and fabulous coffee. I typically don't","useful":4,"cool":2},"acBw_wIkOCMqD4PI0nq17Q":{"text":"This place is so cute and the menu looks great. So much potential. However at ruined by th","useful":2,"cool":0},"R9D_dHYW0LAyRw8h8OZ6Gg":{"text":"Mixed feelings about Merchant - it was my first meal in NOLA and I was expecting more. I l","useful":2,"cool":0},"k4yjYC_DHPJg1_lubQVjvg":{"text":"Y'all, I've been lucky in this life and have yet to meet a crepe I didn't like. I've had s","useful":20,"cool":11},"OrsC020UTcTmTgob9noz6Q":{"text":"Appears they are shut down during Covid.  Hopefully they return at some point because food","useful":0,"cool":0},"4ZyD1mD8Li2RysA_dGB0XA":{"text":"When in New Orleans we would like to try crepe and this place showed up in our list. We di","useful":0,"cool":0},"kL6Y7cBN-Qn898fudnCBug":{"text":"Who doesn't love crepes? Who doesn't love biscoff cookie spread? (I'd eat it by the spoonf","useful":2,"cool":3},"Vb99XePIjkaJfcQQ97GVcw":{"text":"Stopped in for Sunday brunch. My friend had a turkey crepe and told me it was phenomenal, ","useful":1,"cool":1},"hx1_N6y3GvCasfY_Y4zQ9w":{"text":"Delicious!  I ordered the turkey+fig.  It was bigger than I expected and very filling.  Th","useful":0,"cool":0},"gaC7xyhpBGZanEtRn8i-SQ":{"text":"P and I came here for breakfast and this place reminds me of cafes in New York and this pl","useful":3,"cool":1},"QHcQl8xJPHJPTWf3uOd3IQ":{"text":"One of my favorite places downtown. As French as you can get with their delicious crepes a","useful":0,"cool":0},"BFw1q_iiY4wte8dOIs7DcA":{"text":"Working downtown and on break? or just wandering around and need a quick fix? Then Merchan","useful":1,"cool":2},"PvrrpSYE8_ZAjDbI-HvDUQ":{"text":"Illy coffee!!! My cappuccino was a real cappuccino (not a latte with foam like most people","useful":1,"cool":0},"78fcBgiWD7I9WC2kiJnhSw":{"text":"I got a chicory latte which is worth a try and lemon curd crepe first time, but many of th","useful":0,"cool":0},"KXKYeTKtK5eRxoTzoQ8sEw":{"text":"The staff was friendly and helpful and let me select a few ingredients to make my own crep","useful":1,"cool":1},"McN3W6b4IJ9f8zDGTidH2w":{"text":"Food was awesome. People were awesome. Clean. Friendly. I got the prosciutto crepe. It was","useful":1,"cool":1},"PSvukru3a0EyOw9RmZOS1Q":{"text":"LOVE LOVE LOVE! Our kind of place. Friendly baristas, delicious beverages and the food was","useful":1,"cool":1},"23xbezD43iGcCT4ZPO-9LQ":{"text":"Hipster coffee shop in a luxury rental building. The problem is I actually don't think the","useful":2,"cool":1},"Xq4Jvtsz465qY2oHjNRf4w":{"text":"Great for a quick breakfast while in NOLA!  I had a crepe and coffee which were both very ","useful":2,"cool":4},"T7Jlln6YNFun59wFeKsPtg":{"text":"Really terrible acia bowl, had little chunks of what seemed like rocks in it that hurt my ","useful":0,"cool":0},"mSkKICW2k-XfL6gsYFyXkw":{"text":"I got the cubano crepe and a dirty chai. The crepe was really thick - almost to the point ","useful":1,"cool":0},"jN6EgaYG7zrSvNVbr1Uoxg":{"text":"I remember when the sign was posted about this café opening soon and years later I still g","useful":0,"cool":1},"AOIVHV5yYhjumEnxhFbdDQ":{"text":"The location is very hip and modern. The coffees and lattes are pretty good, we had a dirt","useful":0,"cool":1},"5TH3TGKIGq5fwvJgt2dXOQ":{"text":"Best sandwiches in a crepe that I have ever had. I had Il Cubano and wife had the Prosciut","useful":0,"cool":0},"i4VA5XIGCoc16s_2OBNLcg":{"text":"Upon walking in, me and my friends were greeted with a large bright computer screen menu. ","useful":1,"cool":0},"16BZQNnWyChwkLHs7-k3QA":{"text":"Strolling by looking for a meal after arriving in NOLA and on my way to a meeting.  So gla","useful":0,"cool":0},"HAr1mEDSEeUG2B6QS1LMvA":{"text":"Can merchant please pick up and move to philly? I would probably be broke but at least my ","useful":1,"cool":1},"kUY76CYxaFF6F0reft9D0w":{"text":"Let's get crepey.\n\nPossibly one of the cutest, if not thee cutest, cafes in the CBD. Crepe","useful":2,"cool":1},"et2aZm1ViQWbvz-WFm4iEg":{"text":"Stopped here for breakfast to-go on our way out of NOLA. I'm gluten free so we ordered 2 G","useful":0,"cool":0},"GjLZkQNNEDXCxKK-R0fswg":{"text":"iLLY ICED CAPPUCCINO: delicious pancetta, egg and gruyere croissant: $10!\n7TH ARR: chic no","useful":4,"cool":2},"R20nxE6XZjawuS9-jAEvFA":{"text":"Just about the worst service I've encountered anywhere in the world, and more than shocked","useful":3,"cool":0},"k6UsfCCwKnm3KaXPqmq2rQ":{"text":"Located across from the Renaissance Hotel Pere Marquette, Merchant is a coffee shop that a","useful":1,"cool":0},"WvQAHoqc68Yo78bRtTpByA":{"text":"I've come here for both lunch and a quick coffee date here now months apart. Both experien","useful":4,"cool":5},"HYn_V-hJzuZkCbd4wdQuPA":{"text":"Craving a healthy-ish breakfast on my last morning in New Orleans, I consulted my handy da","useful":6,"cool":8},"9Msf1mYxPuMyDyqTm9Dhcw":{"text":"Great food, drinks and service. Excellent place to meet work contacts or friends in the CB","useful":2,"cool":2},"nL6RBe8lz8rMC8UBed4dRw":{"text":"It was a very short walk from our hotel, and we decided to head here on a rainy day after ","useful":1,"cool":0},"nWo276Bs6bf6Fwf9_bSLOg":{"text":"This place had super modern, beautiful, clean decor, loved the vibe inside. It's my first ","useful":3,"cool":1},"BFGUADfzWQNymx_sPKYN6A":{"text":"I used to work around the corner, and practically slept over at Merchant. Most of my paych","useful":2,"cool":0},"Oz_jpivy4fxCjkUSyKIZ7w":{"text":"I always come to this place when in New Orleans for a lovely breakfast and coffee. They ha","useful":1,"cool":1},"P21HIJKD9Zvd6-35OzGi5g":{"text":"Searching for more coffee in the city of New Orleans, I trekked out onto the constantly co","useful":2,"cool":1},"tyCbNwLVqyULnKUQSWMfzg":{"text":"I stayed at an Airbnb near Merchant and came here for breakfast a couple mornings and ever","useful":1,"cool":0},"rzTGoCkEEMur9C9II2VvDw":{"text":"Our sandwich picks were the duck confit and the three cheese. The fig on the duck gave it ","useful":1,"cool":0},"9qGnCwT_AWTd0On_PZ2H4A":{"text":"Cute little modern cafe. I loved all the white. Made it seem really clean, but not too col","useful":5,"cool":3},"j4OyaO4EJ9Vuc4zcXTS2DQ":{"text":"You need a good breakfast, you need an awesome ambiance, so you need Merchant.  Close to h","useful":1,"cool":0}}