{"DZsr2hWWiOIqLnn2gPIXPg":{"text":"Was there last night with a group of 10. We were on the balcony minding our business, danc","useful":0,"cool":0},"1UPHPfaItXtaVm05KMsPkw":{"text":"Trashy service and needs to go out of business, sooner rather than later. As I was in line","useful":1,"cool":0},"4Y-HCqUHWRvhOjoer-Em9A":{"text":"The owners from Walk-Ons should pay to have someone clean the toilets here. It's filthy.","useful":0,"cool":0},"9AVYLn6kUv0kKLjn1izBSg":{"text":"Awesome place!  We were there when the saints game gone out, watching the crowd come down ","useful":0,"cool":0},"8U0a2vUbXcMkpEHJkxEVbA":{"text":"I was the third person in line for ONE HOUR and they would not let anyone inside because t","useful":1,"cool":0},"Rzpc3W3l8qcOtier-XeLwQ":{"text":"The vintage music videos makes this place a lot of fun! The space is nice and the large ba","useful":1,"cool":0},"jKxOobRruGn0aJjp4yvTFw":{"text":"Do not go to this establishment, bouncer who aggressively put his hands on multiple women ","useful":1,"cool":0},"A8wBuPvjNBp8WSnPPh0CtQ":{"text":"This review is for a private event I just had at the VRC.  We had a corporate watch party ","useful":0,"cool":0},"OzTAOP93-BFdvvUeLfmoBQ":{"text":"One of the best places to dance the night away in New Orleans if you don't feel like going","useful":0,"cool":0},"rU9o5wvFB6AfdTB6v71GJg":{"text":"After dining at a local New Orleans restaurant across the street, a group of friends and I","useful":0,"cool":2},"om_Am4I0oUDnfHW5XazbrA":{"text":"To be honest, I never even knew this place existed until I walked up to the fun purple lig","useful":0,"cool":0},"gTyfmJvRxq6msFbbZapX3w":{"text":"Awesome atmosphere that puts you in a free feeling mood. Rather you're are a smooth dance ","useful":0,"cool":0},"VyWziLXF_fIGyeOo899cNw":{"text":"Heads-up: Keep in mind that this is a review for Vintage Rock Club as a private party rent","useful":1,"cool":0},"-xBBDYDrEvtRIDdv_rzNPQ":{"text":"The bouncer filmed my friend over a bathroom stall and proceeded to call her a slut once s","useful":1,"cool":0},"4wlKb_iusbivI-qnjkYzMg":{"text":"I've been coming here for a while, I mean from day 1 since it opened and it has gotten bet","useful":2,"cool":1},"61boOi0wuGuqejSmMO2gLA":{"text":"Victoria and her team provided the best service for our company Christmas party. They were","useful":0,"cool":0}}