{"A0ZYRYJ5HqZNOZygScia-g":{"text":"Longway has THE BEST food and THE BEST cocktails, can't wait to come back. Get the peas an","useful":1,"cool":1},"Jq09GSBhOp0j6g0KKxfK4Q":{"text":"Longway longway what can I say. Your greenacolada, your ENGLISH PEAS, and your radishes. Y","useful":1,"cool":1},"32xrCbxy1xs0rYO6WvfFEw":{"text":"Such a great spot if you're looking to avoid the tourist traps in the quarter. The drinks ","useful":1,"cool":0},"F3W4yNSf3RgGlcO6bJAhEg":{"text":"Fantastic place.  The manager/owner is a success story and should be applauded for his  ef","useful":1,"cool":1},"43QAWx5RRM15Hh_TVYwa6g":{"text":"I blame myself for choosing this spot for food. Maybe if you're there for drinks exclusive","useful":1,"cool":0},"1tdR7JasOWO4weOr6Yn4qA":{"text":"Really amazing food and spectacular service. We had a week-long trip through three souther","useful":0,"cool":0},"4qrZo7HtvT9X6bgem2bjxw":{"text":"Phenomenal delicious food with wonderful friendly service. Turns out they've only been ope","useful":1,"cool":0},"f__b2MgRIHzkzgDqIoHucg":{"text":"Fantastic food, impeccable service. The salmon and the chocolate mousse were both out of t","useful":0,"cool":0},"r6wRMo2CUGCj9VY0HgfrMg":{"text":"Amazing drinks and food! Stumbled into this spot upon realizing I wanted to escape Bourbon","useful":2,"cool":1},"IPWGZVvdojZkUWYy3tH_iA":{"text":"The fries with pork belly, calamari, and this slider-looking-like with chicken was delish!","useful":0,"cool":0},"GJd2iDhXlEUuuWxUbu5gYg":{"text":"I was really excited to try this place while we were on our New Orleans vacation because i","useful":1,"cool":2},"GOXQy8NoAhe2GdVg_OJazA":{"text":"Friendly, attentive staff; chic but relaxed atmosphere; great addition to the Quarter!\n\nI ","useful":1,"cool":2},"wVqGrZCL5Ykco9iHyMk9Ng":{"text":"Oh, Longway! I am so happy you exist! Longway has the feel of a true local's spot right sm","useful":2,"cool":1},"1fzFc9BEV76anRzbhoaghQ":{"text":"Excellent establishment. Incredible cocktails, food, and a nice exclusive, but not too exc","useful":2,"cool":0},"1kgL7cZx2d0buRZ79bOz2w":{"text":"I am so excited about Longway Tavern! The interior is beautiful and the outside courtyard ","useful":0,"cool":1},"X7qT6eTfXRwrBMt6Ptb6Cw":{"text":"Perfect little spot for a cocktail on a little quiet street in the old French Quarter.  Lo","useful":0,"cool":0},"yEhhTzp18YW8EiA_x5K3Rg":{"text":"I am not much of a \"Yelper\" but I had to post.  This place is amazing!  From the atmospher","useful":0,"cool":0},"Wkud4-7NJ8vZLeblmc2tSg":{"text":"I love this new restaurant in the former site of Little Vic's. The reno gives a warm, hip,","useful":1,"cool":0},"-QYF1n0RDmwhW8_0CSeVSQ":{"text":"Loved it. Loved the food. Loved the cocktails. Loved the space with beautiful courtyard. I","useful":1,"cool":0},"Tr7-Fh1J8vUbChJRzfepeQ":{"text":"We had the best time. The best drinks and the best food. Our group of 6 ordered the \"one o","useful":1,"cool":0},"91AtzVSBT7qQa-vFzZ5tcQ":{"text":"Was spending Christmas alone with my pup in New Orleans this year, and was looking for som","useful":0,"cool":0},"yOiOwsNQgPJHuLSuzRv7Fg":{"text":"I love everything about this place.  Food, service and atmosphere are all excellent.  I li","useful":0,"cool":0},"hvyIpNTZ1bcMYPmOyZlFCQ":{"text":"Before I get into the review I want to make it clear the food was very good if not great. ","useful":1,"cool":0},"1UzyS4Pf1M-po5DobZcI9w":{"text":"I so loved the start of the evening at the bar...the bartender was displaying some serious","useful":0,"cool":0},"jJznKgD8wNFWkxeyQqGyNQ":{"text":"I went to Longways the first time with a few friends a day or two after I noticed the nice","useful":1,"cool":1},"tBkB8ePCiCsUnTej5bv64Q":{"text":"I love the location and that it's tucked away. The interior courtyard is really great and ","useful":0,"cool":0},"gV70kedFgpW9-5nDO3-K3A":{"text":"Great food, atmosphere and friendly staff. Was recommended by local and the delivered.","useful":0,"cool":0},"sW3kEY7zGeTy8GNNe1UxRw":{"text":"Hip addition to the quarter. The courtyard out back is a lovely place to dine. Drinks are ","useful":0,"cool":0},"mSG3rFBrJu3T9xaeRdLXnA":{"text":"Wonderful addition to the Quarter. Close to Bourbon but away from the madness. Downbeat tu","useful":0,"cool":0},"0uMI-hp44lp_jsfcJs6_zA":{"text":"At least the name is accurate.  My food was indeed a \"Longway\" away, as each individual di","useful":0,"cool":0},"e-kw-IwnjJ60sMbVTfW7zw":{"text":"Tristan is a  great bartender. The whole staff is wonderful. They remember you, what you a","useful":0,"cool":0},"Ux9R9qCUROZCn6oBuW1Lrw":{"text":"Delicious drinks, beautiful outdoor setting. Didn't eat here but food looked delicious too","useful":0,"cool":0},"VQGj75BZh3pEreP84MEw1A":{"text":"Longway rules. John runs a phenomenal kitchen. Have had the pleasure of visiting several t","useful":0,"cool":0},"7Ogb45D2q1PT0TAdvXV9jg":{"text":"Great innovative menu. Incredible craft and specialty drinks, along with great service fro","useful":0,"cool":0},"cFGkNcYM2V9AR_5QrM9J9w":{"text":"We stumbled into this great pub to get away from the crazy crowds on Bourbon Street and en","useful":0,"cool":0},"sDAo2PgQE8of3DTxpvi2yA":{"text":"Woah. Tried to find a cozy low key place off of bourbon and stumbled on this place. Wow. T","useful":0,"cool":0},"6zH8dnMOCo6trHJpye-dpA":{"text":"Our best meal on a recent trip to NOLA! Try the pina colada with rum and green chartreuse.","useful":1,"cool":0},"ZmZRSGQV_NiJyWmGjLrTOg":{"text":"Have been to Longway a few times - this was the first time for food. Disappointed. I had t","useful":0,"cool":0},"Yn_KJfCNdpU5ed5QCbRbnA":{"text":"Great place for crafted cocktails and delicious small plates.","useful":0,"cool":0},"znU-qAUPw0EmvHcdHbuaQg":{"text":"After attending a Holiday Soiree, we needed to continue chatting business and decided to h","useful":24,"cool":14},"nFdQe62Hiq5GPDHoCuxXaA":{"text":"Great, mellow atmosphere. Nice wait staff. Decent cocktails. Food - English peas were fres","useful":1,"cool":0},"xnhwIqUxDiHZ65FbROd8tg":{"text":"I don't understand the hype surrounding this place. Drinks were decent enough; shrimp toas","useful":0,"cool":0},"exfrKSOH01u1R_oGVoE4NA":{"text":"First visit to Longway was very satisfying. Got the \"Feed Me\" option for $35 per person an","useful":1,"cool":0},"KKcWhYikzZR_OVxCj6J7BQ":{"text":"This is a Great cocktail bar in French quarter they have small very delicious menu I tried","useful":0,"cool":0},"8GB7EDHBGTDihQ5hG2okaA":{"text":"Shhh...it's a great find! It's a cocktail bar with a small, limited menu- prepared by a ch","useful":0,"cool":0},"QIY25rsgfcEYNzUn1WD1zQ":{"text":"Great food. Too bad we had a surly waiter (who became surlier as the night went on), and m","useful":0,"cool":0},"JL8-PDJf0QNryQcwOACIWw":{"text":"Usually easy to get a table and cocktails and food are very good. I got the chicken cutlet","useful":0,"cool":0},"kp9j9ovtlUIq82ZhCV0QFw":{"text":"This spot is definitely a hidden gem in the FQ. Located right around One Eyed Jack's on To","useful":0,"cool":0},"NPVVRM-5OBtuXNLfNqBoDQ":{"text":"Really excited about this addition to the FQ as I love having a fun place to walk after wo","useful":3,"cool":0},"WcC3uiuUYcfwJBrDZhvksA":{"text":"The food is unreal.  Native NOLA living in NYC and cane here looking for an afternoon and ","useful":1,"cool":0},"if2vk3V7LXzdbflrI4vAgQ":{"text":"Drinks are so good! Great for groups lots of music. Make sure your okay with the noise! Ha","useful":4,"cool":2},"EX-DLy0gUlVtFdWXxh74ag":{"text":"We stopped here on our first night in the city and are so glad we did! There wasn't a wait","useful":0,"cool":0},"-NxMZGx1oK3to47VKLgqbQ":{"text":"Awesome spot. Great vibe, and the food is amazing! Lucky to find this bar/restaurant while","useful":1,"cool":0},"p8JrWjLXkwS3YfOw5D0jfA":{"text":"It was hot and we were thirsty found the Long way. Good bartender that new how to make a c","useful":0,"cool":0},"AUeqZfhAva2zEoZeWrqiDg":{"text":"Decided to try out their Coolinary menu and it was amazing! The Fig cake with rosemary ice","useful":0,"cool":0},"V9kO4BgHFnmmSb0uTq8qzQ":{"text":"OUTSTANDING! \nI've been coming to Nola for the past 3 years and have dined at most of the ","useful":3,"cool":1},"-sOFBkFvEvM4h6hn8yW3Xg":{"text":"Six stars!  This is the best new restaurant in New Orleans since Saba and Shaya ... rush h","useful":0,"cool":0},"Ku5OwbkSUV1Q_eZNFG8Mug":{"text":"Such a cute little bar and eatery. The shot specials are awesome and bartender approved! S","useful":1,"cool":1},"k_v4wlqJSmdg_YtPpqgNsw":{"text":"The Longway is a very lovely space with great food and a friendly hospitable staff. Very m","useful":0,"cool":0},"FJTFt1yVDbDMt3DxTSJp5A":{"text":"Brand new to the neighborhood and already exceeding my expectations. First impressions inc","useful":5,"cool":1},"u7TwXTUBixR9vRDsgVDCCQ":{"text":"Very nice bar. Happy hour prices for cocktails is very good value and cocktails are delici","useful":0,"cool":0},"XNKLvDELubQwRtaPFyMRxA":{"text":"Not bad. Some issues, but not too bad ll things considered.\n\nGood: \n+Nice looking place. \n","useful":6,"cool":1},"qM4yJ6Qrb_iauciGmWz9VA":{"text":"On a recent week-long trip to Austin, New Orleans and Nashville, this stood out as one of ","useful":1,"cool":0},"FVVaa6RQF92A2gXduOF39A":{"text":"Great service, chill vibe, food was good and fast... looking forward to trying everything ","useful":0,"cool":0},"J8vf0dbDJ02_jVzGAiiT7g":{"text":"I went in to this experience with no expectation other than the facade was pretty. Upon en","useful":1,"cool":0},"freWtBfhCo_X3ZdwY6RxSg":{"text":"Love Longway Tavern. Great place to hide in the French Quarter when you need to get away f","useful":1,"cool":0},"iZqj5FR-f6kRXlwbEykp3w":{"text":"Interesting place, excellent mixology...good food. Charming ambience with history and warm","useful":3,"cool":2},"JioR4-gBQQSAQ5OPk7RpqA":{"text":"Fantastic food. Just sat at the bar. The bouillabaisse was excellent. Service was very fri","useful":0,"cool":0},"kwJNJjLarIjue4bBQ1-MeA":{"text":"Omg! Just had a nice lunch snack, the chilled ramen noodles. Amazingly delicious!!! Perfec","useful":0,"cool":0},"Y_N7A85HLfCs0vQxLVBQ2A":{"text":"Second favorite place to eat in Nola, period. The food was AMAZING. Very fresh in season i","useful":7,"cool":5},"nJY85t860-0vFbdzPI6Q_g":{"text":"Update: I still LOVE this place and it's my go-to when friends are visiting from out of to","useful":0,"cool":0},"2ci52QrTRLydrapviagZ-w":{"text":"We recently visiting from NYC and had a great meal! Being a serious foodie, we mapped out ","useful":4,"cool":0},"xF95olToh1w8bU6jnuyZyQ":{"text":"This is a must check out place! The menu is small but everything we tried was amazing! We ","useful":1,"cool":1},"20iAsgqNmDOpGF5iSPwU4w":{"text":"Used to love this place, went back recently and service wasn't so great and the menu had c","useful":2,"cool":0},"V0sH4d8WOWZ0RA07wrLHZA":{"text":"Incredible experience. The food was killer, the vibe hip and casual and the drinks well ma","useful":1,"cool":1},"jvjI4t_c9Hj9UfJwQJOb3A":{"text":"Yum yum yum!!!! great little place with a fun vibe and food is delicious! Tapas style. gre","useful":0,"cool":0},"xWjvFRrp_myE62SqnWblhA":{"text":"We love Longway! Creative drinks, there's always something different and yummy on the menu","useful":0,"cool":1},"SIXz65LXANA_ZLpknIvDZg":{"text":"We came to celebrate a birthday. There were 8 of us so we had to wait a little bit for a l","useful":14,"cool":11},"i8fe9YabFoDSlOMCIgFcNg":{"text":"We were in town for the tail end of Tales of the Cocktail, and when running into a few ser","useful":4,"cool":3},"cavwLSEh3qj-16HdobFrKw":{"text":"Bartender was so rude clearly not interested in providing any kind of customer service.","useful":1,"cool":0},"7lItnrMmUk9aus5tvodeJw":{"text":"While visiting New Orleans for the first time my brother and I met a family member we'd ne","useful":0,"cool":0},"T6kxktt-q0vAp__0Ce9SEw":{"text":"Awesome place tucked away in Toulouse between royal and bourbon. Reservations were easily ","useful":1,"cool":0},"40aqDuh1k6xW-zg8FUqHvQ":{"text":"Longway Tavern is so good! Seriously, I had one of the best meals ever here. And I absolut","useful":3,"cool":2},"_HGuJVzMnPCpZ8KgFG37HA":{"text":"I went for a friends birthday last night.  Our food took absolutely forever to get to the ","useful":0,"cool":0},"rLtz4VDh8ZAaYY9eIxfREg":{"text":"We had dinner, and neither the service or the food was stellar.  The outside seating is te","useful":0,"cool":0},"huVxBa4wP9BoVyn0phTqOQ":{"text":"An amazing American restaurant in New Orleans. The food is amazing, the decor and vibe are","useful":3,"cool":2},"Z2ZgtzJtSZBP0Atb-f9UkA":{"text":"I 100% stand behind my previous review of Longway Tavern, this place is AMAZING!! I will v","useful":0,"cool":0},"EWaSO0a50R4K2EZgn4KG0Q":{"text":"MY FAVORITE COMPLETE MEAL IN 2018\nUntil October 12th my year was \"2 star meh\" restaurant-w","useful":7,"cool":4},"xDWRWXFLHrV1VpFqlwq7ww":{"text":"Cool little hipster joint with great food.  Those 4 stars are really like 4.5.  Atmosphere","useful":0,"cool":0},"9Mk_Pe3vFuzO1lc_ocbkLA":{"text":"That place is such a great escape from the usual French Quarter bar scenery. No tall plast","useful":1,"cool":0},"NYrpXkrpBTbdIuGyHr9kDg":{"text":"This place is just cool, the food is awesome.  The courtyard provides a true New Orleans e","useful":0,"cool":0},"4-t_mF1PpmFBXnOip1IsEw":{"text":"Incredible food, incredible cocktails, and incredible service. The music was great too. \n\n","useful":1,"cool":0},"YqP5wuCcmG6J3uErZeesBA":{"text":"This is a Great cocktail bar in French quarter they have small very delicious menu I tried","useful":0,"cool":0},"cxrQjRjFMOWS6wUUIpj3zw":{"text":"Tried to go to Sylvain but they were closing. They told us to come to this sister restaura","useful":2,"cool":1},"uetRorFI4W8ITUxaNpaKPg":{"text":"The food was beyond expectation and the cocktails were beautiful and delicious.  Service w","useful":0,"cool":0},"dCzbDBSb4-79m7utkGai4w":{"text":"Dropped in here on a lazy Sunday for lunch, everything was exceptional!   You order up fro","useful":0,"cool":0},"wZ4V3PFu0jKDaKGLe0qayg":{"text":"a hidden gem in the Quarter. If you're local and haven't tried it yet, definitely come vis","useful":2,"cool":1},"HDtzmX3uhTq8MSLP8t5HrQ":{"text":"Awesome new spot in the quarter! Excellent selection of tasty libations at amazing prices!","useful":1,"cool":1},"2jQqvM1jq2QmXxfp8DZNXw":{"text":"I feel this place is a little hidden gem. My friends and I almost walked right past it. Th","useful":1,"cool":1},"Ax95bA4XFGa5f-SQS2LbGQ":{"text":"Tried this place for Coolinary Menu and were wowed.  Loved the variety of tastes so well c","useful":1,"cool":0},"HkKhpdCdnT65yRK6kJlkyg":{"text":"I never write reviews, but this experience was just bad. Service was average and food was ","useful":0,"cool":0},"yeME5D5m60b1yD5mZD5tQQ":{"text":"What surprisingly classy spot just off of Bourbon Street!  The last time we were in this s","useful":3,"cool":2},"mI1pfcn4Adc5Hw8AlS7GRw":{"text":"Absolutely delicious brunch visit! Made a reservation via OpenTable, and upon arrival were","useful":1,"cool":2},"1BBMm8lEhftu73beKP-H_g":{"text":"Such a cute romantic atmosphere. There is a court yard out back that's perfect. We didn't ","useful":1,"cool":0},"gHQy6jKLafwtu36fbyy3Vg":{"text":"Ajax is an incredible bartender. Rachel was also fabulous but Ajax- holy cow. A magician b","useful":1,"cool":0},"_ojb5lJLuGiX2IB0q05shg":{"text":"This place was sooooo cute! My boyfriend and I were just walking by when they were opening","useful":2,"cool":1},"yH8LTeVMqOKPeYudGWQxsA":{"text":"Staff here were particularly rude on Halloween night. Menu was a hodgepodge with poor form","useful":0,"cool":0},"W1qKXAVX2LxL2Gc3ESUhRA":{"text":"So glad we stumbled into this place. We were walking through and glanced inside and decide","useful":0,"cool":0},"802EHPYahxF4CNWQKAKVqQ":{"text":"We checked this place out after not eating all day, figured it looked good for dinner and ","useful":0,"cool":0},"RbcaIeuEjhge5hBavDKRfQ":{"text":"Awesome cocktails and food. Love the mezcal with Fanta back. Perfect location to escape th","useful":0,"cool":0},"V9jMk50MGXGxIpkj1D8UIQ":{"text":"Seating outside was nice. Staff was friendly, but do not come for the food. Limited menu, ","useful":0,"cool":0},"E8Ps3wnQ36RWKn3eaLts2g":{"text":"This place is such a gem. We dined here on a Friday evening while visiting New Orleans. We","useful":5,"cool":3},"t3WqrTPVuT8WzuW8ZJP1HA":{"text":"Such a great spot in the French Quarter! Randomly came upon the tavern walking around with","useful":0,"cool":0},"GGg1xXUN4kb-sdB4bTFd2w":{"text":"Everything we had was delicious (radishes, squash, chop salad, calamari, corncake) so much","useful":1,"cool":0},"8wAkS_jAsJUV_m3VudUaZQ":{"text":"Small but mighty!  Loved this little hidden gem in NOLA.  Stopped in one Saturday afternoo","useful":2,"cool":0},"8uFF1QBp3iXjWEI-1ny3Zg":{"text":"When you leave a bar and just can't wait to go back to explore more, def 4 - 5 stars. \n\nWe","useful":8,"cool":4},"_IBqdFea0JlYg8N_xQY_Hg":{"text":"If I lived in New Orleans I would literally go to Longway Tavern everyday! One day I would","useful":1,"cool":1},"CpwSZpNwYJWBBQ9RxRbg4Q":{"text":"Just swung by for some to-go drinks and a snack, and they were awesome. Happy hour from 4-","useful":1,"cool":1},"hRyp2XZ4hH-Pp_P2vjdB8Q":{"text":"Well well, well, a very nice spot perfect for when your alone or even hanging with friends","useful":0,"cool":0},"Np2iYwQjPOR1hpjNN56saw":{"text":"Longest Tavern is a wonderful, hip, modern restaurant located in the heart of the FQ. They","useful":0,"cool":0},"awDKSkxAilaROoDt2JNYjQ":{"text":"Great addition to the FQ. The food here is delicious, and the drinks are. Creative as well","useful":1,"cool":0},"r5HRgcBzBnieRVutJJ-kxQ":{"text":"Bartenders were so friendly and welcoming. The courtyard is adorable. The drinks were deli","useful":0,"cool":0},"O1MY--EiSAZ73flWlZdexA":{"text":"Dope spot.  Interior is cool and comfortable, like the place has been here for ages.  Drin","useful":3,"cool":2},"pjoHpuK5jb1gBoAC0wSldQ":{"text":"I visited Longway for the first time last night. Our server, Mel, was absolutely fantastic","useful":1,"cool":0},"caCUm_wyR_8nSmyjdnpNeA":{"text":"What a hidden gem in the hustle and bustle of the French Quarter!  We had drinks from thei","useful":0,"cool":1},"tbxxl2YcmtOMRcbvd-ckWQ":{"text":"Right In the heart of the quarter we visited during the Christmas miracle pop up where we ","useful":0,"cool":1},"rfd4p0hhDyy-4vKDtchAdw":{"text":"My friend and I were exploring New Orleans on a Friday afternoon and were told wonderful t","useful":1,"cool":0},"vbRgT2WV4lCbMvN3SN1yxA":{"text":"Visited during the Miracle Pop-Up, so I can't vouch for their normal cocktail menu, but th","useful":1,"cool":0},"k6_3nsM9kau5AoKe13vg-Q":{"text":"I enjoyed the mezcal shots with Fanta! That was a pretty good start to my evening. The foo","useful":1,"cool":1},"j87rcTeotnc7efVLRNWVtw":{"text":"Wow'd. This place is fantastic! They were able to accommodate a large group of 9 on short ","useful":2,"cool":2},"JqcBHmNu4XtWeSvUPtUIPQ":{"text":"Such an awesome find for our last night in NOLA! AMAZING FOOD. I totally recommend the hom","useful":1,"cool":0},"f2eXtAUAUVev2EistdVMTw":{"text":"I'm a long-standing fan of Sylvain and Meauxbar Bistro, so when I found out that Longway T","useful":1,"cool":0}}