{"7N-3mKw4ta1CU-yOfGfIFQ":{"text":"EVERY time I order, something is wrong. I pay for extra icing or sauce, NEVER there. No ap","useful":0,"cool":0},"GXXaqZwCVAWRIMTNJUHuOA":{"text":"Ordered pizza and buffalo wings, the worst. \nThe pizza had little or no sauce, was dry.\nLa","useful":1,"cool":0},"kCSPCffibvZho6t8tFXm2A":{"text":"Every time we order take out they either forgot part of the order or it takes well over an","useful":0,"cool":0},"udpfRG-w2VehsyGCk8ZJ2g":{"text":"They don't answer the phone, can't pay in cash at all anymore, won't even let me pay cash ","useful":0,"cool":0},"dCauYSuLc6Dcq9PIEgyvsw":{"text":"No complaints. Delivery's always on time. And they sell medium pizzas for $4 sometimes whi","useful":0,"cool":0},"GXJg-d5PGD7fmdgQKbxREw":{"text":"Wish I could give zero stars...literally the worst service I've gotten from any Domino's a","useful":0,"cool":0},"ChcbSQliNOibbRq9s2jQHw":{"text":"At first we were becoming fans. The garlic crust is delicious. But if you are a vegetarian","useful":1,"cool":0},"rAhcBqUQG0BgU7mY4Zduhw":{"text":"Less than a mile away, ordered at 9:00 the estimated delivery time was 28 to 38 mins. What","useful":0,"cool":0},"TfyPVHV7d8fmna-AjJaB2w":{"text":"Pizza ordered, CC charged, no pizza delivered, no answering phone----pretty much definitio","useful":2,"cool":0},"dNi5iCmOPLEGJEOH8a646Q":{"text":"Every time I order carry out here I have to wait so LONG for someone to even greet me. Whe","useful":0,"cool":0},"mqB8kCLxcNEJ-II4CjVUlQ":{"text":"Took 2 hours 45 minutes to arrive and it was cold. I ordered 2 pizzas and a sandwich and t","useful":3,"cool":0},"rdXPeKZPdx5jh_7X8JDkNw":{"text":"Dominos is my favorite Chain Pizza place...needless to say I order there ALOT....BUT this ","useful":0,"cool":0},"HVQG2IXICGYB3bhUe5hX6A":{"text":"They always forget my sauce and they take forever. I've stopped ordering Dominos because o","useful":0,"cool":0},"dLMeyw8PFXKUlXpOoFBK_g":{"text":"Ordered delivery.  Got sandwich.  Alfredo pasta. Mango habanero wings.  Wing order was wro","useful":0,"cool":0},"0OLE99ZhfpDFWP1-yoTaSg":{"text":"This is my favorite dominos ever! Taste is always there and the manger (shaye?) is one fin","useful":2,"cool":1},"uc6on_NI1i8nrQ8Idz01uQ":{"text":"This location has an open kitchen and kids can watch the pizzas being made. The guys were ","useful":0,"cool":0},"xPMScxEKT4Zg82rwYZAvXg":{"text":"It's Dominos, not Commander's, so let's be fair. This shop keeps my boys happy with inexpe","useful":0,"cool":0},"IaHWQ2iObh_HOUDHqJ9NBg":{"text":"Come on Domino's and not just this one, all of them. I just happened to order for my son f","useful":1,"cool":0},"micZb-YlcVxACzIdk2W2Wg":{"text":"I ordered a pizza from here and received a call from someone at the store who said, we are","useful":0,"cool":0},"10MNoOWX4iAUL-DImmRQkA":{"text":"I don't do reviews ever, but I've been here twice in the last month, and both times were a","useful":0,"cool":0},"BxaMzLiwEOmeNxfDOoXdqQ":{"text":"I came here to get some pizza Since they told me they don't do deliveryI was hungry when I","useful":0,"cool":0},"D5o7s8ZdJ08jYLz5-q_TSQ":{"text":"I ordered a pizza delivery 2 hours ago with a tracker stuck on \"order quality check\" for o","useful":0,"cool":0},"iqNtsuXoBn49G0NV3zh2TA":{"text":"This is the best dominos pizza in the city. They never disappoint. Well actually one time,","useful":0,"cool":0}}