{"CQmDcDj4NuSPszqnJ1M7ig":{"text":"I didn't really stumble upon any coffee roasters that I was familiar with while I was in t","useful":1,"cool":0},"qhEpi8OpUmJpqsH4TedRRw":{"text":"Decent service for the CBD, this is pretty much a to-go cafe, though there is some rather ","useful":0,"cool":0},"tS05OimMtpyWHYuacRvVsg":{"text":"Rudest service ever.\nI work nearby, and go there only in the most extreme circumstances: I","useful":1,"cool":0},"NuRVsNUz24fOwPqJUbtlyA":{"text":"Didn't realize this was a chain, but since I've never been to a PJs before, I figured I'd ","useful":0,"cool":0},"XMBSBmu-L9sPMflt4jo6DA":{"text":"Great place to stop by on your way to work for a quick pick-me-up, or even better, a place","useful":1,"cool":0},"JG6Y6b30QXp2dcZWehqBGA":{"text":"Three friends of mine and I visited this location this past Saturday  like I do often on S","useful":1,"cool":0},"5Ys03VZmgRXf-q5I8okmgg":{"text":"Stale pastries & rude service! \nJust walk a few blocks up to get better coffee from CCs. I","useful":1,"cool":0},"slVXx49T149VI6kgDO2Kvg":{"text":"Anybody who knows me well, knows that I go through at least a large cup of coffee a day. A","useful":0,"cool":0},"EV1hZXlk1hDxhDOkCuSx-g":{"text":"This is the best PJ's there is, period.  I have to drive past 2 other PJs on my days off t","useful":3,"cool":1},"90BVzI37rgAlj5Sx-q4X8w":{"text":"Great place for free wi-fi and for an uplifting caffeinated beverage.  Definitely stop by ","useful":2,"cool":1},"wfB5tNKU9_XQ6o-Jr-GDQw":{"text":"Really liked this place.  It was close to the hotel (and a much needed break from Starbuck","useful":0,"cool":0},"8ZZiZEQaKzy0b8HrB7iE2w":{"text":"Horrible!!! What happened to southern hospitality???? Rude customer service, not kid frien","useful":0,"cool":0},"mvKyl9cbuGQsQ1_slqSmtA":{"text":"Starbucks is surprisingly absent from downtown New Orleans, and PJ's seems to be the local","useful":0,"cool":0},"3WdOfwr8akB5CZL838FskA":{"text":"They should really consider calling PJ's \"Home of the Rock Hard Bagel.\"\n\nCause that's all ","useful":3,"cool":3},"YA6L_ipODBuJxOoAcM8O2A":{"text":"Although they make a mean iced mocha (as does every PJ's Coffee & Tea location I've ever p","useful":3,"cool":1},"PqKHoqCns0c5PiRLGcT5VA":{"text":"PJs has low quality coffee been to make a coffe at first place. Secondly,  this particular","useful":2,"cool":0},"HDkpnieFI1azC_FkfCyU_w":{"text":"Normally I order a cappucino when in a coffee house, since it's the only way to get a stro","useful":0,"cool":0},"JtxbDxzgTtXqBMWVNTleCg":{"text":"How's their coffee?\n\nI'd like to know but they did not bother to open this store anywhere ","useful":0,"cool":0},"TzzD6wzYz56CRPMjUmVb_A":{"text":"Literally the rudest employees I've ever been in contact with at a coffee shop. There are ","useful":3,"cool":0},"bcwExH7sp7IbQyyn26Z03Q":{"text":"Sour taste in my mouth.  This location has been called \"the good PJ's\" among locals.  Desp","useful":5,"cool":2},"Rttcpx7FE2z0o37nZA5NKA":{"text":"Small store but very efficient, went here for the first time yesterday, espresso was excel","useful":2,"cool":2},"VWZLjGnXoZRI9ez86kz8UA":{"text":"PJs has closed but Satsuma looks like it will be opening soon.....can't wait!","useful":0,"cool":2},"JIlX4b40JefzAel7aCzAwA":{"text":"Last time I got a granita here, I had stomach cramps all day...I guess it had been a while","useful":0,"cool":0},"KwrN8gwtRSSiA9j7bRHpkg":{"text":"Good For Grabbing A Quick Cup O' Jo\n\nSITREP\n\nOn my power walk from The Hotel Modern to the","useful":9,"cool":7},"dXXJ3feU9bfUVv2Uk4ZAug":{"text":"2 years later and... baristas still seem unhappy and rushed in the middle of the afternoon","useful":2,"cool":0},"qRfcEpIvk-UK_yCDwxCsVQ":{"text":"I ordered the frozen coffee drink and it was not as expected.  It was bland and tasted lik","useful":1,"cool":0},"rE-Gijd65GEPd02S3Cv_sw":{"text":"Good coffee, quiet place. What more could you ask for!?","useful":0,"cool":0},"ybwKrlm_Cd16PqGjd4v_Zg":{"text":"Man.\nA 2.5 star average makes sense - in the 10 minutes I've been in here, the barista mad","useful":2,"cool":0},"JtZWucatJmG3le9to4XJAg":{"text":"Staff was really prompt and courteous! I ordered the Red Velvet Mocha blended, and let me ","useful":0,"cool":0},"6NNpv3OeJcmKVF1buPRRjQ":{"text":"pj's iced coffee is the original and it rules.  before starbucks was blending coffee bever","useful":0,"cool":0},"kaGRlHRPEBCF_uREGsPt-Q":{"text":"Visited NOLA for a few days. I saw PJ's coffee everywhere, and decided to grab a cup mysel","useful":2,"cool":0},"rEUmH-OlhocaQSYz4XNdRA":{"text":"Solid cup of coffee.  Tasty cranberry muffin.  Was directed here by a friendly local that ","useful":0,"cool":0},"Zuh4WtfZuAGUy27095Q7TQ":{"text":"Stale pastries and cheesecake. I've been to this location a half dozen to a dozen times. T","useful":1,"cool":0},"fCADYo58WFaOq1d8WvbE5A":{"text":"So I go in and ask for a French vanilla iced coffee, croissant and bottle of water. As I'm","useful":0,"cool":0},"4nYVm8ipUJVY6dakpgO4MA":{"text":"Avoid this coffee shop at all costs.   We sat outside to eat our PJ's coffee Shop lunch an","useful":0,"cool":0},"tBdoa-gG8IczhZq6Gz9G3A":{"text":"PJs iced coffee is delicious and this location is no exception.\n\nService was surly and dis","useful":0,"cool":1},"85Xvrrc6rzJvTpM9LjpnCg":{"text":"\"How bad can coffee get?\" Humanity has pondered this question for ages. Yet this unassumin","useful":2,"cool":0},"zqYlHIaxvi6c0e0h-K8-Gw":{"text":"Everyone in our group of 6 that ordered food (egg & sausage biscuit, etc) said that they w","useful":1,"cool":0},"0E51VFQt1fGlGFpliM7qrw":{"text":"GOOD coffee.  I like mine black and a little sweet and the chain coffee usually is too bur","useful":2,"cool":0},"BpGgOj8NuYO0gEqPi6asSQ":{"text":"i used to go to Tulane University in New Orleans for a year before I transferred back to N","useful":0,"cool":0},"XOPtrPRWc65A8wTJxBPFcg":{"text":"This PJ's has a good location for the Warehouse District and the CBD.  Their hours are fai","useful":0,"cool":0},"LqO6VU3zDpKQYZ8DTkI9nQ":{"text":"I'm not sure any of these baristas have been properly trained. I work nearby so I go in fa","useful":6,"cool":0},"LoV69Y8TgD081x0gYT1LCQ":{"text":"Tried this place with a friend looking for an alternative to Starbucks.\n\n+Tables outside a","useful":0,"cool":0},"iJjiVLWX-1vZbp33k3YPYA":{"text":"I really wanted a latte with my second drink choice being a cafe au laite, however, all th","useful":0,"cool":0},"kyrx2AbK_Ph10CTNLlQmWw":{"text":"went here for much-needed caffeine fix post Isaac.\n\nthe service was great, and i even orde","useful":2,"cool":0}}