{"M2uQZs0rnlUijHSmGx4zHA":{"text":"Came in after attending the Zurich Classic golf tournament. It was a warm and a bit humid ","useful":5,"cool":4},"I647uOIzj5JVUVlBvulliw":{"text":"The flavors continue to surprise me. I had Bananas Foster, Pear Champagne Sorbet, Blueberr","useful":0,"cool":0},"VZpiOLgwFwineEN_Mlkreg":{"text":"BEST ICE CREAM. Why?\n-soooo many flavors\n-Unique flavors are creative and taste better tha","useful":0,"cool":0},"TPTAzMKcEpqJnIU2gwkcPA":{"text":"Delicious! I had the famous cream cheese ice cream topped with fresh strawberries and whip","useful":0,"cool":0},"NuJnV3-xYd6e3MonvALF6Q":{"text":"I'm going to make the bold statement and say that I'm kind of an ice cream fanatic. Whenev","useful":1,"cool":0},"uMhLOrFjSDeNZT1UzkDv7g":{"text":"I've tried many ice cream shops in New Orleans and this one has made it to the top of my l","useful":1,"cool":1},"hoBzd-RkiZgX-82SiZYOjA":{"text":"Maybe I'll write an updated review bc I really want to try it again but from hearing other","useful":0,"cool":0},"6x4HUpYwoH7l1PisWLvjQw":{"text":"Yeah I'll go 5 stars. Great little shop. Nice employees who don't roll their eyes when you","useful":0,"cool":0},"nLUjnfjfSCEFRrJtU3bnMQ":{"text":"this was so worth it.  first, what an awesome innovation - the mini-scoop sampler!  i can ","useful":0,"cool":0},"l84nl5askpQKxV6PvEUAmA":{"text":"I love this place! A group of friends and I were looking for a late night place to grab so","useful":7,"cool":4},"NKNCz1n4IuztBX7dXCro5A":{"text":"The variety of ice cream flavors offered here is ridiculous, and no matter which flavor yo","useful":0,"cool":0},"VtDpNBt2Zx2tzrVPzsF32w":{"text":"Best ice cream in New Orleans!  I personally love the chocolate peanut butter and fudge.","useful":0,"cool":0},"a5qrinSlI_uwlRPN3W0kZg":{"text":"Just another delightful stop during my New Orleans visit. Loved the look of it when we fir","useful":2,"cool":1},"H0AjTvHtgd8m7ghqdIhUeg":{"text":"Lives up to the hype. Bring cash as no cards accepted (had to run cross st for atm). Laven","useful":1,"cool":0},"D_XrGOMLwPjNZ4GCElt-4A":{"text":"This place is still unbeatable. Inexpensive, INCREDIBLE-tasting, whole-ingredient ice crea","useful":0,"cool":0},"XJ8kHvx8GiLM8cDcToRIaw":{"text":"There's ice cream and then there is creole creamery ice cream. Made fresh right in the sto","useful":0,"cool":0},"pA9A9tHeDotstbF5It2X6A":{"text":"I thought about writing something witty and entertaining but then I read what Scott S. wro","useful":4,"cool":2},"cn7uuccd9vBu19DpozshMw":{"text":"If u love ice cream, you'll be in heaven here!  A must try!  So many unique flavors to cho","useful":0,"cool":0},"roY4uaad-fhic_XO1yafmg":{"text":"We walked here from Napoleon and St. Charles after dinner one night. The crowd was light a","useful":0,"cool":0},"T-kZIhwUtXr7_7_Nfq-Riw":{"text":"Absolutely the greatest ice cream that I have ever had! Went on an extremely busy night, b","useful":0,"cool":0},"TAouQe0vUiju0aScp0CzFg":{"text":"The Best icecream on this side of heaven. I love this place the icecream here is soo flavo","useful":0,"cool":0},"UXaloWHjANqKsPN_KhFk2A":{"text":"So yummy with so many flavors!! We got here 5 minutes before it closed and there was a hug","useful":0,"cool":0},"tWedDf3j0w_ZIysfjwgRYA":{"text":"Amazing Creamery -- a great selection of flavors! \n\nI sampled a variety of flavors before ","useful":0,"cool":0},"2xoCnaXgWT2FklF6T9de3A":{"text":"THEY ONLY TAKE CASH!!!  So we took our ice cream addict for a pre dinner treat and picked ","useful":0,"cool":0},"YyLF54eMaT_r7NmP9ET5Ow":{"text":"A really good ice creamery with a million unique flavors, and the ability to order 4 or 6 ","useful":0,"cool":0},"nCY1_dj5aC43Z-SMYhI6Yg":{"text":"Even though I'm 2000 miles away and have perfectly good ice cream stores all around, I sti","useful":0,"cool":0},"2-Awbp5nEczMuzNGb8XGeQ":{"text":"Best Salty Caramel I have ever had & you know I love you Jeni! Your shits still splendid b","useful":0,"cool":0},"bPNWOk9pZq8uwutLaILhZQ":{"text":"So many options I don't know what to choose!\n\nI definitely thought my friends and I were t","useful":0,"cool":0},"ROvzyZrdfywD-C-ZVgIhHA":{"text":"I painted my bedroom the color of their lavender honey flavor. No joke. That is the most b","useful":11,"cool":11},"fNEijI8X4Io9Ng5y6lG5Aw":{"text":"I could come here every day.  The ice cream is fresh, creamy, with imaginative flavors tha","useful":0,"cool":0},"tFuzenzFLuqJ7PVYcG-Xgg":{"text":"delicious....  soooo creamy.  They also let you taste test everything.  I got the cafe au ","useful":2,"cool":1},"iG9r5_8Lnxutyn11_UEF6g":{"text":"My friends and I always love coming here! They have an array of flavors and they are all u","useful":0,"cool":0},"R8kKHehMW9W8bWxnLMniKw":{"text":"Great local place and plenty of delightful concoctions.  I'm a strawberry fanatic so natur","useful":0,"cool":0},"m9CMoy_vE-i8FHeULYFK3w":{"text":"The staff was super nice and let us try some samples. It looked nice and clean in there! T","useful":0,"cool":0},"hp7edpp7WLUJeoAmkY9X0Q":{"text":"I love this place!! Because i can have almost any weird flavor imaginable!!","useful":0,"cool":0},"so8zsJk-2m0nd-3J2sIZ9g":{"text":"This is not the place for vanilla ice cream with fudge sauce. Go to your grocery's frozen ","useful":0,"cool":0},"oYabpfMTcSNEskHmK5MG-g":{"text":"Went here with my husband and another couple Saturday night.  Not very busy when we walked","useful":0,"cool":0},"0JkaCb5sPyCCRJmS09t6tw":{"text":"This place is ridiculously good and they make all the ice-cream themselves too.","useful":0,"cool":0},"jBu0dpM5MVe0UmCLdLVf4Q":{"text":"Really great ice cream with unique flavors. Surprisingly I enjoyed the lavender honey. If ","useful":0,"cool":0},"3-dh2JnxIyvIqXuHrJiTAw":{"text":"Will go out of my way for Creole Creamery. Flavors are innovative - Lucky Charms, Lemon Ic","useful":0,"cool":0},"gFPwyaHa1Qb2n72TJUR-Dg":{"text":"Guy called Bryan Gilmore is Head Chef at The Creole Creamery who I think is a genius wizar","useful":9,"cool":5},"MkHvcM3e8Mx1EPsBHjgEmA":{"text":"Great ice cream at decent prices. Can you ask for much more? Got to admit, we've been maki","useful":5,"cool":4},"CMp0w5cySb4n4XxgmoFdZQ":{"text":"Prices are higher than other locations  ps cash only Luv the freshness  and the rest of th","useful":0,"cool":0},"6xDXVu9CzmmATDaLPLRROQ":{"text":"OMG!! If your anywhere near New Orleans, you CANNOT MISS THIS PLACE!! Custom flavors that ","useful":0,"cool":0},"7SK7I1XOt65qWkHrC_w4uA":{"text":"Honestly . This ice cream spot changed my life when I lived in Nola . I had never heard of","useful":0,"cool":1},"w7J9KcNecJEOSOM3tkUsWQ":{"text":"Amazing. Interesting flavors. Cute Decor. Big servings. Great taste. You will never go to ","useful":1,"cool":1},"beTirivGyCsDMcYZZHF72A":{"text":"Chef made Ice Cream in fun, family oriented, old school environment. This place is amazing","useful":0,"cool":0},"gehayUUtQgqcDBwmNzmJ3A":{"text":"Love this place!   A must do in New Orleans if your an ice cream junky. Sooooo many flavor","useful":0,"cool":0},"IhcO3at9d2IMvbwhOaqF3A":{"text":"With flavors like Buttermilk Drop, Doberge Cake and Red Velvet, Creole Creamery is amazing","useful":0,"cool":0},"PrdHcvb-N66HYqniWe51Yw":{"text":"I am craving Creole Creamery right now but don't want to leave my house!\n\nIt is so so so g","useful":0,"cool":0},"KF874ZYPxyKyED-ApwtHlA":{"text":"Ditto every positive comment about this place. I didn't know my life was incomplete before","useful":0,"cool":0},"2saMztrYu48VTcKKxtmd6Q":{"text":"Love the ice cream.  You can also get pints at Rouses for pretty good prices.  I love the ","useful":0,"cool":0},"JaIBM7hVAvIEImo3R2g78w":{"text":"I will definitely be going back! The ice cream was creamy and smooth. I had the king cake ","useful":0,"cool":0},"yIOcXKUwZDjTrRSlkzg_0w":{"text":"Oh. My. Gosh.  We had stayed 3 days in the Garden District and had been told about Creole ","useful":0,"cool":0},"8mj-ym2G1WVSbLvINcR2mg":{"text":"This ice cream place was delicious!! Service was good interior was nice! The whole place i","useful":2,"cool":0},"ffeZcaePFS1pYBcR37EGbw":{"text":"This guy is God of sweets hands down.... I used to not care about ice cream... But all tha","useful":0,"cool":0},"Cbz8c6BRsl55Wmd4K72sGw":{"text":"I had a chance to enjoy me some Creole Creamery on a late Saturday afternoon. It wasn't ov","useful":2,"cool":3},"ue9Pne3pS0G9TRjvWO5P3w":{"text":"Although the lines are usually long, the cream cheese ice cream is worth the wait. They ha","useful":0,"cool":0},"MWf0kGX9x-oj6rQaqt28pg":{"text":"Best ice cream on earth. The end. How can something be so delicious? I don't understand it","useful":0,"cool":0},"QUc7cDV-JZpvVRCNobs9Fw":{"text":"fast and friendly service.\n\nfor the indecisive (read: me), there's a nifty little mini fou","useful":1,"cool":0},"fJNMVn8ISMMzXReyc1WTLQ":{"text":"Tons of great, specialty flavors that are truly unique. A $6 milkshake is huge, and they w","useful":0,"cool":0},"kQUcN_iHxYa2zZvbrpsSvw":{"text":"We came here after lunch for a quick dessert. Wow was this ice cream delicious! My fiance ","useful":0,"cool":0},"P679ccMOvvUTToLr2Q4LJQ":{"text":"Get the black and gold - french vanilla and chicory ice cream with hunks of oreos and choc","useful":1,"cool":1},"VRzGL-gAhlXt2_X7o1ul0A":{"text":"Incredible assortment of flavours - I couldn't even look at them all before I decided or e","useful":1,"cool":0},"kOX_jKONgGtebCzPjo9QCg":{"text":"Delicious! I love going to ice cream shops that make their own product and get creative wi","useful":0,"cool":0},"oxohZW-UxvmW0nbDBJ9NrQ":{"text":"I saw the Creole Creamery on the Food Network's Diners, Drive-Ins and Dives and knew I had","useful":0,"cool":0},"pQdfyaV1S8zyGFmRi_O1JQ":{"text":"Stopped in tonight after dinner. I had the red velvet ice cream on a waffle cone. It's was","useful":0,"cool":0},"jk9H7eIBPwh4dUYPwrh5tw":{"text":"Pretty good ice cream with interesting flavors. I didn't see the sign for not getting too ","useful":0,"cool":0},"1lwgqKYnvLaTy2RsoIES9w":{"text":"Simply the best ice cream anywhere!! Make sure you try the Chocolate Amaretto Cheesecake","useful":0,"cool":0},"Gbab_qevOY0ixq9tvuwAqw":{"text":"Red velvet cake ice cream was rich, creamy, and really satisfied my craving for something ","useful":0,"cool":0},"jelZbTGdT7gYiiTIgm3zow":{"text":"Creole Creamery is always on the must go to list whenever I visit New Orleans. It's homema","useful":1,"cool":1},"Ys5XEsXrB3Nu_tz9TaF9vA":{"text":"Love all of the unique flavors and the mixture \"cookie monster.\"  Not the best ice-cream I","useful":0,"cool":0},"BRswTXnNJN8xa-DVrNWB1w":{"text":"This place  is  reason  enough  to  visit  New  Orleans. I'm  an ice  cream  lover, and Cr","useful":0,"cool":0},"efB4WV6wxDsvGh__DPL5sA":{"text":"All I can say is go here !! Take the drive out of the French quarters and go here !! The i","useful":1,"cool":1},"l_BqngH4BJqaAuTV9YSfVA":{"text":"The Ice Cream Gods reached down and blessed the dirty coast with one of the finest ice cre","useful":0,"cool":0},"RbeCC6sXNWDeZa-CgrMapA":{"text":"I've been here over a dozen times. The ice cream is ok, I really don't get the hoop-la ove","useful":0,"cool":0},"-R7VcvDsNJmy9BQxKqYVAw":{"text":"Love this place. Ice cream is so creamy. The workers are so helpful. They didn't have my k","useful":0,"cool":0},"Fr2ASxifrOVhXnaokcSAGQ":{"text":"Yes yes yes. I'm currently taking a break from devouring the lavender honey ice cream, whi","useful":0,"cool":0},"u3gNe9P4_wWRYeKNZVNQvA":{"text":"So. Many. Flavors.\n\nSome of the weird ones I've come across were liver and currants, made ","useful":0,"cool":0},"uo9eZ8tepmILuRA9ZUn8dw":{"text":"This place is a hybrid between Amy's and Lick in Austin. It has the creaminess of Amy's an","useful":3,"cool":1},"iFICXa-Gsd2Uls2_KtOcDw":{"text":"It had been hours since we visited Emeril's and I knew it was time to visit Creole Creamer","useful":3,"cool":1},"GZbMnmx6-HsAHxAupx-DUA":{"text":"Hands down...the BEST ice cream joint I have ever been to! I try and only go one a month o","useful":0,"cool":1},"p0uQu01zfuQHm3Gb4XdJeQ":{"text":"This is hands down my favorite place to get ice cream in New Orleans !!! There is only 2 d","useful":0,"cool":0},"fNUuOPDsaVV2SzTflLBx2A":{"text":"Yes the ice cream is good, and this place is rapidly becoming a New Orleans institution. H","useful":0,"cool":0},"ydxB-xTcpkgpI5CZGGVNUw":{"text":"Atmosphere, service, and delicious ice cream! My friend and I were visiting New Orleans an","useful":0,"cool":0},"ESh6XVnul5kdlGeuuCtq5A":{"text":"2 cones.\n1 summer fig + champagne violette\n1 lavender honey + peanut butter fudge\nBoth ver","useful":0,"cool":1},"ErqeMFXnr8T2lQTtbLitug":{"text":"I'm not the biggest ice cream fan because most of the time it melts too fast and leaves a ","useful":1,"cool":0},"UM0TAA54yTdeSS-K9zlrfA":{"text":"This place was so ridiculously delicious. Ice cream is my favorite kind of dessert and I h","useful":0,"cool":0},"oWvAP4HSTW5NOQ_s9C8AQg":{"text":"I was so excited to finally try this place! After passing it over and over again and never","useful":4,"cool":1},"KIdQARk-fnlmCzOKmb0atw":{"text":"This place is always super busy and they only take cash, but they never disappoint. I myse","useful":0,"cool":0},"7Ju12bHKf2GFVRArt_z8_w":{"text":"My all time favorite ice cream shop! Every flavor I have ever had has been amazing. Someti","useful":0,"cool":0},"085OPQhp0t8s5n0LglQK7g":{"text":"Here's the absolute truth: I don't like ice cream very much. Gigs at two big ole ice cream","useful":8,"cool":3},"tIEHUOM3GAQEeIcD9wftuA":{"text":"They are soooo good . Great atmosphere and kid friendly . Many choices. Tory was great .","useful":0,"cool":0},"o2zdBLuf6UhLEsjYbtfWvQ":{"text":"Had the salted caramel and the cafe au lait and absolutely loved both! So many great flavo","useful":2,"cool":1},"kATaGWUSgF_czzrZuU1jKQ":{"text":"So it's 83 degrees fahrenheit (28 degrees celsius) on a lonely Sunday afternoon. I drove b","useful":0,"cool":0},"H98nylDyfiwKANlcZTmj3g":{"text":"Loved the ice cream! My personal favorite was the Cafe Au Lait. Very generous scoops and t","useful":0,"cool":0},"rpirieyq9ay5NXnd-qp2eg":{"text":"We were visiting New Orleans this past weekend and got to have a yummy treat from here! We","useful":0,"cool":0},"B00wcZp11T-Z1okxzgkeqg":{"text":"incredible selection and quality. The most inventive and creative ice creams, sorbets, and","useful":1,"cool":0},"ENGGqC3kgCdkIN8Hpcfg6g":{"text":"Cash only! Really unique flavors and sundaes. The line was long when we came here but it w","useful":0,"cool":0},"G-Fgt89H7nszNYyEWGPpRA":{"text":"I like Creole Creamery, but not nearly as much as it appears every one else does. Any plac","useful":1,"cool":0},"VXh7fNJMneQGIjYjmfipew":{"text":"Some of the best ice cream in town. But they keep closing earlier and earlier without noti","useful":0,"cool":0},"uKnMULVlxy4bFHoIdDhjrw":{"text":"Yummy!! Lots of interesting flavors of ice cream to choose from. The guy who helped me was","useful":0,"cool":0},"63NnqKHNF3LBC7eODGd4-Q":{"text":"Creole Creamery must be doing things right if I am showing up in the biting cold. This ado","useful":1,"cool":0},"MExB5pWiZmhkiVLkiRCUWQ":{"text":"Trekked out here on a recent trip just to find the ice cream and was not disappointed.  It","useful":0,"cool":0},"Z0bMV2gLbqosjl3S6mbtiQ":{"text":"Classic ice cream shop here, with more choices than you could possibly hope for.  Sure the","useful":0,"cool":0},"XU3UkJTFEJp2sKU3EMpcog":{"text":"Cheap, hand-crafted, in-house ice cream! They offer many different flavors you would not t","useful":0,"cool":0},"RrvqiK0PzIeFoaole2jQGw":{"text":"Chocolate malt ice cream in a waffle cone for a good time, and park it on the bench outsid","useful":0,"cool":0},"y-Pzm7kcvzWN1luqrIlasA":{"text":"The service here is great as well as the ice cream!!!! OMG delicious! Was craving somethin","useful":0,"cool":0},"okg8nx-q-vhbHwmLEe1xwg":{"text":"They got lots of interesting flavors so I ordered the mini scoop sampler with 6 flavors. I","useful":0,"cool":0},"o2wqX2q86bBXTJqy-6KgpA":{"text":"My husband and I are regular customers here. We always order the same thing for every visi","useful":0,"cool":0},"LJ_8TJLUkZVDCY6qP_FPTw":{"text":"One of my top 4 places in NOLA. All i can say is get the 4 or 6 scoop sampler. Honey laven","useful":1,"cool":0},"7bDlnlQYMWcNpaBliJKH9A":{"text":"Salted caramel ice cream is my fave. Been here many times and never disappoints. Tons of d","useful":0,"cool":0},"wsHNVElw4VDRiwjsP4Fpwg":{"text":"The ice cream is so amazing!! It just so soft and creamy in your mouth. So delicious, perf","useful":0,"cool":0},"9UelRW60EWtPgY8OfHolMQ":{"text":"I read that this was one of the top 20 ice cream parlors in the country. I went with high ","useful":1,"cool":0},"gZZCRRmnnkONsyb55kgrqw":{"text":"The service here was so great. We were able to try as many flavors as we wanted and our se","useful":0,"cool":0},"eFOxupGw-K2RSpDjmXMVhA":{"text":"Lots of flavor choices and they allow you to taste a few before making a final decision, b","useful":0,"cool":0},"lGl-2RJO1OB0xllIT7T1wg":{"text":"Da Bomb, nuf said..... K maybe not enough said. But when we visit NOLA we ALWAYS hit this ","useful":0,"cool":0},"QhY4tl1YcXruOoMsJ8MoSA":{"text":"A kid, or an adult that is a kid at heart would love this whimsical dreamy dessert haven. ","useful":0,"cool":0},"uRkca8DhQ4ka-UqOljNu9A":{"text":"I absolutely love this place! They always have interesting and amazing ice cream flavors. ","useful":8,"cool":5},"3VUksYN_OFEoP-Wk-mtpMw":{"text":"Really good ice cream. The salted caramel was a bit too salty for my taste but the other f","useful":0,"cool":0},"t7FDGijumZo-Xfr5558P0g":{"text":"Very unique flavors of ice cream. My 2-yr old daughter killed the Cotton Candy flavor.  Sh","useful":0,"cool":0},"tjct_t7vU80feIW0PkDjnQ":{"text":"Delicious Ice Creams, a million flavors!  This is the closest place to heaven that it gets","useful":1,"cool":0},"gOvU20pzpqMzagXDo7qPzA":{"text":"It's good. However, this is the same ice cream shop found all over the country, just a dif","useful":0,"cool":0},"zUkXUwCnPvpgT3RdprIwGA":{"text":"I LOVE ICE CREAM and I LOVE the CREAMERY!\n\nSoooooo good.\n\nThis place is so cute with it's ","useful":2,"cool":2},"-kBiQzRGDC43NAQzpMvkww":{"text":"If/when I find my way back to New Orleans, Creole Creamery will undoubtedly be one of my f","useful":0,"cool":0},"tPGqgSriOKi94ygHA6Y8vQ":{"text":"Really good but heavy ice cream. One scoop is plenty.","useful":0,"cool":0},"ZDM36PNq6ABWTuClFQR8xw":{"text":"I am an ice cream connoisseur, and I was in heaven at Creole Creamery.  I did the 4 mini s","useful":0,"cool":0},"MgK9WWdDX89gdpV_SG15SQ":{"text":"Wide variety of great, rich flavors. I didn't have a sunday, but they looked fabulous at t","useful":0,"cool":0},"QWY1xnwiUshKIYL1zfUy2w":{"text":"Really thoughtful and creative ice cream flavors.  You can get old time fountain drinks as","useful":0,"cool":0},"4nZZU80Meabf_TNy8WvnWg":{"text":"I drove down to New Orleans to help my cousin apartment shop and we got hungry. We stopped","useful":0,"cool":0},"8gvaRPNVmL5i3ojV7BAlPQ":{"text":"Lordy, lordy. This place is amazing.\n\nThey've got your classic flavors plus some unusual o","useful":0,"cool":0},"XIarEuHM3f91SeharlVPfw":{"text":"Absolutely love this ice cream!! All their ice creams are so concentrated and full of flav","useful":0,"cool":0},"zhpEL_D-bDNG1L2AF3RJ0A":{"text":"First time here I got the brownie a la mode. It's a good size bowl for the price paid. Ice","useful":0,"cool":0},"Jw00BPdrzrHEDUTx85FKAw":{"text":"We brought the kids here after bowling last night and this little ice cream parlor was bus","useful":1,"cool":0},"49HWrk_iXHUVp-ldJ7V9Dg":{"text":"I could come here everyday (some weeks I do) I try all the flavors so yummy. Really cheap.","useful":0,"cool":0},"uoz0Qw3E9p0uDZ7FOHgrKQ":{"text":"Really good ice cream and great selection of flavors. I got to try the White Chocolate Ras","useful":0,"cool":0},"9zClPZHMtFuRcPGp4--f5Q":{"text":"How do you just pick one of the inventive flavors that they have on the daily? Not possibl","useful":3,"cool":3},"jmNeHeYwwg7E4K_agGRbHA":{"text":"Sometime I wish I had never discovered Creole Creamery.  Or maybe I just didn't live so da","useful":2,"cool":2},"ZC-Bdtr304msvBaCxH97fQ":{"text":"Wow!  While visiting town I happened upon one of those \"best of\" lists online and it inclu","useful":1,"cool":0},"Nxfr68N-XrsSRu0sAGB9YA":{"text":"First of all, I'm lactose intolerant so when my friend drove me here on a stormy day befor","useful":3,"cool":2},"hTr3_l9TG_62DFADKzpZJA":{"text":"Probably the best ice cream ever. Try the salty smokey chocolate almond. Seriously good st","useful":0,"cool":0},"XIIwl3EKYhIVqF2nD6SpRg":{"text":"I love this place every time I go I have a new flavor so creative and fun with the ingredi","useful":0,"cool":0},"g9fvrEZPrnOB2AR_zhmlFA":{"text":"Had a cup of the Thai Basil Coconut & Rose Water w/ candied rose petals. F#% your vanilla.","useful":0,"cool":0},"dOW3nsOEx_O61uaSbWuJ3g":{"text":"Me and my bf come here way too often. They always have seasonal flavors which is really fu","useful":1,"cool":0},"W5k-Lcd7XQX-cPn7_oZXSg":{"text":"I was quickly and efficiently served by A girl named Demi.  She was very helpful, and funn","useful":0,"cool":0},"FLXpy4TftBlV--05-qW_rg":{"text":"This place has some great ice cream. I got a double scoop of Cookies and Cream w/Oreos on ","useful":0,"cool":0},"qHisepOdh-qDkpF3uJ3uqw":{"text":"Thank goodness we stumbled upon this place. Very eclectic favors and fresh - one case of j","useful":0,"cool":0},"2tXRPF0DurFCYG9Sy7wvxQ":{"text":"Ok this place has the best ice cream I've ever eaten.  In fact, the flavor I get is so goo","useful":0,"cool":0},"XqejuCEoIx_ty1HEQ45UfQ":{"text":"I'm all for small businesses, and this place is certainly that. It's a cash-only establish","useful":3,"cool":3},"G2_MKV2VrwgAXAkeYMTw-g":{"text":"The Chef's chocolate is so delicious! I am not too big on ice cream, but I'll crave it eve","useful":0,"cool":0},"f7epRzleTyiD4b-N_QK3lQ":{"text":"It was Thanksgiving Sunday and I was coming from doing two out call massages around the co","useful":0,"cool":0},"_DUOYoaFa1YhC8ErsDjP5w":{"text":"Amazing fresh and creative flavors: ( the more interesting flavors include chartreuse or h","useful":1,"cool":1},"xMG0KmZmcRJq6L41oYQZBA":{"text":"The flavors are divine. Even though I am lactose intolerant, I couldn't help but continual","useful":2,"cool":2},"NxkV2LcCC-96AF2kwGtrEw":{"text":"The staff is always helpful and patient, especially if you're a first-timer and want to sa","useful":0,"cool":0},"4_cwGNFOvpARAzkAKq0uoQ":{"text":"Fast service, Great ice cream.\n\nget the chocolate malted and the peanut butter fudge.","useful":0,"cool":0},"CgxtUDtI09mHHqug_sgKMQ":{"text":"Ok, so I will preface this review with the following:\nCreole creamery has by far the most ","useful":0,"cool":0},"Tyd9ICqwYmfQGAiOMzQoUA":{"text":"Creole Creamery is, without a doubt, one of the most genuine Southern ice cream shops sout","useful":1,"cool":0},"e4J-vcl55SO_EjkWDDeEfQ":{"text":"Creole creamery is an absolute delight! The price is unbeatable for the craft creamery ...","useful":0,"cool":0},"r4mxw_U69cONWbXyaL456w":{"text":"Cool little place that reels you in with their sugary sweet aromas. I tried the Death by c","useful":0,"cool":0},"3S4kH4CXhG6bgijWcfroow":{"text":"Creole creamery was a great find!  It is a pretty short walk from the street car stop.  We","useful":0,"cool":0},"UjCdwRvmiX1IBjDMBVV9Jw":{"text":"I was pleasantly surprised.\n\nWe had an assortment of flavors (salted caramel, something wi","useful":3,"cool":1},"YN0IfS-dSVlYEfE11Jzq3A":{"text":"Absolutely the best, hands down. Don't be scared by the name, and get the Thai Basil Cocon","useful":1,"cool":1},"kUQHUyvFwFfuMIknedyVlw":{"text":"Best ice cream in NOLA! You'll find flavors you couldn't dream of along with off the chart","useful":0,"cool":0},"jHE4OwIcHTy7xuFTBiqW0A":{"text":"all i can say is oh my god lavender ice cream!","useful":0,"cool":0},"g1vo2u77MV7V8-rxRbIHMQ":{"text":"Humid weather calls for delicious ice cream creations! My boyfriend and I took a street ca","useful":0,"cool":0},"fsQ8KzolrSkGeFAwwQzK2A":{"text":"Who eats ice cream even when it's snowing out? This girl. \n\nDelicious ice cream that is wo","useful":0,"cool":0},"2Uw_w7XgxUeKt5BZ0tfKfQ":{"text":"Amazing.  We went late night and the line was surrounding the ice cream flavours.  They li","useful":0,"cool":0},"PRLjEpU3zpxkHyQU7-iH-g":{"text":"You say you're sick of Baskin Robbins and want a local joint to visit? AND you have the ga","useful":0,"cool":0},"dfri2JvRkC6k_ib4eBnF_Q":{"text":"I got the 4 miniscoops: green tea, salted caramel, red velvet, and lavender honey. They we","useful":0,"cool":0},"ZtCrvfujPmBvSGZCJ4x5cg":{"text":"I love this place!\n\nThe ice cream here is excellent!  Every time I go here I get to try ne","useful":2,"cool":2},"IZNtXJeLZu2oWQqg1V1q7g":{"text":"Interesting flavor a that always are changing. Last time I got the Mango Unchained...mango","useful":0,"cool":0},"R30SN1nMIgwDnZZakfO2pg":{"text":"Tried the lavender honey, cookie monster, and the black and gold crunch. Very solid, and u","useful":0,"cool":0},"pi_VFOJ4zMqmRccVzsC3gQ":{"text":"This ice cream is truly one of a kind. Saw it on diners drive-ins and dives. It did not di","useful":0,"cool":0},"gDk7ztYBhv97bqrNCtSixQ":{"text":"This ice cream is so delicious and gourmet tasting . You can't go wrong here . The parking","useful":1,"cool":0},"mIbOh5pBj3Rh7VCkwvkJYg":{"text":"Fun place with dozens of flavors to try - and the perfect way to do it with the 4 or 6 sam","useful":0,"cool":0},"weHhIDTCS1valObnO0-mgA":{"text":"Waffle cone a bottom scoop of Cookie Monster top scoop of Chocolate Pecan Pie.....Awesome!","useful":0,"cool":0},"duzDRz7nvR57Q-adRzAXNg":{"text":"I was in New Orleans for six days, and visited Creole Cremary 7 times. My only concern is ","useful":0,"cool":0},"f--UzFk6xOC-DU6Dnr5Esw":{"text":"What can I say besides Bananas. Foster. Ice Cream.  Y'all.  It is so good.  Quick service ","useful":2,"cool":2},"2lHB-tawbJuqKvovHhwESQ":{"text":"I love this shop! The ice cream is delicious. It is the perfect mix between flavor and cre","useful":0,"cool":0},"4E5bfbiVXlB93fE_F7ed3w":{"text":"First off, for anyone FROM New Orleans, what a magical ode to the memory of McKenzie's!\n\nI","useful":3,"cool":1},"G10ZgsExoCmjOlhevVxJ0Q":{"text":"All the normal flavors to keep a three year-old happy, and plenty of weird tastes for the ","useful":0,"cool":1},"owTx2PbSiShwdk6C8HOQrA":{"text":"oh you chocolate amaretto! so delicious! we walked here after lunch for a delicious ice cr","useful":0,"cool":0},"QPvyvJCsu5jD0s2tb9sYPA":{"text":"What a range of unique flavors! I ordered one scoop of the creole cream cheese and one sco","useful":0,"cool":0},"A31xouGNwUpV80yb94abkw":{"text":"What's that you want a scoop of \ncl/hockwork orange and roasted pistachio ice cream?  Good","useful":1,"cool":0},"-iznopjjGpVqSm4HdmeOCA":{"text":"Excellent ice cream shop. Had the magnolia and lemon rose water sorbet, really unique and ","useful":0,"cool":0},"c93RKrZAgckoJfAW8sJlVg":{"text":"CASH ONLY!  I loved the flavor of the ice creams that I got. I had the brown butter and al","useful":0,"cool":0},"GFvVcqxBfrLh72P4HaSRng":{"text":"Simply stated: the best ice cream in New Orleans. New Orleans is fortunate to have several","useful":3,"cool":2},"qFCjkb0ilMLAy8Lqt-v9ng":{"text":"The world's best ice cream, bar none.  This place was so good, my nieces (17 and 20) force","useful":0,"cool":0},"jhBUCsxTdzPmbK7OTX6Rrg":{"text":"Soild ice cream! Exceptionally smooth and a wide variety of interesting flavors. I ordered","useful":0,"cool":0},"ytOE7gk1Eo9ar2znjJglEw":{"text":"I'm from MA (4th largest ice cream consumer) and this ice cream is no joke! Great flavors ","useful":0,"cool":0},"sGzibvPTcqkbxdQSZmPB0Q":{"text":"Great variety of flavor. This place totally disrupts my diet plan.\nNote:\n1. they offer hal","useful":0,"cool":0},"ui-svvPq56qG4jIJdj6aqA":{"text":"I never thought an ice cream shop would make ice cream so good that I would pay a weekly v","useful":0,"cool":0},"ldii8a8sjh2FtDZKD-trZg":{"text":"Yum yum.  The ice cream was a bit on the expensive side but the flavors were absolutely de","useful":0,"cool":0},"ukYBqC1D9fKN-Tj4uGG62Q":{"text":"Can I be honest? The ice cream was good but I don't understand why it's such a popular pla","useful":0,"cool":0},"xHz-np7C2LdzSAImxfsS2A":{"text":"LOVE!!\n\nLocal business with spunky employees and samples of all their crazy awesome flavor","useful":0,"cool":0},"fne-AnQTrwOuT9tkHXgIPQ":{"text":"Delicious ice cream and sorbet!  Quick and friendly service with a smile. If you can't dec","useful":1,"cool":0},"7fhWnUxNZTP723uf0F9o3A":{"text":"I was here recently on a visit to New Orleans from Los Angeles and this place is a must vi","useful":0,"cool":0},"uMoPflALnmtjua1I3hCCwQ":{"text":"I Scream Fudge, Red Velvet, & Creole Cream Cheese... what more could you possibly ask for?","useful":0,"cool":0},"Y4c4sp-oJn85SSzOmsHADw":{"text":"I have a problem with Creole Creamery.  And that problem is, whenever I drive down Prytani","useful":3,"cool":4},"NztDlv-XiUgOsMaPz9aynQ":{"text":"I've been wanting to come here for a while. Finally was able to and they have a sugar free","useful":1,"cool":1},"9boLOzmWvLxY8TbpRDLGcQ":{"text":"So glad to have found this place through Instagram and was able to check it out during my ","useful":0,"cool":0},"vfD2h0XUvCbqCXWcGfs3AQ":{"text":"Very friendly, &  many, many flavors. They let you taste as many as you need. They have th","useful":0,"cool":0},"hQ5CGBnSrUao2hR_nzMLMg":{"text":"I've never liked ice cream. However, friend raved about this place so I gave it a try. Lov","useful":0,"cool":0},"fFGYGzb1gMyuf9mm9kzG5A":{"text":"OMG! The cafe au lait ice cream is amazing!  It's cash only, but it's so worth it!\n\nThere ","useful":0,"cool":0},"q7lOAVtpxWxRE9UJwb3TMg":{"text":"There is always room for ice cream. Always.\n\nDropped by for dessert with some pals on a We","useful":1,"cool":0},"j2SvpklmiLBZlqgbODi6Og":{"text":"3 words for you, Creole Cream Cheese.\nIf you are a tourist in town, go get you some!\nIt is","useful":0,"cool":0},"iMAWWGUNfQGGvNPyc2Clcw":{"text":"My family and I went a few weeks ago. I was not impressed.","useful":1,"cool":0},"Rnj_PaMyfEu4witEjx9c_w":{"text":"It's expensive...but good ice cream always is...and they have some crazy good custom flavo","useful":0,"cool":0},"ePObDEIj-dXgI9EaJCw17Q":{"text":"I got the lavender honey and salted caramel in a waffle cone and it was delicious! perfect","useful":0,"cool":0},"XLg1uRyAfOoMdtpd45ajlg":{"text":"I love this place. They are beyond fantastic. Super helpful, always friendly. The prices a","useful":0,"cool":0},"NuLS4TRYq-N1BwoPt7HLrA":{"text":"I can't get enough creole creamery. I could eat those waffle cones by the dozen. It's a wo","useful":1,"cool":1},"pUj1huv2uehA72SOokd3Kw":{"text":"Pretty darn amazing... A great assortment of flavors, including some unusual ones like lav","useful":0,"cool":0},"HMtkRUas90VTtYdZ9fjvBQ":{"text":"Ummm. Really cool flavors. I got some kind of orange chocolate flavor and a salted caramel","useful":0,"cool":0},"-dRyrarHyUHUvj22x1u7jg":{"text":"FINALLY!  I RETURNED!\n\nEven though our visit to the area found temperatures chillier than ","useful":0,"cool":0},"DvRA_s2ERxrnJiOLZV5WRw":{"text":"My favorite my for creamy ice cream in Nola. They also have another location but this one ","useful":0,"cool":0},"yG6pk0pFwTM8ScvCCt9fcA":{"text":"A must on your NOLA foodie stops! The best ice cream I've ever had...it's delicious! I had","useful":0,"cool":0},"ShOQCRkQsoV91nHr1qY79w":{"text":"Came here during a recent trip home from FL.  Parking is off street or you can take your c","useful":0,"cool":0},"ljVqu9sOFyb2k_GYY9YNXw":{"text":"We found this place through yelp actually, after looking for the nearest place to Audubon ","useful":0,"cool":0},"VR8ituY1ewFUI4QqQZ8S8g":{"text":"Mexican Hot Chocolate is spicy - whaaa? Spicy ice cream is awesome and I recommend it. Als","useful":0,"cool":0},"vyIXh-3o9bEiEVkk7tqPqQ":{"text":"There chocolate amaretto cheesecake is addictive! Good place to get your sweet tooth satis","useful":0,"cool":0},"cYZn1UIjYgyqI_Jh9xvZlg":{"text":"Me and my friends really enjoyed this place. Decided to try the Wedding Cake Champagne ice","useful":0,"cool":0},"ow2TbELENPEo_nv5TBH9jQ":{"text":"I came here while in New Orleans after reading http://www.thrillist.com/eat/nation/best-ic","useful":1,"cool":1},"szbGb-Z517hHw-AGEoSqrQ":{"text":"Do yourself a favor: just go to Creole Creamery.  It's hot outside and they have eclectic ","useful":0,"cool":0},"_EfGUm-VUNffobHvwnBNWA":{"text":"A nice, cute ice cream shop popular among locals. The creamery serves many seasonal/intere","useful":0,"cool":0},"AVjVdevxpDmgxILX_gxBEA":{"text":"Cute little ice cream shop with totally unique flavors like Lucky Charms, Thai Basil, and ","useful":0,"cool":0},"yrcPAIeqUdzBc7bH81OTcg":{"text":"Delicious ice creams with lots of different options. I'm a little biased bc I work at a ho","useful":0,"cool":0},"Y6r2wE2p8gQzyYMnJ1wP8Q":{"text":"Okay, I know my ice cream. I live in Vermont, proud purveyors of the Ben & Jerry's brand; ","useful":1,"cool":2},"Nv8xAPsaGlkfSeLfnn14GA":{"text":"The second greatest ice cream spot in America (first being sundae school in cape cod). Sal","useful":0,"cool":0},"zj7oHvaPnNhZBV0m-y9ziQ":{"text":"Ice creams have faint flavor.... nice staff and atomsphere and was a good spot for us to t","useful":0,"cool":0},"F5fBMgialiUZvvB9U7Mulg":{"text":"Mmmmmmmmmm! With the new trend towards frozen yogurt and \"healthy\" dessert options, I was ","useful":0,"cool":0},"ZayT2npAUNJ2r6Ep2h_3fg":{"text":"I love coming here for the Lavender honey ice cream. I attempted the tchoupitoulas ice cre","useful":1,"cool":0},"BZhyphrV_ZiWBQFSC1qRDw":{"text":"Insanely delicious. \n  I can't even explain to you the sheer joy in my heart as I left thi","useful":0,"cool":0},"5m4vi999SwtbGxx_Vt-SxQ":{"text":"Salty chocolate almond in a waffle cone. Best damn ice cream I've ever had.\n\nCash only.  D","useful":1,"cool":0},"5qbEfLUYK35DNf-VdBeMuw":{"text":"After three recent weeks gorging myself silly on gelato (and pizza and pasta) in Italy, I ","useful":1,"cool":1},"e2AhDlBwlm3lxJpTXwjyXg":{"text":"Cash only\nCash only\n\nYeah, they don't accept credit cards here but the ice cream is actual","useful":0,"cool":0},"ZWdWfOL2AimrnBBpxBkBGQ":{"text":"Best ice cream in New Orleans. I sampled the nectar sherbert and blackberry sorbet, which ","useful":0,"cool":0},"-vfMjMTSffBdouXJtEpvaA":{"text":"If you think you have had better ice cream, you should move to Egypt and live da nile. It ","useful":0,"cool":0},"Md_wdZca8WMuMq2CXFr7_g":{"text":"Amazing. Creative flavors. Delicious waffle cones. Great service. What more do you need?","useful":0,"cool":0},"IT_Qy_rhmI2iFxKxs4Y1_g":{"text":"Love love love this place!!! Customer service is number 1! We were offered random flavors ","useful":0,"cool":0},"6manFsM_yvgeYSVbPOmrqA":{"text":"My friends wanted to go for ice cream and this was their favorite place-there are two loca","useful":0,"cool":0},"pFf9xjmR7I2WVx4hm7yPNQ":{"text":"Great, inventive flavors - too much good stuff not  to try so I would suggest either the 4","useful":0,"cool":0},"eaoK5MeiM-ZBl4L1Tj9Blw":{"text":"Since I couldn't decide from their outrageously delicious array of 30 or so choices I sett","useful":0,"cool":0},"wYeKH3H2XP_gU7MdOmHP5Q":{"text":"Creole Creamery is my favorite ice cream place ever, and I can't imagine any place better.","useful":0,"cool":0},"IMBuIJ3zfxzdrR-S0c2WHg":{"text":"I LOVE their ice cream. Their brownie with a scoop of ice cream is a must try and only $5.","useful":0,"cool":0},"DBdLQenculTP35yjdMgCxw":{"text":"I just love them. I can't get a proper peanut butter sundae anywhere else. Swap the fudge ","useful":0,"cool":0},"rb83F2ZahWzykvjkM0gVmQ":{"text":"Peanut butter pie ice cream. I just. Wow.","useful":1,"cool":1},"qSGRD2XcwcRlQivHMPQ8Ww":{"text":"OK, After several visits I have to say Creole Creamery remains the best freaking ice cream","useful":11,"cool":8},"cuEzWCFnauTDmiTRnnDenw":{"text":"Great variety and super rich! \n\nCool flavors - Blueberry Pie was my last tasting and it wa","useful":0,"cool":0},"0iXSfSUfQK5_tuHZJaJA5w":{"text":"I finally went after over 2 years of living here...how amazing! They have so many flavors ","useful":2,"cool":0},"N_RcsZYl2TkhxQl2potwMg":{"text":"This is my new favorite ice cream parlor. My husband had a yummy peanut butter parfait typ","useful":1,"cool":0},"3xTMaNsh5IeE3epdO46nvA":{"text":"I had two scoops of ice cream and it was really amazing my daughter had the nectar float r","useful":0,"cool":0},"OduwKQW2Lg-SIRFl89MwIw":{"text":"YUM! This would be definitely be one of my to-go dessert place if I lived here. There was ","useful":0,"cool":1},"6hmYC8GFfTvigapPprvmKQ":{"text":"Nothing great..just another ice cream store. Locals love this place and is becoming a tour","useful":0,"cool":0},"uQOdDwpEoHyM6Smx8If4iw":{"text":"My absolute favorite ice cream parlor in NOLA. I highly recommend the creole cream cheese ","useful":0,"cool":0},"BakwfQOSf5P79weqJJ-GdQ":{"text":"Amazing ice cream place. He best part is all the unique flavors. They do rotate the flavor","useful":0,"cool":0},"pJVfCSNM0zrmeWN3WbDCiA":{"text":"You can't find an ice cream parlor better than this.  The flavors keep changing and they a","useful":0,"cool":0},"Qx-TpGR6rjpM0eUmzcbdjw":{"text":"Omg this place was so good! I'm glad that my friends and I spontaneously decided to stop b","useful":0,"cool":0},"YB6kZgsrlnhivwpE2RxqLw":{"text":"Day 2 taste explorations: Black & Gold - vanilla and chicory base with oreos and chocolate","useful":3,"cool":1},"7SGaSYMZLf7OKehZC2m0LA":{"text":"You gonna try the Cafe Au Lait! It's the main reason why I love Creole Creamery. I've been","useful":1,"cool":1},"mwUOwwvCcLRerNkt2T4WKg":{"text":"Oh my god, Creole Creamery is amazing!  They have some of the most unique flavors of ice c","useful":2,"cool":2},"qNUPy0TIQkA7BoP2zjb_iQ":{"text":"This might just be the best city ice cream parlor I've ever been to overall . The only pla","useful":2,"cool":1},"XervEwyU165u05w3gCHARw":{"text":"I have been following triple D locations all across the country for the last year and I mu","useful":0,"cool":0},"H3gSJRh7SRSFZTXpit2vGQ":{"text":"Creole Creamery essentially delivers what you'd expect out of a locally-owned ice cream sh","useful":0,"cool":0},"19-TYLVFnRqFMEZGJbXyMw":{"text":"I came here with pals when I was visiting NOLA.  I got malted chocolate chip.  The flavor ","useful":0,"cool":0},"EF1aT-neG_gr5-tRHaJTrQ":{"text":"Darling ice cream shop, complete with pink walls and handmade signs.  Lots of standard & c","useful":0,"cool":0},"Lttzd8Wcl1owTn7u52esdg":{"text":"This place was incredible! I have to say it's really difficult to actually choose your fla","useful":0,"cool":0},"z9l1Cg7YoGddKRZI87JFBA":{"text":"Wonderful uptown ice cream shop with very unique flavors. I am very boring and almost alwa","useful":0,"cool":0},"h8nvrH2SeVKVphW0o9CL9g":{"text":"Delicious ice cream! I love their wide variety of flavors and that the scoops are pretty b","useful":0,"cool":0},"UxM8_rhwzE-JybjsZc9eow":{"text":"Their ice cream is absolutely to die for.  Every flavor is made fresh and there are more t","useful":0,"cool":0},"NiqsxPzKHCRMB_nZWcm6AA":{"text":"The ice cream is good, but the service leaves a terrible taste in my mouth.\n\nI've been pat","useful":6,"cool":2},"ooxbUZGKM9NhYERTcET_Tw":{"text":"Good ice cream, loved the pistachio and the  cookies and cream flavors.  Great little post","useful":0,"cool":0},"UleCqfcXrvDh2VMPfAQ0XQ":{"text":"great variety!  \nI don't live in the city, so this is a nice treat on a pretty day to take","useful":0,"cool":0},"qlVL3BSZeF-sIUrPhiBc5w":{"text":"hell yes to chicory chocolate, the cucumber sorbet, and the option to get your name on the","useful":0,"cool":0},"iPD9YJEnAtLOvjvviu-2wg":{"text":"heavenly ice cream.  all ice cream is mostly always delicious, but this ice cream is too l","useful":0,"cool":0},"u7dwUzS4l9I_T16VquEzQQ":{"text":"There were plenty of ice cream and sorbet options available.  Toppings are a little pricey","useful":0,"cool":0},"oOeptTD70gCgT3WPnM7PKw":{"text":"The ice cream was recommended on the Food Network, so we thought we would try it out. When","useful":0,"cool":0},"ImLjHrEiB4U5xgjZmdoxvg":{"text":"OMG, the ice cream here is AMAZING!!! As good as any of the best ice cream I've had in NYC","useful":0,"cool":0},"NnA8GoTx_GdCFX3lnMbJAg":{"text":"i adore, love, and dream about their ice cream!!!! fat girl excited moments. i love the va","useful":1,"cool":0},"eek8DgyrzzUMRc71GEJTAg":{"text":"mmmm...a choc-work orange, so good.  Flavors to please everyone in the family from the gou","useful":1,"cool":1},"SzqXFAVDSbHGS3MadBsH8g":{"text":"Fantastic ice creams!! Tried the mini scoop sampler- recommend spicy Mexican hot chocolate","useful":0,"cool":0},"3BmtXIfOMZkgKGeXlFlvWw":{"text":"I tried their creole cream cheese and it was just not that good. After two bites I went up","useful":0,"cool":0},"YpCCueEI55S0kN-azvq9jQ":{"text":"Two flavors (Salted Caramel and Lavender Honey) in a waffle cone! Waffle cone is $0.75 ext","useful":0,"cool":0},"hEA3iE5CE51ybqHuE40EWg":{"text":"I love, love, love Creole Creamery. \n\nFor some reason this seems to be the only New Orlean","useful":1,"cool":0},"6vqzcDLXYxb_9DXIjgUDjg":{"text":"Ice cream was good, service was terrible! We were practically shoved out he door. Spent $2","useful":0,"cool":0},"sij940Fc5fIZJmcV8hUL-g":{"text":"Best I've ever had!  Quality, taste, variety, the whole package","useful":0,"cool":0},"P4LO7PqIDrN7lI-L1LNWCA":{"text":"High marks across the board for being inventive and fun and great BUT Cash only is a huge ","useful":0,"cool":0},"Y9OR0avHnJH49ygp9-j3Fg":{"text":"As someone who lives the dairy-free life, ice cream places can be pretty depressing. Howev","useful":0,"cool":0},"3IAGS7D5vR-Jfbfp6J33ng":{"text":"Prices are great and the staff was very friendly. It's comforting knowing you're getting r","useful":0,"cool":0},"XN_dKZxHT5OlHuhQ7KEXAw":{"text":"It is pretty cute and classic but I would come here regardless. The ice cream was amazing ","useful":0,"cool":0},"On-zu_hOiLdGi6xf-nKyKw":{"text":"I think I came here before my Yelp days and it was just as good as I remembered it. They h","useful":0,"cool":0},"rOM_FJyr29fGF8lhQycduQ":{"text":"I had high expectations after seeing this place featured on Food Network. It was good, but","useful":0,"cool":0},"3TB6RbV0cm4pCOcL3TU0hg":{"text":"Loved this place!! Best ice cream I've had in NOLA.\n\nGreat selection of flavors, both clas","useful":0,"cool":0},"rqnbH-Y8lcBq2lL6OCuxeg":{"text":"I have a huge sweet tooth and have been to ice creameries/dessert places all around. The i","useful":0,"cool":0},"BLCvAYgb8bO2NZIlRnDTpg":{"text":"Sweet, cozy, cute, lovely, yummy.\n\nAll good vibes, cute vibes. Fun NOLA flavors\n\nBring you","useful":0,"cool":0},"1cBG9BWxMA2RZfwqHx-yfA":{"text":"This place literally gave me the most delicious ice cream I have ever had, and I have had ","useful":0,"cool":0},"dN39Oj4WyrPxMK-ae0rKIg":{"text":"yumm! great ice cream. probably best in the city. perfect for hot nights with a date (milk","useful":1,"cool":0},"rqcyLcsYKqEPuSF2MU3O_g":{"text":"LOVE, and not just because one of the locations is housed in the old McKenzie's bakery. fl","useful":0,"cool":0},"D--VvCCPXWO55F_6eWW_EQ":{"text":"Everything here is soooo damn good! The line is going out the door and down the street. Th","useful":0,"cool":0},"QICvSA8MDkTUalFnL7zzCw":{"text":"When a place doesn't brag about their craft but simply demonstrates their mastery of it, t","useful":1,"cool":0},"yBJUzkF4ztN_aycq0eZH6g":{"text":"Do you like ice cream? Are you currently within driving or walking distance of Prytania St","useful":0,"cool":0},"zZV6oWDaxdCab8xVgGS4cQ":{"text":"Creole Creamery has delicious ice cream. They have a wide selection of flavors with many u","useful":0,"cool":0},"v9mkBJvc9n9EJztDCU9y0g":{"text":"The best ice cream in New Orleans! There are always long waits when I come but I'd say it'","useful":0,"cool":0},"_GKyRDLqRtyAmq8ZfVH1jw":{"text":"This creamery is a real treat! I got the Cookie Monster Sundae and my significant other go","useful":1,"cool":1},"uPS5skNJVxS1EtIvaBQLog":{"text":"This place really is good. Kind of a run down looking place but the staff was really frien","useful":0,"cool":0},"I4wfz2TLGq0PnM42B9_cjA":{"text":"This place is a gem. I bring every visitor to the city here. I've never had anything but a","useful":0,"cool":0},"SFJCD2CpoC84jcBalLyb7A":{"text":"We got the 6 mini scoop sampler ($7) and definitely recommend it if you're indecisive like","useful":0,"cool":0},"NSmveWzZfI1LEjEpbgI-rg":{"text":"Creole Creamery is just all kinds of yummy delicious. Crazy flavors (just see Scott S.'s r","useful":3,"cool":3},"IHPU4CQA_8pIXGWLGaweBA":{"text":"Charming ice cream shop that offers a variety of flavors.  The woman behind the counter le","useful":0,"cool":0},"i6saoMewQE0xGfQ-c8C2Ng":{"text":"Great local establishment. The sampler was an ample serving and our server made great flav","useful":0,"cool":0},"DuRQaI00y1UVg8egrMfBbA":{"text":"This ice cream is angelic. It is the perfect mixture of everything good in the world. The ","useful":1,"cool":0},"mins4ZATLSsRw5NJFn8IcQ":{"text":"Man, this is my go to spot when I'm in NO. I make my best friend take me here at least one","useful":2,"cool":2},"WphbWHwVpXFl_0_sgoxKHg":{"text":"I saw this shop on the Food Network years ago, and I was finally able to make it to New Or","useful":0,"cool":0},"BRkfIgDg_-gsdErPmLV7rg":{"text":"Another trip to NOLA and two more trips to Creole Creamery! We went one afternoon and had ","useful":0,"cool":0},"AZH2cqN9znWqbdbcEYnn_Q":{"text":"Not a lot of negative things to say about this or most dessert places, of course. The Creo","useful":2,"cool":1},"4lfD4kFxPGW8GZi409SdWg":{"text":"The shop is a throwback with a quaint atmosphere. It reminds me of the classic ice cream s","useful":1,"cool":1},"SbREqVw0LsBWFCFa9FmdYA":{"text":"I come here whenever I want to treat myself. I recommend the creole cream cheese and pista","useful":1,"cool":1},"vOXVJ7ydx0YuqkUYUoak5Q":{"text":"Great variety of flavors and all are delicious! The three mini scoop sampler is an awesome","useful":0,"cool":0},"SizzD5dMvPKMn-wlg-Kypw":{"text":"OMG!!!  This is one of my Top 5 Favorite places on Earth.  LOVE THE UPTOWN LOCATION!  \n\nTh","useful":2,"cool":1},"A3H12-lQv-bkUxgMynPfng":{"text":"As I write this review my mouth is watering wishing I could have a scoop of their ice crea","useful":0,"cool":0},"rgv_TO1tn3QRaIX_TptpQQ":{"text":"This is the best ice cream shop in New Orleans! They have homemade, hand-crafted ice cream","useful":0,"cool":0},"Rhm_kGzPojD7UhYAwSQQBA":{"text":"I seriously love this place.  I have loved everything I have ever gotten from here, but th","useful":0,"cool":0},"Q2N3qyc6pCC2Q149U_S9kA":{"text":"The staff were welcoming and the ice cream selection was impressive! Hubs got a peanut but","useful":0,"cool":0},"zNihoTvhWVwbWy3xmzJ6ag":{"text":"Very good ice cream! It's all made right in the shop. They have tons of ice cream flavor a","useful":0,"cool":0},"73e3JMc6f3R_tA4TKNGIpw":{"text":"We stopped in here after lunch Saturday for a little dessert. The place was bustling, but ","useful":3,"cool":2},"c43jvIOdF7VCJBf6bZsWmg":{"text":"Amazing I was in Nola for a Month and Half and I had at three times and was the last thing","useful":0,"cool":0},"tsgHCOCyfDSmqxAfC-Je2w":{"text":"AMAZING! This could be the best ice cream I've ever had. Everyone is friendly and helpful.","useful":0,"cool":0},"3AfTZZarE86YI85BCVLc1g":{"text":"Feel of an old fashioned icecream parlor, but the flavors are anything but the same old th","useful":0,"cool":0},"BE-93cVtkQy3d2HL78ACBA":{"text":"Local flavor for sure. You've got to try it.  A plethora of flavors and extremely helpful ","useful":2,"cool":2},"doI7hQiCVSdg7_jq3y7ygA":{"text":"Amazing ice cream place where everything is made in house with great, fresh, and unique fl","useful":1,"cool":0},"EMg8d9xqSWJ-dSvW_3WTmA":{"text":"Best ice cream I have ever had! Sooo  good with rare flavors not just the average common f","useful":0,"cool":0},"ADZQRv4tUB7Ltkxmq6I9tg":{"text":"Since I was already spending half a day seeing the garden district via street car, I decid","useful":0,"cool":0},"z9PUm0MeYV_BQnMh6_52_A":{"text":"This place is steller.  The ever changing ice cream selections are divine along with the w","useful":0,"cool":0},"etNns4GTAJy2CgXCswrIqA":{"text":"Best ice cream place I found in New Orleans. My favorite flavors are cream cheese and Cook","useful":0,"cool":1},"NXko-4dt-2LuwwX3zCsA-A":{"text":"This creamery has tons of ice cream flavor options and the staff knows how to get through ","useful":0,"cool":0},"-duLx1IzGEij1-ewYBIkXQ":{"text":"Molasses oatmeal cookie ice cream was great. I wasn't a fan of the cheese cream one with c","useful":0,"cool":0},"x6VqhQHMRv2RPUbQ9R3fBQ":{"text":"Best local ice cream!! Favorite spot to get a cold treat on a hot day. The Lavender honey ","useful":0,"cool":0},"1Yt3UUc6oGmL-fpxmOgR2Q":{"text":"The hubby and I went in without a plan because we heard there were so many flavors. He got","useful":2,"cool":0},"zfhEzLZ4z6dtxNWCXxo4vg":{"text":"This place has too many good flavors to choose from.\n\nAfter stressing out over what to get","useful":4,"cool":2},"hF6gbW7L1-n8nwP0oMVatw":{"text":"kickass ice cream that all tastes home-made.  In a MMMMMMMGOOOOOOOOOOOOOOOD way.\n\nno sissy","useful":0,"cool":1},"QsCCDn9ltQ8lQW82gs4N5Q":{"text":"*CASH ONLY*\n\nDecor: 3/5\n-cute wooden decor with table, booth or bar seating\n-not quite the","useful":4,"cool":3},"3up8mDO3AxK9VgFntfY8og":{"text":"Amazing! I had lavender honey and La vie en rosé ice creams. Both flavors were delicious a","useful":0,"cool":0},"6XjkBXNyIdYPAU0YvChrtw":{"text":"Kudos to theses folks for crafting fresh, quality ice cream. I am a fan of the butterscotc","useful":0,"cool":0},"BdkAZLLCzeiyOyo5Vrzprw":{"text":"Eat Ice Cream. Be Happy.\n\nI ate ice cream and I became happy! I love this place! I always ","useful":2,"cool":1},"uBF47fzXrLDMrbgYld9cDQ":{"text":"My nieces & nephew loved it ! Lots of choices, good quality. The cash thing is inconvenien","useful":1,"cool":1},"b0_IsdbO7Tcr7AeTgTwGsw":{"text":"My friend and I visited on a Friday night at peak time but we didn't feel cramped and the ","useful":1,"cool":1},"FETfn4stUHv-8bxDYnjrcQ":{"text":"This was our 5th food stop of the day. I honestly don't know how we managed...but we did. ","useful":0,"cool":0},"-D-U8v3qwBOxQceRU7sHgg":{"text":"First time in this location. A former resident of Metairie their Lakeview location was jus","useful":1,"cool":0},"Z6CFHCkUzBEHp1JeEdzxhA":{"text":"Sundaes under $7 and they are huge. Yesterday had the anita chocolate strawberry, wedding ","useful":0,"cool":0},"hpeupLMn0eIhz7T-BkpGmA":{"text":"Every ice cream shop in the country should follow Creole Creamery's example and offer a bo","useful":6,"cool":2},"53SR-8tLNno8fto22rmVag":{"text":"I love this place! They are friendly and willing to be patient while you read and ask for ","useful":0,"cool":0},"infXET8RAsyHFzzHZQXZjQ":{"text":"We were at Audobon Park and we saw the reviews for this place. I am so glad that we went! ","useful":0,"cool":0},"qBRcO-DB4cJV0s6fDqIpYw":{"text":"For someone who doesn't like ice-cream that much, I'm concerned how much I love Creole Cre","useful":1,"cool":0},"o72_dooHMEpaAMrkA2phzA":{"text":"The best ice cream EVER! I love how there's always new and unique flavors each week and al","useful":0,"cool":0},"tSEuth229MbG9BRfPWUuiQ":{"text":"Best ice cream I have ever had. Peanut butter fudge pie and lavender honey are my favorite","useful":0,"cool":0},"aUEwcMutTZJLGuAaNBaEkA":{"text":"Absolutely amazing .. loved this place and was sad I could only go one time while I was in","useful":0,"cool":0},"b4s1ab98Mkns_y-waBPWrA":{"text":"Delicious ice cream and a nice neighborhood. Renewed my confidence in New Orleans as a cit","useful":0,"cool":0},"nNkMhhFuFjo_jGq-Q9qq0A":{"text":"Skipped the Tchoupitoulas Challenge since I came from a Commander's Palace meal AND the sa","useful":1,"cool":0},"NSvdNo0IuHNfss1dgPfPsQ":{"text":"Great ice cream. Literally, the best in New Orleans. \n\nCash only! Are you kidding?? There ","useful":1,"cool":0},"U9Rh_PFfGzyZbZguZrmChg":{"text":"Some nights, your just want ice cream for dinner. This place delivers on so many levels. G","useful":0,"cool":0},"OsSkNvZbp2W7oU8u71-8Hg":{"text":"On a recent cross country trip we stopped in her for a cone and really enjoyed their inter","useful":0,"cool":0},"pZVY8rCpJ88opj4dNzsu4Q":{"text":"Some of the best ice cream I've ever had.  I've tried a couple of flavors, but I highly re","useful":0,"cool":0},"0S-hapNmwZrVuyMaSzSTxQ":{"text":"First lets talk about the chalky taste it puts in your mouth. I'm not sure how they make i","useful":0,"cool":0},"sSeRhPbniNXiP5mxI6Ye_g":{"text":"Always so many options here. Weird flavors but they work. BRING BACK THE AVOCADO ICE CREAM","useful":0,"cool":0},"1gtaBPQ73nwf7w7pTqM_Uw":{"text":"EVERYTHING IS AMMMMAZZZINNNGG HERE!!\n\nA Pint of Black and Gold and Red Velvet Cheesecake p","useful":1,"cool":0},"7Ry1XdbxK82ewXHAtMKYLw":{"text":"Love this place!!! Such wacky and fun flavors. My favorite is goat cheese and fig. Yum!!! ","useful":0,"cool":0},"aVHMXcHIHxii_cIQ6pl-xw":{"text":"Good ice cream with a lot of choices. They make the ice cream on the spot so you are able ","useful":0,"cool":0},"vfcLI3nFdLNpDdD24JRorg":{"text":"A solid ice cream place that has a good atmosphere.  I love all the funky flavors you can ","useful":1,"cool":1},"9Ie6uF8B4lIYs23G9Q2sPg":{"text":"Creole Creamery. A NOLA must.\n\nI have a problem with this place a lot of the time. Are add","useful":0,"cool":1},"AW5Oymb-UQhuP9BdGT3Lng":{"text":"Favorite ice cream ! I have to have the red velvet whenever I visit Nola. Would recommend ","useful":0,"cool":0},"NdL9ynvPTNOJ7M2kCiyDzw":{"text":"Have I really not written a review for Creole Creamery yet?  After the multitudes of visit","useful":0,"cool":0},"xWAetUmeh9jBkLvdbBkOcw":{"text":"So far the best ice cream we've had in Nola.   Unique and traditional flavors, very creamy","useful":0,"cool":0},"G56hiqQeED0uA3flS24pag":{"text":"Been there a couple of times. Only ever had the Mexican Hot Chocolate, after first taste, ","useful":0,"cool":0},"YJLYe7Zq0syueNvw_bLJyw":{"text":"Yum.  Fun place!! The lemon was great, cute place!! Must try as it's local vs tourist too!","useful":0,"cool":0},"KaOAYxaZ_13UxKaUm4Mwdw":{"text":"TL;DR Solid stop for ice cream, definitely give it a try. \nNote: cash only!\n\nMy husband an","useful":0,"cool":0},"v2moa4l9FrvDWiFxvJf9dg":{"text":"A classic and a must for ice cream!!! No questions asked, just go! There is almost always ","useful":1,"cool":0},"_EiGGH0iNFlQSJ_VhWRfnQ":{"text":"Every guidebook mentioned Creole Creamery as a go to place to visit in New Orleans. Since ","useful":0,"cool":0},"kGXkAzwTwWRowIpEF7z9og":{"text":"ice cream mecca!!!!!!!!!! so amazing go and get as many flavors as possible it is unbeliev","useful":0,"cool":0},"V_qeuIiD9U61CbI9wGf4pA":{"text":"Hands down the best ice cream in New Orleans! Cute decor, awesome location, and delicious ","useful":0,"cool":0},"sp-7K-YAr4n-c44R1IkvIQ":{"text":"Best Ice Cream in the Garden District and Uptown!  Very unique flavors, tried a thai basil","useful":0,"cool":0},"jcZhVOaVaisuy1rhPL_iYg":{"text":"If you want ice cream in uptown, this is my go to spot! great flavors and great combinatio","useful":0,"cool":0},"zRLP5yr9ttur2hpzNpoutA":{"text":"This cute little place has all the ice cream flavors you can think of, many toppings and l","useful":0,"cool":0},"7jfLlwxW81ZUHciKeCEHCA":{"text":"Best ice cream in new orleans.  My fiance and I go every week.\nThere are many flavors and ","useful":0,"cool":0},"08U8WUZtun0hpabBi9srPw":{"text":"Yelp's 5-star description says it all: \"Woohoo! As good as it gets!\" This place is soooooo","useful":4,"cool":4},"tgH8_9IEq5BEAovl-MzrKw":{"text":"Creole Creamery is the best ice cream in Louisiana. The flavors are so inventive, and the ","useful":0,"cool":0},"AR_eXx82whpqu67Gg0fQRw":{"text":"Creole Creamery is my go-to place for ice cream in NOLA. They offer a large selection of f","useful":0,"cool":0},"sBFxNlySYPT1X_53XQSYuA":{"text":"Most important thing : CASH ONLY\n\nWhat's there not to love about a cute icecream joint tha","useful":4,"cool":2},"BYtqfEFR1joLZAUfwh1wKg":{"text":"I've only been to Creole Creamery once and after all the hype I feel kind of let down. I h","useful":0,"cool":0},"XZFrwtZR611JvXgmHrFXDA":{"text":"Creole cream cheese ice cream is sooooo good! Always have to stop for some whenever I'm in","useful":0,"cool":0},"d7mjHsrINIi5ZgMnX4dHEw":{"text":"White truffle popcorn ice cream. Sold!","useful":0,"cool":0},"s862r8q6ZYNhO4-bW3XWeA":{"text":"This place is excellent! My wife and I enjoy stopping here whenever we come to the Garden ","useful":0,"cool":0},"--GtT02uqPsWKiBDP0QfHQ":{"text":"The ice cream was ok! They just accepted cash and the freezer were in very a bad position ","useful":0,"cool":0},"umPuR3kFXB8F279st2NMVQ":{"text":"Vanilla? Nope. Chocolate? Who needs it. Strawberry? C'mon man! It's the creative flare of ","useful":0,"cool":0},"q3-AsvJ2XW13G9taLS_oGw":{"text":"I like the Mexican Hot Chocolate. I also like getting four small scoops. I find when you e","useful":3,"cool":0},"KBk8_agnVKdC2qL10wwsiA":{"text":"I haven't been in a while...but before we were married my husband and I lived a few blocks","useful":0,"cool":0},"hN4-8QGebhVAHvs5Gaq_Fw":{"text":"Amazing ice cream place, perfect place to take friends and family who visit. The lavender ","useful":0,"cool":0},"265DxKs2GKCrtM36t2RXhA":{"text":"Cream cheese + red velvet = authentic yummy ice-cream. Add sprinkles for effect. If you're","useful":0,"cool":0},"fv-0XhRxIIA6DZ1BiYKCFA":{"text":"Not a big ice cream person but this place has such unique flavor pairings. It's a little o","useful":0,"cool":0},"NKaDv3NSMMRLQkgi5Hg1uA":{"text":"Took the st Charles streetcar about 15 min from Poydras. \nLine was long but went fast, SO ","useful":0,"cool":0},"mutXafTkC4iYZ5FOelZqog":{"text":"My favorite ice cream was bubble gum so delicious. Their is no place like New Orleans the ","useful":0,"cool":0},"WHiD7flg0IFSwZnKqED0rg":{"text":"Now that I am finally started to get settled in New Orleans, I have decided to start explo","useful":3,"cool":1},"0eAM6fD-Xwpd9DjIrZvy4g":{"text":"I love ice cream parlors that venture and do unique flavors! My fave flavors were La Vie e","useful":1,"cool":0},"Q1HcgMM86eJFMHZQcSTU0g":{"text":"In my opinion, their ice cream is as good as it gets in the Big Easy - for after dining to","useful":0,"cool":0},"Wxac9KmEdX-SlHEBB9rsAw":{"text":"Everything here is so delicious. On a recent trip to New Orleans, I stopped in here with s","useful":0,"cool":0},"o3ev0ekJPG7QDq_cZVuMVA":{"text":"Hands down the best ice cream shop in New Orleans! ...maybe even in the world! I'm a nativ","useful":0,"cool":0},"MxNfcI47QXprttkLhPSVyg":{"text":"Mmmmmmmm.....local ice cream.\n\nI love the Creole Cream Cheese. It's a lovely shop, with lo","useful":2,"cool":2},"zwL6GxBIMKkCAPIJO324sw":{"text":"I have such fond memories of this place.  We just went back, and it was just awesome.  The","useful":0,"cool":0},"3HD_mWQfKHmTrM-prOByfA":{"text":"We visited New Orleans last week and had to stop by. I had their sundae with lavender hone","useful":0,"cool":0},"LBplJsEPcV8C16IsP_p11w":{"text":"Thank you Yelp! This place is one awesome find!! Awesome creative tasty flavored ice cream","useful":0,"cool":0},"Xa0ImDvwXtjxc1dPsGSeDg":{"text":"Found this place close to our rental and we wanted some ice cream. Not disappointed. The s","useful":0,"cool":0},"qc1khuATLkPOP3wY4ZJNdQ":{"text":"I just recently tried this ice cream for the first time, and I loved it! I had the lavende","useful":0,"cool":0},"Lb8KlLKUBviLKXhDr2SoWQ":{"text":"Super fresh and delicious! We tried the banana split and the peanut-butter-fudge sundae.  ","useful":0,"cool":0},"GPtPNfU6XST5GDCX2LBDBA":{"text":"I'm not really an ice cream person but this was a game changer...when I tried lavender hon","useful":0,"cool":0},"fB5W15pvP2PCD8bzoin8lQ":{"text":"Great sundaes! We tried the strawberry cheesecake and the peanut butter fudge. Both excell","useful":0,"cool":0},"uAMm__j_aI3Iqx1Xt-L86Q":{"text":"This place is very tasty -- especially the red velvet cake ice-cream.  There are a lot of ","useful":0,"cool":0},"d0GBMEhDlFfSfwtLnXeYBA":{"text":"I've spent hazy nights with ice cream in seedy 1 hour motel rooms.  I've had raging partie","useful":0,"cool":0},"y_g8rUd2AciRwYXhMK4nmg":{"text":"My boyfriend's friends randomly suggested this place after a meal at Dat Dog so we decided","useful":0,"cool":0},"c32EszEVAEq5kXoXqDJ8Kw":{"text":"Great ice cream in nola.  this is a gem that we managed to check out without having to wai","useful":0,"cool":0},"qyFcDTyqV4on2eqsmff4MQ":{"text":"This may sound ridiculous, but I have been in Creole Creamery five times and sampled their","useful":5,"cool":3},"Jki8Gsii3yppjRLb91YN1w":{"text":"By coming here for some of its delicious/creamy ice cream can turn a day that registers as","useful":0,"cool":0},"7oFdsWVjqTAmXCj6c_y3aQ":{"text":"I don't go here as often since both La Divina Gelateria and Sucre' opened in my neighborho","useful":1,"cool":2},"2i9PXAOG7okFX5h8iazzPQ":{"text":"There are almost too many options!  I didn't know about the mini-scoop sampler but I wish ","useful":0,"cool":0},"scksrgHboLAb3oNFKTgAIg":{"text":"Still love this place and will no doubt return, but choose different flavors. They have so","useful":0,"cool":0},"1lZBb8PuZiyB5v10Ki87zA":{"text":"They make corn and black pepper ice cream!  They make christmas ice cream that tastes like","useful":0,"cool":2},"w59dM3SEp0_QPbmX-brgkQ":{"text":"Such a great, unique selection of ice creams. If you can't settle on one or two flavors, t","useful":0,"cool":0},"h0mfb79eheyNp6fVHIwJIw":{"text":"I tried a double scoop waffle cone of the Cookie Monster (cookie dough, chips ahoy, oreos,","useful":2,"cool":1},"ma5cOO-qLUe1y7yrJTFHGg":{"text":"Part 3 and we're still having a ball.  I was worried that we came a little too late  (30 m","useful":1,"cool":0},"dr5mUqCF1GuoWUWnhm5Ogg":{"text":"Best ice cream shop in new orleans! So many options....not so much stomach space. The plac","useful":0,"cool":0},"yd3KIE1RjPy3BdMam5AliQ":{"text":"It has been a few years since I have been here but I still remember how delicious the Oatm","useful":0,"cool":0},"_f1Pqd3nnqwx8FDH5MgbRQ":{"text":"**CASH ONLY**\n\nI had heard great things about this place, so we made the trip on the troll","useful":0,"cool":0},"-Qh5LN2cu8LpelvzLj78NQ":{"text":"I love the funky selection of deliciousness! I just got the Green Fairy (Absinthe. DJ Choc","useful":1,"cool":1},"ukLWjJfvRqlkVf0R2OEzFg":{"text":"I would have given Creole Creamery 5 stars a few years back.  When it first opened, the ow","useful":2,"cool":0},"IVzL1gIQQC2j63tBo-gvZA":{"text":"Yum yum yum!  What more needs to be said.  We walked from our bed & breakfast place and wa","useful":4,"cool":2},"m8x4PdmvUp5N3V7VIN_CKA":{"text":"Salted Caramel Ice Cream... I could just say that and your life would be complete knowing ","useful":1,"cool":1},"-9X1hY7hMlC7n9RYAbN5hg":{"text":"Creole Creamery is my favorite dessert place in New Orleans. Their unique flavors and frie","useful":1,"cool":1},"y3fvNW7uIGzE1CyDbISDAg":{"text":"Visiting New Orleans and found this place, and all the reviews were right!! More flavors t","useful":0,"cool":0},"aeCHgDeUixn5TCA3g2d1aw":{"text":"It's been almost a year and had to return to Creole Creamery. Can I please have one of the","useful":1,"cool":1},"nas4T6UHtKY7pgixrjBFSw":{"text":"Best Ice cream I've ever had! Really all I can say - I'm no ice cream conneseur, in fact I","useful":0,"cool":0},"0fcCrSIYhwWiw26K021O1g":{"text":"best ice cream i've ever had and comes in the best flavors and they even offer a dish of 6","useful":0,"cool":0},"1FgeB_GSAv6x3wX_5Ss3ag":{"text":"Some of the best ice cream I've ever had.\n\nFavorite flavors include: Salted Caramel, Red V","useful":0,"cool":0},"RGxZN_zvb12InjsagBlxLQ":{"text":"This place has the most unique flavors you will ever find! The lavender honey is my all ti","useful":0,"cool":0},"unptLY3SgIBwNf-2ERyuJQ":{"text":"Delicious ice cream choices.\nMy favorites were Lavender Honey and Chefs special Chocolate.","useful":0,"cool":0},"HGSmfJ7FQ3Pq6dDsPD00lA":{"text":"I was too excited to get ice cream that on this first visit here, I didn't confirm what ti","useful":4,"cool":2},"Xvtku7vTWUAiSzM1uTam3A":{"text":"Always delicious!\n\nThis is probably the best ice cream in Nola. I love that it is in an ol","useful":4,"cool":0},"O0bfcqNfqdf_UI6jQvF93Q":{"text":"Love, love, love this place! The ice cream is SOOOO good! They have great customer service","useful":0,"cool":0},"adk7geOmkUQbHyRf0dVVbw":{"text":"The ice cream is fantastic here, my fav is cake batter.  The bathrooms needed to be cleane","useful":0,"cool":0},"vY0oXDuJkTh_YcyBXisaGg":{"text":"With such a variety of flavors, from the everyday \"favorite choclate\" to to off-the-wall \"","useful":2,"cool":0},"umOvwI8tt0P7ABhTwxvHJw":{"text":"If you find yourself wanting ice cream, this is the place to go (skip Coldstone, where I s","useful":1,"cool":0},"u4P_Ruko2CIaI0oisCvqFA":{"text":"Delicious in house made ice cream and sorbets. Just doesn't get any better on a hot day. G","useful":0,"cool":0},"Fda6km-No9KEWBg7tcxAeQ":{"text":"I bring my wife and kid here once a week for ice cream after dinner. We love Creole Creame","useful":0,"cool":0},"d3Gn2j_TZCRlt0rVLxgLdQ":{"text":"If I had to eat one food for the rest of my life it would be Creole Creamery ice cream.  I","useful":0,"cool":0},"6PwvySiKjMp8ItpHozOJ1Q":{"text":"My goodness! A sweet spot that has conquered Dorothy's dislike of desserts? \n\nNot exactly.","useful":2,"cool":1},"6KSr3zBPTZiVdsc5qTv1Nw":{"text":"Tchoupitoulas Challenge, you've alluded me this time - but I WILL be back to conquer you. ","useful":1,"cool":1},"BphWAeEwc5oGS-gG7MehUQ":{"text":"I made a point of going here twice while I was in town, even though it was very much out o","useful":0,"cool":0},"bZNbz_c0wwl4A9WOUS7jsg":{"text":"The second time was the charm! Or maybe the summer flavors are much superior? Wife and I e","useful":1,"cool":1},"c_YNFz1CkGw6cYVdzfpwVA":{"text":"I was super excited to visit Creole Creamery during our weekend trip to NOLA this past Feb","useful":1,"cool":1},"k8Vt-fYgEk9wIdANod846g":{"text":"They catered the ice cream for our wedding.  The staff was friendly and helpful from day o","useful":0,"cool":0},"6S0FgjEwitOCPf-MZtP8uw":{"text":"This was another location we chose after seeing it on Diners, Drive-ins, and Dives and it ","useful":0,"cool":0},"1soEYxptts3Mqbjc96Y3bw":{"text":"Quite possibly the best ice cream that I've tried. They make everything in on-site and you","useful":0,"cool":0},"fx70NaTN4OH1-vI2WYRoVw":{"text":"This is my family's favorite place to go\n\nThe ice cream is wonderful and service superb.  ","useful":0,"cool":0},"77pRwcm1ejhPnAHg5-ct8Q":{"text":"This is legit some of the best ice cream in the country. \n\nI travel for a living, and make","useful":0,"cool":0},"CMq4QeLwBT833x8aXkmnvw":{"text":"Went in for a brownie sundae. Delicious! They do only accept cash! Nice \"homey\" place to g","useful":0,"cool":0},"eQhW67xlJYMBARcVlPqVFQ":{"text":"I must have sampled close to a dozen flavors though because I couldn't choose just one. Th","useful":1,"cool":0},"WM-DiHSpCaSv6qqkJZ1oYQ":{"text":"Get out of here!!! This place is out of this world. The flavors are so creative and varied","useful":3,"cool":2},"bT8RCOn9Nm-YE9c8HK1Z8A":{"text":"I wanted a shirt with their logo on it but unfortunately they printed a quote on the back ","useful":0,"cool":0},"zPKR2B1wi5FKRrNwY53nxA":{"text":"O. M. G. \nI can't even describe how wonderful this ice cream is. Of course, who doesn't lo","useful":0,"cool":0},"Owwz4hRsw0cXCFl-evj9JQ":{"text":"We stop often while walking the dog. Don't let the lines discourage you, they move quickly","useful":0,"cool":0},"Bx2UX_paLf-tgf09GWLpjQ":{"text":"Neat ice cream choices. Five stars for creativeness, local ingredients, helpful and friend","useful":0,"cool":0},"EhM4oRdsZTHo0fuZwPNl1w":{"text":"I mean really, this place has a flavor for EVERYONE.  Even better than that, it's a flavor","useful":0,"cool":0},"Y2bFxuvarrkHaTgURl1dWw":{"text":"The only reason I'm not giving 5 stars is because my favorite flavor Pink Peppermint Patty","useful":1,"cool":0},"Inub3-La0poVLehTwjV-Cg":{"text":"Just say 'yes'...Thank you Creole Creamery, for making our lives rich!\nIf you are visiting","useful":0,"cool":0},"aKeCfUzfmpVJjerio_YkbQ":{"text":"My friends and I rode our rented bikes about 8 miles just to get a taste of the Creole Cre","useful":1,"cool":1},"PIvUMo9x7fVlVWzBprJl7Q":{"text":"In spite of the fact this place doesn't take credit cards Creole Creamery is a New Orleans","useful":4,"cool":3},"M7lBqQlri9dXKT4zowdxIw":{"text":"Hands down one of the best ice cream places in the city. Every scoop of ice cream (or a su","useful":0,"cool":0},"raEldbjLulVNXoDbTYyIfg":{"text":"Always amazing. Don't be a tasting hog! Love the Mexican hot chocolate every time. Staff i","useful":0,"cool":0},"OCzt8IDQqR6IE56BFh7S5w":{"text":"Easily the best ice cream joint in uptown. Always busy but always moving the lines pretty ","useful":0,"cool":0},"6sXvfEYPJ0rXBMKL78BX1g":{"text":"Absolutely impressed with the unique flavors! I had lavender honey and champagne! deliciou","useful":0,"cool":0},"QOxz0fIuSEVmKNGKuAwPPQ":{"text":"Great ice cream!! They offer some really inventive flavors you'll be hard-pressed to find ","useful":0,"cool":0},"uwvXIG9-TcZct315MaipHQ":{"text":"Oh.\nMy.\nGawd.\n\nHundreds of miles separate my body from this heavenly place but my mind tak","useful":2,"cool":2},"t5udG-nUV5BiodvnF7NOPQ":{"text":"Springtime @ Creole Creamery didn't disappoint! During graduation weekend we stopped in fo","useful":0,"cool":0},"0zjZe8JqK1BLIKRii_FiKQ":{"text":"It's too bad I only had the opportunity to stop here once during my vacation to NOLA.  Wit","useful":0,"cool":0},"uH-JJ6HVqkWYljUEvOVYfA":{"text":"Creole Creamery never disappoints. The first time I came here I was curious about the asso","useful":5,"cool":3},"NqEo2oGrnyLbjdejesb6JA":{"text":"This place is legit (hey hey), and with all their cooky flavors, I always opt for the samp","useful":1,"cool":2},"ad3tor5zy5uaMTPWXOIP9g":{"text":"If you're looking for a great ice cream stop, then look no further. This is by far my favo","useful":1,"cool":0},"9mUiRLL8vrB9gMLwg_90Cw":{"text":"I have been coming here forever and this is my last time.  I t is wonderful but I have to ","useful":0,"cool":1},"q6glIedmRibU8oYJWZjSlg":{"text":"The Mexican Hot Chocolate and the Lavender Honey are absolutely delicious! The Hot chocola","useful":0,"cool":0},"UOPwGqLketnNJhQTyEk2fg":{"text":"Everyone wants to say they have the best ice cream in town. So it's understandable to be s","useful":0,"cool":0},"Fqz9wyVPJb-aFFQbAbB6gA":{"text":"Absolutely delicious! The line can be a bit long but for all the right reasons. The worker","useful":0,"cool":0},"2woWORZNgR8Cxn_HdG3aKQ":{"text":"I moved back to N.O. recently and found a place on Prytania - 2 blocks from the Creole Cre","useful":1,"cool":0},"JSQFMZi9DfCG8LgGYA_2yA":{"text":"HMMM I love this place the lavender and honey ice cream is amazing.  They offer such uniqu","useful":1,"cool":1},"8iTzYLaukDmLSSGJ4kxEOQ":{"text":"Finding the Creole Creamery was like finding heaven on earth!  So many flavors to choose f","useful":0,"cool":0},"Ghe9saaA7DYpdxQMToHOhQ":{"text":"A very large variety of ice cream, cones and a mixture of tasty treats. The guy behind the","useful":0,"cool":0},"WnbjYTNubFysUvXFv56X8w":{"text":"Ice cream , who doesn't love it. Just sad I didn't get to eat more  great selection better","useful":0,"cool":0},"mXtw8W2l1CLqHWGYGwWcGg":{"text":"Is it good? Yes.  Is it the most amazing ice cream shop in the world that is utterly life ","useful":1,"cool":1},"XPuoRqehME7ThWE8ydnPSA":{"text":"Love this place, only place I know other then in Orlando Florida that they have lavender i","useful":0,"cool":0},"uP7QOQbmdv-d7mv0FxIazA":{"text":"I'm not so adventurous with my taste in ice cream flavors, but they had so many different ","useful":1,"cool":1},"U6yrdTkzcIIe6fEHfSIWdw":{"text":"$CASH ONLY$\nWe were in town for spring break and had taken the trolley out to Audubon Park","useful":0,"cool":0},"gAeIILfG0n2-LPW5pJDJtw":{"text":"Want a good ice cream place in new orleans?\n\nCreole creamery! So much selections and diffe","useful":0,"cool":0},"bD2cjB6gAW1FKNgCWwZYDw":{"text":"It was Ok, not the best but it was cheap and they had many choices, I would recommend it t","useful":0,"cool":0},"GFJcUXiwEQ8B6bsiuUQRFw":{"text":"ATTENTION LACTARDS (my lactose-intolerant brothers and sisters):\nThis place will simultane","useful":1,"cool":1},"86IidCFMU8Gcrzc8BMHIIg":{"text":"Lavender honey ice cream is to die for. I can't wait to go back again and try some of the ","useful":0,"cool":0},"-Xuamh3aW_WihzwgLebEjA":{"text":"I've been going to Creole Creamery for the past four years. I frequent both the Prytania S","useful":0,"cool":0},"EwDkBnk5nk18xPnBr4wUgA":{"text":"Mango Unchained was unbelievable. Creamy mango with a touch of chipotle peppers. Delicious","useful":0,"cool":0},"fietI7wXAqu_tHLFfkMOYA":{"text":"I can definitely see why there would be a line wrapping around the ice cream shop. Creole ","useful":0,"cool":0},"FDTzXHk9fQyG1PzkD-VS1A":{"text":"I love this little ice cream shop in the garden district area.  Parking is tremendous and ","useful":0,"cool":0},"gMCkCpsHU_s2983oNCw_mQ":{"text":"How could this be anything less than 5 stars?!  Now one of my favorite ice cream shops in ","useful":0,"cool":0},"E-5ZIHJNH9tVDpnTrefJCQ":{"text":"I am boring and just got a cup of mint chocolate chip. He got Mango Unchained because he i","useful":2,"cool":0},"OqwghHMrSo_HL9ZEDF_46A":{"text":"Really great ice cream this place fills up pretty quick. So beware of the long lines it's ","useful":0,"cool":0},"jsXTmpbduA7XD-3KkoShMA":{"text":"Creole Creamery really is the best. It is quality ice cream that is great for kids as well","useful":0,"cool":0},"Um6uaepUqenhjzxgwQJ-NA":{"text":"I am OBSESSED with Creole Creamery!! They have a huge assortment of classic and unique fla","useful":0,"cool":0},"G0ik11AQPdz5reKAV0q8rQ":{"text":"This place is one of the most (if not the most) popular places for ice cream. There is alw","useful":0,"cool":0},"3Cr_vWwJ5GZJOSgE4hnYkQ":{"text":"Excellent flavors! Excellent service!! This was a nice change of pace after spending the d","useful":0,"cool":0},"5EAuFz7-KkPMqLnnl2-uew":{"text":"A wonderful hidden treasure and their prices are good! I tried a scoop of their red velvet","useful":0,"cool":0},"n8zhoLyukArCbAyoR-C41w":{"text":"best ice cream!! Lots of amazing flavors and combinations. Remember to bring cash, they do","useful":0,"cool":0},"Wv6dkkIP69XX56tlF9Ir_A":{"text":"One of the few ice cream places I saw in New Orleans, and it was very tasty. We came here ","useful":0,"cool":0},"IbJ_Kz0ZbDioXhtdoJdDUQ":{"text":"Several people in line were complaining about the prices- they have a huge chalk board wit","useful":1,"cool":0},"68HUr-x5qp1JDGHKamDfZA":{"text":"Wonderful ice cream place. Very unique flavors. Not too sweet. Highly recommend if you are","useful":0,"cool":0},"hfaWqmCIjwaK99IeV3pB4g":{"text":"Wow! Every flavor is so good and their scoops are very generous. My favorite was the salte","useful":0,"cool":0},"ZT4OtaG6zoHaehn8eUVvbg":{"text":"So many unique flavors to choose from that I've never seen before and I sampled many!  I l","useful":1,"cool":1},"EhF4d_YxcNYdhI63aCJUHA":{"text":"Best ice cream in the city! So many delicious unique flavors you will not be disappointed","useful":0,"cool":0},"FPxMz5R8QxACtKmfcLJLig":{"text":"So this place has really good reviews right...but I kind of missed out on the part where t","useful":1,"cool":0},"gnsG8b9eR1ivckRF1QFaTg":{"text":"It took me forever to decide what I wanted because they have so many flavors. Typically, I","useful":0,"cool":0},"v_P9AnnEWUNRWBk42F9Csw":{"text":"Good but my only complaint is that they update their system with a credit card machine. No","useful":0,"cool":0},"M0oTEgqwPfLira5vtq6a7w":{"text":"This place is amazing and I would recommend to locals and tourists.  The ice is incredible","useful":0,"cool":0},"-WcuPybwjPBGDGJ36RCXJA":{"text":"I think this place has been reading its reviews and has gotten to be too big for itself. F","useful":4,"cool":3},"qIEHAD306XSctXlNl0C0iQ":{"text":"Best homemade ice cream uptown, I just hate that they only take cash.  The Cookie Monster ","useful":0,"cool":0},"V1h8SSLlbh-sO195p0dYxA":{"text":"Creole Creamery is HANDS-DOWN the best ice cream shop in the city. This classic ice cream ","useful":0,"cool":0},"62YTjhNsSz2kowwFbLXkoA":{"text":"YUM! I loved that they allowed you to try all the unique flavors.  The lavender honey, Mex","useful":0,"cool":0},"j12a7wexnFm748wSMNFGIw":{"text":"So many different flavors. Really creamy ice cream! Cotton candy tasted just like cotton c","useful":0,"cool":0},"VaeiyCO15RXw_vcFtjO_SA":{"text":"Came here after an early dinner. Take the St. Charles train and when you get off just walk","useful":0,"cool":0},"mLfJR8ylWgh1QBX1LdEeuw":{"text":"I love this place!! I can't believe I have not came here sooner. I came here on a Wednesda","useful":2,"cool":3},"bgGYY1fNowAP81ZhYfT7VQ":{"text":"This place reminds me a lot of JP Licks up in the Boston area and Amy's down in Austin-- a","useful":0,"cool":0},"AlTvXLjhZXV3xUT1VQKNTg":{"text":"Great ice cream if you can stand the wait. My wife tried the brownie Sunday was filling. A","useful":0,"cool":0},"8EBmeSvjgRbdJ25jY3574w":{"text":"Yet to have a flavor I didn't like, but Cafe au Lait, Black & Gold Crunch and the Earl Gre","useful":0,"cool":0},"zJlSe4o5lrbKF7DEs26w6Q":{"text":"Unbelievable ice cream flavors! Hibiscus, lavender honey.. Truly a one-of-kind creamery. I","useful":0,"cool":0},"QIIcglPmAvMhZ1pcdKzs6Q":{"text":"Absolutely wonderful. The chocolate amaretto cheesecake is especially good. And the prices","useful":0,"cool":0},"ng6BPgO7xNMEsJ3slsDqyA":{"text":"I have a trip to NOLA planned in June and most of it revolves around Creole Creamery--that","useful":0,"cool":0},"5206_dIFE_R4ccaPycg6CQ":{"text":"Highly recommend stopping here! Delicious ice cream and waffle cones, both made in house. ","useful":0,"cool":0},"rsaZV5mrNUl7gC2a0VExoQ":{"text":"Creole Creamery...  100 precent milk fat, the way I like it!  The two favs for me were the","useful":0,"cool":0},"H21IBmtEPlEJYOd70s44Zg":{"text":"Best ice cream shop in the city. That's all there is to say. The flavors are unique and th","useful":0,"cool":0},"IeCEETcPeXrNYIipimUZ1A":{"text":"It's 2014 no place should be cash only!\n\nYelped this place prior to our trip and seeing it","useful":0,"cool":0},"Ey5Iq0Id2HaR9q6E60rIVg":{"text":"Best ice cream I've ever had. The wife loves the Cookie Monster flavor. I'm more of a try ","useful":0,"cool":0},"ndbSuk-OYX78emNRAsvsqQ":{"text":"Best ice cream flavor selection I have ever seen! Lavender honey and Chocolate Amaretto Ch","useful":0,"cool":0},"SeZCcxqzj8n0O5c1BbBzXQ":{"text":"My oh my, how does one decide which flavor to get? My husband did decide to take the chall","useful":0,"cool":0},"Z0DzkBQomuEIgVnNe55uTw":{"text":"We ordered the small scoop sampler ($5), more than enough for two people. We tried Red Vel","useful":0,"cool":0},"EULr3mp8_czpF--76ZG5Iw":{"text":"The lemon sherbet was amazing and a welcome from the mile walk in the humidity. Friendly a","useful":0,"cool":0},"0jtH0gGTzjrqoWEp2mzbGw":{"text":"old fashioned ice cream shop with not so old fashioned flavors. Get adventuresome and try ","useful":0,"cool":0},"jf3kOQFzB_a-Fu64iYEEQw":{"text":"Creole Creamery is a very popular ice cream parlor. For years I have heard how wonderful i","useful":3,"cool":3},"ZEmDdmlvzd1GzT0Yp86gBw":{"text":"Wonderful selection of flavors and ones I had never seen before, like petit four.  Got the","useful":0,"cool":0},"27IKOmEE5CXndEL7Q4l_0g":{"text":"Always glad to support local family owned businesses. The super yummy homemade ice cream, ","useful":1,"cool":1},"eO_nMsftQeHAB6uv3vi5Fg":{"text":"Some of the beat ice cream ive ever had.  The flavors are everything, an unbelievable vari","useful":0,"cool":0},"OLvyEDf_5L0CcuxqMsTn8g":{"text":"Creole Creamery is what dreams are made of. Hands down my favorite place for dessert. Loca","useful":0,"cool":0},"APVv-4UN6MkLUDzQmJb8Gg":{"text":"Ok I love caramel and this place has the best salted caramel ice cream around !! OMG and t","useful":0,"cool":0},"JPtmHprwiJrNOegMW85Rcw":{"text":"This is an amazing little ice cream shop with great flavours.  The service is so/so depend","useful":0,"cool":0},"GZMfyY4W4P0TV-SqvoZrdg":{"text":"Such a great place to be a glutton. Sit at the fountain bar and enjoy the sites, sounds, a","useful":0,"cool":0},"_BIK4NPetS2pyUE8kgL8KQ":{"text":"Best ice cream I've had, definitely in the New Orleans area, possibly anywhere. Everything","useful":0,"cool":0},"dAt_aOOkoQDgxCLy5DHg2A":{"text":"Delicious ice cream, creative flavor options that are changed regularly, nice cozy ambianc","useful":0,"cool":0},"oEIzWl3Fzg7NfyYxXr8bWA":{"text":"OMG!! I went for the first time today and oh my goodness.. Ice cream heaven.  I thought i ","useful":8,"cool":7},"QsTWGYxSgdp0BXPlNQin6A":{"text":"Good ice-cream, nice variety, but cash-only in 2019 is ridiculous for a business as popula","useful":0,"cool":0},"neIRUrP_dR1Yqqk3BzcEIQ":{"text":"I was told to visit Creole when I was in NOLA by a well respected chef. However, when I wa","useful":0,"cool":0},"IjNeWx9-HiTJHso3vXlPLw":{"text":"Is this what heaven is like? It might well be. Walking in to Creole Creamery feels like yo","useful":1,"cool":0},"Q4UwP2WI5fOYt2s0OQK7gw":{"text":"Items Selected:\nSamples:  Red Velvet, Lavender Honey, Gorgonzola and Candied Walnut, Petit","useful":3,"cool":5},"HYDT_b_OePxLEVWfnXct8A":{"text":"Cash only!! I will never get enough of this place. Original flavors that always blow me aw","useful":0,"cool":0},"_OXOmSgcrjMH__ifCjlmyw":{"text":"If you've not been in a while, they have a bunch of new flavors or some you may not have s","useful":2,"cool":3},"dNI7UPjhMdZ6G4iCYF7SFg":{"text":"This is a really great local ice cream place. Tons and tons of choices of ice cream flavor","useful":0,"cool":0},"4CcxgzRoS34zVdNjV6vF9g":{"text":"It's funny that they have to put up a sign behind the counter telling people not to ask fo","useful":0,"cool":0},"feio9orU3iQV_6y2wKbr2g":{"text":"They have a ton of unique ice cream flavors that sure do not disappoint!\n\nMy favorites wer","useful":0,"cool":0},"H0Xe5lSM5PgLnWxq4BDszA":{"text":"I did not suffer the same complaints as other Yelpers reported.  I enjoyed some free sampl","useful":3,"cool":0},"fg9WmKYebhSRXjjptkWxUg":{"text":"I've been holding off writing a review for this place for over a year now, my sweet creamy","useful":20,"cool":17},"iLc9llndKtk1izuJr_uIUw":{"text":"The\nPalette\nOf flavors\nAnd late hours\nAre excellent for surviving summer.","useful":0,"cool":0},"A0X_f6Qr8cNE2oSUXpHPHg":{"text":"My second trip to Creole Creamery confirms my previous disappointment. The staff varied be","useful":2,"cool":0},"w8z1T4mzHX_UqzVfhbdwCg":{"text":"Without a doubt, the best ice cream around.  Service is always good, huge scoops and fair ","useful":1,"cool":1},"tWI2SUkVs_6xHjhTfcb2RQ":{"text":"The ice cream flavors are absolutely amazing! We had pear balsamic and salted caramel and ","useful":0,"cool":0},"FZR5xnjBLpJZVr57JwWdQQ":{"text":"5/5 would eat ice cream here every day if I could. The floral flavors are amazing, and the","useful":0,"cool":0},"5uGVxG-NhsWSebISJqfRvw":{"text":"Oh I wish I could pack this store up and move it to California! Wonderful, inventive flavo","useful":1,"cool":0},"PXTZTXWVuMeqjlVjPesA9A":{"text":"We attempted to go to Hansons Sno Blitz but I had no interest to wait an hour for a sno-co","useful":0,"cool":0},"19MdRQac-nyvyr9IdirL9Q":{"text":"Super packed on a Wednesday night just before closing. SUPER packed like you couldn't even","useful":0,"cool":0},"G2iqkmMsYlqMq1OO2CgusQ":{"text":"The peanut butter fudge pie was so good, and the two scoop portion just about incapacitate","useful":0,"cool":0},"x871yTJAQfS8sDzeJ3tfpg":{"text":"The ice cream was great, but the guy who scooped my ice cream was kind of rude and unpleas","useful":0,"cool":0},"uzwzzcmGwq0-1Ma2L1DrEQ":{"text":"Good, unique flavors of ice cream but cash-only? I mean really, that's just ghetto. They h","useful":1,"cool":0},"UiS4xNCAZmDM-3U5B19MnQ":{"text":"I love when a place has non-dairy/vegan options. Their coconut sorbet was creamy as any da","useful":2,"cool":1},"EflWn88O2kFPEKMUF1NeTg":{"text":"I kept telling my mom and sister that Creole Creamery was just as good as Bi-Rite Creamery","useful":1,"cool":1},"0n7RdEPhc_jfdwlUoU1ASg":{"text":"One of the best places to get ice cream in the United States.  I can't tell you how great ","useful":0,"cool":0},"Ruh1WwNBD4sTnGkhnf_HTw":{"text":"Delicious, I enjoyed the salted caramel and red velvet cake.  So many flavors, can't wait ","useful":0,"cool":0},"N5NLaVPchk_OLkzxCLP0AA":{"text":"Absolutely LOVED their ice cream. We had the 6 mini scoop sampler for $7 because there wer","useful":1,"cool":0},"4XB0Ij9ieXUKowWkgRpkuQ":{"text":"This place was great, I mean, goat cheese and fig ice cream. YES PLEASE. As a part time ve","useful":0,"cool":1},"U0dC6i8Z1py4cNVTo5VdIQ":{"text":"I love how they have certain unique flavors. One of them being the honey lavender (I've ne","useful":0,"cool":0},"E7B2ZYIeMCQGLH6mYL6xiw":{"text":"Wow, I am totally going to get slammed for this - or at least won't be receiving any frien","useful":2,"cool":1},"pEXZWm1ZPw325D7XYoJ3xA":{"text":"We search far and wide for unique creameries. We found one here. \n\nLavender honey. \nSarsap","useful":4,"cool":0},"XTFKMy64poiMJn7wMMUwtA":{"text":"The service is always fantastic here and the variety/options will also make you return ove","useful":1,"cool":1},"Y-qbSVpqj3iI5yAQjLLzvQ":{"text":"Home of the old McKenzies which they have still kept the neon glowing, What's there to say","useful":2,"cool":0},"JFXuqlhbUGozGpVtQOKF8Q":{"text":"Most unique flavors you'll find and sampling is fun. I enjoyed the Magnolia Flower, a seas","useful":0,"cool":0},"a3sdxLEn_bm7DFDsxT_kTg":{"text":"This is my ultimate favorite go-to spot for ice cream! The only catch is Creole Creamery a","useful":3,"cool":2},"dCcF0Clsq5Xy6qJBlSN_uQ":{"text":"Stopped her on vacation for some sweet treats and was not disappointed. Prefect ice cream ","useful":0,"cool":0},"Ci47JhBBL-3sXKXNCekp4w":{"text":"Service was nice and quick. \nFlavors are unique and interesting. \nI got green tea and hone","useful":0,"cool":0},"P40ozMjASvTxCAoL4IDNkA":{"text":"Oh ice cream, my forbidden love. How can your sweet and creamy goodness hurt me so bad? Wh","useful":1,"cool":2},"zT91TO0BsdVODoJKYibHbA":{"text":"Love this place; every favor is an unforgettable adventure in your mouth!  Hats off to the","useful":0,"cool":0},"GDgsu6TBMyhNhiZKN61Xhg":{"text":"The ice cream was so rich and flavorful! I recommend the cafe au lait if you like sweet co","useful":0,"cool":0},"1YfXarMUiP3qebSOYnHxTQ":{"text":"Best ice cream ever. Hands down. So many flavors to choose from...ranging from traditional","useful":0,"cool":0},"v-ZNzPVizdsla-C3CogFog":{"text":"Creole creamery is the best ice cream in NOLA!  A very laid back spot in uptown that still","useful":1,"cool":1},"PC1_O0FfavRKiNkJZHr2mQ":{"text":"Ice cream you scream we all scream for a ice cream!!  \n\nDriving back from Florida, we deci","useful":0,"cool":0},"f4EDErLNB3cUvDLvYqcInQ":{"text":"Best freaking ice cream in the world. Yes, really. That good. \n\nThe Creole Cream cheese Ic","useful":0,"cool":0},"zQnrilvm33wlXLkS9U8vMw":{"text":"Yummmmmmmmmmm. Yum. \n\nStopped in here for a birthday treat with the Hubs. The atmosphere i","useful":1,"cool":1},"lI6FKURH_DqLy2Uaro3Y_w":{"text":"Eek.  Sometimes the hype is undeserved and for me, my visit to the Creamery proved to be o","useful":1,"cool":1},"5iDslnczp5PQtpkaAczxgQ":{"text":"I didn't find any of their flavors to be particularly strong, which I didn't like. All of ","useful":0,"cool":0},"8mTxIIsGe9t_TF_QlJP9YA":{"text":"The ice cream was delicious, though I didn't taste any malt flavor in the chocolate malt i","useful":0,"cool":0},"wzFLwpILPZyfkAm0DC6gKA":{"text":"Great local ice cream! I love going to Creole Creamery late at night with a group of frien","useful":1,"cool":0},"k-_N8wrGXnz3brPerBZAOQ":{"text":"One of our local guides told us this was the best ice cream in NOLA. It was pretty good, b","useful":0,"cool":0},"yABYp5Zw3NT0cr5nho8GaQ":{"text":"Wide selection of exotic flavors that you don't see everyday. Don't let the unfamiliar nam","useful":0,"cool":0},"T3UDK5nmymD1S_6MIbh53Q":{"text":"fantastic ice cream but the rotating trial flavors are inconsistent. cookie monster will t","useful":1,"cool":0},"owSAVivvllDlfB9Yx2Ic0g":{"text":"Had a sweet tooth at 10 at night and thankfully this place was still open (until 11!) .. r","useful":0,"cool":0},"pUWW41QBuYpsZfm_shTTlQ":{"text":"Thanks to my afternoon host, Kaveh, for bringing me here. The flavors are fun and creative","useful":0,"cool":1},"wY6ux8nLDZI4LIwwmCB3-g":{"text":"If you are indecisive... don't go here. The choices are too overwhelming. \nBut if you love","useful":4,"cool":2},"8ZlShEUDtnw6rPXu_O7EGQ":{"text":"On my first trip to NO I researched placed to eat and this place kept coming up as a must ","useful":0,"cool":0},"2RDwGL0XU7kM4oowxYf47w":{"text":"Best. Ice cream. Ever. \n\nCreole Cream Cheese is my favorite. Its great in a cup or a cone.","useful":1,"cool":0},"gUUiDKP95iO-c9lrjxYeQQ":{"text":"Oh, mama!  Where to begin?  Yes, you can get shakes here.  And ice cream by the scoop.  Bu","useful":2,"cool":2},"DBfp1so_0k2gqNO-_oM_Mw":{"text":"This ice cream shop is located in the heart of uptown on Prytania Street. This little area","useful":0,"cool":0},"nMVgY2yqyGHmbrYoiikP7w":{"text":"YESSSS!!!!!! get here now! Heavenly creations is how I will describe the ice cream here...","useful":0,"cool":0},"SA7T9XS3PIas96SJVuCsvA":{"text":"Holy mole. \n\nTHE BEST.\n\nEVER. \n\nDo not visit New Orleans and leave without eating ice crea","useful":2,"cool":0},"aB0oevUa4SvouRCJjcqnBw":{"text":"It's like I died and went to ice cream heaven, yum!  My son was the first to rave about th","useful":1,"cool":1},"_HwC0ho_GSdCeXEipf-Upg":{"text":"The wife had seen this place on Food Network, and we decided it would be a good stop for t","useful":3,"cool":3},"MfSVi9Idio5N4mtC-fzyIQ":{"text":"Ok, so this was the WORST experience ever with tasting ice-cream!!! So I took my friend he","useful":2,"cool":0},"wu1O6OkpDpGoFe_TzJcOuw":{"text":"Finally made it here and enjoyed it very much.  The cookie monster is the way to go!  The ","useful":0,"cool":0},"CMc-VWEb6L3g0Roiz76VZA":{"text":"This place is great. I think the best in New Orleans.\nThe taste of the ice cream including","useful":0,"cool":0},"TOV1vitQsNTMaoWxa45IZg":{"text":"Put Creole Creamery at the top of your to-do list.  I've been going here for years and the","useful":2,"cool":1},"tgkgvSTf3qE-vzWnYWoLLA":{"text":"eat ice cream. be happy.\n\nFamous words at the Creole Creamery where they use fresh ingredi","useful":1,"cool":1},"2owl3JzomjdG9TcIEsB4LA":{"text":"YUMMY, YUMMY, AND EVEN YUMMIER.  Everything we tried was just soooo good!\n  The place is a","useful":1,"cool":0},"fWW1y7GL3E3CNy5nAfo7gA":{"text":"The place has the best banana split I have ever tasted.  They use fresh strawberries and p","useful":0,"cool":0},"qWSnvmVghwsAzX6Gq3OUfg":{"text":"Salted caramel in a waffle cone. Yummy!! \n\nTried a sample of the famous Cookie Monster but","useful":0,"cool":0},"HJCzHrldm-Io_1GgSpqB9Q":{"text":"Nice spot open until 10 on Sunday night. Took care of the craving. I loved the four scoop ","useful":1,"cool":2},"DCuUPjgzPziHghHwqTad6w":{"text":"This place is just ok. I guess it did not live up to the hype.\n\nThe lavender honey is the ","useful":0,"cool":0},"xzHFddYgeqcN6EPJH4uZrg":{"text":"Cash Only.\n\nCute diner feel.  I love this place.  The ice cream is fantastic and the staff","useful":1,"cool":1},"cSb1U7qEaYyooYFqkE11aw":{"text":"By far the best ice cream in the city if you ask me! So creamy and so good. So many choice","useful":0,"cool":0},"9EceuvU1JRKP_dHBQkikLg":{"text":"I was extremely impressed by all of the unique flavors. The waffle cones were so fresh and","useful":0,"cool":0},"5iTK601FmZlJ031aF4coFg":{"text":"Fantastic flavors! The cookie monster was my favorite. Bittersweet Chocolate Torte came cl","useful":0,"cool":0},"gskBap57jcLa4Gd6Wzt4Cg":{"text":"Best and creamiest ice cream in the city! My favorite place to go with my daughter. The bl","useful":0,"cool":0},"QRNjYypGKbeyvt7WU8Nlxg":{"text":"My wife and I came here on what felt like the hottest day in history. They were incredibly","useful":0,"cool":0},"MZNdfH6A2elJ6utBQhZC-Q":{"text":"Handmade ice cream at its finest.  On the recommendation of the server, I went with the bl","useful":1,"cool":1},"kTZRkzCa5OlLbZLJ2r87Sg":{"text":"haven't had a flavor there that i don't like. huge scoops of homemade flavors you won't fi","useful":0,"cool":0},"1uaImQLDUl-gaS27SSklWQ":{"text":"This is the best place for Ice Cream in New Orleans! They have awesome specialty flavors, ","useful":0,"cool":0},"oD2_Qd9p2_m_Im56kPIR-A":{"text":"This place is fantastic!! The ice cream and sherbet choices are incredible. The Thai basil","useful":0,"cool":0},"a2DaMSHRXW1Piu8kp7Vywg":{"text":"So many flavors so little time! I stop in here now every time I go to the CVS across the s","useful":5,"cool":4},"AO23bxnyoDFRXHtU7SzQNA":{"text":"This place is ADORABLE. And the people are way nice. The ice cream is homemade and the tex","useful":0,"cool":0},"gw_9Nwae1V8qNoURYmLkTA":{"text":"Based on the reviews, I expected a little bit more. I don't think this place was anything ","useful":0,"cool":0},"J21BRQHpzhJmw6_TpZdYqQ":{"text":"Awesome ice cream and a real local feel. Definitely experiment with your taste buds here!","useful":0,"cool":1},"Dw4gQk7gSSc4Di5v37lYBg":{"text":"If you love ice cream you have to go to Creole Creamery! The flavors are on a big chalkboa","useful":7,"cool":6},"CrjgHAfV38-rUebcNrGeNw":{"text":"Their lavender honey ice cream is one of my favorite things on the planet.","useful":0,"cool":0},"7Sn4Fo3hiHuvuOZ-AcZhfg":{"text":"I scream for ice cream.... literally! When I saw the King Cake Sundae at Creole Creamery I","useful":1,"cool":0},"j15XyV6ZHnZC2c_rZsHbxg":{"text":"Breakdown - 5 stars for flavor, 1 star for atmosphere/customer service\n\nThis is my FAVORIT","useful":1,"cool":0},"T66z-2Q59gcJEeN27nh9AQ":{"text":"Cool flavors I haven't seen elsewhere! I got a sampler of four mini scoops (black&gold, la","useful":0,"cool":0},"1ZrsHxKatN6fDsS5p2GWcQ":{"text":"Best ice cream in New Orleans! You walk in and it smells like baked brownies. My favorite ","useful":0,"cool":0},"3qHsc020bEqFHllf8YzxAw":{"text":"I LOVE the Creamery.  Came here this past weekend with my gf, roommate, his gf, and a anot","useful":1,"cool":0},"KRa-YhBTBFMJvblufL3xxw":{"text":"Heard wonderful things regarding the Creole Creamery and it lived up to the hype. Amazing ","useful":0,"cool":0},"Cel7YA_SDWGGy7vDTw2UrA":{"text":"This is a really great local ice cream place. Located in nice area of Uptown with tons of ","useful":1,"cool":1},"wBsDWBqqy5KF_Ox3BmXo9Q":{"text":"If you are looking to try some inventive and unique flavors in ice creams and sorbets, CC ","useful":1,"cool":1},"oqVEZjra2xTM2BpiriQFDw":{"text":"I love ice cream! I love that they have so many flavors, and not just your run of the mill","useful":5,"cool":4},"pBuO5zuoYnbnUIOWxWkDuA":{"text":"Add me to the scores of believers... I mean fans. I live close to Creole Creamery and yet ","useful":18,"cool":15},"sssEDPyXOkWonli4OSYfXg":{"text":"We went here while in town. Everyone loved what they ordered. I had the 6 mini scoop sampl","useful":0,"cool":0},"i_dhK4UOhnfwe1qxFRyQOA":{"text":"I was in town from Vegas, and this place was recommended. HANDS DOWN, it was soooo delicio","useful":2,"cool":1},"Kwjl7_jAhlxu8Esf9jBxCQ":{"text":"My family and I are from NY and FL, and one of my cousins recommended this place due to it","useful":0,"cool":0},"SE1HoWZYGNne-2fTZ6ugbw":{"text":"Cool place. You have to try a few flavors to make sure you get one you like but the variet","useful":1,"cool":0},"XSZbgaT3HMY6Jm5hU6wPuw":{"text":"I really enjoyed eating my banana split at this place! Even though the banana could have b","useful":0,"cool":0},"Ht780khf2e73xsBpseSsjg":{"text":"The most over rated place in NOLA, as with Mothers Restaurant.  \n\nVery seldom eat sugar so","useful":0,"cool":0},"GQWWs-ZXRuK4o1UZMdBy8A":{"text":"So, on a hot, eighty six degree day like this in New Orleans, I couldn't go wrong with som","useful":34,"cool":32},"hIdeFWCNG3z-5GGYmIYG-Q":{"text":"Incredible ice cream!!! We tried multiple flavors among the four of us and the girl behind","useful":0,"cool":1},"UQh6PZI7i-DTn26QhhzcTw":{"text":"Red Velvet and Black & Gold - YUM!\n\nI also like the half scoop option.  2 flavors for the ","useful":2,"cool":0},"BF6mGmuLLx0K0XtAuZC2ig":{"text":"Came here 2 out of 3 days I visited my sister because it is so damn good! Tried the bluebe","useful":0,"cool":0},"mCFiqYs-8DiZW7ftjPPsNQ":{"text":"The best ice cream, here in New Orleans! Thick texture, with lots of delicious and local f","useful":2,"cool":0},"zrzOC9n_AaAxutVgBi85yQ":{"text":"As I'm writing this review a few days later, I feel no shame in trying a six scoop mini sa","useful":0,"cool":0},"RUEzxRctbtAK5MqA00GDzw":{"text":"It's been years since I've been here and I'm so glad I finally came back!  Creole creamery","useful":0,"cool":0},"8Sd378u89F-rGnPSN1sfHw":{"text":"Peanut butter fudge pie, salted caramel, black and gold crunch, Hubigs apple pie are just ","useful":1,"cool":1},"MalmlnnVzeUSf7s4evDPYw":{"text":"AMAZING ICE CREAM! With COVID, we were unable to taste test flavors understandably. Howeve","useful":0,"cool":0},"Tg9-E4HojHJCDpZ4cmmszg":{"text":"Mark: Just go....just do it. Don't think. Just go. Walk, drive, swim, crawl...whatever you","useful":0,"cool":0},"JMXTJe00AqNpybP2fLZNbA":{"text":"After seeing this on the Food Network, I knew I had to try it.  I looked online at the fla","useful":1,"cool":0},"JU_Oecy_08_Sse4PHID5kg":{"text":"My boyfriend and I tried this place for the first time just recently. I ordered a milkshak","useful":0,"cool":0},"oM_cC9SDPvZc5o64h079yw":{"text":"Cute little ice cream shop. Friendly staff. Delicious hot fudge sundae! Will be back for s","useful":0,"cool":0},"L_4413PWtpC_0Hu85S1WSw":{"text":"When I lived in New Orleans, this place was my guilty pleasure. I remember battling torren","useful":2,"cool":1},"rs7CFr_uv1H2rjLC23_N_Q":{"text":"I am not an ice cream fan. I know, weird. I seriously get a craving like once a year, eat ","useful":2,"cool":2},"HWZwjCOIeHc0Eu23QnWIxA":{"text":"First time visit and will not be the last. So all the flavors are made in house and you ca","useful":0,"cool":0},"eKxmM0EOUqz8aPKwjcaucw":{"text":"rich creamy ice cream with weird flavors, love it","useful":0,"cool":1},"o99J_Jl8drS91HWxAQVkfg":{"text":"We took the longest walk in the absolute hottest weather to get here - and every step was ","useful":2,"cool":0},"-Ii5Mte--Ki5-cZbxP1WPA":{"text":"Went here for dessert after lunch at Costera.  I really appreciated the guy behind the cou","useful":1,"cool":1},"T0nlmUCVIYuoRcRMPIX2Bw":{"text":"Incredible ice cream! We live in Oakland and love Fenton's Creamery and this place rivals ","useful":0,"cool":0},"-W9gnRubFmLJ9VihBR96AQ":{"text":"Came here today with my girl for her birthday. Very impressed with the staff's attention a","useful":0,"cool":0},"wBgo5Z0e08d_vbFGeZlRzg":{"text":"Best ice cream ever!!! You must stop here at least once while in Nola. Homemade goodness!!","useful":0,"cool":0},"NMaOUzUoz31h6ZT_rKm34Q":{"text":"Really good ice cream. I wouldn't necessarily call it creamy ice cream.","useful":2,"cool":2},"1rLTyUo-d3aSotjD80bzXw":{"text":"BEST homemade ice cream there is in NOLA. Forget carvel and cold stone or any chain creame","useful":1,"cool":1},"RhG-TN_LdWtanADytcViUw":{"text":"The best ice cream I have ever had. I wish they offered butterscotch toffee more often tha","useful":0,"cool":0},"I2vaPD6gKfy-DUMA-UfEIQ":{"text":"We visited the Creole Creamery and knew immediately that it was going to be a treat due to","useful":0,"cool":0},"ngfDvIUi8l67nnUbu789NQ":{"text":"After a lackluster experience at the less-than-average Camellia grill, we needed a pick-me","useful":1,"cool":1},"wtc9SbT80JiAlODhVePPUg":{"text":"They have some wacky flavors in this place and just their chocolate flavors take up an ent","useful":0,"cool":0},"qK0Muaj6O7gMyah8dy0vDA":{"text":"Fresh ice cream made with fresh ingredients. They have flavors to tantalize both the young","useful":0,"cool":0},"kNuM-WUgq3xJsP4OyB4LZg":{"text":"This is a place with different creative and different flavors. It beats that plain chocola","useful":0,"cool":0},"bDm4pwbzMRxpacfNzBkotA":{"text":"What can I say... I'm obsessed. Creole Creamery has some of the best ice cream in New Orle","useful":1,"cool":1},"Ie1Owuj2VeGLV8MJvii_WA":{"text":"I had high hopes for this place but was somewhat disappointed. First of all they have a bu","useful":2,"cool":0},"Q3LaYieiJJrC_XWbY9mazA":{"text":"OMG! Best. Ice cream! I scream for ice cream in NOLA! Hands down! When traveling to this g","useful":0,"cool":0},"8x-sjqeciUdPEYTpjFMntw":{"text":"Delicious ice cream in unique flavors. The line is long but it moves quickly. It's a great","useful":0,"cool":0},"JB8DXzMNWYkvQaM98xHEdw":{"text":"I SWEAR THIS IS HANDS DOWN THE BEST ICE CREAM SHOP EVER. The environment is so nice and th","useful":0,"cool":0},"8MV1ZWZier_SuHVIfMv8oA":{"text":"Fun flavors with a few vegan options! I was happy to see that masks were mandatory on our ","useful":0,"cool":0},"u1BSvm-0TqJuw6qZhmHCtA":{"text":"I loved this place!  The ice cream was delicious.  Tried the oatmeal cookie soooo good.  A","useful":0,"cool":0},"3Ckni9UjNtoZptXTyCm2OQ":{"text":"Excellent creamery, much needed with the heat in NOLA.  \nJust don't take the avocado-based","useful":2,"cool":2},"5bwneEpLIduTIDuHnsgWCw":{"text":"Cool place with many different flavors that you typically wouldn't find at a typical ice c","useful":0,"cool":0},"yV2XgOHx-oT60klbItdrvA":{"text":"Very, clean and safe for covid. They gently remind customers where to stand, wait etc.  i ","useful":0,"cool":0},"LVk3kaOaeKU0IMSegk7OsA":{"text":"Our all time favorite place for ice cream. This is not anything like Baskin Robbins or Mar","useful":0,"cool":0},"SexRBz0OwH2mow_mVC3_lQ":{"text":"This is a cute, classic looking ice cream parlor. They have a nice flavor selection as wel","useful":0,"cool":0},"rvPJnGrLIEAsP_1kVzDv6w":{"text":"It's ice cream, what's bad about it?! The ice cream is wonderful, I've tried: king cake, d","useful":0,"cool":0},"AFX1Qhs46IPv7zZV_DZGcQ":{"text":"I'll admit that I wasn't blown away at first, I mean, after all it's just ice cream and th","useful":2,"cool":1},"2i6WAFdXy2tA82OAlNm5og":{"text":"This me & my friend's first time here & we loved the Red Velvet ice cream with our waffle ","useful":0,"cool":0},"3f6HKMYvkZEJnp8cQpV5Rg":{"text":"Love this place! Someone once told me to try the lavender honey flavor and I have chosen i","useful":2,"cool":0},"ii8YVhIXtrvvGUm9rGyIvA":{"text":"Wonderful ice cream menu and all flavors had by our party of 5 were delicious! Mango Conco","useful":0,"cool":0},"6fqOOvboJhAmwshTAkl-AQ":{"text":"This is my favorite place for getting some sweets treat. I love their brownies with choice","useful":0,"cool":0},"Up0WxXr9w97HLx13LXEDdQ":{"text":"I have found a new love - the 6-mini-scoop-sampler.  For $5.50, I had Salty Chocolate Almo","useful":4,"cool":4},"-UOh_X_Ky16ic-DIYBaSIA":{"text":"This is the best ice cream place on this planet. I believe they make all their own crazy d","useful":0,"cool":0},"luX1xVNzlC4dqpSuTgYogg":{"text":"Debated between this and a snow cone place, and I'm so happy we picked this one bc they ha","useful":1,"cool":0},"rSkSWsLbNpGUmQ49wvBPHw":{"text":"My boyfriend and I had decided to go to Creole Creamery in Prytania location last night. W","useful":1,"cool":0},"NNlz9YN1hGEZT5nO0CnlbA":{"text":"BEST ICE CREAM IN THE CITY: & about as corny, quirky & cozily Uptown as it gets.","useful":3,"cool":3},"Lgr1XNfuft1NM1E1Su3KVQ":{"text":"Delicious treats!! A must try if you are nearby by one of these locations!!! Will definite","useful":0,"cool":0},"TMp4ZFc-snpgZiqofR5pog":{"text":"The salty tower was this weeks special and it was really worth the cab ride over. Saw this","useful":1,"cool":0},"rTnDgUoCYXb2P89LdmEMmw":{"text":"Fun little place with great ice cream so many flavors to choose from. I got the creole cre","useful":1,"cool":1},"DdV-806PgBVnNpzDA0tL0A":{"text":"My favorite ice cream place EVER! I mean EVER!! You have to come here! It's the most famou","useful":0,"cool":0},"hnlPy68_XHwhTaaFw6qCoQ":{"text":"Delicious ice cream - totally worth the trek from French Quarter! I'm so glad Creole Cream","useful":1,"cool":0},"eFhK965m2Qaqgrf_bwry9Q":{"text":"I just want to move in here and try it all.  Understand that I believe that ice cream is o","useful":3,"cool":1},"6hqtS8TwuEafNb7iClQ6og":{"text":"I came in because I saw it when I was applying for a job across the way. I was so excited ","useful":0,"cool":0},"w6LzMhJqSZTbXmwN6TG5sQ":{"text":"The best dessert place ever! We came here around 9pm and the line was out the door but it ","useful":0,"cool":0},"_fXpgg5CqhkxfN0gK0AbGw":{"text":"This place rocks with funky flavors and ice cream made to perfection. I've held back on wr","useful":0,"cool":0},"5f5peFippyszPIUSUxVQrQ":{"text":"Cookies 'n Cream. Salted Caramel. King Cake Dough. Mexican Hot Chocolate. Lavender Honey. ","useful":0,"cool":0},"W5IV1aqLUqun13GTkk3TXw":{"text":"This is another one of those places I visit so frequently that I have forgotten to review!","useful":0,"cool":0},"UcQF12QUN66YoVeFPtZR7A":{"text":"Try the Skyscraper!\n\nThis is a very good place to stop by for some Southern style love and","useful":25,"cool":24},"WPTrndwJ-_PtBaTcPFHp4Q":{"text":"WONDERFUL!!! i have searched far and wide for lavender ice cream, and they have it! lavend","useful":1,"cool":1},"YEEMIlnvQR8YR5jGDZPNhw":{"text":"This place is great for a late night snack. A true New Orleans ice cream shop that has som","useful":1,"cool":1},"c4YN3vzpbZYA2M5tgEMgWQ":{"text":"This is one of the best Ice cream shops I have ever been too! They have fresh ice cream ac","useful":1,"cool":0},"wgej9a0n4beztKL5zVbkvg":{"text":"After a hot day this was a great treat to bring the kids to. It's a cute little ice cream ","useful":0,"cool":0},"xVFwy62uEqoGQ1SOxeNHbQ":{"text":"This place is the picture perfect small town ice cream shop. They had a ton of flavors - b","useful":1,"cool":1},"NCwPjF6IiPOx4HZ04gFs8g":{"text":"Good. I wouldn't say it was outstanding, but it was good enough to satisfy my ice cream ha","useful":0,"cool":0},"lgipdHGc85Sl2aVE4us41A":{"text":"Really loved the ice cream at this place, the kids (teenage employees ) can get overwhelme","useful":1,"cool":1},"i6RrQADG5Q_SwVMQvylllw":{"text":"After an afternoon spent in the sculpture garden at City Park this ice cream hit the spot.","useful":4,"cool":4},"-tcQjonJhn_tKQwKsWxyBw":{"text":"This place is my favorite. It's got an old feel soda shop when you walk inside. Cash only!","useful":2,"cool":1},"Ag6jaAt5rKLEPVZ4iv14LQ":{"text":"They had so many unique flavors to try. I can never make ice cream decisions so this place","useful":2,"cool":2},"57-eri8PaRkq0gxbHI2afg":{"text":"Creole Creamery has a huge variety of really cool, interesting flavors; you'll want to try","useful":1,"cool":0},"MtFKZX3nKsM7OptuSqtkFg":{"text":"Creole Creamery is definitely one of my favorite dessert places in New Orleans. Its Uptown","useful":2,"cool":0},"Fvp7uwwmfRqI7noBpPaCsA":{"text":"No samples right now because of COVID, but the staff is great at explaining the taste of e","useful":1,"cool":1},"ghIsvstz_6gEc4u8SDrokw":{"text":"One of my favorite ice cream shops in New Orleans. If you haven't been you should put it o","useful":0,"cool":0},"vupER2q0uHB83WyEwFL1ng":{"text":"Can I give them six stars? The Mexican Hot Chocolate is beyond amazing. Be prepared for lo","useful":0,"cool":0},"F4ObHULcHoebYIYfQN8eCw":{"text":"never had a flavor I didn't love..  sundae's are awesome n cones are great too!","useful":1,"cool":1},"3-k059wqL8YEz7PSwawctw":{"text":"My favorite ice cream!! Unique flavors that taste amazing!\nThe shop is cash only but you w","useful":0,"cool":0},"QzlMvdrx2MdAGFT_MCcXdQ":{"text":"So many incredible flavors!! I love ice cream, and the choices here always make it so hard","useful":1,"cool":0},"wNpz2eaQrNK_iKZ1dQe5Qw":{"text":"Had to check this place out after seeing it on Man vs. Food. Their ice cream flavors are c","useful":1,"cool":0},"S3s1wyWFiJ4ORVb5l335vA":{"text":"NOLA's best ice cream parlor period!  They have two other locations in Metairie and Lakevi","useful":3,"cool":4},"dE_GTBTIMhJlNFL308nNyA":{"text":"This place is bomb!! If you're craving some good and too sweet ice cream with awesome flav","useful":3,"cool":1},"AsF5Gbm79y2_xocf4XZNSg":{"text":"I get it, it's a spin on ice cream. It's decent, it's not great. If people visit I'm not t","useful":1,"cool":0},"KlDsdPJ7KUmBrrej5cOUgw":{"text":"You know how when you try ice cream flavors it usually takes a couple of samples before yo","useful":2,"cool":3},"ih2sOIg3gejPGa2LSg4fsw":{"text":"I fell for the hype. I'm a big fan of unusual ice cream flavors, and this place advertised","useful":2,"cool":2},"K1G9j5vGAT7lCrcR2_Sh1g":{"text":"I've been to 24 countries on 5 continents and 47 states.  This place has the best ice crea","useful":4,"cool":2},"Qr3yjUCp8qgfwYIl439MsQ":{"text":"This is what I save my calories for! I'm in love with the chocolate amaretto cheesecake ic","useful":1,"cool":0},"RPcuGkxAHwZVgHZJpSYjSQ":{"text":"I had a double scoop on a waffle cone. I have had premium ice cream and this place is not ","useful":0,"cool":0},"TlmNRYEV5g3v2UQAoak9Jw":{"text":"Not too expensive ice cream on a warm NOLA day that's wonderful to share on a date! We ord","useful":1,"cool":0},"nvsYqa-T55t0ddMIWgp9Kw":{"text":"If you're back in your home state for the holiday break, why not go to a local ice cream s","useful":3,"cool":2},"s8rAKnCkyzDernivjhkxYg":{"text":"There are not many places I frequent in New Orleans, but this is one. I have not come acro","useful":0,"cool":0},"F21r90UbguPlAhfThOrfUA":{"text":"Amazing ice cream, Cafe au lait is a coffee lovers dream. The sampler is the best thing fo","useful":0,"cool":0},"stJQbsDFz0cwY8H-wbYTyg":{"text":"This place is a 15 minute drive from the central buisness district but well with the drive","useful":0,"cool":0},"xL3exAWubVcvAr_8uQGPyQ":{"text":"Whenever traveling, I like to try things that you could only find within that particular a","useful":1,"cool":1},"KnhPbZVvKhHHXfh6MxEiWg":{"text":"I saw creole creamery on \"Diners, drive ins and dives\", and even though i think the host i","useful":0,"cool":0},"A8judMD2T8HEmp25cGt5Kw":{"text":"Delicious, delicious, delicious! The Red Velvet ice cream was amazing, I loved the locatio","useful":0,"cool":0},"aoUJtKTrXJD4ms89FV1c0A":{"text":"I was always willing to withdraw cash to get my Creole Creamery fix; however, they now acc","useful":20,"cool":18},"SKm5HtQ5wakcCiGu1pEkfg":{"text":"It's an ice cream shop that has a range of regular to exotic flavors of ice cream. They ev","useful":2,"cool":1},"PjO3SoZAdEjbdnmIIp0HbQ":{"text":"O. M. G. \nI can't even describe how wonderful this ice cream is. Of course, who doesn't lo","useful":0,"cool":0},"UejAEXXveHR62HjQSStYUw":{"text":"Ice cream was delicious! Staff was good. Bathrooms were  dirty. The ice cream was deliciou","useful":0,"cool":1},"Ie7KURk8trllQsrrLSAkzA":{"text":"Tried a few of their ice cream flavors including the king cake (just like eating an actual","useful":1,"cool":1},"m4YyHRAF_qMy2M-RaY-f1A":{"text":"Was craving ice cream after brunch and yelped this place for a quick scoop. Walking in, it","useful":1,"cool":1},"6GIShSVfmNqu8KSVswFE7w":{"text":"Always delicious ice cream and tons of flavors. Love the sampler minis to get lots of flav","useful":0,"cool":0},"dV9Njf0veF0QB1mfnY9I5g":{"text":"Oh this place is good! I go here at least twice a month. Doesn't seem like a lot of times,","useful":0,"cool":0},"5CS3DU9dSOnmwHcok9_qLA":{"text":"Creole Creamery is definitely one of my favorite ice cream places in the city. I like the ","useful":2,"cool":2},"Y0qd2Xn6MIYQ43A10dWnvw":{"text":"BEST ICE CREAM!\nThe best ice cream I have ever had!\nI ordered the brownie Sunday and it wa","useful":1,"cool":0},"WodyUPtskXyIl7Wl2kryVA":{"text":"Friendly staff and amazing ice cream! So many different flavors. One of the best scoops I'","useful":0,"cool":0},"I4MiMSCPOpXDHcrZUe2nzQ":{"text":"Honestly, i wish i could give this place ZERO stars. The staff is extremely rude, and don'","useful":0,"cool":0},"9LM1mivvdYFLYzS2XTFBYg":{"text":"I am not a huge ice cream person and this place has won me over! The best ice cream you'll","useful":0,"cool":0},"6gNGHj8zxtkP7jNh9ffFDQ":{"text":"A New Orleans classic!  I am OBSESSED with any and all ice cream and Creole Creamery is on","useful":1,"cool":0},"TZM06PA_JhgoTOysLK2GJg":{"text":"The best ice cream in town! Enjoyed a great company dessert bar and creole creamery's Sund","useful":1,"cool":0},"6r2e1eakAq94_5COG58CyQ":{"text":"The good ole Creole Creamery. I love this place very much and it is the cutest little spot","useful":0,"cool":0},"jhcYLPSiwk3i4tDA6oDbZA":{"text":"My dad has been bugging me to try Creole Creamery for awhile, because he heard great thing","useful":0,"cool":0},"qP5O_dqxVvoJ5qs8t0p5rg":{"text":"I have so many emotions running through me at once-  I'll have to break them down. \n\nSad: ","useful":4,"cool":3},"BZcJod9e-koTuBLKaWrrcg":{"text":"There's nothing I can say about Creole Creamery that hasn't already been said. They are op","useful":2,"cool":2},"VoGMz6LMdEfxe4OINc9FCw":{"text":"I'm  all in on Creole Creamery! My wife & I went here with friends and were impressed by t","useful":0,"cool":0},"WIp9TuLYd-7ASJskSVC7Og":{"text":"Creole Creamery was a fun little ice cream shop; but, due to covid, it's just a regular, n","useful":0,"cool":0},"bcnrRdYortj44v7jMryWow":{"text":"On our NOLA stay I knew I had to try out a local ice cream spot and Creole happened to be ","useful":1,"cool":1},"BCwiWfHY47SxHYRZY8Y82g":{"text":"Oh, Creole Creamery...I love your ice cream so much! I took my wife for her first-ever exp","useful":1,"cool":0},"3RgbZMOzHQwAofEX2BuVow":{"text":"delightful.  and yummy.  old school ice cream parlor.","useful":0,"cool":0},"M3w2qSxsjTIBACDdvXktDw":{"text":"Cute place, inventive flavors, but unfortunately the ice cream is below average. You can g","useful":0,"cool":0},"TFcGfJLenICNZXxYYztmQA":{"text":"We were so excited to find this place. The sampler was a great idea and the perfect way to","useful":0,"cool":0},"hd2BWcZtM66olfd4SmtLLw":{"text":"This is one of those places that make me feel like there's something wrong with me for not","useful":4,"cool":3},"nzfKDDg_2nWwLYZBsl0SZg":{"text":"I'm not sure if Creole Creamery needs reviews, lol, but it's basically just some delicious","useful":1,"cool":1},"G3MiUdSwji2j_XvL1Tcz2w":{"text":"The ice cream was overhyped, the place was very busy and the line was so long. I hoped the","useful":0,"cool":0},"9Oj7E3UsBqdql6u3E_Mfdw":{"text":"My family decided to stop here for a treat. Their flavors are usually always a hit. I got ","useful":0,"cool":0},"g-Afx-YsBbI4GHzk-fe09g":{"text":"My constant craving of Ice-cream always leads me back to Creole Creamery. I tend to go to ","useful":7,"cool":3},"mUN3gElhsY9gQO57T6a-7g":{"text":"**EAT ICE CREAM. BE HAPPY.**\n\nI didn't come to New Orleans to lose weight,\nso I ordered a ","useful":28,"cool":27},"KewYaJ6aKXsGf7O6HO6rwA":{"text":"Came for a late night treat. I've tried Creole Creamery before but this was my first time ","useful":0,"cool":0},"NX3M2eDcfEqVBHKRR0duSQ":{"text":"Wow, this was some good ice cream. Had a few samples and decided that we wanted everything","useful":0,"cool":0},"RhDIsQSd2uRKQfB_W5C4tw":{"text":"Wow!! Soooo good! I got the cashew butter ice cream with chocolate chips and my boyfriend ","useful":0,"cool":0},"7tAhD3YM6ZfXsYRq36p-eQ":{"text":"Omg! Omg! What can I say.... White Chocolate Truffled Popcorn Ice Cream!!!! What a delicio","useful":5,"cool":6},"vStop6Deda1RLAtsnlOY0w":{"text":"Love love love. We stopped at Creole Creamery after eating our po boys tonight because...w","useful":1,"cool":0},"1db5EiePxwHfkSY0TP6ueg":{"text":"I love ice cream.  It may be my favorite food.  Whenever I can find a good local, homemade","useful":3,"cool":3},"0nMxl1TRgK9BkHuvTUeQsg":{"text":"I went with my friends for my birthday to grab some ice cream. Before that point, I had ne","useful":0,"cool":0},"RPRmRGbP8RyRzTHpHpX7Lg":{"text":"Mannn, their seasonal ice cream is always SO good!!! Love their BLUEBERRY PIE and UBE flav","useful":1,"cool":1},"cSeS8sSDA7n9JW7k-OnEnw":{"text":"I was going to attempt the Tchoupitoulas Challenge...then I took an arrow to the knee.\n\nI ","useful":2,"cool":1},"Ufc_zx99ZdAW96l8_xb4Sw":{"text":"Summer 2013-The best Ice cream parlor I've been too.. I had a lavender honey, light & crea","useful":0,"cool":0},"skzMtwF3NjdA6DqmEQ6rdA":{"text":"We went around 8pm on a Thursday. The line wasn't too long, but by the time we left it was","useful":0,"cool":0},"HmomKlvZgArbRDwG_VufIQ":{"text":"The three stars are for the awesome and creative flavors. The down side is the fact that t","useful":1,"cool":0},"DwzvoNTwCPUtwFu-Gz0KlQ":{"text":"Love the variety of the flavor cheap as well. If you never tried the saints gold you shoul","useful":0,"cool":0},"74gFk92YwtNBGt1e_kXthQ":{"text":"Honey lavender, FTW! All their flavors are interesting. Cookie Monster is a second favorit","useful":0,"cool":1},"mur13mBCbZ0ctbRQqNaoKA":{"text":"Can have long lines but they keep it going pretty fast. Lots of flavors. The creole cream ","useful":1,"cool":2},"9a4sHsp3e4qUxycXy5DEKA":{"text":"Food: 50/50\nService: 25/25\nAmbience: 25/25\nTotal: 100/100\n\nBest strawberry icecream I've h","useful":0,"cool":1},"FQqBzdVQcJBfsz8MjgHIpg":{"text":"Oh my gosh!\n\nThis place was *amazing.*\n\nI come from Santa Cruz California, a lovely town t","useful":0,"cool":0},"vMPyJFieLdtzYAWdSALXZQ":{"text":"DELICIOUS! Inventive flavors (like lichi and green tea) and indulgent stand-bys (like pean","useful":0,"cool":0},"0pcikeL2eV8x3OckgRWf6w":{"text":"** CASH ONLY **\n\nOne of my friends recommended this place when I was travelling in NOLA an","useful":5,"cool":3},"BHTJMsmTSdeGmEf5g-ZPFQ":{"text":"I am upset with Creole. This used to be my favorite place but they just changed the size o","useful":1,"cool":0},"qtCP_KEX3Awv1Xz_3Z9aMA":{"text":"Love this place!!! I visit quite frequently since I live only a few minutes away. It's the","useful":1,"cool":1},"s2YkosD6aD2lRwfSefsWYQ":{"text":"In a town known more for snowballs than ice cream this place sets the mark for really terr","useful":0,"cool":0},"V9ueEqZhawrxWBSP1g61rA":{"text":"My national ice cream tour continues ... \n\nYUM. Lots of original flavors, including one ca","useful":0,"cool":0},"8TWHtJ5-lawPCeSpsuxsHA":{"text":"They had an amazing selection of ice cream. On top of that, they have ice cream and soda f","useful":0,"cool":0},"pwysBH_XDOP_wiZgbQQW0g":{"text":"Such a cute little ice cream shop. Lots of different flavors that I have never even heard ","useful":2,"cool":2},"1ruNZes53_OhxgLioaINXQ":{"text":"They only take cash. They were super busy and only two people working on New Years evening","useful":0,"cool":0},"3JxBeV1yI6N33a_wptx8mg":{"text":"A New Orleans classic. Always has unique flavor options as well as classic options, such a","useful":0,"cool":0},"DpoZbW1Ea5cVGipn9U3PKA":{"text":"I didn't have any room for dessert after a fabulous dinner, but we walked to the Creole Cr","useful":0,"cool":0},"cc0EB5sJ7ebxKEFL4FHMRQ":{"text":"I had this about a week ago and I'm still thinking about it. We shared the mini 7 scoop sa","useful":0,"cool":0},"oY-QB4-15I0GAj81DRuG5A":{"text":"This is absolutely the best ice cream, I was only here for the weekend, but we ended up go","useful":0,"cool":0},"ZPY2VEnEjv1fR3_mN8713w":{"text":"If you're in the New Orleans area, Creole Creamery is the place to go for the best ice cre","useful":0,"cool":0},"cwO-8Sd8ntHV2td-tKaGVg":{"text":"I guess coming from Ohio where we have Jeni's ice cream I've been spoiled. You can get it ","useful":0,"cool":0},"CRqEhMgjTeKsnaeAnN9NQQ":{"text":"To say I loved this place was an understatement. My favorite part of this ice creamery is ","useful":0,"cool":0},"SAPrmkEYXN5C_rd93D0Qdw":{"text":"They open late!!!! \nAnd they make their own ice cream! Always have different flavors every","useful":1,"cool":0},"71LRWblSy7UnjIGa2I35Mg":{"text":"Not the best ice cream I've ever had, but not bad either.  They have some funky flavors wh","useful":0,"cool":0},"A0vxTbs9_M4pfPh6KnHlhQ":{"text":"Yum! \n\nFound this spot on yelp and my girlfriend use to love coming here during her underg","useful":0,"cool":0},"C-lBzQcaIiy7wowIZphsfA":{"text":"Such a cute location for an ice cream shop in New Orleans and the most incredible flavors.","useful":0,"cool":0},"Gc_NTbFc4Oa2b4ALvZzzzg":{"text":"Amazing ice cream!! Lavender Honey, black and gold crunch, salted caramel, creaole cheese!","useful":1,"cool":1},"h_hB4i4pWo1KKsOHGVNBvg":{"text":"Unique and tasty ice cream flavors. \n\nThis funky little ice cream shop offers a wide varie","useful":0,"cool":0},"xwZtlUty1atGnYf9BGyR_A":{"text":"A visit to the Creole Creamery is a must on any trip to New Orleans.  It serves some uniqu","useful":2,"cool":2},"AO0U7YXEuWo_p27L8Xbazg":{"text":"Ah-mazing! \n\nWe're big on ice cream and this place was pretty incredible. The flavors aren","useful":0,"cool":0},"wYiQybC9LPaEmcoWO6AbOw":{"text":"Never have experienced such unique flavors! Creative, perfectly crafted and curated. A mus","useful":0,"cool":0},"zSN6iyjBl0izbG-GCDFCnQ":{"text":"Glad I got to stop by here during my trip to NOLA. It's in the Uptown district, a perfect ","useful":0,"cool":1},"PA_TRQewyybence5UNPz5w":{"text":"Honestly some of the best ice cream I have ever had! It was so creamy and the flavors were","useful":0,"cool":0},"Tr1OEyT99kbmPEUMKYmtNA":{"text":"It's way off the beaten path, and you need to take the St. Charles line a few notches down","useful":0,"cool":0},"9bjDeM2gIFkozymCaGornA":{"text":"Nice end to the evening! Their motto: \"Eat ice cream. Be happy\" defines the overall atmosp","useful":0,"cool":0},"3NttOvDfjaat5J6m5ERAxA":{"text":"I feel like there are so many \"5 \" reviews for Creole that I've hesitated to write my own.","useful":0,"cool":1},"kDXlM-o9uQsPl_2jW_t6ew":{"text":"I was a little disappointed by Creole Creamery. Maybe it is the best place for ice cream i","useful":1,"cool":0},"PMhh4zO9R02lNuo4t0UzLw":{"text":"There's not much more that I can say that hasn't been said in other reviews already. Drove","useful":0,"cool":0},"h4y9yfmoNYjiOggLhNdmzg":{"text":"Ice cream so good there is a line around the block to get it at 9pm on a Sunday night. PLE","useful":0,"cool":0},"RsF_eoqwjHDWrn2ve6bf0w":{"text":"So good! And they had some dairy free/vegan options, which is great! Got ourselves some bi","useful":0,"cool":0},"m-aESj_rJ2eGdwRnZQt_mw":{"text":"Usually I prefer creole creamy over any other ice cream shop. However, my last visit here ","useful":0,"cool":0},"u3FQc2IngVRgsZGA1fxdeg":{"text":"Why 5 stars? Because the salted caramel is world class.\n\n   ---   ---   ---\n\nI am still ki","useful":7,"cool":3},"bj8aH4PEgFEy2kPCqSMTyQ":{"text":"Creole Creamery serves house-made ice cream in New Orleans flavors and style.   \n\nThe flav","useful":3,"cool":1},"wJnOrn0FEOQMddP_VyzMtA":{"text":"In New Orleans, Creole Creamery is often the first place people think of when they want an","useful":2,"cool":0},"ey45npz8sOqnWhVcccsJXQ":{"text":"We absolutely enjoyed our visit to the Creole Creamery. First off --- yummmm! All flavors ","useful":1,"cool":1},"WNvfzsxl6xIgiJgczQsAUw":{"text":"I try to be healthy.\n\nHonestly.\n\nI eat whole grains (I even ate quinoa for breakfast today","useful":2,"cool":2},"2g8-6LXAsHyr3vvlMgH-Zg":{"text":"Huge selection of exotic flavors of ice creams! Very creamy and smooth. I enjoyed all the ","useful":0,"cool":0},"hwP9j6NGnW-nOKaXxQs3BQ":{"text":"When here over the weekend and we absolutely loved their selection is awesome ice cream an","useful":1,"cool":0},"BXNq4Joybd9qXwAZzMJXqQ":{"text":"I am surprised I have not written a review for this place. I have been quite a few times. ","useful":0,"cool":0},"3zH6ghU7dAU3I80byjb5yw":{"text":"Went a random local ice-cream place b/c my friend wanted sweet\n\nFOOD//\nThere were so many ","useful":1,"cool":0},"3i79HPwZfOlWpd1_wqdk0Q":{"text":"I had the lavender ice cream here and it was pretty amazing. It's creamy and it tastes rea","useful":0,"cool":0},"Fo7oYHMHLVSja1jk7sYm7A":{"text":"I really enjoy their ice cream! I LOVE the assortment of flavors! One of their chocolate o","useful":1,"cool":0},"buKNbweUTBKT5pOp8-m8uw":{"text":"I've been to Creole Creamery three times in the seven short weeks that I've lived in New O","useful":2,"cool":2},"GppqbuJNzYaz6pclGZ5P7g":{"text":"What more could you want from a local ice cream shop than what this place offers? They hav","useful":0,"cool":0},"e4_FZvxBgZy1BiGfdOBaSw":{"text":"Get in mah belly!!! \n\nSeriously, this place is bananas! The flavors they've here is unlike","useful":3,"cool":2},"WBvWZ1wyhycmU-vb6ZtQnA":{"text":"\"TREAT YOURSELF!\" Whether you are looking for a late-night sweet treat or If you are looki","useful":2,"cool":1},"T_KP2Y7kUJy_1OMxgQTHiw":{"text":"This place is heaven.\n\nCame to NOLA in August 2012 and Creole Creamery was one of our dest","useful":5,"cool":5},"da8UtJCeMcF3u0t4gvx-tg":{"text":"Definitely one of the better ice cream spots in town! So many flavors to choose from, and ","useful":0,"cool":0},"o4Hz7fKSh95sPJVGS2P4yQ":{"text":"Ok, here's the deal, like many Asians, I am lactose intolerant. If I weren't so stubborn I","useful":11,"cool":7},"1RHT70ge7vQ4rSTxSwfw0Q":{"text":"Various ice cream flavors available! I wanted to try all of it, but I didn't want to give ","useful":1,"cool":0},"HUuqX1F593bV91HVuILXDQ":{"text":"I don't think I need to explain how much I love creole. The amount of times I've been in t","useful":2,"cool":1},"0oVw8JFK5oJTQqNUKR_GIw":{"text":"Cash only! And worth every penny.\n\nCreole Creamery offers a TON of creative flavors and co","useful":17,"cool":9},"ZPzQO8FRqX0mGVqP8YVY8g":{"text":"Had a tasty dessert this evening. Tried the Creole Strawberry sundae that was full of cake","useful":1,"cool":0},"Mr6e-m4vshUSIGvL4o1MXw":{"text":"A must-try when making a trip to NOLA! We love the flavors, and always make it a goal to t","useful":1,"cool":1},"RmQEosnwwr1nSHhFlDjx0A":{"text":"One of many reasons to LOVE new orleans. I went here on a Saturday night went some friends","useful":0,"cool":0},"rzwc6EMjnDJkZIkgZOiBXA":{"text":"My go-to ice cream place. They have a variety of flavors and even sugar free options. I do","useful":1,"cool":0},"zmGNDcuIUvrynL0K-ZYOlA":{"text":"So much good food in New Orleans but please leave room for dessert and head to this gem on","useful":0,"cool":1},"4aE9C32kZ8I-PNRDkU1euQ":{"text":"what can we say that hasn't already been said?  If you want to experience the best ice cre","useful":4,"cool":2},"bcezNt0ooYzmG8cNUn6bww":{"text":"Amazing ice cream. The ice cream here is creamy, rich, yet not overly sweet like other pla","useful":2,"cool":1},"Zv2FcAb49yiknIR1gDvmfw":{"text":"Holy Yum!! LOVE LOVE LOVE the ice cream here!!!\n\nI had Lavender and Honey and a Coffee Bri","useful":1,"cool":1},"ATreEoefM38idf4wM7244g":{"text":"This is a New Orleans favorite!!! They have super unique flavors that they switch up often","useful":1,"cool":0},"MTrQNscBxWJ4i7kvDe46dg":{"text":"This place always has a line or people in the store. I went one time and decided on their ","useful":2,"cool":1},"GyuoEMSvQAEuHJAVOhFVHQ":{"text":"The best ice cream you'll ever have. I would give it 100/5 if possible!!! They are very go","useful":0,"cool":1},"rTqSM3r8eSdHSXt14-cYyg":{"text":"Best ice cream in New Orleans. Rich, creamy, great flavors. Gets crowded at night in the s","useful":1,"cool":0},"M3M24mu70AoL03ctbobGWg":{"text":"The ice cream and their selections are amazing. I just wish they would have actual real nu","useful":0,"cool":0},"0VX4MKdI33KMjRTD7q1kbA":{"text":"Been craving for their lavender flavor ice cream so we head over here after our brunch. I ","useful":0,"cool":0},"ahCR88Jyi_YMxL2q-Dbmpw":{"text":"Waited in line 20 minutes only to find out they were cash only. Pretty lame. Also telling ","useful":0,"cool":1},"QPAEh7x8-owrW1Y6UFRHvA":{"text":"Best non dairy ice cream I ever had, they also have regular ice cream. It's really hard to","useful":4,"cool":3},"eL6gQ8BpC2mzdlQM3Opv_A":{"text":"One of my new favorite places. I love their honeydew pandan and coconut sorbet. So many un","useful":1,"cool":0},"dRJP6pf7eoZC9uZg0S25QA":{"text":"Ice cream really does make everything better! Ice cream and sorbets are made fresh daily. ","useful":1,"cool":0},"UTSUyl-F9OihAo3mEocs3w":{"text":"AMAZING as always! (flavors: dessert at tiffany's and bitter sweet chocolate torte) The li","useful":1,"cool":0},"WlJdcAS1ANfPdvUYFUJQgQ":{"text":"This is probably the Creole Creamery location that most people think of when you mention t","useful":0,"cool":1},"BepdNqk-xW49aa9c7QsqVA":{"text":"First time going.  My son lives close by and tells us how good it is.  I had the lavender ","useful":0,"cool":0},"42UWKyGSAPr__CKb1AbBcA":{"text":"Creole Creamery is such a local gem! I was here visiting and this may be one of the best c","useful":0,"cool":0},"HYySSwvQxTIJXV8UR8RXaw":{"text":"Great milkshake. It was a long line but moved quickly. Good selection. Great service.","useful":1,"cool":1},"wkBDVldFHXqlHtrL4k3QAA":{"text":"This is hands down some of the best ice cream you will ever have. It is made fresh in shop","useful":1,"cool":0},"WJerGo61UI93Re55tbLMjA":{"text":"I never knew that this is the way REAL ice cream tasted!\nCASH ONLY ;)","useful":0,"cool":0},"4LaUcE0YrS1pDJQ_iqQDcA":{"text":"This is a wonderful local ice-cream shop with sooo many flavors, some of which are rotatin","useful":1,"cool":1},"wAnuSm4Hg0LOpbeuUjnLUQ":{"text":"I wish I could give this place a million stars! The best ice cream, yall! If you are in to","useful":0,"cool":0},"j5JyytiX53zpJhOznHtrpA":{"text":"Delicious creamy ice cream not too sweet not too hard not too soft, it's just right! We ha","useful":0,"cool":0},"KI4DHdWhc6ciC3Q5DExmzw":{"text":"The ice cream is great and is in a nice area where there other good restaurants including ","useful":2,"cool":1},"N8cU3feP_rfBwEw-dTbbSA":{"text":"After a VERY long day, I went for three scoops (even the employees asked me if I was sure ","useful":2,"cool":0},"UkVNbsI0WqdzhAkVcGtoAA":{"text":"Let's me start by saying, I love ice cream.   Love, love, love ice cream. \n\nSo it's after ","useful":6,"cool":4},"beX47eHtVC4ixnPeirA4GQ":{"text":"They are the creamiest of ice creams. The staff is Covid safe. They get a long line but it","useful":0,"cool":0},"WvURxKa-kvHGvwV7Y7zYFw":{"text":"Nom nom. I'm not sure why New Orleans doesn't have more ice cream places given the year ro","useful":2,"cool":2},"WWvdsg8-c4s-6TOlejdQ6A":{"text":"I decided to come here with my mother and daughter for a sweet treat. This place has an as","useful":0,"cool":0},"drIr9NX2eBjI7g-L_EMXkQ":{"text":"They didn't have butter pecan, but the did have raspberry sorbet!!!  Delicious. Great serv","useful":0,"cool":0},"pWwpcBXNyz5SCtWKb8hiPw":{"text":"What a great ice cream place in NOLA! We came here for a treat on our first day here and a","useful":1,"cool":0},"i9WzpYJLSKEc860o1MEYzA":{"text":"So good! Rarely do I find ice cream that is worth a review. I got the fudge sundae and red","useful":0,"cool":0},"PD5DxemGyY7rr7AhBzjZ4A":{"text":"This New Orleans staple is located on Prytania Street. The streets is filled with local sh","useful":0,"cool":1},"Zne60LL1U3Z-NMrC2NBfBA":{"text":"This place is excellent! The servers seem to love their job and up beat and helpful. They ","useful":0,"cool":0},"QmKGONZFeXNC2WHaa53Wpg":{"text":"Not sure why it took me six months to get in here (maybe will-power?), but I'll be back, o","useful":1,"cool":0},"v0nue83S9h5VwrgBASEN5g":{"text":"Got a double scoop of bananas foster and cookie monster in a waffle cone. Plenty of chunky","useful":2,"cool":0},"mwe08hhBF58sR6-cHmTJWg":{"text":"This place is a New Orleans must experience. One of a kind ice cream choices you cannot fi","useful":0,"cool":0},"c_cCtE489kpNLE7IaYu4wA":{"text":"Super yummy and the trio flavors we got were awesome. The cashier even suggested we get th","useful":0,"cool":0},"XxvTj780s0bAStVkivB6Eg":{"text":"Am I the only one who can't decide on an ice cream flavor and feel immense pressure when h","useful":0,"cool":0},"yEP_Yqcb_yt0mVwMLLsh8Q":{"text":"Ice cream was OK but the service was horrible! Lady didn't speak when my mother and I came","useful":1,"cool":0},"I8Aj1CJE89VWbpIJz8eN-Q":{"text":"Who could give this place less than 5 stars?  I wish I could give it 10.  This ice cream i","useful":0,"cool":0},"KLxoe4DcLZWE3unEmLcLuw":{"text":"The Christmas cookie ice cream is to die for. Such a delicious selection of flavors and I ","useful":0,"cool":0},"7tw4-Me_NTZYO7tIVRUkYw":{"text":"A delicious ice cream spot in NOLA! we took the streetcar down St. Charles and walked the ","useful":1,"cool":1},"cuxF7t_6C_f_NfhWIdHm9w":{"text":"Awesome awesome awesome!!!!  Have been here many of times and have enjoyed it every time. ","useful":1,"cool":0},"CzRrEkpZc2629By6E78nGg":{"text":"The hype is real. Seriously the best ice cream I've ever had. It's so creamy and the flavo","useful":1,"cool":1},"gpgLXe6JaVN0J0YngU2w_Q":{"text":"A word of caution: don't come here if you're a generally indecisive person.  After picking","useful":5,"cool":2},"Y4LuArGjk2owpta8xTHneQ":{"text":"It was a cool night in New Orleans and I set up the night so we had an early dinner in ord","useful":1,"cool":0},"JbCLP49FmjsD8Ns4lT6LPw":{"text":"I scream, you scream, we all scream for ice cream! Love this place! Went here on a nice Su","useful":0,"cool":0},"GtOB3hP8Hw8xGtoWg-hPrg":{"text":"This is my new favorite ice cream parlor. My husband had a yummy peanut butter parfait typ","useful":6,"cool":4},"rsqVURtcOeHIgg9MSaKekA":{"text":"What good times.  They have some...\"interesting\" flavors.  They trick you into believing o","useful":0,"cool":0},"jx92CsGnHJrpFPggcXVi4A":{"text":"Best ice cream in NOLA and fun experimental flavors that change. Worth the high price for ","useful":0,"cool":0},"yDRrapD8EUsY_uU8Sjgg6g":{"text":"So excellent. I've had some pretty fantastic ice cream, Mc'Connells in Santa Barbara, Mitc","useful":0,"cool":0},"8e7IvQ6ZDOoUsivIydVb6g":{"text":"The ice cream at Creole Creamery is really rich and creamy. For me, almost overwhelmingly ","useful":1,"cool":0},"7yyFy4SSwh2A9Bl6Ffe4LA":{"text":"Love the Creole Creamery! Everything we had was wonderful! We'll definitely be back! It's ","useful":0,"cool":0},"rPYK9qYS3BO841s9vuXjBQ":{"text":"A great ice cream shop featuring delicious homemade ice cream in a large assortment of adv","useful":1,"cool":1},"wr61KL96Eb1eGgni4AIC6A":{"text":"Creole creamery rescued the day. After a couple of salty tacos I was looking for something","useful":3,"cool":4},"zkRv_2KCnjMrmnwSu5LNKA":{"text":"One of the best ice cream places around. We loved all the different flavors, and the peopl","useful":0,"cool":0},"cz3tmYVnnr5trU9lb9tl4w":{"text":"Biggest complaint; cash only. Sooo customer unfriendly. Why push the $3 ATM fee on me to a","useful":1,"cool":0},"TzhDr71TyUhfFb6kwGD1AA":{"text":"Yummy flavors that are not run of the mill--at least not for this midwestern girl. The ser","useful":0,"cool":0},"h-IB5pViOL0SZNc2ldmJNQ":{"text":"Very tasty ice cream from a locally-owned business. I had the creole cream cheese ice crea","useful":0,"cool":0},"K3-m4xTMdosAfM8y8BLf4A":{"text":"**CASH ONLY!**\nJust came here for the first time and I already know that this will quickly","useful":1,"cool":2},"u2oVqkBbWVw7X02toxcrhw":{"text":"The place has the best banana split I have ever tasted.  They use fresh strawberries and p","useful":0,"cool":0},"n-o8FCCDEwAGUl6zbQma_g":{"text":"A new found favorite of mine. Not many ice cream shops makes malts anymore for whatever re","useful":0,"cool":0},"fD-hNe3guh2nTiqijSZgfw":{"text":"I love the unique flavors that this place comes up with! You can order baby scoops of 4 or","useful":11,"cool":5},"qLCfJGl2bjcBumiUAc8EDA":{"text":"This ice cream paradise gets 5 stars from me for so many reasons. Most importantly what yo","useful":2,"cool":2},"rW-9zLE9TdoUI1XL9fhFcw":{"text":"On the weekends this place is busy busy busy. I love it here. I have gone by myself a few ","useful":0,"cool":0},"ZyNKrFEPRqHvqYxQnd-H5A":{"text":"This place is ahhhhmaazing. My friend took us here while we were in town, and it was by fa","useful":0,"cool":1},"4nxWIDU_rue3WCbrIweOyg":{"text":"I suppose I get to be the fly in the punch bowl on my review here, but I like to tell it h","useful":10,"cool":5},"FCf0DSWrXvU_4KQLLc6zpg":{"text":"This is my favorite ice cream shop in New Orleans! They have such a variety of flavors wit","useful":2,"cool":0},"s9DD-IkKVH1d692jyYufNA":{"text":"YUM! This place is amazing! It's cash only, so make sure to bring some. Inside you can vie","useful":3,"cool":2}}