{"Bay4m4pdurbk3m4rs_2Niw":{"text":"I fell in love with this boutique the second I walked in. There were so many great pieces ","useful":0,"cool":0},"53XCsN0kNNTwCXl3LFVpRQ":{"text":"Maybe I'm not twenty anymore but this place encouraged me to try on a smashing dress, for ","useful":1,"cool":3},"Qgb-gjOWEnSt1TLtD8vXFw":{"text":"Lost and Found is a cool women's clothing and accessories store. I wandered in looking for","useful":2,"cool":2},"-nn3D6Ma_aovz6hFT2y5JQ":{"text":"Great selection of vintage jewelry, accessories, and handbags! Adorable dresses with quirk","useful":0,"cool":0},"zjc4uSzhvtTsARXWlz5GMQ":{"text":"This little treasure trove stocks affordable and refreshing fashions as well as an excelle","useful":0,"cool":0},"9jEqqPfI-6azvU1_p6J7ag":{"text":"The store was great - they had some nice dresses out front that made me make my way inside","useful":4,"cool":4},"7VWtHTs9w-UrvdsB_q9zEQ":{"text":"I was looking for a cite spot with one of a kind clothing and beautiful things. I'm so gla","useful":0,"cool":0},"ylOSEwjSRFUVAsJ51LaX6Q":{"text":"Sweet little boutique with a unique selection of clothes for regular and plus sizes.  I sh","useful":0,"cool":0},"7mvmTt3xhAwAqdkXWb4gHQ":{"text":"LOVE this little gem of a store! Lost and Found is that store which has such unique items,","useful":0,"cool":0},"VEBe-xI5I62VsLoD_cos-Q":{"text":"On my first trip to New Orleans, I was taking a destination-less stroll through the French","useful":3,"cool":0},"PxhS5djXeBXf8dBxm_mZqw":{"text":"It's a secret desire  of mine to build a time machine and travel back to early 1950's  Ame","useful":0,"cool":0},"v1zMevui4XDW17W5F2UvKw":{"text":"Nice little shop with reasonable prices.  My wife found the perfect sundress.","useful":0,"cool":0},"U-KwOYMwD1xtVw4aH9a1YA":{"text":"A super fun shop filled with vintage & vintage-inspired jewelry, clothing, and shoes. I lo","useful":0,"cool":0},"D-cl-ayMBb2ybIsY59_7Cg":{"text":"This is an extremely cute store.  I spoke with Trish who was working there and she was ext","useful":0,"cool":1},"0TJGRTwVGFFx9PzMaXdiLA":{"text":"Very cute little store with vintage style clothes. They have a lot of great prints. The cu","useful":1,"cool":1},"MIFYMKsxWIwOncUy7nbttw":{"text":"There are quite a few boutique stores in the French Quarter, but this one was my favorite.","useful":1,"cool":0},"2uD7JnRGlWLK8b0gXDs_Ow":{"text":"Cute boutique shop. There's a handful of boutique shops in the French Quarter, but this on","useful":0,"cool":0},"luEBIsW1Pm13GPAiAIgptQ":{"text":"Yoooooooooooooooooo!\n\nWhy had I never run across this place in my previous visit to Nola?!","useful":3,"cool":3},"DizbQkYpBEnwUoZwvRRusw":{"text":"My DIL introduced me to this wonderful place. I went in with her to see a dress she and he","useful":6,"cool":2},"WZQHys83EwmXutObDYOAOQ":{"text":"Super cute shop. Local artists, jewelry, candles....clothing etc. \n\nLove the vintage vibe ","useful":0,"cool":0},"_3JXhM4IVW9px1Q1hC4Yew":{"text":"I LOVED THIS STORE!!!!!\n\nI bought a Groupon for my recent trip to New Orleans, which is wh","useful":0,"cool":0},"ADVtBHZdAkGiQWYmg1VXFQ":{"text":"What a great little gem in the heart of the French quarter! Trendy, affordable & unique, a","useful":1,"cool":0},"SMpgMurf8HWmfF-MP6h3MQ":{"text":"I wandered in on my last day in NOLA looking for souvenirs that didn't revolve around alli","useful":5,"cool":1},"yOjAy6rWrbkzSMR6n-h3jQ":{"text":"My spouse and I wandered by this shop and to the surprise, happiness and sadness we became","useful":0,"cool":1},"o6J8LznC2iTbwajhYroT4g":{"text":"BEAUTIFUL CLOTHING! I love cats, sloths, llamas, and everything in this store! Thank you s","useful":0,"cool":0},"4QE4YZzyW401n6ubCXu7LQ":{"text":"Walking from one end of the French Quarter to the other end can be a challenge after a dri","useful":7,"cool":5},"wtWc1CqSNmqnwiKRbKSmTw":{"text":"Seriously.  Love.  This.  Place.  Wish I lived in New Orleans so that I could shop here ye","useful":0,"cool":1},"rli0pethO_FyUlEneYpbyQ":{"text":"This is a fun little store with a lot of fun and flirty, vintage inspired dresses!\nEvery t","useful":0,"cool":0},"W1_7nz8LscaJxANcg2qurA":{"text":"First off, just to get it out of the way, there are either two places with this name or tw","useful":1,"cool":1},"fJY-Rep8JBDronCERFSH6A":{"text":"Great little store!  Its the kind of place you do an initial look through and almost walk ","useful":1,"cool":2},"3MOO6ddA0VNgpqdTbKks3A":{"text":"I purchased a really snazzy ring from here.  It was a silver metal.  It literally statted ","useful":3,"cool":0},"4cSTKA3EJ6tPeHiP8pRp5w":{"text":"Cell upon my arrival I was extremely excited to try lost and found as I am a huge online s","useful":0,"cool":0},"x_gaGcI8MZi96rilbsME4A":{"text":"One of my favorite stores in New Orleans, I get a few items every time I visit. They have ","useful":3,"cool":4},"jSbeEro21jVta86MpFyZAw":{"text":"A big thank to NOLA lights soy candles in Nawlins...my candles arrived timely and in excel","useful":0,"cool":0},"B5jopWt2aPj1RhDuZdIHvA":{"text":"Horrible service. Rude personnel. Avoid going to this store.","useful":0,"cool":0},"AvOW5ahBlbE7sK38sy823Q":{"text":"Absolutely LOVE this shop! I walked in with my husband and another couple. Everything in t","useful":0,"cool":1},"KrNV_0anJSvqolzrIEqfZA":{"text":"Adorable shop with unique and fun clothing options.  Loved it!  The staff was very, very f","useful":0,"cool":0},"3mCNS-ILK7_8XHionfqL4Q":{"text":"This IS A GREAT STORE!   The clothing lines not only suit societies version of what is bea","useful":2,"cool":4},"jEs73B3vNXqL6-4SXSu68g":{"text":"What a fun store. There is so many great choices here and plenty of local artist wares. \nI","useful":0,"cool":2},"bj_S_9HMNM_0WvuLZlXpTw":{"text":"They have a few wonderful vintage dresses and prices are good. Loved some of the shoes as ","useful":1,"cool":0},"4BQeppeEvvuGmmMOoXCSaw":{"text":"Love this place!  All about vintage and has plus sizes.  Really great service.  Thanks Mel","useful":1,"cool":0}}