{"uceR3WCrn9T35HbQ6xv16Q":{"text":"Surprisingly cheaper than Wal-Mart (right across the street) for many items and generally ","useful":1,"cool":1},"vWTkJLNk3NMAzjjbiEAuZw":{"text":"*************************************************\n\nThis WINN DIXIE is listed twice. So her","useful":5,"cool":2},"mAK58WziKaJqIw3oCFGL-A":{"text":"Horrible place! It was great right after Katrina when it was rebuilt. It took less than 2 ","useful":1,"cool":1},"KTgdQLKdzEatKxDQznmFzw":{"text":"Upon visiting other Winn Dixie's (fuel perks has made me a Winn Dixie connoisseur) I can s","useful":1,"cool":0},"dimgAUsVzbEUyTf4Q_J2MQ":{"text":"This store needs to be shut down. On multiple occasions that I shopped here. It's always s","useful":1,"cool":0},"jrRp3w5aE0bCPXyN235q0w":{"text":"Best selection of brown lettuce, grey hamburger, and expired milk I have ever encountered!","useful":1,"cool":0},"23XYv9xj5TBX198XXIUkVQ":{"text":"Every time I shop here, I have problems.  \n\nNavigating the parking lot is a task in itself","useful":1,"cool":0},"URJbyzqSKHDrfRiCuzR-cA":{"text":"hit or miss here.   I genuinely want to spend my money in here.  but you keep giving me re","useful":1,"cool":1},"cXnWrEvTW3MFFomjdGFFIg":{"text":"Winn Dixie's closed a long time ago in Fort Worth, I was happy to walk in it looked just l","useful":1,"cool":2},"YKrVTVCTKoORipLY05F0Qg":{"text":"Clean and bright but only two checkers on Saturday afternoon.  ?\n\n\n???????????????????????","useful":0,"cool":0},"md2MDjgnVXWgpd89vj_I-Q":{"text":"I hate even giving this place 1 star!!! If I could give it a negative star, this place wou","useful":3,"cool":1},"oJIgMZS2JYQj20rdQhHVaA":{"text":"I only come because it's closer to my house. The customer service is horrible and they rar","useful":1,"cool":1},"9rXa40QBW_o2eeKjx3FGFg":{"text":"I love winn dixie, I hit them every time I am in Louisiana. This location does have bad pa","useful":1,"cool":1},"kP7TkrrDidPv4o3wt1HVcA":{"text":"This location is terribly dated looking on the inside though it seemed clean enough when I","useful":11,"cool":6},"3w_lmvQMseuWbdLLIeyamQ":{"text":"Ok, this is not the place that you want to grocery shop at. The people that work here are ","useful":4,"cool":1}}