{"Cn0O5bbPs-LIKsxoXaKCyw":{"text":"First time here and it is an overwhelming experience.  So much to do and buy and be a part","useful":3,"cool":1},"7RbLOWkbC6yiRPV0bmQ-Fw":{"text":"So freaking amazing! !!!!! I enjoyed my self. I was fortunate to go Friday and now Sunday ","useful":4,"cool":2},"86NdvaysXNV-7PnVQVbPZg":{"text":"I have heard so many great things about  The Essence Festival but my experience wasn't gre","useful":7,"cool":1},"uZVJn7VFpkuJigjmxzOC_w":{"text":"If you're going to do Essence buy the weekend pass as early as you can. Even before the li","useful":2,"cool":0},"B6Tm8CGQkC5PaL8wM9ssdA":{"text":"Great event as usual.  I think everybody who loves music and loves to attend Black themed ","useful":1,"cool":1},"6fSzGfEjpZ66nIG4xF70TA":{"text":"20 women to every man...dignitaries of all kinds.....Chris Rock telling jokes.....Cornell ","useful":4,"cool":3},"FpF7Er2BhHvypGhdm4btGQ":{"text":"Why does Essence Fest try to portray an image of upscale and classy when all it attracts a","useful":0,"cool":0},"ZykqKkwzXgUWccEDTQNMwA":{"text":"This was my very first time ever going to the Essence Festival as well as visiting Louisia","useful":2,"cool":0},"yhz17SxA93OtmpHL5awXag":{"text":"This was my first year attending and i now understand why people have been returning faith","useful":0,"cool":0},"Ici0UyylkEYhtNZCIWk7AA":{"text":"A fantastically organized event. Flawless in my opinion! Great food vendors, happy locals,","useful":0,"cool":0},"Ky9GzZRTu6KOWfV_WSau7Q":{"text":"\"A party with a purpose\" is what it is commonly referred to as.\n\nThis event is open to EVE","useful":12,"cool":7},"Ml7n7OKi5dWYp95K6vwWLQ":{"text":"I don't understand anyone who lives in New Orleans and doesn't go to the Essence Music Fes","useful":7,"cool":1},"viacPgGhZESZ7e-Ly_APmw":{"text":"Thursday through Sunday. We only went for one day.\nPrior to going, we would look at the we","useful":1,"cool":0},"VrcR6e-E9YuvxLo-uIYl5w":{"text":"Essence festival is an okay event but is a very expensive event to attend. It's not someth","useful":3,"cool":0},"gPrcRF32GBkWT7wAjh7mDQ":{"text":"Missy elliot garbage period worse essence every giving her a main event was the worse thin","useful":2,"cool":4},"R2T2heNa6Q_QtjjsVIQYig":{"text":"This was my first year attending the Essence Festival 2013. This event has been on my rada","useful":7,"cool":3},"ot9nj3LORxe_cpN8Xn6L1g":{"text":"I love love being empowered at Essence Festival.  It is a feast for the body, mind and sou","useful":0,"cool":0},"fMZJ2ot8Jc7Hb_KBmVIDEA":{"text":"Essence was great what they do for the city is wonderful. Im not big on concerts at big ve","useful":0,"cool":2},"bn17m5kninb5fSTCxi0s-A":{"text":"Essence 2018 experienced the aftermath of  the movie Girls Trip that came out a little bef","useful":2,"cool":1},"9KGphYk-JtUI2TIrLZnVhQ":{"text":"Essence is the premier music event of the summer! People flock here in the heat of summer ","useful":14,"cool":13},"evOSNxIhHLA4ekieN_U7AA":{"text":"Great experience of a lifetime! The concerts are great both on the main stage and the loun","useful":3,"cool":0}}