{"SZKbe8kSQW3uBAk6yj5eJQ":{"text":"Had the hot sausage po-boy.  Not very good.  Not recommended.  Dry.","useful":0,"cool":0},"pW9J7A0ZZdzsXCIoUyml7A":{"text":"Best food, best quantities, best prices, best lunch specials!!  Its a must for lunch and g","useful":2,"cool":0},"egFCnK1KJtq2KdOrRfl15w":{"text":"So I have to admit, I wanted breakfast and was headed to Waffle House when I stumbled on t","useful":0,"cool":2},"GMZqcvE4yJDd4ZVSnNf5GQ":{"text":"Went here today for a birthday lunch Great service delicious food friendly environment\nRec","useful":0,"cool":0},"JgWWuyzV3awqZHs2gG6JjA":{"text":"Let me tell you something, if you want a nicely dressed oyster po-boy or a HUGE seasoned a","useful":3,"cool":0},"uPTVi6ed1QORhyeewqXaXg":{"text":"Today I stopped in during the lunch rush and had surprisingly fast service with a packed h","useful":2,"cool":2},"eiNiAM9gPaZtOto9n2rMfw":{"text":"If you're looking for ambience this place isn't for you. The Sandwiches are off the chain ","useful":0,"cool":0},"JZOMj94xND_Bmw-viX0NlQ":{"text":"I had the roast beef po-boy. It tasted pretty good but it was way too sloppy to eat. If yo","useful":0,"cool":0},"JdesOLqMhAt_sKvesGuLGA":{"text":"This place has a good menu, I tried the Catfish Poboy on my first visit just today.  It wa","useful":0,"cool":0},"I6anXP5nVp4OMVqUUmQ6Tw":{"text":"Had a catering order for a group from out of town.  Everyone loved it.  The Cajun Fried Ch","useful":0,"cool":0},"J9fATLVof1eHlZWTF3QCNQ":{"text":"OMG this food is sooooooo amazing.  I fell into a food coma mid way through finishing my f","useful":0,"cool":0},"yJmEfDXCw_HSR5dUh1YhCQ":{"text":"My family took a quick visit to New Orleans and would not have happened across this place ","useful":1,"cool":0},"yS6pxZZqraa1zJxVtWy4DQ":{"text":"Sammy's is one of my fav places!!! The food is fantastic! I worked at Habitat next door to","useful":0,"cool":0},"FkFoURkOQ2WozHwnMi6gnw":{"text":"It was a delight to visit this restaurant... Heard abt it on a food review, so when we too","useful":0,"cool":1},"EkHBsgyLHTTEyg0_71y3ZQ":{"text":"Great New Orleans cuisine at reasonable prices. Portions are large, prices reasonable and ","useful":2,"cool":0},"gE9mWMMIrHsx1ap0kWZA4Q":{"text":"Got the 3 egg omelet with bacon, hash browns and toast for $5.99. Mannnnn, that's a killer","useful":0,"cool":0},"s5CU4U1dtyDQKsuiTemXyQ":{"text":"This is my favorite restaurant for seafood.  The seafood stuff shrimp and seafood stuff ca","useful":1,"cool":0},"_NwZVqehQjnvsA4e3-xfVA":{"text":"We happened into this place after doing the Old New Orleans Rum tour.  WHAT A FIND!!!  Try","useful":2,"cool":0},"BjKRcXDui4C6VUx2vXbXxA":{"text":"Sammy's has THE BEST traditional southern style breakfast that I've ever had in NOLA. I or","useful":0,"cool":0},"kcZ2YXXv-_APXrMuHyf9bw":{"text":"The best thing in there menu is the soup. Can't go wrong with it. The portions are very la","useful":0,"cool":0},"SzW3C7TEv6vb5SVu0EjXUQ":{"text":"BLUF:  Great down home food for good price. Huge portion with a good price.\n\nI work near b","useful":1,"cool":1},"P_Wa5VgXtWXEUzxfxnIVgw":{"text":"Inexpensive poboy and plate lunch spot. Good specials and burgers.","useful":1,"cool":0},"W7OapZ6-PqufraHZ5CwwEQ":{"text":"Poboys to stuffed shrimp and everything in between. Sammy's offers specials daily and some","useful":2,"cool":1},"nKkkzeZOPe_AR4fN3o59lQ":{"text":"Great food, great service, and a nice environment. The white beans and rice with smoked sa","useful":0,"cool":0},"yHgYuF7ZQwnDb2r8lbocTg":{"text":"Definitely get your money's worth. Got the cajun fried chicken wings with 2 sides (mac & c","useful":1,"cool":0},"Ss_26Xj3zBkbR5tkjVlZhQ":{"text":"My husband and I visited Sammy's 8 months ago and we still talk about how great the food w","useful":0,"cool":0},"VxbzHEare0CsM7UOQG57gw":{"text":"A solid 4.5 and thank goodness Herb and Jerome at our hotel made this recommendation .  Go","useful":2,"cool":0},"xVKUyqd3jCHpGBEoVqncBQ":{"text":"I wish I lived closer to this place. Everything tastes really fresh, and different. The st","useful":0,"cool":0},"3sb3YxfC3MVZ_zQqnDn45Q":{"text":"This place is always pack for lunch. Their food here that I have tried is pretty good. Whe","useful":0,"cool":0},"Nb8cnpgCgBt8yayD9jeg6g":{"text":"After seeing an article on Facebook about the top 10 po-boys in New Orleans, I figured I b","useful":1,"cool":0},"0yR4zm_cidyKXCwKERf_-w":{"text":"Good food ,a little high prices on some items.The service is a little slow,but the food is","useful":0,"cool":0},"2t5tP-9W1Cy_mOW_g4pdsw":{"text":"Whenever my uncles come in town this one place they cannot pass up. #PoBoys #PoBoys #PoBoy","useful":1,"cool":1},"QP4-ihN3RUgvLwS5T4pBBQ":{"text":"No frills.  At all.  Don't come in here expecting table service or anything remotely fancy","useful":4,"cool":1},"ehMLeyS1w0Kpwn3Fcc4MmA":{"text":"Been to Sammys many times since my first review and have never been disappointed.  Today, ","useful":4,"cool":2},"a_YNkf8RB3bTbPzdmUhMcw":{"text":"Hands down THE BEST Hot Roast Beef Po Boy with debris gravy that I've eaten in NOLA... and","useful":1,"cool":1},"GVLoH8uWM9PUwra8P_Z9bA":{"text":"Where to start... The po-boys:  The 'Ray Ray' may be one of the most delicious things I've","useful":4,"cool":1},"p5YuFESWxaAGUnoiqIqmEQ":{"text":"Seriously, the food here is AMAZINGLY good! If you want a taste of real New Orleans cookin","useful":0,"cool":0},"UTcP0cc-6AEn6e3kBvpJsg":{"text":"Every time I visit home, I make it a point to stop at Sammy's. Even before I get to put my","useful":1,"cool":0},"vsL_P_P8O0j-k4qeUGzrOQ":{"text":"I decided to go here Friday (April 3, 2015) and let me tell yah honey, this place was sooo","useful":2,"cool":1},"RhYfCD52D3ZUO2nmS8UKoQ":{"text":"Really flavorful red beans and rice, got it with smoked sausage... OMG yum!!! The service ","useful":1,"cool":0},"Bc3jM2B-3jDlR86HK7VE3g":{"text":"Really good cajun/creole food, filled with a steady flow of locals (this northerner was bl","useful":0,"cool":0},"8K6kUweA_9hNDM6TyMti2Q":{"text":"We were waiting for a tour to start and needed to get a quick bite to eat. As we wandered ","useful":1,"cool":0},"1GHbMYbed-ngedfpnGlE5g":{"text":"Flavorful Roast Beef. This one was enjoyable despite the very hard bread, and is the most ","useful":0,"cool":0},"CkB1xGtbv9vt4kT2KbliGA":{"text":"Absolutely amazed at how amazing the food is. Ordered roast beef poboy and half cheeseburg","useful":0,"cool":0},"MpKBvRNOG_dSOmy4FWLrRg":{"text":"Sammy's breakfast always a mousy when I come back home to New Orleans. Their lunch is just","useful":1,"cool":0},"KJlroo_DVmb3rhaGEGMEWg":{"text":"Just want to add another thing about the greatest neighborhood lunch place in the city...t","useful":3,"cool":1},"mw2hdG8h18a9bjz1zigKfg":{"text":"The fried shrimp po-boy is a really safe bet. The shrimp is perfectly battered.","useful":0,"cool":0},"w7nBfWUUJedVeuTKra51KQ":{"text":"Great home cooked food fast.  Updated daily specials worth the price. Only con is parking ","useful":0,"cool":0},"3X6uEzRreS7skjvL88cG9g":{"text":"Our group of guys had a case of the munchies after taking down (probably) a bit too much r","useful":2,"cool":2},"I_jeAc--d2XowOTyTUwAxw":{"text":"If you are visiting New Orleans, or live here, and don't head out to Gentilly too often, t","useful":2,"cool":2},"Mha3ir_vMfcbx0VBFql6ZQ":{"text":"Four stars for consistency. Everytime I come to this place it never fails me. Is the food ","useful":2,"cool":1},"5oIo3ZpOu8oRr1dG7lbqCw":{"text":"Love the Po boys here! Shrimp is my favorite! They have crawfish, crab and oysters. Everyt","useful":3,"cool":3},"fxI3H7taS2liI_AogMzVMA":{"text":"First time eating here. We ordered the shrimp pasta, stuffed mirliton, stuffed bell pepper","useful":0,"cool":0},"pbDjjeIxqBFQAvw72-1QaQ":{"text":"This is the place to stuff your face and pay for it later.  The pain is worth it.  The stu","useful":1,"cool":0},"2P0B2CL8GLAR_bqJWs284Q":{"text":"This was my first visit here and with no doubt Sammy's Greek Salad is pretty kickin'. It h","useful":0,"cool":0},"IM8d7zUF5k1LheXnZXp6gw":{"text":"When Venturing Out GOES WRONG... If I could give this place negative stars, I would. Food ","useful":1,"cool":0},"zstXMUAE9yKDULjWvBhysA":{"text":"This is a solid lunch place. I didn't get a po-boy, and maybe that's why I wasn't blown aw","useful":0,"cool":0},"h6-EyG_fpZNViAsq-TwdJg":{"text":"Decent food for sure, looking for a new place to buy \"crawfish Monica\" though since this p","useful":2,"cool":1},"3yFhlhq-_li4Y_FXBKoZ5A":{"text":"Went to an event that had food catered from Sammy's.  I must say it was delish!  The fried","useful":1,"cool":0},"lxuZiIIKJV80HzdtJfCm8g":{"text":"Sammy's is the kind of place you would never pick out of a crowd. It sits unassumingly on ","useful":8,"cool":4},"Q6lmCmYlDqqSewTvsVOjUQ":{"text":"This place came as an initial shocker. Excellent venue for BOTH breakfast AND lunch. \n\nThe","useful":1,"cool":1},"eQ2wdO9_0KAln-fcYiLqmQ":{"text":"So slow we had to leave without our to go order. Unbelievable--waited 45 min for 5 po-boys","useful":3,"cool":2},"0qBV8mKVyvXcy7kzJYDbUQ":{"text":"Excellent brunch! Although the line outside was terribly long yesterday. A 45mjns wait was","useful":0,"cool":0},"3R3CM_UR6c0Z2lYC6H1Wgg":{"text":"This place is near perfect. Granted a little high for lunch, but who cares when they have ","useful":1,"cool":0},"1Tn3SgbDJrfItmRCLAXk7A":{"text":"I eat here all the time. It's cheap, easy to get to, and has a good variety. But I've noti","useful":1,"cool":0},"Axr_Lwx-YHcHCCVcsCCxlg":{"text":"I went here because one of my friends told me about this place.\nI am glad he recommended b","useful":3,"cool":2},"ZuLbFZPWWoXFEUYxxh3o4g":{"text":"Yummmmm.   Service is typical NOLA with attitude.  But the place was clean and the AC was ","useful":0,"cool":0},"mTAqvrIrX9mf3HHTGuFQbg":{"text":"Sammy's has a huge menu and mostly everything tastes great. This place will be around for ","useful":2,"cool":0},"nw_Qd1GH4zHMcKz3-e3FvA":{"text":"We ordered Sammy's for lunch through Waitr. It arrived fresh and very promptly. \nThe catfi","useful":1,"cool":0},"4ibOjhNnaiScrhZXWACmBg":{"text":"When I was a teenager, my dad used to come home with plates full of shrimp and fish. It wa","useful":0,"cool":1},"6qP02bNnoxGkbZZlXZtvhQ":{"text":"Was willing to give Sammy's another shot as they were the only place on a Tuesday I could ","useful":2,"cool":1},"5XJFvRWsFjM7gT9oZw77uQ":{"text":"Our penultimate trip to New Orleans yielded a stop at Sammy's.  After reading the reviews ","useful":0,"cool":0},"ZyeNcbh2nTyhecyhPZuFzg":{"text":"Great place to eat when you don't feel like cooking... I love the fried catfish as well as","useful":0,"cool":0},"bELEBUQOoTkpK8WqbhYTpA":{"text":"I came here with some friends and was very pleased. We had no trouble getting a table at l","useful":1,"cool":1},"kSvf9o3HA-qRpryITXoPMA":{"text":"This is a simple place with delicious food. Prices are decent, and portions are big. The f","useful":1,"cool":1},"3R4MNwyqCqpYrdXyhsRX2w":{"text":"From Nola and this was my 1st time stopping by. Staff was very nice in being informative a","useful":0,"cool":0},"pOpkoZccoLcW8Q6NINrw7w":{"text":"I have eaten there a few times. I liked the sweet potato pancake plenty. It was huge.","useful":0,"cool":0},"B_zGlgrqVjkBetH1HLGkYw":{"text":"Had the roast beef po-boy.  Very good.  Will be back to try the hot sausage po-boy which I","useful":0,"cool":0},"_EhBnW1tfFNTNPvPUtPLNQ":{"text":"Parking is kind of hard to come by and you will wait in line, but it's worth it!  I ordere","useful":1,"cool":0},"8T3afPM7m9xb_HtTsMuutA":{"text":"I had the baby back ribs, baked macaroni, and potato salad. The ribs not only fell off the","useful":3,"cool":1},"kwVciC5WTv7nZ9aJft0A1A":{"text":"Word of advice, go for the stuff they highlight and try to put on display. I'm confident t","useful":0,"cool":0},"8ypr4iSDfzP80GC_tOBEGA":{"text":"Favorite food place in the city! Always hard to choose because everything is good here.","useful":0,"cool":0},"PJoQMgJ8LJvDg4iUeORH5g":{"text":"if you read my other reviews, a 5 star rating isn't common.  Hands down, the BEST Po'Boy d","useful":2,"cool":0},"hreKwe85-Ce7FN4XmvkdFg":{"text":"We were referred to this restaurant by Leo at Ponchartrain Landing RV Park. It's not reall","useful":1,"cool":0},"z10ySqcrpmNcgIfNWcWTMw":{"text":"Variety! And amazing food. I usually get the stuffed catfish with their roasted garlic pot","useful":0,"cool":0},"e52SP1L-EI383wB7tCmlhg":{"text":"The Ray Ray is one of the most ridiculously amazing sandwiches I've ever had. It's the siz","useful":1,"cool":1},"KfyGMjbf4E0_AEpFmflwJA":{"text":"last time i was here was maybe 3yrs ago. I remember a nice breakfast. Just spent $26.77 on","useful":1,"cool":1},"fCKAwMhR5mmZi4qtcl2Zfg":{"text":"If soul-food is your desire, Sammy's is your place.  \n\nGet in line to place your food orde","useful":1,"cool":1},"Nx8F9VHXRPcs0pAIQK2Dew":{"text":"This place has been a staple in this area for quite a while. I am a fan of their seafood m","useful":3,"cool":0},"NS_3aUkouzn-3XWHjZlerA":{"text":"We had a shrimp poboy and a Ray Ray. Both were so-so. The flavor of the shrimp was good, b","useful":0,"cool":0},"TqUqXFLf8aNLFT_76lhVgw":{"text":"All of my friends rave about this place and I'd never heard of it until recently.  Parking","useful":1,"cool":1},"-T6lwKC8UAPloq9jfLW3Cg":{"text":"This is one place for years I have picked up a great fish plate on Fridays. Picture it....","useful":2,"cool":0},"_pCgIZHVk5ijeZWYoaUeJg":{"text":"I don't think there has been a time I have eaten here that it has not been amazing. Everyt","useful":0,"cool":1},"OefLTvASKtx4V72hpl7jQw":{"text":"The food was good, but the service was spotty.  We were overlooked for over 45 minutes wai","useful":3,"cool":0},"ogGvEnvYPDcwamWcwcolhw":{"text":"When you place a to go order they're supposed to  plasticware napkins etc. and your order.","useful":0,"cool":0},"SNYU8wca0IdYitoMCyebhg":{"text":"The food is five stars, the service is two but the shrimp and mirliton soup cannot make me","useful":2,"cool":2},"bH0Y7eLA1uaUE8O6DncCoA":{"text":"It was my first time at Sammy's and it will not be my last. I ordered the All American Cla","useful":2,"cool":0},"Tqttks5bg4KNDKPFhfQ_sw":{"text":"This is where the locals eat. You will see a huge range of locals from Police, Firemen to ","useful":2,"cool":0},"WvVK2pJh9BVZDOBDDeRt3w":{"text":"This place had the best White Beans ever! Oh yeah, and everything else they make is freaki","useful":5,"cool":1},"QB39fCTAvv_VchRRk6Y8GQ":{"text":"One of the best spots in the city and a regular stop for me. \n\nGrilled red fish special is","useful":0,"cool":1},"-vEfHhiuKFAxrUsDG3jxwQ":{"text":"We shared the RayRay!!! It is amazing!!! If you have not try Sammy's, you are missing out!","useful":1,"cool":2},"JSt83aLI1pb34AGJu2ukrA":{"text":"Poor.. After waiting 1 hr for food it all came cold. I had grilled red fish parsley potato","useful":0,"cool":0},"pDuQmaCXWAMGyLucNjX-Dw":{"text":"When this mom and pop shop first opened in my neighborhood it's served great New Orleans h","useful":9,"cool":3},"d9tnLEy-fiDJUNFq0szO4w":{"text":"I would definitely go back! \n\nCons: the line was bit long and slow; the wait time on my fo","useful":2,"cool":1},"0OqQWNKAAQ4r6RWbrVLeRQ":{"text":"Nothing fancy, but probably some of the best po-boys in town.  Mac-n-cheese is pretty good","useful":1,"cool":0},"JmeWevMwRHE7PQyusI33hQ":{"text":"Just some of the best food you're gonna eat, that's all. The fried trout and burger were b","useful":1,"cool":0},"wu7tQdAzTNkMdMmR3f8liw":{"text":"I came with a group of 25 and they got our food out very fast with a smile on their face! ","useful":1,"cool":0},"rUL9HbT2mg_LDu480_PG9Q":{"text":"Food was AMAZING! Sweet potato pancakes were wonderful! Service was great, portions were H","useful":0,"cool":0},"Xof3gfemxSoQHXbZLj80bg":{"text":"I've eaten here before awhile back and the food is always good. Hey must have changed the ","useful":0,"cool":0},"IUiT9N2Q6ONheIIDb4ECHA":{"text":"A colleague and I visited this establishment last week. I had been hearing things and we n","useful":0,"cool":0},"WdXf2rONA8FpxC1EZQKd1A":{"text":"Awesome food!!! Sometimes the lines are long for lunch rush but truly awesome. Family owne","useful":0,"cool":0},"uqi5WbH52ge2R67nCSulvA":{"text":"I went back here recently because I had a good experience the first time I went and my gir","useful":9,"cool":5},"5xHcIAyjRwTS048aWy1mjw":{"text":"I've been to Sammy's a few times. It's always a bit of a wait because everyone loves this ","useful":1,"cool":0},"a-CQcTQymJ6D743LCjFNOA":{"text":"On a recent roadtrip to NOLA, we met up with a friend who is a long time local and I asked","useful":0,"cool":0},"wq3Mc06SUAEPM1NReI0snA":{"text":"I must say, this is a hidden jewel for breakfast and lunch. \n\nI enjoyed my egg sandwich an","useful":2,"cool":2},"k3QkGZIB8SKcz7TLNcn4Nw":{"text":"Sammys is the premier spot to get food in the NOLA. \nMinus the exacerbated prices,this is ","useful":0,"cool":1},"gQy2oPZH8vuM4f9hIA-BTA":{"text":"Great spot for a thoroughly local lunch. Yes, its a little far from me, but if I'm near i-","useful":3,"cool":2},"Foh5_QCuxBHeLvPL2rSJ8w":{"text":"Stopped in yesterday for lunch. Food was excellent, will definitely be back! The wait was ","useful":1,"cool":1},"VpZEQTAP6BmfB7PB1iIH8g":{"text":"First of all I would like to point out I am a bartender in this city and this is my first ","useful":0,"cool":0},"fMwIB7U6--foT_XOkdUZvA":{"text":"I've lived in this area for several years, only few blocks away,  and I've never written a","useful":0,"cool":0},"Y95do76PTQ9zb-tYbWBtFg":{"text":"Fantastic New Orleans style restaurant.  You can always tell when a restaurant is owned by","useful":0,"cool":0},"ftBJT5xS4bMzCRv1wfiW7w":{"text":"If you're looking for a good spot to eat lunch, I'd say look no more! You go in and you or","useful":4,"cool":2},"6q8WOpCNDr_F7R33FmGy0A":{"text":"This is a favorite for me, especially on a Tuesday. The dish I fell in love with is the ch","useful":0,"cool":0},"pUBJN3KtRiH6V5cqLywYaw":{"text":"First time eating here. We ordered the shrimp pasta, stuffed mirliton, stuffed bell pepper","useful":0,"cool":0},"I-vjxie0H7fGA99pAZ9p4g":{"text":"This my third time here .. I came in 2015 An twice this years .. the last two times wasn't","useful":0,"cool":0},"WVsmvKkdbCjSb_ufLsZ2hg":{"text":"Staple in Gentilly. A must eat if you are in the area. Literally everything on the menu is","useful":0,"cool":0},"wHwjPg9k3Qu1EpihE1rLEg":{"text":"I ordered the half rack baby back ribs and the juicy meat was falling off the bones. I usu","useful":0,"cool":1},"h0CzDRaNBdccZ4XRCcnTtQ":{"text":"Perfect. I can't say enough good things about this place. If I could afford it I would be ","useful":1,"cool":0},"yvz17mfGHQ_OdDrFulLDYw":{"text":"This is one of my faves for lunch- a quick lunch. They are usually crowded when I go on Fr","useful":3,"cool":1},"Z6XgfOk1NK9PSEewj6HQew":{"text":"So step in, walk up to the counter and make your order. Then grab whichever table suits yo","useful":1,"cool":2},"l0RJqCJ5sKXzdQea01pdfw":{"text":"The owners here are absolutely amazing people! Our first time here and all the food was gr","useful":1,"cool":0},"PZ49gwpeM89a4k97E9IWdQ":{"text":"From the outside Sammy's doesn't look like anything special, but when you walk in it's ver","useful":1,"cool":1},"YkxbbE-EDUFTtu7N0nrUDA":{"text":"Sammy\"s  fried chicken is the best. Whenever I crave fried chicken, I'm there. I had to ge","useful":1,"cool":0},"EomIcMwQRu9HNjGRC_7tkg":{"text":"OMG! If you want cheap prices and abundant portions of delicious authentic New Orleans cre","useful":1,"cool":0},"6lc1gFWUdKK9yveQe2Ty6w":{"text":"Food is great with very large portions. If you are ordering to go be sure to call it in ah","useful":0,"cool":0},"9wjFt5NOZNs-Ze7pnKT8bA":{"text":"Saw this on triple D, great sandwiches. Counter service, fast and friendly. Parking is a b","useful":0,"cool":0},"7pObOIhadBA0gZySqBHXXA":{"text":"The food at Sammy's is Never disappointing.  It's a perfect New Orleans down home place. T","useful":0,"cool":1},"JrUgx_UHVAc2aNjBhy5eSQ":{"text":"Had the grilled trout poboy for the second time and it was once again delicious, albeit a ","useful":0,"cool":0},"nhgge_g4oBF-OH5zf0XSqQ":{"text":"This food was gross, the only thing that was good was the lemons. Like I said in the pictu","useful":3,"cool":3},"ImbupxLUX09kYNAsQjCvXg":{"text":"The best catfish poboy in town.  I will edit this to advise you on how best to proceed whe","useful":0,"cool":0},"-RIb320MTmP7w7mxILqMMQ":{"text":"AWSOME!!!! Had to walk back to hotel off Canal to get food to settle. Will def be back nex","useful":0,"cool":0},"Vny_vE9V59DItTWXgc4Eig":{"text":"I ordered fried trout platter with Mac and cheese and potatoes salad it was really good wi","useful":0,"cool":0},"cXqROG4UeUj2ThB5Hhy_wg":{"text":"This is the kind of place that I truly love.....no frills, casual, friendly, and good home","useful":9,"cool":2},"RiQPnGHGzbz0B6Z3gCJr3Q":{"text":"Stopped in for lunch after going on a tour at the Rum distillery down the street. This pla","useful":2,"cool":1},"BCb4nFcfLxZPEAIunsIJCw":{"text":"I went here for a late lunch with my friend. I asked to be brought to a place that serves ","useful":5,"cool":3},"_5qQaNLu09BakFgh50pr3Q":{"text":"Found this place about 4 years ago when visiting the Rum Distillery around the corner.....","useful":0,"cool":0},"P9MsvWVPIOCWCoyjZa87ZQ":{"text":"Great service and GREAT Food! The wait on our order took at 10 to 12 minutes and that was ","useful":2,"cool":0},"Qxr066Zey_aI5Ht7xj2N1A":{"text":"5 stars. Everyone should vote 5 stars. Food is amazing. Every time. Doesn't matter what yo","useful":0,"cool":0},"bGopTgDKW8B1WfXT3qBwYw":{"text":"The food here is amazing - my favorite casual, mom and pop New Orleans style home cooking ","useful":3,"cool":0},"56q2m0-BgM-m9QX0TI93LQ":{"text":"Love Sammy's. Best breakfast in the area for a great price. Chicken salad is delicious .","useful":0,"cool":0},"SO9GR8vr4SnKJT4vTwSrJA":{"text":"food is AMAZING. GREAT value\n\nWhen I come here, I either get the fried chicken or the frie","useful":0,"cool":0},"GnJeqJBooME_bynu2QTtvw":{"text":"Omg..gave this place a 3rd try and the food still sucks. Ordered the black cherry peach Mo","useful":3,"cool":1},"_ljbcMOD3wDjiMQCTSGgaA":{"text":"Just like YA mommas home cooking. DAMN this is good! Try the Ultimate Roast Beef, you won'","useful":0,"cool":1},"t_wJFfcI1YEsxKy4pnuEXw":{"text":"I usually always order from Sammy's but after my experience today I will NEVER be back aga","useful":2,"cool":0},"YekKazIK3UUmT-fdBzmvFA":{"text":"went to Sammy's for carry out lunch. after waiting 30 minutes, we asked about our order. t","useful":0,"cool":0},"D0QgnJ1DpNfiTfdp39N5GQ":{"text":"We've been visiting Nola for years but had never hit Sammy's..our bad!!! Dynamite lunch...","useful":0,"cool":0},"UBAV9uqtLa13G_PjXELgwA":{"text":"This was my first time here!  The line was a little long but once I received my order it w","useful":8,"cool":10},"BB3KKKRsbjFJP1T1nAhy9w":{"text":"Food is not the best, and I wanted to try the grits but unfortunately they didn't have non","useful":0,"cool":0},"qh0z9LnB2T50epOe3WWKWA":{"text":"when an 86 year old lady from new orleans, asks you to get her food, and sends you to a pl","useful":2,"cool":1},"jsD4O6JJwkeFfIL09j9jYg":{"text":"I disliked most aspects of this restaurant. I don't like that it is 100% self service but ","useful":7,"cool":4},"p38aovBC3TbpAbZG7pjhYA":{"text":"Sammy's is a staple in the gentilly neighborhood. Good fish, big burgers, and yummy soups ","useful":0,"cool":0},"ck3soWymjhXsFrLKH5F0Qw":{"text":"I really love this neighborhood family owned business.. I come here at least a couple of t","useful":0,"cool":0},"_DtFt6qZHyLeH-iQeKhW6g":{"text":"I used to work a block away from Sammy's and all my coworkers would talk about how good it","useful":2,"cool":0},"_rHS2epHoHtUuzM0RL3Mfg":{"text":"First of all thank you to the employee at Walmart for recommending Sammy's, you were on po","useful":1,"cool":1},"qV1t7vQm3YAZSefm-9pO9A":{"text":"Ahhhhh ahhh yeah I love dat place baby! \nMmmmmmm eeeeee oooooo\nSammy's is great, sweet spe","useful":0,"cool":0},"VobduLM_i8ibdR0DZJZ_bQ":{"text":"Sammy's food is good ole fashion home cooking. Their prices are fair and the portion sizes","useful":0,"cool":0},"SoRyshiOBUU0aYHtJr6Xow":{"text":"I was hanging out on the other side of the tracks that day, which is slowly becoming this ","useful":0,"cool":2},"eUIiGWLefUm8ZwHdVaU2QA":{"text":"I had the fried catfish plate. Fish was very good. Jambalaya and greens on the side were g","useful":0,"cool":0},"zygPUuAE9VlH_8lOuCvmag":{"text":"I heard great things about this place from people who attended UNO for college. I would he","useful":7,"cool":4},"wuQAsmbrb28vmSfK8IYzdA":{"text":"Had the 6inch Ray Ray poboy with red beans & mac and cheese. The Ray Ray came out piping h","useful":1,"cool":1},"jA9tj9K8OqnPv9Ra-isYVA":{"text":"I've ate here before and had no real complaints but I normally get the stuffed mirliton. I","useful":1,"cool":0},"Twwy27MKVGZUiGWuO8QCJQ":{"text":"Their food is decent. The kettle potato chips were stale and very soft. The bread for sand","useful":1,"cool":1},"WJPto9V1eArBo2GFJmE3Iw":{"text":"Sammy's the return. I decided to come back and try some new items on the menu. The orderin","useful":1,"cool":1},"m3-PRP9rhzTA1i2xEoWxLA":{"text":"45 minutes for some poboys because they forget to process your order.  Won't be back.","useful":0,"cool":0},"lC_Tgkzop5UYD3fvmwJ0_A":{"text":"After trying Sammy's famous shrimp dish at Jazz Fest over the years, this was my first vis","useful":12,"cool":9},"bhJ7II7hEO0u7ubAwOGTZw":{"text":"Food is awesome. Service is fast. Just so many people and no parking. Don't come during lu","useful":0,"cool":0},"7GJjXxiQ79CTFHofpjg_kg":{"text":"So disappointed in Sammy's!! Ordered 2 shrimp poboys, a large fry and 3 large sides of Jam","useful":1,"cool":1},"5haHGV1E6jKikKabtbizow":{"text":"Meh, yep. So disappointed. Last time I was there I wanted a grilled chicken salad. The bow","useful":0,"cool":0},"xpsBaIL10dGrZSRNQXdxyA":{"text":"Good food, but the order management is garbage. Phoned in a club sandwich (cold cuts on to","useful":0,"cool":0},"fY7kmP3VxJYdEgCivX7QbQ":{"text":"I don't know what happened to Sammy's, but today's visit was horrible. The staff continues","useful":1,"cool":0},"eoSMm3x8dp4DhWn-FsPmkg":{"text":"I generally love the food from Sammy's, however today the stuffed shrimp plate had an old ","useful":0,"cool":0},"mhFykNGKX9DZtppPxU2dZg":{"text":"The best sandwiches OMG so so good we went twice, you can't go wrong if you eat here. My f","useful":1,"cool":1},"5PeBB8avKHQTGcL_1bN02g":{"text":"Talk about that good southern home cooking make your arteries clogged type of food! Just k","useful":3,"cool":2},"g1r2uB3P2Tu6h3ZYDZzx6g":{"text":"I've only been here once.  I ordered the roast beef poboy and sat down to wait.  While wai","useful":1,"cool":0},"Gv1oCRQfbhP45yW8LJGrHg":{"text":"I had seen this place when visiting the ReStore and made a mental note to try it.  So I ca","useful":1,"cool":2},"-LirI0om5GNJCDzcEcYvxw":{"text":"I can't believe some locals still haven't been to Sammy's. Quit playing.","useful":0,"cool":0},"0yWn7BrEV-PEg0pT0BRn8w":{"text":"Went there last weekend while visiting New Orleans with my girlfriend and this happen. It ","useful":1,"cool":1},"zDBSmYkOLKmL4nN_dzjK6Q":{"text":"VIDEO POKER, ATM, FOUNTAIN DRINKS, DELI CASE, DAY CARE... well, no, not day care but Sammy","useful":9,"cool":5},"q5bFGyZ0wr00Mk447KDdlg":{"text":"Three of us went here for lunch today... waited almost an hour we all had a different sand","useful":2,"cool":0},"LI6Rduw6kWILWs6Fw2L8ig":{"text":"Great food & fast service. This place has rockin lunch specials!","useful":1,"cool":0},"R6y4EmJrKp4ug-tXNPyXhQ":{"text":"Came in on 10/31 for food, once I made it home (Westbank) I realized that, surprise surpri","useful":5,"cool":2},"EPfwqn1eFhBJBlfGhPtMhg":{"text":"I have been to Sammy's quit a few times. The food is absolutely amazing! I have NEVER had ","useful":0,"cool":1},"QP0FWiInyZvtEp0VAnwLxw":{"text":"I have heard about Sammy's for a while. My Roast Beef Sandwich was good. The Soup was Crea","useful":13,"cool":3},"_jy3UmzYCjy0vrYURtbFYA":{"text":"Never had a disappointing meal from Sammys! If your food takes awhile to come out that's b","useful":0,"cool":0},"hb25P0c7FxQvfXgrdrs8AA":{"text":"I love Everything from here. But today I got my usual friend chicken breast with potatoes ","useful":0,"cool":0},"3DAhRSHD_tP5hBawsA-qrA":{"text":"Hot pastrami stacked high on a 3/4 pound ground chuck burger  with sauerkraut, swiss chees","useful":1,"cool":3},"4LHW7p45Cz0_2yWn8qGYtg":{"text":"Sammie's is a great workday lunch go to space. I have to warn you that on some days they c","useful":2,"cool":1},"_RoR5-0LGmKnsV9ESMqJnQ":{"text":"This is a nice little breakfast and lunch spot and usually they close too early for dinner","useful":2,"cool":1},"wkY3T5TW95pVOU7dYv4cuw":{"text":"It may have been a year ago, but I still remember Sammy's fondly and continue to recommend","useful":5,"cool":5},"5TO3MX7xRvj9cTAmUbJtTw":{"text":"Visited Sammy's for the first time since Katrina. I was very disappointed with the quality","useful":2,"cool":0},"XluhUsGe__3z5xp7Lh9vDw":{"text":"I went here on Feb 10th around 11:48 am. I was hoping it was still breakfast but their bre","useful":1,"cool":0},"xvujvca8RdZAqCbuAzF4Vg":{"text":"Sammy's is a great local Gentilly spot! The staff are incredibly friendly, talkative, and ","useful":0,"cool":0},"fwP6x5fjQWAgSDsrryU6RA":{"text":"This Business is Good when it comes to the traditional burgers, sandwiches and fried chick","useful":0,"cool":0},"ZoD6JZV40tuWxS_AwDKoFA":{"text":"Great food. Not recommended for lunch hour unless you have hour to wait on order. Got ther","useful":1,"cool":0},"QEIzomJ34sTg_r1D9qjCtA":{"text":"This place is amazing. We ordered a whole Turkey and three sides for thanksgiving and I wa","useful":0,"cool":2},"AG-l3ye1AbCV6eTwvLW-Gg":{"text":"Not a bad thing on the menu! Huge poboys! They don't skimp on the portion sizes! True New ","useful":1,"cool":0},"3bvPGxKM6enRAI_Nh3PPpg":{"text":"I'm giving it five stars- really.  The food is always delicious, the portions are very gen","useful":5,"cool":5},"UFxqHI2eIFsmEaPFWM1gPw":{"text":"The ribs here were HUGE.  I only got a 1/2 rack and was only able to eat 1/2 of it, so I c","useful":3,"cool":3},"OtbgGHkqiKEcPi7XmY2ikg":{"text":"Yelp has this at 2 dollar signs but you can easily get a large meal for under 10. So you l","useful":1,"cool":1}}