{"-CgpgrqTPyQ0NlOShV8YrA":{"text":"Three stars, but it was hard to get there from two stars based on my meal. I will start wi","useful":0,"cool":0},"PvvOOMtPoF55QP93xON0BQ":{"text":"Food was amazing. Had the Buffalo fried platter. Was big enough to share with the Miss. Co","useful":0,"cool":0},"NIc6CKS4-ujJLr-TyN0AsA":{"text":"I can't say enough good things about Olde Nola Cookery.  Rachel, the event coordinator, wa","useful":0,"cool":0},"8ZNrZi21I-QSiegGgP79_g":{"text":"Solid place, on Bourbon St so you know it lives off of tourism, in saying that, friendly f","useful":0,"cool":0},"Av6dT4ue66gktdFDu6FdZQ":{"text":"Good food, poor service.  Took about 15 minutes to get greeted. My waitress was absent aft","useful":0,"cool":0},"FKJK077-zz-gCJHJjGwy4g":{"text":"My wife tried the taste of New Orleans and said it was very good. She was surprised how ta","useful":0,"cool":0},"8d-Ew2UohLHOspAtMgMFEQ":{"text":"Amazing!!! Gator bites, fresh oysters, Tasting of New Orleans and the Gumbo pasts was perf","useful":0,"cool":1},"wRu6skqV3u79H_pKeoah-w":{"text":"I'm so mad I forgot to use my Yelp check-in offer! But I thank my Yelp app for leading me ","useful":2,"cool":1},"GBxt8Qee92p6mh1qsZJInQ":{"text":"Yummy NOLA restaurant on Bourbon Street. Super busy. Line out the door. Food was good. Ser","useful":0,"cool":0},"kntSCu6V1oyC3UoTGSa4tA":{"text":"Amazing food!! Red rice and beans delish! Veggies delish and the special sauce is the bomb","useful":0,"cool":0},"FqeuYcuWw48WsuqcvzNKOQ":{"text":"This is classic New Orleans. You can get all the favorites here. They can even make you pa","useful":0,"cool":0},"NiBTxF9481Brj-Oq9XviDQ":{"text":"Terrible service, terrible tasting food. We waited over an hour for our bill and it wasn't","useful":0,"cool":0},"frrcJjae30A2cWrTBJKVlg":{"text":"Came in late... 10 pm and was seated quickly.  Good service.  The crawfish etoufee was so ","useful":0,"cool":0},"1B7neux0rAFuvX_3cBiCRA":{"text":"A good spot to grab a meal in the French Quarter. \n\nWe had a nice meal here on a weeknight","useful":0,"cool":0},"RI0exqgrvNOHFS6X9LgR5g":{"text":"Good food and good service. Only rub is that appetizer came out with entree. Other than th","useful":0,"cool":0},"dKRv4d2lG13rwkGyscEEsA":{"text":"Last night in town and wanted more New Orleans styled food. Prefect choice, food was fresh","useful":0,"cool":0},"XaZy1EkFb3-0MVLitNf2OQ":{"text":"After being handed a 15% off flyer outside in Bourbon street and being hungry from sightse","useful":0,"cool":0},"ijfDRLmncRZxluW32dvVRg":{"text":"The service was good but not consistent. The food was average. The restrooms were coed but","useful":0,"cool":0},"aiP-_3NjoGT8CS1UV_yN1g":{"text":"We really enjoyed our meals. We started with the alligator bites which were tender and tas","useful":0,"cool":0},"8lDt9Yh_4eINIa6gdZ4vnw":{"text":"First time in New Orleans and we decided to ask the local wildlife for a recommendation fo","useful":0,"cool":1},"f8DZGh_kybolXOjDw4-Adw":{"text":"Delicious blackened chicken Caesar salad, gumbo and jambalaya pasta! Will visit this spot ","useful":0,"cool":0},"nI-67iGYZkBS3xHZtKreZg":{"text":"So I was in NO with 7 other friends to celebrate over the weekend prior to the weekend bef","useful":3,"cool":0},"vuFDWZgaUKxbB5dXsR666w":{"text":"Great food, quick and oh so savory. By far the best po boys I have had visiting here! Also","useful":0,"cool":0},"R-K7R2WCGRCY8ZIGASblCA":{"text":"Happy I came to this little spot. Plenty New Orlean's inspired food options to choose from","useful":0,"cool":0},"hPpGzwDEGxSVTY5Ylmz82g":{"text":"The food was great.. we got the baby back ribs and the taste of New Orleans. Pretty afford","useful":0,"cool":0},"hF5VVSjyHk3ZICA5avSmiA":{"text":"The fried and blackened gator tail was awesome!!  The redfish cookery was awesome as well","useful":0,"cool":0},"sTwGQSPzAINfRYvAOzPyfw":{"text":"We popped into this joint on New Year's Eve to grab a quick bite before heading over to ch","useful":1,"cool":0},"3JcDtWaqzLUuqU-LVNObMQ":{"text":"I had the Jazzy Crab Cakes that came with Collards and Mashed Potatoes.   The crab cakes w","useful":0,"cool":0},"G9skXAevb6SA-X1T7004sg":{"text":"We had the taste of New Orleans and the gator bites. The beans and sausage were great in t","useful":0,"cool":0},"M2-mDgSzKa-m4f3BDG8buw":{"text":"Okay food, not horrible but not great either! The service so-so although Matt at the bar w","useful":0,"cool":0},"TWlcBFFRy-ufzajgaDG14w":{"text":"Oysters, oysters, oysters!! The oysters were huge and oh boy how delicious :) I'll be back","useful":1,"cool":0},"Dps8OPi96k4HOHked6Q-SA":{"text":"First time here, ordered the half rack of ribs it was good. Had chocolate mousse for desse","useful":0,"cool":0},"ww40YqRdumewKpw5Z_OExA":{"text":"Came here around 1pm on 2/28/14, last weekend of Mardi Gras. \n\nPROS:\n-Sit at the bar for q","useful":0,"cool":0},"SksG6zIO7c6SDpIC0ipRxg":{"text":"First meal ever in New Orleans and I was NOT disappointed. Talk about make you wanna slap ","useful":0,"cool":0},"1oit6wWWG-d9ScsdkcNDvA":{"text":"Must get the Taste of New Orleans! We stopped by as we were hopping around on Bourbon St; ","useful":0,"cool":0},"uYlNH4jtX3ClLq6GRcsk9w":{"text":"Late nite pop-in while walking Bourbon St... wanting to try their fried gator.  Our server","useful":0,"cool":0},"S71exbn0mcBPLCqAopSg8w":{"text":"This place is awesome! they have the best crab cakes and the best crawfish etouffee. Great","useful":0,"cool":0},"a9to2so0YO-svxmoXJmpEw":{"text":"We came here for a quick dinner before heading out on mardi gras.  The restaurant was pack","useful":4,"cool":7},"jLRkBNyM2_f5rhZmESfMBg":{"text":"Loved it, small but very nice little place, the food feels authentic (I'm not from here) a","useful":0,"cool":0},"MxF0w5wo7JnWOdtEsBv8Xg":{"text":"Wow! Service was great. The oysters were huge. The peel and eat BBQ shrimp are so worth th","useful":0,"cool":0},"1Ada0lelaWfhnU0CuRR3RQ":{"text":"Alright, my first meal in Nola had to live up to some pretty high expectations.  Olde Nawl","useful":2,"cool":1},"sJTcw9PP1TOP0qBrqLmPxw":{"text":"I was pleased with my meal here overall. We shared the fried seafood platter and gumbo.  T","useful":0,"cool":0},"zeQ_i8tV5g00NZBEahKUJA":{"text":"This was our first stop in Nola and I can really say that we couldn't start in a best way ","useful":0,"cool":0},"vYiSVOKrtVcydgRJX8kmLQ":{"text":"Sat in the courtyard and one of the mangers was smoking in the alley way with smoke blowin","useful":0,"cool":1},"h3RoTOsXG43rzMmTxexaSw":{"text":"Went here for a night time snack. My husband ordered the fried shrimp poy boy he said, wit","useful":0,"cool":0},"YCNf_09flM1jdcBZPCD3Xg":{"text":"Simple, but amazing food! The service there was beyond the expectation of good customer se","useful":0,"cool":0},"liDsP5XeYpzzeupjzqy8QA":{"text":"My friends and I were down in New Orleans for Mardi Gras, so we wanted to try some good cr","useful":0,"cool":0},"QHVcyzwv66s2mdXp7rAw8Q":{"text":"Great food and short wait time. Went during essence festival and was very pleased. Great c","useful":0,"cool":0},"YsXucaRZnBYePY8Thxg8bA":{"text":"Horrible wobbly balcony with wobbly tiny tables and tiny chairs. Served my $10 subpar mart","useful":0,"cool":0},"JSSduuGmiOXKr-SuhdilFg":{"text":"Fantastic crab cakes and red beans! Great service too! We've been to several places for cr","useful":0,"cool":0},"a79KRS8D6X4ttpo8SuF7UQ":{"text":"Who are all the people having good experiences here? In town for the weekend with friends ","useful":1,"cool":0},"HRjjzXif5n6M0oK9_7TyWg":{"text":"Mediocre at best. Waiter service was terrible, and the food wasn't good. He came three tim","useful":0,"cool":0},"Pb_0OBgBpmCQtuenSIK7VA":{"text":"We just got off the plane and were hungry. We had a list of restaurants to visit but this ","useful":0,"cool":0},"PmOYD7nNvI9PAXnbcDju4w":{"text":"We were walking in Bourbon street and some restaurants had long lines. We were too hungry ","useful":0,"cool":0},"8zL3RYdimzBjK5A5CATn7Q":{"text":"New Orleans never disappoints in delivering great food.  My friend and I stumbled in here ","useful":0,"cool":0},"fIgpIbNdPAJuJ29nfUXlhw":{"text":"I enjoyed this place, definitely a cheesy atmosphere but the staff was friendly and fun an","useful":1,"cool":1},"HmLKR8hDXiyg8qJwtBpU8w":{"text":"We went here for my birthday. The service and food were pretty good. Didn't know they had ","useful":0,"cool":0},"vLaEX5oha2ZvDexHNEM8_Q":{"text":"Wasn't expecting much from a bar on Bourbon Street, but the crab cakes, \"BBQ\" shrimp and b","useful":0,"cool":0},"fDlpB5lL3mp3ppPYUsTOGQ":{"text":"Waitress Jess A is one of the most observant servers ever. She was very attentive and made","useful":1,"cool":1},"ASFyzqjTReNCwg5ufp1aQQ":{"text":"Almost 20 years ago I visited Olde N'awlins Cookery when it was located on Conti Street.  ","useful":2,"cool":1},"7XRdDi4SAeX-YVIQiHoUtg":{"text":"I have a food allergy that made it hard to try the exciting food NOLA had to offer, and th","useful":0,"cool":0},"CJI7jqyt5uk6ZWCBiIYElg":{"text":"We loved Olde Nola Cookery!  We ordered the fried seafood plate+crab cakes and everything ","useful":0,"cool":0},"tmtWkWIuOEV9VxiV0XOpjA":{"text":"This place has a nice vibe being right on the strip! Drinks and food are great, especially","useful":0,"cool":0},"I3AUBVCfDWGMuS17Dzp6uQ":{"text":"Amazing food and the most friendly staff! Jarvis (sp) lured us in with his wonderful perso","useful":0,"cool":0},"ynN-FV2JoO15XQeeKdWozw":{"text":"We don't eat much fried food, but we shared a seafood platter and it was really good. The ","useful":0,"cool":0},"LoDOzQiBwNTYAXdW8tYtUA":{"text":"Do not go here. I only gave it a 1 star because I can't go lower. I got the ragin Cajun Po","useful":0,"cool":0},"C4BlIETLkiqeBXiFji4zaw":{"text":"Stopped in for an app and some drinks mid-afternoon. Initially was seated inside, but aske","useful":0,"cool":0},"R_E1WV__j4av6ZbxAX3spw":{"text":"I had an incredible experience here. Jess M was my server and she made my entire trip wort","useful":0,"cool":0},"z7oyWfbG0wU5ixzeKYfiQA":{"text":"Maybe it's all about the dish ordered. Our server said the seafood platter was big enough ","useful":0,"cool":0},"NsIP_KXEvVSGctUWaE6YaA":{"text":"I worked off my meal before even sitting down.\n\nIn fact, I lost track of how many times we","useful":4,"cool":3},"hfRHnVE1wvhA3zN6KH-JDw":{"text":"Food was really good, but don't get duped into the red cup double drinks. Not worth it.","useful":0,"cool":0},"vukm-w5Mhni7T82f5MKPfQ":{"text":"Ordered a bowl of \"Gumbo\" if you can even call it that..had no sausage, chicken, crab and ","useful":0,"cool":0},"Pxw3sm0uqVbI-dN9aYm96w":{"text":"Places like this one are a great hole in the wall find!  As you approach there is a host o","useful":1,"cool":1},"jlXqBLbjbiiXgaUkC0NFkQ":{"text":"Food was just ok - everything came out in a very thick sauce which made it hard to taste t","useful":0,"cool":0},"WVLOspAIGdP4xRPXmTrwvQ":{"text":"I loved Olde N'awlins. The value was good. The service was great. The food was exactly wha","useful":1,"cool":1},"KawROnuZuwRfrYlFNVBUiA":{"text":"This was our first stop in New Orleans and it was really fun!! I had a hurricane and a shr","useful":0,"cool":0},"jZF0ejmT-EWYK9sarvHHxQ":{"text":"Excellent food, good atmosphere and good service.  We had the New Orleans sampler. The cra","useful":0,"cool":0},"fFuCFwnRNPHGBQVmwXV94A":{"text":"You almost can't go wrong on Bourbon Street, but some places are better than others. Fortu","useful":0,"cool":0},"g5ZT7wSsyR5Lbe5pZkJ9kg":{"text":"Had the redfish cookery with crawfish étouffée and mashed potatoes. IT WAS EXCELLENT. The ","useful":0,"cool":0},"NzLAIzxYmpJpTDid8ZusxA":{"text":"Okay.. holy crap. Maybe I'm drunk, maybe I just have good taste in food but the jumbalaya ","useful":0,"cool":0},"Thgo7sHDB8gS_t0RmeDDQw":{"text":"Our original plans fell through so we ended up here. The food was decent but we selected i","useful":0,"cool":0},"MByuxRuTbMFIdWJgfXVE1w":{"text":"4 adults, 1 toddler,  Saturday  night,  very busy restaurant.  Im giving  3 stars for food","useful":0,"cool":0},"OUSd-83ovRE3upRYnFk6Fw":{"text":"NOLA!  What a great experience!  We were lucky to get a seat on the balcony and Fee was ou","useful":0,"cool":0},"MXzUPVcqh5ng9dtiuk_V3g":{"text":"Delicious!!! We had a mix of many things, the Cajun pasta, the red beans and rice, the chi","useful":0,"cool":0},"XHuI6UhoLpFraZbZvTajzg":{"text":"The gumbo was good.  The crawfish etouffee was excellent.  My husband and I splitted this ","useful":0,"cool":0},"GUDsMqnjsg0RrT9QYjAYfQ":{"text":"The food was delicious and the service is great I first I ordered the seafood gumbo as an ","useful":0,"cool":0},"oMA1Hx5y22IgE6LwJB8itQ":{"text":"If you ask a cop on Bourbon Street where to eat after 11pm most will tell you to come here","useful":3,"cool":0},"Cm7PZAYpFpOjaOL1kgmGgw":{"text":"Delicious seafood options. Catfish po boy was amazing as were the crab cakes and eggplant ","useful":0,"cool":0},"L1hzQJWurZTQEZAPVZmO1A":{"text":"My first time in New Orleans and my first meal was at Olde Nola Cookery for my first Shrim","useful":0,"cool":0},"oqW6DAQy25uqNvnqak2bNw":{"text":"The amazing crab cakes with étouffée rocked! Great experience! Fabulous service and waiter","useful":0,"cool":0},"WWf-nklIKYVwk1-xRMBK8Q":{"text":"Great food, great service! Can hear the sounds from Bourbon Street while dining. We had a ","useful":0,"cool":0},"pxgPaZcwyrYrxHc_SSH2yA":{"text":"Love the atmosphere..food was delicious. Our server Chris was so nice to us three girls fr","useful":0,"cool":0},"gJe9B1TZqfGT5yjEkWATvA":{"text":"Perfect spot on Bourbon to get some really good, fresh seafood! Crabcakes with crawfish sa","useful":0,"cool":0},"Wp2I8t7JlM1jXkEX0BuSaQ":{"text":"I got the crab cakes and the taste of new Orleans, which has gumbo, crawfish etouffe, and ","useful":0,"cool":0},"eOywx3GpAxjP0FRQa3PiZw":{"text":"For some reason a sheriff seems to be out in front of the place every time I walk by here.","useful":3,"cool":0},"9oAVnf0oEitqLjXxLr17-g":{"text":"great little spot for a quick lunch if you're in the area and wanting a quick bite. they h","useful":0,"cool":0},"JaTPinff9PXDri9dCI01xw":{"text":"2 Things: Cajun Poutine... and Kahlua Chocolate Mousse Pie!! Wow. Use the yelp app check i","useful":2,"cool":1},"ldlh7CFZO7EN5gNZkCmYqA":{"text":"Food was awesome. Had fried shrimp, oysters, gator, ribs, blackened chicken, Cajun bloody ","useful":1,"cool":1},"RBcxDK8RkVHYgnvy1axEsQ":{"text":"The fried seafood combination is a lot! But it is fried seafood and too much oil for me. T","useful":0,"cool":0},"vLeINOAPNA5Ht-kIAarGrQ":{"text":"Came here at 1 AM with my mother and got the crawfish cheese fries. Came back later that d","useful":0,"cool":0},"d7n6Pq0p22aF_kX859ntAg":{"text":"I really was enjoying myself with my family and was really looking for some good NOLA food","useful":1,"cool":0},"kJpeVXJmtKIyuTZhOPFUpQ":{"text":"Great food and nice ambience. This was the first restaurant we tried since touching down i","useful":0,"cool":0},"GGEiN2l4ZvxIVGiyJq6_oQ":{"text":"Bobby was our waiter and he was awesome! The food was yummy. Definitely will come back.","useful":0,"cool":0},"HsYeebWOhC7KBX00cYtnfQ":{"text":"The food was what I expected for the price.  I ate my first oysters here, so it will alway","useful":0,"cool":0},"u05IUsFGnojX2Li0-UQJKQ":{"text":"Not a one star place but need to balance the clear Yelp star inflation going on here. It's","useful":0,"cool":0},"p3oVGQRomp5afXA7UBrzgg":{"text":"We just waited 20 minutes JUST to get our drinks and when I complained the manager told me","useful":0,"cool":0},"7n0DL1nJfI481liTElxSMA":{"text":"Welp, it has 2 floors which is nice. There's a deck to look over the street and most impor","useful":0,"cool":0},"-sV8OyJEzw1ouio6BDUrng":{"text":"Don't let the visual exterior of this place detour you.   The interior is historical, well","useful":0,"cool":0},"Nefs3BIX8cJkCiCif7kV2g":{"text":"This is one wonderful place to get some delicious cajun/creole food at a reasonable price.","useful":0,"cool":0},"vPoUUQhQ71WN4LXrkfQj8w":{"text":"They say bourbon street food isn't that top notch but I'm telling you stop by right here a","useful":1,"cool":1},"yaPqeL5oa_jqVX0mOnsONg":{"text":"I was looking for a place to eat lunch on a Tuesday afternoon. I was waived in by a server","useful":4,"cool":2},"EIW85NYoQb-6QtWPfZLVfw":{"text":"Stopped in while strolling Bourbon Street after a long day of walking around New Orleans. ","useful":0,"cool":0},"9EwFZdR-hlm3ajrOm36Ykg":{"text":"Thank  goodness this place closes at 2am. We came really hungry after walking  Bourbon St.","useful":6,"cool":5},"lQl9UAQZnSobOH-Hvf76Vg":{"text":"We enjoyed this place on our last night in NO. I had the trio with red beans n rice, jamba","useful":1,"cool":0},"3w5yZrWmakxVJgQKs_EDPw":{"text":"My go to spot when in town.  Not a big seafood fan but I love their fried shrimp.  Great b","useful":0,"cool":0},"IX00DDKVgdno5DnfWzG6nQ":{"text":"Everything we ordered was delicious. It was a bit of an inconvenience to get to due to the","useful":0,"cool":0},"OUmwT_PvXZbpXQX4wBUB2w":{"text":"The food was good the first two times we ate there but the service wasn't very good at all","useful":0,"cool":0},"uVtmczQDPahZ3xu6y_GM1A":{"text":"I've been to NOLA tons of times & I don't know how I've walked past this place so many tim","useful":2,"cool":0},"JE1M3R_Ej36Crxj9V4K8EQ":{"text":"Delicious food and awesome drinks! We had the taste of New Orleans, the crab cakes, Bloody","useful":2,"cool":0},"7eITU4B0x7iqEKVC02CnlQ":{"text":"Great authentic food our server Bri was very sweet and helpful . Food was delicious crab c","useful":0,"cool":0},"n-cNWFrL00GbEpr3_s_frA":{"text":"I looked at this spot earlier in the day but the guy out front gave me eye contact to come","useful":0,"cool":0},"QwKpHfaCOFascmTeifrhEg":{"text":"Had the blackened chicken with red beans and rice and mashed potatoes. Plus thanks to Yelp","useful":1,"cool":0},"zSXc7ZVNazq8FDQOzyWOaw":{"text":"Pleasantly surprised. Friendly staff; not your typical Bourbon Street carnival workers. Go","useful":1,"cool":0},"tv98BUaQr1GmWqSGZsneKg":{"text":"Our waitress Fee, was great. But we waited over an hour for our food. The then it came out","useful":0,"cool":1},"pzdYtOkYFg0ESyiWhaDxrA":{"text":"Hello. I am from Los Angeles, CA. Upon heading back to my hotel to catch a Lyft to the air","useful":0,"cool":0},"euA0Uu3lXl0HhyA-HuWBgA":{"text":"A bowl of gumbo tells you how good restaurants in NOLA are. Here it's mediocre. Good flavo","useful":0,"cool":0},"5_Me54f2PNmdPIj3P5_qMA":{"text":"Food is just ok, the atmosphere is pretty cool. But, there are other place I would recomme","useful":1,"cool":0},"09W5DXwoRgyKubtEmKfYaw":{"text":"look the food is super amazing and the food is super amazin. That girl jessy shes so profe","useful":0,"cool":0},"1dTmaQ11ajclA1NACIg3Eg":{"text":"Casual restaurant. Service with a smile. Redfish was delicious!! Red beans were amazing! V","useful":0,"cool":0},"GjTCfToY29UyDpmfN-WvFg":{"text":"Really great food! We've been driving from San Diego stopping along the way and this is th","useful":0,"cool":0},"g-eDPdVYpVvvn2Cx5ZnSqw":{"text":"Uninspired and bland, pedestrian and routine; don't expect any brilliance here... pricing ","useful":0,"cool":0},"TjFVO9Nisi6E89Q_8pkrwg":{"text":"Pleasantly surprised.  Thought I was going to be eating food from a sports bar due to all ","useful":0,"cool":0},"Ew73cSWTDy4PJbdvbimx8Q":{"text":"Pro: Gator tail bites, good hearty meals, great waiter service\n\nCon: a bit salty and thick","useful":2,"cool":1},"-oV5g7OacVWEMqx_eJWckw":{"text":"We happened to discover Nola's by luck while searching for one final meal before leaving N","useful":0,"cool":0},"O3sbfFIRlkW5JqRS_3uYKQ":{"text":"excellent food excellent service. great taste of louisiana. very very important u get a fr","useful":0,"cool":0},"eBikxzg2n0b4zTt_RBJBow":{"text":"Average. I had red beans and rice which was pretty good. Wife had a shrimp poboy that was ","useful":0,"cool":0},"9Ue7u_gYOP3AVJGPmiYHBQ":{"text":"The food here is very good. Jambalaya, gumbo, and blackened chicken were all extremely del","useful":1,"cool":1},"QIJyuGENk7KKjJDmDv56hQ":{"text":"The taste of New Orleans was very good. The seafood platter was excellent also. Great serv","useful":0,"cool":0},"vMAkSdgohWCQnzRJag9ivQ":{"text":"The drinks were weak and they took long to come take our order when the restaurant wasn't ","useful":0,"cool":0},"CX6Ye79P4JBq7krsny0WOg":{"text":"We were so glad they were open for Christmas eve. For appetizers we had their famous crab ","useful":0,"cool":0},"IWvRpyEjiDNA3r4cY5Db4A":{"text":"Great place to eat...the shrimp fettuccine Alfredo was fabulous! Server was very attentive","useful":0,"cool":0},"5_pr6ClpKmEWWFySBFjaew":{"text":"I saw an ad on New Orleans Official Visitors Guide 2015 about this place winning an award ","useful":0,"cool":0},"u2sOEgQTrMtn-SJoDR6kaA":{"text":"Mr. Jarvis showed me a menu on the Bourbon Street sidewalk and talked me into trying this ","useful":0,"cool":0},"PeyURlXbxtOK-MuH1ELsng":{"text":"My last visit was over 15 years ago. However, was quite confused by it's new address on Bo","useful":0,"cool":0},"5efN5fWopL0URQEgkmsPNg":{"text":"I am not one who enjoys posting bad reviews, but something I enjoy even less is a bad expe","useful":0,"cool":0},"vvcnypfhO8gYF2Y4wIRYPQ":{"text":"Great service and great food.  Seafood gumbo was awesome .  Love the atmosphere.  Nice pla","useful":0,"cool":0},"0ucOCd9iSMf3n0cbYmywXw":{"text":"Great drinks and service. I really enjoyed my shrimp poboy and golden margarita. The poboy","useful":0,"cool":0},"w0sjUEQ8OqvzceAij84ASg":{"text":"Doorman rude. Would not close door despite cold draft. When he was told to close it he ope","useful":0,"cool":0},"MzO6fqt4Ew-CZ5OO-vFLug":{"text":"This place was really yummy! Very authentic NOLA food and great drinks. The Bloody Mary wa","useful":0,"cool":0},"wT58WgaipgiKRY7pZ7zbsw":{"text":"Best duck hands down in the quarter. I recommend double red beans with the meal instead of","useful":0,"cool":0},"OkoFEbeHxfoMx2By_owu0Q":{"text":"After having a horrible experience at star steak and lobster, I decided to come here and a","useful":0,"cool":0},"SsR63zJNQsC0utfWeFCA2Q":{"text":"We had the seafood platter and it was delicious!! Going back today for the gumbo.the servi","useful":0,"cool":0},"bPUV9-FUg5KHPHAzdnPsMA":{"text":"First restaurant I visited while in NOLA. Food was good and the service was great. I had t","useful":0,"cool":0},"q3oMkI0lg2r5t_D7rFu-5A":{"text":"Go up to the second floor to walk back and forth between the balcony and your meal!","useful":0,"cool":0},"52Vfc0xTpXHS-D0H06twLw":{"text":"The beans and rice was out of this world! The crab cakes had the perfect consistency of cr","useful":0,"cool":0},"Yt3LAjrJxWMs90SJd_ZWXw":{"text":"Takeout after a long day of sightseeing. Good food at a reasonable price, close at hand in","useful":0,"cool":0},"pHIIXMr8_XM3dr-X791zYQ":{"text":"We ordered Taste of New Orleans: red beans and rice, crawfish ettouffe, seafood gumbo, the","useful":0,"cool":0},"m5U-1XbRjWXwKR8s05W9ug":{"text":"Wasn't really hungry when I walked into this restaurant but after walkin on Bourbon and be","useful":1,"cool":0},"ijISk5wxUlBxj9zdyTiENw":{"text":"Was stoped by Mr BOURBON and given a menu ... \nNext day we returned to check them out \nJes","useful":2,"cool":0},"hDX2L8ANg9uXqiYsj88L9g":{"text":"BEST GUMBO ON BOURBON ST.!!!\n\n\nI have no bias. I have never heard of this place nor was it","useful":1,"cool":1},"s6a8nSxIcyhXxaV5gJ1Gug":{"text":"Just stopped in for dessert and Bailey's and coffee. Both were delicious, and service at t","useful":0,"cool":0},"LhVkh2wY8d7yBt3P74C2Dw":{"text":"Stopped here for a quick bite at the recommendation of our hotel. We were not disappointed","useful":0,"cool":0},"nP0UlXbT-owmvFnWeEFGnA":{"text":"I spent quite a bit of time trying to decide where to eat my first time on Bourbon St. My ","useful":0,"cool":0},"YKB9WG8Y39wQacQev8j2ZA":{"text":"Was good but not so exceptional.  We started with a Caesar salad which was very plain and ","useful":0,"cool":0},"xrRCDCYvyL2tXuph89847Q":{"text":"The food was ok. We love the bread pudding. Not too sweet that how we like it. Very nice m","useful":0,"cool":0},"RbHt0T62BB_4oWRZVDxgSA":{"text":"Stopped in for lunch.the ambience was nice. Had good zydeco playing. The waitress we had w","useful":0,"cool":0},"gpfeW5Y_BzxTze632XvIUg":{"text":"Well the poo boys were awesome and the waiter was good \nBut when our bill came at 1 am the","useful":0,"cool":0},"1T34nzafSzzDGzMa30oDug":{"text":"Ok sooo the food is sooo good tonight I was served by Felicia Brown she was pleasant and p","useful":0,"cool":0},"puy8QO6mAW2qhZ72nomYOg":{"text":"Excellent food - the seafood was great.\nThe free desert thru Yelp was also great and we ha","useful":0,"cool":0},"lY0R0wQir2Y-fvBr1WXOmA":{"text":"Great value for a ton of food and the service was excellent. Our server Jess M was friendl","useful":0,"cool":0},"6LIWND5XmhFXqXyedQcZlw":{"text":"Amazing food at reasonable prices. Delicious Étouffée!!! Ask for Bobby as your server he i","useful":0,"cool":0},"xe98c-bG7CspgKP3XQxU4Q":{"text":"Staff was nice, good place to rest feet, have a beer and watch some sports for a minute. H","useful":0,"cool":0},"o0KJDdag2Djyi5Nu537frA":{"text":"This place was just ok. Got the crawfish etouffe   but there wasn't much crawfish. Pretty ","useful":0,"cool":0},"vW6XlT0PuYNRF7vHd5N8oQ":{"text":"EXCELLENT Gumbo. Ate there after arriving and they have lots of sandwiches and po'boys, pe","useful":0,"cool":0},"PezEQ6TN4A_FLhK96dr04Q":{"text":"Was greeted outside by the doorman who was very professional. Jamaal was our waiter and he","useful":0,"cool":0},"PY5CWutAJtvUOnjsUZYDXA":{"text":"This is the worst experience I've ever had in a restaurant! Had friends from out of town, ","useful":0,"cool":0},"7N6xoO_SHYkXFwTgtSlwlw":{"text":"Solid choice for the French Quarter. The Taste of New Orleans with cups of gumbo, crawfish","useful":1,"cool":1},"yMvQ5twpEXKl6MchPUD2Zw":{"text":"Best Bloody Mary I've ever had.  The bartender is great, the food is great and the portion","useful":0,"cool":0},"c-DogRsEpj0r1NJO5sWdZg":{"text":"Was here a couple of days ago and what a mistake it was.The food was absolutely  horrible.","useful":0,"cool":0},"mSgOEuqDA7zxwPszMZ0k2Q":{"text":"This place is part of a chain of Oceana Grill.  I ordered the Ultimate Seafood platter whi","useful":2,"cool":2},"xBC1rcy2Cq9HzyQHMe3CKw":{"text":"I had hoped to get a taste of New Orleans cuisine here.  Reviews looked good.  Well, the f","useful":0,"cool":0},"bbTGEdOmEq-X7AeNf6_4Bg":{"text":"Great food! I feel like this is a secret place because when we came in there was no line o","useful":0,"cool":0},"pvzGw4R95XKSlQLX1vR1Cw":{"text":"We sent our food back twice at RedFish Grille and came here. Our waitress \"Trina\" made our","useful":0,"cool":0},"VfgbcDv6NMXld2BwyJOvFg":{"text":"Dropped in here for late night food and drinks following the Sugarbowl. There was a line b","useful":0,"cool":0},"DMiX95WusuMJ6W0xHrGKzw":{"text":"I came here for early-night drinks and I got Hurricane and Tidal Wave. They're good.  We g","useful":0,"cool":0},"GTtwlAJzhUuLqYeIwCsUhQ":{"text":"Stopped by this colorful restaurant the weekend prior to Mardi Gras and the ratings did no","useful":0,"cool":0},"cZOy20gqwQBxjzqORnIuVw":{"text":"Food was GREAT! The atmosphere was amazing! The staff was friendly and attentive. Will com","useful":0,"cool":0},"tLZjgNT216aW784UtE54Ug":{"text":"My girlfriend and I went here kind of late, around midnight, and there was a decent crowd ","useful":0,"cool":0},"PIMxqjbWLONyQmALU9Mgbg":{"text":"We were in New Orleans four days. This restaurant had the best food and service we experie","useful":0,"cool":0},"RbDIC6y014MK-SazfLrTpg":{"text":"Had the blackened chix po boy. Really good. Lots of chicken on it and the sauce was great.","useful":0,"cool":0},"1C34KSPWBWBSAvSY0QXanA":{"text":"DAMN! The crawfish etoufée was AMZAZING. I could eat this dish all day, everyday. Great Se","useful":1,"cool":1},"dE5DpANNwlC_RGbP7d8pSQ":{"text":"The Bahama Mama was not like I  had in the Bahamas.  The crab cakes, even though they were","useful":0,"cool":0},"iIQp4XFwHjYCsruaMpiKEA":{"text":"Started the crazy walk through the French Quarter and a great Jazz band was playing right ","useful":0,"cool":0},"0URHAaxJLXEX077JMfDeMw":{"text":"Good food at reasonable prices and friendly staff. I got the Taste of New Orleans, husband","useful":0,"cool":0},"lNVkDwDK8LSvHX3DLMx5Pg":{"text":"This is the first place that we ate once we got to NO after being on the road all day beca","useful":0,"cool":0},"CA2zcArWePC-fiRs2-UZqA":{"text":"Great food at a great price. Tje scenery was great. The service was incredible and it was ","useful":0,"cool":1},"jlU8L6jAd2WQKAYMhG4JGw":{"text":"First time New Orleans and First meal was at this restaurant. Crab cake was amazing! Red b","useful":1,"cool":0},"GlTWMpD02sGePrkm28WlUw":{"text":"Looks like a tourist trap, but has pretty decent eats. \n\nOrdered the Taste of New Orleans ","useful":0,"cool":0},"6fVwz7Fa3J9O23Vt2lA1iQ":{"text":"6/25/16 7:30pm \nFood was pretty good. Server (Kasey) was sweet, but very poor service. All","useful":0,"cool":0},"ELWCa6H0DPXBAGUWCHq9vw":{"text":"Packed house, there were 8 of us and we only had to wait about 5 minutes. The manager was ","useful":1,"cool":0},"2ZNI_B9yTwXOomdBm-37Jg":{"text":"The red beans and rice were delicious. I ordered a blackened red fish w crawfish ettoufe y","useful":0,"cool":0},"yybbkBfun5C6gkeK8fF76w":{"text":"We had the gumbo and the crab cakes with gravy.. AMAZING! I'll never be able to have crab ","useful":2,"cool":0},"v2R9AU9kt8Tsi6MPTAzGeg":{"text":"The best gator bites in town. The shrimp po boy is excellent too, large golf shrimp and th","useful":1,"cool":0},"P9AHkgm-ktApBqDlRBFexw":{"text":"I ordered delivery from here during my stay in New Orleans. I ordered the Taste of New Orl","useful":0,"cool":0},"9Kdjerv22j-LtfzzUjiUmg":{"text":"This place was so good. It wasn't our first choice on New Year's Eve because we were looki","useful":0,"cool":0},"FJneG33SQXFimVfGveJiaQ":{"text":"Hands down best food I've ever had period!  Came back twice for crab cakes in three nights","useful":1,"cool":0},"xGHx5a7sUc_T1XQX0lzniw":{"text":"An authentic hole in the wall on bourbon street  ! IN A GOOD WAY !!!  The service is amazi","useful":0,"cool":0},"mJoo6MHHjC9uBrQMbsWDyw":{"text":"Sooo good. Loved the service and the zydeco fries (not on the menu) could make a whole mea","useful":0,"cool":0},"lIPhXeUAy6oJOMv5Qn65NQ":{"text":"Waitress jona was great! Food came extremely fast n smells n taste great! \n\nGroupon deals ","useful":1,"cool":0},"q6iiSMNu7Q1guiyUiddU_Q":{"text":"Our server was exceptionally sweet and swift with our order, even though it was a busy Sat","useful":0,"cool":0},"LC3Cfzr-grmYExUr8UGaCg":{"text":"*** A solid 3-star joint ... it's best for fried comfort foods. ***","useful":11,"cool":7},"fWncNNTjMfqmyzQb16N7lg":{"text":"Isha's review was on point about how I felt about the Seafood Gumbo. Flavor was yummy. But","useful":0,"cool":0},"_LonLJRAZxivjoQgsJXUgg":{"text":"the Location on Burboun street is convenient, but I did not find the food to be very appet","useful":1,"cool":0},"A_B7U_XhtHBmhYTRN899JA":{"text":"Decent food for late night desperation.\n\nWe were starving, and after eating junk food the ","useful":1,"cool":0},"cxODIorI3bYl4SMgf_V6kA":{"text":"Servers were very attentive! Good food and right off of bourbon. We wanted a simple and qu","useful":0,"cool":0},"YzQS2SQ9O1CB2W5RnDTwVA":{"text":"The atmosphere is very laid back! The decor is has an old rustic feel. Kind of close to ot","useful":0,"cool":0},"BO659_O_cRkd9EGcSIiuww":{"text":"The food and the drinks was absolutely delicious. We was seated on the balcony and had a c","useful":0,"cool":0},"PFnS0PqRvTqM8bnBAP58JQ":{"text":"Food is delicious and great service !! Get the catfish platter it's good for two people an","useful":0,"cool":0},"3HeJUjczHL1-Y9F2PMeVDg":{"text":"A really great time, crab cakes were very crabby!!! Lots of good crab. The shrimp po boy w","useful":0,"cool":0},"bqYVRkpBzuIsd3NofL9NYQ":{"text":"The server and host  were really nice and welcoming.  I wasn't very hungry so I ordered an","useful":0,"cool":0},"MNDeB8LjvpZBsvfpw4Yq7A":{"text":"Everyone kept saying you have to go to Olde Nola Cookery it's really good, that's all I he","useful":0,"cool":0},"EAW_dgFqEJsJexNaia8_NA":{"text":"Freakin awesome! Great drinks, awesome people (manager joe and bartender Brent)- they were","useful":0,"cool":0},"yOnasKHxJutkX5hYPWsP4w":{"text":"It's smelled like old mop water in the restaurant. I was given old fries. Probably the bot","useful":0,"cool":0},"ro0UTV6IwUDPDtIpP_60YQ":{"text":"Manager was extremely rude. I ordered take out with a strawberry cheesecake instead they s","useful":0,"cool":0},"_nFnqbiGRgT7Y6v2AFM1ug":{"text":"Had the Taste of New Orleans and my fiancé had the Jambalaya... Both dishes were very good","useful":0,"cool":0},"qxSEj8rzaqk8qquLnSSF5w":{"text":"This was our first meal in New Orleans. We had the barbeque shrimp and Poboy with shrimp a","useful":0,"cool":0},"9DUWWH1PW_MNTibEebKC_w":{"text":"Stopped in New Orleans for the night. We found old nawlins cookery through yelp and I'm re","useful":0,"cool":0},"ABzoCKfoeyegcfnPpGGo8g":{"text":"Dined at this restaurant on a Sunday evening, so the wait for a table was minimal (maybe 2","useful":0,"cool":0},"xRhpQAPVPFKHT_Up3i6k6g":{"text":"Very laid back and relaxing atmosphere.  I ordered the alligator to start with, fried of c","useful":0,"cool":0},"p_OOZMaQww305OlmskUj3A":{"text":"I loveeed my experience, my waiter Kentrell was great!! She was very attentive, knew the m","useful":0,"cool":0},"6RQnyCdpLJVzI1X-rq3TAA":{"text":"Stopped in for a late bite to eat. This place did not disappoint. Food was delicious, drin","useful":0,"cool":0},"zTkAEJ34M78M7cFPltJllQ":{"text":"The fried gator bites were sooooo good. The grilled ones were tasty but I definitely prefe","useful":0,"cool":0},"X1ihlWPpHMfS0f_uTHAbng":{"text":"FOOD WAS AMAZING. Had BBQ Shrimp, crab cakes, and jambalaya pasta. Each dish was full of f","useful":0,"cool":0},"_QMwb8IBh9hCgaKSWtz43w":{"text":"Food was decent but service sucked. Waiter was a jackass and that makes a big difference i","useful":0,"cool":0},"LCkRgey5bL3RiKTnnD2tvQ":{"text":"Only giving it 2 stars because of our very kind and personable waitress, Jess. Unfortunate","useful":0,"cool":0},"ar6hLNhaRbOtR5VK1rQsAw":{"text":"The day after the St. Patrick's parade...this place was great for the brunch/lunch.  I sta","useful":0,"cool":0},"YJfp2QxyQ8bBgLQrmAV2mA":{"text":"Great location and no wait compared to other restaurants in the area.   Food was excellent","useful":1,"cool":1},"BZ6Nl5naaYHt8XkZuzCwrQ":{"text":"Anticipation of an amazing fish sometimes hoes unwarranted. Although I'm not crazy about s","useful":1,"cool":2},"aOcGV-jrJ5AgYuEMBYXApQ":{"text":"The food and service here was awesome! David P was very friendly and greeted us with a smi","useful":0,"cool":0},"5H1Ca2MtX6J7IWTuGg8sYA":{"text":"We had a table of 8. We went around 11:30 am for lunch on St.Pattys Day.  We were seated q","useful":0,"cool":0},"zxrz6a8lKnagpzZ8SbU0rQ":{"text":"To be honest I haven't taste the food yet. Got it to go buuuuuuuuut this review is on serv","useful":0,"cool":0},"tWkKYslFISUbCaliui5jPA":{"text":"Recently hosted a corporate dinner for 65 here and it was fabulous.  They gave us the enti","useful":0,"cool":0},"miI3vgoGnfEnIwCdrWm9nA":{"text":"I visit here every time I come to New Orleans. I've only had one bad experience with servi","useful":0,"cool":0},"Wk3FUq6AK_-dPKLT5aEl9A":{"text":"Great food and service would go back there again when back in town. Got the Po-boy delicio","useful":0,"cool":0},"L9CSsaC1hWqutuX1iTMMEA":{"text":"Had the \"Taste of New Orleans\" and my friend had the Mardi Graw pasta. We both liked our f","useful":0,"cool":0},"eXlKZ_bvfV0c9JgLaRk__A":{"text":"Don't really understand the rave reviews for this spot. Definitely a tourist trap. If you ","useful":0,"cool":0},"3wAplHs2w6sNdx5boWJXYg":{"text":"We were very disappointed as this was our stop for lunch and my first poor boy experience.","useful":0,"cool":0},"eFAH4N8B3rcNTY6Hve1KQA":{"text":"The atmosphere was pretty interesting, but the food was just ok. This place feels like a c","useful":0,"cool":0},"owK89pwLQU5Z9_C1ic1J9A":{"text":"This place was great devin our bartender was great and the food was delicious had the tast","useful":0,"cool":0},"HjS2n9to2GsQMCEnE6fkVw":{"text":"Fantastic po boy and carb cakes! Recommend to me by a local and really glad I stopped in. ","useful":0,"cool":0},"ZBw_MKVymuLcjoEZepLONQ":{"text":"Got the catfish po' boy on a late Friday night. Wasn't cheap but was delicious and got sol","useful":0,"cool":0},"uPexNXVEDXchuXi77hjqWA":{"text":"Good food, big portions, and quick service. If you want a huge plate of fried shrimp with ","useful":0,"cool":0},"n-XOlC1CZ_Sutma1i_juKw":{"text":"This was the first place we ate when we got to NOLA. We had had such a long day with delay","useful":1,"cool":0},"2hkueGEzW1h65WfoOCPD6Q":{"text":"This is the place to go for the local taste of New Orleans.  It is in the French Quarter s","useful":0,"cool":0},"RAM678OHkvGG77o7GfYSNA":{"text":"Food was great staff was awsome never had to ask for anything. John B waited on us earlier","useful":0,"cool":0},"9Exljsz4tcFAKofxfJ3Q8g":{"text":"Just.WOW! OMG, the Jambalaya pasta was insane! And at the table we had the red fish which ","useful":0,"cool":0},"mbMjjInddPdYTGmh6veLLw":{"text":"So, I was honestly shocked at how great this place is! Especially being on Bourbon St, we ","useful":1,"cool":0},"TJsDHm_4k0scHa23Y1w0lw":{"text":"Really good local food and a friendly staff.Music playing right outside the door . can't a","useful":0,"cool":0},"A4nHoMzaQUdAINJA-HiI-Q":{"text":"I had the Blackened Duck with Crawfish Cream Sauce. There's so much food in New Orleans th","useful":0,"cool":0},"nYGzS1M8xlFyE5Mg2ABMnA":{"text":"Sunday was our last day in NOLA and we wanted to end with more creole food. We didn't have","useful":0,"cool":0},"MT7yhjeX_4ySEI5ZxnxUVQ":{"text":"Blacken chicken po boy was excellent with great atmosphere in the heart of French Quarter.","useful":0,"cool":0},"3JBNOTLf7YnmBsAxGFq_jw":{"text":"Excellent food & service. I had the seafood platter and the Bloody Mary. Both highly recom","useful":0,"cool":0},"PRT9VXiObaWa8Lv2liUFzg":{"text":"Husband and I went here because the reviews looked decent and it was close by our hotel. W","useful":0,"cool":0},"0117S6z0fblOBSO8nzNITg":{"text":"Catfish platter with blackened crawfish! Delicious and can feed two people. Great service!","useful":0,"cool":0},"Ja6YJW6St3l4I63VRAljXg":{"text":"My barback recommended I try this place after work one day since they offer a discount for","useful":2,"cool":3},"jqukpj4QmCfsXXyg7Sda_w":{"text":"Some of the best catfish in NOLA and a fun atmosphere with a SUPER friendly server Brittne","useful":0,"cool":0},"bJAmCTM4ocpmaQH9OPoWAA":{"text":"I would have given this place 5 stars based on food because it was incredibly good.  I had","useful":0,"cool":0},"i-6zWzbTRn_Ubc3rRaC6YA":{"text":"My friend and I went here based upon the Yelp reviews and sheer hunger to find anything ne","useful":1,"cool":0},"D7YPB32mT1OCW4V7qjlw4Q":{"text":"Everything from the staff, building and food was amazing. Price was great. Bloody Mary's a","useful":0,"cool":0},"FFM69jazxSc72DVqGY-P0A":{"text":"Unfortunately my fried shrimp was chewy and horrible. The coleslaw was delicious. My son h","useful":0,"cool":0},"-yOaTgdkdUSDiDYvBm0ruw":{"text":"Not a fan of this place, I ordered the po' boy and it wasn't anything crazy. It didn't hav","useful":1,"cool":0},"fVT_dPKxmBppYp9zuxvehQ":{"text":"Stopped in for dinner and sat at the bat. It was not very crowded yet the bartender was no","useful":1,"cool":0},"qxsaZ36GnQbVmmq-oQ52UQ":{"text":"Food was excellent and served quickly, no issues.  Cocktails were strong and very well cre","useful":0,"cool":0},"_njGuz5-MrBdDx9IRlLEog":{"text":"\"The Best of the Beat of the Best, Sir!\" Let's be clear. This meal was profoundly deliciou","useful":0,"cool":0},"EAFObvwqK-6BvQ8dVkjpDQ":{"text":"Best crab cakes and hurricanes in town! So good I ate here 2 of the 4 days I was in town.","useful":0,"cool":0},"O7jBJQH0sZiy4kDIGHMlOw":{"text":"We popped in randomly on our walk of the Quarter because we were starving and didn't feel ","useful":0,"cool":0},"irxgz4OByjA0z2F3SISg3w":{"text":"My friend and I are visiting from Florida. We were walking to oceana when we walked by thi","useful":1,"cool":1},"4QFl089Iwois16zJ7XkKag":{"text":"Had the crab cakes and gumbo, Food was good but warm, wasn't hot at all,almost as if it ha","useful":0,"cool":0},"HE7xXpB55wEod1UcjQnk2A":{"text":"We went at an off time of day around 4 and I can say the food was still very good. Fried f","useful":0,"cool":0},"bjBS2Hq8wLmz6Zcm6MUtIg":{"text":"I tried the Taste of New Orleans, which includes gumbo, red, beans and rice and crawfish e","useful":0,"cool":0},"BXofxw-9FEFAphCl2u_ReQ":{"text":"We LOVE the seafood platter here. And the gumbo is amazing!! Drinks are awesome too. It's ","useful":0,"cool":0},"uAyL2siTi-_PerH200LUkg":{"text":"My sister and I wanted a bite after seeing a show at the HOB last Tuesday, and passed this","useful":0,"cool":0},"cdl6a12V3WnEBuO8YgbvEQ":{"text":"Awesome. If your looking for a great place in New Orleans to grab dinner look no further! ","useful":1,"cool":0},"HkXLSSFvYSDq0UD2lLhXeg":{"text":"Strawberry cheesecake was so good. \nMy food was ok. I guess it was rushed since it's Essen","useful":0,"cool":0},"Gkvms2z3Knu16ARNUrRopg":{"text":"Right on Bourbon St, this was the first place we ate at after arriving to New Orleans late","useful":0,"cool":0},"MrK7GUitsvhVmZ61Ga_rtw":{"text":"Food was pretty good. Good gumbo, great fried platter minus the hair into fries.","useful":0,"cool":0},"5soX5V-HgyDBwsaKTaBM9Q":{"text":"Great service and food! \nI started with the barbecue shrimp.. very tasty and of course mes","useful":0,"cool":0},"8IrXFJXfR0hGqa6SseTn-g":{"text":"Great food and fantastic service. Would recommend this restaurant for anyone wanting great","useful":0,"cool":0},"30PMYOfT44N-Oo_0l7BJ_w":{"text":"Stopped in for quick bite and ordered 2 salads and the Cajun fries. For the most part the ","useful":0,"cool":0},"_2hfltakSD7h2WAqHvQiEw":{"text":"While walking on Bourbon street, my co-worker and I were looking for a Cajun pasta place. ","useful":0,"cool":0},"oCF1vlozC7cnz3XlQ5LuDw":{"text":"Just terrible. Food was bland and greasy, bread was stale,  and server was too busy chatti","useful":0,"cool":0},"zLZ9CtEOPom90wWXWNFmPA":{"text":"My wife and I split the seafood gumbo, gator tails (1/2 blackened and 1/2 fried) and the s","useful":0,"cool":0},"apVP_-QIaSozMOWrc8DcNg":{"text":"I got the crawfish etouffee. The roux had a really nice flavor, but considering the price,","useful":0,"cool":0},"JjVgGuwh3bvBaiZLoRYYSQ":{"text":"Meh. Not terrible by any means but definitely not great and not somewhere I'd go again, es","useful":0,"cool":0},"_syMBxlUVk6kZJeywt1gyA":{"text":"The staff is great here! The food is traditional southern Cajun dishes. We tried the red b","useful":0,"cool":0},"euQCjc20tmzBQ2nGqIYnuQ":{"text":"Good selection of New Orleans authentic cuisine. The group loved the blackened gator bites","useful":0,"cool":0},"iUUTBVQXm2soFlhs_6-9YQ":{"text":"Good food, felt kinda touristy spot but it was good and the customer services was quite ni","useful":0,"cool":0},"NGbH1RN3LILWZ5BkgHPxqw":{"text":"I came here on the recommendation of other Yelp users for a taste of original New Orleans ","useful":0,"cool":0},"Wf_jjgz2gYwDgY0QjL17hg":{"text":"Delicious! I eat here a few times a month. They have some of the best crab cakes in the ar","useful":0,"cool":0},"sMqM2Lhfcvbz3MgN53-BWQ":{"text":"Good food. Prices were on the touristy side for what you got but, then again it is in the ","useful":0,"cool":0},"sL7z9hHWStOXaH8OIyevFA":{"text":"Not a big fan of Cajun food so hard to fairly judge their food but I do like the environme","useful":0,"cool":0},"Xz1Ogh3S77RBnfEMUZlQyQ":{"text":"Had my doubts about walking in here late on Sunday night, but we were hungry so I ignored ","useful":0,"cool":0},"KdyyjRDwPl6rA_XowiFXGQ":{"text":"Service was prompt and food was great! Glad we came here for a late night snack. Really hi","useful":0,"cool":0},"41Lt5nTLHlo55qmLq66YbA":{"text":"Great service, reasonable prices and good food. Came for the shrimp po boy was as good as ","useful":0,"cool":0},"sY4vUOE2XEXroyePJDWg-Q":{"text":"Great place to be eating late-night in the French Quarter. Oysters are cheap and are just ","useful":0,"cool":0},"8ghAPQVWltwXZF-7nzardQ":{"text":"Just had lunch here and couldn't be more disappointed. Ordered a Shrimp Po-boy and split i","useful":0,"cool":0},"hvtqbIV0cKp84oRoM1Vneg":{"text":"Visited with my girlfriend and she was hesitant to try something new. We finally agreed an","useful":0,"cool":0},"2tQvIce6_cZSu1V0YDXDIA":{"text":"We were sat in the second floor and it is just awesome. Has a great vibe, its smaller so n","useful":0,"cool":0},"LW1xBmKJ1Mam0sOvMgPD3w":{"text":"Copious amounts of fried oysters and creamy bold crawfish ettoufee with a market friendly ","useful":0,"cool":0},"G_VVHgNsTNXV8iIRGnPGuA":{"text":"Ok on our Chef Tour of the Big Easy, I'm now a regular here...Smooth atmosphere that silen","useful":0,"cool":0},"qysoiH0wO2EzJxG_QHZPUw":{"text":"Great atmosphere considering it was a Monday night!!! We were seated immediately and the s","useful":0,"cool":0},"E-zyfZ4kCr3t38CUTiidKg":{"text":"Food was mediocre. Service was worse. The waitress was nice but after seeing us wait at th","useful":0,"cool":0},"LWkqmuCxetCH1ZR-EMUOHA":{"text":"Food was decent, but not at the same level as other NOLA restaurants. They also practice B","useful":0,"cool":0},"CAlF-wAJnCMICVA86nnT5A":{"text":"The gumbo tasted good, not like what the other places offer (really salty). Liked that a l","useful":0,"cool":0},"dmgf2B0_FPOO3gBplKl76w":{"text":"Our first eatery when we arrived in New Orleans. We started our journey with a few Hurrica","useful":2,"cool":2},"4HnaoAKe8JnSHYjMeOFVPw":{"text":"The atmosphere was great, especially for Bourbon Street. The food and service were prompt,","useful":0,"cool":0},"WA0GFTJY5LxS4gllAmhtLw":{"text":"This was my first experience trying a Cajun restaurant in New Orleans. Other popular resta","useful":0,"cool":0},"R5pciC-ZEwXYoqI26uVBUw":{"text":"Shrimp po boy was good, drink was good and sweet. Bartender was super sweet. Nice location","useful":0,"cool":0},"kvDB2ff5uOyZWClOB_w5dg":{"text":"Walking up and down Bourbon Street  with your parents is really awkward, even before the s","useful":3,"cool":2},"tFZvRkLWGszYGyhRBFg9Lw":{"text":"The food is fantastic the service is wonderful first time and we've been back since coming","useful":0,"cool":0},"AShFiq0VqMR9GhyIPvn8TA":{"text":"The blackened alligator was tender and perfectly seasoned, bloodies we're awesome and Olac","useful":0,"cool":0},"fXvj03yKFHYBha55WobXEA":{"text":"This place is on Bourbon Street they have really good red beans and rice and fried crawfis","useful":0,"cool":0},"lnK_SjYX1pJTMRkyNtLjTA":{"text":"Just made a quick stop here for some dessert, but would have been better not coming in at ","useful":0,"cool":0},"0EeFtO8u5l69ZKvo1uxU8Q":{"text":"Great lunch and comfort food for my first meal in New Orleans. Bowl of gumbo was delicious","useful":0,"cool":0},"9nulROTz-EhXJ8MeB0WbZg":{"text":"I came here on my first night of a girls trip to New Orleans we were looking around for a ","useful":0,"cool":0},"mBsjMwGaEeL6j7NBE5V5yA":{"text":"We ordered 7 dozen oysters between 4 people so I think it's safe to say these oysters are ","useful":0,"cool":0},"A_2VDT-EnXCXf_oX7xst1Q":{"text":"DEEP FRIED GOODNESS!!!\n\nI really, really wanted to go to either Felix's or Acme for some g","useful":4,"cool":3},"BvkEjDyQbJvXJxf0qy9uZA":{"text":"Went to acme and felix, but they had massively long lines and we weren't down for that. We","useful":0,"cool":0},"IwDNdbVrb0HkUNal7W1Unw":{"text":"We ate here twice in the same day!  That's how awesome the food is. My friend had the Blac","useful":0,"cool":0},"R09tHm697npwuJTYEsAf5A":{"text":"While it's a VERY clean establishment on the otherwise grimy Bourbon Street the food is ju","useful":0,"cool":0},"RDc0Rq8VYT9CRxUpOZPD2g":{"text":"A friend and I were wandering down Bourbon Street looking for an authentic New Orleans mea","useful":0,"cool":0},"puA9YS-PqoosUT1FT2xeMA":{"text":"Went to Olde NOLA Cookery on our first night in town. My husband was looking for Cajun Jam","useful":0,"cool":0},"qI7_ksxxgK4GIRjgjZJwRA":{"text":"Get the gator bites.  Fried of course! One of my staple spots to eat when I visit NOLA.","useful":0,"cool":0},"yroBqv44FzidJGfjZ5xypA":{"text":"First night in New Orleans and just got in at 11:00. Check our Olde Nola Cookery and needl","useful":0,"cool":0},"pXr57LRaxoxyoHN-8Y5yYQ":{"text":"This review is based strictly on the crab cakes and service. \n\nService was excellent!  I s","useful":0,"cool":0},"PdSE6c7_hq9m9On0cPFQZQ":{"text":"This is a wonderful place to eat! The Red Beans N Rice were very tasty. Also the Blackened","useful":0,"cool":0},"NqUxdcEgPr_-nZGj7SC4AA":{"text":"Gahhh. I'm soooo happy I literally stumbled into this place while trying to find food at 1","useful":0,"cool":0},"CPd6ytKp56AE1n-Ge6jkcQ":{"text":"Right on Bourbon street! Took a while for the server to get to the table.  I was out on th","useful":1,"cool":0},"NDMIga_tUG-nyD-BPe0h5A":{"text":"Ordered the Mardi Gras pasta and added chicken and alligator sausage, it was so good, a li","useful":0,"cool":0},"L36tqF2p3WzlEBKu008lQQ":{"text":"We were pulled in off the street on our way to Mothers by Jarvis.  I told him this better ","useful":0,"cool":0},"v03qyh9tt4fQK8LjkRDgRw":{"text":"Service was slow and menus were disgusting and sticky, literally you couldn't open all the","useful":0,"cool":0},"e4GLR_hJiw2QoQ2aoIYdsw":{"text":"I stopped at a seafood place yesterday ordered the seafood platter and wasn't really wowed","useful":0,"cool":0},"X_CV8Ec1FSF4yEkqfF482A":{"text":"Wanted something local since I was visiting NOLA, this restaurant gave me just that. I enj","useful":0,"cool":0},"5pqDh7tMiXBARrxexQCE1w":{"text":"Awesome food great retreat for a family in the middle of crazy bourbon street thanks for s","useful":0,"cool":0},"vGwOuspZk4TqnTf2BfvX_w":{"text":"Had the Taste of New Orleans and it was definitely one of the best things I had to eat whi","useful":2,"cool":2},"jIGm9QUGgU2ASlndfrd1JA":{"text":"It wasn't terrible, but it also wasn't great either. Food, service, and cleanliness were a","useful":0,"cool":0},"UiaeaEhHtOKDzYhRa7xjzg":{"text":"I want to say that I was surprised I didn't wait with a party of 7... I used the Yelp app ","useful":0,"cool":0},"p0q1GDHB1i8WGaWID9KpnQ":{"text":"AWESOME AUTHENTIC FOOD!! Friendly service also!  Jessica kept us full we didn't have to as","useful":0,"cool":0},"G1edTpxa0ZqTr_lAmgcfkQ":{"text":"Ate here because it was close to hotel and raining, so didn't want to walk far.  I was hes","useful":0,"cool":0},"6Ll7GkPJCwdaoxAH4QEtRg":{"text":"The food and service at Olde N'awlins Cookery were both excellent! We were first seated on","useful":1,"cool":1},"hpkw_yQAHgVvrs50nwwunw":{"text":"This place was delicious and I'm so glad we stopped in. Crabmeat app was great as was the ","useful":0,"cool":0},"m85KM4URDB70HHxz23k-Mw":{"text":"This restaurant is a wonderful surprise! The food was so delicious and flavorful. Proper s","useful":1,"cool":0},"BdZaH5Co3OaYp1paOf_N1Q":{"text":"Terrible service. Food arrived in 3 minutes and the plate was hot. Seemed to be microwaved","useful":0,"cool":0},"ZUWynDnob6Te0Uh_7_psng":{"text":"Excellent service, great food! Grant was very accommodating to my special request for 1/2 ","useful":0,"cool":0},"SWUe7HUcgbEGWuAcmer-vw":{"text":"Oh man! Stumbled on this place while walking down Bourbon St., late one night. Their black","useful":0,"cool":0},"3dQEH2zGlUQ2rxNxHLjc7Q":{"text":"Best sampler we had in NOLA. My boyfriend picked this place and I was disappointed when I ","useful":0,"cool":0},"JW5rb0QdSfkJiadcg0BDHg":{"text":"Wonderful waitress Trina. Gumbo great. Blackened chicken po boy good. Bourbon pecan pie wa","useful":0,"cool":0},"Df4ZxHgM71lcbihEygwQLg":{"text":"Hidden gem on Bourbon! The Redfish cookery is to die for! And if you're a first timer you ","useful":0,"cool":0},"2ycp55LXIEQ9n6f2OE5eIw":{"text":"This place is absolutely disgusting. The atmosphere is cold, dirty, and forgotten... just ","useful":0,"cool":0},"WF058X3mT7qHw-LDbsqclg":{"text":"Place sucks. Dirty, unfriendly staff, cold food. Waited for over an hour for food. Food al","useful":0,"cool":0},"eXt6jfosLTF0OjSGJpIjlg":{"text":"Excellent service and speedy too considering it was a busy weekend night.  We had the Tast","useful":0,"cool":0},"AXMX9a4oNOfqnYGQFp9rQA":{"text":"Food was great here. Only drawback was that the French bread was stale. Other than that, s","useful":0,"cool":0},"NJtWVs5mkB7tuKfEC5ClXw":{"text":"This was very good.\n\nBoth the blackened chicken and the steak were delicious.\n\nThe rice an","useful":0,"cool":0},"-mofMnIokt2VNC-0ngHtzA":{"text":"Great place, had the seafood gumbo and the jumbalaya. But the best part was the service we","useful":1,"cool":0},"saNo6YvaDA3e3G_e2wP2AQ":{"text":"We ordered the shrimp po boy and the Cajun pasta. The bread was hard to chew and really ru","useful":1,"cool":0},"4ZyJfbNXJBsCGCy1JXQRfw":{"text":"I ordered a shrimp po boy and it was delicious! The shrimp that came inside were a great s","useful":0,"cool":0},"uJskmHXkLi5anXWg5tFoYw":{"text":"I would give this restaurant 3.5 stars but I'll round up and give it an optimistic review ","useful":0,"cool":0},"mNKa9xQoAaSrAyvunld6jA":{"text":"The jambalaya pasta is soooo tasty! Thanks Joel for the great service! We'll definitely co","useful":1,"cool":0},"45i7X30OUhKtl_keo-7u8A":{"text":"Wow!! To be a popular and super busy restaurant on bourbon street this place has there stu","useful":0,"cool":0},"YmTZABZnO3msdrAqZFZETA":{"text":"This place has an almost identical menu to Oceana Grill, but I would go here instead! I or","useful":1,"cool":0},"S-uGuviD4DE4mh3z2FI2ZA":{"text":"Pleasant atmosphere. Decent service. Food was okay. Nothing stood out as amazing here. Had","useful":0,"cool":0},"qrQet-Lpn5GGaqgqPK-0Kg":{"text":"I had to drop a star only because we had tough time finding out the restaurant. We called ","useful":0,"cool":0},"J2BejMNBhCcaHeFF2lsylQ":{"text":"I give it 3 stars for the fact that my bf enjoyed it so much but I'm more particular than ","useful":1,"cool":0},"YQQW5weDNTixYUbNircmQQ":{"text":"This was mediocre at best. Service was really friendly, but the food just wasn't good. I o","useful":0,"cool":0},"xhG1PYvSrAXoMuKYPFxJAA":{"text":"Well, I decided when I was home in philly before I arrive to Nola that I was gonna try thi","useful":0,"cool":0},"dUzq1gzzIlF2U2baNUALFQ":{"text":"Really delicious, authentic New Orleans food. Went here on my first night in the city and ","useful":0,"cool":0},"M3Tk3jsNdpj4ZIyufE_FOQ":{"text":"I lovvvve this restaurant!!! I've come here the last 3 years every time I come to town! I'","useful":0,"cool":0},"TnwDBHPtGOqDZzgCi6IWaQ":{"text":"The food was great! This was our first stop for Cajun food in Louisiana and we weren't dis","useful":0,"cool":0},"irfOnCBJwkkol_xxCqnRLg":{"text":"First visit to New Orleans was a success! I came here for dinner craving crawfish and defi","useful":0,"cool":0},"ZUtFLeKsWW51M0mdlIcV_A":{"text":"Open later than most restaurants which was a benefit since we arrived at 11pm and was anxi","useful":2,"cool":0},"inCYA62RGz8p_pNGqPMELQ":{"text":"I was looking for a place that offered me some cajun food and also some vegetarian options","useful":0,"cool":0},"aaL2QjODRMO3n1UdzeCGYg":{"text":"Good food and great customer service. It can be a bit loud bc of the location. Check-in on","useful":0,"cool":0},"JWvUB4K2nirwsqn0ay4vMw":{"text":"Shrimp pop boy was good: stuffed with cole slaw. Fried seafood platter was good too. Seafo","useful":0,"cool":0},"9I74ypvNrImFMMeBAvKUBQ":{"text":"Drinks were great!  The gumbo was good.  The gator bites were just ok.  All in all.....the","useful":0,"cool":0},"0KBZ2dKmhzVVyK-ItwuTGQ":{"text":"Raw oysters were okay. Atleast not as bad at all as Acme. Gumbo was tasty. Bloody Mary str","useful":0,"cool":0},"3rLkh3l10UKGa1X0U9BPmQ":{"text":"Our first stop in NOLA and my husband and I shared the shrimp PO boy and some fries as a s","useful":0,"cool":0},"er8vS6gJMkpwNZQaNhPFTA":{"text":"Okay so this was the first restaurant we tried on Bourbon street when we arrived.  This pl","useful":3,"cool":0},"8K-DtOz8ejYvrjpVtBYVDA":{"text":"I wish I could give them a big fat zero! Total tourist trap! Expensive and horrible food a","useful":1,"cool":0},"MCEhmDKulr-IM2VbYsAXbA":{"text":"Shared fried platter with wife.  Awesome!  Service was fast and courteous..I would definit","useful":0,"cool":0},"fFRns1FTTYHcgPOB7awgxg":{"text":"The food here will satisfy your hankerin' for some Southern Cookin', so if you're looking ","useful":0,"cool":0},"i4xHhggUKYHF_hoM0KrcAQ":{"text":"Ate here Thursday June 12th.  It was roughly 9:00PM, I had crawfish etouffee, my wife had ","useful":0,"cool":0},"2XaTiBsxMwIjFN0AXdAkpA":{"text":"Loud place but that makes sense given the environment on bourbon street.  However it is wo","useful":0,"cool":0},"_U06oe4wBmuBpHQL_JAX_A":{"text":"Jessica Mader is the best!!!!! She is kind, patient, warm, friendly, outstanding, and a ki","useful":1,"cool":0},"OLLvtMbcbJCG-r4oU8GuQQ":{"text":"This your typical tourist restaurant in NOLA. When you're starving and all the better rest","useful":0,"cool":0},"U4GbRVxDKYTGSpeG46X-fw":{"text":"Exceptional service, as someone who works in the service industry I could only hope to hav","useful":4,"cool":5},"ik2HKz210ukA9q8wL9878g":{"text":"Nice atmosphere and good foood! I had the Jazzy Crab cake platter with mustard greens and ","useful":0,"cool":0},"DsQoejmibqEJgdg7Dt1o-w":{"text":"Great start to our New Orleans adventure! The taste of New Orleans gives a great example o","useful":0,"cool":0},"y1ZOlpYF-lwDK3QPQ2Ex5g":{"text":"Good food, service was pretty slow. I ordered a catfish po boy and was brought a shrimp po","useful":0,"cool":0},"6yzXCE0mhXsIvyR2l3vylA":{"text":"If You don't like loud noise you should definitely stay home and Off Bourbon street. But i","useful":0,"cool":0},"yVEA93pO6EeWmXuz6T-iSA":{"text":"Be aware of the wait. We waited 50 minutes for our entree to come out. They didn't give br","useful":0,"cool":0},"uQifRJzcaF_r1THEjGITRg":{"text":"This place is awesome.  Came here during a Saints football game to grab some food to help ","useful":0,"cool":0},"TCGSqnbEftZvKZEBb4wRcg":{"text":"6-28-15  Amazing food and servers!  Highly recommend them.  We had a group of 24 and at th","useful":0,"cool":0},"5M_dLt5eyplt-XQKVOmhGw":{"text":"The food was bleh....  Only thing great about it was that it was open late around Bourbon.","useful":0,"cool":0},"Bzzz1O7kgvKDRHpMYGtXaQ":{"text":"It was fine. Wasn't impressed - food was fine, service was fine (although our server, Guy,","useful":0,"cool":0},"tULTNKlpXdM_fWAljdXJ5g":{"text":"We found this place just walking around on Bourbon St .Short wait and were seated super fa","useful":0,"cool":0},"DQKyj3kLJWbVKXCx9osGHA":{"text":"Great place to indulge in delicious local tastes without frills & at reasonable price.","useful":0,"cool":0},"7PMFJJhn7ux4igReM0sG2g":{"text":"Totally exceeded our expectations.  We happened on this place because the line for Acme wa","useful":0,"cool":0},"yYwn52RZ_5v4MbunSpsdgQ":{"text":"I love everything about this meal! It was so flavorful. The crawfish gumbo was perfect. Th","useful":0,"cool":0},"a2QhP9YhiTRC4HKcZCkQlg":{"text":"Visited this restaurant for lunch with our two kids. They have a kids menu which is always","useful":0,"cool":0},"SScNFvZN3ERlu2p5unMLXQ":{"text":"Friends and I visited this place last night and were excited to try it, especially with th","useful":0,"cool":0},"0Cnqc8Pm-DqWtrt9ya4b1A":{"text":"Good food. Very cosey. Has that expected New Orleans feel!! Food was good... Like the frie","useful":0,"cool":0},"CEm2i-eEs25LSYYv8mUh6Q":{"text":"Fantastic for a late night meal! I had the blackened chicken red beans and rice and gumbo,","useful":0,"cool":0},"1wEj0FshhT1ZoLmRuQfWMA":{"text":"Omg this place is great from the server jessica j to the kitchen staff to management so ni","useful":1,"cool":0},"fMFGF-hQ4JkWbCw5srGzOg":{"text":"We had our wedding rehearsal dinner here on 5/28/15.  The staff was friendly and did a gre","useful":0,"cool":0},"6tbNGDY8ietiNdWvtY08uA":{"text":"One of my favorite places to stop by whenever I'm in town. The bread pudding is a must hav","useful":0,"cool":0},"5-QAMpWKqmVu5uvqhCordQ":{"text":"Awesome joint.  Tried the NOLA sampler.  Comes with gumbo, jambalaya.  Also BBQ shrimp was","useful":0,"cool":0},"Lx1a-X0s74G447EaD7rEkw":{"text":"Bomb! Me and two others in my party had Po'boy sandwiches with the remolaude sauce, colesl","useful":0,"cool":1},"TKnVZseRoKPQimQWceLoaA":{"text":"Excellent food and service! We had asked for restaurant recommendations at or hotel and we","useful":1,"cool":0},"ZQwV6Gbl6nJ_UmqXs2ZfFw":{"text":"My last visit was over 15 years ago. However, was quite confused by it's new address on Bo","useful":0,"cool":0},"km5p__UA_9VgU9okt4i9uQ":{"text":"Good food for a decent price in a spot full of tourist traps...visites with a party of 10 ","useful":0,"cool":0},"wgP30NJhNk1-Muqw8dqwfw":{"text":"Great food friendly staff... Can't say enough!!!! We had the seafood gumbo and the blacken","useful":0,"cool":0},"kp9bscPKLSo9G2W7KocFqw":{"text":"This place looks like a tourist trap on Bourbon street but food is really good for the pri","useful":1,"cool":0},"rlN-mzCtoJ5K_14nBfZZcg":{"text":"We were skeptical because it was one of the places that didn't have a wait time on a Frida","useful":1,"cool":1},"GA3PuIv_aV1LOt1q8DcUCQ":{"text":"We just walked in this place as friends wanted to eat. We ordered some cocktails. Ordered ","useful":0,"cool":0},"6gApGHN8jA9MZ4OKX5Yz7g":{"text":"Okay, while in New Orleans for my first time back in mid April, this was one of the few re","useful":0,"cool":0},"1yAbVoS_pPPRmnOXleFs4Q":{"text":"my first meal in new orleans and was very disssppinted:(\n\nthe red beans n rice was more li","useful":1,"cool":0},"B5jYr9my5Ym50xPl7WeQ4w":{"text":"Shrimp PO boy was really good !!! The bartender was super friendly and even gave me tips f","useful":0,"cool":0},"UVzOMwf7QSO1g_350HCMPg":{"text":"If going here, I think the seafood is your best choice. My personal experience versus my f","useful":0,"cool":0},"-63G3KikMrhgeowMhOhslg":{"text":"I had the trio.. Gumbo, red beans and rice and crawfish étouffée. Everything was excellent","useful":0,"cool":0},"wIYky0tYGj7nVHEuQldE9w":{"text":"Touristy vibe but service was great and fast. I only ordered a dozen oysters and it only c","useful":0,"cool":0},"zRwdYrURq7Lp_drac-Cniw":{"text":"First time in NOLA and stayed close down in the FQ, started pouring rain and we stopped in","useful":0,"cool":0},"y8VQqxh0urqQE0Z3e05QHA":{"text":"James made sure all our needs were met. Great food and even better customer service! They ","useful":0,"cool":0},"zdiH-dtqSlSF9eHFbZ1kaQ":{"text":"Great food and excellent service. When in town I will eat there multiple times. Love the g","useful":0,"cool":0},"WoPA4tgssWSbdG7GdoiZYQ":{"text":"So yummy! The fried alligator is delicious (I'm crazy picky too so that says a lot) love t","useful":1,"cool":0},"emhRWQoP_Hagy59R1xjL_Q":{"text":"The service here is very aggressive. Upon entering the I was asked if I was ordering to go","useful":0,"cool":0},"V4m3FxL4Jcq8FeyuVJRzGQ":{"text":"While a bit touristy and a really compact dining space, I had an excellent experience with","useful":6,"cool":5},"AO5ObTETazDwYx9NTbtL8Q":{"text":"If you are looking for true Nawlins food. Look no further. The portions are large and the ","useful":0,"cool":0},"40d8vqmxBy7oBZY-m__lvA":{"text":"Great food, great service, fun location! Can't go wrong with this place- a bar, and GOOD r","useful":0,"cool":0},"AKh0pPLVop2oPunqbENHhw":{"text":"This place has excellent \"flavorful\" food.  We have eaten at many restaurants here in the ","useful":0,"cool":0},"nbN2ozirnjIBQqk14Wk6sw":{"text":"Soo disappointed. It got such great reviews but my fried eggplant was mediocre, the cup of","useful":0,"cool":0},"9SdugfwOYUvVZCBT5pvrSA":{"text":"Such good food, and the perfect spot for lunch. The blackened crawfish side dish is a must","useful":0,"cool":0},"xAu173t_VG6OEZO8kWebaw":{"text":"We had a great day taking tours, and when we finished wanted a low key, casual and tasty N","useful":0,"cool":0},"mZMJUGnA73d0HP1X_d71AA":{"text":"The staff were very attentive! We ordered the taste of New Orleans. It came with red beans","useful":0,"cool":0},"5lE0cDw61Q9-kBVrlLky3g":{"text":"Let me preface this whole review: the food here is wonderful. We came here with a group of","useful":0,"cool":0},"HY7Jm-FsrI_mkHNEUkci3g":{"text":"Service was good, food was subpar at best. The burger was overcooked, the po boy was predo","useful":0,"cool":0},"XQ5M9Cwn1_cKz2maSG936Q":{"text":"Great restaurant.  The seafood is fresh and hot. We got the seafood sampler platter, it wa","useful":0,"cool":0},"utk8H-uYyMqtKIQ-TFfm0Q":{"text":"The food here was great. I liked that they are opened later then other restaurants. Their ","useful":0,"cool":0},"5Pw27fS1kxHacYPO5LyVNw":{"text":"We had the red fish and the sea food platter.  They were delicious, especially the red fis","useful":0,"cool":0},"OHtwKXnx5YsOkoXg8-Focg":{"text":"I came here last night to enjoy the food as I had read reviews and was excited for my own ","useful":0,"cool":0},"N0GVxLZnRoBCXeBeva1DvA":{"text":"Great food at a reasonable price. There is so much to choose from. Super convenient too ju","useful":0,"cool":0},"ON9rEQnNMCLu_yhgs4U-GA":{"text":"I had the blackened catfish po boy and let me tell you that it looked so good when I got i","useful":0,"cool":0},"z-uLnikuttbu8uUDbOMlmQ":{"text":"Loved the food but the location is priceless..close to hotel in the middle of Bourbon St.","useful":0,"cool":0},"2cmBKBhGzGIVIIylN5O5Yw":{"text":"First time in NOLA wanted some good local food stopped here because they had an ad in a lo","useful":0,"cool":0},"mUdi4s19wX_wPLdPVT2pmg":{"text":"This legendary eatery is located right in the heart of the French quarter on bourbon stree","useful":1,"cool":0},"ex0EHw3Bu0XoYTVOIUd8Wg":{"text":"Welcome to the Applebees of Bourbon Street Folks. I'm quite positive the majority of the f","useful":0,"cool":0},"av2EBCju07H-inFv6eh9ig":{"text":"Shitty service and all there food was frozen in packages and pretty expensive and when I s","useful":0,"cool":0},"ww7VFOnZf_lIIJu54fLhLg":{"text":"Had friends in from out of town and while I was at work they selected to go here and I met","useful":0,"cool":0},"xzkPPa5rhiKQlUXofmxuXg":{"text":"Excellent, excellent, excellent!!!! Food was superb, waitress (Jess) was friendly and extr","useful":0,"cool":0},"rTmcHTscJ6wv3tY03ZpVMg":{"text":"Great food, friendly service, and fun atmosphere!","useful":0,"cool":0},"8n5VF_wIS2R8vhkKQInTGA":{"text":"OK all honesty, I wanted to go to ACME oyster bar around the corner but the line kept me a","useful":0,"cool":0},"vhTao9ukXDcTLdSIYcXD5Q":{"text":"The place smelled like sewage and the food was simplistic and flavorless but expensive as ","useful":0,"cool":0},"JBlnAnsuKIlgFKXAl1YrUQ":{"text":"On a whim, we decided to eat here, just because we happens to walk by and we thought it lo","useful":0,"cool":0},"U1P8NY833XTqiRxQg_5Nig":{"text":"Very friendly and very fast service! \nWe tried 2 excellent dishes, the taste of New Orlean","useful":0,"cool":0},"uC0PpFiVDw24iUKnTdR49A":{"text":"I wasn't too sure about this place at first but gave it a shot and I'm glad that I did the","useful":0,"cool":0},"bkTsXwqS8faQu9Ig34wD0g":{"text":"The gator bits are amazing and the warm pecan pie is orgasmic. Felicia Brown is an awesome","useful":0,"cool":0},"YpW8nEwOCYUEiE_8Z39iww":{"text":"I've never been to NOLA but when I walked in I definitely knew I was there. This place loo","useful":0,"cool":0},"3c-9Zm8-JnGewxwed7eyQQ":{"text":"Horrible!!!  Why advertise free appetizers in your restaurant and not honor it??? The food","useful":0,"cool":0},"8wG4AOveJzjudj2pDzWLKA":{"text":"Great late night food. Open past a lot of the other restaurants in the area, a great optio","useful":0,"cool":0},"II5pFi5Cw5LMieo3QtsrhA":{"text":"Everything was absolutely delicious. Seriously, who would of thought red beans, sausage an","useful":0,"cool":0},"i82Y8XtE2kdtaxD-y9TGkQ":{"text":"Josee (Josie) not José was amazing. She's so friendly and so funny. She was so patient wit","useful":0,"cool":0},"jLnO5nqPTDuf8QH0r_VzNA":{"text":"Good was great came out without a long wait Waitress was very attractive recommended the p","useful":0,"cool":0},"gJTj8Mw0EMk-7RuKP6huKw":{"text":"The Taste of New Orleans was just ok, 3 small cups not worth $18. Bananas foster ice cream","useful":0,"cool":0},"0KwEuX-VLzB4ctn5HABskA":{"text":"I dont eat seafood. I typically avoid, and deny any invites to it. \n\nBut, i was in New Orl","useful":1,"cool":1},"Mz54GFIoQCxhvF7xYsv8Bw":{"text":"Was on business in New Orleans and wanted a nice dinner after an all day meeting.  My goal","useful":0,"cool":0},"5v-9MFNu0kqJsw-Y0rci6w":{"text":"Great place to get food late right on Bourbon! Cassie was an excellent server and I'd high","useful":0,"cool":0},"OXR2qXu-bw3YR9Ki2vBUGg":{"text":"Came twice in 5 days! The jambalaya pasta is fantastic and the barbecue shrimp appetizer w","useful":0,"cool":0},"FdwYiVrpluZDueRH_fvRxw":{"text":"Awesome dinner we had. Gumbo was superb, the alligator was delicious and the fried eggplan","useful":0,"cool":0},"5h0Xsh2ZqPY7tnnBkzVkfw":{"text":"We just got to our hotel and we were looking for somewhere to grab a quick bite to eat. We","useful":0,"cool":0},"fpP-fFr3sBxfI_fLmYlEjg":{"text":"They have New Orleans typical food.  The place is not nice at all, but food its ok and ser","useful":0,"cool":0},"9ww_iDiOqWkVKF5zeXIXrA":{"text":"Stopped in for an lunch and really enjoyed ourselves. The service was quick and the food w","useful":0,"cool":0},"aOkuJTEF13U5ENQtG7NWAQ":{"text":"This place was outstanding! The boudin was worth mentioning! The service was also very goo","useful":0,"cool":0},"ij6nrmigZrUmP15NSjmkDw":{"text":"It's a wonderful little cookery, with awesome hurricanes, fantastic fried shrimp, Étouffée","useful":0,"cool":0},"wVhg6b-8LEmJY3QCuiukdA":{"text":"This restaurant was a fabulous discovery.  The crab cake dish was hands down the best I ha","useful":0,"cool":0},"_AlC7TaLkPXW_atHdhNMpA":{"text":"This is a typical tourist restaurant on Bourbon Street that while  I would not say it is a","useful":0,"cool":0},"t7ibiK1ExOkPnU-KvOsYCQ":{"text":"I really can't understand a place on the banks of the best seafood in the world serving fr","useful":0,"cool":0},"25l328hZug6A5ecCsNculg":{"text":"Yum!  They accommodated my gluten allergy with delicious alternatives.  The service was sp","useful":1,"cool":0},"wykvzzgRdpsvddrKWej2NA":{"text":"Great food great price!! Great customer service...pick anything on the menu and its a winn","useful":0,"cool":0},"C--96wAv4g_6bmpXPhIWzw":{"text":"The food and the service here was AMAZING. We actually went back because the food was so g","useful":0,"cool":0},"7WuyARaCi31vJUJ2FUmjNA":{"text":"Good food. Friendly staff. Didn't like the chicken sausage but that's personal preference.","useful":0,"cool":0},"GQFoM0tFgpGBTB0kLFkkqA":{"text":"This is hands down the best food in NOLA, and I'm hard to please. The best crab cakes, the","useful":0,"cool":0},"UnP8637e3slHD7xmq72MJA":{"text":"My many to New Orleans and take me to some of the finest restaurants this great city has t","useful":0,"cool":0},"w0gYWbL4K3OZnEfgNjDXAQ":{"text":"We are locals and went to the theater last night.  With limited time for pre-theater dinne","useful":0,"cool":0},"BgLbWF0Hi4SoMHWh7-gfFA":{"text":"This is an update to my original review from our 5/28/15 wedding rehearsal.  About a month","useful":0,"cool":0},"19T8vGYh424y6EJ_Oc2Wqw":{"text":"We ordered the taste of NOLA with crab fish tails and everything tasted AMAZING!! Except t","useful":0,"cool":0},"imLdywb5bRx1nnYJBiK_Ew":{"text":"It's mid July '15 and it's my first time in New Orleans. I'm a little early for hotel chec","useful":1,"cool":0},"CqWp6fRJStmptxvZU_s6iA":{"text":"The food was really good but after waiting outside for 30 minutes and then them messing up","useful":0,"cool":0},"cZNHeyGOPPv6W85p4fbYlA":{"text":"Food amazing unfortunately Service was very slow. But certainly a well recommended establi","useful":0,"cool":0},"tvNx3WUDczRl9E0Dc3HNtg":{"text":"Awesome find right on Bourbon Street! If you are looking to enjoy some excellent local cui","useful":0,"cool":0},"qhQqrr4lEh7D2saUXjYNeA":{"text":"Commercial take on NoLa classic dishes. Not my favorite, but it's open later than most oth","useful":0,"cool":0},"bclcWOBeWdGSnCpdiOw1Mg":{"text":"Returned on Monday 3/9, our first evening in NOLA.  Headed immediately over there in the p","useful":0,"cool":0},"oYNvpsjBWMPB0BIn_jdAnQ":{"text":"Great drinks and atmosphere! The chicken Alfredo was AMAZING and pecan pie melts in your m","useful":0,"cool":0},"qQENeu12OpEB5KZbdkOVWQ":{"text":"By far the best place I've tried in NOLA. Walk in ask for Chris. Tell him where you're fro","useful":0,"cool":0},"TvLoxlplAgza005eii1TNA":{"text":"Great place if youre looking for real food late at night! try the blackened gator and crab","useful":1,"cool":1},"8D-pYUHx04qeh4wVKfkApQ":{"text":"Entertaining! I came with two of my children (before sunset) for dinner. You enter through","useful":0,"cool":0},"aYNBjc5gvf6Meq8sxeQVKg":{"text":"Stopped in earlier this week and had the alligator bites which were delicious.  Our server","useful":0,"cool":0},"Q_GMTc1MuE_zgxOeVkaWig":{"text":"While the food here was good, the service was less than mediocre. My husband ordered the b","useful":0,"cool":0},"NK3ss5Rfwd-7STtob4am4w":{"text":"We had a group of 9 for early dinner. Service was good. Prices were high. Food was ok. We ","useful":0,"cool":0},"qtFjN9BkzOU-mBwkeYgIGQ":{"text":"Went there for some simple night snack and decided to get fried seafood platter. Not good.","useful":0,"cool":0},"eLOdJd01eN5YGfIYirK69A":{"text":"Great po boys! Amazing service. Loved the purple haze beer. A nice place to experience New","useful":0,"cool":0},"eLnYe5zYw-1QddNnW_bLFw":{"text":"Strolling the French Quarter searching for the perfect late lunch we stumbled upon Ole Nol","useful":1,"cool":0},"OLEGltcIa74xW51NrHGTzg":{"text":"Great food horrible service. Runner brought our food out and our server never came to chec","useful":0,"cool":0},"hAi_bto7NjCWQPPmJyjd7A":{"text":"Aside from the air conditioner in the ceiling dripping water on me, great place to eat! Ne","useful":0,"cool":0},"DfeJIqkURBPBHnB8spZTbA":{"text":"Great food,good vibe,great workers . I got the Cajun Pasta baby!!! It was so good and flav","useful":0,"cool":0},"DQqPa_MB_NwELMJyLL9BHg":{"text":"Alligator Bites were great. I got the Strawberry Daiquiri. \nThe service started off a litt","useful":0,"cool":0},"3XUYtukh6urW-9fdMbFLhA":{"text":"We stumbled upon this place during a stop over in new Orleans. Everything my friends and I","useful":0,"cool":0},"B-dawFZ6ChIt2qObxm_1kA":{"text":"We got here 6:30 on a Sat. Sat on the balcony. Great atmosphere!! Bloody Mary's were PERFE","useful":0,"cool":0},"yZXGquxMcrsnSHl7mPw7Iw":{"text":"I was extremely impressed by this Bourbon Street restaurant.   \n\nMy girlfriend and I were ","useful":0,"cool":0},"FSQhhClNMyMQnAAluwt4Ng":{"text":"We walked by this place at first.  Not sure why there was a security guard sitting outside","useful":1,"cool":0},"1WF0sbr9UB27WPMd9DSFJQ":{"text":"Kentrenell is a perfect server. She suggested what to eat, the best way to order it, and w","useful":0,"cool":0},"syJLo3xaeHzRa0I_7V8AMA":{"text":"I delayed writing this review until I had something to compare it against. I had the app o","useful":0,"cool":0},"oiWl5du6uVcCj61Ick1jfQ":{"text":"2nd time coming and not disappointed! Food is yummy and the staff are great! This time was","useful":0,"cool":0},"NwKPKdWznhftJptfzzckRA":{"text":"Surprisingly great place to eat right off of bourbon! The oysters were yummy the crab cake","useful":0,"cool":0},"gIebX-y7l1XCJ92DB8bO0w":{"text":"Yummy/Excellent/Amazing!!!!!\nI can't say enough about how damn good this place is!!!!!\nIns","useful":2,"cool":1},"EZ7kxIMIX_nZm9UA4N5aLA":{"text":"Absolutely love this place! It's my first go to after touching down in NOLA! The seafood g","useful":0,"cool":0},"s189pixkEYCe7t64LxiLSQ":{"text":"Excellent meal, I came with my brother and it was surprisingly empty (came a little before","useful":2,"cool":0},"7UGIJWBCtHSQhl1Zdkdq9A":{"text":"Very good food.  Hubby had the fried chicken alfredo and I had the red beans and rice.  We","useful":0,"cool":0},"Z0btujqa3FvlKpsa-w3EQw":{"text":"Service varied. The server was nice, the food came out quickly. But they forgot to give us","useful":0,"cool":0},"uJa5zNBYAzaw2GKlCQ5TEw":{"text":"Ordered up the fried seafood sampler, and it was good, but not great.  Service was okay, b","useful":0,"cool":0},"n32-7s9Ht12GrE6__EmQtg":{"text":"We really loved this place!\n\nThe decor is nice, restaurant isn't overcrowded.  The menu ha","useful":0,"cool":0},"iHRgQv8iDScex7q0lf5D1A":{"text":"The food here is awful. No one should eat anywhere in New Orleans and say the best part of","useful":0,"cool":0},"iC_8RbUdrD-fbkYCmy7nvg":{"text":"Our server Felicia was fantastic! The food was amazing,  blackened redfish with cream sauc","useful":0,"cool":0},"X1PwH0QbmhFPiOBs-cg4hw":{"text":"Olde NOLA Cookery is my go-to restaurant in the French Quarter!\n      As one who literally","useful":1,"cool":0},"EJCr0AS_UIFggKbXKNqR_A":{"text":"best nola food yet! even better is their service! super friendly staff with delicious food","useful":0,"cool":0},"uRk75fWDVYj-ASIZyYEETg":{"text":"This place is a hidden treasure. Really good food, you'll have to pace yourself. Crab cake","useful":4,"cool":1},"C1q6nS2n5E3RT5jrW8KVUg":{"text":"First time I have left 0 dollars in a tip ever. Worst manager ever who made no effort to c","useful":0,"cool":0},"gGqtXZAj5QNV3hU_p9P_IA":{"text":"Construction on Bourdon Street terrible..despite mess service was great. Very welcoming an","useful":0,"cool":0},"ZOwYHu4L4lL3HOTwh9Ogpg":{"text":"Great po boys and quick service ! Loooooooovved it \nBananas foster cheesecake was dope !!!","useful":0,"cool":0},"6aLO8uS01VuQLjlD3sH9Bg":{"text":"Amazing food, great service. We sat right next to the kitchens in the courtyard and a few ","useful":0,"cool":0},"HTZiv3MHr_28KhoOcDmQWw":{"text":"Red beans and rice and jambalaya were good. Nice waitstaff. Not too over the top touristy ","useful":0,"cool":0},"93oT6svf9LNR_sWvVOapbA":{"text":"Went here recently with 3 of my coworkers a bit before 5:00 because we suspected that it w","useful":0,"cool":0},"Arrf6GbJ9LeOP5MSIaWqoQ":{"text":"Non seafood dishes were good (ribs, steak and pasta). Seafood dish were also delicious. Fr","useful":0,"cool":0},"G9o3yWSDMperqMQMZT_36g":{"text":"Wonderful food! Great service ! Wonderful hamburger . Red Beans and Rice were great. Pasta","useful":0,"cool":0},"2wYL27JRVEA7Rmaw2lfqhQ":{"text":"I must agree with everyone else CRAB CAKES are delicious theres this yummy sauce and I t h","useful":0,"cool":0},"SpnGLCzQhr2sXdn622YMpA":{"text":"Great food, awesome environment, and the staff went out their way to make the experience a","useful":1,"cool":1},"a6-1ljnpom1nlujVt2RiFg":{"text":"Really good place but too be fair and not a fan of super greasy food nor poboys. \n\nBut non","useful":0,"cool":0},"BQ-UIy8Iv6s0u_enxXPsLw":{"text":"Pretty good little place on Bourbon Street. Great for a quick bite to eat for lunch.  On a","useful":0,"cool":0},"CZcd6ip9RmVHO0H5OPsCwA":{"text":"The shrimp were WAY over cooked.  The breading crumbled when peeling the tails off.  Very ","useful":0,"cool":0},"LaoWbUcCZD-e2_7Qv3PKMQ":{"text":"Came here at 4pm on a Saturday. Was seated right away but the service was extremely poor. ","useful":0,"cool":0},"Qr7T6xFss0lYeH1j6yHQBA":{"text":"Went twice during my trip to New Orleans and both times the food was amazing. I had the cr","useful":0,"cool":0},"eiHTcC5161wHL2Thr5FQzQ":{"text":"Doc was amazing great service and good food","useful":0,"cool":0},"YV0xKHRXKg6UUwTzBn38YA":{"text":"Went back in June of 2014 and still the most delicious crab cakes ever.  I think about the","useful":0,"cool":0},"UIXhhBN8Es_fRJ7pE0uS0Q":{"text":"Red beans and rice are amazing! They have sausage in them. Nice McGill atmosphere and they","useful":0,"cool":0},"HxPHbqrPUZbUS5rB9Sl4Xg":{"text":"I visited New Orleans and I came here because it was open late and had a very \"New Orleans","useful":0,"cool":0},"3QVe9ubB9Lpga5zGOaOwgw":{"text":"My husband and I ate here last week!! The atmosphere was great, waitress was very friendly","useful":0,"cool":0},"MOwBFeY_tpRJ8gEJ8v55ow":{"text":"Just stopped in here on a whim. They had amazing food. I would highly recommend the cheese","useful":0,"cool":0},"ImnBUH4_ivaFxnrv_PfAbQ":{"text":"Location is great.  On Bourbon Street and a short walk from Canal Street.  There was no wa","useful":0,"cool":0},"oVOojJr3oOyO4s7_jojXrQ":{"text":"Food was excellent! Gator bites half blackened and half fried were awesome! Ordered the bu","useful":0,"cool":0},"7e8PLguheOrIfTs-A0eoNw":{"text":"The BEST shrimp po-boy in Nawlins'.  Wait staff was informative, attentive and entertainin","useful":0,"cool":0},"MXTYTm6GxgsMRGyVW9v_0g":{"text":"Food and drinks were amazing! The food was very delicious! I had the blackened chicken and","useful":0,"cool":0},"Tz1V4C8eiSKeuMkVF5IPYw":{"text":"Greeted by a friendly host. Food was pretty good. Had the sampler. Service was also fine. ","useful":0,"cool":0},"FuSdOb7BaJCMFi0kv02wvg":{"text":"We had a group of six and we came in late. The service was outstanding but better than the","useful":0,"cool":0},"FSfkcFB-aGxcZByv_iuQKw":{"text":"Had the crawfish étouffée, it was fantastic. Good portion size, good service. Washed it do","useful":0,"cool":0},"NNf_fWbOkHIrWEkOPdtAJQ":{"text":"Great service, good drinks, good food. the blackened alligator tails are tasty. Fried shri","useful":0,"cool":0},"zrNlc5gGZBzUugdf7Jywhg":{"text":"I would give a four star to the ambience but the food is really nothing especial. Comparin","useful":0,"cool":0},"W4O-PQxY3RhmTTUqrG52NA":{"text":"So first stop after checking into our hotel in New Orleans and Olde Nola didn't disappoint","useful":0,"cool":0},"efy5tXH9zeOzw_jOVhcZTg":{"text":"Crab cakes were outstanding.  My wife and I happened to stumble upon this place while out ","useful":1,"cool":0},"cJtFcjov00LwIxYnY8m-OA":{"text":"There was no wait! Enjoyed grilled and fried alligator for appetizer. I got crawfish ettou","useful":0,"cool":0},"TGH24LRwLvbTPJ6MC0HNnA":{"text":"Omg!! The food here is sooooo good. I had the blacken catfish greens and red beans it was ","useful":0,"cool":0},"xalNeGn_faB8Ay-cJk_iKw":{"text":"Olde N'awlins Cookery was a surprising Bourbon Street find.  I got the Fettuccini with bla","useful":0,"cool":0},"8jnGTr1c39P0DqN-p1wR0g":{"text":"Came to this place because I didnt want to wait in line at some other joint. SO GLAD I DID","useful":0,"cool":0},"Ar5GcKflMPz24Yvg2oBnTQ":{"text":"Food was soooo good! The entire staff was staff was great especially our server Brittnee w","useful":0,"cool":0},"ykkrBYwzjoWoi04RSxOn5g":{"text":"Food was absolutely delicious. So mad I waited until my last day to visit. I will definite","useful":0,"cool":0},"fKla8D0yFIOjVqMlmv8Ndw":{"text":"The food here is sooooo amazing! If you are looking for some great seafood and creole cook","useful":0,"cool":0},"oXPqLxUGhMr52IxcHP_vsQ":{"text":"The food was amazing. The red beans and rice were mouth watering good. I recommend the red","useful":0,"cool":0},"CWlN3ZI3S4CIImzOgEajpg":{"text":"I mean its on Bourbon so what can you expect. They did take my last minute reservation for","useful":1,"cool":0},"3OFiX8-aNZMVNervo5DcJA":{"text":"My wife and I recently got married in New Orleans, a destination wedding for ourselves and","useful":1,"cool":0},"3TdJp-_zHRIAVLi12cXuxA":{"text":"Very good food.  It doesn't look like much from the outside, but it's food is great!  The ","useful":0,"cool":0},"AsT1x4E5CoLfeBnLNd649A":{"text":"Horrible.  Shrimp was gritty, red beans and rice w/sausage was awful.  Beans old and cooke","useful":0,"cool":0},"VuhgBJsuxMTz4tjkKv8P7A":{"text":"OMG hands down the best crab cakes I have ever had!!  My husband and I both ordered the  J","useful":0,"cool":0},"h9u41G20cOncQlntMbDpRw":{"text":"The food here was SO GOOD! I was so into the food that I didn't even take any photos! \nI h","useful":0,"cool":0},"89vu42zrJl44IuC0QYy2ww":{"text":"As a general rule of mine, places on a main drag (like Bourbon Street) in a tourist area a","useful":0,"cool":0},"b_k9lUBEASVqKKf6ZppwQg":{"text":"OMG!!! The flavor here is so good!!! The jambalaya paste is great!!! I'm so full I can tak","useful":0,"cool":0},"sXv321KRsRsE3I62Viv53g":{"text":"My experience started with a very funny doorman who caught my attention.  From there I sat","useful":0,"cool":0},"jxi_nQhuiEOB5XTt6LbOQw":{"text":"I enjoyed the restaurant, it was very good service and good po'boys.","useful":0,"cool":0},"RWP7z9bAAKvYc4Nh2iaMuQ":{"text":"This place not having 4 or 5 stars is a mistake. \n\nI did not have high hopes for this plac","useful":1,"cool":1},"U9B2Gi9xWvSAovHAOSaaCQ":{"text":"I just ordered food through Uber eats because I read all the reviews on here and they were","useful":0,"cool":0},"c0HnxuAGmTpDM-ZMPRetVw":{"text":"Good basic Cajun menu. Delicious red beans and rice. Veey hearty crab cakes. The thing tha","useful":0,"cool":0},"EvzjAs-7I1Eu7yCsiCsowg":{"text":"Awesome service and food. Portions were huge. Service was wonderful. Both management and o","useful":0,"cool":0},"W9417VYrpFxvC0AKDEKO-g":{"text":"Ordered the crab cakes with were great!!! The apple martini sucked... They took care of me","useful":0,"cool":0},"3Hc7_2Cp2Y3rSPD7SkmLCw":{"text":"Came in today to get a quick bite to eat with my wife while on vacation. At the door there","useful":0,"cool":0},"l9f4OVTJZrhTuubq1ed1GA":{"text":"I called this place the TGI Fridays of New Orleans. Stopped in on my first night in town w","useful":0,"cool":0},"BJDMN_VUU3xWNP1lLXsxPg":{"text":"I would give zero stars if I could. Our group ordered a round of drinks and appetizers and","useful":0,"cool":0},"bqyhtTvOuwZwWhsSmzrCJQ":{"text":"Mixed feelings, I think the hype of this place built me up. I don't have much complaints a","useful":0,"cool":0},"jDEcP18f9bEsvLrA53mPKg":{"text":"Food: very average\nService: average\n\nOur server was very friendly and accommodating to our","useful":0,"cool":0},"ambujF9fG5XkkNJC6Klw1g":{"text":"I really love bread pudding and one thing that you oughta try when you come to New Orleans","useful":0,"cool":0},"YOpC8VL2qDhT2GmSiWVfIg":{"text":"Man oh man ... \n\nLet me tell you... I DONT EVEN LIKE SEAFOOD!!! \nYet I devoured some Cajun","useful":0,"cool":0},"ltp3-kk971qTaD1HIDro5w":{"text":"Waited for our food for 40 minutes with no update. Waitress brought out two plates and the","useful":0,"cool":0},"vAXaMhsGnzdQpzIj1b1PNw":{"text":"I ordered blackened chicken and shrimp pasta. I must say the meat was seasoned very well b","useful":0,"cool":0},"iPNX_W7CsKym8d4yToozFg":{"text":"Best place to take your family to experience good NOLA cookin' and Bourbon Street atmosphe","useful":0,"cool":0},"5_nWstDG0s1vbLDnHQom_g":{"text":"Wow.. just wow. Get the Mardi Gras Pasta or the Blackened Chicken Po Boy. Or the Cajun Fri","useful":0,"cool":0},"OsST0QcgwYgP7XNFFd4vww":{"text":"Amazing food, amazing service (thank you James!!) Check in on yelp and you'll get a free g","useful":0,"cool":0},"N81plKxIJzcXIFEgnDOzGg":{"text":"Went here with some friends from out of town. It was meh. The service was pretty quick and","useful":0,"cool":0},"9OPcQKJdET4-LJ2WtWjOkg":{"text":"The jambalaya pasta was amazing. Generous portion of shrimp & alligator sausage. Our serve","useful":0,"cool":0},"4aSDgc2o0iveyfBf63PogQ":{"text":"The food was excellent. The only problem was all the roaches running around the floor insi","useful":1,"cool":0},"s0q1SecfRO-YJX1_wIAL2g":{"text":"Good food and great atmosphere! The service was great and we were seated on the second flo","useful":0,"cool":0},"ex0EaOirr9LTxwp9FRAH9Q":{"text":"This place had a fun environment. We got the red beans with rice and sausage. The food was","useful":0,"cool":0},"y9pVCOXhyTOVVEBsCYhUgA":{"text":"I had the BBQ shrimp and it was absolutely amazing! The shrimp were HUGE and the sauce had","useful":0,"cool":0},"C7Is13sgbaHX5VCSwqw8cg":{"text":"We came here based on several recommendations. With so many places to choose from its hard","useful":0,"cool":0},"ajCFTxuyQ8Z81bKgIBkBtA":{"text":"Tourist trap! Don't fall for it! Service was bad, they have people lined up outside just t","useful":0,"cool":0},"CQMceKzsK6gX1aEcLNXpqg":{"text":"TL;DR short review: I didn't get food, just dessert and a hurricane, which were decent.. t","useful":0,"cool":0},"zTY57fePeZCpoOUZ1qhiZg":{"text":"Food was good but seems a bit overpriced. The server was nice and the atmosphere is relaxe","useful":0,"cool":0},"hxO4AOCbq8vosFRHZX7IrQ":{"text":"Okay, sorry to be redundant but the crab cakes are the best ever!!! The food was generally","useful":0,"cool":0},"tN-9FJDAw8b0AOqKM0z4Uw":{"text":"This is pretty standard New Orleans food but is probably some of the tastiest you'll find ","useful":0,"cool":0},"QyRHJ4UVn9rTRo9BcJJK4Q":{"text":"Wonderful authentic New Orleans Cajun cuisine. Had crab cakes,  alligator bites and the cr","useful":1,"cool":0},"k9RdaHodyxrJkASPvMa8yw":{"text":"I give this place four stars because of the people and the and the desert. The food was de","useful":0,"cool":0},"A2EA_1cGxqgW21SNPPz5fQ":{"text":"THE BEST HURRICANE WE HAD IN NOLA!\nDelicious oysters and each of our dinners were tasty an","useful":2,"cool":1},"QaP3QqhRxg6muPq04O-Ijw":{"text":"Upon my arrival into New Orleans, before even checking into our hotel room, we hit Bourbon","useful":0,"cool":0},"2Pmy9Wc0gxtESXzyapfNOg":{"text":"This place is great. It was pretty busy for a thursday night, the hostess asked if we want","useful":0,"cool":0},"igo8SamOX8mcdnzp-eWdDA":{"text":"Solo diner - walked in and got a spot on the balcony outside. Seconds after sitting down t","useful":0,"cool":0},"Isp0JLSWEhEI4ldxc5sHEw":{"text":"Alright...we have been sampling red beans throughout the city and the award goes to olde n","useful":1,"cool":0},"OjLW8biA7hHCj5Svv0Dz-A":{"text":"Ate here with some friends on a business trip after a waitress at the Hard Rock recommende","useful":0,"cool":0},"H5ZtYq1icBNVs6E8gptO6A":{"text":"The food was amazing! I have nothing negative to say about my experience here. It is very ","useful":2,"cool":1},"8F0IYhgd9ouuptNMrsd9ow":{"text":"What a great restaurant. We stopped for lunch on a Friday and it wasn't crazy busy. The sh","useful":0,"cool":0},"pQH1sKOdkwD6LU_Tk5THzg":{"text":"First timer in New Orleans so of course the first meal had to be a po'boy. Walked by this ","useful":2,"cool":2},"6uzGP-ovN6OfXkVgQ8vI-g":{"text":"We had a coupon through local flavor. \n\nI was hesitant to come here at first. My experienc","useful":1,"cool":0},"ocl0quBChqStczS7hK_7bg":{"text":"This was our second time at this restaurant, but the first time we were there for dinner. ","useful":0,"cool":0},"OX4R3oxfl-wg8__zhXE9uA":{"text":"We were not very hungry but stopped in for a beer. The Cajun smell was so good we had to t","useful":1,"cool":0},"Y7UqPAkWsRPOkjo04mpQig":{"text":"Solid place for a big plate of friend goodness.  I splurged and had the seafood platter, w","useful":0,"cool":0},"l6bFY3hQXnrpknjnGuJP8w":{"text":"Overpriced but good food for the most touristy part of town. Great option for late night e","useful":0,"cool":0},"oxGSbItpYWT-9ezZ_bITPA":{"text":"Not good. We went here on a recommendation so I had high hopes. The service was mediocre. ","useful":0,"cool":0},"IbI0iaeunz3TvNq_9bSgUw":{"text":"This trip is was a bit of a blur, this food was SUPREME!  They had pretty delicious drinks","useful":2,"cool":1},"UNpyLwAlssURc3sbKApGOQ":{"text":"Catfish and crawfish were very over cooked. Gumbo was perfect. Gator and shrimp were absol","useful":0,"cool":0},"m5-5MMP91j_KZgqtBmSw3g":{"text":"This place is right on Bourbon St. Was seated on the balcony of the 2nd floor to enjoy the","useful":0,"cool":0},"tPpvJ4p7RlRz1JrRKIaSrg":{"text":"Where to start? The food was DELICIOUS!! First time having gator and it was so so good. Ju","useful":0,"cool":0},"fHgNB15dwnOtK_CMQMX2nQ":{"text":"Literally right on Bourbon Street!\n\nMy peoples and I attempted Acme Oyster but got stuck i","useful":0,"cool":0},"aHZTMG5O1fmykCxyBO7wjQ":{"text":"Hey, it's not gourmet, but it's really good New Orleans good.  It's casual, it's classic, ","useful":1,"cool":0},"UzMFk8rmfnnwqSsau_yXVQ":{"text":"This was my first taste of New Orleans cooking and it was very good! \n\nIn hindsight, this ","useful":2,"cool":1},"Aj65fLOrI1h72IsPU7lYcg":{"text":"Our trek to dinner started with a 7 block walk in the pouring rain. By the time we got to ","useful":0,"cool":0},"3qxeyRPWbBassp2fjMpBQA":{"text":"Must have went on an off day, as my experience was subpar. Had the crawfish etouffee and i","useful":0,"cool":0},"V9f2r11ZsBOsvqrN0hsucQ":{"text":"We cane here for a late night snack and weren't super hungry. We ordered po boy and a side","useful":0,"cool":0},"ResMz3DnB2y7VaXut79O-g":{"text":"This place was just okay. This place is a huge tourist trap considering the location. We d","useful":0,"cool":0},"cr7-kTl_PK3G5EbNo2eF0w":{"text":"Ordered Take Out of Gator Tips and Red Beans and Rice. It was fantastic!  Got a Beer while","useful":0,"cool":0},"Ux-wc1gI3_rHhlme5drKEQ":{"text":"Vicki was our waitress and was incredibly helpful and friendly.  Service was fast and the ","useful":0,"cool":0},"pa2LjZ_oRJSt7XWdaLbZxg":{"text":"Good basic New Orleans food, but everything was all fried and not otherwise very exciting.","useful":0,"cool":0},"Iqm_-422fnu_Dig_se3mzQ":{"text":"Spent Easter weekend in New Orleans with the family. We decided to give Olde Nola Cookery ","useful":0,"cool":0},"XjpA7L_K7aLwwg4qyCIoFQ":{"text":"This was a perfect lunch spot ! We started out with alligator bites and ended with oysters","useful":0,"cool":0},"aFfFBQ1AWaHelNzhLjecig":{"text":"Came to New Orleans in 2014 and this was our first stop. It was so good that we made it ou","useful":0,"cool":1},"4aeETJTKF1PjB9SVrZG3UQ":{"text":"So if the Yelp offer for free dessert is still available... there is ZERO reason for you t","useful":10,"cool":7},"qAGlDx_LU8vKbelmvBRSUA":{"text":"Olde Nola Cookery was so delicious. The blackened alligator bites were cooked perfectly an","useful":0,"cool":0},"91v2B1moYfdLdX1PFU68GA":{"text":"I've been to New Orleans a few times and this place is always on point.  Very reasonable p","useful":0,"cool":0},"FCzPdDyeCaE0tzX4UyVH5g":{"text":"Great steak (tender and perfectly seasoned), mediocre mash potatoes, excellent customer se","useful":0,"cool":0},"DqbVReVR9IjEcUuV-jCMfg":{"text":"GOSHHH I'm so full iloved everything from the drink to the entree ...., the host was real ","useful":2,"cool":0},"MvVECusoZigaDM3VnW54Zg":{"text":"First of all the service was top notch, James was friendly, informative and told us of pla","useful":0,"cool":0},"eiW2mz76QzjRlBRyiHbMXw":{"text":"My girlfriends and I came here because it was literally the only place open late and it wa","useful":0,"cool":0},"tdnC05DP8zX95AoLF7Cn5A":{"text":"Undercooked my steak and crab cakes tasted a little odd. They replaced the steak but nothi","useful":0,"cool":0},"RlPHsM-H81nQY5dQoA-Isw":{"text":"I'm giving it five stars because my server Felicia was the bomb! I ordered the trio of cra","useful":1,"cool":0},"2isZxZVM5_1FPSoo1MpI6Q":{"text":"Excellent breakfast. Had a number of speciality \"Benedict's\". But we opted for pecan panca","useful":0,"cool":0},"pZDUwFeJ-oGmHF4nLQRwow":{"text":"Sat us down super fast, the ambiance is totally chill and inviting. Food is yummy! Try the","useful":0,"cool":0},"L23i6r1YMJzr7HGkPdiKTA":{"text":"Mardi Gras 2019 the first meal was delicious. A shrimp po' boy, red beans and rice, etoufé","useful":1,"cool":1},"BBwu8x_4-oNCYY2N2takHA":{"text":"Olde N'awlins Cookery reminds me of a TGI Friday's specializing in Cajun food.  They have ","useful":2,"cool":0},"or2zQBtZhj15UeL_7SVD8g":{"text":"Great atmosphere for a Cajun restaurant on Bourbon Street. Great selection, decent food, g","useful":0,"cool":0},"h8J5l3bXYCL4BHdV57YlZg":{"text":"I'm not a huge fan of Bourbon St. in general but Olde Nola Cookery is worth it. The gator ","useful":0,"cool":0},"OfSQKgTzz_rc869zwAMcHg":{"text":"SHELBY IS AMAZING PLEASE REQUEST HER!  She is the essence of sweetness. The establishment ","useful":0,"cool":0},"VzDW8r06sAQr6UuTMWccCg":{"text":"The food here is awesome, I came to this spot twice in one weekend. I ordered the blackene","useful":0,"cool":0},"Dn_94kBtEPx_1srvEtZeDQ":{"text":"I had the shrimp poboy and a cup of seafood gumbo. Both very good. Good service and a nice","useful":0,"cool":0},"j7kCxoeHDbMvLjyrn8oRXA":{"text":"Nice place near our holtel. The pasta jambalaya is a must try!!***** vary flavorful and de","useful":0,"cool":0},"QqQTyLXIDsrYv0a0dRloiQ":{"text":"I found this place after coming in that day for a convention.  I was tired and this restau","useful":0,"cool":0},"mF2vyUaoJu5YC7MMP6fwQw":{"text":"Stopped by with friends for light lunch and drinks. Wonderful alligator bites and Cajun fr","useful":0,"cool":0},"6ZGGDDQ5StIFUfzJUb5wxQ":{"text":"The sandwiches are excellent. From the blackened catfish sandwich to the blackened chicken","useful":1,"cool":0},"9mEn1QHCtxrys6xSFDx0dg":{"text":"Great food! Great Service! John our server was excellent!  He offered suggestions and was ","useful":0,"cool":0},"ptyXUCgTAqBFPMMByx97Nw":{"text":"In town on business and was just craving some good New Orleans flavor. I ordered the speci","useful":0,"cool":0},"hPJY4StjSvIrZqVvMJJ45Q":{"text":"A bit pricey for what it is but that's expected on Bourbon. Great food and pretty good ser","useful":0,"cool":1},"xe9UV-pmr2rpPZFIAbxQaQ":{"text":"Gumbo good, needed a little \"spicing up\", shrimp po' boy was AMAZING. You have to try the ","useful":0,"cool":0},"CgXlgwLNobFPhrL6u_9t0g":{"text":"Hands down, best restaurant on Bourbon. So cute, and cozy. We've had to wait before cause ","useful":1,"cool":0},"AWN8ztJ4Q6LRuznfIPDuiQ":{"text":"What a New Orleans experience at a great spot right on bourbon street! We shared a cup of ","useful":0,"cool":0},"iYILjzIVTNZgEqggkLD0GA":{"text":"Came here with my family to enjoy a late dinner. Reviews were looking good and we were sta","useful":0,"cool":0},"N8gw5l0r8Cth0ZNiX9UIfw":{"text":"I was truly surprised by the quality of food at this little joint on Bourbon Street. We st","useful":0,"cool":0},"u3IIUxaucMstXdw0d0aT1w":{"text":"I'm not a huge fan of seafood but I can enjoy sometimes. I tried the Fried Shrimp Po-Boy w","useful":0,"cool":0},"BRrYcJ-nqIofU-5dz6cGyA":{"text":"Our server was great,and the food was flavorful.the crab cakes were perfect lots of crab. ","useful":1,"cool":0},"CtoV7q3m3I4E-jYN4UCrow":{"text":"The shrimp Po boy was excellent and the fries were battered and seasoned (really good too)","useful":0,"cool":0},"LLNJ4umEm-svSUaaIxqEQw":{"text":"Omgoooooodness!!\nStanley led us in and settled us in a happy vantage point.  He took great","useful":0,"cool":1},"wF3MAllkFbIgOx5ogxldhw":{"text":"The staff at this place are amazing, I don't usually write a review but they go above and ","useful":0,"cool":0},"MZYhSgdBo_2m9w-RjbA_0w":{"text":"Hubby and I are traveling in NOLA. We ordered delivery today. The food was okay and we wer","useful":0,"cool":0},"_BSkQHQOze4ZtAtAsIEeAg":{"text":"The food was awful and the service was not good at all. This was a huge disappointment. Do","useful":0,"cool":0},"P2kNQzO-dbu5UmV7PA-1Nw":{"text":"Stopped by for a quick lunch and were very happy with our choice.   We were not sure what ","useful":0,"cool":0},"JaKpdictaQm1nzyh9rEMGA":{"text":"My new favorite restaurant in New Orleans. Believe me, I've tried a lot: From over-priced ","useful":0,"cool":1},"ADwLxd1iDTJl7u-6L0pofg":{"text":"It was about 11:00pm on a Saturday and we hadn't eaten dinner yet so stopped in. The resta","useful":1,"cool":0},"7m0Z9tFBDQTiXNX5NUDRqw":{"text":"On our first night in New Orleans and we were looking for an affordable place to eat with ","useful":0,"cool":1},"Wdj-4VyuoDNVkhSUoq9XoA":{"text":"Umm keep moving the only good thing about this joint is the people .. staff were awesome, ","useful":0,"cool":0},"ho-NlmBzyMNhirPCmbVH2Q":{"text":"Good food and great service. The gator bites half and half was delicious, tastes like chic","useful":0,"cool":0},"arW814v1mntAsKJPbP-FZg":{"text":"I had the shrimp po.boy and it was amazing. The service was great. Langston our waiter was","useful":0,"cool":0},"48DWq1_zdDhucoy8hfqlsA":{"text":"After looking around for an hour or so, completely new to the city, we got many flyers and","useful":0,"cool":0},"p3Nzt86m-FWlshCxY90XEA":{"text":"Passed by and an employee handed me a 10% of coupon which brought me in. Ordered the gator","useful":0,"cool":0},"AnTL1nVTxeXgWPb0wlhnsA":{"text":"I love everything I've had here and they have a good amount of gluten free options which m","useful":0,"cool":0},"WE3IEG5ZOd3Ohh-w4lDBnQ":{"text":"Went for lunch and everything we got was excellent. Shrimp po boy, gumbo, BBQ shrimp, with","useful":0,"cool":0},"ZhqYD1qPts499m--5BS06g":{"text":"This is everything we heard it would be. Great portions, good prices and excellent service","useful":0,"cool":0},"kF6ah6zmSWARjGn9ouyGyA":{"text":"Not sure if it was the Hand Grenade, if I was really that hungry, or if the food was that ","useful":0,"cool":0},"CH1NoWH7lgn1ZRD2GQSuaQ":{"text":"Great atmosphere,and clean restaurant. \n\nFood was amazing had jambalaya with rice and my c","useful":0,"cool":0},"uY077YJhyN3L_olKj4SBqg":{"text":"so, our family is filled with travels and we always like trying new things, so we came acr","useful":0,"cool":0},"Ax3jZkxAyhwkSHXshndw8A":{"text":"Our service took forever and half of our meals came out cold. Just getting the server to b","useful":0,"cool":0},"P_JmYTcvxpEQZASpm4GB1g":{"text":"The best seafood gumbo and most authentic cajun food I have had in a long time. The enviro","useful":1,"cool":1},"31AoPee-wtvmu25U7ga7ow":{"text":"So I was walking through Bourbon St trying to get to Oceana Grill on Conti St but for some","useful":0,"cool":0},"0SvbC2D7b5Zn4llJcRFvFg":{"text":"Food was wonderful and our waitress Bri was awesome! I will definitely be coming back","useful":0,"cool":0},"xBphpT6w0Yd-NXacU4v-HQ":{"text":"For my first time on New Orleans was good. I had 1 dz of oysters and jambalaya. My wife an","useful":1,"cool":0},"v3EyChcPJopa_NtnAlB3vg":{"text":"Got seated quickly. At first we got a seat near the bar, but we asked to go to one of the ","useful":0,"cool":0},"Wxb9Uz6BgeMVuL15S3BuUw":{"text":"This restaurant was very delicious! We tried the sister restaurant yesterday Oceana grill ","useful":2,"cool":0},"MYuD6sOTW2TzR-hu726X1g":{"text":"This was a solid dinner spot on Bourbon street if you're craving some authentic New Orlean","useful":0,"cool":0},"Znpqc-zX-WYrNa3zqxzhrw":{"text":"I go here every time I'm in New Orleans and I am never let down. Great food and great drin","useful":0,"cool":0},"5FTB6Omci3yj7j5WymNniQ":{"text":"Food was delicious especially them gator bites and crab cakes my waiter was nice but extre","useful":0,"cool":0},"RbPCr_5xUGG_cH15CwK90A":{"text":"It was a late night and a friend and I were trying to find somewhere nearby to eat and stu","useful":2,"cool":1},"LCWNeBYdKM8ZTIALpM_MCw":{"text":"$38 for an appetizer and an entree for was decent. No seasoned well at all. There were a t","useful":0,"cool":0},"XcRRFRh18qL9LYwVrjTSMQ":{"text":"Appena arrivati siamo stati accolti da  Felicia la nostra cameriera che sin da subito è se","useful":0,"cool":0},"ZYS9blKwpSi4ftm1SoPjlw":{"text":"First meal in NOLA and it was so good! Got fried shrimp and the portion was huge, my boyfr","useful":1,"cool":0},"yjo-W9r_Db98P0Co6TyEiQ":{"text":"I enjoyed their gator tails a lot. It DOES taste like chicken. Delicious chicken. Cajun fr","useful":1,"cool":2},"K896sVCOTelTDosGlp7KEg":{"text":"Highly recommend the seafood jumbalaya! We also had the steak with garlic mash & tge seafo","useful":0,"cool":0},"n6a2Dywo0reR1nV4i4iTig":{"text":"Stopped in yesterday for lunch--ordered the New Orleans  sampler. Best red beans & rice, c","useful":1,"cool":0},"8eg4vsvUlful-jEhfz08Xw":{"text":"If your on Bourbon Street and looking for a place to eat look no further! Nola Cookery has","useful":0,"cool":0},"sEZ9B-dF34gavz4uaZR5zg":{"text":"Recently visited NOLA for the first time. During my entire stay there this place had the m","useful":0,"cool":1},"xaAuKM61gmL_6m_U_BswiA":{"text":"A worthwhile experience. The food scores higher than some fancier establishments and the h","useful":0,"cool":0},"Z_jtywxT-QMZv3zJNrH8Iw":{"text":"Excellent food overall. Raw Oysters were substantial and meaty, not slimy but a tad bland.","useful":0,"cool":0},"rTxGukSNjiGovIlMWXYP5Q":{"text":"Okay-I will say that I totally underestimated this joint. My parents had gone the day befo","useful":0,"cool":0},"3g18lE9eyrqOMJ37O4SNAQ":{"text":"Fabulous food and service. I'm vegan and they accomodated me with a TON of options - i had","useful":0,"cool":0},"GcSHEpXyIgzlFZ7xgpSaJw":{"text":"Good service. Just slow bar so it takes forever to get your drinks. The food was fairly go","useful":0,"cool":0},"VTHRFd-297Rmdo3d1wNGJA":{"text":"Excellent! The blackened chicken pork boy, the seafood pasta, bayou duck, they were all ex","useful":0,"cool":0},"O7wPct4-ZDKvsBMUYgzSuA":{"text":"Was looking for the Old Nawlins Cookery but a Google kept directing me here. So, I finally","useful":0,"cool":0},"wopsdwXIn75SV71IPqhBFQ":{"text":"LOVE this place!! From the warm welcome and the quick service and the delicious food, this","useful":0,"cool":0},"obTaPEq7Y6xlXIhVORHYQA":{"text":"I enjoyed this place the food was fantastic. We were seat immediately when we walk up.. ni","useful":0,"cool":0},"QNDTjntaJvTzqlzmUGypkw":{"text":"Blackened chicken po boy highly recommended. Next time I'm in town I will stop here first ","useful":0,"cool":0},"5RouuBf0Q8aED2P4h-9QVw":{"text":"They seem to have a confused identity are they the Olde New Orleans or Oceania? Signs and ","useful":6,"cool":4},"UN0-Vc4xtZOZgFlWYsQ8RQ":{"text":"This restaurant is the sister restaurant of Oceana.  Excellent food..   not so good servic","useful":0,"cool":0},"q9CI2iS5-8VjPKeMN2Q6qA":{"text":"First time in olde Nola and it was amazing, we tried crocodile  and I wish I could eat a h","useful":0,"cool":0},"ya_yD-Qkdr7PdTQW2XhPbg":{"text":"This was on our pre planned list of places to eat during our 3 day visit. At 12:30 I expec","useful":0,"cool":0},"uUE7avKZLZgKzXGZk4xJfw":{"text":"Overall:\nCame here due to the glowing Yelp reviews. These glowing reviews are beyond me. Q","useful":2,"cool":0},"2PcYU7j-0lmUWuFF8SMK7g":{"text":"Went here lastnight with a group of friends. We had the catfish platter, red beans and ric","useful":0,"cool":0},"bJmzyYizQTwxzNylRz6zdQ":{"text":"Amazing food, strong drinks and Jess M. gave great food recommendations!\n2 drinks, app and","useful":0,"cool":0},"SDZ1fXjyfCa1FT3WsVohbw":{"text":"Awful. Ordered the taste of New Orleans and the étouffée tasted like throw up. Myself and ","useful":0,"cool":0},"kEBxmws8znA_kzcFVJkXkQ":{"text":"Gumbo and roast beef Po Boy by far the best I've had in Nola... dying to get back to try a","useful":0,"cool":0},"UsmTLv1PdqD1rGd-NPVCew":{"text":"Found this place on YELP and went for lunch.  Ordered the seafood platter which is enough ","useful":0,"cool":0},"aXSiJhbaFs75G9-0g7Afng":{"text":"This is a cool on the cut place. Hospitality is pretty good. Made a mistake on the meal bu","useful":0,"cool":0},"0qTbdZPmlPQslk5FhXjcFg":{"text":"My first time every in NOLA and we found a cute little spot near the trolley. The streets ","useful":0,"cool":0},"wVAH2YBJmLFv4v4_p7SvAA":{"text":"Bourbon Street jewel waiting to be discovered by you and yours!  We arrived with a party o","useful":0,"cool":0},"UJeQlZwIiW9AQD1vDs96CA":{"text":"On the eve of Fat Tuesday, every restaurant was essentially packed and/or had a line waiti","useful":6,"cool":4},"mmtc4iQfbVts5dtbKm4BzA":{"text":"3 stars is a bit generous. But, our waiter was very nice and the crab cakes are good. Asid","useful":0,"cool":0},"RvkFhN2ptVRGo-N6IfgVfg":{"text":"Food was luke warm but very tasty. Highly recommend the blackened gator tail and the jamba","useful":0,"cool":0},"GUHPWumVavhGCtVU9hQx4g":{"text":"Pretty mediocre food as far as I experienced, not bad but definitely not great either. EXC","useful":0,"cool":0},"yqZaqdH2NalxPgfiFUQltg":{"text":"This place was excellent.  It was so good we went for lunch and dinner.  The service was q","useful":0,"cool":0},"2wUk28seuItcpo_9_-qKGQ":{"text":"The foods were hands down the best from what I've had around New Orleans especially the oy","useful":0,"cool":0},"MZIN_DzbjgDf9XK8ej8LIQ":{"text":"This was my first time in New Orleans, so wanted to try a restaurant that had a great rati","useful":1,"cool":0},"CAML1xta6VJesSJLk4jbhA":{"text":"Excellent Food, it's hot today so the cold AC was a PLUS.  I had the Taste of New Orleans ","useful":0,"cool":0},"80L5efFbT8Zb6VTFe8LxXQ":{"text":"Errol provided amazing customer service. For a 1st timer he guided us in the right path. D","useful":0,"cool":0},"AY6qpI3tN7wpCjTt2CZ9UQ":{"text":"Took my girlfriend here for her birthday trip to New Orleans and after many recommendation","useful":0,"cool":0},"5KXmTFHHDMo7wCmILTZrKw":{"text":"Yo after or before your night ends you have to come here.  The food is amazing and it's fi","useful":0,"cool":0},"DmQJcoUFS9zcQR9vGZAqag":{"text":"Errol was great! He was knowledgeable on the menu Nd made great recommendations. We got hu","useful":1,"cool":0},"SZig9HV2_nlm_YI1nJlaDQ":{"text":"The alligator 2 ways was good. Service was friendly but slow. It was our first night so I ","useful":0,"cool":0},"8rIAQkJ6oNw9Tr18GicPWQ":{"text":"We visited this place on a Sunday night. It was busy, busy, busy but the bouncer who facil","useful":0,"cool":0},"A9y7i2fmYKb-8dgHAl17BQ":{"text":"Do yourself a favor when you come to Nola, come here. Every time I visit Nola, I make my w","useful":0,"cool":0},"8pUmZ6-lwIo69m_VuPrnHA":{"text":"The duck is so good! Must try it! Great service, got free banana frost ice cream cake with","useful":0,"cool":0},"2dXiPhamA9XEZEVPw-DSKA":{"text":"We rented a room with a balcony off Bourbon Street and they catered the food.  It turned o","useful":0,"cool":0},"idZ_7FW42jRpRc-HOzj-GA":{"text":"The food and service was amazing. The drinks are incredibly strong. It's on Bourbon St and","useful":0,"cool":0},"fW6inx5cGUZLaJu4-F8P-w":{"text":"We stopped at this place on our last night in NOLA. We were craving gator bites and the ho","useful":0,"cool":0},"r7fICgrHT3ZQUEAjelnQ2A":{"text":"Hubby and I are traveling in NOLA. We ordered delivery today. The food was okay and we wer","useful":0,"cool":0},"mrOmaQ_F4plPnuK9M5mNVg":{"text":"For an after midnight meal I would have to say it had exceed my expectations. I ordered th","useful":0,"cool":0},"kTOkITe5MLr0k37htoYVwQ":{"text":"At 1:30pm on a Saturday my wife and I were seated as soon as we stepped in the door. We we","useful":2,"cool":0},"B9WKCAv8eblfqwXzzjjvIA":{"text":"The waitstaff was super friendly, Jess M had some really great suggestions. The Daniels po","useful":0,"cool":0},"iGeH_LKrTIDr7J8eoIdxGQ":{"text":"Great place for a quick sit down meal. It's conveniently located right on Bourbon street. ","useful":0,"cool":0},"aPgCq1tvdKGPf83HgI4pVQ":{"text":"We were going to Acme but the line there was too long. This place had no lines but we were","useful":0,"cool":0},"9sE9L6aOkxfNzcRMkRLlAQ":{"text":"HOLY CRAP was this food good. My boyfriend and I were visiting NOLA for New Years and we d","useful":0,"cool":0},"OznIGqgPyDL_NReDkQKuew":{"text":"4-stars for the food and service, an extra star for Joe!\n\nThis was my first cajun/creole r","useful":4,"cool":3},"LyxJNvTU2aR_FtNOksMIjg":{"text":"Loved this place! They were nice enough to let us get half and half for our entrees\n\n1/2 1","useful":3,"cool":2},"QmZp64ri1wItgtzlpuTb9Q":{"text":"We came for Christmas as was surprised to find the place open. Bri our server was great!  ","useful":0,"cool":0},"YHzPsWttW1pMQmryIYVZSA":{"text":"Great New Orleans food, beautiful courtyard, excellent service and there's always an Group","useful":0,"cool":0},"WxQCZAmjdHAEuxyt_H3NcA":{"text":"Waited over 40mins for blackened chicken and a pasta dish. it never came out. Manager did ","useful":0,"cool":0},"SqmcHbZOflCw-p2TZRPOrg":{"text":"Was good. The food was ok but not the best I have ever had. The price was reasonable. The ","useful":0,"cool":0},"X_WNjNHSjoHmdlBF6DUbbQ":{"text":"We went as a large group and got seated fairly quickly- no reservations. The drinks were r","useful":1,"cool":0},"0W89VOlMIk5W2ZQhUfDbzQ":{"text":"Good for a late night meal. The staff is accommodating, i enjoyed my experience . The Caju","useful":0,"cool":0},"eq8rv4JzRdejpAZxSljFWw":{"text":"Came here for lunch with 6 of my friends and I can say average. Looks were deceiving from ","useful":0,"cool":0},"c49cQYMzSVs7ZZNJSmaxwQ":{"text":"Get the Taste Of New Orleans.  You get to try a little bit of everything.  Crawfish etouff","useful":0,"cool":0},"YT7zGkM36m4pv4-pa46U3Q":{"text":"The food was fine, but a little pricey for me. Tried the Taste of New Orleans - the etouff","useful":0,"cool":0},"InEaJUc4oJsA0fpCi5uL1Q":{"text":"Pros...\nFast & friendly service! We originally wanted to go to another restaurant with the","useful":0,"cool":0},"iXaqeXFBwH996k4Iwn7g5g":{"text":"I was very confused on the naming of this restaurant because some places reference it as O","useful":0,"cool":0},"VWXomRa2OzjrDivKsOMZoA":{"text":"My brother and I stopped in for our first meal out in New Orleans. I'd seen a bunch of rev","useful":0,"cool":0},"TAN4naAPELkqijaNtpoW5g":{"text":"From the time I got off the plane at MSY, I had my mind set on one thing: a po boy and gum","useful":15,"cool":15},"pJ12SRlAnBaMTsxeInjthA":{"text":"Olde Nola Cookery, how I adore you so! As it was our first time in NOLA, my friends and I ","useful":1,"cool":2},"3yUsAAZ6SsTyW2XORmshyA":{"text":"Walking through the French Quarter and there was a very polite young man outside Olde Nola","useful":0,"cool":0},"LdTt_WAczNLF-f3PsdxKrw":{"text":"Great food and good environment! No wait, awesome service! Server was very knowledgeable a","useful":0,"cool":0},"s7mK7V7fVJv2Z2vjT5314g":{"text":"The food was great. Just what we were looking for - good local creole cooking. The shrimp ","useful":0,"cool":0},"OpT1y4iJfMeOCBn6VttpPQ":{"text":"I ordered the Firefly tea with lemonade (basically a alcoholic Arnold Palmer) with crab ca","useful":2,"cool":2},"FmuoD4F4PFgRa6SxnfEuww":{"text":"Terrible service at the bar. Left without even trying the food.","useful":0,"cool":0},"1JqoKb3-2AS2_U7xr7Rj0A":{"text":"The sauce that the blackened bbq shrimp (?) is made in is so mind blowing. We even had to ","useful":0,"cool":0},"j3ovVEV_ywAcMwk8AVXpyg":{"text":"We stopped here 5 times in our 1 week visit to New Orleans! Food is delicious (I especiall","useful":1,"cool":0},"qdnKooYvSz50qyfGGX26DA":{"text":"Our server Jess was fantastic and really took care of us and helpful in every way. The foo","useful":0,"cool":0},"2uAW1axRlaT7xnnc5ReokA":{"text":"Great red beans and rice and I enjoyed the PO-boy. Fantastic atmosphere right on Bourbon S","useful":0,"cool":0},"c-FF2TbGNFFm9heVs6x3vQ":{"text":"Ehhhhhh don't waste your time. I got the taste of New Orleans just to try it but was disap","useful":0,"cool":0},"7KRDIk3rXIq-lv0gflKl2A":{"text":"If it weren't for the long wait (about 45 minutes) between ordering our meal and receiving","useful":7,"cool":7},"WRqiCcmyfgZdWtZlrVRR0g":{"text":"Kendra was the best waitress! Besides the amazing service I received, she provided so much","useful":0,"cool":0},"waNCA_QrKYUqztVv6_-IMg":{"text":"The crabcakes and BBQ shrimp are amazing!!! Price is damn good for NOLA!!","useful":0,"cool":0},"ceppH3oguuYxvIJPM5ouGA":{"text":"Shenee was wonderful, the manager, also very nice , drinks food, great service, what more ","useful":1,"cool":0},"q-_7hDmGWg4bFSzomzmu4w":{"text":"Best place we ate this trip!  Try your fries Cajun style they are amazing!  Blackened redf","useful":0,"cool":0},"_k0qn0QkXpDtBnt12-BlRA":{"text":"Drinks and service as soon as we sat down i can't complain about that. \n\nService and crew ","useful":3,"cool":1},"1e9OmriQe65lVh940VoJ5g":{"text":"Food and service was excellent and Travis was our waiter he was amazing very knowledgeable","useful":0,"cool":0},"27GXs-ZJRTwl-LrqVwwkDw":{"text":"Excellent greeting at the door . We came early so the kids could enjoy the food ! The food","useful":0,"cool":0},"xQDRx-AUO8oo14PcEtLLxw":{"text":"The gumbo appetizer here was pathetic: a single crawfish, partial crab carcass, and just a","useful":0,"cool":0},"DT8AtK9pdTdksEy7HJ1BgA":{"text":"This place is garbage. It was the only option we had because all the good restaurants were","useful":0,"cool":0},"uQOzAVH2YUTGZDdynxLOPg":{"text":"The Original Cookery and lots of options on the menu! Many local traditional NOLA favorite","useful":0,"cool":0},"aJeR4iV_Bh5PPRT6MZ1-SQ":{"text":"Great good! I came twice and the customer service is superb! Ask for Charles cuz he really","useful":0,"cool":0},"bn7snvQxuqXD1EjQ4LkFow":{"text":"Delicious meal & great service!!  Highly recommend!!  Our table ordered the BBQ Shrimp app","useful":0,"cool":0},"NzWU2Us69H7V4uqfyVGFkw":{"text":"DO NOT ORDER TAKEOUT!\nDO NOT ORDER TAKEOUT!\nDO NOT ORDER TAKEOUT!\n\nGot a take out order an","useful":1,"cool":0},"vwZtpuaEgfoUtz9Kgey2sg":{"text":"Olde Nola Cookery is located in the thick of Bourbon street. This place actually makes you","useful":2,"cool":1},"fDGdUOxeJWsgnPUxXHDjAQ":{"text":"Fantastic biz on bourbon! The staff, the food, the ambiance is all 5+ Stars! The oysters a","useful":7,"cool":8},"QJKxA6CsM2QB0DuqM6ycLw":{"text":"Wanted to eat dinner in the French Quarter while in New Orleans for a family vacation and ","useful":0,"cool":0},"p_z4141gxj_D_afB7hN-0g":{"text":"Jess was our server and we couldn't have asked for anyone better! First time to the restau","useful":0,"cool":0},"idPftYd3qfZITBNivY3dkw":{"text":"The blackened duck was tender and delicious and the red beans & rice was to die for. I'd s","useful":0,"cool":0},"vru-NQW8vxKA-KFs16sf8Q":{"text":"The Gumbo and Chicken Fettuccine Alfredo were both solid meals with hearty portions.","useful":0,"cool":0},"SbCYcAzPuj8JuNDFNhXHUg":{"text":"The best Eatery in New Orleans! You will not be disappointed. We have eaten here 2 nights ","useful":0,"cool":0},"bm6N6u_PthF1cXiGoGYWyg":{"text":"SO GOOD!! it's been really challenging to have gluten free food that isnt just salad and f","useful":0,"cool":0},"dDEr28dSYQXgyIuVltve0g":{"text":"Average tourist food, to many boil in bag items to be a New Orleans Seafood Restaurant, ne","useful":0,"cool":0},"F_ffvN8BnTmny3OLDEM5Ug":{"text":"Oh my gosh!! Amazing!!! The restaurant was pet friendly and had a gluten free menu...ON BO","useful":0,"cool":0},"Xr9wuCjzJmUv_cTfd8izEg":{"text":"Jess M. Was awesome and the food was absolutely delicious! I had the Cajun jambalaya shrim","useful":0,"cool":0},"0x3z3uxz5KAQ7hsQs5YUxw":{"text":"A find example of a NOLA cafe style of place. Very good food. Fantastic staff and an\nInter","useful":0,"cool":0},"JZqUxTcXrHw-A27kMFF54A":{"text":"Great location on bourbon street for good food! We got the taste of New Orleans and a deli","useful":0,"cool":0},"sgcea5rkqFjRm9hYQmBGAw":{"text":"Shrimp poboy and fried crawfish were wonderful!!! Great service, very clean!!!! Wait staff","useful":0,"cool":0},"sPCNFYR3DbUm_G1erF77TQ":{"text":"Olde Nola Cookery is one of the few restaurants that is open late in the French Quarter, w","useful":1,"cool":2},"xl9FezqzG8cAfRqoWQSomw":{"text":"GREAT Food!  My husband and I ate here on a Friday night. Though the restaurant was quite ","useful":0,"cool":0},"W8ZxwP1uf_7zsibFRQOWog":{"text":"Service wise, 5/5. We had Brittany as our server and she was amazing. So helpful and sugge","useful":0,"cool":0},"WmEIUAwM5rIt3Nv3OclGOg":{"text":"Crawfish Etouffee was awesome! Was our first meal in NOLA, and it got things off to a grea","useful":0,"cool":0},"vXuUla9fpgJj7r4PL7ZSjQ":{"text":"I came here last night with a friend and we ordered the alligator bites, crawfish fries, a","useful":0,"cool":0},"z1yICEoKphJ2gyZI-yQAyg":{"text":"My wife and I had the Red Beans and Rice and the Crab cakes.   Both were amazing!  The ser","useful":0,"cool":0},"z8U_PbRVq5PhRUdz9RRuCg":{"text":"We ate here one night cuz it was close and we were starving.  We had a dozen oysters and p","useful":0,"cool":0},"qkqjZ4rlOosc1MnMlgXJ5w":{"text":"The food was great. I had the Taste of New Orleans. Everything was delicious. Service was ","useful":0,"cool":0},"WV1K0SqGguVm9kq1Ub_G2A":{"text":"We are here two times in one day because it was so delicious. The waiter Charles was atten","useful":0,"cool":0},"_3l753rXu0LP7dOe1M8qUw":{"text":"Everything from food to service was great! Jess M took great care of us and made sure we e","useful":0,"cool":0},"UsgJYUVUIsJiRjymrj7HSg":{"text":"Our first night in New Orleans.  Great food and great service from Jess M.  Get a balcony ","useful":0,"cool":0},"Q08yk35beKnikKEjeU1l4Q":{"text":"Awesome food. Had the taste of New Orleans and a Bloody Mary. Excellent food!   Will defin","useful":0,"cool":0},"KhB5Uhw87oxleQgJOG6TQA":{"text":"This place was amazing. We were able to be seated here with no way on a Friday night. Our ","useful":0,"cool":0},"8iNOedzECbT4RSsCT7LzFw":{"text":"Cute place, I tried the blackened chicken and it was pretty good. There is no parking sinc","useful":0,"cool":0},"DMbhHcv6TuzmF83n21B9JQ":{"text":"Guy outside was very friendly and talked my husband and I into going inside. Much to my su","useful":0,"cool":0},"hP7npBtZjGXHtJm8gpnKCA":{"text":"I wasn't a fan  of Cajun food before coming here--I'm still not really a fan--but I did en","useful":1,"cool":1},"KNyf-fd8Q0eAx8FG6oyitQ":{"text":"Food was good. Had the eggplant sticks and red beans. The food came in great portions and ","useful":0,"cool":0},"wq8O-8vB2ekUHa2O7DBjZw":{"text":"Ordered a Cajun jambalaya pasta with a crab cake on the side, finished it in 9 min flat. I","useful":0,"cool":0},"H58Mbet4U6Md8rAiIvNxoQ":{"text":"My friends and I visited Nola for birthday celebrations. Our first stop for food was Olde ","useful":0,"cool":0},"_G7W9f4MaCV7DprdUtxy3g":{"text":"Bad bartender didn't  have patients and customer service was horrible.. but food was amazi","useful":0,"cool":0},"c9JvjDbwnngk5hQ6KszU0w":{"text":"Food was more than we could eat!   Heaping plate of catfish, shrimp and oysters with sides","useful":0,"cool":0},"hGb0ByUrWlglIHL2g4v-Xw":{"text":"This place definitely deserves it's 5-star rating as do many of the eateries in New Orlean","useful":1,"cool":0},"nPdLdWuXKH2PVU5vDdhDfw":{"text":"Delicious food!!! We got the chicken Alfredo, gumbo, and a poboy.. all amazing! And high r","useful":0,"cool":0},"iKfRaDFAgsRaIUUH6ScaZw":{"text":"Unfortunately, we didn't have an experience here. It was late and it was Mardi Gras week. ","useful":0,"cool":0},"9hWOlfqXLxqTz-lB4egdTw":{"text":"If you don't eat here you aren't really experiencing proper nawlins food, the gator tail b","useful":0,"cool":0},"-SJ3MdHt8Ayqvh6X5JvN2g":{"text":"Wonderful place on Bourbon Street! We were lucky enough to get a window seat and enjoyed p","useful":0,"cool":0},"rxHn4f0RS1wual5GlqM8dA":{"text":"The food was great and our waiter Johnelle was great but the remaining wait staff was less","useful":1,"cool":0},"8ME_Gvkp75O7GzM7kpDY0A":{"text":"Just meh... it was convenient and filled us up but it's not the food New Orleans is famous","useful":0,"cool":0},"Is_9BMXT_74ojiv8Swgb5g":{"text":"This is my second time in New Orleans and is my second time at Olde Nola Cookery.  First t","useful":0,"cool":0},"MN-Eei15pJMig7vzW-sTHg":{"text":"December 2019 was my first time on Bourbon Street. We went to a wedding in Mississippi, th","useful":2,"cool":0},"IFC7ByvARjzCT13zw6kyLQ":{"text":"Great place for dinner on Bourbon Street! The service is quick & the food is delicious! Ch","useful":0,"cool":0},"IG-DGNrnSrkrEVO_JDmlHQ":{"text":"This was one of our favorite places during our vacation.  It's a real hole in the wall but","useful":0,"cool":0},"qvhtnJ0brzx6545mhTIrHA":{"text":"Located right in the heart of the french quarter and bustling tourist area is this cute \"d","useful":1,"cool":0},"F00iWUvWvXP35ReD5DDlyg":{"text":"Really nice place and good service. The platters have so much food on them it's enough for","useful":0,"cool":0},"VTfQozxYxQyftd7c0hvalQ":{"text":"This place hands down amazing. GREAT food with GREAT service. It's a little small place on","useful":1,"cool":0},"HGrOm1-WilacEwrSEe456Q":{"text":"After having a customary hurricane at Pat O'Brien's first, we headed back out to Bourbon S","useful":1,"cool":0},"6FraT2FyltRfasv4QqEh6w":{"text":"We had the crab cakes and the taste of if New Orleans. The crab cakes were amazing, they h","useful":0,"cool":0},"U5joLI9I9TB1yQTNzSy1LA":{"text":"Not overly pricey as many restaurants are around here. Waitress was extremely friendly. Hu","useful":0,"cool":0},"hR2MH7VdAKr8LA5Z3hmITw":{"text":"Had a great time. Johnell was our server and he did an amazing job. Answered all our quest","useful":0,"cool":0},"1IMxLeUCHVnReAMZpvDvpg":{"text":"The food was great and our waiter Ray made the whole experience awesome! Definitely order ","useful":0,"cool":0},"NJEEX0wh7owko3kqb1DGmQ":{"text":"I would recommend this place only when it's really busy. Me and wifey ordered the shrimp p","useful":0,"cool":0},"W4W6MptvQjqaEs7Zvg_10w":{"text":"Flavorful, delicious food and good service. We had the Cajun Jambalaya Pasta and Taste of ","useful":0,"cool":0},"aQMHFaEejfLXSgScjcaj2Q":{"text":"Food is delish can't go wrong with this place! Our server Katelyn was very friendly and at","useful":0,"cool":0},"uzHZe3lDUb0dEQJd6sZxlg":{"text":"So laid back and has a top notch staff. We ordered a little bit of everything for our grou","useful":0,"cool":0},"4tf0c6pCn5QAo-L6sSpIiA":{"text":"Food was ok (Greek salad had 1 slice of tomato and 4 olives the rest lettuce), staff were ","useful":0,"cool":0},"nfqYMVf-JY2gnsYIB8KgWw":{"text":"The chicken Alfredo was pretty good they give you a lot of chicken. Not sure if it's worth","useful":0,"cool":0},"j49hR0020SLRvrTvp75gsQ":{"text":"Food here is so good. Very flavorful! Absolutely delicious. Everyone should try this place","useful":0,"cool":0},"CPD9xb4nJN1Fd2rwrOVkDg":{"text":"Really enjoyed this Bourbon St restaurant! Service was good, especially considering how cr","useful":2,"cool":1},"TDXo8FZEvSf9yx5MkV4GFA":{"text":"Loved my Jambalaya pasta.  Everyone in our party of 7 was happy.  You will be too.  Prices","useful":0,"cool":0},"LguDdbb4zCI22CUsiCzV_A":{"text":"The crabcakes were divine. I had the trio also I'm not a big crawfish fan so it wasn't my ","useful":0,"cool":0},"DmhxacHLtoq-YgakzFRYfg":{"text":"Great staff, very friendly! The guy out front was a hoot so we HAD to see what the restaur","useful":0,"cool":0},"riapd6mdss8jHxmchcPfhA":{"text":"An amazing and unforgettable dinning experience with Jess Jones. Make sure to ask for her,","useful":0,"cool":0},"mjVy5OuA9CxKJ-69t25XzQ":{"text":"Bourbon street can feel very touristy sometimes and you feel like you're being taken for a","useful":0,"cool":0},"j7FNDbRGEgPEPqjtf0TP_Q":{"text":"This place was really good! We got the catfish poboy, seafood gumbo and shrimp platter and","useful":0,"cool":1},"iMV3Nmk4Rz59J4zvNVHkNQ":{"text":"Great food! Great service! Friendly! Gumbo and crawfish etouffee was bomb! We ate here 3 s","useful":0,"cool":0},"qDEJwuY_Kq-PelPiLDLTVg":{"text":"4 stars for the customer service. The food was ok. The ice cream on our brownie dessert wa","useful":0,"cool":0},"9VrSoIoZDvXcofxEmICEig":{"text":"This place is terrible. The red beans and rice, the gumbo and the étouffée are the exact s","useful":0,"cool":0},"EsryLC_qfcTp-tUIlTgKQQ":{"text":"Very unassuming but worth every penny! The food is fresh, well seasoned and served with a ","useful":0,"cool":0},"OzvFFYU__D4jowZcWgZRQA":{"text":"This restaurant was delicious.  My husband had gumbo that he enjoyed and he had jambalaya ","useful":0,"cool":1},"D2DJSB_RSfg3PH_p8IZ9YQ":{"text":"I  have been to NOLA many times. To get ettouffe gumbo and red beans and rice with a side ","useful":0,"cool":0},"gedj86hDx04fFQazjI28hg":{"text":"Great service and friendly staff!  The grilled alligator was the best ever!  Bloody Mary i","useful":1,"cool":0},"Fg58R-YbKKm4Chc5ePS8Mg":{"text":"Walking, hungry, and fortunately came into Olde Nola Cookery. John, our waiter, is a sweet","useful":0,"cool":0},"DihLrvafDiyP6Tp4LPh5dQ":{"text":"Delicious bread pudding. I'm on a quest for the best and this is the best so far. Great ta","useful":0,"cool":1},"-GyrezZaYu9VDHYvoUVlLA":{"text":"This place offers great food, good location, and excellent service! Thank you Langston, we","useful":0,"cool":0},"cwA5mCgem8-EZVPog9S-6w":{"text":"Had the Gumbo. First time I ever dared to try it. Didn't think that I would be interested,","useful":0,"cool":0},"qGvXrVTNBu2NAEQ1zNAN6w":{"text":"I actually had two meals here on a recent quick trip to NOLA, so I can recommend both dinn","useful":0,"cool":0},"Ma0PF6xBBg2nTT2W6MPZoA":{"text":"Very good food. However being in the restaurant business, I know that the service and mana","useful":0,"cool":0},"Rig3foo8jBRCFltNA8Fhwg":{"text":"I had the crab cakes to start off they were absolutely delicious..full of meat inside of s","useful":0,"cool":0},"3LtYXsIpvjClauVDGhZ9fg":{"text":"This place is designed to cater to the tourists that walk around bourbon street, and you c","useful":1,"cool":0},"8S32GyKMdBTF2Bj_B5wF4g":{"text":"On a rain soaked day, we got a recommendation for this restaurant. Immediately seated and ","useful":0,"cool":0},"xZktFqFL1LN86DWeag87FA":{"text":"Great location for this restaurant.  We were able to enjoy people performing on the street","useful":2,"cool":1},"BK4N-kvVuOHxwvSpdtxrBw":{"text":"Came here with the family after our 1st stop crashed and burned.   \n\nPlace was clean but I","useful":0,"cool":0},"VlwyWOZEp93LuWYEOGz2Og":{"text":"Came here because it was close to our hotel and was not at all disappointed! The blackened","useful":0,"cool":0},"aWi3JQmOdnN9IBsqfuXw2A":{"text":"The only reason I give this place two stars is because of the interior and efforts of the ","useful":0,"cool":0},"Lhbrx6IYU32o4SFL2B2FRQ":{"text":"This place is a blast, very good gift shop as well, and the historical themed meal is lots","useful":0,"cool":0},"QUtMvK-GaWBwbK6G8N0Fvg":{"text":"The oysters in the half shell are delicious! The Kentucky bourbon pecan pie was okay. We a","useful":0,"cool":0},"aHhAuFV9S-Lgb0A_5t774w":{"text":"This was actually my second time here. The first time I tried the oysters on a half shell ","useful":0,"cool":1},"75cFmaIQpvMCKjKPsxoMZQ":{"text":"Food and service was excellent.  Our waitress Victoria made great food recommendations sin","useful":0,"cool":0},"8p-iSmhOm7wJ2dwEREFjwQ":{"text":"Outstanding service and food! Felt very welcomed from the friendly staff and our waitress,","useful":0,"cool":0},"x3vDfkegutaRHS0yflzbCw":{"text":"Great place for some late night food while strolling down Bourbon street. A friendly atmos","useful":1,"cool":0},"Bye2vbdduR0qbbXfzNtIWQ":{"text":"We got seated right away. Waitress was very punctual with every part of our orde and very ","useful":0,"cool":0},"-hiUiLIkinFjEGM6XgEHYA":{"text":"Food was ok. Best thing I had was the alligator bites. We also ordered the fried sampler b","useful":0,"cool":0},"h7slCsoiKTaMIdySIskaUg":{"text":"At first it looked like we fell in the tourist trap, then we tried the oysters, the crawfi","useful":0,"cool":0},"GLT4LQuHIqZbP9eZNB5PjA":{"text":"Easy location on Bourbon St., this was my favorite meal while in New Orleans. Casual, loud","useful":2,"cool":3},"SqDACDgPAAQiezkbt5Y1SQ":{"text":"The food is SO good. We found this hole in the wall by accident and have already come back","useful":0,"cool":0},"LHypq3YaOnkFXTYteo08DQ":{"text":"Split a  fryed seafood dish and a decent bowl of sea food gumbo. It was all good but not g","useful":0,"cool":0},"ytx9Fs7VC755hWJU2lBIfw":{"text":"I had the $18 Taste of New Orleans and it was delicious!  The gumbo was good and loaded wi","useful":1,"cool":0},"5tt1QCHRaHj4wY6OX0q7mQ":{"text":"Yummy! This was the first real meal we had this trip and it was a great way to start the w","useful":0,"cool":0},"ckq6yCbA65CF-rezO3WovQ":{"text":"Great place, reasonable pricez. Try the Cajun pasta and dine on the balcony. Great view. S","useful":0,"cool":0},"Jlw6KWYfsrVzSo8nOr7mcg":{"text":"Came all the way from Tennessee appetizers were luke warm. Gumbo tasted like water and sea","useful":0,"cool":0},"G-JLF5EXelbjzwr6-c-Q0A":{"text":"Red beans and Rice, along with the alligator would be an excellent choice! Awesome Food!","useful":0,"cool":0},"aZMP86YLbf6QIoJP5Y6YFQ":{"text":"Crawfish Etouffee was delicious! And they sat us quickly on a very busy Saturday. This pla","useful":0,"cool":0},"LaX9GSKTqKoPb5ssLqf7Yw":{"text":"The food was authentic New Orleans food, I loved the food and the ambience, will definitel","useful":0,"cool":0},"8zrrI0rgnctukhvXuqYfTw":{"text":"Just arrived and checked into our hotel and we quickly hit the streets looking for somethi","useful":0,"cool":0},"pgRAyY5-8rgmccaSxK4amw":{"text":"My son and I are taking a road trip to his 1st duty station and New Orleans was our 1st st","useful":0,"cool":0},"zvXj3qmeLx68JZJv6UKBdA":{"text":"Not a big fan of Cajun food so hard to fairly judge their food but I do like the environme","useful":1,"cool":0},"kFS0uqcX46A2fjVJ6KJQQg":{"text":"The food is superb!!\nWe order the crawfish etouffee, jazzy crab cakes plater and gator tai","useful":2,"cool":0},"raHYiBexyodx78OLACGiXw":{"text":"We stopped at this place after finding out the restaurant we were originally looking for w","useful":0,"cool":0},"aYdH0FJkfpjjBHCVbI5Vxg":{"text":"Delicious and inexpensive. Find your Nawlins faves here. The Gumbo, étoffées... a définite","useful":0,"cool":0},"KIysOE3rubf0gnbs3Y7c6w":{"text":"Great place to indulge in delicious local tastes without frills & at reasonable price.","useful":1,"cool":1},"a3sw7aqg4a9nvjFIUpKQ6w":{"text":"This was the first restaurant we tried during our staying New Orleans. The service was the","useful":1,"cool":1},"znSxKyov2zAMaPkjH1z2jw":{"text":"My husband described it as \"stupid good\".  He had the fried catfish and shrimp platter wit","useful":0,"cool":0},"0nx6bqUugnfCaOhZydzEMA":{"text":"I went there twice! A gentleman was talking to me on the street and I told him I wanted so","useful":0,"cool":0},"M7fyS13Vnmr7l6n0763dbg":{"text":"Outstanding service and wonderful views from second and third floors of Bourbon Street... ","useful":0,"cool":0},"VxkcJPT_-SL4H6Kw4nbRiA":{"text":"Peter is an awesome server. The food was delicious. His recommendations were amazing. Got ","useful":0,"cool":0},"d7YVjoQ5bIO7V7QgW0Kpsg":{"text":"During my visit to NOLA this was probably one of my favorites. We stumbled across it while","useful":0,"cool":2},"7eLT7O7KJ8l3G1QgqFTOmA":{"text":"Honestly, on Bourbon street you get what you pay for. Our service was excellent here by ou","useful":0,"cool":0},"bTVT6zX6czj0wuq3F8webg":{"text":"Ordered from this place using Grub Hub the food came fast and hot!! My wife has the blacke","useful":0,"cool":0},"cFrvZJdmsLH4yoHPv2_WhQ":{"text":"Found this place on Yelp and we were looking for some traditional food at a relatively low","useful":3,"cool":2},"z7OohpkJMic06EVqMy7Uqg":{"text":"This feels like the Applebee's of Cajun food. Gumbo, etoufee tastes microwaved. Fried gato","useful":0,"cool":0},"v67eATVrreamvVUjX--pRA":{"text":"On advice of a local we stopped in for a light lunch. The fried seafood platter with added","useful":0,"cool":0},"fRlVfY6ugr8yxCz5TcYVeA":{"text":"2nd day trying New Orleans specialities. Atmosphere was electric inside the restaurant and","useful":0,"cool":0},"Wc49ABV6bkurlRlsP3t6Iw":{"text":"Simply amazing jaw dropping Cajun Jambalaya. I recommend getting it with the Rice .Great a","useful":0,"cool":0},"xQ7sYGdv_XGGTvAmQvRYnA":{"text":"I have nothing good to say about this place.\n\nI ordered food to go, which I sat at the bar","useful":3,"cool":1},"1czVRn1Or8otKRygZUC0pA":{"text":"Super yummy. Especially the cheese sticks! Best bread pudding we've ever had. Jess M was w","useful":1,"cool":1},"gYgYHDVZ4G4uGAzCU1ic1A":{"text":"First time in NOLA and what better way to get acquainted with this fine city than by dinin","useful":1,"cool":0},"O7uKOjbt0FHivlV4FEcTUg":{"text":"The atmosphere is amazing. My Bartender Lawrence was really on point with customer service","useful":0,"cool":0},"_XDJFp9jUZuuR4SaH5mEcA":{"text":"Had the chicken fettuccine Alfredo to go. Was flavorful however the plastic utensils were ","useful":0,"cool":0},"W6cJb5BahMgSUW43PDjWOQ":{"text":"We loved the peel and eat barbecue shrimp. Keep in mind that New Orleans barbecue sauce is","useful":0,"cool":0},"qxZSvrD6D9r899iekw0Aeg":{"text":"Jess M. took great care of our table with her suggestions and service. \nStan made sure we ","useful":0,"cool":0},"gttePnOvjrrL4eu3y7NiSQ":{"text":"Good place to try seafood in NOLA. Prices are pretty good and they have sample plates as c","useful":0,"cool":0},"cZc5x-OBEoXRqSXlzfC23Q":{"text":"By far the worst restaurant in New Orleans. I had the fried shrimp po boy. How can you mes","useful":0,"cool":0},"KPNGwSY5B74VT6S12rpnnw":{"text":"Joseeeeee!!! This girl killed it with our group of 10! Great food, great service and great","useful":0,"cool":0},"phtEN3Qrk2GdLJ0arLoAZA":{"text":"The food was really good I really love the blackened gator meat and fresh oysters. But!! S","useful":0,"cool":0},"4ZYCdTRTAs7i0xUyPf35sw":{"text":"Came here for lunch on a Tuesday. No wait at all. Our server was very nice. I ordered Blac","useful":0,"cool":0},"wSclIRBMRDgg4AHaGz_OZQ":{"text":"Lawrence was a stellar bartender! Double checked that I like my drink :) Ordered oysters a","useful":0,"cool":0},"PmJmAhnOafR6cfqgdN1DNg":{"text":"Jess m. Was such a fun person at olde Nola cookery. We're here for a week and we plan to c","useful":0,"cool":0},"E44StSRU09cTKAvHzY1nXA":{"text":"Wow!  This place is great!  We were STARVING and Trina saved us!  She gave the best servic","useful":0,"cool":0},"tXsUHOWwbGFcbvnG8gQZkQ":{"text":"Lawerance was the best!!! We love this place. Food was on point and fast. Service was noth","useful":0,"cool":0},"ynQB3hQWCj_8IEpekLPbcA":{"text":"Another fine eatery in New Orleans. We got the gator bites, half and half( grilled and fri","useful":0,"cool":0},"oHRFflXhV8axbN-ytQiKhg":{"text":"Gumbo and beer were delicious. The service was wonderful. Stopped for gumbo and sooooo hap","useful":1,"cool":1},"50xe6LBa8nLoVrZn7H229w":{"text":"Amazing food and excellent service!!\nJess M was our waitress and was super friendly and he","useful":0,"cool":0},"XDJmONIKGVpejqgP7txDKQ":{"text":"Great place to catch some authentic New Orleans cuisine. Service was awesome, food great a","useful":0,"cool":0},"JUFVnyn6CtySxTnQJvS6Eg":{"text":"Stumbled upon this place just walking up Bourbon and we were very impressed! We went durin","useful":0,"cool":0},"AoettJ9KU3N4diWuQFQqaQ":{"text":"Amazing food and good service from Briana. Had the crab cakes and they were wonderful. Fir","useful":0,"cool":0},"2bRDJMiQU8QYKD2z-CQ4ZA":{"text":"Olde NOLA Cookery was fantastic!!!!! I'm still in awe about how well the collard greens we","useful":0,"cool":0},"hkp69Mz_LdMdo5M7xOK00A":{"text":"Every time I go to New Orleans from now on this is on the map. The fried crawfish were SOO","useful":0,"cool":0},"ATUNatVkA-3tPSn_G7TxeA":{"text":"Came here on a recommendation for authentic Cajun food. Good friendly service, clean dinin","useful":0,"cool":0},"kWcfzC4U1FSujnkv_MiktQ":{"text":"We went there late one night (10 or 10:30 pm) as it was the closet spot to our hotel that ","useful":1,"cool":0},"hIO2p24xlnduI39CREp3pQ":{"text":"Came here for a quick midday snack, because if you aren't eating all day, you aren't doing","useful":0,"cool":0},"izNh4ikD0WhS61rBp7JzHQ":{"text":"Excellent breakfast. Had a number of speciality \"Benedict's\". But we opted for pecan panca","useful":0,"cool":0},"nl6r6Nct2fX4Z_T0StCjow":{"text":"My friends and I were in New Orleans for this par Mardi Gras and ended up eating dinner he","useful":0,"cool":0},"bk4yDUVvycP-0OAgs1xkbA":{"text":"The Cajun Fries. If you get anything with a side or fries, spend the extra $3 and make the","useful":0,"cool":0},"5u49GrWTegMfDn99nG6MzA":{"text":"Our server, Guy was excellent! The Cajun pasta with blackened shrimp was delicious. So muc","useful":0,"cool":0},"WhvVUDo5JgPG7ee2quU55g":{"text":"Place was quite full but they got us a table for 5 pretty quick. Food came out pretty fast","useful":0,"cool":0},"aB7vg3kWxXpnGSPhJBP_ag":{"text":"I ordered the shrimp platter which was super hard and flavorless. The service was horrible","useful":0,"cool":0},"qY77CscKJwkWKXO3dKLJhg":{"text":"Good, but not great. Our waitress Shelby was super sweet and very helpful. Portion sizes w","useful":0,"cool":0},"172FX99uTMqROs2Dho4T2A":{"text":"Great place for authentic NOLA cuisine and the service was fantastic. Trina served us and ","useful":0,"cool":0},"muejjxQjXxGtaAhzuGi7uw":{"text":"This is probably the friendliest, most attentive staff in NOLA. Langston was awesome! The ","useful":0,"cool":0},"tyPb2TXzkomhaGQPSg1dcw":{"text":"Horrible, don't even plan on going here. First time in New Orleans and wanted to try a pla","useful":0,"cool":0},"4flgBS3-rQINL7-7KMXcog":{"text":"My family  and I visted this place after a nite on the town. The service was great the foo","useful":0,"cool":0},"S94GkP1uGxw_9pxMkeGebQ":{"text":"Strolling down Bourbon Street in New Orleans is quite the adventure, and wandering in to a","useful":0,"cool":0},"_OqJKMRSUdahi8324MOzig":{"text":"Josei was great very nice with great service. Food was delicious great was to start our tr","useful":0,"cool":0},"P5DAaihT4bIWmJEQgJI12Q":{"text":"The Redfish LafourChe was amazing. Ray provided great service and was  spot on with his re","useful":0,"cool":0},"1_lIUTLaB0Bm_8CkrVOOSA":{"text":"Sitting at a table in this SMALL place for 20 minutes. So far not ONE server has made eye ","useful":0,"cool":0},"kIWJHQrPnj6bT_UYQl1ejA":{"text":"Super yummy food!! Jess M was our waitress, and she was awesome!!!! We tried several kinds","useful":0,"cool":0},"5HV5pscc7D36qYygSabY8g":{"text":"Food was good, but the pictures can be a bit decieving. They do make their drinks pretty s","useful":0,"cool":0},"IuruetIV1SvYQNANBEhrvw":{"text":"This was my first meal upon arriving to New Orleans. I had just arrived at the hotel didn'","useful":9,"cool":6},"EtFkzlVXTwN6Ym_TNdiO_g":{"text":"I loved this place! Our server Shanee was the best! So attentive, very helpful and knowled","useful":0,"cool":0},"R48SKeXIWzBe-L6NGFMHfw":{"text":"It's easy to get caught in the tourist trap of Bourbon Street especially when it's your fi","useful":0,"cool":0},"EFBDR9hn6fNW-8_ZiiDlfg":{"text":"This place is great, it's more of a late night I'm starving post drink dinner. But that's ","useful":9,"cool":3},"ZBn68Z_EsQlNyY6mMcqtnA":{"text":"Excellent experience dinning and drinking at NOLA. Food and drinks were excellent, and the","useful":0,"cool":1},"6dfdEtesW05GzwWgC49_SA":{"text":"Ok so I was in a pinch on Bourbon street. I needed some food and did not feel like walking","useful":3,"cool":1},"KuT05kNXFb5EY23r5kWZBA":{"text":"Food was so so, bit overpriced.  Medium steak cooked well done.  Drinks ran dry.  Server n","useful":0,"cool":0},"7nQZ0wzkQNQSvRLGYyIMmw":{"text":"So if you happen to have the munchies on Bourbon Street after most of the nice restaurants","useful":2,"cool":0},"fyBtRvQUDPHZDUmH1LVc5A":{"text":"I had a big ass po-boy! Good#  omg# so delish# The gumbo was on point.  Also if you checks","useful":0,"cool":0},"vk1Z778y9cUKApbgx-RJBQ":{"text":"My husband had crab cake, he said this is the best one he has ever had by far! \n\nI had shr","useful":0,"cool":0},"BQkRdc_frDOiHwLq0nGlpg":{"text":"Stopped in for lunch and got seated right away by the guy outside trying to convince peopl","useful":0,"cool":0},"FJNo2N5KNbi-AbHKoYXqGg":{"text":"Been to New Orleans many times and usually skipped this place because it was \"right in the","useful":0,"cool":0},"DBEBfPc95_tK-2e3yitTHQ":{"text":"Like:\nLocation, Location, Location: In the heart on the French Quarter.\nDislike: \nLocation","useful":16,"cool":9},"l7F_L4FiVL7Eg8c-N4etUw":{"text":"this place had the best crab cake i have EVER had. not only was the food itself amazing an","useful":0,"cool":0},"Fnla3I-uWQTzSkJ_Qp6heg":{"text":"My server, Langston, was wonderful. 5/5 for him. \n\nI decided to eat here because it is a s","useful":0,"cool":1},"BIMaw1tKhDDcvyo0j_HRCA":{"text":"Guy is amazing, any time you're here ask for him! The food was great 10/10! The crab cakes","useful":0,"cool":0},"51St2iUMHCndAXnDPsPkdQ":{"text":"I had 2 Po boys on this trip to NOLA. The oyster one here was OK with tasty and juicy oyst","useful":2,"cool":2},"KMK_sBBGn1g_Tehqab5ByA":{"text":"5 stars just doesn't seem like enough! SO Good!\n\nOrdered through Door Dash. Driver was gre","useful":0,"cool":0},"LiXCFFBFZ1Vjl86sEg2hAA":{"text":"12/19/2020\nExcellent gumbo and decent red beans and rice!!!  \nThe Blood Mary is a MUST!!!\n","useful":2,"cool":1},"-D8_Of9r_UdfoGyGGJdg-Q":{"text":"There wasn't a day we walked down Bourbon Street and they weren't busy. There was always a","useful":0,"cool":0},"VZ7UdXWuiQvFbori2pxn5A":{"text":"The oysters made me sick ((literally)) and service was garbage. We had to keep flagging th","useful":0,"cool":0},"e0sEMnyFFbjpaL5DsGVIew":{"text":"Awesome food and atmosphere . The staff was great . The location was great with regards to","useful":0,"cool":0},"iDr50HKZFDSF5rkac4vFPg":{"text":"Came here on our last day in New Orleans for a bday dinner. I ordered the jambalaya, my bf","useful":2,"cool":1},"N7xF4Pw4qzWLMmO-9KGRtg":{"text":"I had an overnight stay in New Orleans, I arrived late and was hungry. I went to the hotel","useful":1,"cool":0},"-S2StVj4JjBopRNgFHWhvA":{"text":"OMG!! It was after 10:00 PM and I hadn't had dinner. After walking around several blocks, ","useful":0,"cool":0},"rFHUpTYrWHFDRx3-Ipth0Q":{"text":"Came here for an afternoon snack, and it was pretty good! We got to sit upstairs on the ba","useful":5,"cool":6},"mABYu809QSDF1_6MCizKeQ":{"text":"Traveling from ATL everything was great Bri was our server . She was fun and my shrimp Po ","useful":0,"cool":0},"viJIaPj_3141rUheFgHY6A":{"text":"Walked in off of Bourbon St at like midnight. Amazing surprise. We got crab cakes and the ","useful":0,"cool":0},"LMX9EHBTfoNgNfBAT6ZnEA":{"text":"The absolute best shrimp alfredo I have ever had! And the mustard greens were DIVINE! Tast","useful":0,"cool":0},"nOw_lYtZy3dsEaK-76vSwA":{"text":"We just happened to come into this place while walking down Bourbon.  The bbq shrimp is am","useful":0,"cool":0},"Fv41_kCkg43iF5mYkSvhRA":{"text":"I was warmly greeted immediately upon entering the premises and promptly seated.  Then I w","useful":0,"cool":0},"w585AkGatng2HWhZ6DUFoQ":{"text":"Marvin and Vickie and the whole crew are grrrreat! I recommend the Jambalaya Pasta and the","useful":0,"cool":0},"lSdTBHPeCC1gopoM3C1_fQ":{"text":"New to NOLA, but if this is the definition of authentic New Orleans cuisine,  I'm disappoi","useful":2,"cool":0},"bNz6R_sl5pRduwQ4ZPtm4w":{"text":"Delicious Poboys and Cajun étouffée' in a chill environment right off of Bourbon street. O","useful":0,"cool":0},"xrkVOoOOdmiuYxcLfR9Irw":{"text":"The food, atmosphere, and service was exceptional here. Jessica did a phenomenal job takin","useful":0,"cool":0},"e9vrArl-z5klpSzLLNW2jQ":{"text":"Great place for lunch. It was right by my hotel and after traveling all morning, we were h","useful":4,"cool":4},"GWo_81FyHtbA1YwOQr0IpA":{"text":"My boyfriend and I came to NOLA for a long weekend.   We stayed very close to Bourbon Stre","useful":1,"cool":0},"vi-NUHZygIXyFb7yVAnBJA":{"text":"This is, basically, a tourist trap restaurant off Bourbon Street.  You're not going to get","useful":2,"cool":3},"3AI7bYNCFPc2zL2H0BEm6g":{"text":"Came here on a Monday night around 6:30 pm and no wait! Jess m was our server and was amaz","useful":0,"cool":0},"8x0M_LoTx0b1SEWdrzNdhA":{"text":"While the reviews & service were great, I'd have to say the food wasn't..\n\nMy boyfriend go","useful":15,"cool":9},"SoIcP_VqURMMcp83Vqklkw":{"text":"Sat Feb 15 (very late!) After spending too many hours standing on Canal at parades, we sto","useful":0,"cool":0},"b09YBV9uDPs00wML9G9cxw":{"text":"Awesome spot! From meeting the host and being seated to leaving we were well taken care of","useful":0,"cool":0},"dxFPcwSbJ6TAu3LtHRqVsg":{"text":"Ate here on 12/31/2019.  I had a shrimp Po boy sandwich and hurricane.  The sandwich was y","useful":0,"cool":0},"tYarkX3YIMBiEqzA5imz6w":{"text":"Everything was great, my 3 friends and I got the 4 entrees and shared a lil bit with each ","useful":0,"cool":0},"A9MTclgEAksw0nKotyhhiw":{"text":"By far the best place we found while in New Orleans!! This place is beyond yummy!! We star","useful":1,"cool":0},"uSBBlJvkMqsL2QtnKPiz8A":{"text":"This place is amazing! We went on a Saturday afternoon around 3 p.m. for our very first ti","useful":0,"cool":0},"wvYehQPa7or1qk8NYwOmSA":{"text":"AMAZING PO BOYS!! Get the blackened catfish or friend shrimp. Also the New Orleans lemonad","useful":0,"cool":0},"n6HQ1VApIfF7NvFSg2dK4A":{"text":"Ok so here's the deal. The food here is pretty legit. We popped in a few months ago when s","useful":7,"cool":0},"TS3L3kY3d6d9HdbGliaExQ":{"text":"So this place is opened\nLate! And the ribs really fall off the bone lol! The mash was nice","useful":2,"cool":0},"Sxqq2c_Rf_QzHVFHaQFu_Q":{"text":"I'm not sure why this place only has mediocre reviews because this was my favorite spot on","useful":2,"cool":0},"yfGw9LjB3hkcHZ780ddCcQ":{"text":"I think this was my first Gumbo. I literally just stopped in for this dish.  I liked it.  ","useful":21,"cool":23},"-69-xr_soXPpGQo0jrtTew":{"text":"I hate to leave a negative review. But, I had the chicken and sausage gumbo and it destroy","useful":1,"cool":0},"wBp-Mm8IeEfJI2SuOttw6A":{"text":"Located in the heart of Bourbon Street, the place had  a crowd and a long line waiting to ","useful":1,"cool":0},"6jHXqZpPbrEYCrSdsWBPEQ":{"text":"We had dinner here 6/10/2021 and had the best waitress, Bri. I'm not a big fish eater, but","useful":0,"cool":0},"xX_xq52BCKejv6v9OTgGFw":{"text":"I don't know why this has four starts. It's literally the quality of food you would get at","useful":1,"cool":1},"lLlpB7islEVw5m_3sEYHrA":{"text":"Cute restaurant, very friendly staff, Frank, host or waiter, he was outside trying to get ","useful":0,"cool":0},"deuYYzUhpP9b0olIvwY5zw":{"text":"Stacy and the greeter were fantastic! The pasta was delicious too. I am picky about chicke","useful":1,"cool":1},"seGznSgPm5e_VIWVjS97wA":{"text":"I've eaten there three times now and every meal has been a hit. The crawpuppies were surpr","useful":1,"cool":0},"3ALGXYbuP5NQPdf07x9gcQ":{"text":"Service wasn't the greatest. I ordered the Po boy sandwich and the catfish wasn't fresh, i","useful":0,"cool":0},"n_TFXvH46twIwpxMDxP4WQ":{"text":"My blackened catfish pro boy was very flavorful and filling! The fries were crunchy and al","useful":0,"cool":0},"R1rHJq--NqvmoB4O2WLysg":{"text":"I've lived in New Orleans for six years now, and this was my first time to Olde Nola Cooke","useful":0,"cool":0},"Sp0ijERK7ofGFgcHoSN3mQ":{"text":"Location:\nIn the heart of the French Quarter.  \n\nDecor:\nA bit bland but nicer than a lot o","useful":0,"cool":0},"re6DkOQPcKuxr1Fseohzkg":{"text":"Food and drinks was spectacular. Top notch customer service as well. Food also came out in","useful":0,"cool":0},"QJMqARyPBREOq1dI1QHiaQ":{"text":"So glad I found this place! This was our first real meal while in NoLa. We had to go with ","useful":1,"cool":1},"ugYwxmDTorVE0JtMzqDuaA":{"text":"Had a fried catfish po' boy.\nThe fries were excellent, the fried catfish and the spicy may","useful":3,"cool":2},"MjuT8exGpgZlSyFaVeqO3w":{"text":"Nasty food caused stomach ache. Not authentic . Overpriced with small portions. Tourist tr","useful":0,"cool":0},"sphabraFfZrZA6rGjvWVtw":{"text":"*First* the greens are FIRE!!! Full of flavor and (just recently found out) cooked with NO","useful":0,"cool":0},"a37Hk_ZxjdhmDuTozNncuQ":{"text":"Had the Mardi Gras pasta and it was ok. Shrimp and crawfish were good. The pasta on the ot","useful":0,"cool":0},"6jvjm15S3uoyv3d3e0Nx-Q":{"text":"I'm not sure where to start with this amazing restaurant. EVERYTHING I tried here was abso","useful":0,"cool":0},"KyhiKVK_w8ExZ5Iksc-9Og":{"text":"Go to spot on Bourbon Street! Great for New Orleans Cajun food and other favorites. The hi","useful":0,"cool":0},"5pv9U4uR7dcVgNtF7PxPIw":{"text":"Delicious catfish po boy first time in New Orleans. First true New Orleans meal! Pretty sm","useful":1,"cool":0},"OouOAFA89GSp9GOLHN7oeQ":{"text":"This place may not look like much when you walk in and there was no wait when we went, but","useful":3,"cool":0},"78maHVRhgc8n04f67QYI8Q":{"text":"Alecia was amazing! So friendly and kept us laughing. And she recommended blackened over f","useful":0,"cool":0},"x_3KxI2EQBwWTCKoJ1BGJw":{"text":"With all the great places to eat in town it was hard choosing where to go. But because the","useful":2,"cool":0},"jx5P7RUmpcGcyFwqYA4sow":{"text":"Service was amazing and so was location. Food was okay but not as good as I would have hop","useful":0,"cool":1},"hqxsnFqEI66q6ahQtv-nsw":{"text":"The food was amazing service was great\nAnd they also have a gluten free menu\nWe ordered ri","useful":0,"cool":0},"JZosWCO0_XAXra66aWfaAg":{"text":"We were actually looking to go across the street looking for Gumbo but CHARLES caught our ","useful":0,"cool":0},"KPWPXyN3rcj5xexxIlFB_g":{"text":"Devin was an amazing server and the food was so yummy! We came for the afternoon and will ","useful":0,"cool":0},"bVFO8GGGS56xvXTlAr0sCQ":{"text":"We dined in the Cookery for dessert only. \n\nWe were quickly seated in a wonderful window s","useful":2,"cool":0},"jnKOfH4MJEF6r2M5muOLXg":{"text":"I am not a seafood or a fish eating guy. But after going rouge in the Bayou for 3 days and","useful":3,"cool":2},"5ZCdNGB3LxlWsI-71uuQPQ":{"text":"Awesome food and service and the server Bri was amazing!! Really enjoyed the food ! She re","useful":0,"cool":0},"NutTP6vn8kK6s8PRnSFH7g":{"text":"The wait to get in wasn't too bad, much expected, but the wait to get food was extremely l","useful":0,"cool":0},"akVh_wADqsup03BVmueX0w":{"text":"Highly recommend this place! It's nothing fancy which I personally like, but definitely on","useful":0,"cool":0},"W9md-oWGjmzNrBT0DLG4oA":{"text":"Had the gator tails and fried oyster po boy and it was delicious! Good place to stop by an","useful":0,"cool":0},"j-8CnqTzRrEO72IamQ77Vw":{"text":"So after partying on Bourbon, your girl worked up an appetite! It's right off of Bourbon s","useful":1,"cool":1},"qcPbhooo1c2Iw5ZgQgGOpg":{"text":"Loved this place! It took a while to find a reasonably priced restaurant open on a Tuesday","useful":2,"cool":0},"7j46XBH75SvVdJ_XU1NDZw":{"text":"I wanted to like this place. I heard it had good reviews but my personal experience was aw","useful":0,"cool":0},"YEIC6nfvNm4Xtx12wQfowg":{"text":"Best Bloody Mary in Nola!! So yum and so close to our hotel. Made friends with the people ","useful":0,"cool":0},"VKbytKnl4SQmZ9RE4KC6cQ":{"text":"Food was cold, drinks were watered down. Service was not exactly the friendliest, last vis","useful":0,"cool":0},"_lg9g_SXw-PXBLWNLcVFcA":{"text":"This is a great place to get some amazing food traditional of New Orleans. I highly recomm","useful":1,"cool":0},"9wwB2NXzpZsQ48TApJwg4A":{"text":"My wife and I set out in 1988 to learn Cajun/Creole cooking and was fortunate enough to be","useful":0,"cool":0},"QtxGvXOAPZQ6PLhOOnznkw":{"text":"Had the New Orleans Trio didn't overly care for the gumbo but the other two offering were ","useful":0,"cool":0},"HtQrxi1TnNDVWMjt2hoVUA":{"text":"This place here always hits the spot. I got the shrimp platter with Cajun fries the mushro","useful":0,"cool":0},"9XZ6o8qJOSKDPCnR1e5enQ":{"text":"Great service. Amazing food. Best place I've eaten in New Orleans! Awesome atmosphere! Per","useful":0,"cool":0},"zT9SzWKUMnk2UgZgWNYdkA":{"text":"Our waitress was Vicky and she took great care of us for dinner. \nWe started with the barb","useful":1,"cool":1},"FJh5MRPlxbchfhz60i_ojQ":{"text":"Good gumbo. Shrimp Alfredo fettuccine was good but needed more salt and Cajun spices. BBQ ","useful":0,"cool":0},"H3mjIVR5L9ym72-V6idZTw":{"text":"The gumbo and catfish is to die for here !!!! So flavorful , I will go here every time to ","useful":1,"cool":1},"Bo1omuIShE6FXcKpRWXMNQ":{"text":"Man thank you for the awesome experience . Traveling from Miami and this is my first time ","useful":0,"cool":0},"dM-pLjkYyjSX2XGOcEtQZw":{"text":"First off...the best crab cakes I've ever had. Absolutely perfect. Also the location, staf","useful":0,"cool":0},"bmd3-fQjiutKt07xKqbfRQ":{"text":"Traveling from ATL everything was great Bri was our server . She was fun. Although the foo","useful":0,"cool":0},"PCmc_KNrM1Ga3qXo3my_CA":{"text":"Service was great. Everyone was very friendly. All staff were madked.  Whitley was super p","useful":0,"cool":0},"jN1eJQQdDr32tZATWlxkGw":{"text":"Amazing Food. we had the Shrimp platter, the Oyster Platter, and the catfish platter.\n\nSin","useful":0,"cool":0},"kHxoKkZ0BjoS_e2D8iM5KQ":{"text":"I had a mixed experience on a Saturday lunch. I asked the seater to sit me on the balcony.","useful":2,"cool":0},"8tl4XqxIPFiadudYt9uwgg":{"text":"JoJo was very helpful and gave recommendations that did not disappoint. We had to the Frie","useful":0,"cool":0},"2fJeRuYPVwh1lqMQ9aNm_g":{"text":"I'm a miraculously writing this from my food coma! The food is so delicious, flavorful and","useful":2,"cool":0},"46KpoDSgfy6H4T-7-SULlw":{"text":"Jess M, our server, was great! Loved the food. The atmosphere is very relaxing. Will visit","useful":0,"cool":0},"fndtYuBjdHzK4cRVDgW-UQ":{"text":"The waitress is very friendly, even today is the Christmas. Busier than usual i believe! T","useful":0,"cool":0},"exGBbkmrqUDgehybhOr4tA":{"text":"One of the best meals I had  while in New Orleans  glad I had Yelp to help me make a good ","useful":0,"cool":0},"Kgj1K5-G_fSmmEK68VAvsw":{"text":"The gator meat is a must try! Get half fried and half blackened! The shrimp fettuccini pas","useful":0,"cool":0},"EqBwpxHoi4wbKC4Bs7JSQg":{"text":"I have been to the restaurant twice on the same day.  In attendance during lunch it was se","useful":0,"cool":0},"ewOwaZJQUDIQVjiCtFVoIA":{"text":"Average meal and poor attitude from the server. It has a good variety of local foods but n","useful":0,"cool":0},"OUoK_9SomRNGi-lnfEK37w":{"text":"Collin perform  excellent service and friendly and very informative. I'm out of state and ","useful":0,"cool":0},"0uzT15phpBqEhZWVFaYelQ":{"text":"We were looking for a quick bite to eat, close to our hotel. This restaurant was only a bl","useful":1,"cool":1},"bJm_WMknwWOUar6gUJ8fyg":{"text":"I went to Olde NOLA Cookery last night and Shanee was my waitress, she was amazing. Food w","useful":0,"cool":0},"qMQL7gpcKvAuRW1MrnqrsQ":{"text":"Our waiter was so kind and the service was amazing!! I'm vegetarian, & this is definitely ","useful":0,"cool":0},"hhPc8nbq2ynAJJz8IUqxXw":{"text":"We went here for lunch and we were served immediately. Workers wear mask and try to social","useful":3,"cool":3},"nMsI8sEATzF1AqSMTBT32g":{"text":"Brittnee Barnes is the best damn waitress in New Orleans PERIOD! She made the food & the e","useful":0,"cool":0},"pKOlrEsns6j5AeFyLMEeRA":{"text":"A good 4.25 stars. Party of 8 on a Saturday. We were seated pretty quickly (entire party h","useful":0,"cool":0},"1xMbWYqo-L2z8h4rIDdAug":{"text":"Alright.... I finally had my first po'boy ..... it was alright lol. BUT the jambalaya was ","useful":3,"cool":0},"b3a_Wdbl-C8X5MRNnzDvGA":{"text":"We decided to hop in this gem , we were immediately greeted kindly by the hostess and sat ","useful":0,"cool":0},"scnMYHRVjJRXYpUmyp93jQ":{"text":"Good spot right on Bourbon Street to start my NOLA cuisine enrichment tour. \n\nI've never b","useful":2,"cool":1},"uERgU5AK6aVynk6vyaRPwg":{"text":"First time experience here at the Olde Nola Cookery. Bri was our server. She gave us reall","useful":0,"cool":0},"zMR4PGKiFYURk9pi050u4A":{"text":"Everyone that works here is super friendly!!! The atmosphere was really chill, the food wa","useful":1,"cool":0},"HFXO_JT4E6ViCi4q-SDzyQ":{"text":"Our server Troy was very attentive and friendly. We had the chicken pasta Alfredo and the ","useful":0,"cool":0},"G44nKSv2g8qW_zWHgexVew":{"text":"We just arrived in town and we're craving some authentic creole food. This joint did not d","useful":0,"cool":0},"dFUtKyIzwsysE1p-XQcX7w":{"text":"Good food, great service. Our waitress, Jess M, was awesome!!!! Authentic NOLA food. Try t","useful":0,"cool":0},"tqbf6pM_Ou_p4ntNyWg_fQ":{"text":"I come here every time I'm in New Orleans and the food never disappoints. The fried catfis","useful":0,"cool":0},"sAgNqC-chpc85uU0rVXgiw":{"text":"Decided to try a Po' Boy here since there are so many reviews.  Very seldom does Yelp fail","useful":5,"cool":0},"m_M83tXEKwA7d0U0BlY-oA":{"text":"Obsessed with the cajun chicken pasta! My boyfriend and I HAVE to stop in every time we're","useful":0,"cool":0},"mnpIXGxoPHfAAsZRSnXO4w":{"text":"OMG! So many outstanding things to say about Nola cookery! #1 Jess M our server was the bo","useful":0,"cool":0},"cSQLYmTnzwmId_HLhkfdew":{"text":"This was recommended to us by friends who always try to visit olde Nola when visiting New ","useful":0,"cool":0},"dGP-nlt5vK6u9yFJw6BcGQ":{"text":"Charles the door man was very kind, food is great, paying the front street prices, but not","useful":0,"cool":0},"O8MzykIVKmWu8CFN5ooG0w":{"text":"first time visiting our server Jacelynn was awesome great attitud, very attentive, We had ","useful":0,"cool":0},"oDvy9X0iIEvrzNe-12L0XA":{"text":"First time here and boy was I welcomed with friendly smiling faces(totally could see the s","useful":2,"cool":2},"c5xW-DiC6eZw4sYnuZ52iw":{"text":"Food is amazing. Beware this location is on Bourbon Street. So if you don't want to be in ","useful":0,"cool":0},"f6JQmL59udNDP7PA5pCQLA":{"text":"huge shoutout to TRAVIS! his service was memorable and a highlight of our trip down to bou","useful":0,"cool":0},"AS3WBjscA8X_MBH8U38lLw":{"text":"We were searching for an authentic NOLA Restaurant we were walking up and down the streets","useful":0,"cool":1},"hA6S2OVn4D1dGbBKE_KsUw":{"text":"This is such a cool spot with good eats and entertainment right out the door. Totally reco","useful":0,"cool":0},"5regyPW6H3Vlv2eAORPsUA":{"text":"The service was alright along with the food. But the shrimp I had with the pasta tasted li","useful":0,"cool":0},"1rhPLCQTajr7fIFuLpf8cg":{"text":"Wow this place is amazing! The Red Fish was recommended on the menu by Jess M and she knoc","useful":1,"cool":1},"gt3yJn4B8TCqINfp4zeVSA":{"text":"Best red beans and rice in the entire French quarter. One of the best crawfish etouffee. O","useful":0,"cool":0},"E3aWu7SJVeufsJNOoGXcqw":{"text":"Overall, happy with the experience here. Some of the entrees seemed skimpy for the price, ","useful":0,"cool":1},"FQ6O5rAos3KfzFlaGSHsMQ":{"text":"The taste of the blackened Bayou duck was amazing. We had to ask for another side of beans","useful":0,"cool":0},"knqnS7B1lH4mKIAJfDuG4Q":{"text":"Stood in line for an hour to eat here, and food was underwhelming. My husband enjoyed his ","useful":0,"cool":0},"mThxVwbQCHbUjZ0PlP1VJw":{"text":"We needed a shrimp poboy so this was the place. We were seated on the balcony so it was fu","useful":3,"cool":1},"1MTysX3bCBPSF41Vpq3dIA":{"text":"Very very poor customer service and management. My fiancé found a rubber band in his crawf","useful":0,"cool":0},"C4gE4ptpr8tdV6UiQPPS3w":{"text":"The staff here is so friendly! The host, Stanley, was hilarious! My boyfriend and I split ","useful":0,"cool":0},"KK-RbzXP-YuZhOVIUJVzpw":{"text":"After our late night flight into New Orleans, we came upon this place around 1am. Situated","useful":2,"cool":1},"bahKwmFsmKiZ6sbZm7iu2Q":{"text":"Warm, friendly service and a nice spot for lunch. I ordered the Daniel's special 'Po Boy (","useful":0,"cool":0},"hEwcXvA4w7QtlNn1r5S0oA":{"text":"I wish I could give this place more stars they deserve it good drinks and insanely good fo","useful":0,"cool":0},"m5N1lNz8uP0zPek9nSasdA":{"text":"The food was underwhelming and not hot. Ordered the Louisiana oyster platter and the food ","useful":0,"cool":0},"hQjkgMROBo14MBWHfr_sYQ":{"text":"Restaurant is a complete ripoff! Entrees are either fried or mostly sauce poured over past","useful":0,"cool":0},"fG2kV0EX-6dNcQcqf-SY1g":{"text":"My husband, sister, brother in law, my daughter and her husband made Olde Nola Cookery our","useful":0,"cool":0},"qAkA-9r4nBp25dYRZ15CFA":{"text":"This spot is amazing. Our server, Wilton was excellent. He was very attentive & patient wi","useful":0,"cool":0},"R2mYSdPGYUoc0keofAlHcw":{"text":"Checked into the Crowne Plaza and ask where to eat and the girl said go to olde Nola cooke","useful":0,"cool":0},"5vBXJSyJ7KouqNEmgr3KUw":{"text":"Service was great! Party of two we got to sit in the window and people watch while we ate.","useful":0,"cool":0},"vnv35ntM95xNjyUNKXiE_w":{"text":"Service was great! Party of two we got to sit in the window and people watch while we ate.","useful":0,"cool":0},"rGpnvNxem0WT_5Jn8i4Eqg":{"text":"Omg y'all...I hadn't heard anything about this place before I got here.  My family and I c","useful":0,"cool":0},"wqp3ekDJEvHwGHKKw3fF1w":{"text":"Small little restaurant in the French Quarter is worth a visit.  I had blackened catfish w","useful":0,"cool":1},"9JnuZFNunxtAJzbK4VridQ":{"text":"Food was on the bland side.  My shrimp po-boy only had pickles on it. My two pasta dishes ","useful":0,"cool":0},"HxTUKhzx_9oA7R2opzKhgg":{"text":"Vicky is is the best waitress and she's very friendly. She's very knowledgeable and she is","useful":0,"cool":0},"6Cjiv_5uPhbCw6Kez-9-wA":{"text":"The service was great , food was very good . \nDid not take long to get seated , it was aro","useful":0,"cool":0},"MLIQdi8C-5WKfp72OA07Qg":{"text":"The most amazing food I've ever eaten! After enjoying the shenanigans on Bourbon street (o","useful":1,"cool":0},"5DAKWlNIdu_kLc1S_1Omjw":{"text":"Food was very bland.  All dishes at table was not tasting at all. We asked to speak with t","useful":0,"cool":0},"D0x4AVW99RT0TFapKPO8DQ":{"text":"Nice place on Burbon Street.  Good seating and decor.  Our server (Guy) was attentive and ","useful":0,"cool":0},"5C_TPB6Cuae7VC-mCELAfA":{"text":"My boy Isiah hooked us up... great food... great time... and Isiah sold us on the entire e","useful":0,"cool":0},"Z6xepinEwLr870i0LgUkRQ":{"text":"The Shrimp Platter was so good. I had them cook my Oysters extra hard and everything was s","useful":0,"cool":0},"OxVKZv20W9XUERYswOP1NQ":{"text":"I'm really sad that I had a broken phone while I was on vacation so I have no photos! But ","useful":1,"cool":0},"Adf9ZkZZCUEDPTUxj3Qckg":{"text":"Awful, I asked if they fry shrimp when you order because it's worse than long John silvers","useful":1,"cool":0},"pvM2P8DjCGm57TEeaj32_A":{"text":"This was one of the only options open on a Tuesday night on Bourbon St and we were hungry ","useful":0,"cool":0},"DJ20ADBpN2_rkjwUTtjgVw":{"text":"The food was amazing for my first time eating in New Orleans! I got the 10 oz ribeye steak","useful":0,"cool":0},"dHZvJwCjwzUEkOxHWyc6Kg":{"text":"Gator bites (blackened and fried) Cajun Jambalaya Pasta and Banana's Foster ice cream cake","useful":1,"cool":0},"narmDnfcA5rQHfg0fN4PRg":{"text":"The service was poor and after waiting over an hour for our food, it arrived cold. One per","useful":0,"cool":0},"m-bWmm6SF06X90SCgTZqiQ":{"text":"I did not get any pictures but this place was amazing. First night in New Orleans! Big gro","useful":0,"cool":0},"-4AQGaWE72T-mHR_yghxOQ":{"text":"I stopped here almost midnight thinking about some fried seafood the bartender recommended","useful":0,"cool":0},"3QcZMHc8FywbS-BjEDPY7A":{"text":"Jess M was AMAZING! She was very attentive to our needs and the food was soooo good! Highl","useful":0,"cool":0},"ABlPhccJhK2xKFHEe_b9xg":{"text":"Chelsie is great!! So\nIs the food! The atmosphere and drinks are just what we were looking","useful":0,"cool":0},"FLUK-yx-NWf2gGaOxWM2sw":{"text":"There's no better way to try a type of cuisine than where it originated from.  I was excit","useful":10,"cool":8},"UdHHKJRKZqnFXRwva_RU0w":{"text":"Worst experience and we didn't even get to eat here. The hosts was aggressive. We simply a","useful":0,"cool":0},"ktexQnZvN84mgRlvWbAWUQ":{"text":"We went about 4pm and no waiting   I had a Taste of New Orleans dinner.  Very good red bea","useful":0,"cool":0},"mx9-hOKqgzHNsi0ShzoRiw":{"text":"Why on this green earth is this actually advertised the same as 'Oceana' with the same log","useful":0,"cool":0},"r48giQ9fywiJcdNNAzg6_g":{"text":"Great service and wonderful food. The shrimp po boy was insanely good. I was also starvin ","useful":2,"cool":3},"KJrx50Vgr7KEWTW2nrtHGA":{"text":"WOW!  At first I thought I was being hustled by Mr. Bourbon while enroute to a different N","useful":0,"cool":0},"4Yir7b_RDMMmyz0yP-seyA":{"text":"First time in New Orleans and we randomly chose this spot. Great service from the time we ","useful":0,"cool":0},"AcHZLoReNEhwuW9BibtSlw":{"text":"Not my first visit food was great as usual a lol disappointed the changed the recipe of th","useful":0,"cool":0},"7ijxn-D4a9Klk4Xc9Qofew":{"text":"Made a reservation for valentines day... got there about 15 minutes early & the waiter cla","useful":0,"cool":0},"IoURZu-fuvufP6m-BTXNPA":{"text":"The food was great but I didn't quite read what I order... I ordered lots of red beans an ","useful":0,"cool":0},"H101sdEt48TeVnDdU-g3ow":{"text":"I was on the hunt in the French Quarter to find the best Red Beans & Rice and Gumbo. THIS ","useful":0,"cool":0},"RIOI_2o9S2ITE0JnSt2alw":{"text":"This place was hands down AMAZING. I came here to celebrate my 30th birthday with 8 of my ","useful":0,"cool":0},"P5iV5ZSkZmPbGUZeQCuEPA":{"text":"Hella good! That is all!\nWe had cat fish, gumbo, gator bites(fried), hush puppies and crab","useful":1,"cool":0},"Nu1XbmNGHeyOxiUDzeV0YQ":{"text":"Our first time here at the restaurant.. The food was great, the atmosphere was very welcom","useful":0,"cool":0},"sozThNyVcgqIlNTObabrrw":{"text":"First stop in NOLA and disappointed. Dirty and touristy. Staff was clueless... Got someone","useful":6,"cool":4},"B5rVLKE6wSnw-shWgHmclg":{"text":"Jess M. was my server and she was great!  The food is amazing...The Taste of New Orleans g","useful":0,"cool":0},"uqV743fhJDJrFRwzi1xj2g":{"text":"Great food and even better service! Our server Chris was nothing short of amazing! Super a","useful":0,"cool":0},"bgauSc63WSeN2aIiUnSsCQ":{"text":"The only complaint i have is our table was wobbly. Other than that.. it was DELICIOUS. We ","useful":0,"cool":1},"3onvBm4W2_C0T0aD0LaW5g":{"text":"Jess M. was Excellent! She was very hospitable and knowledgeable about the menu! Great foo","useful":0,"cool":0},"JcfWG7HUzHQYDsCQXVwUaA":{"text":"Nothing like stumbling into a gem! Highly recommended. Dank af. Eat this. Eat here. Bet yo","useful":1,"cool":2},"R7Sz0whlchjlqat0osg6ug":{"text":"My mom came and got the taste of New Orleans, the crawfish pasta and the shrimp po-boy. Th","useful":0,"cool":0},"s0HsCqz0UeobKvx6bXd2LQ":{"text":"Thank you, Bri! We appreciated your wonderful customer service. You were very attentive an","useful":1,"cool":0},"vWdHoQoWA8rRtJ7SyiYUJg":{"text":"This place was amazing! this was the first place we stopped in NOLA. \nthey accomadated all","useful":1,"cool":2},"fhrFy3q0tDAE4WmpEmdN_w":{"text":"My boyfriend and I took a day trip to New Orleans yesterday to try their food. We didn't e","useful":3,"cool":0},"0s8qrdeesJnA1r9VBj26aA":{"text":"Whitley was helpful and patient while we were making decisions! Had the Redfish Cookery an","useful":0,"cool":0},"FncBFRSv-M-649arIHqU7w":{"text":"I am local. ate there for the first time recently during Covid thinking it would be cleane","useful":0,"cool":0},"Etz5gNnzIRc-GbODK2OvNw":{"text":"The alligator bites are delicious! I almost didn't share them haha. I also had their White","useful":0,"cool":0},"_YxW31xPz8xvwK0Ka7lDAw":{"text":"Waited about 20 minutes to be seated. The menu is a carbon copy of Oceana Grill on Bourbon","useful":0,"cool":0},"Ng0YOKXQpx8s-gxO3sHA7w":{"text":"More of a dive feel but the staff was excellent and food was delicious. We ate at the bar ","useful":0,"cool":0},"PPA3P2tVMCFnn93pd-2WMw":{"text":"Crab cakes and bussing I will say that. BUT I have a nut allergy & when ordering dessert m","useful":0,"cool":0},"p11NRB4vQFmheF-r7drkNg":{"text":"Redfish, greens & Garlic Mashed Potatoes were great. Kentucky Bourbon Pecan Pie for desser","useful":0,"cool":0},"SlPjQlNAHcE1oNFAMT9wAQ":{"text":"Great service, great food, great atmosphere. My wife had a hard time choosing between the ","useful":0,"cool":0},"iL5vxRrzSyrIKB4lVEL73w":{"text":"Came here with my friends our last day in New Orleans and it was amazing . The young Host ","useful":0,"cool":0},"YT9LNHURtAt7E7PFNNQszA":{"text":"My wife and I celebrated her birthday in New Orleans and stopped in for a drink. When we s","useful":0,"cool":0},"5xRNKHcEcu3KiECfnOgQOQ":{"text":"We stopped here for a quick bite to eat after a late flight. We waited around 30 minutes f","useful":0,"cool":0},"rYNIqRG0V1T8ZC1RjzOCsA":{"text":"Absolutely delicious.\nI was trying to hit as many places as I could while I was in NOLA, b","useful":3,"cool":0},"gJGflhUqSUuKVmX1ib2uVw":{"text":"One of my favorite restaurants in New Orleans! We come here every time we are in town. The","useful":0,"cool":0},"yPt9iTPs_8QDBnJIR8r0-g":{"text":"Very good bbq shrimp! Nice sized perfectly cooked shrimp in a very well executed sauce- wi","useful":0,"cool":1},"pGRvKtKZNJhZ8MsieS4ZDw":{"text":"Saw some positive reviews for their gluten free service. They do have a menu with 4 gluten","useful":0,"cool":0},"oLlf2uOaweAMR2qYPPWo3w":{"text":"Food was fine, as it was one of the first stops on our trip, prices were good too so I wan","useful":0,"cool":0},"vDLSSuNa1KT1-9LrQzcmhg":{"text":"Don't sit in the 'courtyard'. It smells like sewer. And cigarettes. I decided to forgo my ","useful":0,"cool":0},"TXFRMbC3d905LFUGTGETFA":{"text":"Got takeout. I only waited 10 minutes. The shrimp po boy is a 10/10. Cajun fries live up t","useful":0,"cool":0},"U03S8c4xiasOPtuTyr1fDg":{"text":"Great food & service. The man at the door Friday night was so welcoming and genuinely like","useful":1,"cool":1},"-BPsvm6OoohfQb5N2beksw":{"text":"Full disclaimer. We did not eat here. We tried to get into Acme oyster House but the line ","useful":1,"cool":0},"JJNCtSw66tVbg-zdwElcsw":{"text":"A great casual option right on Bourbon St! A menu with a variety of NOLA cuisine and bever","useful":0,"cool":0},"Dzba6laEl_4aI1Qi021-Ig":{"text":"We came when it was quieter. Thanksgiving weekend, it was the Saints VS Bills game and the","useful":0,"cool":0},"SVVNsi0l3ZQYDU9GdR4T7Q":{"text":"I booked my wedding reception here and am so glad I did. From the start of inquiring about","useful":2,"cool":2},"hzOTUgvH195tLIzC0Pz4Bg":{"text":"Really nice place. Gator was super good and the Cajun fries very relaxed atmosphere when y","useful":1,"cool":0},"QTpAFg4hDV-cX_o_0stkAQ":{"text":"Briana was awesome; quick service, very clean, and food was fresh and tasty. We had the ch","useful":0,"cool":0},"lwFf0IewbSu5iluiIkeavQ":{"text":"Oysters hit the spot! They were flavorful, refreshing and juicy. The barbecue shrimp also ","useful":0,"cool":0},"WgalNrJu55eWwygA3A1K5w":{"text":"This place was alright. The pasta wasn't that great. The moment we didn't want to order dr","useful":0,"cool":0},"EgYRCpH_tsG8i6H9nzDcmQ":{"text":"This restaurant reminds me of New Orleans version of a Joes Crab Shack or Dick's Last Reso","useful":1,"cool":0},"tTcXe4KyKJDbsRjvriTLCA":{"text":"Jess M was our server and she was great. We got a seat at an upstairs table overlooking th","useful":1,"cool":3},"8dlVOwJJclxFGG4_w78lMg":{"text":"Even though this place appears to be a good old fashioned tourist trap, the service and fo","useful":2,"cool":1},"2pCfTwPUcrjpTMtBr13i4g":{"text":"We enjoyed eating here! The food was very delicious and we highly recommend the BBQ Shrimp","useful":0,"cool":0},"h2ZpokjSOSK6-25kQTC8zw":{"text":"My husband an I came here while we were in town for our Anniversary. AMAZING service & the","useful":0,"cool":0},"f7c15xDVkJO_BGFW31aYeQ":{"text":"We had the taste of New Orleans, it was so yummy! My husband and brother were able to fini","useful":0,"cool":0},"GVJILU0a2KCUxGObiJSQTQ":{"text":"Service was good. Blackened Duck seasoned evenly. Our guy, Ray, makes you feel welcomed an","useful":0,"cool":0},"8aVdGpcBLsJomJESso4Hjg":{"text":"Outstanding food and service. This is a must go to stop. There is a wait but the place was","useful":0,"cool":0},"KEX0BdvXHez-15iQgntDLg":{"text":"Awesome food and atmosphere. Our waitress Jess M is awesome. I had the duck, yummy. My kid","useful":0,"cool":0},"D51TBfM2YfW1GqbRiE0A-A":{"text":"It was a great atmosphere, very clean and kept customers within social distancing guidelin","useful":0,"cool":0},"Z7dkyynWKTwvYuRPbz9uiA":{"text":"went to this restaurant due to reviews.\n\nthe food was not good by any means, over cooked t","useful":1,"cool":0},"3rnJkzU2nNlsN2wQhbaVew":{"text":"We had a great meal for a large (30+ people) group. Our server, Aaronisha, was accommodati","useful":0,"cool":0},"QFtSN6cqz_SfNOjB5LylNA":{"text":"This spot was recommended to us by a friend. It did not disappoint. The gumbo was exceptio","useful":0,"cool":0},"CU_JAsJSNply1B5j7kW7Yw":{"text":"Don't know how the food is. The service was so bad we never got to the meal. Sat there for","useful":0,"cool":0},"G6fgl0_cKt75PLmNJxpr_g":{"text":"The hostess was rude when asked upon the estimated time wait for two wheelchairs for a sec","useful":0,"cool":0},"ZuQNFvwF-p7lAORJyI0xzg":{"text":"OMG!!!!! This is the BEST food in NOLA!!!! It was late and most restaurants were already c","useful":0,"cool":0},"QcvKpXegAZf9LJV5SxS6jQ":{"text":"Nice location right on Bourbon St. Casual atmosphere. Service was great, our server's name","useful":0,"cool":0},"J6NyLTGJEdD_Qv4rML2YqA":{"text":"We were on Bourbon street looking for some Cajun food (specifically gumbo) and found this ","useful":5,"cool":0},"hvLi0fNOOmAppAZsORWWgg":{"text":"fried shrimp po boy with added fried gator is to die for. Along with their cajun fries wit","useful":0,"cool":0},"j5BEmwxcmj-GpX9_FfedXg":{"text":"Bourbon Street was undergoing some serious construction, so we ducked in here for a place ","useful":1,"cool":1},"WH1uzmcemKyJ7HjgXgm6XA":{"text":"Great food and service!  The crab cakes were wonderful and the Cajun fries were amazing!","useful":0,"cool":0},"aUDr5GZNQ6m-qGX0PQgvWA":{"text":"I went here back in the early 2000's and just recently.\n\nI see why this place is still aro","useful":0,"cool":0},"pGKRWPRflpT2j468riv75A":{"text":"The foods are ok, nothing special. The wait is not too bad given how popular this place se","useful":0,"cool":0},"irOBjzn2gTokHFp5nKsg9w":{"text":"We were walking along Bourbon street and a gentleman in front of the restaurant grabbed ou","useful":3,"cool":0},"h_EKRXoohb-MUtRn36vjKw":{"text":"Amazing staff, great view. You guys should check it out.i highly recommended this place :)","useful":0,"cool":0},"A5Z9RaiPb2DyYuDTfEZUgg":{"text":"We were craving some good authentic New Orleans food. We stopped by  on Easter, shocked th","useful":1,"cool":1},"PP21KmBmCPYyziiiaE1oYQ":{"text":"I'm going to give a 4 here but if possible I would have given a 3.5 instead.  I don't thin","useful":0,"cool":0},"SN4Z2yxzILWOx9hDGuzE1Q":{"text":"The food was awesome and our server Travis was the best. He had patience and was able to h","useful":0,"cool":0},"Dl0gDgYbrL__rq5GQwZWyw":{"text":"Ugh this place is amazing! Second time here in one week. Food is great, service is amazing","useful":0,"cool":0},"aeRA2AqEhY_VkPc3gqECaw":{"text":"My Experience with the host was pure RACISM! I'm a local and WONT return back. I'm a white","useful":0,"cool":0},"MsH-ZyaSEFhdyOBVSiOPqQ":{"text":"We sat by the bar. Al was an awesome bartender. Our food was delicious. The seafood gumbo ","useful":0,"cool":0},"ZZulR1EOCdc6oNdRb8B9AA":{"text":"We chose to dine here during our last night in NOLA and we definitely enjoyed it. We ditch","useful":2,"cool":0},"dkuekJfxewMlYLgyg5g-lg":{"text":"The Olde Nola Cookery is not in my first tier of restaurants when I go to Nola. However, I","useful":2,"cool":2},"f-QnZxQ9efRHlLgQUdN06Q":{"text":"Soooooo good! This $18 catfish po boy and fries was worth every single bite! The french br","useful":1,"cool":0},"usZzk5bwDnXpXXIz0Rjj9g":{"text":"First place we tried as we hit Bourbon street and it didn't disappoint. We got the seafood","useful":1,"cool":1},"bQBa_J29-DrSTWlJ5WPbSw":{"text":"This was my first meal in NOLA and I was highly impressed! Service was so great and friend","useful":0,"cool":0},"5si4qhjVY8Ml5Q9dY1Rjpg":{"text":"Loved the gators bites (1/2 blackened/1/2 fried, blackened was amazing) and taste of New O","useful":1,"cool":0},"rBGmUVWzvH-Ue6b5Zmgu1g":{"text":"Great place to try some local food. The waitress said they are owned by the same owners of","useful":4,"cool":5},"obw-yk4tKMt9k5Ax8KM73g":{"text":"Guy made our late dinner great!  Great food and vibe.  Really good red beans and rice. Def","useful":0,"cool":0},"OcFmiK-IbDp3dorJcrYRFg":{"text":"One of the few spots open past 10PM on Bourbon St. Better than your Willie's fried chicken","useful":1,"cool":0},"n8-2SCcSHMEBocEHFASbJg":{"text":"First place getting a po boy in New Orleans. Jess M was really nice and quick with the ser","useful":0,"cool":0},"gSbMprxKQaSug51ZZH8HRQ":{"text":"Food was really good but a bit expensive for what I felt the restaurant quality was. I sti","useful":0,"cool":0},"tlpUG71HZEl6rwkzq_BaAg":{"text":"Good food, no wait when I came in. Briana was an excellent server. She checked in with the","useful":0,"cool":0},"RJDP0TDQRNlgh2JRVTsR3w":{"text":"This place was just okay. It's located on Bourbon Street. A lot of crazy people. Horrible ","useful":0,"cool":0},"gtfk1zZST-7VieLecNw25g":{"text":"Great atmosphere and service!  They gave us an extra serving of alligator and a discount o","useful":0,"cool":0},"0lfmGo99WQWN22p3ZEhkTA":{"text":"Tonight the wife and I decided to try this place out due to the previous reviews on Yelp. ","useful":0,"cool":0},"ef-fSH1Egtll-FLBSkY13w":{"text":"I paid $20 for a delivery & this is what I received. I called the restaurant and spoke to ","useful":0,"cool":0},"KSDx0JJDH1rH2CZeGltgSA":{"text":"The food was ok. Not the best or most authentic but good. Probably would not go out of our","useful":0,"cool":0},"K1KdZdKL03Ik8aUEZKMFFg":{"text":"This place was so gooood!! Bri our waitress was awesome recommended the most popular dishe","useful":0,"cool":1},"-lXVOjd4FP9r7ukniHgktg":{"text":"Great food and the service is excellent.  Our waitress aka \" Brittany A \" added to our eve","useful":0,"cool":0},"FNXKMDBBtsAYx7HM44hSYw":{"text":"Came here for dinner on my second night in New Orleans. When we got to the door, security ","useful":1,"cool":0},"lZ93SdtvF5nFLpGUe8gEFA":{"text":"Such a great find on Bourbon Street. Vicki is a shining example of Southern charm and hosp","useful":0,"cool":0},"EOc-8p7xifa91x9LxO8CBQ":{"text":"Out of all the manufactured restaurants I encountered in NOLA, this one was the best. When","useful":0,"cool":0},"DCegU-kombQeRZ-9fzLMiQ":{"text":"The food and service here was phenomenal!! Jess M. made sure that we had everything we nee","useful":0,"cool":0},"CZrkul69Qau5qRckCC33PQ":{"text":"When I tell you I was disappointed in me husband's last night in New Orleans. We had been ","useful":0,"cool":0},"l9cjd-9y3-TWMXpXJo90Dw":{"text":"Everything we ate was fresh and tender, especially the blackened chicken. Our meal was ver","useful":0,"cool":0},"HWVlqP8olhFE322tEy7QnQ":{"text":"This was my first time at this restaurant and it is a very nice restaurant. The food was v","useful":0,"cool":0},"ge8eDpKl22ts3z5uEWyeGQ":{"text":"A-M-A-Z-I-N-G!!!!!!\n\nWe happened onto the Olde Nola Cookery & were taken upstairs to dine.","useful":1,"cool":0},"Swg2pwxIm0KxW_TfWNqUaA":{"text":"The service started a little slow, but it was all worth it when we got our food.\nStarted w","useful":0,"cool":0},"AGn0CaL5g61ylthKpCBXkg":{"text":"Ooooweeee! I had the fried gator po'boy and my boyfriend had the blackened gator po'boy. G","useful":1,"cool":1},"7SoeGI8GGHUMg03I31Pz2g":{"text":"I'm so in love with this place. Everything I had was cooked to perfection. Our waitress  J","useful":0,"cool":0},"YU2rDUGXTh7Cm-zgt0gIVA":{"text":"i enjoyed our meal here. ordered half blackened/half fried gator bites which were deliciou","useful":0,"cool":0},"4v4oM2XYrMpZ6VX2CTjkcA":{"text":"Food is good, service is good, people are kind. We ate jambalaya and fried oysters po-boy.","useful":0,"cool":0},"-J_BJuNzLJ4suV16A4IdVw":{"text":"I came across this amazing place while on a trip for my birthday. Walking down Bourbon Str","useful":1,"cool":0},"oEBkyzmg2BEuYhacI4zPGw":{"text":"Delicious & authentic Nola menu - we loved it so much we went twice in 3 days! Loved the r","useful":0,"cool":0},"V2FBjdRbv5ZwSBgErxu7ag":{"text":"The restaurant is amazing! I've eaten here 4 times over the span of 2 weeks. Kentrell is t","useful":0,"cool":0},"8qpBM0wp247pgr5Zw57iBA":{"text":"The crunchy rice wasn't impressive but the beans were very tasty. The music and vibe was c","useful":0,"cool":0},"v1aZAGazXD8iH3ysZMmsIw":{"text":"Excited to be back in Nola but this was a let down. I ordered online for pick up since the","useful":0,"cool":0},"v62TG1nBfoMRN6pS3Mcz1g":{"text":"I travel to NOLA for business regularly, this is my favorite place to go for for seafood. ","useful":0,"cool":0},"jBtGp4pPxity_75VGBJpLA":{"text":"We had a great time at NOLA Cookery! Ray was an exceptional host and gave the perfect reco","useful":0,"cool":0},"VjMMYwF6AQ5OAQ6zE2BR-w":{"text":"Just like to mention, this place was about to closed, but invited our friends(we were flyi","useful":3,"cool":0},"yc0XTYk0HB66RY7ZEQAWVg":{"text":"I went here with a group of friends just last month. The line was pretty long which I kind","useful":0,"cool":0},"ojZnlVNF98BPPZvgx22mNQ":{"text":"Found this on yelp looking for gluten-free options.   We we're going to the sugar bowl and","useful":0,"cool":0},"L5NlKqbM1-hrZuaIctnqlg":{"text":"Food was excellent. Cajun fries are a must try. Great location. Long lines but worth the w","useful":0,"cool":0},"VKR9ElTJ9TGKerOockEpuw":{"text":"Food was delicious!!! Service was the best!!! BRI BRI BRI!!! Asked to be served by BRI, sh","useful":0,"cool":1},"yXdEq69C_aI59sC90JMi1w":{"text":"We spent the day on Bourbon Street and decided to come back at night for more fun. I found","useful":2,"cool":2},"msDdKM9hMbYoG2sBT4FWzg":{"text":"Very helpful if you have food allergies.  The most delicious gluten free crab cakes.  Out ","useful":0,"cool":0},"u9sncU_YvUEdrSxhXJL8qw":{"text":"Excellent bar with great menu. Ordered po boy shrimp and oyster. Awesome po boy !\nGreat ba","useful":2,"cool":2},"U-DeMfawvxqbrJ38686CZQ":{"text":"The hubs and I came here for our first meal in New Orleans because it was at the beginning","useful":0,"cool":1},"sTWhaZLkpXYniI7IuXQiUA":{"text":"This was an awesome place.   Jessica B was our server and she was amazing.   The 6 of us s","useful":0,"cool":1},"IYyupdskezDfGm4XDt4fgA":{"text":"Well I  bought a group for this place and turns out it was worth it even with out a Groupo","useful":0,"cool":0},"rpToGEC3a6qkFpT00wmuZw":{"text":"Ok. Where to begin? So yeah- they blew it. And I'm pretty sure it was the kitchen's fault.","useful":3,"cool":1},"a5pcEYhe_rNI2FM1eUDNKQ":{"text":"This place is the best! I tried alligator bites for the first time which were delicious an","useful":0,"cool":0},"yEKSKFLV0uo0PpvMejPfhw":{"text":"There was a long wait to get seated here,\nmostly because we requested patio seating\nand th","useful":1,"cool":0},"4liFUNmln7i632uUYXP0EA":{"text":"We were approached by a man telling us to come on in and when I asked him if we could brin","useful":0,"cool":0},"c_zkin72pbZXS1w0e9rcqg":{"text":"Bri was awesome! Evert time I come here she goes above and beyond to serve us. The food is","useful":0,"cool":0},"-3I2o1ZJcT5NG9ZPKy-DbA":{"text":"This place is right on the Main Street. We ordered the shrimp poboy which was mediocre. Th","useful":0,"cool":0},"m0_OUZ31_W1WMfahpE8mEw":{"text":"We were excited about this place. \nIt is a extra small restaurant. \nGluten free is limited","useful":2,"cool":0},"cLZjtEUbJD6WiyTaTW4MwA":{"text":"First time in New Orleans and saw this place exploring. Decided to try for dinner. It was ","useful":0,"cool":0},"JG93rxfiLm24FD5SVvZhFw":{"text":"This is the perfect spot for some delicious Cajun food. My friends and I visited New Orlea","useful":0,"cool":0},"xQ3FYVMApCJNfd89BR-tqg":{"text":"The one thing, the ONE thing you have to get right when you serve rice with basically ever","useful":0,"cool":0},"JVrMkytAnWx7zY8w8j1jbw":{"text":"I'm from Southern California. I started with the half and half grilled and fried gator bit","useful":1,"cool":1},"WcjplITYxtwDeO_dfQLgpw":{"text":"Food was not good, red beans and rice was Popeyes Fried Chicken red beans and rice exactly","useful":0,"cool":0},"woehHeHxgCCQGcJ7Pa5uYw":{"text":"I had the blackened bayou duck with mustard greens and red beans. Everything was seasoned ","useful":2,"cool":0},"Pnq23cuN3q22_ZE8LGTrLQ":{"text":"We came in here for drinks and lunch while in New Orleans for my birthday. My double hurri","useful":3,"cool":2},"sACAuIKHEJou45Y24VvmEg":{"text":"Stopped into this place because the Hard Rock was closed. I forgot that I've been here yea","useful":3,"cool":4},"w-mfuhXiJf5KyRBxrYegiw":{"text":"My fans will know that only two percent (ish) of my reviews are one-star. To get a one-sta","useful":3,"cool":3},"df2wDIz2Z4Z9lgT4b4biPw":{"text":"This was an amazing place to eat at the food was amazing and oh my gosh the Fried alligato","useful":0,"cool":0},"d6ZbhoqPYmTGoGcpUzkwcw":{"text":"Bri was the best server! Waited until New Orleans to try my first Po Boy and It did not di","useful":0,"cool":0},"GiDBG1xX2TC4bKzVPEGpIA":{"text":"Let me tell you. New Orleans does not miss with their cuisine. After a day of just chillin","useful":1,"cool":0},"uElv9GDUSzsvOxzL72hntg":{"text":"Great service !!! Devin was an awesome server hands down . Would highly recommend this pla","useful":0,"cool":0},"BFq4tF1GKKuCugIfLKyKag":{"text":"My friend and I came here over the Mardi Gras weekend. We ordered the Gator Tail Bites (ha","useful":1,"cool":1},"5YXJB4V0VYZsI36-fddESQ":{"text":"My guy Wilton was super helpful recommending things on the menu. Visiting during the \"Coro","useful":0,"cool":1},"6Zsos6Xbuyi6hLnJcQ0lVw":{"text":"The first day we arrived in New Orleans, we took a walk down Bourbon Street and our hunger","useful":2,"cool":3},"ADxJ0ilXHmqSNofjIFU8wg":{"text":"Ummm TO DIE FOR is what I would use to describe this food. \n\nThe service was awesome, the ","useful":0,"cool":0},"B_9Jk6ul_fqcpbf2CD-_QQ":{"text":"Went here for a late dinner - picked it because of other reviews on here, so decided to ad","useful":2,"cool":1},"Lgr90IqRV4poXewcDJtxXg":{"text":"Friendly staff compared to other restaurants in the area. Drinks were well made and she wa","useful":0,"cool":0},"Xu7SrX5MDG2E1XgnriKwlw":{"text":"We get there for dinner, we waited for a few minutes and then they placed us in private ar","useful":1,"cool":0},"SR-PPzvmGQW6eBXb8LwVXQ":{"text":"We came during the pandemic and the host got us right in. He sat us down and our server Wi","useful":0,"cool":0},"cRSenbYQDsI4AU889TKwrg":{"text":"I went on a Sunday around 12. Not busy so I was able to sit as soon as I walked in. The gr","useful":0,"cool":0},"NsUD2J-MGyIk7lpHlcqs8Q":{"text":"It's not like I went here for fine dining, but I did go here for a fun, kitschy, peak tour","useful":2,"cool":1},"4ySTv_Q98wiFAE3IGYprIw":{"text":"On our last day, I was craving just a good bowl of reds & rice. Decided to give this spot ","useful":3,"cool":1},"hGLqdEgTCSTvuRAUbwoc4g":{"text":"CRAB CAKES !!!! Not only full of blue crab but the crawfish butter is OMG - got Grub Hub d","useful":1,"cool":0},"zwicunRHefDixA8w5n8PNg":{"text":"Cockroach in wine glass.  Yup.   Cockroach in wine glass!\n\nAnd at the end, they offered us","useful":2,"cool":0},"MXw5K3-79H35thC9xNy7uw":{"text":"Olde Nola Cookery is my husband and I's first meal in New Orleans. I did a quick search on","useful":0,"cool":0},"Geby3BIo2GpRHV29VlAUiA":{"text":"Decent food and atmosphere, but slightly underwhelms when compared to other restaurants in","useful":0,"cool":0},"wJBmtXYdjtN2Y_T2gC00Ig":{"text":"Best rice and beans!! I thought rice and beans is just that rice and beans but this was so","useful":0,"cool":0},"LdEyRwyI2Tw7OI2YmHunkA":{"text":"We were craving Cajun seafood and Desserts, and Olde Nola Cookery was close to our Bourbon","useful":1,"cool":0},"GOzkY0xCnQbPhzcYDj8Zag":{"text":"Briana was such a kind and welcoming server. She made sure to explain it all in detail and","useful":0,"cool":0},"UXibPRP-4FTQQHZV2Gk_DQ":{"text":"This was our first stop on our first trip to NOLA, so we made it our first stop on our sec","useful":1,"cool":1},"91W0NWUamv5YZVElTyzGMA":{"text":"I ordered the Daniels Po'Boy-- which is NOT on the menu but you have to ask for it!! It's ","useful":1,"cool":0},"dtgOFnAWKqfRTiOccxJNsg":{"text":"I came to the beautiful town of New Orleans for a Saints game. My first one in the Superdo","useful":11,"cool":7},"o1r0jIMyfF8QEXwgfZOTvQ":{"text":"Nothing stands out except the bread pudding. I think it was the best we had in NOLA. Plus ","useful":1,"cool":0}}