{"MFyB1zTaWpoQJkOYohq0XQ":{"text":"I haven't been hitting up as many high-end restaurants of late, and my bank account thanks","useful":0,"cool":0},"PVsXfGH1m9aIWN856nHIEg":{"text":"About 8 months ago I happened to be sitting next to a good friend of Desi Vega's owner on ","useful":0,"cool":0},"2BIYRM5HtxJRDpCDzQSmvg":{"text":"I went to the restaurant with a group of 8, it was a last minute decision and we were all ","useful":0,"cool":0},"uWYZm6BZ2AGctPbYyHsIAg":{"text":"We went here for my 40th birthday and it was the best meal and experience I have ever had!","useful":0,"cool":0},"K3-BB-65vJ124PDbg9n3bw":{"text":"Went here with the wife recently. I had heard great things about Mr John's, and knew Desi ","useful":2,"cool":1},"0UOC6pLsLYUpFxwE9RrSyg":{"text":"Absolutely the best steak in New Orleans. I had the filet and it was so tender and cooked ","useful":0,"cool":0},"wQYzrJKNvT9f-nBbmxK6Og":{"text":"Just returned from dinner here and was totally turned off by the matre d'. We arrived betw","useful":2,"cool":0},"zMPWw7tLXEFLi6V4b4hBaw":{"text":"My Husband and I had a beautiful time as always . The Food was soooo good . Our Steaks was","useful":0,"cool":0},"yZn9nuL2DA6j0pI424_jIQ":{"text":"Our table was ready when we walked in. This place isn't the largest yet busy so they caref","useful":0,"cool":0},"JAF5mh589CiY7im4bycxhg":{"text":"What a great, quick lunch! I had a Groupon that was expiring, so my work bestie and I came","useful":1,"cool":0},"mNN8CoQb1S33X-TqC3dRXg":{"text":"Wow. We had high expectations, NO disappointments here. Yes real prime beef. They can Pitt","useful":0,"cool":0},"Gbx3gnoBvVHa3Hfv88akgA":{"text":"Great steakhouse that will give Ruth Chris' a run for their money. The steak is served jus","useful":0,"cool":0},"OWGMOpU4XZ9DLSTUN44yQg":{"text":"We arrived for a birthday party for a group of 17, they gave us a table for 10. We all fle","useful":0,"cool":0},"kN2_fCm9FwkmNR2jJuONdA":{"text":"Had reservations across the street at Marcello's.  However, we were dressed up because Yel","useful":0,"cool":1},"r_10fP1M3Fr8tOdBJ0M8dA":{"text":"I give this place the lowest rating possible. We booked a reservation a day in advance to ","useful":1,"cool":0},"QSh6CfEnhNw2FZS1y1FWmQ":{"text":"now this is real deal quality stuff for sure. i had possibly the best meal/night of my lif","useful":0,"cool":1},"9CrshPoCzLw3MZ4ExH7_Xw":{"text":"It was not bad but still pricey. There are definitely better places for the same type of f","useful":0,"cool":0},"Naf-IeKAJOcGn5b6gJtNiA":{"text":"This place was.....warm & welcoming. The food was more than I expected it to be. I was her","useful":2,"cool":1},"d72tp89vdA_XMXfHiPbItQ":{"text":"Great place for a weekday happy hour. I was there on a Wednesday at 5pm, and there were pl","useful":0,"cool":0},"pG9OMrSN_F5KVbDxDf9fOQ":{"text":"Perhaps our bartender was having an off night. Compared to the other reviews we read, our ","useful":3,"cool":2},"qsYKgxHUFg7reFaNMiHwEA":{"text":"Desi steakhouse is always a safe bet for steaks; however, its got some other great dishes ","useful":0,"cool":0},"Tlk6jgC5Q_XylWtksbMOew":{"text":"Winner winner, great steak dinner. This place is great. For me its one of the top three st","useful":0,"cool":0},"nku9QRoq5FOxkzu6jo_ZUw":{"text":"A very solid restaurant. I loved the atmosphere - came here when it was Mike's. This place","useful":0,"cool":0},"AmcY7KMqKNHuNOluxnqJ0A":{"text":"Steak was good.  Potato's were also good. I would go back again.  The white chocolate chip","useful":0,"cool":0},"6_L_i-2kzwXTCXBEcf5OXQ":{"text":"My wife and I went there to celebrate my birthday...the wait servers were outstanding-Jaso","useful":0,"cool":0},"D-u0HnIFDe98mf_27iNrpQ":{"text":"We spent our fifth anniversary at Desi Vega's, and it did not disappoint. The wait staff w","useful":0,"cool":0},"04UjnNwgxzMz9beCuTEfLQ":{"text":"Amazing! Steak was super tender. We got multiple sides and they were all delicious. Really","useful":0,"cool":0},"FPoRPu8V9a4yruvZDzx_tg":{"text":"Here is the sad part.  This was probably the best food I had during my entire vacation.  W","useful":0,"cool":0},"o0l3ig4u7qhvYjCddiYuNA":{"text":"Why not a 5th star? The meats were delicious perfect, the green tomatoes for the appetizer","useful":1,"cool":0},"1aIWIJOVobZRFTL2e2hq9w":{"text":"Service was great and so was the location. The steaks are encrusted with a large amount of","useful":1,"cool":0},"XE2P5ps4g1YMbhunHTcHzA":{"text":"The service was on point from the time we arrived until we left. Sean was outstanding.  Th","useful":0,"cool":0},"o_dD0RnfIgcHG8s0FgXzcA":{"text":"Fabulous business dinner . The restaurant has large windows with views of Lafayette Square","useful":0,"cool":0},"y6-7MpOyafvgQg0d6s2WxQ":{"text":"One of our favorite New Orleans steak houses.  One of our frequents.  Try the meatballs th","useful":0,"cool":0},"sqJ_CSaUtrm1aBsUrqzVng":{"text":"Wow!  I work in sales and we entertain clients often all over the US. I've been to some of","useful":0,"cool":0},"R_d6BRUKBV-AJFOiqPb6PA":{"text":"So glad to have spent our anniversary here! The entire experience was beyond my expectatio","useful":0,"cool":0},"x-gDjdgE2pEDjVQaKFYMog":{"text":"I was sadly on a diet, and trying to be good as gold.  The salad was superb, apps were sup","useful":0,"cool":0},"CnQKTVrpbFsxpjrLwwXzSw":{"text":"This was the worst experience.. ordered a drink, never came... ordered a salad... never ca","useful":0,"cool":0},"dMgh5_CQWM-Fz1xhFDgCgw":{"text":"Great dinner. Aromas took great care of us.  The food was awesome. Highly recommended!","useful":0,"cool":0},"j48VYD8nAP-PgE_gHL2U3w":{"text":"The steaks are not  the only great thing here. It has a great fish dish and the mix grill ","useful":0,"cool":0},"kEYO7aPB9gBSmtLbvhkwqA":{"text":"I had lunch at Desi's with a fairly large group (13) of women today. (Party booked approxi","useful":0,"cool":0},"U9y3-BVAPthl9xwJgxO0OQ":{"text":"My significant other brought me here for my b-day and from the drinks to dessert the food ","useful":0,"cool":0},"xw02GNZ4eana4AyfgizddA":{"text":"best steak i've ever had. any time in downtown new orleans, this is a must stop.","useful":0,"cool":0},"IE_SVkJYggoNCM01bMx58A":{"text":"***** - they deserves 10 stars! Incredible food and superior staff, we'll definitely be co","useful":0,"cool":0},"RvR_LifiGceXCalbvgeT7g":{"text":"One word AMAZING!!! Brian was the most friendliest and attentive waiter with a smile on hi","useful":0,"cool":0},"2oGk0rD6zmC9GKnMWptKIA":{"text":"My husband and I went to Desi Vega's for his birthday the night before NYE. Oh my gosh!!! ","useful":0,"cool":1},"P7gci2f9SEPqHeXpG7uS8A":{"text":"Steak was very average. Too many other steakhouses to choose from. Would not recommend. Fu","useful":0,"cool":0},"L8bglnVcy-B_JOUHQQCakw":{"text":"This steak house is a must when you are in NO. It's a place to see and to be seen, one of ","useful":0,"cool":0},"V9i3aJS-jci2NJ-wHzfDxg":{"text":"Richard is phenomenal! One of the best dining experiences I've had thus far. Happy Hour of","useful":0,"cool":0},"TNWVCwmyU2bvcTVan4oQQQ":{"text":"This place is phenomenal.  A wonderful atmosphere combined with great service and superb f","useful":0,"cool":0},"jg7cKxpI2HbjE91290Xeuw":{"text":"One of my favorite steakhouse in New Orleans. They are affiliated with with Mr. John steak","useful":0,"cool":0},"dzg-STlgNMwe16yHIsi0TA":{"text":"Pretty disappointing... the steak was a great cut of meat, but the service was just okay f","useful":0,"cool":0},"_kMQaegtqeKxpCQylGLzNQ":{"text":"Yet another great steakhouse in the city!  Mr. John's is great, but surprisingly I had a b","useful":4,"cool":2},"Iqpz5x84HDRB4TeWg1UFUg":{"text":"The food was absolutely perfect. I started with the Who Dat shrimp, and had a steak and po","useful":0,"cool":0},"8SeagaIh00lH-PFUFuvE3w":{"text":"Tonight we celebrated my nephew's 16th birthday. We could not have chosen a better place f","useful":0,"cool":0},"_-bprjo7lWWU5RJ1YtXNtg":{"text":"Per my buddies, Desi Vega's is one of New Orleans' best steakhouses.  I am not sure about ","useful":5,"cool":2},"wKUFA2PUZeKS50EdbDK_jQ":{"text":"Tried Desi Vega's on an early Saturday evening. My first impression was less than stellar ","useful":0,"cool":0},"6d1QklEG755Q3fJ3xlrmfQ":{"text":"Desi Vega's is hands down one of the top Steakhouses, The food and service was outstanding","useful":0,"cool":0},"H-gN0esCgxXdc9g2m36rJw":{"text":"My family went to Desi Vegas to celebrate my daughter's college graduation.  Without a dou","useful":1,"cool":0},"HBUhT9nEC5LHUOup-T5uOw":{"text":"The BEST petite filet and creme brulee my boyfriend and I had both ever eaten. We actually","useful":1,"cool":0},"yElG-yNir9-xUAW-mE9NRQ":{"text":"The stars are in relation to the price. The food was really good, but the prices were also","useful":0,"cool":0},"yWhHSejPFzh_qsSKpL1cRQ":{"text":"Awesome bar and food. The Who Dat Shrimp and steak bruschetta were addictive.  Great servi","useful":0,"cool":0},"4iYcJvddqSEIrAXVNMLkDQ":{"text":"Omg!! This food was heavenly!!! I found myself continuing to eat even after I was full cau","useful":1,"cool":0},"IL8OMutXXsgOqjEwO098_g":{"text":"A special birthday calls for a special place.A great place for the night. We started with ","useful":0,"cool":0},"JZde23KVX-4yOwBmakCKjg":{"text":"Good but expensive.Very friendly wait staff. Managers really stiff.Pathetic valet,horrible","useful":0,"cool":0},"SmmUAc5tfaetCc6cDdUvEA":{"text":"Best filet I think I ever had  . August gratin potatoes are a must try too. Dennis was a k","useful":0,"cool":0},"-ZGetSsdyQTlbrcOUAzmSA":{"text":"Downtown New Orleans has a very popular non chain steak house known as Mr. John's.  So pop","useful":3,"cool":1},"pzJnsx13mZuELD9e_-7fsg":{"text":"Approachable steakhouse with impeccable service. The \"Who Dat\" shrimp and all steaks here ","useful":0,"cool":0},"IwhUgP1boz8PxuGbrtWMAA":{"text":"Desi Vega's is one of my absolute favorite restaurants I have ever had the pleasure of din","useful":0,"cool":0},"Vx5nVHbbC0w9szVm5EpRsA":{"text":"A special birthday calls for a special place.A great place for the night. We started with ","useful":0,"cool":0},"BxNmqxlW26M5eMd2K-91cQ":{"text":"Bone in cowboy ordered medium. Overcooked and super dry. Buffalo shrimp really were not us","useful":1,"cool":0},"nZIbjjT_26iZxLS8yQuoAA":{"text":"I bought a LivinigSocial Voucher, $20 for $40. I have forgotten that Desi Vega has the sam","useful":3,"cool":1},"VK_NfbTGyjl4QuTCSl2mWg":{"text":"Just when I thought Mr. John Steakhouse was my favorite, I found this steakhouse to be equ","useful":3,"cool":0},"iDcEeK4PjHutWaXlKkOp2w":{"text":"Huge portions!  Steak, potatoes & a dessert w/raspberries.  Think typical steakhouse & pri","useful":0,"cool":1},"sjXP0zzV0gBabKsVtSFM9g":{"text":"Winning place. Friendly greeting at the door. Delightful service. And even check on by man","useful":0,"cool":0},"6-T8v7JYnvs0urxJMYpTjw":{"text":"I had a livingsocisl deal and went here for the porterhouse for 2. It's 36 oz of glorious ","useful":0,"cool":0},"X6NxNVwJWjMBTD3QKCkjmA":{"text":"Been here twice spread two years apart. A little over priced. My husband's steak was good ","useful":0,"cool":0},"h0fKPQ92PKc9jNgyBLVu2A":{"text":"Wonderful dinner! Amazing food, good service and management went well above what was expec","useful":0,"cool":0},"eQF20r9kmNKQQBe4lii3TA":{"text":"What a great steak restaurant !  Right on St Charles Ave next to Lafreniere Square. Lots o","useful":0,"cool":0},"biiqz9YtaiyZLgDt4O0eOw":{"text":"Went for a date night and the filet was divine. Everything we ate was phenomenal with impe","useful":0,"cool":0},"UUhbOn3ffvf6gjomefJiHg":{"text":"From the moment arrived we were treated like Kings and Queen - simply impeccable service. ","useful":0,"cool":0},"AXXOehUCRv-OxAwByega_g":{"text":"Food:\nFried Green Tomatoes: Really lump and fresh crab meat on top of three sliced pieces ","useful":1,"cool":0},"Mo0b3lb8lUr3FRz5xNcOiA":{"text":"Lights out! I have attended parties here as well as dined and the experience is always a g","useful":0,"cool":0},"AkvV3PVg-AdmZ0WAd1aa7g":{"text":"Called on a Friday night around 5:30 to see if we could get or if we needed a reservation ","useful":0,"cool":0},"xPDI9rqZowz3g0X2emeWvg":{"text":"My Husband and I have had an amazing time dining here . Our Server Jason was great every t","useful":0,"cool":0},"Wr0heLld-dCbqbNqYOaCqA":{"text":"Excellent steaks!  Convenient to downtown.  Attentive and knowledgeable service, though a ","useful":1,"cool":0},"NGHUggmvIZ3hSnaQGPH2Bw":{"text":"Great food. Great service. My husband and I tried the French onion soup and corn chowder f","useful":0,"cool":0},"xN-FiocDJUZyclyaqpMZeQ":{"text":"Lovely restaurant, great service by attentive, pleasant staff. We had a steak each, both o","useful":0,"cool":0},"8056wBy1B_JjN-8h1evCPQ":{"text":"Great place!  Awesome location with beautiful views of St. Charles street car.  Fun place ","useful":0,"cool":0},"M8MtJ8GelzT0XyEzugXdSA":{"text":"Excellent service and food. We had a rather large party and everyone left satisfied with n","useful":0,"cool":0},"TLZKy9tyl4UjKG5cVFOGDw":{"text":"I, along with three of my co-workers, indulge in the happy hour at Desi Vega's a few times","useful":1,"cool":1},"qx-_DgohnoR3Rq1O6ek2rw":{"text":"I was with a party for lunch on Wednesday and there were several calamities.  I took two b","useful":1,"cool":0},"0jgPdq9-rFYNtrePuQ0H9g":{"text":"The ambiance was so so. I liked that they seated various groups of men towards the bar and","useful":0,"cool":0},"a7dnGWoHKiyAj6mlQSNRFw":{"text":"Let me start by telling you it was wonderful! From the atmosphere to the drinks and food. ","useful":0,"cool":0},"V1Aw67b1OCfvF3QBVgbrbA":{"text":"Best, most charming and sincerely helpful service I've experienced. Great food and they ev","useful":1,"cool":1},"IdT-bZqd5wBt6S8LqGyhZw":{"text":"Tommy and Kevin waitstaff the service was impeccable. Highly recommended. Great food and f","useful":0,"cool":0},"F0rxnE947cs8RTB7UnMWkA":{"text":"We just stop by at bar for drinks and some appetizer. I liked their cocktail; and appetize","useful":0,"cool":0},"poqXJVud7pvzZVtTfQe_EQ":{"text":"Decided to find a steak house since all I've been eating was cajun/creol NOLA food.\n\nThis ","useful":1,"cool":0},"F4bERUfmSBy9faLh1spMEw":{"text":"Best steak that I have ever had in my life and I grew up eating at New Orleans restaurants","useful":0,"cool":0},"zs6kRODhYKMsPPFJqt90qA":{"text":"Another action-packed steak adventure! The happy hour can't be beat with great food, servi","useful":0,"cool":0},"lvCEEB6sVbZLED-pLmzZXw":{"text":"Wonderful steak, mac & cheese was amazing, great service","useful":0,"cool":0},"aVbg-9ZZ7K09pCEmELvj9g":{"text":"Richard and his staff at Desi Vega's could not have been more accommodating. They made our","useful":0,"cool":0},"h0dT4ywL286doy9U8DVl3w":{"text":"My boyfriend and I had an amazing experience at Desi Vega's tonight with Dennis. He gave p","useful":0,"cool":0},"QYKAwEQbhP1NmqrxRLCr1Q":{"text":"I enjoyed the bone-in filet mignon cooked perfectly medium-rare. Unfortunately for the pri","useful":0,"cool":0},"XhyJkZC6ktSzink3baKQ5A":{"text":"This place was unbelievable.  This is what you should expect from every great steak house ","useful":1,"cool":0},"ZqpF2uXxMOY8jO5xa2ZYtQ":{"text":"Wether it's lunch or dinner. I always experience gray service and a meal. I have not eaten","useful":0,"cool":0},"U2ilROHt3nnaj0-Iwn--7g":{"text":"Awesome food - great service - beautiful ambience!","useful":0,"cool":0},"WX0_Op2i8LeI7nQucqHYug":{"text":"I love both Mr. John's and Desi Vega's.  We went to Desi Vega's last Saturday night and ha","useful":2,"cool":0},"dznd06kkluXyVUA2RaX4PQ":{"text":"Not happy with this place. A friend purchesed a livingsocial coupon to take me here for my","useful":1,"cool":0},"5sxfHetaa8RGWXRMecJ1TA":{"text":"Had the bone in filet medium rare and it was perfect. Chef made up an off menu side of bru","useful":0,"cool":0},"VoIb-cjpc9kOmDE12CAL9w":{"text":"So happy I stumbled across this place. It's a hidden gem! There service was OUTSTANDING! A","useful":0,"cool":0},"xshaBlexplqYAXFrbDVyPA":{"text":"This place is an amazing restaurant.  Underrated as are most restaurants in the lobby of h","useful":0,"cool":0},"iGnNOP80ZrHPn6wU6PagEQ":{"text":"Exceptional service on every visit. I frequent this restaurant pretty often and I haven't ","useful":0,"cool":0},"RUHYbDKiuCC00PTwAb4xFQ":{"text":"The service is great-very attentive, nothing missed.  The food is excellent, for the most ","useful":1,"cool":0},"j4h-IfP_LUgaLofOG_0E1Q":{"text":"The service here is great as is the food. Steak is straight forward and delicious, sides w","useful":0,"cool":0},"lnICNwEu4EyNZ_7mM8CDSQ":{"text":"When traveling Yelp reviews serve as our neighborhood concierge, we rely on these reviews ","useful":0,"cool":0},"FK2LQyJrhw5J2YY3ge2rcw":{"text":"We celebrated my 65th birthday here tonight and it was one of the best experiences I have ","useful":0,"cool":0},"IeaZNtyHzeG0C9aEWISskA":{"text":"Food was ok...not great.  Suggested $255 bottle of wine and then proceeded to try to fill ","useful":2,"cool":0},"tJoji-aS0uW9F_cZrVZkCw":{"text":"First of all the service was AMAZING!!! Specifically Ivan and his assistant. To be concise","useful":0,"cool":0},"4V8iZqwbqbipDfe6tXYOmA":{"text":"Had one of the best meals in a long time. Waiter and staff were great. Food was hot and de","useful":0,"cool":0},"9NVLrGvn7sOBenqcptl0Ww":{"text":"Excellent! Service, ambience and food was all top notch. We will definitely be back.","useful":0,"cool":0},"LQu8KrUa53fDdbv0g2pykg":{"text":"Best steak, best service, best wine selection, LOVED it here so much. JD was our waiter an","useful":0,"cool":0},"NLtlcgxTV77d1-_gCsTNlw":{"text":"I am very hard to please when it comes to steak. That being said, everything we ate at Des","useful":0,"cool":0},"mQ8ltd2rHulbh__wFTngEA":{"text":"Our favorite place to dine in the city!  Addie is so wonderful and accommodating to our fa","useful":0,"cool":0},"EBj5aUFiW_zSI2719CgwYA":{"text":"There service was great! The food was pretty good.. The only issue I had was with my filet","useful":0,"cool":0},"xjuk6Q3M6oOgkFrlXJGfmQ":{"text":"The cocktails (perfect dirty martinis) and wine list, food, desserts (holy white chocolate","useful":0,"cool":0},"oommcGrAyzTlICLEUy93wg":{"text":"Great New Orleans resteraunt.  The view of St. Charles is wonderful.  I had the meatball p","useful":0,"cool":0},"A4YKkhI4S7tKEbKDKzT8Fw":{"text":"We dropped in a few months ago to have a cocktail before going to Herbsaint's for dinner a","useful":0,"cool":0},"XXD7rc4YZ9LT-1-Jv7ik0g":{"text":"Went last night with friends. Truly great in every way. One of the best fillets I've ever ","useful":0,"cool":0},"OFkqTOr5xJKbJE31qn-ZAA":{"text":"The atmosphere was wonderful and service great. The petit filet was made to perfection. My","useful":0,"cool":0},"b1lkjtCy_92wdCLCdn0abA":{"text":"Without question, one of the best meals I have ever had in NOLA!  Food, Service and Ambian","useful":0,"cool":0},"dTtCT_ClZHDeUn-oOJqVJA":{"text":"Some out-of-town vendors of mine asked me to recommend a place for them to take us to eat,","useful":0,"cool":0},"B_-m8WA60qhItkEv9egE3w":{"text":"Celebrated at Desi Vega's last night. The mister and I started with cocktails at the bar. ","useful":1,"cool":0},"m6CGgzyeWRu1HIlwUadu8A":{"text":"Found this restaurant online last minute and decided to give it a try.  We found it to be ","useful":0,"cool":0},"UqVSqjQbaE4FwALif-hH9Q":{"text":"This place is truly special. With a winning combination of a classy but not uptight atmosp","useful":0,"cool":0},"YLhyImx1TKxB3tYv6yqcmA":{"text":"Went after a Saints game to celebrate my boyfriend's birthday. Great atmosphere and charmi","useful":0,"cool":0},"5Tf5O9atTuvYrnKenYNxVA":{"text":"Desi is a great host and Victoria attended to our every need and guided us towards the ult","useful":0,"cool":0},"8CJHRJNMdDEeRQyXNyd_PA":{"text":"I have no complaints. Went for my birthday and it was fantastic. Yes it's pricey but IMO w","useful":0,"cool":0},"mR7pXwzLGoxlPvbbovn8Uw":{"text":"This is a must visit if you are in New Orleans.The Who Dat Shrimp and Filet Mignon were am","useful":0,"cool":0},"6em210I5iPfzo3SAdNYebA":{"text":"Hands down best service and steak I have had in the city. Went for the first time about a ","useful":0,"cool":0},"NxnnvdZoH9uwgzQbSQCzEQ":{"text":"This place is modern hipster version of Mr John's steakhouse. Excellent service and great ","useful":1,"cool":1},"IN0ugvX-lY1_ht5kNdUoGQ":{"text":"Let me start by saying that I have loved Desi's for years and recommended it to many frien","useful":2,"cool":1},"p3B7CMRLMdl5gt69DZJTHg":{"text":"Grabbed dinner here on our 1st monthly steak night and I was all around impressed. One of ","useful":0,"cool":0},"hRl8oPzWRJKdm2vstE8c_A":{"text":"This is the best steakhouse in town next to Mr. John's. A must stop when you're in New Orl","useful":0,"cool":0},"Wh5Rvz5keMmJBRzG4oVgag":{"text":"Desi Vega's staff know how to treat their customers while serving up amazing steaks. Chris","useful":0,"cool":0},"sKe4vl1F3FulcV51GlE18A":{"text":"First time here Friday night and was so impressed. The Who dat shrimp and the filet were a","useful":0,"cool":0},"vMd4AZECXf14haFbBd7SdQ":{"text":"One of the best food experiences I've ever had (not just in New Orleans, but life). Made a","useful":0,"cool":0},"fl0_7qz5w85qcTTj2oTjXg":{"text":"Great place to to have dinner.  The entree was above average.  The red velvet brownie was ","useful":0,"cool":0},"08N9PFg4x5dmoC3Aqi3eRQ":{"text":"Delicious dining experience! Excellent service and wonderful cuisine! We enjoyed the Ribey","useful":1,"cool":0},"utMGrC_9sghd09yolJAS4Q":{"text":"Absolutely wonderful! From the time we walked in to the time we left we were all taken car","useful":0,"cool":0},"0GFMn9LtH1KDj9noc6BA3g":{"text":"Hands down the best meal I have ever had! The lump crab caprese salad was amazing! Lobster","useful":0,"cool":0},"BQe7EtfBbMOAPebqYjaAWw":{"text":"Appetizers phenomenal. The only mediocre dish was the lobster bisque. Lamp chops good but ","useful":0,"cool":0},"gFtXAp7UtuiLkV7ZPg0Z-g":{"text":"\"High-end steaks\". I asked for rare steak. I was served a medium steak. My spouse got rare","useful":0,"cool":0},"3qnm1h7sMPxNa_ePKp5O8A":{"text":"Beautiful decor, great food, and very friendly staff. A must visit when in New Orleans!","useful":0,"cool":0},"3-jRSypSauUqa385VWKkTA":{"text":"I came to this restaurant back in April and it was amazing. Everything I ordered tasted ab","useful":0,"cool":0},"KVZnBkINkLp9pCos92zXRg":{"text":"I have not a single complaint about this restaurant. The prices are no surprise but the fo","useful":1,"cool":1},"aAM1w617AJEkr3-PctXdMQ":{"text":"Did it again last night. Great steak, perfect appetizers and a delicious dessert. \n\nThe sp","useful":0,"cool":0},"sBgua9tKH8Gc9EE5gzs9dQ":{"text":"It was not a mis-steak!\n\nGot the ribeye which came out still sizzling on the plate. It was","useful":0,"cool":0},"kEm34WosJ552LIFnGeTETg":{"text":"Desi Vega's Steakhouse is my all time favorite! Anytime I am off we have to go there. Thei","useful":0,"cool":0},"Qv5kdjWbAAHh1-tH6RpM7w":{"text":"Everybody who said good things knew what they were talking about\n\nThe ribeye steak was coo","useful":0,"cool":0},"pp70L5nlxCBS0hjch9eOHA":{"text":"I went to this steakhouse on Saturday, April 29, 2017.  I was so excited since I have trie","useful":1,"cool":1},"rVQItmxTDcwkOO9jriXGhA":{"text":"My favorite steakhouse in all of New Orleans. My husband and I love to go for our annivers","useful":0,"cool":1},"TTqpwlKEDCn4Xq4aT0EaPQ":{"text":"The meatballs!!! So good, apparently they are a family recipe of melt in your mouth delici","useful":0,"cool":0},"sj36nAhiM696cN9bVbEOFg":{"text":"Outstanding evening with great steaks and lobster. Wait Staff did a great job and made for","useful":0,"cool":0},"IU642jsvdLSbhOjElMQQDQ":{"text":"First let me say that I've been to numerous steakhouses and this one far has been the best","useful":0,"cool":1},"NAMIvwNHQfu8_Egd9II86g":{"text":"My husband and I were looking for somewhere with a good atmosphere with great food.  We fo","useful":0,"cool":0},"0G49v_JEavZhodRt6uw4zQ":{"text":"If you want great service and superior food this the place! We ate at this place and right","useful":0,"cool":0},"yG5vIQokmUQeN6hM8OcSwQ":{"text":"We had a fantastic meal here last night that so exceeded my expectations. The service was ","useful":0,"cool":0},"aO4LSs3BtBBUprWcx8q5dQ":{"text":"Class!! That is best word to describe this place. Top notch food especially the steaks. Ov","useful":0,"cool":0},"H78YSq3v8jdXFuWkKMQU7A":{"text":"My Husband and I had a beautiful time as always . The Food was soooo good . Our Steaks was","useful":0,"cool":1},"Eq8ueGGOogPp-lP_nC5Zzw":{"text":"We had dinner for the four of us and we will never forget the wonderful way we were treate","useful":0,"cool":0},"C69d7n83W7gmHZ_LXI2SSw":{"text":"I was waiting to catch up with friends and wanted to grab a quick bit and  a drink to tide","useful":0,"cool":0},"wTx6gLPpYbVTpDDUmcbxvg":{"text":"The best steak in New Orleans. Hands down. The happy hour menu showcased a vast array of s","useful":0,"cool":0},"MJiGbmGxKR7kDmZf3jwwgg":{"text":"Fantastic meal.   Lance took great care of us.  Loved the \"Who dat shrimp.\"\nThe steak was ","useful":0,"cool":0},"B1KlaGQ2_TCH6dXUWkpO5w":{"text":"Service 10/10\nFood 10/10\nPrice 5/10\nEnvironment 10/10\nExperience 10/10\n\nService was great.","useful":1,"cool":0},"gbM7gEG1U1vc79k18f-OvQ":{"text":"Hands down, BEST steakhouse in New Orleans. And don't leave without trying the Who Dat Shr","useful":1,"cool":0},"74JIBFdelI3ieLyMVf5yCw":{"text":"Excellent, bright space with a great view of the area around the park. They have high top ","useful":1,"cool":0},"p-YOTO3R4D50A9lK0J7gvw":{"text":"Omgggg. Ate here for my birthday this year and I am so not disappointed! What I'm really d","useful":2,"cool":1},"zy71UEUQi3FHY2Hby3LWYw":{"text":"We came for early dinner at 5.45pm. The hostess greeted and seated us right away on a tabl","useful":0,"cool":0},"yqXhuY20wqZZXbT2_1QrLw":{"text":"Had the bib salad, fried green tomatoes, Mac n cheese, and potatoes and was very delish!","useful":0,"cool":0},"KN6c8yB78idnHyJN-s2REg":{"text":"Desi Vega's is one of those restaurants that I've heard about for years and have been wait","useful":3,"cool":3},"-Ts9P1bASPVgpnqDm03Qow":{"text":"Best steak I have had in New Orleans in years. Great atmosphere, superb service and great ","useful":0,"cool":0},"unUKJ-CHdOXSTgtXppC85Q":{"text":"Celebrated my birthday this weekend and everything was amazing! The food was a bit pricey ","useful":0,"cool":0},"7WRIdNK7f-usHL7-kaytSA":{"text":"Always great! Staff is on point and the food is consistently amazing! The best steakhouse ","useful":0,"cool":0},"TiT1cnc0i5kAKIGfUBqnhw":{"text":"Very nice steakhouse. My wife got the filet and I got a ribeye, both were great. Service w","useful":1,"cool":1},"d-BVTm_VZdKhHwFi7H3rfg":{"text":"Fantastic service and even better food. Ate there twice in 2 days on my first trip to NO a","useful":0,"cool":0},"bMMJtxBOu8CYJQ2YPMeU6A":{"text":"I eat here often with friends and while the food is always fantastic the last trip we made","useful":0,"cool":0},"7LBWTG2A_ZqF74J2vQqldQ":{"text":"This place is nothing shy of AMAZING!!! Came here tonight for our anniversary and they mad","useful":0,"cool":0},"OEMSZT7x5KIzYG1GelzhdQ":{"text":"FANTASTIC! We had a reservation for four on New Years Eve and from the moment they opened ","useful":0,"cool":0},"7w-q9q0RHmj-ZuhoHsxKzQ":{"text":"I have eaten at nearly every steakhouse in New Orleans and this is arguably my favorite. E","useful":0,"cool":0},"Y__q59ZS0cY4hlvOdbClRQ":{"text":"I absolutely love Desi Vegas! The steaks are perfect! They also have a great happy hour...","useful":0,"cool":0},"Nj7qiiNRUI3uQShpFYZ_GQ":{"text":"The service here was so amazing. The food was delicious! We are so thankful we were able t","useful":0,"cool":0},"UB8sSjC2Ss2g-CDIj_CjaA":{"text":"Great Steak house and extremely underrated. This place ranked top for me from meal to serv","useful":1,"cool":1},"Hzb4KAe5UMBimK779ucUcg":{"text":"My Co-workers and I have found Desi Vegas Happy hour to be our must go to on Fridays after","useful":0,"cool":0},"9N6DyI-GXl3dHZ5GvpvBIg":{"text":"What an unbelievably great experience! The food.  The atmosphere. The service. Wait time. ","useful":2,"cool":1},"_kjFvLE-eNc0P41ErqnQrA":{"text":"Had the porterhouse, fried calamari, crab cake, Mac and cheese, mashed potatoes and ended ","useful":0,"cool":0},"FvJjLlG4r3nTdlBGpA64Gg":{"text":"Our very first time visiting NOLA and had my birthday dinner here. The staff is friendly a","useful":0,"cool":0},"oxHc4rT0zs3vZRbNm_x9VA":{"text":"The decor didn't change at all from when it was Mike's on the Avenue.  Order the Crystal O","useful":0,"cool":0},"xpgkV0LNswfI0zMkMRSqdg":{"text":"Step 1 of battling the birthday dinner game....order a living social deal and make your se","useful":2,"cool":1},"TAOIE-Q7uSVjyuLQq4Vmxw":{"text":"The food and service is exactly like Mr. John's which is to say quite excellent.  The ambi","useful":4,"cool":4},"rHKh94WCUDiL-EFQ2LXsqQ":{"text":"Tonight was our first time dinning there but will definitely not be our last. Our party of","useful":0,"cool":0},"C0_sjKNjdfyToan4ydCdJw":{"text":"Booked a party of 18 for a work event and was very pleased with the food quality, service ","useful":1,"cool":0},"5oJuSNTeaCTUvwi15l-A1g":{"text":"If there were 6 stars I would rate it as such. Amazing filet mignon and who Dat shrimp. Lo","useful":0,"cool":0},"mSKWPdHdsMLX5V9LZbfAcA":{"text":"I had lunch here before attending a Mardi Gras parade and went with a large group. We orde","useful":0,"cool":0},"Nf19IiUGv9zz4vygIO5osA":{"text":"My wife and I ate hear on a Saturday evening for date night. The food and service were gre","useful":0,"cool":0},"NhzQGS80np_bjg5-PNf0Qw":{"text":"I did a review for Living social already. Desi Vegas was far superior to Mr. John's where ","useful":0,"cool":0},"3EOwS-10xEmMeNIVOsYfYg":{"text":"This is definitely a place I will be coming back to. We had a dinner party for a friends b","useful":0,"cool":0},"vyC3rAsmZNjWl1LExISyMg":{"text":"The porterhouse was amazing! Loved the mashed potatoes and fries. Presentation for the fla","useful":0,"cool":0},"EOwHsqX1lWPDEiDlOCtmWA":{"text":"We made a reservation or 9pm on a Saturday based off a friend's recommendation. Easy to fi","useful":0,"cool":0},"7rgTCpQInLq1uDWw-vQwZA":{"text":"Sat in the bar for over a half hour and couldn't get the bartender to even greet us from a","useful":0,"cool":0},"IyQRvs0VF1LLiujeJDE69g":{"text":"This place had the best customer service experience that I have EVER had a at restaurant e","useful":4,"cool":4},"iOQggjDJxQDObNbY466vcQ":{"text":"4.5 stars, but rounding up to 5.   Been looking for an alternate choice to Mr. John's sinc","useful":1,"cool":0},"tALRzp5_sb1PgUYIkRgHUw":{"text":"Just had an awful experience here. Had to wait 30 minutes with a reservation, the hostess ","useful":0,"cool":0},"jm8xZblC2HcA4qsJ_Uk9Pw":{"text":"Need an excuse to get fancy? Have a steak, drinks & apps? Try Desi's! They have great happ","useful":3,"cool":0},"Nr8QZrDjHmCQbWeU3yA0Vg":{"text":"Excellent Steakhouse with all the trimmings, steaks come to your table on a sizzling plate","useful":0,"cool":0},"4_C56SBryvr0F_zh1SBZtw":{"text":"Food was an excellent!  Appreciated that everyone's selection came out together and served","useful":0,"cool":0},"CTrCqHgZlHlWIRyzuQL8EA":{"text":"Went here with a friend for dinner after drinks in the CBD. We had a long talk with Desi w","useful":3,"cool":0},"Sv9wa7o_HoTdqe4gLFKY9Q":{"text":"Their counterpart Mr. John's is the more prevailing fraternal twin. Steaks were good, serv","useful":0,"cool":0},"jVR4QuVh1RDHi2H59dVi3g":{"text":"Seriously amazing steak! The Filet Mignon was cooked to perfection, was super tender, and ","useful":0,"cool":0},"KtVxgqPW59VKxCYBn3zASA":{"text":"My boyfriend and I had a perfect evening here - and would have been disappointed with anyt","useful":1,"cool":0},"2zzzZNPdBIfnWjBk0Z9IHA":{"text":"Finally tried this steakhouse and it's certainly one of the better steakhouses in Nola. Th","useful":0,"cool":0},"6Ts-madT12Q53-Wiey3E0Q":{"text":"Worst experience ever!! They ruined my 50th Birthday celebration.  Made a reservation for ","useful":3,"cool":1},"6SY5g4NLqUq1F4fM7DaVZw":{"text":"We had a great dinner after Wednesday in the Square!!  Dennis was our server and he did a ","useful":0,"cool":0},"oX9nBID_HfIsi0UOaGKoZQ":{"text":"Brian was an amazing waiter and all the food we ordered was so delicious! The service at t","useful":1,"cool":1},"v97o5BZ1zBpxbDeTIe8LOw":{"text":"The service here was excellent.  The sides and drinks were also great.  Where the evening ","useful":0,"cool":0},"_ggJiJ8qHzi7dNhPFnaX1A":{"text":"This is by far one of the best steak houses in the city of New Orleans I have eaten at thi","useful":0,"cool":0},"BIbkKqFaptBeSZEVJaPppg":{"text":"REVIEW OF LUNCH (NOT STEAK):\nMaybe I should have only come here for the steak, but I went ","useful":0,"cool":0},"zEqsT5JR2qtsofyH0G7x0Q":{"text":"I really enjoyed my birthday dinner here. I had the avocado and crab stack...amazing. Our ","useful":0,"cool":0},"J0vk-djGx-raErUgo3aYYQ":{"text":"Came for a work lunch today.  I had the steak sandwich and asparagus.  The sandwich also c","useful":1,"cool":0},"KpNFepWDHP726Lwao94xVQ":{"text":"Every bit as good as stated by others. Our dinner was fantastic and the waiters were outst","useful":0,"cool":0},"D5sXlF0k537caRcpQeJRcQ":{"text":"I wish that I could give this place 6 stars!  Great atmosphere and great attention to deta","useful":0,"cool":0},"GgNRtjX2D_WzQac2H-UMkQ":{"text":"The Bosin Bibb salad was one of the best I've ever had, the steaks were great and although","useful":0,"cool":0},"aPfWbs5BJXcX6eKe9Cq1-g":{"text":"We had dinner here for the first time and I could not have imagined a better experience. W","useful":0,"cool":0},"ZIYzC0G0j-oAw4bsfGuZiA":{"text":"My wife and I were in the Big Easy celebrating our 27th Anniversary and watching the Saint","useful":0,"cool":0},"lxeJYy7vPi7AtlcR2jB3wA":{"text":"5 out of 5 stars. Recently had dinner at Desi Vega's before seeing Hamilton at the Saenger","useful":0,"cool":0},"mUfo3vG9Gckr0VezTj07kA":{"text":"Looking for a nice New Orleans restaurant? This is a great option! Excellent food and serv","useful":2,"cool":1},"8VMUOWNSSdbf3iHyFECG3g":{"text":"What a fantastic birthday dinner!  French onion soup was excellent. Hubby had the turtle s","useful":1,"cool":1},"zRncuuaYf1Xcwh6aSi6NJQ":{"text":"Such an amazing experience. We started with the fried green tomatoes, which were out of th","useful":1,"cool":0},"F1ChDFtCAM3f6MoWgCABSQ":{"text":"Amazing!!!! So we visited its sister restaurant, Mr. John's, about a year ago and were equ","useful":4,"cool":2},"8mLOPxj8PJmQLnfX3pC7Sw":{"text":"The boyfriend made late reservations  (9:30) for us to come here this past Saturday. We pa","useful":15,"cool":6},"7VuJbgy2X-zb368IoWBXQA":{"text":"I honestly don't know where to to begin. Desi vegas steakhouse was a blast. Let me start b","useful":5,"cool":1},"gAXW6w2QT2y50HBALpvqVw":{"text":"What a great restaurant! It's about a $7 ride over from the French Quarter. The restaurant","useful":1,"cool":0},"5pkDYgGIW2T67UeKKKKGtA":{"text":"First time here but definitely won't be my last.  Beautiful room with windows overlooking ","useful":3,"cool":2},"vVYrwJFA9wwc_Bd-AIG83A":{"text":"We ate at both this steakhouse and another very popular one in New Orleans and let me tell","useful":0,"cool":0},"lTGN33GcClEhABOL_oxrBg":{"text":"What a fantastic retirement work lunch today!  The service was impeccable!  The steaks and","useful":0,"cool":1},"gRzVliesQTyifBaxliC_Bg":{"text":"We went for our 20th anniversary.  What a treat!  The porterhouse with a bleu cheese crust","useful":1,"cool":0},"OmjkvJqWre9R_6oFFQPhrw":{"text":"The food was fantastic and the service was the best we've experienced. It was amazing how ","useful":1,"cool":0},"4fiAatBOhY3U_dBi1qBuLA":{"text":"Amazing meal! This was by far the best steakhouse experience I've ever had.\n\nI was surpris","useful":6,"cool":6},"aSMSlSBU3C65QJJTd_1FkQ":{"text":"I assumed this place wasn't going to be cheap because it is a hotel bar,  but I was not ex","useful":5,"cool":2},"diueGeAfJ_sZsATGinTpzg":{"text":"I celebrated my 35th birthday here on 10/17/2020. I had the crab cake appetizer and lamb c","useful":0,"cool":0},"INNLatPPj0t290CqpqRIWQ":{"text":"I came here with 3 friends Friday night.  I had reservations.  We ordered a bottle of wine","useful":2,"cool":1},"3EBAdU2mii3loebtP9TUmw":{"text":"We had a wonderful experience !! The customer service was amazing . Lance was our waiter h","useful":0,"cool":0},"GssMpp_AMtbHZzaIXLm60Q":{"text":"Excellent food, plus fast, attentive and efficient service made for a memorable meal and d","useful":0,"cool":0},"7UjHBptPFXxHGXF1e6TsRg":{"text":"If I could give zero stars I would. Overpriced and Overrated. The service here was terribl","useful":0,"cool":0},"HIaHEAHgTt7Uj-kRfj3mdw":{"text":"Husband and I had guest in town from Maryland for a birthday celebration, we are not reall","useful":0,"cool":0},"LA5_pp8QpyfqhOWyP5FW-g":{"text":"Omg this place exceeded my expectations as far as food and service. We were in town from T","useful":1,"cool":0},"S62S_37btea733E6ar1oqw":{"text":"When you arrive, the restaurant and hostess stand is inside the hotel on the first floor t","useful":8,"cool":6},"KM2PqJdGQbgghpsq5EKUwg":{"text":"This place is overrated. There.. I said it. Don't get me wrong, the service is exceptional","useful":0,"cool":0},"uHUsqUjL1x67y6ULYHHimQ":{"text":"Everyone who knows me...knows how I feel about Desi Vega's. I go there often for lunch. To","useful":1,"cool":1},"Nt38mo0bPDuCfoxqYA8sqw":{"text":"Having had a reservation, we were seated immediately. We had two waiters, who were magnifi","useful":0,"cool":0},"YWdsQAClFMQcqWHtjsnisQ":{"text":"This was our second visit here. Our first visit was amazing! The food was great, the servi","useful":0,"cool":0},"Eg-LL6S-glHCfYyM-Kbl1g":{"text":"I had a birthday dinner here on 6/25. The service was amazing. The ambiance and social dis","useful":0,"cool":0},"UonMZxdB5uaU2oDCH-y4jA":{"text":"I can't wait to eat here. Definitely looking forward to having the Colorado lamb chops !!","useful":0,"cool":0},"T3-Ki0bI6mnlWk9RZCiM3A":{"text":"Lunch Review\n\nThe space occupied by Desi Vega's has a long history of failed restaurants. ","useful":7,"cool":3},"LlxzcylfqPu-9N98_P7J_A":{"text":"I went for the second time this past weekend after having healed from my tonsillectomy. I ","useful":0,"cool":0},"QdTKpCLSk193vdMAHJLKAw":{"text":"Incredible service here, in a gorgeous area of town! We wanted to leave New Orleans with a","useful":1,"cool":0},"BR5hVx5YeHmjbcRmZvLAOA":{"text":"Disappointing steak but the rest was great.  Took extended family out for my sons 22nd bir","useful":0,"cool":0},"H_Kys6fXGJ06my2u5AD93Q":{"text":"The atmosphere and staff are wonderful! Not enough can be said about the staff, the servic","useful":0,"cool":0},"d3RHktzl_q8eTo5mWnFr9A":{"text":"Incredible! We expected a good experience and they made it great! The wine was a perfect c","useful":0,"cool":0},"7SnAruxHFjDWGi1PcSD4EQ":{"text":"The saving grace for this experience was Glennnnnnn! The best waiter in New Orleans. He wa","useful":0,"cool":0},"Z1U6mVnSqJHtIySW22lMiA":{"text":"Do not choose if celebrating a special event with more than 6 adults. \n\nI raved to my fami","useful":1,"cool":0},"o8xggxHnFnnpH7EnT6oShg":{"text":"It's rare for me to leave a bad review; this place would get zero stars if possible. Went ","useful":2,"cool":0},"f77PMldWBS3TxbsQAef8wg":{"text":"Had gone here back in September. It was a romantic date and everything, but it wasn't wort","useful":1,"cool":0},"51l2C2njXqkHlj2WNzVKDg":{"text":"Great atmosphere!!!! Great food!!! Awesome service.... Kevin was out server he was extreme","useful":0,"cool":0},"1aXhdcBgw5byHfXmE_xFZg":{"text":"This place exceeded our expectations. Came here for my husband's birthday and we were thor","useful":0,"cool":0},"Ju7q5YjJxzHnS2O1UfuXNw":{"text":"Amazing service, food, and drinks can always be found at Desi's. Though known for their st","useful":1,"cool":1},"6CP2TG6qDoc4wQs1wkcJVg":{"text":"Awful experience at desi Vegas steakhouse! Michelle confirmed our 12 top via email and the","useful":0,"cool":0},"el9-1kS8Wwn_s2QExCg5FA":{"text":"Five out of five!  \n\nWent there for a work event and was completely blown away by the File","useful":3,"cool":2},"38PZUhOgiHqcrLmh-EZR0w":{"text":"My boyfriend and I went to desi Vegas last night for his birthday and it was every bit of ","useful":0,"cool":0},"QWc5RBNvnEeHANXt3_LHOA":{"text":"The service was absolutely impeccable. Food delicious!  Fried green tomato, oysters, red f","useful":0,"cool":0},"pYh72dsV9K8RfP1jy6hNdQ":{"text":"I came here yesterday for drinks and dinner.  The service was impeccable.  Management were","useful":7,"cool":6},"yX9oQYXERAbT2ZVQvyINuw":{"text":"Desi Vega's was the perfect spot for a business lunch on a Tuesday. The atmosphere is mode","useful":1,"cool":1},"7tKcV4PJB1VgWMkauFWFIw":{"text":"THE ATMOSPHERE KILLS IT FOR ME\n...or lack of it. If I'm paying $40 or more for a slab of m","useful":6,"cool":2},"1Fa-SlO1e2e6SK-663nBOA":{"text":"Desi Vega's Steakhouse on the Northshore. The service is unmatched. The staff truly cares ","useful":0,"cool":0},"EnDG-xWtqBLqPlWurPss0Q":{"text":"We were in town for a short vacation. We reserved dinner at another steakhouse which turn ","useful":0,"cool":0},"VxpibORiYkFjL_I5Sn73yQ":{"text":"Saturday me and my boyfriend celebrated my birthday. Our reservation was for 6, but just l","useful":0,"cool":0},"y0rGKhl29jw3bZawVFFtnw":{"text":"By far the BEST steak house in the city!! Companied with their amazing staff and service y","useful":0,"cool":0},"LZRmzcnSIfCXt-r8P6VBFQ":{"text":"Great night! For appetizers I had calamari, stuff shrimp and turtle soup. Loved the turtle","useful":0,"cool":0},"1H7ZMNxVirJBE33mjjo3iA":{"text":"Amazing service, food and drinks. Naturally,\nI ordered the bone-in ribeye, Oscar style (on","useful":0,"cool":0},"PdJ_OedGVfAMj_7U4sSqOQ":{"text":"Sad to say, but it's not worth the visit, meat quality good, but the remaining items - sal","useful":1,"cool":0},"HzZChE8J1zU1x0WoTescHg":{"text":"We celebrated our 6 year anniversary here this week and it was lovely! My other half is a ","useful":5,"cool":1},"hqKlXsdsLM3qdY2GDR9KDA":{"text":"We went to Desi Vega's for a birthday dinner after being told it's the best steakhouse in ","useful":0,"cool":0},"PD6dWaacVYWrQ291kWdUUQ":{"text":"This place ain't nothing special.... service is not the best and food is a 6-10 ... the co","useful":0,"cool":0},"1kAEUqB8bGBnComGG1-Gqg":{"text":"Best food I've had in such a long time. From appetizers, to desserts, nothing disappointed","useful":0,"cool":0},"9KdkyMOmdrklF4jC7fZlWQ":{"text":"Ribeye was phenomenal and The Who dat shrimp is a must have. Decor was nice and simple and","useful":1,"cool":1},"vu6aml45DKi1DOb8z0igVw":{"text":"This place is the seriously the bomb! Great ambience, Romantic dim-lit dining, Delicious f","useful":0,"cool":0},"uWhJKvdROyuR1ZCv-gPm0g":{"text":"Amazing venue.. I took my husband here for his birthday in December, which was a nostalgic","useful":0,"cool":0},"uyEQLjy31qhP1l9ignIIVQ":{"text":"One of the best steakhouse around.  The Saint cocktail was fabulous.  Bacon wrapped shrimp","useful":0,"cool":0},"pfV9zjj0X6idrMy9B5ICmA":{"text":"Just destroyed this place tonight. Been 5 years since I've been in NOLA. This is what I or","useful":0,"cool":0},"amwme_jMeBACjHUTbLpdOw":{"text":"Intimate atmosphere and lovely service!  Came here for my husband's birthday and we were a","useful":0,"cool":0},"tN4FXWDDRQLLJwiBt2bfUg":{"text":"How do you make a reservation for 5 and at the last minute get told they can't accommodate","useful":1,"cool":0},"LKCduf7gaEQRKRjdDpfZQQ":{"text":"Another great time at Desi. Our servers was David and Dennis and they did a great job. We ","useful":0,"cool":0},"MVYMWT_t2zWwfbtYDeWKmA":{"text":"Came in for happy hour and ordered the burger it was fantastic bun could have been toasty ","useful":0,"cool":0},"fyiLjJWBVaFTDz8A-yomzg":{"text":"We went for my husband's bday dinner. It is a nice restaurant and would recommend dressing","useful":0,"cool":0},"NrcTJ1H37IpJqDxRdcF9xw":{"text":"Happy hour strikes again! Desi's updated their happy hour menu with some new seafood orien","useful":3,"cool":1},"s_shP9k1R8AVv5CmHW5lTw":{"text":"Order the lamb chops with potatoes which were great!! The Mac and cheese was not good. Lov","useful":0,"cool":0},"In7Gu7kIcaBox4fEM0YaSQ":{"text":"my bf reserved this place for my birthday dinner and it was amazing! \nThe servers were so ","useful":0,"cool":0},"VLIpex07CK4IVJ0HRKr6AA":{"text":"This was my third visit to Desi Vega's. Twice n Veteran's and once on St Charles. I can sa","useful":0,"cool":0},"JWwYg7tCD2OLe8xUifzrRA":{"text":"This place totally surprises me when I see such high reviews. This was the 8th place I cal","useful":2,"cool":0},"ji1vt6rlXrXh8aXQEfWEyA":{"text":"Let's start with parking: they have valet as well as paid street parking. I believe there ","useful":0,"cool":0},"bxN8xuUWiCkbodcp6DYjJA":{"text":"Best steak house ever you have to take you partner or have a date there it's loud but it w","useful":0,"cool":0},"vwiRsPWOdIqebCz0VxBnZA":{"text":"Mario and Joseph were our waiters at Desi Vega's. They were so helpful and kind! Joseph re","useful":1,"cool":1},"zlIVXGx59-cz6ax2rUUiJg":{"text":"No complaints for me. Great food (I had the filet mignon), good drinks and good service! R","useful":0,"cool":0},"68IQnqZexzbDHdpR_eGwbQ":{"text":"This is the place to go for the hands down best food and service in New Orleans.  Quality ","useful":0,"cool":0},"9wSQT5_vjhGgYCKy9l7QyA":{"text":"Always an excellent place to dine.  We love the crab cake, gnocchi with lump crab meat, la","useful":2,"cool":1},"Zi5kgsNeb9gOA0SB6O7WvA":{"text":"Totally long and over due but what a WONDERFUL experience from start to finish. \n\nGetting ","useful":2,"cool":1},"gy1lM-cJjJHHeFbPyakeOg":{"text":"I frequent the sister restaurant Mr. John's and have always wanted to experience Desi Vega","useful":4,"cool":0},"FzwkGbhIrK9G47Rt2Qw4eQ":{"text":"Lance was our server extraordinaire ... he was simply a pleasure !!!! They don't teach wha","useful":0,"cool":0},"P--k_zP-f4qXmjE-z_QSXQ":{"text":"Definitely adding to our \"best places we've ever ate\" list. Great experience for my 40th b","useful":0,"cool":0},"IBQC9t-h3uZyXRNYKrGAyg":{"text":"First it wasn't tgat busy and the meal took 50 minutes.Had the bone in fillet. Ordered med","useful":0,"cool":0},"EzXtfC4zQHLA3fMEP0k9MA":{"text":"We just got in to NOLA yesterday and wanted a great steak  and seafood placce for dinner w","useful":0,"cool":0},"Bkyy90O5D0FvI1_c1Nmayw":{"text":"Had dinner there last night January 7.  The cowboy steak was tough and sinewy.  I would no","useful":0,"cool":0},"tpULQkUqDtPuEdykjNwFDQ":{"text":"Marco and Adrien are the best. This place is beyond great. Met all of my expectatiins. Gre","useful":0,"cool":0},"S8rgd6Ctp5H5LcBUzcGAew":{"text":"Hands down! The best happy hour in NEW ORLEANS!! Yeah,  I said it...as an Elite yelper, I ","useful":8,"cool":3},"temDXIpvEdUBL6HUA4K1pg":{"text":"I'm so happy that Desi Vega's is still operating. I enjoy having date night here and the s","useful":0,"cool":0},"QVgTfj-8NlUsEQAAusaUmQ":{"text":"Enjoyed my time at Desi Vegas Steakhouse, everything seen here was ordered off the happy h","useful":2,"cool":1},"cYjbEVDTqVjhweXX7E_k9Q":{"text":"This was my first time dining at Desi Vega's and it definitely won't be my last. The entir","useful":1,"cool":1},"RcuDKLZEtLXVmPFns7a5Zg":{"text":"I wouldn't go there again. The food was fine (not spectacular) but no one wears masks, the","useful":0,"cool":0},"uJ2KFditELobIZKoqHV05A":{"text":"Great service, started a little off. Accustomed to valet opening door, if not for me at le","useful":1,"cool":0},"0_agnA_n7brXZLGpLfLiWw":{"text":"This place is AWESOME. They went above and beyond to save our Anniversary night because we","useful":0,"cool":0},"IuO21e_BK3FMQqKPmJ_ZSw":{"text":"Desi Vega's is an offshoot of Mr. John's Steakhouse (the #1 independent steakhouse in Nola","useful":1,"cool":0},"fRPmVTq9o07dY1OiSBdlsQ":{"text":"We had reservations for about a month and a half when we went and we were placed in the ba","useful":0,"cool":0},"_E_pJxo-ay_IStwUS_mlVw":{"text":"This place has a great vibe, great ambiance. Great selection in the menu and wonderful dri","useful":0,"cool":0},"e-hoYRyP04Sbc8r83nPJZQ":{"text":"One of the best birthday dinners I have ever had back in August 2021. I got the cowboy ste","useful":0,"cool":0},"bq6iUxd6Qq4Xc86aQ65K2g":{"text":"Been here 3 times and the service and food has been absolutely amazing. If your in Nola or","useful":0,"cool":0},"8ZIaeuSuGI8RdtrDtIVjJQ":{"text":"So my friend and I got to the bar at 6:35 and apparently \"happy hour food is only availabl","useful":1,"cool":0},"YNvYJXHRCDtWAzNmvvSKOQ":{"text":"Discrimination against black customers. This happened at their Metairie location but they ","useful":5,"cool":0},"rrub0gUn42Vfx7PnrhbZmw":{"text":"So apparently I haven't written a review for Desi Vegas yet even though I've eaten at this","useful":1,"cool":2},"WUfQLgXGU_NGHERqus389Q":{"text":"This was my first time at this restaurant, as well as my husband's. The food & drinks were","useful":0,"cool":0},"mjj7HSVebPiCgt7ku93Jug":{"text":"I read some great reviews about Desi Vega's from great food to excellent service. No hype ","useful":0,"cool":1},"xXm7qAK6HTQSSr4WWZVrTA":{"text":"Love their happy hour! The food and drink menu offers plenty of options that are fairly pr","useful":1,"cool":2},"zFW1iY_nRrH5mGV9Kp2dPQ":{"text":"We celebrated our anniversary here. My husband said it was the best steak hes ever had. Fo","useful":0,"cool":0},"-dtaBmXhm53H4h56EwIkxA":{"text":"Nice place. Great food. Line was long so we did not stay. Looked really nice. We will try ","useful":2,"cool":1},"1BDwhWyC81dvZt4SMtBIpA":{"text":"First let me just say I'm sorry for  Ky having photos. We unplugged for tonight's dinner t","useful":1,"cool":0},"qq1SyiI5HdljUxgTEmkn7A":{"text":"We had a late reservation. But then again, it shouldn't have mattered even if we were the ","useful":0,"cool":0},"g9wlNIKvcnk_EvI-X4-XZw":{"text":"I cannot say enough about how wonderful my experience was at this restaurant. I know I'm l","useful":2,"cool":0},"NWF20l6SbECyIbVfw920YQ":{"text":"Dined here to meet some coworkers who all work remote for different areas of our company f","useful":0,"cool":0},"wCUjadwMGv_uM-18IYomjg":{"text":"Ummm okay, I was walking down St. Charles just missing my business and then I saw a sign a","useful":1,"cool":1},"RG--9w_BXpOHyqq593e1eA":{"text":"Mannnn! When I found of Desi Vegas had a happy Hour I rushed over there.  Just like their ","useful":1,"cool":0},"IhcbPQty8FD1NM3uOpzTbA":{"text":"Best steak (hands down) I have ever had at a restaurant!\n\nCame to this restaurant for dinn","useful":5,"cool":3},"LtJy2V2mCvNpc4NjQCD_Ow":{"text":"Had no wait and waiter AJ was awesome!  Food was just ok.  No seasoning on the steak.  And","useful":0,"cool":0},"dkdJ79-DFroOWZZDO7300g":{"text":"This was a fantastic experience!  My husband and I dined here Thursday night with his boss","useful":0,"cool":0},"7GtUxGuRdS7qU4baOu473g":{"text":"Has to be one of the best steakhouses in New Orleans. Good staff, can be loud when busy. \n","useful":0,"cool":0},"TmiCGG8bKSDu6Xf3fBQPJA":{"text":"This place has become one of my favorite restaurants here in New orleans. We had a reserva","useful":2,"cool":1},"PyY3_wNG3MqGmw7nCqP-Sg":{"text":"This place is beautiful on the inside and they had dim purple lights. But my friends and I","useful":0,"cool":0},"T1YogboxwOE1Z4PpdzFqxg":{"text":"Somewhat underrated. Sorry we discovered this just a day before we left the hotel.\n\nWe had","useful":3,"cool":2},"HlYMkRfYstgCoLT3t29FHw":{"text":"This was our second time eating here. The service was excellent; both the main server and ","useful":2,"cool":0},"3waIlJ9HOFLtZCReJpTJ2w":{"text":"I used to swear by this place and now sadly, I have no intention of ever returning. The cu","useful":1,"cool":0}}