{"l67sphkj58ODPDe8nIOllw":{"text":"Horrible experience,  went off the 4* reviews, not even close. We had a man digging in the","useful":0,"cool":0},"9zt1f_Ybkrn8TDp8QQ_w9A":{"text":"We came here for the gumbo and it was not what we expected at all.  I don't think there we","useful":0,"cool":0},"QBAnOLzemwf59SYYIuLKyw":{"text":"A local gem. The boiled seafood not on the menus hanging from ceilings but rather on small","useful":1,"cool":0},"du0CejuBhLx6lGJ3VdyHoQ":{"text":"The fried food was horrible, it wasn't fried crispy enough. The seasoning was bland, and o","useful":0,"cool":0},"7naBbyN6yO0RH9GzfvkwSw":{"text":"Reasonably priced and BOMB.  We had crawfish, shrimp, and snow crab--would recommend them ","useful":0,"cool":1},"oJJgDj8B00dyATUgbQ0oZw":{"text":"Crawfish were fantastic, really amazing and unique flavor. Shrimp Po'Boy was pretty good a","useful":0,"cool":0},"nP-eMNlZf8cnwxDqnOnceQ":{"text":"Excellent! This has been the only place where I can truly say I got my money's worth.  All","useful":0,"cool":0},"VLMfKUq2388PsEYFsg9xzA":{"text":"Average price for crawfish and seafood plates. The restaurant itself is overall clean and ","useful":0,"cool":0},"YtHRyWB6cM6xAFyHWrEcyA":{"text":"My family loves this place. My grandma always comes here. We ordered 50lbs of crawfish, sh","useful":0,"cool":0},"84oEkz6xDvn2PAFYg4ASVQ":{"text":"Best cajun seafood we've ever had! Very fresh and delicious! There is always a long line b","useful":2,"cool":1},"drjl4Zs9-Au0P3H1T1lxBg":{"text":"Oh my Goodness!!! I got stationed here a few weeks ago due to being in the Army and this w","useful":0,"cool":0},"ZoAmufXfdt75OK_Do9ghZg":{"text":"Great recommendation from my Lyft driver. Absolutely the best crawfish that I have ever ea","useful":0,"cool":0},"i-opLW4YfqGUNFjIYGvDIA":{"text":"The best gumbo in town. Shrimp po boy is excellent as well.","useful":0,"cool":0},"0rO3Nd79rEtoAdnhQ7nwYg":{"text":"Thhhhhhheeeeeeeeeee BEST SEAFOOD IN NEW ORLEANS!! TRUST ME! THIS?! Is the place you wanna ","useful":0,"cool":0},"lHHea72OZ74O1lEZXktY5Q":{"text":"This place was really delicious - you can tell the seafood is extremely fresh and the qual","useful":0,"cool":0},"xgEAuY6qWZzZlIrsbtZqeg":{"text":"A classic Shrimp Po-Boy was at the top of our must-have eats during our trip to New Orlean","useful":3,"cool":1},"S2qMWJXP8EczkQD5lNA6_g":{"text":"Line was ridiculously long the entire time I was there. I waited 1 hour just to put my ord","useful":1,"cool":0},"38ASLphqxjB6IsOBpAuljA":{"text":"This seafood is super delicious! We had crab legs, medium shrimp, potatoes, and corn. The ","useful":1,"cool":0},"sbw2_7s1jYAWLTWf9wPGng":{"text":"Hidden gem!  My favorite meal in NOLA.  I knew I was at the right spot when all I saw were","useful":2,"cool":0},"Ft60NCG3_ZpuWmLhXmjyUQ":{"text":"Food: Great Crawfish! The seasoning is delicious, not too salty, not to spicy. I love it. ","useful":0,"cool":0},"8BS082VqDS_Jzd2EbIp_Wg":{"text":"The boils are spicy so beware!  But if you can take it.. boy this place delivers.  Go with","useful":3,"cool":0},"d9OVN_P3X1jYcngb8-Qgyg":{"text":"If you want authentic creole food in NOLA, this is the joint. Not pretty but clean, sketch","useful":1,"cool":0},"F6UqpkkWrQPzgxci4Ce3dg":{"text":"The restaurant had plenty of options at great prices. I only had the crawfish, sausage and","useful":0,"cool":0},"JtMrsTKzf4nzLu-PQfHBpA":{"text":"These people know how to cook seafood. We went balls to the wall and ordered the 1 lb of c","useful":2,"cool":0},"7qCW1SP9la-OnzpAA0eX4g":{"text":"So glad I went to where the locals eat. Like everyone says delicious food and inexpensive.","useful":0,"cool":0},"f-EKIoqcbphmIY3wtTY3fQ":{"text":"Seafood platters are a good deal. But get a fried turkey wing, you know for your\"health.\" ","useful":0,"cool":0},"j5pl_sNodNoeX-EUGCxUGw":{"text":"We asked several Uber drivers and locals where to get a good oyster po-boy and landed on t","useful":0,"cool":0},"2fCixjQ4iZZMBwh6CQjoSg":{"text":"We checked out this place based on all the excellent reviews on yelp. My bf was craving cr","useful":0,"cool":0},"n0YYRhhzANrw9kUy02igrw":{"text":"As a tourist and my first time in NOLA, I can't exactly claim to know anything about what ","useful":0,"cool":0},"HQorWFSDGBmNWhvd4ppvKg":{"text":"My first time! It was great! The line will be long but it is worth the wait!! We really en","useful":0,"cool":0},"L3haWkWdwVvgXV_o5Wqx_w":{"text":"Had 2lbs of boiled crawfish and a bowl of gumbo, both were amazing!  The locals were frien","useful":0,"cool":0},"q_RNGVzinNZpuLJtIUyY1A":{"text":"This place is an absolute gem.  Everything on the menu is locally sourced and fresh. Very ","useful":0,"cool":0},"1frEsGGqzu-PSDkNTyCd9Q":{"text":"We spent hours trying to figure out where this place was the a month ago... I found it thi","useful":0,"cool":0},"1X155iyp6l82wS2gDpMjKA":{"text":"At first I wasn't sure -- I'd went for the fried shrimp po-boy a few times and it always l","useful":1,"cool":0},"iKMGaZ9xHMLTIvUb66x71g":{"text":"only for the adventurers - all of these yelpers saying \" I want to go where Locals go\" - w","useful":0,"cool":0},"70-5oT6MX-gg8_dr-gReeg":{"text":"The best seafood I've ever had!!!! \n\nPROS: food is absolutely Delish! I'm actually angry t","useful":4,"cool":0},"DFkpx-wBiGo0KVJVDCcGuA":{"text":"Yes! This is the place to leave the tourist behind and sink your teeth into a shopping bag","useful":0,"cool":0},"Oj6qy-FCdjQRfxH5RmBDYw":{"text":"Why is this place not more talked about?? The food here is amazing! We only stopped here b","useful":0,"cool":0},"1l9DDQpZ2iU3zuedRZIFbA":{"text":"LOVE the snow crab legs and the boiled crawfish. The shrimp is also super solid. Prices fo","useful":0,"cool":0},"n35-dKxm84i82yDm6ndNLw":{"text":"Meh. Read the Yelp reviews and expected to grab six lbs of fresh amazing crawfish but the ","useful":0,"cool":0},"lSGXjq4CBFYyMHuTvhmPjw":{"text":"I love boiled crustacean. This place is kinda like Boiling Crab or Hot N' Juicy but with o","useful":0,"cool":0},"shtSUIPBL1_BPCRnhDIkuw":{"text":"Tried this place my first night in New Orleans it was about a 7 min lyft ride from our hot","useful":2,"cool":1},"IdyA-P5esjSbDbsZpC1yGg":{"text":"I've lived here for over a decade and don't think I ever went to a restaurant to get boile","useful":0,"cool":0},"0c1g0wm02Sn8aXdPI6oimQ":{"text":"I had the crawfish boudin and the fried shrimp Po-Boy. Now I didn't like that the spicynes","useful":0,"cool":0},"NF51DD2o2eHdbxUAaVmRag":{"text":"Ok I'm going to come out and say what the ppl with low stars didn't. This place is hood! L","useful":1,"cool":0},"ykTVRYouyIpMRZoJJuWRkw":{"text":"Came to NOLA for the best seafood! So of course we asked a local that worked valet at our ","useful":1,"cool":1},"2meVmTaqZsF4p2HAexQcTg":{"text":"This is the place to be. They even have Chinese food. The crawfish tasted like they put an","useful":0,"cool":0},"p0kObgbTxw5qR2yR_Bd22g":{"text":"Like everyone has stated, no frills, no ambiance, just plain good food in a plastic bag an","useful":0,"cool":0},"5cBCJdofHI_5ZETWVlNkEQ":{"text":"This place lives up to the hype. A must visit for any visitor to NOLA. Best crawfish in to","useful":0,"cool":0},"PNIlTm3OOC-n9Wssx-iANg":{"text":"cheap af, and delicious afffffffff, seafoooooooooood","useful":0,"cool":0},"nIKsw9Yl-wPw0srEY-l_rA":{"text":"All you need to know:\n1) there's like 3 different kinds of lines in this place so look up ","useful":0,"cool":0},"QV04S1sZ6dryIFW5zFEgBA":{"text":"The employees here were not friendly at all. A smile would go a long way. The crawfish was","useful":0,"cool":0},"JJxzJyhAidgZd_CA2pg1Tg":{"text":"It just went down and it was so delicious everything from the Crawfish to the shrimp to th","useful":0,"cool":0},"DmtU-qwebiy6C7eTf3_n1g":{"text":"We loved this place. We found it with the help of Yelp. Food was fresh and delicious and t","useful":0,"cool":0},"3IQRWVORUgWGbJ7faDveHw":{"text":"A local told me about this place and man o' man the food is so freaking good! Everything h","useful":2,"cool":3},"5Js5ra2qDCaOZZIJMQCPMA":{"text":"This place is pretty gross. Maybe it's the expansive tile floors that possibly get hosed d","useful":1,"cool":0},"6ETseE096l0Cf9YrA8-vag":{"text":"1st Visit to Cajun Seafood.\n\nHad boiled fresh crawfish (1lb), large shrimp 0.5lbs), and a ","useful":1,"cool":0},"AJbVrozuA4zLQPjaN7hhIQ":{"text":"OMG, I just discovered this place on my last trip to NOLA, I am beyond impressed with the ","useful":1,"cool":0},"TMfFYQL3zorH-Dy4THoaWA":{"text":"Came to grab quick dinner to go.  We ordered snow crabs, shrimps, sausage, corn, and soft ","useful":0,"cool":0},"1TauHGvgRwQxqlQIo_7UPg":{"text":"The shrimp poe boys are to die for! The chicken wings are amazing but be prepared it stand","useful":0,"cool":0},"ZhbQWy6Eq9deYYPAf5jWfA":{"text":"I absolutely LOVE this joint. It's in the 'hood but I didn't care because the food is bomb","useful":4,"cool":3},"pQjoyoSlgcqSD8Bg7SCXCw":{"text":"This food is literally some of the best food ive ever tasted, visiting from California thi","useful":0,"cool":0},"DFfETdIsW2_gqeCuX3Z-dw":{"text":"I gave this place three stars just for the food alone. But we all know the restaurant expe","useful":0,"cool":0},"kZmLGDuwYVafH8K94n3mZA":{"text":"Crawfish in the Quarter was outrageous. Ask a local for the best place to get good crawfis","useful":0,"cool":0},"Mb25ylbXUrI8F0krQJqjwg":{"text":"Good flavor and taste.  However, most of the shrimp were not fresh and they were a bitch t","useful":1,"cool":0},"ikSw8Ob91MGEoOYnro32tw":{"text":"Unassuming place in the seventh. Great prices for a lot of delicious food. Crawfish pies, ","useful":0,"cool":0},"opjjzeyEziliKc2jfAM-hA":{"text":"We loved it! First time here and we are out of towners! It seems like a local spot. Doesn'","useful":0,"cool":0},"nBDmwagfqNW7sAuELZ8alQ":{"text":"This being my first time in New Orleans, I wanted to try the boiled new orleans crawfish t","useful":1,"cool":0},"ul_VWbbCjCREQnqBEg8CMQ":{"text":"Pros\nFood is delicious I ordered the snow crab Dungeness crab and crawfish and shrimp.. Th","useful":0,"cool":0},"-PBPHdnbQzz3WD264FpLNg":{"text":"Was looking for a good crawfish place and came to this one thanks to fellow Yelpers.  This","useful":0,"cool":0},"7i8c2W6nE0tsdKii4JcmHw":{"text":"Crawfish, turkey neck, meat pie, Crawfish pie, potato sausage. Yum Yum Yum Yum Yum Yum","useful":0,"cool":0},"CKp_jGfBAzDf9ngmWK2xow":{"text":"The food here is kind of... well..... tooooo causal. Just a bunch of seafood........then t","useful":0,"cool":0},"3ykM3DI-UYRKrnhNnFWNvA":{"text":"The five stars is for the amazing Cajun sauce. It was just so perfectly flavorful and spic","useful":1,"cool":1},"gm66gfaZCX5NIiU12s5b1Q":{"text":"Fabulous food and not expensive (especially compared to the rest of Nola). \nThe food comes","useful":1,"cool":0},"2iOeF3Jsr6gz8l_OvGn_HQ":{"text":"Food was ok...place got packed quick! Had the catfish and fried rice plate. Came with a pi","useful":0,"cool":0},"xrjngktiiOrwTTnNU9Vm3g":{"text":"So much hype from this place. Coming from Houston I heard a lot of positive things from th","useful":3,"cool":0},"3NJQCJX7EoXgrT5rxhZoGQ":{"text":"Authentic Nola experience\nExcellent local food. Delicious flavors.\nYummy crawfish!!!!","useful":1,"cool":0},"UdwuB6Xpt3yDw529CfrlZw":{"text":"Take the road less travelled and venture out to Treme for a bevy of choices in Cajun seafo","useful":0,"cool":0},"WEOnXF-93Qo-9Q8-sCzRig":{"text":"Based on the below reviews I thought I'd stop by to check out the seafood.  Despite the po","useful":2,"cool":0},"pzG7jls_OrtWcX85e37-Dw":{"text":"A New Orleans must try. Don't expect a fancy venue but you can definitely expect delicious","useful":0,"cool":0},"NhZQHwvV2YO4dw0zWiQ6Wg":{"text":"Never really been anywhere like this before. We waited in line for 40 minutes to order boi","useful":0,"cool":1},"LeVdO0o-1nK_TUgu8Wb8Hw":{"text":"The crawfish was spicy just like I like it, but they put sugar in their boil. It is a tast","useful":1,"cool":1},"aTxbuIpJb-cwzc5jYI-vqg":{"text":"Best crawfish I've ever had! Delicious, easy to peel and eat right in the heart of Treme n","useful":0,"cool":0},"1jjUW5NcdxevIYb0XGG3WA":{"text":"Excellent! Ok..so let me say this, for those of you who are mot familiar with the HOOD.  T","useful":0,"cool":0},"oserPpW-Jsr0DvHWlb64OQ":{"text":"I visited this little take-out restaurant, when I was visiting relatives in New Orleans, i","useful":0,"cool":0},"l3gzzENEHv_wLTq9qJlqNQ":{"text":"I was recommended this spot by my friend who is a local and you just can't go wrong. Their","useful":0,"cool":0},"S7VZVifzOz_jfJZxv1izrw":{"text":"Cheap, quick and flavorful seafood. We got crawfish, shrimp, corn and sausage. Didn't care","useful":0,"cool":1},"frqkYNkdNgdb8yh-KWzOjg":{"text":"No. 1 recommendation from locals for crawfish boil was hands down was the best overall mea","useful":1,"cool":0},"_xaYb-eFSLcAeoxPMX1g9w":{"text":"I liked their potato and corn more than I liked their crawfish and shrimp. I guess the nat","useful":0,"cool":0},"GePgwn2kmCB5_Wt48OheOQ":{"text":"I've been coming here as a child and the food is always great. The crawfish are definitely","useful":0,"cool":1},"56UWibKgzUKMhaA79ABFEg":{"text":"The ability to gauge how much crawfish you can put away in terms of pounds is key.  We mad","useful":5,"cool":0},"Illy8rshex_pRYk0RJzELA":{"text":"So for my last meal in nola, i took the chance of coming to cajun seafood.  For a tourist,","useful":11,"cool":2},"bDZephjuChFMem8H2FVCTw":{"text":"Great place for Cajun Food! Please try the Snowcrabs, sauteed crabs, crawfish, fried rice ","useful":0,"cool":0},"rg2A99715QnklrC4X3z5oQ":{"text":"Best. Meal. Of. The. Trip.\n\nI came to Cajun seafood on the recommendation of my workmate a","useful":0,"cool":0},"K_hMYGi3dJ8dnYbVsEXv7A":{"text":"BEST CRAWFISH. Affordable and yummy. We got a pound of crawfish, pound of snow crab legs, ","useful":0,"cool":0},"KUhzdB5keV4wzEDL3Itx7w":{"text":"Wow. Food is amazing and the prices are great. We pretty much tried everything. DO NOT pas","useful":1,"cool":0},"hBCsj6FbGy0Pr6FtDetX5A":{"text":"I am your fellow yelper that is on her quest to find the best crawfish on earth. I say tha","useful":0,"cool":0},"ZLSon9p-RfQIh8sQ0pArPQ":{"text":"Cheap but great quality. A little bit far away from where I stayed though... So not locate","useful":0,"cool":0},"Be84pQxYFVUJIqgtxZ-Wkw":{"text":"This place is a trip! It looks like a cross between a deli and a roadside cantina, but it ","useful":2,"cool":0},"jPGi55mltiLh12kypV10zQ":{"text":"The food and service was amazing. Probably the best seafood I have ever had. Maybe I was j","useful":0,"cool":0},"rAlhBSryadg5BDaaz_Mxsw":{"text":"I'm from Los Angeles and we found this spot on Yelp. As we was in line a guy who worked he","useful":0,"cool":0},"3AXxZmZsDBbmR1q9t_yRcQ":{"text":"Absolutely delicious. Frills here are pretty minimal. Great boiled crawfish, fried catfish","useful":1,"cool":0},"bmZ8Z8frkdt6dMeFST8N9g":{"text":"Don't let the limited parking and sparse surroundings dismay you.  This place is a MUST GO","useful":0,"cool":0},"59lILzqyOVHXQJfn-P3OUA":{"text":"Literally a ghetto, beat-up old store selling a lot of shellfish from their crawfish boil.","useful":1,"cool":0},"gO2DRCk5iIPV-FJYmOqICQ":{"text":"We had to get that Cajun Crab dream fulfilled...since we loved The Boiling Crab in LA. We ","useful":0,"cool":0},"mH00R5oYFyvgIi6DsRGspg":{"text":"If you're looking for ambience I would stick to the French Quarter or one of the other mor","useful":0,"cool":0},"c2GGcBR85zBAQBqixRcagQ":{"text":"I was staying in the French Quarter. Being a New Yorker in Louisiana,  I just had to go fo","useful":15,"cool":7},"lbW7M1sMVuaxggX-j2ihuA":{"text":"I didn't eat here but went inside with my personal driver/tour guide who order His food. T","useful":0,"cool":0},"PxFj1h1L1rSMJEm68CF0tg":{"text":"From San Antonio so I've only had Cajun food at our restaurants but this place is everythi","useful":0,"cool":0},"wZwaM8Wn58mmI6SHPOvfiA":{"text":"I will come here again, next time I visit New Orleans. The line was long out the door, so ","useful":1,"cool":1},"f9aNsC6WthjLqmEB1PxtvA":{"text":"We found this place after we couldnt bear the wait at Willie Maes Scotch house.  Its a few","useful":2,"cool":2},"VaV4C7q9bnUV4CLrfmJUzQ":{"text":"So been trolling yelp for years and never really written a review so here goes. \n\nNow bein","useful":0,"cool":0},"p9Kk-nTL35xRGmvYBz-_3Q":{"text":"I found this place by searching Yelp and I am so glad I did. We went back to back days whi","useful":0,"cool":0},"Hu22MkkrVBKyGFsMaxveAg":{"text":"This is a seafood joint! Don't come here for the dry chicken. The crawfish, corn, potatoes","useful":0,"cool":0},"Hy1Jt6FfuEqLUhFt08JZ5w":{"text":"Great hole in a wall restaurant. Definitely a locals choice for food, and very cheap.","useful":0,"cool":0},"o3CX1e92SS5d9aECbiY-Ew":{"text":"Hole in the wall place. I like their gumbo more than the one I tried in other restaurant. ","useful":0,"cool":0},"CfoziKHHjInU2vxzztIR_A":{"text":"Incredible food, had gumbo and a po-boy. Don't know what else to say, just really good.","useful":0,"cool":0},"HHPQoD8Z4j25nLtlDwGr8A":{"text":"This place probably doesn't see many tourists, which is a shame because the food is fantas","useful":0,"cool":0},"lqDcE9jGRo0jVw0a3dZgHw":{"text":"So, it's after six, and you can't go to Big _________. What's a girl to do?\nHead to Cajun ","useful":4,"cool":3},"k05vhEPFk6r5Q50V78BGEQ":{"text":"I absolutely love the boiled shrimp and crawfish. Also the shrimp poboys, fried turkey win","useful":0,"cool":0},"Ao71YVhpARadtJR-a3PTrQ":{"text":"Guess we can't leave New Orleans without enjoying some crawfish. By the power of Yelp and ","useful":0,"cool":0},"DFqxix770wMSvAwZbmL4Rw":{"text":"I recently had my first visit to New Orleans and I visited your established twice and was ","useful":1,"cool":0},"vmeNUo8fEKKHYhQG7iyF2A":{"text":"**For those tourists, I will save you time & hassle, just skip this place & try different ","useful":1,"cool":1},"WrhNGrRsOhktDnfC5-T7Fg":{"text":"Came here on a visit to NOLA in search of some Crawfish boil. Best crawfish we had while i","useful":0,"cool":0},"567-gdvy8Rea0oGWhrNUFw":{"text":"2 lbs of crawfish, 1/2 lb shrimp, 1 large blue crab (they have XXL blue crab), 1 turkey ne","useful":0,"cool":0},"3RW1FlfM1L7E4mVqiueg9g":{"text":"I'll be brief on this one: \n\ncrawfish - juicy, succulent, and finger-licking good with jus","useful":0,"cool":0},"2cwhUSq5JWpCzVl145ipkw":{"text":"Gumbo was hearty and one of the best meat pies I've ever had! Service was fast and friendl","useful":0,"cool":0},"-zwU2jLvrYZc2jgAsWXgwg":{"text":"-Good old Cajun food at a small price . \n-Expect the line to be about 15 mins longs \n-expe","useful":0,"cool":0},"trN9CJs7ou34d4G87dBDFg":{"text":"We went to New Orleans for crawfish, and boy, did we get some.  Four pounds of crawfish wo","useful":2,"cool":1},"VKXNKO9t85Cd3xVSpqAs1A":{"text":"My absolute favorite crawfish and crabs spot. I buy fresh fish, shrimp, and gumbo crabs fr","useful":2,"cool":2},"y9DUzl3ICREyO7BrAFuA-w":{"text":"This was my first time having crawfish in the Bayou City and it may be my last. While I am","useful":0,"cool":0},"6xrRyjvlrM-lHTXIoIDTFw":{"text":"A surprise for my New Orlean visit. It was not the season for crawfish so I didn't got to ","useful":0,"cool":0},"PtvLy907sjmCz1PHf1MIEg":{"text":"Boiled Shrimp and any seafood all started in New Orleans. We were able to visit a Vietname","useful":2,"cool":0},"3rEjJeSUp6Ge28CVcuTGDg":{"text":"Waiting in line for 15 minutes order the shrimp po-boy bread was hard... so hard it cut th","useful":0,"cool":0},"EZNEbBuDMpSFiW7xzkSKjQ":{"text":"First meal after arriving to NOLA I craved for some local seafood, so we took an uber ther","useful":0,"cool":0},"YIZ_PYMfzVjq5M6Qd6_ktw":{"text":"One of the best roast beef poboys I have had in the city so far, and I have been here for ","useful":0,"cool":0},"ujxEVo99ZuC7FYo5C6dlwA":{"text":"This is my first stop whenever arriving to New Orleans because it has the some of the best","useful":0,"cool":0},"hq_hvXVmKlUTIiFeW3f0aQ":{"text":"5 stars strictly for the clientele and the awesome conversations going on around me, inclu","useful":2,"cool":3},"j6Z2S43GvB4EQI-VuWr4eQ":{"text":"This is a quick service, takeout spot with boiled seafood, gumbo, crawfish pies (OMG), bou","useful":0,"cool":0},"k9oWjilDd1IJF7H3g-PNLA":{"text":"My friends and I are from Houston, TX and we were expecting great tasting food! We were di","useful":2,"cool":0},"5aUDWIXDCGoq9jEVXg5u3Q":{"text":"This was a very surprise find on our 7th trip to New Orleans. We are a little tired of the","useful":0,"cool":0},"hJ4x8NbfTTFwgQZGI61pDQ":{"text":"Simple and delicious.  A little hole in the wall place but this was exactly what we were l","useful":0,"cool":0},"Mbj2FQmAbZ590M5TQAEJCQ":{"text":"If from here on out I ever make a bad decision it will be okay because tonight I made the ","useful":0,"cool":0},"quN5oIx1oPY_g4d_Dgmr0g":{"text":"We missed this place when we first arrived to NOLA as they closed at 9:00 PM.  \n\nWe came b","useful":0,"cool":0},"agh1soZxa9JmGqh4qfD-ng":{"text":"Great tasting food!!! And very courteous people working here!! Shrimp fried rice and the f","useful":0,"cool":0},"C0fO0FFSEWe_jnkJXnLyxg":{"text":"Came to NOLA for a weekend, tried a bunch of different spots for Cajun food, and this one ","useful":0,"cool":0},"sLFnG3i_YCmHQkuhYYXE7Q":{"text":"This place is a local gem!!  Yea its not a fancy place, but if you want that and pay 5x th","useful":2,"cool":3},"tIhVeGaSI7RFpoK5CkvqtA":{"text":"This restaurant is simple and down to the point. If your looking for delicious and spicy b","useful":0,"cool":0},"wI17A98U4p4JuqdCEbXleQ":{"text":"I really enjoyed the food here. Catfish was fresh with great breading as well as the shrim","useful":0,"cool":1},"WybkKJgd06_OTmZokEe3jg":{"text":"We always make a plan to stop here when in town. Delicious and good prices.  Several peopl","useful":0,"cool":0},"3S3FAwZ9nmcjriIMZiz6_A":{"text":"If I could give it NO STARS I would!!! This spot was highly recommended by locals so that'","useful":1,"cool":1},"U1UoZwZtVVMRb5csuKYDlg":{"text":"Great food, Great price! We order take out after reading other reviews regarding \"insanita","useful":0,"cool":0},"tAUGi1i5-UiTbIt7-5Ykyw":{"text":"I'm a little confused at the high star rating. I consider myself not to be a picky person,","useful":0,"cool":0},"BsSna2OHoKDPsc7N1A7fxg":{"text":"I came here Saturday when I got to New Orleans I got the crawfish, crab legs, and potatoes","useful":0,"cool":0},"NzZqrN6i1_Ayaz3HzjrLxA":{"text":"straight to this place off the plane.  Shrimp po boy was soooo yummy  and the small is  bi","useful":0,"cool":0},"YFFAw7I00n_2tU8sGY1Ucw":{"text":"Great food, good prices, and quick service!!! Will definitely be coming here next time I'm","useful":0,"cool":0},"Kix_TOFOXMfVC_Nu-h1_RQ":{"text":"nothin like eatin a shrimp poboy & shrimp fried rice whilst cruisin i10 !!!\ngood ol yelp..","useful":4,"cool":4},"oPwklm-Ql8CICHpJZeuYrw":{"text":"I was told about this place from some locals working at a restaurant on Bourbon Street.  T","useful":0,"cool":0},"gn_hx26lagFatdMlU6f4yw":{"text":"The best crab legs in NOLA! Was here while visiting for a concert. The customer service wa","useful":0,"cool":0},"0tgzbGX2_w9rJQuS9S9mcw":{"text":"I went for the first time yesterday, and when I say the food was fantastic I mean it.  I O","useful":0,"cool":0},"nYDl3VMsH7QCz6nax_7KeA":{"text":"The best crawfish I have had in my life! You can get it boiled or fried as well as pick up","useful":0,"cool":0},"UFEj044yzTdG2DvWCByC2Q":{"text":"Nice friendly staff here.  It's a bit confusing at first but you order with the guys up at","useful":0,"cool":0},"EMjhUsZm-YDD0SWUtcnzLw":{"text":"Must go!! Real! & Authentic! Oh and that OoeyGooey cake!! \nYou can visit the tourist spots","useful":0,"cool":0},"4HvGcdGrJ--85pP7o4kRZQ":{"text":"A local told me to try this place and I'm glad I did! Hey His is now a MUST GO TO when I'm","useful":0,"cool":0},"2nwNonGPIB0_qCwr0dn3jg":{"text":"Louisiana crawfish is all about the boil. And Cajun Seafood does it right. I have probably","useful":0,"cool":0},"aTa6Xc-CCaKE1N0nR0DQ7A":{"text":"This place is so affordable and so good! We ordered 2 lbs of crawfish, 1 lb of Dungeness c","useful":0,"cool":0},"h4hunED-wRDGloLQxBtU-g":{"text":"This place is where you come while visiting and want a break from the touristy part of New","useful":0,"cool":0},"6kQrQ38ES7VTuPnv_PQT7g":{"text":"Not a touristy place. If you want authentic crawfish, this is your best stop Grab lots of ","useful":0,"cool":0},"bMVeuhHN-5BFY7kOz0PgAw":{"text":"Holy mother of god!! Came here with my girlfriends during our NOLA vacation and it was THE","useful":0,"cool":0},"7EijfBDNLAoPH6-AdBixMg":{"text":"All I can say is yum .. off the beaten path a little but well worth the trip. We got 1.5 l","useful":1,"cool":1},"OkDuwkY1m9wQPaykbfFaRQ":{"text":"You want authentic Cajun seafood????? Here you go. Not some pretentious tourist trap. Come","useful":0,"cool":0},"AFyys2SwfjnzFvbX95I6pg":{"text":"I love this place... It's a bit dingy but what do you expect from a grab and go seafood sh","useful":5,"cool":3},"Hj5vVfOaakQ3aqLiVcLr9g":{"text":"Ordered 1 lb of fairy small to average sized crawfish, 1 lb of ex-large shrimp, 2 pieces o","useful":0,"cool":0},"sgrGik4cLpskGWbvZyAXCg":{"text":"We were in town for the weekend I just love this place. The wings and shrimp fried rice ar","useful":0,"cool":0},"4rB6Ed0ZBaAADmQl0t2bZg":{"text":"The seafood was very delicious: The crawfish, the shrimp, the sausage, the snow crabs, the","useful":0,"cool":0},"F2vheOXRFNqmSdMO7LTriA":{"text":"If you're looking for a spot with a cool atmosphere- this isn't the place. BUT if you're l","useful":0,"cool":0},"YeygYebdHlwvihzN8r-Fmg":{"text":"This was the highlight of our trip food wise. We are always craving Boiling Crab after lea","useful":1,"cool":1},"GUJQs43UCn9PX0jsOXlIxQ":{"text":"It's a pretty cool place where you get cooked food and fresh seafood. If I lived locally, ","useful":0,"cool":0},"WSvv7XdDAhxcr_2MNf01Zg":{"text":"Los cangrejos y los cangrejos de Rio muy buenos, aún que picantes (casi no puedo comerlos)","useful":0,"cool":0},"UsmJV9WTTJjBnldE22Fz5Q":{"text":"The establishment is a cafeteria-style place where you order and pay for your food at the ","useful":2,"cool":0},"S9AwiL5799C1-P4mvTueWQ":{"text":"Oh man coming back to california today and still can't forget about the gumbo, boil crabs ","useful":1,"cool":0},"mCcl23vc3P3oBORmtaA01w":{"text":"Wow the selections!  Lots to choose from.  Beautiful patrons that come here.  My only grip","useful":0,"cool":0},"ZGMxNPGlV4EdqOCVfOUvcQ":{"text":"Once again the food was good. Had a 12 inch catfish poboy for only $7.99","useful":0,"cool":0},"yKzPJfRRdswcbQCLEg3_fQ":{"text":"I'm not completely sure where to start with this spot... If you want to feel like a local,","useful":0,"cool":0},"HtRkxbcsJgIlXPgj9z-YrQ":{"text":"If you're visiting NOLA, definitely stop by! It's outside of the french quarter, so you'll","useful":1,"cool":0},"-LMnmIg26-1jm6OrWwJUsQ":{"text":"Had the lo mein, burped it up all day, got home and up it came. In for a great night. Its ","useful":0,"cool":0},"_bUH82vgdj_B04uWwgy-jA":{"text":"A hidden Gem! Great food for reasonable prices, will definitely come back soon  Try the cr","useful":0,"cool":0},"jpTXQsbRzlaDJKiuXOfGVw":{"text":"HIGHLY RECOMMEND. \n\nAside from the friendly crowd the craw is where it's at. Once you're d","useful":0,"cool":0},"dx0jdzgNFvT89SN6MEC6BA":{"text":"Wasn't into boiled seafood.. not what im used to.. but baby let me tell u something.. some","useful":0,"cool":0},"82JGWOWFRDbaRhIAAfV2Gg":{"text":"Never eat such good food for so low price. Had a lot. However, it is located in a looks-un","useful":0,"cool":0},"VSWaUL9KtziVqPXc-TPz6A":{"text":"First place I hit once we arrived in The Big Easy! I can't explain the way I feel about th","useful":0,"cool":0},"sJ8olkmbO2oHvyDS5sPR4A":{"text":"though crawfish season was over - my group was desperate for crawfish before we left NOLA.","useful":1,"cool":0},"loTmJLL3h5qLaNdc0e6s4A":{"text":"Crawfish is a must, at least 1lb per person!! Blue crab, potato and turkey neck are pretty","useful":0,"cool":0},"ZcNDjk5fj9Ayr0E2NeXKGw":{"text":"So I'm talking to some tourists in Washington Park, they asked me about gumbo recommendati","useful":11,"cool":10},"MtDPrEWibO-LLMpDijC30Q":{"text":"Super fresh crawfish,boiled in live . You can really tested seafood sweetness.","useful":0,"cool":0},"L8sGAm4_Qjx_d1VtQ6OUSQ":{"text":"[This review actually relates to the Broad Street location of Cajun Seafood.!]\n\nOn a recen","useful":0,"cool":0},"-riNLfpHxzjLOEmoqYj7uw":{"text":"Not an exaggerated review on yelp for this place...went looking for crawfish...found them ","useful":0,"cool":0},"7Cnmalk4Izuu27-zka7APA":{"text":"Was in NOLA for Mardi Gras and a local told me to try out this spot. It may not be the nic","useful":0,"cool":0},"PxfcY5jNIUm2BAKaszsnkw":{"text":"I had been afraid to even touch crawfish lol for years they look like bugs to me. I been l","useful":0,"cool":0},"m8-brh11KceEXd-BneJyCw":{"text":"Beat seafood on the planet. The gumbo, the crawfish, the crab legs, the corn on the cob, t","useful":0,"cool":0},"G8sm6FZdexTIurdZDtxiFw":{"text":"Now if you want FRESH and DELICIOUS seafood broil... This the place. The place was packed.","useful":0,"cool":0},"UOxEEVwJg1A3uVbigRwjuw":{"text":"I'm not even from New Orleans but I come here more often than I'd like to admit! I go to H","useful":3,"cool":1},"3FX1z8XQJ4nmrOIU2rz8Yg":{"text":"Okay this place definitely caught me by surprise. It was a little further out of French Qu","useful":0,"cool":0},"Tf2mSvN2sqOiVTrVcIFzkA":{"text":"I'm probably going to be very unpopular for giving this beloved place 2 stars.\n\nI'm Asian ","useful":1,"cool":2},"fj4wSPmNClV819bh65JfaA":{"text":"The best seafood in all of New Orleans. This is another must visit. There are no bells and","useful":2,"cool":0},"JTxAcccZLw3iJ5r351uaDA":{"text":"We stopped by to have lunch. We ordered the crawfish, snow crab,turkey neck, sausage and f","useful":0,"cool":0},"q3SCMaYVFe44PcS7lOXAdA":{"text":"Just over a year later I'm back in Nola and the first stop is my shrimp po boy. It gets Me","useful":0,"cool":0},"5PeU1PaTtUEIG1CXIRhB9Q":{"text":"Cool so here I am craving crab boil, found this place & caught a lyft here. Arrived when t","useful":0,"cool":0},"tvjLrI3ZOZphYbljK7kwpA":{"text":"This place is fire I don't know what more I can say. I mean the wait time is crazy as hell","useful":0,"cool":0},"Um7ZxhNihVnj71qShJUgHg":{"text":"Maaaaaan! The crab legs and shrimp are BETTER than MAKE UP SEX! No lie!!! I would give it ","useful":0,"cool":0},"Bzl506z9Jhd3tChS7jid0A":{"text":"I came back since my first experience was great; however, the place has changed. I had the","useful":0,"cool":0},"B3TXfAjnIy5t9jtNlTgvkA":{"text":"Ok, so if you ever does go to Cajun Seafood, you might be in for a little cultural shock, ","useful":1,"cool":1},"yknStE_ym5ZVce9mnJsiyQ":{"text":"This place doesn't look like much from the outside, but the parking lot seemed to be full ","useful":0,"cool":0},"nhekmOMLE1GzFGCAxf0Qcw":{"text":"That shrimp po' boy could be on the seasonal menu at McDonald's, and I give that as a firm","useful":2,"cool":1},"1YVavMrilXs6YEPOB_b01A":{"text":"Very legitimate, down and dirty Cajun food. Run by some Vietnamese folk so you know it's t","useful":0,"cool":0},"jKCiOauAMP-t13ANFkZ75w":{"text":"2nd time back while visting NO. The drive wherever you are at is so worth. Jumbo boiled sh","useful":1,"cool":0},"9VkUyjDJVXGzCsHJaQNAMw":{"text":"Get your food to go. Staff was friendly. You may be accosted by a man after you refuse to ","useful":0,"cool":0},"ibO0IaGv9KsioPoaQbEULw":{"text":"Some friends of mine, who are locals, dragged me here because they wanted Po Boys. I'm not","useful":0,"cool":0},"c9_jlbs-halkyM6mEuxx_Q":{"text":"This place is a must go to whenever I'm in town! They have the best gumbo and turkey neck ","useful":0,"cool":0},"Izn32XB2E5yEnd0INi8u_A":{"text":"Ok so this is a no frills establishment. So my score is not based on aesthetics, customer ","useful":2,"cool":0},"Wf-v3RLcWN3vMZrSlPIvEQ":{"text":"I had high expectations coming in, but none were met. The seafood is prepared in advance s","useful":1,"cool":1},"72NvnepBVcioffIu-Gc8ZA":{"text":"A great place to eat crawfish and see and be seen. \n\nThis is my favorite crawfish to buy a","useful":0,"cool":2},"ei_iEONeJ3k0tuPz3oZLGQ":{"text":"Food is delicious, price is good. Not a fine diner sitting restaurant, but it's a good fam","useful":0,"cool":0},"pLxxcjqh75jryJIRqFKGyA":{"text":"Met my every expectation of a boil in NOLA!\n\nI love crawfish and coming from the Bay Area,","useful":1,"cool":0},"va2zx45npF5obweMkjB54w":{"text":"HOLY SPICES BATMAN!!! \n\nBeing a NOLA gal I have never had to take a break from eating craw","useful":3,"cool":1},"AV8IJVr6nkLiWNbDd7lJcg":{"text":"Service was terrible tried to get a refund on some ammonia smelled shrimp and the service ","useful":0,"cool":0},"gutQPXnGq9WpfI6r7iZBFQ":{"text":"Best food I've had in New Orleans! The food is beyond amazing! If you are ever in New Orle","useful":0,"cool":0},"x96u7RFU4Vd4TCUct9D3mQ":{"text":"Not a big fan of this place it's like a seafood fast food market, The crawfish was definit","useful":0,"cool":0},"d_-cR71XPEe-FnU0IAcWow":{"text":"best cajun in nola\n\nbest prices\n\ntourists....show respect....stay in the quarter if you do","useful":0,"cool":0},"XMe1PrY80eUp7Q1IvaScIA":{"text":"I think I overhyped myself that's why I was so disappointed. Ambiance was okay. You wait i","useful":2,"cool":2},"jiWWcZp7N0fObZfSaD0yew":{"text":"Absolutely the best fried chicken wings and boiled crawfish.  The line was to the door but","useful":0,"cool":0},"MOAW-j2wtRtVImY7ToIidg":{"text":"Sooooo soooo good. For a casual meal, I can't recommend this place enough. There are a ton","useful":2,"cool":0},"MEhRDDI7P3jLUejIt-Jupg":{"text":"This place is delicious! I gave it 4 stars only because we were from out of town and no wo","useful":0,"cool":0},"zrD3SBeLsXt0sdLTKSQJRA":{"text":"We thought the place was a bit too 'industrial' looking for our tastes.  Big open area, a ","useful":1,"cool":1},"8GqsPqQ3HrchbWiyNMQpQg":{"text":"Coming from out of state and also coming in 15 mins before they closed we knew we were exp","useful":1,"cool":1},"48IwtHgqQv86NNoWD8JsyQ":{"text":"Affordable price and yummy food. The pig feet were very delicious, and so as the jumbo shr","useful":1,"cool":0},"cL1pwcUwkDQBzpuyTBdC1w":{"text":"i looooovvvvveee this place as a new orleans native this is one of the best places in the ","useful":0,"cool":0},"mRBUrtP-1r9oeqqjuCgUgQ":{"text":"Great food. I had the gumbo with no pork. Lately that's been hard to find sense most gumbo","useful":0,"cool":0},"0mtOdP-0yy846FG9rxVFgw":{"text":"Gumbo. Great flavor.  The best I've had.    fried turkey wings were so tender and amazing ","useful":0,"cool":0},"oQEVJ7uRS6oTP8xXErGHtA":{"text":"If you're coming here from the Bay Area, the seafood definitely is not the same as a Boili","useful":0,"cool":0},"nUmsf9L0OTY6hg_A7PNxNQ":{"text":"Great quality seafood for reasonable price. I got one pound of crab legs a half pound of c","useful":0,"cool":0},"MwKKdXDgeJwHxsh-4XmalA":{"text":"It was so good. We were in town for just a week and we made 2 visits during that time; the","useful":2,"cool":0},"u6MD5Q2d_BK-mv6scEOxIg":{"text":"This is where the folks who LIVE in New Orleans go to get their takeout. It's nothing fanc","useful":0,"cool":0},"YlKNR8HW1MBZhokY4awS4A":{"text":"Oh well.  Live and learn.  First, the good.  This is a great place to buy fresh seafood to","useful":0,"cool":0},"Xh0bGV4AJP3K1UpbxbuzXw":{"text":"Visiting from CA; GREAT crab legs! So much flavor!! We also got the gumbo and potato salad","useful":0,"cool":0},"5xpLWwE_I-IGjPQcgloPOQ":{"text":"1. Upon first glance while walking in you think, \"ok this looks like a fish market.\" Looks","useful":1,"cool":0},"r9LV3Kvbw-A9Hz0-N4WHyg":{"text":"Omg! Our valet person recommended this local place and it did not disappoint. It's an Asia","useful":2,"cool":3},"9xg0K639IiceOEJPEh7ejg":{"text":"This place was recommended to me by a local during my trip to new Orleans. I had the fried","useful":0,"cool":0},"Jbh_LnB8r3HhauXWRSLfZA":{"text":"Oooh! So much food here! It makes your mouth water. You can smell the boiled seafood from ","useful":2,"cool":1},"_Hic9Kmd-K22nuY7xh2V2Q":{"text":"The best crawfish I have ever had in my life. This place doesn't look like much, and had a","useful":0,"cool":1},"V4phjkxS9ZaB3XguzcHh-g":{"text":"I went on Mother's Day and they were having some type of parade/festival outside so traffi","useful":0,"cool":0},"CYMOwEX3oQsc3SyxrsxYVg":{"text":"The people of New Orleans are so friendly and pleasant.  We visited just as they opened at","useful":0,"cool":0},"NXYcmAnG1GHG8kgWGqexCQ":{"text":"Was so excited to visit NOLA and read a lot of really good reviews on Yelp. Went to both C","useful":0,"cool":0},"peMjxY13l29XxQVs_h2pOQ":{"text":"awesome crawfish meat pockets.  This is what I ate because I didn't want the runs driving ","useful":1,"cool":0},"-9j0n2gC-VnPa82nE6I9Hw":{"text":"This place is ridiculous...in a good way.  Want authentic seafood Nawlins style you gotta ","useful":0,"cool":0},"WP7aoW9-OAnyYEk_uMnPvg":{"text":"The food was soooooo good!!  My advice is to know what you want before you get to the wind","useful":0,"cool":0},"ucKDURyBgqplF6KD8kkwuA":{"text":"Must go!  Food comes in a bag, messy and  cafeteria style, so it's not your typical food j","useful":0,"cool":0},"cgbadsbPAMIFk8WRlbAvag":{"text":"Want some authentic creole cajun??? It's not the most luxurious of spots, nor is the food ","useful":0,"cool":0},"7jdgKVzuWKJW_m7isam9bw":{"text":"This place has excellent food, the only problem is it's in the rough neighborhood. If you ","useful":0,"cool":1},"EWhCR4r818ol15OCnOi8_Q":{"text":"Giant shrimp po boy fed the whole crew. Cheap beer while we waited. What else do you need?","useful":0,"cool":0},"snSrgaW4ScN1wd-OVNeP8Q":{"text":"Great seafood! We tried the crawfish, sausage, corn (super hot!) and crabs. I would recomm","useful":0,"cool":0},"jDvsEbaQZ1m3VSGD-twz1A":{"text":"Really tasty crawfish boil, love the spice level. The employees & owner(s) are friendly & ","useful":0,"cool":0},"HY9oi85kXLvl8lVA27Zy8w":{"text":"All the locals I met told me that I should eat here....do as the locals say!   EAT HERE!  ","useful":0,"cool":0},"x7Sp9m5CiI37-szTkP_euw":{"text":"$4.99/lb of crawfish! \n\nWhen I visited NOLA, I came here twice within a 24 hour period. Th","useful":6,"cool":7},"xQ858A8NfWWk-k7sUWWw1w":{"text":"Don't let the fact that this place is in the hood scar you. The food was the best I had my","useful":0,"cool":0},"9ypO-HC3F2gqD-3zA83qCw":{"text":"Great poboys, crawfish pie and boudin. The crawfish were a little small and shrimp had bee","useful":0,"cool":0},"7qbH7Z3CBqGLETGtjB0yTg":{"text":"VisitIng New Orleans; I wanted some authentic Cajun seafood and came to this place because","useful":0,"cool":0},"3b2yzeVpxlMjOKjkZgcYaQ":{"text":"Ventured here thanks to reviews on Yelp and I'm loving it!!!! The crawfish was so great, w","useful":0,"cool":1},"TNJwIf735DfMRh9j5jGnaQ":{"text":"Our group went nuts about their boiled seafood, they reminds me of all the boiled seafood ","useful":0,"cool":0},"NcSM8vAhsM8n0nd5G7ptxQ":{"text":"Just not for me. The spice mixture for the crawfish had too much cloves - it's an overpowe","useful":0,"cool":0},"HB0G-YRHSCFokd1GTBg30g":{"text":"Man...if I wasn't on a constant mission to not become the Pillsbury dough girl, I would li","useful":1,"cool":0},"_GQfp9FYNmnAR7uFaHR7Dw":{"text":"Finally a great place to get #NOLA seafood.  Finally reasonable price.  Finally a place wi","useful":0,"cool":0},"bzM9VTTvqAfs-nctb8p-5A":{"text":"I am inlove with their crawfish!!!  \n\nSketchy area but the crawfish were good!!! They were","useful":1,"cool":2},"iVrOhGGryRGG72OSGdt9_A":{"text":"Its located in an area with minimal parking, but manageable. I had the hot sausage po boy!","useful":0,"cool":0},"pXPvtf-txwZPebCIP2DfaQ":{"text":"If you want good New Orleans style seafood in various forms, this is worth a go! Don't let","useful":1,"cool":0},"40FiUQEKIUv89I3X1RzN5g":{"text":"This is as good as it gets.  Fresh seafood here it is hot as in spicy and temperature just","useful":0,"cool":1},"biZ17ovPwiwD12u6umS5vw":{"text":"I would say that this is undeniably the worst seafood I have ever experienced. I'm a local","useful":1,"cool":0},"UgS_xNSPnivXMIPf3jJ3Ww":{"text":"I am so glad I tried this spot. Loved the boiled crawfish! Can't wait to go back.","useful":0,"cool":0},"-EgTqyPKXz_Ujm02Aitw5Q":{"text":"Excellent crawfish boil. Perfectly spiced. Fried seafood was the usual.","useful":0,"cool":0},"6FfTPne2Vlzv3gxVYbGP1A":{"text":"We ordered 2 lbs of crawfish, a turkey neck, corn, potatoes, and a sausage all for about $","useful":0,"cool":0},"w6YcFK5wqzxGxCn-JEgzMg":{"text":"This is the place to go for an amazing po' boy.  Of the many po' boys to choose from, I ha","useful":1,"cool":2},"spjW5K84KIRpZn2FACeHJA":{"text":"This place is AMAZING! Got a 'small' shrimp po boy that was overflowing with shrimp.. it w","useful":0,"cool":1},"UteyR4QT64rimvykphJXJA":{"text":"Great crabs  and shrimp was the best and if you like craw fish it's very cheap all the bla","useful":0,"cool":0},"iPvLMbUnIwzQw-DPG87rqw":{"text":"Bomb diggity! The price went up on the crab legs since the last time I was in town in Febr","useful":0,"cool":0},"Ug59cPrbtfNBJx89lOtfHg":{"text":"This place is a seafood market/restaurant so don't  expect any cozy decor. Ordered the sea","useful":1,"cool":1},"qPoNh8F7RNagGqebv8aG-A":{"text":"Friends wanted crawfish agreed to go but I don't eat the little bugs. Arrived in neighborh","useful":2,"cool":0},"xZrItcLjpsceFwcGxdiQaw":{"text":"Our cabbie wasn't too enthused that we were heading to this part of town. \"Want me to wait","useful":12,"cool":4},"FLDOTPcb_imAlGbkTXh8MQ":{"text":"Cajun Seafood has a vibe that's a cross between a cafeteria and a carryout, because it is ","useful":4,"cool":2},"Y_ByUz2s9aj9GkUep2CRwA":{"text":"Came here for Essence fest and heard others recommended going here.  I was not happy about","useful":0,"cool":0},"cJSVhr5KVckTEON1IZXSdg":{"text":"Great little spot for seafood! Its located in a not so great area but the food was so flav","useful":0,"cool":0},"8UwJ6RjThr5E00KqjQB2rQ":{"text":"Literally the best place I've ever been. The turkey necks are OUT OF THIS WORLD. I've had ","useful":0,"cool":0},"BF1i8pxVxkQT-M1PBK05eA":{"text":"Don't go for a sit down meal unless you're into cafeteria style seating. Other than that, ","useful":1,"cool":0},"vJQYyH1JotoLjsT4hNJuog":{"text":"Nothing fancy here and that may be overstating it. Cafeteria style setup in what looks to ","useful":0,"cool":1},"mRxJMQsFOUyF9kXjTU0vGA":{"text":"Really good and really fresh. We tried the snow crab legs, chicken, fried shrimp and catfi","useful":1,"cool":0},"7Cf9SS2BGrFi293a_KGZCg":{"text":"Went here during lunch time and what a disappointment!  The crawfish was not fresh and the","useful":2,"cool":0},"bsBaJVd_c8OosRVeURMQ9A":{"text":"$3.99/lbs crawfish?!? $1 small blue crabs?!? $8.99 for a \"small\" 18in catfish poboy thats ","useful":0,"cool":0},"T6CaHIzSr1v5sGBFjV1Xug":{"text":"Consistently good, spicy crawfish, potatoes and corn.  Also beer to go.  Low prices, long ","useful":2,"cool":1},"V4DvXqZa7vMLgnzaths_8A":{"text":"Absolutely delicious!\n\nAll I mew was I wanted crawfish when we walked in. We got 2 pounds ","useful":2,"cool":0},"j_zsAEcCr0aJCINXBON8jg":{"text":"This place was freaking amazing...we had the Cajun boiled crawfish, turkey necks, shrimp, ","useful":0,"cool":0},"4edQVmSquUOF-gERw0aaag":{"text":"This place the biggest Turley neck I have ever seen and they are good with a little heat.","useful":0,"cool":0},"JTkWb3PuJfL7M0FOFuwdlA":{"text":"Crawfish, and crabs cooked to perfection.\n\nShrimp fried rice is delicious as well as the c","useful":0,"cool":1},"87AL2sIv8bvw6w3YATj9KQ":{"text":"I was advised to stop here on my Mardi Gras trip by a coworker. I'm so happy I did because","useful":0,"cool":0},"iDE4F3tygyonv9uYrtcWdQ":{"text":"Reasonably priced.  It is a 35 mins walk from the French quarter. It cost about 6 bucks to","useful":0,"cool":0},"xiId972mw4Dz-TgorgTYkw":{"text":":( The consistancy of this place is not reliable. In total we have eaten here 7 times and ","useful":0,"cool":0},"ZmcH9LmkG1OrWiLe6LrmFQ":{"text":"I have never felt more lead astray by Yelp (shame on u!) than my trip here to Cajun seafoo","useful":4,"cool":2},"_pu2zyW866rrh0IpHgZ2ag":{"text":"This place is huge! There's a lot of food court like seating. The place was clean and brig","useful":0,"cool":0},"YszKG2Riz0XibRccq7BaKQ":{"text":"Been here several times and tried a bunch of boiled seafood places. Best crawfish around h","useful":0,"cool":0},"YKzN0bOZndyJWDNF3vRV3g":{"text":"Crawfish and Shrimp for Meh, it tasted kinda dirty. The best part of our meal was the saus","useful":1,"cool":0},"ow-Ji1Y1aTR1Wjkxla8v5Q":{"text":"Sketchy neighborhood three different lines to order fresh boiled fried.the tables were fil","useful":0,"cool":0},"ypixKywgSGjQ2tyVvDMmZA":{"text":"This place does not need my review. It's a crazy busy place. My partner and I came here tw","useful":0,"cool":0},"zqoDuhXvyw7ntwpRroFfEA":{"text":"You must eat here if you want great neighborhood seafood! Boiled, fried or fresh seafood a","useful":0,"cool":0},"XwAwZ4Q4R9U4TJv-ZiEi8A":{"text":"We ordered several types of food; boiled crawfish, corn, potatoes , boudin, beef and crawf","useful":0,"cool":0},"6x4MzUt1RDV_7fXpgDpHNg":{"text":"This place is truly a good value! We got boiled shrimp, sausage, boudin, corn, potatoes an","useful":0,"cool":0},"J_plGXf_j6U0qnFeH_RAKg":{"text":"It is a great place to eat. I recommend the snow crab legs and crawfish. They are very che","useful":0,"cool":0},"iANiZc4M5mcnOpF4Kxa_bQ":{"text":"Very good Cajun crawfish are served here---a little spicy, very tasty, and most importantl","useful":0,"cool":0},"pLW9V9QJrg44RR5W88Mqjg":{"text":"Best boiled seafood in New Orleans! Asian style taste, especially like pig feed and turkey","useful":0,"cool":0},"xqX-sLqNRBVKQNtYmf5hjA":{"text":"This place is terrible. This crawfish is soooooo tiny, the flavor is just too salty, the W","useful":0,"cool":0},"vINMet-BsPU8MHFAD-d_Dw":{"text":"When I lived in Little Rock, I drove to New Orleans just to say I'd been there. After a ni","useful":0,"cool":0},"792qy_kdDp3F9UbTuTWOhg":{"text":"Best sausage, chicken, seafood gumbo I've EVER had & the crawfish were EXCELLENT (very uni","useful":0,"cool":0},"wcXGNIaPulLzA4GLqeA2kw":{"text":"$4.99 crawfish right now in the end of June. It was super flavorful. And salty. Some of it","useful":0,"cool":0},"VoJVezrvP6-p0B6sGLCasQ":{"text":"Good food, good people. Worth going out of your way for. My wife and I ate 5 lbs of crawfi","useful":0,"cool":0},"WtOtJiYxK-JLA3jrj8Q04w":{"text":"I was visiting my grandparents for the weekend, and needed to satisfy my fix for crawfish,","useful":0,"cool":0},"HpSlQaUhb_PcmYu6H0KqIQ":{"text":"First time and the last . Place was dirty. They do not wipe down their tables. Ordered one","useful":0,"cool":0},"6NWQHEORmQiDsjK6lqgFfw":{"text":"Tried boiled crawfish for the first time and it was delicious. Spicy enough to consider st","useful":1,"cool":0},"j2sixESCtjY6D9fTIRT6YA":{"text":"Oh Em Gee! Skip all the fancy places in the French Quarter and hit this place up. We order","useful":1,"cool":0},"b50nM5yley5P0HvLSgcRhA":{"text":"I would fly in from Los Angeles to eat gumbo! It's the best thing I've ever eaten! It was ","useful":0,"cool":0},"zqyQnDqI07-0K5Un_lBNdg":{"text":"The shrimp Po-Boy is the bomb.com!!!! It was huge, I couldn't finish it all. Yes the neigh","useful":0,"cool":0},"GLJVPsRWbxyJLMu9oyVgrg":{"text":"Delicious and friendly staff. Highly recommend this stop if you're looking for awesome Caj","useful":0,"cool":0},"UOcWVv5x8KNZadVkQCL_tA":{"text":"Don't be fooled by the unassuming name of this restaurant - they say it's called \"Cajun Se","useful":1,"cool":0},"xrSsDLP95rbPxBggmC1kjg":{"text":"A diamond in the rough. Nothing fancy but the food here is excellent. We had a shrimp po-b","useful":0,"cool":0},"ZLHSOBdN3qF0obylsCWq5Q":{"text":"Best seafood ever!!!! Come early because the lines can get long, but they move the lines a","useful":0,"cool":0},"u6CQE76zT6vzg79DmluoLA":{"text":"The food here is ridiculous so I definitely recommend it.  We had the soft-shell crab po b","useful":2,"cool":0},"3NL0vMAEKosPoieC9tJy8g":{"text":"Great place!  Had the blue crab and shrimp boil with corn, potatoes and sausage. Good serv","useful":0,"cool":0},"25Ve8uS_dh-zzePRnN-sFw":{"text":"Not really a \"restaurant\" but good food. The food had a lot of flavor and there was a stea","useful":0,"cool":0},"rVbzA4LvC0pGixuqLPYALQ":{"text":"We were here during October and saw great reviews of this place and decided to order take ","useful":1,"cool":0},"D6RJslbDOAHFieFUfAygKA":{"text":"Ok!?! Wasn't sue what I was gonna get from this place, but for $30 we ate like Queens! We ","useful":0,"cool":0},"U9GrBK1xkfrJEryD9EpPGg":{"text":"This place was amazing. The food was 2nd to none and the price was extremely reasonable!","useful":0,"cool":0},"jQB4wsMJbMz4-nMZMYS1VA":{"text":"Very fresh and tasty seafood! When a restaurant is not in the best neighborhood but you se","useful":0,"cool":0},"HJcLaMbNF_NZbgBD9_TSiA":{"text":"1) go to counter\n2) get sack of crawfish, shrimps, corn-on-the-cob, and cajun fries.\n3) ea","useful":0,"cool":0},"ykqI-4OV8k5Pqo4a12-H2w":{"text":"Don't let the exterior of this place fool you.  It might look like a random little restaur","useful":0,"cool":0},"4UOH9QsQ83YT0UrLCY68Tw":{"text":"best shrimp, craw fish, crab boil I've ever tasted!  Go there.  Now.","useful":0,"cool":0},"hN98os0YUPIZy5_3ERCs_w":{"text":"so happy we stopped by! better than the tourist spots in the french quarters","useful":0,"cool":0},"td6nU2DM0_tvvhWdsGsXIg":{"text":"Hey! This place isn't pretty or fine fining, but it's great dining! Go stand in line and g","useful":0,"cool":0},"hVND7whd8vkHFDcgtGhBGQ":{"text":"The food was delicious. We went back a second time. The crab legs were some of the best I'","useful":0,"cool":0},"eadxqBxvRy6iIJqZoqUFTQ":{"text":"Better Po Boys than most of the trendy \"Po boy\" locations who claim to be \"world famous\" a","useful":0,"cool":0},"kgvmZFs9AH3liTf_0MBRIw":{"text":"Food was sooooo good no complaints there and they guy that took my order was really nice a","useful":0,"cool":0},"u39wTOs0_ylAlClBwW2-Ng":{"text":"First off, I live on the south side of Chicago, so taking a simple bus ride from our hotel","useful":1,"cool":1},"abWhQECJMqEBteg6AQnFqg":{"text":"Best and most affordable crawfish in New Orleans! We stayed at the French quarter and afte","useful":0,"cool":0},"VHW7z0dH18jFYSzAu7nJJw":{"text":"No frills, great value, delicious seafood. \n\nSkip all the overpriced touristy seafood rest","useful":1,"cool":0},"YwvF0OU8nV45dRHGtDECJw":{"text":"Some of the best boiled crawfish, those Cajun flavors were so delightful when cracking ope","useful":1,"cool":0},"cOyNyAC4XfcS2qaqL1GnRQ":{"text":"Very salty crawfish. Way too salty to taste the freshness of the crawfish. Average size. F","useful":0,"cool":0},"K79HIyR-ftXnZqYAGoOmMQ":{"text":"This is probably the best kept secret in New Orleans. Selfishly I thought of witholding my","useful":0,"cool":0},"v_yV6aNpzmR8HJjVuPer7w":{"text":"We came here with great expectations after seeing the great reviews. We got fresh crawfish","useful":0,"cool":0},"jipGe3ykaty10Th3Dwn8GQ":{"text":"My second favorite meal here in NOLA. It was a trek (ok, an uber ride) to get here, but I'","useful":1,"cool":0},"-0XrPbv0XC13TrageM1Msg":{"text":"The beeeeeesst!! Love this place! We got the snow crabs and crawfish. The line gets kinda ","useful":0,"cool":0},"BeN8yX_AptQZ8pPr7kI6Wg":{"text":"Poboys here are a 5 star experience, but the wait and hassle to get food knock it down a s","useful":1,"cool":1},"6B8h_FFQIIbxPwmwLKTO5g":{"text":"We made a pit stop in New Orleans on the way to Florida when we ate here. Best cajun food ","useful":0,"cool":0},"oCNBrSLY0gAat0WmEUUs1g":{"text":"I have been coming here for 2 years. It is rare that staff for a company take the time to ","useful":1,"cool":1},"L4ic0ggwAH1NChyWOH-l8w":{"text":"Authentic and inexpensive. I ate all I possibly could for $20 and had crawfish, shrimp, cr","useful":0,"cool":0},"Vnxw21x25WkzVbqYKIorcQ":{"text":"a little spot in the middle of the hood, with THE BEST cajun food I had on my trip to NOLA","useful":2,"cool":0},"dJg6wCN5ihVwC5B9326HoA":{"text":"Things I liked:\n- sausage - the flavor! Yum\n- corn - you may be able to find better corn e","useful":0,"cool":0},"zGhN2B6329Ceirl2VXdAsQ":{"text":"Just do yourself a favor and goooo! Best crab legs and crawfish I've had in my life and I ","useful":0,"cool":0},"Ixc1YGX3_F8RUuVkGnwkbw":{"text":"Decor: none, non existent\n\nFood: I had an assortment of broiled shrimp, broiled crab legs,","useful":0,"cool":2},"19B2t_JvOXc-zRH8v-fYjA":{"text":"Probably some of the best Crawfish, Shrimp and Crab I've ever had. Even when you peel the ","useful":2,"cool":0},"4cDfm4lSXYoESXi4assFzQ":{"text":"In order to get the best seafood in New Orleans you literally have to travel a little bit ","useful":1,"cool":1},"8eVj0qWnHvslBWtFf_v4-Q":{"text":"Had some crawfish here today and it was better than I expected.  I wouldn't say that it bl","useful":3,"cool":3},"f79borM6yhqnrZ6Ys0Q1eg":{"text":"Walked in here on a Friday afternoon. First thing we saw was a group of Asians going at it","useful":1,"cool":2},"PlBF25bKwqWNh5Vyre-CLA":{"text":"Great food but shitty service. Bad attitude from the staff, I don't know why they were bar","useful":0,"cool":0},"Kfd_CfOmCLjRwmEWNygxDQ":{"text":"3 hungry adults split a small serving of gumbo, one lb of king crab legs and one medium fr","useful":0,"cool":0},"k5LbI1kxhxQv9dcvT1YmAg":{"text":"Here on business from DC and I found the local spot by asking around. Boiled fish, corn, p","useful":0,"cool":0},"Dp4MEzCvcJLIpU3a5tdYKw":{"text":"Worst, let me repeat, worst crawfish I had in my life, not just in Nola. My friends and I ","useful":1,"cool":0},"MdCrNxSWvm6ZNf2TvgOWTA":{"text":"Overrated. I was not impressed with the turkey wings nor was my friend impressed with her ","useful":0,"cool":0},"_-QaZMzsssFXat5a-LyveQ":{"text":"Satisfied my boiled seafood craving! Their gumbo is one of the best I've had in a long tim","useful":0,"cool":0},"ocIhe1V7ldweSP-ut14GdA":{"text":"My first time in New Orleans it's a Wednesday night me and my girls are cracking crab legs","useful":0,"cool":0},"PHxjCjG5p_1AIbBWYO2m7A":{"text":"This place is deep in the hood good.  We go the shrimp boil in the bag with potatoes and c","useful":2,"cool":1},"SjKqQJIWUeTm8Cfb0Oymew":{"text":"Must try place. Turkey neck is delicious. Cheap eats. Highly recommended. Real Cajun taste","useful":0,"cool":0},"j-2Ji5Jut6GidIQL6Ta1DQ":{"text":"So glad I made it to this place. The crawfish was delicious!! by far the best I've ever ha","useful":1,"cool":0},"KwjqHFNjlyRbdMFQZQDClw":{"text":"I was here two weeks ago and It was the BEST meal I had my whole visit! I ordered a lb of ","useful":0,"cool":0},"w61AECTcC615SNarbHwRTQ":{"text":"Found this place on yelp and decided to try it out. My husband, siblings and I took an Ube","useful":0,"cool":0},"hHgoXrnyxLF6_xrFU8dfkg":{"text":"Half pound of crawfish, one segment of corn, one potato. I basically went to NOLA for mudb","useful":2,"cool":1},"nYBeMLwMI1TC__pdBOKmBw":{"text":"I am in love. This is one of the best hidden gems in Louisiana. I ate here everyday while ","useful":0,"cool":0},"dUkZipFCHGLgICeqL8OdPQ":{"text":"Expensive but I guess I can say it is worth it because I love the spiciness eh! Make sure ","useful":1,"cool":0},"_m7siOkdcXAMVzsNhYRqpA":{"text":"The service and food should definitely be 5 stars, but at 8:30pm on a weekday, the place c","useful":4,"cool":0},"fx6NEpQ8iewgdhzYkqAK5g":{"text":"AMAZING is all I have to say.  Huge portions, so reasonably priced, you'll want to get eve","useful":0,"cool":0},"dcdDM3ImEA0qvJgLBif8jQ":{"text":"I love this place, can't wait to get  back to New Orleans for a visit.  This will definite","useful":0,"cool":0},"LFMhXr2IvTkcGzadpjlwRA":{"text":"Our trip to NOLA was cut short due to an incoming tornado, so we were rushing to the airpo","useful":0,"cool":0},"vw901ck38aAHrq4FLFCcSA":{"text":"We were in NOLA for 6 days, and came here 3 times.  Nuff said!  All the seafood boils were","useful":0,"cool":0},"jVCI8ps9U1J0GxraJPQb7A":{"text":"Seriously delicious. My husband and I came here after getting a recommendation from a loca","useful":0,"cool":0},"jQgZLwj15EqtZWgNXxm2Qw":{"text":"Tried them for the first time after seeing so many people  go. Terrubly disappointed.  I o","useful":0,"cool":0},"CV1AlunQV03HNBHa40VshA":{"text":"This is THE BEST place to get anything Cajun; crawfish, shrimp, snow crab legs. Coming fro","useful":0,"cool":0},"UxyG8RGG3fzkfiulvmr9EA":{"text":"We stopped by there in on our way out of town because we had not had a chance to have jamb","useful":0,"cool":0},"46a7cLMuh3W0uCT4VI_LVA":{"text":"Went to the dive twice in one week. This is where the locals go in Friday to indulge. Be p","useful":0,"cool":0},"v9fLullDLhariyWDdCLvUA":{"text":"Damn.  Freaking amazing crawfish.  I downed 2 pounds of them no problem.  They are spicy a","useful":0,"cool":0},"xeZJR_MleRrTegPKJnwYRQ":{"text":"Sooo, the Monday after the Irish Channel St. Patrick's Day Parade is not a good time to tr","useful":6,"cool":3},"uwDVB2qH5h7OvMmTBMDL4w":{"text":"Busy place, I've been twice and both times recommend just getting food \"boil\" style to go ","useful":1,"cool":0},"XzFOZZvn9LPHbVAhdGqQyg":{"text":"Prices were low for the amount of food u got from seafood. It was a good low budget restau","useful":1,"cool":0},"IeUvH4VbYwHuPIqcFevxHg":{"text":"Best place in the French Quarter to hot boiled crawfish and pork boudin. This place is the","useful":0,"cool":0},"m13Izs4vCnVwdn7YPvtB4Q":{"text":"Decided to head outside of the quarter to where real locals eat and was able to get crawfi","useful":0,"cool":0},"vA7AZXJBiQhKhL_gElEHEg":{"text":"Literally my favorite place in New Orleans. I am visiting from out of town and one of the ","useful":2,"cool":1},"DYr0h3nnUiR3IpT7DkqyUg":{"text":"This place is disgusting... I'm not even sure there were oysters in my fried oysters. Just","useful":0,"cool":0},"LmiJu2SanS482tj-jXn17Q":{"text":"Great food but crappy service. Bad attitude from the staff, I don't know why they were bar","useful":0,"cool":0},"7Y1SJDJ_zp3iTOcPzZ9SMw":{"text":"Phenomenal seafood-by-the-pound, albeit in a bit of a questionable area. The guys working ","useful":0,"cool":0},"0SJOjTdjBSEIQ72S_XEoWg":{"text":"This was literally the FIRST place we stopped in at NOLA. I'm soooo happy we decided to co","useful":1,"cool":1},"dkJAS72YRfHB6HG3CpdxsA":{"text":"Super busy place but worth the wait.  Everything was delicious but the turkey neck and pig","useful":0,"cool":0},"QFoStllw1z8EgnmYvGPhIQ":{"text":"AHHHHHHMAZING!!!!!\n\nLil mom and pop joint. Can't miss the building it's gorgeous. They got","useful":5,"cool":4},"vs5FZyQvXBrwKHNBjLPRNA":{"text":"When I tell you... this is one of the best things since sliced bread.. me and my gf stoppe","useful":2,"cool":0},"NhcVQ39NJ3MENaVWRMSQsg":{"text":"Away from the madness of Bourbon Street! This was such a great find. Their crawfish was so","useful":0,"cool":0},"ozNKBP2K6spgCUZIvaOT4A":{"text":"The fried shrimp and fish was seasoned very well. The fried shrimp was the best. The fish ","useful":0,"cool":0},"HMQU--nEEMlzkQy1TZlauQ":{"text":"Their sauté crab was super flavorful (would be amazing if it was done w/Dungeness crab.. B","useful":0,"cool":0},"ZQrqsHRY7W_AL0c0tPhrMw":{"text":"Shrimp Pob Boy was AMAZING, 12\" inch is big so a small will prolly do anyone good. Also ha","useful":0,"cool":0},"hV-x0RH52MbHa6FJbXx4GQ":{"text":"The gumbo was soooooo good along with the turkey neck, blue crabs and potatoes..i will be ","useful":1,"cool":1},"WGmVFmQryWhEnS0ZY4W0cg":{"text":"Best Sea Food at U.S! Juicy and Spicy crawfish, shrimp and crabs!! If you want real fresh ","useful":0,"cool":0},"uVBBo2EAPb8YY-XA_27jKg":{"text":"Amazing place! I love the atmosphere of a good place like this-- you really get an amazing","useful":0,"cool":0},"SoEj7fjCYsE6vdJB9e3Ryw":{"text":"Been here twice visiting New Orleans first time it was a lil sketch area but, well worth t","useful":0,"cool":0},"_sKSREzYd9Gk_Epi5UtEDw":{"text":"Don't go by yourself and don't go at night unless you're driving but DO GO.  The crawfish ","useful":0,"cool":0},"VPyIv_5KZn1mmCWjvseXXg":{"text":"Great place to eat crawfish like a local. Very friendly service and tasty boiled seafood. ","useful":0,"cool":0},"WUE7xnVcYE7VVJF233mjtA":{"text":"Oh. My. God. BEST BEST BEST crawfish ever. I am a connoisseur of crawfish boils, and where","useful":1,"cool":1},"NzvLcsVLz_mfRAOw3qFa2w":{"text":"Buy in bulk, eat with your hands. We might fly down to New Orleans again just to have more","useful":0,"cool":0},"9249aNV8aMOSlv__4yGEPA":{"text":"I found this place on Yelp. Was in town and wanted some good boiled crabs. The place is ve","useful":1,"cool":0},"C2FjvfXPna4u4F3d4a6C1A":{"text":"I found a fried fly in my food... And the lady that I ordered from was not nice at all.","useful":0,"cool":0},"HGN3Zh59pLPxD1U5_bsTeA":{"text":"So happy to have found this neighborhood gem! We were referred here by our Uber driver. We","useful":0,"cool":0},"gbjNQ7-iwkE-Os8p0aeApw":{"text":"great food + great prices = love!!!\n\n- - s e r v i c e - -\nSuper fast! The whole time I wa","useful":5,"cool":5},"_i_jNU9GnzMFFcW_GdjW8g":{"text":"Fantastic crawfish for half the price they were charging at the French Quarter and the lar","useful":3,"cool":0},"UCEJvzcMat_5RlDUArjlVQ":{"text":"Potatoes and huge shrimp that are spiced up and yummy. The gumbo was full of chicken, shri","useful":0,"cool":0},"nbngWvXmzc_rvv2J4xk2jw":{"text":"While the more non-touristy location may leave a little to be desired, Cajun Seafood draws","useful":5,"cool":4},"HnjBhXR-Fies-oFNGvU-hw":{"text":"Food is amazing! Really loved the catfish and the gumbo. The portions are large for the pr","useful":3,"cool":0},"xo4lMGu9ZnM4QGlFdpjhfQ":{"text":"Some might walk in and be thoroughly confused. Is this a divey restaurant or a fast food p","useful":0,"cool":0},"h6Owz36hZLbwe4dmor_piA":{"text":"what can I say bad about this place? Besides the unkempt tables, the food is great. I had ","useful":1,"cool":1},"yp8yT86Fj0_M6iRv6q0O9A":{"text":"To me Seafood City will always be the best but since it's not here anymore, Cajuns is my f","useful":0,"cool":0},"HrUQhSEkbIH4plNv_JK2uA":{"text":"We came here to get the food the locals eat. Once we got there it was a bit confusing to o","useful":3,"cool":1},"XMFAQE2wwb8KoXo0j-ONVA":{"text":"The food here was awesome! The lady behind the counter noticed that it was our first time ","useful":4,"cool":0},"vVCXF95UUXDqgBtc7ttXkg":{"text":"Came to visit new orlean in November. Looking for a good crawfish place to eat. As new orl","useful":2,"cool":0},"w8LN2xxIc315THL173XSBg":{"text":"We got one pound of shrimp, one pound of crawfish, sausages, corns and pigs feet all for u","useful":0,"cool":1},"7Ys_c-mtew_fhRDM1n75bA":{"text":"The rave reviews about this place is spot on. It IS definitely in a sketchy part of town, ","useful":0,"cool":0},"rdoqq59OkYXKF6zlFIsN-w":{"text":"Loved it. \n\nWe come to New Orleans a few times a year and usually stay near the French Qua","useful":0,"cool":0},"rmQur4fnKlGJlZo-qWhhLg":{"text":"Omg Cajun Seafood was so legit. Where have you been all my life?!\n\nBoiled crawfish for onl","useful":7,"cool":7},"VkTwjdmGc2tVi4dUhCSVig":{"text":"I am out of town and decided to give the this place a try.  I am a big fan of crawfish, bu","useful":0,"cool":0},"EpdBx0MekxfOIXbVducB6Q":{"text":"First meal in New Orleans on my first trip to Louisiana! The boiled cajun seafood here was","useful":3,"cool":0},"m2_rqh-3pf4NxgksdvIMsQ":{"text":"Everything here is good. It's clean and it's spacious. The shrimp pasta is amazing! The fo","useful":0,"cool":0},"MrVq3nv2WUDXC38_J2PaxQ":{"text":"LONG AZZ LINE. So long it goes up, down, around, and goes all the way outside, like you're","useful":0,"cool":0},"CL7ejX3uOGbftXzpsWjz_g":{"text":"One of my top joints when I was in New Orleans. Prices are awesome. $3.49lb for hot crawfi","useful":0,"cool":1},"FYCj8i6fQJ6KYWl23629OQ":{"text":"After disappointing food hunt in New Orleans (and that's what you go there for!!!), I deci","useful":3,"cool":2},"1zs2cOPhgMRGnrLy15hiPQ":{"text":"The food is cheap and delicious! We are in town visiting and it was worth the 25min walk f","useful":0,"cool":0},"gDslG_eW0sMPKXTemQ3Z2A":{"text":"Yum! Was looking for a relatively cheap hole in the wall that had everything boiled. Well ","useful":0,"cool":0},"AWJ_b-L1Ao4SYiqWD6SH1w":{"text":"The seafood was fresh. They carry cook seafood and fresh uncooked too.\nWe had the crawfish","useful":0,"cool":0},"_wE5aMiW6x-MySUEa5TUZA":{"text":"This is the best crawdads I have ever had. Much better then the ones we have at california","useful":0,"cool":0},"hCs3mTRXTm5To9C0ffxjBw":{"text":"Omg.... Id easily travel from Nashville to come eat here on the weekends. I'm an avid seaf","useful":1,"cool":0},"9XEQmSDUEB-R7F7XYrtxWg":{"text":"I come here whenever I visit New Orleans this is one of my favorite stops. The boiled shri","useful":0,"cool":0},"0yOwI1GvPMIV1uApu0Vo2Q":{"text":"On my second culinary excursion to Nola I found this wonderful feast of an establishment y","useful":0,"cool":0},"jIJhz2mMFqFokrE0gRVOcA":{"text":"Came to New Orleans try some good seafood. This was definitely a good choice! \n\nWe got 6 p","useful":0,"cool":0},"jEDU4CFbFtSpmjB1vtSq-Q":{"text":"Everything was great despite the long lines for the essence fest this past weekend I\nWould","useful":0,"cool":0},"ps8v6PXm388eO4NgQ2aHBQ":{"text":"Cajuns is alright with me, especially after the Manchu experience. Like the fried rice a l","useful":0,"cool":0},"3XAkMu6htFSCyUBp94Wbvg":{"text":"Stick to the boiled seafood line! Crawfish, and crab was off the hook! I also had a turkey","useful":1,"cool":1},"ERRCVD6M3i9hY4gjMqU34A":{"text":"I'm now a return customer and this time we got the soft shell crab po boy and the shrimp p","useful":0,"cool":0},"hXhlDFbHf35jRNKTA5aqbQ":{"text":"The earlier reviews speak for themselves! A must try for people visiting the area. We orde","useful":0,"cool":0},"-z7TIQPFC0Tyqkw2RUDyCA":{"text":"Best Cajun food for a decent price. We got snow crab legs, shrimp poboy, broccoli,and frie","useful":0,"cool":1},"MWqmQDd9uNJWNBnEDO4WZg":{"text":"This place was unexpectedly awesome! We were looking for a place to try nawlins crawfish a","useful":2,"cool":0},"i3hSXiMjr6_mWfapwa5cGQ":{"text":"The line was SO LONG!!! SO VERY LONG!!! But it was worth the wait! Not the best neighborho","useful":0,"cool":0},"0UBbWDHoOLrVa80UolPWxg":{"text":"I'm from Texas and everyone told me this was a must stop! I can definitely see why ! The c","useful":0,"cool":0},"jIhJG0Y_0GA8Nw8E_tomBg":{"text":"Had boiled snow crab, boiled shrimp, and corn. So spicy and flavorful!!! Shrimp heads have","useful":2,"cool":2},"aALYbeRvR9lH3FvmMj73WA":{"text":"3.50 a pound of crawfish.  This was our first experience eating them and we loved it. They","useful":1,"cool":1},"7tgLzOY2JQUsD6KmDEQWVQ":{"text":"Food was sub par! Taste like it had been reheated. Sausage in gumbo had after taste. My hu","useful":0,"cool":0},"D4y3iq4UwblBauvLzltmFQ":{"text":"I cried a little in the plane home when I couldn't go back to Cajun Seafood one more time ","useful":0,"cool":0},"m5GAG7Efg35fI6FACEBPcg":{"text":"Coming from California to New Orleans looking to get my hands on some good crawfish. Many ","useful":1,"cool":2},"QzSNf_K5b9y9xAkGyEe2kg":{"text":"Ok...SO I found this place on YELP after not being satisfied with all the tourist traps do","useful":0,"cool":0},"63K0jYxuIG69KH2gpv4EuA":{"text":"Our Uber Driver suggested this place after our awful visit at Dookey Chase. I should first","useful":0,"cool":0},"WalotSlAtcqd4SSk9HFmXQ":{"text":"Don't like the food there. The pig feet is too salty. The crawfish is not as fresh as I ex","useful":0,"cool":0},"1ly74NUv2N-3PA0tvLyPbQ":{"text":"I ordered the soft shell crab on a bun and the body of the crab was all of 3 inches big. I","useful":0,"cool":0},"5TDp7DpYe0SAT5xRwJoBTg":{"text":"This place was disappointing! I came from California to experience good food, we have a lo","useful":1,"cool":0},"gDg2BWmF5eKuldE3M8R8jw":{"text":"I've beencto a lot of crawfish shop in new orleans and this is my favorite. Great flavor..","useful":0,"cool":0},"sS1AzR3yxZH6MtzMR69OMw":{"text":"All I wanted to experience in NOLA was a crawfish boil but I was continually met with over","useful":0,"cool":0},"X_Bhk6R0mZ5OfhCzwEt5dA":{"text":"Very good seafood. Amazingly cheap! A little overwhelming if you don't know what to expect","useful":0,"cool":0},"t_Q2d04juGIUrAm7H81IfA":{"text":"This place is awesome. I know you have to wait in line and the place looks sketchy . But w","useful":0,"cool":0},"krvkUrsKk_h7yLPBX83mkw":{"text":"The food has gone down hill.\n\nMy Mama won't let me go here anymore 'cause she's scared I'l","useful":3,"cool":0},"GPgHPlQUG1J3Ehz6hIOSOQ":{"text":"Lawd hammercy! This place probably makes the best crawfish in America. I first dined here ","useful":5,"cool":2},"QJ7F0X-6umF6ISTFg-drSg":{"text":"Awesome hole in the wall restaurant. Good food great price. Place needs some work though","useful":1,"cool":1},"yE07CXgU1tLokIKpxRSsWQ":{"text":"Best meal I had over three days in New Orleans. The boiled spicy crawfish, and the boiled ","useful":0,"cool":1},"QYdx_Y3ExflJBtsdhW_51w":{"text":"This place is awesome. For 20 bucks we got a lb of shrimp, a lb of crawfish, 6 medium crab","useful":1,"cool":2},"pKBQewEYo-RuobuF7Kk7WA":{"text":"We followed Yelp to come to this place for dinner. The food was good. Spicy boiled corn, b","useful":0,"cool":0},"BY4sqFLHXZ6kEWJxV3hdvg":{"text":"Don't come here expecting any sort of customer service or cleanliness. You can leave those","useful":1,"cool":0},"dB17aNNhNVlLAGK8FRzVbQ":{"text":"Cajun Seafood is a fantastic local spot that sells great seafood for very reasonable price","useful":2,"cool":0},"D794FDuIsmoXnHSZ_pZaLQ":{"text":"OMG, the food is AWSOME, I have never had crawfish, but let me say YUMMY!  The young men w","useful":1,"cool":1},"jTp65fLUXu3h4tF-3Ok_lg":{"text":"Love this place. We walk here all the way from the French Quater just for some boiled seaf","useful":1,"cool":0},"DdzILLzJ4D9vjuxUWaJnPw":{"text":"Off the hook! Hands down best crawfish I've ever tasted. Very cheap and the servings are h","useful":1,"cool":0},"Dk4dyces-S6VJ-QePQWMdw":{"text":"Best CRAWFISH! If you come when crawfish are out of season Don't let anyone convince you t","useful":3,"cool":2},"h2e_BBPtNdz2MJcu27Kl6w":{"text":"Go all in and get yourself dirty up to the elbows. Avoid the pig feet - it's all cartilage","useful":0,"cool":1},"7XgBWYcJnYqt3cyAKMrLpA":{"text":"If you are looking to get some crawfish and various seafood to go, this is the place.  We ","useful":0,"cool":0},"bVbAYv_Zmxw2cfBCT9rKAw":{"text":"$4.99 per pound for boiled crawfish early in the season is pretty reasonable, and the mudb","useful":1,"cool":1},"1VHBehfxfEdhq85TH4_KXA":{"text":"My friends and I came down for the weekend and wanted some good crawfish. People kept tell","useful":0,"cool":0},"T0iOBvNpVzhVtkfs3X7AvA":{"text":"While I was staying in the Aloft in New Orleans Downtown, one of the Guest Service Represe","useful":0,"cool":0},"MDQV9uRekmKgq3RLh5lTmQ":{"text":"The place was ok.......... the food!!!! FANTASTIC...can't say no to crawfish.Even though i","useful":0,"cool":0},"fbWgPBDz67_lvete_muq1w":{"text":"This place comes highly recommended by most in New We ordered the snow crab, fried rice, c","useful":0,"cool":0},"bhQHo576-lHy4M2fuTLxVA":{"text":"Very good seafood always a crowd of people service is very fast and friendly. We traveled ","useful":0,"cool":0},"_yFMfDHPho8r2fntE6q6qw":{"text":"Cool people.. Funny as hell workers. And great food. It's not fancy and that's a good thin","useful":1,"cool":0},"nhJH8oEHxKCvLfHJk21WyQ":{"text":"It's places like this that make me miss living in the South sometimes. Growing up in the p","useful":5,"cool":1},"S1ruRibsTIRsYiG8-g6M0Q":{"text":"Best place for cheap food and good eats! Even tho it's in a sketchy area, I would totally ","useful":0,"cool":0},"h5XsxZ-LQXHsMa-Y3oVADw":{"text":"I love Cajuns. A great seafood stop with lots of options and ample seating. The lines are ","useful":3,"cool":2},"GRxg32RLulnaR8yy3nRrcA":{"text":"I stopped here with my family for lunch and it was AMAZING. We love our seafood and this w","useful":0,"cool":0},"Z_UW_k1lXZCjG6wUMa9F2w":{"text":"Cajun Seafood was recommended to my boyfriend and I by a Local resident. I can honestly sa","useful":0,"cool":0},"sXdeOTGr5JlpmreBefsylg":{"text":"Really really really good crawfish, potatoes, and sausage! My boyfriend had the fried fish","useful":0,"cool":0},"8w0QtA_N4H_yBVVCjUk9cw":{"text":"This place has the best seafood boil. A must go to place if you want authentic shrimp or c","useful":0,"cool":0},"BkxC9UUbRb7nPstcbeCRfA":{"text":"I always make sure to stop by this restaurant whenever I visit New Orleans and it never di","useful":1,"cool":1},"srzxIOolfZOnoOsGDbqgFQ":{"text":"I moreso expected to come to a sit down restaurant and ended up in a market that had table","useful":1,"cool":0},"jEKVcd-gcz4juF-F5-YcqQ":{"text":"Let me start off by saying \"This was the BEST crawfish EVER\".  At first I wasn't to sure a","useful":1,"cool":0},"1PQApxxuSMyYOTtWOWHIsw":{"text":"My boyfriend and I had JUST arrived to New Orleans and we knew we wanted crawfish. Being t","useful":0,"cool":0},"HAHXxXTCOHGhe8UpyxRzVA":{"text":"went to cajun joes on a bike tour. the shrimp po boy was outstanding and cheap. make sure ","useful":1,"cool":0},"czNDtkZ-4pirFFBuP84SDg":{"text":"I have no words other than amazing! When you're in the city Cajun Seafood needs to be a st","useful":0,"cool":0},"1SonEfTKM1v_D978cL7BQw":{"text":"This place is a hidden gem to us visitors. & if you happen to look up from the deliciousne","useful":1,"cool":1},"dFYKsgtJQ7LoT4mq3lThgQ":{"text":"This is my favorite seafood spot in the entire world . Their prices are the best , crawfis","useful":0,"cool":0},"tAWHxO6NCD-GhWnS9mBzeg":{"text":"I'm so glad that this place isn't too far from my apartment.  This is now my go-to place f","useful":4,"cool":2},"OV2Hhluv_200yl0SEp6j0Q":{"text":"Great prices and good customer service. It's nice to be able to grab a beer with your meal","useful":0,"cool":0},"Js6WsVUAMF-OWZUShXGusQ":{"text":"We ordered the boiled shrimp with corn and five piece chicken strips. The shrimp was perfe","useful":1,"cool":1},"pvaoIsL3rAnxdWQUOQCsfQ":{"text":"The food here is TERRIFIC!  The lines (Boil/Kitchen) are long and confusing, but wow that ","useful":1,"cool":1},"J7YZm4retpCIkeLyI3V_Kw":{"text":"别再被那个美食公众号坑来这里！！这是我们尝过的最恶心和最不新鲜的食物！ 尤其是小龙虾，尝了一口全都扔掉了！The shrimp, crawfish and the crab are","useful":2,"cool":0},"cIBQl4draJNbbyHA2kuACA":{"text":"We were recommended Cajun Seafood by the concierge at our hotel, and we couldn't have been","useful":0,"cool":0},"Q9ieOhB_4LaT1C-gvuroWA":{"text":"Seafood gumbo was probably the best I've had so far (not an expert but I've tried about 6 ","useful":0,"cool":0},"gbnLBBIh7bQYDkm8Us9aWA":{"text":"Love this place, a market that has cafeteria style benches where you can eat your food. Th","useful":1,"cool":0},"buSurW972tU60Nwn2qBZxQ":{"text":"This is the first place we ate when visiting NOLA and it was pretty delish. I had the Dung","useful":1,"cool":0},"NXftYidzmA4pIpo9ILnhgQ":{"text":"Omg the spicy crawfish was sooo good and they tell me it was out of season at the time so ","useful":1,"cool":1},"-VAslOGm9N5OfvNh7u09Wg":{"text":"Bomb.com! I will be heading to Cajun Seafood every time I'm in town. It was a beautiful vi","useful":0,"cool":0},"4403HgL7j8vg-d56T5-8VA":{"text":"This place has amazing gumbo and boiled crawfish! The seasoning is just perfect for the cr","useful":0,"cool":0},"2kTRQENVBMmGbhgp-e8NQQ":{"text":"Omg visiting from California. This place has the best Turkey Necks hands down! When I come","useful":0,"cool":0},"M94nBk9HOH_umKbMx-zx_A":{"text":"Seafood, Chinese food and alcohol you can't beat that.  The lines weren't they long today.","useful":0,"cool":0},"K9S5YQQpoEt5RqvW0zxJqQ":{"text":"In a windy and rainy night, I walked to this place for 30 minutes. That's my commitment fo","useful":2,"cool":3},"p1nD807voO_SNcnOeupSaw":{"text":"We were recommended to Cajun Seafood by one of our uber drivers. We were on the search for","useful":0,"cool":0},"-53rjl3YF39vESUyKoiUUA":{"text":"Yep it's ok the hood but if you go all the way to Nola. Do it! Uber in an out if your scar","useful":0,"cool":0},"gbJrTQPhtsj0-446-s7ZHQ":{"text":"This place is not very tourist scene..  I found it on yelp and to be honest when we got th","useful":3,"cool":0},"pCKdJbgX5VRiqNvc9_UQqg":{"text":"Awesome food, great atmosphere, I will definitely go back here next time I am in town. The","useful":0,"cool":0},"UKsC9Ofe_LqajZdm2LoXnA":{"text":"WORST CAJUN SEAFOOD RESTURANT EVER! DO NOT WASTE YOUR TIME NOR YOUR MONEY! \n\nCold food in ","useful":0,"cool":0},"cvieg0kzFNPyWF9ed5-AGA":{"text":"Yuuuuuum! I am terrible with spicy food, but I just had to keep eating because it's so del","useful":0,"cool":1},"bjSEfotrtjtXVrBv8A53qQ":{"text":"Very delicious and reasonably priced. We two girls enjoyed 6 pounds crawfish, 1 turkey nec","useful":0,"cool":0},"puCFWT7oNdoaG9zGxE588A":{"text":"This place is hands down the best spicy crawfish I have ever had! I agree that the ambienc","useful":0,"cool":0},"63-Ak6L-wpxVse2P582brw":{"text":"Restaurant says open until 9:30pm. Came in 40 mins before closing time and the security gu","useful":0,"cool":0},"HUftLw-VOdKDUjXwbDitmQ":{"text":"My go to whenever I touch down in New Orleans. I would recommend you try everything on the","useful":1,"cool":0},"pP6P4AGOKzF28CAO05sxRQ":{"text":"The area is a bit rough. But that's where the best hole in the walls are, right! \n\nWe orde","useful":0,"cool":0},"wKjhqNqAdQzj7XxKaJS78A":{"text":"Had a shrimp poboy, boiled crawfish, boiled shrimp and corn. The poboy was very good and h","useful":1,"cool":0},"iya5xB-ZuaFovn47mqBAYQ":{"text":"On vacation and was told to hit this spot up. I'm from California so the set up reminds me","useful":0,"cool":0},"mukbJKRtM1Tk2Ckfd_EkwA":{"text":"Seafood from New Orleans is already unmatched, but this place right here is amazing.Pricin","useful":0,"cool":1},"d13caYfE9vwJoA23zBm5eA":{"text":"Locals recommended this place and I couldn't be happier with this little gem. Do yourself ","useful":2,"cool":0},"Apv-BioiVomDDyo3uQ2FfQ":{"text":"Cheap food which is great! The crawfish were full of flavor the shrimp needed more flavor!","useful":0,"cool":0},"8-a5cKNk33KqPzWz0hv8BQ":{"text":"Every time I come to New Orleans I always come here. I love the crawfish corn,potatoes ,an","useful":0,"cool":0},"wKCyLmAYk-onMMaH9pXAGg":{"text":"Boiled crab, crawfish, and shrimp are amazing!! The gumbo is good but not great. The turke","useful":1,"cool":0},"E9PTdJOPibrdDz9LliXkzg":{"text":"The scene at Cajun Seafood last Sunday night was unlike anything I'd ever seen. As my girl","useful":3,"cool":2},"-d6GbDvBtdi8ub_tXi6N_Q":{"text":"Being from Idaho and not liking seafood and spice, I agreed to eat here for the crawdads, ","useful":0,"cool":0},"LGR1KHwh2R1kHGkQOtwA7g":{"text":"This place is it. No doubt. Great fresh seafood, great prices, friendly folks. \n\nSoft shel","useful":3,"cool":1},"iZ45XWRKRh-ltFxUgUMnDQ":{"text":"Yes, there are better boiled seafood elsewhere in NOLA, but with the price and taste, this","useful":1,"cool":0},"m8gzuI-BDc8ocNh6pOF1MA":{"text":"Crawfish and Shrimp were great. This is where the locals eat.....\nMy wife and I made it he","useful":0,"cool":0},"HbedNcticTXusMz14kGx3Q":{"text":"Again, I feel the yelp reviews are bias. OK, this place is cheap, dirty cheap! It's run by","useful":2,"cool":0},"VJJX3_t1Hi5l8EoWbrHqLw":{"text":"Best boiled crawfish I've ever eaten! Flavor was fantastic!  Also had a shrimp poboy that ","useful":0,"cool":0},"NTJClqv_DomOdeLQVLLqrQ":{"text":"Authentic cajun boil. I will say it was a different experience to not choose my boil flavo","useful":0,"cool":0},"BJlnHJOF1SWkrd3Wb2RV2A":{"text":"Best crawfish in the city, it melts in your mouth. Garlic with the crawfish is a must. The","useful":2,"cool":2},"o3D4mXPTn6vdR9Y7gy43mA":{"text":"Good place to eat.. good prices on fresh seafood.. we ate inside they don't supply seafood","useful":0,"cool":0},"cT9IesbYU1YlbVEmM6ytlQ":{"text":"This place was recommended by our Uber driver but he warned it was in \"the hood\" but worth","useful":0,"cool":0},"d7D_HoqPl39A4hlWj2Yp1w":{"text":"There aren't any bells and whistles to the establishment nor the service but there's no ne","useful":0,"cool":0},"arx7dnE-Qs1yR8oA7mR-kQ":{"text":"This place was amazing! I'm from Orlando, Florida and I've never had my food taste like it","useful":0,"cool":0},"MfeeTgaRtPEUC1-lMZllIA":{"text":"This was my first stop as soon as I got off the plane in New Orleans, well after we droppe","useful":0,"cool":0},"H6k1d1iPpG8DNi_WxGftuw":{"text":"Amazing!! We were her in a busy Saturday and ordered the grilled shrimp po boy and the sof","useful":0,"cool":0},"MsrsQuM9N0j3MlSa0upkIA":{"text":"I was told to come here by the front desk person at the plc I was stayin it was a good exp","useful":0,"cool":0},"gwUzYD78P-yNy4agV6G-sg":{"text":"I found the restaurant/market doing a Google search.  The reviews on Google were very comp","useful":0,"cool":0},"003LYtVct-1cmizfdtvsPQ":{"text":"Fantastic food. The place is so packed that there's always a line. They don't have a secur","useful":0,"cool":0},"AmG9XH6UhwkZkZYUd6Tt6g":{"text":"Since it was our first time in NOLA we were looking for a seafood boil restaurant. Most of","useful":1,"cool":1},"K2D3HSsBJp0XB1AAyW-WlA":{"text":"I am actually surprised this place does not have 5 stars because i come here all the time ","useful":0,"cool":0},"cyfoR1A3V1rahvvgxt79bw":{"text":"Food here was GREAT, staff was pretty friendly. Only\nComplaint was the overall cleanliness","useful":0,"cool":0},"NlKwJE2_2-KD2B5xXPju3g":{"text":"Long story short:\nFood= PHENOMENAL (minus french fries)\nAtmosphere= terrible\n\nKeep in mind","useful":4,"cool":2},"-eRnGdS0XFwLJSj0iMDziA":{"text":"We wanted our last meal in NOLA to be more seafood boils! Cajun Seafood (the market we wen","useful":2,"cool":4},"GIsWyxaW7wStl6JHS-LYmQ":{"text":"The seafood was wonderful!  Fresh seafood  seasoned well and allowed the true seafood flav","useful":0,"cool":0},"i5B8XVAk6wBy2ROaQlUgbw":{"text":"Food was great service was quick price was reasonable.  This is not a restaurant more like","useful":0,"cool":1},"MzCt16jfZbAHFaNuLjTWbA":{"text":"Ahhhhmmmmazzzzing!\n\nLine was out the door..that was a great sign to me...lol. It moved fas","useful":1,"cool":0},"S3fd-V0nFYSkRDUD5P6_dw":{"text":"We stopped here on the way home, from Destin to Houston. OMG the food leaves you *mindblow","useful":2,"cool":0},"LsKcW37XJCcRfmYElRDPDQ":{"text":"Cheap and delicious! Was quite busy but the staff moved the line through quickly. \nWe got ","useful":0,"cool":0},"R8t23tBdV5mZpRFgmMR5aQ":{"text":"The place was a bit hectic, and the employees working the right side of the counter seemed","useful":0,"cool":0},"wrndTiZIYZxfcO6PINafsw":{"text":"If you're looking for local sea food in New Orleans, this is the place to go.  It a fancy ","useful":0,"cool":1},"seczU7WrR73o7uSEkiHnNA":{"text":"Say hello to high blood pressure. This was my first stop when I visited NOLA because I was","useful":3,"cool":2},"1cf8Je-_aqTmOTrrQMzB5g":{"text":"I would not recommend  anyone here for boiled seafood!!! The cashier ( little Vietnamese g","useful":0,"cool":0},"ypjWxY962b73kFvuf4PQXA":{"text":"Stopped by this restaurant during a visit to New Orleans.\n\nI heard great things about the ","useful":1,"cool":1},"8fl_K0FeMoNM3amkdDOTZg":{"text":"staff was helpful and courteous even with a newbie with tons of stupid questions.\n\nhad the","useful":0,"cool":0},"I30VUPkbmWb-Wl5UJAfrAQ":{"text":"Threw a backyard crawfish boil and this place made it easy and affordable to do a large ta","useful":3,"cool":3},"RUckxJMjuLW3E4FufUqLng":{"text":"My best friend and I were told about this hidden gem during our trip to New Orleans. Y'all","useful":0,"cool":0},"VrDYQSDzwcmvrqf0-elDuQ":{"text":"Okay... Fine it's right under the I-10 overpass, and looks like a sketcy neighborhood, but","useful":5,"cool":0},"whx_u4UFA9eVUd0xgNpVKw":{"text":"This place is always so so good. It's packed and you always walk in and you think it's a j","useful":0,"cool":0},"ghhDJZUT2RbK0hyPH4yDnA":{"text":"Taste: 5\nValue: 5\nService 4\n\nKnow this: Cajun Seafood is not in a safe neighborhood. If yo","useful":1,"cool":1},"jChTG4bGCSOgsuVvmAShDQ":{"text":"Our first stop for lunch\nBags of boiled crawfish and \nJumbo shrimp- so good!","useful":1,"cool":1},"qtUhNIjngHZXz75Jgavpmw":{"text":"This place is in the \"hood\" of NOLA, a bit sketchy but hey I wanted crawfish so I could ca","useful":1,"cool":1},"dNuhacig4-dVw-DyTLABkA":{"text":"Having a hankering for a crawfish boil, and being sick of all the French Quarter overprice","useful":4,"cool":1},"rkU7XJALenZn2mkYGcH36w":{"text":"We stopped by Cajun Seafood for lunch because we simply had to get some fresh seafood befo","useful":2,"cool":2},"b13OHFOBm-DQnCPus_DyTg":{"text":"I love this place. It is a no way for you to see in there is limited space to park. It is ","useful":0,"cool":0},"P0zcWLfOXNfn_mAoGNeDLg":{"text":"It's not in the best part of town..however the food was delicious and very well priced. 1 ","useful":0,"cool":0},"YpWNGv__kSny-HCNI2RvZg":{"text":"I came here for dinner on a Friday night with a group of 5 people.  We ordered 2 pounds of","useful":2,"cool":2},"Nt6erFG5Bm7tGzYvziT9EA":{"text":"Can you come to California, thanks?! The the gumbo and shrimp boil was to die for. If you'","useful":1,"cool":1},"s5ciQh6xvy1H7F0-AzEY7Q":{"text":"Amazing po boys!!! Our Lyft driver recommended it. It was off the beaten path from the cen","useful":0,"cool":0},"ia0zBQgYc_NrcCOz5XsVow":{"text":"I came here for a quick snack before dinner -- ordered a pound of crawfish to share. Crawf","useful":0,"cool":0},"vhsDIV9fZEU6izTwwke5cA":{"text":"Another great soul food spot in the hood run by the Asians . \n\nExcellent boiled crawfish (","useful":1,"cool":1},"upq8_L523c9aMYmaQvJKPw":{"text":"Got the Redfish and it was frickin delicious. Good vibe at this place. Not too plain but n","useful":1,"cool":1},"2mzT7ubH_btpcFSxOyEApQ":{"text":"Sometimes the messier the food is the better it'll taste. I don't know if that's true as I","useful":0,"cool":0},"a20ESTonuA4gF3FisHjOLA":{"text":"Don't f**k around! \nJust head straight here for the spiciest yet tasty seafood in New Orle","useful":2,"cool":3},"p9snrq9XCsf08tayu9EGKw":{"text":"baaaybay the food here is so flavorful when I'm intown this is a spot to eat at for seafoo","useful":0,"cool":0},"sXsUd0CV5l1Or1yM_QxyNA":{"text":"We learned this place from our tour bus driver.  We got one lb of boiled craw fish first t","useful":0,"cool":0},"nmdSy54mjyO7If6w3-WchA":{"text":"Hands down, a must visit! The food is fresh, it's affordable and I would come back alone j","useful":3,"cool":2},"tYPE70xATotuOO-yNF1W1A":{"text":"The ultimate place to go if you want some no frills seafood.  Order at the counter, get yo","useful":0,"cool":0},"-QsqnyhK2Wa8ff2gXRGmpQ":{"text":"This place hit the spot. I am obsessed with crawfish and the spice is important. I was kin","useful":0,"cool":0},"yosfV4ElWJ1spCdohSpLsg":{"text":"Can't go wrong with the large boiled shrimp and some boudin. It can get very messy so wear","useful":0,"cool":0},"jwm5VI5X41lN5iHRMRXI9A":{"text":"I  go to the cajun on Washington and broad. Cajun seafood, in my opinion of being in new O","useful":0,"cool":0},"R8dFLmGTulNlA6X-LFE96Q":{"text":"This place does not look like anything special when you walk it. I had older family member","useful":0,"cool":1},"_vjR2fR1R0mGT8VVNN7Dnw":{"text":"This place is super casual, a bit off the beaten path.  It has boiled seafood, Chinese foo","useful":0,"cool":0},"AR_-ieHnKXdXTy2ToFWPOw":{"text":"Food was so good i went to eat twice on my weekend in NOLA. i got the GUMBO and it was AWE","useful":1,"cool":0},"SZ7b_ZkTHaj_japhsYE-BA":{"text":"Unfortunately, it's not in the nicest part of town but definitely worth the stop if you ha","useful":0,"cool":0},"gI25mHa1_eHrEuQCU_hhyQ":{"text":"5 star place to have crawfish & boiled seafood. We waited half hour to get in but it's tot","useful":0,"cool":0},"ghG2e0qx_ytVHB_ZIfHrfQ":{"text":"OMG! Damn! If they only shipped around the country. This place has the best crawfish I've ","useful":2,"cool":1},"KDrKBNgI4G4bkUB-GnpLtQ":{"text":"Although it's stated that they close at 9:00pm, I came in town mainly to come here to get ","useful":0,"cool":0},"uGbAnVRzpbwkmwdyhDETtg":{"text":"If you aren't afraid of the location. FIND THIS PLACE. EAT HERE.\n\nOk...This is a \"To be ho","useful":4,"cool":0},"8BYAjlWWHOn-1jMGPtYejQ":{"text":"DELICIOUS, CHEAP FOOD! \n\nIf you're visiting NOLA, you must make a stop here. It's only abo","useful":1,"cool":0},"ZgnQ9EZZu47QWq4yX1bcIg":{"text":"I come to NOLA at least 4 times a year but it's more like 10 & I have eaten plenty of seaf","useful":1,"cool":3},"AApfMn0yhht30gmzLl2Zlg":{"text":"EXCELLENT!\n\nFor their prices they are beyond great! I spent a month in New Orleans and ate","useful":3,"cool":3},"Wgvt2LgXXAYVU872evrhpQ":{"text":"Seafood, done right! Flavorful with spice, but not too spicy. Season is not in full effect","useful":1,"cool":1},"WuBt0zujBqjMFnMeCVJddw":{"text":"Went here during lunch hour, I was surprised it was not pack. Usually there's a long line ","useful":0,"cool":0},"kB1XbAmiGapfHazOaW65AQ":{"text":"Came here for lunch halfway through our NOLA trip from STL. This is a tough one to review,","useful":2,"cool":0},"kvmQlMOCBygtEW36NeBa1A":{"text":"Must get that turkey neck. It's not an option. The crab and crawfish where great. The pric","useful":0,"cool":0},"t6QhjMvS6iu8wPmNknPxrQ":{"text":"If you are planning to visit NOLA, I highly recommend that you check this place out. You m","useful":4,"cool":2},"gYe4JxAVFTZOhI4wcay-_Q":{"text":"Hidden jam of NOLA. I loved the shrimp & catfish platter: it came with potato wedge salad ","useful":0,"cool":0},"rOeF2NeupLjkrBFNjwihhg":{"text":"This place was 0 for 2 for the boiled shrimp and crawfish. They were both way over-boiled.","useful":0,"cool":0},"dLG82hL9V6alRQWUcsJ0cw":{"text":"Wooooooo baby this is some heat right here! I'll be back for sure! I recommend the crab an","useful":0,"cool":0},"lK0q0GnobgM021CAPOWCxg":{"text":"Seafood was amazing!!!!!! Had to bring some home  to eat for later !!! When I pulled up I ","useful":0,"cool":0},"KyBqjk2WQb7bfWNF2G1gxg":{"text":"Wow! Outside of the crackhead ogling my 13 year old, and how ghetto this neighborhood is, ","useful":0,"cool":0},"SbLKA_Vui3DgNu_3qmwLcg":{"text":"I ordered 1/2 pound of crab legs, 1/2 pound of shrimp and 1/2 pound of crawfish for 18 BUC","useful":0,"cool":0},"XFffFTprWAGU1fOQEFnAAQ":{"text":"Before you enter here, I must mind you if you are looking for an establishment where the w","useful":2,"cool":1},"12GXyQMSYbEx5JqQpPgpPg":{"text":"What a great local gem!! Our Lyft driver Tyme told us about this place. Thanks Tyme!!!\n\nPa","useful":2,"cool":1},"rQtaV_67J7EMMraqq8Xikw":{"text":"Amazing food. After reading the reviews I expected a small dingy place, but it's actually ","useful":0,"cool":0},"5XZ330mIKooZcdrijUSXnw":{"text":"I got like two turkey necks, a pound of shrimp , a pound of snow crabs, and a shrimp po bo","useful":0,"cool":0},"Q_Na3k5Dehlc06q1ficitw":{"text":"Hands down the best and I mean the BEST PLACE TO EVERY GET YOUR CRAWFISH AND PO-BOYS FROM!","useful":1,"cool":1},"EwyaVNz0Hqul-m4wr_C3hA":{"text":"It was my first time in New Orleans and I was told that this was THE spot for crawfish and","useful":0,"cool":0},"_rCxDt25VKgvIo9cyNI4EA":{"text":"Hands down THEEEE BEST FOOD I HAD while on my trip! So good I made it a point to go back t","useful":0,"cool":0},"lTn3_k_-rB694koChxo15g":{"text":"FRESH SEAFOOD! Crawfish was the best I've ever had, great cajun flavor and fresh. Shrimp w","useful":0,"cool":0},"88Zaf6Kpgk3isNOMZ3fcmA":{"text":"Authentic. If you're from the Bay Area and you've eaten places like Kickin Crab or Boiling","useful":0,"cool":0},"CsrBguHcGlXFbc2dyTF71A":{"text":"The BEST crawfish and crabs in New Orleans!! \n\nI was here visiting some old friends. My fr","useful":1,"cool":0},"7U2YzkT7X0mOv8abBflRgA":{"text":"Not fancy, just a counter service seafood market where you grab and go. \nAte about 4lbs of","useful":1,"cool":1},"-rTV08xF26g8nk5LuqKWIg":{"text":"Had high hopes for this place after reading the reviews. I ordered 3 lbs of the Cajun craw","useful":0,"cool":0},"gHCdHsHlwFy0IhvD1rf2DQ":{"text":"Wow!!!! I just had a feast for about 10 bucks. I had a huge portion of spicy crawfish, a h","useful":1,"cool":0},"Nkmam8gQMfNkQfdD2ry0gw":{"text":"This place hits the spot! Their seasoning is my favorite one out of all the other places w","useful":0,"cool":1},"ODxLg5l4s12ZvAlpMaTciQ":{"text":"This place has been here for as long as I can remember. Right down the street from two maj","useful":2,"cool":0},"3TXMuImKCMbHokVTASNggQ":{"text":"Very good spot to grab and go or you can eat there. Will definitely be a spot to come back","useful":0,"cool":0},"sBdFkhSki_c37_tRw8UoIw":{"text":"Best place in the city for boiled seafood. Buyer beware though...they don't cater to the w","useful":7,"cool":1},"2qxs1VkjGXh_M6IQv4LCWg":{"text":"One of my everyday stops when I visit the NO. I've been coming here for years. Every time ","useful":0,"cool":0},"hgVSwtf3azbEWHjBH-MiYA":{"text":"Love it, I ordered crawfish, large shrimps, snow crab legs, \ncorn, sausage, corn is my fav","useful":0,"cool":0},"vtE5ofsaIZOQFuPbTV_Jtw":{"text":"This is not like Boiling Crab or anything. It's not bad but I wont be going back. Everyone","useful":0,"cool":0},"RWZUmfUbPhYs7d2rKDSdgA":{"text":"Best place in New Orleans !!! Not too expensive and very good!!! We had the sausage potato","useful":0,"cool":0},"ZAf-UHapN5g18VByyfBYvQ":{"text":"Four of us stopped by for lunch.  We tried the crawfish with corn and potatoes, turkey nec","useful":2,"cool":0},"iJd4FYzIhF1okv4xR3sTyQ":{"text":"One of the best dinners I had in NOLA!  We walked from Canal street and it took us about 3","useful":1,"cool":0},"OhABRepcnOs3-8QS7YpKUQ":{"text":"Where do I start! This little place is like 4 things in one! A liquor store,seafood,Chines","useful":0,"cool":0},"FWOelHdJOGNxG1Y6P9kRWw":{"text":"We stopped by Saturday and ordered shrimp and oyster poboy which was hot and delicious. We","useful":0,"cool":0},"IlcVhnNYMqe0L3rUZr-FTg":{"text":"My friends and I were in search of a seafood restaurant that would truly capture the essen","useful":2,"cool":1},"evVkTbjRoCqiMiVZZU6LGA":{"text":"OMG, delicious! This was our first meal in NOLA and it delivered. We had a pound of crawfi","useful":1,"cool":1},"hFTTLYzpF7LYEtQ0rf8hlw":{"text":"Three words: salty, rude, and overrated. The place is always crowded which is a surprise t","useful":2,"cool":0},"MTIp1kxgLPABObps-XxOnQ":{"text":"This location has a market restaurant type feel. You can order raw seafood to take home an","useful":4,"cool":0},"Lnj9tlVZb-rJjKHGNgzvJg":{"text":"Holy, Good God Damn! This place is literally and figuratively bonkers! We stood in the lin","useful":1,"cool":0},"dc4fndMXYz4A_45dWBVcSQ":{"text":"Spicy should be printed in bold. \n\n- Staff is nice \n- CHEAP!!!!\n- no long wait \n- I advice","useful":0,"cool":0},"HmiR03jnrhQWbrGKiuQINw":{"text":"Awsome food, must try the turkey neck and sausage ! Friendly service and can't wait to com","useful":0,"cool":0},"rgwsFxOgQZPQjbTKIeYbtg":{"text":"Their crawfish doesn't taste the same, they added a sweet taste to it. I'm not a fan but e","useful":0,"cool":0},"LUqBiE_LSEB5ac7gK0kOlg":{"text":"Seasoning was overly salty for all the dishes I tried. The snow crab legs, shrimp, pork fe","useful":1,"cool":0},"DZhertLNDltFpwG5QQmdYw":{"text":"take me back to new orleans just for this food!!!!!!!!!!\nthis place has everything! i mean","useful":0,"cool":0},"O2CGOS3yFUOTjyMeyvgOGQ":{"text":"Everything about this place is so dope. The locals love it and I was impressed with the cu","useful":0,"cool":0},"_H3oKZVk0IW8bs0ZiQFoOQ":{"text":"Food is great, ambience and customer service is much like their restroom....crap!  As part","useful":0,"cool":0},"wOO9VqvWmwXh68Y4GMVBSQ":{"text":"The food is to die for this, place just needs a tune up and maybe some better coordination","useful":0,"cool":0},"Hrfqye58M7RvKkTLIbOInA":{"text":"It was OK. I expected more considering it being NOLA but I've honestly had better crawfish","useful":1,"cool":0},"FDHMQfP4A8L7kXe1Q7Xk3g":{"text":"i can't believe the locals have been keeping this chain all to themselves. i'm so mad at y","useful":0,"cool":0},"kXgN4N_t5U1Sb8BDoUL0Rw":{"text":"Crawfish was horrible! Salty, not spicy and was previously frozen. The horror! How come we","useful":2,"cool":2},"lzyqdGrLUEXPqx22dYwVLQ":{"text":"This place hit the spot after a day of drinking in the French Quarter. We had a little bit","useful":0,"cool":0},"1r_xiuAH03jbOwhv84TidQ":{"text":"A good ole seafood boil was one of the main things I wanted when visiting NOLA and this pl","useful":1,"cool":1},"lnnPdlpbWGgK8AUwVGZy-A":{"text":"Amazing boiled and fried seafood. Had some of the very best blue crabs and fried soft-shel","useful":1,"cool":1},"6OibHndpSwtDMio4GxxzCg":{"text":"Trekked down to this spot from the warehouse district cause my AZ nephew said it was the p","useful":0,"cool":0},"2qXqTvGDHSmzGns71BiiOQ":{"text":"All orders are to go. Got crawfish, shrimp and crab. 1lb of each us enough for 2 people. V","useful":0,"cool":0},"zEijQpYGpX3Mki7ZZ5L54w":{"text":"Super thankful for our uber driver, who recommended this place to us. A local favorite and","useful":0,"cool":0},"GwEG5r_vSxBjQl26yYrmyg":{"text":"The food has been official since I first came here over 10 years ago. Boiled corn is a mus","useful":0,"cool":0},"xR_ZmpgpO2_4DYkOX0E2pQ":{"text":"THE BEST gumbo place in Nola. I'm a huge fan of gumbo and I order gumbo for every meal whe","useful":0,"cool":0},"PRgxUCGtpOlNFN_WigpEVw":{"text":"I ordered a small catfish poboy and a leg n thigh. The flavor of the catfish and dressing ","useful":0,"cool":0},"UtC3ngfrxxOPgcYejOqdBg":{"text":"Visited while on a quick getaway. The absolute best crab legs I've ever hAd. Make sure you","useful":0,"cool":0},"Yi351-NQBc0C9Qsj0-X8Xw":{"text":"Not what we expected we walked up and the sever sneezed all over the open food. Food was b","useful":0,"cool":0},"63Q6pwDmVTNgOu64SN2JNA":{"text":"Sooo good. Every time that I've come here, no matter if I'm getting seafood or something e","useful":0,"cool":0},"USPt-qYSzHLnPyLAoLqzwA":{"text":"While visiting New Orleans for Mardi Gras we wanted some good ole crawfish !! So after a f","useful":0,"cool":0},"9yxxjDcbgOeCLAwXII6KHw":{"text":"Mannnnn, this is a gem. Well I can say my seafood broil craving have been satisfied. Food ","useful":1,"cool":1},"vEM3Sw811kcmAc-_znSb9g":{"text":"If you want crawfish and crab legs this is the best hood spot that you'll find. With an as","useful":0,"cool":0},"UJhS5ahrXkj5tuE-RpWBAg":{"text":"First food stop after arriving in NOLA, and probably the most authentic places I went to o","useful":4,"cool":2},"zLMA9XgP0Tj31kGobcKSXA":{"text":"It's definitely not your typical sit down restaurant as it gave me corner store vibes but ","useful":0,"cool":0},"CKGH1yq9R3Ebabg6YGOMSw":{"text":"The location is a little sketch at night, and the line fills out the door with a security ","useful":1,"cool":0},"sPFiQyZiYCX7GtEwvKOwZA":{"text":"This is hands down the best place for crawfish!! I ate 2lbs and had to go back for more.. ","useful":0,"cool":0},"On6wxA1YELWvGY1gy_ZGaQ":{"text":"When i say good I mean good. The seafood was off the chain. Hot and spicy just what i want","useful":0,"cool":0},"V_3NMtCDINd4tE4qScq84A":{"text":"This place is a little rough around the edges, but man if you get past that- the crawfish ","useful":1,"cool":1},"ftdJc10jpCZucAz5tkDVOw":{"text":"My oh my.  Have I found heaven.  From Cali to New Orleans.  It's a must visit when you're ","useful":0,"cool":0},"Joxiio5shcBVc3hHcZN6gA":{"text":"My first time trying this style of seafood boil.\n\nOrdered the crab, shrimp and crawfish, g","useful":3,"cool":2},"hLmKdXoW2W8EI-xqEzmq6Q":{"text":"I have been going to Cajuns for years and yesterday 3/2/19 went in to get our usual crawfi","useful":0,"cool":0},"yeVdNkiIxgspMdfLvNEIYw":{"text":"Food was pretty good. This is not a friendly place and I'm not sure if it's because of the","useful":0,"cool":0},"AcdlyMdsJTIRCeq9wLp3ZA":{"text":"My friends and I visited Cajun Seafood on a trip to NOLA in February 202 (right before the","useful":0,"cool":0},"0okN1MKwwKenrUgBfJQrDA":{"text":"When you go to New Orleans and want something to eat, you expect a certain standard from y","useful":2,"cool":0},"NbQXsKany4oUXV_U10-ACA":{"text":"Hood places are the best!!!! You buy. We fry kinda spot. If you're not faint of heart then","useful":0,"cool":0},"sBQ5bTq2Ns3q6fuN0kWfZQ":{"text":"When I asked my Uber driver for crawfish recommendation, she suggested this place. Can't g","useful":7,"cool":3},"R_FMo7l838zj1vQqH_zcig":{"text":"Amazing food!!! Went based on all the local recommendations and wasn't disappointed at all","useful":0,"cool":0},"vit9X-KOHOww_2tAVFHKSA":{"text":"...... I've had way better, as I'm a local. We purchased 7 lbs of crawfish, potatoes, corn","useful":0,"cool":0},"Lj8BmCWnNZTitEDoJu9u7Q":{"text":"A very good and tasty authentic seafood restaurant- the gumbo is great and so is the crawf","useful":0,"cool":0},"7WPN0zOBfbahsEfAk0Vw-g":{"text":"Came to this spot for some shrimp and crawfish. The crawfish boil is delicious and juicy. ","useful":0,"cool":0},"e8MLcnIvqWdXKBTnrzlNzA":{"text":"Disappointed more than anything. Food wasn't terrible HOWEVER, if you've ever had a seafoo","useful":0,"cool":0},"EaB4wrEHTyHI2Qk8OLXhMg":{"text":"Love this place. When I return to the N O I will come back here. I had the crawfish and sh","useful":1,"cool":0},"GmrhPE3_czLaWjkSudXtAA":{"text":"Great seafood boil at awesome prices. Their boil gets a huge amount of flavor into the cra","useful":0,"cool":0},"X4eqJoA7Kow1m8KcES0EdQ":{"text":"Louisiana's version of Timmy Chan's.\n\nOn the way out of the city we were running late but ","useful":7,"cool":3},"7sGG-jLkMYvkjZnlqnIPSg":{"text":"I give this place five stars. It is fresh seafood if you go during season (March through J","useful":0,"cool":0},"5fJ_GJkUAWNky_9eJCNkTw":{"text":"Not for the tourists but more so for the locals. Definitely a one and done for me. The foo","useful":0,"cool":0},"3lhYdUAyE4FhRCMTaWikYg":{"text":"My husband and I ate here while visiting from Miami. The food was amazing!!! We had crabs,","useful":1,"cool":0},"yzXhlNLOcxB4Xpi4RiBN7g":{"text":"So this place is packed and I hear mainly because they take food stamp cards but there wer","useful":0,"cool":2},"Ye0mMDNfF17VnVFSfzCikg":{"text":"I'm a gumbo snob and this is hands down the best gumbo I've ever had (aside from my own). ","useful":1,"cool":0},"Ja5FcEvKdY-d2nDz_huByQ":{"text":"Tasty seafood for an affordable price. You can't beat that!\nI had crawfish, spicy shrimp, ","useful":0,"cool":0},"21xgxBxtZESgD-_tIUVVWQ":{"text":"Came here looking for some GOOD seafood. \n\nOrdered a pound of crawfish which was overcooke","useful":0,"cool":0},"XXxk2cwD4ot6a7_KDbWRBA":{"text":"by far THE-BEST-FOOD!!!!!!!  Highly highly highly recommended.  I love food but I'm the ty","useful":4,"cool":0},"OYowNve1lX5sKBrsukd-Gg":{"text":"DON'T JUDGE A BOOK BY IT COVER!!!\nIt's a Sunday night after the second line and this place","useful":5,"cool":1},"Dv8xpAdYA5GoPItI_xcjUA":{"text":"Cajun Seafood is insanely popular. We arrived at Cajun around 5pm on a saturday night and ","useful":3,"cool":4},"IibPRvZ-nSzONhwXwnBUQA":{"text":"I rarely give bad reviews for restaurants but this one is truly bad. I came here out of hi","useful":2,"cool":1},"rqXmjS15U8bNs2-k1g9H7Q":{"text":"The bag o' shrimp we ordered was seriously the best food I have ever consumed. Somewhat sp","useful":0,"cool":0},"Ffjml0rLhVmdRCrHawWrOw":{"text":"So freaking yum! When I first got to NOLA I immediately started asking locals where they g","useful":16,"cool":13},"E_ymgLpn3RFc_l7g4McY4g":{"text":"I went here twice. Once for shrimp poboy and the other for crawfish pie and gumbo. Gumbo a","useful":0,"cool":0},"1zed6HPk27oGXWLm8W_z3A":{"text":"What can I say the food was great here. I took my wife to New Orleans for her birthday. We","useful":1,"cool":1},"BCi6__ukxfec-gYE9yPQGw":{"text":"I am unsure what to rate Cajun Seafood. Maybe a 1 because of the incident, maybe a 4 for t","useful":3,"cool":0},"oXxqWmIBnPaPDPoetUPcyQ":{"text":"The food was excellent!  Local seafood cooked with great flavor. If you want to experience","useful":0,"cool":0},"qDC--vvQ1jSHL-umSVEz1Q":{"text":"Ordered CHICKEN Yakamein it was good until I noticed beef in it. I haven't eaten beef in 6","useful":0,"cool":0},"peWhn60wI2EOE5aq_MeTwg":{"text":"I'm in New Orleans 2-3x a month for work and visit every visit. I have eaten just about ev","useful":0,"cool":0},"buXSb9P6JNmzoj2QsGnm4w":{"text":"A little overhyped for what it is. The food was fine. The crawfish and shrimp could have b","useful":0,"cool":1},"gCIkyetvJXtrhOmMsTJkHQ":{"text":"We ordered boiled shrimp, crawfish, soft shell crab, snow crab and dungess crab for take-o","useful":0,"cool":0},"xLjsfFNT7IP0O-k0E6iGyQ":{"text":"Come prepare to put your hair up and get your hands dirty. You place your order at the cou","useful":0,"cool":1},"7nJb_af1Uz3oy7QLm-8fiw":{"text":"I visited in New Orleans, and visited in this place because my friend strongly recommended","useful":1,"cool":0},"0yX7PkITZpf0oe4llEKurw":{"text":"Love this place! I have not been in a while and I am glad they have someone to clean the D","useful":1,"cool":0},"4iRGav6YsePAT-16Lia2Dw":{"text":"LINE OUT THE DOOR WITH GOOD REASON! I literally stood in line for about 35/40 minutes for ","useful":3,"cool":0},"5x59-KrzSEtmzzzA1qVNTA":{"text":"I am beyond disappointed with my meal (10 piece wings & fried rice). The chicken stinks (s","useful":0,"cool":0},"6b-I-kzXfy4ZwGpft3k2Fw":{"text":"Very casual, hole in the wall type of a place, but very good food. Had the crawfish, shrim","useful":0,"cool":0},"xcDwHJE4qOdosc5SVB9BRw":{"text":"Catfish tasted like ocean water with doodoo in it. Everything else was extremely delicious","useful":0,"cool":0},"J6QM0h3BcP3PsnoNAVU0og":{"text":"The food was great. We ate there twice in 3 days. And even bought some fresh shrimp to bri","useful":0,"cool":0},"lIlEKwNC54Msy7HdV-ZhBA":{"text":"I was referred to this place by a local friend and it was by far the most New Orleans -ish","useful":0,"cool":1},"YMWnBYvb1SjkWmdGLjfeTA":{"text":"This is the BEST crawfish location in all of Nola.\n\nWe went for a bachelor party to Nola, ","useful":2,"cool":1},"kZw0-A3wbjBbFbzd7ylxZw":{"text":"First thing I did after landing in NOLA was go for my first crawfish boil. My friend alrea","useful":7,"cool":3},"UA4qG4N7iqG_pYw20fAcRQ":{"text":"Hands down my favorite restaurant in No la. If I could eat here everyday, i would. We trie","useful":0,"cool":0},"JKr5rweWqFQPUN91kQjHQA":{"text":"Believe the hype. All of it. Just. Go. Now. The line is extremely long but moves pretty qu","useful":0,"cool":0},"YZBEat1woifzHgryyi3YSw":{"text":"Went to Nola for the weekend ate here twice it was definitely a buss down! I had the trout","useful":0,"cool":0},"tpiJeLDj2ENpl0liX1HQ_g":{"text":"Wow! This shabby place had the best crawfish I've ever had. I'm so happy I came here, the ","useful":0,"cool":0},"Auftk3X4sxR8QX8xPWhWmg":{"text":"Amazing food great flavors!!!! A mouthful of goodness. You will not leave this place hungr","useful":0,"cool":0},"NubTn3JBqgwcOvMvmsrGkg":{"text":"Yo NY we gotta do better with our seafood spots yo! Out here the crabs, shrimp, and crawfi","useful":6,"cool":6},"qqjJ9pFLn99V0T_qYs0fAQ":{"text":"Such a great local spot! \n\nI was tired of going to the restaurant in the French quarter. I","useful":2,"cool":1},"HG_8Xitdua9W0mAt7GG8-A":{"text":"It was ehhhhh.... I was truly excited to try this place on my most recent visit to NO. Wal","useful":1,"cool":0},"gLUZ7oV8FRmBuofO8LYJXw":{"text":"Good crawfish place and very clean... my mom had turkey necks which she said was really go","useful":0,"cool":0},"NkoOeDJwCF-H5v6qkeWGnA":{"text":"I liked that the restaurant has great food and prices. Everything I ate was delicious. You","useful":1,"cool":0},"6SbZJk8ZZpY2ElYyB6IFIg":{"text":"Very excellent fried catfish dinner. Fish coating had a little kick. Fish was hot and done","useful":0,"cool":0},"vNtjdJXqgHYxMK1SM3q4-Q":{"text":"Oh man this place is sooooooo good. I came here after a review for it popped up on my feed","useful":12,"cool":11},"oNZ2gEN5G6woIfficwT82w":{"text":"We stopped in on 01/03/15 and ordered house special which was really filling. It had shrim","useful":0,"cool":1},"6_FdwOL9dmLHBxfyJwOlMg":{"text":"Bomb!!! Flavorful + perfect amount of spice and boiled perfectly. Not heavily crowded or t","useful":0,"cool":0},"eI9h9PkVQD5T38HrG57PnA":{"text":"Food is delicious. When they say Cajun they mean Cajun. The flavor is out of this world.","useful":0,"cool":0},"ImDTo0034WJsfqMEdHjxjA":{"text":"Huge portions, you've been warned, so order accordingly.  An interesting mix of Asian/Mexi","useful":0,"cool":0},"Km7FzyUTd6A9s2P9pmcd9g":{"text":"This is the only place I come to for seafood when I'm in NOLA. The seafood is boiled to pe","useful":0,"cool":0},"CfdQ6PqgETg1nzEOBbKCrw":{"text":"Hands down, best meal I had in NOLA. Awesome Cajun boil concoction threat they cooked all ","useful":0,"cool":0},"yqpinTvfTI25eF_0FGtjfA":{"text":"This place is sooo worth the wait! I was visiting for the weekend and knew I had to try th","useful":0,"cool":0},"yB7UdzBS477glu8Ag7xnDQ":{"text":"a staple go to when im in new orleans! always get crawfish, sausage and a pigs feet! the b","useful":0,"cool":0},"CEKFV04_uzJmm-P4b3g9fg":{"text":"This is a tricky review because in spite of all that went wrong, I thought the seafood was","useful":7,"cool":4},"s2eZn0GQfJjt_S38_-TY_g":{"text":"This game Highly reconvened by the locals of New Orleans, when we arrived it wasn't the re","useful":1,"cool":0},"dGmtVPY9awJoJwYI3da4Xw":{"text":"This is my favorite spot in New Orleans, every time I drive through New Orleans I stop her","useful":0,"cool":0},"3mo-x3oKcb_a0h7qMtxl7A":{"text":"4.5 stars average?\n\nI don't get it. \n\nWe ordered the crawfish and it was salty, soggy and ","useful":0,"cool":0},"Nz7BwDgASGWCoL_nN8kwaA":{"text":"It's not the easiest place to get to if you don't have a car and it's raining. I took the ","useful":2,"cool":0},"zQ1lrX3ZFuCx4iKLpABjDg":{"text":"Wow!  I had one of the best crawfish here and its cheap!  You can't beat that!  The prices","useful":3,"cool":1},"1xzeAw5WswT4ahqoXfjJNw":{"text":"Don't let the interior fool you. We stopped by this restaurant on our way back home and I ","useful":0,"cool":0},"k3YD8i9b4EJKC1L2eSvhPg":{"text":"Awesome food! Definitely a local hot spot with almost no tourists. They serve you on the s","useful":0,"cool":0},"F6MuGvlOfLxL_yUjhBeMmg":{"text":"Price vs value this place is very good. It's probably the most authentic Cajun Creole expe","useful":1,"cool":0},"fFF-_yaMZ_b0lrWeWwuEGg":{"text":"Great place full range of fresh or boiled seafood. In particular we are fans of the seafoo","useful":0,"cool":0},"f6hB2cyY2Svjby3bvkC-YA":{"text":"Yet another gem in NOLA that isn't one of the main touristy spots...\n\nThis is under a big ","useful":1,"cool":0},"XBa4JMgJyy12k8hRhsxyQQ":{"text":"Definitely not talked about enough when it comes to tourists stops. \n\nI had a weird feelin","useful":2,"cool":1},"tD2bS7WbOadD_aOxmtFpng":{"text":"They have the best seafood you can get it at a low price very fast, very flavorful,  and v","useful":1,"cool":1},"YXfiTlJ3LYwYkDW4iZukoQ":{"text":"Best Cajun seafood ever! Would definitely come\nback again. Lots of locals come here and th","useful":1,"cool":1},"GTqkfY6wnKgXLXTU4fPrVg":{"text":"Lady at hotel recommended this place && the food was soooo good. I got the crawfish && it ","useful":0,"cool":0},"ts1XBhSk1WP8o6G3UiQQ-Q":{"text":"Food was good huge huge portions quick service they were busy we sat down to eat but there","useful":0,"cool":0},"7JrYXNRHYF8j5L95WrKErQ":{"text":"I think I had my expectations set too high based upon all the rave reviews I heard about t","useful":0,"cool":0},"7usiRCqspgAqfXegt3op8Q":{"text":"*****First Timers... Read This!!!!****\n\nWe had 4lbs of Shrimp, 5lbs of Crab Claws, Links, ","useful":39,"cool":24},"SMgHgVhyrr59GTVFAPncaQ":{"text":"Great local food at awesome prices. Absolutely authentic and loved by the locals because t","useful":0,"cool":0},"rf1O9hoPv-_RFER2llGfIg":{"text":"My favorite place and first stop as soon as I get into the city. The lines can be extremel","useful":0,"cool":0},"KWDyUXjv61CKzqRq7bLSkg":{"text":"My daughter and I stopped here for lunch today. I always see a long line here, always crow","useful":0,"cool":1},"31QixTtsAtyPBI_tT6g_2Q":{"text":"Cajun Seafood was SO good. On my visit the line was very long but it was definitely worth ","useful":0,"cool":1},"4w-N5bboHa48T1tzURBvBQ":{"text":"They have the best boiled seafood in new  Orleans,I loved the flavor but it's not at CBD a","useful":0,"cool":0},"8WMscfoa7oTVF2w9YgELIw":{"text":"So Rico Nasty posted a thread on Twitter asking where to eat in New Orleans. I saw at leas","useful":2,"cool":0},"gE_WGF8NpgN3BH4L4i_U2g":{"text":"The crawfish was really good here. There is nothing fancy about the place. The shrimp and ","useful":0,"cool":0},"xBqVBQoysE6hOF2r5M3JDA":{"text":"AMAZING! One of my favorite places in the whole US. Last time I came to NOLA, I ate here t","useful":1,"cool":2},"do7Cd7CraWlIrlfm30IuJg":{"text":"I heard about this place and I wanted something that was authentic as a crawfish boil I co","useful":1,"cool":0},"-R_CWXugA_UQ3rtIVu-uHQ":{"text":"This place is great! Was in New Orleans for 5 days and came back twice. The staff was real","useful":0,"cool":0},"ZdQtsg80p9QLB-UbUDatTw":{"text":"I really wanted some gumbo and boiled shrimp but I am highly disappointed, the gumbo is bu","useful":1,"cool":1},"qsswk53IVR9ddve4KqzBPQ":{"text":"Traveling across I-10; I made a point of stopping in New Orleans for lunch. This little ca","useful":1,"cool":1},"9_myItAS28-3GbGsXN4mzw":{"text":"This place has so many good reviews that I could not miss it during my time in NOLA. The l","useful":0,"cool":0},"UsvPkqwkgc1Tw3EF7h1V8Q":{"text":"I love this place! The food are super cheap and delicious! When I was in New Orleans, I ca","useful":1,"cool":0},"Ddf_HDbUaSAtLTjdqM0Mkw":{"text":"We got 2 softshell crabs and shrimp fried rice. It was perfect. We also got 2lbs of crawfi","useful":2,"cool":1},"6yYkRdSqEG679m7NGdSHFg":{"text":"The food was absolutely phenomenal. If you are looking for a New Orleans seafood experienc","useful":0,"cool":0},"rhN1ReCk9Omj_WUPawJTMQ":{"text":"Found this place by accident while looking for a spot to wait for the show to begin at the","useful":0,"cool":0},"lmHmQYXlk4nPYISyK_p3-g":{"text":"Wow, this is truly a hidden gem. \n\nA local bus driver recommended this place to us, authen","useful":0,"cool":0},"_1k3PAXSj7AQFvmDfQE16A":{"text":"Real deal in the hood if ya want crawfish crab legs gumbo they got it all... centrally loc","useful":0,"cool":0},"S5xkhHs2SOD_6RHAKmvfsg":{"text":"Food is good but their attitudes here really suck! The food is contained in I'm sure HEALT","useful":2,"cool":0},"s69OUUqgsImCa9fnAxm6_g":{"text":"Ate here last year. I ordered the Shrimp Po Boy n my friend had the Catfish one. I could h","useful":0,"cool":0},"cbiJS0D0jAUiybEFRIeJlg":{"text":"The best crab legs and crawfish I have ever had! I highly recommend this place if you want","useful":0,"cool":0},"l9E9yNAnaRQYG-XSqzoJPg":{"text":"This place was recommended by our Uber driver and thankfully we listened and stopped by fo","useful":3,"cool":2},"TAfnNjUc2zw2l0ncExgYAA":{"text":"Must visit when in New Orleans!\n\nDuring my three day stay I went there twice. Food is very","useful":3,"cool":0},"pippU3yCZjpuqOAW89-t7A":{"text":"Yummy, cheap, authentic cajun style seafood! At night it can be a little sketchy outside, ","useful":2,"cool":2},"Jhs7QGfQofoVm1FuSKCPBA":{"text":"I loved everything ! I had the shrimp and the shrimp Po boy. I ate here 5 times while visi","useful":0,"cool":0},"oHOicu-uJJpWLvkm8wVVMg":{"text":"Hands down the BEST cajun food I've had in Nawlins to date! Not only is the food aaaamazin","useful":2,"cool":0},"BFxIOQURmCCeJStMoGUwaQ":{"text":"You haven't done NOLA until you eat some crawfish. Luckily, my friend is from the area and","useful":6,"cool":4},"kFZ86yzN5eWKe0Vg-EblbQ":{"text":"Visiting NOLA I wanted to try the best Cajun food.... never did I expect I would get aweso","useful":1,"cool":1},"bw7qFTDShKRcrDNidQftFQ":{"text":"The food was great! I had the snow crab legs, potatoes and corn on the cob with garlic but","useful":0,"cool":0},"8Lhlz5p4hpImiLIZv1-uhA":{"text":"This crawfish has just enough kick, we ate 3lbs and wanted more so the next day we went ba","useful":0,"cool":0},"3eHsC0h0htVkknbnPlGEJg":{"text":"1  Star for service\n1  Star for taste\n1  Star for dietary accommodations\n1  Star atmospher","useful":2,"cool":0},"6W2YragmK7RiDloYxtfA7A":{"text":"3/5 it is what it is.\n\nthey serve up some pretty large (long?) po boys here - stuffed with","useful":1,"cool":0},"JyFl0lH1oNwMD-mUA0pG1Q":{"text":"We ordered boiled shrimp, crawfish, soft shell crab, snow crab and dungess crab for take-o","useful":0,"cool":0},"jDI86oVO5H1Oa0ElAtNR6A":{"text":"I was visiting for the weekend and was recommended by multiple locals to come here & I am ","useful":0,"cool":0},"yReFCmnoGw0XrMqokFIGpQ":{"text":"Seeing this place from the outside may have you questioning yourself...and once you step i","useful":1,"cool":0},"km7j_WtMTb-UrXxUGviYIQ":{"text":"Cheapest and most satisfying seafood meal ever. We came here under the recommendation of a","useful":3,"cool":1},"GjyYPk48NNhPepFkKIyBuQ":{"text":"The Sautéed blue crabs in Asian sauce was awesome. Also enjoyed the Boudin and the crawfis","useful":0,"cool":0},"jaD_DGQG4Lhg1dcBJIBWJg":{"text":"We got in line at 9:50am for Cajun Seafood after we got locked out 35 minutes before closi","useful":4,"cool":2},"xrcLDHGxbWtROZ28LD8lMQ":{"text":"Everything is good, not great, but solidly good.\n\nA wide selection of prepared boiled craw","useful":0,"cool":0},"7-LhWEYbwsx4GyvXBeN9hQ":{"text":"Omg I have to give you guys a review ... Their crawfish are to die for .. awesome flavor ,","useful":0,"cool":0},"7x15_K31JuzKDvEGh5oYCw":{"text":"I cannot recommend this place enough! I'll preface this review by saying I am by no means ","useful":2,"cool":1},"bPtqC9dNDkbNMME5IgcSjw":{"text":"Great boiled crabs!! If you like crabs, this is your spot. The neighborhood was a little q","useful":0,"cool":0},"-38rCtoNBHNTSOc-lbzfEg":{"text":"Hardly anyone in the store. Service was fast. Food was ok considering I thought this store","useful":0,"cool":0},"nvmc4enBwNE8AtBzK8MFWg":{"text":"Asked locals where the best crawfish was in NOLA and they all said unanimously Cajun Seafo","useful":2,"cool":1},"rnheDv53hQcUL0y-YIvS0A":{"text":"I needed some boiled seafood while down in NOLA this year (I love boiled seafood in a bag)","useful":4,"cool":3},"o8c4EhAW9LJjTb6DxiEpDg":{"text":"After reading all of the reviews, i decided to try this place.  I have to agree that the b","useful":0,"cool":0},"vSpcYwCrAZItx3jS4YcttA":{"text":"This is such a quirky place! When I first went in, I noticed that there are basically no t","useful":7,"cool":0},"pabYN3nf4EmRxq7iASZtQw":{"text":"Food was great and tasty.  Bathroom was the only downfall.  Where nasty and make you chang","useful":0,"cool":0},"UTexUvHpspHPD7aPkpUHtA":{"text":"When I need some boiled seafood this is the place I go. Great for shrimp, crabs and crawfi","useful":3,"cool":0},"bEiJhfvTQKH34-KZgzbCPA":{"text":"So bomb! We got the shrimp, crawfish, potatoes, and corn. All were amazing and cheap too! ","useful":0,"cool":0},"XKft7tRjJO1Z42QfQN66bA":{"text":"OMG this place was a seafood lovers dream. They had everything you could ask for if you lo","useful":5,"cool":4},"ZIJEp7_AyYKZyLmvEfICAw":{"text":"I love seafood!! In the last 3 months I've hit 6 seafood restaurants in 4 states.  I alway","useful":0,"cool":0},"-Zjbe6Wf4eaTH6WQ46I4pw":{"text":"My family and I went riding to New Orleans for a nice cool soft ice snowball from Hansen's","useful":1,"cool":0},"1Hp50hW4l9A0L_oTovTXHQ":{"text":"LISTEN!! If I can drive from Miami to here in 1hour every other day.. please believe me I ","useful":2,"cool":1},"In8QFaRSBnEXX_vJmj-VGQ":{"text":"Hands down the best seafood/crawfish in New Orleans. This is where the locals come to eat ","useful":0,"cool":0},"yZt4J4t6997bS9JdPB1vIA":{"text":"I love this place!  Every single thing I have ever ordered was amazing! Don't let the long","useful":1,"cool":0},"np0Fi1sNoiMuEP8qmPpnnQ":{"text":"This. By far. Is the best Cajun seafood I have ever had. \n\nIt was so good we went there tw","useful":5,"cool":2},"Tj_byq9BDUXe-qdzX37E7w":{"text":"Food was great. I love the seasoning to everything. The pig feet were spicy but just how I","useful":0,"cool":0},"_dVzjCaxPVtm3fPJm6OZ7Q":{"text":"We ordered 2 lbs of crawfish, 2 lbs of shrimp, and snow/Dungeness crab with a side of corn","useful":1,"cool":1},"QrVcFUIB2lZwj5Egk5bmzg":{"text":"Ate here last year. I ordered the Shrimp Po Boy n my friend had the Catfish one. I could h","useful":0,"cool":0},"UrFmHabUqnr2v4vhfsZknQ":{"text":"Honestly, if I could I would probably give Cajun Seafood 5 stars, have the review be simpl","useful":1,"cool":1},"3Vg_i29vbQG_Zmsp1DOPtA":{"text":"THE BEST SEAFOOD IN TOWN! Our uber driver recommended this place on the last day of our tr","useful":0,"cool":0},"FOAWmVTePF2g5kF66CUcRQ":{"text":"Had a delicious shrimp po boy with a side of Cajun fries. Very happy and energetic staff. ","useful":0,"cool":0},"kwrzL95NBj2dXYCY5hqbMA":{"text":"Grrrrrrl!!!!that turkey neck was soo delicious. the big succulent juicy boiled shrimp was ","useful":0,"cool":0},"_LwfjNzf7XDXHRXvYCpNdA":{"text":"Had my first gumbo here and wasn't disappointed. The prices here are really cheap and the ","useful":0,"cool":0},"1FQxpEpT5Et-VNOcTUr6dQ":{"text":"Its a local legend for a reason!  \n\nCheap, delicious!  If your up for a 3/4 mile walk from","useful":1,"cool":1},"bUa1LBKT6PtVgVRrN9HAwg":{"text":"This is pretty different from any of the crawfish joints in the Dallas area where I'm from","useful":3,"cool":2},"w1kA1iruRGGL6cSPFf8dZA":{"text":"This is the spot. It's the type of place you want when you want crawfish, spicy, flavorful","useful":0,"cool":0},"ba-ZRfQa2o5mOZsNnz1d1Q":{"text":"Hands down best Cajun seafood I have ever had!! The spicy crawfish, corn, blue crabs, hot ","useful":0,"cool":0},"9nWSu4XdNyB9KiTBaG_82Q":{"text":"Can I say this was excellent and far better than the fancy restaurants in the French Quart","useful":8,"cool":4},"rxBxsDrnhk4hP-womLPrFA":{"text":"Can you say shrimp pasta? Gumbo? Crab legs? They have it all. Every single time I come to ","useful":0,"cool":0},"oHSKPrmImm8gTIdd6hbgWA":{"text":"I really enjoyed the seafood here. I took an Uber as the restaurant is away from bourbon s","useful":0,"cool":0},"rwzHcTc2dLBMXwuzZjk7Bw":{"text":"My friend recommended this place for boiled seafood and this meal was the highlight of my ","useful":5,"cool":1},"NjDEsBVM8X-Vn0cP93167w":{"text":"I visited NOLA for the first time in July and found this gem while riding in an Uber. I've","useful":0,"cool":0},"iLaYjIQr4hYGTFgmRtWUUQ":{"text":"I found this spot on yelp and decided it was a must try. I went on a Sunday night; the lin","useful":0,"cool":0},"U38lFacvQLfTSFxHwKE0Gw":{"text":"Service here was fairly quick. I stopped in for a late lunch/early dinner. My mouth starte","useful":0,"cool":0},"qa8TJOMt9wqW9paZdVNJBw":{"text":"Wouldn't rush to come back again crab legs didn't have that much to me crawfish was fresh ","useful":0,"cool":0},"2HcdEVVDLTDBl_ugmc5WhA":{"text":"We went here after we read reviews of this restaurant. The price is indeed cheap. Shrimp f","useful":0,"cool":0},"3UgthqRrl-yWaT-qXQHT8w":{"text":"Here in New Orleans and was told this specific Cajun Seafood has the best Cajun & Creole s","useful":0,"cool":0},"d6E0uyK4hpqwp6ZX4d3EGg":{"text":"Not the best in the city but if your looking for a good crawfish &crabs they are I the top","useful":0,"cool":0},"OlbOIW8Th_PKGOMAgBX66g":{"text":"Who runs the world? \nGirls. \n\nWho cooks the best boil in New Orleans? \nCajun Seafood.\n****","useful":22,"cool":17},"pk5i7HpRJAbM3fAhXyqHGg":{"text":"I love Cajuns, I was recommended this place by a local last year & I've been eating here e","useful":0,"cool":0},"qpjusvI0uvMTIoUq5tSqBQ":{"text":"This restaurant was POPPING! Tons of people, lots going on, and as fresh as seafood can be","useful":0,"cool":0},"YDPGcLUstexeqcVDrRAktQ":{"text":"The seafood we got here was sooooo good. It was my favorite place out of all the places we","useful":0,"cool":0},"IRq9nHx5IX0eULRYvbXPuA":{"text":"Great find in NOLA. \n\nThis place has crawfish boil for CHEAP. Yes, it's not as amazing as ","useful":0,"cool":0},"jpNj7bmvs9qXokqKY235oA":{"text":"The food is really not bad for it's price, though it is in quite a questionable part of to","useful":0,"cool":0},"uvjCEFugvQBaAxYz3BKvzA":{"text":"We came for New Orleans Jazz Festival, on the way back home we stopped by this place for l","useful":1,"cool":0},"wh72zGj7eMu_0qPusVr6Bg":{"text":"If you want good, seasoned, inexpensive seafood away from the normal tourist spots go here","useful":1,"cool":2},"Zdi7U7TvVITJ0ESipIEQ2A":{"text":"This place is freaking amazing. Now this is authentic NOLA food! Crawfish, crab, shrimp, c","useful":1,"cool":0},"NNn0ITMO3CT0hnlNkBD33Q":{"text":"Super good,  super busy,  very organized.   They also have bottles of alcohol here as well","useful":4,"cool":4},"-sHq8t_kibUjqzj6RaOjoA":{"text":"Came in search of LA crawfish, and left very satisfied and not in the least bit disappoint","useful":1,"cool":0},"piC6qsp9f2ZG5mr4SyU4Pg":{"text":"Good crawfish and shrimp. Long lines during the day. Worth it!\nWe got 2 pounds of crawfish","useful":0,"cool":0},"MoFzJSP6ecwY8RUPTxx6fA":{"text":"This is my second time here, the food is amazing. If you are ever and I mean ever in New O","useful":0,"cool":0},"UnNXPL6BN1vbTtv9LdVlXw":{"text":"Honestly wasn't what I expected. The snow crab legs were watery and wasn't hot at all. Mai","useful":0,"cool":0},"PdAFICjGp5TMtTmPZ3vMuQ":{"text":"I'm from LA and this place isn't anything close to Boiling Crab. You don't get that nasty,","useful":5,"cool":2},"IdZIZFWRkDxSg_z1bc3DgQ":{"text":"Cajun seafood with a creole twist! The prices are amazing and the staff was very polite.  ","useful":0,"cool":0},"bBcUUD4uZ4pW55os6MHYbw":{"text":"Four stars ok honey! This place was a one stop shop for EVERYTHING. Want a bite to eat bef","useful":0,"cool":0},"3wGQ6nRuHLz_e0kICe6g2w":{"text":"Yasss baby ... (said with the the strongest Nola accent I can muster.)\n\nFrom the moment we","useful":7,"cool":7},"SlIFQ7IEMsMM0rG1bf_rng":{"text":"Great place for lunch, very casual - you order at register and served in takeout boxes. Th","useful":1,"cool":0},"tBF_8PTinvv7D4iDASt9Ww":{"text":"On our trip, we were asking locals and basically everyone where we could get great crawfis","useful":8,"cool":5},"wYHHPAEf9ewztujm5adDjg":{"text":"I can't believe I've never reviewed them. I'm telling everybody right now, GO! I saw one o","useful":0,"cool":0},"1CE7ZVcQtFQHsAp9q0mWXQ":{"text":"O M G!!! This place is Fire AF . I cant find my pictures when I do I will post them. I'm f","useful":2,"cool":3},"VtmRoO-4wXP9UBcflyxquw":{"text":"If you're from out of town and you need a real taste of New Orleans, this is the place.","useful":0,"cool":0},"aklQO4ChuvG1E-xSYSUwPQ":{"text":"This place right here? This place is what we came to N'awlins for.... we left the French q","useful":1,"cool":0},"UJ_rr3s1DDJ2I-CjarmKjQ":{"text":"The food is 10/10! So delicious and authentic. If you're not big on spicy food be prepared","useful":1,"cool":1},"71wZaPvG_3Gi3CtcmudJPg":{"text":"coming from LA, we are very used to \"Boiling Crab\" chain cajun taste. when we got here we ","useful":0,"cool":0},"0_q-E9GB892ypO4Mxlpo5g":{"text":"10/10 I loveeeee this place. A hood classic! They serve everything from boiled food to fre","useful":0,"cool":0},"ErjQyjRS7mfHwRqNdNM7mg":{"text":"4 stars cause even other restaurants will tell u to go here but they were closed on a Mond","useful":1,"cool":0},"E-MxUD5POQ7rhZQEpRB8Ug":{"text":"Fire! We are from Minnesota so we really never get anything fresh. With that being said th","useful":0,"cool":0},"ILVT8MWPoO-x0iSHQBICFw":{"text":"I'm in seafood heaven!!!!!! I love love love love it here!!!!!  Now I see why Louisiana na","useful":1,"cool":2},"O0FGndgrS_uV0NZ4eE-45w":{"text":"Came here just for the crawfish. They were good and spicy. Perfect size too. I asked them ","useful":6,"cool":4},"SIheKWg42DhMnRxQD_HRRA":{"text":"Doesn't look like much to walk by but food was really good had fried shrimp which was good","useful":0,"cool":1},"It9uiy3qwDqg1FKBNEFPNQ":{"text":"First time trying crawfish. It was good and well seasoned. Don't let the line scary you. I","useful":1,"cool":0},"vpN-7EHifSJZ92hNmpJ4yg":{"text":"Seafood for days, but oh so worth it.\n\nAmbiance - It's basically a order up front (beware ","useful":0,"cool":0},"l-HFlJSQtHwmWGY0bIZTyw":{"text":"The seafood was trash, the staff's attitudes matched the food, trash. The boiled shrimp wa","useful":0,"cool":0},"dJdbK0Wl_pRdMCvLgYzNmA":{"text":"Best crawfish in New Orleans!\n\nIt's my second time coming here. If you're looking for craw","useful":1,"cool":0},"uvv2tXFZwplzPjRUqRdxlg":{"text":"Came to NOLA and ate at Felix's on bourbon . It was ok. My friends Uber driver said this i","useful":2,"cool":0},"yKKQXpnLnV_6iyYEkhQf2g":{"text":"First time in NOLA and luckily got an Airbnb just down the street. Came here for a Soft Sh","useful":2,"cool":0},"m0_oKt3N5TKBbhLHrg3-gw":{"text":"Man oh man this spot has some fire treats. The gumbo was very tasty. The crawfish hit the ","useful":0,"cool":0},"2RyYFyGqmEjCNYB_abOrdA":{"text":"I was pleasantly surprised when arriving because there was pretty much no line despite the","useful":0,"cool":0},"FVflkGfl9e4q3NVRJNUVyw":{"text":"So, my husband has this thing for a seafood place in Baton Rouge that has crawfish, pigs f","useful":0,"cool":0},"PoINrNNEvjVu7fj15pLwKA":{"text":"Crawfish - YES\nCajun fries and corn were lacking. Fries were soggy. But the crawfish was a","useful":0,"cool":0},"eOgpEOEOsFqFMwR0qP9yuw":{"text":"For all the non-locals, If you are looking for good boil seafood, I recommend come here. S","useful":0,"cool":0},"v_PzzdwZJibUNlOSGyHH0w":{"text":"They are not playing with this Covid. If you catch it, you did not catch it here. They enf","useful":0,"cool":0},"Nf2njiv8T8nwtn5PKW8DPg":{"text":"I don't think I would ever come to this location again. It was smacked down in the middle ","useful":4,"cool":0},"hlUE3uAPnAxw_OuMIIuOaA":{"text":"This is my number one stop when I am in New Orleans! No matter how long I am in town, I al","useful":2,"cool":1},"Muq6d64m7dmX6ZVMcVQo8A":{"text":"This was my experience today at Cajuns. I go to this store often and never leave without s","useful":0,"cool":0},"lEAMOuwP-L1k6I7Pm_JpPw":{"text":"I'm here visiting from Oakland ca and my Lyft driver recommended this place to me when I a","useful":1,"cool":0},"YJ_AWo0ZTlTYfPaAVLYYhA":{"text":"What a great surprise! We drove through NOLA late in the evening and just wanted something","useful":0,"cool":1},"FE2s6Yf_PeN3xB2Qic5HKQ":{"text":"Dope place. Love the energy outside the store. Claiborne is the spot to be. Lots of activi","useful":1,"cool":1},"-VSObRkae4TWRlHMo2M5SA":{"text":"I would give no stars if that was an option. This was the absolute NASTY, UNSEASONED, BLAN","useful":0,"cool":0},"IbSOstmey4J5fARk-jVnAQ":{"text":"Went here twice during our stay in Nola!! on the first day, I got a fried shrimp platter w","useful":0,"cool":0},"iU2c1uR4KyiV5WFEWUGqjg":{"text":"Best crawfish boil we have had this trip. Fresh, good flavor. The peel and shrimp had grea","useful":0,"cool":0},"9aOoRuBCC762eXlB1jL6pg":{"text":"We went to one Cajun Seafood place closer to us first but there was zero seating in the pl","useful":0,"cool":1},"8iR4DvCFfMeVAgeTsp4wQw":{"text":"As someone not from NOLA (and who has never been before the day I went to try their food) ","useful":1,"cool":1},"t9o0--udCtwfxO9IkuDvhg":{"text":"The first impression I got from this restaurant is how unsanitary the place was.\n\nMost tab","useful":1,"cool":0},"lOZjgMH_l8gyg0lVva2u4g":{"text":"Horrible, I don't understand why sooo many ppl are flock in here,all they're doing is sell","useful":1,"cool":1},"mGoi15iME-UoPGJ3pwwQ8Q":{"text":"So freaking good. Spicy deliciousness. Cannot say enough good things about this place- ive","useful":1,"cool":0},"7zOp67z5dLrxHnhec6XZYg":{"text":"Visiting from California where we have a ton of Cajun seafood places. \nThe broth that come","useful":1,"cool":0},"VgGYRckfwAZaRTWwJzEzJg":{"text":"Don't be fooled by the look or location of this place, as it's a little diamond in the rou","useful":10,"cool":3},"xxrI_LiZ6UBo6JoNlDdv_g":{"text":"The garlic butter at this place is amazing! We had the shrimp fried rice, Turkey necks, cr","useful":0,"cool":1},"TaM1e41ROKZxg4nI3N2kng":{"text":"The flavor is amazing. Great seafood boil. They had specials during the week. Check them o","useful":0,"cool":0},"qggSzQSP9Cj-zfVhqt1KLQ":{"text":"Came in think this local shop was a staple of the community. We ordered the boiled \"fresh\"","useful":2,"cool":0},"Tex7kChJytzKKIGx9hzz7w":{"text":"We hookup to this place..! The vibe is nice. The place was busy was it was worth the wait.","useful":0,"cool":0},"piBwmbzOSJqGQJk7Vq8eog":{"text":"You can't beat the prices here for seafood. It was only $4.99 for a pound of crawfish. We ","useful":1,"cool":0},"pj4xhYeUm06niNeQAGme8w":{"text":"Went here with a couple friends and it was a decent place to get your fixing of seafood. T","useful":2,"cool":0},"GNy3Rsn9DBtMajFOJ6BmUQ":{"text":"Fresh indeed. Cheap price. Too salty. Poor sides. Needs a good cleaning thoroughly through","useful":1,"cool":0},"77CjTUP36hGdZwmEk-Rdpg":{"text":"Sunday night after a pretty intense weekend in NOLA and my cousin has been quietly whining","useful":2,"cool":7},"wrx-ghaRJ5NjxTDNe8TjpQ":{"text":"So good for the price!\n\nIt's classic boiled seafood in a bag in a no frills spot. I would'","useful":0,"cool":1},"vPpu9c4WtKrtjUK5iH0XQA":{"text":"The service was \"okay\" but the crawfish was top notch! Good market price at the time!","useful":0,"cool":0},"ND_j5pIMmyLeydk8SW8B2g":{"text":"Every Uber and Lyft driver that we had recommended this place. It's in a sketchy neighborh","useful":1,"cool":0},"lXFS0CfEZ0TNtUEJQX7hkw":{"text":"It's a definitely to-go place for boiled shrimps, crawfish and crabs for dirty cheap. Don'","useful":3,"cool":0},"qUnnkpmV1jHwM-PZgSNN7A":{"text":"An Uber driving suggested this local spot. We had to stop by here before leaving New Orlea","useful":1,"cool":2},"UWA2Y-vf45RxddNaayZOfw":{"text":"DONT COME HERE! I repeat DONT COME HERE! This place is definitely over hyped. Forget about","useful":2,"cool":0},"jXzs70UGwJH07_RR8hUtVA":{"text":"If you are white DO NOT go here unless your local and know the people working here. We hav","useful":0,"cool":0},"W1nsD-oe0HFp839vOswtHw":{"text":"Really sad that I waited until my trip was almost over before we stumbled upon this place.","useful":0,"cool":0},"HNPDykLiJ0vb5iLHcLYmfg":{"text":"When I want fried seafood that is not from an exclusive sit down restaurant this is my pla","useful":6,"cool":5},"LEDI7yXeeY_l7qhIE7Qt5g":{"text":"Ok, this is the real deal. You uptown and suburban types may be a bit dismayed at the \"in ","useful":6,"cool":0},"9dQ1zsiDLuYKguA0igqISA":{"text":"This was my second time visiting NOLA and I stumbled upon this place which is a hidden gem","useful":1,"cool":0},"K4O3bsKB_9xIGq28FElhsw":{"text":"Let down by Yelp again on this trip! You've got to be careful with Yelp in high tourism ar","useful":1,"cool":1},"3CGv5QfPx9R-t4aQ8Yf1ig":{"text":"Aaawwww mannn. The locals come here for a reason! $5.66/lb. for fresh crawfish! Imported L","useful":4,"cool":1},"1xblYWdkC3I8cRrjU2e7tQ":{"text":"I'm very impressed. Waiting until the last day to indulge in seafood was the best decision","useful":3,"cool":6},"pjBOqS3LxLcu3doB1M6lqg":{"text":"This is not in any way a fancy restaurant, but the price for the amount of seafood you get","useful":0,"cool":0},"0Vt0DAy1CRa4fe3c1b0O9A":{"text":"Here in New Orleans and was told this specific Cajun Seafood has the best Cajun & Creole s","useful":0,"cool":0},"rlgzsnVbTeodwzFjA0m_Xw":{"text":"So very good ! The wait was long however worth the wait . I will definitely go back when i","useful":1,"cool":1},"4TG4A8Ydbrjr5Iin0p0GsA":{"text":"Don't be fooled by Cajun Seafood's humble and even somewhat sketchy appearance - beneath t","useful":1,"cool":1},"GTwOZ1hezK69f5pX1jFE6g":{"text":"I'll start by saying it want nasty but it wasn't what i had in mind. \nI ordered a lb of sh","useful":0,"cool":0},"-n-k4u9T0IuTi7PzR5rlGQ":{"text":"I loved this place when I visited New Orleand 3 weeks ago. The crawfish, snow crab legs, a","useful":0,"cool":0},"5YchIlOJZ8WpDOev5Z96Qw":{"text":"Had a blast eating here. We went to some nice and well known restaurants while in town, bu","useful":0,"cool":1},"FdOvjIKqT4rZoOAmkuVRDw":{"text":"Wonderful and inexpensive boiled seafood by the pound!  This is onE of my favorite places ","useful":1,"cool":3},"Mmri_sXS0sMVZ7I9L19Qzw":{"text":"Great well seasoned food! Very cost effective!! One of the best meals I had while visiting","useful":0,"cool":0},"bG4S_aFCRjP6MKNDcavDcA":{"text":"Call 911, because this place is on fire!!!! I just went to New Orleans for a weekend getaw","useful":0,"cool":0},"nKmIk1n_KIGTY1Zvi3OMJQ":{"text":"I came hear by recommendation from a few locals and all I can say is I'm so glad I grabbed","useful":11,"cool":9},"Hr3LvUZo2rd09opqWNI4eg":{"text":"I'm from Houston and was very excited to try crawfish in NOLA for the first time. I've bee","useful":1,"cool":0},"vu3puOUm0CIxOj_2isUihw":{"text":"I always got to get my fix when I'm in town always. The line was out the damn door this ti","useful":2,"cool":2},"SrWR8-Hz2GWyays6ZmTsJA":{"text":"Who serves old shrimp On a plate that's supposed to be freshly fried? It's already a delic","useful":0,"cool":0},"AEGvHSVqq-NVSSRJF3B_tg":{"text":"So many people recommended Cajun Seafood to us while in NOLA so I figured we HAD to make a","useful":5,"cool":2},"RsuKa2zg_tcO2GSlnRLFiA":{"text":"Went to this spot the 2nd day i was in town. The lines were long, took a while for me to g","useful":0,"cool":0},"EDyk2GlkWkvtZdS_Y5bssw":{"text":"Wow - this place was amazing. This place is simple - you can order fresh seafood, or you c","useful":3,"cool":2},"0hnqO5m8bcYdlOptvYV9Mg":{"text":"This place is in the sketchy part of town but the flavor is absolutely amazing. I had a po","useful":0,"cool":0},"7WTgYgXN_AlJdVHOeCt-6w":{"text":"A must stop for tourists, worth your time to make your way out of the French Quarter. For ","useful":0,"cool":0},"7RW5BRbDecgi5n7SF5bfHQ":{"text":"The crawfish was frozen and had a kick to it.  There are no variety of spice, it is one le","useful":1,"cool":0},"qCb769H0unuLMjHGR-soUA":{"text":"Wowza. I've never had so much food come at me.\n\nI got the House Seafood Special and it cam","useful":2,"cool":0},"DXmEcou9JN6X-5IoCcfXCw":{"text":"This is the best gumbo that I had during my stay in New Orleans. It had a great, spicy kic","useful":7,"cool":4},"LhWLSBzvoZCrjxb_3tVUpQ":{"text":"Heard this was one of the go to places to have crawfish. \n\nThe place was a mix of Louisian","useful":4,"cool":2},"A_xlPwYR2LBYXmeoLZdRWg":{"text":"We wanted to try a crawfish place outside of bourbon st and French market area. Glad we di","useful":0,"cool":0},"kcf7x3N1a_GTFzrnzKQ-Dw":{"text":"It's fallen off quite a bit. Before, the seafood was well seasoned and fresh. What I've no","useful":0,"cool":0},"WC8EjEpxm9jNIyECjMm74g":{"text":"When we drove into New Orleans we went straight to Cajun Seafood. It is a no frills restau","useful":2,"cool":1},"ADVo4-tQuJozlGlZwPls7g":{"text":"We went to Cajun's two years ago. The food was amazing. My girlfriend got fried chicken. M","useful":0,"cool":0},"xxUb77SJHX_LTuzWc7c5zQ":{"text":"Now listen this isn't some pretty place in the nice part of town and I'm fine with that be","useful":1,"cool":0},"Jq-kZQreGDWp78iNmru2qA":{"text":"I regret only going here once during the trip.\n\nFOOD//\nMy friends and I ordered crab, shri","useful":1,"cool":0},"7rZ-SC2h2fC8xwY3ELIHcg":{"text":"Visited Nola recently, was really looking forward to some boiled crawfish. But they arent ","useful":1,"cool":0},"XNYaoMtIUSlUSaaOsw7mmw":{"text":"Flavor explosion! My friends and I got the seafood boil. They placed each item in a separa","useful":3,"cool":2},"3aN9b5E1vv-RwXG7NEOq0g":{"text":"I searched my entire trip for a Hole in the Wall Seafood spot. I was a little hesitant whe","useful":0,"cool":1},"B3Ef831umhJGOCkXYFRGNQ":{"text":"This food was disgusting. It had no seasoning. The shrimp, corn, and potatoes were over co","useful":1,"cool":1},"WpkDfVfNzVUygtaE36oSlw":{"text":"This place has some mighty fine vittles. The person that left the crappy review is definit","useful":0,"cool":1},"2G0UBwd2UA_eZOax9qYiZg":{"text":"I've been craving seafood for a while, especially crawfish. I really had my heart set on c","useful":1,"cool":0},"wTfelJA1jjEqerT2_h6BNQ":{"text":"Omg! I'm in heaven! Seafood is my weakness and this place was a must to go! I literally we","useful":1,"cool":0},"ob55QZ7z71qnE1LK9dIPKw":{"text":"(Stephen A. Smith voice) It breaks my heart to say this, and this place has always bee a f","useful":3,"cool":0},"1W5M7qvXIlL-nwqMQA9S8g":{"text":"Cajun Seafood was one of the only places that I hear you can get decent crawfish during th","useful":3,"cool":2},"KlUJfjNF8xS86NR-8k3Gvg":{"text":"Cajuns is my #1 crawfish spot. If anyone asks me \"where's the best place to get crawfish??","useful":2,"cool":2},"XuDEkXBfdgc7k_ed15shkA":{"text":"This place was recommended to me by a local so I had to try. Great seafood and spices. The","useful":1,"cool":0},"HVPTRadQ0ytZf9LPYH5NNg":{"text":"Yooooo! This place is the shiz-nit! We came thru for a good crawfish spot and found this t","useful":4,"cool":1},"UEBbB-_xoYxSS4X2rc8aaQ":{"text":"I'm also a bit curious about all of the 5 star reviews on Yelp. I suspect the reviews are ","useful":6,"cool":0},"QQB-BwiRFiMDuDmcSqI8aQ":{"text":"This place is absolutely amazing. Best crawfish I've ever had period. The place is a dive ","useful":1,"cool":0},"qSHbU0Uec9nbL_rd6xiWGw":{"text":"It isn't in one of the best neighborhoods, so don't expect to sit down in the store when y","useful":1,"cool":0},"4c6FyNTMS5Z6aT4-dxXqog":{"text":"Lines are ALWAYS LONG, Food is ALWAYS GOOD. Prices are good.  On this trip we had the craw","useful":0,"cool":0},"xWfCH2YpZ-951-yqxDDPGA":{"text":"First off if you're afraid of walking around in the tenderloin of any city. This place is ","useful":2,"cool":1},"QOFTDwYNl6RUR7vv51fOUQ":{"text":"One of the best places to go for a variety of everything without spending a lot of money! ","useful":1,"cool":1},"StgsrXs1zjFDn_9UDZZ1Yw":{"text":"Must go if you like boiled seafood! The price is very reasonable and it feels like a blast","useful":0,"cool":0},"JwQDBWmGPvVm62sUKER2DA":{"text":"Really good seafood at a great value. There are tables inside. A lot of the business is to","useful":6,"cool":3},"vz3IOCizZsYoQJ958VIICw":{"text":"If you want some authentic Cajun food that's well seasoned and plentiful, this is your pla","useful":0,"cool":0},"3Zv3L6lNoEGLfm4aEHOolw":{"text":"How could we go to New Orleans and not get some crawfish? This place was super good and th","useful":0,"cool":0},"K8rnONl1pXNceDeY4ugMBA":{"text":"First off if you're afraid of walking around in the tenderloin of any city heed with cauti","useful":3,"cool":2},"ZzX0gt00BXv2oV3DMoj1oQ":{"text":"Definitely one of the best places to visit. This place is off the beaten path but you will","useful":2,"cool":1},"gtKQOD0DcpqtWBTqYqJ2bQ":{"text":"Came into town during the off season of crawfish , was recommended here by my Uber driver ","useful":3,"cool":2},"SjkJ-Xv3nS1CxSpJW6v9uQ":{"text":"Came here (Oct 19) with a group of friends for lunch. Upon first entering the there was a ","useful":1,"cool":0},"VFGgcUAtzN8dNWGfpOYtRw":{"text":"Cajun Seafood was my sister recommendation. She had visited the area before and she really","useful":15,"cool":7},"rCQpDeasfmKLgjP8hqsnBw":{"text":"After paying tourist prices for cajun seafood in the Quarter for 5 days, I was SO relieved","useful":2,"cool":1},"IWQ70q3cQFUpIKfNx-dANw":{"text":"Omg! So glad we found this place on our trip. We actually went twice, once for breakfast l","useful":0,"cool":0},"h_4Mdhgbe-MTCdISO7wDSQ":{"text":"I visited Cajun seafood while I was in New Orleans for the weekend. I came here before I l","useful":2,"cool":2},"5XcvdsIXT_bdYj9diNBG-Q":{"text":"Cajun seafood  this is a locals spot. I got off the plane dropped my bags and yelped this ","useful":0,"cool":1},"qL3De_tZt68kSlrmDi7JdA":{"text":"Yessssss. It's precooked and is pretty much a togo/ fast food place. Im from Orange County","useful":2,"cool":1}}