{"jubzdKA3GviBqMci1s7pbA":{"text":"Very small place and not the best decorated but the food was good.  I got the alligator po","useful":0,"cool":0},"IVS2YUFXMBLI8jeYXOMjXw":{"text":"We went here for lunch and ordered an Italian sausage, roast beef, and shrimp po boy. All ","useful":0,"cool":0},"Beny4A5vGswhbd7IBBst1g":{"text":"Ok, there is a possibility that I will be hated after this, but the po'boy I had here was ","useful":0,"cool":0},"J__l3VWFbMb9vcGyoOf1vg":{"text":"Today my girlfriend and I split an order of the shrimp po-boy and had a side of red beans ","useful":0,"cool":0},"eVDuvyHZ06z_i-ZzcXeIbA":{"text":"A famous sandwich shop that I remembered from over 10 years ago - so happy I found it agai","useful":0,"cool":0},"vJjGTRZ-jOk8AZ2IVldzJQ":{"text":"Johnny's Po-Boys is a great little place with a HUGE menu.  Their menu has something for e","useful":0,"cool":0},"c7r3-wi9U4yO_6I2h2YsSQ":{"text":"One word--muffulettas.  Awesome muffulettas.  I was here in 1998 and again yesterday.  Has","useful":0,"cool":0},"Q2rKcv_omzGMHwyMgoYUUw":{"text":"Not what I was expecting. It's just a sandwich, nothing spectacular. Yes, it's good, but w","useful":0,"cool":0},"tfbDrDrBSk_0czgpLhC-Gw":{"text":"It was alright.. Got a shrimp po-boy- I wouldn't write home about it. The bread was probab","useful":0,"cool":0},"ApqYy-_F6lAnkoOVdKit8A":{"text":"My first time in New Orleans and this was absolutely amazing to come to after exploring th","useful":0,"cool":0},"2_htG6QhfKp9pM8XjbN5dQ":{"text":"Felt like I had to try this place since everyone raved about it. I wasn't really impressed","useful":1,"cool":1},"G6o9wm_rpU1oxPGAN7lf-Q":{"text":"I'm new to the world of PoBoys and to be honest I don't really get what the fuss is about.","useful":0,"cool":0},"tBFu0NeWTYf2KbE4hLP-oA":{"text":"This place lived up to the hype!!  The sandwiches are well-known are are tasty as hell.  T","useful":0,"cool":0},"bbBy462tHKjTEmDb3puWkw":{"text":"It's ironic. I came for Po-Boy, but instead, had the best omelet in my life. Even the simp","useful":0,"cool":0},"cslDFp1IgEgsYG6HtnF9Rg":{"text":"I came to Johnny's a recommendation from my hotel concierge who rated it as the best locat","useful":0,"cool":0},"9_WazxMbiLRiqx2Abhk5zQ":{"text":"Always a good sign when you see the bread delivered fresh every day. Poboys are great, gri","useful":0,"cool":0},"fTzIDnCdnwFMzK2-qKQ39A":{"text":"I just wrapped up my first time ever in New Orleans.  I had never been before and on my li","useful":0,"cool":0},"w8ZFQaHu0rh9FCELycFKMQ":{"text":"Good Po-Boys. Filled to the point that the ingredients fell out.","useful":0,"cool":0},"fEuXNq9cf24We3c1WmBX0g":{"text":"On my recent expedition to New Orleans, I decided to hit up Johnny's based on some trusted","useful":3,"cool":3},"H6YwD0A0HJLgJdOaBQWXnA":{"text":"Last stop before we fly back to Dallas. Always awesome, fresh food here at great price! Al","useful":0,"cool":0},"yHPj5QjIwGRbvlyZcQEOKg":{"text":"Po-Boy was good but too dry.  Shrimp was plentiful but not the best I've had. Over priced.","useful":0,"cool":0},"OgNA4bZHDJU7PvjI3P7UxA":{"text":"The best poboy shop in NOLA. By far!","useful":0,"cool":0},"Xe19wFX_zZ8NsI9LOuv09Q":{"text":"Avoid the overpriced tourist traps and eat anything your Cajun food loving heart desires r","useful":0,"cool":1},"fwxwpYdg8NVlUf4RcLT4gg":{"text":"Johnny's po-boys is definitely a New Orleans gem. I went twice during my recent trip - fir","useful":0,"cool":0},"ry3Vz4VsjUV4DmMQm1TJUA":{"text":"Make sure you BRING CASH!!! Tried the roast beef po boy with lettuce and tomato. It's the ","useful":0,"cool":0},"CSLomJApMxxUWxF3_PvPUg":{"text":"What a tourist trap. Kind of a dive looking deli. Waited about 15 minutes in line just to ","useful":1,"cool":0},"K9UdNQEqi61dNYk5eBIiXQ":{"text":"If you are on a low carb diet, don't stop here. If you looking for good eats without worry","useful":0,"cool":0},"qvdo7Ah7cuFJ9ODzlzvsNw":{"text":"O-M-G is was soooooooo good. Ordered the chicken club po boy and hawt damn...my stomach an","useful":0,"cool":0},"LkZ-TpaVjSBq5uGak8v5MQ":{"text":"Great poboys joint.. Makes me feel like I found a true landmark. Tons of selections.. A me","useful":0,"cool":0},"6iDrac0uGmDG1lKbkhLubg":{"text":"Pas mal du tout cette petite place bien typique, qui sent l'histoire et le vécu!\nJe n'ai m","useful":2,"cool":1},"mIa-meEGnUQR0UkoAyZEbA":{"text":"My favorite po boy that I tried.  I ordered an oyster po boy, my lady companian ordered an","useful":0,"cool":0},"V9QpRFs6eX0Vj2GSswD2CA":{"text":"Very disappointed.   The crawfish and softshell crab were over fried.   Just crunchy dried","useful":0,"cool":0},"l-b9FJ_gToyY5tERsoe9BQ":{"text":"Place is cramped and dirty, and not in a cool way. It has good AC though. Usually there is","useful":0,"cool":0},"BvHKFBdMBanLpAmrkS4aXQ":{"text":"I'd like to preface that the food lived up to the reputation. Everything anyone had in my ","useful":0,"cool":0},"CKNj1f2p7E6KvNK88rkYUw":{"text":"This is the place to go if you want to try an authentic poboy. Be prepared to stand in lin","useful":0,"cool":0},"vFY_EbIyfrLw59zQIKkHpQ":{"text":"i'm a local,  delivery took an hour from a block away. the gumbo is shitty beef gravy with","useful":0,"cool":0},"xuGhwVycYbx_OwgVEaj95Q":{"text":"I thought the bread here was dry and flavorless, though my husband really enjoyed his pobo","useful":0,"cool":1},"Oq0d3VUX9LMOpSPmt5O5pw":{"text":"Cash and TRAVELER'S CHECKS only (wtf?). I got a kick out of that since I can't remember th","useful":3,"cool":4},"S0lDrD6xOefYiowuuHD62A":{"text":"Johnny's ...what can I say? This place invokes memories of as a kid when my grandfather an","useful":0,"cool":0},"71lDIVVhnLhkuM9fFFmKzQ":{"text":"today I witnessed the cook person pulling my smoked sausage for my red beans & Rice dish o","useful":0,"cool":0},"8B_TnixsMW1lW6ZoMgHaRw":{"text":"This place is just plain disgusting.   Absolutely filthy with a bunch of employees that ob","useful":2,"cool":0},"HKpN4sALoaV1pFH50laDoQ":{"text":"No frills; expectation fulfilled, and some. Generous (southern) portions, quality ingredie","useful":0,"cool":0},"S-Yv8QsA4O6x3UAgizYbKA":{"text":"The shrimp Po-Boys are the most popular sandwich, so that's what I ordered. I found the sa","useful":0,"cool":0},"pOOZH5wyarUIOXvWRqkjQw":{"text":"We went to Johnny's Poorboys and were very disappointed. The bread was not fresh, the shri","useful":0,"cool":0},"7rz8cWm1g473H5tKpvrJaw":{"text":"Over hyped. The po-boys are huge and had a lot of freshly fried shrimp on it. But too much","useful":0,"cool":0},"3PePBlqkwHJiieNvg48eZA":{"text":"Roast beef po' boy...nuff said.","useful":0,"cool":0},"k-AOoMIDlkQpj4WyXZAb9Q":{"text":"Yum yum ! Very casual ! Very small cozy sandwich shop .... But boy is the po-boy good ! Bi","useful":0,"cool":0},"ddcqh-3Nhl95IgK84h7B5w":{"text":"Start with breakfast for your hangover.  The biscuits are great.  Then come back for a po-","useful":0,"cool":0},"KnGO4fOE86BQbwlT1T8eXw":{"text":"Great sandwich.  Very simple.  Fried meat, lettuce, tomatoes, and bread.  Got the fried po","useful":0,"cool":0},"OofmqBk0Dwu653Z9xMfFvA":{"text":"I had read other reviews about this place being dirty, but I went anyhow to check the plac","useful":1,"cool":0},"8QetfQ9W8XkEu39gbhu7Ag":{"text":"Stopped in for lunch on our final day in NOLA. We had the fried shrimp po boy and the blac","useful":0,"cool":0},"DGo6hXvxivd7r_NN7zmaAg":{"text":"I've been here twice for lunch. I like it.  The roast beef poboy is delish.  The debris wa","useful":0,"cool":0},"K3Cs4D45ArOmBLCRqSFlTw":{"text":"Johnny's is a no frills kinda place. Go here if you want a hearty lunch (only open until 4","useful":0,"cool":0},"IybGZEC76CtnKXG9_zDYZQ":{"text":"Service was fast but I guess that's what you'd  expect.  A bit chaotic.  I had the 1/2 n 1","useful":0,"cool":0},"pbRczepLoHyu_2Y3O2PlKg":{"text":"WARNING TOURIST TRAP\n\nCASH or Travelers checks only!!! \nThe staff is very very rude.\nThe g","useful":0,"cool":0},"VJ68gp5vWslRttsPWvw2Ew":{"text":"Really sloppy Roast Beef. Was very tasty, but the bottom bun was completely soaked and sog","useful":0,"cool":0},"oNDR0irBcfDYyjn76s2S3w":{"text":"I stumbled upon this place as I was roaming around the city for a short hour.  It was 9am,","useful":0,"cool":0},"Pn8rP_D5hP-WLbj5SiWVWg":{"text":"All this hype about the Po' Boy sandwich and the Muffuletta, I had to know what the big de","useful":2,"cool":0},"z5GV5Mr-TDqsIEZEHgjoxQ":{"text":"asked a cabbie in the quarter for a good place to have breakfast near my hotel and he poin","useful":1,"cool":1},"BnnLbK5fLqYh8wckQoy89Q":{"text":"Plenty of poboys to choose from here. Pick the one you want and then hunt for a table. Loc","useful":3,"cool":1},"66vi5kI4uL4TvtPZAsjJTg":{"text":"Very good po-boys inside the French Quarter. Lunch line out the door with many sandwich ch","useful":0,"cool":0},"cDKEBAnNQPDjy8zU21TNIQ":{"text":"Stopped in here for a quick breakfast before Jazzfest.  Nothing is quick in this place.  A","useful":0,"cool":0},"mB2eC5ihUF-SdN_VQO18ng":{"text":"Great little place! Nice customer service and food came up fast! I had the lunch special..","useful":0,"cool":0},"LcET8TUzfnBRlKaTrxypOg":{"text":"I wanted to eat here but I just couldn't. Not because they were closed but due to the fact","useful":4,"cool":4},"-mbDyvSMN9ZKlyeQmsWEjQ":{"text":"Inexpensive  food and good!  Place is crowded and self serve.   But Po boys were great","useful":0,"cool":0},"-CzVqQf3Nw8rOA50oyNr5w":{"text":"I've been visiting Johnny's for a few years now, very good Po-Boys, we got the roast beef ","useful":0,"cool":0},"xpBySObINeLd2k182FgjkA":{"text":"This place is amazing. Get the seafood muffaletta. Drench it with hot sauce. Also suggest ","useful":0,"cool":0},"tSDNee2FaoeHgWbOtjgqMQ":{"text":"The line was crazy long out the door at lunch time on New Year's Eve, but it smelled so go","useful":0,"cool":1},"fDf-mBiVIggEYFne45wF_w":{"text":"I didn't know what a Po Boy was until I walked in but I was determined to eat one before I","useful":0,"cool":0},"qRUfxMDYBK7lLgGgp_cKsA":{"text":"We had the roast beef po'boy and bbq beef po'boy. They were both phenomenal. The sloppier ","useful":0,"cool":0},"b2YEh5HRh4j5EOBM1_pwKA":{"text":"Hey thanks friendly cabbie. Not only did you make me feel better about not remembering whe","useful":1,"cool":1},"1ynUfxayYH2jGKIL0M28tw":{"text":"Fat shrimp poboy and gumbo. Dirty tables that didn't sit evenly on cushioned linings. Sand","useful":3,"cool":3},"1sNZ1gFFM6ovR-23R7z-kg":{"text":"One of the people in our party really wanted to try a Po-boy and was just going there to a","useful":1,"cool":0},"BG-hl4I2X3knx5O0u2ld-g":{"text":"I'll make this easy for you, order the muffuletta. I decided what I was going to order bef","useful":0,"cool":0},"U50wGOKBA5ZHN1EjtaZL8w":{"text":"Wowwww!  Now I understand the Po Boy.  First time visitors to N'awlins, our hotel recommen","useful":0,"cool":0},"MHjBCLByxdGviCxapYrvmA":{"text":"Saw this on Andrew Zimmern show on the Travel Channel and so glad we tried it!!! The sandw","useful":0,"cool":0},"KqFL8gDByyLAuo_5HIbFPg":{"text":"They probably have the largest selection of different po boys of any other place in the ar","useful":3,"cool":2},"s2TKR8oNwfrQjJuF5DhAGw":{"text":"Seriously good sandwiches- we grabbed some a few days ago for lunch. Tried half a fried sh","useful":4,"cool":3},"46Azucv848dbioIKgPEF1Q":{"text":"Try the gumbo. Believe me, you need to get a po-boy here but you NEED to try the GUMBO. Wh","useful":2,"cool":0},"KhdpNeA3f3yY0nPxtw8W3A":{"text":"Seriously amazing shrimp po-boys, muffaletta, and gumbo.  Busy place, cash only, but total","useful":0,"cool":0},"DQXc2nAbwsU5HjCvgj2sxQ":{"text":"Came here looking for a crawfish Po-Boy but they were all out. \"Settled\" for a shrimp Po-B","useful":1,"cool":0},"eESZ1LrfnqaJz6EuGWOfCQ":{"text":"huge servings, long lines, cash only, crowded, more space in back. totally worth it.","useful":1,"cool":0},"khuqpZcrdNJ-HaZSM3M6KA":{"text":"A heavenly way to indulge a hangover: Johnny's shrimp po-boy picnic by the river.","useful":0,"cool":0},"tuwKa-4kQ70Uy3v5MncxxQ":{"text":"Never fails to provide the best poboy in the city!  I actually like the fact that they onl","useful":0,"cool":0},"C8N7L-oBHYqwV89e87597Q":{"text":"Best po-boy we've ever had!\nWill most definitely come back for their vast selection .","useful":0,"cool":0},"hTjOfc6ODOQnc__yDI65Cg":{"text":"Johnny's is my preferred breakfast spot for high-value, basic southern-style American brea","useful":0,"cool":0},"4jJVphmzEvTS3Fg3TY6tlg":{"text":"It's small and super crowded. I was seated next to a pack of drunk tourists who were loud ","useful":12,"cool":9},"n7KA3hhNYpHGFh1IJ4QREw":{"text":"excellent! Hi had breakfast but saw lots of great Po-Boys going out the door. Friendly and","useful":1,"cool":0},"erD2SEzo9U8fw702nw8Syw":{"text":"Great little deli....desserts upstairs....Sandwich was really big...and the roast was very","useful":0,"cool":0},"3KUMoE2vOoWboCMaFlZm7g":{"text":"If you stay around the french quarter, you can not miss a meal at Johnny's Po-boy. The spa","useful":0,"cool":0},"q2vULxtlTn9FvY9y5B9_fw":{"text":"I was looking  for authentic new orleans food and we stopped here at Jonnys PO boys and I ","useful":0,"cool":0},"OnlCeVM2j0E1oAFfhc3xBA":{"text":"Seafood gumbo was not that good. The gumbo from intercontinental hotel's room service was ","useful":0,"cool":0},"Z5hVEF1G1iYdZmHrz6E4Zw":{"text":"Never had a PoBoy before ordered the shrimp and it was great. Don't have anything to compa","useful":0,"cool":0},"q5G5tLFiFof4yKgH6-QrtQ":{"text":"I love the simple menu, quick service, and no-frills old-school atmosphere. The bacon and ","useful":0,"cool":0},"tRsyUS1SpEYCYQYxntVNEw":{"text":"Long long line, and not worth it. maybe if the wait wasnt too long i would have enjoyed it","useful":0,"cool":0},"Cw4o4E7BByziad8aKw8WJQ":{"text":"People talk good about this place to talk good...that's it. They make a good PoBoy...done.","useful":2,"cool":0},"808_x8g2oNt-ql1fPYvD4w":{"text":"$20 for a shrimp poboy-drink and fry.  Shrimp was cold and very few.  Cash only and very f","useful":0,"cool":0},"vGTvTSLEqoxY4NtzklS6jQ":{"text":"Meh. That's the best I can say about it. Stand in line for a while, pay in cash and try an","useful":0,"cool":0},"-wZbstvEMHYyB_0hhdsvhw":{"text":"Hands down, my favorite Po-Boy shop in NOLA.  The bread is airy, soft and chewy.  It soaks","useful":0,"cool":0},"QuQ6bCWns1Kz0nkFoXbq5A":{"text":"We arrived just in time to beat the long lines but this place is extremely busy.  The catf","useful":0,"cool":0},"zQscqh3iYDuafowvvcsS5g":{"text":"This place had a lot of options on what to eat!! Unfortunately though service wasn't the f","useful":0,"cool":0},"OIZHO0oOobN2t69utQZA1A":{"text":"Oops, I thought I already reviewed this place!\nWe stopped here for some lunch. I was excit","useful":0,"cool":0},"_xHfIPjnweqOPSuUWkM3iw":{"text":"If you give this place anything less than 4 stars, you just don't understand. If you corre","useful":0,"cool":0},"JcSA1aoHl6WQylyEYvxArA":{"text":"Perfect lunch spot!  I got the shrimp po-boy and my husband got the catfish po-boy.  It wa","useful":0,"cool":0},"kWaijNlSTd5lIoeN7jV_jw":{"text":"Our first stop in New Orleans was to get a Po Boy! We got recommended to go to Johnny's an","useful":0,"cool":0},"EOo8CV9MMo00oY7-BCjCqg":{"text":"Really good cafe food.  \nWe had their breakfast this morning, and it turned out to be a pl","useful":0,"cool":0},"6pgx3TTnxsrQjuP2qq1mjQ":{"text":"OMG All I can say is THEY DELIVER in a rainstorm to hungover hotel guests!!!!  Holy crap, ","useful":1,"cool":0},"pWh4KTyQznM-fn7_EGa_Sw":{"text":"Overall (8/10)\nFood (8/10)\nAtmosphere (7/10)\nService (7/10)\n\nWell this place was good.  No","useful":0,"cool":0},"LuTARJ3sONJPOqDEGvDhTQ":{"text":"This is my favorite spot in New Orleans. I've had a couple of their Po'Boys and my favorit","useful":0,"cool":0},"5ru_7bdOGRVNdv6fqx2LSw":{"text":"Read some reviews trying to find the best Po-Boy in NOLA.  This place was rated pretty wel","useful":0,"cool":0},"KclnsBaSQdR60JKi8XblLw":{"text":"This place was good. We were staying right down the street and it's a solid quick breakfas","useful":0,"cool":0},"W3f9_nHhqNpfHSrxWcDD3w":{"text":"I think 37 minutes is entirely too long to wait for eggs over easy (they weren't), bacon a","useful":0,"cool":0},"pQiDPt5YRhLSc7vfJA_IlA":{"text":"Has a great following, but we weren't that impressed. Ordered a cheeseburger poboy fully d","useful":0,"cool":0},"LPeZLyrLuiNfEh4083bUoA":{"text":"This place is some sort of local prank, riiight? I asked a few people where to get a poboy","useful":3,"cool":1},"IiAjTB6J091Pw5q-dVmQqA":{"text":"I would give them 6 stars if I could! When you see a line out the door, you know why! I lo","useful":0,"cool":0},"vdkEjR3L2BcdQ1ZWlMlyMA":{"text":"Down in New Orleans for Jazzfest and needed a quick breakfast before heading out. Johnny P","useful":0,"cool":0},"R_QhZf_Is9KJrWsudhHoIA":{"text":"As expected based on other reviews, the small dining hall was quite busy. We had the shrim","useful":0,"cool":0},"3KZzI1iv6UUOae3Ax40_Tw":{"text":"I got the Johnny's Special and it was amazing. If a place is named Johnny's, and there is ","useful":0,"cool":0},"FiNBPacFZ_BA2b0-L10xsw":{"text":"First place we went to when we got to NO, and the food was wonderful. I got a shrimp Po-Bo","useful":1,"cool":1},"exZuC8aBiFan7jUx9JN6Pg":{"text":"I wanted to like this place. But it was very disappointing. The prices were good for the F","useful":0,"cool":0},"kUXUioMRwqxIJ_TNXberPw":{"text":"Yeah yeah yeah, you're a po-boy expert with a 10-item checklist of what makes a good one i","useful":1,"cool":0},"DQVBGEpOuW-KFHVdcDVlkw":{"text":"I heard this is the best place for poboys in NOLA. It didn't disappoint. I got the roast b","useful":0,"cool":0},"tr8KU_19Y_00smxJSMJ0gw":{"text":"Since my family and I came all the way from California, we decided to see what all the hyp","useful":2,"cool":2},"AS5Lq3LZREUWDr4PLqV0iA":{"text":"My wife and I both had sausage po boys, they were so good that even though we weren't hung","useful":0,"cool":0},"b45-BhrQnr0UHAEA6frbqw":{"text":"Order the Fried Seafood Muffaletta and it will be the most amazing food you have ever trie","useful":0,"cool":0},"zY_MiNYhK2YczRn3ApcDDg":{"text":"No frills whatsoever, but that's what makes it delicious. I liked how they used fresh crus","useful":1,"cool":0},"7m34DqcVv4McXeDBBjN0VQ":{"text":"The breakfast at this place is phenomenal.  They serve the best biscuits I've ever had.  T","useful":0,"cool":0},"koWQqC-a4DUx4TN7Q1Q-FA":{"text":"Solid po-boys but I'm not understanding all the hype.  My friend recommended Johnny's sinc","useful":0,"cool":0},"V478yPYU15GaTRFANuD1Pw":{"text":"Solid spot that our group went to after a big night in the French Quarter. Pretty good ser","useful":0,"cool":0},"XWn2Jp2e0ymcuovaX4T8yg":{"text":"Johnny's food is excellent just remember to bring cash no credit cards are accepted. The p","useful":0,"cool":0},"j2GFwCdyLfrZ39sRxAShkQ":{"text":"Country fried steak po-boy, way cool!\n\nGreat country fried steak; looked like 3 pieces on ","useful":0,"cool":0},"qEslEUKjrLGEVW_qeskUlg":{"text":"Yuck! This is not a good Po' Boy joint. \n\nAt the time, we were looking for a new Po'boy pl","useful":0,"cool":0},"dJwRkIaeSwzvviJTuwgMeg":{"text":"The food was really good, and the place itself very lively! I have one problem though, and","useful":0,"cool":0},"czw62VPlQ9GVzCql8UZ9Bg":{"text":"I gotta say, I don't know what all the fuss is about. I ordered a seafood muffaletta and m","useful":0,"cool":0},"ydd4ZPv785QJLIG48PGwew":{"text":"My soft shell crab po-boy was one of the worst I've had and he most expensive.  For the po","useful":0,"cool":0},"JV4idEyiVo3DiyBk3eFSjg":{"text":"So disappointed huge sandwiches sloppily made on stale bread.  Not good.  Was recommended ","useful":0,"cool":0},"iNYimQ1XYgf0iQjjd1zllQ":{"text":"Grabbed an oyster po-boy for lunch on my last day before heading to the airport. A little ","useful":0,"cool":0},"HJaBLpY-Al3OJ5SFvwvuwg":{"text":"You CANNOT go to New Orelans without having a po' boy from Johnny's.  The line is long and","useful":3,"cool":0},"IOOLxPLkR5lterut1V43Pw":{"text":"-Bring cash, although they do have an ATM available in the back of the restaurant.\n-Get th","useful":2,"cool":0},"4mvLRSZjv4wqX5f-96527Q":{"text":"Not a fan. Recommend by my dear husband. \n\nDaughter ordered the shrimp po boy. She was not","useful":0,"cool":0},"u2xZBb2XD8LCIbS30e7_nA":{"text":"It was a rainy day and I got the gumbo and french bread.  The gumbo was super salty and th","useful":0,"cool":0},"feC6yR5PYK0XZ-foA8Oueg":{"text":"Not memorable. Oyster poboy had no flavor!! I only had one chance for a po-boy while we we","useful":0,"cool":0},"OFFESSgerI2oG9Ow8aY5Pw":{"text":"Meh, not the best. Had the BBQ beef (maybe that's why?) And it was also like a 30 minute w","useful":0,"cool":0},"hbBWL4YV_KY_r1uL40BdKg":{"text":"I was really disappointed in Johnny's. I had a long list of recommended places to eat and ","useful":0,"cool":0},"ggqrMS4TvGAL8MCC2Jh0xw":{"text":"This is a casual counter-service restaurant in the French Quarter. Nothing fancy, but lots","useful":0,"cool":0},"ZLddHL4IJ-GYkBANH0yrqg":{"text":"A must visit any time I am in NOLA. Always great food and service. Portion size is perfect","useful":0,"cool":0},"F2mwk7PN9HgD4wnoqDE1Ew":{"text":"Having never had a po boy, I was told this was the place to go.  We stopped by on a Sunday","useful":0,"cool":0},"agZd0aqwPxeyGYTnL1wiRg":{"text":"1/2 shrimp, 1/2 oyster.. Do it!\n\nComing here for lunch with the girls to try my first Po B","useful":0,"cool":0},"cRDjPYzqEqQCkGh5qBxupg":{"text":"Pretty good...nothing spectacular. I've had better at Lucy's in Austin where the ingredien","useful":0,"cool":0},"J-HoEA3XGolXf9QRmgEa7A":{"text":"Great spot a local told me about. Says they have the best Po Boys in town so I had to try ","useful":3,"cool":0},"dZM7TqwlDK8NpFAnFwX5NA":{"text":"Ehhh, don't believe the hype. Not quite sure why theres a line formed for this place. Wait","useful":1,"cool":0},"xBrgKTirHPuGLFSCp4d4yA":{"text":"Definitely part of the New Orleans experience. Muffaletta sandwich was giant, flavorful, b","useful":0,"cool":0},"bo1W70GQYydd8YvcEHLFcw":{"text":"Had my first po-boy at Johnnys. The place was recommend by a tour guide and yelp had decen","useful":1,"cool":0},"hav0qZgl2980LLo9lawEpw":{"text":"I was so excited to try a po boy while visiting new orleans and we decided to come to John","useful":0,"cool":0},"DhXhI2QVEmvP3wnYp71vxg":{"text":"Very good poboy restaurant. I had the alligator sausage and it was very good. Would recomm","useful":0,"cool":0},"DPzZZER0S1jeq3S9mAP-Cg":{"text":"Here from a recommendation from my cousin!  Had the breakfast special, alligator sausage, ","useful":0,"cool":0},"XI8NpgRXT_w9MyhJhgqjwA":{"text":"I heard such great things about Johnny's, but for me I was not impressed. Their cash regis","useful":3,"cool":1},"0ejlp81BnW9d3rtmzrGngw":{"text":"The seafood muffaletta was absolutely to die for and plenty big to share with my wife.  Wi","useful":0,"cool":0},"q3GnBaXVb-U0YLHwLR5Eug":{"text":"Our group of 8 popped in on Monday 27Feb2017.  Have heard about this place forever, but ne","useful":0,"cool":0},"6KJatKP0H6q6qcjXs31eEg":{"text":"I normally don't eat po'boys in Houston.  I guess I never found any that really did it for","useful":1,"cool":1},"-dsJ-ubz_zkaBFJChsf_Jg":{"text":"We did not have a great experience here. Got the turkey club po boy but they didn't add th","useful":0,"cool":0},"T-cLzpAxkbfsHOjrQAOkmg":{"text":"Great place for true New Orleans food. The place was packed even after the lunch rush, but","useful":0,"cool":0},"SUsk3kZKMRX0RGRB8-s-iA":{"text":"I had the half Po boy and seafood gumbo combo. I chose the crawfish, which ended up being ","useful":1,"cool":0},"zSMhSc1gVL-m8Yd_73xRfQ":{"text":"This is a great place to come for a po'boy, and from what I've read, the only authentic pl","useful":2,"cool":0},"EA-W33v0AFHejGkKKhpY3w":{"text":"3.5 stars? You people are nuts. These are incredible Po Boys. Perfect french bread and del","useful":0,"cool":0},"DuOviJ_Bp6EDIcFlrv9Shg":{"text":"I had the club po boy but it wasn't any better than any club sandwich I've had before. Not","useful":0,"cool":0},"_uo2zXZ--zDobdKmiJ0gnA":{"text":"Po-boys are awesome here. No frills, not top quality, but just plain old good, classic, wo","useful":0,"cool":0},"mIyM4NF95SdFXA64E-V1TQ":{"text":"Nothing special. The internet raves about this place having the best po boys but I found i","useful":0,"cool":0},"m-VVBR7mShcw4HZAb_HKLg":{"text":"A carriage ride guide said to stop here and we believed him. He lied about how good it was","useful":0,"cool":0},"iZwLkn5AlIrBZIVEK-NnVA":{"text":"You know you can trust Johnny's Po-Boys by looking at how many locals are eating there! At","useful":0,"cool":0},"i6SkUUVTXf-xbXERxVD1AA":{"text":"Was told by several locals in the area to try Johnny's for the po'boy and was not disappoi","useful":1,"cool":0},"QQ0YxtGN0ibGSdCeNn4_RA":{"text":"Overrated and overpriced.  12 bucks for a dressed roast beef po boy?  As sandwiches go, it","useful":8,"cool":0},"gJkQHidTDX6xlswb_Wbyng":{"text":"Food is OK place is dirty and not clean i ordered two chicken po boys it took them over 30","useful":0,"cool":0},"GpIbgDiKM3UxbCnRaSwClQ":{"text":"I ordered the half shrimp po boy and seafood gumbo for lunch. So yum! Service was quick an","useful":0,"cool":0},"7pYbfoamBTBFCcXfgKV7pQ":{"text":"We found out about this place recommended by a local.  And might I say, it was one of the ","useful":0,"cool":2},"NkQpKG96HQvHlCOe4t04_w":{"text":"Gator po boy. Nuff said.  The sandwiches are pretty big.  Big enough that I split one with","useful":0,"cool":0},"6jpXlgYPThg26kertfJhfg":{"text":"Surprisingly, out of the many places my husband and I visited during our NOLA vacation thi","useful":0,"cool":0},"N0eC8QREFqLo_fiJQjM2NQ":{"text":"Established in 1950, Johnny's is the oldest family owned po-boy restaurant in New Orleans.","useful":9,"cool":5},"tXrisCI5InhV6N0v3K-0uA":{"text":"First things first, it is insanely small inside. Please, do not let that dissuade you from","useful":0,"cool":0},"I2V6yEqIsUlASOD3ff2EVg":{"text":"This was our first stop in New Orleans after checking into our hotel.  My fiancee had neve","useful":2,"cool":0},"oV7s3fzUmtdO-k6c3hwZag":{"text":"I ordered the  1/2 shrimp po'boy, shrimp gumbo, and drink. I regret nothing. \n\nThe po'boy ","useful":0,"cool":0},"STOsAAkM8ifzLN0GVcWwaA":{"text":"I ordered Johnny's Special which is basically a roast beef po boy. The sandwich was averag","useful":0,"cool":0},"e4q3m_sW-WLHZtz9WIRj2Q":{"text":"Yet another Over Hyped ( capital O and capital H).  The poboy is nothing that can justify ","useful":0,"cool":0},"1VsxMNyv_XFC5OV-fApFeA":{"text":"Delicious!  I'm in town from Miami Beach and had a wonderful experience at Johnny's.  I ha","useful":0,"cool":0},"SKA6RZc4dsoqFWXhBYPF7A":{"text":"AMAZING!!! had my first po boy in new orleans here...and i loved it! the soft shell crab p","useful":1,"cool":1},"848CdWGVbI1TtKZMzdzaow":{"text":"A few people recommended that I came here, but I thought this was just an average sandwich","useful":0,"cool":0},"EgVJRg2_7-cgKzwYqWTyIg":{"text":"while I was in NOLA this was a good po boy...not sure about AMAZING but it was good...\nI g","useful":0,"cool":0},"13yI-wLOBnem6ElgRuV_SQ":{"text":"No po boys at 10am in the morning?! Sigh. \n\nWe ended up with a muffaleta and a breakfast s","useful":1,"cool":1},"OMvFYJhMHghiL9M3HRKcwA":{"text":"A classic po boy and gumbo. We went on a Thursday at 2pm so it wasn't busy. I had the shri","useful":0,"cool":0},"j4T9TghH-nB3yxOEdZHOZQ":{"text":"Everyone there is so nice, we were astounded by how nice the employees were. And the food ","useful":0,"cool":0},"6xBRfBb3qT_xIZVXbitSOg":{"text":"FIRE. \n\nOrdered the shrimp/roast beef po-boy. \n\nHad eaten here before, forgot the name. Th","useful":0,"cool":0},"c-60W_NoWnrWi3I72ShGAg":{"text":"Shrimp po boy, good taste for the shrimp.  I do question the extra $  for the lettuce, tom","useful":0,"cool":0},"iTHEC9HwlK2TtkJ4wUoUzw":{"text":"The Johnny special is awesome. I highly recommend it. The sweet tea is great to wash it al","useful":0,"cool":0},"Vc8PCt2mlTBIlE4jIaCdoA":{"text":"This place is small and cozy. \nChicken tender po boy was perfect but too big for just 1 pe","useful":0,"cool":0},"SysGndORc4wtZvobOoniTA":{"text":"One of the first places my mom and I went to on our New Orleans trip, and it was a great d","useful":0,"cool":0},"tO4jWu9EQhOIJ0RSdDuAlw":{"text":"This place was fantastic! My husband and I both got the shrimp po-boys. We got the 1/2 po ","useful":0,"cool":0},"UN0QO3yvekQw09fdB804aw":{"text":"This cash only restaurant in the French Quarter was very friendly, inviting, and exciting ","useful":0,"cool":0},"ZhgDiKrL2noDVDzJ8pkDwA":{"text":"Not sure why we went here for breakfast instead of for a Po' boy...but what ever...anyways","useful":1,"cool":0},"Qw9sD8Bjb9wQZwVZ4SBfSg":{"text":"Believe the Hype!  This place is magical!  Johnny's was next to our hotel but it is one of","useful":0,"cool":1},"u-Ld7nL5TdWc8SPRGf6Nrw":{"text":"my friend and I got the soft shelled crab po-boy. We were so-so. Haha, I was just a bit up","useful":1,"cool":1},"cpqkioqtm0Ec6xc5hKrYxA":{"text":"Unorganized. Dirty scummy dirty scummy. No one cleans. I watched the cook pick up a scummy","useful":0,"cool":0},"-swwgGzgUMNxjN0n1R-GzA":{"text":"Johnny's has limited seating for the throngs of people wanting the hundred different kinds","useful":0,"cool":0},"VuFTGkIDRs-1Ua3AZBQIYQ":{"text":"If you are looking for a quick bite to eat, stop by Johnny's Po-Boys.  They won't disappoi","useful":0,"cool":0},"lOvCPgdKhLAQQPWp90vtig":{"text":"Must go for lunch! The sandwichs are huuuge! The muff and shrimp poboy were awesome! If I ","useful":5,"cool":4},"MH5j4zhndh2a9_se9tVweg":{"text":"Wow. Please go. I've tried most of the Po-boy spots and this is my favorite.  Long lines m","useful":0,"cool":0},"WpiZ5xt8C-8BZZqRA8IAUA":{"text":"Daunting line out the door, but they got us our food quickly. Great catfish and gumbo. Oys","useful":1,"cool":0},"JjecEgIeNmsC1Z1EZpWG7g":{"text":"The Johnny's Special (roast beef and ham) is definitely special, but you're going to need ","useful":1,"cool":2},"FsV0LqTgHcAtXe8Hb9wMUw":{"text":"Loved it.  Great food at a great price.  And there were a lot of locals here as well, whic","useful":0,"cool":0},"c2XY3JMD2aM7FkDacmQ3JA":{"text":"I know there are so many people that recommend this place, and I am so glad they have good","useful":0,"cool":0},"LMirqmoI2Ktflu292YHt5g":{"text":"Lordy, lordy lordy - this place was a great find! A local pointed us to Johnny's for break","useful":1,"cool":0},"8pK-6o29T6-wyxZi6H9h_A":{"text":"Ill still tell people to come here while in the quarters, but I'll be skipping it next tim","useful":0,"cool":0},"GWLJGQApU1n6gFD-xeCI-w":{"text":"This place used to be really great but has gone downhill - very sad. I have spoke to many ","useful":0,"cool":0},"cYU3x8zQYTwDwn6CfntmwA":{"text":"After reading the reviews and ratings, we were very excited to try the po-boys and thus th","useful":0,"cool":0},"-608zmjilg0jQdgGIGTEWw":{"text":"The first time I had a sandwich here was the last time I was in NOLA, about 15 years ago. ","useful":1,"cool":1},"cXWEb2XiiDwPuCT2hiiZ6Q":{"text":"Oh if I had had a one of these yummy po'boys right now, i don't care a a crawfish, shrimp,","useful":2,"cool":0},"JVkMBFVD3G9HfXVm3lsqBg":{"text":"We stopped here for lunch one day because it had the \"Best Po Boy In New Orleans\" title at","useful":0,"cool":0},"oVkhPVdbodp2qXfE7Xx9FA":{"text":"The sandwiches are huge, you can share one between 2-3 people. I got the catfish po boy wh","useful":0,"cool":0},"vsWuAfsqLWaxqNs3S6lo9g":{"text":"The roast beef po-boys is a messy plate of goodness. The beef taste like grandma, slow coo","useful":0,"cool":0},"JJab28d-NjDjckKVKeYPXw":{"text":"This is a nice little poboy shop in the FQ.  Food was excellent.  I had the muffaletta and","useful":0,"cool":0},"Cy1DeHjOb6MN7NhLl047UA":{"text":"Expensive for what u get. The sandwich was tasty but not enough shrimp or oyster filling. ","useful":0,"cool":0},"JvSeRpsCkm5YJKAThaj3iw":{"text":"Muffaletta and bowl of red beans/rice were more than plenty for the two of us to share. Ha","useful":0,"cool":0},"rl6JOgtBrJbLIW3ymcXkJQ":{"text":"This is probably the best place in the French Quarter where you can score the best Po Boy.","useful":0,"cool":0},"3oDoXF7hiCURAh_wPo2X4Q":{"text":"I was in need of my first NOLA po boy and this place was recommended by a local.  I don't ","useful":0,"cool":0},"Dynn6dPOrUq7D8kylirzpQ":{"text":"Walking into Johnny's Po-Boys extremely hung-over (rather likely in New Orleans) vs not (u","useful":0,"cool":1},"GknUQYb0w_CayggKNSlHHw":{"text":"Good, quick lunch.  The po boys aren't cheap, but they have a great selection and stick to","useful":0,"cool":0},"s08KmQtI9mMHwMxZRADgwQ":{"text":"I had the shrimp po boy. Huge sandwich. But for 2 sandwiches and three fountain drinks it ","useful":0,"cool":0},"Dy9OWMi_lsiOCNU42vwGaQ":{"text":"Great hangover feed and a must try for the New Orleans newbie.  Johnny Po-Boys is an iconi","useful":1,"cool":0},"Vf_nm6MFP4rBx33SVcLDXA":{"text":"Don't go here. My friends and I got the shrimp poboy and French fries. The sandwich was no","useful":0,"cool":0},"20E0odVT-UJeL4ZPDzkxSg":{"text":"I've not been here in 3 years, and it was one of the first places I visited during my rece","useful":0,"cool":0},"fFB27zxz1-WjV3VY8NHagg":{"text":"I know the majority of people rave about this place but I wasn't impresses at all!  Family","useful":1,"cool":0},"XqzFYWrwusMWOu-tVM-mOQ":{"text":"I had the alligator sausage and it was awesome. Cash or travelers check only. If the line ","useful":0,"cool":0},"CueAqparLdM3Fv3P0AXH4Q":{"text":"Stopped in for my first po-boy and got the gator one. I don't have much to compare it to b","useful":0,"cool":0},"54bbD2tBmEPX23-OcpeSow":{"text":"After trying to get a muffetta all week I have succeeded with victory! Come early before t","useful":0,"cool":0},"WV5aOXN5_XDAzKea4oy4uQ":{"text":"I am going to preface this review by saying that I have been there once. I am not a local,","useful":0,"cool":0},"B-jkBc6sq5kQi1DdDrxvLQ":{"text":"We heard this was a must visit place so dropped by for a quick lunch.  The place was packe","useful":0,"cool":0},"Jiwko2hUdJ0lGC5m9aJHUA":{"text":"We went to this place on a Saturday afternoon around 11 am and it was super crowded and th","useful":0,"cool":0},"ZF26afghZG1eQHEk70sTGg":{"text":"This is one of our go-to's on trips to New Orleans. We got in for a late lunch around clos","useful":0,"cool":0},"Z7hK9lVvxsbuM1zRBMb5oQ":{"text":"Went on Sunday 6/26/16. We wanted to give this place a try since we went on a Food Tour a ","useful":0,"cool":0},"U8Lii6ISPuY2XWEFzM2gkg":{"text":"Very good.  My 2nd time having this place. Half Catfish and half oyster poboy sandwich wit","useful":0,"cool":0},"n262MFNAZycz00RfDDS4sA":{"text":"My family of five found this place very likable. The front room was a bit small but there ","useful":0,"cool":0},"35bZIGp7gZWu5WnVXIiYiQ":{"text":"Definitely the best place I ate while in NOLA. It is a very small place, very few tables (","useful":0,"cool":0},"naUFj0JaT2OHx3HiFIX8cw":{"text":"I'm not sure why all the hype to eat here, but every NOLA person said they have the best p","useful":0,"cool":0},"A1FrW02r4TmDLSx1jZCRFw":{"text":"We had our meal midway through the day-Mufallata and Jambalaya. The portions were adequate","useful":0,"cool":0},"MaKn80kXLtrfRvqYY7KwqQ":{"text":"After many years and many tries I finally got to enjoy a poboy from Johnny's. On this occa","useful":1,"cool":2},"y9dxutORAeYbCNy3U9ixVw":{"text":"Po-boys, another institution of the area I needed to have.  I hunted around NOLA looking f","useful":1,"cool":1},"WYE5Xg2muOdKnzoKARsVvA":{"text":"50+ types of po boys. The 'dressed'  catfish was delicious","useful":0,"cool":0},"rXz8tBvujLIQAAlXIcH7_A":{"text":"Johnny's Po-Boys is crowded because of its highly-rated reputation for good food and inexp","useful":0,"cool":1},"ZxvF4jyOYYsql06JuhmnPA":{"text":"If you are in search of a po boy, this is it! Had the aligator sausage and shrimp po boys.","useful":0,"cool":0},"Hs2yO7wD82jN706xleH38w":{"text":"I'm not sure if it's the best poboy I've had but it is still good. This is a hidden gem in","useful":1,"cool":1},"AW3mdUSkyz0IJVjXk_Av4A":{"text":"CASH ONLY! \n\nHad our first Po-boy here and it didn't disappoint! We got the shrimp (fully ","useful":0,"cool":0},"ZT67-NLJLcagFDweHVQKgg":{"text":"I hate to give this place only 3 stars, but it is just as the stars label it.. \"A-OK\". \n\nI","useful":0,"cool":0},"qaoKQrn-OgvKguAM34BZ1A":{"text":"First po' boy and I was amazed!\n\nTheir sammies are large enough to feed two, and you have ","useful":0,"cool":0},"KWFs1i5tXKJm6SI2rhaXMA":{"text":"Normally I'm not one to scarf down greasy food like its my last living meal... but then ag","useful":0,"cool":1},"pQA_J-NzOGfhM-M2um8-hA":{"text":"Great spot for Po-Boys and Gumbo, however the dining room is a bit tired and cramped.  I a","useful":0,"cool":0},"ZVv-hBJXBVaK9nJx6gNR4Q":{"text":"It's a cute store front spot if you have the time to stop by when you are in Nola. It's fu","useful":1,"cool":1},"CqGQF93yV-2n_QwVFND0NQ":{"text":"Now I only had a small portion of one of their Po'Boys (it was during a food tour), but ma","useful":1,"cool":1},"e3AesCKNqzxrOxIqiUiIjg":{"text":"Was in NOLA for my 50th bday, we arrived on Thursday around lunch time by the time we got ","useful":0,"cool":0},"Cb5dx7GqhQ62ibvoXHRwwA":{"text":"Came here on a whim of a recommendation from a shop owner. Arrived around 11 for breakfast","useful":0,"cool":0},"2c1XxNBmjF4G0G4bUyP4iQ":{"text":"Good shrimp Po boy and they had good lunch specials.  You can get a very filling meal for ","useful":0,"cool":0},"UfWhBY1OF8pM7a1aZ5wkWA":{"text":"Had my first Roast Beef Po-Boy at Johnny´s and I will definately come again. The beef was ","useful":0,"cool":0},"AHLzQc1oQaYY7_IDpvVo9g":{"text":"I was told that this is the place to go for Po-boys in the French Quarter. Because of this","useful":0,"cool":0},"hPEsb6OeLKeUkk40o-8Ccw":{"text":"This place is awesome, either go with the Roast beef or the Judge Bosetta and you can't go","useful":0,"cool":0},"h4wsEhouH3Wb68QxKzn6YA":{"text":"One of our good friends recommended checking out Johnny's when we went down to visit New O","useful":0,"cool":0},"qQdNAjyC9CVqXNqN1qFadg":{"text":"If you find yourself wandering around the French Quarter desiring to partake in the rich p","useful":3,"cool":3},"9SKN6R1s8S221R8EfgKdHw":{"text":"First time eating a po boy. Honestly it was good but nothing special. 2 shrimp Poboys & 1 ","useful":0,"cool":0},"OdFt1ZkwLvJXMzYSY04ziw":{"text":"Tourist review here for a Friday afternoon visit\n\nLook out for the Lunch combo special!!!!","useful":2,"cool":0},"xpHfFUGdA8NScTtYVCPRvg":{"text":"Johnny's seems to have much in common with the late Zsa Zsa Gabor:  it's famous because it","useful":0,"cool":0},"TFQRkGCZKMwxzfvjgJGsIA":{"text":"Greasy, good. I don't see how you can go wrong. I still don't see what the difference betw","useful":0,"cool":0},"oD7VRFGgHAPBUThCncwKzw":{"text":"great place.  the best in the city as far as we are concerned.  Lines are long but worth i","useful":0,"cool":0},"1K3xOEpzzbgBaV2_sA7oxg":{"text":"I've been eating here most of my life!  Locals get it so if you think you might try it I r","useful":0,"cool":0},"0CL0eU2s_6S81vjTEDfm9A":{"text":"Not impressed! Don't believe the hype on this place. Maybe what goes on here was good 50 y","useful":0,"cool":0},"RS1xtcLLG2WpCUMVYjCl0w":{"text":"Yums. Get your poboy right here. Crawfish poboy. Alligator sausage poboy. Crabcake poboy. ","useful":0,"cool":0},"JDlnkVnn0tKUp5XoySa_cg":{"text":"We were passing through New Orleans and hubs was hungry for a Po'Boy. We have eaten at sev","useful":1,"cool":0},"gfjzN82lgkzAzHmgUadVwA":{"text":"Got the chicken club! It was amazing. The staff id nice. Even after dealing with annoying ","useful":1,"cool":1},"hw-IOq8Mwg6lA6Jhlmujqg":{"text":"Great traditional Po-Boys, not cheap but quality and the been back a couple times happy it","useful":0,"cool":0},"t8QNl86dp9Y3_KmyRvIvpg":{"text":"Cash only. Don't freak out if the dinning room is packed, there is one in the back. The sh","useful":0,"cool":1},"xlxIyZjbjYAhiKTB-KMhmQ":{"text":"I couldn't help but notice all the problems. It's a dirty place, and crazy small. The staf","useful":0,"cool":0},"2AYvFdpjv7mSpb_PG1-rZw":{"text":"Johnny' special poboy is scrumptious gooey mess (dressed). Just keep eating til it's all g","useful":0,"cool":0},"3wO_R_YiwE3NPuuSkQJTkg":{"text":"Love going to simple, historical spots and Johnny's has been around since 1950.  Not fancy","useful":0,"cool":0},"AVg5idXlLa2Zk9sw2wreTQ":{"text":"Very disappointed in our food. The shrimp po'boy was good, but the roast beef was tough an","useful":0,"cool":1},"8hgKm2YruOJqYUbgMMhTgQ":{"text":"We chose this place to get an infamous Po' boy based on a recommendation from a tour guide","useful":2,"cool":0},"8OtZZqp82c_V8T87S596KA":{"text":"Food: 4 stars\nService: 3 stars (fast food)\nAmbiance: 3 stars\nOverall: 4 stars\n\nVery good q","useful":1,"cool":1},"vxn0I27bPpZj8Wamvaljtw":{"text":"I know this place is a perennial favorite among Nola tourists, but it might be a bit overr","useful":0,"cool":1},"Qfw694xWqLjYSpAkS7RidA":{"text":"I'm only giving this place 2 stars because the biscuits are from scratch. The shrimp on th","useful":0,"cool":0},"OHcYaIOw8HLWdq0V9TnVkw":{"text":"Me and my SO ate here a handful of times during our vacation. 'Nuff said. We tried the shr","useful":0,"cool":0},"8xR4k4wjj4fDJWD6-WrcQw":{"text":"Definitely a must when visiting NOLA. Quick, affordable and so good! Best biscuits, amazin","useful":0,"cool":0},"KGFOM3xICOdbZTJa1S3WNA":{"text":"Pretty awesome place to get a po boy in NOLA. But getting the food can be a long wait beca","useful":0,"cool":0},"GmOESa0q6p0ZNjnHwJuFNw":{"text":"The line wasn't all that bad when we went here. You wait in line and order and pay, then w","useful":0,"cool":0},"SEs3u2AjAhnSaW9NQeBLEg":{"text":"Excellent shrimp and oyster po boys. Always eat here at least twice during our visits to t","useful":0,"cool":0},"z-IllkctnEdj5unM5b00eQ":{"text":"Great po boys. I first came here some 20 years ago and make an effort to return whenever I","useful":0,"cool":0},"xCDuRUSQl4QO1UMgc164_w":{"text":"Exactly the kind of poboy I want in New Orleans. Good slightly chewy, slightly soft bread ","useful":2,"cool":1},"hhffGbvKHETPe4VOYI7fvg":{"text":"Outstanding  Po-Boys.  Local shop around corner from Jackson  Square.   Outrageous selecti","useful":0,"cool":0},"gyxh8n8SkV57wH7rIMB9iA":{"text":"When guys from the fire department come in to get THEIR poboys, you know you're in the rig","useful":0,"cool":0},"OiCZ4Ah8FsTx5Ac-2zlXPw":{"text":"Delicious po boys - highly recommend the shrimp. Great hole in the wall spot, bread is per","useful":0,"cool":0},"MVBVF5A_4KdJbHd6u1OzrA":{"text":"Pretty decent, totally reasonably priced.  I had a 1/2 shrimp po boy combo with 1/2 bowl o","useful":0,"cool":0},"-u4A8J8GTqB2H9tt_8Jm7w":{"text":"This is some great food. $30 for 2 super large Poboys, a fried chicken one and the amazing","useful":1,"cool":0},"bJZkNLOggwl8m1PNBEH34Q":{"text":"I ordered the Johnnys Special po-boy. I walked over to the waterfront to eat it. By then, ","useful":0,"cool":0},"yP-CiwyCt_urDPa6B7ppLQ":{"text":"Seeing the line as I walked in made me scared that I had walked into a tourist trap - medi","useful":0,"cool":0},"tml1s_mxuzDaQtG8QEAI-w":{"text":"Johnny's is a great little spot right in the French Quarter. This was my first po-boy in N","useful":1,"cool":0},"FUFykxxojIg485-lPQsqhg":{"text":"Lovelovelove this place. I've been dreaming about it since we first had it in January. The","useful":0,"cool":0},"wVPy2bg2qj7goZgHWnNPEA":{"text":"Best Po Boys in the city in my opinion. Can get crowded and lines can go out the door. Tab","useful":0,"cool":0},"egHUrr414iN_7qdimoWm8w":{"text":"Solid, but not the best po boys, and a little on the pricey side.  But still damn good.","useful":0,"cool":0},"KZnEx-YT8bmEBEnxwKhwZA":{"text":"Definitely the best place I ate while in NOLA. It is a very small place, very few tables (","useful":1,"cool":1},"-4mkqOS651aS-b5S4weavw":{"text":"Had a oyster po boy and it was really, really good. I managed to try a piece of everyone e","useful":0,"cool":0},"aWfaHfnvT2YNmqZQj007Lw":{"text":"Never disappointed crab cake is my new favorite! Probably some of the best carpet availabl","useful":0,"cool":0},"9Xv1l5mtqL2LdyBYKl6QjA":{"text":"Rachel Ray did a show about this place I saw a long time ago so I had to take it out this ","useful":0,"cool":0},"H_0Q9SCtVzdzyyAQtY-Xnw":{"text":"Great Po boys, so many to choose from! Great experience. Very crowded at lunch time though","useful":0,"cool":0},"-CKllyhggGCmg_9TW9Q3iQ":{"text":"Would recommend Acme Oyster house over this place.  Poboy's were good, but not great.  Shr","useful":0,"cool":0},"1CTxgVR4kHUn3FOV4ypksA":{"text":"This place was awesome! The people who work here were so friendly and helpful. We came in ","useful":0,"cool":0},"c8MvjCuLTfhT21WCyjo4Bw":{"text":"I had the Johnny Special Po-Boy. \nI can't get the salty taste of the beef juice from my mo","useful":1,"cool":0},"zfVlPhDJjgqEnwqymEPZ_Q":{"text":"First po boy in New Orleans was had here. Got the shrimp combo with the house gumbo. Was o","useful":0,"cool":0},"ShUswbcodh1_RtcykzAOwg":{"text":"Ended up here on a food tour. Sampled a beef po-boy. I liked! Just a basic walk-in sandwic","useful":0,"cool":1},"lA1b-mcma9hBG3vl_WlBBA":{"text":"Great Po-Boys. Close to 50 varieties on the menu. I had the Johnny's Special(sub turkey fo","useful":0,"cool":0},"jHCCI7paf5gnRHsQkBwgUg":{"text":"Johnny's Po-Boys is a really casual place. You go to the counter, you order, then you wait","useful":2,"cool":1},"b0FGgmWEmc784z-9F-bNgQ":{"text":"We ate here based on the recommendation from our city tour driver.   We must have come at ","useful":0,"cool":0},"8r-nEZSBJv0ikweC9jMJnA":{"text":"The Po Boy was amazing.  I had the Johnny's Special which was Roast Beef, Grilled Ham, Ame","useful":1,"cool":0},"7Uz7syiastnSnFro7Do0gg":{"text":"I would give this place 5 stars....if it wasn't so dang popular. The line was out the door","useful":0,"cool":0},"C0_5QF6gThPVcmn96ZJI9Q":{"text":"I knew this place was legit when I realized a bunch of locals were there on their lunch br","useful":0,"cool":0},"4Uo4umd7FiKlMW7cpr5IoA":{"text":"This was the best place for food in New Orleans. I would have never found this gem but our","useful":0,"cool":0},"IHKh-AfhkvhCgQR4R1v4Ug":{"text":"Really good po boys. Fresh baked bread. Awesome. Need more room to sit but the best po boy","useful":0,"cool":0},"pVEkpMwg9JNnjxkxGXFCXQ":{"text":"For a quintessential NOLA experience I absolutely recommend a lunch stop at Johnny's. Ther","useful":1,"cool":1},"Bfxz69ni-HaxcB6iE5GT6w":{"text":"You just have to get a po-boy while in New Orleans!!! Johnny's Po Boys located on Saint Lo","useful":1,"cool":1},"qSTiFJEUHvXJcbIMafNSVQ":{"text":"In my opinion, these are the best Po-Boys in NOLA! The ingredients are fresh and there is ","useful":0,"cool":0},"j9_e8X5mpJE8LLOjRpWVCw":{"text":"I wanted to go to Parkway's for poboys, but was told they close on Tuesday. So someone els","useful":0,"cool":0},"a1kWcFPtUsZ_Ej3W85mCkA":{"text":"We were expecting it to be better.\nWe went there for po'boys, and were expecting them to b","useful":0,"cool":0},"826cx0-uuzbfIQ48M1jhrQ":{"text":"This was right around the corner from the hotel so was able to enjoy a breakfast, lunch an","useful":1,"cool":1},"OpPsCeE2n_ERi1jNGee1bg":{"text":"Good Po Boys... everybody really knows about this place!  It was packed!  We enjoyed out P","useful":0,"cool":0},"mf7PLGUU2_tt7Z0WqReW6A":{"text":"I overheard a carriage tour guide talk about this place and thought I would check it out. ","useful":0,"cool":0},"EPL6GZY3mApY8PJOjiRoqw":{"text":"I honestly don't know how this place is so highly rated. We got the shrimp poboy and seafo","useful":1,"cool":0},"ppKIjkmEDOsfBUmpThLZtA":{"text":"Review is from the Sunday of St Patty's Day weekend so maybe that is why I was so hyped up","useful":0,"cool":0},"eYOGE0hF7fXzW9O60FPkpQ":{"text":"Looking for a Po - boy in the Quarter theres is arguably no better.  Since the 50's they k","useful":0,"cool":0},"pw5D3TJXbfwwvO41cb2wzg":{"text":"Good muffaletta. \nSecond time in town and decided to give this place a try for a muffalett","useful":0,"cool":0},"l28uBCkW6kJor4wA2ApgBA":{"text":"BEST dam Po'Boys, hands down!! Try the Texas bread option, DDDDD-lish!","useful":0,"cool":0},"SU7CzfyzAee9MLuQOkwWTA":{"text":"First time I ever ate a po'boy in New Orleans and I have to say I wish I had ordered the m","useful":1,"cool":0},"U0ZKLz0F1NL-Wjt9m4J5lg":{"text":"The bread was night and light and crunchy, but the po boy was mostly bread and not that mu","useful":0,"cool":0},"_WBYbaxCYflO9sOKSJ-8mw":{"text":"I have been a regular at Johnny's for years. This is the 2nd-best sandwich shop in the Qua","useful":2,"cool":0},"hAilxuejd67hV2gv3skZew":{"text":"The Place for authentic Po-Boys in this town IMHO, breakfast or lunch or early supper. The","useful":0,"cool":1},"YjSftK-v81fZP-JBEVwKrQ":{"text":"Johnny Poboys! One of the most memorable items from our trip to New Orleans. The sandwiche","useful":0,"cool":0},"BuBpvc9GM-vS8YYfVzuNSg":{"text":"Great poboy shop in the quarter.  It is a little pricy but it's very good.  I had the oyst","useful":0,"cool":0},"aeasY949IG1mLJnsBYG11w":{"text":"Went here in 2009 and food was great. Came back in April 2013 and food was terrible. Shrim","useful":0,"cool":0},"bv2ZBZB0DRngv399pdUKmQ":{"text":"Johnny's Po-Boys is overrated.  Long lines, and after you order, another 10 minute wait.  ","useful":0,"cool":0},"ZzkI2fW_UpKu6ygk6IYbRQ":{"text":"Going to New Orleans and not getting a po-boy is like coming to Philly and not getting a c","useful":0,"cool":0},"XlIf2PuvqWpkW7SAywQxFg":{"text":"Delicious! The Johnny Special was awesome! Roast beef, ham and melted cheeses; it was so g","useful":0,"cool":0},"5_xAdpa0iUixhA8YX9JNTQ":{"text":"Had the shrimp po boy and it was delicious. Loads of shrimp, lettuce, tomato and mayo. It ","useful":0,"cool":0},"J0mLJOl79XDvyX8EO59F5Q":{"text":"The food was delicious!  We were served as quick as they could with the line that was in f","useful":0,"cool":0},"8oO5JqPL-qqVhedKzarkAw":{"text":"My husband and I enjoyed it so much we went back twice. Ordered the shrimp and fried oyste","useful":0,"cool":0},"Rb0_vA537Y__aR_-MM9bIg":{"text":"Total crap. \n\nWent there for breakfast and the food was not only disgusting but laiden in ","useful":0,"cool":0},"v09UTsnQjAhjsHxk-UZbww":{"text":"We kept seeing lines out the door when we were walking around the Quarter and wanted to st","useful":1,"cool":1},"63YzDbi_MTelSd8h_8ahhg":{"text":"We walked in here on a whim and were so happy that we did! Cash only, but the food is deli","useful":0,"cool":0},"U7CNiRJ2Hf3JOnwe4ppiUQ":{"text":"This was recommend to us as a \"Must Go\" locale for an amazing PoBoy. The line was out the ","useful":0,"cool":0},"PVyV0La93GX5CM12cW2jHw":{"text":"First day in New Orleans and this was a must on my list of places to eat. Johnny's did not","useful":0,"cool":0},"a9FyyoJ6lzX5IApUVUhBVw":{"text":"Catfish po'boy was delicious! Better than I expected! Fried but not too heavy. And the ser","useful":0,"cool":0},"H7ORZyVhsYgII2BWFz2XQw":{"text":"The muffuletta was AMAZING! The olives and carrots were perfect together. We also got a sh","useful":0,"cool":0},"ti8H_T656NwJfxhxegwhJw":{"text":"So it's your first time in New Orleans (for the Joint Mathematics Meeting, holla!) and you","useful":0,"cool":0},"_p_LJBKUid1MY8SEL2j8OQ":{"text":"My mother doesn't like sandwiches. I introduced her to poboys and our 5 day trip we came h","useful":0,"cool":0},"3ouBoj0ZQAXq0W_ioPjfVQ":{"text":"This is truly a tourist trap, don't waste your money here...if you want real poboys then g","useful":2,"cool":1},"3NItSC80fqgH8xbvz2w4tg":{"text":"I've had a few po boys in my day and think this has to be one of the best. I had the shrim","useful":0,"cool":0},"ZR8ckMeLxoJQlc_06X4cjQ":{"text":"Big First warning: THEY DO NOT ACCEPT CREDIT CARDS! !!!!! Shrimp Po boys are good and gumb","useful":1,"cool":0},"VbwyrW_leYPX48Rm_LP7vA":{"text":"the best part about johnny's is that the long line will get your appetite prepared for the","useful":1,"cool":1},"IL-1BoVjxMOn9SMtTR4OcA":{"text":"Used to love this place - I've been several times - but I will NEVER go back! After waitin","useful":0,"cool":0},"XWOZb2CxNzmCI_o9u0hjxg":{"text":"Before visiting New Orleans, I've never had a po boy sandwich.  So I heard about this plac","useful":0,"cool":0},"eLnTdp4jegrmlgDtlfIXcw":{"text":"I had the seafood po boy with catfish shrimp and oysters so good and more than I could eat","useful":1,"cool":0},"pxGB-rClulo7S0c4l6rPWQ":{"text":"After driving through French quarter, trying to find some place to have lunch, my husband ","useful":0,"cool":0},"f2F-BeEb2sYLH_0dtnfqCg":{"text":"Hole in heaven... Sat on top eating yummy chick n biscuit special , po boys chick Parmesan","useful":0,"cool":1},"t4o0IPg-pXe38CUgNYPl0w":{"text":"I really really wanted to give Johnny's a better review than a 3 because my family has bee","useful":1,"cool":0},"RO2UxFT1UbDvD7YEXIwIAg":{"text":"If you've had the muffaletta here, there's no way you could give this place any fewer than","useful":0,"cool":0},"NAcma0Zsc32bQGzvPZ5pQQ":{"text":"Roast beef po boy was tasty but so gravy filled and sloppy it took 21 napkins (I counted) ","useful":0,"cool":0},"zYDoj3leCe_f_1DI03d8Mw":{"text":"Most delicious meal in Nawlins! I got the combo half shrimp po boy and the seafood gumbo. ","useful":0,"cool":0},"3JaCOkAbNR9H1YKLk5dFTQ":{"text":"I can't believe anyone would eat here if they were to walk by Johnny's and see the disgust","useful":0,"cool":0},"2kufFiOWn-6p6SJ7CJRShA":{"text":"A classic - when visiting New Orleans it's a stop you should put on your list. Rustic, loc","useful":0,"cool":0},"AFfsOE7I1w8fzH9SkP1qjg":{"text":"This place is iconic and is awesome.  I normally order the Shrimp Po-Boy fully dressed as ","useful":0,"cool":0},"qvs2lLWJejJs6ViYag1HsQ":{"text":"If you're in NOLA and want to try a Po' Boy, stop here. Most of the front street restauran","useful":0,"cool":0},"srEBuiREyBPhONHj8EU4tw":{"text":"Went to Johnnys, Killer and NOLA po boys. Johnnys was the best classic. Had the oyster. De","useful":0,"cool":0},"rCtMdaLXAILMF_i9jQ8u1A":{"text":"This was the first place that we stopped after landing in New Orleans and we were not disa","useful":0,"cool":0},"AYSNNvz9hzGATWgDwk0vYA":{"text":"If I could do 3.5 I would.\n\nGood poboys, but not OMGAWD THIS IS THE BEST POBOY EVER. The p","useful":0,"cool":0},"pRJ5HhGCHf77jY2Dl1kFLw":{"text":"Recommended by the concierge at the hotel.  Shrimp po-boy was crunchy and yummy ($12)! clo","useful":0,"cool":0},"Y4F0vAJE9I_Ic0sN-wuE5Q":{"text":"ok, so I admit I should have heeded to Yelp! reviews.  this place is the most overrated po","useful":0,"cool":0},"B6pQUGhKcF41pkSSkb27SA":{"text":"The place is Dirty!!!!  After eating I went to the bathroom and when I saw the kitchen I f","useful":0,"cool":0},"sUK3jylDU4MmNb2Jz8Mhtw":{"text":"PoBoys are one of the quintessential foods of NOLA and searching for great PoBoys is epic ","useful":6,"cool":6},"QUzSoYU4AXLKOzbKMlTbxw":{"text":"Super delicious but HUGE! Only order half!! We had the soft shell crab poboys (one is at l","useful":0,"cool":0},"vzCpqEWI3e5qOSFU9E7z2Q":{"text":"Po boys here are amazing that I went back for a second!! Got the muffaletta and shrimp po ","useful":0,"cool":0},"xuKnd_dKZvZSmfIlv6bEGg":{"text":"Not what we expected!! Shrimp Po-boys were cold!!! We decided to share some chili cheese f","useful":0,"cool":0},"1hlJ9D_irRTc8JDsYDtuDw":{"text":"This was a quick fix when we were tired of walking in the rain.  I had been told to get a ","useful":0,"cool":0},"_HOMq3h5aeucQBzg46C15g":{"text":"I came here with some friends after a late breakfast so I was not too hungry. \n\nAfter look","useful":0,"cool":0},"3qnWsGnKVQ7HB_t_Z0TJNA":{"text":"expect a long wait...\nit's worth it, so deal!\n\nbest po'boy i've ever had.  i am still drea","useful":0,"cool":0},"otki21wxML7nigOGnwZ-9g":{"text":"I don't understand the hype about this place. My boyfriend and I split the shrimp po-boy a","useful":0,"cool":0},"510UoWtkAii_DMxqDPM97A":{"text":"This is the best place to eat a poyboy in the quarter. I live a blks away and you can neve","useful":1,"cool":1},"7cMdDuTltJX7w9JQcbRIlg":{"text":"Well hot damn, there we go. \n\nLesson # 2781038 in life: When walking down the street, if y","useful":6,"cool":5},"fkdNSlLa0FlUd7D0CY7_Sw":{"text":"The po-boys here are pretty good and well worth stopping in if you are close by...  We sha","useful":0,"cool":0},"2XN3m1CuRpa21jjHGbnutA":{"text":"We waited at least a half hour for mediocre food. Don't get the seafood gumbo, it tastes l","useful":0,"cool":0},"8vo8-52XZHJw2cZt4fBrZA":{"text":"Got off the plane starving of course and by the time we got to the Quarter it was past lun","useful":4,"cool":3},"7-4nt_WPxYH981p5_nVogA":{"text":"Let me begin by saying that my family and I have been traveling to New Orleans about twice","useful":1,"cool":0},"SbyUhu8U8K9GKUEtfO-5vQ":{"text":"Holy cow this was literally the best sandwich I've had in my entire life. I am not joking.","useful":0,"cool":0},"22qTciUkWInf3tYMoLCqRQ":{"text":"As this restaurant is known by locals as the go-to place for Po Boys in New Orleans, our g","useful":0,"cool":0},"aFKgr10JPxvRyGzT9-BIPA":{"text":"It's a hole in the wall in a good way . You order from a menu above the counter your recei","useful":0,"cool":0},"DU7heMt2OB6p6NA15157DQ":{"text":"This is the place to go for traditional po boys. Went twice on our trip, Johnny's special ","useful":0,"cool":0},"EDQg3RRCp-VXNrZg68HMlQ":{"text":"Our first afternoon in NOLA and we wanted something good to eat for lunch.  We also wanted","useful":0,"cool":0},"8miRdord6NIZNyo6G6dG6w":{"text":"The catfish po boy I had here was ok.  It was a pretty large po boy for $9.50, and my jaw ","useful":1,"cool":0},"cUw6sGOZMm90kPyxCH_Bbg":{"text":"Well, Johnny's Po-Boys is one of the best choice for my 1st trip to New Orleans ( what can","useful":1,"cool":0},"edINis_jT_wEal_bYHYzHw":{"text":"This place is hidden on a side street. We stumbled onto it by accident and thought we woul","useful":1,"cool":1},"yuuBWn40XA9vBpdTai58Vg":{"text":"Delicious Po-Boys.  It's a small, but true to its nature kind of place.  I loved the Po-Bo","useful":0,"cool":0},"OlqPB3MnRN8iePdsIAzGhQ":{"text":"Not everything needs to be fancy or famous (though these guys are well known) to be good. ","useful":1,"cool":0},"KXMy-hTYDgQ8TRWHh5a6MA":{"text":"I go here at least once every time I'm in NOLA.  Bread on the po boys is excellent.  Never","useful":0,"cool":0},"QU-dfRzA0E0c4WkwRU-9Kg":{"text":"We came here for breakfast and were not disappointed at all! It was packed, just about eve","useful":0,"cool":0},"YKc-WkK8EqMS-C-SjPaDLQ":{"text":"the four stars is not for the atmoshere or the service its simply the food-po boys. This i","useful":0,"cool":0},"1vto4BEUL2d6-q4ByZUoJg":{"text":"When you work in the quarter and you want a po-boy, this is where you come. They have a wi","useful":0,"cool":1},"HHsaiJ2k02zTeEhlnCgnIQ":{"text":"Read about Johnny's from Yelp. So had to try it...\nagain...OVERRATED!!!\nwhat is up with yo","useful":1,"cool":0},"P4vkSiez6wWqa25kXjYomw":{"text":"Don't waste your time with other spots, just head straight to Johnny's. I had po'boys all ","useful":2,"cool":1},"l4MVRRq6ZwS6ILBneM7sKQ":{"text":"I happened to stumble on this place while walking around and was pleasantly surprised! I h","useful":0,"cool":0},"W0VAWP-RdJe5pPjuuIfqkw":{"text":"the portions at this place are HUGE.  My friend and I ended up splitting one crawfish sand","useful":0,"cool":0},"MtjmALaSpiLUHu718t1r6A":{"text":"This place came highly recommended by a friend who is a native. Maybe I am missing somethi","useful":0,"cool":0},"97JCsb7TjakW2T_BgMNgOw":{"text":"I found this place to be just \"meh\" not bad but nothing memorable. I got the fried shrimp ","useful":0,"cool":0},"88uJvV_9NeZzM5RmQSNa1Q":{"text":"I don't get it. What's the big deal? Not only were they rude to my boyfriend and I,  it's ","useful":0,"cool":0},"9D6BFDHcsakl3yseRMkljw":{"text":"The cheapest breakfast we found around. Food was great, we had breakfast 2 times there. Ge","useful":0,"cool":0},"GQfUH5KNl9zB-zH8wDaRaA":{"text":"Boudin balls are not supposed to be frozen on the inside.\n\nShrimp on a po-boy are supposed","useful":1,"cool":0},"rtL7lrMxwIv6Mh3sTEHOYw":{"text":"Crazy crowded and cramped, but it's just because everyone wants to eat the delicious food!","useful":0,"cool":0},"i5GaN2uFuDHlIr6TF8sSMA":{"text":"I came here twice and got sick both times. I had the Jonny's special and the bread was dre","useful":0,"cool":0},"Y1UYmjXr85usNGcUtFPk1g":{"text":"The muffuletta and the soft shell crab po boy are great.  I stayed in the French Quarter f","useful":0,"cool":0},"9V4ZssVuWP88AHA3PDUpzw":{"text":"I don't understand how the sandwich could have gone so terribly wrong. I was told by many ","useful":1,"cool":1},"5wN4ygc3vwPCMBpOI5UbLQ":{"text":"The Judge Bosetta is the bomb.\n\nHanging around the French Quarter with the family and was ","useful":0,"cool":0},"VOzS5hTA7peBQQzgejNlGg":{"text":"Johnny's is an excellent option for poboys in the French Quarter.  It's also a good option","useful":1,"cool":0},"ForbRNrPsfK61sx9r6I12g":{"text":"Great place to eat lunch very crowded and delicious food. Good service, remember don't be ","useful":0,"cool":0},"yYcmXdVRreifS7dN6zqP2g":{"text":"The po-boy itself was alright, but looking around, it seems like the triple-decker Texas T","useful":0,"cool":0},"lQeyqelS-EM0rYcSi6yl-g":{"text":"Roast Beef Po Boy ... last one I had here was a decade ago ...STILL as good as I remembere","useful":0,"cool":0},"OzImLQzjKr9J4rmBMWSj-Q":{"text":"stumbled onto this place while walking home from jackson square. We assumed it must be goo","useful":0,"cool":1},"LPT3ulYeKBhXgcspyo0QTg":{"text":"FIrst time to NOLA, and I really wanted to try good po-boys. Johnny's didn't disappoint. I","useful":1,"cool":0},"8kiErxHA6BVjU7jcXJhpcA":{"text":"Got the surf and turf. Great tasting sandwich, love the combo of beef and shrimp. Make sur","useful":0,"cool":0},"PACf6_GhdSo96aHZPSy1PQ":{"text":"In retrospect, I should have chosen a more regular po'boy and not the gator. I definitely ","useful":0,"cool":0},"26q6tGjIxTKbtV3NoeTm5Q":{"text":"Damn you Johnny and your great Po-Boys! I was trying to ramp down after a long week of Jaz","useful":1,"cool":1},"TKDsvHAUSkDhv_0j5EHtEg":{"text":"Man this place is on the one!!  Me and my friend were walking the hot streets of New Orlea","useful":0,"cool":0},"cgHVpKgdfpr2kUbciCHbHQ":{"text":"Tiny, hole in the wall joint. Apparently the \"best\" po-boy in NOLA. Who named it that? And","useful":0,"cool":0},"xoYQ7UErLwKDwA_1HVUX9w":{"text":"During a recent trip to NOLA, we deciced that we had to try the world famous NOLA Po-Boys.","useful":0,"cool":0},"8gqGcvD54GV6rPLxgDhSLw":{"text":"I'm not quite sure what the hype is about this place? I ordered a shrimp poboy but barely ","useful":1,"cool":1},"VYa7dx5QOpfwHcUjejT8DQ":{"text":"great shrimp po-boy\nnot much seating so you may be eating out on the side walk\nMy friends ","useful":0,"cool":0},"WB9kC5wQ_6kRwNCi36M7yA":{"text":"Gator po boy. Nuff said.  The sandwiches are pretty big.  Big enough that I split one with","useful":0,"cool":0},"54MSjocNOpvbwU-5FTa9OQ":{"text":"Johnny's is the place my wife talks about every time we visit New Orleans, as it brings ba","useful":0,"cool":0},"ALjZoX0vYNAJG5d0EGuR9w":{"text":"The shrimp po-boy was delicious here, with a good amount of shrimp.\nYou might have to wait","useful":0,"cool":0},"Q8zNDecex6j0K80i9GvlnQ":{"text":"Ate the shrimp po boys for lunch and they were delicious; bread was nice and soft and shri","useful":0,"cool":0},"PT-eWgjmJmcr0ItvXXK3yw":{"text":"Cannot go wrong with this place.  Give it a try for lunch one day while in town.  Fast ser","useful":0,"cool":0},"EjZQuExqTuZe2RL1ZVOyvg":{"text":"Excellent! I have been trying to make it here all trip but it closes a bit early.  I an ha","useful":0,"cool":0},"xOyb3lVLmizRWPAa0U4XhA":{"text":"My first real po' boy experience and it still remains one of the very best. I love you Joh","useful":0,"cool":0},"49jD6GDqllrTDT63N7DU5w":{"text":"Loved the roast beef po boy, and gumbo CASH ONLY!! It was super busy when I went Saturday ","useful":0,"cool":0},"5dCQap_ZIpJmct_eUruYgg":{"text":"Another suggestion from our hotel. Following Rock n Roll New Orleans, we were HUNGRY. We t","useful":1,"cool":0},"weW_GqDPOmLp9YjBO30UuA":{"text":"Wow! The shrimp po boy cannot be touched amazing!!!!","useful":0,"cool":0},"xcvEDDlycrhpyJxpqtSkiw":{"text":"We tried both breakfest and lunch and they both were good!!!","useful":0,"cool":0},"O-DJEOqsWIdXJLYSXTZYqw":{"text":"Yahhh finally Awesomeness!! I got the 1/2 Shrimp PoBoy with gumbo and a drink for $11.95, ","useful":0,"cool":0},"oGACAEJwhwiOC6BkxMaUqQ":{"text":"The chicken and biscuits with white gravy rocked my universe....and I don't even like whit","useful":2,"cool":1},"cmJqbaWoUfZFAzx2xdpPtA":{"text":"Some of the best po-boys you will ever eat.  Johnny's special is a must (ham and roast bee","useful":0,"cool":0},"x335WP84DfDlZ8UzZ_QtXA":{"text":"Hands down the best po' boy I've ever had.  I wanted to go here everyday during our vacati","useful":1,"cool":0},"bPfks9IsvvfL03vVlPu_WA":{"text":"I came here on a friends recommendation. It's a little overpriced for the greasy hole in t","useful":0,"cool":0},"O76YE-ryes8Q5vIuc8LC5Q":{"text":"I have been to New Orleans plenty of times chasing the \"Taste of New Orleans\" or Cajun foo","useful":0,"cool":0},"TpAk-7qFFILSieO0jsbVWg":{"text":"Super long wait for a sub-par meal. We got the shrimp po-boy and it was good but poorly as","useful":0,"cool":0},"Gxlfk3_Nglxafx729xfVOQ":{"text":"Way too expensive for what it is. I ordered the spicy sausage po boy for $12 and after wai","useful":0,"cool":0},"RYhIuJsLcshEBWCLP2qBeA":{"text":"Great place, old school and I love that. I had my first muffuletta, I could only eat half,","useful":0,"cool":0},"1BtbsaBAe_CbqBUk1jJ4ug":{"text":"Be prepared for a long line, but it moves fast.  It's jammed inside, so I never eat inside","useful":3,"cool":0},"RA_VSZK3hZUWSuEl1pQl3w":{"text":"I think this place is just ok.  I had the Shrimp Po Boy, and it was...just okay.  The shri","useful":0,"cool":0},"y5ARviST7jHpLsPknzpmxw":{"text":"Perfect shrimp po-boy.  Perfect bread, batter, sauce.  Perfect.","useful":0,"cool":0},"M8oYcltMCkIYU7lQ5uDS7Q":{"text":"I always make it a point to come to Johnny's when I am in town. Is it the best poboy I hav","useful":0,"cool":1},"KCeNqUaw6Ho0Znwdug4gGg":{"text":"Now THIS is a traditional poboy. Authentic, fried shrimp, crawfish, and/or oyster po-boys,","useful":0,"cool":0},"6rS1mmWRGD-zx_-gUiUUYA":{"text":"Went here twice in two days, both times I got fast service, hot po boys (shrimp and catfis","useful":0,"cool":0},"oMCF0OvE_v3DFYuDVxlRtA":{"text":"My Shrimp po boy was mediocre at best and the cafe itself was FILTHY!  You can do much bet","useful":0,"cool":0},"dq4h5hqzll5uheqBbahkkw":{"text":"I found the roast beef poboy pretty good.  Three and a half stars.  It was $10.  There's n","useful":0,"cool":0},"Bf8kqijYllemp3frOQuSBw":{"text":"It's been said, by myself as well as others, that being an original doesn't always mean be","useful":3,"cool":2},"940vhpmFoxNjj1lpFxiPMw":{"text":"Disgusting dirty and disappointing. Enough said. We threw ours away. Don't go there and if","useful":0,"cool":0},"elU3UqyjNySF_fXEkvY9Aw":{"text":"Had been searching all weekend for that classic fried shrimp on French bread po-boy. Shoul","useful":0,"cool":0},"2t9FbacoHpHpctKMmy6T3A":{"text":"Really tasty, but beware, they are big sandwiches! I wish the guy at the counter would hav","useful":0,"cool":0},"kJWHpFyZAPFuHQeh0TPLTw":{"text":"I love the PoBoy's here! I'm not an expert, but they've always been great. I would've give","useful":0,"cool":0},"t0IuqALYtsbSj0hC6wt4cw":{"text":"Let's start with the only positive I have. The French bread they use is good. Super fresh ","useful":0,"cool":0},"d51CmiFPfOMj1oJk2EuZQw":{"text":"First day of our honeymoon, we started talking to a local woman on the streetcar about pla","useful":0,"cool":0},"iUssY3OWqL7fkuhBE_Y47w":{"text":"Johnny's has an endless list of po' boy sandwich choices, ranging from alligator sausage t","useful":1,"cool":0},"8gAe3wUMDlpqltpHZEIMWQ":{"text":"They were closed but there was no sign. The kitchen door was opened so we asked and the ma","useful":0,"cool":0},"O1bv9TGl1YlafeVN_jzokQ":{"text":"Came here during SfN, which I think contributed to the enormous line at this place. I was ","useful":1,"cool":0},"4CKkrVrk2pV3GUb9OH6mQA":{"text":"Worth the wait. This has become my go-to for a muffaletta. Excellent thin sliced ham and s","useful":0,"cool":0},"bAEXjp5dAW3gaF5m5snsFw":{"text":"Went here for breakfast and it was GREAT!!!!  You must try this place if you are in New Or","useful":0,"cool":0},"tCUTLxPIozbe13_TzNKj_w":{"text":"another roast beef po-boy let down. tasted and looked like deli sliced roast beef put in g","useful":0,"cool":0},"95Duk4kplQ5ouhzzStNliQ":{"text":"This is my kind of place.  Hole in the wall.  Well established and down to earth.  I order","useful":0,"cool":0},"gD1463OiWtSGNcrKaUg0RQ":{"text":"I spent a good deal of money in here and I still don't regret it. Bread is so light and de","useful":0,"cool":0},"BISzd25vKVMOQ76qzhzz8Q":{"text":"The food was good... and they serve this pie by the slice(I believe there is a bakery upst","useful":1,"cool":0},"v37yhgBXVGjLJyFdRkH3rg":{"text":"Great food for the value. Had the poboy special-half poboy with seafood gumbo and a drink.","useful":0,"cool":0},"ii_ypb10hDDCkqSuthKMAA":{"text":"You will wait forever for sub-par food here. \n\nFirst, we waited in line for about 25 minut","useful":1,"cool":0},"PeUhNLOy3_ahrMFJLOFueA":{"text":"We were told by our Uber driver that Johnny's had the best Po Boy's in the city so our gro","useful":0,"cool":0},"zilOgskM0gOv7LAZWT7fAQ":{"text":"They have a lot of selection of poboys. We had roast beef and its so yummy and also cheap.","useful":0,"cool":0},"ThSEUru3oxYSZ2-OVANPbQ":{"text":"My only complaint about Johnny's is that the po'boys are too big for me to finish in one s","useful":0,"cool":0},"MBf0UcHIDPNab5V1mPuSdA":{"text":"While  waiting for about an hour in line outside Johnny's just to order , we stumbled onto","useful":0,"cool":0},"JanwWoEb_2ULhqBHMVPv4g":{"text":"Positive: The shrimp po-boy is good and so are the cheese fries.  We liked the bread and t","useful":0,"cool":1},"7qw4LEA-_ZImGJNVLEuISg":{"text":"Delicious.  Small and home style paper plates and plastic silverware.  Hubby had bacon and","useful":1,"cool":0},"HJfYMFBrMz9F-Jn-WBr_1Q":{"text":"great po boys of all sorts served on crusty French bread. Nice biscuits for breakfast as w","useful":0,"cool":0},"fLiV3g3deEbZv8P4uWZYpw":{"text":"This was our 4th stop on the Tastebuds Food Tour. We actually tried the muffaletta sandwic","useful":0,"cool":0},"rtk_TpcjkFKuGYS7YTaMkw":{"text":"A great locals spot for lunch. Don't get scared away from how the place looks. It's nothin","useful":0,"cool":0},"Uk3n4xtP5uOFfVPL9FsS5A":{"text":"Johnny's is either our 2nd breakfast or our 1st lunch!\n\nThey have great biscuits and when ","useful":0,"cool":0},"NLsqGWvly8C2g0-UkgHtjg":{"text":"I have lived a couple blocks from Johnny's for the last 5 years and have eaten there many ","useful":1,"cool":0},"nL2DiMKJFfU3uBiBhujClQ":{"text":"In 2013 the wife and I took our anniversary trip to New Orleans. We saw this restaurant on","useful":0,"cool":0},"_fevDjBlZz6kBBrZ7bY-Zw":{"text":"Shrimp po-boy was good. They give you a lot of food. Gumbo was hot and good. Only accept c","useful":0,"cool":0},"KjlVMojItrsLCmAM6KLO_w":{"text":"This place gets very good reviews for its Po Boy sandwiches.  There is a very good selecti","useful":0,"cool":0},"W85GLa3eGLYlQG7xaz0xJg":{"text":"Food was just \"okay\". The gumbo had NO flavor and was just blah. We had the catfish po boy","useful":0,"cool":0},"MepL7KmKtEPDzxd-aoSD6g":{"text":"While I originally thought this place was a complete cluster f, the chaos was totally wort","useful":0,"cool":0},"oBo9ifRx3CGvuiMOZuj7cw":{"text":"Amazing Poboys! Whether you're a tourist or a local, the poboys they serve here will steal","useful":1,"cool":0},"l862CYPzBI2AOv-bMYtbjA":{"text":"I only ended up here because it's a tourist trap. Since there are a bunch of reviews I'll ","useful":1,"cool":0},"xOZdsDre5k_jaP1bC35SCw":{"text":"kitchen staff was sweet and food was decent, but subs were cold and nothing to write home ","useful":0,"cool":0},"sAuyxq_V2poTSyG9YWx6Pw":{"text":"Was recommended Johnny's as the best Po' Boy in New Orleans by some friends so I went to t","useful":0,"cool":0},"jX1qltObdcvV4xDD4dFPhw":{"text":"We were roaming around the French Quarter and were looking for a less-fancy place to get s","useful":0,"cool":0},"zFC__vlYiKfEuCMYhz-4Nw":{"text":"My bf, a sandwich-lover, was really looking forward to have a great poboy during our NOLA ","useful":2,"cool":1},"SL_-4gWiq1p8tLM-njclMw":{"text":"An amazing po-boy at a reasonable price. I got a rediculous cup of gumbo and half a shrimp","useful":0,"cool":0},"R2rjryOb_gt3hIhoJM_Bfg":{"text":"This is a small greasy spoon with both breakfast (the biscuits looked amazing) and poboys.","useful":0,"cool":0},"Oh9It3NcPti67RnEU0MJWw":{"text":"Had to try Johnny's based on all the reviews and personal recommendations this place got.\n","useful":0,"cool":0},"_pl76qlf4wd9cA6sPRLZAQ":{"text":"Great Po Boys. I had the roast beef & my husband had the  chicken tender po boy. Both were","useful":0,"cool":0},"BwYDb8KX9MKEAlc_uaYkVQ":{"text":"One of my last restaurants I tried in NOLA!\nOK I wasn't prepared for the pace and the size","useful":0,"cool":0},"G3bA1YxbZfc5VtR_AXh9ug":{"text":"Ordered turkey and Swiss po boy to go. Asked if we wanted it dressed (lettuce, tomato and ","useful":0,"cool":0},"DTLpPLJo0mdCzWxyrGkSFw":{"text":"A great po' boy! Very generous with the oysters, which were sweet and delicious. The price","useful":2,"cool":0},"1YJFm7DQTG-Rvbh7VvXLIw":{"text":"My first trip to New Orleans and I did my research. Johnny's was rated very well and right","useful":0,"cool":0},"Sj1tcRyxYY7jCKxtFaSj_w":{"text":"Native Louisianian here and whenever I head back to NOLA I MUST GO TO JOHNNY'S!!! I took m","useful":1,"cool":0},"Ix5Qps3MIjhKFKTx5Zeu7w":{"text":"After yelping this place before my visit to New Orleans, I am happy to say this was a grea","useful":1,"cool":1},"tBS8002bDTl0LJG2DtRlmQ":{"text":"The tour guide said this is the Po-boy place to try. The place is simple and not much of a","useful":0,"cool":0},"5xYBvN7_LvzKvfvvWZbFyg":{"text":"Food was ok, customer service was indifferent. Not friendly but not unfriendly just like t","useful":0,"cool":0},"iT55EykPP2Guhd1P2YnW0A":{"text":"This is the stuff we drive from Houston for!   I recommend the country fried steak.","useful":0,"cool":0},"lli5IaFdwggo-Qs1UYhHiQ":{"text":"I loved every bit of my po-boy! I ordered the roast beef and my husband ordered the surf &","useful":0,"cool":0},"bJagTEw0zzTDri8mnR0Qnw":{"text":"The best po boys I've ever had! Me and my wife stopped in for the shrimp and blackened chi","useful":0,"cool":0},"xLrn806UNvP0L1hGxQ-21Q":{"text":"Went for lunch on a Thursday. Crowded as hell! Great Muffaletta though. It was huge and in","useful":0,"cool":0},"wuilOokpmNP4PTcA2oH61g":{"text":"This was our first stop as we got in at our trip to New Orleans!  My husband really wanted","useful":0,"cool":0},"TLnyCagZgLdAGyOtN1gQGQ":{"text":"I really like this place.  It can get busy at times, with the long lines, but it is worth ","useful":1,"cool":1},"0wE2FBz95x5wgxHGTL5Zjw":{"text":"Behind an unassuming exterior on a small side street lies this culinary gem. Walking in to","useful":0,"cool":0},"nUbgN015pLElO4MMByIPSA":{"text":"Johnny's is a small place and usually packed, so be patient and come here when the weather","useful":0,"cool":0},"iyqjtbUWCrpsceMxEh8Myg":{"text":"You have to come in to this place, very authentic great po- boys amazing selection you can","useful":0,"cool":0},"wO82wN3sBHGyVeoLEWOY0g":{"text":"A local tour guide recommended this spot. I enjoyed my roast beef po-boy but I have had be","useful":0,"cool":0},"D3sycnAPV3YzC5s9Rdq7Cg":{"text":"HUGE oyster poor boy. So fresh and delicious! Still dreaming about it a week later, lol.","useful":0,"cool":0},"RN50vhL8j9KsOvUc35QhQA":{"text":"Save your time and money because Johnny's does not live up to the hype!!! The line is usua","useful":4,"cool":0},"FqtFro1G8gP3CGv9SGka7w":{"text":"The food was out of this world, I recommend the surf turf and judge bosetta po boy. It is ","useful":0,"cool":0},"6FSF57t_qyRrYgZNLdnNNA":{"text":"Considering every cafe or restaurant has po boys, i dont understand why this one is that m","useful":0,"cool":0},"INc9kBcl1h6ocWMbeVSJQA":{"text":"Heard lots of referrals from locals. I ordered the shrimp Po-Boy, dressed. The bread was d","useful":0,"cool":0},"8JzQO4LV-Gp37CufxzplKA":{"text":"I was surprised by the not-so-stellar total ratings by yelpers!  \n\nHubby and I came in Oct","useful":0,"cool":0},"ojmrxQPTBkT4rW8BqXgQqQ":{"text":"This was recommended by a friend who lives near the French quarter.  My family and I were ","useful":0,"cool":1},"8_P3zd5-5ndK5ERYpGJppg":{"text":"Stopped in for lunch on a Tuesday. Service was fast. Oyster Po'Boy was awesome. Simple atm","useful":0,"cool":0},"AyK5PFfAWYOY_6kOTXrPkA":{"text":"Shared a shrimp po' boy, muffaletta, and fries with a friend...the po' boy was good, but n","useful":0,"cool":0},"dtOIKuMpKkabPjUOSWppOg":{"text":"This place was recommend to us by a few NOLA locals. However, we were disappointed with bo","useful":0,"cool":0},"LjrvFfEuSpMIv0NrQboTHQ":{"text":"I've been here twice now & love it!  It is what it is, you stand in line in a small crowde","useful":0,"cool":0},"STk8a6StdoR1WFTWLEcBkg":{"text":"Looking for a Po' Boy sandwich whilst in NOLA?  This place is a good option.  Small and ec","useful":0,"cool":0},"1NtpeUCqt6CSySLUuzzz7A":{"text":"Recommended by the taxi driver, the concierge and the valet, we had to go to Johnny's. It ","useful":3,"cool":1},"ZiIG8hbZRLOMXnOhVQMIxA":{"text":"The best perfectly cooked and prepped sandwiches in town! Sandwiches are big enough to sha","useful":0,"cool":0},"zao91h5BYAe8uFzpmb867Q":{"text":"Just came back from a trip to NOLA and I'm letting this place be the first of MANY reviews","useful":0,"cool":0},"vHg894V0r5mCFd8AxX-FoA":{"text":"Great Muffuletta...better than most around the Quarter.  I like that they grill it for you","useful":0,"cool":0},"lMg_7-AWFdsk978jdXgQxw":{"text":"Its a very small place. Thats fine.  It was hot.  Thats fine too. The prices were cheap.  ","useful":1,"cool":0},"rQHgsxrSA8wVvhxvFSU2tA":{"text":"Found this place bc it was recommended by locals. Food is great but it takes forever. I wa","useful":0,"cool":0},"1M52fS8tznSuSdGtS0sUaw":{"text":"Damn! They should have warned us! Them sammitches is huge!\nA great lil po boy joint. Unpre","useful":0,"cool":0},"yT8mYVeUewk-YT-yJSjeQw":{"text":"This place was suggested by a coworker who has visited before and it was just okay. Got th","useful":1,"cool":0},"-zWLYFgbVIcrEtJS7ZCCCQ":{"text":"Life saving breakfast!!  After drinking like a kid, I woke up and stumbled out of the hote","useful":0,"cool":0},"rH4gtGtyjf3JrkL1pJ9MtA":{"text":"Shrimp Po Boy was ok but not the greatest.  I had the voodoo po boy at half shell in Bilox","useful":0,"cool":0},"OBygSrQ8gmfQjm97sH49Ag":{"text":"All through the years this place has maintained its ability to make a very good New Orlean","useful":0,"cool":0},"NuwYQpvu98QXfIJd3IzwTw":{"text":"My husband is an avid follower of all things food channel, so when we decided to take a Ne","useful":1,"cool":0},"SPDEPjn9NPYWrtsQue4arg":{"text":"DISGUSTING JAMBALAYA !!!  The rice was so overcooked that it was like eating a plate of mu","useful":0,"cool":0},"YmSwye9xAvNNH92s5GGAag":{"text":"As my first experience eating a Po Boy, Johnny's gave me much delight. I ordered a shrimp ","useful":1,"cool":0},"ZE51Xe4Dx19UBMeL0UPfwA":{"text":"It's been about a year & I was finally able to get back to Johnny's.....my original review","useful":0,"cool":0},"6QPwddMlPOFwbJwRqV-QfA":{"text":"I found this place wandering randomly through the French Quarter in search of breakfast. I","useful":0,"cool":0},"2l3KpDqUdcP4SIncmFZ6PQ":{"text":"The food is awesome. Interior is small and busy, and service is slower than I expected, th","useful":1,"cool":0},"ay7bCkSvVKG5KpPesIDNMA":{"text":"JPoboys did not disappoint. The food and atmosphere is a definite French Quarter must. Shr","useful":0,"cool":0},"5NI15yTLAyYRQRXTPw97Mw":{"text":"Three and a half star. Slightly overpriced and they charge you for lettuce, which is weird","useful":0,"cool":0},"3-gGe4VDLAR3o_ESsgOIEQ":{"text":"Looking for a good Po Boy, I highly recommend this place.  So many choices and yes, they d","useful":0,"cool":0},"JT0DmizxfXUhAFhx3at49g":{"text":"I was unfortunately disappointed with this place.  After hearing so much about it, missing","useful":2,"cool":0},"kMnDXMZ_WMzX_yzFn1IULQ":{"text":"Very good. If seating looks sparse, have a buddy run upstairs and hold your table. It's ca","useful":0,"cool":0},"pHUeiQlWWugt77r7hux6eQ":{"text":"Love Johnny's poboys! The shrimp are fresh, sweet and a little small.  Fresh bread and gre","useful":0,"cool":0},"bzCfPPnWjmi2ZOWTn7N_Xg":{"text":"Found this place while searching on my Yelp app for a po'boy!  I had the alligator sausage","useful":0,"cool":0},"FW1POyfBCmCPFovkM6eIPg":{"text":"I had a combo that was enough food to feed an army-half a shrimp Po boy and a massive cup ","useful":0,"cool":0},"e610jzwCG-REcaSIxp4P7w":{"text":"Best Po Boy and longest standing in New Orleans. The sandwich was too big to finish in one","useful":0,"cool":0},"bnHlwZauwnztJuwtrGSVUQ":{"text":"The line was definitely a bit longer than NOLA Po Boys and the food took awhile to come ou","useful":0,"cool":0},"1ED6p1ZgPJ-LAhExCTcn7Q":{"text":"This was my last official meal in Crescent city, and it was a good one.  Johnny's Po-Boys,","useful":0,"cool":0},"-sApOCS6Ku3LPZ-7gqn5RA":{"text":"We walked in yesterday in search of a quick bite with new Orleans flavor. Johnny's deliver","useful":0,"cool":0},"ddUHvei7ODRth5Ibz4KkFg":{"text":"The line says it all!  Great shrimp and softshell crab poboys.  Soooo much shrimp that it ","useful":0,"cool":0},"fb3j5Cn-ZXdOe9LqwpBt-A":{"text":"Meh. \n\nI got the shrimp po boy. The shrimp was good but other than that it was super bland","useful":0,"cool":0},"0IgdNZkDBqMuDj8T96mQgw":{"text":"We visited here on a recent trip to New Orleans based on the reviews we read here.  While ","useful":0,"cool":0},"C1vQ22NixfpEP-DPCGdKeA":{"text":"No frills, high value, the real deal in the FQ. I had half a muffaletta, super garlicky an","useful":0,"cool":0},"BLMvRUatiTPTL1UhKrB2CA":{"text":"Born and raised in NOLA, I've had a bunch of poboys in my life from different seafood plac","useful":0,"cool":0},"rAPX0ZfTLN-kcARnoX8sOw":{"text":"This place is way too hyped. Its just as good as eating Jimmy Johns. Not enough mayo, toma","useful":0,"cool":0},"pGEPCu4AMkve_60WDZtLIQ":{"text":"Showed up at 9:00 for breakfast, every table occupied(maybe 11 tables there) but by the ti","useful":0,"cool":0},"mWqoF_SrE3SRhqIBMpR1FA":{"text":"I found this restaurant in a New Orleans Travel Guide and decided to check it out. When I ","useful":0,"cool":0},"JXW4C9IE91a1VDk7Vb2DWw":{"text":"First time here. I had a very delicious roast beef po boy and was quite pleased. It's a no","useful":0,"cool":0},"-O9AdpSfoTYpm8xKfimcvw":{"text":"It can get crowded. It's a small place but the food is great. Highly recommend some gumbo ","useful":0,"cool":0},"9amLzAsQRPEYG1sCXI-Axw":{"text":"I loved Jonny's Po-Boys.\n\nI got there early enough so the line wasn't too bad. It can go d","useful":3,"cool":2},"WokX3HkJwTGbnxnpKEw44g":{"text":"This is one of the primo places to go for qa po boy, the choices are so extensive it's min","useful":0,"cool":0},"DEDUiNL5JG3GlPfO-4Ftnw":{"text":"The place was packed, but they got people their food fairly fast, and I was able to nab a ","useful":0,"cool":0},"Bc8HVn6_3iNjDQ4OkCS-_g":{"text":"I love the shrimp PoBoys at Johnny's. They're the best. So many shrimp you can keep then a","useful":0,"cool":0},"Fj20o0Erdqd8PaWbGqF2QQ":{"text":"Went to this place for our first lunch in New Orleans, because the Muffuletta was featured","useful":0,"cool":0},"65WCC2DM30GWAJa1Rwr1_g":{"text":"I mean, for an 'institution' I expected better. The soft shell crab po boy was good, but n","useful":1,"cool":1},"8ClIQzM35--Igg_cLtsoVg":{"text":"Worst employees ever. We ordered food and they forgot an item. We called them and told the","useful":1,"cool":0},"GM9GmLdjQFRU_8k2ID6cLg":{"text":"Pretty good food, great huge selection of Po Boys, however like most other places in the s","useful":0,"cool":0},"82WFrS_EADcv3aO0MaP8sA":{"text":"Excellent!!!! Every time! Best poy boys in NOLA!","useful":0,"cool":0},"iDzjByJJXRvImdzn2w-Gtw":{"text":"This is the place that my oldest son bases his vacation on. He loves the alligator sausage","useful":0,"cool":0},"LgHQjlMY9Iz49tSvp1e1xg":{"text":"Got the alligator sausage po-boy delicious! The wait was long but po-boys were well worth ","useful":0,"cool":0},"kM7Etjc52qunz4U9g3wTEw":{"text":"The food was great. I had the 1/2 gator PO Boy with a cup of Gumbo. Both were fantastic. T","useful":1,"cool":0},"Z8lsHS5fbE24y8CR7sixfw":{"text":"The Po boys were the best we had in New Orleans. Be prepared as they only take cash. The s","useful":0,"cool":0},"G0iHSaMOm0XPrle9u4vj7w":{"text":"Best Chicken Po-Boy And Best Shrimp Po-Boy (Add Cheese) In NOLA \nThe Muffaletta Was Disgus","useful":0,"cool":0},"Ym_R2UGG85T6rDKfeyMiCw":{"text":"I got the half-shrimp/half-catfish for $11 with dressing. It was very bland and had no sea","useful":0,"cool":0},"--yP5h1uQDTTpxC5JYwfcA":{"text":"Rating this was tricky.  OK... I know Johnny's for their outstanding old school po'boys.  ","useful":0,"cool":0},"byE20SIqaKzWZ2Zqlcm-Hg":{"text":"Fresh bread and tasty ingredients. If you haven't yet had your fill of oysters and shrimp,","useful":0,"cool":0},"OpSWyklYPGplgTBeSdiDxA":{"text":"All right, our mule-driven carriage driver swears by this place and said they were the bes","useful":0,"cool":0},"mda0TA0uLnmjPN3MCP055w":{"text":"Great place if you like rotten tomatoes, shrimp that hasn't been deveined, low quality ove","useful":0,"cool":0},"VJlWg7OaHO8IKpb5tr-EbQ":{"text":"Ok - so I gave three stars basically because I didn't think it was that inexpensive overal","useful":0,"cool":0},"dg3O2BCgGAvgHZdDAvbfIA":{"text":"I got the crawfish po-boy and while everyone always says you HAVE to get one in New Orlean","useful":0,"cool":0},"BsXSxjKWqdGPuYu4r19Rmw":{"text":"Came to Johnny's around noon on a Thursday right after arriving in New Orleans. The line w","useful":0,"cool":0},"dJv0iO4EhxLWVe01uRjyeg":{"text":"The place is jammed packed all the time.   I had the shrimp poboy and it was very good.   ","useful":1,"cool":0},"PLxr5g-6OL0uLiZdT53YFw":{"text":"When I was in Philly, I ate the damn cheese steak for breakfast, lunch, and dinner.  When ","useful":1,"cool":1},"gA4MfmtdvqW2eAgihvsA9Q":{"text":"I typically love Nola food... but the soft shell crab at johnnys really misses the boat. I","useful":0,"cool":0},"6BQOBuyQmgZKJYTi4cYi_w":{"text":"As expected...great vibe...busy busy...Po-Boys delish as was the gumbo! Sat and listened t","useful":0,"cool":0},"F4KtcADbiaHhA-0FwD62LA":{"text":"Big portions, the shrimp had too much breading. The Muffuletta was tasty. Seems to be very","useful":0,"cool":0},"Jl-i_fhH6d_ui01SVq39mw":{"text":"Johnny's Po-Boys ****\n\n\nQuaint, classic po-boy joint featuring 47+ different kinds of po-b","useful":0,"cool":0},"Dgn5EyLq1hpJNIO1XjbH_w":{"text":"All cash establishment, arrive early to avoid the crowd. Large servings, but they offer 1/","useful":0,"cool":0},"MiFvD7MjnsJv25yj_q9kSQ":{"text":"I have no idea why people rated this above three stars.  Compared to other French Quarter ","useful":2,"cool":0},"ZBh07_ZfKIE4aU2Yvf6Xcw":{"text":"Great shrimp po'Boys. They have named ones they have any po boy you can think of. I always","useful":0,"cool":0},"ZC93u06ZwhGi_l-Qgl5PPA":{"text":"Far bellow any expectations and what advertised by the tour guide.. Shrimps are very dry.","useful":0,"cool":0},"Qc5JyZS-KEwb-Au3lhOETA":{"text":"Everything they have here is fried!!! \n\nI went here on a recommendation from a friend. He ","useful":0,"cool":0},"5-BkgpMs_2IkdBjnk9zcTg":{"text":"I learned two things: I hate muffelettas, and I can squeeze into tight spaces.\n\nThis place","useful":0,"cool":1},"XRSyqrNBx-oJBJWcFKeWTw":{"text":"Food's good, and although a bit pricey it's worth the cost. What's NOT worth it is the stu","useful":0,"cool":0},"djHoPq-U8HsaXcu6yHy-bQ":{"text":"I had the Judge Bosetta and fries.  Both good.  The Judge is a po-boy with patties of mixe","useful":0,"cool":0},"TrxTgySH6aZqFv02txz7bQ":{"text":"Service and food is always EXCELLENT!!! The staff are friendly! The cashiers always have a","useful":0,"cool":0},"Q-fp5E8cZIcUI-LFcAQ4bg":{"text":"Delish. Share your po boy, though...I can eat and this thing was too big even for me.  I h","useful":0,"cool":0},"497ulc_WtP1bz60P9Paeow":{"text":"Amazing! Got the 1/2 and 1/2 (i.e. Oysters and Shrimp) po-boy and it was heaven on a bun. ","useful":1,"cool":0},"dx-udygd9Zwpk5a_2xgzvA":{"text":"Crowded with a line out the door.  I thought surely this is the place!  But unfortunately ","useful":0,"cool":0},"S2knne030XS-u5mvUxHpHA":{"text":"Great Po Boys and the perfect spot for lunch on my trip to NOLA for the Saints playoff gam","useful":1,"cool":0},"19xi8_dT0-D1RCGIgBN9pQ":{"text":"This restaurant was right down the street from our hotel, and we loved it so much we had l","useful":0,"cool":1},"fsIHRjZ2GlvtzKUXl8E7OQ":{"text":"In the Quarter and wanting a poboy?  Go here.  Everything they do is glorious.  Roast beef","useful":0,"cool":0},"Vj6OQKGbFQP03YdvulVDOg":{"text":"This is the super popular place to get po boys apparently. It was recommended by the horse","useful":1,"cool":1},"7r65WiAohbETNTdhEwWgLA":{"text":"Guys!\nThe shrimp Po' boys suck here! \n1) Bread-  dry\n2) Spread-  boring mayo\n3) Shrimp-  b","useful":0,"cool":0},"Ch1q2lizKJnv0DYlnwcRtg":{"text":"Fantastic food, friendly and fast service and great big yummy sandwiches.  Me and 4 other ","useful":0,"cool":0},"lALgSpUF1PeBsfh2HiEcSA":{"text":"Great \"Hole in the Wall\" Poboy shop.  Small venue, so go early if you want a table.  I had","useful":0,"cool":0},"hEP8btC9oUKSACgF5mUnBw":{"text":"Fantastic sandwiches (i love their muffaletta) and Abita beer in a great location.  Be pre","useful":0,"cool":0},"qgi24lgGz_DTaF5r-WuFeA":{"text":"We heard from at least 3 people to go to Johnny's. We arrived and waited about 20 minutes ","useful":0,"cool":0},"7TGHK_Bgg0HwBUH3Z-oWpw":{"text":"Gotta get the fried oyster poyboy, it's the best. There's no shortage of oysters in your s","useful":0,"cool":0},"ZdJt87d0tXQ3v7KDPtnuew":{"text":"Service a little slow on non busy time of day but po boy sandwich was very good. Great foo","useful":0,"cool":0},"BGoO6YIGGPtK4z2R5Ps58g":{"text":"Fantastic Po Boy! I had the 1/2 shrimp and 1/2 Oyster - Delicious! (Half is more than enou","useful":0,"cool":0},"Nxi009-fwMG3DaBz_HFR3g":{"text":"We came here for an early lunch and thankfully we missed the line; it got busy after we ca","useful":1,"cool":0},"asHDkOkQosDARr_QKzYblg":{"text":"my favorite discovery in new orleans. ate there twice.\n\nfirst time: went for breakfast had","useful":2,"cool":1},"isGO9gZpro-WS82SnE_OFA":{"text":"Johnny's is a must visit in New Orleans. With lines out the door from late morning until c","useful":0,"cool":0},"jwqwogCK3KIY5tiatiBPpg":{"text":"Their Roast Beef Po' Boy was really good!  Happily went back there to eat again after we w","useful":0,"cool":0},"AkbF-1BWojng8YS3Z-cp_g":{"text":"If you are looking for fresh New Orleans style food, this is it.  And if you are rating a ","useful":0,"cool":0},"VFYX223kxeRBHuDQvTxv7A":{"text":"I can only vouch for the Johnny's Special which was absolutely delicious.  It had cheese, ","useful":0,"cool":0},"5pCj4hb1JfIhYgR6lGfeDA":{"text":"Bread makes or breaks a sandwich, and Johnny's is no exception to the rule. What should ha","useful":0,"cool":0},"VU7iTcBpVPKNkIn0jY8LCA":{"text":"A bit pricey for a po boy, but an icon in New Orleans and pretty darn tasty.\nStand in line","useful":0,"cool":0},"K0QFkLOlAG3PMf3xF7Y61g":{"text":"My first visit. I had 1/2 shrimp poboy and seafood gumbo. They were both wonderful! I will","useful":0,"cool":0},"iVT9xPy6jErDZ51Kyds9uw":{"text":"Heard a woman on my flight into NoLA that this was a decent spot...then saw it listed in L","useful":1,"cool":0},"Uh3eoWN9_Gn4PBIDU96yLQ":{"text":"I had the johnny's classic with ham, beef and cheese. There was a big line with 5-6 ppl st","useful":1,"cool":0},"CYZPBPIJMwgb368LfkBl3Q":{"text":"It was good. Full sandwich is big. Stinks that they charge .60 cents for lettuce and tomat","useful":0,"cool":0},"eZcU70m6O3Uu-HJK3CSReA":{"text":"Shrimp Po-boy and shrimp gumbo. The po-boy was tasty, but the gumbo was not great. Place i","useful":0,"cool":0},"8QSTC_RhrZDHaV-u5AgrrA":{"text":"Featured on Food Network's 'Best Thing I Ever Ate' for their Muffaletta. The staff at our ","useful":0,"cool":0},"OtsQbngziXl5CwX9-HpJow":{"text":"Really great food, though it is so busy and a tad slow and disorganized.  The awesomeness ","useful":0,"cool":0},"grFwKcpzzoI1kwdqaokIwA":{"text":"Well, this place would not be on my list when I return to New Orleans, the wait was crazy ","useful":0,"cool":0},"tBvk8kefnNAYtBBL7WvThw":{"text":"I went there today at 2:30pm to pick up a po'boy for later, I entered the shop most table ","useful":0,"cool":0},"PJpq_9ycaWuqJRFx5HH1Zg":{"text":"Amazing spot. Ordered shrimp po boy' and exactly what I expected. Would highly recommend","useful":0,"cool":0},"68SApATeW0_F6-l1j0e14w":{"text":"Very good, large sandwich! My first po boy in NOLA. I believe they only took cash, but I r","useful":0,"cool":0},"vdkSVmFjJIUFx6QNuRmF_g":{"text":"For my first poboy experience, I was not disappointed!! This place is delicious. So many c","useful":0,"cool":0},"JXJ5xDIUfei_iRhRFuohLQ":{"text":"Solid Po-Boys\nIt was a little bit more expensive than I imagined. Sure, the bread is good ","useful":0,"cool":0},"4liN6j3Du6fryaaFbCyVGg":{"text":"Its a good breakfast place - it was close to our hotel, easy to walk to.  Cash only.  If y","useful":1,"cool":1},"heAjX3HisYJhlgpb4Z0Tzg":{"text":"Couple blocks from the hotel, we passed by so many times without walking in - silly.  \n\nLo","useful":1,"cool":1},"BMQSJY921tNW2DRQUBFgDw":{"text":"It's very crowded, small and very touristy! But the Po-boys are good and huge. Share one, ","useful":0,"cool":0},"q42wpp0VahKPgeNfnlPYrQ":{"text":"Good place to visit to get a real NOLA po-boy.  The portions were big enough to share and ","useful":0,"cool":0},"5nAOfnca-6NBKNXI_n4sfQ":{"text":"Stopped here by recommendation.\n\nWhile the restaurant is small with limited seating, the p","useful":0,"cool":0},"jmuwmZ6-GgGVAsbTcUkvtA":{"text":"Even in our drunken stupor, my friend and I managed to remember the name of one of the mos","useful":1,"cool":0},"yfgC14n_BI25DYgxJ1pxrQ":{"text":"Poboys where very good. Long line to order, crowded and full of tourists. Great variety of","useful":0,"cool":0},"6oyBu82vhWi_8mIgLlDfQg":{"text":"We wanted to try an authentic Po boy and this place came highly recommended. We tried the ","useful":0,"cool":0},"TnkGoyGD03CDVDDD7sMHdw":{"text":"I am so happy I stumbled into this place by accident. I was exploring the city by myself a","useful":1,"cool":2},"18bEA0RdGWP9I26iS6vf-w":{"text":"Great PO Boy options. However, it is a little bit of a dive and is cash only, and the work","useful":0,"cool":0},"dZqDS3lsmfI3TasFNxst4g":{"text":"The roast beef po-boy was awesome. It was like hot chipped roast beef with gravy. We got i","useful":1,"cool":1},"vpUyTHVLHzZMjaniFUSX-Q":{"text":"Dirty and small inside.  Ok food...nothing special at all!  The waitress used a towel to w","useful":0,"cool":0},"C8LD0x10KR6qLX_h70eGtQ":{"text":"Probably the worst meal we had in NOLA, and that's saying a lot. The crawfish po boy was p","useful":1,"cool":0},"2bF6w_rj_tekRV0170pMYQ":{"text":"Wow. The shrimp, catfish, and oyster po boys, as well as they bread they were in, were hor","useful":0,"cool":0},"3ZOMtE-olZG7TvWzV93QPg":{"text":"Had lunch here before catching flight home to dallas, and it was good. We had a horrible e","useful":0,"cool":0},"RbGwQvQ-Z7UB1JTIohzN4A":{"text":"I know people say that Mother's make the best Po-Boys.  After tasting Johnny's it's hard t","useful":0,"cool":0},"djNk50cQtddvmn6lR-R67A":{"text":"The best Po-boy in Nola.  We tried the roast beef and fried shrimp. They were both amazing","useful":0,"cool":0},"e0eVr7Hkcf_gaxVq_E3pHg":{"text":"Walked in on a Sunday and ordered a muffuletta - worth every penny and delicious! Can't wa","useful":0,"cool":0},"PhvWfh2-zyVi_t2gWej2hA":{"text":"awesome service and delicious po boys\n\nwe walked in and greeted by the blonde girl at the ","useful":0,"cool":0},"KBUde-g2pOs6asp4MuFcYQ":{"text":"They must do something right with that line to get in.  Surf and turf po boy was amazing. ","useful":0,"cool":0},"OTqDm_24TG60sbU262-B8Q":{"text":"For $3 to get a biscuit, fried chicken, and southern gravy is pretty impossible to beat an","useful":0,"cool":0},"ArsMhlzCgxMt1-iZE7tbTw":{"text":"i orderd the alligator sausage po boy with gumbo and it was good as heck i was extremely h","useful":0,"cool":0},"JNG8zac1CX7QaMh0P3ruIw":{"text":"Cool place, nice people, and great to grab a sandwich and walk over to the park overlookin","useful":0,"cool":0},"mg4YWw15VH6QZUcKhFFJjg":{"text":"I've never had po-boys anywhere else so I really don't have any basis for comparison.  The","useful":3,"cool":2},"OkNVVcm5ywRGQrxv7rsRzQ":{"text":"Great Po-Boys!  The reason I really love this place is that they deliver if you live in th","useful":1,"cool":0},"guANP7Dod54d3-w1xdJecA":{"text":"Enjoying New Orleans vacation and wanting a Po-Boy we decided to check out Johnny's. I ord","useful":0,"cool":0},"SNszOGihrEQoqHDL9InlzQ":{"text":"Po'boys were good, lady behind the counter, must be owner, was a complete sourpuss!  First","useful":0,"cool":0},"NxHAeLVC6TTPo-GO065ffw":{"text":"TLDR Surf and Turf Po Boy is ridiculously good. Go buy one now. \n\nComing off the disappoin","useful":0,"cool":0},"fDeeIHDMoRav3El6lK-Osg":{"text":"Fellow New Orleanians,  stay away from this tourist trap! I ordered a fried oyster po-boy ","useful":0,"cool":0},"INRKfm9V6PahEEIUV9y56w":{"text":"Visiting New Orleans should always include a Po-Boy Sandwich.  For me that's a Shrimp Po-B","useful":0,"cool":0},"6i6ZeJcjAh6BRVbwyDbivA":{"text":"Only go here for breakfast items in my opinion. I love the biscuit sandwiches. The grits c","useful":0,"cool":0},"27bUdiNaBA_2BnpI_kb54g":{"text":"Atmosphere: Pretty dumpy.  I'm sorry, but even the best food in the world doesn't excuse a","useful":0,"cool":0},"jLJwklt6GFHsTRaDwkbk-A":{"text":"This place is a gem! it has what I can only explain as a old wholesome dinner feel to me. ","useful":0,"cool":0},"Q9BoAH7SjBpfgJ1SJm4huQ":{"text":"Had the shrimp po boy. Okay...a but dry. Also had the gumbo which was super tasty. Friend ","useful":0,"cool":0},"GOvX-GB_mBT0a0OLY_nDrw":{"text":"I had the fried shrimp po-boy and it is ok. The portion is large though,  I also had the g","useful":1,"cool":0},"IqLjbXZAvVq5rVEleMZmuQ":{"text":"so many to catch up on for me I wanna  make this my first on the list of reviews for me. T","useful":0,"cool":0},"N8FQhuBc8AjOkSDsLNovWA":{"text":"CASH ONLY! \n\nOk now that that's out of the way, we came here over Mardi Gras weekend for l","useful":6,"cool":3},"zCaPLVRoaSryyK-qIeMEgA":{"text":"While hearing good things about Johnny's and being told it was a place to go, my wife and ","useful":0,"cool":0},"KHA2I0bbcfXyZ86ajINegA":{"text":"Amazing po poys.. I had the shrimp po boy, the service is amazing and it's just a typical ","useful":1,"cool":1},"bbQz1TpnNBJPixi-2uxV_Q":{"text":"This is a little dinner dive style of place. Nothing fancy, just really good Po-Boys! It w","useful":0,"cool":0},"_eTGCLfRimKzNSHXj0NvQQ":{"text":"This little Po Boy shop was suggested by our AirB&B host so we stopped in to get some brea","useful":1,"cool":1},"qqs92vWbHBcbUgbz3U4Ryg":{"text":"Good depending on the po boy you get. The cheeseburger po boy is delicious but the shrimp ","useful":0,"cool":0},"J2sPubNk7zs7CzbFZPFejA":{"text":"The muffuletta is the BOMB!!!  Best I've had!!   \n\nThis place was super busy and very smal","useful":0,"cool":0},"6UjNVvg41NguaWz3GPAfrg":{"text":"So no trip is complete to New Orleans with out a stop at Johnny Po' Boys.  First off order","useful":0,"cool":0},"-Gn5N7gabNpiAKLmUzueHw":{"text":"a stranger on the street actually told us about this spot. We got there just in time as it","useful":1,"cool":0},"UkGBUv8hiGfuWKokCZGToA":{"text":"I'm knocking down a star because the crab cake po-boy I got here was straight up gross.  N","useful":0,"cool":0},"JAhimogyr80nWjsau0JoJg":{"text":"I know, I know, eating po-boys for breakfast isn't going to win me a \"healthiest eater of ","useful":1,"cool":0},"Ff4j_57dEo5paxN7Wd1P4w":{"text":"The alligator po-boy I had here yesterday was the best po-boy I've had in my life.  The br","useful":1,"cool":0},"IHRz8fVw0AfwneEQG6wVfg":{"text":"I brought out-of-town clients here for lunch during their visit to New Orleans, given John","useful":0,"cool":0},"_cy5pj5yJAr5rAxNTJhImw":{"text":"So good. Crazy ass line but totally worth it. Split a shrimp po-boy with cheddar and bacon","useful":0,"cool":0},"wT6PZZ1pGOICwp8DWxcFMA":{"text":"Wow!! So, I'm not a big fan of poboys .. I have braces, the bread is always too chewy and ","useful":1,"cool":0},"_tajaY-Ug7JmNFH4F1yHXg":{"text":"This place is CASH ONLY! There's an ATM inside though if you need it. It was very busy whe","useful":1,"cool":1},"eMSbTyuKis1EdMPmLa64Sg":{"text":"This is a pretty good restaurant. I came for breakfast at around 10 on a Thursday. It was ","useful":0,"cool":0},"ouAKGEPsJ0KFULguAkSLkA":{"text":"Long wait, super chewey bread, and high prices.  What goes in the sandwiches is outstandin","useful":0,"cool":0},"a5ZsbBo5kivIdpkcFaS-Tw":{"text":"I got the surf and turf, I Was not a fan of the beef, it was in a thick gravy that was not","useful":0,"cool":0},"i8L4BRxJbk7A5HvX2gqzvA":{"text":"Great atmosphere, great prices, and great food. \n\nThe place for a good meal in FQ for unde","useful":1,"cool":0},"bWloPs7aYrhNEDMse2a0Lw":{"text":"I give Johnny's a 3 out of 5, keeping in mind that I take the place for face value. Don't ","useful":1,"cool":0},"lUWy4LHcnngcB5QYYLtrtw":{"text":"My wife came here with her sister and made it clear we had to stop here. \n\nFirst seating i","useful":1,"cool":0},"5lWCkLXbkprgZcpQfe4lKQ":{"text":"Mmmmmmm.... Had an oyster po boy with a side of gumbo. Not a bad deal for the price. The p","useful":0,"cool":0},"O1wmM4K6v6CXoj1KVrYbQw":{"text":"My husband's sandwich was excellent; he got the surf n turf. I got the porkchop. I wanted ","useful":0,"cool":0},"EKJv8WUOBlpkkJcZC82RGQ":{"text":"The people complaining about the seating, a/c, ambience, and cash only policy don't know s","useful":0,"cool":0},"qFol1B0IaIgql8lZPfQUNQ":{"text":"Waited in line for about 45 minutes to get a few po-boys.  I waited so long I deiced to ge","useful":0,"cool":0},"ZaAnT7H138YXjHSN80uPOg":{"text":"More than Disappointed by the shrimp PoBoy, \nDry no taste, the bread was 4 times the size ","useful":0,"cool":0},"2nuk9j29VcqJhM_OLH7PeQ":{"text":"I didn't have a po boy, but the beans and rice were very good. Reasonably priced.","useful":0,"cool":0},"dm64-V9Ix27XiM_hnFjmrg":{"text":"I decided to go against the temptation to grab a po-boy and got a muffaletta instead.  It'","useful":0,"cool":0},"xZpTWg4mTq9TE46XLR3O3w":{"text":"AWFUL run away dont wait in the long line. I have gotten SICK here TWICE now and the food ","useful":0,"cool":0},"tSmGmY-sRflvqUOARPLHPg":{"text":"We had the fried catfish po boy for about nine dollars. This did not come with a drink or ","useful":0,"cool":0},"zEQBhn1ZN2Co2a_4w0Mogw":{"text":"Had the crawfish po boy and it was excellent. Very busy so had a bit of wait to get food b","useful":0,"cool":0},"v4U9xp1YOattEPUqyi5k7w":{"text":"I really hate to give this place a bad review because of all the great meals I've had here","useful":1,"cool":0},"Galu2782i4elga12aeyENA":{"text":"Great lunch spot. Get the muffuletta severed warm. Most of the sandwiches are large enough","useful":0,"cool":0},"CU8E_Zs6xlxp7a2NOqSmbw":{"text":"Good food, reasonable prices. Went there a couple times on my trip and overall it was a go","useful":0,"cool":0},"3OlS3esTgbcXOcfbPr9mqw":{"text":"It was my first time in New Orleans and the first place I went to go eat was at Johnny's. ","useful":0,"cool":0},"9LL56vHq6vA0tJMvxAY5Jw":{"text":"Po' Boys were amazing!!  Be prepared to wait for a table.  We recommend taking the food to","useful":0,"cool":0},"A4QGYld5NangLcvwe0NdVw":{"text":"I was underwhelmed by Johnny's. \n\nSurprising - My shrimp po' boy was $12, with a bottle of","useful":8,"cool":6},"RaQxYbrEpTKrqQPH9tak6w":{"text":"Great po-boys! I got the soft-shelled crab and it was exactly what I like in a po-boy with","useful":1,"cool":0},"loU1CtGuft06QN6ibnrp8Q":{"text":"Large tasty po'boys! First po'boy place we went on our vacation because of a recommendatio","useful":1,"cool":0},"7Apw0ON1OHrWHNn6IOqP6A":{"text":"Wow. Wow. Wow. Husband spotted this place down from our hotel on a beignet run and we stop","useful":0,"cool":0},"Ln8pt6DAm8WIzhevqVtnyQ":{"text":"If staying at the Omni Royal hotel then this is good for breakfast and lunch or dinner or ","useful":0,"cool":0},"CPoH1CvqvrFcLQg3hZp2jg":{"text":"I tried the alligator meat po boy with gumbo and red beans and rice....The food was pretty","useful":0,"cool":0},"TW-nXitEQMcBoZ_6Q2MIqA":{"text":"I would go to NOLA JUST for a PoBoy at Johnny's. Nothing fancy, just straight-forward, hon","useful":0,"cool":0},"6yIoloOsd2dPMjmeKzRo0Q":{"text":"Hearty. Delicous. Generous portions. Fresh baked bread and fresh deli meats. \n\nCute interi","useful":1,"cool":1},"lRKeiafSXs95QlO20yl5lA":{"text":"Excellent cheeseburger and *really* excellent crispy french fries.  A relative loved the m","useful":0,"cool":0},"IXrfS-xnoasS_3UPmBHgEA":{"text":"Came across this restaurant since I was staying at the nearby French Market Inn. We came h","useful":0,"cool":0},"xibpblqOIlRUGWTZVCsCzg":{"text":"You will leave Johnny's stuffed. You walk into a quintessential hole in wall that serves s","useful":1,"cool":0},"dhre5lJ9BqBsk5x5Dy4cSA":{"text":"This place is a complete dive and the only bad (horrible) meal we had in NO. I have no clu","useful":0,"cool":0},"RibbbgJ2t7uSfVffDYhgyQ":{"text":"Worth waiting in the 15-20 minute line.\n\nIt seems that you don't want to eat at a restaura","useful":0,"cool":0},"s0Y7a2NjjmU09WiTzmy3Hw":{"text":"Un fast food à l'Américaine comme on les aimes. L'hygiène n'est pas irréprochable mais con","useful":0,"cool":0},"Owri0ZUWeHQ2Aba-pGsLgg":{"text":"Really not sure what all the hype about Po-Boys is about, perhaps we should have tried ano","useful":0,"cool":1},"Nsk-UVrHyD8DYfHq4fMETQ":{"text":"I'm sorry we wasted valuable sandwich-eating time here. Even though Johnny's is very popul","useful":0,"cool":1},"ud7sHKQAEpbnYeJHe5q8EA":{"text":"This was the \" traditional\" Po Boy Place we went to on a recent trip to NOLA.\nDifferent BE","useful":1,"cool":0},"LiZlfsbYvcyUC04UmM2jcQ":{"text":"First time in NO, so of course my first meal is a po-boy from Johnny's. We hit it at just ","useful":0,"cool":0},"GaDxhehEJKnAEwWLKuBBNQ":{"text":"Disgusting. The food was ok, but the place is terrible, even for the French Quarter.  The ","useful":1,"cool":0},"5XCK1OAaOIW4ScyWPUEv_w":{"text":"Very good shrimp PoBoys.   Flavor was very good, batter for shrimp was so light And crunch","useful":0,"cool":0},"6cOl91rjpIM72rwA0lmDIA":{"text":"Don't get Roast Beef. It's just a sauce/ debri gravy with a little mayo shredded lettuce, ","useful":0,"cool":0},"s3WFRMpInOi2xfNcpu-qKA":{"text":"My friend brought me and the bf to Johnny's Po-Boys when we visited NOLA. We asked for her","useful":4,"cool":3},"_N8G-3-bexbznfW4-EckrA":{"text":"Unfortunately, I've had better PoBoys at other restaurants. They weren't bad, but Ive had ","useful":0,"cool":0},"W1EbwcLNPhbUq5pKcPsY-g":{"text":"This place has gotten a lot of bad reviews lately whcih I don't think it deserves.  As a t","useful":0,"cool":0},"aGPJDa4BI_p6NrEOHv9_yg":{"text":"To those opposed to cash only, GET A GRIP, by doing this he is saving you money, credit ca","useful":0,"cool":0},"atLtV5jFRJfClbutlV6cuw":{"text":"If you want the best Po Boy you're ever eaten, this is the place! We were here a few years","useful":0,"cool":0},"iDMnIgsDTIAUgzf13REgIQ":{"text":"We walked into Johnny's based on a recommendation from a family friend and while the inter","useful":0,"cool":0},"fNdLKnXwdKgoCdEhfuk_wg":{"text":"Tried my first po boy at this place. A little too \"divey\"for my tastes. I'm super Wimpy ab","useful":0,"cool":0},"cOo02RfQh_cSc7ZBCw6Nxw":{"text":"Many delicious po-boys to choose from. Line is long but moves quickly. The roast beef was ","useful":0,"cool":0},"w2jZ72W5EC-xf9KC46v8SA":{"text":"The mufalattas here beat Central Grocery hands down. I've tried it regular and grilled (I ","useful":1,"cool":1},"SWFdcHW-ptF2mn95PfBg3g":{"text":"Would not recommend this restaurant. The service is extremely slow. When it takes this lon","useful":0,"cool":0},"pIBNnG-G6rc-pGPPqv7LiQ":{"text":"Whatever you do, don't NOT order the Johnny's Special.  Or perhaps I should rephrase that.","useful":7,"cool":3},"ncafyjhJipZm-zKtrl9g2g":{"text":"We ate lunch after reading the rave reviews on Yelp.  After waiting in line for 15 minutes","useful":0,"cool":0},"L2m1EEzcgkGpCy9FbrIchw":{"text":"I dont know man, I love this place!  It feels so classic and down n' dirty right when u st","useful":0,"cool":1},"9U3gdcO1n3p2ceJTytQk1w":{"text":"Boy, this place was busy. We were there on Sunday at lunch time, so it's to be expected in","useful":0,"cool":0},"fLIxw5z_hx_m30yP6RSyyw":{"text":"I'm basing my review off of the veggie po-boy. It had four cheeses: shredded cheddar, Swis","useful":0,"cool":0},"VSPDL4cctxLq5z-q8eWn_g":{"text":"I debated between 2 and 3 stars. This restaurant isn't terrible, but in comparison to what","useful":0,"cool":1},"SNGv2Ryi0iowt1YT6IazSQ":{"text":"Considering how touristy this area is, the price for each Po-Boy is certainly reasonable. ","useful":0,"cool":0},"E7cZJ3X11MfrMuCcTkTFvQ":{"text":"This is the only po-boy place that I will go to in the quarter. It can be uneven, but it h","useful":2,"cool":2},"LT9rI_8RfvCVxcyk2DaBKA":{"text":"I know it's a Po-Boy Shop, but damn- Biscuits and Gravy were the bomb!\n\nBasically, you can","useful":0,"cool":0},"Y_jxJe7-ye7w5CqeHl9PZA":{"text":"johnny's never disappoints and this is my gold standard for a fried and dressed catfish po","useful":1,"cool":0},"y3aqhAzfDJ1NYKkeCKe6Uw":{"text":"Gumbo: fantastic. Jambalaya: not bad. Rice and Beans: skip it.\n\nThey have red creme soda a","useful":2,"cool":1},"JlVKmekpJRPDVWN7yZrJgg":{"text":"What fun! Though this was my first po-boy it sure was delish!! The cup of gumbo was loaded","useful":0,"cool":0},"OVa38XI1Zdk9EhKCI4Ewig":{"text":"The service here was terrible. The chick who was working the desk only wanted dick. There ","useful":1,"cool":0},"h5hagT04GHco0PVvxWLlew":{"text":"We were here as part of a food tour, so we only got to sample the roast beef po boy.  It w","useful":2,"cool":1},"QHu-S_154b5khzWIoQloYQ":{"text":"Yumminess! \n\nMy friends and I heard it gets pretty packed here, so we went around 2:30pm a","useful":0,"cool":0},"tU_d2yA45WkfXbIoQOt7xQ":{"text":"Don't be fooled by the outside. I thought I'd \"settle\" here at Johnny's for something quic","useful":1,"cool":0},"WOctOzir9cJnMvS_afqm9Q":{"text":"Johnny's Po Boys was one of our last stops in New Orleans. We stopped by about an hour bef","useful":0,"cool":0},"6cg7DBoDgnKHk2wtrbuNuw":{"text":"First time trying a po-boy and honestly I don't know much about it but I do know what coul","useful":0,"cool":0},"k9W7dC2iE9vTMmC6EDsmdQ":{"text":"Okay, everyone who has come to Nola told me I need to stop here and have the Po-boy! Even ","useful":0,"cool":0},"DgW_LjEX1KWTBsbTqdkjIg":{"text":"I was really excited to go here.  The actual experience however didn't live up to the hype","useful":0,"cool":0},"h_Ke7nYcQI64oNrQ7sPCkQ":{"text":"The food is bomb.com. I love the Po-Boys, even though I was really full after eating it du","useful":1,"cool":0},"yS9btuAioEx3PtKY17gN5Q":{"text":"after quite the night on bourbon street we were ready for a big huge sandwich and we had o","useful":0,"cool":0},"JRx00DpnI5MTODNwFLC8Uw":{"text":"I was not at all impressed by this place. It was was of time and money.  We ordered mufful","useful":2,"cool":0},"sJad57zNTvyLGx4ttqO4Lg":{"text":"This place is supposed to be all time famous for their po boy. Husband and i tried shrimp ","useful":0,"cool":0},"BGafz_F0LwzALrgCCZU8uw":{"text":"Not really sure how this place got more than two stars... went here on a vacation with the","useful":0,"cool":0},"uoyDaQVRqyV6TDJTLNIGBg":{"text":"Food was awesome! I had the shrimp Po boy. The gumbo off the hook. Muffaletta with oysters","useful":0,"cool":0},"CuHSXCRMUrqiHYYAgJIafQ":{"text":"Everyone in my group enjoyed the food. Best poboys we had. Taking a star off because the f","useful":0,"cool":0},"-xSaJyMsN2Uup5AevuUxow":{"text":"Tried their breakfast the first morning here - very good. The hot cakes were huge! It did ","useful":0,"cool":0},"a2fFzF41X7CHbkfZOjDiUA":{"text":"Amazing sandwiches in NOLA a must have while visiting.  My husband had the muffalleta and ","useful":0,"cool":0},"Lz_FKYsFHk8Spn-D8XVLoQ":{"text":"I tried the fried shrimp po-boy. I felt that the restaurant was too hyped up. The line was","useful":0,"cool":0},"ZKg_CkN-BWR1hfx7JSgxBQ":{"text":"Filling, excellent breakfast cheap. Great Quarter location and atmosphere, if not small. T","useful":4,"cool":0},"ulCVz07V_VGH_Bcr9ktc-Q":{"text":"I love Johnny's. We stop here every time we are in NOLA.\n\nI usually get the shrimp po-boy ","useful":1,"cool":1},"QroI1SYMh0eBVYKSsdxzZA":{"text":"I ordered the Blackened Chicken Po Boy with a side of fries with a sweet tea. Let me tell ","useful":0,"cool":0},"ZmWROo_QTdw_7guoCnyhig":{"text":"We stopped in for a quick bite since this place was really close to our hotel. They have a","useful":0,"cool":0},"ERCaRpGQwtpa_b1ll3aGDg":{"text":"Amazing!!! I had the roast beef with mayo, pickle and tomato with gravy and I've been drea","useful":0,"cool":0},"u3Db5uy36_9qUaHw_huEjw":{"text":"Way too much food for human consumption.  \n\nI got the Roast Beef Po' Boy and ate 1/2, but ","useful":0,"cool":0},"moopmF6D_komZjQIZCtHVA":{"text":"Went here as part of the Tastebud Tours and had the pleasure of trying my first Po'Boy.\n\nT","useful":0,"cool":0},"HMBtDEpGeWXTB-EDxU2sdQ":{"text":"i was recommended to go to this place by a local in place of park tavern.  all i have to s","useful":0,"cool":0},"1_Y9KluQBJpOgwSdgapg5g":{"text":"We first went to this place on Saturday afternoon and it was crowded! There were no seats ","useful":0,"cool":0},"iLXB2xGMgggQDm3hkxFSlA":{"text":"Great po boys when u want to stay in the quarter! I had the shrimp and my friend had oyste","useful":0,"cool":0},"iprZDYuugcBpw1AIe6rhxA":{"text":"Better muffaleta then Central Grocery and better Po Boys then Mother's but be warned, it i","useful":0,"cool":0},"Brt2-jyAv3Eo_0qizGyaOA":{"text":"Simply awesome.  \n\nI went here on a very busy afternoon (a few days before New Years and t","useful":0,"cool":0},"SdsrxnCzGB1DEj3-DVMXQA":{"text":"I'm not a big fan of Po-Boys, too much bread.  This place is very small, crowed, and alway","useful":0,"cool":0},"Y69g25rWRhFoZr_dwRJUeA":{"text":"Food was plentiful and delicious!  Had the special of 1/2 catfish po boy and a cup of gumb","useful":0,"cool":0},"nnrwhzgOPh2sV8TcuW7weg":{"text":"You've gotta get a po'boy when in New Orleans...just...cause, that what you do. I got the ","useful":0,"cool":0},"hF0iu_G64jUAk9UbQSWzNQ":{"text":"oh yes the wait made me almost think they forgot all about me... well they didnt. Amazing ","useful":0,"cool":1},"wJShSBQ3WRAzJ6t5Pu-HTw":{"text":"I'll have to go back and test out some more things, but for a first taste into New Orleans","useful":1,"cool":1},"YAUN_937eCN_7apGLVGQaw":{"text":"This was our 3rd and final stop on our beef po boy crawl.  We both liked this one the best","useful":0,"cool":0},"s8Dq8SVeh7_KPsy2A2Dsbw":{"text":"I didn't love it.  The shrimp po boy was Ok,  but not flavorful enough. I had to drown it ","useful":0,"cool":0},"iiN4iuftvj_ly_ar0Q8a2w":{"text":"By far the best po' boys - WAY better than the place our hotel recommended to us.\n\nSerious","useful":0,"cool":0},"Us8wfU4TxRcZ8JMPtqPb-A":{"text":"Johnny's is a small place on St.\nLouis.  It was recommended by Grayline Tour Company.  My ","useful":0,"cool":0},"csQCjeY_sIFiyNj5U_xBtg":{"text":"Po-boys sandwiches? More like rich mans sandwiches. All these poor mans sandwiches cost at","useful":0,"cool":0},"t7BQnKtJlqj8__3MKskVvQ":{"text":"Concierge recommended this restaurant for their Po Boys. The food was delicious. My review","useful":0,"cool":0},"Po9Nxwcdycu3G-TJYLUeEA":{"text":"Long wait in line and for the food but crab cake po boy and gumbo were well worth it.","useful":0,"cool":0},"SpZddS8oAjaED8ZMGMmIoQ":{"text":"Wow!  A tour driver suggested this place. Huge delicious sandwiches on fresh bread. Extens","useful":0,"cool":0},"HhiVvO_edPstD5_KiE9Cag":{"text":"Maybe I've missed the hype,or being from New York I'm used to the lunch counter type of sa","useful":0,"cool":0},"ga-QhCZcwIEBbEW2wW_1WQ":{"text":"Great food lively fun restaurant only one thing  wrong ac unit kept leaking on my table  c","useful":0,"cool":0},"Hw640m_QVjPpvc0XXYT9ig":{"text":"This place is kinda grimey. And the seating area in the back smells. We managed to snag a ","useful":0,"cool":0},"Xbje9q21Y_ujD_3bmFPbiA":{"text":"Cheap and oh so tasty- I can't say more then the other reviewers have said (except where's","useful":0,"cool":0},"IJrkvqUOV6PFX3RcOl5PCw":{"text":"Johnny's is one of my favorite Po-Boys in New Orleans. I had the shrimp Po-Boy this trip. ","useful":0,"cool":0},"PBO0XOr3KSnkR2DQVU6P4g":{"text":"I get it... a po-boy is just a sandwich... \nNot sure why I was expecting something with fl","useful":0,"cool":0},"4zH2O-yGem8esAo42mZOJQ":{"text":"My roast beef poboy was not that good. It was soggy on the bottom and stale on top. Also I","useful":0,"cool":0},"J5rIBO6dM1YL0qgZN7CqnQ":{"text":"The sandwich was good, kind of dry because of the French bread. Overall it was good to try","useful":0,"cool":0},"M1L1IjhnEc8IKSQU4MNuYg":{"text":"Super busy place - be ready to wait. We heard it was the best place for a poboy but it was","useful":0,"cool":0},"oP7fMBjsWlgE_F2ZYvs9NA":{"text":"Best Po-Boy's EVER!\n\nHere's a tip:  You can get 1/2 and 1/2, so you don't have to choose j","useful":1,"cool":0},"b6uVDQRCsbjQry1IvZVaMw":{"text":"Oh Johnny's. The food is SOOOO GOOD. But there are so many cons... I have to lower the sco","useful":5,"cool":0},"E02o3YX1W2JImLBcJdJN9w":{"text":"Long line. What moron designed this seating area? No space for people to wait for their fo","useful":0,"cool":0},"5VdEj2XDnJA8KyEFNGHC3Q":{"text":"The perfect po boy.  Ive been coming here for over 10 years and this place neve dissapoint","useful":0,"cool":0},"9HSmfuksxaNt1_NgjSY_hQ":{"text":"Small and crowded with so many options!\n\n// LOCATION // French Quarter\n\n// FOOD //\n\n     +","useful":0,"cool":0},"ml5aoKz1BP8MVFIArlhFWg":{"text":"Went to Johnny's for a quick po boy in the late afternoon. There were a lot of people ther","useful":0,"cool":0},"rTpkSthcW3w4PygoZ6XdhA":{"text":"Very popular place! It was packed with people and had lots of character. Cash only, but wo","useful":0,"cool":0},"kHo6BZOaiC5XY21oudSzQw":{"text":"The po boys here are solid and for a fair price.  The portions are also pretty huge as you","useful":0,"cool":0},"3Ga8EinttrkFv69QsyGUiA":{"text":"I had both a roast beef po' boy and a shrimp po'boy at this restaurant. Both of these sand","useful":0,"cool":0},"p9l6sAF4UhuiVOkfTjb4qA":{"text":"For Fried Shrimp or Oyster Po'Boys, give them a try.  We really liked them.  I also found ","useful":0,"cool":0},"1Zm9TucrzhDAkQyUwUhDTw":{"text":"The po boy was aight but that mufelleta looked good! Wish the place was a little cleaner o","useful":0,"cool":0},"SXOYkmS4yZvj6E1JlcclYA":{"text":"This was a great po-boy dive. The bread is what makes this sandwich so savory. I'd recomme","useful":0,"cool":0},"EVWSjuhcdKMarF1NL1fMfA":{"text":"What a fantastic selection of Po' Boys! Crispy fried fresh shrimp and 'gator was our selec","useful":1,"cool":1},"Ot5ZwqLNInkDm8z95dcPCQ":{"text":"Must have been an off day for Johnny's during my last visit. I ordered an oyster po-boy th","useful":0,"cool":0},"8hlaVfXOa56PYveDK-pQXQ":{"text":"Central Grocery was closed but I wanted to get my hands on a muffuletta. Johnny's was just","useful":0,"cool":0},"eGRV49FCWRcrVBSBxU2duA":{"text":"Lunch in February. Bring CASH. Really good shrimp po~boy, ordered the large, dressed, with","useful":0,"cool":0},"Ej1FjAOjEzxLwOY6IYZRHw":{"text":"Stopped by in the morning for a breakfast sandwich. Ended up with a shrimp po' boy for bre","useful":0,"cool":0},"nxxyko_2KXGUspxLSNrg7A":{"text":"The good: nice history, relaxed atmosphere and huge selection of poboys. The shrimp po boy","useful":0,"cool":0},"-ZlobIx3UbQk8iKyKgr96Q":{"text":"Food was good but the cleanliness could be improved. Sandwhiches are big enough to share!!","useful":0,"cool":0},"VYbPAJ42k_gIwm7XXdZbzw":{"text":"As tourists, we came here for the Po Boys, of course!  This place was very popular on yelp","useful":0,"cool":0},"HJAPjGsP8g4hhzUdrRqC4w":{"text":"Po Boy was good we had a shrimp and a alligator sausage! However the service wasn't the be","useful":0,"cool":0},"o-EKbRaiv3hMpZjIIX7crw":{"text":"I just left New Orleans and my first place I came to was Johnny's. I got the hot sausage p","useful":0,"cool":0},"QF9hQduDWD20y8auJwLvCQ":{"text":"This was the best shrimp po boy I've ever had. The bread was tender and chewy, the lettuce","useful":0,"cool":0},"6tYiDb2o5ca5U9_Xz6OrIQ":{"text":"This place is a must-eat any time we're in the Big Easy.  I guess we first ate here in 199","useful":0,"cool":0},"u0qrJMqMvIyVgCLNYRRkyA":{"text":"I luckily came during non-rush hours so there was no line. If I remember correctly, I thin","useful":1,"cool":0},"NgqNzMaW0kZx-Gm8CAwLog":{"text":"I've tried Johnny's twice and both times were horrible experiences. The 1st time I watched","useful":0,"cool":0},"OTB0RAB25RWm5Tif3dkLnw":{"text":"as other reviews already say, it's crowded.  ended up sitting on a stool facing the mirror","useful":0,"cool":0},"JCtJ4jI7uX5EPcPrUdNgRw":{"text":"great po-boys.  long line but moves pretty quickly.  shrimp po-boy made my blog.","useful":0,"cool":0},"ihdtFxT_nWYH7l_jSHg6IA":{"text":"So this place was recommended by our concierge and I definitely expected something more. L","useful":0,"cool":0},"ZeYa2eHDH894Xquu7fTIsw":{"text":"Johnny's Po-Boys is legit.  Wife and I split the shrimp po-boy as a mid afternoon sober up","useful":0,"cool":0},"pPvEVpYsCngMxxapKMGnIw":{"text":"This is a no frils kind of place.  Every po boy we've ever had has been great.  All are ve","useful":0,"cool":0},"tS9jDC8WVxNskSDf-ILTNQ":{"text":"Went for lunch. Place was packed. I'm not sure why. I got the ham and cheese po boy. They ","useful":0,"cool":0},"Fpv8qPTF3pqPO4SdSLODlg":{"text":"Came for lunch on our last day in NOLA as it was by our hotel and it seemed to always be c","useful":0,"cool":0},"q8S7LQzIi6Cbm1um5VQWTw":{"text":"The alligator sausage was EXCELLENT. Huge too and I could barely make it through the whole","useful":2,"cool":0},"-LVllsfmCn9RXu0yGyI2Ow":{"text":"My first trip to Johnny's was better than my recent visit.  My husband and I both had the ","useful":0,"cool":0},"ZKmHwYCYThzVHIwiHPMA0A":{"text":"My go-to po-boy shop in New Orleans.  It is as authentic as any and absolutely delicious. ","useful":0,"cool":0},"TwYQ_LyGcyvM1XO_d5hU_w":{"text":"Worth the wait.\n\nWe had the roast beef and fried shrimps po-boys\n\nWaited maybe 5 minutes.\n","useful":0,"cool":0},"pRKjqO-8O0XeZmY8IRtk9Q":{"text":"Simple and to the point the food here was good, we got it fast and it didn't cost an arm a","useful":0,"cool":0},"nYz0fanHmpBeKzzvPxlV0A":{"text":"Wish I could give them 0 stars. Was first time having a Po boy. We spent 28$ on 2 chicken ","useful":0,"cool":0},"r_Yau6yioafEKmjBIlLMMw":{"text":"First place we went to eat in French Quarter. Unassuming exterior and nothing fancy interi","useful":0,"cool":0},"26Ni7i1BCRyoMW6gjxFwlA":{"text":"Good portion of tasty fillings. But felt like the po-boys had too much bread. They messed ","useful":0,"cool":0},"MonUch1BLKLDR4FmdeUmuA":{"text":"Spending our Christmas in NOLA, I had to come here. FYI, they ARE closed on Christmas Day ","useful":0,"cool":0},"MIwqDn7sj9_-dguE6NuRyA":{"text":"This was the most disappointing food we ate during our trip. Was it bad? No, yet it was fa","useful":3,"cool":0},"J03L34G3Q0eilpYrO8FvAA":{"text":"Looks like I'm just joining the crowd on this one. If you're in the Quarter and looking fo","useful":1,"cool":0},"CTbH8ihO6kWTh_82IUTOTw":{"text":"Great authentic Po-boys. Fantastic find in the quarter. Even Better?  Nice, helpful people","useful":0,"cool":0},"lX4_vcVjYSz680tLO7bHZg":{"text":"Great bread (which makes a breat sandwich) and better po'boy than any others I tried over ","useful":0,"cool":0},"jZWkC9CadTZ6kv5YrEy7Ww":{"text":"My husband and I have been coming here for many years, and the poboys here are fantastic. ","useful":0,"cool":0},"LQRlcVK2SaJ4M1HUp60qtQ":{"text":"Bomb. Skrimp po boy was one of the best sammy's I have ever had.","useful":0,"cool":0},"fGqoYjrIQFgs_ug9QYlyBA":{"text":"Stale bread nasty cold meat, NOT the place to go unless you are a tourist that doesn't kno","useful":0,"cool":1},"yFkbjPQRh8xrvCsa9erKUQ":{"text":"Stopped in on a whim and got really good service. Got half a shrimp Po boy with the gumbo ","useful":0,"cool":0},"VjrPnr6M1fZW8vWbcILKHQ":{"text":"Since this is my first time in NOLA, I decided to check this place out due to popularity a","useful":0,"cool":0},"5Od9wwZrVI2_0Fo3-ybTQg":{"text":"Meh pretty much says it.  This was actually our third choice for where to get po-boys, but","useful":0,"cool":0},"v-_7rpRNYU7grBMAdXpMqQ":{"text":"Stopped by this place during July 4th weekend based the reviews from Yelp and because I wa","useful":0,"cool":0},"24ASBcYpXDx4a_zHDBnySg":{"text":"I cannot speak on behalf of the Po-Boys since we only ate breakfast. We didn't have to wai","useful":0,"cool":0},"y1vohEoHnMq2PV3IAIeYqw":{"text":"Johnny's Po-Boys was my first taste of New Orleans cuisine, and boy was it a good one.\n\nTh","useful":0,"cool":0},"EpXnTbd8DXq4LWMYB6LPPw":{"text":"Went here because we heard it was the best po boy place in new orleans. It was just packed","useful":0,"cool":0},"U2r-hy9DuBxd_up8XTAGug":{"text":"Loved the Shrimp po-boy. Look out, they only accept cash.","useful":0,"cool":0},"RJk5TQxvKRe_T7MAeHOSMA":{"text":"It's just a sandwich. Perhaps if the oyster sandwich wasn't $15 I would have ordered that ","useful":0,"cool":0},"VbmlBXMrB_IjVD9QZpKlRw":{"text":"Love it!\nEven the bad part is edible. If po boys is what you are looking for, then this is","useful":0,"cool":0},"aQ052O5KOWXRPruotOM1ig":{"text":"First visit to NOLA so we had to try a po' boy. Picked Johnny's and happily waited in line","useful":0,"cool":0},"pl3pLfin9EtY_PDSwbOexw":{"text":"The bomb ass digity!!!!! This Texan that now resides in Long Beach, Ca. was ecstatic to ha","useful":0,"cool":0},"4eWKyJ8PzHTCTEXZRUo5kg":{"text":"The sandwiches are huge.  We ordered Judge bosetta and fried oyster sandwich.   The meat p","useful":1,"cool":2},"6AiXOe1uH2obsK7wxaKcTg":{"text":"Second time here and still absolutely love their Po-boys!  The crunch of the batter and th","useful":0,"cool":0},"y6KTrAC7aCTLERN3_NsOFA":{"text":"AMAZING! Came here twice in our visit here. Grabbed them for the airport on the way out =)","useful":0,"cool":0},"mPjJM7iPJmvdXd0yjlQxdA":{"text":"Best PoBoys in the quarter! Check out their specials over the counter, they are usually a ","useful":1,"cool":0},"AQ4pNDF24I1_rf7F8BXHsg":{"text":"4 years ago this place was excellent. This year the gumbo tasted like dishwater and the po","useful":0,"cool":0},"j8EE82QL2jZyV2ntlFH25w":{"text":"Definitely not anywhere close to the best po-boy we had while visiting NOLA.  The bread wa","useful":0,"cool":0},"IwFyOV5v8NrIeZM06hXLug":{"text":"We were looking for the best po boy in the French Quarter and I'm pretty sure we found it.","useful":0,"cool":0},"1ECNsaxWl9tnvIP9xlXQ0w":{"text":"Don't go here if you are in a hurry...I ordered a mufaletta at lunchtime and waited nearly","useful":0,"cool":1},"BuaFjg30ueuNwp5anrMO5Q":{"text":"When coming to NOLA you have to try a po boy. We didn't have enough time, so we just went ","useful":1,"cool":1},"pHZSyP1ydYcabUfPCv1JsQ":{"text":"It was really crowded and not a long of room to sit and enjoy a meal.  The was wasn't grea","useful":0,"cool":0},"0kuTI0uxirYqw4Z-Nrgz3w":{"text":"Best Po-Boys ever-Try the shrimp one and I guarantee you will never find one any better- a","useful":0,"cool":0},"3pQkI4dU6RQcjJ8SNzcgpA":{"text":"Good food! A little dirty but that's ok...it's New Orleans, after all!  We had red beans a","useful":0,"cool":0},"1dJa0ia39vHy8xVxjrCw9Q":{"text":"I love this place! Cheap good food with New Orleans charm . Make sure you have cash. It's ","useful":1,"cool":0},"nV3GX3gVIsr9ra5VvUMvjA":{"text":"Johnny's was recommended to me by a local.  It's a little divey, no frills type of place w","useful":0,"cool":0},"O_tOVEHDfaBkWTKOdBOJMA":{"text":"Muy buen lugar para comer Po-Boys en el centro de new orleans","useful":0,"cool":0},"jaGMzNZv0vizx7xxr2GS2g":{"text":"Came here because every one and their mother was recommending this place. Had the catfish ","useful":0,"cool":0},"HqoidpDpI3PwHtABbIXtVw":{"text":"We must have had the look of where to eat like a local and not tourist trap! Turns out sit","useful":0,"cool":0},"-VzM70OKGQyjuYHGkay-PA":{"text":"I had the shrimp po boy and it was average. The shrimp just had no seasoning on it. All ot","useful":0,"cool":0},"lo9o7qQr_kaWHM--Yjlryg":{"text":"Spicy sausage poboy was DELICIOUS!! Johnny's special was also great but little messy. Over","useful":0,"cool":0},"GXpi2BsOydijRiZT7laMhQ":{"text":"A traditional hole-in-the-wall sandwich shop with a huge \"just list everything\" menu.  Tho","useful":0,"cool":0},"l3WdcovCjziVtbd71d8R_A":{"text":"I would love to give this place a great review, but apparently delivery stops at 3:45 on S","useful":0,"cool":0},"xOtARzfl5ZBau-y1VIqW_A":{"text":"My oh my was this delicious! I was visiting New Orleans from out of town, and this restaur","useful":0,"cool":0},"X5NxM1U1qD6BpNqqLJ9qWg":{"text":"my wife and i went here on our last trip to NOLA. what a major let down. we waited in line","useful":0,"cool":0},"G4XFDqI4tfYDUHTyBniMjg":{"text":"We arrived here by an accident, but I am glad we made that mistake! The muffaletta was Del","useful":0,"cool":0},"hJQ6bhNJokXEMu7mpP_x4Q":{"text":"Good stuff. Perfect place for a po'boy sandwich for lunch. We had the shrimp po'boy with a","useful":0,"cool":0},"s2_inBHOHMAOaMdi3-eUPw":{"text":"Mediocre ... I'm sure I didn't catch them at their best, but soggggggy fries. I ordered fr","useful":0,"cool":0},"oKmUWlxx1ZU6E-tDCBFIHA":{"text":"We went to Johnny's for our first meal in New Orleans.  We went on a Wednesday for lunch a","useful":0,"cool":0},"DlfsZmvk9tXjxXcQvtKoZg":{"text":"Nice place with a local flare to it.\n\nGreat variety of sandwiches to have, but if you didn","useful":2,"cool":0},"jeuD0ISOBIaFGlPFu-tFhQ":{"text":"This place was amazing! I ate the food so fast I didn't even have time to take pictures. T","useful":2,"cool":1},"yUOyg24NqZV1TUUvNvdgFw":{"text":"We split a catfish po boy at Johnny's. The sandwich was huge; plenty for both of us. I tho","useful":0,"cool":0},"k6CzbVfwCcfzN32S7YegPw":{"text":"Little slow but over all good food , had the 3 egg omelet , ordered sausage on the side re","useful":0,"cool":0},"ml9NeoCGgfiiGOa6Nbpyfg":{"text":"First trip to New Orleans and this is a great place to start. We both ordered the Shrimp P","useful":0,"cool":0},"32sVnEJw43GGMXwm1Yn23g":{"text":"This place stressed me out! It appears to be tiny, with all of these tables right on top o","useful":0,"cool":0},"eWNvs_FDTfdEaPpLz9IlPQ":{"text":"Absolutely, the BEST poboys in the french quarter. One poboy and some fries would definite","useful":0,"cool":0},"9sSAKMLY2t-aOnTGHDUlqQ":{"text":"Heard the PoBoys here huge, so when I saw a special of a half PoBoy with a cup of gumbo ($","useful":2,"cool":0},"xQj76uyHGFH3GQjT0j4lEA":{"text":"Pedimos um PO-BOY de camarão. O camarão estava muito bom. Mas o pão bem seco. A porção de ","useful":0,"cool":0},"4nPggMWMPGm1lQxL1ndokA":{"text":"This place was awesome. Kids and parents all had good meals. PoBoys rocked and would love ","useful":0,"cool":0},"om7X184Nx3135nfKDr5WEg":{"text":"Long line. Food was average. There are better po boys in the city for about the same price","useful":0,"cool":0},"Qnwac7GxvlOCYaXi6NYJwQ":{"text":"never had a po boy...but this wasnt what i expecting..had a crab cake one and it was soo g","useful":0,"cool":0},"W-2XSXEut_qzdCOY5q2qqQ":{"text":"Delicious Po-Boys. I had the oyster and it was fresh and light. Tip to light eaters, you c","useful":0,"cool":0},"H4dlr-YihXShZgiw0Q5AuA":{"text":"OMG! I can't believe I didn't review this place in 2009 when we went almost every morning ","useful":0,"cool":0},"fmn-ebWwM1dNltigm5nNyA":{"text":"'Sawright.  Bread's the right one.  Lunch is busy, but the line moves sufficiently well.  ","useful":0,"cool":0},"sHjWKs-3DaQsUfPBlKa4-w":{"text":"We stopped into Johnny's for breakfast after getting a recommendation from our hotel doorm","useful":0,"cool":0},"vehot1kYAsq0l50_LHozuA":{"text":"My first impression of Johnny's was that it is incredibly packed, this excited me because ","useful":0,"cool":0},"tsIXxjOwNH2p_sM0rxS4Rg":{"text":"I never go to New Orleans without visiting this hole-hole-in-the-wall. As far as I'm conce","useful":0,"cool":0},"sN9aFMZ7ncCra8Xq4GJIdA":{"text":"My review is for their breakfast. I recommend the breakfast tortilla wrap. It's only $3.25","useful":1,"cool":1},"mlm9EkQjNifkogrufg6ytw":{"text":"This was probably my favorite eatery we visited during our stay in the NO. \n\nSuper low-key","useful":4,"cool":3},"zrAbx3ApTkfXiak7eF3rFw":{"text":"So here we only tried the gumbo.  We were told you could get smaller samples of jambalaya ","useful":6,"cool":3},"yLe0XNstfmmziDFEFd1k9g":{"text":"This is my husbands go to po boy spot when in Nola . This is a small place that's busy wit","useful":2,"cool":1},"mn3W5ii-aNtPgZPeaP9QWg":{"text":"Delicious food & helpful staff!  No ambience, but I go for the food!\n\nWe typically go for ","useful":0,"cool":0},"bh371iQofymbqAwvRoMb8Q":{"text":"This seems to be THE place to go for a po-boy in the French Quarter. I went there on my fi","useful":1,"cool":4},"iWEeHqoLWPV3PKlGJH3muA":{"text":"I highly recommend checking this place out!  The bread is excellent and the shrimp po'boy ","useful":1,"cool":1},"ag1Y6kiLWO90zrmo7Elz-g":{"text":"A popular touristy po'boy place that's also frequented by locals. Which makes it a loooooo","useful":0,"cool":2},"X8IyVreD5UZk5BswB0ujiw":{"text":"I understand a po-boy is a sandwich based on limited means, but goodness gracious! What ki","useful":1,"cool":1},"rZprvU2V86tB3Flne4xu5g":{"text":"We wanted an authentic po' boy and that's what we got! This place is a little whole in the","useful":0,"cool":0},"ZvaXCZAMu0j9RYH47CpETQ":{"text":"I had high hopes for a good poboy traveling to the city, and Johnny's was a complete disap","useful":0,"cool":0},"VZ4wZdwYyjvFXxj2evvvGg":{"text":"The food was amazing and there service was great all around one of the best places to eat ","useful":0,"cool":0},"yItxCKmJSjjfCoCKMLY4_w":{"text":"Ok so I am no Po Boy connoisseur by any means. I am from Cali but really this was one of t","useful":1,"cool":1},"SQLyUl6128hMmAokWM9BwA":{"text":"A little cafeteria-style po' boy shop with a HUGE variety of po' boys from bacon and egg a","useful":0,"cool":0},"J6g3UPUCM4Lr4ub27PQqyA":{"text":"This place has an amazing shrimp Po Boy, it's a dive environment but the food more than ma","useful":0,"cool":0},"GqBRDD8xX_Mwfm2HxaXb0w":{"text":"A group of us were looking for a po-boy on the last day of our trip in New Orleans and fou","useful":0,"cool":0},"9LW00E5PBjzpTNOep0X2_w":{"text":"I wasn't as taken with this place as some. I'm not terribly impressed with the whole \"Oh w","useful":0,"cool":0},"1AmTct6JxAfGphhz6dTS1g":{"text":"I thought the $13 shrimp po-boy was worth about $4.50; under-sized and rather ordinary. I ","useful":3,"cool":3},"BzK2NAFmtlN2yTG5GavhZg":{"text":"My First Po-Boy....and Booooy Was it Good ! -Feb.of 2010\n\nMy first time visiting New Orlea","useful":0,"cool":1},"N0TA5bIpYVdyU6ULCa2otw":{"text":"man people from new orleans will probably shoot me, but i've had better po boys in san fra","useful":0,"cool":0},"O8SmlWROz9ixBWdIOJdTBw":{"text":"Because it's a New Orleans institution, it gets 3 stars.  Because the food was nothing spe","useful":0,"cool":0},"1J9gYPeVb037FtgOkxM4_w":{"text":"Oh heck no! Compared to Parkway Bakery and R&O's, this place is terrible. Worst Po'Boy I'v","useful":1,"cool":2},"Qtx8OZ602FyPG03vFh9XfQ":{"text":"My husband and I had shrimp po-boys fully dressed (mayo,lettuce,tomato) and added cheddar ","useful":0,"cool":0},"htTGBPEvsTLnbWid4fxVsg":{"text":"My boyfriend and I were in NOLA last week for Mardi Gras, and we loved this place so much ","useful":0,"cool":0},"B0B1NzTWoVsL8SBgXceS0Q":{"text":"My favorite spot in the quarter for po-boys. Line may be intimidating but no worries it mo","useful":0,"cool":0},"vgq1So6OKKOVk2DfMMLhBA":{"text":"I am not sure why people think this is a place to wait in line for.   Food is average at b","useful":0,"cool":0},"9Kyd2A0FnZrK8NzhUUsnxQ":{"text":"Love love love this place!! Great prices and amazing food! My husband and I first went her","useful":1,"cool":0},"OiDm90_aaia06QmPYtCNcQ":{"text":"Zagat rated! Long lines, seating area available in the back, decent prices, kitchen is vis","useful":0,"cool":0},"rdXu-wezg3ios-7yXAUnSQ":{"text":"Shrimp po boy was amazing, best I've had  and would get the place 5 stars, but the service","useful":0,"cool":0},"DghrsL1sxdt9QN8fR2VQhA":{"text":"The amount of food is very substantial and it all very good! We tried the shrimp poboy and","useful":0,"cool":0},"10uRJCNukzg9ccUPpw9Oeg":{"text":"It was good but not great.  I think it is a tourist spot in the French Quarter. I got the ","useful":0,"cool":0},"UiDK0l7ecIxddMFwcgYt2A":{"text":"Such a great place. Order at the counter and find a seat. Be prepared to clean it off your","useful":0,"cool":0},"_inGcx8cManuYr_DxbnlVA":{"text":"the girl at the counter was nicer than expected. Its a small business and youd be better o","useful":0,"cool":0},"fj3ZqqFsYfoKQBXIkXvH8Q":{"text":"Don't be deterred by the price or the crowds. The Poboys here are no joke.\nHuge! And stuff","useful":1,"cool":0},"wrTBgSEjRUft4CCNeb2CBQ":{"text":"I never had a po boy before, but had wanted to try it for the longest time. Living in Los ","useful":0,"cool":0},"dYUO2vIr5lXvnZnhF-vaow":{"text":"Wow, I love the Po Boys. I had the shrimp one. It was so good. Could only eat half though.","useful":0,"cool":0},"IVRdZcKhmhd8bY1pD2e3Nw":{"text":"if you are in the french quarter....this is a must.....the place is small but always crowd","useful":7,"cool":6},"UTtdaLBJBzpKQ4zDHxUbtg":{"text":"I love New Orleans po boys with that special po boy bread, but Johnny's of the past was wa","useful":1,"cool":1},"SQgFRdx4RxhkRn1Wu9_cJg":{"text":"Perfect for a quick breakfast. Lunch is the ticket. Small with great New Orleans feel. Sta","useful":0,"cool":0},"AMgt4klHgM7tq67n5IMtvw":{"text":"Great Po boys at reasonable prices.  You can't go wrong eating anything on their menu!","useful":0,"cool":0},"64E7Ithublo2yFFvpr1_-w":{"text":"This was a very busy \"deli\" atmosphere place. There weren't many tables, maybe 7. It's a p","useful":1,"cool":0},"QbSoOApvuIlzrbs6YrmMzw":{"text":"Damn good. I had the veggie three omelet with hash browns and biscuit. Delish. Good price,","useful":0,"cool":0},"guVf0aoS3Fek0tlW8WEUOQ":{"text":"I think this was the best meal I had in all of New Orleans. Be aware that it is cash only ","useful":0,"cool":0},"78Of4A6SlW5kJk5d5XyElA":{"text":"HIghly over-rated.  Very small, cramped, and very busy at lunch.  Tables turn over rather ","useful":0,"cool":0},"j-zTtCdR01shSig24zX0Ig":{"text":"I think I might have reviewed this place years ago and back 10 years this was a staple of ","useful":0,"cool":0},"DA_LlhTpaYaIixn-6WhGkg":{"text":"Johnny's has the best breakfast hands down!!! My favorite plate is the Bayou Breakfast. Th","useful":1,"cool":0},"xchgT2mBWwgXIec6Yp6DZw":{"text":"The concierge at our hotel recommended Johnny's for poboys. When we arrived for lunch arou","useful":0,"cool":0},"eoGFUyIGDH0Oh0eqOTlwLg":{"text":"Loved the blackened chicken po-boy I snagged here a few days ago while visiting. It had a ","useful":0,"cool":0},"h8qzSsNXaHZzsS89So5lvg":{"text":"It was really hard to decide what Po Boy to order since they had so many listed on the men","useful":0,"cool":0},"9Bpee2gQWHSMD-NCK6-UzA":{"text":"This was the last eatery I hit up before heading back to NY. I made it a mission to get a ","useful":0,"cool":0},"1qYNjuS6d152eZjRzpabfg":{"text":"Suspect meats and condiments in what appears to be a suspect kitchen, seriously what more ","useful":0,"cool":0},"7Wj5SR-_JfWRLgEgLOhKfQ":{"text":"This place is a New Orleans staple. Order a fried shrimp or oyster poboy fully dressed and","useful":0,"cool":0},"uWpumxFYGxC1emknzDC2pA":{"text":"Hands down to Johnny's! Just a little hole in the wall place with delicious food! A must t","useful":0,"cool":0},"vBpyrhJ_zvsq0hABEnFzjw":{"text":"Was excited to try po-boys at this restaurant.. but was not impressed. The restaurant is c","useful":0,"cool":0},"I4QHeFVInm5gvVmetiVqKA":{"text":"Very disappointed! After all the mostly rave reviews, we expected a lot more.  Arrived at ","useful":0,"cool":0},"GYYbj2N7Zf-4oafdUuYOrw":{"text":"Came here twice during my trip.  Had the roast beef po-boy which was pretty good given tha","useful":0,"cool":0},"ToPjULtnjNv9qIlfTkuRNw":{"text":"Came for lunch on our last day in NOLA as it was by our hotel and it seemed to always be c","useful":0,"cool":0},"bkb1Z7UODIiWnaMIrEhxOw":{"text":"Of course a visit to New Orleans is incomplete without having some po boys. My family and ","useful":1,"cool":0},"9_8yxPHeyfbEGZ6wxlgZuw":{"text":"Johnny's was the first stop on my NOLA girls trip. My friends and I were super excited to ","useful":0,"cool":0},"xEuBY5-UHZj-_KV6Y0yqmA":{"text":"The 4 stars is based on the po-boys. The Johnny's special was very good. Combination of th","useful":0,"cool":0},"iDVdQdScSn6Agwavk8z2hg":{"text":"I hope the food is good. They are soooooooooo slow wishing we had not decided to pop in to","useful":0,"cool":0},"lhxWrZ2SUScDZ8_RW-Rdrg":{"text":"Great po boys at a decent price. That describes Johnny's. First off, they only accept cash","useful":1,"cool":0},"RX5lqtXo8FmdXbntpAji8g":{"text":"We ate here 3 times while we were in the FQ during Mardi Gras. I got the roast beef poboy ","useful":0,"cool":0},"UIwAMdrClwnzBNpbl96NCw":{"text":"We don't need to tell you not to listen to tourists, do we?\n \nJohnny's is a po'boy paradis","useful":1,"cool":0},"RlLHwm15ADleB0T8efF3gQ":{"text":"THE place for PoBoys! BIG menu, lots of variety, something for everyone. Great prices & fr","useful":0,"cool":0},"MJaUHIHok3sJQ2PKH6JTjg":{"text":"I hadn't been to Johnny's for around ten years.  Went back in December of 2014 and it was ","useful":0,"cool":0},"MAYFhjTjAQGw6S_ntL7sRg":{"text":"This is a small sandwich and breakfast place but the food is delicious!  I had a breakfast","useful":0,"cool":0},"PwSNFkxR4fhVYtMOVk4jrA":{"text":"Crunchy meet Chewy =Oyster Po-Boy\nFresh meet Soft= Leidenheimer French Bread\nLettuce, Toma","useful":0,"cool":0},"GX382vXNKzSsdY2DXQOEAA":{"text":"I find it tragic that this place isn't open late night.  Honestly, would there be a better","useful":0,"cool":0},"jmk2NLAJ0xak0N6wVyPn1A":{"text":"Unbelievably good, blew away my expectations which were high to begin with. One of the bes","useful":0,"cool":0},"hc0hrQkeLipX75TpUkLuPw":{"text":"Great sandwiches but huge so I'd split it.  Should offer half sizes.  Tight crowded quarte","useful":0,"cool":0},"fIVTjv4trnGpDH9wfmInKw":{"text":"Huuuuuge!  And i mean enormous!  Gigantic!  Bubba size! Brobdingnagian!  DDD size sandwhic","useful":0,"cool":0},"X3r-r0z0tyDPG-BB5Qj4FQ":{"text":"Found this place by accident and such a great find. Cash only establishment.  Large portio","useful":0,"cool":0},"vi4DfnFlPn3LAys5sbryKA":{"text":"I have been going to Johnny's since I could walk!  I am close to 50 so that has to be over","useful":0,"cool":0},"tOLBKgTDJnZjLD8CAuBSng":{"text":"I am only rating this a 4 because you can only order 12 inch sandwiches.  I gave my other ","useful":0,"cool":0},"kUWWe2BZfPW9-MeVhF7XTw":{"text":"We ate a late lunch at Johnny's Po Boys after completing the Rock 'n' Roll New Orleans Mar","useful":2,"cool":0},"LcfZb_wi0FAwkbGOrxI4KQ":{"text":"Po Boy fully dressed with Gumbo! I hope I never become too much of a foody to enjoy a plac","useful":0,"cool":0},"Op9_vrYwAwCznqkOz9i6Ew":{"text":"My friend (a local) took me to Johnny's on a recent trip to NOLA. Apparently, she has two ","useful":0,"cool":0},"Q6YyqXsNB7b335bSJnCZTw":{"text":"Great breakfast. Alligator sausage best out of the whole meal. Plates loaded to overflowin","useful":0,"cool":0},"_R9Kew1SLchMM4uuA4FNKg":{"text":"Blegh. Service is not great and food is only so so. Not worth going out of your way for.","useful":0,"cool":0},"qfV3AIxtJaFS8ePxckomxg":{"text":"This is my favorite.  There is always a line and it is a hole in the wall,  but you can't ","useful":0,"cool":0},"f8ATYhDmpXgdrRsZd3mZaQ":{"text":"I went back and today I had the half Gator sausage po boy, and seafood gumbo,it was delici","useful":0,"cool":0},"edlU7oeCnw5xZS5CsdIKBw":{"text":"I'm sure there are all sorts of opinions on where to get the best Po' Boy in New Orleans. ","useful":3,"cool":1},"CjbykzkQuiBRuZ4sM2KH2g":{"text":"Can't go to NOLA without trying a Po-Boy!\n\nSo a po boy is pretty much just a sandwich. We ","useful":1,"cool":1},"q6tg7HiXPcxFMZLh4IgPcQ":{"text":"I was hesitant about trying this place, even though it was recommended by the hotel. I've ","useful":0,"cool":0},"ziZA6vGrivjFb8nMs9oXVg":{"text":"Definitely a fan of Johnny's Po-Boys! Went there while I visited the Crescent City. I had ","useful":1,"cool":0},"Ca9G6fORIYdCQwBQcx-2iA":{"text":"Asked the manager of NOLA Couture for a recommendation on a nearby place to take my family","useful":0,"cool":0},"0sVIUheh7F8dlLOQoLn0Rw":{"text":"Always a long line and not worth it for the food! 1 star place... Should've gone elsewhere","useful":0,"cool":0},"ZDpgdpobYEU0ogsuPfgB4Q":{"text":"It's just a tradition in New Orleans that can't be missed.  It's just so busy that you hav","useful":0,"cool":0},"qxdTDm5pxiJ0J2pgF2Nu5Q":{"text":"Love them roast beef poboys! I get the 12 inch roast beef po boy and gumbo every time I go","useful":5,"cool":3},"hNJANLoASNeLyyrI7kcL6A":{"text":"Caveat: I'm not a fan of gulf oysters--I think they are flavorless.  However, they are mea","useful":0,"cool":0},"7BSh-lyk_5Mlvv7U7Xjmkw":{"text":"Best P.O. boy you'll eat! It's a must stop on every trip to the quarter. The Roast beef is","useful":0,"cool":0},"7lM9x1JSHXBwSmTwGweNnw":{"text":"Had the roast beef and if you have not beed here before the sandwiches are large. It was r","useful":0,"cool":0},"zXTGnfmC-sPrYaV22hPKSA":{"text":"Oh My Freaking Roast Beef Gawd - YUMMY! I decided to split a roast beef po-boy with my com","useful":0,"cool":0},"m19-2GU-eSUhYHSGzBHRSQ":{"text":"Sooo good.!!!!! The aligator po boy is the best sandwich I've ever had. Both happy and sad","useful":0,"cool":0},"ws-k2N9dcTLhdwzlMLkcrw":{"text":"The best deli outside of Philly I've ever been to.  Cash only, be prepared.  They deliver ","useful":0,"cool":0},"VQvu8qmL2IeoGUEBbSMCpw":{"text":"Hands down the best Po-Boys in town definitely recommend the roast beef and the shrimp.","useful":0,"cool":0},"ZjHeDcrwTxurIdknsGpvFg":{"text":"Super busy spot! A lot of food coming out of a small kitchen in record time! It was insane","useful":0,"cool":0},"s3TgvRsaDqILevNHfzitiQ":{"text":"The family and I were in our last food stop before heading to the airport to return home. ","useful":1,"cool":1},"J6uPOpbFHoNaF7Gn-L8LZw":{"text":"Overrated the signature poboy was too soggy and the gumbo had no flavor. Sure this place i","useful":0,"cool":0},"AqvIMDnstaDgcVQQrqfujg":{"text":"I expected more- and that was because this place was talked about so much before I got the","useful":0,"cool":0},"spUcobl7ydvBLznbSyJk_Q":{"text":"I ate here twice on my trip. I had a shrimp poboy and an Oyster poboy. Both were amazing, ","useful":0,"cool":0},"o5RqJRis21bldCNvO-sCbw":{"text":"On the suggestion of the hotel concierge we headed to get the best po boy in town.  If you","useful":1,"cool":0},"MUsIhSq4b8tV3rP2BTjB4A":{"text":"Everytime I come here the food is incredible, the roast beef poboys are unbelievable. The ","useful":1,"cool":1},"cYuexqFpVzL_oLI-eJ99Tw":{"text":"Despite eating tons of poboys on my trip i never got tired of them. My last meal of the tr","useful":0,"cool":0},"iqQv4ElKl_g6dmA_H9L-Hg":{"text":"Upon landing in NOLA for business, the first thing I wanted was to get a po-boy, and here ","useful":0,"cool":0},"UiLFNv_QdCvtIpF4HYcF3g":{"text":"Not bad, but not anything to write home about either. More like 2.5 stars.\n\nI got a crawfi","useful":0,"cool":0},"0fMzIs20IiyZmN3poxMeFw":{"text":"Yes, the line is long and so is the wait but soon enough you'll hear your number \"235!!!!!","useful":1,"cool":1},"MdLdIb1ZIhaU7TDBikGXwQ":{"text":"Husband had the shrimp po'boy and absolutely LOVED it! A great taste of a NOLA classic!","useful":0,"cool":0},"01PQbWF3nJ4GNcGMKKxJdA":{"text":"Here's the secret: I'm not much of a po' boy fan. I think it's the bread; it's not for me.","useful":0,"cool":0},"Lv0y2R-NmnWUHMsFwAJGZw":{"text":"This is a locals favorite that's why we went.  With a lot of places in the french square i","useful":0,"cool":0},"PrD7QgPmMY7-_1MfN-7aFA":{"text":"I found Johnny's only because it was around the corner from my hotel, French Market Inn. I","useful":5,"cool":3},"77FasEvgc2NZEQsPZ-XT1A":{"text":"Cheap awesome food. These po boys are HUGE and can easily be split between you and a frien","useful":0,"cool":0},"vZcF32CNvrOcGOPNmMr8fQ":{"text":"Johnny's Po-Boys has a friendly,welcoming atmosphere that no one can resist.Their food is ","useful":0,"cool":0},"udp9JkVQhpH49MEkqleoEw":{"text":"Po'boys are just fancy names for hoagies. Or sandwiches. \n   ... Yeah, it took me a bit to","useful":1,"cool":0},"xEJMjW2VCxueTmWyp-zPGA":{"text":"I must have been there on a bad day.  Ordered 1 catfish, 1 shrimp poboy and a grilled chee","useful":0,"cool":0},"Xi7puhMtqgidCh9RI_iw6w":{"text":"I have to say that a few locals told us to check out Johnny's Po-Boys, so we listened to t","useful":2,"cool":0},"P5aCZUudT3YTOZZL9psyfg":{"text":"After waiting in line for a little while, ordered roast beef po boy & shrimp gumbo.  Porti","useful":0,"cool":0},"GKQ5bZ43s8l8LV7TAEfIfA":{"text":"Coming from DC I decided to have lunch. I had 2 po boys 1 crab cake and 1 shrimp, the crab","useful":0,"cool":0},"j9tl1CQ05qr8t8_61WFntQ":{"text":"Cheapest place to eat decent in the French Quarter!  Great for a quick lunch when you are ","useful":0,"cool":0},"2vZdHhXqqMwXrvpNcH5gow":{"text":"We couldn't eat here. It smelled like a bag of shrimp had been left open. I understand it'","useful":0,"cool":0},"fYWjkyA6JWmrWVeWm8BOyg":{"text":"Best muffuletta I've had!\n\nTip: sit in the back room- more space, less crowded.  Go down t","useful":0,"cool":0},"I3M2L81CymcA6tKihWvB5Q":{"text":"I thought the bread here was dry and flavorless, though my husband really enjoyed his pobo","useful":1,"cool":0},"LSTT2dG2ZMr1g8a4EmFvig":{"text":"Oysters po-boy was fantastic. No ambiance, long line, great food. Note - They close early.","useful":0,"cool":0},"Ls3gy6FS951boOrIMb0HWg":{"text":"Funky New Orleans original, Johnny's serves up some good, New Orleans Po-boys and other so","useful":0,"cool":0},"OWpq9pWcFYu50qX4V4EGCQ":{"text":"Before leaving for the airport to head home I decided I wanted  a great Po Boy, very happy","useful":1,"cool":0},"MnC5ZzfIwknIM2jpt1JW8w":{"text":"Was encouraged to come here and have a local experience. We ordered the Po-boy, gumbo, jam","useful":0,"cool":0},"3UHEWRu72llyAamWuesRkw":{"text":"Ah, Johnny's, everyone recommends it. The line was long but moved fast. I'm glad I had rea","useful":0,"cool":0},"cOC2xAn_c63H5XjBSnAr9w":{"text":"The shrimp and oyster po'boy would be awesome to me if I'd never ventured out of New Orlea","useful":1,"cool":1},"pWRrhZZ4qK602H9x2W1QWA":{"text":"Shrimp po boy was overrated!!! Bread seemed stale. Would have been better with more pickle","useful":2,"cool":0},"Rf02SMU-1RIV-H5YVE48Zw":{"text":"For some reason, my roast beef po'boy didn't look like what I was expecting - maybe becaus","useful":1,"cool":1},"zWH1P-iGdC70f9YoRmaxSA":{"text":"Great Po Boys. Oyster, Soft shell crab, fried shrimp. Love it !!!","useful":0,"cool":0},"IACXTDXUR1FFhWJwhKQiAg":{"text":"Everyone that comes to New Orleans needs to come here and try a Po-Boy. Seriously!!!\nMy hu","useful":0,"cool":0},"iebu77uviKNeV6HWMtBSkQ":{"text":"I'm an avid Man vs. Food watcher... so I had Mother's on my mind. But after people saying ","useful":0,"cool":0},"b_Q0xZFzC1FJxDuogLTE9A":{"text":"I read reviews before we went and this seemed like a good place to eat. It in fact, was te","useful":0,"cool":0},"sJByDk2OrbsXpc3qRzy8qg":{"text":"A Po Boy is something you must have when you go to New Orleans and Johnny's won't let you ","useful":0,"cool":0},"bV_5OZKI6tpJCHkhi1kxEw":{"text":"this is probably the only po boy shop most people who have ever visited new orleans have e","useful":0,"cool":1},"2z4vqLBsrO7gkxIUbNWCZw":{"text":"Great place for a quick snack. Lines can be long and place is too small for the hordes of ","useful":0,"cool":0},"q5etLPWfDlpa31CeoXNftg":{"text":"Crawfish Po' boy: very stale bread with a poor bread-to-toppings ratio. The crawfish itsel","useful":0,"cool":0},"TtIkg-IHqiMIJpZncvme9A":{"text":"Overrated for Po-boys.  It's popular because it's in central downtown French quarters.  Th","useful":8,"cool":9},"JNrs22phm2tVTHTt5y1flA":{"text":"I had to try this place based on the Yelp reviews. They're actually open everyday until 4:","useful":1,"cool":0},"lHVEoHpy2uTN0jLutrIsRw":{"text":"We had the chicken parmesan.  Delicious!!!\nEnjoy\nThe staff was great and helpful.\nLarge sa","useful":1,"cool":0},"a7ELCjcclScFJfJK6qoKHg":{"text":"Traveled to NOLA with a large group of friends.  All of them ate here for various meals th","useful":0,"cool":0},"xOvToCvdsUAdLSA1poKQUg":{"text":"Can you have trauma from a sandwich? We had high hopes given the line out the door and the","useful":0,"cool":0},"aaziZViJa31aWtT88shRxw":{"text":"I came to New Orleans with a large group and two of us were told of a separate location wi","useful":1,"cool":2},"TVHP-iZUXaaK-XScC-nbug":{"text":"Seafood Gumbo was off hook, super legit. \n\nPo-Boy was a Po-Boy. The whole sandwich is big ","useful":2,"cool":0},"kzlZRDkt4GoBJe2UqYBtMA":{"text":"Overpriced compared to most local places for po-boys. We had high hopes from all the revie","useful":0,"cool":0},"BdjrdgKoMa2uJTyyr06Bfg":{"text":"We ordered a seafood muffaletta from here.  Being a foodie, I know a muffaletta We ordered","useful":1,"cool":0},"uQysVbtaq8Q_JVgSy_WY8Q":{"text":"I don't understand the appeal. Soggy sandwiches with weird flavors. Not my first choice.","useful":0,"cool":0},"pa6JdWdeUc6McHYhsQ6zwQ":{"text":"If you like oysters cooked...there is no better place to get them! I get the oyster po-boy","useful":1,"cool":1},"AwLUaAEqvT2qh7lP2GZgtQ":{"text":"Our first day in New Orleans, I was in a desperate need of a Po-Boy sandwich. I saw this p","useful":0,"cool":0},"KyFYySEZ6pzJqtkwDm8O5Q":{"text":"I had done my research before going to NOLA. I put this place pretty high on my list. I ma","useful":2,"cool":2},"5jvHYFPaRT1l07ef0HfOFg":{"text":"There was nothing about this place I didn't love. The place was pretty busy but service wa","useful":2,"cool":1},"aUSfH7v68U4-fwj6F1CY4Q":{"text":"Really fun, kind of dive place. Order at the counter and take a seat and they will let you","useful":0,"cool":0},"xz7vpABv8NjS5hJKMtH8JQ":{"text":"Disaster \n\nWhere do I start?  Johnnys might be the 2nd most famous Po Boy joint in NOLA.  ","useful":4,"cool":0},"QTkXZkH6CuKQcOSLjjGyNQ":{"text":"Really the best, long lines, but soooo worth the wait. The special I had was 1/2 po boy, c","useful":0,"cool":0},"wHvRYyMVxExvnhulb2Jtbg":{"text":"There are a million reviews for this place so I'll keep it short.\n\n-  Johnny's Po Boys has","useful":6,"cool":3},"-cj0vvunf5BsZVRih4k1Ww":{"text":"Been coming here whenever possible fir the past 25 years. I had the fortune of meeting Mr.","useful":0,"cool":0},"mptRCoPEnRgALdHxktGDJg":{"text":"Expect a line-up that goes out the door but love the casual atmosphere.  The oyster po boy","useful":0,"cool":0},"RMqudLRT79uFop3HM2YfLw":{"text":"The shrimp po boy was good. The sea food gumbo was great. Hush puppies were good. The Frie","useful":0,"cool":0},"-YUxDcMUWzxjv9y1l0U3MA":{"text":"Great po-boys, they are huge and so are muffulettas. Breakfast sandwhiches are very tasty.","useful":0,"cool":0},"eEocqah1sTW-2Xa2C-cyRQ":{"text":"Saturday brunch during Mardi Gras could not have been better. Our first taste of true Po-b","useful":0,"cool":0},"Jl7R9kPK0ZBmEPL7yHQxnQ":{"text":"I'm not sure who Johnny is but I would like to shake his hand. This place makes an awesome","useful":2,"cool":1},"kXidcbbbqyZp_xnq8-fbhA":{"text":"These po'boys are HUGE!!!\n\nThe first day we came here, we had the (permanent) special: 1/2","useful":0,"cool":0},"R2LT-UX_YWelzyCpJCz9xA":{"text":"Love, love this place! This was our first time in NOLA and I've seen this restaurant featu","useful":0,"cool":0},"GPnajhkaVdFG11gKHv4AAQ":{"text":"It was okay.  The bread was the crispy, light bread that makes a poboy, a poboy.  I had th","useful":0,"cool":0},"F1jB1DBVndfckEht3Pk7wg":{"text":"I ordered the shrimp Po-boy with the dressings and it came to just over $12, cash only. Sa","useful":0,"cool":0},"2VMZwzUm4bwcl4BT0UAQHA":{"text":"This place is located a few blocks from bourbon street. It's a small place that's tucked a","useful":0,"cool":0},"ilRqOixfXHtMLGArixufcg":{"text":"My best friend and I found this place looking at reviews on Yelp during our trip to New Or","useful":1,"cool":2},"0Fit8FcFMO6TU0mgKSSm6g":{"text":"When in NOLA I knew I had to try one of their famous po boy sandwiches. I debated between ","useful":1,"cool":0},"YP-zwTeE0cjItEX6LHpYxQ":{"text":"This place is a disgrace! Overcrowded and the \"additional seating\" section was blocked off","useful":0,"cool":0},"pvvUE9GhQyg0-VazPubRUg":{"text":"Honest, non pretentious, busy establishment that sees a LOT of tourists to expect to have ","useful":0,"cool":0},"PzxCdlIl9_jKOWs6vJGCSA":{"text":"This was our first meal at NOLA and was okay during lunchtime. There was a long line to or","useful":0,"cool":0},"syGpytpUVj53miPVhwA7YA":{"text":"Just had a catfish po boy and some \"boudin\".   Real good..","useful":0,"cool":0},"nskVPBVvfF2xGa-WYuYqQQ":{"text":"So I arrived to NOLA and my room was ready so I decided to go eat. I yelped Johnny's walke","useful":0,"cool":0},"u3_D8QgGqNBosdhZ5hgnuA":{"text":"Johnny's needs another review like I need another one of their shrimp po'boys...wait, that","useful":0,"cool":0},"0NdzsApZlgMJ_1C6yoPLiA":{"text":"*Good food\n*Long line but very quick\n*Friendly staff\n*A quick stop in, order at counter, s","useful":2,"cool":0},"sHnyAa1abtV0A-J-efpvZg":{"text":"Every time I'm in NOLA, I ask the cool people that work at the hotel, bars, galleries, sho","useful":2,"cool":0},"c3L47SGOb1Not1_oQfrN9g":{"text":"We had breakfast here and it was great!  The chicken dumplings and gravy were awesome and ","useful":0,"cool":0},"pqK9kF4qgD75h4DwWSBdVw":{"text":"Actually a pretty darn good po boy.  I had the oyster po boy and it was one of the best I'","useful":0,"cool":0},"NAJC6iVTAWtdcY5A_m7YJQ":{"text":"I'll keep coming back,food was good,only thing I didn't care for was the potato salad,not ","useful":0,"cool":0},"xcTMKO6D6W_RZ32JsrFVJw":{"text":"A bit on the pricey side, but it was totally worth it! I ordered the shrimp po-boy and my ","useful":0,"cool":0},"AGJ5BYPrmx3O7YZplW9QbA":{"text":"Our family tried 5 different Poorboy shops during our short stay in NOLA. This place was o","useful":0,"cool":0},"NSPhhxcKnoTPX07rUxOFNQ":{"text":"Liked this place.  There is normally a line;so, be prepared to wait.   I had breakfast her","useful":0,"cool":0},"_8HrThlckhRGV2lombOL4Q":{"text":"Went here for lunch, and it was bomb! We ordered an alligator sausage po boy and a fried s","useful":1,"cool":0},"4BlJSbRz7tq13LAbhy4bMw":{"text":"It was our second morning in New Orleans and we had no place in mind for breakfast. Took a","useful":1,"cool":0},"u-uXM0ylomF8zK_a4SiU7Q":{"text":"Long line, small cluttered dining room, but excellent po boys!  They are huge, so be prepa","useful":3,"cool":1},"t_QDNCXpkPNGZDgYwRndwA":{"text":"There are so many po boy joints in New Orleans and especially in the French Quarter but th","useful":2,"cool":1},"ZuRLtGivCmF2_lY5Ot7d0w":{"text":"I regret not getting the combo and getting a half size. HUGE portions. HUGE taste. Ask for","useful":0,"cool":0},"dvsXVbc_Y3NgfY0q9v5mwg":{"text":"They were really rude to me. The poboy is horrible. I would recommend skipping this one .","useful":0,"cool":0},"txrcg0A7Z6I_TDTl5sxAAg":{"text":"Last day in NOLA and hadn't gotten a chance to get my po boy. Did my research and Johnny's","useful":0,"cool":0},"8wXmbyehnM5nvDhGmtYjpQ":{"text":"First time in New Orleans. This place was recommended by my Uber driver and was happy to f","useful":0,"cool":0},"9dhNR4n7PblFiVlFg2Ts1Q":{"text":"ehhh i wanted a shrimp/oyster po boy but they were out/did not have oysters so i just got ","useful":1,"cool":0},"I5xJJWPvaivu642YTc2a5Q":{"text":"Fantastic shrimp po boy. The sweet potato fries and gumbo were also really good. \nHuge ser","useful":0,"cool":0},"YG-wWQs76y4Au4EL_OIwZg":{"text":"This is a little hole in the wall place, with great po boys. I am glad that this place was","useful":0,"cool":0},"6l1D5-aoPEHudl9AfQB1Hw":{"text":"KPork chop po' boy was great, the fact that it was deep-fried was a tasty surprise. 15 min","useful":0,"cool":0},"-isK7lZZMLfqWwMYQY3OOw":{"text":"Their shrimp and fried ouster po-boy is best in town.  Their bread is puffy and soft as op","useful":0,"cool":0},"6QGTvgjWa9S5o9cm2bGVUg":{"text":"We only tried the catfish po boy, which limits our opinions on food but it was really just","useful":0,"cool":1},"NDPbjVjbPxsbXbb5x56F9A":{"text":"I was on vacation there for 5 days and Johnny's was the best po-boy sandwich I found. I ha","useful":0,"cool":0},"fv7wYASHsUMy5kfbAC7KDQ":{"text":"Ok so I didn't get too much out of the French Quarter to see the rest of the city but I di","useful":0,"cool":0},"v4G8S_GJ4jrM1AFGyhDnRw":{"text":"Great little hole-in-the wall place.  It's tiny, so you may not get a seat.  \n\nI had the m","useful":0,"cool":0},"ivFo7nLNHkGjBWPGZTbHRQ":{"text":"Price for their po boys were to high. Their po boys did not taste very well they fail to d","useful":0,"cool":0},"scjrCsDjtoppnzAjAhJNAA":{"text":"This place is fantastic. Anyone who goes to New Orleans must find sometime out of their va","useful":0,"cool":0},"fwHaefSBpjrfRAcW0kBheg":{"text":"I was very disappointed in this restaurant. The reviews said it was a place you must visit","useful":0,"cool":0},"3m1O7jXMl1rMvhth2WVQHA":{"text":"Great muffaletta. Very garlicky.  I still prefer the one at Fertitta's in Shreveport by a ","useful":0,"cool":0},"KCFHwySJNahHAP85sqxoqw":{"text":"There is a reason this place has over 1,000 reviews. Best sandwich of my life. It's a hole","useful":0,"cool":0},"tOv2To8UITqpNfuuGkumFg":{"text":"Ok place, remember only accepts cash. Ay first was little disappointed the poboys were ser","useful":0,"cool":0},"myGST7u1O2VVViK9qowFTg":{"text":"Fast and great catfish!! Best catfish we have had in New Orleans as of today! Comes with s","useful":0,"cool":0},"y3TQ4RvX2hhsmMo1fLW6DA":{"text":"Just walked out after getting my money back. Sat for over 30 minutes waiting on our food. ","useful":0,"cool":0},"sIK1MgyyYeEQOC4oSRRAEw":{"text":"Louisiana is suppose to be known for their po boys and since it was our last day in New Or","useful":0,"cool":0},"RuCQkSGw92VojcSVcCej_w":{"text":"The one thing I wanted more than anything was to have a great fried shrimp po' boy when I ","useful":5,"cool":1},"3v6Hphl3QgY8k4kvyKa-GA":{"text":"Amazing Po-Boys!  A local recommended we go here and they were amazing...huge, flavorful..","useful":1,"cool":0},"atNRr7fzzqywMNK9P0ZtWg":{"text":"This is the best place ever to get any type of po'boy. I got the shrimp one and wow it was","useful":0,"cool":0},"uxo2HgMWCSjget3y-X-0ig":{"text":"We went here after getting a recommendation from a waiter at a great dinner place after we","useful":0,"cool":0},"6Yj_i29pOprjwRxZ6rQg3w":{"text":"Ok, so take this review with a grain of salt.  I'm from Seattle via Bay Area via San Diego","useful":0,"cool":0},"Qb7SvPScOenXscnhKhgSpQ":{"text":"Pure and simple.......delicious. This is why I came to New Orleans. Shrimp Po'boy is easil","useful":0,"cool":0},"q6EfWclRQrTv-PsfmzeB1A":{"text":"You really can't go wrong with deep-fried seafood. I think that the bread and dressings ar","useful":0,"cool":0},"hna2fPxBWqhZuBXLo5fZIQ":{"text":"We always stop at this small Po boy place because the oyster Po boy is the bomb. It's conv","useful":0,"cool":0},"ByPufmZfckumpCy7rcHsCQ":{"text":"It's crowded and small but wow that food is good! I got the shrimp gumbo and the fried cat","useful":0,"cool":0},"shmG1TEM4qbN6kzsCpKqvA":{"text":"If you have ever heard all the hype that goes with Johnny's but have never tried it out le","useful":1,"cool":0},"6365K_AUc1Y9L1ieg93P0g":{"text":"DO NOT miss out on the food at Johnny's. Yes, the place is a hole in the wall but the po-b","useful":0,"cool":0},"uhggSTizmpWPVtlsAq4ImA":{"text":"Even tho word on the street is that you head down to Johnny's for a REAL po-boy, me and my","useful":0,"cool":0},"Puy8yaKWtOwxbZfGwkozDA":{"text":"One of the most famous spots to get a Po-Boy sandwich in New Orleans! I suggest coming fai","useful":1,"cool":1},"J0A16BsOucpgLSNF54Mguw":{"text":"A must go if you're in the area. Well worth the wait. GET THE MUFFALATA! It won't let you ","useful":0,"cool":0},"RD4kESq0xqonFNqV52Drag":{"text":"3.5\n\nI'm not sure if I'm giving Johnny's a fair rating since I didn't get any mayo in my P","useful":3,"cool":4},"nu2J1X-bEm2HqMVxyjGS7Q":{"text":"Oyster & shrimp po-boys was delicious and off the chain!!! It's a small place but you can ","useful":0,"cool":0},"0i1irrwh9MmPXX2g5U1ajw":{"text":"Our order was taken quickly; the wait was mainly for the team to cook our order. I like th","useful":1,"cool":1},"vt33UH41z6EtHCTq2y4cIw":{"text":"I heart New Orleans, I double heart food in New Orleans! \n\nWe were in town for French Quar","useful":0,"cool":0},"lYoNIFi5RSPaggbhX82FNQ":{"text":"If you go to New Orleans and you don't go to Johnny's you didn't do it right. This place i","useful":0,"cool":0},"yGCaDsBTkjVMwdq4eUmQhA":{"text":"I was in a bit of rush and was trying to make sure I ate everything I wanted to NO and the","useful":1,"cool":2},"xoJtlzMH9jTfp0VC3FwknQ":{"text":"Acceptable though not exciting. Too much mayo and too little greenery on a \"dressed\". Prob","useful":0,"cool":0},"yPw05EFnq_5N4xivUKU75Q":{"text":"Excellent breakfast! Alligator sausage with shrimp grits hit the spot! Nice, friendly peop","useful":0,"cool":0},"ouAy7vuZaYPxV63QFJu5Zw":{"text":"For all the raves, we just thought it was sort of okay. I would't say it was BAD, but we w","useful":0,"cool":0},"Qj7TjHVsYKgLEm_tptU6eg":{"text":"They always have good gumbo here and the po-boys are usually pretty awesome.  This place c","useful":0,"cool":0},"bTxz2rKWUpKPwErhcPoO8Q":{"text":"I always look for the classic area eateries when I am traveling and Johnny's was a great f","useful":0,"cool":0},"hb5QDlfvGVoD6FldE1S2sA":{"text":"Pre-NOLA visit, Johnny's Po-Boys was my culinary Mecca.  I did research on Yelp (thanks, Y","useful":7,"cool":3},"GlzfAcOkJnCThBG_vBG06w":{"text":"After one of the walking tours we were hungry so we asked who has the best po boy in the a","useful":9,"cool":11},"KPxx0m4j6d7BMvvH6j0Rwg":{"text":"Ahhhhhhhh I finally got to try you and you were amazing. Before going to New Orleans Johnn","useful":1,"cool":3},"VsBbDvPY5HHRz4W4-8octg":{"text":"I had a pretty good time at this restaurant. There were a lot of customers waiting in line","useful":2,"cool":0},"yMAxwXunHZgjf2PWQ45tUw":{"text":"I read somewhere these were the real deal po-boys. To my taste they were just alright, not","useful":0,"cool":0},"el8ElKCrwsxv2GFnynh9pw":{"text":"Well, here we have another fine establishment that is not aware that we are living in 2015","useful":0,"cool":0},"B7KRfC54NJWSSEjSM4_duQ":{"text":"Take cash. Be willing to stand on line for awhile and go with friends who aren't bothered ","useful":0,"cool":0},"7FGsCEymQsdbxZBuWs3Dbg":{"text":"Simply the best! I had an oyster po-boy fully dressed with tarter and hot sauce and the ab","useful":0,"cool":0},"a3w4_NF9neXVuin5MMo_Sw":{"text":"Hands down best shrimp po boy I've had in my life. The reason why I'm docking one star is ","useful":1,"cool":0},"WVyL7st3rO3e-iSQZFh2LQ":{"text":"This is the place for a legit po-boy sandwich.  The roast beef is juicy and full of flavor","useful":0,"cool":0},"redbO_zfLPG5FGDoMyaoOA":{"text":"\"Make 'Em Say Uhh!\"\n\nCall me a Johnny's Po-Boys girl. When my posse arrived, there was a t","useful":1,"cool":1},"VJCkKDiXrYDlSowemj3nBA":{"text":"The seafood gumbo is flavorful with a little heat and tender shrimp. The Johnny's Special ","useful":0,"cool":0},"wJaDB3axgddW7RF2ZuPHtQ":{"text":"Great hole in the wall. Don't pass it up!! Burgers, jambalaya, portions for cost were grea","useful":0,"cool":0},"WaWDT4lYzDKSnqNqPetnMg":{"text":"It can get pretty crowded but don't let that stop you from checking it out! The staff was ","useful":0,"cool":0},"8pC-hwTQPlihew0GRbJgXQ":{"text":"I wanted the soft shell crab po boy but there weren't available the day I went. Sad stuff ","useful":0,"cool":0},"Yf6Zlw8nvDp-RK6BBhbd8w":{"text":"As always Johnny's is delicious! The absolute best Po Boys in NOLA!! This is a MUST stop!!","useful":1,"cool":1},"O12l6u9FOETWi3Nk4pmngQ":{"text":"This place is a must for anyone traveling to New Orleans in the French Quarter.  The roast","useful":0,"cool":0},"H9u8GfalOJ4GFp1i1w3Xjw":{"text":"I downloaded Yelp just to give this place a bad review. Go somewhere else to eat. Zero sta","useful":0,"cool":0},"IkNyjryPsPchzOYvt-o1kA":{"text":"Hmmm......I was kinda disappointed in that they charged 60 more cents to add lettuce, toma","useful":3,"cool":2},"GbFfNP1aVDuhmPBSLwFY0w":{"text":"There's a reason this place is legendary. The food was amazing. I had the shrimp and my wi","useful":0,"cool":0},"jNiD5Eu5DSyQBI7LvAgERg":{"text":"While in line to get my food, I watched them dip a loaf of bread in melted butter and then","useful":0,"cool":1},"hrTPRa6h59ypj8bwnnUPkQ":{"text":"Traditional stop off in the quarter for either a po boy or muffelatta.  I had the crawfish","useful":0,"cool":0},"jVTjUoKFTz8TOWWmHVFNAw":{"text":"This place was OK?  Nothing fantastic.  I had the shrimp po'boy and Jennifer had the Johnn","useful":2,"cool":0},"9OXV3CxYgJd9IiPo6hcwkg":{"text":"Amazing Po-Boys and great value. We tried the blackened Cajun chicken and catfish Po-Boys!","useful":0,"cool":0},"GVeXkg-FR5VI8lKwQhNheA":{"text":"Cool old place with a bunch of tasty sandwiches to choose from.  If you're looking to try ","useful":0,"cool":0},"sWWp7LoibTp-f2HaQEVtHA":{"text":"One po' boy, half fried oyster and half fried shrimp.  I enjoyed the fried shrimp side mor","useful":3,"cool":3},"Nb6ZpgYzqD8YxdNp8sneYA":{"text":"Cash only. No problem. If you don't carry cash at all times, you probably make a lot of ot","useful":0,"cool":0},"ad3lhRBVBuF-kzh9XbuKcQ":{"text":"Johnny's is a plain little place, like a lunch counter.  And I don't mean this as a critiq","useful":1,"cool":0},"eS-37RmaKLHHQ1ud4RBgTQ":{"text":"Nice low key place to grab delicious sandwiches! The ambiance is very casual since it is j","useful":0,"cool":0},"aK5-Xo-9IVZqHhBBrnrhAQ":{"text":"Oh happy day!! So good! It's only my second time there and I pray it won't be my last. Don","useful":0,"cool":0},"tfW9Cgu6zOlSNPCBqfrlVg":{"text":"This is the only poboys I had so not much to compare it to! I did it think it was good esp","useful":0,"cool":0},"f-iotScjVRFF8qaXAaAVWQ":{"text":"We had lunch here yesterday, and it was tasty.  They had a long line when we got there, an","useful":0,"cool":1},"OqZMEkxcfQxTgVpM1JbsXw":{"text":"A little disappointing. I liked the variety of po boys and the fillings tasted okay, but t","useful":0,"cool":0},"98mGfBbwfFHVgVDrxL4r9w":{"text":"Simply done shrimp po' boy was very good. Well seasoned & tender. Bread was fresh. Sandwic","useful":0,"cool":0},"wXgpsMY5ZflY29qumWqiMA":{"text":"Best po-boys in New Orleans. Love this place. Great prices and quick service. Popular with","useful":0,"cool":0},"CIuJw7Z3zZOEkcY4gLyj6w":{"text":"When visiting the Big Easy, this spot is great for poboys. There are many variations of th","useful":0,"cool":0},"Ps9glJpfiBI15jikd8rHhA":{"text":"The oyster po boy was decidedly meh and a bit sparse on the oysters (for $15.95). The jamb","useful":0,"cool":0},"92Wzd8TPLUa1J_M6ze9PRQ":{"text":"Had the 1/2 catfish poboy (dressed) with a bowl of gumbo both are to die for.","useful":0,"cool":0},"n8YKNoz1xJHJDe-_jxfbcQ":{"text":"Clearly, Johnny's must be known for Po Boys....and what he states, he delivers.  AND not o","useful":0,"cool":0},"bYzUqt-lp7_X2TrHZt4lng":{"text":"Got a shrimp po-boy. Was told it was a life changer. I was disappointed. \n\nOverrated. Not ","useful":1,"cool":0},"k_k-L8sbbYZxA6enjI6pfQ":{"text":"Really good Shrimp Po-Boy, and the rudest service I have ever received in the city of New ","useful":0,"cool":0},"9__PiNa7Od1UfDddQZUo8A":{"text":"After asking a few locals for recommendations, everyone said go to Johnnys. I got to say, ","useful":1,"cool":1},"ygHIusCwJEzfym26iK6CUw":{"text":"This is a great place to come eat a breakfast po boy sandwich! I love to see them cooking ","useful":0,"cool":0},"qWEIWeW9Ipj8q1zY3ITghg":{"text":"Last day in Nola and I stopped at this historic shop for lunch with my husband..  Having e","useful":0,"cool":0},"cacLRoOwWWf4A5aF8JJE5g":{"text":"Our last meal in New Orleans, we were willing to wait in line for one last po-boy.  My mea","useful":2,"cool":0},"jl94EwMMENuzOOStwvOg8w":{"text":"My family and I had such an awesome lunch here!\n\nWe split 2 Shrimp Poboy and Gumbo combos.","useful":3,"cool":2},"hkztVbpdW6Hy31jWia_gFg":{"text":"Solid but not amazing. We managed to get there before a huge line formed, but the line and","useful":1,"cool":1},"cBc_YSh5A-aS45G6L31Iaw":{"text":"Very good shrimp poboy. Another person in our party had the roast beef po boy and raved ov","useful":0,"cool":0},"3_7hA6ytkRNNSdSAru1Ugg":{"text":"I just loved my first experience at Johnny's Po-Boys. If you want breakfast, make sure to ","useful":3,"cool":6},"nK_g78bRYvpgcUeSnR9Q5Q":{"text":"This is my first po boy in New Orleans and it did not disappoint. My husband and I shared ","useful":0,"cool":0},"m25ujMB6sVGdMR2stH87zg":{"text":"Had a smoked sausage Po'Boy for the 1st time. I usually just get shrimp. It was damn good.","useful":0,"cool":0},"z70IdbvSkDsnVTYBVGGyvw":{"text":"Wouldn't be a trip to New Orleans without having a Po-Boy, and Johnny's is the place to ge","useful":0,"cool":0},"26VzilWedhSVfDH7nltC_A":{"text":"Meh. Maybe I just didn't really know what to expect from a po'boy, but I really didn't car","useful":0,"cool":0},"8MeZ2xmEo0t0cVNI4IPSZQ":{"text":"I don't know why this place is so famous. Food was just meh, with long lines and no seatin","useful":0,"cool":0},"qf_Q7C8om2JRbZKN6FPsmg":{"text":"My favorite place to eat in NOLA!!!! Always a must stop for my family. The Catfish PO-Boy ","useful":0,"cool":0},"dWCAu_u1tlztfLELGi2VNw":{"text":"You cannot go wrong with this place.  An institution of epic culimary po Boy greatness.  B","useful":0,"cool":0},"H8XyyuoH6bf8qbT20HyTAQ":{"text":"Wow, the po boys!\n\nThe place looks like a dive and you may question your decision until yo","useful":1,"cool":1},"5NIDQxeu44oZDWg55cANLw":{"text":"Greatness!!!\n\nThe whole time we were in New Orleans, my plan was to get a killer Oyster Po","useful":2,"cool":1},"eyIbbDObQ51Hyt-HSCWeUQ":{"text":"I find paying $13 for a \"po' boy\" highly ironic. Right near the super tourist district (Bu","useful":0,"cool":0},"iEH0eIW4cWtcEF6K4dVzgw":{"text":"Johnny's gets 10 stars for my Saturday morning 10am poboy meatball cheese & gravy fix.  Th","useful":3,"cool":1},"sEOuFpgSr6lfLwfQYfXPMg":{"text":"This was my second po-boy and I was so disappointed.  After eating at Parkway, there was j","useful":2,"cool":0},"Z54o0ueK2zuu9ZR_UHbefQ":{"text":"Although Johnny's Po-Boys was recommended to us and has a good reputation in New Orleans o","useful":5,"cool":4},"-qfyrpeWADE0uYptym_LzQ":{"text":"Johnny Johnny? \nNo, Pa Pa\n\nWell, had my first shrimp po boy here and it was a let down. Br","useful":0,"cool":0},"kNlJaVw8GYtwLl9sWfTFfA":{"text":"Got the shrimp po-boy and it was tasty.  My friend also got the alligator sausage po-poy a","useful":2,"cool":1},"ixSGnvB-ykBsFS2gZoTV-g":{"text":"This is a very small shop with a little bit of seating but it's meant more for take out. I","useful":2,"cool":2},"Ton04ib3aDJaF-_waafeoA":{"text":"So good! Looks like a little while in the wall diner. Only had their breakfast but it was ","useful":0,"cool":0},"RyZvwFFk7hO6TtV-WfVeDA":{"text":"In a city where many restaurants serve po boys, this is the most famous.  It's also small,","useful":0,"cool":0},"E6o1YV7T8LemOv-Ig7VIRg":{"text":"I looked for a restaurant that specifically focused on Po Boys, there's too many places to","useful":1,"cool":0},"dJ9DakiKPP4bIBlbJOCZKA":{"text":"I decided on trying a couple of po boys from Johnny's based on the reviews, location, and ","useful":0,"cool":0},"RC3U7zbQO295hB9fMp9_gA":{"text":"Love this place. Received a recommendation from a friend to try it out when I visited NOLA","useful":2,"cool":0},"jnkPgObLXvnbxQ-XwRN0Xw":{"text":"The shrimp po boy was very tasty! The shrimp was crisp and nicely seasoned, but the bread ","useful":0,"cool":2},"N8c3NI9ntC6wuNZQZ-GU9Q":{"text":"We had a great experience at Johnny's. We came between typical lunch and dinner times and ","useful":1,"cool":1},"n7Po52EEoSnbpYKnWvyrTQ":{"text":"During our recent trip to NOLA, we had this on our list for one of our many food stops!\n\nL","useful":1,"cool":0},"_oVrGoDsgb7O1zbHcmXdCQ":{"text":"Very local feel and good atmosphere for a packed eatery. Experienced the Voodoo Shrimp and","useful":0,"cool":0},"McHoX1s508c6oOY37fKEmA":{"text":"Yummy po-boys at 8am.  My favorite is the fried chicken, meatball.  You can't go wrong.","useful":0,"cool":1},"a5OmaCHvdmzAQAwxh9Z_2g":{"text":"Saw this place on food network so I tried it when I was visiting for work, Juicy beef sand","useful":0,"cool":0},"oriCESPc6Triz_z1tTmCtg":{"text":"We went there for brunch. We heard a lot about this place but this is truly more a tourist","useful":0,"cool":0},"RRJaoEwFH77XjB2HSB1tFg":{"text":"I don't get this at all. All I can say is that I had a oyster po boy. I spent about 20 min","useful":0,"cool":0},"Ts0QPN1haMOOjIpcTXubYw":{"text":"Not gonna bash this place. You go in with mediocore expectations and you will be pleasantl","useful":1,"cool":0},"_ylNliCeX6JeLGlM7uZk9Q":{"text":"i had the shrimp po boy which i felt wasn't the best i've ever had but the sea food gumbo ","useful":0,"cool":0},"UBD7IBppuBFa4p7pwC3NDg":{"text":"popular busy place even in a giant downpour. \nWe had an oyster po boy.  Not the smartest c","useful":0,"cool":0},"JICX8sK75BNNNbEohQBRVQ":{"text":"I have to explain the 4. You do not go here for the ambiance or the atmosphere. It's crowd","useful":0,"cool":0},"nGdOsC8yQMt463QrVse8sw":{"text":"Tried the combo platter with catfish and shrimp. Good taste with large portions.  Also had","useful":0,"cool":0},"OPH7-Zf0OWbC8gwjt8e0aw":{"text":"great po-boys. they are huge and fresh. no nonsence, cash only and really a hole in the wa","useful":0,"cool":0},"thEKD_k_mr1BvR8xCr5uKw":{"text":"I wonder why they are so famous. I have had better po boy back in Phoenix. Tried shrimp po","useful":8,"cool":6},"1DG6_XTcbGXZs309LslxbA":{"text":"It is our NOLA tradition to get a Po Boy here at Johnny's since our 1st trip in 2000. They","useful":0,"cool":0},"X-PT_r8NLq_MOapYKCLQFg":{"text":"So much flavor in one Po'boy! The Surf & Turf ($11.95) contained roast beef dripping in gr","useful":0,"cool":0},"9-lcPR14v6cuWMENwrP_zA":{"text":"The po-boys were pretty good.  But I'm honestly not sure what all the hype was about.  It ","useful":1,"cool":0},"8ZMVmD4YbqpO_xnYV7BiTg":{"text":"We were only in NOLA for a few days, but managed to taste a fair number of oyster po boys.","useful":0,"cool":0},"5IMpb8T_XNzkpPuwAvMElw":{"text":"The best roast beef po-boy I've ever had!! This place is a tad small so not a lot of sitti","useful":0,"cool":0},"QpVwnbEv-l_DWkGXRsmlZQ":{"text":"Johnny's, the oldest Po' Boy in NOLA was part of my foodie bucket list that didn't fail to","useful":0,"cool":0},"9oL-VgSuyg7ddUXFIUiyZw":{"text":"Atmosphere is a little grimy but the food is good. Seafood was fresh and my hubby really e","useful":0,"cool":0},"aSmiagYYr1Z6rE6xsX3vag":{"text":"We had lunch here at around 2pm on a Friday afternoon. The line was to the door, overall w","useful":1,"cool":0},"wSqeVXW5viFiw9l9RMhKHA":{"text":"Johhnys Poboys is about as classic of a place as you can get with its red and white checke","useful":0,"cool":0},"gIpEslsET2B1oJC8cgSz5g":{"text":"Muffaletta, Muffaletta, Muffaleta. Order this off their menu, eat half and be full. Give t","useful":0,"cool":0},"iGrJZ1eOvrb7z4K2RDhsuQ":{"text":"Ordered the soft shell and catfish bo boy.  Both were good.  And you know what else was go","useful":1,"cool":1},"6WFD0MLXt27vs-64dy3AJw":{"text":"Johnny's use to be my favorite Po Boy restaurant in all of New Orleans. The quality has re","useful":0,"cool":0},"sCp2CvvMkJUb6u5q5gkp-Q":{"text":"Our first stop in the French Quarter, this place was recommended by cab driver.  I got the","useful":0,"cool":0},"NPZj0U_CY1Jn8AEayOMr9A":{"text":"Im unsure how this place survives with so many better po' boy or food options. The staff i","useful":0,"cool":0},"jSP9P9UR-Fj4g9686sBbiQ":{"text":"A staple on every trip, very good po boys and fixins. Very busy, and small, good part is y","useful":0,"cool":0},"Q2X06FwrSjqQdr_9rG9-4g":{"text":"I've been coming here for over 15 years during my trips to New Orleans.  I've never had a ","useful":0,"cool":0},"x_SDjmY2DwKbuscLJwUjCg":{"text":"I read and heard so much about this place, so I was totally shocked by what a dump it is. ","useful":1,"cool":0},"xeC4lr485uVxbzCTxb87mA":{"text":"After a few days stuck in the French Quarter, I couldn't risk eating another tasteless bad","useful":0,"cool":0},"tbQiWAtdo6dl92Ll14n_aw":{"text":"This place is fantastic.  I got the shrimp po boy one afternoon, and it was fully stuffed ","useful":0,"cool":0},"iSzbfFqnD3B6viOuAnLeFg":{"text":"I may never eat another po'boy again. It would be cheating. It would be disappointing. It ","useful":3,"cool":2},"xBvyD-Rtyml1YQqVwDXnmQ":{"text":"This is a must visit. Get the roast beef with the works, it's to die for.  Service is fast","useful":0,"cool":0},"GanBGLFisQzi1-xap1C-5g":{"text":"Read with an open mind.\n\nI'll start by saying, I tried a Po-Boy because well, I was in New","useful":1,"cool":1},"4hcuipyYiC54B-cU-lmAcg":{"text":"Food was outstanding. Great quality. Everything was deep fried but fresh, and tasted great","useful":0,"cool":0},"QueJSdPNXFSxMMyrlXG2ig":{"text":"Since today was our last day here, I decided to squeeze in as many establishments as I can","useful":0,"cool":0},"sHqN3OgIY_EseUZa_SEaEA":{"text":"Great food! Fun and fast atmosphere. Not kitschy- which is refreshing since the French Qua","useful":0,"cool":0},"AyZzPaKQ5D5ENLAV4shyEg":{"text":"Very crowded in the front and waiting in line but there is seating in the back!! I like it","useful":0,"cool":0},"2edhCg0c0Hq0ANSbtVUT3Q":{"text":"\"Even My Failures are Edible\"... what a great motto!\n\nHands down, best po-boys in the Quar","useful":1,"cool":1},"kekB9WtXghpLypjRMUcUwg":{"text":"I wanted to get a po boy and seeing as I had tried shrimp before coming to New Orleans, I ","useful":0,"cool":0},"Ld0-W1mVcczmCsCa0k8B3A":{"text":"Outstanding shrimp poboy.  There was a long line, but the 20 minute wait was well worth it","useful":0,"cool":0},"zI_rPebYWtF7aCFy5CVe7w":{"text":"Best Shrimp PO-Boys in NOLA, hands down. Nothing fancy, just great food. A cup of gumbo wa","useful":0,"cool":0},"SHrW8Pe2a2Odh9WArfwGTw":{"text":"My first po-boy experience in New Orleans. I ordered the Johnny's Special: Beef with grill","useful":0,"cool":1},"0IJ54yrIN7mL_oYVFpJ1tA":{"text":"I local at Jackson Square told me about this place.  And I was very appreciative.  I felt ","useful":0,"cool":0},"bDnr-WuMhkfv6oM7koMIQQ":{"text":"I loved the atmosphere and service.  The shrimp/catfish Po Boy had vein in shrimp, which I","useful":0,"cool":0},"QmU485_pMkOCxpVpuDKe_Q":{"text":"Stale bread, poorly fried shrimp, upcharge for dressed. You can find a better po-boy at a ","useful":0,"cool":0},"xpdcn5rKZVbFhmPrZEO6Qw":{"text":"An institution of New Orleans, the memories and history ooze off of the walls almost as fa","useful":11,"cool":8},"0_r0uDVsbq4K_ZBFWwi61A":{"text":"This place is extremely tiny for a restaurant but the Po-Boys are worth it! Do yourself a ","useful":0,"cool":0},"rWt-VwbDELyV9aOxTtFnlg":{"text":"Yum!\n\nYes, be prepared to wait in line.  But it's New Orleans - you'll meet someone to tal","useful":1,"cool":1},"IBmMdOHkVhRT65VKowTyeg":{"text":"If I could give a negative rating I would.  Gross doesn't begin to describe this place.  I","useful":3,"cool":0},"ZJYGyapaHR8P6BnJRxIbLA":{"text":"Johnnys has been a staple during a New Orleans visit for me since 1988.  The food was alwa","useful":0,"cool":0},"Va6UayOj6vADgZ7AqhEleA":{"text":"My husband and I shared an oyster po boy, the sandwiches are gigantic! The oysters were go","useful":0,"cool":0},"YIFpSOAOTVCdX93lxLh_9g":{"text":"Thank god they had hot sauce on the table.\n\nTwo locals recommened this place and quite hon","useful":0,"cool":0},"xRJOJOqv88W9ZYeKmwdfSw":{"text":"Don't come here with a small appetite or a prissy attitude, come here for the Po boy. This","useful":3,"cool":2},"Tf5kW-OvsSovVHs9ourVyg":{"text":"Yummy po-boys, great seafood gumbo with generous amount of shrimp!  Be aware that they onl","useful":0,"cool":0},"KN7EHAXr3J0vwwQwxF8_tw":{"text":"So far, I've had the Seafood Muffelata, a tuna salad po boy, a shrimp po boy; all of it is","useful":0,"cool":1},"Y5GwCTJELMJYSjhaBS2yaQ":{"text":"Top notch Po-Boy place...unfortunately it's crazy crowded and that makes it hard to get so","useful":0,"cool":0},"iZ0UXVWDiL4A-aKeo5EEiQ":{"text":"Yoooo what a gem!! It's a small spot, but everyone is very friendly. The shrimp po-boy is ","useful":1,"cool":2},"78D7RlhmAx81VOYdR_pJmA":{"text":"Overall, a good soft shell crab sandwich that I got. But at nearly $19, it was just warm e","useful":0,"cool":0},"cF4KwYwINZ2ai_t6Jn1ZxQ":{"text":"This place is packed! They do close early so plan accordingly. We liked the shrimp po boy ","useful":0,"cool":0},"oVqlQycdYzRNwWOR-Iv6ag":{"text":"Really good place to get a Po Boy sandwhich, however only rating 3 stars due to the wait. ","useful":0,"cool":0},"cmHMAY_4SFKJGzD0zgPfZw":{"text":"The sandwiches are expensive but is really large enough to make two adults very full. Ther","useful":4,"cool":4},"EqIlT_9wnsWNjLn-4eYa9Q":{"text":"Delicious flavorful southern food, totally authentic. Service was quick and friendly. Kind","useful":0,"cool":0},"_-YejXnBp0CuAIrL8m5Evg":{"text":"There's a reason (or two) why this place is kinda famous... The main one? Their po-boys re","useful":2,"cool":2},"hsbmm8xFVC1gnF5QVXqgTQ":{"text":"Will definitely go back the next time we are in New Orleans.  The service was amazing and ","useful":0,"cool":0},"G6wYNcomo8VnSNebC2t9Rw":{"text":"First resteraunt tried in New Orleans. Taste does not disappoint. Fresh bread apparently d","useful":0,"cool":0},"U-vT0RkAwQUT6Xh-vcBOjg":{"text":"Located in the heart of the French Quarter. I had the jambalaya which was very good. Not s","useful":0,"cool":0},"rAcb7vJQpPbX7HS3D4adzA":{"text":"While the food was cheap and the menu was filled with options, the Po' Boys I ate sadly ha","useful":0,"cool":0},"JSJq_OzRHMkg3FDTzHciVw":{"text":"Service was super slow. We had a total of 4in our party and it took about an hour and a ha","useful":1,"cool":1},"WKH2-FBbCVYB_zqzSYjV3A":{"text":"I first checked Yelp to find the \"best Po-boy\" in NOLA, then I asked the locals. Everythin","useful":2,"cool":2},"6sQBI0U8UGXskK3y3XrONg":{"text":"Everything is great...one tip though, grab a table before you order food!","useful":0,"cool":0},"xr3jcfef8TmTcFwdM91nmg":{"text":"Best muffalata ever!  The cheese and meat were delicious and high quality. The olive dress","useful":0,"cool":0},"ww33VhuPzpzwxRDpmcYOuA":{"text":"We heard about this place while on a tour of the French Quarter.  It was really busy, but ","useful":0,"cool":0},"uqQ8Db-tpVzi5a7y_EsJXg":{"text":"A neighborhood jem. Not pretentious catered to tourist from New York like me. Simply food.","useful":0,"cool":0},"waenhZhOIorthMtiNaw54w":{"text":"this place is super awesome. the employees are all extremely friendly and helpful!! i'm ve","useful":0,"cool":1},"1C9_k45rZLwfJ5VuuyEDYA":{"text":"Pretty good, although they get a downgrade for a subpar veal parm po boy and small shrimps","useful":1,"cool":2},"1HHw7tWXKDMqBwKK6UwCbg":{"text":"The Quick: wow this place is good! Often times you can avoid the line. The catfish fully '","useful":10,"cool":6},"Yr0Uzz3XiZl4jGzkzRxAHg":{"text":"Still the best Roast Beef PoBoy In NOLA.  A must visit every time I come to The city. If y","useful":0,"cool":0},"50MXnJ-ihPQ2fMYp8E8xsA":{"text":"Deep fried pancakes smothered in canned fruit topping and loads of canned whipped cream. G","useful":8,"cool":5},"MhTQSbobdaWdNRlSb8JOGA":{"text":"OH MY LAWDDDDD. Johnny's brings me so much joy it's unreal. My family came here a few year","useful":3,"cool":0},"exQf1GrQCN6sk6V0qZW5fA":{"text":"Pretty good place to get Po boys. I had the shrimp Po boy as well as the buffalo shrimp Po","useful":1,"cool":0},"HwFZ1G8lIaS6CP35RDIzuQ":{"text":"This is coming from an out-of-towner, but my sandwich was absolutely delicious. Recommend ","useful":0,"cool":0},"0xiQ6gYAu5IEtTgUckmGpw":{"text":"Their biscuits are worth the airfare from Dallas!  I had the sausage egg and cheese biscui","useful":0,"cool":0},"FNPUI56faJeR1ir1YmVszw":{"text":"Went for breakfast. I ordered the pancake breakfast. Biggest complaint: the food was cold ","useful":0,"cool":0},"tJFBSXjNYkzKo2P6VQn8zA":{"text":"My friends and I came in because so many people we knew said we \"couldn't leave New Orlean","useful":1,"cool":0},"LLvM0NnYdnFiEauLpq6z2Q":{"text":"The PoBoys are to DIE FOR!!! Still the only place in town that I can find a fried crawfish","useful":0,"cool":0},"Xu-HJzn_KsY3n8aJy7aRWg":{"text":"Believe the hype! This place is delicious! I enjoyed the shrimp Po-Boy and the alligator s","useful":1,"cool":0},"a2BzkITt_y0ZztSt0JWrug":{"text":"Rude staff, great food, unclean tables. I guess I didn't follow the proper structure of a ","useful":1,"cool":0},"psnLkkW3rwUwRLjz8IXiwQ":{"text":"Cash only, worth the wait.  I had the surf and turf, fully dressed.  Second time going, gr","useful":0,"cool":0},"hxVaHjLHDO_JX-jKM3zqdw":{"text":"This CAN NOT be NOLA's best! Bread harder than Great Depression, Gumbo watered down, like ","useful":0,"cool":0},"Ih_RjPr4s73R3byMJ4ZLtw":{"text":"I split half of whatever my dining companion chose - of course he chose the meatiest optio","useful":1,"cool":0},"OjgrIO1Wc2k9vDZ59pp-EQ":{"text":"We came here on Sunday afternoon at around 1. It was pretty crowded. We were lucky enough ","useful":0,"cool":0},"zEpJnsiiLprcn8TgQABbIA":{"text":"What to get: \n- alligator sausage poboy (peppery, a little spice, sour from the pickle)\n- ","useful":0,"cool":0},"gYXizg85aXvaEbb0waTSbQ":{"text":"We stopped in at Johnnys for lunch and it was pretty slammed. Their reputation in Nola def","useful":1,"cool":1},"mTVn8QXpquPQzdNiLwM_WQ":{"text":"This was recommended by a local. Had a long line but it moved pretty fast. Ordered a crawf","useful":1,"cool":1},"aaYkF8Yq3EVpxLbGEA8Rcg":{"text":"I was here because:\n1. I was curious of the word \"po-boy\".\n2. Recommends about it on yelp ","useful":0,"cool":0},"B9CL2alCfsu86ttZ9FN14g":{"text":"One of my favorite po boy places in Nola. We shared the fried shrimp and Boudin balls for ","useful":4,"cool":5},"RHS3QUhgfKMQr0nxHBP-PA":{"text":"Best Po-Boys ever! I knew Johnny from living in the French quarter and eating there regula","useful":0,"cool":0},"LtAlUXKOfWXreV0D0FmiYA":{"text":"Had lunch here on the second day of a trip to NOLA and the line went aaaaaaaall the way ou","useful":2,"cool":2},"m2IfxFl8RnElgbzszMDxkw":{"text":"Food was delicious!  We were told this is a staple in NOLA and had to try it.  My husband ","useful":0,"cool":0},"o0F0FmdHHGzalCwP2pbjfg":{"text":"We were told by bus driver that this is best po-boy in New Orleans. I recommen not getting","useful":0,"cool":0},"jaeapubdVR3KWJZmJCth5A":{"text":"Asked the doorman at hotel montelione.  Where do you go for lunch.  Said Johnny's.  It's o","useful":0,"cool":0},"kFRp-hw89pJr3zXpm_36vw":{"text":"BEWARE this hole-in-the-wall won't spend the 20 bucks a month to maintain a cheap website ","useful":0,"cool":0},"HzouN3Ey0xuSanZLoeEMNg":{"text":"I have had good po-boys, but I didn't get one here. \n\n97% of the business appears to be un","useful":1,"cool":0},"mq6kcVNuuQJFcgjsEOREcA":{"text":"This place was recommended to me by a local, so I was very excited to try this place. Howe","useful":1,"cool":1},"I86dzs1zp9_DTQWrtYyPeg":{"text":"Came to this place because I saw it on the travel channel. The po boy was very good. I got","useful":1,"cool":1},"bT8tZHAVMeY4wLko-vbN3Q":{"text":"Restaurant was cramped, loud and the tables were dirty. That being said the roast beef po-","useful":0,"cool":0},"s1ClwWD2fveAMjI8AbZ_vw":{"text":"Ok, so we ate here at least twice on a long weekend in NOLA despite the plethora of restau","useful":1,"cool":0},"6r6zeCivNcky-PO7ejCZPw":{"text":"I had the beef and it was tasty albeit messy.  Roll up as crunchy on the outside and soft ","useful":0,"cool":0},"pPh3BFXRjhtumIm3nGAy9g":{"text":"The hotel recommended Johnny's for breakfast which we hadn't considered. At 8:15 they were","useful":0,"cool":0},"zwMHnK0RIKZ4-ANbKUW5RQ":{"text":"Let me get straight to the point. \n\nFood - Stick to the po-boys. That's what they are know","useful":0,"cool":0},"Rwgq9kYuOcxt0PkGdU953g":{"text":"I rec The Judge Bosetta. A patty made of hamburger, pork and Italian sausage. The only pla","useful":0,"cool":0},"ED_xFBu0KcbUIHbCGpXu6A":{"text":"1/2 oyster & 1/2 shrimp PoBoy...didn't even make it to the plane it was so good and so fre","useful":0,"cool":1},"Q0z_JSPze6uGL7SS83J34w":{"text":"Had fried crawfish and shrimp poboy.  Can't get this anywhere and it taste better on the s","useful":1,"cool":0},"Pa2lLrCcNueAkUUGQUWv3g":{"text":"The sandwich was good but Po Boys are overrated. I had the volcano shrimp Po Boy. It had r","useful":0,"cool":0},"zlLOHxDaHn2EpMdm29bOQg":{"text":"Not a fancy or extravagant place by any means but it's an adequate place to grab a quick b","useful":4,"cool":4},"pzHw8lBw2eWsZ8LpAx-7Ag":{"text":"Very interesting little New Orleans restaurant! Great muffeltta's! Large menu with lots of","useful":1,"cool":0},"xYVxja-ek7m_48OjIEPdig":{"text":"First time in New Orleans yes weird right but as my first trip (not my last) I wanted a lo","useful":0,"cool":0},"8FQDGqyFdYUHfhiTW5edqw":{"text":"This was the first place I ate in NOLA and the Po boys here are decent but not as good as ","useful":0,"cool":0},"UP47hxwPMI4aCG53gyccYg":{"text":"You better come hungry or bring a friend because they aren't fooling around! I ordered hal","useful":1,"cool":1},"401fv5UyFzaLuV3PimE8fg":{"text":"We got the Johnny's special, fried chicken club, and the hushpuppies. The fried chicken cl","useful":1,"cool":1},"i8Axj8V1-AMh6riW_CY33w":{"text":"ordered their shrimp poboy,  beef poboy and jambalaya.\n\nshrimp poboy,  YESSSSS! shrimp is ","useful":0,"cool":2},"_l4DzC2r3kTlT1AvK6UZgQ":{"text":"On previous trips to New Orleans, I've seen the lines that form in and around Johnny's Po ","useful":2,"cool":2},"VWEzgJc_ce7UxLFBwnxi5g":{"text":"Johnny's has the best po-boys in the French Quarter. \n\nFor years I've heard locals and tou","useful":9,"cool":4},"HUFA5DIyu9xvWHimzqmKxg":{"text":"Did our own food tour through New Orleans. Had lunch here and what a lunch it was... shrim","useful":0,"cool":0},"JWe7HKy4RpOBRHR0e8Vx8w":{"text":"We were looking for a Po Boy's shop to eat some signature New Orleans po boys that people ","useful":2,"cool":2},"_8R6MYxVCb-U7mNzmAbHMw":{"text":"We stopped in to get an authentic New Orleans po-boy way just hours before we were headed ","useful":3,"cool":2},"neij31nPMZCwopHm-goSpg":{"text":"My only complaint about this place is how small the restaurant is specifically because it ","useful":0,"cool":0},"5KWKh-A8W1JhDQXFEywrpw":{"text":"Po boys were good, definitely a hole in the wall. Gumbo was tasty and prices were reasonab","useful":0,"cool":0},"lv0l9HSsJvFnqj9iBFNXjg":{"text":"I loved this place! I was going to new orleans for the first time and was excited to try P","useful":0,"cool":0},"j-1nzZl5lnKpcqQj6aECSQ":{"text":"High Expectations and again, another disappointment.\n\nWe ordered a fried oyster po-boy, cr","useful":2,"cool":2},"wzmPjiStDwq6I9xzKHS5KA":{"text":"Literally ate here 3x over the course of two days! By the third time I even managed to mak","useful":0,"cool":2},"8gyWIWHc6aAdkxRIv5Q5KQ":{"text":"This place is just an institution in the French quarter for po boys. The menu is extensive","useful":20,"cool":13},"YKJED8E9VxaSTtkL23HmcA":{"text":"I wanted to like this place and I think I just like my roast beef Po-Boys with shredded be","useful":1,"cool":1},"cp3TZchR63FXsPaD-ls9Hw":{"text":"This sandwich shop is a must for French Quarter shoppers. The food is great, the portions ","useful":0,"cool":0},"zor0iXDxWx7lN6xy0WpYIA":{"text":"Po-boys on Liedenheimer French bread, oh my weeping tongue!\nCrispy fried shrimp, or roast ","useful":0,"cool":0},"v7Dn6GjbgIK9mYMxtOJD7A":{"text":"Good poboys but shrimps are very small and not deveined. At $13 per sandwich, I expect mor","useful":0,"cool":0},"3vZRi4UPPgHejVb1iMtmwg":{"text":"Per Yelp, it's the \"IT\" poboy place in the French Quarter. Once again, Yelp wins the Inter","useful":3,"cool":3},"5LtXe_28vxu7S2sXSsoy1g":{"text":"Recently on (01/01/2019) I went to Johnny's Po Boys. We went in on the recommendation that","useful":12,"cool":10},"orPtPb-iZoLmj6CYrwIL1g":{"text":"5 star for an all star poboy!\n\nwas here with my partner in feb.  we went by reccomendation","useful":0,"cool":0},"GVEzEHcUUKGRyoA_sU1OCA":{"text":"My cousin recommended that we try Johnny's for the shrimp po-boy.  Man he was right.  It w","useful":0,"cool":0},"XJZyVWuatU-zEPXnH6lmow":{"text":"We LOVED this place! A bit crowded which only means the food is GREAT!  We had the country","useful":0,"cool":0},"Fzd6SUVQ8FojZp6gaTJ7DQ":{"text":"This place was one of the recommended places to get some Louisiana po-boys in the French Q","useful":0,"cool":0},"-xBKQDHKTwQGi7oMO1iSZg":{"text":"I tried Johnny's on a friend's recommendation. Ordered the surf and turf- roast beef and f","useful":0,"cool":0},"v1h4W-n4OF5TKJQ_By36ew":{"text":"I wasn't a fan of this place. We ran into this place and I wanted to introduce my sisters ","useful":0,"cool":0},"oXtyKkSCEJEuOUQp7Jl5_Q":{"text":"Went here with a group of friends and unfortunately we saw a couple of roaches in the back","useful":0,"cool":0},"_6eryg9gNv9llnFb-hyfqA":{"text":"When in New Orleans, one must try Po-Boys!  Depending on who you ask, there is always an o","useful":10,"cool":8},"92amq221Bheu38_PQ3sPoQ":{"text":"dispite the other glorious reviews, i was disappointed by johnnys. was my huge shrimp pobo","useful":10,"cool":5},"8uh8Z8ct7L8du3CL4RjDNg":{"text":"We ordered two combos- one with cat fish and one with shrimp- each costs $12.50. The quali","useful":3,"cool":3},"Ctzvaom4mkMwB7E1vRxjaw":{"text":"Was recommended to eat here by a local tour guide and it did not disappoint! We had a comb","useful":0,"cool":0},"rSJ1AitC09l_daA2voKYbg":{"text":"Where y'at?! This place is grrrreat! My pal Big Mike and I threw down here. It does what i","useful":7,"cool":4},"wEbK8qAX8JIeAQSqGM_Hjg":{"text":"Easily the best poboy I've EVER had!! Forget all the fancy upscale restaurants, they can't","useful":2,"cool":0},"1B_54ChJ_l_a1LaZ-gGJNA":{"text":"Small spot CASH ONLY!!! Great spot to eat, when you order everything is made on the spot s","useful":0,"cool":0},"j6chLFlsK78bC2mqD-XSBw":{"text":"Walked by this place many times before and always saw that it was packed inside.  Today we","useful":0,"cool":0},"KkkXogBuWCGt7z_mi-lpWQ":{"text":"We discovered this place on our way out of town and I can believe we missed coming here al","useful":0,"cool":0},"Nl24xNWTiMWaFY5TEy5liQ":{"text":"Heard about this place on our tour. The location is small but the staff was friendly. The ","useful":0,"cool":0},"EHJNht4yaFt7Bs_v-aA1ZQ":{"text":"If anything can invoke the tradition of the long-departed Uglesich's it is Johnny's Po-Boy","useful":0,"cool":0},"WlS7Sd8wPjwNBkvEyajqMA":{"text":"PO-BOYS\n\nHuge variety of po-boys! Long line for ordering. Long wait for pick-up. But total","useful":5,"cool":6},"Ndt1V-s5lBURp3DDXBKibg":{"text":"Used to be great...it's gone way downhill.  Bread is dry, quality average.  You could get ","useful":0,"cool":0},"YI8fjl_xwbbHJ0AT-RxDcQ":{"text":"All I can say is the po-boy is amazing!!!  We was walking by and decided to stop in. I lov","useful":0,"cool":0},"QZyp3U66RDmyf1TgzDkQoA":{"text":"Eh!  I can just say very over-rated.  Had the shrimp po boy and I could of made better wit","useful":0,"cool":0},"9F8utelchOVY74LaBr9JYA":{"text":"Food is so good and cheap. Found out about the place from a local who directed us there af","useful":0,"cool":0},"AuKbzgdUrMjfwK337mquQQ":{"text":"They all good roast beef best  oysters ok \nMandenias Betta \nEasy location \nHappy to see th","useful":0,"cool":0},"ngp3SoAoQ9vyJHu4VA7YZg":{"text":"I stumbled upon this place walking around the French Qtr and I am glad I did!  It is cash ","useful":1,"cool":1},"TocslUH_AHoEwG0-wQtSnA":{"text":"Excellent roast beef po boy.  Will remain on my list for po boy go to places.  The service","useful":0,"cool":0},"Zejy4KJtrDp1E3NBfAFcZg":{"text":"Small place. Cash only. Service was good with the exception of one female employee that sh","useful":1,"cool":1},"N3DQ3tjb60JtBQqZGclmqA":{"text":"neanderthal go to johnny po boy. order half and half combo, with half po boy of aligator s","useful":4,"cool":2},"WzlThhkvQZilX3WPFTM94Q":{"text":"Must visit spot for what exemplifies New Orlenean po boys, there are lots of options, seat","useful":0,"cool":0},"3IGhhasq-p-9baBGRe97eg":{"text":"You can't order the wrong thing here! Delicious! The catfish is great. Love the Leidenheim","useful":0,"cool":0},"jAvlmzT3kNN6gzjiN2e5EQ":{"text":"Every time my boyfriend and I visit New Orleans (which has been once a year for the last 6","useful":0,"cool":0},"rjZU9RTpcpwd7nnyY4_Ucg":{"text":"Just straight up AWESOME!!! So authentic! Oysters and muffalatta were excellent! True New ","useful":0,"cool":0},"GP76qDJRl_BRrsYf-I78BA":{"text":"Loved this place !  Bayou breakfast- eggs. Shrimp and grits hush puppies and alligator sau","useful":0,"cool":0},"ecV5qBc9CRjONDO-mAMM7Q":{"text":"Look, my friend and I wanted shrimp and grits on our last morning in New Orleans. I'm sad ","useful":0,"cool":0},"Zw5n0dRWPOBK3xQeDeDrWQ":{"text":"I didn't find Johnny's to be worth the hype. It was just ok to me. The restaurant is small","useful":0,"cool":1},"VZ5GETZQ2WJq7mZpEJIabg":{"text":"The item that I tried during my NOLA vacation was the shrimp po boy sandwich. It was very ","useful":1,"cool":2},"PlObiSa2r5FrNSjm08oNug":{"text":"The place is filthy the po boys are lousy don't waste your money. We had the chicken fried","useful":0,"cool":0},"clAGhhIEvEm5GQjPkUb1nw":{"text":"Wow!!! Might be a hole in the wall, but the most amazing Po-Boys you will taste. Note to s","useful":0,"cool":0},"vSphDbOT-rLd83gxAgKoYw":{"text":"Johnny's was recommended to me by a few locals, and I could see why by the line stretching","useful":0,"cool":0},"L_7qNs3tzHJjHbFFKWlPow":{"text":"I went and found myself a boy; a po'boy named Johnny.\n\nThe po'boy tastes so good when he's","useful":7,"cool":7},"DAJPMmS-wuHD26mNoNg1JA":{"text":"1/11/2021\nDuring our very recent trip to NOLA, Johnny's was by far our favorite part. My w","useful":0,"cool":0},"GYnDXEV62rpcvDEMtZxkKQ":{"text":"Johnny's has the best po boys I've ever had! The bread and shrimp was fresh. I wasn't sure","useful":0,"cool":0},"0QIqfFJBwoht4yvCKZrp6g":{"text":"If you are in town and you didn't stop here, buy a plane ticket back because you missed th","useful":1,"cool":1},"OVYApM4OAnX2f0Je7dl2jA":{"text":"Holy Po'Boy!!! These mamajamahs are Huge! Johnny's does not mess around. I've had a lot of","useful":6,"cool":2},"XLWjugFmKEK7Fj8hq3xuQQ":{"text":"Great po boys or Louisiana sub! It's cash only but you can tell they recently raised the p","useful":1,"cool":0},"bsndptBLuPWbDGSotzXwtw":{"text":"So, the last time I was in New Orleans (about 3yrs ago) I heard, through the grapevine, th","useful":14,"cool":14},"lvJbc31wxiui_XOw0ryJVA":{"text":"Don't pass by this little hole in the wall spot!  Johnny's is a must for Po Boys when in N","useful":1,"cool":0},"7gmHQDtBJpP0kDRtpkvTgg":{"text":"Great po boys but not better than Parisols.   Get there early.","useful":0,"cool":0},"6wJdx-XNrYtb7T34c1QISA":{"text":"This food was amazing! I split a shrimp Po-Boy with my son and also had an order of boudin","useful":0,"cool":0},"XAZ5Yte23zK63gKKtc8SIQ":{"text":"We had a list of must try foods for New Orleans and Po boys were one of them. We heard mix","useful":5,"cool":3},"DX4PdtgQVVJp0eEszbsKgg":{"text":"Keep in mind that this is one of those places that you do not come to for the ambiance or ","useful":3,"cool":0},"5kwYetmzg7bfHcr6sX4-mQ":{"text":"I thought this was voted best po-boy in New Orleans at one time and had high reviews. Seem","useful":2,"cool":0},"3jirveqDbIT2rvwuMqrSQw":{"text":"STALE BREAD! How can a po-boy place serve stale bread? Worst muffaletta I have ever had. M","useful":0,"cool":0},"fPKm5Nbv3b9aKtFhM8UF-g":{"text":"This is such an amazing place and the staff is super friendly! I will definitely come here","useful":0,"cool":0},"Qw1W3FEPxOVW_FIQr6HPew":{"text":"Our first stop in New Orleans for some po-boys.  It was very busy inside so we waited in l","useful":0,"cool":0},"L4jP2U8PDfkOWfaZSVRAJA":{"text":"Not just Po-Boys... Great breakfast spot!! The best biscuits I've had in years! My favorit","useful":2,"cool":0},"23hWr0TDKRc65VAHKkZLSg":{"text":"Great local food. Lots of variety! From simple egg, ham & biscuit to Bayou Breakfast with ","useful":0,"cool":0},"fMZeweKIQd0RSgUvJYbfkg":{"text":"piss poor customer service and lack of responsible management.  will never visit there aga","useful":0,"cool":0},"pIkriK-bqx8zwqtuhvhRsQ":{"text":"Portions are big! Have cash! Place is packed, but there is seating in the back. My girls l","useful":0,"cool":0},"YjTaOADc1Yq0hQUImhJmlQ":{"text":"Had their shrimp poboy combo. It was not worth waiting in long line for. There are so many","useful":0,"cool":0},"jCtizEUsT_-yD2rlKxGQaA":{"text":"Yep it's going to be packed, don't worry the line moves quickly. You order from the back, ","useful":3,"cool":1},"dCdZCJOqhRun05LQdL1GUg":{"text":"So I wanted to try an authentic Po-Boy and I was a bit disappointed. First of all the shri","useful":1,"cool":1},"I0jwvlszNZrKWluPN1a4Mg":{"text":"I had the shrimp/roast beef/oyster po' boy.....\n\nIt's one of the better known spots in the","useful":0,"cool":0},"I0n-XpJZxt_z_fi5_stIAg":{"text":"For a Po-Boy joint, I expected better bread on my Po-Boy.\n\nI made Johnny's one of my stops","useful":0,"cool":0},"zZsH9jb1cLiCbC-7xE-9mQ":{"text":"Great disappointment with our visit to Johnny's.  We ordered the roast beef poboy. The san","useful":2,"cool":0},"YVOeFmwWdZe1yLQUNhIWkg":{"text":"Fresh Oysters and Shrimp dressed.... nuff said.\n\n  There is nothing more that I can say th","useful":0,"cool":1},"xJW5Epz4Wf-PyLUPjga_GQ":{"text":"I got the breakfast biscuit - wow, that was a huge biscuit: sausage, egg and cheese.  Had ","useful":0,"cool":0},"kCN-Vluw7OXgR-4AY1-nXA":{"text":"Started visiting on my first trip in 1998. Even better after game day. The line can be lon","useful":0,"cool":0},"5RXQrb_Z_xSl0-y2CImh3A":{"text":"Without a doubt the best po boy's in New Orleans. Extremely nice staff, the manager is ext","useful":0,"cool":0},"YDoCg5yvoaUkRBLcwgJidA":{"text":"Just made my 50th+ visit to NOLA and you know I had to drop in for my po-boy lunch at John","useful":2,"cool":2},"-iqxE6eSVS-7-IHDbA5krQ":{"text":"The po boys here are huge, enough to fill up a big guy.  The crawdad po boy was amazing.  ","useful":0,"cool":0},"VfhnlXoO5OE9aGWDyFNaBA":{"text":"Cheap but super tasty po' boys, and it was just around the corner from my hotel. It's a ho","useful":11,"cool":10},"riogM6e5FJIlEEVzbJ4D4w":{"text":"My mother does this thing every year I like to call \"Make Suzanne earn her 'favorite daugh","useful":3,"cool":2},"xa8LOOnMty_x6bYsLwzvNg":{"text":"Ok so what a very busy little place, but service is nice and friendly, and quick.  I had 1","useful":0,"cool":0},"V9NVK6w4mWmcSbH3epRAsw":{"text":"Came in for their famous roast beef poboy. The roast beef is tender, juicy and packed with","useful":0,"cool":1},"koqMODybX_JbU-fQvIiaNg":{"text":"We ordered 1 sandwich with 1/2 shrimp and 1/2 soft shell crab poboy, and it was amazing. B","useful":2,"cool":0},"jAuLx-sL1DVq0NO6F2nG8g":{"text":"I had high expectations based on recommendations for Johnny's. I am by far no po-boy afici","useful":0,"cool":0},"fs3auuGFW1PD5_7eRyaeiA":{"text":"Delicious shrimp poboys! I got the half shrimp po'boy (still very big!) With the cup of gu","useful":2,"cool":1},"Gr6JW5K4qM2StmJvlhjpPw":{"text":"Super long line but worth the wait .. I found this place on trip advisors .. apparently it","useful":10,"cool":9},"1wiHw9kEdg_7SvW7s5ogow":{"text":"Best Po Boy I ever had. Long wait in line to attest, though. Gumbo is really good, too. Th","useful":0,"cool":0},"rtwSaOztdyOL2NpT8zEKxg":{"text":"No anything like Mothers and it takes three times as long. Literally fourty five minutes d","useful":1,"cool":0},"hvSFYSG8WKfPVaPYu8hd6g":{"text":"BEST PO BOYS in town. Definitely worth a visit. It has a shabby look but it is really real","useful":0,"cool":0},"yr4smW9yB0Qh06e3qtZaUQ":{"text":"Johnny's was recommend by a few people in the area for a good shrimp po boy. I was able to","useful":5,"cool":2},"btGsM5irU2XWW1JjGAkRAg":{"text":"I got the crawfish and the soft shell crab poboys, and of course, dressed. The bread is no","useful":1,"cool":0},"X9d-EpHWAddNjKQOiJpo3g":{"text":"The best, most authentic poboys in Nola. These guys have been a family business for years,","useful":1,"cool":1},"m_Sj8kkV2DP4gC3_O5HUZA":{"text":"Johnny's is great. We were recommended to several other Po'boy shops, but decided on Johnn","useful":26,"cool":25},"byjonpE2bjOnYFNJ4DlHLQ":{"text":"Had the roast beef po-boy.  My oh my was it good.  Nothing fancy here, just great food.  S","useful":0,"cool":0},"L5JDvi1r8vA7tv8dBLfzRA":{"text":"Got the roast beef po' boy - fully dressed (lettuce, tomato, Mayo, and pickle). It was out","useful":0,"cool":1},"e5sPLcFUSI4YKhRjmfzzCQ":{"text":"I had to stop in for a quintessential poboy while in Nola. Their menu offers a huge select","useful":5,"cool":3},"TrVFMa_lZyTa5YQFoflqkg":{"text":"While not my favorite place to grab a po-boy, this place definitely hits the spot.  It's n","useful":1,"cool":0},"IalFPtZUF37a3OrUkuiyfA":{"text":"First po'boy of the season was accidentally here. Went with the classic roast beef and it ","useful":0,"cool":0},"j6b49Oq3cUyWdCANaxyelQ":{"text":"One thing to expect for sure is the fact that seating is extremely limited. The staff is o","useful":3,"cool":1},"QQ2vV3ueaJQPkjCsXz8Rag":{"text":"Every time I come to New Orleans I come to Johnny's. It's a small place with some tables o","useful":1,"cool":1},"ZFBQ66qZ_bYebFH_REYJiA":{"text":"My favorite Po Boy I had in New Orleans. It was simple but perfect. The service was great,","useful":0,"cool":0},"imiFfoPKT8S35aWfEe693g":{"text":"I told a friend 7 years ago that I never had a po'boy. He being from Louisiana made me pro","useful":1,"cool":1},"88mGcOuF1N54AMKuQX19Gg":{"text":"Only your imagination limits what can be placed between the tasty French bread roll. \n\nWe ","useful":6,"cool":6}}