{"WbWeR2aiUg8iItoLpsFRgA":{"text":"I had heard many great things about Up & Adam, so I decided to come and check it out for m","useful":0,"cool":0},"rbaGZCG8FJqc2tPCrVKbKw":{"text":"Sorry for taking to so long to get to this spot. Open since July. \nFood parking \nCatfish n","useful":0,"cool":1},"WOPykN4p7FaC2Sr8ToLu0w":{"text":"I wanted to try Up&Adam right around the corner in our beloved Mid City. There are few pla","useful":0,"cool":0},"5DAnBiIo91KixWkYompsiQ":{"text":"Loved it!! Delicious food!! Nice atmosphere. Nice place for a date or brunch with friends!","useful":0,"cool":0},"XERiojB1atgewwXGWoeI_g":{"text":"Okay, this place is amazing! I had the Hollygrove chicken biscuit, it's pretty filling, bu","useful":0,"cool":0},"aKz7u_BsQrkes8YZNjGZ2w":{"text":"I've been here twice now. The first time was early afternoon. Brunch crowd had died down. ","useful":1,"cool":0},"lLmLiZhQEZSX6eMG__jHiw":{"text":"The food is absolutely amazing and the chef is very accommodating. However, don't come if ","useful":0,"cool":0},"LI20C1Th1mzPfEgRV4-evQ":{"text":"Great place anytime of the day\nWonderful atmosphere \nI suggest sitting outside if it's a b","useful":1,"cool":0},"ZnQIo4ybb7BehNO2dWwYiw":{"text":"Very good, I will return. The place is a vibe only complaint I have is the music can be a ","useful":1,"cool":2},"d22Z9wx2Tc9OtCVHymsqyQ":{"text":"I'd heard this was a spot to try, being a new establishment and black owned.  I was very e","useful":0,"cool":0},"cCOCX2uvaDVOnFfBmUV9RA":{"text":"Delicious!  I stopped by for the first time today and had shrimp & grits with seriously th","useful":0,"cool":0},"T-prcqhJDYK-P91a28NMdw":{"text":"Up & Adam Eatz is a cute new restaurant in New Orleans, Louisiana. The service and food we","useful":0,"cool":0},"_3VXnT6jvpmsdDq1-LJaWw":{"text":"Breakfast was served for the two of us. Mine was just fine. unfortunately, my friend's was","useful":2,"cool":0},"xOjaX6iMb8PfDWa4JbW8RA":{"text":"The food was delicious. The service was amazing. The vibes were perfect. This is one of my","useful":0,"cool":0},"PM0oA6eBDYYiRsCAfJic6w":{"text":"Great ambiance, food was very good. The music was great! Only drawback was that there only","useful":0,"cool":0},"SZlaRYf1pp2M31RkfZckOg":{"text":"Great spot for great food and service. Try the Catfish and Grits its the best I've ever ea","useful":1,"cool":1},"l6xFwZw4F-l4bzwPKA7rJw":{"text":"Ok, this is one the best kept secrets,  but NO longer. Up & Adam is a WONDERFUL ADDITION T","useful":2,"cool":0},"hRLBt7jNzfQfAXjp-L80yA":{"text":"Excellent service, brought my dog with us for breakfast. Super cute spot, bring your vacci","useful":0,"cool":0},"8iILeFBEoIpTT_WDzazXJQ":{"text":"The Tchoupitoulas Omelette and Gouda grits are simply Amazing! I am a savory grit person s","useful":0,"cool":0},"-fOZuCwTsX73zdT1oqmUgA":{"text":"I got an omelet.  It was extremely tasty, yet very greasy / oily. It was a good sized serv","useful":0,"cool":0},"3oHHoQxtnHJUO84Y_4xyHg":{"text":"I always try grits as the measure of a breakfast eatery.....These were perfect. The Shrimp","useful":1,"cool":1},"hqAuVKAaX1bsm_ltMoY3Rw":{"text":"Awesome waitsatff!  Delicious, speciallty omelets for breakfast options. Up & Adam Brand C","useful":0,"cool":0},"6oo5f0NoXbcAyOR9nTp4HA":{"text":"I had the absolute best experience. I truly enjoyed my order, the service and the loving a","useful":0,"cool":0},"Bymba4NRnEZ1tDAfCxnHZA":{"text":"This place is so homey and welcoming. I had the stuffed waffles and when I tell you I've n","useful":0,"cool":0},"CJ180f9jLZoF9NdoqRU2Bw":{"text":"IMMACULATE, AMAZING, ENJOYABLE, TASTEFUL and would recommend to anyone in the Greater New ","useful":6,"cool":2},"q268ly6j9-lAGojYk-0eCQ":{"text":"Quiet and timely for a random Friday morning. The building is an old creole townhouse turn","useful":0,"cool":1},"EjWEZiPcWRdRRqbUg2s9vg":{"text":"Wow! That was the best Shrimp n Grits I've ever had, and I've eaten plenty. The grits were","useful":0,"cool":0},"jzEXirTX9pxu4uMJCCnRCQ":{"text":"Bad customer service, slow service. Good incorrect x4 times payed full price without hesit","useful":1,"cool":0},"KaKrQ--pUfwGpMUYiSZUCw":{"text":"I invited some girlfriends to brunch during Bayou Classic Weekend, and everything was AMAZ","useful":0,"cool":0},"ZkCuZz4QYuvv5y-4hxfFJw":{"text":"Extremely over priced for the quality of food. I'm a local and this is at the bottom of my","useful":0,"cool":0},"qQOtW3qz5gKzrpSRo9wUkA":{"text":"This was the BEST breakfast we had while visiting New Orleans. Our Airbnb was close to thi","useful":1,"cool":0},"nr-SnanU-w9jnNmtPYn5iQ":{"text":"Restaurant was nice and clean.  I ordered the Tchoupitoulas omelette with a biscuit.  The ","useful":0,"cool":0},"dVGDOnjtA0zKwPy5aShMEw":{"text":"Nice place. i have eaten there several times and i really enjoyed my food. biscuits are li","useful":0,"cool":0},"M1x3Omimfd5iefXpRb1_jw":{"text":"TAKE OUT REVIEW:\nOrdered takeout over the phone:\nAll that Jazz omelette ($18), roasted bre","useful":1,"cool":0},"-bxo2CK9C-5z86SNDKl4GQ":{"text":"Went here for brunch on a Sunday. They mainly operate on reservations. I didn't make a res","useful":9,"cool":8}}