{"lvByFvihpEbLx-qVdOKidg":{"text":"My boyfriend and I fell in love with Krystal's tiny burgers as soon as we took our first b","useful":2,"cool":2},"uaXGiGpo1FFuolXj1Lz2uw":{"text":"White Castle burgers are GOOD....Krystal burgers are NOT.\n\nSomeone used the phrase belly b","useful":1,"cool":1},"O4yE8ome8fFQ5ivlk4T08Q":{"text":"This is the only Krystal burger in the NOLA area (and maybe south Louisiana).  Because it'","useful":0,"cool":1},"dHvXlVazM78CFIvsB-ojYA":{"text":"OK so this place is basically a White Castle's knock off.  Mini burgers that slide down ni","useful":0,"cool":0},"r5_YIgsqL_zwaoD2nwYF_A":{"text":"Ok, I give Krystal a 4 star because it's kind of a unique little chain like White Castle o","useful":0,"cool":0},"bjHz2YklF4BVi2hS4yLnKw":{"text":"Had a fantastic breakfast this morning.  Sausage, Gravy, Biscuit, Eggs all in one bowl.   ","useful":0,"cool":0},"-KTC0-K3EnUMeePV3OwfSA":{"text":"I was very impressed on how very clean this restaurant is! Perfect for after drinks on bou","useful":0,"cool":0},"sEN8Ne0pn96sOv7349um8A":{"text":"It was ok. Hit the spot when I needed it to, just not a place I frequent. Decent food. I o","useful":0,"cool":0},"Tb5oShyk6wyrpE85ZvTNsA":{"text":"Chilli cheese burger and onion rings are on point. Definitely going to come back on my way","useful":0,"cool":0},"dVErGpvqawKnDcTtQgIF-w":{"text":"I know what you thinking , ...low end fast food in the middle  of \" live to eat city ?\" ye","useful":1,"cool":0},"EzwHdW77DCvk5NR_5Bs-fg":{"text":"Was somehow talked into coming here late night since it semi resembles a White Castle burg","useful":1,"cool":1},"6BZ_mIMRHp077VCaqqPEfg":{"text":"Do not go to this place sober.  I haven't done it, but I just can't imagine that it would ","useful":0,"cool":0},"Q8tgc1GUY3JkPqhOfQa--g":{"text":"Not a whole lot of food options during Mardi Gras at 3 am and Krystals  mini burgers hit t","useful":0,"cool":0},"Tt8V6oLsd95B7fQ4ohGM5g":{"text":"Quick? Nope.\nAmazingly delicious? Nope.\nOpen late? Yep. \nAwesome workers? Hell no.\nDelicio","useful":2,"cool":1},"YQfB0ubqSfuEBVkrLp3Okw":{"text":"If I could give no stars, I would.\n\nThis seemed perfect - a late night stop after being ou","useful":0,"cool":0},"H1JBIrqg72KvM65pKG01kA":{"text":"Being from Chicago we were in new Orleans so we had to get sliders from Krystal close to w","useful":0,"cool":0},"PUxXsguywR-z2hQtC0-xqw":{"text":"For what the place is, I think it's awesome.\n\nHarold and Kumar made me wonder how awesome ","useful":2,"cool":1},"IaZvT9k2wo69XmT0yKYe1g":{"text":"I'm no culinary prude and I can appreciate cheap n' greasy...but Krystal does not qualify ","useful":1,"cool":0},"17bcCrw9bPaUB5P_frlL5A":{"text":"Visiting New Orleans this weekend! This is what White Castle is supposed to be! God damn t","useful":1,"cool":0},"ngSZgimue8frnTNk30VzwA":{"text":"If I could give 0 stars, I would do that in a heartbeat. Worst customer service ever!!! I ","useful":1,"cool":0},"hoOBRtBGvQkotRXTthVtfw":{"text":"Granted I was drunk when I ate this but I enjoyed every minute. The burgers were just like","useful":0,"cool":0},"mIjOuTeJDKXYv1vmuI-o0w":{"text":"One of the grosses burgers I have ever had in my life. The meat did not look like meat it ","useful":0,"cool":0},"lhc80tPAP8MD_daIODQ5TA":{"text":"Great food for that long walk back to the hotel late at night.","useful":0,"cool":0},"9VDhUknwWTTsJDqRLISwiA":{"text":"This place is awesome. I opted for the chicken since I don't eat beef. The husband got the","useful":0,"cool":0},"l9eDJX59Dq53EkDWE-Hatw":{"text":"Like others say...it's very similar to White Castle. Checked this place out cause we wante","useful":0,"cool":0},"cA0ZFKS-GwJSRGoB31Dyfw":{"text":"Wow! Great little burgers and chicken.  Especially at 4 am.  The locals there gave the adv","useful":1,"cool":0},"mPYNIwrReJB7GCrnGfNbOg":{"text":"Krystal is pretty much the White Castle of Bourbon Street.  Krystal serves up little slyde","useful":0,"cool":0},"XlWnXiSZ05XSnnuL-OG2rw":{"text":"Chili Krystal beats any White Castle burger ANY DAY!!","useful":0,"cool":0},"MaNlmVnxb7POGidEwqMGiQ":{"text":"People are unbelievable. You get much more than what you pay for compared to most places. ","useful":0,"cool":1},"47ZvGt52wNbUpqysPp4Buw":{"text":"It's did actually get less than one star. The food was none edible. It actually smell like","useful":1,"cool":0},"D_CYiXaLZRWZgWcP3AlL7w":{"text":"Well, I only stopped here because people told me that this was New Orleans version of Whit","useful":0,"cool":1},"OPcolq-_9QCcSBXZr7D_DQ":{"text":"It's flithy but what do you expect from bourbon.  Get you some white castle style burgers ","useful":0,"cool":0},"jWJ1A5eLgqTsqq7UfijQEg":{"text":"Good ol' KRYSTAAAAAAL Burger has always been  the late night rescue for me when I'm in a d","useful":0,"cool":0},"xaLZyy3tgb4c1wDhGehNnA":{"text":"Krystal on bourbon. Same manager for years. Good stuff. The new cashier was having a tough","useful":0,"cool":0},"foYWXc_RZ0hHehDLrMkpGw":{"text":"I really don't get the hype with these slider fast food joints.  I've never been to a Whit","useful":0,"cool":0},"ehD1j2FOGSOLigvDJ4IiXQ":{"text":"Awesome place for sliders. Had for breakfast three days in a row here. Being from the nort","useful":0,"cool":0},"wEX7bEsLXYPI0eW7kaUcLg":{"text":"Late night hours but not quite White Castles but it will do when WC is not there. It gets ","useful":0,"cool":0},"o1mintlcKAQJEkKjxR24XQ":{"text":"Was in NOLA on a recent vacation and needed a quick bite in the morning around bourbon st ","useful":0,"cool":0},"ksdY7NcYnD_cSJvW7Dq-EQ":{"text":"This was the first Krystal I ever ate at. I had breakfast there. Was it memorable? Not rea","useful":1,"cool":1},"lUkFLL3gelxkk40w3upMcg":{"text":"I really liked it! Tried just one of the sliders. The meat doesn't look like fresh meat bu","useful":0,"cool":0},"gM3P4UwsgRAT35bK2tE5Ig":{"text":"Colossal ripoff.  Looking to try the \"sliders of the south\"?  You're better off holding ou","useful":0,"cool":0},"7HDQk7yOmd_Hpqsa0yrvfg":{"text":"A belly bomb, by any other name, is still a belly bomb.  That said, I'd have felt way wors","useful":1,"cool":0},"qUkpwivLaqOd8Dx8TJ_NNA":{"text":"Service was awesome again today. Food came out fast. They have the best chocolate shakes! ","useful":1,"cool":0},"pA2PVve8FtO3GEYtR9dWAA":{"text":"basic sliders. good for drunk, oblivious people late at night. clean space. \nyou may see a","useful":0,"cool":0},"uFDB03hNPTJ6Zo5aLRREdA":{"text":"Love this place. Quick and friendly. Great mini burgers and great chili cheese fries. Defi","useful":0,"cool":0},"xpc29gD6HycZQm9kcS1xPw":{"text":"Yes, 4 stars here people. So, safe to say I was here (twice) after a night (nights) on Bou","useful":0,"cool":0},"azw4UcaLm6lqvNphBGMVFw":{"text":"Well: it's a Krystal; kinda like a White Castle but Southern. \n\nHonestly, I've been to lot","useful":6,"cool":2},"gULXPYlqcKcDmGqGbnelpg":{"text":"If you're drunk this is a go to spot for a fast bite to eat.  The burgers are tiny but not","useful":0,"cool":0},"Nc6-B85gr1BiaMbxj6yocg":{"text":"First time trying I thought the burgers were too bready and didn't have much flavor. meh.","useful":0,"cool":0},"C9M1HyOZOzEZqJ7sCJjSxw":{"text":"Stopped in for a late lunch with the wife. Used to White Castle up north, so that was my b","useful":0,"cool":0},"SsmhDBR7ZemrIY1SyG0-0Q":{"text":"Brought the wife here for her first Krystal experience. We were lucky enough to get Robin ","useful":0,"cool":0},"nv2cQakdwQnXK5ZlJc5gRg":{"text":"I stumbled on this place around 10:30 on a Tuesday night. There was no lines, there was on","useful":0,"cool":0},"ZucKsWFMBjzLPOhCBJM1cg":{"text":"I was actually really excited to try this place out since I live in Las Vegas where we don","useful":0,"cool":0},"VziafFzFOYYw1koCKxGdOw":{"text":"I had never heard of Krystal until I visited NO. I ate here 3 days in a row (once buzzed, ","useful":0,"cool":0},"FTJQiQ4sE3XxSA34rkL-BQ":{"text":"It's like eating in a third world country. \nIt's painful watching how hard the employees t","useful":2,"cool":1},"f9geDSTJh9KSjcBU1EwOlQ":{"text":"Great burgers on Bourbon street for that late-night snack","useful":1,"cool":0},"ZncXktITXtire7gbCq7AMQ":{"text":"Combo #1 with sweet tea and fries for $5.81. Louisiana's white castle burgers","useful":0,"cool":1},"GbibppzqJmnGQ08EyD2I6Q":{"text":"Small place, but not cramped. A little more expensive than I'm used to. The food was on po","useful":0,"cool":0},"4lm9WCdLk7IqFbJBsLYk_g":{"text":"Perfect stop and grab for a late night, out having fun on Bourbon Street snack. A Krystal ","useful":0,"cool":0},"kSEe8uGFNASnxb05IypR-g":{"text":"i'm from NYC and we love our white castle and i have been south to chic-fil-a and krystals","useful":0,"cool":0},"FuvHBREnW60oVE3QsO22JQ":{"text":"when I got drunk in New Orleans at 2am this was the place I went to every time\nthe fried c","useful":1,"cool":0},"D6gUmQ66sMV2S7aT7iTOOA":{"text":"It's like the White Castle of the south.\n\nGreat drunk food. \n\nSmall burgers and chicken sa","useful":2,"cool":1},"E4OmXIYmf9pTfpyuQQ_D_Q":{"text":"I haven't been to Krystal  in such a long time.  I've never even seen a Krystal until we t","useful":1,"cool":1},"sMJNtl36bMj6_-q8GKPa5g":{"text":"About thirteen years ago, I was standing - well, swaying - in line at approximately drunk ","useful":0,"cool":1},"GaLBs3rdOFLBIr1gcP38lQ":{"text":"Nice place for a late-night snack!  The fries were fresh, the burgers were hot and tasty, ","useful":0,"cool":0},"ApliCyWNFNY5a75ti0YxCg":{"text":"Probably the best thing you could ask for after wandering Bourbon street for an entire nig","useful":1,"cool":0},"ZhM7YHG9p1NXF2STvlXhzg":{"text":"First, I'd like say I don't expect much from Krystal. I understand it's fast food, and not","useful":0,"cool":0},"Fn4AvxeLY5eC3nDtzBchXw":{"text":"Hello, New Orleans version of White Castle! If you like White Castle, and have a late nigh","useful":0,"cool":0},"-0Z7EfZurKw7lScKVOSdcA":{"text":"The White Castle of the South!  But even better?\n\nAs Carson taught me, getting wasted on B","useful":0,"cool":0},"fBbVBaBPpzviltI-nU923g":{"text":"The Krystal chain,is the south's version of White Castle.  It's fascinating to me that the","useful":0,"cool":0},"lXzuNVjN9GwvKfj9Cf1Ugw":{"text":"Stopped by for our last night in NOLA after clubbing. I rarely eat fast food hamburgers un","useful":0,"cool":0},"HTTmXbpRme9GW5H-NASBAw":{"text":"Pretty good place for a quick bite, we usually don't like chain restaurants but we were la","useful":0,"cool":0},"JYGNwEkGtxZ0eRIso32uBA":{"text":"Without a Doubt, The most HORRIBLE experience EVER!!!!!  The Most HATEFUL employees I've E","useful":1,"cool":0},"dh4Nkjvpot-Iy_-NPYtl4Q":{"text":"We often bring family and friends to NOLA for vacations. It never fails for a few of them ","useful":0,"cool":0},"LoT_qFPskoW2P7F9fLN5eQ":{"text":"Stopped in here after my first night on Bourban Street. It was actually pretty decent! I r","useful":0,"cool":0},"kxQvuWRIWcH0cnyrW0yzeQ":{"text":"Rude employees. No respect or courtesy given to customers. We will never go back when in t","useful":1,"cool":0},"LxVKCFNCm_uc7OdVPiZFzg":{"text":"I haven't had one of these in 15 years until last week. Thank you, Krystal on Bourbon Stre","useful":0,"cool":0},"4nTS2mwR3hMempp7wewSyg":{"text":"Drunk on bourbon ?? Don't come here .\nEven when completely plastered drunk my taste buds k","useful":0,"cool":0},"Dm1Zq6kQLzL0rHKVbjsclA":{"text":"(Note: this review is for night time/early morning, sober/daytime is one star. )\nAfter liv","useful":0,"cool":0},"bgiBz36lTEjFOJQ0_Mgt0w":{"text":"Yes, they are little burgers which are bad for your health. I'm pretty sure everything on ","useful":1,"cool":1},"1bCmFAJqGQM_8hvImofT-g":{"text":"What an f'ing ripoff!!! I'm for NY and I'm outraged that I had to pay $10 for 4 crappy sli","useful":2,"cool":2},"6GVJIeKhOrr9qZ73-dQzpA":{"text":"This place is everything you can imagine on a late night munchies adventure. Kudos to the ","useful":0,"cool":0},"gZl2vEjUXGKz2dCWc5oe9w":{"text":"I give a star for the staff and it was clean at 1am but shortly after eating it I got cold","useful":0,"cool":0},"2PymzcLo9Z9vKkLHDiTaew":{"text":"I never ate at white castle,  but want to. I ate here at krystal and imagined white castle","useful":0,"cool":0},"6YEYEnsIovxJ8trs33c_Qg":{"text":"Not a ton to say.  They're better than White Castle sliders and they're cheap.  We ate her","useful":0,"cool":0},"eJAqMkz_WWNxVePcnOnTKA":{"text":"Secondary to White Castle... fries might be better but the burger has to much mustard and ","useful":0,"cool":0},"AC832Rdx-EhCOq5YuiUGag":{"text":"On a mission to find good hangover food at a reasonable price, we happened upon Krystal. I","useful":0,"cool":0},"0JfeOH5_2KbLIrO8JN4wpg":{"text":"This was my saving grace when in need of a quick snack at ANY hour-its open all the time! ","useful":0,"cool":0},"GmTYcr7IV0k4X4cdAb8-wA":{"text":"Cheap and delicious breakfast sandwiches!  This was our grab and go breakfast spot almost ","useful":0,"cool":0},"Ecp5pl34NJR-zjMllvVI3A":{"text":"I think that the ladies that work here must be nominated to be saints.  They deal with the","useful":2,"cool":2},"g5P_t4img5Y8hdI8ZtJP8w":{"text":"If your a fan of White Castle sliders then you will like Krystal's, especially in the late","useful":0,"cool":0},"5JU4eFRy0yLZGrgnI4Hfmg":{"text":"Sunny side eggs, fresh biscuit, grits and bacon.... I love me some southern breakfast. Kry","useful":0,"cool":0},"d9INGVDyTRbBgkg9yC2ucQ":{"text":"I have a fever and the only prescription is more Krystal burgers. Well, maybe its not so m","useful":2,"cool":0},"6rbQKm3aJTG7QUBFY1mp9Q":{"text":"I have been by Krystal many times while in the French Quarter, but had other plans to eat.","useful":0,"cool":0},"V1-2sIAFBifn-4pEnWLGug":{"text":"Overhyped and overpriced, yet convenient when you are hungry for a burger late at night wi","useful":2,"cool":1},"k6xOQt83ygVSw09T_vFxCA":{"text":"Great fast breakfast spot! The breakfast biscuit sandwich with sausage & egg was really go","useful":0,"cool":0},"fDnwOoMJG7mrn2j7fJGOmw":{"text":"Miss this place. \n\nI like the tiny squared burgers, it was a great midnight snack to satis","useful":0,"cool":1},"HQuvZiHs2VqJ5o3nMn3qzA":{"text":"I would like to start by saying I do not like White Castle. The concept is similar, tiny t","useful":0,"cool":0},"gddNmNcKVVWQm8lbms9w0g":{"text":"Almost $10 for a six cheese order but they are still pretty darn good. Gave away two on th","useful":2,"cool":2},"Wb423eQztoyZnxD_3fEjmA":{"text":"Fast and efficient. The burgers are an imitation of White Castle.","useful":0,"cool":0},"oQY1OS6Sj4tvaTeaHOLXEQ":{"text":"Krystal burgers are the worst fast food in the whole entire world. I don't care how drunk ","useful":0,"cool":0},"It6wi5XA6Bq0WTzlO6nHuQ":{"text":"Surprisingly good.\nThe burger/sliders remind me of White Castle.\nI think I actually like K","useful":1,"cool":0},"Fl1wgSibSd5hauii5aQYAg":{"text":"Not bad for late night good! Got the sampler combo with a vanilla shake, they were out of ","useful":0,"cool":0},"e4TvJr73sXlaY0JtT8qCnQ":{"text":"Think of the worst burger you could imagine.... then it would be better than this burger! ","useful":0,"cool":0},"FtGICsWlW5t1eZVAWgNiGA":{"text":"after a very long night spent with hurricanes, i needed food. quickly. headed over to krys","useful":0,"cool":0},"dqKeLj__HiCsoEDnk1_mDw":{"text":"White Castle of the South.  The founder even shapes his burgers like White Castle's burger","useful":0,"cool":0},"vmvMLwF--fBX71rdVCux1A":{"text":"A quick place to get tasty biscuits and grits as a reasonable price.  Very nice staff.  A ","useful":0,"cool":0},"sheDZN_ZRAzaV7-h5B9HXA":{"text":"We were in a rush to get to a FQ tour so picked up 2 double cheeseburgers and 2 original c","useful":2,"cool":1},"67tMGX9gsYp_JPkYnh08Sw":{"text":"Krystal's offers mini bruger,chicken sandwiches and a lot other great menu items. I usuall","useful":1,"cool":1},"w6RnH2DRJU3ArKBMfYYKZw":{"text":"Even on New Year's Eve the staff was efficient and the restaurant clean. Plus, it's three ","useful":0,"cool":0},"xzPmYFOA8F0pOq99nHPT7w":{"text":"OK, I would not recommend eating these burgers sober. However, a few passes up and down Bo","useful":1,"cool":1},"4gDAnr5NIcSZFL5bsNIFiQ":{"text":"I hate to rag on any place so I'll start with the good (ok). The fries and coke were ok bu","useful":0,"cool":0},"8UkccGYbYZHz4B3fZ2v40A":{"text":"Good, little burgers. Better than any White Castle I've been to. Like the layout. Has thre","useful":3,"cool":1},"tsjJf-quOP0jtttAKyGcpw":{"text":"Dang it , so good. So bad for you. \n\nIn a great location right as drunks are leaving burbo","useful":0,"cool":0},"Gn_sKdytB7pSx_v32ZwZVw":{"text":"Perfect late night spot and one of the only fast food joints in the French Quarter. If you","useful":0,"cool":0},"fv340hMhj1ct0laeBf_nsA":{"text":"Food Quality: Krystal is your typical fast food restaurant. Food is decent (even better wh","useful":0,"cool":0},"EQg_g4WJzuXLkD4mmsczeA":{"text":"I enjoyed it ... ate too much but I did. Quick and easy. Service was fast and fun. Just a ","useful":1,"cool":1},"OVEMHSSm38xQVBxCtRZnfA":{"text":"The burger \"meat\" (if you can call it meat) is a weird grayish purple color.  I was hesita","useful":1,"cool":1},"zKvCk6k7DYc9W-J7oy3v5A":{"text":"Just awful, who eats this!  My curiousity did me in.  Been a long time since I threw food ","useful":0,"cool":0},"_rfriAXR5jZvuNTJ0gf9Yg":{"text":"Nice employees, cheap, clean restaurant. Decent Krystal burgers with cheese. Nothing too s","useful":0,"cool":0},"pnHu2bXDXf9UpMwA9jvdpA":{"text":"How can anyone growing up in the south not love the trot down to 'Greas-tals' for a half-d","useful":0,"cool":0},"C0iIMluCFm37qjqXPfRUew":{"text":"Have you ever woken up and asked yourself, why are all these damn wrappers on my hotel flo","useful":16,"cool":12},"C4odMwH9QF_Az3lBNHsvcA":{"text":"This place is definitely good if you've been drinking a lot.\n\nThe burgers are good, but th","useful":0,"cool":0},"SbMI9BMkFX24sQ1wQUfAPQ":{"text":"Looks like white castles taste like em too.  Lil taste of home  six thirty im drinking lon","useful":0,"cool":0},"-ORPn-l4bd_wMFPjAH1vUQ":{"text":"So, this is a little burger shop on the corner of Canal and Bourbon in New Orleans.  It wa","useful":1,"cool":0},"elKXxnSX1ncWLjPNigSRyQ":{"text":"Serves one purpose.  \n\nPreemptive strike late night to fight off the hangover that is abou","useful":1,"cool":2},"SCa0vKfUkN993GQRkic_YQ":{"text":"Giving Krystal five stars just because the burgers are really but really good !! Not givin","useful":0,"cool":1},"D5CBbSPWGtZkbQ5Oeh8LnA":{"text":"The order took 25 minutes and while we waited the cashiers were eating 2 hamburgers and la","useful":0,"cool":0},"EfXJwJnRh9XAEUBs9gpTcA":{"text":"Ugh, if Bourbon street hasn't made you want to go home and scrub with bleach HARD, then th","useful":2,"cool":0},"GlGWqTkipgbcAT5ToLmZog":{"text":"The burger's are just what the Dr. ordered after a night of revelry.\nWe're not talking gou","useful":0,"cool":0},"axN2vZ5mPx5MUmOyyP3oYA":{"text":"So picture the scene, 3 am... Bourbon Street.. Several drunk people who appear starved (th","useful":2,"cool":1},"lMt-6ORSBmAV71kz1vrMFw":{"text":"You know how white castle isn't really that great? I mean we've all seen Harold and Kumar ","useful":0,"cool":0},"-fGnYTpqKgEY0ibsDU45Eg":{"text":"First time eating fast food in a long time and I'm sure glad it was here. The burgers were","useful":1,"cool":1},"j9vNIPzSS5QU4wtYQnYuqg":{"text":"There's really not a lot to say here. Burgers/sliders/dogs. Just a little bit better than ","useful":0,"cool":0},"W5FCLPqvw3OlfNa6Wl4qnw":{"text":"I was only in New Orleans for 3 nights, but must have had a bajillion of these little burg","useful":4,"cool":2},"u4y8n0IcrwWX5kjBsRbgJA":{"text":"This place deserves no stars!\n\nI have been here a few times after some late night drinking","useful":1,"cool":0},"6aj-WsXWxQtRYRBc896n_w":{"text":"The absolute worst service in my life. I have never in my life been subjected to such blat","useful":0,"cool":0},"ksgHbp9T88QuLOobhiyTZw":{"text":"The late night equivalent of White Castle (back home)! The chicken club sandwiches are yum","useful":1,"cool":1},"Zc2N89y70iw9QVJC6Q7ykQ":{"text":"Being a California guy, had to try this southern staple.  Well, was a great looking shop o","useful":0,"cool":0},"HjNNl_MKOi6X3XBU8rg3rg":{"text":"This seems to be the southern version of White Castle - except the burgers weren't as grea","useful":1,"cool":1},"PHJNurgW8bmWZqXc4F3eNA":{"text":"This crew didn't know what the hell they were doing. They tried to get me to take a substi","useful":1,"cool":0},"ivqd3qJ1RfXaumRTGJrHdg":{"text":"Beware: This is not only a filthy establishment with rude service, but it is also a danger","useful":2,"cool":0},"wEcXcLaXNsmLyzI6M8FWdQ":{"text":"I picked up a to go order of the Krystal's and Chiks and when I got home discovered a huge","useful":1,"cool":0},"FvutYA-dtJTL9Mv2nMJYnA":{"text":"Decent sliders, and they are open 24/7! The breaded chicken slider meal was filling, with ","useful":1,"cool":1},"eR133yZKEECC1f6kl-VYrg":{"text":"I grew up eating Krystal cheese burgers. If youre from the south it's Krystal. If you live","useful":0,"cool":0},"KRcQlpmjNAB_0ijRm2-vbg":{"text":"I'm sure there's a worse breakfast somewhere, but I have yet to find it. \n\nOh well. It is ","useful":0,"cool":0},"DIZr-X6HRY5glNyoSAkZZA":{"text":"Why in the world do people eat at these places?!?!? If you like fat fries, fat burger, fat","useful":1,"cool":1},"kQCGbteY4lm68c2S-llEYw":{"text":"super seedy location but it was over all chill. i had never been to a Krystals before as t","useful":0,"cool":0},"FHAohv5UQZ_MnHEW_36c8w":{"text":"The food was mediocre. My friend got her food so much later than me. The meat was a little","useful":0,"cool":0},"3764ienxsfYW5yCES1cFHA":{"text":"Imagine White Castle. Now imagine White Castle without any of the good parts. Congratulati","useful":2,"cool":2},"lptHsNuBlDeo2sirKrbc3A":{"text":"One of worst case of racism I've experienced. From the general disdain, the orders barked,","useful":2,"cool":1},"5Grwl50pNzvHil5ud-CeTQ":{"text":"Might be the worst fast food I've ever had. Very soggy and under cooked. I for sure realiz","useful":0,"cool":0},"YBGQEFyD0r7Au07Bs4YAZQ":{"text":"One night when I was wandering around the quarter and wanted to get something real fast I ","useful":1,"cool":0},"WwpBAGEsJEJL4n2WC9Fk2w":{"text":"You'll appreciate this place much more after a night drinking, on your way back to the hot","useful":1,"cool":0},"XO3oxCXdhmctEyEPOV7qAw":{"text":"This Krystal cost almost $8,00 for three Krystal's \nThere aren't worth that kind of money","useful":1,"cool":0},"nlUup4ZjaT0puckfvoi5CA":{"text":"8 Large Beers\n+1 Large Gin & Tonic\n+2 Maker's & Coke\n+ 6 Chili Cheese Krystals\n___________","useful":2,"cool":3},"Xycpj1n7ClysLfLsfJsCEA":{"text":"If you are drunk and you have no idea what you are eating but want something to soak up th","useful":0,"cool":0},"gwqLEY_d8OWFYEmH-QDwig":{"text":"Good good good. We got a massive box to share among eight people and if you like white cas","useful":3,"cool":3},"YZYx7l6rYPcT3sYJ-WpxZg":{"text":"Woof. The mini-burgers are pretty much the sorriest food that I've ever eaten. VERY disapp","useful":0,"cool":0},"U0TSpmClpFdDi8bhUWxgEQ":{"text":"I've never had White Castle inebriated, and I've never had Krystal sober. Guess which one ","useful":2,"cool":2},"SaaT51d1EEHvc2nsObTB2g":{"text":"All i wanted was no pickles, I asked three times and was treated like the bad guy each tim","useful":0,"cool":0},"c7X4rOP2zZD_pfQF9qo_og":{"text":"What do you expect?  It's a fast food joint on Bourbon Street so drop your delusions of go","useful":0,"cool":0},"UMsyBby2P-m5JshrKcJqrw":{"text":"Decent fairly inexpensive fast-ish ood.  Be prepared for surly counter help and having lou","useful":0,"cool":0},"MlF-nfP-RWljzp54Co-LFA":{"text":"Like White Castle. Best after 2AM to help soak up the night's revelries. I am convinced Kr","useful":4,"cool":2},"fPxC-HYMWtFoB79lSw4Myw":{"text":"Worse service ever!! I was charged twice for my order and they were so busy helping the po","useful":0,"cool":0},"_osHOj3WYULAdqoMe4TTLQ":{"text":"So I'm in New Orleans, eating to my heart's content and what do I spy?!  Krystal burger on","useful":2,"cool":1},"F6qkL0RGXas4WTDC2YGH2w":{"text":"This is a south gem, as far as this type food. Bourbon street may not be the best place to","useful":0,"cool":0},"Xh75W4oa17vuOllx4zHXXA":{"text":"Okay. First and foremost, I was VERY sober, as in I don't drink or smoke or anything. So a","useful":1,"cool":0},"W9zsJr17eRei6cncgiCgrg":{"text":"I mean.... It's Krystal Burgers.  They're like original sliders. Soft warm bread... always","useful":0,"cool":0},"C4ePTutAtzduo8uB2zInQA":{"text":"Kelley was amazing and her lashes are amazing. Great staff and quick service. They got my ","useful":0,"cool":0},"riKZXcR1KFuS96tQYt78SA":{"text":"Whoa! This Krystal has a full array of alcoholic beverages!  They have those frozen daquer","useful":1,"cool":0},"rCD-BNY9EYn3dFeeNTLcGg":{"text":"It can be a little scary sometimes in here at 2AM but it's worth the risk to life and limb","useful":2,"cool":1},"GG23KUaP1Xnk4dU-mEkWBQ":{"text":"Drunken sloptarts everywhere!!!  This location gets 5 stars because the staff has to deal ","useful":2,"cool":1},"F49bVV_MU14s8Og7MUUlwg":{"text":"krystal's serves its purpose, but let's not forget -- it's a burger joint.\n\ni was a little","useful":0,"cool":0},"pIvTcOCFq5stlv44PWmkKg":{"text":"What I lived on during Mardi Gras.  I couldn't even begin to tell you how many of these li","useful":0,"cool":0},"TaXHATequmyErKvx_u6EXQ":{"text":"DO NOT I REPEAT DO NOT EAT HERE.  Boiled burgers. Dead cockroaches in dining room. Dingy w","useful":0,"cool":0},"WkzluA7tzf5FlgbIGNyQqw":{"text":"Hi stopped in here at 7:30 in the morning got some chili cheese fries and six crystal burg","useful":1,"cool":0},"iZPZHW5aG6v53AvBFte2TQ":{"text":"Oh yes!  That's right , 4 stars.   And to all you nay sayers out here....it just means you","useful":0,"cool":0},"bOGSh1wnkZloU3SJZkkEZw":{"text":"I'm from Cali an never heard of a Krystals until we saw it on the news  yesterday stating ","useful":0,"cool":0},"s3Q9i0gXwV47wD74FuqN5A":{"text":"The burgers was just ok as expected. Service was \n\n\nslower than expected due to understaff","useful":0,"cool":0},"rvTR7wkOyUp0XlGhrSc6QA":{"text":"Writing this as someone who was starving and willing to eat just about anything after head","useful":3,"cool":2},"Er6GMQfWJG4pdH78NMDbdQ":{"text":"Burgers are on point. Service was pretty fast for how packed it was. Krystal's is open lat","useful":0,"cool":0},"cNWOA-FMSkr4S0X9WALo2g":{"text":"Came here for a quick bite after a night of drinking, was the closest thing to all the bar","useful":2,"cool":0},"2j0IxTIrajc8TdS6maJc0w":{"text":"Excellent drunk-post-Bourbon-St., not so excellent sober. But since you should never eat t","useful":0,"cool":0},"bT-Rn3rks4sKWbAhvM8Adg":{"text":"Really fresh and tasty food, clean restaurant, and speedy service. \nThe hospitality is dec","useful":3,"cool":2},"5onAFpXI_J5CgCCcu9zQkw":{"text":"I hadn't eaten Krystal burger since probably the early to mid 80's. Growing up in Ohio my ","useful":16,"cool":13},"jZ8Qa4SAQtnJ3aNz2A4kJA":{"text":"I ordered twelve Krystal Burgers to go. Get home and realize there are only six in the bag","useful":0,"cool":0},"aqhz9bmIa5YokkpcQt6gqw":{"text":"Reasons I visited Krystal last weekend:\n\n[ ] Because the food was tasty\n[x] Because every ","useful":3,"cool":1},"DLH5fGdLtO8FRjtxrolYdg":{"text":"These girls rock. Gave me the greatest bites with a great attitude and a smile. Will be ba","useful":0,"cool":0},"EGo38PcDY4rR4xgxGAYY1g":{"text":"A Krystal in the drunk.  My buddies and I stumbled here at the witching hour of the night ","useful":4,"cool":5},"5izzQiS4-0lSgNnEAHkc5A":{"text":"I don't know much about Krystal; I know White Castle though and my friend said this is jus","useful":1,"cool":1},"7K_N_WmKCC1IWYVkcDHtnQ":{"text":"For the purpose of the food, I would recommend Krystal. The food was ready quickly, and th","useful":1,"cool":0},"D5rlo62jDrJuLOIa5aSqcA":{"text":"Great place for greasy small bites!  And open 24 hours! \n\nDont be fool by the size of the ","useful":1,"cool":0},"nTWpZEyfnHVAx-WDAGr5WA":{"text":"Never been to the south in my life before, so gotta try sliders. Krystal is probably not t","useful":0,"cool":0},"11z80-Dr0zeIMaQNSCYppw":{"text":"We were on bourbon street and decided to pop in and grab a slider. I'd seen this place on ","useful":0,"cool":0},"XobgnelsGBrq-LAOkhrh_w":{"text":"This place was horrible. I advise you not to go there. Worst sliders of all time and I put","useful":1,"cool":0},"wDO0UFe9n5WG1Sd_H85qYg":{"text":"Good drinks for a cheap price on bourbon st! keyun  smith is a kind guy with good customer","useful":0,"cool":0},"QHO3XKFYBxPo6w0O2wK1TA":{"text":"If you're hungry for sliders or wanting to watch a fight or be in a fight ...this is the p","useful":0,"cool":0},"fHdffoN83AU3DRmiuxQzkQ":{"text":"Took a friend of mine in here to use the restroom who is disabled and they told us it woul","useful":0,"cool":0},"lY6wqrrM6fVZpX4nCiIlNw":{"text":"I'm from New York where we have the murda burgers aka White Castle burgers . Me personally","useful":0,"cool":0},"DAPHij8bt-yYjnpU6jF4ww":{"text":"Always super fast, prompt service. Love the chili cheese fries, and wings are actually ver","useful":1,"cool":0},"szulmCYS0MgRdJqgb6jQXA":{"text":"It's 2:15 am.  I'm in the French Quarter of New Orleans.  I'm here at the Crowne Plaza Ast","useful":3,"cool":2},"Ch1o787N6egnyggPSkSWYg":{"text":"Do not ear here! Took 40 mins to get a burger, all employees had attitudes, the ineptitude","useful":0,"cool":0},"yocvRZbUVl1t1wI9gPdKdQ":{"text":"This was the worst idea I could think of. As a Krystal burger lover, this was beyond disap","useful":0,"cool":0},"euFX-QPYthW5QnksG59CNA":{"text":"As we were walking, a guy stopped my friends and I from entering another restaurant and to","useful":0,"cool":0},"1E5PvgHRQRV3pPpPgZonog":{"text":"The people that work here are bunch of idiots. I ask for combo with 6 Krystal in it. After","useful":0,"cool":1},"RX08jIeSxpE2k0DrvwERpg":{"text":"If you plan on going here sober, stop reading. This is buzzed to blind drunk food. Really,","useful":5,"cool":0},"5z_-SzUsnsMlvAFUG_ocRQ":{"text":"I always thought they were comparable to White Castle. No way!  These were a bit dry and f","useful":2,"cool":3},"jHu48KnywNV0CVnQPlCn5A":{"text":"Same here for some late night munchies at about 1am Saturday morning and as expected the p","useful":1,"cool":1},"1lFS85FR6d57AVdu3MLKwQ":{"text":"A great 24/7 eatery, in heart of city, taste is amazing, not expensive, good value for mon","useful":0,"cool":0},"-OOf_QUPbExfL5LdyfaZfQ":{"text":"Customer service was not great but the food... It made up for any complaint. It's definite","useful":1,"cool":0},"GAMsevwX1EjOn8ETcaXpTA":{"text":"Holy crap, worst employees ever. Went through drive through with my husband in Antioch, an","useful":0,"cool":0},"MBdHG_C98k6JT1T_GLQqIA":{"text":"First impression - this looks like the off brand version of McDonalds.  Prices are similar","useful":0,"cool":1},"waHjtb_GOnA1NnDD2F1XXA":{"text":"I was super excited to see Krystal's on Bourbon St. I'm always stopping at Krystal's whene","useful":1,"cool":0},"3MrL4O-BFIYaiYT_ppxXjw":{"text":"Always quick and friendly staff.  Never a wrong order.   The place is clean and condiments","useful":0,"cool":0},"SX0aICp3jxSxuuLJAlSJJg":{"text":"This place is banging open 24/7 and costumer service is fabulous! you can't go wrong comin","useful":0,"cool":0},"sB4AHZ0eplUIr78gLQ3ZQw":{"text":"Dropped by this morning just cause it was super close to our hotel and we were looking for","useful":2,"cool":1},"3CBvfo_MqLZAfW-Alv46OQ":{"text":"This is low quality carb filled meals.  Located on Bourbon and packed, you'd assume that t","useful":0,"cool":0},"ycSQEEKbAPYO2NO3VSs-hA":{"text":"I was in New Orleans for 4 days and came here about 3 times, twice after a night of drinki","useful":0,"cool":0},"1-YI448kaBotytDfga8FCA":{"text":"Rudest employees I've ever had to deal with. Everyone had an attitude and even yelled at m","useful":0,"cool":0},"sCrlu969sYid5pUEIcaF7Q":{"text":"Why did I do this? Because tiny burgers.  Not as good as White Castle. Tiny hot dogs didn'","useful":0,"cool":0},"P5ebXLaMkMPnbc8q1BSnQg":{"text":"Staff was very cool and food was good. Don't have any complaints. Where can you grab and s","useful":1,"cool":0},"5QJzCpUOYY3LOoa2qBIR6w":{"text":"We do not have Krystal back home.\n\nWhile this southern chain is fast food it was a great e","useful":2,"cool":0},"fOqXsO1QrXtnHUXdJ1aqPw":{"text":"There is a reason why this is located at the end of Bourbon Street at Canal. Because as yo","useful":10,"cool":8},"ofKYrJKteCKJg5jlvkkLdQ":{"text":"I personally love Krystal. I always have. I love the concept of little burgers with cheese","useful":11,"cool":9},"_9DdhJeGHW3RukTUGg3UXw":{"text":"White Castle in New Orleans!!' Perfect when you been on Bourbon Street for a while and had","useful":2,"cool":2},"ioIqgiRx6KW5mRU4DZxZng":{"text":"What a great place, stellar service! Everyone was so kind, and our food was great! It was ","useful":0,"cool":0},"sYffhAoXYM6HmqWQGN3OSw":{"text":"Visiting Nola Krystal's is a must visit. Friendly staff, great drinks prices and tasty lat","useful":0,"cool":0},"hpjjppps_3T4M1iPe26Wgw":{"text":"Service was amazing, popped in at 6 AM and was greeted with a hell of a smile. 10/10 would","useful":0,"cool":0}}