{"KSN9zOhn7xGE8P3zh5a3TA":{"text":"I have been attending All American for the last 6 months and I have ZERO complaints. The s","useful":1,"cool":0},"tAubEIeizY1pZT0XFjvWNA":{"text":"The doctors and staff at this clinic are compassionate, qualified and thorough.  I really ","useful":0,"cool":0},"ZL7GCB-m9pxqWF5flQ8tug":{"text":"All American came highly recommended by a friend of a friend and I'm so glad to have found","useful":0,"cool":0},"Kxx9uUVbxYURGYBLqKqmxA":{"text":"I strained my piriformis muscle doing hip exercises and was on painkillers for weeks. I fo","useful":0,"cool":0},"tufs0QZg0Xjh6wvYcjHFyg":{"text":"I'm an active 60+ yo neck & lower back pain patient and find the combination of prescribed","useful":2,"cool":0},"_P2uKN6SA6-IdIQMtK5nQA":{"text":"They take care of you here. Everyone knows your name, and I never enter or leave without s","useful":2,"cool":0},"bAUqabdEYrf0oj6nFwH0eQ":{"text":"I suffered a traumatic brain injury requiring balance training, spinal decompression and g","useful":0,"cool":1},"vaLVSMjuby76P9z6OYwxnQ":{"text":"My insurance company referred me to All American and when I showed up, after filling out p","useful":0,"cool":0},"-Lf6DI1VaiD0YutLZMPu3Q":{"text":"Well it has been months since I first started seeing them for some major issues I was havi","useful":0,"cool":0},"NjqsdbIg7J2V20dVNQeSbQ":{"text":"After suffering with back pain for years, I decided I was over it!  The care givers at AAH","useful":0,"cool":0},"csXUhwhbxbmq3A4hfyQOng":{"text":"How do I love thee, oh please let me count the ways! \n\n1. These guys are freakin' A-MAZE-I","useful":2,"cool":0},"1G3BuOkbQfUqAZCTnRmueQ":{"text":"Amazing place! Friendly staff, fun comfortable environment, and efficient service. My husb","useful":0,"cool":0},"IWJ0bdqkBsp1XEJ-727V2Q":{"text":"Everyone is very friendly and helpful as everyone has said.  This place has elements of a ","useful":0,"cool":0},"9SpsSWpHUxhR1RNAmmOtYg":{"text":"Some years ago, I decided to try to deal with my multiple body aches by going to a chiropr","useful":2,"cool":1},"tdyqRh77b1aw7KDmoGx7AA":{"text":"After reading other reviews I wanted to try this place. I've been to chiropractors before ","useful":2,"cool":0},"OtgWIVxUKeG6ZCVxnZ2VAg":{"text":"I've been getting treatment here on and off for about two years. I am an athlete, so I mai","useful":1,"cool":0},"AbWpclAc01uEHLFbmkedQg":{"text":"Don't go here - total sales job - you have to commit and they want you to buy lots of \"Hom","useful":2,"cool":0},"678Hlcv6s-WSE4uQQRR3NQ":{"text":"WOW!  After 3 days of treatment - my foot (plantar fasciitis) feels better than it has in ","useful":2,"cool":0},"EiUjzxDIeY5laY4tsEvUsA":{"text":"I have never written a review on anything (mainly because I never bother with it), and I o","useful":0,"cool":0},"14Ym45Nbk-w6Jkvth_hohg":{"text":"As a teacher, I am constantly on my feet or bending over to help students. AAMC has not on","useful":0,"cool":0},"TDmQNiOtxdN9I3VfwZeLZA":{"text":"Whether you're a professional athlete rehabbing an injury or a retiree in your golden year","useful":4,"cool":1},"YnXTZBkOj2Jten-QufLcsA":{"text":"I've been going here for over a year and a half.  When I first started, I loved it.  I dev","useful":2,"cool":0},"ZabuSaVFFQRtO8uv4hQhrQ":{"text":"Dr Casey and Matt were great!  I was in town for a few days and in dire need of a chiropra","useful":1,"cool":0},"TnPcAVk9-rUTkv5ZtQc0Yg":{"text":"Just went here... moved to Nola and didnt know where to go...  I made the right decision..","useful":0,"cool":0},"oG6UVSkyxjOG18SRaxnJRA":{"text":"Amazing staff! I have been going for several months and it has made a world of difference.","useful":0,"cool":0}}