{"XrMKFjHg5qfkIqRI4KbvQw":{"text":"I loved the atmosphere here. It was quiet, but not too quiet. The waiters and waitresses m","useful":0,"cool":0},"FsR8-7rveCWaWwrplEWNKQ":{"text":"Cute place, nice servers and good food but dish sizes are waaaaay too small. I left unsati","useful":0,"cool":0},"By5CNvkzH2aRc08cO9YHoA":{"text":"Cool, cute, friendly, but genuine.  Great atmosphere and service.  Helpful staff and a per","useful":0,"cool":0},"2JqBdOEPeLW6RTj5THKIpA":{"text":"The ambiance at brunch today was soothing and the spirits of the staff were uplifting. Gre","useful":0,"cool":0},"F6Ai2rCuS_UdfZBHG30QQg":{"text":"A great neighborhood restaurant with what has to be the best pancakes in town! Oh, and the","useful":0,"cool":0},"HyWDBXeIUmZ_DkZgBgGK7w":{"text":"So we were strolling down Frenchman Street, which already is a more local hangout, and dec","useful":2,"cool":1},"oKH4hN7M7N04a1YOg1nLKQ":{"text":"Crazy good food. Not the fastest service but totally worth the wait. I had the savory spin","useful":0,"cool":0},"61NGrTrqN6CkxeYeEha4IA":{"text":"My daughter and I went for breakfast, everything was great, my daughter had the chicken an","useful":0,"cool":0},"TUZgSdsoLOtXItiN3dzXLQ":{"text":"AaaaahhhhhMAZING!!!!! If you want the true flavor of New Orleans in a neighborhood diner f","useful":0,"cool":0},"GqUAy1j5x6oY894fPMlFyw":{"text":"We had high hopes of this spot because of the photo I saw on Best Food New O Instagram pag","useful":0,"cool":0},"1zvPQn8p9D5JQxixqUYV8A":{"text":"pretty great food. good environment. a lot of hipster foot traffic, which makes for great ","useful":0,"cool":0},"wJ4nE1SIU091dAnjM9NV3Q":{"text":"Delicious food and excellent service. A must visit spot for brunch if you're in the area.","useful":1,"cool":0},"Hhm5LcpzwWL1ZRx3AwWMKw":{"text":"Amazing brunch, and fabulous drinks! Staff is wonderful. We will be coming back every time","useful":0,"cool":0},"EaFaWn3JDqkTXvToDxKyjQ":{"text":"Our last day in NOLA we finally stumbled onto some actually pretty decent food. We only tr","useful":0,"cool":0},"wS2DF8tu47OUNlVNavemoA":{"text":"Nice location with chairs and tables for outside dinning. I ordered the Cuban sandwich and","useful":0,"cool":0},"OYazuglroFxZddDmRaIBng":{"text":"Horns gets one star for the waitress with the amber necklace... she was fabulous.  If not ","useful":2,"cool":0},"yvxst0h5mLKGeUR-FNZjhg":{"text":"Great place. Authentic feeling and delicious food. Short walk away from bourbon street whi","useful":0,"cool":0},"bcyS29LvV-J-AYP7A--A_Q":{"text":"Pretty much as others have described the place: quaint and has a neighborhood-ey feel.\n\nGi","useful":0,"cool":0},"OSNHUOjkyn2kJkwf1iGHDw":{"text":"We were in NOLA for a week, staying close to Horns, which made it a perfect breakfast plac","useful":0,"cool":0},"ovJF11nU0mnNb-2HK-Q0fg":{"text":"I wish I could pack this place up and take it home with me. Great drinks, great food, and ","useful":0,"cool":0},"i0kGsLVazAgaaTZSNU7DIw":{"text":"Our party of 6 came to brunch at Horn's and we were not disappointed \n First off, my Mimos","useful":0,"cool":0},"hXU3mFDvsAaFAlJxhwpMCA":{"text":"We were delighted to walk in and get seated right away. They have a very interesting cockt","useful":0,"cool":0},"l0VW-bra1JXoMlcpaACd-A":{"text":"My boyfriend and I went here back in April for my birthday breakfast and we loved every li","useful":0,"cool":0},"E0EO-sF948Ix5j7hldVgHw":{"text":"Amazing food, great atmosphere. We sat at the bar due to a full house. The bartender, Mary","useful":0,"cool":0},"1P-pF1Z2ysjZ_2y9BrGYHA":{"text":"Literally the worst service. No one came to our table to take drink orders until like 11 m","useful":0,"cool":0},"fq7BwvEv5qoXafhFvWTUAg":{"text":"Amazing bloody Mary! The entire menu looked delicious and I wish I could have tried it all","useful":1,"cool":0},"tSQJW4vqic3sR2NfCgK0VQ":{"text":"We've tried this place 3 times and each time it was just bad.  the food is burnt and overc","useful":0,"cool":0},"fq3b2_QvgSoHLqBscEf2ug":{"text":"Uhmazing!! Use the Yelp deal and splurge! Heading back again today for dinner.  Yep, that'","useful":0,"cool":0},"PVjADrqqVxCYUYcwaJpOpA":{"text":"Great brunch ,love the new space,clean,and open,will be back for dinner sometime soon.","useful":0,"cool":0},"g10BN7lwghL9DdLGw1jm2A":{"text":"We went here last night and i loved it!  The atmosphere was great and everyone was very we","useful":0,"cool":0},"RF1N4E4kUgRQPqViusRbEg":{"text":"Any concerns we had about customer service from other reviewers were put to rest after we ","useful":0,"cool":0},"YRcoaonYFJd_F6Sf8gYC6A":{"text":"Worst brunch I have ever had!!! Waited one hour and ten minutes for our food. Our server s","useful":1,"cool":0},"g-zPFn9Jr7ZtIpJVBpACoQ":{"text":"Brisket and Grits! The Crabby Wife, Sweet Poato pancake! It's a must for everybody to eat ","useful":0,"cool":0},"h4wJdmom2BSwzUl-vXst6g":{"text":"So glad we stumbled into this breakfast place that was a block from where we were staying.","useful":0,"cool":0},"eNS7h7PhOLPkFfmCcXYC6w":{"text":"The Cuban sandwich with the pulled pork / brisket was out of this world. So savory, juicy ","useful":0,"cool":0},"-CaGpDvCuf-dqvQGGa7xrw":{"text":"A complete wow.  My wife and I had lunch on a whim here recently with no expectations and ","useful":3,"cool":0},"QOMeLWjKCHhwIePnHRHkog":{"text":"This place is a little hit or miss.  There were three of us in our party, two really loved","useful":0,"cool":0},"PT-tDFgQo1NMntpxaJ1lmA":{"text":"Horn's is a Marigny neighborhood gem. Friendly, professional staff, a relaxed environment,","useful":3,"cool":0},"N1oZ2GAP0zKdnfmvzdVn_Q":{"text":"We sat outside, they are pet friendly. It was the best breakfast we had and I'm very much ","useful":0,"cool":0},"bMn6Ma4pVeSarXW4-AkoSw":{"text":"Ate the savory beignets (sweet potatoes and shrimp) with a nightly special of baked oyster","useful":0,"cool":0},"VnwUwg3YnnW81ImRi9tY0Q":{"text":"A very interesting replacement to the late night special LaPeniche. Horn's is a restaurant","useful":4,"cool":1},"T9yrbupyFnO1oXyhZtn6nA":{"text":"This place was great. It's hipster af and that can be annoying but I brought a couple frie","useful":2,"cool":1},"JS08UbKJBjGw5xp2kW7XBQ":{"text":"My wife and I stopped by here after passing it by from our Airbnb, and were thoroughly imp","useful":0,"cool":0},"JDKCFp-zFl2Xvp_yM1AL1A":{"text":"Everyone I was with loved what we got. No problems with service or getting in. I had the c","useful":0,"cool":0},"W4Z5pAYk2Qq03tjU5Li27A":{"text":"Well, I don't understand how we could order, the table next to us orders 3 minutes later, ","useful":0,"cool":0},"ko4PKoGE7alrUQI0FFCAeg":{"text":"here's a hidden gem for you. super friendly, relaxed but excellent food (mostly). i have b","useful":1,"cool":0},"znNfzsrJyaN5WqtgPO39fQ":{"text":"Only the best southern comfort brunch food you can find. I'm so lucky to live just a few b","useful":0,"cool":0},"rbtFkuDNAxewdTwjYfxkiw":{"text":"This was a cute little place on the corner -- a no frills, affordable place to grab a bite","useful":0,"cool":0},"0w3AU6G-pWNVr9IMFu1msw":{"text":"Really good breakfast!!  Nice stroll off the beaten path to a neighborhood with beautiful ","useful":0,"cool":0},"MO4GNvD2VW010J48TmGvRw":{"text":"If you have a lot of time on your hands to wait for run of the mill food then this is the ","useful":0,"cool":0},"gqlPJ8nshNKNSwfcMtINjQ":{"text":"i went there recently on father's day. i had the Guatemala plate. right on the money. grea","useful":0,"cool":0},"gqQC-50gfkhatiNwjakzMQ":{"text":"I have walked by this place a bunch and thought it was super cute looking and had heard go","useful":0,"cool":0},"oeeopyf8Nj_izhrC056D2A":{"text":"Food was decent - \n\nBloody Mary - one of the worst bloodies I had during my time in NOLA. ","useful":0,"cool":0},"2xLLZLvE3RrqzWxKh2nnKw":{"text":"Do not get the pancakes here!!! I ordered the Doc Horn which came with two eggs, pancakes,","useful":2,"cool":0},"OEf0DjnSzgzBV1Ko55yxbQ":{"text":"Back in NOLA for an event and wanted to try a different brunch spot and Horn's popped up. ","useful":1,"cool":0},"GfdCA33UZNNTznm7u0Usog":{"text":"Fantastic brunch spot, friendly, fast service and delicious eggs Benedict! I tried another","useful":0,"cool":0},"dhZy9dlHLL8v2UaIf0orzQ":{"text":"We ordered the eggs dauphine and oysters Benedict and grits etouffe. Wow. Everything was a","useful":0,"cool":0},"j-VSCTR7axYQLEJs0KbGNA":{"text":"Well it's too bad because this place is off the beaten path in a neighborhood. However the","useful":1,"cool":0},"7icZHVhmXEP5Gkyil3jzRg":{"text":"May be my new favorite brunch place. I am a huge fan of Slim Goodies, which is I think own","useful":0,"cool":0},"vjLwTUgMGApTeXuxFoBGMg":{"text":"So many things to say about this place, particularly the OWNER. First off, they have no ho","useful":4,"cool":0},"2RNV69knCKIXa5l0qi-zJg":{"text":"Charming little neighborhood spot you can sit out on the porch, interesting cocktails.","useful":0,"cool":0},"VficqQprMmdWy1e0VyyhwQ":{"text":"A group of us are staying in NOLA for the weekend and stumbled upon this place for breakfa","useful":1,"cool":0},"C9Q6ZZxXR9jnUb2LfU5vqg":{"text":"A stand-up breakfast finer.  Hearty, basic American breakfasts.  Owned by the same owners ","useful":0,"cool":0},"0Uqrg9KQMBEpB0pGTXdynA":{"text":"Had brunch here couple weeks ago.  I'm in town for few weeks so my friend who grew up in N","useful":0,"cool":0},"uctBr_Ke3DwiptJYSv4Oiw":{"text":"This is my favorite neighborhood breafast hole.  My bacon is usually cooked to perfection.","useful":1,"cool":0},"vimIpI5Tv3ZrYbks8OcMXA":{"text":"One of my favorite spots to eat in this city.  The food is on point all the time and every","useful":0,"cool":0},"-Izxo2-S0gJeapUMbjwkmA":{"text":"Have eaten at Horn's a couple times and the food has been fantastic, looking forward to an","useful":0,"cool":0},"23_NVlp_nnSMC2z2rWm4sA":{"text":"Excellent corn waffle topped with pulled pork. Very friendly staff and located convenientl","useful":0,"cool":0},"LYhztPBM_sVnx6bLGTku4g":{"text":"We went to Horn's twice on consecutive nights during our first NOLA visit in June. The fir","useful":1,"cool":0},"I0kYK6iQBdAYq8z66tfGCQ":{"text":"We fell in love with Horns - everything about it - the food, the atmosphere, the owners, t","useful":2,"cool":0},"qvvj0X9vXLhE2PcLH0P5Aw":{"text":"I cannot express what an incredible time we had here! The service was stellar, the food (b","useful":0,"cool":0},"d4xx8BOLEFf365SXvAQGjA":{"text":"Horns is the classic New Orleans brunch with a killer bloody Maria and the best staff. Wou","useful":2,"cool":1},"eB96Gt8CXAHzA6hcnXgU7g":{"text":"Walked upon this restaurant while visiting Nola. Really good food selection. Excellent dri","useful":0,"cool":0},"EcI_cZe8se7zQy_YBxUZ1Q":{"text":"Get a Bloody Mary, stay for the food. This was one of the best food spots we hit up on our","useful":0,"cool":0},"50cRcTetLBI08Etsh3RmTw":{"text":"Had a great $3 French 75 (not too sweet, nice & tart) and fried shrimp poboy with homemade","useful":0,"cool":0},"wMbwTKuDC4rETcn4PUwNQA":{"text":"I liked Horn's. I really just didn't think it was that bad! However, it wasn't outstanding","useful":0,"cool":0},"P4sm-93ZyXdzcRTVNNqj-w":{"text":"This is my favorite breakfast spot in New Orleans! Everything is delicious. The service is","useful":0,"cool":0},"DSPiCowXxB_tSuSqEvnkZw":{"text":"3.6 stars. Above average fare. Leans more on the pricey side. Great atmosphere. Made me wi","useful":0,"cool":0},"82UeyTm4cmkBHqUElWgAIw":{"text":"Horn's is hands down my favorite place for a home cooked meal in New Orleans. Their food i","useful":1,"cool":0},"B7NihPATxUD3Ipo3iphBBg":{"text":"Food was awesome but service was terrible. I ordered the dauphine and cheese grits to shar","useful":0,"cool":0},"OixX3xrFIfdcpwEPffyC5Q":{"text":"I guess the name refers to actual musical horns, but I always think of the Joe Hill book w","useful":0,"cool":0},"H8T_0qx5fci0iN45id9tiw":{"text":"Fabulous breakfast/brunch, a bit on the spendy side. I had the pecan waffle and really wan","useful":0,"cool":0},"G4zJespj1MbQHZRUXBOLTQ":{"text":"This was such a good brunch - we will have to come back during our stay!  [Edited to add -","useful":1,"cool":0},"86Hqt8gSnhvbzSIJBIgDkg":{"text":"We had The Eggs Dauphine and The Jewish Coonass. Both were awesome. \n\nCoffee is INCREDIBLE","useful":0,"cool":0},"d7bRDujw0oHWN-SzlzMV6w":{"text":"fun little lunch spot. food was well done and staff was busting butt to get people seated ","useful":0,"cool":0},"lhfjhosj-6OKuua0uqe5QQ":{"text":"We stumbled across this place and have been so pleased!   The Bloody Mary's are out of thi","useful":1,"cool":0},"Y6vLerp0mmMU4FBhR2hndg":{"text":"Delicious food awesome service! Located alllll the way down bourbon street but worth the w","useful":0,"cool":0},"YJosKWHf9Bh16kcJXT7Uhg":{"text":"Went to Horn's for lunch today & everything was fantastic! I had the catfish plate with sa","useful":1,"cool":0},"62FUkJ0vXHmt4nd211vJVg":{"text":"WHOA NOW, Horn's is ACTUALLY open from 7-10pm on Monday and Tuesday! They do NOT close at ","useful":3,"cool":0},"r3qXC690p2kGWSdmsfjUlw":{"text":"We had a great breakfast on a lazy Tuesday morning at Horn's.  We had the crawfish over st","useful":0,"cool":0},"XkO4rWoCQPOEfMQy5-doeg":{"text":"I love Horn's for breakfast, lunch, and dinner.  We live in the neighborhood and it's a ma","useful":0,"cool":0},"ppaW3gPnk9Ylvs8hfLiTBQ":{"text":"Ate here today and  although food was good the service was horrible. It would be one thing","useful":0,"cool":0},"oCuasHsLXpv57DihjR8W9g":{"text":"The Food:\nFrench Toast and the Crabby Wife. Both were very good but I wouldn't say worth t","useful":0,"cool":0},"N6Yu7mP0ap2XLuk8K7tc8A":{"text":"solid brunch and cocktails. some things feel overpriced but that's just the area. love all","useful":1,"cool":0},"77Y7-9_HX_Uj-oK3pc9Nag":{"text":"The food is good; the service is friendly but extremely slow.  Prices are extremely reason","useful":0,"cool":0},"SzTOADMTuvyg2-h2mLwdLA":{"text":"Not a bad Sunday brunch spot. It gets busy and it's not a big place. Some outdoor seating.","useful":1,"cool":1},"scpMNbvC5lemeEtI4xn2vQ":{"text":"Food was delish, wait very long otherwise would've given it five stars. The waitress was n","useful":0,"cool":0},"hpCVc9ac9Ml9wQvtzNaGGQ":{"text":"The location of Horn's is a little out of the French Quarter, which is great to see more o","useful":0,"cool":0},"eTocZ4hs9cMmx4IA3NpzvQ":{"text":"Stumbled upon this neighborhood spot thanks to Yelp, while we were visiting Nola.\nWe are b","useful":2,"cool":2},"oiA23fWpvpWvgUN43lfIVQ":{"text":"Everything is good... fried catfish was really good and the garlic Brussels sprouts are th","useful":0,"cool":0},"iKOpZ1MIIMLiSRj89FZr9w":{"text":"I started with the shrimp boil, they were fairly large and a good portion for the money. I","useful":0,"cool":0},"fKueCEHLyWlgJXu2IxdpmQ":{"text":"So yummy!!! We met locals and told us about this spot and went for our second breakfast of","useful":1,"cool":1},"PqGBDbCu_WfTDV6mQeMkVw":{"text":"The meatloaf is the best I have had in awhile! The staff is friendly and the atmosphere is","useful":0,"cool":0},"siK_gifsw3WXveoxcrtRBg":{"text":"So delightful! The food was fantastic and the place was cozy. Was in NOLA as a tourist and","useful":0,"cool":0},"Xaf_9CQCZMkW3LgpoAuRiA":{"text":"Came here for a late lunch and got breakfast items which were all amazing. Crawfish étouff","useful":3,"cool":1},"iOYVaAvD8clO9SwZjzLatA":{"text":"Absolutely a great brunch spot ! They are only open for breakfast and lunch And man am i g","useful":0,"cool":0},"Lvx61KgtPOfW_4LhYLqsrA":{"text":"I came to NOLA on vacation and one of the girls in my group found Horn's online so we deci","useful":0,"cool":0},"1J9o3v4fD9JPnQFq2UfKug":{"text":"I've eaten at Horn's several times over the past two years, almost exclusively for brunch,","useful":0,"cool":0},"j8Dvkulc5EfVKVjElYF0_w":{"text":"From late night burger to an amazing selection for breakfast. Today I enjoyed Eggs Dauphin","useful":0,"cool":0},"W6suZARXBxipWWGyQ7-cNg":{"text":"Came here because it was close to our Air BNB. Did not disappoint. We ended up coming in a","useful":0,"cool":0},"0Lp4_NWEzUhcPnB5bAHUnQ":{"text":"By far our favorite spot in Marigny to eat. Best food staff and prices. You'll definitely ","useful":0,"cool":0},"IC04atCCR2mpI5LonIm4dQ":{"text":"I never tire of finding these darling little corner restaurants here in this town-worn, qu","useful":1,"cool":0},"wwBRlnTn2HqsGFgsON_buw":{"text":"Great food and coffe, but service was poor. Waited over an hour to get food. Server was mo","useful":0,"cool":0},"C8TP9ys7CJ_Lv8sXqQLgdw":{"text":"I have no idea how this place gets 4 stars overpriced bad service sorry new Orleans has to","useful":0,"cool":0},"XyJoZDMb0QBKa1CKMsIygA":{"text":"If I had to choose one meal to eat for the rest of my life it would be The Crabby Wife","useful":0,"cool":0},"NMjMviROnS-V6mZfWAargg":{"text":"Great little neighborhood spot offering home cooked comfort food in the space formerly occ","useful":1,"cool":0},"b37tFRICZkWi4vKgA45dIg":{"text":"My partner and I have been before for brunch and loved it. I wanted to bring my mom while ","useful":0,"cool":0},"2QTykx_sgm6rfaSeJfL9_A":{"text":"Best brunch I have had in awhile.  Their eggs dauphine is unbelievable.  It is so good tha","useful":0,"cool":0},"B4HuXOTLKxNsSv2qtvgPOg":{"text":"This was probably my favorite restaurant while I was visiting NOLA. So good I came back th","useful":1,"cool":0},"e_vlRQRFiLubcu137KdF8Q":{"text":"Went for an early Saturday morning breakfast before hitting the town for the day. One of f","useful":1,"cool":0},"E8WORYYeaAXoCn3bBLiqdg":{"text":"Consistently good food. Great little neighborhood joint. Brunch had creative fun dishes, C","useful":0,"cool":1},"CzrOdL-XQo7jQ6To5NBaag":{"text":"Outstanding food and service.  I would recommend it to anyone.  We ate breakfast and suppe","useful":0,"cool":0},"nVzcEqNj1TW_VT3CU7XEVw":{"text":"Love it. It was not busy. The staff is very nice as well. Gives you an authentic Louisiana","useful":0,"cool":0},"5hDMW19ZCRCPFU1vBn6KKw":{"text":"Great place for breakfast! It was off the beaten path and amazing. Next time we are in NOL","useful":1,"cool":0},"PPGNZiHn27c_4FqgNIZoRA":{"text":"The service is a little slow (and sometimes terrible) but the food is worth it. I love thi","useful":0,"cool":0},"vnIIHbMtuoBWFdhqkEtnrA":{"text":"My family was in New Orleans for a family reunion and this became our go to place several ","useful":1,"cool":0},"vmyU8O8UP4Oo7NV_kPI6Mg":{"text":"If I were to walk up to you and say \"I just had the most amazing Jewish Coonass,\" I would ","useful":2,"cool":1},"7966hqzxB2OtmDm3GqohPw":{"text":"A friend and I stopped in for lunch. He had the hamburger, and wasn't offered cheese or ad","useful":0,"cool":0},"iCOe4VLDn3dxzqrQTRO4Mg":{"text":"Eggs Dauphine.....holy crap.  Don't leave New Orleans without having these for a big, pref","useful":0,"cool":0},"hQaeKBWQqoC9JWvNQFpxNQ":{"text":"if i lived in the neighborhood, this would totally be my local, go-to spot.  i went on a v","useful":0,"cool":0},"J1lPvq2_3jQbMkYebEjKZg":{"text":"Stopped in for a late brunch. Addison was a wonderfull server, he even brought out some ba","useful":0,"cool":0},"4My97wvFDnhdQYxuY0m1CA":{"text":"I had the crazy wifey and the sweet potato pecan waffle.   The waffle was delicious.  I us","useful":0,"cool":0},"aV2NmelmArsmsVT7xpLwJw":{"text":"One of the best breakfasts to be found anywhere in New Orleans. Food is hearty and delicio","useful":0,"cool":0},"Z1V7cYdxzTCc4bO1kK0yBA":{"text":"Poor customer service/communication. Today was the first day of daylight savings and there","useful":0,"cool":0},"m_v0E3AghD5B_4lOimOAKg":{"text":"Went out to dinner with friends and family and we decided to stop at this friendly neighbo","useful":1,"cool":0},"Zo3Y6JvgBIjYNRtOOgQdTw":{"text":"Horn's was a lovely little place in the Marigny neighborhood that no one would ever know w","useful":0,"cool":0},"AVPa4Jnze3FeWtWsloYQxA":{"text":"New place with super friendly owner and great service. Really nice location on Frenchman s","useful":0,"cool":0},"7nzNaZ0jCKL66K5UTsfVeg":{"text":"Emailed owner about reservations for 13 people. They emailed back & asked that I text to c","useful":0,"cool":0},"KI52LbjV4ah7L3NHsgt5-A":{"text":"I love the family feel, casual decor, and creative menu at Horn's. Try the Crabby Wife at ","useful":0,"cool":0},"bcjf3N7qfsyE_1DHLaBd9Q":{"text":"Horn's! I've been twice - the second time was better than the first. I actually don't even","useful":1,"cool":0},"YzaPmn5LhlaD9D-3H_GSiA":{"text":"Loveddd this place. Went twice when i was in NOLA. Bloody marys were phenomenal.  \n\nHad th","useful":0,"cool":0},"d74zGXwZ5YwqkoK0zpLU7Q":{"text":"Great place. Nice people, nice mugs, solid kitchen with options. I went there for breakfas","useful":0,"cool":0},"idtv5rppojpwFj2dyXx5lg":{"text":"Cornmeal waffle topped with pulled pork is super flavorful & delicious. Grits are nice and","useful":0,"cool":0},"X2NGbN1o4y_j-AavUf_mhA":{"text":"20 minutes of waiting, 10 minutes to orders from the server, 30 minutes to waiting for my ","useful":0,"cool":0},"-8wiofFVgs35Ja1pRlVKmQ":{"text":"Wonderful! We called last minute because Port o Call couldn't accommodate our party of 15,","useful":1,"cool":0},"PMqIguHKuX2NvzeHn5M-RA":{"text":"I live around the corner and really love this place. The food is always on point and the s","useful":0,"cool":0},"tu0Bh-8041joT7UqNkaung":{"text":"Love this local breakfast joint. It's a gem and a true find in the Marigny/Frenchmen St ar","useful":0,"cool":0},"0BNQog8phRdIk8fHFc9AFA":{"text":"the vibe in this little neighborhood restaurant. The portions are large and the service wa","useful":0,"cool":0},"HxuA3iPwRHth6CBgkUmd_A":{"text":"OMG! This place is amazing! Hands down the best brunch place I have ever been to and I wou","useful":0,"cool":0},"Svb9tOClvrkBEODxbO8O_Q":{"text":"It's located at the corner of Touro Street and Dauphine Street. It's a very cute place. Th","useful":0,"cool":0},"lhFIoCWd-jbQxRXur81a4Q":{"text":"Horns used to be one of our favorite places to have brunch. I have taken friends and famil","useful":3,"cool":0},"mNhKowXaJD-9tZXDWXGJ9g":{"text":"always fun up in here.    I have eaten here many many times.   there is a huge menu of fun","useful":1,"cool":1},"__w8HFGBnQoe_NrO03V0oA":{"text":"Service was awesome, nice atmosphere, server Aimee was friendly and helpful, food was grea","useful":0,"cool":0},"gft6qd460dLHE8ajhspljA":{"text":"Great lowkey type restaurant in the New new Orleans. Good price points and the vibe is rea","useful":0,"cool":0},"MYqpvLUFdnEw4NvGbloC1w":{"text":"Came in here and sat for about 8 minutes. Nobody ever greeted us or acknowledge our presen","useful":1,"cool":0},"g23j8I8YlxFeTKbXfzOgCQ":{"text":"Wonderful ambiance, good food & very attentive staff! The mushroom spinach bread pudding i","useful":0,"cool":0},"KoGeQ5ckGkY62H-PDqc3XQ":{"text":"We were staying around the corner and ran into this gem of a place. We opted for take out ","useful":0,"cool":0},"KnlEkC3-7NlKAcGmJB_odQ":{"text":"Atmosphere is quaint, service is lukewarm, just like the food. \nI ordered the crawfish eto","useful":2,"cool":0},"aCmfGfow1OH_-fKOd7XGqg":{"text":"Showed up serendipitously for Saturday brunch, got in right before it it started getting b","useful":0,"cool":0},"J4a-UE9hITpPgm5bntYglg":{"text":"A perfect place for scrumptious breakfast with great southern flavor profiles, incredible ","useful":1,"cool":0},"6V9D3gEObldnzIx_1wuCPg":{"text":"Wonderful spot to grab drinks and a quiet dinner. The music is great and the atmosphere ve","useful":1,"cool":0},"zMKl_UN0_oOU4_hBqXGkpw":{"text":"Great food. Great atmosphere. Great service. I tried the Waffle Cochon and it was to die f","useful":0,"cool":0},"fIvbi91v9Wz9iZuyk9nWhA":{"text":"Amazing breakfast! Me and my boyfriend have been there 3/5 days of our trip here in NOLA f","useful":0,"cool":0},"oFafW3GvmDJ9L8fMyY5cow":{"text":"Neighborhood hash house with VERY unique and Nawlins influenced menu.  Real people servers","useful":0,"cool":0},"AyntJaAdxW7UTob3NGYL1A":{"text":"Trout amandine was so good, it almost made us forget how much we miss Uglesich's. The brea","useful":0,"cool":0},"3hjpwEn-Y8a-UGLzE5p3-g":{"text":"This was our last meal in New Orleans, and the most ridiculous. \n\nIt started with us arriv","useful":0,"cool":0},"s9bShodjNZsL2yXP8R6caw":{"text":"Delicious!! I had the eggs Benedict, the hollandaise was spot on and the coffee was excell","useful":0,"cool":0},"E_7ny5_m9W0YIkK-cfATwA":{"text":"our first time here. Took advantage of a groupon service was horrible.  An hour before our","useful":1,"cool":0},"UFNk9FalruKUBQr2KOMlEw":{"text":"Excellent food, drinks, and conversation.\n\nI recommend sitting at the bar near the waitsta","useful":0,"cool":0},"A7BrPoihpE8FIYx_uwzjXA":{"text":"The owner of the B&B we stayed in recommended this place. We went for cocktails (the BEST)","useful":0,"cool":0},"nLqQ36bj6cCuvlZGsn-Chg":{"text":"We came for dinner on a chilly Sunday evening.  It's a warm and welcoming neighborhood res","useful":1,"cool":0},"3DEC7ys4AxGWYpjLgTKySw":{"text":"Perfect breakfast spot! The Best food and good prices. We are going ones more before we he","useful":0,"cool":0},"8LRqBqR8q1-4-L5cHARvOg":{"text":"This place was awesome.  We wandered in for brunch with six people and tried 5 different d","useful":0,"cool":0},"vwMOOHyOqoVPUKmbdb6fhQ":{"text":"Woke up hungover as hell and knew I needed a bad ass Bloody Mary and something tasty to sa","useful":0,"cool":0},"ZYgoBN7gl_n5cXz6V0tD9Q":{"text":"I don't know if they know how to use salt, BUT the service was good. \n\nThe fish dish was f","useful":1,"cool":1},"_it9GldjrBzL61akWpmIww":{"text":"Went for dinner Sunday night and loved it so much we went back for breakfast Monday. The f","useful":0,"cool":0},"s7Qa6oSgRfbvUbE0XQWnqg":{"text":"Nice little place with a cozy feel and high quality food. Lots of different unique options","useful":0,"cool":0},"nt0Kc8HmIDeCFEDNbwTiKw":{"text":"Great food with generous portions. Comfortable and open environment with friendly service.","useful":2,"cool":0},"klHDgTHpEqt5GJ5y3G3BLg":{"text":"The perfect spot for brunch! I'm sure their dinner is grey too but the chicken and waffles","useful":1,"cool":1},"98xEzuwg5YckGvFo4kO1wA":{"text":"This was my favorite meal during a seven day trip to New Orleans. This includes a trip wit","useful":0,"cool":0},"OMohFfb6ZKH9fhuM11evvA":{"text":"Hello out there in Yelp Land! Please, please, please try this restaurant. The food was soo","useful":0,"cool":0},"si55FSXreWYzR3owq7rjSQ":{"text":"My favorite restaurant in New Orleans. \n\n I had the Guatemalan breakfast Wednesday and it ","useful":0,"cool":0},"sMiQLcb6v694CusHehjXLw":{"text":"I recently went here for lunch after trying to visit for at least a year (I've dined at Sl","useful":1,"cool":0},"_2RdjA4gW_tyaWrE962pNg":{"text":"Spent 5 days in New Orleans and this was the best dining experience.  My wife and I were s","useful":0,"cool":0},"aWhqAg21RGF52WT-SBs2pw":{"text":"My wife and I had lunch here on a beautiful Saturday before walking to Frenchmen street.\nS","useful":0,"cool":0},"pnsi3J6A0gPOIlLJkuH8bw":{"text":"The girl's meetup group I'm a party of decided on this spot for a Sunday brunch. While the","useful":0,"cool":0},"nIZXL422SVr4T6LduX6N3g":{"text":"Well we sat down @845 for  a 830 reservation and it's 10pm and no food! How much do they e","useful":0,"cool":0},"Yhda3WkCA9_D_mIOoJVg5Q":{"text":"This. Place. Is. Incredible. As a seasonal restaurant owner, all I do in the winter is tra","useful":0,"cool":0},"4EpMvw5ouiKEKyHrTzsaTQ":{"text":"This morning we had brunch at Horns. I can't say enough about the service, atmosphere, and","useful":0,"cool":0},"80IkIKAFwdY0QjwkoNFPCA":{"text":"My family and I were looking for someplace to eat for breakfast and found Horn's. It was i","useful":0,"cool":0},"fzpEylRMMD4judzGqvdPLg":{"text":"I got the eggs benedict and my SO got their waffle cochon. \n\nThe hollendaise sauce on the ","useful":1,"cool":0},"wzjUXzPUEkiV3VdcJ-on-g":{"text":"This was the perfect way to finish our trip to New Orleans. We stumbled across this little","useful":0,"cool":0},"oBY5GoVa-UYddvPj_KV3Mw":{"text":"I'd always loved Slim Goodies, so naturally I was thrilled to hear they'd made it possible","useful":3,"cool":1},"-a2AsuB8SxIr8cns36WplA":{"text":"We called at 8pm on a Saturday night and got right in.  I guess we just called at the righ","useful":0,"cool":0},"Jyzf7O1Rzr6OPRHTffkJ6g":{"text":"Service : stellar,  friendly, fast, clean, AMAZING. ...SO far my favorite stop in New Orle","useful":0,"cool":0},"83MMCcHlPHrNcsLKE-0ZAQ":{"text":"Super cute small place off of Frenchmen Street. A nice place away from the super hustle st","useful":0,"cool":0},"u_j2qJMDnjpwIdbGbqYMUQ":{"text":"First stop once I touched down. Talk about an awesome brunch place. Cute little place nice","useful":1,"cool":0},"f7ic-_W00tyzIvdorAinCA":{"text":"Like a lot of other reviewers, the service was very slow - it took a good 12-15 minutes be","useful":0,"cool":0},"rTTfW5khd0VhdGT2fZQedQ":{"text":"Great little spot with excellent brunch food. \n\nTried pretty much everything on the menu a","useful":0,"cool":0},"UkIo2lragUxdCADyNL3Jng":{"text":"Like being sat down in a friends house, served great local NOLA food. Delicious and friend","useful":0,"cool":0},"knnbJnCdIfbUuqZetBrp8A":{"text":"We came for dinner. Delicious. Everything. Unique and low key atmosphere, terrific service","useful":0,"cool":0},"DC1a_p-DciSNg5aAN2RvaA":{"text":"Great little local restaurant with friendly staff. Delicious variety of breakfast and lunc","useful":0,"cool":0},"WJ_A5e2hnC1z7KXNuUEGtQ":{"text":"Not only was this the best most 'authentic-with-a-modern-twist' breakfast I could have eve","useful":1,"cool":0},"wi0GuNnwnb62VyybbzdCdw":{"text":"This place is so cute and the food was great. My husband and I both had the Guatemalan pla","useful":1,"cool":0},"WM2vEP5QLg_8yhy9ALcVGg":{"text":"Off of the main tourist path, Horn's did not at all disappoint either time we ate there. A","useful":0,"cool":0},"CL3L4zRMfBrjf00l-t1SJw":{"text":"Jewish Coonass and Chicken & Sweet Potato Waffles were both incredibly delicious. I cannot","useful":1,"cool":0},"NrNWaQEpOU79IFXUx6-PaA":{"text":"They didn't have any seafood or fish, so I ordered the Caesar Salad that tasted like nothi","useful":1,"cool":0},"epKkRHWPonBdpHH9VdVd3A":{"text":"Breakfast is the most important meal of the day and this place serves up some tasty eats. ","useful":0,"cool":0},"GQONms02QQ4Pe3JLO2wpEg":{"text":"We were unaware that this was no longer La Panache but were pleasantly surprised! Everyone","useful":0,"cool":0},"BAMXR8W9z7Ht7g14PcM8tA":{"text":"Wandered in on Saturday looking for a poboy, however brunch was still in session!  I asked","useful":0,"cool":0},"18LAPmtsiDwtk09XMLbKzw":{"text":"BLUF:  I'd go back if I were in the area.  Glad I went but would order something else.\n\nI ","useful":0,"cool":0},"QJ2hvqrUXqzq_bda9-celw":{"text":"Great breakfast place with outside seating, close to Frenchman street.  Great food and ser","useful":0,"cool":0},"12Ra-KICzCg0zuC0BdBXxA":{"text":"Very fun rugged interior cabin like cafe, with a bar. Great service. I saw some low review","useful":0,"cool":0},"rpwsZ_Bk5fMdPgpNQHXlmQ":{"text":"Great place for breakfast and brunch. Dinner menu is wonderful as well. Outside seating is","useful":0,"cool":0},"DpBW-Jq5etDfp-Xzdu2Mbw":{"text":"Popped in for a late lunch and was very pleasantly surprised. The food came out fast, the ","useful":0,"cool":0},"1P72MXCHQBpaOsRkjV4BIQ":{"text":"One of the top three food highlights of my trip, (grits were amazing) and there was a LOT ","useful":0,"cool":0},"VD0EccGnHvNEFyMPAbfkNQ":{"text":"Came to the place 3 times on our 5 day trip for brunch. The eggs dauphine was the best bre","useful":0,"cool":0},"J3p3WXN6cqx78SagO1EcBg":{"text":"This place is awesome! My husband and I both ordered the Dauphine special with pulled pork","useful":0,"cool":0},"7YP19fMVuUyuizU4JaT1zw":{"text":"Visted Horn's for Sunday brunch. I was excited to hear that its the same owners as Slim Go","useful":1,"cool":1},"SHIKEHiMuKpcMn2Q1Vyxjg":{"text":"Great, laid back place. We came here for brunch and it was so good! We got The Bomb, Crabb","useful":0,"cool":0},"gB6GVCvHQdN36U1oNRmlTA":{"text":"Great tasting and special dishes. Friendly staff. Pleasant outdoor seating area.","useful":0,"cool":0},"C1PeVc6cnlvOBKQ-C6fQuA":{"text":"Went here for dinner during a quick visit to New Orleans a few months ago and I'm still dr","useful":0,"cool":0},"t_iEFlpF8YyqYJ7OkVs8Kw":{"text":"I love Horn's. I also loved La Peniche, it's predecessor in this space. Seems they may hav","useful":0,"cool":0},"rNYmly3wFbbbFLD1BUPjwA":{"text":"Visited on a rainy Monday & plenty of seating was available. Decor is...unusual. Deer head","useful":0,"cool":0},"GNrpzTGEiKeqcCeFI-ll2g":{"text":"Horn's is a nice corner restaurant in the Marigny that is owned by the same folks who run ","useful":0,"cool":0},"I-l5A4YEPmB37U6tCAEAaA":{"text":"The people are friendly, but the service can be very slow.  I went there once when the pla","useful":0,"cool":0},"zTuGBbZocGRdQ5roM5_VvQ":{"text":"The Oyster Benedict was one of the most satisfying breakfasts I've ever had... good coffee","useful":0,"cool":0},"N3b10lqXCSrkH5Y3BTrOBw":{"text":"Ordered the Eggs Dauphine and I don't want to ever eat anything else in my life. So good! ","useful":0,"cool":0},"E5KvOdKpWo5wP1FcKyic_Q":{"text":"Dinner: who knew. Friendly wait staff. They were busy but communicated that our food would","useful":0,"cool":0},"ChtnlqqHk45_e7Mh_MSCNA":{"text":"Ordered a simple chocolate chip waffle and it came out cold - the bacon being also very co","useful":2,"cool":0},"qt9ECuuI2cBvIwWpNSk5_A":{"text":"Wonderful meal.  Local joint with a great attitude for serving all who walks into the door","useful":1,"cool":0},"jQGsABQnHsNlcXXKSaiE_A":{"text":"I was chosen as the brunch finder, and I definitely got a pat on the back for this place!\n","useful":0,"cool":0},"wU4-gF4YcCSC7RgLw52D2Q":{"text":"This is actually a pretty good breakfast place but the service is nothing short of bizarre","useful":1,"cool":0},"LoDMES5pYsxmw49oiTxlFg":{"text":"Great local spot for breakfast and lunch...crabby wife...etouffe...cocktails...just a soli","useful":0,"cool":0},"Vh1AtWi3SEX8KWaUgVRagg":{"text":"Wanted to like this place, but we never got a chance to order. Got some coffee from the ow","useful":5,"cool":0},"p2fEI42LWapNIcq05_6wow":{"text":"Oh, Horn's.... Why? Why oh why can I not have a good experience here? The good news? They ","useful":1,"cool":0},"XhFE8Wk8XDXFy7T5Kska6A":{"text":"Came to Horn's with a friend who had a Groupon and it was a horrible experience. We came d","useful":6,"cool":0},"vAc1nv9daCiHn7UNFzlrCQ":{"text":"The Eggs Dauphine is probably the best brunch food I've had. Pulled pork on jalapeño cornb","useful":0,"cool":0},"szKOJN-ZlcSZtUw4xQcjIQ":{"text":"Horn's was an amazing local breakfast spot that treated us very well after some long eveni","useful":1,"cool":1},"CGqxQUlqLN1pKgFOfKa9WQ":{"text":"Dog friendly! Fabulous server & food in a laid back neighborhood! We got the stuffed peppe","useful":1,"cool":0},"RgIr27azHyvbtYb9zFbJsQ":{"text":"Terrible service. Mediocre food. I decided to give it another go today. Bad idea. At least","useful":1,"cool":0},"mBQILuhSIGX-dcntrTheJg":{"text":"Food was heavenly!!! Get place to grab breakfast or brunch! Would definitely come back!","useful":0,"cool":0},"l8quX62il-PmDcz-8Hxpng":{"text":"I came with a group of people for a friend's birthday brunch. The place itself is really c","useful":0,"cool":0},"LBcsJ3et5UwTZMrvmBlg7w":{"text":"Sat outside, nice atmosphere. The restaurant is near the flea market in a quiet neighborho","useful":0,"cool":0},"N5iRIGy8qyVw00sRvMizDw":{"text":"This place is soooo good. I had oysters Benedict. The batter for the oysters was spot on. ","useful":1,"cool":0},"Ic2Dhgh5v0E9PPIjS2W_Bw":{"text":"Never had the pleasure of eating chicken and waffles before and happy Horn's was the place","useful":0,"cool":0},"bx0k-BPQ9_5uGVeMHzWGhw":{"text":"I visited Horn's to avoid traipsing all over the city to satisfy my hunger, and mostly bec","useful":2,"cool":2},"PBKkF38quTotrjk07tH6eQ":{"text":"Nice place in marigny. Great location. Food is delicious and the waiters are nice. I had t","useful":0,"cool":0},"9oKJAAXCg-xYSIFq9pIE2g":{"text":"This place was a complete gem to run into while roaming the NOLA streets during my NYE get","useful":0,"cool":0},"-f7nmlDXB9F5H5r8fGx0ng":{"text":"I had the meatloaf, perhaps a boring choice but it was cold and rainy outside and I wanted","useful":0,"cool":0},"2mpUjIEbbOj4_DslJXGEXQ":{"text":"If you are looking for a real off the path neighborhood place to relax with some terrific ","useful":0,"cool":0},"Qo_ZdkdyGD2tshFF4udkpw":{"text":"Although lots of red onion, the wedge salad was good, the pulled pork on waffle was awesom","useful":0,"cool":0},"xIOAKC7SXjzJXdPT9NVW_w":{"text":"What a great surprise! My three college girlfriends and I were in NOLA for a weekend, arri","useful":0,"cool":0},"jvWsiJ_p04H9rTUdXdVLWg":{"text":"I liked the neighborhood feel of Horn's atmosphere. Its a mix of locals and tourist being ","useful":0,"cool":0},"Swz3Nq3UxMg_jPznE-QwyA":{"text":"Delicious  home cooked food with a slightly different twist. Environment was relaxing and ","useful":0,"cool":0},"J39iO1RR3993NOqi3saU4A":{"text":"Nice neighborhood place. We loved the vines growing over the overhang . The food was good,","useful":0,"cool":0},"KBnXMtqxtvGvhcPmFMNakQ":{"text":"Super delicious. Had the eggs dauphine. My friend had the chicken & waffles and loved the ","useful":1,"cool":0},"NgossTcgtWFewZ00DxcKYQ":{"text":"You can't go wrong with the Cuban! The meat pies were fantastic, this is a hidden gem for ","useful":0,"cool":0},"goAn8fEpPHmUf4XBMGWQQg":{"text":"The atmosphere was my favorite part of my experience. Cocktails were a small sized and ove","useful":0,"cool":0},"UMc0FGcdlM5YDrFWsMBCzw":{"text":"This is a cool little place just off of Frenchman street, with quirky friendly staff and u","useful":1,"cool":0},"w4vulreDiAyNdOaDYoqt8g":{"text":"Wonderful neighborhood place just outside the quarter. Unique breakfast selections such as","useful":0,"cool":0},"P1r-o8VSQu5El1-EQPg78g":{"text":"Delicious food and fun staff. Had a great time there with my Jazz Fest crew/family. Won a ","useful":0,"cool":0},"r91yGafXZ_ETixP815GOtg":{"text":"Very disappointed in the Caesar salad $7 or $8  with a $4 extra charge for chicken.... no ","useful":0,"cool":0},"KAElmfYCX-2yvc4UMf3w_Q":{"text":"Interesting local place just outside the French Quarter. Animal and musical horns grace th","useful":0,"cool":0},"_F0LtKZ8L_qNKVi_0VUKtw":{"text":"Holy hell!  This place put the hurt on the belly.  So so good and very friendly quirky sta","useful":0,"cool":0},"KoLe9cNWQEaWHVYnOagWRA":{"text":"Love, love, love this place. Owner is approachable and locals will give you their seat in ","useful":0,"cool":0},"_Inox-LNzzFj1sYXYQGGPg":{"text":"I am not even done with my meal but the feel of this place is amazing.  I had to wait a bi","useful":0,"cool":0},"fryrQj8XSd3sqVTX3Q4f5A":{"text":"Cool spot with awesome menu~a party of five and we all\nHad a different meal.  All were exc","useful":0,"cool":0},"sJQKiZQ-_wYMtL-kAUM3sg":{"text":"Amazing food, great atmosphere, friendly staff.  This is my go to place when i land in NOL","useful":0,"cool":0},"RxkLudf5WZCVq549F7sM8w":{"text":"Breakfast review is five stars!!!  Incredible.  Incredible.  Soooooo goooooooddddd. Great ","useful":0,"cool":0},"Cegbj7fA1WM-EyG9eM9Dgg":{"text":"New place with super friendly owner and great service. Really nice location on Frenchman s","useful":0,"cool":0},"yo-WLvO_aPDjHcD_RsSfkA":{"text":"Food was excellent!  Huge portions in the jewish coonads & crabby wife dishes.   Enjoyed t","useful":0,"cool":0},"9SgBNgAYLyKbirTmfLDUog":{"text":"Just bought was recommended by one of the locals he did it 100% on the head awesome spot g","useful":0,"cool":0},"PmmW1l9_-Ghu2xjZ-ZJt1A":{"text":"Cute little neighborhood place. Put down your phone, enjoy the music, listen to the conver","useful":0,"cool":0},"bnnfmvRA_tCL82F03qag7A":{"text":"Oustanding breakfast and service. Accommodated a USNA classmate group of 10 with incredibl","useful":0,"cool":0},"NnfjSloVwTgYjn_6JIBK6g":{"text":"It's a cute little spot that has great potential but I must say the staff have by far the ","useful":0,"cool":0},"zNFqsuwRkLSJ-WP9s-FeQw":{"text":"This place saved us when Adolfo's and Three Muses were too busy to take a party of 5 for a","useful":0,"cool":0},"UUwjtbl9tQxS4UNOdL0_3A":{"text":"Call me generous but wow this place is great. We stumbled upon it and decided to give it a","useful":0,"cool":0},"XLPOpFhgmTD_2ujn65rZgA":{"text":"We walked a few blocks to this little gem and I'm glad we did. The creole slammer alone is","useful":0,"cool":0},"9dn5ufUvQuApdagOOCrhgg":{"text":"A very small neighborhood spot that does a solid breakfast/brunch menu.  I've been twice a","useful":0,"cool":0},"h_vI0hS39QBt5zVhjFu1pA":{"text":"Amazing \"Crabby Wife\"...My husband I from NYC  were walking around the Maginy district and","useful":0,"cool":0},"F0jPJPjDpsqsN3bHdSl8FA":{"text":"We had high hopes of this spot because of the photo I saw on Best Food New O Instagram pag","useful":0,"cool":0},"BfHAqf0Dd-4E1sq6awr3ww":{"text":"Probably my favorite meal on my most recent NOLA trip! Was blown away by the savory bread ","useful":1,"cool":1},"Bwbv13n__JjUl9Cnp7DaUA":{"text":"Great atmosphere. It is extremely cozy and authentic. I had the Cranky Wife and it was DEL","useful":0,"cool":0},"vWtePDpgKiBg_jWaVFIdjQ":{"text":"Lovely little place. Breakfast was delicious and so is the hot chocolate!! yum! My hubby g","useful":0,"cool":0},"yWp6ywzeoLwvTx72L9bFEQ":{"text":"the coffee cups are cute! \n\ndon't know why I decided to comment on that first, hah. but th","useful":2,"cool":1},"fS_S-OAU2TeiNNNpp-bUdw":{"text":"Love me some Horn's!  Best breakfast anywhere!  Love sitting outside and watching the worl","useful":0,"cool":0},"NCii_owGK0IbFo4migI4Jg":{"text":"Amazing ! Got the chicken and waffles and the crab ettouffe and it was out of this world!","useful":0,"cool":0},"Gwp6f1Lx6uLll7-lrl3w_Q":{"text":"Horns update.  The kitchen staff needs some refinement.  Eggs undercooked, hash browns loa","useful":0,"cool":0},"qedc91eNnvf9u2umI6dJ0A":{"text":"Always very good and reasonably priced. The salsa that comes with some of the dishes is su","useful":0,"cool":0},"12OK7QL2dlTKP3QS2zgm_g":{"text":"It is my first time in New Orleans and we ate at Horns for breakfast. We heard it was real","useful":0,"cool":0},"7oImin55U_7SdPJDHSLqEQ":{"text":"Talk about a hidden gem!  We went here for breakfast and were not disappointed.  I had the","useful":0,"cool":1},"jLdyViXOj3qPdzUgMi8riw":{"text":"Wow! Without question the best breakfast I've had anywhere. Smokey bacon, buttery grits, f","useful":0,"cool":0},"_vc-LC_KRZxrk6UuuFNoog":{"text":"I know everyone is going to say get the Crabby wife or wifey crab (I'm a few large mimosas","useful":0,"cool":0},"g8hAal6YyHFP3I7OV3sESg":{"text":"The atmosphere was cool.  The service was good, but the food was soooo salty.  I love salt","useful":0,"cool":0},"NIiToVjwn5OV0DEzdObPwQ":{"text":"Cornbread & pulled pork everywhere. Good beer selection too. A must taste!\n\nOwner was awes","useful":0,"cool":0},"yvOsBYOjwrumIGhhAPm3VA":{"text":"Owner Kappa Horn has translated her successful career in the breakfast/lunch diner, Slim G","useful":1,"cool":0},"UivZLee56fJQvP9yzwCZdw":{"text":"Chicken and Waffles was amazing, so was the atmosphere and drinks! Overall great breakfast","useful":0,"cool":0},"y8BwKjGMJ6fxrcFQx0bpRw":{"text":"This place was delicious. Quaint little spot off of Frenchman. The service was great and t","useful":0,"cool":0},"JcoLwmhOtmNxDd4-NHLbrA":{"text":"Chicken and waffles with a gingerade. Worth it. \n\nCasual place and rad vibe. \n\nBe prepared","useful":0,"cool":0},"Ik-ntnYwuASCeaDwr6kUIw":{"text":"Husband and I came to New Orleans for a little getaway between Christmas and New Year.  Ho","useful":0,"cool":0},"0alzOzJfsF1_bNrUHOZEpQ":{"text":"Chicken and sweet potato waffles with pecans and chocolate chips. Soooooo yummy! Service w","useful":0,"cool":1},"PvTrMwW6iqa4OzItQ5Gf0g":{"text":"Fantastic food and local flavors! Wife and I had the Waffle Couchon and the Crabby Wife. D","useful":0,"cool":0},"S2j4RGZewX5Iv6eplWJSCA":{"text":"Tried Horn's for the 3rd time because we had a groupon. Two burgers, 2 sides, 1 iced tea &","useful":1,"cool":0},"QzdghGqsed98s3c1sXY9RA":{"text":"Breakfast was good but service is important, which is why I'm giving 3 stars. When we went","useful":1,"cool":0},"GbgA3t4ZTi2pwE9am3j5NQ":{"text":"Wonderful neighborhood place just outside the quarter. Unique breakfast selections such as","useful":0,"cool":0},"mnxxBpEJS3p5z6E5X2ctKQ":{"text":"Just WOW! Louisiana comfort food for breakfast. Came here during a New Year's getaway. We ","useful":0,"cool":1},"8zI6sjZLxbRP4Y6jcFkk0w":{"text":"Since my first review, I've eaten at Horn's twice more, but this time for brunch. Their sw","useful":1,"cool":2},"uV3eEvQfvc53U4sBDzvzUg":{"text":"Great brunch spot. Simple and straight to point. Single serving sizes. Gets the job done. ","useful":0,"cool":0},"EV8GdNs9-KrThf5GdA9P4g":{"text":"Amazing food, super-friendly service, beautiful place! Highly recommended!","useful":0,"cool":0},"pL0cfYEWEw_WWIs-NoKmDA":{"text":"This was AMAZING. Best meal I have had in New Orleans. We had the Crabby Wife and the Frie","useful":0,"cool":0},"9lmyxlNg-zJUl1mggO_azQ":{"text":"Delicious, and no long lines!  I had the Guatemalan, and loved it.","useful":0,"cool":0},"KRFS2bGQwMPpFCXd-mMA7w":{"text":"Excellent choice for my brunch.  Place was one mile from my hotel.  But the walk just made","useful":0,"cool":1},"vtZ9S7KeQODBNF6U6Fkxpw":{"text":"When you come here, order the creole slammer. This dish was everything. A great breakfast ","useful":1,"cool":0},"SOu9cWRQNvpDgcqgf8ggxw":{"text":"I had been wanting to try Horn's since opened and replaced La Peniche, a 24-hour divey nei","useful":3,"cool":1},"wR1srzVB44zgZULwyblEmA":{"text":"Love Horn's...especially the bacon.  Outdoor dining on a nice weather day is great. Good d","useful":0,"cool":0},"-6CEbRh1IUjNOwYzoY_AEA":{"text":"The food was pretty good but service was horrible. When entering the restaurant \nwe stood ","useful":0,"cool":0},"78M5o0jOrkoy7mGVmMPXMw":{"text":"Wandered in for a quick breakfast from a street referral, did not disappoint! Great atmosp","useful":0,"cool":0},"cr6rvFdisFYLW61TK7-xbQ":{"text":"They did a nice job renovating the building. \nThe food is just ok.....over priced. \nI'm so","useful":1,"cool":0},"l-laz6h6BzuRQ43D4DzUeg":{"text":"Horn's is situated in a more residential area and doesn't seat too many people. Food was g","useful":0,"cool":0},"7VnWKWIPr4gdYsCMwsCtZA":{"text":"Recently came back from my first trip to New Orleans, and I have to say this place was a g","useful":0,"cool":0},"1z5zayuw5V6LTQYha3_iww":{"text":"Good intentions were had by all but the execution was sadly lacking.  I like the decor so ","useful":0,"cool":0},"GwXiPjNbmfABVLhf-CdKCA":{"text":"Horns is a comfy neighborhood restaurant that feels authentic without trying to be. I had ","useful":0,"cool":0},"z715QKnKIk_v4WJecanbwQ":{"text":"The location was an easy walk from our B&B. We had our first dinner in New Orleans at this","useful":1,"cool":0},"1zUOaetJO8yWuymeR6LnRQ":{"text":"I was going to meet someone here today for lunch but they were delayed so l had a nice qui","useful":2,"cool":0},"FhhrL8Qe1wqusvB5hitveQ":{"text":"Great neighborhood breakfast stop.  Visiting NO for the weekend and staying nearby.  Excel","useful":0,"cool":0},"UU4H9Ds8Sy_gy2DHVo8iXQ":{"text":"This is the Homey Cozy Restaurant in NOLA\n\nWe were planning on going bar hopping but ended","useful":1,"cool":0},"yN3DDJ0JNa8jxnVt3oHivg":{"text":"Saw this place had awesome reviews so we decided to check it out.. we should've just gone ","useful":0,"cool":0},"6IyfwR6KfAh_bqjlTfnOEA":{"text":"Erica was so friendly, great service. Horn's is a real hidden gem just slightly off French","useful":1,"cool":0},"Ua-Qa-OhDm0LiXy9CcfeLQ":{"text":"WARNING!!!! NASTY SURPRISE!!  I don't have a problem with restaurants having a policy agai","useful":1,"cool":0},"iRv-kx7uropg2ZcWbbFIFQ":{"text":"Steamed milk with your coffee, great portion size, good prices, attentive service. All the","useful":1,"cool":0},"NsoRMu9DesD9iq0loLvpJQ":{"text":"The pulled pork on top of the sweet jalapeno cornbread was amazing. The pork was so yummy ","useful":0,"cool":0},"dTKYi6tE2DypfU03Ks_k0w":{"text":"The food at Horns is very over priced and not so great but my main problem with this neigh","useful":0,"cool":0},"597bWd3pXn_3gqFXlyrbtA":{"text":"I've had breakfast at Horns twice and I would definitely go back for a third! I love my ne","useful":1,"cool":0},"fjC0di4jhC5T7OSjhOjLPg":{"text":"We really wanted to love this place because we had heard great things when it first opened","useful":0,"cool":0},"542cVBX3Ptv_Gku1xtvg6w":{"text":"I had the Creole Cuban sandwich: pulled pork, ham, cheese, creole mustard, and pickles. It","useful":3,"cool":2},"pJAMiMkKNn7EMQrAxUUyaQ":{"text":"Sweet potato pancakes! I just love them in my stomach. Customer service is fantastic.  Act","useful":3,"cool":2},"XCErRhNscQTHdOGrU-djtA":{"text":"I was really looking forward to trying this place. The atmosphere was great and the staff ","useful":1,"cool":0},"M9rcorfoY_3_rEDfMWIXvA":{"text":"Hands down the most delicious food I've had in NOLA. The waffle cochon was the bomb! I wil","useful":0,"cool":0},"e6DTwTr-H2ZrfrkXHyVx8g":{"text":"Disclaimer: this was the first place I went to when I arrived in NOLA so I was a bit disap","useful":0,"cool":0},"5XY364TcK9zdiFYETTNsDw":{"text":"Unreservedly excellent. My friends and I were visiting from California. We had three morni","useful":0,"cool":0},"CEow5mRoMlBaoMEWguZEGA":{"text":"I get up early So was there right when they opened at 7am and they were friendly and welco","useful":0,"cool":0},"b0tz8d1a6SZZX_MIVQnb_Q":{"text":"we were seated quickly but it took 45 min for our party of 8 to receive our food.  the wai","useful":0,"cool":0},"hPrZAqga5s7CUf_qN9dZ3w":{"text":"We ate here this morning -post wedding festivities because it was within walking distance ","useful":2,"cool":0},"FppyyzwKJtqSdsS1B0wf0w":{"text":"Came here for brunch with a friend while I was visiting New Orleans. First off, the wait w","useful":2,"cool":2},"2Zrsrt1ApyW1dr8Os0Eq8g":{"text":"We loved this neighborhood spot. The coffee was delicious and the food divine. The oyster ","useful":0,"cool":0},"9_EvQGVEzfW2WIZ5yq0KFA":{"text":"Perfect breakfast spot in NOLA! So great we went twice!  Bottomless coffee, traditional br","useful":1,"cool":1},"OYTE3DXxEN0aQ_dhrrERXA":{"text":"Amazing food with fun staff and unique atmosphere.    Food with love at this place.  The c","useful":1,"cool":0},"4-4w1E1ntz0MWHh9ruybHg":{"text":"We just tried dinner at Horn's. We had the grilled artichokes, cheese plate, and veggie st","useful":1,"cool":1},"fe5SAZh-RicRihNcS_LEnw":{"text":"Table of 7 was only a 30-40 minute wait at lunch time so can't complain about that. I had ","useful":0,"cool":0},"FJokiBjHs6DEAoquTQsCNQ":{"text":"It's hard because I really really wanted to like this place. My main issue was the flies. ","useful":2,"cool":2},"t1euSrBot5h2V776Eq4gsg":{"text":"Horn's is local New Orleans. This place is quirky and off the beaten path. The old wooden ","useful":4,"cool":2},"iPUz8yRfMCNQHVA8LZ3-CA":{"text":"Food is pretty good.  I think it's better spiced at Slim's uptown, but overall a better at","useful":0,"cool":0},"zBHRWETdjTBU_0cw6etoGA":{"text":"Sorry to say, but me and 3 friends went to Horn's for dinner, and it was not good.\nThe cra","useful":0,"cool":0},"uL8QpRhEiEfP1Y0-bKvupg":{"text":"Came in for brunch with my boyfriend from VA. Will have to give this place a solid 4 stars","useful":1,"cool":1},"iEvvRgELqU549vuRjFCwOQ":{"text":"I love this place for breakfast. Delicious food, creative and healthy offerings, and the o","useful":0,"cool":0},"9OpC4PTA1HkOLW_VoXX2RA":{"text":"Great local spot, full bar and nice people. In town for 3 days and I've been here 3 times,","useful":0,"cool":0},"sVO-GsBVH9Shwo0fYZc1Gg":{"text":"Amazing food, great coffee(I don't say this lightly, I'm from Seattle), comfortable late l","useful":0,"cool":0},"0CdwiHSoZkxLjoVMWrYcOQ":{"text":"We saw This place while we were in the bike tour. It seems like a local place, It is far f","useful":0,"cool":0},"hCuYjdKXg1R8S7pUmGhsbQ":{"text":"Oh my goodness. Best coffee in town. Wonderful staff and delicious food. We went back for ","useful":0,"cool":0},"-qlZHTjWGFhC1K7m0zLQEw":{"text":"I'm bummed to write this because our experience last time at Horn's was great. \n\nWe arrive","useful":0,"cool":0},"29cS40iOF71YY69mbvW9JA":{"text":"I ordered the Crabby Wife! It is absolutely the best breakfast I've had in New Orleans. Th","useful":0,"cool":0},"aViNcJ3K-m8l_uvY1PfGyA":{"text":"This place is gorgeous it's awesome , I was in town for the Essence festival and meet up w","useful":0,"cool":0},"tWbocGs1K-UKGbXhFLDhSw":{"text":"What an INCREDIBLE experience. I was fortunate enough to have a pretty New Orleanian gal t","useful":1,"cool":1},"eloJtLoCC6MIVnzTfUsQHQ":{"text":"This place is understated but has great food and large portions. It takes a while to get y","useful":0,"cool":0},"rf8IuFCfhY4ertrqroKo7A":{"text":"Glad to see Horn's open and breathing new life into a long-standing diner location in our ","useful":0,"cool":0},"2qwCBPcJAxmVjFnUOesMeQ":{"text":"We have been back several times and we both very much enjoy the breakfast menu. Gluten Fre","useful":0,"cool":0},"3shOMYHDMv86Ojh_m68zng":{"text":"Best Eggs Benedict, hands down.\n\nMy friends and I take all of our out-of-town friends and ","useful":1,"cool":1},"JyPIaSekFNw4S8tekCMZnQ":{"text":"Literally the worst customer service.  I wouldn't know how the food tastes because we didn","useful":1,"cool":0},"EsRnAMRF-xLCLwGYOJonKg":{"text":"This is one of my favorite local breakfast/brunch/lunch spots. Especially when I'm on this","useful":0,"cool":0},"YCJjmRSqqDLpJ1zEYmf_Iw":{"text":"Came her for breakfast with my husband one morning during our trip to NOLA. Cute place, ve","useful":0,"cool":0},"vhVUb2tSQLclwOqz1Z6RKQ":{"text":"Visited this place on the morning of 9/2/19.  Was seated quickly and then it went down hil","useful":0,"cool":0},"tUuTwbvTIpuRsIPUBGe1KQ":{"text":"Loved it! We were looking for a place to eat with local food. It was a nice atmosphere and","useful":0,"cool":1},"aGEVOexdOcRe4alXybhdgg":{"text":"Really enjoyed this spot.. Mac n cheese etoufee is a must. Temperature is just right and i","useful":0,"cool":0},"cgUvqtyil74CczmwAAdGBQ":{"text":"I'm from Chicago and this has to be the best breakfast spot I've ever had! I got some vegg","useful":0,"cool":0},"rUtMzdEbzkiuokM_p6WvOg":{"text":"Amazing place!! We had the waffle corchon and it was off the charts delish!! Also had the ","useful":1,"cool":1},"q5HHza2Wma8nblFMuczxYg":{"text":"Delicious breakfast and a generous mimosa. I had the bomb (scrambled eggs, spinach, tomato","useful":0,"cool":0},"ZTBzKej4ragJGuMLMKpsSA":{"text":"Service très agréable dans un coin sympa.\nLa limonade est super concentrée en goût mais bo","useful":1,"cool":1},"Dpd3LlmBxMKSiHuOOjznPg":{"text":"Jewish Coonass is a MUST have for breakfast! Cute as a button house turned into a restaura","useful":0,"cool":0},"M7-n6vI1xD0jJGCLbSjL_w":{"text":"I visited Horn's for the first time yesterday. The drinks were delicious and the bartender","useful":0,"cool":0},"skAtJmNpgOC4JIHoD2DzcA":{"text":"Took a 30 min walk from the French Quarter just to have Sunday brunch @ Horn's. Let me tel","useful":3,"cool":0},"LM9wfZxhiHH5Q2xL08qZFw":{"text":"Excellent food but also very nice atmosphere while there. The staff was friendly and helpf","useful":0,"cool":0},"NJhvy1mJo4DRs1S0pD1HBA":{"text":"I had the Dr. Horn.  Really good pancakes and bacon.  Cozy local feel to the place.  Very ","useful":0,"cool":0},"Wimj6KRzDEIJQXGnTp6bsw":{"text":"I'm over this place! Used to love it but the service is terrible- we always wait forever f","useful":1,"cool":0},"Jl5J1OND3to-iVeZvHdGFQ":{"text":"Went here for a birthday brunch. Food was awesome  highly recommend the Crabby Wife. Great","useful":0,"cool":0},"VZrmFvua2gGNfEYcbGwOZg":{"text":"Favorite brunch gem in the city! Hidden but well known. The service is always amazing, the","useful":0,"cool":0},"xX7_hCTILLC2Y_KqFhYGTA":{"text":"Loved Horn's! We actually went here twice during our trip since it was right up the street","useful":0,"cool":0},"8RNLFCQYjpK9q9kge-uQBQ":{"text":"Love this place. This is definitely off the beaten path. I marveled at how laid back, down","useful":0,"cool":0},"y-czMVkJYSISv8o4Q5uTqA":{"text":"If you were considering going to Ruby Slipper, just keep walking until you get here! The E","useful":0,"cool":0},"AJCo4RWlZqno75NO1_bpLQ":{"text":"The Crabby wife was amazing! Favorite breakfast in Nola. My husband had the breakfast sand","useful":1,"cool":0},"fKV9A_l7Yvv8QI6uqUwSIA":{"text":"The brunch was soooooo good! I got Crabby Wife and my hubby got Egg Dauphine. Both amazing","useful":0,"cool":0},"DSrLjH00J7uFbPGMmxN_uQ":{"text":"Top notch food and service. I had the Étouffée stuffed omelette and it was amazing. I saw ","useful":0,"cool":0},"oFdZpDOtgnJedNtUfu7VaA":{"text":"Horn's is a quaint restaurant situated in an old southern house. My friends and I were pro","useful":1,"cool":0},"e8MMi1jvvOnJjlI_DnpMcg":{"text":"Wonderful neighborhood restaurant. One of the reasons we chose the Marigny as our home. We","useful":0,"cool":0},"LqQX6077PzGukTHreOtvuA":{"text":"Horns was such a great place for breakfast. The food takes a little longer then a normal b","useful":0,"cool":0},"VEsOr9Pb2xwlBQdU6hJ7wQ":{"text":"On a recommendation from a local, we tried Horn\"s for brunch and it was awesome! It's a qu","useful":0,"cool":0},"9L1gUAE3f72TWyWBLcjyLQ":{"text":"Absolutely wonderful. Chicken and waffles...everything was great... one of the best meals ","useful":0,"cool":0},"6aBFeBFf3wOXdIVDVaaKOg":{"text":"This is a neighborhood gem, especially for breakfast or brunch. Corner \"cafe\" type restaur","useful":0,"cool":0},"pPtc399C-rHR1u5DuIUE3Q":{"text":"OB-SESSED with this place. Found Horns by chance looking for a breakfast spot near our BnB","useful":0,"cool":0},"ks4STUEafOLT5nwT4xaLAg":{"text":"Great locals spot with relaxed vibe.  The service was fantastic, with nothing but smiles a","useful":0,"cool":0},"b0CUIxMcARVa-iBfzcmRJA":{"text":"We had the savory bread pudding and the carrot, ginger, scallion and egg waffle.  Both unu","useful":0,"cool":0},"Vicoq7NlWVvvlIhX6u_FFQ":{"text":"This LGTBQ friendly restaurant has a great laid-back but funky vibe. The menu is incredibl","useful":0,"cool":0},"JNTi6M4QGtaxWnkvR6hkCw":{"text":"This place is amazing and a GEM in this area of New Orleans. We came on a Tuesday morning ","useful":0,"cool":0},"T7i1GFlPsy0t8-J-Q4dpSQ":{"text":"Delicious!!! But then again anything Capa does in the restaurant business you know is goin","useful":0,"cool":0},"bcncgQ7P1jnNd-tp4RGB1A":{"text":"Delicious food and fun staff. Had a great time there with my Jazz Fest crew/family. Won a ","useful":0,"cool":0},"DNoKj5p7E-ITT3tJ0OByCA":{"text":"First time visiting NoLa, came here for breakfast at about 9:30 on a Saturday with my bras","useful":0,"cool":0},"Mq066LkeXITxccHZMxI9sA":{"text":"I don't even want to tell you about it. I just want to come back here every time I come to","useful":1,"cool":0},"OJiLklmiorY7G4kW-CtpWQ":{"text":"Excellent meal.  Home cooking refined.  Waffles Cochon was delicious.  The waffle was like","useful":0,"cool":0},"RBz1ubcxvIMvUIv8FhjbtA":{"text":"This little place had awesome Creole breakfasts. I had the Jewish Coonass meal!! OMG was i","useful":0,"cool":0},"s5I6_NgjatpT_diMp5oHiA":{"text":"When you seat a table, give them menus. SCRATCH THAT, I shouldn't be so harsh- I know how ","useful":1,"cool":0},"Vbloji-eJgmdxd6t84ikxQ":{"text":"I am going to keep this review pretty simple. The food and service is excellent. If you're","useful":0,"cool":0},"newmi5JhiSUzFmQv3sfg7g":{"text":"Nasty. Nothing more to say.\nReally did suck. The food was horrible and the place is dirty.","useful":1,"cool":0},"3PhDK22rDvRcECL90LHypg":{"text":"The coffee mugs are super cool. The wait staff were super friendly. The restaurant is in a","useful":0,"cool":0},"xrDmHrQOI7EZ6_l5S_QHzw":{"text":"I wish we had the great food experience others have had. A solid F+. I ordered scrambled e","useful":2,"cool":0},"Nzc96RHQvw-ek2CMP4AalQ":{"text":"I picked this place mainly because my poor friend was in desperate need of some food that ","useful":3,"cool":4},"mXIrDRM5vOYtmG66xMMnoA":{"text":"Best breakfast place in the area. \n\nCrabby wife. Order 5 of them... it's etouffee heaven.","useful":2,"cool":0},"-8w_14UZSLaXLtZS7vfcBA":{"text":"I went to Horn's twice while I was in New Orleans for a week. The food in New Orleans is o","useful":0,"cool":0},"ofdUUx-acXeLFATw6NLPeQ":{"text":"We loved our experience at Horn's. It's a great little neighborhood hangout with an eclect","useful":0,"cool":0},"R6vHFKNVPMDuv_XDtmLL-w":{"text":"You've GOT to stop by!!!!\n\nThe sweet potato pancakes with spicy chicken is amazing, perfec","useful":0,"cool":0},"msOjiyjFxcrzYWlOIALN1A":{"text":"One of my favorite place to eat in my neighborhood. From the food to the staff - all of it","useful":2,"cool":0},"ygE8oLdia_52YRRrCIkx_w":{"text":"Horn's has a great atmosphere! The bar is very cool although not terribly long.  The food ","useful":0,"cool":0},"EItwR04Mw0zpPfAD6AohQg":{"text":"This place was amazing. Amazing food, amazing atmosphere, amazing people. It was sort of b","useful":0,"cool":0},"VT8AGIxtDThM9wXIADFAaA":{"text":"My friend and I headed here on a weekday on a whim, and it was such a good decision on our","useful":1,"cool":0},"OTl_QAQM9NV8F34Q99QJug":{"text":"Eat here. Daily. Local flavor off the beaten path. Best breakfast we had while staying in ","useful":1,"cool":0},"LEiqjdBx01K8j5CbakF7Gg":{"text":"Oh my oh my!!!!! I had the egg Dauphine you have to have it is just amazing. I came with a","useful":0,"cool":0},"zpbTRacwqboQ457lJQyZcw":{"text":"Serves lacks greatly. After 2 different staff stood next to us and looked at both of us wi","useful":0,"cool":0},"jzbqM6H0CDisY8j6mKuKpQ":{"text":"Food is decent but the staff clearly doesn't want to be there and definitely doesn't want ","useful":0,"cool":0},"IBX9sm0N9Hle0oQSjzYqJA":{"text":"Holy brunch perfection. Chicken and waffles are a top dish of all time. Had them 5 years a","useful":0,"cool":0},"TZuFTBdSel3F8rQEMtW0dA":{"text":"I had been pretty hype to get here and when I did, I was underwhelmed. My best friend said","useful":2,"cool":1},"te1ZKLWDmCRzCFGg-L0jIQ":{"text":"Excellent place for breakfast! just get there early like my wife and I did so there was ju","useful":0,"cool":1},"eaJQM8Y5VoXJcNaFi6HyYg":{"text":"I've been in Nola for 8 days and this is the BEST meal I've eaten the whole time. Deliciou","useful":0,"cool":0},"GW7XnpMnhxQBA_qbmQ48mA":{"text":"A neighborhood haunt - love the chicken and waffles, the Sunday brunch with either bloody ","useful":0,"cool":0},"WTZ63bpORng3CFtSTTi1oA":{"text":"I tried Horn's Saturday night with a group of friends. We went when it was the previous, L","useful":0,"cool":0},"hYZtfUtU2FGK1uUvr806XA":{"text":"This place was completely outrageously awesome! Got the crawfish etouffe with Mac and chee","useful":0,"cool":0},"3Il-rQkgNDwyUL9emWoLYg":{"text":"Breakfast was pretty good and the server was very nice. I think the hash browns were a lit","useful":0,"cool":0},"ioYw7ee4ooab_MYKkpVnDw":{"text":"This place is a spot to go back to. And back to. And back to. Comfortable and nice service","useful":0,"cool":0},"nqwT5ZXu8h-myTv6n-5bHA":{"text":"I Airbnb'd down the street from Horns and loved how convenient this place was for food and","useful":0,"cool":0},"BvEkEXYk3UXpb-ISkljvDA":{"text":"The crawfish etoufee over hash browns was the BEST.  full of flavor but not over spiced.  ","useful":0,"cool":0},"ucnXJqZKNthfa9ntKJ0bMg":{"text":"Pros: Standard food in a good environment. \n\nCons: Prices didn't match with what they wrot","useful":2,"cool":0},"eib-3Zjs6FRwsmYCYKOekw":{"text":"Great local spot.  Actually one of the best.  Wonderful food and you can't go wrong.  Oyst","useful":1,"cool":1},"HjdVicGs03Yyae5t7AZmug":{"text":"My first experience at Horn's made me really appreciate the New Orleans experience and I'v","useful":5,"cool":2},"NhhdYZ1bObj9UDgfR6NmAA":{"text":"I have eaten at Horn's four times since they opened in the neighborhood and each meal has ","useful":0,"cool":0},"LTAQZH3HYJ9XDNcrXZiQTQ":{"text":"I am only giving this restaurant one star because I can't give it zero. \n\nI traveled to Ne","useful":8,"cool":1},"N9MBOtNHXLIwsYLzCAOx-g":{"text":"Nice little cafe with solid brunch options. The bomb (scrambled eggs) was good as well as ","useful":0,"cool":0},"fcfbaPXX5TV4EjWdYq1l6Q":{"text":"Went for brunch and ordered the eggs dauphine. So freakin good. Eggs on top of pulled pork","useful":0,"cool":0},"J0ocmqc5jl0gkMoVmRe2Hw":{"text":"Problem was service, service, service. We waited 30 min for our appetizers, another 25 for","useful":0,"cool":0},"51qaAD86xPG47HQ8zAbPXQ":{"text":"The charm hits you right away when you enter this local gem tucked away on Dauphine street","useful":0,"cool":0},"ymudvBWwSgSmsu56_r06HA":{"text":"We came here in desperate search of hash browns. The vibe inside was really cozy.  It felt","useful":2,"cool":1},"D28mD-n_bzBiZP6xdfR4vw":{"text":"This review isn't for the food,  it was excellent. (Try the jewish coonass. ) Nor were we ","useful":1,"cool":1},"-brRYBzeBl1OEr8xoVEQjQ":{"text":"What can I say, I've been a fool! I have run (literally) passed Horn's for two years alway","useful":4,"cool":1},"uqZup2kystTC3vt02mFiZA":{"text":"The food was good and unique to other brunch spots in the quarter. Service was slow and sp","useful":2,"cool":0},"6FPK2jCmx19nGGo5cehD4w":{"text":"Very good! Probably some of the best chicken and waffles I've ever had. Their sweet and sp","useful":1,"cool":1},"L2q1USGCNCrfRLXfbsua5Q":{"text":"This was our second visit to Horn's. This time, we took a Lyft there -- smart move after h","useful":3,"cool":1},"p0i4OYZ9NZ87l9p81RIbQQ":{"text":"I had some really great deep fried seafood in NOLA, in particular I was raaaaaving about t","useful":1,"cool":3},"iLxWHg6v8YPYRoMD95TUYg":{"text":"Horn's is everything that makes New Orleans such a special place to dine.  Is this quintes","useful":17,"cool":17},"QMXXbfDCNXIcvfAKyY5PRA":{"text":"Negative five stars ! They tried keep our change. They kept in forcing a Covid vaccine I'm","useful":0,"cool":0},"piBmMFClx99Q1Pn_AnkSMw":{"text":"Highly, highly recommend this place! We found it on a whim and were pleasantly surprised w","useful":0,"cool":0},"G60gyqDSEdELfER3bq_8GA":{"text":"The food was GREAT and came out fast, but the customer service was disappointing/just plai","useful":0,"cool":0},"8YQDr8uSNZMuQrPsfNOL9Q":{"text":"Yes, yes, yes. My wife and I went to Horns on one of our first post-pandemic trips to New ","useful":0,"cool":1},"X7td1cJCenwQlaJIdax8Og":{"text":"We love this place! It's small and it gets busy, so go early or you will wait. Everything ","useful":0,"cool":0},"v6BvHSBce1Te2w8xIpds5w":{"text":"This is my new favorite neighborhood breakfast place in New Orleans. The crawfish at two F","useful":0,"cool":0},"70-CJGgL4xymOC9Xsa2MRg":{"text":"Horn's is definitely worthy of a slot in your brunch rotation especially if you take advan","useful":0,"cool":0},"l4i2qtErCHvOxwy--Z0Kaw":{"text":"we all stopped eating & just looked at each other in amazement after 2 bites of the crawfi","useful":0,"cool":0},"228BDTd5AyaKwuFo2V5obw":{"text":"I wish there was the option to give no stars.  We had a terrible experience at brunch here","useful":4,"cool":0},"vSrTWjVWQppFjql0rbBNeA":{"text":"Horn's has it right on the money!\nFrom the atmosphere, to the staff to the music to the fo","useful":1,"cool":1},"jTLwtDypUpRwIpgQzWxrag":{"text":"Came to Horn's on my first day in NOLA (first time ever in this city). Totally understanda","useful":0,"cool":0},"m-kVE_wQsRDbSn7s6elnlA":{"text":"The food here is good. The imaginative selection is good. The range of selections for brea","useful":0,"cool":0},"nkfaFdH9TfRxXXTak9jyyA":{"text":"Omg! The best food I have EVER had. I ordered the Waffle Couchon (drooling)!!!!! \n\nI won't","useful":0,"cool":0},"oW9G9tKdVWhhy7_nB0h-ww":{"text":"I am so glad we decided to be adventurous for brunch. The food is very tasteful. The custo","useful":1,"cool":1},"ZIEkl0qxQC1u0U1gaOqaiA":{"text":"Not in quarter but short walk.  Had pancakes, eggs and sausage patties.   All very good.  ","useful":1,"cool":0},"bxwaJG6nhDw7Yw-v1YbGxw":{"text":"Wowowooww. This place is the spot for Cuban sandwich. I grew up in Miami eating them but d","useful":2,"cool":1},"aR-bvBLwElxSNRKMU4rwJg":{"text":"Omg first stop and it was amazing . Great food great service !!! The Crabby wife out of th","useful":0,"cool":0},"_6qlN2Ptq4xctCcbM8PvdQ":{"text":"Really neat hole in the wall. Very chill and interesting decor. Got the seafood platter an","useful":0,"cool":0},"UV1AzVkpT9L0g4QudJ-Q_g":{"text":"Cozy neighborhood spot - off the beaten path.\nGrits & Crawfish Étouffée is the best thing ","useful":2,"cool":1},"9Az70RLebLBEPPpl9sbd2w":{"text":"Stumbling around the quarters, late morning we found Horns. All the food was great, but I ","useful":0,"cool":0},"zNkZIJuutJRqs74PMcuVmg":{"text":"Horn's was a great place to have breakfast. We chose two among the many ways they offer eg","useful":0,"cool":0},"J75OkfhpARObfE-aiAYb6g":{"text":"Went here for breakfast... Got the \"brisket and grits\" and the \"Jewish coonass\" ... The po","useful":0,"cool":0},"ZLnRxvXhf2G8GTxiIixfBA":{"text":"Great atmosphere and great food. parking could be a little tricky because it's in a tight ","useful":0,"cool":0},"jgxPy9GqJJTG6y1-o7QvWw":{"text":"Can't say enough great things about Horn's. I had the Crabby Wife and it was fantastic. Co","useful":1,"cool":0},"izlq_0PcxV251B6V4jXtnw":{"text":"Great food!!! Must stop if your in the neighborhood. Best catfish and home made Mac & chee","useful":1,"cool":1},"sJAsT8ronwc-4MXm4l9uRQ":{"text":"Horrible employees and the bartender Koby was the worst and super disrespectful. Place I w","useful":0,"cool":0},"gwR-2fNUknVhdiXI--M3EQ":{"text":"If you are looking for authentic, tastes like a local's Mom made it breakfast, this is the","useful":1,"cool":0},"JLYeHCvMysDm1gl7sBh8KQ":{"text":"My favorite brunch spot hands down!!! Tasty drinks, delicious food and lively atmosphere!!","useful":0,"cool":1},"j3YL9q3FrYpkIsF5VqeULg":{"text":"Found this by chance one night, great atmosphere and so far all the staff have been great.","useful":0,"cool":0},"rqwuCItxAOJ5WixVYo0gQw":{"text":"This place was amazing! From the sweet staff to the wonderful food!! I wish I could've eat","useful":0,"cool":0},"TilRguCOJ1_cXok1Z5kSgg":{"text":"Love this place, went to the one in Mareny that was close to the slipper, delightfully exc","useful":0,"cool":0},"yKGJBci8EWQn-2bpbqpR8A":{"text":"Nice little family owned Marigny spot. Food was good, drinks were strong, service was top ","useful":1,"cool":2},"0o7kGyp2YKXTVSxm2ACEiQ":{"text":"I only gave them 3 stars because the wait was less than 2 mins and my waitress was extreme","useful":1,"cool":1},"W9Dks06UqI46vaEUcfIu-A":{"text":"Fucking love everything. - especially the staff. Ty, Aimee, Darell, Carrie, Mary you guys ","useful":1,"cool":0},"m6or-7RGYz9BkPvZs_SkXw":{"text":"Our air b and b host recommended horn to us. This is a cute little joint a little outside ","useful":0,"cool":0},"wCvRlsabHYMOrVG8YyBsRQ":{"text":"By far my favorite breakfast place in NOLA; I recommend the Eggs Dauphine. This sweet corn","useful":0,"cool":0},"VHaVAxwqRN6I1i47-4OACQ":{"text":"Four of us blindly wandered into Horns for early breakfast. Slightly out of the way, but c","useful":0,"cool":0},"akF80BhYrRmGVF_RQAgy7A":{"text":"Great lunch at Horn's! Nice to hang with friends and family. Large portions and quick serv","useful":1,"cool":1},"tF-cgmTALoFz4aaAR8cK2g":{"text":"Phenomenal breakfast!  Jewish Coonass and the Crabby Wife are both solid options and you w","useful":0,"cool":0},"LT7OSnZr6YUuQ3kRJqsYQw":{"text":"What a great place for brunch.  We tried a bunch of items and shared that's the best way t","useful":5,"cool":5},"7TrOnkwLzqYd3fONWPiYQg":{"text":"Horn's is one of the hidden gems in the Marigny. Unique beverages and bites combined with ","useful":1,"cool":1},"QJr4aZueWlHZeGFPfBj2Zg":{"text":"I always love when I find myself in the Marigny/Bywater area because there are so many goo","useful":9,"cool":6},"ERsImyElEM19Q2FfBoAWAA":{"text":"Brought to us by the same folks that gave us Slim Goodies this is a bit more of a nicer re","useful":3,"cool":1},"qKlMo7PBgzkyGro2m1RGow":{"text":"I was just walking by when I noticed a few tables out on the sidewalk and people laughing ","useful":0,"cool":0},"qAe7tdVzlD8phgwRwTDG7Q":{"text":"I stopped in here to kill some time and it was a pretty cute spot. Felt like a very local ","useful":0,"cool":0},"pcZQBvM686aV5Bc-a6nQiQ":{"text":"Excellent food and friendly staff!\nWe ordered a spinach, mushroom bread pudding and pecan ","useful":0,"cool":0},"KNOLE_BORlpfu33e2Hj7bA":{"text":"Great vibe, very nice decoration, and amazing food! I wish we could go back to Nola just t","useful":0,"cool":0},"gziCbyuXdgeWWmT39kOISA":{"text":"Horn's is an amazing neighborhood restaurant at the corner of Dauphine and Touro St. They ","useful":0,"cool":0},"mw-qrItGa_GpKm0IgpGbxg":{"text":"Great corner restaurant. We had been walking for quite some time and decided the next plac","useful":0,"cool":0},"d89o_PzJq0TbRhHIH9TEaA":{"text":"Best brunch of my life.  Creole Coffee and the Crabby Wife.  Excellent service and nice pe","useful":0,"cool":1},"ixMRQMKx2yXt50dGUqqm-A":{"text":"Excellent breakfast! Oyster's Benedict was amazing!\n\nIf you find yourself looking for some","useful":0,"cool":0},"mI7x2IFJLKLOFVuLl6eWiQ":{"text":"The Waffle Cochon is to die for. I go back every time I'm in New Orleans just to get it. I","useful":0,"cool":0},"N1exPMkKWMBXFu9YZ0laUQ":{"text":"I just want to start by stating I never write reviews. This place is one of the greatest b","useful":1,"cool":1},"uKZRNPYBaSKB5rCRNjv_pQ":{"text":"My friends and I are in New Orleans for the first time. We relied on Yelp and since Horn's","useful":0,"cool":0},"N9-7jzEr3V1NApjv45gBcQ":{"text":"Bang for your buck: 7/10\nQuality: 10/10\nService: 10/10\nAmbiance/Location: 10/10\nOverall: 9","useful":1,"cool":2},"Z5nkV6S5cXqsxGhgDhtRMQ":{"text":"Loved it. Get the creole slammer!  Nice environment. Great service. No wait on a weekday a","useful":0,"cool":0},"g8jft0t6wZIt_WVqMLhlAQ":{"text":"Roach on our table.  Roach.  On. Our.  Table. \n\nNot on the floor, on our freaking table.  ","useful":3,"cool":0},"wbgNVolQNqPegoBWUdZNzg":{"text":"Seriously the BEST dish. Probably my favorite meal of all time and I LOVE to eat good food","useful":0,"cool":0},"8CDvbP4CFw_j9CCNSa5fug":{"text":"I walked in here at 6pm with the intention of having a snack and a beer so I ordered an Ir","useful":1,"cool":1},"pN7ozAbrQsvYs9kZOBvbsw":{"text":"Can't say enough great things about Horn's. We were recommended Horn's by a friend who sai","useful":0,"cool":0},"Cf0A_6RfP_HMQ29xvuaQ1Q":{"text":"My husband and I used to live on the same block when it was La Peniche (which makes Horn's","useful":4,"cool":0},"EGg0tJ1i6sJ2tPuz9vI6kw":{"text":"No vegetarian entree option for supper? Then suggest i just get an appetizer? No thanks.","useful":3,"cool":0},"Kz01f57aRyLQl5QJmhcCWA":{"text":"This place is amazing!!!!  We got there close to closing time, the two ladies running the ","useful":0,"cool":1},"tisE25UEID4vsroFUMFdQg":{"text":"Solid breakfast option. Friendly service. Had the egged ben swop out biscuits for rye toas","useful":3,"cool":2},"e6cERmnQq5a5NOcKTtOoDQ":{"text":"I stumbled upon here after a long walk around Esplanade and the breakfast dish that I orde","useful":0,"cool":0},"8gI0y18ieWCmanyQkSYV4w":{"text":"Very Good bagel, they were out of my favorites but that's life after Ida and Covid isn't i","useful":0,"cool":0},"ba3r_zOEw3wUQyAaMtODEQ":{"text":"Simply delicious. We got the tex mex slammer, crabby wife, Jewish coonass and a Cuban. And","useful":0,"cool":0},"t6_kAAftu9nRIoyHyfoWqw":{"text":"2nd review\n\nI magically ended up here when other group plans fell through.  The bruch/brea","useful":7,"cool":2},"8hMEXYNBMIxTbnjDAKMfsw":{"text":"My girlfriend and I have been down here on vacation for a couple days now. This place is t","useful":0,"cool":0},"R0153NCPVXfYyakSDSTwzw":{"text":"This place is -THE SHIT-.  They sat our large group outside on a lovely Sunday midmorning.","useful":0,"cool":0},"IBb8oTl4AmLc_0C5TrG_rw":{"text":"Came to this divey establishment for our first breakfast in NOLA. It is pretty small insid","useful":1,"cool":1},"N05JUIm2Uy3PdwRMLXtifA":{"text":"I'd like to give a 2 and 1/2 stars. The pancakes and waffles were good. We ordered the cra","useful":0,"cool":0},"rq3KI-aywv5jJi05h4DMbg":{"text":"I've been living here for years and have been cheating myself by only going for breakfast/","useful":1,"cool":0},"eYRfMnW9l_y3VB6t-57acA":{"text":"You are going to love what Horn's puts in your mouth! Everything on the menu has tequila. ","useful":1,"cool":0},"viV_s3Wv2UeThxzBucNyQQ":{"text":"I had a double mimosa, the Crabby Wife and Pecan Waffle... The food was amazing... The mim","useful":0,"cool":0},"JJZmWP4DScdYo5p2W_0nCQ":{"text":"Amazing food and a really good Bloody Mary. Our service Mikey was so nice and made the exp","useful":2,"cool":0},"_kporIlSh5bkjJoYtT3wlg":{"text":"Food was very bland.  And service took forever.  Kitchen didn't seem to communicate with t","useful":0,"cool":0},"CHutOxo28-Oqiawhm86tpQ":{"text":"awesome place. only stayed in marginy for 2 days and it is so good that we came here twice","useful":0,"cool":0},"lxWNQMck0_8TuYCEIB2xUA":{"text":"Great tucked away breakfast joint way off the beaten path.... good mix of options on menu ","useful":0,"cool":0},"jhtlrFrLeDl96X_P7_ZONg":{"text":"This place is a gem! The food is so so good- we went for brunch and had a crab cake Benedi","useful":0,"cool":2},"SeTFfHXGq9RLbiHXVE-gdQ":{"text":"Listen, I had a great brunch so if you or someone you know doesn't agree, give it another ","useful":4,"cool":0},"zJl7J50TE61e8qAV09vifg":{"text":"We loved the chicken and waffles. HUGE portions. We saw lots of people leaving with takeou","useful":0,"cool":0},"6TtqAXb3wpQGDe2ZazmuLg":{"text":"Came here for breakfast. This was the best meal I ate during my entire stay in NOLA. I ord","useful":0,"cool":1},"HmdctNx_N_ai_6_Rw-KgyQ":{"text":"Yesterday was my second visit to this cool, funky little corner restaurant.  I had the Jew","useful":11,"cool":9},"z8xspeZYUNr26whg8fFbIw":{"text":"This place was walking distance to our Air BnB so we decided to check it out. I ordered th","useful":1,"cool":0},"GN8_sHTe5jT5VkvOGu2p0A":{"text":"Food was amazing and service was super friendly! I had the gluten free waffles and they we","useful":0,"cool":1},"v_U74Qez6DnbZmo0ne3-Hw":{"text":"Wow! I had the Crabby Wife and it was to die for. Two crab cakes with two poached eggs smo","useful":1,"cool":1},"OIcx9WXG1l3DpiL1vqpyEw":{"text":"Went here for dinner after a job interview, kind of a victory supper lol. I walk into the ","useful":4,"cool":1},"S3Sj_dEfPHlc9hmN1dOvxw":{"text":"Horn's is definitely worth the trip, but there is a tendency toward inconsistency that mak","useful":1,"cool":1},"JTVtYAGbnSPXTz0eWEqWDg":{"text":"Happened upon this place by accident. So good! Everything was excellent.... food and servi","useful":1,"cool":1},"4g0Ttrck3FlDfqgq0tJXIg":{"text":"I discovered this amazing place on my latest pilgrimage to New Orleans, it had escaped my ","useful":0,"cool":0},"MDQIfU1r53MgPn6PpCfUlg":{"text":"We rented a house on the same street about a half mile away. I walked past this place 3 da","useful":0,"cool":0},"tigHy0g1-3HLqua2RBZ-sw":{"text":"Great local place.  Friendly staff.  Awesome food.  A clear choice for any meal.  We own a","useful":0,"cool":0},"GlsAYYhFNS3VCANtC7ZTrg":{"text":"When I'm in New Orleans, I like to go to the less tourist trappy places. Horns is a perfec","useful":0,"cool":0},"__5uAJe0-Dz_qW-3hQUKGA":{"text":"We were recommended this place. The staff was really friendly and service was good. Great ","useful":0,"cool":0},"itSYNkGBJgBGHSqszGTqBg":{"text":"Showed up 30 minutes before the close and waitress said sorry we are closed! REALLY?\nBad m","useful":0,"cool":0},"0VQS71wJ_tXtpOHkh20PLw":{"text":"The brisket here is great. In fact, everything is delicious. The portions are huge too so ","useful":0,"cool":2},"nBshxZhkHzhBr1PV2SIIxQ":{"text":"Great place. Came here for breakfast/lunch on my last day in New Orleans and it was one of","useful":0,"cool":0},"GfnUCGWlumEq4JjwWL4kmg":{"text":"I came here with a large number of people during a bachelor party trip to New Orleans.  To","useful":1,"cool":0},"xv0D-yQfYt3vZaP0-7FF3g":{"text":"My brothers and I came in to eat. We are here visiting  the city. We were given  high reco","useful":0,"cool":0},"D8ra-xeB6vStC3sEhOU4kg":{"text":"Such a good breakfast! We came here two days in a row! The Eggs Dauphine were top notch.","useful":0,"cool":1},"lkuGLk-_UJCOTZZLocArIA":{"text":"The drinks are GOOD!  The Bloody Mary is house made with actual blended tomatoes, and you ","useful":0,"cool":0},"OyoWovuSiWmYq4JcH8Ib4A":{"text":"Food was wonderful. I have Eggs Dauphine. Generous portion of braised meat jalepeno  cornb","useful":0,"cool":0},"lyPkXDA4C-JNnZj-Arf2ng":{"text":"Full disclosure first. My friend I went with is very good friends with the entire Horn fam","useful":2,"cool":1},"8RHeiFx4quvPONs3XOdGrw":{"text":"Open for brunch. Delicious. Plus Bloodies! I live two blocks away and I don't want to lose","useful":0,"cool":2},"CfybxWZu1cVELWNpKi8G3w":{"text":"A place that isn't afraid to take risks and since they've done so... they've mastered most","useful":2,"cool":1},"0hrdkXKPkB2naEfCYvH6-g":{"text":"Consistently great. The eclectic vibe is one of the reasons that I keep coming back. Alway","useful":2,"cool":2},"oGByZLZboJYVQmpCuU_C8A":{"text":"Stopped here for a relaxing breakfast on September 26, 2021. Identifying the hostess was d","useful":0,"cool":1},"fLf3Nq-VctvRgdIED4DDbA":{"text":"I always love this place!!! I went there this morning and got the best breakfast and relie","useful":0,"cool":0},"0eXkOdCD8iD-Z56tKjfEgA":{"text":"The best find on my recent NOLA trip. Seriously, it was the best food I had in NOLA, and t","useful":2,"cool":2},"_sg-stCoMFdvPLtCKCKZBA":{"text":"Ordered Oyster Benedict. Was served Eggs Benedict because \" we have no oysters.\"  Why were","useful":0,"cool":0},"JZYFsTZPfRmlEGmKoHHbBQ":{"text":"I'm pretty disappointed with my experience here considering the good reviews I've read. We","useful":3,"cool":0},"RHTbblk-zN1sEK0NXz6cSg":{"text":"Wow how have I not been here before! Took some out of town guests here who were staying th","useful":1,"cool":2},"swgbgSNa0UpyJq2XyQTndg":{"text":"Came here for a day before celebration  because we always go to the bar down the street ig","useful":0,"cool":0},"e22-OcASgn4CJ2Ns8Zsb8g":{"text":"I have been on a trip in New Orleans for a couple days and have gone here to eat almost ev","useful":1,"cool":1},"f5jaSVw7h5idqE01flNmWQ":{"text":"Great breakfast. Love the cozy feel of the place and the location. Coffee could be stronge","useful":0,"cool":0},"b2Yb2vgRoW-jUcBYpaPc4g":{"text":"Seated quickly but then fully ignored by staff for 15 minutes. Yes, it was busy, but not e","useful":0,"cool":0},"yBdcAlfP2sXV6btC4o3t2g":{"text":"This is such a unique spot in the Frenchmen Street neighborhood. My AirBnB was in this are","useful":3,"cool":3},"WV7b03ywCb7vMis4l1pP7g":{"text":"On this trip to New Orleans my friends and I rented a house in a residential neighborhood ","useful":7,"cool":8},"Fex6QhdV-CYg5G3GAm6Q-w":{"text":"I'm really surprised by all the five-star reviews for this establishment. Maybe I just ord","useful":1,"cool":0},"COhpYqFrxDtl0OViBaWtOg":{"text":"Had a great brunch at the bar! The watermelon mimosa was refreshing and tasty; the coffee ","useful":2,"cool":1},"GnHUFX4mWbrLieJwtpt3iw":{"text":"Love, love, love! Ultra casual! Great people! Yummy food and delicious cocktails. This is ","useful":0,"cool":0},"dghygTHVAt5o6JS7nA4-mA":{"text":"If your group is larger than 6, don't go. The hostess should have turned our group away in","useful":0,"cool":0},"7EUEgp-oKnD9t5tOvV3TJg":{"text":"Really enjoyed this spot my guy. Someone great writer probably is writing draft 12 of the ","useful":1,"cool":0},"0Ye6JKO2rni1cprR-HuS7g":{"text":"My favorite brunch spot in New Orleans! Must try their Étouffée! Great service - walked in","useful":0,"cool":0},"RRI_pbCBrw7A-V3eBerIPQ":{"text":"All of the food here is amazing! And the decor...don't get me started. You gotta love all ","useful":3,"cool":2},"HvS0aykO61FOAizKsMWA4A":{"text":"A cute little breakfast place that gets busy! Service was excellent, server came constantl","useful":0,"cool":0},"51ffk1Zyj-SFtT8pBNXkag":{"text":"Horns, oh my goodness Horns. This place is beautifully tucked away as a perfect neighborho","useful":4,"cool":3},"9klSSlqs7lfiLbJljYP8Mg":{"text":"Was stuck coming back here to meet some folks that ended up not riding with us anyways so ","useful":4,"cool":2},"G-Ug4ZKJR7sQppKB55dnpw":{"text":"Went here with a group of 12 for weekend brunch. Possibly my favorite brunch menu ever - l","useful":1,"cool":0},"zwrCaBdpkL57jBC3iP_fPA":{"text":"I recently came in town and stayed in the Marigney.  I took a stroll looking to bring back","useful":0,"cool":0},"Epnq5Vwemb2THHdWtyu-4w":{"text":"Nice spot for breakfast with several great sounding options to choose from. I've come here","useful":1,"cool":0},"Br1u5LMeCI_YquGpPUUXdg":{"text":"Horn's was recommended to us by some locals and we loved it so much, we dined here twice f","useful":1,"cool":1},"d338___DoyA0j5wnqqyF-g":{"text":"The Crabby Wife breakfast was exactly \"what the doctor ordered\". I love this place after m","useful":0,"cool":1},"TRpkOKUBi8DOUI1vVUul5w":{"text":"Great breakfast, excellent service. I visit NOLA several times a year and this little rest","useful":0,"cool":0},"hzHXJsLwE2YwF6pzoVhtFQ":{"text":"We stayed up about 4 houses on Touro... Horns was my morning coffee. When we did eat there","useful":0,"cool":0},"AwzeRBQ1ZzWwDXVSyX-miw":{"text":"This morning we had brunch at Horns. I can't say enough about the service, atmosphere, and","useful":0,"cool":0},"G9iHg3RcOAX8-04sKR9hWw":{"text":"What a treat. Perfect stop for dinner. Quite, clean and right off the beating path. More i","useful":0,"cool":0},"6baFp9mTqiZT0PA62n_BPQ":{"text":"I was a little nervous to try Horn's as it replaced my beloved La Peniche, but I was gener","useful":2,"cool":1},"gUPoxCCGZgaXoJuaG2vY_g":{"text":"Had higher expectations of this new restaurant in the Marigny Triangle.  Visited on two oc","useful":0,"cool":0},"7Td0mJwYJ34VcHl3MefIEA":{"text":"After having made the expected pilgrimage to one of the\"great culinary institutions\" 2 day","useful":0,"cool":0},"PQ2GY2RdA4gtDwVuWYxgDQ":{"text":"Meh... Not impressed with the club sandwhich and Ceasar salad...both drowned in too much s","useful":2,"cool":0},"OyEKsZIbVWH3XUtKftIXKg":{"text":"Delicious lunch with some high school buddies.  Menu had lots of options and variety.  Com","useful":0,"cool":0},"CFoEYPlmqbdMc9-bwsVYBQ":{"text":"Fell in love with the people, the vibe, and the food.  I had a great breakfast experience.","useful":0,"cool":0},"IHcsjhnlzHhYxApI9Ap0pQ":{"text":"Food was good, but nothing I'd crave or seek out.  Owner was nice and engaging, but would ","useful":1,"cool":0},"HSIfJAGdyOCt6Uga0aQqHw":{"text":"Very creative menu.  Friendly service.  Tasty food.\nThe \"Savory Breakfast\" was AMAZING as ","useful":0,"cool":0},"UZAnyGWvAmTsxfWrFJkRfg":{"text":"I ran into this place unexpectedly and concomitantly enticed by the $5 off Yelp offer. Loc","useful":0,"cool":0},"2QEQgTp-vD4EBr6n5i2LEg":{"text":"This is where the locals have breakfast just a few blocks outside the FQ but it looks and ","useful":0,"cool":0},"1SldI8dYV0C7UKVHqjK4nA":{"text":"Loved this place. I had the Orleans Slammer, tasted great. The lattes were excellent, I li","useful":0,"cool":0},"nKCGPHBv_ky9WO2h8qR9OA":{"text":"We stumbled upon this place by accident, and it was a wonderful surprise. Compared to many","useful":0,"cool":0},"ro94Y84mnelEHoEix_1uuA":{"text":"Absolutely delicious!!!!!!  Outstanding service!  Our waiter was so  nice and friendly and","useful":1,"cool":1},"tCgbvRBuCDOOgBJfwC79AA":{"text":"A cute little place with eclectic decor. Yummy breakfast menu - we enjoyed biscuits and gr","useful":0,"cool":0},"RYlbM0ZTG56djCTBJRv5LQ":{"text":"Great service, delicious food, fast service. I called around trying to get chocolate chip ","useful":0,"cool":1},"q5xDkDg_MTKrKiVL-j93XA":{"text":"cute place, good food! buildings over 200 years old. owner is very nice and tables are ver","useful":0,"cool":0},"isqWLX7EPIixafhu6IfLjA":{"text":"My favorite Brunch place in the world - and there's some stiff competition for that spot! ","useful":0,"cool":0},"LM2eTrWJ4M85U8OKvWTfEw":{"text":"This review is long overdue. I love brunch at Horn's eatery and so do many others based on","useful":0,"cool":0}}