{"4uz0GPVGmeIRk6ZhK7EntQ":{"text":"The service was slow at first. Red beans and rice was delicious....just how I like em. Swe","useful":0,"cool":0},"7-hDlUojbpm5iyibJP5MLg":{"text":"Garbage, I think.  Walked in to a mostly empty place.  Greeted or acknowledged by nobody. ","useful":0,"cool":0},"KiKq02ZBPI3gNETOX8m5mg":{"text":"I ordered claws; the peon was a little small.  They were good,  but fried in bread crumbs,","useful":0,"cool":0},"pwTyhV1ltvvWVR3M3R4Idw":{"text":"Laissez les bons temps rouler mes ami! \n\nMardis Gras is just now starting to sober up a bi","useful":2,"cool":3},"DhE4WbLkNaHMbWQXFpu_4A":{"text":"Really friendly, great fried catfish tacos, outstanding red beans and rice. Nice down home","useful":0,"cool":0},"-oSyT49ovh22COLi0gr7Yg":{"text":"Wasn't as impressed with this place as I was expecting to be. We saw this place on D.D.D. ","useful":1,"cool":0},"v25t0v4J_zTflOUkeXwAJg":{"text":"We had our daughter's rehearsal / out of town dinner at this restaurant per a friend's rec","useful":0,"cool":0},"3w7-R9jpVM5HZnb4UzMRFQ":{"text":"We stopped in on a whim after seeing the sign on the door that said \"Sorry we are Open\". T","useful":1,"cool":0},"LSp01_RqA8kB0Iknqd5R8w":{"text":"Excellent little restaurant and bar in the garden district.  Staff is great and the food i","useful":0,"cool":0},"U3nYDpmHKCgtECSGkwfAQA":{"text":"Service: our server was sweet and very friendly. Quickly refilled drinks and kept up with ","useful":0,"cool":0},"hh-GgtbJBLKmkE7DyKIvmA":{"text":"Después de 2 años y medio volví con mi hijo... no se si es bueno o malo lo poco innovador,","useful":0,"cool":0},"P-OnCEA40yeBlstc_eAi9g":{"text":"Just go here. From the outside it could be any dive, but inside it is bright and friendly.","useful":0,"cool":0},"ARvQzPOuNQSLoX53xEvI3A":{"text":"This was my favorite meal in New Orleans.  The menu is not pretentious and the service was","useful":0,"cool":0},"coMH8MUj2sKJwncLUTYnig":{"text":"This place was awesome!  Russell, a super concierge at the Ritz, suggested we try Joey's a","useful":0,"cool":0},"BJuyGL2MyMN71UtLfdQTuQ":{"text":"The food was phenomenal. A party of three of us came in at lunch and we were all impressed","useful":0,"cool":0},"S8Em191YYCxxCfqmo0273w":{"text":"I will go back here again to have the fried catfish!  It was so fresh and well fried...  I","useful":1,"cool":1},"UhTfeHtLuX_Tnfw6s-rgZw":{"text":"Pretty good food and dessert also.  I love coming here.  The catfish is really good.  So i","useful":0,"cool":0},"2kKf431hgSHMRe5XeJJ3Tw":{"text":"Some locals recommended Joey K's for lunch and I was really excited to eat there. The menu","useful":1,"cool":0},"pGTEEkPnXyQjYHSTTYwr0A":{"text":"Neighborhood restaurant with good southern comfort food.\n\nPros\nGood comfort food\nFriendly ","useful":0,"cool":0},"8GBcb-0f2ZOqiXl-yA60Dw":{"text":"Ate there last night.  Oh how I wish we'd have chosen elsewhere.  Ended up at Joey K's whe","useful":1,"cool":0},"hkjE7P7yuoijXTVtOmlpiw":{"text":"Our group of 14 had an absolutely fantastic dinner. The MAC & Cheese is to die for. The se","useful":0,"cool":0},"7SikVCLgiuGzjLOTBisNyA":{"text":"I've been eating at Joey K's for years now, and I have yet to be disappointed. Everything ","useful":0,"cool":0},"eOu9DqLhH7uSwQ8cXNjJGw":{"text":"Don't bother 28th this place unless you like to eat rice disguised as jambalaya.  Also slo","useful":0,"cool":0},"6GZxjIQeTpY_sLa_qOUZVw":{"text":"Home cooked meal.... yes sir!!!! Great food!! I love the fact that it reminded me of momma","useful":0,"cool":1},"Tpj0eopRuHn-Jarqa2pieQ":{"text":"Really really fresh and good seafood. I order food to go everything was nice and hot. The ","useful":0,"cool":0},"OuzTVwRusJ7136NspNuXSA":{"text":"I recently went on a Saturday night for the first time. We were greeted immediately by two","useful":0,"cool":1},"_B3g2rhAkcR249hrH77Xxg":{"text":"Joey K's had great service and food. The red beans and rice was excellent! Temperature and","useful":0,"cool":0},"SgN08QSQjhhyNW3JCVJhPw":{"text":"We wanted to check this place out because of Triple D.  We got there and it was packed, to","useful":0,"cool":0},"hQx4iyPNiMSzKaPOAxBM0w":{"text":"A co worker of ours recommended this restaurant and asked us to taste the Eggplant Napoleo","useful":0,"cool":1},"_ABdXBF3PyyOd2ibD88o9g":{"text":"Joey K's wins the award for \"worst waitress encounter.\" I went here for a friend's birthda","useful":0,"cool":0},"oLGwSdBHHesTSJQL4O08cA":{"text":"So I work in the service industry and normally never leave a review. However, though the s","useful":0,"cool":0},"l7RhrvL475FginEN9j0SwA":{"text":"Good new orleans home cook'n. Great local atmosphere with local art by Simon. The food is ","useful":0,"cool":0},"I6OzqXNS5lduP-y25o3WPg":{"text":"Local gem, on busy Magazine St. with tourists (like me) but clearly a neighborhood diner a","useful":0,"cool":0},"XhSqkIZf5l3VrhzX-SfbFA":{"text":"spaghetti and meatballs    mediocre   sauce meh\nstewed chicken......very good.....good pri","useful":0,"cool":0},"p6ffKbCM_qT9sZSxiWEwSg":{"text":"Wonderful local place.  We go for the fried catfish occasionally - quite good.  This past ","useful":0,"cool":0},"JKWVuuTV2tpH42unNrgF7w":{"text":"A* excellent lunch. Fried artichoke hearts, peach sangria, fried green tomatoes with grill","useful":0,"cool":0},"mH69KdFQwA42Q5XVsf--lA":{"text":"Simple diner with great staff. Great Food and beer is very decently priced.  Onion rings w","useful":0,"cool":0},"WslQp7trJnHe1IazLjxVQw":{"text":"While visiting the Garden District we asked around for someplace for lunch and was told to","useful":0,"cool":0},"4IuTjK_ag-Cg-eYYztnmbg":{"text":"I've been here a couple times now. The service is great and everyone is so nice. Personall","useful":0,"cool":0},"8uw6p0k0VZ6yRn2re8NwBA":{"text":"We were really mixed with this review. Usually we're all on the same page, but not here. \n","useful":1,"cool":0},"o6FwnRFrrANFZXBJYx5Jfw":{"text":"Joey K's is a very nice,  clean, family friendly restaurant that is fairly priced. The foo","useful":0,"cool":0},"nuTBmfM19DeXk7VrjcCgNA":{"text":"Great food, service was kind of slow but very nice and helpful, could use good floor clean","useful":0,"cool":0},"fRxyHYgbl8SlZ5bJBbJltA":{"text":"The red beans and rice and the all-you-can-eat catfish are TO DIE FOR! Sooooo good! From n","useful":0,"cool":0},"K2Im231qfunKPqkAp2amlw":{"text":"Wow! My family and I were traveling down magazine street looking for a quick, yummy eat an","useful":0,"cool":0},"zlfyghEvfy7jXIDmhXUQMg":{"text":"What a disappointment.  We were so looking forward to a casual southern dinner and had hig","useful":1,"cool":0},"pLnmLV28sS19xNLE51M85g":{"text":"Friendly and attentive staff! Side Caesar salad ($3.50) was a decent size but had a bit to","useful":0,"cool":0},"a9jxfABGzvdJiSfBYO8vBQ":{"text":"Great prices for good New Orleans comfort food. I had the shrimp poboy with a small order ","useful":0,"cool":0},"TM3tn4gzyV1UnwED9fjQFg":{"text":"Looked them up because of the diners, drive in, and dives show. Great food and service. Ha","useful":0,"cool":0},"NaHpdxtQ7U5I06fwfdLw-A":{"text":"Okay, for starters I LOVE this place! It was my first time going here and I am from up nor","useful":0,"cool":0},"SJiu7F7X9mnH6cU52lD-Sg":{"text":"We like to go here because it's affordable and both my husband and I can find something we","useful":1,"cool":0},"j48UxkXkefNKw6GPqCKz2w":{"text":"We arrived at 1:30pm on a Saturday, only had to wait a few minutes to be seated. The fried","useful":0,"cool":0},"DJSvbaquwPvKwk0hNCXNaw":{"text":"An all around good neighborhood restaurant whether it is for a casual dinner with friends ","useful":1,"cool":0},"_gMZBOOUGkh_hD0EZqgLyQ":{"text":"Very cool place, but the food is just not very good. Was referred to this place by a neigh","useful":0,"cool":0},"d1HTzfmJauJd6DjvNTu9Iw":{"text":"We have probably gone to Joey K's more than most other restaurants in town because I am in","useful":1,"cool":0},"Hpa59dzRHHfyhlixSbMQQw":{"text":"First time in New Orleans. Found this place through a search and word of mouth. Excellent ","useful":0,"cool":0},"YkMUKbA9Zd86-m94VGZ4Lw":{"text":"I was born and reared in nola, and I cook gumbo and understand gumbo. Joey K's does not. p","useful":0,"cool":0},"duor_ZJEKY0NMLaJVV5tKw":{"text":"With the hubs and I in the Big Easy for a fun filled weekend, we opted to try this gem (as","useful":3,"cool":5},"dGljvUmsRdZExFKMNi0_XQ":{"text":"The food is scrumptious and located in the beautiful garden district. The Eggplant Napoleo","useful":0,"cool":0},"5k3a-y4tNk_VBKcTubuz8w":{"text":"Amazing place, great food and great service\nI recommend on the tuna steak and the salmon s","useful":0,"cool":0},"spg8VwX9Q0yDel0vQS2Tzw":{"text":"Great food, such as: corn and crab bisque with actual pieces of crab, roast beef po'boy wi","useful":0,"cool":0},"wvJAIG4Tz3AEbaY6SFmuMA":{"text":"Wonderful meal. Walked in for lunch after taking the walk on walk off tour bus looking for","useful":0,"cool":0},"1G0skdKNk5Pz-KwePbdMVQ":{"text":"We were visiting from Toronto and wandered in after exploring the nearby shops.  We ordere","useful":0,"cool":0},"DEdj9iyMXubJRQBnlGj1DA":{"text":"We came here after walking around the Garden District looking at hold houses and the cemet","useful":0,"cool":0},"ibssy5A2nqAYrXn9MLlSIg":{"text":"My Husband and I had our wedding reception upstairs in the private dining room at Joey K's","useful":0,"cool":0},"OxtiX77qHYtMSo_oq3F3wg":{"text":"Such a great place to eat!  Family friendly! Great portions! No wait! They took a group ap","useful":0,"cool":0},"sVaMzKYvR89dAA5E3CabbA":{"text":"Their fried oysters are pretty decent. Too bad they serve powdered mashed potatoes...","useful":0,"cool":0},"JB7Z0zlOOoRnEGLlE6aLTA":{"text":"The BEST fish tacos, fried green tomato and bread pudding I've ever had. Large portions. G","useful":0,"cool":0},"hV04l9y5SQoMb5UMxbeRgg":{"text":"Where do I even begin with this restaurant. I was visiting New Orleans with a group of stu","useful":0,"cool":0},"7PY5vcltLyUJJYgZIJ_hZQ":{"text":"Great food and great atmosphere. I highly recommend. Smoked sausage Po-boy is the best!!!","useful":0,"cool":0},"EJjoEWaJWtCaEEQle-TDqw":{"text":"5 stars all the way. Such a quaint, family friendly restaurant and bar. The food prices ar","useful":0,"cool":0},"mCUue1wPeqXzzoXFT4SXhw":{"text":"So my fish was delicious!  Perfectly fried and seasoned to perfection.  Nothing fancy just","useful":2,"cool":1},"qWul25Jg1HdV26aFhT6QAA":{"text":"We went on a Garden District tour and our tour guide recommended this place. It was not a ","useful":2,"cool":2},"hRSBSmSAwMQCJd0UROo2IQ":{"text":"This place is amazing! The food was fresh and delicious. Red beans and rice are great, mac","useful":0,"cool":0},"j2BHhzJaaNSFTDQUhp6MUQ":{"text":"This is where I take out of town friends visiting New Orleans to get a real idea of great ","useful":0,"cool":0},"0Ccr1Qq1xXGslZnddrBIrA":{"text":"I love this place!  I work directly across the street, so not only is place crazy convenie","useful":0,"cool":0},"6vAgGNofycWvWZ-o4j_4rQ":{"text":"The Mac n cheese was DELICIOUS! The fried artichokes were very good. The fried shrimp were","useful":0,"cool":0},"qvIqzMv3ehaFoJhlISbU-A":{"text":"Hit up the Garden District one day and everybody said there is plenty on Magazine street..","useful":2,"cool":0},"6gRJRcDljHUiG2uVjd_quw":{"text":"If you like mammoth portions of excellently executed southern comfort food at a reasonable","useful":0,"cool":0},"-zCBBVEGMnZXD02Ocw-ORQ":{"text":"Pitstop in New Orleans and had to stop by JoeyK. Great food and nice NO atmosphere. Red be","useful":0,"cool":0},"5vebmTqJYMr8nx46tZ2TuQ":{"text":"Had surprisingly never been, and I am so happy I finally went!  The gumbo was dark and smo","useful":0,"cool":0},"EkL327wwdzdluSQkyPS-_w":{"text":"On the way back home from Jazzfest my wife and I stopped here as it was one of the many re","useful":1,"cool":0},"yCAI10TLRlbgDO3eRb3T5g":{"text":"I had the Shrimp Magazine which was fantastic. Joey K's is in an interesting neighborhood ","useful":0,"cool":0},"Wxv0P49h9HtZoV3sG3KmFw":{"text":"Such good service and Louisiana food! Great choice to have something Louisiana style in th","useful":0,"cool":0},"9rRmF_l2DorbXsA9kGijYg":{"text":"Great service and the food was phenomenal. Same owner for 28 years....She takes pride in h","useful":0,"cool":0},"zFhAql5hqKfxPNy4-DBybQ":{"text":"Service a tad slow- but wait staff quite friendly. Variety of food was wonderful and tasty","useful":0,"cool":0},"5uLfs9gbwYzR9Zlno0XVdw":{"text":"Great food, great service, decent prices. Had no trouble fitting a party of 12 for a Satur","useful":0,"cool":0},"k8DJEkXxqiigU7JVfQkUYQ":{"text":"Drove in to New Orleans to celebrate daughters fifth birthday had 8 restaurants recommend ","useful":0,"cool":0},"CbnTvb43Qlhb8bGIui9LfA":{"text":"Wonderful meal. Walked in for lunch after taking the walk on walk off tour bus looking for","useful":0,"cool":0},"WBffNBMPbFM1fpD9ttB9xw":{"text":"Walking around on Magazine St. and decided to stop here for lunch. It's located in an old ","useful":1,"cool":0},"t0qetPZBslEWMa9kcq6COw":{"text":"We came upon this place by suggestions of the locals. As we Wanted to eat local food. We a","useful":0,"cool":0},"gVWFSj1s_zoTQYRfviRD6g":{"text":"Great little hole-in-the wall for po boys. This place means business - it's small (though ","useful":0,"cool":0},"8eM0gQWDY0hvhkqZQBcJyA":{"text":"I found his place on Diners, Drive-Ins and Dived (triple D). Inexpensive restaurant with h","useful":0,"cool":0},"0idk57L0J-D3Ma_csJnTyA":{"text":"Awesome FOOD! We will be back next time we visit New Orleans. The Bread Pudding is to Die ","useful":0,"cool":0},"jsf18iBhYMqTr9QR3oGqUg":{"text":"Great place for refreshments while shopping in the garden district. Great atmosphere and p","useful":0,"cool":0},"urX-mBaTx3VshKVqvT8ruQ":{"text":"Must try, on Thursday they have the turkey and dressing plate with yams and peas, thanksgi","useful":0,"cool":0},"d6LMy9Mr0Ulx-J8ESCxLKA":{"text":"Excellent as always! My first stop when i get to NOLA to eat. Eggplant napoleon is amazing","useful":0,"cool":0},"neMWxMsP3Fx5acR20ZsjeQ":{"text":"Super tasty gumbo and very good shrimp remoulade salad. I'll be back when Im in town! Oh, ","useful":0,"cool":0},"UD5n4uwRdBBQIU9S5SBFgA":{"text":"The food here was standard. My wife and I had the fried crab claws, crab and corn chowder,","useful":4,"cool":0},"2ni-AdQGNAQ1BclsZkJfPQ":{"text":"We had a party of 6 for lunch.  The dining rooms were cozy, but there was adequate space b","useful":0,"cool":0},"Gt2exsKKuxgvQK57JTIYuQ":{"text":"This is classic New Orleans. Just go there and observe the patrons, the waitresses, the pa","useful":0,"cool":0},"dQp2R3SZ3CkU-A6Ms2L1Sw":{"text":"I had the gumbo to start and followed it with fried free tomatoes and grilled shrimp. The ","useful":0,"cool":0},"zzzA2PaB6PoalLo2htA1ww":{"text":"Amazing service in a really friendly environment. Food combinations that are well thought ","useful":0,"cool":1},"SU_NrjXy9osJHuIuv424ew":{"text":"Ate lunch here on day 3 of our NOLA trip. We were walking around the Garden District looki","useful":0,"cool":0},"3A6QKByIqN7W6-2w1StrKQ":{"text":"Awesome food and great customer service! \nMy favorite: the fried chicken and fried green t","useful":0,"cool":0},"e_DGwlbJwqQzdUtrL3tnkg":{"text":"Mediocre at best. Service was really slow and all the food was disappointing. In fact ther","useful":0,"cool":0},"y4-EkMKrF3YSD30JslV5kQ":{"text":"Me and a couple of friends went here over the weekend,we were not impressed They rain out ","useful":0,"cool":0},"1OW3MmVmxyVVUqJWOT7yig":{"text":"We had to wait on line for lunch, but it was worth it. They had a fine selection of local ","useful":0,"cool":0},"kb47JoWt7EgK8EpftX2vwQ":{"text":"The food is spot on delicious. The red beans and rice is so flavorful. The fried green tom","useful":0,"cool":0},"28XKOvVStbOb6U0eoI9NWQ":{"text":"You know the food was ok, but what really earned this 1 star was customer service. I speci","useful":0,"cool":0},"vslC1g6wOApWHkKG76Q4Rg":{"text":"While we didn't sit and eat here, we still had excellent service for our take out. We were","useful":0,"cool":0},"UkiYme62CH-IWJfqGi6Kwg":{"text":"This is truly a hidden gem! Stumbled across this place driving down magazine street. If yo","useful":0,"cool":0},"xP9Y9UE0VFiYnlf0T9HJRg":{"text":"I had a catfish po-boy there and it was great. Now I feel that I should have tried their s","useful":0,"cool":0},"7NkbIVqTsDsuI0Sxh3M8JQ":{"text":"Good service, nice staff, food wasn't that great. Just tasted like bar food. Not terrible,","useful":0,"cool":0},"13FGCSsLzdChFUaQyT9aTw":{"text":"I would go back to this place for the kid's menu alone.  It has so many options.  And for ","useful":2,"cool":1},"cmmkHLKvLEH7hZFQAggptw":{"text":"Joey K's\n\nAlways packed with locals.\n\nNo \"concept\" or gimmick.\n\nJust good food, good value","useful":1,"cool":1},"c0cXjXAj2YujXFYtU_QEqg":{"text":"This was a great, cute little restaurant. I loved the interior and had some killer red ric","useful":0,"cool":1},"vhofk8IH4U1_1QCEbyGAPg":{"text":"Down home southern cooking. Wait was a little long. Wonderful service yesterday and wonder","useful":0,"cool":0},"zDb2lri-IToDKw779ZrDmg":{"text":"Today my 87 year old grandmother, who has made her own (ah-mazing) fried chicken at home h","useful":0,"cool":0},"s2AOvwbgBD6vAsUxPt4tug":{"text":"Went for lunch and had the corn and crab bisque, jambalaya, gumbo, and catfish po boy.  Ev","useful":0,"cool":0},"uTz0E5tEa82-Sonv__-fZQ":{"text":"We always have a great experience when we visit Joey K's. Great food and great staff (owne","useful":0,"cool":0},"QC1wn3_SlZR4VFPjYsvOhg":{"text":"Creole Jambalaya was great! Also shared the unlimited catfish with a friend. Someone else ","useful":0,"cool":0},"I4pURivuxp4ULC6VJNrNGA":{"text":"Not for vegetarians at all...\n\nCarnivores seem to like it.","useful":1,"cool":0},"u78ICb_4bcCC_KERHgQlJQ":{"text":"I can't believe that the other day was my first time visiting Joey K's but I can now say I","useful":1,"cool":1},"Zer9iSL_0dy3ODZvUgc4Qw":{"text":"During my 1st time we trip to NOLA with my sister we stopped at Joey K's an from the time ","useful":0,"cool":0},"2TcbZhEuCBFwayq793F-Eg":{"text":"Joey K's seems to have some magnetic vortex because I somehow always end up dining there o","useful":0,"cool":0},"-8SxjOlBimabAonNslIiZw":{"text":"Joey K's\n\nThis is a neighborhood eatery with a small bar inside; bar is mostly single dine","useful":0,"cool":0},"8UtoUakyHnLVQmtBQYkrvQ":{"text":"This place is awesome! The host/staff was very friendly and nice. All you can eat catfish(","useful":0,"cool":0},"2TYDV2x_BJVp7bUAaZwRGg":{"text":"I don't understand all the glowing reviews of this place. Everything we experienced was su","useful":1,"cool":0},"iTT1gSRpycoqzhzox6pH0A":{"text":"Very comfortable setting, great shrimp po-boy sandwich, red beans/rice, and jambalaya.  Re","useful":0,"cool":0},"krcXTqLhTqhYWCPtzdNWlw":{"text":"Enjoyed the Fried Green Tomatoes with Grilled Shrimp, along with a cup of the gumbo.  Frie","useful":0,"cool":0},"vjBjGZ6ql28RQy4C_Ot_Sg":{"text":"Joey K's was delicious! A cute, quaint restaurant outside downtown New Orleans in the gard","useful":0,"cool":0},"QBqEnsJEVq9bbOV69E9nYg":{"text":"I've never been a giant fan of Joey K's. I've always thought it was eh. And I still feel t","useful":0,"cool":0},"6b3fIKYvS5PgAZNMEiMTpg":{"text":"Wife had the Grilled Tuna Salad. Fish was cooked perfectly, salad was very fresh.\n\nShrimp ","useful":1,"cool":0},"q1Cxn6sKO-kyKHmnQOLbZg":{"text":"Delicious fare, friendly folks, and a short walk from Lafayette Cemetery. A perfect late a","useful":0,"cool":0},"Zi5o6Cbuf4OH2tS3nhlfQQ":{"text":"My husband and I decided to have lunch here on our first wedding anniversary. We had seen ","useful":2,"cool":1},"6EVTeJIsYCe1bdW4rKqdcA":{"text":"Great good, very good service. After 2 days in New Orleans this place exceeded our expecta","useful":0,"cool":0},"7ZUcBX7k6G4Rbh5LdVh3OA":{"text":"Stopped in here on a whim and so far best service and food in New Orleans on our vacation.","useful":0,"cool":0},"FHWo5uJEU01yib07QwVq3A":{"text":"We went there for lunch considering we watched Guy on DD&D. We are here for my brother's 2","useful":1,"cool":0},"4QPGibYuzHUPWZSGimI8KA":{"text":"Order the rice & beans!! Very good. Great location on Magazine. \nFinished my meal with a b","useful":0,"cool":0},"OZ8hR-lvFX18QJ61UiQyIw":{"text":"On a pilgrimage for Southern fried chicken on a visit to NOLA, we were truly disappointed ","useful":1,"cool":1},"tS8AI9UGryo-7IwAlsiy6w":{"text":"The food was great, but service could have been better. They were just slow. Prices were g","useful":0,"cool":0},"m31NtO_SZp6t-Tsu0-XMFQ":{"text":"Came back into New Orleans on another trip.  I took new people with me to Joey K's. It was","useful":0,"cool":0},"ee6z2Qw1rJVzOcBo1BeTSQ":{"text":"Not gonna lie- saw Joey K's on food channel and decided that it was a must add to my TO DO","useful":0,"cool":0},"UKjiN6-4qcCgHiCQffS1SA":{"text":"Awesome!! Great service and amazing food!! Gotta go back to try other menu items. Red bean","useful":0,"cool":0},"roNkrE94Wux14gGXKwfoSw":{"text":"There seem to be mixed reviews on Joey K's, but I'm happy to report my experience left me ","useful":3,"cool":0},"uTBgugXq3IOmLm-SK29tkA":{"text":"I think its only fair I start this review with the Blackberry Cobbler. It's almost like ev","useful":6,"cool":1},"IwnbePAr6lnQ3GcK94RuIw":{"text":"Really poor Singature dish of shrimp magazine consisted of a few shrimp on top of mounds o","useful":0,"cool":0},"rvU5MU_84FNihk-XiVmjKA":{"text":"Onion rings: huge but not seasoned that well. Good breading!\nCorn/shrimp bisque was averag","useful":1,"cool":0},"nPgh-BAeyE9k3mGXqkujeQ":{"text":"I was just in New Orleans for the day and was hungry so I hopped on yelp and saw great rev","useful":0,"cool":0},"vQspHK4nui0EQ_-ulFm9oA":{"text":"This was on DDD's which enticed us to try it. The crab bisque and jambalaya were unbelieva","useful":0,"cool":0},"dQKwGY7XmYf4Qff-o7l4mw":{"text":"Great service and fun atmosphere. We shared a few items recommended by our waitress. The s","useful":0,"cool":0},"ScXLPFJgeVifpGOAj9qSrQ":{"text":"Very good service and food. We got the trout and shrimp magazine. The trout was amazing. T","useful":0,"cool":0},"4Zw9XatPowN6RC6w9bgu0w":{"text":"Ok the food here was good, but the clientele made me more that a little uncomfortable, but","useful":1,"cool":0},"zsCIo2h9i1EHl4KsBJXDYA":{"text":"Loved it. This place was recommended by our hotel as a good local place close by. The walk","useful":0,"cool":0},"ORhkdAiPoNBPESGGJO95Hg":{"text":"The food here is good, but don't come here if you're expecting to be in and out in a reaso","useful":0,"cool":0},"8l_tmNJ7a7kR73YejXAn4Q":{"text":"The service was nice, the restaurant food was pretty good, and the atmosphere was great. F","useful":0,"cool":0},"JYnGIR8QghPZobJ1SRGHVw":{"text":"We got here on Monday about 3pm for a late lunch after walking around the Garden District.","useful":0,"cool":0},"y__LhFrcFqTbhoEy5p-SFA":{"text":"We really liked this place!  Awesome service, super tasty red beans/rice/sausage!  Fried a","useful":0,"cool":0},"URfKH3hOmRFDDsPBCvekAw":{"text":"Came here with a group of 7 on a recommendation from a local tour guide.. we were so glad ","useful":0,"cool":0},"fp2ZJhSFAoklfZNL0yTN0Q":{"text":"Had the fried catfish and it's the best catfish I have ever had. It was cooked just right.","useful":0,"cool":0},"EVY55wCADoeAIJa1YM4q3w":{"text":"This was one of my favorite Uptown lunch spots when I lived near that neighborhood, but af","useful":0,"cool":0},"suEBK9tusHbYLheikLj8BQ":{"text":"Along with Port Of Call, this is one of my favorite restaurants in NOLA. We had the Trout ","useful":0,"cool":0},"UOOGvMqV22eYdhH_jyYOFw":{"text":"It was ok. Came here because of rave reviews, but just ok- not very flavorful. Even the br","useful":0,"cool":0},"xFTBmyzFKMao796QIbyqFA":{"text":"Was told about this place by a local. Had fried artichokes for an appetizer ... One word =","useful":0,"cool":0},"dmwF-lPt2SqDmy7oxBd0qA":{"text":"My family visits New Orleans at least every other year, and a trip isn't complete unless w","useful":1,"cool":0},"EQnssaqO11A5UFJPwEMEww":{"text":"I really like this place and did indeed bring a couple of friends who live in Kenner; they","useful":0,"cool":0},"z2l8eLAKzedsK9PGkby45A":{"text":"Great service, great menu selection including specials..crab&corn bisque, shrimp po boy, a","useful":0,"cool":0},"q1vlCHf2F-zRvrqU9PmmjA":{"text":"The food here is average at best and so is the service. We've been here a few times over t","useful":0,"cool":0},"8JGVsGS0hXmEKeMTatzq_A":{"text":"We just happened to stumble upon this place while walking around the garden district. We w","useful":0,"cool":0},"JKGYKFr7peI6aUrqLqD_Tw":{"text":"Great home cooking in a casual atmosphere! The red beans are great as well as the all you ","useful":0,"cool":0},"3fy861mJtbdB8Br_7Z3Ihg":{"text":"Fun and casual. The signs in the place are funny. Food was good. They let us sit there for","useful":0,"cool":0},"nzzaUD8m3YyKoFmCkvMDgA":{"text":"I very much dislike posting unfavorable reviews.  So, Joey K's, this is going to hurt me m","useful":2,"cool":0},"zWqRN7uZZ9Gr-cPF5TBo-A":{"text":"We have been visiting New Orleans for the past few days, staying in the Garden district. J","useful":0,"cool":0},"X75y050XpcVyvcrN7B2qOQ":{"text":"We found this cute place on yelp after a morning tour through the garden district. The foo","useful":0,"cool":0},"sh6f88c8zYftQT0x6bJ6Gw":{"text":"We enjoyed our dinner here last Friday night. Came over around 9:15 only a brief wait for ","useful":0,"cool":0},"XVeTg39qup8ZKVGygocwhQ":{"text":"Had lunch here on a Saturday.  We were a little worried because of several bad reviews, bu","useful":0,"cool":0},"UEes_stLCgaRUxX0rOmsCg":{"text":"Best onion rings I've ever had. Seriously. Order them.  Otherwise I think the food is fair","useful":0,"cool":0},"ENg4MKwGGRTOfS5vYCyIFQ":{"text":"I came here for lunch last week and it was alright.  It was pretty busy and seems quite po","useful":0,"cool":0},"SDbM0C4I_53N1NNIjxtnDg":{"text":"Yummy with a capital Y! Fun with a capital F!\n\nWe went for lunch---amazing cornbread, larg","useful":0,"cool":0},"4rmlUpk0JI5PqnOd52TQzg":{"text":"Fresh food. Excellent service. Down home southern comfort. Great ambience. Most importantl","useful":0,"cool":0},"shKzrSLCj9GuZ1kJna8kaw":{"text":"The food was so-so...we got the veal cutlet (not great) w/ green beans and mashed potatoes","useful":0,"cool":0},"T_z3VQPaIfMUej1ZxqWnVw":{"text":"We stopped in the place after a walking tour of the Garden District.  OMG was it good.  I ","useful":0,"cool":0},"Tmzz3JiS9d5M_3v8y12VGw":{"text":"Excellent little restaurant and bar in the garden district.  Staff is great and the food i","useful":0,"cool":0},"pKwZz3I-bJvmxW5o132bmg":{"text":"We came in and sat down. My tablemates ordered some alcohol (of course, not the driver). T","useful":0,"cool":1},"Sh4mITfuFuGFDQJcr58rIg":{"text":"Fried crab claws were yummy, red beans rice were right on since it was raining out...and t","useful":0,"cool":0},"3ufKTynGyq_3mr82TBBPCA":{"text":"I was craving Cajun food and this hit the spot. Got the crab and corn bisque and split som","useful":1,"cool":1},"k7G-XTYxux2yLdIT1HhcnA":{"text":"Found using a \"best restaurant to try\" search and were we more than pleased.  Seated with ","useful":0,"cool":0},"QujTmDE7bZBHFWSy-Vh_TQ":{"text":"Am I seriously writing a review just based on croutons? \n\nYes I am. Its like crouton cotto","useful":1,"cool":1},"r-M1oonQrBP66fdX72A6zQ":{"text":"I feel like I used to like Joey K's, so I was excited to have lunch here after not coming ","useful":3,"cool":1},"Je-NVRfXDNM1Ua8wuyttKg":{"text":"This is a restaurant that the Royal House would do well to learn from. It's a neighborhood","useful":0,"cool":0},"3biGAzVAUA95tkmuVcgn1Q":{"text":"We went for lunch on a Saturday here.  The food was really good.  We were seated within te","useful":0,"cool":0},"s2Tw-pZZZqzNx-5U1NX9fQ":{"text":"Nice, family friendly restaurant close to the Lafayette cemetery.  After walking around th","useful":0,"cool":0},"eE1CEyEaob5SZuXBmedPiw":{"text":"Reasonably priced, and delicious! The shrimp was so tender and fresh! I wish we could take","useful":0,"cool":0},"5ivxZ0xa_cBwUz3GGMS7_w":{"text":"Stumbled upon this cute place on accident and was pleasantly surprised. After a weekend of","useful":0,"cool":0},"G7MEsQm9hfe6TG0gJe-MbA":{"text":"Whatever you do, don't order the shrimp remoulade.  This is one of my favorite dishes and ","useful":2,"cool":0},"BhGJ5Ia-sJEsVu0JfUt2Lw":{"text":"Best comfort food...hamburger steak, mashed potatoes and green beans. Lunch specials under","useful":1,"cool":1},"fydLQapevm7hi868aZwfRQ":{"text":"Great location and ambience!  I had a bit of a wait time.  It wasn't super busy.  Eggplant","useful":0,"cool":0},"zVuCLd-4zXBxxDFeUEr-hA":{"text":"Just had corned beef and cabbage that was fantastic.  The new potatoes was a little too sp","useful":0,"cool":0},"se6wHWJB-7CHH-DeOZD16g":{"text":"Wow, wow, wow! What a fantastic place to eat! Joey K's has a lively atmosphere, excellent ","useful":2,"cool":0},"QuqtJbjLzQx1qryPTK0chA":{"text":"An unassuming location, but with exceptional preparation of classic Southern cuisine. Plea","useful":0,"cool":0},"5RPnQDPPpEpq4dvYMxpmPQ":{"text":"Everything was delicious.  We had red beans and rice, Eggplant Napoleon, Shrimp Magazine a","useful":0,"cool":0},"KiEWIb_aL_eEH3BiFGrVaw":{"text":"My husband and I decided to have lunch here on our first wedding anniversary. We had seen ","useful":3,"cool":0},"edQtQH1MajVI6oYAJ2XKtQ":{"text":"With large plates and hearty portions, you won't leave hungry! \nAt the suggestion of our t","useful":3,"cool":3},"-OgTugPkmqiVTGEMluGBGw":{"text":"Joey K's Restaurant\n\nThis is one of our regular supper stops, about twice a month, near ou","useful":2,"cool":1},"JCWbKHiDmgDrsIHF5bXUMw":{"text":"I think it is BEYOND important that I start with the dessert. Sigh... the dessert still ha","useful":3,"cool":0},"fMYwjKj2tp63Re35X22s3A":{"text":"Joey K's turned into our local restaurant hangout when we stayed in NOLA last, and it was ","useful":1,"cool":0},"AtrGjVx7tx9DjcpUtfRwVw":{"text":"If you want some good New Orleans cooking on Magazine St. go to Joey K's. I LOVE the Eggpl","useful":0,"cool":0},"uaItHzYU3ZlbzmJMXUTQmw":{"text":"Excellent food, great staff that helped suggest different foods, all of which were good. I","useful":0,"cool":0},"lXUNsUyiJMKLdKMnUtxRuA":{"text":"Really enjoyed our visit this spot on Magazine st.  We shared red beans and rice with hot ","useful":0,"cool":1},"AdX5SjzM25K9otyyMnKgEA":{"text":"Was visiting from out of town and thought I would try this place after seeing it on the tr","useful":0,"cool":0},"WfyKAQ6rL530qkittW_m9g":{"text":"LOVE LOVE LOVE this place.  The food was delish and and the portions were big so come hung","useful":0,"cool":0},"PJ1EDaRnPRTXOVU42GnwTw":{"text":"A tour guide(Val )recommended I try this restaurant for lunch. I owe him a thank you! It w","useful":0,"cool":0},"8ZfpsKp8wdlzwa3CZjeeXg":{"text":"Didn't live up to the hype. My husband had the grilled shrimp & vegetable & said it was OK","useful":0,"cool":0},"fL0bOlJZuM3L1utef_SyhA":{"text":"Our family checked out Joey K's and came away happy.  Nice neighborhood joint with reasona","useful":0,"cool":0},"ouFZ5H_N6oyr4ITHobYXqg":{"text":"Always hit or miss. I used to order out just to avoid having to deal with the wait staff, ","useful":1,"cool":1},"edjy8CpUZrABGMt6wcVQLQ":{"text":"Just ok.  Maybe we caught them on a bad night, but the jambalaya was just plain bad.  I th","useful":0,"cool":0},"J4yJh0zs0gVYdJUAAPRfCQ":{"text":"I'll never forget the Fried Pork Chops & White Beans I had at Joey K's on Magazine Street,","useful":0,"cool":0},"4ofoNMKlLDhYUIlHbsllnw":{"text":"Great food at reasonable prices. You won't leave hungry as portion sizes are large. We ate","useful":0,"cool":0},"EPU90B9WkpVuleTAJQVpOQ":{"text":"We stopped here because I saw this place on \"Diners, Drive-ins & Dives\" on the Food Networ","useful":0,"cool":1},"q5j3gxZbF_qCviRctL9wzg":{"text":"I'm not the biggest fan of New Orleans food. Growing up in New Orleans, I've eaten the gum","useful":0,"cool":0},"5fuKdFtRjgGLyJP1bvwXbg":{"text":"This is a really cute neighborhood place that I would give four stars, but the lettuce in ","useful":1,"cool":0},"TmNpbGTZr2IdaZhogH2Vyg":{"text":"TAKE A BREAK !\n\nJoey K's has been one of our favorite neighborhood places for the past dec","useful":1,"cool":1},"lHoEnbKThgIQeKUUKyV85w":{"text":"Can't say enough good things about this place. We had a very short wait when we arrived du","useful":0,"cool":0},"no9WhBJKkVvpLd4HbaeWxA":{"text":"My fiancé and I stopped in Joey K's for lunch and as hectic as it seemed we almost didn't ","useful":2,"cool":1},"7iduR_Rg_ye0lffNFC1wAQ":{"text":"This place is very quaint but an excellent spot for people with kids. Servers were very ni","useful":1,"cool":1},"Hm6CbpqxqmViuDueJlw5Ug":{"text":"Very good! Crab and corn bisque, shrimp poboy and fried green tomatoes. Great location. Co","useful":0,"cool":0},"CJjWFJTRXGDVpn0N5ma4kQ":{"text":"Joey K's is a gem, a bit of a rough gem, but a gem none the less. The major draw back at J","useful":0,"cool":0},"Y6z2TeeWj3vTw1I2ChGDLw":{"text":"Winner, winner chicken dinner.  Saw this on Diners Drive Ins and Dives and had to give it ","useful":1,"cool":0},"u4drZVNPXhLp3hHk1Lakxg":{"text":"I am not a new Orleans native but I've been here for 17 years now I went to Joey k's cause","useful":0,"cool":0},"fs5XazUtuOiCxaVbyVawSQ":{"text":"We heard about this place from a few locals and it looked good, but right when we got insi","useful":0,"cool":0},"2ajiQKL8xfokwXrxqndSEQ":{"text":"cmon....processed meatballs from Sysco....cmon...processed hamburger meat from Sysco. Sham","useful":2,"cool":0},"ts4fwx4TEE41jyta4Jkqww":{"text":"This stop was delicious and unintentional. My group of girlfriends and I were looking for ","useful":0,"cool":0},"5BeBPn-mbYnqEKn_Cv9dPA":{"text":"Pretty solid restaurant for New Orleans food. Casual, friendly, and cozy. \n\n- Fried artich","useful":0,"cool":0},"tpJThwJzKchrDt4BZmQXiQ":{"text":"Five stars.  One plate of catfish from the fryer AYCE is just amazing.  Fresh, tasty and g","useful":0,"cool":0},"Am3XkfC5C5wpncEhr2XVLw":{"text":"Eggplant Napoleon surely one of the most decadent dishes in New Orleans. \n\nEnjoyed lunch h","useful":1,"cool":0},"tqiIPYNJ3RWePJoSrcCb7w":{"text":"Great sausage red beans and rice. Seafood platter terrific. Catfish so good. Friendly fast","useful":1,"cool":0},"nSU5trcZOcCmhQLb0_WOJA":{"text":"I should have ordered something seafood/Nola related, but was not in the mood at the time.","useful":0,"cool":0},"V0ol0juEoSDBw8wwieUoVg":{"text":"I found the seating to be really tight and the food to just be A LOT. If you're looking fo","useful":0,"cool":0},"4iHNONVGNyysj4_6wPAbFw":{"text":"The service was slow, slow, and slow.  Food was the saltiest we had in New Orleans.  It wa","useful":0,"cool":0},"qQYdcfRObsc9MG0tvRgkqw":{"text":"We were in New Orleans for a long weekend to celebrate my wife's birthday. We asked severa","useful":1,"cool":0},"9bWdWa56-nNX6sb76Uksdg":{"text":"We went here on a warm summer night.  The first thing we noticed was that it was cold in t","useful":0,"cool":0},"MXCWn0a_m6K0csZ9Fibpmw":{"text":"This place was a nice little sit down place on Magazine St. It's perfect for lunch or dinn","useful":0,"cool":0},"_n780NpcG7z1HFDp5E5Ofw":{"text":"I enjoyed the oyster po boy sandwhich.  Bread was crunchy,  oysters fried well, and the ex","useful":1,"cool":0},"Tj2AJB8wI8qNesjulGYaLg":{"text":"We had an extended family dinner at Joey K's on a Monday night (yes, they are open on Mond","useful":3,"cool":1},"2uf9udBZ7jeydP8kUhedkg":{"text":"Excellent southern food!! Great family and kids place.service was great. Tried the rice an","useful":0,"cool":0},"12Xbmcb2ulfS9OqytMBssA":{"text":"We stopped in for drinks after lunch at Commander's palace and walking around Lafayette Ce","useful":0,"cool":0},"BLkdewdeR9jdf4mMGWm_cg":{"text":"I visited Joey's in July '14, it was delicious!!!! I ordered the jambalaya and  a yummy to","useful":0,"cool":0},"Z_PlMiu3Om4l9HEp3Ao0Eg":{"text":"Great neighborhood spot weather you are visiting or live around the corner.  Casual spot, ","useful":0,"cool":0},"dG4XnmXLajM-tv-oeZAG8g":{"text":"I have had two lovely experiences here - once with my dad and another time with two friend","useful":3,"cool":2},"IaKQqr1gZp7BgXM1PJyLaQ":{"text":"My mom and I came here just before 6 on a Monday and the place filled up so fast. People j","useful":0,"cool":0},"jSd82BifwRUXJFjzoRbNqw":{"text":"I've had bad service in restaurants before, but this was the absolute worst service I've e","useful":1,"cool":0},"-pFZugCe1saKJyvFJk6BfQ":{"text":"I can never get enough Joey K's.  The food is always delicious.  The atmosphere is excelle","useful":2,"cool":0},"Ed9-K3BUS5OhbKC3nx5UoA":{"text":"I came in on a Monday at 2:15 thinking the lunch rush would be over. Wrong. I found a tabl","useful":0,"cool":0},"dqN_iBwu2Yr6GL-AoC7A0A":{"text":"This is a great comfort food place.  Have the best chicken fried steak here.  The gumbo is","useful":0,"cool":0},"w2ByYw56mFX7hpULnUciKA":{"text":"Excellent!! We had the fried artichokes with the marinara that was awsome good, stewed chi","useful":0,"cool":0},"93MpLAUW2-sj3y9ugEBOVQ":{"text":"Great lunch spot in the Garden District.  The jambalaya was alright, but the red beans and","useful":2,"cool":1},"FNmL2gFdsh-vVN4iTCp4Mg":{"text":"Catfish ( all you can eat ) was amazing .\nThe meal came with a yummy salad and a huge orde","useful":0,"cool":0},"_iPcZbDbJwA572xbCebGew":{"text":"We went on a Garden Tour and asked our tour guide Skelly for a lunch recommendation .  We ","useful":2,"cool":1},"gQdz7gPcgNJgmN-f5sUtKg":{"text":"always good and always make u feel at home. The food and company and atmosphere just make ","useful":1,"cool":1},"muSeKaP-c1A1Sj06JlYl3g":{"text":"We had a GREAT lunch here with folks from out of town!  I think that it is one of the best","useful":1,"cool":0},"vHq_-a5ykl0cWfDGu4q11Q":{"text":"Love this place!  I was here about three weeks ago and came back today.  Short and sweet..","useful":0,"cool":0},"p_MYsc_spC-idgq7KJmgxg":{"text":"I went here yesterday with a friend for Happy Hour. I got there around 4:00 and there were","useful":0,"cool":0},"JuutzZ2KaOCo0O8rCttkPA":{"text":"In a town with so many eating options and great food this place was a solid ehh...the best","useful":0,"cool":0},"y1JvAMJ-lomOo-AZTslBXQ":{"text":"During a recent trip to New Orleans, my husband and I decided to swing by the Garden Distr","useful":0,"cool":0},"qgWrPZtQQlOKvYLdP1hcMQ":{"text":"It's usually pretty busy, which is always  a good sign.  They have great specials, and goo","useful":0,"cool":0},"6QVJvEQaHXETYewxFyB10g":{"text":"Here is the eggplant and shrimp Napoleon appetizer. I ate half and it was another difficul","useful":0,"cool":1},"LmVHU6NAUhNMASy55fflgw":{"text":"We really enjoyed this place.  We went because it was featured on Diners, Drive in's and D","useful":0,"cool":0},"qyW3LGcPQnDTA1V9lBLwpQ":{"text":"Dinner for four was $100. And we have leftovers for lunch tomorrow. We had the fried artic","useful":0,"cool":0},"JPtejyJzIKqivKgNOmpsuw":{"text":"We spent 7 days in NOLA and visited Joey K's twice. Sharee helped walk us through the menu","useful":0,"cool":0},"oHo7SIWXmNRxcL8JfA_SeQ":{"text":"From the French Quarter it is not close[half hour bus ride]. But on-line reviews had me ho","useful":0,"cool":0},"tPkvj3ewl3AtJdWg290rSw":{"text":"Soooo, I tried this place bc it was on Diners, Dive ins, and Drives. Boy did I have BIG ex","useful":0,"cool":0},"rZjlkaWFMnQP5QFzhHcJtA":{"text":"I've dined here several times now and have always had a good meal.  I'm not sure why the m","useful":2,"cool":1},"F94UAHnR2JeAJhuiCj_5VQ":{"text":"Stopped for lunch after being politely moved along from the Commander's Palace, where we h","useful":0,"cool":0},"6kkVlfzgcFJm10ijQtkSEg":{"text":"The food was excellent, nice service. I ordered the shrimp magazine, and my husband ordere","useful":0,"cool":0},"FD-rsGe8it93BIlHBfCkjA":{"text":"Joey K's is a great stable place.  I love the fried green tomatoes, when in season, and th","useful":0,"cool":0},"nuN7HQ8w4zouJEvaltzF7g":{"text":"Great food, had to wait even at 4pm on a Saturday. Servers a bit overwhelmed, very friendl","useful":0,"cool":0},"Iksy4RQshzn_AMqQjdaoMA":{"text":"I work in the Garden District, which means I'm fortunate enough to be surrounded by some o","useful":1,"cool":2},"H7H3ERRYSgkJvTcSRnGFKw":{"text":"This place is amazing. Onions rings where very very good. Had the hamburger steak with ric","useful":0,"cool":0},"GPXDsTDOCRlTC1lzC7yntA":{"text":"I love Joey K's for its fun and classic food with very good service and great prices.    O","useful":0,"cool":0},"FHvCXrGC13J826PnbPhVZQ":{"text":"Food was fine.   The service was horrible.  Bunch of hens behind the bar clucking, having ","useful":0,"cool":0},"ic7cV3O3F_DECUMoCSZtLQ":{"text":"I heard great reviews about this place. Unfortunately when I arrived there were three empt","useful":0,"cool":0},"pUhJJrqPx07pH_4R_pnBbw":{"text":"Since I last dined here in 2012 and introduced it to friends who live in Kenner, Joey K's ","useful":0,"cool":0},"SH7agxhkNZytexIQCXJ0GA":{"text":"My expectations may have been too high because of Diners, Drive Ins, and Dives! lol it was","useful":0,"cool":0},"cz6VG0QBNtTZtB8ZfFqOdA":{"text":"Excellent service! Great food. I had the eggplant Napoleon and the sauce was PERFECT! The ","useful":0,"cool":0},"ILBnVg944AWoD5akhNHCbA":{"text":"After a long afternoon of walking and still being stuffed from brunch (which was delicious","useful":0,"cool":0},"jt41F1XRhxHIPBcZerK3uQ":{"text":"Simple foods done well can make all the difference.  Small menu but the specials are alway","useful":0,"cool":0},"qyfs3xVoQnGxoDkwDQFMHA":{"text":"This place is great!   We stopped in for dinner on a Saturday night.\n\nThe decor is really ","useful":0,"cool":0},"UP5ZPipyjbRQbOJPFrto_A":{"text":"Snuck into this place on the corner on Magazine St. Good thing because 20 minutes later it","useful":1,"cool":0},"HWFRlfOUIl_be3-lsHFYmw":{"text":"Friendly, nice warm cozy table, quick service. Food was ok, we picked the fried chicken an","useful":0,"cool":0},"EP7Ht18nmE-Z8SeKjH8Vng":{"text":"Really cute place to eat lunch ! Atmosphere was nice very relaxing and laid back. I had th","useful":0,"cool":0},"TEqECdYs3OXfXtM_5Wh8WQ":{"text":"Came here with my husband to try the eggplant dish, Eggplant Napoleon.  I don't eat eggpla","useful":0,"cool":0},"5OyVuqGVwV3aheTNXVoahQ":{"text":"I ordered stewed chicken with green beans and mashed potatoes, it was one of the specials ","useful":0,"cool":0},"66V0caXJ0oq_LqVyYr0i3Q":{"text":"Given the fantastic reviews on yelp and in many NOLA tourist brochures, my friend and I de","useful":0,"cool":0},"yQrisah0RPkYc9mPtEPRbA":{"text":"Joey K's, oh my! I've been hearing my sister and my parents talk about this place for so l","useful":2,"cool":1},"_hWmBo8OUO-vnPkExTnVOQ":{"text":"Joey K's is a classic greasy spoon serving a broad variety of food. It's not terrible, but","useful":1,"cool":0},"n2Ml2sQ6LJO4JkRWuqNXVw":{"text":"Great location on Magazine St- lots of shops close by. The decor is fun and colorful. The ","useful":0,"cool":0},"s5FMnOEnlAQ8bVNtsEvi4Q":{"text":"After visiting Acme Oyster House the previous night I was in the mood for a Po-boy. On the","useful":1,"cool":1},"ZqrFPVR-ajwIsu_qdLtYaw":{"text":"Loved this place! Wholesome homemade meals like mama or grandma used to make. \n\nBe warned ","useful":10,"cool":5},"Kx4Fnm9RfPTO41ApRpkqRg":{"text":"Joey K's was ok. \n\nThe interior had some colorful local art but there wasn't much ambiance","useful":0,"cool":0},"l2b71wTOe91z5H6sN92E-Q":{"text":"Well, the place is easy to find, and they have food that doesn't make me sick, and they se","useful":1,"cool":0},"sI1JozU3TVzaMYlTVyPAAQ":{"text":"We went there for lunch and they served comfort food but I don't think I will go there aga","useful":2,"cool":0},"bVdndyQq70IGFH7TZ6BGfA":{"text":"I recently had an enjoyable quiet lunch here on a Tuesday afternoon. I had the stewed chic","useful":1,"cool":1},"PcA8jgULegbtajG7G7NtgQ":{"text":"This was the best meal we had during our 3 day stay in NOLA. Loved going to quiet magazine","useful":0,"cool":0},"O-xhI3JQwbq0IxJhsfrJag":{"text":"Had the eggplant and crawfish appetizer- the most amazing thing ever.  Had the right amoun","useful":0,"cool":0},"G4FEPd5DhnI1l4-YUHV-Pw":{"text":"This place is incredible. We landed there on accident. It was raining, we were in the gard","useful":1,"cool":1},"1cPwXFeVwMhIBZbPO2X6Zw":{"text":"This place is a hidden gem on Magazine Street. The prices are good and the food is consist","useful":0,"cool":0},"sd2xcAdq9k3zY4ADJqzleg":{"text":"Went here on a date because she saw them on some food network show. So I think my expectat","useful":0,"cool":0},"fn9XWzo9yhjvvBvv-GvWWw":{"text":"Solid, decent food, and a pretty fun lively place. The fried oysters were good stuff, and ","useful":1,"cool":1},"aPwF-G06pI9NqFOWupFu5w":{"text":"The red beans and rice, Mac n'cheese and shrimp n' corn bisque was great. Our server Amand","useful":0,"cool":0},"y14m3pCY0L-usZpe1LrTpg":{"text":"Don't know what the hype is about. The shrimp remoulade was awful. Made with FROZEN shrimp","useful":0,"cool":0},"BJsFplaY8ZhGaTk-5grEqw":{"text":"Is it possible to leave less than 1 star? If so, Joey K's would receive a negative score. ","useful":2,"cool":0},"T_2MnTSPVPwl4IfrKEZpBA":{"text":"DO NOT GO HERE. WORST SERVICE EVER!!! My husband and I sat for 15 mins and no one waited o","useful":0,"cool":0},"nE4rso_SISAMjiY8JL--kA":{"text":"30 min. wait on a Saturday afternoon, but the young lady running the wait list was on top ","useful":0,"cool":0},"ZSYYZKMYcV6m61OyfFnKZw":{"text":"I came here after a recommendation from the Airbnb host we were staying with in the neighb","useful":1,"cool":0},"seV8TruBsYIFS2dmdfNYdw":{"text":"If this is considered one of the best places to get red beans and rice, it's sad. I've mad","useful":0,"cool":0},"7jZIVqwWL8AJX7IRaaHI2A":{"text":"I heard that this place had been featured on Diners, Drive Ins, and Dive's so I thought I ","useful":0,"cool":0},"3mJAqO7BpD3u1pNo1HGJGQ":{"text":"The shrimp magazine minus ham was great, the shrimp with fried green tomatoes was even bet","useful":0,"cool":0},"nyodJK_DSAn2eN3U4QIl_Q":{"text":"I love the atmosphere and I loved our waitress Misty.  The food, however, wasn't that exci","useful":0,"cool":0},"JvhoQ2BSdsX_-e7ZGTbIEw":{"text":"The best fried oysters I have ever eaten. Great spot to drop in for a shopping break in th","useful":0,"cool":0},"PPMKslc9jq6lxeGfmypBDA":{"text":"A nice dinner place on Magazine Street! =)\n\nI ordered the beef brisket and my friend order","useful":0,"cool":0},"AelzJpTkuAmtA5EH4oZOLQ":{"text":"Came for a late lunch and grabbed a vacant table outside, then went in to find some one an","useful":0,"cool":0},"M7emTtfWg1m13VWg4yjvqw":{"text":"This is by far the best food and service we have had on our visit to new Orleans. They hav","useful":0,"cool":0},"StQW6YUfktxPU0dZKc8cyQ":{"text":"Not exactly a fan... Our experience here left a nasty taste in my mouth that I've held ont","useful":0,"cool":0},"fUN_xFB-UtL3UGHADqU9DQ":{"text":"Not bad. \n\nThen again we busted up in here during the Monday lunch rush with a serious han","useful":1,"cool":1},"2-YADrWijj4Mr77ZpQorFA":{"text":"As with a lot of other reviewers, I am going to have to side with them, while the food was","useful":0,"cool":0},"08d0SJsDfq7mfc3T3PkFJQ":{"text":"The Red Beans and Rice are not to be missed ! Some of the best we've had (not including my","useful":0,"cool":0},"g_YjMPjuX2rQyy2pBUziYw":{"text":"The food here was delicious. Fried Green Tomatoes with Grilled Shrimp was amazing.  Could ","useful":0,"cool":0},"lVGY-ex7OuvqHn-2OE48BA":{"text":"So overrated.  I went based on the tv show triple D's. What I have come to realize is majo","useful":1,"cool":0},"Bow1dQ8kJEs__ozloOGQNw":{"text":"The eggplant pasta was one of the best dishes of my entire life. My girlfriend and I split","useful":0,"cool":0},"Y-BTJ8UbIoYjlpawTYsa_A":{"text":"If you are more used to lighter-style cooking and overdosing on the deep-fried-in-ham styl","useful":0,"cool":0},"kP8lOSygjpRN9TAS9HdHVg":{"text":"What a nice break from tourist traps! Joey K's had a great menu, reasonable prices, and fa","useful":0,"cool":0},"LYQKGkPajRKFZA0JXMwSlw":{"text":"I got tired of the tourist restaurants in the French Quarter. A new local friend directed ","useful":1,"cool":0},"NklcaNlChgEiLjoT8II2Kw":{"text":"Overall, a very good experience. I ordered the jambalaya and unfortunately didn't love it-","useful":0,"cool":0},"qnAbWi3z0f_r3Gqo_8iUQQ":{"text":"Had Lunch here a couple days ago.. After the worst lunch at Willie Mae.. Had the Fried Chi","useful":0,"cool":0},"laOWGjIMmK9XpWk16SmY5Q":{"text":"Very average...the house salad was iceberg lettuce with the core left in and bland dressin","useful":0,"cool":0},"sNBJNmNZ-yZGk0eHqvPeAg":{"text":"I didnt see what all the fuss is about. While I have nothing bad to say about this place, ","useful":1,"cool":0},"HTLumqt78uedxdClBEyiQg":{"text":"Let me start by saying the food was good. Had the all you can eat catfish and fried chicke","useful":1,"cool":0},"JC44wDv72YJ_aSwxqxdL6g":{"text":"When having a bad day I stop by this place to lift my spirits. The foods great and the sta","useful":0,"cool":0},"sV6m5UC8HvUBSeCIRyRMfg":{"text":"While on a weeklong business trip, I went to this out of the way spot that caters mostly t","useful":0,"cool":0},"TMelUeEQ4zUvexs5xAidQQ":{"text":"Was so disappointed! After being to so many diners drive ins and dives and enjoying them, ","useful":0,"cool":0},"9iDF0adsveMCKESKMgmF7w":{"text":"We weren't greeted upon entering (the employees saw us and looked our way and even when we","useful":1,"cool":0},"MWz54zjB4btSjk8_acgmIQ":{"text":"2 stars because my daughters liked their food. I ordered the meatloaf pattymelt which was ","useful":0,"cool":0},"VMiXSY5-f_pbuUuLwknnfA":{"text":"We stumbled upon this place during a Saturday stroll down Magazine. Downstairs seemed pret","useful":0,"cool":0},"bMYR4Nu9I_UfKbG-uCT5ug":{"text":"The best meal we had in NOLA! The eggplant napoleon and fried green tomato apps were incre","useful":0,"cool":0},"aSsR7bMq6u4kMqX3MPu3HQ":{"text":"Located on Magazine Street in the Garden district this restaurant serves authentic souther","useful":0,"cool":0},"W2MIZYEUlf5IiVRGFFJ-ag":{"text":"I went last night because the place down the street had an hour wait. I've usually written","useful":1,"cool":0},"YofR0eEeEHLQ41h-5TtTHw":{"text":"Yuck! If you like gumbo made from water and corn starch without any seafood or veggie trin","useful":0,"cool":0},"n7KN7YVtD0EpUFbdjgbHeQ":{"text":"Saw this on Diners, Drivers, and Dives and wanted to try it out since I'm a local.\n\nI just","useful":2,"cool":1},"rHQ28Uc5zUVtfleaRGQiTg":{"text":"The Eggplant Napoleon was one of the best things I ate in New Orleans.  Just a delight to ","useful":0,"cool":0},"qS7HqgIklaDIYbFn9G1oPg":{"text":"Drove in from Houston to experience the cuisine of New Orleans. We own a BBQ Restaurant an","useful":1,"cool":0},"Xkx24F58n5RikjNICLorKw":{"text":"...no.  just no.\n\nThe food is middling at best, the service is terrible, and you're paying","useful":0,"cool":0},"nfVCaO5t_4eQegPRiFkNaA":{"text":"While driving from Atlanta to San Antonio, we decided to stop in New Orleans to grab some ","useful":1,"cool":0},"yFQu1QOABbPJrEzYtt74-w":{"text":"The food was ok/good, definitely better than going to a Denny's or Ihop. \n\nWe had the frie","useful":2,"cool":0},"H6mWmV-cx7Pi3sXA5C282w":{"text":"Exceptionally awesome food and friendly, attentive staff. Definitely a place not to be mis","useful":0,"cool":0},"kIsgy4bvd4KdxpsK6QCjeA":{"text":"I was there last week for lunch with a friend.. Serves was all right could be better.. App","useful":0,"cool":0},"5tvvanT8oOvcDbCqU_WCsA":{"text":"Was reallyy hungry on a Friday night and a friend recommend Joey K's.  The service was gre","useful":0,"cool":0},"VSNCd2KTaB8TFUduplivnQ":{"text":"What do you do when you have time for only one meal in NOLA, and want to sample as much Ca","useful":0,"cool":0},"Wbhl0lFH-SHx33MT4J4wDQ":{"text":"I had Great Expectations.  And they were largely unrealized.  The daily specials menu outs","useful":0,"cool":0},"iQ3D8z08oSwHW_l60A3jiA":{"text":"Cornbread queen of New Orleans! they only have it on certain days of the week,  and one of","useful":1,"cool":0},"BDmqh350pDIzlUAyTIIZyg":{"text":"We had a brilliant lunch at Joey K's. The atmosphere was very relaxed--good crowd, calm, e","useful":0,"cool":0},"FF9CFCTsvtHMxQYvBG6BBw":{"text":"Food was great. Service was slow; we stayed by the door for a while before we where seated","useful":0,"cool":0},"gMQSF_Dua-h-C7mCJhLs2Q":{"text":"Went here on a whim, and will definitely go back.  Thursday night at 7:00 and seated right","useful":0,"cool":0},"eIDoRDVUc8g_O-Xx_4mfhQ":{"text":"Best fried chicken we found!  Be prepared for at least  a 20 minute wait for the fried chi","useful":0,"cool":0},"L7TMMmZWZnwC7yYwNcJ8EA":{"text":"Got the chicken fried steak and it was in the best gravy. Green beans were also excellent ","useful":0,"cool":0},"DhyFjGgpFe5DeMexfHTamg":{"text":"This is one of those rare instances when remodeling the space and the menu did not ruin th","useful":0,"cool":0},"njwDnns3Fi4onIHolPTmEg":{"text":"Joey K's came highly recommended and we could not have been more disappointed. I 100% unde","useful":1,"cool":0},"Xzok-UjsFrOgQkqpDGkqJQ":{"text":"Super pleasant experience at the lunch counter. Great Club sandwich and fried catfish Po B","useful":0,"cool":0},"EJiXKummpbLbwaswAhFC4Q":{"text":"Thank you random bus stop people's recommendation - Joey K's didn't disappoint - Monday's ","useful":0,"cool":0},"mZa9TEy5BoddmhnqWjwbrg":{"text":"Joey K's has been the subject of a lot of fanfare and accolades as being \"authentic\" and a","useful":1,"cool":0},"n_qIOi1jkDo-nqULdFWZTg":{"text":"Awesome. I had the oyster po'boy. Delish. They would have gotten 5 stars, but the hush-pup","useful":0,"cool":0},"b0KVCxnwTXSEQBft1WMfkQ":{"text":"Joey K's is a hidden Magazine street Jewel!  Food is everything you could expect and more ","useful":1,"cool":0},"enQCykaCoqGDYoxieedXSg":{"text":"Joey K's was great!\n\nThe prices are good and the helpings are huge. I ordered the catfish ","useful":2,"cool":0},"VSg600fTOcVIC7NjqCO8Vg":{"text":"This place was nothing to write home about. Wanted to give it a try because of the their a","useful":1,"cool":0},"T16IGtdKFaKDEmlmD4APdQ":{"text":"Came here for lunch and had the red beans 'n rice entree with iced tea. I'm not 100% sure ","useful":0,"cool":0},"AfcAQPVyXTmOlL_mYz2NUw":{"text":"The food here was very good. We shared the fried artichokes, which were amazing, and the S","useful":0,"cool":0},"aO8iMDzEKGPHy_j_gvFC7A":{"text":"While traveling in New Orleans, we visited this quaint little restaurant.  One of the feat","useful":2,"cool":0},"Ey5w9Q_lVpJclliMfIHsbg":{"text":"Went there on a Wednesday evening during the second week of Jazzfest. The Oyster plate was","useful":0,"cool":0},"3IOmNzVCq2P-79f3P1hhzg":{"text":"There are so many amazing restaurants in New Orleans and this is not one of them.  Weirdly","useful":0,"cool":0},"BkvxF5ylnT3hSmZmQBp3IA":{"text":"Ate here on 5/9/15 for lunch onion rings to die for but the poor boys need some work, lack","useful":0,"cool":0},"KCpv7lmSyXi7GmrBNfVp3A":{"text":"Every time I visit here I'm never disappointed. Food is home cooked and delicious with dai","useful":1,"cool":1},"vSIOP-MLdCgHJ17lUTWdgQ":{"text":"I had the Red Beans and Rice and sausage dish. It was delicious and savory. Reasonable pri","useful":0,"cool":0},"zYVnMApFzQEzz0XsRTo2ww":{"text":"OMG the best Sangria in New Orleans and Blackberry Cobbler. I could eat there every night.","useful":0,"cool":0},"dempGD1LUuN0R4svv8tvwQ":{"text":"A group of 9 of us with 4 kids. The food was amazing.\nMy 8 yr old inhaled the beef brisket","useful":1,"cool":0},"LMQuxPCXUxHEKleSGZ7utg":{"text":"Came in  March 2017 an was impressed enough to come back 1 year later. Great food and serv","useful":0,"cool":0},"_Vh30xpYsI1dBT6GlhmijQ":{"text":"Fantastic food, great specials!   Came in for lunch with a group of 7, waited only about 1","useful":0,"cool":0},"D333ea5b-3UUEtAs83Qpsg":{"text":"Restaurant reviews are always super-subjective.  I mean seriously, if you can give a South","useful":9,"cool":3},"PtZNMBwiBa_aSBDG6DzZJA":{"text":"I had greater expectations for this restaurant and was slightly disappointed by my experie","useful":0,"cool":0},"bTBxOBwdwkEKqYw_kZ7lXw":{"text":"This place was featured on Food Network's \"Diners, Drive-ins, and Dives.\" If you ask me, t","useful":2,"cool":0},"84g9xjizL0BjDQUpJWQubg":{"text":"We have been going here for years.  It is just really good home cooked New Orleans food.  ","useful":0,"cool":0},"eh4X7ysIZFKTJ1zniv6rYw":{"text":"We had a great lunch here while wondering around the garden district. Love the casual atmo","useful":0,"cool":0},"TbmHxcZs1dvFX1-27D46KA":{"text":"Meh. Maybe I just wasn't hungry that day, but nothing about this place particularly impres","useful":4,"cool":3},"wJ1wAK9N4puheUeA5ZLBew":{"text":"Awesome! Love the red beans and rice! And the cold goblet of beer makes it just about perf","useful":0,"cool":0},"QGqZIt9m3c3-P9zxYb40fQ":{"text":"My friends and I were hanging out on magazine street early in the afternoon, so this was w","useful":1,"cool":0},"bKWfa_zbDq3TuDi11L8YPw":{"text":"When you are picking out a spot to get something to eat, you must try out Joey K's. It is ","useful":0,"cool":0},"yQzbesEp6Dhleu_DZdVwDA":{"text":"Friendly service, the place looked cool. Food came out fast and piping hot, but I must con","useful":1,"cool":0},"5kHnkkYB6CbzNfyN75-__A":{"text":"Does this place need another glowing review? YES!\nFantastic neighborhood bar with great lo","useful":3,"cool":3},"0ivPKrBFAWbsxhI2BUOgrg":{"text":"Went here for lunch. with a vendor.  I got the Trout Tchoupitoulas came with side salad, n","useful":3,"cool":0},"Qd4foqUFIF2_2xsstx22mg":{"text":"I came to New Orleans to experience good food and this just was just mediocre. The gumbo w","useful":0,"cool":0},"FNcRs_XSmB4G7gDLav7Wfw":{"text":"Great atmosphere. Had the catfish tacos which were excellent. We also had a Po boy cheeseb","useful":0,"cool":0},"Nuay6ftyvL8XgmCPjh5Vmg":{"text":"Split a fried seafood platter with a friend. Good price for the portion. The fried seafood","useful":1,"cool":1},"PXiEjtwhhkT63t9FMUlc9w":{"text":"I went here today for lunch with my coworkers. While the food was delicious (grilled shrim","useful":0,"cool":0},"09V-1g3nJeiKw4HoLLBa7g":{"text":"I got the Trout Tchoupitoulas.  I don't remember what any of the other three got but the f","useful":0,"cool":0},"4UOH8O_r3IPe-XdvQ_O2JA":{"text":"Everything that we have tried has been great! Always friendly service! My favorite is the ","useful":1,"cool":0},"Blfxzt9ghh5g_wFJeuxRXg":{"text":"After a week in New Orleans, we were looking for a good meal at a great price and somethin","useful":0,"cool":0},"fouvIBDSuUXBY0oZcv54gA":{"text":"Service is a hit or miss here. The last time we were here, we were sat immediately but unf","useful":0,"cool":0},"EQxaLl-4m9aEjAg24dH87Q":{"text":"This small place really gave off a good vibe. My friend and I were just going to the art s","useful":0,"cool":0},"NPQI3CIHexdzrpiLsb41kw":{"text":"Great authentic restaurant off Magazine Street in New Orleans. We were visiting from out o","useful":0,"cool":0},"D4_9euDxB0UtkAUw0GmaNQ":{"text":"This restaurant was recommended by a tour guide hanging around Lafayette Cemetery. He also","useful":0,"cool":0},"Yr1PD4h2qV9YdOs6p-UA6Q":{"text":"This place is SOOO good! MY boyfriend and I went here for dinner when we were in New Orlea","useful":0,"cool":0},"64ixBDbK9O-rh8uVhEwMxg":{"text":"I really like Joey K's. The food is solid and the prices are great! \n\nI've had the red bea","useful":3,"cool":0},"PiqOIQumzirP16IDk_1W_Q":{"text":"Recently went for lunch. Had a meatloaf patty melt, which combines two delicious foods int","useful":0,"cool":1},"C2vsUDkJ0bgGoyMK2KPXWA":{"text":"First of all, I must warn anyone, not just tourists but locals too, to beware of parking N","useful":2,"cool":1},"9vU3LLtVmEeb5syOf9C4HA":{"text":"My gf and I came here for lunch and were not disappointed!  I had the eggplant Napoleon an","useful":2,"cool":0},"QvGI9z7LhQs05mWuXMLjZA":{"text":"Nope! No ethnicity diversity plus no greeting. Nope! Bye!as seen on tv my a$$ no no no, Th","useful":0,"cool":0},"mKzd95g6Zug61UvVV-4zBQ":{"text":"OMG, the specials are to die for!  I asked what they were and ended up torn between the Sh","useful":1,"cool":0},"owdWoPBsTNglIGNN5nvvEA":{"text":"This little place makes delicious food! If your in town definitely go! The service is amaz","useful":1,"cool":0},"1K1bcJc1Y8ELCw8XxftUow":{"text":"Rating based on the Bloody Mary and really friendly service. Best Bloody Mary I've had.","useful":0,"cool":0},"qPG5grLVLuyc_SO9thNVvA":{"text":"A short walk from Lafayette Cemetery No. 1 & the Garden District houses. We had a nice lun","useful":0,"cool":0},"I3U1vhMaDn28HciPDs0fLQ":{"text":"Hands down, best Red Beans & Rice I've had anywhere! Casual, relaxed, atmosphere. The catf","useful":0,"cool":0},"T0NX1dBEHijhJiIw7hD9QA":{"text":"Good food and good service !  I have shrimp magazine which was full of flavor but I though","useful":0,"cool":0},"iGRnzQHs6iH0BxbpsMoFHQ":{"text":"Great southern food! Busy atmosphere but it's in a prime location. love their daily specia","useful":0,"cool":0},"paWzl38IXfjz4zxFzGojLw":{"text":"Recommended by our cemetery tour guide.  Great food with full servings. Among the four of ","useful":0,"cool":0},"LwZVf7AnFBjQaadgNRRjgQ":{"text":"Great food , 2nd time here and has not disappointed . Excellent service . Prices are very ","useful":0,"cool":0},"HxvraoEssbxY-h5XufIgKA":{"text":"Delicious eggplant Napoleon, goes great with a cold beer. Yummy sweet potato fries. Don't ","useful":0,"cool":0},"YrfYv1kyZFxw0zGqQ62kCQ":{"text":"We went here on a crazy day--the Irish Channel Parade. We weren't particularly hungry and ","useful":0,"cool":0},"e9UOsP05ZmvneGz36AYl2w":{"text":"Get the tacos- best tacos I've had to date. Mimosas were a little slacking ... need to be ","useful":0,"cool":0},"NEZkR88jO-8ejdHW5c07yw":{"text":"I came here on a Sunday.. yelp said it was closed but it said another place was closed tha","useful":0,"cool":0},"MhxG6_zKs_r6yupVT77AFA":{"text":"I got the eggplant Napoleon after reading some good reviews and it was terrible. So heavy ","useful":0,"cool":0},"dq5L_9yuxgv3cxQNFHMjcw":{"text":"I LOVED the corned beef & cabbage!! I guess everyone throwing cabbages from the St. Paddy'","useful":0,"cool":0},"hpXGSoHgEfygoDaoAbfgrw":{"text":"Dined here for lunch with a party of four on a weekday afternoon. We were on the late side","useful":1,"cool":0},"2wfOcakWFh_KtlsvTUl0cQ":{"text":"We visited New Orleans today and Joey K's restaurant was recommended  The waitress Shiree ","useful":0,"cool":0},"WmFtIv4d8EBOVctb0QvXdA":{"text":"Really enjoyed the atmosphere , as well as the meal. Me and m y wife had the hamburger ste","useful":0,"cool":0},"gs98dosVWtiVsO4WM-qGHw":{"text":"After 4 days of the French Quarter it was nice to head to the Garden District and eat at J","useful":0,"cool":0},"38Rnj84pNAyJDoZU0IwWKg":{"text":"By far the best chicken parmesan on Magazine St. They have such a nice selection to choose","useful":0,"cool":0},"ZORU4ewAfS28KBG8VJPrvA":{"text":"Great comfort food at a reasonable price. We enjoyed the meal and everything we ordered wa","useful":0,"cool":0},"fBWFq-0dATASGZc9wCVDgA":{"text":"OMG!!  Kylie was our server. We had red beans and rice with Andoullie sausage. Just a ligh","useful":0,"cool":0},"jVIjwhHG8TO8kWxE0J4UYA":{"text":"We had the gumbo, red beans and rice with sausage, shrimp salad and fried artichokes and a","useful":0,"cool":0},"VgIBYpM9DafdEGUUoXA3bg":{"text":"Went for lunch and got a side salad and red beans and rice...should've held the salad beca","useful":0,"cool":0},"edSthIUlY_8-hRtbDMqv4Q":{"text":"The catfish was amazing and the jambalaya. Great service. The mimosas were also good.No co","useful":0,"cool":0},"wq3X3cwN28LG9Mlt5FI7bQ":{"text":"Food was good, chicken stew, but cold, even after I asked for it to be warmed.  But I did ","useful":0,"cool":0},"fMKbSI3zB83xLD2MzCUvNw":{"text":"This is my go to place when entertaining out of town family and friends. I always pump the","useful":0,"cool":0},"1OzH-jwlB_0zApdMiJrnzA":{"text":"We enjoyed our lunch stop at Joey K's upon the recommendation of a local photographer we m","useful":1,"cool":1},"0RKLdaCLZkb85XWJo7n9Bw":{"text":"A cool local spot to eat in New Orleans. We got our food out very quickly and didn't need ","useful":0,"cool":0},"XA7ON3h2zdRJFFasFGC0tg":{"text":"Found this little gem while walking down Magazine St. I had the Monday special. Corned Bee","useful":0,"cool":0},"ln_RWEUhvnb6q5EDW8fsbg":{"text":"Food was definitely good, but the service sucked. I've been treated with more kindness at ","useful":0,"cool":0},"HZ16603OMSQpGx1HIEYxqg":{"text":"Stopped by for lunch and was very happy I did! Started with the crab and corn Beignets and","useful":1,"cool":0},"tWrjt-vs-EQIuVOiRcLepA":{"text":"In terms of service, our waitress Kylie (I believe that was her name) was exceptional - sh","useful":2,"cool":0},"gYsPDul6gSxMFinngGrzRw":{"text":"Came here on a weekday afternoon by myself, they weren't too busy and offered me a 4top ta","useful":3,"cool":1},"6BGLag3LGITmlyuOzG6Zqg":{"text":"Believe it or not, I had never set foot in Joey K's until recently, although I feel like I","useful":3,"cool":2},"fGAHBHQ4MnxYaAcurUublg":{"text":"Very nice. I really like this neighborhood and we enjoyed the food here. We didn't sit ins","useful":1,"cool":1},"VNNQkMpabXT4UutjytJzOA":{"text":"If your looking for hometown New Orleans style food ,this is it ! Locals love it and so do","useful":0,"cool":0},"ZchEwmHigjDdEiCzQN88sQ":{"text":"Dropped in here for lunch while shopping on Magazine. Yummy food and good service. My gril","useful":0,"cool":0},"yE6KD6pWVI5mbmuwZOmKyg":{"text":"I'm a local - brought my out of town family here for lunch yesterday based on a friends re","useful":1,"cool":0},"_lTTRCEGa_NUZS4lkdlbJA":{"text":"We live in the neighborhood yet have never eaten here. We decided to try some takeout, and","useful":0,"cool":0},"ApA1PlMA3coy3fMGxyEO8A":{"text":"The service here is absolutely terrible. I came here to eat on my last night in New Orlean","useful":1,"cool":0},"Jn070qz56cuw-jjZwCFv5Q":{"text":"After several attempts during my three years in NOLA, I finally ate at Joey K's this weeke","useful":3,"cool":2},"MPzwk25YeMxWJ_5noV-kfA":{"text":"I am not from the area so this was my first time there. The food is incredible. I am not i","useful":0,"cool":0},"VcO82psBrAHM1t1-QNk-tg":{"text":"I had really high hopes for this place. I pass it all the time and had always wanted to tr","useful":0,"cool":0},"oCgqBkCQHhIHuU0VpVPXYg":{"text":"Eggplant Napoleon and Shrimp Magazine were awesome. The salad was very fresh and the home ","useful":0,"cool":0},"6ASomWpwDzs8DR07XWPFjQ":{"text":"Staff ignored us.  Had to walk up and ask how seating was handled.  Maybe invest in a sign","useful":0,"cool":0},"0DLWzbR2aImVT3kCEFgTgA":{"text":"Cozy little diner in the Garden District. Try the Eggplant Napoleon... so delicious! A lit","useful":0,"cool":0},"xQwgI5DqQNOoM1CmiuV_4w":{"text":"Had the crab and corn bisque and it was DELICIOUS!!! My friends got the seafood platter an","useful":0,"cool":0},"p8juBY9Vv6pNFHnmUby9iw":{"text":"Let me start by saying that this a cute place in a cute neighborhood . Lots of regulars th","useful":0,"cool":0},"qoOKHF6jyhkHlDq9VG_6gQ":{"text":"Went here on the recommendation of our tour guide. We each had a po boy sandwich. I had th","useful":0,"cool":0},"v76SwihueytLvhlvSaXZog":{"text":"I live the positive and joyful lively vibe of this restaurant.\nThe servers and cook are ni","useful":0,"cool":0},"ZcSAnOpUY4UckE8AHoVULQ":{"text":"Don't waste your time or money.  We were visiting family during the week of thanksgiving. ","useful":0,"cool":0},"FnALN3tq6H4G027FXJx90A":{"text":"I'm soooooo disappointed and so would Guy (Fieri) be if he came back.  The Eggplant in the","useful":0,"cool":1},"B6esmMyd_vgL2jtKWk2B1A":{"text":"Just what I needed. It's cold and dreary out, I'm lonely! So I sat alone and eased my day ","useful":0,"cool":1},"2mvdanWQoYadkxSvmHhNiQ":{"text":"Good place after a Garden District tour.  Had the catfish po'boy with Mac & Cheese side.  ","useful":0,"cool":0},"ZsfcUmloox_FVRaoYWgQ6g":{"text":"Fantastic, dive spot in the astute, mansion\n-ridden neighborhood of NOLA. Started with fri","useful":2,"cool":2},"DdSaeU3wuSwy-ZRgb3hNtA":{"text":"Pot roast debris with all kinds of good stuff on a delicious hoagie roll. This place has a","useful":2,"cool":2},"UiLBffTaCH2iu5X-S9bDtQ":{"text":"Joey K's is our go to spot for good home cooking. The atmosphere is very welcoming and war","useful":3,"cool":1},"h9bQnkiAcnfLIj_8axE1Yw":{"text":"What an amazing little local place on Magazine. Forget Mother's or any other packed touris","useful":1,"cool":0},"okSm1Lb-Hqh_wwAfZ54cZA":{"text":"Meh. Split pea soup was really salty. Servers were good. Food was adequate. Didn't justify","useful":0,"cool":0},"11ByxiLOKOaawp-nJBrvTw":{"text":"Most amazing onion rings!!!! HUGE portion!  I highly recommend trying the cobbler as well!","useful":0,"cool":0},"fc379tcG05JHB6LfCClLPQ":{"text":"El shrimp magazine me pareció soso y vulgar. Pasta un poco pasada con una salsa con gambas","useful":0,"cool":0},"eLjImvRsBHQS9qcRpXyAJg":{"text":"met a childhood friend here 2 days ago while vacationing. very reanably priced with friend","useful":0,"cool":0},"0Q2P7JzgvnyWUpU4L0vEJQ":{"text":"Great fried green tomatoes, fried chicken and red beans and rice. Overall, food was delici","useful":0,"cool":0},"SvyU4DZ3CsSsKOioHWT8NA":{"text":"Is this a house or a restaurant? It, literally, feels like someone's home. It does not hav","useful":1,"cool":0},"WlPPloMqz_ckDPGEHRPTtA":{"text":"I love Joey K.'s. It's that home-made kind of food that you just don't see in restaurants ","useful":3,"cool":1},"E0eq--jDSXMLvFxOs6UsJQ":{"text":"The last time we visited the Garden District, I have a vague memory of wandering among the","useful":2,"cool":2},"btWj8551SgqjvBoVlZEwYg":{"text":"Had a great lunch there after getting frustrated and lost on the Nola bus system I felt mu","useful":0,"cool":0},"OS0oXN4HfrTFPupWeEGz3w":{"text":"Nice spot for a good meal. We ate for lunch. Good service, friendly staff good prices, and","useful":0,"cool":0},"eUe8aUX8z_Y5Nwtor42LIw":{"text":"I really like this neighborhood restaurant.  I've eaten here 5 or 6 times now.  The food i","useful":4,"cool":4},"dEVtiVXQ4uW5tMdLAZxUbg":{"text":"Joey K's is my go-to place when I am craving as close to a meal cooked by Mom.  You cannot","useful":0,"cool":1},"sZ2armxq-fKnEimrQv6L-Q":{"text":"Great New Orleans food! Recommended to us by Matt our Garden District tour guide! We had t","useful":0,"cool":0},"Ez6WxpEhhqS1pcCm6ptn3w":{"text":"Recommended by someone at the visitor center - did not disappoint! Great first po' boy in ","useful":0,"cool":0},"TWJsQqlQOZe3EzylhRC-LQ":{"text":"Good food. Good atmosphere. Went there with a somewhat big group (10?) without a reservati","useful":0,"cool":0},"c3dW4cTIyA-15_kuY-2z1g":{"text":"Took an Uber to meet friends for lunch and went here instead because the other Restuarant ","useful":0,"cool":0},"jqsBY5Cqi6swz9fDBkUY9g":{"text":"Moderately busy, good loc on magazine, cold beer. Service with a smile?  Hell no after it ","useful":0,"cool":0},"dSM74aEtrdQL4RJmpIHqIA":{"text":"Best red beans, rice and sausage in town. Best onion rings I have ever had anywhere, anyti","useful":2,"cool":0},"sFer8GsjLgK9WVP8ivQsVg":{"text":"Wouldn't know how the food taste. Arrived at joey k's at 8:50 on a Friday night to be gree","useful":0,"cool":0},"XCnltMUrY3Z6GJwrqmyWWg":{"text":"Had an appetizer of the red beans and rice which was bursting with so many flavors. For di","useful":0,"cool":0},"FaZsrKC97xLL_NzAui6www":{"text":"Came here today.  I had a better experience...Had the cup of gumbo with okra and sausage. ","useful":1,"cool":0},"jZov7kJmoRRT_XQZK4WEhg":{"text":"went for lunch when we were in a rush.  I had the grilled chicken po boy and my husband ha","useful":0,"cool":0},"ciclTl1UskDFa4pP8POomA":{"text":"The food was outstanding. Ordered eggplant napoleon, shrimp magazine, and artichoke hearts","useful":0,"cool":0},"p9SmTS1-6FXQ7iF8YhYFCQ":{"text":"I went there the day of the Irish parade.  They were very busy.  The staff was friendly an","useful":0,"cool":0},"NEsdlBWt9WsISuSWEmlxhw":{"text":"They always say chicken is better in the south! But i know now that EVERYTHING is better i","useful":1,"cool":1},"mtXBCbpE_bDH0Ryw5a9iqA":{"text":"Great and friendly service. Definitely try the onion rings. They are so tastefully seasone","useful":0,"cool":0},"pHhTOpTjeH8Jq17zBNMOag":{"text":"We scheduled a large dinner party (25 guests) in the private upstairs area for a graduatio","useful":1,"cool":0},"WVGyRTcLuzSOSOZSdby7jw":{"text":"Comfort food at it's finest!  I've had both the chicken parm and spaghetti and meatballs h","useful":1,"cool":2},"j7VCdSDASRTTZilRDNj9-Q":{"text":"Eggplant Parmesan - not so much\nOnion rings - very good\nMeatballs and spaghetti average","useful":0,"cool":0},"sTbRrFyo1i-DEl8OCAZhRg":{"text":"I arrived with a friend of mine and had to track down the host or list taker not sure what","useful":0,"cool":0},"les5j79qJvU6TpDnK-cq5g":{"text":"Food was good, enjoyed the shrimp po'boy and gumbo. They were able to easily accommodate a","useful":0,"cool":0},"BsrlMNELy8VJ_Glhrf3XMA":{"text":"Awesome place with great food at reasonable prices. Bright, clean decor and a cheery staff","useful":0,"cool":0},"-LZoPruMCHgMpZ7feCe1fA":{"text":"Have been eating here since 1993...so nice to know you can come and get great food with fr","useful":0,"cool":0},"fwHpTszth8G6BISNCdprJQ":{"text":"Great food and very accommodating staff. We visited Joey's based on a recommendation from ","useful":0,"cool":0},"Z2GdATLf36kHYvRoUuAFlA":{"text":"Clean, friendly, fast and good food - we were walking our own foodie tour and shared rice ","useful":0,"cool":0},"7Ch9phDOiYf1enMDghTcow":{"text":"Great place to eat! I sat at the bar, so my server was the bartender. Very nice, quick ser","useful":0,"cool":0},"BARBdkKMEwvzvXTnodxSCQ":{"text":"I missed out on a voucher to get to Nola. So it's my friends are celebrating a birthday. W","useful":0,"cool":0},"8exc2RhpD-QokzxhEhfFdA":{"text":"Wenn selbst die Amerikaner sagen, dass man eine gute Wahl getroffen hat, dann soll es wohl","useful":0,"cool":0},"2W2PpSQORBcfvxOV9_SLpw":{"text":"Was excited to try this spot, and it felt a bit more like home cooking than most places. F","useful":0,"cool":0},"TeiKfC7XB-9vaY226DowDg":{"text":"Chicken cordon bleu, cornbread, and sweet potato fries were DELICIOUS. The gravy was the b","useful":0,"cool":0},"ck070LJtJdeIez1eCvSgcQ":{"text":"Someone recommended trying Joey Ks for lunch so we tried it one afternoon.  Cute place on ","useful":2,"cool":1},"0inC1UnaIbQILuPlGfGFEg":{"text":"We ended up here by the public transit ($3) all day pass because we wanted to visit the Ga","useful":1,"cool":0},"XmmLXDdWhYY5GLH3ZmOCEw":{"text":"I thought Joey Ks was fair. The food wasn't horrible it was just lacking a little flavor/s","useful":4,"cool":2},"r6-ryv1Jc_WsY-r_Kl1l-A":{"text":"We were wandering the area in and around the Garden District after taking a nice tour of t","useful":2,"cool":0},"9gmyUg3JpO3MAAhuAKWBsA":{"text":"The cheese burger was so greasy it soaked the bun clear through. The salad dressing was so","useful":1,"cool":0},"YMHPSrCXSd4juL2hPlAAVQ":{"text":"We were friggin' exhausted.. walking all over the place before and after our tour of the G","useful":4,"cool":4},"588W7SaC-wVj-1yUwwuWYg":{"text":"Had lunch here today and I loved it. The service was a bit slow and it felt a bit crowded,","useful":1,"cool":0},"xVT6Pi6sqv28cRMZ9-ckXA":{"text":"The best fried pork steak ever with mashed potatoes, gravy and green beans. All the specia","useful":0,"cool":0},"bmmbcd8gXBYpvoAObtoKuA":{"text":"GREAT food! Our group had the onion rings (the best I've ever had), po'boys, crawfish, and","useful":1,"cool":0},"qRb_OO_efjUxUDYPP2Uarw":{"text":"This place is so quaint and fun and sassy! The food is delish... They infuse so much flavo","useful":0,"cool":0},"4sKUvClip4G0ERz0GvwYcA":{"text":"Cute restaurant with many signs to read painted by local artist SIMON. Food was delish... ","useful":0,"cool":0},"qQjEBSYgXuOslPhnPm0mjg":{"text":"I've given this restaurant multiple tries to get it right but they just can't. My gf likes","useful":0,"cool":0},"wghDqLNRuzYs8HhIGi93wQ":{"text":"The Eggplant Napoleon is the only thing I tried here besides their rice and beans, which s","useful":2,"cool":1},"XjYTmI1erDz1uFtr6xxCFA":{"text":"Went on a Saturday afternoon and it was very busy. We did however get our food fairly quic","useful":0,"cool":0},"sKte1BP0U8XcnvP3rDZ2JQ":{"text":"Honeyyyyy the chicken fried steak was worth the 600 miles I traveled to New Orleans. It wa","useful":0,"cool":0},"bE8LxCBEv12Y7To9cQz8TA":{"text":"We decided to grab lunch here before we took a Garden District tour.   We arrived and it t","useful":0,"cool":0},"bktSVx72UoieuTVZ2g9apA":{"text":"I'm torn.  I did not have an awesome dining experience at Joey K's but I had an excellent ","useful":0,"cool":0},"QVWfqV9_j5y00mMu6V6tnQ":{"text":"Finally was able to visit Joey K's and the food was as good as I had imagined it to be! \n\n","useful":0,"cool":0},"E0Yn-krcgOr2Y3qERe0UYw":{"text":"This diner is a true gem! The food is very good and very much comfort food that definitely","useful":0,"cool":0},"MapO63DCE1DqUzlnUHUWGg":{"text":"Food was decent, but over priced and we waited two hours for a table. Our server completel","useful":0,"cool":0},"LWOUwgPCxAhQ0rpWwSp6og":{"text":"HORRIBLE SERVICE!! Waitress completely ignored us, did not offer us the available table an","useful":4,"cool":0},"RTyo-FSK9fQ1_Gc2mBKegw":{"text":"What an experience!!! We had such a great time this evening at Joey K's. Everything, from ","useful":0,"cool":0},"yB1lOHv7pUzxGW_dJvdj6g":{"text":"I've wanted to try Joey K's for a while.  I thought they must have good food since their b","useful":3,"cool":1},"uSWIr6ZTx7EI2YWyOTxs8w":{"text":"Great local joint in the Irish Channel. Quaint atmosphere and very attentive staff.  No re","useful":1,"cool":0},"YH1dtrtXyLaP-iFAcbTALg":{"text":"We recently held a party in the upstairs dining room. Perfect event!!! Food delicious, ser","useful":0,"cool":0},"LfpMNhvVVpg-jXpABvC_dA":{"text":"Perfect fried catfish Po boy dressed.  Perfectly toasted bread and the catfish was light a","useful":1,"cool":0},"YexRBpi__vxSgpeCdRnrOQ":{"text":"This place is DISGUSTING 100% the service was unfriendly we waited about 5 mins for the to","useful":0,"cool":0},"14ux-MFAw4CvZv3K8aVzXQ":{"text":"We went on a walk where locals go to eat in the Garden district. At least that is what we ","useful":4,"cool":4},"eRl1S3xw1RK7qFKjyAa5pA":{"text":"Honeyyyyy the chicken fried steak was worth the 600 miles I traveled to New Orleans. It wa","useful":1,"cool":0},"Fux-V2Ll1sw9iVNWT2-kuw":{"text":"Great break from shopping (and the heat). We had a delicious lunch and friendly, efficient","useful":0,"cool":0},"B6bwzZ7XPwBNvStMz2SGZQ":{"text":"Wandered in on a Monday before closing. The service was nice, but not overly attentive and","useful":0,"cool":0},"0n4Ns8vQh4dF67K5xRLFEQ":{"text":"The food here is awesome! I was in town for the weekend and really wanted some comfort foo","useful":1,"cool":0},"UhqB-6nxnTUMaUgIXbLgnA":{"text":"I got a fried green tomato po boy to go, and it was delicious. I can't decide if I like th","useful":0,"cool":0},"wCRGey2WeATcOWj9s9NuTw":{"text":"Several months after my trip to New Orleans, I keep wishing I could go back to the bar at ","useful":0,"cool":0},"q5c3WYlY0qmWjOPkPgcUwg":{"text":"This is a wonderful Magazine Street restaurant. They have a nice selection of Cajun/Creole","useful":0,"cool":1},"_HGkrdax98uS2wbZig55TQ":{"text":"Delicious! Try their signature Shrimp Magazine! It was \nFeatured on  Drive-Ins Dives TV sh","useful":1,"cool":0},"cc4qBIIdeIlWyiRjqR-2PA":{"text":"This is another typical Only-in-New-Orleans, family-style, neighborhood restaurant. They h","useful":9,"cool":3},"DcajVvyXUa5AkLeGX4_6Fg":{"text":"Greatest fried chicken strips. Great location. After you leave you can just stroll up and ","useful":0,"cool":0},"3mL9kLUDezQgSsVvITY0_A":{"text":"Wonderful food, great prices. The waiter did a great job. The food tasted just like your g","useful":0,"cool":0},"UtLQLr0SjqHDUUQ1lM86xg":{"text":"The atmosphere was very nice. This was my first time visiting on my birthday. The food was","useful":0,"cool":0},"gED3rdmyJoerawiCXhrVMg":{"text":"Food is okay.\n\nBut horrible service! The guy serving us (white guy with gray/white hair we","useful":0,"cool":0},"8SVpQRTMvl-D358FVEPtkw":{"text":"Seafood platter is the way to go at Joey K's it's a little bit for everyone perfect to sha","useful":0,"cool":1},"SrcYHJMA7jRyaTcFI6K3-Q":{"text":"Great meal tonight. I had the JK Combo tonight. It was a small roast beef poboy (a little ","useful":0,"cool":0},"FLVOR45GFJ9XjtHsepbUUQ":{"text":"My cousin and I decided to eat at Joey K because it was right along the street where the S","useful":1,"cool":1},"AdTnEefWs5-CFJQly6tZCA":{"text":"So delicious!  Try the Eggplant with shrimp - wow!  Delicious.  The red beans and rice are","useful":0,"cool":0},"XhSVW0E4plXO13P1ZH-1Kw":{"text":"My husband and I really enjoyed the food here! I am not giving it a 5 star rating on the s","useful":1,"cool":0},"Vlp9mlqgjxNWp9FM3X02Sg":{"text":"This is my first time having authentic chicken fried steak, it was incredible. Our waitres","useful":2,"cool":1},"FF1dSgApfHaOE3FTb0_osQ":{"text":"Went here for my birthday a while back with my sister and wasn't as impressed with it as I","useful":1,"cool":1},"r1LGhti-3c5txAPXNINvQA":{"text":"This was my first time I have tried this restaurant and I was not pleased. I got the meatl","useful":0,"cool":0},"P6JDWvrChUpPY-sRflheEA":{"text":"What a great lunch we had at Joey K's this afternoon   The service was excellent, the  foo","useful":0,"cool":0},"XgRy1B3CgwKZV6KkGq3w_A":{"text":"My partner and I are visiting from ATL. He has never had fried catfish, so we came here to","useful":0,"cool":0},"HiFkExyFd6l3CbrkWBBwJw":{"text":"Our waiter was very nice and attentive. The food was mediocre and bland. However, the brow","useful":0,"cool":0},"wyf6KWN2UYTRmker_KVTbA":{"text":"Was hoping this would be a good choice given how many people were here on a Friday night b","useful":2,"cool":0},"AI3K5l67y685hmFNXfiRLg":{"text":"This is a generally good restaurant with several daily specials and a decent small bar.  U","useful":2,"cool":2},"ndNFmWUQ8iiEirkFaAAt_A":{"text":"God awful spent $45 and it was trash. Soggy cat fish and fries, my Girlfriends Napoleon wa","useful":0,"cool":0},"mju7q7JIib_Cogrj7PkA2g":{"text":"New Orleans native, coming back to visit, and my sister was like \"what do you mean you've ","useful":0,"cool":0},"KUmZRfyvuyIMazUq3OtE8g":{"text":"If you want southern food in the garden district in New Orleans, this place is a good one ","useful":1,"cool":0},"OdFwMg_ob7IBgPFBVA6MjA":{"text":"We hopped off the Hop On Hop Off your bus to have a drink and ended up having an appetizer","useful":0,"cool":0},"8QSGgcJAOF3o70e3eLa9Cw":{"text":"Food and service here was amazing here! We had the Chicken Fried Steak special and it was ","useful":0,"cool":0},"UbbPfPoUGq707HUYxJwSJQ":{"text":"Great food and great service.  We tried this place after seeing it on the food network.","useful":0,"cool":0},"FHb5Ko2h271Wq5pBy6ML9w":{"text":"New Orleans staple!!! So good, just a little spicy if you aren't used to spice. Great New ","useful":0,"cool":0},"pMyf7ivWx5IP0q8WULT6vA":{"text":"This is one of the most delicious restaurants ever.\n\nI strongly recommend it. \n\nI ordered ","useful":0,"cool":0},"Oi98hNlA1RtUl9oXqSdtiQ":{"text":"Good food and quick service!  I enjoyed the atmosphere and had good lunch menu. Salmon sal","useful":0,"cool":0},"e2ez2-GAQ2CJINT5j9Q4Ww":{"text":"We had another wonderful experience eating lunch at Joey K's! Our server was Gabriella and","useful":0,"cool":0},"6MkUIxmvTyUB4LkWN1h_pA":{"text":"We sat upstairs in a spacious room with only 5 tables in the entire space. The staff were ","useful":1,"cool":0},"MD4Glht7ZjsDWzfmfCJOkg":{"text":"This was so yummy and flavorful ! Sat at the bar & ate it. Nothing like tasting a flavorfu","useful":1,"cool":0},"xdxz81PgjWSVGk8CmEOzRg":{"text":"Stopped in after a long stroll through the Garden District envying the mansions and manicu","useful":0,"cool":0},"GkNph22yyleQvKiOolh-cQ":{"text":"First time in New Orleans in several years and we're not staying right in the quarter and ","useful":0,"cool":0},"5pD1fndieg21JfpU0trDNw":{"text":"What an adorable restaurant! The menu has lots of choices including a kid's menu. The $5 s","useful":0,"cool":0},"m8WsjHzdW-Qe9tYsd4ZgGg":{"text":"I've driven by this place thousands of times, and a few weeks ago I finally stopped in for","useful":0,"cool":0},"NE30nqzKiaHKp9vQ2tXxIw":{"text":"While my boyfriend and I were visiting New Orleans, we were brewery hopping and as we were","useful":6,"cool":2},"UvtvwJd8U0l858uISI1B1g":{"text":"Good food in a nice, quiet atmosphere. I had the fried chicken with mashed potatoes and Ma","useful":3,"cool":0},"qDYr4hBk4l227JUiGkncpQ":{"text":"There's nothing more comforting to a hangover than walking through Joey K's doors and lite","useful":2,"cool":1},"CNxaSMGIy0MmUuTs_djpuA":{"text":"Tried this spot for the first time tonight and was not disappointed. Grilled Shrimp Remoul","useful":0,"cool":0},"ltX1C2iQEKbXVfyn7SFh7Q":{"text":"The eggplant was very good- but super heavy! It's best as an appetizer to split between 4+","useful":0,"cool":0},"ly2Zr0h2tUI_BPJHG3opQA":{"text":"Bomb!!! Brunch was great. We had the best server ever. Didn't get her name. While girl wit","useful":1,"cool":0},"avsfS_3tXb-wjCCRWOz-sA":{"text":"haven't eaten here in years...so after seeing that business is booming (probably from bein","useful":4,"cool":0},"h42GKXAnc_LR9JoBx9XzeA":{"text":"Food tasted pretty good. I ordered the chicken fried steak, however when i cut into it the","useful":1,"cool":0},"WYVUDXLK7-SO9KMERFKfLA":{"text":"We had family in town for Thanksgiving and decided to hang out on Magazine rather than the","useful":13,"cool":12},"csMrsR_k0af6XRJyfN0Zew":{"text":"Best fried chicken dinner and chicken fried steak. Alex deserves employee of the month","useful":1,"cool":0},"DB0ijAbOv7pxMcMbk-wnXA":{"text":"I really wanted to be more impressed by this place since it was featured on Diners Drive I","useful":1,"cool":0},"93I-ary_Od0SYrQOsxmeFw":{"text":"This place is absolutely amazing. One of my favorite restaurants in Nola. If you go, you H","useful":0,"cool":1},"Kq-hzvL47O9gm4Bp-AK5UQ":{"text":"Ok maybe its because I was summoned here because of my sister's birthday on a Friday and t","useful":2,"cool":0},"GFOCYRi1x4b_og89mINOUg":{"text":"Great food and amazing service. Gabriella was an amazing waitress. Great service and super","useful":0,"cool":0},"18b0ZGS6BNX0MKn9s0FT6Q":{"text":"First of all, we got to our table and it was dirty, we had to ask for our silverware, serv","useful":0,"cool":0},"pqruwwTHh-jqlmaOB2d26Q":{"text":"Hey!!! Big shout out to Joey k's for feeding the frontline nurses at Touro hospital during","useful":1,"cool":0},"cj5ttp7GZgh3lxerK0b1vw":{"text":"Was really a good place to sit down and eat something a little different. Amazing service.","useful":0,"cool":0},"nDas55MaLNQX19orLp_7Uw":{"text":"The red beans and rice are so on point and I normally don't like  red jambalaya but theirs","useful":0,"cool":0},"Nkr5tB6j-FRzj_D1ZO-QLA":{"text":"Amazing local restaurant. The roast beef poboy was better than most I've had. Highly recom","useful":0,"cool":0},"rJg2jWqbJ1-ywozIYuDbhw":{"text":"My friend loved the Eggplant Napoleon appetizer as an entree, she said the sauce was spect","useful":1,"cool":0},"9PpLqFV19oGuuG8Tbts2fw":{"text":"Wow!! We split the special for lunch. Half a shrimp poboy with a cup of red beans and rice","useful":0,"cool":0},"6F1RpyT2S1jifuIwGFMVkA":{"text":"Eaten here several times. Food is always good and price is great. Blackberry Cobbler was t","useful":0,"cool":0},"kc500_HcWjIrbEDMnxgnfw":{"text":"Went twice -- once for a late lunch and once for dessert. I ordered the salmon dinner and ","useful":1,"cool":1},"FU-RqF0IlpM-NuVPU8PRBQ":{"text":"This place has no shortage of fans locals and tourists alike but what a delightful spot. S","useful":0,"cool":0},"nSLFxuXBFrItASPBd8lNTQ":{"text":"It's funny that I gave almost every New Orleans restaurant five stars and you might think ","useful":0,"cool":0},"lNRNCv7ien3twTwaS2HX-Q":{"text":"Very good soul food restaurant.  Hearty portions of New Orleans soul food favorites.  Well","useful":0,"cool":0},"BF2Xlmtz7_HJG0o5xBSlGw":{"text":"Amazing service for large take out family meal during C-19 mitigation. Ordered dinner for ","useful":1,"cool":0},"2WqpF_d1SN7Odwqv_Vbl3A":{"text":"This restaurant was worth every mile it took for us to get here. We came 248 miles  to com","useful":0,"cool":0},"mzOR5TJAT6wkB1owmxwhSQ":{"text":"ALMOST EXCELLENT.  Such a cool place, I would definitely go again","useful":0,"cool":0},"1HYMyYxrUH02-k_AYWdsYQ":{"text":"This being my first time eating here I had high hopes. They were featured on triple D's so","useful":2,"cool":1},"4Un9k5uebo4MmeT1ZPFXCQ":{"text":"The food came out really fast! And the service was good. The catfish po boy was delicious.","useful":0,"cool":0},"WR4OCxhGrxS-3AfeV8d5jA":{"text":"So everything we ate was amazing! Recommend this place. If it wasn't for Yelp I'm not sure","useful":0,"cool":0},"Cy8Wk6elXr7mIV0epUEKQA":{"text":"My client and her husband suggested this place, they love it, and I've never tried it. So ","useful":0,"cool":0},"VWwCQCvrJ6MQ6ZgXGtqL2A":{"text":"This is a fun little cafe.  Very good mojitos and homemade food.  Would definitely eat her","useful":0,"cool":0},"qXFwdayM8hfJANdPSoNEWQ":{"text":"What a great restaurant! Quick, friendly service and cute atmosphere. Also, the food was a","useful":0,"cool":0},"jVHII9yAEIUxoUUIxC2-QQ":{"text":"The good and service was pretty good. I was recommended to come here for a meal and I wasn","useful":2,"cool":0},"ChvDxoaBd5okG7gQ30_aSQ":{"text":"I've lived here my entire life and love to visit the local restaurants. I haven't been in ","useful":0,"cool":0},"kkx6gcPf9PD71xZfassy3Q":{"text":"4 stars for service, 3 for food\nWe visited in early December 2018 and got the \n1. Trout En","useful":0,"cool":0},"Gf9z9h8t_2_qwOe-Fuxhqg":{"text":"Once again, Diners, Drive-Ins, & Dives finds a gem! I seek out triple D restaurants wherev","useful":0,"cool":0},"jX7B4UZmyFvWJD9lQlBpAg":{"text":"Food is great! We got the Shrimp Po Boys and they hit the spot. The ribs looked amazing, b","useful":0,"cool":0},"uPoFNzVArGERKWxhwVGQzg":{"text":"Boy did we luck out with this place! Everything we ordered was delicious. Unlimited fried ","useful":1,"cool":0},"wXTJrlHkS-z2vlJxR8Dc1Q":{"text":"Stopped by Joey K for dinner last night and it was great. For Magazine the prices are affo","useful":2,"cool":4},"ar0LtrOntdvzQyV3ZlwFxQ":{"text":"Came here after a long afternoon walking around Lafayette Cemetery. Chicken fried steak wa","useful":2,"cool":0},"GgfdNeBAsfG3YOAg3Mjk7g":{"text":"Waitress was horrible. We sat for 10 minutes and no one came to the table. I asked the bus","useful":1,"cool":0},"-f0RhmkDVFCcECprqzm_Pw":{"text":"This is a generally good restaurant with several daily specials and a decent small bar.  U","useful":1,"cool":0},"FAAA6vwkd1JUeaSy8pH2rg":{"text":"Neat little spot, open with indoor dining during COVID, limited seating. Some outdoor seat","useful":1,"cool":0},"WpiHzQvoiBXFgXEk_XjzCg":{"text":"I only ordered Bread Pudding to-go from Joey K's and it just okay.\n\nWhen you order the Bre","useful":0,"cool":0},"zT-2v7Ns53-RhkAi7XxZVQ":{"text":"Awesome place. The food was excellent. I will go back again when I travel back to NOLA.","useful":0,"cool":0},"isA1p5GQaLCNT8Ox7fK-Sg":{"text":"Tried the eggplant Napoleon entree it was ok, nothing special. I will try something else n","useful":1,"cool":1},"220xzM71tzvz9BJA1Oezvg":{"text":"Stopped here on my food tour. Cute little spot that looks old and southern. The food certa","useful":1,"cool":0},"Nw0IPRWEb0kPM5ureaU7Ag":{"text":"Shrimp and grits were cold! Wasn't what I expected at all it was basically queso on top wi","useful":0,"cool":0},"Fnaltd3S8mgkLSxhiLXOJQ":{"text":"Awesome food! Got the fried seafood platter and it's the best I have had in New Orleans! T","useful":0,"cool":0},"VXR1kLanMZpvIchSpsj0tg":{"text":"Stumbled upon this gem, mostly because it was the first restaurant we came to at one end o","useful":0,"cool":0},"Dn6ShG02z8CuM3_zL3I1kQ":{"text":"Southern fried goodness!  Joey K's really hit the spot for me and my boyfriend.  After hav","useful":7,"cool":3},"7x2Qz2Xiv6-0aIukn1Q8yw":{"text":"All you can eat PERFECTLY fried catfish, substitute a cup of red beans and rice for ultima","useful":0,"cool":0},"W1KQ-0EMWGaySp0bznVVbQ":{"text":"On a whim, we went to this place one night and it was a great surprise! If we could, we wo","useful":1,"cool":1},"yq3cw4Zx_58dhhE4yJVF7g":{"text":"Joey K's is a incredibly delicious must try. This is my second time visiting within a 5 ye","useful":2,"cool":1},"unGvQePRFG7-3RYr9dLMCw":{"text":"My daughter and I were walking down Magazine Street on a Saturday evening looking for a pl","useful":0,"cool":1},"-X78JIDfeUmQqehrxN2KxQ":{"text":"This place isn't bad. There were some solid flavors here. It's just hard for me to say it ","useful":2,"cool":0},"BAqN2mu0oHfvRJFVSlKRAw":{"text":"in town from PHX for the holiday weekend and got hungry poking around the garden district.","useful":0,"cool":0},"RJrJgguu8pCbAitUGQylvQ":{"text":"Poor Service! Sat outside because we had our dog with us. Took forever for the waitress to","useful":0,"cool":0},"VE6EXjZe4mCrL69dlH8rmQ":{"text":"Having been here before and other places that served similar food, Joey K is the best.\nI l","useful":3,"cool":0},"drCpX2dVBXZ5VcmU1IbKCQ":{"text":"Great place. Decent food. I'm a picky eater but there is one thing that you can never go w","useful":0,"cool":0},"L-JeAzafzd80jxnQ9Mm7uQ":{"text":"I ordered the all you can eat fish with a side salad, macaroni and cheese, and Apple cobbl","useful":0,"cool":0},"nWGgkC9ds4TcMkyL6XMQ9g":{"text":"Joey K's is a great place to visit if you're out and about on Magazine St.  The have a gre","useful":0,"cool":1},"3yhMOExrBj3vSone31WdgA":{"text":"Loved it. It was my first time dining there. I was invited to try their food and do a give","useful":0,"cool":0},"J35dPaIrmydKbIcLQSJk4Q":{"text":"OMG if you don't go to Joey K's and get that eggplant Napoleon, I can't help you!!! It was","useful":0,"cool":0},"U9oWDpgE_TtiLE2Kahsc4Q":{"text":"Delicious food. The quality and flavor is perfect for a home style meal. Portions are enou","useful":0,"cool":0},"gV-fd_t9LVgGVqy1n0K_Gg":{"text":"Food and drinks were average. We ordered a bunch of things and they were all missing seaso","useful":0,"cool":0},"hEmLoLs3TdEoko3IWpcKow":{"text":"This place was recommended to us by our tour guide and we were so happy that we took her r","useful":1,"cool":0},"bqK9HAiWSjrq_sd5sEl-lA":{"text":"This place is amazing! We are visiting from out of state and a local couple recommended th","useful":0,"cool":0},"TetbgfxXkjGVHNQuTGJvAQ":{"text":"AMAZING. The Crab & Corn Beignets had our taste buds doing back flips! Seriously, we order","useful":0,"cool":0},"OcJ_uQVZ2hml85wk9HA38Q":{"text":"This Place Rocks for lunch! 8 buck lunch special My partner had the chicken fried steak wh","useful":1,"cool":0},"9g-XO0G15YfMZ3to1K4wQw":{"text":"This is such a awesome decorated restaurant, plus amazing service. Our waitress was on top","useful":2,"cool":0},"3nVnrj8-PYvwgb6NOZpzng":{"text":"Hostess situation is awful. We sat once we walked in because the sign said no hover zone b","useful":0,"cool":0},"dJ0f4P6MZJ7TcCK6JZI7Rw":{"text":"This place is a tourist trap but it is a damn good tourist trap! In fact as we dined there","useful":1,"cool":1},"k2XjdGCwVBBAJdI8-WPjsg":{"text":"Service is SLOW and unorganized! We ordered a few apps and have been waiting 35 minutes. I","useful":0,"cool":0},"r0xyHPa71xu4gE1ymkRsLg":{"text":"Terrific, helpful staff - very organized on a large to-go order for 16 ppl.  The food was ","useful":0,"cool":0},"wSqx8GJuvpii-I7HXMOhCQ":{"text":"Yum, yum, yum. Soul food at its finest, in my clueless northern-roots opinion. It's easy t","useful":1,"cool":1},"BWMccNZtL2HoFvMqBXronA":{"text":"This place was fantastic!! The service was great & the food was spectacular! Everything my","useful":0,"cool":0},"1SDBOuKxQAaCIMAkUaHE4A":{"text":"Very good food, wife had roast beef sandwich and I had fried shrimp. Fried shrimp was pret","useful":0,"cool":0},"T8OAj0HlnuIY0kOLkXy0Ng":{"text":"After leaving brunch we decided to explore the shops in the area. We noticed the sign out ","useful":0,"cool":0},"0iSxN2wb202yXBGzFkgTEA":{"text":"OMG where do I start. The atmosphere was awesome everyone so friendly. A little lady notic","useful":0,"cool":0},"suj1xgLP2ZID2TR7M64UpA":{"text":"The food here is outstanding. Seriously! The chicken fried steak was absolutely delicious.","useful":2,"cool":0},"vAzRKCvF3IQGyia1hP5QDQ":{"text":"We were able to sit safety outside. Food was great (as per usual). And MASON was a lovely ","useful":0,"cool":0},"oDo7JnKjouunrk5MWECoXQ":{"text":"Excellent food and service!!  The shrimp remoulade salad was just amazing!  I love going t","useful":0,"cool":0},"GGwAVNx6y-XUIlDeAPlkMw":{"text":"Happened in on Joey K's recently. Ordered the roast beef Po-Boy. Unfortunately, they forgo","useful":0,"cool":0},"MnaKSALvTEijMpSLzlF59A":{"text":"Seems always busy so there's always a line. No place to wait to be seated. Crawfish looks ","useful":0,"cool":0},"Zs8LlVFwm2VGHRSm7QpM5g":{"text":"I went to New Orleans in April 2018 and I decide to check what Guy Fieri recommended on Tr","useful":2,"cool":1},"0oCtSrkQKwWb2Gn6KfvjRA":{"text":"Great gumbo and bread pudding. Fried green tomatoes and pasta were good but wouldn't reord","useful":0,"cool":0},"FUMtRQBs7AyVWqaPUjWxZA":{"text":"Joey K's is a solid New Orleans style neighborhood restaurant. \n\nI must've driven by Joey ","useful":9,"cool":6},"y4YEi4i4vnmh4h4wL1Mouw":{"text":"Second stop on the New Orleans food tour..\n\nCame here after hearing about the Eggplant Nap","useful":2,"cool":1},"j4shUmoxHs-oM8vHUIXQGA":{"text":"Nice little place on Magazine Street with good sandwiches and traditional New Orleans fare","useful":0,"cool":0},"ALlbjKzJFI5xPXemzxjYHQ":{"text":"best chicken fried steak - EVER! and onion rings to die for! service is excellent and atmo","useful":2,"cool":0},"qEoTMB4hSfjBSe122uKFeA":{"text":"Best comfort food ! Great neighborhood bar and restaurant. The white beans and fried pork ","useful":0,"cool":0},"16HcZ4otMuTkZD6TX4nELg":{"text":"The fried eggplant dish with fried shrimp and crawfish cream sauce on angel hair pasta is ","useful":0,"cool":0},"DmmWVsOG8XujSnYZSnMCVQ":{"text":"Disappointed....first night in NOLA and I was looking forward to seafood.  Staying on Maga","useful":1,"cool":0},"O-D86Hvqk76Ey6dHJz6bDg":{"text":"We came to New Orleans with a party of 12 and Joey K's was the only place that was super a","useful":0,"cool":0},"1RxWAFMy9AKWOz3TRgrmqw":{"text":"Great spot in the Garden District with good food. I tried crab and corn beignets and they ","useful":0,"cool":0},"XlpoRIm6lYydcz0Dl0v_gg":{"text":"Meh is the best place to describe this place. Feels like chain restaurant where all the fo","useful":1,"cool":0},"QJXmXmuR8eCMGrlsPbcSQQ":{"text":"If you're in the mood for comfort food with down-home atmosphere, Joey K's is a nice optio","useful":1,"cool":0},"fnpfHNb0_vdbFGLl7e_Q1w":{"text":"I had just arrived in New Orleans and was looking for a local's favorite place to eat. My ","useful":0,"cool":0},"4vy6pa9u4F9c0vmRomEwTg":{"text":"Love, Love, Love! Never a bad time, great prices for the portions. Goblets of draft beer! ","useful":0,"cool":1},"EGMrO9rzO1fW-_8rikHf0w":{"text":"Great lunch spot. Excellent jambalaya & red beans. Also had the fried shrimp po'boy. Knowl","useful":0,"cool":0},"WX0sM-EpgvYY1V9sR2r6uA":{"text":"Good food, very good service, and the cleanest bathroom in NO. Great place to stop after a","useful":0,"cool":0},"NJM3rq-G9fkF8ARShG_tkA":{"text":"Joey K's exceeded my expectations. While here for a business meeting, we stopped there for","useful":3,"cool":0},"4eQLEuuxn5SkI6V-T4StAg":{"text":"Best restaurant in New Orleans! Been here twice and the food is amazing. When traveling I ","useful":0,"cool":0},"HSaUkOE58KeWaYo5Tn-IAA":{"text":"We went here on a Friday night. We were seated immediately and they were following all COV","useful":1,"cool":1},"vky7cuhXuDfvQcYSOsgY2Q":{"text":"Oddly I used to not like Joey K's after a few tries, but now I've changed my mind. JK's is","useful":1,"cool":1},"VXmNt5okJMcdMYyPAEltqQ":{"text":"NON-DEVEINED SHRIMP: I know it's hard to unpoop 61/70s but its still kinda gross;\nSIT AT T","useful":9,"cool":2},"MVWGeipqk8mGK-ogqF52-w":{"text":"Definitely a more casual, low-key spot along Magazine with classic southern dishes.\n\nHighl","useful":1,"cool":1},"DECupTDuzUTYyL48b9N2Mg":{"text":"With apologies to George Lindell   http://www.youtube.com/watch?v=FCSBoOcGFFE\n\nI went to J","useful":3,"cool":2},"UEoM9qzyhz4BFYJVGq79UQ":{"text":"Perhap the only place where I am not the oldest customer! Always a large local crowd becau","useful":0,"cool":1},"FjvXmuwv16Llm3qNpZG0Sw":{"text":"Joey K's is my favorite restaurant. Today was such a wonderful lunch. We were able to sit ","useful":0,"cool":0},"m2NBplL3jkMEOfsulvE97A":{"text":"We loved it!  It did take a little while for us to get service but the food was worth it a","useful":0,"cool":0},"fZ63ZfXyFBhoMbYgtIV4DQ":{"text":"People seated after us got their foods first. Foods weren't close to average. Don't come h","useful":0,"cool":0},"6VQz5b9F11z1Vbe7mmyDRw":{"text":"A last minute whim, we decided to grab lunch before leaving town. I had never heard of thi","useful":0,"cool":0},"M9lzwS8VDP9a-DVScbZ9QA":{"text":"Friendly, local staff, goblets of beer, and decent seafood!  Not so fantastic that I would","useful":2,"cool":0},"_6ErcdpaPpKSJ4FXvp7A0A":{"text":"My family and I came here the other day for lunch Thursday unfortunately I have no good th","useful":3,"cool":0},"dlzj1Lk_jiADqn4NnYbe8A":{"text":"Finally got the time to try out Joey K's. I have seen it on social media and honestly thou","useful":6,"cool":4},"IDNsPpPkyISkCcojs01f2A":{"text":"Visited this place after seeing a YouTube video. We went in around 8pm and it was pretty e","useful":0,"cool":0},"Zhx-mKwoDXWI3KfrnGHs2A":{"text":"We were in town to visit our granddaughter at  Tulane Uni. and were looking for a restaura","useful":2,"cool":0},"2pCwo7csRA6bJ5EonI2HJQ":{"text":"I came here with a large group as my residency program used this restaurant to host our ap","useful":1,"cool":0},"wD3nhSo2onsmrblX8fGcWQ":{"text":"Authentic Louisiana food for a great price! The servers were welcoming, kind and attentive","useful":0,"cool":0},"G6-KcxNMmLL0TYwWqHZTDQ":{"text":"My last day in the city and I had to hit up Joey Ks! This fried seafood platter was everyt","useful":1,"cool":2},"sdntPK6K-M_GcSFv3y0GOw":{"text":"It doesn't matter if you are a hippie or a hero, Joey K's is delicious. Guy Fieri visited ","useful":1,"cool":0},"Bb0gaGuKigh8SkcJrrZg6g":{"text":"The food is great.   Make sure you check your bag for everything if you have a to go order","useful":0,"cool":0},"2IbEbu_R42Ie1DA784-cAg":{"text":"Jeff was an amazing waiter!!quick and friendly . Recommend the eggplant napoleon. which I ","useful":1,"cool":0},"uGGFbURoxmD9Vvd7g1NuUA":{"text":"I have been going to this restaurant since I was 4 years old and every time I go I truly b","useful":0,"cool":0},"ziq5_gtgDMIZfIOnkC5gbA":{"text":"We were on the \"On and Off\" bus tour in New Orleans (highly recommend it!) and we walked i","useful":1,"cool":0},"HeYM8gqXZKMSx5_hYpjqog":{"text":"Was not impressed with the service or food. Took over an hour for basic food, got multiple","useful":0,"cool":0},"s-bCdXA2NbVrXv0_aVyFhQ":{"text":"Fried artichokes were fresh and fantastic!  Marinara was so delicious. Shrimp Magazine wit","useful":1,"cool":0},"T29zwEHdBVbsZxehXFsisA":{"text":"This place is never open even when on both their website and social media they say the are","useful":0,"cool":0},"S_Ct411sc9FYXAL9DADA3w":{"text":"Very great fried artichokes. House salad and red beans and rice were great too! Fried shri","useful":0,"cool":0},"WcvObnUZo5Du7hFUssl5wA":{"text":"Yikes... Definitely steer clear.  None of our lunch was even remotely good.  My wife now w","useful":7,"cool":1},"wfS6gwAnK8XugN1MQO9YGg":{"text":"This place is a gem for a quick, cheap, delicious lunch. My Caesar Salad side was so delic","useful":1,"cool":0},"6KssCnJLyW3ZSliCWS1z8g":{"text":"Meh. We came here for the crawfish boil. One of the few, if only restaurant Uptown serving","useful":2,"cool":0},"B8Jh2RXt-vkDuV7SgjIZ5w":{"text":"New Orleans is such a good destination! However, if I can only pick ONE place to recommend","useful":1,"cool":1},"zxXcDw1yv5zjtG4nVL5gSw":{"text":"Good but I think just a little overhyped. Server wasn't overly friendly, although wasn't s","useful":3,"cool":2},"5MxvZ8Cyg5N5xLnRa6L4og":{"text":"Add Joey K's to your list of only-in-NOLA funky, neighborhood dining establishments.  \n\nIf","useful":3,"cool":0},"a5kIP8csLr3314E2eqrD5A":{"text":"One of our favorite restaurants in the area was jam packed wall to wall on this trip to ma","useful":0,"cool":0},"2wOXmyU23XFIH-o2ghQGLQ":{"text":"Underwhelming is an understatement. This place was quite bland and basic. The fried chicke","useful":0,"cool":0},"AkORiLFIHCv3NAhNiMrhxg":{"text":"We chose this place because it had been reviewed on tv. My husband had the gumbo and red b","useful":2,"cool":0},"LlK4s1F5JuHbaTEt_ecApw":{"text":"I made the shrimp with ham. Looked at the recipe and automatically changed the ham to  dic","useful":0,"cool":0},"5KpVYNVEvGx3Etj30xkAeQ":{"text":"One waitress can spoil the whole experience.  Thin brunette waitress is such a sour puss. ","useful":1,"cool":0},"LVKV3HTsW24oitCMufJ6-w":{"text":"I come to Joey K's every time I'm in New Orleans and OMG the food here is amazing!  I have","useful":1,"cool":0},"vwX-y8Cc6Jw-QG9B4gx9vA":{"text":"Just landed, asked folks working at the airport where they suggested we go for lunch! Out ","useful":0,"cool":0},"y6LBl5fK0FnVhDiU7p34Dw":{"text":"This was by far our favorite place we ate the week we were in town! \nGreat service, excell","useful":1,"cool":0},"FZyHrdaBPP1f2lV-AGh5kA":{"text":"Homey local favorite! Magazine street is full of great options, but Joey K's clearly has t","useful":0,"cool":0},"q1b83jqoboIJb04OlARwcA":{"text":"This has become my neighborhood place to grab dinner when I don't feel like cooking. The f","useful":4,"cool":2},"KWJ0qmPiQZdJa_E01l0mZA":{"text":"Holy cow! This place is excellent! The catfish was perfectly cooked! The red beans and ric","useful":0,"cool":0},"Qm-PT9FW2ZhfwW0uKMh5JQ":{"text":"This place was packed for lunch when I went.  I got a table right away but the service was","useful":0,"cool":0},"Z1zCMpIbrnCIUTu8Hm2DGg":{"text":"Kinda thought this was a pub type restaurant but it's more of a family restaurant.  Charmi","useful":1,"cool":1},"oGCts4GCrdOXApA7z3d3ow":{"text":"The food and customer service are wonderful. We visited New Orleans on vacation, and this ","useful":0,"cool":0},"WHyNhArejo3Y4sj7zPTeOw":{"text":"Still some of the best comfort food in the city, in a fun & safe environment.  The sign at","useful":5,"cool":5},"TnscEhhtz2bNhmyHqbIcwA":{"text":"AMAZING! cute little restaurant that is frequented by locals. I had the tuna steak salad, ","useful":0,"cool":0},"JOEF7h2CpIfWtGYZD0kvmA":{"text":"Mom and pop style sit down restaurant that definitely left me wanting to go back.  For an ","useful":1,"cool":0},"R4ltuf1xsGnLv1lADiWE2A":{"text":"Food portions are good but the food is very bland. Not season well for New Orleans standar","useful":0,"cool":0},"RXOiP6QLcKaVOAleaiUicg":{"text":"Good food, friendly atmosphere. Laid back and good for families. Service was fine. Gumbo w","useful":0,"cool":0},"PoVcYoZkHT5nQY31l0C1cA":{"text":"Great experience at Joey K's. Our server was Gabriela and she was super busy but stayed on","useful":0,"cool":0},"mNGsgtIYcNOOLeeSSYT5zg":{"text":"I placed a to go order (8/07/2021). I arrived and was the ONLY person at the bar. Three ot","useful":3,"cool":0},"fZpA4XNn7fteMBHVqk7l3w":{"text":"Hi everyone! Now is the time to support your local restaurants! Don't let this virus shut ","useful":4,"cool":1},"fKfHmmCOTGi-pYU89sdMPQ":{"text":"Nice job JOEY!     \nReal nice family dinner tonight. 5 plus a child.  Promptly seated. Dri","useful":1,"cool":1},"583CqC4udqRsor2f6IOXsg":{"text":"Went in on a busy Friday afternoon. There was a bit of a wait and the place was full. My g","useful":1,"cool":0},"xz732_khYjwgW9wTy41N-A":{"text":"Stopped in here for a long lunch during the work day. It seemed like the wait would be lon","useful":1,"cool":0}}