{"loXIIvLhMYDjRpkJvTmvVw":{"text":"First off this is Honduran/Central American restaurant, with SOME Mexican items. .  I Gave","useful":2,"cool":0},"dzSKj4VSXoswbVZgQ1OMbg":{"text":"My wife and I stopped here on a whim, we were actually on our way to catch the street car ","useful":1,"cool":0},"xNYM3dyvty5lBYaA9dFhcg":{"text":"El Rinconcito is not for those in a hurry. I suggest coming to this restaurant when you ha","useful":5,"cool":1},"asPwq0VRmrw9uPx4lKoESQ":{"text":"Came in on a rainy night and had Ms. Shirley as our waitress. Imagine your sweet grandmoth","useful":2,"cool":0},"EXFUtB7Y7eKhJTeCBZkBMA":{"text":"Very simple and tasty food--I got \"Dinner #3\" which was beef, beans, eggs, cheese, and pla","useful":1,"cool":0},"D_qSYUNRi402hxUGf6fM4A":{"text":"The menu is a bit confusing as it isn't the best organized and be aware that most of it is","useful":3,"cool":1},"l9fLHqd376xSs4FtnCfGBw":{"text":"Laid back Central American restaurant with more selections than most taquerias.  Popular w","useful":0,"cool":0},"uKTa0QU2dUCwV5mHau3k-A":{"text":"I don't understand why this place has such bad reviews.\n\nI went here with a group of about","useful":4,"cool":0},"VOWe6i953ZHgNkpOeF5xOg":{"text":"On the third try they actually had the item from the menu. Server looked very confused. I ","useful":3,"cool":1},"DhfSMSqDlLGAq4IanGJBzg":{"text":"First of all, they serve Honduran food. Not Mexican, not Tex-Mex, not Cali-Mex. Generous p","useful":1,"cool":0},"r-L4pAOgrz7W1yPeoEhRTg":{"text":"My experience here was pretty terrible. It took someone a while to take our drink order- b","useful":2,"cool":0},"-Ox6RmLqfOwqZbLHTGKOXA":{"text":"Why are so many mexican places nearby plagued by bad service?!  \n\nSorry, I have to vent.  ","useful":6,"cool":2},"vSOeGatiQDR340yQcOX-tg":{"text":"This place is basically a bar. Don't really remember any restaurant style seating. Food is","useful":0,"cool":0},"pcNILYORBGtp2aFHE7kN-Q":{"text":"The first impression is not very good, saying that you\"ll find a small local latin atmosph","useful":0,"cool":0},"6NMT-HoLzOiY8JmDVm5Fzg":{"text":"The enchiladas were not very good, but they were cheap.  The waitress didn't seem to know ","useful":1,"cool":0},"Adsn7u09UId3Rv24aBfMUg":{"text":"I do not agree with the bad reviews. The food was authentic Mexican, with handmade tortill","useful":3,"cool":1},"OsekhHovPTiKT5xeOXKOOQ":{"text":"Meat dishes good, salsa ok, gauc. Not good, beans awesome, \"peas\" and rice just like the c","useful":0,"cool":0},"o4SfI_LGtoUXr_HnVdpYIg":{"text":"Okay so I've ordered 3 times from this location the first time it was a dine-in and i coul","useful":0,"cool":0},"JzmVMz6nO7swDRlQ8j4FtA":{"text":"Best place for real AUTHENTIC style Central American/MEXICAN food! If you're looking for a","useful":0,"cool":0},"Bc6NucOBAqIuR4ZNIox2Fg":{"text":"I live this little place! Quiet, friendly atmosphere with a great menu. I have been for lu","useful":0,"cool":0},"0_hoZKbxlKgah22I4N5SJA":{"text":"Quick service. Good food! Bar available! Staff friendly and respectful...Good music but yo","useful":0,"cool":0},"xnLfw9UClPGnq9thB1z4og":{"text":"Oh my God!!! These tacos are amazing!!  I don't even know what else to say.  I stopped her","useful":0,"cool":1},"dZKoj_qdDcfaOPiABE-gHQ":{"text":"Love this place. Being from California, it's hard to find authentic Mexican food anywhere ","useful":1,"cool":1},"jaqpDwGfWQYtw3Hluhs8sQ":{"text":"Oh my God!!! These tacos are amazing!!  I don't even know what else to say.  I stopped her","useful":0,"cool":0},"dq1h_xI3MR8HnbR5jt6XZA":{"text":"My intention was actually to go to Taqueria Guerrero which I found out is only a couple of","useful":0,"cool":0},"D_K1fb8T_Anb3j_DskLwtA":{"text":"I walked into this place during Endymion. The menu options during the parade were 3 tacos,","useful":0,"cool":0},"zIzONG1-4WYEcmr4ftAl9w":{"text":"Thank you so much for taking care of us tonight! \nWe felt like we were an extension of you","useful":0,"cool":0},"kLqBk81LSUtSvFpodVJDYA":{"text":"Food is great I look more forward to the Dominican menu like la band era with pollo guisad","useful":0,"cool":0},"auk2CmBZO9Sp_OxKZ3ugkg":{"text":"I decided to try this place out after hearing great things. I went during lunch and ordere","useful":2,"cool":0},"WANOYliG5xqYxb0cUcXWCQ":{"text":"Tiny place, was empty when I got there for an early dinner - which worked to my advantage ","useful":1,"cool":0}}