{"TD_TPMe14mArIvR3halT-g":{"text":"Love this place....the only downside is how busy it can get...but thats a minor inconvenie","useful":0,"cool":0},"-0AnPw_rErNZ48_k25Vg1w":{"text":"Four stars for freshness, service, and price.  Oysters are shucked at the bar and by sitti","useful":0,"cool":0},"ERCq80cJI77QsRHDKgbgOQ":{"text":"OK so I went with my mother and stepdad and my mother ordered the barbecue oyster po-boy, ","useful":0,"cool":0},"SBGrdIuwNK87ETKAiHGsng":{"text":"Great food! Had the whole deep fried fish . The waiters were very attentive: Sam the first","useful":0,"cool":0},"HHvhasMGK5KEaZFuOo3E-w":{"text":"We stayed at the Hyatt for a weekend in New Orleans and before flying out, stopped here to","useful":1,"cool":1},"jWLYKv70DPXCanInEM5f-g":{"text":"Make the trip for great seafood that NOLA is known for. Started the meal with the BBQ oyst","useful":0,"cool":0},"VnJXdefZ3O4T5Tvc_vB9IQ":{"text":"If I could give less stars I would. Service was hands down the worst I have ever had. We s","useful":0,"cool":0},"41j_icev6tWszeJUxFw0yw":{"text":"Overall I would recommend this place.\n3 of us went to dinner. Bbq oysters are amazing as a","useful":0,"cool":0},"PPq-_pyEfcyWXQ0QS9bI5Q":{"text":"Great Happy Hour! Cheap and fresh raw oysters, only $0.50 each. Great service at the bar t","useful":0,"cool":0},"w2M4ifw1GFVvcMRs75XR7w":{"text":"When I found out that my best friend had selected a place called \"The Red Fish Grill\" to h","useful":1,"cool":0},"LnIAi-Ly-Aoskbbl8yBbCg":{"text":"The highlight of our meal was our waiter, Dana. He was HILARIOUS, oh my gosh. So many stor","useful":0,"cool":1},"MOoiENHQgZmETmNvfVDCAw":{"text":"Gonna go straight to the point, this place was super legit. It's my first time in Nola & t","useful":0,"cool":0},"yTv-_H7OPykm7I6u9qIS5A":{"text":"Great food and excellent service! Risotto was perfect! Had lots of seafood, sausage, and c","useful":0,"cool":0},"C1VRTy9TOMXamdcIkx9y0g":{"text":"This is probably my 3rd time here, but first time leaving a review.\n\nI tried several thing","useful":0,"cool":0},"DHUeLRMejhS4ZPu5lTWv6g":{"text":"We reserved a table for 6 through Open Table as part of our wedding anniversary family cel","useful":1,"cool":0},"I6v8l_rw71l5IOb8Ah5rhw":{"text":"This was by far the best meal I have had in a long time. The service was amazing and our w","useful":0,"cool":0},"8L2uCbURGDopGRkr1lZ_Vg":{"text":"We really enjoyed our experience here. Great glimpse of New Orleans cuisine and offers a n","useful":0,"cool":0},"BkJKQCbCPiANbe3osbsVbg":{"text":"We went here for a bachelorette party weekend on Bourbon a few weeks ago. I was looking fo","useful":0,"cool":0},"0H2DswnE68ZOwcw5R49YZg":{"text":"For a place right on bourbon I would expect more. The food was great but pricey for what y","useful":0,"cool":0},"FafuAA4NcS8vLLTQkkhxCg":{"text":"Went on a Thursday evening and was seated right away. Unfortunately we were put in a back ","useful":0,"cool":0},"-Xby3Prhz2qM0r2pnOZ7DA":{"text":"I was a little unsure of this place since it's located right on Bourbon Street but all of ","useful":0,"cool":0},"jvVBUqq0_pNsmPqD22Ru1w":{"text":"We were very disappointed with our dinner at this place.  Granted, it was very busy and we","useful":0,"cool":0},"LzSrKY3UR5gacoLn6hsD2Q":{"text":"Came here for lunch yesterday because it is across the street from my hotel. I ordered the","useful":3,"cool":2},"lQCue9p9R4Ngu0bd5gvvlg":{"text":"Our Tour Guide/Air Boat Captain suggested that we dine at The Red Fish Grill. We took his ","useful":0,"cool":0},"85auz88fJy-fcD-ziffW6A":{"text":"Great location right off Canal at Bourbon Street. Kevin was our waiter and he was very att","useful":0,"cool":0},"oQjKuR9yBdOU5TfabYAPlA":{"text":"My first meal on my second trip and we were lucky to arrive before the dinner rush and did","useful":0,"cool":0},"KRR97fxEJoRUbepIsQQdCQ":{"text":"The single worst meal I've had in the 30+ years I'm visiting New Orleans.  The hostess pla","useful":0,"cool":0},"zhonJuJw97xUQU2VWADUkA":{"text":"We had 36 hours in NOLA and ate at three places. Red Fish comes in third. Let's do a good/","useful":3,"cool":1},"e-10wZcmLmHW_FzMMfNA6w":{"text":"Great service!! Ike was our waiter. He was wonderful! So attentive kept our glasses full a","useful":0,"cool":0},"3fcgvulQ4GmAuMPJGCS4Og":{"text":"The food and atmosphere were good, certainly not great and not up to par for the price or ","useful":2,"cool":0},"rXCACwlm4RXAGIJc_z7-tg":{"text":"Great seafood in the heart of the French Quarters! The bread is soft, and fresh. The seafo","useful":0,"cool":0},"BUZc0rVRL3_7p3Bg8WOugA":{"text":"Great Happy Hour!!!!!! fresh oysters and service was GREAT!!!!! Thank you for making my st","useful":0,"cool":0},"gyzM8cuj5opC7pEq1F3lTw":{"text":"I've been here twice, and both times been quite satisfied.  Wonderful seafood - red fish i","useful":0,"cool":0},"aVR-Hx1onCtkihS2Yt5GyQ":{"text":"I was very excited to eat here however I was slightly disappointed. My friends and I arriv","useful":0,"cool":0},"lVoJFcH7V8AkVgRYmmaaeg":{"text":"Love love love the shrimp and grits from here. It was our first stop once we got to New Or","useful":0,"cool":0},"sYxl-8g3sKAd5ipxOJhkRg":{"text":"Oh yea! This is what I was expecting when visiting New Orleans. Great atmosphere, friendly","useful":0,"cool":0},"QqPOIpQB6VV4OrD6dKmdZw":{"text":"With a place this busy, the food is not even good. Don't waste your time and money to go h","useful":0,"cool":0},"a7stnf9fwXJMQUGIHAfkEw":{"text":"First time visiting NOLA.. \nRed Fish Grill was packed.. I made reservations which I highly","useful":0,"cool":0},"5P-up4YCejj2D5aLDtV-2g":{"text":"The serves was very good.  The host was friendly and greeted us very nice.  The manger wou","useful":0,"cool":0},"tIujArMEYjILesqmc1fDEg":{"text":"Their BBQ Oyster PoBoy really sets them apart as one of the best oyster houses in the city","useful":0,"cool":0},"1rt02AGl4gXcRepBmjAWgg":{"text":"On vacation for the first time and we had gotten a coupon for $24 off a bottle of wine. So","useful":0,"cool":0},"fL232oJC2RtWk_kuFLtFaQ":{"text":"The food was amazing, just amazing I love it. One of the best in all New Orleans in my opi","useful":0,"cool":0},"wAlJHUtsdnHLLIwAZysoDA":{"text":"I went here as part of a work dinner.  I wouldn't have chosen it, but it was right across ","useful":0,"cool":0},"-MJLCevkgp9dSoNoGZMBuQ":{"text":"I'm absolutely in love with Red Fish Grill. It was so good, that I ate here twice over a t","useful":0,"cool":0},"Amn0NmzftpeS6sczMbuVWw":{"text":"Good food, decent value. Fish flown in fresh each day. \n\nRandom bonus: wasn't charged for ","useful":0,"cool":0},"1XRvVqvr3QWP9RMlSteR-g":{"text":"We have been in New Orleans for a week, and this is by far the best meal we have had. Our ","useful":0,"cool":0},"wjJ6B725knPUS35m9Dpyuw":{"text":"My wife and I traveled to New Orleans celebrating our anniversary and a friend suggested w","useful":0,"cool":0},"tsJO9ie1bFv2zoJgIrO0JQ":{"text":"My bf and I had just drove in and this was the first restaurant we tried late on a Friday ","useful":0,"cool":0},"iXQF3rWwmvndmWwMVvnkmQ":{"text":"The grilled mahi mahi with side vegetable was delicious.  Ala carte sauteed spinach was de","useful":0,"cool":0},"LTt24MzL1031gL_pL4kREw":{"text":"Another Brennan's Restaurant...but with a trendier twist.\n\nThe BBQ Oysters, which are more","useful":1,"cool":2},"aFIPfF7Nry6eGZ1PI_whbw":{"text":"Sooooo Good! Amazing oysters on the half shell, melt in your mouth gumbo, crab cake to die","useful":0,"cool":0},"q5yyzBILO3SwcVr_7emAZA":{"text":"Visited in between lunch and dinner hours so menu was limited. Seems like a tourist spot, ","useful":0,"cool":0},"ZMiwkQALyRfGBJmi-dpSKQ":{"text":"So let's just the most amazing bread pudding ever! Also, I did a couple of apps and gumbo ","useful":0,"cool":0},"ztGOCQHREqq2fCn6iyvPNg":{"text":"The food was good, but the seats were uncomfortable. Listen, I get it...the more uncomfort","useful":0,"cool":0},"axjxhKYKRYhyUc9rq353LA":{"text":"It was a hot, sultry June night on Bourbon Street and we were tired and hungry and looking","useful":0,"cool":0},"gMS6Frqd6vgZlVnXN0QJUg":{"text":"Was only there for their oyster Happy Hour -my family definitely enjoyed it. We were visit","useful":0,"cool":0},"QRXjzDLsgus5i2z5hJoxcg":{"text":"Great service is pretty much the only thing outstanding. My husband and I have been here a","useful":0,"cool":0},"tjpaFJni2fWqd82JJRn8xw":{"text":"I came here for lunch and split the BBQ oysters with friends.  They tasted just like Buffa","useful":0,"cool":0},"f5IEmTPa9yi_rLU7sdvC2A":{"text":"I really wish I lived closer to New Orleans so I could make a trip to Red Fish Grill more ","useful":0,"cool":0},"nGtky_88yysvDc67SrqgIQ":{"text":"The place to go. Just be hungry. Not because the portion sizes  are huge. They are average","useful":0,"cool":0},"dX41RfsldZjQJ2-b8fAAtQ":{"text":"My first stop entering the French Quarter. I got lucky. I did not have lunch or dinner her","useful":1,"cool":1},"EM-DWA8qZb4OCDDsfPU31g":{"text":"This was our 2nd time dining here- and what a let down from the\n 1st time.\nNot just food b","useful":0,"cool":0},"aAqO4dqvqsMPgpyvj7MBrw":{"text":"Love the Redfish with or without crabmeat. The crab cakes are 98% crabmeat with little fil","useful":0,"cool":0},"0J5pi--SXgsEhQupFSjSOg":{"text":"Our first day in NOLA we wandered into the FQ & wanted to go straight to Acme Oyster House","useful":0,"cool":0},"SGp_IZeNGZPjavFcWK0ZnQ":{"text":"Yum! Yum! YUM! We had oysters, jambalaya risotto, and catfish.  Everything was delicious! ","useful":0,"cool":0},"dgH944jor-39YOQF1RD5kg":{"text":"I had their specialty - grilled fish - snapper topped with crab - delicious!! The service ","useful":0,"cool":0},"RMxGIDx94d01U3-w0tDrmQ":{"text":"We're from Oklahoma passing through for our honeymoon and loved this place. We had the gum","useful":0,"cool":0},"5J4qeNCo86nFHKLcdC1YSA":{"text":"Most amazing meal. It was loud and busy but both the service and food were great, Kevin wa","useful":0,"cool":0},"X_j6PXm5OOgtrwhhfsOD9Q":{"text":"Loved this place. I ate the best jambalaya ever here. Actually I would go far as to say it","useful":0,"cool":0},"t0-UYPxjWhbO7y77tnTEnA":{"text":"Red Fish Grill was a pleasant surprise - given the Bourbon Street location and the size of","useful":0,"cool":0},"0lDsXw8DVwoQRa2UdIJxsQ":{"text":"Superb service from Waiter Ike, made the entire meal fun and engaging. The food was just a","useful":0,"cool":0},"q1A6-3-nFFDg5rj03kxtYA":{"text":"I came here on the recommendation of my father, who had recently been to New Orleans and d","useful":0,"cool":0},"TvhzmYf1rnIF7jPcF2V7jw":{"text":"Ladies and Gentlemen, this place cannot be beat.  Fresh bread and the best oysters ever, w","useful":0,"cool":0},"RD1bMyZiQaFigK8EuP9qng":{"text":"i had the Fish Burger.\nit was actually wayyyyyy better than expected.\ni would definitely r","useful":0,"cool":0},"gqy1mvP5bFUT1-N5-kXagg":{"text":"Came to this restaurant because it was recommended to us by our Uber driver and we were ab","useful":0,"cool":0},"PCUa2Qp8LdkU7ojZVWkJNg":{"text":"We heard great reviews about Red Fish Grill so we decided to take our friend here for her ","useful":2,"cool":0},"CErisXyP5GY6Zcqa8Tzl3w":{"text":"Every time we come here, it is great. This past experience, we came for lunch. Our server ","useful":0,"cool":0},"cyCNIKWKwuiG8t1DBnc5rA":{"text":"Great spot for happy hour oysters on Bourbon St.   Only 1/2 block north of Canal St.  and ","useful":0,"cool":0},"FTLjIUEVvhHYVSIB3RC_Nw":{"text":"They are noted for their oyster appetizer .. fried oysters in bbq and topped with blue che","useful":0,"cool":0},"UFmczXrcU-bnT_99p2etfA":{"text":"The food was so delicious! I don't eat seafood or fish but the Alligator Boudin Balls were","useful":0,"cool":0},"OepHQdt26In5zrSoSFMs4Q":{"text":"I sat at the bar and the bartender was very helpful and attentive when providing recommend","useful":36,"cool":36},"pRjTagtqpSNqY9AzlXooxg":{"text":"I eat here about once every other month, mostly taking friends visiting the area. Most kno","useful":0,"cool":0},"iPZWWtsqQeuV1XV4KPPPjQ":{"text":"Went for lunch, i was surprised at how not full it was at noon on a sunday (maybe everyone","useful":0,"cool":0},"Fme2So6eBIimYOec1WYuYA":{"text":"Simply delicious! We started with the signature BBQ oysters and the sampler. Then continue","useful":0,"cool":0},"Jd0Plp9dzUzJafmIAh1DVg":{"text":"I was fucking wasted from but what I can remember the food was hot shit. The alligator bal","useful":0,"cool":0},"YXdXmNNf-aJsNeLQD9Sfhg":{"text":"We only were at the bar.  We were there for happy hour.  The raw oysters were really good ","useful":0,"cool":0},"appDP_2CWDht3iOvfWDMJQ":{"text":"My mom and I were in town for her birthday, and popped in here for dinner before going to ","useful":0,"cool":0},"ZCmAWpY16di5Sep2dKzPxw":{"text":"Great food, atmosphere and the service is unbelievable! We had the red fish and the Shrimp","useful":0,"cool":0},"56KfshUAqz1i3tkfsYvAtw":{"text":"Awesome but my meal alone was $52 w/o tip.....fantastic but left hungry. Cant say I've lef","useful":0,"cool":0},"mXherJ6hgcyAFIN3PYBdzA":{"text":"Excellent food and the service from Ike was impeccable. Great decor. Great raw oysters (ge","useful":1,"cool":1},"sJsRYle1XzN-e56Nf-QpgQ":{"text":"I have had dinner here several times as a couple and as part of a larger business group. T","useful":0,"cool":0},"JkHV_lz2y60rHPLVD210vg":{"text":"*THIS REVIEW IS FROM OUR LAST VISIT TO NEW ORLEANS IN 2011*\n\nMy better half is a noted des","useful":2,"cool":2},"XrfzYUYRCSYq9rO7LmuhPw":{"text":"The grilled redfish with crawfish tails was possibly the best seafood entrée I have ever e","useful":0,"cool":0},"trItnDonMHcSpNFBKkUzhw":{"text":"Excellent fish entrees, but portions are not that big for the price. The wait staff were v","useful":0,"cool":0},"nRl0O76vidF9uhkG7NAVyQ":{"text":"I had the fish tacos which were okay. The bourbon milk punch was okay too. This place over","useful":0,"cool":0},"uRhFGPCUauJMz7ZYg10r0Q":{"text":"Great for a large group.  Seated exactly when our reservation time was set.  Large bar for","useful":0,"cool":0},"lOFWTvqIYV_hr2UzGjyPJg":{"text":"While in town for work, a group of 8 of us came in for a meal. We were lucky to have gotte","useful":0,"cool":0},"vEZm0dPu6GmTNdnnkwU95g":{"text":"Wow! First of all the food - the Red Fish with crab blew my mind. We also ordered the alli","useful":0,"cool":0},"gwMfmjugh8Xq9G4yxnKngA":{"text":"This was an amazing experience with amazing service.  Me and my fiancé had the pleasure of","useful":0,"cool":0},"_CgY17pZuQGhILDCuRmWSQ":{"text":"Underwhelmed. I've been to NO a number of times over the years and rarely had a misfire. M","useful":0,"cool":0},"VnD5m4cJ6Mi_hM2-pggQfA":{"text":"As good as the reviews told us it would be. My only disappointment is that the crabmeat wa","useful":0,"cool":0},"vltNnHyXELo7bQSnEK8N_Q":{"text":"We weren't sure where to fine in the French Quarter since there are so many options. We ch","useful":1,"cool":1},"JWEQ2K1YkBesQmFAR2YC8A":{"text":"Dining area is cramped. Atmosphere was dank, outdated and not up to par for a restaurant w","useful":0,"cool":0},"aNJcT3dB47bfJXpU9n5ZxQ":{"text":"Wonderful wonderful! This place has been so great every time I have come here. We make sur","useful":0,"cool":0},"WC1_N2Xc30trVwjMdW9XfQ":{"text":"Waiters were nice. Just the food was mediocre and the drinks we're meh. Happy about the ha","useful":0,"cool":0},"AKTAXZ6tmDwSLBFtxilVZQ":{"text":"This place was fine. Food was fine. Decor was fine. Perhaps you're sensing a theme? Maybe ","useful":3,"cool":3},"mRBcsCdBbCfv1DEq9Afzqg":{"text":"Stopped by here for lunch on a Wednesday afternoon and sat at the bar... The bartender was","useful":0,"cool":0},"hFFJIoJ1RzIklgS-IGYC6w":{"text":"We were meeting up with friends for dinner and they chose the Red Fish Grill. I looked at ","useful":1,"cool":1},"rTEJBnq58auXfxIj9y5EfQ":{"text":"I am a fan of this place and have been here a few times. Note - they recently changed thei","useful":0,"cool":0},"Pus7by9UbIDp4bi1OI5gHw":{"text":"The signature redfish special was well done.  The grilled fish was soft, flakey, and nicel","useful":0,"cool":0},"Q4W6NlNrhn6Ke-2wElpTxg":{"text":"Excellent meal and experience!  Alligator balls were delicious and the holy trinity jambal","useful":0,"cool":0},"x9Eg3qmSnxROzD-OlCkFCA":{"text":"Red Fish Grill is located next door to the Crowne Plaza in the French Quarter. It was reco","useful":0,"cool":0},"NsFEaSLNs0-11nfOat9Bfw":{"text":"Decent but hardly worthy of the $27 entree \nThe entree was cold and they brought it while ","useful":0,"cool":0},"y68V45cgQAVFWMrXZrOpxw":{"text":"Had a great experience. Servers Andrew and Adam were a great team. The bbq oysters were te","useful":0,"cool":0},"tVlkqmAzwpNCnfz3Mo4j8w":{"text":"Stopped In for lunch and it was a nice experience.   I had the oyster Po boy and it was fa","useful":0,"cool":0},"rN2lp2LCAHn3znbMTv9ZBA":{"text":"I ate here last year and it was awesome - I had really high hopes for it again this time. ","useful":0,"cool":0},"tpVJ-0UGC5JVWrKV2f7AXQ":{"text":"The red fish was awesome!  Hence the name of the place, it's a must-try!  The crab claw ap","useful":0,"cool":0},"1fnIbU92LsGNvW0rsaMRXA":{"text":"Our server was extremely knowledgeable about the menu and took the time to give us a bunch","useful":1,"cool":0},"5_nuR_X-lJfHYpT5KP232w":{"text":"I don't understand why people rave about this place.  The food leaves much to be desired. ","useful":0,"cool":0},"04hy_acH08_7d2tqxM0IJA":{"text":"This is a very solid restaurant for fresh seafood.  While the menu does have a New Orleans","useful":0,"cool":0},"W2R0DkNxGTWZE8p70uMBZw":{"text":"a good spot-- great food.  but its a bit noisy and there is so much good food in new orlea","useful":0,"cool":0},"klsmjX8K_3Vm7OAENYvqlg":{"text":"The French bread was very tasty.  The redfish special was just ok but everything else that","useful":0,"cool":0},"PpLX-Cv1U00_t4uKiyyP9Q":{"text":"Solid restaurant, mid range with a private dining room. Got oysters and gumbo for lunch, a","useful":0,"cool":0},"Yg1ActpGYJwK9P9b4Zzj2A":{"text":"This was easily the best meal during my stay in NOLA. We originally planned to go to happy","useful":0,"cool":0},"1CPeaTd2FhS1OHAfDc-n-Q":{"text":"In NOLA for a girls trip and it was recommended we try Red Fish. The reviews are right, th","useful":0,"cool":0},"GCjgjVH69Hl-hst_0gOMuA":{"text":"I wanted this place to be better. It came recommended but the food was pretty average and ","useful":0,"cool":0},"NhOtM-Y91JbofqBM_PmxHw":{"text":"Food was great , I had got the red fish , My Family got cat fish it was great service was ","useful":0,"cool":0},"Ksu0tDhLFfWtyTud8ZVTzw":{"text":"The food there was alright, but I definately think there are much better places to eat in ","useful":0,"cool":0},"Iz2N0TfHf_HVyPzlgKOY9g":{"text":"Went here for a group dinner, and it was fantastic. It was quite busy, but not so crowded ","useful":0,"cool":0},"aHVBHXrv1S5ZccY80Foifw":{"text":"Our server was Tim M. and he was terrific.  Really enjoyed the service here.  The BBQ oyst","useful":0,"cool":0},"7ZrnkMuOse9puNVZl8ZEPA":{"text":"My food here was waaaay too salty (and I like salty food), but the main reason why I am go","useful":0,"cool":0},"PpC6OKqMMBZkq70502TTFQ":{"text":"Don't ever WAIT if they tell you 45-60 minutes, \nit takes an hour and half.\nAlso, the plac","useful":0,"cool":0},"kZa1fH-gvuuotu3EicE81A":{"text":"We were in New Orleans for my sisters bachelorette weekend and after numerous recommendati","useful":0,"cool":0},"MPtYHjyaOoLX6pRkoTbB3A":{"text":"Ike was awesome!! Great hospitality & extremely friendly! The BBQ oysters were delicious!","useful":0,"cool":0},"YyuT6zlRcQo7MTfGTUUYFg":{"text":"The place is amazing make sure you make reservations.  The food is great. We had the fried","useful":0,"cool":0},"FRavyi-rbhEMxH9hdHPDmA":{"text":"OK...Saturday night...everywhere is packed. We otp'ed to head to Bourbon St and see what w","useful":0,"cool":0},"viBnhTQmNdQ_99CSF_oVlA":{"text":"We love this restaurant! Ate here three days in a row. We made reservations using the Open","useful":0,"cool":0},"awJZakg4MaTmkFf6RlCNxw":{"text":"We loved Red Fish Grill. We had dinner here and it was so good that we came back for lunch","useful":0,"cool":0},"6hO9t9niGh-gYzDSCfvItw":{"text":"Portions are really, really small for a little person's standard.   Too hoity-toity.  Not ","useful":0,"cool":0},"i7caInckDQ77p_JtsJmipQ":{"text":"The food here was absolutely incredible! I am from Long Island and have exposure to a wide","useful":0,"cool":0},"kweHgO29RSsNTfUVhFG68Q":{"text":"This place was in our hotel so it's customary to at least give it a shot. Besides the BBQ ","useful":1,"cool":0},"YA8mPMwekzyjI0SF0wj1PA":{"text":"Beyond the slightly disappointing Bloody Mary, I could find nothing to complain about  at ","useful":1,"cool":1},"3xad0pQZN9rCUQkNcah2ZQ":{"text":"First night in New Orleans and my group got in after 9pm and was hungry. We tried going to","useful":0,"cool":0},"dC_WFn4DsSeTFWablg5X1A":{"text":"The best restaurant I went to in NOLA! You get a french bread at the beginning of your mea","useful":0,"cool":1},"7plcAlRzabUnnzY2v0QIVA":{"text":"The culinary tour of the \"Big Easy\" continues. I had to eat here, besides getting lots of ","useful":1,"cool":1},"b1wLhFGcVo_Yjrb-JtAjMA":{"text":"Service: attentive, helpful, and friendly!\n\nQuality: the bread was microwaved right before","useful":1,"cool":0},"vzAjVICK9eXyqPhnNKd_6A":{"text":"Great restaurant. The wait staff was prompt and polite. They were really helpful in feelin","useful":0,"cool":0},"wVgcdkIBXcP7FyNIasaThw":{"text":"Absolutely the worst experience I have had in a restaurant in years. While the waitress wa","useful":0,"cool":0},"RmpJC4Y702TfSlhbEH0sGg":{"text":"We grabbed a table through open table on a rowdy Friday night in the Quarter. Food was all","useful":0,"cool":0},"2yRZ-9FuFc144PUbVyqxZg":{"text":"Had a fabulous dinner at Red Fish Grill! This restaurant/bar is conveniently located right","useful":2,"cool":1},"0r_kQcizULD6BSk37U4AyQ":{"text":"Another awesome Restaraunt in the heart of New Orleans. Had to wait for a table but the Re","useful":0,"cool":0},"9MxQDCXKwQkvPka2rimzHg":{"text":"2nd time visit in 3 years. Took some friends and we all enjoyed the spicy but tasty seafoo","useful":0,"cool":0},"uwpU3vO0EbYvt9BlhrZdQQ":{"text":"We were in New Orleans last week and stayed at the Hyatt which is connected to this restau","useful":0,"cool":0},"btn9o9mX3j6HGfz5XJ6JBQ":{"text":"My meal was amazing. I went for late lunch.  I had 2 signature dishes bbq oysters-  very g","useful":0,"cool":0},"7cyZ0DL637we24VqngDQvw":{"text":"Holy crap. Spicy alligator boudin = best boudin I've ever had!!! \n\nThe Cobb salad was beau","useful":0,"cool":0},"jwe7SC_02rxrnj9GTE02lw":{"text":"Decided to come here for oyster happy hour, and as they are generally so great in New Orle","useful":0,"cool":0},"ZwMru8_10oHvoXAYDuzPlg":{"text":"We ended up at the Red Fish Grill when our other dinner plans fell through and everywhere ","useful":1,"cool":0},"F5AQkwCe4nAQXHyBn_zkmQ":{"text":"Loved this place! We had great service and really enjoyed our food. The barbecue oysters a","useful":0,"cool":0},"7AA-aQV3ajQk_T8TX7nqEg":{"text":"I made a reservation here for my girlfriends birthday, which happened to be the Monday bef","useful":1,"cool":0},"FdjGG4EULQDPmOdMNlw6kw":{"text":"Nothing the least bit exciting or special about it. I could see the atmosphere feeling fun","useful":0,"cool":0},"Zliel78Lcbir_6nMu53uyA":{"text":"One of my favorite restaurants in NO.  Had a bit of time before my plane left so I sat at ","useful":0,"cool":0},"JwfaRYD3l23H9jOJSgyE7Q":{"text":"The red fish here is amazing!!!!!  We had the dessert that you have to order at the beginn","useful":0,"cool":0},"pdF0xZFKX-JX5e_6YboVCQ":{"text":"Every time we go to NOLA we got to Redfish Grill but we were disappointed this time. The w","useful":0,"cool":0},"ZGn9u3p9A6Duvn_iSKXWog":{"text":"Always a great meal!  We're back in NOLA for the NFL game and decided to stop in again.  T","useful":0,"cool":0},"-ntgtPxFauBmr7ueQ3hZHQ":{"text":"It was pretty decent food nothing spectacular or unique. The prices were a little steep fo","useful":0,"cool":0},"sOE5zZYy2UYe_eG4RvQrxA":{"text":"Redfish Grill, supposedly one of the highest rated seafood restaurants in New Orleans, rea","useful":2,"cool":0},"Dc32DOekk9sz1aLfwi5E-w":{"text":"This was our first time here at Ralph Brennan's Red Fish Grill\n It was totally amazing! Th","useful":0,"cool":0},"_11kMJuMkfdRFGa1nlrnPg":{"text":"This is my favorite NOLA restaurant.  The BBQ Oyster are incredible.  The atmoshere is ver","useful":0,"cool":0},"BqRHYweLqdv_-1QRD3SjGw":{"text":"The food is excellent! I had the wood grilled red fish!! Very good! Our server was the bes","useful":0,"cool":0},"e8wkc1CIuJeqKIdB9ujSug":{"text":"I'm an oyster fanatic and these oysters were off the charts fantastic! BBQ oysters and raw","useful":0,"cool":0},"qLL6enLOE6KYehwgF86Chg":{"text":"Very good food, but the server was new and struggled with our drinks and order. I ordered ","useful":0,"cool":0},"lUCEcLd3pSGO94gyhrMRwA":{"text":"We ate here by default as too many other places had long lines on a Friday night.  Thank g","useful":0,"cool":0},"1_T9fiUXwiQaG1aw319guQ":{"text":"Plain and simple Monday through Thursday between 3 p.m. and 6 p.m. the oysters are $0.50 a","useful":0,"cool":0},"z_SVvgmVRE2C1sA-_MGVVg":{"text":"Excellent creole catfish, wood grilled redfish! Chris was an exceptional server!!!! Great ","useful":0,"cool":0},"l57uCf4UvZmnk5suBAKSIA":{"text":"The food was fantastic! I had the famous redfish and lump crab dish. The service was prett","useful":0,"cool":0},"pAL8ZzMyEMXLLZLLt7q0sg":{"text":"One word...OUTSTANDING!!!  Food is fantastic, and the service even better!  Ask for Ike!","useful":0,"cool":0},"ge-JyQzBq1iXfenZ7J_5Cw":{"text":"Make sure to grab a reservation if you want to go to this restaurant. We managed to grab a","useful":0,"cool":0},"i17LXZjt-Jq12GrgoLCLsg":{"text":"Popped in for happy hour in the bar area.  $0.50 raw oysters and 2-for-1 well drinks?  Don","useful":0,"cool":0},"BbyJjhXd_VRp_buKGtvF9A":{"text":"This was one of my favorite places. First of all the staff is friendly and they know their","useful":0,"cool":0},"a3I8MLuWZ-zLyFzhB5tyhg":{"text":"Fantastic restaurant with real authentic Cajun style food!! Highly recommend their girl fi","useful":0,"cool":0},"IBdSByPnCeG3pSKEAsk7Iw":{"text":"We stopped in, almost by accident, at 2:00 on a Sat. afternoon. The place was pretty empty","useful":0,"cool":0},"h7lYFfj8tvODrsn3wm1aIg":{"text":"Make a reservation. It was Wednesday and we waited 1 hr. 20. minutes for a table without o","useful":0,"cool":0},"wP13lLP5BmLEA3-gAv5yjw":{"text":"Fantastic experience for our family of four.   Great loaf or French bread with whipped but","useful":0,"cool":0},"zfbqZnFHgBd8-tw-N9nEEg":{"text":"The Buffalo oysters and Dualing Red meats were amazing.  Our main courses were very good a","useful":0,"cool":0},"_nNL2RdOJiuHTul4gyJCNw":{"text":"Gumbo was great. Ordered jambalaya Didn't care for it. Made with risotto and I didn't like","useful":0,"cool":0},"2JIcV5mHxWj4nbhox1bnvA":{"text":"This place was great!! We came for my daughters 18th birthday and from the moment we walke","useful":2,"cool":0},"rprEIrK8U0fZB058VejGUw":{"text":"Great service and excellent food.  It's a nice quiet spot away from the noise of Burboun S","useful":0,"cool":0},"Y1eg0gO4TFHa0jrLtPqQWg":{"text":"We had our first NOLA meal in Red Fish Grill and it was the best introduction for us. My w","useful":0,"cool":0},"49aCjLc2tmkAMpsiuzGe4Q":{"text":"Visiting NOLA for a couple of days. (First timer) met up with family for a nice dinner. Th","useful":0,"cool":0},"vrFJzFUHGNB4JGEcZHqiRQ":{"text":"Was highly recommended by some friends. Our group of 4 tried and loved it. Started out w/ ","useful":0,"cool":0},"Jg-ttJhlCZT-Vpr46pF5QA":{"text":"We visited New Orleans in May and when telling others about our trip, at least two people ","useful":0,"cool":0},"r_Tm1a1IUNyRzFy8msk8eQ":{"text":"Staff not helpful with choosing gluten/dairy free entrees. Ended up just getting steak and","useful":0,"cool":0},"9wIosJ9aVr6TJxU69xSs0Q":{"text":"Stopped by here one day before work with my wife and we split a light lunch. Ordered the B","useful":1,"cool":0},"rYfL1OSyJKDXoynebxLLDg":{"text":"We came for appetizers and it was simply amazing. The food was mouth watering good. Probab","useful":0,"cool":0},"8cMij3gAbIaYCV4ocMItOg":{"text":"We found this place on another website, and booked it because the menu looked interesting.","useful":0,"cool":0},"ktLEiUUfNV1dtlCjg4l-5Q":{"text":"Super choice while on Bourbon.  Large portions great service in the heart of NOLA. Barbecu","useful":0,"cool":0},"874Wa1PHi9VNwWcdKynqvQ":{"text":"Ordered the chef's special (red fish) and it was delightful! As was everything else. Ended","useful":0,"cool":0},"AOL0ZGQNucmVa2Uw1A8uOQ":{"text":"We had dinner at redfish with a number of people.   The place is pretty good but the wait ","useful":0,"cool":0},"med05krTGnPSgsyUs7ACmw":{"text":"Just so so. Crabcakes were ok. My friend's red fish just ok. Service was fine drinks were ","useful":0,"cool":0},"LGQHlPinoez3_s2OgXfN5A":{"text":"I've been here many times and the food is always good, but when I had some family in town ","useful":0,"cool":0},"119z9N4aD8qSrLNKhfZYWg":{"text":"Awesome place to get some great seafood. Wife and I had the grilled redfish over lump crab","useful":0,"cool":0},"NW80dKl_EfyoA4zLAx9zNw":{"text":"Ask for Ike Jackson. Best host at this restaurant. There's plenty of tables and the food i","useful":0,"cool":0},"mg1NCyIW1nWDlz_9qsC9jQ":{"text":"We heard about Red Fish Grill through a speaker at our Road Scholar tour.  Reservations ar","useful":0,"cool":0},"B_MsKRYSUhFPeUaR0eJW4w":{"text":"Went here on the advice of a friend to try their bbq oysters and they were fantastic. A li","useful":1,"cool":0},"5BDCKVcT7BxhqzVrTBT8RQ":{"text":"I seriously loved everything about this place! I'm from the north so I don't typically eat","useful":0,"cool":0},"ioBHW8fNOjgJlxHr3mpGKA":{"text":"If you decide to grab a bite any where on bourbon street make your way to red fish grill t","useful":0,"cool":0},"EZF_cZFK6531o-v7B4AQTQ":{"text":"Really good, was in town for business and it looked packed from outside. We got a table an","useful":0,"cool":0},"N14TaCRuTrcOc8P6agVUAQ":{"text":"I was blessed to get in the Redfish Grill on Easter Sunday. While we had not planned to ea","useful":0,"cool":0},"B0XxahaTd5lYArcdvOpo2A":{"text":"Great food, great service. We tried the jambalaya and grilled redfish. Both dishes were ex","useful":0,"cool":0},"5UtFIMZ1Jy4N_UFDZRhZXA":{"text":"Food here is good but it won't blow your mind.  I like that you can get good fish without ","useful":0,"cool":0},"QHD6dUUupRGY8zWmv8wFvw":{"text":"Omg I don't remember what entree I had. I know it was a pasta. But what I do know is is th","useful":0,"cool":0},"Sbs0lg3HhmokHRpr8mUlog":{"text":"We went for thanksgiving dinner. We had to book in advance.  It was so worth the money.  C","useful":0,"cool":0},"A20o8vlnKdgO4KIG1QQX-A":{"text":"One of best meals in New Orleans. Waiter was outstanding truly catered to our anticipated ","useful":0,"cool":1},"EfybljA36wMEP8vCr3e9sQ":{"text":"The Wife and I popped in here, to escape the madness on Bourbon. On a Sunday afternoon, th","useful":0,"cool":0},"U7_UraRssbIzlQq-4mTg7A":{"text":"My husband and I went here for the Thanksgiving day buffet, everything was great! Food and","useful":1,"cool":0},"HHrE8EXg5pUCUP7_zMKXgg":{"text":"The blackened red fish was excellent. However, our waiter wasn't even sure we could order ","useful":0,"cool":0},"C3skqDP8-Im85OtF_XC2fQ":{"text":"Yes! Yes! Yes! Go here for happy hour- 2 for 1 drinks of all kinds and 50 cent oysters!!! ","useful":0,"cool":0},"d1v59l0qHAxmmHCGI8ZQxw":{"text":"I was disappointed with this restaurant. The server was a little bit of a snob. The wait i","useful":0,"cool":0},"g0AZK2XK5cQtL6oExDUVWA":{"text":"Mother's Day buffet is really awesome ! Redfish, asparagus, green bean salad, raw oysters,","useful":0,"cool":0},"V6XdMJBrBoHWEnY2WWBXJA":{"text":"Alligator boudin, catfish and ettouffee, and redfish all very good.  Service was above ave","useful":0,"cool":0},"Xfe-L66PV3kVZgrwXB9oHA":{"text":"Last evening's birthday dinner was so great! Wait staff was attentive, we had a party of 8","useful":0,"cool":0},"cQjB2e1g6Aa0_8qOSjnyQQ":{"text":"There are so many better restaurants in the French Quarter than the Red Fish Grill, we had","useful":0,"cool":0},"Qco4ttyTPbF1faTMRKxoQQ":{"text":"Great place with a lot of energy. Definitely recommend the grouper with lemon rosemary Wor","useful":0,"cool":0},"EvaVwfmbaUEtUNMs2vU-EQ":{"text":"We went on a busy weekend evening, and man this place gets packed! Big, airy space, hundre","useful":0,"cool":0},"rFbkLyt3qqox8d7_mOisZQ":{"text":"We popped in for a dinner here and were impressed.  They couldn't get all 6 of us a table ","useful":0,"cool":0},"Cdn9nEcit6JE0PUpUCao6A":{"text":"I made a reservation as it was St. Patrick's Day and we were quickly taken to our table.  ","useful":0,"cool":0},"Z4pGaQhyK0SmkAArPJ8VlA":{"text":"The BBQ Oysters were delish and the chocolate bread pudding was to die for!!! Our waiter T","useful":0,"cool":0},"P8QPurDf08Ujqmj7e0eAgA":{"text":"The Buffalo Oysters and Alligator Balls are a must have as appetizers! Even though fried o","useful":0,"cool":0},"deUL9OWO7hBCuW180WjP1A":{"text":"Divine seafood!  We had the red fish- just had to!  It's the house specialty.","useful":0,"cool":0},"yz7_CF6cNvbjsry79hLCOA":{"text":"If you had time for only one dinner in town (French Quarter), I'd recommend this place hig","useful":0,"cool":0},"EPu1AjQWWPrrH5SDDQ9Lag":{"text":"Great atmosphere and the food and service is amazing.  This is definitely a place to go fo","useful":0,"cool":0},"mh-xUpbaVHVYxK-kOBLBIA":{"text":"Ate here on 7/19/2013\nI found this place to be over rated. I've had better Gumbo... Try De","useful":0,"cool":0},"NH4aEEOKtWmaGedNw6zkiQ":{"text":"Friendly staff and decent food for the money. Very close to the tourist zone but at least ","useful":0,"cool":0},"e46teGvHirxi-AHe-W3LBQ":{"text":"My first raw oysters i New Orleans nice clean resturant great staff. The oyster where good","useful":0,"cool":0},"isQ9XE0cW4n67eHKKhFudg":{"text":"At first I thought the place wasn't going to be too special because of the location and th","useful":1,"cool":0},"264IBRI-lvH-NWFheqa2uw":{"text":"Delicious food! Lovely dining experience- Ann really took care of us all night! Fried oyst","useful":0,"cool":0},"iAVlujjk40EjZLtfeJl2EA":{"text":"This was nice.  The atmosphere is great and the service was great.  The redfish dish with ","useful":0,"cool":0},"Z5JoQoR0h6SHBGic2RBUXw":{"text":"Service is super fast n friendly but the gumbo wasn't that good at all. It was just blah. ","useful":0,"cool":0},"kaOcnnypkJ9uNjNimlf7OA":{"text":"Came here for industry sponsored dinner and wasn't sure what to expect based on reviews. B","useful":0,"cool":0},"aBnyj7fka9TWqmqgtFaSrw":{"text":"The food was pretty good. But my friend & I both ordered crab cakes & lump crab & almost e","useful":0,"cool":0},"C-XRh_7tBFmY1itcD5TzyA":{"text":"Really 2 1/2 stars. On the touristy side but solid service. Basically NY, Chicago,LA price","useful":0,"cool":0},"OLzUgK7J31f2qW3XEIEvWQ":{"text":"was a pretty decent dining experience. the dining area was crowded so thankfully we agreed","useful":0,"cool":0},"KO797772rPyZKMLRMv5MlQ":{"text":"Started with oysters which were delicious then had a seafood sampler and the crab cakes an","useful":1,"cool":0},"n3QEAN34-oONHeS34ubFjg":{"text":"We went to the Red Fish on a Saturday night.  The place was packed.  We had to for 20 mins","useful":0,"cool":0},"ya-gu3VVHa4_4zlrIuU0bA":{"text":"Our server was a little cranky, but the food was great.  I had shrimp and grits.  Not too ","useful":0,"cool":0},"WXJdB0zqAmpzjO8gNDzX6w":{"text":"Upscale Red Lobster- wow, took them not one, not two, but THREE times to get a piece of th","useful":0,"cool":0},"7i9yKE6R7BBMcIuBk5-BrQ":{"text":"Today I ate at redfish grill. The food was great. I came in at 3pm. The service behind the","useful":0,"cool":0},"Us0PlRXLGSe0XvYg3JCPXw":{"text":"Friendliness and food are top notch here. I got the grilled bbq chicken which was super te","useful":0,"cool":0},"ajlCYnaIguL9h7TJCUppxA":{"text":"Should have gone to Subway....\nRed Fish was recommended to us by our hotel for something f","useful":1,"cool":0},"ztnyX00Lb2jqExREZjBstg":{"text":"There is not one piece of criticism i can give!  We made reservations and they were ready ","useful":0,"cool":0},"54oWi1dQqL8g05VV_uhi8g":{"text":"A solid choice for New Orleans French Quarter, try the Chicken n Alligator Sausage Gumbo.","useful":1,"cool":1},"qZuvt0tSBTn5_bFra-zPuw":{"text":"We came in around 9:30 on a Saturday and the place was still packed! Our waitress was a li","useful":0,"cool":0},"u1Czl2MNL4bv8tak4M5mzA":{"text":"Really great NOLA cuisine!!! Really great NOLA service!!! Redfish grille never disappoints","useful":0,"cool":0},"P5-sg6XJd0ZIG7NKI7vbkQ":{"text":"This is probably my new favorite restaurant, if only it wasn't on the pricey side, but hon","useful":0,"cool":0},"8I6D4v5qvv24JqhouprVog":{"text":"I stay on course when i'm eating in cities or regions known for certain foods. So i ordere","useful":0,"cool":0},"QSzRv4o1fbRdjcUd0AK5bA":{"text":"Wonderful food and fun environment.  Always very crowded so make a reservation.  We loved ","useful":0,"cool":0},"PRAcRCtEsYVaq4qaXB-_Vg":{"text":"Food was so so. not what I expected after a ton of great reviews.  \nOur waiter seemed to b","useful":0,"cool":0},"ivKpsjXQg1GhIJb_n1hT2g":{"text":"This place was really delicious! My table started out with the seafood sampler.  The allig","useful":0,"cool":0},"sFX6kW6ADRgayq9Ars4tVg":{"text":"The food had good flavor and was out quick and hot!  It is a good atmosphere and the Redfi","useful":0,"cool":0},"3LjZzcEsiIJe0X-GMlSmwQ":{"text":"Red fish entree, moist and flavorful, large portion. Plenty of room at the bar, convenient","useful":0,"cool":0},"hSYgil29cG8o16wmvbEK9Q":{"text":"The fish stuffed with crab signature dish was excellent but the soft shell crab dish was n","useful":0,"cool":0},"ZFHi3-KcTwTJOyg8Mrzgkg":{"text":"Exactly what you would expect for a seafood restaurant on bourbon street. Looking at the m","useful":0,"cool":0},"9OGvf3TtXyoUmLeUyDla3g":{"text":"Food and Service were very good, even on a busy night like Valentines.  Was there from out","useful":0,"cool":0},"yka9rhvLtspg_TBny-JmJg":{"text":"Loud and crowded - the back of my chair touched the chair behind me - but very good food. ","useful":0,"cool":0},"fhvFMw0keyXwsXCiep2bCw":{"text":"Saved this place for our last night of a week in N'orleans. We'd been before and it's alwa","useful":0,"cool":0},"KU8jam0ufMTwIaIopy9LdA":{"text":"Trendy place at the end of Bourbon Street. Don't really need to dress up at this place tho","useful":0,"cool":0},"G5DSAWwmTbBfg-TPs20Wqw":{"text":"Great meal, loved the red fish with crawfish and the jambalaya orzo dish. Service was well","useful":0,"cool":0},"2PA8iqwNhxPjAeAEbHHxqg":{"text":"My go to place whenever on NO. Great redfish excellent oysters and the best bread  pudding","useful":0,"cool":0},"jxzzXAuotGXwo6BEOkZBfA":{"text":"This place was FAB!!!\nMy friends and I were in NO for a conference so decided to try out t","useful":3,"cool":1},"TpNq59HsySaKDp1BHncBkQ":{"text":"Bar menu was delicious. From beer to oysters and po' boy sandwiches, it was good food, gre","useful":1,"cool":0},"6xRHa1RL9VugFgHgrzEaIQ":{"text":"What a wonderful meal.  Do not miss the BBQ oysters.  There are outstanding.  Seriously.  ","useful":0,"cool":0},"810-WYtmPSOafFiFWHB3PA":{"text":"The last night in New Orleans we reserved this place. Kind of busy, though we booked, we s","useful":0,"cool":0},"YfvSUMO7DHeepOF7UJJe4Q":{"text":"Red Fish is great if you've been eating non-stop creole food in small, crowded, dark resta","useful":0,"cool":0},"CTF8NtFcFq8_jN_JINYScw":{"text":"Friendly and competent staff, but the food experience was mixed. Two featured dishes, the ","useful":0,"cool":0},"AtgYWWwCtb0deTbC8FlsAA":{"text":"Decided to come here after seeing an ad about it in my hotel room guided tour book. I'm so","useful":1,"cool":0},"oJoSELFuD0sU4BEkzl5QGA":{"text":"Just came to this place for happy hour and was pretty disappointed. Raw oysters were .50 e","useful":0,"cool":1},"2_UZURzBbn2kOVE8Q6u1Dg":{"text":"The Grilled Red Fish with the crab was five stars alone. Its one of the better dishes Ive ","useful":5,"cool":4},"Xk7kdM-YXmTncc_YW9pWyA":{"text":"Really tasty food.\nthe caesar salad was terrific.\nThe bread was hot and fresh.\nBeing a non","useful":0,"cool":0},"YZkgkjsXYtH0qNaBhZxWHg":{"text":"Excellent cocktails! This place has the best Bloody Mary and and excellent Pimm's Cup. We ","useful":0,"cool":0},"d9Aw_J5v430vvmvw5FkVww":{"text":"Service was terrible! Waitress never checked on us. Took twenty minutes to order and resta","useful":0,"cool":0},"aLzHHszd2q2Rz1OW9ov4BA":{"text":"There was a small wait time like 15 mins. But The food was amazing! If I could do 10 stars","useful":0,"cool":0},"D8AAgKGuPYWynut7u9C1kg":{"text":"The service and the double chocolate bread pudding were both fantastic! The rest of our me","useful":0,"cool":0},"nXFHiAnkZSb7eaAxA45o9Q":{"text":"Thoroughly enjoyable Thanksgiving buffet. The food was delightful, a mixed bag of traditio","useful":0,"cool":0},"fOYDGJjKjUcNUT90h6wPBg":{"text":"Great restaurant! Drinks were delicious and the appetizers and food even more so. No wait ","useful":0,"cool":0},"huKlt3YK_d6OEgnytQr0Zw":{"text":"Went to Redfish for lunch with a group of coworkers. The waitstaff is very friendly and at","useful":0,"cool":0},"KOvXpm-HGd5BS539WW0r9Q":{"text":"You must try the grilled redfish and follow it with the chocolate bread pudding.  Redfish ","useful":1,"cool":0},"xtYap-vjMrVJ1jEjZuYPUA":{"text":"I was alone so sat at the bar and the bartenders were great, food was delicious but the pl","useful":0,"cool":0},"AQcFuOvpcjYh0-6ofrNhAg":{"text":"Great food and ambiance.. I ordered the catfish with alligator and they served warm French","useful":0,"cool":0},"8njaSuh32_LefMAYIHs86A":{"text":"Amazing! Food was delicious and the service was outstanding. Reservations are a must, but ","useful":0,"cool":0},"bw170xs-bfcgXICuc03d-g":{"text":"For two, with appz and dessert, spent 100. Food was bland very little spices, not good whe","useful":0,"cool":0},"hQ5T4SyJGpH6cKX5V4gNqQ":{"text":"It's been over a year since I've been back to Bourbon Street ( my liver can only take so m","useful":0,"cool":0},"uUah-ucM1u5vDS5OCUmW5Q":{"text":"Straight up. It was Ok but... I told my fiancé it was like going to a New Orleans Cheeseca","useful":1,"cool":0},"iQvkWhDjT0nbnsdJjkX51g":{"text":"First time to visit this restaurant. I think our food was forgotten about in the window. R","useful":0,"cool":0},"w1PM_-jY6KRiNYtGIBi5tw":{"text":"Great place,great fish, great service. We split the Redfish with shrimp. It was perfect fo","useful":0,"cool":0},"5V-Rn6c5oDzoQi7SGKabaA":{"text":"Walked down Bourbon Street for a late lunch, and happened upon the Redfish Grill. Cool dec","useful":0,"cool":0},"h0SSbddhDupApbuZ2kiUJQ":{"text":"It's aiight...they know it's holiday weekend & they ran out of half of the menu...so they ","useful":0,"cool":0},"gAp3M_HV049GapwRxsRSXQ":{"text":"Had a cup of gumbo to start off our meal - so tasty and flavorful.  There were ample piece","useful":0,"cool":0},"ZSJ1N1Uv-4yvjepxTjk7aA":{"text":"This was on my \"while in the city I must try...\" list.  Came for lunch during a conference","useful":0,"cool":0},"kaX52zDzLeNvbydCBsDq8Q":{"text":"Delicious as usual!! We decided to go for lunch, just for the barbecue oyster po-boy..it d","useful":0,"cool":0},"KK_kELbHkRKfpi--e9dSCg":{"text":"Anybody who raves about this restaurant has obviously not traveled much. Don't get me wron","useful":0,"cool":0},"aSLjX4IqstQQ7umjAixFfA":{"text":"Service is excellent! Waiter know the menu well and made lots of suggestions. I ordered th","useful":0,"cool":0},"3JGSqArHAEKGhpxPokP_mQ":{"text":"Food and service are excellent. We had to wait until the restaurant opened so we sat at th","useful":0,"cool":0},"tSMvkdcbZI7--vfzIjCzhA":{"text":"We actually ate at Red Fish Grill for their Thanksgiving buffet and we were not disappoint","useful":0,"cool":0},"JzoMgr9_paanzq7qip_S1Q":{"text":"We went here with kids and do not feel like we are welcomed. The food was over priced as i","useful":0,"cool":0},"fTiNscHUI7MoEGnLNjMxkw":{"text":"Loved the ambience. Really good sazerac. But even better oyster and alligator. Absolutely ","useful":0,"cool":0},"6ioJ3wp8GoLD4SfU_FsTig":{"text":"Visited yesterday before show at the Saengar theater. Wife and I had BBQ crawfish with waf","useful":0,"cool":0},"XIS6lVLhHi34RGwac0HzzQ":{"text":"This place is awesome. Right on bourbon street so the location is amazing right off the ba","useful":0,"cool":0},"2SpexNXFwEbPEe-4CgIJjg":{"text":"Definitely worth a visit. The service was great especially being I visited during Mardi Gr","useful":0,"cool":0},"AipJXp31w7qcv_NPAxqQzw":{"text":"Overall Great experience! Our waitress started out very dry but turned out to be great! Ha","useful":0,"cool":0},"Vrj9wLnxJwYMwmjAP7whUw":{"text":"Kind of disappointing after reading all the great reviews. Our server lacked any personali","useful":0,"cool":0},"cdmJL-2ZvGRy9UIa_6bESg":{"text":"OYSTERS on OYSTERS! That's all I craved while visiting NOLA. Stopped in here first after g","useful":1,"cool":1},"UpBZLcwkgUe8S_Tuh_kOog":{"text":"The food lacks thought in creation. The bbq oysters are suffocated in hot sauce. Based on ","useful":0,"cool":0},"5FdwcFCFj1unuMK4IV3VyA":{"text":"Wow,  wow,  wow!  This is raw oyster heaven.   I hit the Red Fish Grill on Bourbon St. for","useful":1,"cool":0},"8Q-JVrwCV2wMKTQer6DVag":{"text":"Dinner was Delicious! \n\nExcellent customer service from Chris! \nFresh baked Bread w/Butter","useful":0,"cool":0},"IVfefTWRVO0oYP095XcVag":{"text":"For a restaurant on bourbon street, it's ok. Definitely more family oriented and cleaner t","useful":0,"cool":0},"VqgizsR4mFHhV16LReVJ3Q":{"text":"Stopped in here for lunch with friends totally at random. We were very pleasantly surprise","useful":0,"cool":0},"lh0Vkmaj8HPavGZLpfXHLg":{"text":"Went to Redfish for lunch with a group of coworkers. The waitstaff is very friendly and at","useful":0,"cool":0},"XqOb8aF3rxT6w5-5KPMfvQ":{"text":"Best restaurant of my entire visit! The place was clean and the staff was friendly and ver","useful":0,"cool":0},"fF8JM4CiSfDu6ytGGlAoRw":{"text":"Not bad prices for the delicious food. Anita Turbodog on draft, peacemaker meal (6 bbq oys","useful":0,"cool":0},"X6t8kSWRWvY5ogglmim0Jg":{"text":"I'm sure this place is tourist central, but it was so amazing.\n\neats:\nalligator boudin bal","useful":0,"cool":0},"UPnu6WkbWmsUzRlBq6AZ6g":{"text":"Wonderful food and staff... get the seafood sampler","useful":0,"cool":0},"a7yCF1St8UH-mKglE8hAfw":{"text":"This place is amazing!! Great waitstaff, great old fashioned, gumbo, Red fish, steak, and ","useful":0,"cool":0},"8QM4TFZpYCLrfshG_uCIGQ":{"text":"The food was wonderful.  CJ and Jeremy were awesome wait staff.  I had jambalaya risotto a","useful":0,"cool":0},"w1zViciM9VyspTJEpAhTOQ":{"text":"This place is awesome! If your coming to New Orleans you have to make this  restaurant one","useful":0,"cool":0},"3iXKL6JxoEew1l9Fb0OgKA":{"text":"Do you dislike both spicy food and seafood, but want to be told that you're eating spicy s","useful":0,"cool":0},"jFOXl1xiG7yY0C9Hjh6QMw":{"text":"Red Fish was ok.  I had their snapper and it was pretty bland.  There wasn't much to choos","useful":1,"cool":0},"xVrfG3Z_xuCA2QjN4SZoXQ":{"text":"First off, our server Jasmine was awesome!\n\nSo this was our second day in town and everywh","useful":1,"cool":0},"GFnrSxleWuoZKcvt9b7oBg":{"text":"I come to Red Fish Grill once a year for a Mardi Gras organization member dinner, and thei","useful":1,"cool":0},"yf-bJ5s2k7hYrxrSxHvKLA":{"text":"Such a good seafood place! The BBQ oysters were delicious! Kirkland & Gary were our server","useful":0,"cool":0},"jxY6ZxDKUgUfZoeSzOYbdA":{"text":"My wife and I had one of our best meals here when visiting New Orleans. Someone we know re","useful":0,"cool":0},"1MwoB1wz_uPZVfXOGv0jTA":{"text":"Great food and great service consistently at this restaurant.  The redfish with crawfish r","useful":0,"cool":0},"5I6krBhzH2c0oZ6Lqe2J0g":{"text":"My husband and I happened upon Red Fish Grill our first night in town while we were walkin","useful":0,"cool":1},"JIKRdtQgi81eN0nkP_lLTg":{"text":"Must order the Creole Jambalaya Risotto , it was the best risotto I've ever had.  \n\nWe had","useful":0,"cool":0},"_Bps_Ne8zYmkGa7MzHbhiA":{"text":"Such a great place for such a disappointing restaurant.  On our third day in New Orleans, ","useful":2,"cool":0},"NofBdZ67Ymx7CNLP3zxPUA":{"text":"Nice meal, for me, my wife, not so much. Started with alligator boudin balls which I would","useful":0,"cool":0},"wlAgBCprI7WVeJ1F6bitdw":{"text":"Some meals are small portions but the BBQ oysters are fantastic","useful":0,"cool":0},"aMRdPe_BB6t3U-eBvJTLyQ":{"text":"Top notch service from Andrew.  Very knowledgeable with the wine list and local informatio","useful":0,"cool":1},"UnRtN3ZpJNUHsA5KGZLp3g":{"text":"This place was disappointing to say the least. \n\nDespite its OK review rating, we made a r","useful":1,"cool":0},"zVBOVcQVmKs7fUX63Ny-kg":{"text":"Stopped in on a recommendation of a friend.  Had their alligator balls and fried oysters. ","useful":1,"cool":1},"v0kbZG40PselA5mpzp8iAQ":{"text":"The cordial wait staff and the high-priced plates  contrasted with the exposed brick walls","useful":0,"cool":0},"SzppoEmo8ioCD5RJHB8sXg":{"text":"I could not wait to try this restaurant as soon as I got to town. Unfortunately after eati","useful":0,"cool":0},"FfI16fBMqQz1SSv06v7ITw":{"text":"Great atmosphere and great service. I ordered the redfish with lump crab meat and couldn't","useful":0,"cool":0},"9WZSKFd3dqtiG46gRTkG1A":{"text":"Ok , Mediocre food . Very polite and nice waiter though . Good atmosphere .  If you come a","useful":0,"cool":0},"c9lagZ_akN5rHJ23X5ykoQ":{"text":"I'm not one to make my reviews into novels. Here's what I think:\nThis is a solid restauran","useful":0,"cool":0},"YtzL8MjItckYLqEBBG36ZA":{"text":"One of the best dinner restaurants in NO. Exceptional service and wonderful food. Much lar","useful":0,"cool":0},"3-osCJO2gPY1-0fDmsvGUg":{"text":"One word to describe this place....overrated!! Out of 4 entrees only one was worth eating ","useful":0,"cool":0},"wRkYrZOkhaMV894IUeKR4Q":{"text":"I was pleasantly surprised by our meal here tonight.  Their oysters were super fresh, plum","useful":0,"cool":0},"UjkiBCqVudLyCTbmbawCzg":{"text":"Wow,  not really sure how a dining experience could get any better. Waitress (Susanne) was","useful":0,"cool":1},"xm5T1hBh23qtu2ggd8mABg":{"text":"Disappointing.  We went at lunch time when it was not so crowded, but service was neverthe","useful":0,"cool":0},"1Yt96PvM64GDChXRQ3xpzA":{"text":"3-6 Monday-Thursday happy hour has 2 for 1 beer, 2 for 1 cocktails, and 50 cent oysters. I","useful":0,"cool":0},"BlOwwADy8KPx9SAgAZ_tGw":{"text":"This place was a ridiculous wait on a Friday night so I sat at the bar.  BBQ oysters were ","useful":0,"cool":0},"vBPyCOrZy9m_4gfo0EgsnA":{"text":"Loud touristy seafood on Bourbon street - need I say more? We tried going here late one ni","useful":0,"cool":0},"kfN5nZvl3JcNemj-XRuyhg":{"text":"So this place is located in the French quarter on Bourbon street. Went here , and enjoyed ","useful":0,"cool":0},"fNgSr40BY6JNAYOLz-ZPhw":{"text":"Crowded, a little rowdy, but to be expected for Bourbon Street.  But that actually makes t","useful":1,"cool":1},"7NhXI8SycQbJAEE9aKOe3g":{"text":"This is my 2nd time eating here. The food and atmosphere is simply amazing! Started off wi","useful":0,"cool":0},"2c4JrCwbZJcPC0OlT1fxlA":{"text":"My wife and I went for a lovely dinner and we were so happy we did! Alligator Boudin Balls","useful":0,"cool":0},"U6t-ep9s5_SyzioXRL2Uww":{"text":"I made reservations for a party of 12, which got turned into party of 16 a few hours prior","useful":0,"cool":0},"eajL5xGpMbZuSlkctZholg":{"text":"In town from Lafayette Louisiana for the Helen Brett show at the convention center, we cho","useful":0,"cool":0},"ffajFFl0SFjZT6-lJo-tvg":{"text":"This a great introduction to new Orleans.  Just landed and this was first stop. Great food","useful":0,"cool":0},"-uWPgnGWawG6JNZvB1Eeng":{"text":"Reservation sat, ate, left? Felt rushed, can't even remember, what I ate? I guess too tour","useful":0,"cool":0},"LSVPxcKpBGpEMVQU4HIt3g":{"text":"Awesome food. GREAT service. Sat at the bar on the oyster bar side and the bartender Dicki","useful":0,"cool":0},"Dj2ClxC4gtYPqQKQpWhthA":{"text":"We were in New Orleans for a week (March 25, 2014) and had heard and read so many good rev","useful":0,"cool":0},"lfGNl7kUu3YfZXdaWYxlJw":{"text":"Went there with a large group (17 people). They handled our group beautifully and split th","useful":0,"cool":0},"I0sdBIuOCTtKxguM-JhXDA":{"text":"Always a culinary treat, the Red Fish Grill serves delicious, local seafood in creative wa","useful":0,"cool":0},"l8fExFMTXEuzqOc1CBxcsw":{"text":"We went there with a party of 6 on Saint Patrick's day. The place was a mad house. The ser","useful":0,"cool":0},"kRyCxy3QycuvLTsnTYMXLg":{"text":"Came here for dinner after reading so many wonderful reviews. Had the alligator boudin and","useful":0,"cool":0},"R__LuXQz-NTUDHyuXXIAIg":{"text":"Crispy red fish and the grilled red fish are really good!  Their chocolate pudding is only","useful":0,"cool":0},"4gPtT7X-1lj_QcdjB3XarQ":{"text":"I got my food to go because I had some errands to run. I got the shrimp and grits, and it ","useful":0,"cool":0},"mBpcjL_v5x_xDp7SZT22GQ":{"text":"Came here on a Thursday evening because I hate waiting on long lines and boy was the line ","useful":0,"cool":0},"5vaPgbzLPEElz-3Pt2griQ":{"text":"OMG the bread pudding.  \n\nOur first night out and we started our evening at Red Fish Grill","useful":0,"cool":0},"BjPi3lUphF8HTh8n-hNBjA":{"text":"It's really hard for me to give a place one star. Normally I like to find something they d","useful":2,"cool":1},"uIbouGvLffYNhiHBMRavQg":{"text":"I've been to New Orleans several times and I swear by this place. It is pricey, and it is ","useful":0,"cool":0},"hmGhYjc0MLyKj1uqeToECA":{"text":"Great place but you may have to navigate some street construction. Crab cakes and pompano ","useful":0,"cool":0},"epz413Z0PdtZwt_EqvsMNg":{"text":"I've never had red fish, but it is amazing. The taste and texture is very meaty. I live in","useful":0,"cool":0},"Fr_o7vdxh8juMR4hdCmdzQ":{"text":"Excellent meal here and great service. Al at the bar was amazing and emphasizes customer s","useful":0,"cool":0},"tBI-skXIL29EF-ZR_INHug":{"text":"Went to this place because wife saw a video ad for them. It was really good. They had a ni","useful":0,"cool":0},"EruaBsRZUEKbXWh33SFdiw":{"text":"Best casual seafood place I've been to in NOLA. An order of BBQ oysters and a crab cake ar","useful":0,"cool":0},"198sarjKZBS0yd3N0_9DnQ":{"text":"Redfish Grill has been on my list of \"must try\" restaurants in New Orleans for some time. ","useful":0,"cool":0},"bUAev_HMTRWcOTkM3UI2hA":{"text":"My 1st Hurricane in NOLA and it was a doozy...I had forgotten how tough 151 was. The spina","useful":0,"cool":0},"ZSl7FW0M6UEuqW69i5afCA":{"text":"Yum. Service was a little slow but the server was nice and the food was excellent. Really ","useful":0,"cool":0},"TPb-0mX1rJRedb0Gdaq3CA":{"text":"Only okay poor boys. The shrimp were better than the oyster sandwiches.  The oyster were c","useful":0,"cool":0},"iLN95DTr7NYdviFJKQR9aA":{"text":"Ate at Redfish Grill last night.  Awesome time.  Met a group from Tennessee in the bar who","useful":1,"cool":1},"IyUz0ko4m8sIvwFEJmv5sw":{"text":"Josh has EXCELLENT attention to detail.  We never wanted for anything and we sat in front ","useful":0,"cool":0},"pJ0Umg-kpKxZIMFigWR3AA":{"text":"This is a great place. The food is really good and the service is super. We popped in on a","useful":0,"cool":0},"ASBgVmviBqvRwj9qRO2EHw":{"text":"The BBQ Oysters were fantastic. The fish and crab dip good as well. Also had the blackened","useful":0,"cool":0},"nQxCVPYdDGVm-nvqaJ7bRg":{"text":"I have been to this place twice and loved it both times. Everything has been excellent. It","useful":0,"cool":0},"S85cfsVK6Ouk8vDUShLKRA":{"text":"Came here for birthday dinner tonight. My server, Gary was awesome. I had the whole fried ","useful":0,"cool":0},"MkloytCb9vw_JDjURtiB1A":{"text":"No. No. No. I don't recommend this place. Our meal was barely good. My cocktail was served","useful":0,"cool":0},"nUkX2jc2to0a-jhcjGrMrw":{"text":"Great restaurant! The staff was more than attentive. Took their time and explaining each d","useful":0,"cool":0},"C15bnQbiGt6rvCvlZTNT7g":{"text":"Great place! Reasonably priced for NOLA, and the food had tons of flavor.  I got the Red F","useful":1,"cool":0},"MugCy2seXQJpAv4yc-j-sA":{"text":"Pricey but the food was pretty good. I know you are really just paying extra to eat on Bou","useful":0,"cool":0},"mpfKbXtB69QdF72rX-FMQg":{"text":"Walked in before the restaurant proper was open but they were doing 2 for 1 happy hour at ","useful":1,"cool":1},"SDtZ9RXCJAg7ArIX8-o1Og":{"text":"I went here for drinks one night and lunch another.  The Abita Amber was flowing the first","useful":1,"cool":0},"3fWc-8EAOr_VwAw-jIkrdg":{"text":"Happy Hour Oysters at the Bar are a must! A+! Friendly staff, great service, amazing food ","useful":0,"cool":0},"0vkNY6MtWdzpbKraseYU7A":{"text":"Popped in here my first night in New Orleans for an easy dinner. Place was packed, but I f","useful":0,"cool":0},"1J_vfb5SjiWVJaR2dKHh_g":{"text":"I have to say I've eaten here several times and have never gotten anything bad. My top cho","useful":0,"cool":0},"yff8w0uvC9y9ctch4pYAVg":{"text":"Oysters. We arrived about an hour ago and dropped our bags at our hotel and hoofed it over","useful":1,"cool":0},"d7ZhETVM0__dGZfVgkgEvA":{"text":"The BEST happy hour you'll find if you're looking for a great deal on raw oysters. On Mond","useful":1,"cool":1},"NVB_enUZw5xFcFIE2p_MGA":{"text":"Great food and great service!  Be sure and try the BBQ oysters... Fantastic.   Sit near th","useful":0,"cool":0},"UVyZQ-RhsPtu5dQ8phE44A":{"text":"Had reservations Friday night and we were seated promptly. We were fortunate enough to get","useful":1,"cool":0},"BL9mNLDsr2u-elu_k8AfDQ":{"text":"Great place on Bourbon St for fresh seafood. We had the buffalo fried oysters which were g","useful":0,"cool":0},"G4741bUaPPYK3uuJ_-piDg":{"text":"Great food, reasonably priced.  Amazing service!  Friendly, attentive but they don't hound","useful":0,"cool":0},"nHR3RkROugxFZ0sSu4LWRw":{"text":"Amazing!! They have a fantastic happy hour (although the price of the oysters is not 50 ce","useful":0,"cool":0},"gJ92LPhuIkLuoXt437bMNg":{"text":"Food was great.  Our Waitress, Carol S., had a bad attitude.  Would have enjoyed it better","useful":0,"cool":0},"BOtQElCBq2A25mQXLYLYrA":{"text":"21 Jul 2014, 12:30p\n\nHubby and I were meeting friends for lunch at 1:00p, but arrived earl","useful":1,"cool":1},"sqINYUKJQV8mnIAolVInWQ":{"text":"I stopped by for lunch and had the fish tacos- very tasty!  The food was fresh and cooked ","useful":0,"cool":0},"GDJH_pH545JhMU2hzFCiQw":{"text":"Went here for $.50 oysters.  Can't go wrong!  Great service and the Bloody Mary was good t","useful":0,"cool":0},"tsHrNykANqbMdyJA69eh3A":{"text":"Food is ok. I think this restaurant is over rated. I was at a company event with a fixed-m","useful":0,"cool":0},"V4-xeNg87M20UHIp3cR3PQ":{"text":"Amazing food amazing experience!! Michael was our waiter and he recommended the BBQ oyster","useful":0,"cool":0},"5zLVXAzAopFkXRGtgDsYXQ":{"text":"A fantastic surprise! Our best meal in New Orleans, and we had a LOT of wonderful meals. W","useful":0,"cool":0},"AHjrfQs9BkGV2H0l3Fp2ig":{"text":"I have to say that the gumbo is the best I have ever eaten and the red fish is excellent. ","useful":0,"cool":0},"T0_Y9W-eqVmLZwboKIJIpw":{"text":"No reservation?  No problem!   They have the full menu service at the bar.  \n\nI popped in ","useful":0,"cool":0},"eiSQWeYBWWDQSnoHjE_NrQ":{"text":"Excellent, excellent, excellent! I was in NO for a business conference, stopped here for d","useful":2,"cool":1},"kTKP6fIDiAOT8dgT3JMB5A":{"text":"Started off with some gumbo which was absolutely delicious and the bbq oysters were awesom","useful":0,"cool":0},"a4irUwmXEuc1fpfv8A9s1w":{"text":"BBQ oyster appetizer had way too much batter, prefer lightlly fried. My wife and I both th","useful":0,"cool":0},"CjxsoSKYGMC85yKUmLqQJg":{"text":"A consistently safe place to dodge the havoc of the Quarter and grab a good meal.","useful":0,"cool":0},"2ZMzIpP2uDo93xYTaLi8Rg":{"text":"Awesome place. Good beer list very affordable and even better on happy hour with 2 for 1 b","useful":0,"cool":0},"DW0gc3r7iirF79WBa8mdAg":{"text":"Very knowledgeable wait staff, excellent redfish with crusted cream cheese. pretty good Ab","useful":0,"cool":0},"Elb2EhMOAO9sF_Bmhvnw4g":{"text":"Worst service I have ever had in any restaurant in 51 years. Hundreds of other New Orleans","useful":0,"cool":0},"GVDhhFekKmBwM8LAhx3cQQ":{"text":"Well this flavorful establishment is my husbands job so un-biasly I'll say the rustic deco","useful":1,"cool":0},"hAugz6LTUvY0o9fnhjy5SA":{"text":"Came here with a bachelor party group of 13. We had reservations, came on time and waited ","useful":0,"cool":0},"O30qJ2X0AkqbE4ADwjIMzQ":{"text":"The crab cake dinner and the hurricane drink are absolutely extroidenary. Our waiter Brad ","useful":0,"cool":0},"xXmaUZEDeROEo-x4WTjVyA":{"text":"I have often overlooked this restaurant for one reason or another on my quest for amazing ","useful":0,"cool":0},"sTiyLGWVyVQ6B7gJXwhugw":{"text":"My family ate here on Tuesday night. The blue crab claws were a hit with my kids (come wit","useful":0,"cool":0},"0PYTB7RyobCPrFDiyIQYrg":{"text":"The gumbo is delicious! Alligator sausage & shrimp pair very well in this New Orleans stap","useful":0,"cool":0},"f1VUsuO5AqdckPfonKsp3g":{"text":"Delicious meal....and this is coming from someone who is not a fan of seafood! I had the S","useful":0,"cool":0},"wkJdstloibe68KCFEolfoA":{"text":"This is a really nice restaurant for being in the crush of Bourbon Street.\n\nThis is what I","useful":1,"cool":0},"mFbyRVSN1M_S5dTVLRfiFw":{"text":"This place was just ok. Very corporate feeling, very crowded and much like a chain, not ve","useful":0,"cool":0},"CphpgCg3IFEe31KZ-gh7Ew":{"text":"This experience was really good. The redfish which is their specialty was amazing. I wish ","useful":0,"cool":0},"EOK_sEVUtTZeMDKeogC4Pg":{"text":"Other than a mishap with my toe gettung caught under table, everything was just great.  De","useful":0,"cool":0},"YvY84KLTzhHIgFnuvLTcuw":{"text":"AL was awesome, so nice, gave us good recommendation on the food, we loved everything drin","useful":0,"cool":0},"Dy5_rUPF-E0kjacqz-iBcw":{"text":"I went for lunch and had the BBQ Oyster po boy. It was the best po boy I have had in New O","useful":0,"cool":0},"Rw8Sq4nCTOtynI8yKmjzZA":{"text":"I sat at the bar during a quiet time and was treated wonderfully. The raw oysters (was in ","useful":0,"cool":0},"KBW41pYaJ9sA_NiVdcbgCw":{"text":"This is where I fell in love with Gator. \n\nThe service was speedy with a southern charm. I","useful":0,"cool":0},"4sktnOmaRvptLV1cQXdokg":{"text":"Went for lunch.  Fish tacos were filling and so yummy.  Could hear good jazzy street music","useful":1,"cool":0},"ANe35I3n03eAtddN1nx3fA":{"text":"Great service. Clean place. Bad food. I had the Louisiana Court-Buillon and husband had Ch","useful":0,"cool":0},"Td7Z-A3JxXg3ySAY_uSiqQ":{"text":"Seated early, which was perfect!  Had amazing food, good cocktail, amazing dessert.  The r","useful":0,"cool":0},"aDvb6KCRo5nZJWl2Qvzllw":{"text":"First of all, Chris our server was excellent!  Great recommendations. My boys had the BBQ ","useful":0,"cool":0},"0Ya_hz1EjWY6Wq256i-_Vw":{"text":"I sat at the bar and ordered a beer and the signature redfish dish. The bar tender was thi","useful":0,"cool":0},"GlUNxBdpmIpMENN_mF269Q":{"text":"Great happy hour, including craft beers on tap and 50 cent oysters! Very nice and honest b","useful":0,"cool":0},"CqjMeUe8W_S9B3gCEdVVzQ":{"text":"Good meal.  Not blown away.  I had some gumbo to start with alagator  sausage.  Fried catf","useful":0,"cool":0},"K1m6r6h6kIs1bxjozPBYfQ":{"text":"Visited this highly recommended restaurant for lunch and it definitely delivered. My husba","useful":0,"cool":0},"96_rKal3xoUFA01bbY0E4A":{"text":"Today was a cold rainy day. Needed a little snack before dinner. Flew in and was told to g","useful":0,"cool":0},"S5D_jqGSmvJ-yzcjh3I14w":{"text":"Amazing Food. I ordered the jambalaya and it did not disappoint. Would definitely recommen","useful":0,"cool":0},"BqTXNUqvRL947dL8V2bFug":{"text":"This was the first restaurant my husband and I dined at after moving to New Orleans. What ","useful":0,"cool":0},"v8w0Kfg0qaWmrtX8MvpYgw":{"text":"Kid friendly and the best service we experienced in NOLA. Gumbo was amazing and everything","useful":0,"cool":0},"HhetT0WvBo9PknphbDnijg":{"text":"This place came highly recommended, but in actuality it was okay. The fried oysters were o","useful":0,"cool":0},"Xz6A1kvl4juw8UZWr_sGRg":{"text":"Yummy food but overpriced in my opinion. Delicious chargrilled red fish with Cajun spices ","useful":0,"cool":0},"bqVqNmvc1qH-5N45UPz9ig":{"text":"This message has to be taken in context.  I don't eat most NOLA fair.  Bug Butts and pork ","useful":0,"cool":0},"DfpmzDwwrNW6INjZ7-dLOQ":{"text":"Came here on my first night in New Orleans. There were 10 of us who came for the conferenc","useful":2,"cool":0},"1u4Y2VOKYdU6FiPzMD5wgA":{"text":"We were a large group, and we had a reservation at Red Fish Grill; however, apparently som","useful":1,"cool":1},"CCXy8A7LbxRrwZ88WxoC4g":{"text":"Beautiful bistro indeed. It was a huge pleasure to stop at the Red Fish Grill while tourin","useful":0,"cool":0},"u8gPTrTm1QV5WqLdMUXzqw":{"text":"Had one over their award winning poboys.. and believe you me it was delish! I highly recom","useful":0,"cool":0},"_ySO8-e0Gxv97TctrhBfiQ":{"text":"Food was just ok.  The French bread was the best part; it comes in a bag nice and warm.  I","useful":0,"cool":0},"wlpRRqQofj0na6oB5kI1Xg":{"text":"Nice atmosphere. Had flavorful alligator balls and raw oysters for appetizers. For dinner ","useful":0,"cool":0},"hYjZz3qMeZOgT4LNnLuhuQ":{"text":"Great meal overall. Gluten free friendly, reasonable wine list, great service. \nFood was f","useful":0,"cool":0},"zN9mvZkZiC6llskHxiFySA":{"text":"This location was overrated for me. It has great ambiance and it locates right on burbon s","useful":0,"cool":0},"yG62sdB9ug7ZwtmWASFsxg":{"text":"Best seafood in NOLA by far. The staff was amazing and incredibly attentive, they really m","useful":0,"cool":0},"mix77wft2pYazxgyiqCP3Q":{"text":"Andre was our server tonight, we had A Plus service! Everything he recommended, from our d","useful":0,"cool":0},"6WfTLY0S8PFYH27vM_gcMA":{"text":"WOW!!!!  Great service, thanks Jack, great food and great atmosphere.  I called for a rese","useful":0,"cool":0},"kBU3enoA49jTPnsrh74e0w":{"text":"Headed home to Texas from Clearwater Florida ms stopped in New Orleans to enjoy bourbon st","useful":1,"cool":1},"SBeg3jNC0svGAKMCJmt70Q":{"text":"The waitress discriminated Asian people. She poured away the water on my friend by acciden","useful":0,"cool":0},"YZj-qQQXQqn8reDzQFTTsA":{"text":"Ignore all bad reviews.....food delicious...service excellent - 'Jasmine'. \n\nBarbecue oyst","useful":1,"cool":0},"Bzhh1_WYhib_BcSy9Ofa_w":{"text":"The place was clean and air con. The food was not very good. Especially for the price.  I ","useful":0,"cool":0},"63BB0xedCyl08eBCiErkvw":{"text":"We absolutly love this place.  Every meal we've had is wonderful!!  Their desserts are wor","useful":1,"cool":0},"SalfMjuBPFTcT9W5B7DPig":{"text":"Yummy place but very noisy so don't go hoping for a romantic evening or to catch up with o","useful":1,"cool":1},"rT8UF8ByFK_7Pds9959cqg":{"text":"Absolutely delicious! The sampler appetizer was fantastic. Bread delish as well. My husban","useful":0,"cool":0},"6p-nhJp_lZaPUvz4reWWpQ":{"text":"Amazing experience. This was our first visit here and it was as also my birthday treat fro","useful":0,"cool":1},"j7Bq9lJUvTxzZjXEtAgj0g":{"text":"My friend and I were in New Orleans recently and heard rave reviews about this place. We w","useful":2,"cool":0},"bas371Z0P1EY7xWtRE74gQ":{"text":"This is worth the hunger pain and NOT eating anywhere else. I mean this place is orgasmic.","useful":0,"cool":0},"soZXOmx4ZMK6ipUO40qZTQ":{"text":"Aye at Redfish Grill last night.  Awesome time.  Met a group from Tennessee in the bar who","useful":1,"cool":1},"na7Mokh5Q7_mqTyKDiBJIA":{"text":"Went with a large group of people from a conference. The restaurant was busy but took care","useful":0,"cool":0},"QTbCamh_CCWUIhmWmm7nyA":{"text":"Sort of a corporate kind of restaurant, but after a couple of days of slogging it out visi","useful":0,"cool":0},"3SX0G8tCLbOhpDcIFKe34Q":{"text":"First night in New Orleans. Stopped at the Red Fish Grill. Fernando was a great waiter. Re","useful":0,"cool":0},"0FjqezgZtokWOU5zQDfaDA":{"text":"Red Fish Grill does not disappoint. Attentive servers, delicious food, fun atmosphere. We ","useful":0,"cool":0},"Jud-2vKX2GSfEwGx3FCbpw":{"text":"You gotta try the hickory grilled red fish! Get it Ike style. If you are lucky enough to g","useful":1,"cool":0},"xZCUtufWelWS44CoY6xY9g":{"text":"Overall Red Fish Grill is a good restaurant but for the service the price is higher than e","useful":0,"cool":0},"dxIwAWfm1RmyeDGygVKuKA":{"text":"I'm in town for a conference and I ate here with my team after the events for the day. The","useful":0,"cool":0},"AruJGO8yrUzbqm7hoWXfRg":{"text":"Absolutely top notch Cajun cooking place. We were in New Orleans for New Year 2008/9 and h","useful":0,"cool":0},"ErvtVP-3qAXSiF5FiyHtvg":{"text":"We ordered fresh gator balls and fried oyster appetizers and wood grilled redfish and Loui","useful":0,"cool":0},"-LyvYU-tmUmuyMQe_Iq2vA":{"text":"Red Fish has super-attentive, hard-working bar staff who are eager to please and converse.","useful":0,"cool":0},"ropVHFO7OVOMqW7hD9m6-Q":{"text":"Came in on a very busy Sunday evening after the first Jazz Fest weekend. I have to admit t","useful":0,"cool":0},"AnNbwRxS0SSe0L73rzi2GA":{"text":"Marginal food and horrible service. Had a business dinner here and they sat us way past ou","useful":0,"cool":0},"kZscWiAYN8bfeSNxxpQ9xA":{"text":"I was planning to have lunch at G W Finns, but the girl at reception steered me towards th","useful":3,"cool":1},"pFQfBXxHo0G72DnMffsAUw":{"text":"I absolutely love this place! Dreamed of coming back to get the BBQ crab claws since the l","useful":0,"cool":0},"MB6IZwxh8H2HGwRc93S5Iw":{"text":"I frequented this place a few time on my trips to New Orleans.  This time I tried somethin","useful":0,"cool":0},"Vu_M9C_gsJcOIHvgiPuZ2g":{"text":"We were on a guy's trip to New Orleans and this place was recommended by the concierge at ","useful":1,"cool":0},"OW1gwd549O8Ajazgwsh15A":{"text":"So... $0.50 oysters for happy hour. I repeat- $0.50 oysters for happy hour. Great service ","useful":3,"cool":2},"vHWJc57gBZfaW5QMr3uErw":{"text":"We were very excited to try this restaurant after seeing it in all advertisements.  We arr","useful":0,"cool":0},"FlZk7jNJ1neyDWx0BUm_Ww":{"text":"Fantastic meal - I had sautéed shrimp with jambalaya and it did not disappoint. Service wa","useful":0,"cool":0},"oeCxhD6afm6k_PW5VeYs7A":{"text":"I really enjoyed this restaurant. I ordered the gumbo with alligator and it was delicious.","useful":0,"cool":0},"5Om72BtKQqbQq4Q11Zi2Tg":{"text":"We had catfish and blackened red fish, mashed potatoes and vegetables.  The food was good,","useful":0,"cool":0},"TM05KqBEnQTQQLL62oMweQ":{"text":"This used to be my place in the Quarter for some oysters and a cocktail. The oysters are s","useful":0,"cool":0},"erA3X3DhVRC1ABcY_UhTWA":{"text":"Delicious food and great service. Our waiter Andrew recommended all the dishes for us and ","useful":0,"cool":0},"NzJEad6IB-E6YwzFB3l_NA":{"text":"Oh yeah, this place is good. At the beginning of bourbon street off canal and really stron","useful":0,"cool":0},"SOSNEsfhc-_uPKcQtikFCQ":{"text":"Our server was fantastic, and that's about where the compliments stop. This is a crowded t","useful":0,"cool":0},"CU6b8DCLWY_Pzaf3vkA_iQ":{"text":"The service and the food were both excellent. We enjoyed the salad, bread and red fish wit","useful":0,"cool":0},"UowzTGnyLhl3WfWkvNXyTw":{"text":"I like the atmosphere of the place, although it's a bit loud.  The redfish, of course, is ","useful":0,"cool":0},"VVIHR8Af_9OQlEZSQQ57Fg":{"text":"Had the alligator sausage. The relish had a nice kick . The service was very good. Nice se","useful":0,"cool":0},"VlTBkQLkFaxAGPfKWvDZbw":{"text":"So I came here while in New Orleans. Let me say the waiter was awesome Keith! The Bread pu","useful":0,"cool":0},"II_q-B2eCrTlTeudv4sbBg":{"text":"Everything we had from the fried green tomatoes with crab and the catfish and crawfish eto","useful":0,"cool":0},"dnayYc-fcLyHSPNtI7NppA":{"text":"We had dinner at the Red Fish Grill this evening on a recommendation from my husbands cowo","useful":1,"cool":0},"8kQ5PseIAtfcvAdOXEiwOw":{"text":"DO NOT EAT HERE!!!!!!!!!!!! \n\nTwo hour wait. Hostess never called our name. Said they \"for","useful":0,"cool":0},"No--ZoSSdMe7xqR0SizqVA":{"text":"Great staff.  Pleasant, patient, and accommodating.  Took the time to explain menu items a","useful":0,"cool":0},"gSKwmnArG_T6J7Scip5kcw":{"text":"This place was pretty great. The potato is the best it is a must. The servers are so nice ","useful":1,"cool":1},"GCl-21TBOS8xGXWJgtoIFA":{"text":"I ate at this place for lunch on a Sunday. The only thing I can say I liked was the servic","useful":0,"cool":0},"7zC1-BiigOQvT_GtP52Sgg":{"text":"We always make the Redfish our first stop when we get to New Orleans and always get the sa","useful":1,"cool":0},"2g7U0VjovmewNARusXBePg":{"text":"Overall, the restaurant felt touristy and lacked real human warmth. Server tried to bunch ","useful":0,"cool":0},"YAf_EfXF86bsGMhqc_Lv-g":{"text":"The food here wasn't bed - I got the sampler platter.  Oysters are their specialty and I'm","useful":0,"cool":0},"IkR8fTfPUWdOYXV6oikMSQ":{"text":"The service was really good especially considering how busy they were... the waitress was ","useful":0,"cool":0},"hWKOxcepcT48979NmmDEzQ":{"text":"Great ambiance and decor definitely a great place to check out whole in New Orleans. The b","useful":0,"cool":0},"Fw2sl1MLpsGHDWUU5xAHBQ":{"text":"We went for lunch and I got the Grilled Gulf Shrimp & Blackened Avocado Po-Boy with blacke","useful":0,"cool":0},"BSPzdSj9osXSRFXOikVL5g":{"text":"Had an amazing dinner last night. Ike made sure we were are all happy with our food and dr","useful":0,"cool":0},"AeOXnJfTz0g5dsDYmnu59A":{"text":"Located on the first block of Bourbon, Red Fish Grill is a great restaurant to try if you'","useful":0,"cool":0},"6Yl8yy-0Z_f8lDbm-faWMg":{"text":"Wow. I've never eaten somewhere that started off so fabulous and ended disappointingly. We","useful":0,"cool":0},"_FfRWSXakqmMD9J9xwaE_A":{"text":"Yum! We decided to create and take our own oyster tour throughout the French Quarter and I","useful":0,"cool":0},"OjsNfZkl29fvHlk-I63UoQ":{"text":"Everything was okay, but didn't live up to expectations or the price. The famous BBQ oyste","useful":0,"cool":0},"F477QCOLGzEx9y2z8I2uHw":{"text":"Grilled Mahi Mahi was on point. Alligator gumbo was great. Ike the server was awesome","useful":0,"cool":0},"3CoCsgH8osw7he39ictOqQ":{"text":"Such a good place! Went to lots of different Creole and Cajun places during my time in New","useful":0,"cool":0},"_zQnKxMzAqonyG6QAzE24A":{"text":"Fantastic food.  I made reservations for what I thought was on Monday at 8.  Turns out whe","useful":0,"cool":0},"MZOCLrti5lEicvQW2s3gCQ":{"text":"Ended up here randomly because the place we originally wanted to go to had a HUGE wait.  W","useful":1,"cool":2},"vHP06PiUFzktzKiJ2vYNbw":{"text":"We ate at Red Fish over a decade ago and wondered if it was still as good. They definitely","useful":0,"cool":0},"xwbeEUWOazgD5mnoXC8cRw":{"text":"Oysters were great! So was the alligator boudin and the signature dish, wood grilled redfi","useful":0,"cool":0},"ziKaQiJ6q3W557FHwGXTFg":{"text":"Finally some southern hospitality - when a waiter spills beer all over you, you get stuff!","useful":0,"cool":0},"D0JSWqxnUEdXlJhKk25qvw":{"text":"I am a big fan of Red Fish Grill and been there 3 times. Food is always great, love the fr","useful":0,"cool":0},"YeM_fKNKKH7R9_hB-ZCSbA":{"text":"Let me first start with saying I was super impressed with how they literally had a line of","useful":0,"cool":1},"GE7Uh5kXNZb5eqFsZEVXAA":{"text":"Great atmosphere & good food.   I had the catfish étouffée.  The sauce was great.  Yum.  M","useful":0,"cool":0},"_O21dLTB_YumP_NXNNLykg":{"text":"Overall, it's okay.  Inside it's a nice ambiance the foods good.  But you can get food tha","useful":0,"cool":0},"Dok-VQc8rY_IpPWc-03dnA":{"text":"Whatever the waiter suggests, order it. There's a very good reason the signature dishes ar","useful":0,"cool":0},"bk19xwv5kcm-F03V97-GqQ":{"text":"Had a lite dinner here. Fried oysters and potato salad. Potato salad was good, heavy on th","useful":0,"cool":0},"lnaXgbn_5O4e3x28edzWHg":{"text":"Great Happy Hour! Cheap fresh raw oysters. Only $6/dozen. Great service. Bartenders were a","useful":0,"cool":0},"X55BKLahYRs1DHx_2jxL1w":{"text":"My hubby loved his lump crab cake tonight. My shrimp was over cooked and never found the v","useful":0,"cool":0},"eMNIeeGrnOjL20c51Nb-6Q":{"text":"Great menu and awesome service! I had the soup and salad which were both amazing for just ","useful":0,"cool":0},"2XNpkYcpvrTdooZ4e6cGFA":{"text":"I previously visited Red Fish Grill and had a wonderful experience with both the service a","useful":0,"cool":0},"wp6YMaxY4WIg1ZxMMyFvKQ":{"text":"Made reservations and upon approaching the place were stopped by a woman \"guarding\" the do","useful":0,"cool":0},"JJMYotfBy4OzJRqOaWajXg":{"text":"When you go to NOLA, the rule is not to eat on Bourbon, right? Red Fish is a good exceptio","useful":1,"cool":1},"8VBFGxbbmx8-6WbQZU7c3A":{"text":"Omg ! I would go back to New Orleans just for the shrimp and grits at this place ! Hands d","useful":0,"cool":0},"ZHqpBrn-p5So7T1uq6wfIQ":{"text":"Kudos for the quick open after Katrina serving cheap burgers to hungry saviors, but now th","useful":0,"cool":1},"NVHL3BhUsOKkIN14CPz-uw":{"text":"Super good!  I ordered the Catfish Over a bed of rice (because they were out of the etouff","useful":0,"cool":0},"18gknvvymxhNaa-CZp9eTw":{"text":"The Alligator sausage and shrimp gumbo is kicking the bowl delicious! Also try their signa","useful":0,"cool":0},"L9O6-jHZtSoCPWm2Kdy0Vw":{"text":"They put the HOR in horrible. Me and the bf went last Saturday n the place was packed. Fig","useful":0,"cool":0},"3FjGekNqgKQkWgO2ktmW2g":{"text":"Delicious from start to finish - Moscow Mule, Shrimp & Grits, speciality Chocolate Bread P","useful":0,"cool":0},"2KhjdQW7_YtclGhzP_35aw":{"text":"Noise level is crazy high, table in the aisle and out of Tuna...other than that it was goo","useful":0,"cool":0},"HTgv0QfupPII84SZ5YqvoQ":{"text":"Stopped in from the streets of Bourbon to find this jewel! The service was attentive I jus","useful":0,"cool":0},"raiiHgAj6J1DOQP9BmQd2A":{"text":"I had oysters at ACME, Felix's and Red Fish. My favorites were from Red Fish. Oysters were","useful":0,"cool":0},"vlSqmVqNyiu-XVKT3Fw59w":{"text":"We gave this place a try since it was right next to our hotel. We had a party of 30. I cal","useful":0,"cool":0},"v4oyizetsjPulI7vbHFBkg":{"text":"Went here with co-workers for dinner. Had the Alligator Gumbo (awesome) and the  Hickory G","useful":0,"cool":0},"BfUjM90LxaN6CFwgpAJEJQ":{"text":"Great atmosphere and location. Our server was Dani and she was great and very knowledgeabl","useful":0,"cool":0},"Gx3CGKLonDMsThDe4ywbbg":{"text":"Love Love Love this place! It's my favorite restaurant in NOLA and I find my way to Redfis","useful":0,"cool":0},"vj2hLeCTzgpVtnoU6rxdzw":{"text":"Outstanding food and superb service.  The quality is exceptional and the experience is gre","useful":0,"cool":0},"VkmZyXctnkZwwJnk0fskxA":{"text":"Tasty blackened mahi with fried pickles. Meal served over rice which paired well with Caju","useful":0,"cool":0},"z5DgnUMujR4DoqdEw4LX-Q":{"text":"Okay, so, I used to Love this place, but as of late, the food's just 'eh.'  \n\nI don't know","useful":2,"cool":0},"kcLSrsZFbnGzJ0h69BUkhw":{"text":"This was our second visit here. Made reservations online for 6. Showed up and immediately ","useful":0,"cool":0},"J1BhIWpDArTL6VfhYVk-PQ":{"text":"I am not a big seafood fan, but I tried a dish that appeared to be shrimp remoulade (don't","useful":0,"cool":0},"qc1-V0KInfYnr2q5bbfPDA":{"text":"We had a group of 8 on a Saturday night. Food was good, plenty of seafood choices. \n\nEvery","useful":0,"cool":0},"n0bUbEUzU0vObp061w2tbQ":{"text":"6:30 table for 5 waited 15 minutes. That was reasonable. While kids menu was ample with 5 ","useful":0,"cool":0},"w2x7t8Y2OqgopC84M0vW6Q":{"text":"Thought it was a tourist trap but the food is amazing and is exactly what you expect for L","useful":0,"cool":0},"Rac4NDWF4p3r6R1yrOD-qQ":{"text":"Love this spot! My catfish & Shrimp etouffee was bomb! My fave restaurant in NOLA. I highl","useful":0,"cool":0},"kGJG61Ydov1RzOs8lm8MAw":{"text":"Outstanding seafood restaurant!  BBQ oysters should be the only appetizer you order.  Slig","useful":0,"cool":0},"WTBzBdtPi-nSNUdto6qYug":{"text":"This was the first restaurant we dined at while in NOLA....we literally arrived at our hot","useful":0,"cool":0},"TD-tQsgVfY9plW7DKZft9g":{"text":"The night we went to Redfish was our first night on Bourbon Street, and admittedly we were","useful":2,"cool":0},"r3V0ZwPC5811yR8t7mov_w":{"text":"I've eaten there on two different trips to New Orleans, and they seem to maintain the same","useful":0,"cool":0},"FOES6pEp5iGqb-wI04KlBw":{"text":"I had been flying in and out of NOLA airport for months, and the sign for the Redfish Gril","useful":0,"cool":0},"VrvmYAJt3zS7Z-nzJzoIAg":{"text":"Happy hour is great. $.50 oysters. Big, delicious, fresh oysters. Buy one-get one free cra","useful":0,"cool":0},"lhyCYkp0E6KynCUN7MrsRg":{"text":"Not quite sure what all the hype is about. Our food was under seasoned (for New Orleans st","useful":1,"cool":0},"k3lBG-o_dLRTjbREWUUSpA":{"text":"The great, the good and the bad. So first off, best oyster happy hour. 50 cent oysters and","useful":0,"cool":0},"e9qu0aFmIJXJs4Am_AevYg":{"text":"First time visiting NoLa. I must have spent hours trying to figure out where to go for din","useful":0,"cool":0},"6MBOylQHJYlFCR_tthB6gQ":{"text":"Our waiter was rude, but the other staff at this restaurant was friendly. Food was delicio","useful":0,"cool":0},"GbJQ0hgdwSP5AVFZUE3l2w":{"text":"This place had an excellent lively atmosphere that was enjoyable to be in with all the coa","useful":0,"cool":0},"xB-qC5dvaOEpwDvF_QEfGQ":{"text":"Even though I appreciated the discount for Armed Forces personnel (I was with my military/","useful":0,"cool":0},"nvNEJ2xVeBIuXx25SYgBaQ":{"text":"I am in NOLA for a conference that my organization is running and this restaurant had been","useful":0,"cool":0},"BSvlk2KVyJaLDFqYScqnGg":{"text":"We had lunch and it was delicious.  Had the crab cakes for appetizer and they could have b","useful":0,"cool":0},"izUl6o9Fx-kYQMUNbgFYLA":{"text":"To start off, I had the soup of the day red beans and Sausage = delicious! I followed it w","useful":0,"cool":0},"x5UNt9uhLMDYF-JqO7aBZg":{"text":"It's a little unfair to review this place, because we just had dessert here (a fact I will","useful":2,"cool":0},"qNE303gzr9veNPKtIZWyjQ":{"text":"Really liked this restaurant.  Great atmosphere and delicious food as well as superior ser","useful":0,"cool":0},"HnHy6Qlj6M4wKYPp9BD-FA":{"text":"Can't imagine anything less than 5 stars.  First - Chris, our waiter, is awesome!  He had ","useful":0,"cool":0},"5YusofoTv0N4DmEuOo4TGQ":{"text":"Grrrrr....How dare they charge $38 dollars for a 4oz piece of fish and serve it cold. And ","useful":0,"cool":0},"qStEhBkL3fBNIdfMgwAs3Q":{"text":"I am not even sure of where to start with how phenomenal the food is here! I guess I will ","useful":0,"cool":1},"erpR7vHPV2DRIslGzhk-pA":{"text":"Part of the Ralph Brennan group, some of New Orleans' restaurant royalty. I had their sign","useful":0,"cool":0},"gUnkt2JafrkNyZM-s2_wYA":{"text":"I had my meal at the bar. Food service from the kitchen was shockingly fast. My gumbo and ","useful":0,"cool":0},"3Hv9DE7L20eFLwSmF6uHtw":{"text":"I will start that our whole party is gluten free which really slimmed down the menu quite ","useful":0,"cool":0},"LzEGvK1Abn3UduWKHJsh6g":{"text":"Lynn our waitress was amazing. Food was great. Catfish blackened etiphae. Wonderful .","useful":0,"cool":0},"ZRiZUBiGH_bQE8nD9QfJow":{"text":"We came in at the Tales of the Cocktail and had a wonderful experience. Everyone was great","useful":0,"cool":0},"9n50gHtNYGJgu10LM8Lu5w":{"text":"We ate here twice when we were in town. Great to have a reservation as the place was packe","useful":0,"cool":0},"xwVPFCqkI7mtD8mrAgIH_g":{"text":"Was really thrilled to eat here based on the reviews...too bad the reviews were wrong.!  O","useful":0,"cool":0},"o4AlJT1HatI0f-ElCCTlBQ":{"text":"This is one of the few places in NOLA that I actually really enjoyed.  A little on the fan","useful":1,"cool":1},"FwSR8j2sN2D4NTh8j71qpw":{"text":"Our meal here was good; all the food was very good but nothing blew me away.  The one thin","useful":0,"cool":0},"mADNLuge4sNSHFqZOr9WIA":{"text":"Over priced, vegetables  were terrible, shrimp were just ok, and crawfish and golden beet ","useful":0,"cool":0},"SV8fZq4s7VW2jKGq9LWATg":{"text":"Great oysters on the half shell. Looking forward to trying the BBQ oysters next time. Alli","useful":0,"cool":0},"6oBga2Xmrhsa8MHIfffm8w":{"text":"Very disappointed with the Red Fish Grill. We expected its prime location to match its din","useful":1,"cool":0},"wxsOXbO07sAb9yiDQYmxBQ":{"text":"I'm actually not sure why this place only has 3.5 stars. My husband and I just got back to","useful":0,"cool":0},"eBcsNqljEPUFmaYkmOeaaA":{"text":"Excelente lugar muy concurrido comida deliciosa pescado con sason única solo no hay música","useful":0,"cool":0},"CtI363AjoSW8k6noOnvXOg":{"text":"Elegant for Bourbon St. Blackened Redfish well spiced, not over powering. Companion descri","useful":0,"cool":0},"rTgQPT71-mFpFw_ftKWskw":{"text":"Redfish Grill Thanksgiving Buffet Pricey \n\nFood as a whole was good, particularly the dish","useful":0,"cool":1},"hhA88VOJPj70JvvqVx58RQ":{"text":"Great service by TJ for our party of 6 late last evening.  Several people ordered apps inc","useful":0,"cool":0},"Ik6f4UgsvXNDgfehFPg38Q":{"text":"I liked it all! First off... The oysters were HEAVENLY! Big and fresh! Get them! \n\nI had t","useful":0,"cool":0},"_NOqi6JqsdSHovpCjXW4Yw":{"text":"Ridiculously good happy hour! $.50 oysters and 2 for 1 beers on Mon/Thurs! Oysters are big","useful":0,"cool":0},"CjFigWHJu4nWgSZOaoXOTg":{"text":"So we have been wanting to eat at Red Fish every time we are here in New Orleans . I regre","useful":0,"cool":0},"QN-CSfpjBmc3h2hQz66XvQ":{"text":"Food was excellent and chocolate bread pudding was divine. The staff was friendly and help","useful":0,"cool":0},"T_df0UsPwXKE3T5Csr59aw":{"text":"I love Brennan's restaurants.  Normally I would rank this restaurant higher because I did ","useful":0,"cool":0},"-vfqsIi6dkDZpxpZW5t04g":{"text":"Amazing bbq oysters and seafood salad. Nice selection of local beers. Always a favorite st","useful":0,"cool":0},"0Al1SglXyfSHmHbI2noFdQ":{"text":"Outstanding Thanksgiving feast.  Truly memorable. Delicious sweet oysters on the half shel","useful":0,"cool":0},"5B0o9t5lrNV7sYg9u5NRdg":{"text":"I'm reviewing their Thanksgiving Buffet. It was absolutely delicious.\n\nHubby, Mom and I ha","useful":0,"cool":0},"2D1TfDp0G7_2B8PgEkzQaQ":{"text":"This place came about by a recommendation from a friend. Overall the meal was good.  We st","useful":0,"cool":0},"gd3Q-YbvUEn_dcyC-lRDdQ":{"text":"Kid friendly and the best service we experienced in NOLA. Gumbo was amazing and everything","useful":0,"cool":0},"iOYi40-JR3__8FmP4quTdg":{"text":"A group of friends and I came here to try the banana double chocolate dessert on the menu ","useful":0,"cool":0},"NwcwK-s6aqiJVdwPUySmXg":{"text":"Probably the best meal we had in New Orleans. Considering we didn't really love the Creole","useful":0,"cool":0},"0TuSsBNFjF-M9W_B69kW_Q":{"text":"Stopped for Happy Hour!\nGreat deal!  Had oysters and beer.  Oysters .75 and beer 3.00.\nBot","useful":0,"cool":0},"xfdp8IASoc_hWkc4Tgzs7Q":{"text":"Started with the BBQ oysters; a-m-a-z-i-n-g. (We went back 2 more times during our trip ju","useful":0,"cool":0},"_3U9g3hlcaiuYcR_mkdiYw":{"text":"Love this place every time we go!  Nice was our server - couldn't have been a better waite","useful":0,"cool":0},"YWpqFMYav3GouMs2jXxMnQ":{"text":"BBQ oysters and crab croquettes very good. Mahi mahi with pumpkin seed relish not so great","useful":0,"cool":0},"xYa0yaeC2YTFZUcODWQTGw":{"text":"We didn't have dinner reservations, so we walked into the first decent-looking restaurant ","useful":0,"cool":0},"rrfmYAkkmAe33cg1-U7ubw":{"text":"Sooo Good.  This place is truly awesome.  The oyster po boy and fish burger are excellent.","useful":1,"cool":0},"Aa9igcH5JZ4A7C55dut6-Q":{"text":"Sat at the bar for drinks and appetizers and have a really great time. \n\nAlligator balls w","useful":0,"cool":0},"s3tpkZewNe0yVJ_SXjNpFA":{"text":"Soso at best probably better for large groups...waiter was great but kitchen confused ever","useful":0,"cool":0},"xJXSeswZFV6ID-bV85wMsQ":{"text":"I'm here for a conference and stopped to have lunch. I ordered the fried fish tacos and I ","useful":0,"cool":0},"OQdvt_03aGkP0mlVsqh27g":{"text":"I've been eating in the French Quarter for 5 days. Gumbo, jambalaya or something Cajun eve","useful":0,"cool":0},"TSYz2i34nJCf0OZ1Trclpw":{"text":"Just ate here for the first time after hearing all the amazing reviews. Well lemme tell ya","useful":1,"cool":0},"VUgtw5b0YhkNLtdKMxj_0g":{"text":"Since we were staying at the Chateau Bourbon, we decided to pay homage to it's interconnec","useful":0,"cool":0},"QLyQ7GqPWxd2egfuiYvtoQ":{"text":"We came here for their oyster happy hour and I just about ate my weight in oysters. The ba","useful":0,"cool":0},"S2mM-2pN7nNdr-GmSc55jw":{"text":"This place hit the spot!! Our server Ike is the sweetest and most attentive!!! Great food ","useful":0,"cool":0},"b04mZeliUIgQnNWS8hh2EQ":{"text":"Came in on a busy Friday night, and the service by Nate, our waiter was great!  Alligator ","useful":0,"cool":0},"mT-AHQVMYZcawz6rjwWtDQ":{"text":"Stuffed artichoke was amazing!  The crawfish were tender and the sauce was  a delicious le","useful":0,"cool":0},"A7mL4BuXFwPw15x_IZvPEg":{"text":"So here I am, all alone in New Orleans and probably the only Greek that doesn't like seafo","useful":0,"cool":0},"HcMEjbw9HHVdeZRoB00_SQ":{"text":"Best Raw oysters out of 4 oyster bars we tried during our 3 Day FoodCation. Freshest Bread","useful":0,"cool":0},"1oZ-6RsZtpQ-4PjebWYNgw":{"text":"If you can handle the smell of Bourbon St. this is a great place for Seafood. I ordered th","useful":0,"cool":0},"8pQoTXxqbpnOPwl_s7sHJw":{"text":"I come every time I'm in NOLA....AndyGator beer is my favorite, Van is an amazing server. ","useful":0,"cool":0},"a9zV2S3NHU8qQ4PsOXNXFg":{"text":"Visiting New Orleans and stopped here for dinner. Was seated quickly at 730pm on a Thursda","useful":0,"cool":0},"FF4H4lKIc-6T6y-UFYRmWw":{"text":"It was pretty good. We enjoyed the atmosphere but I thought the price tag exceeded the qua","useful":0,"cool":0},"-Xcr6hLfRdlPgDqoIChVpQ":{"text":"My hubby and I went here for our last night in New Orleans this past week, on a recommenda","useful":1,"cool":0},"8E_bDUWZ8ehXSWUOhoAkow":{"text":"Best service. Server described the food to perfection. I was from out of town and not fami","useful":0,"cool":0},"ZB2p1v2165fFPdGjczVYvw":{"text":"I came here as part of a party of three and had a chicken jerk salad and the bread pudding","useful":0,"cool":0},"WE-N_6rRdp0dpGhR_rdmUw":{"text":"We tried this restaurant when our other plans fell through. We checked and not much was av","useful":0,"cool":0},"w2utHaV2AtRZXvrfUVsOWA":{"text":"This place is overrated and over priced. The food is ok, not amazing, not horrible, just o","useful":0,"cool":1},"4yFOmwRClFUJYCVv2AGRYQ":{"text":"Since I enjoyed my gnocchi so much last year, we thought it was a good idea to come back h","useful":1,"cool":0},"Y5GPnzFgy8sEdHpzttObvQ":{"text":"Standard tourist restaurant in the Quarter.\nDecent quality, nothing special.\nCorporate men","useful":1,"cool":0},"stYhG93F9smSBvNU1qCT_A":{"text":"Although our table of two was seated very quickly on a Saturday night, I simply was not im","useful":0,"cool":0},"vr7RaMnWZrCa3ellR3VoKA":{"text":"Service was great and food was amazing!!! Was a tourist I found the jumbalya to be very, v","useful":0,"cool":0},"N5caDM1CcwwNQbCK_4M_1A":{"text":"The night I was here it was extremely crowded and\nservice was a bit slow.  My meal was exc","useful":0,"cool":0},"XgNury5c5nH28YFpvS4dDg":{"text":"This place has good food, quick turnover, fun drinks, and unique decor. Fish entrees are s","useful":0,"cool":0},"eExVs0lY1abQRQLuCJuz3Q":{"text":"Stopped for lunch. BBQ fried oyster PO Boy was very tasty. The perfect amount of spicy. Gr","useful":0,"cool":0},"OuDYf-ebSeP9m4Fc5d6VFg":{"text":"Disappointing.  Good service but we ordered all of the signature dishes and they just were","useful":0,"cool":0},"aB_FR87ZJFeaPuxbnni3EQ":{"text":"The grilled fish burger tasted really good. They grind the fish up into a patty. The only ","useful":0,"cool":0},"n2y3_0xgwiTsxeFQhBmHPA":{"text":"The service was very good and the food was awesome! I had the shrimp jambalaya risotto and","useful":0,"cool":0},"wk-DDPT90N2O8UQtFbU59Q":{"text":"The food and service was amazing! I tried the alligator gumbo and the shrimp/crawfish riso","useful":0,"cool":0},"XhDI_K6YLq5DSftmnv2qXA":{"text":"We had a great dinner at Red Fish Grill. The food was excellent but the service was even b","useful":0,"cool":0},"DnL2YiJWDZPPPIRs5TvLgQ":{"text":"Fantastic oysters, huge tasty fresh ones and buffalo wing styled fried ones. The alligator","useful":0,"cool":0},"npuks_E85ZdjbVqkgmQV-A":{"text":"It is in the quarter and caters to large crowds.  The get the food out fast and it is real","useful":0,"cool":1},"2bAAwXAWvec2mrQS09mtug":{"text":"Went here for brunch on the recommendation of the folks at the Ritz Carlton.  First I will","useful":0,"cool":0},"MTnPLmBonNRiX3W3eIeJPA":{"text":"Came here for lunch and enjoyed the meal.  Fast and friendly service and conveniently loca","useful":0,"cool":0},"JTrmnV-ir9ih-sBZPijrzQ":{"text":"Ask for Miriam as your server, she's the best!!  BBQ Oysters as a starter and the swordfis","useful":0,"cool":1},"crZhU-h6Ues6Tm4xkdFvAQ":{"text":"Went to the Red Fish Grill as a big group.  Sat in the Knights of Chaos room.  Service was","useful":0,"cool":1},"4R2GxrxLvmHMQfA_W79xSA":{"text":"Fried oysters are a must! It's the type of restaurant that have dishes for every taste and","useful":0,"cool":0},"RiuqKZuWW9weLyQuyqNrOw":{"text":"AMAZING! We spent a long rainy day in the city and walking down bourbon st we decided to t","useful":0,"cool":0},"R-kLzBLyTOA-TfHTgMEPMw":{"text":"Definitely one of the restaurants you want to visit while in New Orleans.  I had the speck","useful":0,"cool":0},"x_PXB6OSGaBWOWte1cA3Sg":{"text":"This place is more for tourists then a real traditional Cajun restaurant.  However, their ","useful":0,"cool":0},"BTVQUReWJ_WTF60mnoatdg":{"text":"CHOCOLATE BREAD PUDDING...end of story. SO GOOD. best ive had in New Orleans. The food is ","useful":0,"cool":2},"iPjP-etvV5aIkxxXLFL9lA":{"text":"The service was friendly but not that great, as I asked for no carrots and got them anyway","useful":0,"cool":0},"FFHlBD6a3SFFx4oBUl1p9Q":{"text":"Kevin was great. Food is super pricey but the gumbo is great. Also, the Red Fish Grill Lem","useful":0,"cool":0},"OkMwoh2w0SoPphfR0xS8GQ":{"text":"Cool bar and good food, stop in for a drink and some apps!","useful":0,"cool":0},"K-yyRu_u3XPd5qaOSFGwVg":{"text":"Red Fish Grill (RFG) is always our first stop when visiting NOLA, and here is why: RFG is ","useful":0,"cool":0},"FRke8tQHtuGGX9Eu8mRO1A":{"text":"I got food poisoning here last night. The food was really not that good and way, way, way ","useful":0,"cool":0},"IVsusGS3dgVstmPapvt9Iw":{"text":"We loved the vibe here.  So glad we didn't go to bourbon house. The decor was swank, the f","useful":2,"cool":2},"RM9H78ZEZsQqOmrinGmWzw":{"text":"After 6 days in NO and some considerably disappointing and sub-par food, I ventured here. ","useful":0,"cool":0},"-VD8sbE58FBooRmchFFCbA":{"text":"Get the Jambalaya Risotto. And it's the best shrimp I have ever eaten!!  The sauce is not ","useful":0,"cool":0},"RkvqgQPA5skWLGe3dAEdcw":{"text":"This is a hidden gem on Bourbon street.  It is a great bar, with excellent beer selections","useful":0,"cool":0},"ac3Ra3W1JhPTJ0kLfOxaSQ":{"text":"this is definitely one of the best prawns i've ever had!!  i will be coming back on my nex","useful":0,"cool":0},"GfD-TtuHIgsqeYPMK1-ocg":{"text":"First restaurant in NOLA. Husband had the gumbo. I had the BBQ oysters.... Oh yum.... Jasm","useful":0,"cool":0},"qMxE8YUpSyzoWyYJ1vdc4g":{"text":"Fantastic place to have a great dinner in NOLA. My husband and I each had the blueberry sa","useful":0,"cool":0},"VDRxKQszNLhMCk2ZiCZ9Sw":{"text":"We just had appetizers and they were pretty good. Service was not good and why I gave this","useful":0,"cool":0},"xWtBUE2BI83pbbgbrimldg":{"text":"One of my favorite fish is Snapper but the bartender convinced me to try the black drum fi","useful":0,"cool":0},"NSxBM__0Ldy0O2t3iWTf_w":{"text":"I had 2 hairs in my food and they still charged me for my whole meal except for one plate.","useful":0,"cool":0},"8NpW9jfTANtVjVtuJo-a-g":{"text":"We visited during Mardi Gras 2017. This place was amazing. Dinner was so tasty. The servic","useful":0,"cool":0},"zxtS5MEzoLRsoDN2UDBNfw":{"text":"This place was excellent. It's a pretty casual atmosphere with EXCELLENT food. \n\nI got the","useful":0,"cool":0},"id3u8DL6QK0366EAQfcu9Q":{"text":"Very disappointed. The fish was ok. The special bbq oysters were just gross. They were oys","useful":0,"cool":0},"Mhrmayrrn3iggowktFaWAA":{"text":"It's complicated. First a tip...Get the double chocolate bread pudding, with Ice Cream. Wo","useful":0,"cool":0},"-xAlEo6HRPyUgDJMjfkONw":{"text":"The dinner I had here was culinary perfection.  It was a red snapper dish with risotto and","useful":0,"cool":0},"o7F_n4zvDTEfi9xKNxy4KA":{"text":"Service could not be slower. Ten to fifteen to place drink order in bar area...and not tha","useful":0,"cool":0},"HiCc6wJk4jXLYaDUJltDIg":{"text":"Very yummy food, and loved the fresh bread they serve the table. Must try the BBQ oysters,","useful":0,"cool":0},"b4mC6J75hKxgt2zTqv1p8w":{"text":"I will never return to this restaurant again! We booked a large party for dinner at 9pm, a","useful":0,"cool":0},"a6xe76Ex2vQ9At5-V2KzRw":{"text":"It was our first night in New Orleans and we were tired from traveling all day and we just","useful":2,"cool":0},"8hO3oUY8ilrhgVSkiYxs_g":{"text":"Amazing service at the bar. We arrived too early for dinner, so we sat at the bar and had ","useful":0,"cool":0},"5-J9tt2PcEKTQrQlXrH2Bw":{"text":"If you can't do fried green tomatoes right then don't bother doing anything thing. I don't","useful":0,"cool":0},"fSfiAJpsOgJqzISo3LAaCQ":{"text":"Oysters were not well cleaned/prepared or fresh compared to other local restaurants (I was","useful":0,"cool":0},"mPWqiPqHVORI3AlCH_Nhsg":{"text":"Oh we had such a great time! Bbq oysters were delicious! Buffalo sauce with blue cheese cr","useful":0,"cool":0},"x9mMfuv_7F9TyEGglO-YDw":{"text":"Very nice place. Right at the top of bourbon street. Perfect for dining and then walking d","useful":0,"cool":0},"g8am8dWM9wqRZ8oi9XtH1g":{"text":"We had thanksgiving here. The wait staff was super friendly and one guy in a turkey outfit","useful":0,"cool":0},"dG0stOz9nJzfHJFccckaTg":{"text":"I came back the next night for dinner. I had the grouper.  This is the best restaurant on ","useful":0,"cool":0},"e0_GSQVu4ClJz0niJ0rQRg":{"text":"One of the best meals I had on my trip to NOLA.  Had some great BBQ Oysters to start .... ","useful":0,"cool":0},"XBDYNUhKoUa7d4s_5GsS0Q":{"text":"I didn't have a single complaint with this restaurant. For appetizer, our waiter suggested","useful":0,"cool":0},"gYbwGfJkwR8p6uJqE5EFfw":{"text":"Popped in for lunch during a conference. They have a BBQ oyster sandwich they were kind en","useful":0,"cool":0},"sMNgIbc28HSsnw9R3BonEw":{"text":"Very not impressed which was surprising. The rest of the food in Nola was so amazing that ","useful":0,"cool":0},"BvF0nSCAmSsybmXQgS_1IA":{"text":"We had a great meal at the bar - and had excellent service from \"Al.\"  There was a little ","useful":0,"cool":0},"1aYGuM3Yz_dVDeERn5fvXw":{"text":"Excellent food, the BBQ oysters were differentiated a good way never had them that why I w","useful":0,"cool":0},"aOK9XOEqqOeIeGcsYseNBQ":{"text":"I changed my reviews of a few other places I had been in NOLA. The service and food is ama","useful":0,"cool":0},"yobLPcVuql-JPxnaIXs3xQ":{"text":"Incredible food!! The atmosphere was very relaxed and the service was great both times I w","useful":0,"cool":0},"fW4ePBrxX-RbBmRCz-xfsA":{"text":"I was in New Orleans for a conference and my hotel was right next to this place so I had t","useful":0,"cool":0},"-TgQNJutGFoy9ej09lfLBw":{"text":"First stop for lunch to grab some food after settling in at our hotel. \n\nFood was ok, but ","useful":0,"cool":0},"meR2Kq_Q5aTHwWxyG8GxBw":{"text":"A coworker suggested this restaurant and the food was delicious. The service was the best,","useful":0,"cool":0},"YDFYo24KHWyjF9vWCca0DA":{"text":"The BBQed oysters were heavenly, as was the local hickory smoked Red Fish. I also had a do","useful":0,"cool":0},"MGLWYdugq_GLftThWyjtEQ":{"text":"Excellent choice! Great vibe, cool bar,friendly service and delicious...DELICIOUS...food! ","useful":0,"cool":0},"LCdjBEmXctteCOtX_81q6A":{"text":"Sampled several dishes at this restaurant, and all were excellent in terms of freshness an","useful":0,"cool":0},"jP4RqXBft0POJifHN73x8g":{"text":"This is s great place to eat. Very unigue food for the finer palettes but dtill down to ea","useful":0,"cool":0},"bOMz0YwlWcLznn-fmOXLvw":{"text":"Sat down for dinner & was immediately greeted by our server,  Ike. He welcomed us & took t","useful":0,"cool":0},"Gb80P6MfPDGvrDZVhXheRQ":{"text":"This was my favorite meal in New Orleans. Red snapper topped with lump crab and a couple o","useful":1,"cool":0},"MWcqOz74z4jNMtFYQELSvA":{"text":"Grilled BBQ oysters. They are shucked, doused in somethin' spicy, and covered with blue ch","useful":1,"cool":0},"zsaXpcHFalE5g7WebKG9fQ":{"text":"Hubby ordered the signature dish  - red fish with crab meat.  He loved it. I AM NOT a seaf","useful":0,"cool":0},"g_mGWjpyS0QsEpsTEkHVwQ":{"text":"This was the first time for us in New Orleans, and read all the positive reviews that Red ","useful":0,"cool":0},"GFalycE3Ru3W7hCKqIEoBA":{"text":"A little pricey, but worth it!  Excellent crab cake.  The seafood platter appetizer is awe","useful":0,"cool":0},"nANr_rEZCH0VrfBr8H4yhA":{"text":"Nice casual atmosphere and good red fish. I figured that I should order the red fish at re","useful":1,"cool":0},"ev_KERtlz97ne9fytGDWTQ":{"text":"We were hungry and decided to swing by here since it had decent reviews.\n\nThe oysters (raw","useful":0,"cool":0},"wbKeCrEsLnIPMZ1lsPcx2Q":{"text":"This restaurant was attached to the hotel my girlfriend & I were staying at and we stopped","useful":0,"cool":0},"ObwROVG-a6tNVSU_oyYo4Q":{"text":"Just another high priced restaurant with blasé food in the city. Service was excellent but","useful":0,"cool":0},"214XcqOMCYB8ra65GvqNsQ":{"text":"Convenient located at the beginning of Bourbon street, this restaurant will most like attr","useful":0,"cool":0},"F7I1ZIownBQlLiGTg2C2gw":{"text":"Walked in for dinner with a party of seven and were seated promptly - kids menu was a good","useful":0,"cool":0},"6NyabQH3xHfY15fUdQWTqw":{"text":"Great food, great wine, great service. We had a large group and they took great care of us","useful":0,"cool":0},"umn8BwnE5AmP2o4cojEF2A":{"text":"The shrimp creole topped with catfish and the fried green tomatoes topped with crab meat a","useful":0,"cool":0},"fbxE66wCn2_rELMGS7nLdw":{"text":"Tried this out while visiting NOLA in July. Delicious! I ordered the Redfish House special","useful":0,"cool":0},"0KzLCT1_Kfj8bfYTT5IAuA":{"text":"Spectacular. Positioned at the mouth of Bourbon Street.\n\nGreat service. Friendly. Knowledg","useful":2,"cool":0},"7YtzrZm8YRP0kb5-Bj0tCA":{"text":"Red Fish Grill: Burnt not Blackened. Last day in NO and I was really counting on a great m","useful":0,"cool":0},"OU5MdZzVg3eVkl-mW6j24w":{"text":"Pre Hurricane Nate meal on Bourbon with time ticking, we were adamant about going back to ","useful":0,"cool":0},"SVe3g89_HGVxTYlCDeEEBg":{"text":"Just so you know, this is a review of the bread pudding only.\n\nI quickly learned that EVER","useful":0,"cool":0},"W_j-DttAdxNeGiXFYGUKGA":{"text":"Was hesitant at first to eat here was extremely happy we did. The oysters where amazing. G","useful":0,"cool":0},"VbA9a1naT9P_7EUownu-ew":{"text":"Service was great, our server was very friendly and provided us with some good recommendat","useful":0,"cool":0},"e5BPyE3cDn2zSu4LPzUB9Q":{"text":"Overall: While pricey, there's a reason people flock to Red Fish: Good eats and great serv","useful":2,"cool":0},"_5y9X7CsIi5smMWgD1_bEw":{"text":"We stopped in the bar to cool off and have pre dinner appetizers and hit the motherlode wi","useful":1,"cool":0},"yw9Q5FO0oahqfdIuKvqZ_Q":{"text":"Update:  I really wanted to like this place so we went back for dinner, this time had the ","useful":0,"cool":0},"TFsb2SCdMHp1weTzX0zX0Q":{"text":"Absolutely the best Oysters and wonderful Seafood!  The service at the bar by \"Al \" was to","useful":1,"cool":0},"-cWSpJ6HrokxZig-gNu8jw":{"text":"We made reservations and were seated immediately. It's been a while since I've been to a r","useful":6,"cool":4},"kwkcV524WntVcUhB_uRfyw":{"text":"Best jambalaya I've ever had! So creamy and full of chicken, sausage, and shrimp! There's ","useful":0,"cool":0},"GrIy-L84uS4cBhkFi_FGNA":{"text":"My second trip here. Great service even though it's always busy. I had the fried catfish o","useful":0,"cool":0},"tQAAitfyQi74PgLYAnUw6A":{"text":"Service, check. Food, check. Ambiance, eh. Perhaps when you don't have reservation they st","useful":0,"cool":0},"GSKUNX7fO7ICKxQDWcRAFg":{"text":"This place rocks for oysters on the half shell. Great tap beers. Sweet, smooth tasting oys","useful":0,"cool":0},"tXB_ZEkMyGtHikbf6tbR3w":{"text":"Last night was my last night in Louisiana. Today, I fly out to Colorado. One last trip to ","useful":1,"cool":1},"LakLviOHqOtY-y_LGNWnFg":{"text":"The first time I came here, it was 13 years ago. Visiting New Orleans always has the same ","useful":0,"cool":0},"Gms71TkuEncRcd7ld84gsg":{"text":"Made a return trip here tonight....so love this place but even more now after having Ike a","useful":0,"cool":0},"yxSjTC-4kerX5tk4hG0x3A":{"text":"Scrumptious last dinner in NoLa. We were seated quickly and our waiter was extremely atten","useful":0,"cool":0},"8YKLrOSrHcq28jBYJbHTvA":{"text":"I liked this place so much, I went back for oysters and the oyster po boy the next day. Th","useful":2,"cool":0},"ZayfgafhDMdmUHV9PcOxfw":{"text":"Great food, friendly servers, warm atmosphere.  The servings were large and filling. I had","useful":0,"cool":0},"2pwRNct6iEK6yBaB9BLSKg":{"text":"Service was amazing from the time we walked in the door until we leave. We had a party of ","useful":0,"cool":0},"sstFih3CP_D-u-EPHKyGoA":{"text":"Happy hour 3-6. 50 cent oysters are awesome. However service was incredibly slow. Had to w","useful":0,"cool":0},"XLMAInOuZfDP1uz4GDBG1w":{"text":"Great food! Expensive but really worth it for a great date night! Loved the crab cakes and","useful":0,"cool":0},"z-07LZDCuQzr456MhSYkTQ":{"text":"Had lunch on 12/21, the blackened catfish sandwich which came with  the fried red onion ri","useful":1,"cool":1},"4cPFw1K28cu0_AKfWFThQw":{"text":"From the moment we sat down, our server Brianna was wonderful! She made great recommendati","useful":0,"cool":0},"B815aQqZDygTCk5Un7p2lA":{"text":"This is a fun, pretty, semi-upscale place right on Bourbon St. It is a great place to try ","useful":0,"cool":0},"J-MOwo-BVEKRNmAMiPzing":{"text":"This place was awesome, friendly staff. Paul the oyster shucker was awesome and informativ","useful":0,"cool":0},"96BXJmBykQLDZzgUV0Tfng":{"text":"Red fish grill is more of a tourist trap than anything else. We called to make reservation","useful":0,"cool":0},"V7S6iLW5WGv8rz03FahDzg":{"text":"This would have been a 4 star review but I did not think the food was very Cajun in its re","useful":0,"cool":0},"c50__PLHBwl6QF9DkIGrAQ":{"text":"Our waiter, Trey, was high or just really confused while serving us. He was incredibly awk","useful":0,"cool":0},"Ei4AdGlW19eNSjYUuDZwvQ":{"text":"Love it here. Always a great staff and good food. It's not five star food but it's the bes","useful":0,"cool":0},"CFvgfKDoh76LVw7_f2ctjQ":{"text":"The food is absolutely delicious. I had grilled fish and would recommend it without any he","useful":0,"cool":0},"OcEvAMvcflzmQzQkwD5GEg":{"text":"We had a great evening here. The service and food were spectacular! We started with the gu","useful":0,"cool":0},"TikIPSjo2sxMzKVPRO7Bxw":{"text":"Zunächts mal wie oft in USA ein großer, lauter ungemütlicher Raum. Wir bekamen zu zweit ei","useful":0,"cool":0},"go_oiniEpxCtYdgqKypIQQ":{"text":"This place was a godsend on a stuffy July afternoon. \n\nIt's spacious and well-air conditio","useful":0,"cool":0},"nYDQnmOfpMsq3ZPd1dfysw":{"text":"Omg. We just had the bbq oysters and gumbo for lunch. It's unbelievable. Very light on the","useful":0,"cool":0},"dRThcgFvTp4Ajxe7llblEg":{"text":"We ate here on a recent trip to New Orleans. Great food and service. There were four of us","useful":0,"cool":0},"1TpiVMl3TAYrpiN6WnxbWA":{"text":"I'm changing my review from 5 to 2 stars after a horrible experience we had. It was our la","useful":0,"cool":0},"uSfHJ7IwcqFbUK_XbwVoNg":{"text":"We made a reservation so we got seated immediately on a Friday night. The Hurricanes were ","useful":0,"cool":0},"3ldq6eM4YIcB6RlFY6Tu8g":{"text":"My 2nd visit, and it was even better than I remembered.  Excellent gumbo with a dark roux,","useful":0,"cool":0},"gC1J1f3PfGQm01-4TVzgug":{"text":"It was just OK.  The menu was smaller than I wanted. No crab and not many fish options.  T","useful":0,"cool":0},"1yn_ZCuUTKElTXcevkJFJw":{"text":"Red Fish Grill has a lovely atmosphere. The restaurant was busy, but the volume level was ","useful":0,"cool":0},"_bdtlFWY2mpOfisbp-KYWQ":{"text":"Went here our final night after spending the week in New Orleans during hurricane Isaac.  ","useful":0,"cool":0},"Lbm9fyBFRuOYJ6pnAgswZA":{"text":"Stopped in for a quick lite dinner. Great wine selection and atmosphere. \n\nLoved the BBQ o","useful":0,"cool":0},"Y0W2aOrg_wAzSdEiioRqpA":{"text":"I'll start by saying the 4 star rating had nothing to do with the food or service. Both we","useful":1,"cool":0},"xu-tcOAgglmT286DYCsxfw":{"text":"We came here, by accident, but learned it was actually very delicious. Tried the catfish e","useful":0,"cool":0},"D78ayo6Ui8YICuSxSTWvBA":{"text":"Das vegetarische Sandwich sowie der Shrimp Po-Boy waren einfach spitze. Dazu das Ambiente ","useful":0,"cool":0},"lJQp0ntUQoMqn929VJtLsQ":{"text":"The Red Fish Grill was an extraordinary dining experience.  You're right on Bourbon Street","useful":0,"cool":0},"-vbJBzhcJZpW_XqVIuT29Q":{"text":"I came here for a private event and they did a stellar job serving the group. The dinner b","useful":1,"cool":1},"KFwPfJvbFzsCu669UMW2Zw":{"text":"We have never been disappointed at Red Fish Grill.  The food has always been great and the","useful":0,"cool":0},"PZHvXyIzZHwvLsxPdLPEsA":{"text":"A lunch special that includes a giant salad, a hunk of fried chicken exploding with boudin","useful":0,"cool":0},"_sb6FlTTkqcCsB68DL18bw":{"text":"found nothing in this place even remotely acceptable. first, we came in were told that sin","useful":0,"cool":0},"HpJ5ytMCETdmRXuN1pr2qA":{"text":"Not bad for a tourist oriented restaurant on Bourbon Street!  Our waiter was attentive and","useful":0,"cool":0},"VDJiJJ0IPWcIFZ5p8DdGcA":{"text":"I want to preface  my review by stating that I have NEVER posted a negative review on this","useful":4,"cool":1},"1STtuGTZgaGyuu1Y_x1nfA":{"text":"First restaurant in NOLA. Husband had the gumbo. I had the BBQ oysters.... Oh yum.... Jasm","useful":0,"cool":0},"9QtIZK0iyrsBamYIn1UnEQ":{"text":"Raucous environment teeming with folks dining and pre-gaming before venturing down Bourbon","useful":0,"cool":1},"4l6GAtS5w6ccl6Nj5h_XKw":{"text":"Wonderful atmosphere. Great food! The alligator sausage and shrimp gumbo was amazing, and ","useful":0,"cool":0},"fW2mYj_1Y3KvB7ol-XsrGA":{"text":"Boudin cakes, Crawfish Etoufee', outstanding!","useful":0,"cool":0},"8lwN7UAP2SyhPVMvdGAFxg":{"text":"If I could I'd give it a 3.5. It was better than mediocre, but not quite 4 stars. I had th","useful":0,"cool":0},"6AIOqh7VeiURVmy3Y8EeJQ":{"text":"Our food took 45 minutes when it finally got to the table the food\n was cold... The food w","useful":1,"cool":0},"ywWw_X0ZSqZ8tPLmswObOw":{"text":"I had the crispy catfish and it was a getups portion and wonderful...the chocolate bread p","useful":0,"cool":0},"3oDMyw-qPbEaddpOycw4iA":{"text":"Food. Incredible. Best birthday food that I have had ever (50 yrs old today).  Frank was o","useful":0,"cool":0},"jdGUhmj4zA4G2Ujcb9AQZg":{"text":"Incredible!!! FABULOUS service (from the hostesses being happy to reseat us in a more desi","useful":0,"cool":0},"0pNZvLchZQOPiUassBhQtg":{"text":"I stoped in on my way back to the room. After reading all the reviews, I totally wish that","useful":0,"cool":0},"oNLL7A_u_MN3qNMhUk0Fng":{"text":"Right now they have a watermelon lemonade cocktail. Do yourself a favor and try it. It's p","useful":0,"cool":0},"lmlyj2J1l30VQhZQ2KaEWQ":{"text":"Amazing Food! Great service. \nA must if you are visting New Orleans. We made reservation j","useful":1,"cool":0},"4pVCFTvOYV05O4p4bMdTGw":{"text":"I have eaten here twice and both times enjoyed it very much. Service was excellent. Oyster","useful":0,"cool":0},"kWlOMPe9IwDThQeiGULp1w":{"text":"Had dinner here a few years ago. It was a busy night but it was also one of the strangest ","useful":1,"cool":0},"Mcy-s4n8bMfQ2dCVYQ-glg":{"text":"I can only attest to the chocolate bread pudding being AMAZING!! I mean like it will chang","useful":0,"cool":0},"od9wtYIt9rWFSGp7llPi4A":{"text":"Good food (I had their surf and turf gumbo entree) and reasonably good service. Decent win","useful":0,"cool":0},"viE4PyLGfIpexvtZGAbejA":{"text":"We were hungry and ended up going here as I saw alligator gumbo on the menu. The wait was ","useful":0,"cool":0},"PTbBrdZUfQKm0GJ1qzwAQA":{"text":"We were happy to find this place open later than a lot of other restaurants on or near Bou","useful":0,"cool":0},"wYQKWF6U_AoE0ANKctZSWQ":{"text":"We got to our hotel around 9:00pm, all surrounding restaurants were closed, so we hopped i","useful":0,"cool":0},"X-BuUyDOJx3slzYT8cLrqw":{"text":"Dayyumm. I've been to New Orleans now quite a few times having family in Mandeville, but t","useful":0,"cool":0},"aCfHIjNI5t8MpQdV8DLihA":{"text":"Our first night in NO and we were hungry with no reservations.  Everything was packed beca","useful":0,"cool":0},"sGqtpPtEWtwLEfDwz3IMdw":{"text":"Great service and good food. Their bloody mary's are great.\nThe family own a number of res","useful":0,"cool":0},"WzxMKdQ4HQy8sbaIYvA9kw":{"text":"So so food for a high price. Even the house specialty was a disappointment...red fish with","useful":0,"cool":0},"hsWKF2PqOarahwBWsiMBkw":{"text":"DIVINE!!!  The food, the ambiance, and above ALL....the service was EXCELLENT!!  The Wood-","useful":0,"cool":0},"5KScFs5OYBofCMGzK9r09g":{"text":"If New Orleans had a tourist trap this restaurant with I'll take 1st place. The wait was l","useful":0,"cool":0},"1glRHmjEVknIqR7CQTLqNg":{"text":"One of our go-to places in New Orleans! It is located on Bourbon street and takes reservat","useful":1,"cool":1},"9JatTCIaZF6fAEHpNgbSMw":{"text":"This place was recommended by a local and I'm so glad we tried it out -- without a doubt, ","useful":1,"cool":0},"WZYmr7n4kABllfOjQuVd6w":{"text":"Redfish Grill is an amazing touch of class on the otherwise raucous Bourbon Street. Tonigh","useful":1,"cool":0},"P1MwpxU2FuOZUeN6o4-OPw":{"text":"This place had great and very informative service. The waiter was very knowledgeable of th","useful":0,"cool":0},"AuRUSrk0o0t0ZUWlitf1IQ":{"text":"I can't understand why you would give this place anything BUT a 5 star rating.  I went to ","useful":2,"cool":1},"0POItNEwxPIT_FdDBFiLeg":{"text":"Disappointed.  45 minute wait and the wait at the bar was the best part.  Sat us away from","useful":0,"cool":0},"vu55gwKzCqT4cqtfmbVkFg":{"text":"The food here is EXCEPTIONAL!!  I ordered the shrimp and grits and they were amazing.  My ","useful":0,"cool":0},"fbKXHYNbcwfrX6AJxT8v1Q":{"text":"The food and the service was excellent!  I recommend making reservations for this restaura","useful":0,"cool":0},"icXKcO9j4kpHQUu1mnNnFA":{"text":"The pan fried oysters were outstanding. The red fish and crabmeat entree was very well pre","useful":0,"cool":0},"WVhxarQYophnYTjekmCtPg":{"text":"The biggest and best raw oysters I've ever had!  Sit at the bar and get yourself a dozen. ","useful":0,"cool":0},"HadeLKQrNav_GPinNJS8Hg":{"text":"servers are great! but not so much with the food.... i was expecting much higher quality f","useful":0,"cool":0},"Ma5zFtkwTNPSytFWYDdFCQ":{"text":"This restaurant is one I always visit when in New Orleans. I can usually get a table and t","useful":0,"cool":0},"aZXB9PjpluiDyh83lgKCZg":{"text":"I went here for my birthday dinner and overall it was fantastic!\n\nThe BBQ oysters were the","useful":0,"cool":0},"z8GUTjCUW2biC75Uvf3r9A":{"text":"Excellent! Wholly enjoyed the evening. Staff is very polite, attentive and knowledgable. B","useful":0,"cool":1},"DtkylCNgV9PyibAHgNgR1g":{"text":"My wife and I had dinner here recently and everything was very good.  Service was prompt a","useful":0,"cool":0},"s1pQCVelrOzTuuZRMMwnvg":{"text":"When I am in NO I always find my way here. BBQ oysters are great, he'll everything is grea","useful":0,"cool":0},"WCtCDTz722bPXWmEiKAwCw":{"text":"Great dinner!! From the apps to the dessert... all amazing. Only 4 stars because there wer","useful":0,"cool":0},"w5DzkhK_0Voks-T6I_qr0Q":{"text":"Best Steak I've ever eaten was at Redfish, go figure.","useful":1,"cool":0},"9_H3R63zkK6-CIbQhVNzKA":{"text":"Soooo bomb! Red fish plate, oysters, french bread, and bisque was amaaazing.","useful":0,"cool":0},"CFrH3Tzz4LOaXHHy72lMDg":{"text":"Well not much too expect from a restaurant on bourbon street. So expect that it will be to","useful":0,"cool":0},"Po1zUXZQeKDoSZpwTzlIMw":{"text":"Gumbo and the bread pudding was excellent. I had the red fish and crab entree. The red fis","useful":0,"cool":0},"NRKDOQf4-_KihIDNQP19KQ":{"text":"Here for dinner with coworkers.  I had the salmon with Creole mustard sauce.  Server was f","useful":0,"cool":0},"0o04eP8fH9NNIgWj-8nvkQ":{"text":"What a disappointment. !!!!    I called in an order for chocolate bread pudding as this pl","useful":1,"cool":0},"R2WHoM7UICjEmRqcnvSfFQ":{"text":"Loved everything about this restaurant except the noise level. If you are looking for a qu","useful":0,"cool":0},"36Tgv_CjeQHJAgGZyoYQHA":{"text":"This place is perfectly located on Bourbon, but close to Canal.  Although its tough to get","useful":1,"cool":0},"2lPGigCKAWKWV62_ix812A":{"text":"A few days ago I tried the Red Fish Grill for the first time, and I was happy I did. I am ","useful":0,"cool":0},"2FhATnYQxEmlRfp5Kb7iPA":{"text":"Tonight's meal was disappointing. The satsuma salad had no taste. The Cajun oysters were c","useful":0,"cool":0},"tHvN0-_phfnV0I7FB0adWw":{"text":"The oysters are amazing! Service is great, and the food is fantastic. I had the red snappe","useful":0,"cool":0},"gmqdIqBFHM6pRSIP2xnUsw":{"text":"Best red snapper I've ever had.  The redfish was also extremely good. The double chocolate","useful":0,"cool":0},"M9r0OCPjeVKkr4H5O6gImA":{"text":"The service was very good. However the food was not very good. It was cold and it is very ","useful":0,"cool":0},"wicJsV5ciGL08-rLFco_JA":{"text":"Second night at the French quarter hubby and I decided to check out this place and have so","useful":0,"cool":0},"XkhwSfE-bEUxBA-9Quze5w":{"text":"I went here with my husband when we were visiting NOLA a couple weeks ago and we loved it!","useful":0,"cool":0},"69D8P2jmnMgmcmKiwMc0IQ":{"text":"First, Ike, our waiter, could have his own HBO Comedy special.  One of the true characters","useful":0,"cool":1},"OQGSbxDfqjXEDJQGymlK6g":{"text":"BBQ OYSTERS! \n\nWe came in on a Friday night around 8:30 with no wait. This was our first t","useful":1,"cool":0},"Rq96IrKutAIc_HADmvkgbA":{"text":"Hit this place twice, once Friday night and again Saturday night.  It's all the way at the","useful":1,"cool":1},"BqGM_YqI0FFVL5vKIdPjNA":{"text":"When I took a trip to New Orleans last year in June I was excited to eat real southern foo","useful":0,"cool":0},"eS1DZxhBffoLVJutuyM24w":{"text":"Had the Signature dish and was not impressed. Very disappointed, especially when you consi","useful":0,"cool":0},"pttHJoX5NMR6DooM7niihQ":{"text":"Came here on our last night for one last round of oysters!  They were great and the servic","useful":0,"cool":0},"Ahs9eLurlCxdWfKILBiTfg":{"text":"Feels like a tourists spot to me, probably why I was there.  entrees seemed overpriced.  I","useful":1,"cool":0},"oeiUeVuVfC1c3xZUYK-jfA":{"text":"This place was fantastic! BBQ oysters taste more like buffalo oysters but it was still ama","useful":0,"cool":0},"iZz_VUyY7yptxJq5ADLr1g":{"text":"We celebrated my husbands 60th birthday at Red Fish Grill. Cayse, the account manager, was","useful":0,"cool":0},"vCZLQnxFlQ3Z6gbyMDNruw":{"text":"This place is excellent. Service from Ike was amazing. I try to come here at least once ev","useful":0,"cool":0},"KU7PW0Xa3nN9Wlwxo8a2Lg":{"text":"Definitely order the fried oysters and grilled redfish w. crab. The gumbo was good but the","useful":0,"cool":0},"I6jyoX2l1POSHo6dkGdklQ":{"text":"Great service and delish food.they have a great variety of fish dishes and they are amazin","useful":0,"cool":0},"NRutYblJTe_Yn_Ekb0XDuA":{"text":"My first dinner in town and I don't regret it. Even thinking of going there the next day. ","useful":0,"cool":0},"8iFTI8PoJb4qoSarJcGQSw":{"text":"We just finished our dinner at Red Fish Grill. We went on a Thursday evening around 6:00 p","useful":0,"cool":0},"WGT6aZrxfTrD5JcvMRtStg":{"text":"Should've taken the 3.5 star review as my first hint that this place would be sub par. Ord","useful":0,"cool":0},"FoO5m44JxNgf19hYrsr75g":{"text":"Really great restaurant right on Bourbon Street with good service and great food! I had Pa","useful":0,"cool":1},"LlGoTLYAbrnx_TJJzqCg2A":{"text":"I'm so glad some big company picked up the tab for my dinner at this place!  I'd never com","useful":1,"cool":0},"hHPhepr2cPtEwcrVMRJNcA":{"text":"Great meal!  The red fish special was amazing. The fish was cooked perfectly and the lump ","useful":0,"cool":0},"-rS-H66xWt6O1tmv12gQCA":{"text":"This was the most disappointing meal I had during my trip to New Orleans.  I should mentio","useful":0,"cool":0},"jpT5HjLe6dzbmJm1pkxWqA":{"text":"I had been to Red Fish Grill a couple times years ago (like 8-9 years ago) and loved it, s","useful":0,"cool":0},"YO_YzoUYVlbYopeU_IuEog":{"text":"We came here on a recommendation....had no clue what to expect. Did not know it was one of","useful":0,"cool":0},"m-7F63uRBz1Ixwljvy7bOA":{"text":"We started with BBQ oysters that made my husband exclaim 'Oh My Gosh'! We ordered 1/2 doze","useful":0,"cool":0},"EEA8Y_WPe4eP0jKLcvGQuw":{"text":"Sit at the bar, get the Bloody Mary (I think they call it a Wake Up or something like that","useful":0,"cool":0},"oX1wOrtof1eddeSd3i33gg":{"text":"This is a crowded, upscale restaurant located on Bourbon street. It serves tasty, seafood ","useful":0,"cool":0},"gPhHxbbIWSjzpeS9VN7gnw":{"text":"Terrible service. Food was mediocre and the worst drinks I've had in Nola. Our group made ","useful":1,"cool":0},"ccVv_mihAvZIarvtvlN5MA":{"text":"More then one local told me to stop by and eat here. It did not disappoint. Like most of m","useful":0,"cool":0},"w_bj_NB8WyqlVgDqprSO0g":{"text":"Just as amazing as the last time we came 2 years ago. Definitely need to have a reservatio","useful":0,"cool":0},"35Mgw57Qm5jO9p9QfDrnaA":{"text":"Man I don't where to begin. My wife and I like to travel from Austin Texas to the Quarter ","useful":1,"cool":0},"kV4FTAa0zJqa0gtR0MEqXQ":{"text":"Our last dinner in NOLA and our best meal!\nService and food was excellent. Jack, our serve","useful":0,"cool":0},"_CR4M3DzFA2NPKNNChvK5w":{"text":"Food was excellent. However service was a little lax. I ate at the bar thinking it would b","useful":0,"cool":0},"mihvmIHJjAUylMsjFzlNNg":{"text":"Great Red Fish special which they very nicely split for two.  It was blackened red fish se","useful":0,"cool":0},"Lf8nyeaFKIT8ru4AJy47Kg":{"text":"This is a tourist trap in The French Quarter. Food is of poor quality and overpriced. Same","useful":0,"cool":0},"vqFOOc40-kZWkbpteoZzcQ":{"text":"One of those reviews where I'm wishing I could give half-stars. I think this place is more","useful":0,"cool":0},"ucrsKuxns_If_FAhCZbJAw":{"text":"I miss you so dearly red fish grill. I promise to visit you soon, but I've just been a lit","useful":1,"cool":0},"FO9XkyfpIKQDZdvTaULxMw":{"text":"Large conference dinner. They handled it well. Shrimp and Grits were excellent.  Get sever","useful":1,"cool":1},"5tvEiilloBWb1l_jXwNRoQ":{"text":"Had Mangrove Snapper with Rosemary and Worcester sauce.  Outstanding!!! And the atmosphere","useful":0,"cool":0},"cgjuyMI5ZaSs9ynm6K9T8A":{"text":"Was in NO for my sales kickoff, and had lunch at The Redfish Grill.  Wow.  Food was very, ","useful":3,"cool":4},"zDpy5UUZF9zkZTYMcTg-LA":{"text":"Shrimp and grits are amazing! Frog legs were not up to par unfortunately. Great service an","useful":0,"cool":0},"O0FapjmeqmN0NkGOoZw3pg":{"text":"my mom and I stopped here on our cross country road trip and didn't want to leave! we got ","useful":0,"cool":0},"nF9haaUFqishVE_HkHvwuw":{"text":"Friendly staff. Sat at the bar and had an app.  Bartenders were very friendly and attentiv","useful":0,"cool":0},"XMcKG7sj65njurd7b_hBxQ":{"text":"This place was great! Sure it's a bit commercial, but the atmosphere was chill, the food t","useful":0,"cool":0},"-60aeQftQ-jQ9yA_eAU6UA":{"text":"Oh god.  The double chocolate bread pudding.  This is one of the many reasons as to why I ","useful":0,"cool":0},"HE5BSvyIUZ8DEst2_cImdA":{"text":"I can't say this experience was bad but it also wasn't that great. The hurricane was okay ","useful":0,"cool":0},"SRmIKykmAiOeC5K1ajRL5Q":{"text":"We were happy we ordered the bbq oysters with blue cheese dressing, alligator sausage and ","useful":0,"cool":0},"HZVGEawXEgvQfDPzX1PyQg":{"text":"Enjoyed a nice dinner with a large group. The gumbo was excellent and the chocolate bread ","useful":0,"cool":0},"VfrOtKB9pPUafhAZt2Dwfw":{"text":"We sat at the bar and had an early lunch. Good Bloody Mary, and great food. Great location","useful":0,"cool":0},"QgpgmjbFd8ERF--hMyZ6-w":{"text":"Delicious food, superb service and great atmosphere! We arrived during a rush and yet the ","useful":0,"cool":0},"KLZYMZ8vzTAGVdmUEogYaw":{"text":"I really like this place it has great New Orleans charm. The wait staff did an excellent j","useful":0,"cool":0},"ld3lISmQ1lWkxBBaUW-Dfw":{"text":"A work group of 12 or so of us dined here back in March but I walked past this today and d","useful":0,"cool":0},"F1vP5NS_0HO8v5T9DcoHqA":{"text":"Although I once chipped a tooth at this establishment (on a shrimp no less), RFG is a fant","useful":2,"cool":2},"DRsD4_ViorTnl5nWFVp7_A":{"text":"Good food, very loud, good waitstaff.   Waitstaff very attentive and food was very good ha","useful":0,"cool":0},"5tSYxotxBs8GUeCtkEgwDA":{"text":"Food was great and the service great also.  The decor was really cool.  The restaurant is ","useful":0,"cool":0},"WcgWUn4MMb22Z_LS7Du-eg":{"text":"This was our first visit to this place.  We had the sampler appetizer and the blue crab cl","useful":0,"cool":0},"7OyiDHMrbVDBnO-mB7jzvw":{"text":"This place was busy! Made reservations for 730 but still had to wait about thirty minutes.","useful":0,"cool":0},"It_89BH-A2_PE739gpL3hg":{"text":"This was the best food during my 3 days in the big easy. The gumbo with aligator sausage h","useful":0,"cool":0},"6YugTK6HBc9B1yQp8xsRVA":{"text":"Didn't like the chaos of getting a table without reservations, but what can you expect on ","useful":1,"cool":0},"CFIKTgn_t1dnqYKMYuxSVA":{"text":"This is a great place for tourists and visitors with kids. If you have family or friends i","useful":0,"cool":0},"uQZ8QxgyDOoiV8UoxokzoA":{"text":"Wow, what a great place to eat!  Awesome food and super service.  We ate a little of every","useful":0,"cool":0},"LrNkoPTA3rHcoLM3Lhj_9A":{"text":"Best thing about this place is they are open late.  We spent many hours in the quarter and","useful":0,"cool":0},"rD7GPdGUnNUmb7y91ik-1A":{"text":"Okay, the main reason to go here is to eat their BBQ OYSTERS. \n\nA delicious concoction of ","useful":1,"cool":1},"okqIGUL_zRI_i0cgEGKVhw":{"text":"The food was great (BBQ Oysters and Alligator Boudin Balls).  The service very lackluster.","useful":0,"cool":0},"IkTgqk4XgNEUOvy6XMS4KQ":{"text":"Right dab on the south side of Bourbon Street is this A-OK fish restaurant that was a good","useful":0,"cool":0},"F7d3BLZcx2kYmH5qjLBYIw":{"text":"I was in New Orleans for a couple days for a conference and got a recommendation for Red F","useful":0,"cool":1},"_Tw6MB7h7snuvtP1eoybYQ":{"text":"We stumbled upon this place and on a whim went in for dinner. The restaurant is lovely and","useful":0,"cool":0},"YWshySFMy6zfJSo_nYDZLg":{"text":"The place is really cute inside, very unique decor. We ordered mostly seafood of course: R","useful":0,"cool":1},"i4AJO8GOVWgUpECVDl6Sxw":{"text":"Redfish is still the same after all these years and that makes me very, very happy!! \n\nWe ","useful":0,"cool":0},"VMh_V-8SwK6wPB2L3CxKjA":{"text":"Just came for the chocolate bread pudding which we have had in the past. Little disappoint","useful":0,"cool":0},"IZifnf3gHwY7BZB4LYRUBA":{"text":"The food is great. The waiting line is long and it's little laud . Service is very good to","useful":0,"cool":0},"cWVVQvFb0OVLkIfNwdXTew":{"text":"I absolutely loved Red Fish Grill. I am always skeptical of French Quarter restaurants as ","useful":0,"cool":0},"AZ068D1iVrqbwFeyXf2bsg":{"text":"Red Fish is one of my go-to's whenever I'm in NOLA. I usually sit at bar or at a table in ","useful":0,"cool":0},"ap9zxDWyNc-YX3lIC0O9lQ":{"text":"Fantastic restaurant. We were there on a weeknight and still really busy. Their happy hour","useful":0,"cool":0},"Ig03m3HDIlTgSAeQIloxjQ":{"text":"OMG!!!!!!!!! Wow!  This restaurant was located right in our Hotel and I couldn't have been","useful":1,"cool":1},"br1DTphFdwahZ3KYad1yHA":{"text":"Had to hit Bourbon Street & I was hungry! So, this is the first place I walked up to.\nAppe","useful":0,"cool":0},"-NzsR9kl03E_50rgfWtiYw":{"text":"Great deal on 50 cent oysters during Happy Hour as well as two for one drinks. You need to","useful":0,"cool":0},"ovEU0DVtJhM_jEDxHU6cXA":{"text":"Went with friends the evening we arrived in New Orleans.  It was raining, we could walk fr","useful":1,"cool":0},"NnIUqYShzRUExDXDkkzbQg":{"text":"Service is super fast n friendly but the gumbo wasn't that good at all. It was just blah. ","useful":0,"cool":0},"1mFNNdgCqt_XkY1X_Z15Jg":{"text":"How does this place not have more stars? People must be reviewing for the price versus the","useful":1,"cool":0},"vGZBYEjwZW233pFvn3qyNw":{"text":"Here's a situation where being a food snob kills me. Having only two nights I needed to pl","useful":4,"cool":2},"RYJDJivlj--SIjJBGDNkAQ":{"text":"Loud, too big to maintain great quality, and mediocre service to sum it all up.\n\nHad to wa","useful":0,"cool":0},"3m_FSIpX379tJSMnyTBpVw":{"text":"The customer service was exceptional and the food was amazing.   I was looking for shrimp ","useful":0,"cool":0},"K5NDr5mbFq39X2gH39mMOA":{"text":"On one of many hot days in this cool city, stopped by for a quick brunch. Food was great..","useful":0,"cool":0},"bwzhADya0-9iAUFmEkS60A":{"text":"The BBQ oysters were Awesome!  I had the Cajun redfish, it was realy good!! The service wa","useful":0,"cool":0},"rJV_y5GMyxFjVnth8pgQ_A":{"text":"Great service and great food! It's a must visit place! It's good for a romantic evening an","useful":0,"cool":0},"uBAzjHBnWvOPCudTXklazA":{"text":"In NOLA for business and this place is attached to our hotel.  Lunch was so good the first","useful":4,"cool":3},"F4DuW-zrMWsVcmqEoW-bgQ":{"text":"This place gives all the New Orleans vibe you need from the friendly staff to the actual f","useful":0,"cool":0},"X7-JFmW-KRUtf6hZsvtG8A":{"text":"Blah... And boring... And I think I might be sick!\n\nIt's only fair that I start this revie","useful":2,"cool":2},"SYAsrPbmZ_KhNb-v-kzXMw":{"text":"Amazing! Had 17 people with me for my 40th. They accommodated us beautifully. Had a lot of","useful":1,"cool":0},"1njOtChy_Zws7FHUaaYjGA":{"text":"double chocolate bread pudding -- incredibly decadent.\ncoconut shrimp -- really good.\nraw ","useful":0,"cool":0},"BWmiaq-Cpi_03T8V8NCXhg":{"text":"The best thing about this restaurant is the water which I'm happy was free. Ordered a $8 s","useful":0,"cool":0},"T31PT9IA9vkDXE6vU1Suhw":{"text":"Filet mignon was perfectly cooked! Double chocolate bread pudding was to die for! Best eve","useful":1,"cool":1},"ColHsQyDTANBwyAYjs4Y8g":{"text":"If you're a fan of the atmosphere of Chili's, TJ Fridays or Red Robin and tourists taking ","useful":1,"cool":0},"XKMjjL4oCdhC4NdHkxwVkw":{"text":"My boyfriend raved about this place so we went. The gumbo had no flavor, it tasted like si","useful":0,"cool":0},"EKFHXo176OeJRrqZc2vDMw":{"text":"Not a leisurely meal they are good but it's a rushed place. The prices are good but they h","useful":0,"cool":0},"_WxTHhhLRbeDRTecgYXujg":{"text":"Good for family! This is the first time in NOLA with my kids so was looking for good famil","useful":0,"cool":0},"8e1lQenWGoTNgp6DsGKedA":{"text":"The BBQ Oysters were great then the Crawfish boil was awesome. Pair with the Nola Blonde t","useful":0,"cool":0},"nEFdy9CsZssp_rbl8T4K1g":{"text":"My dad liked his meal (mahi mahi).  However My steak tasted frozen and was burnt. The wors","useful":0,"cool":0},"XBrYRuottX-eyFa0onBxvA":{"text":"Off menu vegan dish was superb! Other members of my party also said the food was exception","useful":0,"cool":0},"cyMdGB3PVSmNizQ92evz5g":{"text":"I ate here on Thanksgiving Day for their Thanksgiving buffet. At $32.50 per person, I was ","useful":0,"cool":0},"tU0iQt4nHuTvu3shiDmNlQ":{"text":"From the moment we walked in we enjoyed this place. Fun decor and ambiance. Everyone we en","useful":0,"cool":0},"q7Xs23ZJZmPGyHKNPMcn1Q":{"text":"Very good food. Good wine selection. Seafood charcuttere was amazing. Red fish with crab m","useful":0,"cool":0},"LD_MMEjgZHigsi5Q-bjsGw":{"text":"Delicious!  Go here for sure if you want fresh fish, and i'm not talking the normal fried ","useful":0,"cool":0},"fgBQXnYtT6mMu5XGo11zkA":{"text":"We booked a table for 14 two hours in advance on Nov. 22nd. We were greeted warmly and sea","useful":0,"cool":0},"GPnN6T_xqSb3YvasjrrRvA":{"text":"After all the wonderful things I've heard about the Red Fish Grill, I'm a little less than","useful":1,"cool":0},"Akp87ayMWt_9SOnSrBs_9Q":{"text":"The food was just okay. The BBQ crab claw appetizer was great, but the gumbo didn't have m","useful":0,"cool":0},"RsBiwQM_V0ztnGAUAKewSQ":{"text":"The best part of this restaurant was the barbecued oysters..other than that, it was mostly","useful":0,"cool":0},"mJH_UOJJ1X7_mtPSWEyITQ":{"text":"Great ambience, amazing staff. The food was pretty good. We got a dozen of raw oysters, a ","useful":0,"cool":0},"WlV1GLM7plNglKDDd73A6g":{"text":"Another tourist spot along Bourbon Street but choose this place because they take reservat","useful":0,"cool":0},"UK4SuD9yMP2-xOp_nx7rDA":{"text":"We stopped for lunch and we were amazed at the food quality and excellent service. The upb","useful":0,"cool":0},"YnsYG_45I4DxGjWis52WRg":{"text":"Overall, Red Fish is neither good nor bad but there are better alternatives for most peopl","useful":0,"cool":0},"3y31B6f32Fmn1WQL3twNXQ":{"text":"My husband took the red fish dish, and loved it, but I took a grilled groped fish with veg","useful":0,"cool":0},"XQe_PLseCqM0BrsbO2l1Cg":{"text":"HORRIBLE! Simply horrible. Oysters were gritty and had a lot of dirt in them. Yep, dirt.  ","useful":0,"cool":0},"K-ez3XSxfSvgKSf5is7ayw":{"text":"About two years ago we visited here before a cruise and had dinner on a Friday night. The ","useful":0,"cool":0},"qUvOlO6MxP50eE9_fK759Q":{"text":"This was my first time at Red Fish and it was some of the best food I've had from any rest","useful":0,"cool":0},"h2O7RLstMNN-hd6L2SD2Fg":{"text":"We shared the Alligator boudin balls and BBQ oysters as an appetizer. They were very good.","useful":0,"cool":0},"WsXOrE6QpmNjmnMjCUkojg":{"text":"We arrived in NO, checked into our hotel and went for food.  We picked Red Fish because it","useful":0,"cool":0},"PFTFd-tu68qAcQycEiaIAw":{"text":"We go to New Orleans every year for the marathon and on Sunday night after the race eat di","useful":0,"cool":0},"7dQwBpDywJEQevIsXzbJlA":{"text":"Very nice place. Great food and nice staff. The grilled redfish and the crispy catfish wit","useful":0,"cool":0},"sRzzRNPsHYWPC3IZ4egbbQ":{"text":"Worst service, terrible food, inflated prices, small portions. Foodies beware.","useful":1,"cool":0},"z3pfKomArFm8nAS43aGciQ":{"text":"Just visited NOLA for the first time and this was our first meal there. We started off wit","useful":0,"cool":0},"4SDsh1JbZlTnKxnqbMD3Iw":{"text":"This establishment came with high praises from friends who had been here. We made reservat","useful":0,"cool":0},"FIxEMNGPqezn1e8quUzkGw":{"text":"This restaurant has phenomenal food. We went to the bar for pre-dinner drinks which were g","useful":0,"cool":0},"-BxTNDdRzAksmi7Ul_asHw":{"text":"I eat here when I visit New Orleans. I love the food. Good location. But no parking and it","useful":0,"cool":0},"FQO4cOfq8Zmi7o6PFsM3DA":{"text":"Dans la gamme excellente nourriture à un prix abordable, ce restaurant remporte la palme. ","useful":0,"cool":0},"0WJwG3KpCGpBGPfk7G6FeA":{"text":"We had a great time at dinner last night. Our waiter was phenomenal and the food was delic","useful":1,"cool":0},"Ry5mDqneiq9LtSBTYyPxHw":{"text":"Not very good. \n\nI give this 2 stars but really it should probably be 1. I have a hard tim","useful":0,"cool":0},"sGlx7JgYMos_zWUWqRicQw":{"text":"One word to describe this place....overrated!! Out of 4 entrees only one was worth eating ","useful":0,"cool":0},"kJIjHbqsDwoA1P_MnIKJUQ":{"text":"My family had a reunion in NOLA the 3rd weekend of June 2018 and there were 51 of us. The ","useful":0,"cool":0},"ZvCsQCE3NTOO7S7fxJ29mA":{"text":"Had the barbecue oyster po boy.  Best one I've ever had.  Kelly & Makayla had the blackene","useful":0,"cool":0},"5uoPEDt457tCD8vgW7IkTw":{"text":"While in New Orleans, I tried Oyster po boy at different restaurants. Red Fish Grill had t","useful":0,"cool":0},"Q7vgL3O5MqgGunlzDyhYZQ":{"text":"Red Fish Grill is apart of the Brennan's chain. They're synonymous with NOLA. Right in the","useful":0,"cool":0},"_RK-T23aW0w-mdvCfzxSUg":{"text":"The food in this place its out of this world! I absolutely loved the crystal BBQ oysters w","useful":0,"cool":0},"0J8hy6MSz3axcNe6hKSQYg":{"text":"Definitely a good place to go don't know if I would like to spend $33 on my meal again tha","useful":0,"cool":0},"GjY4aIc6zZlTGYhTPmfLFQ":{"text":"We were strolling around bourbon really wanting some Oysters and possibly dinner.  Its war","useful":1,"cool":0},"bV_vuqw3ZBNaIVUAPOSbGg":{"text":"Although I've only lived in new Orleans for 3 years, I know that trying to have a birthday","useful":1,"cool":1},"MHyjqP05b63mP1tv4_x5kQ":{"text":"Red fish blue fish one fish two fish. Good fish, best dish. One wish eat fish. \n\n\nGreat pl","useful":0,"cool":0},"u-JkiZTcbF9YyTdqSyczZw":{"text":"I did the bar, so I can't really give a review for the restaurant. But Francisco was my ba","useful":0,"cool":0},"bALzy_ifXXiG1FhgiQepKg":{"text":"Place is fairly good. I would not suggest the lump crab on the appetizer menu. Kind of bla","useful":1,"cool":0},"mOgp1d96sXuAUjPIDVqIgw":{"text":"Fabulous fish tacos, barbecue shrimp po boy and........chocolate bread pudding. You have t","useful":0,"cool":0},"WcRXL9KNR9nB8PtnvSnhyQ":{"text":"The Jambalaya was really good. I tried their clams (I think, can't remember since I sort o","useful":2,"cool":2},"zwjnXGLROjBQFtWv44ZrSA":{"text":"LOVE this place.  Greeted at the door by the nicest hostess. We didn't have a reservation ","useful":0,"cool":0},"oHIynluYQ0Auw46GS-TuvA":{"text":"Fantastic redfish burger (ground redfish formed into a patty), much like the tuna burger a","useful":0,"cool":0},"t-kNkE-SfqDnen2w-k8hKQ":{"text":"We love this place - but I have to say that tonight our service was less than good.  The w","useful":0,"cool":0},"b0XAVuoRmXB1T8ZgGvJEfw":{"text":"I moved to NOLA about a year and a half ago and accordingly am at RFG at least a few times","useful":1,"cool":1},"GHNDABGKCDEwj-DL1-z30A":{"text":"Creature of habit... my new favorite dinner in n'orleans.  Filet is awsome","useful":0,"cool":0},"g4Xqno3Mhr8hk0YOZmbwDQ":{"text":"The good:  service was attentive, raw oysters were excellent\nThe bad:  noise level was bey","useful":0,"cool":0},"onxxkzQc-n1QtbfOwBz2NQ":{"text":"Wandered into Redfish on a Wednesday night and had a terrific meal. BBQ oysters were to di","useful":0,"cool":0},"We7TR25JHajz_Fb9XLSVdQ":{"text":"Soooo good!  Boudin Balls and crab claws so incredibly good!!  The fish tacos are great as","useful":0,"cool":0},"zrMMPvgIoLm3vou5yt-Ktg":{"text":"We are locals and going to Bourbon Street for dinner does not appeal to us.  Alas, some of","useful":0,"cool":0},"bnGsbjDmM36KMY_sPTp-0w":{"text":"Decor is casual, and the noise level is a little loud, but the service and food is top not","useful":0,"cool":0},"4JtKxUqwx3z2MvHKLXsp-w":{"text":"Our server CJ was absolutely fantastic!!!  The young man deserves 5 stars for the great jo","useful":0,"cool":0},"NjP4Vf6t9pNjKapSoGJOQQ":{"text":"I was recommended this restaurant by a family member, and I'm encouraging you to go if you","useful":0,"cool":0},"o2eTdQA_5wm5Co1TPwF8xQ":{"text":"I was here once in 2010. The grilled red fish had potatoes in the middle of two fillets. I","useful":0,"cool":0},"jgsUmvJ6x1ZoM_30QsNOkQ":{"text":"To be honest, was expecting the wow factor.  Ordered the signature red fish with lump crab","useful":0,"cool":0},"y-0BZ7J6g-00u_MpeOghmQ":{"text":"I am not that hard on restaurants but when food is over inflated, it's over inflated. The ","useful":0,"cool":0},"X_4kTeib03YfNnqmGAjWZQ":{"text":"We stopped by without reservations and there was an hour wait...so we ate at the bar.  Sta","useful":0,"cool":0},"yFxKVdZpCttbCgXeEb9DUg":{"text":"We hosted a group here before a football game. It was fantastic! Our server, Ike, was amaz","useful":0,"cool":0},"9loH1DVtcDHQYPoC7QnyUg":{"text":"Wow! What a great place! Ambiance, Food and Service was exceptional! Jasmine was superb! W","useful":0,"cool":0},"_UN-Zq54PslhZ1BAxIAMCw":{"text":"I want to say something very, very good about this place....I left my cell phone after a l","useful":0,"cool":0},"a1ob2K5zV4QM3g-Bnyt5qg":{"text":"OMG this place is really great.  \n\nRight on Bourbon St. - really close to out hotel and ot","useful":0,"cool":0},"VM-GkzcnKqHShY4MjYOL_g":{"text":"Food was not that good. My grouper was undercooked (raw) in the middle. Not worth the $120","useful":0,"cool":0},"BhOTY906-1fOLkWQ2fNVjQ":{"text":"We had a great time. The atmosphere was great. Decor was unique. It was very busy but we d","useful":0,"cool":0},"YrKNAP1_fjEYVYsO_jsCxw":{"text":"It was so good the first time but the service the second time wasn't up to par. Good food,","useful":0,"cool":0},"xlkwQ2nCdvEd6c5Ga95IKg":{"text":"Our servers were great, the bbq shrimp and grits were delicious and the Dan Akroyd lemonad","useful":0,"cool":0},"ZLSLk-kXuvi08z-npyyhfQ":{"text":"I've been to NOLA many times, but had never tried Red Fish. My brother recommended them, s","useful":0,"cool":0},"7Wi-QEvAr-dLntodB19T1Q":{"text":"I came here for dinner on a busy Saturday night.  We decided to skip the appetizers and go","useful":0,"cool":0},"wXybKYkjDZlCzZaUi0HWWg":{"text":"Our first night in New Orleans, we decided to grab a quick dinner at the Red Fish Grill.  ","useful":0,"cool":0},"e18GZ1-hu1yT8rAp4QBFPA":{"text":"The food is good . . . but in a city like New Orleans where there's ton of restaurants wit","useful":0,"cool":0},"VgZ6GeOC5UqkIriLvEwPxQ":{"text":"We stopped here for dessert and after dinner drinks on a Tuesday night and the place was m","useful":0,"cool":0},"FOgzUIIbqUER-M5-v0b0Hw":{"text":"We stumbled upon this restaurant by accident and we are so happy we did!  It's right on Bo","useful":0,"cool":0},"SECxdYVEGui8UFbw3vDMXQ":{"text":"From beginning to end our lunch was perfect. Great service from our waitress, Anjel. We ha","useful":0,"cool":0},"YaoczS2R-Nz4nm21aSZHtA":{"text":"It is a decent place but other than bbq oysters everything else is not so good. A place to","useful":0,"cool":0},"FyZeA_xM_oxF5UEDt9q2lQ":{"text":"We ate here on our last night in New Orleans and I'm so glad we did. The service was excel","useful":1,"cool":1},"9AY8K-Obr8EenkyifgD64Q":{"text":"I absolutely loved this restaurant. Great food and drinks.  The peacemaker was excellent. ","useful":0,"cool":0},"DX0Sqnob64lDsm_s53dc-Q":{"text":"Best restaurant I've ever eaten at in New Orleans. So many great varieties of flavor burst","useful":0,"cool":0},"dqmRiTozdXmxHcEoQZpEAg":{"text":"This place was amazing. The bbq crab claws were to die for. The smoked reddish dip was gre","useful":0,"cool":0},"nIVziY-twu_JAHgej5cY0Q":{"text":"The food was decent - seems like you can find better in the area - def a little tourist tr","useful":1,"cool":0},"IMXHOFsh6QKYhFem-ZEbcw":{"text":"Had lunch here over New Years weekend 2018. Food was good, but a bit pricy or else I would","useful":0,"cool":0},"DnCYLf3RYmSYOFmiXD4gVA":{"text":"Mediocre.  The fish was OK, but not memorable.  A large, loud space, good for families wit","useful":0,"cool":0},"CCHunm6AaTK2ZZsr9cWspQ":{"text":"Our server, Craig, was HORRIBLE. He didn't know anything about the menu and kept leaving u","useful":0,"cool":0},"iIzEF1DvzeHDUtIMgvpbUg":{"text":"Warmly Welcomed instantly at the door. Prompt courteous service by Chris' our server with ","useful":0,"cool":0},"kib7NFZ2gB0gLWmEGymCvQ":{"text":"Always great!  The Barbecue Oysters are consistent and super.  Lindsay was my server and w","useful":0,"cool":0},"DK9OWuzG0Likv3NPyp3vEg":{"text":"My favorite is the bbq oysters. At lunch I get the po'boy at dinner the entrée. One of my ","useful":0,"cool":0},"cc7qn7efJWbP2JWVAI3bZA":{"text":"We ate at Redfish grill today for lunch! We had the BBQ crab claws for an appetizer and so","useful":0,"cool":0},"sIltRnNcJVeIyfk8aE9U4w":{"text":"Gumbo was really good. Skip the risotto. Service was great and atmosphere was good. Would ","useful":0,"cool":0},"-2H-vf323n68HLpM50bRzg":{"text":"Great Happy Hour Spot! .50 cent Oysters and 2 for 1 drink specials at the bar. You can't b","useful":0,"cool":0},"X-VIlKSTzSHp_BV9IrOMFA":{"text":"The food was good but not exceptional. I had the whitefish with creole sauce, wanting to t","useful":0,"cool":0},"8Kz5KKMHK67LiBPkv3PSPw":{"text":"We stumbled into Red Fish yesterday. We didn't have a reservation so we sat at the bar and","useful":0,"cool":0},"ITDvfH0F962O7lAGU56lCw":{"text":"Went here for a work lunch and the po-boy was pretty good. The turn off for me was the ser","useful":0,"cool":0},"XaUHM8WyTExm96YhScdtAg":{"text":"We went to many different restaurants while visiting New Orleans and this was by far the o","useful":0,"cool":0},"k6JRBv15vv265qJrTpy0Wg":{"text":"Glad we chose this restaurant   Everything was excellent!! The waiter , Joe, was very know","useful":0,"cool":0},"5YvMNII9aILKqHZBD9xZxA":{"text":"Red Fish Grill seems like a tourist trap along the ever-so-frequented Bourbon and yet amon","useful":2,"cool":2},"5s5oaNzaBWoD2CnHI7fBhw":{"text":"Came here for my boyfriends formal dinner while we were staying in New Orleans and it was ","useful":0,"cool":0},"Z6QUW4BoFo0-W_YLSCERmQ":{"text":"Not much to say about this place...\n\n\nWe were lucky to get a seat here, as we always see i","useful":0,"cool":0},"MCHvH3nEbjSDSaZNl6nTjQ":{"text":"We had a party of 8 (4 adults 4children) we had a reservation which I highly recommend. Ou","useful":0,"cool":0},"PD6iwl6BCb2OZ1IrhqE8hQ":{"text":"Boudin balls and BBQ oysters were the highlight. Skip the Jambalaya and go with a Redfish ","useful":0,"cool":0},"IJYRQpFVH1R6psORd5A49w":{"text":"Wow, who knew this would be so good?  I was walking down Bourbon starving at about 2pm whe","useful":0,"cool":0},"O4eOVqIj_fHC1U5uR2kWBQ":{"text":"A tourist trap. The ceviche had no flavor and had barely any lemon! The fish spices destro","useful":0,"cool":0},"jjyb9-PEuFJjP8Exp_Q1MQ":{"text":"Ike is an amazing waiter! Went here for lunch and had the redfish melt, amazing! Love the ","useful":0,"cool":0},"0uhWwx7i6fuoFn6agsVoVg":{"text":"YUM! We were visiting New Orleans for a country music concert and wanted to grab dinner ah","useful":0,"cool":0},"uGK0eF0Y5dUtoNohslmkyQ":{"text":"5 stars - Our first New Orleans meal was  delicious.  Started in the bar where we each had","useful":0,"cool":0},"6ElCsSfHFripi1oJwRyxEw":{"text":"I had the shrimp and crabmeat Cobb salad with fresh corn, bacon, tomato, avocado, and chee","useful":0,"cool":0},"4fhP1zPYYd66W5K_h1-crQ":{"text":"Dan the shucker is the #1 shucker in the United States. Arnold Palmer and Condi Rice perso","useful":0,"cool":0},"8NJrI4clU82Drw8i3uOP0w":{"text":"I had the grilled yellowfin tuna. It was cooked exactly right. Great location on Bourbon S","useful":0,"cool":0},"nJdB-wdNaQajrcQZwm3HmA":{"text":"I had one of the best meals ever here. The Wood Grilled Redfish was seriously superb. It s","useful":0,"cool":0},"LG2cofDPPPACNsNhfttfVw":{"text":"We ate here on our first night in NOLA, which was rainy and windy.  They conveniently had ","useful":0,"cool":0},"cWReiVM6CTx_lOsAraYQXg":{"text":"Great BBQ oysters, and family friendly.  I doubt that it is a local hang-out.  However, it","useful":0,"cool":0},"q1IRURhPMLAz9AuRSFq83g":{"text":"We went there as a Yelp recommendation and we were not disappointed. Food is awesome only ","useful":0,"cool":0},"fkEz2B_rSQVb8QauD8vcUA":{"text":"This place has a great atmosphere and food. Oysters were delicious and OMG were they large","useful":0,"cool":0},"0PU8rt-U8MDs0qc_nBpvOA":{"text":"The drinks were great and the Red Fish was nicely prepared. The BBQ Oysters are breaded an","useful":0,"cool":0},"TtOLyHMpauP7byrlagnqrg":{"text":"Very good Gulf fish special though a bit rich and salty from the crab. Disappointed with t","useful":0,"cool":0},"pOspY8l2NYF5sZBKB81dNw":{"text":"Deeelicious! Fun!  Stylish and unique ambience!  It's right on world famous Bourbon St.!! ","useful":0,"cool":0},"HaCrNAjjlWCEnxeCotjgJw":{"text":"This was my favorite dinner over my visit to New Orleans! The BBQ oysters are a must. We o","useful":0,"cool":0},"Cw9uapS8rQ_CQ6n0d0_9yw":{"text":"We came here as a couple for lunch.  Last time I was here was exactly 10 years (to the mon","useful":0,"cool":0},"OEL1RhFp6XGWJJ8vU8AczA":{"text":"This place is amazing. All the food we got was great. I will try to post up some of the pi","useful":0,"cool":0},"LjQ8fj2YnvDYnW7yORnq7w":{"text":"Best place for BBQ Oysters. Always great food! Right on Bourbon St, this place is a must t","useful":0,"cool":0},"-GBK2LSVkXcaN0R14uh39w":{"text":"I would come back to Red Fish for the Blackened Avocado alone, but then the rest of my gro","useful":0,"cool":1},"alRo0b4lJ36vFLHpt64U5w":{"text":"So... our bad for trying to eat out on fqf night... soooooooo busy every where. Miss Susan","useful":0,"cool":0},"uDhoL6tUQmACDodsaClldA":{"text":"Went here on a Saturday night at 7:00pm. I was impressed that we walked in and were instan","useful":0,"cool":0},"1gyS7Pf4TmyluywgewTX0w":{"text":"The brunch was very over priced. However, the food was good. Recommend going when u can pi","useful":0,"cool":0},"UCggd6nuOHAfS6eJhxtfFQ":{"text":"The Red Fish and Lump Crab Meat was executed perfectly. The flavors paired well. I also ha","useful":0,"cool":0},"xfhpEx0I08te9Qq-lX7Mnw":{"text":"Oh no - or better yes. Red Fish Grill was recommended by my hotel. I thought: Tourist Trap","useful":0,"cool":0},"MK_QM5sdcT2IXPKozXxAWQ":{"text":"BBQ Oysters - which are really mild Buffalo - are the bomb and the A-1 thing worth orderin","useful":0,"cool":0},"WWnam-IBgXsXy1AqTLCQJQ":{"text":"I thought to myself, what could possibly beat this delicious Mississippi catfish dinner.  ","useful":0,"cool":0},"IUApeB60bwggGvOVV0Ox9Q":{"text":"50 cent oysters in the bar at happy hour and 2 for 5.00 domestic beers! Like!! And Nate wa","useful":0,"cool":0},"xqhGuVgsbwVMVHkExJcS7Q":{"text":"We went here for a Bachelorette party. Seems to be the place to go for large groups, very ","useful":0,"cool":0},"rIhFxAmKe0O5vEAMb78zHg":{"text":"Redfish knocks it out of the park. It's a great place for New Orleans seafood, at a reason","useful":2,"cool":0},"B-0rL2oUlAn4C_2nH93zVQ":{"text":"A very comfortable and civilized local cuisine spot on the edge of the French quarter. Eve","useful":0,"cool":0},"mqSXT4PTzCI0HTOQSfiNPw":{"text":"Red Fish grill is a bit touristy, chain feel--right in the heart of Bourbon.  I made a res","useful":0,"cool":0},"q_IF6XtSjVuC1PrzAj_nmA":{"text":"We were able to get reservations on short notice & so glad we did. The food and service we","useful":0,"cool":0},"iJlEFvn_H87DnSmu5QhqSg":{"text":"Great location.  On Bourbon Street without getting too deep into the mayhem that begins a ","useful":0,"cool":0},"PjOTQwdn9_D6sKL7VbmYKg":{"text":"Ambiance blows, cocktails sweet. The waitress was very nice and did everything perfectly. ","useful":0,"cool":0},"iQE8eSNHIMB2YgWDDcoPvw":{"text":"My mom really wanted to eat here on our trip, and for the first time I realized I can actu","useful":0,"cool":0},"UlPsp7HFbKRVpyJwQqYSqA":{"text":"If you ever get a chance to stop at Red Fish Grill you won't go wrong. The house specialty","useful":1,"cool":1},"O29gqNvV3qlEWPBml6j_og":{"text":"We dined here for New Years Eve dinner and were not disappointed. I recommend the BBQ frie","useful":0,"cool":0},"jxB3Q0ZIuAb-XdozwnHo1Q":{"text":"My review is based on one and one only dessert - the double chocolate bread pudding that w","useful":0,"cool":0},"ddMtJPDU_NHW8DekqfUEMw":{"text":"Mine and my husBAND's favorite restaurant in New Orleans. \n\nWe come in for Mardi Gras ever","useful":1,"cool":0},"5wKBTKOJIeirSXY2v_77zw":{"text":"Great addition to the Brennen's restaurant group!   This upscale casual NOLA restaurant co","useful":1,"cool":1},"9su5t5_CzDS5_N4tJ-0ADg":{"text":"This is loud, disorganized cafeteria with bad service and poor food.\nHaving seen the Yelp ","useful":0,"cool":1},"H7t3nFXkh6QbeKVRPBrR4Q":{"text":"We went to Redfish our first night in New Orleans.  We sat in the bar area in order to get","useful":0,"cool":0},"a8DKoeR-r3xudDqmcTHTJw":{"text":"The BBQ oysters were ok (fried and covered with BBQ sauce)\n\nThe Mississippi catfish was li","useful":0,"cool":0},"PVhiwAsNTpOxLUHCq_AzVg":{"text":"Surprisingly really good!! I didn't have high expectations because it was on bourbon stree","useful":0,"cool":0},"Iwt79BMZnadiuuCTP1hYMA":{"text":"WONDERFUL!  Great food...we had the Crab-cake entree and the Alligator Gumbo - both tasted","useful":0,"cool":0},"T-CrJMy7rgjW3Yd09XiWSA":{"text":"I am giving this place 5 stars based on the bar seating only. We never sat at a table, bec","useful":0,"cool":0},"ghXTkzyQZWhtWn1CHlNz2w":{"text":"Great food and service. Not a broad menu of items and consist of mostly seafood. Excellent","useful":1,"cool":0},"_7En1UA9z19FnjvjC_KNJQ":{"text":"I liked this restaurant a lot!  I had a dozen raw oysters, to start.  Delicious!  Horserad","useful":0,"cool":0},"NP568xCnJA6m49J2ILTjEA":{"text":"I was SUCH a fan of this place when I went.  A friend and I were in town for his first tim","useful":0,"cool":0},"MBZtOYfC_Lq7OFeRr4bVIw":{"text":"The ambiance is casual but friendly.  The noise level is moderate.  The food is very good.","useful":0,"cool":0},"2B-nep8qPGY3DAA_10K2Dw":{"text":"This place was so crowded the night I went.  We got a place at the bar and ended up eating","useful":0,"cool":0},"o5OFwsWhgXgwEtbH3vgluA":{"text":"I was steered to Red Fish Grill by a recommendation when I inquired as to where I could ge","useful":0,"cool":0},"j4crVzkijZ27URzPEl6W-Q":{"text":"Our group of 9 had a reservation for brunch, and when we arrived our table was ready for u","useful":0,"cool":0},"NICME4lSTvV5WFnN3-bdUQ":{"text":"I was worried this would be a tourist trap but the service was excellent, the drinks perfe","useful":0,"cool":0},"rOJbYthcCkxfN8ZSvog-8A":{"text":"Had a late lunch at Red Fish Grill this week.  It was undistinguished at best.  The gumbo ","useful":1,"cool":0},"k6L1AIiEkkNpJZiJUXxorw":{"text":"Nice place for lunch.  The barbque shrimp poboy was giagantic and hot.  The server was gre","useful":1,"cool":0},"oUBdTEhqrT1Rd9upUR1rLQ":{"text":"It wasn't all that its cracked up to be. I lived in the Houston area and the food is 25 ti","useful":0,"cool":0},"Q7i2LRvHgI46_Gr4CBmw7g":{"text":"Hoping the would be better but it was just OK.  Ate here recently before a play at the Sae","useful":0,"cool":0},"LGVOwMwf8mN2i7eeV40kPw":{"text":"Lucky to get New Year's Eve reservations. Fantastic food and great service despite the hol","useful":0,"cool":0},"-5QAkYz4cmkVSb-EpLoiHA":{"text":"Decent food with a pretty good atmosphere at prices you would expect for higher end food. ","useful":0,"cool":0},"Z55chTcmshUO4nz1WDYu2w":{"text":"Two times we went to this restaurant without reservations and due to the wait decided to e","useful":0,"cool":0},"bfHCyJ5ENGy7nPN1eNDaOA":{"text":"This is a solid choice on Bourbon Street. It's casual enough for tourists in shorts, but t","useful":0,"cool":0},"nwOdZ7rHD-vlphzbjbLiMg":{"text":"Alligator Boudin balls were outstanding!  This place had great service and atmosphere.  We","useful":0,"cool":0},"e9cCrdbSVwufi4sRA911rg":{"text":"Oh my. The hotel concierge recommended I visit Red Fish for their double chocolate bread p","useful":2,"cool":1},"7k-2sQDA3qwP7Cz5FJm2lQ":{"text":"Taste: 3\nValue: 2\nService: 4\n\nOf all the places we went to in NOLA, this one ranks at the ","useful":0,"cool":0},"8F-peAcUnL1ioroR5z7ofA":{"text":"Came to this place on a whim and Mr. Stewart made our day!....we had the bbq oysters and s","useful":0,"cool":0},"N2ELc0DmPJFQRzgDm9Q7ow":{"text":"The food is just \"ok\" and my wife and I were both disappointed.  I had the \nALLIGATOR SAUS","useful":0,"cool":0},"fv-Ldca04DuDh-OiTdgJDw":{"text":"If you want to eat at a typical tourist trap restaurant with mediocre food, at best, and a","useful":0,"cool":0},"fFLr4HIUIroP-Y25yYmAsQ":{"text":"The shrimp and fried catfish etouffee was delicious!  Excellent service and food.   We wer","useful":0,"cool":0},"_Fz1qyUYuRHD65nnLgNq1A":{"text":"A few things to know about The Fish. It's a tourist trap and it's R. Brennan's cash cow. W","useful":1,"cool":0},"j5fP52d3s6ZRCCeXcjz15Q":{"text":"Our first really delicious dinner on our New Orleans vacation. Wife had the grilled red fi","useful":0,"cool":0},"PF0alwaM81pTsm9FhM_AxQ":{"text":"Camille was our server and she was great ! Nothing but help and recommendations from her. ","useful":0,"cool":0},"c0OqIdQvIzEeRqNq23jawg":{"text":"Food was great!   Timothy was fantastic.   He was very helpful, made great recommendations","useful":0,"cool":0},"HaZ7C2mjQ55eDhQ1c6m4qg":{"text":"Just a hop skip and  jump from our hotel is the Red Fish Grill  a few blocks of walking..t","useful":1,"cool":0},"6NssyL6ls9N1HDoL3q74Qg":{"text":"Food was great once we received it. We did have a large party of 14, so it took about an h","useful":1,"cool":0},"l3fJbuHcYWhZlzTmzZ954w":{"text":"We saw the ad in Where magazine and then one day, on our way home (at the end of the quart","useful":1,"cool":1},"rTuCmGV8-cnc79z7MpMRsQ":{"text":"We had the red fish and the jambalaya risotto, and they were both delicious.  The ambiance","useful":0,"cool":0},"4AVyYTSGn-yTLP3IxMuwMA":{"text":"I stopped in late afternoon before the full menu was available, but a nice selection of sa","useful":0,"cool":0},"vhDdlJsVPjtKFLodqVRdtg":{"text":"I had an amazing experience with my family at the red fish grill. Our server Dece was very","useful":0,"cool":0},"6krSQMgWokdX6Bx9fejafw":{"text":"I love this place! I ordered a 1/2 dozen oysters, which came out quickly. They were plump,","useful":0,"cool":0},"R1RVw3KCSOGkf4B3_yMpBw":{"text":"Service was good the waiter was nice and talkative, my plate was ok to the point I don't r","useful":0,"cool":0},"eLkR3NxG80liDnvj-XhWIQ":{"text":"Food was absolutely excellent. We had the following: gumbo with alligator sausage (the bes","useful":1,"cool":0},"9jf08apCMyyO_pVv5C8zDw":{"text":"Went for lunch.  Great service.  The gumbo was excellent.   Shrimp po boy had lots of shri","useful":0,"cool":0},"EGVqnyE1meAqRwZzZBn_Qw":{"text":"Very good restaurant. Very friendly staff, great atmosphere and wonderful food. The grille","useful":0,"cool":0},"OphAmY8vlnxhAo2PEG3kow":{"text":"I went here last summer with some friends who were in town for a conference.  We were less","useful":0,"cool":0},"fBf1kNVMlPVBXJkw9U8SWg":{"text":"I was attending a conference with some co-workers, one of whom lived in the NOLA area for ","useful":1,"cool":0},"pPc8ohTWOQTg8qy3MHYeDA":{"text":"After seeing such positive reviews of this place and in particular the BBQ oyster po-boy I","useful":2,"cool":1},"MPHTOY4RaJD6zynUA_gkKw":{"text":"Nate, the bartender was awesome! Good food and Good Scotch! Highly recommend for you, wife","useful":0,"cool":0},"b1eV64MYp6EHo1LcATsYQg":{"text":"Red Fish Grill  offers a lovely dining experience. From the colorful details throughout th","useful":0,"cool":0},"DQjQ1fOpSp4rGK50WJL_PQ":{"text":"Last night in N ORLEANS. Tried the Red Fish Grill on Bourbon St.  Close to the festivities","useful":0,"cool":0},"YjemBfTeMPat5qCMt2E2wA":{"text":"I have been here several times. Red fish never let me down. Oyster plater is so good","useful":0,"cool":0},"ETn4v2BASjSoUpIfTbto9g":{"text":"Wonderful dining experience from start to finish. Hostess was pleasant and welcoming. Our ","useful":0,"cool":0},"IgK23dxaJGAN1wRcaZ1OFw":{"text":"We have eaten here several times before but tonight we had the BBQ oysters and the chocola","useful":0,"cool":0},"Ny70w-BLpXXTkgMWvxzrlg":{"text":"TOURIST TRAP QUALITY FOOD\nYikes -- so many fantastic restaurants in New Orleans and then w","useful":0,"cool":0},"vUNBgQxPFLuogVZjwEaRZg":{"text":"Nomnomnomnom... I came here after seeing the ridiculous line at Felix's. I snagged a seat ","useful":7,"cool":6},"JH5tnffuICy0lTJoPDwu7w":{"text":"We came in without known what an amazing meal we were about to eat. The fried chicken was ","useful":0,"cool":0},"-Hx4KcNy2O84jCwh-NZ8DQ":{"text":"Returned to New Orleans 3 years later.  Remembered I had a pretty good meal at the Red Fis","useful":1,"cool":0},"xLNExtYh98UJSEDw0C61EA":{"text":"Frank and nick were our very attentive servers.   I am pretty particular about service and","useful":0,"cool":0},"kylJ2qcH8NsmCfy8dJoqKg":{"text":"This place was recommended to us and after checking it out online we figured we'd give it ","useful":0,"cool":0},"Yl9qgoehQUGXdmAqFLygXw":{"text":"I stayed in New Orleans for 5 days and ate out every meal.  This was truly the worst dinin","useful":3,"cool":0},"tvUrirrJg4DSjdulRVXRtw":{"text":"This place was awesome. We were served by Thuy and Michael (very attentive). They made EXC","useful":0,"cool":0},"2FbSTGIukoevEyJOmYJzzQ":{"text":"We saw Charmaine Neville's performance at Snug Harbor and she mentioned some local places ","useful":0,"cool":0},"XwS1-HB4ambzpjy4UP-qfQ":{"text":"I love New Orleans, I think it's a great city but the unfortunate thing (for me) is that a","useful":0,"cool":0},"Kc528rics6H-qH3ztcJ40g":{"text":"Based on food 4.5 star setting lowered it to a 4 super busy loud but the lack of ambience ","useful":0,"cool":0},"FfSb92sQ4mh5o1qDi0xv2A":{"text":"I was not impressed by this restaurant. \nFood was mediocre. My fried green tomatoes came o","useful":7,"cool":3},"7RpYh_UealSN62fbWaKVJA":{"text":"Had such an amazing dinner here last night. It was crazy attempting to get a table but it ","useful":0,"cool":0},"wzWaiUALe1493NUaFXIkOQ":{"text":"This restaurant was amazing! The food was delicious and it was served shortly after we ord","useful":0,"cool":0},"7wxXLTtORz0IMtqyjALRnQ":{"text":"Ate here this week with a pretty large group. It's a nice, though loud, place for a dinner","useful":0,"cool":0},"QTlqvMmkvITcTVPxDr2c8A":{"text":"Excellent food indeed. I had the BBQ oysters which were very nice and the redfish and crab","useful":0,"cool":0},"Hx_zBJoYdlVUmD02e-7t-A":{"text":"I asked the server about a signature drink or popular drink and her response was, \"they ar","useful":1,"cool":1},"0VMpw7Xi-d08wVMRxbDOCA":{"text":"Came here for lunch as soon as we got into New Orleans. This is my second trip to Nola and","useful":0,"cool":0},"B1zyOQ7Tn5UhA2Iwx3l_VQ":{"text":"Located on Bourbon St, I had the initial impression that this place was going to be non-au","useful":3,"cool":4},"w5kkLE6oxaZlQK8caLIXNQ":{"text":"For my birthday and the first time on bourbon street this place did not let me down.  The ","useful":0,"cool":1},"n2n1zFSpdaat2u750EXTEQ":{"text":"Enjoyed my dinner at the Red Fish Grill. Good seafood in a nice but casual atmosphere.\n\nOu","useful":0,"cool":0},"t6ViOqpStmpF2NdlLNLBCw":{"text":"We had swordfish and etouffee both were without seasoning. Not What l was hoping for. Shri","useful":0,"cool":0},"fS4ncwOVZKlnm235uckMYQ":{"text":"I highly recommend this place because it's not as pricey as Emeril's or Deanie's and the s","useful":0,"cool":0},"Xbkng6mmLjv0lPSpAEcxxA":{"text":"Service and atmosphere was fantastic. Andre our server helped us make some excellent choic","useful":0,"cool":0},"WbBBIV6zq2xDIcFyVdSaFQ":{"text":"The rest of my family really liked this place. The BBQ oysters and shrimp were ok but were","useful":0,"cool":0},"nwc1JuvAvAyTwlYC-Qmyuw":{"text":"This restaurant is very good! \n\nI had the Mississippi Catfish & Cajun Creole. This was pro","useful":0,"cool":0},"5lVx7FEq2Grlt7AD0ng6Cw":{"text":"Our server Sonya was spectacular!  The Hurricane hurt me!  Loved it!  Bread and butter wer","useful":0,"cool":0},"7gKIITos8gCW4gBcoRjxaQ":{"text":"Stayed in Hyatt above this restaurant in Oct.  Finally tried it. Bought $200 gift card fro","useful":0,"cool":0},"9Q3voKTeq3NPR51FT8XlsA":{"text":"NOLA was crowded and most of the hot spots were booked.  Concierge recommended this place ","useful":0,"cool":0},"0NPijhVTeLCDUzpEEf-WEA":{"text":"Good seafood, despite being a tourist trap down in the Quarter.","useful":0,"cool":0},"-7mB2RmGwpkow6MM4eDkJg":{"text":"Stayed in New Orleans for 5 days and ate here 2x for dinner and once for happy hour.  One ","useful":0,"cool":0},"zX4FE3cd5eDARODIz8kkdg":{"text":"Came here on a Tuesday night and to my surprise this place was packed! We put our name in ","useful":0,"cool":0},"9T52SDqhJU4C_yOKhBNMKw":{"text":"If, after a long day of strolling around in the New Orleans heat, you'd rather skip a big ","useful":0,"cool":0},"xOSFaqcKoet4ilcIBuX_qQ":{"text":"Had the bbq oysters and gumbo.  The food was great and so was the service.  I'd recommend ","useful":0,"cool":0},"5lqEx57en4IrptvTXn90Qw":{"text":"Great food! Great wine! Great waiter Tim! A New Orleans must! Better than most on Bourbon ","useful":0,"cool":0},"wtakl1KYZfLhAMExBHvp5g":{"text":"A coworker gave me the heads up too try Red Fish and it was good! I had the fried chicken(","useful":0,"cool":0},"2sV4LV-rPj5ZZro8aYoUnQ":{"text":"This was the first place we ate in New Orleans. It sits on Bourbon Street and you walk in ","useful":0,"cool":0},"KXp2bRAiBBKikRj3IPmMLQ":{"text":"I know I am crazy to order a filet in a seafood restaurant but it was awesome.  Very tende","useful":0,"cool":0},"tuRc1sGCkrMhY2E_E-oTVA":{"text":"Certainly a nice place for a meal with friends or a group while strolling on Bourbon Stree","useful":0,"cool":0},"V_0DyTAa5HIore9-1IPJhg":{"text":"I visited their other restaurant in downtown disney and ended up writing a complaint lette","useful":0,"cool":0},"LCU2ht1tAlvjc1VnxEJTUA":{"text":"Mouthwatering seafood!  The chocolate bread pudding desert was orgasmic. Ike, our waiter, ","useful":0,"cool":0},"abh9JgZgN9gX2PDhT8jnFg":{"text":"5* the Wood Grilled Redfish with crab is AMAZING. I highly recommend it. We also had Smore","useful":0,"cool":0},"M8SPirxg5VcGdNZX7QKoeg":{"text":"I love the fact that they bring out a complimentary loaf of Louisiana style french bread a","useful":1,"cool":1},"JyOftSecWQYj76w_xBM2Jg":{"text":"I never miss Red Fish when I am in town. Even if it is just for the BBQ oysters or the dev","useful":0,"cool":0},"nPlwUhcIZNv-PQ7DMMUaDg":{"text":"RedFish is the *only* dining establishment actually *on* Bourbon St. that is any good (tha","useful":2,"cool":1},"-B0g7e26doyr6O3oyyqmfQ":{"text":"We did not wait for a seat. I liked the salad w/lettuce and Stilton cheese. For dinner I h","useful":0,"cool":0},"2VAf7yexbI-B4CfLV9Kkeg":{"text":"Excellent service by Jayme. She recommended a delicious entree (Wood Grilled Redfish and L","useful":0,"cool":0},"uKUnBwppbYRVKOcbdPHFHA":{"text":"Entrees seemed a little on the pricey side. Had BBQ Oysters - which were just alright. Not","useful":1,"cool":1},"RQt5nVgul1FsPldIAQURWg":{"text":"I'm not a huge seafood fan and can't take any \"fishiness\" in my food.  I was recommended t","useful":0,"cool":0},"wlSYp_nryKIx60ZJ9YpZMQ":{"text":"Great place!  My boyfriend and I visited this restaurant while on vacation in New Orleans.","useful":0,"cool":0},"kaUmCWOPGUjgfzVC1-fwvg":{"text":"Excellent southern food, and Very good atmosphere.., I don't eat pork so we were limited w","useful":0,"cool":0},"6s-Z4jpdSzJ9UbKg0s7a4Q":{"text":"I'm a huge seafood guy and Red Fish Grill is wonderful.  I lived in NOLA as a kid & attend","useful":0,"cool":0},"PIkgK9O-bCRsHK80ydGDfA":{"text":"I honestly don't get it. This restaurant is terrible, and yet I has an almost perfect rati","useful":1,"cool":0},"x0bdXkAmk2Rr6jG1TdWwHg":{"text":"Over priced small portions and average taste there are way better options closer by!!!!","useful":0,"cool":0},"Zw4m0jksO7BquHuH6QpM-w":{"text":"Red Fish was awasing! If you looking to try some local flavored food, then Red Fish is you","useful":0,"cool":0},"jWnlMKHAASyFf1kvKhfuWg":{"text":"Had a great dining experience here. It started with our waiter Jeffrey who made us feel li","useful":0,"cool":0},"x64cYjY92oENFIe740zfgg":{"text":"Ordered fried shrimp po boy...very good!   The potato salad was some of the best I've ever","useful":0,"cool":0},"jL5SBOn05zRTBvx5D11SDQ":{"text":"Last dinner in New Orleans and it was a nice surprise. I had been craving a fried whole fi","useful":0,"cool":0},"Gr8GW84v8uitLtKqfqAWTA":{"text":"I ate here last nite and considered this my best meal in my last 2 weeks in Louisiana.  I ","useful":0,"cool":0},"dzkE87mO-CYVMJtcQvu9Hw":{"text":"Dined her on a Wednesday evening around 9:00 for a late dinner.  We had no wait. Our waite","useful":0,"cool":0},"LMEGE0J-HboOiiId93KWRA":{"text":"Just stopped for some appetizers. One of the better and cleaner restaurants on bourbon str","useful":0,"cool":0},"D9n8ku6cZZBKKYSEq1uwBw":{"text":"Love the shrimp salad and the blue crab claws!! Chaz our server friendly helpful and fast!","useful":0,"cool":0},"2Ybgewz1M3n8kVo0anNjXw":{"text":"Went for a birthday celebration and all was fantastic until the end of night when the \"man","useful":0,"cool":0},"-rnAqM5vw42LEuoQBds09A":{"text":"Great food, great service, and atmosphere.  What's not to love?  Surf 'n' turf gumbo is ex","useful":0,"cool":0},"S7Qemd0bRpZK_MdjtacvYA":{"text":"I had this spot on my hit list while visiting the area.  I arrived late on a Friday with o","useful":10,"cool":4},"mzt6NoJn5vj5b7tnv8tsPA":{"text":"Restaurant was very busy but luckily we had reservations and we had a great dinner. We had","useful":0,"cool":0},"65I1IFqTHG2BPNIYNuxClw":{"text":"Worst dining experience I've ever had.  \n\nEverything was wrong from terrible service, over","useful":1,"cool":1},"yg_1PUPj3FtLYbEDyyaAhw":{"text":"\"Whole Fish\" is always my go to dish when on the menu and Red Fish has an amazing one.  Pe","useful":0,"cool":0},"zwWBTk8RuR2Z3vb5DWwXnQ":{"text":"So I wasn't impressed at all, we had a bit of a wait (2hours) however it was in part to a ","useful":0,"cool":0},"ouW4d1IFVsRWDJIXOGIvEA":{"text":"Where's the other half or 3/4 of my cast iron seared redfish? I'm not joking. I'm still hu","useful":2,"cool":0},"4p6RsSUeL3j5TXbmlGyyAA":{"text":"Great food and fantastic service.  The double chocolate bread pudding is a must!","useful":0,"cool":0},"_6o2-W8cFmo8xa7Gc1B6hA":{"text":"BBQ shrimp was amazing.  Made it my meal instead of an appetizer. Po boy surf and turf was","useful":0,"cool":0},"KgMAPqLlgzcVfxq4BADIHw":{"text":"We ate dinner there on Saturday night. You need to know that even if you make a reservatio","useful":0,"cool":0},"zFl4a00meVXhS53JLZW2eA":{"text":"Some of the best service I've ever had. I never had to ask for a drink refill, the bartend","useful":0,"cool":0},"ZOscgF9Wn6_x0uBjvA6xiw":{"text":"Possibly one of the greatest meals I've had in years.. I took the waiters recommendation a","useful":0,"cool":0},"N20o9jhz7oGUk7g0syOC0g":{"text":"The fillet is amazing!  I grill filets and have been told by many that I make the best the","useful":0,"cool":0},"pjehWP-Axu7DhXRF2K9-oQ":{"text":"The Red Fish Grill is known for its charm and elegance.  I really wanted to try some of th","useful":2,"cool":2},"tIr7mVVdW7muocyn0y0jKg":{"text":"Everything we had was Delicious! The Cat 5 Hurricane & fig old fashioned we tasty. The oys","useful":0,"cool":0},"E2RGEMgBVweNPkVXvJ-wHQ":{"text":"Well, I tried it again.\n\nWent with some friends and was severely disappointed yet again. T","useful":0,"cool":0},"19sb3nhTjtKjRDevbThj1g":{"text":"It wasn't great, it wasn't bad either.  Red Fish Grill fits solidly in my \"meh\" category. ","useful":0,"cool":0},"SFtCLnWfEwxei4LusT6I5Q":{"text":"With the final day of our Semi-Annual Sales Meeting completes we decided to come here.\n\nOu","useful":1,"cool":1},"KJpkeLD5kBZZXoRUKx3K-w":{"text":"Impeccable service! Excellent food! We thank Ben the waiter for letting us know where to g","useful":0,"cool":0},"PUuujtr-ywMVGbAIQVdlrg":{"text":"Went to Red Fish Grill last night.  Made reservation several weeks ago for 14 people.  Got","useful":0,"cool":0},"E5EmzDJd-isoG7a1bya5pA":{"text":"Just fair...had the Shrimp creole jambalaya.  Not too spicy, the shrimp were overcooked, t","useful":0,"cool":0},"5uQlo8-aToEaSRUD9WJn0A":{"text":"We were looking for traditional Cajun food and happened on this place - and glad we did! I","useful":0,"cool":0},"Tms3bApC1izf3eu7u7W5Vw":{"text":"My husband and I went here for couple of friend's recommendation,  and it was great.  The ","useful":1,"cool":0},"HslnRI-WerWksmDp0OPxuA":{"text":"Amazing food and desserts. Go for the entrees. Blackend fish was a new menu item and was a","useful":0,"cool":0},"CnrzJqo1-0sM2t1XisA0ww":{"text":"I got the redfish meal, which was pretty good, and the hurricane, which was a disappointme","useful":0,"cool":0},"D_9RVFjopYX1YBpndojFRw":{"text":"The bbq oysters were awesome!! Also, the redfish with lump crabmeat was insanely delicious","useful":0,"cool":0},"_CkmOTjrJBXH5TDfQIhBRg":{"text":"Service was good. Temperature was hit and miss. Some things hot others kind of cold. I did","useful":0,"cool":0},"DUkpGmeJIqT16fajrQ7SCQ":{"text":"There is not much in the way of dessert shops in the French Quarter, which makes sense sin","useful":6,"cool":2},"NtEqU8k0tEjMrYf_o1aIyw":{"text":"I came here for a quick lunch and sat at the bar.  I ordered only one thing I wanted to tr","useful":11,"cool":11},"M55E4gOiBxtUgDZmIfhjmg":{"text":"Been here every time I've visited (which is 3).  Food and service are always top notch.  S","useful":0,"cool":0},"_FOAXoXB74a1G-zfN4CulA":{"text":"Red Fish Grill is a decent choice for dinner, especially on Bourbon street where many of t","useful":1,"cool":0},"i6G70EdeVDwrHRz6bA4Vqw":{"text":"My friends and I had reservations for tomorrow and we called to switch the time and the ma","useful":0,"cool":0},"ZCflnpTcNBt5z6bNYDQAGg":{"text":"Edit:  i told the manager my experience. He said it is their policy to pull the bill from ","useful":0,"cool":0},"I-VsWljlWDpv5W1VI2BOaA":{"text":"What would a trip to New Orleans be without eating at a touristy Bourbon Street place? I'v","useful":0,"cool":0},"mVHPhr6eODP6Ch5BL4DgDw":{"text":"Touristy, loud, and mediocre.   If prefer red lobster over this place.   The menu sounds g","useful":0,"cool":0},"dpjvVWFEQZjlCWNwZyUlcw":{"text":"Our server was very attentive and had a great personality. Wanted to eat the whole menu. S","useful":0,"cool":1},"Hb60mHAVwqP7oCxBEik9fQ":{"text":"New Orleans - it's a paradise for Cajun food . Everything almost I ate in NOLA , tasted am","useful":1,"cool":1},"kE1RFV9MnBDuMtXcDkZBSg":{"text":"Great Valentine's Menu!\n\nSo we just happen to be here the week of Vday and Mardi Gras and ","useful":1,"cool":1},"A0HJmdhvdfTMQ2138pZb5Q":{"text":"A group of us went there for dinner and the place was accommodating to a large group. Wait","useful":0,"cool":0},"rIZGuCY5wvb8xGMvagSTLQ":{"text":"I have to say, some of the best service we received was at this restaurant. I highly recom","useful":0,"cool":0},"h1bUZY8e0btxrKAhrUNSgA":{"text":"This has been by far the worst restaurant experience I have had. I came here with my famil","useful":0,"cool":1},"F0T5yN1uKEnbgb6Bn2Kr-Q":{"text":"Friendly server. Ordered a dozen oysters and most of them were gigantic. I'm used to place","useful":0,"cool":0},"TbSXi2McKLNlzBw4cgL7Kw":{"text":"Wow. So good. Can you go wrong in New Orleans? BBQ oysters. Great cocktails. Sauteed gulf ","useful":0,"cool":0},"7YmmX0KdnM8dETB7Hj3a0A":{"text":"First of all, our waitress Rebecca, was amazing. Rebecca had a firm grasp of the menu and ","useful":0,"cool":0},"_wH_wDTS-wFPRWKIV-xaow":{"text":"My Alligator and Seafood Gumbo was absolutely delicious and perfectly spiced and savory. I","useful":0,"cool":0},"YRa0CuEVBncFkB7Xt_H-DA":{"text":"Had the softshell po'boy for lunch.  As good or better than Acme.  The sides were a little","useful":0,"cool":0},"upekWIeDjivmqr7U24nMLw":{"text":"Had Alligator Boudin Balls and the BBQ / Blue Cheese Oysters and both were simply amazing.","useful":0,"cool":0},"nJYa0iVKrrSm-cVGMyGf6A":{"text":"Wow!! This place had some of the best food in New Orleans! The Red fish grilled offered a ","useful":1,"cool":0},"DAOO1em3ad5USTwAfHEVnA":{"text":"Every bite was amazing! Had catfish etoufee; my niece enjoyed shrimp and grits; and my hus","useful":0,"cool":0},"7yrVmID6w3UBC-7qmOkNpg":{"text":"We ate here on a Saturday night and it was busy. It was the first restaurant we ate at in ","useful":0,"cool":0},"1vgdrcgqwvlHQcutUv2V7w":{"text":"This place was goooood! 8:15 last Friday, we'd made a reservation and the place was busy. ","useful":1,"cool":2},"3rqDFyIZ8paX_etnTr7bPw":{"text":"Great food and atmosphere in the French quarter for seafood.  We had dinner there and were","useful":0,"cool":0},"jZrU-JdDsxwFK_SNH-BvMQ":{"text":"We just sat down for dinner, but already decide this is not a place we'll ever visit again","useful":0,"cool":0},"QJpsUf1fdLBddPSJX5OtJA":{"text":"I love this place. Had 2017 Thanksgiving dinner here last year which was an amazing spread","useful":0,"cool":0},"3BmMs_z8xb7kENNiso5uQw":{"text":"I go here for the BBQ oysters. Best I've ever had and I can't get them anywhere else. At l","useful":0,"cool":0},"NXL8cTRluA_F_SV55c1P3g":{"text":"Had dinner last night here.....wine selections were average and over priced.  Red fish was","useful":0,"cool":0},"18BylhhX0AACPNWxuf08hg":{"text":"Excellent service. I have never been disappointed with this place. The food is always rema","useful":0,"cool":0},"0Aw-AZVkMUcA8ZG_ucUA3g":{"text":"It's a tourist restaurant. If you're looking for something special in the French Quarter, ","useful":0,"cool":0},"Vm2QGidOsrLeB2LY5ddwUQ":{"text":"Great food, great atmosphere, great service.  I had swordfish, which was fantastic with th","useful":0,"cool":0},"Rs4Rn0nMHCNU3xCAcBEo2A":{"text":"What a cool space. Really cleverly, groovily decorated, lots of folks having fun. We were ","useful":0,"cool":0},"l7sKwM3z_0KlgbPkFL-Etw":{"text":"A very classy place on Bourbon Street with a great menu selection. Our server Frank was be","useful":2,"cool":1},"rXYAIQUh9ubjG2-a_RAcgg":{"text":"Absolutely. Hands down. The best fish I've ever had, and I live on a lake. It cooked to pe","useful":0,"cool":1},"vWxOGWbNPEFEX_DUzzaYSg":{"text":"My aunt and I popped in here for a few drinks and so she could teach me how to taste scotc","useful":2,"cool":2},"YowxSpF0yTIGTHn8tq-i3w":{"text":"This our favorite place in New Orleans, especially for their happy hour Monday through Thu","useful":0,"cool":2},"JlbFcnnMhphOp2bQoxu_nw":{"text":"Excellent red snapper and don't leave without trying the chocolate bread pudding desert.  ","useful":1,"cool":0},"x5OOOrGNiWAeevDIjgsf1Q":{"text":"Amazing food, and hope you're lucky enough to to get Ike as a server. All around great exp","useful":0,"cool":0},"0IuggKmfA5KWsaqprkIJfQ":{"text":"I used to love this place, but it's really disappointing now. It took a half hour to get s","useful":0,"cool":0},"9GTUyjfWJzZM1611o1Kjqw":{"text":"I've been here for different functions and occasions and have yet to have a bad meal or se","useful":0,"cool":0},"b_JsygVAjjVr6MeH4Gr88A":{"text":"Went to this place based off of the recommendations of a friend...\n\nAppetizer of BBQ Oyste","useful":0,"cool":0},"XpY5Do4G3Ke2PiNJEt8lyw":{"text":"Enjoyed a great dinner on a very busy Friday night! Love the fresh bread in the bag with b","useful":0,"cool":0},"L3cpMoxYYuBhAPiH3VYmVg":{"text":"Service was great but the food was a disappointment. The vegetables served with the whole ","useful":0,"cool":0},"cx6I2xpnkeDaCBu_OOVQig":{"text":"If you want to experience chocolate heaven, you must try The Red Fish Grill's Double Choco","useful":1,"cool":0},"PcYYR5Vt9LiaViGjEoMTyw":{"text":"We came here for lunch and we're looking for real NO cuisine. Outstanding place. Great Po-","useful":0,"cool":0},"l1jKV7M4e6eDci9d_tZd6Q":{"text":"This was our first trip to NOLA and I was looking forward to the food.  Red Fish Grill did","useful":0,"cool":0},"SyX-pO1mS7i_OabLCidWyw":{"text":"This is our third visit to Redfish in the past month and at this point I think I can say w","useful":0,"cool":0},"1NUaz0FELJsnq556c8P6ww":{"text":"Food - 4.5 Stars\nService -5+ Stars\nAtmosphere - 4 Stars\n\nHave zero complaints. Andrew was ","useful":0,"cool":0},"L_YWUPKtluEebcxbmu6bCQ":{"text":"Perfect dinner at Red Fish Grill! The best raw oysters we had all week in New Orleans. Nic","useful":0,"cool":0},"s4vk9FIDJB9swFJyS7U-oA":{"text":"Before flying into town, I made reservations for Redfish Grill. I love this place!\n\nOrdere","useful":3,"cool":0},"dbi-fedV-vNE7bjqv8HNlA":{"text":"Very nice ambiance, tasty food. The salmon is fabulous and wine selection is pretty broad.","useful":0,"cool":0},"5DqGleBYj64ya03S3SQA6g":{"text":"Love amazing, fresh oysters?? You guys! Come here!! My fiancée and I were craving fresh oy","useful":0,"cool":0},"7mnObnFBOb2IYb0wnXoj7Q":{"text":"Ate the house favorite red fish covered with crab meat and a lemon butter sauce. It was ex","useful":0,"cool":0},"8hg1OhGSHhfSQ-M9u-sa7g":{"text":"This restaurant has proven to be everything I needed and more on bourbon street!! If you c","useful":0,"cool":0},"biiKrNidPjbeEh-M9y2hxA":{"text":"We were seated right away when we came on a weeknight. The food was delicious, service was","useful":0,"cool":0},"ibGyjy2TNckcV4LR05TJbQ":{"text":"Been here twice in the last 48 hours and may stop in again for the food & service combo. \n","useful":0,"cool":0},"4l4BCWSJ-fEPhCn1lwZFlQ":{"text":"Even though it's in a touristy area, they have a good selection of food. The place is alwa","useful":2,"cool":2},"MAxxf08RhyGsnwpYXn6PiA":{"text":"Let me start off by saying this place is excellent. The bbq oysters, the gator bite drink,","useful":0,"cool":0},"UxiJI7YbZ3-lVT1CT4e9_w":{"text":"Red Fish Grill was a perfect little oasis from the hustle & bustle of Bourbon Street! We e","useful":0,"cool":0},"IC3zT0KJ2Z5rju0WEnxkHQ":{"text":"So far, one of the best meals we've had in NOLA. Highly recommend. The bread pudding was Y","useful":0,"cool":0},"qi7cehwK6XRg7PZ7fWJ7Ew":{"text":"Food good, service was ok.  Took a very long time for our food to come out and the server ","useful":0,"cool":0},"mthPQtDzbebu8M6EwCvDuw":{"text":"We had a wonderful meal. We started off with some fried green tomatoes, which were good, b","useful":0,"cool":0},"YmojgEnIcLRCBJkUII17CQ":{"text":"This is our second visit to Red Fish Grill as we were impressed with the food and service ","useful":0,"cool":0},"himrLQ7LUJsUI5BZrARv0g":{"text":"I had the red snapper & it was done to perfection. My table shared the chocolate bread pud","useful":0,"cool":0},"TLo8Bym_jOGD0Hyq_tqb_Q":{"text":"This place was recommended to me by a gentleman from Galatoire's after I learned there was","useful":0,"cool":0},"5C8JwUO2gaLf66bnUgKxUg":{"text":"Customer service was great! Our waiter took great care of us. The place was very busy and ","useful":0,"cool":0},"yc8SzSIC6491GhtxzYxpvQ":{"text":"Albeit, I wasn't exactly the most sober upon arrival to Red Fish Grill but doesn't mean I ","useful":3,"cool":2},"UEC0VgVnUhvq8aj1SFh6VA":{"text":"THE RED FISH IS SO DRY. I don't know how the please is called red fish grill and the fish ","useful":0,"cool":0},"_Eu4FDdWKUfyXIe09MhGmw":{"text":"Great first night in New Orleans to experience the creole cuisine and fresh fish that this","useful":0,"cool":0},"fHoX1vPNLMCYgbQHKACK6w":{"text":"The food here was really tasty- we started with crab cakes and the bbq oysters.  The crab ","useful":0,"cool":0},"NJkZosmcgrV7uateYUjYMA":{"text":"We ate her twice during our trip. The bbq oysters are to die for. Can't wait to come back ","useful":0,"cool":0},"Ur6Lvq_Vsn2vkbZt2q35gg":{"text":"So I was on vacation in New Orleans with my parents and my dad insisted on going to this r","useful":1,"cool":0},"5CNLiwm_x7ubHeuNTwkh8g":{"text":"Went to Red Fish while at a convention in New Orleans.  We stood waiting for a table for o","useful":0,"cool":0},"kbj6H-TnxyvY82aVsBmSlA":{"text":"Another solid New Orleans restaurant. Like most, I would reservations because the wait can","useful":2,"cool":2},"XNJmr9alfVt2yTO1m8f1mA":{"text":"Whenever we are in NOLA we always set aside a night for Red Fish. Never disappointed. Adam","useful":0,"cool":0},"sHAihPofnbtDILVjfK7gTg":{"text":"Although this wasn't the most elegant or highly rated of the restaurants we tried in NO, o","useful":1,"cool":0},"Bl8E6L4JWfqWba7Zl-if1Q":{"text":"Our large group wandered in here on our first night for dinner. What a great surprise! The","useful":0,"cool":0},"n4tTCIPGqQk4VH0LEJelrA":{"text":"BBQ oysters are awesome.  Was really hungover and ordered the wagyu burger for lunch in ho","useful":0,"cool":0},"PBR0fgow0jM8bAcMUPld6g":{"text":"So we had a long day and looked on Open Table to see where we could get in.  Had no idea i","useful":0,"cool":0},"bcQuiguqSw2T92iWs_2ljA":{"text":"My daughter and I were starving and incredibly saddened by the lines that waited outside o","useful":0,"cool":0},"Q2dHZSPboaxu2ZM6QFjfNg":{"text":"I chose RFG because of reviews and the ability to get a reservation through opentable.   W","useful":1,"cool":0},"mbDJrP5JhwFftYBWF81GPg":{"text":"During my stay in New Orleans my hotel recommended  Red Fish Grill. When I called to make ","useful":0,"cool":0},"D3oOVGOSeUA6RgMpIDQk7w":{"text":"Stopped at Red Fish Grill while walking in humid and hot Bourbon street.  The AC was blast","useful":0,"cool":0},"P7h6irokNRZBCOePFlOCvQ":{"text":"Not very hungry but needed a little something something.  So started with the famous bbq o","useful":0,"cool":0},"nJBoeq0iuYSNEqJZtE8gmg":{"text":"Worth a visit! Might not be the most authentic southern food you will get but the fried oy","useful":0,"cool":0},"7-rZ3Ro47BgM6ECVE1srYQ":{"text":"Had a great lunch there last weekend!\nFood delicious  and the service was exceptional !!! ","useful":0,"cool":0},"8f15CkNh70xtfHWBk06h6Q":{"text":"First time visit to the Red Fish Grill. With that in mind I opted for the \"Red Fish\" of co","useful":0,"cool":0},"mnvd1iqujIiXxUaZ2ffEkg":{"text":"Service here was great.  Great food recommendations and prices.  There wasn't a line which","useful":0,"cool":1},"GKRSaqsqVCZH11n1knOyPw":{"text":"Oh my where do i start??  Oh yeah i lucked upon an early open reservation on open table si","useful":0,"cool":0},"q9Kur0Xs7ZHwqZ25zS5nNA":{"text":"Crazy Bernie and Tammy the Tornado ate their way thru NO and it started with the Red Fish.","useful":1,"cool":1},"2b6ykXZRe80K5fHpcDws1Q":{"text":"We had excellent service here, but, the Food is substandard.  The bread and butter were go","useful":0,"cool":0},"LOa4nzSBhkMPOqoohDM3XQ":{"text":"The food here was good. I'm actually reviewing the chocolate bread pudding. I NEVER liked ","useful":1,"cool":0},"-i005AUOUTO9fdHYnRPTJw":{"text":"Excellent service and food (as expected).   Not much on the menu for the non-seafood eater","useful":0,"cool":0},"PlJdHKD4TykoV1CAvON-oA":{"text":"The poor boy came out cold, so I asked if it was supposed to be a cold or hot sandwich. Th","useful":0,"cool":0},"msLEJk0sNGi0CglNGTP1fg":{"text":"After a more than disappointing experience across the street (Bourbon House), we booked a ","useful":0,"cool":0},"RmQOQnz9vl6CWJfrBTnENA":{"text":"Well worth the high menu prices.  Excellent menu, variety of unique cocktails, and friendl","useful":0,"cool":0},"ie2dr9wBu9U4JtODmQKxkQ":{"text":"They have their menu outside so you can view prior to coming inside which was really neat ","useful":0,"cool":0},"9OJxk4o6WjxD8psqqiFOcw":{"text":"Had one of my favorite meals here while on vacation last week....the redfish with crawfish","useful":0,"cool":0},"yvZiE9T4KajsYXa3Whe7ZA":{"text":"Come try catfish and crawfish etouffee. Service is great! Bread and butter is great starte","useful":0,"cool":0},"dTdP8opT8z93_1z8ah-LFQ":{"text":"Andre was da man! He was a very engaging server. The food was phenomenal. We had the wood ","useful":0,"cool":0},"3VthJbng3SnhIh69txvNfw":{"text":"I went here for dinner during our last night in New Orleans.  We were early for our reserv","useful":0,"cool":0},"bx1q2Z6OweD5AFxE9yjW4A":{"text":"Where do I start?\n\nAppetizer: order the BBQ Oysters and nothing else... AMAZING \n\nENTREES:","useful":1,"cool":1},"ZZ-5A8QHw4NGySP0tvFR9Q":{"text":"Best food we have had in New Orleans. Service was excellent, food was superb. Definitely y","useful":0,"cool":0},"nGjtsRx8qPPJz-8R-LA3qg":{"text":"Wow! Amazing. 5 star services all around from seating me down as quickly as possible and a","useful":0,"cool":0},"tzweY5HIW11gHI8SQGWrgA":{"text":"The service was horrible .We ordered  a dozen raw oysters for appetizer and the server bro","useful":0,"cool":0},"_PBVKe8cpc6XR_j-yVEhpQ":{"text":"Great food, great drinks, great atmosphere. It gives you the perfect time to sit down and ","useful":0,"cool":0},"V4NKcCJZz4smhLxW-G6arw":{"text":"The grilled Redfish with crab meat was excellent!  The bbq crab claws were different, just","useful":0,"cool":0},"PtBITVZyicBMOcn98TgThQ":{"text":"I was reading the Yelp reviews about the location, it's within the first block of the Fren","useful":0,"cool":1},"YGnV9ctlz5TCclNrz34liQ":{"text":"Stopped into Red Fish when we were in NOLA in February.  The restaurant wait was 2 hours s","useful":0,"cool":0},"ouEBDxW8XLqkTe8ax-kG6g":{"text":"Visiting NOLA I always love to try good eats at places I rarely visit. The ambiance at Red","useful":0,"cool":0},"qzi-t15hjHbxro07XynsEw":{"text":"The service was fast. Oysters were fresh and the cocktail sauce was just right. Our red fi","useful":0,"cool":0},"eRj1woToZPd5VwR8L1Dr6A":{"text":"You will love this restaurant! Ask for Ike, he's the best server in the city! Great servic","useful":0,"cool":0},"YnF1eA7GkYiys689BXGtZg":{"text":"We had a family of 5 and got a table right away. The service was good and our food was all","useful":0,"cool":0},"4xw0wR7y-cekSfe8gJzEUg":{"text":"I am in NO several times a year and always enjoy Red Fish Grill, especially the BBQ oyster","useful":1,"cool":0},"zucMucHJ6sR2BAIbqntL8w":{"text":"Had the mistaken idea that restaurants on or near Bourbon Street not the best so only book","useful":0,"cool":0},"wriSGtxT1qafO7Qd2vXf-g":{"text":"Best fish I had in New Orleans.  Dessert was one of the best I've ever eaten anywhere!!  S","useful":0,"cool":0},"GzCPPYB5oi4Hs5wCsld0tw":{"text":"Me and wife went here for our lastnight dinner  and it was good but the service was top no","useful":0,"cool":0},"whrHz417nh922PeGhozO_Q":{"text":"Best smoked fish.  They offer 10 fresh fishes every day, served smoked with your choice of","useful":0,"cool":0},"g3pWstbEYfz4pEvTalATug":{"text":"This place is incredible.We had the peacemaker,  boudin balls,gumbo redfish and shrimp and","useful":0,"cool":0},"wFqP2fseHJ0Eh5VJ7HIQZA":{"text":"Our party of four sat at the bar and were promptly taken care of. We sampled the alligator","useful":0,"cool":0},"wHpyr2vbN-funEpQAI3S7Q":{"text":"Someone recommended the bbq oysters and boy did they not disappoint! We had a dozen of tho","useful":0,"cool":0},"gSHvJcMpZVYo2VHPiwkNAg":{"text":"I got the signature redfish dish. The dish was aesthetically appealing, boasting a base of","useful":0,"cool":0},"jLEI1DXSCf47Uh82H3qjxw":{"text":"This was an outstanding experience! I just can't say enough about the food and the service","useful":0,"cool":0},"04XUWQ3ek0ex9S_vEO3WNg":{"text":"This restaurant was actually part of the Hyatt where we stayed (as well as the Hard Rock- ","useful":0,"cool":0},"g3aGHI7mIUee2TW9sWjzqw":{"text":"My risotto was very oily and over cooked. I have been physically ill since eating there Su","useful":0,"cool":0},"__D2O0rONg0_6TWraSFdTg":{"text":"The BBQ oysters are a must. The staff is so much fun and helpful when it comes to recommen","useful":0,"cool":0},"0ztYTIbxjSVPwnTaeAiovA":{"text":"Red Fish Grill is a casual, colorful restaurant with interesting artwork that give it a bi","useful":10,"cool":10},"xA7i_y_ED83gxUKF8P_5iw":{"text":"Running through the cooking show \"Chopped\" on our DVR just before heading out to New Orlea","useful":0,"cool":0},"bVf-jC7prACtNZyYFQLYdg":{"text":"Our server, Jonathan, made the dinner most enjoyable.  He was very attentive and made me f","useful":0,"cool":0},"-npIzEpPIZ5ugBinHvErrQ":{"text":"We walked in at 6pm on a Monday night, got seated right away and everyone was so nice.  Th","useful":0,"cool":0},"8mwb8WD_SGiExlg3eDgj_A":{"text":"The food was great, the service was top notch. I had the BBQ chicken. It was cooked just r","useful":0,"cool":0},"DY_WVnCsWVJmSi5oe0giWw":{"text":"The food was bland but the service great.  We stopped in for a late night meal, ordered th","useful":0,"cool":0},"n5yLhpyRW5AGVwaK7MX5OQ":{"text":"Food was absolutely wonderful in this place and the customer service was great  A really n","useful":1,"cool":1},"_9v2nQeFL1nejjJZYCQQlA":{"text":"Sonia was our waitress.  We had a tartar appetizer and then red fish for two of us and swo","useful":0,"cool":0},"tEcRyxBJunTCEGCxtgvzmw":{"text":"Oysters was tasty ordered 4 dozens, fast service, mix drinks was tasty, I arrived at happy","useful":0,"cool":0},"HTfHoDtfeuVfFTEL24C8Kw":{"text":"This was the single best food experience we had in New Orleans this trip. We came during h","useful":0,"cool":0},"7TlNQ8chn3hcXC1fq_iyOw":{"text":"Excellent! Love this place. Dark but food is really tasty! Portion size is reasonable. I b","useful":0,"cool":0},"ubXy3pJDwgpk7WgknqwVzw":{"text":"Excellent dining experience! Our server Ike was phenomenal - I felt like he gave us the tr","useful":0,"cool":0},"YSCuXScMMO43ypXiORJLpA":{"text":"The food was delicious in this authentic restaurant on Burbon Street. A brass band playing","useful":0,"cool":0},"1geN5Txw8DWFRR7qqt7_jg":{"text":"Great food at good prices for New Orleans! Recommend the gumbo, peel n eat shrimp, boudin ","useful":1,"cool":0},"p6ajaBbdZnFnynR8dRCEHA":{"text":"What a great restaurant for fresh local options. The BBQ was delicious, but don't let the ","useful":0,"cool":0},"FBUwaE5kTQ0BYg1utKR9eQ":{"text":"Adorable this restaurant! You need to get the BBQ oysters! Drinks were fabulous, fish was ","useful":0,"cool":0},"NoAY3pQ7qJBCFAEV0F4R9A":{"text":"James provided exceptional service!  Thank you so much James for an incredible dinner and ","useful":0,"cool":0},"rUwcw2ek-MOvaeJlvl4OSQ":{"text":"Let me just start by saying Believe The Hype!! The BBQ oysters are THAT good!! You can com","useful":1,"cool":1},"cBvGyxJsIJYZ0bGkvbK0EA":{"text":"We were looking for a fun, yummy place to eat dinner on our first night in New Orleans. Re","useful":0,"cool":0},"YRKTfFmVFDjdJ0ko4-M8zQ":{"text":"Great staff  ( like the idea of 2 servers for the table), good food and willing to change ","useful":0,"cool":0},"cORpoVfrP2SIAUQINZE24w":{"text":"Omg. Food flavored well. Awesome service!!! Patrick was an amazing server. Truly had a fab","useful":0,"cool":0},"P3up7pjKD3ZF1J9_SbRziQ":{"text":"So to keep this short and sweet--YES. Yes to the BBQ oysters & shrimp. I don't even like o","useful":0,"cool":0},"UjyFY2RVUkD5bKCnLl0mxg":{"text":"Pretty good - but this is one of those NOLA restaurants that caters mostly to tourists. I'","useful":0,"cool":0},"zcSA91dLvoDKlxXgjG6NyA":{"text":"The BBQ po boy is phenomenal, honestly might be the best thing I ever had. The alligator s","useful":0,"cool":0},"CsaJI_D4AOBZfFzqPkrj1Q":{"text":"We had a wonderful meal of seafood at Ralph Brennan's Red Fish Grill in 2017 so we made su","useful":0,"cool":0},"JBjgGnyTa89NaWP4NmayIQ":{"text":"It was my first time in New Orleans and I only had one night in town. This place was recom","useful":0,"cool":0},"KCcLtuV-IXttRH6_hsfHLQ":{"text":"Had a fantastic lunch here!!  Great food and service!!!  Very interesting decor as well. R","useful":0,"cool":0},"CxLZSoeYNfwd0vx9LF9-mQ":{"text":"My visit here was mediocre. For appetizers, my wife and I ordered BBQ Oysters (basically b","useful":0,"cool":0},"Gwd_hvL8BVp-6TcWganm6g":{"text":"What a treat here in New Orleans!  There's a reason it's voted Best Seafood four years in ","useful":0,"cool":0},"_kgci6eDArDQKrupLBoTcQ":{"text":"This restaurant was accommodating for our large group with no reservation. Absolutely fant","useful":0,"cool":0},"32_jGNu7qLXWSoDD5q5OyQ":{"text":"Hands down the best poboy I have ever had! I'm a native New Orleanian so I have had my sha","useful":0,"cool":0},"0BUZVY8sW-qh-HFO6Xqskw":{"text":"On a visit to New Orleans I met a friend at Red Fish Grill and experienced an amazing even","useful":0,"cool":0},"ujVTYZOjaWALo_d4Y7asGw":{"text":"We certainly enjoyed our time, and yes, we know it's a Bourbon Street establishment rather","useful":1,"cool":1},"J9NBRD6EzsjL_NR6I13IuQ":{"text":"Omg, please go try their BBQ oysters! One of the most delicious things I've ever eaten! It","useful":0,"cool":0},"12O6fJPmQbGe3N-BwnHd4g":{"text":"Well, I wen there alone and felt very comfortable. I'm going to edit this post when I get ","useful":0,"cool":0},"x3BHQ6kUCsBga0MSqW4b8Q":{"text":"Sooooooo\n\nI tried the red fish topped with delicate crab meat and I will be very honest wi","useful":2,"cool":0},"1331JDc3AqTUe77rUTiF0w":{"text":"It is clean, the atmoshphere is nice and the wait staff pleasant - but that is the end of ","useful":0,"cool":0},"jVd90EwgccXsdlqhprCPtw":{"text":"This restaurant is fabulous. Our service was excellent. Server Dawn was extraordinarily an","useful":0,"cool":0},"6FhWA51sZTboSzdThNysrA":{"text":"Everything was delicious EVERYTHING I ATE !!! Jalapeño corn bread was awesome... first tim","useful":1,"cool":0},"MuscyEA5sXCVINOXeWRmeQ":{"text":"Lovely old looking restaurant with bright lighting, exposed brick walls, painted ceiling a","useful":0,"cool":0},"Nz5zjY2iwck_g_QCVKcPnw":{"text":"Waiter was Gary. Very slow service. Ordered medium filet mignon, came out rare. Sent back ","useful":0,"cool":0},"21n9rJZ_T4pbhswkL8-ZJg":{"text":"Disappointing and disjointed.  Really hard to recommend this place even though the food wa","useful":0,"cool":0},"31WBdmC1ryxH3nuRCeY6SQ":{"text":"Excellent service for a large group! 18 of us split between 2 tables tucked into a semi pr","useful":0,"cool":0},"v5AdLzBpG-EqqMS20_gKKQ":{"text":"Right on bourbon street. Nice ambiance as my crew and I walked in with no wait for a table","useful":0,"cool":0},"dd7ixjVWqKZK8VS0YqUKUA":{"text":"Great gumbo and atmosphere was perfect. \nKids menu was convenient.","useful":0,"cool":0},"dza7NISzVjKApsrmR3okeg":{"text":"This was one of the better places I ate at while in New Orleans.  I liked that the fish is","useful":0,"cool":0},"xFvlfKWy7M54fcvgnTThlA":{"text":"I finally tried Alligator for the first time and it turned out really good in the boudin b","useful":0,"cool":0},"3PKyeqlygNDRlJrTtHFBaQ":{"text":"Eh... Food was luke-warm at best. Filet Mignon was supposed to be medium but came out medi","useful":0,"cool":0},"NAcgK0MtQ8RZqlE9mL-uFA":{"text":"I would never have walked through the doors on a normal occasion. I probably would have gl","useful":0,"cool":0},"d1kD0J0W6DSMKKs2d9Ey4g":{"text":"Ate here for lunch time. The waiter advised the specials of the day to my dining party. I ","useful":1,"cool":0},"AG8gL6btAMnPXt2jeFNvOA":{"text":"Outstanding! Wife had the red fish and is still talking about it. I had the Louisiana shri","useful":0,"cool":0},"yIdbucCaX6wkeIez1E0abw":{"text":"The food was amazing (seafood pot and red fish with lump crab meat).  Frank was probably t","useful":0,"cool":0},"BV2erOo5QHO7AjM6Yrz-7g":{"text":"Hard pass. Food was lackluster. Tourist trap. Cold food. No flavor. Friendly waitress that","useful":0,"cool":0},"wdyLwQJ2eDpFFmWs2czC5g":{"text":"This place is amazing and the service is fantastic.  We had a group of about 20.  We calle","useful":0,"cool":0},"vQ-hmUPdmcCch4UNv5lJbQ":{"text":"Best meal of the trip!   I had their risotto creole jambalaya and my wife had the jerk chi","useful":0,"cool":0},"JNTKuRO1W_Z_U7hSfKCEoQ":{"text":"3.5 Stars-- traditional flavors, laid back 'fine dining', no surprises.\n\nThis was a very s","useful":3,"cool":2},"LnlKWHW6GYTxBw9aFV_Xjg":{"text":"Excellent service Excellent food!!! A must try! This place was warm and comfortable. The e","useful":0,"cool":0},"MQYwuzyUn96cjp4FqPITNg":{"text":"Redfish Grill needs to decide if it is an pricey dining establishment or a place that offe","useful":1,"cool":0},"8EC6k9RvHb5XEb7x_zPfgg":{"text":"Where do I start?\n\nAppetizer: order the BBQ Oysters and nothing else... AMAZING \n\nENTREES:","useful":0,"cool":0},"RVVJrIEw_WmsHBSjVO4rpw":{"text":"This restaurant was alright. Food was good. Somewhat pricey for what you get. Drinks are a","useful":0,"cool":0},"5JRJt0GuGjNyoH15sWLPnQ":{"text":"The service was great and Dawn made the experience at the restaurant awesome. Her suggesti","useful":0,"cool":0},"aGgi_MJgxB0WN2Ke57MtAQ":{"text":"Red fish was recommended by a local who said they served the best fish in town. We came re","useful":0,"cool":0},"pswsRC3gyUNvFRb4Hth8Yg":{"text":"Saw this place has really high rating, so I gave them a try. Greeted by really friendly la","useful":0,"cool":0},"rOY3KPDqWRoQxScU9O1kfQ":{"text":"Enjoyed awesome gumbo and an incredible burger. The oysters on a half shell after three en","useful":0,"cool":0},"je3kZV4rG5N76-bEaplpJg":{"text":"Spent Thanksgiving week in New Orleans. Came here midweek, it was a full house. Red Fish G","useful":0,"cool":0},"WjRNWrrbAFKTYJ8rDh3hgA":{"text":"This place was great.  We had a long wait for a table at what was a seemingly empty place ","useful":0,"cool":0},"JlkvCR31JL9wbOWgCddoUw":{"text":"A moderately upscale seafood \"NOLA cuisine\" restaurant just inside the Quarter.  It does g","useful":2,"cool":2},"0xDCOQUmSnhGWapiYGT87Q":{"text":"I had the fish tacos and asked for the sauces on the side. Amazing good!  I'm glad I asked","useful":0,"cool":0},"IggaXO-eTO_dCQ5F99U32A":{"text":"Just plain good.  Great ambiance.  Great service.  Great crowd.  Great food.","useful":1,"cool":0},"B_ijDvUyhmp4Mu3QXjhELw":{"text":"I had an appetizer of the catfish bites that was very good. The table next to us told us t","useful":0,"cool":0},"Zqj5gfD7jUsdkxjGbYdzeg":{"text":"Came here during Mardi Gras. Some things were good, some things were not so good. The shri","useful":0,"cool":0},"U5lox_7nmjmLTvF3CFoMcw":{"text":"Great food, drinks, ambience. The wait staff are helpful, prompt, and professional. My fav","useful":0,"cool":0},"h15Iz_7W5VfwAVRD3SAmDw":{"text":"Went by myself and got seated very quickly at the bar. Great and quick service by servers.","useful":0,"cool":0},"V8T2rfQbeSvFcZVzVmAlHA":{"text":"Last time we were in New Orleans we discovered this fantastic restaurant. We even made an ","useful":7,"cool":2},"MHEBusHKY2E_PQSahpbJng":{"text":"Best BBQ oyster po boy on earth. I had it a couple years ago at the Louisiana Seafood Fest","useful":0,"cool":0},"qgzE7VSB0BBRXh5pQwpQvA":{"text":"This place was great!  Greaat with a 2 year old and 6 adults.  Oysters weren't the best bu","useful":0,"cool":0},"jH70w_hBN1PrDUWiCWRreg":{"text":"Situado en el barrio francés ! \nRestaurante muy grande y ruidoso, no recomiendo ir en pare","useful":0,"cool":0},"oLXuA8icQxdZQTu2tkDhOw":{"text":"I love it here, it's one of those places where you really can't go wrong. The bbq oysters ","useful":0,"cool":0},"nNXc80rGmWEimBVU6pq_eA":{"text":"Decent food especially the BBQ oysters. They accommodate kids well when dining early.","useful":0,"cool":0},"LRL6nF9j2SpltwLeRrBUmw":{"text":"This is a 5 star rated place. Anyone who says less is a fool. STELLAR service beyond compa","useful":3,"cool":1},"G-wEKO6UOnt-Cq69p-rQ9g":{"text":"Skip this place. I can't believe a supposed quality seafood place overcooks the shrimp. It","useful":0,"cool":0},"bIqVe9CL-5106XCOuREp5A":{"text":"I wanted to order something I've never tried before. For an appetizer, I had the oysters. ","useful":2,"cool":1},"YNVOhG_V2HgruFRFU2cLZg":{"text":"Excellent.  Great food, outstanding service, wonderful attitude.  Crawfish etouffee excell","useful":0,"cool":0},"1uJ3G6etW8Ez4gykbUbh9g":{"text":"Absolutely a great meal to end our day in the French Quarter. \n\nHubby had the oysters on t","useful":0,"cool":0},"r_uSOWwGsNar5baCDzl8PA":{"text":"Insanely tasty food. Great service. Nice casual dining experience on Bourbon Street. The R","useful":0,"cool":0},"qjI7hWD9RgtqvXSILwannw":{"text":"Good food and a perfect place for you to take your kids to eat after giving them a quick t","useful":0,"cool":0},"NWZ5c1LUi6qKsf5iv6Y4KA":{"text":"We thought Red Fish Grill was WONDERFUL! It was very tasty and the drinks were delicious a","useful":0,"cool":0},"88-1foCeOVJ0D5Z-o71CeQ":{"text":"Not a bad meal. We got the two most popular dishes here. The bbq oysters were not bad. I d","useful":1,"cool":1},"lAJ-_DEJpmAxrWlaC9UB9g":{"text":"We were referred here by the concierge at Wyndham and decided to make a reservation for my","useful":0,"cool":0},"gMUaqBfBt-vc-SCkN5MYLQ":{"text":"In NOLA on business and I recall from about 10 years ago, this place was excellent, and de","useful":0,"cool":0},"NefNh2HqFlXX6A7J-ym1tA":{"text":"I'm in gastric heaven!!  The sauteed Gulf shrimp and grits with the fried green tomatoes a","useful":0,"cool":0},"b_lI3JiBy71zw9wuOyl7NA":{"text":"Out of towner.\n\nLove this place. Went for the first time a year ago or so. It's one of tho","useful":0,"cool":0},"gbx1r9OwCG9iAvo3Yhk-uA":{"text":"Hands down: best meal we had during our most recent stay in NOLA!! Highly recommend the Cr","useful":0,"cool":0},"z-ZOI32UCtcjJ6CVhzSyLQ":{"text":"We came back to Red Fish for my parents' 40th anniversary. Requested Ike ahead of time. He","useful":3,"cool":1},"pA1YSQy5gNY3lvtxiEPK5w":{"text":"Have dined here twice and love this place. Amazing bbq fried oysters and po boys. Loved fo","useful":1,"cool":1},"KJDphNlvna519ynndF118Q":{"text":"Portions really, really small for a little person's standard.   Too hoity-toity.  Not wort","useful":0,"cool":0},"aSyTTbdZfvGON4wGffosjw":{"text":"We came here because the line in front of Acme was too long but we were pleasantly surpris","useful":0,"cool":0},"dYoXkIbsWvP2FrXLBU2dPA":{"text":"I'm only giving us one star. I would love to tell you what the food is like, but we came a","useful":1,"cool":0},"mXxiq23qCdCRQTXqRTcrQg":{"text":"Good not great. A bit over priced for the amount of food. I had the red fish.. Small porti","useful":0,"cool":0},"_DrJycqTo1zveNz7kGH4vA":{"text":"We came in here to try a more upscale place on bourbon for dinner and holy crap it was sla","useful":1,"cool":1},"fTNoyva5es4uJ00qd1ckFw":{"text":"We recently visited New Orleans over the July 4th weekend and stopped at the Red Fish Gril","useful":0,"cool":0},"Ym-PporAoi5SOy4lJ6K7SQ":{"text":"Nothing exciting here, in fact I am very disappointed \n\nThe raw oysters are not clean enou","useful":0,"cool":0},"6brl9kpQTebOL8f7vlR2-A":{"text":"Always amazing. I come to New Orleans once or twice a year and I come to Red Fish Grille a","useful":0,"cool":0},"axmDP2d9RMLOLaHONaG7wQ":{"text":"Loved! Had the blackened red fish, and it was so great. Flavorful but not too spicy. Sat a","useful":0,"cool":0},"hs7EQmrqk3kpbl9HeNkAlg":{"text":"At dinner here last night.  We ended up here because of yelp likes, a hotel staff recommen","useful":0,"cool":0},"tCMvnRVDLv312Lg9ylplwg":{"text":"I ordered the chicken, cut into it and it was not done.  I asked them to remake it and I t","useful":0,"cool":0},"NWT03Dmku23AyksaF9gaCg":{"text":"Loved our dinner at Red Fish.  Service was prompt, polite, and friendly.  We had the bbq s","useful":1,"cool":1},"86Ix_CZvpwqWExA7xotD5g":{"text":"Absolutely the very best. Food was off the scale awesome. Our server,Phillip, a Marine and","useful":0,"cool":0},"-M2GzLIzHYnrH8GJ0dY1xg":{"text":"Great dining experience from beginning to end. Outstanding service and amazing delicious f","useful":0,"cool":0},"_MUPKHvfvCMCom8GMLiR0A":{"text":"Superb food! So good we ate here two nights in a row. Wait staff is spectacular. Frank (ou","useful":0,"cool":0},"3-Anraubm7nH54dSlxX2ZQ":{"text":"Feb 2018 was my previous review.  We went back 7/22/19.  STILL PHENOMENAL.  Have not gotte","useful":0,"cool":0},"n9L2iOntIFWUKrVqFe7PnQ":{"text":"I am giving this review solely based on the bread pudding. I came just for the double choc","useful":0,"cool":0},"32aLlLLGKr4waNiHkvZJzA":{"text":"The meal here was amazing. The red fish was fantastic, the fresh shucked oysters were amaz","useful":2,"cool":1},"nGVTZyj3-cgRZJ36jy1OJA":{"text":"Excellent tourist trap, but totally worth it!  The food was good and the waiter was awesom","useful":0,"cool":0},"humSt0gsC_-qUCIjWEyohA":{"text":"Group of six. Service was really good, food satisfying...not Emeril's but on a stand-alone","useful":0,"cool":0},"JfUdCq6WtHficRCkwPMVZA":{"text":"My in-laws suggested Red Fish when we were in town visiting and my husband and I were real","useful":0,"cool":0},"RP3dcY1ZUW5J2hPzEPGMWw":{"text":"Fantastic food. I highly recommend the gumbo and the jumbalaya. The shrimp was absolutely ","useful":0,"cool":0},"M_2f8MbGRxh3Y3wK5trQSA":{"text":"Service was good but to the point with no chit chat. Too busy for anything other than busi","useful":0,"cool":0},"RJ4AW8A_UIuiFYfslCH14g":{"text":"Amazing food and great service! Highly recommended for fresh seafood!! Not too long of a w","useful":0,"cool":0},"nJZeAWYLTNMfnz7VRfkVTA":{"text":"For many years, I have gone to the Red Fish Grill every time we need a last minute reserva","useful":1,"cool":1},"5G5hAGdVobsG-JQVVA995g":{"text":"It's a decent place considering its on bourbon street. However, be prepared to wait for a ","useful":1,"cool":1},"OmF2iO3vmnIEnhZEVBSIKQ":{"text":"Have been coming here each trip to NOLA for years and food as well as service have always ","useful":0,"cool":0},"vPBjli37M_fwtgiSXIXoAg":{"text":"Definitely lives up to their reputation. Tim was our server and he was fantastic! \nThe sna","useful":0,"cool":0},"M2rhi7cLiLvmIfGdR4Sy5g":{"text":"First time in NOLA and had dinner at Red Fish...it was wonderful.  Highly recommend the wo","useful":0,"cool":0},"D88SjAMPshq3q0YL1UqLig":{"text":"The wife and I went on a Wed evening.  The service and atmosphere were great.  The best pa","useful":0,"cool":0},"6df8xdv3uX2nDb9dt8xvRg":{"text":"If you read my other reviews, you'll notice how stingy i am with giving out 5 stars.  I do","useful":0,"cool":0},"LwXp1S004GAJ0lQWat7Ngw":{"text":"We had the Red Fish and the Filet both were fabulous. I highly recommend. Service from wai","useful":0,"cool":0},"AJYIOb8fbNSWAIYYJqkBNQ":{"text":"I had high hopes for this restaurant based on recommendations from a local. However, the m","useful":0,"cool":0},"d4lDjSwPWTS1NdmMEbQvpg":{"text":"My friend and I had dinner here this evening. Both of our dishes were very good. The house","useful":0,"cool":0},"xBeFi_xGVpTod0WlpWKfPg":{"text":"Food was delicious! They were busy on a wednesday night but no long queues at any time.\n\nO","useful":2,"cool":1},"EDJyWmGzYVFJvP1UD7R5ww":{"text":"It was my first night in New Orleans and I started out with a bang! Right off Bourbon Stre","useful":1,"cool":0},"ei4E-xwEp8zm30YMs7cCMQ":{"text":"Had the Grilled Fish Tacos and oh my were that amazing. My wife had the Crawfish Bisque an","useful":0,"cool":0},"jKrVcToT_NeUWHLftW-KCg":{"text":"This is the place for great New Orleans Cuisine! Great service, drinks and food! I tried A","useful":0,"cool":0},"limPuXIzV-w8tYQwS2EyGg":{"text":"Stopped here on our first night in NO. Lots of seating in this busy place and service was ","useful":0,"cool":0},"PLK8kXxkshWO6LX3c8qE-A":{"text":"Awesome! Ike was the best server I've had in a long time. We got the bbq oysters and grill","useful":0,"cool":0},"hViynC1Je7TFTSzTILn-mg":{"text":"This is our favorite place to eat in NOLA!  The food is great, and the chocolate bread pud","useful":0,"cool":1},"i2abiFtJipsjrszan6AdCg":{"text":"My boyfriend and I were on vacation in New Orleans and the bus tour guide recommended Red ","useful":0,"cool":0},"GR1eZ8ahnu0bFVtrmSqKuQ":{"text":"I was so happy that I was able to check this place out while visiting during my stay. \n\nI ","useful":4,"cool":4},"yQPNYMacODrhmUghTCglCw":{"text":"Our waitress was so sweet and helpful, told us what to avoid in the area and what was wort","useful":0,"cool":0},"venq1JcR7452cLz6EX23NQ":{"text":"Very nice! Ordered hickory Grilled redfish, Cream of Mushroom Soup appetizer, and finished","useful":0,"cool":0},"RAJDSjiIAtV1gqewmzHCNw":{"text":"wonderful place to stop and have excellent food, delicious plate with grilled oysters and ","useful":0,"cool":0},"zVpibx5MDcWJFH39T44QPw":{"text":"4 star for the awesome service. The young lady we had was extremely friendly who gave us s","useful":0,"cool":0},"A7k0lqrxNLzD0IWVnhVwnQ":{"text":"The food here is absolutely delicious. Everything we ordered was amazing, from the appetiz","useful":0,"cool":0},"OIm0IYmi2QNChCbnkI-s6Q":{"text":"An absolute must in NOLA. And, your on Bourbon st. Check \n\nFor lunch ( day drinking) stop ","useful":0,"cool":0},"HkcOWyi2-OK3KrAFHh4lJQ":{"text":"My dining experience here was great. The restaurant is located in the center of Bourbon St","useful":0,"cool":1},"kHcaTcX0Eh-cDQaL5h3BKw":{"text":"Excellent Blackened catfish or their signature fish of Red Snapper!\nDefinitely a place clo","useful":1,"cool":0},"YskklAE3_FGjbbh2zHkmGA":{"text":"A definite 3, maybe 3.5 star. The food was good, but nothing memorable or extraordinary. W","useful":0,"cool":0},"QM_EEdcI95zzi2SvYeV-sg":{"text":"Went here for my 30th birthday dinner and was NOT disappointed. We chose this place becaus","useful":0,"cool":0},"A3iK9dwFv3Hrpwnwp_Esyw":{"text":"Ate here with clients after a meeting at the Hyatt.  Waited approx 20 mins for our table a","useful":0,"cool":0},"Fsl6siVL1pGPainJo4o75g":{"text":"Went here to dinner with two of my work colleagues.  It's a very busy, loud, and fun resta","useful":0,"cool":0},"mH5VFDmPznvhbHA8PVfnPA":{"text":"Gurl! Old Fashioneds are to die for! Had the oysters! Fantastic! Filet, alligator boudin, ","useful":1,"cool":0},"88Swl2kgAd-j8O-EDRRjVQ":{"text":"Stopped by Red Fish Grill for dinner.  Atmosphere and ambience here is great - cool decor ","useful":0,"cool":0},"5JPKbczWBa2pD_jjzvjEhw":{"text":"This is a Nola staple that I try to visit each time I'm in the city. The BBQ oysters are a","useful":0,"cool":2},"nyWoLRKx6Ro6ReuZ9he-sw":{"text":"The Red Fish Grill fish  in New Orleans has some of the best Cajun food I've ever had and ","useful":0,"cool":0},"irKAOxsdnrb_turLAKT3iQ":{"text":"Great food and Great Service found right on Bourbon Street.    We had only 1 night in New ","useful":0,"cool":0},"UosmVQza7XanAfSbxvOJ0Q":{"text":"Probably my favorite restaurant I experienced during my trip to New Orleans and would reco","useful":0,"cool":0},"sxBGTqQArBFqyZoQtOOO9w":{"text":"The BBQ oysters were ok, to much like chicken poppers, the fish was cooked very nicely but","useful":0,"cool":0},"4J4OwuiHC6hPsDdZeiEtqw":{"text":"I ordered the fish and grits and for $23 I got a large bowl of grits with two, count 'em, ","useful":0,"cool":0},"_5FaWSA8cYYoXJZpmGJu4g":{"text":"We visited this restaurant twice last week. Once for dinner and the next for a business lu","useful":0,"cool":0},"ntdQuAywhfDYn75F8Bq1Hg":{"text":"Went here for a birthday dinner and the food was very tasty. I ate the red fish. The servi","useful":0,"cool":0},"-vdUlO_YMAZ_eUS0yWdp0w":{"text":"Returned to the Red Fish Grill and loved it.\n\nThe gumbo was very good and blackened Red Fi","useful":1,"cool":0},"eqYtB08EsvDZhigT6YliLw":{"text":"Awesome food--we especially enjoyed the red fish chowder. Special thanks to Caleb for his ","useful":0,"cool":0},"4Q1XcnnhLsGreholu3IJoA":{"text":"I expected much better food as I've dined here previously although a few years back and al","useful":0,"cool":0},"Ih81Pb7kpOVwILUuv4ZBPg":{"text":"We recently had a big group dinner at Red Fish Grill for 26 people. from the planning stag","useful":0,"cool":0},"2XD8jPNON_mLAx49y6SOYA":{"text":"Incredibly friendly and great food. Dined here with a teenager who discovered that he coul","useful":0,"cool":0},"U_-nU403ZFPQO_sb61SHjA":{"text":"Not a bad first meal in New Orleans! From the moment my family and I stepped in we were we","useful":1,"cool":1},"1eZWb26IjU8c4Y3HOQWAYw":{"text":"Our meal at Redfish Grill was amazing!\n\nWe started with BBQ Oysters. More like buffalo tha","useful":1,"cool":0},"lvDPrS1xDR423n3eNvHBEw":{"text":"Really enjoyed our meal here after deep sea fishing all day. The BBQ oysters were amazing ","useful":0,"cool":0},"Qer8uyCiqiPltr7i89Y-1A":{"text":"Overpriced but tasty! We grabbed a reservation here so that we didn't have to wander aroun","useful":2,"cool":0},"qFxmRtqxwz9mR0uDWViReA":{"text":"I was disappointed when my shrimp came with head and tails still on.  By the time I cut th","useful":0,"cool":0},"MQf_LW2-vnC6dHzGgLYo1Q":{"text":"Outstanding service and redfish was great as well.  Highlight was chocolate bread pudding ","useful":0,"cool":0},"2oE11XmgQLTqd6_ndo8B-A":{"text":"It's not often I would give 5 stars, but this place is fantastic. Our server Ike make this","useful":0,"cool":0},"qvFiewIPuaAgpU1-qxI_9w":{"text":"4 only because I don't eat seafood that much but the grilled chicken was fantastic. Came w","useful":1,"cool":1},"caqg016sAFhXhBkulhiK7Q":{"text":"My mom and I stopped in here for an early dinner and realized dinner didn't start serving ","useful":0,"cool":0},"wez3yZwGENl81SIMvPLo1g":{"text":"This is my first stop anytime I get to New Orleans.  I love their red fish.  Everything I'","useful":0,"cool":0},"WvE4Q_MeE23oz6Q0xOg2jg":{"text":"Very good seafood I had the redfish with lump crab house special, it was amazing. My wife ","useful":1,"cool":1},"299t0PzH68P0zZ-UvC5CoQ":{"text":"During my trip to NOLA I visited this restaurant. I would have to say it was one of the be","useful":0,"cool":0},"B_Jj8-aoLuorSLpLNhvPhQ":{"text":"I began with the fried catfish bites which were very good. I did not pickup on any seasoni","useful":0,"cool":0},"D4nRpqY266XB03-7WLU9Kw":{"text":"Redfish was wonderful. The drinks were good- I had the Bourbon Streetcar and my husband ha","useful":0,"cool":0},"GDKch0XSKBabIqqHbWn0aw":{"text":"Amazing restaurant in the Dickie Brennan group. In the heart of the French Quarter, a mode","useful":0,"cool":0},"fNSjnBzhGkiFKF4MHSNoRw":{"text":"We celebrated my cousins bday. We made reservations for a party of 16 only 14 could sit at","useful":0,"cool":0},"_PaO_q3WgolV1o0r4Gq9Ig":{"text":"Close to hotels if you're staying on Canal. The service and ambiance are great. My colleag","useful":0,"cool":0},"MOddfYJ3nsJ6Hb_Ez2SqMg":{"text":"Great new Orleans experience. Start the meal with warm bread and some raw oysters and the ","useful":0,"cool":0},"mC6UjkTodXYvWoJFkqTW5A":{"text":"A good place for high cuisine. I started off with one of their beers. They seem to only ca","useful":0,"cool":0},"GcfEXDUkvVt1vuezkpewMQ":{"text":"Best happy  hour for oysters! .75 apiece and lagniappe. $3.00 draft beer! Highly recommend","useful":0,"cool":0},"4hzJnHpVRQG8y0XSgyeXCA":{"text":"It is a friggin loud spot,  the service is Decent( I STRESS Decent) , but the food is grea","useful":0,"cool":0},"OTGG-Z2cKWU0eurbfndyWQ":{"text":"Probably the best oysters I have ever had. We stopped in this place on a recommendation fr","useful":0,"cool":0},"i2qLnOnl5iCCtJ0eMTXhpQ":{"text":"By far, the best food I've had in the quarter. Came with a group of 5. We ate across the m","useful":0,"cool":0},"O2BZ4hloWWI5DCaDyhM-Dw":{"text":"A really loud, kind of awful place. Certainly nothing great! It was a shock for all 3 of u","useful":0,"cool":0},"d2R-AAVxc12i-OyLVvu2wg":{"text":"Can't even tell you how juicy and flavorful the food is. You just have to go in for yourse","useful":0,"cool":0},"oNPulDL0d_CG2LoA_VUoaA":{"text":"Just love this place, plates were hot and the grilled red fish was top notch. Having the f","useful":0,"cool":0},"wt1BUYGyOO_6pezkZtKzSQ":{"text":"Though I would have preferred to nosh on some magic double chocolate bread pudding or what","useful":4,"cool":3},"Ez4SJU2e94wIpt3JVXt1Rg":{"text":"If you are visiting New Orleans, you must go here to eat at least once.  \n\nThe staff quick","useful":5,"cool":3},"CkrNQMwxuT1xdKCO3xTOJg":{"text":"Excellent restaurant with many entree options.  The servers are great.  The appetizers are","useful":1,"cool":1},"i9CGsA52csTkm13p0_B9iQ":{"text":"This place is awesome! My son had the alligator and shrimp gumbo and  I... well I had drin","useful":0,"cool":0},"MGbIYKYtNPz6IQPBtLUZww":{"text":"By far one of my favorite places to dine while on my week long New Orleans birthday trip a","useful":0,"cool":0},"F4CVR7rhKwicVUJl-pmxtg":{"text":"50 cent oysters Monday-Thursday 3-6 PM. All you need to know about Red Fish Grill. The oys","useful":1,"cool":1},"7_eLEmqbxWWtNW0EqNMHJw":{"text":"Ok.  In order of significance.. Kaitlyn and Haley were marvelous hostesses.  Very friendly","useful":0,"cool":0},"_nYxbAKnfvqhifSOYULg-w":{"text":"fresh！ very fresh oyster and tasty BBQ oyster...... good service. while the bread is a lit","useful":0,"cool":0},"Ms27r1-waObijNzbRAXvGg":{"text":"With the casual dress and a laid back atmosphere, I was pleasantly surprised with how exce","useful":0,"cool":1},"F23GlZJEHSOhYNLiTSXO1w":{"text":"We had a really solid meal at Red fish, Tim took excellent care of us, told some good stor","useful":0,"cool":0},"f58QvJ1TIcm70ncfjr-LfQ":{"text":"This is the 2nd time I've visited the Red Fish Grill and it did not disappoint either time","useful":0,"cool":0},"MjNRN5cm616v9GRc3p3vHw":{"text":"The food was delicious and the service was awesome. It was busy, but the wait staff handle","useful":1,"cool":1},"sfDPm9dJVlvBBgxC9_zBzw":{"text":"Excellent! Grilled fish, fresh veggies, jalapeño cornbread, chocolate bread pudding. Atten","useful":0,"cool":0},"Nqh5wLNyDuCrfgPcpVo79A":{"text":"3 out of 4 people liked their meals.\n\nMe though, and since I'm writing this. NO. \nAnd the ","useful":0,"cool":0},"trMYJHPvGPGS7S-Nd8ZLGQ":{"text":"One of the Brennan group restaurants that serves the same quality of meal as Brennan's, bu","useful":0,"cool":0},"hNmNi-6_67IJ0C_M4c2OSw":{"text":"We chose this place because the friends we were traveling with said it was a great dinner ","useful":1,"cool":1},"NclJG2UoApWmIZha1edEgw":{"text":"Yum! This was a fun and easy spot on Bourbon Street that we wandered into for dinner and w","useful":0,"cool":0},"PhGXG4QzW1eNkJrqoOeZeQ":{"text":"This place isn't too deep into bourbon Street and has a nice look despite they stating it'","useful":0,"cool":0},"CeZhUViQgO9CRsXA47HnhA":{"text":"My husband and I are here for dinner the first night we arrived in New Orleans. The food q","useful":0,"cool":0},"1Ykc75H-ki2LbSQbm77iRw":{"text":"So disappointed!  We were told that the wait would be 45 minutes.  We waited for over an h","useful":0,"cool":0},"rk1EO5bNjdgJxSXPulvGnA":{"text":"Gary was our server & was excellent. We are from philly & in for vacca & my wife really wa","useful":1,"cool":0},"PgT85380qwmzTpqUpgDgqQ":{"text":"This restaurant was fantastic!  Four of us had dinner.  The swordfish catch of the day was","useful":0,"cool":0},"r1O2T4A4uxcl5hiu6P4NKw":{"text":"I guess a lot of people are probably put off of Redfish Grill, because of it's proximity t","useful":12,"cool":8},"X_Op8pNyadVv0pv6UDcXOg":{"text":"This restaurant was recommended by a family friend and I'm so glad we tried it. The food w","useful":0,"cool":0},"LHnJl3Pvvo8XDPpLycNyCA":{"text":"In a city full of amazing cuisine, Red Fish Grill is a terrible choice.  It makes Red Lobs","useful":1,"cool":1},"kQQ0lAL4VYd76cfjvhT97Q":{"text":"More realistically 2 to 2.5 stars. Decidedly average. Nothing great and priced for the tou","useful":1,"cool":0},"qX9y1LbBKQkQv31PkK-H_g":{"text":"Near the beginning of Bourbon Street, this is one of the most highly rated restaurants. I ","useful":1,"cool":0},"abDKlqnWr9zlv15WpG7DgA":{"text":"This place was incredible. Even though it's right on bourbon at its very very nice inside.","useful":0,"cool":0},"GYRR3wixLhzZ8UWJXcdPPQ":{"text":"This is an especially inviting tablecloth-but-casual restaurant with clean floors and no b","useful":0,"cool":1},"inKSxUHIezKpVktFRIl5NQ":{"text":"Had a very good dinner- shrimp and grits- even better dessert- bananas Foster was deliciou","useful":0,"cool":0},"DtCNWcCMVYIe-gkgI39tHQ":{"text":"TOURIST TRAP... Food is bland lacking proper seasoning. Service is good and the food was s","useful":0,"cool":0},"IUJizCsEh6E94WS8HSlzjA":{"text":"All the reviews are true!  This place is delicious!  We had the alligator boudin balls. Th","useful":0,"cool":0},"LGB5mBrEtLe_B2408CqQnA":{"text":"Enjoyed our anniversary dinner here. We ordered the Red Fish signature dish with lump crab","useful":0,"cool":0},"XpR0lcZFvnf_noaVVNwLFQ":{"text":"Would not go back. The food is subpar for the price point and the fact that there are way ","useful":0,"cool":0},"uodBWCFRZHLOsmdr12phUw":{"text":"The drinks were good and the food was litterally 'as good as it gets'!  Everything here is","useful":1,"cool":0},"ppeXIirm9jA0zgGNOusLqQ":{"text":"I love the double chocolate bread pudding... it is \"When Harry met Sally\"  scene would be.","useful":0,"cool":0},"k7bJ6BIo3v4wl2S0Hln-0w":{"text":"I ate at Red Fish Grill this past weekend while I was in NOLA for my bachelor party.  It's","useful":0,"cool":0},"lNCHD0F4gOSg1ZmDCOhznA":{"text":"Food was great but Pearl was the highlight. She was super sweet and went out of her way to","useful":0,"cool":0},"jyknpL0HyAsdNQzmkzEZWA":{"text":"Decently priced. Fun atmosphere. Great food. Definitely a must try if you want some differ","useful":0,"cool":0},"wMG7WlixwrKX4bE2azFteQ":{"text":"Wanted to try out this spot after seeing all the reviews. The hosts and servers are friend","useful":0,"cool":0},"wpg74jqna-wRiEBLzHy4BA":{"text":"This review is only for their happy hour.\n\nThe happy hour is Mon to Thur, from 3-5 and oys","useful":0,"cool":0},"F12CE-2HtFLUeTo0r767eg":{"text":"I was told by some regulars of mine that I HAD to eat here on my visit to New Orleans, and","useful":1,"cool":0},"UyimAM2I50WB9qhwdh_tzg":{"text":"HORRIBLE!  With the exception of the oysters being pretty good, everything else was sooooo","useful":0,"cool":0},"PZddVVPSERjJDwiI9P5y3A":{"text":"Had the waitress' favorite, the blackened red fish and bbq'd oysters...very good.\n\nSat in ","useful":1,"cool":0},"rHBJ4jm2ZlIPx1gjKso-nw":{"text":"I'll echo others in saying that as soon as we stepped in we were greeted by a kind host wh","useful":0,"cool":0},"SliOJRMx7GFwZ3ZURmnFEA":{"text":"Excellent vibes, excellent service by Chris, excellent food.\nSimple instructions:\nGet the\n","useful":0,"cool":0},"oeo1u1NvAZuDamMnuhuuqw":{"text":"This place totally suprised me. I thought the decor would be bland (it was quite intriguin","useful":10,"cool":4},"BqjjM9Ct001E5ZgAC_ENjA":{"text":"We went in for happy hour.  Service was good.  Oysters were excellent and well priced.  Th","useful":0,"cool":0},"bsYIFOIi76Zc-cF08u3q-Q":{"text":"Came here around 3pm for lunch/dinner. Lunch/dinner dining area was closed so we opted to ","useful":0,"cool":0},"GDFtn3Vrl53wMoJaaenHhw":{"text":"After a long drive to NOLA our host recommended Red Fish Grill. We walked in and were seat","useful":0,"cool":0},"IcdyeyGBtJbW_eAn4OI7Zw":{"text":"When visiting New Orleans this restaurant is a must go to!  Their bbq oysters are to die f","useful":0,"cool":0},"MplgbYH3VqTMk5J3qLY3Rg":{"text":"Wow!  Loved this place!  The dining was comfortable, had a great vibe, open and busy.. gre","useful":0,"cool":0},"hxlE84GMhp3PsFizjwDXuw":{"text":"We didn't have a reservation but they were able to seat us with no problem. The decor is v","useful":0,"cool":0},"jFWUt94OtmAcWEQWUpRbWQ":{"text":"This place is definitely on the more affordable side right in the FQ and casual. We enjoye","useful":0,"cool":0},"GEnfunBS2DxW6Yggqyet8w":{"text":"What's not to like? Red Fish Grill is on Bourbon Street and boasts great seafood dishes, p","useful":0,"cool":0},"yAE9gnaJI9O7SCmqGlM8Hw":{"text":"BBQ oysters are out of this world! Alligator Boudain Balls are perfectly seasoned and the ","useful":0,"cool":0},"gth--tDbTa6TIgn6CsScJQ":{"text":"bbq oysters\noyster on the half shell\nGumbo - andouille and seafood\nRed snapper fillet\n\ndri","useful":0,"cool":0},"raoKf1pAWBBW-T8SvrPOAQ":{"text":"The \"daiquiri\" we got was a cocktail in disguise. A Smokey pineapple with a bit of spicy w","useful":0,"cool":0},"CAgbTJzD3rJ6wpmrWPr_Sw":{"text":"My friend suggested we come here while in New Orleans for the essence festival. She said I","useful":3,"cool":2},"UQqNUKRbSBlLyp1mdyqThw":{"text":"Yes, it's on Bourbon Street - but it's better than the location would suggest.  It's less ","useful":1,"cool":0},"kIaD3Nw3Tzb2uMpWP6up0w":{"text":"Very good food and great customer services. Portions were a little small but overall very ","useful":0,"cool":0},"msJtmriMukdr_BKZgqV4Ng":{"text":"Seriously the best catfish (appetizer - fritters) I have ever had. Service was fast, unobt","useful":0,"cool":0},"PdxFALnqgjHt2zlCE79Blg":{"text":"This is my first dinner in NOLA. (My first lunch earlier today was my very first poboy.)  ","useful":0,"cool":0},"OUfgWY1SnuX9uvREaNDpDA":{"text":"Redfish was wonderful. The drinks were good- I had the Bourbon Streetcar and my husband ha","useful":0,"cool":0},"aGvXPaJlLQmkDfGlE8aaaw":{"text":"This food was overpriced likely because of the location. It was average at best. We got th","useful":0,"cool":0},"aquWvQA4xRKt3lynAV4wxQ":{"text":"Had a fabulous dining experience. The food was amazing from apps to dessert. Highly recomm","useful":0,"cool":0},"pxHZr_dgmbZikFts-5nRaw":{"text":"Their spicy daiquiri is yummy! It was hard to narrow down an entree because there were so ","useful":0,"cool":0},"bRXgnDlBcv2as73Of6wVrQ":{"text":"My husband and I ate here our first night of vacation. We both weren't starving so only go","useful":0,"cool":0},"znQua9bD9vh8cbb-7sAGPg":{"text":"Was in town this week on business, ate here three of six dinner opportunities, so naturall","useful":2,"cool":0},"1HB265eq6u1Kb5dUbN5BTQ":{"text":"After reading the reviews we made reservations and stopped here for dinner.  We didn't hav","useful":0,"cool":0},"lmU2odcftQM4xV8WkIdEgw":{"text":"Excellent service, excellent food! The waitress had to memorize a dissertation to tell us ","useful":0,"cool":0},"ljgk9Qq_pXdWfotWbXyaLQ":{"text":"Sitting at the bar. Alligator Boudin Balls got my mouth buzzing. Killer Manhattan made by ","useful":0,"cool":0},"vA4Fg4KGvuRxNu6jXh2xeQ":{"text":"Somewhat disappointing. Atmosphere is great. But they definitely cater to the tourist crow","useful":0,"cool":0},"amx_sFVbPmjVfrBHUHtd2g":{"text":"The Shrimp and grits here are good.  The grilled redfish will not disappoint.  It is usual","useful":1,"cool":2},"wORrNWoDrX70yDmiK659Fw":{"text":"Had reservations for a large party on Sunday night. While waiting for 45 minutes, I ordere","useful":1,"cool":0},"8UjupHNZvWMaKZyokNUW3A":{"text":"Incredible Jambalaya! The service was quick and we were seated right away on a weekend nig","useful":0,"cool":0},"IXdM-wXNT5CT21gfwacl1g":{"text":"Exquisitely smooth and tasty! Those are my words to describe the food here. You can't go w","useful":0,"cool":0},"JklfwOEhofrIzan5lADiRg":{"text":"Red Fish was absolutely delicious. The atmosphere and service that Ike provided was not on","useful":0,"cool":0},"SCot_9Cc_510p8DKmlIWAA":{"text":"Overrated: We visited NOLA for Mardi Gras this year and did a tour of several restaurants.","useful":0,"cool":0},"S8U2UeH_V0SZGw9BX8RKqg":{"text":"Under incredibly busy conditions, out server killed it as we chose to eat in the bar. The ","useful":0,"cool":0},"uhyn_mhSLDbhCgd4__MqNQ":{"text":"This was a wonderful restaurant. The food was great and our server, Jamal, was exceptional","useful":0,"cool":0},"Z4u9KZzzjPwBMvLZLWjc5w":{"text":"Meh. Does Cajun translate to flavorless? \n\nI should preface that I have a shellfish allerg","useful":1,"cool":0},"mcPJNtj01ZuYTVD2DflTsQ":{"text":"We travel often as a family and rely on a combination of yelp and local knowledge. This pl","useful":0,"cool":0},"s4gB-MUWv4LvWuUtaWMFqg":{"text":"Great place to go if you're looking for local seafood dishes in an elegant setting. The BB","useful":0,"cool":0},"367R0_LKeYHHR_SVox5M8w":{"text":"I have eaten here 4 times in 48hrs. The food is so good. Bourbon St is a tourist trap but ","useful":0,"cool":0},"GxP6LuUfXBv9lv1X2uBQyQ":{"text":"Considering this is right in the heart of Bourbon Street, I had expected inflated prices a","useful":0,"cool":1},"71DokNnMj09UChfwGDTcJg":{"text":"This is such a great restaurant! The portions are perfect and the food is amazing. The ser","useful":0,"cool":0},"9i82vYGzWV1GV8djBqHilA":{"text":"Seeing as I call New Orleans home, I broke the locals rule #1 by having dinner at a place ","useful":2,"cool":0},"9VYSyhAzYTnLZpca41c8ew":{"text":"Excellent food, as I've enjoyed many times over the years visiting NOLA for business and v","useful":0,"cool":0},"cUIScqhxfyw_MQczWaNlZA":{"text":"Service was good and the food was good.  My expectations were high, but attainable.  I ord","useful":1,"cool":1},"WKi-HQdc6Ki6Wa8wz66FjQ":{"text":"Unimpressed?!? Maybe we caught them on an off day? I asked for dressing on the side and my","useful":0,"cool":0},"quEs6sQBtHjGCllsgEAhng":{"text":"Years ago, my husband used to take me here and we enjoyed every bite. We went last night f","useful":0,"cool":0},"7PeApbsIet7quspNFoIB-Q":{"text":"Me and the family enjoyed our lunch experience here. Service was fast and often. No wait f","useful":0,"cool":0},"2MGlMDVa5Ub2SlcSHjWdmQ":{"text":"This place is simply amazing! Everyone was pleased with their meals. The Alligator Boudin ","useful":0,"cool":0},"HqQaGqbQA7Qt4sw33fLmcg":{"text":"Came here with a co-worker because Acme's line was just too darn long. We loved the clean,","useful":1,"cool":1},"S-8mwPEk2359ndKVvGlQFg":{"text":"Had an order of their BBQ oysters, they are pretty good. You have no idea you are eating a","useful":1,"cool":1},"J_YZ64DuptL7oFZDMA25VA":{"text":"If you want a happening place this is it. The restaurant is large and noisy and the many w","useful":0,"cool":0},"dZKrMn3ob-nlTtSXjTWUYg":{"text":"Nice atmosphere and big place! The waitresses were very attentive and sweet. We ordered th","useful":0,"cool":0},"UQl8VIx0uX0Pkr_r0ndsOg":{"text":"Really good food, everything was delicious!  Redfish was blackened and super tender.  Ike ","useful":0,"cool":0},"2zcE7A28XIB9ufo-VYxLkw":{"text":"My husband had delicious BBQ oysters. I don't usually like oysters but thought they were g","useful":0,"cool":0},"HI2L8QWBREzlofZwA82LGA":{"text":"The Woist!!!!! 1 star cause this app wouldn't let me choose zero... A certain TT (Tourist ","useful":2,"cool":0},"1Gz3qRpLj5cxlmThGTpEXg":{"text":"You will love this restaurant! Ask for Ike, he's the best server in the place! Great servi","useful":0,"cool":0},"p3fHwnBeZSTPXjC2RBZevA":{"text":"This place is exquisite. I don't give 5 stars very often, but this restaurant deserves it.","useful":0,"cool":0},"prYNTb8p70FYoAHESdOx5w":{"text":"Crab claw appetizer was delicious, but should have been served with more bread.  The two d","useful":0,"cool":0},"l8XYbrU0fHi4Qwbfdk4-pA":{"text":"Excellent food and great service. I enjoyed every bite of  my food. I chose this place by ","useful":0,"cool":0},"k-dHfPfbblihYCs89wC-Kg":{"text":"Red fish grill is gooood. We found this place on yelp right after arriving in NOLA. I orde","useful":0,"cool":0},"EQiIHoouKbBZ55RiRwb5UA":{"text":"The best oysters we have ever had! My boyfriend and I stopped at Res Fish Grille on our re","useful":0,"cool":0},"9u1ZBPaRKrXSV48TYpz81A":{"text":"Very touristy. Food was subpar with a weird taste. Could make better at home. BBQ Oysters ","useful":0,"cool":0},"XJLSHINB7tOBXrgEj4UAYQ":{"text":"This was a delightful surprise. We were not so excited to eat right in the tourist zone bu","useful":0,"cool":0},"0w3qQgskP7Q3cRkZvZgphg":{"text":"Red Fish is not generally a first choice because there are other places I love more for th","useful":0,"cool":0},"sbybXNQgkGr2R4pL5-MvZQ":{"text":"The BBQ oyster with blue cheese are to die for. So succulent and flavorful. I don't know I","useful":0,"cool":0},"AeBvitpIVHtWHfPv6rFMbg":{"text":"The concierge at our hotel recommended this as a kid friendly restaurant (was traveling wi","useful":0,"cool":0},"PS0nHZf3t9H3QAXPd9Vgzw":{"text":"Sat at the bar and had a few drinks with our dinner. Bartenders very friendly and informat","useful":0,"cool":0},"ERhkCJ4SI4wbk9a-hX6Bmw":{"text":"Tim T must have been drunk. Fantastic food & Oysters. Had the Red Fish Panini, comes with ","useful":0,"cool":0},"ySvm53UCJHKTdP8SxZohpQ":{"text":"Came to NOLA to watch the Saints beat NC.  (We won - yeah!). And finished the weekend by s","useful":0,"cool":0},"ZrkoO0OlTKQNpvw8rXSv3A":{"text":"We had a great time at this restaurant on Valentine's Day last week.  We had a 7:45 reserv","useful":0,"cool":0},"xlJlzyf6Yrd7dd8sLdb99Q":{"text":"Not at all impressed! I'm like, what the hell? We walked into the Red Fish about 4:15 on 4","useful":0,"cool":0},"bKPj9MCvjcnm49ljHfKGvA":{"text":"Casual dress code, Yaaay! \nWe're coming in t-shirt and flip-flops directly from the car an","useful":1,"cool":0},"ZCBt8IIEf4BKoVpGJxdXWg":{"text":"Mediocre at best. Service not great\n.food just OK. Forgot to bring appetizer. \nFood wasn't","useful":0,"cool":0},"rE4M_8uFVSKwTGqDh_fQPg":{"text":"This happened a while ago, but since my most recent visit was similar I'll explain the str","useful":0,"cool":0},"zR13n9Jex_HL9Oc5RherMw":{"text":"Great food in the French quarter area. Kinda casual vibe like a Chili's (wait...don't let ","useful":0,"cool":0},"ez0wWLLSjhspdcIFvSpGjQ":{"text":"The food was good and the service was decent. I felt like they were in a rush to close. Th","useful":0,"cool":0},"6y4kKC0ZdCONRXeYOJg-pg":{"text":"Visited 10/24/16 for dinner \nGumbo and salad. Awesome Gumbo... and a nice salad, if somewh","useful":0,"cool":0},"2BplOf1eogVQxJDAvFMVwA":{"text":"The fried barbeque oysters were good but not worth it. It was a bit expensive. After eatin","useful":0,"cool":0},"WYkiOw2BI-loSvYEQjZa4A":{"text":"We walked in on a weeknight and were seated immediately. Our waitress, Lyneisha, was fanta","useful":0,"cool":0},"Y2p8CRjD-TIHmE8C2Ge9CA":{"text":"I took off a star for the total lack of service in the bar. We walked over from the Staeng","useful":0,"cool":0},"2VHLLaZtxCqWIqg2eWUupg":{"text":"Delicious BBQ oysters which are sprinkled with blue cheese. Shrimp and Corn Bisque is also","useful":0,"cool":0},"53DwN6g8Nz2EiUJcZ6_cHw":{"text":"Very popular dining spot and deservingly so! Visited here with the wife and enjoyed this s","useful":0,"cool":0},"DfZiryLDTtl7pbFPwVEwMg":{"text":"This place was amazing! The oysters were delicious and my fish was outstanding. Try the sm","useful":0,"cool":0},"Dk1W-zbx_GVVYrgtVywP7g":{"text":"I was pretty disappointed in Red Fish in New Orleans. We have one in Dallas and it's alway","useful":0,"cool":0},"GuEk7qnNDAAMffOMkYehqQ":{"text":"First time at Red Fish Grill today and it was fantastic! Red Fish is conveniently located ","useful":0,"cool":0},"R3_UfaImnQb2WYp50p3dKg":{"text":"Excellent food and service. \nEveryone thoroughly enjoyed their meals and the order ahead c","useful":0,"cool":0},"UJWCV87TESf4NB9ZvAg6FA":{"text":"I'm not a seafood kind of person, panicking when I could not find my go to, fried shrimp. ","useful":0,"cool":0},"MaMvp2sHcy9svJ4eRYPGxg":{"text":"We were very impressed with Red Fish Grill.  The service was amazing.  Jason was our serve","useful":0,"cool":0},"cgqUXPs1KWWtKewAeBAVWQ":{"text":"Basically everything is some sort of fish/oyster/crab. I was not very impressed with the m","useful":0,"cool":0},"ir52spHEbB5TMK6GErGYzQ":{"text":"Great for groups! They were able to accommodate our bachelorette group of 12 with one long","useful":0,"cool":1},"1aVrymQBYdY-gPkxhAVMLQ":{"text":"This was one of the best meals I've ever had. Our server, Allegra, was fabulous. She was p","useful":0,"cool":0},"1M0OoXrBBfSvF2bA5H-Qag":{"text":"Had the jambalaya dish. It was delicious!  A little on the spicy side but totally worth it","useful":0,"cool":0},"CPMBQdBuUfAkqrOnrwTnCQ":{"text":"My boss back in Santa Fe suggested this place saying, \"The best place I've ever eaten in m","useful":0,"cool":0},"S3ZerHdETbX3VlXJ9loGkg":{"text":"This place is amazing! It was our first night in New Orleans and redfish was recommended t","useful":0,"cool":0},"1Puo5uo0Nw7iIlbe_Ym_IA":{"text":"Yes surprised, ..me being vegetarian in fish restaurant?? Business meeting was over and ou","useful":0,"cool":0},"2zE-BRE4s_WavEuAB46ncw":{"text":"Disappointing. Stay away from the risotto jambalaya. Very gummy and way too salty   Shrimp","useful":0,"cool":0},"emg-5fVoX4q3TmCgJmGkMg":{"text":"We went in for dinner. We were expecting a great experience based on reviews but it ended ","useful":1,"cool":0},"eXJtxoamrHB1KUywzrEjZA":{"text":"One of the best restaurants I have ever been. I had oysters and jambalaya. The old fashion","useful":0,"cool":0},"jPhp8DnPVPU2AanZHkcsYQ":{"text":"The service was great when we went, which is only reason for 2 stars. The food was not, ju","useful":0,"cool":0},"niwMYOkYWN62zDGO1NRyaQ":{"text":"Phenomenal. The raw oysters were delicious. Food was amazing and service was incredible. M","useful":0,"cool":0},"FzCuomLx11otCrT0bYe9Aw":{"text":"My husband and I went with our 2 kids, ages 2 and 4. We ordered fish, the tomato salad, gu","useful":0,"cool":0},"I6t6ptR3qRDxtTqQr2Roww":{"text":"Update:  I really wanted to like this place so we went back for dinner, this time had the ","useful":0,"cool":0},"p51wwo4Dp3zKS6tri2PEMw":{"text":"This was my favorite meal in New Orleans. They had great wine selection and the service wa","useful":0,"cool":0},"UKhI0D7hRheoXKKY2mae2Q":{"text":"Can not beat the 75 cent oyster deal they have during their 3-5 happy hour during the week","useful":2,"cool":0},"g5rWqc0ED0hkXmc47pa7Vw":{"text":"Great restaurant and bar on Bourbon street. Food is delicious and bartenders are nice.","useful":0,"cool":0},"cK0O2eAMbkqMqoVDD2919w":{"text":"Overall 3 star experience, food was ok but nothing to come back for, bbq shrimp was flavor","useful":1,"cool":0},"1eoBCZuHYMOwrSB_-_PJvA":{"text":"Went on New Year's Eve so very very busy.  Even so, food was very good, service was prompt","useful":1,"cool":1},"fR8rNfb5EL2tNCeTld7AMA":{"text":"This is the third time we've visited in the last 5 years. The decor and ambiance are fun a","useful":0,"cool":0},"4Stu8yPhBXWMcuhUl-jlxg":{"text":"Disappointing. The food was just okay. \n\nWe had the seafood and sausage gumbo, which seeme","useful":0,"cool":0},"FVwDifspPTUwYJfwSAweIQ":{"text":"Extremely friendly staff and amazing seafood at a very reasonable price, loved this place!","useful":0,"cool":0},"a5M_FVJJFEfBH8pL5kHVkA":{"text":"Overall we had a very decent dining experience here with a party of 6. The restaurant had ","useful":0,"cool":0},"ShkynmkOP4WSt0W8LXK_4w":{"text":"My son and I came here for dinner. I had the blackened red fish and he had the battered ca","useful":0,"cool":0},"nFn7OOUg5ZEnmoD0Pz28vw":{"text":"Service????? Wait for it....... Not bad, decent. Food with sides? Nope! Crazy. Terrible se","useful":0,"cool":0},"N91vJhAWGuMIzoACTkgedA":{"text":"This was our first stop (of many) for oysters in New Orleans and we weren't disappointed! ","useful":1,"cool":0},"4Ww9eURE8RTDeyCJNDZH_w":{"text":"I love the atmosphere of this place. I like all the food they serve as well. A big fan of ","useful":0,"cool":0},"ynymhpEHPiBVB1YGafkXwA":{"text":"We visited here in the first week of Dec for dinner, we got the following\n1. Snapper with ","useful":0,"cool":0},"PgHJyC3WdqE-rAOAExSVmg":{"text":"Absolutely the tastiest and freshest fish dishes we have ordered  in a restaurant.The Gulf","useful":0,"cool":0},"y6SX4Bg6ADc6nIdPMCSM7Q":{"text":"If I could give this ten stars I would. Some of the best blackened fish I have ever tasted","useful":0,"cool":0},"r_ZkV_n2vDkq-L8tvLBnZQ":{"text":"If I could give more stars to this place, I would. We came here on the recommendation of a","useful":1,"cool":0},"bNNiuFVZ3ESPTIqzZKNe8g":{"text":"They have their menu outside so you can view prior to coming inside which was really neat ","useful":0,"cool":0},"aMFVlu7p8fbvcc8huJQydQ":{"text":"Great Food & Service.\nSince I often travel to New Orleans by myself this is a very comfort","useful":0,"cool":0},"FKyZoQ84kuPE0ydk9RR9zA":{"text":"Went early in late December. Slow service. Friendly staff. Food portions are on small side","useful":0,"cool":0},"xUBEKKhpxiuavPV82xVdEw":{"text":"We were looking for traditional Cajun food and happened on this place - and glad we did! I","useful":0,"cool":0},"ucjuWBPXnv81s0xqOOnvXg":{"text":"I love Redfish Grill for their variety of wood grilled fish and amazing sauces. The Gumbo ","useful":1,"cool":0},"KT_WlYefbqNWkY3VafgNiw":{"text":"I just have to give this place 5 stars.   My wife and I spent Thanksgiving weekend in New ","useful":1,"cool":0},"KYD08C3A4brrtkTjj9jhPA":{"text":"Service was great, but food is ok for how much they charged and the wait time to be seated","useful":0,"cool":0},"j84S5PMH5uguQSC0af2s1g":{"text":"Food come in with very large portion! The crust of the fish is crispy, the inside is tende","useful":0,"cool":0},"6VVCnL-y5znuyFvswiYcSA":{"text":"Started off with a rather rude hostess and poor bar service. The food was not of equal qua","useful":0,"cool":0},"7X1-JVsrDj_9r3ZXV9XTaQ":{"text":"This is a review from a local used to high quality food. First time here and was disappoin","useful":0,"cool":0},"Pf86Aq3gH4BS_FZgI31NtA":{"text":"Amazing, busy Friday during jazz fest.  They sat us on time and even made a custom appetiz","useful":0,"cool":0},"W2gzLCm7X916A6-cm82EFA":{"text":"Red fish grill is the worst restaurant we have eaten at in New Orleans. We got a citrus pe","useful":0,"cool":0},"usYzP0UUFqfebG7YdfDLvw":{"text":"The complimentary bread is so delicious.. seriously worth the carbs\n\nThe fried red fish is","useful":1,"cool":1},"0j7XbH6Qmdhw5evzud4nlA":{"text":"this place had okay food (shrimp was slightly burned and dried out) but what really disapp","useful":0,"cool":0},"IAWMftw4R7VtfPSGtqG_Xg":{"text":"Decided on coming here for our last meal before heading back home from Mardi Gras. We were","useful":0,"cool":0},"NR5DHJLRHVHl6PZW9MJG6Q":{"text":"Red Fish Grill is a casual and modern dining option within the New Orleans-based Brennan F","useful":0,"cool":0},"rdFAo56obNhuqBbSzDr1KA":{"text":"So good!! The scratch made bbq sauce was delicious. Nothing disappointed us. I had the lum","useful":0,"cool":0},"B84scLOmTPTzJy2YA1nPuw":{"text":"So a friend recommended this place to me, and honestly, I'm really glad that we went here.","useful":0,"cool":0},"oNefSFH_4EevlcbT_X0Xbg":{"text":"Comida muy sabrosa, tanto el gumbo, como las Gulf Shrimps and Greens. A pesar de que el co","useful":0,"cool":0},"TDmzD2qM-Nc83Q08Fvm41w":{"text":"Really delicious food! The bar and restaurant are both fun, lively places to eat. They hav","useful":0,"cool":0},"63C-OF9H0T69lyAaK1ygGA":{"text":"Excellent Seafood on Bourbon street \nRisotto is amazing \nJalepeno cornbread is awesome","useful":0,"cool":0},"wigimKvpNVebtsD0In9X9A":{"text":"Had dinner here tonight with my family and my mom.\nMom and son had the shrimp and grits. T","useful":0,"cool":0},"mJVPu5BolkE7NiK7ivkUXA":{"text":"Such an amazing experience. We are here for my husband's birthday celebration. They treate","useful":0,"cool":0},"CtkXcTBwtRwkWSWY2PkTtg":{"text":"This place is awesome! Was with a group and our waiter was on top on everything. Everyone ","useful":0,"cool":0},"G-x1fLLM6NCLMJoTlfTo5A":{"text":"Excellent, must go! The food is wonderful - healthy portions - and the staff is top notch.","useful":0,"cool":0},"swaeQ6w2vhP7aglNNPmP1Q":{"text":"Amazing food, great service ! Highly recommend when you are in town! Our server was friend","useful":0,"cool":0},"KOPbHheXLf219nLT7QHueA":{"text":"I had reservations on open table....started out ok but went to rest room and came back and","useful":0,"cool":0},"ZV4xzDNxkuiRlFRH83xpAg":{"text":"Awesome service and it appeared they used really good / quality ingredients. I tried the r","useful":0,"cool":0},"xMAMMi9OTS3XPqKByCMY3Q":{"text":"Ask for Ike! He is a mutha f'n rockstar! He knows everything on the menu and will get you ","useful":4,"cool":4},"eeGEOG5DxcAtNqXuwBvufQ":{"text":"Amazing chocolate bread pudding! Don't miss out.  Long wait but it was worth it. We didn't","useful":0,"cool":0},"2zhXlJUqPDfkQxAogvRcJg":{"text":"The grilled gulf shrimp were the best we ever ate. Delish !!! Service was  great & friendl","useful":0,"cool":0},"rpP2GxsJOEKfQI0cahVtYA":{"text":"The place is worth visiting if you got too much money, don't mind waiting, and have simple","useful":0,"cool":0},"LHmuhFkYHbAlns68PJETvQ":{"text":"Food was good but our waiter was very rude. Our bill came to nearly 1000 dollars for a par","useful":0,"cool":0},"fc8RaSrdduiCjsoRmIzLzA":{"text":"Very nice restaurant and a lot of staff.  Our drinks took longer to be served than I would","useful":0,"cool":0},"KVbXPWnT3f2OL21ZlSAp9A":{"text":"We're a group of 10 with multiple food allergies and vegan restrictions that make our sele","useful":0,"cool":0},"dpbCo7G1xr_Mvfy7H8qqTQ":{"text":"Great experience. I have been to NOLA so many times. This visit was my first time going to","useful":0,"cool":0},"mtjDHLGXHbIwA8fTb8nhtw":{"text":"We came in on a Friday night looking for some good ole Cajun food and the menu looked very","useful":3,"cool":0},"hLcdNRbwYcicppb3k9wjpQ":{"text":"Ate here with my parents and 2 year old. The 2 stars is for the food. The service was exce","useful":0,"cool":0},"lZIpA4pTCiQdbmZ5H4pzfQ":{"text":"I don't eat fish, but I ate here and loved it! First off, if you don't have a reservation ","useful":1,"cool":1},"glDL_n71ZOvWIsFGYntPHA":{"text":"I just happened to walk by this place, which looked inviting.  It was packed, so a good si","useful":1,"cool":0},"d9aC1hurIV8lG2wmZ4dhrQ":{"text":"Love over this place . The balls and the bbq shrimp and the red fish ... YOU MUST TRY","useful":0,"cool":0},"N-eMKmMW0a20VLEpooZc2Q":{"text":"We went last night for dinner 12/17 had Miriam as our waitress and had an excellent time!!","useful":1,"cool":1},"GbFVTXJZsfEO7jshuojgjw":{"text":"Jasmine is an amazing server who knows the menu well and gives great recommendations. I ha","useful":0,"cool":0},"Y1c5D_zOJUBzkjhdFDUWcA":{"text":"My very first dining experience at Red Fish Grille a couple years ago was awesome and the ","useful":0,"cool":0},"GL0gUxADnpzK1XkFMpBN4A":{"text":"We made a reservations at 7 for a party of 13. We were seated promptly and had a very atte","useful":0,"cool":0},"gNoQdKtfHxG4e0FHeZEvbw":{"text":"Excellent food and service! Enjoyed the catfish covered in etouffe, and also enjoyed the t","useful":0,"cool":0},"zQmNeGtR7z9sExR6SMiTQQ":{"text":"I've never had a bad fish dish here. The Red Fish Grill is large enough to accommodate lar","useful":1,"cool":0},"2I4JReCzzNQDbdBWKYHYDw":{"text":"Red Fish Grill is right on a Bourbon St located its before all the craziness begins.  The ","useful":0,"cool":0},"Y7fUWlwWO4TXJbiejIjJTw":{"text":"The atmosphere is very casual. It's loud and not at all formal so you see many families wi","useful":0,"cool":0},"reN3CoRvMCh9pyeXBYps5w":{"text":"This is one of my top restaurants in NOLA.  The staff is always friendly and knowledgeable","useful":0,"cool":0},"WOtmPEsqOTb5V11_QmzO1Q":{"text":"The server was friendly and attentive but not knowledgeable of the food.  The food:\nBBQ sh","useful":0,"cool":0},"dmFUbNYDHEKA71ICEnAcqw":{"text":"One of the best seafood restaurants in the French Quarter! Our waiter Frank was profession","useful":0,"cool":0},"s5L_M3LYjta0BEPaTh-b2g":{"text":"We visited this restaurant twice last week. Once for dinner and the next for a business lu","useful":0,"cool":0},"xkcJ2y74jpqpRWd00UZZiQ":{"text":"After thinking about this place for 3 weeks and what I will order, I'll say I was disappoi","useful":0,"cool":0},"_XbDIIWs69oNkyD4GXiv7w":{"text":"Had an excellent dinner here tonight with my husband. This was our last night in NOLA befo","useful":1,"cool":0},"PDKJWXip_yd9XT83w5wX0A":{"text":"Wow! I really appreciated the decor and the kind people there. This was quintessential New","useful":0,"cool":0},"DSYgTOswCHsLg_QvA8An1w":{"text":"Great food, great ambiance, excellent service!\nHighly recommend their house seasoning on t","useful":0,"cool":0},"9A3csu0RPTrmW7xbXm1bMA":{"text":"Very good filet mignon and cooked perfectly but you go to a seafood restaurant for seafood","useful":0,"cool":0},"9OvUrc5O0YMa5EOuYHPSkg":{"text":"We loved Ike!!! Best service!!! You have to check out the traditional New Orleans fare wit","useful":0,"cool":0},"CjTDe0dcK9BzGVG53Of53A":{"text":"Had the Wood Grilled Redfish & Sauteed Lump Crabmeat and it was great. Also tasted the CRE","useful":0,"cool":0},"euBWdqgMVIPA6EnP2ET9Ow":{"text":"We decided to go for a quick bite to eat on a Sunday and were pleasantly surprised by Red ","useful":0,"cool":0},"pAck5VXXuSqBdhYni8Qt9A":{"text":"Redfish whole and grilled excellent at the Redfish Grill on Bourbon Street New Orleans Lou","useful":0,"cool":0},"uBYMrVhz1kxAP0XTWFOTEg":{"text":"We loved this place. They give you a loaf of bread when you sit down and were very willing","useful":0,"cool":0},"dmI4SQY_NqK-xKXU6fmwkQ":{"text":"Omg. Not a single item ordered was good. I just don't understand. 2 ppl ate and the check ","useful":0,"cool":0},"fNQ9ETtpu9gksuqKmjbbVQ":{"text":"Ordered the redfish sandwich and got a gross tasting ground (really!) Fish sandwich. All y","useful":0,"cool":0},"DsYAds4gO0iPqwtObmoWUw":{"text":"I had the best Grouper there! It was fantastic! The food, the atmosphere and the service i","useful":0,"cool":0},"yySTgQHB-XMy2CgXz62OMw":{"text":"The food was good. Overall the meal was good, I loved the BBQ oysters, they were delicious","useful":0,"cool":0},"Hrlo0RHtWR_b2n6JT_LeYg":{"text":"Decided to give this place a second chance. \nGlad we did. \nWe both had had our fill of oys","useful":0,"cool":1},"h6gaVIoch-rAQC_iGREC-Q":{"text":"Wow! Simply phenomenal!!!!! Beer was great, salad was exceptionally amazing ..... and the ","useful":0,"cool":0},"7v_P9LCoORF8H0Xc7PUQpg":{"text":"Food was decent. Not a huge selection. Service was pretty good. We had a large party and t","useful":0,"cool":0},"kbrFbi9LPjVIOKjy_vEJ3Q":{"text":"Our friends were dining here and called to see if they could add us to the reservation abo","useful":0,"cool":0},"CPU4HBgakrlaywk_UYvx6Q":{"text":"Located in the 100 block of Bourbon St., this restaurant has it all--great location, authe","useful":2,"cool":1},"AcHDA-RzJxDW4QcFs_lAqQ":{"text":"This was officially our favorite restaurant of out labor day weekend vacation! We came her","useful":2,"cool":1},"hm9MiCPJjoCtP2u2FNwuuQ":{"text":"Had a 7:30 reservation and they sat us quickly with the waiter coming by soon after. The r","useful":0,"cool":0},"TNvcbaDZGuQ3cU_g9e7ZkQ":{"text":"Outstanding place.  We stopped here after experiencing the wild fun of Mardi Gras Bourbon ","useful":0,"cool":0},"RKUmJ6KkKoclj7gShTJXAA":{"text":"Took a group of eight clients to Red Fish Grill for dinner.  We arrived and we were quickl","useful":0,"cool":0},"WxZg5QlqyVdQz98sUaOoUA":{"text":"Took my friend here for dinner for his birthday. Sat quickly, server was fast and polite, ","useful":0,"cool":0},"wH_DSX09Ha2Eu0mpn6AMNQ":{"text":"Going to NOLA? Flight comes in before your check in time at the hotel? Go here. Seriously.","useful":0,"cool":0},"xaWGq59Of3PQg1D1oGQDCg":{"text":"A quick but one of best lunches in New Orleans! Waitress immediately came to welcome us wi","useful":0,"cool":0},"35HPhFEJUnIWU32TaXe0eg":{"text":"Great food and services. Today they have a jazz band playing holiday music very festive en","useful":0,"cool":0},"q1auRsm8KwS04Ec12weHFA":{"text":"It was sooooo good! We loved everything, but I will start with my favorite, the Red Fish w","useful":1,"cool":1},"JXR37LLHjQBd1zXZi_c6aA":{"text":"Go here to eat. It won't break your bank and it is SO good! Delicious craft cocktails! Cha","useful":0,"cool":0},"cQBTS6da15NtLNda8gndmw":{"text":"Being in NOLA this weekend with no plans, we were gonna wing it.  Hearing the news that th","useful":1,"cool":1},"l-rrcPtkbetq6EIIH5_qGA":{"text":"I was in NOLA with a friend who was in for a convention, therefore I had a couple of hours","useful":1,"cool":1},"nrb9lnkwZmb9Uvqbzv2w3g":{"text":"This place is located right on the corner of bourbon and iberville so it was really easy t","useful":2,"cool":2},"ihjxJyj3Fh8H_VujGsGRzQ":{"text":"Highly recommend this restaurant!  Cannot say that enough.  Accommodated a group of 10 wit","useful":0,"cool":0},"-_CcQoIbifOHvl8jOiJ4cQ":{"text":"Just had a really nice late lunch here. The fried green tomatoes were the best; gumbos exc","useful":0,"cool":0},"YyPMS19wCCZ5qMSSz2v_MA":{"text":"They squeezed us in right at 5pm with a party of 8 people. Great meal and good service! Re","useful":0,"cool":0},"0fQ4gDM862uoLsFM2CKS5A":{"text":"Nice find! We wanted to try acme oyster house but the line was crazy so we yelped and foun","useful":3,"cool":0},"zHqnC1U2WhgLABDe1lJ_6w":{"text":"We were in town for Turkey day and this place seemed to fit the type of reservation style ","useful":3,"cool":0},"67diDObi-s8weaTe6Bz8Hw":{"text":"Second time here in a week! We loved the BBQ oysters. The buffalo sauce and blue cheese on","useful":0,"cool":0},"AudDUBNOISX3JZHrLLdkGQ":{"text":"I really liked the ambience the food was amazing my brother didn't think it was amazing bu","useful":0,"cool":0},"yWDwrJr_Cfvowpvw5xK0WA":{"text":"This place is a Miles Family staple!  It's a must-visit anytime any of us come to NOLA.  T","useful":0,"cool":0},"JzzB6ii9OaC6oaXRfFsi5w":{"text":"Great experience! Came here with some friends after looking for a place that could accommo","useful":0,"cool":0},"5niemqXEofe9Oal5NF802g":{"text":"Loved Red Fish!! Server Ashleigh was probably the best server I've ever had. The food was ","useful":0,"cool":0},"7zuqw6HN8RMomopgTz4hTg":{"text":"Great food, great service.  All the seafood tasted fresh and and delicious and our waiter ","useful":0,"cool":0},"xq00hrjU1urI75b2cgboYA":{"text":"My group made reservations over a month ago.  They acknowledged the reservations when we a","useful":0,"cool":0},"8HVBFA2BMSSpHx1TpohBRA":{"text":"Very good, must try!\nThe BBQ shrimp and Tasso fried rice were delicious!  The restaurant w","useful":0,"cool":0},"Pjay0ReD4yeppGdFXfDVng":{"text":"Two colleagues  joined me for dinner at Redfish this past Friday evening.\n\nThe restaurant ","useful":0,"cool":0},"eVIPquat6JW9-s9VtwGAlQ":{"text":"Red Fish Grill was the first restaurant I confirmed a reservation for dinner at when I dec","useful":0,"cool":1},"cNmTFoGYcJCdzJZ16rTxOg":{"text":"SO GOOD!! We had shrimp and grits, both red fish dishes, and jambalaya risotto & everythin","useful":0,"cool":0},"VNG0wKmhhvAfND6b5COS8Q":{"text":"In NOLA for quick getaway stint. Our server Frank was phenomenal. Knowledgeable about the ","useful":2,"cool":2},"VfywCh-EalshJU3ONmYChQ":{"text":"Excellent food, service, and location! For a super busy Saturday night, we got a table bef","useful":0,"cool":0},"y0ts2jYIEa1rxhkWjKnRrQ":{"text":"Came here due to the sign outside that said $25 bottomless drinks for two hours. We orders","useful":0,"cool":0},"XF9udkoSldWUlXxd4aKj3w":{"text":"I normally do not start my reviews about servers, but the service absolutely made lunch 10","useful":3,"cool":2},"vWAAqrc-_by6wJqcK1unvg":{"text":"This was by far the best meal we had in New Orleans! \n\nFood:\n- Land, Gulf & Grits, $29: Gu","useful":4,"cool":4},"0A1cu77pX-QvfykhYynSLw":{"text":"Alligator, catfish & crab cakes, baby life is good! Sad to hear about the Red Fish, but we","useful":0,"cool":0},"udlK1VtehnP8bR6MdD04Vw":{"text":"TIP: BOOK IN ADVANCE!\n\nI didn't get the feeling that the food was freshly cooked. The purp","useful":2,"cool":0},"Aiuhaz4Yb9o4bOjfUIfnvQ":{"text":"Came here for dinner with a group, service was great, food was average. My husband had éto","useful":1,"cool":1},"1-JQ5LnzBeguOeRpca-_5Q":{"text":"Amazing Alligator and sausage seafood gumbo was the best I tried down here in  NO.  The Hu","useful":0,"cool":0},"kMDPx_uxfavWshC5z_V8eA":{"text":"Stupidly let the negative reviews sway me and abandoned plans to dine here. After being fa","useful":1,"cool":1},"PlRAX20AcZkLXXCLGpFCtA":{"text":"Good dinner and great service from our server Benjamin! Food came out on time and was pret","useful":0,"cool":0},"rQIuJi75pzIOICoE5udd8w":{"text":"My first meal ever in New Orleans and it didn't disappoint. Our server Chris's recommendat","useful":0,"cool":0},"BUz8VKNFuC1A8qAwvNwy2Q":{"text":"Went there Sunday night about 9pm. Sat at the bar. Ordered my two favorite dishes Red Fish","useful":0,"cool":0},"TYDOYfkIkPQGg5AbDlL3eQ":{"text":"Delicious food right on Bourbon St. Worth stopping in!  \n\nhttps://blainerestaurantreport.w","useful":0,"cool":0},"8SVXc6HeyvcYuVTPonZV1Q":{"text":"Mediocre entrees. Barely saw our server. The BBQ shrimp and oysters appetizer was good, bu","useful":0,"cool":0},"IqRNrONcWS_ZPdDTmU6kGA":{"text":"The most amazing restaurant in New Orleans \nFrom the staff, service , amazing menu , bar \n","useful":0,"cool":0},"sNv2vN1_EfdooTO5bPJGtg":{"text":"omg! free bread! The bread was warm and fluffy just out of the oven. \n\nOUR server was so d","useful":3,"cool":3},"pEhTLS92BearbvZ8dppdrw":{"text":"This place is constantly packed and for good reason. It takes a while to get your food...,","useful":1,"cool":0},"lyTpCpieRcWJrVqviEYaeA":{"text":"I've passed by this restaurant many a time. It is directly on Bourbon street but today I d","useful":0,"cool":0},"zzZ-sjydZ1yiPNyXeZc-KQ":{"text":"I just came to this restaurant with a group of 10 and every single one of us have oozed ov","useful":0,"cool":0},"aabTCfp6xr9uPuhFtvd5LQ":{"text":"Food: I started with the oysters and finished with the crab cake entree. I liked the oyste","useful":2,"cool":0},"cpdH2gSZS1A-ofApexb6zw":{"text":"The food on this place felt as if they have a hired fisherman that runs to the ocean befor","useful":1,"cool":0},"RnzpTx590_g0l0EXP6BUOg":{"text":"This was my very  first introduction to Cajun/Creole cuisine upon arriving in New Orleans ","useful":0,"cool":0},"uDGg8LpcOLq8BCeHO6o3hA":{"text":"During Mardi Gras.... Got right in. A little sketchy getting here. But food amazing!\nMenu ","useful":0,"cool":0},"trlPQ_r1R_5EPkWDyVBl4w":{"text":"We celebrated my birthday here and will happily go back again. Not just because of the gia","useful":0,"cool":0},"pfFjmgyiaEB57bd_pkDNPA":{"text":"The cornbread was the best ever. A bit pricey but that is expected. Service was good. Didn","useful":0,"cool":0},"ZWID6FQkERB2DP8DKsf6aQ":{"text":"The service was excellent, drinks were well made. The food was good. My daughter had Dunge","useful":0,"cool":0},"SEr32n8LT7TOzbaF8y0_zg":{"text":"OMG!!! This place was the place I wanted to keep coming back to, but had to force myself t","useful":3,"cool":1},"e0uvpUUiL_XMy0TvilcN2w":{"text":"We just went in and sat at the bar for some quick drinks and appetizers.  We had the peace","useful":1,"cool":0},"wKTJun4eQvOZdAgehcUxZQ":{"text":"This restaurant had a lot of options as well as good service. However, New Orleans demands","useful":2,"cool":2},"s0TyA8r-sd22X0B--g9qAg":{"text":"Was looking for authentic NOLA restraints and this one definitely fit the bill. Good size ","useful":2,"cool":2},"b51DVW1_3O5kavC71fNo_w":{"text":"This place does not look like much from the outside but it's well worth a visit. Lots on t","useful":0,"cool":1},"VAjDcLnEy9aHrxz3rIICcQ":{"text":"Overpriced small portions felt like a restaurant chain. The gumbo gets a 7. The waitress J","useful":0,"cool":0},"_AAUDUcBI5zGe142ysKPWQ":{"text":"Being Pescatarian, Lent is my favorite time of year for food in NOLA! During Lent this yea","useful":1,"cool":0},"qFYIzW04RL--m7a_To6cFg":{"text":"Our server Ashleigh was awesome! Our food was great. The only thing that kept me from a pe","useful":1,"cool":2},"Rs5u0jvc52pM2yW0nHg-3Q":{"text":"I came here with a few friends for a really enjoyable dinner. We started with the fried sh","useful":1,"cool":0},"vhHasQDavQAUK9STGFS5Jw":{"text":"We remembered the tasty Creole dinner at Red Fish Grill we had on our last trip to New Orl","useful":0,"cool":0},"Eg5xddiTL9DQngS3AIk9MQ":{"text":"I have no complaints about Red Fish. Every item I ordered was well prepared and full of fl","useful":2,"cool":0},"zyHnd0zWlOYuCrRvBe4DZw":{"text":"Enjoyed our meal at Red Fish. The catfish was very fresh, bread was warm, and we gobbled o","useful":0,"cool":0},"_kvSS4EUgLPEsu0Bqo_Khg":{"text":"Absolutely amazing! Tim, our waiter, was hilarious! My four friends and I went and we all ","useful":0,"cool":0},"--RLvtDRWh7XRTdJ9eVjtA":{"text":"New Orleans on New Year's Eve! The bar area was large and in true New Orleans fashion, str","useful":0,"cool":0},"4aSVzMdeO8LKYYE00xp7Fw":{"text":"Ok so first things first BENJAMIN WE LOVE YOU AND YOU GAVE US EXCELLENT SERVICE!!!! We wil","useful":0,"cool":0},"FSMV8kXujcwEjUu7T19BYA":{"text":"The service was friendly, decent drinks and alligator boudin balls. But then I got the ent","useful":1,"cool":0},"ZixAjwx1bGaWKis8kH1jTw":{"text":"It was ok! Can't give 5 stars because the food wasn't GREAT. Definitely good but not great","useful":0,"cool":0},"RcYzM7HXLgoKrBkNZMZ_bg":{"text":"The oysters baby, devil eggs and the drinks were delicious! My friend was turned off by so","useful":0,"cool":0},"jP_5fwmK5YZCV0O-EkcBWQ":{"text":"I sat at the bar and Elijah was my bartender - what a nice young man and attentive. I had ","useful":0,"cool":0},"_dPDqSpB8uBX9TJ-ZKVW1Q":{"text":"Stumbled upon this restaurant while exploring the city! I got recommendations for many res","useful":2,"cool":1},"7HWzKXjbcSXcy6TJAT5B9g":{"text":"Excellent service - ask for Eryon! She is attentive and efficient. \nGumbo was exceptional.","useful":2,"cool":0},"DLjz0-5K0Boc7dUrtXjDtQ":{"text":"This restaurant is all about the tuna wrapped in beef tenderloin.","useful":0,"cool":0},"BTsDCWO985L85KR5pOPGuQ":{"text":"Got the roast beef po boy. It was good, messy, but good. I wasnt that impressed with the r","useful":0,"cool":0},"LDVQsqpD48Rdj-3Bg4sSiA":{"text":"Visited here for lunch while traveling for work on a Tuesday afternoon. The restaurant was","useful":1,"cool":0},"Pu-oD_XUD-PEexnx2_Ri6g":{"text":"There are so many options on the menu and everything I have tried were delicious. Make a s","useful":0,"cool":0},"wHJVcqgaWIluEhPUCc-DLQ":{"text":"Overrated. My family and I wanted to try it out because it was featured in a magazine as o","useful":0,"cool":0},"cTA83a-EDRQu6q2kCzi9zg":{"text":"I was in NOLA for a girls trip/bachelorette and we stopped by Red Fish for dinner one nigh","useful":0,"cool":0},"O3QfdTdXRacpsnTdV7DX5w":{"text":"Excellence!!! The place is great in all aspects. The ambiance is very nice, not very noisy","useful":0,"cool":0},"RmpBQVBz7Hk9VWzB5NiKIw":{"text":"WOW.   So start with the BBQ, Blue Cheese topped Flash Fried Oysters.   You will not regre","useful":0,"cool":0},"0noTtnwcsEPodGYsLuoo_Q":{"text":"New Orleans is synonymous with its food culture and one family name stands out high above ","useful":11,"cool":9},"Fli083o_9jQR8USKqc1D2Q":{"text":"My wife is the food snob and the one who likes posting about everything she eats but I fel","useful":1,"cool":0},"fFsWIdIkVxGvZ3YUPcPEzQ":{"text":"Make a reservation!!'   The charbroiled sea bass was amazingly prepared. The cook and seas","useful":1,"cool":1},"IKWE1SXSN65bITYuLhwvpg":{"text":"The mixed meat gumbo was tasty, crab cakes excellent, really enjoyed the bbq oysters, espe","useful":0,"cool":0},"htsJQPR5IEeFLDx_YJM5bA":{"text":"HAPPY HOURS OYSTERS!!!!! Is there anything else to say. These things are a good size and g","useful":1,"cool":0},"luzi35gvd7gVk5vZyIx5Ag":{"text":"Our favorite meal while in the city. My husband got their special, redfish with lump crab ","useful":0,"cool":1},"l8rlrx4O26IRoFGhCsC44A":{"text":"The food was amazing. Definitely get the BBQ oyster appetizer. We actually got the peacema","useful":0,"cool":0},"BxBSTwRXPtnncILwYC4H8A":{"text":"The food was delicious and the service was welcoming, timely, and attentive. Highly recomm","useful":0,"cool":0},"25YHbFTnS9O62GpNOgEI_A":{"text":"So on our tour of bourbon street it was recommended to me that this was one of the best sp","useful":1,"cool":1},"jvjQ_-mrGvnm3ValCWcTmg":{"text":"I've had cocktails and desserts here several times but tonight I decided to actually enjoy","useful":0,"cool":0},"ifhpfIv4JKsMFkV88culNQ":{"text":"Had just arrived in Nola on Friday night.  Had made my reservation on open table, had hear","useful":0,"cool":0},"RS_LlD7z_TCoFXz-dtnjzQ":{"text":"Red Fish Grill saved me from an awful hangry spell. We decided to take a chance on sitting","useful":2,"cool":3},"8cBCAe27__GA6q9pllL2WA":{"text":"Overall an excellent experience, very good service, tasty dishes, everyone in our party of","useful":0,"cool":0},"-ncC7Yrs8TTqbNn5Cw0mVQ":{"text":"Absolutely delicious food, loved the swordfish and the chocolate bread pudding! The establ","useful":0,"cool":0},"nNTZxzi3cKyuZgaQ5HTJaw":{"text":"Service was very good but the food quality has definitely declined.  Left after subpar app","useful":0,"cool":0},"tbM5MoUsqWNSCSOkGZUrNg":{"text":"Stopped in for some happy hour raw Oysters which were 50 cents a piece and super yummy!  (","useful":0,"cool":1},"LZm980XkDkcSlNa1giipAQ":{"text":"I had never eaten red fish or even heard of red fish before eating at Red Fish Grill. This","useful":3,"cool":2},"_WoXaRqEWJy4kr5JyeuIKQ":{"text":"First of all....thank you to each of Red Fish Grill's employees who served many locals and","useful":3,"cool":0},"IMCCONFdyWKxLHrRl-9MMQ":{"text":"The oyster and shrimp appetizer was really good.  Bread was good.    \n\nI wasn't in the moo","useful":0,"cool":0},"acabpm53INRqOdnBvqKYTw":{"text":"I.  LOVE.  SEAFOOD.  SO.  MUCH.  \n\nAnyways, I was with my father, looking for a lunch in t","useful":0,"cool":0},"qyZyvr5LKM3mv9BTG7Zn8w":{"text":"I've always walked right by this place on my way to the famous Acme restaurant around the ","useful":1,"cool":0},"0O-xc_D7F_zLj4R-qDieAA":{"text":"Jamie W. and I weren't in New Orleans for more than three hours, and already we were at a ","useful":9,"cool":7},"Nn7JZP21Qj-3zeGf0XL5TA":{"text":"Had a fabulous dinner tonight. My son inhaled his bbq oysters and shrimp. The butternut sq","useful":0,"cool":0},"QJKMhpR3Dckv1x0_bzxDkw":{"text":"I was very happy with my recent visit to the Redfish Grill.  I had a 4-star food experienc","useful":4,"cool":2},"CS5qwpcLbTBZDbF8ZiKBUg":{"text":"Red Fish is new(erish) eatery, as so many joints are, in Norleans these days. I was so imp","useful":4,"cool":4},"8mA495sMHBSiQLzz0KcDKA":{"text":"I attended an event here and I really wanted to like this place but it just didn't do it f","useful":1,"cool":1},"GuCuqIXqt_OOIIVmnnV2NA":{"text":"We needed a place to eat and didn't want to wait in line so we chose Red Fish! I gotta say","useful":0,"cool":0},"1tCrukEmp1xKZfER-VaauQ":{"text":"Our server Mr. Ike was very good and attentive! Hands down one of the best food we've ever","useful":0,"cool":0},"nG5TEHF5DiNgWnV1LZ_XiA":{"text":"Like many other French Quarter restaurants, I expected the food at Red Fish Grill to be ov","useful":4,"cool":1},"2kiurGt0v6HJXTAp6aKb2g":{"text":"Relied heavily on the suggestions of our server and she didn't disappoint! I ordered the A","useful":1,"cool":1},"9fxubcwqVrYjJTQr9ix_iw":{"text":"Very average tourist spot,  Food is not very memorable, I wouldn't make a special trip to ","useful":1,"cool":0},"QubfmIUgGwaTJDJkw2Sx_w":{"text":"Great location food was very good shrimp and grits was delicious and the bread pudding a l","useful":0,"cool":0},"azpeF8uE3E0GnyjsOCQXQg":{"text":"Delicious dinner. Lots of items to choose from. We started with the Peacemaker, oyster and","useful":0,"cool":0},"pPfqpwG5CzewLMyPoOVXgQ":{"text":"Very delicious! We had the stuffed shrimp appetizer. The filling in it (whatever it was) i","useful":1,"cool":0},"TiznB8esDvv6eAMcpM39dw":{"text":"Sat st bar and got the award winning oyster Po boy for lunch. I substituted sautéed spinac","useful":3,"cool":2},"GAhVzCFDHgJwaMw9_cXpTA":{"text":"The service was amazing.  We never had to ask for everything, the waiter observed and anti","useful":0,"cool":0},"sO_9RRxt7wBeHOezm2zkmg":{"text":"Sooooooo.... I will start this off by saying Benjamin was awesome!!! I want to give you 4 ","useful":0,"cool":0},"_3WdeLwmJdTCQQH4tG33LQ":{"text":"Wowza! Located in the heart of Bourbon street this was an excellent find.  Great raw oyste","useful":0,"cool":0},"G3F5RLnU9AQTfQFtjqpUkQ":{"text":"The BBQ oysters was somewhat disappointing. Good taste but I expected fresh oysters in the","useful":0,"cool":0},"I2Z45qNukTQq1Omq5fIHtw":{"text":"We stopped by for after dinner drinks and desert. We had the bread pudding and the cream b","useful":0,"cool":0},"KNxj0_0nXMyvUal1Ysbcsw":{"text":"Beautiful large space.  We had the Valentines weekend special -crab legs!! Huge portions. ","useful":0,"cool":0},"55Ft3X0LDtGbfs2T2IHzAA":{"text":"It's fine enough for a chain. The gumbo is solid, BBQ shrimp is fine. Cocktails are good. ","useful":0,"cool":1},"CrKO484O5reHtB_Sx9iRSg":{"text":"I had the Snapper and it was delicious. I had it with the lemon butter sauce. I will defin","useful":0,"cool":0},"Ism_biS-W-Zq7OMivXu4YQ":{"text":"This is probably one of the better restaurants in the tourist area.  I usually find myself","useful":1,"cool":1},"wS3nk7q59sukKWYLNDAgrg":{"text":"An amazing brunch. Service was consistent and winning!!! Food was so good! I would def rec","useful":0,"cool":0},"wZNJ7It5oNEaiHF_nqXYAA":{"text":"I had a good time sitting here at the bar watching all the action from shucking the oyster","useful":0,"cool":0},"jJWOmOhS0uJ-ieKbV8YkQQ":{"text":"I went there with my family of three. Every dish we ordered were delicious. The only compl","useful":0,"cool":0},"IisoRwQPkPrcZTcj2JP6cw":{"text":"Went here for my girlfriends birthday and was served by the famous Ike. He provided a grea","useful":0,"cool":0},"8XdDQlGKCLgj3A--JLRXGA":{"text":"Red Fish may not be the best restaurant in New Orleans, but they do have some great dishes","useful":0,"cool":0},"ZerSHfrrPyTVJn-LejE40g":{"text":"Elijah was our server and he was fantastic. We were disappointed because the menu was not ","useful":0,"cool":0},"LdxlTzR3N5h2ENQi2k-9AQ":{"text":"This spot was recommended to me and my mom by a wedding planner in the area. I am SO GLAD ","useful":0,"cool":1},"1W1x5-5WJUvH07zqpYmBIg":{"text":"Celebrating my 52nd Birthday here was so special and memorable.  I was surprised with a ta","useful":1,"cool":1},"oNqW4H2i0gXz6Sn80tyv5g":{"text":"Amazing food with amazing service. My friends and I came to New Orleans for a girls trip a","useful":0,"cool":0},"DwZ5myvdxGbR_Ju7sCUChQ":{"text":"Foodie here!  Another review for you other foodies out there!  This was a recommendation f","useful":0,"cool":0},"kagsXUJm7pF7B5Lck4WecA":{"text":"My mother and I tried this place our first night in New Orleans, excellent food!  Had the ","useful":0,"cool":0},"YzWRs5E6pTy5aMR6MiuGaA":{"text":"Good food! As I was walking down Bourbon St I saw this place and I just knew I had to eat ","useful":4,"cool":4},"d_z9FM84sbL3dZtlQoI2CQ":{"text":"Food was delicious and the staff was helpful and polite.  Our table was ready on time and ","useful":1,"cool":0},"ixNAOXMjSTk0d7FruE0Z3w":{"text":"Great food and a place where a few good people in new orleans unlike the scum at harrahs. ","useful":0,"cool":0},"UTFpg0yUXA4S7wpOwRXMGA":{"text":"One fo the best places to eat on NOLA!!! businesses need more Kevin's(this was our waiter)","useful":0,"cool":0},"mFzrZ7SSLkyUBkGXhgE-Pg":{"text":"For our last meal in New Orleans, the hubby and I decided to go to the Red Fish Grill.  It","useful":19,"cool":18},"9VV3On5mGZMFP6fxEN8eBA":{"text":"Yeah....5 stars.\n\nWe walked the seedy bourbon st. Had enough of the ill bet i know where y","useful":1,"cool":2},"sQi6VIDH8XK9YL0kIqIaJQ":{"text":"It all began when we entered the restaurant and no server or staff member greeted us or lo","useful":0,"cool":0},"3SAmXoI4wRjsNGYIkm49RQ":{"text":"My husband and I each had the black drum fish prepared in different ways, and it was delic","useful":0,"cool":0},"1hK2sK0ln8pToLg8-rxPQA":{"text":"The food was absolutely STUNNING and delicious! Great atmosphere, and James was amazing!!!","useful":0,"cool":0},"wS5vAV2N-4wG5dYwE_i44g":{"text":"The crawfish roll was disgusting. The roll was stale and the crawfish was very bland. For ","useful":5,"cool":4},"i636uvw988N9l0Ef60cnUw":{"text":"Absolutely delicious restaurant. Waiter was extremely attentive, and was extremely friendl","useful":0,"cool":0},"mNZBIx8-jmdnb1jMBw027w":{"text":"We came here our first night in town. Loved the fun decor, which was of course the fish th","useful":0,"cool":0},"p53X_LGRy4EbtsYRtzmrRQ":{"text":"Had swordfish daughter had grilled drum and wife had shrimp and grits. All dishes were del","useful":0,"cool":0},"Mta4z0aXRRAT2-ncygBj5A":{"text":"This is place that has gotten everything right from the service,drinks, appetizers, and of","useful":1,"cool":1},"h-NaS-AafJea3KORtBHvrw":{"text":"This is one of our favorite places to hang out at the bar.... (we have eaten in the main d","useful":1,"cool":0},"7SKeAG46hLfEU_aR-Tlvqg":{"text":"The food was so delicious that we decided to come back for a second time during out trip. ","useful":1,"cool":0},"Og5DX7x-yn-NgE9CvVC_3w":{"text":"Very crowded. All seafood. Good variety of seafood for those who don't like oyster. \n\nComp","useful":3,"cool":0},"PgRacQe7aewxKTOZHAQ2LA":{"text":"Wood grilled striped bass was terrific, and the chocolate bread pudding was an unusually d","useful":0,"cool":0},"ZeiuE2-nfIDdi4fx1xmaWg":{"text":"Little embarrassed by this one, the Grand Isle Salad was awesome. Yes, I had the salad, ye","useful":0,"cool":0},"tfoW9m5LArjQEoMNl2sIyw":{"text":"Superb food, good service, great drinks and a comfortable atmosphere. Recommend the red fi","useful":0,"cool":0},"CYd8aLX4p_V11481D1BCYw":{"text":"So glad we stopped for dinner here during our last night in New Orleans! You MUST stop her","useful":0,"cool":0},"CII8zTPsIaj-dvgGeJ_r-g":{"text":"Great experience at Red Fish, even during phase 1 of Covid precautions, they did an amazin","useful":1,"cool":0},"C3N3_0TQB2vrwTidRe3K9A":{"text":"Asked the waitress for her favorite dish... She suggested Wood Grilled Black Drum & Gulf S","useful":0,"cool":0},"jlwTACXSzP56m09fb0HH0g":{"text":"Why I Loved Redfish:\n\n1)  Recommended by several N'awlins locals.\n\n2)  Easy last minute ta","useful":4,"cool":4},"_wMh4hf2PGkmjRXbjCUxOA":{"text":"One word.  OVERRATED.  From the oyster bar, to the bar, to the table this place is overrat","useful":1,"cool":0},"xVWq2CMsCJdBM5W-r2IfSQ":{"text":"Good food and acceptable service.\n\nThe mixed salad was the highlight of the meal. Salad co","useful":0,"cool":0},"0NuxKnQut3Lf2N8CFftMDQ":{"text":"My aunt, who I have never met in my entire life was coming into town for a week. Her first","useful":9,"cool":9},"BlixF8yNCEFbrdw1AyzFmQ":{"text":"Everything was perfect!!!! I literally still can taste the food from this place if I close","useful":0,"cool":0},"za30PCDQHD_im0qtVbrLYw":{"text":"Ate here on a Friday PM. The service was excellent. Our waiter's name was Frank. Always he","useful":0,"cool":0},"5-L8Cg6UBbumOoqRzIhAtg":{"text":"Had an amazing Birthday dinner at this place.  The food was amazing.  We had Mushroom stuf","useful":2,"cool":0},"ft3SAqsa5xuvQH_AQVdSaA":{"text":"5 stars baby, I'm doing it!\n\nI tried justifying 4 stars, but really I couldn't find fault ","useful":1,"cool":1},"fnqIzziVh-Wsl-cPP66CCQ":{"text":"This restaurant was a recommendation from a local and it was the BEST MEAL...Let me say it","useful":14,"cool":12},"LO6Gbzem0jKt6840epCWDQ":{"text":"Excellent ! Service was perfect ! Must get Catfish  Bites for appetizer ( so good - love t","useful":0,"cool":0},"xADVrR4inp5KO1SXoO-iHg":{"text":"Boy, this used to be my favourite spot in New Orleans, tho I have not been back for over 1","useful":0,"cool":0},"BtFxoI2xKzkwlORhUkRRnQ":{"text":"Came here with some colleagues...  fellow yelpers didn't let me down... came with 3 other ","useful":1,"cool":1},"7zmJRTTYnFZaaE_m8sZyEg":{"text":"I had a previously enjoyable experience  here, and kept them in mind for the holiday seaso","useful":0,"cool":0},"rsIAtD-4um4Ns4ShCZoFFw":{"text":"I love Red Fish Grille and hadn't been in a couple of years. The service is great and the ","useful":0,"cool":0},"0DKfyS2ehKTq5J60tjUrXA":{"text":"My wife Peggy beag our cruise and returned to NOLA 7 days later, staying for an additional","useful":0,"cool":0},"wz6Y5B0ap_WM_TAnLK5WHQ":{"text":"Came in around 9pm on a Tuesday with a reservation, but it was definitely empty, so could'","useful":1,"cool":1},"hLiLgsVwrgLP1iHp6g3VTg":{"text":"Service was excellent food was out standing.","useful":0,"cool":0},"yPVHnzo5WNlVNGhfXZHXKQ":{"text":"Delicious!! The food was excellent! The service...The service was excellent! Which is so h","useful":0,"cool":0},"iaV1La7eJg5gSu6qXpMrQg":{"text":"The BBQ flash fried oysters here were phenomenal. We went on Friday (7/25/14) and it was s","useful":0,"cool":0},"99Pk-EFBKhWW8yzvONwDCQ":{"text":"Not only was the $40 steak smaller than my fist the mediocre excuse for a potato pure was ","useful":0,"cool":0},"x58b_M4rNvLDGELiz1RRGg":{"text":"Yoooooooo. Cajun shrimp rice, Shrimp Bienville,  Alligator Sausage & Seafood Gumbo and Woo","useful":0,"cool":0},"_nfHab0msiqtnx_a0_lx0Q":{"text":"I stopped to eat here as a recommendation from my Uber driver. The food was great our favo","useful":0,"cool":0},"HFetM5tIxk1LL64d8tSiTA":{"text":"Very average food especially considering the high price point. Red fish is the name and th","useful":0,"cool":0},"QLHdhBzNP-wwVBs_voqanw":{"text":"This place literally made our night!! Not only was the food amazing but James our server i","useful":0,"cool":0},"wl8O2IBooIqYyOcK9LMUpw":{"text":"The food was great !! I had the grilled snapper which was awesome, wife had shrimp over gr","useful":0,"cool":0},"Tp4CrWnJMROxbLLdiPbFDw":{"text":"YUM. \n\nRed Fish Grill is a treat. First off, it's on the end of Bourbon Street, so the cro","useful":3,"cool":5},"OcESm2Ab8GZLoB1Kj647BA":{"text":"Excellent food and drinks with terrific service (thanks Amy)!  Prices are more than fair f","useful":0,"cool":0},"mu3dMd4eAC1Tp4JVD3TdYA":{"text":"Gurl! Old Fashioneds are to die for! Had the oysters! Fantastic! Filet, alligator boudin, ","useful":1,"cool":0},"OKIxH6x91-JY0eCKQmtsTg":{"text":"When we visit New Orleans we always have dinner at Red Fish Grill at least twice.  That's ","useful":0,"cool":0},"tRUsxVS4-dhBASYjg8o_3g":{"text":"$16-$19 LUNCH PRIX FIXE, 2 courses; average-sized portions so not really splittable;\nCOURT","useful":4,"cool":1},"OPbE_rsO7gWHrMpvAqXtHA":{"text":"Our last meal in NOLA. Very nice inside we were seated right away.  Friendly wait staff an","useful":1,"cool":1},"lpzcEsf-fWB5x7tsO-5xHA":{"text":"This was the BEST meal in the New Orleans. Our family came in a few days ahead of a cruise","useful":0,"cool":1},"Nwyd-tP_G4ufamrNoBU4SA":{"text":"Perfect way to enjoy Red Fish... order the Frozen Bourbon Milk Punch, acrossed the street ","useful":9,"cool":6},"mKuk5xgMX9DalfZ5_M82jw":{"text":"The brunch at Redfish Grill was the best. I've never had better gumbo. The grilled Redfish","useful":0,"cool":0},"drD64nPr4jQZFb30r5TuOg":{"text":"Had dinner here.  Oysters for appetizers-- they didn't taste the best but we still finishe","useful":10,"cool":8},"IlCjVHlo-jbQgkPvP3wohg":{"text":"Keep it off your list if possible\n\nGood: Wagyu Burger sans soggy fries. It was a tasty bur","useful":2,"cool":1},"Pti5KQsh7ovWiGgqj_38iw":{"text":"We came here to eat on our first night in New Orleans. We came into the restaurant about 8","useful":5,"cool":3},"yl7kUS_SdUf8yBd-Mmwvag":{"text":"This was my first dining experience during my stay in New Orleans. We tried the alligator ","useful":0,"cool":0},"yrrMQnzMFuxgZQ5EUAXCAA":{"text":"Came at 4:00 on Monday 12/30 and there was no oyster or drink happy hour as advertised.","useful":0,"cool":0},"wulGNyW3OsNl1VBpY_iwYw":{"text":"Our waiter Jeff was amazing.  He was knowledgeable of the menu, gave us great recommendati","useful":0,"cool":0},"F7nksbctl56Bm4e-SQNkZw":{"text":"Decent place right on Bourbon Street, but not a rave.  I think I had more fun flirting wit","useful":0,"cool":1},"rU5lGAxtIOsCaw0l4CWgRw":{"text":"This was my first visit to the Red Fish Grill. I came for lunch on a Friday afternoon, it ","useful":0,"cool":1},"1OuxNix_dETr70RXH5OxCQ":{"text":"Red Fish Grill is located along Bourbon Street near the intersection on Iberville in the h","useful":4,"cool":3},"eaheYJLE3Nu0K24RFIefug":{"text":"My friends and I stumbled onto this spot when looking for somewhere to eat for dinner as w","useful":0,"cool":1},"NhCnD_TBlDXOxHB0UtVKLQ":{"text":"I thought this place was fantastic!!! We put our name in on a Friday night and waited abou","useful":2,"cool":1},"ZvYqEMQdF8MQHNhMagwZiw":{"text":"The restaurant was walking distance from our hotel, made a reservation online and really w","useful":0,"cool":0},"7H4ee7a-j5Z1tQ_AQcjswA":{"text":"Redfish grill was always one of my favorite restaurants when visiting New Orleans for the ","useful":0,"cool":0},"jdvYvJTXFta3L9MRR4rSqQ":{"text":"Just to start off, it was noon and by then we've had over a dozen drinks so we needed a br","useful":6,"cool":6},"i6o3Fbzosld_YEG20Iu_eg":{"text":"This spot was right off Bourbon St near Canal St. The ambience is nice and the food was am","useful":0,"cool":0},"v66nNX4z0sNsTgTQZmbFvA":{"text":"The food here is incredible and flavorful. \nWe tried the Gumbo, the BBQ Oysters and Shrimp","useful":1,"cool":0},"35pOZUMRscFRRMp6vlPW0A":{"text":"This place has long been a favorite of mine. The BBQ Ousters and hot fresh made to order C","useful":1,"cool":1},"r8WzmyIEica9_GSqvv1zyg":{"text":"Yes, Yes, Yes!  You must eat here and try the bbq oysters and the gumbo.  If you are looki","useful":1,"cool":1},"ZhPvtijWQJqKx0DAb9JvvA":{"text":"Without a doubt, one of the best meals I had over the week in New Orleans. Our server was ","useful":20,"cool":15},"fbZ9zpPffx8Eh3ak0cBfjA":{"text":"So this is one of the few spots I was able to make a reservation at during my tip to New O","useful":0,"cool":0},"wfx4XgUuD7o-WmUHcgasLQ":{"text":"What an outstanding meal!  The BBQ oysters were off the hook. Some of the best oysters we'","useful":0,"cool":0},"JS33ZK9DtqQJ_mdvlTlncA":{"text":"Went to Red Fish on Sat Nov 28.  Wow was a disappointment.  Just terrible.  I don't mind s","useful":0,"cool":0},"ow8KC_-OXQ-ECh3fWF3Igg":{"text":"We made reservations while in town to take our two kids and ourselves to a nicer dinner an","useful":1,"cool":1},"Rd8arjo25EjDeqJJ47XQ1A":{"text":"Minus two stars for the woman at the front seating people. This was Thanksgiving and there","useful":2,"cool":0},"uLRNJEbRp_mWPkHTS2orMg":{"text":"My family and I decided to do a destination thanksgiving this year and chose this restaura","useful":2,"cool":2},"o1b74W1xEHhbUa3GrZXk8w":{"text":"I come here for the barbecued oysters. They are flash fried and then covered in a Crystal ","useful":2,"cool":0},"yTj-zRp0g-zOyVW5Mmii8A":{"text":"I had a lovely, lovely meal here and will definitely return.\n\nThe menu is creative, but st","useful":1,"cool":1},"QXcmtxkxPp4sSItoeiNIVw":{"text":"This restaurant is located on Bourbon Street as soon as you turn off of canal on the left.","useful":1,"cool":0},"ZlhJKgGkraNvFi-r6yvBUA":{"text":"As my lovely dinner partner said...this food is a party in my mouth. My amberjack, which w","useful":0,"cool":0},"2fhPxZ5BL9N63fKwrE1Z-g":{"text":"I came here last time I was in Nola and got the crab cakes (which were bombbb). This time ","useful":1,"cool":0},"LANOWPdN_hRLBenwSVRalg":{"text":"Happy Hour $0.50 oysters, child! Bar only and that's all you really need in life... and so","useful":2,"cool":2},"GmZ0oQ88dSM7sFA0snDi-g":{"text":"It was our second stop on not being able to decide where to eat on our last day in NO for ","useful":1,"cool":0},"fiF1bz7nIwgBtBw_kYJZpA":{"text":"I have to be honest.   This time we went the food was very disappointing and way over pric","useful":1,"cool":0},"d2s7GSDO3V32iHBGbgkOtg":{"text":"Everything was amazing from start to finish. We had great food, great drinks and great ser","useful":1,"cool":1},"N6EGnHiTH-LDy4_nhdM9og":{"text":"We picked this spot because of the reviews and list of foods and desserts sounded good to ","useful":1,"cool":1},"LGw3T8qIv-8pnRi_uED8Yw":{"text":"I mean if you go to New Orleans and don't eat here, YOU ARE MISSING OUT. This was the best","useful":3,"cool":2},"62fGa6RjOAgpN8n4rB9TQQ":{"text":"Hands down - one of the best restaurants I've eaten at! Not fancy, but definitely fantasti","useful":1,"cool":0},"1d-9J64CC8tlmzFl-saopA":{"text":"Never disappointed! The atmosphere, service, food, and drinks all amazing! My family enjoy","useful":0,"cool":0},"pIp9XAGkurTC2iC0qBVsfQ":{"text":"I ate there tonight with my son tonight. We wanted a good meal before leaving tomorrow for","useful":0,"cool":0},"5TpKQtSKIhuZFoMPWEdGOA":{"text":"Omfg, the best shrimp and grits I've ever had! And I'm a local y'al! \n\nOk, I took off a st","useful":7,"cool":5},"mr-1YUs047UEF25jZuFSnQ":{"text":"There aren't very many places that serve oysters for less than a $1 a piece where i've bee","useful":1,"cool":0},"pHIrpvN1yvDwhzV0ZanBXw":{"text":"Nothing but goodness here. We came for happy hour and had 75 cent raw oysters and $3 local","useful":3,"cool":3},"l98-k4ODJScd13heEcVfkA":{"text":"Can't say enough about how great this lace is.  We had a reservation and were seated on ti","useful":3,"cool":2},"liSzi10OM9tPKOvtpkq4pw":{"text":"Amazing!\nWe had Frank as our server.  He was awesome.  He has a serious exterior but gave ","useful":1,"cool":0},"uyB5XA8XEkQLcTJXkaeo5w":{"text":"Yowzah! I visited Red Fish on a Monday for a simple, late lunch. It was not crowded, the s","useful":4,"cool":4},"CnBFLlVPSkOp2a6nfrSw4A":{"text":"You would think that being raised in New Orleans I would have eaten at this local favorite","useful":7,"cool":4},"6CfPKgvaTiRWADJXT6PgPA":{"text":"i'm so hungry. and it makes me think of Red Fish Grill. I want the BBQ Oysters and the Red","useful":3,"cool":2},"NduA5OHaShBx043dfzPTsw":{"text":"I have to say this place was much better than I had originally anticipated! I had initiall","useful":3,"cool":2},"ov45cSV7IHc_CL9yNRsISg":{"text":"I was very skeptical about eating on Bourbon street, but our Frommer's New Orleans 2010 gu","useful":1,"cool":1},"Qs6WFhjYQzjvcLB88OJRoA":{"text":"2.5 stars.  \n\nThis is my 2nd trip to this restaurant.  Last time, it was for lunch, this t","useful":1,"cool":0},"4vi3u4HPdTakmRDRVK4pnw":{"text":"I'd like to kick it up to 4 stars, but I'm not a fan. There was nothing wrong with the foo","useful":1,"cool":0},"LkAZaco1ojDRqyPMBEYTYg":{"text":"I make a point to eat here every time I go to New Orleans.  The wait service and the manag","useful":0,"cool":0},"nliNXvGIVJ52v2AaqDZ-rQ":{"text":"Oh man. I've been here twice now. The first visit was about a year ago, I had a great expe","useful":4,"cool":0},"cwDmIEL62meRqjUHfPm3eQ":{"text":"Definitely a great place to go for weekend brunch! Food was really good, drinks were spot ","useful":1,"cool":2},"E2Qf9KC4PziI4VrLHbOu-w":{"text":"First of all the service was amazing tonight. Shout out to Ike for making us feel comforta","useful":2,"cool":1},"yhI7vLRrKVTB_y7zU9kuvw":{"text":"Staff was really friendly and my kid fell\nOf the chair while trying to do some tricks . Th","useful":0,"cool":1}}