{"NEIeDf4FKuIJ_qLZ5paupQ":{"text":"This place is truly a class act steakhouse. When we first arrived for our reservation we w","useful":0,"cool":0},"5ixEu8dqBcXmQ7ft73DwAA":{"text":"Went there before the theatre and had to leave without eating dinner. It took over 40 minu","useful":0,"cool":0},"LiMkPWOoOrv-SHfek6Yk8w":{"text":"Cocktails were great. Seasonal salad and wedge salad both delish. Filet cooked rare was pe","useful":0,"cool":0},"c4cQTJ-dx_gn8dnruwCEcw":{"text":"Best Dinner Experience I've ever had! Came to DB Steakhouse with a group of friends just f","useful":0,"cool":0},"4UntCkWB3drNlJKa6rl6lA":{"text":"The meal gets a five but service a three.\n\nMeal, possibly the best of my life. So amazing.","useful":0,"cool":0},"90FOdi0_ZtFBPalzDmMtCA":{"text":"Once-weekly lunch and every dinner had great service, good setting, excellent service. Exp","useful":0,"cool":0},"KQ4p-2UO4MSeE93Wlv3CGA":{"text":"I wasn't impressed with the actual dinner - ordered Shrimp Fettucini with creole alfredo a","useful":0,"cool":0},"twsILgLknbT0FAWyEaBMXQ":{"text":"The gulf fish just melted in my mouth, and the other three in my party gave the steak five","useful":0,"cool":0},"wkoWDlVchgafHACpt2NkIw":{"text":"Bring on the meat!\n\nWhile I was here I heard great things about this place.  I've been mak","useful":0,"cool":0},"3KG-mF0VscFqWfQrZXmtcw":{"text":"Wonderful!  We were seated in the bar area, which I wasn't thrilled about.  They put us in","useful":0,"cool":0},"kSizWFaxsL4WmotdZwrtRA":{"text":"If you are familiar with this establishment, you definitely know the ambience is outstandi","useful":0,"cool":0},"sWHk_HEC96NDSsrwnqBzCg":{"text":"This place was kind of a big disappointment for me, but that's probably because of context","useful":0,"cool":1},"_LzrYw1OJJDkHjhgoJMeAg":{"text":"We actually had Happy Hour in the beautiful bar.....which was lovely.  The service was top","useful":0,"cool":0},"o5XzprbHA5Blns2NKlbNBQ":{"text":"This is an excellent restaurant to visit for some seafood and steak. The ambiance is exqui","useful":0,"cool":0},"HEDA0LKWkRTiG-g__obnoQ":{"text":"While staying in New Orleans we came to Dickie Brennan's for dinner.  We were very impress","useful":3,"cool":0},"pKGactV2w5ftLckR5RLRqg":{"text":"A nice atmosphere. Food was very good. Prices were a bit high but okay spice the food was ","useful":0,"cool":0},"Giy6EN3bWkALo2RK_5DsqQ":{"text":"We're always looking for the elusive perfect happy hour. I wish I could say I found it her","useful":5,"cool":1},"-oQ01j_7GkFibWqfvawyNQ":{"text":"$5 after 5pm (til 7) includes 5 savory small plates & two cocktails (Spikes Arnold Palmer ","useful":1,"cool":1},"xFmoxjGKf8hbipNUfjqTrA":{"text":"Top notch service and food.  We got the seafood gumbo, cowboy steak, potatoes au gratin, w","useful":0,"cool":0},"lWX7PZ6O0WAv1MP1YqZQbA":{"text":"Wow-What an experience!  From five star service to outstanding food.  Three people waited ","useful":0,"cool":0},"5HboiV3ZsDj3WicwzHRhiA":{"text":"I called the restaurant a few days in advance to make reservations. Told them my husband w","useful":0,"cool":0},"uJING6RCR5Vu_hiPk4lFXQ":{"text":"Well, our evening started out a little confused. Made reservation for steakhouse, but star","useful":0,"cool":0},"j9uEmz-knbd1xul-Z2GnSw":{"text":"If I could I would give them absolutely no stars for this horrible place. The host was jus","useful":2,"cool":0},"8DBoUQ9GybAfAANcmnOQdQ":{"text":"Been here many times, always great. Service always professional and polite and super. Can'","useful":1,"cool":1},"ejs84NPifHNNZIJiiAqqyw":{"text":"This review is from February 2017 \n\nWent here our first nice with a group of people for di","useful":1,"cool":1},"UQ3ceVE4RMHboxVlc_3s5A":{"text":"Food was great and service was great.  I had a great 24 oz (cowboy cut) medium rare rib ey","useful":0,"cool":0},"8yGhf0Cp8wMcln8Jm03cPw":{"text":"This Brennan's is a bit better than most, but with a steakhouse there's a lot less variabl","useful":0,"cool":0},"HqK_9yIHviugv4y8dkEQOQ":{"text":"Horrible, they have no customer service.  5 of us there and our steaks were raw. We sent t","useful":0,"cool":0},"rvdLVOEbtdzZSPAFHkiqTA":{"text":"Best steak I've ever had. First time to New Orleans and I will never forget this meal. Eve","useful":0,"cool":0},"NAqQFtXkLUbM5UskkEPgAA":{"text":"Seemed a bit overpriced in my opinion, and the service wasn't quite there. Quality of the ","useful":0,"cool":0},"0w4s-e5QlVlVblBKqVXbMQ":{"text":"Had dinner here last night and was disappointed by everything except the service.  I rarel","useful":0,"cool":0},"FWMBhzyTgD0lX5GeJ9XAYQ":{"text":"Our family of three made reservations and were seated within a few minutes of arriving. Wa","useful":0,"cool":0},"IuNF_t1zt6Lylq1oOvZUAw":{"text":"When my  Polish traveling companion and young American friend wanted \"mild\" fish not seafo","useful":1,"cool":0},"4_3W_AuEVKm3mJ8YsE5flg":{"text":"I find myself coming here a few times a week whenever I'm the FQ. It's quiet and subdued. ","useful":0,"cool":0},"r7EG9iH0fxTDmahoseaP2A":{"text":"Bar staff super friendly and knowledgeable, excellent drinks that were reasonably priced. ","useful":0,"cool":0},"kf4iR00CNSLkF_iTzr37hw":{"text":"Great Steakhouse! Very nice place compared to all of the other places nearby. Very upscale","useful":0,"cool":0},"Gdm8GQl17XJkxJr-PUvREg":{"text":"This place is right between 4-5 stars.\n\nPros: Service was pretty good, though our waiter d","useful":0,"cool":0},"gWU2S3A4_8uTPf2jhiQNzQ":{"text":"Quite  possibly the finest steakhouse in north america. I had a perfect ribeye there and h","useful":0,"cool":1},"OrCPGC5Nt0pZd43x6Zq9gA":{"text":"We enjoy eating in the bar. It's upbeat and cozy. Excellent menu. Best steaks. Prime rib c","useful":1,"cool":0},"pLaiswZJxJdSZVtq2bXKcg":{"text":"Dinner took 3 hours for a party of 7. Steak was terrible and the waitress was even worse. ","useful":0,"cool":0},"AehY7ePfwParw1j8mADw2Q":{"text":"Eh. I went here for prime rib and they were out of it. How does a steak house run out of m","useful":1,"cool":0},"e4NjFfA1VIWkeJ4_TkinAA":{"text":"Excellent steakhouse!!!   Delicious food with impeccable service!   Justin and his team en","useful":0,"cool":0},"zB9O09La--xWb8gh8xBC_g":{"text":"Went there for the first time last night.  I made reservations 5 days prior, for 7:30, 2 p","useful":1,"cool":0},"_hhohVJyKVekbPiYkw5fdQ":{"text":"The lighting is very cold in this restaurant.  Seems like they use flourescents... Doesn't","useful":0,"cool":0},"ptIV8BqHQVPBUAupgFF3yw":{"text":"Their 24 oz. bone-in ribeye is to die for. This steak was simply seasoned in what it appea","useful":0,"cool":0},"l9Rtmo87yUaa7KJ7zjzbyg":{"text":"Wonderful from start to finish.  Dickie Brennans is located in the french quarter. However","useful":1,"cool":1},"QyONTwZ1kp7FHfhP_j_gBA":{"text":"Best steak I've had in a very long time! It's a pretty fancy place the atmosphere is very ","useful":2,"cool":1},"a2zlgLwUBgQioRI1e5nhYg":{"text":"I was looking for a great place to celebrate the first friend I met when moving to Austin,","useful":0,"cool":0},"5b1rOxdSDntMmewnNH2V7A":{"text":"best service i have ever received.  best food i have ever had. best experience ive ever ex","useful":0,"cool":0},"KJn2Z8S2vUQ-6I5SKIEZHQ":{"text":"Great atmosphere but disappointed in the service. We had reservations and got seated right","useful":0,"cool":0},"kN1GMyZqeXCDhasMepwR7g":{"text":"This was one of the best places I visited while I was in New Orleans.  The turtle soup was","useful":0,"cool":0},"GhBZzt3pALBMs2VpolMRRw":{"text":"My friend and I have a bucket list to hit the top ten steakhouses in America. So far we ha","useful":2,"cool":0},"eWswts1UZz1OUYmNZHyGcw":{"text":"Had lunch there yesterday.  Service was awful!!  Wait staff not remember who ordered what,","useful":1,"cool":0},"7ajf11Nd_nODCzr--tuFYA":{"text":"A French Quarter institution, located right on Bourbon Street. Old school steakhouse with ","useful":0,"cool":0},"iJI3VkLjJG64CP0mPSeNRw":{"text":"The steak was delish as were the sides (onion rings & whipped potatoes). What fell flat fo","useful":0,"cool":0},"iTLA6IVs1m2DmkGGNJpVwg":{"text":"Good service, good food.  We were able to get an 8:30 pm reservation for a party of 7 the ","useful":0,"cool":0},"C9ka59o2Ctozl-w8bap91g":{"text":"We started in the bar which was great. Very pleasant and good drinks. The service from beg","useful":0,"cool":0},"jh8VRNKcW4qdseMxxf2cqA":{"text":"Great experience!  The staff were very friendly including the GM who came to our table and","useful":0,"cool":0},"RWAj4D471eWwlanxLzlqug":{"text":"Fantastic food. Best steak I've had in a long time. They made chicken nuggets for my 8-yr ","useful":0,"cool":0},"yq99tudkN4eolOiALMzADw":{"text":"This was pleasant, but not great.\nsteak was okay, but not even up to the standards of Ruth","useful":0,"cool":0},"RFzpxK8BA3Rh9IHVcVQSjg":{"text":"The service was excellent and so was the food except ....my filet was dry and it was cooke","useful":0,"cool":0},"XyqI2Ho_eL2E9ZdyV8I_TQ":{"text":"Walked out very disappointed. Saturday dinner for my husbands was a complete bust. We sat ","useful":2,"cool":0},"6uTqZWa6NrRQ-_DVx8bj7Q":{"text":"My overall experience here was great. It starts of by being greeted immediately by the hos","useful":0,"cool":0},"iJFsy3KrHHNND14LCGMVwQ":{"text":"I went to Dickie Brennan's together with a colleague last week. \nWe were in town for a con","useful":0,"cool":0},"h68i825S9zUcOmt-c872QQ":{"text":"We were in NOLA at the end of Mardi Gras; ate at Brennan's on Wed. 3/6.  I've been to seve","useful":1,"cool":0},"J-cYLYduyR3IqOlh-U0jsA":{"text":"Price does not match their performance or quality!\n\nI could elaborate more, but for $50 a ","useful":1,"cool":0},"JR3wD6qqPvAXEYLqeRzDDw":{"text":"The environment was high class. The food was good and the hospitality put the experience o","useful":0,"cool":0},"QAlKafAJ3-hkSrUGNa83wg":{"text":"We ate here at 8 on a Friday night. We had a reservation which is a must. We were seated f","useful":0,"cool":0},"OmCogeeE0QNqvO99aUcn_A":{"text":"Based on the majority of reviews, we had high expectations of a lovely dining experience a","useful":0,"cool":0},"oO5zDARnwkJUFUWJrFPQMA":{"text":"All I can say was this place was fantastic. We have been to a number of high-end steak res","useful":0,"cool":0},"rJEx6WV2uVtyPJq4kXaoTw":{"text":"One of the most memorable meals I had in New Orleans (its all sort of a blur)  Delicious, ","useful":0,"cool":0},"x8nTUmKlfH3wxgvXBbL4rA":{"text":"I have to say that I have not been this disappointed this much by a restaurant in a long t","useful":0,"cool":0},"TgFHqTAGSRIl1J4cbPqZsw":{"text":"Flew from Los Angeles just to eat here again. This is the best steak I have ever had. We h","useful":0,"cool":0},"X0Elrm_JpYayo1fxsYOIkw":{"text":"This review is for DINNER - and although this is a steakhouse my review isn't on steak, bu","useful":0,"cool":0},"O43Abl_LNUNbGNT8GdVbXg":{"text":"My husband and I had reservations here for over a week to celebrate my bday. we were seate","useful":1,"cool":0},"fSfi6_OxIrSbS-b56QV-Mg":{"text":"My favorite place to eat in New Orleans. Great atmosphere, very attentive waitstaff. Every","useful":0,"cool":0},"xdqR50ur6m9umnF6LJRaMQ":{"text":"This is another of the times that I wish Yelp had a 1/2 star option. While Dickie Brennan'","useful":6,"cool":2},"SYYq1JIe_PLVgzUXyvYYdA":{"text":"Had the oysters for starters followed by the 24oz prime rib for dinner. Both prepared to p","useful":0,"cool":0},"jtwIrXiwjUgBB27CrjInyg":{"text":"The food here was just ok. The staff was another issue. Within 5 minutes of being there, 5","useful":0,"cool":0},"TTdZK9eMdx3TflkrhZ6Jzw":{"text":"We just celebrated 3 birthdays at this restaurant. The food and service were outstanding a","useful":1,"cool":0},"LxPUasgm8_BM2Tti2O01UA":{"text":"One of the best stakes I have ever had. \nA traditional statehouse atmosphere with a wonder","useful":0,"cool":0},"W9P-gYWOSPKmVMb2x7RM4w":{"text":"I love a good steak house and Dickie Brennan's did not disappoint.  The arugula salad was ","useful":0,"cool":0},"6FHiW4SKR-lZFi9fzUdiXw":{"text":"Dickie Brennan's...a review that I have been putting off, because how do you describe one ","useful":14,"cool":7},"Hi64s-SDMQVlw68Ts4TMJA":{"text":"Fish of the day was swordfish... mine was a little overcooked. My friend ordered the house","useful":0,"cool":0},"-F5hDzJIVTx4v78KZu1F5g":{"text":"From start to finish, service and food were impeccable! Could not ask for a better experie","useful":0,"cool":0},"grIjn_SR3vXe0EzkcQaAFA":{"text":"The way food should be prepared , presented and eaten. Always a sure bet. Always excellent","useful":0,"cool":0},"d6Yv6-BzHNUQnh_4YtbY3g":{"text":"Food and service exceeded my expectations! What a great place. It's a must if you are seek","useful":0,"cool":0},"ewqQMaFdPTT0-Ie9BmiRyg":{"text":"Dickie Brennan's was one of 3 recommended places to try while in NOLA for a business confe","useful":1,"cool":0},"djq7u80ysV4-kE-DA6Raqw":{"text":"This restaurant has the best service that I have ever received in my travels.   The glasse","useful":0,"cool":0},"yFXmdrODyzJKfy2YypkRFQ":{"text":"Excellent food, excellent service.  Didn't give it the 5th star only because it wasn't qui","useful":1,"cool":0},"twwuHgW1OMqDTDkV--o6lQ":{"text":"My favorite steak in New Orleans! I always order the house fillet. Wonderful!","useful":0,"cool":0},"uhbSe6oC6DeMGm6igq9UWA":{"text":"Arrived and was seated and we were given some water and then didn't see anyone at our tabl","useful":0,"cool":0},"L8kqZSSvSeMCutmi3cX6uw":{"text":"Wonderful atmosphere, tremendous staff and very nice selection of adult drinks with a view","useful":0,"cool":0},"lTjYcPyPmDba4tkhuNsxAg":{"text":"A friend of mine was in town for a conference and since we work in the same industry, I go","useful":0,"cool":0},"J_PhXGGq_q5XIH9jJw0oBg":{"text":"Food was amazing and we had a reservation but ended up so hungry we sat at the bar. The se","useful":0,"cool":0},"vCCnL-8Pfdg8j_y0yJpoEQ":{"text":"My goodness! Our filet was so delicious. Corn brulee and the augratin potatoes were to die","useful":0,"cool":0},"tDlEMiLeyeYS1xmCW582Vw":{"text":"Service was excellent, friendly & efficient. Steak and full plated meal was superb, excell","useful":0,"cool":0},"rPihT4W8zj6ZFA-AMb9O5Q":{"text":"Very good steakhouse. Cool atmosphere and great service. Not life changing but I will go b","useful":0,"cool":0},"Dtm-k9VJg4sjX7MM4ygAog":{"text":"As a New Yorker I understand the tradeoff that is often made between great food and excell","useful":1,"cool":0},"fTIzNmPG4eLEqegvTjDs2A":{"text":"Great steakhouse, but not my # 1 favorite in the French Quarter. Definitely still worth a ","useful":0,"cool":0},"lsU_vABQQr4KeLg_6BZpKA":{"text":"Incredible service and LSU alum manager.  The food was exquisite as well (filet mignon and","useful":0,"cool":0},"tVX0_SCTXASVoMBe-HBZXw":{"text":"Let me start by saying I've lived in New Orleans for 5 years and have seen the inside of j","useful":2,"cool":0},"zmwZIXsI7FuGj3CS5jUdKQ":{"text":"This is a classic steakhouse in every sense. The food is superb, drinks are well made, the","useful":0,"cool":0},"9EjmJjS2BohQF5eYaQbUdg":{"text":"Pretty good steak, I'm happy. A bit cheaper than what you'd pay for a high end steak in Ch","useful":0,"cool":0},"OSe5kO0lKPiBP9sfz_GUcQ":{"text":"Between three of us we started dinner with the escargot appetizer which led to a mixed gre","useful":0,"cool":0},"D-ZrSifz8dz1zL-orWKX8g":{"text":"They have a valet style parking garage next door which they validate for you.  I've only b","useful":1,"cool":0},"T3zbY4tFeb94Sn68DT4VtQ":{"text":"I was sick the last night, so when all my friends went out, I rested and then headed here ","useful":0,"cool":0},"4wyflz70kW0TUoj6NZHvIg":{"text":"I can't say more than 5 stars all the way! DIVINE!  EXCELLENT!!  wonderful service, delici","useful":1,"cool":1},"2SNZfTBwWag82nrBnzZ-aQ":{"text":"My bf surprised me with a bday dinner here. The food and service was excellent. It was coo","useful":1,"cool":0},"hzJxdCxNimO00eo9OMzbDQ":{"text":"We went here for my daughters birthday 4/20 while we were in town looking at colleges. Din","useful":0,"cool":0},"yWW86KV6OSPPm6tKpX_ARA":{"text":"This is the best steak house I have ever been to. I came here to celebrate my birthday and","useful":0,"cool":0},"UHYmv3l1yWBiV-SxB57_ng":{"text":"Horrible experience. I used to really like this place. Food was ok but cold. Our waiter (P","useful":0,"cool":0},"N7uJGMxNEOXahEsnYe5_8g":{"text":"Excellent meal.  We each had the bone in cowboy ribeye steak topped with blue cheese and b","useful":0,"cool":0},"kDqfbRD-egJsrn7OnuSIXw":{"text":"Had the filet which only comes a la Carte, no sides. Not bad but expensive. Had to order a","useful":0,"cool":0},"rkPdMOwO9yFL630AMrPR4w":{"text":"Delicious!!!! The tomato blue cheese salad is literally to die for!!!! The crab cake was 1","useful":0,"cool":0},"vv3mzcDo1i_rTvfQSon1ig":{"text":"Absolutely amazing! The only negative is that now I compare all filets to Dickie's, and th","useful":0,"cool":0},"v-vL_XCDHWQUoYcFEbt_KQ":{"text":"I was so upset with my entire experience here. We originally had a reservation at Tableau,","useful":0,"cool":0},"8xi_wR-6UWdmBDzaYm1pcg":{"text":"This was my first trip to Brennan's and will be my last. The best thing and I am strugglin","useful":1,"cool":0},"r1qAt9diJEShQoOsr_j2pg":{"text":"Love love loved it !\n\nSat in what had to be the most perfect dinning room ... White linen,","useful":0,"cool":0},"xnN2dkARqjjrF6aEDO9-wg":{"text":"This is s pre-review. Expectations are high as my husband and I will dine here tonight @ 6","useful":0,"cool":0},"dzWHtAgfeCQAtH9q7rfqRg":{"text":"Went there for the first time last night. What a great experience! The filet was cooked pe","useful":0,"cool":0},"o8CcjiZO4pRI49CcM1xvdg":{"text":"Nice old style place.  Don't sit by the kitchen you will feel the breeze.  \n\nFantastic oni","useful":2,"cool":1},"0-VdtWFmiInPMbEqqjXSpg":{"text":"Perfect for a Saturday night birthday celebration. Classic, low key ambience. Our friend p","useful":0,"cool":0},"jv3goSPGmfs4d4FruJa6FA":{"text":"Delicious steaks and sides. Got the 6 oz. filet and it did not disappoint. Cooked perfectl","useful":0,"cool":0},"VVHMV8V0dEdaoJ3uIqG6oQ":{"text":"I'm not a steak eater, but my red fish dish with crab and potatoes was very nice. Not a fa","useful":0,"cool":0},"lZq2QQEP7MJgWQO08dEJ0Q":{"text":"It's a steakhouse, yes; but this being Nu Awlunz there's plenty of wonderful seafood offer","useful":0,"cool":0},"nfNIsKF4HjS-SfSP0rs3hg":{"text":"Great service. We noticed the small things like your napkin being refolded when you return","useful":1,"cool":1},"VtCBBRFYNrgcuD5kDNtcGg":{"text":"Dickie Brennen's is a top-rated restaurant and rated as one of the best steak houses in Ne","useful":3,"cool":1},"F3ETeb-5EdmjKWA7WtyGkg":{"text":"Great restaurant in a city of great restaurants.  They happily sat us in the bar despite r","useful":0,"cool":0},"c9jvbJADfXfpZBCxWEuDag":{"text":"We popped in for a quick lunch at the bar while visiting family in the quarter. Dickie Bre","useful":1,"cool":0},"Ix8-lQsJ3dkajrCiX3-5uw":{"text":"The Bananas Foster Bread Pudding was \"to die for\" - sweet ambrosia!!  The rest of the food","useful":0,"cool":0},"3FDQ39r9wWrzzDXYQDoHfA":{"text":"Definitely a great place to have dinner.  The service was great, the food was amazing, and","useful":0,"cool":0},"zHG7piBGs73RMUU9G-ZEHw":{"text":"This was our big splurge in NOLA. We wanted a really nice steak restaurant to go to. We re","useful":0,"cool":1},"S3bvxfKhgjKySoTg9aqu8w":{"text":"This is one of my hubby's favorite steakhouses. Last time we were in New Orleans we ate he","useful":0,"cool":1},"hmQ7fnWGj15EhVksvosocw":{"text":"Horrendous service. Seriously bad. Food is mediocre and grossly overpriced. Steak is lacki","useful":0,"cool":0},"cnNKWFUAcprt2JwTriVmmw":{"text":"First time visiting, and last as well. We had a party of 13 and dined on Saturday night. W","useful":1,"cool":1},"709Zj-GZVmCqn3no9FBnsg":{"text":"We were able to sneak in without a reservation for lunch on Final Four Saturday. The food ","useful":0,"cool":0},"vjCcFb7xG9AZpKVPklnNmA":{"text":"Alway a great meal at Dickie's. The turtle soup and French bread is spectacular. If show u","useful":0,"cool":0},"JOQaAEHW58xb414DY3T8EA":{"text":"The steak is incredible! Just as good as Morton's and Ruth's Chris, but more creative and ","useful":0,"cool":1},"aRhDjwLjzXnj9McIlx4Kvg":{"text":"I came here for our Annual Christmas Girls dinner.  We had reservations Saturday for 7:45p","useful":2,"cool":1},"9-p-YhK9NLqif7kbjQzzmw":{"text":"Mixed reviews from my perspective. Initial thoughts were solid apps and cocktails to start","useful":0,"cool":0},"dAfBOoQps8gnHkLbO6PbMQ":{"text":"I pretty much liked everything at Dickies. I had the BBQ shrimp poboy and being from Lafay","useful":0,"cool":0},"aTs_0OhuVwenO_0VB-UtVw":{"text":"Good food, great service. great wine list,\nLobster tail and petit Fillet Mignon was great ","useful":0,"cool":0},"UQLFJLQCiclQRcWSJu8whw":{"text":"Great dinning experience. The whole staff was amazing and our waiter Brett took extra grea","useful":0,"cool":0},"ENHorQwe-HHUSx88KhG3DQ":{"text":"Great tasting food. Perfect service very classy wonderful dining experience. Classic New O","useful":0,"cool":0},"matlvphruBxML1te7K4o3w":{"text":"Great food, the staff right there.  Nice atmosphere. Dessert was the best. Made my son's b","useful":0,"cool":0},"OVc4WRVqRL6mZlxSRZwqqQ":{"text":"Since this is the only steakhouse I tried in New Orleans, I am unable to say it is the bes","useful":0,"cool":0},"3LeLgxxLgIelihht559K9A":{"text":"I ended up here only knowing to try the turtle soup with extra sherry.  Wow, it w as great","useful":0,"cool":0},"RAQ2x82sGdjJ1TKhLAYUJg":{"text":"This place is really nice. I sat at the bar and got some restaurant stories from the barte","useful":0,"cool":0},"Mc74o86w_ZfuV87aQrF8yA":{"text":"My last visit here, about 2 years ago, was wonderful. This time, the atmosphere was more l","useful":0,"cool":0},"-A1RiqImdOLKEA2uRVLyBA":{"text":"Amazing experience.  Everything we ordered was delicious and the service phenomenal. Went ","useful":0,"cool":0},"fGWHseC-Z0HEYC3sTLBCow":{"text":"The food was excellent. I had the House filet. It was cooked as requested served with crea","useful":1,"cool":0},"MsLPtww0QZJUkFRpkINnhg":{"text":"Finally got to try this famous steakhouse out during restaurant week here in Nola and it d","useful":0,"cool":0},"ILJvrqYpIuHH65IB3qDu6w":{"text":"Impeccable service! Sublime steaks!  I love New Orleans, and Dickie Brennan's is one place","useful":0,"cool":0},"M87M2Mc1eJIvtQXw8r2nrw":{"text":"This place was one of the best that I visited in NOLA.  I started with a craft lavender in","useful":0,"cool":0},"ytu0myy70VUDuUwnW9nkvQ":{"text":"The staff cherrfully accomodated my group, which included an infant, without reservations.","useful":0,"cool":0},"nE9kamm82cgB_6b6eoW5Vw":{"text":"My wife and I had dinner here on  Nov 1st, We loved the meal,The staff was very friendly a","useful":0,"cool":0},"_43qVC4LPtK9JejP2Ffv-w":{"text":"No surprise Dickie Brennan's was old school first class.  I had a business dinner with eig","useful":0,"cool":0},"5QaNUDmPQMVTvbth8pw0qw":{"text":"We were a group of 6 meeting-up from various states to spend a weekend in NoLa. With reser","useful":1,"cool":0},"41adRLf1FvJeyXwSMBkzkQ":{"text":"Awesome food.  Steak was perfect, drinks were good.  Not cheap, but one of the best steaks","useful":0,"cool":0},"NglX6HwxYWNLxfTMX5iUnQ":{"text":"Experience was less than any other steakhouse.  Service was excellent up to the point of o","useful":1,"cool":0},"8mEdTUrjbGDTyy8JdjsnTA":{"text":"You walk into Dickie Brennan's and you notice the small tiles on the floor and the faint b","useful":0,"cool":0},"qncfBbh1R46wdkgBwBQB9Q":{"text":"Service was impeccable, no question. We were very tired of fried food, so Dickie Brennan's","useful":0,"cool":0},"swsCLDXWGuqkw1iEym94fw":{"text":"This has to be the best steakhouse. The service was excellent. We were unsure of what to g","useful":0,"cool":0},"JfoH-WnDuyXSQiB8pR4xTw":{"text":"Visited this Steakhouse on my last trip to New Orleans with a group of seven... The atmosp","useful":0,"cool":0},"fEnOvpHUdAkDe9cg7DLycA":{"text":"Best steak I have ever tasted!  This is my third of the top 10 (EB Greens in Buffalo and C","useful":1,"cool":0},"Wx_0eVeAVhydlOzqoHvu9Q":{"text":"Finding a quality steakhouse on a Sat night in NOLA is near impossible. We went to the bar","useful":0,"cool":0},"qXOMKynec1gS3-2aOuLSHQ":{"text":"The steaks are well made and very comparable to New York.. The service was the worst I hav","useful":0,"cool":0},"UKpoI9QKRxAEJ0fZxyUTUQ":{"text":"Incredible food. Excellent service. Big shout out to Chris and Kari. Made our night. The h","useful":2,"cool":0},"9rPxBtsmmnWAemHxI2x50w":{"text":"Solid 4 Stars\n\nClassic NoLa Steakhouse, with waiters in white coats, good service and good","useful":1,"cool":1},"UEmcUG193a4lTK9MVeUBJg":{"text":"This place deserves every star. Can't think of a reason to give them any less. We were sea","useful":0,"cool":0},"R6SWPT7PzgVhHkI1lZZlTA":{"text":"The first time I ate here it was a weeknight and pretty empty. The service and food were p","useful":0,"cool":0},"nUPux0_ojfJShl3YPMoFDQ":{"text":"This review is a little overdue as it was a while back. We were visiting New Orleans with ","useful":0,"cool":0},"Mn0iGA77eSD0eUPRfAki5w":{"text":"Amazing! Our party had fillet, rib eye, NY strip and chicken for the 7 yr old. Every steak","useful":0,"cool":0},"mdw3ZMChQMPbmSfAMbnP2Q":{"text":"Jeremy the bartender is awesome. Best Tito's cocktail I've had. Turtle Soup is a must. If ","useful":0,"cool":0},"BvTAfJ-B99pgJx3lx5s5aQ":{"text":"Went here after a long day at a tech convention, and the atmosphere was great and refreshi","useful":0,"cool":0},"PzVaAlg_-bMGUjhOeSX4HQ":{"text":"Extremely nice restaurant!!! We went on a Friday night and had the option to wait or get a","useful":0,"cool":0},"fj7WSA4sjnPNvDY83TB8mg":{"text":"The pepper corn sauce was OOTW... Petit fillet was cooked perfectly. Loaded grits... yum..","useful":0,"cool":0},"GHoO-op0XakUQFBvSk-Tdw":{"text":"i ordered the special steak that had oysters, potatoes, and creamed spinach with the turtl","useful":0,"cool":0},"xaahAjJAng2Wa8e6Wusz3g":{"text":"Right off the madness of Bourbon street, it is a classy reprieve from the madness. The bro","useful":0,"cool":0},"u3usjVDobQLvw8j_Wg1xLg":{"text":"We were here the Sunday before the BCS Championship game so as you can imagine the restaur","useful":2,"cool":0},"I0Lgz1y_ejM2WSD4dnL3qw":{"text":"The service was great.\nIt reminded me of a 1940's place with the waiters all wearing short","useful":0,"cool":0},"-4yDTKoEXdWjqmUyTyEobg":{"text":"Loved it!!! This place is a very short walk from hotels on Canal street! We had the chatea","useful":0,"cool":0},"AM1XpVgX1bvz0AAS6CE5yw":{"text":"Exceptional dinner, service and ambiance. The price was a bit much though. I don't mind pa","useful":0,"cool":0},"qMnwR9Ab4opEeJMFeSLVwA":{"text":"Went to New Orleans for a convention. The first night there, we wondered around the French","useful":0,"cool":0},"0jEecJVoaJ7nPMwzIhNx5Q":{"text":"From start to finish this was a superb meal.  The cuts were cooked to perfection, the side","useful":1,"cool":0},"aBoPgUWn8GTM_1hZ3qmzww":{"text":"This is the best $5 happy hour in New Orleans. Stunning dark wood bar with cases of gin, r","useful":0,"cool":1},"nkpIfquay3S5EAAFiXIb_A":{"text":"This is a solid steakhouse - certainly not the best, but by no means the worst I've ever b","useful":1,"cool":1},"9mwkzwbVVL1zOkbbROuBDQ":{"text":"My friends and I had a fantastic dinner at Dickie Brennan's.  The service was exceptional ","useful":0,"cool":0},"Q6KLWSIbTW22p6x5Wac3Og":{"text":"My dinner experience was interesting here, i was with a party of 12, that is a big group o","useful":0,"cool":0},"yItaoiP1-RrFpJlZKEtIxQ":{"text":"I came here twice in one week. The one good thing I can say is that the food is tremendous","useful":0,"cool":0},"rNYRFW_poGekWW4RKv7Tdg":{"text":"Fantastic happy hour!  Great $5 martini's and appetizers.   5 star service even during hap","useful":0,"cool":0},"nIBu2I51vWO07jHUyrx5fQ":{"text":"The service is amazing. The teams of servers keep you wanting nothing but to have a wonder","useful":0,"cool":0},"NB9yapM6s4dYyaxuF7UGSQ":{"text":"We actually went here for lunch, which is a bit unusual because they typically only do lun","useful":1,"cool":0},"lPuOXrrTbeE-vSJxvWIyOw":{"text":"Service is excellent. Turtle soup and mcillhenny oysters are very good. RW & LS","useful":0,"cool":0},"vxb3lGhY3Zzo9sVZoZarbw":{"text":"When paying these prices, I expect a restaurant to knock it out of the park. This dining e","useful":0,"cool":0},"4yXVE98rYumbk8-x_X_aNA":{"text":"Went with a group of 17 people.. Food was really good as was the service!  Had the fried o","useful":0,"cool":0},"U-D--8Cvo4LeBVDNdtNSMg":{"text":"First off let me say we came as a walk in on New Years Eve and the front staff were kind e","useful":0,"cool":0},"h3ifOQgQDoOpQgMVn5213g":{"text":"My wife and I were looking for a solid happy hour that wasn't all seafood on a Saturday ni","useful":0,"cool":0},"xnidcOfMVBnKqZvp0MURVg":{"text":"I went to Dickie Brennan's Steakhouse for dinner on Saturday night. We got there a little ","useful":0,"cool":0},"ZhvxZxWVzItkKxFydhya_g":{"text":"Wow! This was my first night in New Orleans  and I relied on yelp to send me to the right ","useful":0,"cool":0},"cY9D9tMZfyUEMDCa4lJ-zA":{"text":"Perhaps the aloof service stemmed from the fact that we arrived at 8:30 on a Sunday night.","useful":0,"cool":0},"0welTR_YBftLn9cx-w72Xg":{"text":"I don't believe the hyped Yelp reviews. We were fooled. There's another restaurant owned b","useful":1,"cool":1},"N491v9LUoimnzbl9K2FXpw":{"text":"Fabulous food and service!  We ate in the bar, a little more personal than the large, tour","useful":0,"cool":0},"Bi0OFbG6iKb7mg4tLHLUfg":{"text":"Food was delicious, service was nice.  Overall a nice experience, but didn't leave me feel","useful":0,"cool":0},"8DQoGta0LEGWz2LFZFilZQ":{"text":"Stumbled onto this place and had an amazing dinner at the bar met some cool people and rea","useful":0,"cool":0},"SAZ7QZz7848xdl_FLej5bQ":{"text":"May be the best steak I've ever had. Perfectly cooked to order. The asparagus and potatoes","useful":0,"cool":0},"s6RgcO9_w3b83HJR8FTAfA":{"text":"My husband and I always make it a point to try a good steakhouse in every city we vacation","useful":0,"cool":0},"czOqT8kZtWBKfTMEY4OGLw":{"text":"I was alone and sat at the bar. Don quickly asked me if i would like something to drink. S","useful":1,"cool":0},"vKFe47S14juE0vwe9Xgarw":{"text":"Service was great, food was Amazing and the price for the chateubriand was astounding for ","useful":0,"cool":0},"rIvV25u_jAgOLi32Yts2ZQ":{"text":"My Steak was perfect. Very glad I stopped in for dinner with clients. We sat at the bar. T","useful":0,"cool":0},"WA2svmQuFPMGRjT-_dePqg":{"text":"We have been here over an hour and still have not received our food. So far not a very goo","useful":4,"cool":0},"jMaGUlFdPE_svOO92wLt_Q":{"text":"Steakhouse mit Top-Bewertungen, angeblich die besten Steaks in New Orleans.\n\n\n Positiv: In","useful":0,"cool":0},"NjYBFaAkxUFfziMHO0spmA":{"text":"This place is a must visit while in NOLA. The steaks and seafood are wonderful. I visit ev","useful":2,"cool":0},"fzZHuYmqsVFAj5-NLLgCdQ":{"text":"Me and my wife sat down for dinner this past Wednesday evening while visiting New Orleans ","useful":0,"cool":0},"bSbA4IxsKhoXOLBrwh8BMA":{"text":"Great friendly service. Steak was excellent. Most importantlu get the pecan pie. I'm usual","useful":0,"cool":0},"igARvp3Eu9Nlzbvu6eVTrw":{"text":"We made reservations here for Saturday night for party of 6.  It was a great experience.\n\n","useful":0,"cool":0},"uno-8t6fTnoDD1y5Hi6QcQ":{"text":"The service was terrific, the bone marrow escargot was friggin amazing, the steak however ","useful":0,"cool":0},"fyazpJcKfI4Dpd5skwMbIg":{"text":"UNDERWHELMING   \n\nParty of two for lunch. We sat at the oyster bar.  I will have to say th","useful":0,"cool":0},"FEa8-b6U3uGgJMap7trJ0w":{"text":"The crab cakes and the wedge were the highlights, although they didn't cook the lettuce it","useful":0,"cool":0},"GkYOLRgb-ofvRuS5ufip7g":{"text":"In a city full of very good places (including Mr. B's Bistro), this one falls short. \n\nCam","useful":2,"cool":0},"TgLcJU-pXPZMLfAss7eGFw":{"text":"Hands down the best steakhouse I have personally been to.  Portions are perfectly generous","useful":0,"cool":0},"e0tSiQZKxqEzn_cV0F-vwg":{"text":"First time to Dickie Brennan's but it will not be the last! We were in town and able to ta","useful":0,"cool":0},"6CbYcObI1GzVYzfZXN1VnQ":{"text":"We arrived 10 minutes early for our reservation and were told to wait in the bar. There we","useful":0,"cool":0},"PguO3TgL9S7IxMv2UXZLxA":{"text":"I ate here back in 2005 and I was guided here by the concierge at the hotel because I am n","useful":0,"cool":0},"EFGSDXbw8KT7XpNNvz2UYQ":{"text":"Ein gute Adresse um in New Orleans Steak zu essen!\nDas Fleisch und die Portionen sind supe","useful":0,"cool":0},"TV-q0CNsYx5WMsId7XnWMg":{"text":"The Brennan Family has a stronghold on the dining scene in New Orleans, and rightfully so.","useful":1,"cool":1},"WjWJHPt5BzdqnkZTvF9SMA":{"text":"Had a guest in town and was looking for a great Steak,  I found one along with a great win","useful":0,"cool":0},"E64WsOL1QOeA0m-wG0NaiQ":{"text":"It was my first time in NOLA and the first time ever hearing of Dickie Brennan's. We were ","useful":0,"cool":0},"4D34SJuKWpfFrq50CrjdUQ":{"text":"Ordered the Coolinary Menu. (We were at the Bar) Bartender said they were out of Filets so","useful":0,"cool":0},"MBSe5u-LjS7RgIHrBiT1nQ":{"text":"Excellent Prime Rib. Wonderful selection of various potato sides. Good prices and service.","useful":0,"cool":0},"CLwM98VfKrWAAJzcVhVC-A":{"text":"Beyond the unbelievable food, the service at Dickie Brennan's is unmatched. The staff was ","useful":0,"cool":0},"mX3qx0OJf0EM2dG8mLprBA":{"text":"Steak was a TRIFLE undercooked.... but considering it was a think cut, I could let it slid","useful":1,"cool":1},"Fsy3vo7vthTJiZPI69NeVA":{"text":"It was aweful.  Go to ruth's Chris steak house in stead. The waiter was terribke.  Food te","useful":1,"cool":0},"D09gt2sjCM2YD2eM19E42Q":{"text":"My husband brought me here for our two year wedding anniversary. We fell absolutely in lov","useful":0,"cool":0},"4FEoflN5Jrj0QPD8IydSag":{"text":"My wife and I had dinner here the other night with some friends. We picked it on a whim, I","useful":0,"cool":0},"_KEnbryRBm_CXTXvRGWHcg":{"text":"Good steakhouse near bourbon street. The inside is much better than the outside leads one ","useful":0,"cool":0},"u5eTooa9X4Ci6Vu0Y_K7-g":{"text":"This place is amazing if you love steak. I forgot to leave a review but I was there earlie","useful":0,"cool":0},"WCotG8QORa9iOBW2PPib5w":{"text":"Unreal...that is all I can say. We were in town for the Sugar Bowl and they greeted me by ","useful":0,"cool":0},"W7q-bizjdOV8itVm0mCf8g":{"text":"We had a huge and delicious dinner here last night.  The service was attentive and charmin","useful":1,"cool":0},"XO4TgqpF5UZB1cw9jS6yPA":{"text":"Great resto. Fried oysters followed by a great filet. Interesting menu with the usual stea","useful":0,"cool":0},"3lCc74x58Ga3nYnms9V3iA":{"text":"Yuck.  That really says it all.  I don't have enough time or word knowledge to say it any ","useful":0,"cool":0},"evkCc0kjLeRIeCngjOeaPw":{"text":"Helen, Marquis and Brett so exceeded our expectations. As great as the food!  We've had ma","useful":0,"cool":0},"4WYEIDI-B5zF5Kezy2Ts2A":{"text":"This is a great place to go if your're 40+. Being in our thirties, we were perhaps the you","useful":0,"cool":1},"BIUPg2ONw0pgxiwuFU6BUg":{"text":"From a night out in New Orleans, we stumbled across Dickie Brennan's and their $5 happy ho","useful":0,"cool":0},"d3oc_UoXdRZyFGzoYdWV4A":{"text":"My girlfriend and I decided to make a day trip to NOLA and really wanted a change in food ","useful":0,"cool":0},"BG-ZJRnF5ije6p-UprCbGQ":{"text":"I love walking in NOLA and just finding a spot to eat. My husband didnt think we could jus","useful":0,"cool":0},"pWxV3a2cq4WkICHGJrnijg":{"text":"Delicious marbled prime rib highly recommend the Worcester sauce! Rings bring in a unique ","useful":0,"cool":0},"CRb9w6dUckKxBwHggw31CA":{"text":"Fancy steakhouse. Def a dress up kinda place. Listed under as one of the top steakhouses t","useful":1,"cool":0},"LX0V_p5NS4EoreBeSa9s3g":{"text":"Greeted very friendly. We were seated in a smaller more intimate area. The atmosphere is c","useful":0,"cool":0},"iIoHtSxpLHJbTvR_KW92DA":{"text":"Yum-Yum-Yum!!!!\nEverything we had was superb! It's rare to get good quality seafood in tod","useful":0,"cool":0},"lojrSpJaY2KzozN_cLOAXw":{"text":"While on our vacation, we thought we wound try Dickie Brennan's because it was close to ou","useful":0,"cool":0},"i8-l23AivfTQKFSAaCv4MQ":{"text":"I have eaten steak and had great wine in many many places...heck I am from Texas....steak ","useful":0,"cool":0},"WC4jm_yyFL2DRCkTuNxkPw":{"text":"This is a great choice for a little romance or a celebration. My husband and I shared the ","useful":0,"cool":1},"1b-pGuF6Q3n-je3Ut-KfPg":{"text":"I made a reservation for Saturday night.  I ordered the House Filet, which comes with frie","useful":0,"cool":0},"gI6px4O25zfjVma7-3PaoQ":{"text":"Rest of review to be determined. I just called to make our reservations for Friday night. ","useful":1,"cool":0},"LSiPPM-OsPZm6G5rfGj30w":{"text":"This is my favorite restaurant in the Quarter.  This trip, they hit it out of the park...a","useful":0,"cool":0},"FJr7vJFv0PgBtZqmSYBrqg":{"text":"On Monday We walked in around 7pm. I had the Chefs Special ($36) which included steakhouse","useful":0,"cool":0},"E1Xe8Qk6QtUXEUuAftRX0A":{"text":"My husband and I celebrated our first wedding anniversary here Sunday night. This place ca","useful":0,"cool":0},"QIWTJrPqqagTvRc-47qYPQ":{"text":"This is a 5 star resturant! Classy, polite, quick (unseen) service. Very pleasant staff. C","useful":0,"cool":0},"-33HZQKNBeWrjTO17EC1Ew":{"text":"Came here with a group of 15 for a bachelor party dinner.\nDefinitely, the best meal I had ","useful":0,"cool":0},"CC9monlKuHssohpB3sSSyA":{"text":"Excellent food. Great service. We started off with the steakhouse and Napolean salads, the","useful":0,"cool":0},"-jtD5ynyHhL-7duhiJ2cMQ":{"text":"We started with dessert and everything was mindblowing... ESPECIALLY the chocolate mousse ","useful":0,"cool":0},"42RGG-dQrnf4Ko1YmbB4zw":{"text":"This is my favorite steakhouse in New Orleans. The service is second to none and the food ","useful":0,"cool":0},"Fh3oRYt-vWHCb1Sfc_Vvkw":{"text":"Overall it was a great experience. Make sure you make a reservation in advance. If it's a ","useful":0,"cool":0},"TNfju0iDhBhiom0ykF3JKw":{"text":"We had 3 wait staff for our table!   AND it was just my husband and I.  Treated like royal","useful":0,"cool":0},"KJuSRoPmNhGbLLjJaJNUWQ":{"text":"The food here was amazing, and honestly was more enjoyable than even Emeril's NOLA (althou","useful":0,"cool":0},"F8biUFW4q9YsVk70kY1nMg":{"text":"Great spot. We ate at several restaurants in the FQ and this by far was the best filet mig","useful":0,"cool":0},"5onzIlfTyFYB5FAF8Z7OWg":{"text":"Ummm - I cannot put into words how good my beef was.  But I will try.   It was juicy melt ","useful":0,"cool":0},"nb7HUgjLWcgkiJ5Sn0KLLA":{"text":"We went there for a small birthday party.  The staff treated us great from the moment we w","useful":0,"cool":0},"AhjYuwQc4qgvwSZ0iBXz0w":{"text":"The food is great! The service is amazing..they treat you like a star, my glass was never ","useful":0,"cool":0},"XkzkYlnZTuqUirOnkrSLiw":{"text":"We went to New Orleans recently ate there for the first time since 09 and it was so good!.","useful":0,"cool":0},"oFYdqKhQaImOpxetgkJgSg":{"text":"For a steakhouse this place was good!  The menu is short and sweet.  There were only two o","useful":0,"cool":0},"5Pj06zHD96g8skDEh2SpbQ":{"text":"For many years, I've considered this one of my favorite New Orleans restaurants, until my ","useful":0,"cool":0},"7uJBJJ6LYzpahf0CBK_LoQ":{"text":"My wife and I really enjoyed this place. Service and food were both awesome!","useful":0,"cool":0},"HwOeL7bM7b6IiRjy4F4aCQ":{"text":"Don't dine at this restaurant. Worst hostesses ever! Customer service here is absolutely a","useful":0,"cool":0},"OXOD6qmoJZCNooEfmyKFNg":{"text":"Decided to dine at the bar. We eat here every trip to NO. Food was very slow to arrive. Se","useful":0,"cool":0},"lYw-8cU8cafJfFz1TbWyWw":{"text":"Large restaurant with a nice bar on the upper level to get drinks while waiting for seatin","useful":0,"cool":0},"X9tc7I5LhuCCJqNow2EZ1Q":{"text":"Fun, quality dining experience! The staff was excellent. \nTry the turtle soup, it's good. ","useful":0,"cool":0},"_cLEX6fuKf8VN2ZnLBmyfA":{"text":"They gave us a brochure. It has Dickie Brennan's as the # 1 steakhouse in the US........NO","useful":0,"cool":0},"0rAR-LydRKtb6Wwh5Wfvkw":{"text":"Service was realllllly slow! They put us at a table basically in the middle of a hallway i","useful":0,"cool":0},"pPJ1b5IEbrtNm3y-NwaDWQ":{"text":"We spent this past weekend, in the great NOLA. In fact the Brennan family got most of our ","useful":5,"cool":0},"Yl6gwVG1QI90qFuHza48Mw":{"text":"Enjoyed Dinner. Suburb Service. Skip the Boar Chop.\n\nArrived in NO last evening and headed","useful":0,"cool":0},"NsHJ2GVdQXNP1X4p0vYiRw":{"text":"Wonderful steak dinner at Dickie Brennan's.  I had the 12oz. Ribeye with New Orleans BBQ s","useful":0,"cool":0},"ruihOYSUQKxc8pa7Ok0LHw":{"text":"Our concierge recommended this steakhouse and she was spot on. Our servers were Reaux and ","useful":0,"cool":0},"u6eegPAzDIxZxxqv0P4LfA":{"text":"My first time visiting NOLA. I was given a ton of recommendations for restaurants but only","useful":0,"cool":0},"CqifHmNvhSuePKV75fpZvQ":{"text":"Food was phenomenal! One of the best steaks I've ever had in a restaurant and the desert w","useful":0,"cool":0},"g2qj2jVYWpMktHi3GX4dSg":{"text":"One of the best steaks of my life, and I'm from cow country in the midwest. \nThis place ju","useful":0,"cool":0},"kbvdw8qBqQmSZl6VLcEm0g":{"text":"We were excited to eat here as I can't eat anything in New Orleans (allergic to seafood). ","useful":0,"cool":0},"SQtIcF4Y-AwODC8Zf07PQg":{"text":"When we arrived the person checking in people with reservations scoffed at my fiance and s","useful":2,"cool":0},"q7KSdeQXhqrpkmIWBTFClg":{"text":"We started with a wonderful arugula salad with a superb vinaigrette, followed by crab cake","useful":0,"cool":0},"G7lwMcMO4K7RLoYgoMFahQ":{"text":"I was a walk in diner and sat in the bar. This has become my preference lately (sitting in","useful":1,"cool":0},"piVknaSizyMu6_b15DHrkQ":{"text":"This is one of New Orleans most iconic steak houses steeped in history and tradition right","useful":1,"cool":1},"MYrVBQZVDTpCj81GQXPhkg":{"text":"Dickie Brennan's, one block from the French Quarter main drag, the dark wood paneled atmos","useful":0,"cool":0},"A2OiNP24x0zNOpmQ6DugLQ":{"text":"Insanely good.\n\nWe had a 9 pm reservation but weren't seated until closer to 9:30 because ","useful":0,"cool":0},"JQ8VseZwnIVgukBsG2AOkg":{"text":"Can't be any simpler , AMAZING!! From the team of servers assigned to our table to the man","useful":0,"cool":0},"-e753b7WqacGWFZe4dCz0Q":{"text":"Atomosphere and waiter service were good. The food was subpar for such a nice restuarant. ","useful":0,"cool":0},"20tAuYw8i4HMMiaXWHz3Aw":{"text":"Really great restaurant.  Tomato and blue cheese salad was absolutely divine.  \n\nWould hav","useful":0,"cool":0},"oHlgPeKa9ojhNPbEdaemIQ":{"text":"I don't write novel length reviews, here's my take on this restaurant: faaaaaantastic. \nTh","useful":0,"cool":0},"ky5FuPGpwce7x7AptGuedw":{"text":"So... after a glorious and outrageous 5 days in NOLA, we decided to further indulge in yet","useful":1,"cool":0},"vwL32m7vdQUHZyCyQ3U5Bg":{"text":"When your looking for class and fine dinning Dickie Brennan's is the place! Everything fro","useful":0,"cool":0},"BzSyJ6yttfqjFEC4QSksIQ":{"text":"Amazing filet and fried oysters.  Great spiked Arnold Palmer.  Service bringing bread to t","useful":0,"cool":0},"FMfKRMcHN_JnnHaf4oIW1A":{"text":"Favor upper class individuals gave are prime to another party after we waited and hour.","useful":0,"cool":0},"uEQpdKUPA4Ggt0XcV6ttng":{"text":"This was a great place . While a little pricey I had lobster and bf had a filet that was h","useful":0,"cool":0},"6H1TCxLe5XFYQUfGIkypWQ":{"text":"Had the bar-b-qued rib eye which was one of the best rib eyes that I have eaten. It was se","useful":0,"cool":0},"VjDb_tGSvc0lKuWuTkf3KQ":{"text":"The food is pretty good but service is terrible.  We don't have a waiter but \"a team\" that","useful":1,"cool":0},"TLDz9C8y3yUOAfDPcIMMqQ":{"text":"We really enjoyed our dinner here.  Our waiter Samuel was charming and attentive.  The oth","useful":0,"cool":0},"xz-QzmvFgH1NmlGUzVQhGg":{"text":"Great staff and meal. Arrived for happy hour at 5 as the dining hadn't opened for our 5:30","useful":0,"cool":0},"670WrAe7h177OpVilhAYpA":{"text":"Dickie Brennan's always seems to hit it out of the park for us! From the bar to the restau","useful":0,"cool":0},"v2f26GHHFjPdEiC1eaOJ6w":{"text":"So disappointed. I guess I am spoiled but when I pay 5 star prices I expect 5 star quality","useful":1,"cool":0},"x3QbzUEz_cugkLMOC4M7rA":{"text":"The service staff was friendly. The service was extremely slow. Appetizer was served after","useful":0,"cool":0},"Jc0V4z3tdlAsqlfuwiFicQ":{"text":"Best steakhouse in the nation MY ASS!! Steaks under cooked, lobster over cooked. Service u","useful":1,"cool":1},"SybQHNBMUIOM8BNFIixRqw":{"text":"Beautiful steakhouse with great staff and excellent food!","useful":0,"cool":0},"hjBCGwg3VTpORvGuvEuMiQ":{"text":"From the first step into this snobby establishment it felt cold and unwelcoming!  Seated i","useful":0,"cool":0},"Gg5Vz8UQ1GxkhcvXrUprsQ":{"text":"Horrible!!! I got food poisoning here and they refused to do anything about it. Complete j","useful":1,"cool":0},"58AfQLZYu5VZZBBnYlIPIA":{"text":"This is not my first visit but it may my last to Dicky Brennan's steak house. I have had s","useful":0,"cool":0},"B1u1dB2HpnUv9Sjj6wiDDA":{"text":"Been here several times years ago always raving. Went last night; can't say I'd go back. S","useful":2,"cool":0},"MUvoQB3NYPzHvsJqytTwdw":{"text":"For our anniversary, my wife wanted to go to Dickie Brennan's.  Our table was great, we ca","useful":0,"cool":0},"Hjvv_IiS6BDEPoUWD1WcFA":{"text":"During a recent trip to New Orleans I treated my family to an evening at Dickie Brennan's ","useful":0,"cool":0},"pS6mVtgqckekyoVnl_HYow":{"text":"Delicious food, beautiful ambiance.  The service was great and started at the door.  Staff","useful":0,"cool":0},"Fr2dwFTKmvVqkP73CzJehQ":{"text":"My wife took my 8 year old son here for dinner before going to the Saenger Theatre for Ala","useful":0,"cool":0},"QoyI6BIS9WNYFTNXlsQUIA":{"text":"I loved this place.  After so many disappointments, Dickie Brennan's was a real treat.  Th","useful":0,"cool":0},"V5kC2QLHpgrScI80CbmecA":{"text":"Steaks were not cooked to order, waiter took our order and never came back. No drink refil","useful":0,"cool":0},"5AYMdYe_fz87haH1dVBWFA":{"text":"So, here goes nothing...\n\nOn Oct 1st, my two friends decided that was where we are going t","useful":1,"cool":0},"KqFlOCKi5qDBiJn_jL1zKA":{"text":"I've been to Dickie Brennan's many times over the years.  They have always had quality foo","useful":1,"cool":0},"npcOtunNGjb18t-SsQhSGA":{"text":"Dickies was incredible! It was the highlight of our trip.  The service was perfect and the","useful":0,"cool":0},"LrXuMORtZPd35DMdD7XjMg":{"text":"I'm from Chicago so I feel like we are the steak capital of the US. Dickie Brennan's chang","useful":0,"cool":0},"qFZe7SlWRcMqmp_uxvh1sg":{"text":"Not good. Wanted to have a nice dinner for our anniversary and of all the great places in ","useful":1,"cool":0},"f85X4E0m3DTTvw9vRNO1zw":{"text":"The wife and I were there on 02/10/2014. All I can say is that everything we had was to di","useful":0,"cool":0},"vx-YBnMrRXqM32l1jdgGWQ":{"text":"If this is the 2nd best steakhouse in America I have a bridge in Brooklyn you might be int","useful":0,"cool":0},"d6CoAil72ygKGGq07_dW_w":{"text":"Any Brennan's restaurant is a good choice in the French Quarter. At Dickie's The French br","useful":1,"cool":0},"YbQKDJfB7mpMRjv8WKD6Gg":{"text":"Wonderful food and service!! I did the chef's menu which included Iberville salad, gulf fi","useful":1,"cool":1},"9OHJyeZHSvAnENLx9CUDrw":{"text":"Went there for a nice steak dinner.  Ordered a rib eye and the prime rib medium rare.   Th","useful":0,"cool":0},"Y_gERJxkWynq9d7dQ7-B5g":{"text":"Ate here with 15 other folks. Food was terrible. Steaks were improperly cooked, tough and ","useful":0,"cool":1},"dYsIqBkGhiO-QC9xlhNFFg":{"text":"I'm not really a \"steak house\" gal but when your boyfriend's parents bank roll a trip to N","useful":0,"cool":0},"Os3-bJkG0KYT5lNXDOv5ww":{"text":"Made reservations thru Open Table right before we left the hotel but it wasn't in their sy","useful":1,"cool":1},"e9U8VxYT9mwXItxv492Obg":{"text":"Great experience eating here both times. A classic steakhouse with a good wine menu. Every","useful":1,"cool":1},"FddQw7KQKIJ28aoP5_nGsQ":{"text":"Top notch service,decor,and food. High price steak house that lives up to its concept enjo","useful":0,"cool":0},"Gm6CRK0X4yU3N102fVZCcg":{"text":"I wish I could give half stars that way I can give Dickie Brennan 3.5 starts instead of 3.","useful":2,"cool":0},"QeoYaltCCQNWzXj0UgXEXA":{"text":"Went out to dinner with a couple of my mates and had a wonderful time. The environment was","useful":0,"cool":2},"uZggiwzeoY-yfgYu2dBAQw":{"text":"Meh. The atmosphere is that of a traditional steakhouse but it's LOUD. So loud I couldn't ","useful":2,"cool":1},"nxrB9t5ZbpLwInbPGO71oQ":{"text":"We had lunch here and WOW. The service was phenomenal, the food awesome and the atmosphere","useful":1,"cool":0},"LGV93EMLg5JAVUP7XNmXzw":{"text":"I eat here every time I am in NOLA. We like to eat in the bar area, it has an old school s","useful":0,"cool":0},"t3Q9EvQhVRlB_bD6EtnX2Q":{"text":"We went for lunch and it was a solid meal. Their house bourbon salad dressing was a highli","useful":0,"cool":0},"pS9x6O0JEL8vPblr5F6aeg":{"text":"Wait staff and management are superb! Service with smile and less stiff upper lip meet fin","useful":1,"cool":1},"q9JdM44Gjvp8m8Lrlj0daw":{"text":"Dickie Brennan's is once again an excellent choice for our NOLA food orgy week. On Jan 1, ","useful":1,"cool":0},"mg7vxg8cyHSJrsMMmu1tLQ":{"text":"Look elsewhere for great flavor, recommend by a local to get a steak.  Ordered signature N","useful":0,"cool":0},"Dx4H6YKuzPqnQBAFvpP2cg":{"text":"Great place to spend an evening in NOLA, if your on a budget this place isn't for you. Peo","useful":0,"cool":0},"6yg-QnOE97fNNNHFnAyGIg":{"text":"Everything about this experience was amazing!  The food the wine the atmosphere spectacula","useful":0,"cool":0},"Bq9c0-0-5sxjOCCUuHCQxg":{"text":"This is a super good and fun steak house located just off Canal St at the beginning of the","useful":0,"cool":0},"qrjR3_4Tfxlr_a5aI6giPw":{"text":"Everything we ordered was delicious. The bacon wrapped oysters, oh we wanted to order it 5","useful":0,"cool":0},"7L7OE8sSmAwpS7SPnkUfgQ":{"text":"Went for the $5 after 5!!  Yummy appetizers and drinks!\nWe had the Tempura Battered Shrimp","useful":0,"cool":0},"_WXRziO_dWBgDvelgjGPDg":{"text":"Had the special 24 ounce ribeye. One on the top ten steaks that I have ever had. The food ","useful":0,"cool":0},"d1XE9_EUuWVagfMBeTw15Q":{"text":"Came here especially for their $5 happy hours. Since we were already a bit tipsy from the ","useful":1,"cool":0},"7VQKhDpo1sxz1gPXwBKRXA":{"text":"Food tasted good but got sick after eating. Kind of disappointing when paying for a $44 po","useful":1,"cool":0},"l1Tz6MQa26g2ZS2AqyIKZA":{"text":"Our first night in the French Quarter, and  we were  excited to try a new restaurant. Bren","useful":0,"cool":0},"yRSz6vI4g3vj32yfeLYEag":{"text":"Nahh... Not really anything to write home about. The location and indoor setting is nice, ","useful":2,"cool":0},"9SxOrJpT9FDs8bdNsoUeGQ":{"text":"I have walked by this place numerous times going to Acme's. I finally tried this place the","useful":0,"cool":0},"80kbVSq0w-10NQW3LZe-Ig":{"text":"This was probably the best restaurant experience I have ever had...and I am not a young ma","useful":0,"cool":0},"s-ws4WqNz6xRt5N8AX9YHw":{"text":"My darling wife and I made a reservation through YELP and enjoyed a wonderful evening at t","useful":0,"cool":0},"Ek_6zhVZkfVEvSL-jlBRjw":{"text":"A great atmosphere, friendly staff, delicious food, very short wait time with reservation.","useful":0,"cool":0},"00VK2QR20agYNb7rXRS9WQ":{"text":"One of the best steaks I've had in my life.  The story here though, is the service.  The s","useful":0,"cool":0},"2gBWjQw5g_d5fwMfFJ95kQ":{"text":"Excellent dining experience.  Wonderful service.  Our glasses never got the chance to get ","useful":0,"cool":0},"1CClVoJEFKBGLJdu_2aEVQ":{"text":"We were seated as soon as we arrived,  around 6:15pm. Our reservations were for 6:30pm. As","useful":1,"cool":0},"Ofa0HaOHMy77nYjsNdX15Q":{"text":"Good service and the side portions are very generous. They even took us in before our rese","useful":0,"cool":0},"ZVIl1dmz9Fr94kdqIfH9eA":{"text":"Great french quarter restaurant! Steak and soft shelled crab special was a hit. Huge beefy","useful":0,"cool":0},"pUPsQXNdqe5ONbqmwaxUIQ":{"text":"My wife and I were there last night, and had a horrible experience. The service from both ","useful":0,"cool":0},"rKlBUUwlsj3cd0xOJhFSFQ":{"text":"We love this restaurant. The staff is professional, caring, and friendly. The atmosphere i","useful":0,"cool":0},"Yx4ZNKc-yURxBdR9P3MKDQ":{"text":"Despite the great reputation, I had an incredibly tough dry rib eye steak.  While NOLA is ","useful":0,"cool":0},"MtQ40lhFpVl50d6fPmIfog":{"text":"We visit New Orleans from Atlanta every year around the Thanksgiving holidays.  I can hone","useful":2,"cool":0},"-281FOwRxF3BSVNR-j9oiQ":{"text":"I had a disappointing dinner at this restaurant on March 8, 2014. There were 11 in our par","useful":0,"cool":0},"FIsjzUG-EzzaCj8JbOLxoQ":{"text":"Very tender steak, good flavor, great service, average sides","useful":0,"cool":0},"V7F8msfSOm3-HVDODUkLKw":{"text":"Not worth it. They were accommodating when we arrived early for our reservations early but","useful":0,"cool":0},"_RhnZ7zT3itRELaKu9Oo7A":{"text":"I can still taste the walnut spinach/fried oyster salad. I couldn't get enough. The atmosp","useful":1,"cool":1},"Dt8R3Bmtduyegmn6CPX1mA":{"text":"Having already enjoyed other Dickie Brennan restaurants (The Palace Cafe and Bourbon House","useful":0,"cool":0},"wOCuoPtEwFTOkXfULiqoVw":{"text":"The hype was right on! The experience was great. We had to wait for about an hour but hay ","useful":2,"cool":0},"VpPmeGASsmYUZouamkJWXg":{"text":"Hot French bread, salty butter, tender steak and cheesy potatoes au gratin. Not to mention","useful":0,"cool":0},"TzRMNX-rCMy4agceEojtrA":{"text":"After seeing my review on here, the general manager contacted me, heard my experience, apo","useful":1,"cool":0},"9SZf74VFA6-HZ37dfNTM4Q":{"text":"I don't know what all the fuss is about with this restaurant.  It's mediocre in my opinion","useful":0,"cool":0},"6jMQ5qkDkmGwTwNoLlhGSQ":{"text":"Absolutely the best in New Orleans. A staple of New York in the midst of a sub par dining ","useful":0,"cool":0},"Z8590TbyxidoqgQjWea43g":{"text":"Tomato and blue cheese salad was absolutely delicious.  Filet was good, a bit overcooked, ","useful":0,"cool":0},"TTOWWO9Jv-xD2CdXDHXZsw":{"text":"Great steaks and BBQ shrimp . the servers are very attentive . it's pricey but well worth ","useful":0,"cool":0},"VK1tJwqdm9k7W9A1rXeEEQ":{"text":"Not impressed! We visit steakhouses everywhere we travel and can say this steakhouse is ju","useful":1,"cool":0},"e-X-0UGseAEBl656EPAaKw":{"text":"Somewhat of a disappointment. This was our anniversary dinner so we went in with great exp","useful":0,"cool":0},"h4wnj4_3IULF1E7MqOMJHg":{"text":"Lively atmosphere. Good service. Great food. We grabbed seats at the bar while waiting on ","useful":0,"cool":0},"UEbcfgCHnA0pqx74RK1Pow":{"text":"This is a fancy restaurant with fancy prices and fancy food. The service etiquette was ser","useful":0,"cool":0},"FzrM_1jwWS8oqGq-vU-lqA":{"text":"I had high expectations of this restaurant and I was disappointed with the quality of food","useful":0,"cool":0},"nUti5gYNR0trAwM4DHZmrQ":{"text":"Very disappointing based off of what we read about this place. Food was mediocre and the s","useful":1,"cool":0},"OQ21ddwxSbZWXRaixUqkgw":{"text":"I had  a party of 10 at 7:30 pm, our waitress greeted us and her personality was as cold a","useful":1,"cool":0},"VxBw59ujXnGRQEiKw46MJg":{"text":"I expected the service to be better. Our table server had an attitude, and I felt uncomfor","useful":2,"cool":0},"sdsB97u8FeibM_bO2jjNvQ":{"text":"UPDATE:\nWe loved this restaurant! I'm glad we gave it a chance. I had looked into other pl","useful":0,"cool":0},"fDdF98tBHxUEJD0SRgZpWA":{"text":"The popularity of this restaurant is probably geared toward tourists. I would not recommen","useful":2,"cool":0},"QUN3-Uf6H7G8ePSFrERtVw":{"text":"Literally the best steakhouse EVER! I have been a few times and this past time was the bes","useful":0,"cool":0},"zCFSzQMgsEnW4nAi-WUE9w":{"text":"Want a light, cool meal on these incredibly hot days? Try the crab cake off the bar menu. ","useful":0,"cool":0},"DGtD00K0lowWhQxWi2unhA":{"text":"Perhaps I built it up too much in my head, but unfortunately Dickie Brennan's fell short o","useful":3,"cool":0},"sHncrZmA3_B9cdStJ7Ll6g":{"text":"Great atmosphere and the filet mignon was perfect. We had Ruth Chris a few nights before a","useful":0,"cool":0},"JkobQJUWki5J92C0IDMxXw":{"text":"If your looking for a classic steakhouse in the French Quarter and need that fix, well her","useful":0,"cool":0},"kDIHiFKeXn70LtJUTb8IGg":{"text":"My friends and I wanted to go to an upscale steakhouse for our last night in New Orleans, ","useful":0,"cool":0},"LSDxwZVIAxl4QEzSy9e_5w":{"text":"Perfect light meal before concert at the House of Blues. We had no reservation, no problem","useful":0,"cool":0},"zBD2phSlIYhSM9-V6eluwQ":{"text":"This is a very nice typical, upscale restaurant with excellent service. Food was delicious","useful":0,"cool":0},"OBD-6UDRqNvAYl62Y2SNXw":{"text":"This place is great. Great steaks, not too good for vegetarians. The service is fantastic ","useful":0,"cool":0},"BrGEUvGvS_U_bm6Ejj-wIw":{"text":"It was a nice place but would probably not visit again. We found our filet dinners to be s","useful":0,"cool":0},"JdrBNTIz-4iXv81c5jc9tQ":{"text":"Amazing food compared to other touristy places we've tried. And staff was awesome. They we","useful":1,"cool":0},"PQbk7dNANqumJFj_xyXZKA":{"text":"Dickie Brennans was the highlight(s) of my N.O. trip last week. So good that i came back 2","useful":0,"cool":0},"mHgFLF85CUSx1zW2TMfLSA":{"text":"\"Solid steakhouse\"\nReviewed September 15, 2011\nWhat was most surprising was the quality of","useful":0,"cool":0},"2Er5XmqvluL7ZDYm7SwODw":{"text":"Steaks here are fantastic. The filet was wonderfully cooked and so flavorful. Side pepperc","useful":0,"cool":1},"1vfBr1tUFh0EozucHVbb-Q":{"text":"OK so if your objective is charm and quiet ambiance this isn't the place for you. \n\nIf you","useful":0,"cool":0},"PCJpmcYB2y9rejp9nN6_UQ":{"text":"This could be my favorite fine dining restaurant in Nola.  Seriously.\n\nThe steak has some ","useful":0,"cool":0},"4-CFx75yYF2CCZvnPSD1lw":{"text":"Quick review - make sure you try the roasted oysters which are good. .. but be sure you ea","useful":6,"cool":5},"_JtJ5RG1sM6h8Qxp5f4O5w":{"text":"I ate at Dickie Brennan's in New Orleans on 06/19/2018. We had a party of six and arrived ","useful":0,"cool":0},"-x2qtp8Ip-UuBuJTopkJpQ":{"text":"I love a good steakhouse and this place did not let me down. I came to celebrate my bfs bi","useful":0,"cool":0},"eCUYI3PqyNlVyJJIutZg0w":{"text":"This is absolutely the best restaurant by far we have ever eaten at in New Orleans. The fo","useful":1,"cool":0},"xMe6qsc-TpuwRobHtERw5Q":{"text":"Great service and the food was excellent, steaks were cooked exactly as ordered and were v","useful":0,"cool":0},"lS0D0CStMvuseP3rhp5lTQ":{"text":"Second time here, just as good as the first time.  On my next visit to NOLA  I will eat he","useful":1,"cool":0},"NzbNJyJR5l8E2ouTcdpftA":{"text":"Solid service and dining atmosphere, but disappointing steak. \n\nWe ventured to Dickie Bren","useful":0,"cool":0},"9aFY13xvUOhn7PV1PPsx1A":{"text":"The food was pretty good. I had the crab cake and a ceasar salad. It wasn't the best but, ","useful":0,"cool":0},"K3mqDu6a3sikRIPGZrImBw":{"text":"My wife, in-laws, and I ate here this past Saturday and it was FANTASTIC! The house filet ","useful":1,"cool":0},"9c30N3zZAs1GYRYlu4Q5eQ":{"text":"For a prized steak house...it did have excellent service..although a little rushed. Howeve","useful":0,"cool":0},"hiGmVRvG04XpnmIuiP0j-A":{"text":"Went for the banana bread pudding which showed pieces of banana. Got there and placed the ","useful":0,"cool":0},"Ds25Z1V-A8Nt54sD6mf4aA":{"text":"Outstanding service. Chris, Alfredo and support staff were all fantastic. It's not their f","useful":0,"cool":0},"LP5pj-UnMRfFoToGrXDF7Q":{"text":"highly recommened  the filet and the ribeye! Fantastic!\nTurtle soup is also worth trying!","useful":0,"cool":0},"4_6hREMUR5hTQ2ZwyeRz8w":{"text":"Wow. I realize how one's experience at a steak house may vary widely for a variety of reas","useful":1,"cool":0},"vEyEUgpQ0X0VF2J59UcwyQ":{"text":"Had a nice pre-meal at the bar waiting to get in downstairs at Galatoire's.\n\nI've tried ma","useful":0,"cool":0},"Oa6D8dZHNW1A5PKvzND4IQ":{"text":"What fabulous service and food.\nHad escargot with bone marrow and fried oyster mushrooms, ","useful":0,"cool":0},"STNkGu5iwugVP6vJMlV6NA":{"text":"Service was top-notch. All the food was excellent. We arrived for our reservation and were","useful":0,"cool":0},"B0wv6of4EQLEJhftAks1KA":{"text":"Jamie W. and I were looking for some fine dining on our last night in New Orleans, but the","useful":8,"cool":5},"cupsODyx2EquCzaIQPVQMQ":{"text":"This would have been a very fabulous dinner if the timing and temperatures of our food had","useful":0,"cool":0},"9WWjHBZEbVehGmct9YAgbg":{"text":"We were expecting so much more! My steak was good, wife's steak was not. We were so neglec","useful":4,"cool":0},"Vwy1uk7N4z5BxZ4B63yEjQ":{"text":"Great food & service \nMy only advice is before they seat you make sure you ask to sit alon","useful":0,"cool":0},"Q8Dzk4aHu5ir0l28stXjBQ":{"text":"The biggest disappointment I have had in a long time. Shocked for a renowned restaurant.","useful":0,"cool":0},"MCWm7nrGpvic2vcnAdPWQA":{"text":"The drinks, service and food were wonderful! \n\nWe ordered the crab fingers and the Ibervil","useful":0,"cool":0},"zRuyu-KZK2PMaR0GyNcHlQ":{"text":"I can honestly say, the ONLY reason I gave Dickie Brennan's a 3 was the service, otherwise","useful":0,"cool":0},"TZOvrJ1of7fsSA0d7P11lA":{"text":"Dickie Brennan's is usually my favorite restaurant in New Orleans and we ike sitting at a ","useful":2,"cool":0},"_s3ZH-S0opebxdH_sKRJ-w":{"text":"I loved everything about this place. Service was first class and the food came out perfect","useful":0,"cool":0},"o29uE_QS9MVKrizhbUrdKg":{"text":"Great ambience and overall environment. The steak and sides dishes were delicious. The coc","useful":0,"cool":0},"NWMrCdpo77u4BxVEOLYTjA":{"text":"Excellent place to eat!!!!  The service was great and the food was amazing.  I had one of ","useful":0,"cool":0},"z1FeirO9r_GQTs6hD3cFKQ":{"text":"This place was very tasty (and pretty pricey).  My husband and I both ordered steak (there","useful":0,"cool":0},"ePJBiCG4EuedsfeSGnXaxQ":{"text":"Probably because of the amount of people there for Halloween weekend, but my steak came ou","useful":1,"cool":1},"-R0idxJZlWJqVsTusDIXGg":{"text":"Amazing. I got a steak that wasn't on the menu, but you can ask for it. Off the top of my ","useful":0,"cool":0},"nvczVlrcwruc1XFCyGBY0w":{"text":"Decided to eat here one night to take a break from the southern fried foods...  There's on","useful":0,"cool":0},"9qi7g9XOrOH6TgONc76BSg":{"text":"My babe and I just finished dinner at Dickie Brennan's tonight.  We arrived at 7 and were ","useful":28,"cool":29},"Aj0A8EgH5L82gSuUf_MlqQ":{"text":"Steak ecstasy....\n\nThis place came recommended to me by our hotel concierge and well, it w","useful":1,"cool":1},"8HVRvhsp9Z1D_Gu8w9bglg":{"text":"Ordered a ribeye, it was tough and chewy....told the waiter and he didn't offer to take of","useful":0,"cool":0},"-y8lqR7_VtcliKFhanPurQ":{"text":"First time visiting. The atmosphere and view of the street were great. Staff and meal were","useful":1,"cool":0},"VXU6z24s2c4YODHdsTv81Q":{"text":"Always loved this place now they have changed the recipes on our favorite items and it's d","useful":0,"cool":0},"LynkeuRZhTKkUeHPBAOjPQ":{"text":"Yelp showed lots of pics of Brussel sprout and my girlfriend  loves them!  and guess what?","useful":0,"cool":0},"lmNCIzjLm7pJblKYpnPnnQ":{"text":"It is a very good steakhouse. During the happy hour time, it just cost me 5 dollars for a ","useful":0,"cool":0},"_wMoiAKO2gOchHZj1qQcpg":{"text":"Unfortunately this did not at all meet my expectation. Very noisy, and very very rushed. T","useful":1,"cool":0},"vUozHmXPcbzqCJPUC2LxWw":{"text":"This is a huge steakhouse in the middle of the French Quarter.\nThe good news is that sides","useful":0,"cool":1},"80SSyqbx8tFeAClBzh5beQ":{"text":"Dinner here was good. Everything was as expected. One of the steaks ordered rare came out ","useful":0,"cool":0},"-hLfdOZRFQ3_sFNs3hBiVQ":{"text":"This is a classic white linen table cloth steak joint. The food and ambiance were great, a","useful":0,"cool":0},"rvDfQCCqZKilW4LKFAlHLA":{"text":"All I can say is Coconut Cake.\nGo and eat it.\nOUT OF THIS WORLD and I am a chocolate nut, ","useful":1,"cool":1},"GdLfpb-Fli43TKgNiW8SHg":{"text":"Hands down the BEST service and food  I've had maybe ever! Beautiful building and superior","useful":1,"cool":0},"TZtPaNKWXQGvDsJF1CHBTg":{"text":"Not gonna lie... I was skeptical.  I've had some great steaks.  I'm talking A5 Japanese Sa","useful":0,"cool":0},"ogn0SwaOZmZnw1Zimg9kQA":{"text":"Awesome!  Atmosphere was classy and chic. We had Lamb Chops with Moroccan Spices with Lent","useful":0,"cool":0},"0fl2AhmFAIoK_Odyqx6XSA":{"text":"Came here on game night! \nThe atmosphere was great and the service was wonderful and very ","useful":0,"cool":0},"VnWuLjRSusk_vgfklkZeTQ":{"text":"The food was good (B+), but the service was mediocre (C-).  First, our appetizer came befo","useful":0,"cool":0},"Lpo7TqfKd34albZGiRhpYg":{"text":"Headed to the bar for a main course. Greeted by Gerry who immediately grabbed my hand and ","useful":0,"cool":0},"3uPR1Ah2bwBPRgg1ghKpwg":{"text":"GREAT Happy Hour!  We sat at the bar and had Dirty Martinis and Spiked Arnold Palmers.  Th","useful":1,"cool":0},"2hrXw7ij3_claFUQFbuW1Q":{"text":"Best steak I have ever had. It was cooked perfectly and had awesome seasoning. Also had am","useful":0,"cool":0},"2GQTWp_1bRbQchh6BW595A":{"text":"The staff made my Dad's 70th birthday so memorable and special from the moment he and my s","useful":0,"cool":0},"-NLFq_j3BcMNN0AwPmQDvg":{"text":"Everything was delicious from Crawfish Cakes to Prime Rib/Rib Eye to Triple Chocolate Cake","useful":1,"cool":1},"iWsms3UcVJiKODIPyL6oxQ":{"text":"My cousin and I strolled into Brennans's  recently on a Saturday in July around 5 p.m. We ","useful":0,"cool":0},"r01Cv4mb0C68gzOwAFBkNg":{"text":"My husband and I ate at this restaurant in February 2013.  We had tried all of the various","useful":1,"cool":1},"dbO85K6Ub47wNw6OnqKcOw":{"text":"I have enjoyed Dickie's for years and years.  The food and service have always been specta","useful":1,"cool":1},"V2bSB7FfxP3gCe8cIOtkZA":{"text":"The service from Rebecca 1 and Rebecca 2 did not impress us.  Alex did a good job filling ","useful":1,"cool":0},"E1H1b920EVIIm5CpBnI3Ig":{"text":"Came here with 7 others for dinner.  Atmosphere was nice and service was nice.  The reason","useful":0,"cool":0},"krhhGGbPTJ39Pej1DMDAJQ":{"text":"I'm fucking torn here.\n\nOn one hand, I had stellar service in the bar area.  Both barkeeps","useful":5,"cool":3},"Ys4DxZ1TXiLrQe8JJDAftw":{"text":"Best restaurant I have ever eaten at! Service was stellar and food was out of this world. ","useful":1,"cool":0},"vSvoqa9O2tYvQU5iHQaktA":{"text":"Wonderful!! Great Gumbo and the chateaubriand for two is outstanding. This is our4 time to","useful":0,"cool":0},"IiwSL43lxMtJW70M0wyp1A":{"text":"Wow! This place was amazing! Their fish is excellent and their au gratin potatoes were to ","useful":0,"cool":0},"Gv18IBfB2OVMkUF531afrw":{"text":"I went last night with a party of 8. Service was prompt and polite. It was only really lou","useful":0,"cool":0},"_B_o5uwuWMA8GGSvFO2gKg":{"text":"What a disappointment!  After getting a suggestion to go here while at a business conferen","useful":0,"cool":0},"E3FLay5H60umqKPd678_qA":{"text":"The food was delicious and the wait staff were so nice and attentive. We arrived what some","useful":0,"cool":0},"A58soS5_HC1IFLPnW2aaog":{"text":"Dickie Brennan's has been THE STANDARD for Louisiana for some time now.  (Especially since","useful":9,"cool":4},"uFJVXsMa1BWphsnzr0x2oA":{"text":"Hands down - the best dinner of our trip to NOLA!\n\nWe came here as our last meal on an ann","useful":2,"cool":0},"VX-6cGzTW7WWdsqGjir6RQ":{"text":"Great service (minus the hostess who will try to seat you in a high top near the bar vs. a","useful":1,"cool":0},"uUOrvJCZ0O3F9edmvMvR_w":{"text":"Yes yes yes. First of all, the customer service needs to be shouted out here. My husband a","useful":0,"cool":0},"XTMR6lxTvhFsYQOT2UIonA":{"text":"Our party had to eat in three separate shifts as the kitchen/waitstaff messed up our order","useful":1,"cool":0},"mIIjJJntnTf00eA3Sb7cEA":{"text":"The escargot was simply to die for!  The squash soup was okay but nothing that stood out. ","useful":0,"cool":0},"YOl-UA-EyjiBny_gQKoZGw":{"text":"Update:  The manager of Dickie Brennan's contacted me personally and asked me to give his ","useful":0,"cool":0},"sNHVYu3shVlthfsii_R3Dg":{"text":"One of the best steaks I've ever eaten out at a restaurant.  But it's New Orleans and it's","useful":0,"cool":0},"K-nWyBxIw_3odO-QUxkJug":{"text":"I had one of the best nights of my life here. \n\nIt's so sexy inside of this restaurant. It","useful":8,"cool":5},"O9_dxOYaHH3sRMiLA9x7Vg":{"text":"Service was excellent.  Bread was very good.  Our meals were pretty good.  If you're looki","useful":0,"cool":0},"qpm6VnJtfQSRpBhpts8kVA":{"text":"Dickie Brennan's smoke-free, upscale, white table cloth dining was the magnet that invited","useful":1,"cool":1},"WlHygR1fbhNoiGcbTV-KxQ":{"text":"My wife and I went here for our anniversary dinner.  We have nothing but good things to sa","useful":0,"cool":0},"ijP0R7wpfJxcv798Embd-g":{"text":"Best restaurant of our visit: Dickie's was one restaurant we were really looking forward t","useful":0,"cool":0},"vCSxDMk6v9Tj9S40S9DzvA":{"text":"When I passed through the entrance, it felt like I entered the lobby of a hotel.  Behind a","useful":1,"cool":0},"rONl7RowimUANz6rLT_t8Q":{"text":"Always enjoy the dinner and staff at Dickies.  Steaks are delicious and service is amazing","useful":0,"cool":0},"Gn_AYGqiaEpFSuCyeIFbhA":{"text":"The Dark and Stormy is their best made drink. The prime rib was cooked to perfection, the ","useful":0,"cool":0},"hwv9wrE9cU9vZp5qfF4CTA":{"text":"What a terrible 16th Anniversary meal. If you know good service and good meat, DO NOT FALL","useful":0,"cool":0},"bX9aWUGI8k5_IW3Q9S768Q":{"text":"Great spot for my birthday celebration with BJ!  He mentioned on Open Table that we were h","useful":0,"cool":0},"lwRoHr44Qru9HbZQo8YoQQ":{"text":"Old time New Orleans steakhouse vibe. We came here because someone in our party has Celiac","useful":0,"cool":0},"YAW6GnO2LXPpr2bElM2IXQ":{"text":"My family and I came to enjoy the COOLinary menu. We've lived in New Orleans all our lives","useful":0,"cool":0},"s66tIdFeTRXSZqVPwWDOOQ":{"text":"We made a dinner reservation here on our first night in New Orleans. After a day of drinki","useful":0,"cool":1},"hm1CnPh8_xWM_O3Xm-VlQg":{"text":"We were in New Orleans for the weekend and was walking around the French Quarter trying to","useful":0,"cool":0},"_i7Iha-QuZKDvnk8-eRIGA":{"text":"Three girls went here for a birthday dinner to celebrate our October birthdays. The servic","useful":0,"cool":0},"fJ_yN16OmzTJOsEPUzYEqg":{"text":"Excellent food.  Beyond excellent service.  The wait staff was so friendly and accommodati","useful":1,"cool":1},"OPgMk8tJ4GUJEYehpigJOQ":{"text":"This restaurant had one of the best filets I have ever had. Cooked to perfection with amaz","useful":1,"cool":0},"9ER83f_ihITSzhlz2Z5Imw":{"text":"Living in Chicago, we have lots of great steak houses, so eating steak is not a big deal f","useful":0,"cool":0},"tWdrlK6q5UJQyYifUUAxFA":{"text":"In all its pomp and circumstance I expected a lot more from Dickie Brennan's. My last visi","useful":1,"cool":0},"ZwthPlBcXesHkOhR55oGqA":{"text":"This was the worst steakhouse experience I have ever had.  We were greeted politely by the","useful":1,"cool":0},"qEe1vjdbAB5QFauUkw5LPw":{"text":"By far the service was top notch and attentive to me and my girl's needs. The food was exc","useful":0,"cool":0},"Hl9MqR-J5MDgXERst5wqOg":{"text":"The only night we didn't go for oysters & crawfish, my friend and I ate the prime rib at D","useful":0,"cool":0},"q_VOMr1JdNVYUlm6N6rwLg":{"text":"It's been a few months now but this review is for my first and only time dining here on th","useful":1,"cool":0},"4dqrsHw6GnvKwOFtwJuj4Q":{"text":"My wife and I came to NOLA for our one year anniversary and I choose Dickie Brennan's for ","useful":0,"cool":0},"mKs7uyAWR6j5Og7PnCH2Bw":{"text":"Terrible customer service. We called to re confirm our reservation and the lady who answer","useful":3,"cool":1},"jOaddsAaMyy5MnoYTARIJg":{"text":"This was a great place for dinner. I strayed away from the steaks and went straight for th","useful":0,"cool":0},"OcrIVOy2ZtYRuCg2gtvaiw":{"text":"I brought my boyfriend here for his birthday, since he previously told me he really liked ","useful":1,"cool":1},"oZyYrLUBW0YJOL-72N5CCQ":{"text":"Absolutely the BEST and by far my FAVORITE restaurant. Not only is the food delicious but ","useful":0,"cool":0},"t161HjHHsI-ahGS-hkkTDw":{"text":"Last time i came to DB was 10 years ago with family members when younger and loved my whol","useful":1,"cool":0},"D_DMGNyRnpc-fxrgR1NT-g":{"text":"Our 3rd visit to Dickie Brennan's over the years, and this was by far the most disappointi","useful":0,"cool":1},"9X1OVtD8vj-Dj57JJLXAcQ":{"text":"This was my first meal in New Orleans and it was pretty amazing.  I got the chef's special","useful":2,"cool":0},"VZTp1HaisX0wxPQHJb6gLg":{"text":"Went here with my husband to close out our vacation. Atmosphere was very lively, not place","useful":1,"cool":0},"BiAJ9RWYuLUwwPM8CRaKoQ":{"text":"A country club style atmosphere with rich wood paneling and large white linen covered tabl","useful":1,"cool":1},"QlU9FjzQyfjSqlOx4ZT9BQ":{"text":"Best steak I ever had.\n\nWas in Nawlin's for a good friend's wedding we went here for what ","useful":1,"cool":1},"TcSX9Z5hsveMGJKLn0YV-w":{"text":"The food is good but the menu is limited. Additionally, we sat around for a long time for ","useful":0,"cool":0},"0OaCLoYkOA35HvyxhGyMIA":{"text":"Enjoyed our annual convention Customer Appreciation Dinner at Dickie Brennan's Steakhouse.","useful":0,"cool":0},"RpNge6Ti9xALX4xrljkyfA":{"text":"We only went for dessert.  I couldn't possibly go to New Orleans without visiting the birt","useful":0,"cool":0},"DtU5XYNNQ6PuOEKMuDLoaQ":{"text":"I had heard very good things about this place but was sorely disappointed. Service was ave","useful":0,"cool":0},"CKXsD1KavN1ZkwoSNBF7og":{"text":"Dickie's was fabulous.. It's a formal or casual establishment. Very high quality service. ","useful":0,"cool":0},"nO1CJUP_A8SS4HVztlHNyA":{"text":"First, I would like to apologize to Jeff Ruby for cheating with another high end steakhous","useful":3,"cool":0},"g1N54IvzFaZ9Tm-fOq82gw":{"text":"If you want to go there fir nothing else, go for the turtle soup and the house filet\n\nUniq","useful":0,"cool":0},"O0rps2IEdC0yoa6UEyjIaQ":{"text":"For the times I visit NO I always find a way to come to DBs. The beef skewers are to die f","useful":0,"cool":0},"Xq9R2uso_Zb_q14YZj3Rlw":{"text":"The restaurant had a long wait time but we were fortunate enough to find seats at the bar.","useful":0,"cool":0},"C-uygfmWdVNfOpRqoEg2TA":{"text":"Wife and I visited on a recent vacation.  Truly loved the food and the service.  We both o","useful":1,"cool":1},"oGCmDLa4wqj25JA-KPsUpQ":{"text":"The steak was... fair. The turtle soup was amazing. The \"ice cream sandwich\" was ridiculou","useful":1,"cool":0},"RmSaJz9bXds16Cg9cRoq-Q":{"text":"Overall an OK place for dinner but not worth the prices.  Dinner for two with a few drinks","useful":0,"cool":0},"JcgRd_vU-ElC8SddwIo7fA":{"text":"Very nice restaurant with great ambiance; Unfortunately they allow you you to enjoy it way","useful":0,"cool":0},"bGOj1zofsJmvs-7tTDrUsw":{"text":"Solid steak, service and company I had my birthday while in NOLA and we wanted meat. We we","useful":0,"cool":0},"VD_WKFQXqrRb6mC3Jk1_FA":{"text":"The food was fabulous!  Steak cooked perfectly, potatoes au gratin were the best I've ever","useful":0,"cool":0},"U-EWu-nnbA0xvvHTDkiHtg":{"text":"Classic steak house near bourbon street with big steaks, great wine and a New Orleans styl","useful":0,"cool":0},"o2azMXRxudhbsiC0sXagHA":{"text":"This place is amazing. Have eaten here twice and both times have been blown away.\n\nTonight","useful":0,"cool":0},"xJB9MoR9pQ4xrbt95NFOfw":{"text":"So here is a little story about last night (3/23/19). We went to Dickie Brennan's Steakhou","useful":1,"cool":0},"vcqgvzUoB7eu33yZfTPUWg":{"text":"Nice Steaks with Shrimp and Grits also,  what more can you ask for?  Nice formal place to ","useful":0,"cool":0},"LIiz1iCnc-Jd_Cvjs1--_Q":{"text":"Good food but great service from Felicia and Mike Warren. I had the ribeye and I didn't ne","useful":0,"cool":0},"Fu76ol5WgNNQxcHFxzTVWg":{"text":"Stopped in to enjoy their happy hour specials (they had a decent selection of items). They","useful":0,"cool":0},"yo1cjm9OEFHGlj-dBPlAZw":{"text":"Was there for a bachelor party along with twelve others. It all worked out really well.\n\nT","useful":0,"cool":2},"JTT1vnZ0aBGR97vRwFWnQQ":{"text":"This place was awesome! From the wait staff to the food we could not have had a better exp","useful":1,"cool":1},"eRrcrjDQcAoeBYm_Eo7W7Q":{"text":"We came here the weekend of 9/14/18 for our 1st anniversary. We are from NY & my husband s","useful":0,"cool":0},"KXVk6P4puS4uOvFwVnSbHg":{"text":"Started off with reservations for 4 at 7:30 on a Friday night. Arrived on time and had to ","useful":5,"cool":0},"v7gIv4uY_GkKdkMOrPwugw":{"text":"Excellent food. I had the scallops and they were very tasty. Atmosphere was nice and the t","useful":0,"cool":0},"dNDR7tFsc99D9soteEJHIg":{"text":"Just like a traditional, premium steakhouse. Good meat, large sides, tasty dessert, fine d","useful":0,"cool":0},"546gWZOdJNdIkqEF9FwOGw":{"text":"Great steaks! Great service! Very intimate atmosphere .. absolutely delicious one of the b","useful":0,"cool":0},"YDC-9CSIu3-7jNo1uSHmnQ":{"text":"Everything we had was excellent! Most items were labeled gluten free or could be made glut","useful":0,"cool":0},"goopv4UBT40mP9l1C_vfTg":{"text":"I come from an area that is filled with incredible steakhouses.  Went to New Orleans and w","useful":0,"cool":0},"22KJHp7Clchr3DR3EBjwsA":{"text":"Late dinner, right before trial and I wanted to make sure I had a good steak before i went","useful":0,"cool":0},"6DBBEIIm6tHserGt6HJs4g":{"text":"We were there around New Years day this year.  I had the prime rib, ordered medium rare.  ","useful":0,"cool":0},"arv526ZJrJEgzkXeMr6gtg":{"text":"Ate here with 2 of my girlfriends for our birthday celebration! We were seated immediately","useful":0,"cool":0},"rkWMNJxTeAHjUHtdivcCWw":{"text":"Great steakhouse with an impressive wine list.  We started with the fried portobellos whic","useful":1,"cool":0},"WeFCIoWPbvvWCEDcARxYjw":{"text":"I had the prix fixe lunch. $20. Awesome food. Wedge Salad. Petite Filet. I ordered mango s","useful":1,"cool":0},"eJt3Z-fvYHcrQCKexHiAug":{"text":"Ok, so this is a limited review and it's all about oysters.  \n\nIf you've come to the Frenc","useful":0,"cool":0},"9zu7fJ-AuVBsX47gjUuzYw":{"text":"Perfect steaks and amazing service. It's expensive, but the attention to detail by the sta","useful":0,"cool":0},"GrZy9Eb5vDJ7fLKlC61Nwg":{"text":"I've tried pretty much everything on the menu. \n\nSo here's the \"to eat\" list:\n~escargot (b","useful":2,"cool":0},"k9DwAhjl1rx_TuErhVr2NA":{"text":"Was here w/ a bunch of great friends, service was timely accurate, very very delicious.  S","useful":0,"cool":0},"Nz5ljy-vhUhSvKFxKPQE4w":{"text":"The service what perfect. The steak was good (Ribeye)...I've had better from here. A very ","useful":0,"cool":0},"QDGo9ZHCy9f4o-jeHOigRg":{"text":"I have been here 3 times now and I think I can form a pretty good option and review finall","useful":1,"cool":1},"NIUJ7ez_8s-JUe5OfiHhlg":{"text":"Hallmark was great service from the bar to the table. One plug for the staff, close your t","useful":2,"cool":0},"hRFvueshwl5QpXg-ZJIRow":{"text":"grab a 2 foot iced drink on your way over, stand in line, sit down, class it up and order ","useful":0,"cool":0},"KG6cdGrpJ_qSbKnt_jm-sg":{"text":"Arrived early for reservation so we grabbed a seat at the bar for a pre-dinner cocktail. T","useful":1,"cool":1},"VfzOgu9dWw65cGquaIGIAA":{"text":"Very very good steaks, but nothing especially stood out to me as unbelievable, with the ex","useful":1,"cool":0},"7_qKpQgyudmhS_Gg_LgE3w":{"text":"This spot had a 45min - 1hour wait but thank goodness we found space at the bar. Fresh oys","useful":0,"cool":0},"iur6oSJ4OaqrKScpKfuxGQ":{"text":"My party of six had an exquisite dinner at Dickie Brennan's in celebration of my friend's ","useful":1,"cool":1},"DFptLrLyh22LmEHAu_driw":{"text":"I absolutely loved my experience at DB's. \n\nFirst of all, hats off to having a parking gar","useful":1,"cool":0},"iswxNRK75KHt6vDoXXNSRg":{"text":"came here for happy hour on New Year's eve day and had delicious cocktails and bar noshes.","useful":0,"cool":0},"amSnjdvsgrzoiKMod5cbyQ":{"text":"The service was good- the staff i thought was stretched thin and overworked, but they did ","useful":0,"cool":0},"BZqbhvAhMTxLaJxnu-eD6A":{"text":"We had a good meal here this evening. \nThe atmosphere was good and the waiter/waitress sta","useful":0,"cool":0},"3vheN0kuP5D3nu8G0g0KBA":{"text":"Obviously, the steaks are amazing. I've lost track the number of times I've eaten here. I ","useful":1,"cool":0},"ppmcHP3KhS6I8EclFm0CNQ":{"text":"Definitely recommend the table side martinis! I had the politician they are made with Gin ","useful":0,"cool":0},"7qVYIoU1XSx4o54qNFO9sg":{"text":"Dickie Brennan's came highly recommended, and so my wife and I decided it would be make a ","useful":3,"cool":0},"pzK4wUUuwZYpl7zuUf7h8Q":{"text":"This is my favorite restaurant of all time, I wish I could eat here everyday! The service ","useful":0,"cool":0},"IGPNdkKc4jWtqo7dCJjC8w":{"text":"Where do I began?! I searched for a great steakhouse for our final dinner in New Orleans. ","useful":1,"cool":1},"6Zu7kGqgb1bXCNrLCTVn1A":{"text":"I don't know if it's because I have had such great steaks at Pappa's,  Bohanan's , or Keen","useful":3,"cool":0},"-6-Ufq7jjj_qB-09ltudQg":{"text":"7/28/19\n\nTime to up the rating. I can honestly say I don't think we have been disappointed","useful":0,"cool":0},"Yj92p7omyjhh2K0JaBzyzQ":{"text":"I wanted to like this place but I cannot. Honestly the steak at Golden Corral would be bet","useful":0,"cool":0},"GNMzhn4WquibwP5F9x-pMQ":{"text":"The manager of this restaurant is the only reason I am giving this restaurant 1 star. So l","useful":0,"cool":0},"-SFVha4cAk168_052yWw-Q":{"text":"I had the strip and it was cooked to perfection. a real good taste and great quality of th","useful":0,"cool":0},"F-ChRzebHfefQgRb_-SR4g":{"text":"Celebrated our fiftieth wedding anniversary there.  Darryl and Megan were our servers and ","useful":0,"cool":0},"_6C5UPKn-H8Kky0y-La-Dg":{"text":"Wow!  This place is so good I don't know where to start.  Just fabulous.  They get it!!","useful":0,"cool":0},"gnhM4Iz6t6iUbkTIdYdU9w":{"text":"This place is awesome.  I have been here several times when on travel, mainly due to prefe","useful":0,"cool":0},"i_3GYBR1QRyS93sEuostKA":{"text":"One of my favorite restaurants. The steaks are fantastic. The wine and cigar selection is ","useful":0,"cool":0},"Zsrl9bt6r20OZI6_gEKFpw":{"text":"Service was very subpar for that caliber of steak house. Steak was very good, however I be","useful":0,"cool":0},"YlBiT9rg99k21myK8OTCYw":{"text":"This place reminds me of old school chop houses with a Sinatra rat pack feel to it!  The p","useful":0,"cool":0},"8POnmLq0BbmohgIXSezhAw":{"text":"Happy hour cocktails (Tom Collins and Martinis) and appetizers for $5 in the bar area. Abs","useful":0,"cool":0},"6MeByOO1FYWHjwHdss90QA":{"text":"This is one of my favorite steakhouses in New Orleans. This place is well designed for noi","useful":0,"cool":0},"92u0ej_-q9Mogd2HPs-pKQ":{"text":"I had an awesome excellent perfectly prepared petit filet with craned spinach and sweet po","useful":0,"cool":0},"bAHxcsPR4_YyGf-QEL--4w":{"text":"Skip this place. Bad food, not worth the price or hype. Can't believe I needed a reservati","useful":2,"cool":0},"CAH5rC8tZUT9L4WIHlqdhA":{"text":"This is the first time I've visited a steakhouse in New Orleans. The food was pretty good,","useful":0,"cool":0},"lxzqOO_Yn1-ssLyNozwuUQ":{"text":"Go between 5 and 7 in the bar for the bacon cheese burger. One of the BEST burgers I have ","useful":1,"cool":0},"tZ8ym2irbHapHdYcHD0OlQ":{"text":"One of best steaks in all on New Orleans. The house filet, served with oysters is quite th","useful":0,"cool":0},"PueC1J_s7RxSwQOa8FsVdw":{"text":"It has been a while since we have been here but we wont wait so long next time. The ambian","useful":0,"cool":0},"24kj1dxQAKqFsAmPisOYiA":{"text":"I sat at the bar alone for dinner. The bartender was emptying the dishwasher and drying fo","useful":0,"cool":0},"NWJnQurcqc-t1qeyFnXMfg":{"text":"On this busy Memorial Day Weekend we decided on a lite dinner in the bar. Service was top ","useful":0,"cool":0},"zIYRlru5_3U8rn9g-fxtQQ":{"text":"Dickie Brennan's Steakhouse serves up the best rib eye steaks ever.  It's located in the F","useful":1,"cool":0},"ok2zN8VtAP92C-JyhNzEQg":{"text":"Boy, do I love a good steak, and this place offers one of the best steaks in NOLA.  The pl","useful":0,"cool":0},"XPlGxcc_uFsJCYTGWsW40A":{"text":"I can't sing enough praise about this place. You won't find a better steakhouse in town, I","useful":0,"cool":0},"glzdwQUH_DQZT47adrWERg":{"text":"This place is like no other in NOLA.  The ambiance is awesome.  The servers are excellent.","useful":3,"cool":2},"oxWuAdzWdAfdI09gcosrKA":{"text":"We came in on a Friday night without a reservation and we were able to get a nice table.  ","useful":1,"cool":2},"Q3ll2SLgwPMNg2tZkV3whg":{"text":"Really expected more at this price range. The steaks were ok at best, I can cook a better ","useful":0,"cool":0},"Tjw1i7SYUHBzDVVbXl-D8g":{"text":"Went here for Thanksgiving last week.  They had a Thanksgiving option, but I ended up havi","useful":0,"cool":0},"lVhBKcuxXZbvFR-FTPBM0A":{"text":"I used to live in new orleans and have visited often in the past 40 years and thus have ea","useful":0,"cool":0},"gEmZX-DvlBpSlai-w8d3Ig":{"text":"Food is very good, but service is excellent. All my party enjoyed their selections. It's a","useful":1,"cool":0},"x-SQsD50XowciFUNKKsoHA":{"text":"Great experience at dickie's where the food and service was only exceeded by the company. ","useful":0,"cool":0},"2yfNYgGRHm4A4dTbb-PlHA":{"text":"When you can order a glass of wine from a bottle that runs the price of a car payment and ","useful":3,"cool":3},"jwNHTSkOHuIOLkF-64hgfg":{"text":"Doesnt look like much from the outside but the interior of this restaurant is really beaut","useful":0,"cool":0},"tyYbflD2XMKTN8TNIH9BxA":{"text":"Monthly steak night part 2! Dickie Brennans, a NOLA staple for good steak close to Bourbon","useful":1,"cool":0},"6OMjqM6GYKN_kblLMkR3vA":{"text":"I thoroughly enjoyed my experience!  The wait staff was friendly and efficient, without ev","useful":0,"cool":1},"YkV_6sWH4A6buQLENq2kNw":{"text":"We were in New Orleans on a girls' trip and looking for somewhere upscale, but not snooty ","useful":0,"cool":0},"DEiHFTuy6WUQa5iNawf8yQ":{"text":"Can we say salt? Because that's all I pretty much tasted from my steak to even my salad! T","useful":0,"cool":0},"qs6W48wl_9EHhWuXnWpZjA":{"text":"By far my favorite place to have a steak in New Orleans. Every single time, my steak is co","useful":0,"cool":0},"Bbkf9ljk9i6ICD2uq5ZEYw":{"text":"The staff was very attentive and friendly. The food was awesome, if you are looking for a ","useful":1,"cool":0},"9mbQh-F_oZ4LCioXdPJNMA":{"text":"I mean, it's expensive. The food was very very good. Do not order the sweet potatoes becau","useful":0,"cool":0},"RzjsFGw8JZaxHPxVMrbbmA":{"text":"My boyfriend & I went there on Thanksgiving Day & were happy they served their regular men","useful":1,"cool":0},"_p0Pgpjf_WPvT9DHATmEqw":{"text":"A group of us (10) decided to do the Reveillon dinner @ Dickie Brennan's in 2012. We made ","useful":4,"cool":0},"koED-1noxcGuoqbLPH6okA":{"text":"I haven't been to New Orleans in a few years. Dickie Brennan's empire has expanded and I f","useful":1,"cool":0},"AAUNm60veRzB56Ofd64Esg":{"text":"We arrived for our reservation. We had to wait for more of our party to arrive (completely","useful":0,"cool":0},"V1k2MuY0fo_IfThvmbspFA":{"text":"Best coconut cake ever! Service was great! Will be returning!","useful":0,"cool":0},"upOjcuyhOArGkoM_JwnZ5A":{"text":"Like many places in New Orleans, your wallet will be made as proportionately lighter as yo","useful":0,"cool":1},"vgT24VzR3_u07tuLjbiGfA":{"text":"Not always do you get what you pay for! I've learned that very quickly while here on vacat","useful":0,"cool":0},"PYrNL3a2Cw72F8AF2WVkZg":{"text":"Dickie's probably serves the best steak in the city; their cowboy ribeye is absolutely on ","useful":0,"cool":0},"M26FWhpDQBEuxoS1cMioMQ":{"text":"Great food! I really wish I could have tried the tartar surf and turf but they were out.","useful":0,"cool":0},"BXIaUKVUY3akcjZHYKq8oA":{"text":"It really pains me to write this up to tonight i LOVED Dickie Brennan's Steakhouse and had","useful":0,"cool":0},"PpC4gRtes2ZKKkBHRtmKig":{"text":"Very disappointing. \nInformation from our receipt Server Charlotte B table 4 8/06/19 at 8:","useful":2,"cool":0},"WAOdPWaJiQ2B9LgwXAfSbw":{"text":"On our last day in New Orleans my husband and I ate at Dickie Brennan's for lunch. What a ","useful":0,"cool":0},"eBOV-fRti3trl7sxYHq-iA":{"text":"A restaurant with high NOLA cooking standard, high fine dining standard, 5 star top notch ","useful":0,"cool":0},"C62R7hqjSZjsy0ZAcLJf_A":{"text":"Able to get a table of 9 on New Years Eve without a reservation which was very surprising.","useful":0,"cool":0},"R9Y_JG_t5GLonyCnpntsAA":{"text":"When I booked my reservation for Dickie Brennan's I knew I was going to one of the best st","useful":0,"cool":0},"_ySFnruEFvoyXJ2HSQCTnA":{"text":"A great steakhouse in New Orleans. I wouldn't rate it #1 but it is very close. The service","useful":0,"cool":0},"hlTCBdozY3vAnI7NufkB8g":{"text":"I was skeptical because of some of the more recent reviews not having very good things to ","useful":0,"cool":0},"xQgBDhsS1il3KooaNqOBjQ":{"text":"Had a fabulous château Briand meal, which included 2 different potatoes,an array of vegeta","useful":0,"cool":0},"F_lIMkRwPCz8GAGtcj3vQA":{"text":"Meeting Venue Review:\nThis place is ok.\n The servers were fine and the food was mostly ok.","useful":6,"cool":2},"tuHMhMe4fEfXc7YVOikF8Q":{"text":"We ate here by accident. We had been in New Orleans for a few days and we wanted to eat so","useful":0,"cool":0},"GqWJ7AzGRO-mGUF9f6aoCg":{"text":"Second night in New Orleans - was brought here by Georgians that always eat there when in ","useful":0,"cool":0},"_OhwymIeYFwjies_b_b4Zg":{"text":"The steak was not very good.  Several people complained about the steak being overcooked. ","useful":0,"cool":0},"0jQPN0D-MOd62WlBB9Ua9g":{"text":"This was our first restaurant in NOLA! I got the prime rib with shrimp, and it was delicio","useful":0,"cool":0},"D2X2HyaXTFtXaPYs291dgw":{"text":"I love prime rib\nMy prime rib here was about the best I can remember. A quality piece of m","useful":0,"cool":0},"SIjbu0subPLGxnLyVoh4xQ":{"text":"This steakouse is probably one of my favorites anywhere in the country! Food is on point. ","useful":0,"cool":0},"akaGXRyNt4XrZ-CSJNCNbA":{"text":"The ambience, food and service was impeccable! Best steak my wife has ever eaten! The side","useful":0,"cool":0},"GGvbY1Nkimb0t_Xw5loItw":{"text":"Dickie Brennan's Steakhouse was recommended to me by a Uber driver, I reserved a party of ","useful":0,"cool":0},"XEfnz7qwS7NGD5vMi426oA":{"text":"We are visiting from another state and my husband made us a reservation about a month ago ","useful":1,"cool":0},"QOzUSl73Ys7t5-2jCHmoCA":{"text":"24oz Prime Porterhouse seared to perfection. Juicy with a very tiny bit of Cajun spice. \n\n","useful":0,"cool":0},"z0dhtUY0hSr1HOo9PkQICA":{"text":"Yelp sent us here and it was a 2 minute walk from the hotel. My goodness dinner was amazin","useful":0,"cool":0},"DDw1LM0dDyeOfO_CoOCgLw":{"text":"Go to Bourbon House instead. Steak just ok. Was excited about mash potatoes but they had n","useful":0,"cool":0},"zzHqJX6o2_5YFbhkDNs2zw":{"text":"From the moment we walked into the restaurant we were treated like royalty and family! We ","useful":0,"cool":0},"k6bqXIQoQg7wc8GsY4bRnw":{"text":"All four of us ordered steaks, medium rare. Three of the four sent the steaks back for mor","useful":0,"cool":0},"xeOCony0UdsI2hyacBszdQ":{"text":"The best thing we had was our turtle soup and the staff seemed like amateur night...every ","useful":0,"cool":0},"rIXPgTLevLkJ_eD1sjnrGg":{"text":"Great reputation! Fantastic food! Disappointing staff. Servers and bartenders. John (or Jo","useful":1,"cool":0},"1SV22Qy9iqXoD3nuMenrIA":{"text":"Dickie Brennan's is our favorite restaurant in New  Orleans, the food is amazing and servi","useful":2,"cool":1},"GAgeVqOMfiO4lHx_UtjEbA":{"text":"This was an excellent meal. We were a party of 4 from out of town. They were able to take ","useful":0,"cool":0},"RX9tg8UhF3nE54fjxbBkLg":{"text":"I don't eat steak, so I'd never been here until it was a work function--meaning it was fre","useful":0,"cool":0},"bod-TczV_PHKKUkfVmx5qw":{"text":"One of my favorite filets!! I love their coconut cake but it seems to be hit or miss latel","useful":1,"cool":0},"EsZBMn8HElT2_KVN8DGeiA":{"text":"I love coming here for one of my splurge meals when I'm in town for Jazzfest.  Even though","useful":0,"cool":0},"sIRiKJBAoPrZuMO44YGDPw":{"text":"Tourist trap steakhouse in the French Quarter. Service was efficient, but not particularly","useful":1,"cool":0},"RCLqguCP7aGNAB4lcClsCQ":{"text":"Came here for a bachelor party and overall the place was so so.  We were seated in a nice ","useful":0,"cool":0},"8-6YK87v1sN5FZkAkwKL8Q":{"text":"First time at the restaurant for a friends bday.  There was a large group of us and we wer","useful":1,"cool":0},"0xVGyHZxbA-gnyZyzVvefg":{"text":"Not my cup of tea. The interior is quite nice but the food is really kinda mediocre, as is","useful":0,"cool":0},"7LC3I_JlOaaAdD-YEry69A":{"text":"I know you're wondering.... what is a vegetarian doing in a steakhouse? \n\nWell, I took my ","useful":0,"cool":0},"JNPRLjENKxAvssjO8H2NLQ":{"text":"My husband and I were in NOLA for NYE and made 9:00 reservations for a nice steak dinner. ","useful":0,"cool":0},"qdDDG3ngSVWarrzn6CXW5A":{"text":"Great steaks every visit!  A great go to spot in the French Quarter. We had the kabob & fi","useful":0,"cool":0},"efIrAHdVx2DSDO1HmuDQ2Q":{"text":"Although we felt under dressed walking in from sight seeing, we were treated with respect.","useful":0,"cool":0},"grRMXD2b4_9Bnw-BUzrIZQ":{"text":"Absolutely amazing dining experience. Great service and the food was phenomenal. I ordered","useful":0,"cool":0},"d3WWoqP2s3wQOY0-Z8fs0A":{"text":"Second time to eat here. The service exceptional and food was outstanding. A little noisy ","useful":1,"cool":0},"j4q00baFelhOqNP4Xyldnw":{"text":"Second time at this place and it will definitely be the last. The wait staff was horrible!","useful":0,"cool":0},"oZZABhqaxuD_BDNONxzGTg":{"text":"Dickie Brennan's sure knows how to cook a good steak. This place is exactly what you expec","useful":0,"cool":0},"9i-R9M1yCqot-LytU_UQ_Q":{"text":"Overall the evening was wonderful.   The food exceeded our expectations. \n\nThe prices real","useful":1,"cool":1},"VjGzRDrAGBfq39RyyYz4lg":{"text":"Uggh! Where do I begin!!\n\nHubby had a great meal here ages ago so we decided to stop on fo","useful":1,"cool":0},"CIF5ux8KnrnxmP_BIEbZuQ":{"text":"Came back for yet another visit. We have never been disappointed, wether you are in the di","useful":0,"cool":0},"lBI-vcExvkK-9-HMLUPgXw":{"text":"Been there for two different bachelor parties.  The first time was great, both food and se","useful":1,"cool":0},"OUWoYwA-rH6pP0VX5iYNkw":{"text":"This was our first time to Dickey Brennan's and it was good, but not great.\n\nI had the Bar","useful":1,"cool":1},"8OvzScBGX9i_FnoJKpQRwg":{"text":"It has been a year since I visited this restaurant and I still can taste their Sweet Potat","useful":0,"cool":0},"Xim-nbaBQuLXFQr6W3VeLg":{"text":"I was here for a wedding rehearsal dinner so I am sure we had special attention but I will","useful":1,"cool":1},"OdzUZxmUP3uRRpZMx6Y1ng":{"text":"We are visiting from another state and my husband made us a reservation about a month ago ","useful":1,"cool":0},"xuOq7C5XQ7LBZ0PV8Y2WbQ":{"text":"One of the best ribeyes I've ever had from any steakhouse. Friendly staff, excellent servi","useful":0,"cool":0},"LMu05d_c18hbNvG4DvFEaQ":{"text":"Exquisite!\nI'm not much of a steak eater, but was looking forward to the grilled fish with","useful":1,"cool":0},"z4jqvZM_2EI623fIUDln6A":{"text":"Service and setting excellent vegetables ok steak nearly inedible. Had the dry aged bone i","useful":0,"cool":0},"rAiVRC_sQSKd0H-vmcnXhA":{"text":"The service here was top notch. Each table gets 3 waiters, and they are constantly checkin","useful":0,"cool":0},"5szIMZLzUhL9P3A1LimwoA":{"text":"So let me start with saying I would given no stars, but that was not a option. We have eat","useful":0,"cool":0},"bBFiLg0yVtADFBD0DYXknA":{"text":"We ate here last week with a large group party of 40 + and they did a great job with both ","useful":0,"cool":0},"9J8Bu_vZxu6GCxfQGGJ5PA":{"text":"Dickie Brennan Steakhouse is always good but this time the service was not up to par.","useful":1,"cool":1},"0YQoXeutE017AHQyrbYZCQ":{"text":"Great steaks. Had the in- bone ribeye and was prepared and seasoned perfectly. Fried oyste","useful":1,"cool":0},"Uk6DOIedGK3m6Z_TIzQRpA":{"text":"We had a lovely dinner. My brother loved the truffle mac and cheese. My husband had the se","useful":1,"cool":0},"mxOq73ymMhUbOGKL_VKipQ":{"text":"Dined this past weekend. Showed up an hour before our late night reservation and they seat","useful":0,"cool":0},"xOBHb8bewAUu8bkNL-lOCg":{"text":"Nice steakhouse atmosphere. Very courteous staff. Was seated promptly. Was also entertaine","useful":0,"cool":0},"oA-TkP-M_qp-0Apt8O0_4Q":{"text":"Last dinner of the trip we decided we've had enough cajun/creole food and want a nice carn","useful":0,"cool":0},"U3pPOoo-mMEC2_2NF8HpvQ":{"text":"Spotty service, and my steak was wallowing in grease over a bed of wilted, soggy, chewy sp","useful":0,"cool":0},"oLaelxfNWWrkFU0rKa0vMw":{"text":"This is one of the must visit places in Nola.  Food is really good but I wouldn't say grea","useful":0,"cool":0},"SbN6bDMHjLfqkf_-r-WrNg":{"text":"Meh.... well now I know what that word means LOL the service was very very good and that i","useful":0,"cool":0},"jJpEdu8A9AOaeNpfB2CiMw":{"text":"Food and servers were great.  Manager \"Anerstien\"  showed up and accusing group of inappro","useful":0,"cool":0},"1RuP1fyqabDQGxU-deCcWA":{"text":"I went here with my parents last week and my dad was so excited because he had such a grea","useful":2,"cool":0},"2BIBapiJw9gGT0AU2nrnwQ":{"text":"Bbq shrimp ribeye awesome- came as ordered at med-well, sauce gave it nice pop of flavor, ","useful":0,"cool":0},"hqgDCmVEVlvVGiZdjF5_wQ":{"text":"Been here a couple of times with my boys and have not been disappointed at all. Service is","useful":1,"cool":0},"mgTKO_xa1gEuzvrcisk5hw":{"text":"It was an excellent experience. My wife and I were walk ins and we got a table at the wind","useful":0,"cool":0},"vr_KdFMdjEEcz8m2U9xRLA":{"text":"Not at all worth the money.  Very disappointed...sides and salads just not good.  Steak qu","useful":0,"cool":0},"Dd5pateKygZTU76v0xXQAg":{"text":"Recently dined at Dickie Brennan's Steakhouse. The service, drinks and cuisine were all fa","useful":0,"cool":0},"DoSQXNub7zI8AUaCzMlYSA":{"text":"Fantastic place! Went for the New Years Eve and the service was amazing and the food was d","useful":0,"cool":0},"lN1pWY_gfcdomHn0ujYdAA":{"text":"Where do I start? The second you walk in from the loud crazy streets of New Orleans, you a","useful":0,"cool":0},"TE3lVr9mLIVWuhdSwYLRZQ":{"text":"It was well decorated, great staff, well taken care of.   Food was delicious, potato, stea","useful":0,"cool":0},"1hYa2RmyetNp5GLTrQfVRw":{"text":"Had a GREAT meal here.  Came with 7 of us.  Only reason it's not 5 stars is because we had","useful":2,"cool":0},"Rs3UoeCyoae9Kjy2DpaGog":{"text":"Had dinner here this evening and it was excellent. I had the ribeye and my girlfriend had ","useful":0,"cool":0},"GzpPX-Tz_ppXyjR2IOz2aQ":{"text":"Great steak place! I had the house filet rare and it was done perfectly. It came with tast","useful":0,"cool":0},"BPnzidIYkZjogP4swIyWBA":{"text":"The turtle soup was good.   Other than that, I was very disappointed with the food and win","useful":0,"cool":0},"srnh0zoEcRRlix-4IM10ww":{"text":"Chateaubriand for two awesome. Note our server Darren was attentive by soon forgot us and ","useful":0,"cool":0},"vc0Hg8UmRYqEqhLf3AKsbQ":{"text":"went here for my birthday, great food, great service, and great atmosphere! the tables are","useful":0,"cool":0},"BO6V4Q4ku-7yz53hQEDH7Q":{"text":"Good food, better service but horrible management makes for a very unpleasant dining exper","useful":2,"cool":0},"lInK967N_WtCOJKHHF7DSw":{"text":"Dined on the evening of Oct 18. We ate here by accident because 1.) we wanted to eat near ","useful":1,"cool":1},"nkCGvNdb4YwH1hCiEcfjjQ":{"text":"I don't normally write reviews but I feel like I had to share. Overall the service was goo","useful":1,"cool":0},"54tJmJcgP_nISTIyDh0ttQ":{"text":"Meh. Had dinner here with some business colleagues. We had early evening (late afternoon r","useful":0,"cool":0},"4yvnornZqxs7ZBULXZ84Vg":{"text":"Wow, we could not have been more disappointed in this steak. I have made a better filet at","useful":0,"cool":0},"_jCIRGmdD3kkI592xO8gDw":{"text":"I cannot say enough good things about this place. The food was delicious and the atmospher","useful":0,"cool":0},"_9GGg0uTA4eHy--IhLB9JA":{"text":"Pretty nice steakhouse right in the french quarter. We had the petite filets, which were a","useful":0,"cool":0},"yTY7QFaVozfuqPQnAmo28w":{"text":"Very disappointing service and attitude.  Food took 2 hours to get to the table, because t","useful":0,"cool":0},"aSPOjq95ri9bXv6KsD5K4A":{"text":"First class all around! \n\nDon't worry about their location in the French Quarter, this pla","useful":2,"cool":3},"Siwy-tg3pzuFZGfdVovFTA":{"text":"Great steak house in the FQ.  We had the private room in the back and the service was top ","useful":0,"cool":0},"DL1EVY7jfak_nxgOM7fJqA":{"text":"Excellent service and the restaurant looked amazing.  The food on the other wasn't as impr","useful":0,"cool":0},"WJWmzI2EYwofANDgGyVz_w":{"text":"We had so much having dinner at the bar.  The bartender was very helpful, informative, and","useful":1,"cool":0},"pB-W6JNq-lew5bORoQ-6Wg":{"text":"Chef Tommy created a special appetizer plate just for us. It was the most delicious food w","useful":1,"cool":0},"VQvOaIny7MUk4U8W-6i_WA":{"text":"Since Dickie's is billed as a steakhouse, I feel compelled to rate the place at 3 stars si","useful":1,"cool":0},"ns_Kcw7EOzWhFrEbEmXJ0w":{"text":"Of all the 4 star restaurants visited in NOLA this was by far the best food and service.  ","useful":0,"cool":0},"NVtTRyUADLbQ7RXFg88WCw":{"text":"Very pleased\nExcellent service\nExtremely clean\nMelt in your mouth steak\nJust so much atten","useful":1,"cool":1},"8-amfmKN3PtG-wYh32WufQ":{"text":"A very belated review from April 2010.\n\nDisappointed.  Had high hope for a really good ste","useful":2,"cool":1},"pbcgjX9Cuvi2ZT1LI2Ikfg":{"text":"Hub wanted steak for his birthday dinner and we chose this one. Service and appetizers wer","useful":2,"cool":3},"FemAUt6Wogje2bDU2U5j_A":{"text":"Went early but they let us go to the bar area have dinner there. They were the kindest , m","useful":0,"cool":0},"gCSSVnN9-70lc_TidIoryA":{"text":"We came as a party of over 40, so this review is for the restaurant as an event venue:\n\nTh","useful":1,"cool":1},"10hLZhinQ7axSNiGL1ILmw":{"text":"I would highly recommend this great place, not only was the food absolutely amazing but th","useful":1,"cool":0},"2QBehrZpQKYwz-ND_pqbWw":{"text":"We went here to celebrate  my birthday with our son and daughter in law. What a wonderful ","useful":0,"cool":0},"w_0ZKlQN3csi_69K_IYQnA":{"text":"I live in New Orleans but came here for a work dinner back in January 2018.  The food was ","useful":1,"cool":1},"YmSzzlspqSz1kdLzMppzkg":{"text":"Had a special occasion dinner here with my son whom I hadn't seen in some time.\n\nI don't s","useful":0,"cool":0},"FP8TnpZXDhjwTsG6C_Q4MQ":{"text":"Ran into one if the managers (Jorge) later in the night and explained my experience. Jorge","useful":1,"cool":0},"0McV6rPOmMTjZSfcFtTCBw":{"text":"So disappointed it took 35 years for me to try this place lol. We went for our anniversary","useful":1,"cool":1},"TVidiKdQx8FINfRwle4pUg":{"text":"Places like Dickie Brennan's are becoming more and more antiquated. A steakhouse with wood","useful":3,"cool":0},"ENo9MRLQzrg0ZfCL_sTLFw":{"text":"I'll just skip to dessert. Best pecan pie ever.  Creamed spinach ++, martini with Blue che","useful":2,"cool":1},"YdhNHGbN-SWh9Q9CgnNffg":{"text":"Came here one night for my birthday. Hands down best steak dinner ever and the mac and che","useful":0,"cool":0},"YN0b-vFDUtKRmzJ49v8tbQ":{"text":"If you feel like splurging on an amazing meal this is the place to go to . Everything from","useful":0,"cool":0},"u72Rxr4P9ERQu0DaNhMShw":{"text":"The steak was cooked to perfection and everything else was just as good. Definitely a plac","useful":0,"cool":0},"ho-OU4LFNDMT9rXI3Qs-xA":{"text":"Classic old school steakhouse.  Competent and courteous servers.  White linen tables.  Exc","useful":0,"cool":0},"hdlOvOMnTNBROLJnxpCJbA":{"text":"We went to Dickie Brennan's while visiting New Orleans for my husband's 40th birthday. To ","useful":0,"cool":0},"JzdJ1wPHvGjAJnpDg96HTw":{"text":"Impeccable service and superior food!!! Everyone should visit this restaurant while in New","useful":0,"cool":0},"vW9-pN7HyuYTxy9ZPvAFxw":{"text":"On a recent trip to New Orleans, I went to dinner at Dickie Brennan's Steakhouse.\n\nThis is","useful":3,"cool":1},"OExJKzap8S1Rk1ZmeyIrhw":{"text":"I don't think it's possible for you to have a bad meal here. The kitchen is consistently c","useful":0,"cool":0},"lfhtjQCnA_qZWeTG2BNWfA":{"text":"Came to Yelp to look for a steakhouse and found this one. Was hesitant because usually whe","useful":0,"cool":1},"E8U62FqMWgo3s9q4R5DfoA":{"text":"Wow. That sums up my experience. We started with various appetizers, including the escargo","useful":0,"cool":0},"2S0LTZcOvRc-KOYI8ofQgw":{"text":"Excellent.   Old school steakhouse.   Make a reservation.   You really get a lot of food f","useful":0,"cool":1},"pJVaIQKQcIdebBB4BYO8Bw":{"text":"Had an awesome experience regardless of the somewhat high price range on the food and drin","useful":0,"cool":0},"_EzQ5U31csKeMSPCse1nlw":{"text":"The only reason I went here was because it was raining and because it was close to my hote","useful":0,"cool":0},"Gyq9jZHhARVABZLcn70V_w":{"text":"I had a wonderful experience at \nBrennan's, located in New Orleans, Louisiana. Brennan's i","useful":0,"cool":0},"oFtVLkV9ODj3a2oJooGtzg":{"text":"This is one place I will be back to. The whole experience dining here was awesome and ever","useful":0,"cool":0},"dWIVB6Wb4CGXGFTfc2wFqg":{"text":"Very good service and good but \"meh\" steaks.  Nice steakhouse decor/atmosphere.  First tim","useful":0,"cool":0},"YO9uQKChk20tLCmLLgaiwA":{"text":"Very underwhelming experience. We had to add salt to everything. Pork belly was not seared","useful":1,"cool":0},"TNwQQuyMKZ2GAJNYnd7VYg":{"text":"Amazing food and spectacular service. Definitely recommend the seafood gumbo - the best I'","useful":0,"cool":0},"o6UOOIRnhgBeM3u4SaO7PQ":{"text":"We ordered the aged speciality steak not offered on the menu. Definitely a bust. I am a hu","useful":0,"cool":0},"1QpfKtLTHl78txBRUU2DEQ":{"text":"I love this place so much everyone was sweet and very nice but the food was a no I had thr","useful":0,"cool":0},"4w2VbIYV4yJDsiCMNtnYTg":{"text":"I can't give this Steakhouse 5 stars because Ive had so many great steaks in my travels bu","useful":1,"cool":1},"aJkjghRGevvejbf7zlig7A":{"text":"This was like walking into a time warp, felt like the old school mob guys would be around ","useful":0,"cool":0},"ag_EXYMH7Et5t9Aocyjh2w":{"text":"This steakhouse was amazing.  We celebrated a 60th birthday and they made it so special.  ","useful":0,"cool":0},"iP7m6kKPKQFZ7sWWw56C0Q":{"text":"Worst steakhouse experience I've ever had. They falsely advertise their Steakhouse Broul a","useful":0,"cool":0},"e6YXFjyt_WSu_s6NT4Va4w":{"text":"Not impressed! This place has a great ambiance about it, but I wasn't blown away by the fo","useful":0,"cool":0},"nEzbBOp5tMabXjcfUoJnLA":{"text":"I visited this place for my brother's Birthday. The food was excellent but the service was","useful":0,"cool":0},"Bb42npzV6EOFupX4NcQ96w":{"text":"Delish!! The husband enjoyed the cheesecake so much he went back 2 nights later and got on","useful":1,"cool":0},"AR_b6CKeMBuLg4SefK8h4w":{"text":"Fabulous!  Turtle soup was great and the house filet was superb!  Melted in your mouth.","useful":0,"cool":1},"EJIIVpPH20OXaNqnk0ixKA":{"text":"Usually I'd give Dickie Brennan's five stars. Last night was Dirty Linen Night and we stop","useful":0,"cool":0},"DHypZ8iZd6vOi86EwTbLtA":{"text":"I really enjoy this place every time the experience is great... I usually go here when vis","useful":1,"cool":0},"EIMuKy2nlcmpinPXKVSgeA":{"text":"It's a little confusing to me that DBS only has four stars on YELP, as it is a five star o","useful":0,"cool":0},"mK10eQoecx4KRVHY0sB-bg":{"text":"Moving my review down to a 1 Star. The manager advised that his manager would be contactin","useful":6,"cool":0},"uvWEBh2tbRR0Pe2xlqGyLw":{"text":"Best steakhouse ever.. I could talk all day about the food because it was just amazing in ","useful":0,"cool":1},"SqkspAI5IqgEbF5NZe3lBw":{"text":"We left somewhat underwhelmed.  We started with a wedge salad that was very very good.  Fo","useful":0,"cool":0},"733zMrkTDpWUO_c5Gax64w":{"text":"corey saunier and staff did an excellent job taking care of our needs \nFood is always exce","useful":0,"cool":0},"cceBfYw5-sxcAEs5dLP-Vg":{"text":"Just had dinner, party of 5 ordered 4 various steaks. The steaks were cold and incredibly ","useful":1,"cool":0},"aXgaRogTLS1qcOgIpzHzyw":{"text":"This is a must go-to while in New Orleans!\n- Friendly and professional staff\n- Great setti","useful":0,"cool":1},"a-ekanvczQxipgIo0wWAhA":{"text":"While visiting New Orleans during Essence Fest it's a must to indulge in the best food thi","useful":0,"cool":0},"dwh7cWua40-a-Yq_pKZg0g":{"text":"Dinner meeting with a client.  The wait staff did a good job unfortunately the food left a","useful":1,"cool":0},"TvOs1HM9rkArJvpIX1PZJw":{"text":"Not the best steak I've ever had but boy it was really good! I ordered the chateaubriand d","useful":3,"cool":2},"SnpGIROkXM67QXPZZ_WrmQ":{"text":"7/28/19\n\nTime to up the rating. I can honestly say I don't think we have been disappointed","useful":0,"cool":0},"DAI_A7oHc3dLN27S4w1Utg":{"text":"Really good steaks, very nice restaurant and decent prices considering the location. It wa","useful":0,"cool":0},"6qrOnXGTGebCsgjj_tnOSQ":{"text":"Omg! My new favorite sit down restaurant! Omg! The Chateaubriand was the PERFECT meal for ","useful":0,"cool":0},"4fh0QQ-WHOn5_4Bxt0n5Cw":{"text":"As a celebration of our 10 year Friennaversary my best friend and I decided to dine at Dic","useful":0,"cool":0},"IYyvGap5ZSXkxLqlGJuI3g":{"text":"Dickie Brennan's Steakhouse is a restaurant in the French Quarters.  As you enter this chi","useful":0,"cool":0},"MejJjspcuLwKZ54UcEA30w":{"text":"Wow, I was recommended this place by a colleague and it really lives up to the wonderful Y","useful":0,"cool":0},"qc1f4p_bcUFuLhIRO4xv1Q":{"text":"I have eaten here several times, and I love the look and feel of this great restaurant.  T","useful":0,"cool":0},"MxgHT2jQRc3QX2pPmvy6og":{"text":"Me and my wife wondered to Dickie's on 12/20/2019, just since we were in the neighborhood,","useful":0,"cool":0},"dLjoxESnjI0nrTTEPBa1nA":{"text":"Does Dickie Brennan own every restaurant in New Orleans? It sure seems like it - and thats","useful":2,"cool":1},"vZNEPTpVeJSAMdpi_YfcGg":{"text":"Incredible service. Ate here for restaurant week and got the special menu items. They were","useful":1,"cool":1},"AqX9k5LFbzCq2qP-UyehQA":{"text":"FANTASTIC!!!!! I love an old school simple steakhouse. We had a reservation and the table ","useful":0,"cool":0},"6YWgb8_ADzFJAQoClMWWTg":{"text":"WORST SERVICE I'VE HAD IN OVER 2 YEARS:\nI selected Dickie's to host a visiting restaurante","useful":12,"cool":2},"9Dced1gv5ssbQnuNR_fN1w":{"text":"Always perfect. It's the place you can always count on for great food, exceptional service","useful":0,"cool":0},"hmW6UKxxqtIwn2jtKJWTSQ":{"text":"Overdone with no true flavor: the food was fine, but not exceptional as nice of a place as","useful":0,"cool":0},"rN4Snmn-bsNTjzDQzFXwnw":{"text":"I appreciate a first class establishment that takes in the masses. With similar swanky and","useful":3,"cool":0},"vIU4-8az55prtuPRlLS9JQ":{"text":"My husband and I enjoyed this restaurant immensely. Our friends brought us here on our fir","useful":0,"cool":0},"0K70lP3r5uQBDvYjJDr6xA":{"text":"Had the most amazing experience here last night! The service and servers were wonderful an","useful":1,"cool":0},"jFHlxADv3lFjE82A5RyBTQ":{"text":"Really not impressed with this place. For the prices and the hype I would have expected mo","useful":9,"cool":5},"XsfHQxEq5ho5srRYJnSlfg":{"text":"Popped in here looking for bananas foster, they said go to Palace Cafe\n\n\nWe stayed and had","useful":0,"cool":0},"kn0381ts-kw1a_KYuS8wkQ":{"text":"The tar tar was tasteless and looked awful, the egg on top was essentially a hard boiled e","useful":0,"cool":2},"uTsCyR9_mNM5CvJDcpH7ZQ":{"text":"we look forward every time we are in NOLA to going there in the late afternoon.  Excellent","useful":0,"cool":0},"DKNOrKNsn-g5AAOjQVCGOg":{"text":"Seems like this is the Steakhouse to go to in NOLA. My first visit was pretty awesome! Wen","useful":5,"cool":12},"ovGjxuMFGgMd2PWxRqVYew":{"text":"When our college son wanted a big steak dinner, we didn't bother researching \"best steak h","useful":0,"cool":0},"YcAOcCXf4EHfbu3L-kaGUw":{"text":"Cocktails were great. BBQ Shrimp and Filet Mignon were the best I have ever tasted. King C","useful":0,"cool":0},"b9n3tyCgLj-UBYg5ysLOrw":{"text":"This was our first time in New Orleans- and we wanted a good steakhouse. Dickie Brennan's ","useful":0,"cool":0},"nN5csiSxRH4E6ABjhhfUZg":{"text":"Absolutely amazing food and service! Alfredo is an amazing server, I suggest asking to be ","useful":0,"cool":0},"DzThaBFqEkY4vo2t80tjww":{"text":"4.5 stars.  Really great place to grab a good steak.  Came here with a large group of frie","useful":0,"cool":0},"gMawQoZUTtdU6bCqYruw-A":{"text":"The food was more than decent but not the best I've ever had at a steak house. These two s","useful":0,"cool":0},"8q_abUevpEb253VxxL8yaQ":{"text":"Excellent excellent excellent... This is old school service and class that is getting hard","useful":0,"cool":0},"sq7pUMLyVQ6Fho344CBA0A":{"text":"Happy Heure is $5 after 5pm\n-two signature cocktails\n-five bar snacks, four with shrimp in","useful":0,"cool":3},"oL8RpX6IkxYrh6rsr0h4SA":{"text":"Nobody does Christmas Eve like Dickie Brennan! And I mean nobody, not even Santa and Mrs C","useful":0,"cool":0},"zMKSKTwirCdUTk48Gv8XGQ":{"text":"We loved this steakhouse.  Came in not so hungry and walked out stuffed.  There is sooo mu","useful":1,"cool":0},"DEDWIoPPCsGmV9QYNTyXLg":{"text":"Excellent all around. Service was exceptional and the staff does all the little things to ","useful":0,"cool":0},"NQsLDQgG9tfQtnbRL9LRlw":{"text":"Michael the captain and Liz from Boston amazing servers!! The food and ambiance to match!!","useful":0,"cool":0},"RBSypI0iHoUNnc97dWEIHw":{"text":"The steak is tender but has No flavor. The shrimp that came with the steak was horrible- t","useful":0,"cool":0},"IKP38M-xmqZb2rSST-3XXQ":{"text":"Very rude hostess. I was wearing a hat and she treated me like a hobo. You should kindly a","useful":0,"cool":0},"SkkEPcZYTqWkzDY9YY-o2g":{"text":"They just hit all the right notes. The food and the service are the best and make every ti","useful":1,"cool":1},"ZLviATS0sV_q7OoytyefwQ":{"text":"My husband and I have been to Dickie Brennan's multiple times and thoroughly enjoyed it.  ","useful":0,"cool":0},"h2rMuIt4X13Vwoh-A4CClw":{"text":"I ordered the house steak because I saw a picture of it on yelp. It did not disappoint- ev","useful":0,"cool":0},"-C5vUdFZTUV-b05l2Rkn2A":{"text":"Splurge, well worth the food. Traveling out of state, if I ever return this will be my fir","useful":0,"cool":0},"x1BctOnGZWQoo2PsiunPaA":{"text":"Food was ok but over the top on price. Service was horrible, it took two hours for two peo","useful":0,"cool":0},"W-JIka_CfAsf5f0oGJpSiw":{"text":"Absolutely lovely dining experience! The atmosphere is lovely, the service is friendly and","useful":0,"cool":0},"4iaXbB8NzX5SWek9Xwyx_Q":{"text":"Dickie Brennan's is what you'd expect when dining at an Old School Steakhouse. The ambianc","useful":0,"cool":0},"88B6Jcw1Ch3x7DMeR4rt5w":{"text":"We were in town for the night and wanted a place to go on a romantic date. We decided on t","useful":0,"cool":0},"Le1UhwgEvJtxySacDsRK4A":{"text":"Let me start the review by saying my first experience there was for a Christmas party of 3","useful":0,"cool":0},"FejWqfc0m-q8ueR5SUmwQg":{"text":"Simply amazing. Melt in your mouth steak. Bananas Foster Bread Pudding. Need I say more?","useful":0,"cool":0},"-yksrFyi-ui71_GgBgjiqw":{"text":"There is only one word to describe our experience at Dickie Brennan's - Awesome!\n\nFrom the","useful":1,"cool":2},"EwGcXA7ahkj8TCaNmnwNpA":{"text":"I have been in New Orleans for about 3 years and went to Dickie Brennan's with some friend","useful":0,"cool":0},"TEp4HC1JoCgKRhaR6SKWmA":{"text":"It pains me to write this. Dickie Brennan's has been a family favorite for years. The serv","useful":0,"cool":0},"CqDeomGnY0e3XEfv5fl83w":{"text":"We arrived at 7:20 for a 7:30 reservation.  Food served about 8:45.  We were getting restl","useful":0,"cool":0},"y148iaa36UlRwyOc1-ZasA":{"text":"Better than good. This place is awesome, including the staff. The only thing that is horri","useful":2,"cool":1},"ln095xQwWBp2wcIXGNcTAQ":{"text":"Wasn't anything to rave about and very pretty expensive for the lack of flavor in food - w","useful":0,"cool":0},"zOmYvTk4rHFtUQKCSoNkUA":{"text":"We went there for a special event and while the service was outstanding. Especially Jerrel","useful":2,"cool":0},"fY80DIQvbCZiwvKkBGSnxw":{"text":"My wife and I have come here since the day they opened many years ago.  We just had two di","useful":0,"cool":0},"VTHaCX0VL6OWrLbIWm3nQA":{"text":"Here visiting from out of town and the food was Amazing. The price point was perfect for t","useful":0,"cool":0},"hGW1KzyeNtw7p6iK5AUF2g":{"text":"Would have loved to give this place higher marks; but can't get past our repeatedly poorly","useful":0,"cool":0},"YXnRB7WNSV9n8uAtJCuh8Q":{"text":"We made reservations two weeks ago for Thanksgiving weekend (a month in advance).  My elde","useful":0,"cool":0},"80Qi2pfc35oaRtWioZOJZA":{"text":"This had to be the LONGEST dinner I've been at, but I've had many firsts at this restauran","useful":0,"cool":0},"wOkJUDaPgb6QDVD7UAZs_Q":{"text":"We came here tonight as a group of 9, and had a wonderful meal. We had a private room, and","useful":6,"cool":5},"AiY-vXvIvJuFgn91OUI_Kg":{"text":"They say it's one  of the best steak houses in town or the US. They may be right. After be","useful":2,"cool":1},"7OPDG2EJf1PjCBocNh4rpA":{"text":"We stopped in for there happy hour and work so impressed with everything: the drinks were ","useful":1,"cool":0},"fW_pdOeWd9q3yB7CLHGdQA":{"text":"Dickie Brennan's Steakhouse is a classy establishment. As a vegan, I really enjoyed my mea","useful":2,"cool":1},"ZVuHhBlf6z2RpCaAWb-_ng":{"text":"Decent food but they pulled one over on a large group of us in town for a bachelor party. ","useful":0,"cool":0},"pJjlKPnvG1peCCj2uPFKEw":{"text":"On our last night in Nola we decided to return, after 5 years, to Brennan's for dinner. Th","useful":3,"cool":2},"by_WPh2C055HkwRyczlpTA":{"text":"Amazing. Food is delicious. We really loved all the food. Service is great. Clean place an","useful":1,"cool":1},"fTn373lgK65oqivL6oVulA":{"text":"I asked for a vegan plate, and got some of the best vegan food I've ever had. Yes. Vegan F","useful":0,"cool":0},"cGHTM-4RGDtTDm9RGB4wlQ":{"text":"This place is just ok, it's touristy. I usually don't do the touristy restaurants bc I par","useful":10,"cool":9},"S4HB3JyQ4yo43Wrsm7ePEA":{"text":"Great and friendly service! We were seated right away with no reservations. Our waiter was","useful":0,"cool":0},"QgQQQTDwiS9M2arDNIyv8A":{"text":"If you're in search of a top notch New Orleans steakhouse, look no further than a block de","useful":0,"cool":0},"oesKXvgtVShvVPkyBeak1A":{"text":"INSULT TO INJURY: A $25-EACH GIFT CARD???\n\nUh, you can't buy a steak at most reputable ste","useful":6,"cool":1},"mP03gxOea4fjZZtPcEwu7g":{"text":"I know everyone says this, but I've literally never had a better steak. The butter they me","useful":0,"cool":0},"YiCKvcfAvDUqqZiL6iID7Q":{"text":"I don't eat steak all the time but this time I wanted it.  This place had a decent rating ","useful":0,"cool":0},"EuKyzTpJZbq8gf0vuOW_Zg":{"text":"GREAT service! We were late for our reservation due to nye traffic and the host was very u","useful":0,"cool":0},"oAVWgdm3xWZ26Bl835ma-A":{"text":"Amazing steaks, service, and friendly staff! I recommend for any occasion. Looking forward","useful":0,"cool":0},"pnYlA_wbOfSzhFJ75a8EBA":{"text":"Our experience at Dickie Brennan's was outstanding, our server Faith was extremely helpful","useful":2,"cool":1},"1HjqjoDwMcpBXEDf4nhkew":{"text":"We ate here 12/15/2010.  It started off badly when we arrived early and went to the bar fo","useful":0,"cool":0},"aPKiuWXwIASu8mneXrCJeQ":{"text":"In from Alaska and wanted a good meal on our last night. Called at 5:15 to see if we could","useful":2,"cool":0},"5IFYS5LKI13KKN7XFxKjHA":{"text":"Hard to add much to the existing 342 reviews.\n\nParty of 6, first seating, Sunday evening. ","useful":0,"cool":0},"fk6883b8G7Sd-qaviW4kBw":{"text":"Really nice break away from seafood. One of the best steaks I've had in a while, great cut","useful":0,"cool":0},"lV_4FJ7O2psvITM3n3yFUw":{"text":"March 2021 - Covid rules strictly followed! Excellent staff, excellent food. High-in and p","useful":0,"cool":0},"vxVxhPpzFMkDlxaLuNmGKg":{"text":"It's over priced. Service is good, not great, food is good not great, ambience is just ok,","useful":0,"cool":0},"i0eB6Vca95AKLbbNkuBFuQ":{"text":"Great dining room open and welcoming.  There for a business dinner with 3 others and have ","useful":0,"cool":0},"FucsF32BdoY-WYifOq0MjA":{"text":"Best meal I had in NOLA. I had the gulf fish, which was a tuna. Absolutely mind blowing. \n","useful":0,"cool":0},"4mE87yBS0p5TasFp4OmwZw":{"text":"$5 after 5pm small plates initially made me choose Brennan's bar for Happy Hour. However, ","useful":0,"cool":0},"OBgJgMXqzJ1L8pH6ue6dsw":{"text":"Just sent a couple to celebrate their anniversary tonite. HUGE disappointment!! Steak were","useful":0,"cool":0},"Ob3W4DVl0t0Q1HYQputnPg":{"text":"In a confirmation that you really can't go back, we had eaten at DB many years ago and fou","useful":0,"cool":0},"kYYYWQprnoTGPYamvKm0CA":{"text":"Hello,\n\nMy name is Star and the week of January 10th till the 14th My husband Nick an I vi","useful":0,"cool":0},"twpK_y-_LUymiKZmzV8N7Q":{"text":"I went here for a rehearsal dinner, and started off with a sazerac. They made a pretty dam","useful":1,"cool":0},"h52mGs94poqlmzLyoZjYFg":{"text":"Soooo disappointed.  After not going out to eat for a year was finally able to start eatin","useful":1,"cool":0},"CSc-6zckbcEq5XGL8Yr9cw":{"text":"You can't go wrong at any of the Brennan's restaurants. One of the best steaks I've had al","useful":0,"cool":0},"sN1D4uB2LTpFKzHlnypciw":{"text":"Been to this restaurant a couple of times.  I live in the CBD. So it is just a short walk ","useful":0,"cool":1},"4NlZpBp4O5QyZJh4vEKB1w":{"text":"We visited the restaurant for a birthday celebration while on vacation in New Orleans. We ","useful":1,"cool":0},"tmnb6iCRz1jOXSylNevAJA":{"text":"My wife and I have come here since the day they opened many years ago. We just had two din","useful":1,"cool":1},"Q09RvVl60sa3Ln8JylpbgQ":{"text":"Came here while on vacation with the wife hoping to have a nice meal. We made our reservat","useful":2,"cool":0},"H1dgabdqB0MeoaqTMyiYHw":{"text":"Great food and atmosphere! My wife and both have the filet and it was first rate!  Don't m","useful":0,"cool":0},"9QCTisbsG9po3o_Qnq0vuQ":{"text":"This place is absolutely disgusting! I organized a birthday dinner for 15 of my closest fr","useful":0,"cool":0},"Y50TV0PaMmIja0FyQUVp8Q":{"text":"Our server Raphael was great! He was funny, attentive. He had awesome suggestions and went","useful":0,"cool":0},"nG3dKRx4QzvLzxNCw_9CJw":{"text":"We were greeted at the door.   We had reservations and we were seated right away.  Our ser","useful":0,"cool":0},"kdJyi5Ii2gvxfJms9-BM2w":{"text":"We were fairly excited to try Dickie Brennan's Steakhouse given the name and location. \n\nI","useful":0,"cool":0},"DPMqqtFsZWM3EHJF4olEeg":{"text":"Disappointing. Got an almost raw steak when I ordered medium rare, and was at a business d","useful":3,"cool":0},"HZG9XpF4GlccmqBhygeXNQ":{"text":"FANTASTIC!!!!! I love an old school simple steakhouse. We had a reservation and the table ","useful":0,"cool":0},"fzlc-IzBnsnbyOtavpdZpw":{"text":"This is one of my go to stops when I'm in town. The service is impeccable. My mom and I sp","useful":0,"cool":0},"dZFNT9gxRyOB4hmKHsOq0Q":{"text":"Tired of all of the meh food choices we opted for a bar seat here and we were not let down","useful":0,"cool":0},"qDqfyWIeanELEaKKzzBzqA":{"text":"I wasn't sure if they would be open for Friday lunch since they have limited their hours d","useful":9,"cool":9},"mmEEdRszjGrAX9sNN18y3w":{"text":"This is an amazingly good restaurant. We shared the 24 oz porterhouse, turtle soup, veggie","useful":1,"cool":1},"-eYW7SvvLVhYbQ7TR7QxrA":{"text":"Just a great place to eat.. my food was off the charts.. staff on point.. what more do you","useful":0,"cool":0},"NgRkHGze10wiDf7bO_uRww":{"text":"After our visit for my husbands birthday, I have to say that Dickie Brennan's is the absol","useful":6,"cool":5},"Ewink-dP4HkTLvqFs5MF5A":{"text":"Atomosphere and waiter service were good. The food was subpar for such a nice restuarant. ","useful":2,"cool":0},"2GyCZBUfNB83INGRhSYJBA":{"text":"My brother loves steak so my family decided to try out Dickie Brennan's steakhouse in the ","useful":0,"cool":0},"HbE_3ONPNlx51hUBHoSF6A":{"text":"This place should be Embarrassed !!\nMy wife and I eat at fine  dining places three days a ","useful":7,"cool":1},"XyQAU4Y8dv5Ya6Tf4dDK9Q":{"text":"This place came highly recommended from a friend, and I knew my wife has been dying to try","useful":1,"cool":0},"2ymlaVnbfDvrcg6fbpOz_A":{"text":"Multiple steaks cooked incorrectly, no manager came over to deliver or even check on the t","useful":2,"cool":0},"NAP5jWg_Veg9dBvyH_SPZQ":{"text":"RICH MAHOGANY woods, candlelit dark leather seating, the aroma of grilled steak...\nFLEXIBL","useful":9,"cool":6},"zNTxUtSOmv2ucWOJXkWU7w":{"text":"Great service and good food . Had the USDA strip and it was on point . NOLA is a great spo","useful":0,"cool":0},"IgIw2B-t5SMYKBmrsk1z2Q":{"text":"Kinda snooty when we went in. They asked if we had reservations, which we did not. The res","useful":1,"cool":0},"ic0vD1CTtQAvk9O-toCUOw":{"text":"These guys are definitely phoning it in at this point.  Carelessly cooked food with medioc","useful":0,"cool":0},"daYk6DCC0YzYgt7IbsCDiA":{"text":"Once we sat down we were served water and tea and we were told that our waiter would be wi","useful":4,"cool":0},"tflKMWmQX5d5oF8ln3PQ6Q":{"text":"Our last night in New Orleans & my husband picked this place! So glad he did!! His prime r","useful":0,"cool":0},"vO5FlmYpdnmIFazk0RoMKA":{"text":"This is one of my favorite steak houses that I've ever been to. The steaks were cooked to ","useful":1,"cool":0},"ZgSqa8AYqKHV8l9aScBBcg":{"text":"Horrendous! Do not eat here! More than 90 minutes to get food after arriving. Insane! Poor","useful":2,"cool":0},"DYeHdMxk4VdF4CCy0BjTAA":{"text":"Wow......  The service and food were just awesome.  \n\nWe had a small group of 9.  We were ","useful":1,"cool":1},"xzeHm6Zja7xBkqays8LAaw":{"text":"I had the Shrimp & Grits, it was good but not great. The grits seemed to runny and the shr","useful":1,"cool":1},"llhHK4aWEKOUr9LozX_nPg":{"text":"I had done research and saw awesome things about their steaks, so I grabbed my vegetarian ","useful":3,"cool":0},"lSLThkhgZh4dQ_t9KClRAA":{"text":"I've been begging to come here for years and WOW was it worth the wait. Absolute heaven. I","useful":0,"cool":0},"eKMZsAFldnEtcL8ydAHVYA":{"text":"‍What better way to catch up with your girls, than with good food and great drinks? \n\n Wel","useful":2,"cool":3},"DqOzGWmLf7vl7AMimODygw":{"text":"I love Dickie Brennans for the experience, the food and sharing it this time with my wife ","useful":0,"cool":0},"rwfJjgzTQP4MYwsoViNVsw":{"text":"Great place for a nice steak dinner.\n\nI ordered the Bar Rib Eye, 12oz bone in rib eye stea","useful":1,"cool":0},"1Y8cQ8WmEWWLTh1nBCKfRQ":{"text":"Traditional steakhouse.\nHubby and I shared a caesar salad the 24 oz cowboy ribeye, onion r","useful":1,"cool":0},"SFIIo9TCXn1kD1vXu5bmFQ":{"text":"Let me start out by saying I've heard great things about this restaurant and I was very ex","useful":0,"cool":0},"IcwU7Sx0uAjL4yNyE0unhA":{"text":"The people working in this restaurant are extremely nice. You definitely get the whole sou","useful":1,"cool":1},"wo_R9TIAaAd1xR6rIbyqNg":{"text":"What's not to love here?  Dickie's has a fixed spot on our NOLA itinerary. We traditionall","useful":1,"cool":1},"hEA-c7-eiYL3QPy88zUzpA":{"text":"Very disappointing. Wish I had read reviews before we went. Nice atmosphere and service wa","useful":0,"cool":0},"jmOAct2bUYKrRwB9Hn7k6A":{"text":"I always make a point to come here when I'm in New Orleans. The service is spectacular, th","useful":0,"cool":0},"-TczcuyyEGFGCuVK5qbhQg":{"text":"There were 4 of us dining in our party. Our waiter was slow for service, he forgot to brin","useful":1,"cool":0},"nR3fvivG7LT1E2sf_lS2Hw":{"text":"Well pretty disappointed in dinner tonight . First of all it took over and hour to get our","useful":0,"cool":0},"F_LECHR6nfCoC7gCqUIvOQ":{"text":"I can't place a lower rating on this restaurant because I think it would be unfair conside","useful":12,"cool":11},"gKK3bu5695IiCkmG9hik2g":{"text":"Beautiful ambiance, great food and great service. Our server Chris made us feel welcomed a","useful":0,"cool":0},"U9c6dAFvFwetUOl3V_EV7w":{"text":"Have heard such amazing things and was so glad to finally try it. Steak was amazing and ge","useful":0,"cool":0},"QawjBw8HFiHhh0nk1OA_Yg":{"text":"Fantastic meal. Enjoyed the fried oysters, filet, strip, among others. Highlight of the me","useful":0,"cool":0},"NeCMjB-tvPDK98qpOwB9aA":{"text":"Atmosphere? Perfect.  Service? Kathleen was AMAZING.  The food? I can't even begin to desc","useful":0,"cool":0},"wIsUyK3AI_smldkceUGUOQ":{"text":"Did the Valentines dinner here and had a very good night with my Valentine. DB offered a c","useful":4,"cool":1},"4hdLm8Mk_wmHV7NCQ6vfQA":{"text":"Boyfriend and I tend to come here for any special event (birthday/anniversary). Bit pricey","useful":3,"cool":1},"JcoqEm4U4azwuWWe33kPXA":{"text":"4/5 surprising bargains!\n\nwe came for thanksgiving dinner as my family had flown in that d","useful":5,"cool":2},"BvGwXO60B29YOuvmBdRe2g":{"text":"I was looking for a tasty steak along with a great atmosphere, and I got both here.  I did","useful":1,"cool":1},"0WcoyuU2Zuocq0tiYBLMIw":{"text":"Service was off the charts great!  Ate there the Friday night that everything was open now","useful":0,"cool":0},"Eb3XiKkDlwzltlcuSAuppg":{"text":"I can't believe in all the years and all the steaks I've had in  New Orleans, I've never b","useful":2,"cool":1},"TykHK0u5Lo1y7L0RadSwrQ":{"text":"I Just left Dickie Brennan's .   I have been here the last 4 Christmas vacations, this was","useful":2,"cool":0},"yVuCPbzQre3Jt5FNW6Q0Lw":{"text":"Me and two buddies ate here for a holiday lunch. All three of us had solid meals. Here's t","useful":3,"cool":1},"kzmflUEIlMKhm43-hhkQ0g":{"text":"I've been to Dickie Brennan's Steak House nearly a dozen times over the past ten years, an","useful":2,"cool":1},"gTnUyb4CqwCB2j46atgQcg":{"text":"We had my wife's birthday dinner here and it was outstanding! The service by Darnell was g","useful":0,"cool":0},"9tTv0-qrpUBcg4SFYKGiFw":{"text":"The chateaubriand for two is absolute perfection! We had a private room for a dinner party","useful":1,"cool":1},"pSe6bQd9HV3jX01MdaZa-Q":{"text":"My first trip to New Orleans along with my family to sample the culture and the food. I ha","useful":4,"cool":0},"L8A4pJWdVP0xFhxPC8q2XA":{"text":"In my struggle trying to wean myself off of my red meat addiction and become more of a chi","useful":4,"cool":4},"fKUWi_C2zOD3zyOrmet3mw":{"text":"I came here on a Sunday night for dinner. Observing the age groups dining, my date and I w","useful":0,"cool":0},"LgQPW1b0-6LZN2_vdGzPaw":{"text":"We were just recently in there a few days ago while on vacation in New Orleans to celebrat","useful":0,"cool":0},"b_3mGYxSpK2JkZv_BgR-2g":{"text":"Exceptional service and food at reasonable prices for this type of restaurant.\nMy wife and","useful":1,"cool":2},"p7Ig2Oz6lBpZecB8x9XabA":{"text":"This should be ZERO for the level of customer service they provided. I'm staying at Harrah","useful":1,"cool":0},"s6xNg4au93qkPwZZASOIKg":{"text":"New Orleans could sure learn a thing of two about steakhouse management from the professio","useful":1,"cool":1},"fQMnB6SYrjfBHdlwcTa98Q":{"text":"Here we go! My husband decided to surprise me for my birthday by taking me to Brennan's St","useful":2,"cool":0},"-hs90trkmCbJT1TYjMQcwQ":{"text":"We had a great time. We were able to get a table in the bar area when we didn't have reser","useful":0,"cool":0},"hbg-TBVZ7tJuxwjqvp8uOQ":{"text":"This is the absolute best upscale prime steakhouse in New Orleans. The filet literally giv","useful":4,"cool":3},"7Ljmhz6XypQw725u6vZuBw":{"text":"Good food and good service.  Our wait staff did bring me the wrong entree, but quickly fix","useful":1,"cool":0},"_03MQA8RmJh7ptqGf6G3mQ":{"text":"Mediocre food. Awful service. After reading the reviews on this (and other) sites, I was h","useful":0,"cool":0},"3o6P7DnI4T7J9qwqgDLpbg":{"text":"Last nite I met a friend @ Dickie Brennan 's Steakhouse.  First time there since COVID.   ","useful":1,"cool":1},"5m1v3k5WwGl9i9FDSihSXA":{"text":"Why the hell isn't this place noted as the best damn bread pudding?!?! I'm going to form a","useful":1,"cool":1},"QQJZdogGoc3vBeQNXF7AqQ":{"text":"Amazing large filet with potatoes ! Bar great. Big fan of this place. As far as steaks go ","useful":0,"cool":0},"QbgoBS5bfWK5Ljrak2m3YA":{"text":"Amazing steakhouse with a perfect clubby atmosphere and well-trained waitstaff. I started ","useful":0,"cool":0},"iiA3bA8gJx9XUc1Dtg6EQg":{"text":"The worst steakhouse experience I've ever had. Waited forever to order and then forever so","useful":0,"cool":0},"ASLnyDi0_QlAoad4EsPuIg":{"text":"I've eaten here many times on my own and with many different groups.  The quality and pric","useful":4,"cool":1},"PvBViy35s7ttl1ewsmncEA":{"text":"The room and the food were terrific. But... a waiter marred the experience by making a dem","useful":0,"cool":1},"ca_-e-ERsoFuzrvktBPwsg":{"text":"The people working in this restaurant are extremely nice. You definitely get the whole sou","useful":3,"cool":2},"O12haS2u5WR1bhkW7pNfKw":{"text":"GREAT GREAT GREAT steakhouse.\n\nThis has got to be one of the top steakhouses in the county","useful":2,"cool":1},"DqBT6e0S-5y92cQdRh55IA":{"text":"Dinner here on Monday night of this week with three business associates, while in town for","useful":0,"cool":0},"9jvqehv5OA7AYWXrnNyahQ":{"text":"Old school NOLA 5-star dining at its finest.  By \"old school\" I don't mean outdated or pas","useful":17,"cool":18},"StazX4exeKpfuKJs-J3DHA":{"text":"Came here to celebrate our daughter's 10th birthday and notated this in our reservation. N","useful":0,"cool":0},"pfrGgSTuq_S5Ak_42XSAFg":{"text":"Service was good.  Drinks good.  Food was just \"OK\".  The crab cake appetizer was very goo","useful":0,"cool":0},"5DiyzYhMGjQ8Jp5l7Dopuw":{"text":"It's been a bit of a challenge to find upscale restaurants that have options for a picky c","useful":0,"cool":0},"FnDEY2RjhOsDfkqwUoqNzA":{"text":"Favorite dinner on my trip to New Orleans because of the steak and service. Waiter Jarrod ","useful":0,"cool":0},"RX2t2zUBP5-eFE4oqjtXqg":{"text":"The chateaubriand is the best! The wedge salad was very crisp and welcoming. The turtle so","useful":0,"cool":0},"zNv_HTofaKARQeYMG_mtKA":{"text":"I never usually complain about restaurants, but this was not a good experience at all. Wan","useful":0,"cool":0},"RaK518_o0i5_XLLb-JYwjw":{"text":"The ambiance was great--it's dark, rich woods and low light light a speak-easy or old fash","useful":0,"cool":0},"1o5LEkTYzd1pjdkAVmijEQ":{"text":"Came in for the coolinary menu and did not have a good dining experience at all. To begin ","useful":1,"cool":0},"iPyCMmNrwzVvjVTYie9uRQ":{"text":"Every time I've gone there, We've had an incredible time. My favorite place to eat in the ","useful":1,"cool":1},"_u4uuGnP2nfvGvvs_ORD8A":{"text":"I had the 12oz BBQ Prime Ribeye and it was AMAZING!!  The service was spectacular and a sp","useful":0,"cool":0},"MPUD-2gfjDp4aCRrGl4uPg":{"text":"Very nice experience. The food was absolutely delicious. My steak was cooked perfectly. Th","useful":1,"cool":1},"PIzSmZ7bHJO4gpno6eCJFA":{"text":"A group of 4 of us tried Dickie Brennan's while we were in Nola for Memorial Day. We had s","useful":3,"cool":0},"CqOI_AV5d6BZVKWQIRDsIQ":{"text":"Don't waste your money... go to Ruth Chris... the food at Dickie Brennan's is mediocre. I ","useful":0,"cool":0},"uk3OGW8DymbzRLSVvyJGmA":{"text":"Made reservations at 5:30 and we walked in on time. The hostess told us wait until their s","useful":2,"cool":0},"t0MzXgClXBVNxJG62Dc75A":{"text":"We went for a group dinner. There were 10 in our group. The wait staff was very nice, help","useful":3,"cool":0},"n4ebZigvF549OiQb4MM9TQ":{"text":"To not have a reservation on a Saturday night in New Orleans usually means standing in lin","useful":2,"cool":0},"vHYKROrN-xuhTullBhNphA":{"text":"I was looking for a place to eat with my dad when he was in town and I gotta say, Charles ","useful":8,"cool":6},"DxxrLAHGO5J-gFt887CH_Q":{"text":"The stars are for the seafood au gratin.  The stars are NOT for the steak or service. \n\nI ","useful":3,"cool":0},"-ue9AEgz89R1TLZskVVePw":{"text":"I hate to do this this but I am not sure what happened this evening. First time I have bee","useful":1,"cool":1},"EAdmHYwa6rmBTwr_IC-0ZA":{"text":"Our group made a reservation here to have dinner. It was made the same day and they were a","useful":2,"cool":1},"hqe6bDeCr6r63SL1-XpdxQ":{"text":"Not a food review since we decided \"against\" eating there after taking a look at the place","useful":0,"cool":0},"HDhuRT6NdNnDVxfx5Nt9qg":{"text":"First off parking is next door which was the best! Do you know how hard it is to park in t","useful":0,"cool":1},"QOPcusX0tyuo1minbBrh2w":{"text":"I traveled a lot I mean a lot for work , and some towns you look forward to and some well ","useful":2,"cool":0},"6CX7DKGryOsCmsye9YsGoA":{"text":"Sometimes or maybe more often than not, once you have noticed, too much of a good thing do","useful":2,"cool":1},"x2sGh6YVsI0iXYergmNCow":{"text":"Stopped in for dinner with a group on a Friday. The restaurant is gorgeous, harkening back","useful":1,"cool":0},"GpmQWO6dkpYfOkLY9Ej0kw":{"text":"My petit filet, au gratin potatoes, asparagus and carafe of red wine was perfection for ou","useful":2,"cool":1},"cRa6A_lphnfXw1dgOMrMbQ":{"text":"Everything was perfect from the drinks to the desserts. Every entree had their own unique,","useful":0,"cool":1},"EOdhVKjgLMeH2ihwMkB9kw":{"text":"I am sure we caught them on a bad night. I am hoping that we caught them on a bad night.\n\n","useful":0,"cool":0}}