{"ZFlz3l8uAHbvNm1I1rDVGQ":{"text":"Terrible does not even begin to sum my experience with the 901 Convention Center Hertz loc","useful":4,"cool":0},"pz2Qd6P9QVrf6MnIuj4WbQ":{"text":"SCAMMER/LIAR Run for this company! We bought a rentcar on Priceline for 200$ and when you ","useful":0,"cool":0},"xdEKmgMY_ppcalGNmEPehw":{"text":"When you rent a car from Hertz you have high expectations being that they are considered o","useful":0,"cool":0},"-C1Mv11TF5RxN_xOli_QgA":{"text":"On a recent trip to the Gulf Coast we were planning to do quite a bit of driving, so I ren","useful":3,"cool":2},"RVPYjzCgQmsSogj9etX0oA":{"text":"Upon arrival there was no one working at the front desk- not a single person, after waitin","useful":1,"cool":0},"i306I10D9PZ1xp0QCIBxNA":{"text":"I believe my experience here was average except for a few things.  Customer Service is ade","useful":0,"cool":0},"pUSebtwjT4_pIBIFKRXbug":{"text":"It has been 7 days since this happened and I am still pissed.  It took 2 hours for them to","useful":0,"cool":0},"4QrSsggXF3MLTEjVuHwnpw":{"text":"I HATE THE SET UP AT THIS AIRPORT FOR CAR RENTALS..IF YOU  ARE HANDICAPPED IN ANYWAY YOU'R","useful":0,"cool":0},"vJo9uylt7iX5PGaKSRrGBQ":{"text":"The rental car location is separate from airport (this applies to all rental cars)","useful":0,"cool":0},"MkfSe-EPm8NEAGaeb6xjig":{"text":"Hertz add insurance without my knowledge, would not give refund. I feel scammed. Basically","useful":0,"cool":0},"LZnuY6_SvxyXwDbLlmrrKg":{"text":"I hate the hard sell and even worse the scam sell. Had a Reservation for a compact car thr","useful":2,"cool":0},"ktCXMgGyQcAgEQ0p2Fuk3Q":{"text":"Emmalee provided excellent, friendly service!  She explained everything thoroughly and  we","useful":0,"cool":0},"v9_5gVB6_XQYzWjXWRLgiA":{"text":"Worst car rental experience I've ever had, and I have done my share of renting vehicles.  ","useful":4,"cool":0},"BnH1ycYLgLpev04qj7txiQ":{"text":"The best part of this place was the jazz-singing shuttle driver with his velvet voice and ","useful":0,"cool":1},"a9CnhkjezuNYnuGAgh82dg":{"text":"Hertz is a complete rip off 9.99/gal for gas is ridiculous, make sure you fill up immediat","useful":2,"cool":0},"xwU10U3hiHmcSnLdti8Dpg":{"text":"Although i booked an economy car from Hertz over the phone in August, for my trip at the e","useful":0,"cool":0},"2QEaxNEGyTIUfBKR3QvLYA":{"text":"Great experience at this beautiful new location. Friendly staff, smooth easy pick up and r","useful":0,"cool":0},"ZMwa1uYy1fXRDgeKMzamaQ":{"text":"I had booked my reservation on-line and had been confirmed to pickup my vehicle at 11:30am","useful":2,"cool":0},"-zk0ukWxB2E-hnJqhxmeow":{"text":"Everyone was very friendly, but the person that made our experience awesome was Lucius. We","useful":0,"cool":0},"VrcTb6kjIp80RpdMw2xXFg":{"text":"Pros:  loved our car.  It was new, great gas mileage, clean, drove smoothly.  Returning th","useful":0,"cool":0},"tvkciBNfs4nboaL4Sa_QLA":{"text":"FYI, if you fly into MSY airport and are picking up a rental car, be prepared to walk a go","useful":1,"cool":0},"NDhxjd4qDb-qFRiGhDXU-w":{"text":"I got in late due to a missed flight so after dragging my bags up 3 floors, I found that I","useful":0,"cool":0},"u2995r_8fXn8lwRC3q7hYw":{"text":"Long wait for a car. First time ever that I have had to wait 30+ minutes for a vehicle. Po","useful":0,"cool":0},"uMaMVa98CVcm_qE7WyyElA":{"text":"I just arrived from BWI on business trip to New Orleans . I can not believe that I have to","useful":0,"cool":0},"UgMNg2x9Gd2m15IRWpAusg":{"text":"We needed a car while visiting for Mardi Gras, so we thought this place would be a good id","useful":2,"cool":2},"GSe7M1JjIRuFYzHiVQIevQ":{"text":"This Hertz location's customer service has been nothing but great throughout the many time","useful":3,"cool":2},"kDJMhGv83gqdTC5sGMvjkA":{"text":"We rec'd great service except she upgraded our vehicle and said it would only by $50 for t","useful":2,"cool":0},"QAgsKasyH_QXz_bRMV-G3Q":{"text":"My rental was in Covington 2 weeks ago. Had car trouble. Dealership paid for rental. I sti","useful":2,"cool":0},"LP3EYI_B2XAA2pH-E-grVw":{"text":"Seriously!?? I have a 4:00 reservation to pick up my car. I'm on time and I learn there is","useful":0,"cool":0},"hEqiUa1rcG6NWV_omY0erQ":{"text":"Definitely not one of Hertz's flagship locations. Unless you really need a car in NOLA, I ","useful":0,"cool":0},"eZ_K7fS7L7tpa33fWWXpUw":{"text":"Great service. Great about swapping vehicles. I had a long drive and they have me a vehicl","useful":0,"cool":0},"UEsERpPeQIORjXwnDqiWmA":{"text":"Hertz Rent A Car, located at MSY airport. To get to this rental car company, you just need","useful":4,"cool":3},"DsuJ66pImmXzfFpqp8ZpGQ":{"text":"Nous avions reserve depuis 6 mois 2 suburbans pour 8 personnes chacun , nous sommes arrive","useful":1,"cool":0},"4VyysQ-DLh7gTojv--xjJQ":{"text":"Waiting 45 minutes for a car an counting. At least I am in the company of a dozen other re","useful":1,"cool":0},"qOXm2C21hdF8VIwt-k14bA":{"text":"These folks offered to drive us in our rental car, from car return to passenger drop off a","useful":1,"cool":0},"q22A0NIFYQS74V4f6cqGWA":{"text":"Nobody expects quick speed of light service in the big easy, but waiting 35 minutes after ","useful":0,"cool":0},"I5R-5uhiAjZ5N2NT7HrPVg":{"text":"OMG...It's has been an hour since I stood in line to pick up my car and I am are still wai","useful":0,"cool":0},"XsQbl9__fB_hktbbQff1Jg":{"text":"DO NOT I repeat DO NOT use this car rental place.  They upgraded me and I didn't ask for a","useful":2,"cool":0},"NJciw1F-4LFgKOohsb3h9w":{"text":"I rent cars all the time and I am a Hertz Gold member.    I was helping my daughter plan a","useful":0,"cool":0},"zoVTgX9kN0zINh1bK0Z9pA":{"text":"Beware when renting a car. I checked in and they told me they had a Hyundai for me. I said","useful":1,"cool":0},"CRPi9CJBa-nAHQWoUEsCVA":{"text":"5 people waiting for cars all with reservations. Should have spent more to go with nationa","useful":1,"cool":0},"IY-2Sv1HvYeZ1XxOLpetgw":{"text":"Nothing but extra fees at this place. Steer clear. Came and and was charged an extra 14$/d","useful":2,"cool":0},"E9LAld1PdxtyOSkS7gzkFQ":{"text":"This was the worst rental experience I have ever had maybe with the exception of Dollar in","useful":1,"cool":0},"yZaf5WQUZtSDra3QyWgSGQ":{"text":"The worst possible service I have ever experienced with any car rental agency in over 20 y","useful":2,"cool":0},"NEyfCgstpBNSl74IVUeHHQ":{"text":"Being a member of the Gold Plus program I always expect it to be a simple, straight forwar","useful":0,"cool":0},"8t970u-Hm_S8rPcyoFShuw":{"text":"Actually, there is essentially no such thing as a a Hertz Rental store in New Orleans.  Th","useful":0,"cool":0},"8OlVKMrQDEANFGGtQNbg4w":{"text":"The car rental center is now connected to the airport. No more shuttle. I used Hertz Gold ","useful":0,"cool":0},"iR2Il9mJcA7RSEi0mD7BHQ":{"text":"Good service, wide range of vehicles to choose from.","useful":0,"cool":0},"5nwFIEXxukhWVeYbU_eEpQ":{"text":"Will never reserve a car with Hertz again. The only reason I did it this time was because ","useful":2,"cool":0},"JMDJiRI7mC5umPHYNFYTtg":{"text":"I booked a car online for a one way reservation from New Orleans to Austin, TX.  The quote","useful":5,"cool":0},"ZZMBfi4_MLIKMadPHJwQoA":{"text":"I should have checked the yelp reviews before I made a reservation here. I regularly used ","useful":4,"cool":1},"KAxHwQh5JVxL74DscP5gXw":{"text":"Just an update that after my terrible experience I DID write a private message to Hertz so","useful":4,"cool":0},"zJGGqaZQ39FEAMPtHiBQ6A":{"text":"This is by far the worst Hertz on the planet!!! Never has my car been ready at this locati","useful":0,"cool":0},"oJg1oQueaGgPgLjzXlMo3A":{"text":"Avoid if you can. Customer service had attitude problem. Found this car ren tal agency to ","useful":1,"cool":0},"IFTBkWGk3HII0TNmrc8wLw":{"text":"Way start our vacation off crappy. Waited over a half hour because our car was getting cle","useful":2,"cool":0},"6lUcVNoDcMHJ0qtHA-zw6w":{"text":"Budget was able to accommodate me seamlessly. I arrived at 12:55 to pick up a car. Waited ","useful":0,"cool":0},"OYd-2GF-LksGWDKjCNA5ag":{"text":"This has been the best  car rental I've ever had to date.  Car was ready for us when we la","useful":0,"cool":0},"-1oMz8vunqTEdJv1jIcLSQ":{"text":"To call this place untrustworthy would be putting it extremely mildly. Be sure to answer n","useful":7,"cool":0},"gIYCF0BdlCGFIpMrh3V22w":{"text":"Hertz is always my go-to for renting cars. WESLEY JOHNSON helped me out this time around. ","useful":1,"cool":0},"wsYugQXejP24rig1w6wHAA":{"text":"Slowest hertz ever and they will take your reservation when they have no cars.  I am a pre","useful":0,"cool":0},"PrLdl-fwcuw-4m74225xdw":{"text":"Easy to get in and out with hertz gold. Not the best prices or cleanest cars but good serv","useful":0,"cool":0},"ibbrkqfcfk4nq2xXtXIVHw":{"text":"This particular location is pretty shady.  I booked a car using prepaid hotwire deal.  Whe","useful":6,"cool":1},"0vIbwJf-oRvhNQ_Xu4T_dQ":{"text":"I wanted to share an experience that I found to be TOTALLY unHertzelike (a new word!!). IF","useful":1,"cool":0},"EwIfANO2OhVpSZrg-BH0eg":{"text":"Absolutely worst rental car company!  I reserved a car online this morning 12/16/19 for my","useful":0,"cool":0},"H7AAZPfW9_7sKPEbIQxvbw":{"text":"This is a follow up to my previous review in March 2021. After months of trying to contact","useful":0,"cool":0},"eSrAI9aiDNN2izBnlXy24g":{"text":"Great customer service and wasy rental process.  Vehicle selection extensive . At New Orle","useful":1,"cool":0},"632BfLhf9zSFD9r2EsSfVg":{"text":"Stayed in line for an hour. When we arrived there were two people working and 4 people in ","useful":0,"cool":0},"VtvUSABk7tJNh3r2-OYmww":{"text":"For a few business trips, I rented cars from Hertz at MSY because they offered a good pric","useful":0,"cool":0},"SoZPhSZjLnnWhhgFw_PfrQ":{"text":"I paid for my rental car 2 months in advance. I live on a set income so I have to pay for ","useful":0,"cool":0},"jpAw9nF4trxBQiKUahUKwA":{"text":"Never have any issues with Hertz! Located in the car rental terminal located west of the a","useful":5,"cool":3},"kCcbmFZ0I96fpqSlXEI_vg":{"text":"In summary (Winter 2016)\n------------------------------------\nDO NOT get a car from here; ","useful":2,"cool":0},"PYLsaq10SNo61z2DygPnmg":{"text":"TLDR: Don't rent from this company unless you like driving around disgusting, beat up cars","useful":8,"cool":2},"yp_waU2o4bBvL0FE-UBRwA":{"text":"Dude this place couldn't care less about you or your inconvienances. Skip the hassle and t","useful":2,"cool":0},"QAY4snljze6ZQOi7qRrP_w":{"text":"I rented from MSY (Louis Armstrong airport in New Orleans).  Pick up went fine, however, I","useful":2,"cool":1},"UQJfzHakjvql0rK1jbCMJA":{"text":"I frequently rent cars from hertz and am a President Circle Member.  With each rental come","useful":0,"cool":0},"nM2yVL7mlNVHYLfvEmvJsw":{"text":"I want to start by saying that when I received my car, it was very clean. You can tell tha","useful":2,"cool":0},"bHORY105xuUBnJdC7fBBrA":{"text":"Waiting for 30 minutes so far in the same spot, watching people spend 20 minutes at the co","useful":1,"cool":0},"VqCpWxDAz0vJu-KnaYf_vw":{"text":"We rented a Suburban for our trip to New Orleans. After arriving to the airport we approac","useful":1,"cool":0},"9_O5GERRfdF0G-MFC5soOw":{"text":"This was a smooth process.  I presented the agent with my confirmation number and he gave ","useful":5,"cool":3},"hWDTpzPbi34FicSmyXkXKQ":{"text":"Reserved a toddler car seat months ago when we booked our reservation. When we checked in,","useful":2,"cool":1},"Ep2FmNPlBC7rPuUOpQa5Ow":{"text":"Unreal - don't make the mistake I did. I prepaid and had a reservation and waited over an ","useful":0,"cool":0},"QM83c5rhXQXBi84WsCPVdA":{"text":"A thoroughly frustrating and disappointing experience picking up our vehicle last night. D","useful":1,"cool":0},"l0m2u_9gSOj1ZPgoaVF2vw":{"text":"Can't believe this place has bad reviews. I think more people has to be more positive abou","useful":0,"cool":0},"JAOfcBK4wINr4C-pWKLBYQ":{"text":"It took over an hour to get a car that I had reserved and paid for online as the line of 1","useful":1,"cool":0},"LMgtA1GkWIasVamNUecTIg":{"text":"I have rented from Hertz for over 20 years personally and professionally and have been Pre","useful":0,"cool":0},"U4UZFphE1fSbVykaRWnP8w":{"text":"Worst experience I ever had!!! I waited over 2 hours and there were just two representativ","useful":3,"cool":0},"9gorM99EORsPa8qTOvFS1A":{"text":"For the second time, yes the second time, Hertz did not have the suburban I rented months ","useful":1,"cool":0},"lydFDTiAfchrLh3iAE3HsQ":{"text":"I always rent from Hertz. And this recent trip to NOLA was no exception.  \n\nOur flight got","useful":8,"cool":5},"b8fwMCRlG4wnzNoU-z0oFQ":{"text":"This place is a joke and do not reply back with one of your stupid comment that you will g","useful":1,"cool":0},"SVRcyeXAxDn84C8V6s8Psg":{"text":"No one works here, at least in returns. \n\n3 separate times I have returned a car here (bet","useful":3,"cool":0},"LzfLWg2332n69955ORctuA":{"text":"We reserved our car online & pickup/drop off were really easy. The only thing I dislike ab","useful":1,"cool":0},"Gah_7kC00WaioyVwTD327A":{"text":"There were very long lines with very little people working. Once you got through the long ","useful":0,"cool":0},"lWkzndprM8MdorqswuN2CQ":{"text":"We are sitting in the cold in the garage at 1145pm. One employee working. This just doesn'","useful":1,"cool":0},"mL-gAnilHY1mZ-wNc4i3Aw":{"text":"Worst worst worst company and terrible customer service. I have rented many cars in this l","useful":0,"cool":0},"GINI0vMUvqJEeppmQ-GQCg":{"text":"I had a two week rental and my car had a dead battery the morning after I got it. They sen","useful":1,"cool":0},"Cwmf2jLryx2WPZoc5XtPHg":{"text":"As a loyal Gold Plus Reward Member, my trust in your company has been broken. I rented a c","useful":2,"cool":0},"fouWNlrhmFAhHPhslTi5iQ":{"text":"I made a reservation to pick up a car here and upon my arrival, I was told that they had n","useful":0,"cool":0},"Hdxc1BZjNwxSyn5IAU25tQ":{"text":"Horrible service.  President's club member and waited for over an hour for the vehicle.","useful":0,"cool":0}}