{"QsWdIXDqhQBCnMKXKTmp1Q":{"text":"I recieved terrible customer service when asking to split a bill.  They refused, said that","useful":1,"cool":0},"Tq5bttC5cBt47zvNbzC3HQ":{"text":"The staff was great! Told us what she liked & she wasn't wrong. There were 5 of us & we ea","useful":0,"cool":0},"pe4vu1ASuZnfLj4natGP5A":{"text":"I am not one to write reviews but felt compelled to do so on this restaurant. I grew up in","useful":0,"cool":0},"hjkXFqWp-Nba_Y-PgxcrvQ":{"text":"Why I fall in to tourist traps even after being to nola a thousand times is beyond my comp","useful":7,"cool":8},"LkbPM1NWqGmkiL-4un_4HQ":{"text":"When ever we come to NOLA we stop here at least once.  My husband is a local in NOLA and w","useful":0,"cool":0},"e-pmu-1h-_Wmr9ODdF2n_w":{"text":"Good food, good service. I would recommend this place mainly for drinks though. It has a f","useful":0,"cool":0},"gG7xtQU6ydFTnIRmXRsz1w":{"text":"The location is great, we sat next to the big open doors which let a wonderful breeze in w","useful":0,"cool":0},"XUghSQlFc8mMyaeIpP0qYQ":{"text":"I came to New Orleans for Mardi Gras. We heard about this place and came on a busy Saturda","useful":2,"cool":2},"ySP7LnuaI6M_yc8arbaiHA":{"text":"When you have a broad choice of eateries in the French Quarter, mediocre food and poor ser","useful":0,"cool":0},"Qq-tdBJksgx-wl3d-RXW4w":{"text":"Tourist trap! Beware, food was gross, nothing special was the general consensus around the","useful":0,"cool":0},"Q_E4HvHQCt4EecvW5CErPw":{"text":"besides the rustic naw leans architecture and style this restaurant has great fried seafoo","useful":1,"cool":0},"EkZPqpaVwjK56ZeHb52GKQ":{"text":"The hot sausage sandwich was DELICIOUS! And the service was great!\n\nOur waitress, Melva wa","useful":2,"cool":3},"Rd4u-TApHuLI7bmX3IllVQ":{"text":"Great food and best recommendations by our waitress Starr!! Thank you for all your advices","useful":0,"cool":0},"1iV387thvkNFhLPxm7KFkw":{"text":"Probably the best catfish po-boy I've ever had.  The bread was soft and delicious.  The gu","useful":0,"cool":0},"0Qt9GTEeJqYXj8mjPH4u1g":{"text":"Food was served fast and Chris our server was friendly and efficient. Try the Muffuletta s","useful":0,"cool":0},"nDF6jJiOsWrECgsySQg78g":{"text":"Stayed right down the street, stopped in to take RedBeans and Jambalaya sides back to the ","useful":2,"cool":0},"9jD0A1ndr_QLDLKFGJAr5A":{"text":"If your looking for rude service, being called out your name, mediocre food, and unclean s","useful":0,"cool":0},"wpS2vWnaA-1WjWYedeSRpA":{"text":"Yuk, this place is garbage.  We drove through New Orleans and figure that the French Quart","useful":1,"cool":0},"qIqb7BjNg-j0D6Q0iydqWg":{"text":"Good late-night food. They have a good roast beef sandwich with au jus and french fries ar","useful":1,"cool":0},"9vi3ipS0zNdmv3Wyc_MtFw":{"text":"Awful. Jambalaya that was 99.9% rice. Shrimp platter was a mess - thrown together sloppily","useful":0,"cool":0},"wqrMai3ZP7QJUrB1uvOxzg":{"text":"Great prices for the location and quality!  Fast and friendly service.  If you're looking ","useful":0,"cool":0},"s0dyQJCLKy3mMpp_wcJY0A":{"text":"We were encouraged to eat hear when we spoke with an employee at the door. We went in for ","useful":0,"cool":0},"jqC5GUZrZEUSQL3PPuC1tg":{"text":"One of the best open-bar, people watching corner cafes on the planet.  If you come here, y","useful":0,"cool":0},"-pZjIG4pIcvkrkNY30J5Jw":{"text":"The jambalaya, fries and red beans are pretty good here.  The shrimp poboy was pretty good","useful":0,"cool":0},"RAEtt6HRaOChAqWsG5yGaQ":{"text":"The roast beef sandwich is great here and huge. The seafood platter is cheap and pretty bi","useful":0,"cool":0},"wLaNTlyJdn59U8z9oPw_Cw":{"text":"Really enjoyed the fried oyster poboy and the muffaletta Italian sandwich. Quick and quali","useful":0,"cool":0},"5AsKIEjrS4BJ581LuA0Maw":{"text":"Service was great.  Food is consistent every time we go.  French onion soup and muffuletta","useful":0,"cool":0},"fZxQwrrgNP2XpiUea5fTcg":{"text":"We live in baton rouge and absolutely love this place!! Definitely a must-visit whe in new","useful":2,"cool":0},"AgxpA6E5oz9SEbBS3ZqkUA":{"text":"Excellent and quick. One of our must visits every time we come to New Orleans. Be prepared","useful":0,"cool":0},"UjfXN6pQVpvO_MXMG4KoAQ":{"text":"We were seeking a catfish muffaletta and couldn't find a place with it on the menu.  The s","useful":0,"cool":0},"965vIRhe1f-gr_aeekmRZg":{"text":"Terrible Customer service.... the young man at the door was great however once inside bewa","useful":1,"cool":0},"R3GUkQ-tSg_LEHxH8HgDmw":{"text":"This is a decent, moderately priced restaurant.  If you are in New Orleans do not plan thi","useful":0,"cool":0},"X2uySqcUPBMGgN-zWgdfHw":{"text":"We saw a rat running around and when we raised the concern the response was that they coul","useful":0,"cool":0},"KnGo-Pors-2F7tA7FAYiQA":{"text":"The good: our waitress Arica was very friendly and immediately made us feel welcome, which","useful":6,"cool":0},"37BmXAynQaoCkDbbLRJl4Q":{"text":"Had breakfast/lunch here with my wife in town for a convention. Nothing special that would","useful":0,"cool":0},"2dpZRZx8kgFcDsrZwX2Pdw":{"text":"Jambalaya was bland. Definitely better options available for authentic New Orleans cuisine","useful":0,"cool":0},"aXnOJqfpfwtmaKm0OO6cIw":{"text":"Good value. We got takeout and ate at Jackson Square while people watching. The sausage sa","useful":0,"cool":0},"KIkTRzvy5Abk0odvDHwhAA":{"text":"I don't like leaving subpar reviews...but I take Yelp seriously so I need to be honest. \n\n","useful":2,"cool":0},"Qisi-HzNPkqT-11MhX8CfA":{"text":"The food here was good but our service was terrible. I wouldn't go back here and I barely ","useful":0,"cool":0},"XOLfqteRzEX3bmrVq62cHg":{"text":"Open air dinning if you can snag a table by the open French doors. I had the best breakfas","useful":0,"cool":0},"yRy6JGXhnh76afflmZPQxg":{"text":"Was here over the Labor Day Weekend Holiday, and dined here twice. Their Shrimp Po-boy was","useful":1,"cool":0},"PvP7HgBxvCTcKQoatj-A6Q":{"text":"Don't mistake Cafe Maspero's for the Original Pierre Maspero's (which was the goal..). Umm","useful":0,"cool":1},"m8W08c80tCEnqP4iwGTnLw":{"text":"Well I have been coming here for years and it has always been a must stop for me and my fa","useful":2,"cool":0},"FMt0c4kOqZ09PejHTG_Ztw":{"text":"Lame food, lame service. Overpriced tasteless Cajun cooking. For the same price you can fi","useful":0,"cool":0},"6gRiiKvm-PhDOytRXWVHeQ":{"text":"I went to this place on the recommendation of the concierge at my hotel.  I was skeptical,","useful":0,"cool":0},"yaWIMsIDISC4Zgkn1DgyQg":{"text":"Atmosphere is fun and very New Orleans. Its loud and crowded but that's half the fun. They","useful":0,"cool":0},"qORzReD0QHd235yMH7lhCA":{"text":"Breakfast is good, however the Cajun Bloody Mary is OUT OF THIS WORLD. If you are in New O","useful":0,"cool":0},"jvlQgGMJm_2l5W_gCiAOyw":{"text":"PATRONS BEWARE**Do Not Stop and dine. This is by far the worst staff and customer service ","useful":0,"cool":0},"_03Rf2tzC1OwaJUtAQYNrA":{"text":"There are about 9 bazillion places to eat in New Orleans.  Everyone says \"eat here, go the","useful":2,"cool":1},"boFxFA55ZMGRwTqygy8Lyw":{"text":"The worst service!! Food took over an hour to come to table. Waitress never acknowledge us","useful":1,"cool":0},"0zVMS4uPEXb1G6yxbnc8lA":{"text":"Food is good but the star of the show is Melva! She was wonderful- so friendly and outstan","useful":1,"cool":1},"40-nG9xamdTnjBK72QFjUw":{"text":"Great spot for a sandwich. They serve the classic muffaletta sandwich w fries, not fancy b","useful":1,"cool":0},"-mIBDXsvDTM8mHOIUn0ReQ":{"text":"If I could leave a negative star at this point I would. Please note- I am truly hoping to ","useful":1,"cool":0},"6th7ZKvYKdC-5ydLI4_oBA":{"text":"There are a few pros: the staff was friendly and engaging, the restaurant was clean, and t","useful":2,"cool":1},"i0oTxEt-O7TDrPV92B-1Fw":{"text":"Ok been there many time over the years, yes its now a tourist place, but locals still  go ","useful":0,"cool":0},"XTtij7Qpd2xYuUMfm0tJHg":{"text":"We found this place when we got off the Natchez tour, I'd give it a 3.5, but I bumped it u","useful":0,"cool":0},"ezfdtYcnh4Uf3BGlpZ6Quw":{"text":"Meh. Shrimp poboy wasn't great, but the service was good. My friends really liked the gumb","useful":0,"cool":0},"R-c2a-te67rCexzpIubuqQ":{"text":"Chewy bread (and not the good kind that some french bread is known for), smelly surroundin","useful":1,"cool":0},"MwJbJX9nW1syvZBcXqCxtQ":{"text":"**BEWARE** There's far better places to enjoy NOLA's cuisines then this place. Tour guides","useful":0,"cool":0},"Dl-i_KuemFKYLr6qHhkqtg":{"text":"Best food for the best price in the French Quarter! Keep it simple when ordering--Jambalay","useful":0,"cool":0},"g28Zzswl99tsje5RmrFGBg":{"text":"I liked this place. Yes it was a bit grungy looking but not unsanitary. Our waitress had w","useful":1,"cool":0},"ADDD27wyq6oOH1nt_9UYXQ":{"text":"Tried this place on Sugar Bowl weekend. Every other restaurant we tried was 1 1/2 hour wai","useful":0,"cool":0},"hp2W_WSXyNrzSb_of9cwcQ":{"text":"My well drink tasted like straight cranberry Juice. Our Fried Shrimp Sandwich was bland an","useful":0,"cool":0},"NDagWCM9DbjzUshi7t6laA":{"text":"One of the few places in the French Quarter that serves good New Orleans food. Sure, the W","useful":0,"cool":0},"_w4PG2hzRhiH2o9NWsHssg":{"text":"Me and a group of friends went here to eat out for my birthday and the service was horribl","useful":0,"cool":0},"mwRYykjcUDGBFGWPDaAxfw":{"text":"Food is cafeteria quality. Jambalya was not as good as the Zatarans stuff I make at home. ","useful":0,"cool":0},"LrgdcWl9tIXNzFFcX0nDnw":{"text":"Cheap food, large portions, and pretty good flavors. It is a Cash only place so be ready b","useful":0,"cool":0},"HRyfcjkzjF6X84HVmXMPdA":{"text":"I came here to try the muffuletta since it's a New Orleans specialty. Dang, I really don't","useful":0,"cool":0},"9MDFGxPpuVvlOm2DsrGoNA":{"text":"This restaurant was recommended to me by the lady sitting next to me on my flight to NOLA.","useful":1,"cool":2},"ADW_t2m531SEub6Bhz85zg":{"text":"Aleays get the seafood platter. It's a great plate of nicely fried seafood. My first time ","useful":0,"cool":0},"1jUffI3FyWIfu9SJD-Eorg":{"text":"Quick fast and cheap doesn't get any better than that in the French Quarters!!!!","useful":0,"cool":1},"lxaEU7ds8Nt0pLkvTbC9sw":{"text":"Ugh..\n\nIn a desperate hunt for food in a city not equipped for a forecast of near freezing","useful":0,"cool":1},"v3h3m4Uz7wHAukU89K6Buw":{"text":"Went hunting for food our first night in NOLA after a long day of travel and realize woah ","useful":0,"cool":0},"-bYwy_IW62tE2v2lWL-zjQ":{"text":"My family has been going here for years and today was such a disappointment. They've alway","useful":0,"cool":0},"X9zhad1kWRl-hEQpBFKybg":{"text":"I just spent a week in New Orleans for the New Orleans Burlesque Festival. I go to Cafe Ma","useful":1,"cool":3},"JqHER8cO9PaJZomBNqpLUQ":{"text":"I ate at this place all three nights while in New Orleans. Staff was very friendly and the","useful":0,"cool":0},"hdcrimcZwBRZVvbrDVWWOA":{"text":"We went to this place on recommendation from our hotel concierge. The service was very goo","useful":0,"cool":0},"y_q1M0CmFfQkpY7CdIm5vw":{"text":"I had the Calamari and Jambalaya, SO good! You're seated quickly and it's in a great locat","useful":0,"cool":0},"gKkVJbDwTsaa-LzI_e-gHw":{"text":"My friends and I were visiting for a weekend birthday celebration, and it was recommended ","useful":1,"cool":0},"oH8_ahT06OYo8sv9zrkbZQ":{"text":"The service was very good.  If there are 2 of you and you both want sandwiches I suggest s","useful":1,"cool":0},"9WIL3QbUwM298DkYA4ykUg":{"text":"The food was very good. It was nice to find some of the Cajun flavors from the other side ","useful":1,"cool":0},"YMOSDFaCp-9VGB0xmOTFlg":{"text":"Great environment.   Had a steak strip, a little tough,  but manager was at our table righ","useful":0,"cool":0},"C0kg3p8f3Y-XgZ1J9bQjcw":{"text":"Came here with the girls for dinner after a day of walking around and shopping for souveni","useful":1,"cool":0},"ExNefD5reZOVyc4pT9y2ug":{"text":"I went to Cafe Maspero several times for dinner with a friend. We took Muffulettas. We had","useful":0,"cool":0},"j9VnweCl-K33y1JX530LFw":{"text":"Saw buffalo chicken sandwich advertised outside Cafe Maspero's restaurant so I stopped in ","useful":0,"cool":0},"yCl4pX5LvOEARaKBNDQorg":{"text":"Good breakfast spot in the French Quarter. Good good, good service. More traditional break","useful":0,"cool":0},"juBqzoNj2FUIyc4stMNOaw":{"text":"Wasn't too busy. Good service. Got muffaletta. Pretty good. Not the best but not the worst","useful":0,"cool":0},"L43RrggdG89ydL-PV12U7w":{"text":"Yuck.  Building looked interesting and had lines out the door.  Prices were cheaper than m","useful":2,"cool":0},"1oZ1e-xcx2SPrZx9w2ndHw":{"text":"This initially would've started out as a good review until our check came.  My husband and","useful":0,"cool":0},"GoL8hoDUz9L3YYI_1bD_AQ":{"text":"If you are looking for good food you best try elsewhere.  If you are looking for CHEAP foo","useful":0,"cool":0},"oax4l8Cd1NDjsi30Z4wUpA":{"text":"This is a pla e go to place in NOLA. Not sure why some of the people rate the food as awfu","useful":1,"cool":0},"9xHM55zW6FWr-lQrVGPLvw":{"text":"Found this place last min for breakfast.  Something going on half french quarter out if po","useful":2,"cool":0},"rnU1KmNKcN-i6t8tHGBpgw":{"text":"Another of my favorites!  I don't go to the French Quarter much unless I have visitors and","useful":0,"cool":0},"zBKi1jM5G4RBHxlVbbsgnQ":{"text":"Came here for the authentic Cajun food for our first time in New Orleans...Our party of tw","useful":0,"cool":0},"ByB6Qv63yxj1KmidoiJuYw":{"text":"The staff is excellent. It's in the heart of the tourist district but it feels local. I've","useful":0,"cool":0},"WlqId2gWvIQiT-fUAb0iyg":{"text":"We were starving and trying to find a place to accommodate us without a long wait. We walk","useful":0,"cool":1},"2Nm4XhWWYuSxu65U4zdF8g":{"text":"First time eating here. The food was good. Our waiter wad top notch. Very friendly and hel","useful":0,"cool":0},"p8X8Kl6ukT_GQRLrCnFZBA":{"text":"Everything on the menu is greasy and fried. The food is flavorless, and definitely not wor","useful":0,"cool":0},"DaAIgkdVBdXYvAwQcE3FqA":{"text":"\"Really good. Food was great.\" Those words are from my cousin and she ain't neva lied...\n\n","useful":0,"cool":0},"2rqkFTgYc5kOgeC-aCt4kw":{"text":"It was just okay.  I was a little excited for the $1 house wines and daiquiris, but they w","useful":0,"cool":0},"ZmdlXNgKgAJk0PhQ_UjpAA":{"text":"Walking along the touristy part of downtown we walked into this place to check it out and ","useful":1,"cool":0},"9w0GRwBBoGCaqHZX1Fok5Q":{"text":"Seems to be going downhill...the roast beef sandwich is not nearly as good as in the past ","useful":0,"cool":0},"N9_YlWlmd2EdYCt9gaL8-A":{"text":"The wife and I stopped for a late lunch of Seafood Gumbo.  Good flavor!  The staff could h","useful":0,"cool":0},"nCpZEz5z9kXeaia9fCIsMg":{"text":"Wonder why people rate this so low. ...it's a solid spot to get cheap and plenty seafood a","useful":0,"cool":0},"YxXq0j6uHJrqf4NrZG3MQA":{"text":"Great place to eat! A lot of food for your money! Cheap drinks and nice staff!! Thumbs up ","useful":0,"cool":0},"Q0pacYAzi1gxWhSlSOK-PA":{"text":"Phenomenal lunch at this wonderfully welcoming establishment. Sat at an open door table wi","useful":0,"cool":0},"CtML6u4xN2ww1C5KlDywgA":{"text":"I was in the area with some friends and we dropped into Cafe Maspero for a quick lunch. Bo","useful":0,"cool":0},"PM1t5R2-sg6b1Tlaqp6-jQ":{"text":"I would first like to say that I had some most radical company when I came here, so perhap","useful":1,"cool":1},"_06yBeh1aooJlCMvDfspnw":{"text":"My go too place for lunch when I'm in The French Quarter. Muffulettas are great, French on","useful":0,"cool":0},"dQkCrsvzMNtBC7Vc2KYfpg":{"text":"We were in the mood for light and easy... this is the place.  The draft beer menu could us","useful":0,"cool":0},"Lw5rnXwteZlnSfAVrymh5Q":{"text":"NO STARS FOR THIS NASTY PLACE!!!\n\nCame here for a night after the wedding dinner at the gr","useful":0,"cool":0},"c-NNDoaIgUIHJmbr-DSZzQ":{"text":"this is comfort food.  it's not fancy or expensive.  in fact, the food here is pretty chea","useful":1,"cool":2},"9hmjEdPrkXYCzGS9auU7aA":{"text":"We pulled in to downtown parked. This is the first place we saw and we walked in. Melba!!!","useful":1,"cool":1},"GeZgbxFna0WcuZ_ahNxNfA":{"text":"had the muffaletta - very good! Jamie had the red beans & rice w/sausage...very good, very","useful":0,"cool":0},"Euul4fpJ3X3QOyC98KRrIw":{"text":"Great food and even better service. Authentic New orleans dishes. We got the jambalaya and","useful":0,"cool":0},"oxIfq19PcKWWgqOXe0jeig":{"text":"We popped in here for a quick dinner one night while visiting New Orleans. The service was","useful":0,"cool":0},"qw26X5uHOM-h6kL-qdhIOQ":{"text":"Frozen. Fried. Toothless wonders of a staff. Wonderful experience to be had by all. I just","useful":1,"cool":0},"ZWfGaXKC4201UdHdw-TXxw":{"text":"Great New Orleans style Cafe!  \nGood service, decent food and a great Cafe style atmospher","useful":0,"cool":0},"9F1cY6SASFRu9MvZhLqcXQ":{"text":"Was here last night with my kids after the Holloween parade.  As a kid my parents would ta","useful":0,"cool":0},"QXglLR26-dEKIyRt1qVlww":{"text":"Excellent service and great veggie muffulettas, super cheap for the portions you're gettin","useful":0,"cool":0},"rJqQxw3CaoSPY-capVJcyw":{"text":"Stopped in for a quick bite.  Had the gator and sausage po boy and it was pretty good.","useful":0,"cool":0},"zG2GhbZRuP-fNnyzM4snug":{"text":"Hanging around the French Quarter and decided to grab a quick lunch. Was feeling adventour","useful":0,"cool":0},"-_imuNTAB29xteW07H1puA":{"text":"We were looking for a place to bring 2 families and someone recommended this place.  I had","useful":0,"cool":0},"ZOSP67EN7u_Ciim1SFrRXw":{"text":"Great customer service, convenient location and some of the best fried basa fish I've had ","useful":5,"cool":2},"Wito3EWSyyf_0min8EjGJg":{"text":"This place is soo good!!! Thank you Melva for making my experience more than expected!!!","useful":2,"cool":2},"rNSo5nMIx_MkTkRH8hYscg":{"text":"Horrible service and food, the chicken in the jambalaya was very dry and hard and just ove","useful":1,"cool":0},"N7aNWMINFr7183pmWndvJA":{"text":"I came to this restaurant with a big group of friends and have to say I really enjoyed alm","useful":2,"cool":3},"nVRVsH_BB3jwgSw-20HYJg":{"text":"Always good, great location, friendly staff and great food.  Good enough for Andrew Jackso","useful":0,"cool":0},"FM_0c-xiLUerrbYe6K9GSA":{"text":"No - Just... NO!!\n\nThis place used to be A-ma-zing back about 10 years ago.  I used to go ","useful":4,"cool":1},"8bA8Any4L3El_rPqkksrzw":{"text":"Great place off Burbon St to relax, enjoy a cheap daiquiri. Always have the muffuletta and","useful":0,"cool":0},"gcmHqD9XmB1Rd2cl-E9bfA":{"text":"The food was great. A perfect place for group gatherings. Mrs. Renee was a very nice and g","useful":0,"cool":0},"Oi7vprYkLnn0pMhwS2wGhg":{"text":"We had great Achafalaya omelettes and a great waitress, Melva. Right on Decatur. Open all ","useful":2,"cool":1},"Pf0IpIF85KCLPoLgEy4UZQ":{"text":"maspero's has been a must stop for the past 20 years. This year it all changed. Their over","useful":0,"cool":0},"Tp_BfpPwvE_ZLUZ7zeLR4g":{"text":"I don't get the hype. \n\nOur lunch was the essence of \"ok\". I ordered the fried shrimp sand","useful":2,"cool":1},"22WNMKiGD_yInlaUyBUyKA":{"text":"This place was a complete waste of time and money. I ate with a group of people and no one","useful":1,"cool":0},"rZzGGSA_nx8Q_IbsAwwRDw":{"text":"Fun atmosphere and interior. If I'm totally honest the food was good but not what I had ex","useful":0,"cool":0},"Gm3Ip_aZ5yqORoxEHowcZw":{"text":"Cafe Maspero was recommended to myself and three others. We attended lunch on a Saturday i","useful":10,"cool":9},"_NYglAyl4tOY3c51Jsqd4A":{"text":"Unfortunately the worst meal I've had in New Orleans. I ordered a Bacon Burger. The burger","useful":1,"cool":0},"irnBQiJd8G09nv6d8E9M5Q":{"text":"OVERATED. Looks incredibly busy, but obviously  with first time tourists. The staff couldn","useful":0,"cool":0},"2V6huz_qc7fm4TKsqQY0oQ":{"text":"Stopped in for a couple drinks midday. The bartender- I believe her name is Kotanya- was e","useful":0,"cool":0},"t-4rNnupKrDlBk3UnJ9nBw":{"text":"We were in New Orleans for a Mission Trip with 33 students and 10 adults. We wanted to wra","useful":0,"cool":0},"LoR6BHab0JOpTwP2h2vJHg":{"text":"When we arrived we were told there was a 10 min wait.  There were 14 tables open!  Service","useful":0,"cool":0},"gKw5cVFwWvwxX64MZsq7xg":{"text":"I did not like this place at all. The feel of the restaurant,  the food, and our server we","useful":0,"cool":0},"n_IAWT_5jVZsGO1nGKvZlA":{"text":"I like this place.\n\nHungry and wandering, my friends and I were relieved to find Cafe Masp","useful":0,"cool":0},"I51KSTG-P1mHRO5DszNNKw":{"text":"I go here everytime I visit New Orleans simply because it's a very affordable consistent l","useful":1,"cool":1},"mASmvf-759U5c4xf-_Oqcg":{"text":"It is what it is. Cheap, lots, fun and basic. Not haute cuisine or gastro pub food but bas","useful":0,"cool":0},"rHulOUbfW7Z6YEQxOEWyyA":{"text":"Tried jambalaya and muffaletta, both sub par. At least they don't charge an arm and a leg ","useful":0,"cool":0},"wj-jilcQ8fKz294lL0q6EQ":{"text":"This was a pretty good place to stop for lunch.  I ordered a salad and jambalaya and my bo","useful":0,"cool":0},"7NK560ENhifY77meoJ1new":{"text":"Best french onion soup I've had in a very long time! Red beans and rice was good. Jambalay","useful":0,"cool":0},"55_TMqtO0-mZVg6nLO4fSQ":{"text":"So disappointed. My boyfriend basically just had a bed of rice for for his jambalaya. My c","useful":0,"cool":0},"oXg1um1BdOViYwPCfLxHIQ":{"text":"Thank you for your apology and it is Accepted.  In fact I just mentioned to my husband ear","useful":0,"cool":0},"Ulc1gk1EkyhXoJ_q9mp4gw":{"text":"First time in New Orleans and I was told I needed to try this place out. The food was amaz","useful":2,"cool":2},"EOgm1LiFlylCjz-f_QRA3Q":{"text":"I left Cafe Maspero severely underwhelmed by both the food and service. The service was pr","useful":0,"cool":0},"blXouT2GI0q2zbRaMCelKA":{"text":"I had the muffalatta and it was out of this world! Waitress was tentative and refilled dri","useful":0,"cool":0},"h1qdkaKpJbphcuJkH3QLeg":{"text":"My boyfriend and I were walking around and spotted this place with a line wrapped around t","useful":1,"cool":0},"_-zraT4cGKi3rpLZ8J0owg":{"text":"I come to the FQ from California on a regular basis and was introduced to Cafe Maspero's b","useful":1,"cool":1},"bxowbTigo06mNLM_NrbyfQ":{"text":"Super casual but EXCELLENT food and service.  Our waitress was a TRIP!  PoBoys and Muffule","useful":0,"cool":0},"JVY5TM2xfBLdYRvCjmvbjA":{"text":"A very casual place. Quick and friendly service.\nThe muffuletta was VERY good and huge. Th","useful":0,"cool":0},"Gm6XkAB44-6BCMoxIKj6SA":{"text":"Not very good. The service is pretty bad. The food is very bland. Ordered chicken and saus","useful":1,"cool":0},"5uAWPsvQomeZEU7H0HGAPQ":{"text":"Delicious muffuletta after a long day in the French quarter. This restaurant has plenty of","useful":0,"cool":1},"7nJxZc7ku7CKHDtr9ECjTw":{"text":"Hubby and I visited Cafe Maspero for brunch one Wednesday morning after checking out of ou","useful":0,"cool":0},"BouwS_0ptjM6b6jPmhbC4g":{"text":"Stopped in for a quick breakfast while taking in the sites near Jackson Square.  The food ","useful":0,"cool":0},"sVUyT3WZylB4aOp53ZTCKA":{"text":"It's unfortunate that as a visitor to the city, I chose to come here for my first dinner i","useful":1,"cool":0},"_xA6qPK3wPgVmPKDwgY96Q":{"text":"Drinks and service were great for being as busy as it was the gumbo was eh... and the Fren","useful":0,"cool":0},"OxoAiYo_IpDVOo6PRZBgzA":{"text":"The chicken jumbo and the French Onion soup were to die for! They use a lot of spices, but","useful":1,"cool":0},"cqEfCic45nagMu5mXkOr3A":{"text":"Wasn't very busy when we went and we were seated right away. Waitress preempted any questi","useful":0,"cool":0},"6y-W-E1vlpZqqZ58OE5NWQ":{"text":"This was such an amazing find! I wish I remembered the name of our waitress because she wa","useful":0,"cool":0},"FQC6FRkDYmH3vtapyiunVw":{"text":"So good, so cheap, always packed! If you're in New Orleans, you have to stop here!! I had ","useful":0,"cool":1},"7XlSNQKRm9yPqYWuQre5pw":{"text":"Melva (hope I spelled it correctly), was our server . She was a sweetheart and did a great","useful":1,"cool":1},"8WjuXQRtpiPqv5yq20KbuQ":{"text":"We stopped at this cafe and are wholly impressed. The coffee was amazing and the food was ","useful":0,"cool":0},"TTgd7sTf6adu6dUdqn1GJg":{"text":"This is a tourist trap.  Cheap prices Cheap Food.  Hot Sandwiches arrived cold with cold g","useful":0,"cool":0},"xI1bZDOi8XVFpBNGqrqE3Q":{"text":"Breakfast was great. I had two eggs, hash brown and hash!  Delicious! Service was quick an","useful":0,"cool":0},"0yRiAymAATyhuJokhJ60Fg":{"text":"Been here a few times too, it's pretty good. Usually busy, friendly staff, good food. Good","useful":0,"cool":0},"3zOOg7KM1vEfDzzG81J36g":{"text":"Ate here twice on a 4 day trip. Comfortable place, not too crowded at all. Had same waitre","useful":0,"cool":0},"YiElP_tPlyi6nff5sHAjHA":{"text":"Eurgh. Everything about this place is crap. The food is crap, the ingredients crap, the se","useful":2,"cool":1},"0YpVyliDxBRvJiKUF9GaVw":{"text":"We went here for the convenient location.  The competition in the French Quarter is steep,","useful":1,"cool":0},"lugNbouH0A7kwNC6xkdl-A":{"text":"My husband and I stopped in here for a quick bite to eat between our flight and boarding a","useful":0,"cool":0},"uoLB_a5mCNmmU4F3LcaIvQ":{"text":"Good place for a quick bite.  Nothing fancy, and reasonably priced.  Not the place place i","useful":1,"cool":0},"edq1MNBwzQbnY79-FH2MLg":{"text":"Located right at the heart of the French Quarter serving New Orleans cuisine. The foods ar","useful":0,"cool":0},"vNvmyYvmzbCC1JgBmB4wYA":{"text":"This place rates better than three stars for just the food. The atmosphere is old and some","useful":0,"cool":0},"tIgNtr5qYVLGASp_tK657Q":{"text":"We Stopped in for dinner. Kind of a dive, which can mean good food. Dinner was okay, both ","useful":0,"cool":0},"3V1qtLWWLwHhtbh5er0QWA":{"text":"This wasn't our favorite of the places we went, but the French onion soup was awesome and ","useful":0,"cool":0},"-B_EwACn_KE6OFzaufYY8w":{"text":"Cafe Maspero easily had the worst food I've had since moving to LA. The rice in the jambal","useful":0,"cool":0},"g_URGCSPZPddQMwU7T-Ytg":{"text":"The food was tasty and inexpensive, and the server was friendly. I also Love their $1 stra","useful":0,"cool":0},"PJY1XGjhrmulqtBlrPDuYQ":{"text":"Cafe Maspero is the only place I eat when I'm in the French Quarter. Stopped by this weeke","useful":1,"cool":0},"zjyYEOvF_f2QCdc8mV9Y8w":{"text":"We came with a party of 8 and waited about 15 minutes for water from a waitress that wasn'","useful":1,"cool":0},"q0cUJnnqQ1arC8pImNsjAQ":{"text":"My sister and I stopped in this place for a quick bite before nap time on our way back to ","useful":0,"cool":0},"ZtmUZiRkWYTE9FlSTDoFBQ":{"text":"The food was ok.  The server was nice.  The \"hostess\", not so much.  She was ok, I guess, ","useful":0,"cool":0},"B7D5JeEWNfkY1nk2F9usnA":{"text":"Stopped in for dinner while in New Orleans. I ordered the red beans and rice and my mom go","useful":0,"cool":0},"kldj_FMx3KkVV9ht8C_DLA":{"text":"Maspero's was one of the only long time places in the French Quarter that I had not been t","useful":0,"cool":0},"6XSuBv5eJxIJyX9DxunKAA":{"text":"Walked in here to have dinner with my husband. Sat down and saw a mouse run past my feet. ","useful":0,"cool":0},"vyHfnorbcbmqksgZfGVnxA":{"text":"This restaurant caught my attention while walking in french quarter because of the line of","useful":0,"cool":0},"EwW7brCJuDbvCsRf2hkUAw":{"text":"An acquaintance of mine who grew up in New Orleans suggested that I check this place out. ","useful":0,"cool":0},"eYoofg3HFi3-CB99PwOEBQ":{"text":"Below a average food for anywhere, much less a great food city like NOLA. My wife and I ha","useful":2,"cool":0},"jt3cS_6MQDXy3ZOPj2m9lA":{"text":"Just letting y'all know up front, this place is super touristy and on special event weeken","useful":0,"cool":0},"n97cuIfkfrxCizP8kKIjDg":{"text":"Meh. There were lines continually out the door for this place, but I can't fathom why. The","useful":0,"cool":0},"F_rZ8ZBhSNRVPIPxGalq9Q":{"text":"Let's start here:  cash only (but there is an ATM inside).\n\nThis is the place to go for ch","useful":0,"cool":0},"Nl0Yd4Rs81nTNMEBJ2_1Zg":{"text":"This is absolutely the best place in New Orleans to bring your friends who want to get a t","useful":0,"cool":1},"Z3ETDiKJQuKdOPX4TMz1mw":{"text":"One of our first dinners in New Orleans was at Cafe Maspero.  We were greatly impressed wi","useful":1,"cool":0},"N7zfG3He5S0LIIcjQWnLVA":{"text":"Oh boy, the portions here are very 'midwestern' but the quality of the food isn't great.  ","useful":0,"cool":0},"XBvMPW99nRVofg3k9pZeqg":{"text":"My parents stopped in here during their last visit and I joined them for a quick lunch. Th","useful":0,"cool":0},"EaJqCQD0iTUypSRLO3Drhw":{"text":"Food was great. This is my first time in New Orleans and I learned about this restaurant f","useful":0,"cool":0},"fEluuskfwQyLUGHeqyzjLg":{"text":"Amazing. I had Cajun jamabalaya with a side salad for $8.50 and my husband had the famous ","useful":1,"cool":0},"eL_bXi8BtN0NQIswroPgfw":{"text":"We ended up at Cafe Maspero's on Christmas Eve because it was one of the few things open w","useful":0,"cool":1},"vi0YUhiy_gZVL10IJ1hPBw":{"text":"Low grease option with great atmosphere and great drinks! Star was our waitress, and she w","useful":1,"cool":0},"Yrm6SXSE5VxKjwJMXM8Esw":{"text":"I'm really puzzled why we got recommendations from 3 different people raving about this pl","useful":0,"cool":0},"6DCimpamJm3gXk6mXUsvTQ":{"text":"Long lines in the French Quarter?  Tourist trap, and not worth the wait or money.  Mufalet","useful":0,"cool":0},"lW2mGsqVenzfLwFM8TptMg":{"text":"Ok, I can only comment on the $3 and $1 strawberry daiquiris, because is all we ever came ","useful":0,"cool":0},"i7Q6l7d8_SiyB8ewgLGZFQ":{"text":"The open air nature of the restaurant was nice, but it took nearly 25 minutes for a waiter","useful":0,"cool":0},"JDn4UyTm4aAxrl31KlGb0g":{"text":"Great location, but very poor food and service. Don't ever order the jambalaya here. It ta","useful":0,"cool":0},"N4F2hvW0PKZ29bzctnUPpg":{"text":"The menu is simple and very NOLA style which I enjoyed. Their prices were fair and the foo","useful":0,"cool":0},"is1ltSjJEKh9JhVYq5MMTw":{"text":"Don't waste your time to come here. Dirty bathrooms, poor service, and slow to get your fo","useful":0,"cool":0},"9EEw7ULQ4v1CEOmApIaphQ":{"text":"This was my first visit to this restaurant and I don't know how quickly I will return.  My","useful":2,"cool":0},"HZJPy4Rwj8jK-cMRGD40oQ":{"text":"Not fantastic food, not fantastic service, but the building is beautiful. I had the french","useful":0,"cool":0},"XbNChxZJebzjidb8VV0chA":{"text":"Great service, cheap food (and large portions for the price), nice atmosphere, cheap wine ","useful":0,"cool":0},"EJaIt8KJ2e16n1BurSZfig":{"text":"I'm writing this several years after my last visit- I will be returning in a few days thou","useful":0,"cool":0},"4v-PozP_-gxiJ6dB21etlw":{"text":"OMG the portions are huge. Don't come here if you don't like fried food. Almost everything","useful":0,"cool":0},"iOWT7SLhFDfQqcn5Nkj1jQ":{"text":"I went here for a quick light dinner. I ordered the fish and chip and it was delicious. Pe","useful":0,"cool":0},"6poCEjT352iD5dpoLtbpaQ":{"text":"We had lunch here and sat at a table by an open window so we could watch the people walk u","useful":0,"cool":0},"oLTQn-0RFBSdRqecBJVaSQ":{"text":"I second the \"classic tourist trap\" review. It took the server about 10 minutes to get to ","useful":0,"cool":0},"BJYafPg5CnCV3QJVzJ869A":{"text":"For me, Maspero's is a must visit each time I come to NO. Get there early for meal times a","useful":2,"cool":0},"QCXyg-xfNc9emw1wpSpN1w":{"text":"The hostess and several of the waitresses looked and acted like they were hungover. Really","useful":1,"cool":0},"I0ipwJQ6z5ac187G4SukjQ":{"text":"Ate here for dinner on a Saturday night. The food was very, very average. I got French Oni","useful":0,"cool":0},"59-In1vLJRNVOpJm9G2Zig":{"text":"Came in for lunch a while back and really wasn't impressed. I had the trio platter includi","useful":0,"cool":0},"vJxi0StR-XFJf1aGeDUFdA":{"text":"The French onion soup was exactly what I heard it was....:DELICIOUS!!! Prices weren't over","useful":0,"cool":0},"DUQShNcWIFcf_-8vEpdSeA":{"text":"Excellent atmosphere on Decatur Street. Very attentive wait-staff. Reasonable prices. Bett","useful":0,"cool":0},"E9ja18cZFEx8bTp-Ku3b8A":{"text":"Count me in as a \"love it!\" vote.  \n\nNext to a dancing flame within a lantern there is a w","useful":3,"cool":1},"9zUOICCh9FN9mwSVy8WTEQ":{"text":"Have to stop here everytime that I'm NOLA. Reasonable prices and pretty good food. Looking","useful":0,"cool":0},"K5Bs7wcMIGtloV5YFdLuFg":{"text":"Large portion for a great price. Got the club sandwich, and it exceeded my expectations. S","useful":0,"cool":0},"VKS5EyVZQzixig43FBke6Q":{"text":"Seated fast but inexperienced waitstaff overextended and rushed. Fish was excellent but ot","useful":0,"cool":0},"WTCrKqMOLWk5vMB-mcvAHg":{"text":"Went for breakfast only. Good service, but below average food.\nIt was highly recommended t","useful":0,"cool":0},"YU8P9rB5Zmsmf0h5d0bmew":{"text":"We went here the first night. I lived here a long time ago but I went here often. They did","useful":0,"cool":0},"myWLug6yM6-zFF30U5YBAA":{"text":"We visited this spot yesterday on our way to Jackson Square!  Great service, had a few dri","useful":1,"cool":0},"PS5uDR7P2li3eC5avBeM8g":{"text":"Third day in NOLA. Only meal my wife and I have hated. Jambalaya is canned. Rice isn't fre","useful":0,"cool":0},"Yi0LaoXeturaH8ZKOYx91A":{"text":"Came here on a recommendation of a friend who is from New Orleans. Staff was very friendly","useful":0,"cool":0},"g54h6SxJs7dE8Z424o3PNA":{"text":"While walking through French quarter stopped here to grab a bite to eat. Being a local I h","useful":2,"cool":0},"uWcEXvHifObsteIgcfdrdQ":{"text":"I really like this place. I got the calamari plate and my wife got the shrimp poboy. She s","useful":0,"cool":0},"MUgMNMQPiltX0XRsLSJDZw":{"text":"CAFE MASPERO NOW TAKES CREDIT CARDS\nWithin the parameters of what Cafe Maspero is, there i","useful":1,"cool":0},"tyoj_QOHai0tjMsib78CRg":{"text":"Upon NOLA arrival, Dec. 22, 2015, hubby wanted a platter of fried seafood. He found it at ","useful":0,"cool":0},"5U09D2y50M_BabXCktKLcQ":{"text":"Gross. I wish I would have believed the bad reviews. Don't eat here, really. Most disappoi","useful":0,"cool":0},"nCTVDTm07DboP1E8Nw_t2Q":{"text":"I went in last March and had the mufaletta and the alligator sausage sandwich. They were b","useful":0,"cool":0},"jqAi-VH5weZaBM6IFNmyvA":{"text":"The food was great, we received excellent customer service from Erica Y. I can tell that s","useful":0,"cool":0},"j8_U8vHMapryeCeWoroKyA":{"text":"A great place to enjoy the area, the fresh air and the community. Food is not White Table ","useful":1,"cool":0},"4D-y105uCOonpzuSk07X-A":{"text":"Awesome place! Took reservations for 40 and had us out in less than 1.5 hours!!! Wait staf","useful":0,"cool":0},"1j0PB4WZGj2XtXIEKqdIsw":{"text":"Have been coming here forever with my family! It is our favorite place to eat in the Frenc","useful":0,"cool":0},"I94bS5L85FrUvYDJpeMGRQ":{"text":"Dirty plastic dishes and cups.  Nonexistent service.  My chili was cold and when I sent it","useful":0,"cool":0},"Qi0Q_kAU-Ey4j2gjeWj3QQ":{"text":"I've always liked dropping in here when I'm in NOLA.  I have never had a bad experience wi","useful":1,"cool":0},"xu4d-UjYX20LPq3iRnhyiA":{"text":"Lovely breakfast. The place was recommended by a local who works in the French Quarter. Ta","useful":1,"cool":0},"0-AUC-iAXg0R2LUUsW2clQ":{"text":"I am a local who's favorite restaurant growing up was Cafe Mespero. Because of that I freq","useful":0,"cool":0},"z1V8eDFbI38UiwQvPM1Rgg":{"text":"One of the better spots in the city. Great staff, great atmosphere, reasonable prices and ","useful":0,"cool":0},"_Xo4lRlpgO-SPd-Quwm_KA":{"text":"I disagree with the reviews that call this a tourist trap. It just happens to be located i","useful":1,"cool":0},"2LwxVUCATUh9mQJ-4blE0Q":{"text":"I'm not a big fan of seafood - honestly, i'm not a fan at all. Which is why red beans and ","useful":0,"cool":0},"5X1s6NJIkp_C0WvWwI2Zqg":{"text":"I just got up from my table and left without ordering. Our inattentive waiter gave our tab","useful":0,"cool":0},"V6y-R5LvrNwjUMPZD9Qmrw":{"text":"I should've listened to all of you who have said to stay away, I really should.\n\nYes, the ","useful":1,"cool":0},"HGwGkLqZ6nQUsjKFrauZzg":{"text":"I give this place 5 all day cuz of that FRIED FISH SANDWICH! My absolute favorite fried fi","useful":0,"cool":0},"emPbNcxJXaP-2KkyJYPNYg":{"text":"Such a wonderful restaurant with exceptional staff! The food wasn't just spicy and bland, ","useful":0,"cool":0},"F7Z9lDSmHpd2Ag97ZPEpDQ":{"text":"Impressionnant !!\n\nThis was my frist time experience with French culinary, and I just love","useful":0,"cool":0},"t94Fo6HBJPA99Rkm-FBQXA":{"text":"The portions were small on most plates, but the seafood platter is great. The server was n","useful":0,"cool":0},"YzoFUvdbi7iSj3pRmh8ApA":{"text":"Would not recommend this establishment to eat at when there is so many other restaurants i","useful":0,"cool":0},"bM_TDtFm9qNa6cXMKlISKg":{"text":"Dropped in here after running around the french quarter-it was cool-sat at the bar and ord","useful":0,"cool":0},"v5sOymnhDXW-oc9Q8mHDrw":{"text":"had one meal here. Was recommended by friends. Would compare cafe prospero as a mom pop fa","useful":0,"cool":0},"2f1JRjYLJFqUwS8s-iT6nQ":{"text":"Not much to brag about. Not the new orleans flavor I thought I would find. I ordered the s","useful":1,"cool":1},"HK2jvlP2yX8t-eB3eqXaQg":{"text":"Found location just walking through the French quarter decided to stop after seeing a plat","useful":0,"cool":0},"IHyZ5JsiyxNac1mi4KR-Tg":{"text":"Casual place, good location, staff was friendly, and the sandwiches were good. Salad was f","useful":0,"cool":0},"aCI-lrThBYWEFEunnA4RlQ":{"text":"This place was recommended by a local when we asked for a good and reasonable place to eat","useful":1,"cool":0},"Wq7U0uGtGVaItXpApvPEYw":{"text":"Alright if we're talking in terms of food, it was pretty average, nothing special, but def","useful":0,"cool":0},"dptBPsc4aUKJ7jnTF2aHbA":{"text":"For the value, atmosphere and food, you really can't beat this French Quarter landmark","useful":1,"cool":0},"idZTI8NYuZ8gPwzrW6iGTw":{"text":"Look let me explain something to people, this place is not going to change your life. Its ","useful":3,"cool":0},"WLkobRSU-j8XZTz8vSHVKQ":{"text":"We just \"happened\" upon Cafe Maspero when walking around the French Quarter on March 13, 2","useful":0,"cool":1},"VoU4eBzqSmwJ2vfO9iU5Nw":{"text":"Good sandwich place for a bite to eat in the quarter. Stopped In and had a Muffuletta and ","useful":0,"cool":1},"6t7ZCHpvHfBqq-wuMBjolQ":{"text":"Ate here with my husband. Had good food, He had a Burger, I had the alligator sausage. And","useful":0,"cool":0},"1t0wnrWhXeUnj5JDHGr6HA":{"text":"This place is really good the only thing wrong with this place is that they do not have en","useful":1,"cool":0},"__yOzQs8RFjuTX8bJqiYSA":{"text":"Our go-to place for muffulettas.  A weekday visit was not as crowded as high tourist seaso","useful":0,"cool":0},"IHp3VjMScy6AuR-eQPWuJg":{"text":"This is my favorite place to eat when in New Orleans. I grew up on the Northshore and have","useful":0,"cool":0},"ymrOkx385vVbeUXd9QwW-A":{"text":"Not good at all.  Nothing on menu was Cajun except jambalaya which was cold.  Service was ","useful":0,"cool":0},"LrOK-MYeqBGQfwl0qkrocA":{"text":"Excellent food, great atmosphere,  and Shelly - our server, is one of the best we've ever ","useful":0,"cool":0},"0zzVtEzZvd3_fL7SLh6pZg":{"text":"I feel like the overall 3 star rating Cafe Maspero has is really selling it short...\nThe f","useful":0,"cool":0},"gInMZbdJkU2ziI4QNyrOcw":{"text":"The food is terrific ! $18 for the seafood plate. It comes with a salad,  fries, and toast","useful":1,"cool":0},"y21a8sMq_J-yHuJsLJPxyQ":{"text":"I visit New Orleans often and Cafe Maspero when I'm there. This time, we went soon after t","useful":0,"cool":0},"zuQJsYzMXg8yduCJfaJOuw":{"text":"The jambalaya was good but nothing fancy. This is definitely a good place to get a feel of","useful":0,"cool":0},"FUQO_z7X826vQLv4pptcLA":{"text":"Once again, I seem to be the odd man out. I understand Maspero is a local institution, but","useful":3,"cool":0},"NBadtt-zuQdl19QioCCZKA":{"text":"I lived in the quarter years ago and this was one of the places we would frequent. Sad to ","useful":0,"cool":0},"MJLJeFjCvCuQ6YDFts3qDQ":{"text":"I was not impressed with this place. I came here with 5 other friends late Saturday mornin","useful":0,"cool":0},"PsBfkBBOBPH2pWWOCsifcg":{"text":"The catfish sandwich was pretty tasty and I loved the bun it was on. The strawberry daiqui","useful":0,"cool":0},"rCo2jZvrW6Yt-ATo2rfi3Q":{"text":"Yikes. Our server is an angsty middle aged women who is obviously still hungover. It was a","useful":0,"cool":0},"2FqjbsP8SXaN-4A9HlWw5A":{"text":"Star our server was great!!!!!!! She started out as our server, than she became our friend","useful":0,"cool":0},"1Sk0xLFIU1Ke6iMCqJEjhw":{"text":"Inexpensive , well located and with a menu that features  traditional Cajun food .     Wha","useful":0,"cool":0},"d0BfLeBJ-yJmXTM2oj9C3A":{"text":"Really nice staff.  They cover for each other so you are never left /stuck waiting.\nFood w","useful":0,"cool":0},"5jCvqs5viF4g2Co2F4qC2g":{"text":"The muffuletta and red beans with rice are both good here (and very large portions).","useful":0,"cool":0},"FQetpaQ4xlWNzE7gLxz5zA":{"text":"Although there was a line outside the restaurant we didn't wait too long for a table. We d","useful":0,"cool":0},"WvwwDEDQGhjCE6qSGvOzuQ":{"text":"2.5 stars really, but rounded up cuz my jambalaya is decent and the price is low.\n\nI was l","useful":0,"cool":0},"mYlOAWnWfBXu4UDpQ3j-sw":{"text":"Moscow Mule & waitress were great! Wait on the kitchen was bad... after ordering (3 ppl at","useful":0,"cool":0},"xQ0skqjmT1o4o_QqbVjzeg":{"text":"Super friendly service. Fair price on drinks. Open air door, cool room, not too muggy","useful":0,"cool":0},"kE8pNUcm04I5fOob_jRlbw":{"text":"I always visit Cafe Maspero when I come to New Orleans. I arrived here yesterday and went ","useful":0,"cool":0},"seNAhBSCOIROYbOHwoSCAw":{"text":"Stopped here after attending Sunday morning mass at the Cathedral, breakfast was great. Ga","useful":0,"cool":0},"HJQgUm2O2ZDRAKXc5PpFiA":{"text":"A local suggested this place to us. It was a good little breakfast joint. Prices for break","useful":0,"cool":0},"SemCyLa3Z2SQsM9403-eOg":{"text":"Food was cold and waitress uninviting.  The gumbo  had too many spices didn't taste good.","useful":0,"cool":0},"po6R-vXkJT02gJPQYyPyMQ":{"text":"Shared the seafood platter, not the one designed for two, still had plenty of food.\n\nDelic","useful":1,"cool":0},"n79pL1pwNaYm3DSISMdSCw":{"text":"We came to this restaurant about 6 years ago with my parents during new year's weekend we ","useful":0,"cool":0},"Tw30EoHNX3rr34PY8AV9Fw":{"text":"The garden omelet was delicious along with cheese grits and griddle toast. Our server Kris","useful":0,"cool":0},"VzznJUv3t60_SMU_Xob-6Q":{"text":"No wonder there was a line out the door all day and night during Mardi Gras: this place is","useful":0,"cool":0},"0wBV1tY9rdEVHaWqRclyEw":{"text":"can't beat the local color, you can tell Maspero has been around for a long time, but the ","useful":0,"cool":0},"oYXXGx-m1nzlCWs1ZlklMg":{"text":"Very friendly staff, you can tell they genuinely love working here and attending to guests","useful":0,"cool":0},"QRLQt8ZZX3CnLZlVVJulXQ":{"text":"Stopped here for dinner and it was great! The best french onion soup I've had in a while, ","useful":0,"cool":0},"AD69uBFNV4FgKUHvBbHxnw":{"text":"Very inexpensive and great location! Food didn't blow my mind or anything, pretty basic ca","useful":0,"cool":0},"GDMvVkeG9xVDS8xggy5pCA":{"text":"Messy and good.  Can't beat the prices on the daquiri's ($1 small, $2 large)!  It was my \"","useful":1,"cool":1},"_HGPquFfAHHg5T70cq8-fQ":{"text":"Cafe Maspero is awesome! They have great food and pretty good prices. I really like that t","useful":0,"cool":0},"jKIJ3kF08mUyVbGKS_EMqQ":{"text":"Service is friendly here, the food is good and they have 1$ daiquiris.\nThe only negative t","useful":0,"cool":0},"QcRlFPUqIZb1YIO-DmYXZA":{"text":"We really enjoyed the food and atmosphere.  Star was our waitress and she was great.  We d","useful":0,"cool":0},"Iha0VTlnlarNu5BiXZ5Czw":{"text":"Absolutely terrible.  Jambalaya is recooked from days ago. Soups are disgusting. Service i","useful":0,"cool":0},"GvmlMxuWS33ZlATtRKRNOQ":{"text":"In New Orleans for the MICHIGAN bowl game--HAIL TO THE VICTORS \"M\"GO BLUE-- and wanted to ","useful":0,"cool":0},"hd7NzWkRDnUiQzCrzdhpKA":{"text":"The service that we received today was probably the worst we've had in new orleans. We sat","useful":1,"cool":0},"EeR72jhelKjYPM4GPFxJvQ":{"text":"I paid $5 for a tiny bowl of red beans and undercooked rice. Glad I didn't waste more mone","useful":0,"cool":0},"A0xzKjPMGe-531In2IwHCg":{"text":"Had breakfast here with my girlfriend because it's near our hotel and close to Jackson Squ","useful":0,"cool":0},"LyodcuATwRYllW8qrmkl4A":{"text":"Hell yeah first to review!\n\nI ended up at cafe maspero a couple times in my trip to NOLA a","useful":0,"cool":0},"DQBhLQBkfBUUZkrQBYDluQ":{"text":"I really liked their French fries, but I won't ever order a club sandwich again. There was","useful":0,"cool":0},"PHXtt_rYEtFqzWaI1O_tjA":{"text":"Thanks Melva, for the great service!  The Muffuletta was awesome as ever.  See you next vi","useful":0,"cool":1},"8mR1p8J3GJ9t5jgz_NqujQ":{"text":"Service was just okay. Food was not anything to write home about, but not bad. \nFood was m","useful":0,"cool":0},"0iex80804P2CZkm0A7F3NA":{"text":"recommended by a friend as a local favorite and wasn't that impressed. ordered the seafood","useful":1,"cool":0},"4o03-jCWoJMADzcwmDsBbw":{"text":"Don't bother eating here. Jambalaya was basically Spanish rice, menu claimed shrimp and an","useful":0,"cool":0},"rMoHmO_vbwgUF6TGTin69w":{"text":"This is a very good restaurant.  The atmosphere is very cool.  The food is a good value.  ","useful":0,"cool":0},"hggzg3r47Td69dg9lJcCUg":{"text":"This place is a joke and a scam. They had 10 open tables and made everyone wait outside in","useful":0,"cool":0},"cE7mVOw4FENnAI1hI32NJw":{"text":"I just absolutely love this place and make it a must stop every time I visit NOLA. We had ","useful":1,"cool":0},"eNAk-vdNoYjJdVvqWpTOGg":{"text":"Had lunch here last weekend and I really wasn't that impressed.  Then again I really wasn'","useful":1,"cool":1},"EO4Q-LGr7rbcM81Oe-M9sQ":{"text":"This place was so good! Service is amazing and food was good and not too spicy unlike some","useful":0,"cool":0},"crbE7IuZTCB8bdWOukeIqA":{"text":"The only thing that saved this place was a very honest and great server. We came hoping fo","useful":0,"cool":0},"f1o-tQE3UsZgWQRZPeUOKA":{"text":"I highly recommend the gumbo. The serving is neither too big nor too expensive. Like aroun","useful":1,"cool":0},"sgfaiDD1bLwNqO0At6QRDw":{"text":"Just got back from a weeks stay in New Orleans.  Cafe Maspero was recommended by a local r","useful":0,"cool":0},"meJF-69BlCe9xgB2wgyKEA":{"text":"Don't come to New Orleans without eating at Cafe Masperos","useful":0,"cool":0},"6My8gQ1J3EB_QTcW2aXPmg":{"text":"Well, this is a mistake. Our plan was to go to Cafe Amelie but it doesn't open on Mondays.","useful":0,"cool":0},"Bv_4w1vfXmQlj7G5GYXb9g":{"text":"Was recommended this place... it was better then average.   The cajun jambalaya was fantas","useful":0,"cool":0},"OEXxFBlkZ7uhHP4WBNJgtw":{"text":"Okay so I was told by a local that her father always comes here...I thought okay father, l","useful":2,"cool":1},"Zw1g9HzmBVjnBU4P-EQLYQ":{"text":"Had the white beans and catfish, soo good! Can't beat the $3 extra large strawberry daiqui","useful":0,"cool":0},"gZYCmMb1zZeW0_lmK20OcQ":{"text":"There's not much better on a rainy French Quarter morning than some good Louisiana comfort","useful":1,"cool":2},"DX1_hml-oHQu-gnFv3NY2Q":{"text":"It was a rainy night when we sat down at the roomy communal tables at Cafe Maspero. The at","useful":0,"cool":0},"tTCUsuHzjm0RdQtZSmHwzQ":{"text":"The quality has gone down here.  I had the jambalaya appetizer.  Some rice was mushy and s","useful":0,"cool":0},"ZcKaul6KiauBkfa1o0Ee_A":{"text":"We were pretty ticked after eating here. The bread was very stale and was like eating a dr","useful":0,"cool":0},"BDEXYb_F6ZskIe_y7jL1uA":{"text":"First of all we are locals and have eaten here many many times in the past and it's a sham","useful":0,"cool":0},"zKkUzBsvSF-utQZvf3YJgw":{"text":"I am a big fan of Cafe Maspero. I can not comment on anything but the muffellettas. I know","useful":3,"cool":1},"0cGRkt9xrDfaqIlfUWkYsw":{"text":"I am never disappointed when we visit Maspero's.  We visit NOLA a lot during the year and ","useful":0,"cool":0},"eL_uUT60NNJnBME3HHimKA":{"text":"Can't quite give them a five because the food wasn't WOW, but the service is wonderful, th","useful":0,"cool":0},"iwZinnz9GHMjxH9-SrNZYg":{"text":"This is my fourth time going to Cafe Maspero. Every visit I am greeted with friendly staff","useful":0,"cool":1},"zcEmWnAnPkn7sTzgdW6w4g":{"text":"It gets an extra star for being reasonably priced and for large portions.  However, there ","useful":0,"cool":0},"vW2ilYv5feq9R7omTDJN3A":{"text":"Although we walked by the restaurants about 1/2 a mile, once we arrived we were greeting w","useful":0,"cool":0},"HTawyx93xkGXplr_nnQbHw":{"text":"What a lovely detour on the way to Cafe du Monde! \n\nRight on Decatur St., this place has t","useful":1,"cool":1},"mqVE9_W78mFMK3_fr6NmTA":{"text":"Even though it was a very busy night after the Krewe Du Vieux parade, the service was so e","useful":2,"cool":2},"qWjtSlRZeTHLcXHg2lLS4Q":{"text":"Wow, at 27 and no kids I thought I was done paying for cafeteria lunch (or in this case di","useful":0,"cool":0},"3WWo-69sAXNuj0g178njLw":{"text":"Cafe Maspero has got gritty New Orleans charm - I give you that --but surely its a vibe th","useful":2,"cool":1},"o-w4HY6LHsvHdfd_hLxN8Q":{"text":"I went with my youth group while we were working with Project Homecoming. It was a welcome","useful":1,"cool":0},"7V01zLKS1uq3QmvWOM9_dw":{"text":"On New Years Day we got in with a short wait. Service was slow but it was very busy. Frenc","useful":0,"cool":0},"j7zpftTS67jiT7u9r6kJCg":{"text":"It's very uneven.  I agree with both the great reviews and the horrible reviews on here.  ","useful":0,"cool":0},"nD1tcFZSJ6SCunESaDgwrw":{"text":"I dined here last night after some research on other \"good cheap eats\" sites and it got go","useful":0,"cool":0},"w-woB0vgh5ITTTERSqBQtA":{"text":"For the most part, what's not to love? The prices are fantastic, especially if you choose ","useful":0,"cool":0},"nXkhYT1JkQzCImOOaB66gA":{"text":"I would only come back here if for some god awful reason I was stranded in the Quarter wit","useful":3,"cool":0},"OcOaiuLrMhqbGJw97-NT7w":{"text":"Not good. Jambalaya was dry and missing the meats. Red beans need more spices.  Try Olivie","useful":0,"cool":0},"91m_EiucKSuixZMOg18-LQ":{"text":"Excellent food, services and prices. Definitely a must if looking for a romantic place in ","useful":0,"cool":0},"ANxW4V17rlX7yzImjvYBXw":{"text":"Excellent staff ,great food,good prices,server Trinity S and hostess were excellent,they w","useful":0,"cool":0},"MJ-L2QvClxpwLzdpVpUHKQ":{"text":"Excellent food.  Now I understand the lines it was well worth it.  The seafood is an assor","useful":2,"cool":2},"mIOmDNypUcIjO1HsTmxuIg":{"text":"If your looking for a place with Great Food for and a low price this is the place for you,","useful":0,"cool":0},"0uNIs5jcav32Q3F96waqHw":{"text":"Was sent here for good po boys.  The sandwiches do not come dressed.  Everything is on the","useful":0,"cool":0},"oboidq2J49kQOx1fiUwvtw":{"text":"We stayed at the French Market Inn, which is just a few doors down from Café Maspero. We w","useful":3,"cool":0},"eenRXqROwqykhdEfQt4bBw":{"text":"Went here on Christmas Eve, as one of the few restaurants open. Didn't do prior research b","useful":1,"cool":0},"fs253N00iOL5TRHYz6TZxA":{"text":"Cheap, large quantity food.  I had the Mufulleta, which I enjoyed, but was a tad on the sa","useful":0,"cool":0},"P0GfkTzX7uazuGq-46Uv2g":{"text":"Don't do it unless you have all day to get served! Food may be ok, but the kitchen can't k","useful":0,"cool":0},"CZXvSZPhOjh26CwAwYnyIA":{"text":"This was not the muffeletta I was looking for at all. Service was okay though, we got our ","useful":0,"cool":0},"CAq2LdDBDIMT3Gu40xq1WQ":{"text":"Booooooooooooooo.\n\nFull of tourists.  Crappy food.  Expensive for what you get.\n\nJust not ","useful":2,"cool":0},"yYWKNYNecsnU0oxu7biF6g":{"text":"This place is the hit.  Growing up in the French Quarter, my family and I used to eat here","useful":0,"cool":0},"_KXGzqt1AB1VVWdGLAi5vQ":{"text":"If you like huge portions this is the place for you. Me and my wife stop out here every ti","useful":0,"cool":0},"OMyucYvAVDypOJu-WQ7nUg":{"text":"came here for dinner mid-week.\nthe onion soup was excellent, everything else we had (jamba","useful":0,"cool":0},"n5DBNSDsxb2ns-GBNwbLzg":{"text":"The food was delicious and that is the only reason for a 2 Star review instead of a 1. The","useful":0,"cool":0},"LzkWmjPdIxFWp-LW4S8jqw":{"text":"I love this place and have for over 20 years. When I have friends that come to town and fo","useful":0,"cool":0},"QmkXfrUiFBhz7l9Lt5nm7A":{"text":"While wandering around the French Quarter on Friday, the bartender at the Corner Oyster Ba","useful":1,"cool":0},"7CX-BWK1cju9y_NVg0QY7g":{"text":"I hate to give this bad review, as we really used to love this place!  Being from the area","useful":0,"cool":0},"FA-5nXbzcxbPpCKZvKUeJw":{"text":"My friend and I were stopping by New Orleans for the day and wanted to try Jambalaya befor","useful":0,"cool":0},"liZYUaGEIkGiavltdKDJwg":{"text":"Good little place to get lunch and a drink. Nothing fancy but good none-the-less. I'm not ","useful":0,"cool":0},"jMUIUoEe_SOANKm_ZEsPSA":{"text":"Nestled in a prime spot off of Jackson Square, you might be a little thrown off by the gru","useful":0,"cool":0},"vgJHAMmvbNMrzZQTFm8d5g":{"text":"Love the drinks staff was great. Food was alright. Great for sandwiches and non dieters. B","useful":0,"cool":0},"lonb229Si4tuKe8TQAhSZQ":{"text":"This is place is cheap, considering it's in the French Quarter. Be aware that it is consta","useful":0,"cool":0},"v6yRRvfNUIz4ke1KplY56A":{"text":"I'm actually surprised by all of the bad reviews about this place here!\n\nMy husband and I ","useful":0,"cool":0},"RdujP-zugGyn-H1n3QrxbQ":{"text":"Felt like this was just ok.  Ordered the hash it was good, nothing to write home about.  N","useful":0,"cool":0},"Pq824DKpbkTngFSKxvKOkg":{"text":"We tried this place after looking at the menus of several other restaurants nearby, and th","useful":0,"cool":1},"7GZ4zhz0AA72ePOmqyraUw":{"text":"So this was the first stop we made post landing. Let me set the stage....up at 3AM for a 6","useful":0,"cool":0},"nZLeE-N081twSW-ERK9MPw":{"text":"For location and affordability. The food was average, good portions and OK tasting. But if","useful":0,"cool":0},"6hDDMsyPb3dHzWz1Tsn3gA":{"text":"For cheap fried seafood, this is a good place to come. For a strawberry daquiri that you m","useful":0,"cool":0},"fftC5LpyJ6sPZKiTDbHGDA":{"text":"I loved the Muffuletta.  It was amazing.  The meat the cheese, the bun.  All 100% perfecti","useful":0,"cool":1},"tXPERTrGVUF95y5cXrQuyQ":{"text":"Awesome club sandwich. Decent beans and rice. Yummy jumbalaya. Hot Aussie waitress for the","useful":0,"cool":0},"3mgfy628fNXrLAGzgO4I2w":{"text":"Ok...so my server was Malinda and she both nice and helpful to a first timer in New Orlean","useful":1,"cool":0},"lgvgWSEoNlEUaQ9rIE2dJA":{"text":"Terrible, avoid at all cost! The hash browns were burnt, sausage was microwaveable, toast ","useful":0,"cool":0},"zfG3lZ0DYUQV7-k-YTGr5Q":{"text":"My mom likes coming here for their muffulettas and she really likes them.  I've had their ","useful":0,"cool":0},"VkVw9EuTSN-qPcvgdMp3zA":{"text":"30 min long wait to get in in Christmas day. We assumed they were just busy but once we we","useful":0,"cool":0},"4JdYTvlu1ziU_odWBvb6dQ":{"text":"Cafe Maspero is right near the French Market in the French Quarter of New Orleans. We went","useful":0,"cool":0},"5B9rxZOPThzM67wxhIPr8A":{"text":"I despise mediocrity, especially when it comes to food. And Cafe Maspero is mediocre. Desp","useful":0,"cool":0},"nErwFJyracXGVME0sbQl4g":{"text":"Figured since I'm submitting reviews for New Orleans I had to add Cafe Maspero..... in a w","useful":2,"cool":2},"REoHdnHHKH-DaXZSPY9gdw":{"text":"Fried food in general was excellent, fresh seafood and crispy light batter was as good as ","useful":0,"cool":0},"0aXRwBqvY0HixTFpVqso9Q":{"text":"Jambalaya is mostly rice, with some sausage, forget about vegetables. And rice tastes like","useful":1,"cool":0},"LO0ceaq18_dr5P0MCMq8qQ":{"text":"I was seated. The table was hella sticky. I had to wipe it down myself. My friend and I to","useful":0,"cool":0},"VeLjZGDdGI7j3F-BaHINxQ":{"text":"Always great food and service.  Make sure to get there early.  The line gets long quick!\n\n","useful":1,"cool":0},"0khQcNyHt9thU_hwP8jjig":{"text":"The absolute BEST Gumbo in Louisiana! BEST Muffaletta in Louisiana! Would come back every ","useful":0,"cool":0},"ZHGpMKATkWpO6MJuztaKzw":{"text":"This was the first stop to grab a bite to eat on my most recent trip to NOLA. We went base","useful":0,"cool":0},"deD5KiT8UW24SxnulguUtw":{"text":"I was very pleased with my meal. We were seated right away. The red beans & rice was so sa","useful":1,"cool":2},"KMi-nwKhHnsMHL9lHFTm7A":{"text":"For years I have come to this restaurant. I hadn't been in a long time. Like always I was ","useful":1,"cool":0},"E7XhyMmEUAg2uO4-Fn-Icw":{"text":"Everything was delicious: red beans and rice, gumbo, kids meals. Great place to bring the ","useful":0,"cool":0},"HIqy3fJjMBRwXJCa3nOyag":{"text":"Best French Onion soup I've had in my entire life! Great ambiance and friendly staff!","useful":1,"cool":1},"BE7gkXgS63Dc9-xUDygrMg":{"text":"Quick and easy. The service was polite and the food was good, especially after walking awa","useful":0,"cool":0},"TzJVEat_bx27zoiCryuhMQ":{"text":"Reading the reviews it's apparent this is either a love it or hate it place.  Count me on ","useful":2,"cool":0},"w24b6zMgrdb0ZQ3IEVcJzg":{"text":"10/08/2016:  My wife and I came back. Just want to say their French onion soup is awesome.","useful":1,"cool":0},"wdGvDvq61OG3k4tEveLAfw":{"text":"Amazing Mufulettas. I'm so sad they got rid of their $1 daiquiris. I like how they have ma","useful":0,"cool":0},"4lW5RNwjyYRaUyXTghXweQ":{"text":"I have been eating in this restaurant for years,I come here for the fried shrimp and oyste","useful":1,"cool":0},"Y3QbK1fqTz4q8kbmroMV7Q":{"text":"I go here because my in laws like to go here.\n\nThe food is subpar at best and the service ","useful":1,"cool":1},"57GY22_fb5d5qAhjhvurAg":{"text":"My husband and I stumbled across this restaurant while strolling through the streets aroun","useful":0,"cool":0},"zO0gICtfI58tsq_KkRvQEg":{"text":"I had gumbo..it was flavored well. My husband had jumbalya, ,unfortunately it was dry and ","useful":0,"cool":0},"ZqH-BMNxMrCiFstcThMPTA":{"text":"My 10-yr old son and I visited this place for lunch as he wanted to eat calamari. I also o","useful":0,"cool":0},"Q375bY4Z0X3uYXOkYHAqtw":{"text":"This 5 star rating is not for the food, location or ambience. These 5 stars are ONLY for D","useful":0,"cool":0},"dpggN5FYpaCndfR8RlZkFw":{"text":"Stopped by here for breakfast before we left town and glad we did.  It was a Friday mornin","useful":0,"cool":0},"UcSQvAhsvwh4bwKxBYJGYw":{"text":"Used to be a go to spot back in high school and still a nice option for a cheap, good  mea","useful":1,"cool":1},"qsCbdnIjYrb7UMRFLM1DoQ":{"text":"I came to cafe Maspero upon a couple of recommendations, and I'm not convinced they can't ","useful":0,"cool":0},"LnxqcMEwfcNKiIb2cu9aLw":{"text":"Want a taste of that real southern, Cajun cooking? Not willing or able to spend a lot of m","useful":3,"cool":1},"Vg9DBvqd-2Xwv6C59mG7hw":{"text":"I really like this place.  I ate here twice while I was in the French Quarter of New Orlea","useful":0,"cool":0},"n2U2JK3mcVfKJu8Z-sZHng":{"text":"After seeing lines throughout the morning and early afternoon, I snuck in for a late lunch","useful":0,"cool":0},"gpp9XQVglB97s6m3Ii6UyA":{"text":"Seriously we had the dumbest waitress in the world. She was also rude.... After 10 tables ","useful":1,"cool":0},"ZUwePu5KivsnMncaO6COlw":{"text":"FOOD POISONING. Zero stars. I don't eat seafood, so I ordered the chicken sandwich. Not on","useful":0,"cool":0},"Mv4f9WemFga9bgShbbctzg":{"text":"This was a good bar and grill. Food was good, but nothing special. I had their muffuletta ","useful":1,"cool":0},"YtdFVrlf0hQ7Ikc92_c_Sg":{"text":"This place is a very overpriced tourist trap. The food is far from authentic, just your st","useful":0,"cool":0},"9iFUdEQ-qn8JM9HThXB20A":{"text":"This place is great for one stop shopping of all the traditional foods you'd want to have ","useful":0,"cool":0},"svBdk3GH2bIpEjkkedqibw":{"text":"Super cheap, decent food and drinks.  Not the best of New Orleans, but a reasonable spot t","useful":1,"cool":0},"iHYy8-gApW1HVU5SFs8B3w":{"text":"I highly recommended the \"old timer\"...... the drink, not the waitress. I would also like ","useful":0,"cool":0},"qlGAh9A_DiMVPn34tLgL8w":{"text":"I don't know why there are so many negative reviews of this place. No, Cafe Maspero isn't ","useful":5,"cool":0},"9b3dhsJx7r8scd-8RTd2QQ":{"text":"This place is awesome! Cheap and delicious! I love their oyster po'boys.  I hit them up ev","useful":0,"cool":0},"wvngfwdPohFOTs91cewK5A":{"text":"You wait with high expectations and leave disappointed. \nService: very bad\nFood: there are","useful":0,"cool":0},"sqEMYZRaRtFWynir3-aggg":{"text":"This is very much a tourist hang-out and not really a palace of fine cuisine, but there's ","useful":1,"cool":0},"7636Mg6edA4CKMjXkNB2Kw":{"text":"The white bean and southern fried fish was delicious! Also, Melinda is very personable and","useful":0,"cool":0},"VXTObUuP7W0LmqG2-L7h2A":{"text":"A great lunch spot to eat.  Casual and not expensive.  I had the sirloin burger and fantas","useful":0,"cool":0},"kZoBp1c8NemhFF7Ci9GG8A":{"text":"Nice resturant near the waterfront.  Super large portions.  Service was good and food was ","useful":0,"cool":0},"tKzNS-LtTUEIi0SF53nTIg":{"text":"This place looked nice and had a line at one point, so my friend and I thought we'd try it","useful":0,"cool":0},"5Hp_G7PTAmgupp-2feT_rw":{"text":"After a long day wandering the French Market, we found this nice local spot. The service w","useful":0,"cool":0},"uKcjVFxjEDsSrKciO3kAcQ":{"text":"We were told to eat at this restaurant by a local.  It was AMAZING.  The Jambalaya was the","useful":1,"cool":0},"LhSBOwFD-1aTAqB8aXu2rw":{"text":"Grabbed food to-go for our long drive back to Texas, so this is just about the food, not t","useful":0,"cool":0},"2zAVweUm9wu1I_U7UTfUtg":{"text":"Despite the historic room and friendly service, the food is really bad.  The crab in the s","useful":0,"cool":1},"lnyZcm3bIxPBZd-iv8auzw":{"text":"I had the fried oyster po'boy and the red beans and rice here on 3/12/2011.  It was okay, ","useful":0,"cool":0},"PexJeYXyAw58zOUaSho65g":{"text":"Always like the food here, that is never the problem.  The issue is the service.  Very slo","useful":0,"cool":0},"dbxUjFfA7c7WJ1xzI4FZ-Q":{"text":"After enjoying meals at Maspero's through the years, this time it was disappointing to see","useful":0,"cool":0},"VI7KwaAF0kWTOaiaLtmZdw":{"text":"Stopped by this weekend to eat at my favorite Quarter restaurant. For the first time was a","useful":2,"cool":0},"OzfqQH_9kmcDvmtvjjr9kQ":{"text":"Our group went here because it was the cheapest place to eat dinner in the French Quarter ","useful":0,"cool":0},"J8g_WScU-fApVgWi7t9gDQ":{"text":"I love this place. It's a local favorite and always has a line out the door. By far the be","useful":0,"cool":0},"QL7m7Uet0Xsb4YNS_DSH8w":{"text":"Surprise highlight of the visit\nWe ate at the more touristy places (Mothers, etc.) but thi","useful":1,"cool":0},"nMsuFoWfWZMoHVq-30ufmw":{"text":"We came here to grab some drinks during French Quarter fest. We decided to just stay and g","useful":1,"cool":1},"Chu5hXCi1vt2zgli6lNLYA":{"text":"Was suggested by a fan that I try the calamari specifically. It was good, they put cheese ","useful":0,"cool":0},"_4yRF4pm-GNo4SaNy4cfbg":{"text":"This place has hands down the best muffaletta in New Orleans! It is huge and delicious! I ","useful":1,"cool":2},"dL2WGKuR4aakX6GFkiyALQ":{"text":"Possibly the worst roast beef I ever didn't eat. More salt than meat  gravy was from a can","useful":0,"cool":0},"gYwjnaFXp62dE7mW9rbG0A":{"text":"We came to the restaurant on Christmas Day and were seated without a problem. However, it ","useful":0,"cool":0},"wc5xLN_fgInWrb5p6iYt4w":{"text":"My girlfriend and I had decided to make Jackson Square our last stop before heading home f","useful":0,"cool":0},"EizPxHfI2EyHWYFWRb_7sg":{"text":"My sister and I found Maspero while wandering the French Quarter looking for some lunch. W","useful":0,"cool":0},"CGlutMtbcm3a_3wMSbLbIA":{"text":"The food was delicious, and the service was fantastic. There was a hostess, I believe her ","useful":0,"cool":0},"pxOkSWcZyun3l2cVWS8uEg":{"text":"We like to stop in here for a muffaletta at the end of a long NOLA day, and it never disap","useful":1,"cool":0},"oUSGB3ADx_io5ZbkYee2PA":{"text":"WORST place in the French Quarter and BE ADVISED - They DON'T take credit cards. Instead t","useful":1,"cool":0},"zMN30RfgIQWzWeTMP8eJCw":{"text":"Only had the French onion soup and it was tasty.   Bar staff friendly.  Can't beat $1 daiq","useful":0,"cool":0},"65k_IJh_W8w27utsmx-djg":{"text":"I shared the muffaletta with my husband.  It was delicious.  I am not a big fan of olives ","useful":0,"cool":0},"6OXjUMBkiNv3xblCsQgiAw":{"text":"Wonderful experience while visiting NOLA!!\n\nI came in because of the Yelp reviews and I wa","useful":1,"cool":1},"sA2crcy_RB0eikhvpiDLug":{"text":"I love Cafe Maspero. Last time we ate there we were there for Halloween. It is right on De","useful":0,"cool":0},"hZiicCx3gbT6xxBaOM9_9w":{"text":"Being a big fan of the muffaletta sandwich, we asked some locals where to go in the Quarte","useful":2,"cool":0},"r4aOU5h9jOqDBEJZs0jg4w":{"text":"If you want to eat where the locals eat, try here!.this was the first place recommended by","useful":1,"cool":1},"PbAZu_B3TKJjg0MYNuEDmQ":{"text":"There was nothing bad about my experience here. But nothing great. Had a shrimp sandwich o","useful":0,"cool":0},"r2DBVm0yhavrMWgBHBT4ng":{"text":"I found it while wandering and stopped in. If you're looking for a good meal or even a sna","useful":0,"cool":0},"KnO8cdBMPDDny8SPl1RwsA":{"text":"Cafe Maspero is casual French Quarter restaurant and bar featuring classic New Orleans cui","useful":1,"cool":1},"4sLBS5TK_D_vXrX33ex8sg":{"text":"This restaurant is perfect if you're looking for a seafood basket or a light salad. It's a","useful":0,"cool":1},"zQ0cRCEogNL6NmfIvzNxHw":{"text":"We stopped in here for breakfast on a busy Monday morning.  Our waitress Melva was very fr","useful":2,"cool":1},"yw5vhKeAKErex3dKti2IaA":{"text":"Got one of their Muffeletas and it was good but not amazing. I enjoyed having it but the b","useful":0,"cool":0},"nYV0Sii2Z0Kp3p_3vZXAJw":{"text":"While I expect many of my local friends to disagree, I thought Cafe Maspero was A-OK.\n\nSur","useful":6,"cool":4},"gSBBkeCaQahJRO79z8aGeA":{"text":"Our waiter was really nice and helpful. I had a burger which was really flavorful. My boyf","useful":0,"cool":0},"gDWFPjHsNlafhO3f4Y99cg":{"text":"Wonderful food and fast service! The muffuletta I had was really good. Two of us ate for l","useful":0,"cool":0},"cgiJ94siCA9LHGgwBuRITA":{"text":"Had a line of about 30 people outside when we walked up. Line moved quickly, hostess was v","useful":0,"cool":0},"GWn83-iQ_Ww_pG49A-27-g":{"text":"We stopped at Cafe Maspero shortly after checking into our hotel.  We were looking for a q","useful":0,"cool":0},"zf9vLJX4cYvkA1ePT_zvpQ":{"text":"Star is a just that! She was great and helpful! Also yummy Muffuletta!! Great quick and yu","useful":0,"cool":0},"mYksoUXgu9hRAtjBp8jszA":{"text":"Wir waren am Abreisetag hier essen.\nDie Bedienungen waren nicht sehr freundlich. Das Essen","useful":0,"cool":0},"6l5hE-J3v9NcC65CB8zfUg":{"text":"I've eaten here ever since I was a kid. I'm a vegetarian so the Menu has always been focus","useful":0,"cool":0},"0e2JDP_jR5d1TNd62fRInw":{"text":"A return visit here and the food was as good as we recall.  I always have the Muffaletta a","useful":0,"cool":0},"bElptAhBdM-Eje0GORjWVQ":{"text":"Yeah, this place is pretty average. The food is very average, but you can get a bottle of ","useful":1,"cool":0},"dbisrD6lXLlRUm0hasy3vA":{"text":"I'll admit, I don't really know how to rate these cajun/creole places. I had an expectatio","useful":1,"cool":0},"SDKg3Te5kKWWwWDZoGTAGw":{"text":"I was told this was a must-visit place and have been here a few times now, upon visiting t","useful":0,"cool":0},"EDJv-al3o1L_vJMiDopYBQ":{"text":"Bland, bland, bland. The portions are big, but that just means there is more blah food for","useful":1,"cool":0},"H8fGgEe7u6uWenJF9gYDDQ":{"text":"Roast beef with Swiss, and a side of French fries, with a ice cold Bud Light draught. Star","useful":1,"cool":0},"5Y0Q91fZtLba-ZmXUeesAg":{"text":"My sister, her roommate and I visited July '14. This place is horrible. I don't know why p","useful":0,"cool":0},"1u0rHkbc1-uE7IiOoEMdlg":{"text":"Yes, the food sucks. The service? Took about ten minutes just to get the menus. So why am ","useful":0,"cool":0},"-rRsU0-BmSMsxeFWyXbWrQ":{"text":"Awesome place to go for Beeakfast, Lunch, or Dinner.   Amazing food and great food.  Melva","useful":2,"cool":1},"a5OTQZR_ChWQyVWSkvrpxA":{"text":"Got the French onion soup, not salty, onions were caramelized, bread and cheese perfect. 5","useful":0,"cool":0},"1ObUQyXUyRcWVuAXceMoFw":{"text":"Yuck stay AWAY from this place its horrible !!!! Worst food worst service NEVR come here .","useful":0,"cool":0},"Y5sBHL_8bCSbxNq6L9P6jg":{"text":"We stopped here after being advised by two different locals that noticed our wondering eye","useful":0,"cool":0},"al_ZryRV-ZmxmhXV700mhA":{"text":"Horrible place full\nOf horrible people that have zero compassion for other people. After a","useful":0,"cool":0},"1226iNc5BmwoG-RtjLjBIg":{"text":"We went here 3 times during our visit and tried their shrimp po boy, gumbo, red beans and ","useful":0,"cool":0},"TsdSCHidw_gTNtC3gP3BcQ":{"text":"I  came to this place to eat muffalatas.   We sat at the table and the server Tracey did n","useful":0,"cool":0},"31fiIyFK36OJmvtnTv4RCg":{"text":"Upon entering, the building had maybe 2 other seats open. The server was lack-luster and c","useful":0,"cool":0},"f-0DdU_Ik7lOi8vcM9QKjQ":{"text":"I was very disappointed. Friends from nearby Jefferson Parish raved over the muffaletta an","useful":1,"cool":0},"AUJgTm_6ZlLbd0jvKuHJ2Q":{"text":"Good old fashioned fried seafood and muffulettas . Good place to visit for a quick meal.","useful":0,"cool":0},"ZLrvDP74N22S3QC3-k2Dbg":{"text":"I went to Cafe Maspero on my 1st night in the French Quarter,  I had some kind of seafood ","useful":0,"cool":0},"9B7-pk_gEeDcm2esMREEoA":{"text":"Absolutely awful. So disappointed we wasted our one meal in New Orleans here. We ordered a","useful":0,"cool":0},"kVeSuui_4SS2frJ58kdldw":{"text":"I've been back two more times since my initial review and I'm pleased to say that they hav","useful":0,"cool":0},"bZrIhtTyIF9xYv2KBbdgyg":{"text":"Had the Muffuletta. Never did find any pastrami on it. Fries were cold and tasteless. I wo","useful":0,"cool":0},"PNZte_UXoDS0OGRzZ8DVOw":{"text":"Cafe Maspero is a great place for:\n-NOLA cuisine\n-People watching\n-Fried food\n-Friendly se","useful":1,"cool":1},"g-8VADnPAkqb64MNkXbuBQ":{"text":"Had a great dinner here, the the sampler trio, which isn't on the menu, but available if y","useful":0,"cool":1},"jVXSw7SHj-jkDE5SDajuCA":{"text":"Great simple food for a great price.  Don't plan on special ordering anything (bread etc.)","useful":0,"cool":0},"gJwETn5BKxO6Wa7_ZZZMOw":{"text":"I came to Cafe Maspero during the Mardis Gras rush this year. I had the catfish poboy and ","useful":0,"cool":0},"yRnYK2MYmTPa_sRw-C2_3A":{"text":"Great place, quick and inexpensive -- at least comparative to New Orleans prices.   Arrive","useful":0,"cool":1},"FS4lfrXStiE8h8VUWFsKfw":{"text":"I'm convinced that the only reason this place is still in business is because it has a goo","useful":1,"cool":0},"Z68RQ6_DKhoaLGnDvuRpcw":{"text":"Cafe du monde was too packed so we just  wandered in for breakfast. Should have kept wande","useful":0,"cool":0},"kajHIO2KT4HKwPSz3jpOrA":{"text":"Went here for breakfast and we waited 40 minutes after we ordered our food. Stopped the se","useful":0,"cool":0},"zslwcUb5A3iGZTO6gQ3GRA":{"text":"Our server Shelly was AMAZING, the BEST service we have had in NOLA. Her suggestions were ","useful":0,"cool":0},"Hm-RtK9S9vVVaAEL7gjsMA":{"text":"Bartenders are awesome! Drinks can't be beat! Sat at the bar and watched football, great a","useful":0,"cool":0},"3VCurQj7paIsi6YtVW1aqg":{"text":"Sandwiches have lots if meat, but is nothing special. We found it to be very mediocre. Rev","useful":0,"cool":0},"SgNIwI1N1_s-0T9KGeXVHg":{"text":"Waited an hour and fifteen minutes for our food (not busy) and when it finally arrived it ","useful":0,"cool":0},"FhbJpOD8ZOyxXJsxtz4fOg":{"text":"Great food!  Fabulous atmosphere. Melba is the MOST AWESOME server!!!!  Dog friendly. We d","useful":1,"cool":1},"Aqfuw-xRgBFA-5wWk-Emmw":{"text":"My girlfriends and I visited during Essence festival.  After a long day we wanted somethin","useful":0,"cool":0},"CNqvtj-aw4lof4clk7s4rw":{"text":"Food was overcooked and bland. Service was fine and prices were good.","useful":0,"cool":0},"dbNYsRMSK-kLaIVngupYGg":{"text":"Great service and delicious food! Affordable prices and comfortable atmosphere. Would defi","useful":0,"cool":0},"ZSB8i0sbYMXq08XqLmhbgQ":{"text":"The second star is because I am nice.  Over hyped tourist trap that should be ashamed to b","useful":2,"cool":1},"qufOnJsO3T-0DrXfCbXrUg":{"text":"I went with my family for a late lunch and the place was packed.  We all tried different t","useful":0,"cool":0},"mn4B4rmr6dAw2OCxzOAkYg":{"text":"Hooray for cheap fried hang-over food! Want a whole lotta yummy NOLA food for just al litt","useful":0,"cool":0},"LOwwR6BuE7n4OTnKRKKzMg":{"text":"Called two weeks ago and asked if they could accomodate 30 people and split checks - guy s","useful":1,"cool":0},"ZDjVKjS9jvuh-qDGFT4QtQ":{"text":"Incredible prices for New Orleans, get off bourbon street and escape the ridiculousness th","useful":0,"cool":0},"6tUbFunNiN0gKr1o8Z13MQ":{"text":"The food here is below average. Bread is hard, not grilled. Oyster sandwich tastes not fre","useful":0,"cool":0},"8jGFHOFLVnHXd1EXHFDBXw":{"text":"Don't waste your time. I hate to give a bad review when they didn't really do anything wro","useful":1,"cool":0},"Fi1iA8duPpmJoSpFZ9Bh3g":{"text":"Ugh. I wanted to like this place... I really did. My husband did NOT want to go, and I tal","useful":2,"cool":0},"EkZe3Q88ySXPJfgNMJ97VA":{"text":"My family and I visited New Orleans mid-December of 2011.  We literally walked for an hour","useful":0,"cool":0},"zPytBYf1hCsFNsmDzEfrDg":{"text":"What a super disappointing place. The customer service was horrible. The woman in the fron","useful":0,"cool":0},"KjIc8nizKebkYp6mXK7KGA":{"text":"This place is a let down. It wasn't even that busy, but the service was slow and unorganiz","useful":0,"cool":0},"Z6Np5UVGE9TlaMdemWJnHg":{"text":"waitress was great.  But, worst jambalaya I ever had.  it was literally a ball of mush and","useful":0,"cool":0},"u0egCaQHSFfsKdmsSGEphw":{"text":"The crawfish etouffe over biscuits with gravy topped with two poached eggs was great and s","useful":0,"cool":0},"WQWKPEyYnm0O9eTm3wodow":{"text":"Stopped for breakfast. Food was okay. The andouille pancake bites were pretty yummy. What ","useful":0,"cool":0},"20xcxG5owaGhY9n86hxTzQ":{"text":"We had a party of 5, including one child. There wasn't a line but we were asked to wait ou","useful":0,"cool":0},"sEkM3RpK9Jqzm1rToWNPVg":{"text":"Waited forever for our food. Food was mediocre. Server was nice enough to give us free dai","useful":1,"cool":1},"_Fmn3UDvdHeT1u5ZmLwsig":{"text":"I was so looking forward to visiting Cafe Maspero because it was recommended by a coworker","useful":0,"cool":0},"buwp3qcHWAl1vXuSaVfL1w":{"text":"We are very happy to have finally found a restaurant in the quarter that is reasonably pri","useful":1,"cool":1},"tjtGLTfSpw_PBaZN4B0DOw":{"text":"Great food! Great service! One of my favorite New Orleans restaurants!! Our server, Melva,","useful":1,"cool":1},"CDa4953c5Sqj8Jyf8Glrrg":{"text":"In a recent trip to New Orleans we decided to stop in, they have a typically traditional C","useful":0,"cool":0},"22D1UTH5vG0qaYhM4QtYpQ":{"text":"I haven't been here in a few years because the food was so bad last time. Based on this vi","useful":1,"cool":0},"QC1u40t1iGpqmh0d9qUBgQ":{"text":"completely,thoroughly,and completely disgusting.....the kitchen staff all looked like they","useful":0,"cool":0},"XQQDQXQclpMmqraNmbOO7g":{"text":"Dinner on a weeknight, solo dining.\n\nModerately busy Tue 6pm, seat at the bar.  Second vis","useful":1,"cool":0},"Awus44fM2Nytqa2xfKoqQw":{"text":"they have  decent food...... good location   drinks on the cheap.....loud crowded....i've ","useful":8,"cool":6},"knB77ViJWUw-BUVB12zrfw":{"text":"I've eaten here a handful of times over the years and generally it is passable but never a","useful":1,"cool":0},"FLB1iORzdZAOulMukPt-kg":{"text":"Atchafalaya... crawfish stuffed omelet with etouffee on top and a side of cheese grits is ","useful":2,"cool":0},"HH1LSwtSAzYRVxErrzqi1Q":{"text":"We regularly eat here and recommend Cafe Maspero to visitors.  It is a great place to get ","useful":1,"cool":0},"lfdWG9Xaf7wJ4FkDYRA8gg":{"text":"Ugh. My husband dragged me here because he thinks their muffalettas are amazing. So, I agr","useful":1,"cool":0},"ELWaxeuGCMqRFFhA4_5mJg":{"text":"I have two stars because the food wasn't uncooked lol. It just had no flavor. At all.","useful":0,"cool":0},"O4Ia2K-0CtiaCeqeHIwaLw":{"text":"Good solid French Quarter restaurant.  Had a perfectly fine meal of jambalaya and fried fi","useful":0,"cool":0},"WnSC2HrHSju3yaTFntCGUg":{"text":"New Orleans native here, one of the worst experiences we've ever had in the French Quarter","useful":0,"cool":0},"saIKmXKF_OQbUkZBY2ClDg":{"text":"First stop yesterday morning. The server was also the bartender very sweet lady. My $7 mim","useful":0,"cool":0},"khkP9eP0XSOO-SjwBHzwfw":{"text":"We decided to go here because each time we passed, there was a line of people outside the ","useful":0,"cool":0},"sMv-35zA46XvSSfcYJIsmA":{"text":"We came for the red beans and rice and we were not disappointed.\nWe tried kalamari, had a ","useful":0,"cool":0},"N8m4EUsHHrgdR7jzhjl2XA":{"text":"The table was wobbly, asked for another table but there were others that were wobbly too s","useful":0,"cool":0},"0lUTruAUuAGBpsRa9PRT4A":{"text":"+ good prices for food and drink! $1 daiquiris! $2 abitas!\n\n+/- service was slow but it wa","useful":0,"cool":0},"HRaRpQVziol6CG7p0TriPA":{"text":"We came here on a Friday night, right before closing. They warmly welcomed us in, and didn","useful":0,"cool":0},"LzwdjQ9AjV19mizmKXKWbQ":{"text":"Mixed review on this one. Some food choices are very good, some just average. Yet, the gen","useful":0,"cool":0},"i89ScqP4J5OrJ69rjbMwgg":{"text":"really slow service, mediocre food. not a great place to go if you are looking for quality","useful":2,"cool":0},"ay806rIpK8-PZh5FOHCx4Q":{"text":"Went for breakfast. There were no more than 6 other customers.  It took half an hour to ge","useful":0,"cool":0},"ddTCCSSEcxE1yMlvWvfbmw":{"text":"Just love the 2 Gals behind the main bar Debbie and Dawn. They were so nice to us answered","useful":0,"cool":0},"cmLOO_bR-xVzN37IWmxSPA":{"text":"Went for dinner on Christmas Eve and was underwhelmed by the food and service.  The jambal","useful":0,"cool":0},"lYpSpYhEI7uu6Zir8o824w":{"text":"I have been coming here for years. This is my go to place in NOLA. Not sure why some of th","useful":0,"cool":1},"1RMQ2KeMY604w1Ggx9OREA":{"text":"This restaurant is located in the middle of the hustle and bustle of the French quarter. \n","useful":1,"cool":0},"aN_TCW9GvMx1Z4fGy_2aJQ":{"text":"Just visiting after a 7 day cruise. I had a smoked turkey sandwich.it was good.drank a voo","useful":0,"cool":0},"cvYP5KekMDB4LzfJTcqk-g":{"text":"The food and atmosphere was amazing. Ms. Patty was so awesome that we sat in her section t","useful":0,"cool":0},"zk4SyPKbJP7gLNoIAcclbA":{"text":"Awesome fish sandwich! Best we've ever had! And the service was great! Ask for Alex! A mus","useful":0,"cool":0},"UcaZD0tyYXPAd58x45jrOw":{"text":"Out with friends on an annual holiday bar crawl, we popped in here. We hadn't intended on ","useful":2,"cool":2},"Zr7XtTAOQZ-pPRe_guKksA":{"text":"Great service and great breakfast. The coffee was excellent as is without cream or sugar, ","useful":0,"cool":0},"T2TQwwQRDqcl-XqCANAb-w":{"text":"I would definitely recommend this place for breakfast. Our waitress KaTonya she was awesom","useful":0,"cool":0},"gVxab47HwDsDKjrzRX0-Eg":{"text":"We stopped for a lite bite.  Had French onion soup and gumbo.  French onion was good but s","useful":0,"cool":0},"lxSfbaKxXBrF7lf3n0oWGg":{"text":"Nice little place- we were a large group and after lunch- so there was only one server and","useful":0,"cool":0},"QjexLYXAzD0WjIdqD2bqYw":{"text":"I learned about Café Maspero by watching a YouTube video on good deals in New Orleans whic","useful":0,"cool":0},"75eGb6mRXFtGiUWbKY3zRw":{"text":"I live here and I really love this place for a quick casual bite if I am out walking with ","useful":0,"cool":0},"UWuoWSdhSmOZK8v58hCPlA":{"text":"Pretty good food. Waitress was nice. The onion soup was delicious.  Coffee was just ok.  I","useful":0,"cool":0},"haEYl3RFpRUlr3aragUfFQ":{"text":"It seems that the drink specials, wait staff, and ambiance are the best attributes this re","useful":0,"cool":0},"7cU4CeI7NLpG8RHb8RzR0g":{"text":"AWFUL. Just awful. This place highlights EVERYTHING that is wrong with the food industry. ","useful":0,"cool":0},"uoqDN07Dc8i8tTkX7HMqQA":{"text":"Just because there is a line doesn't mean it's worth the wait.  The atmosphere was interes","useful":1,"cool":0},"TZKZ7d-yIH2FaA41mPzs5A":{"text":"Upon entering Cafe Maspero, I was a little disconcerted at the somewhat grimy feel of the ","useful":0,"cool":0},"97HWeVxct_1FisOG61WFUw":{"text":"Wow!  The food was great and the service was phenomenal!  Got the alligator bites and the ","useful":0,"cool":0},"T5LrZ5PG5aBDDZvdBULm_Q":{"text":"Can't go wrong here!  Great location, great service, great food!  And I suggest you get th","useful":1,"cool":1},"6Pzz71RmQO7g4LNcZJYEdw":{"text":"Thanks to Patti with an 'I' for superb service and a pleasant afternoon.   Food was served","useful":0,"cool":0},"ljKvWaVsi2v3u3t1idkICw":{"text":"Everything was fried. It was OK, but I am not that fond of fried food. Credit card machine","useful":0,"cool":0},"Z3O4Hmw9EgcfH5Ut7vvnWg":{"text":"$1 frozen strawberry daiquiris?!!?! And yes they have alcohol in them. In this hot weather","useful":0,"cool":0},"1zd8QqgthuzG5BA68kUtHQ":{"text":"Great service by Tracy for our mid afternoon club sammy, that we split. It was good and th","useful":0,"cool":0},"M2L8AFODl_xR_H44-41uCg":{"text":"Stopped in twice for breakfast on this last trip and can't say enough good things about th","useful":0,"cool":0},"Penit-x9aTaFm1HxR53IkQ":{"text":"Everything we ate was fine, but with so many great choices in NOLA, why settle for fine?  ","useful":0,"cool":0},"aJUcdosJ1GT-BiXSpoie8A":{"text":"It's okay. It's more of a 2.5, but I'm bumping it up because our waitress was a sweetheart","useful":0,"cool":0},"TwQWpP6PuNqctXj7OJKItg":{"text":"Great roast beef sandwich, red beans and my favorite the chili. I always get an order of F","useful":0,"cool":0},"3dhzFUQg6pOL7FOkNTncMg":{"text":"OMG! Biscuits and gravy were awesome!\nBeignets sticks awesome also\nCoffee great and servic","useful":0,"cool":0},"KMCp45T52EatDqhNLJ7akw":{"text":"Tourist here. Used to live in New Orleans, but don't recall ever visiting Cafe Maspero bac","useful":0,"cool":0},"p_U1bsxELWFSYp-1cgJRrw":{"text":"Nice location. The service was terrible and it want very busy. Our waiter had to ask to co","useful":0,"cool":0},"0IfqWDcl5dGMiORthEqniA":{"text":"I reallly enjoy this place.  I lived in Louisiana for years.  No trip to New Orleans would","useful":0,"cool":0},"S2vkAHLuk2rAnn0-LDtOJQ":{"text":"We got caught in the rain, and stopped to eat lunch. I got the muffaletta and my wife got ","useful":0,"cool":0},"PeKcQvQHO68f_4FXVSNtyQ":{"text":"I have been going to Cafe Mesparos since the early 1980s.  I am from New Orleans but now l","useful":0,"cool":0},"JekM03cQbGXrzJI4rRd8yA":{"text":"There was a really nice waitress and cheap wine, but the food was bad. Also saw a mouse ru","useful":0,"cool":0},"zjplRPeT-5wOKcupxeH9ZQ":{"text":"Stopped in for lunch and had good service, but the food tasted pretty bad. Everything tast","useful":0,"cool":0},"hnkKxZffuGvMZR9jKhQavA":{"text":"Great food; great service!! Our server Patti was extremely attentive and personable. Defin","useful":0,"cool":0},"l_H6viui0rGFfY2crbBIbw":{"text":"Can't beat the price!  Huge portions on platters, great for your buck! Fast service and ve","useful":0,"cool":0},"z_H96uRY1BC2QNH_l42LPw":{"text":"Awful.....absolutely awful. As soon as we sat down a rat ran from under our table !!!!! Pu","useful":0,"cool":0},"54PkwWvoakBwWEOmpsdXHQ":{"text":"The food was horrible.  The grilled cheese sandwich tasted like it had been microwaved and","useful":0,"cool":0},"i2XeeTxtM9zprZc-blmpuQ":{"text":"The history of the building and the restaurant is impressive. Everything else really isn't","useful":1,"cool":0},"RHr83d3yy3S6LPjXr94nEA":{"text":"The beignet sticks were delicious, my hubby and I shared a plate. However, word to the the","useful":0,"cool":0},"kY3IDqR2Sn9Yg47MVNYKcw":{"text":"This place is pretty touristy because it is smack in the middle of the French Quarter. It'","useful":2,"cool":0},"03CqVLsQrswA8TIL59a1IQ":{"text":"Perfect menu option for the weary sampler.  My wife is leery of spicy foods and certain se","useful":0,"cool":0},"XR5QQjdgNT2h8b8pS545XQ":{"text":"Ordered the fried calamari platter and it came with a bunch of fries and bread to bulk up ","useful":0,"cool":0},"Jz0yxRwxW621mTp5bh_zYQ":{"text":"It's been years since I'd eaten at Cafe Maspero. My friends and I used to frequent it ofte","useful":6,"cool":3},"8XbV6hU9D0Wx70YYwh4BMg":{"text":"Late September 2015, lunch\n\nWow. This was horrible...classic tourist trap.\n\nI had the \"jam","useful":3,"cool":1},"rL8UYDOiMeg52HetJTbjkg":{"text":"If you are ever in New Orleans, do NOT go to this place! I was initially very excited to f","useful":0,"cool":0},"BOKL-eSINTXgaf3BdpPjXg":{"text":"My family and I were seated right away and servers were very friendly and attentive to us.","useful":2,"cool":3},"SKsfULPsJgzL4J5-4gdsYg":{"text":"I'm not sure why all the bad reviews.  It's not the most amazing thing in the world but it","useful":1,"cool":0},"B9_Q1VpkURiDBDlbNm4wYg":{"text":"My husband and I visited NOLA last month, and this place was recommended by our tour guide","useful":3,"cool":0},"LR9HcAr8-TlyYmWRXJJAFQ":{"text":"Decent Food, Disappointing Outcome\n\nI am a native of New Orleans and have frequented Café ","useful":0,"cool":0},"yM5JIb2fMmoVUB1IOm8wLw":{"text":"The fries were good. Muffuletta is yummy with lots of meat. No wait to be seated. Adequate","useful":0,"cool":0},"-vVF2M-zm-AJoHml7KzQww":{"text":"I went to cafe Maspero with a drink from another place which they allowed, and I was pleas","useful":0,"cool":1},"Ed0ADf0NJIln4Cmg1PrK9Q":{"text":"Great ambiance and great food! Our server Victoria was OUTSTANDING! She went out of her wa","useful":0,"cool":0},"DWaxMO_uD3WgJhPV4_c3BQ":{"text":"Best one dollar strawberry daiquiris!  I enjoyed cajun pasta. Mother had red beans and ric","useful":0,"cool":0},"R9xRGjF8jwXVxG_x1oxIIg":{"text":"One of our best dinners in New Orleans.  My husband and I Gumbo, Jambalaya, and a muffulet","useful":0,"cool":0},"ns7fAcIVvnBnMQml3hYaAA":{"text":"If Jesus Christ himself were to come here and eat the Jambalaya or Red Beans and Rice, he ","useful":0,"cool":1},"g_FWJv-NAcKqfw3AW0zpVA":{"text":"Great place in French Quarter!  Stopped in because we noticed Baked French Onion Soup on m","useful":0,"cool":0},"IP40rYwuC23EeUibuDU1NQ":{"text":"Server was super friendly and attentive. The Bloody Marys and pineapple juice were awesome","useful":0,"cool":0},"PT8dBeHRPslWfra2Vodx4A":{"text":"Horrible service from our waitress. She was more interested in talking in the back. Had to","useful":0,"cool":0},"wYnlgrDwhjHD3z1x4e_VLw":{"text":"I will say that this corner restaurant on Decatur may have a great outward appearance, but","useful":7,"cool":3},"8plE5SWr6maMw5pX8cnNPQ":{"text":"We just happened upon this place and wow was the food good and our server, Melva was fanta","useful":1,"cool":1},"AauyllWzd5YZyK6wu8alsg":{"text":"Great breakfast with plenty of food.  Came back today for lunch and the best jambalaya I h","useful":0,"cool":0},"12wWSjxvTmieIn0IIvg7lw":{"text":"Our waitress was super friendly and the food was all made to order and very good at the pr","useful":0,"cool":0},"rHN_ARcyJpnR7mCP-xnOPQ":{"text":"This spot is one for the books, I enjoy the food and mostly my waitress. Chrishonda's pers","useful":0,"cool":0},"xxmRGTRmg8B47pWbYEFsCg":{"text":"So So food although the service was Good. Atmosphere was fine but if your looking for real","useful":0,"cool":0},"YQ7z0J4Ih8JWs5ay_xvMZw":{"text":"This place proves you can get good food at a good price in the French Quarter, and you don","useful":0,"cool":1},"-WM7BhpwHTQPlCKMgsLsGw":{"text":"Good place to go if you're wanting some fried food. It was decent enough, but not my favor","useful":0,"cool":0},"6iafKF2cUbcJnXkntNTgfw":{"text":"We actually visit Cafe Maspero pretty often when we're looking for cheap eats in the Quart","useful":0,"cool":0},"5BmybN6WB5KfjQIOtf_OPA":{"text":"Great drinks at the bar and the wait staff were excellent. Lacie (sp?) had a smile on her ","useful":0,"cool":0},"TjKXTt78J4MV0vrOViRreQ":{"text":"We came here for a Branch Managers Trip for work. We had a table for like ten with just a ","useful":0,"cool":1},"U7mBt2yBwlJ9AAR7BSi34w":{"text":"Wife and I ate breakfast here. It was okay, nothing special. Overcooked sausage, no season","useful":0,"cool":0},"KzqrEFnYk0-VUOcmRIoLUw":{"text":"Third trip to New Orleans for Jazz Fest but the first time we found this cafe.  We will be","useful":0,"cool":0},"MPadYd58OaoSDilo4sKXew":{"text":"Food:\nI got a Cajun Chicken Sandwich at two places, here and Royal House.  The sandwich wa","useful":1,"cool":0},"4cA0sFFc3_9dwZw_8ThiOQ":{"text":"I just don't understand all the fuss my party was making about this place.  I wanted to st","useful":0,"cool":0},"SoqKfp_89__dA4hmS1tufw":{"text":"I've gone here many times and usually there is a line to get in.  \nTheir muffelattas are g","useful":0,"cool":0},"I0qAdTcKxai5ji7LPuJf_Q":{"text":"Just ok, nothing really special. Had the seafood platter which had so much food that 2 peo","useful":1,"cool":0},"1YinuJtZLRFCjrpJRJUFmw":{"text":"The Seafood Plate and Jambalaya are my ultimate favorites. Muffuletta sandwich is good cho","useful":4,"cool":2},"TsK6n8-7bSDvPT5sZY913g":{"text":"I'm giving a high rating for hospitality, large portions and cheap eats. My expectations w","useful":0,"cool":0},"i_TnQYYOlooLZMIUcjm_PA":{"text":"Patty gave amazing service! Sweet Sweet Lady!! Food was great mimosas were even better","useful":0,"cool":0},"mFkvzCS6iP3SIBVkVaDq4Q":{"text":"Our hotel got flooded out due to over night rain so the restaurant was closed. We were loo","useful":0,"cool":0},"O4NXnAxWlNUiHwAwYoYjsQ":{"text":"We waited over two hours for the meal... The service was incredibly slow and the food over","useful":1,"cool":0},"YFgh84Sxkfjd-Jyx4eWx4g":{"text":"While in the Big Easy, we were looking for something good to eat. Not hard right?? No, We ","useful":1,"cool":1},"IEHxwSezIIW4QJlQJM-2Lw":{"text":"We had a great dinner and real enjoyed the stuffed fish. Great portions and good service. ","useful":0,"cool":0},"k7DtmWSjIClTI4PFX3uP6A":{"text":"The breakfast omelette with crawfish was superb! The staff was on point and inviting! Ask ","useful":1,"cool":0},"w9JIdRX0FR-VS1GVipihUw":{"text":"The service was really friendly. The food was so pricey and the quality of the food was ba","useful":2,"cool":0},"xgspIpI2CbHA8x9Sbfa3Zw":{"text":"Yuck.  The red beans & rice were BLAND.  The shrimp were average.  The daiquiris tasted wa","useful":1,"cool":0},"nCkXAX_bkYoCjlPcODKdpw":{"text":"The bartender from Napoleon House recommended this to us, since their kitchen closed early","useful":0,"cool":0},"4uYGC4snVMWynwnHNB-vLA":{"text":"I enjoyed this place a lot.  It was simple and no hassle. We got breakfast and it was good","useful":0,"cool":0},"-UnKyanQsg8DEjC6hSxhCg":{"text":"looks ok when you walk in but i waited 1 hour just for a bowl of gumbo. when i did get it,","useful":0,"cool":0},"XvSKdzcxiUW-g7ZjuGCURA":{"text":"Ok..nothing special. Red beans appetizer is a good size portion. Shrimp po boy was good. C","useful":0,"cool":0},"2VITwdetLzLzhCUPlfHsTw":{"text":"Quick service, amazing food and a very reasonable price. \nMake sure you have the jambalaya","useful":0,"cool":0},"ZTMmi_paPPYBASGbbKtsBQ":{"text":"Had the catfish platter, boyfriend had the mixed fried platter. Meal was good, however it ","useful":0,"cool":0},"1MtfcMNWQ5MPTlpdy4Kgzw":{"text":"The WORST service ever!!! We were seated by a nice staff member. But OMG the service was U","useful":1,"cool":1},"Xqu30LVsR-X1rvuL4q2nuw":{"text":"The hype is real! I had the shrimp poboy. Mad good fam!","useful":0,"cool":0},"FT9LvFsjaPTeIy96BNFsxA":{"text":"We took a last minute trip with our two puppies and I'm so glad we stopped here for their ","useful":0,"cool":0},"oHVQFUqOa-rGNeA-R-MsCg":{"text":"Wasn't much to look at outside and wasn't much of an ambience inside either. Took several ","useful":0,"cool":0},"CiUyGVRMrNm-8jj4I7oG6A":{"text":"Loved the shrimp po boy and the French onion soup. You guys really nailed it with the soup","useful":0,"cool":0},"P-tCFILtkJF_9XIN6uDeQw":{"text":"Ferin is the best waitress I have has in New Orleans. The food was amazing. The fish was s","useful":1,"cool":1},"mZ4SYHObiHh5TtXlTYqGuA":{"text":"See description above. Red Beans & Rice, Muffalettas, Fried Oysters. There are only a few ","useful":1,"cool":1},"atXgQQiB8B57G5BxX-rUjA":{"text":"Always enjoy eating here when we are in New Orleans and I get the mufalatta every time bec","useful":0,"cool":0},"iq0EIIlZ_jW9isP705MXyw":{"text":"WHY ARE THERE BAD REVIEWS FOR THIS PLACE???  My parents used to come here all the time and","useful":0,"cool":0},"_RpritX6iLn9qzUewl9plQ":{"text":"I'm not sure why there are negative reviews of this place.  We observed just the opposite.","useful":0,"cool":1},"z4Ps4TgqirIG5cJ5TT5ypQ":{"text":"Had dinner with another couple recently; their first time visit. We enjoyed our experience","useful":2,"cool":1},"ERYwzKEFUFoPVy-CdjAxRQ":{"text":"This is our favorite restaurant to eat at when we visit New Orleans. The food has always b","useful":1,"cool":1},"nqtfbw-C0vu92Snxp2Gdhw":{"text":"Short pour on the wine...glass was half empty and I'm a half-full kinda gal. Had a muffall","useful":1,"cool":0},"UM7wZxc5taL6V533gp1WMg":{"text":"I had the Catfish Platter with extra shrimp. Catonya was our server. She provided excellen","useful":0,"cool":0},"Lj4RSLt4YLM4adc__ONOYQ":{"text":"The Bayou Benedict is amazing!! Beignet sickens are a great different take on Beignets.. l","useful":0,"cool":0},"eQ7eW0q7VV1ZWcsHeo73PA":{"text":"Wanted a quick lunch before we hit the road. Rustic interior. Food was excellent. Had Fren","useful":0,"cool":0},"3QzFui2N43_wqsuxnCMC_Q":{"text":"the name of this place is amazing, whats better then having, a Buck and drink. this place ","useful":0,"cool":0},"icNA65QjAkeCV7-EmQ4eYw":{"text":"My friend came here for the muffaletta but I'm not an olive person so I had to find someth","useful":0,"cool":0},"43Q150CC0zbDzQyF2RPGxw":{"text":"Didn't enjoy this one at all. The seafood was all fishy and greasy. My friend's veggie muf","useful":0,"cool":0},"psZgYVl990Yyab3zehVR3A":{"text":"This place was recommended to us by our tour guide. Stating we had to try their french oni","useful":0,"cool":0},"VdJq7EXcr4iJeI-BrXNJsA":{"text":"Wow!! Can seafood be any better?! The hurricanes and muffuletta were good but the seafood ","useful":0,"cool":0},"m28xMz_tjYChPRSEzsMAjA":{"text":"The saltiest French onion soup I've ever had . Sandwiches aren't bad . Bread pudding is hi","useful":1,"cool":0},"NQnPnjsgGCbZvXTWI7fGYw":{"text":"Food was really good with the best onion soup in the big easy. Their poboy and shrimp dish","useful":0,"cool":0},"uhlLYAnmdY3_bZolQ3kRkw":{"text":"Yuck the food here sucks. We went here on a recommendation from a local because the place ","useful":2,"cool":0},"kpYTz_ajli4oQgMpkEHkoA":{"text":"I had a fish po boy and wife had a shrimp one. We shared and agreed that both were quite g","useful":1,"cool":1},"0vwkaDqAotYNgalFbz31BA":{"text":"I was told to try this place for their burgers. While the staff was nice the burgers were ","useful":0,"cool":0},"atC7Zs3z0o7UPO4v6Ytg8A":{"text":"Our first meal in the Big Easy... not the best. Bar atmosphere with that an aroma of decad","useful":0,"cool":0},"yCElkyAyi0YuuRVIeUvkqw":{"text":"Do not waste your time coming here. The food was Eh. No flavor. Everything was bland. The ","useful":0,"cool":0},"hng48ZzcTaGwPcCC_LVHbg":{"text":"Came here with my two sorority sisters after walking around because we wanted to eat befor","useful":3,"cool":1},"ZAlYEQahoMXbFvi0YHSW8w":{"text":"The food was pretty good. Most of my complaints are really just service related. I asked f","useful":0,"cool":0},"rHlf72dtr-VicYoXpoI0Mw":{"text":"Dive food place. Very dirty. Hardly any fish \"strips\" on my fish sandwich. My fries were c","useful":3,"cool":0},"3auJuHNDFUQpCJc0VA21Ow":{"text":"Melva was our server for breakfast. She was amazing, and gave us a true southern experienc","useful":2,"cool":2},"yu5gi6MguEWp6n-wThNFyQ":{"text":"Ate here 2 mornings in a row, both times had Angela Dennis as our server, what a breath of","useful":0,"cool":0},"E_gybuTu4X9dG2sJaPF-7w":{"text":"We stopped in here to ride out the down pour outside. The reviews weren't terrible so we g","useful":11,"cool":5},"287MY4PogkHxylsYz0tCmA":{"text":"We were excited to come here and try the beignet sticks. Came highly recommended. Sat for ","useful":0,"cool":0},"8aYroVuz9iv_1pM0Ybq_fA":{"text":"Two stars only because the service was decent. The food here is very bland. Cafe beignet a","useful":1,"cool":0},"Ja8TGJCffHDid00FVGykHg":{"text":"Maspero's is iconic and a hit or miss depending on what you want from a FQ restaurant.\n\n3 ","useful":0,"cool":0},"5dAj4erqj4cVVd1RUpfLvw":{"text":"I had a great time here. Our waitress Cassandra was fantastic and really made our experien","useful":1,"cool":0},"l5xDOi_OvxzcS9Swcg7YBw":{"text":"I have been eating there for years. The past three visits I have had to NOLA the food was ","useful":1,"cool":1},"OKZZpePG48tKExe4ct_2bg":{"text":"Great food, we had the seafood platter and jambalya","useful":0,"cool":0},"ZbXDSVzbBomAhnixXiR8HQ":{"text":"A local recommended this restaurant.  We were told that they had good red beans and rice. ","useful":0,"cool":0},"oJbidWUkNowcgn5vsymcLA":{"text":"We saw the line at Cafe du Mond and decided to try this place. Big breakfast at reasonable","useful":0,"cool":0},"7LG48L_jyEE3Zmz1Ys48FA":{"text":"I was really hungry and this place had a waiting time of 15-25 minutes. The only good expe","useful":1,"cool":0},"ykQWUWAhZsyJeARTvRoKuA":{"text":"A buzzing spot in the French quarter area.. About 3-4 blocks from the famous Bourbon Stree","useful":0,"cool":1},"ozOsB-H0CgAjjm207RUq5g":{"text":"We had the alligator bites and the Gulf Fish Maspero.   Both were delicious!  Our server K","useful":0,"cool":0},"EQbvWpntpHKcLYQKu0tTVA":{"text":"A decent, quick and easy restaraunt/deli in the French Quarter. Service is friendly and fa","useful":0,"cool":0},"FmeAZKL27uT7zagGfLZMOQ":{"text":"Great New Orleans Style food, fast and friendly service. I would go back! Right in the hea","useful":0,"cool":0},"7uHPbFoBB_wB70KiZV-76g":{"text":"Long line to get in, but it moved quickly. Food was excellent! We tried the Three Bowl Sam","useful":0,"cool":0},"lUKS-3mugWdc37wucLbFXw":{"text":"Right on the mark for Great food. Like mist places in NO, don't let the place shut you out","useful":0,"cool":0},"ElXTwzn32hWLyVO3-9cxSA":{"text":"We had the beignet sticks and the muffuletta. Both were excellent. The beignet sticks were","useful":0,"cool":0},"a2QzaAzFIqysvXgrbV6N0A":{"text":"Some of the best crawfish ètouffèe in NOLA.  Great prices and the staff was very friendly.","useful":0,"cool":0},"U86PIP_tRCl3EcfCurtS1A":{"text":"Cafe Maspero isn't a bad place to eat but, it's better suited for a quick, late supper. Th","useful":0,"cool":0},"w5y5HtwFfn2wp_IIQ7d0tg":{"text":"If I could I'd give it half a star it was not that busy the lady sat us at our table gave ","useful":2,"cool":0},"p1FVliterMrgATcFGIMXSg":{"text":"Came here for lunch while visiting NOLA.... I ordered chili and French fries. The chili wa","useful":1,"cool":0},"pn0v0nKQV6lwhCAU3c4A4w":{"text":"Absolutely amazing food. I got the Bayou Eggs Benedict and it was INCREDIBLE. Highly recom","useful":0,"cool":0},"34hy4oRo2B14i5Rfd6aXpw":{"text":"Made a quick stop in NOLA on our way back to TX. Tried the chicken and sausage gumbo and t","useful":1,"cool":1},"6vr6H0a5yVeyCxHZjtfigQ":{"text":"I like this place but I don't love it. My wife always gets the muffaletta, which is pretty","useful":5,"cool":4},"2CJ3eq1vq4XtvbqU-JxOoA":{"text":"bartenders were great\nordered the sampler pick 3 really disappointed that they forgot to a","useful":2,"cool":1},"ZRgD0l_gncfwuxlm43Y-lQ":{"text":"Share the seafood platter. Sounds like a plate of grease but wasn't greasy at all. My favo","useful":1,"cool":0},"MZ7DsFFhvn3rDHrdEcMLOg":{"text":"First day food was decent and service good but the hostess seemed like she'd rather be any","useful":0,"cool":0},"0okwPyZBurlgKL2e9AYtCQ":{"text":"Crappy slow service. Waiter not attentive and screwed up one of our party's order, so it t","useful":0,"cool":0},"4qotQ7-X10E0uRHfqXnLWw":{"text":"***Did not eat here (however reviews aren't just about the food for me)***\n\nPretty starvin","useful":0,"cool":0},"iUo-EFVSTuYwcDt7dZTakA":{"text":"My Build Your Own TURKEY omelette tasted good until we found pieces of ham in it. The frui","useful":1,"cool":0},"K3r1UJy0R77-X3_xxIS9eA":{"text":"I came here to eat because it was one of the only places open on Christmas Eve night that ","useful":0,"cool":0},"HS28iXqgJxvTCo28pIEAtA":{"text":"It had great ambience the food was ok not the best but the draft beer was icy it was great","useful":0,"cool":0},"ib6zwACkFIA7NKnXg1bYGw":{"text":"Food taste good from what I could taste but the service sucks. You find yourself repeating","useful":0,"cool":0},"np9zV3KodVxZ4vRa7a1hNA":{"text":"Used to come here several years ago and it was a good place for a plate of fried seafood a","useful":1,"cool":0},"pIwTFUN9bUXELuF-xZYMIg":{"text":"Meh. It was ok. We were 8 people who walked in around 2 pm on a Thursday and we were seate","useful":8,"cool":6},"AYxwhXfL1TD4m8aFDbZa6Q":{"text":"This place is a gem  the seafood is amazing and I truly enjoyed the cocktail sauce and the","useful":0,"cool":0},"0uR9aNHohEhFSzatHXf0MA":{"text":"Drinks and food were good. There was a waitress who did her best to avoid our table. Dark ","useful":0,"cool":0},"HRKUv4uyM6gQRcHhAs411g":{"text":"CUSTOMER SERVICE TO THE MAX!!!! The manager is the best!!! I changed the review to five st","useful":0,"cool":0},"TaZU3oOe2Jvhy4oE0aCO8Q":{"text":"Service was excellent food was great.. highly recommend to anyone looking for good true ne","useful":0,"cool":0},"5eSOLcOQYBHiEJd0C7zx0Q":{"text":"I've visited this place even when I lived in New Orleans.  It's one of my favorite places ","useful":0,"cool":0},"snQojPd7bRPM5BbkLaphaA":{"text":"This place is ok, and I will say that they do have pretty good strawberry daiquiris, but I","useful":0,"cool":0},"NTAoNPyvbfqlxJ-2aBsKxQ":{"text":"Delicious food!! I know there are some mixed reviews on here. Those almost discouraged me ","useful":0,"cool":0},"W2CIhEgIzyCtNEQ3KqgfQA":{"text":"Ok, I don't know if in my old age my taste buds are changing or what but........ I usually","useful":0,"cool":0},"XsgZ9Q2B6Sq0gFXYFamLyg":{"text":"Fantastic Atchafslaya omelette (with crawfish) Excellent service. I ate breakfast here jus","useful":0,"cool":0},"bH4wtbL-jbLQzdIJHaEQdQ":{"text":"The food was pretty good & it's in a good location. Angela D was our waitress & took great","useful":1,"cool":0},"E1ASfc4Xn2nvAOM4V-5eIA":{"text":"This was basically a generic presentation of Cajun cuisine. The ambiance is casual dining ","useful":1,"cool":1},"Qc44hBkPPpIq64yYx-HaFQ":{"text":"Past its prime!!! This used to be such a great place, but now it is a tourist trap with lo","useful":0,"cool":0},"_cyH_VNyVE-KTonhryiY_w":{"text":"Our server Judith was very attentive and accommodating for us out of towners.  I tried the","useful":0,"cool":0},"X2MJC2Pa55I2NBJbYy68JA":{"text":"The service at Cafe Maspero is good. The food is good as well. If you need a soup, the Fre","useful":0,"cool":0},"pUjLfnXrDTKIVdSvyaVbaQ":{"text":"I have fond memories of Cafe Maspero. It is one of the first restaurants I ate in at the F","useful":4,"cool":1},"ajxu7Maa11wLTSULleozPQ":{"text":"I understand that everything is been difficult for small business but this place was very ","useful":0,"cool":0},"eZ-RksjFGavA4ODrPlp8fw":{"text":"The Food in general was just ok.  They committed a mortal sin by serving a muffuletta sand","useful":0,"cool":0},"OiaTWlp2AsDcT0hTe8q6ag":{"text":"Would not recommend this restaurant to any of my worst enemies. I would imagine POW's duri","useful":0,"cool":0},"SAcE8B4bqvK2m3BFexktwQ":{"text":"This is a great spot is you like sharing your meal time with your dog.  The day we went wa","useful":0,"cool":0},"0ebzMoNYiMW-cf8pX7a4Kg":{"text":"I didn't think the food was either really good or really cheap, as the other reviews on he","useful":0,"cool":0},"8nroKuOjZm1fw9YOZPnDfA":{"text":"I have tried this place a few times and every time it gets worse and worse. How it's still","useful":1,"cool":0},"0aaRc4Gayu6ILUCc2dU1NQ":{"text":"Service was awful and food was disgusting. Took 20 minutes to get food and it was cold.","useful":2,"cool":0},"N0EZu7CNobrLWxGRRDnrdw":{"text":"This place doesn't comply with laws in regards to service animals and their food is overra","useful":1,"cool":0},"5Jjc4-feKetu61yL5t2tEg":{"text":"Hostess was not super friendly. He tried seating and another family at the same time. It w","useful":0,"cool":0},"5oLAKzJfcb7BCBsoOHWvcA":{"text":"It is really unfortunate that the food was so terrible. The server was so amazing! He was ","useful":2,"cool":0},"wEWQFpLla7zqwzsFVhMayw":{"text":"Very local, very authentic Louisiana food. Cut the craw fish eggs Benedict with the side o","useful":0,"cool":0},"1_POINmMpZV20U2hlptgmA":{"text":"My experience in the past here has been excellent. However on October 22, 2016 it was a bi","useful":0,"cool":0},"0OAAppE2ZBbhKbZJwiKqRA":{"text":"Went to this restaurant since it was recommended by a friend and was surprised at how bad ","useful":1,"cool":0},"nNUlqFazsTB907Xg5qJunA":{"text":"Place was dirty, with sticky tables. Overpriced food that was bland. Wife got the crawfish","useful":0,"cool":0},"6lgI7SIC3u98DKES7JR2YA":{"text":"In the days before New Orleans bars asked for ID's, I used to get a Strawberry daiquiri to","useful":0,"cool":0},"cviTJnN8mmrUMYa9V3TPHg":{"text":"This review is on customer service only since I didn't get to taste the food.  My husband ","useful":1,"cool":0},"eL03I_B-PGN4Pt-OFJYdiw":{"text":"Super yummy and great service! I got a hurricane and red beans and rice and it was great!","useful":0,"cool":0},"oAJvAHh-2vzqLnDSyx0uvQ":{"text":"Not the best breakfast place around here. No lines should have told us that much before we","useful":1,"cool":0},"YvedXufpuj1A0E9OPH8mGw":{"text":"When I mentioned that my man and I had gone to Cafe Maspero for lunch, our local friends r","useful":1,"cool":0},"P_9eHUoIJW7NkTxl2CFvZw":{"text":"Terrible service. We waited for 15 minutes before a server even acknowledged the table. Ru","useful":0,"cool":0},"37a79H4GDkBGr6Xa4yXKdg":{"text":"We stopped here because the place we originally wanted to eat was packed. The food was goo","useful":0,"cool":0},"T5ac04eYNVqyiqsTuqvjzw":{"text":"This was my first visit to New Orleans and after a long walk we were ready to eat. This pl","useful":1,"cool":0},"ABytNjTSF_mvKjaewu0m0Q":{"text":"On Tue., 3/22/16, 4 pm.- The Manager was an embarrassment and the waitress was afraid to f","useful":0,"cool":0},"_DhCmlQWbkxiC77cdpYbPA":{"text":"Well we had such a good experience the first day we went back again. Food was good with gr","useful":0,"cool":0},"kTek-AvyZ0cDMdH2OGT8RQ":{"text":"I am giving this location 4.5 stars. I'm going to mention my waitress, chrishonda who was ","useful":1,"cool":0},"HU60Bt9O7B1AvbWIfhjjoQ":{"text":"Excellent food. The definitely give you bigger servings than you expect. They had the beig","useful":0,"cool":0},"q6PMTHnZSIUiIVSGn4fEkQ":{"text":"What happened to this place, people used to be lined up down the sidewalk to get in?  We w","useful":1,"cool":0},"tBhGk3vKKOWwdnCWID_Sig":{"text":"Awesome breakfast with beignets, eggs, coffee (free refill), mimosa..u name it! \nVery very","useful":2,"cool":3},"rWrXX1uqMcb_nTHcCYNMOA":{"text":"I was glad to get away from the crowd on a saturday afternoon to eat at this restaraunt. I","useful":2,"cool":0},"xbsb9QuR6l31_tIlMflo-g":{"text":"This place use to great. We haven't been in years, we went yesterday and were very disappo","useful":0,"cool":0},"FS6zBUVHJgkW6h-_Sx9V1A":{"text":"Asked for water and did not get, our drinks arrived after meAl, they gave you a minimal am","useful":1,"cool":0},"e6JVC7xUzTZEhUh4hD4r-Q":{"text":"Not a bad experience. The food was pretty decent. I got biscuits and gravy, which wasn't b","useful":0,"cool":0},"j3OGxjM1b_gV2fQ0uRT4Tg":{"text":"Six words: Good food, good service, no daiquris\n\nI was just in New Orleans for vacation. I","useful":2,"cool":1},"CCS-66lBwvhbP7pIBrHytA":{"text":"Me and my family had a wonderful lunch and our server Chrishonda was the best. She recomme","useful":0,"cool":0},"GtpVbQQQveuM04sHru2WoA":{"text":"I totally mistook this spot for another restaurant with a similar name that I was looking ","useful":2,"cool":0},"jtK0WxHxIORK0uJR_sUtIw":{"text":"I think Cafe Maspero gives NOLA a bad first impression. My family (i.e. my parents) likes ","useful":13,"cool":7},"7j2-PwKzwc4fyiZF6TRpfQ":{"text":"I don't even know where to start... probably worst service we had on our whole trip. \n\nWe ","useful":2,"cool":0},"VgPlkkVml7rIhs9_CxIluw":{"text":"Best breakfast I had in town! Great drinks that were strong and fun! Anthony was super fri","useful":0,"cool":0},"0RyyG_dCxyCv_PsTyEOyqw":{"text":"This place was TERRIBLE for lunch. Our appetizer\n(calamari) tasted like burnt cardboard an","useful":1,"cool":0},"c9_bnBDLQGOkl5bSSl_pFA":{"text":"I LOVE pork...but not ham.\n\nI tried the Muffuletta sandwich on recommendation from a hotel","useful":2,"cool":0},"21yGA6FBt-Y6BRHEUkmXbw":{"text":"Café Maspero on Decatur street sits on the corner and opens up to both sides of the street","useful":1,"cool":0},"VbKswN3EKGB-htYvtX1Fsg":{"text":"French Onion soup and Gumbo were fantastic.  That's where the good news stops.  Service wa","useful":1,"cool":0},"wwhdHSBP3BdGer1ygQvjzA":{"text":"It was recommended by someone just coming out of the restaurant and we decided to go insid","useful":1,"cool":0},"gmSa5IF4oKUFAbZ9CFxrTg":{"text":"Nice big pastrami sandwich with perfectly cooked fries.  The red beans and rice pretty goo","useful":0,"cool":0},"ocGZjx_hTokrhvddRvRf7Q":{"text":"New owners.  Not the same portions, not the same bread for hot pastrami.  Calamari served ","useful":1,"cool":0},"3otPP9U7YvC2iutsEVJ5rA":{"text":"Very disappointed of where this restaurant has ended up. We use to come here a lot because","useful":1,"cool":0},"pH45MH-wEiiewt_1pW5GdQ":{"text":"My husband and I stopped in Cafe Maspero on our way home from Florida. The service was ste","useful":0,"cool":0},"IjDZKDj_ULrhQ6CKdn-t1Q":{"text":"Just another overpriced tourist spot. I'm a native of NOLA, and I know better spots for ha","useful":0,"cool":0},"D0x25p5FbJH_miejz2KtBA":{"text":"The jambalaya was real good and reasonably priced for the location. Beautiful ,really old ","useful":0,"cool":0},"fYjpFWqbEpjmWmrUMk8VZg":{"text":"This is a great place for tourists who are visiting the quarter. It is in a convenient loc","useful":0,"cool":0},"ia16w9s0Q87kDva5_ODoCQ":{"text":"disappointing after all these years. hadn't been here probably since 2014 or earlier and h","useful":2,"cool":0},"ZIu_sQuSmjZgbuY5veX0-w":{"text":"Primo real estate in the French Quarter. It had so many dirty tables when we arrived they ","useful":0,"cool":0},"ggS_d80pUkH0NRVexxgVoQ":{"text":"Went with 3 other adults and 2 toddlers. I understand toddlers aren't fun to serve, but th","useful":0,"cool":0},"xi_JzBsYuoY1SYvW1o-nUA":{"text":"This is an update to the review I posted on 3/22/16.  I contacted the corporate office to ","useful":0,"cool":0},"zXukcBiQeNMpJFceSUycOg":{"text":"Some folks at the hotel recommended Cafe Maspero.  We gave it a shot for breakfast. There ","useful":1,"cool":0},"u7-i9D_K49X7UDcGMyODhg":{"text":"Took friends from out of town to the quarter and stopped in at Cafe Maspero.. Josiei was o","useful":0,"cool":0},"H4U7GY30QZ1uVS24AfjKiA":{"text":"My wife & I ate at a lot of great restaurants in the French Quarter recently (August 2014)","useful":0,"cool":1},"QpNLuejOqu6S13DNBy8Gow":{"text":"Everything was wonderful! I enjoyed the food and the service. Chrishonda gave us exception","useful":0,"cool":0},"gTvRSVTvkEve11AHF_oYgQ":{"text":"I am a local, and haven't had a meal at Café Maspero in a while! I have to say, we had a g","useful":0,"cool":1},"4YX2aVkVx9oV-8I4iT6pXw":{"text":"In the half dozen times I have been to New Orleans, I've never had a less impressive meal ","useful":4,"cool":1},"_jmuGdS167PDM_hJ4toTsQ":{"text":"Great New Orleans breakfast spot. Service is a little sketchy buy a new employee, but I wo","useful":0,"cool":0},"owhQfkOHncp2-ZHeJ7El0w":{"text":"Service was great. Place seems a bit more local than most places I stopped by.\n\nRoast beef","useful":1,"cool":0},"4bT29n4mQilau9lg-ujPcw":{"text":"Welp, we were seated at the bar promptly but no one came and  said anything to us for 8 mi","useful":0,"cool":0},"pwMlysrTaEhB4TuRhblH5g":{"text":"This place served a muffuletta on a hamburger bun! What a joke don't waste your time!","useful":0,"cool":0},"R7fPKPNEH_H3XxcV78j4Kg":{"text":"Our waiter, Jason, was the epitome of southern hospitality while serving the most deliciou","useful":0,"cool":0},"cr1P9pAJqRNttgMzWKiNPg":{"text":"We chose this place for lunch ONLY because it started to downpour and we were hungry.  Tha","useful":0,"cool":0},"z2QrmVEgVSS-gOlMaEn6yw":{"text":"Bad bad bad bad food bad service the employees don't care about each other all they care a","useful":0,"cool":0},"7Spjbl51u_rZ1kmfy-ZQwQ":{"text":"I feel bad giving this place one-star rating, just because I usually like to write good an","useful":1,"cool":0},"ypUB-mgzRWwefdtAdI58aA":{"text":"This establishment needs better supervision in the kitchen. Our server was very nice .  Ho","useful":1,"cool":0},"vYWWJLI8GF9-cW8AEt29-w":{"text":"Ate at Cafe Maspero in the height of Mardi Gras and still was impressed with the fast serv","useful":1,"cool":1},"PEEzQ9UaeCZ5M-OR5j2Yqw":{"text":"Worst po boy in NOLA. Hard as a rock. No flavor. Server disappeared after dropping off wat","useful":4,"cool":0},"J2aCb6w6EQ4iwJWyTs7_4A":{"text":"Was pretty good. Jambalaya was just what I was looking for. Tip if you go to the bar you c","useful":0,"cool":0},"00jmE2uk9ucQv-SsCsrAmA":{"text":"Yummy breakfast. If your getting bennies and can't decide get 2 and share with 3-4. We lef","useful":0,"cool":0},"elLHNlEqUOp_4Or63_ChYg":{"text":"Literally just watched the waiter blow his nose and then immediately grab plates from the ","useful":2,"cool":0},"QFok3rZYj9DsoqvEwnEy6A":{"text":"The grilled cheese was mostly un-melted. The fries were okay. It's a tourist-y restaurant ","useful":1,"cool":0},"TQ7gPhaqyF48NWpHG2ej2g":{"text":"As one who's lived here all my life, I've eaten at thousands of restaurants, including Mas","useful":1,"cool":0},"Qt6_0H4bb-iCrwMnl63l3g":{"text":"Great Food and Service! Renee was our server and she was amazing. The Garden Veggie omelet","useful":0,"cool":0},"FaYA4bCA3m6k8pbyJFYn9g":{"text":"Heard this place was good and everyone said that cafe beignet was horrible. So me and my w","useful":0,"cool":0},"fziJ72cbMcHtCPb6cU90IQ":{"text":"We went in for a quick lunch and had the best muffaletta ever.. Our waiter Tony gave tge b","useful":0,"cool":0},"Rjfwq_vQQtYpNtGUrJsEDg":{"text":"This sucked. Majorly. The French fries came out cold and obviously were prepackaged and fr","useful":1,"cool":0},"i5k95QMVGJnjb-34MHH19g":{"text":"I was in the area for some tea when my friend and I decided to eat something close. We wer","useful":2,"cool":1},"sUkhLQ9Vvxj8tDUHn1u2QA":{"text":"This place was just OK! We needed somewhere to eat pretty quickly and this place had the s","useful":0,"cool":1},"efnN3UXYzB2zj2YVLxjVGA":{"text":"I'd been going to Maspero's for years and always loved it. I hadn't been in over 10 yrs be","useful":0,"cool":0},"j4AMLwd825WLfFv1vlGtaQ":{"text":"What a disappointment. Got a table quick but was invisible to the wait staff. Crowded but ","useful":1,"cool":0},"kNY_fVy0uwCjgt7xaByA_g":{"text":"This place was amazing service was the best our bartender Katonya  treated it like it was ","useful":0,"cool":0},"G0p_6ohEoxM4Z6j-4Ruzaw":{"text":"Begin ordering breakfast this mornin, food looked presentable. Ordered pancakes. Halfway t","useful":2,"cool":0},"Lyjiq6eha_W-xL-HsN1fNg":{"text":"The service was great. The waitress waited on us hand and foot, Angela Dennis. The food co","useful":0,"cool":0},"zxEPe9r3f7LgPHtFune8QQ":{"text":"My boyfriend and I dined here tonight, was really looking forward to something different t","useful":1,"cool":0},"vzdjhwianUAxe6CwDHCmKw":{"text":"Bad bad bad \n\n\nI have been going here for more than 20 years.\n\nThey closed at 9 and I got ","useful":0,"cool":0},"Pv7mC9sOaApIJ2vaotJwdg":{"text":"Amazing food, great customer service and always around if you need anything! I would recom","useful":0,"cool":0},"LTXIXZtoKv2R8sfoYN5lGw":{"text":"While visiting New Orleans with friends, they recommended this Cafe Maspero.  \n\n\n\nThey had","useful":2,"cool":0},"jKbnQBpMi6nRBouU4Mp2Pw":{"text":"We were walking in Decatur Street for some decent restaurant options. Cafe Maspero was mid","useful":1,"cool":2},"XYqP1rTm3w-zEPF2EL5tng":{"text":"We used to love this place dating back to 1980's. However as of recently I have been great","useful":1,"cool":0},"wACUrqa7SFVd-OmOLUOBCw":{"text":"I've been to New Orleans three times now. The first two trips did not really impress me as","useful":2,"cool":1},"UGxZJmVo-hxv1zn-7E0DDg":{"text":"I really enjoyed my dining experience. My Waitress Chrishonda was very knowledgeable of th","useful":0,"cool":0},"r5eI-hSjvSJow0GsC0BZLg":{"text":"I don't see why their rating is so low on yelp while other platforms have them rated highe","useful":0,"cool":0},"IovuaBb6_mcS9zDaR6wt7w":{"text":"Bottomless mimosas and eggs benedict to begin the day are a great combination for the city","useful":1,"cool":0},"Nk2SeWRREK8HKj-ygzZ19g":{"text":"j heard so much about the restaurant so  my family and i decided to eat there for the firs","useful":0,"cool":0},"rREXq0cNCFJEOVwnzN-GZg":{"text":"Great restaurant with open windows to the street.  The food was delicious and served in a ","useful":0,"cool":0},"C0yRAtjNbwphFOQToo9A_Q":{"text":"Waitress Angela Dennis was amazing! She was so friendly and gave us some awesome tips for ","useful":0,"cool":0},"q4b6l7jCvgxJVF4boJqPbQ":{"text":"What a shame! This used to be my favorite place to get a giant affordable sandwich with a ","useful":1,"cool":0},"BQ03SyTEW4gS0RQazaBh6Q":{"text":"I really enjoyed my experience at this restaurant. My server was the best, she was so poli","useful":0,"cool":0},"hj2H7o0FuGzPr91yI_TFqA":{"text":"I have been coming here for years when I visit. I was so looking forward to it again! I sh","useful":0,"cool":0},"jkTd9uOdg9fOel5nZuUjng":{"text":"I was meeting friends from NC for a birthday weekend when their flight was cancelled until","useful":0,"cool":0},"w5c5wCysKBiREXGWaTG3hg":{"text":"Great service and great food!!  I think our server's name was T?  We ordered some drinks a","useful":1,"cool":0},"W2FQUoE-_vwmuaAuCI2Uxw":{"text":"Terrible. Worst meal in NOLA, somehow the service was even worse. Save your time, money fo","useful":0,"cool":0},"StonAPxc8PWJhno-EV5e7g":{"text":"Super nice people but just terrible, overpriced food.\n\nCame for an urgent breakfast, and w","useful":6,"cool":3},"EHsd2Fmmn4fknYHXgm1e8w":{"text":"The food in my opinion was ok, nothing amazing just ok. We stopped here and tried a few di","useful":0,"cool":0},"i7WVA8ZS6LFp4zfp2OTUsA":{"text":"We waited 30 minutes for a huge empty restaurant to be seated, the staff was horrible exce","useful":0,"cool":0},"_DfeRRUie8q8Nghbd5cqWQ":{"text":"We stopped in for Happy Hour only to find that it was Wednesday, 1/2 price bottles of wine","useful":0,"cool":0},"3NOFC4HcwiA0-D3fwFAY2Q":{"text":"I stopped in here because Central Grocery was closed.  Waitress sat us down at a dirty tab","useful":0,"cool":0},"VQJjsF0sRrxKelV83k0vKA":{"text":"The food was good. Perfect for tourists doing tourist thing in the French Quarter area. Lo","useful":0,"cool":0},"cIVgnbd1yBxPmMy85h6Hmg":{"text":"This used to be a place to get a very Pastrami sandwich but no more. Went there recently a","useful":1,"cool":0},"x4eQKQ2p7zRLHi2OXjIrAQ":{"text":"Bria was a great server and made excellent recommendations that we enjoyed. Being from New","useful":0,"cool":0},"AHmgB7QAX-0PkUYYRArogQ":{"text":"The food is always good here but due to the location, it is usually overcrowded.  I recomm","useful":1,"cool":0},"zSI6hddAidnR7h4XXYhbIQ":{"text":"Excellent service and excellent food ! Waiter was courteous and very efficient and the foo","useful":0,"cool":0},"25-F6SOgPBvyWQTPJ5UfwA":{"text":"We kept walking by this place and seeing a line go out the door. Then we saw the special f","useful":4,"cool":2},"qM4wZFkPB0Z2xfceatshmw":{"text":"Overall, the food was alright but the customer service was the reason why I gave Cafe Masp","useful":2,"cool":1},"KYIf0dBQmiqeDtOYFwz28Q":{"text":"During a tropical storm, this place was a quick and easy spot to get a bite. I would say, ","useful":0,"cool":1},"9ZCpfnh-a4PdvBsCYTZV9A":{"text":"Order delivery of the bayou Benedict with jambalaya it was delicious! The jambalaya is exc","useful":0,"cool":0},"cbAn77SJB-tzUIRQpq6OYg":{"text":"This place is terrible the wait was said to be 15 minutes we have now been standing in lin","useful":0,"cool":0},"aYIbSlhMGQf7CofqSf3VYQ":{"text":"I got the seafood platter which included some fries. The worst fries I have had in my life","useful":0,"cool":0},"qLptAX68kC5u_MhFgcThqA":{"text":"This place was recommended to us by our Uber driver. While it wasn't quite as great as he ","useful":2,"cool":0},"mi3t6FMX4ecSSaYzFB1Vqg":{"text":"Excellent breakfast and very good service. You won't be disappointed. Great experience.","useful":0,"cool":0},"O3B8g80DtjUG2_pbk8vwjg":{"text":"I really wanted to sample a muffaletta but am vegetarian and a vegetarian version is hard ","useful":1,"cool":1},"1ttBjq-wzNEjozcjqHbiqQ":{"text":"This small place in the heart of the French Quarter has been a favorite on mine for over 2","useful":0,"cool":0},"eyqbSUUt-t30Lc85kmCjMw":{"text":"It wasn't all that. The sandwich was soggy and the fish dinner only had 2 pieces of fish; ","useful":1,"cool":0},"F1NYW_mpuNaL8v_p3HIvRA":{"text":"UPDATE: After leaving this review, I was contacted by the regional manager, who apologized","useful":0,"cool":0},"Zwy56FPPKK3vAjDO3qigkw":{"text":"Ducked in here during an afternoon of thunderstorms and had a totally okay time. The muffu","useful":0,"cool":0},"0wh0JN-bdZu1h0cCGolX8A":{"text":"I just came off the Steamboat NATCHEZ. I stopped at this nearby restaurant for lunch. This","useful":11,"cool":12},"1KRCdLTQZsjWmfna8C6OZg":{"text":"While in NOLA for Mardi Gras, friends and family suggested that I have a traditional local","useful":1,"cool":1},"Kuva5YYtdYzSLzwX4HU9lw":{"text":"There was a 30 mins wait for other the place semi empty... save your money go somewhere el","useful":0,"cool":0},"Pal20jnsVzjRizIXfNR4pQ":{"text":"Do yourself a favor and keep walking. There are plenty of good places to eat in NOLA, howe","useful":2,"cool":0},"roDw4MMkJzHP-Wq54tPa_Q":{"text":"As a lifelong frequent visitor to New Orleans, Cafe Maspero has been one of my favorite re","useful":0,"cool":0},"-Wlr21CLcXAR4A4_hXeIMw":{"text":"This place was probably the most affordable meal we had during our visit to NOLA and it wa","useful":1,"cool":0},"UjMWlbSSo8BIVzQBZSVP-A":{"text":"Very disappointed with the pastrami sandwich I had here recently (10-17-15). This was a gr","useful":1,"cool":0},"1mETAJJcyODnp4wwQJUvxQ":{"text":"Extremely slow service. Mediocre food. No vegetarian or vegan options.  Would not recommen","useful":1,"cool":0},"knZGaI_GelPiVxPofHXcZg":{"text":"The year was 2001. I remember taking lovely strolls to the French quarter with my parents.","useful":0,"cool":0},"ZVTKKbK4HgAK5dD_VydLRw":{"text":"My husband and I stopped in on NYE. They were able to sit us fairly quickly which was grea","useful":1,"cool":0},"Eb_8uGeljHq3lVIedxX2yA":{"text":"I've never had chicken \"nuggets\" for chicken Parmesan and then the server tried to convinc","useful":1,"cool":0},"I-vp61eS40k_uTlVd3E0IA":{"text":"We stopped by Cafe Maspero on a Sunday evening at around 7PM with hopes of grabbing dinner","useful":2,"cool":1},"tHX4oquCIU1VFccE-rs5DA":{"text":"My friends and I came to this place for lunch and waited in line outside for over an hour.","useful":2,"cool":1},"Jc-mPyOSQDY0UsuExfR70A":{"text":"Waited 12 minutes to be acknowledged at the bar. The girl didnt look my way once. Wanted t","useful":1,"cool":0},"fE2Ut-iCPzS3SQKkW5NGwg":{"text":"Great spot to grab breakfast in the quarter. We had an hour to wait before our grey line t","useful":1,"cool":0},"YgjFj6BlY70n8DBG6ZU71g":{"text":"Tourist trap is all that I can say. We ordered the pastrami and that was supposed to come ","useful":1,"cool":0},"6NlaLwBah_U8l0QiF5p-og":{"text":"My family is from New Orleans so we know good cajun food! In the quarter you have to expec","useful":4,"cool":1},"v6S2JD2gQiYtN_IPwDjwWg":{"text":"This is not a place to come for fine dining.  It is a place to come if you want a lot of f","useful":3,"cool":2},"GokTcKS4RuEpv8vsMB7pSg":{"text":"Since I'm here, I told my buddies that  I needed to try some alligator. Since we were at t","useful":1,"cool":1},"0wVoL3RkzuYw0tYUa4vZJQ":{"text":"We were visiting New Orleans over the weekend for my 50th birthday and decided to eat brea","useful":0,"cool":0},"P-oLud0bOwE4qdLGD0EfFA":{"text":"I have to be honest, my SO, her best friend and myself did not enjoy the food or restauran","useful":4,"cool":0},"Dlk-SY1fmBcIdOxfCQe9wQ":{"text":"Great location near Jackson Square. Stopped for breakfast yesterday. Not very crowded when","useful":1,"cool":0}}