{"YlQd0RtGdzwFclm3li9-MQ":{"text":"The menu is fantastic and it was hard to choose. In the end, I didn't have a huge appetite","useful":0,"cool":1},"mYGGPpF8YemLJjLcxoJE2g":{"text":"While on vacation we had just finished a Garden Tour (Free Tours by Foot - AWESOME!) and d","useful":0,"cool":0},"3NdktnRPAPcZIP00DdSaDA":{"text":"Wow what a great experience for our party of 9. Service and food were spectacular. Everyon","useful":0,"cool":0},"p3b6xrWjFLLbih3rzVt_NA":{"text":"Sweet Potato Pancakes were amazing . I didn't even need syrup ! The bacon was thick cut an","useful":0,"cool":0},"HbOOQib25kM2qPL-7N3jUQ":{"text":"Amazing! We had the ahi tuna crisps, meat balls and Mediterranean plate for lunch and all ","useful":0,"cool":0},"lgtlrApblh2O_Q0GJZqJHA":{"text":"Stopped in for lunch and the service and food were awesome!! I highly recommend the Turkey","useful":0,"cool":0},"HArZQvaJyrT0yOUID4GY6g":{"text":"This is one my favorite places to have breakfast.  Great food and the pancakes are the bom","useful":1,"cool":0},"lN0z2r3IhjT6a_iIJcLmuw":{"text":"Best eggs benedict I've ever had!!!   So great.  And amazing service.  I will be back for ","useful":0,"cool":0},"NJsqxRxZHzf7oSU1AIxF6w":{"text":"Enjoyed the patty melt while my fiancé got the bbq chicken pizza. Loved the shoe string fr","useful":0,"cool":0},"-uT2cloGTokZJdjQbCZPjQ":{"text":"We came here for brunch, as it was recommended by one of the artists in the neighborhood a","useful":0,"cool":0},"VVm6XgVkZ7mqwhy0Iq9FEQ":{"text":"My fiance and I visited New Orleans this past weekend. We decided to take a Garden Distric","useful":0,"cool":0},"MZdoj01Zsrd5CHP54pvZaw":{"text":"One of the top 2 meals during out trip. Went in for breakfast and we were the only table t","useful":0,"cool":0},"upODqoWgFebwcAY4n-nz0A":{"text":"Service sucks...Sam only cares about a table of young women. Don't know about the food bec","useful":0,"cool":0},"0mXmXxoKU9MBD9gv9hOupQ":{"text":"Their bloody mary was one of the best I had while in New Orleans!","useful":0,"cool":0},"hSp0-o8Uq2hsaRsb2JPPVw":{"text":"Stopped in for lunch.  Breakfast is served until 2pm.  It was crowded, but we were seated ","useful":0,"cool":0},"BnzZCf8GzaNsPv4onvHoog":{"text":"Had a fabulous dinner tonight with friends.  We started with the fromage plate which had a","useful":0,"cool":0},"fi8pReokAZ2JwLisGj0vVA":{"text":"Wonderful place for brunch! We visited New Orleans for three days and the drinks here are ","useful":0,"cool":0},"ps4Y_odwZt3Lae6nZeUEKg":{"text":"This restaurant is great. The amount of detail that went into the design is fantastic. A l","useful":0,"cool":0},"579RxldNIG8g1TjyUkrAgw":{"text":"I came here for lunch with the friends that I was in town with. We had spent the morning w","useful":1,"cool":0},"eFGkydQer18oS9m-FCoh4A":{"text":"Love the vibe and the food. Can't go wrong with anything! Hubby gets the john smith breakf","useful":0,"cool":0},"YgmTtTG1K34_MufTd8aPLA":{"text":"Discovered this place after being quoted an hour and a half wait at a competitor down the ","useful":1,"cool":0},"rbnUXEWym5_9Vxfih46Kdg":{"text":"The shrimp and grits breakfast was amazing. Their Bloody Mary was very good and the atmosp","useful":0,"cool":0},"Z2gOHxmnGeVfwZJLYNiRxw":{"text":"When I walked in wasn't sure I could still get breakfast.... it was 2:00 pm the server sai","useful":0,"cool":0},"l1SPeo7KyPLCboqatyy7DQ":{"text":"Our new favorite neighborhood joint.  Great food that's different but not pretentious, esp","useful":0,"cool":0},"J1R0uggnQcNZ7_UMZ0zY_Q":{"text":"Sooooo good. Definitely an amazing brunch place. Would have been 5 stars but it's on the p","useful":0,"cool":0},"sgLiXoIjo341DZf3pPad9w":{"text":"Absolutely amazing! From start to finish, they blew it out of the park. The beautiful fini","useful":0,"cool":0},"p-wtnLM9CMCvXTy5hESK7Q":{"text":"I went there yesterday with my husband and it was amazing. The atmosphere was so cozy and ","useful":0,"cool":0},"M374Y9ImJQMKCpOHyJxjvQ":{"text":"Discovered this place today. Crab and bacon dip was sooo good! Awesome. I had the duck waf","useful":0,"cool":0},"4suaRida36oZbXb3DsFb-Q":{"text":"Terrific brunch. Bloody Mary's were good and spicy. Eggs Sardo were delicious. Unfortunate","useful":0,"cool":0},"n_Lc6RDoaSH5Au5Ea9ZTTw":{"text":"I was very pleased with my experience at Red Dog. I sat outside and the atmosphere was ver","useful":0,"cool":0},"fW_5FrZMkKZHOwlxP1iKSQ":{"text":"The build out is really well done and the space it utilized really well. The food was slow","useful":2,"cool":0},"Fr4hKVwbtynN-ZtGJU6m-g":{"text":"This was the best restaurant I have ever been to. It's a little touch of Brooklyn in New O","useful":2,"cool":0},"RgjGMPlVqR7HQf2C8aUpVQ":{"text":"Visited here with my family and everything was great from the food to the service. I can't","useful":0,"cool":0},"qeYntWxhc7srfHPIXtZNgA":{"text":"With a wildly creative menu, very reasonable prices and a great location, this place shoul","useful":0,"cool":1},"jA-YUh7F4TpD7nvWw9r50Q":{"text":"The restaurant has a wonderful atmosphere. During our wait, we went to the bar for drinks!","useful":2,"cool":1},"m1eG9rVa0t6LSgrClID42g":{"text":"They have a very extensive menu. It's great for times when picking a place to eat becomes ","useful":0,"cool":0},"MkezBjTTAq0EpNk-3geSEw":{"text":"I would have given it a 5 if not for my meal. My coworkers loved their meals of chicken an","useful":1,"cool":1},"rfPBLs2o0Kumcb0bQzHDlg":{"text":"We were a big party of 12 but they seated us together and we had an amazing brunch here. I","useful":0,"cool":0},"UMugU5TScGXAFzP_NQJiIA":{"text":"That was a surprising diner, the flavors are very unique and well thought of. It's a smart","useful":1,"cool":0},"acqKnVi4fRRP3AQyGGmmGA":{"text":"Drove over to Red Dog from the Northshore. Glad we did. Great food and very sweet waitress","useful":0,"cool":0},"z0IGSwRh7t8FXL9kJeKuOQ":{"text":"I had doubts about a new place being this good but they knocked it out of the park. Cute d","useful":3,"cool":2},"BhmmfhCdygBkIcYMW7Yb8w":{"text":"I'm very happy to have this as a neighborhood restaurant, because the food here is delicio","useful":0,"cool":0},"wIeU1MUgcJpbeYi-k_4XGQ":{"text":"I've only been for brunch, but I take everyone who comes to town for a visit here. The atm","useful":1,"cool":0},"UqbsUAvQYhnZiCerv9ql2g":{"text":"What a quint little hole in the wall - no really! \nRed Dog Diner/back alley is an \" alley\"","useful":3,"cool":6},"tmMHpNUjEy7kYsxqD2xojQ":{"text":"We first waited for over thirty minutes only to find out they'd forgotten about us, mind y","useful":0,"cool":0},"ohIpnQC2ENoCVUc4UEhi6g":{"text":"Scrumptious food, excellent service. We had tasso shrimp and grits with poached eggs - bes","useful":0,"cool":0},"rkwJabO4aa0a9OMF-MdmRA":{"text":"Got the crab and bacon dip and the shrimp and pancetta pasta. It was fantastic and so was ","useful":1,"cool":1},"dClb1FwV6g7FjBMHOPL9Ow":{"text":"I'm upset that I waited until yesterday to try Red Dog Diner for the first time! Have lots","useful":0,"cool":0},"49P6pzo1zE-4FmYR0OwmVw":{"text":"I don't see how this experience could have been any better. We walked in for a midday lunc","useful":0,"cool":0},"G5md3Mairh-xxxzxnAbnVg":{"text":"This is my new favorite. I'm always looking for a place in town with fantastic salads, and","useful":0,"cool":0},"a6Hl-odQ53kCCDCoWO_SNQ":{"text":"I'm very selective about my ratings and do not often give 5 starts, but I have not one bad","useful":1,"cool":0},"c9mPB-BzaFXzRNLCbBZ5QQ":{"text":"I LOVE everything about this place!  I was born and raised in Southern California on \"Sout","useful":5,"cool":1},"YjzB8AS8uJEaMwfjVtNG4w":{"text":"Great brunch very relaxed vibrant atmosphere \nThe crabmeat omelet is perfect. Children and","useful":0,"cool":0},"4KRBnqCuFC5Hg9MEy5wktw":{"text":"I must give 5 stars to this restaurant!! Great staff, delicious food, nice decoration, exc","useful":0,"cool":0},"ht1x-HEA3j-AztiWaeLVpw":{"text":"We were a group of five at this local restaurant. Their breakfast menu looked too good to ","useful":2,"cool":1},"IVkDIG5RtE4IAAdhZ6BEaQ":{"text":"I really appreciate  that everything is hand-crafted and made from scratch. The options ar","useful":0,"cool":0},"YWxoQf5KPmSeWs6LN1D7yA":{"text":"Great new addition to magazine!  They are still adding to/changing their menus, but everyt","useful":2,"cool":2},"l9JrzSHX5xpNI-SfC4wqdw":{"text":"Everything is delicious, and you can tell the staff take pride in their work. Supergood vi","useful":0,"cool":0},"D5peJps0-e0Icc5Bx2cmTQ":{"text":"We are tourists here in Louisiana and I have to say this was my favorite restaurant on our","useful":3,"cool":0},"hNTUPqq8ZagN5Kre1IhaQw":{"text":"This place is an absolute favorite of mine. I stumbled upon it two years ago& went back ju","useful":0,"cool":0},"9WFRGsguiTGoNFhkTAjfQQ":{"text":"Last week after taking my grand kids to the Zoo we stopped on Magazine Street for an early","useful":1,"cool":0},"Eb74JZYKdKySGa6Y84wRww":{"text":"Hope is one of the best bartenders we have met on this trip... Whatever she's making isn't","useful":0,"cool":0},"4B5AXS-if-O2jxfXahiSzg":{"text":"I feel like I say this a lot, but it really does take me and the boyfriend FOREVER to thin","useful":0,"cool":0},"uKEaXBdVjxhzBbtUTBxJWw":{"text":"Phenomenal breakfast. Great ambience. Excellent service. Vegetarian friendly. A must if yo","useful":0,"cool":0},"HpcNVUWt7WZW20AFPLGQPg":{"text":"We stopped here for dinner one night during Mardi Gras. The service was fast and the food ","useful":0,"cool":0},"SSBIXxWuoCIjjukPd-ynDg":{"text":"We stopped in to the Red Dog purely by accident and I'm so glad we did! From the signature","useful":2,"cool":1},"rBJ6gWHxx4ivKEIPdFI6bA":{"text":"Dude. This place. It's good. It's like perfect good. It's like a place where you want to a","useful":0,"cool":0},"XAjFbOzJY6qtBb0wnLSkWA":{"text":"The best breakfast I've had in a long time. So much flavor. And great presentation. The li","useful":0,"cool":0},"H-zFJ_iEMAsx9E-iAxzDow":{"text":"Went back Mardi Gras day. Place was jumpin' and we really enjoyed our meal again.... then ","useful":0,"cool":0},"Z9v7zeQPewqiqEFEYyw9Lw":{"text":"We were excited about trying Red Dog Diner because we love Rum House. We stopped in early ","useful":2,"cool":1},"F-37VqQf87MlPJzgXeDayA":{"text":"Beautiful decor, unique set up, warm and friendly staff (kitchen manager Lauren was so swe","useful":0,"cool":0},"vl81ILl0oUqa9Lb51KKJoQ":{"text":"This place had a super fun atmosphere and very nice staff. The food was good, but not expe","useful":0,"cool":0},"A-FJcZuP8sr3T3shESXPkg":{"text":"Loved this place! Literally every person in our 8 person group had a delicious dish from B","useful":0,"cool":0},"8_VAgREZq_1bBI_okGABjw":{"text":"We went here for breakfast. Holy cow, the food here is incredible! We waited about 35 minu","useful":2,"cool":0},"BAtb1YnKJ0Fl6zcpCJ25lA":{"text":"Honestly, I'm not even surprised by the amount of food I ate in NOLA because of all these ","useful":2,"cool":1},"sGMwNa_VgBsApmY8-v-00A":{"text":"My favorites are the crab & bacon dip, fromage plate and mediterranean nosh plate. I love ","useful":1,"cool":1},"DI4FjT5KHfgdZjvHVH6Dew":{"text":"I heard this place was owned by the same individuals that own Rum House and since I like R","useful":0,"cool":0},"NWVKWEiWebX5R1-pjWA7ew":{"text":"I've been here for brunch/breakfast tons of times. Not a big breakfast person but they hav","useful":0,"cool":0},"p-du_WZUiMOwQjN46beyxQ":{"text":"First time in NOLA and walked around magazine street this morning - came in on a whim and ","useful":0,"cool":0},"tXz5Zd02yHcytXV571cOvQ":{"text":"This is my second time here. They always have great food and drinks. Everything I have had","useful":0,"cool":0},"Dq0xFFD2l_rokUOqSnW8yA":{"text":"Loved this place! It's worth the wait if they have one. Friendly staff and food was delici","useful":0,"cool":0},"b4XrIp-F2OlTR9itgDuVVA":{"text":"So the service was slow and bit off putting. While waiting -- which felt like an eternity ","useful":0,"cool":0},"4_SrRMYHSkp7GUMXrBr-8g":{"text":"Wonderful and innovative eggs Benedict, corned beef hash, and one of our group had the chi","useful":1,"cool":0},"jYANzwfTzJYbEugSjfKsXQ":{"text":"Needed to find a lunch place. Really glad we found Red Dog. There was breakfast till 2pm o","useful":0,"cool":0},"rxhQFOZpyKCRJYMEKFrhOQ":{"text":"I went here today with a friend for lunch. We started off with the berry tea.  So refreshi","useful":2,"cool":0},"4ye4Om_S51mqTsphFR0Sxw":{"text":"Went to the bar in the back. Awesome atmosphere and service. Potent drinks and very creati","useful":0,"cool":0},"6m_MZaM-ywr5V-Tfa37Stw":{"text":"My family is visiting New Orleans and was looking for a place to eat in the crowded Garden","useful":0,"cool":0},"cyeILUODcR711Og1KEmB0g":{"text":"Awesome place! Fantastic food. People are all awesome there. Wonderful service. Great addi","useful":0,"cool":0},"82svYIkMhY1WUsoYEGiPSQ":{"text":"Tasty and original. Nice environment and good service. The back patio looks very cool alth","useful":0,"cool":0},"AoRqRFLTwGxLVD7ddpc0sw":{"text":"I love this place.  The food is Awesome, service is the best and a great space to hang out","useful":0,"cool":0},"C3oKKpE4Pix6VOy6HKJgRQ":{"text":"Love this place!!! The food, service & atmosphere. My family came here for the first time ","useful":1,"cool":0},"1yX6mcyzc880oE-BXwlAEw":{"text":"I came here for brunch on a Friday. It was easy to find seating and the service was quick!","useful":0,"cool":0},"5jOuBH9W-LAgqgeB3AMuSw":{"text":"Consistently delicious food. Very nice decor. I've only been for breakfast/brunch but I've","useful":1,"cool":1},"mdhv43y4QiZUH_DAH6YYOQ":{"text":"Best food we've had in New Orleans so far!  I've been to the area three different occasion","useful":1,"cool":0},"o2WKEaRqD4j1HnJnmvxkdw":{"text":"Great food, great decor, great service.\nLoved everything about our lunch experience here. ","useful":0,"cool":1},"FMgNU-vX2QnjHa2R4bn6nw":{"text":"Pecan crusted chicken to die for. Huge portions. Banana cream pie delicious! Great space i","useful":1,"cool":0},"_FYwWKZLhJ6X0zmf3cZIlw":{"text":"Walking up Magazine my hunger was getting the best of me.  When I was passing Red Dog Dine","useful":1,"cool":0},"wUvNlzq_l7liIveAfXYWFA":{"text":"It was alright. We came here for breakfast on a Saturday morning, it wasn't too terribly b","useful":0,"cool":1},"r_br5OkcQ2xh3PXox63TkQ":{"text":"Excellent Comfort Food! Everything I've tried has been fantastic from Breakfast to Dessert","useful":3,"cool":1},"5qU2KNh2Vnt4CMs6REATfg":{"text":"My first thought was what a great use of reclaimed materials! Really an interesting lookin","useful":0,"cool":0},"FDrUmGHqFbNZYZH1AN1iWA":{"text":"Have been here a couple of times for dinner.  The food is super yummy and the drinks are a","useful":0,"cool":0},"IumlxzXEQU5AdCKs8uo_5Q":{"text":"Ordered sweet potato pancakes. Got burnt on the outside, way too gooey on the outside mess","useful":0,"cool":0},"YaXEE_sULjyli_9JNujfGg":{"text":"Ordered pizza, garlic app, arrugala salad and was super happy. Good size portions,!friendl","useful":0,"cool":0},"Rp9n75iZKHkpkwh093pZ5Q":{"text":"While shopping on Magazine, my friend and I decided to try out this place. We knew the sam","useful":4,"cool":0},"VtAcmHPa1TCbYDFvTpWTRQ":{"text":"Don't let the word 'Diner' confuse you. I live in the neighborhood and eat here often. The","useful":0,"cool":0},"mo66lRCVCqU_UBWzEXpH9g":{"text":"Food was fantastic!  Service...not so good.  Service was slow (restaurant was not busy), I","useful":0,"cool":0},"pYdVc6pLFkBz2C2prOqmGg":{"text":"We walked past on Saturday night and saw they were open for dinner. We decided to give Red","useful":1,"cool":1},"DaHb4bG7exjhvzOpTfaKKg":{"text":"I found Red Dog looking for a restaurant on Yelp, and Yelp's great reviews didn't steer me","useful":1,"cool":1},"qSiBTudeuyOMs2CiUGEFuA":{"text":"Visited about a week ago and can't wait to return.  Located in a nice area with shops and ","useful":0,"cool":0},"fIXhYvqW-DYSOEW7Y-AXTg":{"text":"Everything we ordered was delicious!\n1. Crab & corn fritters: kind of like a hushpuppy but","useful":0,"cool":0},"carrOK929-Kud_x26Sjf4Q":{"text":"An awesome addition to the neighborhood. Wish they had more tables! \nI appreciate their us","useful":2,"cool":0},"8We1APlChIyIRHvmd461gw":{"text":"Food was very good! Service was great. Atmosphere was nice. I will definitely eat here aga","useful":0,"cool":0},"B_miqnlA7Jjamog5CRdAZg":{"text":"Large menu with a ton of unique combinations. We had just finished a walking tour in the G","useful":0,"cool":0},"OzLvebL_Aa5uNIVq2P80LA":{"text":"Drinks were great! Service and food is as very slow, even though it as a low time of day. ","useful":0,"cool":0},"foFjgLQVs1v_ODf-TtS3jA":{"text":"Came here for the first time with my girlfriend and man, we made a good choice. Long story","useful":0,"cool":0},"lyLCJiNXt9kHJi2BPczdcQ":{"text":"Great place for casual dinner. The roasted beet salad and Parma Sean crusted chicken with ","useful":0,"cool":0},"UuVUd2js6OhBXUysZKW3yQ":{"text":"Great experience. Solid overall customer service and the food really made our first dining","useful":0,"cool":0},"M3ectYNP5ROt8l9c9xJ11g":{"text":"Yum! From the simple turkey club to a shrimp bacon pizza. The turkey club had a side of cr","useful":0,"cool":0},"dYH6Ul5FQKo7thWmhYQ2GQ":{"text":"A must stop in the Garden District! My quest for the best Bloody Mary in NOLA has succumbe","useful":1,"cool":1},"bvim4wKLoODGMnZbkQ1pMg":{"text":"Went for a late breakfast before the crowds hit, I had the berry waffle, delicious with it","useful":0,"cool":0},"N1002wnaX5v97irMEGHMug":{"text":"It so frustrates me to write this! Over the last few months this place has changed. This i","useful":0,"cool":0},"OBVDMnjxD1iQSM-WtF-ZBA":{"text":"Good food, cozy environment, and seemingly a lot of hot men frequent it here. Everything w","useful":1,"cool":0},"XjSjm3oIMOLaNF_YCqiCCg":{"text":"This place was absolutely fine, leaning toward good, but it didn't quite meet the hype. Th","useful":0,"cool":0},"AxouP-huDvRmb5co5K1TTQ":{"text":"Today is day two of eating here. We are addicted to the blueberry pancakes! And when I say","useful":0,"cool":0},"_2VMBXUlYa7UxObHB5eJYA":{"text":"The duck waffles and deviled eggs were amazing!!!","useful":0,"cool":0},"3M6BmPUF8N1Z_nMKW1FmIQ":{"text":"Oh Red Dog what happened to you? \nI should preface this by saying I'm a local. I live very","useful":4,"cool":2},"K9Tr53Q8zdGorI8S1EHeSw":{"text":"This was our last food stop on our New Orleans trip full of awesome food, and a great way ","useful":0,"cool":0},"Iu_gIppb5f0peKU9ZXcGlA":{"text":"Whenever I'm in NOLA, I try to find new places to eat. Because when're I visit I always te","useful":0,"cool":0},"NWWcha4aSyXGQgGis---Pw":{"text":"Looks very unassuming but the food here is wonderful!  We dined for brunch this morning an","useful":0,"cool":0},"qYWJTmClStiHo1rDSV3bug":{"text":"So good! The shrimp and grits were delish, and I wish I would have gone for a Bloody Mary ","useful":0,"cool":0},"uQPPsdnNNJOm6XXm8D1TrA":{"text":"Place is a lot larger then it seems from the front! It was so cute inside! The service was","useful":1,"cool":0},"Mu8lD6p3HXVqhs242I_4Xg":{"text":"One of the best meals we had while in New Orleans!!! We had a group of 8 and everyone love","useful":2,"cool":1},"SEYGDP3FihevT6NNb16fcQ":{"text":"Had the Very Berry Waffle.  Freakin awesome.  Very cool place in a great neighborhood.  Gr","useful":1,"cool":0},"bN7c0lDKfyGY2Gne9jG6yw":{"text":"My friends and I decided to check out this place after shopping around Magazine Street. Th","useful":0,"cool":0},"7cyF8smiG67BGJP1v5wgFw":{"text":"Very cool vibe.  Arrive early on Sundays before 10 am to avoid the line.  Sadly, the shrim","useful":0,"cool":0},"zqI1CHm_AdZb_pSpch14vA":{"text":"I just love this place soooo much. I've been to Red Dog about 5 or 6 times already and the","useful":1,"cool":0},"lto59PDmgWPLI1Thb1AQBA":{"text":"I looooooove this place. Perfect for night shifters. The orange julius mimosa is amazing. ","useful":0,"cool":0},"DJ2E2uWCfoG7kSaLHjn2IQ":{"text":"Great food and great service! Highly recommend the parmesan crusted chicken for dinner.","useful":0,"cool":0},"2bImE42c--NoIW6ZIzEc2Q":{"text":"Well worth the walk! Food was delicious and beautifully plated. Drinks were strong. Overal","useful":1,"cool":0},"VDUiNZs2-BNQinGRQPsApA":{"text":"Everytime I come here, I try and chose something different and have loved everything so fa","useful":4,"cool":2},"PfPKQ3MEtEt-TxBYx4FGtg":{"text":"UH-MAY-ZING!!  We walked past this place once & thought it was a cute little coffee shop u","useful":3,"cool":0},"JzPGThSVWuXvGkR2yGDh_w":{"text":"Went on a mommy daughter breakfast date... So yummy! And our waiter was so nice!! Loved th","useful":0,"cool":0},"KprW2DYlFtjQO2YOTtA-1A":{"text":"Although the service was not the best, our waitress went out of her way to make the meal e","useful":0,"cool":1},"bSSTu2Yr4zA2VFGmaETJJA":{"text":"Cute little place next to the Rum house on Magazine street!   The section in the back is s","useful":1,"cool":0},"GDdF7dv9_mfkct9R--fAVg":{"text":"I would probably give this 3-1/2 stars. The restaurant itself is clean and trendy. The ser","useful":0,"cool":0},"GFsB0lMGhDA36u1QVjuK7Q":{"text":"So glad to see the RDD getting such positive reviews. My husband and I strolled in here th","useful":0,"cool":0},"FhBWjYlvsmDu2Na_0gihxg":{"text":"Stopped in here the Red Dog Diner on a whim walking down Magazine St. and boy oh boy am I ","useful":10,"cool":10},"Tpvly8UqSHJOWj8PkRNX_g":{"text":"Great meal and drinks at the Red Dog Diner. I had their blended coffee cocktail and it was","useful":0,"cool":0},"d7JWzXIynDGFTvR4FW2t9Q":{"text":"My favorite happy hour in town and both food and drinks are delicious!\nThe ahi tuna crisps","useful":0,"cool":0},"fxLJskhtK4bM2yjbG1mn-A":{"text":"Have you ever had a dining experience so good that you literally wanted to grab passersby ","useful":0,"cool":0},"TBewij2p9Po8LPBRlMVZPA":{"text":"A little slow going at the front bar top at first, but the food and drinks made up for it.","useful":1,"cool":0},"vuS4ZbKiiezu2xkiXR52cg":{"text":"LOVED IT...!!!\n\nYummy apps, really good drinks, attentive service, fun place in the Garden","useful":0,"cool":1},"zOekEZ87zqjFSMDLRmzV6g":{"text":"Love this place on Magazine! Delicious Fromage Plate to share; comforting Bolognese pasta;","useful":0,"cool":0},"nvZXwGXh9BMBxytyXIe_Gw":{"text":"Another find out in Garden District.  Breakfast sandwich and best crab eggs Benedict in th","useful":0,"cool":0},"3I49PpggPCRDcOYbliKjxA":{"text":"After doing everything we possibly could in and around the French Quarter for 3 days, my f","useful":1,"cool":0},"BZl67_wpZ_dtH4IkMgPM9g":{"text":"Amazing food! This is a great lunch stop if you are in the area. Very fresh ingredients an","useful":0,"cool":0},"OzcJJJwryPTb7WEZ-b46Zw":{"text":"In town for the Sugar Bowl and made it over for breakfast.  Definitely a great local place","useful":0,"cool":0},"y9HsP8KvXHyHQe0XN1Ntwg":{"text":"It was recommended to me to try this New Orleans creation called Eggs Sardou at Tableau, b","useful":0,"cool":0},"IDFt6pD96VbmzZlVezeTrQ":{"text":"I tried this place for breakfast based on the good reviews, but I was very disappointed.  ","useful":0,"cool":0},"Re99QprXik225Murw6_b2Q":{"text":"Great spot for breakfast or brunch!! One of the best bloody Mary's I have ever had.  I had","useful":0,"cool":0},"aLvsmvN-24ekKsDc0m6YOg":{"text":"Excellent service, super clean and nice ambience.\nFood was outsta2, till dessert came. Big","useful":0,"cool":0},"CgRcYI2f2J1BRyGYIT5Egw":{"text":"What a wonderful breakfast at the Red Dog.  Corned beef hash was probably the best I've ea","useful":1,"cool":1},"Kf11_ecR9c3NjOdnlt90MA":{"text":"We came here by accident as where we were going was closed ... food was delish and we will","useful":1,"cool":0},"i3e_5GOnJZZI07Pt7XpRlA":{"text":"A great find. Lovely atmosphere and delicious food. My shrimp and prosciutto pasta was del","useful":1,"cool":0},"3Md7Db8yv3K57d0-ATOJYA":{"text":"We can't judge this place based on food, because we just made a quick stop here to get dri","useful":0,"cool":0},"Ubee7SknxFLrwoqm8A9kiw":{"text":"If this place could get 4.5 stars it would. \nI've never been here and sat outside, but was","useful":5,"cool":0},"-W5H2GY55irAgh_tIQKYUQ":{"text":"Ashley was terrific!!! We were just walking down the street from our Air BnB and saw this ","useful":0,"cool":0},"LuN0P7HZ71jVWpPHnVHLcg":{"text":"Went for dinner our first night in NOLA at the recommendation of our traveling buddies (al","useful":0,"cool":0},"sjhdZfZZKoi7SDp2V45xpA":{"text":"Absolutely love Red Dog!!! The best spot on Magazine St for brunch, lunch or dinner :)","useful":0,"cool":0},"oWWW8UUHihrudajher-iwA":{"text":"We were here for the first time for breakfast and it was great.  They know how to cook ove","useful":0,"cool":0},"ZygREj_jl-3UZ5awiOSNnQ":{"text":"This was one of our last outing in NOLA before we depart back to our homes. We were explor","useful":1,"cool":0},"2xL9_3CHIYkQhH2OABmvNQ":{"text":"First time in- came in with no expect ions and WOW! Seafood chorizo bowl was amazing! And ","useful":1,"cool":0},"piXLL6W19UcrLYIsOlp6IQ":{"text":"We had a lovely time stopped in for a quick drink and ended up enjoying your happy hour sp","useful":1,"cool":0},"fPdSBwAityT9X2zTb1igow":{"text":"Happy hour!\nUber after a visit to WW 2 museum to the diner for happy hour was so worth it!","useful":0,"cool":0},"KTqKEyoUQRVywTnsWRtvfg":{"text":"I ordered the Eggs Sardou and it was phenomenal. The flavors are on point and the presenta","useful":2,"cool":1},"3Stv9X5rLEj8V8ZeB-9tyQ":{"text":"My friends and I visited Red Dog Diner during a Mardi Gras evening. Despite it being a Sat","useful":1,"cool":0},"A82lgSZ-K8neZLHSB1nHsQ":{"text":"This place was a pleasant surprise!! Great seating on magazine street, wonderful for peopl","useful":0,"cool":0},"GzoJ6tmk0dqyS1oTcaH_LQ":{"text":"First time ever at the Red Dog and I will never have one single complaint about this place","useful":0,"cool":0},"RMEzycw_asjGh1vIP_lG4Q":{"text":"Loved the food here! We were seated quickly and were well taken care of. I had the sweet p","useful":0,"cool":0},"Kd7DLzkFtOy4ZmAiLXcU9g":{"text":"Wow!!! Amazing place...Amazing food...Amazing service!  We stumbled upon this place and ha","useful":0,"cool":0},"TK8iFgfIQajXIZSW0TBE7Q":{"text":"Good food, great atmosphere, and wine that comes in kegs? Heck yes.","useful":1,"cool":1},"UgdO-PiB2T4xLDv1LFl2NA":{"text":"Excellent lunch menu! The smells alone will get you in the door to your seat but the food ","useful":1,"cool":1},"mU0Xn9LE-MQEVGrTdW89_Q":{"text":"I stopped by here after doing a Garden District tour, and I am glad I did!  I had found th","useful":2,"cool":0},"RmqscRJw2DYcEt7Ml5i84g":{"text":"First time here and wow!!! Up north needs more places like this .... unique.. great portio","useful":0,"cool":0},"bOnM1AYBVkOisXaVtHvZDQ":{"text":"I came here over spring break and the food was AMAZING! They were very accommodating and e","useful":0,"cool":0},"qlAI-q7tapmEfOVZioEK0A":{"text":"Loved this place! We went on Mothers Day for brunch & found a seat right away at the back ","useful":0,"cool":0},"Un-yJqRvqrYnB81wbo3IrA":{"text":"This was one of the best Bloody Mary's I've ever had!  Try the pimento cheese spread, fabu","useful":0,"cool":0},"A3B2AgKHzQ637Qf3lM2MfA":{"text":"We were at this restaurant last night and it was great.  Server was very friendly and acco","useful":0,"cool":0},"ZkD_DMZVjALOMZCMth1D9w":{"text":"Love, love, love. \n\nAway from all the crazy near the Quarter. A cute and cozy sit-down pla","useful":0,"cool":0},"US1QTUw3f8gdJK2GcHfDTg":{"text":"This is a cute little spot that opened on magazine since I moved from Nola 2 years ago. I ","useful":0,"cool":0},"W0w32_AcXQFiV_n_wLrURA":{"text":"The bartender, Keith, was the best. He made us feel like locals even though we were visiti","useful":0,"cool":0},"g0aOqewV60z0GcYgghiSFQ":{"text":"Stumbled across this place in the Garden District.  The decor is sort of chic-barn, with o","useful":0,"cool":0},"3zfg5z0QMOAktE4LJ0xGvQ":{"text":"To start off this is the only place we've visited twice for our five day trip in New Orlea","useful":0,"cool":0},"SfvBUbHsRjgInjSHKmJD7g":{"text":"Paul at the back bar was great!  The drinks were great and we enjoyed the fries too.  Wort","useful":0,"cool":0},"ePkdcVRWYdb9_c4JPwDJvQ":{"text":"Amazing! Wow, loved it! The hipster is a delicious plate! My gf got the prime rib and it w","useful":0,"cool":0},"e3-GbRCBWpyAz6TVIItHWQ":{"text":"All I can say is wow. Get out of the craziness of the French Quarter and while exploring t","useful":0,"cool":0},"wW-JR4vZXnK0T3_j-sZ1vQ":{"text":"My friend is stuck in that loop where he wants to try something new, but he loves the Sear","useful":2,"cool":1},"_Ds6S5Yi0JhL4FARlIyWKg":{"text":"No complaints. Everything was good but nothing stands out either. The part of the restaura","useful":0,"cool":0},"v8DLcSIdUxcQM_3EZNy8RQ":{"text":"This food was amazing! The best meal we had in NOLA by far. I had the chicken pasta and sp","useful":0,"cool":0},"EEnW7MKT5tANLBUKiqR6Og":{"text":"This place has been bookmarked for months and because of the awesome reviews I've read, I ","useful":0,"cool":0},"A8c1ueZRQFdmKY4oM0jyHA":{"text":"We had the beets and goat cheese pizza, salad, and crab dip and they were all delicious. T","useful":0,"cool":0},"CsgG7RDgGzrU9GlNa8Buxw":{"text":"I've been here a few times and am never disappointed! I absolutely love their version of a","useful":0,"cool":0},"ph11Pbr3auRnY3sz27rl0w":{"text":"This place is awesome. Great service and food was amazing. The smoked mac n cheese and san","useful":0,"cool":0},"JCBuIgAuYb8o0Vj8Heb3gA":{"text":"My friend and I came here before the Neil Diamond concert! \nWe were pleasantly surprised!!","useful":1,"cool":0},"a2U_7o0hXirPEJyMWMzptg":{"text":"I went here for brunch with some friends as we were leaving. I had the crab Benedict with ","useful":0,"cool":0},"KMecu1sS4kuj_GQoC43qyQ":{"text":"Best breakfast on Magazine Street.  Classic New Orleans brunch items (with a twist) along ","useful":0,"cool":0},"HoNFmdAMKm0lxjLY7yXCww":{"text":"Down in NOLA for the weekend and last night ran into a local at a bar. Asked him for recom","useful":0,"cool":0},"3Ej_sYOZq9l-GA2LYVrwBA":{"text":"If you come to Red Dog and don't order the blueberry pancakes, you are doing yourself quit","useful":1,"cool":0},"kC50mVt_H_Y37oFDj1Y6eQ":{"text":"Fantastic food and service. Everything ordered was perfect and our waiter was very attenti","useful":0,"cool":0},"1l-qGPNYReMfsbFHaumTZA":{"text":"What a fabulous surprise! The food was great and the service was better! Met for an early ","useful":1,"cool":0},"B9PdolLa61HMw9g7y34mFg":{"text":"Wow!  What a difference a day makes.  I was here for the first time a couple days ago and ","useful":2,"cool":0},"v72QYVlMgUViMff3-bZtJg":{"text":"Very disappointed, as I had a great first few experiences until lately. The standard has d","useful":0,"cool":0},"Affu-ZGIuEvtk5rPnuQS7Q":{"text":"Heard amazing reviews on this restaurant owned from the same sister company as The Rum Hou","useful":1,"cool":0},"E-zBWj5Udzmn5g37acmbiw":{"text":"Loved this place! We stayed 5 blocks away in an AirBNB and came here because of the Yelp r","useful":3,"cool":0},"938_beLn8h1p3luUGeKCHQ":{"text":"This place is great! it's a little gem in the garden district. The beet pizza is the best ","useful":0,"cool":0},"GpjrotTbnrzdbewELUm7zA":{"text":"What a great find! After a walking tour in the Garden District we took a chance on this sp","useful":1,"cool":0},"Xho-Rx75Cyisa-nKA1L6nQ":{"text":"Excellent place in New Orleans. Hip, clean, great service and great food. Will return for ","useful":0,"cool":0},"1yHg7uMvCcKlTGSZ-r1DZQ":{"text":"I didn't have drinks here but the breakfast really was very disappointing for our table of","useful":0,"cool":0},"PFg0B_hyTMs71UcnYfsQMA":{"text":"Excited to find a place that does breakfast until 2pm everyday! I got the \"insert hipster ","useful":0,"cool":1},"IBsiWpcJy1YDPPgSaOobRg":{"text":"Great new restaurant on Magazine.  I had the duck diablo soup with poblano polenta crouton","useful":2,"cool":3},"PaLUvPZBfWPkMBtaayRGbw":{"text":"Great place and glad I tried it instead of my usual brunch location. Tried the sweet potat","useful":0,"cool":0},"Q4LuRg_n_DlirQ2AEne6gw":{"text":"TL;DR - the food here is incredibly delicious, but the service was so poor that you're bet","useful":1,"cool":0},"kGv5KL9wWBq2outU-4Zw0w":{"text":"Really nice place to grab a drink and brunch.  Ran by the same people that run Rum House. ","useful":0,"cool":0},"Y3ZK1DJcQENCn_N6ETvJcg":{"text":"This place is legit.  Won't overdo it with a long review but got the rueben, pattymelt and","useful":1,"cool":0},"nXc46kKyH4SMBKbugEJzhg":{"text":"BLUF:  (Lunch/Dinner review)  I hate to give it such a bad rating when we have heard such ","useful":1,"cool":0},"sY8W4TCwbcKsxiQvcv7TcA":{"text":"Incredible food!! Effen good shrimp was great!! Huge shrimp!! Service was impeccable.","useful":1,"cool":0},"hZqII3pX35rSLDEgcb0dAg":{"text":"The service was slow. The kitchen took forever. It was full but not busy- just steady. The","useful":0,"cool":0},"nJwbZZu_QjVM_05NEMQc3w":{"text":"When she put the bowl of Prime Rib Benedict down in front of me, I nearly cried.  And when","useful":1,"cool":1},"viEMrbDwtRvKXRaElVndgw":{"text":"Delicious!\nIt's a hidden gem in Magazine Street! Walked around until we came across it and","useful":0,"cool":0},"QPA1jirEnW2U76d7wfpIBg":{"text":"Solid Meal. Saw it while we were driving through Magazine. Noticed it was new. Got the che","useful":1,"cool":0},"nkd8GeJX3C-tY1vLrbyBeA":{"text":"Extremely good. This was my first trip to Nola and because of this place I'll definitely\nC","useful":0,"cool":0},"Lc0VwRZ9uMNPSF34jMcMLw":{"text":"What a pleasant surprise this place was! I hadn't heard much about this place, but I love ","useful":2,"cool":0},"bWP0TMXJ-3O890A_zQZFcQ":{"text":"Loved everything about this place! Super yummy food. Amazing service. Alysa our server and","useful":0,"cool":0},"B51zgjkae28GxsM34mDXEg":{"text":"Went for Sunday Brunch. Pretty long wait for a table, but the food looked really good so w","useful":0,"cool":0},"VWGU6VcH8WjYmSPogh7-4w":{"text":"Amazing food! Great service! Will return when back in New Orleans. The patty melt and brus","useful":0,"cool":0},"8pHCj5IgUFxfVrQa-964bQ":{"text":"The easy going staff here is what makes for a great experience. The food is always correct","useful":0,"cool":0},"lcjC7UFx9KEK-SrCOddgIw":{"text":"The Beet pizza was delicious! It was loaded with beets, goat cheese, spinach, grilled onio","useful":0,"cool":0},"mHVgfmcNqG8F6G65xSd4Cw":{"text":"Lots of options without feeling overwhelming.  Friendly serving staff and delicious food. ","useful":0,"cool":0},"nrDdKM9s5zH4U_8SscG2Yw":{"text":"5 stars for service. Our host and waitress were attentive and super friendly compared to o","useful":1,"cool":0},"ehOxAWXjzVMTHspXio2QEQ":{"text":"This place was great! They were so accommodating for my sister and her 2 baby boy when she","useful":0,"cool":0},"bSJK64UIHFRcYdixnNjaow":{"text":"Went during July 4th, sat outside.\nEveryone was attentive, don't be in a rush if you go he","useful":2,"cool":1},"ildGN0TgEe_4y4a7kqLEaw":{"text":"Yum! We were turned away from an empty restaurant down the street because we did not have ","useful":0,"cool":0},"FHnM6MJahCI9PlRe229SaA":{"text":"I really like the atmosphere of this place. It has a great farmhouse friendly feel to it. ","useful":0,"cool":0},"ARjLsnzAjayzWTOBXUDT3Q":{"text":"Went here for the first time today! I really enjoyed my roasted turkey sandwich is was so ","useful":8,"cool":5},"q2VONn37ZJV4ZHGz4cBcmg":{"text":"This is my all time favorite breakfast spot in the city. The huevos rancheros are out of t","useful":0,"cool":0},"jDJ235Fpf4OZb4QPwicSog":{"text":"So 2nd time around didn't go so well either! I ordered the corn beef hash that has an over","useful":0,"cool":0},"ezzWmS-5hzBYRCZEVFW9Hw":{"text":"I've been here 3 times now, and the food is reliably delicious.  The menu is diverse with ","useful":0,"cool":0},"QVdmyFw7H-RtD1_oIuZJwQ":{"text":"LOVE this place for brunch! Eggs Benedict Sardu w Lump Crabmeat?! What?! AMMMMMMMAZING!!!!","useful":0,"cool":0},"JT6KpjdJWW6FbSWAueRFbg":{"text":"We started with the crab and avocado bruschetta, to die for! For our main entrees we order","useful":2,"cool":1},"OiH_zHfdjvmHTUAjiraB1Q":{"text":"Amazing food!!! Pleaaaase stop by!!! \nPecan waffles amazing!! Salmon sliders... to die for","useful":0,"cool":0},"r_a1q__2eRaq8v88M9zEAQ":{"text":"I was only in New Orleans for 2 days and knew one of them was going to be in the Garden Di","useful":1,"cool":0},"jf1klvSTPRUcMAKEkCLmCg":{"text":"I'll start off by saying we really only did stop in for dessert, but I'm soooo glad we did","useful":1,"cool":0},"SjHWi7Resn-X8m1Q3XdyTQ":{"text":"I've been here twice and both times were really good. We enjoyed breakfast the first time.","useful":0,"cool":0},"NsVqCRmsXHFy8lGyuaaVUw":{"text":"GET ANYTHING WITH TOMATO JAM! I  got the Crabby Shrimp, nothing wrong with it. Honestly it","useful":1,"cool":0},"1cdBqsjc9Kfri7qu_i814Q":{"text":"I went for a late lunch with my 6 year old son. I really enjoyed the Red Dog Diner. They h","useful":0,"cool":0},"geo0JjxA_AsrjdP27Onq8g":{"text":"I have been eating at Red Dog Diner since it opened. The food is great.  The servers are s","useful":0,"cool":0},"AMseqJCe1OtAb2P8X7fYUg":{"text":"This place was really really really good.  Their HH drink specials are also pretty great. ","useful":0,"cool":0},"7rfN50EQGwEQYrgXCr_D-w":{"text":"This place is insanely delicious! I came for brunch on a Saturday and I got the \"John Smit","useful":0,"cool":0},"KElZsXshj9mtV-XShJYAKw":{"text":"Very cute setting. But food and service weren't as great. Our server took a long time to d","useful":0,"cool":0},"aKRp4_s3khT75n-vcUo38g":{"text":"I have been here a couple times. Today we walked in at 10:30am and had no wait! Sat and or","useful":0,"cool":0},"0xe3wuOyJ8i1uh5cMcxxGQ":{"text":"Amazing!!! Best ham and cheese omelette ever!!!! plus the staff is great!!! Super cute din","useful":0,"cool":0},"xkWZbQFgmHhDZZZvthz00w":{"text":"Excellent food!! We had the blueberry pancakes...amazing! And the Joe Blow breakfast...lov","useful":2,"cool":2},"PCyYjoskLCwNbfDH000EjA":{"text":"Wow so good!!! Our lovely waitress Alyssa was so freakin nice and fun and helpful! We have","useful":0,"cool":0},"GNfd3oQ74NjDrHHNmNeWFA":{"text":"Wandered in after work and sat at the bar. Had a cup of the Duck Diablo soup which was inc","useful":2,"cool":0},"z2bXRlqdOTfMH5zNIxDmdQ":{"text":"Found this gem when visiting NOLA for NYE. Don't let the hole in the wall exterior fool yo","useful":0,"cool":0},"knOFSXJVAY2mmIL0ybqpGA":{"text":"Best breakfast we've had in the longest time.  Every meal was so great.  Shrimp and grits,","useful":0,"cool":0},"J45MxdxcRTqKt04LwOCXiw":{"text":"Excellent brunch stop for us on our trip to NOLA...food is delicious - I had the cauliflow","useful":0,"cool":0},"UgzARs2y3z8nMKH1GePrfQ":{"text":"First time in New Orleans found this place on Yelp. It was AMAZING!!!!! Food and drinks we","useful":0,"cool":0},"Yu28pI3BGgr-T80et960kg":{"text":"Get the steak wedge salad. Do it. It's amazing. Plus, the wine is so fun and amazing! I lo","useful":1,"cool":0},"0xEROHWVzJGcEFEOmEHeYg":{"text":"Excellent pamento cheese app, draft bear selection, and duck waffles. Entree portions were","useful":0,"cool":0},"ULSzvjVGdwfcl5EooXCn4A":{"text":"We were in New Orleans for three days and this was our favorite meal. I got the bacon egg ","useful":0,"cool":0},"nLSEafS9rvVSKWtYmn_bFg":{"text":"We heard this was a place that stayed open a bit later than most places , (10:00pm). We ca","useful":1,"cool":0},"39QBP8oaGZOxTW5QQQBFKw":{"text":"I think I just found my new fav brunch spot! Came here on a  Sunday at about 12. Place was","useful":3,"cool":3},"3BZbK8xdGcOx8kh4SGe2VA":{"text":"My one star is for the food! It was delicious but our meal was completely ruined by the se","useful":1,"cool":0},"CSgtDulHgKuhFTsIT0Df7w":{"text":"Do yourself a favor, stop in to Red Dog and grab some food and a drink the next time you'r","useful":0,"cool":0},"G4nx_v2jWCp3wjIqz6tqYQ":{"text":"Hearty rich stew  of braised lamb with peas and carrots over fettuccine like pasta cooked ","useful":0,"cool":1},"amlx0-J5MDrZs6A-93tVAQ":{"text":"Get the Mac n cheese! Very satisfied with all the small dishes and appetizers we got. Very","useful":0,"cool":0},"NNUi7Np5g7IeOhhJkLoupA":{"text":"Fantastic menu and service. The menu is not only delicious but entertaining. Alex provided","useful":1,"cool":0},"wWdIrtDY_MV0sZBHHPprUw":{"text":"The Smoked Mac n Cheese was...lets just say it was a mac n chz-gasm....\nCrawfish Tasso Che","useful":0,"cool":0},"V4qGg_LPbUszyLs6xXm2gQ":{"text":"Sweet potato pancakes are AMAZING. Friend had the eggs benedict and they were great as wel","useful":0,"cool":0},"SMzhJMyDsT7is8VEbi_f7Q":{"text":"Smoked mac - 10/10\nLoaded potato -10/10\nSteak wedge salad - 10/10\nCrab and bacon dip: 15/1","useful":2,"cool":1},"JlF2aMJstbYAPaEG2Quz9A":{"text":"Absolutely delicious!!\n\nI was in New Orleans for a girls trip and we wanted to have brunch","useful":1,"cool":1},"T5dpG40u88e9jb_XhPMMHA":{"text":"We have been here several times. The food is very interesting, but it is entirely too salt","useful":0,"cool":0},"2HWeW57YjaO_iLehke4szg":{"text":"Take a walk down Magazine Street, they say. Sure.\n\nHidden within the unique local shops an","useful":1,"cool":0},"j84bVs2FnD3gixD0-Y7OiQ":{"text":"Discovered this place today. Crab and bacon dip was sooo good! Awesome. I had the duck waf","useful":0,"cool":0},"UJYFlRysyEhkN_VFrDibgQ":{"text":"Found this place while visiting the Lafayette Cemetery in the Garden District. Oh.My.Goodn","useful":0,"cool":0},"V4WQk-Fm5hJMDeoCJRY4HQ":{"text":"Stumbled upon this gem the other week! As a lover a brunch and a hater of lines this place","useful":0,"cool":0},"6j8j3EmWPFdQggcJrquvYA":{"text":"Not the best flavor of foods paired together. We had the pizza which was alright, the tama","useful":0,"cool":0},"EIDUN1P81gg2_-LdIarJEQ":{"text":"Food was delicious! Service on the other hand was pretty darn slow, and it wasn't even dur","useful":1,"cool":1},"nsYQYNABtfb26mARRgetYg":{"text":"My sister, mother, and I came here for brunch before our flight back home to Arizona. Desp","useful":0,"cool":0},"iM1Y_qlKSXhaMfidVq1Mbw":{"text":"I have passed this restaurant so many times and finally tried it the last time my family c","useful":2,"cool":0},"zttgdBQDD0ed6v8a5Dwr3A":{"text":"What a great place 2 chill n grab something 2 eat \nParty of 4 , we had the crab n bacon di","useful":0,"cool":0},"Wn-I7ZcvFAlFhoRuOt6pcw":{"text":"Breakfast was excellent. Had the hipster shithead sandwich and loved it. Bloody and mimosa","useful":0,"cool":0},"rGMQUuEkQpFzHwxNWtbIhw":{"text":"We've eaten here several times. Actually it  is our go to spot for breakfast.   For us New","useful":0,"cool":1},"ujGYS3LHE2OzZuwkMSkSXw":{"text":"This place gets good reviews, so maybe I hit it on a bad day. Eggs were gross. Salad dress","useful":0,"cool":0},"_3P6uuylT8Fh9iKGD0qjqQ":{"text":"Wow! What an impressive place! The menu is diverse and everything we had was absolutely de","useful":0,"cool":0},"zYPSpwn5lRl7sjJijONewA":{"text":"The food here was absolutely fantastic.  Came here by default after the 2 other places we ","useful":2,"cool":1},"1WFWLhYtYyDvcknqOK2OGw":{"text":"We found this gem in February during Mardi Gras and we absolutely loved it we're coming ba","useful":0,"cool":1},"2BtTAPlVLfUQkRdbLOfQRg":{"text":"Order the frozen mimosa, it is delicious and different than any other in this town, see ph","useful":4,"cool":2},"J_2IOJSxRr09QKs4ooyKcA":{"text":"Best restaurant ever. I eat here like 3 times a week. Im obsessed with the Caesar salad","useful":0,"cool":0},"byIdWmMTe1wUEAbcYtMJKQ":{"text":"We've been here twice over the last couple of weeks.  Great experience both times.  Last n","useful":0,"cool":0},"7XpoGs3ESwdJIK3MUy8q4g":{"text":"Loved this place so much, we went back a second time on a quick trip to New Orleans.   The","useful":0,"cool":0},"13pbNZvEIneKeePQdsOSVQ":{"text":"The food and drinks were amazing. Casual, but fun and affordable with great food & service","useful":0,"cool":0},"3y-APo5doWxz4Bj1xP_MaA":{"text":"My boyfriend and I came in from Lafayette to spend the day in NOLA. We wanted brunch, so w","useful":0,"cool":0},"aWNSdgwpa1wPv_j3a_wBsA":{"text":"Delicious spot for a late breakfast! Really cool interior and atmosphere and very friendly","useful":0,"cool":0},"HjccKVtgcnWLZjzZ7YvpTQ":{"text":"I like this place! I can walk to it from my house so I go for lazy brunch a lot. Good food","useful":1,"cool":0},"bmuKzi6Nlhn2QodeO6T7Mw":{"text":"Ate dinner here tonight. The service was good. It was hard to find parking. I can't imagin","useful":0,"cool":0},"jyCkee_MuyeKrp7ecgHbxg":{"text":"I LOVE this place! My favorite thing so far is the sausage & peppers pizza, perfect portio","useful":0,"cool":0},"HU4wLa2lPUbgbJdOOYuVzg":{"text":"Without a doubt, the best corned beef & egg I've ever had.  Incredible Flavors and ingredi","useful":2,"cool":1},"TgLJn3jkJnvEnaTTLGrqsw":{"text":"My wife and I are suckers for dog themed products and establishments. Fortunately, the foo","useful":0,"cool":0},"OD6eriulB8eX51wl7adZOg":{"text":"Had a fabulous lunch here! Sat at bar because tables were a 20-30 min wait. Staff was frie","useful":0,"cool":0},"OeO1eyL4HOE9uMi-ypOdLA":{"text":"I am not one to leave reviews, but after tonight's dinner I just had to share how great my","useful":0,"cool":0},"kl4PlC4aAnhAqUQBbSn47Q":{"text":"Had:\nBrisket Hash   |  $13.95\nchimichurri, gruyere cheese, grilled mushrooms & onions. \n\nT","useful":0,"cool":0},"9yXYXmB2-GeRww6Ng_lQXg":{"text":"By far one of my favorite restaurants in New Orleans!  Their bloody Mary's with House pick","useful":0,"cool":0},"Q_1_KUIUskk4ISIpZoANJw":{"text":"Honestly the pictures don't do this place justice at all. Seriously some of the most flavo","useful":0,"cool":0},"u-D37V4aROga-4FYCIYVgA":{"text":"Everyone talks about how wonderful this place is, I have been here 4 times and haven't fou","useful":0,"cool":0},"WLAtdbgejPW4cDqUWA9H4g":{"text":"Really amazed by all the great reviews...\n\nThe crab and bacon dip was amazing. The paella ","useful":0,"cool":0},"1xdEqTOr9XHk8JTsf5cJFg":{"text":"Awesome !  Had breakfast today and loved it !  Super cool place with friendly staff. Upsca","useful":0,"cool":0},"Gr_RdX5gUys0GnDGComXEg":{"text":"Delish!  Baked oysters are to die for.  Tamale meatballs.... yum.   Spinach artichoke dip,","useful":0,"cool":0},"VmaC16ZqtTJs0DMIHR3bYg":{"text":"During our cross-country road trip, we made a pit stop for brunch at this diner! Dog frien","useful":0,"cool":0},"royjUt9-kIah5JDasG0R6g":{"text":"OMG!  Rainy day in New Orleans. Looking for a bite to eat between hiding out from the rain","useful":0,"cool":0},"cLaMW65EwqVxMvh6VmbzKg":{"text":"Fantastic,  highly recommend.  Great dinner fare with a local twist.  Crab and corn fritte","useful":1,"cool":0},"yC7vYAxacvwLDGA79JLJkw":{"text":"This place was a short walk over from our Airbnb (and also not far from Archie Manning's h","useful":2,"cool":0},"oZDV2oDN_5YBXu4PyZUXig":{"text":"Came here to celebrate my friend's birthday lunch and it was nothing short of amazing!\n\nWe","useful":1,"cool":0},"wmaAd05gEp_8XPJ2NNdvZA":{"text":"Worst Bloody Mary I've ever had. If you like drinking horseradish, this is the place for y","useful":0,"cool":0},"mKmHN7ctYyI-cthINHGChg":{"text":"Stopped here to try the breakfast menu because we had heard so much about it. We were very","useful":3,"cool":2},"_-NvVJBQpmyp6Ne2_8ScsA":{"text":"This is my favorite place to get brunch in NO right now. The service, the setting, and foo","useful":0,"cool":0},"udMgW4m6tw6x1eTFLCjdgQ":{"text":"As soon as your arrive in New Orleans you need to hop in your uber at the airport and dash","useful":0,"cool":0},"d9wKLZRFT5LYkJiCxLYdZw":{"text":"My wife and I went to the WWII Museum and found this place afterwards. We were greeted by ","useful":0,"cool":0},"tkrdRhTvwI8Tqo4yU1KQ2g":{"text":"Went here on a whim with a friend for brunch and had an absolutely awesome time! The omele","useful":1,"cool":0},"ZOhMGOTBisunFBBFPeggsg":{"text":"Good fresh food at reasonable prices. We had beet salad and farmhouse salad. Both really g","useful":0,"cool":0},"4jkl9PcMHx0VM2obDvOwSA":{"text":"Really cool place in the garden district for breakfast! I would price them at above averag","useful":1,"cool":0},"5Gl7hcEGeg28pRYWyloGBg":{"text":"Yummy! I'm glad we had a chance to grab late brunch here. Unfortunately the line was long ","useful":1,"cool":1},"LLaPdZfZvIpkaZqnWL7o3A":{"text":"Awesome place! Fantastic food. People are all awesome there. Wonderful service. Great addi","useful":0,"cool":0},"8jb7MUBScutOAFCkq0t6YA":{"text":"Food was great! Brussels sprouts, white arugula pizza, pimento cheese, spinach dip, eggpla","useful":0,"cool":1},"oCIsDxtGziCXWld59vB6-A":{"text":"What a great spot for brunch! Only issue is the service being a tad slow. The food is deli","useful":1,"cool":0},"X60wj0RpDhC3Sel5Bt1wCQ":{"text":"delicious! We went in for brunch, the wait for a table was 45 min but we went to the back ","useful":0,"cool":0},"15xdI0pI5EzQCcPd7moFSA":{"text":"Had their prime rib sandwich- a hit!! And huge. My husband had the sirloin sandwich, it wa","useful":0,"cool":0},"LKX7P93kO9X7uSZrxoyZoQ":{"text":"Best hash browns I've ever had!! The Bloody Mary was not that great but I don't care for h","useful":0,"cool":0},"ou9qhBqvOCsL-gqntfGlFA":{"text":"We stopped in for breakfast well visiting New Orleans for our honeymoon! Sam took care of ","useful":0,"cool":0},"fQcwoNYxFbYwe2u0OHFEEA":{"text":"A friend recommended this place he had been here before & thought we would love it. Well h","useful":0,"cool":0},"irCeQ54BOa65QByiDrxBuA":{"text":"Love the location of this cute spot in the garden district! Great place for a casual break","useful":0,"cool":0},"fiqrqxuA42aSppAIJKAtjA":{"text":"The food was delicious! We had the salmon, drum and grits and duck. Excellent service and ","useful":0,"cool":0},"416vf_3YXLVvCAgfbvsuUA":{"text":"Love love love having brunch here! The biscuits and homemade jam are insanely delicious! C","useful":2,"cool":1},"ipgrfNzDPPHmYhN4KgUb9w":{"text":"The wait staff are friendly and efficient. There were a lot of people when we arrived; how","useful":0,"cool":0},"F_OPjHPGjkNiwYaoHYB1XA":{"text":"Definitely a dinner place. Everything I've ever had for dinner was excellent. Lunch is...l","useful":0,"cool":0},"ZAUAOi2p84xdNdjO1UAJGg":{"text":"I have been 4 times. I have no complaints. This place does everything well. Drinks, food, ","useful":1,"cool":1},"kjxf-N1P9vbpXBh0ddoBvw":{"text":"Had a really good brunch at the Red Dog Diner.  It is in the Garden District on Magazine s","useful":1,"cool":0},"sqzqrLqOOwx-ZHRMa_8FiQ":{"text":"A new restaurant in the neighborhood. It was Good, but Not Great. This super fancy Salad/S","useful":2,"cool":0},"lYTurqygzv23f6aQcv5fUg":{"text":"Went on a Sunday morning. Ambience is great. Unfortunately our service was slow and my mea","useful":0,"cool":0},"BUlzp1_DJf8W8jm7_jVZBA":{"text":"This is food we will be craving when we get back home! We had to come twice on our visit t","useful":0,"cool":0},"tu5AhYPvnBLHLONgStLkzg":{"text":"Biscuits and jam was the best thing I ordered. So yummy! The bloody Mary was filling and d","useful":0,"cool":0},"Jo3LpD4jO171vtMZhMUe0w":{"text":"Sat all afternoon waiting for our food. Food was okay. But seriously, 25+ mins after order","useful":0,"cool":0},"YuM6xwq6mS5Hn--jbu94ww":{"text":"New favorite place! Food was great. Service was great. Atmosphere is awesome. The area in ","useful":1,"cool":0},"h03z9BvHScjl-2QpeSZtaw":{"text":"Always have to go visit Red Dog Diner when I visit New Orleans.  Food is fantastic and ser","useful":0,"cool":0},"zZKxnWCgycuqcGNcZ-NMGA":{"text":"Had to submit this review since I was lured in by the 4.5 stars and 600 reviews. I just do","useful":0,"cool":0},"i5tcfsn-TSsECu6g7mePHA":{"text":"We enjoyed our first breakfast here so much that we came back a second time! That's really","useful":1,"cool":1},"Pvb4UHE64HjF1Mooe7hFDA":{"text":"This was on of those places that was not planned and picked from a walk along a sidewalk. ","useful":0,"cool":0},"haHU4wwz9aElEALnwK6GzQ":{"text":"The food was absolutely delicious. Every single thing we ordered (huevos rancheros, briske","useful":2,"cool":1},"bXCQQBtqv9ZSriuvuPUicA":{"text":"We had a really good experience on a brunch here one morning. It's a small restaurant that","useful":3,"cool":1},"22a-gC61LKswASrzSQYdpw":{"text":"Though my poached eggs were a lil past perfect, the food had TONS of flavor. Nicely done.","useful":0,"cool":0},"D3mztTgHS-Ca39JjrnyxDQ":{"text":"Ate there twice. Both times the food was heavily flavored with an ingredient that was nowh","useful":0,"cool":0},"mRce8J3T6ciQ12hnYgmP2A":{"text":"Wow! Wow! Wow! I absolutely had the best brunch of my life at this restaurant. We parked o","useful":0,"cool":0},"FmPb_9KP9J7KvEyQs40pdQ":{"text":"I am having a hard time understanding the four and five star reviews of this place.  My wi","useful":0,"cool":0},"1P4VlHfMTAB9Rf1NsuRdfQ":{"text":"the oyster and also the tuna appetizers are very good.  Ask for extra chips with the tuna.","useful":0,"cool":0},"CgHwOGo1cS5aCN-p18xyLw":{"text":"This place is excellent!! Came for breakfast-the setting is really nice, funky cool casual","useful":2,"cool":1},"BfmIgby2zcuUIOC0GX6HIg":{"text":"I LOVE THIS PLACE. I just moved here from Chicago a little over a week ago, and I've been ","useful":0,"cool":1},"TCommfDXKXSvuhX7lJAc_A":{"text":"This place is a great stop. Ate outside and had the smoked Mac and cheese, pimento cheese ","useful":0,"cool":0},"KqymvV_xxh-zOchM9IqiYw":{"text":"The service was great the food amazing. The chicken gravy sandwich was delish. The boys lo","useful":0,"cool":0},"KPRX1m6DdyPu3dloDV9GEw":{"text":"Service was pleasant & they were quick to get me a table for one in the back.  The food it","useful":0,"cool":0},"B7h_46zmzViThrGLxSxuIQ":{"text":"THIS REVIEW IS FOR DINNER. \n\nWe came for dinner on a Friday night and were promptly seated","useful":0,"cool":0},"qexeH34hNTTeKkREUDrxDA":{"text":"Love this place!!! The food, service & atmosphere is always at its best. The drinks are fa","useful":0,"cool":0},"JHC00KNIe9tqktCUn6iYSA":{"text":"Before heading to New Orleans I researched this restaurant.  It did not disappoint.  The s","useful":0,"cool":0},"XC8Bofn5eeTlLm8s6BxFiQ":{"text":"Been here several times and have not experienced a bad meal yet. Love, love the frozen Iri","useful":0,"cool":0},"kUTP2K4YGvtNwVPp3mR-Iw":{"text":"It was okay!! There sweet potato pancakes were amazing!! The salmon sliders were okay.","useful":0,"cool":0},"J7R4lBzctY45FHutFGJ6rg":{"text":"Meh.  Went for dinner on a Friday early evening, and the service was slow.  The food was m","useful":0,"cool":0},"inwXkXXAgpou1w2Yhscx7g":{"text":"YASSSS!!!\nI crawled out of bed New Years day with MAJOR HANGER, posing a considerable thre","useful":1,"cool":1},"srezYs0z3TCMU1fncn_yoA":{"text":"Highly recommend!! We came here for brunch and loved it. The Bloody Mary was delicious, gr","useful":0,"cool":0},"QWfqMDafa5N3FqimR_3_Qg":{"text":"A small gem hidden on magazine street. We've been to every Italian place around the French","useful":0,"cool":0},"1IGPPSzGSd0EZup7yzJk9w":{"text":"I'd been to Red Dog Diner in the past for a few cocktails (the back bar is really cool), b","useful":0,"cool":0},"Jbbax7l5Xd7gM-IdVl5osQ":{"text":"Sat at the bar and had brunch while watching the saints game...Really enjoyed the sweet po","useful":0,"cool":0},"IBbkrn6L2CARgQBozkpVpA":{"text":"The Red Dog Diner combines american style food with a bit of their own twist. The general ","useful":0,"cool":0},"HqXGplRb1F4A4tr2ScZOyQ":{"text":"We found this place while trying to eat at the Rum house next door and decided we didn't w","useful":0,"cool":0},"5s2OnTd9K8EBp5SVWN4poA":{"text":"Try the oysters in the skillet...amazing. The seafood soup also was delish.  I give this p","useful":0,"cool":0},"BxhTW3sXP0J9oXGtV_eRww":{"text":"Went here with a friend for breakfast! Curry roasted cauliflower Humpty Dumpty! Curry roas","useful":1,"cool":1},"II23nVhfYd7Djq-1vouNNw":{"text":"I have eaten here 3 times now and each time has been just as pleasant and delicious.  I ha","useful":1,"cool":1},"FxRkKio40E8ksxwpLe256A":{"text":"Everything at Red Dog is lovely. the service is wonderful and all of the workers are happy","useful":0,"cool":0},"VF8PzmgeQ99vLE9-PAIHWQ":{"text":"Amazing! I've been to New Orleans at least 15 times, and each time we search for more plac","useful":0,"cool":0},"vraahsuL9jUrbkX4DzuHGA":{"text":"Came with a group of six for Sunday brunch.  Told us the wait would be 30-35 minutes, it w","useful":0,"cool":0},"SyYNRdVgWKs0RZ5x0w4M-Q":{"text":"This place is SUPER HIP! But not to the point where it bothers you. First off the adderol ","useful":0,"cool":0},"hQnU5G6Px4CI0fleZFeoKg":{"text":"This is one of the most amazing diners I've ever been to. My boyfriend and I always are lo","useful":1,"cool":0},"3sW8LZf20RpAUTxLSK4Uhw":{"text":"Giving five stars for the best banana pudding finally!! The food I had was all good as wel","useful":2,"cool":2},"UZzpwwK13-NH2J749MUU4w":{"text":"The food was okay. I had the Lump Crab & Eggs Sardou. It was pretty tasty. However, the se","useful":2,"cool":0},"tAyI2qm_mNrmImzwokOFUg":{"text":"Had the bbq chicken pizza which was excellent. This place has a hipster bar type vibe to i","useful":0,"cool":0},"n26lIHuwBZAFi9AmE4rbKA":{"text":"First Class New Orleans culinary experience on a sandwich. The Croquet Monsieur is country","useful":0,"cool":1},"bgfSfOuLNea6WEOudORHkQ":{"text":"This place was fantastic. So good I even had to take a picture of the food. Great food wit","useful":1,"cool":1},"kEahb2RCFZe6UQfiKkXPDw":{"text":"I absolutely love this place! The food and drinks are always fantastic and you never leave","useful":1,"cool":0},"r65dOPA6D25Q-gmRyzHWxQ":{"text":"FOOD: Mix of standard pub sandwiches, pizzas, pastas, salads with a slight NOLA twist. Sha","useful":1,"cool":0},"OFI-tBDLFOmfRqRh_LqQag":{"text":"This was some of the best food we had in NOLA. Our favorites wet the smoked Gouda Mac and ","useful":0,"cool":0},"eU0HfB9RQJlVz7DD2tjVzA":{"text":"AMAZING restaurant! Authentic, flavorful and DELICIOUS! I had the tasso shrimp and grits, ","useful":0,"cool":0},"-oJPi1c5m6j3O0PqYpfXYQ":{"text":"What a great little breakfast restaurant in a quaint section of Magazine Street.  Our serv","useful":0,"cool":0},"B0PBN5sqRxnToRldBXXdkg":{"text":"My wife had breakfast here few weeks ago and wow, it is like a hidden gem, hard to believe","useful":0,"cool":0},"_t0G3kHhSkONFCX6asy96Q":{"text":"Came here for dinner during my stay in New Orleans... I had one of the best pizzas I ever ","useful":0,"cool":1},"cQ2U5pp2G1xPINPeMU5SGA":{"text":"This was our go to place for lunch on a Sunday afternoon. We arrived and had a 40 min wait","useful":0,"cool":0},"cADYmhG9Dqod0DocpzANlw":{"text":"Stop by here to cool down on a hot day. The bartender was super friendly. He told us it's ","useful":0,"cool":0},"mP7uFvR1lX84wu1XN4hxJA":{"text":"Huge, delicious breakfast/brunch, served till 2pm! The style, layout, ambience was great. ","useful":2,"cool":0},"1uwlcx7Qmap6hez7Y3UAlw":{"text":"The restaurant was in a nice location and was surprisingly big. The Jan that came with the","useful":0,"cool":0},"GCdbQ490oHa9ElUn7eiLdA":{"text":"Great happy hour specials! Food is delicious! Salads are delicious. Have new, young wait s","useful":0,"cool":0},"8W5JGKLcHtpB7t1M7VNK1Q":{"text":"It's not often that I feel compelled to write a review- Red Dog forces the exception. We w","useful":0,"cool":0},"OrXOpmpgJmRQT3tvaeNvrw":{"text":"We couldn't decide between this place and the taqueria next door. This was an excellent ch","useful":0,"cool":0},"PYv-uX09VjU1VbNBQXNSvQ":{"text":"Great location and vibe! The inside is much bigger than it seems. I had the Parmesan-crust","useful":0,"cool":0},"x5TAgpMxPLYdfmbN9j35Nw":{"text":"I remember this place well, because it was the day I delivered my baby! We came in that mo","useful":2,"cool":1},"0QEaEw6mOCtA5aLeGg4tog":{"text":"We always enjoy eating here for lunch. The food selection is not your normal boring select","useful":0,"cool":0},"vOcRMlbWmrXtpXBHdTIdag":{"text":"Nice atmosphere. I had the duck soup, steak wedge, and Brussels sprouts. My fiancée got th","useful":0,"cool":0},"jaM5SlkMXgAQgJWVeUAIfA":{"text":"Great food. Wonderful atmosphere. Awesome music. Good portions and prices! Would return!","useful":1,"cool":0},"3YNecFJJ1pDb1AaQ66ieBQ":{"text":"Great for breakfast (try the Biscuits and Gravy or the Joe Blow). Funky decor. Nice area (","useful":0,"cool":0},"imtFqk2CbEmP1baTKRHB0g":{"text":"Great breakfast/brunch spot a little off the beaten path and away from the bustle of the Q","useful":1,"cool":1},"VFKC3nN4eItEmpH9joq89w":{"text":"Great place. Much more welcoming than the 1st place we tried. Glad we kept walking!!! Grea","useful":0,"cool":0},"JdMWcmjOBQNb6s9wWcl6NA":{"text":"Went there again a few days ago and I stand by my original review. \n\nThe place is good, bu","useful":0,"cool":0},"6Y5coqrY_CiEi9GI5rJyAg":{"text":"I was so surprised by this place! Cute place to eat with friends and eat amazing food. Rib","useful":0,"cool":0},"Qg3J9D81e-pfprDNjkmk8A":{"text":"Went here for lunch for the first time last week. I've apparently passed it hundreds of ti","useful":3,"cool":3},"Kh14QyFMGZ1nE6QsVhabuQ":{"text":"This is a great, family friendly spot. We take our 2 year daughter and we all enjoy the fo","useful":0,"cool":0},"QZzoaFRhl9bjvS9OIz2RxQ":{"text":"We ate here while visiting bars in the area watching college football. The place is really","useful":0,"cool":0},"mbiEQ9sSEc3nvBIft31tfw":{"text":"We came for breakfast and my wife and I shared the sweet potato pancakes and the brisket o","useful":1,"cool":0},"AvJLZ76EU_iCU_Q4X9Amzw":{"text":"Service was great. Food was good and had a nice size menu with an array of items. Prices w","useful":0,"cool":0},"y1xu3tmoJ40VOry5Ubt9ww":{"text":"Came here on sunday for brunch.\n\nOyster bake- omg this dish is life changing!\nCandies peca","useful":2,"cool":1},"lT6i29Lia9vwIYZ4PTabqg":{"text":"I had a great Sunday lunch last weekend! The space is small, so be mindful of peak times a","useful":5,"cool":4},"-kLS1j77B1KP9uP90Je-DQ":{"text":"What a great little place off Magazine in the Garden District! I am obsessed with their ho","useful":0,"cool":0},"qw32HPwbQ2qQB0BdzoJPaQ":{"text":"Came to New Orleans with friends and we scrolled past this on yelp. Decided to come in for","useful":0,"cool":0},"wN_n6drQn-WsPPaJGgvtWg":{"text":"If you are in the garden district this is a great place to come for lunch after taking a w","useful":0,"cool":0},"mlnl5eO-BTRImpWAIjjTkw":{"text":"Needed a quick snack on my way home from work! Came across this diner using this app... re","useful":0,"cool":0},"hpspY2FpTFagagAPpUeN8w":{"text":"Came here for a late lunch. Waited a long time for our food. Totally ignored by our waitre","useful":0,"cool":0},"5xpaysy-m4_z5KKK9rBs8Q":{"text":"Just ate at Red Dog today with my family for brunch. It was sooooo tasty. I had the crab a","useful":0,"cool":0},"ffrz2KUfswWdaH_oEuEs4A":{"text":"Close to spectacular! Crab dip appetizer simply amazing.  Mandarin Salmon salad for my ent","useful":0,"cool":0},"X92vvCEFA8qiHeAGy18__Q":{"text":"This place is seriously the best. It was open on St. Patrick's Day super late and that was","useful":3,"cool":1},"GrYc4x9FaZKnfwe5AHVngA":{"text":"Breakfast for the first time here today and I will say we both thought this was one of the","useful":0,"cool":0},"72rYN8HLEbAx1kx2l_onzA":{"text":"I've been here on two separate occasions and the food is great! The frozen mimosa is a mus","useful":0,"cool":0},"f0Q-WHgGGQ0R-yVqWLt6-A":{"text":"The duck waffles are weird but soooooooo delicious!! This was a great stumble upon gem of ","useful":0,"cool":0},"HlGsxFFzwOVDsD9sYmaDcA":{"text":"So good got the shrimp and grits.... Amazing loved every bite... The best cup of coffee I ","useful":0,"cool":0},"-hEhcV_YKZQZfBoygWnFZQ":{"text":"Good breakfast food. Cute space. Service was mediocre. Their wine selection needs some wor","useful":0,"cool":0},"_VTdSv2bgw4Y4-MtdufEtQ":{"text":"My wife and I have ate here twice. It's a nice place to eat. The atmosphere is on point. I","useful":0,"cool":0},"M5iFdUZH3ne8tBqoXy_6-g":{"text":"Pretty sure that Red Dog Diner is my new go-to spot in the LGD. It's a newer spot that is ","useful":4,"cool":2},"22Zxl66eucgsgSEvMDjNng":{"text":"Best place for a cool happy hour! I love this place! It's my go to place when I have a rou","useful":0,"cool":0},"KRXAm7JMAubLcCQ5eGfJ1A":{"text":"Amazing food ... enjoyed the service .. the dishes catch you off guard, but whoah every bi","useful":0,"cool":0},"BqBO2ydDkTPENGjI4xl7mA":{"text":"I absolutely love this place!  During my first visit I got the prime rib benedict and a mi","useful":2,"cool":1},"byKGWuuxt14c0al6KzV3ZQ":{"text":"The food was delicious! Our server, Amanda, gave great recommendations which were spot on!","useful":1,"cool":0},"lHgwkTmO5m3fTm8YLokKpQ":{"text":"I was surprised and impressed by this place. I had no idea it would be so, so good. The sp","useful":1,"cool":0},"WVx8wLhE3IclI4Uin88JLQ":{"text":"I would give Red Dog four stars for the grits alone! Came here for breakfast and ordered t","useful":1,"cool":2},"YNbtBBlg-PGrW8tJ7NUFtA":{"text":"This place, man. So cute, airy and quirky with dog art EVERYWHERE. (We left here and went ","useful":1,"cool":2},"YSzhEUO_zK96BpeYzpECig":{"text":"Nestled in the Garden District of NOLA. We followed the sign that said \"the back alley bar","useful":0,"cool":0},"tPQ3Z2hwzoVFjpgm_j2AIQ":{"text":"The greatest bar/restaurant on magazine. Specialty drinks are awesome and have not had a b","useful":0,"cool":0},"O2BCms3J5SKjLzKMhqD3Tg":{"text":"A friend of mine wanted to do brunch with me one Sunday and suggested the Red Dog Diner. S","useful":11,"cool":11},"_ln9_XcsD2f_sOxfCZ-AOA":{"text":"**REVIEW FOR 12/18/16**\n\nForget reading this review... Don't waste those precious moments,","useful":2,"cool":1},"8lJeXgaHRhWf40WMBkcCug":{"text":"This place is amazing, we originally wanted to go to the Ruby Slipper but they were packed","useful":0,"cool":0},"pxfiqR3KyFtYOzNw1hTxtg":{"text":"Such a unique variety of food!  Drinks from beer to wine to local house-made cocktails lik","useful":0,"cool":0},"Fo5TEOINCC5g1NCEY_EWPw":{"text":"THE FROMAGE PLATE.  what a tasty mix of cheeses, sweets and textures. One of the best we h","useful":0,"cool":0},"XISTwxO9ILY9KdmN_KNGcA":{"text":"After one trip, this is one of my favorite breakfast places in town. Be prepared for a lit","useful":0,"cool":0},"AW2YxdTptAVO5_YEHG7LLQ":{"text":"Atmosphere and food was amazing. Deviled eggs and duck waffles are just a couple of our fa","useful":0,"cool":0},"tVhIJtDPxzLgKsgKwMXq3Q":{"text":"Amazing place !! If you are a foodie .. this restaurant is a must. The Ahi crisps taste li","useful":1,"cool":0},"5kT3_b2YDruYiE_h5avb0w":{"text":"This place is ahmazing! The food is southern inspired, a little bit of spice and American ","useful":1,"cool":0},"Ltm3675WEyi0KjSt8uNoUw":{"text":"We chose this restaurant based on a Trip Advisor suggestion. The Rum House was crazy busy ","useful":0,"cool":0},"r0mofTHtlpsUh5WGiuhQpQ":{"text":"I loved every part of my experience at Red Dog! Our server, whose name I can't remember (s","useful":0,"cool":0},"tpCMppXTtnCelIkEZnnt6g":{"text":"I have never had anything from here that I didn't enjoy.  Great portions, great flavors, g","useful":1,"cool":1},"OpojLieCGcrliEg06NpNQA":{"text":"The food was very good I had the egg Benedict with crab the eggs were cooked perfectly! It","useful":0,"cool":0},"WaCtXBvgiWUU0HMn0JxAVg":{"text":"Great little restaurant on Magazine St. We had brunch here--the Crusted Crab and Eggs Sard","useful":1,"cool":1},"nQ2fUJwKB8rVjDBR7HHJSg":{"text":"Stopped in for lunch today and it was a totally solid choice. Cool spot  with nice courtya","useful":2,"cool":0},"OPrDziJNIf_e0q22ZDh29Q":{"text":"Great food. We all enjoyed the ambiance of the building and the waitress was fantastic \n\nW","useful":0,"cool":0},"cDeQuTt51iobmlKUrxgyxw":{"text":"This is a wonderful spot in the garden district. The food was great (and fast). The servic","useful":0,"cool":0},"a-4iUvmWWKjYaklXrytanw":{"text":"Great atmosphere and quick service! We came for dinner on a Tuesday night. We were greeted","useful":0,"cool":0},"bHLGHuM1zbQaaqvqJg56FQ":{"text":"Just had happy hour with our bartender Brandon and everything was AMAZING! Great happy hou","useful":0,"cool":0},"Jd0ng_C-dt6rjayBuD268A":{"text":"Awesome atmosphere! Friendly staff. I had the chicken salad sandwich and the wife had the ","useful":0,"cool":0},"DdMLyoiWSm-rxDajQ6zPjQ":{"text":"The food was very good I had the egg Benedict with crab the eggs were cooked perfectly! It","useful":0,"cool":0},"G-Xk_iPkKL0L_QY_Uug0wQ":{"text":"best breakfast in New Orleans by far! I\nwish I had eaten here every day. I tried all the r","useful":0,"cool":0},"ydUGb8f7n8tl1I0F2aXBxQ":{"text":"The best breakfast I have ever had! I was on a visit and when I come back this way I will ","useful":0,"cool":0},"kHQ1msQmVhaydO1ijV0b_g":{"text":"Chili Soup: Good\nShrimp Paella Soup: Good\nCrab and Corn Fritters: Excellent!!\nPasta w/ Cla","useful":0,"cool":0},"yphoU1T13HcA7cNWF2R-aw":{"text":"Best blueberry pancakes I have ever had. Highly recommend you order them!!! \n\nI have been ","useful":0,"cool":0},"yHpjUomOJhgzAMdnCBLa7A":{"text":"Food, it was a really good! The drinks were on point! Server very attentive friendly great","useful":0,"cool":0},"rc2Jw8Y_sAB4UOP0aHC-Hg":{"text":"Fantastic little place on Magazine St. you can tell the chef really cares about the food.","useful":0,"cool":0},"jhRjBakddF8_VxukWa5-pw":{"text":"Stopped in for brunch on a Saturday and was elated that we made this our choice. Loved the","useful":1,"cool":0},"KTY3BQ8ks-E1d-eR5QL5ig":{"text":"Came for brunch with my girlfriend based on a recommendation from a friend and Red Dog Din","useful":0,"cool":0},"n6WsoW2-Lc56ykPAcAucjA":{"text":"Soooo i'm embarrassed to say that I frequent Balcony Bar, Bulldog, and Rum House (places c","useful":0,"cool":0},"oUTCK_ZIUA2gfgkHpOC7CA":{"text":"Here again, our go to place for good drinks and good food. We visited twice on this trip. ","useful":1,"cool":0},"-GBgtXjNrGP2NwL0v1cDkw":{"text":"We had the best server, Britney, (I think), she was awesome. The food was full of flavor. ","useful":1,"cool":0},"RXYzTPhIDj7WNSHV_xBKCQ":{"text":"We stopped in here during happy hour at the suggestion of a local tour guide, and boy are ","useful":0,"cool":0},"onNvZp0bBmlOBFNEIlQ_0A":{"text":"This place is a must go to! The food was amazing! I highly recommend the oyster bake and m","useful":0,"cool":0},"XJOHvitWQAuhHpk5pCs_OQ":{"text":"The place was cute, our server was exceptional. The food however, very subpar. By the tast","useful":0,"cool":0},"ayhEkWL0Zl5b1SYJj25sag":{"text":"We got to NOLA on Wednesday afternoon, so we decided to make Red Dog our first brunch/brea","useful":0,"cool":0},"3T6gr24YEoa52uW-I4Setw":{"text":"Came here for brunch Saturday morning. I had the crab Benedict and it was divine!  Great p","useful":0,"cool":0},"7ml_u8F-rT8JUHasBqCi6g":{"text":"Ask for Kelly\n\nRed Dog Diner \n3122 Magazine St.\nNew Orleans \n\nWow \"\n\nEggs Benedict with Cr","useful":0,"cool":0},"E-ZtpOKXNe_OoUbvurVxJg":{"text":"Our bartender Brandon was awesome!  My Bloody Mary was so wonderful. (Real juiced veggies ","useful":2,"cool":1},"iqueleZ_fpAr8S0mgE9wvg":{"text":"Very slow perfunctory service with staff that doesn't engage customers or notice that you ","useful":0,"cool":0},"83MqSsEJdd9ySTbtJx5NBg":{"text":"I've been here several times and each time has been extremely pleasant and the staff is so","useful":0,"cool":0},"KmdbQPKDrGK9lSr-D00QeA":{"text":"This restaurant is amazing. Cute atmosphere, amazing food, very great prices! \nParker is a","useful":0,"cool":0},"zcV7wSwVM_El39PegrrmXw":{"text":"Delicious sweet potato pancake, spinach artichoke dip, crab and corn fritters and more","useful":0,"cool":0},"Zun7yO9bspYMA88Kt4mC3Q":{"text":"Hands down to the best crab and eggs sardou. The salad is really nice too. Be prepared to ","useful":1,"cool":1},"x7CUUF2FiMclyGKaaZrFKQ":{"text":"Haven't had a bad meal from there yet, although on Sunday it's usually a wait out the door","useful":0,"cool":0},"E7wftG3QWVs_gkKSigKv7w":{"text":"Best crab bennies oh wow I finally found in Nola!!\nTrust me this place hands down will cha","useful":0,"cool":0},"ywYyIb1q3UMNU0_44m2_QA":{"text":"Had a really great breakfast here. Fast and friendly service, very cool decor, and great f","useful":1,"cool":0},"pZ7jEF6yCSpV1UZ7z9CPig":{"text":"Love this place, everyone loves this place. There is always a wait!!! But while you wait w","useful":0,"cool":0},"Ll_WIGCsj2ok5qxdFzrgKA":{"text":"This place is a gem for foodies.  Very interesting dishes at VERY reasonable prices.  Grea","useful":0,"cool":0},"n7aUXCBRDYhfBmMc4kgKtw":{"text":"This place was absolutely divine. We had the most wonderful experience. We were greeted so","useful":0,"cool":0},"VJuhjHAKkpPWwUqIzKnP_w":{"text":"We came here on a whim after trying several of \"NOLA's Best\" breakfast/brunch restaurants.","useful":0,"cool":0},"qFlOSgWCMJUS-WfQE3rZxg":{"text":"Food was awesome! I had spinach dip, prime rib sandwich with shoe string fries, and an Amb","useful":0,"cool":0},"eTAnguzmh4m6XmQfKqer4w":{"text":"Food was great! Lizzy was our server and pulled through with the food recommendations. Bes","useful":0,"cool":0},"Yz9ZnM7blunAxyZCxTWiOg":{"text":"AMAZING! Do not be fooled, it is not a diner! They have delicious southern inspired dishes","useful":0,"cool":0},"UKhoOAQh9TBO_D-w-sFusg":{"text":"The best breakfast I have ever had.  The grits were so creamy.  The crab and shrimp omelet","useful":0,"cool":0},"m93rnOaVNt-P77AsAq0Vhg":{"text":"I came here multiple times during my trip to NOLA. great food, service and drinks!! highly","useful":0,"cool":0},"S7e62hWNKM7l7aGFD4MHXw":{"text":"Had some great food in NOLA this week but the dish that takes the prize is the salmon slid","useful":0,"cool":0},"TIBtwTW0UXGIIAfEJ0uiWg":{"text":"Best breakfast in New Orleans!  Absolutely worth the quick Uber ride to Magazine Street.  ","useful":1,"cool":1},"emgXeDXVLtMfhDx3PtQEhQ":{"text":"Awesome food and drinks. The wait staff could be more attentive. I was there during a time","useful":0,"cool":0},"VIpc3VwMs2HXtylUcJKJRA":{"text":"Good lunch! Had the deviled eggs... SO GOOD! Rueben was great and salads delish! Very cool","useful":0,"cool":0},"KVDQsyA5jQI6EILOiJZa7w":{"text":"Need to bring Back the old manager.  Sat at the counter for 10 minutes and was ignored.   ","useful":0,"cool":0},"GhJ5Ds704BSJCOcy4mF2kw":{"text":"Awesome little place!  We went today for brunch and enjoyed every bit of it.  I had a Bloo","useful":3,"cool":2},"KW5y31ynrq1WZddAxyguUg":{"text":"Red Dog Diner is our favorite restaurant in New Orleans! The food and unique drinks are in","useful":0,"cool":0},"ONNhEAPsAWNA2exH5AiEbw":{"text":"What a great new gem of a place on Magazine Street!  I've been to Red Dog four times, but ","useful":2,"cool":2},"IDrjeDcqA0JV08DHElCBUg":{"text":"I went specifically for a cold sirloin sandwich which is on the menu in the window.  Appar","useful":0,"cool":0},"rVG_EHXxwid1zJZ4QFLBSw":{"text":"Was walking down the street and decided to stop in. One of our people in our group had the","useful":1,"cool":0},"05pYoPg1roNzKDmvi1oYOQ":{"text":"Really good breakfast, and can't wait to try lunch/dinner. The service was friendly and pr","useful":4,"cool":2},"57lanES1U3Kfu5HXdW6XeQ":{"text":"Buena comida,buen servicio y el lugar es ameno. Los macarrones queso son deliciosos con un","useful":0,"cool":0},"bJNK4s8hoN1ekPaOL913LA":{"text":"We loved this quaint little place on Magazine street. We have probably passed it a dozen t","useful":1,"cool":1},"hZ2lh7SGFKkv82GkGCoHpw":{"text":"This place is excellent! The food and drinks did not disappoint. The smoked salmon dish an","useful":0,"cool":0},"O12eW8ysb96ZQdRa0Ga4Kg":{"text":"Had a delicious breakfast sandwich! Fresh ingredients, great coffee, quick and friendly se","useful":0,"cool":0},"fARLfbfOgtXWomE48gcm-g":{"text":"So many delicious items on this menu, and I can't wait to try more. The place is really cu","useful":2,"cool":2},"RhSmgvv1W27f-MXbEn3M_g":{"text":"Fantastic selection for restaurant week! Such unique gourmet drinks. Love the veggie sandw","useful":0,"cool":0},"qmBBm-g0LNmMrKnSoCQt4Q":{"text":"My new favorite breakfast place in NOLA!\n\nSix of us all enjoyed each entree.\nThe waffle wa","useful":0,"cool":0},"NHKPlQj3lUH5RhobG5QMyw":{"text":"This place is incredible. Home run for sure. I didn't know that it has the same owners as ","useful":3,"cool":1},"GRYlDUHe-WpYxf8yB1x-pA":{"text":"This is one of my favorite places for casual dining on Magazine. Everything I have had her","useful":0,"cool":0},"sTXyfji-rLrR5YKgEUSThw":{"text":"One of my favorite places in New Orleans to eat when I visit. Service has always been fant","useful":0,"cool":0},"z75wEgI03soApH4P9clGmQ":{"text":"I wound up having lunch at the Red Dog Diner a few days ago & really love it there.  We or","useful":0,"cool":0},"7Lh7OSTNX5ZuNWsBV07kuw":{"text":"Well, I truly love this city, the feel, culture, history and the food! This place is a mus","useful":1,"cool":1},"3D5dgHHIMaZqsrIZewrUmw":{"text":"My friends and I chose this restaurant for brunch on Sunday, we arrived a lil later than w","useful":2,"cool":1},"LhdFe5QV80WGhMasAqI8tQ":{"text":"Smokey Mac and Cheese was great.\n\nDiablo Duck was good.\n\nBanana pudding was good but meage","useful":0,"cool":0},"Blei7cQtisrcm9MG_6tW3w":{"text":"The crab pimento dip still is a life changing event.  Eggs sardou is also a must have.  I ","useful":2,"cool":2},"LcrWoEmNwYG-e-qXQ5Gupw":{"text":"Very cool spot, with nice seating at both front and back.  Colorful and crowded in a great","useful":0,"cool":0},"5zEjGRzTb3hYiIw_r8OyBg":{"text":"Negatives. They can be a little inattentive when they get busy. I sat at the bar and until","useful":0,"cool":0},"AKXYmPjgoHDKLoA1X_okZg":{"text":"Everything we tried was amazing. We had happy hour appetizers and drinks and they were so ","useful":0,"cool":0},"hjTTabxQ3EjcnC1vx9qZLA":{"text":"The staff here turned a bad situation around into an amazing experience. We arrived with a","useful":0,"cool":0},"Qvl-dbtA-jg88HCuzAewLw":{"text":"The Crab melt was ok but the queso and calamari were amazing. Definitely a vibrant and coo","useful":0,"cool":0},"SC1EveG-X88Qzt5PJyKcNQ":{"text":"Absolutely delicious. Been there twice already for breakfast. Definitely need to go back f","useful":1,"cool":1},"mK9tKQLbG6nXV_YNIiRKSQ":{"text":"As our first meal in NOLA, my friends and I were not disappointed! Because it was brunch t","useful":1,"cool":0},"DatgzG7rhtsvHNUm2lxNXg":{"text":"Staff super helpful and polite, which is a great plus. Food does not take too long and tas","useful":0,"cool":0},"E24yb0It1ysM5dQXZWxIFw":{"text":"Outstanding food and service. Actually now one of my faves in the neighborhood. Will defin","useful":0,"cool":0},"tU-BqRQjeULrmIb_iy6czA":{"text":"Visiting from DC and found some great food, good drinks and nice atmosphere...we will be b","useful":1,"cool":0},"Z_Qsv2Fvn_cbkU7zl7eAxg":{"text":"I typically go to the same place for brunch everytime I'm in town so I decided on somethin","useful":0,"cool":0},"qGdYbpFYPTPGb0-Y7HIqMA":{"text":"Soooo...\nGreat food\nGreat service.. \nfunny thing is - there were egg shells in my eggs and","useful":2,"cool":1},"zz2bCn8ZZkP0bvzw1xff0w":{"text":"Great service, food, and ambiance! We had just made it for the happy hour and had double s","useful":1,"cool":0},"WIik0T-4M10HzrcNpU-G7A":{"text":"Red Dog Diner has a unique and delicious menu. They have indoor and outdoor seating andqui","useful":0,"cool":2},"aj8tSCZKh0Ol5fSAyKjEIQ":{"text":"We initially overlooked this place for our dinner choice (we're visiting from out of town)","useful":1,"cool":0},"QsdfhVxWmqrzUvjD2MlwCw":{"text":"Finally got a chance to come here for brunch. Definitely came here for the adderall holist","useful":5,"cool":3},"eYET1w7AvGTI5XqJFPU2yQ":{"text":"Red Dog Diner is a casual, laid-back spot and we had such a nice, chill evening there. We ","useful":0,"cool":0},"HFmq3H5UI_EVf6dsSLEUNg":{"text":"I loved this place. It was such a cool space. Our waitress was sweet and attentive and the","useful":3,"cool":1},"7RnanjwSK93ujt7QM1IE9A":{"text":"Left my credit card after brunch the other day. Called the next day and they confirmed tha","useful":0,"cool":0},"aCn0vAisYNLsQU7lSZdqnA":{"text":"So good. I'd take a photo of my food but I already ate it. Had the cauliflower omelette, s","useful":0,"cool":0},"N4IbxzH0ueruhsX2FWpryw":{"text":"Really great place! We had no idea where to go so we were wandering up Magazine until we f","useful":3,"cool":0},"fP8yfcmEXfhLdYoFQ3CJ4A":{"text":"I am wayyyy into this place. Food was excellent. One of the best brunches in town. Drinks ","useful":1,"cool":0},"DGE2UvVGK2_iicCKm2a9UQ":{"text":"We had the duck waffles (with added hot sauce recommended by server Jacob), tamale meatbal","useful":0,"cool":0},"O7HUFxaKebnRfVebBUz68w":{"text":"Excellent food and service.  Great lunch spot.  Corned beef hash was one of the best ever.","useful":0,"cool":0},"0QwcPg788WbX17FKvm4XEw":{"text":"So, so good. I always know a place is going to be good when I experience menu paralysis. J","useful":0,"cool":0},"o1wzr5xLZVV71Fmt76BUuQ":{"text":"I honestly want to give this a five star review based solely on the food, because it was d","useful":0,"cool":0},"tpMRTSwVbso9jPjg9FQGbA":{"text":"So, We woke up hungry (hungrier that usual).  Up until the minute we'd gotten dressed and ","useful":2,"cool":1},"P8G-PptNNVinA7-kXjP8qg":{"text":"Excellent food and service! Very large portions for good prices.  We came around 11 am on ","useful":0,"cool":0},"Y74eJ2lUI2WL1eGASL5JbQ":{"text":"This place is worth the trip out to the Garden district. My vacation is long over and I am","useful":0,"cool":0},"6U4k1xteVL5WoW-TIqROsA":{"text":"This is a must try! Food is cooked just right, the blueberry pancakes and grits are our fa","useful":0,"cool":0},"DJwxn_Rn69FyllBVDriSBw":{"text":"Envy will get you nowhere...maybe not but I still have envy of this place not existing in ","useful":2,"cool":0},"hmiFptH-tosU5hV556HuOg":{"text":"Very approachable and a nice spot to stop for lunch or a drink. Really cool vibe and decor","useful":0,"cool":0},"8LxxF2fFsy0d_gdyNLNVDg":{"text":"Just wanted to update my review because I've been back to Red Dog a lot since I wrote my l","useful":3,"cool":1},"WaQ_K5MuM6T1EajBTI4zSg":{"text":"This place came recommended by our Lyft driver and let me tell you it definitely did not d","useful":0,"cool":0},"bmBGawXjCpVfg5idxf8kqw":{"text":"Waited and hour to get a table.\nHad the Prime Rib Benedict and the Blueberry pancakes. \nBo","useful":0,"cool":0},"5TaFLGayA7irRUkJgoTiXg":{"text":"My husband and I went here for happy hour. We had the quail and waffles, tamale meatballs,","useful":0,"cool":0},"Spl4qBP5Ffn1C7uHkUthfQ":{"text":"Went because of the great reviews, ABSOLUTELY  was not disappointed!! I had Huevos Rancher","useful":0,"cool":0},"xBUeYzPpXLGezcjYk3rmvg":{"text":"Looking for breakfast one morning I happened to finally try the Red Dog Diner. I have lite","useful":1,"cool":0},"ZZvIq02aw3fRUqswkuapoQ":{"text":"Stopped by on our way to La petite grocery. We walked in and were immediately greeted by t","useful":1,"cool":1},"7JMZHia_Fh5p1qs7lPVZtw":{"text":"Brisket tacos are unbelievably good, Molly our server was incredible.  House Margarita was","useful":1,"cool":1},"-wXVM3KNeMvZX27b6T9x0g":{"text":"Sometimes you just want to eat. Sometimes you don't want brouhaha and fanfare. Sometimes y","useful":0,"cool":0},"d5bGJvSooK1pd2yxk-5W3w":{"text":"85% of the times I've come here I've been truly pleased with everything I've ordered. The ","useful":0,"cool":0},"IBwyCAEA5frLjdzt5UFGzw":{"text":"Open on holidays, friendly workers, good/large portion food items all make this spot a nic","useful":0,"cool":0},"PrP70kdxDrrNdHOFqeIvxA":{"text":"One of the highlights of my food experiences in NOLA!! \nMy friends and I all thoroughly en","useful":1,"cool":0},"621Qxo39fUlrt7Egc3uhuw":{"text":"I dont have alot of time right now but this place ROCKSSSSS!!!! I went last weekend with a","useful":1,"cool":1},"Ykp6OqXjXDt9rhOStYiUDg":{"text":"OMG! So awesome....we found the place in Yelp and I must say....OMG!! 1st off this is New ","useful":0,"cool":0},"Gktln3oNosJwXjRA8LGB0g":{"text":"Wonderful brunch at the Red Dog Diner in the Garden District. \n\nThe food and service were ","useful":0,"cool":0},"zMVeSjbAX6uA-RiR9Zz1CA":{"text":"Good variety of classic dishes, but with special touches. Everything had a twist that adde","useful":0,"cool":0},"tOQNjdptfBcQvIzupSHIkg":{"text":"I love this restaurant! I came with my sister and my mom looking for a quick bite and we a","useful":0,"cool":0},"tSvtj-MHuH5rUfS2reThcA":{"text":"So good! A must try if your in the local area of the Irish Channel in NOLA. The prices are","useful":1,"cool":0},"BBtZ6ehfvUhv6vvSyGgEUg":{"text":"Ok so we decided to try a new and different place in New Orleans for brunch and my cousin ","useful":1,"cool":0},"QsNKGAcGqXmfYjMDSJVyUA":{"text":"Came in for dinner and absolutely loved the food ! Keith was our server and was such a dol","useful":0,"cool":0},"OHxQhZmO3lEjz91CAVYtew":{"text":"This diner just opened up a few blocks from my house, and I had breakfast there this morni","useful":6,"cool":3},"3qLYkM2l3fcQEQW5YNRKPA":{"text":"I stumbled across this little gem the Saturday before St. Patty's day. It was the only pla","useful":3,"cool":2},"DJWlfmKhyCBX6byAEYZmBw":{"text":"Ordered the eggplant stuffed shells. This was a bowl of sauce with a small dollop if ricot","useful":0,"cool":0},"H24oqedYKTqv3L96jx4SMw":{"text":"My husband and I ate here for dinner on Monday night and enjoyed it so much that we return","useful":0,"cool":0},"jyAo864FCs4NaFD6wl-CNQ":{"text":"This is the place to go for happy hour!! 1/2 off house drinks and apps/snacks which seems ","useful":0,"cool":0},"LAyIEJQUNgrvw-fEYiZTSw":{"text":"Absolutely delicious. Been there twice already for breakfast. Definitely need to go back f","useful":8,"cool":4},"G5bUA_-NA7f4a_EZP_Z_2A":{"text":"One of our best dining experiences in NOLA!  The service, atmosphere and food were all inc","useful":0,"cool":0},"S-5jscS0ENyhfl0JcmC3TA":{"text":"PATTY MELT & TAP WATER: $17.50\nafter tax and a 20% tip. Ouch, these are not diner prices! ","useful":11,"cool":3},"4U9IcOCujqIHtK_50hnW7A":{"text":"This is a really good place to eat with amazing dishes in a neat area of the city. One of ","useful":0,"cool":0},"qObssKryGaQf43If23ONjQ":{"text":"Always amazing food. First time I came here the power was out so no waffles, but the food ","useful":2,"cool":0},"ePLvCTlCUXEpu79I1jOeDw":{"text":"Had two meals here on our trip to New Orleans. Had breakfast both times and really enjoyed","useful":0,"cool":0},"Kyyh48oIHpzqDr2Msi7MlA":{"text":"I've been to this place a few times and food is consistently good and a good value. Had th","useful":1,"cool":0},"DNrodFqesbCj9VKRiPHgaw":{"text":"Cute, cute location! Short wait on a Sunday morning.\n\nKitchen sink bloody Mary's were the ","useful":1,"cool":0},"V1Grt8R8e_idRjD2GoYZsQ":{"text":"This place is amazing!!! The atmosphere, the food, the staff...excellent. I had the shrimp","useful":1,"cool":1},"zEfYhttjLEiiW_yte7IhHw":{"text":"3 1/2-ish out of 4... I want to give this place a 4 sooo bad, but no. BUT.  I had the prim","useful":0,"cool":0},"NF59J0wRJhk82Uq2wKZD3Q":{"text":"I've been wanting to check out this local spot and sister restaurant to Bourbon House for ","useful":1,"cool":0},"PP69w3u3DqyrKUrRYvUJ1A":{"text":"Cute, cute location! Short wait on a Sunday morning.\n\nKitchen sink bloody Mary's were the ","useful":1,"cool":0},"9gqZDTjhUFBwOhdJKsX1Ng":{"text":"First time here found it by accident walking from nearby Laffyette cemetery #1 through a h","useful":0,"cool":0},"WI1lPn50p4xce4ZGs_i6Ag":{"text":"In a town of delicious food, Red Dog diner is a disappointment. I ordered the hipster brea","useful":1,"cool":1},"X6UO6iJ7HKaJmhW5qfB-HA":{"text":"Had brunch here while in town.  Had the Crusted Crab & Eggs Sardou which I loved, plus a s","useful":1,"cool":1},"sDemFi57yyMY73NXrg_47Q":{"text":"Fresh tasting food!  After visiting NOLA we wanted something other than seafood and so gla","useful":0,"cool":0},"CNMNch4OI9UFmZf6XRKKJQ":{"text":"Awesome brunch and the dinner is pretty good as well.  I never thought I'd find a better s","useful":0,"cool":0},"W6jYOFsZ6kvR9Vv7MafyOQ":{"text":"from the time we walked in and the homophobic  host or manager whatever this man was, was ","useful":0,"cool":0},"7hRIXIt5GQH-GyEavyvdRg":{"text":"Really good breakfast place on Market Street. I had the crusted crab and eggs sardeu and i","useful":1,"cool":1},"0xJduFhgSCslkrd8za7MXg":{"text":"Gotta say it, this place is a surprising little gem. From the outside it looks like a rath","useful":2,"cool":1},"cXnWa0Hwy_wacucnqiuslg":{"text":"Outstanding pizza best tomato jam I've ever had and the hospitality priceless Terry is ama","useful":0,"cool":0},"vhpWouWhRStmNiyY_Fbe9g":{"text":"I had the deviled eggs, crab & corn fritters, chili glazed pork & smoky mac. The eggs were","useful":2,"cool":0},"RFChjz1381kv-ZX9lAL38w":{"text":"I wandered in here while I was walking through the Garden district and was extremely glad ","useful":0,"cool":0},"U-l6rYoF8Q02MNamFeO1YA":{"text":"Great! We ordered at the counter and the wait was quick.  Everyone was very nice.  We only","useful":5,"cool":4},"gIz_cQOvcZFBe3zuXY89UQ":{"text":"Fantastic food and cool atmosphere! Great little market next door on the weekends. The chi","useful":0,"cool":0},"MgDZyiwGCyg8-4SSpYBMsg":{"text":"wooo. Went here to have dinner and thought they might have the LSU game on, but they didn'","useful":1,"cool":1},"iu-zHAeaI-uucB_sUloEZQ":{"text":"Try the goat cheese quesadilla. And the funky monkey dessert ! Delicious!! And service ver","useful":0,"cool":0},"zJEsCPU6yDoOV2092iY1Hw":{"text":"Just had the best brunch ever here. Cute restaurant and good service. The food was amazing","useful":1,"cool":0},"3RTiRoLCqcm9MbtcTXKSqA":{"text":"Pasta was amazing!!! So fresh and saucy!!!! I was very pleased with this dish! The best th","useful":0,"cool":0},"0gaSAsFH0zgyTNN7cetB9w":{"text":"We ate breakfast/lunch there. The flavors were incredible. Atmosphere was rustic. Service ","useful":1,"cool":0},"TgjFZ5NpiHGaDTZc1ZAfAA":{"text":"I'm a little late to the game on reviewing Red Dog, but I can assure you it was during its","useful":6,"cool":3},"b2KjFazuNcc76EPJyDXmIA":{"text":"I have eaten at the Red Diner a few times and love it.","useful":0,"cool":0},"8Ru9od_v478LY04i5yOrBg":{"text":"This restaurant serves delicious food. The four of us split various dishes. We really like","useful":0,"cool":0},"zT0ZNeIPbK0Rtz7RBeBIiw":{"text":"Red Dog Diner is a must when visiting New Orleans.  Came here for Sunday brunch and had a ","useful":0,"cool":0},"E8wtKH9H6jfkGnsMtBTFMw":{"text":"Went to Red Dog at amount 10 on a super dreary Saturday morning. There was no wait so we g","useful":0,"cool":0},"ckI83FIB5WoUan6C0BfpTg":{"text":"Red Dog's take on Seafood Paella might be the best single food item I have ever had in New","useful":0,"cool":0},"xzKp3vW5fA1gAkdXpjytcA":{"text":"This place is fine. Nothing mind-blowing about it. Nothing appalling about it. \n\nWe went f","useful":2,"cool":1},"oJ8eNm2ajN0mPUQVsc02IQ":{"text":"Such a lucky foodie find. \nIt was pouring after our tour of the Garden District and we nee","useful":2,"cool":1},"7nLLFQSOnkO4wNrZRdgTsw":{"text":"In a city where the happy hours seemingly last all day long, this Magazine Street gem is o","useful":4,"cool":3},"4-uQCbHfcOaqm_TXUmBoew":{"text":"Xlnt place. Our lunch for four was great highly recommended . Great veggie sandwich. Great","useful":0,"cool":0},"qy6J0sTqxHM085wkpoeqgA":{"text":"Service and seating process during COVID went better than expected. Staff were nice and pr","useful":0,"cool":0},"VrPquOSfbXe8Xq84bhM-nw":{"text":"Red Dog Diner was everything I wanted in a weekend breakfast spot:  \n\n--Casual dining with","useful":17,"cool":16},"zgI3uHCHBQwLBvjts5YT7g":{"text":"Whoa. I stopped in here on Mardi Gras and BINGO! we have a winner.\n\nFor starters, I was so","useful":9,"cool":4},"6gz47vtia3QTILoVjkEaIw":{"text":"Came for brunch and ordered The Crabby Shrimp omelet. It was incredible! Loads of crab, te","useful":0,"cool":0},"EJ7kXyP3U2O1u8NbF-Tt7Q":{"text":"This is becoming one of my favorite uptown restaurants. Eaten there several times on the p","useful":0,"cool":0},"fX-6b4dpCUdX3SJpA6tplg":{"text":"I have no earthly idea why it's taken me this long to review Red Dog, I've been coming her","useful":0,"cool":0},"3Ej5Mqq6YN2CGUSDqTf42A":{"text":"We ordered a TON of food based off of the reviews and we were not too happy with any of it","useful":1,"cool":0},"l5QlGoCd-IkEXXUQwXEUlA":{"text":"Fantastic experience! The food was fresh and delicious, 3 of us shared the nosh plate, a s","useful":0,"cool":0},"A8eXU-mfEfnRk1IxAnMZEQ":{"text":"I wish I could eat breakfast here every day. My favorite thing from here is the Irish coff","useful":2,"cool":1},"YjIdvcAjVqXZLHVGm30q7A":{"text":"Loved this place! You gotta get the crab and bacon dip. It was out of this world. We went ","useful":1,"cool":0},"UxaGEYChB-eQb4WL878z5g":{"text":"Was suggested this by a friend that currently lives in NOLA so we decided to stop by for b","useful":0,"cool":0},"9tr_XTjcRe5VxFzSv9G7uQ":{"text":"Excellent service. Excellent food. The reviews are accurate. We sat at the bar in the fron","useful":0,"cool":0},"8B_7jsM_uWOkEWrUbRMpBw":{"text":"There were tons of opportunities related to safety and social distancing. I went for a lat","useful":1,"cool":0},"jgaNTG7C1ufvzC9-JK3cJQ":{"text":"Had the pleasure of dining at the Red Dog Diner on Magazine during their weekday happy hou","useful":2,"cool":1},"mNdRLzdJ7426bT0RI9-o6w":{"text":"So good!  We were looking for a place to visit on a rainy Sunday morning that wasn't crazy","useful":1,"cool":0},"aE-uYA4Xj3ZF4W0hqSzwUg":{"text":"This is no \"diner\".  A pleasant surprise!  So yummy.  Fantastic service as Alyssa took car","useful":0,"cool":0},"BOk8XY5iRBv64NCg0Cm84g":{"text":"Delicious food, drinks, and awesome service! I haven't visited for brunch, but have been f","useful":0,"cool":1},"vSgTcY2BDDS1kLzr_lcEwA":{"text":"We were in New Orleans for a week and had to eat here twice, it was so good. Great food, g","useful":0,"cool":0},"x0M3Jf9PnYZI3w7e8l9Y4Q":{"text":"Went for breakfast last Saturday... no crowd no waiting. The pecan waffle was perfection, ","useful":0,"cool":0},"5W79E6hQrou6JqnztYONEw":{"text":"Surprisingly good breakfast. Great huevos rancheros and delicious blueberry pancakes. Spic","useful":0,"cool":0},"6ggc0vpVDPR_m_7mH86fpg":{"text":"First time in NO and this was my first meal. I certainly hope I get this lucky for my enti","useful":0,"cool":0},"hejg1IXGe-4Xoy9LT_KrRA":{"text":"Just had brunch here. We are locals and always looking for a great brunch spot. First of a","useful":0,"cool":0},"cstXWYhc7a_6NQezwzTx2A":{"text":"Breakfast here was DELICIOUS! We got the blueberry pancakes and a biscuit sandwich with to","useful":1,"cool":0},"mPIo8DlaLKrfNxSRKAQl9g":{"text":"The food here was really great! We had the Mac and cheese waffle with fried quail. The dri","useful":0,"cool":0},"KESfn14FtNxVSit1CqPY4Q":{"text":"Great food and drinks and classy rustic ambiance. We had a great meal!","useful":0,"cool":0},"jh2PFPW_7eCXATY5Jovg1Q":{"text":"Best Nicoise salad I've ever had! Fast and friendly service.  We were quickly seated in a ","useful":0,"cool":0},"WYtziWuk1lX6Qvruk-LrAg":{"text":"Excellent food, excellent service. Heard about this place from a local. I tried the quail ","useful":0,"cool":0},"wvm12TP7g6bU1Gjfz69heA":{"text":"Great place for brunch! It's right in the heart of magazine street, sit outside and people","useful":1,"cool":0},"UEiQUtGDMyP9RGr53FtPsA":{"text":"Excellent eggs sardou with lump crab meat -  perfect proportions. One of the best Bloody M","useful":2,"cool":0},"YPvK6y6lI3ukCg-hBO7C_w":{"text":"After wandering around aimlessly in the hot New Orleans weather we used Yelp to help us fi","useful":4,"cool":1},"seXcqTGBMRUhlMnhZJiP6A":{"text":"Today was my first time at Red Dog. I work down the street and they had a few vegetarian o","useful":0,"cool":0},"Y1BlvDAuKuAocCReUKLD7A":{"text":"Normally this place is known for its brunch but I came for dinner on a whim and was thorou","useful":1,"cool":0},"uGEgK9hzNdpIWoEwyhW8gg":{"text":"Lots of great options on the menu. I had a drink called \"That B*tch Katrina\" that was deli","useful":0,"cool":0},"EtZMPDnL_SrFOD7wcFuLwQ":{"text":"This place was amazing!!  Did not disappoint at all. The service was great and the food wa","useful":0,"cool":1},"v5r-KfBDA9VxZiy8DREfbA":{"text":"So so delicious. I got the huevos rancheros and my husband got a salad nicoise, and we eac","useful":1,"cool":0},"QlfNH5-6wtk1RH9n3Rgd_g":{"text":"Surprisingly good breakfast. Great huevos rancheros and delicious blueberry pancakes. Spic","useful":0,"cool":0},"2Dzi9M25Y6b-uaTKhSs7qw":{"text":"It's alright. That's pretty much all I have to say. Just an average experience. \n\nThe wait","useful":0,"cool":0},"SbMCVjoM1LCXOgftvRrkvA":{"text":"Great food! The Crusted Crab and Eggs Sardou is a MUST! As an appetizer the Crab and Corn ","useful":1,"cool":1},"YhBrEzmNaByKVu-ZsZVP6g":{"text":"Great find on Magazine street! 40 minute wait for a table but we were able to sit at back ","useful":0,"cool":0},"SJs1V7Jn2U1FuZSgDtA_Tg":{"text":"Amanda is sunshine!  \nI'm big into brunch.  \n\nThe star rating is based on two visits of ge","useful":3,"cool":2},"50gO3ncoxvChFkJNbw2qlA":{"text":"Food is decent, but the service is painfully painfully slow. Waited about an hour after or","useful":0,"cool":0},"9Y1qpOWF5cU7Bvg0hE0EIQ":{"text":"Nice place. Food was good and portions were the right size. Prices were reasonable. Becaus","useful":0,"cool":0},"72A6w5fHFCIm54N9FIj1Yw":{"text":"Yummy!!! Only had 24 hours during our stopover in NOLA and since we've been lucky enough t","useful":1,"cool":0},"QD6Iu4OqxvH9vD-nml-dTg":{"text":"We just left here from Saturday morning brunch. From the start, everything was amazing. We","useful":0,"cool":0},"t2FFzXwP6El4mZhDU6KaoA":{"text":"This is a perfect spot for brunch! This place is what I would call a fancier version of di","useful":1,"cool":0},"_oOlTwCqNCZ_qCsL3PiO6w":{"text":"Brought my out of town visitor here for breakfast and the Red Dog did not disappoint.  Thi","useful":10,"cool":6},"HYVCiq6T-T4UGspmXt07TA":{"text":"The service was kind, and the appetizers really good. However I ordered a quite expensive ","useful":0,"cool":0},"EhSdCn9fAjUJN5-K_hSmhA":{"text":"Great stop in the Garden District. Smack in the middle of where you would want to start wa","useful":0,"cool":0},"VRRwd-IXSiBDAWdDjSyyyA":{"text":"Stopped by for breakfast the service was quick and friendly. My meal was tasty and I felt ","useful":0,"cool":0},"VkCwos9luHBjhpbj1Hmqvw":{"text":"We're having drinks with a large party of 12, and Jacob is the best!!! . He's only been he","useful":0,"cool":0},"yBfQMAQ609ZztGMzGd_yDw":{"text":"Was at a conference in New Orleans and wanted to get away from downtown for lunch. So, I l","useful":0,"cool":0},"EYQqTTMyXXZnhU9ISIf6_A":{"text":"We have been here a few times, and always have a good experience. The ambiance is cool, es","useful":1,"cool":1},"A6sFRZKhXYL6PHFvZtueHA":{"text":"This place is delicious. Almost every time we pop in the city, this is our go-to spot. Fro","useful":0,"cool":0},"c86NG8KJUSXM391axQpseg":{"text":"Tow words: yummy good!\n\nDrive up from our fishing trip in Venice, googled breakfast N.O., ","useful":0,"cool":0},"1gcRlEC_uERY7yCKIGCDNg":{"text":"We were in New Orleans visiting and this place had good reviews. The crab and corn fritter","useful":0,"cool":0},"OX0YHdjW9tJL1sZv9uKOHg":{"text":"after a long day of the Barkus Parade, finding a place to eat was a little easier thanks t","useful":0,"cool":0},"1whjUu0amxMCuHUKCJNJ8g":{"text":"We absolutely love dining here. Food was phenomenal, drinks even better and the service ex","useful":0,"cool":0},"2gaaeQxlFaFsGMrLvFPQMQ":{"text":"First time here and I have a new brunch, lunch spot for friends and visitors! Everything w","useful":1,"cool":0},"AUDtzJV58UrZo7x67k98DQ":{"text":"Absolutely glad we stopped there.  It's a really laid back place with great food at a grea","useful":0,"cool":0},"jEF64lqz5TIEwp3ljedf_A":{"text":"Delicious little restaurant near the garden district. We had exceptional service, great dr","useful":0,"cool":0},"-0KppdyKNi5RExqLzHSarQ":{"text":"I am not sure what I was expecting about this place but it definitely it surprised me posi","useful":2,"cool":0},"O7tFodg_sYj1UB5eRhzEfg":{"text":"Fantastic service from Sydney!  Thanks so much!  Worth the trip from Ireland:-) We had the","useful":0,"cool":0},"9QaBEkgb8nIZaMc0KzcQwg":{"text":"Let me just say: this is better than any restaurant we went to in the French quarter. We v","useful":1,"cool":0},"f1v_AqdWmo7xtbg2hD-f1Q":{"text":"I was getting hangry on Magazine Street after a few hours of shopping and my friends and I","useful":2,"cool":0},"43fQ6OgnnaY6tkuOSLCIqQ":{"text":"I can't say enough about how great this place is. It was one of the main brunch spots we w","useful":2,"cool":2},"KS1AowBycTJ1q8GCG7ci1A":{"text":"So good! The chocolate pie was fantastic! I got the chicken salad sandwich which was seaso","useful":0,"cool":0},"vLZT8_qTqy4jTsdttTNzyQ":{"text":"Fun drinks, great food, an all around good time. Loved this place. The sweet potato pancak","useful":0,"cool":0},"x4-eXDlj2sXcG0SrrzP1Yw":{"text":"One of my good friend always talked about this place and on Feb. 19 we went to eat here. I","useful":0,"cool":0},"4N7pT3vGbwyIINfAhCKnOQ":{"text":"One of my favorite places to go while in New Orleans. For the price, you get great value h","useful":0,"cool":0},"Qe1unUnVXOtGMO6OdX6fgQ":{"text":"First time here found it by accident walking from nearby Laffyette cemetery #1 through a h","useful":0,"cool":0},"FmYsVxLS5uGkp4QdhcBcmQ":{"text":"Absolutely great as usual.. I had the brisket hash omelet  and my wife had the curry roast","useful":0,"cool":0},"lsrUF01cnm3BZKvSFIUgHQ":{"text":"Really nice food and atmosphere. Love sitting near the window and watching the world go by","useful":0,"cool":0},"Q6z-H2nc-0wlevC9-3oEow":{"text":"My husband and I LOVE this restaurant! He's allergic to shellfish so it's tricky finding h","useful":0,"cool":0},"CpJqbRuD-qO4ODFtYIvWJw":{"text":"Surviving a golf tournament on a hot June Saturday can make a man want all the foods the n","useful":1,"cool":1},"z7bTjAkDC26SZU8FXb6j9A":{"text":"Came for breakfast during our most recent visit to New Orleans.  Located in a quaint neigh","useful":1,"cool":1},"9eifuxSkprsihTmRR0Bi7Q":{"text":"Came for breakfast during our most recent visit to New Orleans.  Located in a quaint neigh","useful":1,"cool":0},"LbF9SoMHUU9YS9dwTTJInA":{"text":"Just had a great lunch. My wife ordered a selection of sides, including the tastiest Bruss","useful":0,"cool":0},"LmRljE6PuqSG7IarpQzDPg":{"text":"Went there for lunch with my wife during our wedding anniversary trip to new orleans. It's","useful":0,"cool":0},"sIlZMiRk5BpbPE3nvlFOoA":{"text":"This is such a fun place with a phenomenally good menu.  The only problem I had when I cam","useful":1,"cool":2},"GRCd1zQmCqMyI1jaQOKk1A":{"text":"1 star off because the server took 20 minutes to great us. Other than that, really good fo","useful":0,"cool":0},"L-OhjB164eGjrOHtrx-Q0w":{"text":"I'm gonna preface this with it was a Sunday around 10:30, so asking for a table for 9 is a","useful":0,"cool":0},"mDRtG6zW7abCfPCeupHkBA":{"text":"Really good! I got the duck waffles and the Moose's Magnificent Mimosa. Would recommend!","useful":0,"cool":0},"xUEVSGeJdpe6UkmEPvuBoA":{"text":"This place grew on me after a couple visits. \n\nFirst thing to point out is that they're no","useful":3,"cool":1},"4lNBgmusvGowLJYlToZETA":{"text":"Wow!  After a tour of the Garden District we were starving!  Found Red Dog Diner on Yelp. ","useful":1,"cool":0},"kd8tQgJjxwc8Ircdu0Hakw":{"text":"They are open for takeout and outdoor dining 3 indoor tables for 4.  Wait outside to have ","useful":2,"cool":1},"K9gcnz9Hnz2T2KuPc3fg2Q":{"text":"Excellent place for lunch! Loved our food. The restaurant was more spacious than it initia","useful":0,"cool":0},"ktkmYzeNBBTmoRksqFLPLg":{"text":"The crusted crab & eggs sardou was absolutely delicious.  Instead of softshell crab, they ","useful":1,"cool":1},"OoTIp_FrPN51c-OJOLSvOg":{"text":"We found this place on Magazine St.  Red Dog Diner has a fun environment.  Amazing service","useful":2,"cool":0},"mGqwstgbBagFIi6LyJfdJQ":{"text":"We had a large group for lunch and it seemed like everyone enjoyed their meals. The dining","useful":1,"cool":0},"JdInRRSyPzZNLfaY89_3pQ":{"text":"The food was excellent! Every item we ordered had its own unique flavor. These guys have r","useful":0,"cool":0},"OyNheZ770YDim6k5rlA3Ew":{"text":"The first place I ate at in NOLA and I was not disappointed! I had the Parmesan Chicken w ","useful":0,"cool":0},"McdYKv5oj_GpoE_VHK1vzA":{"text":"This diner eschews the formica, chrome, and enormous menu of typical diners for a more ref","useful":2,"cool":1},"lCgm_HdgwT_8PEj1SFtdjA":{"text":"Amazing food. Very innovative and fingerlicking good. But had to wait for 1.5hr that's the","useful":0,"cool":0},"etkxNMeRoO_R-i7B5-Y8mg":{"text":"Great food and great service! We ordered a bunch of the appetizers and were not disappoint","useful":1,"cool":0},"D-e-392NELPVha002W7Hvw":{"text":"Fantastic food and service! The Patty melt is 1lb of burger so be hungry! Deviled eggs and","useful":1,"cool":0},"O3gHZuNdOBXNt6hJ-QXpXg":{"text":"We went there with another couple and it was fantastic! We started with drinks and between","useful":1,"cool":1},"zVHScc6jrTNHW-rtOZ54GQ":{"text":"Man lemme tell ya found this little whole in the wall and I was wearing socks before I got","useful":0,"cool":0},"kj3x10TtUF6ygXDH7NWxaA":{"text":"So good!! We didn't get a heavy meal here, but everything we got was awesome! The frozen d","useful":1,"cool":0},"OIFBA1MlKGnnxh9r91snWg":{"text":"This place is a gem! We ordered drinks, appetizers, and lunch and everything was amazing! ","useful":0,"cool":0},"23imGEPuLRPjCzZWAGFTRg":{"text":"The food is so hearty here . One of the best pancakes , just the right amount of fluff and","useful":1,"cool":0},"ZmJtk-EUfeWcN_Y48oqLfw":{"text":"This place is so perfect, from atmosphere, service and everyone working there just seemed ","useful":0,"cool":0},"CHzU8Nd98IjmsMvZBb6bFw":{"text":"Great service and delicious food. The brisket Humpty Dumpty (omelette) was very enjoyable.","useful":0,"cool":0},"ly0M_h50vE5aT8eHtM_1FA":{"text":"Was suggested this by a friend that currently lives in NOLA so we decided to stop by for b","useful":0,"cool":0},"eIiZM5n-xP7aZoohlWeDLQ":{"text":"One of the best brunches I've had in NOLA. The lump crab and sardou Eggs Benedict, corn be","useful":0,"cool":0},"oI_-ONsmKucXsS5O6zv4IA":{"text":"Great food. Breakfast and lunch specialties. I had breakfast food which was good and servi","useful":0,"cool":0},"SgMBrUh36MM7_UZypqXGIA":{"text":"Good food, got the Sausage & Pepper pizza was good, but was missing the onions the menu sa","useful":0,"cool":0},"eEVvC8UlE-phK2ESyXSpZA":{"text":"Cute little place. Came here on Wednesday late in the afternoon, no wait and found out the","useful":1,"cool":2},"Khgfw4FpK8yXLsDP-S33Xw":{"text":"I'm still on the fence as to my feelings on this place as on the one hand they do have som","useful":4,"cool":4},"5Mx3UauW_GiDFWQDzi-e1Q":{"text":"My absolute favorite breakfast spot!! I LOVEE their pancakes, sausage gravy biscuits & qua","useful":0,"cool":0},"Y3JnlRI8fCQ-WftkvxBhxA":{"text":"Amazingly good. I had Quail wing, baked macaroni waffle top with maple syrup.   It was a g","useful":1,"cool":0},"61ESQqr7oPaUM9PlPoAq8Q":{"text":"I came here my last night in New Orleans. I love the Garden District and came here when th","useful":1,"cool":1},"NgYr6JPHz3iA-zvJlxMsHA":{"text":"Food was really really good for breakfast . Only thing that was a bummer was the coffee bu","useful":0,"cool":0},"LCDbwgzY_pgxE9koqW2d4A":{"text":"I would give this place 4.5 stars. Really great atmosphere and food. The place is very cas","useful":1,"cool":1},"rxWE4HiXN_wQIXegtF_u2Q":{"text":"We finally came in this restaurant after being persuaded by a friend. We have seen the lon","useful":16,"cool":11},"jjnh9TV_77NiLIHk2oxHQA":{"text":"Great atmosphere, many tables (we were seated in 5 min. for Sunday brunch), and stellar se","useful":5,"cool":1},"usr-9-xNdWnWs-dQMePyIw":{"text":"I ran across their menu online and decided to grab a solo breakfast. I arrived around 9:30","useful":1,"cool":1},"yCkuOhmBnMfwXsbAd7qjvw":{"text":"Where do I start............... Well if you're looking for a Happy Hour before noon then t","useful":0,"cool":0},"xbfCv-JrqBlydR8So9OZnw":{"text":"Foodie dream!! Sorry we missed this place our first time in NOLA but so freakin happy we f","useful":3,"cool":0},"F-dUB1b8jXXk7fcoOYGdvg":{"text":"The food is amazing. You can't go wrong with breakfast or dinner.  The signature cocktail ","useful":0,"cool":0},"_IXpJnJiuI_Ba-VNqBeS1g":{"text":"Everything about this restaurant made it my favorite place for food during my weekend in N","useful":1,"cool":1},"V6ja9wUcK513ofravccUww":{"text":"While visiting from Chicago we wanted to get OUT of the FQ and have some \"real\" food. I'm ","useful":0,"cool":0},"oT-4FNWp_B_6PoBtgYNusA":{"text":"Had a few weekday lunches at Red Dog Diner in the four-ish years they have been open.  If ","useful":3,"cool":2},"dEiETw9OK2EV1cWq0HHqDw":{"text":"Go to Red Dog Diner and leave happy! Everything I've ever had here is amazing (although my","useful":0,"cool":0},"9XYBSsy0MDs28BFaibtxqg":{"text":"Amazing food, extremely friendly staff, relaxed atmosphere, great location, I highly recom","useful":0,"cool":0},"2SqlusnEncHksatFfnjb2A":{"text":"I am not a New Orleans native, but I visit every year. Of my 10 trips so far, some lasting","useful":0,"cool":0},"JrrgNVRJsQaNqTQ3_tb1yg":{"text":"Sooooo good! I had he Crabby Shrimp Omelette and  everything about it was just perfect. \n\n","useful":2,"cool":0},"ut8f0rhCuH7K2eL-7fXezQ":{"text":"Good food, great service! Drinks were really good! Atmosphere was relaxed, there are indoo","useful":0,"cool":0},"5qPvNVbfkvpVqy7uBslhhg":{"text":"For people visiting and people that like good food there are much better options for brunc","useful":2,"cool":0},"nnDsb9kL3m06kHufJ50Sxw":{"text":"We came here for the second time last night (first time was pre-COVID and wonderful, delic","useful":1,"cool":1},"RRh7mxn364XjARaIAkoryg":{"text":"My wife and I absolutely loved this place! We recommend 100%. Let's talk about that half o","useful":0,"cool":0},"P1x3SmN23Qo7YIq2fOOIqA":{"text":"We had a pleasant dinner at the Res Dog Diner Back door alley..all the great food. None of","useful":0,"cool":0},"DbUJr8mHV_ME314l_7dLxA":{"text":"Great breakfast. Originally from the south, and now living in West Central Ohio, I've miss","useful":0,"cool":0},"6WqBNzYvnCfgVBz0X6IAmw":{"text":"I've overlooked this place for years and that was the worst mistake I could have made. The","useful":1,"cool":1},"voMiLIJlKrpJr7P294slcQ":{"text":"Brunch here is AMAZING! Excellent and friendly service with equally great food. The staff ","useful":0,"cool":0},"JXmQMm1nDe5DbWgGLLx4uQ":{"text":"Needed a quick snack on my way home from work! Came across this diner using this app... re","useful":0,"cool":0},"LErCmxO2mJfL2ePPzQ2dmQ":{"text":"i liked how cute red dog diner was. we got a seat in the back and the decor and little cou","useful":0,"cool":0},"xaUM_GDX2euJiNwR2uPr6w":{"text":"Fantastic food, great presentation. Every time I come here, I try something different and ","useful":1,"cool":0},"KWiQJPNR4MDqyqmtfbaljg":{"text":"Very good sampling of appetizers here (had for lunch), and our server was very friendly!","useful":2,"cool":1},"3anU33dWGbDwRhKk7NisKw":{"text":"I really enjoyed my brisket hash omelet. The brisket was so tender it melted like butter i","useful":0,"cool":0},"acaacyQBkMV9EjvsXdvinQ":{"text":"Day 2 of NOLA trip and stopped by Red Dog Diner off the recommendation of a friend. Defini","useful":0,"cool":0},"lSGy3JO4DDNjD_LJkwvSfw":{"text":"This review is for service only. Since we never got any we can't review the food. In short","useful":1,"cool":0},"ElroNqzuA6wnu4v_FtBSeQ":{"text":"Really cute place, really nice staff, but the food was seriously underwhelming despite the","useful":0,"cool":0},"h94ma0c4QogimXruUubwCw":{"text":"One of my favorite places in NOLA. A year ago we were walking along magazine street and de","useful":2,"cool":2},"sKCigJPJL7qE6JLdkAatnA":{"text":"Cannot say enough! \nBest brunch I have had in awhile! \nStaff was very attentive and friend","useful":1,"cool":0},"mrBs1wreqt5f8YPJThV_Ug":{"text":"Solid 3. I would go to Red Dog Diner again, but I don't  think I'd actively go out of my w","useful":3,"cool":4},"PZ8r0tCoHZWzG3WjLt-NvA":{"text":"Once again- a hidden gem found by my fellow yelpers. Had to take an Uber from our hotel to","useful":1,"cool":0},"M-sJOhGMT3msVFI_8vNTYg":{"text":"This is literally the best breakfast spot in the entire world. Visited from Baltimore and ","useful":0,"cool":0},"0VnBsu5koM0HT-rf1wmDoA":{"text":"My group of 8 was looking for a place to eat brunch further away from the heart of the cit","useful":1,"cool":0},"5putBvnuOggOdhbP26yJQQ":{"text":"Amazing experience here. Great food, drinks and the staff was so friendly. We had a poor e","useful":0,"cool":0},"dts00JFQZZFHVZvEI69C8A":{"text":"Surprisingly good breakfast. Great huevos rancheros and delicious blueberry pancakes. Spic","useful":1,"cool":0},"wybllPMkPtn-tWuFHjPITA":{"text":"Great little family friendly and group friendly place. They have a wonderful, eclectic men","useful":1,"cool":1},"m5H7fwOB12AzAHHhpG5kDw":{"text":"We came to Red Dog diner for breakfast / brunch before our Garden district tour. We arrive","useful":0,"cool":0},"yT0HFHxg-uoIU28rp3Mglw":{"text":"Great apps/great service. A little pricey. Definitely will return. Devil eggs are deliciou","useful":0,"cool":0},"L8c170EHLulENmk3Z7xFlw":{"text":"The shrimp & grits Benedict was delicious, as was the smoky Mac n cheese. Good cocktails a","useful":0,"cool":0},"QhQsM-64EaQbRpzTIgj7kA":{"text":"Cute little diner, good food and great service.  Shout out to Jillian for helping me choos","useful":0,"cool":0},"cI9Q1pC-5_1nIneHNN6zig":{"text":"First time here and loved it! Delicious salad and pimento cheese plate. Friendly and safe ","useful":0,"cool":0},"votqEHkEstGuphdCv5k9zg":{"text":"Had a terrific snack at Red Dog Diner as we made our way around the Garden District in NOL","useful":0,"cool":0},"4nu7ocvKQ6RTJ4OFr7i7RA":{"text":"Just had my first meal at red dog diner and it was very good. The cheese plate was filling","useful":1,"cool":0},"1nNz_I7zuHEyASSf0Y_SvQ":{"text":"My friend and I were a bit stranded after Mardi Gras and Red Dog looked like a cozy spot (","useful":0,"cool":0},"w1TDwk1U3vyixHbLw2TuFQ":{"text":"I have come here for breakfast a few times before and decided to try dinner here last week","useful":4,"cool":1},"1CYMHubsQ0aSbjnk02CBKA":{"text":"I was visiting New Orleans only for a couple of days and this morning I decided to try Red","useful":1,"cool":1},"wry0tWlSdSvXpQwKaG1XAw":{"text":"This is an amazing find and delicious breakfast and they have a breakfast happy hour!!! Se","useful":0,"cool":0},"mwOHRrKUSoRUPquNno3Jng":{"text":"So we have walked past here many times when on magazine but I always thought it was just a","useful":6,"cool":5},"5_gPRoW16P82jMhQFYHe4A":{"text":"Best grits!!!  The menu is amazing. Bartenders are great as well. Don't waste your time an","useful":0,"cool":0},"Xjku1fEa0Ju7_S9-m2YApg":{"text":"Super cool place with great menu. I had the Crab And Egg Sardou which was just incredible!","useful":1,"cool":2},"vSDPrQjCSF_TbeWFjC0ucQ":{"text":"This was a nice spot for breakfast. We were there early on the fourth and were worried it ","useful":2,"cool":1},"VrHL7oGqT1_W8MiLXHI0Ew":{"text":"Red Dog has such an awesome interior! As a rustic decor lover myself, the atmosphere of Re","useful":1,"cool":1},"RJE9zf08BqzVfzBwRL221w":{"text":"Was an absolute treat to have brunch with my partner here. Prob the best nachos I've very ","useful":0,"cool":1},"pfVspoNMor8z3_3loiCf1A":{"text":"Came here with a group of about 16 people for a work dinner.  Had the parmesan chicken.  W","useful":1,"cool":0},"R7GQgyjnXowubpjejg5x5g":{"text":"Would definitely recommend! You pay up front and the service is very quick. I went with a ","useful":2,"cool":1},"NV0_AUlUSV059gCHwoSpFw":{"text":"Two visits to Red Dog Diner and I'm hooked.  Both times I was here for brunch/lunch with g","useful":9,"cool":8},"d3FNURY5eAJyQvigs-XW9g":{"text":"I eat a lot of shrimp and grits from various places, and these were some of the best I've ","useful":0,"cool":0},"Uw7-0H_je8e20R3carLO8Q":{"text":"Been here 3 times and 3 times it has been great! Try the whiskey-coffee slushy to get the ","useful":0,"cool":0},"4fBu30H7MTStkpzyKRM24A":{"text":"My friends and I went to Red Dog for happy hour and had a great time. They have a full bar","useful":1,"cool":0},"K9nH6PTQOtAk0VUIjgGMRg":{"text":"I was very surprised that this place was actually kid friendly. They had crayons and a col","useful":8,"cool":6},"bVvozXm1mSkB2Yedbygt9Q":{"text":"Very cute diner with a bar at the back. Just as the name suggests, the diner is very dog-f","useful":2,"cool":1},"Ua--JnE4JiIGouCPBaBQzg":{"text":"One of my favorite new restaurants to open in NOLA in recent memory! GO!\n\nI've come twice,","useful":1,"cool":0},"beWANmKnB47M0fc2TU0Viw":{"text":"Stumbled into this place by accident when we hopped off the New Orleans tour bus and what ","useful":0,"cool":0},"4VjJ348kofs1ZKHaJwaC8g":{"text":"I don't think I've ever been impressed with an omelette before today. This brisket omelett","useful":0,"cool":0},"ryl1AuXhyEZZDi0FUfD3hw":{"text":"Had the Crab & Bacon Dip, this dish is outstanding! I can't say enough this was our second","useful":2,"cool":2},"5PrSAZdwU9l_ZunGTrI4Mg":{"text":"Great service, fresh and delicious food. We enjoyed the beet arugula salad, bbq chicken pi","useful":0,"cool":0},"K7jHKjvN700Ki1u8XuVOCQ":{"text":"I was so ready to love this place after reading the reviews but sadly my experience was pr","useful":0,"cool":0},"BbPAbmj15k3d0m1Mz22Acg":{"text":"We came in for happy hour in the back alley bar - good cocktail list, fairly priced, and e","useful":0,"cool":1},"rc6WKmtYDRA7gDUBGr-rgw":{"text":"Came here on Sunday around 11 with my best dining partner and was quickly greeted by the o","useful":3,"cool":3},"JQEF_VHWrU-jdQikm-3MRg":{"text":"Absolutely a true GEM! The stuffed eggplant shell was amazing and the curry cauliflower...","useful":1,"cool":0},"HAzwaebBpAit-qdMCgwRYw":{"text":"We came to Red Dog Diner after exploring the Garden District, and it was really nice to ha","useful":1,"cool":0},"GNtu_71EUpn22jxOcA7Jgg":{"text":"Really liked this place! Would definitely come back! We got brunch on a Sunday morning wit","useful":0,"cool":0},"0xUIjljyrICiC1cajkLsIQ":{"text":"Red Dog Diner, I'm still blown away. I have no idea how you make the sauces you do, or how","useful":5,"cool":3},"yTSRWRoJtwkX9sY6aE0m7g":{"text":"We came here to celebrate my sister on her birthday on a rainy New Orleans morning. We wer","useful":3,"cool":1},"pZYgFWINHLOuDfBfW73ilw":{"text":"In a city known for its food, I had two meals on two different occasions during my short s","useful":1,"cool":0},"DX6AT7E6VFIfqm4JHbTJBQ":{"text":"Amazing sweet potato pancakes.  Rueben was magnificent!  Everything is homemade and wonder","useful":0,"cool":0},"d4YIAE7budnbstMIUdJTLA":{"text":"Stopped by here on a sunny Monday afternoon and sat at the bar.  With hunger in our bellie","useful":6,"cool":5},"x8XGT_UqzybFaTtKLmtsXw":{"text":"This place was amazing! Cute atmosphere, our server was so sweet, and everything that came","useful":1,"cool":1},"QAGQ5z2AFPDUBu6u0y9GHQ":{"text":"I have some pretty wild dreams (stay with me here), but NEVER in my WILDEST dreams would I","useful":5,"cool":2}}