{"cU3-AxFKOYjCzxKvlFTbvQ":{"text":"This is my favorite Chinese restaurant in US.i am a Chinese from Sichuan province and my f","useful":3,"cool":1},"WMH9VKnZspoP6F-M00uSEA":{"text":"This place is great, two words, handmade noodles! A simple concept done right. Portions lo","useful":0,"cool":0},"3ADWAtJuLaNxxUBYczjKXA":{"text":"Two words - beef soup. I am normally not a soup person but the homemade noodles and delici","useful":0,"cool":0},"Fzmp_l4kpq8ZXGPRemCzoA":{"text":"This was my first time trying authentic Chinese food and omg I loveeeeeed it!!!!! \n\nMy boy","useful":3,"cool":1},"ZCXOItyyKqH3sO2L9fK0qQ":{"text":"I first came here a week or two after they opened and I was disappointed by the food and p","useful":5,"cool":0},"EIxWv2hY3nUHXXQCbBOs5A":{"text":"What an interesting experience. As a self-proclaimed foodie, I'm ashamed to admit that I h","useful":2,"cool":1},"-GOT8RMOzyJqua2LjEzHTA":{"text":"I am a huge fan of Yelp. I consistently refer to Yelp for restaurant reviews and when I ca","useful":0,"cool":0},"u_Q47ME9GSzmSKxHJAvzew":{"text":"It was pretty good (the lamb noodles), but the portion that I got (one medium-sized bowl o","useful":2,"cool":1},"tOYqzHJgKw_0wP6AeF8DAw":{"text":"My go to place when I want to treat myself or for a special date night! The fish specials ","useful":0,"cool":0},"wXRC9jKXCwQJ7JXAmO5Ruw":{"text":"really good！..................really authentic Chinese food\n Recommend to friend. aaaaaaaa","useful":0,"cool":0},"XyRllDJxh4yiFCVtCpbgPQ":{"text":"So wanted to like this place, but as others have noted, way overpriced and way underdelive","useful":2,"cool":0},"kU8f2JvRU9E1Bf6RMfoQWQ":{"text":"I highly recommend this restaurant!!! As a northerner in China, I like the slow cooked por","useful":3,"cool":0},"I0lXNfjksZGv4_e01k-6Yw":{"text":"I am so sad that this restaurant was my last stop on my way out the NOLA door. If I had fo","useful":8,"cool":3},"cM5-wQNVdaT4-g093XC-fg":{"text":"生煎包和biang biang面很不错，包子的味道尤其正常，和国内包子铺口味差不多。据老板说是父辈有亲戚是国内来的，教给他们这些菜式。即便是外国人开的中餐馆，中餐味道一点不比中国人","useful":0,"cool":0},"CR1Mdrrh7usng_g3UChuPQ":{"text":"I love this place!!!  Every bite has been wonderful.  My favorite has been the Pompano and","useful":2,"cool":0},"m2ZEuoIQMdq_Wq2Ia9ExwQ":{"text":"I agree with most of the comments in regards to the portion to price issue. I had the (sma","useful":3,"cool":1},"EXaXZekV9ntmjqr3e2OYOw":{"text":"Ate very well here on a busy Saturday night with two specials and one tasty menu item. The","useful":0,"cool":0},"XaQn7U384bh2WPlTe3C9jQ":{"text":"Dear \"yelpers\". Shutuuuuuuuuuuuuup. \"Granted, I'm not from NYC\"...but what the fuck. You a","useful":1,"cool":1},"KiJMpPKTIAm7ekSRnh5ygA":{"text":"Not too crowded during weekday dinner times. I saw people bring in wine so I guess they're","useful":0,"cool":0},"JCnnXrzOioU-wkAW-zuhvA":{"text":"This restaurant is a hidden gem! It was difficult to decide what to eat. We got the fried ","useful":2,"cool":1},"z0mKEKg2LB8YhVa3PB5RBw":{"text":"Love love love Bao and Noodle! The Dan dan noodles, lamb dish and ma po tofu are amazing. ","useful":0,"cool":0},"8jO5XFh45lS4AxZXw6wqdA":{"text":"Same as the other reviews. Overpriced, small servings, zero presentation, no fresh veggies","useful":2,"cool":0},"yYt98wXS6-v_-UhmRH7sKA":{"text":"I absolutely loved it! \nThe tea eggs are my new favorite food.... Vegan noodles also great","useful":2,"cool":1},"7lcxh_2beiyLeIGNIJLcmQ":{"text":"Friendly staff complemented with savory pancakes and rich hand-pulled noodles. The food wa","useful":0,"cool":0},"4nBo2945l_hyV0wlBJac9g":{"text":"Easily the best noodles I've had here yet. I moved here two years ago for school and this ","useful":0,"cool":0},"fGA_H_SosrcjbE5ac_6vkA":{"text":"I had the vegan bao here for the first time 9 days ago, and have since had it 3 more times","useful":0,"cool":0},"sBBMC1w21Uy9rtiZJXuQ5g":{"text":"I ordered the fried steamed bao and dan dan noodles with pork.  I had seen a bunch of revi","useful":0,"cool":0},"9Ndv6rdCUOR_VDOluRTQDQ":{"text":"Service has been great, delivery was super fast and food is tasty.\n\nI do hope that they po","useful":6,"cool":3},"Mu71oY7MvqkaNLZ4bn3a7Q":{"text":"I am always amazed when someone has aspirations to open a restaurant but has zero awarenes","useful":4,"cool":0},"9CasbQskGbfYCxRi4vO96g":{"text":"Delicious! Can't go wrong with hand made bao and noodle. Will be back for more. The scalli","useful":1,"cool":0},"MOp-_MLhlCCP7YCcW6BXLA":{"text":"We were quite enthusiastic about B&N but left feeling quite disappointed. As other reviews","useful":5,"cool":0},"tLPq7nyfO_w8jwLDnxRSBg":{"text":"Apps were really good...entrees were fair...dessert made me sad don't get the custard...wi","useful":0,"cool":0},"pUiOVGKHgEjLo0Px4OC7gg":{"text":"Been there twice and live within walking distance.   It was very Salty and Expensive for w","useful":4,"cool":2},"CDoWGEmECS7MrJcJ3C8UHg":{"text":"Nice gem in new orleans with handmade noodles and handmade bao. Really loved their homemad","useful":1,"cool":0},"uZzAS_iCmaKX1x-q_a_sbA":{"text":"My friend took me here for the first time. Really wonderful find. We had 3 dishes. All wer","useful":1,"cool":0},"DQnTjQL8CjQgN8-lLPBXHA":{"text":"They need to buy bigger bowls.\n\nThis restaurant needs to work on their portion size and pr","useful":8,"cool":0},"o7KLAHKStlA2hcXciG1NDg":{"text":"I ordered fried bao, dan dan noodles, and ma pou tofu. Perhaps it was the fact that it was","useful":1,"cool":1},"Cbp2joMLKdbWrr4lo_h6sg":{"text":"Really fresh, creative, unique foods! The service is very informed and friendly. Some of t","useful":0,"cool":0},"QmBrO0_kiJU5dqqo1fomyQ":{"text":"The food is delicious and obviously made with love and passion. The service has always bee","useful":1,"cool":0},"gCp1skl7xlXZQ8NLx51sOQ":{"text":"The white waitress explained that I couldn't have a side of silken tofu to our table (a ta","useful":0,"cool":0},"pgd66f7Vcm5q8pc_vml7HQ":{"text":"loved this unamerican chinese food! we got the dan dan noonies (chewy and delicious), spic","useful":0,"cool":0},"BJAArEAjYsRq3QEwz2qNyg":{"text":"I enjoyed this little noodle spot quite a bit! \n\nWe ordered the tea soaked eggs, pork bao,","useful":1,"cool":0},"iGnQcXTUT0FjjuF1QZxXPw":{"text":"I came here with my boyfriend last Friday night and we had a great time. The food was deli","useful":1,"cool":0},"ZzDTv9QWdC1gKYgokzlwkg":{"text":"Delicious and I didn't feel it was overpriced at all. Not huge portions but very filling. ","useful":3,"cool":1},"bN0z3JGQShAeJy4iqMs6QA":{"text":"Fantastic noodle place! Went here on a recommendation from a local business and I'm so gla","useful":0,"cool":0},"kNxmEAVYT7PmCJ_SLiG-iw":{"text":"Guys I am obsessed with Bao & Noodle. Thank god I don't live in the Bywater because otherw","useful":1,"cool":0},"MlgDozuiWxGc5wG0FMlEyg":{"text":"Great concept with disappointing execution.\n\nThe restaurant is a quiet little room with an","useful":0,"cool":0},"SJCCoLL6eX3N2hSaR08Bqw":{"text":"Ordered takeout and they told me it would be here in 20 minutes. When I called after 45 it","useful":0,"cool":0},"6EJ65XjDDtGqisrxghGLJw":{"text":"Delicious dumplings and noodles. The tea eggs were awesome too. The chef came out and talk","useful":1,"cool":0},"0qh8gs8xbDKiOCxv508lUA":{"text":"Husband and I popped in on a whim last night and were we ever glad we did! My mother is Ch","useful":1,"cool":0},"3o2xEBC94L3H6Hj_peIZ4Q":{"text":"I wanted to like this restaurant more than I did. I really really did considering I live 3","useful":0,"cool":1},"Oo4d4LescnFoJGwVCfGyxA":{"text":"Phenomenal meal. Tried the scallion pancake and the fried steamed bao which were delicious","useful":0,"cool":0},"sUWNJwC65p1aBWNGlC5pNg":{"text":"Holy %#*!  How did this place get here?  Scallion pancakes delicious. Braised lamb was the","useful":0,"cool":0},"664EU16HDqxGgn_bOuzp1w":{"text":"Easily in my top 5 restaurants in nola. I mean, who doesn't love hand stretched homemade n","useful":1,"cool":1},"UvYdjs0ieZ3lwZp76CDpMg":{"text":"Bao & Noodle is my favorite Chinese restaurant in the city. The Dan Dan noodles are chewy ","useful":2,"cool":0},"1_PPq8NN8HgAqUrt1cMyVg":{"text":"Love this place! My last visit, we had the scallion pancakes, tea eggs and greens, and lam","useful":1,"cool":1},"37joiVabhsEzjWYVla6Gyw":{"text":"I am a Beijinger, now studied at Tulane and be in U.S. for several months. It is good and ","useful":8,"cool":2},"zFMN_Ex5Gj5Vl2tmHIWVjw":{"text":"Oh thank god I found Bao & Noodle...by far the best Chinese I've had in the city. Handmade","useful":0,"cool":0},"EXgiAvm8OvujCfImO4fC8w":{"text":"Fantastic! We love this little love that is conveniently up the street. Such a great twist","useful":0,"cool":0},"zQ8_J9SN8S-HfbIJ6tXHTw":{"text":"This was the best meal and best service experience I have ever had anywhere in my life. Th","useful":0,"cool":0},"UB4ney9VEnWYfBOEjKzWvA":{"text":"Oh man! This will be quick: run to that place if you wish to have an authentic Chinese mea","useful":0,"cool":0},"Rz16_DO9bXMz57V19Ja0oQ":{"text":"Love picking up weekday lunch at Bao & Noodle! Their beef soup is an absolute favorite. Pe","useful":0,"cool":1},"Ah95Ql_ae8XSX7TymzwCYA":{"text":"as so many have said, the staff is great... problem is that if you're going to claim to ma","useful":0,"cool":0},"B5Q4_O4xg1qeFN_lYLs-Iw":{"text":"Really disappointed with the noodle part of 'bao and noodle'.  We ordered the dan dan nood","useful":0,"cool":0},"_6pmMN5iFxqxMHckA9V7yA":{"text":"Delicious noodles! My husband and I shared the pork floss bun, the fried steamed bao, the ","useful":4,"cool":2},"KxpNGLz0TzkQj8EJQOlMvA":{"text":"Like so many others, we were excited to see a new restaurant in the neighborhood. We made ","useful":2,"cool":1},"Mo8lLZootupt-sFQjdpR1A":{"text":"The food is edible, the service is atrocious. We didnt get silverware, appetizer plates, w","useful":5,"cool":3},"dmgYTkX4J8ta8HC6Yf9thQ":{"text":"My feelings were all over place during my meal here. We ended up at this restaurant by cha","useful":0,"cool":0},"JEuktjLZsCjoCx7eSCyIzQ":{"text":"The buns are delicious and the spicy pork noodles (but veryyyy oily) but that might be how","useful":1,"cool":1},"3WkmHmYyK_4PxN95mi-lAg":{"text":"If the overall rating for this place is still only so-so, don't let that stop you from try","useful":4,"cool":0},"SFWyZfo4is6PZovtClaYYA":{"text":"Sauces are bomb here. \nBest bao in the city! \nSuper casual spot with a tiny open kitchen w","useful":1,"cool":0},"UXDaKS8b-A4r5YXhmXb-WQ":{"text":"I had very low expectations as we entered this establishment. Honestly, it's not much of a","useful":1,"cool":0},"y9_wtCTlWUHpZq7yEUqibw":{"text":"So SO good. It's food is as warm and tasty as it's environment. The ripped noodles visit m","useful":1,"cool":0},"DJ1P199Bff2oW4he9AWRuA":{"text":"Delicious food and great service!  Nola is lacking a good Chinese joint, and I was so exci","useful":2,"cool":1},"JbVZpKCGtOkafI55MZ0ZOw":{"text":"Date of original review 12-7-2015\n\nI went with 3 friends and we had the yummy scallion pan","useful":0,"cool":0},"QKFRxI4x_whnzusF3OJLRg":{"text":"A great place. The Bao pods were AWSOME. Had the tea eggs (very tasty), shrimp noodles and","useful":0,"cool":0},"07djWJe1XMxKWyMexEjXnQ":{"text":"We love this place. Order from them all the time. The food is delicious. My favorite dish ","useful":1,"cool":0},"AowrmJaUz1Okl-jfrAYnhA":{"text":"This is my favorite Chinese restaurant in US.i am a Chinese from Sichuan province and my f","useful":0,"cool":0},"_MwIOnTeTSKafz-prDaFng":{"text":"I'm not sure why there are any bad reviews of Bao and Noodle. Maybe people want to only ex","useful":2,"cool":0},"g-zgRuBwlTS0l-vMWYh76g":{"text":"Started with the Fried, Steamed Bao.  Totally excellent.  The lamb dish with cilantro and ","useful":2,"cool":1},"qhGSuO1OIcRyS38Na_tD0A":{"text":"This is one of my favorite places! Bring a nice bottle of wine I get the scallion pancakes","useful":0,"cool":0},"QFTunVVsTFlhzRujqA_nLQ":{"text":"K and I LOVED Bao & Noodle. We had dinner here a few weeks ago and loved everything we ord","useful":6,"cool":3},"vQNW_wRNK8u9Zdyq5QGSMA":{"text":"My friend and I reluctantly ordered from here, cause we wanted Chinese, and this came up a","useful":1,"cool":0},"Gx_Ri2ahjW1qxfDpOsRHBg":{"text":"We had the Beef Soup, the Dan Dan noodles and the fried steam Bao. Everything was great! T","useful":1,"cool":0},"Im-oaDaI_D4sTH-b43fopw":{"text":"i had the beef and glass noodle soup. DELICIOUS! beef was melt in your mouth. quiet, quain","useful":1,"cool":0},"SThA7gc41jh_r_DVP4eK-g":{"text":"Gave it one more shot- shouldn't have. We figured maybe they had a really bad night the fi","useful":1,"cool":0},"eXf9WYkG242bXq3JOoSTKA":{"text":"Great place to eat! The ingredients were fresh and the meal was delish. It was a little pr","useful":2,"cool":0},"BZPmi46jkbDpLAWb7S8nCw":{"text":"Another welcome addition to the marigny, within a block radius of my house. Food was delic","useful":7,"cool":2},"H-q-4x3_FuEj-DyPoHGOCg":{"text":"Good eats. Dessert is worth the extra $3. The go to is their lamb which has a thick noodle","useful":0,"cool":0},"HfAFfgJDfDiEtnzfZ-0AIQ":{"text":"Tasty and enjoyable Vietnamese food in a small cafe in the Marigny at the corner of Chartr","useful":0,"cool":0},"TG9D3PLSPHc5ChmKE9n8XQ":{"text":"The beef noodle soup was okay..the broth was good, but not a fan of the rice noodle...wish","useful":0,"cool":0},"eU4CaYIKMwQlWsuXIpBjkg":{"text":"Amazing food! We had the beef and noodles soup and some dumplings, which were so good! Als","useful":0,"cool":0},"3GIlMG2qK5SeQmQBLEKHBg":{"text":"Everything had a burnt taste to it. The whole restaurant smelled burnt. The more flavorful","useful":0,"cool":0},"lG2IuWnslPflijnciz97Ow":{"text":"REALLY GOOD FOOD, people very sympathetic.\n The \"Shrimp w/egg noodle and XO sauce\" for 14$","useful":0,"cool":0},"CoTVLg4JQv4awinXMR9hzQ":{"text":"I short changed this place the first time. This place is a hidden gem. We will be back! Th","useful":1,"cool":0},"tmTAA8BupStL25tSyvkqbQ":{"text":"The quality of the food here is outstanding. So fresh. So tasty. Perfectly spiced. The fri","useful":1,"cool":1},"hZe-ZQU120YgaUuKcbJiLA":{"text":"Delicious. So happy to have found real Chinese cuisine in the Crescent City. Handmade nood","useful":3,"cool":2},"93AH-q5Je1_GU20U6l0W2w":{"text":"The food was really good !! The owners are the nicest couple ever. She is very attentive a","useful":0,"cool":0},"P3Kv_I2-1QZ5o5oKh1ErJg":{"text":"Some of the best traditional Chinese food around. The beef soup had fresh ingredients and ","useful":0,"cool":0},"5hG6eUIlffSvMQ983WEPUg":{"text":"The restaurant is bright and comfortable. The staff is friendly. The bao are AMAZING. My f","useful":1,"cool":1},"szCBqKY6Cs_cMPc2PtF7qA":{"text":"Best chinese noodle and food place ever. I had zha jieng men and some bao and cooked pork,","useful":0,"cool":0},"hrguvZrTrtFKh7Slw3GIJw":{"text":"We went here for a Saturday lunch. The waitress was great and made recommendations that we","useful":0,"cool":0},"c1cElPn3Y5e3-CVPdrS8EA":{"text":"Whoa...all I can say is WHOA! I LOVE this place!! It's my go to all the time and is always","useful":0,"cool":0},"3r4uddpxeV1QHj8OXjs85Q":{"text":"This restaurant is a scam.  Even if the food were delicious, which it wasn't, it was way o","useful":0,"cool":0},"WZW4F09Xo1uw5r_yxVHuUw":{"text":"No one was more excited about the arrival of Bao & Noodle than me. Some of my very favorit","useful":3,"cool":0},"1auhe7YyPtqXHtmUNwhi0w":{"text":"Very authentic chinese food, just like you would find in China. What's more amazing is the","useful":1,"cool":1},"U5v4W0ZllmLV1K7SXPdJhw":{"text":"Our second time here in one week and it was just as good as the first time. The portions a","useful":0,"cool":0},"G74EznTT2NgRTxYcFGG3_w":{"text":"Wow. If you want bomb ass noodles COME HERE. They had numerous options for vegans and vege","useful":1,"cool":0},"WR_ia-m9eKnuu85VX2WKug":{"text":"Last night had a rice-covered meatball from Bao & Noodle at Gambit's Food Revue (well, 5 a","useful":1,"cool":0},"LAlQ6Fna6EFkKqeuLHJwng":{"text":"I'm afraid we fall into the category of those who really wanted to like this place but wer","useful":1,"cool":0},"w2utxQmqrYxY2a0d1SMNzA":{"text":"Every available dish is excellent. My only complaint about the restaurant is that I wish t","useful":0,"cool":0},"kCoEElE1IzkTYXWtTO4z6A":{"text":"Ok, so I know this is a 5 star review. Let me explain... The restaurant decor / ambience i","useful":2,"cool":1},"VFiZriIzxZ3hrnriMJLgQA":{"text":"Food is pretty good, but value, environment and food service is not. We waited 45min for 2","useful":0,"cool":0},"4A_8hOQx2r2LQiytCfW9jg":{"text":"This is one of the best places in New Orleans! Everything we had was delicious. The scalli","useful":0,"cool":1},"dZcQEImdUpkH29bjlaAPtQ":{"text":"We stumbled upon this place and it made our weekend! Authentic flavors, absolutely delish ","useful":0,"cool":0},"2br8wP22cG8nbTiZre7Vkw":{"text":"Amazing noodles and the lamb was so savory. The best noodles I've ever had. Sorry Grandma","useful":0,"cool":0},"3dNoGQsAk0lp4lXgTjdTyw":{"text":"The food here is simply amazing! The owner is a really nice guy who my fiance and I have g","useful":0,"cool":0},"nromYz8bIPv_EBt9sV-W4A":{"text":"Authentic to the heart of Chinese cuisine. Made fresh every day. From ancient recipes. Som","useful":0,"cool":0},"XRHL2IcXMB7NWDOLl7-cog":{"text":"I ordered the fried steam buns and the daily special pork and leek dumplings. Both were ho","useful":2,"cool":1},"AcL8xXdQE2_-0YQpL_Ribg":{"text":"Bao and Noodle is quickly becoming one of my NOLA top five restaurants. The staff has alwa","useful":1,"cool":1},"4U4DlTH90J0LkTrVVJBqNQ":{"text":"one of my favorite spots in the city. the service is always fantastic and the zha jiang mi","useful":0,"cool":0},"IdlSH0HZ6fjg0IIBSC40Sg":{"text":"Excellent, simple and not expensive. What would you ask for more?\nVery good adress , I Wil","useful":1,"cool":0},"YmGBsm6NC8_GVRQawe62dg":{"text":"This place is amazing and you should eat here!\n\nThis is probably my second or third time h","useful":2,"cool":2},"-e5juhlaP8ji265EkrZm0Q":{"text":"I think we have ordered the entire menu by now...and have yet to have a bad bite. The nood","useful":1,"cool":0},"sgNPSltegvxyK7xS2G9Mbg":{"text":"Delicious and creative dishes that respect tradition whilst doing some exploration. The st","useful":0,"cool":0},"KMdaLiAbON7HogDOI6M8zg":{"text":"Tiny hole in the wall joint. Open kitchen that's not well ventilated, so all the steam fro","useful":0,"cool":0},"wAGbW4gzUwoaiHzuH1NqBg":{"text":"The most elevated comfort food ever. Handmade noodles taste amazing, the flavors are compl","useful":0,"cool":0},"MSAzmHjikptb-p9y5pzZXA":{"text":"This is such a cute restaurant with quick and friendly service. Favorite dish is the salt ","useful":0,"cool":0},"wye1ot-yvhXLHe0sat22Jg":{"text":"The best thing I ate here was their fried pork baos. I will definitely be back for those a","useful":0,"cool":0},"xC8kFYKjpndxSP0c-C_A0w":{"text":"We are from the San Francisco bay area and live in an area where there are more Chinese re","useful":3,"cool":1},"1xjlN2xebi9FC4ATp9k_rw":{"text":"If you love New Orleans and not eating here, you are missing out big time. Stunning food. ","useful":0,"cool":0},"Q_3HymLO-Kqm3wGnMEvUqQ":{"text":"My daughter had the Bo and the Beef Pho. Both were excellent.  My son had the braised lamb","useful":1,"cool":1},"rHC0mme4V-yn547_09ybZw":{"text":"Some of the best noodles I've ever had. The lamb was deliciously tender. The whole dish wa","useful":0,"cool":0},"kle6hKU1y-PzvZQf0K4S0A":{"text":"Bao and noodle is great traditional Chinese fare that is superior to any Chinese food i ha","useful":0,"cool":0},"mV5QN1kQFVe6H3HqvmwA0A":{"text":"The wife wasn't feeling well so I ordered take out from this restaurant. When I arrived to","useful":0,"cool":0},"OZJNMF_9-1BstG0cYdafnA":{"text":"Amazingly friendly service. Excellent food. The duck was flavorful and tender. Homemade no","useful":1,"cool":0},"WtssxIRag8Stx6lca4m3HA":{"text":"Man I really wanted to like this place since its in my neighborhood and I love me some Asi","useful":2,"cool":1},"Js8GNLQRZF-fR7_B_pcWDQ":{"text":"Try the Burmese tea salad. It is so amazingly delicious it will restore your faith in huma","useful":0,"cool":0},"6pESo261vaWB6z4J28YYzw":{"text":"Delicious, flavorful, affordable and the best service in town thanks to BATMAN! \n\nMy favor","useful":1,"cool":1},"PjcRif-4NayWu5zxOBJeKw":{"text":"The Tea salad was yummy, and a generous portion, too.For $5, that's a really good deal. No","useful":0,"cool":0},"FZwQPVWeQArMwSTAqAPsTg":{"text":"We ate dumplings of the day. (Shrimp and pork) \nAnd the fried steam baos - both amazing! S","useful":0,"cool":0},"ZrR1mc_nqr9MJ7H1j6U7tA":{"text":"Very disappointed with this restaurant. We arrived at 1:00pm and the restaurant was a ghos","useful":1,"cool":0},"JsJHWNQLS3AIW1c8XEtK1w":{"text":"Waiting 20 minutes without so much as a drink order? Unacceptable. We eventually left, and","useful":1,"cool":0},"ijnz24-1hPKuWg1ySDhrnQ":{"text":"Really enjoyed this place! I got the spicy noodles and peanut appetizer. Both were extreme","useful":2,"cool":2},"4TJVHti1HFB-MdFdqreCUA":{"text":"Went here because of the good reviews, but did not like it very much.\nWaitresses are nice ","useful":0,"cool":0},"jnP6_duSTlWT6gFdrXHzeQ":{"text":"We were on a hunt to find some delicious Asian noodles, and we were fortunate enough to ha","useful":3,"cool":3},"EIyjww4kzYYcj-xgqCLc_w":{"text":"Read so many good reviews so we decided to give it a try. Went there at night. Gave them a","useful":4,"cool":0},"ivrFKmLCainqd2LXDFatnQ":{"text":"Just tried to dine there been there many times with great food and service. This time serv","useful":2,"cool":0},"8jHckZ6DqfgDU8sBufakyw":{"text":"Maybe it's just me, maybe not. I've been waiting 40 mins for my food. I don't want to rate","useful":6,"cool":1},"r_RVwVg09xC_vU2EEonmzg":{"text":"One of the worst meals I've ever had. Looks good on paper, execution is horrible. Boyfrien","useful":1,"cool":0},"YQU2VueF4titbhbg_kWl5w":{"text":"Best Chinese noodles I've ever had. You can't go wrong with any choice that includes noodl","useful":0,"cool":0},"P0hKWjHpnaPafpxpf6LnPQ":{"text":"Food was great but like everyone has noted, the service is lacking. If you're not starving","useful":0,"cool":0},"CFRRmnT7TOUUKUgQp69IrA":{"text":"This place is a hidden gem.  I went based on all the good review and the pictures I saw on","useful":0,"cool":0},"JjAg0IHQ_aBMYfIE3RzCxA":{"text":"I've been here several times now, and I've always enjoyed the food when I'm here. The dish","useful":1,"cool":0},"UEdlC2qXG8AQHswo4lmKWA":{"text":"Ahhhh, this place is dank \nDank \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDank\n\n\n\n\n\n\n\n\nDank \n\n\n\n\n\n\nI hope this ","useful":0,"cool":0},"Kds-E9fMEp6ixT3qtio3-A":{"text":"OMG you guys. Everything was fresh perfect delicious. Some of us had the chicken curry bao","useful":1,"cool":0},"pw__wrvf1gHW_bg5nqH3xw":{"text":"If I could give 0 star I would. The food is DELISH, but the service is some of the worst I","useful":4,"cool":1},"K1EnHqaqa013k27TNoBtFw":{"text":"I downloaded yelp to share what happened to us at this restaurant. Food was good and I rea","useful":1,"cool":0},"twHYrbYjx2eh1WAOnCNnEw":{"text":"The food here is mediocre at best and trying very hard to seem authentic. The Dan Dan Nood","useful":1,"cool":1},"EXGVbPsM4nig0vCqNGeN1w":{"text":"Literally, I kid you not, the only good place for Chinese in New Orleans if not the whole ","useful":0,"cool":0},"Yhww0rw0TPTGscr7JsjTzA":{"text":"Bao & Noodle is nestled right in the Bywater/Marigny neighborhood, and was a 5 minute walk","useful":1,"cool":1},"1JrX8BVEqnGQBQafDUnM7Q":{"text":"I just ordered over $60 worth of food through this app and waited for more than an hour, w","useful":2,"cool":0},"X7IuPbfzadwfTxjoAQqB0g":{"text":"The menu is very Chinese, offering strangely flavored sauces with the numbing quality I li","useful":7,"cool":3},"Zu9VH3UhMFkBclTGOJG4Yg":{"text":"I loved the charming old location, but times change, and I was happy the restaurant didn't","useful":0,"cool":0},"8lqPZ8mCX3oVGSLf9ulW8g":{"text":"Great food. Dank. Go now! \nOnly issue is lack of hood system, my coughing and my clothes a","useful":2,"cool":1},"UCGoCvobYdr5m8Yy_U7w8g":{"text":"The type of authentic Chinese food you can only find in New Orleans. The restaurant is in ","useful":2,"cool":0},"dZkh8Q1bZMVT8T3mhCNkaQ":{"text":"Always a great dinner option. The dim sum and lamb noodles are incredible. Owner is also v","useful":1,"cool":1},"JrRLPVuNmqt9xfRvM4R2dQ":{"text":"A hidden gem! Definitely a must try for authentic Chinese food! The service was phenomenal","useful":0,"cool":0},"XlTzT2bz6PLXv0WkHuzLBg":{"text":"I literally have no words. This is my favorite restaurant and I can't wait for pandemic to","useful":0,"cool":0},"4bFV9Z8IGNpi7RfyKfrIzQ":{"text":"I have to say I've never been compelled to write a negative review for a business, but my ","useful":6,"cool":1},"v3UwBcubjj3uPAtyZkIVug":{"text":"It's one of those nights where I'm sick and don't want to move. I found Bao & Noodle on th","useful":2,"cool":0},"jVens2OdHaHK7CPpgPHAyA":{"text":"This place was great! Found it randomly on a list of restaurants here that permit BYOB, an","useful":1,"cool":0},"hJcxQnubTv7_XRWX2Ki_9A":{"text":"I really wanted to like this place.\n\nI love hand pulled noodles. Traveling from Boston, I ","useful":1,"cool":1},"zuXQTtzqQp5J3DaWgWeaHA":{"text":"This place is so great. Not on the fanciest street, but it's a good reminder to not judge ","useful":0,"cool":0},"lptIlvDffebwV33NioNZ9Q":{"text":"This is one of the best places in New Orleans! Everything we had was delicious. The scalli","useful":1,"cool":1},"DSBI8kDDIzei9Ll9nLl4qg":{"text":"So disappointed in this place.\nThe place itself is cute and the waitress was great except ","useful":4,"cool":0},"rya9z-chUdvuZfKjNzZQOQ":{"text":"Great food. Dank. Go now! \nOnly issue is lack of hood system, my coughing and my clothes a","useful":0,"cool":0},"pePOC1dvKxe6yKz-mt_7hQ":{"text":"I cannot say enough good things about this place! The good is authentic and incredible, an","useful":0,"cool":0},"-Eo7wCQOxSn230BtiattAg":{"text":"I've been meaning to go to Bao & Noodle for years now and just finally went last night. I'","useful":0,"cool":0},"3C2DgehD3tXXOekyB5ViTw":{"text":"The food was so darn good! We got the fried bao (2 orders) which was def a favor of ours a","useful":0,"cool":0},"hg9Fm70ODw0K46n5QEsSHQ":{"text":"Bao & Noodle is one of my favorite restaurants in the city. I crave the vegan bao all day ","useful":0,"cool":0},"LxQNKLY64HQqWNzq6nEQ_g":{"text":"Oh my gawd this place is incredible. Like, genuine Chinese food AND cooked to perfection. ","useful":2,"cool":3},"83OMetkxUANyiR3RTURETw":{"text":"This was the best meal we had in New Orleans. We came here after reading a write up about ","useful":0,"cool":0},"zzPnCdM-VGrhqbgP3hby0Q":{"text":"Cozy restaurant. We came on a Wednesday night and there was only 1 waiter working so it wa","useful":2,"cool":0},"SphGTqLcl9-bqWdDfWYNpA":{"text":"This is my favorite restaurant in the city. The food absolutely amazing, authentic, and af","useful":0,"cool":0},"_Um7IPYSJYxXhCD0YUmNmw":{"text":"Came here on a recommendation from a local barber while we were in town on vacation. Had t","useful":0,"cool":0},"17CIQbQY5xvDSpY3G1eHcQ":{"text":"Now been three times and, outside of a service issue once, we've been pretty impressed. Fr","useful":2,"cool":2},"bsD-WFA7OWUGLa9XuldMtw":{"text":"Loved it! So unpretentious and delicious. I accidentally wondered upon this place and was ","useful":0,"cool":0},"_c2d3A1Sh21tE83FqsYDsQ":{"text":"Over priced, small portions, greasy, bland, and not Chinese. Their vegan food is disgustin","useful":0,"cool":0},"KEXxonAv43odTkcy9f7zoA":{"text":"This review is unfortunately going to be about the damage a simple misunderstanding can ca","useful":18,"cool":0},"SbLxBUG26wooC9zYVDyk1g":{"text":"Cute little place we stumbled upon on our walk about. \n\nGot Asian flavor inspired crawfish","useful":1,"cool":0},"FteP1cVhM48RvQpLGUM9JA":{"text":"I love the decor in this spot. It's so cute from when Estano renovated it originally. They","useful":1,"cool":1},"nUw4dylve2ZXq35LjYTDoA":{"text":"Wanted to love this place in the Bywater but the items I got didn't cut it. Granted I'm fr","useful":2,"cool":0},"6o-qYXWuITqu6jiWAmzGZw":{"text":"I really liked this place which is an Asian fusion restaurant. My dan dan noodles were exc","useful":1,"cool":1},"43_gFmWkxB1hHL0nGH0n5Q":{"text":"I had a great lunch here last month, which is why I'm not giving it a lower rating.\n\nHad a","useful":4,"cool":2},"SP2yyeulwvnC5AW_zikw4A":{"text":"My boyfriend had tried this restaurant through postmates and thought it was pretty good, s","useful":3,"cool":2},"gWYcqza-4pgFeVxGiS2BYg":{"text":"The vegan bao are amazing and I usually get the dan dan noodles, which they'll make vegeta","useful":0,"cool":0},"hw1lIzqUBk909wNIR-A-hQ":{"text":"This place. This. Place. THIS PLACE...is on the list of restaurants I wanna put in my pock","useful":1,"cool":1},"CpSns5IXEgk_qmGkRaQKHA":{"text":"I've eaten here twice...freinly server...both times I ordered the steamed whole Pompano...","useful":0,"cool":0},"GUKQ8U-kEBR8scWOO5T_BQ":{"text":"It is so amazing to have such quality Chinese food in the French quarter much more amazing","useful":0,"cool":0},"LHbP-kY9DHNLUQFy3v6aJA":{"text":"I tried Bao & Noofle for the first time, I can highly recommend it. it is a very laid-back","useful":0,"cool":0},"OQPMbqj3Yp7vbYolMlhsfg":{"text":"The Beef Soup was dark Mahogany color.  The aroma was so rich that I could almost feel it ","useful":0,"cool":0}}