{"fVr20kzNWP5QEKt54mYLvQ":{"text":"My neighborhood boiled seafood fix! \n\nI can't speak for the sandwiches or fries or anythin","useful":4,"cool":4},"J4BhfUgAB51Z_ys8yXWIuA":{"text":"I wish I could give this place 5 stars, I really do. In fact, I was going to until last we","useful":2,"cool":2},"o0xDqLsO7lys0APNdYZTpA":{"text":"If my wife could only eat two foods for the rest of her life, she would eat french fries a","useful":4,"cool":1},"NcW6XcAsrUyCNiTRePjA_g":{"text":"Good prices, loaded shrimp po-boys, and mediocre chinese food.  Worth picking up to eat at","useful":1,"cool":1},"Kv5_jNZxDpGtHbBLLEfj9g":{"text":"It was not the place to go. Horrible is putting it lightly.Save ur money and ur time..they","useful":0,"cool":0},"teSTFIW4HrSvJBpR9wng3g":{"text":"Eating here is like a mini adventure\n\nSo, we decided that we couldn't leave New Orleans wi","useful":2,"cool":2},"ak5gASbqCccETG00WcCCdw":{"text":"We came to NOLA to eat crawfish. We drove around city to find the good crawfish place, we ","useful":0,"cool":0},"axzlcewj-2_PIZ672GsSPw":{"text":"Sketch.  Talk about a whole in the wall. Perhaps we came an hour before closing, or came t","useful":2,"cool":1},"ZgnflHFDSzVdJIjzdSSscA":{"text":"Went to Tulane's Crawfest yesterday, and after eating crawfish seasoned with only celery, ","useful":2,"cool":0},"ETSRtX0wvLd5XxaPldqgBA":{"text":"I've eaten Shrimp po' boy's at a number of places in New Orleans but this place has the be","useful":2,"cool":1},"WH-3PMplcwJGG66IHQZuWg":{"text":"Great prices, good for the kids, and definitely a good place for groups.  The food comes o","useful":1,"cool":1},"cexFGOG5Dl7mcoZmMsxuFQ":{"text":"I was craving fried oysters and had heard good things about this place so I decided to sto","useful":1,"cool":0},"HJmhsOh2zFTUDKlqhsrY5w":{"text":"**CRAWFISH AND CORN ON THE COB MAKES ME HAPPY**\n\nMy last lunch in NOLA was 2 pounds of boi","useful":11,"cool":9},"_ik8e53NbGX4ahuTMRPlhA":{"text":"A trip to Big Fisherman is like having a frigid spouse in a sexless marriage. It always se","useful":8,"cool":8}}