{"3zG94HROyPfPVd_ehtU7Yw":{"text":"Excellent dog trainer. Knowledgeable, patient, creative. Great experience! Place to go to ","useful":0,"cool":0},"ZPeIB7Eu_TDZ3vdLk9UlzA":{"text":"Ann is a wonderful training.  She is very knowledgable about dogs, and uses positive techn","useful":0,"cool":0},"KKDVx685dHAb7Rfc3jQMcg":{"text":"Ann Becnel conducts  well disciplined and organized classes that begin and end on time. Sh","useful":0,"cool":0},"iTt2i-bpZ2cxqxIY-CAATQ":{"text":"After my best friend, a Jack Russell/Rat Terrier mix passed away last year. I had to get a","useful":2,"cool":0},"3wXVcHXsYjlBTmLEpy1BsA":{"text":"Dog Phreddy and I strongly recommend dog Moon Pie and his human Ann. Seriously, Ann is an ","useful":0,"cool":0},"Tg235wtjTMAbXanenFITMA":{"text":"We signed up our 5 month old rescue pup for training with Ann. Ann is great with taking ea","useful":3,"cool":0},"BVIV4Ar0bxw8Glb34KowSw":{"text":"We are a family of dog lovers with little in the way of actual dog skills to help deal wit","useful":1,"cool":0},"wYjpdW4_rMMbX82aTsDC6Q":{"text":"Ann brings a high level of professionalism to dog training. It has helped us develop a muc","useful":1,"cool":1},"M4q9aUp3H5A0bN0yHjUb1w":{"text":"Dog training with Ann has been great.  I am a first-time dog owner-- when I adopted a one ","useful":2,"cool":1},"z-w57ILm0QNs-Witm743rg":{"text":"I recently relocated to the New Orleans area from the northeast. I worked with many qualit","useful":1,"cool":0},"4aJCuy7FOn42pAJZkFbViw":{"text":"When you begin your classes with Ann, you can immediately tell how professional her progra","useful":2,"cool":1},"Gppu6t8pi5MDuCpZjXekMQ":{"text":"Ann is a miracle worker! We have two rescue dogs, each with their own unique training need","useful":1,"cool":0},"biBMbBYtSC3PXDZ881iTzg":{"text":"We have really enjoyed going to class with Ann. We started at 9 weeks old in her puppy kin","useful":1,"cool":1},"FVAHwJzvkwIvaNZa3df3fQ":{"text":"Great classes for basic training and to learn games that will help you bond with and train","useful":0,"cool":0},"tlo3WDb-CbKPkquHiX8LCA":{"text":"I have known and worked with Ann for going on 14 years. I trained my first dog with her, a","useful":2,"cool":1},"kcXkP_4GWVL2ArE7GMaZkw":{"text":"Our family enjoys working with Ann Becnel Companion Dogs.\nAnn is an expert dog trainer and","useful":0,"cool":0},"yZ2gmUkWcuRJi4bTLw33YA":{"text":"Ann's classes are fantastic! We have attended puppy kindergarten as well as the Canine Goo","useful":0,"cool":0},"XxbznzWy3KPXijM6iJuNoQ":{"text":"Ann brings a high level of professionalism to dog training. It has helped us develop a muc","useful":2,"cool":1},"NglcaMIttNypVsYm2lXKqA":{"text":"There aren't enough words to explain how grateful we are to Ann! She is truly an expert in","useful":0,"cool":0},"E1PAhdKLTja83mEUIB0Qmw":{"text":"Ann's classes are fabulous! We did one in-home session with both of our dogs (our senior d","useful":0,"cool":0},"IltdxQ2slOF9OeTFLsZ8kA":{"text":"We really enjoyed working with Ann. She's very serious about her work, so my advice would ","useful":0,"cool":0}}