{"SFUeDoHLPI7HmMKEANAXVQ":{"text":"Checkit: another wine bar review! I know I sound like a broken (drunken?) record but, as t","useful":15,"cool":10},"CjLwvomGsjNXZHheJzXUFg":{"text":"My gf and I met another couple here last Friday at the end of our date night.  It wasn't p","useful":0,"cool":0},"He7FUSN05NcC9rqUm6tmow":{"text":"I live a street over and have been here several times. It is a neat spot and the decor is ","useful":0,"cool":0},"1_qoOlQWRuuPZ3AS6bbemw":{"text":"Great wine selection and an awesome spot for a book club meeting","useful":1,"cool":0},"1xK9fyMT_nUocH5G0Lw5LA":{"text":"Not sure if my first experience was the best. This place is pretty busy on the weekends an","useful":2,"cool":1},"wA3lxb9uUeVEK4JfYT_Nyg":{"text":"Tasty little tapas style meals with okay drinks and overwhelmed servers. Good food, but it","useful":0,"cool":0},"D8B2gHVKgLCCpnEJEuj6yg":{"text":"They don't close at midnight on Saturdays.  Great wine selection, fabulous dessert.  Good ","useful":0,"cool":1},"_yoLsJ6gEqWnCPywDOe4VA":{"text":"Extremely well decorated place. Spacious and elegant inside. There's live music at night, ","useful":1,"cool":0},"JmHrtVQWlDojYwLY9SYOBA":{"text":"Went there early on New Years Eve for a few rounds and liked the service and look of this ","useful":0,"cool":0},"K3LYeRGSPn5pNBNkJkppbA":{"text":"When I heard about a new wine bar opening up on Oak St, this isn't exactly what I pictured","useful":2,"cool":0},"a-m9GZOJZKu16qRmWZCwKw":{"text":"I really enjoy this place for a nice, swankier night out. The service is good, the fries a","useful":0,"cool":0},"N8Qjrk8yB9yIwYY7tkLhrQ":{"text":"This would be a four star establishment if not for the cacaphony, whether there is music o","useful":3,"cool":1},"5mCKRYSmUB9YXld1Qs32MA":{"text":"When in doubt ask Anthony and if he is busy ask Coleman!! These boys made my premier Oak e","useful":0,"cool":0},"zzUsO6jfbny6DaXBHt6wfQ":{"text":"I truly love this place!  It is owned & operated by a few brilliant girls from my high sch","useful":1,"cool":0},"1Gr1Xe5Ufpq1wMlw2bfdhw":{"text":"Had a wine night with the girls... They hired new help. Our waiter was nice but too many m","useful":4,"cool":0},"ZBSaZmwCGR--GHjRz14L0Q":{"text":"Although I frequent Oak Wine Bar on a weekly basis, I am only comfortable giving it 3 star","useful":0,"cool":0},"qdaCgl0DH_9h2FO39tlzcg":{"text":"To make it short, Oak is fine.  To make it long, well...\n\nThe wine selection was good, and","useful":1,"cool":0},"m1R52csIG0xXHUlDl5TOsQ":{"text":"Shrimp tacos, Seafood bowl, Duck confit and Pork tamales. All delicious!","useful":5,"cool":1},"HkyZfrDvUWQfeZGkPyShNA":{"text":"Perfect place for a late night bite to eat and catch up with friends over a glass of Pinot","useful":1,"cool":1},"Ncx0P-fc0_vmqVv2yE7D4A":{"text":"Slow Wednesday night at Oak last night. The place was about 25% full. Wine and drinks were","useful":0,"cool":0},"IO64aPNaXr4OAFSrnF6kUQ":{"text":"To make this short and sweet....\n\nOak is pretty and modern, but not much personality.  \n\nT","useful":5,"cool":0},"Kdu1XuzGmTbRm3WU8sH9vg":{"text":"Kinda swanky, but nice spot for an after dinner beverage. I thought the all white decor wo","useful":0,"cool":0},"OL1amxXsDyWJtRZHbyCkXw":{"text":"It's a cool spot.  Its kinda foo-foo, which means the ladies probably love it.  The lights","useful":0,"cool":0},"0_UMcCyajUcjYW0PbE0mEg":{"text":"I want to like Oak... I really do.  A self-proclaimed wine and small plates lover, I find ","useful":0,"cool":0},"EEatnp5-g30dCfV7xHC5lw":{"text":"Went for happy hour on Friday with another couple. The discounted wine selections by the g","useful":1,"cool":1},"n-TeeYlA2rzsxZaMYB1n2A":{"text":"Yeah!  There's no longer an empty storefront on Oak.\n\nBoo!  It has no parking and terrible","useful":6,"cool":2},"dFuJs17vUx6U_X_LRgvrEg":{"text":"This place is really cute.  It can get pretty loud (and not many people were in there) so ","useful":1,"cool":1},"Jhaj-BjWPP1dkrzqRQ25bw":{"text":"I've been back to Oak a few times since my previous review and I think it's only appropria","useful":7,"cool":5},"DNozq2ECdTs_tAg-03KqjQ":{"text":"I've been wanting to go here since it first opened...Loved it! Just what this city needs, ","useful":1,"cool":1},"u8zIlyzaLz-ii8VJFFOedA":{"text":"Great wine list. Really. But the service was abysmal. The only attempt at eye contact came","useful":0,"cool":0},"5PokZQOLssCjFuYO29iPNw":{"text":"No other words but awesome. \n\nFantastic wine list!\n\nsmall plates.....ricotta gnocchi, hang","useful":1,"cool":0},"DlAjxxrU9b-AtMFx9bV5XA":{"text":"Beautiful modern chic place. Definitely a great date place and a spot where you can unwind","useful":2,"cool":1},"oWGibdo81MQQT9YO5gCHsg":{"text":"Did not know at the time but on Wednesday half off bottles of wine. Great atmosphere to br","useful":0,"cool":0},"DozUfhjKOjP_KjcnzIE2gg":{"text":"There was a two hour wait at Jacques-Imo's so we popped in here  for a drink and were very","useful":1,"cool":1},"WpO_Qywl90bur0Vsgg2YSg":{"text":"What!?! What did you say?! I'm sorry, I can't hear you!! That was my night at Oak. Well, t","useful":5,"cool":1},"fbHTueXcEU_Hfw8FULeZag":{"text":"stopped here after tapas for a drink.\n\nsuper crowded last night. not really *my* crowd, bu","useful":0,"cool":0},"-mCAWjrWYE4NEPaQf7GyAg":{"text":"When Oak opened I was ecstatic.  Finally, a bar close in my neighborhood where I don't nee","useful":2,"cool":1},"xn0sKMJ9M7V8L5DaM7kzog":{"text":"Have been and enjoyed my service at the bar. But after tonight we will not be back to Oak.","useful":1,"cool":0},"zNXEUhtxrXP3EQ7CB9Su7A":{"text":"DRINKS ONLY - \n\nWalking into the space you are bathed in dim lighting, and surprised by th","useful":8,"cool":1},"r25swqHKn1BxWxrvjem3Hw":{"text":"This place has its ups and downs. I was really excited to see a wine bar open up in this n","useful":3,"cool":0},"groBajeqEW3r7rofzPLkrw":{"text":"This place has an incredible atmosphere and is dog friendly! Great eats and drinks. Happy ","useful":2,"cool":0},"SU88HsNfLwBtzFcYIBTbzg":{"text":"We were staying in a home just around the corner from Oak and wandered in a couple of time","useful":1,"cool":1},"Oe-PRVdy4Ub5aC9nEAWZbQ":{"text":"Love the idea. Hate that it looks like a sterile department store and has the worst cockta","useful":3,"cool":0},"_DBwG5UWuFnfZjVrQc6hBQ":{"text":"Awesome vegan drinks with Goat wrenching sound waves that cause intense pain to the Goats ","useful":2,"cool":2},"XwAtWN4k9LxBj90jb21zuA":{"text":"Ok it is getting to be a real painful pattern that Oak is ALWAYS running out of beer.  Las","useful":1,"cool":0},"FIxy7uBM1iPZzucSuTAmvw":{"text":"Loved this place for  after dinner drinks (had dinner at Jaque-imo's down the street).  Tr","useful":1,"cool":0},"3B5gE_sRksqAIi5I4YfoWg":{"text":"Since I was traveling - I asked Chef Stew what is/ar the best items on menu?  This young t","useful":0,"cool":0},"VaUdDas8C9tcQWVuEDyaAg":{"text":"This place is great for a ladies night out.  Some girlfriends and I went here last Tuesday","useful":1,"cool":2},"oUfPjHN4U3oY5DlxHEBx_w":{"text":"Oak is tasty \n\nI'd like to start off by saying I live just six blocks away. So the fact th","useful":0,"cool":0},"OwQY6clf-mBEssYsGuMrsQ":{"text":"I liked the Oak because one of the bartenders kicked out a guy begging us for money when w","useful":0,"cool":0},"EbRomNCadi2So8IDL64WmA":{"text":"Came here for cocktails with the girls so this review is only based on drinks and ambience","useful":0,"cool":0},"CB6v0lB4GUBM9MRBO0AaBg":{"text":"Just had Oak at the recommendation of our AirBNB host. The atmosphere is cool. It's hooked","useful":0,"cool":0},"56Tp1bWPs13EK6UIgmKerQ":{"text":"Life is too short for bad drinks, indifferent waitstaff and so so food","useful":0,"cool":0},"9X_lChxDItqRTPPc20k-5Q":{"text":"This place is gorgeous. I stumbled upon it on my way to (of all places) Snake 'n Jakes wit","useful":8,"cool":4},"jzXMr4A8u59dO77pmuoC2g":{"text":"Noisy, first off its noisy when it's crowded, which fortunately is rare. That's probably b","useful":5,"cool":0},"nzDdubeRbonLsJND1iNxpQ":{"text":"Really good service and super happy hour. The food and liquor prices are super low on the ","useful":1,"cool":0},"8CVJTq7C-v-H-l_YCGBgMw":{"text":"First let me say that I really loved the decor- mostly the bar chairs, art, and colors- so","useful":2,"cool":1},"FjSnSJhd0YeGCZ20AMQamw":{"text":"We'd hoped to spend a mellow and relaxing moment with a few drinks at this new wine bar, s","useful":2,"cool":4},"Z_gWYNDA0RCAM9gLCne82g":{"text":"Solid spot for a glass of wine or small bite either before or after dinner. They also play","useful":0,"cool":0},"obZwOxRqXxEFQwohSfqKrg":{"text":"Great service, swanky vibes, classy ambiance, insane music, and superb drinks. My fiancé h","useful":0,"cool":0},"ERnpX7VClGED0FgH2OQW1A":{"text":"This is the place where you go to have your conversation while you wait the 150 minutes it","useful":1,"cool":0},"QwvwEWZtSytsGZN4lM3q8g":{"text":"I'm a sucker for beautiful decor and I felt comfy and relaxed here. This is a perfect plac","useful":1,"cool":0},"N_go9SLLnwurRzHb8jfNUA":{"text":"Some friends and I checked Oak out for a bite to eat at a place that's a little different.","useful":8,"cool":3},"BLEveqJGF2Qb_h5P_5baRg":{"text":"We popped in for cocktails and small plates.  The cocktails were pretty good, as were the ","useful":1,"cool":0},"7yVklmg_L2hFzrf00YOomQ":{"text":"GORGEOUS interior, but great furniture isn't what's going to make me come back to a wine b","useful":1,"cool":0},"6wedSG1qTThKF_hJCaUsTA":{"text":"They saved my night. After having an awful experience at \"The Tasting Room\" on Magazine, w","useful":0,"cool":0},"cnGVYBdTYU7mE3qzKfBc-A":{"text":"Great Atmosphere! Great food! Knowledgeable Staff. They love their locals here too. Dont p","useful":0,"cool":0},"YAoUhel_tc6HnOWyLxixMg":{"text":"4 Stars for Happy Hour and for this bar having a lot of young professionals with most peop","useful":2,"cool":1},"qVhA2n3Nxj34EpF21A1aFw":{"text":"Okay. So you walk in. The place appears to be nice. Then you start to look around. Deflate","useful":2,"cool":0},"4x0dKKKvz40NuaXpRrIyIA":{"text":"3.5 \nBartender was great accommodating a food allergy and suggested a cocktail she could a","useful":0,"cool":0},"g4UwBvqAnIeUc8Yi4ttQsw":{"text":"I am a huge fan of Oak after only one visit.\n\nIt wasn't too long ago that I wouldn't have ","useful":7,"cool":2},"NUxx-FW4MzmG1q9Am7f-0w":{"text":"My first instinct for this place was a total \"meh\"...but now (some time after patrolling t","useful":0,"cool":0},"qesQFTlaksWiNYREP_58ag":{"text":"If you're looking for a place where you can meet friends over some good wine or cocktails,","useful":1,"cool":1},"dMNWcbfwERDFvsfGafLWkw":{"text":"Great ambiance. Fresh, cool, has a great clean feeling. Live jazz. Can be casual or dressy","useful":0,"cool":0},"YXTlo820iBnpSihZ7atrPg":{"text":"Agreed. This place is lovely inside. There are huge oil canvases on the walls and everythi","useful":3,"cool":0},"MS39TlXW6T11RpABj7g7Ow":{"text":"This is a great upper class wine bar with a nice atmosphere. Great for young professionals","useful":0,"cool":0},"zwebvK6J5K6xrPRo8F77gA":{"text":"I've been to Oak Wine bar a few times, but I'm finally getting around to writing a review.","useful":4,"cool":3},"c28ogtFNh0Z9PUHofmXMEw":{"text":"I've been doing a different happy hour every single night since I arrived 2 months ago or ","useful":1,"cool":0},"6R5ptBeTWlpoWLLW_q4wwQ":{"text":"Ehh - I'm not a fan of this place. It feels like one of those soulless California celebrit","useful":8,"cool":0},"7kUUQDM5lCctO3YkYeodVQ":{"text":"Been here a few times for happy hour. Friendly staff. Buffalo cauliflower is amazing and g","useful":0,"cool":0},"G23tzZFDbPl_s2DbfrjJrQ":{"text":"I only had mixed drinks, mind you. The music was great (we hit a zydeco night - my favorit","useful":0,"cool":0},"IOQsT8xXnTLBG1V1f_-NUA":{"text":"The thing I like about Oak is that in this city, which is chocked full of bars, this one s","useful":1,"cool":0},"nCysJvRNOdq27_ReXuJ4Xg":{"text":"Service was a little unpolished, but this place has potential. The combo with Ale next doo","useful":1,"cool":0},"khWAzbZlN5YC2zXvdVPLSw":{"text":"We were in the neighborhood looking for a nice place to have a glass of wine or cocktail. ","useful":4,"cool":1},"R0hdxXErw_ONxAucS5Af4A":{"text":"This is a little pricey for my college sized wallet, but still enjoyable. They have a grea","useful":4,"cool":1},"jAkFHQvDM5mv5DDOWxytrg":{"text":"We absolutely love this bar. Incredible wine selection, perfect food options, and cool liv","useful":0,"cool":0},"Xb5y9dQ007fcmALzGmvWWA":{"text":"Oak probably averages out to 2 1/2 stars: \n\n1 star for the horrible acoustics - you have t","useful":3,"cool":1},"x-aOOgikH2Z8Cfi-iIPesw":{"text":"Great drinks, friendly bartenders, beautiful space, and a great band the night I was there","useful":2,"cool":1},"L35r7DfcJIDeB_fN5bVMMQ":{"text":"My college's alumnae happy hour was at this bar and it was great spot although finding par","useful":2,"cool":1},"VBt1oyzTsq5Zwo1ml7Bgpg":{"text":"So me and a girlfriend of mine were looking for wine on a Friday night and Yelp led us her","useful":4,"cool":1},"BFiAb28A9H1uOtuvLVCIRQ":{"text":"The food here was marvelous--so that's why it gets four stars. The service abysmal. I hone","useful":3,"cool":1},"M1VZOr7HpGqT-H1-MVzI1A":{"text":"Wife and I had dinner and drinks here. Excellent selection of food with all of it tasting ","useful":0,"cool":0},"3UM1fNSoesAerO5C72QgSA":{"text":"Love this wine bar! Extensive wine list. They have great a happy hour and daily specials (","useful":0,"cool":0},"wSXscJt1jK2oZN7DDbmtBQ":{"text":"OK, I am kind of torn on this one. On the one hand you have an excellent selection of wine","useful":8,"cool":3},"VXIpA6WHZ016-KzKKJ_tjg":{"text":"Definately over three stars.  It is not casual enough for me, and too white inside.  I jus","useful":1,"cool":0},"xUNsi1Aqksv1eiCGV883PA":{"text":"Love this place! Extensive wine list and lots of good snacks coming from the kitchen, thou","useful":2,"cool":1},"y5ms5zvofEXUvurkQxsPHg":{"text":"Through a bizarre set of circumstances that I dare not elaborate on, I found myself in the","useful":0,"cool":0},"NEwjFceaDiiKY7Iw9qrYcw":{"text":"Beautiful space but acoustics were off. Hard to chat when you are listening to a one man b","useful":4,"cool":0},"zYdXTns9A6YMiSkCjfFmOw":{"text":"I enjoy having a nice glass of wine or cocktail at Oak, and their small-plate food items a","useful":1,"cool":0},"94xAQ2RuJtR9g0woUvhwoA":{"text":"Without question some of the best food I have ever had...anywhere in the world, just amazi","useful":0,"cool":0},"AfrXMjzymq6tjoPLyrEKLw":{"text":"While I have lived in the neighborhood or years this was my first time inside Oak. I had h","useful":2,"cool":0},"Yu2RFiJ42KJAOwRTEA3AfQ":{"text":"Genevive was awesome and helped us find a wine we really liked and even let us try a few s","useful":0,"cool":0},"MFB58tp4khXnp6KC2_zRgQ":{"text":"Just when I thought I had been to the douchiest bar in New Orleans, I find myself at Oak o","useful":1,"cool":0},"epovVQZvonIdVlCgThDfHQ":{"text":"Susan hit the nail on the head. Weird acoustics and too spaced out and sterile for New Orl","useful":5,"cool":0},"viES-uGST1JomjB6LixRog":{"text":"Great wine selection!  You must try the French fries and gravy...amazing!","useful":0,"cool":0},"b4wQUAnYS-pOMrOWz__V6g":{"text":"I am glad New Orleans has this cool wine bar/cocktail lounge. Its design and decor are mod","useful":1,"cool":1},"_rwz2FP-PAk259aj8lS2xQ":{"text":"I love Oak! I live in the neighborhood and I'm positively DELIGHTED that this place is her","useful":0,"cool":0},"WW8FMGHhz-8jhQH-dOrEhA":{"text":"This is for you classy folks! You know the ones who want a simple glass of wine. Light sna","useful":2,"cool":0},"zqNoCFrm4tkPtuq6ehUNmg":{"text":"Wine menu offerings are good and priced well. Had Malbec and it was well balanced. No merl","useful":2,"cool":1},"KCW58y6eSn1_xMro-glOKg":{"text":"Not sure how this place has bad reviews.  The food is fantastic.\n\nThe french fries are out","useful":1,"cool":0},"yJNZ_74Eq2ahqetftBFlfA":{"text":"loved this place, very spacious and friendly service. \nA great list of cocktails and a ful","useful":0,"cool":1},"3WGftRaUIgUokiRDf4eGyA":{"text":"Wow\nThe wine selection is excellent \n\nThe food is tasty and delicious \nSo many choices \n\nW","useful":4,"cool":4},"7L9iY-rK-45lFRf1P4ayNg":{"text":"Oak is the BEST! I actually discovered this place years ago when I was invited to Ale...I ","useful":1,"cool":1},"GVS87UFz7KWcst87Nj9WIw":{"text":"I don't usually drink wine or fancy cocktails, but if I'm in the mood for either this will","useful":3,"cool":0},"vUvyt2ie-2cS4wboURNUvg":{"text":"Went here for a last minute happy hour to try something new. The place was cool. I felt li","useful":0,"cool":0},"L3-U-bL0malTMUpZnX-1Jw":{"text":"Oak, located on Oak street, is what I'd call a high-end bar. They serve food, which is goo","useful":0,"cool":0},"XgezlyN1ig9M1Lmq0Erjfg":{"text":"Great atmosphere and intelligent bar tenders, place to be. Very eclectic vibe, great wine ","useful":0,"cool":0},"BKc3qFyJXoB6YGlAvU9Urw":{"text":"This place will be the go to lounge for my friends and me.  It's located on Oak street so ","useful":3,"cool":2},"4tMg9pRUuSmRjbjjm2kpwQ":{"text":"Every time I come to New Orleans, it takes me hours to try to figure out where to eat and ","useful":2,"cool":1},"G1Jl7HHeZvrS8U0peLiG5A":{"text":"I magically stumbled upon this wine with a friend and we simply couldn't resist the big si","useful":1,"cool":1},"HbC7lhH89a7zBe3AU4LPkw":{"text":"Oak is an upscale bar on (as the name points to) Oak Street in the Riverbend neighborhood ","useful":6,"cool":2},"c6epiR2GzwHavd_IXYnhMw":{"text":"Wine Wednesday... that should say it all.  Half off bottles of wine (less than $70 though)","useful":1,"cool":0},"LqEHUyZFKPKw0gUMMvMkcg":{"text":"Half off wine bottles on Wednesday and delicious food always! Love this cute neighborhood ","useful":1,"cool":0},"zed94i438Ty1sGLD4TX4wA":{"text":"I liked the idea of Oak, but I wasn't loving the vibe the night we were there. My sister b","useful":2,"cool":2},"lvsPrT00AiI8O0KWqeqqdw":{"text":"Super cute!! Shared a patio with Ale.\nGreat happy hour and on Thursdays- a $20 special for","useful":2,"cool":2},"BDROpIowfR4tkDoohj_FKA":{"text":"Beautiful place! It's clean design paired with a large wine list, creative specialty drink","useful":3,"cool":3},"tGtRcn0LO6il72o4TYyXiA":{"text":"Well Blue  Oak BBQ is really good! I enjoyed my rib plate with the roasted Brussels and ro","useful":1,"cool":0},"59ygP_28Jl4LUIfBVMrpVQ":{"text":"I happened to be going out of town for a while, so my girlfriends and I decided to get tog","useful":1,"cool":1}}