{"72O-XVSls2TTA5jQMT-W_Q":{"text":"This place is a decent bar, with a great burger. Although it isn't quite as good as port o","useful":1,"cool":1},"_OAPppiKXeISoXl14KC9-A":{"text":"Literally one of the best burgers I have had in my life. sassy bartenders... get over it.","useful":1,"cool":0},"9LL4ELiY68tQpSFLn5qIig":{"text":"The guy who cooks is a total douche! Maybe management shouldn't allow employees to drink o","useful":2,"cool":0},"J9BhGQHhNIo1zhq1sKMTJA":{"text":"This is the place to go for a burger.. well I am going to call it the BEST I've ever had..","useful":0,"cool":0},"2vScFxsUft1W9DCLeW9thg":{"text":"God I love this place. For the price, you can't beat it. Hell, even if you're on a diet, y","useful":0,"cool":0},"CsqMAMNnzYVXkSEeOWftSA":{"text":"Typical bar....they have seating outside with lights and a fan available. Staff was friend","useful":0,"cool":0},"Ih2zVtlwyYUz_Omesd5q9Q":{"text":"Burgers are good, not great. But good enough. Portions are huge so it's great after a nigh","useful":0,"cool":0},"QcC8Fxz7V7ozdafxyzS3nA":{"text":"Solid food but man what terrible service. The bartender rushed us, cut us off and generall","useful":2,"cool":0},"y1oVuEVLksL38ORaJelK7A":{"text":"AAH the Beach Corner.  When I lived in Lakeview this was a frequent spot for me.  Now that","useful":6,"cool":0},"MsJ8dwwOQztkW-yrXnyyeQ":{"text":"The Beach Corner is a fixture in a memory bank.  I have had many a good time in this place","useful":3,"cool":1},"2HyhbKC9494PJ0ivslMIpA":{"text":"Why is anyone eating this mess?  Burger devoid of flavor, covered in chalky shredded chees","useful":0,"cool":0},"EEhqJoFDIzl7JRFtbJA-Ow":{"text":"great burgers with great atmosphere. I stop here at a spert of the moment to watch the sai","useful":2,"cool":1},"ArVnO9lU7UnqsTfoL0nGkw":{"text":"Beware of this place!!! We had some drinks and cashed out at the end of the tall waitresse","useful":1,"cool":0},"YNLCriefjRWM-raI-hZ-YQ":{"text":"Great Happy hour, great burgers, pool tables, and familiar faces.  What more do you need i","useful":1,"cool":1},"YstLaYWzKNoGVQWotArNeg":{"text":"being an out of town-er, I just had to stop, why ?because the cemetery sits  rite  next to","useful":0,"cool":0},"K8T9r83l84cKOP4atiZFkw":{"text":"The food here use to be so good.The grilled tuna was excellent.The last couple of times it","useful":0,"cool":0},"P58KDsXD2ymdftzL_tiVSg":{"text":"First off let my say this is a burger bar. I read a lot of reviews on here and it seemed m","useful":0,"cool":0},"GCErNm_I6kxoZITBYBycsg":{"text":"Great neighborhood dive bar. Good burgers and fries for reasonable prices. Perfect stop af","useful":0,"cool":0},"BIHDImVeLocZUY8ff44R0g":{"text":"Really good burger for a good price! Fresh cooked to order, nice staff. Good place to hang","useful":0,"cool":0},"O9PmV5BguOT0iD6YbH_NSQ":{"text":"Very bad service, very negative energy. Good burgers, but not the best in the city and not","useful":1,"cool":0},"aznRlEVrs7Liy9LmPOfvhg":{"text":"Beachcorner is right across the street from my gym so I walked in one day after craving a ","useful":5,"cool":2},"TGd4Tkvw_yrkkY4T1XWXug":{"text":"New Orleans is surprisingly to many to be a heck of a burger town. That said, many may fin","useful":0,"cool":0},"U48XKTXZOZonlbdJBPxcmw":{"text":"Absolutely  great burger...grilled to perfection.  If I had one suggestion,  it would be f","useful":0,"cool":0},"oVY9FEZD8H3TPw_MlKFhJA":{"text":"Good burgers, otherwise standard bar-food. The Mr. likes the place, but that's probably on","useful":0,"cool":0},"gRHG8emLog3PSn10bK6uUg":{"text":"This was a great tasting burger...excellent size and quality. The service is slow. I was a","useful":0,"cool":0},"qUIJHbrmSpgAMjPA4HW0EA":{"text":"My first visit to New Orleans I was fortunate enough to have locals show me around. My boy","useful":1,"cool":0},"pXmD2mbc7hqzhonur-izFw":{"text":"Great for late night eats with quick service! I live close and when I have a craving, the ","useful":1,"cool":1},"6p1Jh6chn168sBMIbVDO-A":{"text":"This is one of my favorite burgers and cheese fries in the city! Always good and spiced ri","useful":1,"cool":0},"ehTcOiry_OzAm0yqjPo6DA":{"text":"Pros\n----------\n- Consistently the best burgers in New Orleans.\n- Casual atmosphere\n- Fast","useful":1,"cool":0},"VSML_pVZT4MRitQBkB6Mbw":{"text":"This place is such a dive but I love it!!! The burger may be...hands down...the best one I","useful":1,"cool":0},"PfuSYrBe_lC-sMRbwdZYQQ":{"text":"This is the place to go when you want a Big affordable burger. The Burger is 10oz of Beef ","useful":3,"cool":0},"1CsYYoU4ZO3Ptuy60e3t4Q":{"text":"Great burger.  I mean great.  The burger was as big as my head, no joke.  The bacon cheese","useful":0,"cool":0},"6C1vDGFSkaznPV7m0A8ovA":{"text":"Despite one of their coolers being out they were still serving from it. The lettuce and to","useful":2,"cool":0},"0yuNrxYdWHMjFU38mhh8Sw":{"text":"This place was recommended to us by a local who we met at another bar. We were looking for","useful":0,"cool":0},"zJ_rAT2xMAhK44RyOgwgMA":{"text":"One recent evening after working out I was waiting for the Canal Street Car and the oh-so ","useful":1,"cool":1},"YT6xrHlSJGbl0l9tTMb3Qw":{"text":"This place has the worst bar food I've ever had the miserable displeasure of forcing down ","useful":0,"cool":0},"6EDDQYyaQa9BuNesHRkZJQ":{"text":"I grew up eating, especially in Mid City. Taking the old streetcar to Canal St to see movi","useful":3,"cool":1},"jXb5pqD3ccwqN3hycYXT0A":{"text":"love the small enviroment not too busy and the bartenders are nice burgers are huge good p","useful":0,"cool":0},"ruKMmVZxkWDu6sX1br_hrA":{"text":"Been coming here for a long time and never disappoints....bacon cheese fries are sinful.","useful":0,"cool":0},"wQi81XM-8A_QeuRDXXoUMg":{"text":"This is a great neighborhood establishment, been around for a while.  The food is really g","useful":0,"cool":0},"2LWbHD6CIuAx61QLKRPQ0Q":{"text":"Holy moly, this was an amazing lunch. Ordered at the bar and sat down at a booth, got the ","useful":0,"cool":0},"UdLJVLW3dtoKyjWpZCcg1w":{"text":"We read a lot of good reviews and decided to bring a party of 15 here. We called ahead and","useful":0,"cool":0},"g9ymHs1SUukikPkvRmsuKA":{"text":"Good spot for a cheeseburger/cheese fries-soak-up-everything-from-last-night meal.  The ch","useful":0,"cool":0},"Hl-VLxUxh7dZwW0C5_vRnw":{"text":"In my search for the best burger in NOLA . I read where Beachcorner had a good burger.\nIf ","useful":0,"cool":0},"c38Mav9Iba2j4H6AM34Y9g":{"text":"I have always loved Beachcorner, but this weekend sucked. We had a 5 person to go order. T","useful":0,"cool":0},"NknV3K0dC45aPcZXSMudPQ":{"text":"Beach burger, dressed, side of fries.... delicious! Tied with port of call and snug harbor","useful":0,"cool":0},"ffa1coKrUPWBQ4tYbcWacw":{"text":"This is my favorite late-night food spot in Mid-City. I love their fried shrimp! You order","useful":0,"cool":0},"M7lo4o9aaFhuvVvofIs8KQ":{"text":"The outside of this place is deceiving! The burgers are awesome, cheap but good drinks, an","useful":2,"cool":1},"HW4ho1S46iVO6yyGq--NnA":{"text":"I had heard really good things about their burgers and finally gave it a try. So glad that","useful":0,"cool":0},"FlNBlLpMBYx25v7Es5MnIw":{"text":"BEST BURGERS IN TOWN!   also...great cheese sticks, awesome service and low key location.","useful":0,"cool":0},"geyz9-ZPxTpya6O-g5Xkfg":{"text":"Very laid back, reasonable prices.  Wait staff very friendly. Plays 80-90's music. 2 pool ","useful":0,"cool":0},"AsoMLDEHkz9zZFAZx6Fd3Q":{"text":"New discovery by me during the beer marathon last time home in New Orleans. We just finish","useful":0,"cool":2},"hTTmJu36ZoZ8CbZOooyGWA":{"text":"Great low key spot to hang out. If you're looking for a late night spot to chat, play a li","useful":0,"cool":0},"qCzdWwKf_KYg8GtyPwk5pQ":{"text":"Neat atmosphere, best burger I have had in a long time. The service is marginal however.","useful":0,"cool":0},"luK9hDg58wCp8Gm8AS7vqw":{"text":"The burgers are really good but the staff consistently looks/seems like they hate being th","useful":5,"cool":0},"xxxSUEd3eCQiTcJIJksVqw":{"text":"Awesome burger. Local joint with TVs for games outside. What mire could you want? Burger r","useful":0,"cool":0},"Xvv0WLjR6jp0jrdML7vTZg":{"text":"Went for the burger, which was good but not Great. Frozen onion rings - not my thing. They","useful":0,"cool":0},"DNOwScCQyBQcuq1zjQOyhQ":{"text":"There is a lot going on with the Beach Corner. First, it really should be called the Grave","useful":4,"cool":1},"db9TNXg_4Hv0j0aafF1c4Q":{"text":"First of all this is a bar so don't bring your kids! Hands down one of the best burgers in","useful":1,"cool":0},"4XbUSCh6tQinl8jC087log":{"text":"The food maybe good... But the service sucks. They are not prepared for any size group nor","useful":0,"cool":0},"W-Ot_628mlyhCUYEYk8NWg":{"text":"Just left and was irate. My review is about the bartender I unfortunately had. I don't kno","useful":3,"cool":0},"E8E_RPC5zlXjhLQetEdXTQ":{"text":"This is the place to go if you want the pound for pound best burger in new orleans.  The k","useful":3,"cool":2},"nd7G7vscLgDRZNp3hvJ75g":{"text":"Where do I begin?! Wonderful food and great atmosphere. They're popular for their burgers ","useful":0,"cool":0},"o6K3X2iKt_ZG6A4vDPmovg":{"text":"Best burgers in town, in my opinion. Far better than Port Of Call. I always seem to have g","useful":0,"cool":1},"LCJTInZFMQlq8iKdr9Y3rA":{"text":"After a terrible altercation here months ago I thought hard about writing this review. I t","useful":5,"cool":1},"tNfyZqQewIiJjtKFKvW1Hw":{"text":"Ok, Beachcorner has a special place in my heart because it was the place I had my first \"B","useful":2,"cool":1},"wdaffsBox-5-H41QcODg3w":{"text":"Always my favorite burger in the city, although I still have others to try.  They are very","useful":3,"cool":0},"DYzsPoTT2RHq0D4H_U-YeA":{"text":"The food maybe good... But the service sucks. They are not prepared for any size group nor","useful":4,"cool":1},"JumEtL5t7dV9OzZe9E1A8g":{"text":"Food was decent service was bla.. great place to watch a game. Probably won't go back.","useful":4,"cool":1},"BBGISTLqjBwneE_WYRQlNQ":{"text":"I came because my friend loves the burgers here. I ordered a cheeseburger- cooked medium, ","useful":1,"cool":0},"guxrNhdnqklQtyVdNEFkyA":{"text":"I wouldn't quite call this place a dive bar.  It feels more like a Metairie neighborhood l","useful":7,"cool":3},"L1f9Zwg56dkEhcY5Joz_Mw":{"text":"Best late night burgers, or anytime, in the city. Put their burgers against anyone in the ","useful":0,"cool":0},"1u0rQ6Dnpsvw2Ex9rwwzvQ":{"text":"I was mad craving a burger yesterday. Something juicy and thick to sink my teeth into. So ","useful":4,"cool":3},"F76-kcNJcmJIKNxp4pLBdQ":{"text":"One of the biggest, freshest burgers in the city. Great casual atmosphere and friendly bar","useful":1,"cool":0},"pivVkEG50QafVNo0XJNQOQ":{"text":"Great burgers and great chicken sandwiches. Cool local bar. Not a party scene which is coo","useful":0,"cool":0},"i_e1tVmqS7wNKQR-X89z1g":{"text":"What a surprisingly great place! I went here after having a few drinks because I was STARV","useful":4,"cool":1},"iUvOHWuZDdQnuSZcV_KOnw":{"text":"Hands down the BEST burger in the mid-city area. A bit pricey but worth the price. Nice pl","useful":0,"cool":0},"H_udhz5N6k5CyWW_2F58mg":{"text":"Meh, I don't see #1 burger at all. The mushrooms were tasty with the garlic seasoning, oth","useful":4,"cool":1},"Jc9RlPy0lvV59GFBlc1lzg":{"text":"This might be my new favorite hang!  In the quest for a low key neighborhood type bar, and","useful":0,"cool":0},"TqcqMyFnZQtR6N3GXlXACQ":{"text":"BeechCorner is a relaxing chill atmosphere... \nBut most importantly the Burgers are kick A","useful":0,"cool":0},"0ykcAbjN7kUwAFLydgeajA":{"text":"3/25/2019 we decided to stop by for food and drinks, like we always do, same group of us, ","useful":1,"cool":0},"fX86Xb0WD42_i-TD09TLjA":{"text":"No stars. Horrible service. This woman was such an asshole. Unbelievable. She didn't even ","useful":4,"cool":0},"cYZzXoSSdD582vgA3kz3MQ":{"text":"I don't get to come here often but when I do it's always an excellent experience that leav","useful":2,"cool":1},"_cgJKyxfVXeeLk3KsWK_hg":{"text":"Excellent food.  Chow down on the burgers and buffalo fries.  Don't let the sketchy atmosp","useful":0,"cool":0},"UmPiC9a1FyS04xDXF6lrhA":{"text":"Many locals seem to be unaware that one of the best burgers in the city calls this place h","useful":1,"cool":1},"mQoMq7E_Lrm7D3YAOgsdyg":{"text":"After an evening of concert-going, a friend & I were looking for a good, late-night burger","useful":0,"cool":0},"7J5ynXafsokwQ49T5foNAA":{"text":"The food is fantastic.  The bartenders are spiteful sectarian shrews.  After my party of f","useful":10,"cool":0},"OlY165h8XrrjzgWVBFLyRw":{"text":"There seems to be a trend Nationwide of thinking customized fast food burgers like Company","useful":4,"cool":2},"vvniKJXcavRkP5nRlTBJrg":{"text":"The Beachcorner is a great place to go for a burger and a beer.  The place has a long bar,","useful":0,"cool":0},"zCUtGhEZ2l4PA4TIwFcU9A":{"text":"Best burgers in New Orleans, drinks great price, very friendly staff. Recommend BeachCorne","useful":0,"cool":0},"W88alFYSuVGfhaO49jtS7g":{"text":"Ah beach corner you have redeemed yourself.Tried tuna again last night it was excellent.","useful":1,"cool":0},"8hA9NGzbQOVoOHYGUy4aDA":{"text":"Beachcorner is always an excellent choice for great burgers . Fully stocked bar and pool t","useful":0,"cool":1},"0iqKuDpFyYPO7-i1ew5v7g":{"text":"Awesome spot! Came here to watch the LSU game because everywhere else in Mid-City was slam","useful":0,"cool":0},"vu3TKaJN1LTcRk6TtMiptA":{"text":"Our favorite neighborhood burger place! Being across the street from both work and home, I","useful":1,"cool":1},"Bj98fwRAbOW_wodcFmGTzQ":{"text":"My \"go-to\" burger spot in the city. Burgers cooked to order on the grill and seasoned well","useful":0,"cool":0},"JlN48HZcudW-qGaeCMVpPw":{"text":"We took the streetcar and hopped off the last stop. It was starting to pour and walked ins","useful":0,"cool":0},"Fh9OBD8p92yTOKPd6gOn7Q":{"text":"The best hamburger for the price in the city. They are flame broiled and large in size. Th","useful":0,"cool":0},"Yv0oNxNoFQJyQV3x8QUf1Q":{"text":"Good late night greasy ass burgers with cheese and jalapenos if you want.  Decent draught ","useful":6,"cool":1},"A8SmHjZt0aL1LR_uVS2Z1A":{"text":"If you grew up in the 80's, this place is for you.  The soundtrack to our teenage years pl","useful":0,"cool":0},"IeGm8kO3dW32fLVdD5SmrQ":{"text":"We read a lot of good reviews and decided to bring a party of 15 here. We called ahead and","useful":0,"cool":0},"QjLX90rhCYkePfWsB6i1OA":{"text":"Great place to watch games, buckets of beer, play some pool, and VERY respectable bar menu","useful":0,"cool":0},"TRtmDjzw78JxNbGLuN0_DQ":{"text":"As much as I can, I come here for a meat induced coma that would rival any Brazilian churr","useful":2,"cool":1},"YAHG2Do2XKGR8uS1jT1Pkg":{"text":"I was looking for a late night spot after picking up my hubby from the airport.  He wanted","useful":0,"cool":0},"NC0GDFbrY57ACwd-O0TgcQ":{"text":"Burgers are huge, delicious, and cheap! Clean bar environment. Real pinball machine. Seati","useful":0,"cool":0},"X3uN8ChLFM5goe0wW1BSIg":{"text":"Great burgers fries enough for two cool drinks but heavy smoke and waitresses smoke and ha","useful":1,"cool":0},"gTCEI5iwquHKMNw144Ii_g":{"text":"Don't go here if your not a local. They will take your order and then take the locals orde","useful":1,"cool":0},"T1ZK3oSZsKtjw0n_LZ7Bww":{"text":"I went last night (Friday night) & they were super busy! I was with a party of 6! The pric","useful":0,"cool":1},"K__4F2P6Rb20l4HvKQhFzg":{"text":"Best burger in New Orleans, hands down. It doesn't lean on artisan pickles, infused mayo, ","useful":0,"cool":0},"ksF95zDRc5wJFxPuuukX2w":{"text":"Beachcorner came recommended by several people I had met at Second Line Brewing.  It is lo","useful":42,"cool":36},"DhI7iBziL9UiOIzPDJDPPw":{"text":"Stopped in for late night food after drinking.  This hit the spot.  This is bar food.  Had","useful":0,"cool":0},"s-tonMZOpT8ErQ80rSG2WA":{"text":"I think the cockroaches outside the door were trying to warn us - GO BACK, EVEN WE DON'T E","useful":3,"cool":0},"nt4cuiMQ95rwXckqqweZNw":{"text":"Finally found an excuse to venture into this place and now it's my go-to hamburger spot in","useful":2,"cool":2},"vja0EuhsSYUhADTipj6Wpw":{"text":"Stopped in for a burger after a brief Happy Thursday ride and to catch the second half of ","useful":3,"cool":1},"jFEn-tzEx7GXsv7pQ07kmw":{"text":"Love this bar close to our house. Friendly bartenders and delicious bar foods on the go. T","useful":0,"cool":0},"2inttYJbnNn6Ge-DloPsEQ":{"text":"The Bar is low key always with good vibes The jukebox is pure hell tho! Get your burger me","useful":0,"cool":0},"Hz0mMeQEWIZbRtj5eXdf3A":{"text":"The burgers here are huge and very reasonably priced. Not the best burgers in town, but fo","useful":0,"cool":0},"s13ucwXB5LWFNZ0C3bzIMg":{"text":"Great place to get a flavorful, juicy burger! They are always cooked perfectly. The beer i","useful":0,"cool":0},"MUH9gMEti83n_oYDxjfusw":{"text":"Our uber driver in NOLA told us to check this place out for the burgers - everyone one sai","useful":0,"cool":0},"aie4hjzLm1ahXUDqYG4QHA":{"text":"It's a chill dive bar that my Krewe stops at once a year before our Mardi Gras parade.  Th","useful":3,"cool":2},"XjNthIMkyGc7Pp7e2yWN4w":{"text":"Been a few times - servers are usually Luke warm to female patrons - I have lots of friend","useful":0,"cool":0},"lvnOmiWBF29Ic2D2Ukjkcg":{"text":"Nice bar, great drink selection.  Some local beers.  Hamburgers are 10oz patties!!! Bar te","useful":0,"cool":0},"BDYN46sFZ7ed70KzY6EL5Q":{"text":"This place is known for its great burgers. Up until today, I would have agreed with you. \n","useful":6,"cool":1},"wNt4radCq9Yxaq0rE9-vFQ":{"text":"We used to go to Wit's Inn a lot for our late-night food/drink fix, but lately Beachcorner","useful":0,"cool":0},"HXtkAYvZ1eeGtLYxOiTzhQ":{"text":"It's your typical dive, but they have been known for having really good burgers. This was ","useful":4,"cool":1},"XLUiTpwPbYiqHf8S1UdLyg":{"text":"I was shitfaced and it stopped me in my tracks. Pretty bad when you fuck up a burger. And ","useful":1,"cool":0},"2xgaSclO8MUxell2XXXJzA":{"text":"This is my favorite place to eat and have a good time. Food is always great and staff is a","useful":1,"cool":0},"jN_J72WfyqEB2FH1aywLUg":{"text":"It's bigger on the inside.\nBar, tables, pool, video poker, several TV's like a good sport'","useful":1,"cool":0},"PxFgsqeo56xnRZ8OMHoGAg":{"text":"Great service. Nice menu -- lots of different items. Friendly crowd. Great place to watch ","useful":0,"cool":0},"xG9HUlSda_j92woD3gMSRw":{"text":"Just speaking from a servers perspective the 3 ladies working the bar at the time of this ","useful":0,"cool":0},"M3FG1ybnq5AMjBIB-Tc93w":{"text":"I've never hated a bar so much so quickly. I've also never been verbally assaulted by a ba","useful":1,"cool":0},"idScRh0aG0KKpudtUNUMhw":{"text":"Don't go here if your not a local. They will take your order and then take the locals orde","useful":3,"cool":0},"QaCiO_HKWEmN6zUQZs_ZRg":{"text":"This is our favorite burger joint. The bar is great to be in and the wait staff is always ","useful":0,"cool":0},"qvwXglZ2c5G0xws2Jp_9qg":{"text":"This place is so ratchet and I am *here for it* ...Their burgers are fantastic, great pric","useful":0,"cool":0},"7SuXw51hj24RGDMvXZqV4w":{"text":"My spot! I eat a burger here once a week. They are seasoned well, very large and thick. Ha","useful":1,"cool":1},"sZZUVOymzM894BL5GZlOOA":{"text":"Excellent grill. Everything i have ordered has been prepared exactly the way i otdered it.","useful":0,"cool":0},"kzhfT3uSrGY6RDgrPZgrBg":{"text":"Definitely a dive bar but that's fine. Bartender had a serious serious attitude. Chicken s","useful":1,"cool":0},"2JWbodzK6OunpxuX5mo9rA":{"text":"I love this place(usually!) been eating here religiously for a decade. Best burger in Nola","useful":8,"cool":2},"SNE03NhHAGwrMksrkYhI_w":{"text":"Ordered takeout. I ordered a couple burgers and they were big but really undercooked. I do","useful":1,"cool":0},"Qu50nCTBAWuHdc50bmlsnw":{"text":"This place really hits the spot when you're looking for a juicy burger and some classic fr","useful":0,"cool":0},"Eb59YP_dOkqsYP9k3pOlUA":{"text":"The beer prices are reasonable and descent beer selection.  The food was pretty  good for ","useful":3,"cool":0},"I-zqOwoTNaPsrlIeJohExQ":{"text":"Burger was really large & very good.... the only let down was that it wasn't sold in a com","useful":0,"cool":0},"yPigBkBdcHyyDayCzyinUw":{"text":"Let's call this a dive bar with good food. I love the burgers and they are HUGE! But, it's","useful":0,"cool":0},"LFRdHyVwhfGrhs8b4h7tDA":{"text":"Great burger! But sub zero temperature and pure darkness make for a not so beach atmospher","useful":0,"cool":0},"GpcqwUjyavB6_y10iQ7-og":{"text":"The burger & company were the high points... Not impressed when u put Bushmill's in a plas","useful":2,"cool":0},"fhWR6O8fls_N_r0-7ESl9Q":{"text":"Hot and spicy burger is always delicious. A little pricey and not picky charging for the d","useful":0,"cool":0},"NV82s0cDXM2QNMxPge_gxA":{"text":"Good service and decent drinks. We were allowed in this bar to use the facilities and get ","useful":0,"cool":0},"Zr8W_be1fhI8YefuKgBHcA":{"text":"Truly the Best Burger in town 10oz. !   The Grilled Chicken Breast is also awesome,\n it is","useful":0,"cool":0},"MzX9T0I31g_dvCFvy2hy4A":{"text":"Very good hamburger, very good onion rings, surprisingly good Malbec from a mostly beer an","useful":0,"cool":0},"Ll4Vj1hrdXzEIz_d_80MCw":{"text":"Really really love this place. BEST burger in the city. Not Port of Call. Yeah. I said it.","useful":0,"cool":0},"hPjM3qZPnvczrbZvXZU38w":{"text":"We've been here a few times and had generally positive experiences. Reasonable prices, goo","useful":0,"cool":0},"viyqRkerUmiDZiDX83IJ5w":{"text":"Let me start off by saying I only gave it 3 stars because I only went there and had drinks","useful":0,"cool":0},"hmPL_VLjA6wa8p6N051aOg":{"text":"So I went back for the food and maaan let me tell ya....it's hella hot. Like HOT which I l","useful":0,"cool":2},"ZQYBNVvnujr7PDlP0JpNXA":{"text":"This is a great dive bar with a huge neon sign at the end of Canal Street.  They have a go","useful":1,"cool":0},"XV2lsrJndgnn_xFQ9Av5lA":{"text":"Been here many times for 25+ years.  Came here the other day for a burger, and I must admi","useful":2,"cool":1},"RqnK1es9ZElCb6cQoYBb_Q":{"text":"My favorite place for a burger in the city. 10oz burger cooked exactly as requested, and t","useful":0,"cool":1},"ZeYUOhIhZbLj6vwqr2w6EA":{"text":"Love this place.  Been coming here for years.  The food is great.  Love the cheese burgers","useful":0,"cool":1},"T5pCc3zJLwkAKhvGaKOQDg":{"text":"Best burgers in town. I have been coming here for the Mushroom Swiss burger since the earl","useful":0,"cool":0},"F5pIeUHib7qLOrZOjWQp2Q":{"text":"This was by far the best burger I've had in New Orleans. I ordered a Black and Blue burger","useful":0,"cool":0},"uqlekwW-8Vyf7JErUK8t5Q":{"text":"The food is delicious! You can't beat the prices! From the burger cooked just the way you ","useful":0,"cool":0},"h6J5FTy9lrzi7I4IIh7BlQ":{"text":"MASSIVE! GOOD! JUICY! This sums up ths awesome burger/bar spot. Beachcorner is definitely ","useful":4,"cool":2},"QV5QvRGwrfu4bnM7b1UzqQ":{"text":"Good burgers and drinks. Big bar and seating with friendly service easy on street parking.","useful":1,"cool":0},"iIw1VKJB30JGBMY73p2S2w":{"text":"Ok, I took off a star because my favorite burger joints are Snug Harbor (tastes the same a","useful":6,"cool":3},"h_APoN7Magqv2nFQpg4nqw":{"text":"This is one of my favorite late-night eats, the Beachcorner Bar and Grill!  Cheap, scrumpt","useful":1,"cool":2},"KO9VDptHBhbC0Mmcjh39rw":{"text":"Been going to this whenever I get the chance, recently brought my work crew and ordered to","useful":0,"cool":0},"eJ-97CLUWP-VOAFbetER7g":{"text":"One of the best burgers in town.  Several beers on tap.  Full bar.  Great fries.  Long men","useful":2,"cool":0},"RlyPG8CadR1qTtRvozemWA":{"text":"I like this little spot. It is probably not as hidden as it seems, but I like that it was ","useful":3,"cool":2},"0TOzwPDqIsc_1nU0kQjtYw":{"text":"Can't have high expectation if you are coming here, it's a bar after all.  Only one person","useful":2,"cool":0},"VrNGZ1wv3Cn92ht5EFDKFA":{"text":"We came here for a quick bite after going to a nearby event and the food was great! Big po","useful":1,"cool":0},"0b2S58kDrKbPZtNHcofXtA":{"text":"Living in Mid City, it's amazing we hadn't made it here, so we finally came in on a Friday","useful":1,"cool":1},"YJH-CsMLP1eIYeOAn5LRsA":{"text":"After walking the cemeteries, this a great place to grab a cocktail before jumping back on","useful":1,"cool":2},"kVysP4p5EscXpkgCS8c4zg":{"text":"Stopped by with some friends on a Friday afternoon.  They are regulars, but it was my firs","useful":3,"cool":2}}