{"LR78LvrMbwDtiATitlafcA":{"text":"Went there last night for the first time ever, the bartender was extremely helpful. I orde","useful":0,"cool":0},"g69sUgYPSqmaS07ysuKiYQ":{"text":"After we got our food, we were SO surprised to see this place had 2 stars. The shrimp taco","useful":0,"cool":0},"ZGXpFD168VvX-UohknKstQ":{"text":"The male bartender (not sure his name) is super friendly, super knowledgeable, and... supe","useful":0,"cool":0},"jIBP6Qv52tl_X_gqofptuA":{"text":"Food was ok. Our bartender was a sweetheart but I was a little taken back by the fact that","useful":1,"cool":0},"FxxmbYI8qgysrOtZ1x7YCg":{"text":"We ordered some food from Favela Chic via Uber Eats and got our food with no utensils, no ","useful":0,"cool":0},"Vgf0CAPXBGHmjyYa-pr23A":{"text":"I am a little confused by this place. I had asked around for somewhere to get take out, an","useful":0,"cool":1},"M-EQ2JsdAxueXweejxb5hg":{"text":"No idea how the food is but the entertainment was fantastic. We had the pleasure of watchi","useful":0,"cool":0},"2OV-q9OklnnvJ4iw1oJbiQ":{"text":"Really wanted tacos, but can't have onions so I requested them off. Unfortunately all the ","useful":1,"cool":1},"qZqwZLSCE-gM4xAxvUqcLg":{"text":"This is a somewhat strange venue as far as layout - there is a well lit bar and then a hal","useful":0,"cool":0},"WP3aw87eGV8lZyOxG85WiA":{"text":"We were there Saturday night and my husband forgot his credit card. We emailed to the emai","useful":0,"cool":0},"L8b5d57qRDF5Mj-3K7wl6Q":{"text":"On a recent visit to New Orleans we went to Favela Chic while hanging out in the Frenchmen","useful":13,"cool":9},"OSM1N6xKhyoBvWDj8nq9lw":{"text":"The Dj is phenomenal, and the vibe is mad cool! I love to dance, and this is definitely my","useful":0,"cool":0},"T8V4I2zzvroDNw-aBMb0_Q":{"text":"The pizza and tacos (pineapple pork and Rick's special) were delicious! Totally unexpected","useful":0,"cool":0},"TwKhp7NDYnkJUV7xt6tRpQ":{"text":"Amazing shrimp and pineapple quesadilla! Bartender was super friendly and the service was ","useful":1,"cool":0},"3Lvhx-hdL05PObP9oooR1g":{"text":"Tacos where tasty and decent decent-size and I wasn't drinking that night so I still could","useful":0,"cool":0},"BqMz-H1hrUvhyv75QiXPmg":{"text":"Ordered through Postmates, got my tamales delivered, and.. they're basically all dough. Th","useful":1,"cool":0},"1XrWEIjhI-ZGkVfK2xybcg":{"text":"Favela Chic is an abolishment on Frenchman street. It's bad enough that they took the plac","useful":3,"cool":1},"62o3VITcKDBUsA5S21b-9A":{"text":"Too bad Re poor reviews. We really enjoy their shrimp tacos. Best I've had other than in M","useful":2,"cool":1},"ImCjtlp3qYn_6MCal_6MPg":{"text":"Taking the high road by giving 2 stars.  We stopped in the bar earlier tonight because it ","useful":0,"cool":0},"fIZgO4JB8HW_-t-hC0rNZQ":{"text":"The food is awesome. The service was shitty. Bartender didn't look like she wanted to be t","useful":1,"cool":0},"B3Qwx9Eh0lxlGEP4a1-OZQ":{"text":"Really really really awful place. Very inauthentic and gross. Mushy everything, cold, and ","useful":2,"cool":2},"GIQBdVVvnEJTxBqDP6WIpg":{"text":"Food was sub par, not very flavorful. The bartender was really rude, condescending, and we","useful":0,"cool":0},"7S1tK3y7UlB-_9_5SlNXSg":{"text":"Favela Chic is fantastic. We live in Jersey City (just outside of NYC) and the pizza is ju","useful":0,"cool":0},"aqG-UxLqJmFAEhIlR3Q8vg":{"text":"Amazing food with a great atmosphere! Try the crawfish tacos and the Bourbon Peach Lemonad","useful":0,"cool":0},"VrFAfdjfOzToZpJ5kSi4NA":{"text":"What a gem. Full bar, great food, great service. \nMike, bartender was friendly and knowled","useful":1,"cool":0},"khmeLKncbPQ7PFVkUOm3IQ":{"text":"Do yourself a favor and stay away from this misery. Came in because they had the kitchen r","useful":0,"cool":0},"wu240c6BdPFPv1mw1zRIsw":{"text":"This is probably my least favorite place in all of New Orleans. This review is long overdu","useful":5,"cool":0},"HDCJdSEbvt8RExljeucJHQ":{"text":"Good music. Fried chicken is amazing.    The pineapple pork tacos are delicious.  If you w","useful":0,"cool":0},"vtGo9-xQj_BRaBpHBu38LA":{"text":"DO.NOT.GO.HERE. There was a nasty, extremely long pubic hair found in my pizza (stale, fla","useful":1,"cool":1},"2ficlwqR6GxZoBDRHS4P5g":{"text":"Holy tamale! The tamales here are AH-MAZ-ING!\n\nI've eaten a lot of tamales, this one is wo","useful":1,"cool":2},"9XEkcRzEqgNWFDLYbpHDKg":{"text":"I literally came here to grab a slice of pizza while we were on Frenchmen st. It was the o","useful":1,"cool":0},"OH2EaaQ8FBv9lLdiR9wcog":{"text":"Service is the worst ever!! We asked for burrito without cheese and they brought us with c","useful":2,"cool":0},"A883YhJxqhqr5eUBSgIt8A":{"text":"Favela  Chic is an open space local bar with decent food and folding chairs that offers th","useful":1,"cool":1},"ATZ0Y2tTnVHMjrhRUaVsew":{"text":"My friend was drunk and I was not. Like a beacon in the night she spotted the sign that sa","useful":4,"cool":4},"NFnZ_PbDDQkdJEXem6KB_w":{"text":"DONT DO IT! Employees don't know the diff between corn and flour tortillas. I was rushed t","useful":1,"cool":0},"BQ2MIKVsIF_5tc7Tc2flXg":{"text":"Amazing spot! Music on point! Friendly crowd! I would come back to this spot FORSURE! We w","useful":0,"cool":0},"ynFurM6WVmxyvcXtOjWYqQ":{"text":"everyone loves frenchmen st. everyone hates Favela Chic. Look, you might think those are g","useful":4,"cool":0},"GvJfn8vDpmMqjPGpguVDMw":{"text":"Went there tonight for Halloween.  They have three rooms one was a big dance hall (DJ toni","useful":0,"cool":0},"NyR3dthcSxa3mSI5Rmi22w":{"text":"my girlfriend and I travel to New Orleans often to relax and have a little fun. over the l","useful":2,"cool":0},"qV10EFiFa-gihqpq-DZ0Ig":{"text":"We are staying next door at the 519 and took a chance this restaurant and bar would be ok ","useful":0,"cool":0},"DC4hckawqEjq-IDgWxA2Jg":{"text":"Great place to go for a fun time out. The local drag show here is worth every penny even t","useful":0,"cool":0},"fQWmHGLBplHuIjGAsRHSvw":{"text":"I liked this place. Just a stripped down music hall style bar, no frills. The kinda place ","useful":0,"cool":0},"UbMLIgvDYO3UkGkXfeggEA":{"text":"Their steak tacos are good but a recent visit has deterred me from visiting again. Whoever","useful":0,"cool":0},"cvV_HXyriMb4WH5iaA1Zwg":{"text":"First night in   NOLA, you know it's an ok spot if there are locals... and there were plen","useful":1,"cool":1},"KzKtKnuKZQUv-TasR0Deeg":{"text":"The sound of live music drew my group into the bar while we were bar hopping through Frenc","useful":2,"cool":1},"xzRBDXb_T1uf6xPxB7ZZng":{"text":"The food is great, the customer service is awesome. They have small dishes and good beer o","useful":0,"cool":0},"et02P-g5NQPelARuO6JwcQ":{"text":"Finally get waited on an am told it's too late to order food.  \n\nThe music is too loud and","useful":1,"cool":0},"zch16naIjuGC2o-hMiSABQ":{"text":"I'm not sure how I've never stopped to get a slice of pizza from this place. I've walked p","useful":4,"cool":2},"20te9xtHjTHcDclZJtEMWg":{"text":"Go anywhere in New Orleans except this place. I had to rate it, so I gave it one star. If ","useful":0,"cool":0},"01Ec488ymvKKbqxkH5YUzQ":{"text":"This bar takes advantage of people. They tried their best to triple charge me for drinks. ","useful":0,"cool":0},"Q337lnz7O5a2iXc3d1sPbA":{"text":"On Frenchman. Big place. Got some drinks and looked at the menu. \nYou never know in touris","useful":1,"cool":1},"NLc119MxwPpFu2WNPyui7Q":{"text":"We walked around Frenchmen street and were having trouble finding clubs that were open and","useful":0,"cool":0},"Hg2EwmUygbT6F2tC09IJQQ":{"text":"I'm starting to think that tacos maybe in my blood. If I don't get tacos every couple of d","useful":4,"cool":3},"d34Ar8W6pZRB7jQ5mtxdpg":{"text":"This place was really gross. First got seated and went to the bathroom. There was no toile","useful":1,"cool":0},"ibAxQw6F1fMcmjI8MfGm3Q":{"text":"We saw an amazing Jazz band here, The Jackie Blair Project. If they have more acts like th","useful":0,"cool":0},"iL__5GuNDgPwnZXoKtfqLw":{"text":"The absolute best wings I had in NOLA. Strong drinks and the Cuban wraps are fantastic too","useful":0,"cool":0},"6LdcVYE9EWkVTHHDUv3Xkw":{"text":"Great spot. I wanted to try the food because it looked and smelled so good but we were jus","useful":0,"cool":0},"kefy4us-h-yanQ45tK0dgg":{"text":"Ordered some late night food from Favela Chic through Uber Eats. I ordered the pineapple p","useful":0,"cool":0},"9LuMqpZe0yeg5F9VlI9b3Q":{"text":"Favela Chic is a go to spot on Frenchman St for fresh good food in the day or late night. ","useful":0,"cool":0},"wS0gT8Mraw2EL268YPlRNA":{"text":"I was randomly on Frenchmen one night when I came across this place. I was craving some ta","useful":1,"cool":1},"yqAtRON5O2R-FQIuYkDaww":{"text":"This joint has live music and AMAZING tacos. As underground and word-of-mouth a place as y","useful":0,"cool":0},"E5BWBVnVmPdeimjE_VPtfg":{"text":"Servers are rude and obnoxious. Don't waste your money and time on the horrible drinks an ","useful":0,"cool":0},"X-nrtmbdjI_wtdNClD9gOg":{"text":"Stopped because I was hungry and Favela Chic was right there but man am I glad I stopped. ","useful":0,"cool":0},"sZ6lvxE3N_rIhJunCD92xw":{"text":"I'll never order again. This was a 5 dollar taco. Which I knew what poor quality this woul","useful":0,"cool":0},"AXjoxirbx45_UG_I354KyA":{"text":"I had the steak and cheese sandwich with extra cheese, for an extra cost, but I think they","useful":0,"cool":0},"IpnpZgrrJuprmrLZXQ_XdQ":{"text":"The place is a nice eccentric spot. It welcoming and colorful. Staff was friendly and acco","useful":0,"cool":0},"7m6aGgg7CSHmK3_fC80hHw":{"text":"5% credit card fee?! This establishment doesn't even pay a 5% to Visa/Mastercard so why pa","useful":0,"cool":0},"B1oV1BJJQTKfZnKATBGKkg":{"text":"The food is almost as offensive as the name. I hope they go out of business soon. I got ex","useful":1,"cool":0},"M_2lR1LaHBDwoyIuXMCyww":{"text":"The quesorito is amazing!! So much flavor and the thing is huge. Very filling, only ate ha","useful":0,"cool":0},"dvmlNcX2flm8QeHRF3uz6Q":{"text":"Rating a one because I have to rate it. This has to be the worse experience I have ever ha","useful":1,"cool":0},"d_9VfF-MaRpAabhhE3nvsA":{"text":"Stopped in for beers, tacos and live music. All three hit the spot. The tacos are highly u","useful":0,"cool":1},"YsEwuFzsZuJE0BRdH6TDfQ":{"text":"Great jazz band who created a great show and crowd gathered just for them. Not a up scale ","useful":2,"cool":4},"3HuerdEPVnI6piW8h2sLtg":{"text":"Stumbled upon Favela Chic because we were hungry late at night after a full day of walking","useful":1,"cool":0},"c6HrbbYEhyJ-catY4NgZqg":{"text":"After the manager handed me a slice after I paid for it fell right on the floor in the mid","useful":0,"cool":0},"RbAWs51A0vsBb7mBjHh_hw":{"text":"What a delicious spot! \n\nAfter a long day of traveling, my boyfriend and I came here to li","useful":6,"cool":4},"00SJ2jIXTQv5F6iOlNQcLg":{"text":"It's the spot for late night pizza. In my opinion it tastes like concession stand pizza. B","useful":1,"cool":0},"CJz5t-cdqatynukW2NopNw":{"text":"Excellent place for music, food and cheap drinks on Frenchman. Great place to dance or jus","useful":0,"cool":0},"cNuRwBOsnG8U5KqJHA3P0A":{"text":"Hands down the best place for chicken wings.  They don't have any fancy sauce but I say \"w","useful":0,"cool":0},"y34HYDd_0tbLshserWdEzQ":{"text":"This place has a cool vibe. The live music is good. The staff is so nice... especially the","useful":0,"cool":0},"FhM1iOfViT8fhMdBL18Z8g":{"text":"We came here on a Wednesday night. It was wonderful. Not too crowded at 9:00 and the band ","useful":0,"cool":0},"_M-HHI_wsIILHQddbc0vDw":{"text":"We were wandering Frenchman street for aome authentic NOLA food and a good jazz band to em","useful":1,"cool":0},"bOYu8GVWwmGoKZXnLhVx2g":{"text":"Super nice staff, good space, pizza is meh, but most important of all they have LATE NIGHT","useful":1,"cool":0},"bIl8RLZuPejd4t9-5MWT4g":{"text":"Definitely come here if you're on Frenchman Street. No cover charge to get in. Me and my g","useful":1,"cool":2},"vGhC0ackEqCHWTmtxN0Xvg":{"text":"I am 26. visiting from California. Went in, drank. Stood outside for a phone call and all ","useful":0,"cool":0},"Qs0Xn0foQaR_3C9nFfh44Q":{"text":"Stumbled in on a Wednesday evening and loved the jazz band playing. Ordered two great drin","useful":0,"cool":0},"o2dp8grCBA6fEgL5PBw5_A":{"text":"Fables Chic? Really? Is that like homeless person fabulous? Working class hipness? Y'all a","useful":3,"cool":0},"VI5NmXgysq0Ce8CARNFBOQ":{"text":"Worst service I've ever seen. Walked in and not one of the 5 bartenders greeted us. Sat th","useful":1,"cool":0},"a4PgvqJMGghieeaNwUnHbA":{"text":"Terrible service and after buying $50 of drinks removed our table. Do not go here. They do","useful":0,"cool":0},"1cvrvSM_j2cjCqiAIWuY4A":{"text":"If you like free drinks and shitty service this would be the place to come! She is serving","useful":0,"cool":0},"3cOczEgPIVbGIUiOWPMXVQ":{"text":"We were provided this location recommendation by a train attendant who invited us to his d","useful":2,"cool":2}}