{"lq_0rwoH_wW_BhczRNx7iA":{"text":"Wow what a terrible spa. I can only speak for the manicure/pedicure aspect because I did n","useful":4,"cool":0},"SJ3KV-GXFQtTMUL1qxX2Iw":{"text":"There aren't too many spas advertising a couples' massage.  This was a good choice, if not","useful":3,"cool":2},"Spo4AulVkb2lPDjx-9wsNg":{"text":"My first time at this tiny jewel of a spa, inside of the charming Monteleone. Lance worked","useful":2,"cool":0},"oPTb_l62psYcIFggVY4dyQ":{"text":"Spent my birthday here and it was heaven. The entire day I received services and all were ","useful":0,"cool":0},"6cu8czoSeagiqjLa-XSXbw":{"text":"I was in town on Mothers Day and had a wonderful experience.  The staff was really friendl","useful":1,"cool":0},"jxJ96Dq2rTJLEBNTKy9fkQ":{"text":"I had one of the best facials at Spa Aria! As a world traveler and frequent spa goer, I wa","useful":0,"cool":0},"X1h3AjPAcNdIVuHALcS-mg":{"text":"Irony is a funny thing. My massage therapist said to me that she had been with the spa sin","useful":10,"cool":3},"SqeAa7-SGJiyzQp56Bskhw":{"text":"I was visiting NOLA, and I checked Yelp for well-rated spas. So glad I found Aria. Andy is","useful":1,"cool":0},"iBp_XwMnl6Z5wokWyFky3Q":{"text":"Amazing facial with Trudy!!! She is the sweetest, and very experienced and professional. S","useful":0,"cool":0},"Eqnm9VLh7_Pje6S6TljhrA":{"text":"Update:  One of the co-owners of Spa Aria read my review and contacted me.  She let me kno","useful":0,"cool":0},"BJnWxPuSR9mYOu2UPqayMw":{"text":"Spa Aria is my favorite getaway in New Orleans.  The staff is very attentive and really wa","useful":0,"cool":1},"SfqQ5SodoTg40aDbnry8-A":{"text":"My wife treated me to a birthday massage! We had the couples massage by Kathleen and Deann","useful":0,"cool":0},"WeZEAFzX2WtazGwVD9fu1g":{"text":"Booked a 90 deep tissue massage with a male therapist. Unfortunately when I showed up, the","useful":0,"cool":1},"4YHnDr6F_0LFyI0pL73PBw":{"text":"I decided a prenatal massage was a good way to relax while on a quick getaway with my husb","useful":2,"cool":0},"vtr51Zgl3h93lq4QGsklOg":{"text":"My husband and I booked a couples massage on our weekend getaway to the Big Easy.  We both","useful":0,"cool":0},"EG1F1HJ_9RTNjT3RWoKoFQ":{"text":"Best Massage I've ever had. Highly reccomend Andy! You will not find a better masseuse","useful":0,"cool":0},"e-TLdspkRGTaxzFmr4wDrQ":{"text":"My husband and I went into the spa without an appointment in hopes of having our feet pamp","useful":0,"cool":0},"BrsD1EVpgKtUT24QxLQ6Ww":{"text":"Came to Spa Aria for the bachelorette party package. This place is so relaxing and the sta","useful":0,"cool":0},"w5QE1Gny0EGG1HS3AxWHqw":{"text":"Wife asked that I post a 5 star for the massage and service. She thought it was a great va","useful":0,"cool":0},"ft-eJJ0yYCtvRfyBtK57LA":{"text":"Made a polish change appointment 2 days before my wedding day. I arrived early for the app","useful":2,"cool":0},"7SkHd7m_NnXF9O5MR3Mdow":{"text":"Andy. He knows what he's doing. Be prepared to be fully relaxed. So fortunate to have come","useful":1,"cool":1},"unxsD91KH2gl1JPUb0KRaQ":{"text":"Bridgette was at the front desk and was the sweetest. My friend and I walked all over look","useful":2,"cool":2},"DGXJI0Erfw5xmAdoLzkPpA":{"text":"I got a facial called at 10:00 am on a Saturday and they were able to take me the same day","useful":0,"cool":0},"tK21MR3lbmITRkqLBYyoxg":{"text":"The spa itself is beautiful and the workers there are super friendly.  Southern hospitalit","useful":0,"cool":0},"tBpbxKAi3qrmELoeUbRxRA":{"text":"This spa I visit annually when in New Orleans on business. I had a body polish scrub and d","useful":3,"cool":0},"2eLvIaarTZ_8Nq-kYmvWGg":{"text":"I booked a last minute online request for a Brazilian after they were closed. I was worrie","useful":6,"cool":2},"2oXOceqmr6jsSYG-YXTO5A":{"text":"I'm a picky massage receiver, but the massage I got from Amy at Spa Aria was truly fantast","useful":0,"cool":0},"JUHruG1lffXUUnP1FsK81w":{"text":"I came in right before memorial day for an eyebrow wax and had a great experience! They we","useful":0,"cool":0},"2ZyzqE-bf4w8De6i7a6Y8A":{"text":"This place is relaxing! As soon as you walk in the door the fresh smells in the air will c","useful":1,"cool":1},"n9wvjJ3oWgemA8MjE89jfA":{"text":"After a long flight, my wife and I were drained and looking for a nice place to recover.  ","useful":0,"cool":0},"s20EuewgjK9hk1cA_-8WKg":{"text":"My significant other and I arrived for service and the host welcomed us appropriately.  We","useful":0,"cool":0},"6dRcwpNkXS4lRrqXeVWcUg":{"text":"The whole experience was wonderful!! The staff were friendly and welcoming, my pedicure wa","useful":3,"cool":1},"AvJ_JHG2m3GqNJ1b1VOfKw":{"text":"Great location wonderful masseuse. If you get a chance to visit, try out massage therapist","useful":0,"cool":1},"qCWoEkEkK5pPy_tdDQ5E0w":{"text":"My friend and I enjoyed our first spa day here and it was AMAZING! We had sugar scrubs, Sw","useful":0,"cool":1},"ggHiZAvM5zq5P94pzjP2bA":{"text":"Nicole was the best! She took care of me the second I walked in. Offering polish options, ","useful":0,"cool":0},"akwGy4TaLlQ8G4QQz4bQcw":{"text":"Went to Spa Aria for the 85-90 min intensive massage after working a convention booth for ","useful":0,"cool":0},"1XphumZHH10WYv2sggh2VA":{"text":"I came for a bachelorette party weekend.  I loved every second, from the champagne to the ","useful":1,"cool":0},"k32QgfUCUVNKJQ_MNjymKw":{"text":"I go to ALOT of salon and spas and Spa Aria ranks at the top. I booked the \"Full Monty\" wh","useful":0,"cool":1},"xNkoVLItL5YqJBhffmTGZw":{"text":"if you need a bikini wax, go to Brittany!  she's the absolute best -- I got a brazilian an","useful":1,"cool":0},"mtwYZBk6gSthejykmKH8gQ":{"text":"A special, heart felt thanks to Ted at Spa Aria for helping me heal back pain.  While visi","useful":0,"cool":0},"-7typyb0_Y6FOCBV5_5VmQ":{"text":"My dad offered to take me shopping in the French Quarter for my birthday so I took it upon","useful":3,"cool":3},"T6zfUY_YbGdXOwiU5i_jCA":{"text":"Woman at the front asked if I needed to use the bathroom for my massage, she pointed me in","useful":3,"cool":0},"bd0ciRMJslt_gFKdnOXzTg":{"text":"I've been getting waxed here for 5 years. Natalia is superb but I won't be coming anymore ","useful":2,"cool":0},"6KkAOKQDHAXSV3a9in_aaA":{"text":"The massage itself was fantastic! I loved every last second and left in a daze. I had Amy ","useful":0,"cool":0},"ZfRXzZofdOPnWbuqnWjfYw":{"text":"Ambiance and staff and facilities : 5 Stars\nShellac Manicure : 2 Stars\n\nBeautiful place! S","useful":3,"cool":0},"lUU2EUOJkyg_XN991qRB0w":{"text":"Came in for a 1 hr massage.  I could tell my masseuse was very experienced and knew just h","useful":1,"cool":1},"d8EL_rw9QksZ2453whrFGw":{"text":"Five stars for amazing customer service. I unfortunately had a manicure that did not last ","useful":0,"cool":0},"OSHOxisgG0iw5wQ6BLVyVQ":{"text":"I wanted to do something special for my girlfriend for her birthday. I'm not really a \"spa","useful":1,"cool":0},"SAuqFvECo6Xy8uj6qv1lAA":{"text":"We had a 90 minute massage for $145.  I had Richard who was really good.  Downside is that","useful":1,"cool":0},"8cnySNVxhjZyZgKoV4zOvw":{"text":"Best massage of my life. Period. Ask for Brigette and get the 90 min massage!! She was ver","useful":0,"cool":1},"UZCi3guakpL4NxElXJsJIg":{"text":"This cozy spa located on the second floor of the stunning Hotel Monteleone is just perfect","useful":1,"cool":0},"zJ3hjI1idhFFIOmAZwxKxw":{"text":"This place is amazing...I just wish I would've found out about it sooner!  i did my bridal","useful":1,"cool":1},"r3O5lLzFp4GmonkjcnYmLw":{"text":"Millie did my mani/pedi - and it was hands down the BEST I have received. Her attention to","useful":1,"cool":0},"CbU7OIegI0YFAPsYILKhOw":{"text":"Seriously disappointing. My fiancé and I got into NOLA for a relaxing romantic weekend. We","useful":4,"cool":0},"-xYDbfWNujaZqbuqviCNlQ":{"text":"Did a last minute booking for Lundi Gras.  Had the best, relaxing massage and pedicure.  D","useful":0,"cool":0},"1HelfY8vwretrZqdifSp_Q":{"text":"If you need a quick facial to help your skin de-stress from travel, then go here and get t","useful":0,"cool":0},"Yarj0EjXfi7ObIzb_FxFPA":{"text":"A friend and I met in New Orleans from opposite U.S. coasts.  We found Spa Aria on yelp an","useful":0,"cool":0},"PFhFHE_rJKmJXk5Qm4Wo3A":{"text":"Best massage I ever had. Request Jamal, he's terrific! Small spa but massage is totally wo","useful":0,"cool":0},"NuIlcaucQEj3C5eSC2l7Jg":{"text":"Had a great, relaxing facial!  The staff was really accommodating for my last minute appoi","useful":2,"cool":0},"18XmKhmg5zoquCch8MfNaw":{"text":"I came here with my boyfriend for a surprise spa day for our anniversary. I usually like a","useful":0,"cool":0},"9vHrhJ6nOw3A_XUh_W2kbg":{"text":"This spa has a nice, relaxing atmosphere and is on the second floor of a very pretty, hist","useful":0,"cool":0},"y-xU0PUlBubj5W70bUsACg":{"text":"We had the best experience at spa Aria!! Messages were great!!  Not only did I get a fabul","useful":0,"cool":0},"r5UEMJqgjjcT1d7-ET_Fpg":{"text":"I had won a raffle on Facebook and got a Gift card to Spa Aria! The full package, 1hr mass","useful":0,"cool":0},"cHIFzxC_Lz9MwSOIRIDE_Q":{"text":"I visited New Orleans recently and asked our conierege for a clean, relaxing spa. He recom","useful":0,"cool":0},"PdoAMQoGM3rUcY_PHPxezQ":{"text":"We were taken care of from our first steps into Spa Aria, until our last steps of escaping","useful":1,"cool":0},"cfWX5ydVlgPFzonwrIIWiw":{"text":"I was in town for a week on business and had a day where I could not leave downtown due to","useful":2,"cool":0},"KU1X51GRE1F3sNCgurGd0A":{"text":"This is my go-to spa in the French Quarter! Staff is amazing! I have been coming here for ","useful":0,"cool":0},"G6TXvswFt_ubUAaWjhQjqg":{"text":"Just finished an amazing massage with Crystal. Staff is great. Would definitely recommend ","useful":0,"cool":2},"2Xb7s8Iz84eKaE6PxUUl_Q":{"text":"I got my nails done here while on vacation. The spa was able to book me for the same day. ","useful":0,"cool":0},"DKz3JilchRgG-lH4tcpggQ":{"text":"Nice spa located in one of the oldest luxury hotels in NOLA.  Good atmosphere.  Bathroom s","useful":1,"cool":0},"slYm9dmTTqHa4JV36SybCA":{"text":"After a few long days walking around the French Quarter there is really no better way than","useful":0,"cool":0},"k1MGW15pj8kbOpwaT7xJYQ":{"text":"This place has gone way down hill since last time I was there. The pedicure chairs were br","useful":2,"cool":0},"f0W_rIQbpTHCycGqeE_5Cg":{"text":"If you are visiting New Orleans and need a spa treatment, this place is definitely a great","useful":0,"cool":0},"XbzTODBrXvx5groTbecnAg":{"text":"Spa Aria is by far the best spa in the French Quarter! The Bio Nutrition Age Support facia","useful":0,"cool":0},"GrVL_QXvBuM70GyTEfwFZQ":{"text":"Today was a wonderful day of relaxation.  We enjoyed the Honeymoon Retreat.  My massage wa","useful":0,"cool":0},"IDSP_M4eZEMdaYfSJsp-0A":{"text":"My husband and I booked a couple's massage and facial for our honeymoon weeks in advance. ","useful":0,"cool":0},"I0J3hvx0dv_wkVZ5LKox4w":{"text":"Spa Aria was wonderful! After being in New Orleans for a wedding and being in high heels f","useful":0,"cool":0},"4zbPRNoFRL3GBftjIgycVw":{"text":"The only thing I didn't like about our couples massage was that after we put on our robes,","useful":0,"cool":0},"8zQEIlR3cO46kaAauMIeHw":{"text":"Very rushed experience. As I booked a bridal party of 6. I was told through email we would","useful":0,"cool":0},"WvD7spV6FRT7yf8sfuKxgw":{"text":"A FOREBODING OMEN: CREEPY SPA SHOES\nThe second thing I absolutely knew when planning my 5-","useful":3,"cool":2},"p0tlMvi8ehGjaT2JUVh_Kw":{"text":"I'd like to say it was an amazing massage but it wasn't. I was specific in what I wanted (","useful":13,"cool":8},"3U-fH6jjCygkl4pPQGejlg":{"text":"If you read any other of my post about spas then you know that I try to have somethings pr","useful":1,"cool":0},"DZVhhbtMeb3TjoT7iUAgdg":{"text":"Booked a couple's massage on Ash Wednesday to de-stress from the Mardi Gras madness.  Ther","useful":2,"cool":1},"KH-uYINY-1zuw7dRq_GCcQ":{"text":"Spa Aria has to be the best well kept secret in the French Quarter. I booked a last minute","useful":0,"cool":0},"Qjef95Ciu8Gtklcbxj481Q":{"text":"Ahhhhh It's always a good day when you can start it off at a spa.  It was the day after ou","useful":7,"cool":4}}