{"e0mIg58ueXGPQmFIfxnvvA":{"text":"I came in for breakfast today. \n\nA solid breakfast option uptown in a cozy dining area (ou","useful":0,"cool":0},"eYm6PmQsUpeRHTUXAog74A":{"text":"Great Yelp reviews and on Dinners, Drive-ins and Dives. Had to try it out. Decided on thei","useful":0,"cool":0},"iuRqYxVWsGqgoN-YiWEnGg":{"text":"This place was as good as it gets. Worth the trip for breakfast regardless of where you ar","useful":0,"cool":0},"6l7vh3nq_jKfRLYHt1rAHw":{"text":"They make their own fresh juices which you can blend to make your own creation. I had the ","useful":0,"cool":0},"i67q0YB_AgVrQ5E8katwpA":{"text":"Great breakfast place. The breakfast burrito hit the spot, as did the stuffed french toast","useful":0,"cool":0},"MWhd5elK9QXu85eqLOAs7Q":{"text":"We love this place as a special treat for breakfast. I always get the banana pancakes but ","useful":0,"cool":0},"a_g6wBryXJH9YGiMr1cRxg":{"text":"The hostess was unbelievably RUDE!!! She seems to choose who is seated in an  order other ","useful":0,"cool":0},"8GrIyYTFxIOD508HvfuqmA":{"text":"Great location with outdoor seating under shade. The options are plentiful. The corned bee","useful":0,"cool":0},"TozR0RuLRUvxRfgTMlxz9A":{"text":"Amazing banana foster French toast! Would travel all the back from California to eat this!","useful":0,"cool":0},"NidVVF-qFGwQYzNAF3i2mQ":{"text":"Again, I would consider myself a foodie... I give Surrey's five stars because it truly ear","useful":0,"cool":0},"5CcR2ELs3YPIgneBy7xKGg":{"text":"Great food!! We went two days in a row because it was simple delicious food. The first day","useful":1,"cool":0},"3QveKXNJAISLAq1ND3_f_w":{"text":"Normally I have good food and service here, but today was pretty disappointing. The homefr","useful":0,"cool":0},"QCxfMFySnvvOA0rdBED1BQ":{"text":"Best breakfast we had in New Orleans. Great vegetarian and vegan options.","useful":1,"cool":0},"aKvPgUAZI2LBb-U-FC3jsg":{"text":"We enjoyed a late Sunday brunch here today. The food was amazing and the staff were extrem","useful":0,"cool":0},"-Ul47bPVS82_47Lg1RSfEg":{"text":"Great place for breakfast!  We had a party of eight so decided to get there when they open","useful":0,"cool":0},"va4CzAh6SExWwjrky3w8dw":{"text":"Came here on a whim and this is definitely one of my new favorite breakfast spots in the c","useful":0,"cool":0},"FtRjkey7Nhwdnk-WVy2rwA":{"text":"Surrey's fans who live Uptown will be pleased to know you no longer have to drive all the ","useful":0,"cool":0},"OJHphzvAH-CMrP7f3VOjPA":{"text":"They still don't take card or split checks, which is fine unless you have a group. Also, m","useful":0,"cool":0},"7AdPoopft0_uXgdI_h4d2Q":{"text":"I can't say enough good things about this place. It is my FAVORITE brunch place and I love","useful":1,"cool":0},"xwO14P4x_zqTtMx_cS0Psg":{"text":"Never have I ever had a negative experience at Surrey's. My roommate and I have been on a ","useful":1,"cool":1},"2c-sK2cAT1BRNcuh-lkglQ":{"text":"Stopped by for brunch with my sister and her fiancé. I had huevos rancheros deluxe. They w","useful":0,"cool":0},"7m9EgFSE7EmDmrEx0G3hyQ":{"text":"Went here for the first time a few days ago, and it was great stop. We heard so much about","useful":0,"cool":0},"Uu74oI7A_Zv4sHY46l5cTA":{"text":"Hands down one of the best meals I had in NOlA\nThe absolute best shrimp and grits and the ","useful":0,"cool":0},"MqeeHtL636PUNmwovx3bTg":{"text":"I was very skeptical about the grits and shrimp breakfast. But since I wanted to try a ver","useful":1,"cool":0},"bEB84zn-ITAMTuMlmdh0-w":{"text":"Went a few years back and there were roaches on the wall and one in my water cup. I wont b","useful":1,"cool":1},"NKSpBs-fg9-V6bhofz4OOQ":{"text":"Thank God I don't live near this place, I'd be obese. Had the shrimp and grits since every","useful":0,"cool":0},"Zqt5sYQJeC8oSEGtDn_onQ":{"text":"Delicious fresh mango, orange and pineapple juice. The fluffiest biscuits in NOLA. Their h","useful":1,"cool":1},"-PD-1siyqlMJsFBGljxIew":{"text":"I really like this place a lot - very good breakfasts, nothing terribly extravagant, but d","useful":0,"cool":0},"dFT3KhBL78LvsLcmXE4IJA":{"text":"I couldn't be more pleased with Surrey's.  Avocado pesto sandwich and tofu scramble were b","useful":1,"cool":0},"j1XMiCgG3ebBdJW4t2FFaQ":{"text":"All you really need are the shrimp and grits. Maybe two orders because that ish is so damn","useful":1,"cool":1},"KpA0uHefL368rBpgckOLLg":{"text":"Love the food! Hate the ambiance! A shame coz i like the food here. Such a turn off when m","useful":1,"cool":1},"_GtNtuzyC7VYei_xBOg4og":{"text":"I had friends from out of town and we were looking for a late brunch spot. By the time we ","useful":3,"cool":2},"A0z8ZI_1Vxbfb8mBsDV_wA":{"text":"Bananas foster french toast.  I'm not sure I need to say anything else, but I will! \n\nFoun","useful":1,"cool":1},"0IkKz2Y5yUZRY5C9_7kWxA":{"text":"What a great breakfast find.  Be warned that it's cash only but there is an ATM inside.  G","useful":0,"cool":0},"9GXe4JLuM3cjVnTnd3lHsA":{"text":"Banana Pecan Pacake definately worth a try! It is very big and is good for 3-4 parties to ","useful":0,"cool":0},"NKkImDDPoqujckVFULdvwA":{"text":"Figured it was a good sign that I tried at least two times before I finally made it to get","useful":1,"cool":0},"aMU1g_I_8wvNW5aJ6eH0Wg":{"text":"Decent breakfast. Banana pancake was HUGE!! I had the Montana plate, and the gravy was del","useful":0,"cool":0},"6H6CHcNpTMaLgr9QErC2zw":{"text":"We went here for Sunday brunch... The food was great, but the service was mediocre at best","useful":0,"cool":0},"gNY5UQsXVMAZ-uuJthZFQQ":{"text":"This was my first dining experience with Surrey's and it was awesome! The food was cooked ","useful":0,"cool":0},"Fdu6nNUsZQaoaJkRMUIjaQ":{"text":"I've been to the original Surrey's so when I saw there was one close to the area we were s","useful":2,"cool":0},"LrFCXqDhJfwXgvQ6ZstdyQ":{"text":"Oh my goodness! This is easily one of my top 5 favorite places to eat in NOLA now. The cra","useful":1,"cool":0},"hVJzqlyQsZEmcvCd_AhTuA":{"text":"OK any place that has a celebrity waiting list is alright in my books (I went with Polansk","useful":0,"cool":1},"6zB0yUvUDsUJ2T1HG_T-ng":{"text":"Walked a mile to grab breakfast on a Sunday morning around 8. After perusing the menu, I d","useful":0,"cool":0},"fd-1x2DKx4laooB3m7K5jA":{"text":"I'm always so disappointed when I come across a place with crazy good reviews and it just ","useful":1,"cool":1},"HfHy2fm_dQKO5-RxpJ1JCg":{"text":"My friend and I stopped by Surrey's on our way out of New Orleans, we were so happy we fou","useful":0,"cool":0},"gg4PprDe4q54RQgvWHzuMA":{"text":"Really really yummy breakfast. Biscuits and gravy were bomb and we could not stop eating t","useful":0,"cool":0},"e-EYkZNJ-cI6oJ3YXK0z9w":{"text":"most excellent as always.  I love this new location.  I like the fact you can sit outside,","useful":0,"cool":1},"gbmfRd3gTi1MP-uYb_Ernw":{"text":"Great eats! The shrimp and grits was outstanding and coffee is a lifesaver! Be sure to enj","useful":1,"cool":0},"mVrjwszUOVTftWJ6MsIhmw":{"text":"Food was good but my party of 3 waited a long time before getting a seat while parties of ","useful":0,"cool":0},"DEYp4-ua4aLy5W-FVnQYgQ":{"text":"Has a solid menu and generally attentive wait staff in a cool, funky atmosphere. Sitting o","useful":1,"cool":0},"U5x7O8kuvzjp5LTOS472JQ":{"text":"Banana pancake + peanut butter!! :)  It is huge and delicious!  Juice is yummy too.","useful":0,"cool":0},"hZHWtAzMqARVx4jmxDbIPA":{"text":"Great little breakfast spot, just make sure to come early! This place is a favorite amongs","useful":0,"cool":0},"MqOBy8kL3ktNk6mz2iB5mg":{"text":"This place is amazing! \nFast friendly service! \nOutside seating! \nAwesome food and hands d","useful":0,"cool":0},"khH3rEpaJ30UWegRY_wyrA":{"text":"Tried surrey's for lunch on feb 24. 45 min wait for 2 people to get a table. After orderin","useful":2,"cool":0},"wMEZzX3KBrdPKsm4n46JkA":{"text":"Dank: Also an expression frequently used by stoners and hippies for something of high qual","useful":0,"cool":0},"d7yKO52Y0idIRvovCFuewg":{"text":"Delicious food and great service! Would 100% recommend. Lots of locals here, but even if y","useful":0,"cool":0},"eJqbpvhuWbG6Xsh_dopNGQ":{"text":"I went here once while hanging out in New Orleans for the weekend and I remember thinking ","useful":0,"cool":0},"H5Fd-5SXeA0meo0sLtMaWg":{"text":"Best crab melt and shrimp and grits ! Fresh grapefruit juice is a must have ! Wild mushroo","useful":0,"cool":0},"DZm9VU-iM7cmCd8zxrczLQ":{"text":"One of the best places to get breakfast in Uptown. Come early because there is always a li","useful":0,"cool":0},"Ounly4qY7So_D1SSYMr_qw":{"text":"I went to eat at Surreys uptown today and over all a decent experience. It was a small but","useful":0,"cool":0},"Ya3gy0xVcsmuqC8yYRudrQ":{"text":"There's no way to describe our experience here without sounding snarky and negative, and I","useful":2,"cool":0},"ZhmOkOxPQ0LC-AMvdKG6rA":{"text":"Shrimp and Grits the BEST! Recommend you coming here when in New Orleans!  Worth the wait!","useful":0,"cool":0},"3k2XZXJGc6u-omdqeGVpQg":{"text":"The crab melt and potato salad are phenomenal!! I've been meaning to come check them out f","useful":1,"cool":0},"r5lKFF-GKi2B1LI08AKEgg":{"text":"My friends and I visited New Orleans for the weekend from Austin and were sent to Surrey's","useful":0,"cool":0},"JDvyFhuk69TPXrbDFjnB-Q":{"text":"I haven't been here in over a year, and I remember it being much better. I was seated quic","useful":1,"cool":0},"YXXCQJQSiLijBDcP4HkYVw":{"text":"AMAZING!!!!  The bananas foster French toast is the best.  I suggest ordering it as an app","useful":0,"cool":0},"ZhsPNGvoI0YkrwQqY1Dgxw":{"text":"Honestly, I wanted to love this place.  I meant to hit either of the locales last time but","useful":2,"cool":1},"AkEbBO_kZWx_xMwpE8XSXw":{"text":"I had the BBQ Shrimp & Grits and it was vey tasty. I do wish the portion was a bit larger ","useful":0,"cool":0},"NtO7U58eEdadVc1wzR6lIg":{"text":"Breakfast on the porch during labor day weekend! Nothing better! I had the croque madam an","useful":0,"cool":0},"zvTR1SUQ9L4LHjLfXf3ANQ":{"text":"Me and some friends visited New Orleans last May for the Jazz Fest and Surrey's was sugges","useful":0,"cool":0},"1gYPWDHXWiAOAZi_jxuO_w":{"text":"I decided to take my friends here during their visit this past weekend, and I sincerely re","useful":1,"cool":0},"M3hpsilYSdrsd-S7DIqaCA":{"text":"Surrey's in my most favorite breakfast spot in all of New Orleans. I even went here the mo","useful":1,"cool":1},"G13WtTnwLYT2IV-nd93etw":{"text":"This is my first time at Surreys. I must say this is the best brunch place I have ever bee","useful":0,"cool":0},"Y2XrIrokhthiteqOlvpIvA":{"text":"Everything about our breakfast was amazing! \n\nWe started out with juice. I ordered orange,","useful":2,"cool":1},"WkyMs8gMCao2I34Xg4vCAA":{"text":"OMG.  My favorite of my favorites, the shrimp & grits at Surrey's is truly amazing.   I wa","useful":0,"cool":0},"f1YVakgca4HLyC2MBUjc6Q":{"text":"After finding that one of the top rated brunch place downtown had a long wait we ventured ","useful":1,"cool":0},"7o0BaZ9TEohpD_kpErDX2g":{"text":"Umm...I'm not sure what other reviewers are used to but this place was not good.  First ti","useful":1,"cool":0},"mL2lOvBUcYqmbzyHBP0z3Q":{"text":"the best bacon and eggs in NOLA.  3 doors down from my house and im in heaven.\n\ngreat staf","useful":0,"cool":0},"fNTiF69PPUOFSeYkFeZKnQ":{"text":"Surrey's was a disappointment. My fiancé and I waited 20 mins for a table. Then sat for an","useful":0,"cool":0},"Je1Y6pGILDbZrmuFMLtqMA":{"text":"Love this place early in the morning. Everytime I go I get the Montana plate and I never c","useful":1,"cool":0},"10El9ns_8mw8HVHHBdIPTA":{"text":"This is my favorite place to have brunch when in New Orleans. The restaurant is not big bu","useful":0,"cool":0},"CsJ50m-4516YGOgvaYXqUQ":{"text":"This past week i was meeting up with a friend who was in town and used to live just off Ma","useful":0,"cool":0},"fw6U_VJAEJ8yYOxXNeNAOg":{"text":"Amazing food, funky vibe, all around great joint. Never had a bad meal here. Love their bo","useful":0,"cool":0},"VXtmyWunEmqEODLXvgN9bg":{"text":"I dined at the Surrey's down the street before this location, and I must say that I much p","useful":0,"cool":0},"iSHGUv6AMl32vOfZqQpfbw":{"text":"This place has the nicest waiters and the cutest building. It's located on magazine st, so","useful":1,"cool":1},"wgQMnxWkSZnU3jhLBrvQig":{"text":"My 1st time and it was okay. Not the best. Banana pancakes yuck! A little pricey if you as","useful":1,"cool":0},"tbBgxG5frujqp7pChWqhZg":{"text":"I wish I could give this 3.5 stars, honestly. It was  very tasty, I just think I'd want to","useful":0,"cool":0},"4tqqnYJ5jE3qB1brQ8M6CA":{"text":"Quaint little breakfast place. They don't serve alcohol here so if you're looking for a Bl","useful":0,"cool":0},"rbRVwOl173Z5cFP--NO27g":{"text":"Soo tasty!!! I had the biscuits and sausage gray ( my usually because I don't eat eggs) it","useful":0,"cool":0},"h-nQGHu1o5zXw-4lP20_Ug":{"text":"Solid shrimp and grits. If you are looking for good shrimp and grits in Nola, you will fin","useful":0,"cool":0},"e_ZhA35PhqeRFjuoe6ywSg":{"text":"I've read lots of great things about Surrey's, so was excited to have a meeting at the Upt","useful":8,"cool":4},"hP3-CFPyIj8ymebWYMwqoA":{"text":"Great for brunch. The banana pancake was HUGE but very delicious. Plus fresh squeezed sats","useful":2,"cool":1},"Wr1ZyCvJPyZbrMxKFgY01w":{"text":"Yum! Just delicious! We went for my moms birthday. Best shrimp & grits, great stuffed Fren","useful":0,"cool":0},"cbvO7ghCIG9_bXPl2cEk_Q":{"text":"Love this place. All the breakfast items are so tasty! Costa Rican, homemade granola, bisc","useful":1,"cool":0},"SAKdVRg2pTqzpMlSBVv0AA":{"text":"Surrey's was absolutely wonderful. Our meals were both great and prepared to perfection. T","useful":0,"cool":0},"puMKBO_3piPe6qIIkG8hvA":{"text":"I've been to the other magazine location and was hoping to get in at a decent time but the","useful":0,"cool":0},"EX7imsBjAPGYrquQRXDxPA":{"text":"I have to review Surrey's based off of the experience/customer service and not the food un","useful":7,"cool":2},"2IAPI5NWDACg1yX5Lm8-dA":{"text":"There are many delicious brunch places in New Orleans, but Surrey's just is the best. Frie","useful":2,"cool":1},"pUNfv43DvzHaBICKbh6eaw":{"text":"Great Breakfast. Every time I drive day this restaurant there is a line out the door, no m","useful":0,"cool":0},"kjr7bAA4i4OIuOzOl13FGw":{"text":"Amazing food. Big portions, inexpensive. Cute, charming place in a sweet area. Loved it!","useful":2,"cool":2},"mTMwC3wDZKQLgJzzRgM2bQ":{"text":"I'm way overdue on this compliment but - those chicken and waffles were PERFECTION though!","useful":0,"cool":0},"6S6k1lDWbe3CdQIDf9B4gQ":{"text":"The hubcap sized banana pancake with pecans was too good to explain. The French Toast look","useful":0,"cool":0},"Tb4DVaRgS4gESIcxMfhgdQ":{"text":"The Migas w/ chorizo, breakfast potatoes, and homemade buttermilk biscuit were fantastic. ","useful":1,"cool":0},"C_WsNlSHxc7zM11Unpzr7w":{"text":"Shrimp and grits and Banana Foster French toast w/fresh fresh squeezed orange, pear and gi","useful":0,"cool":1},"S6LmnAD41stj4aHUKGVDUQ":{"text":"Great place. Food was delicious. Wait staff was great. Ben did a great job. Love that they","useful":0,"cool":0},"Tdj_gJz2HvLyZxXbPQWKog":{"text":"3.5!\n\nWhat a yummy brunch spot! I'm always a little wary of places that are cash only...bu","useful":9,"cool":6},"hpVIA0lGP7TlfTjIHZ8EnA":{"text":"Breakfast at Surrey's was fantastic!  We were staying nearby and walked past the restauran","useful":1,"cool":0},"tc-GsW5g24M-u-LPG8TEsA":{"text":"GLOOOOOORIOUSSSSS!!  Only thing not awesome about this place is the wait.  But it's worth ","useful":1,"cool":0},"gq-qJU_Z7kNsEwuv6WR0mw":{"text":"Been here about 4 times...\n\nI love the Shrimp & Grits..It's literally bowl licking goodnes","useful":2,"cool":0},"izEtZLkeiAiVxwVK-jJgOw":{"text":"Took my mother here for Mother's Day present. I was greeted my the friendly host Reyan. La","useful":0,"cool":1},"5b06n-7xgjmCyP2XHecGeA":{"text":"This was my last meal during my trip to NOLA, and it was somewhat disappointing! I got the","useful":0,"cool":0},"KMln-iGYJdv3_-sB_YyVMw":{"text":"Best vegan breakfast platter ever! The flavors of the sautéed veggies are unbelievable. I ","useful":0,"cool":0},"WvWhPQDyAGnE-FSC_1vY4g":{"text":"This has been my favorite breakfast spot for years but I needed to say that the owners sho","useful":2,"cool":1},"SmHZ0BYc82cf8ZHRl-S1ag":{"text":"Waited an hour for a table on a Sunday morning which set my expectations very high.\nHad th","useful":4,"cool":0},"vJykIbKJIai4MzZXT2sbnQ":{"text":"When I pulled up here, words cannot describe the painful hangover I was experiencing. All ","useful":0,"cool":0},"LdFHz40KKR-V5_zk1YAcDA":{"text":"Alright, if you're looking for some awesome French Toast breakfast/brunch, let me break do","useful":1,"cool":0},"zs_X4xYWRz3mM6XUAdFGSg":{"text":"I have a new favorite and it's this place. I had the boudin and biscuit breakfast...SO GOO","useful":0,"cool":0},"68B2sHUmoXr2t3V4ilWCCg":{"text":"This is a cool looking neighborhood joint for breakfast.  It was pretty packed when I came","useful":0,"cool":0},"ZZK-ctF3FYU7kf2h2N9uCg":{"text":"Favorite brunch byob spot. We brought champagne and enjoy the incredible shrimp and grits ","useful":0,"cool":0},"Sw4FZlkwxrWxsSsb70Lj8Q":{"text":"I came here this past Tuesday for brunch. I ordered the Bananas Foster French toast- and i","useful":0,"cool":0},"vpilyMJZBXIFFubmfp8HGQ":{"text":"Adorable restaurant in an old house.  Service was awesome....very friendly staff from the ","useful":0,"cool":0},"DlRz73lVzEGFwJq6K83q0Q":{"text":"One of Uptown's best restaurants. Small party (2-4 people) friendly and the food is ALWAYS","useful":0,"cool":0},"Jpvips76tOSsaB61rL9K5A":{"text":"Hands down...the best brunch spot in the uptown area!!! I have been here many times and it","useful":2,"cool":1},"1hE-jpbo_qdU8GwNzAZSoA":{"text":"Dear Surrey's:\n\nI frequently stay at my parents apartment a block away and come join you f","useful":3,"cool":2},"2P9jrbwKRFQs04Xg_gwXqQ":{"text":"I wish I had better things to say. The grill cheese was hard as a rock. I had to send it b","useful":3,"cool":1},"al_0NqhcGDqXzG_dZZGVbQ":{"text":"Modest breakfast/brunch menu.  Had the banana pan cakes and the shrimp and grits.  Food wa","useful":0,"cool":0},"fOhnSqmO4XY5vSI8whVKSA":{"text":"For coffee in the morning they have a large that is barely the size of a medium at most pl","useful":4,"cool":1},"n9eztPE2NohCAtTFTCsjCg":{"text":"Once again, Brett kills it with the reviews. The French toast here is to die for. Also, th","useful":3,"cool":2},"lgz7EJtgHtBxY8Lm0qlIJQ":{"text":"We were seated right away. The person that seated us took our drink order. I ordered orang","useful":0,"cool":0},"DQPdEGvcF9yd23Qj6XdALw":{"text":"Are you a hipster?  Do you have brunch needs?  Apparently, this is your place.\n\nAfter fail","useful":6,"cool":3},"TszfxHvR9zV463yaesEGPw":{"text":"Rude hostess. If working at a busy place stresses her out so much, I don't know why she is","useful":2,"cool":0},"EijuGVYKbf7ohtHNCu1OtQ":{"text":"Shrimp and grits all the way. Cute hipster place. Expect to wait for service though.","useful":1,"cool":0},"U4nF3zxsqrL1Jty44h1yVA":{"text":"DO NOT UNDER ANY CIRCUMSTANCE EVER ARRIVE AT THIS PLACE WITH MORE THAN 2 PEOPLE IN YOUR PA","useful":8,"cool":1},"3UF8606ypRNhSc8Yfxuc5g":{"text":"Reasonable prices, laid back atmosphere, and very dank food.\n\nGot the shrimp and grits and","useful":2,"cool":1},"WfE631xlHMi3n8-SoloBzA":{"text":"Tasty breakfast place. In a neighborhood in a cool old New Orleans style house.  Pretty cr","useful":0,"cool":0},"5YNhQ-TOnNerS9sNuB6AaQ":{"text":"I really enjoy this Surrey's. The staff is great, the food is great and healthy, and every","useful":2,"cool":0},"7t9tFUI15bLUO8YVBmDDvA":{"text":"This is our first time here, my girlfriend and I, and the hostess greeted us by saying \"to","useful":0,"cool":0},"2KO2ksU4QNWDhUY_tT0E9A":{"text":"Surrey's is a restaurant in the neighborhood where I grew up. I loved where I grew up. You","useful":0,"cool":0},"-iobj2e4ud-xCjZEg3_T0w":{"text":"I swear they have the best shrimp & grits in the world. So delicious! Definitely recommend","useful":0,"cool":0},"piI52FbwmPrt9CJGqcMOAg":{"text":"It was our first time there. The food was delicious.  I had the shrimp and grits and crab ","useful":0,"cool":0},"-0JDNTu__GB4r6Vs9Q1haQ":{"text":"What happened to Surey's?  It's been a long time favorite of ours but now many things have","useful":0,"cool":0},"g2Kw3kkmDGn0LNz_In1j7Q":{"text":"Great ambiance, food and service. A wonderful brunch place. Hubby and I had the shrimp and","useful":0,"cool":0},"Ar8VKGYpXYFHGUSxt46DFA":{"text":"We loved having breakfast here. We both ordered the biscuits and gravy, boudin, ham, and h","useful":0,"cool":0},"RCQhExwX00cHaLDsUPdCCA":{"text":"So.... The host Nadine was amazing... And the wait was not long at all(probably because se","useful":0,"cool":1},"1G6CMZt3aqYqTyRy7dsf4Q":{"text":"The food is okay 3 stars but the service is terrible we walked up they told us we would ha","useful":0,"cool":0},"wRxfUrdgpZjrImp2NvnbGw":{"text":"Set in a cute little uptown house, it has a lot of charm.  I went for breakfast and they h","useful":1,"cool":0},"IcO8tXJ28S61STYYUHl9XQ":{"text":"Staying in an airbnb near here, walked up and had a great breakfast!  Excellent service, F","useful":0,"cool":0},"Z0_muur4W0RHBWXC10p0hA":{"text":"I've been here a few times for breakfast or brunch, weekends and weekday. I'm a sucker for","useful":0,"cool":0},"MqWluiPzlA6UhJ1g2jzOsA":{"text":"Get shrimp and grits. We sat outside because 60 degrees is warm to us and we did not want ","useful":0,"cool":0},"RD0LpgFJsMDdcKxGHizd1g":{"text":"Although this is not in the French quarter , this spot is where all the locals go and was ","useful":0,"cool":0},"Q09H4ajajcnCeZy-pPmRoQ":{"text":"Inexpensive, great food. A nice break from all the heavy southern food for this CA gal! :-","useful":0,"cool":0},"Q5nqKYTU0avH68DPh9z19Q":{"text":"If I had to muster up one word to describe Surrey's (which I've been to numerous times) I'","useful":0,"cool":0},"ppNtGm3WGjawUcU5rvpFrg":{"text":"Good food, but a little cleaning, paint.. Would do wonders!  Dirty is not \"charming\"!","useful":0,"cool":0},"q0oQikifdEIOlREKRO-94Q":{"text":"Today Shaun and I decided to shop for a local breakfast food crawl. After getting pampered","useful":1,"cool":1},"hSoom2jCiA-T27D9u8ZO5g":{"text":"Their homemade juice is to die for. I recommend going during the week, because it gets ver","useful":1,"cool":0},"rPnmgMJDphchb81MBjdsmg":{"text":"Food was great. Not so much for the service. Our food took so long to get to us. They don'","useful":0,"cool":0},"vSY9He61Z7fcODlEDEYrTw":{"text":"I had one of the best things I ever ate.\n\nIt makes me sad to realize it was only a special","useful":6,"cool":4},"D1w-uzJFxD7XlNXY-c7Sgg":{"text":"The bananas foster French toast is hands down the best breakfast I've ever had, and I don'","useful":2,"cool":0},"hzkO_CtFv4DrdJigc-X-wg":{"text":"I moved to NOLA from NYC, which many would argue is the brunch capital of the world. They ","useful":3,"cool":4},"VsAzpPc4eDA5U5hZPZkKRw":{"text":"The service was ok. The food - biscuits and gravy was ok, but the biscuits were not as don","useful":1,"cool":0},"0UuE7kn2SJOE8Q6FX0EcWw":{"text":"VEGAN FRIENDLY, IN NEW ORLEANS?! I went with a group of 7 for Sunday brunch. We were seate","useful":1,"cool":0},"mkFdXzrC7OI5cs6SAZ93Ow":{"text":"I've only been here once and thought it was just OK.  I don't see me going out of my way t","useful":3,"cool":1},"216kIglt35qDhK4zGi8V9A":{"text":"I was being a good daughter  and got up at 7 am on a Sunday so that I could take my mom he","useful":5,"cool":3},"0OVZarXWJb7mtLK0_OAepg":{"text":"Great find. Chicken, biscuit and sausage gravy, and grits were wonderful. Great suggestion","useful":0,"cool":0},"rKeKYi9vly53Kl7wVgqpcg":{"text":"I must say I preferred Surrey's Uptown to the original location, as it had more seating in","useful":3,"cool":1},"7jjm8uYM_75UcH_v3E7nQQ":{"text":"delicious vegan pain perdue (french toast).  and other vegan options too.","useful":2,"cool":0},"6Jff-6DKXxXNoN5Hv-AAOA":{"text":"OMG SURREY'S! Absolutely unreal. Went here while visiting NOLA on a local recommendation. ","useful":1,"cool":0},"MWCSfaJeLE8dPejYiKE0yA":{"text":"Surrey's is quickly becoming on of my favorite places in the city. I normally frequent the","useful":5,"cool":2},"1CtvIAGGvTWPoAn3m_D7SA":{"text":"Hands down, this is overall the best breakfast place in town. Can you go places with fanci","useful":1,"cool":0},"jw5x8pSZHeuo-2pSiB0-pw":{"text":"The best French toast I've ever had.  My husband had the boudain and biscuit breakfast whi","useful":0,"cool":0},"JLJySLKllnxWWVzOjBpgrA":{"text":"My order - French toast,omelette and coffee\n\nTaste - Excellent. It was the best french toa","useful":0,"cool":0},"EPZwPli5xBhiWN5yYk6l8g":{"text":"Surrey's in New Orleans on Magazine St. \nService was slow to begin with but sped up later ","useful":1,"cool":1},"3XiVAsMIdqONEvAGCK1Mjw":{"text":"Hands down favorite breakfast in NOLA. Before I moved away I ate here almost every weekend","useful":0,"cool":0},"bHCNCQ_icAEJzuKTRqgAgg":{"text":"If it were just for the grits I I'd this place five. Best grits ever tasted with no cheese","useful":1,"cool":0},"6jdJBR2lsTbwkSNrKJ3zlQ":{"text":"Love the staff, the ambiance and the food, but it's a little light on the portions compare","useful":1,"cool":1},"uh5jo_hxLzxvNLAWaPWvwA":{"text":"I always enjoy Surreys breakfast food. Once again I had an excellent breakfast. I was tryi","useful":0,"cool":0},"pkY3_vhT8mIU0oZ68jRyDg":{"text":"My favorite place for a great breakfast! Wonderful surroundings and great staff!Food is al","useful":1,"cool":1},"cBe84QBHFnnDCnvB_3vvWg":{"text":"Wonderful Sunday morning brunch!  Short wait to eat indoors on this hot day, but the wait ","useful":1,"cool":0},"SQ5nZee_B3OgGS7cYvFV-A":{"text":"DON'T FORGET TO BRING CASH. We totally did, but at least they don't overcharge too much on","useful":1,"cool":1},"e9j8f85thqT5xrjWqyoHaQ":{"text":"Good stuff, stopped here for breakfast on our way out of town. It's located in a great nei","useful":0,"cool":0},"5MlFR0I0Gx0Q2TsM1hC1cA":{"text":"Found this place on Yelp for somewhere to go in New Orleans. It totally met my expectation","useful":0,"cool":0},"AqHX5ROUVj89kHuafFiNiQ":{"text":"My favorite meal of the day is breakfast and I thoroughly enjoy exploring this cities many","useful":0,"cool":0},"08vjXjvyHzyWSAhplID94Q":{"text":"Can never go wrong in here! Read all the amazing reviews and so glad came to check it out ","useful":0,"cool":0},"Kn3l4iIbKp7r3Y2Y6FbGzg":{"text":"The wait was ridiculously long for brunch, but I guess to be fair it was Sunday on Mardi G","useful":0,"cool":0},"m43-TZGyQb2k3Id926cqeg":{"text":"Oh Surrey's Uptown...this is the most difficult review I have yet had to write. I'm just n","useful":7,"cool":2},"7dTx4r1nSsSPJV2PKVPe5A":{"text":"Love this place, great potatoes yum! Lots of vegetarian options. Juice is overpriced and t","useful":0,"cool":0},"COcCUh64ksncEsZEL0cBww":{"text":"Great space, great vibes, great food. The employees are super nice. Make sure to get the b","useful":1,"cool":0},"2Q3kR0XwKI1x8wc591exLw":{"text":"The lines here are often very long and hard to say whether it's worth it. I'm of two minds","useful":2,"cool":0},"d8PcWzGd64S6ZexkBNqpZg":{"text":"Amazing food and the staff are very friendly.  The banana pancake with peanut butter is th","useful":0,"cool":0},"efNIHHtsAjCqefYTkI7nXg":{"text":"I would ideally give this place 3.5 stars, but I liked the ambiance so I'm bumping it up a","useful":0,"cool":0},"FgQI82-8ALb5ybnm5MQS3A":{"text":"Great little quaint stop for breakfast! I had a simple eggs, bacon and potatoes for breakf","useful":1,"cool":1},"G5quAn4LJLRZNYago-eJEQ":{"text":"Surly hostess but very friendly waitress. Bagels are pretty darn good (and being a Miami g","useful":1,"cool":1},"ffApjSpOsJZLwtcvItBzpQ":{"text":"I ordered the surrey special (I think it's the name please don't quote me). It was delicio","useful":1,"cool":0},"mwmA_ulI8hVgUInMnlzd-Q":{"text":"i love surrey's. i first fell in love with the location in the garden district, but the up","useful":0,"cool":0},"Cm36Xg34YWoYtWwurmKxxA":{"text":"First off let me say breakfast is my favorite meal of the day. That being said, there isn'","useful":4,"cool":2},"Iym4IzUcNCiqz4POQx8naw":{"text":"service was amazing and I didn't know scrambled eggs could taste that good. and they actua","useful":0,"cool":0},"8OkBJ5cEz3Lb6h6MuFgFvw":{"text":"Nice brunch spot with outdoor seating.  Very charming as the restaurant is an old style ho","useful":1,"cool":0},"AfkzH_3eKwVaHEL7pSLybQ":{"text":"A great place to stop by for brunch. This place is popular and can fill up quick, so be aw","useful":0,"cool":0},"7pPxkkReZfH74sI6OJdftw":{"text":"Not impressed. \n1. Hard, dense biscuits\n2. Subpar potatoes, nothing special\n3. 6.00 O.J. ?","useful":3,"cool":0},"JZsFnyLYqkP3ak7fjVpY1g":{"text":"Love the food, but no reservations and long wait.  They did have a sense of humor about it","useful":0,"cool":0},"boDyYQPqWcR-Q15DrwXwvg":{"text":"Surrey's is a really cool place to get some quality breakfast.  Located in what looks like","useful":0,"cool":0},"dwrfKmGAxyYe_8SJ-GvIug":{"text":"Food was delicious. Ordered the veggie omelette with toast. It was very good. Family order","useful":2,"cool":0},"-cdU8nPRcob1A44-nqBLYA":{"text":"Highly recommend for a casual brunch with friends or family. Tasty and well priced food (t","useful":0,"cool":0},"yOGwPbRtiuGSn_99pxl4rw":{"text":"The food is great! The service is great! The atmosphere is great! My only issue is they do","useful":0,"cool":0},"Sx1fu7DVqWd1qNBEdnoklQ":{"text":"Fast service, multiple runners for drinks, food was incredibly satisfying. I would come he","useful":0,"cool":0},"5POlfis3x3aBcZNQ4sCZOg":{"text":"The food was absolutely divine. I'd checked them out on Yelp before visiting and saw a pic","useful":0,"cool":0},"TQ194B_NoUKTtNPJv9B44A":{"text":"Ill admit I have never gotten anything but the Migas and juice all ten times I have been t","useful":1,"cool":0},"Jci3au7ePlp867l0YzEQAw":{"text":"Ok so the staff and building we're great. I had a long walk there and I got a water and co","useful":4,"cool":4},"qI7pYwlDrNWPhMg4SrqT8Q":{"text":"Worth the wait! Food is amazing. LOVED the shrimp and grits and bananas foster drench toas","useful":1,"cool":0},"cxc8C_-bEFzZ0PeyC81KJg":{"text":"Breakfast this morning with the whole family. This is a fine place to take children, but i","useful":0,"cool":0},"qr5Ji6n9SiF6BGcgQiOqeQ":{"text":"Been a loyal Surrey's diner for several years now, and am so sad to have to write the foll","useful":2,"cool":0},"dqsJAyLxzwSevAekLNPaug":{"text":"This place is awesome! Fresh squeezed OJ was amazing! Service was awesome too! We had the ","useful":0,"cool":0},"L0sI6bJA-6G1Gry8FAyM9w":{"text":"Always a good breakfast spot, but come early if you don't want to wait on the weekends. De","useful":0,"cool":0},"dcBVigA8nI7vZHRzCndHkA":{"text":"Every Sunday I wake up craving Surrey's breakfast on a bagel, the refreshing juices and th","useful":2,"cool":0},"rHhnaOsXHfeg_sdDQn0MTw":{"text":"Amazing spot for breakfast! Location is wonderful as there is so much to see on magazine s","useful":0,"cool":0},"6yFVNfzdh1UgA11z1UlR2w":{"text":"Took the bus out here for vegan breakfast and we're not disappointed. Enjoyed the vegan pa","useful":1,"cool":0},"MHy9VtWPVD3TPm_gfDRPZw":{"text":"Came here specifically for the Shrimp & Grits and the Bananas Foster French Toast-- they w","useful":1,"cool":0},"oA40_EhbPPHVaatgUI07Pw":{"text":"This place iscALL RIGHT - it's slightly OVERRATED, still. To those wondering if I've been ","useful":0,"cool":0},"CvqIaO02w70hL0y_UHDZfw":{"text":"Sometimes people deserve the stink eye, like when you wedge yourself between two people in","useful":1,"cool":0},"R-XSba5qriF9RknZGloafQ":{"text":"Had the huevos ranchero. The mole was a unique take on that dish, but I loved it. Deliciou","useful":0,"cool":0},"O5VcZdj_GuSk7QcJqlodfw":{"text":"Eggs were cooked perfect, breakfast sausage was delicious and fresh, bacon thick and also ","useful":1,"cool":1},"tLgnqS3mCHLjZcHDeS3LuA":{"text":"Wow! I've wanted to go here for a long time and if I knew it was so good,  I would have be","useful":0,"cool":0},"weJGyuqHjUuHFQ9aAiGUyQ":{"text":"Tried the crab meat omelette and it was delicious! The omelette was filled with avocado an","useful":0,"cool":0},"O9152fuK2YfSr7L6RyvEAg":{"text":"Great place for brunch. They have a few delicious vegan options. I got the Costa Rican wit","useful":0,"cool":0},"qGeLqkBkmCRYG0-2NnfA9w":{"text":"Had a long wait and they never called us like they were supposed to. Wanted to order the b","useful":1,"cool":0},"4R844PEP1e7S_AVajeCFvw":{"text":"Sandwich was supposed to be like a grilled cheese but the inside was cold and the cheese w","useful":0,"cool":0},"6fa1TOAnFQ4U_j6_q39pIQ":{"text":"I was in town for business meetings staying in French Quarter. I met a friend who just mov","useful":0,"cool":0},"4iQB93yWQOzsbWTssQt9-Q":{"text":"We decided to try this place as it always pops up in conversations with friends and every ","useful":1,"cool":0},"lRRSn4UsBjYEq5OVH3ehxQ":{"text":"This place has a very New Orleans feel to it the food was amazing and the fresh apple juic","useful":0,"cool":0},"nnP4HaBy4DQ88tI0eoHy2w":{"text":"Surrey's offers a bunch of options:\n\noutdoor dining\npets w/outdoor dining\nvegan \nvegetaria","useful":5,"cool":2},"psMVYa5piACcK5fgIm9bng":{"text":"On cold days, wear a coat - the waiting line is outdoors. Good coffee (I'm a snob). Wait s","useful":1,"cool":1},"KAjBBZZiW5DG61Gf5YQ4LA":{"text":"Soooooo tasty! I had to come back twice in one weekend. I had the shrimp and grits along w","useful":0,"cool":0},"PxLQCGoVNS3v5CsbacNNWw":{"text":"Got the migas, good stuff. Yum to the face. Bread is wonderful. \n\nDon't come here with a b","useful":1,"cool":0},"YIUIM6svDU5etgw9hg7PGg":{"text":"We've visited several times after having given up on the long waits at the original Surrey","useful":0,"cool":1},"iE2TjfF-YN34DIA0YxoZ1Q":{"text":"Love love love this place.  We had been to the other Surrey's and decided to see if this p","useful":3,"cool":0},"ZuhJEJ0X1MRmoiHYhZydlQ":{"text":"I've been here both times I've visited NOLA and it was delicious each time! The fresh sque","useful":0,"cool":0},"H7lZfvVGOWYLZsUZaM_kmA":{"text":"Oh my God hands-down this is the best french toast I've ever had in my life. There was Abo","useful":1,"cool":1},"XfqpimQEtWNqhGIwWU6K0Q":{"text":"This place was a godsend on the trip. Breakfast here was something to look forward to. At ","useful":0,"cool":1},"nJBIL2XVtfFTMVcaLAPREg":{"text":"great breakfast place, had the king cake pancakes for Mardi Gras, yum! Shrimp and grits ar","useful":0,"cool":0},"p-5ZEpBKtMj3Rt60ZaWqDQ":{"text":"\"Had the fruit oatmeal and banana foster French toast: Delicious! The service was great an","useful":0,"cool":0},"vI08VI_BoxFQxKcrrMcxtg":{"text":"This seems to be the place to come for breakfast in this neighborhood.  I loved the menu a","useful":2,"cool":0},"E98eW8mnsifWvPq6RucdRw":{"text":"Yay! It was open on Memorial Day!  We had breakfast about 10 AM - sat outside on the front","useful":0,"cool":0},"nXnd-utanzdI5S3W2wa1lw":{"text":"They have a fantastic breakfast . Wait staff is attentive and the food comes out very quic","useful":0,"cool":0},"V_MQiFOfyFLPUqfMdHPzYA":{"text":"This place is an Uptown staple. It is the place to be for breakfast and lunch. There is us","useful":2,"cool":2},"y7sZg4T542rSrzcJDj3UqQ":{"text":"Awesome crab omelet and boudin biscuits... best breakfast/brunch in New Orleans.  Also, tr","useful":1,"cool":1},"L32LObOvh9RVz6Mno11fuA":{"text":"This is my second time at Surreys and just as yummy as the first time two years ago. We ar","useful":1,"cool":0},"TOh6WB8MhkjtEcYAHe2RCQ":{"text":"This has become one of my favorite brunch spots in such a short time! Their food is always","useful":1,"cool":1},"wDmp9PAz-4317QSb4nlpxw":{"text":"I've eaten at this and the other Surrey's a number of times, and have been consistently di","useful":5,"cool":0},"wOrGSGNyuMoixzgqbP2fGA":{"text":"Today was my first time to Surrey's Uptown and the combination of a short wait, great weat","useful":0,"cool":0},"h6hmoOZluf1a8HCA8tae0g":{"text":"This place is very cute and small, good for taking a small group of friends of about 3-4 p","useful":0,"cool":0},"BYbM67-7z8IjqUYwxq2C6A":{"text":"This location is a difference from the midtown.  I love the midtown location but not if it","useful":2,"cool":1},"qeVMopJdbeX8s_3vvmeVqw":{"text":"I'm a west coast gal and up until my recent visit to New Orleans, I had never really exper","useful":9,"cool":5},"a4BcZN35tqdTO3q-y0vxGA":{"text":"Amazing!!! I got the crab melt and I can honestly say it's the best I've ever had. The ban","useful":0,"cool":0},"XWIQVcaVsjQAuvK0Kh2Z9Q":{"text":"I've eaten at Surrey's for years. Always loved the banana pb pancakes. I went on June 16th","useful":6,"cool":0},"go4onNPfivzPE6Yl3cF6Mw":{"text":"Love Surrey's! Went here for a birthday breakfast today and couldn't be happier with what ","useful":0,"cool":0},"zKFkgoBrbOXLTFqhrC09iw":{"text":"Fabulous bananas foster french toast. The homemade bagel was also great, although I wouldn","useful":0,"cool":0},"R-FxMEEZDpNPjOfM7cmYpA":{"text":"Okay, trust me. I've been to quite a few. Recently, I went to another place that was liste","useful":1,"cool":0},"I64XwyALG6TxXZuURIO_ng":{"text":"Hands down our favourite place to eat when we visit New Orleans.  Haven't missed an opport","useful":1,"cool":0},"C6wBFRTMLv7Sk6Xd_myvmQ":{"text":"This place iscALL RIGHT - it's just slightly OVERRATED. (To those wondering if I've been t","useful":2,"cool":0},"Cod0QVVxmW7Cd1sZdZ7PoQ":{"text":"Surrey's has been a favorite healthy alternative to the junk comfort food New Orleans is k","useful":0,"cool":0},"1Fl-FXTlj5_vByQ2XzHgfQ":{"text":"Hello yelp world. First time reviewer here. I went here this morning but honnestly I was s","useful":2,"cool":2},"_6U9T1Po_HE50K5tXChDSg":{"text":"Cute little brunch spot...emphasis on the little.  Definitely limited seating in this smal","useful":1,"cool":0},"LIDNOghS656t69SbDMny0A":{"text":"This place is fantastic. Came for a breakfast on a trip down in New Orleans. Mark and zack","useful":1,"cool":0},"44A4Ik-b33xqJ2wWYFqZag":{"text":"Good food but young tatooed waitresses make older people uneasy. Hardly even smile. Hate i","useful":0,"cool":0},"yd3M1WH4QSHrR9Fea75OOA":{"text":"Amazing, wonderful brunch place :) The only drawbacks were the extremely long wait (40 min","useful":2,"cool":0},"-GG2Ys3-Ht0UibTpmB-dhA":{"text":"Best meal we had in NOLA this trip hands down. \n\nI had the fantastic hash with corned beef","useful":1,"cool":1},"AoIXdfPgwgSpKhsyDvQBSg":{"text":"Of the two Surrey's in town, this is my less favorite one. There's something different abo","useful":4,"cool":1},"iuChKOmWsP7lo4lYsK6_kw":{"text":"Very good! Popular but rightfully so. They have the fine art of breakfast down to a scienc","useful":0,"cool":0},"sRlTuDR4bnyGuy_HLGL_fQ":{"text":"The food here was awesome and the servers were super friendly! Our waiter even offered to ","useful":0,"cool":0},"w83Q219t9-71nVjOKr_n0A":{"text":"So it's been a couple of years since I was at the Surrey's Uptown location while in NOLA. ","useful":0,"cool":0},"HSUryYiC-qrp_uuHTLM-iA":{"text":"The wife and I walked 3miles from our Hotel to tease the  talk of the town! It was well wo","useful":0,"cool":0},"ShXlh-EL8QjDChTI8FO3JQ":{"text":"Let me start out by saying there is a ton of great food in NOLA, so it is incredibly hard ","useful":0,"cool":0},"VyfYkoKH342tJcYaasu0cQ":{"text":"Shrimp  N' Grits at its finest at another of New Orleans great hole in the wall eateries. ","useful":1,"cool":0},"CYxurFTjo8YmaRYdpAajbA":{"text":"Great little spot! wonderful food!! The area has great character.  we all enjoyed it. Stre","useful":0,"cool":0},"aAdnsqGgFou58Hr2WwXv2w":{"text":"Excellent New Orleans food at a gourmet level. We were going to eat breakfast somewhere el","useful":0,"cool":0},"vgMtzPAVHfYZAe4Kh9FU8w":{"text":"I live right across the street from Surreys Uptown and find myself grabbing breakfast here","useful":2,"cool":0},"Djfv2dEDr3-g3FiQwdvrug":{"text":"Our best meal in New Orleans! We arrived around 11:00 and were seated immediately outdoors","useful":1,"cool":1},"ggcGVtSH7XSMMfss_Iewwg":{"text":"great food, great waitress tatoos, a little drafty when it's chilly out.  Good coffee main","useful":1,"cool":1},"tceoSK2LBbTSXqxU2QIibQ":{"text":"Heard good things about this brunch so me and my two friends decided to check it out. Was ","useful":0,"cool":0},"mQfVVKou5MteqrymmbE_6g":{"text":"Awesome breakfast/lunch spot with great food options, friendly staff, and affordable price","useful":0,"cool":0},"53yukdJeq-T5pTaXTHHIWw":{"text":"This is a top brunch place in NOLA. I got the Costa Rican breakfast with scrambled eggs. A","useful":1,"cool":0},"Yu9wUVKvFFEFzbpC__yPcA":{"text":"Well, the wife and I rented a VRBO very close by Surrey's Updown...  Absolutely LOVE this ","useful":0,"cool":0},"yzCpddhxW5mqpYMKZMUjZA":{"text":"After driving around for a good half hour, the bestie and I stumbled across the uptown loc","useful":2,"cool":1},"Pr1uAAjFWzQDYlCBDDBmKQ":{"text":"Had a delicious breakfast here. Eggs with salmon, cream cheese & capers, homemade biscuits","useful":0,"cool":0},"LXnzwjsEG3d6maXzQGyMHg":{"text":"Enjoying a late brunch out on a porch in December? Pinch me, cuz surely I'm dreaming. Than","useful":16,"cool":11},"48xgmMISMWClsDRITTXmBw":{"text":"Since I usually go to the *other* Surrey's and it's usually packed, I decided to check thi","useful":10,"cool":9},"y7jVoM6n3vkKTAd7nLg2ow":{"text":"I normally love Surreys but today was an exception. I had to ask the server to place my or","useful":0,"cool":0},"YkoqEdSY54YTLFUCESm4Ow":{"text":"My first New Orleans breakfast after a night on the town and I must say, they really know ","useful":0,"cool":0},"NVyvsOCoqd2Nil6Ob9ZoGQ":{"text":"Very good! Make sure you have cash. They don't accept cards.","useful":1,"cool":0},"9crgYsPx02GisaKHKKN15w":{"text":"Price was not too bad. The house is super adorable and quaint. I enjoy that very much. Vis","useful":0,"cool":0},"Aep1Xb7V1bfQ_ddzjbYoxA":{"text":"I always enjoy eating at Surrey's. On the positive side: they have their full menu all day","useful":0,"cool":0},"vi4Bw4a16eRfqOB6cA15Pw":{"text":"What I like about this place is that you can get many things that are not on usual breakfa","useful":1,"cool":1},"iLuhz0QdUWf-i0boPP4F0g":{"text":"Very chill yet fast service. We went on a weekday afternoon at 1:30 and there was no wait ","useful":0,"cool":0},"pS9nL3Q2SfuQFiU6_G0ezw":{"text":"My friend and I were driving around on Sunday looking for a brunch spot while trying to wa","useful":1,"cool":0},"k-FAGNO-oumIA3rRZvGlbw":{"text":"My food was close to cold by the time the waiter came with it.  I was so hungry I just ate","useful":0,"cool":0},"r8q0pb9Arh5maZsoS_nxOw":{"text":"Great juices can be found here. The hostess was crabby but our lovely waitress Sharon was ","useful":0,"cool":0},"dAcqWiVAyBWE5e4z3BVHfg":{"text":"It seems that you can go anywhere in New Orleans to find bad tacos, but at Surrey's they d","useful":0,"cool":0},"Grj8DBSEf0EYg_2Vbxfx6g":{"text":"YUM!!  The hour wait was... yeah, worth it.  Biscuits and gravy with fried chicken and che","useful":2,"cool":1},"7wGp_KRnDDw4G1YzHiR-OA":{"text":"Service was good. Food not so much. I ordered the banana pancake and it was bland and doug","useful":1,"cool":0},"jpfXAcsl45cni2nXy7A3Gw":{"text":"I've never had anything that I didn't like here, but I've never been blown away.  I alread","useful":0,"cool":0},"uyr3DDTkauvzpPbHQTyJPA":{"text":"I love coming here for coffee or juice or brunch, or all three. It's a tiny little space i","useful":2,"cool":3},"mOcaIcuZWc_G4dKeSRWjmw":{"text":"My Surrey's experience was not up to par with the rest of the breakfast places I frequent.","useful":5,"cool":4},"J1tdDe3ENTEcRCQUUONYYw":{"text":"Great food in a great location!  If you want to feel the NOLA vibe, be sure to visit here!","useful":2,"cool":0},"PEBi-xuoyOWvh5IZdUMy3w":{"text":"A group of my girlfriends took me out for my birthday brunch here and I had a great experi","useful":1,"cool":0},"idwlboRhQmceybdcTHVJKg":{"text":"Such a fun place! Great service, great food, great atmosphere! The banana foster French to","useful":0,"cool":0},"umzC1DuQY75mNdU9JiXiBg":{"text":"I'm giving Surrey's Uptown 3 stars because I think the new location is working out some ki","useful":0,"cool":0},"W8xhNwB4YoXEwfpLA68vGg":{"text":"Food was great! I had the Crab Melt with Home fries and my sister had the Migas with Home ","useful":0,"cool":0},"jXWfStutWO3zn_xyz1w5ZA":{"text":"Unbelievably good. Not as popular as the other location but that's great for me because it","useful":0,"cool":0},"vjTWzxQVkm018xGvs7iTGg":{"text":"Delicious food and good service in a place with a cool vibe. We will definitely be back to","useful":0,"cool":0},"KIZ-4sOZA_eJG_PMwXpELw":{"text":"THE BEST FOOD !!!! Try the Puerto Rican breakfast . The service is so good everyone is so ","useful":0,"cool":0},"-OYB_OF181B7iZLe8Roimw":{"text":"Came here starving when we arrived to Nola.\n\nSuper welcoming, cozy menu, and gut-loving ea","useful":0,"cool":0},"NqFPwCWmdybWW94C_IQDVA":{"text":"Shrimp and grits were delicious. Grits were the right consistency, and it was served with ","useful":1,"cool":0},"mb1xci5e9yve8mfHzZpm1Q":{"text":"Half hour wait on a Sunday moanin'...\n\nNot a big deal; walk next door to Le Bon Temps Roul","useful":2,"cool":1},"W4_oCf5fPhz44ed2GZAUcw":{"text":"Such a great brunch spot. Order the French toast--if you don't you might regret it! The sa","useful":0,"cool":0},"b0JCojwA7TRsmg9r-c_mNg":{"text":"Oh why did I discover this place?! I'm in love with their food  It's always cheat meal day","useful":1,"cool":0},"VOIocRTXOZMIMq0ucDcPDw":{"text":"Surrey's does not disappoint. Having eaten at their other location several times, I've alw","useful":1,"cool":0},"G2T6FitwpJmAFhcBhAMhCQ":{"text":"Love this place! Always a good meal and great local spot! I love coming here on a regular ","useful":0,"cool":0},"pW564KPdSP5qKAjkulPWsQ":{"text":"Es mi restaurante para desayunar preferido, siempre que regreso disfruto de su comida, tie","useful":0,"cool":0},"CLyglw7bQ-LyEUT_c2EWmQ":{"text":"GET THERE EARLY!\n\nUnless you want an hour + wait I recommend getting there before 11 AM.  ","useful":0,"cool":1},"8_o4Q44nj9iAKj6vYV6qwg":{"text":"Bananas Foster French Toast. Holy sh*t.\n\nThe atmosphere here is fantastic.  Limited space ","useful":0,"cool":0},"WumZJIiRriFwHNB_TfbE6A":{"text":"Local here.  Won't be back, especially with all of my other options in the city.  I had a ","useful":0,"cool":0},"T5XZrF0Uch9wiPOd-yilvA":{"text":"Surrey's has been a longtime love of mine when I first discovered the \"lil Surrey's\" on Ma","useful":3,"cool":2},"bms16dejwB4VO0hxIhi17A":{"text":"I'm only giving a four because there was this rushed, short (not as in height but in tempe","useful":2,"cool":1},"nUPK-T_i348Z6QXlP8ZTyw":{"text":"This place is amazing. The shrimp and grits are the best I've ever had. The juice bar make","useful":0,"cool":0},"G4fdrhauA5pla9hcOLwdnA":{"text":"Overpriced and the waitstaff was inattentive. Portions were small and the crab melt was sk","useful":0,"cool":0},"PhFMaiPUFrrvxAO7OogYwQ":{"text":"Solid brunch on magazine street. I just got a vegetable omelette with rye toast. The omele","useful":2,"cool":1},"mmc3-TieyNBwP0OkoslhEA":{"text":"I think I'd give this place somewhere between 3.5 and 4 stars if I could. We came here for","useful":0,"cool":0},"83TYmjreZGRAmjPxcf_kUA":{"text":"This breakfast really hit the spot. Best shrimp and grits I've had in his city. Can't wait","useful":1,"cool":2},"cR13di3HgHHNY-Gy_DozSg":{"text":"The original Surrey is hella popular with a wait of probably an hour just to get a table. ","useful":9,"cool":5},"4hFbmVWTtUxCCMMvKPs88w":{"text":"Surrey's was a recommendation that I got from a friend. Keep in mind that I went to this p","useful":0,"cool":0},"Ax27-0k1n2FWRB0mUDfLEQ":{"text":"One year on and Surrey's continues to maintain itself as an excellent breakfast or brunch ","useful":1,"cool":1},"MC5jfQpKl3_8YCFyeO_9ww":{"text":"I'm not a huge go-out-for-breakfast type of guy, but this place is worth it! We haven't be","useful":1,"cool":0},"HD4lCRteTt6eJH25WbGmjQ":{"text":"Shrimp and grits! Oh my! That's what I had, along with a magnificent fresh juice concoctio","useful":1,"cool":1},"qQHlKslRwvpAoWuDCdU6eQ":{"text":"This was probably my worst experience in Nola.....I read so many wonderful reviews about t","useful":1,"cool":1},"RC_RUwLAmRHpXMCd9WO3gQ":{"text":"I'm certainly a fan as they are just the perfect little breakfast spot on Magazine St. It'","useful":1,"cool":0},"L9HGgT-w9zPTGo4tcshq4g":{"text":"Omg, I fell in Love with this place after the first bite of the shrimp and grits! Ive trie","useful":0,"cool":0},"hRPm6ckiFUFSCsgwxbFUtw":{"text":"Surrey's knock it out of the park this weekend with great food and great service. I adore ","useful":14,"cool":12},"RsxmM2fBJDXZL8fiumryQw":{"text":"Surrey's is the absolute best. It's easily one of my favorite breakfast spots in New Orlea","useful":1,"cool":1},"EYBEQHQGWC2upIwNi2GQ3Q":{"text":"Surrey's rocks! I've loved everything I've tried from here, my only issue is that the wait","useful":7,"cool":2},"RRMWyI_Lf4lgh_ecOnRIaw":{"text":"The service was exceptional! Never had to ask for anything. I had the pesto shrimp omelett","useful":0,"cool":0},"dMTCQDRDbxUc4W43SRM0jw":{"text":"You may not know this about New Orleans, but this is not a breakfast town.  Which is norma","useful":5,"cool":1},"cw70Aw9ZgywR1nNBAx1dYA":{"text":"I love that this place exists. I come here for one thing and one thing only, the Shrimp&Gr","useful":1,"cool":0},"UqhVBsuGKNOXbnzWgSKh4w":{"text":"Really enjoyed Surrey's for breakfast one morning.  I had the Shrimp n' Grits which were t","useful":0,"cool":0},"zcJPptN7Vf0giWC4APbm5w":{"text":"Delicious. Everything. Get it all! \nService is good. Coffee keeps flowing. I really like t","useful":1,"cool":0},"Cih-aI_wayblxcXf-zonqA":{"text":"3.5/5 i wish they weren't cash-only\n\ni wish they'd start taking credit cards, but otherwis","useful":3,"cool":0},"FdxDLCNt3EbjDSNYanbeww":{"text":"Great brunch with super fast service. The shrimp and grits were delicious as was the crawf","useful":0,"cool":0},"cQJmkxws8R7EEl-EaRZzyA":{"text":"Came here for brunch on a Sunday. There was a line, it was overall a very humid place to b","useful":0,"cool":0},"VkXChlP4ACPUapd8l6LlOQ":{"text":"Y'know some mornings you wake up and you just need pancakes and not just any pancakes...I ","useful":6,"cool":2},"fF8apaJO_AG4SafaIWDGMw":{"text":"Get here early because the line for brunch can be long but it is worth the wait. I love th","useful":1,"cool":0},"f7t-t5ppsYCtofAcekIszg":{"text":"I'm a southern girl and when I say I'm particular with my grits it's an understatement. I ","useful":0,"cool":0},"NGw6MbX0dAQ4TRuvy3ck6A":{"text":"Loved this place so much we went back once more before heading home to TX. This was our fa","useful":1,"cool":0},"tEB75Y4I0sDXEhCiCvPG7g":{"text":"I usually go to the LGD location but since the line over there was gigantic, we decided to","useful":1,"cool":0},"Igfvf9R4uGKkNl1-F3vIHw":{"text":"My family attempted to get a Father's Day breakfast here last weekend. My brother and sist","useful":2,"cool":0},"BvGP-HpUi9qwYZ1bvh8NEw":{"text":"This is a really cute little spot but I was super disappointed by their biscuits and gravy","useful":1,"cool":0},"lrNbd731eUFkhbH_iESbBQ":{"text":"Best Shrimp Grits Anywhere, Amazing Bananas Foster French Toast - Great Birthday Breakfast","useful":0,"cool":0},"Pq0DtVSq7G4oK-AyMRpW8w":{"text":"I love this place. The food taste so fresh. Yummy flavored! I want to eat here all the tim","useful":1,"cool":1},"5bZvrjqi-xib9VRCUnqzFA":{"text":"Chef Leta keeps me surprised and overly satisfied each time I have eaten at Surrey\"s.  So ","useful":1,"cool":0},"l8DBK_dLp_pa6xMQrM8VgQ":{"text":"Came here for brunch with some friends I hadn't seen in a while on my first day back in No","useful":2,"cool":0},"rUdhZn2iU1NzbO3U6V8BHw":{"text":"Surreys has always been great, and then today happened. Started off by having to go inside","useful":0,"cool":0},"x6lpCYVX8kh2SkagVv8yYA":{"text":"I've been hearing how good Surreys is for years and finally got a chance to eat there ther","useful":3,"cool":4},"axjvBkhU-wWDFtyLhFKyBA":{"text":"Amazing, cute little breakfast place! Friendly people, fast service, and the breakfast foo","useful":0,"cool":0},"0WaXN9viyR37gQTVLVtLBw":{"text":"Really delicious, fresh food and juices!  Several vegan options, including vegan migas (ge","useful":0,"cool":0},"Cc2gYJNWfSp_nLdXA8BDfQ":{"text":"Go grab a cocktail next door and put your name on the list.  Worth waiting for!  Great Bis","useful":0,"cool":1},"wZqUQGXcMOq1J4vvw5L36A":{"text":"Shrimp and grits is absolutely delicious. Perfect amount of gravy to grits. I added a medi","useful":0,"cool":0},"mFRTpCrP6xmBlGamnF1GwQ":{"text":"This is the best damm place to get grits an Shrimp it is so soo it's a very small building","useful":0,"cool":0},"iv-0q8JxIJ-hUBWivZKJlw":{"text":"Even though NOLA is chock-a-block full of great eating spots, I'm making a push for Surrey","useful":1,"cool":1},"i__H6lQszuVNA9MRSoh1rA":{"text":"Delightful food and great juices for breakfast was amazing. Breakfast is served all day. V","useful":3,"cool":2},"LTsbM-V6naZX4yIBV3QGfg":{"text":"The food was good, I enjoyed it. It was my first time at the 4807 Magazine location and th","useful":0,"cool":0},"qDOp1q0U344L_clb6dFNuA":{"text":"The only reason why I ever go to Surrey's is because I know my friends from out of town wo","useful":1,"cool":0},"rxGi0FRYUsLkIMJ6ipbF3Q":{"text":"My SO and I went for brunch a couple weekends ago. Surprisingly, we didn't have to wait fo","useful":2,"cool":2},"BWAIQWIB661wcN0tMlsxMg":{"text":"I love this place! This is my first time at this location and it did not disappoint. The o","useful":1,"cool":0},"fotxpD5y6uJelqpvspEymQ":{"text":"My impression to date: \n\nCroissant Breakfast Sandwich...Yum!\nBreakfast Tacos...Yum!\nLarge ","useful":0,"cool":0},"biYP7tTgMGMyLBWVx9yN1g":{"text":"\"Sure, we can do take-out. You just have to come down, get on the waiting list for a table","useful":1,"cool":0},"43d7zotHXvGp8s1nJ7yQ9w":{"text":"This breakfast was amazing and if it hadn't been so out of the way, I would have gone back","useful":1,"cool":1},"XUBIzUQQxOU2ntMkKrJSpQ":{"text":"I have been wanting Shrimp and Grits from this restaurant ever since I saw a picture float","useful":0,"cool":0},"BihMTnahMV4W5hQMjE8MKQ":{"text":"Great menu and atmosphere.  We ate breakfast outside. Servers very friendly, and talk with","useful":0,"cool":0},"RJa5Hok5-ECmFn1oDz4vLA":{"text":"I went here this morning with my mom and aunt for breakfast. Despite being very crowded, t","useful":0,"cool":0},"971ta6LJAPjND8i2dTtl1A":{"text":"Cafes being within city limits and diners outside, I would classify Surrey's as a full-ser","useful":0,"cool":0},"O5na22mJVewOCVla9f9VZQ":{"text":"Oh Surreys! How I love thee let me count the ways....\n\nA New Orleans staple this place is ","useful":0,"cool":0},"CgBVNeWOwpriPKcC65BIcw":{"text":"One of my favorite spots in NOLA. I loved the atmosphere and the little houses on the wall","useful":0,"cool":0},"Mqn18J9nKkCrpUOIwz825w":{"text":"On a cloudy April morning, I was wandering down Magazine Street starting to think about qu","useful":2,"cool":0},"XqPeeVlzIQRAZWPLAage_w":{"text":"I dashed in right at 8a today (a Friday) & the staff was friendly & accommodating.  Becaus","useful":1,"cool":0},"nA4ZHpd4EYT07oJ2Lr1rgQ":{"text":"Great place !! Excellent food ... very friendly service! Must  visit.  We had the crab ome","useful":0,"cool":0},"1vTXpQUwFnQMZPJDmCUxgg":{"text":"Amazing shrimp and grits! Local place with cute New Orleans vibes and deco.\nBest fresh jui","useful":0,"cool":0},"jNKo2bX0--dZaz1z6DBSKQ":{"text":"Have been to the door of Surreys a few times but the long wait has always detoured us to d","useful":2,"cool":1},"SaKVi4Kp_6o1PdWstZU1hA":{"text":"3.5\n\nI wrestled with how to review Surrey's. The food is as good or better than you've hea","useful":15,"cool":13},"EuSSZp68PdzYQtcqQSjRHw":{"text":"I loved having a leisurely brunch on their porch -crawfish omelette, sign me up! We showed","useful":1,"cool":1},"PgUC52PPU2o6v8dtUfyRmA":{"text":"Delicious food, and a funky and fun atmosphere in a much less sketchy area than the French","useful":0,"cool":0},"V6oHoI9lW1eGBNriDpESMA":{"text":"Great food. Awesome service. We had to wait a little bit for a table but once we were seat","useful":0,"cool":0},"YL4EtPMIioP-8EBcpksSRw":{"text":"This spot is right up the road from where we are staying. We decided to come here because ","useful":1,"cool":0},"dQRmAcpB-qZwDdLg6YrJUw":{"text":"Went here to try after so many good reviews... I got the boudin breakfast with home fries.","useful":1,"cool":1},"An7xFvCKwnFj6u74Gx-KhQ":{"text":"Had:\n\nShrimp and grits: good; as expected\nTofu Platter : for tofu good flavor \nFrench Toas","useful":1,"cool":0},"7RbMBtaAOaO6_EHc35o7iQ":{"text":"Great shrimp and grits and banana foster French toast. I usually don't like French toast b","useful":1,"cool":0},"B1KupSA6g-QoN2L24nyAtA":{"text":"Excellent and quick service. The Shrimp and Grits is amazing, and love the little hint of ","useful":0,"cool":0},"-PjAMAXSLqX3qMpjjzec_w":{"text":"Surrey's was down the street from the place we were staying. It was a convenient location ","useful":0,"cool":0},"3hueiHdf3ENKMg2a0uXpvQ":{"text":"My boyfriend and I walked to Surrey's from our hotel 2 days in a row for both breakfast an","useful":0,"cool":0},"2MVxuIXRR_s4x2TEYHTZBQ":{"text":"Was pretty excited to eat here since the other Surrey's had 4 and a half star but it was b","useful":3,"cool":3},"ggzstcDeTXw8BmoIcho3Kw":{"text":"You are missing out if you haven't dined here. What are you waiting for??? Get your booty ","useful":2,"cool":0},"Xmnd6g8GeeoTWbUJTiDEtw":{"text":"My friend and I went pre covid and the food was delicious. We had breakfast.  We are senio","useful":0,"cool":0},"VT3RMzFydUxENQyUsF6Kag":{"text":"Seriously Surrey? $1 upcharge for extra salsa on my burrito? That's pretty excessive espec","useful":1,"cool":0},"obNUJMn4yf7PPCiSIuXEeA":{"text":"We had brunch at Surrey's on Saturday (10/27/12).  I must preface that I hate that Yelp ca","useful":1,"cool":0},"FJxFuEwGO3frDUsfLAuGUQ":{"text":"Went to Surrey's Uptown for brunch. Came at 10:30am on a Saints game day (kickoff at 3:30p","useful":1,"cool":1},"5OGcbDztxSYrZbbRaI5kug":{"text":"Wonderful food. Charismatic service staff. Awesome experience. It's a small place so be pa","useful":0,"cool":0},"vPSPtFRbXdmau1DyEJ0G2g":{"text":"Surrey's is incredible and I often bring people visiting NOLA here. They can get their Sou","useful":2,"cool":3},"hYC8D7qfcX8EWKOnGDDegw":{"text":"It's not what it used to be. I always get the lox blt on a bagel and the salmon was old an","useful":1,"cool":0},"o9zhoJVbA4CTW35Y_dSTUw":{"text":"Haven't been here in some time. When we did revisit we were surprised. No one was there. W","useful":5,"cool":0},"d2P2AUhvTJre5EajefhepA":{"text":"First time and was really impressed. It's a nice little cozy place. Enjoyed our delicious ","useful":0,"cool":0},"-VvjmMsmONErdHs05sWuIQ":{"text":"It may be awhile before you can enjoy brunch under the tree at surrey's; a sign on the doo","useful":3,"cool":2},"cIxdi6ZwDwDB8pNI-fXqlg":{"text":"Love Surrey's Uptown!! It's small so try to go at less crowded times! It's conveniently lo","useful":6,"cool":7},"M5m20jR8Mx_Uk5w_OzdRBw":{"text":"Quick service, glasses full!!  Food was great, \nOmelets are large portions for 2 people.\nC","useful":0,"cool":0},"lLUHooEFExENNFAX4tvufA":{"text":"I have been here twice. The shrimp and grits is hood and the French toast is delicious.","useful":0,"cool":0},"wqIwMPMePyYvmYzD0ad8VQ":{"text":"Alright, now that I've tried both - I think I like the other location better. Nestled next","useful":1,"cool":1},"dcwIkON3hqRSh5QxECOtsQ":{"text":"Love Surrey's! The pain purdue and bananas foster are my go to. I usually hate bananas, bu","useful":1,"cool":1},"AZU0uBXx4GxugAuCzfOevA":{"text":"Oh my goodness gracious the vegan tofu migas were to die.  Top that with a biscuit, even t","useful":1,"cool":1},"8svOomh9GckvCY9Y7LkFTg":{"text":"So excited that I found a place that serves breakfast bagels. Bagel was delicious!! We sat","useful":1,"cool":1},"9IqxbzR9doGKalCGtP4RUw":{"text":"Surrey's is a local Magazine breakfast favorite.  Even though it's very hipster leaning, m","useful":1,"cool":0},"9Hp4IIh8WcXNVtqvrSB_hA":{"text":"My girlfriends and I decided to come here for lunch on Lundi Gras based on a recommendatio","useful":1,"cool":0},"j3dnc37H500kOeB2xGYLVg":{"text":"This place is so cute and homey. There was no wait when we arrived, friendly staff and loc","useful":2,"cool":0},"vhC0dHLBvOV067uoaflt1g":{"text":"When walking up to this establishment my family and I were approached by an employee with ","useful":0,"cool":0},"z9PuJiGvYpA_OU9xfIiuNg":{"text":"Great Exceptional Food!! Excellent Friendly Service! Nice environment!\n\nThe reason for thr","useful":0,"cool":0},"bAcYqGi6WSsW9cg1BBjUcA":{"text":"Came to visit and stopped off at this well recommended place. I have not tasted food this ","useful":0,"cool":0},"3ZEW7Q0Pj2V1B4vXT8M5og":{"text":"Food was awesome, BUT, they're lucky we're giving them a 3. Why??? Wait time and service.\n","useful":4,"cool":1},"xBgS41cLyjQphnAWJAksTg":{"text":"Cute restaurant smacked right in a pleasant neighborhood on Magazine. Me and my sister cam","useful":2,"cool":1},"WzafiZPWrU5zeYvSzqzijg":{"text":"Shrimp & Grits is the only dish you need to worry about. I've had it dined in and to-go an","useful":14,"cool":9},"p9v7GiZhGtkA2CTdCVAO1g":{"text":"No wait, and I had my pick of tables. I ordered the chicken salad sandwich entrée, with po","useful":0,"cool":0},"ZldHLeerwIk-3lZJduUaaQ":{"text":"It's been about 4 years since my last review.  I've eaten here in between but have never r","useful":3,"cool":0},"1BxdZweLvICXh529iOy2DA":{"text":"Still amazing. Love love love surreys \n\nGet the corn beef hash and the juices :) also brin","useful":0,"cool":0},"DBWpFaCqNZ45VPU9xWX5tA":{"text":"Back in New Orleans for the holiday week and popped into Surrey's for brunch with my boyfr","useful":0,"cool":0},"D08eyGyUGOY8s-_SkHLE9g":{"text":"I usually go to Surrey's other location but I don't know why because I find this spot a li","useful":8,"cool":5},"oYIY5vqXU72O2qEVETndWg":{"text":"Great location right off Magazine St. Relaxed, natural setting & vibe. House made everythi","useful":2,"cool":2},"vBVyzm1e0oBba_eh7zmmgw":{"text":"It's still awesome, but we need to note a few things:\n\nPositive changes: \n\n-They take cred","useful":3,"cool":2},"_xqPG0Uu0-K1tAcinY-Q1Q":{"text":"There is no better (breakfast) Shrimp and Grits anywhere.  I put a couple of over-medium e","useful":1,"cool":0},"Vcm11btyjFzk3vHuJQLtMw":{"text":"Loved , loved this place! It is small, be prepared for a wait however the food was awesome","useful":0,"cool":0},"MkYparc-Cq0CuXi4ck5Piw":{"text":"My daughter loves this place.  I'm on the so-so scale.  Now, I've only eaten their breakfa","useful":2,"cool":0},"srKozH9h3DH9JrNtb4RJ1g":{"text":"GOD I LOVE THIS PLACE ***\nFirst off it's a beautiful, unusually woodsy, open-doored, craft","useful":9,"cool":2},"HfuQIbn20KFSSDD0rLAdkA":{"text":"Very cute spot! Right off the bat, I appreciated that they were strict about observing cov","useful":0,"cool":0},"fn8iWLcUJaVaRPScRRFuPQ":{"text":"Good place for breakfast, if you're in the neighborhood.  He said the potatoes were a litt","useful":1,"cool":0},"JOzplVyP5cPmQgwu7FEvPg":{"text":"Food and service were great! The Migas with Chorizo, potatoes and biscuit was just what I ","useful":0,"cool":0},"Fhfz_PBMekcF4BkspdeOPg":{"text":"Do not recommend coming here ever!! The slightly better than mediocre food was not worth t","useful":0,"cool":0},"vGDk1mNRmDM54jOXXBRgVA":{"text":"Oh my lord! Just had my first visit to Surrey's and it was sooooooo good! \n\nYou can eat ou","useful":1,"cool":2},"5-v7HUYFbtsycPjUlyHaww":{"text":"Service is always a plus. Gotta have their freshly squeezed juice. I come here for only tw","useful":0,"cool":0},"1p5SigVq_eJVaMnELABRQg":{"text":"Awesome service but probably won't be visiting again since they took the Montana plate off","useful":0,"cool":0},"Vf-sXUcI0zxXmq0-2kle0w":{"text":"Ok so the staff and building we're great. I had a long walk there and I got a water and co","useful":4,"cool":2},"fbUXaBUpHnW-I5ZpvExyaQ":{"text":"Surrey-ously, I am in LOVE with Surreys Uptown! I'm a brunch addict and Surreys fulfills a","useful":8,"cool":6},"suDcrQPVSvGx7FEVslVahQ":{"text":"As we all know Surrey's focuses on breakfast and lunch so you have to get your fix of Surr","useful":13,"cool":13},"YDlNawbKOzPnsRhpG6WAuw":{"text":"Yes I'm a fan ! Everyone in Surrey's uptown is amazing except for the crazy manager, MARY!","useful":0,"cool":0},"kCtgAn5XBcFVN_8m--OVPQ":{"text":"Are you in search of the hottest brunch spot in Uptown New Orleans? Look no further my fel","useful":2,"cool":1},"1IGV2itxUw-SsF17XRLAew":{"text":"AMAZING BREAKFAST! Definitely one of my favorite brunch places in New Orleans. I've been t","useful":2,"cool":2},"Q_j3Ql6aeBXt3xC8zS5Z0A":{"text":"Great food!! Bananas foster french toast was delicious!! And it really did taste like the ","useful":0,"cool":0},"eM9uB4AOJeY6FR2-_reM7w":{"text":"The pain perdu (New Orleans-style French toast) was outstanding. They use a French baguett","useful":1,"cool":0},"aiqo1yXxgW-jucPZr5OZIg":{"text":"Good place for brunch all of the food is really good and they offer fresh juice which is c","useful":0,"cool":0},"_nriq6MOWXCKd2S1o1WgHA":{"text":"So, I am on a breakfast kick.  I wanted a savory breakfast and a bloody mary.  I called to","useful":0,"cool":0},"wMAQwsxUyOTvILY5LdLtRQ":{"text":"If I can give 4 1/2 stars, I would. Place was very homie feel. Small and local type of sho","useful":1,"cool":0},"8gz6sjD4pigUVnK5OYLoQQ":{"text":"The shrimp and grits are a must get and the crab omelet also the banana pancake is huge !!","useful":2,"cool":1},"BmBJubpAMY4ro8HRquwb_w":{"text":"The hostess Claudia is the worst thing for Surreys business. I came to surreys with a grou","useful":3,"cool":1},"2xFpxSk8xyhd6EMOcH9rRA":{"text":"I was looking to see the Tree of Life, but after getting dropped off at the park, decided ","useful":0,"cool":0},"pLgIg7P52A9f7RrDs6rRUQ":{"text":"I actually feel blessed to have stumbled (literally; I mean I WAS in NOLA) on this absolut","useful":0,"cool":0},"unYgsFjcSsYOHAaCu8UXxg":{"text":"I had a delightful late lunch with a couple of ladies last Tuesday afternoon at Surrey's U","useful":1,"cool":3},"sxqRSnu810Khu58RJsI_Xg":{"text":"This was my first time dining at Surrey's and it was to die forrrrr!! I got the crab meat ","useful":0,"cool":0},"0DT1KGL45gWocORUxxrjkg":{"text":"My god! I'm not a huge lover of French toast it always seems better in theory then reality","useful":1,"cool":0},"epANyQQa1sZiVOfLDSUojA":{"text":"MORE REASONS TO LOVE SURREY'S:\n1. \"El Yucateco Green Habanero Sauce\" (pic): hard to find l","useful":7,"cool":1},"eLZeSj_2pP6CiyEbjc2Kiw":{"text":"Cafes being within city limits and diners outside, I would classify Surrey's as a full-ser","useful":0,"cool":1},"Rk_9UzHRZ_Y9g6J_hy_U2Q":{"text":"Surrey's has become my new fav. Be sure to pack patience and remember that if there is a w","useful":0,"cool":0},"Bvh5sJQ6ZujTj4MAXPfvsw":{"text":"Refuel is closed on the New Orleans sabbath (Mondays) so I had to try a new breakfast plac","useful":2,"cool":2},"1_MF61YB_k-OV9-BQ-FCsw":{"text":"The menu is a bit of a hodge-podge, with healthy options coexisting with more traditional ","useful":1,"cool":0},"jfAmVWwSUkcJXLj4wq4YEg":{"text":"If you are looking for a really good breakfast in New Orleans this is definitely the place","useful":1,"cool":0},"30GRIdv_KJZnGHJAe9AptA":{"text":"Love love love!! This location uptown is so cute and quaint. It's picture perfect!! \n\nSinc","useful":1,"cool":0},"lgahfmVrO9Wa3O44UvulBA":{"text":"We showed up on a Saturday morning with a group of nine and were more than willing to spli","useful":3,"cool":0},"-sY0Ko8n9UnWtvdtIPtIUQ":{"text":"Surrey's has pulled off something not all restaurants are capable of... opening a second l","useful":1,"cool":1},"6PV_LT0hepbYZkOK2WvNnQ":{"text":"I am shocked to have realized I never wrote a review for Surrey's, yet it is one of my mos","useful":1,"cool":0},"kwR3kLkMqmfijd7DRJ81rw":{"text":"WOW!!! The food here is spectacular and the service is even better. Everything about this ","useful":1,"cool":0},"thWlCNA6HAzcOuLawrUc2Q":{"text":"When I think of shrimp and grits I think of Surrey's and only Surrey's. The shrimp and gri","useful":3,"cool":1},"lrUDOZoPGnOqzzC-IXt2Pg":{"text":"I've eaten here before (for breakfast) and it was really good...I can recommend shrimp and","useful":1,"cool":0},"1KVDG2l05KSgHSvuJhyx4g":{"text":"Love love this place.  Just quaint.  The atmosphere is relaxed with a bit of artsy Barsy a","useful":1,"cool":0},"ENiijIcll_VUv7L-bknCEQ":{"text":"I've been to this location a few times now and they've never disappointed!! We went on a W","useful":2,"cool":2},"QaSMZdSPYUEXbGT1W-rw-g":{"text":"Good food and great place to take our visiting vegetarian friends. Same quality food and j","useful":0,"cool":0},"9YwWa8JPKvgesEwUfClUNw":{"text":"\"This is the best breakfast I've ever had in NOLA\"- My husband\n\nI mirror his sentiments, a","useful":6,"cool":5}}