{"axT19OzRRtZa--fb2Zspfg":{"text":"I eat here at least once a month, and more often when possible.  The brisket tacos and bri","useful":0,"cool":0},"F5teuZDjKfq2Dr0II6Db_g":{"text":"Tonight I went to Superior Grill expecting a delicious tex mex meal with great vibes. Firs","useful":2,"cool":1},"gtWhg-YM0YZfBv5JKClE2w":{"text":"Yum!  Food is good, but everyone should really come for the frozen drinks!  So tasty...","useful":0,"cool":0},"00J9BRuGkK4UOpZIiHpKew":{"text":"I just moved to NOLA from Houston and was lamenting the lack of good Mexican restaurants t","useful":1,"cool":1},"gnFBS3PLXBr7pnTOZUvHug":{"text":"I usually go to Superior because other people want to...like my brother and his kids.  It'","useful":2,"cool":0},"ydOdVciOHwIQSlRXlASYfg":{"text":"I love this place!!  I am not a fan to Mexican food, but their Fajitas is just exceptional","useful":1,"cool":1},"iMuJfM-WzxgTCLxxxRV_Ag":{"text":"It was a beautiful day and neither my lovely wife nor I had a particular craving, so we po","useful":3,"cool":1},"POE6JmSaAfn1UxiIlOA86g":{"text":"Mediocre Mexican food in a tacky location. Too many tourists and annoying families with lo","useful":1,"cool":1},"RgLm8UZGX-5JNaEnuS4ksA":{"text":"In a city full of outstanding food options, Superior Grill is not one of them. The food he","useful":4,"cool":1},"wnDXkAvGdkaQzdgQPHCq3w":{"text":"I suggest to go here hungry. This place has amazing margaritas. I usually order a frozen s","useful":1,"cool":3},"D2k5Wnmyj5_nsJgLDy2QSQ":{"text":"I have changed my mind about this place, but just a tad. I tasted its food twice pre-Katri","useful":1,"cool":0},"Y6PndC2t9Sz4gG2LI2Tqng":{"text":"The margarita swirl alone gets 4 stars.  I had steak tacos and they were good...not great ","useful":0,"cool":0},"oiiJkGY13SJj6c4YRpXlpw":{"text":"Not knowing anything about this restaurant, I stopped in for a late lunch and in search of","useful":0,"cool":0},"boFSPvODXTeRYN9uhFsmmg":{"text":"Superior grill has by far the best Mexican food I've ever tasted!  Being in the military, ","useful":0,"cool":0},"1HdeiAXYpEXruIVPT0C3LQ":{"text":"Celebrated Cinco de Mayo here with a friend recently and it was a good time!  Although the","useful":0,"cool":0},"jyLj4X2YVQ7NLa2AR8ljLg":{"text":"This is probably not the typical review, but Superior is my FAVORITE bar. I am a regular, ","useful":0,"cool":0},"Yp73UmXXoPyGDm3ur-8RbQ":{"text":"Food and service were great at this restaurant. We were reluctant to try it due to mediocr","useful":0,"cool":0},"Lay0SesnVn1ClMDuAaim5A":{"text":"Okay so my friend and I went here for margaritas and dinner. I got cheese enchiladas which","useful":1,"cool":1},"q5jFnpeJRN3mIczUZq6q1g":{"text":"Was in New Orleans for work and happened to be there during Cinco de Mayo. Well I heard th","useful":0,"cool":0},"6_qrjib_FLTpT-8MCWSnTw":{"text":"Superior Grill is one of those restaurants that you need to go to frequently or your bodie","useful":2,"cool":2},"SwEd4p4gAWHV_oysX9Iy2Q":{"text":"I had the crab enchiladas and though they were good, there were a lot of shells in the mea","useful":0,"cool":0},"53cvnY1V2cCbzshpT8t81A":{"text":"You know, Superior Grill is one of those places I have a love hate relationship with. Whil","useful":3,"cool":1},"IBHeAl9CQURS6T776DDcFA":{"text":"We stopped in thinking we were at Superior Seafood.  We were confused but stayed regardles","useful":1,"cool":1},"wS2FCoMqVzuKa4SQk0jLZw":{"text":"It's like an overpriced non-chain Hacienda, but constantly full of babes. I don't understa","useful":3,"cool":1},"PJoWVBr1CV57VxKXFmpApg":{"text":"Went in a busy father's day and they did a good job. The service was great, all of the sta","useful":0,"cool":0},"HdezTgK8C50xClvUVxpRiw":{"text":"I'm all about the Mesquite Chicken Salad!  The honey-lime vinaigrette is very tasty with n","useful":2,"cool":0},"2KR8QSd2y1qRvCcqHZJIsg":{"text":"I had to mix my own drink. Let that sink in for a second....I. Had. To. Mix. My. Own. Drin","useful":6,"cool":2},"FRjSTuBldb8qquf5o540aA":{"text":"I went with a big group to Superior last night and I was looking forward to    having a go","useful":1,"cool":1},"GjhcJWXccMI8ZoHarPzCMQ":{"text":"Chips weren't that good. Ground beef enchilada was meh. Grilled fish taco was good. Grille","useful":1,"cool":0},"29i7_pS6vQqw05Afa99YVg":{"text":"Sehr gutes Essen, frisches Gemüse, extrem nettes und zuvorkommendes Personal. Wir haben un","useful":0,"cool":0},"jo1MgkFvJ8CtMrZN4_Szaw":{"text":"Very, very loud. Parking next to impossible. Food was OK but not authentic Mex. Was Tex-Me","useful":1,"cool":1},"1FCyUOSuachFPwCGEYt8zw":{"text":"I'm a former New Orleanian and a frequent visitor. I love food and have a set of restauran","useful":0,"cool":0},"bsVmTdNGFchonF_pNh6ORg":{"text":"I'm conflicted about this joint. I had a brief but good time here, though 95% of that was ","useful":4,"cool":3},"oGM28NXjdYlioVSc2MpJTA":{"text":"This is a pricey place but if you want quality fajitas, it's worth it. Just split a regula","useful":1,"cool":0},"NUZXmDKoi6ybOPZ6yolkCg":{"text":"I really enjoy Superior Grill despite the horror stories I've heard. I have only been here","useful":2,"cool":0},"w4SVzQ-z6nSGdyPybIYHig":{"text":"Still buzzing from the Margaritas we had last night at Superior Grill! LOL (I kid..i kid) ","useful":0,"cool":0},"D2BpESeVo15E4PJe6kDEHw":{"text":"The Tex Mex is good, but the Margaritas are exceptional! The best place in NOLA to spend C","useful":0,"cool":0},"pFyE09M43wMqB3Jss7FUzg":{"text":"We ate here last night with two of our kids and three of their friends. We were told our w","useful":0,"cool":0},"WE8Bljq9uZiD3MC7apbyWQ":{"text":"\"Meet by Superior Grill\" is all you hear for Mardi Gras. The second most common line I hea","useful":2,"cool":2},"dftGqbf7tQH9_IaBNfkBUg":{"text":"Ok so this review is less about the food and more about the overall experience. Let's be r","useful":0,"cool":0},"xOTo4ur2D8u3L_Do04HN-Q":{"text":"OK, Here we go... A year ago I was a usual seen at Superior on Wednesday night because it ","useful":0,"cool":0},"ZR572dX7cBHb7m4f5K_hqA":{"text":"Great food, but drinks are SUPER EXPENSIVE. 2 drinks margarita's more than the meal. Why i","useful":4,"cool":1},"HkxFa19KqLL_SPZuZ-ArsQ":{"text":"Who wouldn't love this place?!? I really like the taste of the food here! Everything is pr","useful":4,"cool":2},"3RcSJLSwAQaEjJJ9GEcorw":{"text":"Margaritas are good! Come here during happy hour so you can get a double for the price of ","useful":0,"cool":0},"O0Lh5MpnUh9WrmPxjdcqqw":{"text":"My favorite place for mexican in New Orleans. Its a bit on the high priced side but the be","useful":1,"cool":1},"bO-nWIf6OnVpZtnX2MCVyQ":{"text":"What is there to say that hasn't already been said?  Forgive my redundancy..\n\nThe majority","useful":4,"cool":0},"Klo87fNOCuK-i8bW47Pgcg":{"text":"This place is good, but not great by any means. Good for happy hour, or if you are in the ","useful":1,"cool":1},"maMKfJfW9rpklCopXnPMkw":{"text":"I'm trying to understand how the hostess moved past my husband in that tiny foyer where gu","useful":1,"cool":1},"rkldWei3CkTD-8uwmFwvig":{"text":"Food is ok, not great or even good salsa needs help!  I remember in the past thinking it w","useful":2,"cool":2},"D04QLr_L_ogBTZxlmDSZJg":{"text":"I'm giving 5 stars because this place is consistent, and doesn't try to be anything that i","useful":6,"cool":1},"QSOxChdXQL1FO9Et4ew7XA":{"text":"Superior Grill is a classic in the New Orleans area when you are craving quality fajitas, ","useful":1,"cool":0},"CRwqybJFUNRL-xWb9PNTlQ":{"text":"So where should I begin? Amazing how we have a large portion of society with a lack of tas","useful":1,"cool":1},"AKbE_HWOR5Sji3TAe4YAug":{"text":"Server was fantastic. Food was good. Adult beverages wee a great price for happy hour. Shu","useful":0,"cool":0},"RjFsTAC96HUuCslkXSGuQQ":{"text":"Sitting at my table right now after a great evening at Superior Grill. Many to our thanks ","useful":0,"cool":0},"-iSpPPqK88E8WDY82ZQ5zw":{"text":"I've heard a lot about their happy hour, but have never been. I called earlier today to as","useful":0,"cool":0},"pMO_ftKSVF-kag5YVPqo5w":{"text":"I'll give it to them.  The margaritas here are really good, but they are $11 for a small o","useful":1,"cool":1},"12UTp6tpMKtVEJLiWz-Lqg":{"text":"Awesome place, been there last two Sundays for brunch/lunch!! Great food and even better s","useful":0,"cool":0},"KnjhIqRciidqiWc8c20OrA":{"text":"Excellent food and Brian was the most incredible waiter! Would definitely return here! Gre","useful":0,"cool":0},"ZFv3-_LoJA51MbqPDtiuQQ":{"text":"Inferior Grill. Faux Tex-Mex. The margaritas are too sweet, the salsa too bland, and most ","useful":1,"cool":1},"zlK5nbrlRkkkKAkck76K2w":{"text":"The fact that this place remains packed every night is astonishing. The food is pretty goo","useful":2,"cool":0},"9tuhpu1-Q6sMn8pad5ItVw":{"text":"My first time going here was almost a year ago and I loved the food then. Today I took my ","useful":0,"cool":0},"ZD95gW5aHNrCnLj3C9etBQ":{"text":"Average.  I've eaten at Superior Grill in Shreveport many times, and love it... always goo","useful":1,"cool":1},"jdEU9rMkfL98TBHzUxz1NQ":{"text":"One of my favorite places with some of the best fajitas you will ever have.  I like it so ","useful":0,"cool":0},"UQ_9C50kHEj8_mKlJ1ahIA":{"text":"Huge portions, phenomenal food and a great wait staff are only part of it. The ambiance in","useful":0,"cool":0},"0vE7BF5H3JyEarcGCcGevQ":{"text":"Best enchiladas ever! I love the atmosphere! I had a frozen margarita swirled with sangria","useful":0,"cool":0},"8_K5c-imIAUFIMMFOtlCSQ":{"text":"Food wise, I give this place a solid 4-star rating; Factor in the service though and I'm t","useful":2,"cool":2},"Ny98OT2XvO2NAjQYwqQN4w":{"text":"Food blows. I don't get why people flock to this place. They get two stars because it's a ","useful":2,"cool":1},"mjYmdm5DM6jXOIRb8CJyoQ":{"text":"I wouldn't say it's authentic or even pretend to know what that means but the food is savo","useful":1,"cool":1},"o7RfEM5CK1dq72rPgYCMCQ":{"text":"Best cheese dip in town!!  They also have great lunch specials during the week.","useful":0,"cool":0},"IHRccEbfyXxhw2n1XX-6MQ":{"text":"Classic Tex-Mex.  Good but not \"Superior\" as the name would suggest.\n\nThe highlight are th","useful":2,"cool":2},"-u_NWJfShdrodooIiy2plg":{"text":"Very nice and good service. Only complaint, noise. Need to dampen the sharpness if possibl","useful":0,"cool":0},"HHEwbhuay-A_mvZSBM0Ksw":{"text":"Great place to hang out and eat appetizers with a few drinks, but honestly, it's a bit ove","useful":1,"cool":0},"Rpp-rFNtyHxlzEH9zel7cQ":{"text":"First time in New Orleans, stayed in the Hampton hotel next to the restaurant. The food he","useful":0,"cool":0},"5WS8acfvF9LhS15z739d8g":{"text":"Don't eat in the dining room. Go to the bar during happy hour and get to know any of their","useful":1,"cool":0},"IijgzcZ1tIa30Obj0eVACg":{"text":"Yum-O!  I loved this place.  I was in New Orleans for a work thing and wanted a nice lunch","useful":0,"cool":0},"wzmamEpImANKkaoI2yAdog":{"text":"If you're looking for great Tex-Mex at a reasonable price, then Superior Grill is worth a ","useful":0,"cool":0},"4tk6En83eIlsIuQNCDX_8Q":{"text":"I've been here 4 or 5 times. They have good food, decent service and the drinks are strong","useful":1,"cool":1},"jLGQhxKo2Fm5-dN_Bgnnfg":{"text":"Went there Sunday night.  I mentioned to the waiter that we were celebrating a 20th annive","useful":0,"cool":0},"ShE-5J8sOjNPpguShSaOFQ":{"text":"In the three visits I've made here, I've never really been too impressed, but it's really ","useful":0,"cool":0},"z_tjDIGtv9sEWTZOP4tbgw":{"text":"Great lively Mexican - great food and plenty of it, very good if a little pricey top shelf","useful":0,"cool":0},"_X9POIMAyZPykK3Z2vXqVA":{"text":"The first time I went here the service was great, and food pretty good.  I had the beef fa","useful":1,"cool":1},"rWFF6UUTX-xDY2VKx1LBeg":{"text":"Located on St Charles Av, right on most Mardi Gras parade routes, is this great Mexican re","useful":0,"cool":0},"tPwriOTwQicIWds6-MXsQA":{"text":"I grew up in Texas, so I'm very biased toward Mexican food.  Most of the food is nothing s","useful":3,"cool":1},"r-_d5fDTx2nkLil2gSD0dg":{"text":"Eh....I've been here twice and have not been impressed either time.  You certainly don't w","useful":1,"cool":1},"z_ouyeAZEdnlMbpZPHIDPw":{"text":"The margaritas are well worth going for if you aren't interested in the food. Sitting outs","useful":1,"cool":1},"n9LPozEQplfb6NBrhfpAmw":{"text":"Superior Grill.\n\nHome of the Roofie-ritas! I say this because if you have more than one la","useful":4,"cool":3},"FjC_6X8426edV3GuiRFbcQ":{"text":"I think I made a mistake. Superior is good, but it could be a lot better if I were drunk. ","useful":5,"cool":0},"TZLD4v5ol7hVYvgin0s2gg":{"text":"Delish!!!!!!!!!!!!!! My quesadilla was excellent!!!!! Everything was fresh and  well prepa","useful":0,"cool":0},"9EXahNMGKABfPm1ko627Cg":{"text":"The service is usually good. They refill chips and salsa regularly, and split checks with ","useful":2,"cool":2},"-AIzpt7NwCAZG8fo1TsJ8Q":{"text":"Inferior grill. A once very good restaraunt riding on it's name. Slow serivce, over-priced","useful":2,"cool":1},"ubcuyHbeKZt1Q5nM9L4F8g":{"text":"I have had so many great experiences here at this place! It happens to be superior above a","useful":1,"cool":0},"YSo6YUJiXbST0ZFGrpxuBg":{"text":"I would return for the atmosphere, location and drinks. The food wasnt bad, it just wasnt ","useful":1,"cool":0},"l2RQCm4OH2I1tbEUNHYv_Q":{"text":"Great server. Even better food! Had the crawfish enchiladas and it was delicious. Our wait","useful":0,"cool":0},"t3BgcaqDzOjsJC9oQW52Eg":{"text":"Best service of my life. Anthony was smart, attentive, and knew my needs almost instinctua","useful":3,"cool":2},"fhRxIskfdpa7YWNH9LqYcw":{"text":"I know this place isn't a culinary destination but this restaraunt and location on St. Cha","useful":0,"cool":0},"SCvoBTq2gLdtgOqi7ACnBQ":{"text":"The 4 stars are in reference to the happy hour margaritas alone. After sampling the food I","useful":0,"cool":0},"eJxBVKbPZDmbrPpzZsrZvg":{"text":"Way better atmosphere than Juans (mexican in NOLA is limited), but there is almost always ","useful":0,"cool":0},"PuCDqZVHl26Krn63EbUaTA":{"text":"New favorite Mexican restaurant.\nIf you go be sure to get sopapillas. Best dessert I've ha","useful":0,"cool":0},"qeW1j2m1q8cUxOa6pHiH0w":{"text":"No one comes to NOLA for Mexican food but dammit we do come to drink. The margaritas here ","useful":0,"cool":0},"DOHLPZZ5zqJV1J-qlWI3iA":{"text":"I've wanted to check this place out for some time now. I've heard good things about it. Up","useful":4,"cool":2},"Zx_nzf8Q8hXfgApcIagjpQ":{"text":"Food was not good at all! The chicken was burnt to a crisp, and the Manager was rude, and ","useful":1,"cool":1},"-HDTN-IorWN1MqKV_fEuAg":{"text":"I only went to this place because it was right down the block from my hotel.\n\nIt was clean","useful":1,"cool":0},"15S3LqN84fNgIZIFJbj9iw":{"text":"Went here with my boss for lunch today.  We got our chips and salsa fairly quickly as well","useful":2,"cool":2},"KeWa9Y2bpy32QBYdpUNCjA":{"text":"This place was next to our hotel so we gave it a try our first night in town.  Great menu ","useful":0,"cool":0},"7Wp7tzkGA6cqLif1T2C9VQ":{"text":"I'm basing this rating on one dish, but it's the dish I get every time I go. It's the Faji","useful":3,"cool":0},"6PXKtJsvy34C8sRh0kRujg":{"text":"The 3-star rating is a little high, its really a 2.5-star.  This place has a nicer up-scal","useful":1,"cool":2},"xAGqAbywXWHd8d61L_G_fw":{"text":"This place is right next to the hotel I've stayed in for months on end and I've only been ","useful":3,"cool":2},"-x5NkEo9JnjRUS7tlkMQQg":{"text":"Happy Hour is great, but who actually makes it in time for half off drinks? Not this gal .","useful":2,"cool":0},"s165PFEB2eYoA6tHlfiFVg":{"text":"Only stopped by for margaritas once.  Yes, the are $15 each, which does suck.  It did take","useful":0,"cool":0},"kpTz7ShMR9B_piKCffwm9A":{"text":"Overpriced for what you get!  The place was nice and they welcomed the family.  All goods,","useful":1,"cool":1},"geK1cHXH0kkgI30j2XN0WQ":{"text":"Ick. Just.. ick! If this place wasn't near a college or on St. Charles, it wouldn't have l","useful":2,"cool":1},"NMpzptG7WABnViALIgqKvg":{"text":"Reason: The strongest margaritas in town.\n \nDrink:  Margarita: frozen or on the rocks, ori","useful":0,"cool":1},"eR94ee-8K0P7aOYViWyB-Q":{"text":"meh. the food is never very good, the chicken seems to be low quality and nothing is speci","useful":1,"cool":1},"lbZPB2n7WXkA6ItxeyqXbA":{"text":"The location is nice but the food is mediocre and overpriced. My wife ordered a hamburger.","useful":1,"cool":1},"Ca0VnWrNM12QT224JBIBVQ":{"text":"One of the better mexican places in NOLA, although it really is Tex-Mex, and not at all au","useful":0,"cool":0},"_w01imI_I3dl2EroPWhyrQ":{"text":"Very mediocre mexican food. First time I met a cheese enchilada I couldn't eat. I don't kn","useful":1,"cool":1},"hNDeO2k36QDrj09F0QI2mg":{"text":"Ok lets get one thing straigt, MEXICAN FOOD SUCKS IN THE SOUTH!!!  Mexican food is not sup","useful":2,"cool":1},"x8SGcsaHSptWBQSJgid71w":{"text":"Superior is the place to be while waiting around during the parades at Mardi Gras - I've b","useful":0,"cool":0},"Tsmc1vg6mQT6gP9GNrujVQ":{"text":"We ate here during Mardi Gras night. Although we had a hour wait it was worth it. We watch","useful":0,"cool":0},"jv7Dhg9hLZ9RAKkruJXUEQ":{"text":"Love the margaritas, queso dip, and the boyfriend loves the fajitas. Occasionally our orde","useful":1,"cool":1},"9r3m0_oN_0ptCXLLUkPtWQ":{"text":"I couldn't really comment on the food because I'm usually drunk by the time I get mine. \n\n","useful":1,"cool":0},"QdUnHKB2UtuduHe0fWPYKQ":{"text":"I just stopped here off of the street car for a quick, frozen margarita. It was fantastic!","useful":0,"cool":1},"gM3Jkt_VHHKDEEWkzgBHrQ":{"text":"Superior Grill might have the worst food in NOLA.  Really just not good.  Do not get the n","useful":6,"cool":3},"NI1fipGmWrJZQgzXG9SpxA":{"text":"Best. Damned. Margherita.  The food is great too. If you go here though, you had better be","useful":0,"cool":0},"825_U0FWcQ0wm2NuD8rrvg":{"text":"Women love superior. I'll crush the chips and salsa. But too damn pricey for mediocre at b","useful":3,"cool":1},"p1dgJQc9FrCA0NN513p9rA":{"text":"Quite simply THE BEST Tex Mex!!  While visiting NOLA we were able to enjoy Superior Grill ","useful":0,"cool":0},"PCVQ-E0qZDXnHQ__Ws7bVQ":{"text":"Ah, Superior Grill.  A favorite among my friends, I have a love-hate relationship with the","useful":3,"cool":3},"WeuJOMQm10qS11WpBsiCgQ":{"text":"Superior Grill is a great happy hour location if you like margaritas, or as the bartender ","useful":4,"cool":0},"6UwydB3nkZpcUVfTRQx9hg":{"text":"Met some friends here and had heard about the raves one of them gave this place. Overall g","useful":0,"cool":0},"9zdu4m0JbCQT6TNKPEXptg":{"text":"Maybe it's simply not for me, but I really don't understand the popularity of this place. ","useful":1,"cool":1},"R4xk68ycD4BfXImOA2oZpg":{"text":"What an excellent restaurant! We ate here twice on our vacation to new orleans. The staff ","useful":0,"cool":0},"5FjqguVfRDfsijPP6ifrxQ":{"text":"I guess it's the booze that keeps people coming in, because the food is really boring. \n\nI","useful":5,"cool":2},"WsH7QGi_BI4UQ1CwLwfupQ":{"text":"I was told to come here due to the rave reviews from my friends and family. I ordered the ","useful":3,"cool":1},"ngdaIUt6fGIzZ_tN4Tji_g":{"text":"Free chips and salsa are so delicious. Queso is great. The rest of the menu is just ok, bu","useful":0,"cool":0},"ML2n40RU30kmhoZEoU60fA":{"text":"For me, Superior Grill is good for a few things: chips and salsa, queso, margaritas, and f","useful":1,"cool":1},"m1sLkZBfGPcunVJgMv6sXg":{"text":"I stood at the bar for 12 minutes . I times it after 5 min. All  2 men bartenders were not","useful":1,"cool":1},"iYheveK4yhtcR7qVIduDLw":{"text":"CAUTION: THIS RATING COMES WITH A CAVEAT\n\nI am giving 3 stars to Superior Grill ONLY when ","useful":2,"cool":1},"rmtUpx-T2P-fMwE4eN0NtA":{"text":"My favorite Mexican spot for some fajitas and margaritas. Great happy hour and always quic","useful":0,"cool":0},"y-GnBD7-HAkf1tWeIdzHqg":{"text":"Mexican food, of course! The name doesn't scream \"come eat fajitas!\" but Superior Grill is","useful":5,"cool":2},"iaPGWgAmat_rHH-uZT7ylA":{"text":"Ive been coming here for 10 years. The margaritas are the best in town especially when the","useful":0,"cool":0},"Ry0b19BUkCAeUSR7fJNnxQ":{"text":"Not so \"superior\" in my opinion. ....and I enjoyed my meal in the company of a true \"mehee","useful":2,"cool":1},"vlQExfwKTTwLjnnrZQqkJA":{"text":"Uptown favorite of mine! If you're looking for top quality Tex-Mex, great happy hour, and ","useful":0,"cool":0},"GHulqs28EO3k96UiGgvvGA":{"text":"Generic atmosphere, but if you have a really large group (e.g. 20 people) it's one of the ","useful":1,"cool":1},"0kHpHQEeYs89iPG2nu7gnA":{"text":"Loved this restaurant. The waitress was very nice and went out of her way to make sure my ","useful":0,"cool":0},"xRi9beyRCVYGFY6uK7YkpA":{"text":"This is by far the BEST place in NOLA.  Whenever I am home (NOLA) I must get my Superior G","useful":0,"cool":0},"qTE0mOIMfQdAZsnktMC9lg":{"text":"The food here is mediocre. Definitely not the best Mexican in town.","useful":1,"cool":1},"43obQoPTFoXbqp_tGhZvXg":{"text":"If you are 22 years old, you probably think that you have hit the mother lode.  Anyone old","useful":1,"cool":1},"_29a1H5fV-9gOnXTm2yYDA":{"text":"Go here, grab a spot at the bar, and make friends. That's the way to do this place. Find T","useful":2,"cool":2},"uAzzxcMfazSF11kZLtk-bA":{"text":"I truly love this place. Although the food is more Tex mex i always enjoy whatever food I ","useful":0,"cool":0},"808_dK3wAF9NZuPO85JpVQ":{"text":"I would recommend something other than the fajitas. The shrimp, chicken, and steak fajita ","useful":1,"cool":1},"EBzAjVjDUpKM5THYreEnpw":{"text":"Service was a little slow and the waiter kept forgetting items, but the food was delicious","useful":0,"cool":0},"CLi2zbgZQP5jr6xehFLLFg":{"text":"This popular Tex Mex place is really quite bad! LOL. For some reason though we still go. T","useful":1,"cool":1},"wsVtjUtHHviTy2udUQUBZQ":{"text":"This place is desperate. Food is crap. The onions weren't cooked. Tortilla were cold. Food","useful":1,"cool":1},"bPmzQjfNcCaeYMqYsqhadg":{"text":"Food quite good, tried several items, but the service was horrible. Sat at a table inside ","useful":3,"cool":3},"CiXFAnOeL3JKRTbd-Do3tQ":{"text":"I've lived in New Orleans for nearly two decades, and it still baffles me a little that th","useful":5,"cool":3},"bYSzy0bA27AOORkxY0luwQ":{"text":"These margaritas are not to be missed. I am not one to boast about frozen margaritas but t","useful":0,"cool":0},"U7ow-z2I-RVxzHsmkCbfuw":{"text":"I didn't eat here, just stopped for a drink, but I have to put them in the Hall of Shamefu","useful":3,"cool":1},"wDSSc3bcZpmJ99poq3FDpw":{"text":"Best thing about Superior Grill: double margaritas, 3:30-6pm daily.\n\nWorst thing about Sup","useful":2,"cool":1},"YlVRZKOC1cSzidjrN3jE-g":{"text":"This was my first visit to Superior In New Orleans as I have frequented the Shreveport loc","useful":1,"cool":1},"UgXFREv1C6q5Nh_JqZCwhw":{"text":"After arriving hostess took hubby and I to the furthest table at the back of the restauran","useful":1,"cool":1},"jmbtkDvRG7Nga47zTLs3yw":{"text":"MMMmm.. One of the best places in New Orleans to get a margarita! Every time I dine at Sup","useful":0,"cool":0},"rxn0_R5NOrNKftAyaLDFRg":{"text":"The best Mexican food & the frozen strawberry margaritas were amazing. Be careful they are","useful":0,"cool":0},"Ebzx-wOZrR_vpJVCmCV5gw":{"text":"I'm a local here, probably stop in twice a week.\nThis is a great place for dinner, lunch o","useful":0,"cool":0},"sDMF7tJuwpRYdjk2-fxvKg":{"text":"shrimp salad and pork suiza fantastic! jeremy makes the best exotic drinks on old recipes,","useful":0,"cool":0},"7JO5eSJNYyczO0KyA0B2_g":{"text":"Sehr gutes Essen, freundliches Personal, sehr gut besuchtes Lokal, deshalb an machen Stell","useful":0,"cool":0},"JWzXSn01n9BvdUT2mYr6Ig":{"text":"I have been a regular customer here for a long time. The food has had its ups-and-downs, b","useful":1,"cool":1},"slTdlhKcMVnmQAvpmuGsdQ":{"text":"This has been one of the best dining experience! Th food was fabulous,service impeccable. ","useful":0,"cool":0},"Qnl8a-efXr_Q5CT-m4tmRw":{"text":"Friendly, Fun, Filling. \n\nThose are the nice things I can say. The food is crap. Is this t","useful":4,"cool":3},"4DxRK9ykf4VsFhiV-jeqqA":{"text":"Horrible service and horrible food. At one point I had to get up and get the pitcher of wa","useful":1,"cool":1},"bQKIoI2TeUpWiK8PMFMIhQ":{"text":"Came here for lunch one day on a week day. Overall, this place has decent mexican food but","useful":1,"cool":0},"Mu8ZmACpFk3J7ZbztoLy-g":{"text":"I used to love Superior Grill, but now it just OK.  Perhaps, I have been exposed to too mu","useful":2,"cool":1},"HsWh5FgGRgFIqwGEqhdB4w":{"text":"Love the margarita specials, and the food is consistently good. I've always had the luck o","useful":0,"cool":0},"Hex0AzlOhNLuYM-HvqHT1g":{"text":"My husband and I both had the Poncho lunch burritos stuffed with chicken, paired with side","useful":0,"cool":0},"Pz5etobWXVuvLS5PJxmdiA":{"text":"Went to Louisiana and ended up trying Superior Mexican restaurant.  Kinda sad how we waite","useful":1,"cool":1},"juQSA_zit8lnZoOsZgHlXQ":{"text":"I was visiting New Orleans and my family went to eat here and watch the Cowboys game.  As ","useful":4,"cool":5},"nt-GreCI3u746RX-WMTE1g":{"text":"After a long day of beach and shopping I was ready to have some good food at Superior gril","useful":4,"cool":4},"SJyyjM8t3U6FNJPoJIlkgQ":{"text":"This place has been on my \"blah\" list for a long time. I have eaten there several times at","useful":2,"cool":0},"rdStfmjAF_fG5Z0XoXU7eA":{"text":"Packed, loud, predictable yuppie happy hour crowd, kinda pricey and the food is just okay.","useful":2,"cool":1},"Ig1f8ogf8gpiuBgCwUuQSg":{"text":"I love Superior. The maragaritas are the best I've had (but very expensive) and the food i","useful":0,"cool":0},"1v5LC0laX3rev-Yt_CKjWg":{"text":"Great margaritas great food great service..come see me and get the best experience possibl","useful":0,"cool":0},"2E3nJNWkdq5AbE_r8bKRfA":{"text":"This might be the best Mexican restaurant in NOLA, which is sad because it's not really Me","useful":2,"cool":2},"7IhiRYNxwn4w8ZesHBG6Rg":{"text":"This place gets different reviews, but I have always enjoyed my meals. Great chips, guacam","useful":0,"cool":0},"TUv3bTdzFOTkdhuHgJTHxA":{"text":"Great environment! Good bar to watch football games, etc.. Queso and margaritas are a must","useful":0,"cool":0},"oJ9eeGYBXJO_7Hnyp2dcsw":{"text":"Some of the worst Mexican food in NOLA if not America. Overpriced drinks. Id rather eat at","useful":0,"cool":0},"JOZdsDJkxIvqBe8It-OPOA":{"text":"Yum. I'm from Texas so we have Mexican food EVERYWHERE. New Orleans just doesn't. This pla","useful":0,"cool":0},"--vIVGiWrNwQhKZWRPTaCQ":{"text":"Horrible hostess, lies about wait time. When you confront them about saying 30 minutes and","useful":1,"cool":1},"DmLILJ8F1tc5I01RdvdtRw":{"text":"Another one of my favorite restaurants and Mexican restaurants. Great food. Great staff. A","useful":0,"cool":0},"lJOkBipaiE1IfOw8V6G9AA":{"text":"Great place for drinks. Food is pretty good. My favorite is their ceviche. I'm addicted to","useful":0,"cool":0},"lcHaA6qUGpdz27DBVQKPtA":{"text":"Great service and fabulous food.  Stopped in after walking around the Garden District and ","useful":0,"cool":0},"uPvw7YwlUgfrX6YseGX0GQ":{"text":"One word..... MARGARITAS. The best I've had anywhere. They have great prices and the marga","useful":0,"cool":0},"8zaj41I-ajQbnWweDMr5aQ":{"text":"Dear Mr. McKinley Eastman,\n  I suppose you saw it appropriate to confront me yesterday abo","useful":34,"cool":14},"ES7hOhPZ3KnuOo3Q0CskiQ":{"text":"The only good thing I can say about Superior Grill is that an Emergency Room is two blocks","useful":1,"cool":1},"1Vi7uBYA-feGeJPAkNjNnA":{"text":"Make sure you mention that you want a single margarita .... Waiter became very indignant w","useful":3,"cool":2},"6K_q8EkJngpatb4MCI9JLA":{"text":"Overpriced and mediocre! There's a reason locals hate this place.\n\nI ordered a to-go: 1 or","useful":1,"cool":1},"0kullc-sPT0hfvDexy-zag":{"text":"We came to Superior, as we have for years for parades, and were told we had to pay $10 per","useful":2,"cool":1},"sG5nnKy8p7wkzh63CyayAw":{"text":"I'm a big fan of Superior Grill, but not for their food. Food is overpriced and little bla","useful":2,"cool":0},"ke1eRvv0dZ2bxPjrdjXxqw":{"text":"It was ridiculously expensive and their food was mediocre at best. Their server forgot to ","useful":1,"cool":1},"-2-mHdwv5pU0hz80M73AKQ":{"text":"So I was hesitant to try this place after reading some reviews here- but it was literally ","useful":0,"cool":0},"Vy_F1LO7kjpmf-xAVjtUSg":{"text":"big disappointment. one star only counts for location. service, drinks, and food are so su","useful":2,"cool":1},"MmgGfyZ9t-BeRCIQ4Dt3Ow":{"text":"I love this place!!!!!!\nCome here almost every Thursday. \nToday I had the worst service I ","useful":1,"cool":1},"tsvlSOxIh_joemzbusdhMw":{"text":"Food's okay nothing spectacular. Over priced mexican food if you ask me. The margaritas ar","useful":2,"cool":1},"8hkN7RGT_LzxC3htYDm_fA":{"text":"Came here last weekend to celebrate a friend's upcoming marriage and I came away concludin","useful":4,"cool":1},"WHjNBEhC_VoO7LDJe7FPUw":{"text":"If you've ever been to or passed through Texas don't bother. \n\nGreat location and bar!!!\n\n","useful":2,"cool":1},"BLzSFvMD6dhVk4CUxn3weQ":{"text":"Although they label themselves as a Mexican restaurant, I'd have to say it's more Tex-Mex.","useful":0,"cool":0},"Fd8YQM2p045I8KmCmxUh-A":{"text":"By far the best mexican food place in all of New Orleans!","useful":0,"cool":0},"NfZNIwxuNO9Z2mqgZffQZg":{"text":"This is an okay place to get Tex-Mex food. The food is average at best. The atmosphere is ","useful":2,"cool":2},"SNyO2J_xaORuKpTWcXu0kg":{"text":"Brunch was absolutely awful. The only draw is the bottomless mimosas, sangrias, or bloody ","useful":2,"cool":1},"Ul6FkFNJBMdGxhCAomtE_w":{"text":"Fabulous Mexican food and fantastic service!!! Chicken fajitas with hand made tortillas wa","useful":0,"cool":0},"1KlCsuA8r-F8Bp5ygdTdqA":{"text":"a lil confused.  Went last night, and they told me the beans now contain meat, and always ","useful":0,"cool":0},"a5lCB0LN7SswaXe2JGnXLw":{"text":"Went here for dinner and oh my gosh it was so good. Home made tortillas are the best thing","useful":1,"cool":0},"KK1PLQyHaVq9iERXCR8WqQ":{"text":"Superior is one of our favorite places.  It is always fun and happening!  The top shelf ma","useful":0,"cool":0},"pxK6__mMWKQaiNrigJe57A":{"text":"One of my favorite restaurants in New Orleans and a great place to get Margaritas (but of ","useful":0,"cool":0},"OMqUdH0ZhF1o8d4jWMtnQA":{"text":"First I highly suggest sitting on the patio it's gorgeous. The brisket and duck flautas ar","useful":0,"cool":0},"WA65dZyAKNRjg2MuzxsJNg":{"text":"Small portions for the prices at a large party. I had the three meat fajitas. The food was","useful":2,"cool":1},"dt4Wwi23GutV14bkCPaf9g":{"text":"The only reason this place gets two stars is because of the wonderfully friendly waitresse","useful":4,"cool":1},"q7rH8mpl54hSrEhmT5RJ7Q":{"text":"I'm a former Houston resident who lives Uptown, and Superior Grill fills the void for Tex ","useful":0,"cool":0},"yWrztb08lYmUUjLPT4HHFw":{"text":"I have always found it interesting the love/hate relationship that New Orleanians have wit","useful":2,"cool":0},"tm5RTItlvabTbp6zWbB91g":{"text":"in the top 3 best Margaritas in the city. Being a native Texan where we eat mexican food a","useful":0,"cool":0},"uWbfT3nXD6OQ_waLwUuVjA":{"text":"AAAHHHHH! Superior Grill. This is, by far, my family's favorite place to eat in New Orlean","useful":0,"cool":0},"SpMWC44FbLjzQhBpNHq1jQ":{"text":"Actually, Superior Grill is an old friend from Shreveport 20 + years ago for us and now in","useful":0,"cool":0},"QDchiPer-oCAhc2c0trKWQ":{"text":"Love this place to the white meat   Only the second time I have been there but the quality","useful":1,"cool":0},"MsdOcJ40RWtuiE83MnlleQ":{"text":"I called the morning of and made a reservation for 10 people, 9 of us showed up at our res","useful":1,"cool":1},"m8qxknw9kmNY0UC6H2rZZw":{"text":"Was there with a large group for the LSU. Great time on the patio, but there was too much ","useful":0,"cool":0},"jeJVqbfJr96loZlv1WI8wA":{"text":"I'm going to break my visit down into two parts, pros/cons. \n\nPROS!!\n1. Food was okay. Not","useful":0,"cool":0},"sDif8EjApIl5-I9n-MgZcg":{"text":"Hey look man..I'm from San Antonio. I can eat at a different Mexican joint every day of th","useful":0,"cool":0},"D7gdKNYOy5RIFUbpv8CrCA":{"text":"Wednesday margarita deal is great! Come on Wednesdays for 3 for 1! That means 3 for 1 marg","useful":0,"cool":0},"zSQbTcFv_BlY4HE_9oI2aQ":{"text":"Because I was feeling like having a light, healthy lunch the other day, I ordered a big ba","useful":7,"cool":5},"Ur27vg313cvZRYHovE2bQA":{"text":"At one point when I lived here before I would have given this place 5 stars.  Things have ","useful":0,"cool":0},"U0QatrV4C-LVjPcl-dCAEA":{"text":"Surprised Superior has only 3 stars - and that i previously gave it three stars...but i gu","useful":0,"cool":0},"2HqoEZPSjgVCKZAnusDxbg":{"text":"Have been here a couple of times, both times with large parties. We came on weekdays durin","useful":0,"cool":0},"PM7NOnY7ZjNCBuu8yh5Oxw":{"text":"Superior has pretty run of the mill tex-mex. They have a few surprises on the menu like a ","useful":5,"cool":3},"EbCmavwJ7Nr8DF_6lZfsIw":{"text":"If you're going to call your product/restaurant/website \"Superior [Whatever]\", then it lit","useful":8,"cool":2},"eRaJOR3vmARP5Q1VGvK6cg":{"text":"It was a packed night with celebrations, filled bar and lots of activity ...but the staff ","useful":0,"cool":0},"9g7ZlTdO3UYqefV72wD4sw":{"text":"I've never been a fan of this place other than their ceviche. Food is expensive and medioc","useful":1,"cool":1},"KBtM8GbJb9DAIHCOzSgLDw":{"text":"Superior Grill is a fantastic location for any group event... birthdays, book clubs, hango","useful":2,"cool":0},"ef7TUJodLyNTUwVMWLXFGw":{"text":"My friend is was served tainted meat and threw up. It would be nice if they served untaint","useful":2,"cool":1},"2lm27Z7FF3Qhu5USXnumFQ":{"text":"I like Superior Grill, but don't love it. Their margaritas are good but not worth the pric","useful":1,"cool":1},"Iu26LUr2mSzouc2htoOolg":{"text":"I'd give this place one star based on food alone, an additional star for my margarita.\n\nI ","useful":1,"cool":1},"bLILfzWNg1soP0s8y5brTA":{"text":"This place is a super fun and casual meeting place for my friends and I. The food is great","useful":0,"cool":0},"yKrk41PXrBPM7cRyYkVqdw":{"text":"Superior Grill offers amazing service, food, and margaritas, and has an atmosphere that is","useful":0,"cool":0},"sFZ8z5mt3giwPL1s2O6GXQ":{"text":"Family friendly, delicious margaritas, yummy queso and solid tex-mex fare. Try the fajitas","useful":0,"cool":0},"iUZYuJsA6OY_PA_vIu8_rw":{"text":"The place has mediocre food and is crowded with douchebags from Jefferson Parish, who are ","useful":2,"cool":3},"0QEk_ApS5Smtd1A3uQwqxA":{"text":"My experience with the waiter last night was so bad, and I don't understand why our waiter","useful":1,"cool":1},"GM7Bzwt0mf8YvNnKgdrBNw":{"text":"My favorite casual restaurant in New Orleans. Great atmosphere, great food and lots of fun","useful":0,"cool":0},"LzHp2nfZs5Dr4KtvPE1C7A":{"text":"Their menu says \"famous for fajitas and margaritas,\" and that must be all that's good ther","useful":4,"cool":2},"9Y1-sXtXzYME0n7U6fHvrg":{"text":"The staff was great, the portions are large, I hear the margaritas are delicious and the p","useful":2,"cool":1},"9YFuk9yk0qLFt2iARQGtsw":{"text":"I've been here twice and both times were ok. Service was good both times, but the experien","useful":1,"cool":1},"gjavHo2ao2IGvShWOZ5Uyg":{"text":"I found Superior Grill is be pretty \"MEH\"\nFirst of all, it is kinda overpriced. Yes, you g","useful":1,"cool":1},"RBAeNB_tSoLoW69eyCP9tw":{"text":"If you've lived Uptown for more than a week, you know about Superior Grill. This place is ","useful":4,"cool":2},"u4jvN7sYrGeYpm6TqqvLzA":{"text":"Superior Grill has a nice exterior and a beautiful, nicely decorated, classy interior. I o","useful":1,"cool":1},"7xt41SML40D3rgQFECcLKg":{"text":"So we stopped here to see if they really did have the world's best margaritas.... the marg","useful":0,"cool":0},"3_T5kue5uo2FwhxIn8nV-w":{"text":"I am a New Orleans local (live in the Uptown neighborhood) and have gone to Superior Grill","useful":1,"cool":1},"IgZipE4bDgWsU8BTQtgqEg":{"text":"Superior Grill is absolutely one of my favorite places in the world!  It is a NO-BRAINER w","useful":1,"cool":1},"HxyEZ9XIYk8vvhORQa3lfg":{"text":"Catfish tacos off the chain ... Margaritas off the chain .. Dont miss this spot when you c","useful":0,"cool":0},"VDspbapucnfGFwquBBdReg":{"text":"I had quit coming here years ago, but boy is it back to how delicious I once remembered it","useful":0,"cool":0},"E1fvU7629evweZKcICtAwg":{"text":"I swear by this place, and have been there at least 100 times. Its fun, festive, family or","useful":2,"cool":1},"FqBZOAlnyCmBRxBjNDkTaw":{"text":"This really is the place to go when someone else takes you there or you're meeting there. ","useful":15,"cool":18},"og624a2TQuZWwTR4HMJjLg":{"text":"I hate to be Debby Downer here, but I have several complaints about Superior Grill. First,","useful":1,"cool":1},"rl9tnssh4z7eFeRmcnVIpA":{"text":"This is one of my favorite restaurants in New Orleans. Take it for what it is, don't compa","useful":0,"cool":0},"kDmb3VnIjaLPUtYBY-RfIg":{"text":"So so food and poor service! I came to the table late and my friends had ordered, so the w","useful":1,"cool":1},"wl_qyfRiBQBq7pf-Cko8PA":{"text":"I came here at 11pm during Mardi Gras and I am very impressed by their excellent service d","useful":2,"cool":0},"ViHy64FHPLn01tDWukw82Q":{"text":"Festive, friendly, clean atmosphere. Service is outstanding. Amazing drinks. Best of the b","useful":0,"cool":0},"N1x6B55yQcpm29vIO6YzqQ":{"text":"Fucking disgusting. The guac is made of a green substance that they would like to pretend ","useful":0,"cool":0},"zs3TdggqArkfAufoGfJssA":{"text":"Horrible, over priced and very small portions for the price... dam near $20 for a dinner s","useful":2,"cool":1},"clZcrff52P7nzZWS8lPHOg":{"text":"Best queso in the city for sure. However, the rest of the food is mediocre. Great margs. I","useful":0,"cool":0},"srVZ4QleSigabrgMv9z6Cw":{"text":"I would say that the 3 stars this restaurant has overall is more than fair. I personally g","useful":2,"cool":1},"TSxhG-vc2OTx9jH5LqUY6Q":{"text":"I'll rate the food five stars, and the margaritas are great. If I had to say anything nega","useful":0,"cool":0},"rNKNDLGDQbMaDio9WhWBbg":{"text":"So like... I don't know.  \n\nI've been ~ 5-6 times. It's really hit or miss here. Sometimes","useful":2,"cool":2},"Cm0oTDcfvMwkbNvf8voZ9Q":{"text":"the food is great the service (when its not busy is ok) when they are busy SAVE your money","useful":1,"cool":1},"wgFvo87Ex0i35wrBPU15jw":{"text":"I went here last night with a couple of work friends.  It got off to a shaky start when th","useful":0,"cool":0},"Hs23GaoUSQZ7TUVlRSqwjg":{"text":"Superior Grill has been a staple in my life for many years, (even going back when it had a","useful":2,"cool":2},"8vQGe1Lb-ciDVM2fhqvqPw":{"text":"Oh Superior Grill, everyone has heard of it. Whether good or bad, good if you are a touris","useful":1,"cool":0},"KFfgoffn8tcsUJNTGr3PFQ":{"text":"I'm giving 3 stars for the service, the food would only be 2.   There were four of us comi","useful":0,"cool":0},"PY8v_08sxCUp2RDMwQjYqA":{"text":"My boyfriend and I like to call this place \"Inferior Grill\". The one thing about it that d","useful":2,"cool":1},"rCZ9mAQpXjIAGN8lieF7yg":{"text":"My family and I walked all over the beautiful garden district of New Orleans for a long ti","useful":20,"cool":12},"hqsDMVvFxskimA6rN0JD_A":{"text":"WOW!  I was somewhat shocked to read all of the terrible reviews of Superior!  I eat here ","useful":0,"cool":0},"2bspHYVFI-8NC74ZP4-6Cg":{"text":"I'm a semi regular patron and I like the food and the portions they serve. The atmosphere ","useful":0,"cool":0},"CprwETZJXHc1XsoLacEsZw":{"text":"I did not go to New Orleans for Mexican food.  We ended up here by default because several","useful":0,"cool":0},"vWmIUZkyQDkaLrEVKzUnqw":{"text":"We ordered the shrimp fajitas and it came with about 6 shrimp sitting on top of raw onions","useful":1,"cool":1},"9A4m-zKYR_J3M74ZQD71OQ":{"text":"The food was amazing.  Table side guacamole was yummy.   We tried the enchiladas and the A","useful":0,"cool":0},"dk4uFNRbBlk0vTAvT_yqzw":{"text":"This review is strictly for the margaritas and happy hour. Superior is my favorite place t","useful":0,"cool":0},"KpZGy7vpofrusjbKBYw1og":{"text":"Superior Grill on St. Charles Ave in New Orleans is a great place for groups and families ","useful":6,"cool":4},"ejSX3MKEuccTKllx2pYDcg":{"text":"Not sure what all the hating is about here. This is one of my favorite places in the city.","useful":2,"cool":0},"DoHZnS8BYGI8x83NBjnTbw":{"text":"Very good Mexican food. I really enjoyed the crawfish quesadilla. They keep your table sup","useful":0,"cool":0},"4F48cx3WWmqXaj4PZPpThA":{"text":"The margaritas are very strong (a double is standard).  You only need one, and you should ","useful":2,"cool":0},"kZwd1ysusLRcz1CyygWimQ":{"text":"The food could be better for the price. Their margaritas though! Welcome to party town. Th","useful":0,"cool":0},"G-S34ZZunOSdoruTCdV8Pw":{"text":"Overpriced Overpriced Overpriced! Wow this place is way too expensive for the food you get","useful":3,"cool":1},"vU7sdh8Rw3t_qv5CwUsH1w":{"text":"Happy Hour here is the bomb I enjoyed a few margaritas- the quesadilla was also decent. I'","useful":0,"cool":0},"pP55oVVyvva7X2TmhxzQTA":{"text":"3 stars out of 5. Service was great , interior was nice , good vibes . Here is 3 stars . F","useful":0,"cool":0},"ZL4Qmq2XtJsMlSEc-YNgug":{"text":"I really wanted to score this place much higher, but I just can't.  I'll hit the highlight","useful":5,"cool":3},"vrR_h-x7apYxMPXNA7ygOQ":{"text":"Not the greatest experience. Our waiter got super irritated at one point, became hasty and","useful":2,"cool":1},"QVutsbSthHXp5cKA7Xn-Pg":{"text":"So-so margaritas made with cheap tequila and LOTS of sweet and sour mix that kills you the","useful":2,"cool":1},"viS8yqTMwgu1nE_qPnDcSQ":{"text":"We had such a great experience here. The manager Tony went out of his way for us. I have p","useful":1,"cool":0},"1jgf3MU9Ht4LBM9DVyVTXg":{"text":"I have been going here for years when I'm craving Tex/Mex. And since the pandemic, it's on","useful":0,"cool":0},"VIPU7ZJ3WVq72wTjdGC2xg":{"text":"Horrible!! Terrible service. Took 15 mins. to be seated and there was nobody else waiting.","useful":3,"cool":1},"kuUt8c_YOzphI8wMoE1Q-Q":{"text":"I love coming here since its near my campus. I am obsessed over their endless nachon and s","useful":1,"cool":1},"nwUAPUDYUDXxmLtgrB-clA":{"text":"Personally I come here for the drinks and not so much the food. Regular Mexican food nothi","useful":0,"cool":0},"HmktWJgUvCnHGfUNn2GzJA":{"text":"My experiences with Superior Grill have been hit and miss. The first time I went here was ","useful":2,"cool":1},"lanGhudvvxZc09nqF5e6sg":{"text":"Margaritas & queso is all you need to know. This is definitely one of my favorite happy ho","useful":0,"cool":0},"9FdwhUcvwKp1gsrka_DqYg":{"text":"For some reason, this place has a reputation as an awesome restaurant that serves great me","useful":1,"cool":2},"Crr8Rtrqx8XGSMNOa2_kfA":{"text":"I will never in my life eat here again. I went into superior today to get some lunch my se","useful":1,"cool":0},"s9WM4zA7Lh0ocnRCTbuv2A":{"text":"So I fell for it again and that is my fault. I needed more data than my first experience b","useful":0,"cool":0},"dxLp7SYfdVMVcF4ipAYTlA":{"text":"Love this place, sometimes can be hit or miss though..chips and salsa are always the best ","useful":0,"cool":0},"xXXLuj0ervGR3Chq6MOgoQ":{"text":"The best thing about this place is the margarita Wednesday special. The service is extreme","useful":2,"cool":1},"_JMXOxCgYN6JIdEwXQtxzQ":{"text":"Some of the worst Mexican food in NOLA. Overpriced drinks. I'd rather eat at Chilis. \n\nFor","useful":1,"cool":1},"Rq5oxmetCdmTSe18aFjSvw":{"text":"Hatch Chile menu! Excellent choices! My pescado was amazing too! Top shelf margarita hit t","useful":1,"cool":0},"z13M_4YCYJwfD9sFYe5WMA":{"text":"I have only been here once.  The chips & salsa are good, but I won't be back because of th","useful":2,"cool":1},"4qJ6sxhUGNm8raykJftIIg":{"text":"Got the lunch special, BBQ chicken and potatoe wedges, which was not delicious. Also, some","useful":0,"cool":0},"spuWTt7lPNmOCgQ-JfbPaA":{"text":"Drinks are good, food is terrible. Had the worst tacos I have ever had, and I lived in Tex","useful":0,"cool":0},"XuJi6Q62VadXZvsskKGS3A":{"text":"Overly expensive, food was not good, service was slow! Definitely good for just a margarit","useful":2,"cool":1},"EHA6-Tn2oaXQjQ1HW_3Cew":{"text":"Superior was the first mexican place I tried when I came to NOLA. At the time I wasnt too ","useful":1,"cool":0},"_O6od6ZnnF0K94DVNqV1Tg":{"text":"Perhaps the best Black Bean soup I've ever had. Lots of variety on the menu, including gre","useful":0,"cool":0},"ICYe1oPlzbrzxfLkFutTDw":{"text":"Superior Grill is a staple semi upscale Tex-Mex restaurant that has most of your tradition","useful":5,"cool":4},"Rh0Sh5ZPbPo5qQLQGdEy2Q":{"text":"Meh...that's all I can really come up with. It's a good place to go for happy hour to drin","useful":1,"cool":1},"UFEl3tEGSGd5tfmVtcTUOw":{"text":"We are long time fans of your Shreveport restaurant and hoped that our first visit to the ","useful":1,"cool":0},"bn9o3oa1Vy-dw53g_Fv-ZQ":{"text":"OK..... Superior Grill may not be actual \"mexican\" food but who cares!!! It is good food w","useful":1,"cool":0},"Kf7fNBUGibi9pYlMZON2-w":{"text":"Let me begin with the fact the New Orleans is still in need of a great Tex-Mex restaurant.","useful":1,"cool":1},"wNNgxRaJAmFgszYqqKYtVA":{"text":"Bam! Second trip here while visiting friends in New Orleans. Great Mexican food and top sh","useful":0,"cool":0},"1FeVpigdKuN2H8cSgggAsA":{"text":"I've wanted to check this place out for some time now. I've heard good things about it. Up","useful":5,"cool":2},"K0oCodWJRTayGM6JW8FPqg":{"text":"Cheryl, our server, and Stephen, the Manager, took outstanding care of our destination wed","useful":0,"cool":0},"kymlwvvWT8blPX1wrEE5DQ":{"text":"I should give this place a zero star. But anyway. The fact that i ordered a margarita and ","useful":2,"cool":2},"f-zpnysx6s84vPExfB98og":{"text":"THIS IS NOT SUPERIOR SEAFOOD. THIS IS A TEX MEX PLACE. I am surprised they haven't been su","useful":2,"cool":1},"QtzGJ5R3ut3sdCVuKd6GqA":{"text":"The wine was pricey for less than 6 ounces for a glass, the taco salad was in a stale flou","useful":2,"cool":1},"ctDMA1oWf0IUk2dxT46WSQ":{"text":"The most superior thing about this Tex/Mess was the attitude of the staff when confronted ","useful":1,"cool":0},"KCDtqnUA0V60osSsqqHhRg":{"text":"This place was popping when my group of eight arrived on a Saturday night.  The wait was a","useful":0,"cool":0},"-IDLKilV4YlyT6Zkn2f4uQ":{"text":"The food is okay. \n\nThe margaritas? Dangerous. Tastewise, they're good not great. Drunkwis","useful":0,"cool":0},"eSQxUfaIA11TYSo7lsv0eA":{"text":"eh. nothing to write home about. Gets really busy, so be sure to get there early to get yo","useful":2,"cool":1},"2_h1ndUmNbmxC1CtuHUe5w":{"text":"food is blah but margs are good and it's close to my house!  i do enjoy superior margs dur","useful":1,"cool":1},"3DGbiupAYKNMk5wteYD0Wg":{"text":"I guess this is \"Mexican\" food in New Orleans, if you want to be really liberal with the \"","useful":3,"cool":1},"DI55eM8-aINg5RVbmJ-RBQ":{"text":"Margaritas were strong but NOT GOOD. Think this is popular with the college kids who want ","useful":1,"cool":0},"u175bwWfFzTWV4xUy7nabg":{"text":"I qualify this as 4 stars for Louisiana Tex-Mex because I compare it Lupa Tortilla in Texa","useful":0,"cool":1},"iZQ28K4pWYMFx9nzBFU3jw":{"text":"Superior is....good.  I wouldn't go so far as to say great.  I've been going there since I","useful":1,"cool":1},"pzyiSXtKK14_PnuQQvWi3A":{"text":"My one and only experience at Superior Grill is probably a little more unique than the typ","useful":1,"cool":1},"btPsRTIfxUFBTv2MHd8T7A":{"text":"I'll keep it short.  I got food poisoning.  Wife ordered Lenten special shrimp nachos whic","useful":0,"cool":0},"UEZGPqXKLtpBkdNvgIoJDg":{"text":"Crappy fajitas that are dry with no flavor. Go for drinks and a lively atmosphere, the foo","useful":1,"cool":0},"_MZzMDURQ4siOWYRiVxUTQ":{"text":"During normal times Superior Grill USED to be the \"go to\" Wednesday party place for Uptown","useful":4,"cool":3},"VjycEsnd-Nma8wpYbV0c6g":{"text":"3 for 1 drink special on the margaritas! Fajitas, burrito and tacos were great. Our waitre","useful":0,"cool":0},"w0TuVHYvOyGGPCrSaVhqnQ":{"text":"What the hell?  I'm convinced that this place pipes in some kind of mind-control gas and t","useful":5,"cool":4},"bSXsAfjU9qxYkDxBvIWdxA":{"text":"Very cleanly with all the new guidelines. A little pricey but that was expected. The food ","useful":0,"cool":0},"FGrxb3GGfVkyNLSu-nclyA":{"text":"I love this place mostly for their Superior Margaritas which are huge but deadly. They're ","useful":1,"cool":0},"RXLsDJnr7L54MEvkHjvROw":{"text":"Went here because we stayed at the Best Western adjoined to the restaurant and the great r","useful":4,"cool":2},"n0lvsOfG3wJDPXp0JJU8Bw":{"text":"Good food, good service, great drinks! I love their swirls.","useful":0,"cool":0},"8QsfLW1cjNWInRogzZJtqw":{"text":"Went here for Cinco de Mayo.... regretted it... This place used to be great; but, the past","useful":1,"cool":0},"nz_OWyu-vapAe4GxDAym_g":{"text":"There's apparently a certain crowd who loves this place so i gave it a try but I just don'","useful":1,"cool":1},"DFYmUhM0Pk22lRq1cGCjTQ":{"text":"Right on st.charles and a literal step off the street car there's a glorious place which s","useful":2,"cool":0},"e6koTRcxLNZj0T5RrK75NQ":{"text":"Overall not a great experience. Our margaritas tasted like what you'd get at a dive bar. T","useful":0,"cool":0},"HsSgjUh5QhJNFUgkuO_sLw":{"text":"The chips were stale, the fajitas had steamed vegetables with no added spice. The tortilla","useful":1,"cool":0},"QQ9UltWKZSrjKwro70kZRw":{"text":"Came here during a parade week before Mardi Gras basically cuz it was the first place we s","useful":1,"cool":0},"nAOSrvvNIiUNkKVMxTnRYg":{"text":"Superior Grill is a Tex Mex style restaurant in the heart of St. Charles Ave in NOLA. It's","useful":1,"cool":0},"9lgTzuCGW6rh1-5oPoCCtA":{"text":"Went out to dinner with a group of friends last Saturday night. We made a reservation so w","useful":1,"cool":1},"19v9KJmcSdqf0zcoiZrIUg":{"text":"Food was good.  The service was better than normal.  My wife's margarita was below average","useful":1,"cool":0},"C0oVu12StH1Fgjji-2z27A":{"text":"Food was just fair.  Lots of it, but bland and not very interesting.  Service was only fai","useful":0,"cool":0},"9xf-kCHTCKz1U32qnm0BiQ":{"text":"I remember going to Que Sera when I was little.  Not that the food was great or anything, ","useful":3,"cool":3},"qCXc8ywIVBtg1gfnlPTp-w":{"text":"This place has the worst food I've eaten since moving to NOLA.  I ordered ground beef taco","useful":3,"cool":1},"hh2vAs4zGcXftVtvX-JnWw":{"text":"Like many people, I have celebrated pretty much everything with a meal at this place. No, ","useful":0,"cool":2},"ssxKQpKEemToRYA6CoR-rQ":{"text":"OH MY, IS EVERYONE UPTOWN HERE?\nI've read the negative reviews for Superior and aside from","useful":5,"cool":0},"MAAMpQzSYEGc0_5QoaQlcA":{"text":"Went here last night, we ordered a plate of fajitas and a burger/fries. The fajitas meat w","useful":2,"cool":1},"IX3TbmsUVirJftFoLvsAdg":{"text":"Great restaurant anyone should try, a lot of variety of good quality and excellent taste o","useful":0,"cool":0},"VhmYAF4TkI2AOur5gl6irA":{"text":"Good food. Good atmosphere. Friendly people. Parking sucks but then again parking issues i","useful":1,"cool":0},"h0yLDMGICZoHEhs5EApWTQ":{"text":"Inferior Grill seems more appropriate, my second trip here was my last.  LOUSY service:  l","useful":1,"cool":1},"1lCodIMYJdoXNHbPdXFrOw":{"text":"Shady! First- the service was subpar, server was very slow. Second - shady activity with t","useful":3,"cool":0},"s2rsBLDupK3SPL2RvP0BOA":{"text":"This place exemplifies bland, high turnover, thoughtless. Tex-mex food. The margaritas tas","useful":0,"cool":0},"LGge9c-Qm_7gy3hXV-sgVw":{"text":"I have been eating here since the early 2000s and I have yet to be disappointed. I try to ","useful":2,"cool":0},"JWRpMwtWEL1DGb0yOnKFjw":{"text":"Gross!!  Everything about this place is disgusting.  The food are not good at all.  The wo","useful":5,"cool":2},"-T4VKDXcr0d1Md-wn4x2Sg":{"text":"Slow Tuesday night and we sat at our table for 8 minutes before the waiter took our drink ","useful":2,"cool":1},"4sCq8opuApTDfH6PKtyi9w":{"text":"First off, make sure you are going to the right place. For some I'm certain logical reason","useful":3,"cool":0},"Riea7zkIjhEAGDjOa-hR4A":{"text":"3 is an accurate rating. If you're a local I would say it's okay to eat here. If you're fr","useful":1,"cool":0},"lzdG4joswM283-YYwAuw9A":{"text":"This is my favorite restaurant in New Orleans! I even had my baby shower here lol, and it ","useful":0,"cool":0},"SF3-2Gdq7gBELk2VdFxC_A":{"text":"Service sucks\n Slow and inattentive.  It's a sports bar serving Ted med. Not great food ei","useful":2,"cool":1},"6kpV6bCkWLCwius0iJwyTw":{"text":"3 Stars on Yelp so my 1 Star fits the pattern. Now it makes sense. The food is decent, ser","useful":0,"cool":0},"zifWIRPhR-3Tyk5zZN8-GA":{"text":"One of my favorites on NOLA. THE FOOD NEVEER DISAPPOINTS! My dinner of ahi tuna tacos was ","useful":0,"cool":0},"rHP-cw85MFXf0szxApEl5w":{"text":"I can't say enough good things about their margaritas... so yummy! The food and service we","useful":2,"cool":1},"Cotaoya4XgqYfJGBK6uNwA":{"text":"I think my favorite part about this place is the frozen margs. While the price seem high i","useful":0,"cool":1},"uekCnXzBo1uRda29hHmUPA":{"text":"This is one of our \"go to\" spots for Mexican food. We love the steak nachos and the guacam","useful":2,"cool":0},"Na9svmv0LWN-p68OnRKPFg":{"text":"I've been here so many times and the two best things are easily the frozen margaritas and ","useful":0,"cool":0},"fmH3rpBFyG7V7H8xr-DIWA":{"text":"Had occasion to go to SG for a quick snack a few afternoons ago.  I had a half size order ","useful":0,"cool":0},"nKZIe713WPnZat8ecQmT9g":{"text":"I'D LIKE TO USE MY TIM GUNN SAVE\nAfter 3 years back uptown, Superior Grill has proven to b","useful":7,"cool":4},"ChSPGK7JJmcJDjaL-T-wwA":{"text":"I recently went to this restaurant and my total was $11. I check my account today and they","useful":2,"cool":1},"9HIW8g4aJQ2vhqZDIWlKCQ":{"text":"No lie, I love their margaritas but their food is ridiculously over priced for what they g","useful":2,"cool":1},"EtPhvEONFN3risLCNSOqSg":{"text":"Service was awesome. Margaritas were not. Food was not. Attaching a picture of the $20 \"sa","useful":2,"cool":0},"VQUGTtd3__iJVermCMy_RQ":{"text":"The best Tex Mex I've had in New Orleans.  Was a lot of fun, the food is good as are the m","useful":1,"cool":0},"8__5vqFcOpVoLj1uCjyhIw":{"text":"They never miss.  Food is always fresh and hot.  I can eat there once a week.  Service is ","useful":0,"cool":0},"PzBELKTOFx4oFL5iVDUb_A":{"text":"Wasn't expecting to enjoy this place but the crowd was very cool. Get here early because F","useful":1,"cool":1},"E8eapVyejY59qYvJzQkHLg":{"text":"Had to change my review after going back today for some reason( I may be a glutton for pun","useful":2,"cool":1},"7YVK5pr3E7SrGp7aHweYYA":{"text":"THE ULTIMATE UPTOWN LOVE/HATE RESTAURANT\n\nUnforgiveable Hate #1: \nIt is about 33% over-pri","useful":7,"cool":4},"q0sICOLMKXP4LY4hdoUWeg":{"text":"I struggle with this one. I really like Superior. Mostly the atmosphere and Margaritas tha","useful":0,"cool":0},"lmBVFTTX6fRwguwYDjibsQ":{"text":"We had Saturday brunch here and loved it. The portions are HUGE and the bottomless drinks ","useful":0,"cool":0},"APN2N7Zz64U2NlFkjkjAXA":{"text":"From a friend's recent experience: \"In my 20 something years being out of the closet have ","useful":3,"cool":1},"jueW7Q54lTpm8xZhVgSydw":{"text":"I think the price exceeds the quality of this restaurant for the majority of their entrees","useful":1,"cool":0},"9qFNyOvqc1evvFwjw96Iuw":{"text":"This place is really great. It can be a really fun bar night with your friends, or a good ","useful":0,"cool":0},"zR1-To8HayiFD8fjHUcyHQ":{"text":"First of all, we came here to drink - and the hostess/waitress was not having it.  She gav","useful":4,"cool":2},"ej0Rvu8b_ZL7Hwx3BlD25A":{"text":"Used to be really good but gone downhill quickly.  Brought wrong food to our table replace","useful":2,"cool":1},"79Va2CY_uixBZMjM44oIeg":{"text":"Korean Lettuce wraps at a Mexican restaurant..... I was intrigued, curiosity peeked, wonde","useful":0,"cool":0},"H_W5E6736sdwEyGvugLKMg":{"text":"If i could choose negative stars i would we had a reserved table for 12 and after half of ","useful":0,"cool":0},"RRkCWhJg_41aor0DQRExDA":{"text":"I can't believe I haven't been here before!\nMy daughter brought me here last night to try ","useful":2,"cool":1},"lrfxxfc99FzQ8qygpJs7Qw":{"text":"So I love Tex-Mex. This place offers up fair to good. It has good fajitas and drinks. Im s","useful":0,"cool":0},"513i9drYte8oPoEipBcDKw":{"text":"I love the atmosphere - it's very welcoming and perfect for eating out with friends + fami","useful":0,"cool":0},"T23_nt9pfFKMtK0_dUTTNg":{"text":"SOLID PLACE!!! Not from around here, so there food was absolutely amazing and there all yo","useful":0,"cool":1},"hagYq0anmfRNvekdFbuQzg":{"text":"Good place to go with a large party (they are pretty accommodating, I've been here twice f","useful":2,"cool":2},"zEPkicSkqLrX8VWQ7WtrwA":{"text":"The food is very mediocre Mexican inspired dishes. The real star here are those frozen con","useful":9,"cool":5},"pIZ65zvVgvoZKDDWBUat6Q":{"text":"A large group invited me to join them for drinks at Superior - what a great Friday happy h","useful":2,"cool":1},"YPWAVDPBYYZrkURxhXTIeg":{"text":"My roommate and I live just a few blocks from this restaurant and we frequent it for sure!","useful":0,"cool":0},"_0NpsKTm6WZvzH6zH0OMdQ":{"text":"Not bad, but nothing special. This is pretty average Mexican food. The chips at the beginn","useful":2,"cool":1},"hfVWVyRimo4z9eJCYS9n8A":{"text":"Good food and Good service.\nThere is Definately room for improvements.\nFood was a little o","useful":1,"cool":1},"DIjEPmHQznqsmCWUwe6-kQ":{"text":"Overall, this place is probably more like a 3-star rating but the salad I got had steak th","useful":0,"cool":0},"50K_c7p-2KQm37KMvY7fOw":{"text":"This was a fantastic Mexican restaurant/bar to visit during our stay in New Orleans during","useful":0,"cool":0},"sX7xQlyhiRxBFmiSM3mFaQ":{"text":"This place has a fond place in my heart. \n\nWhen I first moved into the neighborhood Superi","useful":1,"cool":0},"elrFET5JmprJBANI8qUi1w":{"text":"My wife and I have been here before several years ago so feeling safe we returned this eve","useful":1,"cool":0},"CW4LPUuG3iOQE6JPpDm3vg":{"text":"Great food, great atmosphere. I've been here for several birthday dinners and leave only w","useful":0,"cool":0},"e1-rTEhCI9dLEhdvtDsdTw":{"text":"Great chicken quesadillas and margaritas. If something is not up to standard, they will re","useful":0,"cool":0},"ksjNwrWLtPvV6rleshqI4Q":{"text":"Horrible. I went for brunch and the food was inedible - eggs overcooked, tortillas heated ","useful":0,"cool":0},"XxEsZyIEA7EvlSyZ8lEXEg":{"text":"Though not obvious from its name, Superior Grill is Tex-Mex with few surprises.\n\nClose you","useful":4,"cool":3},"d8IvuE0hkyesOEBLadCO-Q":{"text":"Ordered a large queso and boy oh boy was it LARGE. The shrimp quesadilla and chicken and s","useful":1,"cool":0},"348D8QtyuNQXf6HUrus-iA":{"text":"As far as Mexican food goes, this place is just meh...not terrible but definitely not grea","useful":2,"cool":0},"6PBQTCLEMJN4swnB77V67Q":{"text":"Awesome , great, amazing WE LOVEEEEEE ITTTTT!!!!!!! \nThe service , the food!!! Everything!","useful":1,"cool":0},"fSvuUMmoBeff-5l3ttMSSg":{"text":"Ordered a top shelf marg and could barely tolerate drinking it. Food was less than stellar","useful":1,"cool":0},"9sZygnivfj6CkZfd7ETK1w":{"text":"The highlight of our meal was their margaritas. Strong and well mixed but in terms of food","useful":0,"cool":0},"xBnm49zJIJ870arVa-GRFA":{"text":"Best Mexican food in the area.  I have ate at a lot of the others.  Food is incredibly fre","useful":0,"cool":0},"9x-fV6dBixdRKBc-wOrq_w":{"text":"This is okay.  It's in a great area and has a great dining area with a fun bar, lots of pe","useful":3,"cool":1},"6xBQrkgy6oW80-bt95YSSg":{"text":"Service was fine the host was dry like she didn't want to be there but the waiter was good","useful":0,"cool":1},"fK5TZ2MAoxvXXXT71AjV5A":{"text":"Superior Grill is one of the places you go to because someone brings you.  The margaritas ","useful":13,"cool":4},"9-UfpuA16jtyEaZRw1Tqnw":{"text":"A very Tex-Mex spot! That is middle of the road enough that a variety of people can enjoy ","useful":1,"cool":0},"HvZLRBCfJt7M4mbwXWSqtg":{"text":"I have to say that this is one of my favorite places to hang out and chill with friends wh","useful":1,"cool":0},"fhmxNCvPVmf83LPPvbdLGQ":{"text":"I used to frequent this place all of the time before Katrina. Since then, I've moved to Ho","useful":1,"cool":0},"V9NnLTVCyecDioioYMPQ1g":{"text":"4 stars because it's always a good time at Superior Grill, but the food really ain't all t","useful":1,"cool":0},"l1nkFYkFwKtvn5KSJvThsQ":{"text":"Everything was incredibly bad.  1 star because the tortilla chips didn't taste like chalk.","useful":1,"cool":1},"l7vLudIBzPn0kdYm2pim5w":{"text":"So disappointed. Decided to order my husband's favorite food TexMex, and use a gift card w","useful":1,"cool":0},"NkRDEY-l2wQeaJe_OaZKMw":{"text":"Confidently next door to St. Charles Inn, we are here the day we checked into the hotel. R","useful":1,"cool":0},"1QYHkYXUYjZx1MkH_b6AAg":{"text":"Chips are light, taste exactly like Chevy's.  Salsa tasted like Chili's.  Just weird.  I h","useful":1,"cool":0},"lmr1BZbS5XTAQvG1BdYnfw":{"text":"Standard Tex/Amex fare nothing great but not bad either. Huge portions, even my oversized ","useful":1,"cool":0},"nvPPThbLGwqSb-lmkEGxbA":{"text":"So disappointed in my most recent visit to Superior Grill. I've been dining here for over ","useful":4,"cool":0},"KbyKMiz4gQt3c6AOAnGXNw":{"text":"Wow where to start,arrived on Saturday ordered tacos the ground meat actually was a cranbe","useful":1,"cool":1},"vW5fsxKEvLMX6RkFmC4Rkw":{"text":"The fajitas are a rip-off. Don't waste your money here. We ordered the steak and shrimp fa","useful":2,"cool":1},"5Mx8OCCKii0BcMQvAQybbg":{"text":"If you're from out of town, it's worth a visit. If you live here, though, this place defin","useful":3,"cool":1},"w3UwpRYetzH0_R0QsF_ARA":{"text":"Food and drinks were good, but extremely slow.  Margarita prices are high for this quality","useful":0,"cool":0},"FDq5aeo_n7vPVi5zCtpfBg":{"text":"Me and my girlfriends family went here two nights ago for mothers day. We were initially g","useful":2,"cool":0},"Q-ni5PZhB1T1DaQlnlSbeQ":{"text":"Ordered the biggest nachos they have and the largest quesadilla for my wife and I to split","useful":2,"cool":1},"eCqxRFDGJCZNYZC_qR6HHg":{"text":"This has got to be the worst most overrated overpriced Mexican restaurant in New Orleans. ","useful":2,"cool":1},"g40E6PCP0hEnscRdRQIeYg":{"text":"I've ordered a couple of times here and I always get the grilled chicken sandwich. Idk how","useful":1,"cool":0},"HymlKF9kP95TeE3LKFr8BA":{"text":"Poor service, pieces of ?broom in my salsa, and burrito was the worst I think I've ever ha","useful":2,"cool":1},"bud76y7I9QzXD4QqDmHojQ":{"text":"Superior Grill is our official drinking spot after a round of golf. The food is fresh, the","useful":0,"cool":0},"BI5bGKHCdgqo6v4HxB9aNg":{"text":"Holy crap! If I want a block of sh*tty plastic cheese with my grey beans and a hi-c with t","useful":3,"cool":3},"rQA_-4xO9GnAcPq18Erv7g":{"text":"Please hire a Mexicano. Good crowd.giid service. Margarita lame,  beans cold. Replacement ","useful":0,"cool":0},"1pq7c1jfseUOrBnuqiQh1Q":{"text":"Yum...love the char grilled oysters and boiled crawfish (limited days so call before you g","useful":2,"cool":0},"wcv5Lu6FZBiHCgKQ1gy__w":{"text":"Superior Grill is a great stop if you're looking for Tex Mex. Servers are friendly and pre","useful":1,"cool":1},"ZpaioS2P-VjG_KQQkZqYUg":{"text":"This place is not only overpriced for what it is but surely needs an update. \n\nWe came in ","useful":2,"cool":1},"dFegtNqsGp9ioo2VJaPsaQ":{"text":"I've been to Superior oodles of times, and having gone there tonight I feel it's time for ","useful":19,"cool":14},"657v8cx-LXBg1zjn0h7q5g":{"text":"Terrible treatment by male \"manager\". Refused to let side door stay open to provide more v","useful":0,"cool":0},"dUT9G51eznENq8yl4_lwDw":{"text":"This is the worst place you can dine at! I paid $65 for 2 persons. I regret not leaving wh","useful":2,"cool":1},"oGJxYejww5v2d9sEi1bPCg":{"text":"My fav! Very, very clean. Service was wonderful and friendly! My daughter and I got the ch","useful":0,"cool":0},"-wTzSHFcpFhDoXiiZ4JPgQ":{"text":"Should be ashamed of themselves. Food is nasty. There are far better places than this. Don","useful":2,"cool":1},"0B11yHgAqMw-pEWXf-BEkg":{"text":"AY CARAMBA! $16 nachos??? No wonder Taco Bell is expanding into the city;\nPANHELLENIC SNAR","useful":6,"cool":2},"CocsqEbLJfjKa8UWFT9rjQ":{"text":"Update:  currently having pretty severe gastrointestinal upset.  Definitely not coming her","useful":3,"cool":0},"UPOjKdrG_YDbIk5I39iOAQ":{"text":"Food was ok and was served warm. We had the worlds worse waiter. Rude waiter that was so r","useful":0,"cool":0},"83h17wXxJ1sFoMCMCtm4Lw":{"text":"Such a fun place to enjoy Mexican food and great drinks! Their margaritas are some of best","useful":0,"cool":0},"j0DDGmrURMUTkaN1Dvs4Aw":{"text":"We love this place and patronize it often. For my son's 5th birthday, they went out of the","useful":0,"cool":0},"Q8btELE9OyYrWHCOg5q16Q":{"text":"Great food, great service.  Solid choice for TexMex in NOLA.  I had the lunch fajitas the ","useful":0,"cool":0},"utrFsvyE-LdXcWne2GJ3aA":{"text":"Place is nice, our server was wonderful! But the food was not like Mexican food to me (I a","useful":1,"cool":1},"2p19c873jd1rptRcjTpPqQ":{"text":"So I had never been to this place but a lot of my coworkers and family and friends always ","useful":1,"cool":0},"QEfq-YjedXDK7YFkFYMBeg":{"text":"In NOLA your options for Mexican are very limited. I LOVED this place until I moved to Tex","useful":3,"cool":2},"aFZXoPQoI8fA98n16KMALA":{"text":"I really wanted to like this place. I've heard such mixed reviews that I wanted to try it ","useful":0,"cool":0},"qcwuxAAQtd0pvvTN4vfehA":{"text":"YELP DIFFICULTIES\nI tried correcting my updated review, then tried deleting but that would","useful":8,"cool":2},"wbJF575r-cEyaVLDd5uYfw":{"text":"Honestly would give it 0 if it would let me. But the dumbass server is holding me hostage ","useful":0,"cool":0},"5LSA0KrzoEsme6YlH77t5Q":{"text":"My queso was cold so I ate it all and ordered another. the second one was cold too. overal","useful":0,"cool":0},"ki4E5Zf7zhGPgWrp2DPwGw":{"text":"We used to love this bar/restaurant \nI don't know if COVID changed things it is not as goo","useful":0,"cool":0},"Fobg_wOS-dwvzb6xms2plQ":{"text":"Picking up Margaritas and Queso to go for National Tequila Day!!! Superior is my place for","useful":2,"cool":1},"PEhvFEidgyZ6gp4lRoBUsA":{"text":"I'm not sure what is up with the Mexican food in this city... but something needs to chang","useful":2,"cool":0},"V7J6VxzYrFOOz2JijsBF5g":{"text":"I was there on a Friday for Happy Hour with my wife, sat at a table and ordered food and a","useful":3,"cool":0},"CHBTb-F81ErCgZkDlCPFRg":{"text":"I came here because someone mentioned it had the best Tex mex food in New Orleans. I also ","useful":2,"cool":3},"98iypsVwPMEWVccB82C_UA":{"text":"Great location for tex mex in the garden district. It has an awesome patio and the food wa","useful":1,"cool":0},"01XipJgYPjotMmS5H_5sVQ":{"text":"Another one bites the dust.   The crowd here is awful, I can't stand it anymore.   I used ","useful":3,"cool":1},"zgMGTXq0ZulVb4uXY9hweA":{"text":"Recommended place for New Orleans style Mexican cuisine! Employees are friendly and effici","useful":2,"cool":1},"juNGETOaeBMWZP-NGoSn9w":{"text":"I decided to have an early lunch here at 11am on a weekday. I appreciated the early time b","useful":2,"cool":1},"tVqoOdvA0PFqFrD5syK0Ow":{"text":"I've lived in New Orleans for 2 years and I LOVE the brunch at this place! My friends and ","useful":0,"cool":0},"i-JWZynnDg9Yf3wlLGi1bw":{"text":"Great location, I recommend going for happy hour, getting the Sampler Platter and enjoying","useful":1,"cool":1},"bB6zqyoPVWqGJ7YJVFFGsQ":{"text":"Seated right away and accommodated for our dog. Brought out waters and chips for guests, b","useful":0,"cool":0},"HHMSVaXdOBac8Ta-ApI3yQ":{"text":"Yummy...yummy...yummy!! Their new head chef has really elevated the food from the Salsa to","useful":2,"cool":0},"DwLB2u6RZBYvkdWlHZraQQ":{"text":"I LOVE Mexican food.  Unfortunately, good Mexican food in New Orleans is rather hard to fi","useful":2,"cool":2},"jmNtOLDICElbrXlRNmKx3g":{"text":"We went to superior grill for margaritas on a Tuesday and they did not disappoint! The mar","useful":3,"cool":3},"g15oZ-hRO54_9gMj_4y_zQ":{"text":"I have been to Superior many times but this was my worst experience yet food was just okay","useful":1,"cool":0},"VWzCOFphE0m3xPX2PL5dzw":{"text":"Sad salad, cheese missing, had to ask for extra dressing, mesquite chicken on salad was ta","useful":0,"cool":0},"Mmj9IwXpSKNvQVII5N5Kpw":{"text":"My family and I are in from Kansas City and this place was recommended by a local friend. ","useful":2,"cool":1},"EU9vio60cEX-f9UF8wJnmg":{"text":"Ok, I'm going to keep this real for y'al! This joint is great if you have a big group and ","useful":9,"cool":5},"OJgRhyS9V5gmKtPTXMlcLg":{"text":"Needed a night out it has been so long. Decided on superior grill because of the outdoor/ ","useful":10,"cool":5},"kKLRUkvRmo2C-rk_-IeVPQ":{"text":"Superior USED to be the \"go to\" Wednesday party place for Uptown.  That was years ago back","useful":5,"cool":1},"kexrK3kc3kQtBu7A1oK_Ng":{"text":"Delicious generous with alco giant superior margs, my friend enjoyed her taco dinner and m","useful":0,"cool":0},"TB9gir7LEM7yBewzNbm0WQ":{"text":"Did you know superior grill has breakfast and brunch items?? And boy, is it amazing?! I or","useful":2,"cool":0},"wPUR2Yfml1b5wvyuSP4qcQ":{"text":"I guess when I had rated this place 5 stars before, I was just desperate for good Mexican ","useful":2,"cool":0},"z1Hpar_2HKBf5BchwpZNGQ":{"text":"Superior Grill is the best Tex-Mex joint in NOLA, hand's down. New Orleans has great food,","useful":3,"cool":3},"tkqgwZiUTUvd2ingrEjJPA":{"text":"Just walking by and suggested we stop 8n for a drink and food... the boy was hungry. Sat i","useful":1,"cool":0},"2Q3Gr4g6nPezgNCuKJ4zOg":{"text":"I really don't get what all the hypes about??? \n\nSuperior Grill is once again, that place ","useful":2,"cool":1},"CScMX6OxmyvB2CVy_azKHQ":{"text":"I Visited this restaurant  around two o'clock today and I will never be returning here. Th","useful":0,"cool":0},"tlKBUA-SDEt7g2bOwvGDMQ":{"text":"Elaine, I know we're friends and all, but Superior ain't THAT bad.  \n\nWe stopped in to get","useful":1,"cool":1},"J3dHXptAhaJI9G7etjSQZg":{"text":"TOP SHELF margaritas are the -ish!!!! Hello & good bye!!!! I can never seem to keep the ac","useful":8,"cool":4},"HkU87przkMXZiumRj6v2og":{"text":"Food was amazing yesterday. The large platter of rolled asada taco, chili relleno was perf","useful":1,"cool":0},"a8Y3xeRVtTXV9H3UfllNHw":{"text":"My friends and I were so excited to try Superior Grill, but we were extremely disappointed","useful":0,"cool":0},"30hr4LkhZDK6ZYBP4SgBqQ":{"text":"Not bad for a burger at a Mexican spot.  The burger was good, the service was so so.  Burg","useful":0,"cool":0},"MNSXhNBY6-PutpTMF4Oghw":{"text":"Mexican food is one of the best culinary experiences you can have and the frozen  margarit","useful":0,"cool":0},"ZB2Mx5Jgi_kDFwJ4mSgX_w":{"text":"Went her to celebrate a promotion..after receiving the salsa and starting to eat we found ","useful":0,"cool":0},"ZZPKyxw0cVoUjxagHBJodw":{"text":"Superior Grill was bumping when I arrived around 8:00 pm on a Friday night for a friend's ","useful":3,"cool":0},"hXXZDwhfjTuopta1evsnIg":{"text":"Visit Superior in Baton Rouge once a week. Had a little league baseball tournament with 5 ","useful":0,"cool":0},"itBu3tLjOI3RsB8gjn2HzA":{"text":"Somehow people loveeeeeeeeee this place but for me, the food is meh, ok. \n\nPros first : \n1","useful":3,"cool":0},"0ybXW8cdsDIXYc1UOSxOHw":{"text":"Great margs. They really get the job done. \n\nI wasn't a huge fan of the layout of the spac","useful":3,"cool":0},"j-NubFXinLg61JiPsDmeEA":{"text":"So I came to superior for a friend's 25th birthday. I was told not to expect great food bu","useful":1,"cool":1},"yddmHgardHaDSNbUvWNI9Q":{"text":"food isn't amazing, portions are large, only redeeming factor is their frozen margaritas","useful":0,"cool":0},"0gna6zs13op9SjRFPviQSg":{"text":"I had high hopes for Superior Grill what I got was the biggest let down I have ever experi","useful":3,"cool":1},"saOlHfhHRPpddu4rDLgTNQ":{"text":"I wish I could say I still loved this place but the truth is unless you are going for ques","useful":2,"cool":0},"r8QKDwd_H8S43k1znyir2Q":{"text":"WHERE UPTOWN UNWINDS\nDespite its high prices (you'll only find us there at happy hour) and","useful":2,"cool":1},"UxK_Ud2EdR-JnTBV2CQa4Q":{"text":"If only for the prices, this Mexican Dining in Uptown New Orleans is absolutely ridiculous","useful":3,"cool":1},"lFGTSVJ0RscujJlRSB8CBA":{"text":"i have been to Superior Grill many times.  they serve american- style tex-mex food and eac","useful":1,"cool":0},"Lpv34aWFT73mHyQ0wqPdyg":{"text":"Came in for Lunch at approximately 2:55 PM. Got sat, received some waters and chips and sa","useful":0,"cool":0},"cUfHznZ_9es5O7JRMPZ5dA":{"text":"The regular superior grill frozen margs are on point. After one I was buzzed. The chicken ","useful":2,"cool":1},"b5s0uWeH_IorDONS8XbSCA":{"text":"Delish! So the salad was weirdly the best salad ever. Tuna tacos were in point! Everything","useful":2,"cool":2},"NGhE3i7q6ONkiH-IzjXOrQ":{"text":"$42 for two mediocre entrees with barely any flavor and two glasses of water. The service ","useful":6,"cool":3},"E-K9YZ1cBKaNvGFqmAlgGg":{"text":"Superior just keeps getting better and better every time we go. Love their Sunday brunch a","useful":1,"cool":0},"RlhZhlKRojF0Pi39Jklc3Q":{"text":"Service was ok. Food was too expensive for what we got. I mean in all fairness they did us","useful":0,"cool":0},"dCMEAetKUQVmTCoQ0qRmlQ":{"text":"Absolutely terrible. Tried to eat at this place, was ignored by the hostess,the bartender,","useful":0,"cool":0},"oo2RPGHc6lnAI4Aa-ria5w":{"text":"Nachos Party of 1 \nFriday afternoon post Dr. visit \nI gotta gets colonoscopy \nGross \nSat a","useful":1,"cool":1},"9u-6QQgUH7V6_nWdOd0f1w":{"text":"Your typical Tex-Mex restaurant, except uptown.\n\nIf you can avoid sitting in the patio are","useful":1,"cool":0},"nccYoMEi_Ie7KQl86jM7Nw":{"text":"My 1st visit ever & it's happy hour! ¡Olé! The food is fair but the drinks are fabulous! T","useful":2,"cool":1},"Yvfh_geiZQSb4KzUy0Ji8Q":{"text":"Wait can be long, but always have good service and a friendly staff. Food is always good a","useful":0,"cool":0},"ebLMmFwXMogAcS5xvT8zQw":{"text":"Chips and salsa might not be the best I've ever had, but I consider it one of my favorite ","useful":1,"cool":1},"DaMXV0yHikqje9Dm-4WS0A":{"text":"I've been looking forward to checking out the Superior Grill. Waiting for Iris while the T","useful":3,"cool":3},"6__9Ixk202vjsvaoV6I57w":{"text":"My girlfriend and I walked here (7 miles round trip - work off those calories!) for a late","useful":2,"cool":2},"18hAK5dkUxADmqLtOWb4CA":{"text":"Let me preface  this with, I'm a huge fan and typically  have a great  experience  everyti","useful":1,"cool":0},"IZ9-JcCjiDq0z5Y_oN5KxA":{"text":"Decided to dine-in and sit outside hoping to social distance as much as a possible. I wait","useful":2,"cool":0},"6cvB5jT6VVhJ37bHIPledg":{"text":"I like the food here, but it's so expensive!  The true reason I generally avoid this place","useful":2,"cool":1},"qht4U8NWo18RhG4WhVcuxQ":{"text":"I spent my lunch dining at superior grill with two of my girlfriends. When I came previous","useful":1,"cool":0},"kGK0wFk_nYfd4Ca7kgvecg":{"text":"I don't love or hate this place.  The location is good, as is the service.  The margaritas","useful":1,"cool":1},"uheheqlGT0CIo1DhxKNgZQ":{"text":"A really great Mexican food place. It's hard to find really good places in Louisiana, and ","useful":2,"cool":0},"4vzpXAKtPKkXTHcNUOnqqw":{"text":"The service was phenomenal. We ( table of 6) went on a  busy Saturday night. Upon arrival ","useful":0,"cool":1}}