{"XAySLWBoKDOruDuTKDlDyA":{"text":"So this was the best place we had dinner, while in New Orleans!\n\nThis was our last night i","useful":0,"cool":0},"4ZUlW1ca2lvX7yIGom-Y8A":{"text":"Houston's seems to have a bit of a cult following---I know people that are crazy about it ","useful":0,"cool":0},"kJXvReiBH0sbZwAYnGtAxQ":{"text":"Great atmosphere!  Over the years, this location just keeps getting better.   Of course, I","useful":0,"cool":0},"GPhByRzhAOc0nNTn0_baLg":{"text":"Good solid service, ambiance, and quality meals. Great place to take a client, family or f","useful":0,"cool":0},"ZEGYZgtNs2UDdFhsMQ-LNw":{"text":"I have been enjoying Houston's for at least 12 years now, and always (with the exception o","useful":5,"cool":0},"sdkIY-aiOUr9CHtNSIKKDQ":{"text":"There was a time Houston's was a place you went and spent money on great food that was ser","useful":2,"cool":0},"84wfh8sbaXNTLS89QXXoPQ":{"text":"I tried out Houston's last night. It's a beautiful establishment; the waitstaff was courte","useful":0,"cool":0},"emkHSaZE7VEnMi6pKqDZEw":{"text":"My husband and I only went here because Metairie has closed, we will not be returning. I a","useful":0,"cool":0},"SyyBqMgbuZuKvSow_Q3wTw":{"text":"I made reservations for a Tuesday night & I was surprised as to how packed this place was ","useful":1,"cool":0},"7DnFnzVq01Di2zZk1nOkbA":{"text":"This was one of my favorite restaurants when I lived in New Orleans. I frequented the Meta","useful":0,"cool":0},"2k06SoC4jjS62cHx-0op-w":{"text":"Great service.  I had a to die for veggie burger here.  The ingredients are top quality an","useful":0,"cool":0},"ZqPj7NULHu7bKoP9OPlCbQ":{"text":"Apparently the security guard here has been delegated to scream at people trying to enter ","useful":4,"cool":1},"793yMbxJR31JkM_oyYSz3w":{"text":"We always love Houston's food and service.  Went today for lunch and ordered our Oysters S","useful":0,"cool":0},"rynDp4d9nXEZru2g7rnWrg":{"text":"My daughter's and I had lunch with a friend here and although the service was good it was ","useful":0,"cool":0},"BAOsOrYFWFahU2GlujGOtA":{"text":"Ribs for lunch were good. There was a wait of about 25 minutes for a table and bar seats w","useful":0,"cool":0},"jvJroSc1YMRh9MuIvoFjsg":{"text":"With the demise of several neighborhood restaurants, Houston's is once more the best relia","useful":1,"cool":0},"xPH5Vw607tZzyCY13Iz58Q":{"text":"Classy joint. I recommend for a business lunch or maybe a date. \n\nMy thai steak salad was ","useful":1,"cool":0},"rnUg_OkSsbhC1RcHsb0Fow":{"text":"I ate here on Saturday with my best friend. We had a 45min wait which is typical for a Sat","useful":0,"cool":0},"bcYhAYoY_4t3K41Gs2chLw":{"text":"Had no problem in the beginning but it took the waiter a little too long to just come to u","useful":0,"cool":0},"-ehJfVgCfI-EUytn_23Lsw":{"text":"Worst. Service. Ever. We won't be back! The place was empty but we still had to wait 20 mi","useful":0,"cool":0},"3XofcRs7BOfoUqlS8KKFdw":{"text":"Their cornbread sucks! It's served cold room temperature at best... Then you get to experi","useful":1,"cool":0},"HTzvLTeCvi_jvkIFyQ6BVA":{"text":"I'm not sure why anyone would consider this fine dining.  My fiancee and I went for lunch ","useful":3,"cool":1},"Edx4TD4SUa7W7owJZ6FJ1g":{"text":"First, the waitress was not very accommodating & rude.  We specify asked if the veggie bea","useful":0,"cool":0},"RODQ_2Rc4JzL9mxsOC8hlQ":{"text":"A few days ago for lunch ,,,,as always, you can know your getting good food and good servi","useful":0,"cool":0},"pvRd0XhmYH_KTu18NHOyCQ":{"text":"Does Houstons really need another review? Who knows but here goes...\n\nAs usual immediately","useful":2,"cool":0},"lbgWwxUYm80XGpk_X_70zA":{"text":"Visited Houston's New Orleans for the first time in a long while last night.  Extremely di","useful":1,"cool":0},"nzRN789sQxl-Ay6wuY2_MA":{"text":"...and this is generous star-wise.\nWe have so many restaurants worthy of such prime real e","useful":1,"cool":0},"dlvx2AR3pwRy5_ekuNM-Yw":{"text":"The spinach and artichoke dip was pretty good. I ordered the Thai Steak and Noodle Salad w","useful":0,"cool":0},"hmmKTFlHfAgwv2I8jigPUQ":{"text":"Had Houstons last night for the first time since before the big K. Have to say, not much h","useful":0,"cool":0},"-jtfqead0S9AO5CAm-57Ag":{"text":"Celebrated our anniversary this weekend. I made a reservation and we were seated within mi","useful":0,"cool":0},"qpzLhmTkXnmBrkrNc1D95Q":{"text":"Friendly Staff great atmosphere!  It's a remarkable The food is worth the price Very very ","useful":0,"cool":0},"dauR19N8Td1sC9XWobhFFA":{"text":"Just can't beat this go to spot in New Orleans. When I lived here I was a regular, good fo","useful":0,"cool":2},"nSmTBKC_VGzTVPvV0BLoiw":{"text":"Excellent service tonight, the food was delicious . We ordered salmon and Hawaiian ribeye ","useful":0,"cool":0},"ln3Wvd6sh2BMoEhY1iEWsg":{"text":"Really everyone knows the quality at Houstons is sublime! Another great experience for my ","useful":0,"cool":0},"Wavpbi9Bwoal2udh34zo1Q":{"text":"We love Houston's! We came here for Valentine's Day. It is less busy and quieter than ours","useful":0,"cool":0},"0DQIeRtVzIk3M3S684htsA":{"text":"This is the kind of place that from the outside I expect to have lots of mediocre Yelp rev","useful":4,"cool":1},"oUvAwoGY3a5DGSUjAA9zpw":{"text":"Great lunch with my fiancé and his family. Had the spinach dip and the French dip sandwich","useful":0,"cool":0},"U_8fPhcFB8WyLj1BLpHYnQ":{"text":"Love the atmosphere of this location. I have been visiting Houston's- St. Charles since I ","useful":2,"cool":0},"Txu8ntiuR7ohj8-4j2l-9g":{"text":"Fyi-- they won't serve long island ice teas or a double cocktail. Odd, esp for a New Orlea","useful":0,"cool":0},"0b5NIFAvPoVWLxxL_11afQ":{"text":"Regular spot for us.  We ordered the spinach dip appetizer, it's the best in the city.  Th","useful":0,"cool":0},"mIQlPa_gvbCeQdDBdmEKCw":{"text":"Great food !  The service  was very terrible. Something so simple as getting water refills","useful":0,"cool":0},"K_1Q7dLOHkBpeHny-tYwWQ":{"text":"Paul was our waiter today. He was absolutely the best ever!! Knew his stuff!!  Mexican sou","useful":0,"cool":0},"mGMeAA42s82G6LtN6JCH7Q":{"text":"In my 28 years of life, I have never had such a good meal as I did at Houston's. First off","useful":0,"cool":0},"VK0QpZ2i1q-pC-I2r8Od1A":{"text":"Love it here! 3 stars because that was the absolute worst service in my whole life. If you","useful":1,"cool":0},"4L_vlgRV8nxezjBOU7O6-w":{"text":"Great place for a vegetarian.  Really!  They have a rice and black bean burger that is DEL","useful":0,"cool":0},"FlPXEdKJT_2EDq2Gx7jxWQ":{"text":"Food and service were great!! The ribeye was cooked perfectly (medium well) and the spinac","useful":0,"cool":0},"8fKx7F7qWV-aVVVAtJCpKg":{"text":"Just mediocre food, nothing special. I would have expected more for the price.  Neither my","useful":0,"cool":0},"bk0UXNViv1bmJeOSOsDKRQ":{"text":"This place is always on point. From the ambience of the low lighting, dark wood, and live ","useful":0,"cool":0},"X_FWdNXCDCXxStqhRXOETQ":{"text":"I had ordered a Club salad which was supposed to be fried chicken on top . After received ","useful":0,"cool":0},"QffE413jJbwyQl_lVzJRTg":{"text":"Houston's, one of the only two chain restaurants I recommend; has fallen a \"star\", after t","useful":0,"cool":0},"IotY07YBidMZDbq9kfEgow":{"text":"We just stumbled in one evening since it was close to our hotel. We immediately liked the ","useful":1,"cool":0},"79IoPC4dvcOmOgkm1hegJw":{"text":"Last summer was the first time that I was able to make it back to Houston's since I had fi","useful":1,"cool":2},"QhG98oZ7HsHAYYr692fpTQ":{"text":"Houston's has my favorite Spinach Artichoke dip. I have been eating here for years, and th","useful":0,"cool":0},"TdGkw9dOUBoS8EWGUbnT2w":{"text":"Real good service staff. Food was ok. I had a burger. Everything else was pretty over pric","useful":0,"cool":0},"jVwUKis3MVCUaPkVM3iY_Q":{"text":"On a recent trip to NO, we stopped in at Houston's on a busy Saturday night without reserv","useful":0,"cool":0},"P1mlIYO1As_iAbNmS_Icsw":{"text":"This is my Fav place to go when I'm in town, everything on the menu is yummy I've been com","useful":0,"cool":0},"BCr4SZ84I3w-IXkA1KC6yg":{"text":"Horrible Customer Service.  They REFUSED to seat a party larger than six.  Their position ","useful":1,"cool":0},"lkhD6BKBPmc6sgXj0NbESA":{"text":"We decided to have dinner here on our last night in New Orleans.  The ambiance is very nic","useful":0,"cool":0},"y9meDsRI2ozZK_t_nTsvKw":{"text":"Since reading my review & several others, I dressed better, got in my Jeep, and went over ","useful":0,"cool":0},"K4RN9WNaESDYfh75ISOV3w":{"text":"Ordered Togo and when I got home food was freezer cold. The worst part about and called an","useful":0,"cool":0},"sLlgfgDaf41mnDzvm3K1uQ":{"text":"Their food's consistency is the key to returning customers. The menu isn't that extensive ","useful":1,"cool":0},"aRkEdw8bzuyQfSnKbN12eQ":{"text":"Every time I come Houston's is always a joy. The workers who cook the food always go out o","useful":1,"cool":0},"7d5MwiVD5NcbeEbeV1K5Qw":{"text":"I just had their Cajun Trout and it was amazing. Spicy and a little buttery very easy to e","useful":0,"cool":0},"PV1lnUcH7W9wBn7XBhi5OQ":{"text":"O.m.g. the food was delicious!  The ribs were tender. I mean fall off the bone, i don't wa","useful":2,"cool":1},"wXGQuenNYQbMSHRc2YqagA":{"text":"The prime rib was perfect. The service was flawless. The only reason for 4 stars was exces","useful":0,"cool":0},"NeMAeQ7Qlj9ckOi15ol73w":{"text":"In the 90's, I used to frequent the Houston's in Metairie at least once a month. I have on","useful":1,"cool":0},"AUKjj2hu51JCIOnEwcg-hA":{"text":"I love Houston's. The food is great. I have been coming her for years and I will continue ","useful":0,"cool":0},"jFSolzB6uk7wpXDxIWsBUA":{"text":"I love the ambiance of this restaurant. The band was playing in the background, but not so","useful":0,"cool":0},"X5fz3WzMNv0cjT1EWlENPw":{"text":"Short wait. Welcoming barkeep. Nice live jazz. Grilled artichoke appetizer was novel, ligh","useful":0,"cool":0},"590Y-aSrXb8lypxkC1KLxQ":{"text":"Simply, yet delicious. Go for the Hawaiian rib eye, medium well...  loaded baked potatoes ","useful":0,"cool":1},"C9oHnk3KlOuG5E8ac_PKeA":{"text":"Prime rib was incredibly salty and cold. Boyfriend enjoyed his salmon but I was extremely ","useful":0,"cool":0},"_7vbSL7NZgYtS9hyFJnBgQ":{"text":"This is one of my favorite restaurants and whenever I spot one I'm there.  Dined at the ba","useful":3,"cool":1},"WfzFDd6LI6Aj-apF6ewN3g":{"text":"This is my first time eating at Houston's. The waitresses and bartender was very attentive","useful":1,"cool":0},"CvLtWhsoMaLGge2B0qN54w":{"text":"Honestly amazing food and jazz music . Some of the best food i have had and to top it all ","useful":0,"cool":0},"9JHqRj0_W3ibUsRx8cglHA":{"text":"The Hawaiian Ribeye was insanely good.  It was a great dining experience and food quality ","useful":1,"cool":0},"5-qRYqIC4lqPN9vmYUL8SQ":{"text":"The food was surprisingly delicious! There's not a ton of character (it definitely seems l","useful":0,"cool":0},"bbMTtqLEJr5Y1nmJiKjfgQ":{"text":"Ambience of this restaurant is great. I love the large open space and the classy high back","useful":0,"cool":0},"r7Yykrc7hFli1A-JWe8TtA":{"text":"The service is always super and food is consistently delicious. We always start off with t","useful":0,"cool":0},"-nPtBQgb4RzHWZ6kXfjZzg":{"text":"This restaurant is close to my office, and have been there twice since I've landed in NOLA","useful":0,"cool":0},"xGshthQciKIsPtf-yoMNrQ":{"text":"Ordered the filet medium rare. . $45. Came out medium well to well. Terrible. Didn't eat h","useful":0,"cool":0},"qYsLxSz7psyvUzGLo5qi3w":{"text":"This place is bustling, but they make lunch so easy.  Sat at the bar, ordered the shrimp s","useful":1,"cool":0},"D8kWmgsl77z4hu_2CdjPFw":{"text":"One of the most beautiful restaurants in the city!   Consistently great quality food, serv","useful":0,"cool":0},"l_jISD_zY21crGeWbhou6w":{"text":"I don't generally rate chain restaurants, but Houston's is one of those exceptions.  After","useful":1,"cool":0},"oWzHZxEB9tA-wvUz7dqF2Q":{"text":"Super good food, like as in maybe the best Caesar salad and artichoke spinach dip I've eve","useful":0,"cool":0},"0IjtrTGZgGzFMRCERk2pcA":{"text":"First time here. And even though the wait was long it was well worth it. The wait staff wa","useful":0,"cool":0},"7uFeWdg--C6zxdnG1MnY5Q":{"text":"Been here several times now and every single time the food was great service was ok. I wou","useful":0,"cool":0},"QqT37JcrMm5sR4lmAXRbkw":{"text":"My first time visiting this Houston's and it exceeding my expectations!  The service was g","useful":0,"cool":0},"A59yaqIGMo3TkZmWr3Y-rg":{"text":"The grilled artichoke is fabulous. Smokey, tender and quite flavorful, thanks to the mesqu","useful":1,"cool":0},"lWz9ahBCym21wAFf2f-WCg":{"text":"Food was good, but with prices at $36 and $44 per plate, it better be! The service was BAD","useful":3,"cool":0},"zlMuw_3ZWK6eBnrTkRL-Pg":{"text":"It's so rare that you find a restaurant where everything on the menu is good. Everything. ","useful":2,"cool":0},"zVZ51nrj5iLkK6HVtxdPbQ":{"text":"Great food at reasonable prices. Has decided to no longer accommodate to-go orders. States","useful":1,"cool":0},"dIg5oHpVki_Lu8zdQ147Mg":{"text":"Awesome steakhouse! Atmosphere was great and the live jazz was on point. The smoked salmon","useful":0,"cool":0},"vzm396hHCGi5Zm15cmYKuA":{"text":"We had dinner at Houston's tonight.  Good wine, fiance had a great steak, my fish was cold","useful":0,"cool":0},"qIxIRuV3Z4UNuYVE9j7yeQ":{"text":"This place is always packed.\nThis place is close to my home.\nThis place is a large chain t","useful":4,"cool":0},"GwUT7HSmuJi2_4qzXAV84Q":{"text":"Great ambience and food.  We ordered the steak and noodle Thai salad and we're delighted w","useful":0,"cool":0},"OC7UWZ82BYNMENE45JHn2A":{"text":"Had the Cheeseburger and French fries. It's beautifully reminiscent of a McDonald's burger","useful":0,"cool":0},"pfK79ptz4tIRXStQcFUtOg":{"text":"Had red fish which was excellent. Thai steak salad delicious. My husband had the pork chop","useful":1,"cool":0},"orZcBYLEEXW66hC863paEg":{"text":"Had a great prime rib, it was cooked perfectly, crispy french fries are really good. Love ","useful":0,"cool":0},"RAp-_ZR5ZKNYd_RU1UjcCQ":{"text":"Made a reservation and were told we would get a window table.  After a wait we were seated","useful":0,"cool":0},"VKRuqpmSxQPM29lhQnerTQ":{"text":"Just finished dinner with my big sister. Delicious spinach and artichoke dip and fantastic","useful":0,"cool":0},"OjPVTv2TLx9k-zugXdYQ8g":{"text":"This place is a good Steakhouse although you can feel that it is a food chaine. But nothin","useful":0,"cool":0},"sm9cE9C7uYGO3aAEgAsetw":{"text":"I give the food 5 stars definitely! I had 6 people at my table who all ordered 6 different","useful":0,"cool":0},"S70ofrsiCt0JOz8GhiU42A":{"text":"Usually good food and good service go together. Not so on our last visit to Houston's. The","useful":0,"cool":0},"HBYHWvNQQI3MVN0cI711jA":{"text":"When we arrived the hostess explained the wait would be 45 minutes. The hostess then expla","useful":0,"cool":0},"F03n61ovAsmnIU85hoB3BQ":{"text":"I like this location very nice decor and is located away from heavy traffic areas. The foo","useful":0,"cool":0},"6NucTy_TJAq4qbHPF4W-fw":{"text":"Without a doubt my favorite chain restaurant ever. The service and the food are always on ","useful":0,"cool":0},"6ytiJP2RRprAMjYIe9GSLg":{"text":"Is the food good? Yes. Is the jazz band and atmosphere good? Yes. However... don't even bo","useful":1,"cool":0},"sQ0iFgk_u4eHkzwJVVDaoQ":{"text":"My boyfriend wanted a steak and I we had to compromise and find a place that had food that","useful":0,"cool":0},"3RBQugK0tHbrQg420Vp76w":{"text":"I LOVED HOUSTONS IN METAIRIE. This was my first experience at the St. Charles location. I ","useful":0,"cool":0},"-meNxKc2nWKOfBy-yRNQmg":{"text":"I used to really love Houston's . We ate at the Metairie location several times a week. Al","useful":0,"cool":0},"J-Y0XTHl7U3wKq7eFhV2MA":{"text":"I used to be a regular customer here, until this ridiculousness happened concerning to-go ","useful":3,"cool":0},"jhy8VYrrBLCvVJ5QeNGgLw":{"text":"Horrible service. As my wife and I walked into the bar and looking for two open seats to h","useful":0,"cool":0},"1SkvBwkgOXq_VxP8HhyDwA":{"text":"Great everything.  The consistency borders on obsessive. Grilled artichokes, smoked salmon","useful":0,"cool":0},"T2kNQsMZZOuYlU6bm23IfA":{"text":"We started our dinner with shrimp remoulade, big beautiful shrimp that had a great taste. ","useful":0,"cool":0},"QlygR1N6wVnlRJvkzJFplg":{"text":"Had the redfish filet which was amazing along with the slaw and vegetables. Service was gr","useful":0,"cool":0},"u9kR-lVH218g-AcveY2xRg":{"text":"Just went to eat here. Great prime rib. Whipped potatoes weren't the best but I did not tr","useful":0,"cool":0},"IJvLPyGfOBZ3qDfTUTwYAQ":{"text":"Hmmm, what separate's this Houston's from all the other Houston's I've been to....easy...\n","useful":0,"cool":0},"wmQireRyZ2ODXTlQCeRhpQ":{"text":"This place is a joy, amongst a whole bunch of sadness! After walking around this city for ","useful":2,"cool":0},"FF9hMC17I4-rpIcKcH6pbg":{"text":"Well no surprise there always a good meal at another Houston's. Had the kale salad with ch","useful":0,"cool":0},"-9txmWx5G0Jj24vMpYAVNA":{"text":"Food was wonderful!! Service was great. Just had appetizer,s, we had the smoked salmon and","useful":0,"cool":0},"GMRL6Cv9cvBE4OXoYIWCJA":{"text":"Everything on Houston's menu is consistently good. The service is good just a little robot","useful":0,"cool":0},"oc9PoKowBK6CKlqBQHy_YA":{"text":"Great lunch spot, am told dinner is PACKED and that the ribs are amazing.  I went with a f","useful":0,"cool":0},"ZIlA3rSXLZLISAPcTHRLEg":{"text":"One of my all time favorite restaurants! One word describes Houston...Consistent! You will","useful":0,"cool":0},"psT4oc_2P9UvgO7HI9oPPQ":{"text":"Great service.  What they do they do well. We had the fried oysters cajon red fish and cra","useful":0,"cool":0},"Q1I-lKv0B2jEII_-2tx2tA":{"text":"The best thing about Houston's Restaurant is they go out of there way to make it right. Ev","useful":0,"cool":0},"vCw7YiNLJeijkC__e8r6OQ":{"text":"I love their tuna salad! It's one of the best salads I have ever had in my life. Their oys","useful":0,"cool":0},"6Z3XhGySXIO6IuntzpSspA":{"text":"This is not about the food. Food at Houston's  (and all Hillstone properties) is generally","useful":1,"cool":0},"X35zHSzSXAHyGrpBc38zHQ":{"text":"I think the cuts of meats that we got were nice portion sized and cooked well. I was just ","useful":1,"cool":0},"joWbheYmhuGVkKq5dN5u0Q":{"text":"The light jazz in the lounge was very nice for dining. The food, however was average and o","useful":1,"cool":0},"cV7V2zjHfYUluNo8D0xKJQ":{"text":"I don't really do chains when in cities like NO, but I stopped by Houston's to check it ou","useful":2,"cool":1},"Em6RuR4F1rTbdQbzcPrhwg":{"text":"The food was wonderful I had the spinach and artichoke dip very good and the Hawaiian Stea","useful":0,"cool":0},"xmmofmfAQYQ-BOF-MQPDkQ":{"text":"Five stars - was there for lunch and the whole experience was fantastic.  On Memorial Day ","useful":0,"cool":0},"OEy1HzhdHaLnnEaWD5DvcQ":{"text":"Was a very good meal. Ordered the Spinach Dip, Hawaiian Rib Eye and Kale side salad. The a","useful":0,"cool":1},"yGjJxvekF__BgpKFUPzb3A":{"text":"My friend and i went today and it was our first time here. I must say the food was delicio","useful":0,"cool":0},"Q5KH-XLj7RjwllWfk8wa7g":{"text":"Came here for lunch as we're in town visiting family. The atmosphere is incredible. Very b","useful":0,"cool":0},"cYBnNRqweJnP9cK75FOgjg":{"text":"Food is excellent. Service superb. Call in advanced and will save you the 1and a half wait","useful":0,"cool":0},"61ZC5FgFPDjwHffGpCZqzQ":{"text":"Houston's never disappoints! \n\nLocated on the street-car line of St. Charles Ave, the rest","useful":6,"cool":0},"MqYWpLLjRXdT_aN1xtDkhA":{"text":"Food and service pretty almost on point all the time had a great lunch date with girlfrien","useful":0,"cool":0},"3KU7FOU68j_wogoGnxAo6Q":{"text":"Love love love my food & waiter service.  My friend booked us reservations & of course eve","useful":0,"cool":0},"SxuPDJw64p_M60gR1QAQFg":{"text":"This was my first meal in New Orleans and I was not disappointed! The steak was pricey but","useful":0,"cool":0},"ZmOJDcMaEYQ8e7V22Vv1og":{"text":"Always a pleasure when we dine here! Our waitress, Agne,  was extremely polite and very ef","useful":1,"cool":1},"0_edLioB0wkzqYZ_plx-zw":{"text":"I always enjoy this place! Not the dressiest or fanciest place ever, but certainly never d","useful":0,"cool":0},"rXx7DwzGEPoQMVLcOLDiSA":{"text":"As stated by some other reviewers, for a chain restaurant, Houston's is at the top of thei","useful":2,"cool":0},"Nl7RMqeTqlS_5LnUeWch9w":{"text":"We live nearby and have dined here about ten times in the past four years.\n\nWe rarely use ","useful":1,"cool":0},"TZkyO42Ss91wRl89Jsm2cA":{"text":"Ive loved you, Houston's, for 15 years.  You know i've been faithful, constant and true. A","useful":0,"cool":0},"W6D97zm57Q0TxSx7rlkozA":{"text":"This place used to be known for its great service - I can't say that's true anymore. My da","useful":0,"cool":0},"zhSDdcaikX-YG-tmX1qxEA":{"text":"This is now one of my favorite restaurants in NOLA.  Occasionally you find a restaurant wi","useful":0,"cool":0},"ON-FkWW-d0CUIEYHO7FNIQ":{"text":"This place is always a good standby for a business lunch or nice dinner with the family. I","useful":0,"cool":0},"EXsOHD2NRkZwcaER5JUzPA":{"text":"Menu is limited....steak came out not to order...\"BUT\" the waitress and manager showed rea","useful":0,"cool":0},"gXt6oELSiurXBh2G90VhbA":{"text":"Houstons is one of the best restaurants in New Orleans.  The food is always great and the ","useful":1,"cool":1},"jX8SXKsFUFrtxik0iDlH7g":{"text":"I didnt even know this was part of a restaurant group. It is very dark at night and nice a","useful":1,"cool":0},"JAaBfl8PXqVZZ8iUHBhOzA":{"text":"Amy and I have been dining at Houston's since High School. Many of our early dates consist","useful":0,"cool":0},"Ay4WrvucZO__ck0koW7Hkg":{"text":"As a huge fan of Houston's, I was a bit disappointed with this location. Everybody who has","useful":0,"cool":0},"gWcLA1phzl9JQxoQz1Uqyg":{"text":"Excellent food! Everything! I tried something new to my taste buds, the Beef Thai Noodle S","useful":2,"cool":0},"H-ihxAZHP_X6gFTgyGqk_g":{"text":"We showed up without reservations and were seated fairly quickly. The service was good and","useful":0,"cool":0},"T-jVqbYBQUR-oxM193jaSw":{"text":"I've had dinner there many time. The for is good and the service is good. I am in a wheelc","useful":0,"cool":0},"KUwHTiQlQt-tS_yurPJdXw":{"text":"Really great place for a burger.  I haven't had a good burger in NO despite the reputation","useful":2,"cool":0},"x_wMVi2E5HlGjtLi3sFp7w":{"text":"After some communications with \"HQ\", we were back at Houston's tonight.  I had prime rib, ","useful":1,"cool":0},"LbdtuGyuCVAIu7eCMJa7Iw":{"text":"This was our first time coming to Huston's in New Orleans. We frequently eat at sister res","useful":0,"cool":0},"s449BWspNC1v1ztLt7AXnA":{"text":"Awesome atmosphere and even better food, also service second to none. Live jazz band is we","useful":0,"cool":0},"fxZXjOsQij4GNYZd0YMg0w":{"text":"Tried to eat at Houston's on St. Charles Ave tonight with my family while visiting New Orl","useful":0,"cool":0},"bARZZtfXj7coglK3BJgJdQ":{"text":"Love this place!!! Consistent. Professional. Friendly. My amazing lunch was made even bett","useful":0,"cool":0},"dtZgxPMBp5h8X-H4L3fYFA":{"text":"Best prime rib roast I've had in 20 years (Larry's Pascagoula) my wife voted French dip be","useful":0,"cool":0},"eBQVm3RF-8XwfJ-Rnvyq_g":{"text":"Had to let everyone know bout my meal last night! Went in for dinner after watching some f","useful":2,"cool":1},"YGy8ac7NrC1FV-Eb3a9vFA":{"text":"MY FAVORITE RESTAURANT EVER!\n\nI come to Houston's Restaurant once every week. \n\nPersonal F","useful":1,"cool":0},"eJ2crbaUbN1a13N-7PZzZA":{"text":"The food and service at Houston's is world class. I have consistently had excellent experi","useful":0,"cool":0},"l81Wkw6PO_RJ36XdNzwj-g":{"text":"After a weekend of deep fried foods and local eateries we decided to end the vacation with","useful":0,"cool":0},"76NzC4B7RbhCO2uFwZspkQ":{"text":"As good as it gets for being a chain restaurant!  Everything on the menu is GREAT!  I have","useful":0,"cool":0},"4QEF4bb8YvK5RR98eU5zVg":{"text":"ON POINT! Honestly I tried to stay clear of going here because I thought it was another \"c","useful":0,"cool":0},"5CzGCRE_FI4AIrh7EqnTLg":{"text":"Great steaks,  had tge oysters without spinach.   Everything was really good.  Service was","useful":0,"cool":0},"HW25QVXf7jd42kuvP1ikzw":{"text":"LIVE JAZZ every night! my wife and I love Houston's and went there last night to celebrate","useful":0,"cool":0},"06zFcDyxOpj5SX_pIoJTrg":{"text":"If you're going to eat at a chain restaurant in the city, choose this one.\n\nOrder the Oyst","useful":0,"cool":0},"wE1-WbKaM9x-FZjWOTN2Cw":{"text":"I have been a fan of the St. Charles Avenue Houston's since the 1980's. Having moved to At","useful":2,"cool":0},"PDEgeuScQUrLyDJkDH1-cg":{"text":"This is probably one of the most favorite restaurants in New Orleans. The food was so so g","useful":0,"cool":0},"N4OrNygFr4PrTdCnOg0hUw":{"text":"I am usually a huge fan of this restaurant but I just didn't enjoy my food this time aroun","useful":0,"cool":0},"_LD0XRnIm9FUv3EyJ7pJdg":{"text":"Been here a couple times, classy place to hang out, great service also, however, they got ","useful":1,"cool":0},"afEBBt-f_GaFB8BaGL0e9A":{"text":"Houston's is my favorite restaurant in New Orleans!! The atmosphere is great. The service ","useful":0,"cool":0},"WBC9TaDpOftdaiNOeJQOCA":{"text":"Some meals are just magical. Tonight was one of those nights. Houston's far exceeded my ex","useful":0,"cool":0},"RdcbW-fl_z-yVioGNOwavw":{"text":"I'm not a fan of chains, but Houston's is awesome. Yep. I said it. It's AWESOME.\n\nThe wood","useful":0,"cool":0},"VuYiJzQaxT98UtCn8nhYsw":{"text":"One of my favorite restaurant. Although I am not too fond of restaurant chain, Houston foo","useful":0,"cool":0},"LxNmJy_uPoL5tOXtKmGdSA":{"text":"Possibly the best chain restaurant in the world.  In NOLA, live jazz, one the best Caesar ","useful":0,"cool":0},"Z9SV3ToxO88e5W22Gr1SzA":{"text":"Houston's is one of my favorite restaurants in New Orleans. Their Hawaiian Rib-eye is in m","useful":0,"cool":0},"Ewm3QuO8AoC7rxmHnH5MyQ":{"text":"When did Houston's become more expensive than Ruth's Chris????\n\nThe chain was always price","useful":4,"cool":1},"yS4mDLq_G-Ys52wnqubyVw":{"text":"My favorite steakhouse great location. Great atmosphere great service everything about thi","useful":1,"cool":0},"m3_9fPgHUWdXRhvQY3t05Q":{"text":"It has been just years since I've been to Houstons & years years since I've been to THIS H","useful":1,"cool":1},"MwjlVCWCOWJ5arN-i895xg":{"text":"The House Salad is so fresh and chock-full of deliciousness! The Oysters St. Charles are g","useful":0,"cool":0},"m6QhxH96M5qUw-wlxSkshA":{"text":"Went for a good lunch, sat at the bar and was served immediately. Spinach dip was perfect,","useful":1,"cool":0},"UVAwD4U2P1naJlZBtpwGlw":{"text":"Ok... Houstons is great in every city in every state, how they do this I don't know.  Ask ","useful":1,"cool":0},"W6sHhk1PTrdDhJPRqOLO_w":{"text":"The Best always Enjoy my time spent here drinks and food was Great and the service was up ","useful":0,"cool":0},"VGp7zHWnmswpLXV1Jvw4_Q":{"text":"We are from Charleston. This restaurant has the fantastic food and the atmosphere is great","useful":0,"cool":0},"2qEFMXXyEDkJzmC8GRAuRg":{"text":"Houston we have a problem. It's started out well. We ordered the spinach dip, a slab of ri","useful":0,"cool":0},"zUAb678I3r0IOtGBPorvDA":{"text":"So the wife and I went on a fun vacation with friends to the great city of New Orleans and","useful":1,"cool":0},"_F_DLqf612R8xo5lQDEsIQ":{"text":"The rack of ribs cost $33 with a choice of side.  The rotisserie chicken is half of a chic","useful":0,"cool":0},"sfPhAE6MWVpQQGs1C3aJyw":{"text":"Came for lunch and was surprised by how packed it was for a Tuesday. Classy joint; service","useful":2,"cool":2},"XUj1mkKd1sUdsU6IoJEgrA":{"text":"Fantastic grilled artichokes, crab cakes, skinny french fries, fresh grilled fish, prime r","useful":0,"cool":0},"qkOIgW4s6Lnw-76w47kBgw":{"text":"Had my birthday dinner here and had a decent time. Short wait time because I made reservat","useful":1,"cool":4},"hdYbaZBA3YptW6yq2baIqA":{"text":"We chose not to have drinks - at $11-13/drink.  Sorry Houstons - I think that's out of lin","useful":1,"cool":0},"v4L7D6BWYNuNBJRE8qxjeg":{"text":"Ribs cold, hamburger luke warm. No apologies  at all even from bow tie manager. He dropped","useful":1,"cool":0},"A6qm9iMqlZzg6aUKOV2v4Q":{"text":"Houstons is a chain restaurant so I naturally have a little resentment for it, but I have ","useful":0,"cool":0},"CwVjqoB8bkEbnJUNivXjhA":{"text":"The New Orleans Saints game was on Tonigjt against the Rams. I told the manager we had cha","useful":0,"cool":0},"MlItPyU43KXhTqleBUk-lQ":{"text":"I have been to several Houstons' locations and really liked the experience! However, when ","useful":0,"cool":0},"00Yw53MjBz-TbJVNemTW2Q":{"text":"Delicious!! I was here recently for lunch. I ordered the Cajun Redfish with with crispy ro","useful":3,"cool":0},"738am1sc-k1K_qsAUAD3bQ":{"text":"Houston's on St. Charles is one of our favorite restaurants to eat at when come into the c","useful":0,"cool":0},"YR2yfQclilXBF0cLwV5Y4g":{"text":"Had the Hawaiian ribeye it was great service could have been a little faster but our visit","useful":0,"cool":0},"xX9MXQ1PNHi1dhUme21zyw":{"text":"Awesome restaurant with incredible service - Lindsey the general manager did a amazing job","useful":2,"cool":0},"CnkmgnIv2EEs0DhC3NkFWQ":{"text":"First experience here yesterday and it was amazing!! I booked a reservation for 7, an earl","useful":2,"cool":1},"j6Qq2r2huFdtIWcGai74XA":{"text":"My husband and I decided to have dinner here before the Essence fest concert. I wasn't exp","useful":0,"cool":0},"M6rYzarGLZWJlpeQq7SYlg":{"text":"The best oysters ever. This was a great surprise we found by walking to the end of the blo","useful":1,"cool":0},"hNy7GNHACjQ5XhStE7iEFw":{"text":"Recently stopped in for a post graduation lunch. The service was good & the food was as we","useful":1,"cool":1},"GQtGMraYMTmaFFB2WX5Hew":{"text":"We had lunch here today and everyone LOVED their food. I didn't realize it was a chain unt","useful":0,"cool":0},"tovpj8jZniHJyo0QMtgKrA":{"text":"Loved this place! Ate here with my two sweet cousins I haven't  seen in a while! Drinks we","useful":0,"cool":0},"G58SjJRZxMH6PU3A6SVBuQ":{"text":"Another lovely dinner and evening at the bar here last night - love the Garden District Tr","useful":0,"cool":0},"NQgHHuwSTXk1-cQlkUuY4g":{"text":"My absolute favorite place to dine when I travel. I look for a Houstons where ever I go. A","useful":0,"cool":0},"nfKiSru09YvoniwAjtsQgQ":{"text":"Ambiance great. Oysters wonderful! But why did you add chicken to the kale salad I was so ","useful":0,"cool":0},"E2S-ly1ymg2r801ikMloOg":{"text":"You just can't go wrong with Houston's.  I've never had a bad meal there, yet.  The ahi tu","useful":0,"cool":0},"t_CC6-i03rgfye9XpKUQzw":{"text":"Foods are good. The waiter is very knowledgeable on wines. Picked a full bodied red blend ","useful":0,"cool":0},"8nuA_GsV_NJTabXzFPimRg":{"text":"We \"lunched\" here this week, after a 6-months hiatus.\n\nAs chain restaurants go, this speci","useful":3,"cool":0},"HUYU4w0xgu-OZE5D1hze-Q":{"text":"Steak: the bomb\nFried gulf shrimp: the bomb\nWine: the bomb\n\nWe have been in New Orleans fo","useful":1,"cool":1},"iR3G1LIFk1fjE6pLN9QX1w":{"text":"I was very sad to learn that the Metairie location closed so I went to this one with my mo","useful":0,"cool":0},"cnwwqtw2lwAcD42M5dkiig":{"text":"This is the second time I have been to Houston's. Both times have been outstanding. The fi","useful":5,"cool":0},"gssn5UCnZGCaRNwa2GH0Zg":{"text":"Yes it is a Chain. However, it can compete with the more upscale restaurants that we ate a","useful":0,"cool":0},"2HJHZl9X_unsQT17RKrZWQ":{"text":"They don't have Dr. Pepper and have a 32in TV in the bar. The hostess was rude and entitle","useful":0,"cool":0},"2pjsydOArHaTDbVplX4cJw":{"text":"So we decided we wanted to eat 'American' and walked out from the centre to Houston's, abo","useful":0,"cool":0},"CfU1vevtZITTaTyiZzocpA":{"text":"My wife and I were undecided as to where to \"dine out in fashion\" without the dressing up.","useful":0,"cool":0},"ds3nCwnsBkBahQkJ8goHaw":{"text":"Gumbo is very \"California,\" not authentic to New Orleans. Steer clear. French Dip was awes","useful":0,"cool":0},"2NyiyMnUAJ9tGb80q1d4xg":{"text":"Food was excellent and amazing we ordered the prime rib which was nice and juicy and some ","useful":0,"cool":0},"5406D-FxV1XMMWWCFCcwng":{"text":"I have been going to Houston's for many years and visited locations in four different stat","useful":1,"cool":0},"0BCxk5OxeuTsp66pGi82oA":{"text":"So the food was really good, and the service was good but it wasn't great. The portions we","useful":1,"cool":0},"ytkhBE_Vz2d6MWeRQgujuw":{"text":"I went to Houstons on St Charles ace on a Sunday Afternoon. We had no wait and seated righ","useful":6,"cool":1},"dmtiEPA78vFQzcVYbsF5cQ":{"text":"I will have to say I've always loved this restaurant. Every time I go to New Orleans I wan","useful":1,"cool":0},"RdardAyxAPAdl1fVuaSlQQ":{"text":"Houston's is an amazing, comfortable and delicious restaurant. I ate at the bar since I wa","useful":0,"cool":0},"C7odYlCbuMCAdhPkOy06VQ":{"text":"Can't beat it!  We sat at the bar and the bartender was excellent. He was very knowledgeab","useful":0,"cool":0},"Ry71uCGOzsBLzJRHNgc-CQ":{"text":"I've always been a Houston's fan. Love every dish on the menu. The attentive service is wh","useful":0,"cool":0},"TNKexY2UgISr2JyGw4LQyw":{"text":"This is one of our all time favorite place to eat. We've have eaten there many many times.","useful":1,"cool":0},"yjqU-GPKS01wdfrzKas3ww":{"text":"This past Friday, I had my birthday dinner at this Houstons and had a wonderful experience","useful":0,"cool":0},"XDaqzIXrfVAPh-2F_em7yA":{"text":"If I could give this place a zero, I would. Initially when we walked in the energy from th","useful":0,"cool":0},"puqyV3ahIpsEMvqGrCjj0g":{"text":"I know it is a seafood joint, but after discussion with the waitress I decided to go with ","useful":1,"cool":0},"kHjhMY0tJ30jP6fFdkIrZQ":{"text":"This is my fiancé's favorite place to come to when we visit his hometown of New Orleans! E","useful":0,"cool":1},"yosmEbioBlKvLtaSJ2ecjA":{"text":"Love this place!!! We had one in Metairie years ago, I miss it. The atmosphere here is nic","useful":3,"cool":0},"d1mkWECIuvcjAnAqJtipbg":{"text":"Houston's is top notch! We decided on Houston's after being so tired and weary from walkin","useful":3,"cool":0},"LSLtRWTuZ_jNZTg1CrVnBQ":{"text":"Easy to say - 5 star lunch!! This was as good as it gets. Sat at the bar bc I only have an","useful":3,"cool":0},"VkfFwhoJM0Ad7OE2Z-Uy9w":{"text":"We used to live at the one in Boston- soooo sad they closed :(! We were delighted that our","useful":0,"cool":0},"CWd3a7y75iBTTBxwKRqQTQ":{"text":"After a long sightseeing streetcar ride, we were thrilled to step into the cool air-condit","useful":1,"cool":0},"fVL0wZzB64P9NCbDIA1FMA":{"text":"My family and I went Houston's for a birthday dinner. The pros: the restaurant is absolute","useful":1,"cool":0},"HTeIVxK9rs73x52VYydZYw":{"text":"My boyfriend and I had a wonderful date night at Houston's. He had the Hawaiian rib eye (t","useful":1,"cool":1},"Y7cYtsJi-icsG1NmXE9jnQ":{"text":"Loveeeeeeeee it.  Had the salmon with kale.  Pretty great mean.  Waitstaff was attentive a","useful":0,"cool":0},"6OuGuxJGy36ZUkgXqWQofw":{"text":"It was pretty darn good.  I had the Hawaiian which was a ribeye with a ginger soy/ teriyak","useful":1,"cool":1},"RbaZqC8Jt7ZtqqboSBFaAQ":{"text":"Love this location! Live jazz and great food. I always order the smoked salmon, kale salad","useful":6,"cool":1},"NErhMafALMkKC152jHV2cQ":{"text":"I came here with my boss for a belated birthday lunch.  Ordered the spinach and artichoke ","useful":2,"cool":0},"HAQEQ_5Nto7Wxk0vp-Ilaw":{"text":"Amazing Steak. Amazing drinks. Amazing service. Everyone here is extremely friendly and th","useful":0,"cool":0},"DM73jgA3-dET8dY61GgGeA":{"text":"I have been to Houston's 30 or 40 times. It is always a great experience. Seriously, every","useful":3,"cool":0},"G8AIPAzUk13aDB7sy1vcuw":{"text":"Very Disappointing!    Went there to celebrate a small (4) Birthday Celebration.  Was told","useful":0,"cool":0},"XxaFoAa8de6ISAIOoxppRQ":{"text":"Slightly above average. I'm lost as to why this is so crowded. Caesar Salad was exceptiona","useful":1,"cool":0},"wrgyrxk1alG1NjesPh1CIQ":{"text":"I'm a local and just love lunch at Houston's.  Sat at the bar (again) and had grilled arti","useful":0,"cool":0},"fiGbhCBYT83rT1xuIoVgjQ":{"text":"My wife and I had the grilled trout and ribs, respectively. Both were amazing, as was the ","useful":1,"cool":0},"KHjFqe3piz-aUwcW0OPx-A":{"text":"so rare to find outstanding service, great atmosphere, excellent presentation and deliciou","useful":1,"cool":0},"WNTd8bNipx48oLnlfaNxtw":{"text":"Went to Houston's during the evening. They had run out of baked potato soup, they did not ","useful":0,"cool":0},"g0n8f3EPF-WCnoQwv-yv0Q":{"text":"One of my most favorite restaurants! Everything is always delicious! I highly recommend th","useful":0,"cool":0},"QiC19swW-WtK0pTiNN2iaw":{"text":"Well, we were stuck driving between parade routes and ended up at Houston's....I love this","useful":0,"cool":0},"823TPyKPcT3mCr9fwK4nng":{"text":"Last Saturday my girlfriends' parents ordered the Hawaiian steak prepared just as they hav","useful":1,"cool":0},"pL-IVcMFxMAfvnuEmig60A":{"text":"My salad was sub par.  I thought the apps were average at best.  Atmosphere, cleanliness, ","useful":0,"cool":0},"dh3dAEG6ky77UkN0Vq7Xdw":{"text":"Wow what a great time we had visiting this restaurant. David our bartender was super frien","useful":0,"cool":0},"yT8VuGUTmCm0RMUUvX_DZA":{"text":"I've been to Houston's in 3 different states and this one is the best by far! The prime ri","useful":0,"cool":0},"w12vgWdtYVwcWLl2wdxqgg":{"text":"I always have a positive dining experience here.  Recently, after parking in Houston's rar","useful":0,"cool":1},"6L9qdxCXUaaIOjE0TG9XiQ":{"text":"omg omg where do I start! My boyfriend and I are regulars here (when we can afford it lol)","useful":2,"cool":0},"xj_ODKe-y3JXFrm1VMdimA":{"text":"The flying chicken platter has returned (for lunch so before 5pm)!!! It's the best chicken","useful":2,"cool":0},"SpjXTCyu3T5GY2Ppuqk1ig":{"text":"So dang good! Houston's was a restaurant my group happened upon while walking around and w","useful":1,"cool":1},"1OAmbcbGzK3rpWm_UlbRNQ":{"text":"I moved to New Orleans almost a year ago. What took me so long to finally eat at Houston's","useful":2,"cool":0},"wsSwLVnZLclubpuzyNtTfA":{"text":"I ordered the Double Cut Pork Chop and baked potato and it was DELICIOUS! I didn't think i","useful":0,"cool":0},"2jV0qMJyFkTOI3v5aAzfMQ":{"text":"Went here for lunch with my boss and President of the company I work for.  Had the Mexico ","useful":2,"cool":0},"7d3kU2Up54tthsn0HkukAQ":{"text":"What a steak!!! Would definitely visit again ... nice atmospher, can be a bit of a wait, b","useful":0,"cool":0},"QsOLbK4K2uLoSjK2bWUAEQ":{"text":"Houston's is a go to for my family. They always have great service, and great food. My per","useful":1,"cool":0},"cD8t_MluZXRP94HLfJwkbQ":{"text":"Went there for a date night, it was very loud, so I couldn't hear my date. However, the fo","useful":0,"cool":0},"mH1_AI7mPOJZdhxRBN_bCA":{"text":"Always good and the large portions mean you will have leftovers. I've never been disappoin","useful":0,"cool":0},"4qU6AUVzfnZk5pXCXF-rDQ":{"text":"Houston is one of\nMy favorite restaurants over the years.  My first experience with it was","useful":0,"cool":0},"mN2KRoGrJH1bmWVVkHzI-A":{"text":"I had the French dip which was excellent. I know this is their signature dish so I had to ","useful":0,"cool":0},"ZrDWDFQ1T7tzHEkN_VS3kA":{"text":"This is a nice, beautiful restaurant in the Lower Garden right on St. Charles Av. A jazz b","useful":4,"cool":2},"2w0-HwMQXoEICUPpQJM-Rg":{"text":"Wonderful isnt enough to say how good this place is and consistent too!\n\nWe love the wood ","useful":3,"cool":0},"XqZFeFlDppEBitUdxP9xzw":{"text":"My family and I went to this restaurant about 2 weeks ago. My husband and I found our stea","useful":2,"cool":0},"NOVquESIIPdesds2GskDxA":{"text":"This week I had the pleasure of eating at Houston's in NOLA. I went early before the dinne","useful":0,"cool":1},"rWKPP0hvKYc3BJwdhhBtpA":{"text":"Even tho I can be a snob against chains - this is that exception to the rule! I recommend ","useful":0,"cool":0},"csVUZtQwD8fzv4YOZdgjzg":{"text":"This place is amazing and the food is incredible. The prime rib is to die for.  However th","useful":1,"cool":1},"uOeeIZLFeSTtPuyCozeEEg":{"text":"Hawaiian Ribeye one of the best! Caesar salad with house made dressing is amazing. Service","useful":1,"cool":0},"-M9A7Km8buee6YHjvNkhhg":{"text":"Ordered a burger 2go from their online platform. Unfortunately there was no space for spec","useful":0,"cool":0},"sO9dlVv7j3d69kQ_RkfmdQ":{"text":"The ribs did not disappoint, they were absolutely delicious. I had never eaten the creamed","useful":0,"cool":0},"G3IJ4KQxu8hiCaNe4EN3hA":{"text":"I went to Houston's the other day for a work lunch outing, and was unimpressed. The food j","useful":4,"cool":0},"wfDBSOgCQnETkKp3Qx-ujA":{"text":"To go order! No we are a dinning establishment. You can go the bar sir and sit there. Real","useful":0,"cool":0},"GHMAhft-Fh4m04P2Qvz2gg":{"text":"My husband and I really enjoyed our meal here! I had the bbq ribs. They were flavorful and","useful":0,"cool":0},"oUy-QUsUPPiQ3S3yumwPYg":{"text":"This is a long time favorite of mine.  They no longer offer child seating and I am not sur","useful":0,"cool":0},"HnAWind1NLEYIIJGmZNx3g":{"text":"Food was delicious but the service was lacking. For such a nice place the service should b","useful":0,"cool":0},"wzaDieAOET3CpxOLTDpVZg":{"text":"Houston's has changed over the years but as a chain restaurant, it has dependable, good en","useful":0,"cool":0},"AVJQU58hkuAf5bBGCFykpw":{"text":"Houston's offers consistently good food and service on a wide range of American classics f","useful":0,"cool":0},"z2gFBFwDLleSpZCjkcGVuw":{"text":"This place is legit. Loved the rich oyster appetizer and my well seasoned and fresh redfis","useful":2,"cool":0},"5dsQ_bUXD8W3ExNE8oGa5g":{"text":"I know it's a chain, but we love Houston's. The smoked salmon appetizer is wonderful: mois","useful":4,"cool":4},"TZQCTRCoBySYAzP717_d3Q":{"text":"This is our go to restaurant for consistently great food and service!!! I am NEVER disappo","useful":1,"cool":0},"I9lXqd0fHSK07d6MC9hgWg":{"text":"Houston's is always busy around lunchtime​, as it's had a long-standing reputation of bein","useful":1,"cool":0},"uWAIhJYnL1mRoIkqgJ8ZFw":{"text":"Absolute perfection! From the moment you enter to the second you leave, awesome place! Cle","useful":1,"cool":0},"FeyQH6HR4o4VbaaOeeRaxg":{"text":"We ended up not needing to wait the 45 minutes for a table by sitting at the bar. So many ","useful":0,"cool":0},"nYjqawlmWenlD-_0L5jVRg":{"text":"Sevice and food is geeat, but social distancing for table not so much. They are sittng tab","useful":0,"cool":0},"g4rj1FsRLKJAYzkSohZgew":{"text":"Came for lunch on a week day.  They were doing a fabulous business and we waited about 30 ","useful":4,"cool":2},"Q6_edQweWSZbK9Qg_5tphg":{"text":"Well. What else can I say about Houston's? Service is always superb. I always order the Ha","useful":0,"cool":0},"cQ3XBSEgQNb3EJ3BFyO0MQ":{"text":"My friend and I decided we wanted steak for dinner. I live down the street and have heard ","useful":0,"cool":0},"6XL2JZMT90w2KNED16Iw-A":{"text":"My boyfriend and I had a wonderful date night at Houston's. He had the steak and I had the","useful":2,"cool":0},"KRopQchvrqlMWbYI6SSblQ":{"text":"Was eating here for lunch and my child was crying and being fussy nothing major right no b","useful":0,"cool":0},"phGMdmsAReqU3zK9OPqyHA":{"text":"This is one of my favorite restaurants. The Hawaiian Ribeye is so delicious. A little pric","useful":0,"cool":0},"WGb1iKZinrlHq-YZAnaE2g":{"text":"Our server, David, was exceptional! Everything was wonderful! All safety requirements were","useful":0,"cool":0},"Blpviq8wsZXJzRbxYhlAiw":{"text":"One of my favorite places to frequent as a local in New Orleans. Houston's has a good ambi","useful":1,"cool":0},"Av5CJ8Ty4DNwduyJtmUQGQ":{"text":"We tried to go on a weekend without a reservation. They said sit at the bar, it's first co","useful":0,"cool":0},"MQO8d1sVulISZdZjnp0iIg":{"text":"If I could give this place a six or a seven star rating I would. I have absolutely nothing","useful":1,"cool":1},"FgjQShY-Ru8GAExL8O0Dxw":{"text":"I had the worst experience at Houston's of my life yesterday then on my birthday so I got ","useful":0,"cool":0},"pyphyzkWveQvgGKJCPzIjg":{"text":"We tried coming here for a couple of nights in a row, but long wait times repelled us. Onc","useful":0,"cool":0},"vyNmj-lcqfbV86c-UFRPyw":{"text":"OMG! This place was amazing. This place has become one of my favorite places. The place a ","useful":5,"cool":1},"dREfsbQstdjDxyZ3Hki5zA":{"text":"Yum yum yum\nHad the pleasure of dining in this restaurant in June right before a surgery a","useful":0,"cool":0},"nw2SEhAGz6-qbbX938iSSw":{"text":"I love both of the locations in Houston, however after trying the location in New Orleans ","useful":0,"cool":0},"CUX_EKsLgZD7eKupugtQaw":{"text":"The ambience and food are simply amazing! The Hawaiian ribeye with their creamed corn and ","useful":0,"cool":0},"H-4a__QtxudCZ-vq0dRO4Q":{"text":"Why haven't I written a review for this place yet? This is definitely one of my favorite r","useful":2,"cool":0},"th6uZI5GWpmUlx14-dTBtA":{"text":"We first headed out to Houston's because of the Bon Appetit profile. Andrew Knowlton absol","useful":3,"cool":1},"4t_cG1iyRi5T-ohq9H440g":{"text":"I'm enjoying the smooth live jazz band, the ambiance, and my wonderful cuisine. I ordered ","useful":1,"cool":1},"pCJGoxRkWXd5aEaBZQ0q8g":{"text":"Once again we had a great experience at Houston's. This time we went for lunch and it was ","useful":0,"cool":0},"Ps2R16whRGns2GqqfmCM5A":{"text":"This has been my favorite restaurant since I was a kid! The only complaint I have was the ","useful":3,"cool":0},"fMw9qWD_baNv5V5YbgbgVg":{"text":"The best salads ever!! And I'm a big eater! Also had the grilled chokes and dipping sauce.","useful":1,"cool":0},"wTwgknihQcRHeiMSt9d5Jw":{"text":"I have been going to this place since 1985 and my love for the food and the awesome atmosp","useful":0,"cool":0},"TnY-YOGRfE1PskabZYYf7Q":{"text":"I mean amazing Always\n\nWent at 630 as I was just craving some good old Americana\n\nI ponied","useful":1,"cool":0},"avlKlFCMiOC__TdmunYYkQ":{"text":"If you just can't think of where to go, but you'd like great, professional service, consis","useful":0,"cool":1},"RVFvN4rLmMj3BT8w_KcIWg":{"text":"Did not know that Houson's was a chain restaurant until reading the previous reviews.  An ","useful":0,"cool":1},"TAavF6N1RuJ_08KACyF8vw":{"text":"All I can say is pleasantly surprised. Since Houston's is a chain restaurant, I had never ","useful":3,"cool":0},"Qbw3kL2wSNYKbX0TctSvYw":{"text":"I love Houston's. Literally everything about it. We consistently come here and get superb ","useful":0,"cool":0},"R8YmFKpDQq_XCcwG9jNHSQ":{"text":"A little more pricy but service and food is excellent. I love the dress code and no cell p","useful":0,"cool":0},"nrVHqvqPLrUvv4ZFfsTkVw":{"text":"I heard so many things about Houstons I have always wanted to try it and it did not disapp","useful":0,"cool":0},"xkjEuaPMvbXMXgTDeDNldA":{"text":"Not the same Houston's. Food quality is off. Some of our favorite menu items are no longer","useful":1,"cool":0},"Qb26hy8bz0ta2Fa-SAed6A":{"text":"Houstons.... Always a great meal here. I had lunch with a buddy there today and we both ha","useful":0,"cool":0},"AzbGQsoNtWLg-b2DwAfc8w":{"text":"We had dinner yesterday at Houston's, our reservation was at 8:30 pm. We got to the parkin","useful":2,"cool":0},"2PHbO_H4VRsodrN8IzZYyQ":{"text":"I wanted to impress a new lady friend of mine and took her out to Houston's since I had no","useful":5,"cool":3},"NHqpy_jW7ef5STHlEEitKA":{"text":"Great chill out vibe even for a solo dining experience. Excellent service delicious key li","useful":0,"cool":0},"yFkAcXAjQn8mH4PviZ8Ydg":{"text":"I must admit. This was first time going to a top 5 star restaurant and I was very impresse","useful":0,"cool":0},"fgqdFKHiohoZGQNJmgCQuw":{"text":"WHERE NEW ORLEANS' DEALS ARE DONE ???\n\nNOCC IS, AND HAS ALMOST ALWAYS BEEN, A DIVE. \nIt's ","useful":5,"cool":2},"Qx7XOijU8hOTGRfWg5K-oA":{"text":"Disturbing.  I have a special needs child who only eats certain things.  I asked for tende","useful":7,"cool":0},"mpjmRylS4TnR42xYnnQbYg":{"text":"Yum yum yum\nHad the pleasure of dining in this restaurant in June right before a surgery a","useful":0,"cool":0},"4OPsvNV5CslHEXuNO_6g4Q":{"text":"HANDS DOWN THE BESG STEAK IVE EVER HAD. The steak was perfectly sweet and charred. And the","useful":0,"cool":0},"ufWPRt4RAcCnCvZ41eUiwQ":{"text":"$22.00 AT HOUSTON'S:\nSashimi tuna salad, diet coke - no refills.\n$20.75 AT COMMANDER'S PAL","useful":8,"cool":2},"Z95Qlw3RRXIq7ZCkTg7cHA":{"text":"Being from Dallas, TX, I never thought I'd be a fan of Houston's, but I am! It's a nice re","useful":9,"cool":7},"6RKn_HJ11kmuHcbBAFvxDg":{"text":"Someone looking for a great place to dine, with great ambiance, delicious food, and a grea","useful":0,"cool":0},"e0F86D6bMvu5bVmchRxfUg":{"text":"Sad to say that after dining here since 2004, we won't be returning due to numerous bad ex","useful":1,"cool":0},"7IHBKAze1awuzXP6yGcN-g":{"text":"Upon entering, spot the blown-glass crawfish art installation that denotes the greeter's s","useful":2,"cool":0},"lASFbjJniXA_Xmr0SI-1og":{"text":"Went for late lunch on Saturday. Despite having reservations and the place being relativel","useful":1,"cool":0},"q7FB1YKBr1QWf--e5xYeeg":{"text":"OMG!  This was a lovely experience from beginning to end.  I've dined at Houston's and Hil","useful":1,"cool":0},"LldGft_UygLrYmzeIpYPbg":{"text":"Always a great experience. Went late on Easter Sunday.Greeted and sat immediately. Service","useful":0,"cool":0},"G_6V3arMmmrnVBWM_LILmA":{"text":"Gross and Rude!!!!! \nI could of made better food at home and I'm not a Chef. Five of us we","useful":0,"cool":0},"sS1nXbbXRDoAk73OTdI1cg":{"text":"This was previously our weekly spot when the kids were toddlers.  My favorites were the sp","useful":0,"cool":0},"czGzfwR_sdawokm1WunzrQ":{"text":"Always a true classic. Normal food done to absolute perfection every single time. The best","useful":0,"cool":0},"RVKpXjhij4ux_4AUh0MAbQ":{"text":"We decided to eat here based on my father in law's recommendation of the ribs he had the n","useful":4,"cool":0},"PkmqyWhnd70L2oSpge-6Bw":{"text":"went there with a guest and ordered 2 steaks mid rare but both came to the table raw. I di","useful":1,"cool":0},"RSwrVsXp0zrnDKFMEntJ2g":{"text":"The meal we had at Houston's in New Orleans was absolutely fantastic! My husband and I bot","useful":0,"cool":0},"PllbcIwZTOZehCWv7vJ4Eg":{"text":"Only giving one star because I have to other wise they would have zero !! \nWorst Houston's","useful":1,"cool":0},"ElS3Hwa77qrYS1Id1UjqaA":{"text":"The food (hamburger & ribs) were both delicious.  We are staying in a hotel nearby and ord","useful":2,"cool":0},"s0qfAYxRlshghQf2Lgq8Dg":{"text":"5 out of 5 stars , atmosphere was very inviting and candles on every table . Food was deli","useful":0,"cool":0},"Lf7JJM6SWdOnNljJoTOONA":{"text":"I'm never disappointed with Houston's on St. Charles Ave. The lighting and smooth jazz mas","useful":5,"cool":3},"FEQdll2c1R4TKYfkBWZHlA":{"text":"Most racist restaurant in New Orleans black and Spanish  people please do not spend your m","useful":0,"cool":0},"8FVMIWktD8b9CbYKraLkWg":{"text":"Food is good, waitstaff is good, but the host was rude and insulting. I've been to this lo","useful":3,"cool":1},"OYT7mZwwEtkinqlK_hKB1w":{"text":"I've had excellent customer service at many restaurants, and I've had terrible customer se","useful":2,"cool":0},"tLP9tObn2Ggf_tfg0S95rw":{"text":"Came here with my friends to celebrate one of their birthday. Place is on the pricier side","useful":1,"cool":1},"-SsPoao9xwdG91JGFkXn5A":{"text":"Although the atmosphere and service was terrific, the menu at this restaurant is a disappo","useful":0,"cool":0},"GIcSQFmTKzf1eYJzRuGdpw":{"text":"The food was made perfectly and everything came out in a good timely fashion and the music","useful":1,"cool":1},"Cr0JsdgUOWMYkxWUCH_tlQ":{"text":"Would give zero if possible. They have exceedingly poor customer service. The manager is a","useful":3,"cool":0},"rm94mG6WT8V2y5cosGVG9g":{"text":"Very good. For salmon being fish you can't find within 1,000 miles of New Orleans I would ","useful":0,"cool":0},"XlYfV2b6QhVWG8eoXuzaDg":{"text":"This restaurant has definitely changed. They should post a sign on the door stating that \"","useful":3,"cool":0},"oQC8mVGvYjwZhAOoJpSxbA":{"text":"Houston's on St. Charles is a restaurant you have to try. The Hawaiian steak is cooked to ","useful":0,"cool":0},"X1JsmTBLQ1eI520znl4y9w":{"text":"Wow! We only had time for one meal in New Orleans and I'm glad we chose Houston's. First o","useful":0,"cool":0},"wOAJlUq9eraSxrSCl1X23Q":{"text":"Houston's never disappoints for its quaint intimate  atmosphere and excellent dining.  Thi","useful":2,"cool":1},"vd8RCUAkoVKWz2_V7DF3DQ":{"text":"The oyster St Charles was good. However, I did not like my experience as my crab cakes wer","useful":0,"cool":0},"5fZhIwsYN3e_KcXsQ505HA":{"text":"They always had a delicious hamburger and the service was good. The parking situation is n","useful":0,"cool":0},"yLhPOE9N0MGGB4rsbs-Ssg":{"text":"Racist general manager almost ruined my graduation lunch. I wanted to go to this restauran","useful":0,"cool":0},"D2EiKs7Qix-d5ibLlsCDfg":{"text":"I normally have a great dining experience here. I'm still disappointed that the baked pota","useful":2,"cool":0},"6mhSq9dLYB0Z54Axlch4Ew":{"text":"These people used to be so very good, but it seems like they are full of themselves now. T","useful":0,"cool":0},"oJ5-NPPAuzp_6drfNV052Q":{"text":"Nice seating,clean atmosphere and very pleasant service. I didn't enjoy the French the dip","useful":2,"cool":0},"RwoXOjzWvpSHykBw4Z4JAg":{"text":"Sarah at the bar was such a pleasure to be with in this catastrophe of Hurricane Ida. She ","useful":0,"cool":0},"Uv6bH6XhlqyLAIxhNQjTcw":{"text":"Love to go here every once in a while for date nice. Excellent service. Recommend booking ","useful":2,"cool":0},"HuZr9A_fHNk7v2LjWNQOlw":{"text":"Houston's was truly my go to spot but it just hasn't been the same since they stopped sell","useful":2,"cool":0},"cmcVpJSUpvboZ0tmPE2k-Q":{"text":"A great experience turned NIGHTMARE!! \nI will start off by saying I have dined here a few ","useful":1,"cool":0},"uJjFgdjnhJsmEXWhHQovxA":{"text":"We came here on the eve of Christmas Eve.  Easily seated and reservations were easy to mak","useful":0,"cool":1},"k6fqHKfIJAyfdHG2DCVjXw":{"text":"Now during these weird times, going out to eat may or may not be my saving grace. When I t","useful":2,"cool":1},"jdif3kwmjo3CM84HkRtl3w":{"text":"My husband and I are visiting from Florida. We had just left from visiting the House of Br","useful":0,"cool":0},"z-5Yx-_pc3iApcDrkDO6eA":{"text":"First time here, and I am impressed! It reminded me of Ruth Chris (atmosphere, price, etc.","useful":2,"cool":1},"8aDd6zy0a5miD6LkIw124g":{"text":"Just adding a forethought-- This restaurant has a health sore of 78 out of 100!  YUCK!!!  ","useful":5,"cool":0},"q87au9Fd-Y1lEJmr1a1gQw":{"text":"If you want to be satisfied in food and service, just come here. Houston's will always be ","useful":2,"cool":2},"lpKYymM2NwrB74a6zizmdg":{"text":"Burgers are amazing and service is even better (if that's possible!) Jordan at the front t","useful":0,"cool":0},"sSwQMOtgXrW-oH6f-AHYuQ":{"text":"I love Houston's! The spinach dip is amazing! But I really just have to rave about the Haw","useful":4,"cool":0},"xaOCskEmT-9daoY5857c2A":{"text":"My experience was horrible. I felt racial tension from when I walked through the door unti","useful":1,"cool":0},"JtjuUrnUykEg7XDI1TpbhA":{"text":"We decided to treat ourselves to a nice dinner for the fourth of July. Nothing screams Ame","useful":1,"cool":1},"ZPjQnij8eO6wTrEGkCHlNQ":{"text":"I love Houston's ! I always get the ribs and a side of loaded baked potato. They are curre","useful":0,"cool":0},"GCqrXyjFpn6NFUnqQ43HJg":{"text":"Houston's is always recommended to me by colleagues in the area and I finally decided I'd ","useful":2,"cool":2},"xY4eS_LCf8C2Lifa04HGqg":{"text":"MANDY BELLENY (or whatever name of that nature) needs to be released from her duties of th","useful":0,"cool":0},"lx3yGO_Qmwo0rmgsWq5lAQ":{"text":"Houston's restaurant deserves a standing ovation for their Steak, specifically the Hawaiia","useful":2,"cool":1},"Eq8JLfyLJ5pFrFt9CjrwOQ":{"text":"I have been eating at Houston for at least 20 years. They have always had good food but th","useful":1,"cool":0},"_A0v5S9eTfERGoYfZJ8oiA":{"text":"Houston's never disappoints with service and food.  Started with a shaken lemon drop marti","useful":0,"cool":1},"BBlOzC_s2GcddAexegTYBg":{"text":"I was literally asked to leave with my 1yr old daughter because she was talking in the din","useful":2,"cool":0},"s5BSGu2s-WzF8ZBTZQbZnQ":{"text":"I made a reservation for my birthday several days in advance.  It was for myself, my husba","useful":1,"cool":0},"aG7SOnuJ0LL3JRMaQPvnPQ":{"text":"Let me start by saying, we love this Restaurant i have been eating her since i was a young","useful":5,"cool":0},"WUWwrJUSQtsQNSohLxCKYQ":{"text":"Service was good. Enjoyed the live music. Rotisserie chicken was very good. My husband had","useful":0,"cool":0},"m0kH_xfTQobXCainhFLBPQ":{"text":"Houston's, you guys have great food, I won't deny it, but lately, when I stop by with rese","useful":2,"cool":1},"7-C8ZJsLUPatJgDJM5mrHg":{"text":"I will not come to this Houston's restaurant again. Hannah E. was not a good waitress...Sh","useful":0,"cool":0},"TYcOJ1nOF_JFv2vCVOQ0wg":{"text":"I was really happy that Houston open back up for business after the lock down. I love this","useful":0,"cool":0},"4fx2Ld6jHb0fkvX3U5F6gQ":{"text":"Sad to say how racist this restaurant is. Please, if you care about humanity do not dine h","useful":2,"cool":0},"kby3vAv7w_KhoxKppindgA":{"text":"I had a very odd experience with Houston this time.   We normally eat in the bar which I g","useful":2,"cool":0},"RtIE5qAyKBLczxniFNB7QQ":{"text":"We went to dinner at Houston's in New Orleans.  When we called about reservations the staf","useful":0,"cool":0},"26Zy845Z8udxyR6bugOwbQ":{"text":"We LOVE Houston's. The food and drinks are always fabulous. However, one of the pompous ma","useful":1,"cool":0},"6TDR48j8zO80JpElfTDn3g":{"text":"One of NOLA's staple restaurants. This place has been here for years and years which tells","useful":1,"cool":0},"QHTDGKc9iUGuK-mjgl9oFA":{"text":"So of course we went during the lunch hour, don't do that unless you want to stalk people ","useful":1,"cool":0},"zMi6FG9lckJ-mj3_3J3_0g":{"text":"What a great restaurant! I enjoyed a delicious margarita while waiting for an amazing smok","useful":0,"cool":0},"DfHxDGeTelm5JXS_58Kr8A":{"text":"I don't know where to begin. The spinach and artichoke dip is amazing, if you like fried o","useful":2,"cool":1},"Ul-ujQBi5TiIJSZQiOf-sg":{"text":"I went back to Houston's and this time was offered the special which was a nine ounce Ribe","useful":2,"cool":0},"OZin0CM6T5gCbo3Apg2Xlw":{"text":"I have been going to Houston's on St Charles since 1993. Chefs come and go but the food is","useful":1,"cool":0},"5zE3Rq1V0nBhkAstrzC_0Q":{"text":"This is a fabulous place! The environment is sultry and great for dating. I had the Shrimp","useful":0,"cool":0},"yEmwd7iZs4pF_rvru8SHIg":{"text":"I'm always happy with Houstons and Hillstones and this was one of the best experiences and","useful":0,"cool":0},"zDzpTSX92IK0d58ECxBrtg":{"text":"I was asked to leave because of my \"dress attire\" I was wearing a simple t-shirt and ball ","useful":0,"cool":0},"fxAkjVcuyNxHcysyCl1Ozg":{"text":"Fine dining or casual. Music at times. Price of dinners are $30 plus excluding beverage. N","useful":0,"cool":0},"CpkqeM9IO61L5Unk8S7njQ":{"text":"So, with girlfriends, eating spending $292.43, was told when we ordered a round of wine \"w","useful":2,"cool":0},"q75Dh2ahiD0raX7ZMbJPkg":{"text":"This is my 2nd trip to a Houston's Restaurant. My first trip was on the east coast in Beth","useful":4,"cool":0},"YvCC0IRqMU9K4mjBrMUYTg":{"text":"Wonderful story the waiter Jude was great sad to say the waiter is the only thing good I a","useful":0,"cool":0},"UoWRGGHxnCGbZHj3HdtLoA":{"text":"I've never encountered a restaurant that charges a premium for take out over eating in.  S","useful":2,"cool":0},"vlgpxJb8qarz8-LQSIfpFg":{"text":"We went 8 months ago to get a good food experience that went oddly.   Maybe not completely","useful":1,"cool":0},"oyH1ZSETT0JJndgCITlvYg":{"text":"Racist general manager almost ruined my graduation lunch. I wanted to go to this restauran","useful":0,"cool":0},"yxscD36b6ut_uwLMC8AzQA":{"text":"It is an EVIL chain restaurant and I HATE chains!!! That said of my STRONG aversion they d","useful":2,"cool":3},"EXaNyUqeErQA03z-Mbq8Zw":{"text":"The pan seared tuna was excellent. Service was quick and polite. Great cranberry and Tonic","useful":1,"cool":0},"8jHpMoT48CnsYTkV5cAVEQ":{"text":"I went to Houstons on St Charles Avenue on the recommendation of our hotel staff. \nWe get ","useful":4,"cool":0},"hk_rMU9wYwVsoXpWUldnpw":{"text":"There seem to be mixed reviews about Houston's. It seems as though the people who dislike ","useful":2,"cool":0},"qb-cwAus6Fw-DbYGNIxN2g":{"text":"Today's visit was not what I've grown to expect at all. The service was top notch, the you","useful":1,"cool":0},"htAuFaoUsZ8Sr4WkThdt6A":{"text":"Racist general manager almost ruined my graduation lunch. I wanted to go to this restauran","useful":0,"cool":0},"I0u4TlsclyXVBho1vJVy6Q":{"text":"Always felt this place was overrated. I'm originally from Atlanta and I don't care for the","useful":1,"cool":0},"_ahCu932CIO_JCicEeWc-w":{"text":"The Hawaiian ribeye has never disappointed. I always get mine medium. This is not the fanc","useful":0,"cool":0},"jPfPR8a7kqLlkMQdyiyskA":{"text":"One of the worst experiences at a restaurant. Came here with a party of 5 (2 adults and 3 ","useful":1,"cool":0},"3AhFzhjrK9VAO5kj3v1fCw":{"text":"So I e been coming here FOREVER and per usual I order the Hawaiian Ribeye with a loaded ba","useful":1,"cool":0},"II2hEN3Xw4oWkYgkh1H3EQ":{"text":"For a steak house was kind of let down by the steak, it's not what you would think.. oh ye","useful":1,"cool":0},"az8pas5SknLycoLrUVnGDA":{"text":"I usually get great service at Houstons. However, this time one-third of the restaurant wa","useful":0,"cool":0},"pw20tOqyHc5LyV-c7L9alQ":{"text":"I need help.  Houston's refused my credit card because it did not have a chip. I need to k","useful":0,"cool":0},"0R6SQwojyJ5lMQ0xnqoj8w":{"text":"My daughter and granddaughter and Cousin went to have lunch at Houston on St.Charles Ave. ","useful":2,"cool":0},"ymDuqS4CFZP8SxEr7Qlk_w":{"text":"I have always known Houston's as a place for great food every time i go there. Yesterday, ","useful":3,"cool":0},"H1Lgn98TKx3ztjusyIoWLA":{"text":"if I could give it a ZERO I would. The very rude hostess told me my shirt was too revealin","useful":1,"cool":0},"w4QHhL-iYp2JK8i6oEPhOQ":{"text":"Houston's is one of my favorite restaurants in New Orleans. You rarely need a reservation ","useful":0,"cool":0},"XnsuStobanie9-moR_n1BA":{"text":"Spinach and Artichoke Dip = Delicious!  The chips are fresh and crispy and the dip can't b","useful":0,"cool":0},"WyAhfDNELIuLEZOwve2ZZA":{"text":"Houston's used to be a staple in the New Orleans community. The last 3 visit there I've en","useful":4,"cool":0},"ZhXc94iUZNFsMMbS9h8CTA":{"text":"Food is wonderful, but the service could improve. My gf had to pick up an emergency phone ","useful":1,"cool":0},"rC3MSGfVp2vs1_zwNUUOPQ":{"text":"After a tough Saints loss I decided to treat myself to a good meal. I originally planned a","useful":0,"cool":0},"j4Gmj2EbNkzgJ0R-RZNR5A":{"text":"Terrible service! My husband is in the hospital and craving food from Houston's. We are fr","useful":2,"cool":0},"9HuLjxN2tz5X_jhH4YFdJQ":{"text":"My oldest daughter just graduated from high school so I took her and my other daughter to ","useful":1,"cool":0},"u_2AEHeUobuXufiPSCxtOg":{"text":"I've been to Houston's in Metarie and this one. Both times were wonderful. I did enjoy thi","useful":0,"cool":0},"nHEyhiWMR1HqcQYZyMYHSA":{"text":"Houston's \n\nI am sure by now you all have heard about good ole @houstonsrestaurants, but f","useful":2,"cool":0},"aq-QFO1C_Ld-pOLwtBRc0g":{"text":"Excellent food, interior and service. I had the tuna salad and it contains fresh mango, to","useful":0,"cool":0},"TfUWHyOW4ULuphEdJROkaw":{"text":"Great service with an upscale atmosphere.  I ordered the hickory bacon burger.  I really l","useful":0,"cool":0},"EYZsoK8ZfvDWeLlSCamY0A":{"text":"Located literally steps from the St. Charles streetcar in the lower Garden District with l","useful":1,"cool":1},"Bi92ljTNwUEyOYaHt49IjQ":{"text":"Ordered a Filet and it was perfectly cooked and delicious, the atmosphere of the restauran","useful":0,"cool":0},"4J4DZVHwQrIeBUi6HRG8mQ":{"text":"I had great expectations of this place because I always here about it. But I didn't find t","useful":2,"cool":0},"ZtCp6neaXMno_F4MN9c0pw":{"text":"Let me start by saying my server was awesome. He was accommodating and paid attention to u","useful":0,"cool":0},"cxeaFoIVlZfjkqyKEuFxyA":{"text":"Tried to have dinner her tonight and was turned away because I was wearing sandals. Mind y","useful":3,"cool":0},"GBQZdJ7wydXYryfCCfgx3Q":{"text":"Please explain why I'm paying $8 to pick up my own food? What service are you providing fo","useful":3,"cool":1},"5THT_mKqAIuMP5WHZTDBpw":{"text":"First let me say, I haven't been here in years! Fortunately I was able to stop in the othe","useful":1,"cool":1},"tmf_RhK0usrLr66DZhqiDg":{"text":"Wowwww!!!! As many times as I've been here... How have I never written a review? Oh well, ","useful":4,"cool":6}}