{"upJI5sQsXQrilmDPOGlK8w":{"text":"AAAAAAAH Help!\n\nBroken glass all over the floor and later in my shoes and toe. Girl fight.","useful":4,"cool":2},"z28ZdwZjm2hkOE0wX2B86Q":{"text":"This place is one of me \"go tos\" every time I hit NOLA.  You'd probably walk by it 5 times","useful":0,"cool":0},"GoLYnG6vFaXsY5Pq4bzHFA":{"text":"We had a grilled chicken sandwich and a grilled tuna sandwich. They were great. Absolutely","useful":0,"cool":0},"mu1b1oHNiGtJujZc7gMU-A":{"text":"Teeming with saucy Va-J-J from 10-4 friday and saturday night.  As the above member stated","useful":0,"cool":0},"1BWPOjMOVQPH0S-yx1FQHg":{"text":"This place is boss.  It's a dive bar with cool bartenders.  Service is great, prices are c","useful":0,"cool":0},"SG2IPC8u9Xik-YdUBcxmWw":{"text":"Really good food, somewhat forgetful waiter but super nice! I had the burger with roast be","useful":0,"cool":0},"7GWMQW4O3_eutg8zQWTrZg":{"text":"This place is SO GREAT. 10/10 would recommend. Anyone who has given this less than five st","useful":0,"cool":0},"CiUSTgonoaGWbevLOCTOwg":{"text":"The food was...okay. The beer is bottled (thank god). Oh and the cockroaches are the size ","useful":0,"cool":0},"AmgQFQTKImJXqgHifi0I2w":{"text":"Bar fights, cops, dangerous people with guns.  That was this bar last night.  People screa","useful":0,"cool":0},"KFGk5Mfxapf3sHkSoDWcRg":{"text":"I totally agree with Mikey D.'s review of this place. Stopped in for some dancing on my wa","useful":4,"cool":2},"UW5mI6Wq6SI7nk3P7U1L5Q":{"text":"Service was slow, I believe our waiters were probably new and/or undertrained. the food wa","useful":0,"cool":0},"vPKwu5jIFR8ssO7CH7ihQg":{"text":"The service here for food is awful. This might be an okay place to drink if you don't mind","useful":0,"cool":0},"U18yPviUwtYXN-1OZhVVDw":{"text":"Place charged me twice on my credit card! Be aware and don't use your card here!! Also the","useful":0,"cool":0},"-HkYrEBqr-o7QPOGSLqxIQ":{"text":"The food is good but Greg is better. All around fantastic mixologist. Would recommend 12/1","useful":0,"cool":0},"6NH4_D-QGzqJS-ZhOe-KyQ":{"text":"As much as I wouldn't enjoy going there now, when I was in college, I loved this place. Be","useful":0,"cool":0},"hxmgoaIh0kGesqQqDtgW9w":{"text":"Awesome spot to each lunch. Fresh and delicious food. Fresh fries everytime I eat there an","useful":0,"cool":0},"-pG35-Y6OK84N7Q-giVSpg":{"text":"Ohhhh....ohhhhh....mah gawd.....the cook SNEEZED over two plates of food without covering ","useful":4,"cool":1},"fJqKZodHPoNUpqHg4wbvpQ":{"text":"This is a dive bar. If you can accept it, then it's a good place to hang out. Their food i","useful":0,"cool":0},"neBazNIcSWm476SUyTVmCg":{"text":"OK.... Red Eye is a little.... trashy. BUT! It does not stop you and your friends from hav","useful":0,"cool":0},"UpFW7btD4a9Yxj8uxuBx3A":{"text":"Food is excellent. Why the 2 star review?  Never know if they are open or not!  Tried to e","useful":0,"cool":0},"pskK9kIQhxDBZPStRfVb_A":{"text":"Great place for lunch .... One of the better turkey burgers I've had in a minute.... But i","useful":0,"cool":0},"NBsS4XdUESZOnXkui3NW5w":{"text":"This place was recommended to us by a friend for a great place to dance.  \nHardly.  About ","useful":1,"cool":0},"mvEOo6CZqI6lujGgux068g":{"text":"Red Eye is a place where you could definitely have some fun if you grab all your friends a","useful":2,"cool":1},"c4qJes7tYBbSbwONrKoEyQ":{"text":"Go to this place for the sole entertainment value of seeing how fucked up(drunk&stoned, bu","useful":2,"cool":1},"7r9c35TNafSo0OULdQxh_w":{"text":"Local bar bar in New Orleans... that's a good thing... uh... there isn't much else good to","useful":0,"cool":1},"RtFqT027HD02NArDOuCyNg":{"text":"Make it stop make it stop make it stop!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  I wanted out of he","useful":17,"cool":13},"XceKT5Hu5ZdwxrPAJsgA4w":{"text":"The place is dirty, the floor and bar top hadn't been so much as wiped down in ages. The f","useful":5,"cool":2},"KKNgx37ZfKvCBC5LRKZv-Q":{"text":"Wandered in early in the morning looking for some food. Idk why but I went for the chili c","useful":0,"cool":0},"CGG2dzPJqHe5ccmvIxcKyg":{"text":"Pretty much exactly what you expect what a Dive bar in New Orleans would be. I'm here with","useful":0,"cool":0},"YnN_X-0DVTQEVuxgpPxQvA":{"text":"A great little dive bar, good service and great tuna steak burgers!","useful":0,"cool":0},"3P7-duNwPUrmojZuW-xq7Q":{"text":"Not my usual cup of tea...\nWhen the Red Eye opened it was more of a diner, right? Or am I ","useful":4,"cool":3},"eOTiVZZY-i8XD3Gn_NCn-g":{"text":"It's good food for a good price. I got broccoli bites and chicken club. The chicken club w","useful":0,"cool":0},"pz1p-n7UVm-rvYkiC8VKVw":{"text":"My co-workers and I had an itch for fried foods one day. So I pretty much ordered everythi","useful":1,"cool":1},"b-72yBvHSLXd54foeoz3kQ":{"text":"This is the biggest late night crowd to be found in the Warehouse District and they party ","useful":2,"cool":0},"dnfrzpqizImo9sS3KoEi1w":{"text":"It gets WAY too crowded in here.... \n\nDon't eat the food unless you're drunk and really hu","useful":1,"cool":0},"Jj-oENmFgO5BJ0v87suK2w":{"text":"What a crappy little joint.\n\nThis grill, which despite it's name offers no obvious evidenc","useful":2,"cool":3},"iWox1o1uSG4MtUHlAj9DZA":{"text":"This is a low key  beer bar.\nIt's got a prominent location on Tchoup in the Warehouse Dist","useful":1,"cool":0},"Yplg9ERrqD1oqOzcmdA2mA":{"text":"Got charged $25 for a jack and coke don't trust these guys with your credit card. The food","useful":0,"cool":0},"NMJRvBXzfSA9bY8Aa5KXyw":{"text":"Dark pub atmosphere. I ordered an alligator sausage at the bar/order station and sat at a ","useful":0,"cool":0},"9WGqs2JIyyNm2xZJA3u3hA":{"text":"This place is great... kind of.  Every established bar fills it's niche.  If you ever want","useful":1,"cool":0},"e9a7kT31lKdAjKFn2c1U4Q":{"text":"I'd like to check in here but closed, with all other signs saying open. Guy says he lost h","useful":2,"cool":1},"L2yUxStkw3UoMHY9sBGIbw":{"text":"There were people crawling across the bar and also walking behind the bar and taking liquo","useful":0,"cool":0},"ZuxedJtMYmuRl1lh3iy62w":{"text":"Cheap and a good little bar. Seems like a very young almost underage crowd when we went to","useful":0,"cool":0},"dl1uNDuPz0ooudbRrZ7sDA":{"text":"Yikes it's been almost 10years since I made my first appearance at red eye. While I've cer","useful":1,"cool":0},"fDtsYA__zQLLLe1kQr6-8Q":{"text":"I came here with my fiancée for her nursing school semester Christmas party.  Surprisingly","useful":1,"cool":1},"oRlSaQiwx8Qyv6I9ZWzSXQ":{"text":"It's really a 5-star or a 1-star establishment depending on your personality, age, college","useful":7,"cool":6},"M4rM2CIegBfuG3mwfJsytQ":{"text":"Love this place!!  First time in NOLA stumbled into this place.  Lucky me because the cook","useful":1,"cool":0},"HrTsiVOZ9505td1moofqhw":{"text":"This is my all around favorite bar, my go to. I left my bra here and worried I lost it for","useful":0,"cool":0},"avpRZloASH7vXfyPlu6fpA":{"text":"The bald security Harris was very disrespectful and escorted me out of the club. when I wa","useful":0,"cool":0},"gkerg6mNRCbYUz0wzmFWRQ":{"text":"Came in for three to-go orders during a slow time during last Thursday's lunch. Nothing co","useful":3,"cool":0},"j8DzuwMx1bXSYLoh-mCZ1Q":{"text":"This is strictly a review of Red Eye as a venue for special events, not a review on the ba","useful":0,"cool":1},"jBWX2R2FjQnF4nWfMa5WoQ":{"text":"I haven't been here in awhile, but oh have I been here a great deal in my past - mostly to","useful":2,"cool":2},"YxGz7viwqJ-0ayzBJZVmZQ":{"text":"I work in the area so my coworker & I wanted to place an order to go since we only have a ","useful":0,"cool":0},"RK6E7Xvxd7Tr8gC10zcP1Q":{"text":"I was in New Orleans for a convention and this bar was right next to our hotel - which did","useful":0,"cool":0}}