{"3ST1PTOCL8BP_GYZGmJYfQ":{"text":"When you have a problem you are lucky to get someone to come in a timely manner and when t","useful":2,"cool":0},"5OMdR3UUEbbSWzYSCW619A":{"text":"Absolute shite business! Complete disregard for tenants, totally unresponsive, no regard f","useful":0,"cool":0},"LJXz1P04kIyUQGFOW0AJ5A":{"text":"I rented from Craig Tolbert for 2 years. My apartment was literally a dream. Then the roof","useful":9,"cool":1},"JT7aihZlwED_Xc9HGvL-KA":{"text":"********I am only giving them a star because I have to. Could not agree with these other r","useful":5,"cool":0},"dztDvy0bi1EbhRQW1WEbvA":{"text":"NOLA Apartments \n4132 St Charles Ave\nNew Orleans LA 70115\n\n\nRented apt A1 Dec. 2017 to Jan","useful":1,"cool":0},"lXK3quPMVcxeXS1ebpmcdw":{"text":"I've been completely satisfied with NOLA Apts since July 2016. I am a very particular and ","useful":1,"cool":1},"SPm7n5YZjn6nbwX4aRNoNQ":{"text":"NOLA apartments is incredible: they are responsive, understanding, and honestly care about","useful":2,"cool":1},"BA_KA8DV_LSa7Tis5gYWyQ":{"text":"This is kind of a what you see is what you get type situation:\n\n1.) Reasonable rent rates.","useful":4,"cool":0},"Ji7TEJ1jG2ky7n6EJcWcDQ":{"text":"Craig and Kelly don't care about their tenants at all and refuse to address problems with ","useful":0,"cool":0},"ThrIzaywEZfLF3zpHEQk9A":{"text":"Craig Tolbert/ Nola Apartments was the best landlord I rented from in New Orleans hands do","useful":1,"cool":1},"kHXvNThZRuQtSVR9GpVB-A":{"text":"Just got out of a lease with Craig Tolbert / NOLA Apartments. \n\nThis was my place on move ","useful":3,"cool":0},"2DmIIoWA05WVq7VyiC17fg":{"text":"Think twice. They're not diligent about maintenance, the building on Metairie Road is very","useful":5,"cool":0},"xiYMnPIGdvnSGOVIul8VIQ":{"text":"Excellent customer service from quick responses to problems and a wonderful leasing agent ","useful":1,"cool":1},"DuxOQtma7htosciw77oXzg":{"text":"I posted a more thorough review under Craig Tolbert Realty, which is also what they go by,","useful":10,"cool":0},"_59r1S6AGvmI3Kf3m1UXCA":{"text":"I lived in one of NOLA apartments/craig tolberts properties for a year. It was $#it hole a","useful":3,"cool":1},"gJ8Qv0buOaV5mh0e1vHvBw":{"text":"It's ridiculous that they won't come fix a renters heat on the weekend because it isn't co","useful":8,"cool":0},"0W38fejG6gQbkzRnJxtqvw":{"text":"I've rented twice from these guys and they took good care of me. A problematic neighbor te","useful":1,"cool":1},"Ur2fR4ZjM6EhPja_5ZpAYw":{"text":"This property management company manages swear different properties all over New Orleans a","useful":7,"cool":0}}