{"SkCHispJ6GqHIrun-lcWfw":{"text":"I've come here a few times & the staff is friendly & service is quick. They do a thorough ","useful":1,"cool":0},"k0esMJJQFYPE5IX8TJtRvg":{"text":"Customer service was off the chart compared to any other clinic I have walked into here in","useful":0,"cool":0},"rdVfQD_esU8DORbGO4BHfw":{"text":"Staff is extremely friendly and helpful. Wish they had an urgent care as excellent as this","useful":0,"cool":0},"FsUQ3U-Kf-EwdlYNm9lkCg":{"text":"I've been here twice.  Both visits were top notch.  What I liked about the second visit wa","useful":3,"cool":0},"3NzU_kew4Wu7OxROTWMeMg":{"text":"The absolute best urgent care facility in New Orleans. The wait time is almost always shor","useful":0,"cool":0},"OKPBqI_KrNt_xzWfcrlH7A":{"text":"Very nice and clean facility. Also a welcoming and helpful staff. Very happy decided to st","useful":0,"cool":0},"gZkEPAEy8l_Jn0SplBV7mw":{"text":"Before going to AUC I went to three other urgent cares that had over a  2 hour wait. The n","useful":1,"cool":0},"ZdVzdzmJiLAuz7--9SCmjQ":{"text":"I called in for an appointment an hour in advance and still waited for 2 hours in the wait","useful":0,"cool":0},"7RSTlfyDX81-CDg2JMINpQ":{"text":"My first visit here was good,  the doctor was nice and they called me the next day to chec","useful":2,"cool":1},"6nZo7-OpgN-39kH-WQcUmA":{"text":"Algiers Urgent Care is amazing! I go often for myself and family members. The staff is kin","useful":3,"cool":0},"VsAUI-xv6hT3fR8cnIWQDA":{"text":"Always the best option when you need to be seen now.  I also prefer to see these doctors f","useful":0,"cool":0},"8Z4Tu3zX0yufi4V0QGnyvg":{"text":"We are visiting from CA, and my almost 7 month old came down with a fever and clearly isn'","useful":0,"cool":0},"xDNBrZmQNP1mudZ5u4QsTA":{"text":"Be prepared to wait 2 hours before you are seen than another 45 before a doctor actually c","useful":0,"cool":0},"GnohqPxDFqQcseFEmjFt1A":{"text":"Loved their kindness and quickness. They were very informative too. I needed to get some e","useful":0,"cool":0},"JA9rronOB-oUAL-RW3VGTw":{"text":"Doctor was thorough and took his time checking me out! Place is really nice and clean. Sta","useful":0,"cool":0},"CIOjH_-CUrRmxsY1PrAb5w":{"text":"So I arrived 30 minutes before they open so I could be the first seen. About 5 mins before","useful":1,"cool":0},"OEnhXdaCxsS2gq3pr0xgkg":{"text":"Depends on what Doctor you get here.....I love Cabrera.  Some of the others aren't my favo","useful":4,"cool":1},"gQBNyUWjzqiUNzUeMuHanQ":{"text":"I am from out of state and stopped into AUC on a Sunday morning as a last attempt to get w","useful":2,"cool":0},"-uf7WlhCNZeDtIo-24Zf3w":{"text":"Wow.  Went here today and couldn't be any happier.  Wait time was low.  Staff was great!  ","useful":3,"cool":0},"g80oz241uPrq2n6q5DTgpA":{"text":"I went in because of a fall. I thought my wrist was broken and in extreme pain. After they","useful":1,"cool":0}}