{"WtNt1UFvvhb1wD90I-1Q-w":{"text":"We were here my son and I on April 16, 2017. We just came off the good ship Norwegian Dawn","useful":0,"cool":0},"2cFB_DPYdK7-wj1BkXVcOw":{"text":"I love love love this place. THIS was my first time visiting the French Quarter and it was","useful":0,"cool":0},"JoLkWodeadbKuwEeWnRcjw":{"text":"No other place in the U.S has the old european feel like the French Quarter does. However,","useful":0,"cool":0},"B8DsPRdUshX4SL--aNmr-w":{"text":"So many bands-so little time! Rain canceled an entire day of the festival and we certainly","useful":0,"cool":0},"eVmK8RNViD5kSHkqBVSN3g":{"text":"One of the best preserved historical cities to visit.  Always exciting, great music, joyfu","useful":0,"cool":0},"dTydJ9LxrVz-aG5AuPK6bA":{"text":"Yes the French Corner attracts thousands of tourist annually and  Bourbon Street can be pr","useful":4,"cool":4},"mgzDWy51UiDVK0EetHevlw":{"text":"Lots of sights, sounds, tastes, and smells...some good some stinky.\nBut defiantly somethin","useful":0,"cool":1},"Wju1N4RMbTJ0htrfh_jH7Q":{"text":"When we visited NOLA, we stayed at the Hotel Monteleone, so naturally wandering the French","useful":1,"cool":1},"pKmdyD7zffuEmS8c72Iuqg":{"text":"We went to Nola for my birthday this year and stayed in  the French Quarter. It is kind of","useful":5,"cool":7},"HFc_acJBbBIa8SJw6HLfOA":{"text":"The French Quarter is a dirty vomit covered sewer hole - to that extent it's fun hence my ","useful":0,"cool":0},"ACN5Lo0t5x6eCg4OKBgo3A":{"text":"Awesome place to visit the ambient and food is amazing, the only thing I would say that go","useful":0,"cool":0},"srGsXlfqD6VDRiZeJxhP_Q":{"text":"I took the kids here while they were on vacation from school. We all loved it. I know ther","useful":0,"cool":0},"oUpF49f3WNQ7ePK0cVJE2Q":{"text":"Went to the French quarter and can't believe anyone would pay to vacation here? The homele","useful":0,"cool":0},"hP7ZKANhsnWibyUY0Rp66g":{"text":"Probably not a good idea to visit The French Quarter right after Mardi Gras, the streets w","useful":1,"cool":1},"A5p-4JHRdKbxxL_Pw22lhA":{"text":"GREAT place for families.. friends ..all walks of life. This was the 1st place we came to ","useful":0,"cool":0},"r9J6aVX3voz9qyuSpiJxqQ":{"text":"When there's nothing to do I come here and party my butt off. Sometimes when my life is to","useful":2,"cool":1},"pJ78y0CNaXrJ8pD-5mlz7g":{"text":"We revisited the city and once again New Orleans blew me away with its Joie De Vivre.\nWe w","useful":0,"cool":0},"Mg-SBMUjqOJxf2YarWzH_A":{"text":"One must visit the French Quarter to feel and experience the classic old French architectu","useful":0,"cool":0},"IOfSmd_97wT-EamhGR2hqA":{"text":"Day or night, sober or not so sober, the French Quarter is so much fun. Some of it are sho","useful":0,"cool":1},"IoLDPakx7iEUFhbtQoYsHg":{"text":"New Orleans, LA, specifically the French Quarter - Dirty, nasty, disgusting.  Tourists get","useful":0,"cool":0},"6C15yEwJPdb-3qXzaddGWg":{"text":"Very cool architecture and culture. The history of this town has a lot of violence and alc","useful":0,"cool":0},"NHZ6MmWNz-iXKQMNkljIng":{"text":"Fell in love with the French Quarter last yr for my bday at Mardi Gras.  Loved it so much ","useful":3,"cool":3},"6J1AREsYS2Ffp6JO_ITGDg":{"text":"French Quarter is great for good and site seeing. \n\nSo many small shops and nice friendly ","useful":0,"cool":0},"_yxdbCPdA41391kZN6ldZA":{"text":"Love the French Quarter. Not a big fan of Bourbon Street. Love Royal Street. All of the ar","useful":0,"cool":0},"NqOt3STKG8H3i8bKsbMgOA":{"text":"What a beautiful place with beautiful people, food, and music! Whether you're walking the ","useful":0,"cool":0},"GimcHSBRMhY-nTrE7sEBkA":{"text":"I was so excited to come here and I was so incredibley disappointed.  It is so dirty here ","useful":0,"cool":0},"OzfkCg7J9w2PS8lzAMpgHA":{"text":"We were only here one night before our Carnival Cruise. We have a 24 & 15 yr old. We had a","useful":1,"cool":0},"hkZNxL11LzezOMZNyYlftw":{"text":"Royal Street was one of my favorite daytime parts of our trip. The rollerblading Asian gir","useful":6,"cool":7},"teywQp-i-rBKNDvyITpSqg":{"text":"There is so much to see and do in the French Quarter. If you can think it, it happens here","useful":2,"cool":2},"oMgNk4ldI7EtTyM5fphZQQ":{"text":"So much to see! Historic buildings, tons of art galleries and shops. Voodoo stores, bars, ","useful":1,"cool":0},"H22hi8jLD3e-kRbBaoawkQ":{"text":"The thing about the French Quarter (it's not French QuarterS. If you add an \"S\", so help m","useful":11,"cool":13},"qcmX3Z3FkBBGDliju8l_MA":{"text":"Without a doubt, the most exciting section of New Orleans. You'll find some of the best fo","useful":11,"cool":6},"yvwgXiTeG6pJeXZPGSMWKw":{"text":"We came back to New Orleans for our 1st Wedding Anniversary (we got married here last year","useful":3,"cool":2},"_hrAJQKHMIcFYZ9VJqHLeQ":{"text":"This place is perfect for someone like me.  Is it crowded? Yes it is. Are there lots of ho","useful":1,"cool":1},"j6mNcwOu64o8o1XEtox-Jw":{"text":"One of my favorite areas of Nawlins. The people and culture here are top notch and can't b","useful":1,"cool":2},"o7JGAmQJyOSgjXD3StxwdA":{"text":"This is the place to be when visiting NOLA.  It is safe, everything is walking distance, a","useful":0,"cool":0},"7_Rz98Os0vX9KFl4mgPXaQ":{"text":"Other than the place always smelling like piss, they have a lot of fun street performers a","useful":0,"cool":0},"HIqzBEIZI1X6NUH7ARWdoA":{"text":"Born and raised in New Orleans but haven't lived here in about 15 years. I think I've been","useful":0,"cool":0},"JR08hBVMZWCJ2iRZ1JpGCQ":{"text":"Our trip just happened to coincide with the Saints winning and Halloween. Every costume im","useful":0,"cool":0},"8OWxkY9fOgJJChT0ocJBlQ":{"text":"If you're ganna stop anywhere in or around New Orleans... the French Quarter is in the Hea","useful":0,"cool":0},"n6tczpQ35EpAc_n-CBalyA":{"text":"The French Quarter is lively, dirty, busy, and a fun place to be. It is whatever you make ","useful":0,"cool":0},"g_HTdgfIV6bkyGiYTqAg3g":{"text":"I think I need to seriously spend some more time in this amazing neighborhood in this amaz","useful":2,"cool":2},"jMFY6EiSkmrEhwu8mfGgvA":{"text":"I love the French Quarter, all of it. The good the bad and the ugly. It warms my heart to ","useful":3,"cool":3},"i326K8DsFjRHUvyp4FboRQ":{"text":"The French Quarter was an awesome experience. More of a once in a life time place to visit","useful":0,"cool":0},"I0u6nVluHt_1nu2g6kdeBA":{"text":"Just an awesome place to walk around and sight see the finer aspects of NOLA. They have gr","useful":0,"cool":0},"2gTK5wr2Qz9EY3hLVQzUGw":{"text":"Let's be clear, I love the French Quarters. In fact I've worked in the French Quarters, as","useful":3,"cool":3},"aZhsCbl0-9OPt9ZvVKxERA":{"text":"Walking around you will experience the feeling of being in a different country- may be Fra","useful":1,"cool":2},"HfBq6dESwkPtxPYuctJL1Q":{"text":"We have been here many times when it was wall to wall people. On this trip for Christmas, ","useful":0,"cool":0},"X2gvhWWcazVdMvfhxkw7iA":{"text":"I think we covered all of the French Quarter criss-crossing the streets and saw everything","useful":1,"cool":0},"KLWtRlQq-mlCaSq0LCO4AQ":{"text":"Staple of New Orleans, obviously a must see when you're in town especially for the first t","useful":0,"cool":1},"L6JX13xpyFHJSUb118QsHQ":{"text":"I really,  REALLY wanted to - *expected* to - love New Orleans and the French Quarter... a","useful":4,"cool":2},"9g5U9FzKG9i-OjNgS_rEtw":{"text":"This was my first time coming to New Orleans and visiting the French Quarter it it was ama","useful":0,"cool":1},"Z7BeXCWIcB_26g2MltiF3A":{"text":"This is the place with the history of  New Orleans.  This is THE New Orleans.   So differe","useful":0,"cool":2},"gyfwt8g1j9PxZLP5cj3X9A":{"text":"Really enjoyed the French Quarter!  Dinner on a quiet balcony, drinks on Bourbon St, horse","useful":0,"cool":0},"_7K4HyZYrdcITImms4ettg":{"text":"hahahahaha, Shannon created a listing for the FQ and almost immediately a tourist from Cal","useful":8,"cool":9},"zr1vWU33wdS6W0zHgbobqw":{"text":"When visiting NOLA French Quarter is number one on everyone's list.\n\nI got a good amount o","useful":1,"cool":1},"IKN3eCTHF06UhMTTL-26yQ":{"text":"Rating New Orleans' French Quarter is challenging. On one hand it can be five stars -- the","useful":0,"cool":0},"Iffu9ojrV8Xp9CmCi8HM7Q":{"text":"I have mixed feelings about the French Quarter because it's an iconic location. Perhaps it","useful":1,"cool":1},"jVuw8fzjI9mIVhkLMMGrjA":{"text":"The French Quarter is an amazing and magical place. An amazing and magical place where you","useful":12,"cool":6},"WQ049wCoIi1qa59-1bmk0Q":{"text":"i think everyone should check out the French Quarter at least once.  Both in the daytime a","useful":0,"cool":0},"axzUcF6HOfU5TcXPUqn-ZQ":{"text":"I came to NOLA for Mardigras with a bunch of my girlfriends. We stayed in the French Quart","useful":0,"cool":0},"mevvH5pDSjJ7c7P8NfIjdg":{"text":"This is, obviously, my personal opinion. But I did not like the French Quarter at all. It ","useful":0,"cool":0},"oVX6prA80-ZzhS6k-5adIA":{"text":"Take a tour this place has tons of history and such a beautiful, artistic venue. Go early ","useful":0,"cool":0},"iniWntkbJpx3F6ghUD-u5Q":{"text":"This is what NOLA is known for. It lives up to its reputation. You can walk for hours on t","useful":0,"cool":0},"uErlc1MbSBBzyhRlY-tPhQ":{"text":"The French Quarter is exactly what everyone says about it. Tons of incredible architectura","useful":1,"cool":1},"x9BJXzi1w8CK-Kj3zh7tBQ":{"text":"Fantastic experience. Architecture, local art, good food, friendly people, need I say more","useful":0,"cool":0},"jSLMPFPrBgJ-FGN7GVQULA":{"text":"C'mon ya'll! It's over-priced, over hyped, and might be one of the last places in our over","useful":0,"cool":0},"GA2iPFdjg17DG5eEOj99Yw":{"text":"I spent a fair amount of time in the French quarter. It is the oldest part of New Orleans.","useful":2,"cool":2},"DOm4TzP7p0oBFaI3ZudiJw":{"text":"Not sure what to say about the French Quarter that hasn't been said before. When we first ","useful":3,"cool":2},"3ZqaBbySyRb1XQsSAsMW5A":{"text":"I came down here for a day and was amazed by it. The crowd, street attractions, food, buil","useful":0,"cool":0},"qv5HU9L8ohbTilx68L-9-A":{"text":"I just love the French Quarter. You will be hard pressed to find the sights and sounds lik","useful":2,"cool":2},"f0oQ1A_UI1DsTr9eYn3_iA":{"text":"When there's nothing to do I come here abd party my butt off. Th e only place I know where","useful":0,"cool":1},"L2xKYYKDKdaZW0Tss-ySZA":{"text":"The French Quarter is awesome! It is one of the premier attractions to anyone visiting NOL","useful":1,"cool":1},"6ofmFID1EKoLastnFB1ksA":{"text":"It's a fun place to go when you are in New Orleans. Lots of bars and clubs, if you like to","useful":0,"cool":0},"Rp7nznaC54d3VsLGDsL6Lg":{"text":"It really goes without saying that if you come to New Orleans, you have to visit the Frenc","useful":0,"cool":0},"dWd54tJw9YmsKOmAOATX6A":{"text":"When coming to New Orleans, this place is a must. You don't have to just be on bourbon str","useful":0,"cool":0},"pb37o_m7Pbd8D92NH2HLJQ":{"text":"Very nostalgic to walk around. Food was great. Lots of vendors. The actual market it's sel","useful":0,"cool":0},"lZdxVLfJJv9bN2EY5sfAPQ":{"text":"I loved the French Quarter. I didn't really know what to expect since it was my first time","useful":0,"cool":0},"vXxK3Is6wLw7b9RQSSqg_A":{"text":"The BF recently took me on vacation to New Orleans. This was my first visit and it will ce","useful":3,"cool":4},"P86nEDMZnZQ5Q-FmYMXreA":{"text":"Whoever comes to NOLA has to come to the French Quarter! It's where they have Mardi Gras i","useful":0,"cool":0},"OvYeChzHDjgLCcDZD6zSmg":{"text":"This is THE tourist stop when you visit NOLA. Of course, you shouldn't limit yourself to t","useful":0,"cool":0},"GLux8K-n1UyM1g6k7XDEsw":{"text":"Is there a cooler place on earth? If so, I am not aware of it. The charm, the history, the","useful":3,"cool":5},"IgCWsUtDaoKvXMXR1BULGA":{"text":"Great Experience Here in the French Quarter! Wow there is always something going on in the","useful":1,"cool":0},"G9RjWmMOYLQCRd0TxjQmpQ":{"text":"Loved it!! The architecture is amazing Jackson Square is a must see and the St. Louis Cath","useful":0,"cool":0},"uMgZAR84ZzU9jPqq7y_6qw":{"text":"All I know is that I kept looking for the \"nicer section\" and never found it. Tawdry peep ","useful":1,"cool":0},"PWehFqnc7ioYD6oaWBNWzA":{"text":"On the way back to Texas and after eating at Mandinas, I had to check out the French Quart","useful":4,"cool":2},"HAKeOjs1Qt8IVPCbabmaMg":{"text":"A great piece of history! I find it humorous that they call this place the French Quarter ","useful":0,"cool":0},"HU_Zmflb4s62aibVwIrsow":{"text":"Crappy tourist spot with nothing but bars and gift shops, stay off bourbon st unless you'r","useful":0,"cool":0},"vkhOvtfqy-AHx_ODiwLivw":{"text":"Cool place. There's a lot of construction on Bourbon St. I would definitely come back. We ","useful":0,"cool":0},"OAtj6cYqbxIVI4VRH0tSaA":{"text":"Its the French quarters, the people, food and beer. Restaurants COOP, top food destination","useful":0,"cool":0},"R_cm--ISt28cdkwRTIzsZQ":{"text":"No trip to New Orleans is complete or makes sense for that matter without going to the Fre","useful":4,"cool":5},"k1CeFMIPDdXoFdnXzASrLQ":{"text":"I have to say, I think the French Quarter is one of my favorite places to visit in the wor","useful":9,"cool":6},"L8_SWV5xXXVKg2Lo_tEwew":{"text":"Who is everyone kidding?  New Orleans sucks!  Its dirty and smelly....\nBe forewarned the p","useful":3,"cool":2},"VT-J42sBLwIm21_22TtN1g":{"text":"TIP: if you need a strong data signal, face the church and go to the corner on your left h","useful":2,"cool":1},"j75D5mHX3V7WRqr3-eCmTA":{"text":"The French Quarter. It is what most people think of when they hear the words \"New Orleans.","useful":10,"cool":8},"wypGEMBB3XLf5xkkdux6TA":{"text":"There's something about this city that grows on you. The French Quarter is a must see plac","useful":4,"cool":1},"YRc2XoD8OQUW-WptiOOSww":{"text":"You can get into a lot of trouble in the French Quarter. \n\nSo wear flats, stay hydrated, a","useful":1,"cool":0},"9fpH-MjO7KXY_sHExlwJwA":{"text":"If it's your first time visiting, it's easy to get disoriented if you're taking everything","useful":2,"cool":0},"JAvFGYpMmjxT71wdlLf_EQ":{"text":"Always thrilling with TOO much to look at! There's always an entertainer, coffee, shopping","useful":0,"cool":0},"ThkybLOa-yrTgT6RbcsA1g":{"text":"You cannot go to New Orleans without going into the French Quarters, otherwise, you really","useful":2,"cool":1},"5HCGA5VGsJeemGvM30YfKg":{"text":"Who doesn't like this? Good any time of day and always bustling, even early morning. The m","useful":1,"cool":1},"pMOBnhbN7fUouK2DRtdPFw":{"text":"New Orleans is by far one of the favorite cities that I have been too.  From St. Charles S","useful":0,"cool":0},"QaeRwbz6Tkdcks29ktLXQA":{"text":"The French Quarter is a great place to visit but be sure to get to other parts of the city","useful":0,"cool":0},"c9K6Dx28TpHyL-X5zuxyig":{"text":"TOURISTY BUT ALSO SHOWCASES NOLA= Like or not, the French Quarter is one of those \"When in","useful":2,"cool":1},"qfziHUPI3Gnnsn-37jTWug":{"text":"I absolutely love the history and architecture. But not all parts of the French Quarter ar","useful":0,"cool":0},"Czw4FevRW6Z-_Db-3F7zHg":{"text":"French Quarters is an awesome place. Lot's of great food. Lot's of people out looking to e","useful":0,"cool":0},"RzDBFVj6IawIbkBbq3QtlA":{"text":"I loved the French Quarter! It's the heart of the city!\n\nIt's 300 years old and has laws t","useful":1,"cool":0},"PtEjx9wfsVioPwOm6-bgsg":{"text":"There are two places I think every American should visit in their lifetime, Washington DC ","useful":0,"cool":0},"2ePkbfaYnVbmPtKNGg1ESQ":{"text":"What else can truly be said about this world famous neighborhood that hasn't already been ","useful":3,"cool":2},"1p-73N2s1v2Khgk5SE05NQ":{"text":"What can I say? I love coming here!! It's a great visit. Love it when I get here and ready","useful":0,"cool":0},"20u53jAfcdefZXH9q-I3SQ":{"text":"I grew up going to New Orleans so I'm surprised it's taken me this long to actually write ","useful":1,"cool":0},"iVuT_i1zUonjFL7ApOmhZA":{"text":"The French Quarter cannot be overlooked while visiting the city. The minute I step foot th","useful":2,"cool":2},"7kTOuBzCsjEJyWWruHlPUw":{"text":"1. Super busy, which was expected \n2. Smells horrible, the smell of pee is everywhere i ca","useful":0,"cool":1},"isg6lZpATq1fCQlEoGbVnw":{"text":"We walked along the French Quarter a lot during our trip to New Orleans. There are a lot o","useful":6,"cool":5},"yovYSsF8QNujtK9h3MUWAQ":{"text":"I love the frech qur.. it's a place to be who u r and not have to worrie bout anyone judgi","useful":18,"cool":18},"5NJmQ7L5sMNDtj0_OOIZaQ":{"text":"The French Quarter is America's garbage can and cesspool.\n It reeks of urine, feces, vomit","useful":0,"cool":0},"TNcXDiI2jifzJeXDyR_0gw":{"text":"I wrestled with this 3 or 4 stars here. Definitely disappointed in what I expected to be a","useful":0,"cool":0},"CRXgaGeOwWpXR5YYKYk1Rg":{"text":"I want to love this place. But the smell while walking through is just unbearable. The pla","useful":1,"cool":1},"zISxwu-83ADBBQjhTZiRXA":{"text":"The most famous district of New Orleans lived up to its reputation for me.  We wined, dine","useful":8,"cool":8},"YeZ8RiNyWtOBXHtT88S5Vg":{"text":"This is one of those places that you have to mark off your list to see in New Orleans... A","useful":3,"cool":4},"tYwgoeNq_7uuWRuQPXZADg":{"text":"#231-2016:\n\nThough I truly do adore NOLA (my top 5 city to live in the US), I have to admi","useful":11,"cool":13},"AkCa81lqykeJfoDO1rp4hw":{"text":"(review # 600....wooooooo)\n\nThe original footprint of the City of New Orleans dating back ","useful":6,"cool":3},"zzx6HMsMAawvG41RJiiOqg":{"text":"The architectural details are amazing. There is something for everyone. Music, history, an","useful":0,"cool":0},"SU4eJIz_ffIR9rIlQftVZw":{"text":"As a native I have a love/hate relationship with the French Quarter. Well, mostly I hate B","useful":2,"cool":2},"wyA7wrwH1F2f3imWCj1S2g":{"text":"I've been coming here for years, and I love it. I do however get tired of the rude locals ","useful":0,"cool":0},"aVzfOmh2x64hyV98-Iy7kA":{"text":"Soooooo much fun. If you have never been it is a must ! The people are crazy and fun. The ","useful":0,"cool":0},"6DTGwJaPJrTMB7HsT3jvKg":{"text":"I was in the French quarter during the day and at night.  I prefer the daytime but the nig","useful":1,"cool":1},"WjaDhra4cvlxHpf0BTDQiw":{"text":"(Review based on 3.5 stars)\n\nThe French Quarter in New Orleans is an iconic location where","useful":1,"cool":2},"XqgEuqYhAesZiSmbKARlMQ":{"text":"Such a cool and unique little area. So awesome that you can just drink wherever you please","useful":0,"cool":0},"_UGsF_PXZoHWp7-UguZfow":{"text":"It's the tourist thing to do. You can't go to NOLA and not go here. \n\nThe bride whisked aw","useful":5,"cool":4},"zbXWRNxunSqks4yEOHMuag":{"text":"I really loved the atmosphere of New Orleans! It was my first time visiting this historic ","useful":3,"cool":1},"mU_qpWr8s_Kwu6r-GoxVWg":{"text":"Bespoke architecture with a jazzy and romantic atmosphere throughout.  Cute cafes and auth","useful":2,"cool":2},"BE0Fo7DgjzY4VfiDCw1RJQ":{"text":"How can you not love the French Quarter?! It's an experience all in its own, consider it V","useful":0,"cool":1},"JDC6sdfOxtKqFUWx8t8zDw":{"text":"What happens in New Orleans ... gets hosed down the next day.\n\nI prefer the Quarter during","useful":6,"cool":6},"l2V8bh4UoNhyp4nKsOk7-w":{"text":"I've grown to love this city.....and more so after Katrina.  \nThere's always something goi","useful":10,"cool":9},"0RsYOaldExLyGf6nJmFOjQ":{"text":"1st let me say that some areas in the French Quarter are wonderful and historical and must","useful":0,"cool":0},"E5ZXtgkshErH2WlmHVxWUQ":{"text":"Bourbon Street is filled with numerous tourist-friendly stores, bars, restaurants and more","useful":1,"cool":1},"0pf48WGgj9bGDZ0RNKyxxg":{"text":"Any given day you will get this in the quarters (pronounced qwaaaters ) I need a second li","useful":1,"cool":1},"FtfOz28_9emo1wdOhnqKaw":{"text":"I love the town the panhandlers are ridiculous. I am not a fan of creole food but there ar","useful":0,"cool":0},"4c0MzOTO-Ef9a69RnB0t1g":{"text":"If you love the smell of overflowing grease traps and people vomiting in the streets this ","useful":0,"cool":0},"tLytPPV1cjKvCpgVKx9jwg":{"text":"I am a huge fan of the French Quarter! Everything about this area gives me all the feels! ","useful":9,"cool":8},"BIZmAvwhYOS8ZSj5zU3NlQ":{"text":"The French Quarter is full of history, architecture, and art. You can find everything here","useful":2,"cool":2},"k8dt8zBHq27ukub8gj_bEQ":{"text":"The French Quarter is one of those places where you just have to visit it at least once in","useful":26,"cool":28},"iscCUPvuJORLjar-NgKoEw":{"text":"We were driving through New Orleans on our way home from vacationing in the Gulf. I wanted","useful":10,"cool":9},"sTPVmJW-kiHQeGva3zAAyg":{"text":"Almost a 3, maybe.\nWhat can I say. Hmmm. Well, there are some amazing art shops, a few goo","useful":13,"cool":11},"HuGR-4Rb6JAtUTwvlBn9zw":{"text":"The French Quarter is the oldest neighborhood in New Orleans. It's interesting that many p","useful":9,"cool":6},"cuQNuQmXcVFWWRZWeDJxDw":{"text":"The French Quarter is just so intriguing. It gives NOLA a feel like no other city I've eve","useful":2,"cool":3},"DGHIn1ZpcrfgRh1y-meusA":{"text":"The French Quarters is what you think of when you think of NOLA. It's what Disneyland's Fr","useful":4,"cool":4},"6W_yMc3ECrh7eB8UzYmTgQ":{"text":"I love the French Quarter. I could (and may eventually) live here. There is something for ","useful":10,"cool":13},"_tnxSq4ncP7BYhDbV8JzOQ":{"text":"The French quarter is definitely an interesting place to see. Even though there's other  c","useful":1,"cool":2},"3ATheGoc_Ul9zKkMQyuETg":{"text":"This is an area that fits different peoples for different reasons. There are art galleries","useful":0,"cool":1},"RIHqoUUEQqqjPEodVNvK0w":{"text":"The French Quarter is an eclectic melting pot of folks from all walks of life. The French ","useful":5,"cool":5},"ir10axj1pn3oPoS45i03ZQ":{"text":"If you are walking about town and wondering where the folks are, seek no further- they are","useful":2,"cool":4},"I-WYCyIskedJoQo7-Y-19Q":{"text":"You should visit the French Quarter at least once in your life. Emphasis on \"at least once","useful":3,"cool":4},"6gZr-uGTx_IHOJQ8HOQLiA":{"text":"Must visit in NOLA.\nGreat history & culture associated with this place makes it even more ","useful":0,"cool":0},"LHoPWUdSVQwi8Ua4IalKKw":{"text":"The French Quarter is truly one of the most unique tourist areas that I have visited in th","useful":5,"cool":5},"JAPZc9Y2a_TjhwmWfZ23Pw":{"text":"The French Quarter is kind of what the city of NOLA is known for. I think that, depending ","useful":9,"cool":8},"8GkuFnlj0FMgjBMRgQrScw":{"text":"This is one of NOLA's staple locations! Depends where you're visiting from, culture shock ","useful":2,"cool":2},"ykA3tJ9z9v8fPxb4w5ooTA":{"text":"When in the Big Easy, there's absolutely one thing you must do. Even if you are only in NO","useful":2,"cool":4},"lx0TMXKUoWkajoqZwQg8Hg":{"text":"A staple to check out when in New Orleans. I got an air bnb nearby and it was about a 20mi","useful":3,"cool":6},"ctfX9PW51O4tLEfYf3dc2Q":{"text":"Action packed! \n\nThe first time I've seen a scene like the French Quarter was at the New O","useful":51,"cool":51},"41RiPH5M3Uwec-6OvkLidw":{"text":"New Orleans is my \"happy place\". I love the food, culture, people, music, beautiful archit","useful":8,"cool":9},"FZazyawNrnzyvrTLxGhg2w":{"text":"The French Quarter is a National Historic Landmark and the oldest neighborhood in New Orle","useful":4,"cool":2},"nxAz1GtY-gNrZD5H5ymyFw":{"text":"Who doesn't like or appreciate the French Quarter!  From its rich history, amazing archite","useful":9,"cool":8},"ZwFWY-SD3i6Iw-nQjJX8Wg":{"text":"During the day - absolutely gorgeous! Flowers everywhere, musicians on every corner that r","useful":1,"cool":2},"a_qJm6KIaQV_PK3FBT2S2Q":{"text":"Review #700\n\nThe French Quarter has a deep and colored history in New Orleans. Of course t","useful":14,"cool":13},"lqosozF5pqczZvu3fwSp-g":{"text":"I dropped by the French Quarter recently and could care less to return here. \n\nIt is full ","useful":6,"cool":3},"CpDGzdRoImqZlAq5mL5Ulg":{"text":"I thought I wrote a review of the French Quarter a few years ago. Oh well the Yelp gods pr","useful":18,"cool":24},"RGtXaWvpn5v5JV1-NMj61w":{"text":"Dirty, runned down. Lots of trash and rap music everywhere. I was very dissapointed. There","useful":0,"cool":0},"_xjosrmnOz2hDQqFVqXRjA":{"text":"I have decided that I like you better during the daytime.  Yes there are still tourists bu","useful":3,"cool":1},"wblzqWDYcV3ovKN2iKVZdQ":{"text":"Barbie is the Vegan who taught us\nThat animals should not face slaughters\nBut when in NYC\n","useful":19,"cool":21},"4uP7qmVTokQH0TsgBNb6FQ":{"text":"Locals may disagree: for tourists like me, French Quarter is New Orleans! In other words, ","useful":5,"cool":3},"82qYY8ePVIcMJZ__JIxZjQ":{"text":"Seriously, it's a lively crowd every night here. Bourbon Street is where the fun's at. The","useful":2,"cool":0},"tTpe2XUNGfO3IxFiQzHRdw":{"text":"Two women walking in the Quarter... one is talking to herself intensely as her friend is d","useful":5,"cool":8},"3QvYSppBdjNvxlr3ui_axQ":{"text":"LAISSEZ LES BON TEMPS ROULER\n\nCajun French meaning \"let the good times roll.\" (pronounced ","useful":13,"cool":12},"LvzvPiQZ6ICYnitfLquhbw":{"text":"Everything you can think of in the blink of an eye is right before you. Street vendors, ar","useful":43,"cool":44},"J2GzH22gj__fGA7hfQsd4Q":{"text":"Music everywhere. Seems like there is a parade every 30 minutes\nCrowds of party goers ever","useful":6,"cool":7},"0FlK2auKdFyinlxWBZY5mw":{"text":"It's the French Quarter. It's stink, nasty and often with drunk people looking for a fight","useful":2,"cool":1},"o-5i9-Yudd2zpkwrs31rwQ":{"text":"*Seriously, Yelp, I don't know how three of us could review the wrong place all at the sam","useful":47,"cool":46},"gNUF3OkifuLdmfrR4ROMHg":{"text":"The French Quarter or  is the original core of the city of New Orleans.  Most of the origi","useful":6,"cool":3},"Xsec8JXUqVdG_k-tKhgsBA":{"text":"Traveled alone for my birthday. I wasn't very impressed. \nReminded me of downtown Los Ange","useful":0,"cool":0},"p9cK-q8x5g4nWMDXKK9pRQ":{"text":"The French Quarter is one of many places here in America that almost everyone if not EVERY","useful":4,"cool":4},"i6vVdQWQW0heYpnXB9hBwg":{"text":"Wow!! So much fun on a trip to New Orleans in March. A couple of weeks after Mardi Gras an","useful":19,"cool":18},"BKt6ENRsa7CDE1WGWlYFBw":{"text":"Paying a complete homage to the oldest most famous neighborhood in all of New Orleans. The","useful":4,"cool":2},"uBnQWP6cYibVSmKUQybl_A":{"text":"I'm in love with the French Quarter. So full of culture and history. If you love art, stre","useful":2,"cool":2},"-ymCU1MNXkYGKdkvPFmDkA":{"text":"Yes it's unique. I love architecture and food--so this should be heaven... but it's really","useful":3,"cool":1},"iCns2MZIO10pigi5npHppg":{"text":"This is where New Orleans first started.  It didn't flood during Katrina because the Frenc","useful":0,"cool":0},"fsxrgK-ce22PgpmZzZBE-Q":{"text":"The French Quarter, from an international perspective, is the heart and soul of New Orlean","useful":12,"cool":11},"jKP28H6U39-YG9Ml23ChZg":{"text":"Came to the French quarter for the culture, the beauty, and the jazz. Depressing to say th","useful":0,"cool":0},"d13yxhFWPO5DH6_jq8oJ4A":{"text":"It's all been said. I've been to the French Quarter at least a dozen or more times. If you","useful":29,"cool":27},"mEwVk9Po8ys1X-0R5OhcvA":{"text":"A lot has changed since 2014, so be aware. Beggars and homeless are everywhere! I was acco","useful":0,"cool":0},"qeLRLObYU8Z_7XDJKlmmJA":{"text":"French Quarter established around 1700 which is the older section in the city. It is celeb","useful":8,"cool":7},"x9SrbjEpZTHtQrZpwtq4Rw":{"text":"Now that I think about it, I get the French Quarter and Jackson Square confused...or I gue","useful":0,"cool":0},"lZLY7nQTPEpwnsDhuPJWrw":{"text":"What's not to love about the French Quarter? It literally has something for everyone. Live","useful":15,"cool":12},"aF_zA20hM9AE5GD8kIcGRw":{"text":"This place is exactly why anyone will visit New Orleans. Their great french buildings and ","useful":13,"cool":10},"1wjySd9z1PvqTNfvDlubPg":{"text":"I mean, how can you NOT love The French Quarter?! Stunning, architectural details, bold co","useful":25,"cool":29},"BfEloObEpWXOLqZyvxELjA":{"text":"New Orleans culture to the maximum! All the scenes one sees on Princess and the Frog come ","useful":10,"cool":7},"RfAISP3GYtYk8_5yXHyFMQ":{"text":"When I tell you there is something for EVERYONE there!!!\nThis is something everybody must ","useful":1,"cool":0},"EX17mr_GaFJlD_mbL83-zQ":{"text":"Must see when in New Orleans.  The architecture is unique and beautiful.  Street after str","useful":0,"cool":0},"LdWrLCUqeyIjqNxLy-6uFA":{"text":"I felt a little sad as the 737 lifted off the runway.  I'd visited the French Quarter for ","useful":30,"cool":26},"9SKUsjYjXWY_nduqV9xvLw":{"text":"This is the heart of NOLA especially for tourists! Everything from bourbon Street, souther","useful":0,"cool":0},"Se4Q6wKPND7y7PDzSL4GWw":{"text":"I had night mares about the bugs  the  first  day! Here are a few links about the bugs. ht","useful":4,"cool":2},"SxZHiShz-NurdSzLv8x-vQ":{"text":"This was my very first Mardi Gras in the French Quarter.  It was epic. We went to Bourbon ","useful":2,"cool":1},"R35jNfDKwi80cjKiA5uDdA":{"text":"So if you like european arhittecture this place for you:) If you like jazz this place for ","useful":0,"cool":0},"k-HcgJ2t-LZLUWBkW0QXzg":{"text":"So in love with the French Quarter.\n\nPros:\nBeautiful architecture- colorful buildings that","useful":2,"cool":2},"q_RPfqfHxi3ICDAnr8PJBg":{"text":"If you like noise, crowds, the unmistakable smell of vomit, sewage, urine, and other assor","useful":4,"cool":3},"AYkJKO_QUSENaGgdOgdemw":{"text":"Oh, the French Quarter. This is a difficult review to write because I love the Quarter so ","useful":18,"cool":18},"HNbnAjcCxi4b-0MLv9_65g":{"text":"This was my first visit to the French quarter of New Orleans. How disappointing,  Dozens o","useful":0,"cool":0},"dk9K0WpBMxzXGWH9hc83FA":{"text":"Oh god... where do i even begin. I came here thinking the city had culture, jazz, and Euro","useful":0,"cool":0},"AdiKj0F81TVZQGBeReANww":{"text":"The French Quarter is a most-visit place in NOLA.There is no admission fee.But there are m","useful":0,"cool":0},"ez-SXPxJ_hffM6Av5b854w":{"text":"The French Quarter is famous for a reason: it's lively, it's vibrant and it's beautiful. I","useful":9,"cool":10},"fZ9MXHBRxGJ-9KKm7sQX8A":{"text":"I love New Orleans. It's one of my favorite cities. The food is incredible, the culture is","useful":7,"cool":7},"0lBzMXkEiR67LlaLBPPxPA":{"text":"Just experienced my first time staying in and visiting the French Quarter this past weeken","useful":15,"cool":13},"_855T4-i5SYGMn8pTpwPdw":{"text":"Tons of people and action. So many street artists and live music in the square and side st","useful":0,"cool":0},"cvo8wIDq0xPbyaaDf9Ef4A":{"text":"I love the French Quarter (aka Vieux Carre) of New Orleans, the neighborhood bordered by C","useful":3,"cool":6},"XJA6DQQgb6hV97OTx4-H7w":{"text":"It doesn't have to be Mardis Gras - it's always a party in the French Quarter. You'll stil","useful":8,"cool":8},"MLDSlSb2exvFU_epeNxu9Q":{"text":"It has a national reputation for a reason. The seemingly endless, beautiful balconies over","useful":1,"cool":1},"wKeVF1cB434pga7n4u4YBA":{"text":"Everytime we visit New Orleans, we find something different to do and see in the French Qu","useful":5,"cool":5},"9gn6W47A_pbOanv3jfqcIA":{"text":"30 years ago the French Quarter was lovely. I was here in Sep, 2021. It has been totally g","useful":1,"cool":0},"bVwqQi83q59dRbNjK75HBA":{"text":"The French Quarter should be on everyones bucket list for a visit or 50. There is so much ","useful":10,"cool":11},"cREORYH3rPArEJVqk9vvRg":{"text":"I love visiting the French Quarter, though I usually avoid Bourbon street. There's great f","useful":1,"cool":1},"Wv1bGUs-Tju-2rbv7Mlj_A":{"text":"A few weeks ago I finally made it out to New Orleans to check out the famous French Quarte","useful":8,"cool":7},"l8MO83ja2HfVC7DUw1SQ7A":{"text":"I'm amazed at how this part of the city has recovered from Hurricane Katrina, albeit has b","useful":7,"cool":5},"eakl6CcjD1IL14Y_sRVLhw":{"text":"I would suggest traveling NOLA in June or July when the weather is pretty fair and the air","useful":3,"cool":2},"OAI4PppEcgZa9WflL7TG2w":{"text":"How do I come to terms with the French Quarter, a part of a city that I love, fairly? It's","useful":2,"cool":1},"bZ9iGGNDPdY3d4BVj_rkPg":{"text":"The French Quarter is just as I expected and more! The architecture alone is stunning. I t","useful":1,"cool":0},"b_vektR-RBEZGKI0AdyA0Q":{"text":"No visit to NOLA would be complete without a visit to the French Quarter, and on my last v","useful":0,"cool":0},"im-fzo8OvXcOHzkZ1SOJ8w":{"text":"Bourbon Street has to be \"experienced\" firsthand\n\nThere are many facets that make up the F","useful":2,"cool":1}}