{"ncVnfoJj73QZnu1ThZ-zKw":{"text":"Good, unique Italian restaurant.  I say unique because many of the dishes were not typical","useful":0,"cool":0},"g-_PPxGp6TxpI_t8sCG_Og":{"text":"A friend and I ate here last night (1/7/11) and had delicious pasta (especially the gnocch","useful":0,"cool":0},"tUhXlqwcmIJetBk3i98Qkg":{"text":"We dined at a Mano this past weekend and loved it. The Italian red we ordered was wonderfu","useful":0,"cool":0},"wZn_OvnUV6EvCI9-ghcRLA":{"text":"One of the best dinners I had in NOLA. Had heirloom tomato salad with melt in your mouth m","useful":0,"cool":0},"-NgBApYDHHigU6UAQ-gocA":{"text":"Have been here numerous times - always great service  & delicious food. Fantastic house cu","useful":0,"cool":0},"z2R7MLfc4x2bhT22Y_XWiA":{"text":"I decided to try this place in spite of some mixed reviews and I was not disappointed!\n\nLo","useful":3,"cool":0},"JAS8u_5wowCxg1K_CPzdgg":{"text":"If you're going to dine here and you're an always hungry type of person - you have to orde","useful":1,"cool":0},"1CLEN3x68Bz7W6oRy4SO5g":{"text":"Great value from a team focused on regional and artisanal produce / ingredients and sustai","useful":0,"cool":1},"Ea8kTyuurPz3fCmWNCfvNA":{"text":"Truly awesome!\nCome hungry, because my wife & I basically took our entire entree in a to g","useful":1,"cool":0},"27ItQDvcr7i1wXvCsOTepw":{"text":"The waitress was abrupt and not helpful when asked questions about the menu: she merely re","useful":0,"cool":0},"oG0Kh5u4tPKryG6J3wKlJQ":{"text":"I saw great reviews and was recommended by a friend to try out a mano. We were the only ca","useful":1,"cool":1},"2brUl4iU2y4RmNoFnTyhyQ":{"text":"I stopped in here with a friend the other night on the way to someplace else. We were pass","useful":0,"cool":0},"epAteC_ikN8eErAbMH7k4w":{"text":"Amazing! I had to roll myself out of here one night. \n\nI started with the Burrata which wa","useful":0,"cool":0},"At8ZMJjGeOZVl_MM9n9NQA":{"text":"Service was attentive and friendly.  The restaurant has a nice vibe to it, and presents we","useful":0,"cool":0},"9Cf05fbNxxU97FD7ls1xuw":{"text":"This was our third trip to a Mano and was the best by far. Our first two rodeos were a dis","useful":0,"cool":0},"vYuNFAGcin6SzFlTQwQnug":{"text":"A friend of mine alerted me to a series of dinners A Mano was doing, each week featuring a","useful":2,"cool":1},"SPQ94XXLojebU8V85SPxxw":{"text":"I'm about to gush - just letting you know.\n\nFrom start to finish, this dinner was flawless","useful":0,"cool":0},"UARuP9jHIahvJCxn3Cf7oA":{"text":"I stopped by with a coworker after a long day at work. We shared the fresh  Burrata  and p","useful":0,"cool":0},"nJvZnfpYhCIge27wKVPQyQ":{"text":"My wife and I dined at a Mano and although the food was good our dining experience was jus","useful":0,"cool":0},"RtsCV2_dZt8fZXOjlBMGLg":{"text":"I finally made it here for lunch on a Friday and got the Squid-ink Cavatelli with tuna, ch","useful":1,"cool":1},"kKYCMk5L_xzAl_ds3f5x0Q":{"text":"The food was just magnificent. Highlight: Gnudi dumplings in a sage brown butter sauce. Ju","useful":0,"cool":1},"jQb5VpNICl3g72mdzG_6xw":{"text":"Beef carpaccio. Yum. I continue to absolutely adore this restaurant!   By far my favorite ","useful":0,"cool":0},"SbZnVU0UwLi4tYcsfdLQVw":{"text":"Chef Adolfo Garcia is a well known staple in NOLA for other restaurants like La Boca and e","useful":3,"cool":0},"-1NGwnRJU8UpZWjf-ZOOgQ":{"text":"i thoroughly enjoyed my meal at a mano.  i'm pretty much a sucker for any pasta al amatric","useful":1,"cool":0},"MpJEgyABnATCbaF61jQzrw":{"text":"Punchline:  Yum.  With a cherry on top.  And a nice glass of wine, thank you.\n\na Mano is a","useful":1,"cool":0},"s2aORQW9aHhmM3aG3w3z1Q":{"text":"Heard great things about a Mano so made a reservation and dined with my wife and 2 kids ag","useful":0,"cool":0},"jm2CjyoLq8qGw5S4S2JBBA":{"text":"Flavorful and reasonably priced. Very nice textures of food and good atmosphere. I had a g","useful":0,"cool":0},"Fl88yx5_lzaumRwro-Kc9w":{"text":"I'm a fan of Adolfo Garcia's other flagship restaurant, Rio Mar, so I was very excited to ","useful":1,"cool":1},"ei3B7_AevDDZsDa1zxaIwQ":{"text":"My Italian boyfriend took me here on my birthday and said it was JUST AS GOOD as his mothe","useful":3,"cool":1},"wVFl01nGHfcePq5dcF7gvg":{"text":"First of all, I am a huge fan of Adolfo Garcia. I have yet to be disappointed at one of hi","useful":1,"cool":0},"zSdoeA6TxWjf-5soj66xvQ":{"text":"I finally had the opportunity to dine at A Mano recently for some Italian dining. I like C","useful":4,"cool":1},"wGn4HaId6bxKwTjAxoYUEA":{"text":"I've heard positive things about this place, but don't know why. Been twice now. Sorry, ju","useful":4,"cool":0},"5XMKDYmMGSKkCkrYoELxzg":{"text":"Very very disappointed. I've been to La Boca and thought it was great so I anticipated thi","useful":1,"cool":0},"8pgqqaFXzriCF5yFgLRTZQ":{"text":"Fantastic knowledgeable staff did a great job of answering our questions about the menu, p","useful":0,"cool":0},"hVjlcNBrQbwZu94TL4PjTw":{"text":"Burrata app and gnudi were very tasty. Hostess was eager to give us after-dinner entertain","useful":0,"cool":0},"D1sN-Q50kYHkHiKS3nvhAg":{"text":"My favorite Italian place in New Orleans! The burrata is to die for! The gnudi is also exc","useful":0,"cool":0},"EKz3BrhDA9CUYYN0GfQ4Sw":{"text":"I have nothing bad to say about a Mano, but it was just a 3 star experience.\n\nService was ","useful":1,"cool":1},"EcT2zJAlOIFbfNR-d2n1iQ":{"text":"I had the opportunity to experience A Mano with the legendary Alfredo Garcia himself. He i","useful":0,"cool":0},"rQkb253jxVRrDoywjijFoQ":{"text":"Food was great. Service was average. I would not recommend this restaurant to anyone. We h","useful":1,"cool":0},"RsucWgprOUA27ImLeOGzYw":{"text":"The overall experience at this restaurant is laid back. Relaxed and casual setting in whic","useful":4,"cool":2},"OLqttO_hpOPO-6s5V8foxQ":{"text":"Delicious house-cured meats and creative pasta dishes in a laid-back setting. Extensive se","useful":0,"cool":0},"WnKe07i5i68mBIEIQv-V1Q":{"text":"Excellent, fresh, seasonal ingredients, simple preparations, and a great friendly bartende","useful":0,"cool":0},"TcymB9uM-4DSEOG587FXig":{"text":"This is in the former location of Chop & Joes.\nThe corner of Tchoupitoulas and St Josephs ","useful":0,"cool":1},"buFd4vuqF7g-i03Hxsy_Ew":{"text":"Absolutely spectacular, innovative, Italian cooking that is really one-of-kind. Nothing li","useful":1,"cool":0},"qMUwCayj0PC-kcuD8GcFvw":{"text":"Lovely setting, not too noisy.  The salad with roasted beets and BUFALA GORGONZOLA - OMG I","useful":0,"cool":1}}