{"QrkbE8GdBZt_k566iLWbRw":{"text":"Went to pick up a to go order and had a very political flyer in the bag. I was very offend","useful":0,"cool":0},"2B0dvaoaweQLDzlJA4LWPg":{"text":"I got a beef burrito, wet, and it was awesome! I also wanted a glass of pinot Grigio, and ","useful":0,"cool":0},"fUtluv9avoeHTntn9LHt2g":{"text":"I give it a 3.. just because the guy who was making the burritos wasn't wearing gloves. Fo","useful":0,"cool":0},"1HpQrv-TXjy_KkkaB6vn_Q":{"text":"Unfortunately, I was a little disappointed with Juan's due to the insane hype built up aro","useful":2,"cool":0},"0eofsXm9DZKhavLP0_BnTA":{"text":"Oooohhhhh I love this place...and I cannot stand Mex food!\n\nFish tacos with their deliciou","useful":0,"cool":0},"Fra_iNp8PD0qpaYh56pu6w":{"text":"Paid a visit to the mid city location of Juan's. Knew the visit was going to be good, when","useful":0,"cool":0},"YztgJpPxEFMZoddLho5-Tg":{"text":"If you're looking for a Mexican restaurant with a bit of a twist, Juan's is the place for ","useful":0,"cool":0},"T57lk8ctQ5S0wfgHGPpuyQ":{"text":"Food and service were good and prices reasonable. Salads were large, the guacamole excelle","useful":1,"cool":1},"CX4Jmo81qiiXX28EM_e3iA":{"text":"The quesadillas we ordered (shrimp, beef, & chicken) were excellent!! Word of advice: Don'","useful":0,"cool":0},"Yt0cC66nHg1o8j09D7NuDA":{"text":"It has been a looong layoff from Yelp so I thought I should start (er, restart) with a pla","useful":0,"cool":0},"KSZhrjcNy_xwSF_iRbBKyw":{"text":"Kamehameha Nachos (9$) are absolutely magical. I love the combination of their pulled pork","useful":1,"cool":0},"yWCG1PGGbAuqvv0g_DSljg":{"text":"I love Juan's, and just learned that one of my favorite bartenders in the city (Diana! Tha","useful":2,"cool":2},"AyVCIllnArps5wKjyLgv7g":{"text":"If you've ever had a real burrito, do yourself a favor and don't come here.","useful":1,"cool":1},"k35SIixvZ31N4eVq_yCQ0g":{"text":"Ate here because of the reviews. It was not bad. Thought it was a fast food place and walk","useful":0,"cool":0},"7Rzx6hb_RlDCXT44ZwY-uQ":{"text":"I usually get tacos when I go to mexican places - because face it - who doesn't love tacos","useful":2,"cool":3},"ToTh-nRvxhTzohuQc14L-g":{"text":"Two words: CRAWFISH ENCHILADAS!!!!  Don't forget to ask for chipotle ranch to dip your tor","useful":0,"cool":0},"tJz2ULIbU9bww1BDQHzdDg":{"text":"I never write reviews, but this place was killer! Cant say enough good things about our ex","useful":0,"cool":0},"1HcSNPjXD_82711C5J3jwg":{"text":"Only getting one star because of the lemon berry margaritas. It was a group of three and w","useful":0,"cool":0},"FCD1mqPdmkZRcM0h2v4tpw":{"text":"Juan's made me a believer. I have been accustomed to very americanised-mexican food. Not t","useful":0,"cool":0},"cRUN5cAeSmPE9S8CqKTftA":{"text":"We love everything about Juan's.  The salsa is always fresh, the pork quesadilla's are spe","useful":0,"cool":0},"edV-PecjLRS3lMEiRmuRYA":{"text":"This is probably one of the better places to both drink and eat Mexican in Mid-City but th","useful":2,"cool":3},"AVck_UKMWc2Yc4f-YANLOA":{"text":"I lived in new orleans a long time ago.  When I returned after 10 years, I had to go to my","useful":0,"cool":0},"LUz4n6T7z6QwF2CyvKJZyg":{"text":"Burritos! Nachos! Cervezas!\n\nAmazing food! The only problem is it ALWAYS seems to be packe","useful":0,"cool":1},"vmx-SJfTkgJun_QMhDuq0w":{"text":"Juan's is a neighborhood restaurant that is cheap and awesome. Although almost always busy","useful":0,"cool":0},"sINaRr1ZSAoW9GXwLWwswQ":{"text":"Pork n' Slaw Tacos to Die For!.. Blackened Redfish Tacos! and the Juaha Roll is amazing..a","useful":1,"cool":1},"w4CQYCr2CWIw-s6UWYdEkg":{"text":"Always the best!! Mardi Gras Indians and the rice and black beans app are ahhhhmazing!!","useful":0,"cool":0},"jI_OhRQmQxAPcEk3933tQQ":{"text":"Great food and ambiance! The food is Tex Mex but very good. The music was a bit loud and w","useful":0,"cool":1},"tFGplfscESCjf7jFojTydg":{"text":"This is the second Juan's and it just doesn't hold up to the original.  The homemade salsa","useful":0,"cool":0},"bXfbByU6DLmziwDljWfhdA":{"text":"The waitress was friendly and attentive. and the margarita was strong. I had the enchilada","useful":0,"cool":0},"yHQiTZqalwnRum3xZGm3JQ":{"text":"If you are in New Orleans but not staying downtown, Juan's is a really great place to chec","useful":0,"cool":0},"Zi7QVultcwTgv57XLZnywA":{"text":"Went with the Juan's Flying burrito. It hit the spot as it was a large portion. I'm not su","useful":0,"cool":0},"f2qBU2hTw-iPTw_5u9iqsQ":{"text":"Like this place fine but the fish tacos need some work. Seasoned well but a couple of bite","useful":0,"cool":0},"rYr59z3cKWsnLmOa-SAqsQ":{"text":"For the first time in my life, I got up and left a restaurant (1:30 p.m. on March 18, 2015","useful":2,"cool":0},"0gc4-hX80VcmylnVo-_BLg":{"text":"I'm visiting New Orleans from Southern California and I wanted to order some delicious, ea","useful":0,"cool":0},"FzJCUMC2d1tB20eaU7i2-g":{"text":"I cannot believe I do not eat here more often!  The food is fabulous, I don't think anyone","useful":2,"cool":1},"TiihTMV0hMD6n-y2VzcxMg":{"text":"Yooo, what?! This place is the bomb. I'm a vegan and I ate like a damn QUEEN. They have so","useful":0,"cool":0},"m4DHHaKtUkcJ3hFdAvMtYA":{"text":"Very yummy! Started with the trio and then Superdome Nachos. Delish!!! Staff was pleasant ","useful":0,"cool":0},"yTlNIDWWMLDxhOKgodNfYA":{"text":"Juans has been a place I consistently dislike but consistently feel like I should give it ","useful":1,"cool":1},"4wFwPcOYd3frcF4KoBqsxA":{"text":"Parking lot was packed and people eating outside; concerned about a long wait, but was not","useful":1,"cool":1},"Rt9YWJ78maWyS6hjYqhHuw":{"text":"Juan's MidCity has been my evening Mexican fix for quite some time- indulging in tequila, ","useful":0,"cool":0},"7wpMf83lX-VFqVUD6CWQkQ":{"text":"I had a good experience at Juan's.  Their menu is trendy and certainly steps outside of th","useful":0,"cool":0},"ER4jLjPwLvISmHndEbn3uQ":{"text":"I  love Juan's and eat it whenever I get a chance.\n\nI can understand some of the negative ","useful":2,"cool":0},"RmhXwhzccZgsYDdx9KVenA":{"text":"flawless!!!!!! food never disappoints, beer is cheap and this one of my favorite spots to ","useful":0,"cool":0},"_bK6ijOUsAf46TgD-4sG_w":{"text":"Been coming here for years and I always love it. Chrissy is beyond awesome! Food is delici","useful":0,"cool":0},"kBdwYIK7rxrYx1Nfd__IkQ":{"text":"I'm gonna rate this on a slight curve because we ate at 10:00pm which was close to quittin","useful":0,"cool":0},"AuCbLOK-JvWf5ER6UM_Shg":{"text":"AMAZING! Great service, delicious food and fun atmosphere. One of our favorite places in t","useful":0,"cool":0},"FCO8ys1D_lICk1B6JK3GNg":{"text":"Takeout is always wrong. Today was the fourth and last time this month that I'll attempt o","useful":0,"cool":0},"OKHbiM8EbtXraA0vefQ_fg":{"text":"I'm from Los Angeles, so I'm really picky when it comes to good, authentic Mexican food. J","useful":8,"cool":5},"vCvRVJaU7VDg_93ee-jbHg":{"text":"LOVE Juans!! Cant go wrong with anything on the menu! Wish the space was bigger but hey wh","useful":0,"cool":0},"o8AJhWzQ3g08qvPHjGqAQw":{"text":"Service is good but food is horrible . If you like real authentic Mexican food this is not","useful":0,"cool":0},"Tg-AnQ1SG1c9RdUFQ9cB7w":{"text":"This was a great experience. We traveled to New Orleans from Florida on vacation and disco","useful":0,"cool":0},"M7EhhbF-aUIgwSaox3WGZA":{"text":"Disappointing.   Use to be good food but now it's okay.  My salad had so much dressing it ","useful":0,"cool":0},"sZc8puZ0zBXodr_d-5SDsw":{"text":"This was the first restaurant where my husband and I ever ate in New Orleans, on the night","useful":0,"cool":0},"anhfVcww75bLMDQr1Tt--Q":{"text":"Tiger Woods cocktail..will be a great starter drink!!","useful":0,"cool":0},"ELIlv4GZVqBc8phErLfTsQ":{"text":"I've been to a ton of different \"burrito\" places in the last few years, everything from ch","useful":0,"cool":0},"CoqnOWlMVWq1bOQgLOY62g":{"text":"Packed place, full door, staff members running around like chickens with their heads cut o","useful":3,"cool":2},"dxL2T_T0AJ6wUSV08V40YQ":{"text":"I recently tried Juan's, and I really enjoyed it. There is seating on the sidewalk outside","useful":0,"cool":0},"J5CqyJhbzhAxVlyhL8V7og":{"text":"I have to give it three stars because there really are no real fast food Mexican restauran","useful":0,"cool":0},"Nui7YKPlXqa-mJU2OFLE5Q":{"text":"I've been here many times and this has become my go-to mexican restaurant in New Orleans. ","useful":0,"cool":0},"-JPtMjDZ3llgxSfH0wSI6g":{"text":"Since some time has passed, I have to reevaluate my love for Juan's. The parking situation","useful":0,"cool":0},"eM1nj-RBjDg1jq9VoEFoMw":{"text":"We really enjoyed our two trips to Juan's during our stay in New Orleans. I'd managed to m","useful":0,"cool":0},"pwym_vNo7--8BNshuJ8oDg":{"text":"We heard Juan's was good so dropped in for dinner. 6pm most tables were already occupied. ","useful":0,"cool":0},"T8UdAuia1pw2x9LiPAcHpw":{"text":"You might hear Slayer's Angel of Death blasting from the kitchen (RIP Jeff Hanneman, reign","useful":0,"cool":1},"3ouJeVYLI9lxt5XbC0lMpg":{"text":"A neighborhood favorite! Inexpensive and the margaritas are great. Try the 504 nachos!","useful":1,"cool":1},"7QyAjr8Owwd66qYBiwotbQ":{"text":"This is actually great value and good atmosphere. You cann take out and drink beer while y","useful":0,"cool":0},"2Dm_B7Cy56P2IwDJ2Y75sA":{"text":"I have been here a few times and everything seems to be pretty tasty. Love the Jerk shrimp","useful":1,"cool":0},"t21xZGObczsl0UVjDEYquA":{"text":"I think in the back of my mind, I wanted to not like Juan's. I just heard so many good thi","useful":0,"cool":0},"v8ybVPP5HH745oxlNIpJzw":{"text":"I've been coming to Juan's (Mid City) for a couple years and I've thoroughly explored the ","useful":0,"cool":0},"zcMZ_3Jjs8vNQqPQpH10-w":{"text":"Allen and I desperate for good tacos in this town (please DM suggestions!) and so won't pa","useful":0,"cool":0},"AlCSOUcFJeudEJibRm5yZg":{"text":"I really want to like Juan's.  I really do.  But everything about this place is inconsiste","useful":0,"cool":0},"3MAzEbDmErKosoN4M6FYYQ":{"text":"Awesome food, service and location.  1st trip to NO and this one will definitely be on our","useful":0,"cool":0},"nWmkvgZY4VNaFBKOKHk9SA":{"text":"the staff is so horrible here, that i have overlooked how good the food was.  after six ti","useful":1,"cool":2},"_H3swqS3hTq6CAc7nFHhmw":{"text":"This had been a solid 4 or 5 stars in my naive past, but after frequenting this place for ","useful":4,"cool":2},"OlBdbIMpBvGk21b3QkMO3w":{"text":"Ordered the wet burrito, and it was the best Mexican spot I could find in NOLA. Highly rec","useful":0,"cool":0},"t1xUsSOCoF9tvsUdQwN5tw":{"text":"Used to really like this location and their food. I don't know what happened to Juan's. I ","useful":0,"cool":0},"qlOBM39jvH15SRC68T5QRw":{"text":"The veggie burrito was mostly bland with an overpowering amount of jalapeños that ruin the","useful":0,"cool":0},"0SvInvtrmqkl-dZ9DKCoyQ":{"text":"Pretty good . Margaritas will have you crawling outta there! Ate the pork 'n' slaw, very g","useful":2,"cool":0},"ozyRSSMiube0NU_HhvGKxg":{"text":"This is my go to neighborhood place.  Place is hipster and youthful but fine place for a y","useful":0,"cool":0},"sOE3O5yXC8vAUtahpoI2Yg":{"text":"Just wasn't good. Ordered a simple chicken quesadilla...was not pleased at all. The chicke","useful":1,"cool":0},"yRAi9b5ps1NcgmDIRWUafQ":{"text":"If I could post zero stars I would.\nThis place has no clue about Mexican food or preparing","useful":0,"cool":0},"c5RbL-2RoThGd3fW6KVKKQ":{"text":"love this place.   hadn't been to this location, so just a heads up, parking can be a pain","useful":1,"cool":0},"juC37vks0AHRk39iZWZXbQ":{"text":"Juan's....I love you!!! The queso is different from what I'm used to,but it's great! I lov","useful":0,"cool":0},"wRb5D53wP44crWQyblP1cg":{"text":"Juan's Flying Burrito (Mid-City) is located in a busy section of N. Carrollton Avenue. Thi","useful":0,"cool":0},"zwgs0Afl7wsC-Jxpwlmt1g":{"text":"Awesome food. Great service. We were dropping the kid off at college and after a day of mo","useful":0,"cool":0},"gpwY99Xc5XSiXM0RzVJ8vw":{"text":"I love Juan's.  I really do.  The food here is awesome.  I wish they carried more craft be","useful":2,"cool":2},"qG-HcKXkcsByVsrFB5GJUw":{"text":"I LOVE Juan's -- Lots of kids at the Mid-City location but it's still great. Awesome happy","useful":2,"cool":0},"8ROmRYoSkrLsReOx6_KFxw":{"text":"After a day at the NOMA and a pleasant stroll down Decatur, we ended up dining in Mid-City","useful":2,"cool":1},"laqjDkbSzuLRt8dtKqFXaA":{"text":"Best burrito location in NOLA!  If you know of a better one I will reward you for introduc","useful":2,"cool":2},"o7M8P6ijk2QebrYGuLeP3Q":{"text":"Good food, good service, cheap beer. Not much else I could want out of a place! I had the ","useful":0,"cool":0},"j0KBjB6Q6bnOB-Ta2nugRQ":{"text":"The outdoor seating was really great! I sat on the sidewalk with my pup, and the service w","useful":0,"cool":0},"4OyYNplPJb6AWYE5rKMhfw":{"text":"I went here with 2 friends last night.  Waiting maybe 10 minutes for a table. Waitress bro","useful":3,"cool":1},"Lmn0eYYE9LBAZPHR_7ApRw":{"text":"Man I just can't say enough good things about Juan's! Their house margaritas are much bett","useful":0,"cool":0},"kno6ukOorDujb_LP-wQ-tg":{"text":"I've been to Juan's twice: once in 2012 when it was dead and once this year when it was sl","useful":0,"cool":0},"mKk0b3W412EddMAcQPgddA":{"text":"The food here is always delicious, with flavor explosions in the mouth. The service, has b","useful":1,"cool":1},"JsAGu_UfkJElzglivxSo0w":{"text":"Had great takeout food from there the food was absolutely delicious was  very good we will","useful":0,"cool":0},"4aV_ZwxPIYg__EOULTjRTQ":{"text":"Well, not exactly blown away, unfortunately.\n\nFor starters, no pork for the Hawaii 504 Nac","useful":0,"cool":0},"3mBwUFO9CuTur_E7W6OvNQ":{"text":"My go-to spot for burritos. Their Hawaii 504 nachos are wonderful. Never thought pineapple","useful":0,"cool":0},"TzXK8ZzCph_bbd_C2ugsZQ":{"text":"Juan's will fill all your Tex Mex cravings. I've been here for lunch and brunch and never ","useful":3,"cool":3},"SryM5cA8238elysvoIuYgw":{"text":"Food was excellent..... service was good... order time was FAST .... ONLY minor issue I ha","useful":0,"cool":0},"iFC5uWLYDO_bkEcx7b-JKQ":{"text":"A go-to spot for us when we can't think of what we want to eat. The regular margaritas are","useful":1,"cool":0},"N9vxJG9uiBMpaxaCCuT5Vg":{"text":"I generally like Juan's but this location has grossed me out both times I've been. I could","useful":0,"cool":0},"8ksGJHapqU--uCoUOlfiWQ":{"text":"Not a good experience today.  The pork tacos are usually our go-to selection, but today th","useful":0,"cool":0},"G63idimDOhtwELQxDt9jsA":{"text":"Juan's on Carrollton Ave. is one of the best kept secrets in the city. I say \"secret\" desp","useful":0,"cool":0},"vKdYCsycZpg3y2l8RrbgSA":{"text":"They can't be bothered to answer their phone or get orders right. Happened the last three ","useful":1,"cool":1},"8i_-Hes1AUEXAtG-lSSLEA":{"text":"Juan's Flying Burrito on Magazine St. is one of my favorite restaurants, however this loca","useful":0,"cool":0},"lmiXrnBrk8LlcH0iRvTzyg":{"text":"Don't get me wrong... The service here is amazing! All of the staff are very nice and poli","useful":1,"cool":1},"6ZZtlAEHuUAwLVxlslYNhg":{"text":"The food is great but the parking like most of the other reviews mention is hard to get. I","useful":0,"cool":0},"1B29QlzHv6kEg9lgOs_CMQ":{"text":"I moved to New Orleans as an avid fan of Chipotle.  And I know, I know -- you don't move t","useful":0,"cool":0},"VrB_dco-_AscIvv_DlYLnw":{"text":"Sometimes you just want to get a frozen margarita for your dog walk. It's delicious, big, ","useful":1,"cool":0},"bu9PaJLisBa46V5f7NdhHQ":{"text":"I don't know if they still have it because I got it a few weeks ago, but the Southwestern ","useful":0,"cool":0},"aKssdMlLNbON-Oz1C0AKag":{"text":"Not usually one to leave a bad review but I was overwhelmed with horrible service, unfortu","useful":5,"cool":2},"OLzErp157GoRf5nnuKEVWw":{"text":"someone should inform ownership that the new lights over the bar are more suited to incuba","useful":0,"cool":0},"l6md66z2Nx_mJwBjacym-g":{"text":"Juans Flying Burrito(the Carrollton location) is my Taco Tuesday fix...hell any day of the","useful":0,"cool":0},"FvNaosUTArMfOpT7HCnjfw":{"text":"I love Juan's Flying Burrito!! I eat here way too often. They have amazing queso! I've als","useful":0,"cool":0},"K6mXsktzAtltEmdJ-bee7Q":{"text":"While visiting a friend in NOLA, she ranked this restaurant as her favorite!  We split the","useful":0,"cool":0},"97cYWxRMaMLA_gs2hWUegA":{"text":"I'm mixed on this place. The portions are completely reasonable and so are the prices. The","useful":1,"cool":0},"xjASCW7bGCQC6XiF8sLfFQ":{"text":"I suppose Juan's reads the yelp reviews and has done their best to improve because I found","useful":1,"cool":0},"meA_plmkVg1DMtBZe2GEbQ":{"text":"Had cheese queso & the bacon azoul.The Azoul is always a winner beef bacon and cheese the ","useful":0,"cool":0},"mF_gsH3bI1HA1SU1GZl2hA":{"text":"I'm the Juan's Take Out Queen...... You can't get better than there Flying Fajitas.... Jui","useful":3,"cool":1},"vAx5BkeFKZT6_rhu3XtE3w":{"text":"I heard a lot about this place, and decided to try it with my husband. Both of our dishes ","useful":3,"cool":1},"xp1zIe2m9pb-cb43Hs2pow":{"text":"Love Juan's. Today came in for lunch...one problem...guy with HUGE dreads, nice and long..","useful":0,"cool":0},"3gc-T08uYRdhWz5KKZaXxg":{"text":"simply put: I am a burrito snob. I make them at home just about everyday and I'm Mexican -","useful":0,"cool":0},"nH19Oduvv1tR-ge7zVswbA":{"text":"Cheap and yummy!!\nMight I say, the one on Magazine Street is a total bust.  Even if you're","useful":0,"cool":0},"oGZQ3ehF3SsAgYLlFrklOw":{"text":"Loved this place until today.  Waited at least 20 minutes while waitress chit chatted with","useful":1,"cool":0},"W66SBQfXcG3mT2mUo9pNRQ":{"text":"Went here anticipating just having drinks for happy hour.. I typically don't like house te","useful":1,"cool":0},"hYtJB1IJipv_ztJDHKhBDQ":{"text":"Juans is always a good place to get a margarita and some cheap food. It is american mexica","useful":0,"cool":0},"oQQLYEjvXrPwVdkgyDjNNQ":{"text":"Great margarita, service, and food. This restaurant is hip and quaint. I had the pork taco","useful":0,"cool":0},"QHm9Fo2aqjYULUnZNqzheQ":{"text":"My new favorite! Good music, cool atmosphere, & super yummy food! I had The Luau quesadill","useful":0,"cool":1},"c_O83u1qWO4sleS5y3Yj5A":{"text":"Juan's is a good spot for Tex-Mex and drinks. Everything I've eaten here has been awesome,","useful":0,"cool":0},"tqWH5V6ZrFPmlmKyxVD_Yg":{"text":"the food is pretty decent at this location.  i've been here a couple of times with friends","useful":1,"cool":0},"RiQSk9A54hueSggkVBel4Q":{"text":"Always delicious. This is my go to spot for Saturday lunch. The tattooed bartender is alwa","useful":0,"cool":0},"aOLnsk5iwEH1Rd9WZJlLXg":{"text":"The first time I was seated outside and I remembered the disgusting smell coming from the ","useful":2,"cool":0},"edIMK6mwAp0Y30vFFdhnNw":{"text":"Great funky place.  Friendly staff.  Buffalo tacos.  Al Pastor burrito.  Good portions.  H","useful":0,"cool":0},"8K7AYu3YufmtOMqK4cZPPQ":{"text":"Bestest pico ever!!! How is this possilbe that I've never reviewed Juans - I KNOW I have .","useful":0,"cool":0},"P0AWBKy7_tft4ntL8Mz-dw":{"text":"Whenever I'm craving a margarita, $2 cans of PBR, and some tacos, I head to Mid-City Juan'","useful":2,"cool":0},"vVktsb2G4jraWMR5EwSc_A":{"text":"First off, I dislike having to pay for chips & salsa at a Mexican restaurant when most giv","useful":0,"cool":0},"kUehXSyxTLFEJRNfZ0c39w":{"text":"literally best fucking burrito ever. 10/10 would recommend. it's like heaven in your mouth","useful":0,"cool":0},"Ip89T30tBnq1nQ3HW9b6vg":{"text":"I love the flying burrito. So much going on in it! Properly priced too. Very affordable. I","useful":0,"cool":0},"U-o_sLoXB7lwFZ9OcY9qbg":{"text":"One of the better Mexican places in town - nice weird quesadillas like the BLT. And it tak","useful":0,"cool":0},"2qMXgEjUxDSpllsyVTYLZA":{"text":"I throughly enjoy an atmosphere with unique uniforms where I dine. Juan's Flying Burrito i","useful":1,"cool":0},"BX4CGFlwjpLKBhwin-IMlg":{"text":"Enjoyed some drinks here during happy hour on a visit to New Orleans. Ordered margaritas a","useful":0,"cool":0},"vk07LcV2IqMyJjtg4b4ikQ":{"text":"Absolutely amazing! A must visit if you're in the area. High quality food and a creative m","useful":0,"cool":0},"L5dQ-sFbUL2SPAK3uyfE1A":{"text":"Do not come to Juan's if you are looking for authentic Mexican food!  It is simply a self-","useful":3,"cool":2},"g3I6bAtCgF5odpMo6EvbJg":{"text":"Not terribly authentic but reliably delicious.  Count on waiting unless you go early.  Ser","useful":0,"cool":0},"yH0EoRoQpYfLNxPt6pmoOg":{"text":"First time going there and it's amazing. The food is good. I got chicken enchiladas with r","useful":0,"cool":0},"HLpuH4MLVrqd9ojEQirJSA":{"text":"Had some damn fine cheese enchiladas and a few bottles of Turbo Dog for $16. Their red and","useful":0,"cool":0},"xdkfZB6bWxUbdrbmcCCpew":{"text":"Not reviewing the restaurant as a whole  just my service today. I work next door to juans ","useful":0,"cool":0},"dDW30iXsZwT7rXIoBnfuhg":{"text":"I've been to Juan's many times over the years and I don't know, it must be me, but i am no","useful":3,"cool":2},"AsuBsAapDnnJIXZqAqWLaw":{"text":"Visited Juan's while walking around trying to find some creole food, really liked the sign","useful":0,"cool":0},"itCetIBZdKJM9pIn83pgRw":{"text":"I am originally from Phoenix, Arizona and I often go to Juan's Flying Burrito to satisfy c","useful":1,"cool":2},"qUkIB-1DS02abS_5zpqU5w":{"text":"I am a big fan of Juan's and great variety on the menu and never disappointed with what I ","useful":0,"cool":0},"LsTMzIizEXhBsN2S1uIbnA":{"text":"Sassy Mexican food with tons of sauces. Large portions and we came hungry. Cool vibe and w","useful":0,"cool":0},"r5o84lY1EKx0EolSZrIXTg":{"text":"Update- Dinner 8/13:    Went for dinner with my brother who was in town for a day. Service","useful":3,"cool":2},"r9gZDknULWx6_1b6adrhzw":{"text":"This is a pretty decent burrito/taco joint with a great location for us Mid-City folk.  Th","useful":2,"cool":1},"kQO_NQrio1q2CI8sSyslXw":{"text":"saw the shrimp fajitas burrito on the menu and wanted to try that, but when the waitress c","useful":0,"cool":0},"rHeK_nY1h4PlBiVIXTYtjA":{"text":"2 dollar Tecate all the time I mean really! The fish burrito was good too.","useful":0,"cool":0},"Ekvumhfw_Bc118ohT8gRLQ":{"text":"Another awesome green goat with Happy on a Sunday afternoon.  Saints win. 20-12. Beautiful","useful":0,"cool":0},"6QzcCSlznTp1rgHnVWAcJw":{"text":"Excellent food at a reasonable price. Service not bad but not really fast. Parking is a ch","useful":0,"cool":0},"0AJZZcxqWUeurOEaQpGaTQ":{"text":"I love Juan's!!! Yeah it sucks having to wait for a seat but that should say something abo","useful":0,"cool":0},"FkXcQDKSUv9JiKQhdLCJgA":{"text":"I order take out food from here at least once a week(for about a year now) and enjoy it ev","useful":0,"cool":0},"Wc_8ORS3C8l5nJnKkf6nEA":{"text":"I hear this place might be better for happy hour, as it was an average experience for the ","useful":0,"cool":0},"wQXqEPiaqgpfubkGCAHrpg":{"text":"Creole Taqueria?! Yes, please! My family discovered Juan's Flying Burrito while on vacatio","useful":0,"cool":0},"uyivWvj0WegeJcWyoc_UlQ":{"text":"this place is pretty good. i usually go with a burrito, but recently i decided to try some","useful":0,"cool":0},"k01RhGmXlS0BzAlmrv289w":{"text":"Here with Reggie & MoonPie.....\n\nAbout to try the Flambeau... It's a cheesy, spicy, burrit","useful":1,"cool":0},"rOyfiwu0Ukzt3lqm3kguBw":{"text":"This is my happy place.\n\nThere is little bad in my world that an order of guacamole, some ","useful":6,"cool":5},"fs-fpyEl_efmRZnzNe-E9w":{"text":"Mmmm......just thinking about the Flying Burrito makes me want to run over to Juan's. Supe","useful":0,"cool":0},"Kyzq3-rSfokfEM4RzFgRKQ":{"text":"Cadillac margarita was awesome!   Chips and guacamole was good too.  I ordered a vegan gre","useful":0,"cool":0},"UT2WT4HOlPlaYgDKQH9R-A":{"text":"I finally made it to Juan's. After hearing so much hype about this little place, I was det","useful":10,"cool":7},"10r1FgpiDyMzb9-6psGHsA":{"text":"After a quick shopping spree, we ended up here for some tex mex and margaritas. \n\nWe order","useful":1,"cool":0},"Ls2RtvcM-MX_BogpTe7Gmg":{"text":"I've been to Juan's several times and have always been impressed with the service and food","useful":0,"cool":0},"9DM2IOV_ifzS6__H7JA3ew":{"text":"Cheap, good food and great margaritas... What else do you need? Love trying out the specia","useful":0,"cool":0},"9AufM3wHxPG6YY_dUkAUww":{"text":"This is one of my local favorites. Excellent food! The margaritas are strong, so watch out","useful":0,"cool":0},"CtJ9GSIXwzGIwqfqePnn4g":{"text":"Good food, fun atmosphere. The Black and Gold burrito is tasty and filling. Kids enjoyed i","useful":0,"cool":0},"dyeGagaxTdNgWt9TBbRQzg":{"text":"Pretty good food for the price.  Tasty burritos and yummy nachos.  Huge portions and a hug","useful":0,"cool":0},"rYXY2cF6EwkyRXeAtgrmig":{"text":"I've eaten here way more than I can remember. I try a new burrito each time since I can't ","useful":0,"cool":0},"9bvARUqzcQIhMEBHdRNJUA":{"text":"Holy crap!!  I can't even wait to finish eating my food before writing this review. In NOL","useful":1,"cool":0},"edvGZtB4pciiKUQ9Mes1YQ":{"text":"This place never fails. Took a while to get the food but it's still good. They pay trap mu","useful":0,"cool":0},"g4vXF1cfZ__AnupW9-juDw":{"text":"its ok. Don't park on the street in front, you'll get ticketed. It certainly wasn't worth ","useful":0,"cool":0},"eZkpxWI0zlzqpaevIlSkXQ":{"text":"Absolutely delicious! Tried the pork and slaw tacos and the taco truck tacos. Wouldn't hav","useful":0,"cool":0},"Prw_-JcuhUnPdtLcFkgeOQ":{"text":"Can I do zero????  Service horrible!  Food - not very good - and when I tell the server th","useful":0,"cool":0},"B4_C_Y6diOiMkz_Rh5I0uQ":{"text":"I've got to dock a star for this place because the parking is utterly atrocious, even by N","useful":0,"cool":0},"hsdBrfKsa5bUu13s0tntAA":{"text":"Overpriced, lame atmosphere, overrated. \n\nThe food isn't horrible but don't come in expect","useful":1,"cool":1},"d8Las-Cfxbh7KcZsXizZPw":{"text":"I've only been there once and just thought it was just okay. I will say our server was sup","useful":0,"cool":0},"nxk2drR3a5EpC9f-ie-KEQ":{"text":"Every time I eat here, I get some sort of gastro-intestinal issue.  Food is usually adequa","useful":0,"cool":0},"XjD1Jogsqp8croUF6zjLWA":{"text":"Bad ass eclectic tacos, not traditional Mexican but delicious! Great margaritas!!! Fun cro","useful":0,"cool":0},"-TdrwL9DrX-wpN2QyBr0bA":{"text":"If you like tex mex this is the place for you.  Best fajitas, salads, and tacos I've ever ","useful":0,"cool":0},"KTEWOaF-Mcto-Z_jSF1U-g":{"text":"I've sadly learned to expect mediocrity from New Orleans' Mexican (or Mexicanish) food sce","useful":0,"cool":0},"vdrZ5w--YkuQh1OcubqtFw":{"text":"Absolutely delicious burritos.  I would recommend Juan's to anyone.  But, if you want \"rea","useful":0,"cool":0},"MnsOEsfz7AfElRqeBDGMog":{"text":"Had the Al Pastor burrito as a suggestion from the waitress as I was torn between items. I","useful":0,"cool":0},"ZpNtdIgP7XtKtTE7UTEJxA":{"text":"Food was ok and service was decent but we had a lot of complications. My mom and I split t","useful":0,"cool":0},"YF8udzGdvr_juTPo2O1eNA":{"text":"I am sure I'm in the minority here, but I just don't love Juan's. I want to love them, but","useful":4,"cool":0},"DyRPHOB7mC8KrquwEPlDbw":{"text":"Ordered goat cheese quesadilla which was AMAZING. The guac is great but the red salsa is w","useful":0,"cool":0},"28F1TGSIjj9SOGsHtsaGaQ":{"text":"It is probably not fair that I rate this restaurant 3 stars because I have not eaten true ","useful":0,"cool":0},"ibvIqgauE53powL8cjghwQ":{"text":"What a unique little gem!   I can say that I wasn't too excited about going to place calle","useful":1,"cool":2},"H0qE_v2DcbtS7b44_TFgvA":{"text":"I'm giving 4-stars solely on the food - which was AMAZING.  Plenty of vegetaria/vegan opti","useful":0,"cool":0},"KiVazKaXMHqbvLMUsVO8JQ":{"text":"I prefer the other location but this one is only for when one is in the city. The environm","useful":0,"cool":0},"LoY-zhe6zZJer4BOGfT6-A":{"text":"Great fresh food at a reasonable price! Looking for casual Mexican this is the place to go","useful":0,"cool":0},"dC1Cm0Bw5Hvl6PdUOPLCIw":{"text":"I have a friend coming back into town after six months.  While we were planning our weeken","useful":1,"cool":1},"4vu6a-sUnVqsq35XDV5NlA":{"text":"This is my go to restaurant. I've enjoyed their unique brand of Mexican cuisine for the la","useful":1,"cool":0},"UwO9_IIHn9g9yUCSNgM-vA":{"text":"Came in on a Tuesday so the $2 tacos had drawn quite a crowd.  Had to wait for about 15 mi","useful":0,"cool":0},"QKQQBPSlWQZeWYDXA6AO8A":{"text":"I'm a big fan of the place.\n\nNot the most authentic place but it's innovative with fusion ","useful":0,"cool":1},"0zYeZULfmvX0YKuuNOlV6A":{"text":"OVerstuffed burritos that is packed with ingredients to make that fresh burriot that you a","useful":0,"cool":0},"JkCMEjtDMCyYyVY17D8X6Q":{"text":"Food is priced right, but  doesnt have a real Mexican feel to it. More like hipster meets ","useful":0,"cool":0},"kmu_cqp_94e-r0sWM2-kNA":{"text":"Casual. Easy. Fun. Bring the whole krewe and settle in for one marg or six. Sport on two t","useful":0,"cool":0},"dftTomn1XZMVhCzgIx6CXg":{"text":"First of all, I have to say that Juans is one of my favorite restaurants in the city.  The","useful":1,"cool":1},"kWd2wQnNA5RfVNZd6-Q3Lw":{"text":"Best burrito I've had in a long time! Super full & flavorful! Great location! I would tota","useful":0,"cool":0},"95fHHNCXFUbfhUKpDma2Yg":{"text":"Everything about this place is perfect.  The punk music playing, the variety of options in","useful":0,"cool":0},"xfDypicg7DrPMMuXOqLwXQ":{"text":"Great food.  The Jerk Burrito is a must.  Place is charming in a way with that obvious Mid","useful":3,"cool":2},"ZwpYzr2CfekcE7B-dBurmw":{"text":"Just had my first experience at the Mid city location a few weeks ago.  Friday night durin","useful":1,"cool":1},"eHpBXUP6yao1hPjN_Hac3Q":{"text":"Literally just waited for over 30 minutes for takeout.  i ordered chips salsa and guac bec","useful":1,"cool":1},"idcHxTzR28Ny6byF1EEqKw":{"text":"Great food at a great price!  Yes, its not 'authentic' mexican, but it is delicious. The s","useful":0,"cool":0},"sQilDls_eXv9ot-i5c3SVQ":{"text":"I personally think Juan's is a little over hyped. I really like their redfish tacos but ha","useful":0,"cool":0},"8foa3P8-f83xDVgI3eWSjA":{"text":"Place was cleaning and friendly. The food was unexpectedly good. I would recommend eating ","useful":0,"cool":0},"UbKmHZtJ_udpmCH_o25vBQ":{"text":"Juan's Flying Burrito: great food, slow service.  \n\nJuan's could be a great restaurant, an","useful":1,"cool":0},"FMlr6NbLj9N4yZ_57ns_GQ":{"text":"I tried the \"Flying Burrito\" here and the girlfriend had the cheese enchiladas.  I only to","useful":0,"cool":0},"J3mKmqqjBe8lMbFGv2V5zQ":{"text":"My husband and I had a Saturday night dinner here. Out of the three items that we ordered,","useful":1,"cool":0},"-itIzXy69qGcCQmVo4UARw":{"text":"Great service overall!  Staff is friendly and attentive.  Special acknowledgement to Laura","useful":0,"cool":0},"g87fNF633h7hpWe8jRLt3g":{"text":"love juans. i have only ordered the flying burrito the handful of times I've been to juans","useful":0,"cool":0},"KPkFipnyyAGZXM4Sx5CLkg":{"text":"service is pretty bad, but I still give it a 4.\n\nthe food and the prices make up for the e","useful":0,"cool":0},"6vZcdMzvAi9Dn29f8i4ScA":{"text":"Redfish tacos are smokin!\n\nAnd so are the drinks!\n\nCan have a wait during peak hours but i","useful":0,"cool":0},"vRfG3kgcbnzwzOyWl4xMuw":{"text":"I went to Juan's on Monday. It's Thursday and I'm still thinking about it. It's like that ","useful":11,"cool":9},"GWbOJ44YxgCzEE_25YPN0A":{"text":"I luv this place. This spot was mine and my friends hanging place when we wanted a break f","useful":0,"cool":0},"nQWaEwAa4AMpNZQwwaodcw":{"text":"While there was a wait because it was Sunday (all-day happy hour), we still got a table in","useful":0,"cool":0},"i1qXULYbOLeNRcnQ--8ARw":{"text":"Last review was 3/14 and more positive. Went last night for dinner. Food was great. Cucumb","useful":0,"cool":0},"7DHkByAFBRW6YDMm2XwTJQ":{"text":"I wish there was a \"less than one star\" option. I came in for an afternoon drink. It was h","useful":0,"cool":0},"1mAmwHuCQlTWk9j9hRUD4Q":{"text":"Great tacos! wish they were a little wider inside though I could barely get by with all th","useful":0,"cool":0},"PDq5Dgd1d9F5KNZyp7kZ4A":{"text":"First of all can I say happy hour is ALL day Sunday. ALL DAY.  I don't know about you, but","useful":0,"cool":0},"IMlWDKE36Yhrr3t8oGAbKw":{"text":"Why do people like Juan's?  Went to the Mid-City location for the first time.  I didn't th","useful":2,"cool":2},"nN84AZ_4NGr8UlmLFOSDCQ":{"text":"Stopped for dinner on a beautiful New Orleans evening. Waited about 10 minutes for an outs","useful":1,"cool":0},"2pp-avL7kYiBdEjM9G18OQ":{"text":"Great atmosphere, great service, and great food, loved this place. Had the fajitas and que","useful":0,"cool":0},"0SWtNNMzp-n7BpbA8Zessw":{"text":"I like this location better than the one on Magazine.  I don't know if it's because it has","useful":0,"cool":0},"OF4rdgPSycgSNLAMZ5_JLQ":{"text":"I've been to both this location and the uptown location.  Since the uptown one has nearly ","useful":4,"cool":2},"-x9ULMJyw62yU5V9uayjbw":{"text":"Probably the worse food I've had since living in Nola. The nachos were terrible. The marga","useful":0,"cool":0},"6HnX5kLDzUTnQEr1x7BY7g":{"text":"Prefacing this review with an abject truth: I am from California originally. In California","useful":0,"cool":0},"GXLFkESUpQrofmbRT8L-qQ":{"text":"Came back a second time sober to make sure the alcohol wasn't influencing how amazing I th","useful":1,"cool":1},"_fFEUEMd270M1ncNNnT1Eg":{"text":"I went to Juan's last night with a few friends to enjoy a few drinks. Even though the rest","useful":0,"cool":0},"gVcItgnh8dq9C-Cy0J6PwQ":{"text":"Great food in great neighborhood!  Taco salad is huge, yummy, and priced right!  This loca","useful":0,"cool":0},"32e3pAE0SxmYJc2FATq2OA":{"text":"I come here maybe once a month. My best description for this place is funky Mexican Americ","useful":0,"cool":0},"nja2rhWgA43SwnGRgygt6A":{"text":"Great food, great margaritas, hit or miss service. It can get really crowded in the early ","useful":0,"cool":0},"-AGUR5w9m-imIJXRkKGtUQ":{"text":"Perfect. Tacos made with Iron Maiden just taste better. Thank to Russell, my post Mardi gr","useful":0,"cool":0},"REBMiTdPV70OnVljQpxU4A":{"text":"Good tasting food! Although some of our burritos were messed up and it took awhile for the","useful":2,"cool":1},"axGlSLcryx6e83o-ifI57A":{"text":"Great food, decent prices on beer, even better sangria and mixed drinks. They get crowded ","useful":0,"cool":0},"mfN9pOvJqRwegVZrSxqGnA":{"text":"The food here is incredible. It's a good price, and Juan's has been my go-to for nights I ","useful":0,"cool":0},"hnEzHHCxi3KaJmLt3VIhAg":{"text":"Tasty burritos, strong margs, usually a wait. Can't find anything wrong. Keep up the rasty","useful":0,"cool":0},"qRWHNfJ59UhDSj6TOL83zw":{"text":"Lunch, 7/18-  I've been to Juan's 6 or 7 times, mainly at the Magazine location, and was h","useful":2,"cool":1},"6G7J2nE2semi3LZvXd598A":{"text":"One my first visit to Juan's, the place was packed, so I ordered a House Rox margarita, an","useful":3,"cool":2},"vz7j2IBhb-MVFbXU0hXk_w":{"text":"Every time my husband and I visit New Orleans we make it a point to stop here! Can't talk ","useful":0,"cool":0},"F_koTE3lHzl341IzYwcUCg":{"text":"Another awesome place. Really the happy hour got me to write this review. It's so much fun","useful":3,"cool":1},"D5Rl_LuhxOcy_ZCJqt6Dkg":{"text":"A quaint neighborhood eatery. Great for eating in and takeouts. My favorite is either of t","useful":0,"cool":0},"McixMRC_IpaderVT05fHmw":{"text":"Dear Juan:  When are you going to go back to the good chorizo, you know, the edible kind f","useful":0,"cool":0},"JvDNfR0kMNqOxW4dLhbbsw":{"text":"The quality and portions are awesome. We had the Hawaiian 504 nachos, chicken quesadilla, ","useful":0,"cool":0},"AF7RV3PL_0EN4SfgawS1Dg":{"text":"I've been here at least three times. And each time I went with high hopes that I would hav","useful":0,"cool":0},"KtbWMyF03nyTtYYd4e1ybg":{"text":"One of my favorite mexican places so far. I had the jerked nachos, without chicken. The ch","useful":1,"cool":0},"ZI__GidmikJfFRbbHLl-PA":{"text":"I'm from Texas and was pleasantly surprised by Juan's. Granted, I only got vegetarian item","useful":0,"cool":0},"47GM0sPuQUoUcNBInSicHg":{"text":"Food is okay but nothing worth making a special trip. Fun environment. A lot of food for a","useful":0,"cool":0},"2BizOPbJo6aZgxRWxKLEDQ":{"text":"Moved here from San Diego and missed TexMex. Super bummed that they changed their menu and","useful":0,"cool":0},"TJ0d-qMDn1icad25CH0EJg":{"text":"This is not as good as the Magazine St Juan's. No homemade lemonade or strawberry lemonade","useful":0,"cool":0},"4nwRiyccqQicCrSl3EA14w":{"text":"I'll admit, New Orleans isn't exactly an ideal city to find Mexican Food. But want a burri","useful":0,"cool":1},"mYT3IAUpr9jKBMfQcPCXTQ":{"text":"We went there on late Saturday afternoon and wished we had went elsewhere. Place was filth","useful":0,"cool":0},"W--aNVSwfdfvqfQVTsmrMg":{"text":"Headed here twice during a rain storm during our stay in NOLA because it's close to the ho","useful":0,"cool":0},"1-UnXDHwAQ3fwL3Sp4oJSQ":{"text":"First time here.  It was an awesome experience.  Walked in to hear 2 Live Crew's Throw tha","useful":0,"cool":0},"J8XPWvm5AHmUaidOPN70ZQ":{"text":"Went here last night and was disappointed with the jerk chicken burrito. Everything else w","useful":0,"cool":0},"zFWk9u1Q0KxDQY6pWyRUOA":{"text":"Love Juan's! Happy hour is incredible.. decent tequila selection; better than most any bar","useful":0,"cool":0},"tCNgB3akO2Gif9KPFJMlrg":{"text":"My first impression, oh thank GOD there is a parking lot. Second impression, Oh crap its f","useful":4,"cool":3},"EYlDhJzxINiOtEfSSPuUkQ":{"text":"Hands down my favorite Mexican restaurant. This place is always so fun and has amazing foo","useful":1,"cool":1},"uVkEB0m6fSOcX5j6cG4a4Q":{"text":"The food was disappointing . The Tortillas taste like store bought.  The beans where under","useful":1,"cool":0},"etpw9-lrsQizejiH5xHhgw":{"text":"i was pretty impressed with juan's enchiladas verdes. having lived in el paso, tx, and hav","useful":2,"cool":1},"rqNmWzqE4TVnL4tb8PcQ1w":{"text":"Okay this is a cool spot and drinks are good. However please note that the fajita entree i","useful":1,"cool":1},"tWQ57OqQI7Kw4PudNq1bRA":{"text":"Gigantic burritos, fast service and a dozen different margaritas. A word to the wise - thi","useful":0,"cool":0},"ZVxncUQ6kuwLEfI0OplBxQ":{"text":"The flying fajitas are delicious!!! Service was excellent!! Took all of about 10 mins afte","useful":0,"cool":0},"ee3d8WTX3b0zTVCLebuIwA":{"text":"Don't be fooled by the scene. The only thing this place has going for itself is the \"hip a","useful":2,"cool":1},"e5AmgybSTqpWHUJzHrclcA":{"text":"Haven't been to Juan's in a while so I thought I will try it again. I got the enchiladas w","useful":3,"cool":2},"HoXkM57x4WBQPUHCV380Lg":{"text":"My boyfriend and I eat here practically every other week. Their Al Pastor burrito is my fa","useful":1,"cool":1},"YcJKs01UiLkjoz1cI5rHHA":{"text":"Good food / Slow service / high prices / Cramp dining area\n\nCRAZY STINGY WITH THE CHIPS AN","useful":0,"cool":0},"OG70sNkTNOPr4x33Y88Ptg":{"text":"I've been here twice since my friend lives nearby, but my second visit was just awful and ","useful":1,"cool":0},"aHQYtqJ7_L2-nF-zPlIUqA":{"text":"I love this place! All the food i've had here is great, but my favorite is the pork and sl","useful":0,"cool":0},"xkJkiCRh86u3hnfjD7O7zw":{"text":"Used to love tbis place until a little earlier tonight. Before this incident the service h","useful":0,"cool":0},"RMvCvo4nUDy6vqyy0K9AgA":{"text":"From the outside the place looked quite nice, a few tables with people grasping enticing a","useful":0,"cool":0},"1HHDhWrd-bXLAwLfiMsngg":{"text":"Food was good. In fact it was so good that I watched my waitress eat her meal a couple of ","useful":1,"cool":1},"gZPzAD0Z44I_7G0xfsUZWg":{"text":"If you order the burrito that is named after the restaurant you are eating at, you would k","useful":1,"cool":0},"FkdOSlVJh-ih0aUd8ekt9A":{"text":"Was ok when I went during the summer very different with the \"punk\" music and ect. Food to","useful":1,"cool":0},"5SZxz4BNNGZqJNF3lOi2uQ":{"text":"Meh. It's ok. I've had plenty of better, cheaper, more authentic, fresher Mexican food and","useful":1,"cool":2},"UJHEioyfJPPQROZulliQjw":{"text":"Loved the atmosphere. One of the specials was Bayou Nachos with crawfish and chorizo. Amaz","useful":1,"cool":1},"PfGjOtqHrkKorhoC8FGwxA":{"text":"Let me start by saying I am not a food person at all. I generally eat because I have to in","useful":1,"cool":0},"uEaRZjsaQd7eYbt41WMgxQ":{"text":"Great food for a great price. We went during a slow time with no wait. If it had been crow","useful":0,"cool":0},"PnRUYnwrktyYfzhSMvPh8A":{"text":"After moving to New Orleans from Texas, I was hurtin' for a really tasty burrito. I tried ","useful":0,"cool":0},"T8Hk5jXnpSy3u92OoMIp_Q":{"text":"Love this location!   The food is always good and consistent and the service is great.    ","useful":1,"cool":1},"YygRCVKgahZ4Sx2y9JP81g":{"text":"I love Juan's flying burrito. I just had t for dinner and it was amazing! This is on my li","useful":0,"cool":0},"QwqqUQYmWbhUaOXuz49n8g":{"text":"Okay, I will for give this place for not being Tex-Mex.  I had a hard time leaving behind ","useful":1,"cool":1},"Jk5-1MFjNmizDJvWYfDkXQ":{"text":"During Voodoo Experience 2010 we were sick and tired of one slice of pizza costing $7 and ","useful":3,"cool":0},"ktBK6zn3aDkBWiC-pp-8Ow":{"text":"Everything I've tried at Juan's has been amazing. To date, I've only done take out here, m","useful":2,"cool":1},"aLHMwidgkoydbxc--CWoaw":{"text":"We arrived around 2 PM and the place was swamped which seemed like a good sign with the re","useful":0,"cool":0},"Vv71Dte9-LhysPywC3kOdA":{"text":"Laura G. (I think that was our server's name, IIRC) kicks butt! She was so cool and friend","useful":0,"cool":0},"XXqx9xn-jn7TOXotVye9Pg":{"text":"Stopped here for the first time after a long day at French Quarter Festival.  They were qu","useful":0,"cool":0},"7sSE4qErYBh2toUgETfhgA":{"text":"Yummy food, even yummier leftovers! I've never tried anything I didn't like here. The chip","useful":0,"cool":0},"z2qE8Vw7TGveiT8p_ZuZNw":{"text":"dear juan:  tried the verdi crawfish enchiladas last evening for the first time...  the re","useful":1,"cool":0},"y_j3H3Dx5G9yjYJzGQaSLQ":{"text":"Juan's has been on top of their game recently.  They've hired more bartenders, who are exc","useful":0,"cool":0},"E7puDSPWRcxbGRTEQ8sLNA":{"text":"About 2 years ago, while eating lunch here, I ordered an iced tea. While drinking the tea,","useful":0,"cool":0},"Suvy5FcHQdvo6S0q5Zp_qA":{"text":"Great spot for lunch while in the \"Nawlins\" close to the Audubon Park...service was fast a","useful":1,"cool":1},"Y3YVWnUKgP0sJLuQyJ0FVA":{"text":"Very cozy burrito joint off Carrollton. They used to give free refills of queso but I'm un","useful":0,"cool":0},"gXUKlZRplSucVBw3od58HA":{"text":"I LOVE there pork tacos! Great place for tacos and margaritas. My friend told me about thi","useful":0,"cool":0},"i52NdAUGmfsQqXWe_zpgxg":{"text":"We call this bizzaro juan's.  The atmosphere is so very different from the magazine juan's","useful":0,"cool":1},"AidtYGppwFWr-Q6XRI6d7g":{"text":"A bunch of asshole white hipster burnouts 'serving' brown food and thinking the world owes","useful":0,"cool":0},"pEvOkFEvnMkTLH-XaGTJrw":{"text":"First night in New Orleans and the kids wanted Mexican.  Juan's right around the corner.  ","useful":0,"cool":1},"WODWOjbfKJlOZfoy5TYR5w":{"text":"I just can't get enough. I LOVE the supergreen burrito. Also, the shrimp quesadillas are f","useful":0,"cool":0},"6FnNPb1Y9hXWmqs8e7UhcA":{"text":"Overall just kind of crappy food. Maybe I'm a bit of a Mexican food snob coming from Calif","useful":1,"cool":1},"hwct09E8sE_AosTQs_8PPQ":{"text":"Pretty good food. Nothing phenomenal but good and for a very reasonable price . I tried to","useful":1,"cool":0},"3WH-upOu8IDiuYvs3UVnsQ":{"text":"Just order take out and seriously had two stones in my beans. If I could attach the pic I ","useful":2,"cool":0},"yeUtBRX-ryP6Rhhf1zQaJA":{"text":"I love the chorizo queso! But tonight I got scallion soup! Watery queso no chorizo. Waste ","useful":1,"cool":0},"SpALiDs5nBIeVI1tAPdzyg":{"text":"Not quite as snazzy as the Magazine Street shop, but still damn tasty! Granted it isn't au","useful":1,"cool":1},"VBE32vECy_D-b0tf8mQ1aQ":{"text":"We randomly found this restaurant on our GPS when the restaurant we were planning to go to","useful":1,"cool":0},"LyMKWL_4jFi_BAFMIaUWZw":{"text":"I sat is the patio out back with my team from work. I had the Three Veggie Quesadilla- it ","useful":0,"cool":0},"7i3voVDZRuIi3hO6y1sffg":{"text":"We had dinner here tonight and parts were tasty and others were pretty meh. I got a mojito","useful":0,"cool":0},"vMbIlHcUIzmUl97jEdc1cQ":{"text":"Juan's Flying Burrito is by no means authentic Mexican. The food will not conjure images o","useful":1,"cool":1},"JfzMPRqN1qzi2Pjck30IFQ":{"text":"The food is great. The selection of burritos is pretty large and their repertoire of Mexic","useful":5,"cool":5},"Yz1RGuXJx_xFVVcgyq9Fcw":{"text":"I debated on giving Juan's a 3-star or 4-star review because my experiences have varied. I","useful":4,"cool":3},"OAq7U91zBROQ5uTuzDLztA":{"text":"I always have had a good dining experience  when I visit Juan's on Carrolton Ave.  The ser","useful":1,"cool":0},"8XfP9wzCvg_qhJHu-Odbjw":{"text":"My SO and I stopped in for a very late lunch.  She had just picked me up from the airport ","useful":2,"cool":2},"U6NFzMZBSeugo206lWmAaw":{"text":"I would take a bullet for Juan's Flying Burrito.\n\nI've been about a half dozen times in ab","useful":3,"cool":4},"ISF22g2AQpGv989ZwEaV-g":{"text":"I visit Juan's mid-city about three times a week with a typical bill of $25 to $35 per vis","useful":0,"cool":0},"wOrP4g6d3RUCUOftoNgMkg":{"text":"Yummmmmmm!  The amount of food is huge and prices are reasonable.  The interior is funky w","useful":0,"cool":1},"WkQHbCZOFj_-HKMGPydsiA":{"text":"Very gluten free friendly!  LOVE the pork and slaw tacos on corn tortillas (no cheese).  W","useful":0,"cool":0},"W9FwkXEv9U0yOaYCW51uSA":{"text":"Love the funky atmosphere, and the staff are good. Food is great, but needs... Something. ","useful":0,"cool":0},"3KIOVi5fvYFW8jc0Clowtw":{"text":"Love it! Get the pulled pork and spicy slaw tacos! Good food for a good price.","useful":0,"cool":0},"54Dw0mbFmzDrsZG4zEzu4Q":{"text":"Horrible service. My sorority sisters and I visited Juan's on November 17, 2016 and was tr","useful":0,"cool":0},"LsqPrBj6kO90hsgWiTznbA":{"text":"What can I say about Juan's that hasn't already been said....THIS PLACE ROCKS! Happy hour ","useful":0,"cool":0},"DcZ0BjlWeZxmk9sxuC1F5w":{"text":"Small place parking is not great at all .The hostess was very nice and friendly. There is ","useful":3,"cool":3},"e40Ok9j_r839bZ_ADqJY6Q":{"text":"Good drink and service but the fajitas weren't very good .  It had flavorless taco meat.  ","useful":1,"cool":1},"Go3PozOLepUtg3RWouJyOA":{"text":"I enjoyed our burritos and our party of five enjoyed their food as well. The place is upbe","useful":0,"cool":0},"hY6hnBQ3iDyNqYP91LU5Vw":{"text":"The vibe and culture of any restaurant always start with the host/hostess.  I walked in la","useful":0,"cool":0},"Nq7M207HEYfz4a9_wwtHBA":{"text":"If you're looking for authentic Mexican street/hand tacos, you won't find them here.  That","useful":0,"cool":0},"H4NsfL1lLMgPQ-1fb6iN4g":{"text":"Delicious!!  I came for lunch today. This is my second time coming and I had the same thin","useful":2,"cool":2},"VEDPlkv4m10xTDgOM8pkMg":{"text":"Juan's has been on my list for a while now and I finally tried it out. Their service didn'","useful":1,"cool":0},"s9W9zgG5ClwwsuZHZOrFrA":{"text":"Worst service in New Orleans. Mediocre food. Do yourself a favor and avoid this place unle","useful":1,"cool":0},"vNMPnrz-ABDOcz33B-lrqA":{"text":"Got the trio of guac, salsa, and queso. Guac was brown and had a funky taste. Ordered a si","useful":1,"cool":0},"uSNShu4wuXV1Y2e4NisKsw":{"text":"It's good all the time, I love their Taco Tuesday's although they switch the tacos all the","useful":0,"cool":0},"oljCqBScpPBUIVJoMrBkTQ":{"text":"Second visit and no better than the first. Service fine, vibe good but the food taste like","useful":1,"cool":1},"9QZIU_nCMoV7dmgIhLsE5Q":{"text":"Great experience yesterday! Super nice service, delicious food and a fun atmosphere. Yummy","useful":0,"cool":0},"ycYrDIvhERBdFZjGrIrI3w":{"text":"Tacos are the perfect food, and Juan's is the perfect place for eating said perfect foodst","useful":0,"cool":0},"1MMgyiNFUvU_CJLbWH_wNA":{"text":"Today was my first time visiting this establishment. Our server, Stephanie, didn't crack a","useful":2,"cool":0},"pZMwazFVgmp0DgaFqA3HeA":{"text":"I know good Mexican food, and although the service us fine, the food is extremely average.","useful":1,"cool":0},"B6z1bjHiyA2q_n8Fs20v7Q":{"text":"I love Juan's. In fact, I love Juan's so much that I dine at the Magazine Street location ","useful":2,"cool":2},"OgLZCEHYyr3XYkxzs9-FGg":{"text":"Feasting NOLA: UNO Behind the Scenes\n\nIn this feature of Feasting NOLA, I'm enlightening y","useful":0,"cool":0},"SJ0ywTiXKB42KNXvU-seLA":{"text":"They have the worst customer service i have ever seen! They have completely lost my busine","useful":0,"cool":0},"EkVW79JsEu-vQ7rsyuAYiA":{"text":"Outstanding burrito and fast service.\n\nEverything you read is true, this is a unique place","useful":0,"cool":0},"9qYYQrPbV_mIIHWKZ0GTfg":{"text":"So going for Mexican food in New Orleans just seems strange. This was a group pick so tagg","useful":4,"cool":0},"RUy4EyS4EemllzhHp1tY-A":{"text":"Probably the best in NOLA. \n\nWith that being said, it could have been better. The DEATH ME","useful":3,"cool":0},"S34o-WfrV-LPhKvAWgRhvg":{"text":"Went here a few weeks ago for lunch with a friend.  We went around 1pm and I thought the l","useful":0,"cool":0},"it1X2zn4uTqiRK2Eum5Y7A":{"text":"We stopped in to pick up a to go order and had a drink while we were there. We didn't get ","useful":0,"cool":0},"u_SdCBL1hD47am58Lm62cQ":{"text":"I LOVE the food here and I have been here to eat many times. Ive always had good service w","useful":1,"cool":1},"trJ04UF8s1TYJHEv1wTv_Q":{"text":"Pros: Good drinks.  Vast alcohol & beer selection.  Hearty portion sizes (enough for shari","useful":9,"cool":3},"5KzwvGPcL1gqCBkRAzWokA":{"text":"A long-time fan of the location on Magazine St., I was expecting the same funky food and a","useful":2,"cool":1},"5hkxYBxYYfzdpCgy9ICTmg":{"text":"....like one of the best places to grab a burrito and margaritas!!! All the burritos are w","useful":0,"cool":0},"dIbPmofZ9lvlzuQxqKeAxA":{"text":"Meh. \nWorst margaritas ever and I'm not picky. Food was meh and the giant burrito was dry ","useful":0,"cool":0},"9xeCc6KqCq7gcd8N79qyoQ":{"text":"Came to New Orleans, driving around to find a place to eat in Mid City and by god as I wri","useful":1,"cool":0},"chyR3vhT5j7bGHYPo4Lugg":{"text":"Sunday night at 9 I headed back to my house to meet with my exhausted out of town guests. ","useful":2,"cool":0},"z368PKLDEeHdEwr-G9E-tw":{"text":"Juan's is my favorite restaurant in New Orleans!  I live near the Magazine Street one and ","useful":1,"cool":1},"jSAStZ2KoZG9aMGTt0za3A":{"text":"*review based on magazine location*\n\nGood burritos, funky place.  I enjoyed myself and the","useful":0,"cool":0},"kHOVHs5snbCBrEpbVple0w":{"text":"Service was great, portion sizes were huge (kid burrito was only $3.50 and came out lookin","useful":0,"cool":1},"psDy3uQgaXmUWT6fWOWlCA":{"text":"I still do not understand why this place is so popular. One of my friends recommended this","useful":5,"cool":1},"g-jK1w-IOu5-OM74pCxwYQ":{"text":"I go to Juan's pretty often. The food is always great and the bartenders make good drinks.","useful":0,"cool":0},"UzicYNB6mXgkCXCzEDfeYg":{"text":"Very good food, kinda hipster atmosphere. Someone had told me they had fish tacos however ","useful":0,"cool":0},"vZWlIIxFyYnxYs0wYXN9JA":{"text":"I felt like eating Mexican so I quickly hopped over to one of my favorite spots to grab a ","useful":0,"cool":0},"-uIW_fQTJoZMc85nEfQMVQ":{"text":"The quality of food here has really declined in the past few years. The last 3-4x we have ","useful":2,"cool":1},"HBeUWvdOtKwbELr_uJUgww":{"text":"N.o. Native\nFirst whoever the short bald guy who is always behind the bar is a RUDE. A****","useful":1,"cool":0},"kchFKk3ejVuD8P2iyHg-Yg":{"text":"Pretty good burrito - but no better than you can get elsewhere in a FRACTION of the time i","useful":0,"cool":0},"g27IDWCtkAhJh7TRNUh52w":{"text":"I have now eaten at Juan's twice now, and feel I can more accurately review the establishm","useful":0,"cool":1},"DNa5Bn52bsNaR5DDBZrrxg":{"text":"Inconsistent. But mostly ok. Generally rude service on one level or another. Either comple","useful":0,"cool":0},"4qb3XEvBYWQvHE5ZK8LATA":{"text":"Great combination of food along with an atmosphere that fits right in with the rest of New","useful":0,"cool":0},"poiSnBlEU6TsJ84YhzmrEw":{"text":"Came here for a quick bite to eat. Food was very good, came faster than expected. The rest","useful":2,"cool":2},"uMPRsnUvFq5KWt2dkg9hdg":{"text":"One of my favorite places in the city to eat a quick bite. Definitely a take on Tex-mex bu","useful":2,"cool":1},"eLJGIrwyIbmcUzqrESEYkg":{"text":"The girlfriend loves this place. I leave with a guilty conscience.\n\nSure, it's fun, cute, ","useful":2,"cool":0},"lHaXl0JXctTpGxQJh6Iq5Q":{"text":"dear juan:\n\nfirst it was the chorizo...  now, it is the ground beef seasoning you are jack","useful":1,"cool":0},"8UHPgmitI4TYV3di0ZjsvA":{"text":"The menu has a lot of dietary options and some interesting takes on Tex-Mex classics. Thei","useful":0,"cool":0},"9o8b9xcfgNtvzMIYL-0pEA":{"text":"Sometimes I think Yelp eats my reviews to keep me humble.. Because I don't really think it","useful":5,"cool":3},"cbPo1v0xkCA5ek22SsAijQ":{"text":"Although the parking is VERY limited, it's a cute and also favored Mexican joint in the Mi","useful":1,"cool":1},"6c9dtIOfpGdkJA5Kpiqh_Q":{"text":"Food/margaritas/etc was great.\n\nBUT, the waitress pocketed more than her tip. Some of our ","useful":0,"cool":0},"PqiXOa5lzZr6BEvrn1tYvg":{"text":"Very good food. I go here from time to time and I have never been disappointed. My favorit","useful":0,"cool":0},"RwZt_XqJ_xajAv8Y4ABaAg":{"text":"I've been to this one more than the Magazine location due to its close proximity to my for","useful":0,"cool":0},"FzAIiRCB41oa1eWGT9wuoQ":{"text":"I have been to Juan's on Magazine many times. Recently a group of friends and I decided to","useful":6,"cool":2},"ltHq5vYb9yN1emgRg-Y-uA":{"text":"Wish I could review the food, but never got to try it. Terrible service. Waited 15 minutes","useful":3,"cool":0},"um5SOyFwtjw1R6nI0frvhw":{"text":"As always, Juan's never disappoints! All of the employees are friendly, outgoing and court","useful":0,"cool":0},"9F7XECdda6rCHE3ziyhvJw":{"text":"Descent food with some interesting twists on standard tex mex fare.  Fish Tacos and just a","useful":0,"cool":0},"4xb-WAdBvK-DpvkImLihZg":{"text":"I got 99 problems but a burrito ain't one.\n\nWe decided to pay this cool place a visit on S","useful":4,"cool":4},"hwDQMDGwK9HVXA7zKa5Mgg":{"text":"This was one of my favorite places to eat in NOLA before we moved. \n\nI love so many things","useful":0,"cool":0},"13pkX6nsRhY6EzwSmOz0SA":{"text":"I am possibly addicted to Juans! There are not words for the deliciousness of this place..","useful":1,"cool":0},"vkgg-G-u_m4xfSjuXM5b8A":{"text":"Excellent street tacos. Meagan is a personable, pretty and fun hostess. She made for a won","useful":0,"cool":0},"MGd6cne5s6CJizo0GUmaNw":{"text":"This is kind of a must-go when i go to NOLA. Parking is a mess, but you can find a place w","useful":0,"cool":1},"1D1U9jic-IK2EkxkfqvYSw":{"text":"My husband and I eat here at least once a week.  I absolutely love Juan's food and margs! ","useful":1,"cool":0},"NRs0N3Rs0WHM2ji2XE_Qpg":{"text":"I love this place!  It's not your typical Mexican restaurant!  Everything on the menu is G","useful":1,"cool":1},"uyAgtEzeUheRJlBomNmNGg":{"text":"Why does yelp keep asking about laceration rooms? Play area and room for the stroller? Noo","useful":1,"cool":0},"IDZoACwxDgBc7P-IsP80pg":{"text":"Fast service and a solid burrito, but nothing special.","useful":0,"cool":0},"zArDJ9-3WfJk_5bulGjsWQ":{"text":"This is a good Mexican restaurant.  The parking is great.  The service is spotty.  I like ","useful":0,"cool":0},"r54kNpke5XG0zFuH3O8q5w":{"text":"The staff has become TERRIBLE at seating parties and doing host duties. We waited 30 minut","useful":5,"cool":1},"O9iinbwQDBlShLZJdjY1rg":{"text":"Wasn't as good as I had heard..cheap meal but I've had better Mexican in my home city.","useful":0,"cool":0},"TNuOIgK2FmMV0OJB_WyCcQ":{"text":"Juans Flying Burrito deserves more than 3.5 stars yelpers!  They cook to order, it was so ","useful":0,"cool":0},"ieMxUJ0do1Un2tTWMaxxXQ":{"text":"How this place has only 3.5 stars I will never know. It is so, so flavorful and delicious!","useful":0,"cool":0},"8aOXyuDRkiLed76xbSo4hA":{"text":"First time I came here, I would have given it three stars. The super green burrito was sub","useful":0,"cool":0},"HLF4hnc1vG9rQSaqiZydrQ":{"text":"Excellent service and great food! We have been ordering from here for years and it's alway","useful":0,"cool":0},"Avbi4_Rb8Rqiy9MjQrXajw":{"text":"The tacos are better than some other tacos I've had in the city, but I can take them or le","useful":1,"cool":0},"hcpiNkFg4ppwPFxWx3KasA":{"text":"I used to go the original Juan's on Magazine Street years ago when it first opened and lov","useful":0,"cool":0},"Nit3rxL_O-ZEIn8k25gRtQ":{"text":"Came here after hanging out with some friends. Good food as always, I am not a pure put ev","useful":0,"cool":0},"P1qB883wrYam-Pl3grv8Ng":{"text":"The Flying burrito with chicken and pork was decent. Flavor was a little bland, too many b","useful":0,"cool":0},"Rv6I6Eax14jInwJtZ1zGXQ":{"text":"Well, Juan's.... That was your final chance and you completely blew it....\n\nWhere to begin","useful":2,"cool":0},"bkpKbjc1aHHLLREQFPjX4Q":{"text":"After a rather disappointing morning, we decided to get some guaranteed satisfaction at Ju","useful":6,"cool":3},"v-s_9hmf-tvQcNchFx684A":{"text":"Just came into your establishment, hostess acted like she wanted to be anywhere but there ","useful":2,"cool":0},"qRr6jqk1rL0yIfH_GQL38w":{"text":"I am a huge fan of the Magazine St location so we decided to give the mid city one a try. ","useful":2,"cool":0},"Y5lSxL5Ey0PcLZqwa2Go-g":{"text":"I've been going to Juan's for years, and they are always always packed! If you are looking","useful":1,"cool":0},"0G8ZUysESJo4U2dimCZXsQ":{"text":"One of my favorite restaurant in New Orleans... My God the food is so good and you Can't e","useful":15,"cool":15},"VI0Bv6qC1ZM5GXlWr9zkgA":{"text":"I am a huge fan of the Magazine St location so we decided to give the mid city one a try. ","useful":2,"cool":2},"Se03djAi9Btt2q0T1wdntg":{"text":"Great food! I had the Flying enchiladas and my wife have the fajitas. The portions are rea","useful":0,"cool":0},"BWeolmOImBlimS4SRNbhFg":{"text":"The 20 minute wait was well worth it. A cool vibe with a mixed crowd. It's kiddie friendly","useful":0,"cool":0},"zMFRcpkeG2f1fihVsPpxGQ":{"text":"Mmm first time was delicious! We went to the Carrollton location. It's a small place but b","useful":0,"cool":0},"eL8KHfgH6Z2a2S3240ZfwA":{"text":"Totally disappointed. Ordered 3 coworkers lunch for pick-up, 2 out of 3 orders were not pa","useful":1,"cool":0},"75Zku5VgKe3x2hWtEFlPzQ":{"text":"This was a great spot! I met up with a friend here who had already been waiting for me to ","useful":0,"cool":0},"Qxdk09L4XaPtjixOlPAaDA":{"text":"I don't know where else you can get a meal for two for $20, but this is my selection! My f","useful":1,"cool":0},"T1mlXk4ulwbae79WrMcMCw":{"text":"The food here is ALWAYS good! I live only 5 blocks from the one on Carrollton and also rec","useful":2,"cool":1},"LE-83BB7_j8n4Xb3KdQ-sQ":{"text":"Well I finally tried Juan's today after seeing a recent raving review. I hate to say I was","useful":1,"cool":1},"ceiDCygkwOaoaDgaW4tCYQ":{"text":"I love Mexican food. One of my favorite places to eat Mexican food is Juan's Flying Burrit","useful":2,"cool":2},"Dz3kh015h_fYgxzWrgigJQ":{"text":"Amazing service. I would recommend reserving a table because they do get busy and we had a","useful":0,"cool":0},"kIYD8sr4x7wfX16oXTD7pw":{"text":"Pretty awful experience. The staff could have cared less that the food they were serving w","useful":1,"cool":0},"kvaQD6oC0MHdaSCov1nYLg":{"text":"Great atmosphere, worth the wait. \nI been here twice and got the same thing both times shr","useful":0,"cool":0},"4zF29sYYp9l1-qLHEk5zTg":{"text":"I cannot recommend this place in good conscience. Someone seems to have decided that using","useful":1,"cool":0},"ymp_vTkNDvhBMi1wUWGmeA":{"text":"We stopped in last Saturday after the Jai Bhakti yoga festival. As usual the place was pac","useful":0,"cool":0},"Epd4zJ3hmJXxg1IYrfDqOQ":{"text":"As someone from California who loves good/authentic Mexican food, I was extremely dissatis","useful":1,"cool":0},"kuqCajHsOu19SUKJywy3kw":{"text":"Ordered chips with salsa,guacamole and queso dips.In addition ordered gutter punk and beef","useful":0,"cool":0},"2VW1nO08J_9kQLOy4M19Xg":{"text":"A cute little Mexican restaurant with plenty of options! The menu has a variety of differe","useful":1,"cool":1},"CStt7qYVjimhhzbUZQAdKQ":{"text":"My favorite mexican food in the area. Margaritas are great. Really good vegetarian options","useful":0,"cool":0},"av_yIXzBIt2aXl3wDkqCuw":{"text":"How do you give zero stars???? Literally such poor experience that I started a yelp accoun","useful":0,"cool":0},"85bUugAe0zWlf6Syj9vjWw":{"text":"Fantastic authentic Mexican fare. Great staff that has been there forever, virtually no tu","useful":1,"cool":1},"UJiDcCZX2ucO2ZOuDqfZ3g":{"text":"The food here is always good.  I ordered the Bacon Azul Quesadilla.  Super tasty and savor","useful":0,"cool":0},"M1Kh35uJ82Dn6Hf3cyuq9Q":{"text":"I really like this place! The only downside is that oftentimes there's a wait. However, th","useful":0,"cool":0},"puYVSmWSsyj2y-z1s8lmGQ":{"text":"BP (Before Pandemic) I had eaten at all Juan's Flying Burrito locations on multiple occasi","useful":0,"cool":0},"nlWCN-uTNvGWV6qESQ07fQ":{"text":"Juan's is still one of my favorite places to get a satisfying, reasonably priced tummy-ful","useful":3,"cool":3},"ZmEu8PjLWMS2SeN2lNU9Cw":{"text":"I normally would never ever write such a poor review unless warranted. I have been in the ","useful":3,"cool":1},"0GNzifn9FrBh8-hr5kiPKw":{"text":"this is NOT Mexican food!!!!!!!!  I should have known better when I walked in and saw a st","useful":0,"cool":0},"48Dk20B0qP4emLNVy9Axhw":{"text":"THIS JUAN'S FEELS LIKE A BINGO HALL\nand not the kind of space to inspire the 3-8 person qu","useful":5,"cool":5},"JUJqEYfLl6F-xJ5mRVtkHQ":{"text":"I tried after a while , last time I guess I made s bad  choose here and I got fajita , it ","useful":0,"cool":2},"mxcxbbIZsdYr1F7AbSrZ_A":{"text":"Typically, I order here at least once a week. Last time my order was missing a side of chi","useful":1,"cool":0},"cOHtTyBibPiGhkYnfV8L7Q":{"text":"So I ordered the Big Bowl as my meal. It was huge! The bowl consisted of steak, potatoes, ","useful":4,"cool":4},"dxZ7o3hCGTMrc5UWY5nuYw":{"text":"I will only ever give this place 5 stars. It is my go to Cali Tex Mex spot. BUT today when","useful":0,"cool":0},"D_hf6L3kbv8fdolR5Ehdmw":{"text":"Started off a bit shaky with service, but ended up being a solid visit! No silverware, too","useful":0,"cool":0},"ylFWuAX-Cj-4t6tUFhFLgQ":{"text":"Delicious food with lots of innovative twists on standard Mexican dishes. Worth the wait s","useful":0,"cool":0},"-6Mo_MnStLFGTJlR_qTlNQ":{"text":"I have been to juans a few times and each time has been mediocre. I do enjoy their happy h","useful":3,"cool":2},"0MQ8jp81dbdsWvpin_ovWg":{"text":"Easily my favorite Mexican restaurant in town. Low-key, quick and always delicious. Only c","useful":1,"cool":0},"asREe6dhQHElrkm3iSEL3Q":{"text":"Great veggie tacos - put chicken in my veggie burrito = hit or miss but I'll give it anoth","useful":1,"cool":0},"toEGwOiXbBxQ1ixDUtTYDg":{"text":"Didn't meet expectations. Called the manager. Rocky said that he would refund the cost of ","useful":0,"cool":0},"SvhAHbGCt4cTaSFcMYVSgw":{"text":"This spot has a cozy, but funky vibe. I love the chalkboards!  We are always pleased with ","useful":0,"cool":0},"Lg1LnRrFxthknaQ9SC7pGQ":{"text":"Come on, Juan's rocks. \n\nThe prices are super affordable.\n\nI love the green enchilada. I o","useful":0,"cool":1},"ZsDQlZbn4Mu7JlPURf9aIw":{"text":"I can't believe I have never written a review for Juans.  It's one of those places everyon","useful":7,"cool":3},"TIGk0vHCUmzziY8e3KHnJw":{"text":"Discriminatory practices. Ignored me for 45 minutes as I sat outside waiting for a server.","useful":0,"cool":0},"kUZQTBfoEMCtDlcBE1PHhA":{"text":"Stopped in this place to get a snack while shopping. Got a spot at the bar and ordered som","useful":0,"cool":1},"8APWEM9XN2MUCjVoBi9NNQ":{"text":"Best staff, best margs, best tacos!  Always busy but never too long of a wait.  Although w","useful":0,"cool":0},"ICgVexdrg3uy0vLGqIk6sA":{"text":"Fast service. Food was good. I ordered Togo to eat dinner at home... I had to re-warm it, ","useful":0,"cool":0},"xLZSZDzDTGYjy8B3V62Gbw":{"text":"Ok food , poor service . Remember your lucky to have customers, customers are not lucky to","useful":0,"cool":0},"YyzMpP4jRkYwNuZCUB4maQ":{"text":"Juan's is my favorite Mexicanish restaurant in the city.  Food is good, service is friendl","useful":2,"cool":0},"a2NtGehk6USOJnW0W-JvfA":{"text":"Used to frequent this location years ago and loved it!!! Buuuuuuut I cannot say the same a","useful":3,"cool":0},"mU3XxWdbN33Va_iYIEEFzA":{"text":"Juan's has a solid menu with above average food and a decent margarita. However, the servi","useful":2,"cool":2},"q2_9X-eoIwPCG5FCc3brjw":{"text":"Moving from San Diego to NOLA, I have a love for authentic Mexican food. And Juan's is def","useful":1,"cool":2},"wOQ6hb-E3S5UBRGJign0yA":{"text":"It really sucks leaving a bad review when the food is REALLY good, but I cant stand a busi","useful":0,"cool":0},"tIFsuDNBHM-sKQOVZWixcA":{"text":"Juan's Flying Burrito is a great place for takeout, especially recently because of the pan","useful":5,"cool":4},"XJXw1Q6VkFCOjs6uj8fjEQ":{"text":"My favorite locally inspired Mexican fare with a Cajun influence. Service is typically qui","useful":0,"cool":0},"OPEy5_-EB9ZlO9JItYKBbg":{"text":"Ok the only saving grace to this family outing that we had was  the managers sincere apolo","useful":0,"cool":0},"LGlnqiF-1oQpVrwbpPAA3g":{"text":"Excellent food in a wide variety.  Vegetarian (or not) friendly.  great prices and great q","useful":0,"cool":0},"BclKsj8h8uY_nUYp0ah2Ig":{"text":"So good! This joint is right next to Whole Foods. Do yourself a favor after grocery shoppi","useful":0,"cool":0},"HL_V_vrTDxp3aJSH0Kv18Q":{"text":"Great place to grab margaritas chips and guacamole. My Dad loves to make his own guac at t","useful":0,"cool":0},"sOOyK4UME0i5CbHY5v3O7g":{"text":"Honestly, home of my favorite burrito in NOLA- the veggie punk. The margaritas are outstan","useful":0,"cool":1},"NiCPmQKDFJd-JiKCSWj6HQ":{"text":"If I could give this place zero stars, I would.  The food was less than subpar, I'm not ev","useful":0,"cool":0},"fKF68OSt504ugqyYUB-sog":{"text":"This local chain is not the most Mexican of Mexican restaurants, but it has some things go","useful":2,"cool":0},"Xb3-4ALnKjYYowp47VN1Tg":{"text":"We live in the neighborhood and love coming to Juan's. However, I wanted to get reservatio","useful":2,"cool":0},"Wrkg6RwVmA61EQziMiJ20Q":{"text":"So I know there are a lot of Juans haters out there (California or Mexico this is not, we ","useful":1,"cool":0},"fvkTMHexRA2GoDUhWsVlLg":{"text":"Ok at best.  We first tried it during covid so options were limited to take out/delivery. ","useful":1,"cool":0},"yq1Sm47hEpvp-mnoJ5V9mg":{"text":"Okay, so today I decided to try out this place in hopes of getting a flavorful, blackened ","useful":34,"cool":29},"_CPchNt39ayn8ts51nS5xQ":{"text":"I have been going to Juan's since it came into mid city before Katrina. I love it and am r","useful":0,"cool":0},"nPsKbyZ5K_up2T6hJRtE8g":{"text":"The menu itself is great with multiple vegetarian options. That said, multiple times I've ","useful":0,"cool":0},"tf2LIvC8JmaptPCqrn5CjA":{"text":"I remember Juan's being one of the first \"local\" places I ate in NO. Being from the bayou ","useful":3,"cool":3},"xPRo6gMN2PVKUkSViGd_4w":{"text":"I absolutely LOVE the fish tacos with mango and roasted corn salsa!!  Juan's has great foo","useful":1,"cool":0},"oogvPmoF6QjiyA12KebGdw":{"text":"Been meaning to check this place out. Went to the one on Magazine Street and loved it. Thi","useful":0,"cool":0},"WkqkJZsopXEJ3iSczvRcIg":{"text":"Juan's has several locations and always busy for lunch. I don't come to this one frequentl","useful":2,"cool":1},"zc-ON9Ror5tsH2xsDr4L_g":{"text":"We came here for a quick lunch and split the tres frijoles nachos--lots of beans, great me","useful":0,"cool":0},"GY14HpNpGdCTQuydpWPSMA":{"text":"I've come here several times and the majority of the time I am underwhelmed by the food an","useful":4,"cool":0},"SNWYQm7rVpa2JBc_1xU_rQ":{"text":"The 2-Star is strictky for my bartender/server \"Izzy\"!  I decided on the quesadilla vs. th","useful":0,"cool":0},"Q_5ZiDcXg5AQSYNnku8thQ":{"text":"Walked in mid week for lunch. Got the last table for two. It was packed. Very cute and nic","useful":3,"cool":2},"1VYC3Hwc3pvbuESIay88Eg":{"text":"Good service per usual! Great food. Servers here are attentive and punctual. The food is a","useful":2,"cool":0},"2vc5UcYg_LkOuUeYO60yEg":{"text":"Absolute rip off. Can't believe I got fussed at for asking for my $16 margarita to be full","useful":0,"cool":0},"NhsYQmHpq8CzF03M5M5VEg":{"text":"We had chips and queso, margs and I had a burrito the gf had a beef quesadilla! The burrit","useful":0,"cool":0},"pQuEGWko2BvEjv0QPPxndw":{"text":"Juans is delicious and a perfect place for a bite to eat! They have multiple locations aro","useful":0,"cool":0},"aPLMMBeh-ciSwCyS05jqlg":{"text":"My boyfriend brought me a take-out order from Juan's Flying Burrito.\n\nI really loved that ","useful":2,"cool":2},"xaZaWSzv8C_bDYVAzEqrpA":{"text":"$13.95 for skirt steak fajitas, maybe at best 2 ounces of steak.hard to find on the plate ","useful":0,"cool":0},"_Tx1N2LbRr2-RjfwCbBumA":{"text":"The atmosphere is contemporary art deco mixed with a traditionally furnished rest and bar.","useful":0,"cool":0},"uB1V9quoGP_cFROqOY3_sg":{"text":"Eaten here numerous times and loved it. Have taken many guests there. Tonight the shrimp m","useful":0,"cool":0},"GkcH2Xtn0w86zVO2f2bRSg":{"text":"Over the past five years as a NOLA-local, Juan's has consistently been one of our favorite","useful":4,"cool":2},"Nj3crNhDTUpuZ3mp4wWgCA":{"text":"Juan's used to be my favorite place to get nachos. Tres frijoles have my heart. But I stop","useful":0,"cool":0},"kWFh5aT8PSNyygiWKiisaw":{"text":"I love the menu options here. I've searched far and wide for something like the flying bur","useful":1,"cool":1},"GuKnBROMvDmjtN613I8_Dw":{"text":"For those of you who have missed the bahn mi tacos during Covid...  BREAKING NEWS!  It's b","useful":12,"cool":15},"lrAiAMZOnkxWCsLXSuREuw":{"text":"Yikes. It's always a risk going to a Tex-Mex place when the restaurant is neither in Texas","useful":0,"cool":0},"yrjuc7yNVbWtrGBSpgixDQ":{"text":"Juan's Flying Burrito is 2 parts delicious food, 1 part strong tangy house rox salt margs,","useful":3,"cool":3},"NqGS5GxQctIW-KHVsj0TMw":{"text":"I'll start by saying that this was my second visit here and the first was delicious. Howev","useful":0,"cool":0},"a8lervtvmqDSYcXVmMFAjQ":{"text":"Great food at reasonable prices.  The shrimp tacos are the bomb with the pepper jelly.  Al","useful":0,"cool":0},"BIRtKzrm71lS2yIFLtEQlQ":{"text":"We've been in Mid City for over two years and finally made an effort to try Juan's. It is ","useful":1,"cool":1},"gXOdv3kaJMcyT9vcS1SFWA":{"text":"I love this place. \n\nAlways a go to for happy hour. Margaritas are 2 for 1 and very delici","useful":2,"cool":1},"VCytGO3jd3alT5AHZP9fUw":{"text":"I've been to Juan's 7 or 8 times and it has always been consistently good. I love the raw ","useful":4,"cool":1},"2oeukE-KLZhdLoZ58BxF-Q":{"text":"I was pleasantly surprised by the deliciousness! I am from California so the bar for great","useful":0,"cool":0},"EiVMeXiahzGXkwKY_zuv4Q":{"text":"Juan's Midcity is constantly pretty good with a great location. It's so fun to eat at the ","useful":0,"cool":0},"-GyrSZnBdVyils57cJ4rgQ":{"text":"Less than mediocre Mexican food. Ordered Togo and took about 20 mins. There were not any u","useful":1,"cool":0},"N7jR92zgH4tVBGWCar98_w":{"text":"Super cool payed back atmosphere! Kinda of the Mexican version of a pub. Small quaint plac","useful":1,"cool":0}}