{"xjcdvbwfIv114eLVFGEpRw":{"text":"Incredible! Loved the breakfast and loved the atmosphere.\n\nThe carrot yogurt was absolutel","useful":2,"cool":2},"8xqK_YjN59ZNymLiirLKkg":{"text":"Do you like eating food? If so, you're going to love this place! It's super delicious! \n\n¿","useful":0,"cool":0},"8osfhml65Le_SM0tL9j1hw":{"text":"We woke up and got \"awesome\" and headed on down to the Turkey and the Wolf team's new join","useful":0,"cool":0},"B6y3QGFE5QPUZf5zqgUIRg":{"text":"This is our new favorite breakfast spot in town!  The menu is unique and diverse but still","useful":0,"cool":0},"TfV9Xq0HIwlkydFcZvPL2A":{"text":"Molly's is good. Got a sweet potate burrito this morning. Only thing I wasn't a fan of was","useful":0,"cool":0},"18NkIEueiT5uy1CjbceMJg":{"text":"Probably the most I've ever spent on Breakfast in a neighborhood \"joint.\"  Honestly, it wa","useful":2,"cool":0},"nkiwancTehLz9C8YDGcb2A":{"text":"THIS SHIT IS THE JAM!!!! (See what I did there) everything is fantastic, staff is awesome,","useful":0,"cool":0},"qgqh328zHlk9OsE2S3lj4A":{"text":"the food is great!!! I got the grand slam McMuffin and my boyfriend got the collard greens","useful":0,"cool":0},"ZtbWNFtNWHMKvaGz1iY_9w":{"text":"Tested out this new place this morning (10ish am). Line wasn't to bad. Plenty of seating o","useful":0,"cool":0},"05R8raDJsnmNXhjt26pvFQ":{"text":"Y'all. THIS PLACE!!!!! I don't know how or why but it was the best place we stumbled into ","useful":0,"cool":0},"KlRlc6eMAIQlSW73L1DTFQ":{"text":"Solid food - don't sleep on the grits! - and glad to have them in the neighborhood. The pr","useful":0,"cool":0},"mYApGoAZ30QNriK3HdS-vg":{"text":"I have a weird obsession with this place. I've been three times, two of them being consecu","useful":0,"cool":0},"RFxclfK1Rv05hcNCHC7png":{"text":"Stayed in this neighborhood for a long weekend and discovered Molly's the first morning. W","useful":0,"cool":0},"ItJhuvHSlDO7m6QczOtSgQ":{"text":"My gf and I live in the Irish Channel, and have been big fans of Turkey and the Wolf for a","useful":0,"cool":0},"2GMTIyMsCCNEmZzrjXU-QA":{"text":"Food was fantastic! Service was fast and friendly! I loved the sweet potato burrito and th","useful":0,"cool":0},"T5J13LCV7t5cKiKPad23oA":{"text":"Must - go - NOW!\n\nIf you're a fan of Turkey and the Wolf, you'll def love this place too! ","useful":5,"cool":3},"a3Jr-_vIovzQhvZ2448OXg":{"text":"Oh look I went to the new hotness over the holiday and treated myself to a ridiculously la","useful":4,"cool":4},"wAYYGr3cQa3B_sggQ9kkQg":{"text":"Expensive. We had a coffee, side of grits, hot tea, oj (small) and a biscuit--so 3 drinks,","useful":0,"cool":0},"p3toTLzjCj_9RvcuRHLeNg":{"text":"Owned by the same people as Turkey and the Wolf, but isn't overhyped. Delicious breakfast ","useful":0,"cool":0},"d-MqoBjw2IOyT0zKJ-eedg":{"text":"Hit-or-miss.\n\nHITS:\nWhirled peas on toast (yes. Get this! Surprisingly filling and actuall","useful":1,"cool":2},"jYC9NFLY6buJ9LqBihdS_w":{"text":"SCAM-\nThe one thing you would think they have in a sweet potato burrito is sweet potato. Y","useful":2,"cool":0},"QHk-bCit6Bzx7hJuWNT95A":{"text":"Best breakfast food. We're from Boston and we were looking for a good breakfast spot that'","useful":0,"cool":0},"SlQCkUtuJlC3hjxrQmYsGQ":{"text":"Lovely surprise! I've lived walking distance to this place for three months and just had a","useful":2,"cool":2},"QC4Bb40bxp2dUcpIabcsFw":{"text":"Loved it. Little things that mattered to me as to why I scored it five stars. You walk in ","useful":0,"cool":0},"pkfn9Waz8bVvfmdO7OhCFQ":{"text":"I've been visiting NOLA for many years now and eatten many good breakfasts. I have to say ","useful":0,"cool":0},"LoDE5-NFhFamVu4x6yASiw":{"text":"We came here for breakfast and I loved all the nostalgia I felt looking around! My group e","useful":0,"cool":0},"iqOoaN-Ix3pEwfnpZ4K83A":{"text":"Good place for breakfast but some dishes are a miss. The best was definitely the greens an","useful":0,"cool":0},"6-vcc8gcxt-FGozKLQFqkA":{"text":"Tiny Food For Tiny People. The food is really good, but the portions are Very Small, you w","useful":1,"cool":0},"IuayMFI18th9RC8RcQcvzA":{"text":"I would give it 5 stars--the grits, eggs, greens, peanut salad with salsa was one of the b","useful":0,"cool":0},"c3KBJM-wuj6Ft3dWrLgXhg":{"text":"This place is worth the trek, and the money--which isn't much. Amazing food and light-hear","useful":0,"cool":0},"MSlDpct9-TgsSDSyw_pw6w":{"text":"This place is a fantastic new addition to Magazine street! They have a pretty decent menu ","useful":0,"cool":0},"Uus-D3HSfI9QcZg5vpsThA":{"text":"This is one of my favorite on the go spots for breakfast. I only eat seafood and the major","useful":0,"cool":0},"rsWhgXeh0DUHb_ttNV2lww":{"text":"Never disappoints. I've really enjoyed everything I've tried here, and it seems to get bet","useful":0,"cool":0},"7MnQw0y0z-NLdO6jrd2gag":{"text":"I'm sorry guys, I know I'm in the minority here, but this just wasn't a great fit for me -","useful":0,"cool":0},"VzSIJBmsYsFNNYuwckF__w":{"text":"Molly's has such unique flavor combinations. When I went, I ordered Scotty's Collard Green","useful":1,"cool":0},"C6KelCJWqPpyuj1ixDTkNQ":{"text":"Most delicious biscuits I've ever had! Can't wait to come back and try all the things on t","useful":1,"cool":1},"kJ5TnsmzkrljCh2nnTwd6A":{"text":"Love the look and feel of this place. The McMuffin and Tostada were delicious, but the sma","useful":0,"cool":0},"h_wIEZvqUWZDfq_AK431HQ":{"text":"Not bad, not great. I little bit on the \"trying to hard to be hip\" side. I come down to vi","useful":2,"cool":0},"SLacIek9lb7tfXktFLQXbA":{"text":"We visited Molly's café this morning looking for some grits and some breakfast. They have ","useful":0,"cool":0},"vaejZ6vwzKNYiZ9T8pAZmQ":{"text":"First off - The greens & grits dish was out of this world so good. Fun atmosphere. We like","useful":1,"cool":0},"vCU1NEkSSjIdz2PxaYkzlw":{"text":"You would think there is a ceiling on how good a sausage breakfast sandwich on an English ","useful":0,"cool":1},"hWBwSS34j33yfucPhRdtSQ":{"text":"Great food. Small cups. I really loved my meal at Molly's this morning, however, all the d","useful":0,"cool":1},"IgWqHh2BI8UuWU3lMSjH0A":{"text":"Bacon was on point. Very good. Cooked perfectly. Grits were good. Like real grits. The gre","useful":0,"cool":0},"Wt0j8Ow-8RFJT5Y1zw1OGw":{"text":"As many times as I've been to NO, haven't needed to have breakfast in quite a while. We ca","useful":1,"cool":0},"tbIt3ctLs5fwyr13-OQOtw":{"text":"This was my first visit to Molly's and i was pleasantly surprised. The concept is definite","useful":0,"cool":0},"soslaJVf44PSqDSZXMvYnA":{"text":"As I'm sure most people can relate, we stumbled across Molly's on a hungover Lundi Gras mo","useful":4,"cool":0},"fSpKJcjCweK5BJLrWUocng":{"text":"Never in a million years did I think that this would be my thing.\nFirst off: the Lunch Box","useful":0,"cool":0},"SeTWJPPuB6NwPogrm5yyzQ":{"text":"This place was a great surprise. We tried to go to a place first that had over an hour wai","useful":0,"cool":0},"zoROA2GtmYNVHGkWG03xFQ":{"text":"$35 for a small bowl of gluten-free sompthn' and a \"McMuffin\" with a wimpy burger patty an","useful":4,"cool":1},"fg28mSqgVePlXnE_fv0CsQ":{"text":"My mouth is still watering when I describe to people the things I ate at Molly's, it was t","useful":2,"cool":1},"AHgTflGwAYuUZrtNUNl35Q":{"text":"Honestly, HUGE fan of both Molly's and turkey and the wolf. But staying on subject, Molly'","useful":0,"cool":1},"rnlOv9RDfJ5_h3bPcHuKQA":{"text":"So unique! The food here is like I've never had ANYWHERE. We actually went here after find","useful":0,"cool":0},"nTVg0JRhF-nWn8Isu6FtJg":{"text":"If you'd like a unique breakfast experience come to Molly's. Food is great and novel. Serv","useful":0,"cool":0},"w1dj6v78hunChF94aXuBMg":{"text":"Perfect place to start your day. We liked it. Possibly too cute, if that is possible. We w","useful":0,"cool":0},"Mz4Pn2ipQ9Rd21ITdw1enQ":{"text":"My LOVE of mother restaurant \"Turkey and the Wolf\" drew me to \"Molly's Rise and Shine\" but","useful":2,"cool":0},"h27tnt7Hc5R7CX4OCCeNNA":{"text":"Way, way too salty. Small portions. Overpriced. Gimmicky. It's a cute idea. The service wa","useful":1,"cool":1},"ilzyg4iA4O0rDsBSPnsPfQ":{"text":"Was really excited to try this little diner so close to lovely shops on magazine. Decor wa","useful":0,"cool":0},"rkDO8mhd0KVy5cBGQ2KtJg":{"text":"I had the sweet potato burrito and it was good, but there was too much cream cheese/pickle","useful":0,"cool":0},"YnWY-K6v0sdBY5g62sO6EQ":{"text":"We visited Turkey and the Wolf during our stay  and heard the bartender mention their brea","useful":0,"cool":0},"aNhebbHvxuuUtacjjeti_Q":{"text":"We thoroughly enjoyed it. Cool atmosphere, tasty food, friendly staff. If you're upset of ","useful":1,"cool":0},"fRIXCfwJuHeFNjiTjTKlTQ":{"text":"Waiting in line for breakfast food is, probably, my biggest pet peeve of all time, so I wa","useful":0,"cool":0},"dz2BZCBF3do4rsYkOjguhw":{"text":"We went here I believe the day after we went to Molly's big brother Turkey and the Wolf! S","useful":0,"cool":0},"KKBAQQWK5hahV56lAldVcw":{"text":"It's is corner of Magazine St. with a country charm.  Inside the decor keeps to looking ar","useful":0,"cool":0},"ebXVZ0hnV_NV7D-qO0Iszw":{"text":"What an absolute delight of an establishment. The ambiance is so very welcoming, it feels ","useful":0,"cool":0},"_66z-0Wx-ryChKbGMzMEXw":{"text":"Doesn't even deserve 1 star. Nice service and location but the food is horrible and way to","useful":2,"cool":2},"thgxq2Iu0yV9OcOwiwafEw":{"text":"Delicious food with a lot of flavor. Different food combinations. The decorations were an ","useful":1,"cool":0},"DzMqobB4IJxqb9eMsOE0bw":{"text":"This place is so good and unique.  Went with a big group and we shared a bunch of pastries","useful":0,"cool":0},"GBz8PhW2kUnSHS23oFWJcQ":{"text":"Sigh. I could go on and on. Amazing food, inventive dishes, good prices, great service, co","useful":0,"cool":0},"dPfqIqgesamByQ_r1opR6g":{"text":"Don't believe the hype. Unless you like overpriced, small portions there are many better o","useful":0,"cool":0},"wE0ObBtqm1CL5_zKoLa8Rw":{"text":"This grand slam, no meat, sub scrambled egg (add a big squirt of sriracha) is my literal d","useful":0,"cool":1},"oApYOu0FU3aq9wulaTzowQ":{"text":"I really wanted to love this place, but the prices are just a total rip off. We got a bage","useful":0,"cool":0},"kHp6BVpT8QhZRkoHmpqoMQ":{"text":"I was transported Back to high school today and I loved it baby! \nLuke perry would've love","useful":0,"cool":0},"sN4eb-UuSAfvmHCV-GC8xw":{"text":"We had whirled peas and toast, collards and grits, the special lamb and tomatoes & grand s","useful":0,"cool":0},"Kri9EnJGhuBTjQl7DDxMhg":{"text":"got dragged here with my partner and their sister.. was super excited to try to the bagel ","useful":0,"cool":0},"r1LOEUyaOj09nDGVbDFxyw":{"text":"Not impressed. Over priced. The food was average. Coffee was not good. Go to revelator Pal","useful":1,"cool":0},"XQw9Gu66JtKohgu-rjkGWg":{"text":"I think I found my ALL TIME favorite breakfast place in town.  Talk about hitting it out o","useful":2,"cool":2},"r3paICad0JtrT1dVeYGgpQ":{"text":"Had an amazing experience. The food is creative and flavorful, and the atmosphere sparks j","useful":0,"cool":0},"lQ9CMcZZYCVn8rzfgzHzBg":{"text":"Worst breakfast ever. Every thing was over cooked. Not a healthy thing on the menu. Biscui","useful":3,"cool":0},"XMk4SQd_Cifr_4UefFz29A":{"text":"Such Unique dishes at reasonable prices. Our family was doing the Garden District self gui","useful":0,"cool":0},"qih-uvV0vqr_CzR968TCHQ":{"text":"A real find. \n\nIgnore the folks who think it's overpriced and let them go down the street ","useful":0,"cool":1},"b3twduO7Ketbo8b_Eh2TCw":{"text":"Maybe someone shoulda told the chef not to sleep on restaurant number two. Instead of spen","useful":0,"cool":0},"HETsCCrurbfjWbkW80agLg":{"text":"Delicious food, fast service, and a fresh, fun atmosphere. I popped in on a Saturday at 1 ","useful":1,"cool":0},"DXXMP8_ckYHCAVRnilJfcw":{"text":"Great surface! All vegetarian entrees with sides of meat. The collard greens and grits wer","useful":0,"cool":0},"ax21tOofNJ-b7ef3ot7N6Q":{"text":"Overhyped and overpriced. Food is fine, but value for price is lacking. $51 for counter se","useful":5,"cool":0},"f2KQ7MMHSdZuODYZv2IGVw":{"text":"Absolutely Incredible Food!!! If you want your mind blown before 10am, you have to eat her","useful":0,"cool":0},"FGpwYfJK1dV60sOUKeL-sQ":{"text":"I loved Molly's!\n\nI went a few weeks after it opened so I would have expected it to be a l","useful":10,"cool":7},"_w7NduSAVjNl7VaA1UBzvg":{"text":"Who doesn't love nostalgia? This place needs out for all things 90s and it's reflected in ","useful":2,"cool":2},"RPJkd7rREth_ZAAL23gltw":{"text":"I've passed by this location a ton of times, but finally decided to pop on this morning on","useful":1,"cool":1},"3TJxei-wHK1leU5hq9fD4Q":{"text":"Molly's was the perfect breakfast on our way out of NOLA. Super friendly staff and in a be","useful":0,"cool":0},"_eSy4X1e2dLBqzwvHvgslQ":{"text":"Love this place, truly unique in all ways. The decor is awesome. Like a child's bedroom fr","useful":0,"cool":0},"kueDL86SIqWujOPfugFiQA":{"text":"Deviled Egg Tostadas are you kidding me and the collar green grits and poached eggs. Ate m","useful":0,"cool":0},"uAjNgx4BZxZWj-aJwhlyJg":{"text":"I think I found my ALL TIME favorite breakfast place in town.  Talk about hitting it out o","useful":2,"cool":2},"W7ZHdojik-X_6FbKhtpYDA":{"text":"As the sign out front says, DON'T SLEEP ON THE CARROT YOGURT. We spent 5 days in New Orlea","useful":2,"cool":0},"YTu7DxfmLqMMIZhZt3ALrQ":{"text":"Craft. Refined. Unpretentious. Fun. Worth every penny. Yelp needs me to write more to make","useful":0,"cool":0},"pNvaoioBBzPPGbojoY8CPQ":{"text":"Great breakfast. \nSo. Much. Food. \nBathroom toilet did not flush. \nOmelettes were really g","useful":0,"cool":0},"D1ddLh0laAXAxTog5XQ-SA":{"text":"This is my new favorite brunch place ... Cute, funky 90s decor, AMAZINg food - I had the c","useful":0,"cool":0},"-MFoJrsFs838g7vbhDPyUQ":{"text":"The best scrambled eggs in the city! They also have some of the best toast I've ever had a","useful":0,"cool":0},"GsLuedR3vAJ4l7vuAwqBxw":{"text":"Molly's Rise and Shine was a great place to eat. The restaurant was a throwback to my chil","useful":0,"cool":0},"GOJcRok65TSqc_w4b8qikA":{"text":"Molly has really upped it's game with new offerings. Had breakfast burrito with bacon and ","useful":0,"cool":1},"jDcI8R4woK-3E-pZvPn1Ww":{"text":"This place was so cute and fun! I had read about it before my trip to New Orleans and then","useful":2,"cool":0},"SBvNlhx2HX8B9NMLB6gURw":{"text":"I stopped by and ordered a the spicy chicken biscuit and wow. That might be some of the be","useful":0,"cool":0},"46Fi3NLyqa7-Dc2INn5eVQ":{"text":"Molly's is cool older sibling vibes.\nHip. Fun. Casual cool. \nFood is out of control delici","useful":0,"cool":0},"YPhg4JhcV5H3mpM4oiWNVw":{"text":"Visiting from out of town! I had the burrito with sausage and my partner had the chicken b","useful":0,"cool":0},"NkH2yIhzHxN-LwxooXsP0A":{"text":"Very underwhelming. For being from the same creative team as Turkey and the Wolf (which is","useful":4,"cool":1},"vZvmaqHNX_hJFWAlb2LIXw":{"text":"There is not a bad bite to be found at this restaurant. Their bacon and hash browns are ex","useful":0,"cool":0},"Ho7R5wbSA5GqFG8xga5m9w":{"text":"Hidden gem near the Garden District of NOLA. We stopped here on our way out. The biscuits ","useful":0,"cool":0},"gNiY0tjQU9Txhq7JitlzHQ":{"text":"We went here 3 mornings during our 5 day trip. It was that good!! We had the breakfast bur","useful":0,"cool":0},"bklSvj4tBUP59SS8VRS4Pw":{"text":"So yummy! I got the grand slam McMuffin, without cheese but added scrambled egg, and it wa","useful":0,"cool":1},"4bYuA9qZgOzBSVsNjYq_Sg":{"text":"Yum! They live up to expectations associated with the hype of being related to Turkey & th","useful":1,"cool":2},"BIdax3pKBsoT2fpoF7lUCw":{"text":"This is the kind of place you should regret if you don't end up getting it. Not only are t","useful":0,"cool":0},"PuXfRD2aNNn_UNvfWw1Zkw":{"text":"This collection of mass, when ingested through your oral cavity, will make you want to tak","useful":0,"cool":0},"XVglNxrKeU9_jAHToGpLKA":{"text":"I'm so glad this place is back up and running! I\nWent for the first time the other day and","useful":1,"cool":0},"VyuULfMtXDPbKi6BMMZt6w":{"text":"Absolutely delicious food, unique menu choices, great portion sizes, hospitable staff... l","useful":0,"cool":0},"q63Tqm9WlhSPAzmNCjWJcw":{"text":"Fun place! A well crafted, exceptional breakfast menu., in the Southern Nouveau vein, in a","useful":10,"cool":5},"50rOKbHgrRTdhOVvsgxXiA":{"text":"Hot diggity dog! Loves me some MR&S! Free water, leaf blower/ball dryer in the bathrooms. ","useful":2,"cool":2},"bsi_GvmNlyapyU8ajqgrTQ":{"text":"*please see Felisa D.'s review of this place as everything in it applies to mine*\n\nI will ","useful":3,"cool":3},"-AwzhP4Y6AosQ0cW0jjdQQ":{"text":"We were in town for a short weekend visiting family and popped in for breakfast while aiml","useful":3,"cool":1},"nmD1rQYnoLemXo5AMRSv1g":{"text":"Wow. Check it out. It's a new restaurant and doing it right. It's a new addition to anothe","useful":6,"cool":5},"_Hyb3M4qaBD-2_PiCWyquw":{"text":"Look. I don't even like carrots. Sure, I will eat way funkier foods than carrots and it's ","useful":1,"cool":3},"9K9dGV5s0pjSDeUf1PuQqQ":{"text":"Perfect place to start your day. We liked it. Possibly too cute, if that is possible. We w","useful":1,"cool":0},"I7IAU1-GbAPjGeqChz68rg":{"text":"Thank, YELPERS!!! \nVery cool and unique breakfast find that I never heard of before.. we l","useful":2,"cool":2},"Zj58MdMZnpopz4yHL8nyxA":{"text":"Went with several friends who were all pleased with their dishes. From the biscuits to the","useful":1,"cool":0},"pI295R7XSQlU1tY-pyXKWw":{"text":"I decided to take myself out for a leisurely breakfast after hearing rave reviews of Molly","useful":3,"cool":2},"8FFPQwgs4ByxMmU76laHnw":{"text":"Ok, I've been really out on sandwiches lately. However, when my friends started a breakfas","useful":4,"cool":4},"dB4tHxv2Dq3o_db2UsWW1A":{"text":"Parking: It's on Magazine Street, so your options are Magazine street.  \n\nPastries: The pa","useful":1,"cool":1},"mligidHzmHa0rTGCSxosaw":{"text":"This is the cutest little spot! Lively and colorful decor. Food was great while visiting M","useful":0,"cool":0},"9AvSkfvPM1cBAbtBEloYGw":{"text":"It's legit.  One of the best breakfasts that I have ever enjoyed.  That could be the entir","useful":3,"cool":1},"vp1HQt1EVLL024bdwhhLdg":{"text":"Great customer service, and thick filling pizza. The slices are big and one will fill you ","useful":3,"cool":2},"WidlAVxJNa9CnVhX2OlBtQ":{"text":"We stopped by this spot while exploring the garden district. You have the option to order ","useful":1,"cool":0},"DTXQz1YgIs33wCt6fwe8CQ":{"text":"came here for breakfast one morning and really enjoyed it! they had a breakfast special th","useful":0,"cool":0},"zl3Yz4RhLQf88YHi2gBaMA":{"text":"Hot damn y'all, this place was just as good as I'd hoped! It came with a really high expec","useful":8,"cool":6},"o5tII8NFgOCdHd6hgtkSEQ":{"text":"Picked up a grand slam not once, but twice, this week. Absolutely delicious. Tried the dir","useful":0,"cool":0},"KyQnb8ghdVEcgWuDnMYa3Q":{"text":"I usually don't write reviews but I felt I needed to let the world know how amazing their ","useful":0,"cool":0},"_a553X_ts96C-wfH6i6_9g":{"text":"I finally tried Molly's Rise and Shine and I'm glad I did! I had the McMuffin with collard","useful":4,"cool":3},"akvpuezXDtZdlooH3Z_Lfw":{"text":"You order at the counter, then find a place to sit. The art is fun and the decorations wit","useful":6,"cool":1},"3UQyxktv8TJyi6HxaZqNoQ":{"text":"Super fun space. I love the style and creativity and great quality and execution. I can't ","useful":0,"cool":0},"HZ6SEfvAdt8kvp38F5FK6A":{"text":"I love Turkey and the Wolf so I was excited to try Molly's, their breakfast/lunch diner co","useful":1,"cool":1},"A5odoy396ebR9VdH3bFZLg":{"text":"Molly's is a top-tier breakfast choice. Love the outdoor seating and the cute aesthetic. I","useful":4,"cool":3},"nQYo-H5mY_cMHLHdcXeZ5A":{"text":"After more than a year of drooling over the Instagram posts, I finally made it here. Wheth","useful":0,"cool":0},"I4AzTYwSq51E6T6fieBkVQ":{"text":"Favorite brunch spot in the city. The Collard Greens & Grits dish is INCREDIBLE. Don't sle","useful":0,"cool":0},"-kmnJ7yJ_D85q4tfWgk9WA":{"text":"At first I was a little apprehensive about Molly's. Banana peppers.. on a biscuit sandwich","useful":1,"cool":2},"u57ceOLhmkoUFJf5lz-ICw":{"text":"Great little breakfast place from the owners of Turkey and the Wolf. A Lyft driver mention","useful":7,"cool":8},"dGvsPIHHTaj7DhSrpWgP7w":{"text":"I have been hearing about Molly's for some time but have not had the opportunity to go, un","useful":2,"cool":2},"cDjOod9cBNb5fApFmiBAnw":{"text":"I hate to write bad reviews, but I have to say the chilaquiles were almost inedible.  Basi","useful":0,"cool":0},"Kr1k9RQAJKnaJToAy1KSVQ":{"text":"Hit Molly's Rise and Shine on a Sunday morning at about 10:30AM, and was blown away by the","useful":1,"cool":1},"x8sWHhOM6-rJPyTZ5U2GwQ":{"text":"Fun, quirky environment with a delicious selection of interesting breakfast items and espe","useful":1,"cool":1},"ejA0wHn6tGco0OxWyNY6Wg":{"text":"Don't believe the hype. Unless you like overpriced, small portions there are many better o","useful":2,"cool":0},"l93Q0JaqadnYs4PhrGLDRA":{"text":"Possibly the coolest eatery in the Garden District.  Great service. Beautiful ambiance.  F","useful":2,"cool":2},"I3IQU0mnqbM93LJQem2eaQ":{"text":"Walked up and placed an order. Outdoor dining, shield in place when ordering and all staff","useful":0,"cool":0},"tXjF1LoVopgYCK8RxqqZDQ":{"text":"I would definitely consider Mollys a breakfast place as opposed to brunch or lunch. The st","useful":1,"cool":1},"Rn6mMXoxT6oQWCyQzRMH-Q":{"text":"LOVE a the outdoor ordering menu! Iced chai is delicious - one of the best I've ever had. ","useful":0,"cool":0},"VxC5U_t6kotYReEzHPIN8A":{"text":"I've been itching to get here and finally did while in the area. What a cute and hip retro","useful":4,"cool":2},"J1cXK2UbzAb86Ey2jDbQ0w":{"text":"We love Turkey and the Wolf and been waiting on Molly's to open this week for sometime. \n\n","useful":1,"cool":1},"hFL6EgppOtI_2dYb9eGnTA":{"text":"Molly's Rise & Shine is the rising star of MUST TRY brunch spots in NOLA. The menu is uniq","useful":3,"cool":3},"cvciEn3ahFp-cIa9u2NUYQ":{"text":"For those of you that might not want to read a long, thoughtful review, allow me to sum up","useful":9,"cool":9},"cKEWGmoum75uJ4tlqmmb2g":{"text":"Adorable spot- perfect for the kids since it was such an entertaining and engaging environ","useful":0,"cool":0},"PVm0oBWivzU3Y7lJ6Lw2tA":{"text":"It was my first time going here and I am hooked! I ordered takeout at their window. I got ","useful":0,"cool":1},"5wjROOW-65mqVnHVwUcLoQ":{"text":"Parking: It's on Magazine Street, so your options are Magazine street.  \n\nPastries: The pa","useful":1,"cool":1},"amdNN5DVDIYNzOZlOm1GcQ":{"text":"When planning our trip to New Orleans, I wanted to find some good places to go to breakfas","useful":1,"cool":0},"6B5kzhNQu2x3AOZ5K4TQcw":{"text":"Pizza night at Molly's Rise and Shine! I would call this \"Grandma pizza\" style but I'm not","useful":1,"cool":0}}