{"h_X0NUUTdggOpo_fmMwZSw":{"text":"The chicken was great! I got fries and potato salad as sides. The potato salad was too vin","useful":0,"cool":0},"9ZHpGQrlr5XBh2Mapkp6mA":{"text":"I came and picked up chicken on Friday.  It was still hot fresh and the batter had great f","useful":3,"cool":0},"ywzMEGnPJwJgJjJBuCdDxA":{"text":"After being let down by the closing of my previous favorite place to get fried chicken, I ","useful":1,"cool":0},"Q33d203v2tsQNsyZZX1s7g":{"text":"Very tasty, hot and fresh chicken! The service was also super friendly. There's not a lot ","useful":3,"cool":0},"Kyiphbzv418Wva8GlfdwUw":{"text":"After 6 years of living in the Nola area, I  FINALLY received excellent customer service!!","useful":1,"cool":0},"KWgLkZUi1ABJfgkxm5H9uQ":{"text":"I love a hole in the wall. You don't find many of those in Lakeview. Chap's is a tiny spot","useful":2,"cool":2},"HcvGckOzL2E2JaRu2VWiCQ":{"text":"Hands-down best fried chicken I've had so far in New Orleans/Metairie. It's not a sit down","useful":1,"cool":0},"Fqf5tpCAOYZOYm51oIy7pw":{"text":"Pretty awesome fried chicken. Quiet and casual local place. Slightly cold. The people work","useful":2,"cool":0},"Y1dW4vqjpsjQMhK8ULrltw":{"text":"Having had a lot of very good fried chicken in many places, I was intrigued by this small ","useful":1,"cool":0},"1MJU1U_2PPcG0Y9l_qy-1Q":{"text":"Stopped in for a last minute meal not even realizing that they close in 3 minutes. The sta","useful":0,"cool":0},"byXc3yb4d_3_YMnwfksC9g":{"text":"Did an uber eat for a catfish on French and it was DELICIOUS. Food was hot and prepared fr","useful":0,"cool":0},"cUFE0TKzfR2_llkJatZYjA":{"text":"One of the best fried chicken I've had in New Orleans. Their chicken is made by order and ","useful":3,"cool":0},"Y2--8rOaA9T6CINnOkqAMg":{"text":"So there is nothing that I enjoy more but than to stumble upon a true gem. I passed this l","useful":15,"cool":9},"djm0KBTprblGxk7dzzbl4A":{"text":"One of the best fried chicken place in New Orleans! The seasoning's just on point. Not jus","useful":0,"cool":0},"sIvxfhL2817lpOLBULpQ-Q":{"text":"Outstanding customer service. The fried chicken is the best in Louisiana. Take the time an","useful":0,"cool":0},"3MjSp6ijagl4vAfOokEOEg":{"text":"Best place on Harrison for a quick bite. Grab a drink at the convenience store next door w","useful":0,"cool":0},"SWbQ7JOoMLlVQe0Gw3M21A":{"text":"Went to Chap's today after having a craving for chicken and waffles. Chap's is a perfect h","useful":2,"cool":1},"VQ4qnF5UE1kAn2P5nBVqig":{"text":"It was my first time visiting chaps and I must say hands down this was best homemade fried","useful":1,"cool":0},"GAQEYMQ05y6MDkdbJGs61g":{"text":"This is the real deal! This IS your Grandmas chicken! We ordered 12 pc with potato salad a","useful":2,"cool":1},"r9fe-vmsd2EU3zaBomH-Qg":{"text":"Hands down some of the best fries chicken I've had in my entire life. Do yourself a favor ","useful":0,"cool":0},"4HklQe-5S2lUE218zHNLxQ":{"text":"Came in her with my SO for some fried chicken!  The owner was incredibly sweet and graciou","useful":4,"cool":0},"_xMLTqktZyLcoBSgDd1xsw":{"text":"I decided to try this place a little over a week ago about 3:30 in the afternoon after rea","useful":0,"cool":0},"ycioGbIjVu-wdogLHBnacA":{"text":"On a recent trip to NOLA, we ran across this little hidden gem of a restaurant.  I had thr","useful":6,"cool":2},"FHn8bDGn90dug8TUPCkmJg":{"text":"Great service and country cooking!  Chicken tenders are the real deal!  Mac and cheese so ","useful":0,"cool":0},"ZSIUKiVriKE2LTD-hA7x5g":{"text":"Just as hoped. Chicken cooked to order - and you can request the pieces that you would lik","useful":1,"cool":1},"kMX8HHr20aM2s8zgi_fumQ":{"text":"Woooooooow. This chicken spot is a hole in the wall attached to a convenience store. It ca","useful":1,"cool":0},"1PQv62eQOBpTLd9dgWPbzA":{"text":"Stopped by there earlier today with my boyfriend .1st thing The wonderful lady with the gl","useful":1,"cool":1},"M82xu1eBWQV7EdcOeDVJUQ":{"text":"Best chicken I've ever had. Not greasy and tasted incredibly good! I also had the macaroni","useful":3,"cool":1},"Dfj47-hBlqXUQfeXN__72Q":{"text":"Dopest dope ya ever smoked. Just the way chicken should be, can't wait to try the chicken ","useful":3,"cool":0},"kypgmw2XI6vAxqBdJoFMpw":{"text":"Ordered the Cuban, they said they didn't have it. Waited 25 minutes for the Poboy I ended ","useful":1,"cool":0},"AKrQhy0Kh2PnMRw86Khoaw":{"text":"To my taste, this is the best fast fried chicken in town. The tops. A tad on the salty sid","useful":1,"cool":0},"v515VefUGUllG6ddCYQmFg":{"text":"Had potato salad and 2 pieces of chicken and both of them were truly 10/10. Obsessed with ","useful":1,"cool":0},"ElWMD-ij1GUz3nYRnnNYCw":{"text":"What a hidden treasure!! Someone recommended this place when talking about good fried chic","useful":2,"cool":0},"uDP23frT2vlUuhJvCS2uMQ":{"text":"Great chicken!   Placed a large catering order. It was redy on time hot and fresh. Ms. Mon","useful":1,"cool":0},"esAHlNMt6D12UM9suHS12A":{"text":"If there is better fried chicken in new Orleans I would like to see it. The owner is a ver","useful":1,"cool":0},"azetwLs0lGJvKDBunST2Mw":{"text":"Hot, fresh, and the real deal Holyfield! If you would like to live when the meek inherit t","useful":0,"cool":0},"6T72jM8T3zi5cSH5nxDVlQ":{"text":"Just had the most amazing Fried Chicken.  I was try to decided weather Is go to Willie Mae","useful":1,"cool":0},"uc5J7uoNsQpsckOTJyo0_Q":{"text":"This chicken is really good!   Fresh hot made to order so call ahead as they don't have pi","useful":0,"cool":0},"XfTCFB5rhj-ET2aJ5rHKAA":{"text":"Awesome Fried Chicken and I couldn't stop eating the fries!  It's worth the drive to Lakev","useful":0,"cool":0},"slq0FzvZGC4QoGeC9C09OQ":{"text":"After hearing about this place and seeing a picture of their food I decided it was time to","useful":0,"cool":0},"Vl_9CH842JLPBmYv8OfPGg":{"text":"Damn. Chap's Chicken REALLY blew me away. Best fried chicken in NOLA imho. It's super chea","useful":4,"cool":1},"HuLm-jNyya3Y0tLgHx8XAA":{"text":"Small restaurant, great food.  The lady that took our order was very pleasant.  The price ","useful":1,"cool":0},"nx6kGQ-Jm-T6qgrf0Ck0dg":{"text":"Awesome crispy chicken not overly breaded with good seasoning. The sides are good but was ","useful":0,"cool":0},"OCC22kDEBmEEN6Gtj3QV4w":{"text":"My co-workers & I ordered on Waitr while at work for lunch. I ordered chicken wings with a","useful":1,"cool":2},"r_TNzQVjin6F5Rd42cnI_Q":{"text":"So, this time I went in and was not happy. I ordered my food at 11:40. They told me 10mins","useful":1,"cool":0},"qRMlrPvTzDxI0DZzFJ9I9Q":{"text":"Chicken was not seasoned enough and too expensive. The service was great but not enough to","useful":0,"cool":0},"Z6TK7yBPgHLxRB8P1Glknw":{"text":"I loved the fried chicken at Chap's! \nMy husband and I came in about 30 minutes from closi","useful":0,"cool":2},"74qvFiIsnEFg8hVQ8o1FwA":{"text":"Highly DISAPPOINTED. Went there and ordered six wings  fried hard HOT... WAITED TEN to FIF","useful":3,"cool":0},"xYLuJ5FpIceZ6RddrShohA":{"text":"The fried chicken is delicious. Crispy, non-greasy, and very very tasty. You will not be d","useful":0,"cool":0},"-mN6T-Y93LpxlcKg87-Q2g":{"text":"Wow, I just ordered some chicken here on Friday and it was super delicious. Fried chicken ","useful":9,"cool":8},"4Za0qsHct6-xBYgjBuYIPg":{"text":"People were really nice. Chicken was cooked fresh and hot but over cooked. Very dry on the","useful":1,"cool":0},"vd8SvaN0PQeNyNcx8_95PQ":{"text":"Everything we ordered was awesome I couldn't give them 5 stars due to some phone line issu","useful":0,"cool":0},"9Bi8R2Dz6n3jkPDqzUAHSQ":{"text":"best chicken , always hot and fresh!! homemade like your mama type of taste lol really goo","useful":0,"cool":0},"Oh0BWfgFohLSzJsBLP-y1A":{"text":"Hot , more on the AT YOUR HOUSE FRIED CHICKEN , great size chicken pieces,  friendly staff","useful":0,"cool":0},"Ns3paq_yUMBR28krEBA4jQ":{"text":"Delicious! Extremely friendly people and recommend the eggplant fries as a side with the c","useful":0,"cool":0}}