{"Lnp1KxkTvSJHZSu_b96Njg":{"text":"Amazing hotel!!! Awesome service, clean rooms, clean lobby. Just an amazing place. I think","useful":0,"cool":0},"QjrTpAysQsvYQEGhhKgYow":{"text":"We are having a wonderful time in New Orleans and part of the reason is because of the Bou","useful":1,"cool":0},"uGPFWHsHd4zlsdc0ObLadA":{"text":"This hotel was awesome.  I loved the character of the hotel.  The rooms were nice and clea","useful":1,"cool":0},"-xdvcAjmYpzmpsCH5dfx3Q":{"text":"We were absolutely delighted with the Bourbon Orleans Hotel.  Firstly, it couldn't be any ","useful":0,"cool":0},"wcEh5JEODCgnvLlaiFMoHg":{"text":"Great stat at the Bourbon Orleans. Historic hotel, comfortable bed, cozy room. Jazz bar wa","useful":0,"cool":0},"h4oo9cbiBIVJzFDsSG3_lg":{"text":"Food is phenom. Staff is super friendly. Only my first night here for a wedding but I coul","useful":0,"cool":0},"rlfUmvEpEj2XU1HuDKfsmw":{"text":"Everything about this hotel is great. However, the windows don't have light canceling drap","useful":2,"cool":0},"djjoKZt1-3MeNeyQQcsW6g":{"text":"This is an oasis in a bed of chaos. Todd at the front desk suggested we go to the river ar","useful":0,"cool":0},"KkJDdc3cC_kArwDWsq-JxA":{"text":"Four stars because of the wonderful employees. Room size....-5stars. That tells you how gr","useful":0,"cool":1},"mxHX_f1-8_GAFcNUR8BpZw":{"text":"Stayed two nights for wedding of family frienEverything about this place is nice with the ","useful":0,"cool":0},"Mox-RBGul5CE8rX0VEZNKQ":{"text":"The Bourbon Orleans is absolutely beautiful, and the price doesn't break the budget too ba","useful":1,"cool":1},"UTnTvW3j_nN6bD7Nzks_LA":{"text":"If you plan on staying here, make sure to double check your bill. Make sure correct proces","useful":1,"cool":0},"eVY4CZwoFxqDlz_PoQoQqQ":{"text":"Our hotel was so nice and close to everything. I highly recommend it! Walking distance to ","useful":1,"cool":0},"DmvMYyg2zKEvGr4SLC2N5Q":{"text":"We stayed here one night during our long weekend in New Orleans. \n\nI was worried that the ","useful":3,"cool":0},"_exx8-9KoCgoQdHJhbhdfQ":{"text":"So far, this place is my favorite hotel in New Orleans.  It's reasonably priced, clean, an","useful":2,"cool":1},"Ofm5nygzZ8vYRHb2usCFaw":{"text":"I made a reservation to stay at this hotel on our way home from Grandma's in Florida headi","useful":0,"cool":0},"3aHmVsyeyKKdUbuiRMG7Lg":{"text":"The ideal place to stay if you're going for a New Orleans experience! The location is perf","useful":0,"cool":0},"MbXP85uyHWLPDFtxgEFOiQ":{"text":"I stayed here the night before our wedding in one of the 2 story suites, which then served","useful":1,"cool":0},"6FbK6rtG7i5duNZhEYIJmA":{"text":"My favorite hotel in New Orleans. I've stayed in many NOLA hotels and this one can't be be","useful":1,"cool":1},"TzEE2uJToVYhbWeSly-Eig":{"text":"I am astounded that anyone would write about poor customer service at this hotel.  The ser","useful":2,"cool":0},"WXsctJmBPDbo9gEPUFzcJg":{"text":"Sadly, this is not what I was expecting. The reviews for this hotel are glowing on every t","useful":4,"cool":0},"uDtTgQJWUSnITuLqXcQnBg":{"text":"Perfect location,  great rooms except beds are hard.   Awful breakfast,  expensive for the","useful":0,"cool":0},"EFU6dOFTJsXg4--g9OUV5w":{"text":"I wish there was a way to put more stars up for this review - my husband and I had our wed","useful":0,"cool":0},"JW8DDXljQ2hD2GPZJbFoiQ":{"text":"Beautiful hotel in the heart of the French Quarter. The staff is warm and welcoming and at","useful":0,"cool":0},"0jOWp6SsmxzVQ6Kb9z_Ogg":{"text":"I joined my friend for a quick weekend trip down in NOLA and after a bit of a debacle with","useful":2,"cool":2},"J4pV68WpP46cHNY2vKrqxg":{"text":"I had a really mixed experience at this hotel.  I'll start with the negative--\nThe parking","useful":1,"cool":0},"U9ATNkXRvHdtNkiv6XVBjw":{"text":"Stayed here for 5 nights on our trip to New Orleans. The hotel is very beautiful and the s","useful":2,"cool":0},"PHo_yyI_mKSFpg7XI_g5nw":{"text":"Perfect location for my first visit to New Orleans. The hotel grounds and room were great-","useful":0,"cool":0},"eo-GQfEQdwuoRWi1VZHqdA":{"text":"My girlfriend and I stayed here for four days from Dec. 30th through Jan. 2nd.\n\nWe loved t","useful":5,"cool":1},"F1qUaXBnbYG6wkMZF84QIw":{"text":"This was the IDEAL hotel experience for NOLA/French Quarter. If you want a quiet, clean, f","useful":0,"cool":0},"Esfx5gJ_tEgRn-f12uhNBQ":{"text":"I can't really find much of a downside to this hotel. The price is competitive for the loc","useful":3,"cool":0},"VT3mRS8q8Ib9a2OwSGOgjQ":{"text":"Loved our stay from 2/22/14-2/26/14. Hotel is extremely clean and well kept. Right in the ","useful":0,"cool":0},"QecAOMufeHrhrQJ6DTuDkg":{"text":"Hotel is old, but in a really kept up historic way. \n\nAbsolutely gorgeous in the lobby. Co","useful":0,"cool":0},"RcgbGbKIHGwql1JRZB_XqA":{"text":"TL;DR - This is the best venue in the quarter. If you want a wedding people will be raving","useful":1,"cool":0},"jOE0DeNHveu6WlzABnCoqw":{"text":"Absolutely the best hotel in New Orleans. The staff is very professional and very personab","useful":0,"cool":0},"sOnvj7ZE4bT-CWpOwb6ecA":{"text":"I wish I could give their customer service a ZERO!! The hotel is fine but the worst valet ","useful":1,"cool":0},"U4TAaOHpkaD4Jl_kbGHE-Q":{"text":"Another amazing stay!! The Bourbon staff is simply put,  awesome!!! Keiyanna always makes ","useful":0,"cool":0},"O0t8XXCAXv1pxXFmaKZXDg":{"text":"Great Staff. The hotel is older of course but...\nWe did have to switch rooms because our r","useful":6,"cool":1},"FPyN7BeaqT90mArXy0LTtg":{"text":"Lovely hotel and ideal location. The staff are always helpful and friendly. The only negat","useful":0,"cool":0},"sme4nouwmnMYhrgogQ118A":{"text":"Top marks all around. I couldn't have picked a better hotel for my long weekend stay in th","useful":2,"cool":0},"uUciQTKzqRVjmYLFmJh_sw":{"text":"Lovely hotel in a prime location in the French Quarter. There is some history to the hotel","useful":0,"cool":0},"fVKg1Ws5nCNGiQBoEc5XLA":{"text":"Our first time visiting New Orleans, and definitely picked a great hotel! The staff was al","useful":2,"cool":0},"fU5l3ZmlYgMoizrYEohILw":{"text":"This was a pretty great hotel located in the FQ.\n\nWe had just a standard room...which I ac","useful":4,"cool":1},"y244YC9DmH7exkcH4XqXYA":{"text":"I stayed 3 nights at the Bourbon Orleans Hotel (2/7, 2/8 and 2/9) in 2014 and greatly enjo","useful":0,"cool":0},"Kcep8ub4s4Gf-THs3KaL-Q":{"text":"Beautiful place with clean rooms. Excellent location & the valets are wonderful. Our bellh","useful":0,"cool":0},"eBV0B63ERQefCnVCptxc-w":{"text":"The Bourbon Orleans Hotel was the perfect choice as our place to stay in New Orleans.  The","useful":4,"cool":2},"0wKV28vSMH7LnDKx2vmxkg":{"text":"I heard this is great but don't know because I used the TRIPADVISOR  HOTELCLICK registrati","useful":0,"cool":0},"tUL88ZP-nSi9TySneU_Y0Q":{"text":"Went to Mardi Gras 2015 for the first time and found this hotel on Booking.com. I'm really","useful":7,"cool":2},"iwTuWwVEmEBWf_ngfzu-Jg":{"text":"This hotel was amazing! Our room was ready before 3 and we got two complimentary cocktails","useful":0,"cool":0},"MwXWz-WGECLWHP4oqbjoLQ":{"text":"I am one incredibly lucky woman because my husband booked this hotel for my 30th birthday ","useful":8,"cool":2},"GM-Be7SI_8Izda3sxcz3Jg":{"text":"This hotel was a great find for us.  Located in the French quarter it offered a quiet retr","useful":1,"cool":1},"I1Xh0vjgmsw430xLXQCeqA":{"text":"Nice bathroom, OK bed. There is absolutely nothing special about this place to make it wor","useful":3,"cool":0},"xuxA1nrODWaads52rQoASw":{"text":"I love the location of this hotel next to the church in the French Quarter and the great t","useful":1,"cool":0},"YShXlX9pDz3tU_depqemgw":{"text":"First and foremost, the staff, from the front desk staff to the housekeeper, was the most ","useful":0,"cool":0},"4wu1EUcBV9if-74ZgGWD_g":{"text":"Fantastic location, absolutely stunning bar selection. Bloody Maria was out of this world.","useful":0,"cool":0},"fiRedlp9Vz31VKJIaZmvCQ":{"text":"Great hotel. I love the bar. Rooms are nice.ask where your room is if you want to sleep. I","useful":0,"cool":0},"2MdedpsSoDixGKesZo41Ig":{"text":"Nice hotel.  Nice pool area, bar, coffee in the rooms.  A great light breakfast.  Very wel","useful":0,"cool":0},"S5I8u1uJwxqDNoSzuSJ0vw":{"text":"I meant to return to Yelp and update my review during our stay, but I want to make sure I ","useful":0,"cool":0},"GdG11rUa-x3UZEkz0FPuAg":{"text":"Stayed here a couple of weeks ago. The staff was super friendly and I loved being right of","useful":0,"cool":0},"QJ5bbdppoGMm2ufHgvoJwQ":{"text":"Quaintly dated with a friendly staff. Beware, the bed linens are possibly the worst in hot","useful":4,"cool":0},"KslSSA161kbD4jAyD5VSow":{"text":"Room was a bit small but was clean and comfortable. Did not see any ghosts, which was a bu","useful":1,"cool":1},"vbkRt8Qz1ryP4cRKv8nidw":{"text":"The hotel bar is the best stop on Bourbon St. The Monday band is amazing. The lead singer ","useful":0,"cool":0},"gyhs5vX5880qDNOIGBWi3w":{"text":"Very nice hotel. Stayed on the 5th floor with a partial view of bourbon street.  Only comp","useful":0,"cool":0},"fAHpQV-8RIMlRGTybq5GQg":{"text":"This hotel was a great choice!\nI came with my family so i wasn't looking for a party hotel","useful":2,"cool":0},"c94GoWfdfawbtkxuJM0uFw":{"text":"I used to stay in this hotel at least once a month for many years and always loved the con","useful":2,"cool":0},"4Ugh-_jOXIney5Ui4N6ZwA":{"text":"Very neat and clean. Excellent service. It was a refreshing  difference from the dump we l","useful":0,"cool":0},"AFVnOE2bzPWk13MSFt2B6w":{"text":"Perfect location.  Clean and well maintained.  Attentive staff.  Fascinating history.  Bre","useful":0,"cool":0},"jWAeReNzYfbtDcEzinBcSg":{"text":"Beautiful hotel. I love the little pool in the middle which is heated and has waiter servi","useful":0,"cool":0},"W3d9Nm0lmncZM7orOmY2NA":{"text":"We stayed at this hotel when we visited recently. I loved this place! Very clean and welco","useful":0,"cool":0},"9qTScxUtAwuIcOc4HHj4IQ":{"text":"My friend and I booked our hotel through this website.  For the deal we got, which include","useful":1,"cool":0},"GCO_l35X2mrlfp18-Pa6PQ":{"text":"I 1st trip to New Orleans we pick the perfect hotel .   The staff could not have been nice","useful":1,"cool":0},"jW3kQWs_scSTnTJ1-6NY8g":{"text":"We had 3 nights there and loved it. The room was good and the service great. We had breakf","useful":0,"cool":0},"DAYIbzRC-lGWD2pYdGZj8g":{"text":"I love this hotel! We got a two story suite with a balcony over Bourbon Street! You are no","useful":3,"cool":1},"pIsEFxWaA3N6cv0UbuljKg":{"text":"Girl let me tell you even though this hotel is haunted, The people who work here are very ","useful":2,"cool":1},"16DneeKsm_LPD8pt4TD-VA":{"text":"This was our first stay at the Burbon Orleans but it certainly isn't going to be our last.","useful":2,"cool":0},"IgfwM4kwtsEMF096FAAGnQ":{"text":"We love the Bourbon Orleans Hotel. The lobby is gorgeous, the rooms are beautiful and so v","useful":0,"cool":0},"b7__NG5vAGrQxnOAUOAiOg":{"text":"Important: know that the street behind this hotel is Bourbon Street. If you are hoping for","useful":6,"cool":2},"z-EPKTTpgAb3Yvx0Hz9Q_A":{"text":"perfect location to experience the French quarter. definitely book a balcony room. you'll ","useful":1,"cool":0},"nBDFx3y_hpoWeUAHDvmUSA":{"text":"1. Booked a Vieux  Carre room, which is described as a rm with a wet bar and a sitting roo","useful":4,"cool":0},"COPenlbvmZlF_GbWvysQjg":{"text":"Went on our long awaited honeymoon. \nHotel is beautiful, people were wonderful, rooms luxu","useful":4,"cool":1},"rc6b_8NusSIZ7-7c_nAAhw":{"text":"Amazing hotel in the heart of the French Quarter. Highly recommend!!! Spent a few days wit","useful":1,"cool":0},"_eMxevzGCDsJzfhHh58cEQ":{"text":"love this hotel!! quiet yet right next to bourbon street and the fun bars. very clean and ","useful":1,"cool":0},"Xxa7TUsv2shXCj4SIqDaSw":{"text":"My new hubby and I had a truly memorable and amazing wedding weekend (Oct. 12-13 2013) -- ","useful":0,"cool":0},"OLfDsrb24cDVJGClua3Mxg":{"text":"My wife and I were married in the Andrew Jackson suite last weekend, and I can say that th","useful":4,"cool":1},"5XX_PWwhKKVmZw0fRRvK3g":{"text":"While the Bourbon Orleans does indeed offer the perfect location, amenities I am used to w","useful":0,"cool":0},"Nbe7HngOgFP6BNahbI0xhg":{"text":"Really loved our stay here. Staff was very friendly and helpful. Sunday morning Bloody Mar","useful":1,"cool":0},"aslRcUJj2ElWQrx11M-r5w":{"text":"Absolutely outstanding. Located just off Bourbon Street.... But far enough to avoid the no","useful":0,"cool":0},"rVYaEfJOO9eqoDuafM_s4w":{"text":"We stayed here for a bachelorette party & absolutely loved it! Beautiful hotel & super fri","useful":0,"cool":0},"DZiPqnusxkhtpaDKcdrBVA":{"text":"Just about everything i could ask for in a hotel! \n\nWonderful beds. Everyone in our group ","useful":2,"cool":0},"2rmfkgjMxtUokIY121ldHg":{"text":"Nice historic hotel. Unfortunately our room smelled like smoke from apparent partiers the ","useful":1,"cool":0},"iTX1RblcPyojxNyduBGeNA":{"text":"Great location - couldn't be more convenient. Street side rooms with balcony are loud - bu","useful":1,"cool":0},"HCH8HXvqUZMEpXqWrvWjVA":{"text":"Great breakfast buffet! The biscuits and gravy were fantastic, the sausage was juicy and t","useful":1,"cool":0},"eW3OrQ2OGg5ELzNoJRuB6Q":{"text":"Attended a party here in a suite.  The staff was friendly and helpful and the suite was ve","useful":0,"cool":0},"8Bb9NmeBdqBbTqHYtDq3gg":{"text":"This hotel is amazing!!!!  So walkable, in the middle of everything but the rooms are stil","useful":3,"cool":1},"Ju3luKAB8NIch8V56rb_pA":{"text":"Truly enjoyed our stay here.  Almost everyone was helpful and extremely friendly except fo","useful":1,"cool":1},"UYUkuKxHEj2eXBlvU36oBQ":{"text":"After going to Nola almost every year, and usually staying at the wonderful Beinville hous","useful":1,"cool":0},"6tKh72lCz4iLKOGlXOs8gw":{"text":"We  have a few more nights here so this review may change. For now, we are not impressed. ","useful":0,"cool":0},"9oq_28G-HY1-tBvlr8sdPQ":{"text":"A class in itself--This is what FIVE STAR was meant to be!\n\nPlease humor me, while I share","useful":4,"cool":3},"dVpFG_z2eovD3XF8XlRlqQ":{"text":"Gross ! The front desk staff was plesent,  the concierge was a helpful guy and the locatio","useful":3,"cool":0},"t5CXS2P-bdVu_CPeacPvVw":{"text":"The hotel was clean and it's right in the heart of the French Quarter. For what we paid th","useful":0,"cool":0},"_Zm34VXvj6mpDmiM2W_Z9A":{"text":"We loved our stay at the Bourbon Orleans Hotel. Beautiful rooms, great service, good centr","useful":0,"cool":0},"nBmdSszRN0RPafzGlvFmww":{"text":"Great hotel.  Amenities.  Location. Staff professionalism.  The only complaint.  The bed! ","useful":0,"cool":0},"dNh6XBXlKjiTdOSpOIaqKQ":{"text":"Beautiful hotel in the heart of the French Quarter. Loved the history of this hotel. \n\nJus","useful":4,"cool":1},"WlcLAFKUQ5PdgKWFLdB4-w":{"text":"Loved this hotel. Great location but quiet room (if facing courtyard). Exceptional staff. ","useful":1,"cool":0},"xVwDcSp4HVlA-R8ATmt2zQ":{"text":"My wife and I stayed here for our Honeymoon and very first trip to New Orleans. To say tha","useful":1,"cool":0},"LkjmWPJ56sTtuJmqrJAdAg":{"text":"Part of the New Orleans Hotel Collection, the Bourbon Orleans hotel is located on Bourbon ","useful":3,"cool":0},"0Yiwy5KKgFXNW8wuuFY84A":{"text":"Stayed in the Bourbon Orleans for a friends wedding. First time to NOLA & was impressed wi","useful":0,"cool":0},"sSRiM0M9H-WYXssd2RMDGQ":{"text":"LOVE this place.\nSpotless.\n\nJust lovely & classy, best location ever.\nNicest staff. Especi","useful":1,"cool":0},"bYSM-DzRpzFU9aa91FJGKg":{"text":"I had an excellent experience at this hotel. It is the quietest hotel I have ever stayed i","useful":0,"cool":0},"GZG8-GyWndyKybfB80RkhQ":{"text":"This was my first trip to The Big Easy and it did not disappoint! Stayed at the Bourbon Or","useful":4,"cool":0},"GIA8iWrv1Y0FVp1lVYKQzg":{"text":"stayed here last week for birthday getaway. we were upgraded to a balcony suite for 50 buc","useful":0,"cool":0},"_kcBbO5_oTxnGLEuT0WfuQ":{"text":"I was so disappointed in the customer service at this hotel.  We stayed for 4 nights in Ma","useful":3,"cool":0},"g1zkKsHce6k9JA5b3Dnq3w":{"text":"The Hotel, Bar, and location is wonderful!  The staff is nice and friendly. A lot of good ","useful":0,"cool":0},"21-7T4yL9eBRZjWkYi-AXw":{"text":"We stayed here between dec 26-30. There are many things we liked, and some things we didn'","useful":0,"cool":0},"-C0eVRiM7-hyYoOKZNrHFg":{"text":"This was my first trip to New Orleans and this hotel was perfect! It was absolutely beauti","useful":0,"cool":0},"U4k9hoHoJ9f9TcQRJwlltQ":{"text":"It IS HAUNTED!  But I love it!  To the person who said they heard the door knob jingle, we","useful":4,"cool":2},"kKYgSnjyQL5kcwyZDH1aAQ":{"text":"We usually stay at the Hotel Provincial when we visit the French Quarter but it was sold o","useful":6,"cool":0},"Z5RPjQxQrpjpXessUAzhqA":{"text":"Beautiful hotel in the heart of the French quarter. Rooms are small but very cosy. Have st","useful":0,"cool":0},"ci9VHHfobRm96Tk_9TEiTA":{"text":"While location is fantastic, our experience was horrible. The original room they gave us w","useful":2,"cool":0},"uvEeiLX5joy9xkCUbXQEYw":{"text":"Clean saltwater pool with drinks served by the friendly Hotel staff. We stayed in the loft","useful":0,"cool":0},"NQ5HLU9WijMcKWHq_WoHSQ":{"text":"Great place, clean and cozy and received great service from Chris. He was very professiona","useful":0,"cool":3},"L2-TS6oUCPX2TLh2hHWsug":{"text":"It was a perfect experience. Staff was wonderful. Prices were very reasonable. We felt lik","useful":0,"cool":0},"F-UH2tMvkpqZOwBnB0Ummw":{"text":"Nice hotel nestled in the French Quarters!!!!! The pool area is very inviting as well as t","useful":0,"cool":0},"SJuQIIBFL8uNnSFraZQMRQ":{"text":"If I could I would give it no stars.  This hotel is not comfortable at all.  I was told to","useful":2,"cool":0},"UgGomxRkWnSHrWtPBcmtew":{"text":"Here are some pros and cons for the Bourbon Orleans Hotel. We enjoyed our 4 night stay and","useful":3,"cool":1},"w6DdHtUaIeCXV5GyAvGe7w":{"text":"Stayed in a petite balcony room with my daughter for my 50th birthday.  We were greeted by","useful":1,"cool":0},"wR4n1sIwUk-_fx5AOcIg6Q":{"text":"We really enjoyed our 4 night stay here 12/30-1/3 at the Bourbon Orleans for the most part","useful":0,"cool":0},"62rv7cZcWtyO0sJWoigkMw":{"text":"Very friendly and helpful staff, rooms were awesome and beds were comfortable.  I loved th","useful":0,"cool":0},"CT7vPye9Yut9Fpybrm6XtQ":{"text":"Location is great and the room was nice. We were on the 6th floor looking over Bourbon str","useful":2,"cool":0},"8n1VRgTBpuuN07cz9Fqrfg":{"text":"I have this hotel 1 star because of service. Their night staff is very rude. You can't ask","useful":0,"cool":0},"1pPaXhU9c5nl0yZozHiQxw":{"text":"Just checked out after a week stay at Bourbon Orleans. It was nothing but pleasant. The ro","useful":1,"cool":2},"d5tf20bRQd_Bz7bMGM_alQ":{"text":"Stayed two nights for wedding of family friend.  Everything about this place is nice with ","useful":0,"cool":0},"8mrt0AfyuIlK2hgglWKAeg":{"text":"Wir haben über den St. Patricks Day 3 Tage hier in New Orleans verbracht. Das Hotel liegt ","useful":0,"cool":0},"GMhZPJ1qcF_ZNdBBspRDBw":{"text":"Booked 2 rooms for 2 nights 5 months previous to arrival. I arrived at check in to find ou","useful":0,"cool":0},"iygS55cddy0kg8mZ7KOxvg":{"text":"Pretty great hotel right in the heart of the French Quarter.  The location is excellent fo","useful":0,"cool":1},"JPXe6mFEnK1TsQGyi8pIQw":{"text":"Great hotel. Horrible bar. Room was gorgeous although they forgot to give me water after t","useful":0,"cool":0},"9L9ADwoHdy5U2nLUQ73slg":{"text":"Our stay over Labor Day Weekend was great. Our check in was delayed due to computer outage","useful":0,"cool":0},"yjpvwmVfEhyFavIp8XNmzQ":{"text":"I really enjoyed my stay here. \n\nI had a small room on the 5th floor - it was a squeeze, b","useful":3,"cool":1},"8CmMukOU6nqZHP8kaOwcUA":{"text":"Got a great deal on Expedia for this hotel. It's in the middle of the French quarter. Defi","useful":0,"cool":0},"W0gprQUJDDAAQLCwgGAT1Q":{"text":"Lovely hotel.  Then staff was phenomenal.  Friendly and knowledgeable of the area.  The ro","useful":0,"cool":0},"f1wPsZ1hUB-PCKMeUcMb9A":{"text":"Beautiful hotel, close to Bourbon Street. Within walking distance of tons of restaurants a","useful":0,"cool":0},"E_TFBln0eOtbeqrRKNGrEw":{"text":"Over a year late. Just ready Tracy T's review but, basically, this place is in a perfect l","useful":1,"cool":0},"1uqj6zcvBCBEnmbt1vlbrA":{"text":"The locals call it the Bourbon O. There is a huge bar on the Bourbon Street side, but it w","useful":1,"cool":0},"5egr7Q12aQWSC1AdvuV7hQ":{"text":"Nice boutique hotel at a perfect location near Jackson Square and both Royal St. and Bourb","useful":0,"cool":0},"YFuw2yGkQ-RxUAa-K9givA":{"text":"This place has history. That is a nice way of saying that it is old. \n\nThey take some prid","useful":2,"cool":0},"FK-5qG1DhojyX9C2TC7Y3Q":{"text":"Good hotel and the location is excellent. The hotel is in the middle of French quarter. Bu","useful":1,"cool":0},"PRx6BJiEZR7BcfqJwNQHIQ":{"text":"Ok so there were a few things that were nice about this place. Nice pool, free coffee in t","useful":0,"cool":0},"TRFl5c_o1K2rV0rvgugU1g":{"text":"Amazing hotel in the heart of the French Quarter. Highly recommend!!! It was very pricey b","useful":0,"cool":0},"g1VsMLyTVK4G9CEP1NVzFg":{"text":"My sister and I stayed here while visiting New Orleans. The staff was very professional an","useful":0,"cool":0},"dPibhGFWShE9nebJrDlEXg":{"text":"We took a long weekend trip to the Quarter in mid-May.  The Bourbon Orleans Hotel was the ","useful":2,"cool":0},"tmvsK_Z3z4RgrNqedRZFeQ":{"text":"This hotel and its staff are perhaps the most caring and hospitable I've ever encountered ","useful":0,"cool":0},"12bBoaObQB1jnh5hABhqvA":{"text":"This hotel is absolutely beautiful, well kept up, comfy beds and top quality service.  I s","useful":0,"cool":0},"SDsgI4L6xqnnXQADvmt4Gg":{"text":"I booked a hotel room through Expedia for The Bourbon Orleans Hotel on August 5th 2014 for","useful":1,"cool":0},"59CgKul8JxE6clNWE-s4Eg":{"text":"Very well appointed hotel right in the heart of the French Quarter. Staff were very friend","useful":0,"cool":0},"z2NsfQAwYi9iwb-VgAE9-g":{"text":"Stayed here over a weekend as part of a wedding in October and I can express how wonderful","useful":4,"cool":0},"NzzvXelVra-SQFld8iYl4w":{"text":"My husband and I stayed at Bourbon Orleans during a recent weekend trip. We only stayed on","useful":0,"cool":0},"AT6umIB_jy2RQNoILzDMUw":{"text":"My very first time in New Orleans and this hotel did not let me down.  The room was clean,","useful":1,"cool":0},"PjYQuRCm9bnqVrE6xDSuNw":{"text":"Stayed one night. Loved the quaint atmosphere and attention in all the elegant details in ","useful":0,"cool":0},"6UjoCW12xEcRFx5M7oGNRQ":{"text":"This hotel is very nice and conventionally located on the corner of Bourbon and Orleans. T","useful":0,"cool":0},"1EnXGKC4BQ2SjYKh1fAkDg":{"text":"This is a great hotel right on Bourbon.  It is beautifully decorated and very hospitable. ","useful":1,"cool":0},"v3pU_2lhQ5ROZ5lMtXr3dA":{"text":"A beautiful hotel in a beautiful city. The rooms were spotless and staff were so friendly.","useful":1,"cool":0},"glb2Mf-agkeEFwy5F0Fhhg":{"text":"Great hotel, noisy location. \n\nI came and stayed for an extended weekend in early October.","useful":5,"cool":0},"d64TNugRwQ4pEaClBt8bmg":{"text":"Amazing hotel in the thick of the French Quarter without being crazy. Great service and a ","useful":2,"cool":0},"xbzS3vPRT1XHAZqGCR1ZcQ":{"text":"The real reason why I booked this hotel is because it was probably the cheapest I have fou","useful":5,"cool":2},"tlPhfi_7TJ6z6qyRbgKrcg":{"text":"Booked this hotel last minute on the Hotel's Tonight App and was not disappointed. It was ","useful":0,"cool":0},"lMz49cgB3nWwc0LNaRqoFw":{"text":"I stayed here for 3 nights at the beginning of August, and I really enjoyed my stay. We bo","useful":3,"cool":1},"CRBUrMR0Xer0DPXjplpUfA":{"text":"Good hotel. Decent prices. Very clean. A block from bourbon street. A couple of quirks: th","useful":0,"cool":0},"VOqU5UcEzDLGDFJY7bRIVw":{"text":"First off, I need to say that I love New Orleans!  Secondly, the Bourbon Orleans Hotel is ","useful":0,"cool":0},"acdRE8w6yEKKpEclw60qfg":{"text":"Beautiful inside and great people at the desk for check-in. We got haunted a little during","useful":0,"cool":0},"ZY5Zj3zODyWjZWYpOZTtZw":{"text":"Stayed here over Labor Day weekend. Location and staff get 5 stars, and overall I would ra","useful":1,"cool":0},"eZK3m9OXKUgjjh2ZhmircQ":{"text":"The room was cozy, with large tvs.. nice showers with marble throughout the bathrooms. Bal","useful":1,"cool":0},"_iVcARsVEOFxfTDopJ5-6g":{"text":"I got an Expedia mobile deal for a quick 1 night stay at this hotel and it was perfect. It","useful":1,"cool":0},"Cr0Mhy9HlBol_poTCaajbA":{"text":"Great location.  Walking distance to Cafe Du Mond and St Louis Cathedral.  We got a great ","useful":0,"cool":0},"tCsWCSa5JX-ALj7LlCi9GQ":{"text":"Great stay, fabulous bar in the first floor, very cool history. Convenient location. Court","useful":1,"cool":1},"dLMwZOScLBmdo81w4DOr_w":{"text":"Loved my time here! I'm a big NoLa fan but this was my first time in this hotel. All the s","useful":0,"cool":0},"RUYotRa3efms5XikX0UvuA":{"text":"I would have normally given this place 4 stars on its location alone as I have stayed here","useful":8,"cool":0},"6gfHI_MLHmFQawsSJEaONw":{"text":"I checked around and this was the most affordable one bed option in the french quarter at ","useful":1,"cool":1},"oDctV7p-3hOfA0uJyBGk4A":{"text":"What a lovely hotel and friendly staff!! Had a great stay here, they really know how to ma","useful":0,"cool":0},"WnVzFyN_RGUFSDq57YK4bw":{"text":"Great central location to explore the French Quarter but the  rooms are so quiet that you ","useful":0,"cool":0},"fbfKlOpPbH3V1jZ5DDRvvA":{"text":"Very hospitable group.  Quaint French Quarter hotel rooms but magnificent bed.  Very clean","useful":0,"cool":0},"-MFmi-nJesyNjNXlye6cgQ":{"text":"Room was clean and overlooked the pool. It was a smaller room but perfect for 2. We had a ","useful":0,"cool":0},"QhtH6__MbnUPOPFv9yYWHw":{"text":"We always love coming to New Orleans, and the Bourbon Orleans was great! Just be aware - i","useful":0,"cool":0},"iS5_kSbaFmbfI46zPURdlQ":{"text":"My husband and I have traveled extensively and internationally, and I can say without hesi","useful":1,"cool":0},"-DYrFPfchCZ9goyXWNxrnQ":{"text":"We came for a weekend, and were lucky enough to stay at the Bourbon Orleans. The lobby is ","useful":0,"cool":0},"0TbQk8fkPNN9cpTcWpHQxQ":{"text":"Billed as the most haunted hotel in New Orleans.  Happy to report that the ghosts let us g","useful":3,"cool":3},"4e8fAhfJgWfyRFN7hkldxQ":{"text":"This is my 2nd time staying here and it was an overall great experience. The hotel is clea","useful":3,"cool":0},"LqK6uZXI1V40hxPQ4Y6NVw":{"text":"We really wanted to get back to New Orleans for Mardi Gras after coming for the first time","useful":1,"cool":0},"zO223Dq_b2kSfPa4YWCE3w":{"text":"Today we buried our mother. We were on the way back to Dallas and decided to stop overnigh","useful":0,"cool":1},"cZ64R_jXAcjPQE87dsLSWA":{"text":"This is our goto place in NOLA. Been going every year for 38 years. Staff is great, locati","useful":2,"cool":0},"n4-ziWpkQWc13fbW2NMciA":{"text":"We checked into this lovely hotel under less than ideal circumstances. \n\nThe hotel we orig","useful":2,"cool":0},"W4fk8etCCc2YXXmCmb-e1w":{"text":"Fantastic from start to end!\nLoved the location right in the heart of the big easy!\nValet ","useful":9,"cool":4},"TZNT1sv3-a8bzPzidedK4Q":{"text":"My wife, daughter and I shared a Vieux Carre Queen Room with two Queen beds.  It was perfe","useful":3,"cool":0},"rS6X39uwxeDdlbB6TbzXmQ":{"text":"Love, Love, Love!!! This hotel is breathtaking. The staff was wonderful and and went above","useful":0,"cool":0},"zZAZp_SWVfyO2q5rEqUkGQ":{"text":"I highly recommend staying at this wonderful boutique hotel.  We were warmly greeted by th","useful":1,"cool":0},"r3CI4ZOT16LGAcLmSPflwg":{"text":"I have been staying at this hotel for 10 years now during FQF and it never disappoints.  H","useful":1,"cool":0},"bC76YG3PKT7lQ-FMeGRhEg":{"text":"Stayed at this hotel for my first trip to New Orleans.  The room was clean and very nice, ","useful":0,"cool":0},"NFs7M0CRyXgn6w1m3BTw1w":{"text":"We stayed in this \"haunted\" hotel while down in NOLA for the 2017 NBA All Star Weekend, an","useful":1,"cool":0},"obULGgi4ezFtvdkkD6wFHw":{"text":"This hotel was a good place to stay for Mardi Gras. Not too far and not too close to bourb","useful":1,"cool":0},"UQq0lLbofZvFcQJ6mR_o_g":{"text":"I had my wedding reception at The Bourbon Orleans Hotel and also stayed at the hotel. I li","useful":1,"cool":0},"RJpMhhoyP7G73dYXtha0Pg":{"text":"Yummy split the shrimps and grits and it was excellent, also had the butter pecan pancakes","useful":1,"cool":0},"eTVnb6rrHgB5jAXCD49UTg":{"text":"I hate to write a bad review, but I am so disappointed in this hotel I have to do it. This","useful":2,"cool":0},"qI3XaaNl3bSE22aR1OrU-w":{"text":"Nothing says Nawlins quite like the Bourbon Orleans. Great room. Nice pool and close to Bo","useful":0,"cool":0},"n8lNboeH-I2lSQibH0sTZA":{"text":"I love this hotel. I have stayed here two years in a row with a very large group and they ","useful":0,"cool":0},"xCMok3BRBwVaTlq2BDD8Dw":{"text":"Amazing facility!! \nI was in NOLA attending HexFest 2018 and this hotel was stellar. \nEven","useful":1,"cool":0},"U5lBd532sMspTLdYAQoKpg":{"text":"We have a room this weekend, and a group of us decided to stop into their bar. The securit","useful":1,"cool":0},"fMC710uVG0tejdYDvrv3UA":{"text":"This is one of my top 10 places to stay and Bourbon Orleans is at the top of my list! Than","useful":0,"cool":0},"98ZszvlvfeJ2NNl9MeVfIA":{"text":"I had a great time at the Bourbon Orleans last week and I hope to return soon. The hotel i","useful":1,"cool":0},"rwtUbHT-jdllzDhr711bHA":{"text":"This wasn't a \"stay,\" it was a \"story.\" If you came to this hotel to stay in an elegant ro","useful":2,"cool":1},"pY3NGiFDxVUsQaMwhjtz6g":{"text":"You couldn't ask for a better location for a hotel in the French Quarter than the location","useful":0,"cool":0},"xpCrnOV7aGKBjW7ngGsGhw":{"text":"Love this place. It's on Bourbon Street, but it's at the far end, so it's not too crazy. S","useful":0,"cool":0},"BsKYJ7o7M-i4BcSi_KCTDQ":{"text":"We spent 4 nights in the Bourbon Orleans hotel and loved it there. It's half a block away ","useful":0,"cool":0},"Y2F95ZyGl35UnmcaQMSH0A":{"text":"Fantastic!  Every member of the staff was courteous and friendly. Location is ideal and ev","useful":0,"cool":0},"BIVbhM4vzxNut3qNoqumBQ":{"text":"This is a quaint hotel in a good neighborhood. We Upgraded to a loft suite which was defin","useful":0,"cool":0},"74bFGy1MWB96VCmtLjmShg":{"text":"Great service. Clean. Good location. Friendly staff. Room was nice and big. Well appointed","useful":1,"cool":0},"o11_TmWg8QEA_aTLrUuJXQ":{"text":"Hotel was recently refurbished and modernized. Staff was very helpful and accommodating.  ","useful":1,"cool":0},"Qbbl-YFSpPtW8GkGGYD34w":{"text":"Most of the people on the staff were nice and helpful; HOWEVER, it was confusing calling a","useful":3,"cool":1},"AoNZ8R8W4VePWvNEKhUQUA":{"text":"What a beautiful hotel!  The staff, from the valet to the bellman to the front desk and be","useful":0,"cool":0},"fncWSsReF3HHDG65Z-37RQ":{"text":"I haven't filed a Yelp report in years.  I feel compelled to do so now because of how bad ","useful":0,"cool":0},"-Ge-k4WvdB5H0H7FgH5tiw":{"text":"The Bourbon Orleans Hotel is probably your best bet if you want to be in the heart of the ","useful":7,"cool":7},"dJ0h5xi1S2ShFPXjAYu1Tw":{"text":"Stayed from Thursday through Sunday with friends.  Everything was absolutely awesome! From","useful":0,"cool":0},"f2Y1EtdVww3kpkkdr6mdDQ":{"text":"My daughter left her phone in a room and when I called to report it and the front desk cus","useful":0,"cool":0},"L9IRtLPDJCix7BDHMrVSqA":{"text":"We stayed here early this month for 5 days.  This is a beautiful hotel located on Orleans ","useful":1,"cool":1},"rFTegQVpl4r8Qnwp82Otvg":{"text":"The two stars are for the bed, pool and bar.  We stayed five nights while in town for Jazz","useful":2,"cool":0},"tqVnSqCBJA-vm8-wFXb6YA":{"text":"Just finished a 5 day stay here. I'd give it 5 stars except that the rooms are so small. T","useful":0,"cool":0},"SlPYUatLm6h17Oz8CYiygw":{"text":"Beautiful hotel in the heart of the French Quarter.  Bourbon Street and the St. Louis Cath","useful":4,"cool":2},"nUTSzE0yfXBMEbjaYNjzkA":{"text":"This is the absolute BEST place to stay in the French Quarter! Not cheap, the bar prices a","useful":0,"cool":0},"QuxaAz0IBHaUEUjp8wpQHg":{"text":"Truly fantastic location that really can't be beat. A skip away from Jackson Square and a ","useful":10,"cool":9},"EFZVmseJmMO9q0SDCcYibQ":{"text":"Great choice to stay right in the middle of all the fun when visiting Nee Orleans. Easy to","useful":0,"cool":0},"qaxwbIozPKRnbmHXNx3RvQ":{"text":"Great hotel on the block between St. Louis Cathedral on Royal Street and the bars of Bourb","useful":4,"cool":2},"7BjXvArJ_irfMf7jWmT3PQ":{"text":"We had the two story suite that faced onto st anne street, believing that Bourbon st would","useful":1,"cool":0},"jpzY_AcWYgIPs5dL7K8HOg":{"text":"The lady-friend's work rented out a suite for Mardi Gras weekend to entertain clients here","useful":3,"cool":1},"PLBPrSSNfxfe4AV_DFcj0A":{"text":"Fantastic staff!\nAmazing large room with balcony overlooking bourbon!\nGreat food nd bar!\nH","useful":2,"cool":0},"nn1hyurQraAgmH71I8cu9A":{"text":"This hotel has a great location, steps away from restaurants, bars and attractions.  There","useful":0,"cool":0},"MSxkd_v8RA8Odv2rx2FabQ":{"text":"BLOOD on two PILLOWS and COCKROACHES in the bathroom! STAY AWAY. The customer service is t","useful":0,"cool":0},"yTRgvRY862mHsWlV_nrhmQ":{"text":"The place looks great nice old style furniture and great service with the people who work ","useful":0,"cool":0},"rQmTtpRA49cwHxiIUIJeUQ":{"text":"This hotel for cleanliness, size of rooms and proximity to everything would get five stars","useful":2,"cool":0},"H_OucOXPaTiHrRHMheCdUA":{"text":"What a gorgeous hotel! They allowed my friends to decorate the room freely for my bachelor","useful":0,"cool":0},"0eEhaJ2IcTOCgyc7dIc5KA":{"text":"Amazing hotel in the French quarter... PERFECT location... Great service \nBeds were very c","useful":3,"cool":0},"3mCbjSlAGliKD006ZZUgjg":{"text":"We pulled up after a long day of travel in a rental car, head still swimming from an unkno","useful":2,"cool":0},"ukqp6PYDdwDsJWfeAJQaEA":{"text":"Got a great deal (I think) on hotels.com for this place. Very pleasantly surprised. This p","useful":3,"cool":0},"VvuUVeD_L4Kpz0cz6R8sEg":{"text":"My husband and I married on the balcony of the Andrew Jackson suite in September. It was a","useful":3,"cool":0},"P5ljAGmcEwCy6BPm1j1STg":{"text":"What a lovely place! The location is ideal, a block from Bourbon Street and very near Jack","useful":0,"cool":0},"jEsBRH-nMIIZmCEpa3bR1g":{"text":"SO VERY PLEASED! Perfect location! In the heart of it all, but not so noisy you cant get a","useful":7,"cool":4},"vycPgjhzDlQyhGQaFZiA6g":{"text":"This place is a disaster. Don't trust the link the reviews written by their marketing team","useful":0,"cool":0},"ztNhPYjtxweT2vY26KmPSg":{"text":"Anyone going to New Orleans, I recommend this hotel. What a beautiful hotel.  Center of ev","useful":1,"cool":1},"hjBWiwBvH8FiKTMdEz4ijw":{"text":"What a wonderful hotel.  Great location,  balcony,  nice beds,  great bathroom!  Best part","useful":2,"cool":0},"R92XY3gyXh8m0o1lcoztCA":{"text":"I stayed here for 4 nights on a family trip to NO. The hotel has so much potential, but un","useful":2,"cool":1},"6ivz2gWIP3U9qepidx_x7A":{"text":"The hotel itself, is what I expected.  That is to say, old but quite charming, which reall","useful":0,"cool":0},"tLRfyTH3JpMriQmgfUoCwA":{"text":"This is my favorite hotel in the Big Easy. Not because it's the most fancy or has the best","useful":3,"cool":1},"aTI4UX24ABSTMWcM2E1eGw":{"text":"Gorgeous place, perfect location in the heart of the French quarter, all staff are extreme","useful":0,"cool":0},"nf1SEaIQKu8l_b6E5ecVRA":{"text":"The hotel was ok.  \nI work in a 5 star hotel in San Francisco and travel a lot.  We arrive","useful":6,"cool":0},"16nFVDAoTA_WylSSQHHVZA":{"text":"Non refundable rooms. Can't change dates or even get a credit. Do not come here unless you","useful":0,"cool":0},"cJ2t2LZ7oi4TEVpvnxeSWw":{"text":"Very nice hotel. Very accommodating and clean. Our room wasn't the greatest, but it did th","useful":3,"cool":0},"t4SE3xSZnco-iNzZqc4uwA":{"text":"This is my 3rd stay here and my experience has been consistently great. The staff is so at","useful":1,"cool":0},"yR_Dv-YgsfC5QTYqqCytPA":{"text":"Been going here for years but it has changed. It has gone DOWN HILL!!! Rooms were very dir","useful":0,"cool":0},"1ufLp7grMG-sScx-EAh8pg":{"text":"our third stay here, perfect location, great price, clean, and fantastic service, and a gr","useful":0,"cool":0},"eCwWwlm0hVLl3SR_Y84gHw":{"text":"What a beautiful Hotel. The staff is very nice, professional, and charming. We had two bea","useful":1,"cool":0},"Uni78VGMdDhG42WhwmMvAw":{"text":"I stayed at the Bourbon Orleans a few years ago and it was such a great experience I booke","useful":0,"cool":0},"4p137IxV_mYQ2DOs37UFEQ":{"text":"Great hotel, location and service - HOWEVER .. rates triple on \"special events\" and demand","useful":4,"cool":0},"mCPhbSd8_CzapgXx12t-gg":{"text":"Beautiful hotel. The location was excellent. The hotel was clean and the staff was friendl","useful":0,"cool":0},"K7LcFWGjWaFmjMlevsXpsg":{"text":"I read about the hotel and the history of it online.   Had to book this hotel.  \nDidn't bo","useful":6,"cool":2},"wVl8_SwrawZaVp81N9BEqA":{"text":"I love this hotel. I loved this location.  Why? The Bourbon Orleans is a boutique hotel lo","useful":3,"cool":0},"Enitiqf-2EB1-MBQelpQgA":{"text":"This hotel was a delight to stay in for our trip to NOLA. The staff was helpful and welcom","useful":1,"cool":1},"r2mknzsQEN8-htu_ykbIfQ":{"text":"All hotel employees were fantastic with taking care of us in upcoming bad weather (tropica","useful":1,"cool":2},"FrizWXmsISKTnOsq94_fZQ":{"text":"This is gonna be a long but thorough review of our experience here.\n\nAs this is our last d","useful":5,"cool":0},"ppDa_H81SWF4E27XL3eIBg":{"text":"VERY MISLEADING!! Beautiful hotel in a convenient location but it shows it age. Plumbing d","useful":2,"cool":0},"6up1YDh7w-Vx4hJHnBksYw":{"text":"The only reason I'm giving a five star is because of their beignets.   THEY ARE BETTER ---","useful":0,"cool":0},"dHkctypjAaZ6PMT25RYOyA":{"text":"Simply a marvelous stay!  \n\nLocated in the heart of the French Quarter...from the friendly","useful":9,"cool":13},"PFRV_9tAw7LAuucVjUgH2Q":{"text":"I really couldn't say enough wonderful things about the Bourbon Orleans.  We chose this pl","useful":3,"cool":1},"PwqXQMwYEWwh4CvqiC3zRQ":{"text":"This is a great place to stay to experience New Orleans. It is in the center of the French","useful":2,"cool":0},"hBRWpdn-H_BOhqQ60E1dlA":{"text":"5 star location that loses stars for the details. Having said that, the location is so pri","useful":4,"cool":1},"xQ0dZYJbeAmI7F1NBCrRVg":{"text":"The hotel is just close enough and just far enough from Bourbon Street where it is easy to","useful":1,"cool":0},"rMj81MetLYOAXAC7twUVKg":{"text":"This is one of my favorite places to stay in New Orleans. We were just there for my daught","useful":0,"cool":0},"nD9qF1efwPzKAV1nGNGnKA":{"text":"I had the best 3 night/4 day stay at this hotel celebrating my husband's surprise 50th Bir","useful":0,"cool":0},"83zaa0-j8effTU-oKer8qg":{"text":"Do hotels not clean anymore?? There is dust accumulating everywhere! The crown moulding in","useful":2,"cool":0},"a9pdK5e9p80fBL2W0DdGJg":{"text":"My husband and I came hours away for an all inclusive paid stay complements of a company t","useful":2,"cool":1},"frFfFxHhL9QqPnJpciw2Fw":{"text":"This hotel is perfectly located in the French Quarter. Central to everything, we were able","useful":2,"cool":0},"yHZP_Dcj4MY-O9QRVB9gbQ":{"text":"I actually had a hard time eating this place :/ it wasn't horrible so I felt bad about thr","useful":0,"cool":0},"uH7_cvvSA3ePQHxzZSregw":{"text":"no real complaints about this hotel. very nice, service was great. i think for the price, ","useful":1,"cool":0},"L7558k_7r1uXkodG1g890w":{"text":"Decent hotel. We were very happy with it when we arrived. But all went down hill from ther","useful":2,"cool":0},"BS37O1C0coqEvmlj5oKw2Q":{"text":"Best hotel experience I've ever had. Was sad to see it end!!\n\nAfter discovering this place","useful":2,"cool":0},"cw8JDo5FU4ezvaq8kReFtg":{"text":"Great location. Very nice staff. Very nice pool. Nice room. Bathroom is weird. The bent tu","useful":1,"cool":1},"gdGZmQnvxQaXVFoEXLh5cQ":{"text":"Loved it. The ghosts were a little fresh with me, but I don't mind.\nStaff was lovely. Amen","useful":1,"cool":1},"o9_eIo4z8_TzicdPsCYq5A":{"text":"Service wonderful last stay was at Royal Sonesta and service was mediocre at best. Staff h","useful":0,"cool":0},"UH1vIoxhyKmWgFCkK_fcBA":{"text":"We had a fantastic stay at the Bourbon Orleans Hotel this summer. The rooms were perfectly","useful":0,"cool":0},"htg2Nojn4_st5ai2EPmnDg":{"text":"I paid the Bourbon Orleans Hotel 757.10 deposit in March of 2020 for a stay over the holid","useful":0,"cool":0},"y_o3xAfbpPfv2trVcRzAyA":{"text":"We have been staying here for over 30 years, so it has always been my first choice of wher","useful":1,"cool":0},"KHxiJalFN9SWDGPs7bV8rQ":{"text":"This is our second stay at the Bourbon Orleans.  We choose it for the location and style. ","useful":1,"cool":0},"T6hH2VhkYpMiKmJGVwMLOw":{"text":"We are flying in tonight and checking in tomorrow and I am worried to be quite honest.  I ","useful":2,"cool":0},"r0U7ddoD-Kewf9oSEJU8xQ":{"text":"It's 2 a.m. in the morning where do you want to go, the Bourbon Orleans? This long-standin","useful":5,"cool":3},"uk-pF4jdYWhC0jdOj-3ZsA":{"text":"We came here the day after Mardi-Gra for a few day vaca, and I was so happy with our choic","useful":3,"cool":0},"umZFg10JeJQAsGdoxZsmag":{"text":"Worst experience ever!!! Made request to check-in early one week prior to arrival. Please ","useful":1,"cool":0},"vzR6124H9jJV9yMA5mchGw":{"text":"Perfect location for French Quarter touring.  Comfortable and spacious room.  Easy to stum","useful":0,"cool":0},"lnAZ2VyvcFqhY1_4CPQLPQ":{"text":"I again stayed 3 nights at the Bourbon Orleans Hotel (4/14, 4/15 and 4/16) in 2015.  Just ","useful":2,"cool":1},"2FnJ2QogovnSiX5-iHc35Q":{"text":"This hotel has just the right amount of loveliness. Not too fancy, but beautiful in a simp","useful":0,"cool":2},"aDAHv3psqHbtF3xjYA1ekw":{"text":"Honestly, I've stayed many places and I've over paid for location. This hotel is in a grea","useful":2,"cool":0},"ohemsqAPSvAf-8novZ-M7A":{"text":"So let me say up front that this is an old hotel, but for the rate we paid I thought it wa","useful":2,"cool":1},"RStIKLUCmL9_xdjkF-GrLw":{"text":"It was under some construction  smell funny \nN no parking available I wish I knew this bef","useful":1,"cool":0},"s0NTgj28wKp_AgCV6r12ZQ":{"text":"Beautiful hotel. I may be bias because it was Papa Noel and the hotel was decorated as fes","useful":0,"cool":1},"K3-A3y9IS6HIAQrd97-aww":{"text":"At first I was so against staying here because of all the reviews about ghosts and hauntin","useful":12,"cool":8},"Ev89TFjj-wyPc4-itx1yJA":{"text":"After YEARS of dreaming about staying at this hotel, my hubs & I finally did for our 10th ","useful":2,"cool":0},"OZTQgaYmamqygEkDU92YnQ":{"text":"We had a three night stay here on our visit to NOLA.  The only issue I had was with our ch","useful":1,"cool":0},"JOVJ8Bn1wJUhv8kqBRkTmA":{"text":"I love this hotel. It is brain, historic, well-appointed with gorgeous decor and furnishin","useful":12,"cool":12},"nhD4HWh8lL2ODfAAq9zQAg":{"text":"I waited to write this review..my 100th one on Yelp, to coincide with a paper I was workin","useful":9,"cool":4},"DOsLfcPT-QRfs0n36xMrZw":{"text":"When we arrived to the hotel there was not a doorman in sight to help us with our luggage,","useful":3,"cool":0},"9qtOvs2CZtN3c7PFea0svA":{"text":"Had a room with orange mold in the shower, sticky bathroom floors, lube next to the bed, a","useful":0,"cool":0},"Pb3iOz0oC4l31oDOn4x2Mg":{"text":"Simply a great place to stay and the staff are always willing to help with a smile.\n\nWe re","useful":1,"cool":0},"JdVtcAO5Ggvu204jjMDQaQ":{"text":"My wife and I were here with our infant son from feb 25 to March 1st. We had a great time ","useful":0,"cool":0},"FhcLKo0rpRkYUJPry7UVXQ":{"text":"My fiance ended up being stuck in New Orleans during Hurricane Ida and we stayed at the Bo","useful":1,"cool":0},"p9Na65OxW8TG6t8R5hLeSQ":{"text":"Such a great experience here. Clean room, comfy bed, nice soap & best of all free drinks a","useful":1,"cool":0},"bYISU4voRLNxGGrb8fk3eg":{"text":"This property is beautiful, clean, well maintained, and in the most ideal location for wal","useful":0,"cool":1},"JKtaSJ8X3L5zXIAZkjsrGA":{"text":"Amazing location right in the heart of the French quarter,  between Royal and Bourbon stre","useful":0,"cool":0},"S27bCLX9hB0V2Z-uZScdCQ":{"text":"Regarding Breakfast with Santa at the Bourbon Orleans, a guest contributor from the family","useful":3,"cool":1}}