{"SkITsMSi-Qq0zTC3lwXjRA":{"text":"Please read!!! Tourist trap, Completely and totally overrated and completely did I say com","useful":1,"cool":0},"AXRd0km2RyJypHAUq_EF4g":{"text":"I went there twice in January 2012 while in New Orleans for a convention. The first time w","useful":0,"cool":0},"Zb-Lmsnx2TfjkNUnQCVgNQ":{"text":"Food was good. Home style cooking across the street from the Riverwalk. Had the fried samp","useful":1,"cool":0},"P988cwzFwS_9jHtD7dnPlQ":{"text":"Great atmosphere for family dining and dancing--even the littles were dancing all night!  ","useful":0,"cool":0},"tgxAQnnRBJqoMmRM1d23Ag":{"text":"This unfortunately was the worst place I've eaten in New Orleans. I gave this place a try ","useful":0,"cool":0},"PtmUaGRtNkn5otJaitLsKw":{"text":"Unimpressed, unfriendly staff with sub par food. Music was great and that is the only upsi","useful":0,"cool":0},"sl0WS_Po1aVExcnq1CPGYw":{"text":"This could have been even better than I expected but after getting a couple recommendation","useful":2,"cool":0},"_On-2-mPpyXET0ErzqMSXQ":{"text":"2 Dishes: Panéed Chicken Pasta and Grilled Chicken Pasta\n2 Bites\n2 Words: Life Changing","useful":0,"cool":1},"BxM6-babTvjXNDzFedeq1g":{"text":"Awesome catfish, and Stacy provided exceptional service.  First time here, and would recom","useful":0,"cool":0},"w_M3Qq5irnnf9jPm1c0pdA":{"text":"This was one of the worst experiences I had in New Orleans. Our waiter was worse that bad.","useful":0,"cool":0},"8l5Qv0MQVw-soya6xC7I9g":{"text":"Me gusto el ambiente, la atención, los platos y los precios, en contra que cierran tempran","useful":0,"cool":0},"kE1BeTGyypE5v87ISriVlA":{"text":"Mulates is a place I seem to end up at almost every time I'm in New Orleans. The Po Boys a","useful":1,"cool":0},"FKswAAriGKpW_0HVrtt6Dg":{"text":"The service was above par! I love Jeremy at the bar! Very attentive and good at multitaski","useful":0,"cool":0},"T-QlS0tTRIOuUbFChu29rQ":{"text":"Not terrible but for the price the food was bleh. It's a shame that in such a prime locati","useful":0,"cool":0},"bHe-T5qMrDBSk1SDnWNpPA":{"text":"Service was fine but the food was less than good. Four adults and all of said we wouldn't ","useful":1,"cool":0},"WbecmuBw8ANNSRv0r_RZFg":{"text":"Delicious food, unfortunately overpriced but it's about a block from the Convention Center","useful":1,"cool":0},"9x_28uZwDKPL4gGQp9qmTw":{"text":"The food here was ok, but our service was great! I'll start with the food: most of it is f","useful":0,"cool":0},"P9x-a8NLlAfPUqDqM4mpLA":{"text":"Decent food but clearly targeting tourists as there were TONS of out of towners. We came f","useful":0,"cool":0},"r5nLWEHGLBnucKIgFZJxXQ":{"text":"Alligator appetizers and Albita draft beer. Great location..main courses so-so.","useful":0,"cool":0},"AysD0s6ZMrNl7lqApdXBwA":{"text":"We came in here because we had a conference across the street. We ordered an appetizer, ou","useful":0,"cool":0},"BrSMHjK9fwPNKigNcOCjjg":{"text":"I was excited to eat some Cajun food and after a quick research I decided to go tot this r","useful":0,"cool":0},"wpB4O_fsm_D01VbhHJgqIQ":{"text":"ok. Maybe I would have over looked that the food was a bit too salty, maybe I would have o","useful":1,"cool":0},"ypQZasNjcc1ecdaO_0FhJw":{"text":"Best meal we had in New Orleans. My husband ordered the special of the day called blacken ","useful":0,"cool":0},"LqX2mrN_eB1kCOsPvlsMbQ":{"text":"Tourist place ok food, not a place were locals may go. but you'll a  decent time.","useful":0,"cool":0},"4V2xSivUH6e6ge0jSzN-xQ":{"text":"Came here for lunch because it was near the convention.  The food is okay, but not that go","useful":0,"cool":0},"evB_7ABXG4S2Yrvp-zWx1A":{"text":"Service was bad. Do not order the coconut mojito! Re-ordered another drink and it was NEVE","useful":0,"cool":0},"Elg5nvSDIjXKnTTc6zEaMg":{"text":"Our waitress Jaimee was sweet & fast. she was also very attentive. Food was delicious and ","useful":0,"cool":0},"dMgLMW7I3CLGTMuhl4stpw":{"text":"One star: because Yelp will not allow Zero!! Slow service even at the bar, poor service , ","useful":1,"cool":0},"cxEBsQswGK_XpIFtTiPgaQ":{"text":"Total greasy spoon tourist trap. The people here are so freaking nice they deserve a menti","useful":0,"cool":0},"Xw3kBLdDVRoC1STB4-NHig":{"text":"We stopped by Mulate's because it was conveniently located near the Port of New Orleans, w","useful":0,"cool":0},"3-CYr53SjF20bN9WHsit1Q":{"text":"7 of us went to NOLA on a vacation and had Multantes for lunch.  Our waiter was one of the","useful":0,"cool":0},"qa7nOkQJIKMh6kbbK5Ss7w":{"text":"Highly recommend!  In a four day trip I had the crawfish etouffee twice-- it was that good","useful":0,"cool":0},"U46kd8InDwwAx1bZm_z57A":{"text":"The restaurant was mostly empty even though there was a very lively band.  The grilled gat","useful":1,"cool":0},"1bk_zgFIQcjJEmGuYr7vGg":{"text":"We only stopped in Mulate's for lunch but it was delicious!  Locals recommended dining the","useful":0,"cool":0},"1s-3mUWitUeNT1_BYIIZnQ":{"text":"Came here for a dinner around 730 with five other people. We were sat right away which was","useful":0,"cool":0},"MyXtz1Y4KJKrCbtfmqxJjw":{"text":"Really good crawfish étouffée. Very tasty and strong Virgin Island Painkiller if you like ","useful":0,"cool":0},"wXBQv_TUJHfS342Qz8t-3g":{"text":"If your trip takes you by the convention center, warehouse or lower garden district in NOL","useful":0,"cool":0},"4SnCDoPtob5b68mDiAJ-EQ":{"text":"The quality of the food and service is not worth the value of it. The jambalaya wasn't goo","useful":0,"cool":0},"JVMx4t5iVUxXiBYTO7SczA":{"text":"The bread pudding was very delicious! The alligator was very good! Twice baked potatoes ar","useful":0,"cool":0},"t8ad3vLFEXm04DeqxJkHeQ":{"text":"We get there (party of two). We see empty tables with four chairs. We are told the wait is","useful":0,"cool":0},"M4n0TYNclLQOxkAuES-amw":{"text":"Food was not good and seafood was room temperature. Waitstaff didn't come by to check on u","useful":0,"cool":0},"nOPTtc5hA0WvgjXrDuQYoA":{"text":"This is a must for anybody traveling to Nee Orleans. I recommend that you go at night when","useful":0,"cool":0},"q39tGHvo4UAg1lcxxG-eNw":{"text":"Food is good. Grilled Seafood platter is our favorite. Good service. We mainly go here for","useful":0,"cool":0},"IepnuXXOkB6FMNJuMPe19w":{"text":"This place had pretty good food and big portions! We had a fried seafood platter and split","useful":0,"cool":0},"KXfOgVA1emaDZVeQ11yNNA":{"text":"We checked into our hotel in the Warehouse District and Mulate's was our place to eat for ","useful":0,"cool":0},"CFO5bW5Lvj-B8yhL_IAKeQ":{"text":"Great local food recommended for lunch definitely. Red beans and rice with meat is a heart","useful":0,"cool":0},"jXUEWiirq_TFMlJTpAdGsQ":{"text":"Family friendly and delicious food.  We had three adults and two kids in our group having ","useful":0,"cool":0},"rkeNQwRoohcHm-zYDkkr-w":{"text":"This place is over priced, the service is terrible, and I was not blown away.  Each member","useful":0,"cool":0},"NXnXd4uTvXvNTGQ-V4Zz_A":{"text":"Great food great service, and to top it off our waiter Jeremy was sooo AMAZING!  We plan o","useful":0,"cool":0},"KzE2pk01Iv8DWA-2d3-BWQ":{"text":"This place was amazing. The fried gator and stuffed catfish were to die for. Must stop by.","useful":0,"cool":0},"6kvIl0TQ3lHgLupP9UkveQ":{"text":"Went with a group of 5 and after a 45 min. wait we were seated. The service was good for a","useful":1,"cool":0},"WmErhxdfWjh6Qni9-nSa7Q":{"text":"I love gumbo and my bowl was large and packed with flavor.   I added Louisiana hot sauce a","useful":0,"cool":0},"IwP-BeRzTVUp2wNXP72bYA":{"text":"Food was just ok. Servers were friendly. Everything seemed jumbo sized, including the drin","useful":2,"cool":1},"_eeLBvuA4zubs0px3z7wQw":{"text":"Food tastes good and was plentiful for my friends and I in regards to what we ordered. The","useful":0,"cool":0},"Tv-U8lESfyjO7xVKFKuIbA":{"text":"Terrible surf and turf. Weird place!  150.00 for 3 people.  What was good was red beans an","useful":0,"cool":0},"63QUYQ0TdgBnIRFVDMc4AA":{"text":"This is an awesome place in New Orleans! They've been around for quite a while and it's lo","useful":0,"cool":0},"44mA3yz4gv3MRvtDYx29Kg":{"text":"After reading Tony K's BRILLIANT review of Mulate's, I'm more convinced than ever that peo","useful":2,"cool":0},"qRCj8KjnTIe1WjBm8eUoiA":{"text":"Delicious homestyle cooking. \nI had the Mulate's Muffuletta and it was full of flavor and ","useful":0,"cool":0},"t9DWGCnO0lQisGG2dhQNeg":{"text":"Not impressed by my experience at Mulate's.  Was in town for a friends bachelorette and we","useful":1,"cool":0},"ttO1PDO_AT0Ozpee7BLT4w":{"text":"Our first visit to NOLA and this restaurant was recommended to us by the hotel staff at th","useful":0,"cool":0},"uK2LB3VsMidf_r9hUdBi0Q":{"text":"Sooooo delicious that I have to hurry up and book my flight back to New Orleans! Stayed he","useful":0,"cool":0},"KrAdoCmBDnAucdxRl_QPrw":{"text":"Straight Fire Fam\n\netouffe strong\ncrawfish strong\ntwice baked potato strong\ncrawfish au gr","useful":0,"cool":0},"w_Io0y7Zn8ZhOw7Cn-rT0w":{"text":"Loved this place! We wanted good creole/Cajun food. Service was great and food was delicio","useful":0,"cool":0},"u9hBaxhlngOFcYRlcNMHsg":{"text":"Blackened redfish was a little overdone - still good.  Not the best seafood but fun place.","useful":0,"cool":0},"HXmoNpskmC7NB94E8dt9MA":{"text":"Not impressed at all. Gumbo was served warm and was very watery. Not worth the price.","useful":0,"cool":0},"xYB5EpOtyNZTJEbWl7asdQ":{"text":"Stopped in through a recommendation from our hotel. Wanted authentic local cuisine. Ordere","useful":0,"cool":0},"xFB3gH7Gc5DekB8aeMxFcw":{"text":"It was a party of 9 i was a part of.  We all loved our food.  I ordered the triple shrimp ","useful":0,"cool":0},"Y3veStFpUKiwwkWTFyjjLA":{"text":"The food was okay however the prices wasn't. The quality and quantity don't match the pric","useful":0,"cool":0},"6R5MkQwg3mPkpSYSWaLU7w":{"text":"We have liked Mulates for years when visiting NOLA.  The food is consistently good and the","useful":0,"cool":0},"xuULuH_N8E8s7JcyqdY1Sw":{"text":"I thought this restaurant was so amazing that during my 6 day trip to NOLA, I ate here 3 t","useful":0,"cool":0},"hQEwRVuYENBpC9ndq6S_LA":{"text":"I ordered the stuffed catfish. It was better than expected!  Coleslaw was yummy as well.","useful":0,"cool":0},"JjEbEuDQHs7s55TPeb3hrg":{"text":"Mediocre food, but a great open dining room with live Zydeco music, dancing and family-fri","useful":0,"cool":0},"cJAArHfrS1A-RZ-OTyqo1Q":{"text":"Best food we have eaten in NO so far. Blackened grilled alligator chunks and grilled ouste","useful":0,"cool":0},"eFWbYv5Br7glMwGsMCOz1g":{"text":"They were great for handling a large group of chemists, there was live music and dancing, ","useful":0,"cool":0},"7mnmYsaZ0pXo61fic2CYjw":{"text":"It took us almost 2 hours to get a table even though there were plenty of open tables. The","useful":0,"cool":0},"ne6mVO-NNxsUmwEq3QcSaQ":{"text":"Touristee.  Over priced and not that good.  There has to be better places in this town tha","useful":0,"cool":0},"EcRBEv0iB3UH68QlcFOkYw":{"text":"Good place for lunch. Caters to the tourist crowd and does a nice job of serving up the re","useful":0,"cool":0},"zSMNXKHqeimOjhyXzPzeNw":{"text":"Disgusting: the shrimp gumbo (along with crunchy rice) and the muffuletta were both really","useful":0,"cool":0},"3VXQPgUeuNAc1ePpsZqQ2g":{"text":"Eating here was definitely a treat!! We ran across this spot and decided to try it! It was","useful":1,"cool":1},"Xm1BZ_y_foR-ykNEns0OQA":{"text":"Service and food were nice and fast but holy moly this place over priced for absolutely un","useful":0,"cool":0},"iPMYE0iKZO8e9Vlf5yiawQ":{"text":"The music was very loud and the food was decent. A little pricy but it was late and local.","useful":2,"cool":0},"SHEqk_fE-tiy21Hy7xUjaA":{"text":"Terrible food and price outrageous, seafood gumbo had the odor of a liter box. The mushroo","useful":0,"cool":0},"mU-JleOd3sZ6cqikLLOMPw":{"text":"Food was overlooked, soaked in oil and wait staff mixed up our order. Finally, although th","useful":1,"cool":0},"oZbZ5AIS6K1-MrNo5aikPQ":{"text":"I came to New Orleans on a quick weekend getaway.  My friend found this restaurant and we ","useful":0,"cool":0},"b12zLqP8TQqE6fMocAFCWA":{"text":"Zydeco meat pies a bit dry but the side dip was good \nJambalaya was average over cooked sa","useful":0,"cool":0},"rfXfCBzTX4uHLUpLSb_uvA":{"text":"It,s been almost two years since I've been there and still crave the gumbo. On a motorcycl","useful":0,"cool":0},"dxEPHD1xeVlksW6VrO6xyQ":{"text":"Staff was really nice. Waitress was super friendly and informative. Food was good. Very co","useful":0,"cool":0},"Iq46NxM5-k4yrwKWmLN9bQ":{"text":"I resent that I have to take the time to type to leave a one star review after paying all ","useful":0,"cool":0},"OprUFfFC17FYJ_zRV23OUQ":{"text":"I spend about one week out of every month in Nawlins training reserve divers over at the N","useful":0,"cool":0},"ZNMDlziCzx89XWZzJAFMaQ":{"text":"This place is exactly what Yelp´s 3-star review says: A-OK. \n\nMy favorite aspect of this p","useful":1,"cool":1},"jqiv6j2Ma4yvG5_6hZa5hg":{"text":"Huge disappointment!  $18 poboy.  I've had a $6 that was twice as good.  Way overpriced an","useful":0,"cool":0},"1LneJuG5E2J3ZR2k4KxigA":{"text":"If I could give zero stars I would. We were seated and no one came to take our order at  n","useful":0,"cool":0},"ctTbzDaCWcsZyytIZvWcbg":{"text":"convenient for anyone staying near the convention center.  the grill was out the day i wen","useful":0,"cool":0},"RdeRzgc7Iku1BiAE29CfeA":{"text":"I was really looking forward to having dinner here- my husband has told me over and over h","useful":0,"cool":0},"kxQ4urzh6zNL3HbPFKHyMQ":{"text":"So, if my colleagues found out that I gave this place 4 stars they'd shoot me.  We were in","useful":0,"cool":0},"U16WM4G21s3QlR7TC2rSSA":{"text":"This place is awful. The bar doesn't take debit cards they only take cash or credit cards.","useful":0,"cool":0},"-VpOArqwiqwA-1WnIxYHUw":{"text":"Pretty good restaurant near the convention center.  We are staying at the Hilton, and it i","useful":1,"cool":1},"1Fi0NRwP8_7ylyGLIOnE6A":{"text":"Food is disgusting.  Do not go here. Made for the masses, vintage fresh and very unhealthy","useful":0,"cool":0},"0gbMpz7j0vmeQLO6Mp_rSA":{"text":"blech. salty. over-priced. etc. my dining partner said, \"i would make myself throw up,  bu","useful":0,"cool":0},"8UeWLGVRn9nh4culxvlk-Q":{"text":"I arrived right after they opened to eat lunch.  I chose to sit at the bar, as I was alone","useful":0,"cool":0},"4QjnXNB_C8GGygQPhoICpQ":{"text":"Low quality food with a high price tag that is the enemy of vegans and vegetarians alike. ","useful":2,"cool":0},"jLKQQ8c6vu6evFkwBPBk3w":{"text":"The beans in the jambalaya was burnt.  There was also something burnt in the gumbo.   I du","useful":0,"cool":0},"xi-boHVOKZd8Ieh-dqAyYA":{"text":"Poor service, mediocre food and way to high prices.  Avoid this place at all costs!  Try M","useful":0,"cool":0},"Yv3C8qANG-6Sl8V3kJNW0A":{"text":"I hate to say A-ok.  Great food, but the service ruined my meal.  The waitress was inatten","useful":0,"cool":0},"k4FdR0NXiuiPA2E033ooxQ":{"text":"I was here for in New Orleans for 5 days and ate here twice, granted the 2nd time I went w","useful":0,"cool":0},"y8Uu0hU_ZmBvaGJ9CyRenA":{"text":"Great music. Tasty drinks. Icky food. Totally mediocre. In a town full of crazy good food,","useful":0,"cool":0},"Reoa27m8hpdwo8pMBcl1sw":{"text":"The best restaurant, in my humble opinion. Mulate's is always my first stop when I arrive ","useful":3,"cool":0},"6L8M95fGxkiVbWLNCVqR9A":{"text":"Mulate's was the first restaurant I ate at upon arriving In New Orleans for the Essence Mu","useful":0,"cool":0},"qpc9CSykfMVWhC6wzoQ0uQ":{"text":"This was one of the best meals I've had while in town.  The service, oh the service was on","useful":0,"cool":0},"4HEXFTWJZq9-nKXRzjRHRQ":{"text":"Oh, boy! Fried catfish done as it should be, and red beans 'n rice.  Great meal.  Don't be","useful":0,"cool":0},"JM01hkfL_FPhRiCwurOV8Q":{"text":"This was my first meal in New Orleans. If I had had my way we would have eaten there every","useful":0,"cool":0},"ErPCEmqXt0196Qq2gMTuTw":{"text":"This place is a noisy, overpriced tourist trap. Located near the convention center, most o","useful":0,"cool":0},"gplf8CWTIleu1R8jS_Islw":{"text":"I've been to Mulate's twice. The first with my wife and just recently with my daughter. I ","useful":1,"cool":0},"GH4Nnhg9I2OMkTPnCnwh9g":{"text":"This place is great. Recommend by a local and we had great food. Listened to the band and ","useful":0,"cool":1},"ZKOX-rXkrloiZ1hacqiyxg":{"text":"Had a fun time at Mulate's restaurant on Monday night. Ivan, our waiter, was attentive and","useful":0,"cool":0},"X_PPTM-TREqHoXvRVxTa2g":{"text":"We came here to get a taste of some traditional New Orleans food and they did not disappoi","useful":0,"cool":0},"lud9wtimgsvJpmshxOSeQA":{"text":"All the food is fried and everything tastes the same.  Wait staff will up-sell everything.","useful":0,"cool":0},"YHBgrUqpbLtsvKXAqJVsYg":{"text":"I give it a 3 because the service was good. The food was very mediocre and not worth the p","useful":0,"cool":0},"3J4Ooz-hN1Gi1nXPHmEtSA":{"text":"Food was delicious and everyone humored me by trying alligator bites.  Most had thumbs dow","useful":0,"cool":0},"cvo1z1hLBry375_PqMZ66Q":{"text":"Fun dinner here, musicians playing fiddle and an accordion created a good vibe. I ordered ","useful":0,"cool":0},"JOfuHv5ctNygGUrp1SzhJw":{"text":"Very disappointing and over-priced!  The only redeeming factor was the Zydeco Bread appeti","useful":0,"cool":0},"nqgTO2nOix5pkLFVCUaRhQ":{"text":"Maybe it's not fair to write this review now since I ate there about three years ago. But ","useful":1,"cool":0},"PoeBbpeA9N1CEmACndjy8w":{"text":"I am from out of town and wanted to bring home their awesome Cajun sausage. The waiter at ","useful":0,"cool":0},"H6NGdWipKXoMJeg1QohNOA":{"text":"It's not the best food in New Orleans, but if you want a fun place with Live music, this p","useful":0,"cool":0},"bcZ08FXEGITauIgVQJm6KA":{"text":"I enjoyed my whole experience here. It was a busy Friday night and with most new places I ","useful":1,"cool":1},"OVT8NfJZbPG33EBc0_j4Cw":{"text":"This is the worst place I've had oysters. They were called smoked oysters but I got more o","useful":0,"cool":0},"NCZnZCqqbYGctm5wAZmsng":{"text":"Food was good, beer was good, service was good. Lost a star because signage leading to the","useful":0,"cool":0},"WfSbqmDdOxykc_9Hidm-bQ":{"text":"Seafood platter was delicious, jambalaya with andouille sausage also very good!  Worth a s","useful":0,"cool":0},"XtyUOsGaiweqVn3fKS1lWg":{"text":"Came in and sat at the bar. The manager handed me a menu and first I see is disgusting foo","useful":1,"cool":0},"7CjW56-j6nBON-v_E1DDyg":{"text":"This place is way OVERPRICED!! Food is so so, definitely not worth the price they charge. ","useful":0,"cool":0},"8wvn3DJcAFqhZi47gakroQ":{"text":"The food and drinks were ok. Not worth the price. A bunch of extra charges for no real rea","useful":0,"cool":0},"lIMdxD1lFQgO8Z3sTVOaBg":{"text":"This place has Okay food，but the service... oh boy. This is just unbelievable. The waiter ","useful":1,"cool":1},"0EAXmEnClQ9Mpu3ZeUtzlw":{"text":"Server was friendly. We ordered both gumbos, gater entre, and kid's shrimp alfredo. Both g","useful":1,"cool":0},"PIr35d1N_uVh3zBAnDJfzA":{"text":"Please don't eat here and think that this is real New Orleans food...  It is a very commer","useful":0,"cool":0},"nDgKJ3cM3vq_cSbaz5WPPw":{"text":"The best French Muffalettas I've ever had in all these trips to NoLa. Chisesi ham, Genoa S","useful":0,"cool":0},"IW1WibLv3XWWyThQXr45xw":{"text":"Great restaurant, close to where we stay with good atmosphere,  music and food!\nThe servic","useful":0,"cool":0},"lFrCdvstB0fRlNQpmkKlKg":{"text":"The place was less than half full and the hostile hostess would not seat three of us at a ","useful":0,"cool":0},"xdIkzSHapwkcALXx1MP2ig":{"text":"The jambalaya here is great! If I came back, I would just do a jambalaya entree. We decide","useful":2,"cool":2},"hoz9NyQnui0RflsC3dk1GQ":{"text":"The seafood platter appetizer was alright with a wide variety of flavors like alligator an","useful":0,"cool":0},"ntfO3HmTXfZkmL5bY2BCZA":{"text":"Mutates is right next to the convention center and good for large parties, the restaurant ","useful":1,"cool":0},"VG5hXFv1X8MroajJ_I-85Q":{"text":"Great atmosphere with live music. The food was good not exceptional but glad I gave it a c","useful":0,"cool":0},"rIwiUnCDGlPwqhzsvyHspg":{"text":"I ordered the Crawfish Etoufee.  I thought it was wonderful.  At least it wasn't something","useful":1,"cool":1},"MTFBRE1EUQO2VUqa8PyJZw":{"text":"Ribs came out cold, returned them and came out cold again.  Manager brought fresh ribs out","useful":0,"cool":0},"UJc82AdQgUaGExjP_j2Z8A":{"text":"Good typical Cajun / Creole food. Good drinks. This place gets packed in the evening but n","useful":0,"cool":0},"1avmYJtDnAu55RRtMWCA8w":{"text":"Food was okay, but the prices were outrageous. The service wasn't good, and added an 18% g","useful":0,"cool":0},"4SwNmDG4psbON0rRKAlQSw":{"text":"I have a very fresh shrimp remoulade po'boy....a perfect complement to a ridiculously heav","useful":2,"cool":1},"3h7v9GvjV-t1SvziZtq0Tw":{"text":"It was early afternoon and we hadn't eaten do we stopped in here since it is very close to","useful":0,"cool":0},"7HpjDzxKX6wWB3zCDde2Sw":{"text":"Table for 3. Was super empty and then the jazz band played, families rolled around, and it","useful":1,"cool":0},"wl0mQTJKs_hR7XCXqJzdlw":{"text":"We came here for dinner.  There were a lot of families and high school students, probably ","useful":0,"cool":0},"mB0rkeJQtFzd-oSt0w5Ohw":{"text":"Ugh. This place is awful.\n\nMulate's, first impressions are SO important.  You should think","useful":0,"cool":0},"4WvwUs1ZumTjgliEP65uIQ":{"text":"Came here on Sunday 3/2/14 during Mardi Gras parades. Even though it looked packed walking","useful":0,"cool":0},"uxEChJwS0KC-mmk3P4nt9Q":{"text":"The food here is really good but you will pay to play. I had the shrimp jumbo which was ex","useful":0,"cool":0},"itOAylWCVX81svZ0ishbHQ":{"text":"Mulate's is what it is -- cavernous, down by the convention center, a little pricey and ai","useful":0,"cool":0},"B7pdYTI8hqAx1zUx5OCUBw":{"text":"For being in New Orleans this food is very average, seems like a touristy place because it","useful":0,"cool":0},"9_rzT-Y_MUMogKnneRIYAw":{"text":"Good food and a very friendly staff. I also had my service dog with me and they treated us","useful":0,"cool":0},"R5_5hVgtZaC4ahBlh5RdPw":{"text":"Gumbo was great. Classic, not some variation on the original. The crawfish etouffee was go","useful":0,"cool":0},"4ooYMU-7dbUqCmo3QaDtwA":{"text":"Great food, great staff! I had the crawfish étouffée. It was the best I've had in NOLA!","useful":0,"cool":0},"OfK79fnYoxtl-4FlGlulVQ":{"text":"This place was expensive, and they add gratuity for 5 or more people. It was me, my hubby,","useful":0,"cool":0},"SEnHxB9xo0ALeK5OmaKiNw":{"text":"I was drawn in by the crowds, the bright green awning, and the Cajun music as I passed by.","useful":0,"cool":0},"3xsKx8QOWjhrFg57oqPrSg":{"text":"Not a great experience. The server did not have a very good attitude and there was a smash","useful":0,"cool":0},"8jEJMdpiKdCkK8-U9Comyg":{"text":"Mulatte's was the first place we ate when arriving to NOLA.   We came here based on the re","useful":0,"cool":0},"iiSE2ZTZqpvhwqlGr96sSA":{"text":"Live music. Cajun fare. What more can you ask for? It's a big, open layout establishment s","useful":0,"cool":0},"Aee2-yOxKFB1bUpYixIRCA":{"text":"Often times, after a big meal, I experience some sort of feeling of regret. That's not alw","useful":0,"cool":0},"3anznLuaz5fR8CvRpJveAA":{"text":"\"Disappointed\" is how I felt after dinner at Mulate's. The night started out with promise;","useful":0,"cool":0},"_Sx6jKIcl9n14UcvfQT9og":{"text":"I give this place a 3 on the basis of the sandwiches alone. But overall it gets a 2.\n\nServ","useful":1,"cool":0},"ajwVQM1N4F-Vm6XnzyGSPg":{"text":"Horrible service!!!  While we were seated promptly at our reservation time, that is about ","useful":0,"cool":0},"KRj8Cg78cmWks7YoYRUkyw":{"text":"Mutate's has good food for sure, but the cost is a bit much.  The restaurant is very tight","useful":0,"cool":0},"gQ58ZR4qN1xnLsKcdtQZnQ":{"text":"Went here with a large group, but that didn't phase the wait staff. Everyone enjoyed drink","useful":0,"cool":0},"FK7NkXX6JmD3xXjBof1VcA":{"text":"Our hotel recommend Mulate's for our family of four and since they do not take reservation","useful":1,"cool":0},"HuvdctwYHoUOKuMTcch3MQ":{"text":"This place has some of the best food in the city in my opinion. I've been there three time","useful":0,"cool":1},"IaYYeEbJNA9dbpC-lEUJqw":{"text":"I've been hooked on Swamp People so i decided i wanted to eat some alligator & frog.  Afte","useful":0,"cool":0},"Wns7LzVTa0fiRUN8QmFogA":{"text":"We went there for the 1st time while in NOLA.  The staff was very friendly and took care o","useful":0,"cool":0},"UJWCmd0e8m9UmpRJtHnFGw":{"text":"Gumbo was fine. I had red beans and rice and was disappointed it was very thick and not a ","useful":0,"cool":0},"lwp0lEeT3m42BIsRqMjDIg":{"text":"Wow, averag of 3, surprised at this.  I really like this place. I hadn't been there for ma","useful":1,"cool":0},"cGE98MBmWcqmvui7gAnvlA":{"text":"Food: 3/10\nService: 0/10\nEnvironment: 2/10\n\nI feel so bad for the owner of this restaurant","useful":2,"cool":0},"jujlBSFOyhqeRiZa65pZ9g":{"text":"Tasted good but I got food poisoning. I'll spare the details but while the music is fun an","useful":0,"cool":0},"HeGm7dq71C8uY0ztpmmhxQ":{"text":"Mulate's is a restaurant with an elaborate menu and an interesting atmosphere. We had an a","useful":0,"cool":0},"IvvFio9KF_ntUlDv8DF8tQ":{"text":"I would give this place a 5 star rating just for the service.  We ducked in here to escape","useful":0,"cool":0},"jhXauhN79fsjkaQbIfoWuw":{"text":"A bit pricy but was delicious! Would eat here again for sure, friendly service and good at","useful":0,"cool":0},"2GX_sHfXZuKtdxC8-6lfPQ":{"text":"Music was great. Did not appreciate being told we could not sit at one of the tables in th","useful":2,"cool":0},"ODkbjmoYsN8gHqaHQZFobQ":{"text":"The meat pies for an appetizer was good.  Fried alligator was the entree I got. For 25$ th","useful":0,"cool":0},"ljna1INVw-QuRSQe1pfdBA":{"text":"Food was great, atmosphere was great, and music was good! Not my type but it sure does go ","useful":1,"cool":0},"XodpXQWBBCIsVKRcQs62UQ":{"text":"It's overpriced for what it is, which is to say, a tourist-focused restaurant located righ","useful":1,"cool":0},"60H86nMOu3jSvIgdqEf3Jw":{"text":"Tonight we had a private party in Mulate's banquet room with approximately 100 people.  Th","useful":2,"cool":0},"wM3t2aMa2BGUiqTAJ63yUA":{"text":"Had the Mulate Cajun Platter.  Only the catfish and stuffed crab were warm.  Not hot, warm","useful":0,"cool":0},"qv7PWBTezs0Dflem7AB6lQ":{"text":"I got a good first read about this joint. The place was clean, the staff was polite, thoug","useful":0,"cool":0},"ji3ozGf0RYAA2N2zhoJb_Q":{"text":"Okay food, pretty pricey all things considered. Fun atmosphere, but I'd recommend a couple","useful":0,"cool":0},"mkxU7yYy59NDdi9CfhRjCQ":{"text":"I first dined at Mulate's several years ago and absolutely loved it. Brought my new wife t","useful":0,"cool":0},"MvrBmh_I6L4W_Sh9lpzkUg":{"text":"I've heard mixed reviews, from my friends, about this place. On a Monday, between Mardi Gr","useful":2,"cool":1},"6zWxujESTI_7ybZZvpnFpg":{"text":"Mulate's was the first place I visited on my very first trip to New Orleans, and was the f","useful":0,"cool":0},"JP3blbzTmmzNcnIyE4yeNw":{"text":"If this place didn't have the live music it would be 3 stars. My daughter loved the music ","useful":0,"cool":0},"4SHM8h53VgYi3thIBlesBQ":{"text":"I came her on a weekday. It was the afternoon and not busy. Service was kind of slow. The ","useful":0,"cool":0},"RjSyzLrDLR8J4KFVH37lqw":{"text":"Between the 4 of us we all had something a little different and it was all fantastic! My c","useful":0,"cool":0},"FM4SWBiLl4RYotUTba0npA":{"text":"We had mixed reviews on this place. My wife had fried shrimp and they were very good. I ha","useful":0,"cool":0},"33Zl2Tg7kvx4_CqWihybzg":{"text":"Very convenient location to the convention center. Came in for dinner after the Realtor Ex","useful":0,"cool":0},"Cc5WotaYp3ELSV4a5bI5LQ":{"text":"The food I had was really good. The seafood gumbo was my favorite of the four I tried duri","useful":0,"cool":0},"55ywwUYCmhPoeb55AtpgQg":{"text":"Decided to drop in while attending a conference because it's across from the Convention Ce","useful":0,"cool":0},"jm_C9S39FPUjJnDK1dSRkg":{"text":"Service good, food less than mediocre especially in relation to price. Ambiente more like ","useful":0,"cool":0},"V9EjLzmeXd9sOpSXO2Gcag":{"text":"I never even got to taste a drink at this place. When we arrived the host was very polite ","useful":0,"cool":0},"AHg_e_l0PZ11yGoCxD8nDw":{"text":"STOP!   Was referred by a local to eat here. The price was high especially for the food th","useful":1,"cool":1},"J3DAbV3UUmEiuKDdHxBucg":{"text":"Seafood gumbo & house salad. $19 what a joke. The gumbo was a soupy mess with not much sub","useful":1,"cool":0},"1ZNcNlLDCZgFnOxCNtr2Tg":{"text":"This is an unfortunate representation of Cajun food. I visited this week after eating ther","useful":0,"cool":0},"_6Vtf6MQTrwbecp3BdI_OQ":{"text":"Try to get there a bit earlier, because you will have a hard time deciding what to choose.","useful":0,"cool":0},"_VT7YuN41OxcL3v5rue-1A":{"text":"This was the low point of our week stay in the NO. This is not the level of establishment ","useful":0,"cool":0},"aKH5coxaoEjl7wCHqr-C5Q":{"text":"While in town on vacation,  my wife and I grabbed dinner here on the night we arrived. The","useful":0,"cool":0},"ir1rYxJ8KGe_ztDxWmI8uA":{"text":"The best reastaurant in its category in new Orleans.\n\nMe encanto este lugar con música en ","useful":0,"cool":0},"5ZLuloKX1tMKO56NQGkqzw":{"text":"Mulate's is not much too look at, but you won't be disappointed if you give it a shot!  Ve","useful":0,"cool":0},"WMKrehJ4WnZr9bF1QEA0Uw":{"text":"Mulate's is a fun, casual place pretty close to the Morial Convention Center. Quick and fr","useful":0,"cool":1},"ZYeh5a9zUGP9qxEVjrKynw":{"text":"Literally the only non-tasty food I had in this awesome city. Everything is below average.","useful":1,"cool":0},"3pTFqA7NWk_AGPAmfQYlAQ":{"text":"Pretty disappointed with the food and especially the prices.  Extremely overpriced for the","useful":1,"cool":0},"crB6zsJGdFFGnA9eidzclQ":{"text":"I enjoyed the vibe of the place and the host was pleasant but unfortunately our server was","useful":0,"cool":0},"Oy2J4aHZ8NrTsT_unsnWcA":{"text":"We ate lunch here and it was okay...not great by any means but decent. Their seafood gumbo","useful":0,"cool":0},"eYAXHB59UcAZZzEH5Hg24g":{"text":"I was so full after eating here. I straight caught the itis! I'm so glad I was riding on t","useful":3,"cool":1},"hzZKPFZmV9pmFFjTo5LJmg":{"text":"I'll start with good part: there's live zydeco music and a large dance floor.\n\nThe rest: s","useful":1,"cool":0},"BPUAf7u4xX4CddFyvEd6NA":{"text":"The food is good but the service was terrible.  I was staying at a nearby hotel and stoppe","useful":1,"cool":0},"st9s0wsB06IRtaJJkwwUIQ":{"text":"I don't quite understand why this place only has a 3 star rating because everything that I","useful":0,"cool":0},"gPEzHm1JcyTvlm6bDTHnyw":{"text":"I tried this place during a previous visit in New Orleans. The service was less than stell","useful":1,"cool":0},"GltFVvhQV8PkbSlbYA6sBg":{"text":"Passing through New Orleans on business and this was recommended to me by the front desk. ","useful":0,"cool":0},"3bG0c4d78bGG_FnxzRHOcg":{"text":"My husband and I ate here last time we were in New Orleans. He ordered the fried seafood p","useful":0,"cool":0},"mu9CM5won6qZW7xyfKwwsA":{"text":"This is a great spot for everyone in the area! Service was personal and the atmosphere was","useful":0,"cool":0},"MD7z-YWjwqbymE3c52UJIw":{"text":"Seriously this place is awesome! We enjoyed all of our dinners!!! Very friendly!!! Highly ","useful":0,"cool":0},"_uCVTVIGVOtxtJTvvFBNuw":{"text":"Our bus tour guide pointed this place out on our way back from our plantation tour.  And i","useful":0,"cool":0},"vzo0MRNfSpUGNjKxu_GPsQ":{"text":"Horrible. Just horrible.  \n\nWe came here as a party of 4. Two adults and two children.  Ou","useful":4,"cool":0},"9SNp5fiAq9g8NOezt2Ci9g":{"text":"Wow! Outstanding meal and service!!!! Tried blackened alligator as appetizer.  The only wa","useful":0,"cool":0},"spIBBddAoly_INpc6353ig":{"text":"Shared the Crawfish Poboy with the wife. More than enough and the flavor was fantastic. Gr","useful":0,"cool":0},"9BZr_-dy0POGjalCCakRFw":{"text":"We tried this New Orleans \"classic\" restaurant, and I was underwhelmed.  Granted, I don't ","useful":0,"cool":0},"FsqCdalNaYWVD9Ga-Grr0w":{"text":"This is not a good restaurant.\n\nService: We ate here tonight. It was a horrible experience","useful":1,"cool":0},"xs3hDN0f6x1RTya98oZuIQ":{"text":"I, like others, signed up just to leave a review for this restaurant. To say it was bad, i","useful":0,"cool":0},"wVh9AngvbAndM1ViRAhxRQ":{"text":"Not very good at all. Entrees were extremely salty, and nothing tasted even remotely fresh","useful":0,"cool":0},"XIljaBdh9c5Y8dPm5pMwVw":{"text":"I ordered the Cajun Seafood Platter while my son ordered gumbo & alligator.  The gumbo was","useful":0,"cool":0},"NU0Li5XyqpWr6q72RNp7mw":{"text":"I don't know, perhaps I've been spoiled by the other good restaurants in New Orleans but I","useful":0,"cool":0},"ogXvDHGmCRqea39DNVE2IQ":{"text":"If pressed I would have given Mulate's a 2 1/2 stars, but I rounded up.  On my first night","useful":1,"cool":1},"n6bqCojAcaV3VeTkeKBf2g":{"text":"Great food, friendly service, casual atmosphere, perfect zydeco music in a live band to to","useful":0,"cool":0},"anWoNAdJHBeNiI68EY0faA":{"text":"I liked this restaurant very much.  Exactly what we were looking for.. reasonable pricing,","useful":0,"cool":0},"jKWVirCpqOI8aXROYti56g":{"text":"Were at a convention in New Orleans but hadn't had any good Cajun food. Mutates was recomm","useful":1,"cool":0},"PKxJEBUJuajGkVj9fWlfcw":{"text":"I wanted to be absolutely certain that my palate wasn't skewed, so I actually ventured out","useful":0,"cool":0},"ixD_c6ii4SmO_weY8aIpDg":{"text":"Wonderful time! Not many places in New Orleans lets you bring kids but this is mostly a re","useful":0,"cool":0},"E7-IgP7C7wXBg4y-r_F1Pg":{"text":"We had a great time at Mulates.  Yes...touristy...but we are tourists and enjoyed every mi","useful":0,"cool":0},"RK9Z051amKkJ4jnBRNh_qA":{"text":"I came to this restaurants with my coworkers for dinner. I ordered the seafood pasta at th","useful":0,"cool":0},"e6Y7k71hZIzlkoiima1q-A":{"text":"We really enjoyed our lunch, seven of us and all our choices were good. Fried items were a","useful":0,"cool":0},"HQ1qcjD-fBoBAU13EMwUJA":{"text":"for all you vegetarians out there, who have friends who crave alligator: there is only one","useful":0,"cool":0},"j6pDBgKM875L-e1iYfNW7g":{"text":"I think Yelp has it right with three stars for Mulate's. We visited with a group of 6 for ","useful":0,"cool":0},"G6GTzazdr0fkUHAw83zk4g":{"text":"I arrived late in New Orleans and was looking for a place to get a bite to eat near my hot","useful":0,"cool":0},"MNV3-PUzfTuZb7NPbjYHHw":{"text":"I think Mulate's is very under appreciated on Yelp. I had a great time there. The food was","useful":0,"cool":0},"J2Eu2hAKAWsi3ncirksAqA":{"text":"This restaurant was recommended to us when we first came to New Orleans around 10 years ag","useful":0,"cool":0},"nM44mZ4i06EJTHAXlwGrtw":{"text":"The food was great!!!  Let me recommend the smoked oysters.  Awesome\n  Our server was Andy","useful":1,"cool":0},"EGEwIFNPZyvES3fn-DSB3w":{"text":"Had a great time while at a conference at this truly Cajun restaurant. I recommend the gri","useful":0,"cool":0},"ULea2LDqD-ep4EgeunuYyA":{"text":"The food was horrible and the prices are unreasonably high. For example --I ordered the ha","useful":0,"cool":0},"PeZIIwIbCqQCIdPZDiPCzA":{"text":"Went for dinner, had Gretchen as a waitperson, very nice. I told her not to rush me, she d","useful":0,"cool":0},"sLrnXX5B6aWhZs21UAN4rg":{"text":"Went in with a large group on a Saturday night and quickly got a table.  The food was real","useful":0,"cool":1},"1pXY-FSBKUY-o5_CfUKASQ":{"text":"Good for tasting local food. Lots of variety on the menu. My etouffe was very good;  I lik","useful":0,"cool":0},"C_nPBlzRODDHOo1IRbIXVQ":{"text":"The only good thing I can say is the food was fast..... Large restaurant, loud, really bad","useful":1,"cool":0},"3tHR0KmafmBO4wKlQYAqjg":{"text":"I was attending a conference and had lunch here because quite honestly, it was the first r","useful":0,"cool":0},"V7pnUmqVbIzHWJHudnI8sw":{"text":"Amazing food. Service was brand new. Didnt know the menu. Other server stepped right in an","useful":0,"cool":0},"WRBjC44WE0dJ154W8ZP67g":{"text":"The food is bland and over priced.  Something you can get at any fast food cajun themed re","useful":0,"cool":0},"zRicMd33XmI_Oi5hpwD7oQ":{"text":"Live music, the best cajun food, and crazy great service! YES! COME HERE TO EAT! It's only","useful":0,"cool":0},"fd-07N8uYRMLx2D15xfzsw":{"text":"Nice place for some Creole.  There is this platter for 60 bucks that has alligator, frogs ","useful":0,"cool":0},"pkQwUIZHhQ1nkj_WJnd99g":{"text":"This is the second time I was here in the past 5 days.  It was very close to our hotel.  I","useful":0,"cool":0},"Xu_G_eOOH45pJj_sJaqA-Q":{"text":"Best jambalaya ever! Great old building with a dance floor and a cool mural on the wall.\nU","useful":0,"cool":0},"M5q65fQDVgRfWwcR6NoagA":{"text":"Atmosphere is fun; the Rodrigue Blue dog paintings, the live zydeco band and the dancing c","useful":0,"cool":0},"w0M15bnKpE5kVPZl0OLKSg":{"text":"After reading mixed reviews we had a friend say how good the food was. To our dismay this ","useful":0,"cool":0},"TjtLWWTN_KUlQWl7JwwIYw":{"text":"If you are a tourist, or a native of LA that has never been here, I would recommend y'all ","useful":0,"cool":0},"_uOPi8Hkudob_zrPgLwprg":{"text":"You want a platter of Heart Attack, you are in the right place...FRIED CHICKEN, FRIED GATO","useful":0,"cool":0},"LIn2XMl5_rLVP8y7euyO8Q":{"text":"The dishes were decent in size and somewhat bland in flavor. Nice atmosphere and good serv","useful":0,"cool":0},"ZaroItFWXqFydiO8_okV3g":{"text":"My friends and I were hesitant to go here based on the reviews that we had read but I'm so","useful":1,"cool":0},"EzLksWfxr1ynIWoJqMATkA":{"text":"Went here because the Hop on Hop Off guide said it was great.   His brother must be the ow","useful":2,"cool":0},"dL4Sk3xWqGE0Ga3-N0zu5Q":{"text":"I ate at Mulate's three times during a recent trip to New Orleans. Once during lunch time ","useful":1,"cool":0},"X4rB7ixMg-RAcxv7Nn98kg":{"text":"Excellent food, fast service great place for lunch. Today had a huge soft shell crab that ","useful":0,"cool":0},"8Yh40KObF4prEOhU4I3H7Q":{"text":"Ordered the jambalaya and it was so-so. The waitress brought it out literally 2 minutes af","useful":0,"cool":0},"AXNEnq7HIlZ8yM18i2TQ9g":{"text":"Have to say this dinner was enjoyable and the service was great.  A little historical on t","useful":0,"cool":0},"lP5bs5eEKG2wqWUVIWubBw":{"text":"Go to Long John Silver's and blast zydeco music over your car's stereo--save yourself the ","useful":0,"cool":0},"zJMfQPnV-wLQtdEowToH3A":{"text":"Service was ok.\n\nI got lunch: fish poboy with french fies/jambalaya, soda and side salad..","useful":0,"cool":0},"omIE53h2gZxn0UdG6ln9Bg":{"text":"We went here for lunch and were very underwhelmed. The food was very bland. The crawfish w","useful":0,"cool":0},"TaEWM8PQlkfWKreDpekTXQ":{"text":"A great meal! I had the blackened Mahi with a side of Gumbo and Jambalaya. For dessert, ho","useful":0,"cool":0},"Z1Yn5HsYOJltxhX7sy8p5g":{"text":"Meh. Not worth all the hype, in my opinion. Pretty overpriced (for mediocre food, at that)","useful":0,"cool":0},"lAkc4Hzu3i9o4NpYpmQnGQ":{"text":"Best food! Down home cooking. If you are ever in New Orleans, must eat here! Will be back!","useful":0,"cool":0},"DKEUQRg53QsJMwZAdLBLSQ":{"text":"Best thing about this place: crawfish etouffee. \nI even stopped to get a bowl to bring bac","useful":0,"cool":0},"LwX7c7uihPEwb8-SFKrY5Q":{"text":"First time visiting New Orleans and this was my first meal when I arrived into town. The f","useful":0,"cool":0},"0f9X5DSIREl0bea6hTlTRA":{"text":"Not bad. We came here on a recommendation. Not far from our hotel. The hostess was very ki","useful":0,"cool":0},"V7x8KfXHIbDVhnljRRwAAw":{"text":"I strongly recommend this restaurant.\n\nThe staff is very friendly and accommodating. We di","useful":0,"cool":0},"5VTJebpyQYDD2Ir8x3km9A":{"text":"We enjoyed the entertainment & dancing, but did not like the food. Husband had the broiled","useful":0,"cool":0},"KWM_5SfISkhqKEFEHNqQFg":{"text":"Love this place! Food is great and service is absolutely wonderful. This place is my favor","useful":0,"cool":0},"usvgZTI42I2rw8DdmIT9cg":{"text":"Jambalaya was very good as well as all of the pasta dishes though the seafood one seemed a","useful":0,"cool":0},"t1KoItBTK_IotjpLij2iXQ":{"text":"Food was delicious, I had the crawfish triple play. Great variety, excellent etouffee, and","useful":0,"cool":0},"UoFHLa0Vh8pmV3JrSk2CKg":{"text":"I stopped into Mulate's for lunch earlier this week on a business trip. It was convenient ","useful":0,"cool":0},"6y75NZoLZNmaHAu9c38Ocw":{"text":"Horrible hostess that mumbles and gets snippy because you did not follow. Then, they have ","useful":1,"cool":0},"abCS-YZMPowaJZtFKFnG7A":{"text":"As an American Literature teacher, I was looking forward to the food and atmosphere that I","useful":0,"cool":0},"M-SybjRk4STbZ4D8OpgIjQ":{"text":"This was a pretty good restaurant and it was near my hotel, there are plenty of food and d","useful":0,"cool":0},"2e0Z-pmCrD_cwZPy3X_Glw":{"text":"Outstanding food and music!  Mulate is a must on your trip to NO. Everyone was helpful, fr","useful":0,"cool":0},"Yt66wvgGZNriqQpvFH2oog":{"text":"I attended a business meeting with 11 people. The service was good and they were accommoda","useful":0,"cool":0},"nTtZD7BdYjwwx2Z_WtAH8Q":{"text":"Overall, the food was good. I didn't like the seating, the major confusion and over 90 min","useful":0,"cool":0},"gzsWAY-cA5n5jryNmZr-dQ":{"text":"Want healthy? Don't come here! Want some terrific down home food? This is the spot! I thin","useful":0,"cool":0},"wuQFyOprogQyH-cICMXLWw":{"text":"I was not Impressed at all.  This was a poor attempt at even \"tourist\" food.  Service was ","useful":0,"cool":0},"IHPLbqvqgM3d8mG68SeYlA":{"text":"We got Mulate's version of muffuletta & split it. Plenty to share & very tasty. Fries cris","useful":0,"cool":0},"AYI6VQc1GsOF84L5DEQw4A":{"text":"It caters to the convention crowd, and isn't as tasty or spicy as authentic cajun cuisine.","useful":0,"cool":0},"BJhFa8IRAboMeWdZbjZpzA":{"text":"I tried gumbo at several places in the city. This was my favorite.  This rating is for the","useful":1,"cool":0},"JUfMWRUiGv-STW5g3QMgtQ":{"text":"Service was good. Good music...zydeco band. Good food.\n\nWasn't real excited to pay $6.99 f","useful":0,"cool":0},"Jx3KUnMqVyBmWCXb38XIug":{"text":"Mulate's has failed me.  First stop on my NOLA trip, and it was terrible.  Was with my mom","useful":0,"cool":0},"IFd_NUqvhYpU4VOIsrnjrA":{"text":"$15 lunch specials (gumbo and po-boys). Way too expensive for what you get.","useful":0,"cool":0},"PSiA5lPje2LTJSPkZsqniw":{"text":"Great food. Fast service. Awesome atmosphere with live music (at least on the Wednesday ni","useful":0,"cool":0},"dICvQFWYZ1WWxyf46CCJtA":{"text":"We had read several reviews on Yelp that weren't very complimentary toward Mulate's, but T","useful":0,"cool":0},"cTVo9Zcg8YhyycKIHd6n_g":{"text":"Went with high expectations..... My husband has been before and loved it... BUT..... This ","useful":0,"cool":0},"jj4jcbkzmt5U_qJqi2K0Zg":{"text":"Our party of 5 arrived In the early evening before dinner rush.  The place was Not busy an","useful":0,"cool":0},"X1smZDykLjwgFFqYpYjs2Q":{"text":"Worst. Service is just ok. Everything was over did. Frm the liquor to the shrimp, to the w","useful":0,"cool":0},"s6F5tiw55_GARXKKL3IZhw":{"text":"Fries were great. Sandwiches were pretty good. Bread pudding was awesome! Service was the ","useful":0,"cool":0},"OijSYvAH4BlaU8ZyCiuDUQ":{"text":"Overrated. My wife, my daughter and myself ate here while on a little vacation. We had the","useful":0,"cool":0},"bcr_Be5gJY5VCwDpx4WlHw":{"text":"Had the seafood platter blackened. Catfish was delicious. Oysters and shrimp was great,, m","useful":0,"cool":0},"ujBox5QOoVvGR_3WKUnUGw":{"text":"Friendly wait staff, very convenient when you're at the convention center. stuck here twic","useful":0,"cool":0},"iLyRugD-iu5ocdfgrW1meQ":{"text":"We came here with new friends we met at a bar. We ordered the Appetizer plate for 4 that h","useful":0,"cool":0},"eym_c1tEzqOC0h_rAYJJXg":{"text":"Stopped by here after leaving the convention center across the street. Almost tried the ga","useful":0,"cool":0},"Ov753ptjsmJWX74hF2GZ2Q":{"text":"The location of this restaurants is awesome! The cons are they are selling overpriced just","useful":0,"cool":0},"gMXCPdHnU4dBKxjM3xy3sw":{"text":"I really don't remember ordering something at Mulate's last Jan. 2011 and the food was ok.","useful":0,"cool":0},"RBAMv-7h7VT-q5hZ3hnwOg":{"text":"Mulate's is a terrific restaurant with great authentic Cajun food. The place is always pre","useful":0,"cool":0},"HwGYrAKRwcI7u_CNEfR_mA":{"text":"The food was amazing. I had the fried shrimp platter. There was plenty of shrimp and fries","useful":0,"cool":0},"8y1uMuA1_8OfxEJf68PHWQ":{"text":"The food was good but not spectacular. I think our waitress has had better days too.  But ","useful":1,"cool":0},"hLWCv8LwSGvHQ9preabNTg":{"text":"L'impression de m être fait rouler comme un vrai touriste, mon jack Daniel s à été servi a","useful":0,"cool":0},"frKRsc-j1LLUFX6Jw_u7cg":{"text":"The food was room temperature at best.  Where was the flavor? This was my first time in NO","useful":0,"cool":0},"QB22UXVgyV9jclxWy21yPA":{"text":"Only a few hours in new Orleans and we yelped our way here it didn't disappoint we walked ","useful":0,"cool":0},"aPIyN774mN6kk5Xeb3eHbg":{"text":"Food was decent tasting,  although the etoufee wasn't as good as what I've had back home. ","useful":0,"cool":0},"rjl1woYSYXuXlfvPipH2gg":{"text":"I had the delicious red fish special. There was live Cajun music and a quaint dance floor.","useful":0,"cool":0},"mCt3hEC9zBW_hd9-n7WKfg":{"text":"Maybe if Mulate's was NOT in New Orleans it could justify a higher rating, but all things ","useful":0,"cool":0},"JMQlYZp0qY3AO3SwzDET-w":{"text":"We split the wings and the crab quartet platter.  Absolutely delicious.  The cajun music a","useful":0,"cool":0},"8Qt9YqOiRg-X3RxIWvVWHA":{"text":"OMG delicious food and good local music.  A definite must visit to get some culture.","useful":0,"cool":0},"O_xlzfLF-aQMPElqfnZFWw":{"text":"I had to send my raw cajun fish of the day back to get it cooked...my vegetables were micr","useful":0,"cool":0},"o3Cpchekuw5CUweqAjVeoA":{"text":"Yikes this place is awful. If there wasn't live music I would have no stars if that was po","useful":5,"cool":1},"CV0SGI_dAkFMFcUFBCx1aA":{"text":"[ Visited in October, 2010 ]\n\nMulate's seems to cater to convention tourists with safe, Ca","useful":1,"cool":1},"8DCmlPmnGpg9Dbv4lg20yg":{"text":"During a day of french quarter shopping, we decided to drop in and have a bite. It was ok.","useful":0,"cool":0},"K4U72gSjVlarQUn0nnDa9Q":{"text":"Great location right across from the convention center. It's a little pricey but the food ","useful":0,"cool":0},"MsFDauhascD_bSACk1g9vQ":{"text":"I ate here for my birthday during a packed St. Patty's weekend and was pleasantly surprise","useful":0,"cool":0},"z1uIkvCIqEoQUPawVjgn4w":{"text":"Good food. Fun atmosphere. \n\nWent here on a recommendation from the hotel I'm staying at. ","useful":1,"cool":1},"AtP4Xi6nzp5pwI2dDM6WIQ":{"text":"Meh. The place is very informal, you mind, but I found it to be nice. The food was okay, n","useful":1,"cool":0},"qrnyL0cb5qX1Qg6HNvdN9A":{"text":"Amazing seafood pasta, requested they spice up the cream sauce and they did not disappoint","useful":1,"cool":1},"UvUxSaNGC-Usek31_aoJgA":{"text":"Easy but bland and expensive food. About what you'd expect for next to convention center. ","useful":0,"cool":0},"Zf8Y7aBVPc69e-5A0DwThQ":{"text":"Found the restaurant while walking late to find food.  Got to listen to live zydeco music ","useful":3,"cool":2},"3V5PyQ_ydoIukejy8EfQVQ":{"text":"Tourist place which is fine and good for a family. One app, one beer, 3 adult meals and on","useful":0,"cool":0},"PMg6sh6QFMUILlgSGsKojQ":{"text":"Wow! I think this best described my experience at this establishment. Being this was my fi","useful":0,"cool":1},"T82PaYD4lkVVBwPre-056w":{"text":"Good solid choice with straight forward service.","useful":1,"cool":0},"F0kLi5HBRg_CEA5E_ANpbA":{"text":"This place was fantastic.  The price was a little steep, but we ALL loved our dishes.  I w","useful":1,"cool":0},"EPR7rwsQgYG1WDHrYVNAyA":{"text":"Great music and food. Had the red beans & rice with fried catfish critters. Great service ","useful":0,"cool":0},"CXeOix39ZJObI7kURMA-oQ":{"text":"My 2nd time here. 1st time we sat down for dinner.\nTheir etoufee wasnt to my liking but th","useful":0,"cool":0},"8_fqhJBoUQ_3NoEZGxXHKw":{"text":"Fun atmosphere,  terrible food.   The food is really old school,  supper club type food th","useful":0,"cool":0},"17Vk-Tb6GXuQd_sFJUnXTQ":{"text":"This place is mediocre... If you've had too many fried seafood platters in NOLA, I will te","useful":0,"cool":0},"TOxtZQCwsYJogbp-OeWFbw":{"text":"Mulates was recommended by the hotel concierge.  It was a few blocks walk away but it was ","useful":0,"cool":0},"5PVypIGPx9y2VPaBWUUIDg":{"text":"Do not let appearances put you off.  This is kinda a dive, but the food was great! We had ","useful":0,"cool":0},"SGXlkWDrOD-YYoPStL3a6A":{"text":"The food was absolutely delicious the service was quick I had the fried platter it was so ","useful":0,"cool":0},"XUioToJX9nZITI7TBGEXQQ":{"text":"Brought some out of town friends here for our first visit, huge space, dance floor live mu","useful":0,"cool":0},"CHyPz-38MiqOEcNZdwzQCw":{"text":"Overpriced, tourist trap. Platters are $20+ for only a moderate amount of food. Do not exp","useful":0,"cool":0},"932kyXv61OO4ZkBx2K6wrA":{"text":"Our kids didn't love the Cajun seasoning on the fries and most of the fries food,  it we w","useful":0,"cool":0},"Hj6SBkooQaaxYjaKegU1vQ":{"text":"Delicious desserts!  Service is A+!  You'll get to see Rodrigue's pieces, artwork costing ","useful":0,"cool":0},"_WFudDPuh7RUJwVTtGnk-A":{"text":"The food was pretty good. They play live jazz at 7pm. I didn't get a chance to hear it bec","useful":0,"cool":0},"1q0Z3Ke8Y-AlaAdi2n-UtQ":{"text":"Waited forever for a table, then they skipped over us. Food was just okay and bill was inc","useful":0,"cool":0},"rod8PIFCRAZjVErnXMxuJA":{"text":"First time in and we would certainly come again. The etouffée and jambalaya were perfect e","useful":1,"cool":0},"mgfa8MjLf2Y8GbZ_DgEQSg":{"text":"Went after someone told us to try their Alligator Tails..   Not much to get excited about.","useful":0,"cool":0},"_0i1oite0fLHqVG2f8Zqig":{"text":"Went to this place because it was across the street from the Morial Convention Center. Fri","useful":0,"cool":0},"RdrQa_s5vYVtiXqQs4YYGQ":{"text":"We were disappointed in our service and food.  The band was fun, but couldn't overcome all","useful":0,"cool":0},"l1ByMnyxx_R0ucBOWUJT6A":{"text":"Overpriced food... Friendly service... There is better music on the streets of the French ","useful":0,"cool":0},"N1DVAoq_OCJk6aQMLIkH-A":{"text":"Mulates made a liar out of me. I always said bad restaurants couldn't survive in NOLA - th","useful":0,"cool":0},"vMNGgtZNjf3KAct7H39HBw":{"text":"Oh My, compared to lunch in Sulpher, WOW!!!\nMulates never disappoints. Wonderful food (gri","useful":0,"cool":0},"4nRSOUldWBcAEQlOr5X-yg":{"text":"I ate here two times for lunch in a week of a hot July, and the food and service was great","useful":0,"cool":0},"4uOJ0ud-8396xE22rtBpFw":{"text":"Nice place! Was within walking distance of my hotel. Waitress was really nice. I was in th","useful":0,"cool":0},"XZeoe7TV02c0ZejUkVw5PQ":{"text":"Really not a place for a \"foodie\". Seems like a chain restaurant. The best thing is if you","useful":0,"cool":0},"3UZc6vmzCdpO81F_XUnU1g":{"text":"The wait was 45 minutes.   My husband ordered the smoked oysters. The price was $13 and wa","useful":0,"cool":0},"j0g5ufHVHUF957vmGGTn2A":{"text":"Went here Fat Tuesday night for dinner after watching the parades for 6 hours. And was a s","useful":0,"cool":1},"ZBTYdDiBcjz3NNFhPYdJlg":{"text":"Their amazingly yummy jambalaya is what bumped this review up to 4 stars.  Seriously, get ","useful":1,"cool":0},"So2BYtN-UKei_VLJ24Tfrw":{"text":"Food was good. Customer service not so much. The cup ($8) size if half the price of the bo","useful":0,"cool":0},"ooMydqrG7Vsdxee40D8nWQ":{"text":"Expectations were very high, and proved to be too high.  I had the Mulate's Grilled Seafoo","useful":0,"cool":0},"ag1PvQdFW2glypBP73hq-w":{"text":"Agree with others that it's hit and miss.  Great:  Frog legs, bread pudding.  OK: Crawfish","useful":1,"cool":1},"QL7bYnZfM11nNA4ppF_BDw":{"text":"Tried this place for the first time last night.  When I told the hotel doorman where I was","useful":0,"cool":0},"mAoGpyKXegyQ4GRrszGqoA":{"text":"Late review writimg, but better late than never.Terrible service!  Waitress did not accomo","useful":1,"cool":0},"0zQ8gIl9KU9x8yR76tplFg":{"text":"Mulatte's serves great Cajun food that is seasoned perfectly (in California people throw o","useful":0,"cool":0},"mchyIZcB4a-2SQmbIiciPA":{"text":"Food was alright but nothing to write home about. We ate fried gator bites and grilled gat","useful":0,"cool":0},"p64sTxwPimW4mXhCqtaw4g":{"text":"I'm surprised by the 3 stars this place gets.  I enjoyed our meal here.  Great portions an","useful":0,"cool":1},"jvCWv6OofEAnlZtbf6PCQw":{"text":"we came with a group of 8 teens and 2 adults for lunch. \nThe first thing our waiter told u","useful":1,"cool":0},"jv2-qx8g8MSS2ZxmqHHUWg":{"text":"We were directed to this local place by the wait staff at the Emrill's place as a place th","useful":0,"cool":0},"kx8Npy0xeqeDkIyDIxlbGQ":{"text":"I went years ago and WAS great. Now not so good. It has been engineered for profit. Not ex","useful":0,"cool":0},"Zsu-5gf9QJB8BtzJ4Ffe4g":{"text":"Our favorite restaurant when we come to New Orleans. The food is always tasty and fresh, f","useful":0,"cool":0},"__7d-WknSNvIvWdqCiKvHQ":{"text":"I've been coming to New Orleans once a year for 20+ years, and have never had a really bad","useful":0,"cool":0},"Yrul1g3TrlHsGnlsFPHIQw":{"text":"We stopped in for an early dinner before the Sugar Bowl and were seated and served right a","useful":0,"cool":0},"F_XO-1aN1but73UzKIZUgw":{"text":"My boyfriend and I went here to have a fun dinner out while visiting New Orleans. I got a ","useful":0,"cool":0},"icidEy2DNPXEvdqf038OdA":{"text":"Have been twice now. First time, I have really good memories of - was a New Years Eve, pro","useful":1,"cool":0},"mnWy-Kjm7xDIxqy-6ZuHBA":{"text":"Very uniquely cajun. excellent choices fried or grilled your choice. Waitress was friendly","useful":0,"cool":0},"YtEYSGQakvGfrhtw_rTPCw":{"text":"Tourist trap. Had stuffed mushroom and grilled shrimp. Mushroom was basically batter with ","useful":0,"cool":0},"nQjd_jJ4UcSQvL8R7aUbVg":{"text":"The food was excellent, we had the Cajun Baby Back Ribs.  The meat was tender falling off ","useful":0,"cool":0},"8TJTr5wvDZx_KREJ9Dj0Qw":{"text":"Not a good bet, but better than the convention center food. Twenty dollars for the crab ca","useful":0,"cool":0},"bgzEHo2PBVHcBfF5XH9KzA":{"text":"Great crawfish etoufee. Great boudin.  The zydeco gumbo was good.  Prices are a bit steep,","useful":0,"cool":0},"SDOfIx471NgdQbD72KGi7Q":{"text":"My sister and I wanted to go to Galliano's across the street but it was closed for dinner.","useful":0,"cool":0},"qijHdQMb61jadLVU2sWPFA":{"text":"I love this place! Always great food and drinks. The atmosphere is fun and casual and the ","useful":0,"cool":0},"Z4wGdJcSgLnD2-lo1RKtUQ":{"text":"Jambalaya was awesome! But everything else was just ok. Our server was very nice, but hard","useful":0,"cool":0},"X0nY5R4WmgDAY9kPRneguw":{"text":"Planned on going to Emeril's but didn't have a reservation. Asked a local for recommendati","useful":0,"cool":0},"xZEm54TXtPLDzYJl3oFBuA":{"text":"Oh Dear! Highly recommended and not good! My husband got ill after eating there.  Music wa","useful":0,"cool":0},"fKzbpbdacdVi1w08jCDZig":{"text":"There has only been one time in my life when I honestly thought, \"I can walk out of here r","useful":0,"cool":0},"_dHHuwr5YNQwuzA-fzD8iQ":{"text":"I was starved as was the rest of the large party I was with.  We way over ordered and then","useful":0,"cool":0},"ap4IK0toFYuNoiwcrSkchA":{"text":"The place was very overpriced for what you get. The food was ok. The blackened fried gator","useful":1,"cool":0},"DHepi3zV8cNwhjNBC63xbw":{"text":"I honesty don't remember much about the visit (damn those green grenades) but I was told t","useful":0,"cool":0},"utexnbdD4J3BIzde4BV_gw":{"text":"Sad to say but their food is going downhill.  We come to New Orleans 3-4 times a year and ","useful":1,"cool":0},"opxu_2Jivsc6MuCihO9lJA":{"text":"The food at Mulates is so good it'll bring a tear to your eye. Etoufee is etou-effing amaz","useful":1,"cool":0},"27JcgEBh6D1XNLpLLPKtzA":{"text":"The food was OK but the service was terrible. Our waitress dropped the tray carrying all o","useful":0,"cool":0},"BuBDr9YtGs1GqH9Eu0i1cg":{"text":"Best jambalaya ! Great environment with nice workers! Make sure you try the caramel cheese","useful":0,"cool":0},"J61kli4AwovgiF-bTjT1nQ":{"text":"My husband and I went yesterday for lunch, the hostesses and servers were polite, attentiv","useful":2,"cool":0},"QZZ4KwqX5YnUwuICHdoikw":{"text":"I started off with the grilled alligator.  Delicious, I think the best alligator I've had.","useful":1,"cool":1},"8w2UAXY1xryxQQsW37aU7Q":{"text":"Although this spot was highly recommended, my dinning experience was just \"eh\". I opted fo","useful":1,"cool":0},"HYxFtDczzJ5i3IAPm6APJQ":{"text":"Wow! This was the NOLA food experience we were looking for. Mary Alice was our amazing ser","useful":0,"cool":0},"UzypNBOhmUW0BOmXyaGQYw":{"text":"I tried the Zydeco meat pies. They were flavorful and spicy but the breading tasted a bit ","useful":0,"cool":0},"_Ujnx8Ko80LMoeTimoqwHw":{"text":"Amazing Smoked oysters just melt in your mouth. I am going to dream about these oysters. O","useful":0,"cool":0},"WncavBcrUZ1m40RXUKuM1A":{"text":"Went here because it was close to my hotel. Place was busy but not packed and no wait to b","useful":1,"cool":0},"tLktsEzH0TSo18xsNkEPGg":{"text":"Great place to eat! Crawfish etoufee! Fried catfish! My friends and I ate here during one ","useful":0,"cool":0},"RVcuC-zInFxerNw_TkIW-Q":{"text":"The bowl of rice and beans is huge!! Beware. I had the popcorn shrimp salad which is good ","useful":0,"cool":0},"bYjNakeahNrwpj3ONPoJHg":{"text":"Seriously blande food. I ordered the fried chicken po boy and asked for provolone added to","useful":0,"cool":0},"bKAXIlAWGV1TAKHfD-hgpQ":{"text":"This is okay.  Maybe it was just our visit.  There was a bit of a wait, but that is to be ","useful":0,"cool":0},"vyxgIgz5eyPp4IxngwfBPg":{"text":"Great place. Does NOLA proud. \n\nQuick rundown:\n\nZydeco gumbo-perfectly balanced with corre","useful":0,"cool":0},"NJEnRhKQjkgnMOCFUyUKyg":{"text":"Stopped in here on a Thursday afternoon for some lunch and a few drafts. Hardly anyone ins","useful":1,"cool":0},"1OuZWzH19ZHHbhEGUd9mMQ":{"text":"OMG!  The Banana Pudding is to DIE for!!!!!!!\n\nThis place was recommended to me by my taxi","useful":2,"cool":2},"Q7gmTwKbYDsHk1BdN2jBhw":{"text":"Fried alligator was tough and chewy and disgusting.  The gumbo was salty and tasted burnt,","useful":0,"cool":0},"SYhkhIDOTnI4HzrEJSN1vg":{"text":"Really good food. I enjoyed the seafood gumbo and grilled shrimp. The service was a little","useful":0,"cool":0},"YzXGArY8xZCyzecdFIZuAA":{"text":"Definitely not the best place to dine in NOLA.  Appetizer portions were extremely small an","useful":0,"cool":0},"3cfb2VhfkH_5tfaEF9tisg":{"text":"Great atmosphere, crowded and a little loud. Worth the wait food was great, staff were fri","useful":0,"cool":0},"QPmZejBITY1UtjCnIV4Sjg":{"text":"We fist visited Mulate's in 2008 and it was so memorable that we googled \"zydeco Cajun res","useful":1,"cool":0},"PkYPFBhuscEyMp1rDu5YMw":{"text":"Pretty disappointing in comparison with the rest of the food I ate in New Orleans. I order","useful":1,"cool":0},"yn9pPsNIp4zCzp3gcEPX4A":{"text":"You need to go here! If not for the food, definitely for the music. Live music from 7-10 e","useful":0,"cool":0},"7UJVZvdeqc1crW2HzpEzuw":{"text":"The restaurant is very big and can accommodate big groups. The staff (waiter Andrew) was f","useful":1,"cool":0},"7yvE_DHekwjDXVXNr2WSoQ":{"text":"The hostess was dry. There were lots of tables open but it took a while to be seated. The ","useful":1,"cool":0},"CluQ2eqXjL0tQLRWQiLeOQ":{"text":"In all fairness I didn't order seafood. I went with a large group and had the veggie pasta","useful":0,"cool":0},"GCq5o4Etjx9-IzMUXoAOBg":{"text":"The ambiance is crowded and very touristy. Right by the convention center,  it was conveni","useful":0,"cool":0},"AfekcOMFkvAqy0W62NwJtA":{"text":"HORRIBLE. What a waste of money.  I'm sad for tourists who come here and think that is wha","useful":1,"cool":0},"PptD_M8N0w2Bv9QivMmK_g":{"text":"Very nice dining experience, except the band that night didn't play Cajun Zydeco which is ","useful":0,"cool":1},"09QxX_jIxuuz18yq9ZSWVw":{"text":"Went on 11/20/2013 for dinner. First time I've been here in years. Food was excellent, muc","useful":0,"cool":0},"JUixQvJtJXcx41bR_-6gYA":{"text":"The food was good, it was a nice introduction to New Orleans cuisine however the vibe was ","useful":0,"cool":0},"1-50mfGwjH90n9rUI6lSQw":{"text":"Had cup of seafood gumbo and a cup of shrimp bisque. Both excellent. Service is a bit slow","useful":0,"cool":0},"nIqgJit_QgGANBLBDpAm-A":{"text":"The gumbo is good. I was disappointed that the cajun band was not very good and no one was","useful":0,"cool":0},"WTP_gvasfCK4e32ec5ab5g":{"text":"ALL the food was cold.  My wife and I shared the Cajun grilled seafood platter , of which ","useful":0,"cool":0},"9Ib3p8pnd73usBg6qDu5Jw":{"text":"Entertainment was great, service was good! Food was okay and a little over priced. But if ","useful":0,"cool":0},"ojFVxgr7kVZwom6yAGT52Q":{"text":"The crawfish etouffee was excellent they put a lot of crawfish meat in it.  Just a bit on ","useful":1,"cool":0},"qTbUYwCjulRmSpXIRGLYqw":{"text":"Visited and eaten out in New Orleans dozens of times and have never stopped in here becaus","useful":0,"cool":0},"HROcB-p5twkrdetiLGz6uQ":{"text":"Mulates is a tourist trap, but a decent one.  We had a party of 2 and managed to rack up a","useful":1,"cool":1},"x4Xp6hryBPWYxh554Dxq2A":{"text":"Points for atmosphere, not food. Somewhere between authentic and tourist, it's loud, fun, ","useful":0,"cool":0},"p_riT5_LTQOP1W-T-16vQA":{"text":"This was about as touristy as it gets. The plates are huge and over priced. The crab au gr","useful":1,"cool":0},"N80BEURKmgsGwuEUqYmMSw":{"text":"Allow me to preface this review with this, I am not Cajun or from New Orleans.I cant say i","useful":0,"cool":0},"EO-9NP5o-YdEeSoT4RzbPg":{"text":"Ate here on just about every trip to NOLA.  Stopped in tonight and the service was terribl","useful":0,"cool":0},"C4VYjTKL8hd55WRK85btFQ":{"text":"UNLESS YOU WANT FOOD POISONING, DO NOT EAT HERE! I am from out of town and was referred he","useful":0,"cool":0},"q9KT8TKxzFyKIHRFmdgHOQ":{"text":"I would have given this place a higher score but our waitress was rude. Food was decent, b","useful":0,"cool":0},"7gXQzf17cs_FbTWi6TlY9g":{"text":"Food was very good, a bit pricy. Extremely crowded. We ordered a sampler platter so we cou","useful":0,"cool":0},"JKfiq9gWvzAluYdSgj-UrA":{"text":"We came here because of a suggestion. They sat us at a table against a wall which seemed l","useful":0,"cool":0},"5WZdP5wBTLZN5i9ESCSPhg":{"text":"As a frequent visitor to New Orleans I know how to find and eat good food. And sometimes y","useful":0,"cool":0},"metX3V_tnfBROWSla-3_VA":{"text":"This place is absolutely amazing! I had the alligator po-boy and it was the best thing eve","useful":0,"cool":1},"QQnXTTxV9voi2ZsxCNDHBA":{"text":"I tried frog legs and fell love, especially with the mild mustard sauce and Tabasco. The g","useful":0,"cool":0},"uQgcADq3eyKy012OcPRWgw":{"text":"Mulate's gets a 2 rating because i wont be going back, but the Customer service was great ","useful":0,"cool":0},"d3la8Ln4ZjsSs-__Gar8_A":{"text":"This is one of our must stops whenever we're in New Orleans. The food is good but it's mor","useful":0,"cool":0},"IVzcDZf-6j3UVNf8qEY9Vg":{"text":"Great seafood and the most amazing dinner experience tonight.  Welcome to New Orleans Prod","useful":0,"cool":0},"XTORKi3UTE_ooCwkI18A9w":{"text":"Great food at a steep price. We came as a couple of tourists looking for some good ol' all","useful":2,"cool":0},"YTTecpxOyziiV5z0ccyS8A":{"text":"Solid, solid place. Good service and yummy gumbo. It's not the paragon of NOLA dining, but","useful":0,"cool":0},"1x4ag1A9YLIrzRcH3rHaHA":{"text":"get the boudin. get the boudin! The seafood platter was a good choice. Everything on it wa","useful":0,"cool":0},"byMDYDzh0aOKHvEvAx9f5A":{"text":"First time & really fun time. Food was excellent & service as well. Four of us had 3 diffe","useful":0,"cool":0},"D9NfMXiusypTCaYS381MBg":{"text":"The restaurant has great food and a live band.  They even have dancing partners if you nee","useful":0,"cool":0},"a-SVsY4YeXTiSxPQ_NxTsg":{"text":"To sum it up, the food was okay.  If you want New Orleans food, you might save yourself so","useful":0,"cool":0},"esXq9VFfVwPn2qquJ1D2Tg":{"text":"This place had a great atmosphere. We arrived in NOLA on a Sunday just after a saints win ","useful":0,"cool":0},"H61bpVhqvbv9Fa7cnpxL5A":{"text":"For Convention Center area food this was good. 4 Stars given the convenience and the other","useful":0,"cool":0},"0Exvh2f-kWQ1Cm9bEmvE8w":{"text":"Went to Mulate's on a recent Sunday night during a trip to town during Mardi Gras. Our wai","useful":0,"cool":0},"nMB5SbNxocBzw-a56mlrIw":{"text":"A good, solid restaurant. Saw loads of high school kids eating together at big tables. Mak","useful":0,"cool":0},"v9kZRd1wiu-RJ91xxWeFBA":{"text":"Terrible. Manager Actually Threatened to Call Police Over TIP.\n\nWent here Jan 15 2011 for ","useful":1,"cool":0},"k58cSghIOdrLzvx5xkmaIw":{"text":"We had a fun night at Mulates. We were not rushed and were able to enjoy the food, friends","useful":0,"cool":0},"CePpjSKwHiqU8y6df66jpw":{"text":"I would have given it five stars bc the food was delicious. However, my mom and I each got","useful":0,"cool":0},"S-07rv_U_QMX3odUP94uGg":{"text":"Bog price for tiny serving. Food was pretty blahh. You can do better in mall across street","useful":0,"cool":0},"h0ey9rRZoAlO2E6t9dDIdQ":{"text":"As a solo diner I was directed to the bar. I got a beer pretty quickly and a food menu - t","useful":0,"cool":0},"kIq3C9H4nqjCs9xcQnP8mA":{"text":"Great food. A bit pricey, good serving size. Convenient location to,cruise terminal.","useful":0,"cool":0},"5SxY7kH3ajof0m7g94sJ2g":{"text":"There aren't too many authentic Cajun restaurants in NOLA but this place fits the bill ver","useful":0,"cool":0},"Op5EeiX72UzGwB-YlG_Oag":{"text":"Just had lunch. Awesome. Fried alligator and red beans and rice were out of this world. Gr","useful":0,"cool":0},"R5dpVMGhOu8-lDRnQe94kQ":{"text":"Mulates is an excellent snapshot of New Orleans food, music and hospitality. \n\nThe Catfish","useful":1,"cool":0},"XATQKHeuLxxlUamxUTU0Fw":{"text":"Went looking for authentic Cajun food and was recommended Mulate's by the hotel. The food ","useful":0,"cool":0},"vjd2YL34JPKQTXA4fulh8A":{"text":"We stopped by on a Tuesday night and got seated right away. Service was prompt and very fr","useful":0,"cool":0},"-ILOQ2bBpz12ddeEBaMHpQ":{"text":"Really good service. Good food. I recommend the Catfish Mullato or the Au Gratin.","useful":0,"cool":0},"Xngo9D8DVXEEgCF95ssjhQ":{"text":"This food was some of the best food we had in NOLA. It is conveniently close to the conven","useful":1,"cool":0},"ZZBbZrYZlsO-fPdiwlHxIw":{"text":"This was great place for a party of 8 to come and be loud. There was live music, friendly ","useful":0,"cool":1},"lemk0ZLYfUN33jj7EwO8Bw":{"text":"Authentic Cajun food in a fun, festive atmosphere.  \nWe'll be back for more! Come hungry!","useful":0,"cool":0},"UIR7VIu566Fe0MA1U2_8zw":{"text":"Had the corn and shrimp bisque.  It was delish, but a little on the luke warm side.  Servi","useful":0,"cool":0},"1Hhn1KDKM_-peu9XkwEm_g":{"text":"We have attended conventions in Louisiana and have been meaning to check it out.  I had th","useful":0,"cool":0},"Qz8_nNqHhNeU1BkVl_VWsg":{"text":"Wow the crap this place is passing off as Cajun food is an overpriced disgrace to the city","useful":0,"cool":0},"lkRz5X5k8Oqpusyx_akWLA":{"text":"Desk clerk at hotel suggested this place... Wait time was very short, staff was very pleas","useful":0,"cool":0},"fFJ8eRD-3k-UrWGgz0L8-w":{"text":"Good, not great. Came for lunch and were seated and served quickly.  Friendly service from","useful":0,"cool":0},"ioPUW-gqCka5l34xeVFcew":{"text":"It was a great lunch again on my recent trip.  I am glad I had a long walk afterwards as o","useful":2,"cool":2},"tx2lrnEyvHgM49nV_JoN_w":{"text":"Really enjoyed our lunch here; would have liked to have seen the restaurant in all its glo","useful":0,"cool":0},"O9_88kZuXRK3ed-UdPRPvQ":{"text":"Everything here was delicious. Our service was great. It did seem a little overpriced but ","useful":0,"cool":0},"Dg66fqVWoS3miP8vccvEZA":{"text":"This place is huuuuuuge. That goes for the menu portions too. I think they do some sort of","useful":0,"cool":0},"9YpI1xsoHjB9EYAgGJ8EAw":{"text":"We are visiting from out of town and we Yelp the best restaurant from our hotel and found ","useful":0,"cool":0},"bEcAlndmdX9Ana1B7dYMZg":{"text":"Just more of the same fried stuff in town. If you were going for alcohol and dancing than ","useful":1,"cool":0},"SBumYEr0NopfBfhQTurUDw":{"text":"Cajun comfortable from the moment you walk in the door. Dining alone is t easy but the cas","useful":0,"cool":0},"d20tcZlRggKy2uD06Bs7SQ":{"text":"Food was average minus and salty. Dancing was interesting. Wondered if older couple were p","useful":0,"cool":0},"B5BPoXW5ORCfEDpGQhN-rw":{"text":"A little bit pricey but the food is great. There are a lot more places out here that have ","useful":0,"cool":0},"xgjXCa96SEvr5W_9P3e3fQ":{"text":"This place is pretty big and loud. They had a rockin' zydeco band playing and the cutest o","useful":0,"cool":0},"1PWGmw4mzbLwrYl3rZy8XA":{"text":"I am literally still traumatized after spending $74 in this place. The waiter was nice, bu","useful":0,"cool":0},"FR_ONlIoKHj7c4XfvDavHg":{"text":"The smallest crawfish tails I have ever seen, no flavor, and portion of tails was minimal!","useful":0,"cool":0},"FbXhm-BueBn5gkEej_r1nw":{"text":"Fantastic food. Great portions. Excellent service. And the festive atmosphere is one of a ","useful":0,"cool":0},"dwpFR_quiiGHQu8oKM4Lbw":{"text":"This place was uninspired and definitely geared towards folks who just don't know any bett","useful":1,"cool":0},"f-qHagDArGs8XjuKN12rvA":{"text":"Super food, fun servers, great Zydeco and dancing!!! Great for kids to seniors!!  I loved ","useful":1,"cool":0},"0pCt-THo2-pt13MjgoJNnw":{"text":"Fortunately we only came for the bread pudding. I've had it many times and LOVE it, but wa","useful":0,"cool":0},"NvFwJ8Zb4LyEdZxrH8PV_Q":{"text":"Excellent food and service. The staff is very customer oriented and you feel very welcomed","useful":0,"cool":0},"cJGPvEMiaIWPCMuh-S3k6w":{"text":"First let me say that over all we had a good time. I was in New Orleans and really wanted ","useful":0,"cool":0},"w7SiiTXPD3KWDB3UfrOQNg":{"text":"I was not impressed with the food here. The people are nice, but the food wasn't as good a","useful":0,"cool":0},"pEzAK6BZOxFE8WW_Y8IIwg":{"text":"This place was fine. A-OK is a great way to describe it. I had the seafood gumbo and a sal","useful":0,"cool":0},"2dCfwRYO6PkmSKO7YQ8l7A":{"text":"I ate at Mulate's twice during my stay on New Orleans. It was right between my hotel and t","useful":0,"cool":0},"lhZMhZ4HTBFC437SdUaEUw":{"text":"This is a very fun restaurant to dine at. Music starts at 7 every night. Boyfriend and I c","useful":0,"cool":0},"HX34f4qX4hAretcfYRvlQA":{"text":"This place has the best stuffed crab I've ever eaten! The grilled alligator bites appetize","useful":0,"cool":0},"iLECPnEWkbqeZ6nZInD3FA":{"text":"If you're looking for a fun and only-in-NOLA dining experience, Mulate's is for you. We go","useful":0,"cool":0},"kojuZOLIUGyzPpmpwWPg3Q":{"text":"Service was good. Good music...zydeco band. Good food.\n\nWasn't real excited to pay $6.99 f","useful":0,"cool":0},"HEEMnve1e7VZ21q8yqq6tg":{"text":"Being from Cajun county and living in the city this place is spot on with the food. When I","useful":0,"cool":0},"_HtrKPzlzR1gywgCjg1KjA":{"text":"Long wait once we were seated, understaffed.  Drink prices (unsweetened tea) nearly $4 and","useful":0,"cool":0},"Z_TtxfAtEuTRnltdmldEVQ":{"text":"Horrible service in July 2018. Food ordered 1:15 minutes prior arrived cold. Most were app","useful":0,"cool":0},"eXU006rhDR6wpEVEFVbDEg":{"text":"Bartender was unfortunately not friendly or welcoming. The gumbo had human hair in it. The","useful":1,"cool":1},"PAmpCOBsIGi6RfHLDdCQKA":{"text":"During our time in New Orleans, Mulate's was one of the two best places my wife and I ate ","useful":1,"cool":1},"rNaeUzMRrjScpnIuvgtnLQ":{"text":"On a family trip to New Orleans We chose to dine at Mulate's, a wonderful restaurant with ","useful":0,"cool":0},"_xwFP-vjx190EtdTKYiPzA":{"text":"I loved this place.  We had grilled frog legs and grilled alligator po'boys.  It was of th","useful":0,"cool":0},"KWUXMbZpYFusjfT7wv0Obg":{"text":"Second time here and the food got so much worse. Ordered some sort of a seafood combo plat","useful":0,"cool":0},"kjHvXxsEOlwnYmPho9LYxA":{"text":"We came here for the frog legs.  They were good!  But overall, the food was ok.  Nothing s","useful":0,"cool":0},"Znkrv5dnw2u2VVg7mZf1Qw":{"text":"The food here was great. Unfortunately the service culture sucked. Or didnt even exist. Ou","useful":0,"cool":0},"ocyufSWA0wzJUhbQuQjZAQ":{"text":"A total disappointment. The calamari was mainly batter used to fry it. Empty batter. The c","useful":1,"cool":0},"vKX-LpThVIiKXt6byD_ufw":{"text":"I would have given this place a higher score but our waitress was rude. Food was decent, b","useful":0,"cool":0},"9rUeKG2gRHcet9F8wXPGvA":{"text":"Absolutely horrible service. We ordered our food and about 50 minutes afterwards, still wa","useful":1,"cool":0},"YJfPMvXaa8Vbz6yY1XxOVg":{"text":"We loved this place.  Not cheap. Went in on a spur of the moment. Nothing pretty in this p","useful":0,"cool":0},"ZTCaRqA4mKlQRsm3jQBSew":{"text":"If you want to wait over an hour in a bar lobby where you get pushed and shoved, have unfr","useful":0,"cool":0},"n6RevrrsNrO9UednlFr3eQ":{"text":"Food was Ok.  Very touristy and the band was pretty lame.","useful":1,"cool":0},"_gdhdwvh80PWsPUssVNlow":{"text":"The food was alright but you would have to search long and far to find a ruder staff.","useful":0,"cool":0},"5isGY9cazqoLquKtcnfvVw":{"text":"While Mulate's can accommodate a large group, which we were a group of 37, the food is les","useful":1,"cool":1},"mGnj1ETXsQC_ldlkNbePlg":{"text":"Was here awhile ago. I liked the space- big & open. This is not usually my fave food... ja","useful":0,"cool":0},"sHqLuvn70DbnmUyZ-LyLzA":{"text":"I was visiting for the weekend and went there because of the history of the place. I had t","useful":0,"cool":0},"ZubFBQPpbfd1nCxCT6PClA":{"text":"Food is mediocre, plain and dry fried food. Atmosphere is loud and tight but good service.","useful":0,"cool":0},"KccLLnqI2wPiYWNqdIMUSA":{"text":"We went because the outside looked good but the actual location was very poor. The food we","useful":0,"cool":0},"HjjZJtQO9yS9urQx9SknoQ":{"text":"The food was very tasty, but tiny portions are expensive. The service is poor even when it","useful":0,"cool":0},"fMbjYpuqJMSbPU_UYRWfLQ":{"text":"Seafood gumbo had shells on shrimp.  Service so bad my sister went to the bar to get more ","useful":1,"cool":0},"FE6E0-qsEQH7nqO8u-NPaw":{"text":"I gave them two shots.  One for lunch which was OK.  Dinner was not so hot and about 60% m","useful":0,"cool":0},"pXBKSBwqlAQGjTjuNfcPFw":{"text":"Everything was delicious! We were seated quickly and our server was awesome. Highly recomm","useful":0,"cool":0},"tDPvB6eskmjoLkZebG1BnA":{"text":"After reading all the negative reviews I still decided to give Mulates a chance. What a HU","useful":1,"cool":0},"nIucencBOEVdw4BQumXFAA":{"text":"I need to start with the staff. NOT at all welcoming and when we left, they could care les","useful":0,"cool":1},"TrR_OwW7ncVJCliCv-Phkg":{"text":"We went for the music and the dancing. And it was good. La Touché plays short sets, mostly","useful":0,"cool":0},"Fp59XbViCYod9oNAj0pBqA":{"text":"I came to Mulate's on a quick lunch break while I was at a conference at the convention ce","useful":0,"cool":0},"Fjyx2z5BCJqtnnnveTIKIw":{"text":"Boyfriend and I came here for our second dinner in New Orleans.  We were actually heading ","useful":0,"cool":0},"5KMxxRTgU-j5b4gJTV7qDw":{"text":"I have eaten at a lot of restaurants in NOLA and I will have to say this is one of my leas","useful":0,"cool":0},"APyVZpgx7Rsa05Z8In3r5Q":{"text":"Recommended to us by locals, this was a great spot. Alligator, frog, jambalaya, bread pudd","useful":0,"cool":0},"q8qYbiRZ9B-HjS8G4y5Cbg":{"text":"Bro, amazing food, and great service. Had a group of 9 and tried every dish. Everything wa","useful":0,"cool":0},"azgi_BtGo4vupNQDuLxhiw":{"text":"This place has okay food. I wouldn't recommend it if you are looking for a good place to e","useful":0,"cool":0},"UgR87Ci4eigqPyT9ZEWo6g":{"text":"This was the worst dining experience I've ever had at a restaurant. First off, we had 5 pe","useful":0,"cool":0},"ikBV9A2bNMl1Z9zkvTKu9A":{"text":"I am not a picky eater and almost never complain about a restaurant, but this was probably","useful":0,"cool":0},"KcR_JbIgDvyMJ9_9_keBmA":{"text":"It astounds me that this restaurant only has three stars.  My experience was wonderful  Th","useful":1,"cool":0},"eekvGHjJO-yxViVUYNvJmQ":{"text":"Service was not at it's best.  We arrived at 2pm mulate's platter not fresh and not worth ","useful":0,"cool":0},"Qb6QEs3QzWd8kxXQ-2C73Q":{"text":"This place was recommended by one of the locals but it was just okay! Lee ordered gumbo, b","useful":0,"cool":0},"9-aVZ1sUHTF3SeAPxhOQYw":{"text":"The restaurant has become a tourist trap.  Food quality is poor.  I had the catfish mutate","useful":0,"cool":0},"HxQ2nOEm5Gxhse91vMeQGg":{"text":"Second time in two days. A repeat performance. Can't go wrong with the red beans and rice,","useful":0,"cool":0},"jNLGOGukMOyOeAaqzHhrug":{"text":"Two cocktails, a small soup and two appetizers for $60.  Shrimp was not deveined. I've had","useful":0,"cool":0},"eHZdUEANc8n3-Ik5HXy8NQ":{"text":"I cannot recommend this place. I gave it 2 stars because the food was acceptable, but the ","useful":1,"cool":0},"EH6GtekTrdq5NPbnDnCD6g":{"text":"What an awesome dining hall.\nBest Blackened Alligator I've EVER had!!\nGreat for a couple o","useful":0,"cool":0},"JH_3Q0QHpdNgAk1Hf2wKxw":{"text":"I fail to see why Mulate's has not faired as well with their star rating on Yelp. They are","useful":0,"cool":0},"FFacsrlVRyzA9cZs8ymcVw":{"text":"Three stars for their handling our group of 100+ very well. First, this place is kind of b","useful":1,"cool":0},"B-0mTKWbDC0-4a3QX-1_HA":{"text":"This place was by far my favorite restaurant I had on my trip to NOLA. It was recommended ","useful":0,"cool":0},"k2upo5t8smQZzoN-fe4Ovw":{"text":"Lots of folks so it gets noisy...but that's okay because I don't mind noisy!  Servers were","useful":1,"cool":0},"T-PXr3CkHyBkLxXTsOHmWQ":{"text":"Quick service. Great waiter. Scrumptious food. Jambalaya was good. Red Beans and Rice was ","useful":0,"cool":0},"hiQIAwIiSQBLV9ZS8TkLzA":{"text":"I came to New Orleans for the NBMBAA conference and had been excited to come for months, s","useful":0,"cool":1},"N9hs35YYxzhkjNv5lMJTow":{"text":"It was pretty packed at lunchtime(probably due to the conference across the street) and so","useful":0,"cool":0},"KNm_ShNp25GxV20jfus-DA":{"text":"Seriously over-rated and over-priced restaurant. The food itself is fairly tasty but not t","useful":0,"cool":1},"955xW8-b0RmAfa2J-3RzfQ":{"text":"I ordered the grilled Cajun platter and it was pretty good. The spices were nice and they ","useful":0,"cool":0},"cK8fEr8efpUgeXBCL-ji9A":{"text":"Service was very fast. I had the Cajun Ribs, they were good but not the best I've had. Thi","useful":0,"cool":0},"QJcNg984wjlYKy9GXB_yxw":{"text":"I wouldn't recommend anyone eating here. I ordered the house salad and seafood gumbo. Half","useful":0,"cool":0},"vuM_Ur642vRczaBnT33pTg":{"text":"Decent lunch spot near the convention center.  Prices are a little high ($20 sandwiches) b","useful":0,"cool":0},"jngNk2-0KvFe6cf37-rhQA":{"text":"I visited Mulate's for lunch. It is a large restaurant and I was easily seated. The checke","useful":0,"cool":0},"hu-0Px6GhX6wlkFIbvUMgA":{"text":"This place is absolutely great. I was very pleased with the customer service. I would defi","useful":0,"cool":0},"-tMTUZ81xCFwGQ-L8ZBtcw":{"text":"There was nothing special about Mulate's, but it wasn't bad.  I was in New Orleans for a w","useful":0,"cool":0},"9dG5WXrNJeyOak0T5jktkg":{"text":"I am not normally a person to write a negative review, but I have to make an exception in ","useful":0,"cool":0},"ntZ-W5BDG2E1WItLeiNd0w":{"text":"OMG...Lots of food that's pretty good.  Fried chickenn wings were enough for a small count","useful":0,"cool":0},"zcU9RH50u9pTo17mXJAGVw":{"text":"The menu is extensive. We had a group of 60+ for a conference networking lunch for our aff","useful":0,"cool":0},"GAEcZGJCHjNtcTUhlrqIBA":{"text":"Mulate's food was just ok. Prices were higher than expected. Four of us ended sharing a sa","useful":0,"cool":0},"GuptHdeSbA39YTsT0RAUiA":{"text":"After a particularly long day at the Convention Center, our group decided to walk to the c","useful":3,"cool":3},"BG7lsWlMv2badkMq9z1pQg":{"text":"After reading the other reviews, maybe we just ordered the wrong items. I was not as impre","useful":1,"cool":0},"NxxG3Qv1dIKp6OZDCHxdDA":{"text":"I was excited to visit Mulate's because of a friend's amazing review. We were quickly appr","useful":0,"cool":0},"qY4iI8IxJAeeLTVMaP5deg":{"text":"IF you like cajun music or zydeco, or are open to enjoying them, Mulate's is awesome.\n\nLov","useful":2,"cool":0},"uXV8YuUl5mVebHwdWHZdBw":{"text":"Great location! Our waitress was Felicia and she was awesome! She made recommendations for","useful":0,"cool":0},"gYOGX2FRc81M1OnGLyiP0A":{"text":"Wow, service is slow!!!  Stopped in for a quick dinner and waited close to an hour for a t","useful":0,"cool":0},"G4hQF4emxXftd3C_-niziA":{"text":"Another restaurant that we went to during the conference. I was staying at the Wyndham hot","useful":3,"cool":5},"Lsn6EzrWyjAH_1bLuZ23aQ":{"text":"During the 2014 WEFTEC convention, our group of 4 went to lunch.   The wait of 35 minutes ","useful":0,"cool":0},"irRiYyA_ZDvDk9HCA98KTg":{"text":"The food was ok..   there is much better food in New Orleans....\n\nOne of the biggest thing","useful":2,"cool":0},"n2DSmK7fAZG67dIpxuzm7A":{"text":"Very disappointed...incredibly small portions of food that tasted old, not fresh...and for","useful":0,"cool":0},"SDRvKMrpXsZGAtZXzGBy5w":{"text":"Mark the RVr here. In NOLA visiting  with friends who brouht us here. Good band on Hallowe","useful":0,"cool":0},"en1EitolgzUkZVO7XpE93g":{"text":"Great service and good food. ;-). Little pricey. But that's the location. The service was ","useful":0,"cool":0},"cFfPhXsnv3b94JvNyIAOLA":{"text":"We went around lunchtime on a Monday. The restaurant was fairly empty, so we were seated i","useful":0,"cool":0},"_OxiB3hryhUUwuli4SD29g":{"text":"Tried it tonight after reading the reviews and it was pretty much as I expected. Decent fo","useful":0,"cool":0},"EjOt1ZTHWCKp_9xtnDHbww":{"text":"The great etouffe saved this review from a 2-star rating. Let's start with the good: the e","useful":0,"cool":0},"xD8HEOcuf3c4dCx7bj7wSA":{"text":"The location and atmosphere for this place are incredible. We walked into a party with a l","useful":1,"cool":0},"85qMaNzpBv1ThJzkagNxOA":{"text":"My daughter and I visited Mulate's about 10 years ago, we were in the area visiting Colleg","useful":0,"cool":0},"SEE44wDo1OP3oA6Rn0Se5A":{"text":"Best Frog Legs I've ever tasted!  Great family style restaurant, music and dance floor in ","useful":0,"cool":0},"VKWY_udMjXtc0XD9pWdv9w":{"text":"This is a great location especially if you are staying in the area. They have live music a","useful":0,"cool":0},"7ODBf5yNTWSo3WH5xkhnNQ":{"text":"Great fried seafood! My husband and I stopped in and enjoyed ourselves.  Friendly staff, u","useful":0,"cool":0},"49HFA6OnkAH_kqY6SvZWfg":{"text":"Hands down my favorite place I ate at for my random girls trip to New Orleans. This was a ","useful":0,"cool":0},"iPSRLVCacP5f5faht9bzVw":{"text":"This was by far the coolest restaurant I went to in New Orleans. My boyfriend is really in","useful":2,"cool":0},"PNzzadQ-CxWGUE7s3pNbvg":{"text":"I eat here a few times a year when I'm in from Houma, and I also ate at the one in Breaux ","useful":0,"cool":0},"UfsX5tSXnr69lLWIOK5adA":{"text":"Special was soft shell fried crab. Served room temperature in this case - fried ahead of t","useful":1,"cool":1},"X5DBsnPSZva4rkWPB0stWw":{"text":"Excellent food, Great service and live music.  I ordered the Blackened  grilled seafood pl","useful":0,"cool":0},"YBnf3brRVoLu0Ft-jZGgxQ":{"text":"Huge portions and a fun atmosphere. A great introduction to Cajun food. I had the grilled ","useful":0,"cool":0},"nIx_qXlL-nR4O3qPkeD8mA":{"text":"We had a really great time here. It was packed, but the music was really good and it was s","useful":0,"cool":0},"n48bD9gcbBmp4iQD7l5mtg":{"text":"Lived in NOLA all my life and it took me 29 years to go here. Great tourist attraction - L","useful":0,"cool":0},"OmyMY5oUv7NXWptrPZuxXg":{"text":"Staff was friendly and attentive. Prices were a bit high for what you got, but my family o","useful":0,"cool":0},"bsUl55k6buLPRFuFAOddNw":{"text":"So the food was 3.5 stars but the price is 1 star. On her friend's recommendation, a colle","useful":4,"cool":0},"mS_gC_kE9KC97P-VKbMtSQ":{"text":"Such a tourist trap. They had a spacious venue with live music and dance floor, but the fo","useful":0,"cool":0},"8lzMYsNOL62PbUlOLZLb3w":{"text":"Meh. Overpriced tourist trap. Food was bland. Buddy got the Cajun grilled oysters, only 6 ","useful":0,"cool":0},"_SaikutUoELI7Rw_mz4OIg":{"text":"My husband and I celebrated my birthday here. The moment  we walk in we felt like family e","useful":0,"cool":0},"HfZWT5Cf8xY63-IJ-iOgyw":{"text":"Excellent, down home food.  Huge portions.  I had the Grilled Chicken on salad.  Loved all","useful":1,"cool":1},"VM4VEUrwNXoifdjEAxLw7A":{"text":"We have been 2 times - the first time we had such a great experience - they had Lee Benoit","useful":0,"cool":0},"jGgKvv71lPb4lXrIxEpvfg":{"text":"Great food! Great music! We wanted to take our kids someplace to experience zydeco music. ","useful":0,"cool":0},"IvTiGTexuaGZbbNTVC-xbg":{"text":"Great Family dinning with live music. Excellent variety Cajun menu items and a lot to choo","useful":0,"cool":0},"A13HH6nJ_xTIpgz6i9PaAQ":{"text":"The highlight of this place is the artwork on the walls, but this is a restaurant and not ","useful":0,"cool":0},"rE9YWGg9Sv6BjA_umseX9Q":{"text":"The grilled stuffed crab was amazing! Also recommend the mulates Jambalaya and the twice b","useful":0,"cool":0},"WV4kp53WzivKmY9XY1OUjg":{"text":"This place just plain ole sucks , serving fried food that was cooked an hour ago and refry","useful":0,"cool":0},"UHwHORqkyMTSX9NvL2qYyA":{"text":"It's difficult to compare and review cajun/creole food after eating at Felix restaurant ye","useful":0,"cool":0},"Kk1VjK1mFW8oIDoZPY82Bw":{"text":"Honestly, it's good food, good beers, and good atmosphere at Mulate's.  I attempted, and s","useful":0,"cool":0},"xYjTcgJzgXJRl2YDAYwisA":{"text":"I'm in New Orleans this week training a new employee. Since they live here, I let them pic","useful":1,"cool":0},"-OrMq8X9rjvkX6cegFn-vw":{"text":"We have had amazing food in New Orleans. This place was not one of them. We had a group of","useful":0,"cool":0},"hEAbO8b-cwJzxPHuG0Xefg":{"text":"Was on the NO bus tour when we started getting hungry. One of the stops was down the stree","useful":0,"cool":0},"85AvxFqZRO2ErgL7Kxtcog":{"text":"I can't understand why this place only has 3 stars. Our server, Farris, was amazing. She r","useful":0,"cool":0},"XUckrQjGuqFuepKMQSs2gA":{"text":"Solid versions of Cajun classics here.   I had the crawfish etoufee to start and the black","useful":0,"cool":0},"2Hl3kBFzTA6EencjqBkObg":{"text":"Food is overrated; I had the seafood gumbo that wasn't bad, but nothing to brag about. I e","useful":0,"cool":0},"S59Nh-RJxy_AHcgAJakqiw":{"text":"Been a few years since I was there, but they food was amazing! Big place, as well.\n\nMy fri","useful":1,"cool":1},"m0ITvG4ovk14BGeJ_ivwIg":{"text":"Yes it's touristy and convenient, but the gumbo was quite tasty and fresh, the Bloody Mary","useful":0,"cool":0},"6fQJvkdl9CnndFyN1NC6nA":{"text":"Low stars for service! \n\nOur friends walked in while we went to find parking, on a Saturda","useful":0,"cool":0},"ZPVAZ3IkigsS14P5SZgyBQ":{"text":"Good food made even better with Zydeco music night's at 7. Really fun place. A big, roomy ","useful":0,"cool":0},"foaPQrgiBIlUny90GzLeBQ":{"text":"Same as most reviews.  Fun atmosphere, great service, bland overpriced food.  Good drinks ","useful":0,"cool":0},"PdCF5iblAoTIgiKNcLxcqg":{"text":"Place was good. My parents dined here 30 years ago. Got the calamari and cup of gumbo. Onl","useful":0,"cool":0},"xmpoazojIYttUItI3pyrpQ":{"text":"I wanted to treat my family and friends out and they had a lot of the cuisine we were look","useful":1,"cool":0},"cYxFoFUh_gXhxnpC0p-tVg":{"text":"I was in New Orleans for work and every time we walked past this place to head to the conv","useful":3,"cool":1},"gXNYubkm9zVf_kJ9_VF4cw":{"text":"Unfortunately the wait staff ruined everything positive about this place. Service was horr","useful":0,"cool":0},"TPLljLd04gVCFdpP7pk1Lw":{"text":"Invited to a corporate dinner at NOLA Warehouse/Business District, this restaurant not imp","useful":0,"cool":0},"oaPcYJ8EY7_jVS2NVeDxEg":{"text":"The food here was the least exciting meal I had in NOLA.  Wife said the gumbo was good, bu","useful":0,"cool":0},"i6Xj6OjLIxXSJAVFioCgAw":{"text":"This is okay if you're in a hurry, need to be fed, want to try a variety of Cajun dishes, ","useful":0,"cool":0},"hca_3UgfyGAtMtJVLT-eNQ":{"text":"The food was ok.  The atmosphere was no good (very big, warehouse-like space).  The people","useful":0,"cool":0},"GstHH51rFjs56qnIIVIH5w":{"text":"Do not understand why their rating is so low! Service was amazing and the food was fantast","useful":0,"cool":0},"NWTKQrkJSwoBuohXLKVSaQ":{"text":"This place was not great. The food was good but very pricey for what I eat. The service wa","useful":1,"cool":0},"C8rT_8DRacEI170M1ulB6A":{"text":"This place came highly recommended, as evidenced by the number of glowing reviews here on ","useful":0,"cool":0},"C7sDCNVeWFU0jTUTguvt1w":{"text":"Lots of folks so it gets noisy...but that's okay because I don't mind noisy!  Servers were","useful":1,"cool":0},"0UbBL1XRs3L-oO1cd1Xd9g":{"text":"Great for all ages!\nDelicious cajun food!\nFun zydeco music and dancing!\nPerfect place to e","useful":0,"cool":0},"uIs7otK8g2jw4CwHqtpBAg":{"text":"J'ai été plutôt déçu par mon passage chez Mulates. \nSi l'on va dans un endroit pareil c'es","useful":0,"cool":0},"D_w_6oY1o6z9H4qtLT5U6A":{"text":"Always fast and tasteful Cajun food! One of my favorite restaurants in New Orlean. If you ","useful":1,"cool":1},"zwVveq0f622LrYHfXhavpg":{"text":"Thirty minute wait for a waiter to come to the table.  After waiting again for some time, ","useful":0,"cool":0},"stKIxkpahu1FpuKbQrGL3g":{"text":"Excellent staff , environment, and the food was absolutely delish. Everything came out hot","useful":0,"cool":0},"2amoLJKRP5DyxfJV0_YvMw":{"text":"The owner of this restaurant had better wise up and train their managers better.  The menu","useful":0,"cool":0},"LJUnYjUry9af_UMowrHDfQ":{"text":"Awful. The food is terrible! If you are going to go here order the smaller thing on the me","useful":0,"cool":0},"bNDI7hfAYlAZ_ETnMLSH8Q":{"text":"Best zydeco gumbo EVER. \n\nConvenience to the convention center can be beat. Friendly staff","useful":0,"cool":0},"tHzeigXejC5pmj6i41jMRw":{"text":"Hostess were not hospitable, they are the front of the house they have to be enjoyable to ","useful":0,"cool":0},"LhAIEBc0fm8MJ_zYP_e1UQ":{"text":"Congratulations Mulate's! You were my first bad meal in New Orleans.\nI judge a restaurant ","useful":1,"cool":0},"s8PW2M2umeSijV0k5Nw1Sw":{"text":"My Mutate's experience was salvaged not because of our waiter, but our bus boy Mike.  The ","useful":0,"cool":0},"O93RG_3rAtjOrWNF4ts5yw":{"text":"Food was amazing...four people at the table and four winner dishes. Flavors were spot on a","useful":0,"cool":1},"msk3CpjZ-fY5WlQbcFH3nw":{"text":"This is a real taste of New Orleans.  Everyone sat at large tables, Zydeco band played in ","useful":0,"cool":0},"V1QiwWl1w25Egvht7femvw":{"text":"I ordered the Seafood gumbo and my husband ordered the Jambolaya and we also ordered the g","useful":0,"cool":0},"JMJgglvSVZ6ox0Udcv_gQg":{"text":"I had the crawfish ettoufe.  It lacked flavor.  Very dissatisfied.  The Onion rings were g","useful":0,"cool":0},"4NIsUckfIQFdp5ByeTsukA":{"text":"Very good service and food was very good as well. Not a formal restaurant but still very n","useful":0,"cool":0},"cUx_3hXnord8UsLIij96Aw":{"text":"Great food and atmosphere for a fun lunch in New Orleans. Service was prompt and friendly ","useful":0,"cool":0},"XMiOP3wNprgLRoWaxcnfxA":{"text":"Even though Mulates has a large and delicious sounding menu, I avoided them due to the med","useful":0,"cool":0},"_oC0EiI54jSoxkTDYLE-Mw":{"text":"Although this restaurant is convenient for conventioneers and the atmosphere is fun - espe","useful":0,"cool":0},"IrngRZKl0jw3WEMdl8DqCQ":{"text":"First off, easiest way to get there? Walk thru the Riverwalk mall, exit at the end, and ta","useful":0,"cool":0},"zHft1r91fgZxaotS296TLw":{"text":"Fried Alligator! That's all I went there for. My one and only visit to this place. Damn! W","useful":0,"cool":0},"-sZWQcgQULxWz8VFgo2oTQ":{"text":"My wife and I along with 8 of our friends had dinner here yesterday.  We were all please w","useful":0,"cool":0},"9DO_GlgC7hLouq0Z1WQ0Tg":{"text":"The music and the dancing was a lot of fun, but the food had too much breading on it and l","useful":0,"cool":0},"Vm3cJq8Z1LN-llq-TpKoRg":{"text":"Had the red beans & rice and Seafood gumbo.  Both provided a satisfying lunch .  The seafo","useful":0,"cool":0},"12q2Hc11pNoaYGTDQjN1fQ":{"text":"Directly across from the NO Convention Center, this is a GREAT lunch spot if you are there","useful":0,"cool":0},"9dGLLEAkRFwjjOobPaNqxw":{"text":"Mother in-law who is a big fan of this place insisted that we eat dinner here and enjoy th","useful":1,"cool":0},"7RtvhkiRhm3UQZLG8l2HaQ":{"text":"Came here several years ago on a Friday early evening and the place was hopping and lively","useful":0,"cool":0},"NqSKHltt20a_iFE06CWLYA":{"text":"Felt like a mix for locals and convention goers.  Good basic food though I only tried the ","useful":2,"cool":1},"G9sjqJAY1bbOmQNgodZYYg":{"text":"Tourist attraction joke. Go if you want to pay 100 dollars for some crappie watery gumbo a","useful":0,"cool":0},"N6jx5iF77JJ8BuhajlHdNQ":{"text":"waited 45 minutes and we're never even acknowledged at the table, no one said we'll be wit","useful":0,"cool":0},"dVw5oOAg8EfDxpFHycAILw":{"text":"The decor, the music, and the general Mulates vibe saved our experience, because the food ","useful":0,"cool":0},"im-s37p8ME9o4nPl0frPUA":{"text":"We went here per recommendation from a family member. As my friend said, \"It's the Applebe","useful":0,"cool":0},"2xliWW9aS9IOIbQeU8c7hA":{"text":"Very cool layed back place. Live zydeco music (accordion, fiddle cajian music). Service is","useful":0,"cool":0},"ORAFU36tP2GPXvqpIfoHsw":{"text":"Well, if you like loud, louder and loudest music, talking and general noise you've come to","useful":2,"cool":0},"6UZzVe3T0OeOgXxkjsuz7Q":{"text":"Um, I don't think this is where real New Orleaners go for cajun cuisine. It was just ok.  ","useful":0,"cool":0},"wrd3YFz7oG52g9kzgaQuJw":{"text":"We ordered a catfish po'boy and the shrimp etouffee.  Tried to call our order in so we cou","useful":0,"cool":0},"pcn2Z9l_sPgJNXYX4-4ekQ":{"text":"Was not impressed! The food was average at best, and did not fit the very expensive price.","useful":0,"cool":0},"hc0XV5fM4FAThoDN9446VA":{"text":"We ate at Mulate's during Mardi Gras 2010.  We were very disappointed with the food.  Over","useful":0,"cool":0},"s-RqQjlRSxlm1fjc7pUI_A":{"text":"We ate here for our first meal after running a half marathon we were in town for.  It was ","useful":0,"cool":0},"CzfBcvljjcI3MNV2KbGbbw":{"text":"Let's start off by saying the live music & dance floor was amazing!!! First time I have tr","useful":1,"cool":0},"YQOCQrcKr8xu_1wIVRgn4A":{"text":"The Hurricanes were good; blackened alligator was fair; zydeco gumbo was fair. The music w","useful":1,"cool":0},"EbrIsqLGAQ4bwYUqKNHpeg":{"text":"First time back in the Crescent City for years so I checked the reviews on Mulate's, The O","useful":1,"cool":0},"cFfHgfsx_jIFbwcM0myLNQ":{"text":"The food was ok. I order grilled catfish. The fish had a good favor but not fully cooked. ","useful":0,"cool":0},"9S74-7-a0JH8mLvqmTt1Wg":{"text":"Last night on NOLA wanted a mufalota.  Walked to Mulate's from hotel.was well worth it.  H","useful":0,"cool":0},"sbTdi-uOI43fovYGOo-6Sg":{"text":"Went here for lunch, the muffuletta was yuck.  My son got crab stuffed shrimp ver tiny shr","useful":0,"cool":0},"dmmI3mUQheLQLz0bBh6SGg":{"text":"I'm giving it 4 stars for the service and elderly dancers. This was recommended to us and ","useful":0,"cool":0},"WIXRM81UsVgYCDK3u3AWPg":{"text":"The servings at Mulate's are obnoxiously HUGE - a tremendous value for your money (the mos","useful":2,"cool":0},"zIe1_u1FJfxFB38ZzoZ-Bw":{"text":"I had the gumbo and my wife had the jambalaya, both where delicious. Finished it off with ","useful":0,"cool":0},"1xe4cJHZHlA9GYjzCwnBJA":{"text":"I really wanted to like this place. It was very crowded, full of kids, and chaotic. Not a ","useful":0,"cool":0},"y8vISdzVArpQUFBo22hUHw":{"text":"Stop by for a cold brew after a long walk from the convention to Omni hotel. Didn't have m","useful":0,"cool":0},"8gM_AvFu2xa3g4FxsqyZ9Q":{"text":"Regularly come here whenever I'm in New Orleans -- it's crowded, often loud, maybe a littl","useful":0,"cool":0},"ew7nG7arQTlTc38wiTzgBg":{"text":"Just because its right down from my hotel, after two days at the conference center, the ev","useful":0,"cool":0},"SnWMvtbJOFhjYHXqSaETmw":{"text":"One of the most hidden treasure in NOLA. It's a place to celebrate life with friends becau","useful":0,"cool":0},"urnk1lkZhxrui4P-oyr8uA":{"text":"Just left this restaurant and I am so not impressed - The food came out Luke warm & not ho","useful":0,"cool":0},"jfFslVweiXRvHvMAOl5r9Q":{"text":"Had the snapper with the crawfish sauce. Incredibly delicious, perfectly cooked and season","useful":0,"cool":0},"WG54s1BJwSeyVlD6l843oQ":{"text":"We've managed to miss Mulates every time we've been to NO.\n\nIt's really known for Zydeco a","useful":0,"cool":0},"L200_A993KhNfmnjo7LWpg":{"text":"Husband and I came down to New Orleans, first timers. We tried this place. Ordered the Caj","useful":0,"cool":0},"EADTqP23NqSUMDVrmP-zJA":{"text":"I stopped by Mulate's with some family members on a Thursday evening for dinner.  The serv","useful":1,"cool":0},"7V3eZtoSJ5X_mVLoU-XGTg":{"text":"I have enjoyed my food-- got grilled gator with double baked potato and coleslaw.. Had to ","useful":0,"cool":0},"FLFTAAEhG7FimOGpRxsa-A":{"text":"Excellent restaurant and service. Josh was our waiter and did an excellent job making sure","useful":0,"cool":0},"6Y5O74qIQDeVHB4UD8LS-Q":{"text":"Came here for lunch with work colleagues. The restaurant is huge. Our waiter was pretty fr","useful":0,"cool":0},"vTdek_10yF1v5SxZy4OJhg":{"text":"I ate at Mulates for the second time during a visit to the 2017 Essence Music Festival.  M","useful":2,"cool":0},"oda2y9RaaZEZnnzTTDsSXA":{"text":"Food was salty and very dull. Was not impressed at all!!!\n\nThis place is the quintessentia","useful":2,"cool":0},"MybXk19tAf-m_VHgVc_siA":{"text":"This is one of those must visit places. Whether you are visiting from out of town or a loc","useful":0,"cool":0},"wf7P60iIPrnl-PmkU1X0Kg":{"text":"The beans and rice were pretty dang solid. The tilapia bites were great. It's a big, roomy","useful":0,"cool":0},"RtXj3-dnVdbPZG8u-5SCoQ":{"text":"Nice Cajun restaurant with live music and a dancing floor. This place was packed on a Wedn","useful":0,"cool":1},"RnWVk99nibaJappFJLOM4A":{"text":"Mulates has been my least favorite dining experience so far. Meh, I've experienced better ","useful":2,"cool":1},"BYffS6Itnl2x7GWkEUTojw":{"text":"While in New Orleans, the best thing I put in my mouth was Mulate's bread pudding, surpass","useful":0,"cool":0},"1zwBZ-l6cEhHJ5xiGedH6g":{"text":"Big & loud, with lots of fried food - however there are blackened options that are really ","useful":0,"cool":0},"_ohGUzFNTpA85d4xRDLXcQ":{"text":"OMG! We came to Nawlin's and the places we've eaten have sucked! We went to Mulate's and a","useful":0,"cool":0},"ca4Gk0tcExg_ozfWLJ9vFg":{"text":"This place is perfect if you're attending a convention and don't want to eat at the conven","useful":0,"cool":0},"NQwp_NLrRdz9dsyRpNr6og":{"text":"We asked the concierge to recommend a lively restaurant with traditional food and good mus","useful":0,"cool":0},"yK5WnftShb0o0Don1SQW_g":{"text":"I had read about Mulates on a couple of different \"places to eat\" in NOLA and was really l","useful":1,"cool":1},"jbSFmyFpLypa644UiMi22g":{"text":"Amazing food good prices. Must try the zydeco bread and the Mardi gras shrimp po boy.","useful":0,"cool":0},"lUYbvm87D9QHiqY_obbZZw":{"text":"Very overpriced for food that, compared to other places, is pretty middle-of-the-road. Tak","useful":2,"cool":0},"4-GiRxicN2u-6atjkqj4zw":{"text":"Had an unbelievable dinner, the bread pudding is not to be missed! Live music was an unexp","useful":0,"cool":0},"Jgx7272BnRV-OvwFvSSReg":{"text":"Went there for my bday dinner last night and the food was lukewarm to be generous. The ser","useful":0,"cool":0},"P4anjE8RKBLCgNwuFpLcHw":{"text":"Sad & Bad.\nStaying down the street at the Hilton Garden Inn, I asked the front desk to sug","useful":0,"cool":0},"xixtxpdOj-rfBSEklKN4-A":{"text":"Food was disgusting!  So bad, only time I've ever refused to pay for the food which was in","useful":0,"cool":0},"W3a57strj38aBzVxMP9hqg":{"text":"Come here from out of town, horrible service, overpriced for small portions. Way better op","useful":0,"cool":0},"9TIWzqis-4ABlpjQdgkHeQ":{"text":"Our Uber driver suggested this place for good Cajun food and it did not disappoint. We tri","useful":0,"cool":0},"C7vc3uo_p-BMcB_0bM8NXA":{"text":"The food and cocktails were good. Listening to the live Zydeco band and watching the dance","useful":0,"cool":0},"HQqctORREV9nTFFQy22PSg":{"text":"Everything I expected it to be. Bread pudding was amazing...and so were the stuffed mushro","useful":0,"cool":0},"zQa3h4lHNHrss1d4w6aRvQ":{"text":"The atmosphere her is a backwoods country barn picnic vibe.  Great live music on the Wedne","useful":0,"cool":0},"IXjp9cARoD_QmuZYJGm3Pw":{"text":"Oh man, I found cajun in New Orleans! Now nola is typically creole. Cajun is hard to find.","useful":0,"cool":0},"cWXH-NQUsqlAl9WKeNiB4g":{"text":"Great ribs and bread pudding, but I had the blackened chicken po'boy and it was great. Its","useful":0,"cool":0},"wwIeLkpvuFRBXSDDal3V3A":{"text":"Kayla is the most polite waitress I have ever met!  She calls me ma'am and it makes me fee","useful":1,"cool":0},"cOPMs_eVIoX8qj7g8dHCzQ":{"text":"Not sure about all the low reviews but I've always had a pleasant experience. They are pre","useful":0,"cool":0},"Mi_QDZHjRtodWeG6tqDmdA":{"text":"I guess while on business, this is a popular spot because of its location to the conventio","useful":0,"cool":0},"1jRAISNk7kucUg1-esSKig":{"text":"Great food, atmosphere and waiter's. You gotta try the oyster appetizer they are crazy goo","useful":0,"cool":0},"0VuDwPb6nXHKMVYN1Bb27w":{"text":"Everything was delicious. I had the Cajun pasta, jambalaya, and crawfish etouffe and they ","useful":0,"cool":0},"j53-iD0V_uzDEFccfxt6HQ":{"text":"Pretty basic food with exceptionally shifty service from the bartender. It was a struggle ","useful":1,"cool":0},"o6EGiZ7qTx61dcVC2tyFjg":{"text":"This is one of those really famous places that you have to go visit when you're in New Orl","useful":1,"cool":0},"ZqGiyjxevS5_Qv6ZEfRMyg":{"text":"Took our reservation for T-day, but they closed the restaurant for that day! I have never ","useful":0,"cool":0},"iMlqva_3zmPGW50Ewi5UNw":{"text":"We've hit this classic joint a few times and it's been a home run each trip. Complaints ab","useful":0,"cool":0},"p-Z-yjFy0TVsddK2fn3wZg":{"text":"Great food and experience service was top notch. Julie was our waitress she is a true prof","useful":0,"cool":0},"okm_Pxa2D3Y2fLGk7luzwg":{"text":"The food was amazing! Great music and staff! They was really busy Saturday night bc of the","useful":1,"cool":0},"Qs9o2zNE8-mRD5KDGWO3iw":{"text":"While driving through New Orleans we decided we wanted to have some Cajun food. I was not ","useful":1,"cool":0},"BKlpQQ5w6ufi4NR1V43yTQ":{"text":"Must have a cup of the étouffée to start. I had the blackened special which mahi mahi and ","useful":0,"cool":0},"otm9QQDTvV7yb5Knpi35nQ":{"text":"Blackened alligator was excellent and the shrimp Gumbo was very tasty as well. Prices are ","useful":0,"cool":0},"x4vPbY5naLf7Z_C3mBhNDQ":{"text":"Good food, fun staff, lively dining room.  Great recommendations from the staff on food an","useful":0,"cool":0},"yZD68bp9k_6mjM5m5KaWDw":{"text":"Disappointed.  Very pricy for what it is.  Designed to catch the convention crowd.  Everyt","useful":0,"cool":0},"yURMlwiDOHrzBTTZyiqFtA":{"text":"I almost passed this gem up because of the reviews on here...the meal was BOMB!! Side hous","useful":0,"cool":0},"q9sX9P1enEJD0TfOhdavyA":{"text":"This was the worse place we visited this time in New Orleans. The Hostess was rude. The fo","useful":0,"cool":0},"l9ZAT3lEH2hJJlfC3Rhfgg":{"text":"They suck! Didn't bring out app or our drink . Meal came asked about app and he disappears","useful":1,"cool":0},"9NFGiSop6Z985cAW74sd-Q":{"text":"Great food, great atmosphere!  We were in town for a saints game, looking for an awesome N","useful":0,"cool":0},"Tdrur0k2i7HxjU6Q3h87Og":{"text":"The food was OUTSTANDING! I was there on a Thursday \"no convention\" night. I cannot say en","useful":2,"cool":1},"8ghrNyxEYhyLDyJyO22PAQ":{"text":"Yuck, yuck, yuck!!! I'm a local and this place has the WORST food.  Sure their is a Cajun ","useful":0,"cool":0},"4OL6E-n8kygXEdmkRpfsHw":{"text":"I came here during Super Bowl weekend so I am sure it was more busy than it usually is.  T","useful":0,"cool":0},"6tksSmfEZa1iyTdJozEPSw":{"text":"We were a table of five. Food was cold. They took it back and placed it in a microwave. Wa","useful":0,"cool":0},"Gy1FC3tq7pY_9p7wcwnhsw":{"text":"I don't get to New Orleans often but I've gone a few times on business and this is a place","useful":0,"cool":0},"QYZSXn4tKgYRlTCZftlYEA":{"text":"Love the live band, and dance floor. But we were sat right next to the band and we couldn'","useful":0,"cool":0},"BP5HPDzIMbWQy9_o1gNerg":{"text":"We had lunch here before leaving New Orleans. Nice atmosphere and great service. The smoke","useful":0,"cool":0},"6A7dq16a3t1lsifSo6BbMg":{"text":"I liked Mulates just fine. It was close to the hotel and convention center  and the food w","useful":0,"cool":0},"VzW4Zqgp6bxLGeBl5K5E7A":{"text":"They had live music and a dance floor which was a nice touch. I don't really know how to d","useful":0,"cool":0},"OYU7HX_U12cpzxInyPFfcA":{"text":"If you're looking for authenticity, then this is not the place to go. When you walk into t","useful":0,"cool":1},"H9VJmKP9FAi_03IumUB86Q":{"text":"Best muffuletta EVER! Wonderful staff too, a must for a visit to New Orleans.","useful":0,"cool":0},"JbbK68QsxMTKiMO5gipNCw":{"text":"I went here with a large party of my coworkers, and I was pretty unimpressed with the expe","useful":0,"cool":0},"itYUJS6qV_LxUzbhU0V7fA":{"text":"This place is AWESOME. The fried alligator was delicious as was the coleslaw! I didn't try","useful":1,"cool":0},"_LqQ7U6OdkMJcL70tAJlpw":{"text":"We went to Mulate last night and had the best time ever! The food was great and the band w","useful":0,"cool":1},"0nFS7UpXR6UmLpv7c6QAhg":{"text":"Franchise or not, this place was good.  At least coming from a tourist.  I got a cup of gu","useful":0,"cool":1},"OyMeRlnZXURX8I48T6uMFQ":{"text":"Mulate's, pronounced \"Mulaats,\" was recommended by half a dozen locals for good food at re","useful":1,"cool":0},"S_F_EPlcDFhhMDwyQaI2xQ":{"text":"Ok, its been a while since we had been here... We recalled we really liked the bread puddi","useful":0,"cool":0},"ixZWuE_XdZEz-Z8viE5duw":{"text":"Who could have predicted that across the street from a convention center exists a truly gr","useful":0,"cool":0},"euWX5oLNOlRH8wJ-_XzjVw":{"text":"Food is terrible,  probably the worst I've had in the city. I don't give one stars easily,","useful":0,"cool":0},"vba6JjrXI1cRNCbPDR_aTQ":{"text":"Staff is very friendly, and there is a very welcoming atmosphere. Food is delicious and ca","useful":0,"cool":0},"a_3mfWq0qzpNVqOojAD7Dg":{"text":"Food was good especially the fried chicken. Service was great as well. Would definitely be","useful":0,"cool":0},"G-P7AicYYabUVATDJTEV9w":{"text":"I recently visited this New Orleans Cajun restaurant on a very busy Sunday night. After a ","useful":0,"cool":0},"H7TLt1SCZsVVtRvwBDrC9g":{"text":"Definitely a tourist location. Service was very good. Fried shrimp poboy meal was very tas","useful":0,"cool":0},"QiECza9-YuuExB3F8mGsbw":{"text":"Well I wasn't totally impressed and the food was just okay for me. Perhaps it because my m","useful":0,"cool":0},"qqA6AuhhlfPkHofe5ncc1g":{"text":"After a long day of conferencing and working this ended up being a good place to check out","useful":0,"cool":0},"PDNEZGzSAtyalb3gJ_vAhw":{"text":"Fun place!  Loved the live zydeco music!  Ordered Catfish Mulates -- crawfish étouffée smo","useful":0,"cool":0},"aCANNUmWamxVLYlI-q4y6w":{"text":"Grossly overpriced food. Waitress seemed more interested in table turnover than good servi","useful":0,"cool":0},"cUeHd9WKo_e2ZKEk24Qfdg":{"text":"My husband loves this place, I think it's ok...  the decor is very plain with slow service","useful":0,"cool":0},"uo330WMZGQPPLqb_c85qcQ":{"text":"Unmatchable prices for this area.  Great for families, live band music, and clean.  All de","useful":0,"cool":0},"fj73K1YQMURNLnnAm9XWhQ":{"text":"Service was fine, food was not good at all.  Someone burnt the roux for the seafood gumbo ","useful":0,"cool":0},"zMrOJ_43oozzI5Iq67NfTQ":{"text":"Good Cajun food and a great drink selection! Kind of pricey. The server (Jesse) was great,","useful":0,"cool":0},"UY77f6qbtv31yNWE3O-Vgw":{"text":"Marginal food and horrible service. Our server was on a smoke break with a member of our g","useful":0,"cool":0},"smBVRGgNZyfKq_mPsvAnrQ":{"text":"Hit or miss... The rice and beans were a standout and the French fries were inedible. The ","useful":0,"cool":0},"wrW_xfCE3GQRgQ7LtZCvTw":{"text":"Loved it! Cajun pasta = two thumbs up. I also like the live music: totally got me in the n","useful":0,"cool":0},"XJPQXH5ox9PdoTZuH1n53Q":{"text":"I never visit New Orleans without having dinner at Mulates.  The best cajun food and reall","useful":0,"cool":0},"tHcaeHE3hVVqxEokzCjUow":{"text":"Wow, what a tourist trap this is. This place sells gumbo at $12 a bowl and doesn't have an","useful":4,"cool":1},"cPOtQ305kMY138pigEU2xA":{"text":"Ugh!!! I had the shrimp po' boy the first time I came and it was okay. The shrimp were pop","useful":0,"cool":0},"SIeUTdVDxYJAVulolnQY2w":{"text":"After arriving to NOLA, my girlfriend and I decided to go to Mulate's since it wasn't far ","useful":0,"cool":0},"_QUy_3doUX3inDIQSMQ9_g":{"text":"We arrived around 7pm on Wednesday and they were pretty busy but we were seated quickly. T","useful":1,"cool":1},"ib8egm3Wdsh85QV4MXyjWg":{"text":"The food here is amazing ! Recommend the crab stuffed shrimp. It was amazing. Strong drink","useful":0,"cool":0},"X4152Lr4WepUjLS8M8OPRQ":{"text":"Nice homey place, vigorous with live band. Everyone was smiling and helpful. The crawfish ","useful":0,"cool":0},"2K9yydfJzuVoKC8x9xyLUA":{"text":"Our family of 6 thoroughly enjoyed our dinner at Mulate's.  This was our first night on th","useful":0,"cool":0},"nFl24aaMnIBB3odO8IdlJg":{"text":"Mediocre food, yet friendly service. \nWe ate much better food elsewhere in New Orleans. \nR","useful":0,"cool":0},"8AxrfZS8_pfJ5gTUzoqx6g":{"text":"Food wasn't anything to write home about. Wait was an hour and place was packed. We kept b","useful":0,"cool":0},"gMM7W0pel4zVMKfUUSRCPg":{"text":"Mediocre at best... Disappointing to say the least!  We stopped in for lunch mainly becaus","useful":0,"cool":0},"2qvT3WcgzZI_FK8NWOgQAw":{"text":"\"meh\"late's\n\nIt's my second time here.. thought maybe my first experience was an anomaly.\n","useful":2,"cool":0},"Ie4gk3-pE0AJP8xxhTN32g":{"text":"Talk about fast service! Food was good and came out quickly. I ordered the seafood gumbo a","useful":0,"cool":0},"WL5HE-li6BbOWg9FAR9NfA":{"text":"Overall rating from Yelp is just 3 stars. \n\nMulate's wasn't our first choice, but we were ","useful":3,"cool":4},"_y2h44k1pYe5FDpaH4eu0Q":{"text":"Overpriced drinks and tried to sneak in premium liquor when I asked for well.\nDO NOT EAT H","useful":0,"cool":0},"YmptawVFw9udjBRfqnLEjQ":{"text":"Came accross this place while leaving the convintion center looked to be like good Cajun f","useful":0,"cool":0},"ioP6QP8nqn0eNrI40-Eu6Q":{"text":"We went here out of convenience because we were staying at the Marriott and wanted somethi","useful":0,"cool":0},"YQDB7_-SokxN8w_w0vWLKA":{"text":"Food was good. If you are looking for a place to get a variety of Cajun food they have a l","useful":0,"cool":0},"nGW14S5jVO_wgL1lglwmkw":{"text":"Was staying in the neighborhood and decided to come here for lunch.  The restaurant itself","useful":0,"cool":0},"-r8klliiRz2ZpKQK-xiaQw":{"text":"Don't even bother. Way overpriced for mediocre food. \n\nI'm really irritated that this baby","useful":0,"cool":0},"YwZGYseLMx4TT7RQa7dmSw":{"text":"Red beans and rice was good as well as the gumbo. It was more of a gravy broth which I lik","useful":0,"cool":0},"22VOlJOvjP7m9czOFRdpMw":{"text":"Brought a big group here due to proximity to convention center. Should have walked a littl","useful":0,"cool":0},"INE6IIQf5j0wMl_yJiZE5g":{"text":"New Orleans gem!! Live authentic Cajun music with dance floor. The food is not only delici","useful":0,"cool":0},"1NRzUQo90AJz59LN2gxbjg":{"text":"If you're unsure on what to get, order the catfish mulate! Catfish is seasoned very well. ","useful":0,"cool":0},"XlxnIpSJsV_FkChkTvpRZw":{"text":"Apparently it is possible to find average food in New Orleans. Our table ordered a variety","useful":1,"cool":0},"38KBegRbviX-qf6WONa2vg":{"text":"Warning to diners--this place is a tourist trap!  I have to be fair, it's not that the foo","useful":0,"cool":0},"uadvsAvFWQhw5s_I1z4Grw":{"text":"Came in after the Saints game for a late lunch. Definitely not disappointed. The restauran","useful":0,"cool":0},"xX588pLdkaJgLGDCefleIg":{"text":"I give Mulate's 3 stars not so much because of the food, but because of the price I paid f","useful":0,"cool":0},"0N02Q-f_jwgluE-d9TUgYw":{"text":"Spent a week in NOLA and loved it, except for our visit to Mulate's. Their commercial on T","useful":1,"cool":0},"30WL6jvL7CF32-0SM1UJxA":{"text":"Went here looking for local food on a trip to the city and visit family.  there were 4 of ","useful":0,"cool":0},"DhK5VQ4Dfp4qzllgFBDedQ":{"text":"What a fun place! We wanted a New Orleans experience. And we got it! The food was good, as","useful":0,"cool":0},"bXVi_fzV5ejTAdB-wMnG0g":{"text":"This place is mediocre... If you've had too many fried seafood platters in NOLA, I will te","useful":0,"cool":0},"VEbpQuVMwW4lA07eCPmlHg":{"text":"Blacken Redfish outstanding. Seafood Gumbo deep and rich. Such depth of flavor. \n\nNot only","useful":0,"cool":1},"wFTi9Kn6OHBpj-OqPr1K0w":{"text":"I passed this place on my way to my hotel and it had the appearance of an established rest","useful":1,"cool":0},"JaTo3GN5vLXDi5zx3ycM7g":{"text":"Mulate'sis super convenient if you are staying at the Convention Center area. The gumbo I ","useful":0,"cool":0},"Za51QWqWpeQ1eqP-w80vyA":{"text":"Food so-so. Service poor. Very over priced for the quality offered. We were quite disappoi","useful":1,"cool":0},"pcw5_CtSffy1MdUb93ulhA":{"text":"I like this place quite a bit -- my parents used to always take us to eat fried catfish an","useful":1,"cool":0},"I-fOP9mHtZwvxvz_yEY_lQ":{"text":"The Cajun sampler as appetizers is the best decision you would ever make... sooo good. If ","useful":0,"cool":0},"KLrMouXyfAFkurIbbhC-DA":{"text":"This place is wonderful and made for an amazing family experience full of laughter, fun an","useful":0,"cool":0},"YPw5amnNkD4Qjt5YSN-lEg":{"text":"Etoufee was only edible...but not memorable. Oysters were good. Though the waitress was ve","useful":0,"cool":0},"gqb13gbrBR-vMZ01IljtDg":{"text":"I was here pre-Yelp days and had a great time.  But time has not been kind to Mulate's and","useful":2,"cool":0},"3NApNIv35E4kalkrpswNAw":{"text":"Mulate's is a family favorite for us. The food is good (not always the best) and the music","useful":0,"cool":0},"9nMOsD9E2bSS_RXt8EzsPw":{"text":"Vibe: this place is more for an older age group I would say. \n\nMusic: The live music was n","useful":0,"cool":0},"Wh1enUhxl_f2Q_KNGQRrzA":{"text":"Some of Mulate's reviews are not particularly stellar, but I enjoyed it! I went with my mo","useful":0,"cool":0},"WbnWSssWojx9P-ig_pDHKw":{"text":"Kind of walk if you are staying in the French Quarter but worth it in my opinion.\n\nThis is","useful":0,"cool":0},"uH4AoN9FCIKRNo1TVNddkA":{"text":"Does your town have a family restaurant that just represents the town? Well, this is that ","useful":0,"cool":0},"ZhelgR3LAyWx9sVvw6MwbA":{"text":"I had the stuffed shrimp and I enjoyed my food. My friends had the pasta and ribs. My frie","useful":0,"cool":0},"4A_m2mKZE6tQp39uV_l7Bg":{"text":"Other than being a little slower in service, this was our family's first experience with N","useful":0,"cool":0},"mAnBRA1Uzm99u3m3QK7kUw":{"text":"Excellent food. The jumbala and crab au gratin were absolutely delish! Try the Abita Rootb","useful":0,"cool":0},"qZrP3L8YDxUnEhHV7Fs9zw":{"text":"We were in town for music festival. This restaurant was in walking distance of the Convent","useful":0,"cool":0},"f5iTXTqh5a1Ux4XyZ8tqUw":{"text":"I was very pleased with my experience here. It was the first stop on my recent trip to New","useful":0,"cool":0},"msEBr7VG5eC_bb6rYV6YBw":{"text":"I had forgotten about this place until I spotted it on the walk to the Port.    After deba","useful":0,"cool":0},"ypwaw5dBIyAhGqwhdeAykw":{"text":"The food was absolutely delicious! Great service. If you come here I HIGHLY recommend the ","useful":0,"cool":0},"kJBydlsPSw32irgos0ggrQ":{"text":"We had a horrible experience.  Bad service and disgusting food.\nOur waiter took our food a","useful":2,"cool":0},"T-nZsduqxIjKZnwleNOfNQ":{"text":"I came here during lunch with a party of 6. We were told that this place is worth checking","useful":1,"cool":0},"pNF69okhz7NQpAl3oSKZDA":{"text":"Music was great. Did not appreciate being told we could not sit at one of the tables in th","useful":0,"cool":0},"bAjHaymxgQMaje3x7CeA9w":{"text":"Food was ok.  Bread pudding was good, music and entertainment good.  Probably a little too","useful":0,"cool":0},"qaWu63UerWeT6A-XcH_8Ag":{"text":"Food was great. Service was questionable at first but she quickly warmed up. Gumbo and cat","useful":0,"cool":0},"1lO26PT1oEWEgf0JIG6BqA":{"text":"Upon finding out that I would have the oppurtunity to go to New Orleans for the first time","useful":1,"cool":0},"ON2BiBWKLoK-ehmIeU0qIg":{"text":"Right at the end of the parade route during Mardi Gras this was an easy choice for dinner.","useful":1,"cool":0},"gVBXU_UU2kb_d5XEcDcQ_A":{"text":"Wife had the fired seafood platter which was way mucho food. I had stuffed catfish which w","useful":0,"cool":0},"QtB3sFpJQL1SL5Ss_jtvGQ":{"text":"Apparently this place is a tourist trap; everything was overpriced and underwhelming. \nMea","useful":1,"cool":0},"T5zx-xH2nCEeCZR0e0j4sg":{"text":"This was one of the highlights of our food exploration in New Orleans. We didn't order a b","useful":0,"cool":0},"CZWOejdzi77FCAwmn2awiA":{"text":"Dropped in and had a great bowl of gumbo and sauted oysters. Add in some zydago misic and ","useful":0,"cool":0},"uEDoNlCdUrssCmr0XIOwtw":{"text":"Beware if you eat at this place with a large group! \n\nWe called ahead to request a table f","useful":1,"cool":0},"_uRqog2u8I94aoGrQVSyUg":{"text":"Mulate was the first local restaurant my coworker and I had our dinner when we landed at N","useful":1,"cool":0},"sz9jMig8JGQehxftQRG-ig":{"text":"food was mediocre, I expected more for it being \"soul food\". I think Popeyes has better re","useful":0,"cool":0},"RZOQYBkzfbv-F2L9SZm-VQ":{"text":"Incredibly disappointed in this resteraut as the prices aren't very cheap averaging about ","useful":0,"cool":0},"oDuI9QlwLrAPTEDcINNk8g":{"text":"I don't understand why this place hasn't averaged more stars.  It a great place next to th","useful":2,"cool":1},"Iqgav8HR3fTNdsUvGk433Q":{"text":"It's not everyday you walk into an establishment look the bartender dead in the eye and sa","useful":3,"cool":1},"deqqNK5qOJ0CiUSExljAnA":{"text":"My mom and I stopped here after shopping in the area. She enjoyed her meal (baked crab dis","useful":0,"cool":0},"EP2LvLy9RkVfRRVkeqAlqA":{"text":"The food maybe average but the whole experience should not be missed.  From the zydeco ban","useful":1,"cool":0},"haAR1Hp-cc28riX36M5feg":{"text":"This was the second place I had dinner in New Orleans. The service was so-so and the food ","useful":1,"cool":0},"6NHP3JOLfR-DZ1W60bsVhg":{"text":"New Orleans gem! Live authentic Cajun music with dance floor. The food is not only delicio","useful":0,"cool":0},"bfswdeuTeWWfzHVoA4PF8g":{"text":"Visiting New Orleans I was hoping to find some seafood (since I can't find any after movin","useful":0,"cool":1},"UKUibcIHCzFClHoOtoaryg":{"text":"Food was average and catfish was very \"fishy\" tasting. Nowhere as good as the catfish we h","useful":0,"cool":0},"X4RIok4jxjijmJ93rVjNRQ":{"text":"Just left a wonderful lunch and Trisha and her staff did an exceptional job!! Great food a","useful":0,"cool":0},"rwcsKzZirlE9xbKhDpSy5Q":{"text":"Mulate's is great for a big group of friends! Out of all the food joints, this is one of t","useful":3,"cool":1},"dt5v2B_GsccJvQIOiOMwEg":{"text":"I only went to this place because a friend of mine suggested it.\nI guess this place is goo","useful":0,"cool":0},"511nfT1EHOAkhtB-Lb8KyQ":{"text":"Was absolutely amazing! Will definitely be back! Local food... Huge portions! Local band p","useful":0,"cool":0},"pohYcTqGQmARlU31hCnZMQ":{"text":"This place did not live up to my expectations. Shrimp a gratin was cold; the stuffed mushr","useful":0,"cool":0},"NnNwtaqyE1GXjkmcZcRiQA":{"text":"It's fine. I had the catfish mulate's which is grilled/breaded and topped with crawfish et","useful":0,"cool":0},"BBbpf2757kWEzbUrGL0lvQ":{"text":"Got in there right before the kitchen closed, but we were still served with a smile. I lov","useful":0,"cool":0},"JuxL72Viw_3zDYyHGCn4OA":{"text":"If you have a large group-no reservations. FYI. Friendly service, conveniently located. Zy","useful":0,"cool":0},"nYNS30mhO_9QhChxBvOQyw":{"text":"We at the original location across the street from the Riverwalk.  I liked my dish (Stuffe","useful":0,"cool":0},"h_yPbyptBFmPGlMnF0Wu_Q":{"text":"All I can say is... BOOOOOOOMB!!! sooo gooooood... the Mardi gras shrimp po boy was the be","useful":0,"cool":0},"g2YajjBgGMCVI9UkNXr4cw":{"text":"Wonderful server! Onion rings were delicious. One of us ordered the muffuletta and the oth","useful":0,"cool":0},"U5kKgIKvaZEPLnz6_MfukA":{"text":"A local recomended this place to me.  We were a little disappointed.  It's good for a beer","useful":0,"cool":0},"tXFrxYNneVtpEe2sYLD-qw":{"text":"I've had better gumbo from burger joints in flyover country, prepared by cooks who have ne","useful":0,"cool":1},"Beoxe3CSGVWbcvZYxsTIIg":{"text":"The best bang for your buck in the area.  Great service with a group of 15.  This is hard ","useful":2,"cool":0},"YIWVRfVWbG4YnHiG-BxXTw":{"text":"Very busy night, hung out at the bar and listened to great Cajun music. Bartender was a gr","useful":0,"cool":0},"f3VxUtoOXqNid1FOhQAlZw":{"text":"I visited during lunch and decided to order a small portion of jambalaya which was a good ","useful":1,"cool":1},"RzCipw7DIpdS01mcKkYvVQ":{"text":"I can't stress enough how amazing this place is! first of all, you can not beat the atmosp","useful":0,"cool":1},"HHbMCu193Lzg7b9mbhkpAA":{"text":"When we walked in we were politely told it was an hour wait. We sat over in the bar which ","useful":2,"cool":2},"Ax2wNJdLmUl3qUoMs9H-Xw":{"text":"Maybe I was spoiled by all the other fine Cajun restaurants in Nawlins, but Mulate's was m","useful":0,"cool":0},"BCHQ_Zi5N5c_PGmsP4ML5A":{"text":"Food is cold no taste should have known this place was no good nobody here due to lots of ","useful":0,"cool":0},"C4N3MF5x1B0R_ww0w0Q_-Q":{"text":"I'm SHOCKED at some of the reviews I see here.  I LOVE Mulate's!  The folks that give 3 st","useful":4,"cool":3},"pm2t8I4cOES6zhH4d7V9-A":{"text":"We ordered two grilled seafood platters, one blackened and one not, to feed five people. T","useful":0,"cool":0},"jUgX0owcB-2hP_2uEXjgDQ":{"text":"Pretty good place for authentic tasting Cajun/Creole food. Live zydeco music and dance flo","useful":0,"cool":0},"_RIF0saHFugeLp74hXX0Zg":{"text":"Amazing!!! Rich and delicious. Went before boarding a plane, so bring the mints and gum fo","useful":1,"cool":1},"XJbzw13Y_TPZXWPKeV11Qg":{"text":"This was by far one of our favorite place to eat when we went to New Orleans. We ate there","useful":0,"cool":1},"Yr1T2t_dnxSEHjM4zcDxUg":{"text":"Crawfish Au Gratin was delicious! Everything seemed a little overpriced for what you got. ","useful":0,"cool":0},"YhJEHaxK8LCk5Bnmogjn5w":{"text":"We were seated st the Bar for our takeout order. It was almost  closing & we were informed","useful":1,"cool":0},"d2xVW9XQf6feRVkt1dpUIQ":{"text":"Located across the street from the convention center, this place is packed during lunch. W","useful":1,"cool":1},"RXIH-ZwHc5pCvKGJ7Mr43Q":{"text":"Thrillist called this one of the best places to find Cajun food in New Orleans, unfortunat","useful":0,"cool":0},"Srz_y1u4taz5_h3BQJiKeA":{"text":"This place sucks!!! We came here with a fairly large party (6 people) so expected a wait. ","useful":0,"cool":0},"482eszNtQkpcHKhQB9JXSA":{"text":"It is a nice Nola restaurant. We went with another couple and enjoyed the music! We had so","useful":1,"cool":0},"6PEGO7EXo96_ugHplWPDeA":{"text":"Very forgettable food, but comfortable Cajun atmosphere. The food was not fresh. Cold catf","useful":0,"cool":0},"p40w9mARQfD1FmnGk66eYw":{"text":"THE only place to eat when stuck at an event at the Convention Center across the street. C","useful":0,"cool":0},"dh_deXBkdksBsrWWkuXmUA":{"text":"This place is expensive, so we all shared a sampler platter.  That turned out to be a grea","useful":0,"cool":0},"xT7-pXBmTQsV8UbkMAXF6w":{"text":"We have been coming to this place for years. We got the sampler platter and be to Talapia ","useful":0,"cool":0},"IQXXcp0y9yzFDpFuYRRF7g":{"text":"Overall, food was okay, service was friendly but below average, and food was overpriced. I","useful":0,"cool":0},"lGPWLuthDd42RmyZH4cMJg":{"text":"They say to each his own so don't let the 3 star overall rating fool you. This place shoul","useful":1,"cool":1},"wT4NYCXWqwJRuR0wh_JQPQ":{"text":"Ate here on the last day our this week's New Orleans trip.  Wish we had gone there the fir","useful":1,"cool":0},"hqKbj5-WJK8Nr7RQHStAhQ":{"text":"The place had a nice family atmosphere and the hostess welcomed me warmly. I was in a good","useful":0,"cool":0},"_Kp8L60B0Ko2QR86GyimYg":{"text":"Just came back from New Orleans on vacation.  We had lunch at Mulate's and had the Cajun S","useful":0,"cool":0},"qwW3Q2nZWOcHcYMDn6avFA":{"text":"We had really bad experience with food here. Ordered seafood salad, meat pie, seafood gumb","useful":0,"cool":0},"GsiqEzrDfiebUVB6XSYVdA":{"text":"Excellent authentic cuisine at a classic spot in the Warehouse District!\nThe stuffed mushr","useful":0,"cool":1},"yHTyg6GEZm2lL6N62KpXmg":{"text":"Local food which very close to convention center.  The live music is fun !","useful":0,"cool":0},"xJ0WR1WisnsKh4ZxF0-G2w":{"text":"Was in New Orleans this pass weekend. The food was delicious. Friday night we had Felecia ","useful":0,"cool":0},"thold2kvxpP5V1C2TEQcxg":{"text":"You can throw a rock pretty much and find a good cajun/creole restaurant in New Orleans...","useful":0,"cool":0},"kiECKGOoCqtOlY3Ne8-qWw":{"text":"First thing you need to know is, for me, one of the biggest criteria is value for the mone","useful":0,"cool":0},"6sxCvuh9LtMu9zidMJvL-A":{"text":"The food was just OK. The stuffed mushrooms were not. They shoved a mushroom into a ball o","useful":0,"cool":0},"BjzVx2csP7nRj_orjf0zMg":{"text":"We stopped on the way from the convention center to the harbor without much research. The ","useful":1,"cool":0},"YEN_-GJVH8iJ3OI_QT3KQg":{"text":"I visited this restaurant in June for my husband's birthday needless to say we stayed for ","useful":1,"cool":1},"04fKrA6TadAOu3jCK9icAw":{"text":"Must hit every time we are in town. Zydeco music is always good. The food is good southern","useful":0,"cool":0},"oNUosorLtUZIS1ZGisF2xw":{"text":"This place is very mediocre and we later found out that the locals call this place a \"tour","useful":1,"cool":0},"9xNJsCfRZz0eg02jXfH6OA":{"text":"If I could give zero stars I would. We were seated and no one came to take our order for n","useful":0,"cool":0},"rWApvQ8otU3P9J0AUCBJBw":{"text":"Kind of like a fast food place with  music. I had fried shrimp and crab stuffed  mushrooms","useful":0,"cool":0},"uRFE4qhfBTukgXSpnk24nQ":{"text":"This place is a tourist trap. After waiting a good half hour to hour we were finally seate","useful":0,"cool":0},"adLibBS3Uv8Qfq1ayo16DQ":{"text":"A group of 6 of us came here at 6:30 PM on a Monday in July. It was the perfect time, as t","useful":1,"cool":0},"Vo3T8vcJCItQwSlTAJmKFQ":{"text":"Food is good, but the atmosphere is what you come for. A fun, low-key, casual place for di","useful":1,"cool":0},"glXJwbu2PJRIYsZzpcCO8Q":{"text":"Great gumbo. Blackened crawdad tails were fantastic. Good service in a casual environment.","useful":0,"cool":0},"IeMzyWS_0lHlZ1ZnnYjH5w":{"text":"Very disappointing. We were told this is a must when visiting New Orleans. I wish we hadn'","useful":2,"cool":0},"0xX2j8K7v5Hxqtal3YJgvQ":{"text":"Loved this place- great food, reasonable prices, and a nice waitress.  Went during lunch s","useful":0,"cool":0},"VJrMYdnkz-4KljJhbgc4GQ":{"text":"Sort of tourist trap across from the convention center. The kind of place where out-of-tow","useful":0,"cool":0},"mBHQgAZ7Aw3Os1JoxTn7SQ":{"text":"Had the crayfish etouffee and it was tasty but very skimpy on the crayfish. Could hardly f","useful":0,"cool":0},"JVFVoYLb5ZtvGJSvMVi7YQ":{"text":"Great food, but a bit pricy. There is live music and dancing nightly. Very casual location","useful":0,"cool":0},"Ee0-os0w56k_PcDyxxR3UA":{"text":"It must have been a bad night, outside of taking into consideration that it's Essence Fest","useful":1,"cool":1},"6h6TSYhMURlo8-OguPm3Yg":{"text":"Delicious food!!  Loved the crawfish etoufee. Very casual place with friendly staff.   Our","useful":0,"cool":0},"thRT96UK79Wr5ufYuB9fDA":{"text":"Guys, not impressed. The food was cold, and fried food cold just doesn't cut it. I got the","useful":0,"cool":0},"OKmQHlN0X-7ze6_5XL-eqw":{"text":"Disgruntled, slow, inattentive service is nothing new in tourist trap restaurants. Nor is ","useful":0,"cool":0},"lINbzBreejErCXvnCG5_GA":{"text":"We came here after checking in for a conference at the convention center across the street","useful":0,"cool":0},"vYYLHCQfT3Crtdt75GZCgg":{"text":"Kind of a generous 3 star.  Stopped by with the young lad yesterday so he could grab a Po ","useful":0,"cool":1},"Wci__Y_hAO2FuNIlBwVHRw":{"text":"I signed up for Yelp just to leave this review. \nI've eaten all over Louisiana and the sou","useful":3,"cool":1},"JC1vf-HV4RpGwkbSV-_tiw":{"text":"I LOVE Mulate's... I always make a trip there whenever I'm in town. Family friendly, good ","useful":4,"cool":4},"xCDo1tYL1rvOCm1MyWr4VQ":{"text":"Had the crawfish étouffée and it was delicious!  I highly recommend trying it.  It seems t","useful":0,"cool":0},"ctRYHygOyJphs9GK5VQ2yg":{"text":"Good, authentic food  in a big restaurant. Very  friendly service. A big plus is the live ","useful":0,"cool":0},"vVhxUBsaj4OzcT9atu5bgQ":{"text":"Giving this place 1 star is generous.  My husband and I walked in and were immediately sea","useful":0,"cool":0},"RptTk5QFxCy4iLtj1KrdPw":{"text":"This place was the most fun out of anywhere I went in New Orleans over a 4-day trip. We ha","useful":1,"cool":1},"JnrejwzBy5tVqZo1fV3lUw":{"text":"The Dark Roux seafood gumbo was absolutely delicious. Had the Blackened Redfish lunch spec","useful":0,"cool":0},"GMIerIjYV3I3LxXL1DNA7Q":{"text":"Very expensive and the food is just okay nothing special. If the prices weren't so high it","useful":0,"cool":0},"b-iBs4XFdx-ISTCmJIT6KA":{"text":"Great food, great music, and poeple dancing!  If you want true Cajun in downtown New Orlea","useful":0,"cool":0},"pGAR8ymTuU-A-35q_XdMNg":{"text":"I am not sure why this restaurant gets poor reviews so often.  After a week in New Orleans","useful":1,"cool":0},"pacSXZr8TE8s6xUlSaj0WA":{"text":"Not worth it, Ridiculously overpriced!! Kids selections for 12.99 without a drink. Gratuit","useful":0,"cool":0},"vkvvlD8oZ_LDF_ygd1aUsA":{"text":"Came on a not busy Thursday night. Service was prompt, margarita was good. Live music was ","useful":1,"cool":0},"haayLuultBg4_eum3nkJEg":{"text":"Left much too be desired. Fries were overly seasoned and catfish was just that. Fried catf","useful":2,"cool":0},"dlUILsl_DVmbCyuSAVHf3g":{"text":"My out of town friends needed a venue with good drinks, local entertainment and good food ","useful":0,"cool":0},"wS96SAoRYa7x4LiGpn6IcQ":{"text":"I have been going to Mulate's since the 90's. I have noticed the quality is really startin","useful":0,"cool":0},"rlZao7pUejBUphOlD6-0-A":{"text":"all i can say is bland and no taste. need a real  chef to come in. chef irvine needs to ta","useful":0,"cool":0},"1DkE5puIVBrn5TMlVJgyig":{"text":"Everything was great! Food excellent, loved the music. Thank you. Gumbo & catfish could no","useful":0,"cool":1},"coWxNIsd6gFznI3wK-tK3g":{"text":"I ate here on 14 January 2019 at 1235 pm and the food was not good.  It was very expensive","useful":0,"cool":0},"R2PkkEwb8O7TUq7qMUzYQw":{"text":"huge place, live music..the zydeco band was awesome people were dancing. great for huge gr","useful":0,"cool":0},"ttwLUm1q5phlQiP-JsDNIQ":{"text":"I have been to this place twice. It's always busy but the staff always serves you with a s","useful":0,"cool":0},"Jtr-O69LorBZ0K5f46hNXQ":{"text":"We had a pleasant experience here at Mulate's. The service was excellent and staff members","useful":0,"cool":0},"zISWW3PwGMWCWtD-qvxImA":{"text":"I'm visiting from Oklahoma.  We tried the the blackened gator. Lemme tell you it was delic","useful":0,"cool":0},"b2X3DQyoD1D7AF_yVwGPWw":{"text":"This place was recommended to us by our concierge.  We told him that we just had an awesom","useful":0,"cool":0},"bgfM7LHfW2_YOSmoJmwB2w":{"text":"It's been a few years since I visited Mulates but I went twice in one trip! The service wa","useful":1,"cool":1},"Cb-9iwKYGynxDqzuSPxvBQ":{"text":"We had an absolute fantastic time here! Came in with a large group- the food was delicious","useful":0,"cool":1},"_rV5eN3AB7l-hULCK2baXA":{"text":"This place was awful. Extremely pricy for horrible quality. The server was very kind, atte","useful":0,"cool":0},"ZcidPxfvyx58OzKJ4JujoQ":{"text":"This restaurant is by far the worst when it comes to Cajun food. My food was horrible. The","useful":0,"cool":0},"yze_w-R_E4icVqYVdkWOFQ":{"text":"Took my 78 year old father there; he hadn't been to Mulate's in several years.  Staff was ","useful":0,"cool":0},"0gkYZC_MKTNqsRQv6H29hQ":{"text":"Update- went back to mulattes recently and was terribly disappointed. Ordered the same thi","useful":0,"cool":0},"kCE5EsepUcxNY8JqehVLjQ":{"text":"first night in NOLA we went here and they did not disappoint. by far the best bread puddin","useful":0,"cool":0},"XRrCBfzH4HdDjOYEcQzPKg":{"text":"Dayum, I've waited for almost 15 years to go to Louisiana to try their gumbo. I went to th","useful":2,"cool":1},"Q_fQCL0-gliX-2A8_xO9lA":{"text":"I had the fried shrimp.  Yumm!  They had a band playing zydeco  music.  It was a true New ","useful":0,"cool":0},"t6Q8-XaFzTbOqOmezSYajA":{"text":"Reviews are spot on..  Good service, good food and great atmosphere.  The price was just t","useful":0,"cool":0},"0Z1-0mkH82L2rMLFl_ODYA":{"text":"Great food. It took almost to the end of our meal for the waiter to open up but otherwise ","useful":0,"cool":0},"Ny8tu-gy_i7VKsBnHyd3Uw":{"text":"Excellent food and excellent service. Ask for Joe! The bread pudding was the best I have e","useful":0,"cool":0},"Tvzr65u36yRHIevsEl2dnQ":{"text":"I would really give this place a 2.5 star rating. Nothing terribly wrong but nothing terri","useful":0,"cool":0},"uwyEMv_dwHNiyk38Rz5Ffg":{"text":"I eat here every year while attending a conference. The service is good, the price is reas","useful":0,"cool":0},"wrmezUW8uuSEJTz2bFCXbw":{"text":"only reason i ate at this horid tourist trap: Got stranded at the hotel across the st. Was","useful":0,"cool":0},"Bd_ioZYsU7lXIxUzSsigrA":{"text":"Went here based on a recommendation.  We had the blackened alligator  and the crawfish eto","useful":0,"cool":0},"IraVO54veTJcHsyFHk56EQ":{"text":"Came here after a long day of walking around town for the live music and a drink. We order","useful":0,"cool":0},"yjbUubLBKF4oAvY-dysdbw":{"text":"Try the Blackened Gator! I went to Mulate's three times in one week just for the gator. It","useful":0,"cool":0},"XmSIbioGJaaFgUCos3KZyg":{"text":"Meat pies were great.  Every thing else was too salty (the gumbo) or too fishy.  Great pla","useful":0,"cool":0},"B_roB0PYJhKVxLmxyeMyeQ":{"text":"Terrible. Do not bring a group here. We sat in their bar / waiting area with a huge party ","useful":0,"cool":0},"uq2DALXroPNIFATkvmV-yg":{"text":"So the food was so good. I love to eat at new places and this place had some bad reviews b","useful":0,"cool":0},"CcNa1ls72LJNfR2AHNRVYA":{"text":"I have eaten at Mulates the three times that I have visited New Orleans over a span of 14 ","useful":0,"cool":0},"YBOYr_lSnstn1Jn7HrXKwg":{"text":"We came here straight from the River Walk. Excited to try a new place. When we walked in a","useful":0,"cool":0},"_HqGiLTKfJTmixr4Lrwy4g":{"text":"Food was decent, but pricey and the service was awful. Over two hours for lunch with the r","useful":0,"cool":0},"mJsOlBNwOCxTBkbMuAeVBw":{"text":"I have been coming to NOLA for years and know what Cajun food should taste like.  Went to ","useful":0,"cool":0},"60-szoiHUudh2ppeFiv7RA":{"text":"Mulate's is a huge restaurant, located close to the Convention Center.  \nFor our first nig","useful":1,"cool":1},"OFU-jTCf40rIS6bK6MrXAQ":{"text":"The previous night at Emeril's we had excellent food and service. Then we went Mulate's. T","useful":0,"cool":0},"QajNfs7UlwZ7GSbl_vamkw":{"text":"Have been here twice since December. It was loaded with people and service was slow, but a","useful":0,"cool":0},"V7ScYVHzHdbX3ivinzVJeQ":{"text":"The food is just awful. The fried seafood has only one flavor, which is quite salty. I don","useful":0,"cool":0},"1XGeujO21DUBWniEeMQV2w":{"text":"The bar staff was terrible, but our server was great and the food was fabulous. They need ","useful":0,"cool":0},"y9TBYjW1dETYVVx41wKK-w":{"text":"Came to the restaurant on a Friday night during Essence Fest looking for great New Orleans","useful":2,"cool":0},"dY2ULkHc5fN-GTUoLCiV_Q":{"text":"Probably the fastest and most efficient service we've gotten in the whole city. Plenty of ","useful":0,"cool":0},"eRBKcsoevcWdTyd0Yg3_gw":{"text":"There's better Cajun/creole food elsewhere. This place is a basically the NOLA bubba gump ","useful":0,"cool":0},"ubBnwu8mot5akDjRqXgVYw":{"text":"First of all, THIS PLACE IS HUGE! \n\nPacked with wall decorations of old French and African","useful":6,"cool":2},"QwAHytTU_FfGIUmNBF20Yw":{"text":"Friendly and helpful staff.  Red beans and rice are ok!\nWill get back about the highly rat","useful":1,"cool":0},"Yq26xYZT-14MXEHe6LAbOQ":{"text":"This place was recommended by our hotel staff. I was not completely impressed. The food wa","useful":0,"cool":0},"HTjbKbZX1AJvuB2TxX3xiw":{"text":"This establishment  Do Not season their food. The chicken wings were bland. The stuffed sh","useful":1,"cool":0},"gUh_75D-GCbbaJ6wSK_HCA":{"text":"This place is terrible!! Cold, disgusting food and overpriced!  And a staff that don't giv","useful":0,"cool":0},"GuEAb6QpglQ-imPsYh8SSg":{"text":"Yum yum yum. Great fun and excellent service. We arrived around 7pm, greeted properly and ","useful":0,"cool":0},"Trk9dcmcIR6FYG1M6Lw9mQ":{"text":"We came for supper as our first time here. It was 6pm on a tuesday and got seated right aw","useful":1,"cool":0},"gBsfNNOX9F2GHDDx7xAClw":{"text":"I had such a good time here. Mulats is like no other dining experience I've ever had, i re","useful":1,"cool":0},"Wxm9YACIJ4lsD3zq3Mv-lw":{"text":"Amazing catfish bites. Melt in your mouth catfish and delicious fries. Taste of New Orlean","useful":0,"cool":0},"T-2Y-pXEh-QaiarbeesRpQ":{"text":"This is a pretty good joint in general, however, I didn't feel that it lived up to the hyp","useful":0,"cool":0},"jx9MmYakSEBgdexzqHZtDw":{"text":"The food was great! Service was okay, our waiter wasn't that good but the food was amazing","useful":0,"cool":0},"MyEA68WUUL00U4udBUJimQ":{"text":"MICE!! Horrible service from the minute we sat down. We were seated and waited over 15 min","useful":1,"cool":1},"_Q4r9CqScQoMWQ_QWf20cQ":{"text":"Great atmosphere, live music and mediocre food but on the better end of mediocre. The staf","useful":0,"cool":0},"Oxuc4XIvLrjAYq_pPZwtEw":{"text":"I was not impressed with the taste of the food. I ordered red beans and rice, fried chicke","useful":0,"cool":0},"jKPxwI_xk5L_C9Ow_J9plA":{"text":"Please save your time and money!  This is the first time I've given a review on a restaura","useful":0,"cool":0},"T08eL62deaY5aQUQOtRBRQ":{"text":"Food was OK.  Service was good.  If you are stuck at the convention center and need a bite","useful":0,"cool":0},"OYSXmXxgL870d5RW6T9L6Q":{"text":"We came here on our short trip to New Orleans ..wanted to try some Cajun food and we order","useful":1,"cool":0},"TnyA3rRrNSgtGcjmzmLLsA":{"text":"Great place to eat in Naw'lins. I loaded up on oysters and loved them.","useful":0,"cool":0},"Q0X7sqnU1N8qLM6G41MwZw":{"text":"I had a number of different items on the menu but the Zydaco Salad was the best ever. Alli","useful":0,"cool":0},"PzlkJxVAV8Qqrz4ELtsrsw":{"text":"The one star is for the service as our waitress was amazing!  The food however, I get bett","useful":0,"cool":0},"ImojQH9pxQwRTBLz-s5FBQ":{"text":"I had walked past this dinner several times.  On the last day of my visit I decided to sto","useful":0,"cool":0},"IgyZR6J7ioQj9f5SyxAsuA":{"text":"Just awesome. In town for a conference and was looking forward to trying authentic Cajun f","useful":0,"cool":0},"85DMFKGmwbzV_nlpvai6ww":{"text":"Here's the thing, if you want high quality Cajun food, be prepared to pay top dollar. Whil","useful":0,"cool":0},"CHeDzpDCNMwW5iikCEJfRA":{"text":"Awesome grilled shrimp.  Incredible flavors. You can taste the garlic and all the other se","useful":0,"cool":0},"HODiyL62h9PKPx-2h6wb4Q":{"text":"There was a basketball tourney across the street so the wait was LONG...like an hour and a","useful":0,"cool":0},"ZPgY0BY_dOHWovNGaXeblA":{"text":"This is another \"you gotta go here\" place in NOLA.\n\nOne of my traveling companions said we","useful":4,"cool":4},"TSDzevzJ6nPEujRYm1Hdyg":{"text":"If you are considering this restaurant, turn around and run. With so many wonderful places","useful":1,"cool":0},"tJ5gy6kKClfS5oYQyYb06g":{"text":"Honestly, not what it was 2 years ago. Table of 15, all of our food was cold, and not good","useful":0,"cool":0},"R25ipC-QvUc0y_5j1swlXg":{"text":"LOVE IT!   Vast menu with healthy portions been there on more than one occasion the food w","useful":0,"cool":1},"MkiRpsHwJcHVpvN7sFu9hQ":{"text":"Wow! I can't even describe how delish this sandwich was. If your a lover of olives and mea","useful":0,"cool":0},"K9_TU4Vars5ZjCZ_Gtn5Zg":{"text":"Convenient location close to the riverwalk, convention center and French quarter. The food","useful":1,"cool":1},"RPsmjWhbkCO1vj0X-DX3sg":{"text":"Just had lunch there and was hoping it would be better. The bbq shrimp appetizer was very ","useful":0,"cool":0},"svxoZTie7YJfAsL9xrrgCA":{"text":"$2/Wing and you only get five wings?!  This place sucks and is overpriced and the food tas","useful":1,"cool":0},"e2DMHB-q5HfuqxNeD3S79A":{"text":"Great local place with a friendly staff. Can get some authentic New Orleans cuisine and dr","useful":0,"cool":0},"4YoM0qL7gT9kShGj2k1Ygg":{"text":"HORRIBLE! Food sucks. The kid's meal was $12.99. The kid's drink wasn't included. It cost ","useful":3,"cool":0},"JgmNKfkrkLh4QBJmAzfFgA":{"text":"Run!  Away from this place as fast as you can if it's good food you are looking for. We at","useful":0,"cool":0},"IXqQwnCD4o6lqxIdk1AV1Q":{"text":"Had the most excellent experience last night.  Great casual and fun spot!  Loved the gumbo","useful":0,"cool":0},"ftw51YMoGUkTjJ3MR4_k7Q":{"text":"Ok, so I came here with a group of 70...that's right...I didn't mistype...70...and 40 are ","useful":0,"cool":0},"6vmbHlrY1cUee-om3geEsw":{"text":"Great food and location is very close to the convention center. The food is rather pricey ","useful":0,"cool":1},"k2mLEHPyie9ff5Gy85LyAQ":{"text":"I was a little surprised at how highly this place came recommended by some folks that I ta","useful":1,"cool":1},"0Gtj3Yynobod2MNwC9aeFw":{"text":"So I wanted to start my visit off right with a Po Boy and this placed hit the mark.  Half ","useful":0,"cool":0},"izEHcYx1ukGE2K0CwN91qw":{"text":"FOOD: 2/5\nSERVICE: 3.5/5\n\nMy Order: Sampler appetizer with fried alligator, tilapia, frog ","useful":2,"cool":0},"TLD5rQkeYrXn39wQHLserQ":{"text":"I visited with a group of work colleagues. We had lunch there. I had the Zydeco Gumbo and ","useful":0,"cool":0},"n6DPkSPf_vX2h7STCfpl7w":{"text":"Deep Fried EVERYTHING is what we ordered!\n\nNo joke. \n\nDeep fried alligator? Check! \n\nDeep ","useful":13,"cool":14},"YuJo1zB-sUrtAWix4ejlCw":{"text":"Live music was great. The food was severely over priced. The gumbo lacked flavor. Could ge","useful":0,"cool":0},"oXZtqCoC07k5WB4zxN3GNg":{"text":"Service is horrible bartender had an attitude that was unbearable if i wasn't with my cowo","useful":0,"cool":0},"--EFAfoFSuGm7dd7xf8Tvw":{"text":"Mulate's did not disappoint. I built lunch from cups of gumbo and crawfish etoufee and a b","useful":0,"cool":0},"ANVYGsGypoZpXDmrNzrL1w":{"text":"I lived in NOLA five years and never ate here. Came for a holiday, and \nwent twice in a we","useful":0,"cool":0},"3eJ1A8IKt9Z2FXJgk7q3gA":{"text":"I ordered the Crab Quartet...it only came with three kinds of crab.  My wife's étouffée wa","useful":0,"cool":0},"vwVhvc9hhlNFSf1hL4LrZg":{"text":"The food at Mulate's is always good.  Servers are fast and friendly.  Surprisingly good wi","useful":0,"cool":0},"RLeXqvhMbsGXSbYnMkutYw":{"text":"When we found Mulate's they only had a 3.5 star rating. I'm glad we ignored that. Great pl","useful":0,"cool":0},"k3Fn3Mawg76XG3xALrz8DQ":{"text":"The hotel we are staying at recommended we go to Mulate's! It was delicious. For a family ","useful":0,"cool":0},"1Z6BgxUD1PMsXeMDWMaIZQ":{"text":"A return visit. Sadly, our meals were not as good as what we remembered from our last visi","useful":0,"cool":0},"whQ1kGFvUOpdxV2PC8XlMA":{"text":"As result of texts from several of my friends whom have lived here, my wife and I went to ","useful":0,"cool":0},"txlQc-4QJ7CvMSTCTXsVVQ":{"text":"We were just looking for a place to eat after our cruise so we stopped by this place. Look","useful":0,"cool":0},"vSdvjfC5-WC8fGbekdBC5Q":{"text":"Our visit here was disappointing. The service was good, however the food was worthy of a o","useful":1,"cool":0},"NZclw5n-nkrZFJ7cTuIw0w":{"text":"Stopped here for lunch and had the jambalaya. It was ok but expected more from a New Orlea","useful":0,"cool":0},"M1GH_4UYRfA7pOtx5Uk3-Q":{"text":"Great local place conveniently located near the convention center. I've been here twice fo","useful":0,"cool":0},"oXL8gcCxJHrPr0-t6lyWxg":{"text":"Uh...\n\nNot impressed. Seafood gumbo had approx 3 1/2 shrimp. Seafood etouffee was Luke war","useful":0,"cool":0},"fjkA7q0i7EksXYdNJEdh0w":{"text":"The place was almost empty when we came in at about 1 o clock. The menu struck me as prett","useful":0,"cool":0},"w3-cxRvdRL2ckhEUmlz6eg":{"text":"How do you make fried oysters taste bad? Ask the chef at Mulates.  Never again.","useful":0,"cool":0},"ypOkjXZT7AN-El62ihppWA":{"text":"Blackened grilled shrimp excellent. Spicy but excellent and big portion.","useful":0,"cool":0},"4NBi52zRQTRQJ_YeGHSBsg":{"text":"Best bread pudding in the world. I didn't know it was such a specialty so I ate a full din","useful":0,"cool":0},"2EnQbba57PaIpym0f2zc3Q":{"text":"My first time and I must have ordered the perfect dish...shrimp etoufee. This dish is amaz","useful":0,"cool":0},"nA3kBkVZQqetsmooLnKLgA":{"text":"Possibly the worst gastronomic experience of my life. I'm not sure if the 2 hour wait for ","useful":0,"cool":0},"MLbDo_yqjGWjp3DckTwc4g":{"text":"Solid place for a bite with the family. If you are looking to try frog legs and alligator.","useful":0,"cool":0},"tpaJhzDp0UCaDlqOZ8pbjg":{"text":"Kelly was our server and she was the absolute best! She was so attentive and friendly and ","useful":0,"cool":0},"9ZBjd6k2VFPs3CQorQGJoA":{"text":"I would NOT recommend. Food is simply average. Price is way high for the amount and the qu","useful":0,"cool":0},"ZLFxPNw0DR-fj1WHwHIS0A":{"text":"We were looking for authentic, local creole fare and found it at. Mulate's.  We tried shar","useful":0,"cool":0},"UdsJ-8vab3eaAf6L7l6mVQ":{"text":"Had the salad and gumbo.  Gumbo was cold, bland and mushy.  Salad was not fresh, perhaps t","useful":0,"cool":0},"bTBV-unOvPNOsNP6VKkVrA":{"text":"I have no idea why this place has three stars only.\nThe food was amazing we had the fish b","useful":4,"cool":3},"ADVzsoDCGklK0tC6bnRAsg":{"text":"I was hoping to be blown away, as we were sent here on a local recommendation.  My husband","useful":0,"cool":0},"VsWoQ059Td2mg7Iu2t7z5Q":{"text":"We had great service, great music and great food!! I ordered the grilled alligator and sub","useful":0,"cool":0},"DjfsbeEFUrAsZGYKVuOuAA":{"text":"Where do I start? Service-Horrible. Food- mediocre Drinks- Horrible\n\nRegardless of seeing ","useful":0,"cool":0},"vhDtnQ0ZIAVw-JiQiWMuTQ":{"text":"I travel from Phoenix to NOLA often. At this time of year the only nonstop flight on South","useful":0,"cool":0},"Hl3G3TY0m2UM9fUVOfFhNQ":{"text":"As far as Cajun food goes, this place has it! Don't be fooled by reviews that question the","useful":0,"cool":0},"F3m6td3a91UHsbUQVFNtJQ":{"text":"This was our first ever meal in New Orleans and it was a great choice.  Recommended by our","useful":0,"cool":0},"IDPPTOT4JTxk0YLGiNzMtg":{"text":"Food was good!! Service was not the best We sat at the bar. Bartenders had NO personality:","useful":0,"cool":0},"aXmc1cImlmFYF3fc3owZXg":{"text":"This was our first food stop in New Orleans and we were not disappointed.  We came in for ","useful":0,"cool":0},"c3C_PnmThsxHQ0MmQ06ysA":{"text":"I'm pretty sure I got food poisoning from this place. I had a shrimp Po Boy and I thought ","useful":0,"cool":0},"KpxcrTdKUdlsro6faCA7Gg":{"text":"Haven't been here in 25 years! Mulate's isn't a fancy, white table cloth restaurant, but i","useful":1,"cool":0},"jd9TYHdYnBPScP4L0o6hwg":{"text":"Great food, good service, great ambiance. They had great music and people dancing - but no","useful":2,"cool":1},"-8-YfxjOEj4z0YmQk3BW5Q":{"text":"Okay Okay, it's been a good 4-5 years since I've been to Mulates but must write a review a","useful":3,"cool":0},"lAjuOssCOztXhluOHq_d1A":{"text":"The restaurant is huge so I don't think there should ever be a problem with getting a tabl","useful":3,"cool":0},"3NP_jg3sszhT280IPx_zJg":{"text":"I had wonderful memories of this restaurant and looked forward to enjoying it again. Shoul","useful":0,"cool":0},"l5GKa9HyBmGiXlrqSLac4Q":{"text":"Food was decent, but not worth the price. I really like the interior of the restaurant and","useful":0,"cool":0},"QPaO3g_XExBFTL3OCwzjAA":{"text":"Called today to make a reservation. Lady answered and told me to hold on. Was on hold for ","useful":0,"cool":0},"C02rrbjJzWZGd2HOSVETQg":{"text":"Great food, awesome service, and our waitress was excellent. Little pricy, but you get wha","useful":0,"cool":0},"eedpnYPzoShdEXuzxHq6Yw":{"text":"All of our food was amazing! Lots of flavor! Service was great. Music was great. It was a ","useful":2,"cool":1},"idDOH8I6TkMtF6t79gSsbw":{"text":"The food is ok, nothing to go crazy about in a town with fantastic food options. \n\nProblem","useful":1,"cool":0},"J8IjXNE2q6RXdmIPCmBVuw":{"text":"Servers could use some education on proper discussions held in front of customers. Don't b","useful":0,"cool":0},"2B9ja_1X3ljKDSzcQ-HZcA":{"text":"The food was delicious but it was a little pricey for the amount of food and the wait time","useful":0,"cool":0},"iTKD7NihvRbTQlfGIcZung":{"text":"The food was delicious! The triple shrimp combo is a must have. I also enjoyed the drink t","useful":0,"cool":0},"IpN6GiytGcCgNN2ZbACa4Q":{"text":"My husband and I went to this restaurant because I wanted to listen to zydeco music during","useful":0,"cool":0},"9oVv4eRx_Rz-aIblY8p9_Q":{"text":"The food here was fantastic! We will be back because there is so much on the menu my husba","useful":0,"cool":0},"mkr_bU4zBDBeBZo8pLfeQg":{"text":"Blacken Redfish outstanding. Seafood Gumbo deep and rich. Such depth of flavor. \n\nNot only","useful":0,"cool":0},"ELgW1Sf_Ab46kEBMj5SA9w":{"text":"The food was awesome and plentiful. We had a lunch break from a convention and they got th","useful":2,"cool":0},"UETVEQioIN2Kr-G5XzAMqg":{"text":"Excellent Cajun food - not exactly a fancy place, but the food was really great. I had bla","useful":0,"cool":0},"y709b_yc6FNRIuXWcgBgaQ":{"text":"Trying \"the world's most famous Cajun restaurant\". Everything was bland.  So they must be ","useful":1,"cool":0},"m7dJ2_90uyo1VJcmWE7hRA":{"text":"On a suggestion from our hotel valet we went to dinner here.  I ordered gumbo and I though","useful":0,"cool":0},"pPkWkENUBdACRtvclVFvmw":{"text":"Great food.  A lot of fried options, but I guess most California girls think that.  Really","useful":0,"cool":0},"t40bhQvTbtobpbnsKbRr8Q":{"text":"Cool vibe but you have no idea how long the wait is. They tell you 10 minutes to an hour. ","useful":0,"cool":0},"LR7duAlsvouTcDYlXZeuLg":{"text":"Place is great. Simple, but well maintained. We came late lunch, by 1pm. It was fairly emp","useful":0,"cool":0},"s7EO7AC_EBTLM_lyz1ONfg":{"text":"This place is always a good staple of NOLA.  The food is great, and too many options!   Th","useful":0,"cool":0},"2fcGXIUkfvwDYxoRLr_9KA":{"text":"I'm pretty sure I got food poisoning from this place. I had a shrimp Po Boy and I thought ","useful":0,"cool":0},"U3aIydZI1_YbdLYYe3t7qg":{"text":"If you seriously like food, and I mean who doesn't ;), DO NOT GO! It's a serious tourist t","useful":1,"cool":0},"5Q3ubs_bI8dRenCjLk6i_g":{"text":"Look, service was great music was great food was great! Price is an opinion that you will ","useful":0,"cool":0},"NQ03uhDbfqc1DO6W42uo7w":{"text":"Our waitress (Deja?) was delightful. The food was pretty good but the value for dollar was","useful":0,"cool":0},"EQ_B_U4_NRY6xUweDj555Q":{"text":"I was told to eat here by a friend, so I was here for lunch at Mulate's here in downtown N","useful":9,"cool":8},"X2tZSYVUX7F5R2-R7Ds47Q":{"text":"Had the crab au gratin and loved every bite.  Service is great here and they were kind eno","useful":0,"cool":0},"0iZozpsD5baqFlM0B-8V8Q":{"text":"Had the catfish bites appetizer and could have had ten more! Delish! Had seafood pasta and","useful":0,"cool":0},"NUnudBdxti7wkT1dYIcWOw":{"text":"Huge on the inside and we were seated right away. We got the fried catfish platter and spl","useful":0,"cool":0},"Cg2OLvR4jlxeHPnoH2jMZg":{"text":"Should not have went off a few reviews. Our family of 4 did not enjoy our food. Wasn't tas","useful":0,"cool":0},"pGnR3CYGV9h_tO-uWS4XKg":{"text":"Delicious cajun!  Great gumbo and cajun oysters!!  Also great chicken jambalaya!  Great at","useful":0,"cool":0},"hmvh8cbbf-4z5boJ9u3how":{"text":"Not bad. Shared the Cajun sampler which was more than enough for two as a meal (plus drink","useful":1,"cool":0},"93hr5VIalNcjJbQwRGqNJQ":{"text":"This place was extremely overpriced and disappointing. $4 for a Diet Coke we paid $80 for ","useful":15,"cool":7},"DKkh_6ML_1YeFE8-lCEY_Q":{"text":"My family and I ate here this evening.I got the stuffed crab with slaw and fries.Mine was ","useful":0,"cool":0},"74llqm7uVYOr-FQwQe2h-g":{"text":"In town for a convention. The service was a little slow one night but they were extremely ","useful":0,"cool":0},"BZ34Wnyh54lJtXhHM-dDjw":{"text":"Amazing food but HORRIBLE SERVICE . The food was great but it took over an hour for our fo","useful":0,"cool":0},"Yeco3lBHlB5whipeZlnTLQ":{"text":"As many have said - really a tourist trap. Food is lazy & cold. Wait staff - friendly and ","useful":0,"cool":0},"dtb4h3lWh57uSGShkYS7QA":{"text":"It's a nice environment and the band plays good songs but the price is too expensive for w","useful":0,"cool":0},"NXupEFh66Xmf4VYcslQA0Q":{"text":"Went there for dinner and it was not a good experience.  The etouffee was flavorless and m","useful":1,"cool":1},"TjwJwo57I3zv4o8x9KEEiA":{"text":"Definitely 5 stars. Not sure why it's so low on Yelp but gumbo was terrific as well as the","useful":0,"cool":0},"MCHVSsETIVjBBaZMnQfhjw":{"text":"Best bread pudding we found in New Orleans. Always stop when in town.","useful":0,"cool":0},"73BoQImJp7FaceQR_S8QVA":{"text":"This place is a RIP OFF. First timers will visit once, never to return. Some hotels recomm","useful":0,"cool":0},"2dGycfPJKb-Zm6tnDjs67Q":{"text":"Since this was my first time in New Orleans, I wanted to try some authentic cuisine. \n\nMul","useful":3,"cool":3},"SQHAU5py3xiC7pb_SwzCzQ":{"text":"This place is a crappy overpriced tourist trap. The restaurant was empty and the hostess w","useful":0,"cool":0},"Ba5RUROGDr8MFjFrZilVAA":{"text":"We ended our night here with bread pudding. It was excellent and we got out on the dance f","useful":0,"cool":0},"P4co9A8Q-TBfCghe4DtNSQ":{"text":"Our party of two was seated right away and promptly forgotten. After waiting for 15 minute","useful":1,"cool":0},"21Rhp-bD_l9Z3C5vW1Sh4g":{"text":"Wow! The music is good, food is great. First time to eat here in New Orleans and will be b","useful":0,"cool":0},"NT-8HxoW3dh5SMv7-l7lqg":{"text":"I loved this place! I wanted to try alligator and it was delicious! Our waitress was perfe","useful":0,"cool":0},"eanYCLP4fPHqVtCbIn0crA":{"text":"The food was okay, I expected more of the food and service. My family and I came here for ","useful":0,"cool":0},"UeLTeEQVA41pM4QNoOMuKg":{"text":"Overpriced, salty, and underwhelming! Stayed at the Hilton and was informed this was a gre","useful":0,"cool":0},"a1SKnScfNWz6TWV8cGtY4Q":{"text":"The food was great!!! The atmosphere was awesome and our server Jaimee was sooooi good to ","useful":0,"cool":0},"U46mTR8JSD_eCg64aNTC1g":{"text":"I was searching for jambalaya within walking distance of the Hilton Riverside where I was ","useful":0,"cool":0},"dncV1J7RE5w-LNyQ6ImSug":{"text":"This place should just close. Don't you wish that this place would close? I can think of a","useful":7,"cool":5},"3CMK1Lu2Z0atkUUadpVWMQ":{"text":"While I would give my food (the sampler) a 3 star, the service was so awful I have to drop","useful":1,"cool":0},"2pb7snLaiegGRh10bQw8PA":{"text":"The food was excellent and would rate 4 stars, but the service was poor and brings the who","useful":0,"cool":0},"DsI0J3ykMAN7fEVdQG8g3A":{"text":"Awful service. Staff standing around while we waited at the bar. When the bartender arrive","useful":0,"cool":0},"ipcD-qM-QungHpKo4Qs0HQ":{"text":"Mulate's is a New Orleans institution with down home Cajun cooking.  The dining room is hu","useful":3,"cool":2},"S8Q-RuUy6-UVfMm1LPXK3Q":{"text":"AWFUL, AWFUL, AWFUL! Think BIG Shriner's Hall with high ceilings and bright cold lights, l","useful":2,"cool":0},"rdojyK7tG-bVuMhsfLuZjw":{"text":"Good food and great drinks! Their cream cakes are very crabby/fishy tasting, but I really ","useful":1,"cool":1},"bO7cT6bEAag1CKl81wfDTg":{"text":"Been to this place twice with a gap of 2,5 years. Doesn't fail. Delicious Frog legs and ga","useful":1,"cool":1},"hp4y6jorpacnynKK0wMjhA":{"text":"The Jambalaya bowl was okay. The red beans and rice was okay. I enjoyed the stuffed mushro","useful":0,"cool":0},"LpYnFe6bHVMzUQFEUOjIiw":{"text":"I came to New Orleans for Cajun food and seafood, worst dinner ever!  Poor quality of seaf","useful":0,"cool":0},"ty-dunZ9z6vFTVhBlw5IaA":{"text":"We go here every time we are in NOLA, no matter how short a trip it is. \nFresh french brea","useful":0,"cool":2},"Y9CGU7Q3_i6zldZENQfUow":{"text":"Way over priced.  I had the shrimp triple platter:  4 medium to small fried shrimp, 4 medi","useful":0,"cool":0},"OHVg3IPcCDo0bEojrnWenA":{"text":"Pretty yummy Cajun food! I had a shrimp Po'boy which was yummy, but it was enormous. And t","useful":0,"cool":0},"BNzyGXvYugTqEfyPf5bZQQ":{"text":"There are better places you can go. I made a yelp account and got the app simply to write ","useful":0,"cool":0},"FbZ-keHhhMX56UYkh1Q06Q":{"text":"Tried to eat Zydeco Gumbo, but it was so salty I had to stop. Didn't mention it to waiter ","useful":0,"cool":0},"XqmKEadkVxkhdOlxmM72mA":{"text":"5 out of 5 stars easy. This place is always on point, food and service are great. One of o","useful":0,"cool":0},"3Ij4GdVhUPgOJyjd3Jh1Ww":{"text":"Great food very fast service! I will definitely come back!","useful":0,"cool":0},"gDYBkCtCzo7uPP7My7KqcQ":{"text":"Food was decent. Atmosphere was great! Had authentic Zydeco music and it was wonderful!!","useful":0,"cool":0},"KX5WalYsUtSQaqa00wI6JA":{"text":"We were staying at Harrah's which is close by and wanted to get out an get some local fare","useful":0,"cool":0},"Sp4QKp9xVAZq-4WYeQtm7Q":{"text":"Really good food, came out quickly.  Shitty service and kept having to get their attention","useful":1,"cool":1},"UUUEJPPWbCs10FDsgqYKaw":{"text":"Good ambiance, music (not too loud), decent food,  good drinks & a great server Mary M.\n\nO","useful":0,"cool":0},"G0z0u-xExT1ltfTChZU9eA":{"text":"Food came out cold. I had Etouffee and gumbo.  Etouffee was salty. Rice was completely coo","useful":0,"cool":0},"RMKpxQeNSA9GtWoQ_vJcoA":{"text":"As a tourist I had high hopes for Cajun restaurants out here; the service was okay, but le","useful":0,"cool":0},"YOuqxam2qDNUU9xkcE5Mxw":{"text":"This place was horrible. How do you mess up BBQ shrimp? The bbq shrimp was rubbery and dry","useful":0,"cool":0},"A-ggfxZH8D5cyZBJHmjeyQ":{"text":"This was our first food stop in New Orleans, and I will rave about this place to anyone wh","useful":0,"cool":0},"vdpHzdMtub_1r733sS2hew":{"text":"The flavors and the good service never change. I come here every time I visit New Orleans.","useful":0,"cool":0},"ze1pBnhf2m0yziexjnykpA":{"text":"We had a fantastic server for our lunch meal and liked the atmosphere (wish we could have ","useful":0,"cool":0},"Tv7KIGoxA0CDurhSpNPAoA":{"text":"Couldn't believe it when I read the other reviews. A party of 4 and everyone loved their f","useful":0,"cool":0},"dTwVGWc1ebzJYdEVvLSN3g":{"text":"This review is not about to food but instead the extreme let down of service and disregard","useful":0,"cool":0},"LEdzMLAIc_dPHLGQprlCzA":{"text":"Great service best ribs I've had in a long time! Soooo Good we got the half rack pull a pa","useful":0,"cool":0},"cudKAVPwqzBNMNXODMhV8w":{"text":"Service was terrible.  Located in the convention center but could not accomodate a crowd..","useful":0,"cool":1},"pao9KFPjRa7-8ifVUgZkAw":{"text":"I get the feeling that this is definitely a touristy spot, but it was still really delicio","useful":2,"cool":1},"tMV3sBeLY2q9ThWwpS1hvw":{"text":"The barbeque shrimp were quite spicy, small, and overcooked (tough and chewy). Not the bes","useful":1,"cool":0},"AsqpUcKqgn27Lm-SFUTdOw":{"text":"We had a fabulous lunch today!  Joe was our server and he is THE BEST!!!   Thank you, Joe ","useful":0,"cool":0},"U7ViSTLP-Jcpg0HsXp7D6Q":{"text":"Probably 2.5.  I could take it or leave it.  Food wasn't amazing... but wasn't bad... Very","useful":1,"cool":0},"dTc_f2YtwFzby5Est66Elg":{"text":"Jambalaya was pretty good. It had great flavor, though we didn't have it at any other rest","useful":0,"cool":0},"gpHvfm2ekLjvT0S9JfQ4TQ":{"text":"Came here for a late lunch with our 8 and 13 yo kids. The smoked oyster appetizer was deli","useful":0,"cool":0},"wx4x3yucBknxsA8gL3cxbw":{"text":"The hostesses at this restaurant are the rudest I have ever experienced. I was tempted to ","useful":0,"cool":0},"0mOr3SC9WTwgzWg_-KnUzA":{"text":"The service is horrible.  We had a reservation for 8 and it took about 20 minutes just to ","useful":0,"cool":0},"CPVs57rpY1MYSlLCxqJXxw":{"text":"Great lunch. They need to hire more staff. The food was a good representation of Nawlins w","useful":0,"cool":0},"NO26KSnU44Yen3KfiVIsfw":{"text":"Overall an ok experience. Hostesses did not greet us at all upon entry. Live band was nice","useful":1,"cool":0},"pbU1gUoBa1Ecp6dFaPYDFg":{"text":"Only went here for convenience, and thee story was good.  But don't waste your time and mo","useful":0,"cool":0},"P3oeK5-dJvKGgYStZG95KA":{"text":"Our party of 5 dined here for lunch Saturday afternoon.  We were greeted and immediately s","useful":2,"cool":2},"rB_2A8_i7kHw6ZvAB0mCiQ":{"text":"Wow this place provides some decent food and offers some nice Cajun music but unfortunatel","useful":10,"cool":2},"PMKhvphUFNSNKEK4MNluBg":{"text":"Down on the waterfront, next to the convention center is a really great place to eat. My w","useful":0,"cool":0},"9oPQmC4zEXpoQK6l6mZOUg":{"text":"This place deserves every bad review they've received.  Absurdly overpriced for sub-par fo","useful":1,"cool":0},"wtsc7Gu-vesisyl_ZOwUPQ":{"text":"Long overdue review  of Mulate's, dating back to November 2018. My second night in NOLA ac","useful":1,"cool":0},"EstrGeO-Mb78sJjD4uURsg":{"text":"Let me first start of saying that Mulate's has the potential to be, and may have been, a w","useful":2,"cool":2},"OB0_xriD5Y36A-5_GAnCWw":{"text":"We've been to Mulate's a few times now, and the food is always consistently good. I also l","useful":1,"cool":2},"qxIphI6CqSg57G1A5bIRjg":{"text":"The jambalaya, charbroiled oyster, boudin sausage was very good.  The service was on point","useful":1,"cool":0},"fAfUy5LvQmRes3C2zN7OPg":{"text":"Once again, I'm so very disappointed in Mulate's Seafood Gumbo.  The last several times I'","useful":1,"cool":0},"57_lksZcRycRbOO1tiwrqw":{"text":"On previous visits to NOLA, have eaten here multiple times and loved it. This most recent ","useful":0,"cool":0},"MGK9_5ndArsll3jmLRnEGw":{"text":"Plenty of people travel to New Orleans, Louisiana every year. It is a pinnacle attribution","useful":0,"cool":0},"EPZujyi2IGGRJfMtkc620w":{"text":"Only 3 stars? This place is way better than Grand Isle, a block north, which currently has","useful":1,"cool":1},"uazvPEBJWKznt2DcPEIpEw":{"text":"This place had good food and a lot of it!! U will definitely need a nap afterward! Had the","useful":0,"cool":1},"VAQcLAhNscZrymKEcrm1YA":{"text":"After visiting the Aquarium and the WWII Museum we were looking for a restaurant in that a","useful":1,"cool":0},"sX0GaEpjDbM-wXbEaoI9Kw":{"text":"Casual, family friendly place with live Louisiana music. The food was absolutely delicious","useful":0,"cool":0},"moDLXhh_YTLSeQhYLg5KHA":{"text":"I'll start by saying the waitress gave excellent service to the party of 10.  Thanks Donna","useful":0,"cool":0},"gxtn8cUyeCPIy5MFONcp5g":{"text":"I was very happy with my visit.  I am very surprised Mulates only has 3 stars on Yelp.  Th","useful":3,"cool":4},"GLj0NicZveX7C_8ghNnN1w":{"text":"Julie has got to be one of the most focused and attentive servers I have ever had the expe","useful":0,"cool":0},"-PHCvGiYnD-qi7u3Y9M4GQ":{"text":"Two years in a row I have been here for our Tulane law school dinner and it's always delic","useful":1,"cool":2},"pijElRExC5VzEWHO_kvYRA":{"text":"Wasn't very impressed. Shared the stuffed mushrooms with a group...10 bucks for 4 mushroom","useful":1,"cool":0},"k0GcIbYrytBdxrAPDjldpw":{"text":"Three stars on the food, two stars on the service. The menu offered some good staples Caju","useful":0,"cool":0},"ebvOrVCxerd609JISFg-Nw":{"text":"I didn't let the not-as-good review, dissuade me from trying out \"the original Cajun resta","useful":2,"cool":0},"kj5Dt3yMR-Bz66ATHrrt7g":{"text":"You can choose to read the rest of this review if you like, but if I were you I would stop","useful":6,"cool":3},"YxIS-mvpfvQuTs3p-ziOhQ":{"text":"Casual, family friendly place with live Louisiana music. The food was absolutely delicious","useful":1,"cool":0},"1Z3SlHZY9aEwfaKZcnjblA":{"text":"I was really disappointed :/ both mine and my mother's food were poor culinary experiences","useful":0,"cool":0},"sqzmyX5iCoh2F7icdcMnhQ":{"text":"If you have a group of 8 or more, this is a fun partying, dancing, drinking place.  But it","useful":2,"cool":1},"uqqjVqexaw7GUJFU6TyKoQ":{"text":"We had a large military trip planned for Labor Day weekend. A week prior I made a reservat","useful":1,"cool":2},"eYIA-6cI4vDMpbqDWB5BNA":{"text":"Friends recommended this place for a good meal and music.  We finally went our last night ","useful":0,"cool":0},"D8TV7xdkQ1kyk1u-lNh9jQ":{"text":"Plastic, red checkered table cloths.  An extensive menu featuring lots of Cajun foods.  De","useful":1,"cool":0},"Q-MLSwfMvng7RJ_xlGv3nQ":{"text":"I honesty don't remember much about the visit (damn those green grenades) but I was told t","useful":2,"cool":1},"ewevS8fdzLtE9D7Ft8NX_Q":{"text":"The food is mediocre at best. The only reason this place is even still open is because if ","useful":1,"cool":0},"5SQuQdfw2kOj2ZcUvXS67g":{"text":"This place is huge! We were there for early lunch today with 3 kids (6, 3, 1 2/2) . Not re","useful":1,"cool":0},"ED2aBbeMiDkUn7cMhXnNBw":{"text":"Ate at Mulate's after spending an eventful day at the beautiful Ernest N. Morial Conventio","useful":2,"cool":2},"9LSLAWFqEjgzFzXowp2lvA":{"text":"Spending any amount of time on this review would be as rewarding as my first-and-last visi","useful":0,"cool":0},"8bupZMmfvmx3synzOYGGoA":{"text":"Visited this place January 27, 2019 and was not a one disappointment! The food was good an","useful":2,"cool":1},"-XSNftMlO-jMB1BXIFxn2Q":{"text":"This place might not be your vibe, but the food is solid.\n\nI came here on a random night a","useful":2,"cool":2},"aeg1QwSXlBQadbnmvK1CfA":{"text":"Historic building, delicious cocktails, authentic Cajun food and live music. What's not to","useful":0,"cool":1},"yjz1mQbCyodL7X6nuuZcCw":{"text":"Our last visit was 2020, when we are here in New Orleans this restaurant \nis great, live m","useful":1,"cool":0},"YHZ5rumn0abXElw7uMzEzA":{"text":"Best oysters ever- enjoyed the live music as well.","useful":0,"cool":0},"glcA0GzZmI8-LCsAtwdhkQ":{"text":"I came here for dinner when I was in the area for work.  I would definitely suggest stoppi","useful":2,"cool":1},"9CeoECrDFZhWd_4Nia65nw":{"text":"If in New Orleans, you can do much better for restaurants.  Their primary advantage is pro","useful":1,"cool":1},"KeVN1xfkEGP5ZZqiWQ6sJg":{"text":"Went in very hungry and ready to throw down ... but the way my stomach is set up now it's ","useful":3,"cool":3},"fqOyLBOb0_DUX2Ima64XTw":{"text":"My husband and I stopped by Mulate's to try their Smoked Cajun Oysters. ($13.99) This dish","useful":52,"cool":55},"sDyDKNyQjBsf9dQWiuMOOA":{"text":"I have come here 3 times over 3 decades (first time in 1996) and I love it each time. If y","useful":0,"cool":0},"LvGCzfCEDDYpfgVjK8jXEQ":{"text":"Don't bother. Service was slow and food was mediocre. There are so many options in New Orl","useful":1,"cool":1},"6vraIN73LuHy62Vr2TZ08w":{"text":"This was one of the first places we ate at after arriving in New Orleans. We ordered the B","useful":0,"cool":1},"RaK-JnzLZGWc5UVdhObx7g":{"text":"I love  visiting Mulate's every time I visit New Orleans. I always order the Zydeco Tornad","useful":0,"cool":0},"EeB1OjCZGGUux2UsMRy6VA":{"text":"If you like very expensive bad food this is the place for you! Seated us right next to the","useful":2,"cool":0},"cRE4DpG6GmUN4-ARhXoPyA":{"text":"Highly recommended, but I my case not worth it. We did not have to wait even with a large ","useful":1,"cool":0},"UvSW7CNdfla7f9lxocjzNg":{"text":"Very touristy and many of our dishes were unenjoyable. Food came cold, chicken sandwich an","useful":0,"cool":0},"KORgAj50mFyPAPBAfvl1iA":{"text":"The food was amazing! Everything tasted great. The service was not up to par. We arrived a","useful":0,"cool":0},"IAnO2mwmMqGfWIybvXEfNA":{"text":"Don't waste your money when there's real Cajun restaurants a couple blocks away. This is t","useful":0,"cool":0},"65FsFBZkEoB7AYokiCe95g":{"text":"Party of 3. Excellent service from start to finish. We were greeted right away when we ent","useful":2,"cool":0},"K9XYHNfE8OL5s91kuAtwuw":{"text":"**This review is based on pricing**\n\nSo I'm a New Orleans Native.....born and raised in th","useful":1,"cool":0},"bK8TAkJqdl6Rl-KA0edphw":{"text":"Food was good. Large quantity and variety on fried seafood platter. Enough to share with k","useful":0,"cool":0},"wkezdAWvHg4MPpZ9zTMsWQ":{"text":"Nice spot to eat, drink and hear the band play.  The patties and shrimp fires were delicio","useful":0,"cool":0},"wNtnINSEbl2YziFng9V8GA":{"text":"Good location to meet, eat and chat. Food had mixed reviews from our group. Gumbo was exce","useful":0,"cool":0},"a_AIHzhBISWu4y-qX6S-fQ":{"text":"Let me preface this review with the fact that I appreciate fine dining experiences.  Mulat","useful":2,"cool":0},"MpLr0SXkY7avUFzClXunrg":{"text":"The food is amazing but the ambience at this location is a bit sterile. It's not the livel","useful":0,"cool":0},"ddpFlqoRtvWa_9AnaJBGSQ":{"text":"We will never go to Mulate's again! We visit NOLA multiple times a year and this was not o","useful":0,"cool":0},"--Y7M8455pMb8yFL4WFwsw":{"text":"My family and I have visited Mulate's our past two NOLA visits. The food is a bit better t","useful":0,"cool":0},"prR4ghuLl5EXMGc1N7Yt3Q":{"text":"Awful, why is this place still open. It was the closest place to my hotel (out of towner) ","useful":2,"cool":0},"mPYEhSfFcWY6mTqeO8ep8A":{"text":"Mulate's just plainly speaks out New Orleans. I went to New Orleans for a vacation one yea","useful":0,"cool":0},"RyzVCYfTAcrrEihCDQEftA":{"text":"Had lunch at Mulates on New Years Day.  Food and service were excellent!  Highly recommend","useful":0,"cool":0},"KQCi4GnhXs-xkClO72XcuQ":{"text":"This was a random pick but was really good\nDefinitely recommend for anytime\nHonestly I don","useful":1,"cool":0},"ru2fPpoG4tkNfAbrteQqCA":{"text":"When I was at the Marriot for a conference just down the street I decided to grab a bite h","useful":5,"cool":2},"-x6qJ3CQsmDr_nblYVES5g":{"text":"Although I'm rating this place 3 stars, I did enjoy my dinner here. I think the main draw ","useful":0,"cool":0},"zfBC3y08G_AT-y7tP1RpNw":{"text":"The bad reviews here are pure BS. I had never been to NOLA before, never experienced the f","useful":1,"cool":0},"bwnjDETzD7FxePzVg_BDdg":{"text":"The live music started at 6:30PM on the Friday we stopped in and it was enjoyable. We trie","useful":0,"cool":0},"t_jEJL-2nt5DrELGBFO-BA":{"text":"I was recommended this place from a local. It was pretty decent. I was there by myself, so","useful":1,"cool":0},"57gnuHR3jjj8f8JiFTmbvg":{"text":"Lovedddddd them! Went back a second time during our vacation! Will definitely recommend th","useful":1,"cool":0},"6u43e2vHegXvPVUNgJbTHQ":{"text":"We were in the New Orleans area on a Tuesday night, walked in and the place was pretty cro","useful":0,"cool":0},"TsFzhtWL7fkWQWsr38xzDQ":{"text":"The service was good, the live music was AWESOME, but the food was only okay.  Extremely o","useful":1,"cool":1},"DDnsViDEthz1jskk5xICDQ":{"text":"Fun atmosphere with great music and dancing. Very busy, but pretty good service. A little ","useful":0,"cool":1},"qb-Zc32iXmTnSxRWWzWztg":{"text":"This place has been on my radar for years and years because not only do they serve local c","useful":7,"cool":5},"juEOHCSogtWdsMMwgsRBtw":{"text":"Pretty good spot for some grub. Shot out to bartenders Phil and Jeremy.... u truly make th","useful":1,"cool":0}}