{"dk4j3-B1e1ZIyDLEl-o81A":{"text":"Man does this place have great hot dogs. I got the Louisiana hot sausage (from Harahan) wi","useful":2,"cool":1},"5RWZ8iIYds_2Gp9yT0E1jw":{"text":"You want a Dog in NOLA.... Dat Dog is where you will find it.  Don't go in bad weather bec","useful":1,"cool":0},"vPJsM0zNd_V8dVF4gwsFBQ":{"text":"I love hot dogs!  Just wish they had a Chicago style dog b/c that was what I was craving","useful":1,"cool":0},"7vaXBPKsj8seXuWQg-cKLg":{"text":"Had the polish hot dog. Very tasty. The duck sausage was amazing. Great service. Try the c","useful":0,"cool":0},"pt3aSKWj9aUdmigRwRDN1Q":{"text":"Loved our experience here at Dat Dog. It has a very casual, college feel with reasonable p","useful":1,"cool":1},"FrhIXv6F5tkIt6hOlboqMA":{"text":"Inside and outside seating, but really the large front door is always open so the inside i","useful":0,"cool":0},"5e-UpYek1S32lVtFIcezKw":{"text":"Tried out Dat Dog this afternoon. \n\nThings I liked:\n\nThe buns. Big sourdough bun, lightly ","useful":4,"cool":2},"eRX0QKwA2u3MTt7TlvdRaw":{"text":"Excellent chili cheese fries (although I wish the cheese was melted!).  I had the bratwurs","useful":6,"cool":5},"uxMnsk1auY4jl4rl8MhVfA":{"text":"Before I moved back to NOLA, I was a 90% vegetarian. Now I'm a 50% vegetarian, so I have p","useful":2,"cool":2},"NN7KO7qMS7CJLNaEau6HVw":{"text":"Excellent atmosphere for a get together with an old college buddy. Perfect food & ambiance","useful":0,"cool":0},"DxFXSB48DBjP4UW8PajQEg":{"text":"I've been looking for a place to satisfy my hot dog cravings as I miss Chicago dogs dearly","useful":1,"cool":1},"NMaVh9ry5ivf8QBsrkcFTg":{"text":"Seriously delicious weiners.... Dat Dog is a lovely new addition to Freret Street and a we","useful":2,"cool":0},"grah2d0s3sQaWLIWjPma8g":{"text":"(To the tune of \"Poison\" by Bell Biv Devoe)\n\nY'all, I must \n(warrnnnnnn youuuuuu)\nI'm feel","useful":4,"cool":3},"it_o75vkV5fsVSYYzKnnEg":{"text":"Hands Down, if you haven't tried a Dog from here u need to get their ASAP.  The guys and g","useful":0,"cool":0},"ofPmGU0HqZIhn8UIwiGIQA":{"text":"this place has an awesome variety of local and international dogs, sausages, brats, kielba","useful":2,"cool":1},"vvkvGvS0znurX5DY9u01ig":{"text":"If you want to get your DOG on this is the place. The fries are delish too. My NOLA replac","useful":0,"cool":0},"YzWcrQqK-vpDZfPatdwfpg":{"text":"Loved the outdoor seating. Good happy hour, 2 for 1 draft beers.","useful":0,"cool":0},"Jqe4pvyIdmDAG9VxlaCrEg":{"text":"Nothing special - for the price, I would expect a hot dog that was Costco or Sam's Club si","useful":2,"cool":1},"oRkSGMGXO0jV3KicaE0aFg":{"text":"I LOVE this place! I'm so glad they expanded their space to across the street in the old G","useful":2,"cool":1},"4zGvWWiw_LQA_gXPq7ZYSQ":{"text":"Best hotdogs in NOLA, if not in the world!!!  Everyone knows that Dat Dog is known for the","useful":1,"cool":2},"xdCtRK_wt1YgRPsWxmF6BA":{"text":"My girlfriend and I both ordered veggie dogs, and we both got sick immediately afterwards.","useful":2,"cool":0},"a_-O77YlkD4fC-07VoMf5g":{"text":"They stole Rally's french fries and put Poppy Tookers name on it. \n\nI love Poppy Tooker, b","useful":3,"cool":0},"-ao6iX5eGGtKVieGT3volw":{"text":"Absolutely incredible! After living in Chicago for a number of years, I'm slightly biased ","useful":0,"cool":0},"E6u8Cu1Bl9qDIg4JtPzZqg":{"text":"The BEST sausage dog I've ever had, crawfish sausage up top and alligator sausage pictures","useful":0,"cool":0},"03R6ws9SJPILN7YIEC4iPQ":{"text":"yummy! I actually haven't eaten enough here, but everything I get is delicious. I wish the","useful":0,"cool":0},"sD1z6UJYSIM_n1y0sa1v3w":{"text":"This original location is cash only, so remember that. Freret street offers the best carni","useful":0,"cool":0},"k43AAVbF2Pw_1Ms6vSx1ww":{"text":"Colin's milkshakes bring all the customers to the yard...\n\nSeriously though, Dat Dog makes","useful":3,"cool":1},"KK3VYoPVUIHn6iD85yTVEw":{"text":"I had the german weiner dog regular size and i was very happy with it, the buns are just e","useful":2,"cool":2},"QbcJBruk0vLlEoh3SzRDmA":{"text":"Great spot for a good meal and cold beer. Lots of choices and variety on the dogs and the ","useful":0,"cool":0},"h4ykFwuU2r0LRmVcyuJJ-w":{"text":"Don't take Dat Dog for granted.\n\nGreat original sausages.\nWarm, fresh bun.\nAll of the topp","useful":0,"cool":0},"yOmkK7lTrK19oWhhX8txEA":{"text":"Yum, hot dogs. It's divey and it's hippy and it's full of delicious gourmet hot dogs. I ha","useful":4,"cool":5},"mAy-zLEnObh-3j5Chyy5Hg":{"text":"This is the best place I ever been to that served hot dogs on a bun!  They have such a var","useful":1,"cool":1},"t-keL3OR3Bd4U3v0eVXh1A":{"text":"Love love love Dat Dog. I love trying new dogs and always get it topped with chef's choice","useful":0,"cool":0},"ZbazL5n_xBkH3eGWxr_eiQ":{"text":"HOLY SHIT.  Just go.  Stop reading this right meow, get here and stuff your face.\n\nBuilt m","useful":0,"cool":0},"m47fsM7ZhcoNKyAz55DPnA":{"text":"Delicious! I love their pork dog with caramelized onions, bacon, and ketchup. Yummm... I w","useful":0,"cool":0},"B1bjkm_f0M-fX9LttLr32g":{"text":"Sorry.  This place just didn't work for me.  Small and uncomfortably hot is okay if the fo","useful":2,"cool":1},"dLPWRXOOxl4NDhWi1WLULw":{"text":"Full disclosure: I am a hot dog fan.  I prefer hot dogs to hamburgers at cook outs.  I lik","useful":3,"cool":3},"ymub7OpkXltzJ-wXc7XDoQ":{"text":"I was surprised I would like a hot dog restaurant so much! I got the duck hot dog. Check o","useful":0,"cool":1},"xklPEhY2QpNf0biKjO9d8g":{"text":"I have been to dat dog many times, but i had a horrible experience this time. \n\nI will be ","useful":1,"cool":0},"_Yd-anS_lOT3Q-JWwgXnuw":{"text":"Nom nom nom nom nom.\n\nThis place is just freaking good.  Smoked sausage (go Harahan!) with","useful":1,"cool":0},"lSHPwkouvzWk47-6fGS9rg":{"text":"Our airbnb host recommended this place to us, and we finally made our way here!  The resta","useful":0,"cool":0},"bqrmHQyAXaBK7Qz5i40U0A":{"text":"Fun place for lunch!  My son had the alligator dog; I had the special - Werewolf dog.  Bot","useful":0,"cool":0},"q94O60oR5XlbzmuY41jzhQ":{"text":"Finally had a chance to try this place after being away from New Orleans for so long. Many","useful":1,"cool":0},"80hHSGuihUJ9E9q9zHd64w":{"text":"Superb selection of hotdogs. Must try the Alligator hotdog, it was very soft. \n\n\n We had t","useful":1,"cool":1},"QOmoDzUe4pezGX4EzpCcnw":{"text":"When I want a good hot dog this is where I come.  The menu is simple, dogs and fries.  I o","useful":8,"cool":5},"xbgojrit2SmokFs-nfXITw":{"text":"Love Dat Dog! I live down the street and frequent Dat Dog maybe once a week, whether that ","useful":1,"cool":2},"8CN91MOioigVm4PSQKDYYg":{"text":"I loved the food here!  The atmosphere was really nice as well.  I followed everyone's rev","useful":0,"cool":1},"mRHlmBf-LpscBLtz7Pjczw":{"text":"We've been living in NOLA for almost a year now and tonight we finally had the opportunity","useful":0,"cool":0},"Uu5sNJVzjRp6cRfhJJxwEA":{"text":"German beef brat with mayo, onions,  tomatoes,  and the fries with chili,  yes please. Pup","useful":0,"cool":0},"QfxW-PtxqsSONkeqfe4K9Q":{"text":"We stopped here one day after work and I was amazed at the different variations of hot dog","useful":1,"cool":0},"Y7Jb4qEUoIscOqAXzWaHcg":{"text":"The decor of the place has a summer like atmosphere. Very colorful and cool garage doors t","useful":0,"cool":0},"llgYmAH12K7-iQr_R1j19A":{"text":"Great price for a quick, and delicious bite. My friends and I loved Trivia Night (Tuesdays","useful":1,"cool":0},"n027_73BvCUb07ke5bTytg":{"text":"We had lunch here last weekend while visiting NOLA to move our freshman daughter into her ","useful":0,"cool":0},"rqDB5wx2nTWyYz7nqLSSDA":{"text":"I have driven by this place many times and heard all my friends talk about it. So today I ","useful":5,"cool":4},"4RqSeNTVNz2UU5Fqb7ipAg":{"text":"This is my favorite restaurant in new Orleans. I love the guiness sausage more than anythi","useful":1,"cool":1},"dzyrt_bHOKmAkuRlSZxRBQ":{"text":"I've been here twice.....it is awesome (and I don't even like hot dogs)\n\nFirst thing....th","useful":0,"cool":0},"0vW4-P75Gaute7rfyJO0yQ":{"text":"It's near Tulane! I can go there instead of our canteen...We tried alligator dog and crawf","useful":1,"cool":0},"jbIxnQ9VGUvN7y8-z1GXHw":{"text":"I ordered a veggie dog and got a packaged Garden Burger cut in half, singed, and placed on","useful":4,"cool":0},"XY1sUdw_cEhmIHq1-1frHg":{"text":"Dat Dog is amazing. Sure, the price maybe higher than what you think a hot dog should cost","useful":12,"cool":11},"actuWzcshkjsTjXry_X6WQ":{"text":"Dat Dog keeps it simple, with just meat on buns, fries, and drinks making up the menu. But","useful":1,"cool":1},"3xl_xc59jhXQEMomXO51ww":{"text":"Had a plain pork dog, fries (with creole seasoning) and a fountain drink.  Fries were good","useful":0,"cool":0},"ykc3xwZYNolQ3v7a99aOyw":{"text":"I really like Dat Dog, and have found myself craving it on the regular.  I usually get the","useful":0,"cool":0},"o5D-TAZhenep2iNFfJdZYA":{"text":"Go hungry because portions are huge and plan on talking a walk after. I love the crawfish ","useful":0,"cool":0},"uZFU0UQ_IgOvP-Q4pnychw":{"text":"Alligator sausage? Chili cheese fries? I've died and gone to Joe Dirt heaven! Delicious.\n\n","useful":2,"cool":1},"H2aBri8jQpfyJ5zRlbcPRw":{"text":"I shall buck the norm and declare a 3-star rating. I know, shocking right? But everyone el","useful":0,"cool":0},"dXR68BM_PkaK-9Ne1ndpGA":{"text":"The only reason this doesn't get five stars is because of the day after. Nearly killed me ","useful":0,"cool":0},"Nhpy4ZS39QqIBi4v0iV7jg":{"text":"Yes!!! I found myself closing my eyes when I was chewing. I'm from Dallas but I'm a bit ob","useful":0,"cool":0},"sHNsIpiEvj1_zbJiRtBhkA":{"text":"I have been to the restaurant on Freret a couple of times.  I have been ordering an Italia","useful":0,"cool":0},"yGQxnrTP1ULpvluZDo9bDQ":{"text":"Hard to say this, but as a proud Chicagoan, this place has the best dogs I've EVER had (in","useful":0,"cool":0},"xueW8g_ZTNhuXct14rwo4Q":{"text":"Pretty good hot dogs...I think it's the bread more than anything.  Service was ok....not 1","useful":1,"cool":0},"3FgMbIbxlZrKf2CVwSb7ow":{"text":"Well worth the price and many choices of \"dogs\". I just got the traditional beef weiner wi","useful":0,"cool":0},"cNUNevxGBRhvFdiJ65K_nA":{"text":"Dat Dog is a great place for a casual lunch or dinner with friends. I bring my friends dow","useful":2,"cool":1},"2Tziy9qQhfXBcN6K8tEDHQ":{"text":"Good hotdog place. They have a three different vegan hot dogs. They have an outdoor porch ","useful":0,"cool":0},"LEIYz5pb5XXS2CYKSIIjxw":{"text":"holy crap was this the best hot dog I've ever had.\n\nbe brave and opt for chefs choice.  TR","useful":1,"cool":0},"yDX-aR1pBKO0kAUmczLkeQ":{"text":"They sell hot dogs. Only hotdogs. +1 for that. \n\nThey have creative dogs - not really my t","useful":2,"cool":0},"Wd2G2l9NnbU_etUX_OiZAg":{"text":"I love this place. A ton of options, and a lot of different meat choices.\n\nThe owner is us","useful":1,"cool":1},"0rd9hMHq7ix1Xs-oEUJK6A":{"text":"Glorious goodness!!! I love the simplicity of this heavenly place. Walk past all the picni","useful":0,"cool":0},"tFmznyikQ7EmH1MbdOx1oA":{"text":"Honestly I love Dat Dog, I live just a couple blocks up the road and I'm in there all the ","useful":0,"cool":0},"IkClsCBW9OamTcl-zQ15bg":{"text":"Certainly not the place to go if you're looking for an haute-cuisine dining experience but","useful":1,"cool":0},"XwGuo8qIO_Kr6IUWiCrscA":{"text":"Knew this place since it first opened up on Freret and watched as it grew into a money gru","useful":9,"cool":4},"4tr5lpzkDa7Drz-ATgCckA":{"text":"I love hot dogs. For real. So I was super excited to try Dat Dog - and it's really good! I","useful":1,"cool":0},"792bSg73n3m8WlgCUKRNNQ":{"text":"These dogs are not your mothers' Oscar Mayer wieners folks. \n\nTucked away in a little shop","useful":2,"cool":1},"ajylRWSd9UxNSY2EFJtyAQ":{"text":"um, crawfish sausage, YES PLEASE!  This is NOT a 'hot dog' stand!","useful":0,"cool":0},"7O5xzAS8blhnOpBwIASweg":{"text":"I've been going to Dat Dog since it was located in a shack across the street from the curr","useful":0,"cool":0},"s3HNCDLKEAZlsIwABTbJ0w":{"text":"The dog was so tender that the beef literally melted in my mouth. The bun was so sweet tha","useful":0,"cool":0},"FVOlMBWKF0SnWqDjvzYwBA":{"text":"Love this place which seems to be frequented by tourists and locals. Good for a date or ca","useful":0,"cool":0},"x-K-AY0POy0aY0WtLhJexw":{"text":"I am a vegetarian giving this place five stars. \n\nWhile I am a big fan of their veggie and","useful":1,"cool":0},"1Wz4QbVzEIaiqtWiQyAHHg":{"text":"I got the german smoked bratwurst. Honestly, it tasted like any other sausage to me, but w","useful":0,"cool":0},"mxPEliVl_d-YoBIzdTKY2Q":{"text":"Great spot hot dogs off the chain my girl and I were in town looking for something differe","useful":0,"cool":0},"8vAJxz9W8nQiJmxCCrj01g":{"text":"The Spot\nIf you find yourself in the New Orleans Uptown neighbourhood (and really you shou","useful":0,"cool":0},"7YANOa0m9Nusqo4-n-B-tg":{"text":"I hate hot dogs but I love this place. I got the crawfish dog with etouffee, with a bier d","useful":2,"cool":1},"JBEJRaWi1jxRkC87Kk8aCg":{"text":"As a blue-blooded Chicagoan living in NOLA, I feel fully qualified to review this hot dog ","useful":1,"cool":1},"oA0fN95YrX2NDF978fjXHA":{"text":"My first experience of Dat Dog was on Dine Out for Life.  A NO/AIDS taskforce fundraiser. ","useful":0,"cool":0},"p-xzDzVzgO5KetgfwJSBaA":{"text":"The wieners and sausages are of a very high quality. The buns are stellar. the array of to","useful":1,"cool":1},"EgzPqx0Gzj7irwzEhS6kvQ":{"text":"NOTE: Just wanna point out a couple things, Chris H. 1. I still gave the place an A-OK. B.","useful":3,"cool":0},"XTR8saXNcOmKrH75vNbxKQ":{"text":"So, when they moved locations, it was great for a while.\n\nThen they upped the prices beyon","useful":1,"cool":0},"qmnxjoaVYY4hts5LI1jrzQ":{"text":"Straight up. This is THE BEST HOTDOG JOINT I'VE EVER EATEN AT. Very brat approved. I had t","useful":1,"cool":0},"9WKsJWBgA0vvkD69siy1rA":{"text":"Y'know if I liked tubes of meat, I'm sure Dat Dog is great. But I decided after eating abo","useful":5,"cool":5},"oiWfZiPuduKABdjxr8gEWg":{"text":"i don't know . . .\n\n\"they are sexist!\"\n\n\"they raised their prices!\"\n\n\"they moved!\"\n\n\"their","useful":4,"cool":4},"2e8yMFCdxvXIbw67ofMasg":{"text":"Best hotdogs in the city!! You can have from german sausages to local lousiana smoked saus","useful":2,"cool":1},"ItTGsKM9QvMbBA0sB-Coyw":{"text":"Dat Dog is amazing!  I love the overall atmosphere and the food is delicious. I'm a vegan ","useful":3,"cool":1},"z98nbGLQhoI4cwGEqQ8t5Q":{"text":"They couldn't paint more New Orleans on this place if they tried... the best little hot do","useful":0,"cool":0},"EDtpCHheCkhhSDgTmyN3Vw":{"text":"Who Dat culture in New Orleans is very similar to a religion and seeing that I was visitin","useful":0,"cool":0},"sq0X1lyqXOt7aNy9gz1l-g":{"text":"Just stopped in at Dat Dog for lunch, and doubt I'll end up going back. I'm actually prett","useful":8,"cool":1},"5Zc-41gwFJ1MWBvJS7B3qw":{"text":"Great hot dogs. Hip atmosphere. Service is worth the wait. I was eying the Crawfish dog on","useful":1,"cool":1},"NS6IaShOQ3IcNK33UNIblw":{"text":"You want hot dogs? There are hot dogs here.\n\nThis is generally a better atmosphere than th","useful":1,"cool":0},"sxAzkV4Iys_mcSUsq3HdVw":{"text":"Don't do the \"Chef's Special.\" They put some kind of dodgy fruit jelly on my bratwurst, wh","useful":0,"cool":0},"r63byQ8cYkHOD3R7jPqVlg":{"text":"My love of the hot dog, like many others started from childhood.  As I've grown up, I've o","useful":0,"cool":0},"7qiCbTrzNZPqgkJdSTxDHw":{"text":"Friends brought me here and all I have to say is best hot dogs I have tried. And the crawf","useful":0,"cool":0},"Cq4LtwA2z4YDb8oBOOLnvg":{"text":"A bit of background info: I don't like hot dogs. Sausage is already the scrap meat (and st","useful":1,"cool":3},"XbWAiYdQAFh3qbUxszDbqA":{"text":"Multiple locations gives me pause, not really what a foodie is looking for when in Nola. B","useful":0,"cool":0},"oWA5Jgk5JYOZJqy_af5g2w":{"text":"Large outdoor seating area. Large variety of options to choose from. Would recommend tryin","useful":1,"cool":2},"nXfIv4V-cztPeDPTIIDgyg":{"text":"I have been looking forward to eating at Dat Dawg ever since I moved to Freret. Every time","useful":5,"cool":0},"gZcv4D6YI6c3cvFKJEQ_bw":{"text":"So I heard about this place from a co-worker, she raved about how awesome it was !! I had ","useful":2,"cool":0},"0PFs16qsUOSuOIlEZVPyEA":{"text":"Took a little longer than normal to order for some reason. I sat at the bar for about 10 m","useful":0,"cool":1},"6unVZAAv--HrnSZvh6gZAQ":{"text":"best hot dogs I've ever had! I've had Chicago hot dogs but this place has way better hot d","useful":0,"cool":0},"7lmolLKnnfkm77Hlnfgq_A":{"text":"Great concept nicely executed. Great dogs and happy hour drinks. Cash only. Always on our ","useful":0,"cool":0},"gAyIXKeZbIFhSA0FubzHYg":{"text":"The alligator dog is Everything!! I'm not a hotdog person, but I'm in love with Dat Dog!","useful":0,"cool":0},"ohvVLyKxv4zf_02cVzrBRQ":{"text":"Dat dog. I've heard so much hype about this place but really it's just a cool hang out. Th","useful":0,"cool":0},"Yf8pISVtdSFWsSDjfj4NXA":{"text":"Yes. Yes, yes, a thousand times yes. I grew up loving hot dogs, and finding  a place that ","useful":1,"cool":0},"LsW-o2ium0ZGTPqKssPfVA":{"text":"Absolutely amazing hot dogs and French fries - one of my favorite places I ate at while sp","useful":0,"cool":0},"uj3IVTMsFU4ChmiPD3so7w":{"text":"This place is awesome! I've been here 4 times now and it has been amazing each time. I've ","useful":1,"cool":0},"-pVGaOvOtNi7M6WDjBh2Lw":{"text":"Excellent hot dogs and sausages.  If you are not sure what toppings to choose, ask and the","useful":0,"cool":0},"JxVOpZX6-uoxCNP4qn6nJg":{"text":"This is the best hotdog I have ever had in my life. That includes Fenway Park in Boston an","useful":0,"cool":0},"prCZ_YH5Psxi7eZ-CrpyUQ":{"text":"My girlfriend and I split a Bacon Werewolf and Chili Cheese Fries.  We waited for about 20","useful":0,"cool":0},"xutH-8rzpxQDH7QMywSISw":{"text":"If you are a hot dog fan this is the place for you. Tons off dog options, too many topping","useful":0,"cool":0},"Nq2eGwE0fCXA-nnw6IK3fg":{"text":"Dat Dog is a hole in the wall, literally. Their hot dogs are excellent. Take your pick of ","useful":3,"cool":2},"V9-NRu52-sxit7wvo0tHJA":{"text":"Well Dat Dog is PRECISELY what you expect from a Hot Dog Restaurant. They serve an immensi","useful":0,"cool":0},"Wk71sF83_EGRcb9MgERdxA":{"text":"If you like hot dogs and fries, it doesn't get better than this. This place has a ton of s","useful":2,"cool":0},"1x1rO36IhauFoRRIQT6WNA":{"text":"Yet another notch in the ascension of Freret as THE NEXT BEST CORRIDOR in New Orleans: Dat","useful":4,"cool":3},"5eG8vykB3SwQT3Hr3zXTGQ":{"text":"Good dogs, though the temptation to put everything on is just to strong for me.  Wish they","useful":0,"cool":0},"EjdnjDg70FLG_Ret6RxCXg":{"text":"I can easily sum this place up in one word: addicting. I'm not sure there's a better resta","useful":1,"cool":1},"i7jCzOl6JNbLA0HkgUs-5w":{"text":"Always a treat to eat. Unlimited variety. Fun atmoshere.","useful":0,"cool":0},"5W89QQZqPJazBS80anuu3Q":{"text":"We stopped by to sample the wares on a Saturday afternoon. The line was out the door, but ","useful":1,"cool":0},"KxA63I-QehPyNvKx0SChXw":{"text":"I have been to Dat Dog many times since I wrote my last review...too many, probably! So I ","useful":4,"cool":1},"WqKFTKpIbtvLWN-2AnwkMA":{"text":"Love this place.  Every style of dog I've tried is great.  Delicious Andouille Sauce!  Hin","useful":0,"cool":0},"ApR-0XlTS5VwXxa3zVxHoQ":{"text":"Over rated.  I got the Slovenia dog and white trash fries (even tho im classy af). \n\nWhat ","useful":3,"cool":0},"ycQz5PIu_9s-iJs0l-8wuA":{"text":"I'm from out of town and visited Dat Dog with some locals for dinner and Tuesday night tri","useful":0,"cool":0},"zEQb-Uc157WbiiuRl8Q5WA":{"text":"Holy fucking hot dog!!! This place is soooooo good. If you think to yourself, \"I don't lik","useful":0,"cool":0},"NseHYTBOptD7q7RX78TAzA":{"text":"White trash fryz and Chicago Cubs themed night! How did you know, Dat Dog?","useful":0,"cool":0},"C2OBbUOALcvxgVfDa2mSyw":{"text":"The hotdogs and the fries here aren't bad.  In fact, the food is pretty decent for fast fo","useful":3,"cool":0},"y5YMYbmziTJdqJbFQ_-r7w":{"text":"Dat Dog was hands down the best meal I ate in New Orleans - and I didn't even have a \"hot ","useful":0,"cool":0},"PMj-EL4l-2XuE38R0gvYnQ":{"text":"Great new hot dog concept that has been a real hit on the Freret St food scene. This spot ","useful":0,"cool":0},"boLipYij7a2npaAWYrm7Rg":{"text":"I come by my hot dog cravings honestly. My grandmother loves hotdogs as do i. Dat Dog sati","useful":2,"cool":3},"OdFmryY68O5jlMydZ_5cqg":{"text":"We decided to try this place for a quick dinner last Saturday.  Upon walking in we were gr","useful":1,"cool":0},"yyVdSrbv3texnIE7imZsfw":{"text":"Ruff on your wallet, wait takes furever, food is worth humping strangers' legs for. So con","useful":1,"cool":1},"6fe__Q7iBjRYYz1Cr3EzgA":{"text":"Look out because DatDog is takin over. Always nice to see a local biz rising. If there wer","useful":0,"cool":0},"S2aSfP2U0sbOtIMC_yO_Rg":{"text":"Good dogs. Iffy buns. Too F-ing expensive. \n\nI love dogs. Lived all over the world. No dog","useful":8,"cool":2},"wfE8pUQQup7CqzHceczDfA":{"text":"Dat Dog's offerings of different hot dogs, sausages and kielbasas are very interesting, an","useful":3,"cool":0},"TE78NUXUfmA1ykQC3navsQ":{"text":"Their hot dogs are decent but they run more on reputation from the past than current succe","useful":0,"cool":0},"mJ6VUCR-BFUf1oONxNCGyA":{"text":"Waaaah. I hate to do this, but I have to update my review. This past Saturday I went to Da","useful":2,"cool":1},"D8daI_Hqn0Z136DNFNF8Cw":{"text":"I got the brat with sauerkraut, jalapeno, onions and mustard.  Because I eat most meals li","useful":1,"cool":1},"2p3mL-zxFpeBqXcc9tLczg":{"text":"Great selection of hot dogs. They also serve alcohol and have outside seating. I nice hang","useful":0,"cool":0},"Goad6ix_SAYbzC6ZY0uRLA":{"text":"Dat Dog will definitely be on the must-go list for all my future NOLA visits! I had the cr","useful":0,"cool":0},"_oNHkKBlMyPtH6N73pJedw":{"text":"What's not to like about this place?!  Moving across the street was the smartest thing the","useful":0,"cool":0},"_Tvodsi5-rdMnxovVnf-lg":{"text":"This is the best hotdog I've ever tasted!  This place is great.  There are many selections","useful":2,"cool":1},"AYBkB62duR-kyeYm5pKUpA":{"text":"DELISH variety of hot dogs and sausage on a yummy roll.  Fun place for all ages.  Cash onl","useful":0,"cool":0},"rLHyGHFgs9_LaiJ7-fVsvQ":{"text":"They have great dogs and sausages with some pretty impressive toppings including guacamole","useful":2,"cool":0},"PQlWGjZtpPj7HptLAGaD4g":{"text":"If you are a college student at Loyola and Tulane it is a simple walk. Don't pay the $6 or","useful":0,"cool":0},"5jx3JbWDmfEC6cToWMWvuA":{"text":"Don't do the \"Chef's Special.\" They put some kind of dodgy fruit jelly on my bratwurst, wh","useful":0,"cool":0},"rt1WTEi9BhxDiMCZmlheDg":{"text":"Hadn't been here for a few years and went back last week for Trivia night and the new renn","useful":0,"cool":0},"S-WhzcAL9B9pww0u-SxtjA":{"text":"My first Dat Dog experience was surely one to remember. I arrived, somewhat late in the ev","useful":0,"cool":0},"HS6c1aEYzSMD0tqdBYg-Uw":{"text":"I don't always eat hotdogs, but when I do, I go to Dat Dog...\nRelaxed atmosphere, good sel","useful":0,"cool":0},"GLMfGx57CSEUNNV_HnSP6w":{"text":"Not impressed. Don't get caught up in the hype. Hot dogs were small. Slovenia sausage was ","useful":0,"cool":0},"_FRWzOb1YjnPcp0u4BXaQw":{"text":"First time going here and the owner was delighted to help us with our selection from the m","useful":0,"cool":0},"C1jx1z0H-n4Km3hE4i5sbw":{"text":"The name itself makes me want to check it out. Truly New Orleans. One bratwurst hot dog wa","useful":2,"cool":2},"sN4sMSd08Hq44o20GTlfWw":{"text":"I love Dat Dog's food. Their ambience? Perfect dirty hipster chic. Prices? Fair. However, ","useful":2,"cool":0},"gG6BFYTxwkOzwAUiTNL_2g":{"text":"Pretty good! We enjoyed Dat Dog before a NOLA Social Ride last week. The food was good and","useful":0,"cool":0},"yPY9xX2d4f_Ay1Bh-vZGFw":{"text":"the tastiest hot dog to ever touch your lips!\n\nlove this place! you can be as creative as ","useful":0,"cool":0},"DBtCPm6F_1K-675rFbbVUA":{"text":"OMG! I love Chicago hot dogs and I expected similar fare here! Was I ever disappointed! I'","useful":1,"cool":0},"-sk3WGPraSpu-8UwuTtL_Q":{"text":"TEACHERS OF NEW ORLEANS:\nYou are the WORST bar patrons I have *ever* had the displeasure o","useful":2,"cool":3},"ABSSAewpbOBqSAdraFcxGg":{"text":"Its a hot dog joint that sells hot dogs but they have some mighty fancy hot dogs here.  I'","useful":6,"cool":1},"MaFaFjdYTiaFY3Q7HZgZfQ":{"text":"Best hot dog/sausage joint around. period. I have tried every type of sausage and combo th","useful":1,"cool":1},"gTGqfFB1q9EWPSPLdXGbgQ":{"text":"Omg had the best time here. Staff was amazing, dogs were insane. GEORGE WE LOVE YOU.  Beer","useful":0,"cool":0},"hY945_WhXBqPL4iFskxh9w":{"text":"SO good.  Ordered the Alligator Sausage with the Chef's Special (they pick the toppings) a","useful":2,"cool":0},"U-6ZvHcFRW13x-Cl8jabyQ":{"text":"Great service. Great meats. Amazing bread! Top ratings for anyone looking to get a hot dog","useful":2,"cool":0},"HdGTsTTW1nWIyvR0As4ljg":{"text":"A hot dog place that is known for being one of the tastiest restaurants in NOLA? Yeah righ","useful":0,"cool":0},"6jzJOo5Cp3H0dCYRMlaenw":{"text":"While I was impressed at the MANY different types of meat they had for hot dogs, I was not","useful":2,"cool":0},"U-LTWBrolRnvQ6JrdCY3EA":{"text":"This little hot dog joint has quickly become one of my favorite eateries in the city.  The","useful":0,"cool":0},"xjlxEvXNBkZ2TeGsI6nLEw":{"text":"So delish!! The crawfish sausage was simply divoon!! I love the andouille sauce and their ","useful":1,"cool":0},"s1eDVxoacg7E-pEeIxPqRg":{"text":"I am not a dog expert.\nBut I thought certain dogs would be bigger than others.  Kielbasa a","useful":1,"cool":0},"TOVIPuQWUILf38GpUUFeTA":{"text":"Our second trip to Dat Dog.  I like a good hot dog.  This hot dog just ok. I ordered a reg","useful":2,"cool":0},"XqY3xxrbrKuIEbow1EmIkg":{"text":"Best $9.81 you'll spend on fries and a brat. Makes you feel like a spoiled kid on a sunny ","useful":1,"cool":1},"4Rorq1_YjXJuB3E0LqBCPQ":{"text":"Went last night for the first time.  Got the secret hot braut (not on the menu)...Thanks g","useful":2,"cool":2},"0ZPIsmVXnNPH7JiM1woioA":{"text":"If I want you want a hot dog, try Dat Dog. Every type of hot dog to satisfy your taste bud","useful":0,"cool":0},"M4aEjBWQGNi9lyYB0wwLSA":{"text":"This is not your typical hot dog. I would summarize it as a high end sausage with lots of ","useful":0,"cool":0},"qDEkksSUZ8T7TGNRvEoq-A":{"text":"Dat Dog, oh how we love you. My only complaint is that one hot dog is too big for a little","useful":0,"cool":0},"43auFlkHukHUHbq8G--CPA":{"text":"I really liked my hot dog and I got the WTF fries which were pretty good. The only problem","useful":0,"cool":0},"onc1V2x86p2R2MWTI7HgOA":{"text":"Authentic and fun. Great place for families and a light-hearted date. Brilliant area to ea","useful":0,"cool":0},"EbKDok1ehAgitfr_mz16mA":{"text":"This place is tiny and when I walked in the music was BLARING. Luckily they are opening a ","useful":0,"cool":0},"BD3Jlock0nlsN2luaGuPjw":{"text":"Service rocks, and you have to try the Guinness dog and the chef's special toppings. Also ","useful":0,"cool":0},"0-e4HDqKPk1z5IvMU2uF4w":{"text":"THIS FOOOD IS AMAZEBALLS!!!\n\nPROS: the food was amazing.  We came down for the weekend and","useful":0,"cool":0},"hKQ8ibt5NqOkfNMXDxscEA":{"text":"The sea dog was amazing!! The bacon, cheddar, ranch fries were good too. Not the best I ha","useful":0,"cool":0},"XaV_mnBRJUe_QfIg9tdd9g":{"text":"Really good! We went to check it out on a weekday by default because the other restaurant ","useful":1,"cool":0},"8fdbVIEzvy_AbPsKK8iifA":{"text":"The buns are vegan. \nI originally posted a poor review bc I there was a long standing rumo","useful":3,"cool":1},"BnAeD7gHU9TQQA0ZW4OTYw":{"text":"So good.  Located in an old gas station on Freret St.  I love that you can just order a do","useful":1,"cool":1},"FII6uADQSOXPvvlGkrqPtw":{"text":"It's a hot dog. It shouldn't cost $5. If they had something for $4.50, I'd be there all th","useful":1,"cool":1},"bXsXl_aRmxD3LHwPI5PYBA":{"text":"I had the smoked sausage dog, which was pretty good - good size too.  Nice bun (next time ","useful":0,"cool":0},"Qnz_Oh0MtJ8d6a7umrjwXQ":{"text":"Andouille sausage dog with creole mustard, crawfish etouffe and onions.  Pretty good.  Che","useful":2,"cool":1},"bCB0tr1a2LROTOi4FUzU4Q":{"text":"Good hot dogs most workers are musty!!! Most of the time food is fresh. Work need to wear ","useful":0,"cool":0},"Hyq8XbvGAl8lkd7oGNYrCQ":{"text":"This place is great and has a lot of 'dog' options.  As a non meat eater, I've tried the \"","useful":0,"cool":0},"c4IVKERf4QPCXwfT6P27sQ":{"text":"Incredible hot dogs, more than just a regular hot dog. The bun is nice too. Very yummy. Lo","useful":0,"cool":0},"Mcapg3qtTnQKbWTb3sR22w":{"text":"Like Dat Dog even needs anymore 5 star reviews. Place is a staple. So good and fun to crea","useful":0,"cool":0},"n-u7timh4CQWV0Fd-gZLew":{"text":"The \"veggie dog\" is really a veggie burger cut in half a placed on a hot dog bun. There ar","useful":4,"cool":1},"u6IKA_uvfprNeMTY6uGzFw":{"text":"The food is always very good.  Easy parking.  DOG FRIENDLY ON THE PATIO.  I'll be back....","useful":3,"cool":0},"sMcYdPbbTQejUW-Od9pfdA":{"text":"The hot dogs are all right. But you very well could make them yourself at home.  The resta","useful":2,"cool":0},"hfRORIlxnYJ92AXkPkeEiQ":{"text":"I'm normally not a huge hot dog fan, but Dat Dog is freakin' addictive.\n\nBetween the half-","useful":1,"cool":1},"LnqigFduOPK0Kg1sV2cnQw":{"text":"Heard how great these dogs were and they certainly didn't disappoint. Nice variety of menu","useful":1,"cool":0},"E1AGssp9cPNWJKa8-2UxWg":{"text":"Some of the flavor combinations will make your head spin, but they are all delicious. You ","useful":1,"cool":0},"P-6WNiHph2hYM_h3v_JP0w":{"text":"This is weenie heaven on earth! I finally got around to eating here last week, and I had t","useful":0,"cool":0},"aTRY60JKNlLJqjfaDpO3EA":{"text":"yuk..why are the buns so damn sweet..it is like eating dessert. \nthat totally ruined every","useful":2,"cool":0},"uoYS0fP1yGH3auWAFDH7Sg":{"text":"I don't like hot dogs, but I like DAT DOG's hot dogs. \n\nIdk how they do it, but my meal wa","useful":4,"cool":1},"TXMojBUzYEnZUeMUsoBbNg":{"text":"I went during the week day around lunch. They had a lot of options that sounded good but I","useful":0,"cool":0},"m44P6GYpI14ErQtkfdU1ww":{"text":"My first experience at Dat Dog was after a night of drinking on Freret. I was immediately ","useful":0,"cool":0},"w-lmz3A3gFY0_yi13fidZQ":{"text":"Excellent veggie dog and you can get it loaded with toppings, which is what dogs are all a","useful":2,"cool":2},"sAF74JWt4eheJOKueeCjow":{"text":"I love this place!   They cook the hot dog or sausage to order, and they toast the bun.  Y","useful":1,"cool":0},"qmmc71QEUCUiOLh6o63R2w":{"text":"I am not a fan of hot dogs, but I love Dat Dog. Loved the bacon infused vodka in the Blood","useful":0,"cool":0},"sQF0QkXHBeTRcs0mVHgGxg":{"text":"Dat Dog is DAMN good. Endless choices of topping and choice of dogs. I been here plenty an","useful":1,"cool":1},"mzwVwvH2teZ5CVcBSaIuxA":{"text":"You have plenty of options here. Between all the sausages and weiners and the myriad of to","useful":4,"cool":1},"FiCTG3gTxx0YkFRGf_3rRQ":{"text":"I LOVE this place. I never knew a hot dog could taste so good!\n\nThe service is pretty good","useful":2,"cool":1},"jMNI0NxyceprhcaNYi0fTw":{"text":"Dat Dog was good, I'm glad I can finally say I've been there. I think this place could be ","useful":0,"cool":0},"1wcRHDtiShM3sQqy1eIqQQ":{"text":"Great Bratwurst and pretty good dogs. I was driving down Feret and seen this place so we m","useful":1,"cool":0},"oNyuc1N5fSlGg49HMsyKuA":{"text":"There is nothing more that I could add to help you decide whether or not you should eat he","useful":2,"cool":2},"7AQVC7s6pzybVYGJ86veVA":{"text":"You know what the best part of Dat Dog is? You and your canine friend can enjoy a heck of ","useful":1,"cool":0},"gQDTlHwfmOUyjdyZDuKa2A":{"text":"Good chow and a wide selection just a little crazy with the prices. Staff is courteous but","useful":2,"cool":1},"EUuKMRcqZxVRmce1rn7eww":{"text":"They have A LOT of choices. So much so that on my first time coming here I was kind of wor","useful":0,"cool":0},"-fIKPQ1DMUp0BgmgXJERVA":{"text":"An incredible selection of hot dogs- every style and flavor you could want...  \n\nThe lines","useful":2,"cool":0},"aY6zmMsyaTaxyhtRP7v3_w":{"text":"Great place to bring your dog and sit out on the patio - perhaps watch a game or two on th","useful":0,"cool":0},"lUtPP4ZxwPWJvDomeXq0Pw":{"text":"This is my second review on a hot dog joint but I must explain it's my husband's fault. Se","useful":1,"cool":1},"iws82tAmSSMr6HjrPVVoqg":{"text":"Dat dog is dat good. Came here while on a mini vacation based on several locals recommenda","useful":0,"cool":0},"NY3nQurbesRf5HOqIqU91g":{"text":"Food - Good\nService - Fair\nSpeed - a bit slow\nAtmosphere - Eclectic\n\nFirst time diner - ar","useful":0,"cool":0},"sYyXtvo746i8ZBhD-X7FYQ":{"text":"Awesome service. Best bartender ever. Lindsey was super attentive and kept our drinks full","useful":0,"cool":0},"7hKz_nipdMZHeo6Op0eQsQ":{"text":"One of the many places in our neighborhood. Great happy hour drink specials, and last time","useful":3,"cool":0},"0VNwlq293uruOIhuClANzg":{"text":"Mistay was the first to greet me.  She's a pure joy!  Recommended the gator sausage dresse","useful":0,"cool":0},"FCNa0rSMbGzJSn7Y4_dusQ":{"text":"The dogs were really good. I was a little disappointed that they didn't offer a childs mea","useful":0,"cool":0},"3rKE-oMgbJfaGeuPC8J81A":{"text":"THE BEST HOT DOG I EVER HAD!! I can't begin to talk about the sour dough bread! OMG!!!!! T","useful":1,"cool":0},"nA3d-ap1CVKItlozgMG3Kg":{"text":"Ok hot dog, but nothing to write home about.  The decor was nice, which is probably worth ","useful":8,"cool":0},"HeLyCsNwXPVrNeTSEwsPBQ":{"text":"Dat Dog has a great selection of interesting sausages with a nice mix of ingredients to tr","useful":0,"cool":0},"hB4Z5mW6d_qfEs_gixbF6w":{"text":"I love this place! I was back in NOLA visiting my family and went here to watch the Saints","useful":2,"cool":0},"OoM7iwHylpjxfDavx3ealQ":{"text":"Unique place and great to finally have in NOLA, I like the new space in an old gas station","useful":0,"cool":1},"VKMHqOj9xWP9yXY5RXe1cA":{"text":"I'm not even a big hot dog guy, but I love Dat Dog. They are great hot dogs with a New Orl","useful":1,"cool":0},"6nnUl25ahknY-FohEBn4zA":{"text":"I might be in love with a hot dog... Can I say that? Well I just did! No regrets! Why can'","useful":1,"cool":3},"i5w1d0p-rP7aLbvWQbPHNg":{"text":"Great place to hang out and enjoy good food. \nI'm pretty simple so I tried a bratwurst wit","useful":1,"cool":1},"mgOkoEQtBYj9aPtDI3n5ag":{"text":"I love Dat Dog. I always get the gator sausage or smoked. I remember when they first start","useful":0,"cool":0},"F1AjKeZxYNW-V7KcfWwMrg":{"text":"In my opinion, this is the best hot dog/sausage shop in New Orleans. I have tried the gato","useful":0,"cool":0},"GOpfpHf9aj0tuMN7Ke7DWA":{"text":"I really like Dat Dog. I know I'm only giving it three stars, but that's not because the f","useful":1,"cool":1},"uAN1WYS-JG7BuGJOirAppA":{"text":"I brought my Yat Step Mother (Yat refers to a New Orleans Native) and my Cajun father to D","useful":2,"cool":0},"KowxFKRazQ-a3XEDcIhHpQ":{"text":"Best hot dogs if you can even call them that they are so good but save money and split fri","useful":0,"cool":0},"2GQHeQDJhqfPf5KF-S3zqw":{"text":"Okay!! This was my first time dining at Dat dog and my last.. I had such high expectations","useful":2,"cool":1},"BJ5vNUwVYTMr83V-OVSzXg":{"text":"Dat Dog has it going on.  Trendy and hip with out being pretentious or over reaching.  Gre","useful":0,"cool":0},"sfTz3rvAAO1pZ-8g25aA9Q":{"text":"Not feeling Dat Dog at all.......\n\nWe wanted to try out these hotdogs EVERYONE seems to be","useful":4,"cool":0},"6AxuIyslrqkJWVHWYanHBg":{"text":"To the NY, Chicago, whatever reviewers - this is New Orleans. This isn't New York City, th","useful":2,"cool":1},"0EmzlQGeyen-RVi_9XtWRg":{"text":"Dat Dog is Dynamite! I have been for lunch a few times and always leave satisified. I woul","useful":2,"cool":0},"i5caXwYeqjjHPnXZwTTfnw":{"text":"Oh, Dat Dog.  I had only heard rumors of your awesomeness.  Then I got to experience it fo","useful":12,"cool":12},"7drjNNppMpFida-y2KghIQ":{"text":"Great location and fast food! Lord the idea that I was able to build my own dog. They also","useful":0,"cool":0},"PXFzfrcrZPBlgcYaBH6vgg":{"text":"Dat dog deserves every bit of praise directed at it. Not only does it break out of the typ","useful":0,"cool":0},"xBFjw2UjoEoy3XMkxlfN5g":{"text":"Loved the outdoor area. Fast, funny and friendly people behind the counter. White trash fr","useful":0,"cool":0},"xTuEt1W5fBD8B43Mu_eIDQ":{"text":"DisAsTer on Freret!! \n\nStay far, far away from this place. Do NOT go in hungry. Wear dirty","useful":3,"cool":2},"3QpU0aM9xvr_baNurlPzAQ":{"text":"This is one of my favorite places in the city.  If you feel adventurous, request \"Chef's C","useful":0,"cool":0},"C0SvHhyVIPtvukmWaBiMbg":{"text":"This place is a must when your visiting New Orleans. It is the king of hot dog joints and ","useful":0,"cool":0},"Z1J4Dx0cpP1Z_6u--yWSJg":{"text":"Not a bad place if you're a fan of hot dogs. Really cool set up, unique design on the insi","useful":1,"cool":0},"GfEc8g2GEL9Zm6Mjjm77ag":{"text":"You might question a local chain with a menu full of hot dogs and fries, but Dat Dog was a","useful":0,"cool":0},"y_2ZTLMLlrWdJO8axlmkZQ":{"text":"Been to this location and magazine, both have good and helpful staff. There are literally ","useful":0,"cool":1},"ZHQU4vomzC71XsszWjn2Ig":{"text":"Place was dirty and smelled like mop water.  I saw a roach crawl under the grill when I wa","useful":1,"cool":0},"XZq5uwRoy9VApwPHV_12Gw":{"text":"How this place averages 4 stars is a real mystery. I typically believe yelp is spot on. Ma","useful":1,"cool":0},"KFwSOXkF3WyEQqe72sRRiA":{"text":"Alligator dog was delicious! Got it Togo because the place was super packed. Would definit","useful":0,"cool":0},"KysMB-MODMd0i2mUrMRArA":{"text":"I got the suggested Crawfish Sausage.  Dang, it was good.  If you like Crawfish/dads or mu","useful":0,"cool":0},"H1iwqEcsWM4oIhFukLh2MA":{"text":"Dat dog was ok when they first came out and you at least got what you paid for. Now you ge","useful":0,"cool":0},"mtyLSCITinbRAYsMMI02JQ":{"text":"Etouffe fries and the duck special are the name of the game here. My son used to work at o","useful":0,"cool":0},"muQMmXsNWMWYNWljI5HbeA":{"text":"Great hot dogs the bun is amazing. There are a wide variety of toppings ,they do serve alc","useful":0,"cool":0},"t3FSkxOAN8zHvI26511iuw":{"text":"Went there for the first time today for lunch.\n\nHoly crap this place is good.\n\nI got the a","useful":8,"cool":5},"HbGJGdmxJkm3McC5cemgzA":{"text":"I left Dat Dog with a sour taste in my mouth, and it wasn't from their delicious sour doug","useful":9,"cool":1},"AkJtN4jB9g01f0F3LaU2cw":{"text":"Saw a lot of reviews on it and wanted to try it out. I tried the alligator dog and it was ","useful":0,"cool":0},"EYFTrxO3pJqVopsW-Eq3Ng":{"text":"As a former Chicagoian, I'm pretty picky when it comes to hot dogs so I was pleasantly sur","useful":4,"cool":3},"urx-ENcG20C28JrhnDjEVg":{"text":"Hot dogs, sausage dogs, and everything in between.  You must share multiple dogs so that y","useful":0,"cool":1},"fSesTJh40IdkwuJ8V71gig":{"text":"I'm not a big hot dog eater at all. I would probably have one once every few years and I d","useful":2,"cool":1},"PlHTAUa542SzhruXBennxw":{"text":"I've read a lot of the reviews and decided to give this place a 2nd try. Really regret it!","useful":0,"cool":0},"JU2mghWrpNcfhDb8LyjJPg":{"text":"5 stars for the food alone. I had a beef hot dog with chili, cheese, and onions. Very very","useful":0,"cool":1},"BnJhEkkkn9JQuGR55ouSGw":{"text":"Atmosphere: Primary colors. Noise and confusion. Lines of people snaking around tables. Lo","useful":7,"cool":2},"2gGVoqriarK3QnKVlb9nYw":{"text":"Hotdog was good. Fries were very very very salty. We had to throw away almost two full ord","useful":0,"cool":0},"189OkCfv2_BjxD-r53i1cg":{"text":"If I could move live inside this restaurant I would. Every dog is better than the last. Th","useful":0,"cool":0},"sKSZuB3lV72eEBaEZoMZgg":{"text":"Nice decor. Good selection of hot dogs, sausage. Too bad they don't have different size ho","useful":0,"cool":0},"kTRcf-EtLg9dddM6oDdBdw":{"text":"I remember when just 5 years ago when this was a tiny hot dog place on Freret where there ","useful":2,"cool":0},"t_elMZxNK1BPsV5YEYGQnQ":{"text":"I got food poising from this. Still reeling from it. Can barely eat anything almost 12 hou","useful":0,"cool":0},"dvOTqbV2-OzjhDy11kesjQ":{"text":"Great funky atmosphere and fabulous food.  A variety of sausages with infinite sauce & con","useful":0,"cool":0},"WUKwvLeVWev45nsZtOMm-w":{"text":"One star because I can't give a 0. Came in after frerestavous to see if there was a gluten","useful":1,"cool":0},"KZVgCI2Wj3KtZVcmGLQgHg":{"text":"The best. My standard: Guinness dog with crawfish etoufee, cheese, bacon, and grilled onio","useful":0,"cool":0},"dwuyRF8wuS_DkCZdNQGtKA":{"text":"Go. Now.\n\nEverything is good. All the fries (my favorite are the Bacon Cheddar Ranch - you","useful":0,"cool":0},"QXs4tykkAeC3bMTH6l4snw":{"text":"Awesome customizable variety of dogs to choose from all cooked to order. Seasoned fries ve","useful":0,"cool":0},"8xWiHY4jHrWsca-Zq15cFQ":{"text":"This restaurant was featured in one of the magazines in our hotel room.  It's located in a","useful":1,"cool":0},"hai8QiJdb2n_QINZ1KdEdg":{"text":"Great hot dogs and even better hot dog buns.  I get the crawfish dog every time.  Relaxed ","useful":0,"cool":0},"HDw1J1CTl43IfEJQGFir-g":{"text":"Ordered the gator sausage with andouille sauce and grilled onions. Can't speak for other i","useful":0,"cool":0},"L4o_-0mRqABtqxa8iTkEMg":{"text":"I'll confess: for the longest time my knowledge of hot dogs consisted of various flavors o","useful":1,"cool":0},"RgWRHrKEoLsbXe1NojK23w":{"text":"They take gourmet hot dog to the umpteenth degree! I love how extra toppings are no extra ","useful":1,"cool":0},"j_cmHmVXH8NURpAYzoeU_Q":{"text":"Fun hot dog joint. We all ordered different dogs and all were tasty. Definitely try the fr","useful":0,"cool":0},"gPl0F31ouNDdHMZIwDaAPA":{"text":"Great overall experience! Food was delicious, with an ok price.  The line gets pretty long","useful":2,"cool":1},"PPl_RwsDY1rvs5Kpxrt7Ow":{"text":"Got a recommendation to go here, and not only was I not disappointed, I was totally blown ","useful":1,"cool":1},"Lg24H1sSmFQUlJBLDsh5GQ":{"text":"I think my expectations might've been too high. I envisioned something akin to Frank in Au","useful":2,"cool":1},"tqr5iwHui1BWHPg5lfhkZQ":{"text":"We went to all kinds of touristy places every time I've visited NOLA, a couple of high bro","useful":0,"cool":0},"nYIw4-0tFXndlvRhYlVfvg":{"text":"Fantastic Dogs! Great beer selection, awesome staff. Highly recommend this place for any h","useful":0,"cool":0},"VPW7v09_vvAg72rGDCxXWw":{"text":"More like 3.5 stars.\nThe bun is excellent (and I'm picky about my buns..).  The toppings a","useful":1,"cool":0},"BxQGVKbfAeY8Ua0yO5T3Og":{"text":"The bun was great.  I could just eat the bun and be happy.  I ordered the cajun/bratwurst ","useful":0,"cool":0},"n70fEsRk36cE_ynV366MOg":{"text":"I've been to Dat Dog twice and each experience has been delicious! Today I got an alligato","useful":1,"cool":0},"fskXwGyYWOWF3RBDGBGHwQ":{"text":"3.5/5\n\nI'm not a fan of hot dogs. I've eaten less than five in the past decade. I'm no hot","useful":1,"cool":0},"eUE77XvV72CEkFVNJjoCnw":{"text":"Had the smoked bratwurst with guacamole and onions. Sooo good. Also split the poppy Tooker","useful":0,"cool":0},"NO0aQUVUhugEyVKVfdp3jA":{"text":"Delicious quick food, great happy hour! \nThey no longer have a veggie burger, but there ar","useful":2,"cool":2},"4vZV1anyB8M3zPMv1aJNwQ":{"text":"When it originally opened on Freret, I loved Dat Dog. They still have quality food but for","useful":0,"cool":0},"kkjvBsKpNhBK1pcCqsekrw":{"text":"I've been here about 4-5 times and it's always amazing!  Delicious!\n\nThe shop is very smal","useful":1,"cool":1},"xlclvWybrjgZJ8W7CjrQJw":{"text":"Any hot dog that can be reheated in the oven the next day along with its fries and still b","useful":3,"cool":0},"IbFHCDtVQ1Aq9eS6dxMhew":{"text":"Good beer selection. The hot dogs selection is insane. I ended up getting the chefs specia","useful":1,"cool":1},"pK7u-upC6MEFkBaXQW-oDQ":{"text":"Frequent diner at Freret location but in recent visits the cheese fries have been lacking ","useful":1,"cool":0},"U8A52Li5SYfxSeNUpL5qMg":{"text":"First off, I'm not a hot dog person.  They're okay at a bbq right off the grill, or at a g","useful":2,"cool":1},"DFD0jq5aDUhSl7mvJ4sbOQ":{"text":"The chicken sandwich was very good. The girl working the counter was very bored. The dogs ","useful":1,"cool":1},"CE9IkIUBIS1wZukQKNwxIQ":{"text":"My favorite place for comfort food while working hard uptown. The crew is always so nice a","useful":1,"cool":0},"zrTrZNMQ8_RSzUW_mGyiiA":{"text":"I was taken here by some friends from Tulane. Such a great place.\n\nVery flavorful and extr","useful":0,"cool":0},"DegWEp807FlkYgpClo2WNA":{"text":"You have to wait in line. Then you have to wait in another line to get your drinks. The se","useful":0,"cool":0},"M1oMnzR2tRHA2DeQ25noNA":{"text":"As a starting point, most hot dogs joints are kind of shitty.  Consequently, you'd expect ","useful":2,"cool":2},"q5hBftUrdObGnRxCbS5dgQ":{"text":"Dat Dog has quickly become a New Orleans institution, especially on Freret. I love the hot","useful":0,"cool":0},"dUhp0L62wsGNgUaifGv4lQ":{"text":"This isn't \"just a hot dog\" like oscar meyer or some other grocery store brand, as some re","useful":0,"cool":0},"mPcA_ucLKy_PJiRbb9hdWw":{"text":"Ordered via UberEATS.  Food was awesome and we got exactly what we ordered.  Craving some ","useful":1,"cool":1},"ncUSfD8L1HcRRF5zXMPbmw":{"text":"Tasty with an interesting menu. I had an alligator dog! Not touristy.","useful":0,"cool":0},"uudarwlJEwIZW2XOrqQqhg":{"text":"HOW HAVE I NOT REVIEWED DAT DIG?\n\n1 you get a free hot dog on your birthday.\n2 the buns ar","useful":2,"cool":0},"vIqwBaQYz8HzDBSta5yeMw":{"text":"I have sort of a love hate relationship with Dat Dog. I think their hot dogs are really go","useful":6,"cool":3},"pFCHflVgZ1lvahiAqZXrCA":{"text":"Came here with a group of friends and we each ordered different things. I got the Guinness","useful":1,"cool":0},"AkgKr1Ki9qVFvjX2am5b3Q":{"text":"This place has a great feel, delicious sausages and really nice people behind the counter.","useful":2,"cool":2},"L874aYwuM29EsQE1i4nriQ":{"text":"Oh My GoodNess...  Had a beef one, slovian, crawfish & gator ... With all kinds of differe","useful":0,"cool":0},"Gz06wtCgKGfmTWF3Z902-Q":{"text":"This place was recommended by a cab driver in the area. There are two locations, this is t","useful":0,"cool":0},"GUt955HIna9yXIG848fSXw":{"text":"While I'm usually a big Dat Dog fan, yesterday I had a not-so-stellar experience. The plac","useful":3,"cool":0},"qjO69535QEZsMqDw5_jJyA":{"text":"The food was fantastic. The homemade red drink, and the fact that they call it red drink, ","useful":3,"cool":2},"xpjHlW92GYWIOgn2sD06uA":{"text":"This place was a pretty neat venue. Half inside, half outside seating. This was our first ","useful":0,"cool":0},"9IDHyCArkFiNOFHOe6SR8Q":{"text":"Last time we went it seemed that they are using different buns. They were harder and didn'","useful":0,"cool":0},"E2iuHWCh6ziy5NtJuky6aw":{"text":"The best hotdog stand in New Orleans (which really isn't saying much) with excellent toppi","useful":1,"cool":1},"UogfVnXvbarC7s808vtZSw":{"text":"The bad: They are cash only. You'll have to deal. Lots of places in the city are. The majo","useful":0,"cool":0},"woSAEg1yLoQf6jJRS8C-AQ":{"text":"This place is the most interesting hot dog joint I know of (alligator, crawfish, etc.) but","useful":0,"cool":0},"f_zXgefkt8jg5Jyu53cUmA":{"text":"I actually found out about this restaurant while searching Yelp. I'm so glad I found it an","useful":0,"cool":0},"rMNAJruSw4Kwo_e2Ng8Cfw":{"text":"Love this place, but I am an encased meat  connoisseur ;). I love me some sausage!    Craw","useful":0,"cool":1},"2vnslyozfCGzsu9Ns6yEZQ":{"text":"I'm upgrading my previous review, because the service issues seem to have been sorted out ","useful":1,"cool":1},"0U8ds2v3tXo-7JM5OLtATw":{"text":"I prefer to call this place Fat Dog. I mean, this is not a place for calorie-counters and ","useful":1,"cool":1},"oauIjWvsXow7IokycrsteQ":{"text":"This place is really as awesome as everyone says.  Our creations were excellent, as were t","useful":0,"cool":0},"wmOlwQs1RGG6PIBi3_3FeQ":{"text":"Atmosphere was great, the dogs were nothing to \"jump of the balcony over\".\nStaff was not v","useful":0,"cool":0},"my_Je9WCol8V8ArfiZQX7w":{"text":"\"It really is as good as it gets!\" Says my roommate who is also a vegetarian. While they d","useful":3,"cool":2},"TNRyqEbl3QxAe3MFCpb8IA":{"text":"Ok, I know, it's a hot dog stand- processed meat in a tube. So who does she, the vegetaria","useful":2,"cool":2},"pw7mW1Ajy4XF6yKB6bIgzw":{"text":"Yeaaaaaaah! hot diggity dog I like this place. I like how its super casual and mostly outs","useful":2,"cool":2},"AXTpCBNbyS_BQhyyCo4hig":{"text":"The food at Dat Dog is pretty good, it is a bit expensive but the portions are extremely l","useful":2,"cool":1},"4UvowlCW08rDFoNGCTZytg":{"text":"Dat Dog was the first stop on my whirlwind trip to Louisiana and a great start to the week","useful":0,"cool":0},"brEvEyXv5toJDwieSJlfOw":{"text":"4/5 loadeddd\n\nboom. that was my belly going boom. these dogs should come with warning labe","useful":4,"cool":2},"gaZQ7XDEs2L_jrbQdGX0Jg":{"text":"Please join the 21st century Dat Dog and accept plastic!  I want to come done with you but","useful":3,"cool":0},"hGp4kFX0CO7q9U3zLnUf_A":{"text":"I'm from Chicago - hot dogs are very important to my lifestyle (lol). Dat Dog is amazing. ","useful":0,"cool":0},"9HERmPbLXUw875vOhocB9Q":{"text":"This place offers a wide variety of weiners, bratwursts and sausages from all over the wor","useful":0,"cool":0},"CvOii9yXnp1AZc3HlYgCkg":{"text":"I really want to give the food from this Dat Dog location 5 stars. Unfortunately the custo","useful":0,"cool":0},"vuVKz2gN1kOJYUiOvrcvCg":{"text":"Great atmosphere, just wished they stayed open later. But who can blame them. They have be","useful":1,"cool":0},"t5tomUxt7XEbM180GkTvNQ":{"text":"I can't say enough about this place. Eating here is one of the top things I look forward t","useful":3,"cool":1},"sQQ0jVjsk9omecp63wCtgg":{"text":"I've heard many co workers talk about eating at Dat Dog and how much they love it. I was c","useful":0,"cool":0},"rLZg-Q2fwawJUAzDGe-0Rw":{"text":"Finally, a decent hot dog.  \n\nDespite the foodie culture and super size lifestyle that def","useful":0,"cool":1},"waTmG9m4X3mZPIaw_dztMw":{"text":"Great dogs an white trash fries! Love the alligator and the buns ... So so soft m toasty !","useful":0,"cool":0},"mcaydGcPNAg9C98EE9KucQ":{"text":"Love the hotdogs here, but the flies are kind of a problem. Been three times now and while","useful":2,"cool":0},"VosRxmkqqes_LHOnqxHeyw":{"text":"The hot sausage is to die for. A little bit of cheese and relish and you are good to go.  ","useful":1,"cool":0},"OE87TSaopVlRjk6s2Bx6qg":{"text":"We enjoyed how whimsy this place was as far as the creation of your \"dog\" goes! It was new","useful":1,"cool":1},"7SjF4aEJXVoyr8ODWiMgAA":{"text":"had white trash fries (which is too much for one person) and the Guinness dog.  It was unb","useful":0,"cool":0},"zuXvU-Q-oq6DWrojtY5K6Q":{"text":"This was out of this world. I maybe have a hot dog once a year but this place would make m","useful":0,"cool":0},"-MP78xjV_XGYuZDQbqNqXQ":{"text":"Crazy variety of hot dogs with great fries. Happy Hour specials and bacon infused vodka to","useful":0,"cool":0},"wi0DJvRlorMl5X-E3mG0kw":{"text":"Dat Dog is a small place with a big idea: pick one thing and be really really good at it. ","useful":2,"cool":1},"M9f8UVJlTWZ2bchkpmh22g":{"text":"Omg my husband and I decided to have lunch at this location. He had never experience havin","useful":1,"cool":0},"jkvCIEnN4o0SvuZh1ge8_g":{"text":"Fun little atmosphere\nThe new location is much bigger and accomodating\nLots of different t","useful":1,"cool":0},"_INIPoFmS_zfSEdY6hm1SQ":{"text":"Lucky dog is better than this place.\n\nSo I finally decide to jump on the band wagon and tr","useful":2,"cool":1},"yxwx9s5BQoveLdAlKxRAUQ":{"text":"Dat Dog is my favorite guilty pleasure. I make excuses to drive uptown and eat there. Then","useful":0,"cool":0},"DfhYZhjkDwRlHUFHrHzYJA":{"text":"Too good to be true! I see people talking about the weiners but someone has to mention the","useful":0,"cool":1},"lir2AKcdAEaoHFS3_KS--A":{"text":"The food was pretty good, but WAY overpriced. We got two sausage dogs, no sides or drinks,","useful":1,"cool":0},"AYMmepZ6V5qXfF0zxXQ6tg":{"text":"Went here today and I loved the atmosphere. The food was delicious. I'm happy I gave this ","useful":0,"cool":0},"Y0grZ3xJTEV_6iQJSqwgiQ":{"text":"I was craving oysters,,,but I also wanted to go to a dog friendly place n check out uptown","useful":0,"cool":0},"m1n4d_xcF4sWbx2Rv5ekVQ":{"text":"They have a really nice and fast service and the food is just great! Aligator sausage is t","useful":1,"cool":0},"77d7nYtcYwDEW7JLIrBmZA":{"text":"Interesting restaurant on busy stretch of Magazine Street focusing almost solely on hot do","useful":0,"cool":0},"Wmgpx8JNK1xkfeVxRo7W4A":{"text":"I am so sad about my hot dog. I loved Dat Dog when I celebrated my birthday there with fri","useful":1,"cool":0},"A0H-Z5yRZ55TpKL3oVwflA":{"text":"Enjoyed it better the second time. It was Easter Sunday and Gabe and I decided to ride aro","useful":3,"cool":1},"wyUr87qKdEITT5WzupF-AA":{"text":"Love the variety of dogs from all around the world you can enjoy.  But i will say, if you'","useful":1,"cool":1},"nswBLVhSTeJuEC9DoPPVsw":{"text":"Fantastic little hotdog restaurant on Freret.  Everything is good, especially the crawfish","useful":1,"cool":1},"fJH3ZE7zDd5vVPSZqytyyA":{"text":"This place is exactly what I've been looking for in a hot dog place.  Their selection of t","useful":2,"cool":1},"VIzzvGCp-spwVcwgsxN0CA":{"text":"Every now and again, I get dragged into something that doesn't always seem likely. A trip ","useful":11,"cool":9},"tXUo3InDrwvfi5qCGtifEg":{"text":"Dat dog is a staple, that's a huge accomplishment for them! We, as locals eat it, and when","useful":2,"cool":1},"S64LuhrzPS_3JqySW1VMPw":{"text":"Fabulous dogs. Service very unique . Love the ambience. Definitely one of a kind place. Th","useful":1,"cool":0},"EgFFqAgLkYl7P4S__BZbcg":{"text":"Seriously, I cannot say enough good things about this place.\n\nHEAVEN ON EARTH.\n\nFries. Del","useful":1,"cool":0},"bI35Tv26Vag6RnQwrVLb3Q":{"text":"Not impressed. My boyfriend got the sea dog. The toppings he got were a recommendation by ","useful":3,"cool":1},"vBbJ69jTAeiAHXbivzjlMA":{"text":"With wieners representing every corner of the globe, well, except for Asia, but my opening","useful":1,"cool":0},"-K-FjDP1DIlyePXm_QrpHg":{"text":"Time for an update. Dat Dog was an amazing place to get a killer dog or sausage. I easily ","useful":6,"cool":4},"scpTHcWVoKQTHcx3BqvzdQ":{"text":"Perfect spot for the lover of gourmet hotdogs. I ordered the sea dog which was pretty good","useful":0,"cool":0},"hAi5SEQ9zWdSO1ZS_3Pztw":{"text":"Yum! Mexican Coke available!\nI love this place!! Can't get enough, ecstatic that I can wal","useful":1,"cool":2},"OmJQRmZENtn60_JazpeuGw":{"text":"I am not a big fan of hot dogs but I decided to give it a try. The bartender was cool as h","useful":1,"cool":1},"9aGVxp-vWAilqJ4KpmFE_g":{"text":"Delicious dogs from the wieners/sausages, to the bun and the many toppings. I am definitiv","useful":0,"cool":0},"i9bux2U9lA8Slw8hb4MZPA":{"text":"Mother of God. This place is a pearl in a bed of oysters. I cannot recommend it enough. Wh","useful":1,"cool":0},"lYCABmCyaOgBxGtnWu0Dhg":{"text":"I really like Dat Dog. The hot dogs are of a supurb quality with great toppings, weiners a","useful":1,"cool":0},"njo-fLG07sF66mLtd6KNBw":{"text":"Pal invited me to the haute dog place in New Orleans, \"Dat Dog\", and it was over the top d","useful":1,"cool":1},"1Fu1ZR3AcXs1AoMIwhQKLA":{"text":"CASH ONLY! Amazing dogs, the bread/bun is unreal, and you can put a tun of thongs on it. T","useful":0,"cool":0},"zMrQrBpt_pZanIAvM8FAZg":{"text":"Here for trivia. Fun atmosphere with great food and dog friendly. Dogs Are fresh and delic","useful":2,"cool":1},"ncogLikOyacrsZCfBoWtHA":{"text":"A great specialty dog plate.  dog but we had a bratwurst, smoked, and crawfish dog.  We al","useful":0,"cool":0},"Z3a5pFr_cO97zwbd80T8PA":{"text":"Just ate here today and was really disappointed. Went around 3 so place wasn't packed at a","useful":0,"cool":0},"5GKJgWszzxjvwki88sGwyQ":{"text":"What worthless idiot of a manager made the policy that you cannot order drinks from the ba","useful":1,"cool":0},"nZ2KqNYbam1itz304yE1Iw":{"text":"I'm torn.\n\nI love the big, sweet buns.\nI like the vibe of the place - inside & outside.\nI ","useful":11,"cool":3},"jRfeglLbrUQ9VGTKs4LipA":{"text":"I love this place! It's reasonably priced and delicious. My personally favorites are the s","useful":2,"cool":1},"ZRRfbP7XyhNAbT7oI9GhxA":{"text":"Dat Dog is amazingly good and I really appreciate what they do a lot more the second time ","useful":0,"cool":0},"ewMZFwDHKE99KcSUbkrGEg":{"text":"They got their changing table!! When I moved to Hawaii in July it wasn't there but upon vi","useful":0,"cool":1},"nQgQJ_Stt8y9ZwgLc5YwOA":{"text":"I think this is one fun place to dine. The Hot Dog buns are heaven sent and every experien","useful":1,"cool":0},"ZKwcubZy-GYl1X-8SCSjrA":{"text":"I was excited about the concept of gourmet dogs on Freret St. My first visit I ordered the","useful":2,"cool":1},"Yoy4KsuOdSl00LG19N4bRA":{"text":"This place is cute and colorful on the outside. It's small on the inside. Good thing there","useful":1,"cool":0},"MKPxTvRtG4wMOnD1BZD7rg":{"text":"Oh Dat Dog. How I love you. Your delicious sausages and perfect buns have me plotting to f","useful":4,"cool":4},"ScsR0dY21vD9VAZOwxkPCw":{"text":"I stopped in on a whim and was reasonably happy...i got a dat burger, cheese fries and a d","useful":0,"cool":0},"0wynyG6ABauCuSh43fh7Ow":{"text":"Amazing addition to our trip to NOLA. I really appreciated  the fast service, the late nig","useful":0,"cool":0},"7ex9nTkinx-hga2Ieuy9og":{"text":"I have been to a lot of hot dog joints in my life, and I've seen them and this by far tops","useful":3,"cool":1},"HlrGy5MSwj6jw1QCYtsvVA":{"text":"A friend took us here on one trip through NOLA and it was, as Bender says, fun on a bun! Y","useful":1,"cool":1},"6IE3_-R9BUNm_nOPYgCZwQ":{"text":"Awesome house beers and delicious dogs.  I had the aligatordog with chef's choice topping ","useful":0,"cool":0},"NT-AYdB1Kbwz_Pb03zF7yA":{"text":"Went to Dat Dog last night for the first time. Most of my sausage/dog eating happens at ba","useful":2,"cool":1},"B2ajImtY-89SOSKARj_MFg":{"text":"BEST. HOTDOG. EVER.\n\nSeriously, see my profile. This would be my last meal on Earth, hands","useful":0,"cool":0},"DlhMI6HQrwSF2Uw6AdqJhg":{"text":"It was pretty average specialty hot dogs. It may be because I am not the biggest fan of ho","useful":1,"cool":0},"o5HhXTsgn0qcMJMPxaFvzA":{"text":"What a fun spot for a bite! \n\nI like the occasional dog, and Dat Dog is my go-to. There ar","useful":4,"cool":1},"ZFZs7LjpvU-CCa8sOZxRBg":{"text":"At pretty much any time of day, you'll find yourself joining the end of a pretty formidabl","useful":0,"cool":0},"SQdMF1zev98T_FFEO6U_OQ":{"text":"Stopped and ate some dogs with the family.  The hot dogs are good and they have an excelle","useful":0,"cool":0},"MmoValYyUbNCfIEUk5-vcA":{"text":"I can't review them for the actual food that they are famous for, their what my friend cal","useful":1,"cool":0},"G7CzyZjSp_nyTDcRNH6TcA":{"text":"Best hot dogs EVER! Delicious dogs and sausages with tons of topping options. There's real","useful":0,"cool":0},"9L8v_-Jr1S3OzBce18H-gA":{"text":"So in love with the ambiance, the beers, and of course the dogs.\n\nSuch a sweet set up with","useful":0,"cool":0},"a5nm2HfKSIwOlQKpVC6Zmg":{"text":"We go here every time we have friends in town. Just a good, cheap, and fun place to get a ","useful":1,"cool":1},"AdthfvcgMxB9m4b9MJGQ0g":{"text":"Went with a group of people and we all loved it. White trash fries were delicious. Bacon c","useful":1,"cool":0},"mJ-_F0GrcmNCKeLfEYj8Nw":{"text":"Our 1st time at Dat Dog and it was delicious. I git crawfish etoufee dog, my hubs got chil","useful":0,"cool":0},"PBJxX2jO93DWtK5voCy71w":{"text":"Between the crawfish dog or the crawfish poutine I could'nt decide which was better. Great","useful":0,"cool":0},"ktSkPI8-CnBAvequLOJL6g":{"text":"Everything is good.... especially the white trash fries. I always get the sea dog.... but ","useful":0,"cool":0},"3q4XZk7r5wz_xrXUL6uSHA":{"text":"They already have a ton of reviews, I can't add much other than\n\nduck sausage was my favor","useful":3,"cool":1},"OlUqd8-quKAMJR8_0UPzHw":{"text":"BLUF:  Dat Dog is great but it is all about the bun and toppings.  Great atmosphere and hi","useful":0,"cool":0},"29yRbRG6Fte_fKYxb5zZpw":{"text":"The first time that I went to Dat Dog I had a \"traditional german wiener\" aka your standar","useful":5,"cool":5},"q2SRyWrDzS4y2QyaJfLenA":{"text":"I love the hot dogs and sausages here, but the reasons I keep coming back are the loaded f","useful":1,"cool":0},"nuScR_bDblxxfJJJOJio3Q":{"text":"We ran into this place on accident.  The food is good and the buns that the sausage and do","useful":0,"cool":0},"V_vlytBsVhqQEAl-F78wag":{"text":"Goat thought this place was fun and had very nice and gentle people working here and nice ","useful":4,"cool":4},"i9CJ5t8Y9tT4rQsOEiTjiw":{"text":"Dat Dog is so yummy and such a casual spot! Great outdoor seating for the nice weather. Th","useful":1,"cool":1},"a14dJgIAGcMNj0zeDjMKLA":{"text":"A friend from Chicago told me about ths place.  I am a big fan of Hot Doug's in Chicago.  ","useful":0,"cool":0},"w9gxecAg4WIoP8J_9Me38g":{"text":"I'm not a \"hot-dog\" lover.  Having said that, I LOVE Dat Dog!  I have been several times. ","useful":1,"cool":1},"VsS5mGB41oaxsSsFPThy-g":{"text":"So I am an avid Dat Dog fan! Y'all were on my \"must eat\" list for my out of town wedding g","useful":0,"cool":0},"enak_KdlSF0yAeBlDV3LdQ":{"text":"They get four stars for being creative. They suck cause they only take cash.\nBut I had the","useful":1,"cool":1},"8uMmx3BenSxBv6vkhmy0qQ":{"text":"The food was great as always, but this experience was unfortunately not that great due to ","useful":0,"cool":0},"ncI5S2thKCgpI7tkjUXoOg":{"text":"Randomly stumbled upon this place late last night. Tried three of their hot dogs and all o","useful":0,"cool":0},"y_nPWOnCmVnveTn-b8deqQ":{"text":"This place is unique to New Orleans and I recommend everyone go check this place out. \n\nIf","useful":2,"cool":0},"-zWB95XzvsvfchuDvf4x-Q":{"text":"Favorite place in the city...maybe! It's a must when I'm here for fun...the options are en","useful":0,"cool":0},"tkNZ1k-kasAuEjHCWI7rpw":{"text":"Live/lived in NOLA my entire life and we know food. . . this is good, comfort food.  Never","useful":0,"cool":0},"GsRspJSYl3sjFHVhcVMwVQ":{"text":"CONS - CASH ONLY. I detest places that refuse to take credit cards yet have an in house AT","useful":0,"cool":0},"Q_FsRyjIuF09aTNoifibdA":{"text":"The hot dogs are pretty great.  I like the traditional dog topped with chili of course, bu","useful":2,"cool":3},"wmAeUO3M-dyPFz2lOKDR5Q":{"text":"I am a fan of the Chicago Dog and the vacancy cheddar ranch fries.\n\nPretty quick food and ","useful":0,"cool":0},"97c20qkvS7j4EnAGaF27Ag":{"text":"Newfound appreciation for Dat Dog these days as increasing numbers of friends are either v","useful":2,"cool":1},"htLL7jCC-KsQwsEjgUJuCw":{"text":"Atmosphere is great. Very kid and dog friendly. Crayfish dog was excellent, flavor is grea","useful":0,"cool":0},"Qgrp5XuvuchAQ9juEHBecA":{"text":"As a proud self declared hot dog expert (I've sampled dogs and sausages from almost every ","useful":0,"cool":0},"2Q_2uSJcviWfkInjRza4PA":{"text":"I really enjoyed the Crawfish Étouffée Dog and seasoned fries. It was flavorful. I can't w","useful":1,"cool":0},"zRZXlSZnhp6HtaN3WPPR0A":{"text":"love these dogs! my husband and i have eaten here a number of times and never been disappo","useful":1,"cool":0},"49IvDrvEtVXpjp6EUfhhGg":{"text":"Came for lunch after a tour of Tulane University. The walk is hot in the summer but not to","useful":0,"cool":0},"HWW5fL6NyOZA-NR3sdoefA":{"text":"I've been a fan of Dat Dog since its original location. GOURMET hotdogs. Can't beat em. If","useful":0,"cool":0},"nyU6BROEdW_-Sa7WYA9gNw":{"text":"Over time, I've just realized that I'm annoyed that they raised their prices by a dollar a","useful":6,"cool":3},"OhWEdSiCYBu5c1UMjbl-BA":{"text":"Knocking it down for a few reasons. First star, I don't know if I didn't notice the prices","useful":6,"cool":0},"Dg8UIpQrH7-72it7h7fXCw":{"text":"I don't understand the reviews complaining about the high price.  I ordered a smoked bratw","useful":0,"cool":0},"_wCjPL8i-Ckh1kMwaYSFWA":{"text":"The food here is really good and so are the prices . The service is god awful. Ordering of","useful":1,"cool":0},"--ryWzddLe6AseuVpM8J2g":{"text":"My favorite hotdog in Nola, chef special is awesome, and you can get beer, and you can sit","useful":0,"cool":0},"2hj3Jq2XwOmY16P_p3qc5Q":{"text":"This has become a New Orleans Classic! \nI have been coming to Dat Dog for many years now a","useful":1,"cool":1},"rGEgPrQsjtIghyOU2N7nUQ":{"text":"I am so happy I finally tried this place. I've been eyeing it up since it opened due to th","useful":1,"cool":0},"NPRZXAFTll3xC65bQREa8g":{"text":"After hearing all the rave about this place, I finally gave it a shot.  The people here ar","useful":5,"cool":4},"xIy5ZgnftUDPlzDPt3En6Q":{"text":"It is a complete food experience and not just hotdogs. You must experience it to believe m","useful":1,"cool":1},"Yu32Pp-GIZkJEEUoneFWUg":{"text":"I think I'll be the stick in the mud here.\n\nDat Dog is a pretty cool idea in a pretty cool","useful":7,"cool":1},"gpWBxVPPuvhz9hoy3jbJ9w":{"text":"I have been to both locations.  I must be coming on off days because I enjoy it for a fun ","useful":1,"cool":0},"t1c8kM1MLTJJtSyO6G7yqA":{"text":"Good hotdogs with endless toppings. The atmosphere is nice just be aware that there will b","useful":1,"cool":0},"CK25etgP7yRo5382Z04ooA":{"text":"Got the bacon werewolf and it was great! Loved the creole mustard addition. My wife ordere","useful":0,"cool":0},"Biccok5aLZZY-_u5SWgjtw":{"text":"The hype is REAL! Yes it is a hot dog but it is by far the best hot dog I have ever had. I","useful":1,"cool":1},"2V5fJVpyJriwDTeUOtXHPQ":{"text":"I really like this place when I have a craven for a dog. The bratwurst dog is killer.","useful":0,"cool":0},"gCyLfd392akpmhXSGb5udg":{"text":"This place is great the dogs are good and very creative. I only gave it 4 stars due to the","useful":0,"cool":0},"z1tRy1iaC2l7V5kbfExcNQ":{"text":"I live barely a block away...so it's damn tempting.  Skip the dogs and go with a sausage..","useful":1,"cool":1},"PzdTZkA6aCVhxOI-70JhxQ":{"text":"Priced right and with a great ambience, Dat Dog is one of the best on Freret. Despite its ","useful":0,"cool":0},"wdKcgGvFqkYHT-XYZPi4hA":{"text":"Not one single thing i didn't like on the menu.  there are even selections if you don't li","useful":1,"cool":0},"MUlP4FQiTMApITBgwMGZ6g":{"text":"Too much hype for the place. The hot dogs were fine and creative, but I wasn't totally con","useful":1,"cool":0},"FmcUSmb8F20kkwoGV83aWw":{"text":"HORRIBLE CUSTOMER SERVICE-was not greeted by anyone and very rude staff. Wasn't even offer","useful":0,"cool":0},"Cm58xnr5Ts5-Avy4_2US_g":{"text":"The talk of going to Dat Dog has been ongoing for a while. After several people raving abo","useful":2,"cool":1},"E_Yc_YkrCyka7ZSUGJr0IA":{"text":"Dat Dog was the second restaurant I tried in New Orleans and I cannot count the number of ","useful":0,"cool":0},"IH9EDrUWEdF-ahasRZO_8A":{"text":"got the traditional pork hot dog and plain fries.  As others have noted, the fries are a v","useful":1,"cool":0},"9MxTLP7iMFIdxpk-ISqYMA":{"text":"Go hungry! I mean real hungry! \nI got the hot sausage hotdog with several delicious toppin","useful":0,"cool":0},"FhzOfPiZwx7VMdSD5OjIBA":{"text":"Absolutely love this place! Whether you're hungry for a real meal or a bite between meals,","useful":0,"cool":0},"HdaipqGus0-rsE6AkI6ktA":{"text":"I was in heaven the entire time!! There are so many sausage/hotdog & topping options that ","useful":0,"cool":0},"G6KBW5UmRfQzFOq6MKw38g":{"text":"Yummy food with frozen drinks and cold beers to boot! We each had a gourmet hot dog and wa","useful":0,"cool":0},"DDj37IV_WyTI3cfMk8UF5g":{"text":"I have NEVER expected to crave a hot dog in my life. I haven't eaten meat in 32 years, so ","useful":4,"cool":4},"99F89kO1gF4VSxwuO21M9g":{"text":"Don't get between Dat Girl and Dat Dog. Because Dat Dog is just too dang good.\n\nMy favorit","useful":1,"cool":0},"jyCIRYTm8Nbvvh9fLfZj0w":{"text":"Let me start by saying I hope I get a chance to change this review in the future.  I'm rea","useful":0,"cool":0},"wRi8uJXrEVfuTl5bP5JFwA":{"text":"It's nice that they have a veggie option, but beware!  It's not really a veggie dog.  It's","useful":0,"cool":1},"E2QA6ZVpthqM8SdTsAumCQ":{"text":"Do you love hot dogs? Sausages? Then Dat Dog is for you.\n\nDat Dog is the latest business t","useful":16,"cool":7},"f7SovaagQB7Aln5091e4gg":{"text":"Now that they're at the new location, it's totally worth it. a lot of outdoor seating, the","useful":1,"cool":1},"ccuZw9RPDGvHIkw5LMYhbQ":{"text":"Dat Dog is delicious, but avoid the Freret location on busy nights because the joint is ma","useful":0,"cool":0},"y86fKqS7q8o8XM0xoolOcQ":{"text":"I took my family here after a day at the Zoo. We got two rougarou dogs, an etoufee dog, tw","useful":0,"cool":0},"6nUmdU68boDPyThQxPCpoQ":{"text":"Get the gator dog. \nAnd the bacon vodka. \n\nNo regrets.\n\nEnough said.","useful":0,"cool":1},"Yb7qPuKAmmfQQzdPW_tLmw":{"text":"Dat dog is the original gourmet hot dog stand in New Orleans, although I've now seen a doz","useful":2,"cool":0},"u9PEtAo6UVrW63hkkGZVMg":{"text":"When i heard that the best hot dogs in New Orleans where on freret street on a tiny joint,","useful":1,"cool":2},"5xgj7_DXSMb2tcvwqmCyWA":{"text":"This is some of the best drunk food or just and afternoon snack food in the area! The gato","useful":0,"cool":0},"MGte9qw70LtKWKJBQk4myQ":{"text":"Had the Bloody Mary, gator sausage dog, buffalo chicken dog, bacon ranch tater tots, & cra","useful":0,"cool":1},"xcPAxuhd2oKHp8r-LqY5gQ":{"text":"There aren't that many hot dog restaurants in general so when I heard about this place, I ","useful":2,"cool":0},"0C_KKpaR6NtqBDYVorjrxA":{"text":"Ran inside on a rainy day with no idea of what to expect. Everyone was friendly, food was ","useful":0,"cool":0},"HIntQMZBi9JbqWDDQMqpYA":{"text":"Fun, yummy restaurant to try out! Dat dog is a great restaurant to go with a group, especi","useful":1,"cool":1},"nEsxjhCSLuRPIXgAxfqajg":{"text":"Never in my wildest dreams did I think it would take me this long to get back to Dat Dog f","useful":9,"cool":6},"YKnU-9ny070n_jy9eBz2zA":{"text":"I'm so thrilled to live down the block.\n\nI'll most likely have to buy new, bigger pants.\n\n","useful":8,"cool":3},"tR5yk5DO-FiaviTRyV_eqw":{"text":"Dat Dog makes me happy in so many ways. Here's a few, in no particular order:\n\n1. I get co","useful":2,"cool":2},"t1KhglQAolSMUc9UwVzipA":{"text":"This is one of my all time favorite New Orleans spots. It's always a go-to for us when we ","useful":3,"cool":2},"dF9IeiHrWNTB9eNEAuY5FQ":{"text":"This was our 6th food stop. I was soooooo full, but how can you say no to a gator dog?!? T","useful":1,"cool":1},"0eVRQP0VRR-DdTnB7WJY5g":{"text":"My favorite place to eat in New Orleans. Seriously. Yeah, seriously.\n\nThey have canine acc","useful":3,"cool":3},"ogWqCYnrmrlCypMna4M5kA":{"text":"manyia did amazing and helped me order the aligator dog!!:) the food is great as always an","useful":0,"cool":0},"J45xOTgl8Z3qEFuUYsh0oA":{"text":"Let's just say you can't go wrong with anything you choose from their menu. This place nev","useful":0,"cool":0},"9K_L_FWkpVI43iJfndn2kA":{"text":"I'm officially jumping off the Dat Dog bandwagon. I admittedly jumped on as soon as I hear","useful":7,"cool":5},"Qj76Tb4Syd1ff3oMCqExAQ":{"text":"Get the alligator sausage or the crawfish sausage. The buns are fresh and slightly sweet. ","useful":1,"cool":2},"u1A4rNUlL6EPD4TvWsNFng":{"text":"Sophie and Matthew were SO helpful!! Delicious food & great service!! Also, trivia night o","useful":0,"cool":0},"WnNikq0zoyuThX3qXWisjw":{"text":"Over priced for a hot dog lunch, but the food isn't bad ... Great fries and a variety to c","useful":2,"cool":0},"E3kcEptZXyJ9wNyOXT59yg":{"text":"Absolutely the worst service ever. Literally the biggest jerk cooking that I have ever see","useful":2,"cool":0},"TI-sqSOstAoDZ6qHaVSzCA":{"text":"I like hot dogs and my favorite place to get a dog in the city is Dat Dog.  I like the Fre","useful":2,"cool":0},"sGkE0ctNiGSWA4cDrf66iQ":{"text":"So, there are hotdogs and DATDOG! If you're in New Orleans you must try a graterGator hotd","useful":0,"cool":0},"RgXf1Atdz-_py_Nob6rOag":{"text":"Good stuff! The ranch fries were great and the crawfish dog was awesome! Plus they had a b","useful":2,"cool":1},"hJYe-fWjPSl_q3EbOHg3dA":{"text":"I have seen and been around Dat Dog but never tried their food - but recently i noticed th","useful":0,"cool":0},"lN8YmYmtEJ1DkHwccpMV2w":{"text":"Maybe I wasn't in the mood for a hot dog. I got the Chicago dog. It seemed like a normal h","useful":0,"cool":0},"nlUqEN4TBicMZJ1GWvvFog":{"text":"With \"turducken\" sausage, homemade ginger ale, hotdog shaped tables and a singing food pre","useful":1,"cool":1},"jRnK6rf3oKZrsMDhOW77rw":{"text":"A couple things up front to ensure you have a great Dat Dog experience:\n\nFirst of all, the","useful":1,"cool":2},"GRWyJHihLCW2aVkideIBFg":{"text":"So this was me and my girlfriends first time here. I ordered the Guinness Dog with a order","useful":0,"cool":0},"ZFKzx2dgpLMUUIH7QD6rtA":{"text":"Dang dog good! As we are thinking what are some out door friendly locations offering safe ","useful":6,"cool":6},"lYC1eePscn1vnQNCJQB3Dg":{"text":"Went last night and had the chipotle veggie dog with guacamole, jalapenos, and onions. Nor","useful":2,"cool":1},"CDmI2_MQfVLUDCa2G1cWqg":{"text":"I don't  like to write negative  feedback,  however\n   this is a must. The place is a dump","useful":2,"cool":0},"oJdoGqKuQvMkhf4B4eCIhg":{"text":"We held our welcome party at Dat Dog the night before our wedding and we loved our experie","useful":0,"cool":0},"j1kkESzwtfouGWU-a4f85A":{"text":"Best hot dogs ever for a good price. Smal unique place with different toppings and types o","useful":0,"cool":1},"DKg-23vSDxpOD8k55n-hxg":{"text":"Haven't had a weiner here yet but their sausages are pretty damn juicy!! Last time here ha","useful":9,"cool":3},"VDxVlduMSFNAmTuNfRwWew":{"text":"We came to dat dog on freret during freret street festival. We normally frequent the one o","useful":1,"cool":1},"XlehuZiAGf6aD2t38mt8eg":{"text":"The world's most amazing hot dogs but the outdoor seating area needs a thorough cleaning. ","useful":0,"cool":0},"DtsN1Bmd5_y7io3jjgoUWQ":{"text":"It was a busy Friday evening at Dat Dog and my friend and I were absolutely starving and e","useful":0,"cool":0},"LN3Eyq5bZB_bKsq6SUyuFg":{"text":"Holy Hot Dog Heaven!  This isn't your run of the mill Lucky Dog or some Oscar Meyer Weiner","useful":0,"cool":1},"pEVUDSx2QoAllJQmVZCwnA":{"text":"If you like hot dogs, you must try this place! This place takes the definition of hot dogs","useful":1,"cool":0},"WNcLBQ6UiUiHIsobzFyfrQ":{"text":"Alright y'all I know not many people may say this but the veggie Mexi Cali dog just hit th","useful":0,"cool":0},"bDZsn1rm5Sk10E1LdvuxCA":{"text":"I love this place! I want to take everyone here. I love the environment, workers, and most","useful":0,"cool":0},"ikj56w64HMY5qxGv6Bo8HQ":{"text":"It's mostly outdoor seating, with the inside seating completely open. The outdoor seating ","useful":0,"cool":0},"hmAihGpA4qVF7c97fECHkg":{"text":"Terrible food. I have been a patron since they opened up years ago in Feret and today was ","useful":0,"cool":0},"pTvGLyDiF5Ngb47Ytg-VrQ":{"text":"Never come for a game if you want to sit outside.  The TV flickers every two seconds and t","useful":0,"cool":0},"Alf3Cl6vM2xqk_VyQfyHkQ":{"text":"I attended a Yelp Event to welcome our new Community Manager. Dat Dog is always a blast. T","useful":1,"cool":1},"dTm5S1JTwuUWH7xZ1gcbjg":{"text":"Crawfish etouffee hot dog had like three measly crawfish scraps in there. Normal\nHot dog b","useful":0,"cool":0},"evN2GvEvLbd4NPjDSfou7w":{"text":"I've been to Dat Dog many times over the past few years and I can easily say that I'm neve","useful":2,"cool":1},"Zs--AkymH1aUO3hhpMg5vg":{"text":"Many people who cannot wrap their head around paying a little more for a hotdog are just m","useful":1,"cool":1},"buSrMfI1CBWoDZynnYq4Ug":{"text":"Dat Dog is a fun place to eat. This location has a huge outdoors area that in the right we","useful":3,"cool":1},"hRdN9PvK7KDVeyIcDV7fZQ":{"text":"The gluten free hotdog was a bit sad for 8 dollars. The hotdog was plain and there simply ","useful":0,"cool":0},"KxswEoqtaNCtP1Q7XryvTg":{"text":"Dirty. The floors strewn with food, straws, puddles of water and debris everywhere includi","useful":0,"cool":0},"PNk1MuNS4y4qM_bC2IJzaw":{"text":"6/2/15: BUT I HAVEN'T BEEN BACK!\nThere are way too many cheaper alternatives in the area n","useful":2,"cool":1},"qXx_Zi1nsfnJIBTDHGpaKg":{"text":"Those who frequent the Freret Street corridor have probably noticed the tiny yet brightly ","useful":9,"cool":8},"Y6K5lxhOZ__PFjWE9PgvTA":{"text":"Lived in Chicago for 4 years.  LOVED Hot Doug's!  But let me tell you, friends...and this ","useful":1,"cool":1},"nEsKmXFNH3zIemyfX54Wqw":{"text":"This was my favorite place I ate at when I came down to LA, I had a Alligator sausage and ","useful":0,"cool":0},"njLcjCM6iBsmPzBICNlBLw":{"text":"Dude you will never know how fucking great that was. Absolutely the best things I've ever ","useful":0,"cool":0},"s_MUpqdI4LPUj_JMHkHkjw":{"text":"Best vegetarian hot dog I've ever had. They might be vegan (might clarify on the menu) but","useful":0,"cool":0},"-GuC83N5vSCPXE5BZeSrdg":{"text":"This place was on our list of places to try so we hit them up after a short day trip outsi","useful":0,"cool":0},"dt8RIvaHT9_k6LeyxDOLoQ":{"text":"I think I went when it was way too busy.  Love the Idea because I'm a German Brat kinda gu","useful":8,"cool":5},"JvgzYFictHIjbx30vkAv7Q":{"text":"Perfect for what it is! If you want a hot dog of any kind, this place is for you. They hav","useful":0,"cool":0},"ihGjAc4rIVQrOeYhBzVWNg":{"text":"Went yesterday and order the Rougarou, wtf fries, a non alocoholic beverage and a beer. Sp","useful":0,"cool":0},"4KXgXXxE4iHGlRfVe02NEQ":{"text":"I can't find a reason not to love Dat Dogs! The selection of their dogs are so creative an","useful":1,"cool":1},"NlJasgD6CKjsNmVpX-D-GA":{"text":"At long last, I've found the hot dog of my dreams...\n\nNo, I haven't gone over to the dark ","useful":19,"cool":16},"CMqHxkyLOy0RF9qLkel1nw":{"text":"Our second venture out since Covid restrictions were lifted. Taking the pups to get a dog.","useful":10,"cool":8},"ei59DVeXBA1Xbt1_e8639w":{"text":"The art work (by Simon) is as cool as the food is good.\n\nDat Dog has become main anchor in","useful":2,"cool":0},"RynlcKeGHjPjcqqXboXN9A":{"text":"These guys have outstanding sausages and a great beer list - ask Lexi about her beer favor","useful":0,"cool":0},"3fz3pElgOmzt7yXszLM6vQ":{"text":"Put A Smile On Your Face!  Dat's da motto of Dat Dog...and it is very accurate.  \n\nI visit","useful":0,"cool":0},"Qu_JZn-HecPL14UXd1WN8A":{"text":"I really don't think there's a better meal out there than dat dog. Firmly believe that. I ","useful":0,"cool":0},"E-QDt4Hbc0tSwqcThXTPrw":{"text":"Very kid and dog friendly. Delicious hot dogs. There's a small wait during peak times, but","useful":0,"cool":0},"_51d2NZaY2Iti2sq0mMgjw":{"text":"i never leave reviews and im just a college student so i never complain about stuff thats ","useful":1,"cool":0},"XAzn5MDv-rzrXJK7uMC32Q":{"text":"Oh, how I love Dat Dog! Hot dogs of every national origin and variety (even veg), deliciou","useful":0,"cool":0},"Czsq7K2f4LCo7I56ABeDXg":{"text":"I live in Massachusetts but when I come to New Orleans, I always stop at Dat Dog - usually","useful":0,"cool":0},"WeQ6dcQrZAQZ6ijHv6FY4A":{"text":"Nice spot with great food, great staff, and outdoor seating. Definitely would recommend.","useful":0,"cool":0},"UPki7szl4DcIMjr-xTDjfQ":{"text":"Another hotspot in New Orleans that I have made a return on is Dat Dog, a sausage joint wi","useful":7,"cool":6},"4aDZLnqj3mg8zW52cTSjLw":{"text":"The food was delicious and the place is cute. I went on a rainy day, and although everythi","useful":1,"cool":0},"vp-SHdISA5KuqdJFxAcksA":{"text":"45 min wait for two hotdogs with less than 50% capacity with a side of bad attitudes and s","useful":0,"cool":0},"dhaouDbu1nUYgj9ltnu-BA":{"text":"I accidentally found this place during Lent and have been waiting patiently to go back. Wo","useful":3,"cool":0},"poNE4nTLYIcLkCi1oKRO5g":{"text":"So good! We ate this multiple times throughout our trip to New Orleans. Everyone enjoyed t","useful":0,"cool":0},"cC02OesvbsvsD49Chjuixw":{"text":"Had the son of a saint with bacon on it. Nuff said. Juicy, salty, meaty, slightly sweet go","useful":1,"cool":1},"dv9FENVgB3OUwnaPTr0aKw":{"text":"What a treat - I love duck and the duck sausage was amazing !! I wish they sold them drone","useful":0,"cool":0},"o05tLnHHIPgeNfeezrPDUA":{"text":"Just space-wise and looks-wise, I really like this location. It's more spacious (giant cou","useful":2,"cool":0},"Q6HsiUylLz1AiUOcU7Z5yw":{"text":"This spot is so overrated and very underwhelming! For the price, I was definitely expectin","useful":0,"cool":0},"QDaldNZHJOFG2IwjeU8-zQ":{"text":"I am not a fan.  \n\nI know that's not a popular opinion of the Hot Dog empire that Dat Dog ","useful":3,"cool":2},"y9P3OfUytPYs0Xf-2rh9Vg":{"text":"Love the bread. Love the variety you have so many creative ways to eat a hotdog and it's o","useful":0,"cool":0},"cWCW5TVQg_Gf1ncb7ZgSLg":{"text":"Ohhhg how wonderful this Apple-sauce-sage is with the blackberry sauce and grilled onions.","useful":0,"cool":0},"E4HyIzSETZlgjK33-5_WJA":{"text":"Not gonna lie, this review is hard to write cuz I was a liiiiiiiittle on the drunk side wh","useful":2,"cool":3},"mJ-gpmzSJXDh_wn7-Xs1yg":{"text":"OMG. One of the best stops on the trip. This is a tiny little shack filled with nothing bu","useful":3,"cool":2},"MmEQxTnI-v0NTjAwox-oRA":{"text":"Fantastic dogs!\nHuge menu which can be overwhelming. However, I like having numerous choic","useful":2,"cool":0},"dctUjHQxV2XZM6Zakd-YTw":{"text":"As a vegetarian, I am forever thankful for dat dog's veggie options. They usually have 3 d","useful":1,"cool":0},"CyqbqybpqO-Lpem0rCWstg":{"text":"Hot dog came out cold and a little burned and chile cold. But the worst part was the chees","useful":0,"cool":0},"xEIkCbzR0PhyXrOR-Z-a8g":{"text":"Great food, a bit out of the main road but easily can find. I would give 5 stars but price","useful":1,"cool":0},"GwxmxhQ8OI314LB8bW5enA":{"text":"Cash only business with a ATm on site......Not worth the $7.50 per dog. Seems like they re","useful":1,"cool":0},"i3C_H9tmdGtSgCOUOgn2cA":{"text":"It's a restaurant that just does everything well. Great sausages on really good buns with ","useful":1,"cool":0},"0QoH4p38AWd7WkqnFfPSJA":{"text":"With over 10 different styles of dogs and sausages and over 15 different toppings to choos","useful":1,"cool":0},"RFMpiKSl_Oil_ax1m5Rf-Q":{"text":"Heart Attack Heaven.  I have had many different Dogs and have yet to be disappointed.  Bes","useful":0,"cool":0},"Vs4R_4Z9bS1--ihAVpVenw":{"text":"My husband and I have been going to this location regularly for years. Not today though. D","useful":0,"cool":0},"DKtc6BSkaPOFotGDeIeKMw":{"text":"Hey - here's a simple decision maker - want a real hot dog (or sausage sandwich) in New Or","useful":1,"cool":1},"OQ-0xDTM2JW_yyh5GQYF6g":{"text":"Tasty dogs with all kinds of crazy, exotic meats! I had the duck dog, and since I had no i","useful":2,"cool":1},"cDH6V2vDgNjlPceY1rLJJA":{"text":"I work and live around the corner from this place, so it's tempting to go on a daily basis","useful":1,"cool":0},"Y-cDUJEZuee_oR5Pgaonkg":{"text":"Mind blowing dogs! What more can I say... eclectic and relaxed atmosphere. Great place to ","useful":0,"cool":0},"OV8MJp9fNjUySSXfo3sEag":{"text":"Forgot our order, was there for 2 hours, had to beg for them to bring it to us and did not","useful":0,"cool":0},"kI1SMNJc7prt1e-2bdNqEQ":{"text":"The vibes are amazing. No line to order. An absolutely huge array of both the type of hot ","useful":7,"cool":4},"7mW9y3iI7FIT2vjL1SF6ng":{"text":"Dat Dog is a perfect place for the indecisive. First, when deciding where to eat with frie","useful":5,"cool":1},"A28dSHEJ3UXOImBGMMwm0w":{"text":"The food was pretty chill. I enjoyed it, but their portion size sucked a bit. I got like 7","useful":1,"cool":0},"z7ZI-3LgLnmnQohYSm7Wrw":{"text":"A no frills eatery that specializes in serving hot dogs and sausages. \n\nBetween the differ","useful":1,"cool":1},"EFylpf7EBrA9nwmer7o1JQ":{"text":"Dat Dog is one of the first establishments I ate at when I arrived in New Orleans, and I'v","useful":3,"cool":1},"STX_OCord5iosCc2OzSiPA":{"text":"Hungry?  Get one of these amazing glorified hot dogs and crunchy, notatall soggy, old-scho","useful":1,"cool":1},"3GcknXiLZG88wOyqLH-f-Q":{"text":"who really wants to plunk down $6 for a gourmet hot dog? I do. \n\nyes, i can buy all the in","useful":3,"cool":0},"bkdK8Rc8Xscv-wR-gSjRjg":{"text":"Oh my goodness. So good that we had to get it twice on our trip.\n\nDat Dog was introduced t","useful":6,"cool":1},"Ze2Xig6W4JTIiip-a7taUw":{"text":"One of the best hot dogs I've had! Hot dogs are huge, full of flavor and ingredients.","useful":0,"cool":0},"8Eyh_TO85ijL9ur_PdeMVA":{"text":"This is the second time in a row we have had the worst customer service at this establishm","useful":1,"cool":0},"gcik2MzJ48JOzNhavQTCeQ":{"text":"Waited 50+ minutes only to find out that they lost our order maybe giving it away to other","useful":2,"cool":0},"5Zbv374H27-N-JLeCtQWZQ":{"text":"I'm tempted to give this place 5 stars after a single hot dog, but I think I should wait u","useful":24,"cool":20},"nwr1JlyfbY5G1LSIRyeGew":{"text":"Don't dine in! Took 30 mins to get 1 hot dog. There were tons of people working and one pe","useful":0,"cool":0},"XvYcuE0cRDjW_cr3XeEKLA":{"text":"Funky, fun, friendly and bohemian. I'm glad they had a few vegan dog choices. Though my ch","useful":2,"cool":1},"5-ssaKtkIJcJN6abfILRxA":{"text":"Been visiting Dat Dog almost once a week this month. It just really hits the spot when you","useful":1,"cool":0},"cIxXZFdLczyYj3_tlpqWrg":{"text":"This is such a fun eatery! With the theme of funky hot dogs it's definitely a stop for eve","useful":1,"cool":1},"VDoHfdgbiGOH02UcMLMHWw":{"text":"Dat Dog has come a long way since it's humble beginnings at a tiny spot on Freret street. ","useful":1,"cool":0},"Qevjr14OBd69jSOK9gT4nQ":{"text":"So I don't know how I've been to Dat Dog so many times and have not yet reviewed it. Then ","useful":4,"cool":1},"OC9RsiIYsOeQzUR5vUW8xA":{"text":"When you need a spot for a family meal, take them to Dat Dog and put a smile on everyone's","useful":1,"cool":1},"NfYAea9Qk_-E23l2O86DGQ":{"text":"I've never been a huge hotdog or sausage fan, but after trying Dat Dog's amazing concoctio","useful":0,"cool":1},"eh84ZLkB-0wWDlt33xXHUw":{"text":"Oh how I wish Houston had a decent hot dog shop. When in the mood James Coney will work bu","useful":1,"cool":2},"uJFI7mAXU6ee1jw33n8BIg":{"text":"The vegan banger is my favorite hot dog! It's deliciously flavorful so much so I never get","useful":0,"cool":1},"CmQdcYFnwHDjATGKABzUJQ":{"text":"Dat Freakkin' Dog. \n\nI love you.\n\nYou'll forever have a place in my heart and I can't get ","useful":18,"cool":17},"U-4CI8tiOonCKIrEQU1ptg":{"text":"The food was good but we literally waited for an hour while people behind us received thei","useful":0,"cool":0}}