{"pSsL1zZvyOHxYrn70QXXjQ":{"text":"I love the culture and history surrounding this place. The food looked awesome but the tas","useful":1,"cool":1},"-MkkHtH9rU4ON6Z45zxdXg":{"text":"If I could take Melba's with me to Norfolk I would.\nThis was the first place (besides Fat ","useful":0,"cool":0},"JhSgzLQwarmr-KtQkIx1_A":{"text":"The food is always fresh and seasoned well. I come here atleast once a week for a large gu","useful":0,"cool":0},"qZRdeFdmzWAzWdOx7NxF0w":{"text":"I recently returned to Melba's and again I wasn't disappointed. Here is where I met the Am","useful":0,"cool":0},"__kzXmt0sU5TyBVk5JQL2A":{"text":"Truly a waste of your time. New Orleans is filled with great restaurants, but this place i","useful":0,"cool":0},"xpyTiecczFQS3KeTvBeMhA":{"text":"We ordered online hoping to save time and showed up and the order still wasn't ready...we ","useful":0,"cool":0},"8yEyGVzTPlFkD94Q2E5akA":{"text":"I wanted to like it but have to put in the \"large price for small portion\" slot. Its proba","useful":1,"cool":0},"yiEEW2cV0yxW2NQudcGe0Q":{"text":"Red beans, grits, and daquiris are all really good! Chicken wings when they're fresh are g","useful":0,"cool":0},"5sMlX6jtAlikpvdhhX4hIA":{"text":"Great shrimp PoBoy- they use Leidenheimer's bread. Nice & chewy. Great fries, and I apprec","useful":2,"cool":1},"CeE1RjCAAc4mwB_TEqGN5w":{"text":"3 stars DUE TO HORRIBLE CUSTOMER SERVICE!!! \n\nCame in to Melba's late Friday night, drivin","useful":0,"cool":0},"fUAhCgAm7I4veydik8M6RA":{"text":"Stopped in to eat after a long night. It's not very spacious on the inside, but the line m","useful":0,"cool":0},"GsqNjj1LkldzFfwVUX3SoA":{"text":"Oh yea!  Everything I had was on point. One of my friends got the fried chicken wings...de","useful":0,"cool":0},"exmG9BsU-Jn32_fGUYHung":{"text":"The mac & cheese, gumbo, red beans and rice were good. The place was small but had a reall","useful":0,"cool":0},"kLRJSaxJ2DgYbUuzjkBtgg":{"text":"PO boys are always good here. Great late night spot..I'm in love with their red beans and ","useful":0,"cool":0},"mvClb6L76PMWqPyFF3eyxw":{"text":"Loved Melba's! Away from all the fancy recommendations comes a gem recommended by our uber","useful":0,"cool":0},"uiQb8cLo09Iq-ahxE4s4HA":{"text":"Good food. Busy weekend was a little -moderate wait for Cafeteria serve. Not a lot of room","useful":0,"cool":0},"m_9_QhLYt9lHsZzig87wKw":{"text":"I just ordered a shrimp poboy and it was uugghhh NOT GOOD, the shrimp taste like it was ju","useful":0,"cool":0},"U8C1RmxCslTugJejax26sA":{"text":"This place is as close to heaven as you will get! \nEverything everything everything is ama","useful":0,"cool":0},"CDmy_EoU34XL1phnPbUizw":{"text":"Food is great omg great food the bake chicken and Mac and cheese is out. The staff is awes","useful":0,"cool":0},"V6I8EBHwo8tyI1z86_5CCw":{"text":"Hide yo kids, hide yo wives, but do not hide yo wallets because the food and service rocks","useful":0,"cool":0},"jdxIwlwblQeqQ7WZCAERJw":{"text":"We went to Melba's last night/early morning at 12:00 am or so. We were craving some good s","useful":0,"cool":0},"AMouY0TZ1tQ-T7qRun9fHQ":{"text":"Horrible Food!! I ate the food there and the prices are extremely high their white rice is","useful":0,"cool":0},"swh5GX57u5NweUiqVxW57g":{"text":"I don't want to remain anonymous. My name is Angel Alexander and I tried to buy a homeless","useful":1,"cool":0},"k8Ur5JKM5BA6hxoN3Kg1Tw":{"text":"Sometimes you have one of those mornings after a night of too much fun, and your makeup is","useful":13,"cool":9},"d5v2vVgh4m8K4x4mOlhTbw":{"text":"My first late night food run in New Orleans. The line was long and they do have a vast men","useful":1,"cool":0},"yyGd6hhAXJUbPPifKKvh2Q":{"text":"Horrible customer service i live in the city and every time i eat here the wait is long an","useful":0,"cool":0},"leLkMS9TPgT0hLysz2zCkg":{"text":"In-house daiquiri was cheap, convenient, and delicious. My overstuffed shrimp po boy on th","useful":0,"cool":0},"ByKpnCJLNF8wamItvPi25Q":{"text":"I was such a glutton at this place....from the 9th ward gumbo..to the ribs..the red beans ","useful":1,"cool":1},"IOrHJZp9Na_FieKalWqfhQ":{"text":"Roast beef is the BEST!\nTakes a while to get your order but worth it.\nClean and love the l","useful":0,"cool":0},"etR9rL98xoDhsAwPJPDNVA":{"text":"One of my favorite late night places in the city! Staff is always super friendly and the f","useful":0,"cool":0},"eiWxGjL_a79ZudUGopqjUw":{"text":"I love the Panty Dropper mixed with XTC daiquiri! $5 large on Thurs & Sun.. Tried the hamb","useful":0,"cool":0},"lruC4y1-t233yeadB2L_WA":{"text":"This is THE BEST Shrimp Po Boy Ive had; outside of Parkway Bakery, which really loads on t","useful":0,"cool":0},"_UKNUVnpK0z961F022RP6g":{"text":"What can I say ... buffet-style food with all the old favorites for late night eats or jus","useful":0,"cool":0},"i-zYnUM_eYGJ37MXxiczJA":{"text":"This place was recommended by our lyft driver..doesn't  look like much from the outside bu","useful":0,"cool":0},"wxKJOFScFAXRmsBdtXui4w":{"text":"Wings, red beans, every poboy you make..love the voodoo philly..mac and cheese the cakes..","useful":0,"cool":0},"f-OGfuZ5Gm7Z4Lj3vnEAaA":{"text":"i joined yelp for the sole purpose of writing this review. i love melba's but think i may ","useful":0,"cool":0},"IZVTn1P23gWYmvWWOmee8A":{"text":"So much better than Gene's and Ilys..omg I love this place..don't waste your money there..","useful":0,"cool":0},"ECMJ37zMs88Y0pNKdhImTg":{"text":"The food is okay. I've been given cold food, and they are no longer honoring the free frie","useful":0,"cool":0},"D7VROrp-lGSdvMs3FR7BEw":{"text":"Haven't ate yet but I've been waiting 30 minutes so far watching many people go by - even ","useful":0,"cool":0},"_S_ahYXmAlRN4431jV_wmw":{"text":"We came here because we asked our Uber driver where a good local spot was that we should t","useful":1,"cool":0},"Q3AtOUIut4gXhd_2oLGirg":{"text":"The cheese grits alone makes me give this place 5 stars. It is 24 hrs with good soul food ","useful":7,"cool":5},"JN_4fw2dOUAyE4hAYuRvSw":{"text":"Great food unique to New Orleans. Relaxed atmosphere, plenty of room, and amazing food. Pl","useful":0,"cool":0},"NFIWrqg6jgpEFv_1gSQWhw":{"text":"Great place! After visiting other places that offered the same menu for higher prices, I f","useful":0,"cool":1},"IT19IfF3vI-AA4lm9Fiqnw":{"text":"Good late night, however, need to make make sure the server and wait people are on your or","useful":0,"cool":0},"TqXrojtRnYQW4v68lWI8fQ":{"text":"Great po-boys. Cooked right there and the guarantee of at least 30 shrimp per po-boy. The ","useful":1,"cool":0},"qme196XA5lYvO0tYY_PZ5w":{"text":"I know this is a beloved institution in the seventh ward, however their breakfast is disgu","useful":0,"cool":0},"WwyrxTqzlk2_DJg79jeYxA":{"text":"I've been coming to MELBA'S for the past 2 years or so. A few employees even know me by na","useful":0,"cool":0},"m4Cvt0XsvL7I2513foJmoA":{"text":"Yummy. We had roast beef poboy dressed and smoked sausage poboy. Very satisfied. Couldnt e","useful":0,"cool":0},"YpZpivILUwfUnUBwPp4UWw":{"text":"Food was sooooo good!! I had the shrimp poboy!! And gumbo and stuffed pepper!!\nI was visit","useful":0,"cool":0},"k6862ZMg2olodwHAZgmoMQ":{"text":"Good food, but takes them like an hour to make a sandwich (poboy). Worst attitude ever fro","useful":1,"cool":0},"qg_wzQrOUlJTSvViVL6V-Q":{"text":"The best Red Beans and Rice in all of New Orleans...even better that it's also a Washateri","useful":0,"cool":0},"rn8tZ6ZMZhb34k7UVQm7XQ":{"text":"So goood! The shrimp pivot was so simple but AWESOME! Came for crawfish...they don't serve","useful":0,"cool":0},"P3muU78N75CiaSu-qUT5ww":{"text":"I've eaten here once before and it wasn't very good. That being said, I wanted some cheap ","useful":1,"cool":1},"Q69IperoCZ_1SjJytmgNEA":{"text":"Great place!! Me and my wife were visiting New Orleans for our anniversary, and this place","useful":0,"cool":0},"cI-U8-deuRm4kZtWbK-Zsg":{"text":"I've driven passed this gem thousands of times and just recently stopped in and man, was I","useful":1,"cool":0},"mB_dET9j6sZBB7L4wT404A":{"text":"We love Melba's!  Perfect for late night, on our way home from working in the quarter.  Th","useful":1,"cool":0},"Q7y-Bh5Miu_nnb9osUhp9A":{"text":"Very affordable compared to the French district. Always a special on frozen drinks and $1 ","useful":0,"cool":0},"NJwLjAbDvkg5sX9qBwCXyg":{"text":"We brought my Youth group there to have lunch from North Pole Alaska. One of the best thin","useful":0,"cool":0},"-arkWK8gTWomO7qcsLJXew":{"text":"This establishment does not provide tap water despite the fact that they serve alcohol (th","useful":0,"cool":0},"kRN_YR4YKimUTy9Qq_OM1A":{"text":"I fell in love with Melba's - but I'd only been there during lunch. The night crew treat w","useful":1,"cool":1},"QsP-EjSdeZz58Wfo-esz9A":{"text":"Melba's is another one of those NOLA institutions not to be missed. Where else can you get","useful":1,"cool":1},"Q9F5XpwirIuk6NXSacROrA":{"text":"I just had to write about the experience I had on 3/19/2016. I came into the restaurant pr","useful":4,"cool":0},"cs86cHWtFRJs7DaOZMvHqg":{"text":"1st time trying crawfish from Melba's and I'll say this, \"NEVER NO MO'!\" Besides them thro","useful":1,"cool":0},"V6nP8WAXHRRmYfZEjBTEKw":{"text":"This review is for the service. So if they open 24/7 like you advertise then why does ever","useful":0,"cool":0},"BaMY3mv0q4j0LE6QmVPJUA":{"text":"Melba's is great place to do laundry and get work done at the same time. Wifi internet acc","useful":0,"cool":0},"Nm4CeE5gn6-_X47bXt8OAg":{"text":"this is a great place first off cause its open 24 hours.   then there is the fact that the","useful":4,"cool":2},"v797P19UWlXimIUsuZfDzA":{"text":"Out-of-town friends are always asking where the locals go to eat Louisiana food.  Finally ","useful":0,"cool":0},"STfMCQ1Af2ILBv7hgp-ipw":{"text":"I have no problems at all with this place!! The line being long is about the only thing I ","useful":0,"cool":0},"xfk2gI0zREv2EjdRQyPUXw":{"text":"Melba's has serves just about anything Cajun or creole you could want, plus daiquiris. The","useful":1,"cool":0},"yxCc4TtEkqtiPGJFFe2M6A":{"text":"Cafeteria style. Good food at reasonable prices.  Casual dining.  Favorite with locals.   ","useful":0,"cool":0},"hFHEF6bJRkSYPv4ZkarWeg":{"text":"Another 24 hour joint, gotta love these! A group of four of us strolled in here late, arou","useful":0,"cool":0},"VfW-uIyO8vfLpyLBc0v-LA":{"text":"The only reason why they get more than one star is because they are open late. And there a","useful":0,"cool":0},"Amp3_2FwF9fY9oWLjPbwVQ":{"text":"So good! We were originally going to another place, but our uber driver suggested Melba's ","useful":0,"cool":0},"OPUGuoQOtHQ9l5RQcmRtSw":{"text":"I was recommended Melbas because of my crazy work schedule and them being open 24 hours. P","useful":0,"cool":0},"a0Iyvm7ciuWP7L7fmDANWg":{"text":"The good:  really big menu. I mean huge. They have just about any soul food you can think ","useful":0,"cool":0},"aMJXndtI5oTzsjZsiI7DIg":{"text":"I'm changing  my review after a recent experience where I was treated horribly by a staff ","useful":2,"cool":0},"FCbobwbyEgMU6OoKzFIXfg":{"text":"Ok, I made it back, this time I wasn't in search of ice cream, I was on a mission to EAT!!","useful":13,"cool":7},"cQuOeiwTQuykhddCn_oMzA":{"text":"Love this place.  Good food and drinks along with hospitality.  We got here at like 8/9 in","useful":0,"cool":0},"Oz4-DBUuwxFHXJpWGULsYg":{"text":"Really impressive shrimp Po Boy. Philly isn't what I would consider a Philly. Very salty b","useful":0,"cool":0},"1UZgq3_IsDFg9FxfO4s-8A":{"text":"This is probably the worst place I've ever been into as far as management they treat you l","useful":0,"cool":0},"TSHx_eRx-pAv6xs2-fw1Zg":{"text":"The atmosphere was great, the portions are really big and the food is delicious. I love ho","useful":1,"cool":0},"VGVJqfz1NxSA_44cr7AUIQ":{"text":"So Melba is 100% 9th ward good eatin'!!! Its half restaurant half cafeteria style. When yo","useful":0,"cool":0},"WePWyGpcEc0E0eU0l6C4Mw":{"text":"This place was spot-on for us in so many ways.  Me friends got the pork chop plate and the","useful":1,"cool":0},"ABjB9KR8QULqAUipQxWlNw":{"text":"My friend and I visited here for the first time yesterday. I must say that the food was ve","useful":1,"cool":0},"e5s7_2IWS1mo-b7QwIwm2g":{"text":"Cheap, conveniently located and fullfilling. What else do you need from a po-boy place?","useful":2,"cool":0},"dnK_3PY1kHREMlvnOIuSew":{"text":"Hubby , Son , and I enjoying our food . Lynn and the whole Staff was extremely kind . Very","useful":0,"cool":0},"XDBW28ZoeCfvryZ_oCjMbQ":{"text":"I love Melba's! \nGreat food, best laundry place!","useful":0,"cool":0},"IE19rg9h2D-MpuDHAHgEYw":{"text":"Went to Melba's after Zulu and it was by far the most clutch meal of Mardi Gras. Had a 1/2","useful":0,"cool":0},"9Jjul-baolfRXK8znWfDTw":{"text":"Best spot in New Orleans hands down if you want some good for a price that won't hurt your","useful":0,"cool":0},"WZQPOv8WRai02NuysmuU6Q":{"text":"After ditching Gene's due to crowd came here and ran into an even sizeable crowd. I am so ","useful":0,"cool":0},"x0wsur2tIKs3FgknJex3LQ":{"text":"Delicious soul food, laundry, daiquiri's, slots, free wifi.. pretty much everything you wo","useful":0,"cool":0},"bUESGQgbuOf1vPeJl68WUA":{"text":"LOVE the chicken tenders and the corn grits and the mac & cheese.  BUT - the crawfish were","useful":0,"cool":0},"MJENJJKzATuR7uM-JyONtQ":{"text":"Melba's is a cool little chill spot we found around the corner of our Airbnb. They have a ","useful":0,"cool":0},"VUR-ey2pi9aGM3TiiaMsnA":{"text":"Great spot! I got the fish plate and was very satisfied. The fish was hot and perfectly fr","useful":0,"cool":0},"uTS42VeXgLB00Dei4W5_RQ":{"text":"Overated. Doesn't do traditional New Orleans staples justice. Too many smells as well! Soa","useful":0,"cool":0},"UMWF14opKcwzjqZv75ag9w":{"text":"A wide range of food choices. The fried wings were excellent as were the corn grits. Every","useful":0,"cool":0},"bJL9tB7ikV7ixdKQCNN0vw":{"text":"I find this place very impressive. I heard the owner on a podcast (midnight menu +1) some ","useful":4,"cool":2},"RPPOF_GT5zPjUQHwZlqpNw":{"text":"This my first time Melba's we ordered chicken wings with French fries & corn grits also Sh","useful":0,"cool":0},"Qh8WuIETbtHpyB-pEQH3FQ":{"text":"This place has a lot going on; laundrymat, art gallery, liquor store and restaurant 24/7. ","useful":0,"cool":0},"6MQeYlgedtAIOxfto0YW-w":{"text":"We had the sausage poboys that were the daily special the day we went. They weren't too ba","useful":0,"cool":0},"jh46HBcGgI8ZhmKRN3lxoA":{"text":"Came here because we heard this was the best spot in NOL to get a pooh boy. My cousin also","useful":0,"cool":0},"c7qL7B9zTjFj9RUi8Pxpeg":{"text":"This place was awesome! great prices on crawfish and very friendly customer service! Very ","useful":0,"cool":0},"1oW0_ZBARpW8CIQzj6luJA":{"text":"The daiquiris, prices and customer service, alone, are enough to write home about! I love ","useful":4,"cool":1},"d3zym01ym6FireEw1I__gQ":{"text":"Always great food at a super price .................. Any time of day you can get in and o","useful":0,"cool":0},"9Jtb5sOj66gmz9KWqBJAfQ":{"text":"Sure, there was a bit of a wait...this place always seems to be packed! We soon found out ","useful":0,"cool":0},"QHCkgEu4V47gmAx0cuBDNA":{"text":"It's impossible to drive by without stopping in.\nMy cousins always bring me here every tim","useful":0,"cool":0},"niOV5dTy0U-Av51hKXLmKg":{"text":"This was my first time at this resturant visiting from out of town. The food was fine howe","useful":0,"cool":0},"8s42tcICwnKV7izuNzPcLA":{"text":"We were told by my gf's family to try this place so of course we did. It was pretty good, ","useful":0,"cool":0},"GpT2DOAeLfRPSvJe32NN6A":{"text":"Mediocre food. Bad service. Somewhat overrated. I've been here a few times but no longer g","useful":1,"cool":0},"oms6ULK_bSDa6thoZw807A":{"text":"Lots of food..tasty homecooking.  Plates full like grandma would set in front of you and e","useful":0,"cool":0},"wmrOSX3vqKpl7wlIqlXv_g":{"text":"The Daquiris are    . Specials on them everyday and so worth the price. Add an extra shot ","useful":0,"cool":0},"3hQYdKnDSys9VL9yE2hgOQ":{"text":"Melba's is the best food we had in NOLA.  We had a large group of 16 and they handled us w","useful":0,"cool":0},"9krZibPc-eXvaXQL1Bt0tQ":{"text":"Scott the owner reach out and offered an apology, from where we come from that means quite","useful":1,"cool":0},"YATT8zpyuu3rGDMKYvFzrg":{"text":"August 6, 2016 was my first time going to Melba's! I have been meaning to go there, but I ","useful":0,"cool":0},"87_-t2infscpXXvmH15HMw":{"text":"Baby Melbas breakfast in the morning hits the spot. I love  that they are open 24/7, i can","useful":1,"cool":1},"iqDKrFTDVpP8dmk-Ovay1A":{"text":"I had a bad experience in Melba's. One of the owners by the name of Keith and his want to ","useful":0,"cool":0},"HEQAHAhauwtolvGjZgGtkA":{"text":"Wow \nStayed within walking distance\nHands down best of best fried chicken wings and crayfi","useful":0,"cool":0},"WE6fNT_W3aZ9hPxE0o-bPg":{"text":"From a local stand point, hot sausage on French dressed was everything it should be & even","useful":1,"cool":0},"qLKA4xRIknb6oJ128Gglug":{"text":"Waited almost an hour for a fried shrimp poboy, some gumbo, and a soda. Kind of crazy. \nIt","useful":1,"cool":0},"OfQVXTbO_bBPNmcRsOYOZA":{"text":"I have been going here for about a year and I've never had a bad meal. I love grabbing foo","useful":0,"cool":0},"BcN9w8lreBsXVYrPHRa_sA":{"text":"Great food and Po-boys served in a very unique setting. The daiquiris are also great, way ","useful":0,"cool":0},"ePdYpoO4zLnsBhvgEl64gg":{"text":"I had the baked chicken,  meat fell of the bone. And the cabbage and baked macaroni was al","useful":0,"cool":0},"jP7ZEyVpxAsnTEcUrjDEDg":{"text":"I absolutely love that this place is 24 hours and you can get anything on the menu. This w","useful":0,"cool":0},"W1bvALeXAu9N2N-I5_ucaA":{"text":"I've eaten here a few times and the food is pretty good. The best thing about the place is","useful":0,"cool":0},"o3M9I_QRPtsvoEPNF-zQfQ":{"text":"Bring your patience and a healthy appetite.  You are going to need both.  The food is grea","useful":0,"cool":0},"lfzUlyim_bYwoMEEZiVG7g":{"text":"I love love the red beans and rice. The food was hot and well season. The only bad thing i","useful":0,"cool":0},"fKVFmtg507pOmZglbuPIYw":{"text":"I've been doing laundry here for over a year and will keep coming back for the sake of the","useful":1,"cool":0},"3fRL8f8wjsCxfxTROAUG0A":{"text":"Went there after having a few drinks bourbon street my first time in New Orleans driving f","useful":0,"cool":0},"NJGt-uUDVvrXYNoNSriTwg":{"text":"I placed an online order at 8am for a shrimp po girl (half of a po boy) to take on the bus","useful":0,"cool":0},"yVLJyCGzB7X4uc95Wev1PQ":{"text":"I love Melba's! I pass Melba's daily driving home. The employees are professional, funny, ","useful":2,"cool":1},"IsxARRh4qqn7akBA2O9dvQ":{"text":"Bought 2 lbs of crawfish and wasn't impressed.","useful":0,"cool":0},"iZEHcCQO9KaVDLUqvvOq4A":{"text":"Let me start off with saying that the service was great, the staff was friendly and person","useful":0,"cool":0},"v_DHLcDUCHQH6gPCzu7WWA":{"text":"We finally made it to Melba's.  Based on the reviews, we were expecting something differen","useful":0,"cool":0},"HUvZKLqQBcnFaVhuRevkeQ":{"text":"Damn, really good food. Like seriously delicious. Odd with the laundry attached but don't ","useful":0,"cool":0},"NC7J3y3HjUT2Gn3Ufe0u9A":{"text":"We don't have food like this in Seattle so when we decided to give Melba's a try we fell i","useful":0,"cool":1},"sc3AT0SMIM2UiXWdyUJhLA":{"text":"This place is in a laundry mat. They have a restaurant, bar and laundry mat in the same pl","useful":2,"cool":2},"QkhtomMN4qwqMCa8yz-bvA":{"text":"I had a shrimp PoBoy w/ order of fries. Also a fish & shrimp plate w/ Mac & Cheese. The wa","useful":0,"cool":0},"UxILxwA_KO6mmYqNoxXtHg":{"text":"The fresh smell of laundry greets you. Had a po boy full of perfectly fried catfish and sh","useful":1,"cool":0},"Nkln3LYkbYlI3XrWDiPP2w":{"text":"Haven't ate yet but I've been waiting 30 minutes so far watching many people go by - even ","useful":0,"cool":0},"EMmHLOC-ctnJblLveyGRhg":{"text":"This place was recommended by my Uber driver after a late night on Bourbon Street. He said","useful":0,"cool":0},"a4Xwrl8oCc0uLdmmRcx9og":{"text":"12/25/16: we visited late night.  The staff was friendly.  The food was tasty -- Jambalya ","useful":0,"cool":0},"yF-rnKbUdr9SWbQMcfUyKA":{"text":"This is a cute little find, so close to my Airbnb. The service was excellent, the people w","useful":0,"cool":0},"ZV0JY60F3_ecm8g7qCB5Ow":{"text":"Got the baked chicken, shrimp, mac n cheese and gumbo. LOVED it all. Wish they had more fo","useful":0,"cool":0},"ioQickjDAymcfG6IDLNVhw":{"text":"I cannot explain how life-changingly good the food is! The red beans and rice is my new cr","useful":0,"cool":0},"55d1XqnIdKk-EtQTKeVTsw":{"text":"Amazing food!! A seafood joint that actually has enough shrimp on one poboy to make two.","useful":0,"cool":0},"mOh69eUvVkRwY4x7B1N6iQ":{"text":"Falsely advertising free French fries when you check in on Yelp. They said the owner is no","useful":0,"cool":0},"rIb9WHM7N1ngN7veUZp0Aw":{"text":"Visited from the Midwest.  This place was packed. Order was not right, waited longer than ","useful":0,"cool":0},"nfiLbVX_J5LiCl7wOzz9kA":{"text":"Always a soul and R'n'B soundtrack playing on the sound system, Melba's is right next to W","useful":0,"cool":0},"V9K1-Ulf3L5WwohfCwzqVQ":{"text":"Our 1st time eating crawfish! One of the male employees showed us how to eat the juicy, sp","useful":0,"cool":0},"z2mith11SGKipcwlg_Q1ww":{"text":"Overall this place was pretty good considering the price point and convenience of being op","useful":0,"cool":0},"69yVdCPCagiOcu5Nqv-KIg":{"text":"This is another place you should never go to if you are in a hurry. They forget about your","useful":0,"cool":1},"14lh8g3EYGGPQ92dCj17cg":{"text":"The food was okay, but the presentation was horrible (could be neater). They forgot some t","useful":0,"cool":0},"LiWs6t-ka4Sj8c6zdyejKA":{"text":"Tonight was my first night in New Orleans, and Melba's was first on my list as I am stayin","useful":0,"cool":0},"511xtxvGrtGR54DI6Lnkgw":{"text":"This place was so cool. You could get breakfast, lunch or dinner 24/7! They also have drin","useful":0,"cool":0},"SZp_3pr8xqnxHBm6P-JO-g":{"text":"Everything was amazing. We left fat full and still had left overs. The place is small but ","useful":0,"cool":0},"pD_A5SyzLrgB3-bfVSb9Ng":{"text":"THE BEST POBOY in town. Great service, fun atmosphere and delicious!  Had the ham and chee","useful":0,"cool":0},"O_ccX8a3PLTNZIuulE0tgA":{"text":"Took 30 minutes for a sausage poboy, barley any crowd, my friend I was with waited close t","useful":0,"cool":0},"wLOW6eFkOAppIyLVJIKmyQ":{"text":"I mean it's Fast food for creole food. It's good while you doing laundry.... it's not a sp","useful":1,"cool":0},"y121ufgC-UlMycumR1RtZg":{"text":"Awesome, juicy, and tender crawfish cooked so well. You can really taste the soul in this ","useful":0,"cool":0},"QrWCIV__SP5KKfpqCNZSSw":{"text":"Great place to eat, employees were friendly. We wanted some crawfish late at night and the","useful":0,"cool":0},"vbVTi6aVAEBfH-A7Ww78hA":{"text":"This place is amazing! Do your laundry, drab a bite and have a nola daiquiri all in the sa","useful":1,"cool":0},"v0aPpdDUR4WqIk-n8rk6iQ":{"text":"Don't go here if you want to have a problem with your food or they're forgetting they have","useful":0,"cool":0},"D7FDtpGKYqA1PijP7UHrpg":{"text":"My daughter recommended this spot for the large plates of delicious food and the daiquiri ","useful":0,"cool":0},"Y8O5kYZ1-KYhrKBs5HmHCA":{"text":"Well now that I've been to Melba's I have a new laundry routine of ordering a po'boy and t","useful":2,"cool":3},"X95E2V06z2mTpAfBiLDh_Q":{"text":"Nothing else like this place! You can order a delicious meal, have a few drinks, wash your","useful":2,"cool":1},"VA1S05rgNo77mhhCw5cxhQ":{"text":"This place is such a gem on Elysian Fields.  Families, workers, singles, it is a very popu","useful":0,"cool":0},"c6KhNrosRUSq03sM2n2Ybg":{"text":"It's been my recent go-to for breakfast po'boys but today I made the terrible mistake of o","useful":0,"cool":0},"6FGX2k5reGB5siCJPinsEA":{"text":"We did a quick stop here on our road trip. The Mac n cheese is so tasty and they make it w","useful":0,"cool":0},"RenF1wTanh9VcMkoyp3k2Q":{"text":"The reason I'm helping is cause this place is so over $ to do ur wash. $2.39 a load. Crazy","useful":2,"cool":1},"7iUqtrQ0L2BoE2ADhAWRgw":{"text":"I have passed this place numerous times and have always been curious abt it. One day when ","useful":0,"cool":0},"WWEm-9dj5OUiWlKCsFgMXA":{"text":"Great food the wings are the best in the city . Po boys are amazing also . Great seafood a","useful":0,"cool":0},"yEj8lwTjEnGoPs1zlHq8Rw":{"text":"Loved this little Cajun hideaway!  A local favorite and great wide menu food and service.\n","useful":0,"cool":0},"7pVLJD6f2GIOl-vhP_DbJA":{"text":"First time in New Orleans and this was our first stop and the po'boys were delicious. We g","useful":0,"cool":0},"UJ46xjy6O6lk344NIvUJ2g":{"text":"Out of towner who was told by stewardess on airplane to go to Melba's, it was so good I to","useful":0,"cool":0},"2u2tnpmlfLq0m8Tv7HUjNA":{"text":"The wings, bread pudding, and green beans are consistently good. The grilled shrimp Po'gir","useful":0,"cool":0},"UUxRNuSj5uyyCB0INHzGWg":{"text":"Everything about this place was so good! The chicken! The red beans and rice were EVERYTHI","useful":0,"cool":0},"XMBiNFg9mI5km7aCCtIu5g":{"text":"I just wished they offered sliced lemons to customers. We ordered the po boys, gumbo, saus","useful":0,"cool":0},"rYkpxlxoe7K0voPkVRLmbQ":{"text":"ABDOLUTELY love this place...late night, broad daylight, don't matter...you say Melba's an","useful":1,"cool":1},"pmZWI6UnEpHLljZB95YPXg":{"text":"Corn grits and Mac n cheese are a must when doing laundry! Machines are always clean. Staf","useful":0,"cool":0},"sFchdsxY1Jp1Sh6pwj44dQ":{"text":"I went in to Melbas for the first time tonite around 3am. There wasnt that many people the","useful":0,"cool":0},"puEO3lbTF-orWBhBa6BwRw":{"text":"Shrimp poboy was good, Daiquiri was very tasty , I would get it again. The gumbo looked go","useful":0,"cool":1},"vKq_O3bgmMs7_7HnPLMZCQ":{"text":"Took forever to get. For-ev-er. (And I am a patient person).\n\nFood was okay. I've had bett","useful":0,"cool":0},"SuxzC368UX7vRZ-381yqcw":{"text":"Had the ribs...great!\nHad the philly voodoo. My bf loved it!\nIf back in New Orleans will d","useful":0,"cool":0},"eOd6XFSEC72dO7buNkT3Dg":{"text":"Get the grilled shrimp Po Boy with butter and grilled onions!!! The bread was fresher than","useful":0,"cool":0},"xKfV-jVuc4KWqRvnOXLNUg":{"text":"I eat here multiple times a week. The 9th ward gumbo is the best I've had in the city. My ","useful":1,"cool":0},"SdwwWGLUINUMiMQqhXFeeA":{"text":"I like Melba's.  I've only been to this newer remodeled location twice.  Once was for yogu","useful":0,"cool":0},"a9MzafcDN9Ac5JP7CYwj4A":{"text":"4 stars for the food, it's amazing. I really love the corn grits and as a mom, I have a so","useful":0,"cool":0},"_rEDtabXGzi2bUuzNsfUsw":{"text":"I am visiting from the west coast.  My best friend says you must try Melbas. I am in love ","useful":0,"cool":0},"rVoSD6IhWEDWNkd4hUgrHg":{"text":"First time in New Orleans, and got to experience my first po'boy here! Fish and shrimp po'","useful":0,"cool":0},"Pqtvvfpn3YxUFE-cXn_HvA":{"text":"The food at Melba's is good. I can not deny that BUT the wait if you're ordering late nigh","useful":0,"cool":0},"JK645MbWLOriGqBY0u3wHg":{"text":"$9 for a 44 oz daiquiri.  We had enough food leftover to last days.  Wings and crawfish we","useful":0,"cool":0},"7WiHqNCDWmwFFHpxIW3Kew":{"text":"Great food at all hours of the day. Where else can you get a rib plate at 2 am. Large menu","useful":0,"cool":0},"7tU3_S1iOFGDNg95KeqY-g":{"text":"If you dont mind 30+ minute wait times (after standing in long lines), and IF the cashier ","useful":0,"cool":0},"uEssMcmiFqAI__wtyX31Cg":{"text":"Slow service today after the Saints game. One person was working the ordering counter, oth","useful":0,"cool":0},"Mrks7F_Rpr_RPl0sguNR9w":{"text":"We really wanted to try a local creole or poboy given we drove from VA. Honestly am not su","useful":0,"cool":0},"neH6SESZtJqBnVEMCnWdiQ":{"text":"We stopped in at Melba's for lunch today and oh my God. Everything I thought I knew about ","useful":0,"cool":0},"tci324kJDgLwUUepnSOYMg":{"text":"Food was good. Minus the fight that almost broke out because our order got confused; but t","useful":0,"cool":0},"mPhmdGMtspokdtlMEpAfbA":{"text":"Hands down my favorite daiquiri spot in the city. I cannot tell you how much they know my ","useful":8,"cool":5},"RzYzL-o-FUhzy1AsrqtGmQ":{"text":"Food is good and very inexpensive.  And open 24/7, which works for me.  The poboys are too","useful":1,"cool":1},"p-6vLURjVSZrXCIG6zVywg":{"text":"Great place for some take-away Cajun/Creole food while you do your laundry. Food is good, ","useful":1,"cool":1},"1_DB0ChSPGE_hT_JTvRagQ":{"text":"Loved this place! It was nice and quick and I literally ran here right before I had to cat","useful":0,"cool":0},"-ei2kWv-uzivN-VfVmTLkw":{"text":"The staff is very personal the corn grits and the macaroni and cheese are off the chain I ","useful":0,"cool":0},"mvyNm32T2q4pn9YolHhhcg":{"text":"The shrimp po boy is my favorite. Staff is very friendly and food wait was not long. MUST ","useful":0,"cool":0},"pSg_IbKMgL55oyn0YBhQ5g":{"text":"The food is delicious the price is right the drinks  are on target and the ambience is rea","useful":0,"cool":0},"DEZv86FhofYzi8CjzWBfkw":{"text":"Melba's is in our neighborhood and we finally decided to stop in and have lunch (after see","useful":1,"cool":0},"kGWuGlojQyKKz0T5Ns3RYg":{"text":"The BEST Red Beans and Rice I've ever had (besides my own).  Judging by the crowd... every","useful":0,"cool":0},"iUKngEyGJoEovhFoFVsgZw":{"text":"Melba's is definitely a gem in the city!\n\nI come here at least once a week for breakfast, ","useful":1,"cool":0},"EHZkaaR9V0gxMs3apq3gJw":{"text":"I had a very limited amount of time and a must need for authentic gumbo and there was Melb","useful":0,"cool":0},"X-SJOcs82hbao1qllaJ6NA":{"text":"Melba's had my stomach dancing! Fried fish, shrimp, corn grits, baked fish, gumbo, oh my g","useful":0,"cool":0},"ZAwp7dAND14RcCqH2SQtrA":{"text":"This place was absolutely amazing! The food was to die for. I got teriyaki bourbon chicken","useful":0,"cool":0},"PUcnsvtYpJRiBphqsoZkbQ":{"text":"Loved Melba's!! We were staying at an Air BB right down the street. We had the shrimp po b","useful":0,"cool":0},"oDCkdBc9AbgjORjyA2Q1_g":{"text":"Got a baby back ribs meal with Mac and cheese and corn bread, plus a side of cabbage. Ever","useful":0,"cool":0},"7N83PbIwmwyX8AC6MIp-YA":{"text":"So, my girlfriend and I recently stumbled upon this place. I cannot begin to tell you how ","useful":0,"cool":0},"MvAuwhxqTpqaFP8SIcJcUQ":{"text":"We took our students to Melba's so they could try authentic Louisiana cuisine at an afford","useful":0,"cool":0},"lx2pVSp0c_f2Zviuf0NYYQ":{"text":"while i waited for a taxi at MSY i was given a pamphlet of suggested nola attractions. my ","useful":2,"cool":0},"agmnVH4FYD61mTu43-jx-g":{"text":"My sisters, mother and myself ate a bunch of bull before we finally decided to go into Mel","useful":0,"cool":0},"CM2ALDJ24zrjJDM3rrhf-Q":{"text":"While Sammy's might be my go to for Po' Boys, Melba's is just an experience that you have ","useful":6,"cool":5},"yNIvmOJ8gmgMF-mb17syZw":{"text":"This is one of the best finds in the city! They have a little bit of everything... From gu","useful":0,"cool":0},"4Gla3SEBdQBc_RCKwHK7RQ":{"text":"For tonight dinner, my boyfriend and I decided to try something new. We drove straight fro","useful":1,"cool":0},"AxxrZHCbi_8BIMmvjdgu4A":{"text":"Omg! We bought 24 wings, cabbage, jambalaya, Mac n cheese, and corn bread. The food was so","useful":0,"cool":0},"b89ycQce_A2U8EKBjHr44Q":{"text":"Well, that was my last visit to Melba's. I've eaten there at least once a week for a coupl","useful":8,"cool":1},"sk1iq4Tduzq3jX7NUyGI7g":{"text":"This is the wild-card food stop for pretty much any time of day (their late night hours ar","useful":0,"cool":0},"7sy6obYzemergGHa6mNtzQ":{"text":"Da fudge!!! Laundry and 247 too get outta town..... and liquor..... say WHAT!!!! Got the c","useful":0,"cool":0},"0yeXj4SUrqRh7k3liv72hA":{"text":"Pretty awesome food. Had the ribs and red beans with a panty dropperz daiquiri. It was so ","useful":0,"cool":0},"QeW9NXV71O38A3drLknqMQ":{"text":"Even at 5am the food was FRESH and HOT! Tried the gumbo and stuffed bell-pepper. Lots of m","useful":0,"cool":0},"SZET1WAHOmmwScCtieyTcA":{"text":"I live 5 blocks away and I've been here plenty of times, but I am tired of the attitude...","useful":2,"cool":0},"jAKEGpc9L_UOeuc3D-RPCA":{"text":"This place is deceiving from the outside. The staff are wonderful! We had the hot sausage ","useful":0,"cool":0},"KsC0rOQXQ2FF4X7lLX5bkg":{"text":"I have never been disappointed anytime i have stopped in here! Always a smiling person gre","useful":0,"cool":0},"ScSYCREXwTlELAdnvbiQbw":{"text":"The best shrimp and grits EVER. the sign said FREE FREE SHOTS but that's only if you buy a","useful":0,"cool":0},"po0OLA4AcsWDAJFIZ0e_oA":{"text":"The shrimp po boy is everything a po boy is supposed to be.  \n\n1. Big - if the French brea","useful":4,"cool":1},"Y8PVsxR1CrR2NkTukZMYWw":{"text":"Food was great drinks were great. Stopped here Wednesday before leaving New Orleans from o","useful":0,"cool":0},"YrrVeb8yMcuPdlcEqH0KVQ":{"text":"This place use to be wonderful! However the evening cook is terrible. Please replace the y","useful":0,"cool":1},"tUy9Ng1eG_YurqgJ9YwRUA":{"text":"I was pleasantly surprised by this place. It's not in the best neighborhood but it was one","useful":0,"cool":0},"x59CMWSg8TRmb6OpM-1PRA":{"text":"We ordered a poboy, jambalaya, and fries. After about half an hour of waiting the poboy ca","useful":1,"cool":0},"B8HwjcVrtSHP03Y_cCNCTQ":{"text":"Known for their Daiquiris Melba's is a 24 Hour Carry Out/Eat In attached to a laundromat. ","useful":1,"cool":0},"2HpogqnwPB1wfcasBrz_xA":{"text":"Best shrimp po boy ever! Crawfish looked awesome but didn't try. Southern hospitality on p","useful":0,"cool":0},"F-QcVV-6zZVBe5r0fgImfA":{"text":"Wish i could leav 0 stars. Worst experience ever. Went in this morning to check the place ","useful":0,"cool":0},"RkBuMKsnkxGpquBEX4Vspg":{"text":"Great food. Reasonable prices. Great drink specials. Stayed here for hours with friends to","useful":0,"cool":0},"XwW7mcYMMVdzVh3xvOLI9Q":{"text":"Ordered our food & waited about 40 min. Asked the lady where our food was & she didn't eve","useful":0,"cool":0},"rLvG63E6eFDQ_85Q-CVMMw":{"text":"We stopped off here for a shrimp po'boy on our way out of town, and, amazing. That's reall","useful":2,"cool":1},"b_jR4wX4yAhsP1O5lNXTTQ":{"text":"Some of the best food I've had in New Orleans. The staff is very friendly and the place is","useful":0,"cool":0},"Zsle-txzfvdzKrjK5lPZ7A":{"text":"A favorite place to grab a bite to eat when I'm out in the city.  There are so many things","useful":2,"cool":1},"-JqbSPmkU2WYU5WDDg7FsA":{"text":"Everyone should come to Melba's when in New Orleans. From jump the people are awesome and ","useful":0,"cool":0},"Tua1RuwVL_0YTCslx3RBuA":{"text":"Quick laundry, good food, awesome daiquiris- love the deals every day. Open 24 hours!!! De","useful":0,"cool":0},"43qiDoGdAy8O3Ea61poZIw":{"text":"My friends and I were looking for a good spot were we could pick up some crawfish and one ","useful":0,"cool":0},"KYzYjJDJYA_8577E129lKA":{"text":"This place is very well known and the constant flow of people proves it. There's lots of d","useful":1,"cool":1},"TtQOTP0ogkknlsDsP3tFhA":{"text":"Don't go after 7 I went at about 8pm and had the worst shrimp poboy ever I heard good thin","useful":0,"cool":0},"QzhxMkQOsFvz00ZuX1UAMg":{"text":"Great food.  Got a fish plate and Mac n cheese.  The fish was fried perfectly and the corn","useful":0,"cool":0},"0uGJMuGba8FuyBYBl376FA":{"text":"Yes my name is John I recently got ousted from Melba's however I do enjoy the coffee and v","useful":1,"cool":0},"Pwb3rpYWfzU953YfOVQFAA":{"text":"Probably the worst place in New Orleans to get food. I was just here and ordered a french ","useful":0,"cool":0},"tErRuQ12_CSvxE1tw8QyVA":{"text":"Wow... I had a memorable working lunch at this 9th Ward gem. Homestyle comfort food with t","useful":0,"cool":0},"h9MTz6-n_GvxSSlZRLQ0bg":{"text":"I really enjoy the macaroni and cheese (best I've had for ordering out and believe me I tr","useful":0,"cool":0},"rRjayPPba_h5fkgPxfCQiA":{"text":"Ok my husband and I absolutely love melbas. But we visited last night after the Boyou Clas","useful":1,"cool":0},"1582YXABJg0J5i6_rJiSRQ":{"text":"This absolutely has to be the worst! Ordered 3 shrimp PO boys at 4:50a and finally got the","useful":0,"cool":1},"UBrhqR3odz4qV6Xq0P_F-A":{"text":"Mushy, overcooked crawfish and really really small. I should have asked for a taste before","useful":0,"cool":0},"0JPVCW1l8gISoWNhc5lUEQ":{"text":"The jumbalaya is amazing. Like woah.... this whole place is phenomenal. Maybe I'm drunk an","useful":0,"cool":0},"t2_TUvg8O095wkHbsbhYqA":{"text":"Love this place, it's always our first stop when we arrive in the Big Easy! Homestyle sout","useful":0,"cool":0},"50YAY_-TTcNcaXWUJ5Ec_w":{"text":"The food is amazing!!! As soon as we stepped through the door, we were greeted with kindne","useful":0,"cool":0},"KwJ4he3Np0PPVhEtRg2AEw":{"text":"Been here for 35 minutes waiting for a catfish sandwich. Hope you have A LOT of time to ki","useful":1,"cool":0},"6pFIHWAyTH1AHRGY_pWNNg":{"text":"Lawd have mercy, this California girl just walked into the pearly gates of soul food heave","useful":0,"cool":0},"eySj3HH7sRaBXil3DA-H8w":{"text":"So I walked into this place hoping to get some good home cook food. What I got instead was","useful":0,"cool":0},"1uBt9yq8SP4JLhVJhNFkgw":{"text":"One of the locals at a restaurant on Bourbon Street recommended Melba's OMG this food was ","useful":0,"cool":1},"nQLHJWNe3ir3LAvJTsexNg":{"text":"Absolutely delicious! I am new to crawfish by two months.  I have tried other places, this","useful":0,"cool":0},"BLoOl-kVwMGua0kR5toMzg":{"text":"I recently visited New Orleans with my boyfriend and his best friend took us to Melbas and","useful":0,"cool":0},"-2YnvfRrjlTzKzKVLs5xxg":{"text":"Though the plethora of adverts would lead one to believe that this place is New Orlean's o","useful":5,"cool":2},"obLn8a8c6dBrImemBlgJ2g":{"text":"My shrimp Poboy was amazing. Im being a fatty on my trip here to New Orleans and had a Pob","useful":0,"cool":0},"9NEbzOC1EVhE1pXHYUiuVA":{"text":"We wanted to get out of the French Quarter and experience what favorite food people eat wh","useful":0,"cool":0},"KvlogOEShSAj6Tj0de_iqQ":{"text":"We loved it here once we got in. When we pulled up, there were some real sketchy dudes in ","useful":0,"cool":0},"ZZdmKstJYC94TRZ3XsRU8A":{"text":"Went to Melba's on a Sunday evening.  The place was very crowded.  Waited for about an hou","useful":0,"cool":0},"IqG8gRKx_9s4o6eajEHmKg":{"text":"The hot sausage, egg and cheese poboy is sooo good. After a long night of hanging out, thi","useful":0,"cool":0},"Ys4t99eunJ2xpTYLAueQjw":{"text":"While visiting NOLA I was craving a crawfish poyboy. I asked a police officer in the Frenc","useful":0,"cool":0},"gS9PbQ82pNecKslbb4LsuA":{"text":"24 hour dinner. Tried the chicken wings, ribs, sausage, gumbo. It was all very good :)","useful":0,"cool":0},"a3P0Dp7p37lJzu0do6YcQg":{"text":"We walked here from the CBD and it is a nice day time walk if the weather is cooperating. ","useful":2,"cool":2},"nOJ-8lLGvDn1OVpLuXacHA":{"text":"Amazingly good food. The shrimp and fish poboy was delicious! Open 24 hrs which is great f","useful":0,"cool":0},"a7b50aYofvo0HkFNEpkGyA":{"text":"They got some mighty good crawfish at $3.69/lb. Yep! Po' boys seem popular,  but didn't ge","useful":2,"cool":1},"IfaNzNwI_gbLAOVimcbytg":{"text":"I frequent this spot many times when I do not want to cook.  The chick is very tasty. I ca","useful":6,"cool":2},"D4iDvVCRZvi0njnN7P0pKQ":{"text":"Hectic and busy place with enjoyable late night food.  I had a fried shrimp po boy.  Would","useful":0,"cool":0},"-8Vk30wX4sV2b3vrloVD8w":{"text":"I've been reading about this place for a while, here on yelp and in news (did you see that","useful":5,"cool":2},"tAN_ZmrkS3UJZXeUJHPloA":{"text":"Came here Labor Day weekend and had the stuffed bell peppers, mac & cheese, and another si","useful":1,"cool":1},"3PPx3H6lxIjOHUGiojPsYw":{"text":"While vacationg in New Orleans I had the opportunity to fine at Melbas. It is really a gre","useful":0,"cool":0},"TsFwvW-wKGbhAKjO5KxSdQ":{"text":"Melba's is an experience. You will always run into some interesting characters there. The ","useful":0,"cool":0},"HBsZp762CZuK7Cv3MdPO4Q":{"text":"First time in New Orleans and several locals had highly recommended this place. Doesn't lo","useful":0,"cool":0},"0yA5KVVg9L2WrJM-aa-zNg":{"text":"Great place to do laundry late at night clean and quiet and play great music and it's safe","useful":3,"cool":0},"z05i56GKNOmOTABHjIO2bA":{"text":"2 stars only because the food wasn't that bad, only mediocre. Definitely not worth the pri","useful":0,"cool":0},"VKV0XYe-nasQoma3u3WtjQ":{"text":"If you're thinking MELBA's Ice Cream from the 80s (yeah I'm dating myself) then think agai","useful":2,"cool":0},"phuk5mGC0QbZwMA83VNtfA":{"text":"Do not waste your time! So much better from everywhere else in town. Old fish, stale bread","useful":0,"cool":0},"-OAHvawZYnaBm9XPiR9yGA":{"text":"The shrimp poboy was SOO good! \nWe also had the red beans and rice and it was my #1! We go","useful":0,"cool":0},"i14t6EYjDRc66eox3ghfdQ":{"text":"Food is decent but not worth the attitude that you get from some of the employees. The lad","useful":0,"cool":0},"efpiJUv0kkreGDdQczSCmg":{"text":"Super delicious po-boys, grits, and gumbo. We ate there last year and I forgot to review. ","useful":0,"cool":0},"g8hpLpy_5245H9vKSbPpKg":{"text":"*sigh*....I was really hoping that the second time around would be better. I read all the ","useful":0,"cool":0},"IcQUwzJ3PpzSZH1Fi5d_jg":{"text":"If I'm in New Orleans, whether coming or going...Melba's is on my list. I'm pulling up, no","useful":2,"cool":2},"gTgz1UTb3_M6nm5Wemf1tA":{"text":"The grilled fish was wonderful late night smack.  Sid not have an opportunity to try the s","useful":0,"cool":0},"Wc4RweOYn8eCiHmu6yZ3nQ":{"text":"I usually don't enjoy soul food, but Melba's has helped me regained my love for it! Don't ","useful":1,"cool":1},"R8ogTwWHbVAfw4OIXvGGPg":{"text":"Out of all the restaurants that my family and I have checked into in NOLA this one took th","useful":0,"cool":0},"Ku8POR6ZUmdyUVmWIm94tg":{"text":"The service was crazy slow.. place my order for food that was already pre ready... waited ","useful":0,"cool":0},"H0tBtj2b2uEu3P8n2fqTcA":{"text":"The food is amazing but the poor service has finally done me in. I come here often because","useful":1,"cool":0},"hUtAkhanDF9pFW8qv-U0jw":{"text":"I've ate here multiple times! It never disappoints! The best fried shrimp po boys! The BES","useful":0,"cool":0},"dplaP4x7EYrBD_N7voJBgQ":{"text":"Best place in New Orleans! They have everything you can ask for!!! The $10 plates comes wi","useful":0,"cool":0},"uWx2Y5Y0rb0VtAVOC_ueeQ":{"text":"I can tell this is a family friendly staple but my food was disappointing. We stumbled acr","useful":0,"cool":0},"8_XzWak1GQmgA1YyUybdFw":{"text":"I was so excited to try this place being that it's convenient for me because it's on the w","useful":0,"cool":0},"WwuKg0OOC5hm5sy4cRklCw":{"text":"This place is awesome. As a local, this is my new favorite place. Been here for years and ","useful":0,"cool":1},"QFW_dMLC8WBOXEzsvqGlJg":{"text":"This is by far the worst shrimp po boy in New Orleans. The shrimp taste like they bought t","useful":1,"cool":0},"jQ_ZwrXOWWzm93TNuPyEGQ":{"text":"Every time I'm in NO I have to have Melba's.  I had the shrimp po boy my husband had the o","useful":0,"cool":0},"zVGYq105d4glMD7oSSsgaw":{"text":"I feel like if you not from new orleans youll like melbas they home cooked food is trash a","useful":1,"cool":1},"cMtFRFt-AThTrWPJj4FbZQ":{"text":"This place is so good. Had the shrimp fish Po boy, sausage red beans and rice. It was deli","useful":0,"cool":0},"I9SyCEDCZG7yjKJDPIthzw":{"text":"This place was a find! Off the beaten path, but wow does it have good stuff. And really in","useful":0,"cool":0},"00SuMTzrYPnY_wTbE3vzAA":{"text":"Ok, here's the deal. It's open 24/7, has an amazing selection of food, huge portions and n","useful":0,"cool":0},"WhGecf25IOFlHAuxIpS9cg":{"text":"Food perfect... shrimp and grits, shrimp po boy and the bread pudding were exceptional. 4 ","useful":0,"cool":0},"bvjDwNQrNoDIesrjy7CV7g":{"text":"Great place for poboys,wings and breakfast. Open 24hrs, friendly staff and great tasting f","useful":0,"cool":0},"dX2RUthxUFRt7BqEv2zthw":{"text":"Today was my first time visiting Melba's, and it will be my last. One word that describes ","useful":0,"cool":0},"JGskq4wOFPCuEz1sxESt5w":{"text":"This place always has a line for a reason.  I've been there many times now.  The fried chi","useful":1,"cool":0},"2opTEaPCqMshNclSXfyobg":{"text":"Pretty good late night spot.  The place is 24 hours.  I had the hot sausage poboy and jamb","useful":0,"cool":0},"ZuOnF2KGr5ZYwsb4xJP_Sw":{"text":"Probably one of the best restaurants in New Orleans. Everything is fresh and it tastes lik","useful":0,"cool":0},"xCGpMNPNTw_iZR6jSqmbKw":{"text":"Don't waste your time.    Used to be GR8!   Not worth your time.   Roast beef poboy came w","useful":0,"cool":0},"xkGwHHGFFJMCkENsg959ig":{"text":"It's fast food and expensive. It was by no means the greatest thing I've ever eaten. We as","useful":1,"cool":0},"6eimEsg5OfmvEWFcRGA2sw":{"text":"I was pumped to try Melba's because EVERYONE I've met here in Chalmette said it was authen","useful":5,"cool":2},"84Ql4EKhVyxilOA8rtAZZQ":{"text":"Never have I ever had so many brain freezes in a row.  I'm about to have another right now","useful":0,"cool":0},"k6q2Eyo4J9DUvy_7Qhlvfg":{"text":"Solid poboys +0. Free samples +1. Open 24/7 +2!","useful":0,"cool":0},"Uxj0S_pL71-GwwimI2sEsg":{"text":"Neighbourhood quality citizen feeds and washes the people.\n\nTwas my 1st time through the d","useful":0,"cool":0},"RoOuOAp7wbCIJ9Ps5YIM6g":{"text":"Sorry for late review but the past weekend, I visit New Orleans and went to Mothers' based","useful":6,"cool":2},"GsMpzqbWFg6HAmmU7GO0EQ":{"text":"Today I had the first horrible experience at Melba's. Customer service sucked and the food","useful":1,"cool":0},"ffd8Ha6CGsfocIk5PMiEAQ":{"text":"This place sucks! I get off a red eye flight hungry has hell. Placed an order on Kiosk wai","useful":0,"cool":0},"WO-yGRgqYe70sE7JctkMMg":{"text":"A trip to New Orleans wouldn't be complete without a po' boy so when I had some free lunch","useful":14,"cool":9},"3H84xPKVikDMSPa12vi1UQ":{"text":"Well lit and clean surfaces. Kiosks make ordering quicker. The fried catfish poboy was del","useful":0,"cool":0},"-jOyIyaifICeiXJAay6znw":{"text":"Foods really good, service is quick- food service hot table line, even when its packed the","useful":1,"cool":0},"OZR-AuZBhJg8VcXL8YYgNw":{"text":"Food is fairly decent, and 24 hours is a huge plus. Last time we were there they lost our ","useful":1,"cool":1},"sKHdSFBfLH20TPzM3CpgeA":{"text":"Food always amazing, cornbread you must try. Cake makes you want to slap your grandmother.","useful":0,"cool":0},"KrQL83gIFkLPvUc1Hyzv9Q":{"text":"This isn't my 1st time going & it's usually overflowing guess I'm just spoiled. I had the ","useful":0,"cool":0},"qq6azN5778VOX5N4HsJuDg":{"text":"Don't be deceived by their ploy to check-in for fries. It's if you buy a Poboy. They're ge","useful":0,"cool":0},"mzkntu-1duLWLg1NcC-o0Q":{"text":"I've had the roast beef with rice and gravy, corn grits, corn bread, stuffed artichoke, fr","useful":1,"cool":1},"M8K0nlb08nPWXOo710GFuw":{"text":"If you're looking for a great place to eat this is one you're going to enjoy. They have a ","useful":0,"cool":0},"G3NNgVJa3uTAJvveyFu5uw":{"text":"The food is disgusting. The prices too, as well as everything around, I really do t know w","useful":0,"cool":0},"rNlCe-wUcAZwB0Qm5cNzyA":{"text":"A nice place.  It's fast food but tastes a lot better.  They have a lot of home style cook","useful":0,"cool":0},"7FqgpdePauNv0bubl63v3A":{"text":"This place has everything. Okay, so let me paint the picture for you: \n\nIt's Sunday night,","useful":1,"cool":2},"n_DSGBuUckKuMm2Pm77NHw":{"text":"point blank \nyall have to do better!\neveryone doent need a job!\nyou have these faces pf yo","useful":0,"cool":1},"gkttb62ST2f4O2vNd-8-NA":{"text":"Mardi Gras!! \nEpic Night!! \nWaited 1 hour and never got my po boy! I was thoroughly entert","useful":0,"cool":0},"jDpizCzww9nLlNAPwJzvOQ":{"text":"This was my second time here and the first time I was impress with the food, not so much t","useful":0,"cool":0},"nek3vGIFNLjhe7uSkdmQ0g":{"text":"If ya'all want to dig into some funky Nawlins, this is the place.  It won't disappoint. It","useful":0,"cool":0},"kpWdG4XIJyh84DtKSsCc7g":{"text":"Ok! THIS review is if the cashier, Lationa, was VERY nice & helpful with all customers who","useful":0,"cool":0},"RcDbGcLHwMOlks5h-ysfuw":{"text":"Super service, excellent prices, and outstanding food and drink selection. This place is a","useful":0,"cool":0},"_o2laN5NurX69MvpIH3mEQ":{"text":"Food and service are great.  Music would have gone a long way to helping the ambiance.","useful":0,"cool":0},"LP7eEs-dART-sySmZ5vPsg":{"text":"DO NOT EAT HERE! It was suggested by our driver. He's clearly not from this part of town. ","useful":2,"cool":0},"ppZBFSCy1ihBVj3l3tRqFA":{"text":"The first night we went I ordered the bbq rib plate and it was deliciouuusssssss. I ordere","useful":0,"cool":0},"JEahSzsUM8oNAMEWh3orkQ":{"text":"I've eaten Melba's for a few years. It's all so good and so hard to choose. But on 4/19/19","useful":0,"cool":0},"1ILCHg19ez706lM2Fwz9pg":{"text":"FOR ME IT'S NOLA'S BEST FRIED SHRIMP PO'BOY.\nParkway isn't dressed enough, Domilese's does","useful":17,"cool":9},"Y9chzNpLGB6ITJsuOurp3g":{"text":"Quick review : YES. Looking for a quintessential New Orleans food experience? Visit Melba'","useful":1,"cool":1},"lxdy9pULtBAj9-OwN7zccw":{"text":"* GOOD FOOD a lil busy but GOOD *\n\ny'allllll this place has SUCH GOOD FOOD.\n\nI went for th","useful":0,"cool":0},"MXd1hUeXMS99sJjmOE_CdQ":{"text":"I Been coming here with my family since I was a kid, I remember when they first selling ic","useful":0,"cool":0},"hjdoyZpJKVjlhLo1MfdWlg":{"text":"The red beans here are awesome. I used to eat them once a week almost when I was too lazy ","useful":0,"cool":0},"ihsB_AO5VwRBsvKB0PO18A":{"text":"Home cooking on demand. Food flavor is consistent and service is friendly. Not a healthy c","useful":0,"cool":0},"v7jTvMX9T0jYt7CYyyWbRg":{"text":"Hey Scott W.\nIn fact thats what I was doing when I wrote my review. I was getting dinner m","useful":0,"cool":0},"K-O3kG6pcDSxgrooZdYNSg":{"text":"i was not impressed at all with the food and service...the servers plop the food it in a b","useful":0,"cool":0},"-k9Ri7vAZP6kahWFpgoyWw":{"text":"Great neighborhood spot with amazing community values! They are always giving back and pay","useful":1,"cool":0},"dYcSY5DtRvI6-CBWzSeD1w":{"text":"Melba's is one of the most interesting places to visit in New Orleans. You can get a hot m","useful":0,"cool":0},"siR0dIeRZJ-dpU_vsuMulQ":{"text":"Giving this two stars only because the service was absolutely horrible, workers walked bac","useful":0,"cool":0},"LaJP5XWWtafK7VlkVdXHfQ":{"text":"Visited this place 3 times in 4 days on a recent trip because it was very close to our Air","useful":2,"cool":1},"sbfMdQGdYdfei0Rxg_ltYg":{"text":"I LOVE LOVE LOVE the shrimp and grits! The people here are always so nice. I ordered deliv","useful":0,"cool":0},"26xjjm3anA3f-leuiMJMTA":{"text":"Yesssssssss.\n\nThings I said at Melba's \"dang them ribs big\" \"thas how my grandma gumbo is\"","useful":12,"cool":9},"pfM-Pp37h9GjZ0VjOWSr3w":{"text":"We stopped in very late to grab a bite.  The food was awesome and the service was good.","useful":0,"cool":0},"8_gyhOBTmZwS0AM1WmNIGQ":{"text":"They always have a line and after eating here I see why. We had stuffed peppers, fried fis","useful":0,"cool":0},"H7-ICZ0zcjA31F-nnFcB8A":{"text":"A bunch of us were hungry after our conference ended for the day....wanted something reall","useful":0,"cool":1},"J0-t4cRc1pVNGh1lzTArvg":{"text":"Not bad, has as lil bit of everything,  and its open 24hrs, food already made on a hot lin","useful":0,"cool":0},"Ne-eUKZ7OFFy1m8auacGEQ":{"text":"One of the best , love the fried seafood. Great taste. My grandson could eat there every d","useful":0,"cool":2},"ey4cP1OV1w7GpFcSfphZHw":{"text":"Waited 30 minutes for a turkey sandwich... super inefficient. I've never seen so many peop","useful":0,"cool":0},"PiP5eNnJK9XMz9WU3lbGJA":{"text":"So after spending close to $13 for a shrimp on bun, I will not be returning anytime soon! ","useful":0,"cool":0},"-Y2_Q37AzRHVZMvUSW5Jxg":{"text":"First time to eat at Melba's, but have heard about it. The wife got the mac and cheese and","useful":0,"cool":0},"jt1AKxVGa0SIy2RzN1lNxA":{"text":"We were in New Orleans for a 3-day mini vacation and found Melba's through Yelp.  It was t","useful":0,"cool":0},"eRDz0ZEFOc_7SmaHSLfP0w":{"text":"Waited 20 minutes, walked out without food. For a place that is a glorified Popeye's Chick","useful":0,"cool":0},"Cl80HJkXQZpbDgRHAzZZQw":{"text":"Well I have been sitting here since 10:50. It's 11:27 and they forgot a sandwich when they","useful":1,"cool":0},"5upJMUCLSquHwfp4l9SXfA":{"text":"Okay so if I had to solely rate this place off customer service, I would easily give it a ","useful":1,"cool":1},"HSipYwUojiRbIWED1l-ArA":{"text":"I hate giving bad reviews, but this place was not good! The food was very bland! I don't r","useful":0,"cool":0},"IcEqMaDybBWWn2rGeoo-DQ":{"text":"Absolutely the BEST food I've ever had, but also the first restaurant I visited while in N","useful":0,"cool":0},"2p4rPNArYiPMZISQf5jJug":{"text":"So fantastic! Cute little joint with a great setup! Some of the best food I've ever had! W","useful":0,"cool":0},"wJjdK-hMDauLnbNjY_0i8Q":{"text":"Stopped here 9-ish after flying in, on the way to Jonathan's who wanted a po' boy and for ","useful":1,"cool":0},"2p9v2qsyTbWuutNfgpnr7w":{"text":"The good: The food looks good and they eventually serve it to people who ordered after you","useful":0,"cool":0},"WbQJlT1lorfj65QOWRIOlg":{"text":"My first review wasn't that positive but the fact that This place donates to their communi","useful":0,"cool":0},"3cC86Je3WfmqxhaOLZ49hA":{"text":"Best po boys in the city! I love this place! Also love the chicken teriyaki for a side dis","useful":0,"cool":0},"NjnzbCdkbRjGYFRpsQz-kg":{"text":"Melba's has always been a personal favorite of ours since we visited NOLA and now that we ","useful":0,"cool":0},"-KsibE5XFf7Ze7iEbmlpNw":{"text":"came in on a very busy night. lots of tourist. myself and the others were confused on how ","useful":0,"cool":0},"ftVY2G6MXfgua4p7gUR8NQ":{"text":"I mean you should just get the wings and the daiquiri and thank yourself later. I'm not a ","useful":1,"cool":0},"8eOwk8W4_2-uDwyFXhJ19Q":{"text":"OMG...... I kept seeing a commercial on tv for Melba's and today I decided to place the ad","useful":1,"cool":0},"EOyj9Jw9YPmhfURDi0D8bA":{"text":"I guess we had too much expectations from this place since most of our Uber/Lyft drivers r","useful":0,"cool":0},"1ceShFtIg0_1F67SUakXrQ":{"text":"I don't even have a food picture for this place, which says a lot . After being in Louisia","useful":0,"cool":0},"IkaN4PzCMa1CvKNcMyBdzg":{"text":"The late night breakfast is legit. Those pancakes were so fluffy!!!! And the bread pudding","useful":0,"cool":0},"a4uHhl2Nne5PGm3xQUU5ZA":{"text":"Delicious po Boys and very friendly service! Went with a large group of friends and staff ","useful":0,"cool":0},"qt53oSzl-I-X_hsiVKm3JA":{"text":"I have been to Melba's many times since the not so pleasant experience I had in the past. ","useful":9,"cool":8},"1c6kbJjNlbX-1mPA6rwU3g":{"text":"This place ROCKS!  I mean it's 24 hrs.  You can do your laundry, eat and sit at the bar al","useful":0,"cool":0},"sBSoALB-U0--ejKERLsNHw":{"text":"I usually roll into this place anywhere from 10pm to 1am & I've got to say, despite the hi","useful":1,"cool":1},"7u-HUFDsE1cId1lpdibRXA":{"text":"Soul food plain and simple.  Great flavors and down-home staff.  Questionable location but","useful":0,"cool":0},"s9-nX6dgPho4fUmVxxCawA":{"text":"Today I came here around 11 am for the first time. The light skinned lady at the register ","useful":0,"cool":0},"Ce4lPWwINbGiBOpZe-rASA":{"text":"Sadly after today's meal I have to drop my initial rating.   I can not believe I spent $26","useful":2,"cool":0},"5erDRDVowsosoeSHgyitSQ":{"text":"Melba's is a take out place, eat in joint, slushie bar, and wash'n'dry all in one! How can","useful":0,"cool":0},"13R8uHS6vbcv8fab6i1pYw":{"text":"OMG... what an experience.  I'm in town for Zulu/Fat Tuesday and this place was suggested.","useful":0,"cool":1},"RLN5D52y7vzYbr21F2di-w":{"text":"We ate at Melba's THREE TIMES during our last visit! Quick and easy, cheap and yummy. We e","useful":0,"cool":0},"UqPgc7fuFRs8UUexxdcD5A":{"text":"August 2019- Po'boys while doing laundry. During my 1st trip to NOLA this summer we wanted","useful":2,"cool":1},"5nOmElLFPHOoOAMepdtMKQ":{"text":"Love this place. And the daiquiri are to die for. Place is a little small but I like to ta","useful":0,"cool":0},"cQ8TBwkvTrlA9niaAtoW7Q":{"text":"I giving it a 3 because my dinning partner liked the food... but to me it is a solid 2. To","useful":0,"cool":0},"KaoC3TQCo3RJVYnRYFRvCg":{"text":"Not good. We got a ten pieces tender with two sides, Mac and Cheese and jambalaya. The ten","useful":0,"cool":0},"un7iankfbqwihEUc7ikY0Q":{"text":"I must make this known first ... I never had a shrimp Po-boy before. This was my first tim","useful":0,"cool":1},"P4ry-zhxfUYYqpptVQJnXQ":{"text":"Be sure to have cash, they charge a convenience fee for the use of debit card or credit ca","useful":0,"cool":0},"Ld89lNGkAjQgNQMA8mBeTQ":{"text":"Well I kissed and made up with Melba's and Scott Wolfe .... Another fine meal and I hope w","useful":0,"cool":0},"DgeXXZE_Q7XzQ9X3im20Qg":{"text":"Two Stars are for Service. Usually Melba's is my first stop when I get to town and the las","useful":5,"cool":1},"8bfqu561RvqlED63VY02Qw":{"text":"This is a uniquely New Orleans place. It's a wash and dry laundromat, a daiquiri shop, and","useful":0,"cool":0},"zRNhuqmUDKKGCsC15xRQ3g":{"text":"Didn't have a chance to get the food, but it smelt amazing! Daiquiris are cool & a great a","useful":1,"cool":0},"TPGfZngzmINv1OFmArj2Yw":{"text":"Besides the long wait that took about 30 minutes to 45 minutes to actually receive the foo","useful":0,"cool":0},"C-coMoVn2L5x1-HiTI9v3Q":{"text":"This is hands down my go to place for food and to wash my clothes. My regular usual is a r","useful":3,"cool":1},"PLrrNNwSrFUNi9EodNpQkA":{"text":"better than average .....\n\ncooked 2 order ....\n\neasy parking......\n\nplenty of shrimp .... ","useful":1,"cool":0},"eO_DI97M8V62C9EoTXbbCw":{"text":"One meal from this place and you'll be full and satisfied for the next two days. I had a c","useful":0,"cool":0},"Nn7M-PIVLH8jsSH4tJp3pA":{"text":"Very good! First experience and I have to say I'm impressed. Came in for breakfast at 2:30","useful":0,"cool":0},"-E6VZTbCamYx0DVUUB16Fw":{"text":"1st off the Daiquiris are dope, parking is ratchet and the chicken on the poboys is to dam","useful":0,"cool":0},"P7B9pRXup3sVfI58Bh0niw":{"text":"Who would have thought a little restaurant connected to a laundry mat would have such good","useful":0,"cool":0},"O2vbuYmMMOx8mgMELcHPYQ":{"text":"Best spot for some soulful late night grub. Cant beat the $8.99 red beans plate. Big plate","useful":2,"cool":0},"xPoF2mtcEhHTvzR_PQnChw":{"text":"This place gets extra bonus points for being open 24/7 and they also have a good selection","useful":7,"cool":5},"Kk_l0wKKFmqvUDR6J6DuMQ":{"text":"Shrimp po boy was KILLER, the bread fresh and shrimp well seasoned! my dude got the wings ","useful":0,"cool":0},"CDkMZvSNqjiP60_-wdY97w":{"text":"Ordered red beans and rice with Mac & Cheese , Jambalaya , Chicken wings($9) at kiosk coz ","useful":6,"cool":7},"4cVt9fEJyRqMG-FzKc01_Q":{"text":"A laundromat that is also a restaurant that happens to have some of the strongest daiquiri","useful":1,"cool":0},"0VAXDYzVqBHC6ajIMpI5bQ":{"text":"Day 2 at Melba's, and had to reduce my ratings from 5 to 2, but let me explain...  5 is fo","useful":0,"cool":0},"Hd2VK8oEcQckbl35Kg7xBA":{"text":"Food wasn't fresh, overcooked shrimp. I immediately felt sick afterwards. But the drinks a","useful":0,"cool":0},"E6W9NOmP0PW8G3-JY1hj9g":{"text":"Went here for lunch during a book signing. Got a free book (excellent), and ordered a 3 pc","useful":2,"cool":1},"t2TCzaR3XD0J5VdKZ_9ncA":{"text":"Good place for a late night poboy, or tenders, or a mix of anything. The hot sausage poboy","useful":1,"cool":0},"syd2SnRYBy7vLcSxodax1w":{"text":"If you like waiting for over half an hour to eat over-priced, mediocre food in a chaotic, ","useful":0,"cool":0},"hm4Obj4Fb7bXmWJGexqjEg":{"text":"Melba's never disappoints. Good service and good food. I ordered 10 piece chicken wings an","useful":0,"cool":0},"U5LAViotMJpye-bHMTw1qw":{"text":"Just wow! The food here is amazing, it tastes great fresh and even delicious when reheated","useful":1,"cool":1},"JZkVfTALYaKp_q_ReRDBOg":{"text":"Oh yeah, it's good.  We ordered the seafood combo, catfish and fried shrimp with Mac n che","useful":1,"cool":0},"s_kRXj5nGbLPnE1sWSjBvA":{"text":"Love this place. Best food ever. Always a long wait which is sort of annoying but the food","useful":0,"cool":0},"qwdz-i3F6zb58pyq8jCqmg":{"text":"The poboys are good, actually really good. Unfortunately, this review is about their lack ","useful":0,"cool":0},"mlZhgOQnhbcXFbUlbbkpIQ":{"text":"The best way to describe Melba's is \"only in New Orleans\".\n\nRestaurant, laundromat and dai","useful":0,"cool":0},"OFssDcaIzdMNOyrI3sPH3A":{"text":"A friend of ours that lives in New Orleans tried to keep us away from \"tourist traps\" and ","useful":3,"cool":1},"BaUgCH56RyaomEHyAjtLAg":{"text":"I really appreciate the restaurants that are open, however since being limit to where you ","useful":1,"cool":0},"FaoaAH5M9wSUZzNNu6oiWA":{"text":"Let me preface this by staying I'm not from new Orleans but the service was terrible, ther","useful":2,"cool":0},"0Oz62UARhnYekYclxAZyfw":{"text":"Gotta have  the Red Beans and Sausage on Monday. Real New Orleans food!!\nGood Service and ","useful":0,"cool":0},"yJDz4iwLkBjr2LohEr0t3A":{"text":"PSA: this place is open 24 hours, 365 days a year. That includes Mardi Gras week including","useful":1,"cool":0},"co4K7NBqkaxqohjB6DEueg":{"text":"Recommended by a coworker who visited New Orleans a few months ago who could not say enoug","useful":1,"cool":0},"X239GdOAZFmEN3RQz6nd_w":{"text":"You come to NOLA to drink and Melba's is serving the BEST daiquiris in the city!! Which sa","useful":2,"cool":0},"BAbV4dbLNnizZ0tNRw3xrA":{"text":"My name is Wayne I would like to speak to someone pertaining to order I placed on yesterda","useful":0,"cool":0},"U_KKhdXl9NcYmzx_yNE1Rg":{"text":"Obvious the owner reads most of these and replies. Good stuffed bell pepper. Corn grits us","useful":0,"cool":0},"rsSuriid6py8Z4slcHLHqA":{"text":"We're all very disappointed in Melba's tonight .... Placed several online orders that had ","useful":0,"cool":0},"uBD61VRcQ5MxiMMOde9kaA":{"text":"So I had the baked chicken and mac n' cheese. When I tell you the first bite said it ALL!!","useful":2,"cool":1},"YK1lq59D1jJ47uXAPi7M5A":{"text":"Good, solid  NOLA food. Wait times too long. They should get their systems in sink with de","useful":0,"cool":0},"5O49GFbezPpRM_EgtwsRbg":{"text":"Food a bit pricey and portion isn't big for what you paid for. Had there jambalaya it was ","useful":0,"cool":0},"9cdNCdyeAvIaEJGItH40NQ":{"text":"I came to Melba's for lunch on my break. I ordered  a 9th ward gumbo. When it was time to ","useful":0,"cool":0},"N3_qj0kEyeV6V6wzZ1tMfA":{"text":"You can drink coffee, eat a po boy, and listen to some decent jams while you do your laund","useful":0,"cool":0},"L1ByXvQJrooYqbOds97PMQ":{"text":"I love Melba's so much!  Nothing makes me happier than a good plate lunch, and Melba's has","useful":0,"cool":1},"EkHeY7bDk96lGjbuDfX98g":{"text":"Melba's is definitely a restaurant that everyone should visit when in New Orleans! I go to","useful":0,"cool":0},"MnbHUmwaytjvPdflSOY2Wg":{"text":"OMG!!  The food was absolutely amazing!!! I love the vibe of this place and the drinks had","useful":0,"cool":0},"VbJszienuPFREglIv7B64w":{"text":"This place is disgusting! DO NOT EAT HERE!! They completely messed up our order, didn't gi","useful":0,"cool":0},"crNrCvfoRKbUCjr64A16HQ":{"text":"Since apparently my last review was removed I will try this again. After hearing about Mel","useful":5,"cool":0},"uYrnyPIPOMMzZLsTyqH83g":{"text":"\"MELBA'S IS NOW OFFICIALLY OFF-THE-CHARTS WACKY\"\nsaid my friend today after visiting the n","useful":6,"cool":3},"RWj0rMv2gvclsUnGH2dhtw":{"text":"This place is a gem. Historic to New Orleans and known for its delicious 24/7 meals. Howev","useful":0,"cool":0},"w722Cv6QE2UZT7tZ7WtF_w":{"text":"I'm sorry, but I just can't anymore. I usually don't notice the lack of customer service b","useful":1,"cool":0},"JWkXorKOMtAiU4k85Kd80w":{"text":"Yum yum. Missing mama's home cooking? Head over to Melba's and get your grub on. They have","useful":0,"cool":0},"l3_Nq0mW9mbp7lrdtlWFHA":{"text":"I was in desperate need of doing some laundry so while I was there I went into Melba's and","useful":0,"cool":0},"jZbUQ2SEAf-RlWpilMPrWg":{"text":"During our spring break trip to New Orleans, my friends and I wanted somewhere cheap, out ","useful":1,"cool":0},"9sI8G52RLs2-BU596_6FpQ":{"text":"This was one of the highlights of our trip to New Orleans. So much good food at great pric","useful":0,"cool":0},"g4uFEJgFeh0tKWnihsdyIw":{"text":"Each time I visit New Orleans, My First Spot Ro visit is Melbas. The cabbage and gumbo and","useful":1,"cool":0},"Oxe64P9edFNm20zcjz-ZhQ":{"text":"After reading all of the reviews I had high hopes for this place. The bread was hard as ev","useful":1,"cool":0},"E4wnn4Wl5MC6MMlXFGbB_A":{"text":"After waiting almost a hour wait!? Yall still don't have the order ready? What's the point","useful":0,"cool":0},"YSl04bYGgJfGT7u2XNK9zw":{"text":"Melba's had four stars on Yelp and was even better than described. They're open 24/7, with","useful":0,"cool":0},"_1ujoHk3lFw3YSRYBexiFA":{"text":"My friend raved about the food here and since my girl knows good food I knew it wouldn't d","useful":5,"cool":5},"yr3vV9-fFNQhBDNa5B9CFg":{"text":"If I could use one word to describe this place, mediocre (at best). Nothing particularly s","useful":0,"cool":0},"a8gusEo8XxLe_RUFtMgzUA":{"text":"The drinks here are no joke!!! The unibrow being the strongest daiquiri. Came here on a Fr","useful":2,"cool":1},"BuFjHyHkqCoZcATU0QuObg":{"text":"I love the daiquiris here but the food is hit or miss. The red beans are definitely a disa","useful":0,"cool":0},"zPchySV3Dz-sRnepdWn1hQ":{"text":"I love the food and the people there, not to mention  it's open 24 hours a day. The food i","useful":0,"cool":0},"4FIXcNwXAmaG6w8NYTOU0Q":{"text":"The roast beef po boy was great the shrimp po boy was okay.  The fries was okay that's why","useful":0,"cool":0},"mAvAayFI65fJtll9n262BA":{"text":"A hidden gem in New Orleans and right around the corner from the French Quarter.  If you w","useful":3,"cool":1},"nqFvSl2TRe_iB2fDd39D4A":{"text":"I ordered the hot sausage poboy & my husband ordered the fried shrimp poboy. The poboy san","useful":0,"cool":0},"wAkCMvzfNPbfI_EIEZxo2g":{"text":"I'm done. I stopped in for a hot sausage for my granny after she got in town. All of 3 peo","useful":21,"cool":11},"YZNzjQYFOavn6s9deo_t2g":{"text":"This place is DANGEROUSLY, addictive!! I ate this place for 5 days straight!!! That CANT b","useful":2,"cool":1},"hqht42twHDymiS4bOjgmFw":{"text":"In my 8 years living in New Orleans, this restaurants food was barely edible. I ordered a ","useful":2,"cool":0},"UJA1rSlja-VyBzcOgB9eBA":{"text":"Some of the worst food I have ever had. This was recommended from so many locals and it wa","useful":0,"cool":0},"-rvQlbMMzRm-v8Y8cP639A":{"text":"i ordered doordash and ordered the chicken tenders and a po boy. the po boy was good but i","useful":0,"cool":0},"pXVRmuVUEP1p17afy_3B3w":{"text":"EAT AT MELBA'S!!\n\nVisiting for bead distribution and checking out the Chewbacchus parade r","useful":0,"cool":0},"z2djn9vSso-iud_ewKUTTQ":{"text":"The shrimp po boy (po girl according to Melba) was so delicious!  I could've used more shr","useful":3,"cool":4},"JMVzEgoG-86AAwgBWGRNYA":{"text":"Ordered Uber eats delivery. I gotta tell ya, I've had a lot of po boys. This one was THE B","useful":0,"cool":0},"T5K5Fj5pQnQLN4xgeS0hVA":{"text":"Chicken was dry \nThe bread was hard \nThere was little to no flavor \nThere were more toppin","useful":1,"cool":0},"jYjpwQ_M3XsDpnfXP9fS5Q":{"text":"This place was a little off the beaten path while touring New Orleans. A friend of ours ha","useful":0,"cool":2},"E_uMN2T4yxuPuB3qMbYNbw":{"text":"Great food love that I can go at 3am and get a good fresh meal. Wish they had these in Cal","useful":0,"cool":0},"-iHlQjmw5gZ-ezHk_8pE5A":{"text":"My shrimp poboy was hat and dressed just how I asked. They have a book store and authors a","useful":0,"cool":0},"ugmaJ4aetk1SZxKvl86yjQ":{"text":"Worst food I ever had. Fried fish was bland no taste at all. Red beans was like paste, Mac","useful":0,"cool":0},"EjdxNPom3IHFk5oZQx_c4A":{"text":"Melba's is a neighborhood spot that is attached to a laundromat, but do not fear or be foo","useful":1,"cool":1},"p4aVePAoJYxsnhsPTcMwgw":{"text":"I don't even know where to start. I have had shrimp and grits all over the south - Houston","useful":0,"cool":0},"Dz7kgVelcanMM0hTihjPnQ":{"text":"Nasty dry shrimp po boy never will I waste money here again! If you have no other choice I","useful":2,"cool":0},"QvylIPzX_EB_TEjDW4Jfmg":{"text":"I went twice during my visit. I went late at night with a long line. Which was expected du","useful":0,"cool":0},"Lr9l8WIkAN6vQ_WcsOPuJQ":{"text":"Excellent poboys and daiquiris. Plenty shrimp, good size, fried perfectly, soft bread. but","useful":0,"cool":0},"pj76jjuH8ClvlGk1P9BZJA":{"text":"In New Orleans getting the local experience. Really enjoyed Melba's cafeteria style dining","useful":1,"cool":1},"d1gve9E-SasVRMQFNExsLA":{"text":"Melba's was recommended by our Uber driver hence to lack of time to make it to another est","useful":2,"cool":0},"OhtcRSjMvBTRIO1dGx0afQ":{"text":"This place is a rip off. No water available only bottled for sale. Bathroom sinks didn't w","useful":1,"cool":0},"2c22mIusFaPloTPQQl3ywA":{"text":"Come here for the food, stay for the free legal advice. Melba's serves up a great poor boy","useful":0,"cool":0},"bBo3hwfl_HoO2VGMqciVSA":{"text":"XTC daiquiris here: DRINK AT YOUR OWN RISK. It is the strongest one I've had. We had to ad","useful":2,"cool":1},"2WHlKU_KlicPM3kAY8ojcg":{"text":"Was able to eat here for the first time,Visiting from California. The food is amazing so m","useful":0,"cool":0},"NXlDN9LFJQrINRnXze1JIA":{"text":"the food is AMAZING and enjoyed everything I ate. 9th ward breakfast and that catfish","useful":0,"cool":0},"TRPnI1GkpyZesbRXsuRiDQ":{"text":"How can you not support a restaurant that encourages literacy and good grades. Free daiqui","useful":0,"cool":0},"JI86e4NO7tbwjdSxxCDqpQ":{"text":"As a local their shrimp Poboy combo was like $22 bucks. Needless to say, I wasn't impresse","useful":1,"cool":0},"GD-xYPvJfuCLR6JsRzQK0A":{"text":"It was a last minute decision to stop here and eat after leaving The House of Blues. There","useful":0,"cool":0},"ZbbqbVftsv7O0sT0BQ0f9A":{"text":"So disappointed in my trip to Melba's \nI haven't really gotten a chance to go since the pa","useful":2,"cool":0},"v-5s8ntI48RcRDXdQbT_Rg":{"text":"One manager (looked like upper management) seemed to believe that he was exempt from masks","useful":1,"cool":0},"ECj82v6yKyg6NxpZQgDReQ":{"text":"If you're looking for quick Cafe, corner store deli food. This is the place for you. Let's","useful":0,"cool":0},"MlueK9htUhH6jgwHR9-a0A":{"text":"I'm so mad. I don't have a washer and dryer so I have no choice, I have to go to Melbas. A","useful":0,"cool":0},"2cTQ38BTheczt0jsXhnXKg":{"text":"The staff was very friendly and were not impatient when it came to me deciding what I woul","useful":1,"cool":0},"yMOF2vkm1XqODznl7Ki0Ag":{"text":"Be aware - Chicken -YES, Breakfast - NO. McDonald's is much cheaper. I come here all the t","useful":0,"cool":0},"Pe-0YFembnUfwgEjX1vf8Q":{"text":"BEST SOUL FOOD in all of New Orleans PERIOD ! Don't argue with me.\nI stayed in a heavily p","useful":8,"cool":6},"3sEelCUlCfiqysw0uiejhA":{"text":"Lord Jesus this is amazing food! So authentic and big portions. I had fried shrimp and the","useful":0,"cool":0},"_AnTBNOYGkQoqN-zITG6SQ":{"text":"The worst service in the city.  2 hour wait and they still got the order wrong.  It's down","useful":1,"cool":0},"qODZGQjCW6sQzdT3Dm190g":{"text":"Damn you, Melba. \n\nIt was here that I said, \"fk it\"... and once I saw they had CORN GRITS ","useful":5,"cool":3},"92akh5eL4RYpfOylJ8tIgg":{"text":"I waited thirty minutes for one breakfast plate. My friend received and finished an omelet","useful":3,"cool":1},"6-KI6wBhim4vZ9lU2Z6fyA":{"text":"okay, so the fried chicken tasted like it was freshly cooked after a long sunday morning c","useful":0,"cool":0},"JMGqtiKNyPtXHj5uc2r5rQ":{"text":"Late nite after hrs fried chicken in New Orleans is one of the very best things you can do","useful":2,"cool":3},"3aYCG7iwIbQhowiaBIv5AQ":{"text":"This place is always open. And that's good for someone who works night. Great atmosphere a","useful":0,"cool":0},"LaeRd9yjAPe7shWJeBE7dA":{"text":"Roasted beef and Gravy here is the beat I've had...wonderful warm customer service...and g","useful":0,"cool":0},"7Pakq_OYCYIidS15nLwbkw":{"text":"Food was delicious and authentic.  Very inexpensive.  Daiquiri's were so cheap it was a jo","useful":0,"cool":0},"G55f4V9p3C3WZXRqZuTn3A":{"text":"Hot Sausage!! Food and atmosphere cannot be beat. Best food in the area.","useful":2,"cool":1},"yWOvEBrObjoRmb6EQOCLCA":{"text":"Customer service is always great and so are the food and daily specials! Love the free win","useful":0,"cool":0},"Xxyujgdngoa9DoEinWoKTw":{"text":"Not my favorite! The daiquiris are acceptable but the food is a hit and miss. I got the co","useful":0,"cool":0},"FyOqL0yLoUSOsmA2kmcboQ":{"text":"THIS IS THE MOST DELICIOUS FOOD when you're drunk or from another state.  When you're sobe","useful":0,"cool":0},"PmMN8KhsiCuNp-QBggwMiQ":{"text":"Came to NOLA from Los Angeles expecting to experience some good old NOLA soul food and boy","useful":1,"cool":0},"x4oInLFJgrq5HbLyCL-Bug":{"text":"I'm only giving them a 3 because of the prices. $18.99 for a fish plate and $18.99 for a s","useful":0,"cool":0},"DAUHOyAxDtGCMyO0dLw82A":{"text":"Worst service ever. Cashier girl was nice but everyone else seemed mad and bothered. \nWe l","useful":0,"cool":0},"AArjrBXgpbqyz26eRvzDRA":{"text":"I absolutely looovveeee Melba's!!! I'm from Shreveport, LA and anytime I'm in NOLA it's im","useful":0,"cool":0},"VfjAJQHMpNtK253TOSrYHA":{"text":"The portion sizes are HUGE.  If you order from this place just expect to take home left ov","useful":1,"cool":0},"ZfDb6vTFPaIY96ZxayGbcA":{"text":"Had a delicious shrimp po-boy here. No frills Love the interior with all the signage and i","useful":1,"cool":0},"lMpBkgBhmIGPMNHcFpFjSw":{"text":"I love this restaurant. I've been here on two different visit into New Orleans several day","useful":0,"cool":0},"qy3_taSWkN6dGH8j5ERbaA":{"text":"Everyone was keeping their distance and wearing masks. There were hand sanitizer stations ","useful":0,"cool":0},"ETnv2yub97jhZWNVt3kfqw":{"text":"I ordered online from this place 3 times and each time I waited over 45 to 1hour. Sitting ","useful":0,"cool":0},"9FjgasZ-4LcTKOXBnEWplQ":{"text":"Great food even late night / early morning. Great service! Kept very clean during this pan","useful":0,"cool":0},"xDevEoyEFL30q1iSHmHnsA":{"text":"First time customers have no clue\nabout how this restaurant is arranged.\nIt is located in ","useful":0,"cool":0},"CdLuAOc09vQWGjxb63pJTQ":{"text":"WE LOVED MELBA'S!!! The food, the people, the vibe was everything we wanted. We were so gl","useful":0,"cool":0},"i6LmKBtnNxA3OCa7n-10mw":{"text":"I have to stop here every time I'm in the area.  Strong strong Daiquiris, and I'm not even","useful":0,"cool":0},"ALnwfFH6bkN00R1sMHnIDA":{"text":"Tried Melba's after a night out on frenchman street which made the food somewhat edible. I","useful":1,"cool":0},"pICUqL8h07c5M5xlGMYN-Q":{"text":"I thought this was going to be a win bc it's located far from the French Quarter and the p","useful":1,"cool":0},"xJRvRoZ7C-t_45Af2AsNRA":{"text":"Well../it's an experience.\nThe Po Boys are very good ,\nHighly recommend the burger po boy.","useful":0,"cool":0},"n9sw8E-H9WxQywORRTYMpg":{"text":"I have traveled to NOLA many times over the years with my former wife and then with my cur","useful":1,"cool":0},"0XmeLc-rFYKj-JSF7qX2PQ":{"text":"We ordered curbside, waited curbside for 10-15 mins, no one ever came. We went inside and ","useful":2,"cool":1},"biPSv3NuRFX5KkkYYb21kQ":{"text":"This is by far my favorite poboy in New Orleans!! I discovered this place only a few years","useful":2,"cool":0},"1UsbOFBtdzEjjxKKiVDPMw":{"text":"I ordered a shrimp po boy, and while the shrimp was good, it was a terrible sandwich.  The","useful":0,"cool":0},"l_fBLJuwYpMs4ALUIVYjcQ":{"text":"So the food is pretty good here but it's not the best ever and there are plenty of other p","useful":0,"cool":1},"VeW1_87oSexD1X2CoR0fRQ":{"text":"This place is an iconic classic, but it is admittedly not the best place in New Orleans fo","useful":0,"cool":0},"_E8kBRBK2mM-FEG9ngVUhg":{"text":"The customer service at Melba's is horrible! I was greeted by a lady who've never eaten th","useful":0,"cool":0},"O6lG_62saYt6I8_diU2nfA":{"text":"They sold the sack of crawfish I reserved (and paid for) to someone else. Ordering a sack ","useful":0,"cool":0},"H1sPECIYtHLUTQSEvnz23g":{"text":"Due to the fact that I really like the food here, and the owner reached out to me and apol","useful":2,"cool":2},"3abZuqPWzEmFl4PNgRv4Zw":{"text":"This is New Orleans! It was a treat to finally try the food here! They are well known AND ","useful":1,"cool":0},"m3m4YexM1gCnzUp2Cr0xIg":{"text":"We stopped by Melba's to get food to go. We walked in at 9:39PM and there was a line to ev","useful":2,"cool":0},"_pG7W4gEK-io9C6hKPwweQ":{"text":"The food was great!!!! Because of the slow service I received, I'm giving it a 3-star. Som","useful":0,"cool":0},"PdLfh0zYS-quzDttwq3X7w":{"text":"We came from Chicago for a few days and gave Melba's a shot for a shrimp poorboy. The serv","useful":0,"cool":0},"WjIcN1D6LxVJ3C38Ayg_gg":{"text":"FAVORITE DISCOVERY IN 2014\nYeah, shrimp po'boys are subjective but I love Melba's because ","useful":4,"cool":1},"nVU7Atpg-XbgCfP90iL9pw":{"text":"The food is not good but I guess it's better than gas station food. Majority of the employ","useful":0,"cool":0},"-Wsb_HP5eUsVq5fZ3tySfg":{"text":"Ate at this place while in New Orleans.  The food was awesome and the staff were friendly.","useful":1,"cool":0},"gN-e93To-KZrwVpLn-RqJw":{"text":"Waited half an hour to find out my order had been forgotten about. I ordered 14 pc chicken","useful":0,"cool":0},"geZyVCTk_mOu2ynurpipng":{"text":"I love to bring people here.   Good taste of New Orleans away from most of the tourist. Ev","useful":0,"cool":0},"xJJxasMheDD-Ce4IZkOnWg":{"text":"THEIR SHRIMP PO'BOY IS ONE OF THE BEST, because:\n\nI.  SIZEABLE SHRIMP are at least 40-50CT","useful":5,"cool":4},"WMfVht1Q01jtwYAbKypD3Q":{"text":"Awesome comfort food and people. Catered our daughter's wedding and everything was wonderf","useful":2,"cool":0},"ZJ5dpt-ZCOPLbxgfktt8-A":{"text":"I would give this place zero stars if I could.\n\nI don't know how this place is ranked so h","useful":0,"cool":0},"gMA-ls7yu63pmPAbH0wfKQ":{"text":"THE WORST FOOD I EVER HAD!!!! \nRed beans and rice cake with a big sausage i had to cut up ","useful":0,"cool":0},"a5XAvfdhGLGg-s2dT5a1EA":{"text":"Drove in and downloaded their app to order. Was offered a free daiquiri, which I accepted.","useful":0,"cool":0},"dUsiwrBZNvMETKVq4pRGVg":{"text":"First I would like to applaud on how little contact they have with customers. You order an","useful":0,"cool":0},"5t1VskRDrQRdGFE6_867VA":{"text":"If I could I would give this place negative stars. These people are extremely rude. They a","useful":0,"cool":0},"vcN6QzGMpBUphHqRHTx-yw":{"text":"My bf insisted we visit Melba's the moment we landed in New orleans. Upon arriving to the ","useful":3,"cool":0},"rDnYzURt-Ylg4FyQ5U77GA":{"text":"The spot! Went here on Christmas Eve,  staff were friendly and efficient. Food was great. ","useful":1,"cool":1},"oJQANaHoEJM4Wtcjop1e4A":{"text":"Mr. Wolfe, tonight I learned that old saying my Grandfather used to say, \"When the Cats' a","useful":12,"cool":6},"ts8wq-djnTR6WVayKYpHFA":{"text":"Openly refuses to require masks indoors on the laundromat side, in violation of law. Manag","useful":0,"cool":0},"GuR6JnXxHzSPpbw9dzzxsQ":{"text":"Food is simply FIRE ASF I ate it with my bare hands drunk off they daiquiris they also had","useful":0,"cool":0},"1jMudWckPpjYJ_7RG_2Law":{"text":"Ordered from here on Uber Eats after a full day of drinking on Bourbon Street. Was so happ","useful":0,"cool":0},"2jccIVQ6VkjVSJG9bC0xYQ":{"text":"Had the bourbon chicken over rice. The server went the back and poured a crap load of sauc","useful":0,"cool":0},"YyT6BfQMfXlXLsrU58EjYg":{"text":"This is one of the best spots for good food and fun servers all around good time here","useful":0,"cool":0},"7YHbBeYeJdtPQUhOCFk2_A":{"text":"Even BETTER than the last visit.\nFamily chicken x25 cooked fresh for our order, wonderful,","useful":1,"cool":1},"JqLj9UnBOZsAZCVrtjLaNw":{"text":"....I just waited 40 plus minutes to watch some ignorant customers argue with somewhat ove","useful":1,"cool":0},"sFDty82FLwcppzEYVcixIA":{"text":"Good lord this food is straight garbage . I ordered a three piece tender with macaroni and","useful":4,"cool":0},"1KCKPKXGrC_cMjcD4N5IYA":{"text":"The staff was amazing. The food was cooked fresh and with love. The two ladies and gentlem","useful":0,"cool":0},"jgRGMnO8akgqU6UxDlVotg":{"text":"Back when I was a meat eater, I would frequent this place in attempts to circulate my mone","useful":0,"cool":1},"v23QPm6-Ro8vlHGlqeyaog":{"text":"Okay, honestly, any place that is open 24 hours with Crawfish less than $3/pound is automa","useful":2,"cool":0},"-is3onr6dm5qyL1Y2QAqLw":{"text":"Customer service was horrible, especially the older lady that was the cashier. It's not or","useful":0,"cool":0},"zE9b-PuuDqPi1T5iaRkmfQ":{"text":"The service here is atrocious. The staff is horrific at completing orders, and the food is","useful":0,"cool":0},"_-hKaGxZh3250JV6Am4u_Q":{"text":"Shrimp poboy was very good.  French bread was authentic.  Wish they had oysters.  Staff me","useful":0,"cool":0},"ESNTEKHjILexE5Ze-AMgNQ":{"text":"When we travel to NOLA, we seek out those spots that cater to the locals, not to the biz's","useful":0,"cool":0},"zj9HVfcixHpK6Eg1Op7HJg":{"text":"I love this place.  But i was so dissapointed this time.  I irderd at about 10pm, mac n ch","useful":1,"cool":1},"0XCZb1jeVJlWi2JrgswD1Q":{"text":"Holy balls. This was not expected! I was like \"I'm hungry now and here is food\" well needl","useful":0,"cool":0},"Kqx0Wftxy9Qkad-7AswQrw":{"text":"Great shrimp poboy.  Great service I enjoyed everything.  As usual.  Always good food","useful":0,"cool":0},"gYyYc9SDcwfev38UwT-rKQ":{"text":"If I could give zero stars I would. My family ordered approx $170 worth of food and was mi","useful":1,"cool":0},"GlkybByvr91z29fMUb87YA":{"text":"As a NOLA native, I have visited this place multiple times and know for a fact that this I","useful":4,"cool":0},"GyNfq7-l6-EazOLcehVvmQ":{"text":"First of all I made a phone order and still had to wait over 20 minutes when I arrived at ","useful":1,"cool":0}}