{"ZyWs9FhKSjLkkY_cUx2ORQ":{"text":"I ordered Sweet and Sour Chicken, didn't like the idea the sauce was already on the chicke","useful":0,"cool":0},"i28ZTDbH7m4joBwYkzKN2g":{"text":"Yummy delicious and very inexpensive.   Food was hot and cooked to order.  Courteous and k","useful":0,"cool":0},"nJElD3hnY8NoCh10a0SLHw":{"text":"I give it four stars for fast quality delivery and good food with low prices. I ordered fr","useful":0,"cool":0},"322FlWI7L7LEnXARadehXg":{"text":"The food is fresh, made to order and contains no MSG.  Prices are great and service is eve","useful":3,"cool":0},"23L5u2FVemqzVgEOgvYqXw":{"text":"I ordered 2 chicken dishes for delivery. Affordable price yet tasty foods (I'm Asian so th","useful":0,"cool":0},"oYkgO4rr4waHYNHNySChxw":{"text":"Today was just not the day. The cashier that answered the phone just said, \"Hello...\" well","useful":0,"cool":0},"3ON5N7cfRY_bcGbDYc3aeQ":{"text":"Food is consistent for cheap, American Chinese! We always do takeout and have never had a ","useful":2,"cool":0},"Xj8lKx2rEBsIMiZ_Wm38CQ":{"text":"OMG the rich was good. But I ordered a large boneless chicken for 9$ that gave me about 6 ","useful":0,"cool":0},"kt8qMMIUzrma2-OesdXXpw":{"text":"The second time I've ordered here for delivery. The girl that answers the phone is very ni","useful":2,"cool":1},"achRdzJazzd7ASal9R3hdQ":{"text":"Updated review for their delivery service.  Placed an order at 6:53 pm.  Called at 8:00, t","useful":0,"cool":0},"iP2cqk6RZUURnJr46A_5wQ":{"text":"I was craving some Asian food during my time in NOLA.... let just say this was not the pla","useful":0,"cool":0},"pNq9g_0EZoJiB1w23zRbpw":{"text":"I was stuck at work and was starving. Since I was close to this place I called for deliver","useful":5,"cool":1},"2hEKj-qsULUNvDjDe1O0SQ":{"text":"It's the closest you'll find in the area to \"classic\" Chinese food in the area. Service is","useful":1,"cool":0},"caGVsKL0Gq-Nfk60dtjflw":{"text":"we got our delivery before our expected time and the food was still warm and delicious.  I","useful":0,"cool":0},"Hatr-ONlRFhQwKjMyqu_3A":{"text":"Visited New Orleans for the first time.  Found new china online.  They delivered to hotel ","useful":0,"cool":0},"jm56QbkAMJtSpgzYlTo3UA":{"text":"I'm on vacation and I was really craving mom's Chinese food so I yelped this place and cal","useful":1,"cool":0},"kSqO7xVI0VgdHk25SRD1XQ":{"text":"Delivery came 10 minutes ahead of schedule with piping hot crab rangoon and beef lo mein. ","useful":0,"cool":0},"cuO3ikL6fZzlBLSGpghQCw":{"text":"I order delivery from here a couple times a month. It's not *great* but there isn't any re","useful":0,"cool":0},"mNpI5jRZ2yaqan9HpZhp3Q":{"text":"New China is exactly what you are looking for in a neighborhood Chinese food restaurant.  ","useful":0,"cool":0},"P6HgDfaFxv6N13fj64jK5w":{"text":"Just moved here and discovered this gem from a friend! Very good food and great service! W","useful":0,"cool":0},"W0jsKpRf2yEeOE9CaM_ERQ":{"text":"TL;DR: don't order online delivery from here unless you're willing to risk them returning ","useful":4,"cool":0},"f3iYVVoLusWsN5wkvGo6mg":{"text":"My go to delivery. Friendly, quick, and pretty good food. It's no New York china town food","useful":0,"cool":0},"rqsiVxfk2A3eh6ge4r7XzA":{"text":"The food was sub par at best. Both meals were weird interpretations of bourbon chicken and","useful":0,"cool":0},"LQqisfITciWW9K-57iLEDg":{"text":"This is my go to Chinese restaurant. Granted, I only live a block away but I would probabl","useful":0,"cool":0},"QEkFgfDRrvJ-cGTiNhEgLA":{"text":"My favorite Chinese food in the area. Their stock fried rice is shrimp not pork which is m","useful":0,"cool":1},"xUOxu9RWAfNY5geznOERKA":{"text":"AMAZING. I placed my order of steamed dumplings, sweet and sour chicken and general tso's ","useful":0,"cool":0},"qsooVYccp6xJfmi9zLP_Mw":{"text":"Asked if the General Tso Tofu could be made into a lunch special, was told 7.95. Regular p","useful":0,"cool":0},"4IXXSQHIlm8gjQvMej1hvQ":{"text":"The choices on the menu are just about as mundane as they get... However, they're executed","useful":0,"cool":0},"w3xsX3nbTUQsqmGYypmEAg":{"text":"Well great delivery!  Chicken n broccoli was great! EGGROLL better than average... \n\nBUT t","useful":0,"cool":0},"XzBhdCWoU3X5prhXcZCu_Q":{"text":"Typical run of the mill American Chinese food. Easy for pickup, with easy parking. NOT the","useful":1,"cool":0},"IEnT12XbO602hPYvFtSjTg":{"text":"Food was okay considering price point. However, Won Ton soup too salty to eat. Wouldn't or","useful":0,"cool":0},"xfPkrp8LmaqH2Tr8eiyfYg":{"text":"Everytime we order from here, is stellar. the food is good and the delivery is very fast. ","useful":0,"cool":0},"MJO3V7qqCY5Vyv88gWW_sA":{"text":"Wonderful delivery Chinese! We had the 'seafood delight' and 'General Tao's Chicken'. Both","useful":0,"cool":0},"18ozGBB_kiuYJ_cwkzj8hA":{"text":"Pick up review only - very good General Tso's - which is my gold standard for Chinese take","useful":0,"cool":0},"gScxMZPTPZI1VqcDQznTfg":{"text":"New favorite Chinese food place in the city and They Deliver all the way Uptown!!!\nIt's a ","useful":1,"cool":0},"CyO8-717kDiQa1N78oOQxw":{"text":"Ordered delivery and received it in about 30min. Crab rangoon was pretty chewy and didn't ","useful":0,"cool":0},"OLzTgJo9h7wKaigIQFW42w":{"text":"This is some pretty solid Chinese right here. Had no clue this place even existed. Not onl","useful":0,"cool":0},"tL5_KVD_7db-2Ud1EXoeYw":{"text":"Took one hour to deliver. Food was warm not hot, of course. That, I expected so no complai","useful":2,"cool":1},"jrlDu6fOku2jDusl838TSg":{"text":"Good food delivered unbelievably fast. It could be due to it being Tuesday night but the o","useful":0,"cool":0},"p8CB_2-aqApeP4QhlovCvA":{"text":"I ordered sautéed bean curd and a sweet iced tea for delivery, and it was about an hour as","useful":1,"cool":0},"tK3OEYjKIFH2rHUfVc-0_Q":{"text":"Good food. Quaint inside which I enjoy. Never overcrowded with ppl. The lo Mein and fried ","useful":0,"cool":0},"T8h0kdhL2TuuhiYHE4o_bg":{"text":"My favorite hot and sour soup in the city. Their egg rolls are chicken rather than pork an","useful":2,"cool":0},"xMjkK0hxVTGBOQsVQd3cMg":{"text":"If your looking for a place for really good and inexpensive food, this is the place to go.","useful":0,"cool":0},"Abb4tzwraugROPP-SjqU_w":{"text":"Probably the best take out Chinese in the city.  The chicken soup is full of chicken veggi","useful":2,"cool":2},"5CZaOf3_90TNU8RgBlxO9g":{"text":"Very good! The food was fresh, the service was nice & it wasn't terribly priced. Overall I","useful":0,"cool":0},"iSl9hensSc6H4JEf5AZC9g":{"text":"I dined in. The prices are cheap so my expectations were low but the food was excellent. M","useful":0,"cool":0},"6nll9Hxt179qcd2hSPdyYg":{"text":"Updated review for their delivery service.  Placed an order at 6:53 pm.  Called at 8:00, t","useful":1,"cool":0},"BRaUxme9fy9Vajewjwin1w":{"text":"Fairly standard continental-US style Chinese food. Good food, but nothing stands out. You ","useful":0,"cool":0},"c-GGq39d-pgcK-3dxhZBGQ":{"text":"Tried the Mongolian beef, the honey chicken, and the four season specialty. The four seaso","useful":0,"cool":0},"WbcUFVtoLofTHc4_hkFrFQ":{"text":"Super fast delivery and surprisingly fresh food. This place is terrific!!  Especially for ","useful":0,"cool":0},"bAOR_Fhdwchrtv3-Zx-0zw":{"text":"Welcome to the hood! We ordered the Shrimp w/ Lobster Sauce and General Tso's Chicken. Pre","useful":7,"cool":0},"crFgGco531xhOHwbvTyfdg":{"text":"This was a last minute dinner choice because I got sick but it was definitely worth it. I ","useful":0,"cool":0},"VWWBomt54AKl-JF_9A1Ovw":{"text":"Don't get the Singapore Mei fun. It tastes like boiled noodles and veggies in a pot of Goy","useful":0,"cool":0},"UcMuwV0MEPBaUOB0IrGjYA":{"text":"This is one of the better Chinese joints around. The lady who answers the phone is always ","useful":2,"cool":0},"TnZjW98uyvzR5S8XM6_eKQ":{"text":"What a pleasant surprise !\n\nI had been seeing this strip center storefront restaurant on m","useful":2,"cool":1},"ryDurHe7yYm95Q_eoXF5BQ":{"text":"I had the Mandarin Chicken.  The gravy was yellow and very thick.  It was a \"to go\" order ","useful":0,"cool":0},"SigKWzn64-tovFx2VwrUrQ":{"text":"It's an out-of-the-way strip mall Chinese restaurant with about 8-10 tables, not always th","useful":0,"cool":0},"ZWDVwc7pjBizo6_BeIA5Ww":{"text":"Have done pick up lunch several times using the Yelp app.  Perfect amount of food for lunc","useful":0,"cool":0},"CTkyziLnPQbT4VJOXKG51w":{"text":"I think I can cook betty than this restaurant. This is the worst Chinese food I ever have.","useful":0,"cool":0},"Q_MHOE05T7vFOpZnNPoq4w":{"text":"Solid Chinese for a cheap price compared to the others in the neighborhood. This place wil","useful":0,"cool":0},"fwxXIczD_2WoeTlSARQrZw":{"text":"New China does not use a wok to prepare it's food. The fried rice is boiled and the chicke","useful":0,"cool":0},"RvQD6yf2cZ7eWuZfy9fWtg":{"text":"Ordered delivery.  Very friendly and helpful person on the phone made suggestions and desc","useful":0,"cool":0},"YKemupwtDm9LTiG1A0zuOg":{"text":"An average Chinese place. They have the basics like fried rice and different ways of sauté","useful":0,"cool":1},"9epmP4tp6I52C0FnGXZnMg":{"text":"We used to be regular customers of New China and frequently ordered out for delivery.  The","useful":0,"cool":0},"S6_V6137KKZcsOGRSsCokg":{"text":"They know us as frequent customers. Always pleasant and my kiddos love their friend rice!","useful":0,"cool":0},"VyVsMxBKv496TbknNHEFwA":{"text":"Thank you for fast delivery always! This place has always come through. Solid spot and con","useful":0,"cool":0},"HK3NJqWTpgS-cch9Z3Zd4Q":{"text":"I order quite frequently from this restaurant and they have the Best \"Hot and Sour Soup\" a","useful":0,"cool":0},"JfpRPnPmr4Yueg_WZnLOwA":{"text":"Delicious food ready on time and plenty to go around!  The sesame chicken was flavorful an","useful":0,"cool":0},"DjQhJ1RjmV_O1MXqwQcvyA":{"text":"For my lunch order, I received a very tiny portion of Mandarin chicken and a ton of fried ","useful":0,"cool":0},"P3L9mbmCli5hn7JUGWhbWA":{"text":"Their customer service for delivery is great! They even called to ask if I'm sure I wanted","useful":0,"cool":0},"q2hp69c_BPBrwbBQYEA3MA":{"text":"Ordered delivery for 2 hungry and travel-weary peeps on a Sunday afternoon after coming ho","useful":0,"cool":0},"L8HFVvt8dYVEpKyAG31m6Q":{"text":"3.5/5 cheap, reliable american chinese\n\ni've been frequenting this a bit. there's a part o","useful":5,"cool":3},"eK0JmlB_Rx551LExt9PCXA":{"text":"The food was awful and we waited so long. I wouldn't recommend this place. Lots of oil whe","useful":0,"cool":0},"7tL2BYX-5QROVvOL67LAbw":{"text":"We love this place, it's our go-to delivery Chinese spot. The price is right, the food is ","useful":0,"cool":0},"PGGukk98MqTx13eUhyIGcw":{"text":"I love new china! Cindy the owner is very sweet! I always get the general tsao chicken! SO","useful":0,"cool":0},"PeRED_FuIVcbbF-hlReFcA":{"text":"Perfect spot for a quick lunch! I visit often since it's just a couple of minutes drive fr","useful":1,"cool":2},"A_A1tspmbzB7ItcHp94kHA":{"text":"Above average Chinese food. Their egg rolls are great. I love their homemade spicy mustard","useful":2,"cool":1},"8ABU9yWci5FRCbdCpcPwYw":{"text":"Miss Sharon is great ! She's so sweet and always does a great job making the food. I alway","useful":1,"cool":1},"qt7DQtBFl2w9cdjFb_g0bw":{"text":"I'm highly allergic to shrimp and my chicken Friend rice had them in it. i couldn't even e","useful":0,"cool":0},"2wevNXsQULYbT1GQ-TDsxg":{"text":"First meal as a New Orleanian was here since my apt is nearby and it definitely satisfied ","useful":0,"cool":1},"E203me2izJMxzBy3trVXHA":{"text":"Great prices, but you pay for what you get. The pork fried rice tasted like it had bbq sau","useful":0,"cool":0},"wtJufIZvPe9z61mzxpQL8g":{"text":"When you have the need for some good Chinese this place will hit the spot. Sugary sweet an","useful":3,"cool":3},"mp1pDUcrmOJXMdTrtVi_0g":{"text":"Ordered on door dash delivery. We were visiting New Orleans and did not feel like going ou","useful":1,"cool":1},"fxWUemWmJ_1-2kHhYbfOEQ":{"text":"Food is really good here. Also cheap which is a huge plus. The owners are very very nice p","useful":1,"cool":1},"E-Hzxqi-ss0cVt4PqkgXvg":{"text":"Great food and fair prices. Will be back for sure. The hot and sour soup is some of the be","useful":0,"cool":0},"qvypYfYOgVNIiWT7oOKYAg":{"text":"Always had a great experience here.  Staff is very nice, and the food is excellent.  Nice ","useful":0,"cool":0},"z5U8crR_IWUdvdIT9VmRqQ":{"text":"We really enjoyed their food.  It tasted pretty authentic and made with that old Shanghai ","useful":0,"cool":0},"Q-ugHRrLNT_ErDqsdesptQ":{"text":"Good little spot very tasty food. Very reasonable for the quality. Nice quality meat which","useful":0,"cool":0},"tcg3xxl4g33uvAu3LVEfKw":{"text":"Oh I little small treat But I will visit the restaurant again the owner was great And my f","useful":0,"cool":0},"hh8iQkGyoMTYx7yLNz6xQA":{"text":"Super reliable, fast, hot and large portions. I need to venture out and try more of their ","useful":1,"cool":1},"1CXC8z4D8R5HJdz6tubsIw":{"text":"The go-to spot for Chinese takeout in New Orleans!!!!! Everything is consistently good (fr","useful":0,"cool":1},"0X1pwU-j--cxSmSwYkxMHA":{"text":"I had a more solid experience for dinner when we dined in last week. Our server was very s","useful":0,"cool":0},"-BjQCk9KH6sIwHhxNdPMQA":{"text":"Pretty good food, took over 2 hours to get to me though which was the biggest negative. Fo","useful":2,"cool":0},"OQvql5Ex2M-mHDn5KnXXBA":{"text":"Love their veggie lo mein and tofu! I've eaten at multiple chinese spots around the city a","useful":1,"cool":1},"XO0BD29HrcYuffhRc0_hyg":{"text":"I didn't enjoy.   Shrimp fried rice was over cooked/dry, hardly any shrimp or veggies.   C","useful":0,"cool":0},"nu-5-9-DtorPGxylb5B-oA":{"text":"I got delivery through door dash for New China and was pleasantly surprised. The food arri","useful":2,"cool":1},"nBd-Has5uHyDt5fuw5twhg":{"text":"MAN DO I MISS MOON WOK!\nA well regarded local chef and friend warned me when I moved back ","useful":3,"cool":1},"dQshnhUOAbPZZ9ckcRfz6g":{"text":"The sweet and sour chicken was fucking amazing!!! They didn't take too long. the food was ","useful":0,"cool":0},"d7vH8EjMDitAHQYGD9BaIA":{"text":"They are always fast and delicious! I get the sesame chicken and chicken fried rice and bo","useful":0,"cool":0},"tUpEp4Ej8eUvMMwvKneRzw":{"text":"If anyone suggests Chinese food in New Orleans, I always recommend this place! Consistentl","useful":1,"cool":0},"j_r1TWs3LWRIN2DzY8zEEQ":{"text":"This spot is great for cheap takeout lunch. I call ahead and everything is ready in 15 min","useful":0,"cool":0},"9qMO5BZOneWUXQV32B0dZQ":{"text":"Good American Chinese food! No frills, cheap, good eats. Its not the best Chinese food I'v","useful":1,"cool":2},"5-0PQDaRLtyQ3YB15qopXA":{"text":"This is my favorite chinese restaurant in New Orleans! The woman who takes order is EXTREM","useful":1,"cool":1},"7nFW52irM5xFdllhW1vCBQ":{"text":"Probably my favorite Chinese take out spot in New Orleans. I've eaten both in the restaura","useful":0,"cool":0}}