{"wpmDqJx1P_Gjwc8cSMyO_w":{"text":"Fantastic Italian - add the Ocean Sauce for local flavor.  Accommodated our party of eight","useful":0,"cool":0},"FyZMLmMfsFZxldkz3mqgQg":{"text":"The ALL of the appetizers are just amazing... and ocean sauce... to die for.. I love this ","useful":2,"cool":0},"IODL5BzPTUiZ62VaqZYA0Q":{"text":"Adolfo's has got a pretty intimate vibe. After passing a bar to the second floor, you're t","useful":6,"cool":5},"uvcyVDZkk8wefgZ3xWGFtg":{"text":"Tilapia, ocean sauce, perfection.\nWorth the wait, especially if you're waiting in the bar ","useful":2,"cool":0},"U73jhlViePefqc-BEjHvrQ":{"text":"Good food and atmosphere was pleasant except for the surly waiter, who had no sense of hum","useful":1,"cool":0},"WGZSoF-FOEqNdydAgUHWUA":{"text":"First time I went there and had the chicken parm, it was awesome. The garlic bread was so ","useful":1,"cool":1},"prmW38EY5HAI27FT7J3W_Q":{"text":"Food was decent. Cooked fresh and not saturated in salt. But we had to ask for everything.","useful":0,"cool":0},"BdqUGuZJ6ihvJXvLJh4lTA":{"text":"We waited for about 1 hour on a December Saturday night. But it's totally worth it. We had","useful":0,"cool":0},"JI27zvj2dtETlFWUrV8fzw":{"text":"Where to start.   As we waited for this establishment to open, we notice the staff carryin","useful":0,"cool":0},"wULrLAuEswXc_CxIaQ9i3A":{"text":"Stick to the menu items or ask how much the specials are.  I think I was taken advantage o","useful":0,"cool":0},"oOFwDpw2xNKvsjazvlxyMQ":{"text":"We came here on a whim and I was glad we did. They don't take reservations and on a Thursd","useful":0,"cool":0},"adWT1ZnAWE7jy0j0uco78A":{"text":"Everything was delicious,  except for the complimentary garlic bread. The eggplant parm ap","useful":0,"cool":0},"O6zLnBk7xkUpZJWhXjNQVA":{"text":"We went in January and we literally had to warm our hands over the candles. The Ocean sauc","useful":0,"cool":0},"SOyart_QmXx6eKHEn7C21g":{"text":"I really don't get how people rave about this place. Maybe we were really REALLY unlucky b","useful":1,"cool":0},"Zwco3vEZqiWSepNz4eBPEg":{"text":"Adolfo's Apple Barrel is a quaint little joint hidden behind some trees half a block from ","useful":0,"cool":0},"fzgW_A2nBp6oBhURI4Twuw":{"text":"Hands down my favorite restaurant in New Orleans. Get there early because they dont take r","useful":0,"cool":0},"b0c6xldxjGQ1QKWt594WXQ":{"text":"As you may have already read this place is small so pack you patience and get some drinks ","useful":0,"cool":0},"YjZ1rvjd6hZiyzEjNxJY5g":{"text":"I love the mussels here. My favorite Italian place in the city for many reasons. It's not ","useful":1,"cool":0},"Sss8HLfMnTrJsGACXNvatw":{"text":"Beware the giant pork chop!\nWe loved our Adolfo's experience! We wanted to eat early since","useful":2,"cool":1},"j0_4oowbBG2OnKQYTXb2YA":{"text":"Great area of New Orleans and cute little venue with music and a bar downstairs and the re","useful":0,"cool":0},"WNeWym0peWl0jy902nVuYw":{"text":"10 tables, 2 chefs, 1 waitress, and the owner waiting tables! Can be a long wait but every","useful":0,"cool":0},"Axpc2Egkle5HNWS7Y9pQEA":{"text":"Excellent food, great service and perfect New Orleans ambiance. The restaurant is up a fli","useful":1,"cool":0},"KPWwMk9OdUOsJJar9dk4Sg":{"text":"Amazing food. Old time italian feel with a Creole twist.\n\nAdolfo's is perched directly abo","useful":1,"cool":1},"Y6hW0gjH7LROr_BuzOEELw":{"text":"A must if you come to NOLA, been to this city 5 times now and I've eaten here 4 out of the","useful":0,"cool":0},"D8H414CKaLhmdiNOrd1BWg":{"text":"Still sitting at my table and in love with the food! We did wait a good hour plus for our ","useful":0,"cool":0},"mFGelLRJK9IPxuF9PcTBFw":{"text":"This restaurant!!! The best in New Orleans!! The best hole in the wall!! The food is fanta","useful":4,"cool":0},"QoOh-IYDLf-LqShqg-ZGWQ":{"text":"OMG! I had the steak Madrina which comes topped with shrimp scampi and it is to die for!!!","useful":0,"cool":0},"_Q_prl7G3wu03DBNSkcjrg":{"text":"Fantastic little gem - that needs to be searched and looked out for like a treasure. To fi","useful":2,"cool":0},"xDPFmjxyk529a18u7jHN5g":{"text":"Absolutely phenomenal food. It's hard to believe that quality of food is prepared in that ","useful":0,"cool":0},"U5rQwijhUF80BVoaR66pDg":{"text":"Disappointed by this place. After waiting 3 hours for a table, we expected stellar food. I","useful":3,"cool":1},"qw2r-rzkhD5gshoQkzbiXw":{"text":"Extremely disappointing. This is a tourist trap - please note most of the reviews are from","useful":0,"cool":0},"j7tevv2VvYBTbMqwUvzApA":{"text":"I had the rack of lamb special, and it was fantastic! Not fancy, but very good. We had to ","useful":0,"cool":0},"D8XVOrmZ3d9zX9XgLe31vQ":{"text":"Do not eat here.  The wait was long due to the extremely small room.  The decor was dark a","useful":3,"cool":0},"b_N_IMQ4Y5LYD-DAgNGf_Q":{"text":"Ok, basics were overlooked (no bread on the table, no pepper mill either) but our waiter S","useful":0,"cool":0},"taiJfwvrrEEauVIwLc7b1g":{"text":"I think the food is highly overrated, frankly. Had their recommended dish with ocean sauce","useful":1,"cool":0},"eYI2Yv4R1nkrokEoobm4cw":{"text":"We went here based upon recommendation from the door man at DBA after seeing my friend, th","useful":2,"cool":1},"JpyyeyBVbHRFfliSwJuH1A":{"text":"Full 5stars!!!!!!!!!!!!!!!!!!!!!! Sooooooooooooo delicious !!!!!!!!!!!everything is good!s","useful":0,"cool":0},"_-qn6c0_0rai7M2hAmdLsw":{"text":"My husband and I strolled down to Frenchman street for the evening hoping to have dinner a","useful":5,"cool":0},"-Ns1C9Mg_Zxq48W9d31_Gw":{"text":"I ordered my steak rare it came out beyond purple.  I ate the Ocean Sauce around it and wh","useful":0,"cool":0},"cQTziKxRhCMkgWO_eUXBrg":{"text":"Two words.... ocean sauce! You can put it on anything but I recommend the grouper, delicio","useful":0,"cool":0},"wIJerTc71dH_dBB-WHzOSA":{"text":"Overrated! I arrived early and waited in line prior to the restaurant opening to guarantee","useful":0,"cool":0},"edo5shdCvqM-4cgCPxEd_Q":{"text":"Worst restaurant in ever been too. Two hour wait. Served drinks out of dirty glasses. Food","useful":4,"cool":0},"L0Kr7nT0hWyWxlsB7uNaWg":{"text":"We heard about this place from a friend and it was absolutely amazing! Remember that appea","useful":0,"cool":0},"hWD5CjN1xp__8dnK_tXzVg":{"text":"Possibly the best seafood dish I have had EVER!  One of their special for today was sea ba","useful":0,"cool":0},"vxvvd1Tbh22_Ncl1ppyR4w":{"text":"Described as Italian/Creole food, this place serves up pure deliciousness.  Adolfo's is a ","useful":0,"cool":0},"9DBOprFqw-vao_p3AOmXKA":{"text":"Adolfo's Restaurant is an institution. They have 12 tables, a wait staff of 4, and no adve","useful":0,"cool":0},"S4KgTr5fqP6L1faYXdcW1A":{"text":"Tried to eat there two nights in a row because our friend said it was her favorite. First ","useful":0,"cool":0},"QAEiGgqUc-Rrt3GsSa5ddQ":{"text":"No question... some of the best food in New Orleans. When I visit New Orleans, Adolfo's is","useful":0,"cool":0},"7yfu7-6UAqi76KreUvURZA":{"text":"If you are a foodie, this is not your stop. The space is cute but the \"ocean sauce\"??? Dis","useful":3,"cool":0},"ZdxpLMOy4pH5WfMDrRlxOA":{"text":"This place was a dive and the steak was awesome! Worth the wait. Staff was really friendly","useful":0,"cool":0},"JEynbEM0b97LG_ekW82sAQ":{"text":"i had almost forgotten about this place - it's been so long since i'd eaten there and it's","useful":3,"cool":1},"3KJN9Qj2LaOqYyNALaXhxg":{"text":"So as part of my \"NOLA Food Tour 2018\" I decided to stop here and check it out per my cowo","useful":0,"cool":0},"xlZ5KHVM3HGMA6a2vv7OIA":{"text":"Excellent food, great service. Rack of lamb and fish with shrimp and crawfish. Helpful rec","useful":1,"cool":0},"6NaOLY35FlMIHY43LBldvw":{"text":"Wow! Great surprise. They don't take reservations, but it's worth the wait. Food was amazi","useful":1,"cool":0},"VNEMa01iLK80z9gQZQ-Ocg":{"text":"Went here for a girl's night, and it was a fantastic choice! Ocean sauce is definitely the","useful":2,"cool":0},"5CjhDzhpuQHsDeSiIa0XlQ":{"text":"The flounder with ocean sauce is so good. The salad was so good and the crab cannelloni ab","useful":0,"cool":0},"4HW4wefWPehA17Pct861Yw":{"text":"I have never had talapia this good. I can't say anything negative about this restaurant. I","useful":0,"cool":0},"R__s8DzjLPMj3Ostl1eFcQ":{"text":"I heard a lot of hype about Adolfo's but unfortunately it didn't live up to it. I personal","useful":0,"cool":0},"dZYyzNnNhJYVCg-qnf_ZKw":{"text":"This place was such a little gem! Located down on Frenchmen street \"where the locals go\", ","useful":0,"cool":0},"9qNMqASxAcfzIdjJ02j1ig":{"text":"Amazing food in a quaint dining room. Well worth the hour plus wait. Great double cut smok","useful":0,"cool":0},"Teho4fDlt6rMNRujjyZEsQ":{"text":"Amazing!  Get the ocean sauce and you won't go wrong. I'd eat a shoe with that sauce- it's","useful":0,"cool":0},"qTF5ZJ37nb-0CBl4j-l1lQ":{"text":"This place was a great find and food and service was amazing I would for sure come back ag","useful":0,"cool":0},"jg5tifc1YFeo06GBI-dRpQ":{"text":"I feel like I'm reading about a place in bizarro land, in the other world.  The Adolfo's I","useful":1,"cool":0},"g0365ldqdQP4UQ2k_pwalw":{"text":"Really really good seafood. Definitely some old recipes here. Amazing food, every time I v","useful":0,"cool":0},"dhCvl8GAjakbpu062K5DCw":{"text":"Delicious combo of creole and Italian. The dishes are on the heavy/cream side, so don't be","useful":0,"cool":0},"NZ3-S0F26OS_rQv3lNTUIw":{"text":"Your first time here, GET THE OCEAN SAUCE ON WHATEVER FISH YOU WANT. It is RIDICULOUSLY de","useful":0,"cool":0},"2scUg9ubIvsO5_ECMYa9gw":{"text":"My husbands lamb was outstanding. But if you have any allergies or ask for something not t","useful":0,"cool":0},"SBYIDRrO82lSB_Gii-tvKA":{"text":"We waited 2 hours to eat here! \nFood is soooo worth the wait. Especially if it is your fir","useful":1,"cool":0},"XGdTWqeryNnJwgVIWKprUQ":{"text":"This is the place to go! Service from Caroline was fantastic, i only waited 10mins to be s","useful":1,"cool":1},"j83D7xhT8QM_8nc4BHoYYQ":{"text":"Amazing! We stumbled upon this treasure on accident while we were in NOLA. The mussels, pa","useful":0,"cool":0},"7GnZwy62CMLWE2Qj9aTgDQ":{"text":"Somehow I feel like I was having a bad day when I ate here, because of all of the rave rev","useful":1,"cool":0},"oArtc_ieeQO94RkTx-znLQ":{"text":"Stumbled upon this little gem.  Loved the rack of lamb and the hub's stuffed flounder.  Oc","useful":0,"cool":0},"WkfU4jdIUoKtCxqECJdqzA":{"text":"Yes, the food was AMAZING. We had the cannelloni with crabmeat and corn for appetizer, and","useful":2,"cool":0},"Iyiw5I-x0V-jp_ly0XMUNA":{"text":"This place is so special! The service was great. I had the mussels and I couldn't finish t","useful":0,"cool":0},"nF_rH2gqhIadlID21R5Glw":{"text":"This is more of a review of my overall experience there. First off before I vent the food ","useful":0,"cool":0},"ceEe7fsvOptrn4g_TR9lQg":{"text":"Hot Damn, That's hot, I think.  This place is unique and a must if you are in New Orleans.","useful":1,"cool":1},"niyabPH2oeqAOM49YNzJsw":{"text":"Charming TINY place on Frenchman.  The wait is long, it's loud, and super crowded inside b","useful":0,"cool":0},"CiQB5O5e-gjyshzJe19rmg":{"text":"Adolfo's is an A-OK restaurant to enjoy some Italian and Creole cuisine in the French Quar","useful":2,"cool":0},"FL7uc2Fd68gEgqJJbZpqfA":{"text":"I nearly licked my plate clean! The corn cannelloni with crab meat and ocean sauce is DIVI","useful":1,"cool":0},"5JdAgUpJOpMoJJvkPwPJaA":{"text":"What an awesome experience. Found this hidden gem only because we were in the area and I d","useful":3,"cool":0},"Bh_hivkMzLmJOnep4agY8w":{"text":"Best kept secret in New Orleans. No matter the wait put your name on the list, go downstai","useful":3,"cool":0},"TA3bg5S790BkYBxU-IafOg":{"text":"Went for the first time and the food was very good, very authentic. Had the rack of lamb a","useful":1,"cool":0},"Vy4NT-VNgLRTGJNYpLL2kg":{"text":"I came because of the Yelp and was not disappointed.  The little place was very packed - w","useful":0,"cool":0},"2mSd269F5OY_sAnnxZDA9A":{"text":"What a HUGE disappointment! Do NOT waste a meal here while in the French Quarter. I was to","useful":4,"cool":1},"y3aqF6QXHKAftT3Z1lDI-w":{"text":"Way over rated.  Cash only, bathroom that should be shut down by the Board of Health and i","useful":2,"cool":0},"MoaDCYzgOEWF6DmYV0Jtzw":{"text":"Stuffed sole fish special was incredibly tasty.  Big portions so I took half home as takea","useful":0,"cool":0},"qIBEQce446_22nrShpBXtA":{"text":"If you like dining with cockroaches and weird waiters that steal your water midway through","useful":5,"cool":0},"J_kPS_ytoZbfSrYwafqHzA":{"text":"Service was fantastic. The canollini appetizer was very good. However my steak was a hocke","useful":0,"cool":0},"lsBuFqt4-v56fAVX8uhjJw":{"text":"This is one of the best New Orleans/Italian style restaurant I have been to. I have been h","useful":0,"cool":1},"LrKEPLolGOjM5eaAVO3qTQ":{"text":"AMAZING! Long long wait (and on a random Monday night too), but go to the apple bar next d","useful":0,"cool":0},"I70bwvVahXreyLp07wLfgA":{"text":"What can I say - small place and only accepts cash- who cares when food is so good!  We al","useful":0,"cool":1},"isnrQfcx5zd70crXXArMrw":{"text":"I am very conflicted! It was freezing cold in the restaurant and I mentioned it twice with","useful":0,"cool":0},"eaS-zVHJlvl_Qb4fg098Ug":{"text":"We have visited NOLA for the past four years, but had never tried Adolfo's before last nig","useful":0,"cool":0},"z4QoiulrLqABiUY9d2kvVg":{"text":"Great little place!  Live Music down stairs, Italian food NOLA style is awesome!  Differen","useful":0,"cool":0},"jiGpMKwp7jLevnp2rr7UVQ":{"text":"I'm not a seafood person, but now I guess I am now thanks to Adolfo's. There was an hour w","useful":2,"cool":0},"RujVA6KPzGrEdLkg9CmkvQ":{"text":"Perfecto!  What more can I say about this place.  \n\nI traveled to NOLA last November and t","useful":0,"cool":0},"EMdEsy6Sj8SihUgvjZogvA":{"text":"Amazing! My best dinner experience happened right here: stuffed flounder with Oceana sauce","useful":0,"cool":0},"4ke6ofoek7gK5vpRS60JxA":{"text":"The space is awkward and very loud (definitely not the place to go if you want to have a c","useful":0,"cool":0},"L1b1oPLSyzheiwz_v-LsYQ":{"text":"This little gem was everything my brother who lives locally promised it would be. The food","useful":0,"cool":0},"RjizP_M702WKb4ZG97CD9Q":{"text":"Believe the hype!! The lamb is the best lamb I've had. The sauce is where it's at. Even th","useful":2,"cool":1},"5q-bWeW6vkPfWi_KDLNSEQ":{"text":"A friend of mine asked me if I had ever been to Adolfo's, and since I had never even heard","useful":5,"cool":4},"b809jpaVygV8_eD57ZLL5Q":{"text":"This was our best food find in New Orleans.  They have amazingly fresh fishes, a delectabl","useful":0,"cool":0},"doU2CWX9IVfOfoYS9Sk8mQ":{"text":"Perfect little italian restaurant nestled in a small neighborhood outside the French quart","useful":0,"cool":0},"7fed4fGEDIZZCOduEfZaSg":{"text":"Very cool, small upstairs place, above one of they many crazy bars along Frenchman.  The f","useful":1,"cool":0},"NzD2_iApdC9N2nUEFxNiLw":{"text":"My wife and I got lucky enough to arrive just as the doors were about to open.   We were s","useful":2,"cool":0},"OIWtDNNlHFG-m1lmJaEztQ":{"text":"This place is absolutely delicious.  As a native of New Orleans, I feel like I have been t","useful":0,"cool":0},"bdOkRXhkg2lvy3q7lRb4Dw":{"text":"I didn't even like fish until I ate at Aldolfo's.  The first time I came I ordered the Par","useful":2,"cool":2},"VSM_obL7XkbF4B31yqz0mw":{"text":"Waited for 2 hours for a table, the bar downstairs is crowded and loud, and the service is","useful":0,"cool":0},"LcneSvgaRKQ4ZkNI0pTrcQ":{"text":"This restaurant is amazing! The fusion of Italian and Creole cooking is both creative and ","useful":2,"cool":1},"6p0diFS0PYnVvARHCpONOA":{"text":"Place was amazing! But you have to come really early to get a seat. Limited space! As soon","useful":0,"cool":0},"xnkDyXweGUf0PbOXbuqf_w":{"text":"Just the best!.  I never had a bad meal.  The service is great and so is the atmosphere.  ","useful":0,"cool":0},"KN3sp9L2ll0hEOXOf7ivdg":{"text":"Loved this place. great food, great atmosphere. a bit pricey, but the food is worth it. so","useful":0,"cool":0},"DrOhfImFoQ_7ZRvC0kD_ng":{"text":"I'd like to give this more stars but we walked in at 915p (they close at 1030) to the foll","useful":7,"cool":0},"2T8IGMQWqC4qvTOhHO6c1w":{"text":"We had a awesome meal and James  was great. Anyone in town needs to eat here.!!!!!!!  The ","useful":0,"cool":0},"402sNpKDT9f0mvW6wbZ7uQ":{"text":"Upstairs from Apple Barrel. If you get there right at 5:30, you should get a seat. People ","useful":0,"cool":1},"qDep61cbFWG6fDAYObU4_A":{"text":"This place was amazing. Takes cash only but the food was great. Service was on point.","useful":0,"cool":0},"m4CJB2cfQJju5X6OK2ac8w":{"text":"The best meal I had during our stay in NOLA. Great selection of Italian dishes (the crab c","useful":0,"cool":0},"lbQEPCCMYUnMiuDM4bXSNw":{"text":"This was never designed to be a tourist trap! It is a local bar for locals.  The food is g","useful":0,"cool":0},"gvisPwAwcNKoB-T0m_vD7g":{"text":"Food was good. Take cash. Noisy from the bar downstairs but fun if you don't want to talk.","useful":0,"cool":0},"yT70M9xRvk2azRx64bdz2Q":{"text":"In a town that is uniformly hospitable our experience at Adolfo's was anything but. They d","useful":0,"cool":0},"KAyDIkygo3lnduYx-FOM5w":{"text":"This place is an institution. I felt like the floor is slightly tilted. My husband ordered","useful":1,"cool":1},"meRou1j2z7wgBLel_TFfFg":{"text":"Wonderful meal and Isabel's charming presence as our waitress made our 1st anniversary the","useful":0,"cool":0},"yw3vixbJe2AGiGx_wtg69Q":{"text":"Great location right on Frenchman St above a nightclub and between several others. Had the","useful":1,"cool":0},"aA0AJy--DN-jbOfEf491sw":{"text":"Terrible.  \nThe hostess said the wait would be 15 mins and it ended up being 40. This is a","useful":2,"cool":0},"9K2Hu7T_aGSAbW706EnVwg":{"text":"This place is awesome. Nemo was excellent. My eggplant parm was one of the best I've had.","useful":0,"cool":0},"Upq61g3aaD3pMI0K1ca2rg":{"text":"What a great experience,  had the grouper with ocean sauce, strip steak with ocean sauce a","useful":0,"cool":0},"24nb3Nc7ZJLtFnqbhYRohg":{"text":"Do not believe anything bad you hear. If you are looking for a large, quiet, expensive whi","useful":0,"cool":0},"VCxF52T40g8MsvYb6ssQ2w":{"text":"Best dinner we had the entire time in New Orleans. The service was excellent and the atmos","useful":0,"cool":0},"ph2Cq-9Hqow41fjNjS1abw":{"text":"Lovely little mom'n pop restaurant on the top floor of the (insert name of the music club ","useful":0,"cool":0},"CEqZ3DQbM182aY1o72lPew":{"text":"The ocean sauce is WORTH THE WAIT!! Tiny little restaurant nestled above a bar - food was ","useful":0,"cool":0},"DDzZm_sbkDkjag_TaZ89bg":{"text":"New Yorker here visiting New Orleans for the first time, and was told by my in laws to hit","useful":0,"cool":0},"EWete1tTjQdyhLe7yJAlcg":{"text":"Got this recommendation from a local and I am thankful I went! \n\nI'll be honest it did not","useful":0,"cool":0},"yKmm8URF7NLc0PK5sR0UgQ":{"text":"I gave this place three stars.  Two for our darling, energetic, attentive waitress, Bree. ","useful":0,"cool":0},"1wg_og9uuO-XCiy1R2lkrw":{"text":"I lived in New Orleans for eight years. I miss the food at Adalfo's on a weekly basis. \n\nB","useful":2,"cool":0},"bGAdDj-2NL1L2j4YW1rsLg":{"text":"The Chicken Tyler piccata was amazing and the Steak Manny was ok. It's a pretty small plac","useful":0,"cool":0},"4gy2BqRU1g9eB5pJvmoEeQ":{"text":"Adolfo's is in a fantastic location a safe distance away from Bourbon and close to some gr","useful":3,"cool":1},"DacrOExUhWhcBrDF7qpLtw":{"text":"If your looking for good food, a great environment, and...good food, look no further! This","useful":0,"cool":0},"N-tdF7xHUPTV9hoTHUwfRw":{"text":"The ocean sauce is amazing, had it over salmon! Great place really liked the atmosphere an","useful":0,"cool":0},"YU6lzrugg1Acl25tGkWXpQ":{"text":"I ate here twice in a week. I had dinner with two NOLA-area friends on a Thursday night; t","useful":1,"cool":1},"Xk8iwxOPDZViV-bLfbNsCw":{"text":"FYI: CASH ONLY and open for dinner only. Their veal special with ocean sauce was a good si","useful":0,"cool":0},"fvBvQ8kwBIJO_pQnMMfrBA":{"text":"The mussels appetizer special was absolutely amazing! This is definitely one of my favorit","useful":0,"cool":1},"En3hxYIsKZNXTi7kvrAHZQ":{"text":"I can't even start to explain the experience I had. Hands down the best dish I have ever h","useful":0,"cool":0},"tnPofBT2t3EnWmZBMWyZAg":{"text":"Warning. ...the wait is long (we waited 2+ hours). That was not the worse part because I d","useful":3,"cool":0},"Y0f3kn8yM8wUu6SWUb9KkA":{"text":"Delicious, rich, creamy, garlicy awesome food. Ask what fish is good at the moment, and ge","useful":0,"cool":0},"yHvQfyfyKJLKMJZotR2v4A":{"text":"This is a cute little place! The mussels were AMAZING! The food was excellent but the qual","useful":1,"cool":0},"3ru_qRdAW4oEGMzB2KKPRw":{"text":"Best tasting food I've ever eaten. The neighborhood is skanky you have to go up rickety st","useful":0,"cool":0},"mSIERMe3GIgyNngn9AMfNA":{"text":"Very friendly and accommodating staff, accompanied by a great meal!\n\nWhen going out to eat","useful":0,"cool":0},"RGvUPw3bRQxjSRfKmYppvw":{"text":"great spot\nI had rack of lamb, it was perfectly cooked and tasted great.  however is was s","useful":0,"cool":0},"XvVmhlUA-xqz-T34tFYY8A":{"text":"Adoldo's is worth the wait!! My boyfriend and I went on a weekday around 6/630. The wait w","useful":0,"cool":0},"dXwcoFKlc-WeK40RXS-Vrg":{"text":"The cannelloni appetizer has a very spicy sauce. We ordered based on reviews and enjoyed i","useful":0,"cool":0},"Qnp7q4AQR7ziyecphiZ-6g":{"text":"Absolutely recommend the Fish Missy with Grouper and Ocean Sauce. It was about $25, costin","useful":1,"cool":0},"Ny21f1MRsbiOwtq2Qgz72g":{"text":"Was recommended Adolfo's after sharing a few drinks with locals in the garden district. Th","useful":0,"cool":0},"8H_6ZAWWZ83JZS_uBJgaVQ":{"text":"Our dinner at Aldolfo's was fabulous.  We had Steak Labarca and Fish (salmon) Missy  both ","useful":0,"cool":0},"f0g-Q9ubXcDP7F_00PcsvA":{"text":"We visited Adolfos 4-15-11 upon many recommendations. We were told that they took reservat","useful":2,"cool":0},"J9AnhW29sSSOslKctiBqYQ":{"text":"I wasn't a fan. I don't feel like it  is authentic Italian food. Not good quality products","useful":0,"cool":0},"yAqRmf9YGK8qreDWPyV_5Q":{"text":"So good. Such a comfortable location. and Ocean sauce, oh yeah. Pasta, amazing. We were a ","useful":0,"cool":0},"iBRm3aY_L-wqNQ5XSfWeaw":{"text":"We came here on a busy Saturday night and had to wait an hour and a half but it was worth ","useful":0,"cool":0},"I3pWjj0izQ7gR35uE4GihQ":{"text":"The restaurant has a lot of character. The mussels are a must try. We had the stuffed foun","useful":0,"cool":0},"gaq4q5ZrGGqbG5lr0GgnOQ":{"text":"All i have to say is WOW. This place is amazing, but CASH ONLY!!!(They do have an ATM in t","useful":0,"cool":0},"WTvdVBx0NfoeHZ6Sq8JWeA":{"text":"The chicken Brenda is to die for!!! You will never want to eat anything else. Of course th","useful":1,"cool":0},"v4ne8IOV0IzglJjienS-Jw":{"text":"Where do I begin?! After reading the reviews I was so hype about trying the food from this","useful":4,"cool":0},"zrBDVYtx73QxqhM1Y1yAGQ":{"text":"The Cons: \nThe wait is soooo long.. and they don't take reservations (but the food was def","useful":2,"cool":3},"y279fS1ZkIQuIXprZbajjw":{"text":"Scam.  Scam scam scam scam scam scam scam.\n\nThe food was good, but the oyster sauce is one","useful":0,"cool":0},"hxnszmZ2l4y55ErCdXqLyQ":{"text":"This is what \"food drunk\" is like! I don't know exactly what to say...it's phenomenonal! T","useful":0,"cool":0},"5nRIs1vlzhPJnqD5jiweZg":{"text":"We found this place out of pure coincidence. Looking through Yelp we saw this place had go","useful":1,"cool":1},"5I8yi2e68hbJ5oh_HVEXwg":{"text":"Worth the wait and if you're open for an early dinner get there at 530pm for first seating","useful":1,"cool":0},"i6MBU43m0Z8iMQIBffyh2w":{"text":"Based on the other reviews, I was worried that my friends and I had to wait for a long tim","useful":0,"cool":0},"G09Y79egtiNTFOwl8HR-wg":{"text":"We got here about 9:15 pm midweek.  I was with people who had been here before and raved a","useful":1,"cool":1},"SFktjXD4eJK8zxGwi8vb3Q":{"text":"Ok, being from San Francisco I thing folks in New Orleans have never had good italian food","useful":0,"cool":0},"fktUejiPIDFODOf4g13fLg":{"text":"Great food! I recommend the mussels for an appetizer. They were phenomenal. Great music in","useful":0,"cool":0},"6GTaQVPUz0xdUiB9yLZjsQ":{"text":"We ate here again on 8/28/11... Food was great as usual. I dropped one star because the se","useful":1,"cool":0},"tQ4X9kh7R66jZclc_JWxkQ":{"text":"The food and the decor were great and very reasonable for a place in the quarter. \nLooks l","useful":0,"cool":0},"0BW1KYJWRE88zD4q-jTLSQ":{"text":"Torn between giving this a rave review or saying nothing in hopes that it doesn't become s","useful":1,"cool":1},"8gnC0NMJPNnyD4O8HrwrYA":{"text":"I stumbled upon this place on vacation in NOLA. What a gem. I had a clam Alfredo pasta tha","useful":0,"cool":0},"zyN-htUPTyEN1-KbySiL0g":{"text":"So worth the wait and the bar downstairs has amazing music while you wait! We went with wh","useful":0,"cool":0},"vP_bpXSA2x9e6JmVxMIbWg":{"text":"We waited for two hours. Had a BLAST at the bar downstairs listening to live music and vis","useful":0,"cool":0},"EZAx8OeU8TTPqBHjGuwy5Q":{"text":"Food was good. Ofcourse we had Ocean sauce on our pasta as everyone raves about it. It was","useful":0,"cool":0},"A5ezRekc_NPJbMrScNbhTg":{"text":"My friends and I came here for a girls night after numerous people had recommended it to m","useful":1,"cool":0},"DJIZPYOcprHFVctjPsibgw":{"text":"One of the best meals of my life!!!\n\nIf you plan on visiting Adolfo's, try to make a reser","useful":0,"cool":0},"y0znZDXXvTqPJipjLo5ZLA":{"text":"Came strongly recommended by Gil, the proprietor of the beautiful classic B&B we stayed at","useful":2,"cool":0},"sjnzqwR6BgkI8yeZF0MFGw":{"text":"This place became the highlight of our trip and truely signifies whats special about New O","useful":0,"cool":0},"kz_ux7SqAlA0YQPmLYUofg":{"text":"The reviews were right on about this place....it was certainly worth the wait and I apprec","useful":0,"cool":1},"vthv31kLk0_7-1dkxpOgiA":{"text":"One word: delicious\n\nCame here on a local friend's recommendation and it did not disappoin","useful":1,"cool":0},"01xUZvAlBMhCcwItEAXZAQ":{"text":"I'd heard great recommendations from locals in NOLA about Adolfo's, but I have to say that","useful":1,"cool":0},"gz1-si6Xl7jVN3CuoRt49A":{"text":"Not sure why this place is listed under seafood currently, because it's an Italian restaur","useful":0,"cool":0},"e-Iu2x607kh5XnVf6oftzA":{"text":"OMG! that was great food! Small place. Do NOT come hungry because you will most probably s","useful":0,"cool":0},"U2OYKUmnSqejzNjlY2jyDQ":{"text":"Wonderful Italian food with soul... 3 of the girls in my party said best pork chops they'v","useful":1,"cool":0},"xwzTP7M42FMml1IPIrKvgg":{"text":"True New Orleans! The downstairs is a tiny bar with live music that just sucks you in whil","useful":3,"cool":0},"-IxZDpixB7sVVGDIQlWiUQ":{"text":"Adolfo's is cramped, dark, and loud, three things I look for in a rustic Italian eatery. I","useful":2,"cool":2},"Hn8RCJkHz76iQAZMGh_G9Q":{"text":"amazing little joint\n\nas others have said, get the OCEAN SAUCE!!!\n\nTiny dining room, but t","useful":1,"cool":0},"eiZBJa2sgoNqYulrB4n-2A":{"text":"Oh man this was our favorite dinner while visiting New Orleans !! You MUST get your entree","useful":1,"cool":0},"3zSagk_qwk27fYzu2AKlnA":{"text":"what a great little hole in the wall...the only bummer was the wait...they told u and hour","useful":0,"cool":0},"9kXE8sZZ9UyJNmmrpgyUPQ":{"text":"I forgot about how great Adolfo's really is! I recommend bringing a bottle of wine, or two","useful":2,"cool":1},"uqBu0JO_RGevcTmPoRub0g":{"text":"food was good and the wait was not too long- 20 minutes. Rack of lamb was delicious as was","useful":0,"cool":0},"G9-hEfcXqjyoPYCueAcAfA":{"text":"Love this place! Atmosphere and location is fantastic. The food....where do I begin?? The ","useful":0,"cool":0},"hhTkIne5_buM303VDrln2g":{"text":"Best three courses of cream I've ever eaten. Had the eggplant and crab, it was a little sp","useful":2,"cool":0},"trgNqkfpA5EXGF4ye5arNw":{"text":"D'lish\nOCEAN SAUCE \nOh My Goodness\nWOW! Another awesome local \"hole in the wall\" New Orlea","useful":0,"cool":0},"ZEz95njjtSTfHULU3Wk_Lg":{"text":"Sat at bar was ignored for 20 minutes, the bar girl sucks.\nRude, talked way too much and d","useful":0,"cool":0},"iz_bjyGcWLmo5ipGKoqaCA":{"text":"Zeroooo star ! The place is a joke. Wait for hours to be seated then wait another couple h","useful":0,"cool":0},"pTrOsVPpJ55xMEuGUsQerQ":{"text":"My meal was not good; ordered a $30 special which was overcooked & mushy and the shrimp we","useful":0,"cool":0},"RRPAzj0_fma_WRTiCzwFfg":{"text":"I wish I could eat here more often, but my bank account wouldn't be happy. My party of 3 g","useful":0,"cool":0},"hM8qFttEZPvC9K2HpEhHYA":{"text":"Where to start?  The food and service are worth the wait.  The food is amazing so choose a","useful":0,"cool":1},"Vu47nYRubZSXTaMHRriGkQ":{"text":"Got the grouper with oysters and it was some of the best fish I've ever had. Even the sala","useful":0,"cool":0},"41RY-Jt2ckntvEbkFyzt-Q":{"text":"Cash-only establishment with an excellent menu selection. I went with the Veal Ocean and i","useful":0,"cool":0},"JKB5BTOz9DmKZ-ESM_NXkg":{"text":"If you are looking for a spacious, upscale atmosphere, a patient waitstaff and low wait ti","useful":1,"cool":0},"EwV0T84Y0s47PQ5R5GEwlw":{"text":"This is where the Locals eat out!! The reek of garlic is intoxicating the moment you enter","useful":0,"cool":0},"qzMTiAchHrgWTzkJC6rAxA":{"text":"Great food and reasonably priced.  The ocean sauce is fabulous.  Loved this place.  Get th","useful":0,"cool":0},"gt8s4GL4Xb3IhgfdDIAxJA":{"text":"I had only one night in NO and decided to go here going solely on good reviews on yelp. le","useful":0,"cool":0},"VN1RUfu4M_gkmPUB-ni0EA":{"text":"Best dinner during recent Jazz Fest stay. Don't be put off by the plain, obscure exterior.","useful":0,"cool":0},"vofjsMyas93_nlLuKV1yUw":{"text":"Hands down one of the best intimate dining places in new Orleans. The entrees take a while","useful":1,"cool":0},"jyPr9dh-XVkAIZvxEDG5ow":{"text":"I am hesitant to write this review as I love Adolfo's but hate waiting for hours to eat, h","useful":0,"cool":1},"RjY39gCnfJzZ2RmHoBE8sQ":{"text":"This place is fabulous!  We were only in town for 4 nights and ended up eating there twice","useful":1,"cool":0},"8McH2oHK51dDnFaLZGSATQ":{"text":"Small place and may have to wait, but sooo worth it!!  Lamb chops were amazing!  Next time","useful":0,"cool":0},"IuXttp9yJfFmyrNOi7UPNg":{"text":"This restaurant was so profoundly delicious that it has made it difficult for my girlfrien","useful":1,"cool":0},"_GmZNNG9uIR_pKYZRb6Cgw":{"text":"Awesome service, awesome food, awesome atmosphere. I wish I could eat there everyday. Past","useful":0,"cool":0},"be-wIJ3YIFeNMJ_soJpF5Q":{"text":"Delicious food, so-so service. Waiter forgot our salads, didn't seem to care, didn't ask i","useful":0,"cool":0},"2ybgYSHivUUk_IEGUG0p7w":{"text":"My wife ordered the Eggplant with sausage which was very good as were the mountain of muss","useful":3,"cool":0},"r1SAl3Y5jg_gMm5szVzsoA":{"text":"Worst dining experience EVER! It took 10 minutes for a server to acknowledge us and take o","useful":3,"cool":0},"BN-0kcZV5xolg29b2rGwcA":{"text":"This place was fantastic. Make sure you put the \"ocean sauce\" on whatever you get. We love","useful":1,"cool":1},"fp76tg9zTl3OyZj1rNrZUA":{"text":"This is a very quaint & romantic environment. It's upstairs with about 11 tables. The artw","useful":0,"cool":0},"0dhYW20EYaGus7r7SQLZ2Q":{"text":"Chicken Vincent is amazing!! They only take cash so make sure you take some! Alfredo is la","useful":0,"cool":0},"yQursupBaFv46OHCISjEwg":{"text":"Get here early, this is a very tiny restaurant, or be prepared to wait. There is a small d","useful":0,"cool":0},"JcCC1GdUIikUQihHimWAcw":{"text":"I came here based upon the suggestion of others on yelp. The food was just OK. The garlic ","useful":1,"cool":0},"D24qBTSwymp3e82RL1kNPg":{"text":"Great Tiny eatery above the bar. Awesome atmosphere and great food. Tiny place so be prepa","useful":0,"cool":0},"3SY_VzIbMJRnCDUq1oh93g":{"text":"This restaurant is really great, locals recommended it to us and I'm glad we went there. T","useful":0,"cool":0},"L863jcVfBj1obGjEiUq_zw":{"text":"I love rich flavorful food. I especially loved:\n- side salad (salad dressing is lemony but","useful":0,"cool":1},"_VeaoQ7KHMb3_FDqpJhvsQ":{"text":"Amazing, the first restaurant we want to hit when we get to new Orleans.  The grouper with","useful":0,"cool":0},"L4uBK0xyUDChjC9OytjG9w":{"text":"We lucked in to immediate seating on a Tuesday night and were utterly delighted by our exp","useful":3,"cool":0},"T4zf4ZBAaaytG9-rPql3Dg":{"text":"Our group of 10 agrees: In our 6-day trip to New Orleans - Adolfo's had the BEST food of t","useful":0,"cool":0},"Uo5Z_HhuzKTa6mxoW1W2xw":{"text":"We ate here last night. 7 out of 9 of us were Very disappointed in the whole experience. T","useful":1,"cool":0},"E45B7NkjoEl3BC9iHDJgBA":{"text":"Had to wait downstairs in the Apple Barrel saloon nearly 2 hours before we got a seat. But","useful":0,"cool":0},"TfhqmoSdIPir49oQj4o30w":{"text":"AMAZING! The food was delicious! My wife and I shared a spinach and mozzarella cannelloni ","useful":1,"cool":0},"EVS109neRH5G5yvhsP4NgA":{"text":"Sweet zombie moses...that's the first thought that crossed my mind as I took a bite of the","useful":2,"cool":1},"SP6KWHWBL4KWQIx7q9ShGw":{"text":"The food and staff are fabulous. The wait time for a table can be excessive. Do yourself a","useful":0,"cool":0},"bmb5KDUX_L002WVxaDHEiQ":{"text":"the food is awesome with a capital \"A\" but the two hour wait is ridiculously long. if i we","useful":0,"cool":0},"DRJXTME8vlqdaGHICJUsxA":{"text":"My wife and I went here on the recommendation of a local we met and we weren't disappointe","useful":0,"cool":0},"Fg1KzHL9VdZ96TqsknOMfQ":{"text":"Been to Adolfo's a couple of times and all visits have been great! Adolfo's is a little ho","useful":0,"cool":0},"fklduMxNrbR8C7xeIajBGQ":{"text":"Ahhh Adolfo's!  I love you just as much as I first did when I went here!  I again during J","useful":1,"cool":0},"D2iyAN3_Hw_953iwTkQ88Q":{"text":"One word: Fabulous. What a great place! We came the first night at 9:30pm, there were no m","useful":1,"cool":0},"xCf-UKChvkQhjYZ78Gnkfg":{"text":"The food and service was amazing. Calin, our server, was extremely knowledgeable about win","useful":0,"cool":0},"kvtTj3sEKGm7TAzYSjaxEg":{"text":"On my first trip to New Orleans, my friend and i started prowling down Frenchman street, a","useful":3,"cool":1},"WaTmD7tMNt3ClrqiXhIHXw":{"text":"I highly recommend catching some music on Frenchmen and downstairs at Apple Barrel before ","useful":3,"cool":2},"-KWnuu3Rz8vzu6K7f6KcQg":{"text":"Awesome little Italian joint. Soooo... I had the special which was stuffed flounder with t","useful":0,"cool":0},"Z1MWBIgCgRZwdEBzVIMrDg":{"text":"First of all, the food was amazing. I had the grouper with ocean sauce, while my boyfriend","useful":0,"cool":0},"fum4YiIKfTDA4OUctJrKuA":{"text":"Get the mussels to start, anything with the Ocean sauce for the main course. My seafood cr","useful":1,"cool":0},"F--CJIcyMxpfd5iHW6WBoA":{"text":"This was an excellent meal.  We got seated in under 30 minutes after getting quoted a 90 m","useful":0,"cool":0},"ovxx73K7ur9SqvbTv1RcWQ":{"text":"Restaurant un peu décevant. Les plats sont loin du niveau des commentaires sur trip adviso","useful":0,"cool":0},"aea3qHdS10q4EuhN8kHAww":{"text":"Bring your own wine and settle in for a comfortable meal in a small dining room above Appl","useful":0,"cool":0},"ToLcH_qg4m7RJ0jnbCrP1g":{"text":"You will love this upstairs neighborhood joint if you like overcooked fish served with hug","useful":1,"cool":0},"pixfn2rOfFaOSnvjfUsZYw":{"text":"Eating at Adolfo's for second time mussels appetizer was fantastic. The service provided b","useful":0,"cool":0},"ytMAO-bV1oiK-BUb6XnRiQ":{"text":"Chicken breast filled with ricotta & spinach, sauteed, topped with mozzarella and drenched","useful":3,"cool":2},"g8aBj6ICPu1uc5FPpZJ99g":{"text":"I really don't want to write a review because I don't want word getting out about this pla","useful":1,"cool":0},"fDPRUmPiXiBy7nokAC6Llg":{"text":"Had the veal with ocean sauce!!  Wonderful!  Fiancé had mussels special and loved it!  Too","useful":0,"cool":0},"8_KclTYGWGX2sOQ6U_0MSQ":{"text":"Hmm... kind of split on this one. Loved the atmosphere (Frenchmen St. is where it's *at* f","useful":1,"cool":1},"XI4TpImlZdVAsqIKOjruAQ":{"text":"A bit disappointing after the rave recommendation. Food was good but not amazing. Portions","useful":1,"cool":0},"ufi1U3MsZnbdTQ_bL0OeOw":{"text":"Little hole in the wall worth finding and do yourself a favor and get the ocean sauce","useful":2,"cool":0},"-iIL77vZeWEdEhy6gNgTMw":{"text":"This place is amazing, small and hidden but it gets packed and they don't take reservation","useful":0,"cool":0},"YaAuvc2aX2d4aK7G9ijkpQ":{"text":"I'm a little torn on this rating.  Adolfo's has a nice atmosphere, casual setting, and ver","useful":2,"cool":0},"uP4oL40QoocuMv6U6ZNcWQ":{"text":"Oh what a treat! Tucked upstairs above the Apple Barrel Bar.  No reservations. Cash only. ","useful":0,"cool":0},"rcCZRNT2ZnXn7x5hkK3-Rg":{"text":"This is my new cravings spot. I went last night and had an appetizer of mussels. First tim","useful":3,"cool":1},"8isCK-lmGAEUP_Yje2-zEA":{"text":"This place is def a whole in the whole but don't let the looks fool you! My friends husban","useful":0,"cool":0},"Au0ESkWO4DVcRn-7GeQd1Q":{"text":"I thought this place was pretty overrated. I just wasn't blown away like most of the revie","useful":0,"cool":0},"TXByyrBUZHT6NjO7afDDlQ":{"text":"Definitely not worth a $240 bill.... The food wasn't good and cramped quarters... Cash onl","useful":1,"cool":0},"i_H5fuOi5kIaXLkg3NusHg":{"text":"My fiancé and I came here after looking up the reviews. We were excited to try their food ","useful":0,"cool":0},"CVXJTnRsFosnkspiRnxjrg":{"text":"Amazing. Literally that's the only word for it. We were in around 7 on Sunday and had a re","useful":2,"cool":1},"XfIXcu1UqFKDtJixaWjpiQ":{"text":"Heartbreaking, after being my go to place every year will NEVER return.  Absolutely dismis","useful":0,"cool":0},"GHoQZ-ELPZ_OfImqDaGq7g":{"text":"Super romantic Italian-Cajun place hidden upstairs of the Apple Barrel - come here for gre","useful":0,"cool":0},"SVZCdS5pF70o_q57CWfWFg":{"text":"Amazing food & had fantastic service. Definitely a repeat.","useful":0,"cool":0},"no5BI5Vj5QUVWB37WSlSKQ":{"text":"Some of the best food I've ever had. I got the salmon with ocean sauce and it was fantasti","useful":2,"cool":2},"Q-Nh10daf5LI15w5W7jecA":{"text":"The stuffed flounder was incredible. The wife can be picky and is new to seafood, but abso","useful":0,"cool":0},"EyN52tJEjv5VU4CUBujPNw":{"text":"By far the best restaurant I had went to during my visit in NOLA. I was recommended to go ","useful":2,"cool":1},"fTKUiYPg6NdiDuhGyl2_8A":{"text":"Cannot say enough about this place! The ocean sauce NY strip is way too good. People may t","useful":1,"cool":0},"X4iSiNQ3hgBdmX2yDeJJSA":{"text":"My husband and I ate here the last time we came to NOLA.  That evening and throughout the ","useful":1,"cool":1},"XXTuTBt8o45P5m9zQtNJMg":{"text":"Yelp brought me here with their reviews. Even though the reviews weren't many compared to ","useful":0,"cool":0},"Eta7f7kwFwiBo_jb5LRAxA":{"text":"An amazing restaurant with great food. I would highly recommend this place to anyone looki","useful":0,"cool":0},"mM9eXP63UmkGEujt3Ks2VA":{"text":"Adolfo's is a unique place. It's right on Frenchman makes it busy and noisy at night. When","useful":1,"cool":0},"qcTfM-LBvuDo9sMHHHurbg":{"text":"First off, the ambience is not what you are looking for here.  But if you are interested i","useful":0,"cool":0},"RfrQ_CjVSuvtbWKBQUKqGg":{"text":"Adolfo's is a great neighborhood place located above the Apple Barrel Bar on Frenchman Str","useful":3,"cool":3},"dpQPUdVcV-xfDIJjTS9z0Q":{"text":"I highly recommend this place the only reviews are because of the no credit cards and a lo","useful":0,"cool":0},"tWoA2D5vBGT-fyUu9xPGGQ":{"text":"Great restaurant. So so location, if your new to New Orleans you may be surprised with the","useful":0,"cool":0},"Une0rd8bcN63J1ZkBybkUQ":{"text":"Loved this place.   You have to be prepared to wait but the bar downstairs with the live m","useful":2,"cool":0},"0xJcv2nfY-bj5ERwmELNRQ":{"text":"What a bargain for such high quality eating!  A dozen or so tables greet you at the top of","useful":0,"cool":0},"EWgnB3wRfsIcgG4eFrulBg":{"text":"Stumbled onto this little Italian spot while perusing Frenchmen street, and we got lucky. ","useful":2,"cool":1},"REeHDOzQl5i1JMwff8C6mA":{"text":"While looking for a place to hang out on our last day in town, a local told us to try Fren","useful":0,"cool":0},"ClB8UmLWgi_JrYQxSkwvWg":{"text":"Maybe they were having a bad night but the NY strip was tough and the stuffed grouper was ","useful":0,"cool":0},"cEvHRkEmunVkfao7I_4OBg":{"text":"So I had the eggplant parm with Italian sausage to begin. Amazing! New York strip with the","useful":1,"cool":0},"solHg4eQbJR8ldyRwncLeQ":{"text":"Last night I had the pleasure of dining at Adolfo in the Marigny.  I had been before, but ","useful":3,"cool":1},"-3sGcKKJnX4DbjAmHqnW0Q":{"text":"Food is wonderful!! BUT, the wait for a table is unreal! 2 hour...then add the wait for th","useful":0,"cool":0},"5slRcbGCn8wndxhfU0g8DA":{"text":"This was the best meal I had while in New Orleans . Started with the crab and corn cannell","useful":0,"cool":0},"9A79HfNjQY8paYTU1L52ug":{"text":"This restaurant was recommended as a favourite.  It started off well with being told we we","useful":6,"cool":0},"n7QHF8KLINkMHmGPWDw8bQ":{"text":"VERY GOOD SERVICE - BLAND FOOD - EXPENSIVE. The place is small, so prepare to wait. The wa","useful":1,"cool":0},"QK8OTbDVowsdscdqoxdJSQ":{"text":"After getting tattoos across the street at Electric Ladyland Tattoo we were famished. Even","useful":2,"cool":2},"28UZ7auVv8mK0p4MkphlCA":{"text":"Old school classy little joint. The downstairs is deceiving, so be brave and keep going. C","useful":0,"cool":0},"naFZRkUqZLoOkSYvtb1FlQ":{"text":"based on reviews we had high expectations on the food but were highly disappointed. Ordere","useful":0,"cool":0},"5YSw7MDFwjJCuOM9YJVCYg":{"text":"Simply put, one of the best meals I've ever had. It was a trout special stuffed with crabm","useful":1,"cool":0},"UogwsG07vrqRa-cj3U-3JA":{"text":"A brilliant dining experience.\n\nAdolfo's is the best seafood and Italian mix experience I'","useful":2,"cool":0},"aKuC1UuF71qAFjNlUwVrqQ":{"text":"Crawfish bathed in butter, crab and corn cannelloni, clam Alfredo.... OCEAN SAUCE. that's ","useful":0,"cool":0},"A3zns5W0nvgeDhM4lNPWng":{"text":"The flounder with ocean sauce is so good. The salad was so good, and the crab cannelloni a","useful":1,"cool":0},"mb1F4jkmWzioTIXHFMmDQQ":{"text":"Long waits typical for the small dive of a dining area ... we walked in and got the news, ","useful":0,"cool":0},"jWLIU0eW4dndedvWWs8JhA":{"text":"Small place that is tucked away above one of the smallest bars I have ever seen.  Adolfo's","useful":0,"cool":0},"cWRHSPe0oFKMVcuZELw1hg":{"text":"Tried Adolfo's off of the recommendation of a woman that I bought a necklace from in a bou","useful":4,"cool":0},"TJFXeJfOtBsG1tykZgY56g":{"text":"So worth the wait! The Steak Manny was great and it was cooked perfectly - loved the peppe","useful":1,"cool":0},"phdvHLxUPCfMu-Ffxif9Bg":{"text":"WOW!  This tiny place was recommended to us by a local street artist on Jackson Square.  W","useful":0,"cool":0},"KS-VPLr023qsNsRwdBj9ow":{"text":"Umpteenth trip to NOLA, we decided to ask for local recommended restaurants for dinner.  B","useful":0,"cool":0},"Gqxhq11lC1Zg1nB4gortcA":{"text":"Only reason to ding this place is for the cash only policy, but that is such a minor thing","useful":1,"cool":0},"AEASnzggC58CrVfopTaSbg":{"text":"It is 100 degrees right now in New Orleans and Adolfo's air conditioning is apparently bro","useful":0,"cool":0},"s08gc3MOMKHJA8QXKDIANg":{"text":"Absolutely everything about this place matches the hype surrounding it. Their French bread","useful":0,"cool":0},"fG2rYJxbfhqZqjewpN2PeA":{"text":"The crab and corn cannolini is AMAZING. While this place is pretty small, it's definitely ","useful":0,"cool":0},"kTwWK7t2DU1mAgOttrjysA":{"text":"Excellent local recommendation. The crab and corn cannelloni is excellent and everything e","useful":0,"cool":0},"0uRCCLiy_Sx8riu_I25YFQ":{"text":"Went to dinner here on my honeymoon in NOLA. My husband ordered the stuffed flounder with ","useful":1,"cool":0},"jWa-1QK09C2kP8uwdBSyFQ":{"text":"My friend and I came on a Sunday night and had to wait around an hour and thirty minutes, ","useful":1,"cool":1},"UuEA0JAYpdlaRn6ECcMt4Q":{"text":"Would love to review the food, since several locals said how awesome it is. But, after wai","useful":2,"cool":0},"8DAM6pZPxhnGIDdab3CB8Q":{"text":"This place is New Orleans best kept secret! Packed with locals and other restaurant owners","useful":1,"cool":0},"wfRwQS4i-ItZ3OIVtvWeFA":{"text":"OMG!!!  First time in NOLA for New Years.  December 29th we wanted to head to Frenchman St","useful":0,"cool":0},"JHWNjFr3PHCrQ3h8xieCrA":{"text":"Loved this place! The food was great. The server was a little snotty but not enough to tai","useful":0,"cool":0},"8ylq4Lq_3tNDftHaIb1ioA":{"text":"I can't imagine people had a good experience here...I must have been on the worst night in","useful":6,"cool":0},"82RVuAs2t_SClVlnC-nLhg":{"text":"This Creole Italian restaurant is upstairs from the Apple Barrel. It's a cash only place, ","useful":0,"cool":0},"oJYiM09umXdUUMiDYvES3A":{"text":"Great atmosphere and even better food. Cash only but has an atm. It's upstairs to a bar so","useful":0,"cool":0},"MuYBBWO6Cjr6hE7XQq8GCw":{"text":"Love this place. It's cash only and the ATM has a hefty fee. Small place so the wait can b","useful":0,"cool":0},"qwX6rWz7hcmkFsu_Hsn_aw":{"text":"I first came here 9 years ago and fell in love with the ocean sauce. Today we went back an","useful":0,"cool":0},"94l4NSXqEJDdywmz8MkJ_g":{"text":"I have eaten here several times and always had a wonderful experience.  Last night, we wer","useful":0,"cool":0},"XL1LwJqF5-qAwLMpO8J4mg":{"text":"Easily the best food I have had in a long time! The food is extremely fresh and well worth","useful":0,"cool":0},"IAPMLITPBVwhDxUlDlBVog":{"text":"Tiny little joint upstairs from a bar. CASH ONLY! Fabulous food, great service, cozy envir","useful":0,"cool":0},"2iBO-RKoOIaPcUGrKeOlNQ":{"text":"This little restaurant served one of the best seafood dishes I've ever had. I had the foun","useful":1,"cool":0},"h8VNVfh3hMbyGZBFYmcbzQ":{"text":"They kicked the two of us out because we only ordered one dish.  Which we only did because","useful":1,"cool":0},"yCiB9L6g0oC1-88wP-SwIQ":{"text":"Pro's:\nThe food? Amazing! \nCon's:\n-The wait? Pretty long and the server gave away our tabl","useful":1,"cool":1},"YOZ_cQu9pbc65h0Wg6mqPA":{"text":"Went two nights in a row. Great fish with Ocean Sauce first night. Second night I had the ","useful":0,"cool":0},"CmMe3c-PrSL2llYaakVYWg":{"text":"Oh Adolfo's. How I love thee. This is one of those places where you have to be in the know","useful":1,"cool":1},"ZkRNwwcOkwKOGpOenR8Uog":{"text":"First time to Aldolfos with friends who'd been once previously. Located in a really cool a","useful":0,"cool":0},"2HTewRZIChG8Nf1wb_HKBQ":{"text":"Wandered in here on a recommendation by our hotel bartender. We came late - we arrived a l","useful":1,"cool":0},"WASL6Ygwh2KCYkqOz68vYw":{"text":"This place was awesome. The ambiance was great and the waitstaff was very attentive and fu","useful":0,"cool":0},"XTBe96aY31wkNo_C8gnY7w":{"text":"Deceptive Pricing; Rude, Threatening Manager\n\nOn my last night visiting New Orleans I had ","useful":2,"cool":0},"KLpIEO7clSJT1Ylf8VcsXA":{"text":"Very small hole in the wall restaurant to eat fantastic food. Not a wide variety of food b","useful":1,"cool":0},"qK5t5pC7-L0oAInPcQAVrg":{"text":"Great food, good price, interesting New Orleans hole-in-the-wall venue on Frenchman street","useful":0,"cool":0},"c-Kv0c4Sfdq-nrhF4h-aeQ":{"text":"I loved this experience but not everyone in my party loved EVERYTHING about this experienc","useful":2,"cool":0},"e25166EotMppk5pTHR1Z9g":{"text":"Our first night in New Orleans, we were super excited to try this place out. We walked in ","useful":2,"cool":0},"_PEOj1fYw2b2EKgWNGV5Yg":{"text":"I would bathe myself in the mushroom and butter sauce that covered my steak just to be clo","useful":0,"cool":0},"J2qhhSRRa2nmXd9ehkwIWw":{"text":"So we canceled our reservation at GW Fins to eat here after rave reviews of the ocean sauc","useful":0,"cool":1},"JPokEXnCZq_iFptoEGhL_w":{"text":"I'm a jersey Italian girl and I'm telling you the hassle to get into this place is totally","useful":0,"cool":0},"P-NJeapxZ8f33EmCJMI-Aw":{"text":"If you're looking for good service, you're better off going to the local strip club. No re","useful":0,"cool":0},"S7cD3d-0Zd_pl3huddMytg":{"text":"I guess I forgot to update my review from the last time I was here. I came here a while ba","useful":3,"cool":0},"777WM1-_ZhL7B_jyRUaH9w":{"text":"This restaurant was recommended by my hotel we traveled from the French Quarter to this su","useful":1,"cool":0},"5VzSPFDUu7CKB-D2XumF4A":{"text":"Came here with some local friends who've wanted to try it, but hadn't yet. So I guess you ","useful":1,"cool":1},"3w06DGUpDKEOeMC9vBoVyQ":{"text":"Get there early to get a seat! This place is tiny and people take their time eating. We su","useful":0,"cool":0},"6ARhtcKkKhzlCGAmD4gafg":{"text":"Got there at opening so we were seated right away, waiter came fast, but the food took *fo","useful":0,"cool":0},"h9-fQWInvqW-K9qJoX09FQ":{"text":"Every restaurant has a bad night; therefore, I am attributing my experience to that. Admit","useful":3,"cool":0},"IRVD-k815rclR5-5B0RoXA":{"text":"The best food we've had in NOLA! We had mussels and cannelloni as appetizers followed by t","useful":1,"cool":1},"DkhYuMt05AN6qSPPVX3z9w":{"text":"Adolfo's, I tip my imaginary chef hat off to you. The muscles with white wine and garlic s","useful":1,"cool":2},"ZQXGt0R5OiossdjKFq9rxQ":{"text":"This restaurant is so amazing and James was an awesome server. Best piece of advice would ","useful":3,"cool":0},"m8JYZ-CfW-GAmAlf0MkfXw":{"text":"This small seafood Italian place is a gem! Even the alfrado sauce has a kick! But their oc","useful":0,"cool":0},"9jFn6GduOPWTe7bljnrFOQ":{"text":"My mom was in town a few weekends back, and I wanted to take her somewhere classic NOLA, b","useful":4,"cool":2},"kbIfayJm2XfJmJCS1gn8pw":{"text":"The mussels in white wine and garlic sauce are so good you will drink the sauce. \n\nWe both","useful":0,"cool":1},"yljBjW0BzqU0giDhjPbK7Q":{"text":"Really wanted to try this place but they only allow one entree per person, but our group r","useful":0,"cool":0},"zs4Pwtg1YdSS8Bd2efxSzg":{"text":"The food is delicious! We has the eggplant parmigiana and the ocean sauce on the salmon. H","useful":1,"cool":0},"eQRk2qMtlqYTncItKlRzvQ":{"text":"We did not make it past the service to try the food so this review is purely based on thei","useful":5,"cool":0},"ZUNUsbmGs5YX3LRc4jTz3A":{"text":"I had the cannelloni stuffed with crab for an appetizer.  I'm sure the cannelloni shell wa","useful":1,"cool":0},"ZVowG7zTVlRnxtFPvn9P9w":{"text":"Terrible service!!!!!\n\nFirst, the server up selled a steak special that sounded good.. I w","useful":0,"cool":0},"uHR9s6SdMut4Ow-ZntLf5w":{"text":"Great food and really good service. We came for my husband's birthday and we were so pleas","useful":0,"cool":0},"S6oMdbhwiJ911bOt5HIM1Q":{"text":"One of the most enjoyable meals we've ever had. \nParty of five took about an hour to get s","useful":0,"cool":1},"5Gf5vZ82kjCMrc_xSIqc1Q":{"text":"A friend got a recommendation to this place from a local, so we headed to laid-back, non-t","useful":5,"cool":2},"etYiSv74V7D5Ym0itURHJQ":{"text":"This was the best kept secret for us locals for years but the secret's been out now! This ","useful":2,"cool":0},"X7j5VUaZGhICDoKkl1TRjw":{"text":"Great food!!! We had the grouper with ocean sauce.....one of the best ever! We also ordere","useful":0,"cool":0},"Fa8IekGiDVRh68l7ErHRFQ":{"text":"I'm usually not easily impressed. This is one of the best meals I've ever had. Our server ","useful":0,"cool":0},"EYJntb6YCNWWzwQ-PmhFEg":{"text":"We were told it was going to be a 30 minute wait.  It ended up being a 90 minute wait. By ","useful":0,"cool":0},"oJdvrhq-RtRwICUpA7cqow":{"text":"I have always heard good things about this place, so on date night I finally gave it a try","useful":0,"cool":0},"PpqAE81cC1rb8cY-foHjZg":{"text":"Snuck in here on a busy night. You have to be on the list . We werent  NAHahAAAA\nRRRRrrrrr","useful":0,"cool":0},"E0xKDHUHQ6IwRwENyUKcSA":{"text":"Fantastic. The true example of \"hole in the wall.\" The food is absolutely delicious, incre","useful":0,"cool":0},"T70AozvZNVSG9ZU58XWIpg":{"text":"It looks like a dive bar but the food is awesome.  Go early otherwise expect 1-2 hour wait","useful":0,"cool":0},"7vG_x3nJIXioij7R7R9pdg":{"text":"Eh, it was ok. Seems like a popular place though. Our waiter was great, he put up with a l","useful":0,"cool":0},"cgHlHvzhk1U8vJu4aR4tAA":{"text":"Passed by this place so many times, so many years, since our time Share is nearby.   The w","useful":0,"cool":0},"kV0omVq16gAGTgsWYOR1YA":{"text":"Overrated, overpriced,  kinda yuck. Waited forever, pasta was overcooked and mushy, mussel","useful":0,"cool":0},"8XSjbPmZJhkp75p-Q-j4Jg":{"text":"Crapy service. Allow you to put your name on the list. Have you wait an hour just to say t","useful":0,"cool":0},"HToj9AUQuksuCuKOmbtoGg":{"text":"Great food and great service. Next time I'm in NOLA I'm definitely coming to this restaura","useful":0,"cool":0},"Q4v-Yyju3eX0fx5P8lakNA":{"text":"one of my favorite restaurants in New Orleans. Lamb Chops, cannelloni, ravioli, and anythi","useful":0,"cool":0},"Mw13mT6awaS-nYVqT_n9Ow":{"text":"THAT'S what I'm talkin' about!\nGet away from the crummy little plates and the cute food in","useful":1,"cool":0},"icQVJqNJFqB3YXTysq8dew":{"text":"It was tough getting in but so worth it! My boyfriend and I went here last year on our tri","useful":1,"cool":0},"iT_s91i-GEjMbXrrFK_guw":{"text":"Dinner was wonderful we had the Grouper and trout both was very filling and delicious.  Wi","useful":0,"cool":0},"mZbzdBGCKE5h1TNPX-1kmQ":{"text":"Excellent fresh flounder with ocean sauce, eggplant appetizer and salad. The cream sauce h","useful":0,"cool":0},"8liyVA1IwDRXJIf886CByQ":{"text":"Four words: corn and crab cannelloni!\n\nEverything we had was delicious and the restaurant ","useful":0,"cool":1},"DujTd8JvOlE-1ROeZZDdSA":{"text":"Upstairs restaurant off of Frenchman st. Live music and bar downstairs is perfect while wa","useful":0,"cool":0},"qVPKo4X-V6jcI25HaIn8Ng":{"text":"amazing Mussels.\n\nsumptous Grouper with their signature \"Ocean Sauce\".  \n\nHighly, highly r","useful":0,"cool":0},"1CtMCybT9LXVK487LbumBA":{"text":"The best on Frenchmen street on NOLA.  I had the mussels and the pork chops.  Unbelievable","useful":0,"cool":0},"8AnlRT2bBkQq7yFC1cBfRQ":{"text":"Ate here last night on our second night in the city . Amazingly , there was absolutely no ","useful":1,"cool":0},"TJOZhRbP0VC9Vn7dmXevIw":{"text":"Completely amazing.  A total find.  This was the first place I dined in New Orleans and it","useful":0,"cool":1},"4Qtz7FKNZUA2VqLW1QQbmA":{"text":"So good! In love with the crab and corn cannelloni. Huge portions and friendly staff. Cash","useful":0,"cool":0},"l-a_kLZ3yy_VZ1NWd2YYIQ":{"text":"First of all the place is a dump. Service was mediocre- they thought we should be glad to ","useful":0,"cool":0},"au36d9uZAKpGGVPpMVlMZQ":{"text":"The meal at Adolfo 's was the biggest disappointment of our visit to New Orleans.    The w","useful":2,"cool":0},"iu6MEeO19ugLoWeDInbZfA":{"text":"I have heard so many wonderful things about this restaurant. I drove across town to find o","useful":2,"cool":0},"coAT23pCrbb2dX2rxtegEQ":{"text":"Always some good food and the service can be good if you know how to work with people.  Th","useful":5,"cool":4},"gYd4kYb_ktsEkyTZGguP1Q":{"text":"Nestled above a raucous blues bar on Frenchmen Street, this spot is incredible, in every w","useful":0,"cool":0},"AggEdEXadX0qa36lwDXe6A":{"text":"Good god almighty, it's been a long time since I've had Italian food this amazing! Get the","useful":0,"cool":1},"4oL7ECZA1cej3oxawEzVXw":{"text":"We were welcomed warmly and our server was amazing to accommodate our vegetarian requests.","useful":0,"cool":0},"GukEc9bxcoTh53KoRy9pWQ":{"text":"Recommended by a local guide, hubby and I decided to try it since we have always preferred","useful":2,"cool":1},"L68QLAFYXCi4eueyO8g3Bg":{"text":"Ah-mazing!! Seems like an odd sort of dive place, but the food is next level. Great servic","useful":0,"cool":0},"zQbXa8P2BDpWzTPfjPnqyQ":{"text":"When we arrived in New Orleans, we met our house host and went through our loose itinerary","useful":3,"cool":1},"YU0PplPdjG-niV3lYOCymg":{"text":"This tiny spot has music downstairs, Italian-Creole food upstairs, and it's amazing. Not a","useful":1,"cool":1},"yvmEtW0-7kPunWuYDWfBpQ":{"text":"Great romantic spot with excellent fish and seafood dishes.\n\nThis is a wonderful, cozy lit","useful":2,"cool":1},"E_jDQbovsmYk6b-vjcTsxw":{"text":"I have been here twice and I love it.  Cash only and waits can be long, so I would recomme","useful":0,"cool":0},"QBwAXhs40f4AQEi-nnaEWA":{"text":"My group waited patiently after being told an hour wait...for two hours. We then were told","useful":4,"cool":0},"K12QJx9GeWMPdYr2z84Yjg":{"text":"Adolfo, I Heart Your Food!!!\n\nThere's a bit of a back story to this place concerning my fa","useful":1,"cool":3},"eQvLFRf08yNeEogGB1UY0Q":{"text":"On my last evening in New Orleans, the concierge at the Sheraton said this is where she wo","useful":0,"cool":0},"2-UEeL-NPKSi4TLMKHDoMg":{"text":"Best garlic bread around. \nEverything is made fresh, from scratch and amazing. \nThe spinac","useful":0,"cool":0},"f87gLj5TLqdELl18w2vluA":{"text":"I love this little hole in the wall place!  Its quaint and cozy.. Has about 9-10 tables ma","useful":1,"cool":1},"Ig80bolsLeTVrjtsvl0xEQ":{"text":"The place was upstairs in a really cool neighborhood. My waitress was fantastic. They have","useful":1,"cool":0},"2u3Vai7F4eqU7G4ECPxn5Q":{"text":"Great food! Mishap with mussels so steak was a tad over cooked...overall it was an awesome","useful":0,"cool":0},"eW3cRIRt6kLGVKyOBs5akg":{"text":"i loved this place the Ocean sauce was amazing .  I told my wife i could cover my sneaker ","useful":0,"cool":0},"19ZOBREH6ZeT55b8PcdD-w":{"text":"I give it five stars because its so different compared to the other restaurants in New Orl","useful":0,"cool":0},"WnKW3zr9bitJPgBmhmy1wg":{"text":"At the recommendation of a local, I ventured to the East side of the French Quarter, up th","useful":0,"cool":0},"Jps-IOikgmHfYzjXPtYj9A":{"text":"Awesome!!!  The ONLY reason I didn't give 5 stars is because the salad was below mediocre.","useful":0,"cool":0},"B63_KAlUj-EkbnjJeQ2prw":{"text":"Simply fantastic!\n\nIf you are in a rush and want impeccable service and can't bear to pay ","useful":0,"cool":0},"Rbtd6PjeEE7ZdJsMWP8sCQ":{"text":"I travel a fair amount for work and I make it a rule to never go the same place 2 nights i","useful":0,"cool":0},"OSVqrjCJyP61dFhz5mCuSw":{"text":"OMG OMG OMG... THis place coming from a NY Italian is the most fantastic resultant I have ","useful":1,"cool":0},"tgBSVIvzio5saaesKlbztw":{"text":"From other reviews it sounds like this place should just serve their lamb, mussels, and st","useful":0,"cool":0},"BRuRrnwC_hRjUPzflQZ8Vg":{"text":"Fantastic! This is a very small restaurant that DOES NOT take reservations so show up earl","useful":1,"cool":0},"g_FYs5hOPzVOh66DnyLDfA":{"text":"Well, at this current moment I have had several beverages while waiting to be seated upsta","useful":0,"cool":0},"Gmaw5Jkvcxlw-tNkXzaxsg":{"text":"I came here once a few years ago and thought the food was good so I brought my girlfriend ","useful":2,"cool":1},"qhxPA2QWzhBahRe9gClaHA":{"text":"The best muscles I've ever had. The grouper in ocean sauce was amazing. It came w/ a side ","useful":0,"cool":0},"w561Q1EJQDAl1nTBkX7qqg":{"text":"Great restaurant.\n\nA hidden gem of a little hole-in-the-wall restaurant.  The restaurant i","useful":1,"cool":1},"xEfMiV9Ji25OQhE_7xJWEw":{"text":"Diamond in the rough. Eat here. Amazing food. Great service. Be ready to pig out. Yes, it'","useful":0,"cool":0},"eiaTTPqanOzODmEF_Qvd7Q":{"text":"Not worth the 2 hour wait.    Ok at best very crowded.  Food sucked very expensive won't g","useful":0,"cool":0},"8cQg9vkn1fSXNJtd5A8o9w":{"text":"This is my favorite restaurant in the city.  One of my profs and his partner told me about","useful":1,"cool":1},"cRCCG32yfcrIixRf9JeePw":{"text":"We ate here last week, while spending a few days in new orleans. We lucked out on the wait","useful":0,"cool":0},"889ZIP12nP2IR2CwSLXZWg":{"text":"Probably one of the most disappointing dining experiences I had in New Orleans. Our 45 min","useful":1,"cool":0},"m9BJ9_HzRVuBCFXXb1BYUw":{"text":"Great stuffed flounder, muscles and steak. Not just Italian. Small place upstairs with lou","useful":0,"cool":0},"noTHNNjYZlcwUPfb6IGPaQ":{"text":"Despite 2 separate recommendations to eat here, this place just didn't perform. When askin","useful":1,"cool":0},"qzIpJIpMmGcn71oKjH1MaQ":{"text":"Food is great but you need to get past the foul smells coming up the stairs to the second ","useful":1,"cool":0},"T0qyOQddY2gX7X0XjviqOg":{"text":"Too much glass in my salad for my taste. Place smells like pee. Dinner itself was tasty.","useful":1,"cool":0},"92Eu5PXHPwWB_ySzSr-XlQ":{"text":"Adolofo's started out promising. We were given the recommendation by a NOLA native who sai","useful":0,"cool":3},"Xz-wvlESUyvKhN4XB15weA":{"text":"We attempted to dine at Adolpho's on our first night in NOLA but no go, they were fully fu","useful":3,"cool":0},"fcPaMYdxvVsw0XQBDOmwzA":{"text":"A hidden gem in the Frenchman's Street area. Luckily, we were referred here by a local mus","useful":0,"cool":0},"PcJvZNIjMjoLf92wfy3d9g":{"text":"My husband and I decided to spend our last dinner in NOLA here. We heard great things as w","useful":0,"cool":0},"fJuueJPsFrphKRpeE0D3BQ":{"text":"Always amazing. Nemo is our favorite server - fun, friendly, and efficient. And of course ","useful":0,"cool":0},"SuhbiCxpDOmTMG7HDWUaZg":{"text":"1st time - had veal Parm. With pasta on the side \nToo much couldn't finish it - and stuffe","useful":1,"cool":0},"VTncReXarlJtYzYqgZ4U8w":{"text":"They only take cash.\n\nExcellent service.\n\nFair priced.\n\nGreat mussels appetizer.\n\nNew York","useful":2,"cool":1},"YQ2tMDJQbzubR_EGakek3g":{"text":"I am not one to leave many reviews, but the food was sooooo good.  I highly recommend this","useful":0,"cool":0},"X1YGkd9dN_kezu1IDZ7Xdg":{"text":"Been coming here for several years and absolutely love it. I\nGet mussels or escargot and t","useful":0,"cool":0},"p0x6aAoVg-tTB_Kolj5iZg":{"text":"Didn't realize this place was cash only but that part aside the food was amazing.  I knew ","useful":1,"cool":1},"eUjWeb11301cZgnwdy1sDA":{"text":"Came here for the first time for a friend's birthday party. Adolfo's completely blew every","useful":1,"cool":1},"hsEg9FmdBj6v8f0IS9aCyw":{"text":"This place needs a new manager and chef.  The food they served was equal to a dog's breakf","useful":0,"cool":0},"uBIyeCaTGHaC4MglCMG8bA":{"text":"Amazing! Everything from the food to the drinks to the atmosphere was all that we could ha","useful":0,"cool":0},"ynFrj92B7WoG5upFi0j_eg":{"text":"We had just finished some great drinks and appetizers at The Grand Isle and were trying to","useful":0,"cool":0},"r1Krvylkuy4qvpbGipUYOg":{"text":"amazing italian in the frenchmen street. not much of food options and this is definitely a","useful":0,"cool":0},"RaRW3AS0LMt2hwtBn8BhkQ":{"text":"I was looking for a restaurant that wasn't just tourist hype with mediocre to good at best","useful":0,"cool":0},"7J9G50zzUM0GQ4LqCODjDw":{"text":"Went there for my birthday dinner and it was perfect.  Very romantic and dark with plenty ","useful":3,"cool":1},"qXkOIrlYkGE69Qsqp9of4A":{"text":"Was told a 30 minute wait and to wait in the bar downstairs which was all good. Then 90 mi","useful":1,"cool":0},"xhLNzAT9ggOjjKHXnSAsRw":{"text":"The food was delicious! We started with mussels and the eggplant topped with sausage. I ha","useful":0,"cool":0},"ZYIY9djKGs-4acGQb1krEA":{"text":"Great food, in a great neighborhood. The cannelloni, and the rack of lamb is to die for. D","useful":0,"cool":0},"vv9v-k-Wd9_vYtjTkK9yKw":{"text":"Found this gem by chance so happy we did.  Husband and I were looking for another restaura","useful":1,"cool":0},"wAPIfO9Ro0HsHLZCpGXeXw":{"text":"Drove from Ohio to Hammond,LA and then into NOLA last night on July 4th. My brother, Shagg","useful":0,"cool":0},"2PwRmoLsH4ULfRwlPE0o8Q":{"text":"Amazing amazing amazing!!! This place is fantastic! Pork chops, steak with ocean sauce, an","useful":0,"cool":0},"NtKEP-IrMifT2X9_FIJ8Eg":{"text":"I can't say anything more than what has been said.  The special last night was stuffed flo","useful":0,"cool":1},"Lehfv-BGDi-HzaG51bLy7Q":{"text":"I selfishly want to tell you to never go to Adolfo's cause it's getting too damn popular..","useful":1,"cool":1},"hcDAso3feXDyOm3BdfJz_Q":{"text":"My first inclination when writing this review was to leave awful comments so as to deter f","useful":0,"cool":0},"6JSBvjlg1Z76OR_3siQjIw":{"text":"Too much glass in my salad for my taste. Place smells like pee. Dinner itself was tasty.","useful":0,"cool":0},"XlDs8crr7ycunHnjLeCutg":{"text":"The lovely man running the bed and breakfast we stayed at in the Marigny suggested we try ","useful":2,"cool":0},"sP8iMA_66n7kIlBqPWlvKg":{"text":"I went here last week for spring break in NOLA and it's so so yummy. We were eating so muc","useful":3,"cool":1},"h91aFRaTinA_nEOw0-v5Hg":{"text":"Over rated. My fish was mushy, the lamb chops-one side burnt, none medium rare, the salad ","useful":0,"cool":0},"PyIWA7U_p_rqJg3g48td2g":{"text":"We got there real early and we split a stuffed flounder.  There was a $4 up charge for spl","useful":1,"cool":1},"mSG_TizUvJqcLqDk6sNWtQ":{"text":"This place is literally a must-have when visiting NOLA. This is my second time and, though","useful":0,"cool":0},"bhLgqHFf61tAr9cIY06E6g":{"text":"Adolfo's is truly a one of a kind dining experience. I lived in New Orleans for five years","useful":1,"cool":0},"dapFd-SGlXm2oC6s9ijsdg":{"text":"This place was a great find and food and service was amazing I would for sure come back ag","useful":0,"cool":0},"Xf01j1R36CTrMEJh0KBCKg":{"text":"To be succinct: the food is alright, better than fine, but our waiter knowingly swindled u","useful":2,"cool":0},"31PxSPFzZfD527rgaFRUBA":{"text":"Don't be misled by the negative reviews! I really, really wanted to try this place because","useful":2,"cool":0},"A73Ugg4mwOXn1T-nWe7S3A":{"text":"Waited in line for two hours, was told it would be an hour, and continually told we'd be s","useful":4,"cool":2},"6pHpdgEM6M5tdiRVd4mARA":{"text":"Great place to go before the clubs on Frenchmen.  We had a dozen people traveling from NY ","useful":1,"cool":1},"U0bHWbfVDiooK2wdqxY4vA":{"text":"Delicious!  The ocean sauce is wonderful and the veal tender. It can be a long wait but it","useful":0,"cool":0},"53RinKvR9Xenz84C6kttPg":{"text":"outstanding out of the way but convenient 2nd floor hideaway. had the shrimp pasta with ga","useful":0,"cool":0},"01dyzz09tkj91DRHc4_x3w":{"text":"This place is awesome! You must have the mussels. Very well done and fresh. And two words.","useful":0,"cool":0},"8DI58UvvTDY2i0jWjW6zpA":{"text":"I liked the food. However, the canelloni with crab filling had lots of suprise hard bits o","useful":3,"cool":0},"45HI-GFQsz9omtCWDO_cFg":{"text":"Too bad it couldn't be a sub-zero rating. This review is from 2010, I went here with a pre","useful":0,"cool":0},"5wlZMj4XtNmbCcFDrmy93g":{"text":"The aroma upon entering the upstairs dining as you sign in for your table is the reason yo","useful":0,"cool":0},"hgj5lkc0BpgTkPB3Ud17iA":{"text":"The only reason this won't get 5 star's is that cc ' s are not accepted,  cash only, and t","useful":2,"cool":0},"AZJLf9CJ_13oUfzfDNNnkw":{"text":"It was incredible. Exactly the local spot I wanted to find. Great super fun band downstair","useful":1,"cool":0},"Yd0FITTmsziMGFPzy-Ubtg":{"text":"Really good food. I haven't found better for the price in New Orleans. There are comparabl","useful":0,"cool":0},"xzEO4B1a5slVH0KnJk-IRw":{"text":"This was amazing.  We had a 45 minute wait so we walked around and enjoyed the art alley r","useful":0,"cool":0},"LN0QQZ93GPFi6TTi5UQ6GA":{"text":"The Fish Missy with the Grouper was my entree and the novio has Chicken Taylor. I really l","useful":0,"cool":0},"8SjF8FncY052b0ufth_9yA":{"text":"Amazing! All I can say is the food was ridiculously good! I had the muscles w/ the white w","useful":0,"cool":0},"nPrztSM5d2ROjDqafPxJPA":{"text":"I loved this place!   Someone at our hotel recommended Adolfo's and he couldn't have been ","useful":0,"cool":0},"gLqXAhThI5Y81aZeaoRLgA":{"text":"Delicious! Eggplant Parmesan ap was gooey and wonderful. Red sauce was fantastic. Garlic b","useful":0,"cool":0},"4OITvIDucim8_OKKQpEupg":{"text":"the mussels were amazing...and i am not a mussel fan....\npasta was simple yet tasty\n\npork ","useful":0,"cool":0},"_Zl7X2VaAq5fycsGUEDXAg":{"text":"I was recommended to come here by a friend of mine.  The food was amazing.  We did wait ap","useful":0,"cool":0},"q9z290orHQ65Jtl6JQf5GQ":{"text":"This place was great!  A fantastic spot to take a date. That rhymed didn't it...  We showe","useful":0,"cool":0},"FMscFqSnNPEgmoWi5FMccg":{"text":"The best restaurant in New Orleans.\n\nOkay, so I had only been in NOLA for a week but damn ","useful":0,"cool":0},"bxAF2MpxSUqOKpvRSs7B0w":{"text":"I cannot speak highly enough about Adolfo's. It's a small place, only a dozen or so tables","useful":3,"cool":1},"PrEJVo_bTM9IHkWLeou8SA":{"text":"I came to Adolfo's once before and had an amazing meal and decent service so I was excited","useful":0,"cool":0},"ImnwDaaXBemmCUgWZ7srdw":{"text":"Seriously, unbelievably good. Veal covered with shrimp, crawfish, and crab.","useful":0,"cool":0},"n09paBNtCBGO9yByvkkrmA":{"text":"Overall, the food was mediocre at best and the service was horrible . Many of the dishes h","useful":4,"cool":1},"l4tq13D-ATxTraJ8BTpRsg":{"text":"From the reviews, I think this place is hit or miss. Luckily, it was pretty good when my h","useful":0,"cool":0},"1GzAfhV_BYtBdkFRcv4ABQ":{"text":"Okay.  I don't toss 5 stars around lightly, but last night I had one of the best meals I'v","useful":1,"cool":0},"JrVjbMR8egSbGlwN81aQVQ":{"text":"OK food, but nothing to write home about. Too many great options nearby to bother with Ado","useful":2,"cool":0},"GeigIx3npG1WYUw40iOuug":{"text":"We were expecting so much more from this place. The restaurant is a true hole in the wall ","useful":0,"cool":0},"3PTGThAie5DmsU0Vn4iuxw":{"text":"Located on Frenchman St in NOLA it was one of the best meals I had here!  The wait was inc","useful":0,"cool":0},"oC2KNJWiAt-cmK70CDngiw":{"text":"Best restaurant experience I've had in a long time. Beginning to end, great service, food,","useful":0,"cool":0},"ap6_OodoqOSaIpsF97i9hg":{"text":"We stumbled on this place while strolling Frenchman street and after yelping it decided to","useful":2,"cool":1},"5tPzGia3u_CGNliyT3Hkwg":{"text":"One of the best meals I've ever had. If they have the stuffed trout special, get it. Wow!","useful":0,"cool":0},"iCayjBKRzZs69t2bknf61g":{"text":"Now wait...before you judge the 1 Star, listen to this:\nWent to Adolfo's under advisement ","useful":0,"cool":0},"XpXo2_ljbu9UBFXV5vYXLw":{"text":"I understand the wait time because the place is small and in a popular area, but I was tol","useful":0,"cool":0},"i8jShBBrCOcWUOWptsz6wQ":{"text":"Had this place recommended to me by three separate locals, so I decided I really should gi","useful":0,"cool":0},"wDMgi9GGhkjtfLFFeUWLHg":{"text":"This restaurant came recommended by our tour guide on our bike tour. We absolutely loved t","useful":1,"cool":0},"YFZiuLBiE6FFc47Wzb4CVQ":{"text":"Off the beaten path but worth the walk.  We were turned on to this place by some locals.  ","useful":0,"cool":0},"54J9u0w-CO0-HyXz_LKJaw":{"text":"I went with locals so we were there first in line when they opened and go window seats. Mu","useful":0,"cool":0},"Q6_M9xbajeHvNJbC3hrW5A":{"text":"I had the chicken it was absolutely delicious! My friend had the veil Scotty witch was ove","useful":0,"cool":0},"eGRkz6eQzJF9A6oDC33OGA":{"text":"Everything on the menu is organized around sauces which I love. You pick a protein and the","useful":1,"cool":1},"kS01dAmzvatqDq_T08Udrw":{"text":"The lamb at Adolfo's is superb. Unmatched anywhere. The atmosphere is not so hot, but that","useful":0,"cool":0},"tOCf5OgpEHVPtHeADGGm-g":{"text":"Probably the worst Italian I have ever had in my life.. I can't believe this place is so f","useful":1,"cool":0},"NltwBG7RUg1joVzA6ezv9Q":{"text":"After spending some time in New Orleans,  enjoying unique and creative food at highly reco","useful":2,"cool":0},"6j2PydNVGhk_KHONIRwZwQ":{"text":"Small fantastic restaurant above the Apple Barrel bar on Frenchmen St..  I had Grouper wit","useful":0,"cool":1},"UMCLxF2HH0NO2bIMl6TKcg":{"text":"I hate to write a positive review of this place because it's the most romantic and wonderf","useful":3,"cool":2},"-1pBSKvLwWNQNm1H4GrjHg":{"text":"The mussels were amazing and so was the Ocean sauce they serve on the NY Strip. We went wi","useful":0,"cool":0},"1zKRXMRBrdhC6dNRkpVhjQ":{"text":"Get there right at 5:30 and guarantee yourself a table. The restaurant is very small and o","useful":0,"cool":0},"XFNtkEb0WxVlgnvldVQeAw":{"text":"Went to Adolfo's while looking for a place to eat near DBA and Spotted Cat. There didn't s","useful":0,"cool":0},"YjjyRUb1LVOTBnmYxkWZnA":{"text":"The food here is so decadent!!!  Best food we had in New Orleans...despite not being creol","useful":0,"cool":0},"9grq-RZqa7pQVfQ3DadnlQ":{"text":"Amazing meal! Best mussels I have ever had! Great experience. Small location. Maybe 10 tab","useful":0,"cool":0},"BvigvkeHHOIo0fn5DWXv9w":{"text":"Went back to Adolfo's for another crack at one of the best fish dishes in the city. Going ","useful":2,"cool":0},"_kfERsxmnT2YeRLgOIqkuQ":{"text":"Fantastic cannelloni (crab & corn), with the best spicy 'pink' sauce I have ever had!!  Lo","useful":0,"cool":0},"1ZEl1iWvQ_qqiJo61qoQTw":{"text":"My husband and I are picky picky picky.....and we loved the food at ADOLFO's.....I'm absol","useful":0,"cool":0},"O0Ex3nfF5bwrA7l2gWMA8Q":{"text":"Some friends and I were just talking about Adolfo's, their nephew had just discovered the ","useful":16,"cool":12},"9NJDl_YQVA2tx57Gag2_hA":{"text":"So so soooooooo gooood!\n\nService is slow, there is only ten tables but its ok. I will alwa","useful":4,"cool":4},"uP8LHnixetQaAlKWVU-dIg":{"text":"The cannelloni was very very good, the sauce was wonderful. But it's enough to share.  A l","useful":0,"cool":0},"iienO1VDi-BJJdgOaXslLA":{"text":"If you want Italian food at its best, this is totally worth the wait on a crowded night.  ","useful":1,"cool":0},"sMWzULOf789nYFfGXm5f9w":{"text":"Sunday night mid may...we walked in no line...but tables full.  So we put our names in, ha","useful":0,"cool":0},"uCls6TpV7L3Gr6I1zKRLlA":{"text":"Probably one of the most confusing worst meals ever. It made the silk worms I eat on the s","useful":1,"cool":2},"nokk4qPFB39WjZm9_rASeQ":{"text":"Went here based on the recommendation of a local.  At first look, it seemed like kind of a","useful":0,"cool":0},"4FA6IiR2sX4Trxi0cJ--ag":{"text":"I was disappointed in my experience at Adolfo's. The waiter was snotty and when I asked if","useful":5,"cool":0},"77Yi97aruHbqih7IO1bFrQ":{"text":"Incredible food for the $. We tried the grouper fish with pasta, shrimp and crawfish and i","useful":0,"cool":0},"7WEuV-RfkZLuCky-5fHx5w":{"text":"Dont let the small sign and narrow stairs up to the restaurant scare you.  This is the bes","useful":0,"cool":0},"YXj4HQgCBsw5Hade1j7OhA":{"text":"Just know there WILL be a wait. With that being said, just when we started complaining to ","useful":0,"cool":0},"kCb8d9Pjh_J5ElH6jC9M6Q":{"text":"Asked a local where to go & he sent us here for one of the best meals we have ever had!! T","useful":0,"cool":0},"XrCm5WfWJfTsbnspuJGgSg":{"text":"This is not a bad establishment, nor is it amazing.\nWe started with some oysters cooked in","useful":0,"cool":0},"rsFpyockZT3RtEqYyI404A":{"text":"Disappointed. After being seated it was more than 20 minutes to get the appetizer and over","useful":0,"cool":0},"WblT9OD2L0twiAU_IqYkfg":{"text":"Food was good.  Creative and unique.  \n\nNo AC can be rough.  The amount of garlic used in ","useful":0,"cool":0},"-YKFik6BwA-fnovQlHPQrA":{"text":"Very good food, hands down amazing. Really need to update furnuriture, my seat broke and s","useful":1,"cool":1},"wf2LQ5mtmATu6BEIVJzRZQ":{"text":"Came on a recommendation from a server at Brennan's. Ohh my!!! Small lively place, great m","useful":0,"cool":0},"CJEaiEhQFR6wa0iM8x-pqw":{"text":"Fantastic meal on Frenchmen.  Teeny tiny place upstairs with bout 10 tables.  Server was g","useful":2,"cool":0},"7qGh5jbgdnGh52OdNBnHNQ":{"text":"First time in NOLA, awesome food and atmosphere.. ordered the pork chop special, whoa was ","useful":0,"cool":1},"sjgXkmICAj91MNwNCzju5Q":{"text":"I was super stoked about eating here reading the reviews but unfortunately the food fell s","useful":0,"cool":0},"fEIttIdORfz9aWfbJWE7gw":{"text":"Wow Wow  Wow. I almost missed out on this place because my friend told me it was italian a","useful":0,"cool":1},"uBqjI-qH7ieKoohlyzsxFw":{"text":"Phenomenal. The level of quality against which I judge all other restaurants. Nothing coul","useful":0,"cool":0},"WfYXSW9qE5xOjokuaCNTPA":{"text":"Been here a couple times.  The food and service are always excellent.  Be prepared to wait","useful":1,"cool":1},"o6wQkV29Zu0AKgCJJABt4A":{"text":"My fiancé and I came here for dinner, despite warnings of terrible service, but we had one","useful":1,"cool":0},"5y72Y8NqkBIU6PSqLFcrbQ":{"text":"I love Adolfo's for the atmosphere, wonderful service and of course the food. The portions","useful":1,"cool":0},"5cLvZw0C4mOTzFet5iWeDg":{"text":"This place is absolutely delicious! The prices are very reasonable for what you are gettin","useful":0,"cool":1},"l-qJgcsuFUorGTdwiFPkLA":{"text":"Very good food and service. AC doesn't work so well, so summertime is hot but just read th","useful":0,"cool":0},"ZH7NeA3y8xP0r9ZX-0_Yeg":{"text":"One of my favorite restaurants in New Orleans. If you are a seafood lover, the \"ocean sauc","useful":2,"cool":0},"--3Yvy3hkE4HYa9PJ0fosA":{"text":"Great food, great bar, great bartender - worst waiter EVER!!!!\nWe waited 30+ minutes after","useful":1,"cool":0},"pY4dWqKbn4S9lZ4UnmpMAw":{"text":"Referred here by locals, and my how I was amazed.  A group of about 6 of us walked in abou","useful":0,"cool":0},"aUl8dcmutEuZHeFKY5SROQ":{"text":"The food is amazing. Really great dining experience. I'm amazed at what can come out of su","useful":0,"cool":0},"Gsk2UFxVl3ZIMgY411Owlg":{"text":"30 min wait at downstairs tiny bar while listening to jazz band, is worth it. This restaur","useful":0,"cool":0},"krHnXBKuS5kxfOHS-ayUuA":{"text":"This place is super small and you'll miss it if you're not paying attention. The wait was ","useful":0,"cool":0},"uBn_6Ukj-f-SKUp-Or873Q":{"text":"Our food was wonderful. I haven't had such a delicious meal in a long time.  The reason th","useful":1,"cool":0},"oMF311ttgkhMK6a80GURkQ":{"text":"Wonderful food....have eaten here both times I have been to New Orleans.  I am sure next t","useful":0,"cool":0},"6QGEWbsgQwM4FTvkn072rA":{"text":"Fabulous final night in New Orleans meal at the cozy little Adolfo's....on a Tuesday night","useful":0,"cool":0},"6f9n0g5ocaXoOZJb1cyoGg":{"text":"Food was excellent. A bit crowded and they only accept cash","useful":1,"cool":2},"IEyv_jjJZDmqOwUry0Ur2Q":{"text":"Omg the stuffed grouper was amazing!!! Service was incredible. Our server Isabel took grea","useful":0,"cool":0},"hsCUpMi6ipw8U8snWCkklA":{"text":"Loved the Drum fish Nick style. Got lucky and walked in and got the last table on a Monday","useful":0,"cool":0},"kjYOdaKNInZyUKTnZhkqQQ":{"text":"Amazingly intimate spot and everything was delicious. The Rack of Lamb was perhaps the bes","useful":0,"cool":0},"RAKItgq45RDwnZmr3mrBAw":{"text":"On my second day in NOLA, I had a big time craving for some pasta. So I did a search and f","useful":0,"cool":0},"3EFkDctcnZXgXQvPImYIJA":{"text":"This place was so delicious and so awesome it's a little small on the inside but the food ","useful":0,"cool":0},"F9hO0hnmT7SbpDI-nGDfGw":{"text":"My mom and i visited new orleans for a week and this was, by far, the worst restaurant we ","useful":2,"cool":0},"CerSC5-t-YaX6FHpQ1HpHg":{"text":"Always a long wait but totally worth it. Great food and reasonable priced. Get anything wi","useful":0,"cool":0},"QO5JRVO3-QWaBpDgq-Nnwg":{"text":"We were lucky enough to make it in for the last seating on the first Sunday of Jazzfest, s","useful":0,"cool":0},"iTf7yLs7gFoboaFzerC8lQ":{"text":"We walked in and were seated right away. We ordered the lamb and the stuffed flounder. The","useful":0,"cool":0},"qAWII8aHTPpJ4KSWc1UHug":{"text":"All I can say is that our waiter TIM was out of this world awesome!  \n\nNext, the wait was ","useful":3,"cool":2},"U7yEn5wJCbit9i7QkF_oDw":{"text":"Everyone recommends the grouper with \"ocean sauce\" which is shrimp and king crab in a whit","useful":4,"cool":0},"wMvhB7suYBHXAnGRkfi5gw":{"text":"Only giving 4 stars because of the insanely long wait and the fact they enjoy their A/C to","useful":0,"cool":0},"I3cB_LOD_AXS80vQYazffw":{"text":"InOnly one word....Fabulous.  You will be VERY happy you waited in line to eat here....Rec","useful":1,"cool":0},"_5P6kkBGU12cRQpuxscnug":{"text":"Worth the wait. Tiny restaurant. Fabulous food. Garlic bread is the best. Its amazing what","useful":0,"cool":0},"N92YXjuyhj8CoKthA9Fe-A":{"text":"Adolfo's has some of the best Italian American food in the city.  That being said the menu","useful":0,"cool":0},"VnC2o8dSrDCdjrqYhMf8JA":{"text":"Went here for dinner while in New Orleans and it was one of the best meals I've had in yea","useful":1,"cool":0},"5vbLNaNpPmi6e7I0dJ2Tcg":{"text":"This one star rating is not based on the food. I don't live in New Orleans, but traveled t","useful":0,"cool":0},"0JFrmTqtCk0fziCV7L96vQ":{"text":"What a pleasant surprise. Tip from people we met on the road. The place looks very basic. ","useful":0,"cool":0},"hj3Qb0V3LpJTPkeWvo_T6g":{"text":"Don't let the Italian name fool you this is no red gravy joint. They specialize in fresh f","useful":4,"cool":2},"agVt2rGaSd5iRSCR09hRKQ":{"text":"Enjoyed live music and an Abita in the bar while we waited for our table. Service was exce","useful":0,"cool":1},"c26IYWUJ2ZrBjhbS9vsJpg":{"text":"two words come to mind... garlic and charming.  If you are with a big group or in a hurry ","useful":0,"cool":0},"xoV3g9grFBjPiXSy8jhPhg":{"text":"This place reminds me of Vincent's, but small and on the second floor. I love little cozy ","useful":1,"cool":1},"IyncdMd27YYJpGPj2fq3cg":{"text":"My friend and I were visiting New Orleans for a long weekend and looked forward to dinner ","useful":2,"cool":1},"Y5S81kUy1tRHJ107wVr1GA":{"text":"Really cool atmosphere. The dive below, Apple Barrel is great too.\n\nNot sold on the pasta ","useful":1,"cool":0},"FH9bPB7SEomOpYps2hApZQ":{"text":"It was just awesome food!!  We were told a long wait but it ended up being relatively shor","useful":0,"cool":0},"ogL7NTxogo6JcgHhzhZzeg":{"text":"On vacation for the first time in NOLA, my boyfriend and I tried this place based on a rec","useful":0,"cool":0},"t65q11FWQvbXWSy3d9Xs0g":{"text":"Let me say, I've been here before and loved it. This is where we came on our second date. ","useful":1,"cool":0},"ucaWEQ-uldV7vOGoXQEaBQ":{"text":"Had the veal with ocean sauce!!  Wonderful!  Fiancé had mussels special and loved it!  Too","useful":1,"cool":0},"AeJmb2f11rNmx00OCWgdeg":{"text":"Just OK, wouldn't go out of my way as we did to go there.  Mussels were off, waitress (Zoe","useful":0,"cool":0},"d738_Fl5VMVFOepQILoQvw":{"text":"Get there at 5:30 when they open.  Cash only.  Now that I got that out of the way.  Such g","useful":3,"cool":0},"4UibhdHfXJyEEgno8WX6LA":{"text":"Be prepared to wait at least an hour before you're able to be seated, so have a drink or t","useful":0,"cool":0},"E1gBGMPFCrsJXGswDk0Rvw":{"text":"When i lived in the quarter this is where i ate often and brought many out of town friends","useful":0,"cool":0},"eS_z8ak6POIZm1MvaKwT5w":{"text":"A+ meal all the way.\n\nBe prepared for a significant wait, it has 10 tables!  Cash only as ","useful":1,"cool":0},"zEd4d-FZNVkJKA_svhU1TA":{"text":"My boyfriend and I stumbled upon Adolfo's last winter (December 2010) while we were visiti","useful":0,"cool":0},"KrQKu2idpf1WgVV0ZLJYwA":{"text":"Fantastic!!! Went here with a group of friends and everyone raved! I will be taking my par","useful":0,"cool":0},"Rr7QXrtzfwOgKcYy_6rDUg":{"text":"Wow.  Wow. Wow. We loved our experience here.  Staff was friendly.  The place is sorta hol","useful":0,"cool":0},"vEGT7zGGTvC81F2nz585IQ":{"text":"My friend told me about this place.  It was amazing!  My boyfriend and I got the Redfish O","useful":2,"cool":1},"5j8h8ZKyGqm-sigU1eaSpg":{"text":"Food was wonderful service great. Thank you Markie for your wonderful service and beauiful","useful":0,"cool":0},"kliYVruS1lVXFwoOKydZ3Q":{"text":"A must-stop if you're in NOLA! \n\nI've eaten here twice, both times on separate trips, and ","useful":2,"cool":1},"AHZ2dZ2D5VL1BKsIcoz1Gg":{"text":"My wife & I decided to go to Adolpho's based upon two different recommendations that the r","useful":0,"cool":0},"cGoFTh75_yRgIevhK88qWg":{"text":"The stuffed flounder is AMAZING!!! Would go back again for the muscle appetizer alone! Lam","useful":0,"cool":0},"BkeYqsspSozMwnOBpZhx_Q":{"text":"More on the pricy side but well worth it.  It's a small place so plan in advance before yo","useful":0,"cool":0},"YXCXX1_ooIRMbDPwazeFrA":{"text":"We ended up here twice in the same week. If there's a wait, it is well worth it. Can't bea","useful":0,"cool":0},"-zCP5dK9Ah_sL1-udk8QEQ":{"text":"Buen secreto en Nola! Básicamente está arriba de un bar de jazz, que no fuimos pero que pa","useful":0,"cool":0},"Y0L5WHUlPH6WJ0rcVPPOiA":{"text":"Took my wife to New Orleans for the first time and we hung out at Frenchman St doing a lit","useful":0,"cool":0},"MX_VOQBNC7hjynTUmIGCbA":{"text":"It was the night after the \"Storm of the Century\" January 2014 in New Orleans where the ci","useful":3,"cool":4},"UaOPTGWgA8GRRhjhooStTg":{"text":"Mussels, lamb chops, pasta, chicken dish, I mean EVERYTHING. Couldn't even take the time t","useful":0,"cool":0},"QdH7ReZSg_0uwi04GVn7CQ":{"text":"Great location. Came here for dinner on a Monday evening. The inside is really cozy. Lots ","useful":0,"cool":0},"O9Uu5wh5hRz9w1f6XxQiBA":{"text":"Adolfo's is above the Apple bar; the dining room is small and dark, and right next to the ","useful":2,"cool":0},"ZwBnN3IW36H9xqgs_wrZcQ":{"text":"I am willing to convert to whatever religion will grant me one more meal of the heaven thi","useful":0,"cool":0},"x8O-tZqbUg4GeEKDQEFL2A":{"text":"If you walk too fast, you'll miss it - it's that tucked away. Walk up the stairs and it'll","useful":0,"cool":0},"gUKG4qXVFYjETrrBASCCvw":{"text":"More of 4.5 stars than 4!\n\nIt's a lovely little and down to earth restaurant, very cosy an","useful":2,"cool":0},"W0Gbrpr3Vq5XQI55rcdeIA":{"text":"I remember going here over 10 years ago and enjoying the food and experience, perhaps beca","useful":2,"cool":0},"1AKkANGVUK9IyV_2i3CWZQ":{"text":"In line with everyone else's reviews, I found the stuffed flounder to be delicious. My wif","useful":0,"cool":0},"Ylqtya6iLHiFxgcXEfftLg":{"text":"Was amazing. Meat was cooked mid-rare (perfectly), sauce was delicious. This place was rea","useful":1,"cool":1},"Q7xq2CDmsNMF2lGk59sDMg":{"text":"One of the best restaurants for seafood Period.\n\nOcean sauce, with just about anything, an","useful":0,"cool":0},"Kyrw5vKWtnuKy_NjsHDcSg":{"text":"First time eating here. Food was okay. Not worth the price for the quality and amount of t","useful":0,"cool":0},"CE1p_1TxZfd46qev2jepSA":{"text":"Unbelievable!!! The douches that gave this place a one star deserved the experience they g","useful":0,"cool":0},"_fyHtV600Nn2WROkiMOiKg":{"text":"If your a seafood lover always choose the ocean sauce. It's so delicious. Dip your bread i","useful":0,"cool":0},"pPdAaxCv3LJpD_syp6aPWA":{"text":"A great recommendation!  Totally worth the walk if you are on the other side of the Quarte","useful":0,"cool":0},"gwoXnRb0CvqM_u4GdBy5BQ":{"text":"Adolfo's is a hidden nook of awesome above the Apple Barrel bar. This place is very small ","useful":3,"cool":0},"wu2fEouEspoNZ5QgN526Sg":{"text":"Without a doubt, I had the best meal of my entire life at Adolfo's during Jazz Fest 2015. ","useful":3,"cool":1},"wYJ0V13eavqvs5-WgeUHGA":{"text":"Worth the wait. Get here early otherwise you may be waiting an hour or longer for a seat. ","useful":0,"cool":0},"RrNXjTAGhJfdgvLlijTaAg":{"text":"Loved it! I was recommended to eat here by lifetime New Orleans residents and they weren't","useful":3,"cool":0},"QZlRJi7BhtgVyoK33gQMAQ":{"text":"A few friends took me to this place for my birthday, we waiting 2.5 hours for our table. O","useful":1,"cool":0},"Uz-12v3CJKzOv64NEHnasA":{"text":"Grouper Ocean. Nuf sed.","useful":0,"cool":0},"IQqdxuOpnIdM0CI7Ybk8Pw":{"text":"So I read all the reviews and had to make it a point to eat here.  Welllllll, okay, the fo","useful":0,"cool":0},"vOJttgmT2Sfs2D17ZqRc_w":{"text":"This is a hidden gem in the Marigny.  No matter what I've ever ordered, it is always good.","useful":2,"cool":0},"vLxfSNVP_opuenJySz5cxw":{"text":"It's  rare I write a review but honestly I'm a chef and this food was boring! Sorry not so","useful":0,"cool":0},"eZ9IGxhD9iyglR4b02fZ-g":{"text":"Had my first Adolfo's experience recently. Loved it.  YUMMY.  Worth every calorie.\n\nI'm ho","useful":1,"cool":0},"g36m-Tz8EzajMiw8S__Dxw":{"text":"Love love LOVE ADOLFO'S!!!! The best food i ate while i was in NOLA a couple times in a ro","useful":0,"cool":0},"d7p-ZcY52sfgz0GeMtuz0g":{"text":"AMAZING! located above the apple bottom bar which is a great place to wait, because wait y","useful":0,"cool":0},"_fI6Itxa1XYtG0-_lrfsuw":{"text":"WOW. Got this recommendation from a local bartender & I'm so glad he told us about it. Thi","useful":0,"cool":0},"nCc-rSBwa7aMmw497ffe1w":{"text":"Appetizer: Spinach cannelloni was super tasty.\nEntrees: There are multiple ways to mix and","useful":2,"cool":0},"85crjMOlX4aU1H4_0e-wdg":{"text":"Beautifully cozy and perched above Frenchmen Street this place is indeed a gem.  \n\nWe got ","useful":2,"cool":0},"a_UXQozqHVYIqmlLSjgfMw":{"text":"I've been to places from NYC, LA, Vegas, Dallas, Memphis, Paris (France), Florence and Rom","useful":0,"cool":0},"FDxqpGUEy7caimy_xAr0eA":{"text":"We waited almost 2 hours to get in, but sadly it wasn't worth the wait. Fun ambience, thou","useful":0,"cool":0},"0ytDucNRgbI3nrI_YzXo3A":{"text":"Wow this place is good. While we waited for a table, we listened to a great band play some","useful":0,"cool":0},"J1uXDZeQLnKr02TUXuZdaA":{"text":"One of the best meals of my life, stop everything you're doing and eat at this fine establ","useful":0,"cool":0},"Sns9HL4cJpD1j_z7vO8u4A":{"text":"Great service and environment. The pasta was bland but the flounder fish special was good.","useful":0,"cool":0},"HDZPvogEIFlmpHsnulBrFg":{"text":"Our favorite meal while here in NOLA!! Hole in the wall restaurant, all locals inside. Gre","useful":1,"cool":1},"Kd5LUJ-tetxwJrOlTp46Hg":{"text":"The grouper with crab meat, shrimp, crawfish and capers in ocean sauce was probably the be","useful":0,"cool":0},"vdxr-bqTyapf-p-gRmw_wQ":{"text":"We were told this was so good! However for us the reality wasn't so great. The appetiser o","useful":0,"cool":0},"HWQh9Ue4IuOm8Wt_3eUhCw":{"text":"Fantastic spot on Frenchmen street not to be missed! No reservations and only 12 tables bu","useful":0,"cool":0},"7EyLAb2Ag-JOPWi8GlOS6w":{"text":"They gave everyone at my table a dirty glass.  We heard our waiter say \"i need a glass.  I","useful":3,"cool":0},"WvtdTrOQuSSDhFQ5PJ5ISA":{"text":"Can you possibly give a better review.  Yes it's a dive.  But wow this is old world Italia","useful":1,"cool":0},"Ggjo72P4vlPNI66A4RbBaw":{"text":"We had a great time at the Apple Barrell , but we didn't like the food. The appetizers whe","useful":0,"cool":0},"mDCjXXhs_Aqz8TruD__4yQ":{"text":"Very tasty. Service started slow because of a miscommunication to our server but it ended ","useful":1,"cool":0},"i15S70j2SJ01eWhUJwc2Zw":{"text":"I can't say it was the \"perfect\" experience, because there were a few hiccups to the eveni","useful":0,"cool":0},"kT5XdwPJdvvGK0jwPw86ag":{"text":"One of the best food in New Orleans, just amazing blast of flavours! Keep it up! Their esc","useful":0,"cool":0},"oQmXxKxgLAlac5Gs3p1biw":{"text":"Staying up the street from Adolfos at Hotel de la Monnaie, we ventured into the restaurant","useful":0,"cool":0},"-XrAPROQQ5dY-jOaovu1oQ":{"text":"adolfo's is ADORABLE despite salon-style amateur new orleans-themed paintings purchased fr","useful":0,"cool":0},"AQQb6qdhan3USeoRCYw3JQ":{"text":"Our experience didn't start out too great... Somehow the waiting list skipped us (4 partie","useful":0,"cool":0},"a617wKBZbigkBPfwdcpGuw":{"text":"Amazing night! You must go see Jack Sledge on Friday nights!! So much fun. Our server was ","useful":0,"cool":0},"-CQcDyLm4hKe0lGejjv53w":{"text":"Italian New Orleans style...Just sat down but so far the smell of garlic is seeping throug","useful":2,"cool":0},"pW4QmOL5M43hMQJXVrp9NQ":{"text":"Lovely, lovely food. Quality of commanders Palace, but not near as pricey. Cozier atmosphe","useful":1,"cool":0},"a7e1LPW3MDpPOmdMY9nqgA":{"text":"This was very disappointing. The food was flavorless and was just seemingly smothered in s","useful":1,"cool":0},"4if-ZiK-Yk3v6XV6ijeJFQ":{"text":"Very interesting place! Great little gem tucked away upstairs in a small dining room with ","useful":0,"cool":0},"v7gAVBFOqKdIvQea6lIHbA":{"text":"We went to adolfo's to celebrate our best friends 34th birthday the ambience food and staf","useful":0,"cool":0},"8LBbKcMs5OIZjo9_RElsIQ":{"text":"Absolutely positively one of the best meals my fiancé and I ever had and the best way to e","useful":2,"cool":2},"JGMHaqzY29KcjPCF5iJ1MQ":{"text":"A local recommended this spot to us and what a memorable evening it was! Maybe about eleve","useful":2,"cool":2},"k5KajQ8bZbud1pduLbVFqg":{"text":"Seriously considering jumping in front of a bus after this meal so I know I will die happy","useful":0,"cool":0},"Z6PkRA6xJKgg6LdDV-cp8A":{"text":"Absolutely the best. Cash only. The wait is worth it! Their signature ocean sauce is amazi","useful":0,"cool":0},"z08ZSbyOxtJjyzPmVAjD8w":{"text":"Well my dear friend an English teacher helped me write a review with a great assortment of","useful":1,"cool":0},"SOcULjuuj3mCtRSf4Q4_Hg":{"text":"Earlier reviews still stand. Great place. Get the grouper with missy or ocean sauce. Lamb ","useful":1,"cool":1},"aN1yJIO7_sh-klR2EydsIA":{"text":"Great sauces for everything. Excellent Italian and seafood cuisine, steak could use more f","useful":0,"cool":0},"W8sm5cudBQL37BLxJl1hyw":{"text":"As always excellent! The smell of garlic meanders though Frenchmen street blocks before yo","useful":1,"cool":0},"F81i-e67YSV-qxGlg5LiDw":{"text":"An hour long wait for mediocre drinks and worse pasta sauce. \n\nThis whole experience start","useful":0,"cool":0},"dvt3Wx2L-Glxk3InEphpyw":{"text":"Good food but overpriced.  They are cash only and make you pay a $4 ATM fee. Cash only wit","useful":0,"cool":1},"7Je1KAFzBLfJCwP5baX5FQ":{"text":"Had a 45 minute wait, but it was actually kinda nice cause you can wait in the bar downsta","useful":0,"cool":0},"ksknJrDAoMvx6t5gcgmgQg":{"text":"We came on Yelp recommendations.  Sunday night had a two hour wait by 7:00 PM.   We came b","useful":0,"cool":0},"mzv9HbucznJ9IhSTghaoJQ":{"text":"This restaurant came highly recommended while I was on a jazz talk tour that ended on Fren","useful":0,"cool":0},"caRMMdEka3gJOVl3wIbcwQ":{"text":"Terrible. Terrible. Terrible. Do not waste your time or money here. My husband and I went ","useful":6,"cool":0},"j7ESc-AbPdimuI_32T8CJQ":{"text":"This place totally surprised me. It was recommended through a Canadian couple we met on va","useful":0,"cool":0},"uVMDAAqrCeuRnbk7bRXQDg":{"text":"This place had 4 stars when I decided to go there. I am a big fan of the apple barrel down","useful":0,"cool":0},"rQl65oHCqegrQbj-K0FVkA":{"text":"After being recommended by a local gentleman we had high expectations. Unfortunately can't","useful":2,"cool":0},"Yx5Ejegjt4FKGTlh8eP20w":{"text":"I always recommend this place. Food and service always spot on! Eat here and dance it off ","useful":0,"cool":0},"19pAPMaUsSZHkMnhUzfaKg":{"text":"Very good food. The restaurant is very small, maybe 10 tables. They don't take reservation","useful":0,"cool":0},"VRhdq088E3meFBr1W9outA":{"text":"Excellent.   Great experience.   A very cool place unlike any other.  Just know that the w","useful":0,"cool":0},"TdITK364ZBR4QkPwQ_pqAw":{"text":"Absolutely wonderful, Groper with the ocean sauce was one of the best meals I've ever had.","useful":0,"cool":0},"eDvl4WeubViqnZA20Ry5FQ":{"text":"What's pimp about this place is the location and the fact that it's BYOB.   Otherwise, jus","useful":0,"cool":0},"w4Dgkd36t4teVr8btnh5ug":{"text":"Adolfo's has a delightfully casual/divey ambiance mixed with high quality food and a very ","useful":0,"cool":0},"OozqvPW7apjZN0oImDiHAw":{"text":"Great location, incredible food. Expect a wait, but just grab a drink downstairs and enjoy","useful":0,"cool":0},"fCIEPECyd915RC0mhhhs2Q":{"text":"Service is good. Restaurant is super cute. Crabmeat and corn cannelloni was great. Garlic ","useful":0,"cool":0},"NnA70dRZk41PY85f9AW6pw":{"text":"It's a shame I have to take a star off this review because I truly loved this restaurant. ","useful":1,"cool":0},"UDHQgnx3cgDFbeFpJe5FQA":{"text":"Never have been disappointed went there last year also, amazing food, thank you to Chelsea","useful":0,"cool":0},"AeAzXD5yQZyftkqVqvSXXw":{"text":"Holyyyyy this place is SPECIAL. We waited an hour for a table at 6pm on a Saturday night b","useful":3,"cool":0},"joMfPhkKBJR7OhQsZVZ-5g":{"text":"Continues to be a great dining option in New Orleans. Stuffed flounder (special), grouper ","useful":3,"cool":1},"6t_kEriYp8g3L-rEjkzSmw":{"text":"Stumbled into Adolfo's one night while on Frenchmen St. with some friends. We came in just","useful":2,"cool":1},"89ftNuQL2uL2bS6pqym9eQ":{"text":"The best meal we had all weekend.  Everyone at the table moaned, danced, and one of us mig","useful":1,"cool":0},"tZM9mhsQMnNW4skyESs5lQ":{"text":"Great local Italian food upstairs. Cozy ambiance and good service.\n\nOdd thing is that they","useful":0,"cool":0},"xFCAN9KV6PTghdm4HbFJqg":{"text":"This was by far the very best meal I had in New Orleans. My dear friend lives a few blocks","useful":1,"cool":0},"JygC1Zp_p4UIB_HyEiRTDA":{"text":"We've been coming here for years although the wait times have gotten pretty extensive.  We","useful":0,"cool":0},"7D-Yur28SzNhSpyyYZiAiQ":{"text":"Love this place. We've been back a dozen times, including last night, which was again a wo","useful":0,"cool":0},"ybFi_V_gNnrUIPaB6tisVw":{"text":"GET THE FLOUNDER. Brought my 1 year old. No high chairs but she sat on my lap and the wait","useful":0,"cool":0},"QUx9N4c0xNb9KZPt3GLusg":{"text":"We waited 1.5 hours to be sat and once we got settled in, the server told us that it is re","useful":0,"cool":0},"qyPNFCPRxObUCP4PUEEBHg":{"text":"This place was actually really good a couple things that i didn't like was cash only , the","useful":0,"cool":0},"sHUn0ILHstmvg0s5XVD64Q":{"text":"Get there before 6:00. The portions were large hence the fair price. I'm a seafood veteran","useful":0,"cool":0},"ED2-7gQIGMuwzsn_UE818A":{"text":"Adolfo's is right n Frenchman Street, amongst the bars and music clubs.  But that's just t","useful":0,"cool":0},"O-s46XqY6wwJq3C2tzo2MQ":{"text":"Maybe unfair to judge an Italian restaurant in the deep south of Louisiana. Especially wit","useful":2,"cool":0},"eFpe_3Ya5q0K379R3BAOAw":{"text":"Went here for my 50th birthday celebration. Awesome food, great service, and fairly priced","useful":0,"cool":0},"nCYxuouwNJoyhEdhQ9LnYQ":{"text":"This place came highly recommended, we just took their word for it and had no idea what we","useful":2,"cool":2},"5C4TNCi6s1WY8saiCj_RsA":{"text":"Ate here twice on this trip to NOLA....both were great.  First night was stuffed flounder ","useful":1,"cool":1},"pMrSME1ZBVNfhAGjhjLvOg":{"text":"We ended up here twice in the same week. If there's a wait, it is well worth it. Can't bea","useful":0,"cool":0},"Aq-5aAagomKI7zOR4A7lSA":{"text":"Wonderful little place above Apple-barrel's. \nMust try the steak with the ocean sauce. It'","useful":0,"cool":0},"MlQAh-pCaNBiuPl_GE1z0w":{"text":"1st Friday night of Lent, thought if we got to Adolfo's by 6:30 we wouldn't have too long ","useful":3,"cool":2},"ogYgYtxdBCCu4Mje8BO_3A":{"text":"Teenie quaint friendly and right above some of the best music on earth the steak was perfe","useful":1,"cool":0},"yyt6ltgk3LCzNtfuay7iwA":{"text":"We were on vacation the week after Christmas and OMG this place was amazing !!!! ( a serve","useful":0,"cool":0},"ypvb3-TsXnPjg29tQrR-kA":{"text":"Always good!!!!!  Ocean sauce is out of this world.  The specials are always the best.  \n\n","useful":0,"cool":0},"pycTw_1KBhPl_Xk7UYz2lg":{"text":"UPDATE - We returned and could not have had a more perfect experience. We loved it the fir","useful":1,"cool":0},"vHgn9ezTy0aacCup6bam-A":{"text":"30-60 minute wait ended up being almost two hours.\nThe reward? Probably the worst meal I'v","useful":0,"cool":0},"lFBNxdXTh74MF_eNjKDZ0Q":{"text":"It is a cash place so be prepared. But defiantly worth the long wait, which you can avoid ","useful":0,"cool":0},"x6objnGiRR9X1tD1R06s3g":{"text":"Cash only and if you don't have a reservation you have to. Wait down a steep flight of sta","useful":0,"cool":0},"68qqdwMEoERvgCaI53xSsQ":{"text":"An amazing meal! Off the beaten path of the French quarter but only a street or 2 over!  G","useful":0,"cool":0},"ZqgwuikIgPzS0ATc2526ZA":{"text":"Excellent food and atmosphere in this quaint little Italian with a taste of creole restaur","useful":1,"cool":0},"tO9UACajHRCu6Ep27QExGg":{"text":"Came here on a recommendation of a friend. The wine selection was pretty bad. Navigated ar","useful":0,"cool":0},"44QJZPL1ypK0DPVt9BlCCw":{"text":"This was our second trip to eat here... won't be back!\nThey need a bigger area.  There wer","useful":0,"cool":0},"z4pWsZ6si8zjmE23mvTdlg":{"text":"We heard this is a very good restaurant with exceptional food. Based upon that recommendat","useful":2,"cool":0},"6OJB6H3d7nbYo7ypENw5mg":{"text":"Very good foods- small place. \nEverything is delicious from the lambs to the steaks.\n\nOn S","useful":1,"cool":0},"n9KKSGuoabGfJfZncBlhBw":{"text":"Allright. I don't get the hype.Our party of 3 was seated without any wait Friday at 6:30pm","useful":3,"cool":0},"jfBpqsL0fzRqmYOFQNWcUg":{"text":"The service was excellent but the food was just awful. The pasta with marinara was very wa","useful":1,"cool":0},"1MutWHo56WV60uxx0j5gJw":{"text":"We waited an hour and a half and when we were finally seated we were told they were out of","useful":1,"cool":0},"CDNDICJsM6IF4TPj4PE6Qg":{"text":"My best dinner in NOLA... Get the ocean sauce on whatever you order. I got the flounder th","useful":0,"cool":0},"sDPXnEJ5YLKF0nIvZcTzbA":{"text":"Our last night meal in NOLA had to be memorable, and upon many recommendations, we decided","useful":1,"cool":0},"oqTE2A-yXHgB4idopxTyNw":{"text":"Best food in a long time! Great atmosphere even if the ac is broken. The smell of garlic b","useful":0,"cool":0},"KWeZ2UJBk0HPXErYURoQGQ":{"text":"ADOLFO'S DRIVE THRU\n\nHurry up and wait, hurry up and order, hurry up and eat, hurry up and","useful":2,"cool":0},"dt_otnAfVjNbZGvFKDohqQ":{"text":"When in NOLA, make sure you make your way to Frenchman Street and walk in the red door to ","useful":0,"cool":0},"lkz22n2KpFvcC7IS7LvQ0w":{"text":"Went there tonight with friends and had a wonderful meal. Our waitress was so helpful when","useful":0,"cool":0},"hO6ODHlt9bwNWJbk1F5VhQ":{"text":"YES. Do yourself a favor and come to New Orleans to eat here before you die. Two words: Oy","useful":1,"cool":0},"Q7mKuEcTa0yVZGOyQo0qOg":{"text":"Found this randomly by searching the area and WOW! What a gem! It's cash only so definitel","useful":0,"cool":0},"fa5fSyi60fifLp5Tai14TA":{"text":"You can pay more for dinner in New Orleans, but you can't buy better meal. This cute unass","useful":0,"cool":0},"HFmxcOLxI90GYLodghWDCw":{"text":"I had 2 friends visiting me in Baton Rouge from NYC- so naturally we headed to NO for some","useful":0,"cool":0},"9xGodnSABhOhcp4FWAOrNg":{"text":"Let's talk fusion: Creole-Italian. I just had one of the best meals I've ever eaten. Veal ","useful":0,"cool":0},"OwCqvp8eeyvmenLHCiigFw":{"text":"This is how every 2 star yelp review starts:\nI wanted to like this place, but I couldn't.\n","useful":5,"cool":0},"lP8RVcrOmLy65HNTWO0IQA":{"text":"Priced too high for the ambience. It's a dungeon and it's very loud. The place itself is h","useful":1,"cool":0},"tR-84iDGJ0wbSGoBUITSTw":{"text":"I very rarely go out for Italian.  My girlfriend frog-marched me here after her (very pick","useful":0,"cool":0},"RXVSNRQLX-nOKOpTtGkGxg":{"text":"Yummy! Food great! Atmosphere wonderful! Service is superb! We would definitely return aga","useful":0,"cool":0},"286CwY_qWF5hqI0roAXLeg":{"text":"This place was so good!  It is also so small and the wait can be excessive on busy evening","useful":2,"cool":1},"_0lmbE_ZkEU_0ApNVIogoA":{"text":"This restaurant was recommended by a local but I will honestly do not recommend this resta","useful":1,"cool":0},"Y8zDI2IaO4Eum0y-AAIA1w":{"text":"This is by far our best experience in New Orleans. We love all the dishes and the service ","useful":0,"cool":0},"ZVKnBpgf9M_pujY1cdFt3Q":{"text":"We came to this place off a recommendation from our tour guide - best piece of information","useful":0,"cool":0},"bumr3ySa0yXC4qyyfg_gBw":{"text":"Delicious! Very small, cash only, hole in the wall restaurant on second floor above adjoin","useful":1,"cool":0},"ajRHsaVc0uuG_QXd2HseOw":{"text":"Worst than Spaghetti Freddie's.   If you want dinner done by middle school kids ok otherwi","useful":0,"cool":0},"uA4tlN5o3RIp1WZseQtrxQ":{"text":"Yum. We didn't even need to read the menu because their specials won us over. Muscles, stu","useful":0,"cool":0},"g5Cu-39SuM-nEp0FTTZ5lw":{"text":"This has to be one of the beat kept secrets of New Orleans. The upstairs dining room right","useful":2,"cool":0},"mD3YvQG4QnhhDEPE1z6yzA":{"text":"This is a tiny place you may have to wait for, but it's worth it. Waitress recommended the","useful":0,"cool":0},"AknNqO71LKFmYOojjmJUMg":{"text":"I had high hopes coming in here. At 5:00 there was already a line out the door of hopefuls","useful":1,"cool":0},"Bv7Wv3AKshsJZnPGmpqB6g":{"text":"Great Creole Fish. Service was excellent. Frenchman Street provides a great atmosphere. I ","useful":0,"cool":0},"WJ_ELzPw9T33Wbbrr7RrHw":{"text":"My date is not a \"She, he, it, whatever.\" Mistreatment, a long wait, and overpriced bland ","useful":7,"cool":0},"MRhp-CSp_BM_KoMb62l2mA":{"text":"If I could give this place zero stars, I would not hesitate to do so. \n\nThree of us arrive","useful":7,"cool":0},"X9iSo6lhvRYwXioIAhNp1A":{"text":"This is a quaint little place found on the upstairs of a jazz bar.  There isn't a lot of s","useful":3,"cool":2},"twa_rjz1G0r0dP4xqMuRNQ":{"text":"Amazing food worth the wait. The oysters were tasty to start. We got the stuffed flounder ","useful":0,"cool":0},"UrktvpyC2cvSYFBzSUNleg":{"text":"Four of us stopped at Adolfo's restaurant on Frenchmen St. around 9:30 pm last Wednesday. ","useful":1,"cool":0},"UDc_cfcj9u4YBNGstBdHmw":{"text":"Don't judge this book by its cover.  It is a hidden gem!  Food was exceptional with steaks","useful":0,"cool":0},"ngBjai6Q92Q1qPagAyIxIA":{"text":"We were told we must visit this restaurant by a former co-owner and her family. We arrived","useful":0,"cool":0},"USHWSCatDrIevLBCXICi0w":{"text":"My wife and I visited here for dinner on July 9, 2019. Let me get a couple of things out o","useful":5,"cool":0},"1ExDckdRFKkhGjx1sKQuVA":{"text":"Super long almost two hour wait which was frustrating but it was worth it. \n\nSteak ocean w","useful":0,"cool":0},"5P66aMzYomFAq-uRaIqwyg":{"text":"We really were not hungry going into this place, but it was highly recommended by a friend","useful":2,"cool":0},"Z076p2SYxwhf_Hm-DCONow":{"text":"Small place, neat ambience, not fancy.  Food - excellent!  Waiter said we would want to or","useful":0,"cool":0},"9xy00PN-9AvvwbP4bktDFg":{"text":"Wow. Just wow. Absolutely the best of New Orleans. First time I went: 7 years ago. Last ti","useful":1,"cool":0},"ZVaV9EiHEbi_NsFF3rpTJQ":{"text":"Amazing food great service! Maiween our waitress was helpful with vegetarian dishes. Did c","useful":1,"cool":0},"qVU8f5_zil2Lev6cAUYXmA":{"text":"Was sorely disappointed that after 2 hours of waiting and all the hype surrounding this pl","useful":2,"cool":0},"xjscKMRaQn9R94q685EecQ":{"text":"Omg ! I am a restaurant owner and I have got to tell you the food here is so good !  This ","useful":0,"cool":0},"LdHwtgm80xj39AVgxY92Hw":{"text":"This spot is easy to miss as it is upstairs above Apple Barrel. Don't let that stop you! T","useful":3,"cool":1},"mqIJIMl2pVmAdvGN5nsKSQ":{"text":"The crab-stuffed cannelloni is truly the kind of dish that dreams are made of. This is abo","useful":3,"cool":0},"KEILA9GJ_7xWiFEtPlFVnw":{"text":"This place sucked honestly. \nFirst - the wait time. When we checked in, we were told it wa","useful":3,"cool":0},"qXkYukkhGbxzbIYhBZc_TQ":{"text":"Don't let anything scare you away from this place.  Not the two hour wait.  Not the climb ","useful":0,"cool":0},"Vs4O5xq1qtJaQiMTPuTx8g":{"text":"Apparently Adolfo intentionally makes the portions too large to finish, so my waiter said ","useful":2,"cool":0},"2xXvupMs7iYx0P1Uks8HwA":{"text":"We've travelled quite a bit and this is by far one of the best meals we've ever had. Defin","useful":0,"cool":0},"h6D6HP_eQSVom9CWPaBxPw":{"text":"Went to Adolpho's for a romantic dinner. We live about 5 blocks away. Was expecting a wait","useful":1,"cool":0},"VyjiDuPhTxRL-VaFcvDCAA":{"text":"One of the best meals of my life.  Seriously. One of the best meals of my life. Don't pass","useful":0,"cool":0},"Kg28I0j0e7cQMtzxcePuwA":{"text":"Wow! We came down to Frenchman Street in the recommendation of our AirBnB host. Completely","useful":0,"cool":1},"18pxcK-mFW9Uri6C2LMNig":{"text":"Last night my new wife and I made our way down to Frenchmen Street to listen to some live ","useful":0,"cool":0},"2E95Lq6UmmS2EScYUuq22Q":{"text":"The food is very good however the $$ is misleading.  The specials which are pushed hard by","useful":0,"cool":0},"rqxANGeTeMUHr77HJqn-dw":{"text":"Visiting for the second time we were up for a sticker shock. The menu lists most dishes to","useful":0,"cool":0},"mC9IVk57Yi6TjN31IWgoYg":{"text":"This review is not for the food.... we showed up at 7:15 and were told the wait would 1.5 ","useful":2,"cool":0},"14QgvXekTlpL8tZq8rBd1Q":{"text":"DID A HOTARD JUST UNLOAD HERE?\nWith Vincent's, Avo and Venezia nearby I have pretty solid ","useful":8,"cool":5},"4PBJZlOmtMf6v7MIzApcSA":{"text":"I had the trout special and it was absolutely amazing. The wine was great. It is a tight l","useful":0,"cool":0},"6S7tsb1FfqRGO2zKZ10esg":{"text":"I wish I could give Adolfo's 4 stars because the food was very good. However, when we fina","useful":1,"cool":0},"TAzMF0IZLOlxB-Su-OePPA":{"text":"Its not bad,  but kind of overrated by the other reviews here...long waiting.cash only.\nAl","useful":1,"cool":1},"M6J9aqh6LpCmr9GBpPi4oA":{"text":"Worth the wait Ocean sauce on pasta.  Dreamy meal after a day at the Gumbo Festival. Intim","useful":0,"cool":0},"RiHd6Ia4YHMqXO4gmXEH4w":{"text":"Crowded and a long wait, but the mussels are incredible, as is the stuffed flounder.  Real","useful":0,"cool":0},"yoq7qkP8vsMUHEb38i95CQ":{"text":"Disclaimer - We came here on Christmas Eve as recommended by a local bookshop, and were ex","useful":2,"cool":0},"7afv8RSMof4mfmhjUvISLA":{"text":"Wait was about an hour on a busy Saturday in June, plenty of nightlife around Adolfo's to ","useful":1,"cool":0},"xiJAofDiR5KcjT3argleGA":{"text":"Decided to try this place because Italian and seafood, why not? Well, after pulling up to ","useful":1,"cool":0},"ItDe3yaSA5XZWLRzjzZwzA":{"text":"I'm a native New Orleanian, so I know good food. I went to Adolfo's on Mardi Gras day sinc","useful":0,"cool":0},"ADBIim2gIDguRSfM_y9OZw":{"text":"Really good but small and difficult to get a table. Plus they are cash only  but really go","useful":0,"cool":0},"76Ct4N0BJ5E5mi8c7IDlvQ":{"text":"Cash Only, bring your cash.  \n\nI recommend going to dinner early as this is a small place.","useful":4,"cool":0},"RgmmCwUCO4_r1D-WL-Z53g":{"text":"Cannot remember when we had better food, although the male server was arrogant.","useful":0,"cool":0},"Z0zO_xaqIKQA-Gvc-VPmQw":{"text":"Quotes 1 hour- two hours later, still not sat yet.   Groups before us were being sat befor","useful":0,"cool":0},"HgfzsJwWypOsdAevH8plgA":{"text":"Stumbled upon after popping into Apple Barrel.... and there are the stairs leading to the ","useful":4,"cool":2},"-Y8TIfnE34pGFwGUm35rpQ":{"text":"If you're ok with having terrible service but excellent food, this place is amazing!! Alth","useful":0,"cool":0},"GEs2K_gP2jtDqccbgMTtNg":{"text":"The most amazing restaurant in New Orleans , try the ocean sauce on any fish they offer yo","useful":0,"cool":0},"Pl64zyOWpQhfUt7Veqyu9A":{"text":"Just not very good.   We ordered water and got two Sprites instead.   No big deal, we laug","useful":1,"cool":0},"0Uh5qZxeWCYqdkOm-qXN8A":{"text":"Have you ever seen that show \"The Best Thing I Ever Ate\"-\nThis place is literally slap you","useful":4,"cool":0},"_5Q6wYg59Vr3HQA1daRNQw":{"text":"The meal was excellent the head chef adolfo is a master chef my lamb was cooked to perfect","useful":0,"cool":0},"RAMZZVl4d7Cox-jgByojPA":{"text":"Don't be deterred by the exterior or interior once you're seated. But do get there early b","useful":0,"cool":0},"w6NArUSSow_XFRqtE4rQ-g":{"text":"Our favorite restaurant!!  So much charm, great service and outstanding food!!  Can't go w","useful":0,"cool":0},"aiJNlOocgIvTAO0RLj3Prg":{"text":"Adolfos -  611 Frenchmen St., New Orleans, LA  French Quarter - Yup! CASH ONLY but they ha","useful":0,"cool":0},"s14ibJUiTxAHY8WcZgUekg":{"text":"Very good food. Mussels were great. Ocean sauce was awesome but too rich. Couldn't eat it ","useful":0,"cool":0},"skAokG5ikFHpaVIOoVjjRQ":{"text":"Well. I think I just had the best meal of my life. And I've eaten a lot. Adolfo's is super","useful":2,"cool":0},"9m2yAvwkj6iHvrgj0gqiTA":{"text":"Omg some of the best food I've ever had!!! Everything was amazing including the service. T","useful":0,"cool":0},"MZv4Ix5C6OyPsIdZ4vpshQ":{"text":"The wonderful aroma of garlic roasting in butter as you open the door to this upstairs gem","useful":0,"cool":0},"VmIBPWVx0KT_u7K7rg9PIw":{"text":"Don't go in the summer. The ac does not work well at all. We are local and have attempted ","useful":1,"cool":0},"-WPNXMZkwgpoG1MTpgAmfA":{"text":"Best lamb and pork chop I have ever had! Definitely a gem of a restaurant! Lovely service ","useful":0,"cool":0},"RF3D8VcA38p2MqMzhq0oPA":{"text":"I had dinner here last night and wasn't as impressed as the majority of other Yelpers. I w","useful":2,"cool":1},"X58z552PiNRUWn5tu9JiHQ":{"text":"We got a rec to Go here from a local. Omg! Delish! We had the eggplant appetizer-so cheesy","useful":0,"cool":0},"rzCspOdL4iYnR0gyhauudg":{"text":"Amazing food! Seriously, we ate out every night and Adolfo's was the most delicious. We we","useful":3,"cool":2},"6khy_Sb98OgaI9t84nMcwQ":{"text":"Wow! This place is super small so the wait is a bit long but it's safe to say that it is w","useful":3,"cool":1},"3OhndJFVrtcUaNt4IYBPmQ":{"text":"One of our favorite meals while in New Orleans.  Was recommended by out tour guide.  Not o","useful":0,"cool":0},"VSVWgrv58d_EeOfMzF1xZA":{"text":"We have eaten here before and loved it. Last night it was so awful. Escargot had so much g","useful":0,"cool":0},"mYY85MwB5t3uSTbNUTewdQ":{"text":"Ocean source is ok, but not as great as I imagined. The server always seemed like too busy","useful":0,"cool":0},"90RVPv44WS4v7LJIkpPukA":{"text":"The food here is good, but the service makes it terrible. You can get so many amazing meal","useful":2,"cool":1},"EivrHnlaAgRlyl6aNa2d3A":{"text":"We ate here on a friends recommendation. It was during Jazz Fest and of course they don't ","useful":2,"cool":0},"b3j2XjzIEeTymd429CAgMg":{"text":"I've had this restaurant on my to visit list for quite sometime and finally made it out on","useful":4,"cool":3},"xxSwwnmnJVPjHPgOU4lKdQ":{"text":"Heard incredible things about the Ocean sauce, which totally lived up to the hype. Appreci","useful":0,"cool":0},"tBF5DOgf008cwbZv8mPghA":{"text":"Everything about this place makes me happy. Their dining area is very small and they do no","useful":0,"cool":0},"Lex3kkffmSO0ZacV9CAzLg":{"text":"This place is absolutely awesome! I took a trip over a year ago to NOLA and this place sti","useful":0,"cool":0},"w6xYm1y4B0atHmo8A7BH0Q":{"text":"We were in NOLA for 3 days and I have to say this was my favorite place that we dined at. ","useful":2,"cool":1},"hx8-G9cRGfS_QUdDQIq6KQ":{"text":"One of the better options for tourists in the tourist district. Stick with the specials li","useful":0,"cool":0},"n2YFRaLqsQyt749mXc9xJg":{"text":"This is one of those places I almost don't feel like sharing. It's that fricking good. Why","useful":9,"cool":8},"7Fg7M41AwSP9-II32Pnhhw":{"text":"We have been going to adolfo's for years but tonight was the worst it has ever been, the w","useful":2,"cool":0},"twIO1tE60UXzIVcUvxTMbw":{"text":"This is a teeny restaurant with perhaps 10 tables on the second floor over a small club wi","useful":0,"cool":0},"tYFcSBce4yrllfZbAKRsRg":{"text":"This is one of NOLA's local gems. Typically, it is so difficult to get a seat in this plac","useful":3,"cool":0},"jP7vo-_BfT2EISSxtkv24A":{"text":"This place is off the hook.  Thankfully, a  friend of mine recommended this place, otherwi","useful":2,"cool":1},"juhepTd0ZZsICRiODOuQmg":{"text":"I read reviews how this is a sea food place. We ordered the chicken  tylen and chicken Par","useful":2,"cool":0},"ovYCGyaLTGNYaYMosPgylQ":{"text":"This place is great! From Ms. Kim and Cruz And all the other staff it was a fantastic even","useful":0,"cool":0},"2f-v_H1L_7mTrFYBa_Vbng":{"text":"This restaurant is overrated. The kitchen is slow and they focus more on sauces than on se","useful":0,"cool":0},"EIivm0rlJmyXAYxa-FvMXw":{"text":"Walk through the door into Adolfo's and time stops. Katrina didn't touch it.  Welcome to a","useful":9,"cool":10},"xQPDe5nYSvP7VlGxX0T9lQ":{"text":"This was given rave reviews by people we met while visiting NOLA. Italian meets creole and","useful":2,"cool":0},"wJ4XkLd4SDZt-0EfXBXlmA":{"text":"We have been here two of the last three nights. We discovered this place on our last trip ","useful":2,"cool":0},"gQZnxeCzurkxB5IDxelPLA":{"text":"Word of mouth can be a powerful marketing play.  When NOLA locals said some of the best Ne","useful":3,"cool":0},"j9tL5I40ud_7iPLLxE4VXQ":{"text":"We went here on a recommendation from our Airbnb host. We both got the specials, Rack of L","useful":2,"cool":0},"bTCQzCEJuVADDBPI8gvJdw":{"text":"Holy cow this place is phenomenal. I've been a few times now when I've been in town and I ","useful":2,"cool":1},"5wnvu1OyG5UzqYHZU2O5Ew":{"text":"Meagan M from New York is pretty much right. Adolfo's isn't very good Italian food. New Or","useful":7,"cool":3},"Q2XB3Z7wLmGSicgUa6ziyg":{"text":"I found this spot to be very over rated. Bread was spicy for some odd reason. I had the Sh","useful":3,"cool":1},"TKnP8UrhLao8zMY39Jawjw":{"text":"Highlights:\n\n1. The food (starting bread, Chicken Vincent, snails, Ocean Sauce)\n2. The vib","useful":3,"cool":1},"AMa0tK2Z671VWaYtFp_NJw":{"text":"First of all. Thanks to James for the amazing service. This was one of our favorite meals ","useful":1,"cool":1},"ZZF2HUmdojsWHdoMQeponA":{"text":"Adolfo's was one of two amazing dinners I had during JazzFest (the other was Louisiana Bis","useful":0,"cool":0},"fhUzf6AcI7aAq4CIkIPWWg":{"text":"OMG. This was fantastic. I ordered the stuffed flounder with their ocean sauce and it was ","useful":2,"cool":0},"bcu8aEFeNjgK1ed1c4p1Bg":{"text":"HORRIBLE. waited 1.5 hours for our food that NEVER CAME and didn't even get an apology. An","useful":1,"cool":1},"OJAj0CZ0ogD7LAX07-yMdw":{"text":"OMG! Awesome food & service in cozy (and slightly crooked) 2nd floor space. It's our local","useful":0,"cool":0},"NQ-a52dDR81o7Zbv4uL12g":{"text":"I have been here twice and both times I have had the same experiance, the food is great bu","useful":0,"cool":0},"8A7J87aaPR87d0xnE2NsjQ":{"text":"We are locals and Adolfo's is our go-to restaurant for lamb chops and mussels. It is a bit","useful":0,"cool":0},"51oickMtjBRdXMN09bUEkA":{"text":"My boyfriend and I decided to try this restaurant in our first night out in New Orleans af","useful":3,"cool":0},"aMj88TgfkqPE2DGtk05liA":{"text":"The plus first - \nReally fresh fish prepared really great.\n\nTHE MINUSES:\nCash only - but t","useful":1,"cool":1},"423gh8cZuy4qqobrdKfRDg":{"text":"Excellent appetizers and lamb. Steak was good but a bit overdone. Staff were lovely and th","useful":0,"cool":0},"bJbslnPuoyE1oXdL6CmPCQ":{"text":"This is my favorite restaurant! You won't hear about it. No one will tell you. It's a secr","useful":3,"cool":1},"ijxAMpuVjOO7w3WvJurIjg":{"text":"I have to warn you. The things this food does to your palate might inspire you to do thing","useful":4,"cool":4},"Ww_Znm3-BML0WrQRDpVh_Q":{"text":"This is off of Frenchman's street which is off the beaten path and upstairs of the bar App","useful":2,"cool":3},"f3Tou0R4lqbyKrN1dXfyzA":{"text":"Excellent old restaurant and bar, serving Cajun-Italian cuisine.  Excellent seafood dishes","useful":1,"cool":0},"opW8mZGPwP8i06RiV0ZpEw":{"text":"Round 2! This is honestly a Diamond in the rough, very unassuming and above a bar on Frenc","useful":1,"cool":0},"dim9msSa0ctiRVGDTfKDEA":{"text":"Yeah, I'm not too sure about this place, sorry.\n\nI misread one of the reviews below and I ","useful":5,"cool":1},"7QxSrxkSt_WBXbeaMxUHOw":{"text":"This was my first ever proper Italian seafood experience and I am so happy my friend sugge","useful":1,"cool":0},"XqvWl3b1xowOvapnijDO6Q":{"text":"We went here due to the high recommendations here on Yelp. After we were sat, we learned y","useful":3,"cool":0},"yqWKVQZPmKywB0jVJdmWrA":{"text":"The highlight of our trip. The lamb chops were the best lamb chops I've ever had. Their un","useful":0,"cool":0},"2CCQdTx4bQMMlFroG2zrGw":{"text":"One of the best reasturants that I have had the pleasure to dine at in New Orleans. We sta","useful":0,"cool":0},"pWhBnraOdYtdn6U8ZeqRdA":{"text":"Excellent experience!! Escargots, snapper (ocean) great food and awesome atmosphere....bri","useful":0,"cool":0},"3BJ-MyLKid2zT7mXmRlRHA":{"text":"This is hands down one of the best restaurants in New Orleans. The specials of mussels and","useful":0,"cool":0},"P0KaAgrAbaVGUonZYBOjlg":{"text":"i'm appalled at the experience i had here. the worst dining experience i have ever had. on","useful":3,"cool":1},"LCzX_DJSc0kp3t8LwHp1MA":{"text":"Just didn't live up to the hype. The menu is a few proteins with different sauces.  The sp","useful":4,"cool":0},"XqKlY_nbUHB-Rsa8lv8PJw":{"text":"I had a great experience at this place. You gotta appreciate a tiny Italian joint tucked a","useful":4,"cool":5},"6NUOnoqlt6fu6vgDT_nNew":{"text":"Adolfo's was recommended to me by a local, and it was the best food I had my whole trip. T","useful":0,"cool":0},"AJFvuVKSCFoX_piB4ecRdA":{"text":"The service lacks a lot. The waiter forgot our mussels. They came out cold and tasteless. ","useful":1,"cool":0},"1ZUlXBGjJnV44sL7pRhNtA":{"text":"Adolfo's upstairs dining room is a jam packed, dimly lit, run down joint, their tables don","useful":0,"cool":0},"DYnhyXMtlGGNjHVd86rfxQ":{"text":"This place was awesome!  Love the old vintage house atmosphere. The food was delicious!  O","useful":0,"cool":0},"v6U6-x3UAL0X36CBL3YGNw":{"text":"Excelente!!  Cada plato es una preparación dedicada y muy bien condimentada.  El chef esta","useful":0,"cool":0},"VJNuDtqP5xfj0xoCPTOftA":{"text":"When locals tell you this is their favorite spot, you give it a shot! The place is small a","useful":1,"cool":0},"rl9jbgwDaCR8xaoi-lc1kA":{"text":"Ate at this restaurant last Sunday evening.  I could not order anything with Marinara sauc","useful":0,"cool":0},"XswKGtMzoWQXIEh_stdRVg":{"text":"Adolfos is above a bar on Frenchman street. You have to climb steep stairs to get there. T","useful":2,"cool":0},"axr8vxy-Fe6UdGBDV6KhhQ":{"text":"Upstairs from Apple Barrel, and one of my favorite places in New Orleans for some Italian/","useful":1,"cool":1},"Tmpgrhq4FsmeHvrySPnVyw":{"text":"Lived in the area for a month with my gf and we ate at all the top spots. I kid you not Ad","useful":1,"cool":1},"FoBF3_KSpYSHMNQK4V4RWA":{"text":"I am so utterly disgusted and disappointed. This place was recommended to me and I have no","useful":2,"cool":1},"ogFnwfReILLvcvxeiU-6mg":{"text":"The food was the best I have ever ate and really reasonably priced.  Our table of four had","useful":0,"cool":0},"52kD-DCMGvhpBmJSu8S4TA":{"text":"Visited the week of Labor Day for a late business dinner.  Red snapper with Ocean Sauce wa","useful":0,"cool":0},"o1mcREtJaVy1I1-Rl6AnPg":{"text":"This tucked away restaurant is well worth the wait. It is on the second floor. Great place","useful":2,"cool":0},"5gkjfYDEvYFVixG3MpdE6g":{"text":"This place is a classic old New Orleans treasure. Great food and their ocean sauce is heav","useful":1,"cool":2},"NRfImYE0E2LXLHVyYNLgEw":{"text":"Bug in the restaurant!!!!!!! Cash only. Long wait time to get seated (no waiting area). Sn","useful":0,"cool":0},"FLprIbnSB2QGq3NCaBH-Qw":{"text":"Adolfo's has never disappointed.  We had the special the last time we were there, which wa","useful":0,"cool":0},"ZIp7EhIKfD7XMAx8-fzWzw":{"text":"Went here for diner 5-15-19 i ordered the strip steak well done.It came out on the plate w","useful":0,"cool":0},"uYSmbw9rQQXQIGrfpQT2wg":{"text":"My husband and I were told about this place about this place from a local. Once we found o","useful":1,"cool":0},"wbseu6Ii0L5XmIqCRUjbLg":{"text":"Unfortunately, count me among those reviewers who were badly failed by Adolfo's. \n\nThe mus","useful":4,"cool":0},"6SflqkTGMe4CVmpabHoOxg":{"text":"This place does not sit very many people, so be prepared to wait.  We had to wait about 45","useful":0,"cool":0},"ugvtALtnyUuw1DpmQTOhLQ":{"text":"I don't know what else to say about this place but praise. We arrived at a reasonable dinn","useful":1,"cool":0},"pK3QhQgc0h_fWTixquI8AA":{"text":"My wife & I love this place. To say that the atmosphere is non-pretentious is a vast under","useful":0,"cool":0},"Bl1jHjVKf9x4wUo65CvilA":{"text":"This is a cash only establishment. It is upstairs above the Apple Barrel bar.  We went in ","useful":2,"cool":2},"NftvY9nz1XWJ1Ik4un2k1g":{"text":"We ate here our first night in NOLA on a recommendation from our Airbnb host.  It was righ","useful":1,"cool":0},"SxvtcmDt1KznavRrRBxvsQ":{"text":"I ate there tonight for the second time. The food is okay. The service is not the greatest","useful":0,"cool":0}}