{"VXZ2kbWcuNF4n3a1eKmF-A":{"text":"Yummy pizza. Really perfect. I went at about 5 PM on a Thursday - only a few other folks t","useful":1,"cool":0},"_bsNdylKsw2e36n0oQqbPg":{"text":"I am definitely a fan of Theo's. The atmosphere is quaint and the service was spectacular.","useful":0,"cool":0},"SLQeYEqLwbkzdW6THrWslA":{"text":"I found Theo's Neighborhood Pizza through my son who just loves the place. Last evening we","useful":0,"cool":0},"Bv-PhKY3w-JMW5q0oOVDig":{"text":"Good pizza and sandwiches.  Diverse selection.  Counter ordering is efficient once you kno","useful":0,"cool":0},"J_7gejnk2lMyMrtaDsSmYg":{"text":"If you like thin crust pizza, then this is for you.  They do an absolutely amazing job.  T","useful":3,"cool":2},"EfGI4-CeAd1gvGQ4116k5A":{"text":"Starting frequenting this place a few  months ago (needed a break from Midway, and have co","useful":1,"cool":1},"dafijxANTlabsaGa4PCz9Q":{"text":"I got a small gluten free pizza with double mushrooms. It was priced similarly to Mellow M","useful":1,"cool":1},"zcjpI0qF4h8N6qQ-RXLuZQ":{"text":"The pizza is always on point, the restaurant is clean, and the service is fast. One of my ","useful":0,"cool":0},"VE7IePbOo8XHhsAbz494gA":{"text":"Went for lunch and had a great time. The section of pizza was impressive and not expensive","useful":0,"cool":0},"CFlVwNI-HZibmJfbx30pTw":{"text":"I am fairly knowledgeable in Pizza - i have eaten it at most New York hot spots - i make a","useful":2,"cool":1},"vXvntF7y4EGPDmeHqv2JDA":{"text":"This pizza joint is cool but it makes you forget you're in NOLA. I love this because you'r","useful":1,"cool":1},"bDdJzc79uwqswhS5guMg7g":{"text":"Great thin crust pizza.  I highly recommend the Jammers Original pizza","useful":2,"cool":1},"SUBVKycKY5J0GWx3gRF28A":{"text":"definitely in my list for best pizza in New Orleans.  Their crust is really crispy which I","useful":0,"cool":0},"-5pqUyUjEsfEtcqdyAzUxQ":{"text":"Really good pizza. Nice crisp crust and perfect amount of sauce!","useful":0,"cool":0},"GvbEF7E2uoIrLRTinh9fTQ":{"text":"Good location on Magazine street. \n\nCompared to other pizza places in the city (Reginelli'","useful":0,"cool":0},"6b5n3raH8CEoLa_iczXOEg":{"text":"This location is terrible. The one on Canal St is much better. The servers are definitely ","useful":0,"cool":0},"IP6wq6X_AcqpCrxnTNgA5g":{"text":"Good sandwiches here: a little too big for a regular appetite. The chicken and pepper sand","useful":0,"cool":0},"hj8sFX3D-EiqROhazKOBDw":{"text":"Theo's is my favorite pizza place in New Orleans.  It beats Reginelli's, Louisiana Pizza K","useful":0,"cool":1},"qDGB3ZHcl-FoUOOLg1H6qA":{"text":"The people at theo's are very nice. I ordered a small chicken pizza which was horrible. Th","useful":0,"cool":0},"o60BCc5c7KRTE3KB0JV7Ng":{"text":"Good pizza. Check for beer specials. The bread sticks aren't worth $4.","useful":0,"cool":0},"LtoQ15py8QRIcRDYt_MOsw":{"text":"Solid pizza. Friendly staff. This is definitely a go-to neighborhood place. As a vegetaria","useful":0,"cool":0},"lXynuSxBKZ9CYS17knwRkA":{"text":"Great and delicious pizza.  Ordered the Expert pizza, does take a little while to prepare ","useful":0,"cool":0},"pCLRBJ1_MGtmq9mECgY11Q":{"text":"I have lived around the corner (1 block) for 3 years. I've waited to review them hoping th","useful":1,"cool":0},"IdDZLBMgduOe-jeIm5MiCQ":{"text":"I've loved this place ever since it opened before Katrina. It had become one of my favorit","useful":2,"cool":1},"uoicdzvUXGMPh08fW6C-jA":{"text":"Love their Meathead pizza and also their Arti-garlic...for that matter, there is one on th","useful":0,"cool":0},"K1UNsQNM9-HCMM38hGO8aQ":{"text":"Best pizza in town!!!  I love the Magazine Street location (and the Mid-City location too)","useful":1,"cool":1},"ZkFxB2j-guqlcWxIFsUySQ":{"text":"This is the perfect little gourmet pizza place.  I recommend the Spicy Mexican Chicken piz","useful":0,"cool":0},"8_fgRgIWW5qpxvhwg3W_5g":{"text":"Best pizza I've had in new Orleans since I moved here almost three years ago. I had heard ","useful":1,"cool":0},"P75PeSPaerGrC6Cq-L3TBg":{"text":"I started coming here when it was still fairly new and I was a lot younger, and now that I","useful":1,"cool":2},"dW4WAXvC78I5ZHkJz946tw":{"text":"Excellent location, however parking can be problematic. \n\nI have experienced dining here t","useful":2,"cool":2},"G0XI0QASK2QdXA4Aw_kH3w":{"text":"Been twice to this location. Once in Mid City. Everything is good about this place except ","useful":1,"cool":0},"vOYkrCH-xbddohAN7ND4Uw":{"text":"One of my favorite pizza spots in New Orleans. The texture of the thin crust is very crunc","useful":1,"cool":1},"4SgjgEP3RL4P2GT2djnMvw":{"text":"Fortunately I live only a few blocks away from Theo's, so it is a regular on my takeout li","useful":0,"cool":0},"wzevG7LzXLvwv_Ab38ZFkw":{"text":"Out of the other locations in the New Orleans area, this is by far my favorite! For some r","useful":2,"cool":2},"j5CISBZSZVS39ZgXVPKdLQ":{"text":"I randomly stumbled upon this Theo's after most restaurants in the area had been closed fo","useful":1,"cool":1},"QyYdUrmZ3kg9oMDH_3pcyQ":{"text":"Good pizza. Great $10 bottle of wine special during the week.  A little slow but worth the","useful":0,"cool":0},"5otf2Fa-5V5vBkzQl5HTkQ":{"text":"Please return to your prior pizza crust formulation. Cannot recommend \"Swamp Thing\" or \"Sp","useful":0,"cool":0},"8LsZ8sxC-zfkNT-bilj3Ig":{"text":"Stopped for late lunch and we came here because they were only one of the few open during ","useful":0,"cool":0},"0HRvNfdUFKr4YE9g2zdaQw":{"text":"We got the Meathead pizza. No joke, it has a lot of meat on it. It's good pizza. The best?","useful":0,"cool":0},"TNlQU8UEfhhQZEVqYKygXw":{"text":"Used the waitr app to get a pizza delivered to my hotel room.  The pie was absolutely fant","useful":1,"cool":0},"a2XgsAeLbtDkmTk5eOctMw":{"text":"I really enjoyed my visit here. There are signs alerting patrons to order at the counter. ","useful":1,"cool":0},"pOXPlklshofUP-zkBKfbTg":{"text":"I love pizza and this place seemed to get the best reviews out of all the pizza places wit","useful":2,"cool":1},"hcy_k0qD0hD4hH-NmP4LAg":{"text":"Pepperoni pizza was disappointing.  The sauce was flavorful but the pizza was way too grea","useful":1,"cool":0},"GzsxpEYd3Cd7aUU_CAplQw":{"text":"I love Theo's Pizza!!!  This is probably my favorite pizza place around.  The thin crispy ","useful":3,"cool":1},"fbPiLXeIf3UHT96vUY1UPg":{"text":"Very nice atmosphere, cheap food and drinks. The thin pizza was a surprising hit. Our serv","useful":1,"cool":0},"FrFNk0PC7NOzf_VWQs7tMw":{"text":"I have so many pizzas that I love, but hands down best service of the uptown pizza joints ","useful":3,"cool":2},"H50karch5mX6n7-8hx8ZJg":{"text":"It was about 7 PM, after a long shitty day working hungover without any more than a fry or","useful":0,"cool":0},"3grTg_w6CoJDU2bXMFb3HQ":{"text":"Omg!!!  Theo's pizza on magazine is like a horror movie taking place in a school yard. 13 ","useful":0,"cool":0},"1ELU-t9bFkMgziVt_yqirA":{"text":"Theo's hits THE spot. \ninventive, delicious pizzas. Quality beers. Down-to-Earth staff. I ","useful":1,"cool":1},"BcxUE8-qh9xZ0Ir-hdApsQ":{"text":"Love this place. They have really good pizzas and some amazing salads. My favorite is the ","useful":1,"cool":1},"D-2TG2lp0PQpStNGfF8iGg":{"text":"Had the monthly special - roasted butternut squash and bacon.  Simply amazing. ...one of t","useful":0,"cool":0},"NcWAwhR2UNfTl3d7XzAdOg":{"text":"Love it because it's close. We get the Hawaiian and they actually put thick slices of ham ","useful":1,"cool":1},"oLfLBQLGeHAYlw31wIImsw":{"text":"I pretty much have to regularly get my fix of 'The Expert' pizza - olive oil, minced garli","useful":0,"cool":0},"MMOr6QAynmpDqBs1JqqkqA":{"text":"this place is really cute. I wanted to like it. the atmosphere is comfortable, neighborhoo","useful":1,"cool":0},"iwgqlcRr015FC6EHLbmwAA":{"text":"Quaint little place! Love the pizza! Got one called the swamp thing! Soooo good! Wouldn't ","useful":2,"cool":0},"TkBJbMgd0om4j1CkpXN3kQ":{"text":"The pizza is just okay.  The crust is thin and dry, the sauce seems to be just tomatos, no","useful":1,"cool":0},"NADV0zzR2EXcajuckqxVMA":{"text":"Loved coming here! Everyone was super friendly and I loved all their options. I didn't lea","useful":1,"cool":1},"GplcDgtdxxVmBmT9XHeHsg":{"text":"Consistently delicious pizza (try the Jammer's \"O\"riginial... it's simply fantastic), frie","useful":2,"cool":0},"9ytiKChnuyiKNvtUlaGWNw":{"text":"Theos makes a decent pizza pie but not great. They are an average pizza place in a market ","useful":0,"cool":0},"xb318jPK_a2fg26AwTKDGA":{"text":"Walking along Magazine street on a really got day and we suddenly got starving. We walked ","useful":1,"cool":1},"ITzg0cJoi2w_9cUGF6mElQ":{"text":"I loveeeeee their pizza. So many good choices! We are in recently and they have a great lo","useful":1,"cool":1},"OBoVXVNAridSIyy8VfpoMg":{"text":"Great neighborhood pizza joint.  And they have pellet ice.","useful":1,"cool":1},"8tHH6oYdcYjS8vIAyIw3Sg":{"text":"Grilled cheese sandwich with three types of cheeses, sourdough bread, add tomato & basil f","useful":2,"cool":0},"zYDPF7wf-NpLJhwOgf-z7g":{"text":"One topping small pizza was supposed to be $8.00 as it said on the menu board. That's what","useful":0,"cool":0},"D5TZcVFYC8CqJsfTcl2_Lw":{"text":"Founded 2004.  Pizza   Great loaded chicken and artichoke \"rebo\" salad.  Hot wings are sma","useful":0,"cool":0},"onJ6ZtKYqRiooFIqlfUCgQ":{"text":"The pizza at Theo's is some of the best in the city, and I recently had an excellent custo","useful":2,"cool":1},"FjyfCFGGnD2SBUAF72yOvg":{"text":"Don't ever place an order for pick up and think it's going to be there! The first time I c","useful":2,"cool":1},"YuKyo8ixLoipl4Egfqc6LQ":{"text":"It's good pizza for New Orleans, but average to possibly below average for any true pizza ","useful":0,"cool":0},"32NJvu8KDsg1fJFnVSgt-w":{"text":"Love the pizza here.  It is equivalent to other great spots I've found across the US.  The","useful":1,"cool":1},"FgIBazKAkRmSHRvp1_YOPQ":{"text":"New favorite pizza spot in New Orleans.  Great, crispy thin crust with a classic, slightly","useful":0,"cool":3},"MdtORbJPA2zFxcOO5gYZSg":{"text":"straight up good and tasty\nnice specials with fresh veggies according to the time of year.","useful":1,"cool":1},"_xIuVmZOiF987eT5k0AhNg":{"text":"The spinach salad with walnuts and raspberry dressing is to die for and I've loved every p","useful":0,"cool":0},"xZ8m_u3t1s9IE63HfaHlaQ":{"text":"Clean restaurant and friendly service.  They have interesting selections of pizza.  \n\nGree","useful":0,"cool":0},"Ei6PeH5TrN0mcObJIFs3fQ":{"text":"This is a perfectly middle of the road pizza place.  I could take it or leave it.  Nothing","useful":1,"cool":1},"Iqj6zJdD1lP0NuxSvtL5IQ":{"text":"I called in an order and was told they were very busy and the wait time would be 30 minute","useful":2,"cool":0},"kruMdqAzAQfBz2QMBJFUGw":{"text":"The staff is awesome and friendly.\n I remember when this was the first place to open after","useful":2,"cool":0},"Awum_Bh7_8nDe7Y8D8jE3A":{"text":"Pizza was yummy, had the margarita and it was good, done with lots of fresh tomatos, basil","useful":0,"cool":0},"QcDvsSDnESnuwQkpuralqg":{"text":"I've never had a bad meal here.  I just went back, and it was just as good as I remembered","useful":1,"cool":1},"dxd4FBEIpyqaAP2MXnxS-g":{"text":"Maybe my expectations of pizza are really high but I'm not sure why they have such a high ","useful":0,"cool":0},"pmcL1Vv2aowoBKPPHVHQcg":{"text":"Loved this place. Had the $8 lunch special, 1 topping pizza with drink. Paid up and got 2 ","useful":0,"cool":0},"nMetCnik-gQqI0jYUALZjg":{"text":"Pizza has great flavor and the thin crust is the best in town. The only drawback is that t","useful":0,"cool":0},"7NkPRCVyHYQHdtBwNIR4ig":{"text":"Great local place, super specialty pizza selection and friendly service... order at counte","useful":0,"cool":0},"_iIxdQ6r_WXEes9onW75DQ":{"text":"Salad is fresh and delicious.  They have happy hour on select brands of beer. From the web","useful":1,"cool":1},"CzvD1wk2foRmWeCHvp40zw":{"text":"The most amazing pizza EVER!!!! I am so addicted to it! Now I have my husband and friend h","useful":0,"cool":0},"M1QZVHeSFO84JsOWhZigXA":{"text":"As pizza goes this is a solid choice.  There is a large variety of pizzas on the menu.  Th","useful":1,"cool":0},"aVCC2h6wWpFsSWBaZ9ouXQ":{"text":"I would like to meet Theo and thank him, for running an excellent pizzaria and only block ","useful":4,"cool":2},"cpFjNEhdfsu_kRgTEqdqYg":{"text":"Excellent thin crispy pizza! Highly recommend if this is your preferred style. Staff is co","useful":0,"cool":0},"_UKUXNHEE_IYhFkAwgQaBg":{"text":"Great service and even better pizza! I would eat here more if they did pizza by the slice.","useful":0,"cool":0},"8uqUuFTkVPA437KZWnwxGQ":{"text":"I love this little pizza place! Not only do they have great pizza they have really delicio","useful":1,"cool":0},"jljv3ScmVMMzCLc_OUt4Kg":{"text":"When we come to NOLA we stop in and enjoy the pizza and beer here. \n\nThe pizza is good and","useful":0,"cool":0},"pdd0i6_2JlitdHhy8X6AHg":{"text":"Very good neighborhood place. The crust is especially good, flaky and crispy. Placing your","useful":1,"cool":0},"ZhiDgsyUEYq4Hi-J35RjaQ":{"text":"My favorite pizza in the city. The west bank special sounds a little crazy with the toppin","useful":2,"cool":1},"aCiAFSVqQxLO-PXemgD5UQ":{"text":"We ran into this place randomly and I'm so glad we did!!! The pizza is great and the emplo","useful":0,"cool":0},"b0mkjXxqF6EezGQSGDJR3w":{"text":"Two strikes against Theo's. Not sure they will get a chance for their third strike. We wer","useful":1,"cool":0},"MdTlotOvhizeoSzB0b3OzQ":{"text":"What convinced me to try this pizza place was its selection of specialty pizzas (many vege","useful":1,"cool":2},"F2StSs3Nk90Bvvy-pIYYHw":{"text":"My husband and I stumbled upon this place about 2 years ago and I liked the spinach salad ","useful":0,"cool":0},"ZdnD4l0xSTFx6QOFwgpH-w":{"text":"I go to Theo's for their Caesar salad. By far my favorite. I love the pita chips and gener","useful":0,"cool":0},"JZxXQQn7sXMYMqSO-kHj7w":{"text":"These guys have been in the neighborhood for a few years now, and fit comfortably amongst ","useful":1,"cool":1},"6pezegSTJWFPj2VXuaozbA":{"text":"Visited from FL . Maggie helped us out taking our order and giving great service.  Great p","useful":0,"cool":1},"AnOb6D7EnxW4h1nNBTirNA":{"text":"Yummy Hippie pizza tonight.  But what is up with parents bringing their kids to restaurant","useful":1,"cool":2},"JVELXOhaRPBYPjO-gwFuVw":{"text":"This is the best pizza I have had in Southeast Louisiana.  We will travel to New Orleans j","useful":0,"cool":0},"fm4nnD_YL_CCoxvafdADkw":{"text":"After hearing raves from younger family members, we tried Reginelli's Pizza tonight.\n\nWait","useful":0,"cool":1},"neQooByArr41PC-bpKBV6w":{"text":"I have literally never had worse pizza in my life. I got the vegan-ator. Sucks they don't ","useful":0,"cool":0},"8YEnOhuOnEkz_OMsoWizGA":{"text":"This is a great spot to come with a few friends and hang out for a while. It doesn't get t","useful":0,"cool":0},"1U8bCf5WzGXEzAPlGq2FRw":{"text":"I don't get it.  \"Excellent thin crispy pizza\" someone said.  It's thin, yes, and crispy, ","useful":1,"cool":0},"uPpCU095e_tEolpKavBupA":{"text":"I don't know if I should give it a 4 or 5! It is close. The restaurant location is located","useful":0,"cool":0},"Qvmb3UEi_geXFjrND_9Dqw":{"text":"To be honest, their by-the-slice was one of the worst pizzas I've ever had. Their actual p","useful":0,"cool":0},"i-6NOBX6VVXNqGIhefaXuw":{"text":"Try the Caprese Salad! Huge slices of mozzarella delight the pallet with an earthy almost ","useful":1,"cool":1},"sv9zvDet7YRgq6jWd8FVgQ":{"text":"Super disappointed. Waiter brought me the wrong order because Theo's messed up. The manage","useful":0,"cool":0},"hY9yZfa7p0bvUJ3RhhbexA":{"text":"Good pizza, great pretzel bread sticks. Friendly service and enjoyed the lunch. Couple tvs","useful":0,"cool":0},"IQ_bRLkmad8bZzcQzjWPYA":{"text":"Our Caesar salad had just the right amount of dressing. The pizza was flavorful with a gen","useful":0,"cool":0},"1HyotiJZep1TG_a1OPHWYA":{"text":"Wide selection of bottled, fountain, and brew drinks. Intimate place but it looks like pic","useful":0,"cool":0},"7KePFORo9T8Gj3DCvofheg":{"text":"I checked out Theo's on one of my last night's in NOLA and it was about a mile walk from m","useful":0,"cool":0},"75IeXj9-ln8D1gXjk_nIzA":{"text":"Their Sweet Spinach  salad is amazing! Plus their Iced Tea is always fresh. The staff are ","useful":1,"cool":0},"GFID39aZ2nAFeY_WtSPf4Q":{"text":"Just had The Expert pizza and it was one of the best thin crust pizzas I've had. I should ","useful":0,"cool":0},"-EXzUB2LX1wfT4lE0cZQkg":{"text":"Theos is such a homey pizza place.  They're speciality pizzas are terrific.  They're house","useful":1,"cool":1},"5-U5VchoeT_hACOZ03BnzQ":{"text":"I went and picked up pizza here, so cannot yet speak to the dine-in experience. It was, ho","useful":2,"cool":1},"YN1HV3_sHHkfIiybsiskxA":{"text":"Really delicious pizza. I have ordered from here 3 times so far because it's so close to m","useful":0,"cool":0},"noRM3JBzJxXSEzias0sqyw":{"text":"To be honest, their by-the-slice was one of the worst pizzas I've ever had. Their actual p","useful":0,"cool":0},"u7ZYO1KvrlCsVDf8q6wfyA":{"text":"Came here on a whim. You order at the counter and they give you a table marker and bring t","useful":0,"cool":0},"9o2OV67jOnaUZzzu0zIelQ":{"text":"good pizza, nice atmosphere. pretty good place to chill and hangout. will come back again","useful":0,"cool":0},"EMsvNhs2bJUjnHRcq4_dDg":{"text":"With the 10 or so pizza places within a mile or two, I wouldn't bother with this one... go","useful":1,"cool":0},"dtEoLfaZGMn2EHuNBYX3kw":{"text":"Had the pepper jack chicken sandwich. It was really good, and it was really good. Great se","useful":0,"cool":0},"lgZ6thpVnHLFUcpHhFtwCg":{"text":"Rating for my experience on a Tuesday evening. Great deal on Tuesdays as draft beers are $","useful":1,"cool":1},"eQXX6G_f8Rx6_PggqpQcVA":{"text":"The food is good and consistent at all locations but the two stars is mainly due to the ri","useful":0,"cool":0},"3T3W5KyU-0HpY5FswO1K1g":{"text":"I'm rating this place 5 stars because we just happen to stumble upon it and I have to say ","useful":1,"cool":1},"tJI-HAfaj4VyzvIxx-qOEA":{"text":"Best thin-crust pizza in town.  Crispy, but not overly so - fresh ingredients with creativ","useful":2,"cool":1},"avXXLtcepgOFeSVVMiwBzQ":{"text":"They have the best pizza around we eat there all the time. The crust is good and crisp and","useful":0,"cool":0},"ElpbplW7oIvP2MiU4Q8rSw":{"text":"Mmmmmm... My favorite pizza. Love the thin crust and all the specialty pies. My favorites ","useful":2,"cool":1},"uwIQC-2I3WMFEsQv3Tw8aA":{"text":"First visit, excellent service and food! Buffalo chicken pizza great! Salad fresh! Will vi","useful":0,"cool":0},"gFvpbd__GLa6fKgJhz8Xwg":{"text":"I love theos. Solid thin crust pizza with a classic tasting sauce and dough. Come here reg","useful":1,"cool":0},"d5hZZ7wJLr-G-PxA2Rj7yA":{"text":"My favorite pizza in town but too often they mess something up. Burn the pizza & ask if yo","useful":1,"cool":0},"VV5D2j82m3kImG_qeGQi3g":{"text":"Great local pizza! We decided to stay in and order, glad we did! We ordered 2 pizzas, 2 di","useful":0,"cool":0},"3DeR4T50ezSYKWKwWTN4lg":{"text":"Who goes to a pizza joint and doesn't get pizza? This guy, that's who.\n\nWhen I was invited","useful":5,"cool":2},"O0Y4PIyk_FfvgSb7Qzwczw":{"text":"A really good neighborhood pizza restaurant. Pizza is  excellent and the service is amazin","useful":0,"cool":0},"IC9-z7LxDR1SE363GSahbA":{"text":"My favorite gluten free pizza in New Orleans! The staff is always very kind and the pizza ","useful":2,"cool":0},"pxz7aLzU6QaRh6-IzBBUOA":{"text":"We visited Theo's while on a family vacation in NOLA. I tend to look for smaller local own","useful":0,"cool":0},"ASMYDmNw3DOfYUnVqqdPKA":{"text":"Very good pizza. I'm not a thick crust person and I enjoyed Theo's. It's kind of a hand to","useful":0,"cool":0},"_feFiNxaLXPJxdcy2austQ":{"text":"Great customer service. We had a large party of 10+ ppl. They accommodated us well. Pizza ","useful":0,"cool":0},"XheJ2Mwlpxp9gPP8ianzaw":{"text":"Had the meat pizza and pretzels.  The service was great and pizza was good.  Good place fo","useful":1,"cool":0},"YIjyHhMdyIJw9d__tSdT1w":{"text":"SO I CELEBRATED MY LDL'S BEING BELOW 90 TODAY\nat Theo's with a \"Meathead\" pizza. I prefer ","useful":5,"cool":0},"2cZcWoWhtT34vL82AtNJJQ":{"text":"Theo's Food Truck! Yep, that's a thing. While recently at the Courtyard Brewery, this food","useful":18,"cool":14},"rMiQPlf0IwfmaUQLftO0Yw":{"text":"ok pizza + good location = might go back might not\n\nI have to say that I was disappointed ","useful":1,"cool":1},"0G1UTPfdYfWRep5XhOe2vA":{"text":"Cozy, yet lively spot for homemade pizza! You go up to the bar in the back and order at th","useful":0,"cool":1},"McgfOQcTjLVZxwvYUtKWEQ":{"text":"Delicious food.  Ordered a salad with creamy Italian dressing that was awesome.  It was a ","useful":0,"cool":0},"Bgy5eTtkkDW4tnZODyXHVw":{"text":"This is THE neighborhood pizza place, hands down. Every time I come here, it is very famil","useful":0,"cool":0},"G_vQGoDFu66v1Uegv9iXaA":{"text":"We love Theo's Pizza.  Although they are a little pricey they are the best pizza in the ci","useful":3,"cool":1},"o4_h3Wa2w7pi4VIWEWoz2g":{"text":"First time at Theos..  the ambiance is quaint and the people very friendly.  Cool to watch","useful":0,"cool":0},"smByogF0utUxDmTiFYCFGg":{"text":"What makes these pizzas good, is the crust  it's thin so you can taste all of your topping","useful":0,"cool":0},"FUkKCkvksBk8DwhCkvbo4w":{"text":"Pretty great pizza, I'm never one to look at pizza too critically, especially New York thi","useful":1,"cool":0},"a42KgVdRrCq6r1CT6aR16w":{"text":"This place is the greatest! I didnt have their pizza, but the cheese bread was great. The ","useful":1,"cool":0},"_CiQAQVKKnzhNEhAg0gKVA":{"text":"So I had a serious craving for a particular pizza place in Seattle that my husband and I w","useful":0,"cool":0},"5V7CfJSX5eS3bdYHkUNGag":{"text":"My favorite thing about this neighborhood pizza shop is the staff, friendly and attentive.","useful":1,"cool":0}}