{"XWpfAXFcNpT_waKNCtYCfg":{"text":"Tip the waitress and sit in the courtyard, it's nicer and worth whatever you give them to ","useful":0,"cool":0},"GYCRy2-065a20moygsbT0g":{"text":"Went there for dessert.  Bananas Foster was out of this world.  Joel put on a fiery show f","useful":0,"cool":0},"kpyn09HXY2Px3BZmNXGxJg":{"text":"Come experience one of the most beautiful and historical Courtyards in the French Quarter.","useful":0,"cool":0},"TUulQJUGNqSzDQMGx2mpSg":{"text":"Beautiful venue. The outdoor court yard is so beautiful. The staff are friendly. We were t","useful":0,"cool":0},"uQ9Ye51UglRgxGINmVysmg":{"text":"Amazing brunch. Lovely atmosphere. We liked the food here so much more than Commanders Pal","useful":0,"cool":0},"iIkZw2IoQcKoalGSBZ28dQ":{"text":"The food is nearly inedible: our group of six gave up after two trips each- not because we","useful":1,"cool":0},"EB96ZhzYrsw7lKtuFV8MmA":{"text":"Best pulled pork sandwich ive ever had!!!!!! Their bread tastes fresh out of the oven.  Th","useful":0,"cool":0},"dqYftPY3wHp8I676a1lcZw":{"text":"The Court of 2 Sisters is a wonderful place. My wife and I came in from Chicago and was re","useful":0,"cool":0},"zjzzJdh0_Nr2K5ukDOfNvA":{"text":"We had two free tickets from the Jazz brunch from the hotel. The patio outside was very go","useful":1,"cool":0},"wnZhc1D5AkdYf7Ty0Y09LQ":{"text":"This place is very nice and well preserved from its original days. We only stayed for drin","useful":0,"cool":0},"lZitoAUTJb-cA0r8Yt2VbQ":{"text":"Wir waren an einem gewöhnlichen Mittwoch zum Brunch im \"The Court of Two Sisters\". Das Res","useful":2,"cool":1},"dIVXTxCRTO8OMF2V564tQA":{"text":"This place has loads of atmosphere, great egg, cold salad, seafood and hot creole dishes o","useful":0,"cool":0},"SFy4ZjF6u3u8coy2DROqaA":{"text":"This place is a must for brunch if your visiting the area. The outdoor garden is just as c","useful":0,"cool":0},"OpsmNtN9dv7d1JaCN-xAaw":{"text":"This place was awesome! We had a lovely time, the food was excellent and the service was a","useful":0,"cool":0},"gBGtA3GHd3x0Ir6POo9DUw":{"text":"The service is great,  the court yard and music lovely. The prices are ridiculous for thei","useful":2,"cool":0},"A1d0_oJnYaxZe0Wv21usqw":{"text":"The ambiance was great, but service was just atrocious... hostile !\n\nMy wife has a food al","useful":3,"cool":1},"xm56pDjHP5uTucWuTkhZ-A":{"text":"A must for any frequent traveler to New Orleans. It's ambiance is lovely, the jazz is grea","useful":0,"cool":0},"j_25AQaQDNW5af9j3hDsxQ":{"text":"Foods good nothing crazy but atmosphere is amazing live music is even better. Big place an","useful":1,"cool":0},"Nq_0Wzo6FhalB0yjKShrbg":{"text":"This place was nice, it was enjoyable to sit outside for brunch but I wouldn't call the mu","useful":0,"cool":0},"w3Th4CQT44P08D5UF6Oo4w":{"text":"Came here for brunch on Saturday before Mothers Day. We were seated right at our reservati","useful":0,"cool":0},"uOl-fm3qQhWxqKJfcMM01g":{"text":"Absolutely loved breakfast here!! It is so nice to have a buffet of all the must haves in ","useful":0,"cool":0},"mEy3aiBnBZyOOT2UQHgKyQ":{"text":"Let me begin by saying that I was looking forward to having a jazz brunch here during our ","useful":1,"cool":0},"-0Az1-vYIFD7MYKzjsQD3w":{"text":"We got a outside table, which is pretty romantic at thanksgiving night. No live music at t","useful":0,"cool":0},"tVcWNVGGTyi4rwGi-2nHaA":{"text":"For an evening of dining al fresco beneath a gorgeous latticework of wisteria, this venue ","useful":0,"cool":0},"00BYlrQZVyUkFYUoGTjEsg":{"text":"Not generally one to complain, so let me start by saying-- the service we had last Sunday ","useful":1,"cool":0},"GZ8talua_hFa7FmrRJwB8Q":{"text":"After searching high and low around town I finally found the turtle soup I was searching f","useful":1,"cool":1},"mU1OIb4uiromYnEYxcG2FA":{"text":"Saturday Jazz Brunch\n\nWe were able to get reservations for the Saturday brunch.  We sat in","useful":0,"cool":0},"lfUtDcUUuPkDhNqO-R3uIQ":{"text":"Last time I was in the French Quarter I couldn't get in this restaurant so upon returning ","useful":0,"cool":0},"Zq4ARNX6ZveMgsCyUoq9Qg":{"text":"The jazz buffet style brunch in the courtyard was exceptionally welcoming.The staff was to","useful":0,"cool":0},"42ljlB_wWwO-T3-5LJydiw":{"text":"Went for buffet brunch. A huge selection of 'ok' food with a few tasty items. IMO, not wor","useful":1,"cool":0},"0C9R_oz4E1MCG0gWjAhF8A":{"text":"Came for jazz brunch at the suggestion of a friend. Made reservations well in advance. Was","useful":0,"cool":0},"tNFlF0FPXeAosvNOrv1RQg":{"text":"It's an old staple of the French Quarter and really comes across that way.  More expensive","useful":0,"cool":0},"2sBzzdZgz4pT8-ex5xeK6g":{"text":"History lovers eat here!!\n\nSeriously, if there was a restaurant with some history in NOLA'","useful":0,"cool":1},"-VTIGIuPAsFwlGHHs9-UYg":{"text":"I went for the jazz brunch, and had a lovely time. It's served buffet style, but your serv","useful":1,"cool":0},"9dH2FxskDTxabKQwGIXSvw":{"text":"Employee refused to honor reservation for outside table.\n\nThere was piss all over the floo","useful":0,"cool":0},"pQSyxjyr78NJPCiUFtT3Wg":{"text":"We went for the jazz brunch. The service was impeccable! The patio is gorgeous and exactly","useful":0,"cool":0},"Gjh-IaJvXh-kC9vP8m_f0A":{"text":"Love this place!! Good music! Good eats! Will visit again in the future and do recommend!","useful":0,"cool":0},"bvfgffYOW1ImV1uUeYfzLQ":{"text":"A friend said that, while in NOLA, this spot was a \"can't miss\" opportunity.  Fresh off th","useful":1,"cool":0},"G2doa79p6lUtmaDDsTrCHQ":{"text":"So visiting Nola for first time, recommendations to come here, hmmmm.  Service poor, menu ","useful":0,"cool":0},"NMD1eCIc7afNTQOdFJri4g":{"text":"First time visit to the French quarter and I'm glad we got to try this restaurant out. We ","useful":0,"cool":0},"BE34vY8v6bXfS3msPmh4ew":{"text":"For many, many years my friend's mom has mentioned this place to me about the time she cam","useful":4,"cool":3},"qmE4lo3mvsr7byVFZ4Z5jg":{"text":"If you want to here the music call to make a reservation outside, but the jazz brunch is d","useful":1,"cool":0},"IC7RDRRbQvVcSo2EysmKJg":{"text":"Came here with my girlfriend for the Jazz Brunch after a long night of partying on Bourbon","useful":0,"cool":0},"5sXr8b2FzMRvLX5L8ldlfg":{"text":"Such an awesome staff! \n\nCame here Christmas Eve night for dinner after mass at the St Lou","useful":0,"cool":0},"7suo_Ci2vaIfpw1ika6itA":{"text":"My husband took me here for my birthday in June 2016.  We were visiting from New York and ","useful":0,"cool":0},"cvDsvtPds6ZR9WA4mHrVsA":{"text":"I celebrated my birthday at the jazz brunch and received a special birthday salute from th","useful":1,"cool":1},"G9GYYZO-Og4b4BekfTnuSQ":{"text":"The jazz brunch was wonderful and the atmosphere adds to your experience. Our only concern","useful":1,"cool":1},"S6QeTt0YzxPQj-Yx4gstYg":{"text":"We made a jazz brunch reservation and was worried when passing the unassuming entrance fro","useful":0,"cool":0},"rWVKczltW7_myy6CDzg2iQ":{"text":"ambiance and service make up for food.  however decent for an all you can eat buffet.  but","useful":0,"cool":0},"dIwbuarmh2k-nU_YR9O5Ww":{"text":"Suoer great atmosphere in the courtyard.  Food and Deserts were fantastic.  Ivan was a spe","useful":0,"cool":0},"kG80Ac20MOQfLq6y9zTJEg":{"text":"This was some of the best food I had in NOLA. Make a reservation! We had the brunch buffet","useful":0,"cool":0},"A6x6F7XQIxb5AG1gJO55pQ":{"text":"Let me start by saying I am not a fan of buffets. I have very bad memories of a Duffs Smor","useful":0,"cool":0},"UMLjVfvqopj1rmMY82v4Ig":{"text":"Our first visit to Court of Two Sisters and it was lovely. We sat outside and enjoyed the ","useful":0,"cool":0},"bDKFWvKSueMoq4XSZyTM1g":{"text":"We only stopped in for a quick cocktail during our day of roaming the Quarter. What a trea","useful":0,"cool":0},"YVqAmh6cget3VOAg1klTNg":{"text":"A recommendation by a friend brought me to this place for brunch. Walking across the beaut","useful":4,"cool":1},"zcIwmPHMfGIUEiXsS2JUYQ":{"text":"This is a fun experience for lunch, but be prepared to pay $30.00.  The food selection is ","useful":0,"cool":0},"u20XVhqBxmhosXYA-LfXjg":{"text":"I've been to NOLA 3 times with different people, and we always end up here for brunch.  Th","useful":0,"cool":0},"ZONPNHi1FfiBwyu2gtgPaw":{"text":"The only place in Nola I won't be going back to again.....\n\nNothing about this place was g","useful":3,"cool":1},"SXV2LPPLHGrOieCxYw1LTw":{"text":"I took my three grown daughters to this brunch and we were all very disappointed. We are f","useful":0,"cool":0},"I4m1NxPQ-Op6kbVylRKnHQ":{"text":"Amazing food, outstanding service with classy staff. Chico Hamilton and some Dr. John in t","useful":1,"cool":1},"cqdQOe77osOVnu79rwo90Q":{"text":"Phenom Nawlings Brunch! Sit outside and enjoy the live classy Jazz in the background while","useful":2,"cool":0},"nQv7Frp0UhfCNSP1UNq_Rw":{"text":"All I can say is YUMMINESS while looking for a minute to break off of Bourbon Street!!!  I","useful":0,"cool":0},"U-c_6FKp1AOVHM98rzC4rw":{"text":"i wouldn't probably go here if i was a New Orleanian but for a tourist, the Court of Two S","useful":0,"cool":0},"ZJvK_yMBcP1__2SV5RBCGw":{"text":"The restaurant is older and has charm galore.  It's gorgeous sitting outside; be prepared ","useful":0,"cool":0},"wW7pDn6lV3V6ite0ja0S0Q":{"text":"It is easy to be lead in from the street. Very intriguing old school New Orleans ( pronoun","useful":0,"cool":0},"sKQQJkmI0t2AxNdbdwZk4g":{"text":"This place was *horrible*. Sunday Jazz Brunch - outdated decor, bad service (one job: keep","useful":0,"cool":0},"4idDIMlCgWjUQJyjL7NIYw":{"text":"I don't think you can top the Jazz Brunch to kick off a New Orleans day!  The ambiance set","useful":0,"cool":0},"pmuKpvDMnssP93EIYmDc7Q":{"text":"Took my brother and mother here for Brunch after being told that he was excellent place to","useful":0,"cool":0},"D07_N2FIv6v1YWZgT6DGhw":{"text":"Brunch food was great, but I'm only giving two stars since my purse apparently walked away","useful":4,"cool":0},"K17DdR2nbUuK3lKeZ750KA":{"text":"Absolutely loved this place. The brunch was awesome, ambience was perfect and, well, how c","useful":0,"cool":0},"-lmormDjAM8kFfUfjd4VQg":{"text":"Not worth the price, two wrong orders. We had three people order coca colas and were never","useful":0,"cool":0},"laPZGEbUpTFhn2-hzsol6A":{"text":"We came here for brunch on Saturday at around 10am. We made reservations, but we didn't re","useful":0,"cool":0},"slpfIyvZZ71PjldKMSIsOA":{"text":"Came here on my Cocktail tour.  Had some sort of a fruity drink which was meh.  Looked lik","useful":0,"cool":0},"l3ITM15YseFbqsotp_orEA":{"text":"This is a no-brainer for an out of the ordinary brunch in NOLA.\n\nDon't go somewhere averag","useful":23,"cool":17},"Ug-FoI3SRjuGj-cwRgrAUg":{"text":"Had the tenderloin and like the name says it was very tender could cut it with a fork. Shr","useful":2,"cool":1},"DEpu1uiSXyIm-i9LgYHN9A":{"text":"If you are in New Orleans, this should be your first choice for brunch. The selection is i","useful":1,"cool":1},"9SBwUw994wcXJP2-Or7IUw":{"text":"I am not a food critic but here's what you really need to know, people come to The Court o","useful":1,"cool":1},"pYEHH_mZwVn8vjylOIPb1w":{"text":"Wonderful dinner.  Both the catfish and the chicken were great.  The expresso and desserts","useful":0,"cool":0},"C1Tokqy5ARbzq0BrSvHddw":{"text":"The service was horrible. The food looked and tasted like it was microwaved and a cockroac","useful":0,"cool":0},"V11kZPNlybImlvXcES-Vvw":{"text":"Great place for brunch. Ask to sit in the outdoor patio for a little jazz and great ambian","useful":0,"cool":0},"vXsiPPxewVWCJXYLnjakWg":{"text":"Great like all the other reviews I will only add that the staff is very involved in up sel","useful":0,"cool":0},"BJjg2zDrJ-ndG4krc7tK2A":{"text":"This place is absolutely beautiful inside and out.  The service was fantastic.    The food","useful":1,"cool":0},"eCVOlqD6hrSZbSlwhA61fA":{"text":"The Trout Almandine was to die for, the Cesar salad and Creme Brûlée were excellent. Price","useful":0,"cool":0},"llCj9Gb2MmrD2P8DMUmyjA":{"text":"We have always wanted to eat here on one of our visits to NO, so finally, we did the brunc","useful":0,"cool":0},"zg5IcA10C1hLQheg8slHfg":{"text":"Atmosphere is ok... I'm just not a fan of eating outside. Too hot... Too many flies. Food ","useful":0,"cool":0},"DnZt9Tsbl3gRWrt4LHA3Cg":{"text":"Went to the jazz brunch. Food was ok and not the expanse of selections I would expect for ","useful":1,"cool":0},"oF4uAsJTE7g5rrsVFECLUw":{"text":"This was the first place I ate during my stay in New Orleans. I had a tiny bit of pretty m","useful":1,"cool":3},"dWwGRJ7JG8m-utOMM5WIGQ":{"text":"I wouldn't recommend this place. We went for the jazz brunch and could barley hear the mus","useful":0,"cool":0},"l7D_W0hnkeC5-KUWpBYzMA":{"text":"This is NOT your typical buffet. This is top notch food, just served buffet style....the w","useful":0,"cool":0},"tQ4DLaFn64FdsVkER3uBIg":{"text":"First off, I would've given this Jazz Brunch a five star rating, had my Ray Ban sunglasses","useful":3,"cool":1},"PZFwe84_E-85mvRNFcmRNA":{"text":"Very, very tasty - a step up from your usual buffet, even if it was a bit crowded.\n\nThe re","useful":0,"cool":0},"lok0Kd1Pwg8SgzEM9JFVfQ":{"text":"Okay, first of all the brunch cost $63.66 for the two of us and my overall rating of avera","useful":1,"cool":0},"j2eL1M5NB31MVEJ-ON9naQ":{"text":"Sort of a mixed bag. Overall the food was good and the atmosphere was lovely. I enjoyed th","useful":0,"cool":0},"kVgXTzDV-69xKRw6XmoGaQ":{"text":"Had dinner at The Court of Two Sisters on my first night in New Orleans in late-February. ","useful":0,"cool":0},"K310AtONmUHhd8957v457A":{"text":"great place food was awesome!!! they also do live music outside on the weekends. Drinks we","useful":0,"cool":0},"-XzSGSIuvnyr4zfGE27X2g":{"text":"I had the Crawfish Napoleon and it was to die for. The cream sauce and layered fried green","useful":0,"cool":0},"zkbeZYVNG9i-yowVE4AUGg":{"text":"The quality of food here has declined in recent years, but I keep going back:). The ambien","useful":0,"cool":0},"b2bmnsRIrMjGlzRQ47g2JQ":{"text":"This is one of my father's favorite restaurants, and since New Orleans is practically his ","useful":0,"cool":0},"Zp0262XPesY_23e3SLbYdg":{"text":"A perfect start to my weekend in New Orleans. Really enjoyed the live jazz music while sam","useful":0,"cool":0},"ssZvejXvD8FO3XJ6RfRWbA":{"text":"Brunch was fantastic. However, we tried the sandwich shop today based on that experience a","useful":0,"cool":0},"dl88XZ9UXvcbRXuMMQAPNw":{"text":"We were pretty disappointed in the jazz brunch.  Granted, we came as they were wrapping up","useful":1,"cool":0},"nbZBAxvA3cqtjsShJ569wg":{"text":"Brunch, Brunch, Brunch, Brunch e'verbody! \n\nA group of us went and sat outside in the cour","useful":7,"cool":9},"jA5eOFb6gXj7VvKZQzhtfQ":{"text":"This place has history. I last dined here in 2002 before I started cooking Cajun food. Now","useful":0,"cool":0},"Lb_uWnGVeNH_xLpke_2xjA":{"text":"I scoured over the reviews before I decided to take my mother and boyfriend here for brunc","useful":0,"cool":0},"uQ-uIgJZIxWKQJxQonaG2w":{"text":"Fun, Saturday morning brunch buffet, with a jazz trio playing in the courtyard. Suggest yo","useful":0,"cool":0},"xniUTGrjfD3ArVUT3S2lNA":{"text":"A must do when in the French Quarter of New Orleans.  You will not be disappointed. Well p","useful":0,"cool":0},"Lxi9cEIwiBGWnJj1rxFjXw":{"text":"I was very disappointed with this place.  We had 1:30 reservations and got there around 1.","useful":0,"cool":0},"XJXhu_ruT9jhgdHChmCZLQ":{"text":"Clessie Jackson and Chris Tunson was Great! I highly recommend this to anyone that is visi","useful":0,"cool":0},"rxMMkJlc-RN13VhLripHNA":{"text":"We had our wedding brunch here and from the office ladies accommodating our event to the w","useful":0,"cool":0},"msPOZTdDHsKq5O71d5Rf2A":{"text":"We came here for the brunch buffet and I absolutely loved it!! The service was wonderful a","useful":1,"cool":0},"AhIpqKx7mYD0iTQsb3HEfg":{"text":"Food was phenomenal.  I have the 4 course fixed menu as did my wife.  I had the famous tur","useful":0,"cool":0},"hdUyTHo69LhlswyEKGYw4g":{"text":"This was my worst dining experience in New Orleans. The service was poor! Waited 45 minute","useful":0,"cool":0},"nROx72RjbeHh3hd5UVY-GA":{"text":"The Jazz Brunch everyday is beyond compare. The ambiance is amazing, but the food is culin","useful":1,"cool":1},"Ar8XEsEn02u48kmuaYSKnQ":{"text":"Good place for the Jazz brunch buffet on Sunday. If you concern more about ambience, I hig","useful":0,"cool":0},"Ib_FQTKGKfJrq_btU8Z26Q":{"text":"Enjoyed Sunday Brunch on 2/23/14. Thank you Vaughn for serving Southern Hospitality done r","useful":0,"cool":0},"9tgR_CnxFP15FWRM_ZQvlw":{"text":"Vaughn was a very sweet and attentive waiter.  Beautiful setting, however the canopy tree ","useful":0,"cool":0},"K5uYAxtECVrX-Z8LidvSTw":{"text":"Horrible slow service.  Very over priced food portions small.  Thirty dollar pork chop tha","useful":0,"cool":0},"nOMHkXZBlbEkvc7VuPK6dw":{"text":"Dont miss this gem of a place!!! Hubby and I had an amazing meal, pork chop three inches t","useful":0,"cool":0},"NsyULiP04_2KPEJZTDngew":{"text":"I came here for dinner with my parents Monday night. It was easy to tell that this place i","useful":3,"cool":0},"sOc2k2YGTQvtNqerOxcmiw":{"text":"The setting was phenomenal as well as the food.\n\nWe made reservations for breakfast in the","useful":0,"cool":0},"ojnWmvtQkdezRRnWoNcnJA":{"text":"Did someone just say crawfish pasta and cornbread! Incredible buffet. Well worth the $!","useful":0,"cool":0},"5XeMa8UNafRJJ3-YsrD-nw":{"text":"My husband and I loved the jazz brunch! Definitely worth the experience even though it's a","useful":0,"cool":0},"smSTRUGgQwFsLG15_9wz9g":{"text":"Ok if I could give them no stars I would....worst service EVER, had to ask 3 times for a c","useful":0,"cool":1},"YWv_E5H2eYoobpGQx58m4g":{"text":"I took a friend to this restaurant for a brunch on Saturday, July 15, 2016 for his birthda","useful":0,"cool":0},"rAmlLBptI0adWlchyoULyA":{"text":"Atmosphere in courtyard was great in the evening. They knew we were celebrating our weddin","useful":0,"cool":0},"B-JjtYkep_DP4uEQbC5Rtw":{"text":"This was my first meal in NO during a trip.  We made reservations per a friend's suggestio","useful":1,"cool":1},"f0nb2EENtmkXDJ-zWRLLJw":{"text":"Ambiance-wise, this place deserves 4-5 stars. We ate in the beautiful courtyard with a liv","useful":0,"cool":0},"l9lV_RmMdmFqi89p3Pe3JA":{"text":"We first came here about twenty years ago.  Tonight's visit was just as memorable.  Our se","useful":0,"cool":0},"S1MsrSke1a9q3rWcKq4V7A":{"text":"I would say this is a nice place to go to impress a lady you really like guys.....however,","useful":0,"cool":0},"CnEeCQd_KKELcrl6V6Y6FA":{"text":"This place is great!  Great ambiance, beautiful/lush courtyard, live music (Daily Jazz Bru","useful":0,"cool":0},"DqSmrXY2QDwv6asqECkWfg":{"text":"Pretty bad. This place was majorly hyped for us: everyone said if you go to NOLA and do ju","useful":0,"cool":0},"lR_45VlTkhmQBqX0HrvL0w":{"text":"Underwhelming! one of the most overpriced brunch buffets ever! The quality of the food was","useful":1,"cool":0},"OFvLXaSyWo19fhgxCQ4BWw":{"text":"Jeremy and Natissa gave us the best service we have ever had in our lives. The food was wo","useful":0,"cool":0},"xMJAHOfMRnB50vO-we0UJw":{"text":"Our server \"Captain Vaughn\" was sweet as could be, entertaining, and funny and endlessly h","useful":2,"cool":0},"n-vcFMV4ePE8aZZUFs_pmg":{"text":"Great meal and very good service for a 7 pm dinner.  A reservation is recommended.  If it ","useful":0,"cool":0},"Dbv9L0KmiGMwfR3mBCsjdA":{"text":"The Court of Two Sisters was spectacular. My wife and I went on a Wednesday with reservati","useful":0,"cool":0},"zqjefjQaKilBvLfQS119wQ":{"text":"This place is just okay.  I went for brunch only once and thought the food was kind of bla","useful":0,"cool":0},"S3-8V_L9kNoVDwk2P4kuJA":{"text":"We did the breakfast brunch Dec 2016 and would say the ambiance was good, service good but","useful":1,"cool":0},"DD0rZa96eomuEybVprJisw":{"text":"If I were mayor of New Orleans, I would eat brunch here at least once a week. The buffet w","useful":2,"cool":1},"pZrbfU7sMZ8nbXxXRAle0Q":{"text":"The atmosphere is top notch - it's a beautiful courtyard. The Turtle soup was perfection, ","useful":0,"cool":0},"mCgI4-13wT9ZchBiuK3HrQ":{"text":"We loved the bar attached to the restaurant. Our bartender Paul was amazing! Best customer","useful":0,"cool":0},"ErrEJVgHlecS5VspEM4SpA":{"text":"Was really looking forward to having brunch here after reading good reviews. Food was medi","useful":1,"cool":0},"9rgKo9M_-y2w55yKzxk_Rg":{"text":"After high touting and praise from a bunch of friends, I was pretty underwhelmed by this e","useful":1,"cool":0},"8UNg3cz2pEcoxPAqhVuS2g":{"text":"Wonderful way to start the day! Excellent mimosas & breakfast buffet","useful":0,"cool":0},"z9ifJyiZiW4xPV6OO9Ztcw":{"text":"About as good as it gets.  There is trendier.  There is fancier. 10 years from now you wil","useful":0,"cool":0},"yzdZoxyncCZFrH5L-m02KA":{"text":"This was one of the best breakfast experiences I've had. We did the Jazz brunch. The outdo","useful":0,"cool":0},"YSUPAa5CBDLaONo5QmF_3w":{"text":"I don't  like giving bad reviews but after three seperate visits, I believe  its time. Gre","useful":0,"cool":0},"n-9vMsms1oGjQxXGikcewg":{"text":"I have passed by this place for years not thinking much about it. Wife and I tried last ni","useful":0,"cool":0},"r6QV0VnGSbHXXqO2U2B_TA":{"text":"We have eaten here 2 or 3 times now and it's always a great time.  I would recommend going","useful":0,"cool":0},"uLLDn-oOK-zrLhDVdsRnwg":{"text":"Food was incredible.  Employees were fantastic  and I LoVED the live jazz band.   Beautifu","useful":0,"cool":0},"rnAdQrv-6yOcHm3V0d96SA":{"text":"I surprised my husband with a trip to NOLA for his 60th birthday.  I chose the Court of Tw","useful":0,"cool":0},"XV49qHkFsNhdCC9F4pbfnw":{"text":"Terrible service and my husband and I both spent the last day of our vacation with food po","useful":0,"cool":0},"GJBJVFHgMWZLohUAD6zmgA":{"text":"Brunch during Mardi Gras!!! I stuffed my face beyond measure","useful":0,"cool":0},"l7DNzdeGJke2akA8E-taIQ":{"text":"Initially I was a bit concerned from the reviews about the service.  It seemed to be a hit","useful":0,"cool":0},"SZj0rPw0VnM-RhvGJrzs4g":{"text":"Highly Overrated, it was a bad experience from the beginning for everyone in our party of ","useful":1,"cool":1},"ccRy82vTa8W0UNcg_giMCg":{"text":"Amazing brunch with live jazz. It was a great way to test some local faire. The service wa","useful":0,"cool":0},"z7lrTpq0O1DqrGB6THEEmw":{"text":"Do not come here , very rude ... I bought a drink and was coming back to buy another one a","useful":1,"cool":0},"w4oJkuQP0ka_RgVNrmJ5wQ":{"text":"Got the strawberry daiquiri which was a bit too sweet for me. I love sweet drinks, but it ","useful":0,"cool":0},"PFrBeIaeH36VHCdTy3SzYg":{"text":"I really enjoyed the brunch and mimosas. I was there with family to celebrate a surprise e","useful":0,"cool":0},"JpTzHO_m8wyAA0muk8b81Q":{"text":"HIGHLY overrated.  I have been waiting to have the famous brunch here for four months and ","useful":0,"cool":1},"xFV4O6WzbGUHnz-E_LLsOQ":{"text":"We decided to have Sunday brunch here on our last day in NOLA. We made reservations well i","useful":0,"cool":0},"p0CMe3H76-SsZqUGMsL1aA":{"text":"The atmosphere is awesome. Great courtyard if the weather is nice. Food was pretty good, b","useful":0,"cool":0},"Snb0YXPL0fFDhYavk7Uqwg":{"text":"It is a beautiful courtyard and the wisteria vine in amazing.  The brunch is delicious.  T","useful":0,"cool":0},"4kZ2e1DyESkojCvqQC1jsw":{"text":"Was brought here by a friend for Saturday brunch while visiting NOLA.  We sat outdoors in ","useful":1,"cool":0},"TziKGlEewW7OE6WpKuRYkQ":{"text":"What a let down...  WAY OVER PRICED for the quality of the brunch food. I would not go aga","useful":1,"cool":2},"WPPXooIW7QKi4ioLaS3xwA":{"text":"Like so many other reviewers, I also booked the jazz brunch for a special occasion (friend","useful":0,"cool":0},"K4J5vuNyGKfPRl-gT9Ff-w":{"text":"The brunch buffet was great! It pleases people of all tastebuds. Service for drinks was a ","useful":0,"cool":0},"ezhm7lYCB7G2kO0-trY3Zw":{"text":"Had an amazing weekday lunch buffet. Each dish was fantastic and the service was top tier.","useful":0,"cool":0},"_lkxGMtoc63Zcf9Ahrkerw":{"text":"Such a disappointment! Mark A's previous review of it being a \"hot mess\" is an understatem","useful":2,"cool":0},"_uUaS2IMUloNvNrvYDvkHA":{"text":"Amazing bread pudding with bourbon sauce. Chef de cuisine Denmon Bateman is the man. After","useful":1,"cool":1},"eYvwWsCWLC7DQijGK4ADXg":{"text":"The food was excellent. I would definitely go again. I highly recommend the pasta. However","useful":0,"cool":0},"_oku6rSQYHZw8uGKfbdE-A":{"text":"We stopped in the bar at Court of Two Sisters this past weekend while visiting NOLA and it","useful":0,"cool":0},"SGOSWsng97zL6g2HDEjklA":{"text":"This is a popular buffet restaurant in French quarter. I was largely underwhelmed and thin","useful":0,"cool":0},"pM9bMm1h6tJJnGHHL90ayw":{"text":"So many people recommended me to go here so me and my mom went for the famous brunch. Alot","useful":0,"cool":0},"0rK4M3OUAIuP3F22QtG8_w":{"text":"The food was good and the selection was great. The staff and buffet were not clean. I can'","useful":1,"cool":0},"Nsz-P2JjGzHQJZHbNgS1og":{"text":"The food was great and so was the service.. the only downfall was I paid in advance for fo","useful":0,"cool":0},"a9fCfISQBZjK_lTJdf6YLg":{"text":"Came in for the Sunday Brunch....and a Bloody Mary. Both were good. The buffet was large, ","useful":0,"cool":0},"HIGeRYt14HGTQqPFZOF7xg":{"text":"If I could give less than one star I would. Waited for over 2 hours for an overpriced sala","useful":0,"cool":0},"N8jsmooJZL7UopNgu991Tw":{"text":"I'm princess beautiful services is friendly, but the food was limited. I was there for bru","useful":0,"cool":0},"S5P0Sm-hDWU_zogZQ9YSFw":{"text":"Came for the Cajun breakfast buffet and was not disappointed. Table favorite was the biscu","useful":0,"cool":0},"VX09FGP0T0mK7za8G0j4Lw":{"text":"\"Meh. I've experienced better.\" just about sums it up.  I wasn't exactly happy with the fo","useful":0,"cool":0},"6iHFwfkC995H6wW5uipovA":{"text":"Awesome food! Im not a buffett fan but they had a really great selection. For $30, you get","useful":0,"cool":0},"KafaTSy9W_w-6-Y8N_V4cw":{"text":"Had the jazz brunch buffet. Lots of great entree and desert options. Cream spinach, garlic","useful":0,"cool":0},"j9Uz06B0-oK9McL5td5ueA":{"text":"I was so looking forward to eat at this restaurant but once I was in I was not impressed. ","useful":0,"cool":0},"sWm2uPk91nlv5bncttsdqw":{"text":"Incredible atmosphere - when you dine outside under the lights it's like you're in a movie","useful":0,"cool":0},"TrJjrzLRiNuUrTE0oYg57A":{"text":"Great View, Great Cuisine Experience  \n\nSaturday Oct. 17, 2015 was my anniversary and plan","useful":0,"cool":0},"SEc3RYulwX09mPn2B0f3-Q":{"text":"Awesome jazz brunch. Excellent service, wonderful food!!! Also a beautiful atmosphere. I h","useful":0,"cool":0},"R8o73IJHIcACtX2CGpNp_A":{"text":"Where to even begin? If I could give this less than one star I certainly would.\n\nWe had re","useful":2,"cool":0},"nS1HIA5dCrkUBskdMQwgOQ":{"text":"Jazz brunch on a Sunday was FANTASTIC. GET THE BISCUITS! Best in the south hands down. Aro","useful":1,"cool":0},"BRJKhyeFHWa3l8HsN7qE7Q":{"text":"I've only been to The Court of Two Sisters for the jazz brunch.  Definitely make reservati","useful":1,"cool":1},"3A80LpOXT8UGCezC-uUs1A":{"text":"The courtyard at night is the best time to be here. So charming and pretty. We sat near th","useful":0,"cool":0},"P0Tr3ADILJxbasHh4jK7tg":{"text":"I came here for jazz brunch in the middle of the week (on a Wednesday). Service was great ","useful":0,"cool":0},"wSyGnr1wcu0PJLNn4I1G7Q":{"text":"Happy Thanksgiving!\n\nWe did not have any plans, and a friend recommended this place for br","useful":2,"cool":2},"WIx-9CKpQeliPPdW6wr1Rw":{"text":"Really lovely place for brunch in the quarter.  The outside courtyard is huge and super pl","useful":0,"cool":0},"38koc91zdaBB89NhJp6FRw":{"text":"I went for the daily buffet brunch. The restaurant is very old school, but it was overall ","useful":0,"cool":0},"rc2Ex3aXTlDhY-LOWUtJLQ":{"text":"Great place off of Royal. Wonderful background story about the history of the location...j","useful":0,"cool":0},"ZpfshXNKI57ZyZXELfZV9Q":{"text":"Poor Krista got treated wrong.  I loved it!  It's a breakfast/brunch heaven full of seafoo","useful":1,"cool":2},"xjDaiazVhtk-Og9Fq15AEw":{"text":"Fantastic brunch spot! Was only in NOLA for 3 days and was told this was one of the must s","useful":0,"cool":0},"8Snbt0jBfRwxWSDYtlbV3g":{"text":"On a recent visit to NOLA, we made reservations for jazz brunch at the Court of Two Sister","useful":0,"cool":0},"nxU9QSe7MWHTyVHH-hmCmQ":{"text":"Had a bachelor party brunch here. Great location down on Royal, and we sat on the back pat","useful":0,"cool":0},"5ARKry2HpJF-l7uaOKDmKA":{"text":"The staff was great and a beautiful courtyard but my fish was harder than the tire on the ","useful":0,"cool":0},"nONj41Ttti6xwCNRUjlitQ":{"text":"Did a Sunday birthday brunch here with 25 people when we were in town and we loved it! The","useful":0,"cool":0},"37QYguFO-j8yL-fLqbBoNQ":{"text":"This may be my FAVORITE restaurant I dined at during my time in New Orleans!! The jazz bru","useful":0,"cool":0},"xSIW_HF5qYlXEESHEo5K8w":{"text":"First time here and loved the ambience. You wouldn't be able to tell how big this place is","useful":0,"cool":0},"21BfDWNVZfOrO4micOM_NA":{"text":"We've been here several times now. In fact, the Court was my very first fine dining experi","useful":3,"cool":0},"h9s8lWW4Gw8mpuF0kjixEQ":{"text":"The group including myself went to the Court of Two Sisters.  It was interesting history a","useful":0,"cool":0},"1K8aFrZGtGOnUxWCHAcndw":{"text":"The place is amazing, the food is 7out of 10, it's a buffet what can expect. The service i","useful":0,"cool":0},"gTdGz6IxZvIWFEGsUVGbUg":{"text":"I have only been for the Jazz brunch and it's just OK. The eggs benedict is where its at s","useful":1,"cool":0},"QOQ-8tyCnsn2NpSRGrNmHQ":{"text":"Divine brunch! We visited with a large group, and everyone was pleased.\n\nThe selection was","useful":1,"cool":0},"_yiLYtelrCjQV8ls1ZtLLw":{"text":"Have repeated the same mistake at least three times over the years opting for the convenie","useful":0,"cool":0},"iy3jl33uEb-MNBL27q5vuw":{"text":"Pricey, but brunch buffet was incredible! Try a little bit of everything and your taste bu","useful":0,"cool":0},"ByE-0vtBmKPbCYzutCqTqA":{"text":"Make a reservation and let them know you prefer outdoor seating.  While the jazz is hard t","useful":1,"cool":0},"LLsGaYzht8Sq6ll_7lUlcQ":{"text":"I went for their Jazz Brunch Buffet. $30 a person gets you unlimited creole and breakfast ","useful":1,"cool":0},"Mi1D3AoQn6LYAnT8_81dzg":{"text":"We ate there yesterday, it was a Thursday. I did not think to ask if the courtyard was ope","useful":0,"cool":0},"qptMRSuMkiyFdvP2DhFZ1w":{"text":"LOVE the set of the restaurant. Buffet had a nice amount of food to select. Nice place for","useful":0,"cool":0},"5ctlNRFvE-GIZEJob7n5cg":{"text":"I received two free jazz brunch tickets when booking my vacation to NOLA last Thanksgiving","useful":0,"cool":0},"sGyNgtfKBhJxomYFA2odRQ":{"text":"Seldom have we been so totally disappointed in a well known and highly touted destination ","useful":0,"cool":0},"0DdPljfH_Rlm9hQ0Bov27Q":{"text":"great place \nI am from out of town and this is my 6th time to come here\n What I like about","useful":0,"cool":0},"drq3IVhfeWrwbTgXP514VA":{"text":"Somethin about this town makes me in a five star mood. It's really the service. I mean put","useful":0,"cool":0},"HHsUaRrDbQ3PhwrKmJwsmw":{"text":"i have been here only once. i had the brunch buffet on a Monday.  for a Monday, it was pac","useful":1,"cool":1},"qzrPZFUjywlTu4JH5_GwMw":{"text":"Tourist trap with under-seasoned food and over-seasoned prices. \n\nFOOD - easily the worst ","useful":0,"cool":0},"xBKENQXprq8vDmmSOIyt8Q":{"text":"We had a nice relaxing dinner in the courtyard with friends.  We thought our food was very","useful":0,"cool":0},"aYz2mavsOSrE-RNeiy1SZQ":{"text":"Great food! Great service! Excellent atmosphere! Sunday jazz brunch was served buffet styl","useful":0,"cool":0},"zBhxjfNohrSZgn3CPpddMA":{"text":"Food was fine.  Could not get a clean glass or plate to save our souls.  Too many other gr","useful":0,"cool":0},"HEdBw9uuuhD2a0hphWK4NA":{"text":"This place is awesome! We were in NOLA for a fraternity formal and came here as a group fo","useful":0,"cool":0},"zu1FTQigXDSLihjYhJ491g":{"text":"Came here for a wedding rehearsal dinner.\n\nThe salad, beef and seafood pasta were all exce","useful":0,"cool":0},"fdn0xTuMXusT2D6uROXo0Q":{"text":"I was not impressed at all!! The food was average at best, the only thing I enjoyed was th","useful":0,"cool":0},"P-pu-7c2_Z7fPIB4Oy1w2g":{"text":"CTS is one our our favorites. We made reservations and was seated in the courtyard. The at","useful":0,"cool":0},"HLPl8M94Hti80P1FCHaCUA":{"text":"So the food was really good. We did the brunch buffet and the variety is awesome. It is pe","useful":0,"cool":0},"PGtUPxi6BAWTqBNfylEsgA":{"text":"I've found out about the restaurant from some guide books, and heard of its beautiful cour","useful":2,"cool":0},"zmt4gI_WqjEC417T5qYYrg":{"text":"The service is really nice, but I have to be honest: the brunch is a buffet. An okay but n","useful":2,"cool":1},"LzYogkkzDCa98Aft91bnCA":{"text":"The food & the service was amazing! Toby took very god care of us.  The place is beautiful","useful":0,"cool":0},"wJ4R8XanJrluTKHm2-h3xQ":{"text":"This place is beyond fantastic!  Had Sunday jazz brunch and sat outside in the courtyard w","useful":1,"cool":0},"gfXF2CtPlHirbZgcL_CG6w":{"text":"I liked this place a lot and ended up here late one night by myself.  Decor and atmosphere","useful":1,"cool":0},"Hn13oAdAPUIRQs48NWz8iQ":{"text":"Run far away from this place!  If I could give this place less than one star I would.  I h","useful":4,"cool":0},"ZTP9rhKi6G_jPq9fiNLIuw":{"text":"We arrived with no reservation and were banished upstairs which made trips to the buffet d","useful":7,"cool":2},"V21fwn5XhUi15ZXRjfAKEg":{"text":"Unfortunately although the service was great and the waiter made sure we had everything we","useful":0,"cool":0},"80VywKX6rR1AJ2_uIeYH9A":{"text":"Unbelievable. You need reservation to sit in the courtyard, but we say inside and still ha","useful":0,"cool":0},"wt6HMrB9aFRsFNZtHtECPg":{"text":"Good food, great cocktails. \n\nWent with a fairly large party, waitress was good until it w","useful":0,"cool":0},"eWQxpyDxzmrXBcQtqKX7cA":{"text":"We came in for the Revellion menu. I had the Turtle Soup which was alright, not a fan, but","useful":0,"cool":0},"A6YQPecU_6tI9raoPbIz4A":{"text":"My friends and I were dressed for a white party and didn't know this place was a buffet; d","useful":0,"cool":0},"zmYifHVyk7VhSQKO6iiYzA":{"text":"Service was very slow, way to expensive for what little food you get. $30.00 for a single ","useful":0,"cool":0},"Kvms0pcd-fnONVnBWXzd0w":{"text":"Make sure you make reservations. Outside seating is where it's at. The omelet station is g","useful":0,"cool":0},"tPdvXOrKzGfg6BTt9b-YGw":{"text":"The buffet is terrific and they make eggs benedict to order--the downside is the massive l","useful":0,"cool":0},"utvmeAPNfWIL2eWovjvHaQ":{"text":"For some reason this was recommended to me by a local and I just don't get it. First, the ","useful":0,"cool":0},"3hcHbVCgPQqON4po42S-1Q":{"text":"Everything is mediocre... At best. The Jazz Brunch is nice, yet a lunch not a brunch as TH","useful":0,"cool":0},"LDLEK1eKTZYO-4Vc53SAfQ":{"text":"After hearing rave reviews on The Court of Two Sisters we decided to have our first night ","useful":0,"cool":0},"GJq4ahm2v28eA6AZ2c9mEQ":{"text":"This is a traditional New Orleans \"check the box\" place to go.  If you haven't been there ","useful":2,"cool":0},"28VoaJ3JS8nue7HTIm6z_A":{"text":"I have been here before and it was amazing; however, this last time it was not as good. Th","useful":0,"cool":0},"jokdGpore47sjpThRtYBvw":{"text":"Worst \"nice dining\" experience I've had. While in New Orleans I was told I had to try a ja","useful":0,"cool":0},"6Qq_ikt4NKgpYwiyntIG4w":{"text":"I see a lot of so-so reviews here but I have to say that I was impressed. Maybe my expecta","useful":0,"cool":0},"ip5HLnIWg7goCh9Dd5cNlQ":{"text":"The Court of Two Sisters had the worst service I have ever seen. The worst dining experien","useful":3,"cool":0},"7zw1ZiqYqhEE6cUVMRsORQ":{"text":"This was an enjoyable brunch. The food and service was pretty good. Food wasn't anything c","useful":0,"cool":0},"myJuauthbnnKKR6mWlSPRg":{"text":"We really really wanted to go to the Court of Two Sisters for the Jazz Brunch. And we coul","useful":2,"cool":2},"xC2I5VS88QBov-wlB5ovVg":{"text":"Jazz brunch was truly awesome. Staff here are very friendly. The waiter seems very well pr","useful":1,"cool":0},"RY-Ns7L6eqW2ZuJUgkyqeg":{"text":"Nice experience. Came here on a suggestion from a friend. The buffet is plentiful and it's","useful":1,"cool":0},"YBm68slsaA3KGnm3p2BUcw":{"text":"Went here for the brunch. Had a couple locals recommend this place so we figured we'd give","useful":0,"cool":0},"MFsmbXd-LdEn_eHpy3ogOQ":{"text":"The food and service was great. We ate at lots of different restaurants and this was a gre","useful":0,"cool":0},"ba5Eu1s2nOsrAka0Glftww":{"text":"Great food, great service, we loved our brunch here, It was special and they have a lot of","useful":0,"cool":0},"MD9OmhZUaXG4c6H9C1_gCg":{"text":"I can speak only of the Sunday Jazz Brunch.  My friend and I received vouchers for a free ","useful":2,"cool":1},"btupG3tKi9QBUBOhl7KM1w":{"text":"We visited The Court of Two Sisters for the first time in our most recent trip to New Orle","useful":0,"cool":0},"m5_VTqzv6hp1s2dwV--T8g":{"text":"Nice way to start off my first morning in the French quarter. Did the Jazz brunch on a Tue","useful":0,"cool":0},"q0IP2_wROlb2Ij55a-2Ghw":{"text":"Down here in the Big Easy, it only gets better. The Court of Two Sisters (Wow) you owe it ","useful":0,"cool":0},"Mqvw6Y1g0JzjN6mbsm-nTQ":{"text":"Every cab driver and concierge we talked to recommended this restaurant,  so we thought we","useful":0,"cool":0},"e8rmFLK_cPFKXMgQPyIurw":{"text":"This Restaurant is amazing!!!!  I've just enjoyed one of the best dinners in the most wond","useful":0,"cool":0},"bp7T1BthTj7hCC0W1rP0VA":{"text":"This is an excellent brunch location. The brunch buffet is loaded with local favorites. Th","useful":0,"cool":0},"eTCSu-choJA-ofWhKFcAmQ":{"text":"Jazz brunch buffet = ewwwwwwwa. Not good. Not any of it. Where do I start? $30 per person ","useful":1,"cool":0},"0ddixTW7GpI2d0z0wJxd3g":{"text":"To be fair, I didn't even get to eat. The staff treated us like unwanted guests. We went t","useful":0,"cool":0},"NKHi0DvI19xElr_wyoUEYQ":{"text":"Food is good classic New Orleanian staples. Place is dirty. Servers give a lot of attitude","useful":0,"cool":0},"Bj6y6B5i9pn_Yz1JOoVhwQ":{"text":"Nice atmosphere for brunch or lunch. Food is a little overrated but it's still worth going","useful":0,"cool":0},"bWHEOmUbvznUOzDyyoWTnw":{"text":"Went for brunch as so many had recommended and was disappointed.  The ambiance and service","useful":0,"cool":0},"Ad_zx1Xe7JUpTGnDfJ73_Q":{"text":"This was my first trip to New Orleans and I was incredibly excited to have breakfast/brunc","useful":0,"cool":0},"MQQdJDw88yOiOMFU5O83yw":{"text":"We stopped here for dinner after a carriage tour near Jackson Square. What a great setting","useful":0,"cool":0},"-CpfhebubeidQkVJX4Lvfw":{"text":"This was a lovely setting -- outside patio, with soft live jazz.  We didn't have reservati","useful":1,"cool":1},"5eRcwMy8VgirpHLuY4wKSw":{"text":"The wait staff here is hilarious. They do their best to make your dining experience memora","useful":0,"cool":0},"Wr8zjoG94ws78rSkisiaCg":{"text":"Amazing! A great way to start a trip to NO and get a taste of everything you'll be eating ","useful":0,"cool":0},"auha0N2gItFJMT5eAMt9hQ":{"text":"We went at about 1:30 on a weekday afternoon.  We had reservations but didn't need them.\n\n","useful":1,"cool":0},"8W3uzyML-a7oqiuk7Tpelg":{"text":"This is basically a Las Vegas buffet on steroids. It is located in what would have been a ","useful":0,"cool":1},"mJyVycpISBB-4IgFn5C62w":{"text":"Not impressed. Their crawfish and shrimp with pasta was like a glob of bad mac and cheese.","useful":0,"cool":0},"M7arf-KANY1_699qDqVolQ":{"text":"Had dinner there with a big party.  The service was very good.  The ambience was great - a","useful":0,"cool":0},"rjRGyV1NsF0Hkfdi3E_v7Q":{"text":"We went to this restaurant for brunch in February. Hearing the hype, we were so excited bu","useful":0,"cool":0},"vmqKkIUMI0QG0x_YL0czYA":{"text":"The food was fairly good for a buffet, had a lot of options, and good taste as well. The g","useful":0,"cool":0},"dZBWATL-B-G25RLFUfXalw":{"text":"The \"hostess\" outside that walks you in asking for tips has to be one of the tackiest thin","useful":0,"cool":0},"WPDfkCdAco1PgpxF1zr3Aw":{"text":"This place is a jewel of the French Quarter. Its obscure, almost hidden entrance belies it","useful":2,"cool":2},"WI_Ir-INuh8PHnVe9d3VRQ":{"text":"This place has a lot of history, unfortunately that does not transcend into good food. But","useful":4,"cool":1},"5KpmCx75QtIMmuhisH39xQ":{"text":"The main reason to go is the ambience and history. The food is quite good too. If you are ","useful":0,"cool":0},"OkKkmc_SXY8DtIbNHLoWCA":{"text":"We very much enjoyed our Jazz brunch experience.  Arrived at 1030, before the rush and sat","useful":0,"cool":0},"4s9hgyIZ9adeHO_h0Zhk3w":{"text":"My husband and I were in town for the French Quarter Festival and wanted a nice, courtyard","useful":1,"cool":0},"zFdLGxx9mwueASXwmjV7hQ":{"text":"I'm not a big lover of buffets. I don't like standing in line to eat and often buffet food","useful":1,"cool":0},"o_qsJWQxJ2-qzQLaFmHY6g":{"text":"We were in NOLA this past weekend for a wedding. The jazz brunch was the last of the plann","useful":0,"cool":0},"AOG8EjZNcVVVUkP_4rIvWA":{"text":"Cool looking place, good food, but its a stuff yourself until you cant eat anymore kind of","useful":0,"cool":0},"ZYvwKePzqfYhNoWzaIPbAw":{"text":"The courtyard is beautiful but is overly crowded with the tables too close together and pe","useful":0,"cool":0},"I801NIVQ-VBSzlzBBQrzmg":{"text":"Expensive jazz brunch, but unique food and ambience.  Didn't have any bar drinks...were wi","useful":0,"cool":0},"JeK9Tn8bElYHrjIvE_2Rng":{"text":"This place is all it is cracked up to be and anyone who writes differenly is just being pi","useful":0,"cool":0},"SdUBQPbNZBbZbrzz6BirUg":{"text":"Wonderful brunch and listening to live jazz in the courtyard completes the experience","useful":0,"cool":0},"cXH1vE5wXHSVZB1pNrvzLw":{"text":"Unfortunately, we went on the last day of vacation after spending $100s at different resta","useful":0,"cool":0},"sZDN6EohrSjFIdK7lHw84w":{"text":"The Court of Two Sisters jazz brunch was delicious. The waiter was very friendly and helpf","useful":0,"cool":0},"wrp8QyiZMquI5LUmcSQLiw":{"text":"Unique courtyard setting.  The little trio or quartet they have playing is nice.  There is","useful":0,"cool":0},"VgPN8UINYD-0NkS3BfT4BA":{"text":"The best brunch that I have ever had.  Food was incredible. With so many choices, there is","useful":0,"cool":0},"bi6BwJ5oQ2YkhGWz4CyC7Q":{"text":"Excellent ambience, historic and down home menu and wonderful charismatic service. An abso","useful":0,"cool":0},"qOn37atdkamvvo9W02qHtA":{"text":"We were there for a Sunday jazz brunch and it was just the right amount of New Orleans fun","useful":0,"cool":0},"2uiLmoavzFrmyR4oeB3TzA":{"text":"The Court of the Two Sister is the start of the Krewe of Cork. This is one of the unique M","useful":1,"cool":1},"QlaeFqxa2NkLnKo-XE-vFg":{"text":"My wife and I had heard great things about this place and we decided to walk in for brunch","useful":1,"cool":1},"kIYpfA_GbxZ_UcbOrP1m-g":{"text":"The jazz brunch here is lovely. The courtyard is so refreshing. The food here is ok. Not g","useful":0,"cool":0},"vjTbscjer0BXrfctWjarIg":{"text":"Came here for the Breakfast buffet and it was very nice... I'm not huge on buffets, but th","useful":0,"cool":0},"Bk0zfLMszu5lsMDPNmI5Uw":{"text":"It was our first food stop in new orleans. Great price for your buck. We got 2 free vouche","useful":0,"cool":0},"wlyLuCzlGK9n63WpZESnfQ":{"text":"Okay, this might be a misplaced review.  When in NO, we actually ate at the two sister's t","useful":0,"cool":1},"H2GIqBsaAUg4zcPKcbI0Ng":{"text":"I made a reservation online via their webpage.  I requested we sit near the jazz players.\n","useful":6,"cool":0},"XLO3NwtR_564O9Ede2ns8A":{"text":"Complete and total tourist trap. With that said, we have been trapped twice. The salads ar","useful":0,"cool":0},"8RGR6ewhfqgfeZxKyrBDtQ":{"text":"This place is magical! I can't say enough compliments for their beautiful courtyard, brigh","useful":0,"cool":0},"Q_dYZNhtGLhMuh-TaOfRew":{"text":"Stop by for the Jazz Brunch. Good music, an extensive breakfast buffet. Our waiter was ver","useful":0,"cool":0},"kfdV8rec1XtJKs5dCxI_sA":{"text":"Shrimp etouffee is DELICIOUS. Also delicious were the grits and grillades, catfish roulade","useful":0,"cool":0},"prlNeYIq9_ILQd6H2PxLgw":{"text":"Great Jazz Brunch in the courtyard!  They accommodated our party of 20, and we had great s","useful":0,"cool":0},"1PB2ZrS6mJ25O46jEM8iyg":{"text":"Awful food. Boudin was old and reheated. Jambalaya was old and dried out. The chicken and ","useful":1,"cool":0},"qsq62N8v_wDuLTu10sJc8w":{"text":"I was very disappointed! My appetizer was very undercooked, the trout was so dry and overc","useful":0,"cool":0},"M9zcOp2sS03p55Swxych-A":{"text":"This is not brunch in the way I think of brunch. The jazz music was great, the courtyard w","useful":0,"cool":0},"JvSp3fkZO0Fo7A7464Yduw":{"text":"This place was a highlight of our trip. We came late and the staff was nice enough to let ","useful":0,"cool":0},"0OPjSyGdKf6tQk1ILGGBFg":{"text":"Decent food but the place is crawling with RATS!!! My wife and I saw 2 of them. We told th","useful":1,"cool":0},"OtTwO8p3tM14upYNyCk9tw":{"text":"First visit for Sunday brunch. Amazing selection of food and homemade ice cream to top it ","useful":0,"cool":0},"7B9v5WBQs8q_0BmAgOFgzw":{"text":"A large rat ran across the floor as we exited the restaurant. If I could leave negative st","useful":1,"cool":0},"FXAB6pfBDOIGa2n3XiBBYQ":{"text":"Went here for breakfast with a large group on a Sunday. Luckily we had a reservation. But ","useful":0,"cool":0},"8WzvNyC3VeEYGMcZ_Z-4bw":{"text":"I had visited Two Sisters about 20 years ago and suggested we go there on our recent visit","useful":0,"cool":0},"8R1mWINHOXCjKBvK1OmAug":{"text":"This is the best jazz brunch buffet I have ever visited. There is a wide range of food, ev","useful":0,"cool":0},"CLS-aB7Cau4Kq7JS3ucfmw":{"text":"Courtyard was lovely, service slow, food overpriced for the quality. The trout was overcoo","useful":0,"cool":0},"c9zZznFCKs1zIi4EZvJOuw":{"text":"What a lovely brunch. We called and made a reservation for 12 people.  We were very please","useful":0,"cool":0},"4GBQazS_V8VFuOkiaH9gfg":{"text":"Tourist trap.  Service and atmosphere were nice. Food quality was poor and way over priced","useful":1,"cool":0},"WK5RZPGxp1VRdN886zGb9w":{"text":"Being a historical place like The Court of Two Sisters has its benefits.  Its so easy to b","useful":1,"cool":1},"qPjDwRS4VWB1Jk43mpJYqQ":{"text":"Disappointing at best. Food was mediocre and the table we had was next to a planter so the","useful":0,"cool":0},"foyJgVDJagxgVBFUCqNdSA":{"text":"Ick. Mass-produced, bland food in a gorgeous outdoor courtyard. I had the veal which was D","useful":1,"cool":0},"55Tdhdlo9urbMjmKiLVSsQ":{"text":"Yum Yum Yum\n\nWe found the 4 star cajun we were looking for\n\nI had the turtle soup, catfish","useful":0,"cool":0},"aH0eUSRNmk7XA9U2hwHZxw":{"text":"Dear Friends of Court of Two Sisters, \n\nI wanted to thank you from the bottom of my heart ","useful":0,"cool":0},"-kWy90IS1uhDdleRtpd50g":{"text":"My friend and I came here for brunch and bought a Viator deal for brunch here. Wouldn't re","useful":0,"cool":0},"sUOTuONa9dUNILT9MJnBMg":{"text":"Sitting outside near the fountain listening to great acoustic jazz.\n\nI have been here twic","useful":0,"cool":0},"rjkAc6RSnInVqG01Yy13Lg":{"text":"I had a wonderful experience here and on one of the hottest days in July with the humidity","useful":0,"cool":1},"USVewuiccRXP4J0wOBkezw":{"text":"(WARNING THIS IS LONG, BUT WORTH THE READ) \n\nWhere do I begin??? This is my second trip to","useful":4,"cool":0},"SWHCWyewxGovhpsdUv4IfQ":{"text":"I came here with three friends, and we all tried the $42 four course dinner menu, but I wa","useful":2,"cool":0},"BEFjp-5STAV3UU92GvuqSw":{"text":"What can I say. We went for Mother's Day Brunch! Their menu is deceiving. We got our $30 w","useful":0,"cool":0},"AuURFC7rtIwFaNKGDUG-jg":{"text":"Had brunch here on a Saturday afternoon and it was just lovely. Had mimosas and every time","useful":0,"cool":0},"sXQFP2V_ejRMu2oZfRh5oA":{"text":"We went there on the Thanksgiving day. We called the day before and twice the morning of T","useful":0,"cool":0},"RzTEU8i7omjYKT9m94_rcA":{"text":"Thirty bucks for eight dollars worth of food.  Very disappointing.  I've never left a buff","useful":2,"cool":0},"JQIXVM66-bSmVt53WSm5jA":{"text":"Absolutely loved having brunch here! We were seated fairly quick and our waiter was amazin","useful":0,"cool":0},"upOhzqj3JIN4-57L9V7JGQ":{"text":"Still as great place to hit when in NOLA.  People are changing but thats everywhere  you g","useful":0,"cool":0},"n2LUHjZtSylJHx0TkQbvsg":{"text":"I came to the Court of Two Sisters 4 birthday brunch. I've heard from lots of different pe","useful":1,"cool":1},"QQm4E6JsaTJzgg6xNlzVyQ":{"text":"We reserved a table for 4, 8pm on a Saturday. My son (a Swiss Chef) had very high expectat","useful":1,"cool":0},"R-ph3ENR-35kkzGO7b6Xnw":{"text":"We left hungry. The ham, duck and ribeye were all very dry. The eggs were burnt with black","useful":0,"cool":0},"8uN2Oh1U3YEpgLbtWCPgig":{"text":"I always try to go here for their brunch buffet.  This is one of my favorite buffets overa","useful":0,"cool":0},"Ow0K6baeywIBrUcLdeH5pg":{"text":"Fun visit to this historical gem!  We enjoyed gin fizzes with an entertaining bartender wh","useful":0,"cool":0},"ThwW_OasWuWWT6ORqPggvQ":{"text":"This is one of my favorite places for a buffet breakfast.  I have been fortunate enough to","useful":2,"cool":1},"YiDjynkoJ5U9-vJHK_qzyg":{"text":"The staff was very attentive and friendly. The atmosphere is great; we sat outside in the ","useful":0,"cool":0},"F57OCrdaVYat1qzqChR3rA":{"text":"Service was wonderful. Atmosphere was great. But my Chicken Oscar was dry. Potatoes were g","useful":0,"cool":0},"3TH-YY2Uxt2alg4T1pK6OA":{"text":"This is definitely a place you need a reservation, not even because if it being fancy or a","useful":0,"cool":0},"Vc4tt7Fny2p-UxNVIf83_w":{"text":"We didn't eat at the court of three sisters but went to the bar around the corner that's o","useful":0,"cool":0},"JeFkqiMRPcQvzXReaEaD8A":{"text":"Very good food! Try the Trout Almondine! Amazing! Cesar salad is made by scratch, right in","useful":1,"cool":0},"VTlvYmXMtq7S7Up96aI-mg":{"text":"All around excellent restaurant. Back courtyard is stunning and the food is exceptional. Y","useful":0,"cool":0},"vHIEVsR32dHACFi3VQVEqg":{"text":"This restaurant was the best experience I could've imagined, getting there i had no idea i","useful":0,"cool":0},"82agqtPSxIhNmpJa86d_vA":{"text":"very nice southern charm patio with live jazz so nice . everything up to snuff . would go ","useful":1,"cool":0},"YodpFg2_NVOfS7fjDmvmSg":{"text":"Five of us dined here on a recent Saturday night and it was a bit disappointing. Two of us","useful":0,"cool":0},"3EERVfXURMYOVOFr6xHVpw":{"text":"Sisters hasn't been good since the owner killed his wife back in '52. It's been living off","useful":1,"cool":1},"IcqP26xvhGE_1EZ0WpKLPA":{"text":"The food was not worth the price. Seasoning was bland. Service was good, but I won't be ba","useful":0,"cool":0},"AzWxhZgG6q11e-nMzh8ydg":{"text":"A very good place to eat in New Orleans. I certainly have a better appreciation for Caesar","useful":0,"cool":0},"GIi7gP9MHO2SnfK6X9w-5A":{"text":"A recent visit to New Orleans happened to coincide with their Coolinary event, similar to ","useful":0,"cool":0},"jmfP2zqdVJTqUW7ZPn5Tfw":{"text":"The best thing at the buffet was the pineapple, and service was poor.\n\nFor example, waiter","useful":3,"cool":0},"s8wWmDAgKcWm4KOmTxC8Qg":{"text":"The courtyard where you sit is elegant and classic New Orleans. The much-advertised jazz b","useful":2,"cool":1},"ZEU6710IZQsgfztMlwnoIA":{"text":"Exquisite courtyard..delightful staff! I came here on a recent trip to New Orleans and sat","useful":1,"cool":1},"HNIfFslTgj_nh9TAqntCUA":{"text":"Just Ok.  Typical buffet / brunch food.  Been sitting out awhile.  Banana 's foster is gre","useful":0,"cool":0},"l_QTaEa2fkzHNvXS2ZXIEA":{"text":"A New Orleans classic. Linda at the bar makes an excellent Irish coffer with a warm welcom","useful":0,"cool":0},"7e6PGuryrjSTLH4cW8s1-w":{"text":"I felt this place to be over rated. NOT gluten free friendly. \n\nService was kind but not a","useful":0,"cool":0},"jmRBPQbyKj4pDUBm_Z4yJA":{"text":"Absolutely amazing sunday brunch. Must make reservations to sit in the courtyard but is ab","useful":0,"cool":0},"c2fsH4Zmg4XnMtfm6hZYpQ":{"text":"Great restaurant in New Orleans, and certainly one of the oldest. We came in for the break","useful":0,"cool":0},"JItgR6gxr6KxR9bExJlOIw":{"text":"Unimpressed. Service was great and the courtyard would've nice in ideal weather, but the J","useful":0,"cool":0},"vqGlaysU2XkihnErW760Gg":{"text":"I LOVED this place!  We stopped in for dinner our last night of vacation and just had the ","useful":0,"cool":0},"2jIUrSWv9vJGW8Hod5a24w":{"text":"Waste of money. I'm not in to super negative reviews, but the jambalaya tasted like it was","useful":1,"cool":0},"clGfeDNHIa2Ewtq8V5zq7A":{"text":"I'm really struggling not to give this place 5 stars. I was able to visit 3 times in 4 day","useful":1,"cool":0},"kRmzKDctbF7aG6e03NN-TQ":{"text":"Wonderful breakfast jazz buffet. Lots of choices for those do like to try Cajun and enough","useful":1,"cool":0},"RAdxUwYfDkkL6bQ_R_j9jQ":{"text":"Love the outdoor seating, great ambience, and the service are at full attention. \nThey hav","useful":0,"cool":0},"fr6txnEySfA1GF8kuow2bQ":{"text":"I feel like I'm being very generous giving them 2 stars. We went on Valentine's Day 2015 f","useful":0,"cool":0},"2YyHtdrY44ZpTFuIx9Ggiw":{"text":"A group of 22 people.  Mardi Gras sunday jazz brunch.  The buffet has anything and everyth","useful":0,"cool":0},"yuaNUGXABddECV7EigLLzg":{"text":"Laymon our server was Awesomesauce!! My kids got the butter pasta wirh parmasian.  They ha","useful":0,"cool":0},"E0TX2iHRiSDbSpTwL0XMlw":{"text":"This is a must for a great drinking experience.  I only had drinks and dessert here, but, ","useful":1,"cool":2},"-ooS9HfSUwTlfIVFKzLMMg":{"text":"This place is amazing..every food you would hope to try on a trip to new orleans is includ","useful":0,"cool":0},"mAbRL6GBQLRn9N0XjDTkIg":{"text":"I can see why this place is a \"must-do\" in NOLA. We went for the Sunday Jazz brunch.\n\nDamo","useful":1,"cool":0},"FYUVo0Fh4aDFqgjrn_eQBQ":{"text":"This was one of the worst examples of service I have ever experienced. Had to wait 40 min ","useful":0,"cool":0},"lWpU5RvTLKid5V2iJSjiXA":{"text":"My daughter and I ate there last night. The waitress and her suggestions were wonderful. W","useful":0,"cool":0},"P6U4k5MDeXFJACXRYGB1Bw":{"text":"All you can eat buffet, which is great but the food itself was incredible.  I can personal","useful":1,"cool":1},"aMDw1SaXDKvnB9lwEUJA5w":{"text":"We were at their brunch several years ago and enjoyed it but found this visit severely lac","useful":0,"cool":0},"mTNzHtedYCdzSEjVBNlrRA":{"text":"I was very excited to try this buffet brunch while visiting New Orleans.  I saved this pla","useful":1,"cool":0},"39RU0gMb2ZxZPE6sMECqSA":{"text":"Excellent pork chops with mac and cheese, mustard greens. Service good, price kinda steep ","useful":0,"cool":0},"Bgk6L2RJ7uljQC-0i0bzYw":{"text":"Beautiful outdoor open-air courtyard that would be lovely day or night; at night they have","useful":0,"cool":0},"m50VCaPDKwSpalvAshu_ng":{"text":"A was a little disappointed.  I could have taken my family anywhere for New Years Eve and ","useful":1,"cool":1},"1euUJBEdPeDzLRCQRBC96g":{"text":"A very elegant beautiful restaurant. Waiters are helpful and top notch. The food is except","useful":0,"cool":0},"oACwxQ_lzdMu9PPvz5DONg":{"text":"This is a must. Buffet style, great ambience, and a staple. Five days eating in the French","useful":0,"cool":0},"iNicBdnhYLfqsD9DyCkqKQ":{"text":"I had the buffet lunch here this past summer in the restaurant's beautiful courtyard. The ","useful":0,"cool":0},"Eb_L7SysLY-oOhmy7A_X2w":{"text":"This place caters to tourists. It's crowded and the staff is ambivalent. The food is prett","useful":0,"cool":0},"bL3RmANYEcQLDMTnSCXZ4g":{"text":"We picked this place for brunch on the Tuesday right after the July 4 long weekend. this p","useful":1,"cool":0},"2zZfXZY0OAeVyLeslkhi_Q":{"text":"Awful, awful older woman hostess. We walked in for drinks and apps at the bar and she lite","useful":0,"cool":0},"GdrUZ7oiFY_1f3VkUIdJCw":{"text":"For everything that I'd heard about this place, I expected a lot more.  First the food: th","useful":1,"cool":0},"wl3vHHK_1pJlqQLK3ajOow":{"text":"This is one of those places I remembered from my childhood trip to New Orleans, and I am g","useful":0,"cool":1},"HL_pzzzgg5i9ETgTLrTPYQ":{"text":"Actually I went here 3-4 years ago and Cant wait to go again. My friends made me attend th","useful":0,"cool":0},"kcjL3gEak4IeyvZXlUA8bw":{"text":"Fantastic food with a history of quality\n\nOur group was fortunate enough to enjoy a delici","useful":1,"cool":0},"5tNNQb_oOGtlZW_c82n1xA":{"text":"We loved it!\nI read the not so favorable reviews and was a bit sceptic, but we decided to ","useful":0,"cool":0},"ENmh7bq9Li1-N7TFdin3JA":{"text":"Tip: try to reserve a table, especially if you're visiting like we were. \n\nI really loved ","useful":1,"cool":1},"aODSSNenBOEnt2-hlL7OCA":{"text":"We were in from out if town and were looking for a really good place to try bananas foster","useful":1,"cool":0},"zjsTAHivXITGXxR3VTn4pA":{"text":"Our first night in New Orleans we went to this magical restaurant with beautiful outdoor c","useful":0,"cool":0},"hu2k0F1Rg4tR257bglH9dA":{"text":"Loved this place! My husband and I came here for the morning jazz brunch. The food was inc","useful":1,"cool":0},"K0Ttdwb-h_ukxdG7iQXyHg":{"text":"Went for brunch Valentine's Day morning. Typically we have a smaller breakfast at one of o","useful":0,"cool":0},"DuAYTE2QRaxoxZj3XDExfQ":{"text":"My mom told me to try this place out over 10 years ago.  Every time I come to New Orleans ","useful":2,"cool":0},"AeZYWL8BDd_BiEl4V0nUgg":{"text":"Amazing food, service, and ambience. We got there 10 minutes before it opened to ensure we","useful":0,"cool":1},"ilRBEp7W9vxc3pH2UzutIg":{"text":"Went for the jazz brunch buffet. Food was good, atmosphere and service were excellent. We ","useful":0,"cool":0},"tQnTVmt3NXPKtyzUQ2Ws2w":{"text":"Meh is the best way to describe my experience here. There's something about buffets that j","useful":2,"cool":1},"X2iz8B7P4otQNnzUXWxSug":{"text":"This place is hands down one of my lifetime favorite meals. Turtle Soup! Bananas Foster ma","useful":1,"cool":0},"ThTJaYEBDxAxFid3WzOa_g":{"text":"When we were recommended this restaurant, we did not know what to expect. We went for the ","useful":0,"cool":0},"W01TqmtVrnOsCjY0OxKIXg":{"text":"Stopped in for a quick meal on a Sunday night on the way to do a walking tour. I think may","useful":1,"cool":0},"FvxPUdNg5RaziR7L0AcFkw":{"text":"Good brunch. The pancake guy was on point. I probably should have been more diverse with m","useful":0,"cool":0},"cg-_oQ-O0imllQwMURxuKQ":{"text":"First off, this is an I can't put 0 stars type of review. I could care less about the dirt","useful":1,"cool":0},"HF3NBTCsLuLLCLQPiIJbfg":{"text":"Great service and selection of traditional New Orleans food. They have over 80 different b","useful":0,"cool":0},"LOXjawptTXqhuNL1bPMFpg":{"text":"Perfect brunch spot. Great service, very friendly. Delicious food with great variety. The ","useful":0,"cool":0},"JXjdZCafbbQNyVuERQLJvQ":{"text":"The food and service was exceptional. Prices are in line with other comparable restaurants","useful":0,"cool":0},"fJuos6YLzRVJisZrwRm55Q":{"text":"It looked so elegant , so we reserved for the Jazz Buffet on a weekday noon. Everything on","useful":0,"cool":0},"-ZK0O0YOB1DNvxj5mxNARA":{"text":"We booked a Saturday jazz brunch, which is something everyone recommends you do in New Orl","useful":1,"cool":0},"rP1OqJ4qrfGo-RohWlDT6Q":{"text":"Under going renovations. Wanted to go here for dinner but it appears that they are under r","useful":0,"cool":0},"88yY31omxJWNz36tJK4ubQ":{"text":"There was clearly not a chef in the kitchen.   4 entrees. Each bad.   Crab cakes:  the cra","useful":0,"cool":0},"l5ElfJyERcqDdQGUmoBk8Q":{"text":"HORRIBLE FUCKING PLACE. We were seated in a cafeteria environment in the very back like se","useful":0,"cool":0},"ayzkcCKx0d3TG0DRVn7j1A":{"text":"This place was amazing for brunch- truly a new orleans french quarter brunch experience.  ","useful":1,"cool":1},"hSX9KVFdM95S4AprDRs5gg":{"text":"Disappointing with a Capital D!  Sadly, all too often this is a result of depending on tou","useful":0,"cool":0},"U8r13X9M5Rbjs3FEJOjsCg":{"text":"In 2013 the wife and I took our anniversary trip to New Orleans. We saw this restaurant on","useful":0,"cool":0},"wLmoqdIQle3m22XpLEqrEg":{"text":"The wait service was not great, especially since all they had to do was refill drinks. I o","useful":0,"cool":0},"K7RSnmrooeVLhISuamFJMw":{"text":"This was the first stop on a guided cocktail tour, and thank god the other stops on the to","useful":1,"cool":1},"K0LByxUTsy2lgArRQYSfQw":{"text":"I've been eating here for 30 years. Unfortunately, it's no longer a treat. The food was me","useful":0,"cool":0},"IKpBB0GFeD66kkh7_bOPSA":{"text":"Amazing food. Eat here early in your trip, and often! The Jazz Buffett is worth every penn","useful":0,"cool":0},"1xfNyYSWhmV5SP5GjMrjlQ":{"text":"Took some friends here who were visiting from NY, as the courtyard is adorable, and its ju","useful":1,"cool":1},"gu5A_WzNxgEAFZbTdQDE2w":{"text":"My partner and I visited because we had heard multiple people talk about the venue. The sp","useful":0,"cool":0},"N7Wab64oyueSZWMebMcEuA":{"text":"I am a quick reviewer as see can see from my other reviews.\nThe food was fantastic. The wi","useful":0,"cool":1},"63ZC5w_XnHEsJo5l8TeUuA":{"text":"What a great place to have brunch! If you're looking for an authentic New Orleans flavor f","useful":0,"cool":0},"YkvsQe6Wza7G8S9CO0ZXMw":{"text":"Okay for $40 a person on Sunday the buffett was NOT EVEN worth it!!  After the wedding a d","useful":0,"cool":0},"LDSRS5L7_9RL7M76KzhDXQ":{"text":"The hostess (Neisha) with her b*tchy tone which threw me off wasn't really friendly when m","useful":0,"cool":0},"W0hIh19YN8JRqnVeaO96nw":{"text":"It really is a great brunch, no question. It has wonderful music, a great courtyard atmosp","useful":1,"cool":0},"xqG4fQd0ZE8jydpw70FVaA":{"text":"All about atmosphere, which is cool from the charm-spelled gates to the outdoor patio with","useful":0,"cool":0},"AVPOU_S1VlgPbFBhN9Tqxw":{"text":"The food was delicious but it wasn't worth the three hours of sweating to wait for it. In ","useful":0,"cool":0},"pXpgMeFVFqYwP1p_lYY02g":{"text":"This review is for brunch. Service was 4 stars. Ambience was 4 stars. Jazz was OK. Food wa","useful":0,"cool":0},"42Sluk3PdWga_G1BMaxjQw":{"text":"Here's a tip... don't go to the jazz brunch on your 1.5 hour conference lunch break and ho","useful":2,"cool":1},"zAti2HvnJgApEu4zlGdfXg":{"text":"This place has the absolute worst customer service. We made reservations for a courtyard t","useful":0,"cool":0},"2VVD89kj9TsR52uu61gMOg":{"text":"The Sunday jazz brunch buffet is DIVINE. As an out-of-towner, it was delightful to sample ","useful":0,"cool":0},"ZWvx4T1HS3VkfuRgqQsoyQ":{"text":"New Orleans classic! It's a historic restaurant with a beautiful courtyard and jazz bunch ","useful":0,"cool":0},"VTjn_yCTX3KoBC9qOZtBnQ":{"text":"Loved the outdoor patio & the grand dining hall, beautiful presentation claiming to offer ","useful":0,"cool":0},"w1jb0HOCa5aZnArVuoq5dg":{"text":"We are her for brunch during our 3 day getaway to NOLA. It is $30 per person for an all yo","useful":0,"cool":0},"QeDpYnW0EdvQoI-eIR2CXg":{"text":"The courtyard at night is completely charming. This was the primary reason we visited and ","useful":0,"cool":0},"3iOgB-u94HXVZ6VSApU08A":{"text":"We just let our server take us through the menu.  I'm pretty sure his name was Gary... he ","useful":0,"cool":2},"KdGaoGrG6-ETICqdUpk_SA":{"text":"This is a very pricey buffet, but the selection of delicious food and live music made it w","useful":0,"cool":0},"yxk59LBFiV6zN4bfaj6L-A":{"text":"All about the ambience here. Such a beautiful courtyard and great to listen to the live ja","useful":0,"cool":0},"PIgSOAacQbJHN7tMZOZkyg":{"text":"We visited the Court based on a friends recommendation and that they had gluten free optio","useful":0,"cool":0},"nQoGPZYIl78ttrWAImKT7w":{"text":"This brunch was extremely overrated, and expensive.  The food was very mediocre, and looke","useful":1,"cool":0},"aEZMxw7FZ8y2y9N5Z3aKIQ":{"text":"I happened to come upon this restaurant cause the original place we wanted to try out was ","useful":0,"cool":0},"x8AFEfnh_7tr83xgq21wFQ":{"text":"The food was delicious and our server was awesome. So why two stars? Even though the resta","useful":1,"cool":0},"J9a_KnxJs9MQbrg67nz_Pg":{"text":"I'm just remembering my trip to New Orleans a few years ago and it was highlighted by this","useful":0,"cool":0},"FMOWYtQrV9wqa_FYxxKjYQ":{"text":"Get here early for their lunch buffet, waiting line out the door sets quickly. The live mu","useful":0,"cool":0},"lEZ50GGnJdPxlXvmcTUlYQ":{"text":"Great service and jazz for brunch. Buffet is good but not great which is why it's not a fi","useful":0,"cool":0},"lTqOmkN38uQ9c-2v3ur6vw":{"text":"If you're not into buffets you may want to steer away...there were no sneeze guards, food ","useful":0,"cool":0},"dH8p3-V2CQ0qIvojKv0_dg":{"text":"Absolutely amazing meal. Wen during a season as crowded as Mardi gras we were able to snea","useful":0,"cool":0},"9Cql7Qed_xJwkokvRtqe6w":{"text":"Turtle soup and a brunch buffet you can't beat! \n\nEat in the courtyard and listen to a 4 p","useful":0,"cool":0},"ibTrnxR8vDLWB1Ujj5Tj-g":{"text":"Wonderful experience! Very New Orleans. Rich in history & great food! Our waiter Charles w","useful":2,"cool":1},"AgBq2nS_IuFyVwXzEo4isQ":{"text":"Beautiful beautiful place. The service was absolutely tops. Had the fried oyster dinner.  ","useful":0,"cool":0},"BqOPa-g2wvk5YnYctqTpiQ":{"text":"Really disappointed by this pricey Sunday brunch which basically was cafeteria food. Eggs ","useful":0,"cool":0},"X3pHzio_4zxAOCDxI0Pnwg":{"text":"Food - bland. The cajun food lacked spice and had no heat at all. While the bloody marys (","useful":0,"cool":0},"V-_RZfDS0vWGL4raU8kEDg":{"text":"Loveliest brunch spot in the French Quarter, if not the whole city. The jazz is great, the","useful":0,"cool":1},"kzfrDh1No5zNo1VBcHykCw":{"text":"Such a relaxing experience. Hidden in a courtyard away from the hustle and bustle of the F","useful":1,"cool":0},"TM8e4TsA-eivK3BrvFuIcQ":{"text":"Great brunch with some live music. Price was a bit steep but a nice service and ambiance.","useful":0,"cool":0},"NU4oiONmdYTdSDGbsQH5cw":{"text":"Don't miss Court if you go to NOLA--it is so unique and very classy, located in a historic","useful":0,"cool":0},"NNn62BX5V5aEUafyBbhW4Q":{"text":"Great Brunch buffet with tons of items to choose from. Right in the heart of the French Qu","useful":0,"cool":0},"S6FSvhPkt0j4_kMnwE4ygw":{"text":"My family took me here for my Birthday. The service was excellent! Our waiter was very pol","useful":0,"cool":0},"y4s-LPafs6CEceZ9aIUPwA":{"text":"We went for the Jazz Brunch on Sunday. When I made my reservation, the only time available","useful":1,"cool":0},"h3fctgYm2sf6rpKoc7qWMQ":{"text":"Nope! This brunch is highly overrated! For $30 you get a buffet of bland lukewarm food, bu","useful":2,"cool":0},"9NJ_2jImWnM5dVSqqzfzrA":{"text":"My wife and I tried the jazz brunch on our last day in New Orleans and it was a good decis","useful":2,"cool":2},"auI6B_H8WwgU6orB8321ug":{"text":"went to brunch there.\n\nfood- good\nambience- amazing\nnew orleans vibe- thats a given\n\nprice","useful":0,"cool":0},"8Ccf6G64JYFceOC9DsqSeQ":{"text":"Tried this place for Sunday Brunch, great ambiance with the jazz music.  I was surprised t","useful":1,"cool":0},"6X0cXci8apewXN4kN0WWiQ":{"text":"Sunday Jazz Brunch was great. $29 for the Brunch Buffet. It had everything you would want ","useful":1,"cool":0},"t9eyBcZwI3_6DgR24ZuMMQ":{"text":"Love this place! EVERYTIME I visit New Orleans I must eat their jazzy brunch! The food is ","useful":0,"cool":0},"1f2tx05TeuSS4a3TeMmwVg":{"text":"Dead turtles adrift in brandy and a fish with a curious name.\nSteamy ambience, literally. ","useful":0,"cool":0},"LndRY6HoG1ll6NkYWJQR6w":{"text":"I haven't been here for quite sometime but this place is  so charming.\n\nI am a huge fan Cr","useful":1,"cool":1},"RFxs6Zre6H_iJ-7IWzSwiQ":{"text":"We highly recommend this restaurant, the service was great thank you Mr. Patrick. The food","useful":0,"cool":0},"djO_ORcfOZhF3aVBCiuj8w":{"text":"Loooved this place!! \n\nThe Court of Two Sisters was recommended to us by multiple friends.","useful":0,"cool":0},"7xf8af-XhLuPbPNKEdNLiw":{"text":"We were seated promptly in the beautiful garden area of the restaurant. It is truly a beau","useful":0,"cool":0},"HOMUf9YFmGzTFoWiNbCu5A":{"text":"I simply loved it but just couldn't eat. Idk why but I wanna go back to NOLA just for the ","useful":0,"cool":0},"D6WuywYlPcNP4-eDsb7bAQ":{"text":"Beautiful day on the patio. 70 degrees and almost December. Counting blessings. #cheers","useful":0,"cool":0},"SwtczwBenD_rUK-0CcuRJg":{"text":"Ok so my sister told me about this place, and I had to see if it lived up to the hype. It ","useful":0,"cool":0},"cTjwT_OLDDe7swj4cC0U8w":{"text":"The jazz brunch leaves so much to be desired. It was so expensive for such a disappointing","useful":1,"cool":0},"9X4ojZgEoJ6uHk61QtpdlQ":{"text":"My family has come here for years. Great food and excellent service. The best escargot I h","useful":0,"cool":0},"OSifCIoXrB5OBS0y4n8mWg":{"text":"Great brunch and atmosphere. The food was great and they had lots of options. Jazz music w","useful":0,"cool":0},"UEByN608z_qy7mEJa5wkdQ":{"text":"We went for lunch with a bunch of people. The staff was slow but accommodating. We had to ","useful":1,"cool":0},"LHN6kW5_QihB9kqTF54JKw":{"text":"I had a Saturday brunch with my friends and couldnt have gone to a better restaurant. The ","useful":0,"cool":0},"wIVaTfarppbHiE3vH00DXQ":{"text":"We went there for Easter Brunch.  Nice outdoor patio and jazz trio but service was just av","useful":1,"cool":0},"V3eR66cnf4LLYeZp0DH3vA":{"text":"Too expensive for what it is. It's a buffet. The food was good and the service was alright","useful":0,"cool":0},"Ckh11auY8hqiY_H8SRUseg":{"text":"I went here with co-workers after a full day at the ASCA convention. The place has a nice ","useful":0,"cool":0},"uNoxq00RpAI_yFybZTaDWA":{"text":"ZOMG THE BEST BRUNCH EVER!!!! The sheer amount of stuff is somewhat overwhelming at first ","useful":0,"cool":0},"xKhp7LwwUBk1ENF0QwUokg":{"text":"The courtyard is cute.\r\nI like the fans they pass out.\r\nThey serve a mint julep here that ","useful":4,"cool":2},"z5piN2FnYC1JwE8bl-JCRQ":{"text":"The best brunch I had here, the last meal here we had in NOLA. The court yard was very bea","useful":0,"cool":0},"cKkARTVaMJrM1JAdUK9grA":{"text":"Not a place I'd eat at often, but definitely a place worth checking out if you're in town ","useful":2,"cool":0},"NAdjF6BwZIWngLIxYVNPDg":{"text":"It's a pity people get caught up in a name. \n\nThe atmosphere in the court yard is very nic","useful":0,"cool":0},"7MC_uNjEBSfslrBxpvpJSg":{"text":"One of the best Brunch buffet I've ever been to, I had already eaten twice that day, but s","useful":0,"cool":0},"dgVSwJ5bNCwroIkq8DS9zg":{"text":"We had the Sunday brunch buffet, and sat in the outdoor patio, which is really cute.  Ther","useful":1,"cool":0},"iAiRvg0ipGyAtRMbw0F1tg":{"text":"If you are looking for a European brunch experience, THIS ISN'T THE PLACE! The food is hor","useful":0,"cool":0},"9Akm4MpE5N5RTAbiHKOPjQ":{"text":"Just not impressed, barbecue shrimp were bland, the blackened alligator filled a teaspoon ","useful":0,"cool":0},"9WCXiDFHHTBGsxqOUOJEYQ":{"text":"Waste of time and money. The best things I had were the mimosas and turtle soup ( which co","useful":1,"cool":0},"8YS769Sz4EyDmeud2NqQjQ":{"text":"Went for brunch. Very overpriced! $45 a person for food that has been sitting in a buffet ","useful":0,"cool":0},"V421GJO17RXSzPMHrG2cRQ":{"text":"I truly enjoyed my experience at court. The buffet was plentiful and fresh. The omelettes ","useful":3,"cool":2},"hRl4QVAmljm8ttQek023Lw":{"text":"Saw this on Yelp as a great place to try. I wanted to impress my parents as this is their ","useful":2,"cool":0},"PcBp7Nca3Bmu76VcvvGOuQ":{"text":"An absolutely delightful experience! My partner's mother had eaten there a couple of decad","useful":0,"cool":0},"aNq3Q_AbcmjWmwTNwOwCCg":{"text":"Court of Two Sisters may be a name people recognize and associate with New Orleans. My par","useful":0,"cool":0},"nHi3Y_udPVcb4zO5HS4VSA":{"text":"The Court of Two Sisters (COTS) is somewhere we went because multiple people recommended i","useful":2,"cool":1},"HQXBM6zlDqBsTiOlmPavuQ":{"text":"The jazz brunch is a good way to end your trip or an excuse to gorge yourself silly.  Lots","useful":0,"cool":0},"nVjdn4DFErxplDQq7S1O5Q":{"text":"The Court of Two Sisters had its heyday a while back, but it's still kicking some good foo","useful":3,"cool":1},"H0Izh_6Klkd6ssTJrTs9ww":{"text":"The staff was courteous but untimely on restocking the table with bread. The atmosphere wa","useful":0,"cool":0},"jk8BvT_sgQy2WPFIS8xAAg":{"text":"Do it for the experience... but go when you're hungry. I read about this place in various ","useful":3,"cool":1},"pxdjctw6ZzdwNEjVOtfDPg":{"text":"We dined here ten years ago and wanted to bring my visitors to share our first time experi","useful":0,"cool":0},"lvurYjJoD5DXksuJm8jD6w":{"text":"I've heard this place is excellent, and was told to go here by several people before going","useful":1,"cool":0},"7ix_5Yaff4uNY0EEEL9hsA":{"text":"Took my two sisters [and all of our boyfriends] here for brunch - the Sunday, live Jazz br","useful":1,"cool":0},"c-94yUEcrsnYPwSnKTOJrg":{"text":"The courtyard is covered in wisteria. Just stunning. But it was raining and we did Sunday ","useful":0,"cool":0},"BVMcL3bFr4Ix0MUj4zBODw":{"text":"We went for the Jazz Brunch on a Saturday morning. I had larger expectations for this plac","useful":0,"cool":0},"3jehXwFs8TnrF_hXE2Sowg":{"text":"I went there for the Jazz brunch. It has a beautiful backyard seating, and it feels very n","useful":1,"cool":0},"cbRW3vbLcTl2wSLBM2NSKg":{"text":"Went for Sunday jazz brunch and given it's reasonable price I highly recommend it to touri","useful":2,"cool":0},"WZ7ieCp-G4dkaVw6d_MOlw":{"text":"I wish I had gone more than once. The crab, crawfish and shrimp penne pasta was SO good. T","useful":0,"cool":0},"xeMaUg-b8WsPZAgLg7S5LQ":{"text":"We had the Table D'Hote:\nMike had Turtle Soup, Dinner Salad, Veal Oscar & warm Pecan Pie a","useful":0,"cool":0},"OU5-GtTQgK7tKrgZ5XlHbg":{"text":"1. Awesome service.\n\n2. So so environment.\n\n3. Ok food.\n\n4. The dress is SUPER casual.","useful":0,"cool":0},"qEyi3odAt-45NGGRmWAcxQ":{"text":"I never go to a place with less than 4...sometimes 31/2...stars.  I know better than to no","useful":0,"cool":0},"Q0cxrV0YUg1Ox3RX8MSMnw":{"text":"I've always wanted to go to a Jazz Brunch in New Orleans.\n\nAfter doing a lot of research a","useful":0,"cool":1},"ZKG-WdeKfoEwMoT3-Cgyyg":{"text":"Today I had the wonderful opportunity to experience the Jazz Brunch with some friends. The","useful":2,"cool":1},"6mNhjhQi5191x5CZObb7BA":{"text":"Came this morning for the Court of Two Sisters Jazz Brunch. We were among the first ones h","useful":0,"cool":0},"vz_msQDxURDMm193DAAqQQ":{"text":"Overpriced brunch with food that didn't look appetizing at all. It was hot and very busy i","useful":0,"cool":0},"euM12MqfDdL_DOnj8qXUNQ":{"text":"We recently had a wonderful dinner in their courtyard. We had to change our reservation be","useful":0,"cool":0},"H7FKdYwv2GjNwPw6OAIbUA":{"text":"Amazing brunch. Great variety to choose from. Decor is really beautiful and loved that the","useful":1,"cool":0},"ELJMAdkqfxPpbTpfa-Mi0g":{"text":"Came here during the second week of December, we went at the perfect brunch time, 11 am. W","useful":0,"cool":0},"NAQ_WzH1BKs98OQ21py2mQ":{"text":"I would go here just to hear the jazz... the food was buffet style... food was okay, but h","useful":0,"cool":0},"v1NoJUpRjP7iFYBw6ooI6w":{"text":"I just left there.  They could not service me and my party because of a shift change.  The","useful":0,"cool":0},"sDxzb3z5E5PepavMmUNfKw":{"text":"The food was good for a buffet style brunch. The service was excellent. Eating on the cour","useful":0,"cool":0},"nEF97xrOQdm0U-E5Q0GOHQ":{"text":"My husband and I were turned away and told they were closed when it was more than an hour ","useful":0,"cool":0},"A5xN6ohNTJKem8WjUclO2A":{"text":"Great place to enjoy brunch with plenty of choices.  Beautiful courtyard to eat and enjoy ","useful":1,"cool":0},"RxMXCsMSC3ukxgdNYQq4jA":{"text":"My friend and I got the jazz brunch free as part of our hotel booking through bookit.com. ","useful":1,"cool":0},"zbef_hl4wwpjMLN7KoRKAA":{"text":"My husband and I visit Court of Two Sisters whenever we are in New Orleans, and it is alwa","useful":0,"cool":0},"j6Im_3rBXpIU5OekknPEcg":{"text":"We sat inside because it was too sunny and oh, the humidity. That's too bad because the ja","useful":0,"cool":0},"OuHz36eWiO2qFSazXKcU-Q":{"text":"Sunday brunch with my friend. Food was incredible. Eggs Benedict made to perfection. Even ","useful":0,"cool":0},"akabaZr4SQWMrBVsFRDPoA":{"text":"This is possibly the prettiest location for dinner in New Orleans. The courtyard is amazin","useful":0,"cool":0},"WryOOrpDFqaBxxZd81HgoQ":{"text":"We were there the other night and it was awesome.  Yes the Banana Foster is that great. Gr","useful":0,"cool":0},"k8R_myuiFXbUqDfLp3OaeA":{"text":"First went here on the Gray Line cocktail tour with Sandi. The drinks were good and the ba","useful":1,"cool":0},"8oSdQdu43tOg9KeuMBt8Ng":{"text":"We opted for dinner instead of the jazz brunch. Let me start with the positive,not kid fri","useful":2,"cool":0},"xcPdtoGZZtwYcX9FOuturQ":{"text":"Didn't head in, just got TO GO and it was great! Very strong and pretty reasonable prices.","useful":0,"cool":0},"sZtTb_Ct142v9B-SLOb2-w":{"text":"This was my first visit to New Orleans and we wanted to visit a restaurant that would give","useful":0,"cool":0},"SHMXHj6dvT4CtiCE81t4oA":{"text":"This is the worst meal I have ever eaten. The service was horrible as well.\nWe had to keep","useful":1,"cool":0},"aD0HB8TIfYjc0QkPRO2m0A":{"text":"Ahhhmazing! A must for Sunday brunch. A full buffet which includes coffee and tea for $32.","useful":0,"cool":0},"yx0UHcU0hQFzQsV0o9Vidw":{"text":"A lovely place for a Sunday morning brunch under romantic wisteria trees with thousands of","useful":1,"cool":0},"CLvqDd_vlBivmLYd6inogA":{"text":"The food was really delicious, but the service was only so-so.  I'm not sure about the att","useful":0,"cool":0},"RmAZmeq1op9nhkO4bwf28A":{"text":"The jazz trio were awesome, and I loved the easy-listening while eating the brunch.  I did","useful":3,"cool":1},"PrTQWO2Zwetrdo5nRQakFw":{"text":"Excellent food. Classic New Orleans vibe. Beautiful outdoor patio. BUT, too dang slow! Thr","useful":0,"cool":0},"wlYJEqF5OSzCOwehNLcnRQ":{"text":"My husband and I spent our honeymoon in New Orleans and it couldn't have been any better! ","useful":0,"cool":0},"j1iUkq4pg5RxvFboGBX3xA":{"text":"I made reservations for 4 of us the day before we went. Being that we went on a Saturday m","useful":3,"cool":1},"bsQMiN5UKZ9mtYtdyJWQMQ":{"text":"Court of two Sisters is a great brunch place.  The ambiance is wonderful and you almost fe","useful":0,"cool":0},"cQST7R-UlCporJu9daDCTw":{"text":"I had jazz brunch at the Court of 2 Sisters last Thursday with 3 friends. We all loved the","useful":0,"cool":0},"nu_dmazIqSjnNuegerK0VA":{"text":"We had this planned for our trip as a nicer meal rather than a super fancy dinner. It was ","useful":0,"cool":0},"L0fbDQtdRGNjKMTs0-zEqw":{"text":"This court yard will take your breath away, a kind of old-wold charm that could only be fo","useful":0,"cool":0},"Z3xlqyg-MXQPXa7x8q3ieA":{"text":"This restaurant came highly recommended. However we were very disappointed with the awful ","useful":0,"cool":0},"-3ABrGTQqXLUsy1yT0YAPw":{"text":"Three of us came here for a Jazz Brunch.\n\nThe food is really just an ok.  In fact, I think","useful":0,"cool":0},"Th0Y9ii2wWqt08a1BDfbfw":{"text":"Jazz Brunch is excellent. Definitely sit outside. Great service.","useful":0,"cool":0},"TF1ZIFsTr2d8nZa3i1N80w":{"text":"My husband and I had our destination wedding in New Orleans this New Year's Eve, and we at","useful":1,"cool":1},"2I6raZl5OXPFPW38Ydq5FA":{"text":"Awful. I would consider this a step down from a Luby's or any cafeteria. Plus it's $32.00 ","useful":1,"cool":0},"vjwG4yvp0HJtfGy_mAD2Ew":{"text":"I was here 1 time, for a birthday brunch for my mother.  It was a Sunday, champagne brunch","useful":1,"cool":2},"hl7jhzSjnImZ859J0oQmdw":{"text":"It's a place to go get a good brunch . Nice patio and good food better than armaunds ; ) w","useful":0,"cool":1},"TnEhlrJ_0Y2DZNyWJcogCw":{"text":"This place takes you back to another time, and is a must try if you're visiting NOLA. Beau","useful":2,"cool":3},"B44vmtp42Akxiic-qpmEUg":{"text":"The ambiance here out in the court yard was fantastic. Very old New Orleans feel and super","useful":0,"cool":0},"VJogqzFVeZEAXWD6TlZ7uw":{"text":"After 3 attempts we finally made it to a court of two sisters.  If they are having a slow ","useful":0,"cool":0},"1xA2XcKaDu_2zeilngAyvw":{"text":"Awesome atmosphere! The patio is beautiful...the service is great. The food was tasty...I ","useful":0,"cool":0},"BxoOi-WSBOOpXP3tzC43Ug":{"text":"Complete and total tourist trap at this point. With that said, we have been trapped twice ","useful":1,"cool":0},"oPmbYS2BDjkQXbEylV8_Nw":{"text":"This place was highly recommended by a friend.   I am currently writing this review as we ","useful":0,"cool":0},"MWB-nrj8WOUwW2StKOSigA":{"text":"I came here for a Sunday brunch.  For $30, I expected a lot more but over all it was a goo","useful":0,"cool":0},"1RWQYvKsMRvSdrCGXZ0k5Q":{"text":"Visited New Orleans in April and while walking around the quarter and bourbon street we st","useful":0,"cool":0},"MT8elmeHQmitY0utHccsZQ":{"text":"I have never ordered off the menu at CoTS, but have enjoyed the Jazz Buffet many times.\n\nC","useful":2,"cool":2},"8AZBO1QKNlz4AvZbyazlzg":{"text":"If I lived in NOLA, I'd be here often. My husband and I sat at the bar.  We were treated t","useful":0,"cool":0},"_Eyd8GzAqBgN2BSgZdXTFQ":{"text":"Beautiful courtyard with a fountain and other decorations. The courtyard is definitely the","useful":0,"cool":0},"csCCIqHutecDEHbHv2CMiQ":{"text":"If you are in New Orleans on a Sunday morning, the jazz brunch at the Court of Two Sisters","useful":0,"cool":0},"5dEh10zSqqHYPrfJXDFyCA":{"text":"We went here for brunch not sure what to expect and were so pleasantly surprised.  We were","useful":0,"cool":0},"xlFD_v1fBKwuP4jmVNq5Dw":{"text":"Birthday breakfast buffet for me. Great home cooked meal all around. Had my stomach been a","useful":1,"cool":1},"OPr2ib80NZ52NAyXk_W0wg":{"text":"Gorgeous garden, great food, and a nice touch of live jazz every day for brunch. \n\nThe sel","useful":0,"cool":0},"bFiEhUBjwv4VEzUsWO-VLQ":{"text":"LOVE LOVE LOVE the jazz brunch here! \n\nThe two ladies I was sitting next to on the plane r","useful":1,"cool":0},"aMdEWLxqrAQTH7TLL6_A0w":{"text":"THE MOST expensive breakfast I've ever eaten. 60 bucks each person.  I'm not much of a bre","useful":0,"cool":0},"pkSQF9cVjRFDlj5VmyFLzA":{"text":"Great eatery. Long lines but totally worth it. Parking sucks too. But the food is great!!!","useful":1,"cool":0},"cqu9YwITmd8ocRpT6u3jFA":{"text":"LoveLoveLoveeeeeeee.\nSo, Court was the beginning of my New Orleans birthday hooplah. Now, ","useful":0,"cool":0},"GWcJMYKuC9AGrrFVxHriaA":{"text":"Went for jazz brunch. Delicious as always! Ate in the courtyard which was gorgeous! Just w","useful":0,"cool":0},"zPF3HfUCss8WxgjklEVNxQ":{"text":"Vibe = 5 stars\nFood = 3 stars\nAveraging a 4.\n\nBook a reservation for brunch and sit in the","useful":1,"cool":0},"kqXhkz2TOv-Dn4lH3ZT_ZA":{"text":"Amongst the floating sounds of jazz, dripping trees, and warm breeze the brunch at The Cou","useful":0,"cool":0},"tz2XkRA9Y4dACj-LZgaAdg":{"text":"I attended the brunch on Sunday, 8/18/13, and really had a great time!  They had a jazz co","useful":0,"cool":0},"DK4iuMar0kgkjnmsbRn6kQ":{"text":"Not as great as it was hyped up to be.  Food was good.  The musicians were playing outdoor","useful":0,"cool":0},"m8EeBuW-XAWp_E21yJfW9g":{"text":"Excellent dishes, venue, and service. Our waiter was very knowledgeable and helpful. We we","useful":2,"cool":1},"EIQ_K_la8wk9S1t_ltGoyQ":{"text":"The buffet brunch food here sucked. The buffet had a super weird array of stuff - most of ","useful":1,"cool":1},"4-FH8XSsRGJ8BzMkWbNglw":{"text":"We came here to celebrate my moms 70th birthday. We made reservations way in advance and I","useful":0,"cool":0},"208EHVVLZ_HJ3G6GeMrfYA":{"text":"Went there for dinner early June. We sat in the court yard. The dinner was good and the wa","useful":0,"cool":0},"xFW3OZ0duvLRoj4iGcmJzQ":{"text":"I know that there is a ton of reviews on the brunch at The Court of Two Sisters, but this ","useful":1,"cool":0},"5PsOXxI9fdQrwhArlfx4cQ":{"text":"The service was great!!! The food was excellent!! We would go back in a heartbeat. Thank y","useful":0,"cool":0},"1r5xQTEzXRbPmKgqGMpE3A":{"text":"We came here for brunch on Thanksgiving Day. It was fantastic.  It's a mid-priced buffet, ","useful":0,"cool":0},"xjqiECr3Cz7jr7vG6PleRA":{"text":"I hate to do it! We came to NOLA to scout locations for our destination wedding \"welcome b","useful":0,"cool":0},"MtX-NMqTiu-ADikOwBBpfg":{"text":"We went for Saturday brunch.  Not sure if anyone can get their money's worth on a $30 buff","useful":0,"cool":0},"1gfMM-5iZP_LAa5SK-x_NQ":{"text":"This restaurant ruined my trip to New Orleans.  I was on a Bachelorette trip and we all we","useful":0,"cool":0},"_F5FBxun2_v-r_8sQSdusg":{"text":"Sunday brunch a must!\n\nWe stumbled onto this place and it was a beautiful and unexpected s","useful":1,"cool":1},"ZpBPyx21vhQulMc_TKAWCQ":{"text":"5 of us had Christmas eve brunch year.  This was the best brunch I have ever had. The serv","useful":0,"cool":0},"AITDnb13m7CbNBk2VbVSNg":{"text":"Stay away from this restaurant!  I purchased a voucher when I booked my recent trip to NOL","useful":4,"cool":1},"aGfoZ3mm-pLrN6I_7-0B-A":{"text":"Disappointing on so many levels was this visit. Major issue was service \n timing, and mino","useful":0,"cool":0},"ztT54wCc7th71cqrGe7Xbg":{"text":"8pm on a Wednesday night.  The restaurant was not busy.  Party of one and I'm told it is a","useful":1,"cool":0},"GAJxFPaoy1AY9BGULkZlXQ":{"text":"Came for brunch this am. Beautiful atmosphere and staff. However it was all buffet. Brunch","useful":0,"cool":0},"_5PLfxfNvQnsJv5yKa0pXg":{"text":"Best brunch place I've ever been. At 12 they change sige of the menu, so stay and try som ","useful":0,"cool":0},"U2Q0iuQXNCQmDQgnuuey6w":{"text":"Food was ok. Staff was lazy and service bad. If you're coming here; keep in mind you are p","useful":0,"cool":0},"_LsxiguWWxBXAQvavhu0ag":{"text":"I was in Nola and this was a clip joint! I get it -you primarily come for the ambiance and","useful":1,"cool":0},"YmphXkyARj9cchB_sgBLjA":{"text":"Ok, so I first went here when I had a fully comp'ed dinner that my boss gave me...... and ","useful":4,"cool":0},"Tre01YwghIiwR5PDMe0w3g":{"text":"The Court of Two Sisters jazz brunch was delicious. The waiter was very friendly and helpf","useful":0,"cool":0},"DMsWloTcxBbrV4B_d3ft4A":{"text":"3 stars mainly because of atmosphere. the first time i came here on a sunday around noon, ","useful":3,"cool":0},"dVu3n4Mifm-KBT_t6kPh-w":{"text":"This place has great atmosphere! It was raining so the courtyard was closed, but it was so","useful":0,"cool":0},"3cJonXPCaVN1kkGubzTABQ":{"text":"Disappointed in the food for the price\n\nWe stopped here one night, since we have heard pos","useful":1,"cool":1},"d63aGSQiu5nn0mVIy0ZkMg":{"text":"We made reservations to celebrate our 1 year wedding anniversary. We ended up being very d","useful":2,"cool":0},"KCNc1kN__baP2bl_cXTb6g":{"text":"Loved the patio ambiance during Jazz brunch and the gentleman at the omelet station was aw","useful":0,"cool":0},"pZc3metHJUP0ZWIpz-FkLA":{"text":"We went here for a company dinner on a Wednesday night - group of 7.  We arrived at 630 fo","useful":3,"cool":0},"sLV_0ZHG8SzFOYccWAvQEA":{"text":"This review is based solely on the Jazz brunch.  In general I'm not a fan of buffets. I lo","useful":1,"cool":0},"UTkVodLxsD6TyScyHDQHnQ":{"text":"We decided to come here for dinner for my friends. We made reservations ahead of time (rec","useful":0,"cool":0},"I3_IzRYqiaF4aiAJdoR6og":{"text":"For dinner - went two of the two nights we were in NOLA!\nThe shrimp & grits will change yo","useful":0,"cool":0},"X9uU1n5r0BPIMND7KGAfsQ":{"text":"This place came highly recommended from friends and family. The only reason I gave it 2 st","useful":0,"cool":0},"dAczjFksWIHSMh7ZHIThDg":{"text":"We stopped by this place for the jazz brunch. The food was good a huge selection on the br","useful":0,"cool":0},"QVOHbkIQoQqN0w9ah9-0GQ":{"text":"The Court of Two Sisters is one of the restaurants that I always visit when in New Orleans","useful":0,"cool":0},"o07hBdufn77ZXci8W-TpZA":{"text":"Lots of variety on the buffet. Price is $30 per person which is higher than if you went to","useful":0,"cool":0},"eiVUD8KjbLklqeuYbJ3tIg":{"text":"One of the best Jazz Brunches in NOLA - however they don't play as much as they used too. ","useful":0,"cool":0},"DgE4vSekGY9YRuCI30hc1w":{"text":"Slow service, menu was not explained, Eggs Benedict was served cold.   Will not recommend ","useful":0,"cool":0},"oGjjm99BpfupLIgAyNhvFQ":{"text":"A taste of New Orleans, all of New Orleans. The Court of Two Sisters is a tour of New Orle","useful":2,"cool":1},"Rn3vFJmqbfIuraCJNo45lg":{"text":"Peach Bellini is incredible! You must try it. Ambiance and service were 5 star as well. We","useful":0,"cool":0},"GL_MizxLOQ9D7-XxwbWxXg":{"text":"Let start saying they should rename this place as tale of two Shit holes. Either people wh","useful":0,"cool":0},"8Sc0IGT5g1jwkznMN5BItA":{"text":"Went to dinner there last night..The ambiance was wonderful, service slow and the food col","useful":0,"cool":0},"fAdUkKJJ_Wqy_hYd777YAA":{"text":"My friends and I were here for brunch.  There is a large variety of items to choose from. ","useful":0,"cool":0},"3BTfpr3P2j14mb0bs5c5aQ":{"text":"Food was magnificent.  The ambiance was amazing.  It is romantic old New Orleans.  You for","useful":1,"cool":1},"k-eNrz0WWX9Meen2YtRNgA":{"text":"We came for the Sunday Jazz Brunch before we had to jump on our plane. This was a hard rev","useful":2,"cool":0},"JhHKtzE45cFhOjbd8qHdHA":{"text":"Came here for the jazz brunch during my birthday celebration in Nola. Great decision.\n\nThe","useful":0,"cool":0},"QhJwv9T8SX8LMkLzpOivoA":{"text":"Upon reading about this place in guidebooks and on yelp, I was expecting a lot more.  The ","useful":2,"cool":0},"y9Z5pSfzvRmGzcIIk9AdNg":{"text":"One of my favorite places to go as a special treat. We love getting dressed up and really ","useful":0,"cool":0},"vE476HfwOE4m3zvOFewRCw":{"text":"We went for brunch and it was fabulous.  Being from DC $30 was worth every penny.  \n\nI wou","useful":0,"cool":0},"w7R6woMxQkgjfUM_tMI83g":{"text":"It was my first time in New Orleans and I am very satisfied that this restaurant made the ","useful":0,"cool":0},"C_PWauXoel7xl0g5Ec-u1A":{"text":"Definitely a must see brunch restaurant in New Orleans, LA. Jazz Brunch special includes a","useful":0,"cool":0},"80Js6JdcPB90FSKem7VW6g":{"text":"Would give 3.5 stars if I could.  Went here with my wife and 2 kids, ages 10 and 15 for di","useful":0,"cool":0},"XD6Gzf21epP6jG9nH5baZQ":{"text":"Ah, the Court of the Two Sisters.  Beautiful jazz brunch in a really pretty outdoor patio.","useful":0,"cool":0},"qCCumPq4WsefXQtU3x21ow":{"text":"I had turtle soup, my wife had the baby spinach. The barbeque shrimp was awesome too. Over","useful":0,"cool":0},"bd13QtwwQRi6HWNdFdgm2A":{"text":"Ok, this place is alright.  We brought my daughters there to have a taste of all of the fo","useful":0,"cool":0},"ewMAQNtbg13ML0gSFib1aA":{"text":"Pretty good food, however not the best seafood gumbo I've had here. The roast beef po boy ","useful":0,"cool":0},"QTa9wgrCvB2bcKOIa_l4sg":{"text":"We were walking around and decided we needed lunch. We walked into The a court of Two Sist","useful":2,"cool":0},"xkXgSmKQ492RSKpnXbUJJw":{"text":"A must if you are visiting New Orleans. Great food and service. The place is beautiful and","useful":0,"cool":0},"qikXx1PhXADOPhXdXon2Dg":{"text":"A little pricey, but the courtyard is beautiful, and the service was great. A classic New ","useful":0,"cool":0},"vkukij-R35feIeKDEiXvZw":{"text":"The service here was excellent but as far as the food for the money it was only mediocre a","useful":0,"cool":0},"VnSIEGYPyW83nPmXyDuTuw":{"text":"Stumbled upon the place as we walked through the French quarter. We were welcomed by a ver","useful":1,"cool":0},"yeGQunwU6Ud55ChvBqDxDA":{"text":"EXCELLENT BRUNCH! It is a bit pricy ($30/person), but well worth the money for what is ava","useful":0,"cool":0},"eg-qCDI6QxwBS_TDKn0ehg":{"text":"I chose this restaurant for my birthday dinner because it was recommend from a friend. I h","useful":0,"cool":0},"3mBjkDXOKv1vtZES0-Ut1Q":{"text":"My new favorite restaurant in New Orleans ... first, go back a couple years ... we arrived","useful":0,"cool":0},"pIOLI6_VizC_sleJihBRIw":{"text":"Two stars for the atmosphere at brunch only.    The food is awful.  Pre-made, likely packa","useful":0,"cool":0},"CALsUtvkP54XLx_qdxoK5Q":{"text":"Went to brunch here after seeing how beautiful the courtyard was. It IS beautiful, and the","useful":0,"cool":0},"KHQP4S9B7ySqKZMkkkPfHA":{"text":"The food is cold. There is no bathroom. The tables are all messy and they just shove off e","useful":0,"cool":0},"TBj7HjkD7s7hZVwa-jkFpg":{"text":"To their credit, they seated our party of five immediately with no reservations. Unfortuna","useful":0,"cool":0},"yzFw2MYu_aD-MzsK1qifZg":{"text":"Wow! I had bought the Court of Two Sisters cookbook for my Sister's 40th b-day, but never ","useful":0,"cool":0},"JuME0O16XE7EvjjgquIjyw":{"text":"I honestly don't remember much here except that I had a complimentary bowl of turtle soup.","useful":0,"cool":0},"lOSgq8E3geHIq6iJISeEvw":{"text":"We booked the Court of Two Sisters for jazz brunch on a recent trip to New Orleans.  The j","useful":1,"cool":1},"65rktvShqy1mOBHwOoxYdA":{"text":"Do not waste your money here! $30 for an okay brunch buffet was not worth it. Very limited","useful":2,"cool":0},"uv7-62ZcobSGEnhp7eV-SA":{"text":"Sunday Brunch review:  If you're into southern food, this could pass as authentic, in a ve","useful":0,"cool":0},"lzbho6FMF9qd_n-WeECOXQ":{"text":"Part of the reason I am giving 3 stars instead of 4 is because I heard lots of hype before","useful":1,"cool":0},"WuN_qYRfOiG18c6L1Tzziw":{"text":"This was such a beautiful place with an amazing atmosphere - it was romantic and relaxing.","useful":0,"cool":0},"MuetH-DRBRxguB9p1iI6ZA":{"text":"Some of the he worst food I've ever had. Reviewing this garbage so others don't wander in ","useful":0,"cool":0},"nusWLGD6spO7wWYBk0RUVg":{"text":"Fabulous food in a lovely French Quarter courtyard oasis!\n\nAsk for courtyard seating if th","useful":0,"cool":0},"BYKh2iXA2N206rsaMfHZFA":{"text":"I had the best service in here, the server's name Kenny, he was very professional, always ","useful":0,"cool":0},"4l2l_lChgtbbMtdQD-9-0w":{"text":"We were there the first week of Oct '09 (our 3rd time to NOLA) for Sunday Brunch.  I think","useful":1,"cool":0},"XKYfrJr-qTTlRxPPHfSAfA":{"text":"Decent food, very cool patio, but waaaaay overpriced. You pay to say you've been for brunc","useful":1,"cool":0},"sl45rtl3anKEBK_ZSFTFKQ":{"text":"Mike D was our waiter and he was very friendly, knowledgeable and customer service centric","useful":0,"cool":0},"WYqNQQjYOQHSi_-BF0T9BA":{"text":"Pretty good brunch but I don't know if it was worth the price for a buffet.  Food was dece","useful":1,"cool":0},"jr0hJciEfu3so3ckEpi05Q":{"text":"Being jazz lovers, the jazz brunch at this French Quarter courtyard caught our attention. ","useful":0,"cool":0},"KQuOrb7T4FIMo0kHiO0FBQ":{"text":"Sunday brunch with jazz. Would have been great but we were sat in back of a very large cou","useful":0,"cool":0},"0pfko3T6Ux50LRg44jnhnQ":{"text":"I can think of many places for a better meal, but the Court of Two Sisters is definitely a","useful":6,"cool":1},"oBseqmM65CzsDmeUpVYD5g":{"text":"Best Brunch in NOLA!! I visit New Orleans 3 times a year and every time I visit you can al","useful":0,"cool":0},"4HdbsFMmJOxT2N2k8cRRHg":{"text":"Considering I have made a reservation for 10 people with two months in advance I did not t","useful":0,"cool":0},"6a6HUwUM9fWW5_HUzBYeuQ":{"text":"Wonderful food is fantastic service was amazing\nThe drink suggestions and selection are gr","useful":0,"cool":0},"g_C63nXs3tsCqQjE_omogA":{"text":"My mom told me to try this place out over 10 years ago.  Every time I come to New Orleans ","useful":0,"cool":0},"ADaxuZCyWXeP8CFDVk29Iw":{"text":"Was not impressed. Was kind of sad. I was so looking forward to this place and it was a hu","useful":0,"cool":0},"w04wRrnAjnxKFAMOfPpa-g":{"text":"As our vacation draws to a close, we have concluded our dining at the Court of the Two Sis","useful":1,"cool":0},"Zf1As4jfzV3Vr5oEmnel2g":{"text":"Atmosphere is awesome.....unfortunately our food was average for the price.  I also expect","useful":0,"cool":0},"kWuuLk20q3z1S9Z-TCvTjQ":{"text":"The wife and I had their jazz brunch, and loved EVERYTHING.  The jazz trio was good, but t","useful":0,"cool":0},"X7ZUOHlrLvvd-aNfalQwlw":{"text":"This is a great place for Sunday brunch.  The setting is really nice if the weather is goo","useful":0,"cool":0},"r66lrnsZKatTqBz0Nta0OA":{"text":"Eventhough there's lots of tourist here, but I strongly recommend that if you're here for ","useful":1,"cool":0},"3RFlIF_Han4QIeb9wFoMZA":{"text":"oh the brunch.  you should try it.  really.  service was adequate, but it's a buffet, so t","useful":0,"cool":0},"kwG3yRwX7voWGuhkt7fpqw":{"text":"The food is ok, but nothing special. Expensive for what it offers. I had the dinner menu: ","useful":0,"cool":0},"JqOHy5sDpn-M75iEoV8Flw":{"text":"The atmosphere is terrific.  The courtyard is truly beautiful, the jazz band was great and","useful":1,"cool":0},"ljqGKCnOObol3jokicXs2Q":{"text":"Total tourist trap. Don't waste your money here. The food is mediocre, at best, and the se","useful":1,"cool":0},"6qFSetL2wOLGtt6zyeI0wg":{"text":"We had a wonderful dinner experience at Court of Two Sisters, from the wonderful  Chicken ","useful":0,"cool":0},"Pe5q1P0ydlqRdw_BA583Pg":{"text":"We visited the Court of Two Sisters for brunch on Sunday, Feb 18th.  It's one of those pla","useful":2,"cool":0},"jjxvEOKXbuSir0RZj_uz6g":{"text":"The patio is breezy, the jazz trio created a nice ambiance And the buffet selection includ","useful":0,"cool":0},"e3yjehWDHnGWxkNm3nMpYQ":{"text":"We came in on a Monday without a wait.\n*Did not list specials of the day, however he did f","useful":1,"cool":0},"EFq7NP7KazjMsarch-IrlQ":{"text":"All i can say is amazing!! Friendly staff and awesome food. We did the four course meal. H","useful":0,"cool":0},"Y8198GTPWowQ4tOOqkyT5g":{"text":"The brunch buffet was over hyped.  I've seen more options at the Golden Corral and they ta","useful":1,"cool":0},"Lg1sdLpL2hLzNZzq47fZGA":{"text":"This is one of my favorite restaurants in the Quarters. It has an old school feel and the ","useful":0,"cool":0},"pYPDDeiupsYv0IWwMome5g":{"text":"We went for the daily lunch buffet, which at $30 each, is more than we usually spend for d","useful":1,"cool":0},"W441ocAWf_OJY__HkMCLVw":{"text":"Um. Where do I start? This is a MUST. It's delicious. It's beautiful. It's delicious! It's","useful":1,"cool":1},"rlnNe3g5pmpdgRZBjeZ6HQ":{"text":"Jazz brunch features good New Orleans food variety, attentive service and fancy decor. (Do","useful":0,"cool":0},"pToz0OZLsdHvz8Bm_5DHjQ":{"text":"Holy.moly. Husband and I were in NOLA for a day before our cruise left. I eat exclusively ","useful":1,"cool":0},"YAC8_ZPvxmu_sDUO9AN1DA":{"text":"First of all, when you walk in, the hostess area is a cluster, and no one wants to help yo","useful":0,"cool":0},"PnVaRXedXd0H7P83obFmKw":{"text":"I went to the jazz brunch yesterday and the seafood creole that they put into the omelette","useful":0,"cool":0},"dgTr9q37xd5XJKd9J9mNog":{"text":"Just okay. Music was erratic and the vibe was more cafeteria meets New Orleans versus clas","useful":0,"cool":0},"n-hKScEoUK2NIqA36CofaA":{"text":"Amazing!! Wow... it's like walking into another world... you sit in the gorgeous courtyard","useful":0,"cool":0},"YEvB_U1WDVycAVlqhSBI4w":{"text":"I was SO excited to go to the Court of Two Sisters last weekend. Everyone says how great i","useful":2,"cool":0},"4Ns9-yqYhAuq1aNIu4bPzQ":{"text":"At most this place might be a 3 star! \nI don't understand how anyone can rate this any hig","useful":0,"cool":0},"aFdTfhPeb-SGhAQXH1Nmtw":{"text":"Nothing special for the price although decor is neat. Food nothing special, the more expen","useful":0,"cool":0},"XJZFIeIeYoJqILOVBq1HBA":{"text":"Went for jazz brunch and disappointed we had to sit inside as the courtyard is lovely.  So","useful":0,"cool":0},"jW2XXamoA71nF0wxVWV6Ww":{"text":"Great way to finish a visit: We ended our Mardi Gras trip with brunch at Two Sisters. Happ","useful":0,"cool":0},"gBRcFZE68bfhPXEk2lg7hA":{"text":"If you are in New Orleans, I would recommend this place for Sunday brunch, as it's a one-o","useful":1,"cool":1},"PF-K8gsMiLR-WpaZ6MD7bA":{"text":"Was on Bourbon Street and this was first restaurant we saw, was late and wanted something ","useful":0,"cool":0},"6nCSGbnSeS5h5GzFn66ZRg":{"text":"Me and my friend went to the famous  Sunday Jazz Brunch. \n\n1 star- fun unique Southern exp","useful":1,"cool":0},"hbIztFObyT3hqsm_ygkqng":{"text":"Jazz Brunch:  Music and atmosphere was enjoyable.  Buffet had lots to choose from and was ","useful":0,"cool":0},"OrAbZVBpSjv7qg0_zWqSrQ":{"text":"I have been here several times.  They have brunch on the weekends.  I like the duck, the b","useful":0,"cool":0},"GkBkwD6edh3L0sJuUSLDCA":{"text":"I was disappointed. We came because of the famous courtyard and due to a chance of rain in","useful":0,"cool":0},"P39AWrvq5gRM0Dy0gqlutg":{"text":"Beautiful location; excellent, impecable service. The food was mediocre at best, with the ","useful":0,"cool":0},"8A6Xai74n5S2J1vqadnrjQ":{"text":"The Service is top notch! Our Server Tyrone was very knowledgeable and charming. Dinning i","useful":0,"cool":0},"qPd7E7zBR4tG2btn203whA":{"text":"We went to the court of two sisters during our ladies trip to NOLA. We have heard that it ","useful":3,"cool":0},"0EGedISTP_AYitaJbWJ7Ng":{"text":"I was in New Orleans for vacation and my sister in law really wanted to go.  I was not rea","useful":0,"cool":0},"ieu9XdnU_azkg1WNWS-bQA":{"text":"We dined here for my husband's 50th Birthday on November 2, 2015. I was able to submit res","useful":0,"cool":0},"jNKAHebIT6Uwrq3cbkS3nA":{"text":"The food is excellent and the ambiance is wonderful.  We ate there after we had our Elopem","useful":0,"cool":0},"bbPEJ4NTR8e5VeHibV5gBw":{"text":"This is my third time eating at Court of Two sisters, and I have never been so dissatisfie","useful":0,"cool":0},"9T0Hor7As1gBDd2thFJnCw":{"text":"Made our reservations and promptly seated at appointed time.  We have the pleasure of dini","useful":0,"cool":0},"SOrNqCwZM0RwN-Q5vCRw6Q":{"text":"Food was excellent. Bread pudding delicious. Scenery gorgeous. Lost a star because the hos","useful":1,"cool":0},"f1nX8jP2F5O1VGJgdVBriQ":{"text":"Great courtyard dining. Good service, excellent for groups. Turtle soup was excellent, jum","useful":0,"cool":0},"YEolL1bpghwYoKuf6MhimA":{"text":"It is a little speedy, but worth it.\n\nDid the Jazz Brunch and tried about everything they ","useful":0,"cool":0},"LgSi-stT5DqIKQvNUICGuw":{"text":"My mother had talked about this place for as long as I can remember.  This is our 7th trip","useful":3,"cool":0},"QXtMmyqcEhB49Y_mI3C4Qw":{"text":"Beautiful garden seating and yummy brunch food. Our waiter was so friendly and grabbed us ","useful":1,"cool":0},"Qir9Go15pGo7ioIHU9JHZw":{"text":"This place has a great Court yard with live jazz going on that's great on a nice day. The ","useful":1,"cool":1},"a94L3kevHE0REPhNr5TG-Q":{"text":"Just had sat brunch at what used to be a good restaurant.   Started with mint juleps which","useful":0,"cool":0},"cPFN7P7qGE_WY3StbU6xBA":{"text":"Lovely setting, great location. I've been here twice and felt is was a good dinner experie","useful":0,"cool":0},"bad4JXxG1KWOf9oyh9221A":{"text":"Jazz brunch is a must every time I come to New Orleans! \n\nLet's just get it out there, the","useful":4,"cool":2},"lxzHn9n13DLHVgxc3VGfKQ":{"text":"All I really need to write is, underwhelming. The food was bland and overpriced. Was recom","useful":0,"cool":0},"JaDVgPYgKFCMLSzVrj33cA":{"text":"This is a great way to experience Cajun and traditional New Orleans cuisine. There are two","useful":0,"cool":0},"WRjdIMgCFxOTHA1dkpXG6Q":{"text":"I have only been here for the Jazz Brunch on the weekends. The service has always been exc","useful":1,"cool":1},"CIq0sRQc5XaCkBKRdgpRzg":{"text":"Stepping inside is like traveling back in time. We came here twice, once just for drinks a","useful":0,"cool":0},"t3MrJI2-Mw6wZIGyUdgeAg":{"text":"Large buffet and their eggs Benedict are good. It's a little pricey for the quality though","useful":0,"cool":0},"WK1He_5ZEW2coUbrwneMMQ":{"text":"Perhaps one of the worst meals I've ever had. To top that off I feel bad this is where I t","useful":0,"cool":0},"quc_e6M_GC_XJYSRSzqDgw":{"text":"YUM! this place is was so  yummy! after a night of partying to celebrate my cousins bachel","useful":0,"cool":0},"uwUtArzu9YhheuBiqoMMjw":{"text":"Our waiter Thomas was downright surly! My husband asked him a question and he held up his ","useful":0,"cool":0},"_JwrL1ljwhQDVuMI36kNrg":{"text":"The jazz brunch here is fabulous. The tables are outside in a beautiful courtyard with a n","useful":0,"cool":0},"o57JfrIYZBxpn9aKkCCCKA":{"text":"NOLA has the best courtyards and this place is a gem! It's so quaint and the live jazz is ","useful":1,"cool":0},"BJmhgENPo7RZv7-dssECaA":{"text":"This was supposed to be the best meal of our trip. I can say that the coffee was amazing, ","useful":0,"cool":0},"EgpWMaplhrroXwq-9I-7iA":{"text":"I went there for the jazz lunch buffet. The jazz was good, the food was good, the wine was","useful":0,"cool":0},"yyx4wdAlGoNGmSnzRtR4Xg":{"text":"Eh.. it's not as great as everyone says. I've given this place two chances and wasn't impr","useful":0,"cool":0},"I0_etXIqfCGFAhs41ndNQQ":{"text":"3 1/2*\n\nVery pretty brunch place with outdoor seating surrounded by greenery.\n\nTons of foo","useful":1,"cool":0},"Lsm95fpUb9lhJ6IYlthsfg":{"text":"The staff here was incredibly friendly when I visited during a work trip. All the food was","useful":0,"cool":0},"7JG-XmEnBrgd4G2fmwC4mQ":{"text":"Highlight of our day trip to New Orleans! We had such an awesome brunch outside. The food,","useful":0,"cool":0},"4DVdNRvbWs7xMg-NhOWm3Q":{"text":"Stopped in for a drink and enjoyed some apps on the courtyard. \nThe blackened alligator wa","useful":0,"cool":0},"IFuv14lvvXyGd3WnRDze0Q":{"text":"We went for the jazz buffet lunch. The spread was huge and the food surprisingly very tast","useful":0,"cool":0},"NLImRgwSZLUNCN_rzafNtg":{"text":"Dined here alone on a work trip.  Was seated immediately as it was a slow night.  Loved th","useful":0,"cool":0},"WJhmN7ony7M-UwlAW0LKVg":{"text":"Great New Orleans atmosphere for jazz brunch - around $30 per person. Make a reservation.\n","useful":1,"cool":0},"xJBVYXZMfKfYUPSPLZkTcw":{"text":"The courtyard is gorgeous so that's what the stars are for. The food is lacking and the se","useful":0,"cool":0},"FC_yPwuLDwUqwlmvmffRDw":{"text":"Pour un dejeuner en terrasse dans un charmant patio avec une fontaine et un fond musical d","useful":0,"cool":0},"9Z8kYGFF-ZBvQkrHYk3W4A":{"text":"Went for a sunday brunch. Got to sit outside by the band. The Brunch Buffet is massive, an","useful":1,"cool":1},"GQoUd53puKOgGh6xTyqzQA":{"text":"Very nice place beautiful Court yard, awesome old building lots of history here. Buffet st","useful":0,"cool":0},"8HgfYg_xtGphSTnAWrZYdA":{"text":"One of my favorite places to dine while in New Orleans. The food is delightful and mouth w","useful":0,"cool":0},"wcxfgr11K--60c5f50AR8g":{"text":"If you want atmosphere, this is the place. The courtyard is romantic and beautiful. If you","useful":0,"cool":0},"BQ7F1-iOqSbYGVD2uL8m6g":{"text":"Jazz Brunch, Buffet, and a Pigeon tap, tap, tapping on my shoe... \n\nSix of us decided to c","useful":4,"cool":4},"yO759xCUgG4I90gtmfQIEg":{"text":"Enjoying a beautiful afternoon jazz brunch at the Court of Two Sisters. I was a little rel","useful":0,"cool":0},"XjLdvUK5Zp_o6xbvqiGTZQ":{"text":"Beautiful outdoor seating with roof covered by leaves, a charming blue fountain, an old we","useful":1,"cool":0},"2NJSbjpBOflz0GXlXnH5vQ":{"text":"Our group of 6 dined for Sunday Brunch in Oct.  We were very disappointed. We chose Court ","useful":0,"cool":0},"oUD9v5iwjSd0GNwDMeLhpw":{"text":"Two and a half stars for the Jazz Brunch.\n\nThe restaurant was pretty inside, and the jazz ","useful":3,"cool":0},"shd8UQD9Q2SoFCXnJn2m5A":{"text":"A part of any visitor's travel to New Orleans French Quarter should include a visit to thi","useful":0,"cool":0},"XDSdjTM7VhF6unNcc_odHw":{"text":"Zero stars. I ordered the jambalaya. It was basically rice with burned sausage. When I ask","useful":0,"cool":0},"azoHJF-kXOTB9jpNX0eysQ":{"text":"The Sunday brunch at Two Sisters may just be the most overrated dining experience in the u","useful":0,"cool":0},"8K7g3lEcMmNcYjFfv7XHTg":{"text":"Great food and charming courtyard. All the traditional dishes plus New Orleans favorites b","useful":0,"cool":0},"r02i8jXmhpE000J6CrXlPw":{"text":"We came for breakfast jazz brunch.  The bacon was cooked perfectly crispy, sausage was a l","useful":0,"cool":0},"V-cOCrdRIfrwJEQaCJn1lQ":{"text":"Service was hospitable. Food was ok. Music for Jazz Brunch could have been better. Trio ke","useful":0,"cool":0},"qufCzyTfNdvv0fR1hFRCVA":{"text":"OK I don't know why the ratings are so low on here, maybe they don't know what real southe","useful":0,"cool":0},"vH_Z0rpeIICVadfnclfbKA":{"text":"We enjoyed ourdinner meal at Court of Two Sisters. The Turtle Soup was flavorful and satis","useful":0,"cool":0},"c21E_7KnXvyaBz2RjMM2Tg":{"text":"The jazzy brunch was phenomenal!! This was buffet  style meal executed in a classy fashion","useful":0,"cool":0},"HJ4lI0W3uQRCP1u2yaB-cg":{"text":"Came here for lunch on our last day in New Orleans and loved it! Petran was our super frie","useful":0,"cool":0},"82W3pLX41Vd7jhmZR9rCOw":{"text":"Old style New Orleans fare, price fix is the way to go. Good flavor sand standard dishes. ","useful":0,"cool":0},"5O-JcHOqyVvd4mzQH54h9A":{"text":"This place is very well known and has a reputation that goes way back but don't go there f","useful":2,"cool":0},"I5VcwdtwuLK6S6oCbVS3gg":{"text":"Great service from Mr Mike.  The hot buffet items were ok.  The crawfish Louise was my bes","useful":0,"cool":0},"4D8mV1beWW1yzxm8yLE7KA":{"text":"If you get the chance while in New Orleans stop into this secluded courtyard. I went with ","useful":0,"cool":0},"1tH7xPkNON7IjmLFQMhI3A":{"text":"We came for the Jazz brunch. We sat outside. The atmosphere was nice with the trees and se","useful":0,"cool":0},"U04hvo5txaYKFDk__IGWIQ":{"text":"My mom and I ha a great dinner here. Nothing vegan was on the menu, but they accommodated ","useful":1,"cool":0},"pHTBzuYPehajbxNd3PHVjw":{"text":"The food was tasty however we were disappointed with the atmosphere and service in the din","useful":0,"cool":0},"C0JshwVvRDxC3WCc5MXnvA":{"text":"This is a really nice spot with a central location. We had no idea it would lead to a beau","useful":1,"cool":0},"RCbdlO-KOxNzUjkXIu6MTA":{"text":"Jazz Brunch is awesome. Courtyard, buffet style with everything from boiled crawfish to om","useful":0,"cool":0},"mOZQ31rXIhkvLjM2ZuPwGg":{"text":"This place was so great and the service was awesome!!!! This is a must!!! The brunch buffe","useful":0,"cool":0},"6XHaTs24lUXZLAruwxBZfA":{"text":"Decided to stop here for a last minute dinner and we were not disappointed. With no reserv","useful":0,"cool":0},"FK-Qy1O7D5q02SafbSF3Ig":{"text":"Good atmosphere.  Decent food. Great service. The food is spicy but if that's what you lik","useful":0,"cool":0},"pHQfIRjjUbrA5Qn-130DRA":{"text":"So disappointed this place has an average of 3.5 stars! . This was the only place recommen","useful":0,"cool":0},"RH5pHvl1A1Z7Nlaz__5cGw":{"text":"The jazz brunch was a great New Orleans experience - expert service from Captain Vaughn an","useful":0,"cool":0},"hv8BUTxdbnpmsUflVksNgg":{"text":"I was super impressed. We got in and got an amazing seat in the courtyard! The waiter was ","useful":0,"cool":0},"FEtWKnKCPB2r5G59RIGV0Q":{"text":"The pregnant hostess is about the rudest woman I have ever met. She was awful on the phone","useful":0,"cool":0},"xVmvdcyqgUK9-b4yHN29xQ":{"text":"Was recommended as a pretty good brunch spot for my visit to NOLA. The establishment is in","useful":1,"cool":1},"HdA1iN1K0K32Tt3h6u0_nw":{"text":"Went for the brunch at breakfast time, it was so good, had eggs Benedict, hash brown casse","useful":0,"cool":0},"cyhq2ZVscL4c6T2t8K8Yig":{"text":"Excellent brunch.  For $30 per person you can get access to a serious brunch spread that i","useful":1,"cool":1},"9E70sOTdu2khezrSfT3-UQ":{"text":"Terrible terrible service I was on hold forever trying to confirm my reservation on Easter","useful":0,"cool":0},"znNGSICQIvZbKPC5AkV4bQ":{"text":"Understandably, this old New Orleans stalwart is worth it's salt in history and longevity.","useful":6,"cool":1},"d3pFN7GjxY95eaQJpS05ew":{"text":"Ok.  Last time I was here, I really enjoyed the food.  This weekend, I was very disappoint","useful":2,"cool":1},"5kBJVxa0YmGXfma7geNuGQ":{"text":"The court of two sisters was recommended to us by a friend. We had reservations here befor","useful":0,"cool":0},"1GkL9_hHilgg8lfUPJ3EhA":{"text":"Over rated. $30 per person for a run of the mill buffet? No thanks. Staff wasn't rude, but","useful":0,"cool":0},"3P8uHyGtgNYbSiZU5v0AJw":{"text":"I was so excited to eat here but the food was so bland. It tastes like mass-made food, not","useful":0,"cool":0},"5WYDqXHiVobWZmXMlj1ZuQ":{"text":"There's a million places to eat in New Orleans it's a mystery to me why people eat here or","useful":4,"cool":0},"yHyQTsdQSExKhDu_rdkfRA":{"text":"We had dinner here.  Great ambience in the garden court, and perfect noise level ... you c","useful":0,"cool":0},"N1pVvhT5Yq3deEA1yNb6nQ":{"text":"We always have a meal here when in town.  Never been disappointed.  But THIS time there wa","useful":0,"cool":0},"qO3EDjvyZTtwlZ2k0lHYlw":{"text":"A NOLA institution! A must go if you are in town! Food, drink & ambience...5 star! So much","useful":0,"cool":0},"DKQA6caL6iri9uAmzpM0hw":{"text":"Loved this place!! The food was to die for, it was a beautiful 70 degree sunny day on the ","useful":1,"cool":0},"sS2xYTEsZJ_Kon2Oep0uNw":{"text":"We had a free brunch here when we booked through a travel website so we have it a try one ","useful":0,"cool":0},"qnqjrnrnqTQAD0XWvcqdzQ":{"text":"Food was very good (not amazing) but the atmosphere and service were fantastic! The most b","useful":0,"cool":0},"4FdnaWhJf7pAdP5Gei-Myg":{"text":"Our party of five received excellent service from Eric but the dinner food was very underw","useful":0,"cool":0},"FFF4N-NbKeZJIn2EauMT8w":{"text":"This is somewhat unfair to give it 4 stars but...  I went for a luncheon in a private room","useful":0,"cool":0},"6ljNe7fj3vqMk4AmzZ3twA":{"text":"Great brunch!  I was so pleasantly delighted at all their options!!!  \n\nOkay, so service w","useful":1,"cool":1},"TNSt7tm0HHA40p_Ax64tHA":{"text":"Lance and shanika were our servers and started off right. Next had some appetizers-THE BOM","useful":0,"cool":0},"KVWZ69K_5ly1tnTAd02InA":{"text":"Nice Sunday brunch with lovely patio seating. The band was good. Food selection was decent","useful":1,"cool":0},"bPiaa7fgHkC9l7B2HyS0aw":{"text":"Went to the Jazz Brunch and it did not disappoint.  Too cold to sit outside but food was e","useful":0,"cool":0},"MeuVq32zLacP0uD8f5SmsQ":{"text":"Food was on a 3 star level but due to the face that it is a buffet.  Our waitress was very","useful":0,"cool":0},"ZNlVRigKxMyPiZYS9AzDQA":{"text":"If I could give zero stars, I would. We (7 of us) came in at 745pm on a Saturday night and","useful":5,"cool":0},"4hDUwNYQ7GQJ7MPR7lLATQ":{"text":"This place came highly recommended and so we were incredibly disappointed by our experienc","useful":0,"cool":0},"S0ho1ig93YlUw1DmREe-TQ":{"text":"Ate at Court of Two Sisters on Sunday 10/9. Spent $160 on 4 buffets, 2 sodas, and the tip.","useful":1,"cool":0},"phRDQbFgUKsIAdLFp70F-g":{"text":"A friend and I went here for brunch a few days ago by the recommendation of another travel","useful":0,"cool":0},"tkw7jH_eOqiodOEHo9ErlA":{"text":"We visited the court of two sisters this morning for the Jazz Brunch, I made reservations ","useful":1,"cool":0},"cQlF1T5xpbVDWDGBONK2qA":{"text":"I read a lot of reviews for this place before coming here so I was mentally prepared for m","useful":0,"cool":0},"EEB0DoQIoYGbbU7ik8Ct9A":{"text":"Is this what heaven looks like?\n\nGreat all-you-can-eat buffet style brunch? Plus unlimited","useful":1,"cool":0},"YNCfJWlXdXmtQFKLkxuUTQ":{"text":"This review is for the Court - the takeout on Bourbon.  I had the roast beef au jus po-boy","useful":0,"cool":0},"TNGWhuRAEp0zleMa-NixmA":{"text":"My wife and I decided to try this buffet style brunch because on paper they had a good sel","useful":1,"cool":0},"wit04g7Np-VgNy5atgAgrg":{"text":"Wonderful food great service and atmosphere. We were visiting Nawlins before our cruise an","useful":0,"cool":0},"tB7v0M1fHZ9On9ecQKyaLQ":{"text":"Oh my, I do declare. \n\nCourt of Two Sisters has introduced me to a whole new level of what","useful":1,"cool":0},"wYcGFVYmpA5XOjVrb2z42g":{"text":"A tourist staple.  We wanted a big brunch in a classic setting w jazz musicians and the pl","useful":0,"cool":0},"mrAGbPHnuLGB3HwEp92nkg":{"text":"Way overpriced $18 for jumbalaya and half a sandwhich (not during Mardi Gras)\n\nThe jumbala","useful":0,"cool":0},"JHGtqlcmPiwiGdOrpxDF6w":{"text":"Went here for celebrating my cousin's birthday and we were so satisfied with the food as w","useful":0,"cool":0},"KrdM2HYOkQ5uyCbWqYj50g":{"text":"Rarely have we been to a buffet where every single item looks delicious - and we tried a h","useful":0,"cool":0},"257SDz7jpZhx_2dZVK8ZZg":{"text":"We had there Jazz brunch. It was very good. We enjoyed the atmosphere and that the had loc","useful":0,"cool":0},"CkUNEY75Nyn180mk8Wff4w":{"text":"Food was good.  Service was just ok.  The pasta was yummy.  The lasagne was good too.  It'","useful":0,"cool":0},"B4Nil3w0TvLnDXaqQHpYtg":{"text":"Eggs? Seafood? Cocktails? Jazz? I'm in!\n\nThe night before we were having drinks at the Two","useful":1,"cool":0},"bnMK_FfGeig77tZbs43Zvw":{"text":"Made reservations and when we arrived it took 15 to 20 minutes to seat us and hardly anyon","useful":0,"cool":0},"r_GqtzySbpALB_oy_BBEUw":{"text":"Another amazing experience. After 10 years the place is still classic for that New Orleans","useful":0,"cool":0},"Qqlfq0SoNNR34QuF0QlHnw":{"text":"Good, but not worth the money.  Maybe I'm just not a fan of buffets, but I always find foo","useful":0,"cool":0},"TIAlgndJ2SdSDha-SlskRA":{"text":"I recently went here for their 'famous' jazz brunch after seeing it recommended in multipl","useful":0,"cool":0},"UJtpHtyBcWLPjm4L-oVENQ":{"text":"2 stars because as we walked out before ordering, the manager at least tried to make us ha","useful":0,"cool":0},"pawCJOVnIqZi_8G9jyt6oQ":{"text":"The cocktails here are still good, and the Jazz Brunch at this place mustn't be passed up.","useful":3,"cool":1},"L5hYx0NTV4ZXzyrT9z2-Ew":{"text":"Love the old french quarter feel sitting in the courtyard, but should have just came for t","useful":0,"cool":0},"q1J3hI0bq8efiNIrpKrAgA":{"text":"Dinner looked overpriced and underwhelming, so we opted for the jazz brunch instead, and w","useful":1,"cool":1},"aqDn-Luw7X-7c5pjlP9kyw":{"text":"I think I had high expectations for my experience here. Came here tonight to celebrate my ","useful":0,"cool":0},"UuESj_eH-cUsYnozMmVFxw":{"text":"Yikes. Came here for my birthday brunch recently. Seated on the inside next to the buffet ","useful":0,"cool":0},"LADMxKBj9uouem1lDhs0RA":{"text":"Spectacular morning brunch.  They cook Eggs Benedict to order while you wait, and BY FAR t","useful":0,"cool":0},"Xqg41B9GZuis2srFZU_jVA":{"text":"Just a very enchanting morning here at THe Court of Two Sisters has brought memories of a ","useful":0,"cool":0},"ShAgxTWX1bR6rZuEE2yDhA":{"text":"Amazing brunch with an overwhelming selection. Pace yourself with small portions and many ","useful":0,"cool":0},"Ja3ON4m3IZe1HMV6lr0pTQ":{"text":"We had seen the Court of Two Sisters reviewed on the Food Network, so we were curious and ","useful":2,"cool":0},"3aeFdmgikjvZbQAFWRy1gA":{"text":"I am very confused as to why this place does not have at the very minimum four solid stars","useful":15,"cool":7},"rGGuXvrVs5yqtcNHmzEWAg":{"text":"Disappointing!  Had to look at two dirty tables during our entire meal. Gumbo was mildly w","useful":0,"cool":0},"hLyk2Ce9PYVDpok1qCfLlg":{"text":"Delicious buffet, full of New Orleans special cuisine. Gorgeous patio, friendly, attentive","useful":0,"cool":0},"paMVCWjiEmnmjneulyiqsg":{"text":"Filthy filthy filthy. I do not recommend.  Save your money!  The food was blah, the  wait ","useful":1,"cool":0},"KAvIiW4k1fEhOluG7GuMUw":{"text":"Excellant service - beautiful court yard and outside decor - dim lighting - \nprompt attent","useful":0,"cool":0},"UdXGqfRLDsX_ck6a8ndexQ":{"text":"Definitely five stars for ambiance. Imagine dining under a green canopy in a outdoor coutr","useful":0,"cool":0},"WbHZqlF16o1tHFoyAgA06Q":{"text":"Yum the gumbo and veal are amazing! Natascia was super friendly and outgoing. Mr. Thomas w","useful":0,"cool":0},"38S07nItzNtPi8hE67RLnw":{"text":"Having dinner here the other night was maybe my 12th visit over the past 40 years.  For mo","useful":3,"cool":1},"O45L_nJ2k7zrsmNKxgMrBA":{"text":"We came just for brunch. The place was packed so expect a wait, it wasn't too long only ab","useful":0,"cool":0},"1CvoktBG0VDA3imjzlQ3DQ":{"text":"We come here every time we are in New Orleans. It has the most beautiful and relaxing cour","useful":0,"cool":0},"h4nC-PBHjCxNxYbIT9NMzw":{"text":"I thought this place would be much better. The food was bland. My drink glasses were dirty","useful":0,"cool":0},"XQJnM1P9IEXMoc0ngtUVjQ":{"text":"Don't read fake reviews that food is good , if you go to T.G.I. Friday's it's gourmet food","useful":0,"cool":0},"k6EFm2mq1lldMNoy8QYiAQ":{"text":"I think this restaurant is overrated. It's not that it is terrible...it is just that you e","useful":1,"cool":2},"ti7mfvhfM0_4czesQE1WqQ":{"text":"Appetizers: alligator, shrimp and turtle soup, delicious.\nEntree: Veal Oscar and Luisiana ","useful":0,"cool":0},"RYKUhY1wcDFEUsnTd_fzsQ":{"text":"Service was absolutely pathetic but the food was well done and tasted great. Except the Ca","useful":0,"cool":0},"1goKSWFVyDmVFm_swub9DA":{"text":"This place is awful. The hosts at the front are very rude and unprofessional. We called an","useful":0,"cool":0},"Wzwh-Rb52mQfT0MqhFwsoA":{"text":"I came to this restaurant with my family for my birthday. \nWe made a 7:30pm reservation fo","useful":2,"cool":0},"dSJefmqzmWNM3jf-_wI2Ng":{"text":"Coming from Chicago I have a few expectations from a good restaurant and this place was ab","useful":1,"cool":0},"C-D0tVLMBc_xDpzcEKuVNg":{"text":"First started with Cesar salad. I love garlic, but someone messed up the recipe. There was","useful":0,"cool":0},"AVDAdR7cE8vqv3wmT8IvGg":{"text":"On March 16th we had reservations for dinner at Two Sisters, there was 6 of us, we got wat","useful":0,"cool":0},"F0Elr4uJdvxfsfL60OAFkg":{"text":"Food is just okay.  Server is nice.  But, I don't think it's worth the money for the food ","useful":0,"cool":0},"lZX30uGzSRQoI5JtoZnLAg":{"text":"Five star service, food was great also. Ambiance was worth the price- music, the fountain,","useful":0,"cool":0},"LiBfcp84y64Rf8684rCOzQ":{"text":"Great Brunch!!\nThis place is a buffet which is always iffy b/c you think it will be crappy","useful":1,"cool":0},"zUmwamqW3bfQvTrhOazF2g":{"text":"Absolutely beautiful place! Make reservations and request to sit in the courtyard you won'","useful":0,"cool":0},"vUGKzK7xkKtss0Yqhsb6XA":{"text":"We HAD to try this place because everyone said it was a must. If you don't mind paying $10","useful":0,"cool":0},"8Ts4Imq-y40MMpkF9xVHqQ":{"text":"Admittedly buffets are never one of my favorite dining out experiences; however, the group","useful":0,"cool":0},"IwGRGq16NxzYr3LPje-94Q":{"text":"I visited this restaurant on May 8, 2018, while in town for a conference. With family in N","useful":2,"cool":0},"DN125OkXd2D3PhKI1lPJ-A":{"text":"This is my 1st time in NOLA. The reviews & recommendations were positive so, I thought it ","useful":0,"cool":0},"UAOTjMGfL7q8ng6whfxHRw":{"text":"This restaurants brunch certificate was part of a travel package that i received from my t","useful":0,"cool":0},"0G5cMG8zKaR1Xmdobpyv1w":{"text":"Ate at the Court of Two Sisters, which has a beautiful courtyard, their food is awesome an","useful":0,"cool":0},"8QKE9mpxdOT1UBKXBz6TIQ":{"text":"Good little place if you want some decent creole food, and off the antics of Bourbon Stree","useful":0,"cool":0},"WQl3SsUqkWLMU_sONXMwhA":{"text":"This place was amazing; nothing like the tourist trap restaurants that surround it. My fia","useful":1,"cool":0},"Gmutbej61hLSRmtQO4YaqA":{"text":"Wow! Literally, this place is out of this world!  The service is wonderful. The setting in","useful":0,"cool":0},"rP9ooYZXQWtAmTiM-X1ntQ":{"text":"Pricey, pretty restaurant with a elegant courtyard but the food is not good. I was disappo","useful":1,"cool":0},"WpvvAqud5hWXUgzW3CU5Ag":{"text":"Excellent buffet with items you won't find elsewhere in the country.\n\nTry the turtle soup.","useful":0,"cool":0},"NqFK3A2T9AG-OL_2ykKvcA":{"text":"Ate here for brunch on a trip to New Orleans.  The brunch would normally cost $30 which se","useful":0,"cool":0},"vYBkcnmO3T4CWRkNfz8U-w":{"text":"Such a great experience all around! We came with a part of 11 and after figuring a few thi","useful":0,"cool":0},"5_Hpmsrj8vZ181vhoDe1jA":{"text":"Nice place to take someone visiting from out of town.\n\nIt's in a good location down in the","useful":0,"cool":0},"2O8_ug-kpFRgAapAnNhuiw":{"text":"It's just OK; a tourist trap. The duck and turtle soup was good but the beef was over cook","useful":0,"cool":0},"oSFwV-vixyFgZEP2YNCH0w":{"text":"Don't know where to beggin.. We come to New Orleans every year last year we came the servi","useful":0,"cool":0},"v1yoTNnIAwjpWyL-Yx6Hsw":{"text":"This is a must go brunch for anyone in Nola. \nRight on the French quarter with a lovely ou","useful":1,"cool":1},"IKEyj_7lXg6Xbzq-d_x5EA":{"text":"Had a wonderful experience here not only with the food but the service was wonderful. I le","useful":0,"cool":0},"U-3JmzJOqrzXHYg5IDGZFw":{"text":"Ate there after being given two complimentary passes for a jazz brunch with our hotel book","useful":0,"cool":0},"HdcaXcdGtZp8HBD86fhC7g":{"text":"The server Patrick was very rude. He got mad because I only ordered dessert and tea. He al","useful":0,"cool":0},"N-2PMNVe79SiU1gYDkV0sw":{"text":"We went for the Jazz Brunch. We sat inside, as no tables were available outside without a ","useful":0,"cool":0},"Mq5uYwyXwV4GoaXfeyRHDw":{"text":"Nice setting. If you are here for the jazz brunch, the band is decent. The service is atte","useful":1,"cool":1},"bCFeveSA9zH8hssfjabUpw":{"text":"A very beautiful and somehow romantic place to dine. The staff is quite professional. They","useful":0,"cool":0},"e8DZL2nzCWchuvoO8vM6kQ":{"text":"I dont know how this place doesn't have 5 stars! The Jazz Brunch is amazing!!!","useful":0,"cool":0},"e_MiqyhpSL0S00ULDk5uUg":{"text":"Awesome service and food!! Everything was amazing and delicious. Great atmosphere and ambi","useful":0,"cool":0},"6lzrTamVRn7LPCa19DOtug":{"text":"The courtyard is amazing but is ridiculously overpriced for mediocre food. My fiancee orde","useful":1,"cool":0},"G_PUCBb2tdVT_QqaTON5AA":{"text":"Loved the live Jazz Trio. Had dinner with the wife, had the Two Sisters Three appetizer an","useful":0,"cool":0},"EqjawDX2nm6y8ZlwX39aRw":{"text":"After a trek through the French Quarter trying to find a brunch place still open, we stumb","useful":1,"cool":0},"Y4-RKHp91jY8xqLcNCROOQ":{"text":"I've eaten at The Court of Two Sisters many times over the years. They never fail to compl","useful":1,"cool":1},"ormop4o4-LEmcsQSe1BkHw":{"text":"Jazz. Food. Courtyard. How can you go wrong? This institution knows what it does well and ","useful":1,"cool":0},"fxrrntgfTusRt2CgoIiKgA":{"text":"This is a \"typical\" NOLA brunch spot with jazz playing in every room & in their courtyard.","useful":0,"cool":0},"LpEbL6eUzXWimNm6wi1jwg":{"text":"We were really disappointed, the daytime  buffet was pretty much overcooked and mushy, ser","useful":2,"cool":0},"ZebWbL5ARVTDSbk5AEmUAg":{"text":"This was my favorite restaurant in the French Quarter. We went to the Jazz Brunch. Charles","useful":0,"cool":1},"uTWwe4Hu9b-ugBlFqFZGZQ":{"text":"The food is pretty good, the patio and the cool brick hallway leading to the outside are b","useful":0,"cool":0},"NCglPyHCbdBKNYA4d4wxoA":{"text":"This place is amazing. \n\nWe stopped in for Jazz Brunch after a long night of champagne and","useful":7,"cool":1},"sItEVSQIJCDogGylgi3B7Q":{"text":"I wish it were possible to leave zero stars. Absolutely the worst experience thus far in N","useful":1,"cool":0},"nKd9uBXOzUZGRoVwCZogcQ":{"text":"This restaurant came recommended by many people during my stay in New Orleans, so a large ","useful":2,"cool":0},"SsZsTJCFt4rsqKry0j3vUQ":{"text":"My automatic thought: Shelling out $40 for one meal, really?  The answer: Yes, really!  Gr","useful":0,"cool":0},"x8G2iIj6-ibe4oH_2y2YnA":{"text":"Great food and buffet! Music and beautiful set-up with old vine canopy and ambiance. Nice ","useful":0,"cool":0},"BwSjnU1nxSx33AxBEd5APw":{"text":"First stop in Louisiana for a bachelorette party! Great service. Very entertaining and att","useful":1,"cool":1},"GFHOd-NoVgldkS00vz56EA":{"text":"Court of Two Sisters is a must stop if you're visiting New Orleans. The courtyard is beaut","useful":0,"cool":0},"Okc4O065GueqrpI8laCgzg":{"text":"Awful.... overpriced and nasty. DO NOT come here it's $35 a plate for some horrible food","useful":0,"cool":0},"59N_qzVfQdey7VdKoBdqtA":{"text":"We didn't eat at the restaurant, but the old school walk up bar is a great quick stop if y","useful":0,"cool":0},"3DbM2Iy4ncXA5Xr2piL2jA":{"text":"The food was amazing and the Server Mike was even better. Full of stories about the proper","useful":0,"cool":0},"fo0wqkP0YiYVpHblVLxHLg":{"text":"Seriously good cujan food matched with an amazing jazz brunch. Juice included with the bru","useful":0,"cool":0},"k7711ToCxDW7bxqh0vTGHQ":{"text":"New Orleans Birthday Trip = Brunch in the French Quarter\n\nIt's a classic place, The Court ","useful":1,"cool":2},"CMnOsezgldmYmEGtEgBBgA":{"text":"We went for the daily brunch and was NOT dissapointed. For $30 you can eat to your hearts ","useful":1,"cool":0},"8oIaJENSznRHZA6b9t-05w":{"text":"If you are looking to try everything creole in 1 fell swoop, this may be your place. The i","useful":0,"cool":0},"IRC8685afQj1HFKPO3Gmlg":{"text":"Amazing brunch!!!!! Highly recommend it to all!!! Worth the money! Make a reservation as i","useful":0,"cool":0},"t5eqku_XrAq3Je-IFyYBbA":{"text":"Don't waste your money on the Brunch! For the $30 cost, I would not go back. Go to the Fre","useful":1,"cool":0},"wnOAzMLtRzChQOuf_Qgz-w":{"text":"Experienced a very nice brunch on a Monday morning complimented by a small jazz band. Brun","useful":0,"cool":0},"qZPT98ZMtt02Gt3aqTKQNg":{"text":"Anyone who doesn't give this place 5 stars doesn't understand good cooking. This is a MUST","useful":0,"cool":0},"sZRkXipkqieiPpjyoRAFDA":{"text":"The Court of Two Sisters came highly recommended by my husband so we stopped by while on a","useful":0,"cool":0},"5BgMlZb_-XTxBYIJ2koxHw":{"text":"Brunch is a must here if you are in New Orleans - make reservations for the courtyard whic","useful":0,"cool":0},"GuOJHgWG13UoZzNjC3VSVg":{"text":"$30 for the jazz brunch. Don't get me wrong the food was great and the jazz was delightful","useful":1,"cool":0},"paXlk9id42X55ywES48EXQ":{"text":"Great place! I went for the brunch buffet and I was very glad I made this my last stop in ","useful":0,"cool":1},"7r9VmGj_mirdLoMB0LXs-w":{"text":"Maybe this is not a family restaurant.  My whole family came here party of 7 with 2 kids. ","useful":2,"cool":0},"-TFxwGkR9PoFofC6UUpqdw":{"text":"The Court of Two Sisters is the absolute best brunch buffet in New Orleans. I've been fort","useful":2,"cool":0},"iVxImHRgG0hEk3LjRSDyzQ":{"text":"Very underwhelmed by the food, though the ambience is unparalleled. I ordered alligator ap","useful":0,"cool":0},"812fL2a0rprlnRxL9gjWYQ":{"text":"Overpriced jazz brunch with very underwhelming food. \n\nThe service was great (our waiter R","useful":3,"cool":1},"jv0fJbeXclx5eA35sCq_yw":{"text":"I absolutely loved this place for the location/atmosphere. The courtyard patio with the ba","useful":0,"cool":0},"cs-u7xSk-qIC8qoLo9jqLw":{"text":"COTS is definitely worth experiencing but try to get reservations to be seated for the cou","useful":4,"cool":1},"EcfmFF3TkuapGMdYd3U4Yw":{"text":"This is a beautiful, iconic restaurant and worth the visit. We had dinner out in the court","useful":2,"cool":0},"QAFyu0OLdygVQfwj_y-WvQ":{"text":"I have been here several times for brunch and dinner, and have never been let down. Food a","useful":2,"cool":1},"vTkoK9UtQrNlwIB59j_pyw":{"text":"We had the first sitting for jazz brunch.  The food is served buffet style with many yummy","useful":0,"cool":0},"k6wemPlTBVXDQz2Z0OQX8A":{"text":"Saw many good reviews. Thought the food was only okay. Not a very special buffet. Hope it'","useful":2,"cool":0},"v6KqicLDOar4SnyK44cq4Q":{"text":"Went here on a visit to NOLA for a funeral, because it's my mother's favorite restaurant i","useful":2,"cool":0},"gUIX0WeHFbIcHbiydMoOoQ":{"text":"I've been here twice, and both times were memorable! Our servers were all very friendly an","useful":0,"cool":0},"HfIx_hz-dJZGCbr0WWGTcA":{"text":"This review is for the Jazz Brunch. \n\nI've been twice. Both times were amazing. I am sad t","useful":6,"cool":0},"OOgSyifHCQSArWnkmw5YkA":{"text":"We were seated about 5 minutes after walking in, without reservation. The hostess was very","useful":0,"cool":0},"SisloWYBiX3DTJoFuzGeYQ":{"text":"The food gets a 4, but the service only gets a 3.\n\nI came here as my last dinner stop in N","useful":2,"cool":0},"0QBmNLZRKIYTOnVBJg0__w":{"text":"I do not understand why this restaurant has a 3 star rating on Yekp.  This is weak people.","useful":5,"cool":3},"r_eqlXU8iTRP3jQCLI7lMg":{"text":"Went here with my daughter and son in-law.\nThe staff was friendly and quick to help us fin","useful":0,"cool":0},"dl_MSe53YGP1WP0AF6VVew":{"text":"I am giving 4 stars because we came here at the start of our vacation for brunch.  It was ","useful":0,"cool":0},"f8lZVIzV_izWgBus1WeS0Q":{"text":"The Court of Two Sisters is a pretty well-known and oft raved-about place.  It's the brunc","useful":0,"cool":1},"uKDdh2vUVDAy8t_3-9jrkw":{"text":"Ok went there for Jazz brunch and I must say it was excellent. You will miss out if you do","useful":0,"cool":0},"T7v1uVcCQ9RolZFe-gzYpg":{"text":"Damon was our server! There is no better server! \nHe genuinely cared about our stay in New","useful":0,"cool":0},"giRuSVKxZh3MferH16JizQ":{"text":"I cannot fathom giving this place less than 5 stars. The jazz was pleasant and eating on t","useful":0,"cool":1},"-ZUtF4Rjwj_DufkQYRpWzQ":{"text":"My hotel package included vouchers for a jazzy brunch at The Court of Two Sisters.  I went","useful":2,"cool":0},"4ghTFxIPMxHUYkTJpozDpQ":{"text":"I love this place. We walked in and was seated immediately for buffet brunch. I can't reme","useful":0,"cool":0},"Em-Y6KmlI6V-RKq524uWIw":{"text":"Brunch. \nDo they do anything else here? \nMake sure you have a reservation.\n\nThe food was b","useful":0,"cool":0},"kk1ufNS2xq4N74DIfn6l7w":{"text":"Had brunch here with the misses. Food was typical NOLO fair. Deserts were fantastic. Had t","useful":0,"cool":0},"ABpZSWYP5o5xI2VGHGUDlQ":{"text":"We went for the Jazz Brunch and eh, it was fine.   The patio is very lovely and the servic","useful":6,"cool":2},"iJPMDV6YTeRySzTQyxpPTQ":{"text":"Seated 15 minutes after our reservation, we were escorted to a table already taken. We wer","useful":0,"cool":0},"I8cMHQu-K5yx2tl_WuyM0g":{"text":"What a magical restaurant, sitting in the courtyard under the canopy of branches was fabul","useful":0,"cool":0},"-RZFIpEQYnYlnPzQALGoAw":{"text":"Best brunch ever in New Orleans! The courtyard with jazz band alone is worth it. Also get ","useful":0,"cool":0},"kk7V3jDD1-qXlNqIf_wRoQ":{"text":"Can't complain about this place. The food was delicious and the service was spot on! The a","useful":0,"cool":0},"paT2Q9EsNWYm2lI-3iwMJA":{"text":"Delicious turtle soup and other local recipes. Great service from Charles. Definitely wort","useful":0,"cool":0},"Fb6j03GRgR7G-fweFGTa8A":{"text":"Pretty decent buffet brunch. I tried a small bit of a lot of the menu items and it was all","useful":2,"cool":0},"6_vaMVdOjfHw0r8w9YgPCA":{"text":"Lee is the man, excellent service. The buffet is decent, good for people that haven't trie","useful":0,"cool":0},"9qYv5tGpcqAJSSc9VUX_9A":{"text":"Food was typical New Orleans style traditional. The outside seating area is gorgeous - lov","useful":1,"cool":1},"ZvOLLWC8xfTm6391OOJeLw":{"text":"Have you been on a cruise ship?\n\nIt surely feels like one without the motion sickness. Get","useful":4,"cool":1},"zkb04OJJFbqTuLk2vC2rcw":{"text":"We ate here tonight and the service was absolutely amazing. Chris was our server- very att","useful":0,"cool":0},"1saOoAuK5Ko6ai_V0A2iKw":{"text":"Per just had the buffet this morning and wow, everything we ate was more outstanding than ","useful":0,"cool":0},"lBpHpciaf01HsPy-kzpH-g":{"text":"We ate at The Court of Two Sisters this evening with a party of 10.  Waiter was friendly (","useful":0,"cool":0},"DfA24O0LARlcBwWeVks2GA":{"text":"Went here to have dinner while in town for work. Was told I couldn't get meal service in t","useful":1,"cool":1},"LFmmj4vvi89IZvwMAofZvw":{"text":"I came here with my boyfriend for brunch on my birthday.\n\nI love brunch and I love to eat ","useful":1,"cool":0},"0e8sjjdCn3ribmbl-McssQ":{"text":"This buffet exceeded my expectations...highly recommend! The ambiance was fitting and the ","useful":0,"cool":0},"6m6v643h9PGsyaybpZ0eQg":{"text":"The Jazz Brunch buffet is worth every penny.  Make sure you come hungry and ready to eat. ","useful":1,"cool":0},"l3QcW3AQZ9YlwobcUxEPHg":{"text":"One of the oldest restaurants in the French Quarter,  they're still around because they're","useful":0,"cool":0},"KwXwqPqPEiNQUjGUIB9yYA":{"text":"Unfortunately we had a bad experience at The Court of Two Sisters. We had a reservation fo","useful":0,"cool":0},"s37RCJxUjKjaOgLiM1ILEQ":{"text":"Very disappointed in the food. Being from the south I felt like it was a let down.  Servic","useful":0,"cool":0},"g-BhMogDY7Ii4UFmR3Mvuw":{"text":"Went there for the jazz brunch, we were able to sit in the courtyard which was quite nice,","useful":1,"cool":0},"NWY4r67p0vjrnvsUQyosLw":{"text":"Don't miss the jazz brunch! Beautiful courtyard with friendly, genuine service! Lovely and","useful":1,"cool":0},"zxbf5BSoLq-bZROvILRWPA":{"text":"The Court of Two Sisters is one of my favorite stops in New Orleans...\n\n* All You Can Eat ","useful":6,"cool":4},"LPGWnKO0m54rSIFf_gwFFQ":{"text":"What a shame given such grand potential.  The service is just blah. Where's the Executive ","useful":2,"cool":0},"18QmOPu2DjQssnNtiZFCtw":{"text":"Terrible experience here! I do NOT recommend this place whatsoever. First of all, we bough","useful":2,"cool":0},"SFwEHPrcA38-w8zmPS8K2g":{"text":"Was not happy at all, the servers walked around dressed like slaves. The food was served b","useful":2,"cool":0},"mscanMoX3ExSfUcacBnhzQ":{"text":"My mother and I came here for brunch while on vacation. The atmosphere is stunning. They h","useful":0,"cool":0},"Z3FxXEesupb1aMmk5ZaIxg":{"text":"Super charming.  Very old-school New Orleans.  Excellent, southern hospitality from our wa","useful":0,"cool":0},"y9VHalofs0ed5uvbZMKMAg":{"text":"when your in NOLA this is a great place for Sunday brunch. it's all you can eat buffet sty","useful":0,"cool":0},"kC91Wwyn-ixPmdBOu3_-ZQ":{"text":"There is a mustard sauce served with the boiled shrimp that is to die for. Eggs Benedict s","useful":1,"cool":1},"92HLl4EfmK3QtTP_tAAAIw":{"text":"So disappointed! I've heard about the restaurant for years and was excited about having Ch","useful":1,"cool":0},"fW5XUBvdAPUzsV98Tu3-nw":{"text":"Great service and beautiful surroundings. However, it's overpriced and the food (outside o","useful":0,"cool":0},"PFrgcEwK9H1lqUjBTdxB8g":{"text":"Straight to the point. AWESOME! LOL.. Every time I visit NOLA this my only spot for brunch","useful":4,"cool":3},"2IpxBmmgRA4GZ5RIbSgJJQ":{"text":"Love coming to eat here! It's more of an experience. We had the Jazz brunch on a Monday mo","useful":0,"cool":0},"GGesHmpwn3wqshwiYHgwjw":{"text":"We were in Court of Two Sisters for the weekend jazz brunch buffet. It was $29 per person,","useful":0,"cool":0},"Al0uaHpVJvJKulAab9KU5w":{"text":"Don't be confused with the shabby looking fast food like restaurant on Bourbon street, the","useful":0,"cool":0},"IVU09DnevW7XCkwLjJ4puQ":{"text":"The courtyard was lovely, the band pleasant and the service was very friendly... but - two","useful":0,"cool":0},"Wn_MJRmRRdKEZj0DaPsrhg":{"text":"SO TORN. Great ambience, great history to the place, but we made the mistake of coming dur","useful":1,"cool":0},"mA55VzS_yWRe0MS4UfBmFg":{"text":"Came here for the brunch buffet with my extremely attractive wife. Everything was on point","useful":0,"cool":1},"C8Uv82qbMfQEPV5Mg3AW0A":{"text":"Several friends and I went here over the weekend while we were in NOLA celebrating one of ","useful":0,"cool":0},"ylafwSqF5mZ6E7YsmEk9Ng":{"text":"Good brunch \nMake a reservation if possible- to cut down on the wait.  Food was good, swee","useful":1,"cool":0},"oH-0rXpJxdWDFk-k7251MA":{"text":"Kyla and Bailey were exceptional in making our ladies night out so special. The food was o","useful":0,"cool":0},"j26sj7ovjG3KlMczLLX7mg":{"text":"Being the middle of July, seating outside in New Orleans is questionable, but after the su","useful":2,"cool":1},"6wvx9lhH40PDZ6rT0DFtTw":{"text":"The Court of Two Sisters is an extremely beautiful restaurant, especially if you get to di","useful":1,"cool":0},"hvn3IHwl91CUdYN6A9IQ5g":{"text":"Went here for brunch and it did not disappoint. It was buffet style. There were so many th","useful":0,"cool":0},"v6GDzHXSWkB79D43HwfYSg":{"text":"Terrible. We had reservations for a milestone birthday, but when we arrived we had to wait","useful":1,"cool":0},"_32Jt_SAqO9N4suO8iJ1Ug":{"text":"Went here many, many years ago. Absolutely loved it! I don't know if I'd built it up in my","useful":2,"cool":0},"UbjlFx17A_UqAgJ7ZbE3Mg":{"text":"I reeeeeaaallly wanted to love this place!! My mom loved it here , God rest her soul\n 5 st","useful":0,"cool":0},"jtOPfigSkeJrma5uLORPTg":{"text":"Not sure how this place is still in business.  It seemed like it was half closed when we w","useful":1,"cool":0},"cnMhKqu03Wd4X53VhIVPGw":{"text":"This place was super cute! I love the history of it. The Court of Two Sisters is definitel","useful":0,"cool":0},"OW289UtI6h5wl4n1TlsKfQ":{"text":"Good value, nice vibe.\nLoved the egg station and Benedict. We went for the brunch. Lots of","useful":0,"cool":0},"jhUysCHMqzuWSB8or1HqnQ":{"text":"I got a voucher for their jazz brunch on Viator. It cost $43pp. It was great!  There was a","useful":1,"cool":1},"PEqYld0EaPOk9i-XhCtuPA":{"text":"I usually don't write reviews, but felt so strongly about my experience today that I signe","useful":1,"cool":0},"RQ7YfBxxtvjpyb6E7tWSZw":{"text":"I visit the French Quarter wherever I can, usually try at least a few new places each time","useful":0,"cool":1},"4-8UwKXik9s9Ht96sS2hGA":{"text":"After getting excited about hearing this place from my father-in-law and how he'd never be","useful":1,"cool":1},"hwB5LR_Hba9EvVGXN3N6XQ":{"text":"It was OK. The service was very lacking, not sure what happened but it did not even seem t","useful":3,"cool":0},"JE9ik7qPqiq4Fq5euhzxPw":{"text":"Sitting in a courtyard somewhere in the French Quarter under trees that have been there fo","useful":0,"cool":0},"Gc7b0SPs83eGqYf0AklfHQ":{"text":"Great ambience. Otherwise, our dining experience was a disappointment from top to bottom. ","useful":0,"cool":0},"8TOtcgVfeBblQSk4dYcoEQ":{"text":"Need late night Drunk food??? Hit up this place for amazing food all night on Bourbon! Red","useful":1,"cool":1},"Mq1cVy41gR5Dc26-9w5u2w":{"text":"By far our favorite place we've dined at since arriving to New Orleans! The food was amazi","useful":0,"cool":1},"CNBKdbRICoYAsz6bHmtF9Q":{"text":"No service after 45 minutes. Joke. Better luck anyplace else. ............................","useful":0,"cool":0},"3GNMzLOsVRc9nRBAFf-_8Q":{"text":"We had dinner reservations here on our last night in New Orleans.  I highly recommend maki","useful":0,"cool":1},"x3fNt1a3rt1i93wHvNd9GA":{"text":"Unfortunately the weather was rainy and we couldn't sit out in the patio so the place was ","useful":1,"cool":0},"qe5WIoRVURoOu5r5-_O7ZA":{"text":"It was a beautifully sunny January day in New Orleans, you know the type - no jacket requi","useful":0,"cool":0},"Uwa-1-MtnZYfjbTFSiBCbg":{"text":"Brought here on a date and immediately transported back in time. The main dining room with","useful":1,"cool":0},"_oOkwqwQQdUq8usYWWi9FA":{"text":"The setting is lovely.  Very charming and the courtyard is gorgeous.  The food is buffet s","useful":1,"cool":0},"u8EanNGUDrJjJqZ-GEQTHw":{"text":"\"Sunday brunch in the Courtyard with a sweet bottle of white wine\"\n\nAdd the smell of flowe","useful":0,"cool":0},"IIDN_tZxj5gsbKNXfec5LQ":{"text":"Need an option to rate negative stars. Had eaten here twice two years ago and it was a gre","useful":2,"cool":0},"KrZZYLuIS9BNGNSd-O3jjg":{"text":"My husband and I had the 42 dollar preset dinner menu. The food is just ok for the prices.","useful":0,"cool":0},"mTcTUqp4jyMSm0saz3gQKQ":{"text":"Had fix menu.  Good but nothing to ride home about.  Waitress was very poor.  High dollar,","useful":0,"cool":0},"jG1maxh7hR9g0ao7tkVfLQ":{"text":"Beautiful Jazz Brunch.  Large selection of food.  Be sure to get the omelet with everythin","useful":1,"cool":1},"xirtUze-ax4o8AjuAeGPVw":{"text":"IT HAS GREAT POTENTIAL \n\n\nso I came here with family for my mother in law's birthday to ex","useful":4,"cool":0},"AW4HKa0m2mTiEdMc8VadBQ":{"text":"My grandpa had went to this place over 50 years ago on his senior trip and we came back he","useful":0,"cool":0},"2T904rChKI5UNfEvyyLAug":{"text":"We are regular visitors to New Orleans largely for the incredible food. Today we managed t","useful":0,"cool":0},"_VYc2A-B9iE-u0jEgNtxWQ":{"text":"Worth going once, but we'll try a different Jazz Brunch next time. The food was ok - red b","useful":1,"cool":0},"9bxtTzCTm2rrCnYqtzhWAg":{"text":"I was super excited for the jazz brunch buffet, however the band didn't play much, which I","useful":1,"cool":0},"CmJaHHrHEN-pbTrCUYTu5Q":{"text":"\"Would you like to sit inside or outside?\" The courtyard was beautiful, so while we were t","useful":5,"cool":1},"Bo-kReX-mYBE6T4X6kDW3Q":{"text":"I came here for the jazz brunch and was very pleased. The live jazz music and the decor of","useful":2,"cool":0},"lVkVWiPnkn-s0b6Pck_DwQ":{"text":"Not what it was 20+ years ago when we first went. Wait staff was working pretty fast but j","useful":1,"cool":0},"pbE5br_3sdWWHjAjHAGlvA":{"text":"Great brunch. Need reservations. Bananas foster sauce was good, but bananas were a bit gre","useful":0,"cool":0},"279ne1KF3y-yBwJofBAQgg":{"text":"The good side of our Brunch was the patio setting and the jazz trio.  Very nice. The omele","useful":0,"cool":0},"kUjFR5vCQTEFP5mzGwFEVw":{"text":"I came here for lunch on Saturday with my friends. This was our first day in town and we c","useful":1,"cool":0},"FgwYIbFvFcgq4SiQTZmX8A":{"text":"Have dined here three times. Twice for dinner which was wonderful. Try the ceasar salad ma","useful":0,"cool":0},"4AIQ1S0owoAFTRoyTJYN6g":{"text":"Disappointing experience!  Advertised as a Jazz Brunch, our party of four looked forward t","useful":1,"cool":0},"0KSA8dDhgJr67-HxdOQ18A":{"text":"The Court of Two Sisters has a lot to offer the visitor with hours to kill while in NOLA.\n","useful":0,"cool":0},"DAE87sVuF1AR9dZckfyhrQ":{"text":"omg what a downer --use to take guest here all the time --moved away for a few years and w","useful":0,"cool":0},"NtaE-kkzoNG4v4HIJ1xaMQ":{"text":"Had a reservation and when we arrived, we were told to sit at the bar because our table wa","useful":1,"cool":0},"YvaL-W_ZFxV7lbklU8Xm0A":{"text":"The ambiance and the experience is really awesome. The food is good but nothing that you w","useful":0,"cool":0},"xA5wwXv3MA6a3QmIWsasGw":{"text":"Touristy? Sure, but that doesn't make this a bad place. We had an early Christmas eve dinn","useful":1,"cool":0},"oV0BnpN7rzk7gDCNya_SQA":{"text":"My wonderful workmates in Australia gave me a $120 gift voucher for a Jazz Breakfast here ","useful":3,"cool":0},"59CHavf4IBeVKDf7DR2eAg":{"text":"This is a popular buffet restaurant in French quarter. I was largely underwhelmed and thin","useful":1,"cool":0},"kaURmHq2G_PPP4Ok4l4dtQ":{"text":"Other than the busboys, and the hostess, maybe the worst experience ever. First, 32$ a per","useful":0,"cool":0},"rI7nXqffjGd0r1969bJvRw":{"text":"The Court of Two Sisters' experience is one that you must do if you visit New Orleans!\n\nTh","useful":0,"cool":0},"NJedSJBnvgKcn3-j2xkJrQ":{"text":"This used to be one of my favorite restaurants. We tried the Jazz Brunch for the first tim","useful":6,"cool":1},"ndr5uxgy-rRj1P81CazkLw":{"text":"We had reservations for 8 last night. Arrived 20 minutes early and was promptly seated.   ","useful":2,"cool":0},"WaJsogg335Nt7iObpwB-Jg":{"text":"Only 15 minutes of jazz in the 90 minutes we were there. Food was ok at best. Service was ","useful":1,"cool":0},"OSwylJa2ZQkSJrVMASF54A":{"text":"Continuing our bloody mary tour of the French Quarter here at the venerable CoTS. Spicy (m","useful":0,"cool":0},"sQrxIXlkGR0akvBQaMsUSg":{"text":"Disappointing brunch. Food was subpar especially for French quarter. 3 stars given for the","useful":0,"cool":0},"F1-zBAY4kcmeDOGtU6j4rA":{"text":"Is yelp playing some kind of sick joke? Anyone that rated this place anything over 1 star ","useful":7,"cool":0},"LulZTg2BcY7nDYuIS4HyTg":{"text":"NiceBrunch. Lots to choose from. The outside court yard is so pretty and is just wonderful","useful":1,"cool":0},"NQ4ON6HSSIENYMpKad6vug":{"text":"If you like a country club feel from 1984, this place is for you. Heavy Gravy with Fried m","useful":3,"cool":1},"Nfiy4s3bWAYGRGbcYTZKcA":{"text":"Had the brunch buffet. They have good variety of breakfast and lunch items but the quality","useful":0,"cool":0},"qFVkuYU5fWPOkrdrqDGZBg":{"text":"The ambiance here in the courtyard was so lovely that it made up for the so-so food. We at","useful":1,"cool":0},"iOxkI4yKZuZo75ujqj91gA":{"text":"Just ok nothing spectacular limited menu service was good people very friendly just the sa","useful":0,"cool":0},"gyBkXDO_U9ac0eq1UdCdGw":{"text":"Sunday brunch is not worth it.  The jazz was mediocre, the food was decent, and it was ins","useful":1,"cool":0},"pbgS_W_44iUsAleL0r2pIw":{"text":"Bought some to-go drinks here. Definitely ask the bartender what he would recommend. My Fr","useful":0,"cool":0},"WJA3dQTprwlXFLLHgQAj_Q":{"text":"I was here in the 1980s with my parents and recall it being magical. Took my daughter as a","useful":0,"cool":0},"uqq3Jy3KriCidOoPoRTWYw":{"text":"We had buffet breakfast there. The food is really just mediocre compared to other local re","useful":2,"cool":0},"lTw-fnqN7t5rNgE7K_hPHw":{"text":"Definitely worth checking out if your an out of towner. It is a nice central location in t","useful":0,"cool":0},"wk9aKFpZDZO6PY6It-vuRQ":{"text":"The fried cat fish was piping hot, flaky, and delicious, served with crab slaw with genero","useful":0,"cool":0},"2Y7IBs5kSKTzwsNqffY8ug":{"text":"Hmm.\n\nWhen my entree is somewhere in the $30 range, I expect it to be better than passable","useful":0,"cool":0},"Lm1oavWlsKYf7z4VHNFZxQ":{"text":"Yes yes yes!! My friends and I wanted to go to a good jazz brunch and here is where we lan","useful":2,"cool":2},"XE23luuozYS0kLMoU8EN2A":{"text":"Greeted at the door by an unfriendly woman. Server was okay but not that attentive, never ","useful":1,"cool":0},"ugrWoEq45vrzteZwFh9lOQ":{"text":"Service was immaculate! The two derricks are excellent servers. Now onto the food. I've ha","useful":0,"cool":0},"_xzi3CAuKS3TssyGqh0v9w":{"text":"Unbelievable breakfast buffet!!!\nEverything is made from scratch!\nFantastic hospitality fr","useful":0,"cool":0},"I1DcHTxMk7c85c7F3Xru6A":{"text":"The restaurant is cute and the courtyard is beautiful and romantic.  The service was great","useful":0,"cool":0},"mR-oYeosofBIRQPL23J2lA":{"text":"Before I start, I would like to say that I try very hard to not be a fussy customer and I ","useful":2,"cool":0},"J7p-IhBPrKVU0MsS0mbtow":{"text":"The place is very nice..... it's a must try for all... the service very good I will b back","useful":1,"cool":0},"3PAB9tpQ3cVnEaTtZAlCzQ":{"text":"Tried to come here for jazz brunch on our first wedding anniversary. Made a reservation we","useful":2,"cool":0},"SDkmh-ltYMjQw8O7PRGXOQ":{"text":"Excellent Sunday Jazz Brunch. Live in the courtyard.","useful":0,"cool":0},"VWp_0_JKhsWG67AQF12wMw":{"text":"What a romantic lil spot. We were walking past and ventured in because of the patio only t","useful":0,"cool":0},"Zkl6zn4k0ZT6tE_QiWVdrQ":{"text":"We happened in here on Valentines Day for dinner...with no reservations! The atmosphere ha","useful":0,"cool":0},"BPs1OFEzCcva1FRni7gpHQ":{"text":"One word- TERRIBLE. We got this place recommended over to us by multiple people and our Ai","useful":0,"cool":0},"CB6e5sFpxyan-zrIemCZqw":{"text":"2 hours for a crappy $9 Caesars salad, tiny entree that was appetizer sized for $32. Way o","useful":0,"cool":0},"r43ZA7f-oz-fv1VpKfxfDw":{"text":"Beautiful restaurant, repulsive food!\n\nWe started with the blackened alligator. Plate pres","useful":0,"cool":0},"NJfbcKb0jOOnPjdxhVhRpQ":{"text":"This place was amazing and so beautiful. Our server Christin was EXCELLENT and so helpful ","useful":0,"cool":0},"gCNoizTkNgfd3zvN7sOJNQ":{"text":"Came in for brunch at 2:00 and they had nothing closely resembling breakfast. Everything w","useful":1,"cool":0},"leI6d2jXphvkdnjOrPhSug":{"text":"Came to TCOTS from a friends recommendation to go here for Sunday brunch. (Tip: they have ","useful":0,"cool":0},"ZOTukYAhOVSNKu-QzOiFxg":{"text":"I was wary about going because of other reviews, but I went and enjoyed it!\n\nMyself and a ","useful":1,"cool":1},"tu32c7yWPiqSuQeIybZV5Q":{"text":"I am from New Orleans, and I am from Louisiana born and raised. We just walked into the ba","useful":3,"cool":0},"Vj0QY_AKouxpuDx0A3irkw":{"text":"Sunday Jazz brunch with family before everyone headed back to their respective homes at th","useful":1,"cool":0},"f1oiPKfFyP3T36aSuo0U2Q":{"text":"Great food with great service. Our Server Patrick was great and very laid back. Awesome fo","useful":0,"cool":0},"xr7aDoZPcsUhEgJg4AfgBw":{"text":"Highly overrated. We had heard about this place and decided to check it out on our last vi","useful":0,"cool":0},"22EvGMeS7JwwKVQP5oyolg":{"text":"Nice place - food selection was good and music was lovely.  Our server wasn't great - only","useful":0,"cool":0},"itkiAdxjwjYOzLRVD1gK8w":{"text":"We'd heard about this place from a couple people & it seems to be pretty famous so we were","useful":1,"cool":0},"ZkHqRhctr3WLVHpjdpRzRg":{"text":"We went here for the jazz brunch. We had reservations. When we checked in, we were greeted","useful":0,"cool":0},"LwagfTQ6BrYasIcogUxFrw":{"text":"Very average food.  Nice server but meal arrived Luke-warm.  Don't let the sit you in that","useful":0,"cool":0},"Zh7VosCzE4xBo2hLE9F3bw":{"text":"What an amazing place and concept. The food was the ultimate experience. I actually forgot","useful":0,"cool":0},"dDaq6bjvHbienjFLorndGw":{"text":"When I tell you me and my friend got our life at the Court of Two Sister yaaalllll!! They ","useful":2,"cool":0},"dZfQI-9k-b07rGdQ26fqug":{"text":"Went for the Jazz brunch and sat in the courtyard.  No music the day we were there for som","useful":0,"cool":0},"-1kZRloyYc1Znc8dn-gPfg":{"text":"There were eight of us at dinner. Easy to get a reservation because it was 90° outside and","useful":0,"cool":0},"wnIq_Qn-lWQydJi0fYFwiw":{"text":"One of my favorite brunch places. I love sitting out in the courtyard, it's just beautiful","useful":0,"cool":0},"TIkqw0VNWz5mlBylUCQtYA":{"text":"I gave this place a solid 3 stars for its buffet, it had a lot of fresh food and good vari","useful":0,"cool":0},"9v63EgSgIUw9PSBkF5zb7A":{"text":"Such a fun place to eat in the French Quarter!! Plenty of vegetarian and gluten free optio","useful":0,"cool":0},"w17iilTV2FXZ-jzsVm8qJA":{"text":"Came here for the Sunday Jazz Brunch....won't  be back. The cost of the brunch was a littl","useful":1,"cool":0},"kFqsEtV9dzB5G7rqOlPu4A":{"text":"Food was good, but not great. It felt like they cater to large tour groups and the chef wa","useful":0,"cool":0},"fbCdDlNl7whnkHtKHm8ejg":{"text":"One word: Brunch! For $30 you get all you can eat buffet in a very relaxed, laid back, bea","useful":0,"cool":0},"7_8sbJOMDhRRBgmFaTdDjw":{"text":"It was just okay.\nAmbience was nice and my meal (fried fish) was good but overall was not ","useful":3,"cool":0},"IdkNCcLx9n5UtQZtXQtaAQ":{"text":"We had a great brunch for my bachelorette party ! Tyrone and Derrick were amazing . We did","useful":0,"cool":0},"yMFIB7gnBMv3nov5A73VlQ":{"text":"We made reservations for brunch  based on searches and recommendations.  We walked along B","useful":0,"cool":0},"t4yTjLMJnlpoRxkJXnpI8g":{"text":"This past Mardi Gras was my first time visiting NoLa and being a lover of all things Brunc","useful":0,"cool":0},"17xQSHCiUs0Ffo9aezk2IQ":{"text":"Tourist trap, not worth the price. Turtle soup was good though.","useful":0,"cool":0},"DIgaAkmGjWXIlcMXL0Ezzw":{"text":"There's something about leaving the snow covered north, traveling to New Orleans and eatin","useful":0,"cool":0},"BW1ubPY0fbfmUU9ZzNQUPA":{"text":"A must go place for Sunday brunch. Enjoyed the endless buffet and tasty food selections. A","useful":0,"cool":0},"okv1F0w4ZS30Fpf6V1xCyg":{"text":"We came here for the jazz brunch and while we had made reservations, you could also walk i","useful":1,"cool":0},"64jZnvKgYkaGvJSNfjVZoQ":{"text":"Extremely over priced for an average brunch buffet. You can get much bigger bang for your ","useful":1,"cool":0},"AWxuMdc910N4wJE-YrC3kg":{"text":"If you're looking for ambiance this is the place. The courtyard canopy is a wisteria tree.","useful":0,"cool":0},"6Z20-hLMpdHlheyzLwGN3Q":{"text":"I have eaten here several times for lunch and highly recomend it.  But dinner is a no go. ","useful":1,"cool":0},"JFqU0f250Qh3SkHtiFfWCQ":{"text":"The ambience was good, food was just okay considering it was $30 a head.","useful":0,"cool":0},"cdqr_abSbOS8nAPAXElNKQ":{"text":"The courtyard is amazing, and the service was great. We were there for an anniversary dinn","useful":0,"cool":0},"u6dpktvvzR2QFjWq8LcHJA":{"text":"Legendary southern gem. Somewhat of an oasis in the middle of debauchery land. So as you w","useful":0,"cool":0},"_xEdiceh3_SY0i7OlmHb8Q":{"text":"Back again. Impeccable service provided by Lee with whom we enjoyed conversing about the h","useful":1,"cool":0},"th-Dblf47cgLqDz5qUebIQ":{"text":"Coming from a city of gastronomy like L.A. and going to New Orleans is a bit of a transiti","useful":0,"cool":1},"AO3QGWqYYddxUuoH4ZT7XA":{"text":"Great Atmosphere\nAll in all the space itself is great, the green roof of vines is beautifu","useful":2,"cool":0},"KLET9BwTTI6ZO1hPIhPHSg":{"text":"I tried this place for lunch with my friends during a trip to New Orleans in November 2010","useful":0,"cool":0},"opiw5IId52XXdO9dM18zmA":{"text":"Visited this place for an authentic New Orleans Style brunch....Service and Staff- ALL wer","useful":0,"cool":0},"6cjDJlAFjC6YVCbdPAqoUw":{"text":"You can't beat the setting. We ate outside in the courtyard amid sweltering heat. The fans","useful":1,"cool":0},"CB3rG-Fl0SQjP-5XldpDrw":{"text":"We were so excited to have brunch buffet here on the Friday morning of our arrival. The am","useful":1,"cool":0},"_SwSs1BWONAwOyix1O94Cw":{"text":"Wonderful food but long lines for buffet and slow coffee service for price. Husband absolu","useful":0,"cool":0},"42fwdfx5uxfesOGcXZPGBQ":{"text":"What I loved most about the Court of Two Sisters is that there was absolutely no wait to e","useful":0,"cool":0},"UZGtoE2z8hOfJza3fB6hxA":{"text":"Don't waste your money on this restaurant for the Jazz brunch..the food is of low quality.","useful":1,"cool":0},"GFOBpkh9FGoenUDqS7Bt3A":{"text":"Jon at the bar is fabulous!  We came back just for him and his wry sense of humor.  His se","useful":0,"cool":0},"l-nHibLvY-lgPXMugi0w3A":{"text":"Sorry to say but this was incredibly disappointing. We came for the lunch buffet, but prac","useful":1,"cool":0},"qnYTvsxv2tFkw5lZObLi_A":{"text":"I now know why \"Court of Two Sisters\" is internationally recognized. Thanks to Coolinary w","useful":0,"cool":0},"6MUv2M3H89NMa1cDJowKgw":{"text":"Historically speaking, this place is rich of it. The ambience is very what I think of when","useful":2,"cool":2},"gyK0ad1rqVDJqqhJW7BfDw":{"text":"Beautiful courtyard, we really wanted to make it to brunch but it was full.  We had drinks","useful":0,"cool":0},"n1rH1me0hOWVW5e_GRMLfw":{"text":"It took almost 2 hours before i got my main course. At 21/2 hours,  im waiting on dessert.","useful":1,"cool":0},"6I-l3hwHGW7ueJDyxp1vsQ":{"text":"We visited this place as part of a cocktail tour and came back the next morning for their ","useful":0,"cool":0},"2_Jq3nCuiRd9tjQX3_jjGA":{"text":"We went to New Orleans to celebrate of Anniversary and made reservations at 2 restaurants ","useful":1,"cool":1},"yoQZEWIKoyMnwBGEMCKjNQ":{"text":"Went to the restaurant with sister, brother in law and my friend. We had high expectations","useful":0,"cool":0},"vlf5iNJ5ygbnvL99kPTZzg":{"text":"Service was great but the food was cold on the buffet line. We were the first ones in line","useful":1,"cool":0},"vPdE3FV95IbFeIxQGrX5gg":{"text":"While I have fond memories of the Court from past visits. Super place and location. Atmosp","useful":0,"cool":0},"iS7neTEYsfNg01hpkpCsbQ":{"text":"Since its in the french quarter, it is always crowded on the weekends. If you plan to visi","useful":0,"cool":0},"HuXME3Jzg6TnrEz0jX1h-g":{"text":"Would definitely recommend the Jazz Brunch!  Each time I've visited NOLA I always make sur","useful":0,"cool":1},"xb8LoaFrdGnCXRixnqeM_w":{"text":"I'm not sure what all the hype is about.\n\nThe courtyard is GORGEOUS, yes.  The jazz band m","useful":0,"cool":0},"SviY72VahLLaanN0bPkM4w":{"text":"Very good selection! I have a lot of food restrictions and was still able to eat plenty fr","useful":0,"cool":0},"h4WF-o6UQQxj4pIKqMvF2A":{"text":"Awful food, service, seating...EVERYTHING ABOUT IT IT TERRIBLE!!!!!!!!!!!!! I will never g","useful":0,"cool":0},"VOBsFKNHga3HPxSz7q1KTA":{"text":"Visit New Orleans on vacation everyone said the must go to spot his Court of two sisters. ","useful":1,"cool":0},"IiIoeJMzsd9GAucdB4UfMg":{"text":"The Jazz brunch was a Five-star experience. The chef prepared for me a seafood omelet w/ a","useful":0,"cool":0},"xc2V-ce8bF7fJnkcQ-mvuw":{"text":"Great Sunday morning brunch. Nice light jazz played live, beautiful green courtyard settin","useful":0,"cool":0},"hV8q6n-iHw3N0THoE19gJg":{"text":"The best breakfast brunch buffet in NOLA hands down. If you're looking for atmosphere, it'","useful":0,"cool":0},"VZZwAG22CmnX0KHfp2QCZw":{"text":"My worst food experience in all of New Orleans. I don't even know where to begin and I'm t","useful":6,"cool":1},"W19_cFgSPtf7CLHlSeBw2g":{"text":"This was the worst meal I have ever had in my life. I think this place is recommended for ","useful":3,"cool":0},"3kfqggv8i63Hoe__S5l8Xw":{"text":"This is a rip off buffet.  I paid $50 per person. The jazz band played only half the time ","useful":3,"cool":0},"d91Uku1JNLv7jSgRgc7hSA":{"text":"Ambiance is excellent in the courtyard.  Food...meh.  (for the cost)  Service was very meh","useful":0,"cool":0},"9C2ESLtOObDv074BQIutsg":{"text":"Brunch buffet was varied enough but I would have appreciated more fresh options such as sm","useful":0,"cool":0},"yiwUBo7LJk8RMY9GjCo6RA":{"text":"Cold and warm brunch \"All-You-Can-Eat\" buffett. \nRomantic courtyard--relaxed atmosphere.\nL","useful":0,"cool":0},"EyvuiO0DZDyZHs2nlNJDpw":{"text":"mimosas were fabulous! great live music. great and cozy ambiance. loved sitting out on the","useful":0,"cool":0},"1NEJElRfrIiRd4O3DtOiJA":{"text":"THIS PLACE IS A SCAM. They say 81 dishes if you include lettuce, tomatoes, strawberries, a","useful":0,"cool":0},"YIwKSi60uCJPk6rMKaFT3A":{"text":"This is a must for dining in any visit to the French Quarters. Every selection was fantast","useful":0,"cool":0},"6yyU_oJzfe9x7UEGlLBH9w":{"text":"Love this place!!! Great food, it is pricey but worth it. Went to their Jazz Brunch!!!","useful":0,"cool":0},"_tDAbhySGwNmHjOwKYYmAg":{"text":"While was good, service was fair at best.   Promoted as a jazz brunch.  But heard 1 song i","useful":0,"cool":0},"zbexaVuorzp_4XPIEcCbtw":{"text":"Terrible New Orleans cuisine and the staff appeared to have a bit of chip on their shoulde","useful":0,"cool":0},"YihHqof4YkW6jKjaJfCFIQ":{"text":"My aunt/God Mother had her birthday brunch here with about 30 family and friends. From the","useful":0,"cool":0},"kSpR-w5Uwyb8zjpk6Q5KFA":{"text":"We had the brunch buffet and it was some of the best tasting food we had in the French Qua","useful":0,"cool":1},"c_O31PczhdGajRLPbgHKCQ":{"text":"Escape from the riot on Bourbon Street and treat yourself to Jazz Brunch at this sheltered","useful":1,"cool":1},"XIEVl-fSiro9UGIGxbNJ0Q":{"text":"You have to do jazz brunch!!! Not only is the atmosphere so beautiful but the servers are ","useful":1,"cool":0},"hvVVve7jKEgM8IFr2UNeXA":{"text":"Fantastic food and accommodation.  My reservation went from 2 to 8 with short notice.  The","useful":0,"cool":0},"Z6opHf_12CEr9OnzqgVoNQ":{"text":"I'm So disappointed in the whole branch experience at the Court of two sisters. I am also ","useful":4,"cool":1},"4aXKDSa4chjrlAkHxfzkGQ":{"text":"if youre in NOLA, you can get a great Jazz Brunch buffet for $30. Theres an egg station, h","useful":6,"cool":3},"Uha1v7jfmCJcaM-ROqPyQQ":{"text":"$30 per person for brunch but fantastic. The lines moved quickly,  food was great, service","useful":0,"cool":0},"V_I7vQFO1YIOdtdTi8oX-g":{"text":"Went in for the jazz brunch on a beautiful day in December. The food was nothing special b","useful":1,"cool":0},"4_tzo1HY7p1mr0z8vWy9kA":{"text":"Loved it!!! Waiter was excellent and extremely helpful. Food was good except dessert. Cour","useful":0,"cool":0},"QRVg-_2Cg_VIQU1VA-un5Q":{"text":"There were eight of us at dinner. Easy to get a reservation because it was 90° outside and","useful":2,"cool":1},"-SNlaXtabhFiFpOIlZhaTA":{"text":"We came here with a party of 20 for my grandmother's 75th birthday brunch. The reservation","useful":0,"cool":0},"z1WpzMFBdsK7CunwtGWSxQ":{"text":"We made a reservation for party of 8 for Sunday brunch.   The buffet was all amazing!  I l","useful":0,"cool":0},"a6KHv197SY-kZwpcEKUxww":{"text":"I didn't know I needed this buffet until we were there. The coffee and mimosas were delici","useful":0,"cool":0},"-H4yBb4_yXkD1g4Q0TJylw":{"text":"Great brunch. Tons of options. Jazz band is great. Completely recommend, just make reserva","useful":0,"cool":0},"XTC-PBg_d25dO8BxhjrvRA":{"text":"Easy to get in, clean, great little jazz 3 man band. The service was bad. No one looked li","useful":0,"cool":0},"vx5K8cLJwybM3LHt_NPB2w":{"text":"This is the best brunch in New Orleans. Their staff is always so friendly, and they went o","useful":0,"cool":0},"s2byaQpszEmRzMV_44teKg":{"text":"We wanted to have dinner here but they were booked until early January. We opted for the J","useful":2,"cool":0},"lJxCjyiUkgAMr6THdA-nHQ":{"text":"Came for the Creole A La Carte menu during my most recent visit to New Orleans.\n\nFell in l","useful":0,"cool":1},"FEUBWBXS9yh65Wf1qPsCkw":{"text":"Great buffet and atmosphere for the money.  The food was very New Orleans/Louisian style, ","useful":0,"cool":0},"HMmRpx_lJeNmETt_Thrthg":{"text":"Ty was our server and she was prompt and friendly.  The glazed sweet potatoes are deliciou","useful":0,"cool":0},"De-jla8QU1uhXwmJaiBIYQ":{"text":"If only the food was as wonderful as the wait staff...We ordered the duck jalapeño appetiz","useful":1,"cool":0},"mTx2NyMe2kQx2v8yNMsEgQ":{"text":"I think at one time this brunch was amazing, but now that it's so popular, the quality has","useful":3,"cool":0},"ZA6_DZmXLcvOZlrQAQU9Fg":{"text":"The best restaurant in New Orleans! The food variety is extraordinary! Great atmosphere, o","useful":0,"cool":0},"poxJLv3P0tMVnAJiGehC9Q":{"text":"We visited the court of two sisters for brunch on a Monday to avoid the huge crowds. Didn'","useful":1,"cool":0},"QHsc64zL2bDCrwaeQrjR7Q":{"text":"Absolutely amazing meal. Went during a season as crowded as Mardi gras and we were able to","useful":0,"cool":0},"_w0UE9K2_7-crA-aW0eO2A":{"text":"It was here that I learned to suck head and eat tail.\n\nUmmmm...inappropriate start?\n\nLet m","useful":3,"cool":3},"Po-8WQalqhKgCdqPS5yxOg":{"text":"We went on a busy NFL weekend. No reservations but to our surprise there was no wait to be","useful":0,"cool":0},"kbOzJuzS6w9rqAWotRVARA":{"text":"This place is so pretty! So happy we were seated in the pretty courtyard with a wishing we","useful":0,"cool":0},"rU1oqsMLz66T7uUbnL116Q":{"text":"This place was amazing\nThe jazz brunch Buffett  is more than you can imagine\nSalad boat, h","useful":0,"cool":0},"XLdvigHw5ZF8zthZZ26I0g":{"text":"This is some of the worst food in New Orleans, and for far more than you would pay virtual","useful":3,"cool":0},"hbZpzlPe_VG2P_1aPdYGMQ":{"text":"Excellent dining experience. Had the shrimp and grits as my main course and it blew me awa","useful":0,"cool":0},"nGB0rf_AArWy5D5LcHOc4w":{"text":"$100 for 2 people, a 30 min buffet line, and food quality that earned it the name \"Cajun G","useful":6,"cool":1},"SKW1SRbu0w4-iVNz0zTv9A":{"text":"Jon is the best bartender we've met this week!!\nHe makes the best Bayou Bash. We have had ","useful":0,"cool":0},"qBam11fd4Qx6wIpfQ3GnvQ":{"text":"one of the worst meals I've ever had. I've never been anywhere that I couldnt find somethi","useful":1,"cool":0},"2InIKHdmP6zs1lz5gvu7Rg":{"text":"This place deserves 5 stars if they would just cordon off a section for groups. We were so","useful":0,"cool":0},"78B8TQtasV9ENQ2rvJspJQ":{"text":"Place has a beautiful backyard....food is mediocre. A little bit dirty too. Not sure if I ","useful":0,"cool":0},"JPSBe4Ud7mBqgHgFt3paOg":{"text":"One of my favorite restaurants on the planet for a number of reasons. I must say that this","useful":0,"cool":0},"-xQfAZ9C8KnrBtpc2YhvTw":{"text":"My husband says on e...but  I give it two because of ambiance.   We spent over $100 on dri","useful":0,"cool":0},"EpeileMq_7caf631fqsAyg":{"text":"I'm not sure what warrants the high prices and small portions. \n\nBeing in hot weather, I d","useful":3,"cool":0},"eu5K37lvbFo1WcbnRgchPw":{"text":"My mother taught me, if you can't say anything nice, don't say anything.  The courtyard wa","useful":0,"cool":0},"VTYtESs7lD7-zKVO3ywRlw":{"text":"Very nice restaurant ... beautiful court yard ... nice Service , from Waiter Franco ... hu","useful":0,"cool":0},"JlCLDn9LvVhDdJsEM5xjtg":{"text":"I wanted to like the Carriage Way Bar at this place a lot. Sitting up at the rail at such ","useful":0,"cool":0},"pQ0LsVvGesAomYpXRde5jw":{"text":"Great birthday dinner there with friends. Our waiter, Jimmy was new on the job, and  did a","useful":0,"cool":0},"s_qLBmiewYHOWTgRBcfodA":{"text":"Wonderful jazz brunch.  The food was delicious and a definite \"taste of New Orleans\".  Ask","useful":0,"cool":0},"xZ1CkAeikoIjWRPw7OLx0Q":{"text":"The customer service was impeccable, our servers were fantastic. We attended the Sunday Ja","useful":0,"cool":0},"aVvp5ktE8LGBEbRQxxpy1w":{"text":"Jazz brunch at Court of Two Sisters was a fun affair but overall felt 100% touristy and un","useful":6,"cool":0},"-hG13PXFY5nFkd_8_t9SPQ":{"text":"Service was beyond compare.  Jazz music very good.  Buffet was excellent.  A second appear","useful":0,"cool":0},"nUwtOjhzwy74kpYtf7y0LQ":{"text":"Went here for dinner on a Saturday. Beautiful courtyard, intimate setting. Mediocre food, ","useful":0,"cool":0},"IKvBWixHKmnsUMWq8hhdVA":{"text":"Just stopped in for a drink at the bar.  If Teddy is there, he makes great drinks!  Will g","useful":0,"cool":0},"6aen3Zuj-TdegPibLBLDZQ":{"text":"My friends and I went there for brunch. I got a taste of everything New Orleans. Loved eve","useful":0,"cool":0},"PWmi-G35XgKuhK8OCKOZew":{"text":"I went for brunch during my stay in New Orleans for the Jazz Fest. We were greeted by a ve","useful":1,"cool":0},"8Z6xmlHOC7zQDJe00eaUvw":{"text":"My fiance and I loved this place!! We came here to celebrate a friend's birthday and we ha","useful":0,"cool":0},"8jK_w5rI9b7iyXaN-hx3lg":{"text":"brunch is so good.\n\nfood is excellent.\nlove every dishes.\n\njazz music is ok.\n\nthey will si","useful":0,"cool":0},"QeGUwE56Gl7Llgnj2nfNUQ":{"text":"This was one of the more disappointing spots on our trip. We came for jazz brunch but was ","useful":3,"cool":0},"9sY-SRJxl50JVAvc-pdOcQ":{"text":"Everyone's favorite brunch spot in Nola. The focus is definitely on quantity, not quality.","useful":0,"cool":0},"seD1pk7Nh9263cq2tgGp0Q":{"text":"Wilcus was awesome! This place is all about the ambiance with the jazz and the only place ","useful":0,"cool":0},"DSE4hok4txA4nRB-8xaqMQ":{"text":"This place looks really nice with the courtyard. Service was attentive, food was ok we had","useful":2,"cool":0},"YM-XwozHfvg1tYs3SIWHQA":{"text":"Very disappointed. Not worth the money for jazz brunch. Hair in my eggs, no bacon after 11","useful":0,"cool":0},"eZQ64-Cn-tQ9sTLi7hIl0A":{"text":"This place has it all! Spectacular atmosphere, impeccable and attentive service, wonderful","useful":0,"cool":0},"chLxaQpMJdiSZTCVMW7apg":{"text":"Heavy food, nothing really stood out.","useful":0,"cool":0},"XD-SaW_88J2UAY7BD2lleg":{"text":"After several trips to New Orleans some friends and I finally had the chance to stop in fo","useful":0,"cool":0},"v31B-a4hSVK69l0d4pgOPw":{"text":"I was really excited to try this restaurant on our visit to NOLA. The location was gorgeou","useful":2,"cool":0},"qnVjUCNQGwJpZJruX1TVzw":{"text":"This place blew my mind. From the service to the food I was impressed. They have so many o","useful":1,"cool":1},"8davwl9RCagNVCJ24Z78CA":{"text":"I went here today with some friends and family for the jazz brunch buffet. I honestly kind","useful":0,"cool":0},"UpIA70JDP9SYBsGmC98JRA":{"text":"Had the breakfast buffet with an order of pancakes an omelet and eggs benedict.  The food ","useful":0,"cool":0},"leF0lNBZ_yCVD06ltKr9XA":{"text":"This was by far the best brunch buffet I've been to so far! They had every authentic New O","useful":3,"cool":3},"xKGlWpK5HJ6Ygxk3sTT1Gw":{"text":"The food was very bad. It tasted like dorm food. Although they have a nice courtyard, plac","useful":0,"cool":0},"-QeTRrR_NI5B2CJiiiBSMw":{"text":"This place is amazing!! The food is the best I've had since visiting NO. The service is eq","useful":0,"cool":0},"XlIVElP-Li-4jfXyYhuL-g":{"text":"This was my second time here as I had been here in 2009. This place has a great brunch buf","useful":1,"cool":1},"2CpGXVOwIRNmF0GBH_s3SA":{"text":"The food was all good, but this place is WAY overpriced. We found much better food at a fr","useful":3,"cool":0},"UY8iDPVv2Xs3iHb5Q4nXTg":{"text":"Good food for brunch but over priced for a jazz band that played for 5 minutes while we we","useful":1,"cool":0},"0uuzLNHN3DzoKRKpU745Yw":{"text":"We just had a lovely Jazz Brunch for my 10 year olds birthday.  The food was wonderful, am","useful":0,"cool":0},"uIOi3ZGh66Cl-JifsrlV0Q":{"text":"This was my second time at the Court of Two Sisters--the first time was years ago! It was ","useful":0,"cool":0},"fWpM-mwLBEPnwWIFwAvvbg":{"text":"Loved it!  Went on a Saturday at 9 am for brunch. They line up to get it when it opens!  M","useful":0,"cool":0},"HWgzeujO-o5UzbfqN9eHrQ":{"text":"Brandon was my server and as a single diner he made me feel comfortable and special. Best ","useful":0,"cool":0},"A-AYHltBiZTirE8pnqKHCA":{"text":"This place is historic, it gives you a taste of several New Orleans dishes, and it really ","useful":0,"cool":0},"Gbe8GEGoaz74BR9IQ_Q9KQ":{"text":"Love this place, brunch at the Court of Two Sisters is the French Quarter at its best.","useful":0,"cool":0},"-d9BrHGfLa7H_7mvrby8NA":{"text":"Such a beautiful place with one of the best courtyards in the Quarter. You can find almost","useful":0,"cool":0},"9_FnKXpHk7blSFGu_9zOnA":{"text":"Annie the bartender is awesome!! Totally legit! Nice little hole in the wall! Stop in and ","useful":0,"cool":0},"Nm0fl2dcGGGhSWSVh_SYhA":{"text":"Wonderful ambience just blocks away from the Bourbon St madness. Fried green tomatoes are ","useful":0,"cool":0},"NzOTuYMAwwL5y0Zw2wYM6Q":{"text":"Husband likes everything because he has low standards when it comes to food but even he th","useful":3,"cool":0},"cXU7nmgkmdDM9t9XxYU67w":{"text":"Go for the ambience and history if you must. But the food was very unremarkable. Lovely se","useful":3,"cool":0},"iv9bw5Kvx_hvkQNYD47q_g":{"text":"Amazing to say the least.  Ambiance was perfect, wait staff was incredible, food was absol","useful":1,"cool":0},"XceEkv7rIswY_o_pR0h79w":{"text":"Our visit here was a big disappointment. Service was very slow. Our waiter was never in si","useful":1,"cool":0},"P1nf0ytcN-_P-W7LxRK9DQ":{"text":"Amazing brunch! The jambalaya was amazing! Everything was so good!  The ribs, pasta, biscu","useful":0,"cool":0},"xICHrqUsjVIhK6UboP3idA":{"text":"Impressed by the ambience definitely. Food was not as spectacular, taking off one star. Al","useful":0,"cool":0},"-2qWIn_-miPoJm5rDsHz2Q":{"text":"My wife and I visit NOLA 2-3 times a year. We started making the Court of Two Sisters our ","useful":0,"cool":0},"dMVDP_B5ZD5T_aK51STCuQ":{"text":"One of the best brunch buffets I have had in years!! Everything was seasoned and cooked to","useful":0,"cool":1},"BmJAVVNGjpUShxbzDXtmeA":{"text":"The food was really good and the service was excellent. That said, it is still VERY expens","useful":0,"cool":0},"u2Tk4reMEqqS3Bl8iwWg9Q":{"text":"Such a lovely experience! my husband and I visited on a Wednesday. We called ahead to get ","useful":0,"cool":0},"K4YB8JprDLtbjAYdmaoG3w":{"text":"Not sure what all the fuss is about. We came here for Sunday jazz brunch and it was terrib","useful":0,"cool":0},"CJaQxKzdHx6xeajxbwt_UQ":{"text":"Really cool place to visit, service was great and atmosphere was perfect for brunch. Staff","useful":0,"cool":1},"h7rvB5PC7d3irO878RWvww":{"text":"This restaurant is delicious and the outdoor dining area was gorgeous. CAn't wait to go th","useful":0,"cool":0},"zvI7XVGUmbyfx1SRr9Un5w":{"text":"Food was good, the atmosphere and service are what make this place great however. The live","useful":0,"cool":0},"g76lNWu5ENTH3Qs9wStqbA":{"text":"Maybe we came on a bad night but the food was not the best. I ordered the seafood gumbo wh","useful":0,"cool":0},"ptsrUSNnQuqH4oCdc_FfkA":{"text":"The jazz brunch is a must-experience when in New Orleans. Enjoy a classic drink in the bar","useful":0,"cool":0},"b3JsAD3oB0rB-d3M4YSMfA":{"text":"First time in NOLA so we had high expectations for some good creole/cajun food at the Cour","useful":1,"cool":0},"wkUUpc7mrpMWjrpcyb3BCQ":{"text":"This breaks my heart to write. I have such fond memories of brunches here. Something has c","useful":4,"cool":0},"vv0Sh-mdV66U3YrrSEAxcQ":{"text":"This is one of the finest restaurants I have ever eaten and the ambiance is probably the m","useful":1,"cool":0},"bMnOi4gS4n2dsixGXIYAuA":{"text":"Food was great.  Service was ok.  Music kept the vibe positive and the crowd was happy to ","useful":0,"cool":0},"NfXNso73oap8nvQbS1VbQg":{"text":"Great staff, charming building, tasteful food. I tried the turtle soup (interesting), alli","useful":0,"cool":0},"FwP-WmTTKBjxgGNbZsFWWQ":{"text":"Found this restaurant on yelp and figured it would be a good last day in NOLA brunch, we f","useful":1,"cool":0},"e9YfI7AS40n-GW57YXuzKw":{"text":"We went with a party of 6, and had heard so many great things about this place. The restau","useful":0,"cool":0},"28yTeQ0iLDuZAgvV1pVAMQ":{"text":"OVERPRICED.  My bill was $65 for two people (juice not included). Better restaurants in th","useful":1,"cool":0},"HZpEmUyaFbPp2Z96_IAerQ":{"text":"Loved the courtyard the venue was beautiful. We did appetizers, wine and dessert. We had a","useful":1,"cool":0},"V3ec7UF_lCOeLtJBVFM5mQ":{"text":"Decent gumbo, roast beef & gravy po boy was good.  Nothing over the top but easy to get in","useful":0,"cool":0},"4bnHdR3x8n1pIMw_K2-wsA":{"text":"Before we even said anything, the server greeted us with \"Welcome to New Orleans!\"\n\nHe mig","useful":1,"cool":0},"__Z9V3mAkjhB6nP7JK8HrA":{"text":"food was ok and we didn't have to wait but the buffet options were an eclectic mixture and","useful":0,"cool":0},"_NFUODbQNTwHfgt1OaZ2AQ":{"text":"I went back to NOLA!!!! \n\nThis was my third trip and I had yet to go to Court of Two Siste","useful":3,"cool":2},"aKj38xf8H4eyzYEi1BRXcQ":{"text":"Great History, Great Service, Great Ambiance, but the food was a little bland, and not min","useful":1,"cool":0},"zgilLlbelLj5BaHmFdKdpg":{"text":"We went to the Jazz Brunch on New Years Day and absolutely loved the food, ambiance, and s","useful":0,"cool":0},"ZsN8_czXPpCo9rZKRCjeog":{"text":"I don't come to New Orleans to eat at a sub par Vegas buffet.  But that's exactly what the","useful":4,"cool":1},"vYq5jyqtKQcqgGHEHU6FcQ":{"text":"This place was recommended for our trip and it definitely fulfilled our expectations! The ","useful":0,"cool":0},"VFllaKMPY9VDHSqLq8giUA":{"text":"Before I write this critical review, please know that night my wife and I gave a 5* review","useful":0,"cool":0},"zGV9FaV2BwiRy-niJJITSw":{"text":"Jon at the bar has a great sense of humor. Good drinks! Relaxing atmosphere and cool vibe.","useful":0,"cool":0},"-2DKeRagvUztl-bxWbGGYg":{"text":"Ii'm surprised this place only has 3.5 stars.  It should have at least 4.  I confess, I am","useful":0,"cool":0},"6bQ2LHhbnHOZsDpKVuEsNA":{"text":"Enjoyed the courtyard and our high energy wait staff Ms.Clesi and Mr. Derrick. Fresh buffe","useful":3,"cool":3},"XrdTllqzQvmXNs6lGw8s-A":{"text":"Wasn't impressed with the Sunday buffet.   I'd suggest your party eats inside if you prefe","useful":0,"cool":0},"Am99m0wPjnnyRBleczlPrQ":{"text":"The service here was great but the food was nothing special or impressive. The jazz band w","useful":1,"cool":0},"CfsRogay69ntjTVLzmWR2Q":{"text":"If I could give this resturaunt zero stars, I would. Our reservation was for 8 pm, at 10 p","useful":1,"cool":0},"edwmdiiY-ZbVgoE123UWFg":{"text":"The food was stellar. We opted for the three course meal.. the food was stellar but the en","useful":1,"cool":1},"_1gfYP33yh00IP_K9UzrSg":{"text":"The best in New Orleans for food atmosphere and service.  Our servers Jeremy and Rend went","useful":0,"cool":0},"QnrIholUdcYMGTTv3YMISw":{"text":"Stay away! Customer service does not exist at this restaurant! Save your money because the","useful":0,"cool":0},"HwqGSI4PL1G4VVisIq6c9Q":{"text":"I would give it less if I could. The staff was unfriendly, the service was terrible, the f","useful":1,"cool":0},"qVXlR1V9iwHXFDhtz5ATPg":{"text":"Food was decent, service was good. Website said live Jazz brunch until 3pm, but the moment","useful":1,"cool":0},"4yBm1x41rsTKNy6ZtADqHQ":{"text":"I want to start out by saying our waiter Jeremy was amazing! I need to eat low fat as our ","useful":0,"cool":0},"0dVpYbY8pf1rFC4nMvcIHw":{"text":"We just happened to walk by around dinner time and decided to eat here. We were seated imm","useful":0,"cool":0},"IqDm4CIrPGbQ67pEaqgVXw":{"text":"Beautiful setting. Mediocre food. Waiter was good but rest of staff was truly awful. Uncle","useful":1,"cool":0},"lQ81FvYczN2YmJ-C6cZG6Q":{"text":"This is the place to go to end your every-so-memorable Nawlins trip. This is the place to ","useful":4,"cool":1},"yPPI_x0DWY8XWGkWkHQoig":{"text":"I was expecting for the price. I thought there would be more brunch food and not so much l","useful":0,"cool":0},"37gtv63wx43ck4IADyJ2Pg":{"text":"Don't even bother. $81 for the buffet for 2 and spicy, nasty Blood Mary's that had no tast","useful":2,"cool":0},"eMqnEysMmG_WEzKk7v3Tsg":{"text":"I think the food was good, however, our server, Thomas must have had a really bad day.  He","useful":0,"cool":0},"_UhCKlyXwOsfAIye49RIoA":{"text":"If you want that French Quarter experience, this is it. Wonderful brunch, most attentive a","useful":0,"cool":0},"-koizU1wBx7IYtoNaX2dAw":{"text":"I had high hopes for Court of Two Sisters, but--alas--those hopes were dashed by a combina","useful":1,"cool":0},"3jJPR4GXm8y75Gn9FWfcMg":{"text":"Had a nice dinner with my wife and 9 month old under the vine canopy. It was a hot night b","useful":1,"cool":1},"7lNtd4AuW6onqOP1Yd5iFw":{"text":"The courtyard at the restaurant is very nice. The brunch for breakfast was just OK. Especi","useful":0,"cool":0},"jX7OEEd7PMZFo09v3td6Ng":{"text":"The service was great and good atmosphere, we sat outside and was a little cold, I wish th","useful":0,"cool":0},"qM-Nxwsm9vkwVqsAKZILSQ":{"text":"Nice atmosphere. Good food. Great desserts. We sat outside and it felt so romantic and mag","useful":0,"cool":0},"gup0XUYhX_7QRZgnWDAfCg":{"text":"Wish I could give 5 stars ..didn't have a chance though .  We live not too far from this r","useful":2,"cool":0},"LbbTo6rhYs_EzhdsScz0Ng":{"text":"Ambiance=5; service=3; food=3. \nVery pretty outdoor dining area; however, low grades on fo","useful":0,"cool":0},"7rTNfpxb8lbuNcXWXKEMyg":{"text":"I am from Detroit, we visited this restaurant off a whim and I was not disappointed at all","useful":0,"cool":0},"cF8O7lzN07rnMJcWtlnW9A":{"text":"Wow.. .  Are you looking for a traditional Sunday brunch?  This needs on your don't miss l","useful":0,"cool":0},"80j8STDxYfYozVEbBWCENA":{"text":"Holy amazing food, this place was so unbelievably good. A bit pricey, but definitely worth","useful":0,"cool":0},"omytcAFrTW6QSZ1ZObVA_g":{"text":"Unbelievable Sunday Jazz Brunch. Worth the $30/person. But even if you come hungry, there ","useful":0,"cool":0},"GRT5BLWcgXuA7V--d9GGbA":{"text":"Overpriced tourist food. If you want overpriced overcooked meats with boiled vegetables, s","useful":0,"cool":0},"pl6mJVqcl8uDRB9_WO0CSw":{"text":"The Good:  Wait staff is great.  Fabulous Bloody Mary.  The Bad: Very uncomfortable seatin","useful":0,"cool":0},"R571bzE9eWjuxZoXXy1Z1A":{"text":"So glad we decided to try. This is a pretty well known restaurant that I had not visited i","useful":0,"cool":0},"f7v7rqxP0VJFICGAGYPumQ":{"text":"Love this place.   The courtyard is beautiful.  The service was great.  Food was all fanta","useful":0,"cool":0},"MklOpMcIuZ3S8OBHhZd3IQ":{"text":"First time in New Orleans for my boyfriend and I and we both couldn't be happier we stoppe","useful":1,"cool":0},"EKmKU4UzSaDPR5nNfOu43A":{"text":"*Mobile Review*\n\nCame here with NYU ADEA faculty and student doctors\n\nDecor: 4/5\n-indoor a","useful":4,"cool":2},"8QhainXlbpivEB5HkjgVlQ":{"text":"My work colleague said this was a must and she was right.  We went for the Jazz Brunch whi","useful":0,"cool":0},"Ev626SZrlTnukS7pDkK1PQ":{"text":"Visiting New Orleans for the first time with my cousins, The Court of Two Sisters was reco","useful":0,"cool":0},"jrapTrgdOY4ADPgGFKlINA":{"text":"I took my wife to the Court of Two Sisters for our anniversary, a jazz brunch. Our table w","useful":0,"cool":0},"EiwwfzLFJdiE6ys438MAAA":{"text":"Really lousy food in an incredible location with tons of character and soul. Loved the set","useful":0,"cool":0},"pfjYecPkk9vxV6i3Mn8FYg":{"text":"Did the Sunday Jazz Brunch. Best service of the entire trip. Damon was our server and he t","useful":0,"cool":0},"nc1qt6cgTp-_fF1raJtiEA":{"text":"We had a reservation for 7 that we made a week in advance and were on time for our reserva","useful":0,"cool":0},"FElgZBAA7tVyIyViPlXJng":{"text":"my first stop in NOLA for my first time in NOLA, was a great and set the bar high. Normall","useful":0,"cool":0},"nZvYXr6m1CwlY-5-0eQEJw":{"text":"Went for the jazz brunch. \nTerribly disappointed.\nFirst of all, we weren't asked if we pre","useful":4,"cool":0},"Xi58XTByxksLKCK13-9yRw":{"text":"This is a lovely spot to hit for brunch while in NOLA- the Jazz band could play more consi","useful":4,"cool":3},"1DDszEYKq9IQuDDTMOka1Q":{"text":"Jazz brunch, fantastic!  If your anything like me, don't where white.  Turtle soup - to di","useful":1,"cool":1},"PkimZiO2Q2G9rgxAtXIg4Q":{"text":"Okay, so the Court, like parts of my beloved Crescent City may have fallen on hard times, ","useful":0,"cool":0},"MWYXdcra4iNZZ2sZe0KGSQ":{"text":"If you're looking for a unique place to have dinner in the French Quarter or near Bourbon ","useful":0,"cool":0},"lQx9V9cvzDke3A2fdgJdXg":{"text":"Best Buffet in town! Great service, great atmosphere, and great dishes all for a great pri","useful":0,"cool":0},"WJsjBgkdy4mT2ztdVkJOyg":{"text":"I've been here twice when traveling to NO. I've loved it every time. Yes it's a bit on the","useful":1,"cool":0},"NgMWll2TFXchJeQc98DkyA":{"text":"You are in a city known for food and frivolity. This place is massively overpriced for the","useful":1,"cool":0},"QOLVLaUrNZAHLdbibqt9yg":{"text":"Lovely. Very nice patio. Great service.\nFirst time I relaxed.\n\nThey could remove a table o","useful":0,"cool":0},"I1SPMGd7ZyXiRkXr1Dvm4g":{"text":"My review is on the jazz brunch on a Saturday:\n\nWe had the buffet and walked in around 123","useful":1,"cool":0},"zcPvNpIUSAgu2dKMMUfVvA":{"text":"Excellent place for a great meal with a group! The waiters were awesome and played along w","useful":0,"cool":0},"KF3K3gJUv5E0ZFc0nc-LUQ":{"text":"We were looking for a Sunday brunch, and I remember reading something about the Court of T","useful":1,"cool":0},"ZZTyv6PntAEq-boV8curNw":{"text":"This place had amazing food and amazing service, but I was walking in front of one of the ","useful":0,"cool":0},"QNEFOqSjilkv7N8VqFGR0w":{"text":"Brunch service selections has a lunch side and breakfast side. Not much hot food,  more wa","useful":2,"cool":0},"y0yQzRI1o2bkt2Ze5uRAnA":{"text":"While on vacation, this was our favorite place in New Orleans!!!   We had the brunch buffe","useful":0,"cool":1},"yLClMP5IaJqU4BN88HIOzQ":{"text":"Jazz Brunch, weekday\n\nPros: beautiful location and atmosphere, great jazz (nice and light,","useful":2,"cool":0},"-XkSr0Ns_oLk7XcVoo6NVQ":{"text":"Classic New Orleans style creole restaurant. We ate a prix fixe menu on New Years Eve. The","useful":0,"cool":0},"ATmPn-_jEAIUW7p2BsjFMw":{"text":"We are visiting for Christmas from out of town and came here on Christmas Eve for reveillo","useful":1,"cool":0},"R_bCYv6fllRZzf83qYcVNw":{"text":"This had always been a favorite of mine, with excellent food, service, and music, but sadl","useful":0,"cool":0},"c2FxyuGOIlyVBrZLUzyJjQ":{"text":"We came here for their famous jazz brunch buffet. It was warm enough for us to request sea","useful":0,"cool":0},"2dd_mwALpCIMyeo4ztqVdQ":{"text":"I'm going to keep it real simple!\n\nExpensive\nNot so good food\nService was great\nOutdoor pa","useful":2,"cool":0},"iuSCMhPKC6OVaSzXTyXM6A":{"text":"This was a very interesting experience. We thought we would have to wait since we didn't m","useful":0,"cool":0},"lI3IDjZn3K32TteG5qdLog":{"text":"Excellent service. We were a large party and the server took excellent care of us. We all ","useful":0,"cool":0},"qFg--tRC_POxxlYus-cxQQ":{"text":"Buffet brunch was amazingggg! Came here for Memorial Day weekend and they had such great s","useful":0,"cool":0},"FQLfrZ7PN9imCiOLVy4QSw":{"text":"My wife and I went to the \"Jazz Brunch\" and it was okay. Bottom line is the food is not wo","useful":0,"cool":0},"dLIMSdwRBUxOrfsD41bGjw":{"text":"Must have stopped by at the right time. No wait with a wonderful table. Joel was our serve","useful":0,"cool":0},"s-sko3x2t5RYP8jXc0Kh3g":{"text":"We went there for dinner on Fat Tuesday. The bartender was rude. I ordered the beef tender","useful":1,"cool":0},"t_IT_wtBVIjpKeGRKLsw6A":{"text":"Had heard great thing about this place, but our meals were very mediocre compared to some ","useful":0,"cool":0},"AfQpmBdCeaNjf3EbMkbUjg":{"text":"I love this place. I've eaten here a couple times and will go back again. We arrived near ","useful":0,"cool":0},"XyjSe_Vq-PqGno6bdt_jnw":{"text":"Love their brunch! This is the second time I've been here and service and food are both wo","useful":2,"cool":1},"yAPmZi6U4bMg-9leooL_qw":{"text":"The good:  Ambiance can't be beat.  Jazz band was pretty good.  Waitstaff was awesome.  Th","useful":0,"cool":0},"ZgkEeb8KBmTjAxVy5Vcj6g":{"text":"We came here for the famous Jazz Brunch.  I heard many good things about it,  such as auth","useful":2,"cool":0},"8LEPKZv7HaLUizlOz-TQQA":{"text":"Several of us went for brunch, which was busy, but very good. We enjoyed getting to try lo","useful":0,"cool":0},"ZPmLz17xy5QrWOzZVi_Upg":{"text":"Probably one of the worst meal I had in New Orleans and in the French quarter and I had qu","useful":1,"cool":0},"AndlP3SzfGvKCBS7wtRRXg":{"text":"The buffet is horrible. The food is terrible and not fresh. Great atmosphere though. Save ","useful":0,"cool":0},"M7zYuT1Y0qO_C1G8OSJHGw":{"text":"We had reservation at Two Sisters for a morning bruch. Although expensive we found the foo","useful":0,"cool":0},"sMNmdiH53mUjBOixjDroXw":{"text":"Jazz Brunch is a most pleasurable experience. The Buffett is loaded with dishes for everyb","useful":0,"cool":0},"58tK7C6l4zL3s0AVWI4K7g":{"text":"This is a very nice place to dine in, it has a very nice pre-fixed  dinner menu which is t","useful":0,"cool":0},"bBkfr3ZArt6ucu4l-CJuVw":{"text":"Jazz brunch a total disappointment. This place was suggested to me for Sunday jazz brunch ","useful":2,"cool":0},"RuS3jC-KNr6sOM6hDqeEEA":{"text":"The overall experience at the Court of Two Sisters was a treat. The Southern hospitality g","useful":3,"cool":0},"cIp6GgAISPJLaBLQ4pSKVg":{"text":"It breaks my heart to write this review. We came here several times in years past and love","useful":2,"cool":0},"IFmYUck8HUuuXX1SlgqSRg":{"text":"We had the Jazz Brunch and it was really good.  They played live jazz (soft jazz) and had ","useful":1,"cool":0},"kEtNZI7ZSE_N5rdLYTfNNQ":{"text":"Went there for brunch, atmosphere is really nice, we sat outside and they have a live band","useful":2,"cool":0},"Ej_vLooLt9vUfsE655SS6Q":{"text":"Nestled in the French Quarter, this is a Great place for brunch. Very elegant and a huge s","useful":0,"cool":0},"oauHhET8ZbWh2jHLmou0Jw":{"text":"Highly recommend the Jazz Brunch.  Food is so flavorful and there is something for everyon","useful":1,"cool":0},"sh8XTuSLLzQwzXpXjZCvHQ":{"text":"I went to New Orleans for my 30th birthday and my best friend took me to this place for th","useful":0,"cool":0},"TXQhI0817FVJ_El8_bjJ6w":{"text":"Jon the bartender is awesome!  Tells it like it is which is refreshing.  Knows the French ","useful":0,"cool":1},"XK-ZhjmY30tQcRFzvdNguQ":{"text":"Come hungry!! A beautiful place a couple blocks away from Bourbon Street. If you are in Ne","useful":0,"cool":0},"rCxEHqgdg2yiCYHxZcQXwA":{"text":"My family love this place! We came here for Friday brunch buffet, the selection was great,","useful":0,"cool":0},"4OblkgPMd5_iGmm3vyOC_g":{"text":"Really great atmosphere, beautiful outdoors settings and the service is really good!\n\nThe ","useful":0,"cool":0},"LI6Q_cr07pm2krWL4jeAAg":{"text":"Went there for the Jazz Brunch.\nNO Surcharge for Music.\nExpansive Buffet. As the waiter de","useful":0,"cool":0},"RxfDWiM-2f2NtSRgxaxBFQ":{"text":"We generally go here anytime we are lucky enough to be in NOLA.  And, as usual, the drinks","useful":1,"cool":0},"G-xTYl8zsu4RKYsXxu7k4g":{"text":"The courtyard is absolutely the most beautiful outdoor setting in NOLA!  Spicy Bloody Mary","useful":1,"cool":0},"o6NUVLLDGUDyb2_KxSOuwQ":{"text":"Tried the aligator sandwich and the jambalaya. The jambalaya was amazing and I advise tryi","useful":1,"cool":1},"mEYWBW6b01P9zLZZiLjaeg":{"text":"Great ambiance, great service.  The staff really knew the buffet and made great suggestion","useful":1,"cool":0},"UWg-PBJ0-9HWZqabQt3gVA":{"text":"Food was good but service was slow on a Slow night. Nice setting but overall lacking in ef","useful":0,"cool":0},"MSJIkCQmYL-Pckpj49Nizw":{"text":"Not just a great place for brunch. Great courtyard for a romantic dinner.","useful":0,"cool":0},"B1GkJzGoV_7gopmg_L3tRA":{"text":"I absolutely love this place. I have been to New Orleans 4 times and every time I make it ","useful":0,"cool":0},"0WxXUjEuiov3fqyb6q5xig":{"text":"Food was really good, husband had crawfish ettoufe, I had alligator bites. Both had hurric","useful":0,"cool":1},"o78nU2j8GLow838rNXnqfQ":{"text":"I was recommended this place by a local so my girlfriend and I went for Sunday jazz brunch","useful":0,"cool":0},"wkJV7XbEuUVvE0u0FQ7cHA":{"text":"Ended up underwhelmed by this place. It's decent, but if you're looking for the best food ","useful":0,"cool":0},"yQ8ozwXt40DqtYM050FDpA":{"text":"A trip to New Orleans is not complete without stopping in for Sunday brunch or dinner at t","useful":0,"cool":0},"QUh7rKnZLIozbFnBOVW8kA":{"text":"Went for dinner on Christmas Eve and not worth the price. Decor was great...in 1972. Timin","useful":0,"cool":0},"zZBv6rVXJmRP_LTUACkEVA":{"text":"Excellent atmosphere and service. Alot of meat and seafood on the buffet, so I wasn't over","useful":0,"cool":1},"sTtALg2piBPukAe7Q6ByTg":{"text":"4 of us went here after our Segway tour. We were starving and needed somewhere quick and c","useful":0,"cool":1},"IORNgGF4fZtqA2KvJyuMtQ":{"text":"Food was for the most part just ok. This is getting a low rating because the service is ba","useful":4,"cool":0},"8XD4rsaS-aew4_Xf6rL85g":{"text":"Came here with a very large group and had private buffet. Every single item offered was fa","useful":0,"cool":0},"EGL-fhsOIqlJtgdSeCt-Kg":{"text":"Recently visited New Orleans and had brunch at Court of Two Sisters.  Outstanding food, se","useful":0,"cool":0},"oBXFSUbzrQPp9tTryQSAeQ":{"text":"We partook of this New Orleans establishment the morning of a cruise. I've eaten there bef","useful":2,"cool":0},"v6M7ZKgObVUJ3vgbT2vSTw":{"text":"I loved everything about my time here except for the fact they wouldn't let me order from ","useful":0,"cool":0},"7GA9Zjy2L_ytfGFV19uflA":{"text":"Food was great, but the service.... Arrived at 8pm. Waited 30 min to place order. Another ","useful":0,"cool":0},"245WTlHv2vCTUiQU7NoINw":{"text":"A really nice choice for a special occasion or pretty much anytime. Having dinner under th","useful":0,"cool":0},"0zb6wlF5fBM8auIL-GfXnw":{"text":"This restaurant came highly recommended and it lived up to the hype. The buffet selections","useful":0,"cool":0},"8NASKj23lro6HihLXOR-QQ":{"text":"The Jazz brunch is the best!  Every times I'm in New Orleans I'm going here!  Worth every ","useful":0,"cool":0},"wxZ3DsiHYvT7HheqmO-Jpw":{"text":"I do not know how anyone could give this a bad rating I absolutely and totally adore this ","useful":2,"cool":0},"XP5K5B9Jyv9Xutc85hbTGw":{"text":"HOLLAHH for nice view, nice music, nice all thang\n\nFOOD//\nI actually took off 2 stars from","useful":1,"cool":0},"lWssIKapMvcNxWgPxVBiGw":{"text":"This place is a tourist trap. The courtyard is lovely but if you're looking for good food,","useful":0,"cool":0},"uzWE9hGw8-QNFkBXPXFG1g":{"text":"I visit this place for brunch every trip I make to NOLA; trust me there's been many!! Toda","useful":0,"cool":0},"hA9QmBy1tGmAUFm9ZTZlFQ":{"text":"We thoroughly enjoyed the Sunday Jazz Brunch Buffet! Lee was a fantastic charming waiter a","useful":0,"cool":0},"m6yGN28xP5TiFaAO8qrfhg":{"text":"One of our favorite brunch spots in New Orleans! Such a treat. The patio also is the perfe","useful":0,"cool":0},"WAy2p7NmVTjOg4BRaqdL-A":{"text":"Shocked this place has 3.5 stars when it is clearly 5 stars. The food was stunning. The se","useful":0,"cool":0},"gtvD5zEiJXRBIlcjXB-Vng":{"text":"OK, a guilty pleasure in a city of guilty pleasure -- a true tourist trape.\n\nI remember CT","useful":1,"cool":1},"9JOb6-M17nsVxVdnWx5jDg":{"text":"What stood out most about this meal was the setting. The courtyard was beautiful and the l","useful":3,"cool":0},"n1y7DNln2xTx6VKMY_ORQA":{"text":"Venue had good service, nice atmosphere, average buffet food, a little too crowded for my ","useful":1,"cool":0},"3t97wK4uMQALUV5iG25MNA":{"text":"It was our first visit to New Orleans and we decided to dine here for our 40th wedding ann","useful":0,"cool":0},"N_AX6BGt44_ljOCWclb5Tg":{"text":"We partook of this New Orleans establishment the morning of a cruise. I've eaten there bef","useful":0,"cool":0},"VE4W-hGXpXhadIcl-EXn9A":{"text":"Meh  and expensive. This was recommended by our Uber driver for Saturday brunch - we did g","useful":1,"cool":0},"4R72d-AiEWB8a-iDQT3lgg":{"text":"Had Easter Brunch here and really enjoyed it. Nicest atmosphere, great service and excepti","useful":0,"cool":0},"UTM_t7-VoFE3NAWbXIUvNA":{"text":"We went for their Sunday afternoon Jazz Brunch. A beautiful old and charming Southern buil","useful":0,"cool":0},"vVQHM0gQQHHbRCKT_1j6KA":{"text":"A sad disappointment. After waiting for 6 months for our vacation with reservations here -","useful":0,"cool":0},"Fpb9S82gzb3_wYlHoO9ItA":{"text":"We had brunch buffet on Saturday. You could tell that this used to be something amazing.  ","useful":0,"cool":0},"1-XGQsAqdeypJOx6k_clKA":{"text":"I will start off by saying I am not a huge fan of buffets. The food wasn't bad at all, I'm","useful":1,"cool":0},"U4Fo0YtYnG8NtQ1UZZtQxQ":{"text":"Great !!!!! Food 5 stars service great the buffet was great !!! It was my wife's birthday ","useful":0,"cool":0},"XJeQciXHDZv8ukbVVJkHbw":{"text":"NOT WHAT IT USE TO BE!!! I'm only giving two stars because this place use to be a 5!! Not ","useful":0,"cool":0},"JMqkjHBPDkiDtVhB_A-A_g":{"text":"The food here mostly ranged from ho-hum to downright disappointing. The high point of the ","useful":4,"cool":0},"rIsRh6Iz4dgVxaucljuxEA":{"text":"The courtyard is beautiful and we really enjoyed our brunch experience. Numerous people sp","useful":6,"cool":4},"fb86edWue9TugaqACDGnTg":{"text":"Court of Two Sisters has a lovely buffet brunch. Reservations are recommended and there is","useful":0,"cool":0},"UhzsdaOEPEQpp46lwzOy_A":{"text":"I was torn between a 2 or 3 star.  I'll say why in a moment.\n\nAmbiance & service alone is ","useful":1,"cool":1},"B6dqgbGWhL9xWbssm5woFw":{"text":"I'm not very adventurous when it comes to food.  Usually.  Perhaps it was our informationa","useful":1,"cool":1},"_K8JvLozl2lJrX-sI--Fpw":{"text":"We came here for Jazz brunch on a Sunday. It was a nice sunny day, and we were seated in t","useful":2,"cool":1},"ZU5CvosPb2LBE-R7vMaOyQ":{"text":"Mediocre food, like cafeteria quality. Salad drowned in vinegar. Shrimp and grits same as ","useful":1,"cool":0},"m7sxLczg_QfXQl2gkA8Xlg":{"text":"This place is so beautiful. If you love ambiance like me then this is a place you should d","useful":0,"cool":0},"oybx9_1LvvgKnTjpzLGeHw":{"text":"Pretty unique brunch on Saturdays and Sundays.\nThere's a crazy amount of items and a great","useful":0,"cool":0},"f3HOM8SF-xU7ZZT4AILzLQ":{"text":"Omg Annie aka COOKIE is AMAZING! Great vibes and even better conversations. We came here 3","useful":0,"cool":0},"8i3DO8tFZWI6JdH20CeJEg":{"text":"Over rated. \n\nCame here with reservations for Reveillion Dinner on Christmas Eve with the ","useful":3,"cool":1},"lyjODYveK7PvdP_LXCOBIA":{"text":"We had the Jazz Brunch Tuesday, August 6th, a birthday reservation. Although August, fans ","useful":0,"cool":2},"9u_vHEQzrAjP6qPemirU_g":{"text":"I don't usually write a review in the middle of brunch. But oh my! I typically wait fOr th","useful":3,"cool":1},"AdDuyG5S2e_g4kCBUEijlg":{"text":"My bf and I went for the jazz brunch. I selected table by the trio when i made the reserva","useful":0,"cool":1},"fP1eQzdHzgYFLUPGS3JU-w":{"text":"The service here was not that great--we had an older gentleman waiting on us and he messed","useful":0,"cool":0},"N8zamTAughoi8h34XoDMOg":{"text":"One word\n\nCrawfish Neapolitan \n\nWow. Amazing flavor profiles \n\nGumbo is very good also \n\n\n","useful":0,"cool":0},"DgfQ7KmWqMS8EfawF-dGQA":{"text":"This is a classic location.  The inside was fantastic and the courtyard was beautiful.  Gr","useful":0,"cool":0},"J0tSAB7AmAc0esaVqU3I5A":{"text":"Holy cow!!! This place was AWFUL!!! Steak was heavily overcooked, green beans were half br","useful":2,"cool":1},"-zTpqKE8IMFR0Yfe6c5guA":{"text":"We ate dinner here last night and Taylor was our waitress. She was phenomenal. She had gre","useful":0,"cool":0},"GFxQswSXCdKObI5oClRp9A":{"text":"OK food, but a bit too rich and greasy for me. \n\nThat said, cool atmosphere. Very old esta","useful":1,"cool":0},"EaEk9_k_GAct1cya8Uczpw":{"text":"Do not be taken in by this filthy restaurant.  The food that was available, was inedible. ","useful":2,"cool":0},"J_SzKvsKRIJI_qEJqfOumA":{"text":"Of I had to sum up this place in one word, I'd use exquisite. We sat inside: clean, white ","useful":0,"cool":0},"m9sKc6zs57aPLJlT-LjiAw":{"text":"The ambiance here was definitely worth it - I came here for a close friend's bachelorette ","useful":5,"cool":4},"iphmra99pbTdMXyJ3yJjdw":{"text":"My friend and I landed in NOLA and we took an Uber straight to Two Sisters. With our lugga","useful":1,"cool":0},"1lWBufGG2LZ4s-rBXJQpNQ":{"text":"Nice setting but brunch food subpar.  Lots of cold options, some hot dishes not enough pur","useful":0,"cool":0},"v2QnB0YNp23UMux6Ge3oEQ":{"text":"I've been trying to get to the court of two sisters for the past year. Every time I tempte","useful":3,"cool":1},"85ILXD1TUYmvPHpfcXQ9Pg":{"text":"disappointed. the brunch food was mediocre at best. over priced and not worth it. the jazz","useful":0,"cool":0},"GnRdFX_oABrA179xbLXDKA":{"text":"Aesthetic is on point. Location cannot be beat. But the quality of food and service leaves","useful":0,"cool":0},"V8wLFtvzMF4CNKEIH7nqTA":{"text":"There is nothing worse than getting food to go and then not having any utensils included. ","useful":0,"cool":0},"9FTJ9RXnMP7ZxorWa-MJ1g":{"text":"The ambiance  for the weekday jazz brunch is very good and the servers were very attentive","useful":0,"cool":0},"aQToBLUaHcg2rEroxDE4Ow":{"text":"Patrick was our server and he was a delight.  He gave the ladies autographed fans.  The at","useful":0,"cool":0},"QYEcNXX9pL2-5Ew-AL4mPQ":{"text":"Disappointing. Sunday jazz brunch on the patio was so crowded there were super long lines.","useful":0,"cool":0},"OCMvtk73jWR_vyh5eMimpA":{"text":"I saw an advertisement for this place and it looked super cute and promised jazz music at ","useful":1,"cool":0},"NCcpmYPOmeoc1-14iGMQLQ":{"text":"We did the jazz brunch. We had a reservation and were seated immediately. Our waiter Brice","useful":1,"cool":0},"gpcQvz0K9kdGjPNTQDq7jQ":{"text":"Went for the Jazz Brunch. Enjoyed the ambiance; we had beautiful weather. Food is good and","useful":0,"cool":1},"uOYrbE3pCBuG1OXiXrJvAg":{"text":"This is a fabulous restaurant! The atmosphere is luxurious and the food is absolutely deli","useful":0,"cool":0},"QsmLPzm69EEN9H1JuqFsgw":{"text":"Food was good as well as selection. This is a buffet style restaurant decorated in a clean","useful":4,"cool":1},"RdhwWkpjO2ktMnCf95FG2Q":{"text":"This was disappointing!  To begin The entry and reception staff were less than welcoming w","useful":0,"cool":0},"npTcfpahmFncIF8e50Xmmw":{"text":"One of the finest dining experiences in NOLA! The beautifully lit, romantic outdoor settin","useful":0,"cool":0},"1aG8zVPZxUSHZOqlEHTLjw":{"text":"Two words.  Jazz brunch!  I'm pleased that I've got friends who know how to make a great p","useful":0,"cool":1},"ltdC2My4FuqUjTqAa1hw2g":{"text":"The food was okay, we booked a table for 11 to celebrate a birthday during our trip. Our w","useful":3,"cool":2},"z2t1vyrDVpmk6l_tBmjNow":{"text":"DO NOT EAT HERE! \n\nI should of listened to all the signs... but this place came recommende","useful":3,"cool":1},"VlUU0pwd4AiwUEG7jRv-jQ":{"text":"Loved the court of two sisters. Beautiful venue! In particular Damon was amazing. Incredib","useful":0,"cool":0},"tQYO0HqsvOEBOx9nJ2Fwrw":{"text":"While the outside area is gorgeous and the food being good, overall the experience is not ","useful":0,"cool":0},"wYQsWuhYrjooIhVnNoVdug":{"text":"We came for jazz brunch on Sunday. Unfortunately our reservation was at 2:30 and the jazz ","useful":0,"cool":0},"RywSKotmrPRASwy24WPG8w":{"text":"The seating area was absolutely beautiful with greenery overtop of us. My blue crab au gra","useful":0,"cool":0},"gEiG1ucEKzo9T69SjmZY7A":{"text":"Such a disappointment.  The courtyard is pretty. The jazz music was lovely.  We came in fo","useful":0,"cool":0},"2T28nIx_Sx69dpKWcacDIw":{"text":"Had New Year's Eve dinner at court of two sisters. The bar was great. However, we were sea","useful":0,"cool":0},"bXcNAlgJkMUCulEKj8gkEg":{"text":"I'm still sitting here and I have never felt so compelled to write a glowing review. The L","useful":0,"cool":0},"z5Dd5rnL5iJMhSy3eMHstg":{"text":"Was told that you need to get here right at opening without a reservation in order not to ","useful":0,"cool":0},"zR9ydlE6MgXG_CvdhEE9fw":{"text":"We can't recommend Court of Two Sisters enough. Just left after an amazing experience of d","useful":1,"cool":0},"oQ7jx2B1zuv1QQXq-7fOfw":{"text":"The dinner was wonderful and the table service excellent. Unfortunately, the person at the","useful":0,"cool":0},"H5rgTs-kq_A0olbWIGsXAA":{"text":"My friend and I were celebrating our February birthdays in New Orleans. As a special treat","useful":0,"cool":0},"MineQ40s38LMuZUOlxrzLg":{"text":"This place deserves 5 stars if they would just cordon off a section for groups. We were so","useful":0,"cool":0},"ipd0KJHQQTwKbL1tFBttog":{"text":"If you want to sit outside - make a reservation. That was my only complaint. Came in Sunda","useful":0,"cool":0},"F2iSEcSiUq8QmFoV0OM94g":{"text":"Went here for dinner with a group of coworkers. Venue is nice, weather is pleasant. Howeve","useful":2,"cool":0},"DRcsUuxqW6d0bAC2jQmyZw":{"text":"Terrible, terrible food. I had the BBQ shrimp and it didn't even look appetizing--it actua","useful":0,"cool":0},"_cq63VrCP-FcEHYpTRvlXg":{"text":"The head chef must be on vacation because this place, after all of the reviews we'll, suck","useful":0,"cool":0},"ZEh_p-ssGyPvxAbuRuATWA":{"text":"This was recommended by someone else but honestly I would skip it. We went for the jazz br","useful":1,"cool":0},"_xpvI1buq-Agh8OWi-Uvpw":{"text":"Damon was a fantastic server.. he acknowledged a birthday in our group with a dessert and ","useful":0,"cool":0},"FPt--rxkS2iQgV4MieMJEg":{"text":"New Orleans is full of history and historical sites. One of the best places to dine and vi","useful":5,"cool":3},"0XvYEzKJaxw1jgEJhIMS4g":{"text":"Sunday brunch at the Court or Two Sisters is a great investment of a lazy Sunday morning. ","useful":0,"cool":0},"l2I4U1ByK9lCIUgWo8-jhg":{"text":"The place was beautiful. The music was wonderful. The food was lacking. I asked for toast ","useful":1,"cool":0},"hEggRlbONw9-lXYj1im7KQ":{"text":"Wonderful live Jazz court yard brunch, amazing staff, great ambiance! They serve buffet fo","useful":5,"cool":4},"P9I5uLsoHd2aiSeeD4HUqA":{"text":"This restaurant was recommended to me by someone at home and it was amazing. I am not at a","useful":0,"cool":0},"lKe46wZ5J6m_Ngj79bMhvw":{"text":"Service was very slow and no one seemed to care.  Only saved by a nice busser who started ","useful":0,"cool":0},"bXENpeVuz2CMBicP-WyOYw":{"text":"Was here with friends for the brunch during our Immersion Weekend for Tulane Law.  I had b","useful":0,"cool":0},"vs20JETqH9bGIwvuAdYFfA":{"text":"Boudin balls with creole mustard butter sauce is outta this world. Duck wrapped in bacon i","useful":1,"cool":0},"6hNjqimmY-8RGbpZhwPYMg":{"text":"Always a great, diverse brunch. Fun atmosphere and great service. Highly recommend. My fri","useful":0,"cool":0},"U9DGyOSKkQ8KI5apNd5g_g":{"text":"Brunch was great. I had the seafood eggs Benedict and my boyfriend had the shrimp and grit","useful":0,"cool":0},"radCsRlj_yYa7ipwIUAGSg":{"text":"I had been hearing about Jazz brunch ever since I got to NOLA so I decided to give it a tr","useful":2,"cool":2},"G_JrNzV294U5zW98UtigYg":{"text":"So very disappointing....had been waiting years to visit this restaurant again and enjoy t","useful":0,"cool":0},"w0oINNDInbUHvO4rzbCWCQ":{"text":"Good food, very nice outdoor sitting area. Service was good as well. It is in the middle o","useful":0,"cool":0},"jaigHpWvCFLP_Tgmym7mqg":{"text":"This is the place to go for brunch!! Advisable to book, especially if you want to sit in t","useful":1,"cool":1},"GqwBQVsESPjXvOIBhj9Pxg":{"text":"Food was good but service sub par. \n\nWe had a reservation and came early. Sat at the bar a","useful":1,"cool":0},"l6BqWA24eQAyTxihI94rhQ":{"text":"The anti-superlatives escape me. This was a profoundly disappointing experience.\n\nCOTS was","useful":4,"cool":0},"-9XvO0_E1mwFnzkjO2EGPQ":{"text":"Great food, good service.  The live music was great and they have a really good ambiance. ","useful":0,"cool":0},"HId3XmWHZSAjgn81HRHjNg":{"text":"Great service, Beautiful atmosphere and amazing history. I must when you are in town!! By ","useful":0,"cool":0},"aFtHb3ZbWWhpMbHms0-CXw":{"text":"We came here for the jazz brunch this morning! The courtyard is so beautiful! Our server t","useful":0,"cool":0},"Eb9M0RxKv6OJDMLI7gyMOQ":{"text":"The courtyard is beautiful and the ambiance is fantastic. We have eaten here with friends ","useful":1,"cool":0},"8l8HQw29CPun6DzwE8GsbA":{"text":"This was a really nice spot that didn't have a wait time for breakfast/ brunch ( this was ","useful":0,"cool":0},"cX-6bppYEDAh41554bNnjw":{"text":"Pros: table side Caesar and wedge salad were perfect and full of flavor. Bananas fosters i","useful":0,"cool":0},"2gQamhRSBjNpvMB6PgFoRA":{"text":"After being told by multiple people we had to go there on our trip we did.  We didn't do t","useful":2,"cool":0},"31cTowXjtx9CFiZ8Xmzkfw":{"text":"Very disappointing visit.  Barely any service. Waiter's first time making Caesar salad or ","useful":0,"cool":0},"Zr-qVcNZDEVlEPyE3DA8vQ":{"text":"I have never trashed a restaurant in my life, but this place wins WORST OF NEW ORLEANS.  R","useful":1,"cool":0},"66k1I9YsvhKOMppaZnOhOA":{"text":"This place is a bit dated but amazing. So huge that sometimes the staff must be overwhelme","useful":0,"cool":0},"CS5UtuIiQlIunYplWHPCfQ":{"text":"Made reservations for Sunday Brunch on the recommendation of a friend. Sat upstairs in a r","useful":0,"cool":0},"OaJ1PDsEMeHdPFq8oiOdjA":{"text":"This is the most whimsical place . It is a true gem in the French Quarter.  Portion size o","useful":0,"cool":0},"izuYlVBfNXj4N2RBxp4eGg":{"text":"This restaurant was on Bourbon Street and it was very loud and messy so I would give the a","useful":0,"cool":0},"FKLyd2TPa3kJT5Rabrg7Aw":{"text":"Very excited to eat a nice dinner while visiting NOLA.  We were very disappointed.  5 meal","useful":0,"cool":0},"91yRm51JA-pSIimo41TLsA":{"text":"Damon made our visit to Court of Two Sisters so special that we are considering having our","useful":0,"cool":0},"gu9niGghLw0hByUz92q8QQ":{"text":"My second time here & I really enjoyed the food & the atmosphere. Love the jazz band & the","useful":0,"cool":0},"T9q8cdG_IA_OfyeqY1gJLQ":{"text":"Cream, butter, seafood. Everything tasted like \"forever on the hips\" but I have no regrets","useful":0,"cool":0},"zheCub_VNTAj5UPPGfFzUw":{"text":"Brilliant Brunch!\n\nIn the Big Easy - New Orleans that I was never a fan of - The Court of ","useful":3,"cool":0},"P_ctZKVlT_ylZ_f1R49Mdw":{"text":"Tried to go two nights in a row - first at 9:30, then the next night at 9 - they're suppos","useful":0,"cool":0},"QsX4BzXniP90LYz9NBC-gQ":{"text":"Had some drinks at the bar. Jon was our bartender and he was so funny.  Had us laughing so","useful":0,"cool":0},"i3CpLHVIfnAw7GvBSnyFNw":{"text":"Was here a while ago for a jazz brunch outside last March. Overall experience was pretty n","useful":2,"cool":1},"8ug1wqgKG7EJxXEg1tucEw":{"text":"We came here for dessert and drinks only, so I cannot comment on the food. \n\nThis place is","useful":1,"cool":1},"LVbkC0JvbsnQkHYcm4aG-A":{"text":"We had a lovely brunch on the patio. With live music it was a perfect setting. The waitsta","useful":0,"cool":0},"EhM3DHSXeNITOHENFFDYuw":{"text":"Stepped in for brunch. What a exquisitely beautiful hidden gem! The staff were all incredi","useful":0,"cool":0},"8MqEKWupqjQHvkJMb0NyMw":{"text":"We celebrated my wife's 70th birthday with a trip to NOLA. Our dinner was at this restaura","useful":0,"cool":0},"A8d43JEe53xll6uwXlXkhw":{"text":"Waited way too long even though I planned months in advance. So I never got to even see th","useful":0,"cool":0},"QXYdeHo0aUUzC5-DfDa0Cw":{"text":"Overall, I don't think this place isnt worth the trip - ESPECIALLY if you're a local. \n\nTh","useful":3,"cool":0},"RhaKwrm5nHea1ra99dnBNw":{"text":"The glazing sweet potatoes are awesome. The Redfish is very tasty.  Kim the bartender is t","useful":0,"cool":0},"I8UCw53q9tVwDqDx9T7SDQ":{"text":"Rob and Martina were our servers they were fantastic! The food was great but the service r","useful":0,"cool":0},"bS3B-Zl84n23F-19wAWf7A":{"text":"I loooved this place for brunch! Best restaurant I've been to in New Orleans. The fountain","useful":0,"cool":0},"0xt0zFUNUQrFmNulVudEFg":{"text":"The seating is really nice! In a very good location. The food was a little expensive for t","useful":1,"cool":0},"UjHfx0HkWLc_1jGRFrCj9A":{"text":"The ambiance of this place is beyond. We came for dinner and I absolutely loved our walk t","useful":1,"cool":0},"kD2kON-kyfZL356MOgGZsQ":{"text":"Was excited because everytime I come to New Orleans, someone suggests this place. It is pr","useful":0,"cool":0},"nX7A6MrQYEED5BWgQKZmtg":{"text":"What a delight! Was in town for a conference and a colleague recommended this restaurant. ","useful":0,"cool":0},"S1YadOFe_c9ZpIRGub73Qg":{"text":"After all of these years, we finally tried The Court of Two Sisters for the jazz brunch on","useful":3,"cool":0},"J1SAZbPNeBWEJDdBHdS08g":{"text":"I came here right when they first open for Sunday brunch to experience that fancy dining s","useful":3,"cool":2},"qLr02z6bVsPQSx0wX8cIEQ":{"text":"Meh. Expected more. Food tasted like it was all spiced or salted up to be more palatable t","useful":1,"cool":0},"o5wzRVU3ZkhkeWjLx0eT6w":{"text":"I have been here on multiple occasions and my very first was not what I expected but on su","useful":5,"cool":6},"LHR79_ZmGIdbOraUBiyyzg":{"text":"Came to Jazz brunch on our last day in NOLA with high expectations. For about $35 before t","useful":1,"cool":0},"PgQ6f4gFzYnomUY_T8tfsQ":{"text":"The atmosphere is gorgeous, too bad the food didn't match the expectations.  Had the revil","useful":0,"cool":0},"FCm2mKM_tpZtb_wyggC94w":{"text":"Have been here before probably 4 years ago and the food was fine. This trip not so much th","useful":0,"cool":0},"DNL0RDGbTwDkG3bAnjxrwQ":{"text":"Nasty food. Even nastier manager. \n\nService was slow. Gumbo came with rock hard rice. Othe","useful":0,"cool":0},"RXNawrrNuYHcOUatR2yCJg":{"text":"Tourist trap. Food is sub-par and the sneeze guard on the buffet was filthy. Please do you","useful":0,"cool":0},"3si_5EZg_rxXFJ-1U5xQ1g":{"text":"TRACY WAS TERRIBLE!! She is so rude when trying to order a drink for brunch and we tip wel","useful":0,"cool":0},"pcgUoox5jisJOEJP8qwr6A":{"text":"This is just an experience in itself. The courtyard is gorgeous and is just an experience ","useful":1,"cool":0},"iOdFC06RkciqvQG7pqqQSg":{"text":"The food is beyond excellent.  I haven't been to NOLA in years and this place is every bit","useful":0,"cool":0},"i8-hDV32d3TBL9gKUiXaSg":{"text":"Nice experience. Food was lame. Shrimp and grits were way overpriced and shrimp\nTaste toug","useful":1,"cool":0},"npPUD5zA6GZnKgXWHsBiRA":{"text":"I've heard of this place for years but I never remember to make a reservation and you alwa","useful":2,"cool":0},"Si3_NCzE0-moH0ZW5CSfRA":{"text":"This place is a solid New Orleans experience and a must if you are a brunch fan . Everythi","useful":2,"cool":1},"bKKwh8OS63Ao7k-v7PfBqg":{"text":"Absolute must! The ambiance, plus the remarkably tasting buffet really brought our weekend","useful":0,"cool":0},"L2xcKXvvnAjCT5Q3mzZvOQ":{"text":"Brunch in the garden courtyard at this historic french inspired eatery is everything you w","useful":1,"cool":1},"aUpH9EYCRGcE1HtL5VQaBA":{"text":"This institutional fine dining establishment has somehow lost everything that made it famo","useful":0,"cool":0},"1f2lgUeEiNCQw-PYiLTDuA":{"text":"Food was great I had the Veal Oscar and it had me licking my plate. Lol the staff was very","useful":1,"cool":0},"HgNHRlFfwmqmNSHbA3rSLA":{"text":"I wanted to like this place, but really I've had a better breakfast buffet in a hotel. It ","useful":2,"cool":3},"sa_rTQB0thuTTM25dSkqRQ":{"text":"First of all you have to make a reservation to sit in the courtyard - which is mostly the ","useful":5,"cool":0},"wKHPMaEuejkEjRATNnc3yA":{"text":"Definitely one of my favorite restaurants in NOLA. We loved the service and every part of ","useful":0,"cool":0},"ucZq0t-C3lmK21FKyiKLsw":{"text":"Wow!  I ate at Court of Two Sisters for the first time since Life Before Katrina.  So now ","useful":3,"cool":0},"pWILsZrfqzi4sgKRRmNXdA":{"text":"Just missed brunch on a Sunday afternoon...the place was pretty empty as dinner was just b","useful":3,"cool":2},"gEz3nDHANAOzyqlZ0YILZQ":{"text":"If you have the option to sit outside and the weather is bearable, I'd highly suggest it. ","useful":1,"cool":1},"a4NTaQ1XCIQLPz3gc0C52w":{"text":"The food is reminiscent of an outdated buffet with yellow and green stuff. It smells like ","useful":0,"cool":0},"fNqcGQYDL02xUFmZXrmdyQ":{"text":"If you intend to take your dog, call before you go and make sure that the patio is open.  ","useful":1,"cool":0},"146UTOauH21fny084EgaYA":{"text":"Not only is the food incredible, but the people really give this place its charm!! Damon r","useful":0,"cool":0},"lvmVTGa7hZtSD6rfECa-9w":{"text":"Brought visitors from out of state for Sunday brunch. Food was good- delicious turtle soup","useful":0,"cool":0},"r8OG73jtD-fXwjfOkWPfUw":{"text":"If you're coming to the French quarter you've GOTTA stop at Two Sisters. If it's a weekend","useful":3,"cool":1},"aOSSv0wA9OLD_T2RNCw1_g":{"text":"It's unfortunate that our experience 5 years ago was drastically different than our return","useful":0,"cool":0},"ZIBD67rukVsuPqqbnJdAJw":{"text":"One of the worst dining experiences of my life. My server Frank who was the most frazzled ","useful":0,"cool":0},"jtpQf6ci17BaFKWrkWJ2HA":{"text":"This was a quick find for us on a vacation and we were extremely pleased with it. Our serv","useful":0,"cool":0},"oUPGtd1Lsnxwp8HSvVJUuw":{"text":"We had yet another visit at 2 sisters on Sunday morning.  We have been several times and t","useful":0,"cool":0},"H5SCq4IFoZ_f0m05wGjOWg":{"text":"I recommend that you go early because this restaurant is always sure to please and draws a","useful":1,"cool":0},"0JTc8RRdy-EQfKcba27RZQ":{"text":"Without a doubt this is a lovely place to have brunch/lunch.  It was a nice day in Novembe","useful":1,"cool":0},"qPKHbsEm-9vkOK3Goh0kDw":{"text":"Great food and brunch. Walking out we stopped for a beer at the bar. John the bartender is","useful":0,"cool":0},"0tRJZyKBDKfdbpE2JiC4HQ":{"text":"What a lovely place for a more upscale dinner in New Orleans. We made reservations for an ","useful":1,"cool":2},"dqoqxCZ_TI2c8xozfdaCog":{"text":"This is the second time I have visited this place..specifically the quaint bar area. Alway","useful":0,"cool":0},"rhkYaPfhvOt6um0MdT19Xg":{"text":"We had high expectations but they started to fade within about 10 minutes of arriving.  Be","useful":0,"cool":0},"7BEO2oXTxkvuwhXmaSo3dg":{"text":"Amazing brunch buffet !! Brice was an amazing server our experience was awesome and food w","useful":0,"cool":0},"FK7JHpe88od0cMR9Oi9VUA":{"text":"We planned our trip to NOLA almost a year ago to celebrate our 5th Anniversary. Friends ha","useful":3,"cool":2},"2hqzAcJ3n_9GCer_INP4zQ":{"text":"We were excited to eat here.  We arrived at our reservation early so I went to get drinks ","useful":2,"cool":0},"BgxtCCWTRLVbSqi-Tdqhaw":{"text":"We visited the Court of Two Sisters this evening and completely enjoyed ourselves. Servers","useful":1,"cool":0},"40CdYaJLgkzWsm9g89G1zg":{"text":"Dined inside as it was too hot and humid to sit in courtyard which, I'm sure, skews this r","useful":0,"cool":0},"sQ6c1hUoiFQbKtLMzPlTTQ":{"text":"Took 2 hours for us to receive our food. Tables were empty around us, not sure why it took","useful":0,"cool":0},"Au-mNpgQjIlnAd4c4qsXmg":{"text":"I made reservations for a myself and a group of friends to eat here for dinner during a gi","useful":0,"cool":0},"MdzQOxemjuekc0FfnXugqg":{"text":"We came for the jazz brunch while we were visiting New Orleans on vacation.\n\nEating cajun ","useful":1,"cool":0},"m5jJ8ZpPoOPm5SpdCaaybg":{"text":"With the understanding that covid might effect service, but not food quality. Appetizers w","useful":0,"cool":0},"DGWbkv9EXAFRYG2E5S4zgQ":{"text":"Court of Two Sisters\n\nCourt of Two Sisters - 613 Royal St., New Orleans, LA 7013 -Beautifu","useful":0,"cool":0},"F-VsDRhCBiUgsUu8lpmd3A":{"text":"Food was very good, our server Steven was very good. Atmosphere was beautiful. We came in ","useful":0,"cool":0},"sR0ewsIw-pE5HVw4rQCJ0w":{"text":"There was so much food-  buffet style. There was almost everything that you can think of; ","useful":0,"cool":0},"7M4GvJaaseLj9K94s7qLLg":{"text":"Lovely being here . The food was amazing and our waiter was so kind and sweet ! If im ever","useful":0,"cool":0},"g-6qdjN5GfNuhegFuipoqA":{"text":"We walked into this place to grab a drink while shopping! There were 7 of us girls for a b","useful":1,"cool":0},"kHMsHVeNMU64uMw7Z5ujGg":{"text":"Court of Two Sisters is one of my all-time favorite New Orleans haunts.  The food is good ","useful":10,"cool":5},"3DRgECuXCCyVrwK-VupUEw":{"text":"Always good cocktails, and a nice buffet. Jon the bartender is a venerable gentleman who h","useful":0,"cool":0},"SJFrXBHBHJ0Y5_VaEO3I0Q":{"text":"Despite our plane landed later than expected, we managed to make our dinner reservation at","useful":5,"cool":5},"cqzAOO5ywHgE_NITXg6zzQ":{"text":"After extensive research, asking both local residents and many of our oft-travelled friend","useful":4,"cool":0},"e4Xl1eMaAO9pI8FRFLYviw":{"text":"Absolutely not! If I ever come to the French Quarter again, this restaurant is on my \"Neve","useful":1,"cool":1},"tYTc9O-PxrrSzKrOeA0ejw":{"text":"Like their backyard  seats, it shows the nature and garden . Servers are so nice. The food","useful":2,"cool":2},"b2dXy3_-tMAW6smw7pWlEw":{"text":"The Court of Two Sisters!! Just wow! The whole jazz brunch experience here on my trip to N","useful":1,"cool":0},"bC74Jm-mD-_q9VxkQebRvw":{"text":"I first ate Brunch at this place several years ago (around 2011).  I loved it then.  The f","useful":0,"cool":0},"l1Yo5aD_i9z37V-FXzl8_Q":{"text":"The meal was awesome. We ordered the the veal Oscar and rosemary chicken. Great service, g","useful":0,"cool":0},"eXVAc08W4iDKj3I02qRm6A":{"text":"The brunch is about 4 things\n\n1 -The free mimosas\n2 - The great service - service was real","useful":5,"cool":2},"TyQf5J3c3ckLRF1sqP0INQ":{"text":"Highly recommend. The staff and food is phenomenal. I would recommend the Chef's menu. Whe","useful":0,"cool":0},"Bc2KPI2va332aOxdSI65bA":{"text":"I booked here after a few emails to warn them of my food allergies; they were gracious and","useful":0,"cool":0},"llhUdh_VE-TPEvjW5Jl0Zg":{"text":"Ate here a few years ago....the food was okay, although spendy.\n\nHowever, I had the banana","useful":2,"cool":1},"UBV9tP2SmRAIH9liCFLA6Q":{"text":"Went here for my birthday brunch. Boy, this was so fun. We sat in the middle and they had ","useful":2,"cool":2},"554jPK1b24y8_ZQg0Pyk0w":{"text":"Sure it's aesthetically pleasing inside, but it's a total ripoff. The \"Jazz Brunch\" sounds","useful":0,"cool":0},"Zy_vK0OaroZdbRhE11npWA":{"text":"Tourist. Only come here if a tourist wants to. Service is subpar. Food is pretty good. Dri","useful":0,"cool":0},"DOAafdy9OaeYpINL-U-r4A":{"text":"This spot was okay ... was a little disappointed with the food. The atmosphere and courtya","useful":2,"cool":0},"bm86ixEO70ftRsKTFwU31w":{"text":"This was our second trip back to this lovely Buffett and courtyard. Incredible service. Da","useful":0,"cool":0},"kyPN2CgQnza47RCjSzquHg":{"text":"I had the Sunday Jazz Brunch at the Court of the Two Sisters in New Orleans, LA on 2/9/201","useful":1,"cool":0},"POlMmqcMip-Cm70YsXl3Mw":{"text":"Holy shit.  Cockroaches roam freely in the hallways while  food is expensive and mediocre ","useful":0,"cool":0},"0qABKrYnbw9T9Jn3yQma-A":{"text":"Location; super cute place in the heart of Bourbon Street! Huge dining area with inside an","useful":0,"cool":0},"6SE_nxTQ3MU6yRhqBiJudg":{"text":"My brother and sister-in-law gave me and my boyfriend a gift card for The Court of Two Sis","useful":10,"cool":8},"9vLPgWaQ2CeGeSVGzoA-Jg":{"text":"Food was amazing and the service was even better!! New favorite spot! The outside area mak","useful":0,"cool":0},"hhNtpAPGi__v_8zGlbLvgA":{"text":"Let me start off by saying, I love court of two sisters. This place has always been my gir","useful":2,"cool":0},"IJW50CALxcasWZ9K7B-VMQ":{"text":"The food is good, in general. The variety is good. They have lots of options. The biscuits","useful":1,"cool":1},"qUEuc5ZhoNILGrbHOZjx4g":{"text":"Celebrated the birthday of a Sweet friend & Damon made our experience so special. We were ","useful":1,"cool":0},"sJMjpQGtVmFJ8arPMqLbyQ":{"text":"This has fast become one of my favorite restaurant in NOLA. We are there on two different ","useful":0,"cool":1},"KlXv5YB_6_XSm1s9Yq8WhA":{"text":"I never actually got to eat here because the hostess mishandled  my reservation. My wife a","useful":5,"cool":1},"Na_h0cL-OhIy2vN5dPakxQ":{"text":"Disappointing experience here, I'll say in part because the courtyard was closed and we we","useful":0,"cool":1},"ws8TKE6QHPi_zPYmXrdTxA":{"text":"Ambience is incredible but food is not. Duck was over cooked and everything had way too mu","useful":0,"cool":0},"PdeDmO8xMzPn_GIFHfJBdg":{"text":"My wife and I were raised in New Orleans and left in the 1980's. We come back at least two","useful":1,"cool":0},"bQbZbjKrIH0APbpR7lWrYw":{"text":"We love to come to the Jazz Brunch.  I find buffets at the nicest of restaurants may not b","useful":1,"cool":0},"Cez_NjFrYMPNiGC4q0TPUw":{"text":"I visit this place for brunch every trip I make to NOLA; trust me there's been many!! Toda","useful":1,"cool":0},"5tBqKEn5k03y-dLJlOBxbQ":{"text":"I've been here on two separate trips to NOLA. It is a must go every single time. We make r","useful":0,"cool":0},"nMqsoC-Btj3I75dmE9jPlQ":{"text":"Historical yes, worth the cost for brunch no.  If you want brunch find a different place. ","useful":0,"cool":0},"FnMIjmmTCKUqx33KnqOuaw":{"text":"+Beautiful courtyard with relaxing atmosphere.\n+Talented Jazz musicians\n+/-Staff: either c","useful":9,"cool":8},"TF2TMv4X_O98UR2FKDtuyg":{"text":"We had Sunday Bruch before leaving town to return home. We had reservation and walk right ","useful":0,"cool":0},"cknIR8jsfuS4MQXmSB93_w":{"text":"Made a reservation here for EAster brunch .. we sat in the courtyard . It was a beautiful ","useful":0,"cool":0},"uOP0ztbU6DOvlb-3L6NTeQ":{"text":"Excellent food. Live music. Fun place for a group brunch !! Staff was friendly. I recommen","useful":0,"cool":0},"IpLue_IgGPofpyMzIB-LTA":{"text":"this place had the best vibes and hospitality. the live jazz brunch is a must and everyone","useful":0,"cool":0},"eqm5im1qevILn-4J_1IjQw":{"text":"Just kind of meh. The beautiful courtyard all lit up at night and the ambiance really save","useful":0,"cool":0},"b1UYK0z8EkHKG-lWwpmK9A":{"text":"My mother and I decided to come to this restaurant because they offered a Live Jazz band d","useful":0,"cool":0},"VMeW2C4gQgE6NNpgOezP5Q":{"text":"Avoid this restaurant at all cost. The food is a loser.  The service us below substandard.","useful":3,"cool":0},"4hvf6RgLCV9uOrFmeOX7og":{"text":"Brice is fantastic !! He will bring you finger Water to combat that hangover and keep you ","useful":0,"cool":0},"CpoTgPJ2aMZWv3rhPH_8jA":{"text":"Beautiful courtyard, drinks and food were so so. We went for the jazz brunch and barely he","useful":0,"cool":0},"tkU1zd3hgQo73eaFaNF1kw":{"text":"I have heard such great things about the Court of Two Sisters, so I had very high expectat","useful":0,"cool":0},"ZVBjgUc9hGwt3Jmpo5gY3g":{"text":"Food is overpriced and inedible. Don't bother, you are paying for atmosphere and in 100 de","useful":0,"cool":0},"0n7aqFq7Y-PoYdyrLyqi8Q":{"text":"To this day still my favorite restaurant I've ever been to. I went years ago when I was vi","useful":0,"cool":0},"KyW6BOzGIX_9Od0cemKZ1w":{"text":"Court of Two Sisters is a tourist hot spot; however, it is not worth the money!  Years ago","useful":0,"cool":0},"W-DD_hQg8X9yfj806UWQpQ":{"text":"After reading all the phenomenal reviews about this place, I decided to make this our firs","useful":1,"cool":0},"mvE37fWHAUxG-Cm_d6aGTA":{"text":"We've been so looking forward to coming here,  and even tried to make an earlier flight to","useful":0,"cool":0},"aubLako1RsO7rLFZ2QRcxw":{"text":"We reserved a table for Sunday Brunch buffet. This was a little later in the day and turns","useful":4,"cool":0},"pBgrCiTB6Zg9TUOTA44Tvw":{"text":"I've been putting this review off...I went to COTTS in August for the Jazz Brunch, have be","useful":1,"cool":0},"ymn4QgKZSYuGK5zgXE-4Iw":{"text":"Don't do it. \nThe hostesses were pleasant.  The manager was helpful, but as soon as we sat","useful":0,"cool":0},"OV8Dxh-8H6TNfX4q6UBNgw":{"text":"Nice, older place. Been around for many, many years (my mom ate here 50 years ago). \n\nNice","useful":1,"cool":0},"HjoH5OpdjX2oaFRYDjkLOQ":{"text":"Good food with minuscule jazz. Breaks for musicians were longer than their sets. Good buff","useful":0,"cool":0},"-TVy9ZNwLdNNQSAlJidTug":{"text":"Damon at the door was so great!  He had free drink coupons but that was for everyone!  But","useful":0,"cool":0},"-WAwmtrFrVzZtgmH0t5y1w":{"text":"Great food and brunch. Walking out we stopped for a beer at the bar,John the bartender is ","useful":0,"cool":0},"C-IJyRtlEGd7BOyikZhrsQ":{"text":"My mom visited this spot in the 1960s & brought me here in 2019. According to her, not muc","useful":1,"cool":1},"zxe9JCSS-jau_0nshU_ikw":{"text":"Of course we had to go to the jazz brunch at Court of Two Sisters! Tasty food and the musi","useful":0,"cool":0},"3N0sqZejpFLVoKwbHK-F3w":{"text":"Worst experience in Nola. Seated us as 2:30 for the buffet and took the food away at 3:00.","useful":1,"cool":1},"jLkGW3hddRCQY3tJC1RX4Q":{"text":"While planning my trip to NOLA, this popped up as a \"must go to\" place & I beg to differ. ","useful":3,"cool":0},"zeGmhar-7EeEGIhEwHWiUQ":{"text":"James S. was our server and he was amazing. We came from Texas to try this restaurant and ","useful":0,"cool":0},"TSDiZcZbndK_KOvIe_tpqA":{"text":"Promptly greeted and seated in the courtyard near the wishing well. Very attentive staff, ","useful":0,"cool":0},"yxQlWAbNzEj8HVvUjcLjSw":{"text":"Atmosphere fantastic! Service great. Limited menu for breakfast items... more brunch savor","useful":0,"cool":0},"QEBYHYzYpV7lWcaFXMYKyQ":{"text":"Excellent place for Jazz Brunch on a Sunday!  We had a large party and the servers were am","useful":3,"cool":1},"IlgC87xRw0-Wxf56Fs0rgw":{"text":"What a wonderful experience. The wait staff were friendly. The food was good and ambiance ","useful":0,"cool":0},"iKYjAbWpLMB_5JqlV8zFFA":{"text":"Made reservations 24 hours in advance online.Most times were available except for 7:00 p.m","useful":0,"cool":0},"HAkRaguDi3csFwwOUxTWxQ":{"text":"I came here on vacation to NOLA. I came for the jazz brunch. I'd like to start by saying t","useful":0,"cool":0},"fzGcwCzSOv_1rLRg89BvRg":{"text":"Had a party of 14 for a birthday dinner.  Staff was great, ambiance was fantastic and all ","useful":1,"cool":1},"WJGfIxxbLheYlUDiFNE3RQ":{"text":"The jazz brunch was a nice treat after a busy few days of Sugar Bowl festivities. The buff","useful":0,"cool":0},"KEttDihPXNCPwrk7G2rLEQ":{"text":"Traveling companion booked a brunch here for our last full day in New Orleans. It was defi","useful":0,"cool":0},"5CIewAZ2GGwbyNiLpgpNOw":{"text":"This place keeps its 4-star rating in my book. Again, not the best food. It's a buffet. Bu","useful":1,"cool":1},"vC3kjwspiOD4LOdRdBNQng":{"text":"Having just arrived in New Orleans, we choose this place because it had a patio and advert","useful":0,"cool":0},"8Tiiq2UkTMSYwKWzfi-4jw":{"text":"Jazz brunch buffet is fantastic! I brought my mom for her birthday and the band came over ","useful":0,"cool":0},"zhbwjHOU-YdDt2nnfhRILA":{"text":"Best brunch and best service. Damon (our waiter) delivered impeccable service!  Highly rec","useful":0,"cool":0},"bl2fS8mx8wkGn22vCbziIQ":{"text":"Lol... I just have to chuckle a bit. I feel like we were lured into this spot by a street ","useful":2,"cool":0},"g7DeeIMIegggYxfYxWjHfw":{"text":"Service was great. Shrimp and grits were amazing. The turtle soup was delicious. Will be b","useful":0,"cool":0},"OtyhS47Y5asKP56qxCpHEQ":{"text":"Brunch at The Court of Two Sisters was delicious! The eggs benedict was pretty good, and I","useful":4,"cool":2},"R756oWM-aKvQ9juGOmS24w":{"text":"Place will scam you. We went for the jazz brunch and for 3 people, the check was $120 exce","useful":0,"cool":0},"7mxVjrQMbfJsZufZj_hZpw":{"text":"This place is all about the ambience. The courtyard is gorgeous and the jazz was great. Th","useful":1,"cool":0},"StN6pHN8kdqKS2U7BHFPOQ":{"text":"The food was excellent and the music added a great ambiance.  The waitstaff was divided be","useful":0,"cool":0},"reGMImAbPrMjQYmQf9k1-w":{"text":"I've never even heard of this place but we got some reservations for our Sunday Jazz Brunc","useful":2,"cool":2},"xe3ForvTlO0Fbn2sGvncDg":{"text":"This was a great restaurant. We went on a Sunday and were able to do the jazz brunch. We h","useful":1,"cool":1},"ynnKGc52c3uQQnMQTDQVxg":{"text":"Incredible service and amazing food! Visiting from California and this was on our list of ","useful":0,"cool":0},"ArCYE2N3A8xGdyBKwL4Kgw":{"text":"Was pretty frustrated disappointed in the overall experience. First off..... Who runs out ","useful":0,"cool":0},"j16lqiZBBhaO9oFHvOsC5Q":{"text":"My wife and I were seated directly next to porch umbrellas that were closed.  The one next","useful":0,"cool":0},"Cs2HKNhX7aam9D8EmrUFng":{"text":"This spot nestled in on Royal street is fabulous. I highly recommend asking to be seated i","useful":0,"cool":0},"HN_i8NAlIEFdgo-UBUkQ9g":{"text":"Ambience was wonderful, all women WEAR FLATS for the courtyard just heads up.  The \nDuck i","useful":3,"cool":0},"8ioBOneMZE1mCLrvlv1ecg":{"text":"My husband and I had a brunch on Wednesday. The food and live music were fabulous! Loved t","useful":0,"cool":0},"u_lyDPM28MinHaKfRTU-xg":{"text":"When it's buffet style not much can go wrong! I went for the brunch and my oh my I didn't ","useful":0,"cool":0},"3j1iDM2gKHC8lylQDuf9kA":{"text":"This place is a little pricey, know that going in. I had the Sunday Jazz brunch with some ","useful":1,"cool":1},"QJ_FXFdZ-7anGPPWoee6Hw":{"text":"We came for dinner at 8:30pm on the first Sunday of Jazz Fest week 2019.  I make reservati","useful":0,"cool":0},"iVHzK4_56GOOAbeCoZZ22A":{"text":"This place is AMAZING!!! They have a great atmosphere, great food, wonderful staff, all ar","useful":0,"cool":0},"JbjTBa0_RajJEHV8gmAfzQ":{"text":"Cool history great service, food was meh for a place with so much hype around it. I've had","useful":0,"cool":0},"_e_ioJtGS7f3NJ1dVFVndw":{"text":"We have come several times over the past 40 years. It is not up to the old standards. Entr","useful":0,"cool":0},"TkL-ieCmKsGtJnTaNGmxsg":{"text":"The staff is friendly for the most part. Although our waiter wasn't horrible, he wasn't am","useful":3,"cool":2},"G58YJB_wBGZj1oGAXgVFrg":{"text":"Visited the Court of the Two Sisters tonight for dinner.  Plenty of room to sit outside or","useful":0,"cool":0},"azCJ2FNsQ_sZCkjcREpr8Q":{"text":"I was really looking to the jazz brunch on my first day flying into New Orleans. Due to a ","useful":0,"cool":0},"3ngjnKh3vuY3uaL8XdYH2w":{"text":"Another New Orleans favorite of mine. While I missed having the brunch buffet, their brunc","useful":1,"cool":1},"CxJ55c04jwIUJW3SzhyRtg":{"text":"Get a seat out in the courtyard!  Sunday Jazz Brunch is a treat to remember! Atmosphere, s","useful":0,"cool":0},"O-dMd9adRx22alsABz_blA":{"text":"I know it looks like I love every place but the truth is I have had good luck with my choi","useful":0,"cool":0},"QSXWXetlagFxNvUfrkO6nQ":{"text":"The best restaurant I have been in New Orleans. Beautiful garden, good service and live mu","useful":0,"cool":0},"D2FD87VjKEQVNdBNZmhD0w":{"text":"The best part about this place was that the courtyard is an awesome setting for a night ou","useful":2,"cool":1},"sNhysSBdYnmhKPwRX5lZvQ":{"text":"Make reservations. They do not take walk in during the time we visited April 2021. Ambienc","useful":0,"cool":0},"PlCNhmbxFm2ZhEqEs_2I6A":{"text":"Started with a Bloody Mary, the right amount of spice! The buffet had endless options from","useful":0,"cool":0},"Tzqc4uUPwBUajngNj2lkDg":{"text":"Jazz brunch here is overrated. I read up and down reviews, but decided to go for it to exp","useful":2,"cool":1},"qE_OuTer4Oy7WXmEeBJalQ":{"text":"I would normally give the court of two sisters 5 stars. Right now due to Covid the buffet ","useful":0,"cool":0},"qCSmHLiZstg73t2EXjc6RQ":{"text":"My family has eaten here on special occasions for many years and it continues to serve won","useful":0,"cool":0},"tie2F20Q5mGhRNu6PpjAkQ":{"text":"I was actually excited to go here for breakfast this morning . I had eaten here years ago ","useful":5,"cool":4},"V36EnACB4qpmJIWNO6NcDw":{"text":"We were not impressed with this restaurant. We came for an anniversary brunch and even put","useful":0,"cool":0},"b68VmUYycdtKmELF_fTyHA":{"text":"Breakfast brunch was  disappointing. Champagne was warm. Beautiful ambiance and jazz music","useful":0,"cool":0},"QV2xp3Uu63wjHjxK3paLGg":{"text":"Delicious food and great service! Everyone had masks and the tables were socially distance","useful":0,"cool":0},"F_oa9VHD14qEZODf4TlxOw":{"text":"This was our last meal on our family holiday trip to Nola.\n\nThe service and atmosphere are","useful":0,"cool":0},"JBf44aE6AoG-7lJBdns0lw":{"text":"What a great place first we are going to sit in the courtyard outside but it was too warm ","useful":0,"cool":0},"jpu3dc6xw2SIOYg91uTwJw":{"text":"Not impressed. The food was nothing great and the portions were small, especially for the ","useful":0,"cool":0},"yhfzjrINyK5n8HMy9LuyUQ":{"text":"We had dinner reservations here on Memorial Day and were seated out in the courtyard under","useful":1,"cool":1},"ldxXvVgFOVPxP5wDx0CHaA":{"text":"Another excellent dinner at this establishment! Same table as last time and great service ","useful":0,"cool":0},"AyyLsR-xFNa5Nc-x6Z6KoA":{"text":"My husband and I went for the jazz brunch. We were sitting outside to eat in a beautiful a","useful":1,"cool":1},"hzH-ckUWg_smS_7EYOyETg":{"text":"Went for dinner not the jazz brunch. I guess I'm spoiled with good service because The Cou","useful":0,"cool":0},"YWfSXJrdbbnYoFxjB7JrvA":{"text":"Came here for Sunday jazz brunch. \n\nWe were seated in a corner of the courtyard, so we cou","useful":8,"cool":4},"w24cYZ4urVPp9U8n6oD0Kw":{"text":"You can't go to New Orleans and not eat here. It is, by far, the best brunch in the US.","useful":0,"cool":0},"PDf_N1jWRIS0_OG3KAtgrA":{"text":"I understand this place has history, it's situated in a nice courtyard, but the food is no","useful":0,"cool":0},"SoK5hEu6tdcO1y9PtES3uw":{"text":"Our tour group went for brunch today.  Wow. Amazing food selection.  Exceptional service. ","useful":2,"cool":0},"yisLvJqs_-coe6psEgdnrw":{"text":"Food isn't worth the $32 per head, there are so many great place's to eat at in the area, ","useful":0,"cool":0},"KAAMavn3YNrEASPzzpPOGA":{"text":"We visited here almost 20 years ago and are so glad we came back today for a return visit.","useful":0,"cool":0},"ZROeu6uqvlvR2kiKRuyg2Q":{"text":"Made a reservation for Easter brunch...wasn't going to comment until I saw someone post ab","useful":0,"cool":0},"F6VidhWfixaYupTtUp1ceA":{"text":"We were on a waitlist for another restaurant and while we were walking around the city wai","useful":2,"cool":0},"tQJexZya5PJuUVnliTPl6w":{"text":"DO GO FOR MUSIC, AMBIANCE AND SERVICE\nDON'T GO FOR THE FOOD... Arrived @1130 for brunch bu","useful":2,"cool":0},"qbFakrH-e9Y4oxDG1eR6CQ":{"text":"I have lived in New Orleans for about two years now and finally decided to go eat at this ","useful":2,"cool":0},"Y25ZD9M8lN9TUpjbZCtjFA":{"text":"Good place for food and drink when you are in the Quarter. You can either enter from Royal","useful":0,"cool":1},"tvPVuNQDFghWZuXbnwi8_w":{"text":"The grilled alligator sausage was the best, escargot was good but there were a lot of mush","useful":0,"cool":0},"OcTfvqSTvcOfeJ7onSO5sA":{"text":"Came to visit for the weekend and lucked up on this place for brunch. It was Great service","useful":0,"cool":0},"ANJuncH1jSQboH7KzyZAYg":{"text":"We were disappointed on this visit to Court of Two Sisters. We were seated and drinks were","useful":0,"cool":0},"42wlSVLQ1KNl22fZmoQSvw":{"text":"Out of all the places we ate in New Orleans this place had the most ambiance and beauty. L","useful":2,"cool":2},"_XQL4J62ZoZ1Qf2CQ5p1_g":{"text":"Fantastic atmosphere.  Roland our server was excellent.  We ordered the Reveillion Menu wi","useful":1,"cool":0},"ax_Yi_8SLRuG899FZy2-cQ":{"text":"A tradition for my family starting in my dad's childhood over 50 years ago, this place nev","useful":2,"cool":1},"fH02Z7DFOY8fo-F2qu6E1w":{"text":"I went to brunch to the buffet so make a reservation and enjoy sit out on the patio. Food ","useful":0,"cool":0},"3Yumcuhb_nVEwpEg7SAT8g":{"text":"Maya and Lashanda were our waitresses, and they were amazing! Maya was friendly, helpful, ","useful":0,"cool":0},"vT8K_pZTZudkIpMke0upLw":{"text":"This place came recommended from a few people so we decided to give it a try. Yeah, it was","useful":5,"cool":0},"9zezGvpbOzsjRVrLXVs6jA":{"text":"Mr. Grey made our experience! We sat at the front bar and I don't think I've ever laughed ","useful":0,"cool":0},"ltdbC4B-hP5J64WJiEWylg":{"text":"Always a great food experience for Sunday brunch, in the beautiful courtyard. \nI had a bra","useful":1,"cool":1},"YfySY3Horr4V6p7J7oIDlg":{"text":"I was here on Ash Wednesday 2020 (the day after Mardi Gras). I joined friends for a final ","useful":2,"cool":0},"4zb1fEdyI9IpnPqMRNC46g":{"text":"Wow!  A local directed my friend and I here for Sunday brunch.  I have to wonder if I did ","useful":0,"cool":0},"kVW0ZT2jKGpRy_qmdsZldg":{"text":"We loved our time at the Court of Two Sisters! We ate outdoors and it was absolutely beaut","useful":0,"cool":0},"nvYGK4CA6vmzzuZW5q6q1Q":{"text":"I loved loved lovedThis place !!! Food was amazing  service was outstanding!!! We were hel","useful":0,"cool":0},"wJT4z2gmEoLedQGWiuODtw":{"text":"After a long day of walking the French Quarter, we made our way down Royal Street to the C","useful":0,"cool":0},"addOoQczWMKPhTmurarzHA":{"text":"That was....unbelievable. I've been coming to the Court for years, and I am very sad to re","useful":1,"cool":0},"rOBJtmV9ejbcPnAY7xRrkQ":{"text":"My wife and her boss had dinner here last night.  They selected this restaurant based on a","useful":0,"cool":0},"7ndar0fVdI4gqQSYdOmxHQ":{"text":"Came to the Court of Two Sisters during our vacation per my coworkers recommendation.\n\nThe","useful":4,"cool":1},"Gf0_HY7A1sZEjNoFkA3u-A":{"text":"Decent food.  Ordered multiple appetizers and one came 20 minutes after the others.  I ord","useful":0,"cool":0},"X0efaufMN_T0ikupILQTfQ":{"text":"I wish ZERO stars was an option. We came with a decent sized party after our wedding. The ","useful":1,"cool":0},"zXFMg_vTYAw66Q5bEDeUGg":{"text":"Absolute amazing experience. Damon catered to everything we could have wanted and surprise","useful":0,"cool":0},"jeCjjrPoj7UYC-xBAZoXAg":{"text":"I had the duck confit and the bananas fosters. It was gorgeous outside patio atmosphere wi","useful":0,"cool":0},"LgMGIpPHWe2FHRSlvaOVbw":{"text":"Please excuse my small delay in posting my review.  Yes, I had my 14th birthday there on A","useful":0,"cool":1},"XnBBACQtgdxsA37-U1ngYA":{"text":"Had this spot on my radar for brunch during our visit and made a reservation for 10:30 Sat","useful":9,"cool":6},"CKJbbrv2MlM3JMkohrIfCg":{"text":"I never tried this restaurant before on my many trips to New Orleans because I considered ","useful":0,"cool":0},"yaLHnAeY-dYjF0XSHviVWA":{"text":"This is a must if you're visiting NOLA. Their buffet style allows you to try all the class","useful":0,"cool":0},"J_svW3oQhfJeUN7d7YIVPQ":{"text":"Sunday January 17, 2021\nWe had a delicious Sunday brunch at the Court of Two Sisters on Ro","useful":0,"cool":0},"z1IuTRKwUsgbu84zw3xG2g":{"text":"Loved the food, and the service. The Abita Ambers I ordered were both expired, but life go","useful":0,"cool":0},"4HTkz_f7diPArRU_o_NEiQ":{"text":"Our server Asia was amazing ! Very attentive and super friendly. \nWe ordered the shrimp an","useful":0,"cool":0},"lHze8J4nkToq-Wp17JytGQ":{"text":"Hands down the best gumbo in all of Louisiana. Just the right amount of seasoning. Bananas","useful":0,"cool":0},"Q3nPAaLlhlxl03c95IU6Bw":{"text":"We recently held a wedding reception here. The entire experience was perfect. The staff,fr","useful":1,"cool":0},"Yn4dUnEHpWDUby7w0oql0w":{"text":"I'm really sad to give this place so few stars, because the outdoor seating is gorgeous an","useful":2,"cool":0},"y47iGMo5mu5-zp72Yf92QQ":{"text":"I am surprised by some of the low ratings here. It's a buffet, folks. It's not likely to b","useful":3,"cool":2},"xKC_UmhiNY_Xeo_NIuUCWA":{"text":"One of my favorite spots in New Orleans.  Sure I'm a tourist, but the ambience, the great ","useful":0,"cool":0},"NYUxHVru0uSBsk7J9SVLkQ":{"text":"Holy underwear batman!!!!!!!!!!!!!!! We went here on a Sunday for the Jazz brunch after a ","useful":13,"cool":11},"KmyvmHQ_QP1T_lQK-w59gw":{"text":"To be honest, the food here is really just soso. During the lunch time, people need to wai","useful":0,"cool":0},"r-zeIL3ZSCd5l3n0kyEzrQ":{"text":"The ambiance was great and the service was amazing, the food?  Not so much.  \n   First the","useful":0,"cool":0},"QFU8sU20jVkTiEES3PKFdg":{"text":"I cant say enough about this magical place. First of all, the manager, Ben, was the most g","useful":0,"cool":0},"vnO2ByDNiiJ9yKc9bsfB0w":{"text":"We had a horrible experience. Several people ordered the gumbo and discovered the rice was","useful":0,"cool":0},"Ca4fSfc_vgBAvWSqmjDLbQ":{"text":"Service was good -  Asia did great\nBut the food was not good - and for $33 a person, you w","useful":0,"cool":0},"DOMQIDkF6ZdGVvDiaZ3hCA":{"text":"I've been here a few times and I'm never disappointed. So glad they brought the buffet bac","useful":1,"cool":0},"D29grlWYWX8QKD5G2gCx2g":{"text":"We stopped in for a quick meal and had the shrimp and grits and bananas foster.  It was go","useful":0,"cool":0},"yIa3-LfLDn9gBdriqkZ7Ag":{"text":"Back patio is a vibe. Live music. And brunch buffet had a good selection. They were also v","useful":0,"cool":0},"LcxZONfK6R9ic62tOBo6VA":{"text":"I've seen pictures of this beautiful place and had to check it out. My friends and I came ","useful":1,"cool":1},"3CjciL3PJh-krFekmqi5rg":{"text":"The atmosphere made this spot! We sat outside and the grounds are gorgeous. We did bottoml","useful":0,"cool":0},"uTmdABJyJGQWR-tWv_srjQ":{"text":"Yum! The chef's special when we went was scallops on a bed of vanilla sweet potato mash wi","useful":2,"cool":0},"cyo50YkDG73gLe1LyKttuw":{"text":"June 27, 2021    Made reservations for Sunday, Jazz brunch  9:30 am.  Did not know it was ","useful":0,"cool":0},"rklziX4B_o7PGjotsUL3tA":{"text":"This place was the epitome of southern hospitality! Red Charles the hostess gave us a grea","useful":1,"cool":1},"LJRx_Mdw3VnlSDFKJn820A":{"text":"Court of Two Sister's is a stable of New Orleans history and brunch. The place is packed f","useful":1,"cool":0},"a2vobZP9uVSw2GUSYBnQrA":{"text":"This is a historic location with a beautiful rustic courtyard.  The buffet was average fai","useful":0,"cool":0},"u8BAei3EpvWowePHoMAHZA":{"text":"Dinner was busy and at times it took a while before we saw our waiter again. The grit cake","useful":0,"cool":0},"bH3JfBEaf9dZkgiR_vpN-g":{"text":"This place is gorgeous! The patio is beautiful and though we went during covid so the jazz","useful":3,"cool":1},"0WnBL3T1oMqqxtF9Rdeflg":{"text":"There was a tropical storm when we had dinner here so we did not get to experience the cou","useful":0,"cool":0},"yzMRigMIWamD1P7HyKuV8A":{"text":"This is the place for you if you love all-you-can-eat buffets, live jazz, a beautiful sett","useful":4,"cool":1},"EI4Eq_ITsBIC3sj3rH-UXw":{"text":"This is a such an icon place that you have to go and experience. The lines for food are pr","useful":0,"cool":0},"cDb0S4W5Bep4VkJxc956-A":{"text":"We were so excited to come here- but we were disappointed. The food was just ok, service w","useful":0,"cool":0},"XyFso2vWadES0SdWGrdRVQ":{"text":"We had reservations at this place for brunch. The buffet is still closed due to Covid. The","useful":0,"cool":0},"JKtD8fP9B9KaSNwC_ZLrZA":{"text":"My family went there for dinner for dinner and it was absolutely terrible. The carpet in t","useful":1,"cool":0},"uOKOLO11Fr5mamEYMJGTXQ":{"text":"The food here is just ok. Nothing really stood out as great and yet brunch cost something ","useful":1,"cool":0},"jJcJyFmKk2vgCosihDoiIg":{"text":"Tourist trap. I've been visiting New Orleans since I was a child and have been to COTS for","useful":3,"cool":1},"s6x7BH4FT5Dhs8wbBPt6eQ":{"text":"We picked this as our splurge meal, it was very tasty. Sadly we rain kept us from enjoying","useful":0,"cool":0},"RjpV1kejvpXUM7lg6JxLcQ":{"text":"I made my reservation almost a week ahead of time. What a charming restaurant with beautif","useful":0,"cool":0},"vEQ0QUV0rmfHMVAOxn67BQ":{"text":"I'm extremely disappointed that COVID seemed to impact the quality of the buffet. I was or","useful":0,"cool":0},"-Gn5asqKQY-hwTQg9-dgBA":{"text":"We were recommended this place by a few friends while we were in New Orleans and we were n","useful":1,"cool":1},"7Ymt2qXHnKNBlLan_qBRUg":{"text":"Outstanding brunch with excellent service. This place is really special. It's a great plac","useful":0,"cool":0},"_O95pFc3X-hGht4E-ueuJg":{"text":"I was really excited to eat at this restaurant yesterday  and the first thing my party and","useful":0,"cool":0},"QbwuNBZu5Kmu-ZJC6C4v7w":{"text":"What a vibe!\nWe got lucky to have beautiful weather on the outdoor dining patio, which off","useful":0,"cool":0},"u8-n1ealtvGqSXuaCeQPWw":{"text":"Court of Two Sisters is consistently one of the best historic restaurants in the French Qu","useful":12,"cool":13},"NZpVHv8wLuBPcYwyEWbC7g":{"text":"We dinned on a recommendation for a birthday celebration and maybe COVID has thrown a few ","useful":0,"cool":0},"41SP32lfxc3TPf8ZOiW6dg":{"text":"I came here for the jazz brunch on a Wednesday afternoon as suggested by a local.  I was s","useful":2,"cool":4},"lbOJaM8RTS8kacFe9HQSrA":{"text":"So disappointed, we went here for our 19th anniversary. We booked online a noted it was ou","useful":0,"cool":0},"Q5Z0U3ea-ZXzCJQ466E-Cg":{"text":"Came here for a quick drink after a networking event. Loved the vibe and the bar is a real","useful":14,"cool":15},"vRW2_Y8ZnAYEjWnzfMXvwg":{"text":"Came with a huge group for a new years eve brunch. They were able to accommodate us on the","useful":3,"cool":0},"A-i-1mwmt1NhGoa6mfib8A":{"text":"My two friends and I were on a girl's reunion for a week in NOLA. We were seated in the co","useful":1,"cool":0},"KxU4-Vmd1hb1HuMmsEu5YQ":{"text":"Service and atmosphere were great and the food was absolutely fantastic. We had the brunch","useful":0,"cool":0},"Niel0WVAxx9KnU41zJL4jw":{"text":"We visited for a happy hour with appetizers on a cold Saturday night and sat in the courty","useful":0,"cool":0},"NVwtit_MrJ8_vItcV1q56w":{"text":"11/24/12\n\nMy wife and I were immed taken back when our camo clad hostess barely took the t","useful":0,"cool":0},"QKPmbXa2SkIWz6_FHz4LeQ":{"text":"Let me start by saying our waiter, Damon was excellent. His service was awesome. However, ","useful":0,"cool":0},"1M3kfITnws_zoXm4XgcnkQ":{"text":"It was a buffet, food was ok. Nola has better restaurants that are worth the price. The Ja","useful":0,"cool":0},"MXMFN8IT0YplXD9Ofeg3lA":{"text":"Came to this place for what we thought would be a fun brunch. We had made a reservation fo","useful":1,"cool":0},"mMYdGF6fCgHj_-1GeA2rDA":{"text":"This place was amazing! The vibe, food and staff. Was traveling solo for 5 days and went b","useful":0,"cool":0},"lsqCCW-wDtyITQB8U_qxFg":{"text":"A group of 8 went to brunch. The waiter never took our drink orders & Barely came to check","useful":0,"cool":0},"HVGo_ygdnk-pbpdjPrK3Yw":{"text":"Pretty disappointing. Staff was cordial.Ambience was beautiful and the live jazz was nice.","useful":0,"cool":0},"6AW0e2LlWaE2tEbiCxQc5A":{"text":"This place came highly recommended by a friend for our New Orleans trip.  Was told to make","useful":0,"cool":0},"3bbBEqrT78hzkwulyfsGOA":{"text":"This was a wonderful buffet before covid. I was not the one paying, so I cannot speak abou","useful":0,"cool":0},"W6LMkblUQNxgWEhTAyEgFw":{"text":"What has happened to this place? The jazz brunch used to be amazing but since they did awa","useful":1,"cool":0},"qmbzcEj7HtSKdIWmtNRWng":{"text":"The food was great , real southern food ,the sea food pasta was meaty and delicious, the s","useful":0,"cool":0},"onPxVD6Or-tt6UKudvmMig":{"text":"Stunning courtyard worth a visit.  I suggest hitting off peak for a cocktail and bite to e","useful":0,"cool":0},"jqA_n8m8hZu6adREp4voiw":{"text":"Very beautiful and upscale atmosphere. We loved the jazz brunch. We just wished the music ","useful":0,"cool":0},"PWa1oNGwCxflkmMv-19gaw":{"text":"Great place for brunch! \nThe courtyard is magical! So gorgeous to sit there and enjoy brun","useful":2,"cool":1},"rmeOuPOI8e_awQYWsFPjtQ":{"text":"After several trips to New Orleans some friends and I finally had the chance to stop in fo","useful":1,"cool":0},"y1cyEyZWQqU9f6-r5xhzrA":{"text":"I really enjoy this place for a jazz brunch. Plenty of food options for everyone. The Caju","useful":1,"cool":0},"Kn9cYbNjrDU3bfrnTmqd0A":{"text":"Huge buffet! You can spend hours there eating. Overall the quality isn't that great, but t","useful":1,"cool":1},"x6lTeNr73g7XiUykmes9mA":{"text":"Lovely atmosphere during the jazz brunch -- the musicians played happy birthday for a coup","useful":0,"cool":0},"-_b69CQSn9FAAH3zXx_Ckw":{"text":"Heard a lot about The Court of Two Sisters when planning our trip to New Orleans, so we we","useful":6,"cool":4},"tt4sTAaedjD6udQC25tmfg":{"text":"Oh my oh my, it's Two Sisters for any guy.\n\nTook my 6 brothers to this spot on a whim.  Ea","useful":0,"cool":0},"AsB6OJkN8Fr7Lz1GFt_Zqg":{"text":"The building and courtyard are breathtakingly beautiful.   I loved learning of the history","useful":1,"cool":0},"RnrbbablR68qdhs36AAZiw":{"text":"First of all, the name of this restaurant is pretty awesome and was what first captured my","useful":75,"cool":67},"Tnapn1daPW7Cp_N_dSYzow":{"text":"The food is not good anymore. I don't what happened. The service was good though. The Caes","useful":0,"cool":0},"lq0Y59UKoMCWNp8N3lr5og":{"text":"Came here for the Jazz Brunch.  The weather was cold, so we were seated inside, I imagine ","useful":1,"cool":1},"gLrKudvYiQQRUEoMQoBBwg":{"text":"We had a reservation at 8. Reached on time and we're seated promptly. However it was not u","useful":0,"cool":0},"Y7cpRg5OPP8GY0ajmtuNAg":{"text":"Have enjoyed Court of Two Sisters brunch over 50 times; always great food and great servic","useful":0,"cool":0},"EognoO0-gQoPm71GyGprkA":{"text":"Brunch allows a great opportunity to try various Cajun and Creole dishes. Some good, some ","useful":0,"cool":0},"nT3zHGX1p3FG-yTL18sEAg":{"text":"Came expecting an incredible meal at a beautiful restaurant and left very disappointed. Th","useful":0,"cool":0},"-1rAu-wMy3xaFtn-Y0XXXg":{"text":"I had seen pictures and heard a lot about the jazz brunch so I was excited to try it but i","useful":2,"cool":0},"z6Ih2Ofy8KL2OWl88gACgw":{"text":"We came for Saturday morning brunch buffet. A group of gals celebrating our friend's upcom","useful":0,"cool":0},"3c36ayTnhGDq63ZXjSGOrQ":{"text":"I came here on my birthday and have to say that the Jazz trio singing their fun rendition ","useful":1,"cool":0},"LZndApiVhIol8z9PaFm6Cg":{"text":"My boyfriend and I found this place and that they offer a Jazz brunch. We decided to come ","useful":7,"cool":5},"8fEJ5aV4Ddh_v7IMMZdBPw":{"text":"Amazing and beautiful place. A perfect place to host a dinner for your clients and partner","useful":0,"cool":0},"Dot34g0y8pfRlUHVVjIx_g":{"text":"We had a wonderful experience here. The food, wine, service and ambiance was excellent! Th","useful":0,"cool":0},"xIx2wWjspElssPklUqEHfw":{"text":"Had one of the best meals I've ever had. Boudin stuffed pork chops, with jalapeño cornbrea","useful":0,"cool":0},"_ePwghALq3EtB9VJXYAKqA":{"text":"Very pretty setting for a jazz brunch, lovely tables laid out in court yard with gentle ja","useful":0,"cool":0},"wYBYXo5WY-CFXvDpSfcdRA":{"text":"I have been to Vegas dozens of times, and I know what can be done with to create a decent ","useful":2,"cool":0},"ocZ3p0tWtiUltq-dHOB_6w":{"text":"What a cute place in the French quarter! The whole venue was so much bigger than It looks ","useful":2,"cool":1},"8PwNsL5sqOwSWV9-bnVQ_w":{"text":"Jazz brunch here was incredible! The brunch buffet was high quality and plentiful! The amb","useful":0,"cool":0},"F7xz416924xqNgtnyz6z0g":{"text":"We had a great time at this restaurant.  The history of the restaurant is quite interestin","useful":0,"cool":0},"s6ePuFKvxdxHLR_64SH2_w":{"text":"This is a must try if you visit New Orleans. Imagine a picture perfect scene in a French c","useful":4,"cool":0},"QmFit9aSJjQJBEcEsLNQrA":{"text":"Court of two sisters. Very busy, long lines on the buffet for omelets and Benedicts ridicu","useful":2,"cool":2},"3jiTM3rYF0zbdpfwpIq9jg":{"text":"Horrible drinks. Weird atmosphere","useful":2,"cool":0},"ItRzeYmxfMOtrK2BMjbPkw":{"text":"When you first walk in, the hostess is super hoity toity in asking if you have reservation","useful":0,"cool":1},"AultNgzzRrQK528DbrAKug":{"text":"The place was busy but the staff were friendly and we got great service at the bar while w","useful":0,"cool":0},"udNYDpQC9Jt0XGztcHdfNg":{"text":"We picked The Court of Two Sisters for our mother-daughter brunch for the following reason","useful":26,"cool":17},"ohNbWOUa9v76P3NbUbpZpA":{"text":"NOT WORTH THE WAIT...  The food was good but the wait was ridiculous.  Sat down and it too","useful":0,"cool":0},"AdGM_cN8HZp_GqplgCYxTA":{"text":"This place is a nice brunch spot.  We had our door seating which was nice and irritating a","useful":3,"cool":0},"Z-1NzZ3AXVfQ7Y96HPhC3g":{"text":"After years of walking by and assuming any restaurant this popular with tourists wasn't fo","useful":1,"cool":0},"CsFNRDws7Yb_Bzd5QXogjg":{"text":"Ate at this place for brunch while visiting NOLA from ATL. It was just ok. The service was","useful":1,"cool":0},"v25zDWBtkkGCBYVfx-oIHg":{"text":"Had a wonderful jazz brunch experience.  We had a large party and Rob did an amazing job!!","useful":1,"cool":0},"7aHZHqdEMJkYRQ295bhKpQ":{"text":"Hosted a great party for my son's 27th birthday at Court of Two Sisters in one of their pr","useful":2,"cool":0},"hpu081iYQsScFijoIaGstQ":{"text":"I'll make this quick.  It is Golden Corral food at fine dining prices.  The food is anythi","useful":0,"cool":0},"-aeExeGPnwhl5xDb0USIrQ":{"text":"Absolutely spectacular! Court of Two Sisters is a must go for any tourist. I've never sat ","useful":1,"cool":1},"h8tdZTSxq6RmajN1sq3LfQ":{"text":"Little hole in the wall place with plastic tables and chairs, but brightly colored walls a","useful":1,"cool":0},"sqLm9h0wAKEr3t8rmeWGWQ":{"text":"I am disappointed to have to write this review of what is one of my favorite restaurants. ","useful":0,"cool":0},"o8_ocDPFEvySUVOMDYP9DQ":{"text":"Great JAZZ brunch booked thru tmTrip advisor. Good music, food and service. Nice atmospher","useful":1,"cool":0},"dGsLb0RwPTs0hs3X1FIAAA":{"text":"This is a place to dine at for the beauty of the restaurant - not necessarily the food. Al","useful":2,"cool":1},"NIt0Gmq9wnrngbdOWSEnAQ":{"text":"The Jazz Brunch at the Court of the Two Sisters is an amazing New Orleans experience. Seat","useful":9,"cool":7},"af4gr_hqKLp9LVUAiB3tOA":{"text":"Can anyone tell me the definition of a Hot Mess?  Cause I think I have a great reference f","useful":3,"cool":0},"FvfzuQnK8-8E35Rn22RACQ":{"text":"Great spot for jazz brunch! Make a reservation online ahead of time (there was  good avail","useful":1,"cool":0},"9Zg0xgZGdiW6qikCVjzJsQ":{"text":"If you want to try amazing NOLA food all in one place, this is your place to go! The amazi","useful":0,"cool":0},"4P8igj8NjXBul6fmMlJhSg":{"text":"What a fabulous brunch!! We were a party of 9 that were there on a Saturday afternoon and ","useful":0,"cool":0},"jvc7rrP5vNMXjrR3sPfcDA":{"text":"Great experience. I was looking for a jazz buffet brunch on Sunday and came across this pl","useful":1,"cool":0},"Fkx63-q4Dm3-dscAJVXdBQ":{"text":"I am not a fan of a buffet.... any buffet but with less than a two week lead time on an Ea","useful":1,"cool":1},"BzyQE1lzAzy3EX2d7QaQyQ":{"text":"Usually a great place to eat but NOT this time.service was terrible, food mediocre and not","useful":0,"cool":0},"pldLi8nB1jspyrjqpNzvFg":{"text":"***REVIEW FROM AN EXPERIENCE IN JUNE 2015: I just wanted to let everyone reading my review","useful":2,"cool":1},"ydt-vr47vDZwJcfrfhyWqA":{"text":"Best meal of our trip. The shrimp and grits Wore my favorite meal of our whole trip experi","useful":0,"cool":0},"kpV-vvj7HfkqT_gnjF2abg":{"text":"Our tour guide was absolutely RAVING about this place, so my boyfriend and I decided to ch","useful":1,"cool":1},"NZd4zFF4j_ExO0Mb_zRtCA":{"text":"It's a beautiful place, great service too. \nThe food was very fresh. \nBut, it was dirty. V","useful":0,"cool":0},"mO2LXVFWWhbNJuS1IkA0qg":{"text":"I loved their Jazz Brunch yesterday!  I'm really embarrassed at the amount of food I ate. ","useful":5,"cool":1},"TgbLedDqt_9FFKrjTD2ZZQ":{"text":"When I purchased my travel package from bookit.com a voucher for a free brunch to the cour","useful":5,"cool":2}}