{"f5ArvHHL42OiuBIWoCFxpQ":{"text":"was on an errand-running run and remembered how ashamed i was at the state of my car the l","useful":1,"cool":0},"38uF-5Pggo9AzWZEiHQRYQ":{"text":"Good, steady Saturday business but they're a bit slow. They only have one person doing the","useful":2,"cool":0},"2Q7s2t4SLz2Yyv5e7zRhiw":{"text":"Paid for the $25 wash and detail (the most deluxe package they offer), added leather clean","useful":2,"cool":0},"PNOQ5QJGF49SY0TL_oufjQ":{"text":"Hideously overpriced!\n\nBut they do a good job.  I remember back in Dallas, you can get a b","useful":1,"cool":0},"fgqdqeKOqkUOgcnmBsw6HA":{"text":"Friendly gracious and efficient what more could you ask for?? I have dogs and they sure go","useful":1,"cool":0},"dBDioHQlYZLURgO0MN1GuQ":{"text":"First time there today. Went at 11:45am. Not very crowded. Got the tchoup street service. ","useful":0,"cool":0},"hbtawL3Qc4caprQOk_OQww":{"text":"\"Free car wash with oil change\" the sign said. I thought, \"Give them another try - besides","useful":8,"cool":3},"uBo5hLHMNEr8K61MsTjl_g":{"text":"Nice wash, but WATCH YOUR VALUABLES! While the price is reasonable, and the wash is good, ","useful":2,"cool":1},"iDHN3EJBBzJdUcfpM1kwFA":{"text":"Every time I've needed my oil changed, I went to Pep Boys on Carrolton and it was always m","useful":2,"cool":1},"jS3oEJVqTY8e9Mz6FwE_SA":{"text":"Brought my car in for an oil change as I had passed the date by two months to get that don","useful":1,"cool":1},"9lNgQ_GdvlfAzxdh_Kbv3g":{"text":"They do a good job, doesn't take forever, prices are reasonable, and they have a comfortab","useful":0,"cool":0},"6MkxlgBA7pz-XY-jLvzA9w":{"text":"I can NOT believe there is any less than a 5 star review for this establishment.  For the ","useful":1,"cool":1},"LK2StoDQLfe5VTmfT-7K0g":{"text":"Got my car detailed here on Saturday.  It was stolen from in front of my house on Sunday..","useful":7,"cool":2},"jiWZ-fRJ8VpsGskkv7srFg":{"text":"I come here when I've let my car go way too long between washes. I agree with other review","useful":1,"cool":1},"06IC2ZqepOZdmF-xiwB3AA":{"text":"I get my Car washed here every week. I purchased the Uber car wash special because you can","useful":1,"cool":0},"T4hF5J_Ig7i30KThOMHKrQ":{"text":"Awesome, blossom. I came here for the oil change and left with a free car wash and not-too","useful":3,"cool":0},"TsImF96tH3lumSCQ1eM8PA":{"text":"I just paid $32.00 for the \"Uptown Wash\" I observed the men as they were drying off the ve","useful":0,"cool":0},"zA5iCnkLx4KhCClwqh5z3Q":{"text":"The lobby is very nice.  You get what you pay for.  Can't buy the cheapest car wash and ex","useful":1,"cool":0},"QLhj17p3O68jD1lpZuGwOQ":{"text":"I purchased the thcoupitoulas wash which included a dash dusting.  Terrible job.  These gu","useful":0,"cool":0},"LX4z_5UP0mlLO8c76GxhNg":{"text":"We have used Uptown for almost 10 years.\n\nThe car wash part is fine; no problems.\n\nBut the","useful":1,"cool":0},"j1FWELjDN5g2K2SLQeCmlg":{"text":"I have given this place so many chances but after today I have to write this review. I cou","useful":1,"cool":1},"OUNx4eHF0jliQ2Poy0E8pg":{"text":"They DO NO do brake tag inspections anymore, even though they still display a large grey s","useful":4,"cool":0},"-UCP7hpPT8urGouCL64BCQ":{"text":"While some may think it's over-priced, they do a heck of a better job than what I could do","useful":2,"cool":1},"PR5jm20CThp7CnJCsgYv_A":{"text":"So convenient!!  I can drop my car off here for an oil change, plus free car wash, walk to","useful":1,"cool":0},"aBLF8-yr3pRSUeG6Ux2kQg":{"text":"This place is great!! I went there for an oil change and got a free car wash and interior ","useful":1,"cool":0},"0URPg-nrHrys6B7kj_IZEQ":{"text":"I had to write a review about this place after yesterday's experience. \n\nFirst of the mont","useful":6,"cool":3},"HbJKGdGJ0QaIwBgoi1tgmQ":{"text":"I've had my car and Class B RV cleaned here a number of times. Always get very good work. ","useful":0,"cool":0},"92DOtZ7kbqF-r2gJNZEkBg":{"text":"This place just isn't what it used it be.  Paid (wasted) $25.00 plus $5.00 tip for nothing","useful":4,"cool":1},"ZSMgDWJuB6Tpm5SJ6Ju3-A":{"text":"I picked one of the most comprehensive packages ($55) to detail my Mercedes. The service q","useful":0,"cool":1},"2Jy8IKouexDpPbjFVDODGQ":{"text":"Dropped my car off here since I was early for work. Have to say I was pretty impressed. Go","useful":1,"cool":2},"jwnxiYxFFN6CK3-BlSG7Aw":{"text":"Hadn't been to a car wash like this since childhood in Omaha! As a wee tot, I would have b","useful":4,"cool":2},"0xK-Gw6ZvviSX4llfaz1zQ":{"text":"I agree w cyn, it's not what it used to be before Katrina. I dropped my car there on the w","useful":0,"cool":0},"DLPSk0eNv5makSeMHy8_wA":{"text":"Here's the scrub: my car needed a good bath and a vacuum. She hadn't been cleaned in over ","useful":1,"cool":0},"ZJCVIpuczMX4XZl3iV4A4A":{"text":"I love these guys! I bring my car there every Saturday for a cleaning and vacuum. The staf","useful":0,"cool":0},"zrw9IteGI0ynXDCrHBhMJw":{"text":"I have been using this car wash for almost a year now. The staff is very friendly and prof","useful":0,"cool":0},"-c98gEILeUvUmO0lPE3gCQ":{"text":"The hubs is a big fan of this location. While I dont know that they are the fastest oil ch","useful":1,"cool":1},"x10trUjbQInXWQbSNIfS8Q":{"text":"I have been getting my oil changed at this place for more than two years now, and I could ","useful":1,"cool":0},"KzG3m7Zbqziz6Uf-qOK5Cg":{"text":"I was having my car washed, and when I was looking at the car fragrances the cashier at th","useful":0,"cool":0},"cIjTdyk9Lnl9h-Qd9K4isw":{"text":"An OK place; but , they forget to re-set the car's computer when doing a lube job..\n\nThis ","useful":4,"cool":0},"XwNTlroQwega2s2ghwr9aw":{"text":"Royal Car wash anyone?\n\nI love this car wash. They are uber professional and fast track pr","useful":8,"cool":3},"ORPgJEUxCyPx7IuihkyWFg":{"text":"Decent carwash, little pricey..unfortunately they don't have much competition in the area ","useful":1,"cool":0},"1B4exL_ZH81XmndyUrJk8Q":{"text":"If I could give this place a thousand stars I would. I had to pull in last night with a si","useful":0,"cool":0},"_MRdcmFEKxqX4XaJgDspzA":{"text":"Holy crap! Why do they have birds in the lobby. I am never going back. There is nothing pl","useful":0,"cool":0},"HMvRfLG0wdbAYGSCJjWdQQ":{"text":"I have been coming to the Uptown Car Wash for several months.  So far I'm finding that it'","useful":0,"cool":0},"6OiURYPpDghJclrA2mZeKQ":{"text":"I took my car there to get an oil change and a car wash. I chose to upgrade to the \"Magazi","useful":1,"cool":0},"O7_9O2RQp0-ZkPi040-z4w":{"text":"Complete waste of time. They took an hour to do a 30 minute job. They forgot to clean the ","useful":2,"cool":1},"XAI_3J19_EQCWRWQaOSC0g":{"text":"Best lube job I've ever had! For $40 you get a basic oil change, plus they vacuum, clean, ","useful":1,"cool":0},"hDBLx48NPudLE5GLgz3log":{"text":"Biggest waste of money.  They do a half a$$ vacume and don't touch anything else.  Could g","useful":0,"cool":0},"Xt1XN2xwxZ-bl0Fl3voqaQ":{"text":"this place is just okay.\n\nLots of different wash options; opt for the lowest on the totem ","useful":2,"cool":2},"3Ww0-0iKI7v42BxBXM92Ig":{"text":"I came here because I was getting my car inspected (on a lease) and wanted a wash and vacu","useful":1,"cool":1},"IxnQQLRErdep0Cwa1JlfoQ":{"text":"They have three basic packages ranging from $14-$25. But you can always ask for additional","useful":4,"cool":0},"38STCeP96-Ed4CIG4LJjXA":{"text":"Just left there, and realized that even though I paid to have interior cleaned and vacuume","useful":0,"cool":0},"IlO59hMvyGFZTa2lmX6wBA":{"text":"This used to be a convenient spot to get a quality car wash, and interior cleaning / detai","useful":2,"cool":0},"DyEQfx9O0y--L8jmXBDdIw":{"text":"Don't waste your money- their car wash and service is TERRIBLE. To come home with a dirty ","useful":0,"cool":0},"V4sg3Max25SEOl0Z97nDug":{"text":"It's conveniently located and I can get multiple services in one location, so that makes m","useful":2,"cool":0},"JS0rqCslgRWDLE9V3uuubw":{"text":"This place is awesome. They vacuum out your car, wash it, and polish it and you get to chi","useful":3,"cool":1},"3_gxO9O2POiQAEOu_q-zhw":{"text":"If you want to pay $25 for the same carwash that you can get at the TLC drive thru for $8.","useful":2,"cool":0},"C9OwqJjQvkAjBeepPl6Yrw":{"text":"I went here for many years. Mediocre car wash. They never really did a good job inside the","useful":0,"cool":0},"sBCKHajfM0YcTeBhtYWGHg":{"text":"I had a paint restoration, wash, wax, detailing, windshield repair, and cleaning inside. I","useful":0,"cool":0},"wx0z9orWXWFNZfSKcAxAcw":{"text":"I was told it would take 90 mins to do an external wash and custom interior shampoo. It ha","useful":1,"cool":0},"-1gj9sygDqgku31aepTjpg":{"text":"I will have to say that this place blew me away!!!! I needed to find a local place to chan","useful":1,"cool":1},"JynzNwm2ERYIbz8_4yaUuA":{"text":"Decent wash, but not great.  I've noticed they will do a better job if a manager is there.","useful":0,"cool":0},"XB35Ay0cffjbQKPT-WEckw":{"text":"Today I had had the best experience I can ever receive at a car wash. I went to the winn d","useful":1,"cool":1},"PbtnBtP5u_BeMNk34O6uWg":{"text":"After two years of abusing the interior of my Expedition with trash, spilled drinks and dr","useful":2,"cool":2},"uXyYtfRdh9L_8fRngRunYg":{"text":"My one and only experience at this business was not a good one. Courteous person met me an","useful":2,"cool":1},"mEkldCtjEGbASv01JCjDiw":{"text":"So some things never change..tunnel barely works..rude employees(especially the guys dryin","useful":2,"cool":0},"-4dozAtdEXymkA4sWx-ymw":{"text":"I've previously had a car wash from Uptown a few months ago and today I had my car service","useful":0,"cool":1},"FefUL6RRkBGHK0ojd_so9Q":{"text":"I never write reviews, but the staff went above & beyond my expectations here. Stopped by ","useful":0,"cool":0},"KWnSNqHxIOBrcmM7YRJ5vA":{"text":"I went here the day after Thanksgiving. They had very few customers. So I expected good se","useful":0,"cool":0},"IYyKusUqQwmyv5Da_v1rDA":{"text":"This place is not like used to be! The machines doesnt wash the car well enough, they didn","useful":3,"cool":1},"WWktU7b4sYUKOuh3EP-AWA":{"text":"I was first told of this legendary car wash and oil change shop by my boyfriend who knows ","useful":9,"cool":3},"oU3EKp31EsmyUdbjnhf1hw":{"text":"Turns out this place wasn't so good. About 100 miles after my oil change, my car started s","useful":1,"cool":0},"duT8rpyR5cSsWt1G4y1_ag":{"text":"They generally do a nice job; have to be careful sometimes with wheel spokes and they can ","useful":2,"cool":0},"FUMlKSDyrHld_vyrLD7wzQ":{"text":"I WANT MY MONEY BACK!!! Has ANYONE working here EVER been to a real car wash?  This place ","useful":0,"cool":0},"3FggoFXzoiiCHjG5pYrdsw":{"text":"Terrible in every way possible. 20$ down the drain: car looks the same, inside and out. Th","useful":0,"cool":0},"Vzs79ZmOB00jZnrJMUivTg":{"text":"This was the worst interior detail I've ever had. After  an hour and fifty minutes, I was ","useful":1,"cool":0},"HL2yYGN_RlLdQc_VUxLrPg":{"text":"$18 wash \"inside and out\"  Decent job on the outside. Looks like a rag never even touched ","useful":0,"cool":0},"NSEme-JxM2BwwxTNTPKkDg":{"text":"This was my first time here. They clean the interior of your car before it gets washed. I ","useful":2,"cool":0},"h-adsFDqBbD5VVc3PPGyjA":{"text":"They have a captive audience, unless you want to hump it all the way out to Airline Highwa","useful":1,"cool":0},"-AapUX4kyVovN5s6MUZZCw":{"text":"Such a great carwash that truly is an absolute \"MUST\" to visit while in town.\n\nThey have a","useful":1,"cool":0},"FgCF4ayxucx0AK656qILMQ":{"text":"Gave this place another chance, and experienced the same results. Exterior looks great, bu","useful":1,"cool":0},"MI5AecAK8PFPKUnA1ITfPw":{"text":"Had the worst experience here today.  Getting an oil change and car wash, and they broke o","useful":3,"cool":1},"1AbndDwwJwmizecvhOhUeA":{"text":"I kind of have mixed feelings about this place. The first time I came here I dropped a lit","useful":4,"cool":1},"QmzAa1fo1STWpRFhcTjhEQ":{"text":"Parrots loud crying inside is so piercing while you wait.. awful sound!\nNeed to find somew","useful":1,"cool":0},"ShjLoGTjO0grLSeJUKHBXw":{"text":"I love these people b/c they have the lil' side shop where they can do minor repairs, ask ","useful":1,"cool":0},"8xsASRNBE78sN0H2sVcukg":{"text":"I visited Uptown Car was on my lunch break. I was out of there in 20 minutes. \n\nI treated ","useful":3,"cool":1},"lx6AeK_x4trHMI_oWqM4WQ":{"text":"After utilizing Uptown Carwash on a regular basis over the past couple years, I feel quali","useful":1,"cool":0},"B6tk1ZqWA79kWYzW5228uA":{"text":"They do such a good job here.The employees are always really friendly and I always leave h","useful":0,"cool":0},"CVj1uZXXV4OVRFzYogoqCA":{"text":"So for the same price as just an oil change at most other places you can also get your car","useful":4,"cool":2},"-E9A2lbFuZS9UnhwciOpvg":{"text":"I've been going to this car wash since I moved to New Orleans. And for many years they did","useful":0,"cool":0},"mefFMWlBR1UrmwNv1FcuMg":{"text":"I paid for the cheapest wash (Tchoupitoulas) which is $14 and includes a spin through the ","useful":1,"cool":0},"YiZVjB1vwf_IfZvY_zpSZA":{"text":"The other reviews do a great job giving a general idea of what to expect at the Uptown Car","useful":3,"cool":1},"G2l81aCLvnAbcVK7gMNB7g":{"text":"I love supporting local businesses, but every time I come here I'm disappointed. Poor qual","useful":1,"cool":0},"ffWJMQdA0m0TWeHe9dxUsQ":{"text":"Uptown carwash is the worst in the city I only went there for the detail services I will n","useful":0,"cool":0},"YgKS_gYO1Re75c1nGk55VA":{"text":"I've tried this place twice, and both times, ended up having to pull into the parking lot ","useful":0,"cool":0},"Mk6gnGF03e0incnFi9rlpQ":{"text":"I've been around the block with a few other oil change spots, and I still think this one i","useful":10,"cool":9},"753jDA43iiYWKm5SLJVvUg":{"text":"I've definitely had WAY better car washes.  It seems like every time I come here, I tell m","useful":1,"cool":0},"_J6Og98350mjBxN85XsXgw":{"text":"I really love this place. As morgan and others mentioned the animals and waiting area are ","useful":2,"cool":0},"GzuUBAbn9oUgLyCLf-LF1g":{"text":"Very fast and thorough car washes. It's hard to find a place that will do the interior as ","useful":1,"cool":0},"nWL_Jaz1W7dVCoH_xJd2mQ":{"text":"This place leaves your car looking and smelling brand new every last time. I have been her","useful":1,"cool":0},"FTm3QHh3fqeAf2ZInIXt-w":{"text":"Took my car for a wash on yesterday and received my car back with plenty dirt remaining in","useful":0,"cool":0},"lY3uAIZRV1gz8-ZcFFdnGg":{"text":"They do an ok job, but seem to cut a lot of corners. Streaks and smudges are continually l","useful":0,"cool":0},"ze-f2daOGed12fMSqRIM7w":{"text":"Awful. Poor cleaning of my vehicle, inside and out. And expensive.\nGo to Al and Al's One S","useful":4,"cool":0},"pTJjq4Yuwqnggo6hWUxLnQ":{"text":"Not bad, not great.\n\nEveryone was very nice, friendly, helpful. Service was pretty quick. ","useful":1,"cool":0},"ZU6iZN2lHVGoXnuKa-pcGQ":{"text":"Kind of pricey, but you get great service. Car detailing is over $200 for the extra clean ","useful":0,"cool":0},"BI1TAjt1-8pDExTzJ0mT-Q":{"text":"I had kind of given up on having a clean car because my dog who sheds year-round. Everywhe","useful":2,"cool":0},"s9pqEL072xaSxHU41qUONw":{"text":"I drive from the Marigny just to get my oil changed here for a reason. The massive air-con","useful":3,"cool":2},"LMgzsILnWQNuZvyds9JsUA":{"text":"I showed up at Uptown Car Wash around 9:15 to get my car detailed. I was told it would tak","useful":0,"cool":0},"Tvb2-ME-B5ysiVqWeB9e4Q":{"text":"Extremely easy service for your car cleaning needs!! I know every once in a while I get hi","useful":3,"cool":2},"POXTWZX5TOnIX09hH0PPMw":{"text":"Have been a customer here for over 2-1/2 years but I won't go back again.  Went for oil ch","useful":0,"cool":0},"ph4Tr_nOMO5XYLh-H6ukwQ":{"text":"Got my brand new car washed here today. There are now long scratches all over it, not just","useful":5,"cool":2},"NcUoiGV9zMo9z_b8tRki-A":{"text":"YES Scott is was my first time, my family and I just moved to the area last week.\nUPDATE -","useful":1,"cool":0},"eu97A_DxOz8kC4h_KOIb3g":{"text":"This is the second time I'm getting screwed over here, there won't be a 3rd time.\n\nFirst t","useful":3,"cool":1},"nq9Nr1Gfz-yFJ3qoV4Va1Q":{"text":"While their prices do seem a bit high, they do a really good job.  After months of giving ","useful":1,"cool":0},"ZM1kFEun_GfJTotG_I3UDQ":{"text":"I paid for the St. Charles car wash and tipped. When I got in the car the cup holders were","useful":0,"cool":0},"ezZEO9xk2WKINJ11rztvsA":{"text":"Pros: Everyone was very kind and knowledgable. The lady accepting my SUV let me know my op","useful":2,"cool":2},"JImhUfqy1XZMn4Unre0mpQ":{"text":"I have been coming here since they opened. Came for oil change and wash. Craig who does Oi","useful":2,"cool":1},"yYA62Y0bVKRrl6KxOjIDkg":{"text":"My car looked cleaner when I brought it in then when I left. \n\nThe entire car has an oily/","useful":1,"cool":0},"nCTeOVOlnnqSprpNyIZWow":{"text":"This is my first time here although I've lived uptown my whole life. It is about 5-10 doll","useful":0,"cool":0},"iOvDOXVtkk1zhPtuukRnEQ":{"text":"The oil change dept is polite and courteous, as is the staff at the counter, and the oil c","useful":0,"cool":0},"WyfWzr-U9-4Q5ThXjkqODg":{"text":"Over charged by doubling the cost of my oil change. I paid over $60 for a simple oil chang","useful":3,"cool":0},"Vgvt0Pn1PEyvgwSzbc4ANw":{"text":"The good: you get a free carwash with an oil change. I'd been disappointed by their carwas","useful":1,"cool":0},"S2agLY0Icy_5_YMwMXWx1g":{"text":"Working along the Mississippi River, I often find myself near the docks of Napoleon Avenue","useful":9,"cool":6},"SGN2-xnpLugXgsFI_OfSfw":{"text":"They do a terrible job.  I got the St. Charles, inside of car was not wiped down, the back","useful":2,"cool":0}}