{"PP2Y5Vics8EiA15kW-9b2A":{"text":"Came here with a friend. We ordered the crawfish bruschetta, the hibiscus drink, a dirty m","useful":0,"cool":0},"skP331ZmDHJYMVwzxck8Kg":{"text":"We were staying in the French Quarter, it was pouring rain and the hotel restaurant menu d","useful":0,"cool":0},"CEl1ThCpflHu6ssRUrNwSw":{"text":"Highlight of our visit! The crab cakes and lamb chops were our favorite. Also, get the cha","useful":0,"cool":0},"fnePrYALq0g3wq8gPzxRNA":{"text":"Great lol wine bar find. Good wine selection. Catch it after a nice dinner in the quarter.","useful":1,"cool":0},"WLrKOL3gUYVJ883w2OU7KQ":{"text":"Dinner was near perfection. Awesome pepper crusted prime filet mignon, cooked perfectly, w","useful":0,"cool":0},"KAwEtIgCjU-1NucjEKvCTA":{"text":"My favorite restaurant in the city!  The filet with the buerre blanc sauce is UNREAL!  The","useful":4,"cool":1},"AtoIhkzE8vs8lQwbqni-WA":{"text":"Service needs work. DO NOT SIT NEXT TO THE KITCHEN WINDOW. my dini g partner was bobbing a","useful":1,"cool":0},"mSTxKMBTZ_9z78Lfh5MOoQ":{"text":"Great as always! Bacon Happy Hour, Pinor Noir and chesse board ( peppadew with honey goat.","useful":0,"cool":0},"rJ3IT_5dvacC0KDqEc4tgA":{"text":"A plus. Service superb. Tebecca took really good care of us.  Food was seasoned to perfect","useful":0,"cool":0},"ZmaKj_78hZ56yU7jjPz49g":{"text":"Fantastic service, even better wine and cheese. They have freshly baked bread that is to d","useful":0,"cool":0},"4yyfed1H5BLtXoEV0_KawQ":{"text":"My husband and I spent 7 days in New Orleans recently and ate here twice so needless to sa","useful":0,"cool":0},"icPaMxifQH-3BL5_HF4lzw":{"text":"We stopped in for happy hour and shared a bottle of the happy hour white and a bread and c","useful":0,"cool":0},"Hm1DI1vm69O6v_WMv66I6Q":{"text":"Top drawer service. Romantic setting in the courtyard and amazingly peaceful that close to","useful":0,"cool":0},"pJs_DX-AVW6w3IswMgGajA":{"text":"Ron was the best server! After providing great service he did multiple card tricks to our ","useful":1,"cool":0},"KryT6S4KF0YKfJQZFvBaFg":{"text":"Love their courtyard.  Great wine selection and a fantastic happy hour.","useful":1,"cool":0},"55VhlBUKCTXFzxtIHUQkPA":{"text":"Went here for our last night in New Orleans. We sat on the patio. The atmosphere was just ","useful":0,"cool":0},"eCXvgjk3gGGiRSBZLXrfVw":{"text":"Went here during my sisters bachelorette party and we all loved it. Adorable decor and man","useful":0,"cool":0},"aulpjP8NnA3gsPqaYSJ7fw":{"text":"We were pleasantly surprised to find this spot. We waited a short time to dine in the cour","useful":0,"cool":0},"reUXrqaO2Uwv0QVgIweJEg":{"text":"Came in for a late night bite and had a bunch of lovely small plates. The Brie was delicio","useful":0,"cool":0},"HJOTh95mAm74WmkZgGsE-g":{"text":"My husband and I stopped here while waiting for a dinner reservation. You never know what ","useful":0,"cool":1},"7Qt_opQw4QyFrwOIkeTt4Q":{"text":"Super cute place.  Went for the bread pudding, drank some non-wine drinks.  Definitely a c","useful":0,"cool":0},"h8IJ81SPGvys6Qc8Si6M9Q":{"text":"So I ate here tonight after not being able to find a different place.  Yelp, once again, d","useful":2,"cool":0},"WJF24kJRyjBuO_F7lS6lwQ":{"text":"Excellent service. We had a group of nine and they sat us right away and our food was fast","useful":0,"cool":0},"rr2CjaSSU5jae9Ui3x8lNg":{"text":"Was so excited to spend our last night in a beautiful courtyard in the Quarter. Our server","useful":0,"cool":0},"wbDRqg4ez_oF4jypB3Ddlg":{"text":"Rack of lamb all the way! \n\nWe ordered the BBQ shrimp - amaze balls\nMussels - awesome pres","useful":0,"cool":0},"QLQnFiBj2dGRXXpujFaz_w":{"text":"Great food and atmosphere. Accommodating and friendly staff. Happy to have wandered in her","useful":0,"cool":0},"7bS3R6ej3aP0G6mMWNol1g":{"text":"This place is awesome.  The staff was very nice.  The chef came out to meet us.  I had the","useful":0,"cool":0},"GQJHtKWBLOeclUcLblRU5w":{"text":"This place is one of our favorite memories in NOLA. We were looking for a cozy more romant","useful":0,"cool":0},"wzciwXbosXoo5zWLaNHLAA":{"text":"We had an amazing time here during happy hour. We relaxed in the pretty courtyard, enjoyin","useful":0,"cool":0},"q8XQ3g3lHgnZl-I7WTF9Ug":{"text":"Great food, great service and warm, inviting ambiance.  Shout out to Carrie Anne for makin","useful":1,"cool":0},"suiNldOFTeX2Y3OmO33-Tw":{"text":"Yes as good as it gets!!! great food great service great ambient","useful":0,"cool":0},"BFUnMrnBZCEn53d0XXuXBw":{"text":"They are now measuring wine by the glass with a little carafe  thing, so disappointing. A ","useful":0,"cool":0},"N56iSRCxfF1t-fchn4A21g":{"text":"We travel to NOLA every year. This wine bar is cozy and the food is very good. But the bes","useful":0,"cool":0},"nWipmwEPdXjCp8RFKPYF-w":{"text":"We stopped in for dinner around 8pm. We missed a happy hour and flights of wine but that's","useful":1,"cool":0},"iTV_5AQlw0A3loaTPDStRA":{"text":"We love love love the Grapevine. First of all, they have an awesome patio. In the midst of","useful":1,"cool":1},"IE-gPky2Tbs5N5QWL8sRtg":{"text":"Great meal, even with the kids in tow. Kitchen made a special kid friendly meal for them. ","useful":0,"cool":0},"elTA0And3bEovBzQhESdSQ":{"text":"AMAZING!!!! \n\nMy husband and I had stumbled on this gem when we were here in April. At tha","useful":1,"cool":0},"pVrXpaUM1n3SLzdT6xaKIA":{"text":"In a week-long vacation, this restaurant was the best out of a long list of staple New Orl","useful":1,"cool":0},"98gKfJkSJaP_BsGW95tJKg":{"text":"We visited this place a few years ago and I fell in love with the location and atmosphere ","useful":0,"cool":0},"H57XOGSw0VmGWKn1qLYC0A":{"text":"I will be back!  Our food, service and atmosphere was great.  Thought we were popping in f","useful":0,"cool":1},"Q4tibykyu1_pQLXuzKK_JA":{"text":"AM...BI...ANCE!\nThis place has what it takes to create a chill/romantic atmosphere with so","useful":0,"cool":0},"PRnF5A28u5stGU7hzlFXiQ":{"text":"We were down there for French Quarter Festival and decided to roll in and grab a couple or","useful":0,"cool":0},"AE_O1Liu11cK2E0IRIWm9A":{"text":"Each year when we visit this beautiful city we pretty much eat our way through it.  We alw","useful":1,"cool":0},"-kHjhKf6B3u8EL3uNkeX_w":{"text":"No complaints but pricier than expected and probably not worth the overall value.  Friendl","useful":0,"cool":0},"xVZw6tlFbIqLE2nRvzN2wA":{"text":"This is a true gem in the French Quarter! It boasts an awesome Happy Hour with FREE bacon.","useful":2,"cool":0},"-TtwhDufsruKq2HD3ahbDA":{"text":"Great atmosphere!  Very friendly waiters!  Loved gumbo of the day but would ask for rice o","useful":0,"cool":0},"zX4w6xTNpLsAesZgoS0UgQ":{"text":"Delicious food. They had a menu of \"small fares\" which was perfect for a group of women wh","useful":0,"cool":0},"r2iVchNMWWf7gi-Qh3aoJQ":{"text":"Everything was EXCELLENT.  The service was amazing.  Ron, our server suggested a wonderful","useful":0,"cool":0},"beJ46kc4Z-pfUTdQBxoC6g":{"text":"This place is more than wine! Best Lemon Drop in the city ask for sunshine promise you won","useful":0,"cool":0},"--Feh6uaXe_XZy0y4RvOZw":{"text":"We visited this restaurant while walking down Bourbon Street looking for somewhere quiet w","useful":0,"cool":0},"uDViJqCIrbUblUiCf0vs1A":{"text":"This restaurant was recommended by my hotel across the street. It may be in the middle of ","useful":1,"cool":0},"wbj5r03CP0LEP6ZAxa4P2g":{"text":"I love this place. Quaint yet fancy looking.  Great friendly staff, nice courtyard. Excell","useful":0,"cool":0},"p4WvVWdefebmdxsHw0U2ug":{"text":"We were looking for a quick bite to eat before heading to one of those ghost tours and stu","useful":2,"cool":1},"fMuqf9bAJzJh_6Oop3HY-w":{"text":"Loved, loved, loved this delightful little restaurant!  The patio atmosphere is oh so char","useful":0,"cool":0},"t9rQcnWbjmV2G0OsHO7L5w":{"text":"I came here a few nights ago with two friends. We were in town visiting for the weekend an","useful":0,"cool":0},"tjoZiqm1SRxy7pnuKJd2kQ":{"text":"5 words. Wine and bacon happy hour! I stayed across the street from this place and decided","useful":0,"cool":0},"yDfg-eSR381RTF-ewwlogw":{"text":"The best meal we had in New Orleans. Not pretentious at all. Quality preparations, fresh i","useful":0,"cool":0},"wIXDD1Cj6OlV8I8g4Eie1w":{"text":"Great little place off Bourbon street, the court yard was nice and relaxing. Had the Angus","useful":1,"cool":1},"xH40xIGCTsJMr__sj-IMjA":{"text":"Everything about our dinner here was excellent.  We went during happy hour to have a drink","useful":0,"cool":0},"2Ats-VvYH-dJP_P5MEDkKw":{"text":"i love the seafood and creole in new orleans but the boy is quite picky.  this restaurant ","useful":1,"cool":0},"9nR4nDCbxSz5gpnzYZUDNg":{"text":"Sweet intimate restaurant with amazing food! We had the baked Brie, lamb and crab cakes. G","useful":0,"cool":0},"gQdldCe63Bl8PnHNQBK6ug":{"text":"This bar is part of the Tropical Isle & Funky Pirate family.\n\nTropical Isle Bourbon at 721","useful":0,"cool":0},"ZoPN4pr6SLAZdcUVN9ZltA":{"text":"I shall call this place Grapevine the Destroyer!  This is our second visit within five yea","useful":1,"cool":0},"_ZDdovzGXCrgVcEAU2MvPQ":{"text":"This place is across the street from the hotel we were staying at so decided to stop in fo","useful":0,"cool":0},"5_Oz5McCK_dwMlxZJfzy1Q":{"text":"Went as part of a party of six.  Our waitress was very friendly and our food arrived prett","useful":0,"cool":0},"N1W9Yj_NmO7nZGfWw3ZTxA":{"text":"This place must be a hidden gem as it wasn't crowded,but it was fabulous.  In fact we will","useful":0,"cool":0},"8GpPrIl1LIGWe8ZxbZd1Zg":{"text":"I went there for dinner with a friend. The decor is dark and nothing really all that speci","useful":3,"cool":0},"eb1hag2chBM9Mv82hH6lGQ":{"text":"Just an awesome, cozy little hangout. Perfect for date night or a couples night out. You h","useful":0,"cool":0},"suU1ArBMaDHkC7Xh_FVB_g":{"text":"What a great little find... they have bottomless bacon happy hours and the most amazing \"g","useful":1,"cool":1},"Xm0Bsz22mwpGh6Q_XX4gJQ":{"text":"In a week-long vacation, this restaurant was the best out of a long list of staple New Orl","useful":1,"cool":0},"FQs3_-TcZ7_9VCd3SE3RuQ":{"text":"Great cocktails, great wine (we had a Frenchman's 75 and a wine mix called \"the other\" on ","useful":0,"cool":0},"xBS-xWvaa9la9j7il7V1kw":{"text":"Great value for both wine and apps. Service was great... The staff will let you try the wi","useful":2,"cool":1},"fYg5f-p_m085bdmUzTYlkg":{"text":"I can only speak to the service, great wine and whiskey. My fiancé and I did not eat but e","useful":0,"cool":0},"8Yoi4p1nFILx4bdxlVdq-w":{"text":"Fantastic courtyard and beautiful food. The Penfolds RWT is way underpriced so go for it! ","useful":1,"cool":0},"Bz6Bp8mbAkaDwBd88lwhXw":{"text":"Great servers,  wonderful atmosphere and delicious meals..saffron mussels were amazing!","useful":0,"cool":0},"8CQ2_uQUPuC-Xhg-2KA-IA":{"text":"I'm so in love with this lovely establishment. Wonderful service, the best filet and crab ","useful":0,"cool":0},"KQoVtA9YBkhk0kmotlAxxA":{"text":"This place had so much potential when we saw the inside and decided to sit at the bar! The","useful":0,"cool":0},"TpWVT1cZjXfBFt0RYmxkHg":{"text":"This is a little gem across from the Bourbon Orleans Hotel. Walked out the door and crosse","useful":1,"cool":2},"uNEhxQoyv7AEEOAfoA1DOQ":{"text":"Wonderful get-a-way from the craziness on Bourbon Street.  Perfect for a nice dinner where","useful":2,"cool":1},"Faglc-sHUB3kQbWKUrV-rA":{"text":"Great opportunity to get off Bourbon St. And enjoy a good glass of wine with a friendly st","useful":0,"cool":0},"CNRof6-G4O8BkfHy2m7wVg":{"text":"It was my husband and I anniversary and had decided to eat here due to a little research. ","useful":1,"cool":1},"bW2bJubacZI3ZaP0gKM9Lg":{"text":"This used to be my Favorite restaurant in all the world. I seldom visit NOLA without at le","useful":0,"cool":0},"XJQO2AAMohyEiP-ZfhcN-Q":{"text":"A cute little place, especially if you sit in the courtyard. Mostly quiet and relaxing. Gr","useful":1,"cool":0},"I2wsLYqXGSBYLKmx44ia0Q":{"text":"I love this place!!! Classy, great food, fantastic wine, and the best bartender in NOLA!!!","useful":0,"cool":0},"T0BPixld5C-WtuhzNNSITw":{"text":"I've been here a few times and always love.  The garden is so peaceful and pretty.  And th","useful":0,"cool":0},"uV3q48LCUVvSXk6gzkCUbQ":{"text":"This was a nice little diversion from Bourbon street. It's a tight place and if it's going","useful":0,"cool":0},"tYkS2dScWLEiz6Si7E3X4g":{"text":"Five stars for service and food. Must make reservations. I had crab cakes and my husband h","useful":0,"cool":0},"vpqZ1S2NCmCsb2aPFdttgA":{"text":"The food here is delicious! Sat at bar and service was good. We started with scallops whic","useful":0,"cool":0},"bp4Ab3kk_98TZypYQd8hBQ":{"text":"Martini was better than average, but the restaurant feels worn out. like an Olive Garden f","useful":0,"cool":0},"rFFq4bjcYfykgGlRCpiCAg":{"text":"This was some of the best food we had while we had in New Orleans. We got the amberjack wh","useful":1,"cool":1},"86EZKcRprTJnzUBhsndbRQ":{"text":"Needed a quick bite to eat before the New Years festivities , and this was the perfect pla","useful":0,"cool":0},"BI6hKyfuOGsCu2iyuEF_Fg":{"text":"This wine bar is a nice break from (excessive) beer and alcohol found throughout the Frenc","useful":0,"cool":0},"3uJv8zK3BPBRz7N6K3zSkA":{"text":"Another fine small restaurant I have visited in NOLA. The service is excellent and the foo","useful":0,"cool":0},"5NLxzM2FZ5FnxA_o7zEfdQ":{"text":"We returned to this venue after our last trip to New Orleans because the Bbq shrimp was am","useful":0,"cool":0},"p2m85z4HSzZLr2MHYN7cmQ":{"text":"Good atmosphere with a nice courtyard patio. Yet, we were told we would be seated in the p","useful":4,"cool":0},"QEHRcKFHgaKyp1n5VVHH2g":{"text":"I was walking around bourbon street and i came across this little gem. Be careful because ","useful":0,"cool":0},"k7IYPetXZgrCWEbUcQcGSA":{"text":"LOVE the ambience of this place and the garden in the back is romantic and private.  The d","useful":2,"cool":2},"JxXJoNWCb2E72nz0Jcd8TA":{"text":"Wonderful service. Definitely sit in the courtyard - enjoy the lights and water fountain. ","useful":2,"cool":0},"oUq72ZxzeliSRrN56IYGIQ":{"text":"Hands down best meal I had in Nola, and trust me I ate a lot. Had the gumbo, saffron musse","useful":2,"cool":0},"RcxixC7ZbPdLkr1qUWRWVQ":{"text":"I never thought wine & bacon would go together so well. This is another got to go place in","useful":0,"cool":0},"RxmmSMp8IfxUCFOP2Llznw":{"text":"Great wine selection.  None of that touristy feel that much of the quarter can sometimes e","useful":2,"cool":1},"NIMCFqeUX-GNtrOOAUI0Sg":{"text":"I went to dinner here on the recommendation of the concierge of the hotel I was staying at","useful":0,"cool":0},"tZ7O3TkDjYFV2hJgfY2Lcw":{"text":"Best crab cakes ever!!! Ahhmazing! I would go back over and over just for these! I also ha","useful":2,"cool":0},"i7YyG3ezUg4QOQLjK4PvuQ":{"text":"The best place to eat in the French Quarter.  Go for a delicious, bistro fare with a Cajun","useful":1,"cool":1},"t1PykzGW-xSwvHMT6lk0ow":{"text":"Best cheese plate I have ever had. My husband does not drink wine but was happy with the b","useful":1,"cool":0},"aw-ly6jcYnwrSX1JkOVnkw":{"text":"Delicious surf and turf! Tucked away in a corner off bourbon- really nice atmosphere.","useful":0,"cool":0},"cEr96xfSIcbmDNwE3A8XsQ":{"text":"Went out to the French Quarter for the Barkus parade. My wife started talking to this lady","useful":0,"cool":0},"ajuBczkcheZEX6fWewsunA":{"text":"Happy hour is great. Service not so much. Go on the weekends when Kelly is bartending, she","useful":1,"cool":0},"w3_V6D9Nk5_KQnbUkSu0gw":{"text":"I don't write many reviews, but felt the need to comment on the dinner my wife and I exper","useful":0,"cool":0},"XjHR5LkuQppHY6D3Ux3xUQ":{"text":"This place was recommended to us from a local bar. It is hidden and out of the way and if ","useful":0,"cool":0},"1OiQPfQeSkMOP-IAkVGhqw":{"text":"This is a little place tucked in off of Orleans Avenue in the French Quarter and was quite","useful":1,"cool":0},"F-L5k52VUYxZ4l41VUu1Vw":{"text":"My friend and I went to Grapevine on our weekend trip to New Orleans. Having arrived early","useful":0,"cool":1},"RkK51FZdIEz3-A7u174IIg":{"text":"Mature wine bar, very professional staff and nice menu....a block or two off Bourbon Stree","useful":0,"cool":0},"RhK5bSX7CAwWZn-A9RMixg":{"text":"Enjoyed a glass of wine at the bar for three consecutive nights.  Nice bartender, knowledg","useful":0,"cool":0},"HYfVEImGJtMPCYBU2amKfg":{"text":"Absolutely great I have eaten here for years and love it!! I never have had a bad experien","useful":0,"cool":0},"LyljjSSmg-LIPLE9bFmh2w":{"text":"We stopped by here to start our night off with some of their delicious Brie and fresh bake","useful":1,"cool":0},"xrs7EgUXU_uwkrhUvst92A":{"text":"So far my wife loved the red snapper dish, I had a tomato basil soup and I totally loved i","useful":0,"cool":0},"Tu5GPML_aeojrjg5dKRRQA":{"text":"Stellar spot for a glass, flight, or minor julep. The entire staff is very knowledgeable, ","useful":0,"cool":1},"k2V2UL7M-RVFd1NkliMU3Q":{"text":"This was truly an oasis in the French Quarter.  One block away as noise and chaos.  When w","useful":0,"cool":0},"Zz8kS0zBkrnaCOW-BdFy-g":{"text":"Hubby wasn't impressed with his \"garden seat\" one bit which was very comical to me. I howe","useful":0,"cool":0},"PtQR3XNZtsy0Xj2guXyV9g":{"text":"Great food, excellent service. Bartender made awesome drinks. We all got the fish special,","useful":3,"cool":1},"vVWzsOrT8d8Ju8YFMRPx8A":{"text":"In New Orleans for 5 days and ate here twice! One if the best wine lists in the French Qua","useful":0,"cool":0},"dJM1tZixhOoncsV8naFUrA":{"text":"A gem.  First off, Grapevine was easy to get into ON A FRIDAY without a reservation.  This","useful":0,"cool":0},"ZFJ8vOGcZiUR-7wd7v2OlQ":{"text":"Love this small little place! Just one block away from Bourbon st, this little gem is a gr","useful":0,"cool":0},"hNlXA6cxMEA6UqS326x8Zg":{"text":"The service REALLY added to the delicious fresh bread with olive butter, wine and dinner, ","useful":0,"cool":0},"g1o1NvskciefwinRzv4cuw":{"text":"Lovely little place we stumbled upon across from our hotel (the also excellent Bourbon Orl","useful":0,"cool":0},"R1__PvYZ2CJze5nT_s-B6g":{"text":"Lovely, kind of hidden spot in the French quarter. Great cheese board, devious mussels, ve","useful":0,"cool":0},"dG86Quf970_pXniaL3mnJQ":{"text":"This is one of my favorite places to dine at in New Orleans. We've been here multiple time","useful":1,"cool":1},"D83Cw7Eyb5DXT79npG3cag":{"text":"ate here last weekend.  they were busy, but our waitress and others were attentive.  \n\nmy ","useful":0,"cool":0},"TVV0EsXPv_jZ-ukE5SXWmQ":{"text":"This place is great.  It's very quite and low lit for a nice dinner for two, right in the ","useful":2,"cool":0},"k1RBSYr0C9D9PE86oJIAJQ":{"text":"This is probably one of my favorite places to eat in New Orleans. I always get the oysters","useful":1,"cool":0},"PLD5QPuoO8le9gKNxyU4bQ":{"text":"Went there tonight. All I have to say is the food is great but the service is TERRIBLE!!! ","useful":0,"cool":0},"_OgWxX6MzOgXiFJU63hqPQ":{"text":"I would say this place is a solid 3.5 / 5 place.  We came here one night during our New Or","useful":0,"cool":0},"xwi11N3iVxEl4ISLPSjdqA":{"text":"Totally beautiful court yard. We went without a reservation. Lights and a great atmosphere","useful":1,"cool":0},"TTwUUm_NgBENySECsRQ3JQ":{"text":"Pretty solid place  for dinner. Beef medallions, sea scallops over a bed of wild rice and ","useful":1,"cool":1},"bN-XnVasVnjAqALVVweTmA":{"text":"The food was good also the wine but it was too expensive for what it was. Service ok but n","useful":0,"cool":0},"t294-kS8Rn3rMqQWLMUq3g":{"text":"Expensive for mediocre food, and the place looks like it was decorated with a bunch of stu","useful":0,"cool":1},"tJtX02CtCmxnwTAxfKS7lA":{"text":"Come see Stephanie!!! She's amazing and will take care of you like no other! \n\nThe chef's ","useful":0,"cool":0},"RL2mj6oDjmRD-I-114fiCg":{"text":"Great sauvigning blanc from NZ. The bacon happy hour was a nice surprise and it's a great ","useful":0,"cool":0},"W4TjJ0co7WWYX47hYPp8yA":{"text":"Wow.Wow.What a great find! The food was awesome and the service was just a good. Ron our w","useful":0,"cool":0},"WcpS2Fs_C_yi-tlbtxSwww":{"text":"This small wine bar is hidden behind the St. Louis Cathedral. It came recommended to us, s","useful":1,"cool":1},"aXD26n8Ubep1snwEaMHFvw":{"text":"I'm a fan of Orleans Grapevine. It's one of the nicer quaint little french quarter restaur","useful":3,"cool":2},"FTErMDF0LCa9v_b7Jo6HBw":{"text":"Sunshine was a great smile behind the bar, wine was very good, piano was playing, nice lig","useful":0,"cool":0},"NkzWJUZ_EGjuX4JzfnSqvw":{"text":"Out of 6 nights in New Orleans, we dined there four times!  Outstanding service, outstandi","useful":0,"cool":0},"-5fVym3rAbBJpbUkMXFLWw":{"text":"The outside patio was to die for...the cheese plate we ordered came out and the waitress d","useful":0,"cool":0},"0DZ7memNOHq16EZ-xc9aUg":{"text":"Great wine flights and friendly service. Shine was knowledgeable and entertaining. Great s","useful":1,"cool":0},"9Y9Y_C5i-hBjQKhxcjFQXw":{"text":"Great hidden gem in the quarter! I am not sure I want to let this cat out of the bag! Walk","useful":0,"cool":0},"MPCkii0WBkdYNMeVwzspjQ":{"text":"Very good! We were staying across the street at the Bourbon Orleans, and on a whim decided","useful":0,"cool":0},"7RpoIYKEv-UF5kIHuXeWkQ":{"text":"I first came here in April as suggested by the ladies at the New Orleans cooking school. W","useful":1,"cool":1},"8yTCugpexyyRxXCeWDFvnQ":{"text":"Delicious food and good service. It was conveniently located across the street from my hot","useful":0,"cool":0},"HF52utOIdbXaY5Os-D16Kg":{"text":"I have never experienced such rude unkind behavior. The entire experience was a bummer! Ha","useful":1,"cool":0},"xTmIQOJ3Iu_2FsIq0mWfYw":{"text":"We found this gem by accident since it was raining and across the road from where we were ","useful":0,"cool":0},"eEMFmPkvj3AcFcj4fwUwdg":{"text":"Mellow bar on a Sat night.  Good escape from the heat and the rain to enjoy a nice glass o","useful":0,"cool":0},"hlhpPmMp7odWdqZeMkl5mQ":{"text":"Would love to tell you about the food.\nBut we didn't get any.\n\nWe were literally the only ","useful":1,"cool":0},"NzwEjqK7t3x4eQsBEs_eTQ":{"text":"Visiting New Orleans, we had our taste of Cajun/Creole, but wanted to go for some traditio","useful":0,"cool":0},"l_YOAMZhxQefYzdLrPHFRg":{"text":"One of the best seafood gumbos I've tasted.  Such quaint place with superb service.  The s","useful":1,"cool":0},"P62HTBel9TeP4HlBTEOmBQ":{"text":"Charming, intimate setting in the French Quarter. Creative menu, delicious food, friendly ","useful":0,"cool":0},"lhHhLwFBGroRfFQ6ZFn79Q":{"text":"Quick service. Bread they give you is fantastic. Vegetables, stuffed flounder, potatoes al","useful":1,"cool":0},"t8uixZlltnT0mteZU4XIrw":{"text":"Lovely little quaint spot right off of Bourbon. Please go here for the bacon happy hour!","useful":0,"cool":0},"ZfGxe9enCd3ID_EA-SD3qg":{"text":"This place was recommended by our hotel concierge. First night we ordered a few bottles of","useful":0,"cool":0},"wWXBZhcOESSqS7tT0wd0og":{"text":"Thought I had died and gone to heaven when we found this little gem. Variety cheese platte","useful":0,"cool":0},"ASLwp2of8IxsYqeZHuKJ-Q":{"text":"Came here last Thursday.  Started off with some Rose.  Perfect!  We decided to get the BBQ","useful":2,"cool":2},"XugFJ387dQNaADr7dt5oGQ":{"text":"Charming, romantic restaurant. The patio is exactly what I was hoping for in New Orleans, ","useful":0,"cool":0},"tlCETNDtYyGPsdd-WbeQsg":{"text":"From a 5 to a 2.   Oysters Earl was a plate of shells and sauce with oysters no larger tha","useful":0,"cool":0},"tIaMw-o_iqUuyMWaY9MsEQ":{"text":"\"Meh\" is exactly right.\n\nEdible, but not great or particularly good food.  Pleasant, talka","useful":1,"cool":0},"wRX24h2Jc0zHHsWkBnJEKA":{"text":"Did you say bacon ? Well sign me up! Sit at the bar and munch of some deliciousness as you","useful":2,"cool":2},"c990atJ6kef1v0ggcwfogg":{"text":"Crab cakes, shrimp and goat cheesecake were great!\nLove their free bacon but service was n","useful":0,"cool":0},"QcVJKOX4lcwtaYaX0GKQAw":{"text":"Food was great, service was atrocious. We were there early Saturday night,\nNot busy at all","useful":0,"cool":0},"CaEBLeCEuzz7GndFgw-XjQ":{"text":"We've been here twice so far and both times were fantastic. We ordered the Duck Breast Sal","useful":1,"cool":0},"GySLPOeUWIt-jq2_gD296A":{"text":"Stopped in to cool off on a very hot afternoon.  Great happy hour wine and beer prices and","useful":0,"cool":0},"m1WDWqAwG7tiWqdu8_suDA":{"text":"A diamond among so many choices!  Ask for Gerald!  We love him and we love returning year ","useful":1,"cool":0},"jneKokdKj_RFHQXIXGZGJQ":{"text":"The service is splendid, I would give this place 5/5* if it were based solely on that. The","useful":0,"cool":0},"Tu5OPSzDvTRvoz6yS_LRKg":{"text":"Awesome! Consistently wonderful & perfectly cooked food! Their chefs should really be appl","useful":0,"cool":0},"dBKxPKHD9oQQLFosHGL3uQ":{"text":"This place is the highlight of my stay in New Orleans! It was recommended by my boss. Ever","useful":3,"cool":0},"lkLWo5sCNRgJIQJtaVRwbw":{"text":"This place was the highlight of our visit to New Orleans! The wait staff way attentive and","useful":0,"cool":0},"8nsL8_8RTRKC8oF59v6goQ":{"text":"great atmosphere. Kinda pricey but food tasted really really good. We had spinach salad an","useful":2,"cool":1},"RA1GKSO8zEjALN7BJrWn5Q":{"text":"Finding a little place like Orleans Grapevine tucked just off Bourbon Street was like find","useful":0,"cool":0},"bd343acEO4GTbJ1mcgagUA":{"text":"A hidden little gem slightly off the beaten path... Good selection of wines, quality drink","useful":1,"cool":0},"UZtOkHrxQkJOCRLnXEt4yQ":{"text":"This place used to be one of the restaurants we would always come back to, back when I liv","useful":2,"cool":1},"NoLLlzzdSaFo4UqjmJXWTA":{"text":"This cute little place is right off of Bourbon Street in the French Quarter. Nice, heated ","useful":2,"cool":0},"DpVimzWkdMBXD71lf2kPnw":{"text":"One of my all time fav local casual eclectic cafes. Amazing amazing amazing! About sums up","useful":0,"cool":0},"md1gTq496Pkvmycsqc_zzA":{"text":"Our new favorite restaurant in New Orleans. Great atmosphere, service and amazing food. Th","useful":0,"cool":0},"hRK5jhy-8WiYbne05lCf3Q":{"text":"Very good service but food so and so...\nShrimp barbecue was good but the almandine fish wa","useful":0,"cool":0},"s2LlkKoY1FLCmFn4rAVSXw":{"text":"Great wine and cheese bar in the Quarter! Outside back seating is quiet and intimate with ","useful":0,"cool":0},"_xM4OUhvFQWoX-Owd0ap5Q":{"text":"Loved this place. It often takes us a while to figure out where to go wen walking around t","useful":1,"cool":0},"X8HGqfTSwDOiTgsaxVH4dQ":{"text":"Meh. This place was better last year. The service was friendlier, the prices were lower, a","useful":1,"cool":0},"iKSR4YAN2Z4YahR3Gax-WQ":{"text":"Nice place, but be careful with who's working! Awesome wine, good fresh hot bread with gar","useful":4,"cool":0},"uRfJ0wLXQkRHezm2-zfwdA":{"text":"Man we loved this place!\nStopped off on our first night in NOLA for an appetizer and some ","useful":0,"cool":0},"x6J9hRZUCetBZpr77sX88g":{"text":"My husband and I, along with another couple, ate dinner here last Saturday evening. Excell","useful":0,"cool":0},"OwSD6LyTVlHb2Ju596-H2A":{"text":"We went again this evening.  We only got a cheese board, but once again, service was spot ","useful":0,"cool":0},"U1siviYmAPXkzn2SDPZMoQ":{"text":"We were happy to have found this place accidentally - a glass of wine is exactly what we w","useful":3,"cool":2},"KDBj9k8FZ1OGn9oS2mjp8A":{"text":"Anna our server is great. She really knows the food and wine pairings and is a fantastic h","useful":0,"cool":0},"ekTTKRgBTY447-M_5AL4Bw":{"text":"Nice atmosphere. Stopped in twice for a wine flight. The second time we purchased a cheese","useful":0,"cool":0},"P7Xj2FecPgz5V44M7AhyCg":{"text":"Honestly have no complaints. Came here for our anniversary dinner. Sat in the courtyard. W","useful":1,"cool":0},"tYYFCsR5pLICxmMPato2Kw":{"text":"Love this quiet small place, not even a block off bourbon street, but a whole different wo","useful":1,"cool":2},"-b5wvNRG007nrI4jtClsRQ":{"text":"Worst service I have ever had! We spent money 2 nights at this place, which is located acr","useful":2,"cool":0},"SIZbN7jjejOFMYjOOZL5jw":{"text":"Thoroughly disappointed. If you're looking for a pleasant atmosphere in which to enjoy a t","useful":1,"cool":0},"KputoGlSmHhI05ntPNGNHQ":{"text":"Unforgettable barbecue shrimp. I honestly don't even really like shrimp and when my bf ord","useful":0,"cool":0},"RsJTNCymITZVVoa6PMROzQ":{"text":"Delicious, delicious, delicious. Had the duck and andouille gumbo and was amazed by how go","useful":0,"cool":0},"Anlm8LEHVZectXmPyA-irA":{"text":"One of the treasures of the French Quarter, tucked just off of Bourbon Street in the 700 b","useful":0,"cool":0},"lB2N_NtMSjv8ZG7Zt0AYGQ":{"text":"A French Quarter treasure with a great outdoor courtyard and wine menu. They offer wine fl","useful":0,"cool":0},"x38mzmrq9ReCLbnlnHuBsg":{"text":"Last nights meal was a joy. Gumbo soup, monkfish salad, scallops. We had a great time. Ste","useful":0,"cool":0},"LsPE-614TH5MnZz_a3jo2Q":{"text":"I know what you are thinking...this place is way to close to bourbon so its probably touri","useful":2,"cool":0},"OYraiiuJYbUAarSfxdC_cQ":{"text":"Amazing courtyard, lovely wine, friendly waitress. Even better, they have two happy hours ","useful":1,"cool":0},"oIcvHWano5sMe9Z1eD_D6A":{"text":"Two must haves:   the baked brie and the goat cheese cheesecake.   Mind-blowing.     The c","useful":1,"cool":0},"iacmJJznu51pouvLKaxR_w":{"text":"A great place to meet up with friends and have a glass or two of wine. The atmosphere was ","useful":1,"cool":0},"-SOOZDqS4NEmqKOyAjtcZw":{"text":"Went to Orleans Grapevine with a friend.  Carol was incredible, she took such great care o","useful":0,"cool":0},"XzgbomJaw8wm7qa_YiFAgQ":{"text":"Made the mistake of going out on NYE in the French Quarter without a reservation for dinne","useful":0,"cool":0},"XamN-mo-Vc3dFFkPtenS8Q":{"text":"The food was great! We ordered lamb and angus. They were both really good.  The only reaso","useful":0,"cool":0},"eIHjty-qtSMezMlydi51iw":{"text":"Excellent food.  Not to mention cozy courtyard and atmosphere.  Our waiter was the best.","useful":1,"cool":0},"h7amaAtDnCq5nNM8HwN-7g":{"text":"Delicious. Absolutely perfect. Quiet. Amazing food. Great waitresses. The cheese was fanta","useful":0,"cool":0},"A6gA-e45SEYogY5fSpDoFw":{"text":"Stumbled into this place looking for soup to bring back to sick friend.  Ended up coming b","useful":1,"cool":1},"7PTYU-bqMgP9_OJewwYJfQ":{"text":"We loved the atmosphere in the outdoors courtyard. The baked oysters were delicious. We sh","useful":0,"cool":0},"P5aZQEYH3Uzud9_G6Ds8MQ":{"text":"This is one of our favorites in New Orleans! Awesome atmosphere and amazing food! We love ","useful":0,"cool":0},"dBX7KL5mtIrEFy4QlS5O_w":{"text":"Very cute and nice little restaurant - very cute patio - very nice staff!!  Great food and","useful":0,"cool":0},"eQiOirGFEBTTY0hNOj6xIQ":{"text":"Outstanding food, wine, and ambience. Staff were briefly overwhelmed by Friday night rush,","useful":0,"cool":0},"k0RsDRgnQamtCJQbDCnBlw":{"text":"Loved this place. They have a really nice outdoor seating area. It's a wine bar but they h","useful":0,"cool":0},"RiMkMjFr7B2RbAn4pGq2EA":{"text":"Phenomenal. Great wine. Incredible atmosphere. Great service. We had salads, cauliflower s","useful":1,"cool":0},"mB-iROUjN5UBaxmA18sGcA":{"text":"The atmosphere was quiet and a little romantic, but there were more groups of business tra","useful":0,"cool":0},"gnKQWJdYwGKe3MS2sCByqg":{"text":"SO cute and absolutely a wonderful respite from all the trashy dives in nola!\n\nIf you're f","useful":0,"cool":0},"xSZ2GpXnS0cwQ3bVJzNFsQ":{"text":"We had a great time in the courtyard of Grapevine! Husband and I came here for some drinks","useful":0,"cool":0},"IN2hPyvKPFkvA1an4KK-2w":{"text":"The owner was driving down Royal nearly ran me down on the bike when trying to pass approa","useful":2,"cool":0},"pZGO9fY7pwHnVyIvD-0k_w":{"text":"A French, French Quarter wine bar with romantic atmosphere inside and out, escaping the bu","useful":0,"cool":0},"UQwEvEtryKLP6ggtrJtMEg":{"text":"Terrible service... but probably just our particular waitress. Cool for tourist or to brin","useful":0,"cool":0},"YbWrg_t11Y-KQE9RTaUzXA":{"text":"I was looking for a place to get a good glass of wine. Another bar suggested this place. W","useful":0,"cool":0},"hFMeYeMBfv5fKeHAelhfDg":{"text":"There should be 6  for places like this. It simply nails all the hi notes, mainly cause ev","useful":0,"cool":0},"4OslVNK31dJ4NFL46KXy0A":{"text":"Bacon happy hour!  Best idea ever!  Excellent staff, and did I mention drinks served with ","useful":1,"cool":0},"5Vb8EmHthpv1_HnlOvRHcQ":{"text":"The single best restaraunt in New Orleans. The service here is unparalleled anywhere, in a","useful":0,"cool":0},"TqVq1J2d6QgyGHyEg7mlaQ":{"text":"Went back tonight after a two year absence. It has unfortunately declined from a great exp","useful":0,"cool":0},"PRV4T1JYkNtosKtqBdgh1Q":{"text":"This was so far our best dining experience in NOLA.  Great service, wine, and food!  We go","useful":0,"cool":0},"h5Lxc3Yu5R2q-Ez3Z2eSEw":{"text":"Great food! Second time visiting and the food was amazing! Made it to late night happy hou","useful":1,"cool":2},"4KGr5M3uO7-WsU4ePdCKqQ":{"text":"Interesting but very rude workers. So after spending over $300. There on two separate occa","useful":1,"cool":0},"SOsHOwmC7Kc-mFPFz_HbdA":{"text":"First off, let me begin by saying I'm not a wine connoisseur and I started drinking wine 2","useful":0,"cool":0},"c1z_3fF_-UQvgqX4Cdxy_A":{"text":"Great food, pricey but worth it. Everything I've had here has been absolutely delicious.\nD","useful":0,"cool":0},"BDn4cB0BGWLLEkq7e7BfOw":{"text":"Hard to find good wine in this town. Glad that we stumbled into this place. They had my fa","useful":0,"cool":0},"OfkMuvOAE6UhHiCdnv19DQ":{"text":"I stopped by here after a few days spent eating heavy yet oh so tasty Cajun food, I needed","useful":4,"cool":0},"tD46GSCzSWaz6CVd-JVLTw":{"text":"The outdoor patio was fantastic. It absolutely made the experience. \n\nOur waiter Ron was a","useful":0,"cool":0},"4wgzu6spEufJOYwfbWZzEQ":{"text":"One of my favorite restaurants in Nola. Parking is a bitch but the food makes up for it. T","useful":0,"cool":0},"Z9bKhPsb4o8H9Feups646Q":{"text":"One of my favorite places to eat on my recent trip to New Orleans! Great happy hour and Ap","useful":0,"cool":0},"ZmGimYaz9KjzGMgNQi5OMA":{"text":"Had a great dinner at Orleans Grape Vine.  The food was just spectacular.  Our server Bria","useful":0,"cool":0},"Fn5fwzAQlg_vQar7ih2rcQ":{"text":"great fare if you are eating light of looking to fill the tank. Great look and feel to the","useful":0,"cool":0},"chYwxs4NlZythUkeaOBgnA":{"text":"Amazing \"Bacon\" Happy Hour. Why don't more places do this? Genius. The cheese plate we got","useful":1,"cool":0},"iuM7HXJFXYodzJWcKqfu0w":{"text":"The bread, gumbo and crab cakes were amazing. The service was also great. If you're in New","useful":1,"cool":0},"ESyDzsycElKSAa-DLqctJA":{"text":"Read the reviews and was hoping to get good service. We did! And the food was amazing! Com","useful":0,"cool":0},"-eEF68d28mZKmZlLu2WxpQ":{"text":"We had a great time here! The outdoor courtyard area was really cute too. The server recom","useful":0,"cool":0},"GjQh3co91OXo4kLajuH7gw":{"text":"We had a wonderful meal here and our waiter, Dalvin, gave us exceptional service.  The atm","useful":0,"cool":0},"70z30OVy7LPO_PJL237AQA":{"text":"This place is such a nice escape from the craziness of Bourbon St.  Hard to believe it's o","useful":0,"cool":0},"izecilT9uq3vPnGTzvHySA":{"text":"The concierge suggested this lovely place per our seemingly high maintenance request for a","useful":0,"cool":0},"Nf92HMgCT842rcRnPuKmlA":{"text":"Went here with my mom on a whim after the places we had previously selected looked shady a","useful":0,"cool":0},"1QvhBFpDLUno1CwF4w0Wug":{"text":"The fish with crab was delectable. I had a great experience here a few years ago and walke","useful":0,"cool":0},"R8om0El4PgHFLhHuNf1Ajw":{"text":"We were looking for a quiet, cozy place to have a couple of drinks in the Quarter.  This w","useful":0,"cool":1},"cyDYcjQAR5mc22O0ICWQGQ":{"text":"Loved it! Went on a friend's recommendation to 'try the bread pudding'. We ended up having","useful":0,"cool":0},"rqDC4cOg0HNdJr9KbJI5vg":{"text":"BF and I wanted a nice, quiet and but not too fancy dinner near the Quarter - we found Orl","useful":4,"cool":4},"DOtG85UfQzOZqctQkALfSg":{"text":"Loved the place! Old world, comfortable, great service, quiet, and wonderful food!","useful":0,"cool":0},"ciDG3JaAFrr9javSGyMehQ":{"text":"My friend and I decided to try out this place since we were in the mood for appetizers and","useful":0,"cool":1},"WLfc9c7Tf8QHKEEkBgn-gQ":{"text":"Great environment, the courtyard is beautiful and a real treasure in the midst of the Quar","useful":1,"cool":1},"GWlox_eWwzkS7J3CchiGGA":{"text":"This is the kind of place that doesnt need 1000 people overhyping it. Its like that cool k","useful":0,"cool":0},"guZbG-me9e2u13qgLM6ycg":{"text":"This is a great walk on place. We've never had to wait in line.   Tonight's dinner was goo","useful":1,"cool":0},"WAqpGsewfhbWZmLCFND77A":{"text":"Holy Crap a must visit. Just off of bourbon street. Come during happy hour. Great back sea","useful":0,"cool":0},"PzH7ZAmosJ00Nq_1WnwTkg":{"text":"In a place full of amazing places to eat this is by far one of my favorites! From the baco","useful":1,"cool":0},"YJGeGgoN9o77G0U3WEP8cQ":{"text":"Fell in love with this spot my first night. Was conveniently locatted across the street fr","useful":0,"cool":0},"NXEAcwqe-Igfb4AvuB8rzQ":{"text":"They told us the wait for their courtyard patio would be 20 mins and seated us at the bar.","useful":1,"cool":0},"oRYWBPlZehK3Jq9TLTzI6A":{"text":"Man! don't know how they do it, the kitchen is as small as a broom closet, But the food is","useful":2,"cool":2},"vr-PUDEOgz1GbXG67yHvaA":{"text":"It was a cool little spot but nothing to make me become a regular. It's owned by the same ","useful":1,"cool":0},"91nWOL8QnW_X5kN3bRGGEg":{"text":"We tried Grapevine Orleans on the recommendation from our concierge at The Roosevelt and h","useful":0,"cool":0},"hFiyExms2OuEOpc9XPYwBw":{"text":"The only reason I care to give this place two full stars is because the ambiance is beauti","useful":0,"cool":0},"EOfJZELDWqzzHsEC8AY72w":{"text":"So I ate here tonight after not being able to find a different place.  Yelp, once again, d","useful":0,"cool":1},"w7fNfJB7KI7GYG6d3ao8LQ":{"text":"Great atmosphere, great food and great wine list. Bella our server was also superb! \n\nWoul","useful":1,"cool":0},"Ye_pvbawGgy10tOUwuQ--Q":{"text":"This was not what we expected or hoped for. Hostess was polite but not particularly friend","useful":0,"cool":0},"CcRPLpOIBtYEuz2iilKqqA":{"text":"Used Yelp for the very 1st time to find a good place to eat. What I found was an amazing p","useful":2,"cool":0},"UUorI2h6tbu_mY1QNQX-nQ":{"text":"Excellent, they accommodated my wife who needs to eat Gluten Free. Food was very good and ","useful":0,"cool":0},"GmxXwsXynrVB9_cTuzyuow":{"text":"Happy hour is great. Service not so much. Go on the weekends when Kelly is bartending","useful":0,"cool":0},"e4fdeH99PGC1EpNiALwR6g":{"text":"Ummm. Free Bacon at Happy Hour, hello!  Last stop on our way out of NOLA.  We happen to se","useful":0,"cool":0},"kj2dI_vGKFfi_u4-UR36aA":{"text":"This place is truly great especially if staying at the Bourbon Orleans hotel. I stopped in","useful":0,"cool":0},"-zyL1Peda0l8H07TRTpS5Q":{"text":"This place is a hidden gem. Great classic bistro and NOLA food. Good wine list. Excellent ","useful":2,"cool":1},"yBqKDGJhnfYHBD8Q0BhJIA":{"text":"Beautiful courtyard. Great service. Best wine selection of all the restaurants I've tried.","useful":0,"cool":0},"VQHSCD_YFzIXtboTg6l5dQ":{"text":"Solid place for dinner in New Orleans French Quarter. The best part is the ambiance. It is","useful":0,"cool":1},"KTNiakrqRqcuPDyDCpIDZw":{"text":"We had a wonderful dinner last night - donna was an excellent professional, all the staff ","useful":0,"cool":0},"NIASnwdndaIgURDxkDqRjA":{"text":"Our first night in NOLA and we dined here.\n\nThis place set the bar high for anything that ","useful":0,"cool":0},"xIiVbug8v9vOucyZ95uL6A":{"text":"We decided to stop in here for happy hour since it was conveniently located across the str","useful":3,"cool":0},"4QPnj-cxlXvJFX8EbHSM8Q":{"text":"This restaurant offers fine dining, N.O.La style.  They have dining on on the street, in t","useful":0,"cool":0},"P_MC4AQWo1YNJ-ou5e8mIg":{"text":"As locals, we go different places in the quarter.  This is always in the rotation.  We lov","useful":0,"cool":0},"hTkUr4wsCCaf-EMLLYON6A":{"text":"My husband went to this bistro three (yes, 3) times during a recent business trip so it's ","useful":0,"cool":0},"c20AYmEFGForbXocHSTeLw":{"text":"As with most cities, there are a few places we locals like to keep to ourselves and the Or","useful":1,"cool":1},"RyF3irr7o7udq-hw7o2lKg":{"text":"Went here for drinks on Wednesday 4/23 & dinner Saturday 4/26. I recommend Fresh squeezed ","useful":0,"cool":0},"GF8ZQtjKM_828d5sF1mBqw":{"text":"The first night we walked in the door and had to wait for a table and the bar was covered ","useful":0,"cool":0},"_YECJ7WCG-GJ56qkSqKtKg":{"text":"After having a week in New Orleans (and no car) we had hit every restaurant worth trying..","useful":0,"cool":0},"bG2SFTOO5doDuYENvS4zmQ":{"text":"What a lovely little restaurant! The atmosphere was small and welcoming. They accommodated","useful":0,"cool":0},"HK3ps75q9YP-1mWWiXsXQw":{"text":"We went for the Bacon Happy Hour and received a basket full of bacon with our drinks!  Wha","useful":0,"cool":0},"qOKRISiccff-T8xki5iygQ":{"text":"This was a great place that our Bartender at another lounge recommended for a Pinot Grigio","useful":1,"cool":0},"009FRQlddVOEc9biYdR9vQ":{"text":"Cozy little restaurant just off of bourbon st. They offer a great selection of wine, chees","useful":0,"cool":0},"zpcGyqiEL5mm-bTUQiBmFA":{"text":"Good food, gotta try the lamb. Not to mention cute bartender and waiters.","useful":0,"cool":0},"MUril4lGjeKBBR8l7sc_1g":{"text":"Fabulous evening of dinner, dessert, and wine in a lovely setting! The cheese plate was su","useful":0,"cool":0},"bv0VPD7hx7WQ-WU3MO4UBw":{"text":"This place is an awesome oasis in the French Quarter with a cozy courtyard, great happy ho","useful":3,"cool":0},"jocNASyySCU7ox6Mk11rlQ":{"text":"We found this great find on a side street and boy were we glad we walked in. Simply WONDER","useful":0,"cool":0},"kKfpnDuRVTqAnPibdlPCVA":{"text":"I fell in love with this \"locals\" place when I lived here during culinary school. One of m","useful":0,"cool":0},"cUbcesvYI8S6zM8myAVtpw":{"text":"I've been here a few times but last night we went with a friend and the service was unbeli","useful":0,"cool":0},"85jCH9sRuiLKcMDiRXq3ag":{"text":"Awesome place! Great service (Johnny was wonderful) and great gluten free options. Charmin","useful":0,"cool":0},"PiRpGHuc7RhJWoxSNR2baw":{"text":"Bread pudding to die for. Bbq'd shrimp amazing , lamb terrific and ambiance wonderful. Won","useful":0,"cool":0},"SsiHo2htTTWSZQejvdk1yQ":{"text":"Hands down, the best meal I had in New Orleans. We were walking down Bourbon Street, and w","useful":4,"cool":2},"VB7fHh0UYjRR83jGZ-vvEQ":{"text":"Loved this joint!  You must have the Gruner 'lois' as it accompanies the oyster perfectly!","useful":1,"cool":0},"EFMP1-bb8HAT4aBry30zQg":{"text":"Friendly service. Nice wine selection. We had the saffron mussels, which were good, but ha","useful":0,"cool":0},"MJKNg-iRssE0cy2Z10u89w":{"text":"We stayed across the street at Bourbon Orleans hotel and ate here on 1/14.  The atmosphere","useful":0,"cool":0},"eNeMoqpXj9U5lWXO-xFMTA":{"text":"All I wanted for my birthday was steak and lobster tail and this place did NOT disappoint!","useful":0,"cool":0},"fDDmMItegUEecAiz3V_NYA":{"text":"PERFECTION right in the heart of the French Quarter!! \nWOW!! \nOn our second night in town,","useful":0,"cool":0},"XQA64DVGOZ51WyBF7Wyt5Q":{"text":"This place is delicious. The atmosphere is very romantic - we sat outside on the patio and","useful":0,"cool":0},"pc5x4_183RU6iouTmSKH1Q":{"text":"We went here on New year's day and it was a very nice intimate venue.  Our waiter (sorry I","useful":1,"cool":0},"1AtaSj4M_LH1KE5jHRFmEg":{"text":"Wish I didn't have to give one star food was not the best at all .. but the service is wha","useful":0,"cool":0},"P8tw5aihAIPLQTD9-sr5xQ":{"text":"Definitely a five star establishment! The wine selection is great and the food was absolut","useful":0,"cool":0},"SL-O7DzncTqyj_BhZ0HdIA":{"text":"The rudest, most pretentious woman working there just hung up on me in the middle of my qu","useful":1,"cool":0},"nFSB4UYOtctTw54IHzaMIQ":{"text":"Came in here randomly but boy, did we enjoy it. The Bacon Happy Hour wasn't advertised but","useful":0,"cool":1},"IRuR3FbixGAu-0eHJ7BVkw":{"text":"This place was recommended by our concierge. We ended up going here for my 40th birthday d","useful":1,"cool":1},"0h-g_--bjrVR4ltT59Di1g":{"text":"What a hidden gem!\nSo happy that we stumbled upon this deliciousness of a restaurant \nCozy","useful":0,"cool":0},"LgrKZ_NyEwEL1ZpE_V6vzw":{"text":"We came in because we read reviews of a wonderful patio and we wanted to sit and chat. We ","useful":0,"cool":0},"EHs65Gduobc_HaMqmRJRSQ":{"text":"This is a nice looking wine bar close to Bourbon Street. We came during the happy hour and","useful":0,"cool":0},"kU0SlSbtuIYEYYK36S8zoA":{"text":"Surprisingly nice stop just a few steps from Boubon. Great food. Great courtyard seating.","useful":0,"cool":0},"iySOPi-8fJW8fyBPyrYVdg":{"text":"We were referred to this restaurant by our haunted tour guide, Rose.  This was Hands down ","useful":2,"cool":1},"XGe6YTpVPRWUMkvkihQueA":{"text":"Whenever family or friends roll into town, this is the spot I take them to. My boyfriend a","useful":1,"cool":0},"tYQVgtMmk42Po60_1gMJ_g":{"text":"Hard to find good wine in this town. Glad that we stumbled into this place. They had my fa","useful":0,"cool":0},"l8oyRofL9YRgEqIGva-1Zw":{"text":"Hidden gem.  This place was a wonderful surprise.  We are here in our last night of our tr","useful":0,"cool":0},"ozbhv-1soEaVd9qWJbVOMQ":{"text":"fabulous ...great ambience.... awesome drink, homemade blueberry butter, gumbo, crab cakes","useful":0,"cool":0},"IC3YAdpHKN1OFwE4wEfV-g":{"text":"Very awesome time. We sat on the patio just before Happy Hour ended and Hannah started her","useful":1,"cool":1},"jv52vNO5AWBgkclqcz1x3Q":{"text":"Went back again 2 nights later.  Dickie has been our waiter the last 3 time.  He is friend","useful":0,"cool":0},"B1aI810pVRPaGk2FYIDWyg":{"text":"Went here for dinner on a recommendation from staff member at our hotel, Bourbon Orleans (","useful":0,"cool":0},"VG9N1Bk2t3zWzX-FvKGpiA":{"text":"I had a fabulous Christmas eve here. Although I did not get to try the  bacon happy hour (","useful":4,"cool":5},"7UWgREa0hj8D2uDmMcf4dw":{"text":"We stopped in her for a bottle of wine and some snacks and had a great time. The courtyard","useful":0,"cool":0},"JepvXHotwStaUQXDZqWUgg":{"text":"Great meal!  We weren't too hungry so we didn't have entrees. Started with a cheese plate,","useful":0,"cool":0},"h4Mq8c1FBQ6ODMtn0rN2AA":{"text":"Went there for dinner with my wife during our wedding anniversary trip to new orleans. Foo","useful":0,"cool":0},"qLA8fs7Fkca0NLNnbmSTfg":{"text":"Honestly best dinner ever.\nWe had a special the chef made for tonight and it was fantastic","useful":1,"cool":0},"pgk5VQ1i03VmUedgnqNtDQ":{"text":"Orleans Grapevine is one of our favorites.. possibly our favorite restaurant in the Quarte","useful":2,"cool":0},"eoDp-KgVgp5NwCH3O89Wxg":{"text":"The Dog and I usually stop by this place when we are in New Orleans.  It is in the French ","useful":1,"cool":1},"JufkC7x2HK9GWqljOCwDoQ":{"text":"We have been in NO for a week now and finally a good recommendation!  It is tough to get b","useful":0,"cool":0},"-lM8CWurf1-PaV-Ob6Kgvw":{"text":"Lovely. Great service. Quality food. Secret gem in New Orleans, away from the hustle. We h","useful":1,"cool":1},"q1yL3IffAOGLewvsZBygKQ":{"text":"This is a nicer bar with a wine focus that comes with a nice courtyard and indoor seating.","useful":3,"cool":2},"xDl2RfFcN_6kO3-oamnavg":{"text":"Stopped in to get away from the crowds ,cute place great service and yum on the suger free","useful":1,"cool":1},"b4I2CbcvNrK1Tzo_Y6hMgA":{"text":"My visit here was short, but sweet.  Chill scene right off of Bourbon Street, primarily a ","useful":3,"cool":1},"DlQyXeunP7zQMplS67P6kg":{"text":"Found this great place while in New Orleans this week.  The food was excellent and the ser","useful":0,"cool":0},"dcQ0ecDxHR1zstt_4kXcVg":{"text":"Service 4/5. Food 4/5. We came here one Friday night after being sorely dissatisfied with ","useful":0,"cool":0},"RCI4Tp_fAgUuCZcqZdM4Kw":{"text":"If you're looking for an escape  from the noise and sensory overload of NOLA, come to Orle","useful":1,"cool":1},"FXvw_ISijDYrFDxPiJTSFQ":{"text":"Awesome dining experience with wonderful food. The cheese board was excellent. The staff w","useful":0,"cool":0},"dx37cd6cDSQYsSZfu_Yc7w":{"text":"For me this place was a little stale. Our waiter pretty much forgot a few things we ordere","useful":0,"cool":0},"zldyu76e35nzFaBQ9ONdCg":{"text":"We had the shrimp appetizer l, followed by the tenderloin and lamb chops. Everything was e","useful":0,"cool":0},"6LTHcSLV1U7b8Anwk8D4HA":{"text":"Great little place tucked away in the French Quarter. I ordered the Seared Scallops and wh","useful":0,"cool":0},"p2ApezJ54J6dZYsWGduPrw":{"text":"Orleans Grapevine is the place I go to if I am in the Quarter after 5pm and just want to c","useful":5,"cool":2},"oqkSEHi04GEYYPT_G1N1Vg":{"text":"OK, so I'm no oenophile, but I am a foodie--and I love this place! I've enjoyed the wines ","useful":1,"cool":0},"jiMaO29VRCLO5n5dhDxa2w":{"text":"Lovely happy hour. Pinot flight was excellent. Hanna(h) was a knowledgable, fun and lovely","useful":0,"cool":0},"z-cwhsn9ulgo7lQvHEFVWw":{"text":"Such a great quality place and completely different than Bourbon..... huge selection of wi","useful":1,"cool":1},"9R47q31TgJT-qjnZxSb-7g":{"text":"Bartender was very nice and knowledgeable... atmosphere was ok... cheese plate was very go","useful":0,"cool":0},"BYbvy7Igxh4vhwd_B_dBVQ":{"text":"Went for the bacon happy hour (free bacon! I think some drink specials) and ordered a chee","useful":0,"cool":0},"MO0QbX0I1pUOAiE8bgveNg":{"text":"New Orleans has many places to have dinner, Tonight we wanted more than good food we wante","useful":0,"cool":0},"gaKiU-0oTuSVxZ8HFGn6OQ":{"text":"Terrible management . Haphazard . Did not tell us oysters were grilled and not raw . Did n","useful":0,"cool":0},"eJ1ONxGvjJ6ymLeSk_56rg":{"text":"There aren't words for how incredible my experience was here. The food was incredible: fro","useful":1,"cool":1},"ZDUADG84VKZikZvttsGSmQ":{"text":"We went here only because of the nice terrace. Everything else was awful. The waitress was","useful":0,"cool":0},"ePsKjdRRBjQMUZ0X-UHK2w":{"text":"Loved this place.   New Orleans best kept secret.    Cheese plate was the best.   Shrimp a","useful":0,"cool":0},"qvMialXr1I14n6AhH2uaew":{"text":"found out about this gem from a local. Great boullaibaisse.  we sat on the sidewalk and at","useful":1,"cool":1},"yL_FYIsS-MxWVpRia_uMlg":{"text":"Our party went here TWICE in our five day trip, and it was amazing both times. Our first v","useful":3,"cool":0},"AlNsSQ3A8z7c52f2JAo5vQ":{"text":"Stopped in a the recommendation of two New Orleans locals for a snack last night...   fant","useful":1,"cool":1},"uzic3NW0fzxQB1ikk20Vog":{"text":"I'm giving 2 stars- one for the ambiance and one for the waiter. We sat on the back patio ","useful":0,"cool":0},"RR6yWpwXXFnA97MD85-Ziw":{"text":"Ron was our server. He made our experience unique and throughly enjoyable. Not only did he","useful":0,"cool":0},"Eioaynkf4I4LfvrkPTQVnA":{"text":"This place is great. The barbecue shrimp are really good & old fashioned, the sauce poivre","useful":0,"cool":0},"wgH5NhPWoC2gf2dulAZv8w":{"text":"Went in on a Saturday afternoon around happy hour, it was busy around the bar and most of ","useful":0,"cool":0},"oZwpZMgJ1zJYPkXk2pYxOw":{"text":"Just had a very disappointing expensive dinner at Grapevine. We ordered the Shrimp BBQ - w","useful":0,"cool":0},"wt2CW7gzxkZWrvgPybamBQ":{"text":"My FAVORITE wine bar in New Orleans!! The Nebbiolo is to die for! We always come at least ","useful":0,"cool":0},"55pRGyuoRX8qZRyOUAPxVg":{"text":"Very very very good. Amazing food and lots of flavor. I like the happy hour and bbq shrimp","useful":2,"cool":1},"rOWJju4RPLQrEF0PYskDUA":{"text":"In New Orleans for the first time and wanted a nice dinner with my wife without spending $","useful":0,"cool":0},"jc8iZJHSYnz6f0SyzpGOHA":{"text":"Five stars because of the reasonable prices for a terrific meal in the French Quarter. Gre","useful":0,"cool":0},"lM6P-ylhZSLtPM8GuyD-1A":{"text":"This restaurant was fabulous!  After a recommendation from Armando next door at the Cigar ","useful":1,"cool":0},"zzFfD31wWp8RFHlahkrVkg":{"text":"We stopped in because of the high rating on Yelp. It was really good. Ordered 2 appetizers","useful":0,"cool":0},"fL_OtmSqES3k_27iBqpTrA":{"text":"Loved this place. Great wine and great service. Jessica and Mark were awesome. There was a","useful":0,"cool":0},"66Fr-xJnEfWFsgX4EJEd4Q":{"text":"The place is friendly and nice and old although it was busy and the bartender was very bus","useful":0,"cool":0},"BLAt5vV7tU0wvJRSum3gLw":{"text":"Disappointed in this restaurant. We ordered the angus medallions and the filet and lobster","useful":0,"cool":0},"IK60FYrAVQDetkKF_QkZmw":{"text":"Crabcakes are great here.  Good place to sit and relax with friends.  Tables are small.  S","useful":0,"cool":0},"tzHm-sQ5HK72izQVcnWTyQ":{"text":"Been there a few times now.  Great bacon happy hour!  Food is always good.  Its a great pl","useful":0,"cool":0},"ZNNm7L724hFpaJr8ARru_A":{"text":"This is a great little restaurant tucked away in the French quarter.  They have a good win","useful":0,"cool":0},"vCntIM34Fc9bo_JrAwln_Q":{"text":"Super cute interior patio. Great service. Great food. HH starts at 10 pm! Great little fin","useful":0,"cool":0},"1HbpP8hjGLfjVuBdsqDqhw":{"text":"Nice place for happy hour. I liked the outside courtyard and the location was convenient i","useful":0,"cool":0},"muqXQ7P5-v17CkjXLMArQQ":{"text":"HAPPY HOUR ISN'T\nI ordered the wine flights of pinot noir at Grapevine's 4-6 PM miserly ha","useful":8,"cool":2},"m2lM2VtdtENrXKfWNEHfvQ":{"text":"Love this place , Jason was great,  good wine knowledge and recommended great plates to us","useful":0,"cool":0},"zJ1t9DrkTSgwoUa3GC4WRQ":{"text":"I can't believe this place was across the street from our hotel and we didn't find it till","useful":0,"cool":0},"TNzjjCsEV6CoMdIUDJBtog":{"text":"This place is like a little oasis. We went as a group and sat out on their patio which is ","useful":1,"cool":2},"tTYGXh6-qZ94nCLyaqGDdA":{"text":"Great service, Jason was super attentive and help us out with everything.\nAmazing happy ho","useful":2,"cool":0},"xrkmhVDoinaH6cDvR15P9Q":{"text":"What a nice place to come to on our trip. It was the perfect place to sit and eat somethin","useful":0,"cool":0},"KDcFYzFzdJcMw2HHAS6X_A":{"text":"Horrible service from bartender too busy talking to hostess Sam about piercings. Gross con","useful":1,"cool":0},"3Ah9WfdorJld1dx5923mKw":{"text":"90% of the reason this place gets a 2 is because the service was absolutely terrible!\n\nWe ","useful":1,"cool":0},"lXziJaZdjQ9BFPQUNNmmYw":{"text":"This place was amazing, some of the best food I've had in New Orleans. I had the mushroom ","useful":0,"cool":0},"N-Awr7KeRtHhEVrgyrtZZA":{"text":"Stumbled onto this place and loved it. Our server was Johnny and we sat on the patio. We o","useful":0,"cool":0},"ha7x8m2acEFtTw5ahRAzJA":{"text":"Love this place... visited several times over the course of the week.  Cute little place, ","useful":0,"cool":0},"NouM2Tc44DjozEhlAjS3Qw":{"text":"I don't know how living in this city I haven't been here yet?! This is a true hidden gem j","useful":0,"cool":0},"zaJWUbfP5OiA1X71wO-HsQ":{"text":"Tucked away just across the street from the Bourbon Orleans in the French Quarter is a coz","useful":0,"cool":0},"ezI3AUeCXs9TYt3H9qFrlQ":{"text":"I did not have high hopes in choosing this restaurant - sure, it was conveniently located ","useful":2,"cool":1},"aacILei0KJ5N6UGv6V4QrA":{"text":"I am so thankful to have Orleans Grapevine as a neighbor. I've lost track of how many time","useful":1,"cool":0},"AVTUmeClT9ePDYiZf8V8kw":{"text":"Great service at the bar. Visited with a party of 4 and enjoyed wine flights. Nice ambianc","useful":0,"cool":0},"mc9fdTeCs26hYt1t4k1Z3g":{"text":"Loved having dinner here out back on the patio. Food was fabulous and good selection of ve","useful":0,"cool":0},"W_K6aPcYSkQ9K4zj1h1LKA":{"text":"Great experience here..wonderful selection of wines and sprits..nice music but not blastin","useful":0,"cool":0},"inEKeqneiaUuUJ3-YA_QRA":{"text":"A friend who loves great food highly recommended this place.  Boy, were we ever let down. ","useful":0,"cool":0},"NDSkcrHE6jVdfL_JOfEv2g":{"text":"Excellent cheeseboard, knowledgeable staff, setting can't be beat. The happy hour white wi","useful":1,"cool":0},"ikLdlM3e5STkLm87bmXc-A":{"text":"A lovely find right off Bourbon street. The dining area is cozy and not too loud or crowde","useful":0,"cool":0},"5AXIUE9jIpZmIrNDLclBew":{"text":"Before visiting New Orleans, I read some yelp reviews of this place.  Wow, what a find!  I","useful":0,"cool":0},"7RXUNcVZA1WnGfVTozABEg":{"text":"Three of us were perusing the streets of New Orleans and decided on this place for dinner ","useful":4,"cool":3},"xZIYSGC4kLqr3SnXJ1jSGw":{"text":"Great place, very good menu good selections of apps and excellent cheese plates that make ","useful":2,"cool":0},"Ql0Tsaetj03weERExa0MDg":{"text":"A truly remarkable experience. It started with happy hour. My wife likes hot water so the ","useful":0,"cool":0},"Kn6DdF145Ya570aS066s6Q":{"text":"I have returned 3 nights in a row, so that qualifies as a five star.  Every night was appe","useful":1,"cool":1},"g-nQxh9q35nGgX6Mi5ZhAA":{"text":"Went here a couple weeks ago during the red dress run. Had been there before a year or so ","useful":0,"cool":0},"6eb82dGFW2j3eCGdiATPwA":{"text":"I had a great dinner at Orleans Grapevine last Friday! They don't take reservations so I w","useful":5,"cool":2},"itG6YB-CCf05txBjk-df0A":{"text":"I have walked by dozens of time over 5 yrs and paid no attention- but I am so glad we stop","useful":0,"cool":0},"A_bwTOy-9ukPEZz3bf_vIQ":{"text":"While wandering up Bourbon Street, we decided to find somewhere to eat, but didn't feel we","useful":0,"cool":0},"WFb2KeDEgQZnhihXUqYJXw":{"text":"Second time here; delicious food and attention to detail. Request to sit on the patio for ","useful":0,"cool":0},"bD64_u1BObxtp4Ra1ZyZXg":{"text":"Stopped in for bacon happy hour. What a great idea. Our server Jason invited us to stay fo","useful":0,"cool":0},"HF-Ar4SLcrz6vnJ56quG5A":{"text":"I'm sitting in the restaurant right now. Great place. Food was great, service was great, a","useful":0,"cool":0},"ribF1haxj_7DaQ-9Y2-7kg":{"text":"Great small plates! We particularly liked the gumbo, the crab cakes and the bacon wrapped ","useful":1,"cool":0},"CK7jgWbrWl-4E05ohyR1xA":{"text":"Delicious food and drinks, phenomenal service and tons of gluten free options. Our server ","useful":0,"cool":0},"rQe6uTnhg13t8-AgW8PySg":{"text":"This restaurant is hands down one of my favorite food scene finds in New Orleans. Tucked i","useful":0,"cool":0},"HMbhKaplXL4YzObg7FVRvw":{"text":"Worth the walk as we stayed in the Roosevelt's Waldorf hotel, we walked down past the chao","useful":0,"cool":0},"QM0JBk910Efu-8376kamZg":{"text":"Love this place, must come over here if you're around the neighborhood. Food is great, and","useful":1,"cool":0},"nBoha1icrfuLNxKksXvHNg":{"text":"Total hidden gem! The food was delicious. The ambiance was calm and tranquil. Far from the","useful":0,"cool":0},"qooEC-zkvoG66srjM1-ECg":{"text":"awesome wine bar! \nstumbled in because it was across the street from our hotel. a wonderfu","useful":0,"cool":0},"d8Ro_lF6P6qmbYD1WQtmPw":{"text":"This was a great off-bourbon st place to grab drinks and dinner. We got the crab cakes and","useful":1,"cool":0},"Y6PF8Tf233z4LSOP4PSi4A":{"text":"I've been here many times before (at least 8 or 9 times) but have always sat at a table. I","useful":0,"cool":0},"jAFO-K1Wpy5PUwxn5PJ-zQ":{"text":"This place was absolutely a gem! My co-worker and I are here twice. The bar was awesome. V","useful":0,"cool":0},"StCdx1dZBN86L2Mdv7madw":{"text":"Service and atmosphere was great. I had a steak and lobster that was outstanding, but my w","useful":0,"cool":0},"lhzu-tNrzrjz5SSofGOwkQ":{"text":"BBQ Shrimp were huge with shrimp head on. The bbq sauce tasted like a mixed of ketchup, vi","useful":0,"cool":0},"KiuYkRL-vZoZegbdgL2FuQ":{"text":"We sat at the bar and the service was great.  The big negative is every appetizer arrived ","useful":0,"cool":0},"4Zyc0mwmQa-HvGvezU-nOw":{"text":"This was our second time back since the first time was great! Unfortunately this second ti","useful":0,"cool":0},"bHPQJ2YVSciQKvLF1Ys7sw":{"text":"This place was recommended to us by locals so we knew we had to go. Needless to say, NOT d","useful":0,"cool":0},"YgbzVUUeZ8DX43Qpp0qhgw":{"text":"This place has been in my bookmarks for a really long time and I finally got the opportuni","useful":1,"cool":1},"ZOkiUTVLOg9QQcQR26ULlQ":{"text":"Grapevine is a great neighborhood restaurant full of locals. Our table ordered the barbecu","useful":0,"cool":0},"ET64k_f8I3KvfRaB0dEsaw":{"text":"I went here for my birthday celebration and a romantic night out with the hubby. We sat in","useful":0,"cool":0},"20t2hPLUO4Yn9hdDNVt8_Q":{"text":"Ok I'm not a huge New Orleans fan nor do I love Cajun. This place was fantastic. Great ser","useful":0,"cool":0},"sJNYKP9MokhCSupHCsQ92Q":{"text":"Really liked this little place. The food was tasteful and the service was great. Cozy and ","useful":0,"cool":0},"Sh2sIVeAWesMKT7hGlMD3w":{"text":"Bacon happy hour 2x a day! Warm bread when you order something to eat. KELLY the bartender","useful":0,"cool":0},"sANqPPgzzhj_Q6Xe2_0qvg":{"text":"I enjoyed my time here, my gf and I made this our go-to location when traveling in New Orl","useful":0,"cool":0},"oLEbuF4lmpw8f9zey3ViTQ":{"text":"So this place is adorable. Nestled in the heart of the French quarter with an absolutely s","useful":3,"cool":2},"6mawjq9uL9nsMzeNASBjjw":{"text":"Stumbled (not literally) on to this place, while walking to the Cathedral.  Sat at the bar","useful":0,"cool":0},"Rz4qhoqhefK_MKkPwCkaAg":{"text":"I call this restaurant my happiest accident in NOLA and recommend everyone go there and ha","useful":1,"cool":0},"-w27bQCrQgChoLm9WMWWuQ":{"text":"We arrived in NOLA on a crowded Friday night after several hours of driving, and all we wa","useful":2,"cool":0},"AUIRnBerLInU0EeYD-2nJg":{"text":"Wow, the St Marie Hotel recommended this local place and it was great! Small but wonderful","useful":1,"cool":0},"eH3gVPlwUxV1vlKLE_AbAQ":{"text":"Bacon happy hour..can't get much better than that. Until you see the wine prices and try t","useful":2,"cool":1},"qZ3UoalOnkWKrp7omcwSLw":{"text":"A cozy restaurant and decent meal, but a bit too expensive for what it is. \n\nSince wait fo","useful":9,"cool":4},"urLVOd61DYODQ9wszBZyjA":{"text":"This is the best kept secret in the French Quarter. It's quiet, classy, and always good fo","useful":1,"cool":1},"Y_dXqKslb1kGGIdXBVmkjQ":{"text":"I haven't been back to New Orleans in two years. The Orleans Grapevine has always been my ","useful":0,"cool":1},"2VWLrJNLXAChJLt8UDqnzg":{"text":"Orleans Grapevine is definitely one of the more pricy and upscale restaurants in the Frenc","useful":2,"cool":1},"ehA4PLnU9a9nRz_uDQ8SLQ":{"text":"Orleans Grapevine is the French Quarter's best kept secret. I've dined here numerous times","useful":0,"cool":0},"7hMakfDfDVLsHUD7P0g8pA":{"text":"This place just rocks!\nI was next door smoking a cigar and ready for dinner. The owner rec","useful":1,"cool":1},"y8-vcVjU37RLmrJlTGJxwg":{"text":"This place was across the street from our hotel.  Best wine selection in NOLA.  The cheese","useful":0,"cool":0},"4slA4tQFUNzFL3r890Ul-A":{"text":"Second time going to this restaurant for a good time! First I went was for my birthday & e","useful":0,"cool":0},"A0M15edsvDzp-2VN5U63zg":{"text":"We try to make a stop here every time we are in NOLA. We have always had a great experienc","useful":0,"cool":0},"wFaz5zJ6kzjNbEok7tgm_g":{"text":"If you don't like wine bars, I'm afraid you and I have nothing in common. \n\nEven though th","useful":15,"cool":9},"K1YIiZ47U4vELfh2Beevwg":{"text":"This is for sure our new wine bar. If you're looking for an escape or hiding from Bourbon ","useful":0,"cool":0},"5EvGX0gU02rXus07aE_ucQ":{"text":"This is a great place. The service was awesome and the sangria was great. Only had appetiz","useful":0,"cool":0},"79m0b-YeoSo2Z1Q5tLKl0A":{"text":"It was my friends birthday so we stopped in for drinks. Parking was surprisingly easy, and","useful":1,"cool":0},"yLauSzDh10kCm_LHeqvx_A":{"text":"Amazing location, outdoors is absolutely spectacular. I've been here four different times ","useful":0,"cool":1},"eP_lCRwnDGfrU6YE171DQg":{"text":"This was our first dinner on our trip to New Orleans.  We were tired and very hungry from ","useful":4,"cool":3},"0oke6yE54_0C9gqgr6J95A":{"text":"Oh my goodness me. \nWhat a great accidental find. \n\nWe spent a good chunk of the day walki","useful":2,"cool":2},"OwcUDkuIvKQVjAgPZtrqsQ":{"text":"Wow what generosity. I have to say the staff was very nice to my wife and son. We were on ","useful":1,"cool":1},"QpXWGxxn1rPobEv0lClF1A":{"text":"We've been coming here for many years. The food is constantly excellent! All of the qualit","useful":0,"cool":0},"GNoS0lg1yerQAgqgwiuCWg":{"text":"We enjoyed our Friday night dinner here.  I had the shrimp pasta which was a huge serving ","useful":0,"cool":0},"9_VS3pcIIczLIBkOPXQY3A":{"text":"We are visiting here in the Quarter.  We come about once a year.  Normally, we take recomm","useful":0,"cool":0},"jpLTrIvmRLupZxWwtPWf7g":{"text":"Gotta be the longest and probably best by the glass wine menu in nola.  Had at the house s","useful":0,"cool":0},"R3_UuLFvuxqgMvmMm1K0rw":{"text":"If ure craving a light meal that's not in bourbon street but just steps away this is the p","useful":0,"cool":0},"THQhrIaggMN7iKwijZTGYA":{"text":"Orleans Grapevine is truly one of the best kept secrets in the Quarter.  Amazing courtyard","useful":1,"cool":1},"Qg3t6E_kryZSipNWr0agMw":{"text":"We had dinner here and it was disappointing.  I ordered a warm goat cheese salad.  I am no","useful":1,"cool":0},"YAXiYTrg7D-ui7pxf5Ay6Q":{"text":"Quaint little place just off Bourbon street. Once you enter, you are taken away from the b","useful":2,"cool":1},"9ISNC2iTIIyDmcz8KRXvDw":{"text":"The restaurant is so pretty, cozy, and romantic.  The food was delicious and beautiful! My","useful":0,"cool":0},"vXnePDm3wv2eklINI-XSYQ":{"text":"The drinks were very bad and the atmosphere was horrible.  The steak was over cooked and f","useful":1,"cool":1},"2KPFWYA637fjEylvpTovhg":{"text":"Friendly but not intrusive service. I came with a group of 12 for dinner and it was fantas","useful":1,"cool":1},"V-7YhFNHa_ckv8gea26LLA":{"text":"This was a great place for a casual wine and dine dinner date. The food was good especiall","useful":0,"cool":0}}