{"0a3TvG6biWCYIkwXahF94A":{"text":"A total fucking joke. My grandparents lived in NO and I've been to Arnaud's enough times t","useful":1,"cool":0},"Jj4XUCpRyClrTmO9T7nvaw":{"text":"I tried to judge Arnaud's on its own merits, but being in New Orleans I just couldn't. \n\nI","useful":1,"cool":0},"tS9jL07Yr4AWZFna37e5qw":{"text":"Was careful to make reservations 3 weeks in advance expecting to celebrate a special day w","useful":5,"cool":0},"ZjaRYROGtKFfkqwaXc92gw":{"text":"I loved this restaurant! Came here in 2015 to celebrate Birthdays in December. The service","useful":0,"cool":0},"7fbpSlMnUDKZcsGrjcyHMw":{"text":"Don't bother with the fancy dining where you need to wear a suit.  The same menu can be ha","useful":0,"cool":0},"1QgRC71Lo-x5ygGsXZSoHA":{"text":"Though I know this place is a tad touristy (understatement), my parents used to always go ","useful":2,"cool":0},"botWLnB_hRTVryPmCE9ElQ":{"text":"This was a very fancy dinner.  The food was very good, the service was good,  the ambiance","useful":0,"cool":0},"TnezcGj-7HmBdqjHRnJDfQ":{"text":"I had an awesome birthday dinner here in the jazz room.. couldn't have asked for a better ","useful":5,"cool":2},"41bSSVM4Bop3VxuVv_AROQ":{"text":"I was recommended by a friend and this was actually my 2nd time in. Katie never disappoint","useful":0,"cool":0},"-M-y_M6hi4Ebsfw-NWekBA":{"text":"This place is pricey, but worth it.  I have several food allergies and they were able to w","useful":0,"cool":0},"dlIO7e_OGH0rjZ2n6HFkug":{"text":"One of my all time favorite restaurants and it still manages to deliver a satisfying dinin","useful":0,"cool":0},"St-8m0dhv2uuLDQ_EKhnDw":{"text":"I had the filet and fried oysters and they were wonderful! Perfectly cooked and ambiance w","useful":0,"cool":0},"p4t21GFuSPH3hBqh_wADcA":{"text":"Now, this is a great place for brunch! (It's probably pretty good for other meals, but I'v","useful":4,"cool":0},"z0rlrFJnMFji9jEhfN2ZWg":{"text":"Food was good. We had eaten at Emeril's the night before and this didn't  start to compare","useful":0,"cool":0},"N7CHptfToqDmwmXZ3KTJQA":{"text":"This place is a classic.  Featured at Arnaud's is cajun cuisine.  This is not an inexpensi","useful":3,"cool":2},"MfHQRc_V8SOst_2RSAsBvA":{"text":"This is an ok place, high volume, touristy, but not bad.  Its just not a great restaurant ","useful":0,"cool":0},"brRDkeXJNKa1nq8GvT6nXw":{"text":"I have been to this place two times, and so far, I am not very impressed.  The food was ok","useful":3,"cool":1},"1pVNB6C9N-u2NRVlMbD3tA":{"text":"After dining at Commander's Palace the night of May 21, 2011, which had the second best se","useful":0,"cool":0},"NS_xlQf9bZtfrfKuXCroIg":{"text":"Top to bottom old school fine dining. We went for the Jazz Brunch, which is a three course","useful":1,"cool":0},"VAkemPKsXH45xgzm56pqUA":{"text":"Celebrated our 50th anniversary at Arnaud's with our cousin and his wife who were celebrat","useful":0,"cool":0},"_QOHQ46kmfzsOAQ9lhSthw":{"text":"Even eating here in the middle of Mardi Gras was a treat. Great food, good service and we ","useful":0,"cool":0},"aY48BSQNU1vrDiWxte9FsQ":{"text":"Okay, so it's a little touristy, but I have to say the staff made sure we were having a gr","useful":0,"cool":0},"YYuIaJ4E-x9jy4eDeUl1kw":{"text":"Thus far, my favorite restaurant in the French Quarter! We had a sensational experience at","useful":0,"cool":0},"LRTHttxkY1D_DoPyNlGZ8g":{"text":"Our visit to Arnaud's resulted in an entertaining night of Ragtime Jazz and exquisite dini","useful":0,"cool":0},"lx5i2IxhKYzm9Cg6EiyutQ":{"text":"Just amazing food and service. The pasta was done well. The oysters bienville were very di","useful":0,"cool":0},"-fbBB8cBv4BHfzs3M0Rd9Q":{"text":"We had a party of six and our reservation was for 8:15 p.m. on New Year's Eve.\nWe were sea","useful":0,"cool":0},"UQ8qWLrHiezGifyaYb6GqQ":{"text":"The jazz brunch at Arnaud's was our favorite \"upscale\" meal of our NOLA trip. Four courses","useful":2,"cool":1},"XQShcyCIiDlmaNzhB5Whuw":{"text":"Wasn't impresed with this place. The service was really nice but the food was below averag","useful":0,"cool":0},"vqSwWhjU6JBp6Yt016WfJQ":{"text":"Worst service I have ever experienced. We waited 20 min to place a drink order.   $150 lat","useful":1,"cool":0},"2LT2kQeHBV0tN1boYvL0Jw":{"text":"Had a very good meal at Arnaud's in late-February, during my first visit to this restauran","useful":0,"cool":0},"ugWR8FHVnIlGDljQXhVqqw":{"text":"Definitely underwhelmed by this, arguably the most famous of New Orleans restaurants. The ","useful":0,"cool":0},"iCxfcl9L9gjmT8Pb6_qnpw":{"text":"Arnaud's is a must visit I Nawlins. Try for the Sunday brunch where you will be treated to","useful":3,"cool":3},"CR2xLpv7BcC8pAKkXfAPfw":{"text":"Love his place! Whenever me and my boyfriend want to have a really nice dinner we go here.","useful":0,"cool":0},"xC9nfBXvXHGsRq_Q15uWaQ":{"text":"First restaurant we went to in New Orleans and I am so happy we did. The best meal I've ha","useful":0,"cool":0},"E5-k0J7b7SAd8ZK2w6mUag":{"text":"Great evening! We went to Arnauds for our big dinner out in New Orleans.  Loved everything","useful":0,"cool":0},"f9SSzRvUA30YvFoe3cYgiQ":{"text":"You pay for the experience. Food was good, but not delicious. Wait staff was nice, but ver","useful":0,"cool":1},"og4XQKzgJsTxKq7EohV8tw":{"text":"There's very few restaurants where the experience and ambiance pair with the food so natur","useful":0,"cool":0},"ELqDrp-lFRqeWXG4eq5Nhg":{"text":"This poor review is based solely on our server 106 team 6. The restaurant is beautiful. Th","useful":20,"cool":1},"Hc0AFjftmRm-a5dqguMf6w":{"text":"So disappointed with this place. Made a reservation over 3 weeks ago. Website clearly stat","useful":1,"cool":0},"PdN1tb8Cc-PfOJ5FBj7-dA":{"text":"I don't believe I ever actually had seafood before eating here, though I should qualify th","useful":0,"cool":1},"m54ULA4djLf4wM1E3NOkeg":{"text":"Worst service. Waiter way overworked. Food was awful. Canceled our entree and hated the oy","useful":1,"cool":0},"i3jEk1TySFneHUpYU-z0ag":{"text":"Obviously when you go to the only restaurant in the world with your name on it, your judge","useful":2,"cool":1},"U-n88Sde9VmFQmzFIiTwIg":{"text":"Please be aware of the extra money for either a cover, or the band, or entertainment in ge","useful":1,"cool":0},"gXaCVOhV2D16rt9k-yHC6Q":{"text":"Had dinner here last night for the first time. The food was excellent and the service was ","useful":0,"cool":0},"MtRH5YpzOUarf3wy781h0Q":{"text":"I think I am in the right spot here.  We ate at Arnaud's Jazz Bistro.  I was outin New Orl","useful":2,"cool":1},"80CR29HDaboDNbxJh9aQZg":{"text":"Blah.  A place that definitely needs to update its style and menu.  It feels stagnant and ","useful":1,"cool":2},"lyURar4SG5VYEoogZ6K5Dg":{"text":"Faded glory. I remember visiting 16 years ago and loving the foie stuffed quail. That dish","useful":1,"cool":0},"32hcLK16RGWj4Y1YNA78Kw":{"text":"Best place I've been to yet. Excellent gumbo, delicious fish, and awesome Creme Brule. Wai","useful":0,"cool":0},"pZDIGOSmX2y0kU8TEG4boQ":{"text":"If you want to get away from the craziness of Bourbon st. tourists, this high class restau","useful":0,"cool":0},"sJchPqVS8N6ADeX5InAV9g":{"text":"Was down in New Orleans for Jazzfest and a Sunday brunch was in order. It's one of those o","useful":0,"cool":0},"saifA5ipcGpGDPjbBJvXmQ":{"text":"This place was superb.  We had oysters six different ways, and Shrimp Arnaud for appetizer","useful":0,"cool":0},"A1LZu7q15KLO7OR8NNcHfA":{"text":"Food was delicious! Waiters were very professional, knowledgeable, and friendly! Great tas","useful":0,"cool":0},"ND9GPQC0amwUB9lxGYFEeA":{"text":"We had dinner at Arnauds on two occasions. Both evenings were really great however the Jaz","useful":0,"cool":0},"g4yD_TR5MTcO7XTHES2yRQ":{"text":"Pure perfection. The service is a pampering experience with each detail uniquely appropria","useful":0,"cool":0},"A8VpTwa8L2BoAqc3TestqA":{"text":"Went for the jazz brunch. Great jazz music with the 3 musicians coming by the table, nice ","useful":0,"cool":0},"FmzkQ_hjVpCppZDdKQlBMA":{"text":"Everything was great! Jasper was our waiter and he was really personable and comic. They h","useful":0,"cool":0},"lBVqXGYWQ2wDhXcFCGxAdA":{"text":"3 New Orleanians, none of whom had ever been there before for some reason.  Went for the C","useful":1,"cool":0},"9xg5WheATRNyKYZSn2ClWA":{"text":"Nearly a 3 star review. We were in the Jazz Bistro section and had the privilege of paying","useful":2,"cool":1},"it-1aSavYZgHVRWswfTTpg":{"text":"I wanted to have a great experience, but at the end it was ok. Not sure if it was because ","useful":0,"cool":0},"pJYlBrn__Zyzija0hcFwIg":{"text":"Great meal but tainted by very cold dining room and amateurish service by Carter. Enjoyed ","useful":0,"cool":1},"NHDZbcHszt-R6NiUEbSNMA":{"text":"My husband and I went to Arnaud's for our first anniversary. It was supposed to be a big n","useful":0,"cool":0},"yufazkMIfV9JDWFMoyefvQ":{"text":"spent NYE here, booked a 10:30p reservation and made it just in time. our server let us kn","useful":1,"cool":0},"nGUfmZ3GBZjca-ObqcN5xg":{"text":"While on business with a \" European Italian\" close friend, I wanted to show him New Orlean","useful":0,"cool":0},"nPZ6w330zhivRtMcgw22bg":{"text":"Christmas Eve dinner was fantastic.  Service was A1 as was the food, simply delicious!  We","useful":0,"cool":0},"z91Lz1P2Me9WYKEh6FdNjg":{"text":"Delicious, authentic French food. The music is wonderful. Superb service. Everything was p","useful":0,"cool":0},"9OmXBcxtqyC-1nGZJhEvcg":{"text":"FORGET coming here! However, if you relish  tasteless food in a musty old setting, by all ","useful":2,"cool":1},"8Njhv0S8WiMw7G3uZ0FqWQ":{"text":"Last night went to Arnauds. First had a seat at bar- no live music- nice atmosphere & good","useful":1,"cool":0},"e_EFqBZq6XFRI_laaGT8yQ":{"text":"We had a large group of ladies for a bachelorette weekend. The staff was dynamite and all ","useful":3,"cool":2},"iW_0U9jaABInMllOzr_fJw":{"text":"Best dining experience for dinner in a while. Crisp white table cloths and napkins, the el","useful":0,"cool":0},"7Ah_Pcy-dWXT4KSQuKrDtw":{"text":"Great experience all the way around. Top notch drinks, great appetizers, and the Filet was","useful":0,"cool":0},"Z9gjIbyDDFuF1mWYfQ51kg":{"text":"We had an event here for a convention meeting and it was a really unique space. There was ","useful":0,"cool":0},"kOYy4W-aLbP6kOsmpwZMzA":{"text":"A NOLA Classic...... But, to be perfectly honest, you can get great food all over New Orle","useful":0,"cool":0},"dMKjFSmPpIrMoGrrtODoHw":{"text":"A little bit pricy but great place. \n\nAmbience is very typical for a french quarter restau","useful":1,"cool":0},"i37kogS5mBuhzJvRdf7mBQ":{"text":"Have wanted to come here for years.  It was not worth the wait.  The atmosphere is very up","useful":0,"cool":0},"4xjm24ZtDHdgyHGhk3fd8g":{"text":"Great dinner at Arnaud's again last night. Started with the fantastic Crabmeat Perntis a w","useful":0,"cool":1},"8ZJL_Uj-reK6Fv1zd8c2xw":{"text":"An absolutely fantastic meal. We came here for jazz brunch and each had the four course pr","useful":0,"cool":0},"OlfgLYILp9_xeyx4HIeTtQ":{"text":"One of the best meals our family has ever eaten, hands down. Great staff, BEAUTIFUL restau","useful":0,"cool":0},"FC5xZVRwH7DeqaZ_XM4p9Q":{"text":"This is the New Orleans equivalent of a Disney Cruise - not totally objectionable if you k","useful":0,"cool":0},"62u_BNu5UM-l3i6c7FNELw":{"text":"This was our second evenings dinner location. Knowing that all the restaurants would be bu","useful":1,"cool":0},"0FGt0Fj6jv5-SSgp_eSGTQ":{"text":"We had the prefix dinner and it was well worth the price. The shrimp and grits was incredi","useful":1,"cool":0},"8vT1lH0x_ctTrXlxr12EKA":{"text":"Perfect place for a special evening. Enjoyed an 80th birthday dinner here with impeccable ","useful":0,"cool":0},"3IjfdtxR-O0pl5y3F7n-EQ":{"text":"Folks, we were all extremely disappointed. The crab cakes tasted like all bread, no crab. ","useful":3,"cool":0},"1n1RKhcGdqt7nuRCl0vBSA":{"text":"I would give it no stars but at least the crab cakes were decent. The service was horrible","useful":0,"cool":0},"VaPazH0vt1VKsO37Yfzrxg":{"text":"Excellent. We were down for the Jazz festival for the first time sine Katrina.  This place","useful":0,"cool":0},"VNZitQXv38DQdtoTkZnGDA":{"text":"Beautiful large group dinner rooms!  Amazing staff!  Perfect food!\n\nWe had the shrimp arna","useful":2,"cool":2},"Ad2bFnQTRjdiQbb-x1ur-g":{"text":"I'm being generous with the 3 stars. This place has a nice atmosphere an location and a li","useful":0,"cool":0},"GGkoVHnzgCW1vb6WGdM6kA":{"text":"Glad i didnt have to pay for it.... the most overpriced restaurant I've ever been to. I un","useful":0,"cool":0},"Nhzy9ZnVmfEBUHBV5a8oFg":{"text":"I wanted to like Arnaud's but was disappointed by the overall experience in food and ambia","useful":0,"cool":0},"EmPZNGKjeboNvFocApaghQ":{"text":"One of the better Restaurants in Nola came highly recommended by a local so decided to giv","useful":0,"cool":0},"y02Y5E0fcOaTqeF0GB3Pqw":{"text":"So glad we came here for our anniversary weekend. A very beautiful classy restaurant with ","useful":0,"cool":0},"DZb4snyz_9eOspD4e_tpjg":{"text":"Classic tourist trap that claims to be \"creole\" and have \"jazz\" and overcharges for everyt","useful":0,"cool":0},"N_3uUtQr2gfer_czoAUFvg":{"text":"Good meal   Seafood exceptional. This is the place for old fashioned decor,formal service ","useful":0,"cool":0},"MR2KMxBOrseNqT2S08dX9A":{"text":"Very nice evening overall at Arnaud's. We started with Oysters Rockefeller which were good","useful":1,"cool":0},"2d9Nw47yrY35rMa5ZBLceg":{"text":"Especially for a large party or a crowd, Arnauds is my favorite traditional fine dining ex","useful":0,"cool":0},"9xxL8Rlub8SpIPsU4mAhLA":{"text":"My daughter and I made a detour for dessert into Arnaud's while the guys took in Bourbon S","useful":0,"cool":0},"6Le34JPSR2cKONBnjMSsbw":{"text":"Ordered the Oyster Platter (one of each baked oyster dish, 5 total), Crab Cakes, Filet Mig","useful":0,"cool":0},"PNPtJp5PDgeVGl2xUna8QQ":{"text":"This was BY FAR the greatest New Orleans experience I had !!! The food, the atmosphere, th","useful":0,"cool":0},"1UxJwyZVNJpKpZJF_RkiyA":{"text":"Not bad.  We went in here on Memorial day weekend for dinner.  We weren't terribly hungry ","useful":0,"cool":0},"s80oUdzV7hwQBGMIrEmj2A":{"text":"The food was good -- but the service was a bit underwhelming.  We arrived a bit early for ","useful":1,"cool":0},"Ay44w2kqkTwDIDYNPJJ_3w":{"text":"Stepping off bourbon street into Arnauds you feel like you've set foot in a different coun","useful":2,"cool":1},"R5ET3qZY0EiGa935TBqzaQ":{"text":"We went to the jazz cafe, next to the main restaurant, with the only difference being, I t","useful":0,"cool":0},"YlnaTHuXlgQPyAReIWqsYA":{"text":"Definitely one of the best \"Classic\" New Orleans restaurants. The interior is nice and rel","useful":0,"cool":0},"MzDxg-AGeKMUfuQbVr59lA":{"text":"I really enjoyed having dinner at Arnaud's. Though you do want to dress up a bit when eati","useful":0,"cool":0},"JFmBXwjV7Vcwra7gCUddKQ":{"text":"Went for drinks and had the sazerac, it was pretty good!  They are famous and well known f","useful":1,"cool":0},"9-QOIP8MlnViWBskXNnbzw":{"text":"This is classic New Orleans!  I was ver surprised when I learned it was just off Bourbon S","useful":1,"cool":0},"fjkaD9VbJtRve0UmPIT82g":{"text":"Bon repas, cadre très agréable, petites portions","useful":0,"cool":0},"M71wpXdEnk81Z2H79z9HAg":{"text":"Ambience was good particularly with our window table.  Good jazz music.  Alligator sausage","useful":0,"cool":0},"7xoAWCNzhItscr5kCv2MJA":{"text":"We were only in New Orleans for a brief amount of time and trying to figure out which of t","useful":0,"cool":0},"k6eu-wB13BkI9hlsVkpSOg":{"text":"Abundantly average food and pretty overpriced for the quality. Service completely failed i","useful":0,"cool":0},"2Y5nb3KdoC6qVYpP2RDU8A":{"text":"I'm giving a 5 Star because nothing went wrong and everything was perfect.  I opted for th","useful":0,"cool":0},"9GN_rbNDX3C28bm8_Ujnxw":{"text":"So incredibly disappointed. My boyfriend and I made reservations for our anniversary dinne","useful":3,"cool":0},"3lgBOolapM7fAmpYjiO6NA":{"text":"TOURIST TRAP !! We are N.O. locals who brought our Colorado guests to 8 different N.O. res","useful":0,"cool":0},"CE0sU7n9RaI5L-eIOS8w0w":{"text":"Love the elegant, old-time feel of this restaurant.  I love their shrimp ramoulade...wish ","useful":0,"cool":1},"og0fZIVz8TtgidSGMvlMhA":{"text":"Classic New Orleans Creole Restaurant. Had a great time and experience. Beautiful rooms an","useful":0,"cool":0},"joYIVqolAbwlLJG5HDrw5w":{"text":"The best restaurant for the New Orleans Jazz ambiance. You have to go on the cafe side to ","useful":0,"cool":0},"xsZML_tmLoO9MBsWtRNtOw":{"text":"The service was excellent. We sat on the bistro side which meant an $8 charge worth every ","useful":0,"cool":0},"fD3Oj6pWdckXTxBChGhiNw":{"text":"It was what you would hope for. A great high end but not stuffy New Orleans dinner. I did ","useful":0,"cool":0},"hjPKO-V0vIQ3o2-jNlLioA":{"text":"Favorite New Orleans Jazz Brunch! This beautiful spot feels like going back in time. The w","useful":0,"cool":0},"9AGJVyS4Hcrk8GQOrO8qpw":{"text":"Having read all of the wonderful reviews, I was excited about going to Arnaud's this past ","useful":0,"cool":0},"97uzUeRIHgDlY0FGP7_KlA":{"text":"We always come here when we visit New Orleans, and it is always a pleasure. The service is","useful":0,"cool":0},"AQ4ZdM82R1gR7JrZH18kzQ":{"text":"The food was terrible. \nThe restaurant atmosphere is upscale and beautiful. \nIt's a disapp","useful":0,"cool":0},"9NomQFZ-nHKA6Z-ci-2XQA":{"text":"I don't understand what all the hoopla is for. This restaurant was such a huge disappointm","useful":21,"cool":20},"iUGlRhc7VaXepaLvBb9FKQ":{"text":"sunday brunch was amazing. i recommend this place to anyone visiting New Orleans and wants","useful":0,"cool":0},"TRKhwfFuJzb9TjNuLPbSZg":{"text":"3 Stars for the live roving jazz musicians and the setting only. The musicians made the me","useful":0,"cool":0},"YkAC5KxDBuQcOqqyZWmodQ":{"text":"Raw oysters to start with the best red sauce.  My steak was perfect and I could have cut i","useful":0,"cool":0},"rBWKRtHqvvpaAsw6roqz2A":{"text":"My father's 75th birthday dinner was hosted here on Saturday, August 5. The decor was eleg","useful":0,"cool":0},"aB8INgCsMNKVA0z35CZ-3w":{"text":"We did Arnaud's with some out-of-town family before Thanksgiving. I highly recommend the j","useful":0,"cool":0},"yMnEHulje5QISvpW9dQmeg":{"text":"Until a few nights ago, it had been more than twenty years since we dined here. In a world","useful":0,"cool":0},"dYe5O6oQVuQ4RiyudZd7pQ":{"text":"Another great dinner last night both food and service were excellent. Started with Souffle","useful":0,"cool":0},"YMl8vb2reCzz9jlCbgtM8Q":{"text":"The food was like something out of a nursing home cafeteria. I had shrimp and would bet mo","useful":2,"cool":0},"pYRIxEIC_qbacfX3ChqloQ":{"text":"I chose to dine at this restaurant because of its unique history, opening in 1918 by a Fre","useful":0,"cool":0},"OwRg-SspG6eGtjRYgvVuxA":{"text":"Absolutely delicious, and fantastic service.  We can't wait to come back again!  Everythin","useful":0,"cool":0},"yrE51m3-UJkpVxrBX_PUYw":{"text":"AMAZING!  We visited on a Saturday night with the 3 piece jazz group. Service, food and hi","useful":0,"cool":0},"L--Ohm7THUwdPNEsqL3i_g":{"text":"This is a very classy restaurant. I had the potato encrusted gulf fish. The fish was amazi","useful":1,"cool":1},"L5gO36RFd3IxC87dk-5DnQ":{"text":"Excellent high end restaurant with the coolest strolling 3 piece band playing and singing ","useful":0,"cool":0},"cwJCnOlqU3VvQuTHXwrTng":{"text":"Oyster's Arnaud is the best of the best sampling and we never miss it when we're in New Or","useful":2,"cool":1},"tRIryh-5_dH6NAbwnmQx5A":{"text":"This place was great.  We sat in the Jazz bistro where there was a great little threesome ","useful":2,"cool":2},"U8P5RSiE8uzu37y6HcEKgA":{"text":"We set the bar pretty high on expectations of this place, seems very....old school mob lux","useful":1,"cool":0},"hWA3bAqWk75CYCicmipQxw":{"text":"We had a reservation 4 days before Mardis Gras, group of 4. We also hit more modern Nola r","useful":0,"cool":0},"fFY2-1A7vaRdLORxxrJZ-g":{"text":"The food was good, service was generally good, cocktails were excellent. Overall, I though","useful":0,"cool":0},"mGzwDEdpkus08fDs1yUaow":{"text":"A beautiful restaurant with excellent service, but unfortunately the food and price were d","useful":0,"cool":0},"s2OwZDCHs_0p-Z-5eGm5dg":{"text":"I have spent most of my visit in New Orleans looking for good food and good music and I ea","useful":1,"cool":0},"3HnqaeEiWBxT5nliUW8Y1Q":{"text":"Kind of a downer for the fun of the french quarter.  shrimp arnaud app was overpowered wit","useful":0,"cool":0},"1Dlz1ZbebRqplL72CLBwpQ":{"text":"After pacing through the French Quarter one evening looking for something to eat I saw Arn","useful":1,"cool":1},"5KsIPTMuXP-OwHcp2eUM3g":{"text":"I really,  really wanted to give this a 3 star. \nThe Jazz and the second floor Mardi Gras ","useful":2,"cool":0},"kh6Yw_SB61S5ajnh4jlLsQ":{"text":"We had a wonderful experience here. The food was delicious, the music was on point and the","useful":0,"cool":0},"hJiacRqVctdr3getuqcYoQ":{"text":"My wife and I have been several times over the past two decades, mostly recently last mont","useful":0,"cool":0},"wBgxhqZZ7qWGthXgscDG3Q":{"text":"The shrimp creole and crab cakes were good as well as the pompano fillet. Loved the souffl","useful":1,"cool":0},"ToomdDAL76hSbuRCOFdLXQ":{"text":"LONG WAIT. \n\nThe night started out wonderful, the staff remained friendly, charming, and h","useful":2,"cool":1},"ee59TFrwOBoS7SAXWPse2Q":{"text":"Food very good.  Service not so much.  There was a carafe of water on our table when we ar","useful":1,"cool":0},"D70zWCWHqn5vCdPraGN7NQ":{"text":"Fantastic service, food, ambience. I have dietary restrictions and they did everything pos","useful":1,"cool":0},"TmpkfUab4yZ1-sKMJ5nRmQ":{"text":"Luckily the company paid. I get the appeal of eating at a historical restaurant, in a priv","useful":0,"cool":0},"nVxYIjL8hBYGvrAtSILz0Q":{"text":"Old school new orleans. So good.\n\n[from a New Orleanian, even though my location will chan","useful":0,"cool":0},"Ehdp7Tfc2B6Tn2sCgof_bA":{"text":"Attended a wedding reception here. The  beef fillet was so tender you could cut with a for","useful":0,"cool":0},"ks9qSuIvOoh14NhLdMejjQ":{"text":"This was an amazing classic restaurant in the French quarter. We went for the Sunday Jazz ","useful":1,"cool":0},"MJ8QNei99sB87nPRfOFieQ":{"text":"Arnaud's has the classic New Orleans service without the snooty overtones of some other re","useful":0,"cool":0},"q0hg_cD2mGX3KJZ8k_y3Vg":{"text":"Atmosphere: Lovely. Traditional without being boring. The main dining room, with its portr","useful":2,"cool":2},"oIdK9yYbubD6w5qM0qISCg":{"text":"Had a nice night at Arnaud's, but it wasn't what I was hoping for.  \n\nFirst of all, this p","useful":0,"cool":0},"MFfo_rZRuZxxw0Bw44xDng":{"text":"Slow, slow service for Sunday jazz brunch. Food was mediocre. Nothing really blew the 6 of","useful":0,"cool":0},"5HyHw88Aawceo0LWtR5oAg":{"text":"So this place was great for us.  The bread, the baked oysters the arnaud's sampler I got w","useful":1,"cool":0},"tDnc5XXFHRH5CUOECgLy6w":{"text":"WOWZA! Jazz brunch was fantastic!!!!! After a long night out on the time my friends and I ","useful":1,"cool":0},"rPI6lZMxSKJdYiuWkt-OLg":{"text":"Food, service, and atmosphere are superb in this oldest restaurant in the country.  One of","useful":0,"cool":0},"2hg9LCGlC7wbUMoDH9NwwA":{"text":"The restaurant is the youngest (like that even means anything  in being 90 years old) of t","useful":2,"cool":2},"R0wIpEl6ovopiztYMQokeQ":{"text":"Loved this restaurant! Went for dinner on a Saturday evening and the ambience is great. Oy","useful":0,"cool":0},"C1Xm_J1pExx1fNChQjs63w":{"text":"I went to dinner here with a couple of business associates and we really enjoyed it!\n  \nMa","useful":0,"cool":0},"HYLkBlDcEe5V3Jl4fxYZfg":{"text":"The food was great, the location was very romantic with the 10 or more chandeliers in the ","useful":0,"cool":0},"nLSR5SpcswIQkmEo9M_ltw":{"text":"Great food and good Jazz music.  The food is good (loved the turtle soup), but the special","useful":0,"cool":0},"F_9EKXlghFXzl-0Nlu6kSw":{"text":"Had a good meal here. It's very loud and hectic in the bistro where we were seated.  Jazz ","useful":0,"cool":0},"Eov7yKIURVMqEzpfZVBO2g":{"text":"Hubby and I had date night here a few nights ago.  The ambience was cool (live jazz band),","useful":0,"cool":0},"b72VM3VxSGdGo3VGJGlRMg":{"text":"Sooooo disappointed. Was seated next to window on Bourbon St. & had to watch & listen to y","useful":1,"cool":0},"RYCVhWERA8JtLKxiC-giHA":{"text":"The restaurant itself is very classy and upscale without seeming pretentious. This was hub","useful":0,"cool":0},"4h5lYEDwr8X9QTUJV-mbvQ":{"text":"This is an old-school NOLA place and it can still hold it's own. We walked in with no rese","useful":2,"cool":1},"S7jZrNmbmiCeGyyy99s8rg":{"text":"We'd spent the morning and early afternoon shooting video near  Pascagoula MS when weather","useful":1,"cool":0},"CdDILxBa8PXNHFeaiZzuHg":{"text":"We sat in the Jazz Bistro and had an excellent meal! The music was great and they took req","useful":0,"cool":0},"vAVK97eegPbflxZpOlc6LA":{"text":"Expensive but mediocre. My pompano Duarte was  small and very overcooked.  The wild mushro","useful":0,"cool":0},"2IVGr1Gae0v9tm0fFWnjNQ":{"text":"Great restaurant with great atmosphere! I got the escargot and it was so good. I don't kno","useful":0,"cool":0},"o2y-7Byu1SArrw918vH3Jg":{"text":"I had the oyster sampler- Oyster Arnaud's- good, the best was the Karen (Parmesan) I belie","useful":0,"cool":0},"71eQ-exbtKXennzs0jGrqw":{"text":"I had their oysters which were quite yummy. Everybody I was with ordered a variety of thin","useful":0,"cool":0},"tyRahDFKHd3taBdxSx8DRA":{"text":"We were headed to a different place for dinner but that restaurant was full so we were try","useful":1,"cool":0},"kIz9C_sGMTr-JzSpZdb2ng":{"text":"Was awesome.  Ate here with some local family and wanted a true Nola only place.  Got the ","useful":0,"cool":0},"S2AEA1JgS_Zw52IbYDln8w":{"text":"The service was not up to par.  The shrimp have gotten VERY small. I was very disappointed","useful":1,"cool":0},"JoHTuVoE1GVp568QKVzW_g":{"text":"Ate there for New Year's Eve.\nFood and service was excellent. Atmosphere was a bit loud, b","useful":1,"cool":0},"rL1ziQN4yjajKe-0GX3BaQ":{"text":"Our absolute favorite restaurant! I proposed to my wife at Arnaud's in November, and it co","useful":0,"cool":0},"d1KD4BR5YOzTX4lGGVltQA":{"text":"We celebrate special occasions here. The food and atmosphere are fantastic. I can't wait t","useful":0,"cool":0},"IRSPml5DbIiq-0sawQniLQ":{"text":"Cool atmosphere but that's about it. Food was overpriced (though good). You can get better","useful":0,"cool":0},"SXYzTkW6G2AyRBxHqwbtag":{"text":"Based on recommendation from the Concierge at our hotel, we chose Arnaud's to celebrate a ","useful":0,"cool":0},"sCxB1gaMOuuS43HqkyMUmQ":{"text":"Oh my god! What an amazing experience!!! Great food! Amazing service! \n\nDinner in the jazz","useful":0,"cool":0},"uRM4HlA5_4sCgj4edpAn5Q":{"text":"Our server, Ellen, quite literally made our experience. Fantastic timing, recommendations ","useful":3,"cool":2},"jgxffmSiCxxQNwV_Kn8FxQ":{"text":"Went for a birthday dinner, which turned out just fine. I'm giving a mediocre rating only ","useful":1,"cool":0},"qsF343vHtb14VYTUD8Go6w":{"text":"This place is old school. We ate in the Jazz Bistro right in front of the Jazz band. The b","useful":1,"cool":0},"Kd10RppJWcj6Noh8D2nKug":{"text":"I can't imagine celebrating LuniGras anywhere else in town!   Great food, amazing drinks. ","useful":0,"cool":0},"ODZmNzTwVJwUrGpJTOcPIw":{"text":"I attended a pharmaceutical in service February 18, 2016 and the service was impeccable. T","useful":1,"cool":1},"6yeU_X25yv9Wlz67B9jpcA":{"text":"Sunday Jazz Brunch, yummy but I think the atmosphere and setting are really what it is abo","useful":0,"cool":0},"1zIZQHfMT3hHixfp3cb3ug":{"text":"The food was good. Our waiter was friendly, however the service was slow. We made dinner r","useful":0,"cool":0},"cbN4oar86tgrhokbPCYyVw":{"text":"What a disappointment tonight! After three people spending over $300 for a decent but not ","useful":0,"cool":0},"dVoTA2sbaDyz3GKU0Kn9Kw":{"text":"we enjoyed the filet with au pois sauce, and were confused when they didn't serve us a ste","useful":0,"cool":0},"FGGIy9Z2koFicPrxvCp8Zw":{"text":"Well the food and service may have crashed into the side of a mountain, but at least it's ","useful":0,"cool":0},"w1gi_F4UcImVBfuanEXh6A":{"text":"Arnaud's made for an enchanted evening for us. From having our cocktail at the beautiful b","useful":0,"cool":0},"IiKfMmZ_aDQz_WOxVfntUg":{"text":"The waitstaff is the highlight of this restaurant. The food was decent but took longer tha","useful":0,"cool":0},"Pmy4a9j77EXWIBhwbyJnyQ":{"text":"New Orleans most fun jazz brunch! Order the cafe brulot with dessert and you won't be disa","useful":1,"cool":0},"_KPiiuGhFvo2YddOMIydIA":{"text":"Our fisrst impression was with hostess and she was snobby.  The young lady that seated us ","useful":0,"cool":0},"4pPdnEZ_0Rgj8Se1YoZ1Zg":{"text":"We recently visited Arnauds on a Sunday morning for brunch and jazz..   The food was very ","useful":1,"cool":0},"lpX6IIeKKjmROy6DgjJrLQ":{"text":"Totally charming. \n\nThe Sunday Jazz Brunch is very old timey romantic. The room is beautif","useful":0,"cool":0},"E6z6QBwnMGNo7d6yKVcRnQ":{"text":"Great location. Professional waitstaff. Nice roving jazz trio   I had the duck entree whic","useful":0,"cool":0},"CHKSe0G-1IV7Nhr-pFmzyQ":{"text":"I was fresh off the plane, starving and looking for a nice bar where I could have some tas","useful":1,"cool":0},"JkhLHkpJPyx7Lu3O4cp8NQ":{"text":"One of my Faves in New Orleans, and my first choice for a nice Brunch. Many will opt for C","useful":0,"cool":0},"DqoQc5DToX0IGXidLa7qqw":{"text":"The shrimp bisque was ok, but not memorable. The filet Au poivre was top notch. Amazing fl","useful":1,"cool":0},"mUig_BocPLLzb7VsFV8xww":{"text":"Jazz Brunch is fun! Dining room is beautiful  - Jazz trio is great - food is delicious. Th","useful":0,"cool":0},"rvaS_Op-JHw7q_QIKwlPSQ":{"text":"Had an absolute amazing experience at this restaurant! The French 75 was an incredible coc","useful":0,"cool":0},"V83vn9Gh_PKeFbNNmiNOeg":{"text":"Awesome dinner with friends at the jazz bistro.  Crawfish O'Connor was the best dinner of ","useful":0,"cool":0},"ozX4bAA0_9nLneEKzXGY3w":{"text":"Food:  Very old school.  Very good.\n\nService:  Exemplary.  Again, old school.\n\nAmbience:  ","useful":0,"cool":0},"q76RpLewSq39ptqSArnA4Q":{"text":"This was the most amazing restaurant experience of my life. I've been in several countries","useful":1,"cool":0},"YKJcFFTNexA7wvwUB_fxAg":{"text":"As an out-of-towner, I wanted to have a great, traditional N'Awlins brunch - and I did. Ar","useful":1,"cool":0},"C7lQK8ZBU0oW6CQ5ACVOTg":{"text":"Praline soufflé is awesome.  Shrimp remoulade is excellent!   Cappuccino way above average","useful":0,"cool":0},"vBOV8zp_WBFXa1pgc8OIBQ":{"text":"Very nice classy place. Service was great but they didn't take a little long. 3 hour dinne","useful":0,"cool":0},"yK9N9XLq2d1_pUgWyA34MQ":{"text":"Absolutely loved it!! Shrimp Arnaud and Crawfish O'Connor were some of the best food in Ne","useful":0,"cool":0},"mLSKASIgVfNB1cWb8zxh4A":{"text":"A group of 6 of us flew to New Orleans to celebrate a couple of birthdays. We made our fir","useful":1,"cool":0},"8z0nZAswjX3N6e5P87IQQA":{"text":"My fiance and I ate dined at Arnaud's last week on our trip to New Orleans and I have to s","useful":0,"cool":0},"wZQVDWp0UFzihjszBIDXBw":{"text":"Incredible. Have been here 5 times in 5 years. Easily one of the best restaurants in New O","useful":0,"cool":0},"S0Cv2Yt64iVN8Pipe8MSKg":{"text":"The food here is definitely good, but for the super high prices there are much better NOLA","useful":0,"cool":0},"qGjXOStHijvUPYvRB5qyFg":{"text":"Beer / drinks were okay; fresh catch dinner was a step up. However, we were there for the ","useful":0,"cool":0},"VVSpRoiu2GVafOv6xfVPKA":{"text":"This place is relatively pricey. I have been a couple of times, last Night ordered the fil","useful":0,"cool":0},"Lt54TzkLD5TTk7yeLmdz3A":{"text":"I wouldn't say this place is for the financially timid, nor for those wanting the best foo","useful":1,"cool":0},"pLIe4JPnuk1ydJcMgQg7TA":{"text":"This was great good. Service was on point and the jazz music was totally worth the $8 extr","useful":1,"cool":0},"EyvvB7QYqzLzJr0LXdQRUg":{"text":"First time trying this place for my soon to be mother in law's birthday dinner and it was ","useful":0,"cool":0},"9SgdjrctDzVMPtk9lkyVuA":{"text":"Arnaud's deserves five stars in every respect.  First off, let me say that the Cafe Brulot","useful":1,"cool":0},"zO_h6wwR0tWdnaG5K1XMkw":{"text":"New Orleans classic. Lots of authentic, reference dishes on the menu - a very nice place t","useful":0,"cool":0},"IqPE774nfra80FoHSNl8sA":{"text":"We were lucky and scored an early \"day of\" reservation at the Jazz Bistro. Prior to being ","useful":0,"cool":0},"n6nJt7JjdaGiM4S3bfxJGQ":{"text":"My first experience at Arnaud's was in the early 90's, and it has always been a must when ","useful":1,"cool":0},"iJUi3mxZ9AWR7BsE-KbU9A":{"text":"This is my second time here.  Last time was the same.  I got confused and thought the last","useful":1,"cool":0},"ajugt3OpBapkkvt1IxDpvg":{"text":"i came here for a jazz dinner... the service was impeccable.. and music was a great way to","useful":0,"cool":0},"ualK8rn3CEvqWRsYQjNqsA":{"text":"We ate at Arnaud's the first night of our trip and I was blown away by this place, the sta","useful":0,"cool":0},"KaK9xYmITkBpVadmWquIZA":{"text":"If you have the pallet of a toddler, this is the restaurant for you. Their Oysters Rockefe","useful":3,"cool":0},"icrXarMyeKcsWYtf8uduXw":{"text":"Dinner was great until a mouse ran across my feet. Staff didn't seems to care as the mouse","useful":0,"cool":0},"Smdg5U5TAUokNRGwTDzaJA":{"text":"Service was fine. Food was fine. Music was not worth the 8$. Very expensive for what you g","useful":1,"cool":0},"cBU1jRoe7yfYZd0rPp7R0w":{"text":"About a year late getting to this review but with our anniversary coming up I felt the nee","useful":0,"cool":0},"P1eOJB3cBTZJ3c1E1Irj6w":{"text":"I owned restaurants. I managed restaurants. I worked in restaurants. I played music in res","useful":2,"cool":0},"Qs2L9-ZrDlN8tVsrTdtNUA":{"text":"One thing being on this Panel is that you get to wine and dine with your favorite regulato","useful":4,"cool":6},"fELFr5WUzLPFzZj5vdNxaw":{"text":"How do you say, \"Wow, this is a beautiful restaurant with stellar decor, service that was ","useful":6,"cool":2},"ZmNtqT8KvTefP8I-mx63Dg":{"text":"Had a great dinner here in the jazz room. The menu has a nice variety and it's pretty cool","useful":1,"cool":0},"e6iNi4XQ6KdjAnstNLxFmA":{"text":"Had veal wohl, veal was average. Crab cake was so so. The crayfish puff was salty and heav","useful":0,"cool":0},"pFW0jPC3U1m_A3liqtCxfg":{"text":"Arnaud's is terrible. It is overpriced, portions were small and service is poor. We had to","useful":0,"cool":0},"CjDjbxBoU0bZHX4_YnjXHg":{"text":"Excellent dinner last night, beautiful dining room,  impeccably dressed and professional s","useful":0,"cool":0},"5MpMB7RrN25D3ftKdVpNpw":{"text":"Had my first taste of turtle soup, and I must say it was beyond amazing. So much so that w","useful":1,"cool":0},"1_M4ZrRK5GTtT3aKCO_K5g":{"text":"Megan the bartender is awesome! The waiter knows his stuff! Bienville oysters!","useful":0,"cool":0},"gjpumGuwUrwYATVCdNomfg":{"text":"The service was great and the food was amazing.  My husband said the oysters were the best","useful":0,"cool":0},"piXiQ5S-zpB-uV8btpA7cw":{"text":"The waitstaff are ill trained in setting the table. We were served bread, but no bread pla","useful":0,"cool":0},"NaC0dKHXpXsJplFSt543Tw":{"text":"Let's start with the positive.  The location and private rooms are absolutely beautiful.  ","useful":1,"cool":0},"oTCTUZs3sUzMKaHuP3JPiQ":{"text":"Went there for Thanksgiving.  Had the shrimp creole and hubs had the crawfish O'Connor.  M","useful":0,"cool":0},"0WMeOOtmoINH90R1UyxJ9Q":{"text":"Great service. Great food. Great location. Great presentation.  We had Valentines dinner t","useful":1,"cool":0},"1K-BlTSnNUun3f7TKCCIEQ":{"text":"With all the other amazing fine dining in this town that is NOT located on Bourbon St, I n","useful":0,"cool":0},"X5Rjf8P9Qt9rPyM5gKcTsA":{"text":"I started at the French 75 bar prior to a private event upstairs in one of the bajillion p","useful":1,"cool":1},"kp0-bJSV8xmbJmDocXNEdQ":{"text":"Had one of the least attentive wait staff I'd ever encountered, food was blah, the garnish","useful":0,"cool":0},"65d4mXaB5v2H3dKjTA9rGg":{"text":"We dined here for New Year's Eve with our family of 5.  We are local, but had never been t","useful":0,"cool":0},"V8tVrhmw_WKsR9nopNPlPw":{"text":"Our concierge recommended that we come to this enjoyable restaurant this evening. We did n","useful":0,"cool":0},"ddkIgQ63vC1WrgwvRSSIUA":{"text":"We had a lovely time celebrating our anniversary and my late birthday dinner. \n\nDo get the","useful":1,"cool":0},"Sed2CE3EDe8VXJ5TPuFWVw":{"text":"The Filet Mignon Au Poivre is quite possibly the BEST steak I've ever had! Great native Ne","useful":1,"cool":0},"0pY8WGcRtOJv-sUYK3-f-Q":{"text":"We had a lovely New Year's Eve late brunch. Nice atmosphere with live Jazz. Cocktails, ser","useful":0,"cool":0},"wqAVYJLbfKnl7_pRY_6VIQ":{"text":"Amazing food combined with fantastic team of Lily(captain) Johnnie(front waiter) and Irvin","useful":2,"cool":0},"aUH7_nArw5gM1Ug1fjuwaA":{"text":"It was pretty good.  Came here for a work dinner meeting, so it was a prix-fixe menu.  Les","useful":0,"cool":0},"gIWLtskMKxh5bWxn49PXwA":{"text":"I was recommended this place by a coworker and realized when walking in that we had an eve","useful":0,"cool":0},"kYb6Fpx5N6PJVsgGXlcQDQ":{"text":"Although I have mixed feelings about my experience at Arnaud's, I'm going ahead with four ","useful":0,"cool":0},"1HJ-jr3SCCLCEk2rtkE-7Q":{"text":"Service was extremely slow. Food was not worth the cost. Go to Bourbon House, so much bett","useful":0,"cool":0},"PGOny58ZfLUqc0vM8ztEog":{"text":"I like the traditional ambiance of this establishment. It is something that I hope will be","useful":0,"cool":0},"K0zaWMhFWzcOaT7iZ452YA":{"text":"Best Remoulade EVER.\n\nEVER!\n\nBy the way, if you want to try and go cheap and hit up the mo","useful":2,"cool":1},"OwEn5Gak6c3WIe5ssMjrbQ":{"text":"I really thought this was going to be the place to impress some of my friends that were vi","useful":0,"cool":0},"Q7mhrAIVGOHSqAz4q8wqQA":{"text":"We were pleasantly surprised by Arnaud's Restaurant. We arrived and were promptly seated. ","useful":0,"cool":0},"Mjf_SUXPqn3lMWKv7uUKTA":{"text":"This place does have the Quintessential new Orleans atmosphere. Historic building with fan","useful":0,"cool":0},"XRi6H4e6ng7eu_30p_QrkQ":{"text":"The main dining room is ok, but the cafe is where it's at. Live jazz band that comes aroun","useful":1,"cool":1},"NWJA_s-7L29ldEIXk06-8Q":{"text":"Small portions & overpriced, but prepared beautifully.  My wife loved the Turtle Soup.  Co","useful":0,"cool":0},"cmQWnAr-cbbM8ZwZNt-feA":{"text":"Was in NOLA for my bachelor party and made a reservation at Arnaud's. What a classy and wo","useful":0,"cool":0},"DDV0bpKo4-XwJqjujAFLnQ":{"text":"I wanted to love Arnaud's so much, but in the end, I left satisfied if not a bit underwhel","useful":1,"cool":0},"e0_grMcahpaBSJ-rJKZ5GQ":{"text":"Although the service was great, the food was not. Had turtle soup which was ok. Ordered th","useful":0,"cool":0},"up5tLODcDNA5KkMaseA_2g":{"text":"Went there for our wedding anniversary. Have been there every time I have been in NOLA whi","useful":0,"cool":0},"aZQqevIaEJeKj2jzrBjucQ":{"text":"If you from Louisiana and know how good food taste.  Please, please, please don't go to th","useful":0,"cool":0},"qQGucKrVN5gJwl-RJYPLHA":{"text":"The food was reasonably good, although not for the price. We had the escargot - they were ","useful":0,"cool":0},"BNXSqja8C4wYRzGluPPSoA":{"text":"Pros: very friendly, attentive staff including our waiter Hannibal. \n\nCons: \nWent to use t","useful":1,"cool":0},"yJq9b9Zl0LXiX3GTQ1c6cQ":{"text":"We had a wonderful meal! Quieter atmosphere. A great old dining experience. Not one compla","useful":0,"cool":0},"0gTnsJtGZMRGZIaQ4nMnaw":{"text":"We were definitely under dressed. \nEverything on the menu was mouth watering. We were in o","useful":1,"cool":0},"FSmOnmVNYsfNEFbfixdSMg":{"text":"Why don't they have 5 stars???  I've spent many summers and spring breaks with family in N","useful":0,"cool":0},"fo78-ZbXcOvFst043OUZDQ":{"text":"On Bourbon St. Fancy French dining men waiters in tuxedos. All very nice and professional.","useful":0,"cool":0},"FdbNDkxTETRzQrVspa8Izg":{"text":"This was a private party event so we had a somewhat restricted menu, but still had a lovel","useful":0,"cool":0},"vJEL45KZmCB6BhF1UTIjcA":{"text":"We went here for Jazz brunch during our Christmas visit to NOLA.  The food was wonderful a","useful":1,"cool":0},"dcnssP7vqkDgtibz_WUWqw":{"text":"Went with high expectations, very disappointed.  The service is excellent I will l give th","useful":0,"cool":0},"Rgoe5Jffnb8dkG5FL60zfg":{"text":"Another of our favorites. Dressy and excellent atmosphere. Impeccable service. I cannot sp","useful":0,"cool":0},"Lc6t8tLC5fNmaYek_YagtA":{"text":"Dined at the jazz bistro next door. Had four dishes. All were excellent. Beyond my expecta","useful":0,"cool":0},"nq6WPiCcXTBK45symth9pQ":{"text":"We sat in the Jazz Bistro.  The music was fantastic, probably the best part.  I had the Cr","useful":0,"cool":1},"4Zj_FJxIO-LqRV_7BtyZ4Q":{"text":"This is a wonderful historical restaurant in New Orleans--the Wonder is mostly for the cha","useful":0,"cool":0},"nRPK1ifabNDSrg809uh2EA":{"text":"This is where the locals go (vs the tourists who go to GW fins next door)...\n\nOutstanding.","useful":0,"cool":0},"V4b194eX75EWdpfbS5u_wQ":{"text":"I loved this restaurant! Came here in 2015 to celebrate Birthdays in December. The service","useful":0,"cool":0},"zDSLfVaosDx9TW1uzuX6lg":{"text":"Fine dining? I think not. Arnuad's was comically terrible from the moment we arrived on 3/","useful":2,"cool":0},"2MBxeAVTE1mwWfmFyU4FDg":{"text":"While visiting the French Quarter with a colleague from Japan, I was determined to expose ","useful":1,"cool":0},"bc25t96l8EQw_WGYnytMHQ":{"text":"Luckily we had a nice buzz going by the time we sat down to our reservation on Sunday nigh","useful":1,"cool":1},"_SdBYQ3DnqcsJUBjPJF_dw":{"text":"Oh, Arnaud's.  Such a landmark, such a distinct experience, so very completely New Orleans","useful":0,"cool":0},"BHqlxnu2ZZAde4FieLccgQ":{"text":"Great place for dinner in the French Quarter.  I was with my best friend in New Orleans fo","useful":0,"cool":0},"_RBcfFrL_kA7qPhKKFyK2w":{"text":"Enjoyed a tasty brunch and delightful music.  Drinks so good we gave up our table to waiti","useful":0,"cool":0},"tcL7sQkFdDgPrEQDFHsbqQ":{"text":"Während unserer USA-Südstaaten in der letzten Stadt nach einem echten \"Sterne-Lokal\" aussc","useful":0,"cool":0},"CKnD6leoFpwQvsI0TwL53w":{"text":"One certainly has to give Arnaud's Restaurant credit for the upscale atmosphere, fancy set","useful":1,"cool":0},"R10OgpOv-fq-rAdazs3FYQ":{"text":"Just walking in here makes my heart happy! Live jazz and INCREDIBLE food. Oysters, alligat","useful":0,"cool":1},"hUHrv_QMXSsRqa2zEbxhDg":{"text":"Sorry but this was a disappointment. Went with friends we hadn't seen in a long time and I","useful":1,"cool":0},"j9hrmVqqw17yqzplXpKFZQ":{"text":"Beautiful restaurant.  Wonderful service.  Gumbo and filet with mushroom sauce were amazin","useful":0,"cool":0},"6Z6u2vTsP3zOLd1hsxqTdA":{"text":"If you want a great food and jazz experience come here make sure you ask for the jazz bist","useful":0,"cool":0},"S89A3wQZOKCqdySO342_2A":{"text":"What an unbelievable place. I came here tonight by myself since I am in town alone for wor","useful":0,"cool":0},"l5Vrlu9hrn45B5mA2elEqQ":{"text":"Great atmosphere with the jazz playing, the food is good. Charles the maître d asked how t","useful":0,"cool":0},"on1bxv70jG1DeG20FoRvzg":{"text":"Dinner reservations at Arnaud's at 7:00. We arrived 20 mins early and got a table immediat","useful":0,"cool":0},"J6WEm11gpIBkeRg-ZZLOlQ":{"text":"As a fine dining restaurant we made our reservations and followed the dress code for a lov","useful":0,"cool":0},"hEb5YgmxrpzzpKx3xIZBvA":{"text":"Within walking distance from our hotel. Exquisite service in a charming historic space. We","useful":1,"cool":0},"lmHLwtPEFCHoXjocwHc-OA":{"text":"My new favorite in New Orleans! The hollandaise with the potato puffs was perfect. Then ha","useful":0,"cool":0},"-pUYtGxab5Y6cxEpFM3vQg":{"text":"Staff at Arnaud's was extremely pleasant and helpful. I received a lot of attention and re","useful":0,"cool":0},"w2teOEYhNCOEy_d-mPtyhg":{"text":"Fine dining in the traditional old school NOLA fashion.   Absolutely beautiful interior. .","useful":1,"cool":0},"pwsRZciT1EHWUzTnlqVlCQ":{"text":"Very nice atmosphere and good cuisine. Blown away with service. Great flavors in both soup","useful":0,"cool":0},"d5v8xKQQdWYMpYiPKcPiEg":{"text":"So during Mardi Gras I decided to go with my beau to the \"Jazz Bistro\" at Arnaud's for a r","useful":0,"cool":0},"dt9nNdfux4wKceIhBXaSSw":{"text":"Absolutely fabulous place. Our servers Sarah and Bobby were terrific! Always attentive but","useful":0,"cool":0},"fmV_CrLSJHuN-k3FfEfflg":{"text":"Before going to NOLA, I have all my meals carefully planned. I had breakfast, lunch, and d","useful":9,"cool":3},"DZyiczzV_x21AoR2sBl5xQ":{"text":"Husband and I went there for lunch on Sunday.  I had the savory crabmeat cheesecake.  It w","useful":0,"cool":0},"CmKA2o9_YQQNcGgQ8vLCNQ":{"text":"This place is a perfect throwback to an age gone by....great food, impeccable service and ","useful":0,"cool":0},"Y4Uci16P2VZ4oLRLrX5llQ":{"text":"My girlfriends and I came here to celebrate a bachelorette party. They put us up on a priv","useful":3,"cool":2},"Hci57DhPG6wL3q-WS18Nfg":{"text":"This place is a class act .Wonderful. Great wine list, varied menu, yet still the usual NO","useful":0,"cool":0},"oibyp7hj_Aji1JGbszCsQw":{"text":"Dinner at Arnaud's was a total pleasure,\nFood was excellent but the service was even\nBette","useful":1,"cool":0},"xgpWI09lMHghJnazSdZt0Q":{"text":"Been here a few times.. great every time! \nThe food is outstanding.  I love the Jazz trio ","useful":0,"cool":0},"VfRXlCkwxZWcfTeyBUaoqA":{"text":"Nice, flavorful and unique food creations. Particularly liked the soufflé potatoes. Good p","useful":0,"cool":1},"wklzNqCF1WRuFx9Af3OtWA":{"text":"I am shocked that I liked Arnaud's as much as I did. With the average of 3.5 yelp stars I ","useful":1,"cool":1},"Xloau9ex_KQGBDGWyzOl0Q":{"text":"I saw this restaurant during a Grayline tour and I reserved dinner for the next day.  I ha","useful":0,"cool":0},"mGW2sKqFG2zKRIyUqyf7ww":{"text":"If you are in New Orleans, it's a must experience place. Ask for Sarah. She is the Captain","useful":0,"cool":0},"oSLXeTHXqwr7ya_tHNUagg":{"text":"Just OK for me.  Our table was ready when we got there, they didn't charge us the extra $2","useful":1,"cool":0},"uIXE0qw6LFhqjXRfUHVifA":{"text":"not only was the service terrible but the food was that of a dive bar. We saw about five d","useful":4,"cool":0},"GatV4e6htIX-KgyVPRhZFQ":{"text":"Another New Orleans institution you have to experience at least once. Incredible ambience,","useful":0,"cool":0},"v4NWT7ewzPFfe7lpY6OY_A":{"text":"We only had dessert at this restaurant, but would gladly go back for a full meal and consi","useful":0,"cool":0},"UStEHQ7yKWD-aOWSfekyyg":{"text":"Wonderful meal. We ordered off the the $40 per person menu. Just what we were looking for ","useful":0,"cool":0},"AgBbi_NNSucfHxjec_fIRg":{"text":"We came to Arnaud's Jazz Bistro to celebrate my best friends wedding Anniversary. We were ","useful":0,"cool":0},"l8AUub7xMBzBp3ftW-ksfQ":{"text":"I got the pleasure to eat at Arnaud's for a business dinner and was pleasantly surprised. ","useful":0,"cool":0},"Ceb-W9JmGmi3VrDnPztADg":{"text":"The beginning of my horrible experience started when the front desk asked told me that the","useful":0,"cool":0},"P3iHDGbTEB2BI6OU41Hceg":{"text":"So after walking around for about 15-20 minutes trying to find somewhere to eat, my friend","useful":0,"cool":0},"2u-LPXZncQ0j-nUQwSos9w":{"text":"When they say \"business casual\" in the South, they mean business casual! Lol. Coming from ","useful":3,"cool":1},"LqjVKb8Cy8pAAS8k2oOpnw":{"text":"Just as amazing as we had remembered to be over 20 years ago! Outstanding oysters and stea","useful":0,"cool":0},"fc6QR9jFMNYDleLKgdOUZg":{"text":"I've been going here since the late 90's.  It's always been good to me!  I love the souffl","useful":1,"cool":0},"SdLPzkLc8xo1DaCMr8JVwQ":{"text":"Loved the atmosphere and live Jazz music but\nI am knocking these folks on a couple of thin","useful":2,"cool":1},"ThV_xvoL5lSBhKZhAaTj4g":{"text":"Very elegant dining... you begin with breaking bread with your dining group. The entree's ","useful":0,"cool":0},"actIk-TRSjG6bqUQAAHy2g":{"text":"The bar was great and the restaurant service was good. However the food was below mediocre","useful":2,"cool":0},"mowIGTzcaYaxQnbUrNf9xQ":{"text":"There's something remarkable about a restaurant that's about a century old! Just think of ","useful":2,"cool":2},"gMvJX-C-eQlVBIhduN-2PA":{"text":"We tried several restaurants in the same neighborhood and this was our least favorite.  Fo","useful":0,"cool":0},"0qDe655Lm0uQkSveYvbeEQ":{"text":"Arnaud's was surprisingly unimpressive during our last visit, where we had a semi-rehearsa","useful":3,"cool":0},"1LiFpgQAO430q6g2boIEJA":{"text":"Nice, flavorful and unique food creations. Particularly liked the soufflé potatoes. Good p","useful":0,"cool":0},"34hdASjtw_StF5DmXXf03g":{"text":"My experience w my main squeeze was not to expectation and we were overly ambitious thinki","useful":0,"cool":0},"mdJ2nkLLKsV-t1to5v45iw":{"text":"This place is one of those touristy places...food is bland and overpriced. $37.00 for a fi","useful":1,"cool":0},"t-TAsV8fic870mtINXK78w":{"text":"We enjoyed dinner here Sunday June 5th.  First time to enjoy this restaurant.  Started wit","useful":1,"cool":1},"0Bbfh3RkeXxqCVGc_f2TTA":{"text":"The crab cakes = the best I've ever had!  Everything about this restaurant was great, even","useful":0,"cool":0},"uZGnjldz13-XQDpeSkhz5g":{"text":"5 stars for the service, experience & wine -- 2 stars for the vegan offerings and adding b","useful":4,"cool":2},"sWXFhSn7gLrva4boDaABIg":{"text":"Went for dinner for my graduation! Our dinner was delicious. I had fresh oysters, veal, an","useful":0,"cool":0},"FgdOpNkF2u97nJ60fTmnTA":{"text":"Made a reservation here for a nice dinner out during a Thanksgiving trip to New Orleans.  ","useful":0,"cool":0},"Iy12mwD7fXOEP07dCu3MBg":{"text":"We went to Arnaud's for dinner and while the food was fine, it didn't stick out to me the ","useful":1,"cool":1},"uLuZSm0QK1zbVJE7IlccBg":{"text":"Ok so I have to admit, I didn't get to try much of the duck I ordered but it looked incred","useful":0,"cool":1},"1zfFcm2_0rD0FIMEYH4Yvg":{"text":"This is the place you want to be for a perfect evening    We sat at the Jazz bistro and en","useful":0,"cool":0},"_e2fsYoDYZ8_71KOhdefyg":{"text":"I cannot remember a restaurant where I was better taken care of. The wait staff were incre","useful":0,"cool":0},"yw9TyL3g2ZV2kyy7L5uXEQ":{"text":"Robbed! Literally! Please don't bring valuables to this place. My niece had her cell phone","useful":0,"cool":0},"jz1Q3Jlwnb1adFTuey9ZqQ":{"text":"Upscale, old school restaurant in the French Quarter.  Wait staff is thorough but can seem","useful":0,"cool":0},"1V8pVZT7VAP4byAvLl8QMg":{"text":"Been wanting to try Arnaud's for years.  Finally got my chance this past Easter weekend.  ","useful":0,"cool":0},"UOgbPPTv9C_dLpv6bLJ0yA":{"text":"At a convention, we had a large party which kept growing. the staff accommodated our shift","useful":0,"cool":0},"DeaZavCYCoqPceAdfDkBbQ":{"text":"Meeting Venue Review: \nWith the difficulty of entry for setting up meetings (Buzzed in thr","useful":6,"cool":3},"XCkmo_vRimrn6kIKi-WAZA":{"text":"Went there for the Sunday brunch and Arnaud's did not disappoint!!! Fabulous food includin","useful":0,"cool":0},"lqXcZcd0edb6m0flX2nBig":{"text":"With a friend in town we of course had to go to one of the \"classic\" New Orleans restauran","useful":0,"cool":0},"MaegIe7l3QFnAzOHK1fYpg":{"text":"One of my favorite resturants in NOLA.  The food is delicious, the atmosphere is perfect, ","useful":0,"cool":0},"vnVn9oIir2s-8siJ9IIaLQ":{"text":"My first impression was not great. I worry when I see \"kids\" running the front of the hous","useful":0,"cool":0},"Jvyym3mKsOcYqI2P-LWUYA":{"text":"Top notch service and food. I was here when i was in my twenties and now in my thirties, s","useful":2,"cool":0},"p4Jj9sf1rY_ShR7ClEswzg":{"text":"I'm normally a Galatoire's fan, as nothing is bad there, but had to try this place finally","useful":0,"cool":0},"iRZcnwcNq-cvaK5rJcqRRQ":{"text":"I went there for a business dinner and loved it and can't wait to go back!   The atmospher","useful":0,"cool":0},"YQL1mcsjRcvOXkItK-zehA":{"text":"Their Sunday Jazz brunch was fantastic! The prefix menus to select from made my days big 7","useful":1,"cool":0},"geUDgKg3ZV8IqCQxXHh8KA":{"text":"Delightful service and great food -- you cannot go wrong at Arnaud's! We tried many dishes","useful":0,"cool":1},"n31HDATh3F0vGpa4WIhgCA":{"text":"The Mister and I had dinner in the jazz bistro. Our waiter was outstanding. Food was amazi","useful":1,"cool":0},"rfiN8xtf0srBV1sV_8QWpQ":{"text":"This was the first place we went to when we arrives in New Orleans. We got all dressed up,","useful":2,"cool":0},"KRouIcMJNoPcTw8Y_LT_aA":{"text":"SO we had much better \"trendy\" food with flavors that were really incredible.  But, for wh","useful":1,"cool":0},"swVJAtofoiXeIySzDqdxxQ":{"text":"My family came here for the Jazz brunch on Sunday. Everything was excellent and this resta","useful":0,"cool":0},"WPSj_9v4OBOT-mewUCBIew":{"text":"Arnaud's has a gluten-free menu! The atmosphere is romantic and lovely, especially if you ","useful":0,"cool":0},"wiwSUSrEwANdk0g7bgXhRA":{"text":"12/28/2014\nCame here for Jazz brunch. Food was decent. Band was good.\n\nUnfortunately we go","useful":0,"cool":0},"RnwvCGRfzlVKmcJ5uPyD5Q":{"text":"I so wanted to love that place, its history and its dishes. Unfortunately, the night fell ","useful":0,"cool":0},"Bfh_wm_NfXvcQOWEI11Ucw":{"text":"We were told that Arnaud's was a must when visiting New Orleans.  What a disappointment.  ","useful":0,"cool":0},"ERgjr9pIhsYKh3RGtp5vlg":{"text":"Our group came here while on vacation to celebrate my friend's birthday, and while we samp","useful":0,"cool":0},"XHF72x9rndohXo_SB5BnJQ":{"text":"My mouth is watering just writing this review as I reflect on our MIND BLOWING experience ","useful":0,"cool":0},"gAB5fR4aHpJMGKTEEew0qA":{"text":"Annaud's---I wore a jacket. We sat very close next to a couple who looked like they arrive","useful":0,"cool":0},"89cZAD7dwsB3b4A7LHsVGA":{"text":"We had Sunday's jazz brunch and it was wonderful- the service in NOLA has been excellent b","useful":0,"cool":0},"fJ3L94UA9W3VQgpCjNw_Rw":{"text":"Went here for Jazz Brunch -  disappointing Jazz and disappointing brunch.  \nTips: do not t","useful":0,"cool":0},"sGwsfJbG9EGZXGx2lp8awg":{"text":"Truly excellent. The veal with the shrimp and crawfish exceeded all expectations.  Very ta","useful":1,"cool":0},"mDwF67gw6pRsYjp-nJHLXA":{"text":"Wonderful service and ambience. The Gumbo was watered down and our bread was cold and stal","useful":1,"cool":0},"ONsN8q0ftCeL9KkrInmazg":{"text":"The Jazz room definitely leaves much to be desired if you are looking for atmosphere. The ","useful":0,"cool":0},"FKRp7PY9WCy-5BI510mUKQ":{"text":"We came here during our vacation for our anniversary dinner. They greeted us by asking if ","useful":0,"cool":0},"1_hlIiriIrpt6nWJUIAAdQ":{"text":"We dined at several of the classic old restaurants this trip and Arnaud's was the only one","useful":4,"cool":1},"KpxCxelgHQaAhCDKy5jTSw":{"text":"One of the best restaurants I have ever been to.  I live in Charleston, SC and after visit","useful":1,"cool":1},"sIHbJ-5O2E8YyyTVMfCeYw":{"text":"We were pushed over here from the very Rude establishment across the street and I have to ","useful":0,"cool":0},"41bbIvhmghhQjGGUZqDztw":{"text":"I had Thanksgiving dinner at Arnauds.  I personally think that this restaurant is one of t","useful":4,"cool":4},"eP9EVVIzEUM4ZxsFeu0_Hg":{"text":"Terrible shrimp and grits.   The shrimp was deep fried and tasted like they came from McDo","useful":0,"cool":0},"L2ZNBNpvkrguerb2w9VAsg":{"text":"Went with a group of 11 for a bachelor party.  Had been told this was a great place. Check","useful":0,"cool":0},"YaVuhjL1PuODIgVALbYVzw":{"text":"This was awesome.  Friends 37 year anniversary. Shrimp arnaud, crab with light cheese bake","useful":2,"cool":1},"F1Jqh4XCm5VpR3qEesJJew":{"text":"I have only ever visited Arnaud's for the Jazz Brunch, which I highly recommend.\n\nArnaud's","useful":3,"cool":0},"EMsDURZ6FIc5AvJwoPukPw":{"text":"30 years ago I heard my grandparents rave about Arnaud's and Antoine's, so I always wanted","useful":1,"cool":0},"vZfa-T0Lu8NQsgJUX4bjXQ":{"text":"Dinner with group of 8 people all from Los Angeles area. Everything about the evening was ","useful":0,"cool":0},"Y3s68ONoi1cmDLoF4FPhow":{"text":"It started innocently enough: Six college friends on a long weekend trip in New Orleans, p","useful":0,"cool":1},"WWNAXhxeI2AtHf4N7YLXjQ":{"text":"This is a hard review to write.  My wife and I have been coming here for 30 years and this","useful":2,"cool":0},"HzLb8uKkr14CSCViHXQf_w":{"text":"The staff is very attentive, Thomas was great, he explained the menu and he was constantly","useful":0,"cool":0},"Jn2-vSct0YPjLtGsaTicsg":{"text":"This place is reliably great.  We have been here several times on our annual treks to the ","useful":0,"cool":0},"e3K7pyYNdcdCStSTiWzf1w":{"text":"Had the Veal Wohl at the Jazz Dinner. Everything tasted great, the music was good too. See","useful":0,"cool":0},"nojDJaMUMDig3SPT2yIdTA":{"text":"A true New Orleans classic.... \n\nWithout a doubt the main dining room is one this country'","useful":8,"cool":4},"NGozU82UT0E5UZAjQywf5A":{"text":"So Mediocre and the food made me nauseous.  Nothing was good.  Crab cakes mediocre and Gum","useful":0,"cool":0},"LRs6f24LNsXNmrGZZPVyow":{"text":"Arnaud's is one of the classic New Orleans restaurants, serving a mix of French and local ","useful":0,"cool":0},"H0djxkffvieO_VH_cWUB1A":{"text":"We wanted an authentic, albeit a little tourist-y, New Orleans meal, so we tried out Arnau","useful":0,"cool":0},"LRX8MHmicojoNVlFGKueGA":{"text":"This is one of the top upscale restaurants in the French Quarter, and it's supposed to be ","useful":0,"cool":0},"qGn5P66sSS6DvsVOdKgCBw":{"text":"Five-star service. A great location. Amazing Bananas Foster.","useful":1,"cool":0},"GypFhBavPVsae9T4v-jeBw":{"text":"Arnaud's is a NOLA institution and having drinks on the balcony looking down on Bourbon st","useful":1,"cool":0},"Qe4b4vRsJqyMZWKTg1i78A":{"text":"Dinner for eleven celebrating a Tulane Graduation. A famous, classic place where I have ea","useful":0,"cool":0},"JxV8R-U3Ky1mmToC4ryGZQ":{"text":"A group of 8 of us ventured to Arnaud's after hearing rave reviews about it. \n\nThe ambianc","useful":0,"cool":0},"lO2mXTINtPo_REa01-2KiQ":{"text":"Love everything about this place, which is quintessential old time New Orleans charm. Came","useful":0,"cool":0},"_UR3ifUTtJZUR-TVuR5b-Q":{"text":"Came here on the recommendation of our Bon Maison guest house host, who suggested it for o","useful":1,"cool":0},"S7zsREwuow6CnOZZfvErfw":{"text":"The filet and oysters entree was delicious, even with the steak a touch beyond medium rare","useful":0,"cool":0},"y3pM4_TEBUGZQdvnxMHAeg":{"text":"Really nice escape from the rest of Bourbon. We ate on the Jazz Bistro side and I got to b","useful":0,"cool":0},"V74W-echiWlP9-ERKc0-KA":{"text":"Over-priced and over-hyped. The atmosphere is like eating in a cafeteria. The food was OK,","useful":1,"cool":0},"O8cktY9sKisKzd_h2qBmnw":{"text":"We were in New Orleans celebrating my birthday and wanted to try one of the established ol","useful":0,"cool":0},"9aGjivtPAUhEybjoqWCizg":{"text":"I'll start by saying that the waitstaff here work as a team to make sure you're beverage i","useful":0,"cool":0},"tBQgON4wzzGPiFEzoNGmVA":{"text":"I guess this restaurant is resting on laurels and was perhaps excellent in decades past. T","useful":0,"cool":0},"bDnH1bPa1W6iE08dAQMGfQ":{"text":"I took my daughters for their birthday to New Orleans. We called for reservations a week i","useful":0,"cool":0},"v3Qx7ljfgrP2TBsW-_NeNQ":{"text":"Southern Hospitality!\nMy favorite restaurant by far. \n\nThe service is top notch and real c","useful":1,"cool":0},"rpCqOuPRqUqQqG82zmO6BA":{"text":"Went for the pompano turned out to be a big mistake. The pastry was flaky but too thick. T","useful":0,"cool":0},"CslStEpmGyTE8OPPWzF6aA":{"text":"Cold food and bad service.  Don't buy into the hype of this place.  The Quarter has too ma","useful":0,"cool":0},"mPt4viUnM-xaD1t2S4qbZw":{"text":"I couldn't give this less than 1 star.  The staff was less than accommodating for our part","useful":0,"cool":0},"KJGbnYa1hR6_QOaJcLIKbQ":{"text":"A lot of people use the word \"classic\" to describe this place but when I think of this wor","useful":2,"cool":2},"lRV6ZqNX_fiKRrvmo2bKbQ":{"text":"I have to admit I was thoroughly disappointed by the Sunday jazz brunch.  It was bland jaz","useful":1,"cool":0},"RfGvyNbdxYmix5IqDfubzw":{"text":"Really I would give this place like 3.5 stars. It was a very nice place, but I think I was","useful":1,"cool":1},"0AL4PSRVQ0uAyq3X2SxegQ":{"text":"AWFUL. The food inedible. Whatever you do, do not eat dinner here. I went with a few frien","useful":3,"cool":0},"O1iatd044zZ2dA66GWw7Rg":{"text":"An anti-climactic experience, mostly due to the lack of pampering we'd expected. Arnaud's ","useful":1,"cool":0},"pm_gzn4kuwjbd3qhDhrQfg":{"text":"Both my wife and I pretty much fancy fooded out went to Arnaud's Bistro. There was a small","useful":0,"cool":0},"9yQzHjT-je9__fKJWa29Cg":{"text":"We had high expectations and were sorely disappointed.  The food was good, but totally une","useful":1,"cool":0},"3dwKonWY3Z1BNh6BMp6FNw":{"text":"This was my first trip to New Orleans and this restaurant was the best experience.  We had","useful":0,"cool":0},"JhgFKpwPDvECFlEkYFJ64w":{"text":"I went to Arnaud's on 2/28/15 with some girlfriends during my 1st trip to New Orleans. I t","useful":0,"cool":0},"A3ZpOPRpy4Ky8QPt8jJOwg":{"text":"AMAZING FOOD, probably the best I had while in Nola. They have a jazz band that will play ","useful":0,"cool":0},"tib74n2F6Mwva-QNwkF5nQ":{"text":"I took a group of 25 people to Arnaud's for dinner and it was a perfect group place. They ","useful":0,"cool":0},"xIeMD9HVM3pJ99OhapOvlQ":{"text":"Sunday Brunch before saints game is a must!!!\nthey opened at 10 am and was dressed in jean","useful":0,"cool":0},"jm6mtDRwp8kPEmJFRADsdw":{"text":"Went here yesterday for dinner. It was quite excellent. We both ordered off the set menu. ","useful":0,"cool":0},"H25L_-1Remuhi8as-Y_rrQ":{"text":"Probably a 4-1/2 star place but this is the best I can do. A classic French/Cajun restaura","useful":0,"cool":0},"8u9qC0LLBJ8F8bsbu0msDA":{"text":"Don't tip the musicians at the Jazz Bistro! There's a $16 surcharge included in your bill ","useful":2,"cool":0},"10aZbQ26ccjNib-G9wwFlg":{"text":"This restaurant was a big disappointment to us.  After dining at K-Paul's, Galatoire's and","useful":0,"cool":0},"mBiY2g04KeEZYTyCCtE6ig":{"text":"Such a fun evening! If you do not like horseradish then don't get the shrimp arnaud. Every","useful":1,"cool":0},"41fs9gORb960Qd-qDIyLPw":{"text":"My husband and I came here for our 10th wedding anniversary. We had a reservation and it s","useful":1,"cool":0},"p0LBJU38mqAza_WZ-3CXJA":{"text":"Came here for the Jazz Sunday brunch. I liked the jazz trio at Commander's Palace better, ","useful":2,"cool":1},"3XuXzFDN2HZldbbgCQ7WqA":{"text":"Our group of 8 (long time girlfriends) dined at Arnaud's on 10/24.  We made prior reservat","useful":0,"cool":0},"fFEOFhuUP_afPCqgeJ5fvw":{"text":"All do respect to the wait staff- who were working their butts off! The place just felt \"o","useful":1,"cool":0},"LgE382Kh0HT3LadGk1NI1w":{"text":"The food here was excellent. Although they didn't have any vegetarian options on the menu,","useful":1,"cool":0},"3fYHUyhlZSSJW1BoOhFvUA":{"text":"Great classic menu. Great service and even more importantly, our party had a medical emerg","useful":0,"cool":0},"uPNYU8OyyZX-SPiAv9AWqA":{"text":"Fantastic food, of course. When there was a mix up with our reservation for a very large p","useful":0,"cool":0},"uWEY-5tP1YQg3gJWGrS4pw":{"text":"OK, Blah or would that be B-OK? Nothing glaringly disconcerting, distasteful, or bad - tab","useful":0,"cool":0},"CRc91Kcvrq3558eGdjlm6w":{"text":"This was my splurge during my visit to NOLA - French 75 cocktail, mushrooms stuffed with B","useful":1,"cool":0},"XX7WzmiZ5_fCC56UhtJB1A":{"text":"This was our first stop during our trip to NOLA and it was truly special. This place is a ","useful":1,"cool":0},"IH846BBYUw4IWpRJo7VoHA":{"text":"Arnaud's was perfect in every way for my wedding reception dinner. The staff were helpful,","useful":0,"cool":0},"pjy3P526GbfHlh9GVDj2MQ":{"text":"EXACTLY what you think of when someone says \"cocktails at the bar in New Orleans.\"  \n\nOld ","useful":0,"cool":0},"qtroBXjd3O6uG-V4IGmXXw":{"text":"This is one of those old-school New orleans places that have been around for ages. I think","useful":1,"cool":0},"VFoeovjptxae1Efl4aWDdQ":{"text":"Upscale restaurant. Save room for Bananas Foster dessert. Average food.","useful":0,"cool":0},"YMo0yL6ryC7v6XntkMv_Eg":{"text":"We went with a group of 6 for Lundi Gras lunch.  i was a little nervous after reading some","useful":0,"cool":0},"xPSldqfmxLYUnT1yO7N2AA":{"text":"This place was great! The shrimp arnaud was not my favorite. The crab claws, crabcakes, an","useful":0,"cool":0},"Y15mUUQJzXLCmqZzqCx4_w":{"text":"Good food and nice setting but don't ask for a black napkin or a pomegranate martini.   Ou","useful":1,"cool":0},"eAVcEv4tgFoV6RCKy-ECyA":{"text":"To end my week over Christmas, we ended here. Baked oyster fare was edible. Raw oyster was","useful":0,"cool":0},"v0vJNA8AnJxrdIm7Qk7idA":{"text":"Arnaud's... delicious, if tiny, entrees served with old world charm to live jazz.\n\n1. Food","useful":1,"cool":0},"yx0OewG7BP_XE4W82gqjGA":{"text":"For our last night in New Orleans we wanted to hit up another of the Old Dame restaurants,","useful":2,"cool":1},"V7eMfEDOKx1Iy2yrxZdmzQ":{"text":"Having a few hours to spare before departing to the airport, I chose Arnauds for Sunday Ja","useful":0,"cool":0},"6l8nB-ggDZ-uIAQrDt0DJg":{"text":"We went for the Sunday Jazz brunch and I would highly recommend anyone checking it out if ","useful":0,"cool":0},"GYr1fI96E3gi1z35TJ2-6w":{"text":"We chose Arnaud's for their impeccable service and dynamite dining for a very special dinn","useful":0,"cool":0},"uqaYFylgUU_kAWrhPNs4VQ":{"text":"Fabulous atmosphere, friendly service, and great food. The creme brûlée was wonderful! The","useful":1,"cool":0},"MyI5KNBFClXbdYwhuBT7Rw":{"text":"This is one of the old running restaurants close to 100 years old. It has been an honor an","useful":3,"cool":3},"JECqoHCeBJjXLXDvkcqYgA":{"text":"So sad to see an iconic New Orleans eatery fall from grace, unable to let go of a culinary","useful":1,"cool":0},"DvuEJYJ0aSTqncHAOvjZTA":{"text":"Fully tattooed and dressed casually with a bass pro hat I received the best service in the","useful":0,"cool":3},"Yp_YGIyJmfnNikSiFRjTCg":{"text":"BEST MEAL OF MY LIFE.\n\nMy husband and I are big foodies, so our goal on vacation is to try","useful":0,"cool":0},"MHIC2aGH1gkKeDi5ym9RlQ":{"text":"Great service and atmosphere. Started with the Shrimp Arnauds as an appetizer.Heavily coat","useful":0,"cool":0},"JpE1sG-_63cbsr6ZeKTJcw":{"text":"NOT impressed! Our waiter (older white bald male) was rude and unfriendly! And the food wa","useful":2,"cool":0},"YVaokh2VLi6DlzqT1kbK5A":{"text":"Flat out amazing... Great food, wonderful wine, and the best jazz trio I have heard in yea","useful":0,"cool":0},"pSYIHi_9kPUZv4iJcNv9kQ":{"text":"Skip apps,desserts & sides. For entrees I suggest the duck & veal- best I have ever eaten!","useful":0,"cool":0},"boqrHekZz7LM65n5l50Y4Q":{"text":"My favourite restaurant in New Orleans and probably top 3 in the US.\n\nDon't miss the Oyste","useful":1,"cool":0},"Tu3a0oN5MSU5FyLzQEMSjw":{"text":"As good as it gets!! I always pay attention to how clean the place is and decor.. They did","useful":4,"cool":1},"gVW4_z7PFkUdwrHdUqo6Dg":{"text":"We ate here for dessert for a birthday on a Saturday night. The restaurant has 2 halves - ","useful":1,"cool":0},"Evn7fMHrC98ETkEMoyUy9Q":{"text":"Haven't been here in 40 years. It is even better than I remember. Staff is world class, fo","useful":0,"cool":0},"TjM1twzqFRbUsUg1wu1wJw":{"text":"Jazz, 5 star service, delicious food - what a great spot! The oysters, soup, escargo, ever","useful":1,"cool":0},"n_X1Qfptr7RyGqnZV88gSQ":{"text":"Just a few comments, since much has already been written:\nThis is a hundred-year-old resta","useful":0,"cool":0},"AnQBvrYfeO8lptkVX7wrFw":{"text":"This restaurant already has many good reviews, so I'll just say I highly recommend it for ","useful":0,"cool":0},"u4spaMalILlt2i6TibQNWg":{"text":"I came here last night with a friend we had just eaten dinner at the Redfish grill and cam","useful":0,"cool":0},"Do4NjQbeQZXA4JHCGoPQ8w":{"text":"I love New Orleans. I always enjoyed Arnaud's.\nI had a great time and the best Filet Migno","useful":0,"cool":0},"mhr0RfXeJ4Ah0EqgilIxTw":{"text":"Upon walking in to Arnauds, I felt like I was entering a prohibition-era speakeasy.  As if","useful":1,"cool":0},"cStoYUKJGlQnWqEfm1C6VA":{"text":"I was expecting so much more from this renowned New Orleans restaurant.  The ambiance and ","useful":0,"cool":0},"ZOq0WfM7PzVbRPluAXvOOA":{"text":"Nice upscale restaurant with the \"Old New Orleans\" atmosphere. The service was very approa","useful":0,"cool":0},"v1TIV9p1oMFbCJqHbj_dLw":{"text":"My parents always used to tell me that if I couldn't say anything nice I shouldn't say any","useful":2,"cool":1},"cSt7tgX6y2EwRH44PJLm8Q":{"text":"If I could go lower than a one I would.  This was a very unpleasant experience.  The exper","useful":0,"cool":0},"jvlyBd7wFZkr4Wk0RFn_-g":{"text":"Classic restaurant down in the Quarter. \n\nWe've only been there once but it was great.\n\nTr","useful":0,"cool":0},"5QXq0IKT_BiO1MS0XMIN9Q":{"text":"We had a wonderful time here... The table we had was great right by the front windows, the","useful":0,"cool":0},"qezsFovX27DYXfRi2AXe2A":{"text":"We were the last group in the Jazz Bistro on the evening of a busy Easter weekend.  The fo","useful":0,"cool":0},"TYpORHCqPBxtMLrAZg2xIQ":{"text":"During our first trip to New Orleans, my girlfriend and I decided to have our first meal a","useful":0,"cool":0},"nQlgTxLTzGeqtg6h5yNI7Q":{"text":"Similar to Antoines with a more extensive Menu and it is better kept up.  Also a must have","useful":0,"cool":0},"iFIQtIFO-K8SGXEsWfYGQA":{"text":"One of our best meals in New Orleans. We stayed at an Airbnb and our host was a lifelong r","useful":0,"cool":0},"q2tz-FGM1tGzNElMwqczEw":{"text":"Awful. We decided to try this new Orleans \"staple\" for brunch. Big mistake. We walked out ","useful":1,"cool":0},"C1ui_oQ87UzNOmn4cC5W7w":{"text":"The food was delicious. It had a nice ambience but was a little loud.","useful":2,"cool":0},"xziUjzWrLUrKahcdz9g4ZA":{"text":"Celebrated my friend's 30th birthday here.\nGreat service, beautifully decorated dining are","useful":1,"cool":0},"NdKTGdGCo73dyxGkAVzKiQ":{"text":"Arnaud's sits on the corner of Bienville and Bourbon Streets in the French Quarter.  The r","useful":0,"cool":0},"JrIAyF42B5Kyl3TSytuniw":{"text":"Would definitely recommend the jazz dining room as you can enjoy the music as well as, lik","useful":2,"cool":2},"tx8g-BYr19GhVnJ64384Tg":{"text":"Another fantastic dinner at this jewel of old New Orleans cuisine. Their Executive Chef, T","useful":1,"cool":0},"RMDozFjawvAKWpTo3B2BGw":{"text":"Cannot believe this restaurant. Went in expecting some really great food... Nearly everyth","useful":4,"cool":0},"YK-shojXadlulnZbv8-8Kg":{"text":"Arnaud's is one of New Orleans finest restaurants. My tour group held its farewell dinner ","useful":1,"cool":0},"aNHsNnTLhAOMch6yrGpRsg":{"text":"Classic creole spot. I would highly recommend the oysters bienville and the pompano dautre","useful":0,"cool":0},"1fnjCOZ7pgGIQVfwhqmXiQ":{"text":"They share the same space as Remoulade because they are owned by the same family.  However","useful":0,"cool":0},"wi61hrr51OP1Wdx2bcT79w":{"text":"Dinner with 4 friends, great food with pathetic service...senior n experienced server.....","useful":0,"cool":0},"xptzksfLOO2JOBfTydixmg":{"text":"Wonderful experience. We started with the Souffle Potatoes for the table, puffed potatoes ","useful":0,"cool":1},"i-m1ont1-baT2OumhvsS5Q":{"text":"Haven't eaten there in a long time, very disappointed in the meal.  The fish selection was","useful":0,"cool":0},"Pj1NuGZEArvCmdqhoBCGxA":{"text":"I very much enjoyed eating here. The food was delicious, well made, and it was prepared in","useful":0,"cool":0},"Wgopu4UG9p4WFiCPaeG5iA":{"text":"Went to Arnaud's for the first time even though we stay across the street every year. My c","useful":1,"cool":0},"HHW1DUfAm3Syt06DNuT0SA":{"text":"I knew when I booked our trip to New Orleans that we had to do a jazz brunch, but with so ","useful":0,"cool":0},"Ml4rt5zv37kE2OToL2N5dQ":{"text":"Arnaud's Bistro. Historically charming building. I want to be generous. Not great restaura","useful":0,"cool":0},"b7h65kF-zZUmmPBLUm4rEA":{"text":"We had heard such good things about Arnauds... Imagine the disappointment when we dined th","useful":6,"cool":0},"SY6CaxcRWTGZxfVH4cw70Q":{"text":"Had a wonderful dinner here in March!  We had the Shrimp Arnaud as an appetizer and it was","useful":1,"cool":0},"IzBoCMWz3gxRBK22eXkRMg":{"text":"Wow. I am a foody and this place rocked. Great food, great waiter (Jasper), great drinks a","useful":0,"cool":0},"bJBrjrVS3JT20-Ot4awQtg":{"text":"Very well known, upscale restaurant in the French Quarter.   Arnaud's is in a beautiful bu","useful":0,"cool":0},"KJEPs7xsSOioYJZn6im30w":{"text":"This is a. special review, for just one item that we love here - the potato crisp appetize","useful":3,"cool":0},"FttgK-nDX8lFmJerjrI0ug":{"text":"So in the midst of restaurant week, I couldn't think of a better opportunity to try Arnaud","useful":0,"cool":0},"He8C31fLwrnQ3LCCgkhegA":{"text":"Great atmosphere and service. It is very expensive but a great restraint if you want to ha","useful":0,"cool":0},"bwPwkQCt5c_0Wedi1TtLig":{"text":"This was THE best meal that I've ever had!  We started with a shrimp appetizer with Arnaud","useful":0,"cool":0},"jbHRaS5OHKBZ9rcv2fbKoQ":{"text":"I went here for a birthday dinner and really enjoyed it. Their oysters on the half shell w","useful":2,"cool":0},"_o3MXbCvkXU7D9C2QDbZxw":{"text":"This was my first time in New Orleans, and our work group decided that Arnaud's would be a","useful":0,"cool":0},"Y5bMlWzQWZL61GeO1wFkcw":{"text":"This was our first stop in our NOLA dining experience and totally met our expectations for","useful":0,"cool":0},"PsZnI-o47OEhp98V6mjVsA":{"text":"Service was outstanding.  Oysters on half shell superb. Wife had the ponchatrain and I had","useful":0,"cool":0},"tTw37AXUbvkrIbkFtJsMww":{"text":"One of the best meals I have ever had was here at Arnaud's. I hosted a dinner for my oldes","useful":0,"cool":0},"LI8_yYRckUqLBTXkzWLCbA":{"text":"The Oysters Bienville were STUNNING. The service was good, but at such a high-end and high","useful":1,"cool":0},"D6-LgQxrHMBr5kYgFsjI7Q":{"text":"Glorious meal.  \n\nHaving something like this on Bourbon St seemed to be a bit odd to me, b","useful":0,"cool":0},"JHAOBJ89d81JKAXYV56eGw":{"text":"Banana foster is to die for. Arnauds shrimp remoulade is awesome. Love the speckled trout!","useful":0,"cool":0},"GTtcSlNtUt-yJqwqtdwylg":{"text":"Service was good and friendly. The tacos were what you could get at any 3rd-rate truck. Th","useful":0,"cool":0},"w7u8Nfw0CmWuRJqckH2h0g":{"text":"Food - 4 star (fish/crab & veal)\nService - 4 star (if the kids would have left for good 5 ","useful":0,"cool":0},"-5C4aGLmEM3ePQZhi5A6pA":{"text":"Great ambiance but the food was not very good. Lacked flavor but really loved the apps.","useful":1,"cool":0},"8W6KRbpZuDLXEjl81U8kjg":{"text":"Another winner!!  Food was excellent. My wife & I enjoyed yet another great meal in New Or","useful":0,"cool":0},"M_H4c0-RW3MuFPSY2R9wQA":{"text":"One thing being on this Panel is that you get to dine and wine with your favorite regulato","useful":2,"cool":2},"QMkt4Z86_JcLd32bqMITcg":{"text":"Service was subpar, food was so-so at best. I didn't actually eat my crab cakes which were","useful":0,"cool":0},"E3-MVdf66GWcMQM9t8XvSQ":{"text":"Had a wonderful birthday dinner in the Jazz room.  Customer service was great, live  jazz ","useful":1,"cool":0},"aJOZIn6m9C4R01lyjv8bpg":{"text":"My family and I had dinner here earlier this month after it came highly recommended by our","useful":0,"cool":1},"zX210Qa99zC0zrzcraWn4Q":{"text":"I went to a \"spirited dinner\" during the recent Tales of the Cocktail Week and was enterta","useful":0,"cool":0},"LBf4cGzwFgtR-5CzK6xnNw":{"text":"Arnand's, you are taking advantage of your customers. $27+ for a single breast of chicken ","useful":8,"cool":0},"2qVz6HwMjPrcVM6eHkXVKg":{"text":"This was the worst dining experience of my life. The bar was slow, the waiter was mistreat","useful":5,"cool":0},"ce6dPOkQfXx3rv6p_gXaag":{"text":"New Orleans, like other old cities that have an incentive to preserve their cultural histo","useful":7,"cool":0},"6cGNngpuX3EupcwpURQwMQ":{"text":"Good, but not great. I had the grilled pompano. It was too highly spiced. My wife had the ","useful":0,"cool":0},"ovyq-q6tHkUABQqCuUV4ig":{"text":"Great restaurant right off of Bourbon Street.  I attended a group dinner here the other ni","useful":0,"cool":0},"EKbJJi-1MujiD7yUVkD9BQ":{"text":"Food was very good, service was excellent!  Shrimp bisque was very good, but u have to ask","useful":0,"cool":0},"rbRTEDpUw5WeLbjpREkXEw":{"text":"Review based on dining in Jazz Bistro\n\nFood: 3/5...some were very good, some were unique, ","useful":0,"cool":0},"c2xktIiIwuSJAkC_TagxlA":{"text":"Even after living in New Orleans for several years, I had never tried Arnaud's. I returned","useful":4,"cool":1},"GWZdF28UHN4w--lat1uPWw":{"text":"This place is just hype.  Don't waste your time or money.  Complete disappontment.  I neve","useful":0,"cool":0},"HkHpaw1wcR-21tqk9pT0Vg":{"text":"Went here during Coolinary month, an I could have sworn I already wrote a review. We were ","useful":0,"cool":0},"VpUpYArbuw0j-wZl_jdy6g":{"text":"\"You've never been to Antoine's?\" Nope. \"What about August?\" Double nope. But I HAVE been ","useful":1,"cool":0},"gGXuyDHL_QhVpkfFKrL7yg":{"text":"It's nice to go to a place that let's you feel good about taking risks.\n\nArnaud's have bee","useful":1,"cool":0},"gnzhLwClD7ms47jhx-L98A":{"text":"My first reveillon dinner. Not impressed. For $50 not a whole lot of food. Then get bill a","useful":0,"cool":0},"avb5lISA2E4XhN9lJ5plgw":{"text":"Amazing Food, amazing dinner!! A gem\nIn the heart of bourbon street!!  We has the oysters ","useful":0,"cool":0},"Rn3OEudbRGHFsxmom4N0-g":{"text":"Worth it for the atmosphere alone! This restaurant feels like a 1920s social club (or brot","useful":0,"cool":0},"lwgOPTdEsO6CET2gLjptMw":{"text":"My husband and I dined here after reading all the reviews posted on social media. This res","useful":0,"cool":0},"yB6-pp67XKJUDrs2Z2q88A":{"text":"Killer Sunday brunch","useful":1,"cool":0},"EjibzqN23ZBUWb-Tml8Uhg":{"text":"Just marvelous.\n\nThe lady and I ordered from the prix fixe menu for our jazz breakfast / b","useful":0,"cool":0},"k1R3tx8OzneSD0jT_0xf1g":{"text":"Great service staff. Finally a place where they don't remove your plate until everyone is ","useful":0,"cool":0},"ziQv-X6EQS4jRcy9DneUuA":{"text":"Reservations required- shorts not acceptable for the main dining area- we came here with t","useful":2,"cool":1},"hK7M9DB9rO79V-jYPsVN1Q":{"text":"Classic old school Southern hospitality is what you'll get a this place. Where your waiter","useful":1,"cool":1},"TWkZjY_wYv0SI1Fp706EyQ":{"text":"I expected more from the oldest restaurant in Nola with high prices. I booked a table a fe","useful":1,"cool":0},"XuG_bP6KW-Ow8ju_HaFUdQ":{"text":"Everything looked and tasted delicious. The escargot is served with a puff pastry top whic","useful":0,"cool":0},"xur2BItZv1TA8zQMf-J_Lg":{"text":"Arnauds has always been THE place we dine at whenever in New Orleans. If you really want t","useful":0,"cool":0},"Fa_nh-vinFvJytFT6JC-ew":{"text":"Nothing special.  Very loud.  Over priced nothingness. My waitress seemed new or was simpl","useful":0,"cool":0},"JNEMujvcRDQ90tn1BBrW_g":{"text":"Service was sub-par.  Food was mediocre.\nOne waiter for the mezzanine level.  No help.  Wa","useful":0,"cool":0},"HaLeRCXqaEOU3eSIRon2qw":{"text":"Fine dining at its best! I heard about this place through the cashier at New Orlean's scho","useful":0,"cool":0},"WG3koMQnH_s4iISlxiShSA":{"text":"An old school, fancy jazz lunch. The service is non-stop, the food is amazing no matter wh","useful":0,"cool":0},"A8q9BaxJGsuL6oY3OIqcLA":{"text":"A disappointing dinner, particularly at $250 (after a 20% tip).  The mixed cocktail ($11) ","useful":1,"cool":0},"vsI680zAV10Y2cWGFf_e0Q":{"text":"We had barely 9 hours to spend together, so we started with the jazz brunch at Arnaud's in","useful":2,"cool":0},"v8xxookMoTtAC67kbphBOQ":{"text":"Gentle Readers, I have been reading some of the reviews here and there are a few suggestio","useful":0,"cool":0},"JFUn5N7EsrHvn5qvDtw3PA":{"text":"Wonderful experience at Arnaud's Jazz Bistro. Our waiter and his complimenting staff (Jasp","useful":0,"cool":0},"tRw1xRvoNhTeKV0QpO-CWQ":{"text":"We just had to check out this iconic New Orleans restaurant and what's not a better time t","useful":1,"cool":0},"uHUjr1X0jrwYIlx9fENLtQ":{"text":"A very bland menu with very very few options for vegetarians. Ordered the crab cakes entre","useful":0,"cool":0},"kgQZoaVWOKEkUXU-Bhzw9g":{"text":"Fantastic food and atmosphere. Very friendly staff!","useful":0,"cool":0},"QHmddPpdUhz285A5mWPgtQ":{"text":"We had a fantastic dinner at Arnaud's thanks to Augie. He made such a difference in making","useful":0,"cool":0},"Qk3WDZ682-_p8Gd4WyvGAg":{"text":"I was so excited to come back here - I've been here on a field trip with my high school Fr","useful":0,"cool":0},"wVpfZG1HgFkz22g4hcccgg":{"text":"The restaurant is living on it's name and not the quality of it's food. Thank goodness for","useful":0,"cool":0},"vGtLyJazJFxXjJTPGqpkvg":{"text":"My first time at this place and the food all was so good and very rich. Our oyster platter","useful":0,"cool":0},"YIeZ7MPGx_WiHWlDW5F-Hw":{"text":"Enjoyed a wonderful dinner at Arnaud's on Sunday. We liked it so much they were able to fi","useful":0,"cool":0},"54v7lYUSFoNWNE9Pszo1Qg":{"text":"Here's the situation: when you get invited to fancy brunch, you go. When David's cousin as","useful":12,"cool":9},"D_HqzOyh-UnzHXYRGLwNQA":{"text":"Arnaud's is one of my staples in New Orleans.  I always sit in the jazz cafe as I can't im","useful":0,"cool":0},"WegaRshVaRF8Di897ymQHA":{"text":"Had Father's Day jazz brunch and it was amazing. They have a pre fix menu with tons of opt","useful":0,"cool":0},"bUOrrt9hJmBUyTaxABPoOw":{"text":"TOTALLY underwhelmed by this place. From the ho-hum bread, to the overdressed, generic tas","useful":1,"cool":0},"xvHGjvesoMfO-XfVwxGkpA":{"text":"The food was wonderful, however the service was awful. The waitress we had for the evening","useful":0,"cool":0},"Jp2V8Xj0efsnem1lNWXJbw":{"text":"Disappointing experience overall.  A few good dishes, but poor service, far too crowded an","useful":0,"cool":0},"47iS1GjiSSorlCuf-LOkzw":{"text":"Classic old dining room. I was seated at a table on the far side of the room with a downwa","useful":0,"cool":0},"LM_PFDreJY2ppRm5vnY8iw":{"text":"My husband had never been to Arnaud's and I had not been in over 40 years - when I was at ","useful":0,"cool":0},"wFNKY3gJSTGyYJ3K_EoBZQ":{"text":"An absolutely lovely Sunday jazz brunch - good selection of menu items, brunch cocktails, ","useful":1,"cool":0},"ZoBduIgMjZ461on68i4tHg":{"text":"We had a rehearsal dinner at Arnaud's on 2/1/19.  It was picture perfect with great servic","useful":0,"cool":0},"YAPImHTT1GBLKM9I2KNT3Q":{"text":"For a long time establishment as popular as it is \nTonight was disappointing! \nFood is goo","useful":0,"cool":0},"-qJnEhGIKa_zpsUJ8PPuyw":{"text":"Excellent service from the bar waiting area to the dinning experience. Jordan was attentiv","useful":0,"cool":0},"Hi1UXE2_dLoxd5d798hwww":{"text":"Was truly an excellent meal.  I had the shrimp bisque for a starter was really great.  I h","useful":0,"cool":0},"XAiEjsb2kDE5i_dJIaVntA":{"text":"When I think of classic, old world, New Orleans dining, I think of grand, spacious dining ","useful":0,"cool":0},"deh2qUcTZTEfesZ8PXQjhw":{"text":"We had great service and excellent food at Arnaud's. Could not ask for more.","useful":0,"cool":0},"cVvH8yDxql5WXjIOyKPe1A":{"text":"Arnauds = our nose. \n\nLive jazz, 6 smothered special oysters, crab Karen and banana foster","useful":1,"cool":1},"_a_uqNL3HHZEvPJkxw7a0g":{"text":"@TravelNTings #TravelNTings excellent food and classic upscale service here at Arnaud's.  ","useful":1,"cool":0},"3HL1FW6w1twmW3P9DgF75A":{"text":"Atmosphere is everything!  The place is exactly what you would expect in the French Quarte","useful":0,"cool":0},"L6IKG21HP-mpcOFTSThf9g":{"text":"This was our worst dinner in New Orleans, primarily because of the service. I came in with","useful":0,"cool":0},"YJJGj3FkTqYDfcNNs-0dFA":{"text":"2 stars for food and service . The place was nice and old fashiony but the service sucks a","useful":1,"cool":0},"iwf9jdNZyqc61TBWD02xxg":{"text":"My friends and I dined at Arnaud's last Saturday, and I hate to say that the meal was just","useful":0,"cool":0},"Cr3UYYLkaPti5TYCuPA7DQ":{"text":"We were in town for a conference and the group booked Arnaud's for dinner. Great food. App","useful":0,"cool":0},"arpLpFA1R91UOQlJ4y8LrA":{"text":"Arnaud's Jazz Bistro is next door. Not very good. Mediocre oysters. Acme waaay better. Win","useful":1,"cool":0},"yCmxCxLdYNZbglSODFFYZQ":{"text":"I had Arnaud's French 75 Bar listed as a must-visit place in the French Quarter, but didn'","useful":2,"cool":1},"u2F8nPmRF5N2nMaXAdYKyA":{"text":"We came to enjoy the Easter Brunch and although the food was amazing it took over three ho","useful":0,"cool":0},"nCwxTCTXKYzUGvw2BLabBg":{"text":"THIS WAS BY FAR OUR WORST MEAL AND SERVICE OVER THE week we spent in New Orleans. The serv","useful":0,"cool":0},"Tp3kFhsR4wl2OKL2ezy1eg":{"text":"NOTE TO ARNAUD'S:\n\nToday was my fiftieth. Me and the hubs came to this historic and acclai","useful":3,"cool":0},"gy-bynj7nMH7syM3NX_XGg":{"text":"Ate at jazz bistro part; the musicians were great and personally serenaded us. French 75 c","useful":1,"cool":0},"1s-paKSsABcVkZ3RujKCNw":{"text":"We were at Arnauds for the Jazz brunch on Sunday. We were greeted and seated promptly.  Th","useful":0,"cool":0},"cCGi4Rj0KC3Z7tqG5tKSkw":{"text":"Fantastic food!  Asparagus soup, shrimp bisque, shrimp Arnaud and oyster Arnaud sampler al","useful":0,"cool":0},"K53XWRdRqC1WByx6Lld2eQ":{"text":"We ordered a $120 bottle of champagne that retails for $40.  It's a restaurant we are ok o","useful":0,"cool":0},"E7fUm0WShnyoeI2mqXtcaA":{"text":"Someone suggested this place to us and honestly....there are wayyyyy better restaurants in","useful":0,"cool":0},"eopVqeO1dqCZPJ2BGYOR6A":{"text":"Beautiful and serene atmosphere and ambiance.  Excellent and patient service from the Capt","useful":0,"cool":0},"xout06NaqAYvCG-QnNJvmg":{"text":"We went for the jazz and it was disappointing. The music was hard to hear and they took so","useful":0,"cool":0},"g3P5qouHWy7hBhGVw-YFMg":{"text":"Trip before last we gave up on Galatoire's -- bad service and only average food.  This tri","useful":0,"cool":0},"JGv3Atha5GKweg2ZiP1umg":{"text":"Finest example of amazing client service.  Walked into Arnaud's by myself on a Monday even","useful":0,"cool":0},"Jtui-a6XstkhhTq7LmFOLA":{"text":"The ambience is wonderful. Beautiful live music from extremely talented and good humored m","useful":0,"cool":0},"7naclHz2CWUE-VwrV9vy2g":{"text":"Wonderful first experience at Arnaud's!  Was it pricey? Oh, yeah. But the food, ambience a","useful":0,"cool":0},"DW3Vev5jQoinome9oI-TKQ":{"text":"The wait staff is exceptional but the food was not. We were disappointed and I really felt","useful":0,"cool":0},"t5wlisU52fOPRolox_6GTw":{"text":"On 13 NOV 2018 at approximately 2:30 PM, I went to Arnaud's and met with Mary at the reser","useful":9,"cool":4},"9pZKl1c7llHA2JjFphikAA":{"text":"Wow. I feel bad for the staff at this institution. Nice people but everything took so long","useful":0,"cool":0},"N2TBS2ahiqxvPPQQpLbltQ":{"text":"Meal for 5 was over $500 - granted, the guys I was with ordered several drinks but my food","useful":5,"cool":1},"QHAPKMAyV2YC4uSQ1Uxx7A":{"text":"Atmosphere was amazing, but the food was average. I had a better experience with bottomles","useful":0,"cool":0},"Z5l7V-Zlu-SaxZzveteXsg":{"text":"I been here a few time, mostly for company functions.  The staff has always been professio","useful":3,"cool":0},"gdsptf71KJNe197gR5QoYg":{"text":"It doesn't get more classic and old-school New Orleans than Arnaud's. You're not going to ","useful":0,"cool":0},"tMAX3LW7zuRsR554xZ68nQ":{"text":"Outstanding dining experience.  Excellent wine suggestion from one of the staff to accompa","useful":2,"cool":2},"hcqywoLZN9qnpp2n1PGhNw":{"text":"Note to self .... do not expect the normal experience during Mardi Gras that you would get","useful":1,"cool":0},"Cjv6Y3LF0cc17RWwj5rRKw":{"text":"This establishment did not live up to my expectations. The interior is elegant, but stuffy","useful":0,"cool":0},"idmYAcWpH5SFNJ6-pe24Fw":{"text":"My friends and I scheduled Arnaud's for our first night in New Orleans last week. I decide","useful":0,"cool":0},"EApbcrnKJj1mI8Lc3jZ22g":{"text":"Considering the history and location, our visit was VERY disappointing. I brought several ","useful":2,"cool":0},"qZM1mscCu8_qeYQGguLAMQ":{"text":"Came here Saturday night with friends and family, tough to get to on a Saturday night thro","useful":1,"cool":1},"DDCitni12W7Xz_sSORcawQ":{"text":"This restaurant is a prime example of trying to be \"fancy\" at the expense of actually prov","useful":0,"cool":0},"7aPJ7MJakXyw1yJmv7U6Aw":{"text":"Horrible experience. It's a beautiful restaurant overall. Don't go with 16 people in one t","useful":0,"cool":0},"fWUwR0TDf0RsHnLj0mCVmg":{"text":"Service was excellent. Food & cocktails were good.\nCafe Brulot was a highlight of our even","useful":0,"cool":1},"xtF1ISNtiHx4xT6sYJlKBw":{"text":"Once again a fabulous New Orleans meal.\n\nI had oysters Rockefeller, shrimp Arnaud, trout a","useful":5,"cool":3},"TtR4hG3AX1OILwNzn8oEKg":{"text":"Ambiance: Definitely a New Orleans classic with live jazz music every step of the way. The","useful":0,"cool":0},"ZfOu6tL3FzdaOAXGJZO7-w":{"text":"This was a high point of our visit to New Orleans. We went for Thanksgiving dinner and it ","useful":0,"cool":0},"0Cly9S1Z9kNxeuAR7VEqRQ":{"text":"Had a big reputation to live up to, and it fell a wee bit shortSo first, let me be clear t","useful":0,"cool":0},"ROUpEK7749Q__rC_loyDRA":{"text":"Pity I can't give it a zero. This restaurant is an absolute joke. We came here at 11:30am ","useful":0,"cool":0},"01glKRC38bd75HD4frgTyw":{"text":"Average food at above average prices. Being from Maryland I know my crab cakes. These were","useful":0,"cool":0},"wAWrDQcaDWDmsEp1FBJ8OA":{"text":"From the moment we entered the door, we were swept back into a time where our dining exper","useful":1,"cool":0},"Fz9aDYzeQUCVjtZVTaHYYA":{"text":"It is a lovely old place.  Lots of history.  Recommend eating at the french 75 bar.  It is","useful":0,"cool":0},"2zenjRBwsPREEtpYLfNw3g":{"text":"Beautiful interior, excellent service, memorable food. I had the Parmesan crusted red snap","useful":0,"cool":0},"c2HytHQzDWqXw1hWNAsrjA":{"text":"We went here on a Thursday night at 6. Service was on point. Cocktails, Filets, and potato","useful":0,"cool":0},"mT-QEWOP4muowGqN_WBWwg":{"text":"We ordered turtle soup, crab cake, and a three-course dinner. I was curious about the turt","useful":0,"cool":0},"cE9xvHP4rUXrHIDIZ2h4_w":{"text":"A new favorite.  We sat in the 'Jazz Bistro', with live music through the meal, excellent ","useful":0,"cool":0},"NRDQ8EfYRbzRoI6ZG5KNVg":{"text":"Sat at the bar top in the restaurant, Richelieu. It was a little more casual and you could","useful":0,"cool":0},"mv2Nt3gpThP8hma5Og4rMw":{"text":"Impeccable service, friendly staff, amazing food, and unparalleled ambiance! The shrimp bi","useful":0,"cool":0},"R3rpEh8pbEYtvvAS2jTbww":{"text":"Let me start by saying it was Lundi Gras. So my expectations of service on a busy day like","useful":0,"cool":0},"cpvCMhM1xMdSY6hJGJnlIw":{"text":"Chef Tommy Digiovanni does it again with the Coolinary Menu. Started with a very good Salm","useful":1,"cool":0},"3qifLJYPnXKD6MTV9jn8kA":{"text":"Great food, New Orleans smallest portions. Petite filet is only 5oz. A martini is smaller ","useful":1,"cool":0},"-ALBppRyjwdMKtWxHuL-yA":{"text":"Pretentious and an extra charge for attitude. Food was marginal. The servers were condesce","useful":1,"cool":0},"RaFwuDTFlWUS9Ff1xvDsBw":{"text":"The food is good, but you come here for the experience. The jazz brunch is the way to go. ","useful":0,"cool":0},"9-dRiL_odgcJa1OgIZ8h4w":{"text":"This place is gorgeous but the food is much to be desired. You can leave here feeling hung","useful":4,"cool":2},"zdYkV-NYxA3VJibBwnrwng":{"text":"Came here for the jazz brunch prix fixe menu and it was great. The live jazz music was won","useful":0,"cool":0},"bDU8vLxgd-VNIL3O-Zaumg":{"text":"We loved that Arnaud's is so huge. They have the french 75 bar, remoulade (an oyster bar),","useful":0,"cool":0},"OSXMDHq-nvDgGJv1rcyo6g":{"text":"Food was great! Was with a really large group and they accommodated us very well, even whe","useful":0,"cool":0},"Rr0wmqFAEZcx4OW-PlS2tw":{"text":"The service was almost nonexistent. \nThe food was OK; some very delicious and others just ","useful":1,"cool":0},"02bd_tYRlDyGFdwF_0PRlQ":{"text":"Perhaps I simply can't justify giving a fifth star because I struggle to recall what I ord","useful":1,"cool":0},"ddBehwIQSYQ1CgK8ppOJhA":{"text":"First time in NOLA.  Checked out this place based on reputation. Totally overhyped.  None ","useful":1,"cool":0},"gij1FqNql7ASlJNJaOecPQ":{"text":"Was in New Orleans for a girls weekend celebrating a 50th birthday. The good news , we wer","useful":0,"cool":0},"1MDDZxRjZy1uzy68Bvy16w":{"text":"Party of 4 on 4/14/19. This was during French Quarter Festival so all of the restaurants w","useful":0,"cool":0},"f3HDdYox9ojCfT8w2wUpRA":{"text":"Went for dinner, a little while back, but enjoyed it. Good wine list, good 'Creole & Ameri","useful":0,"cool":0},"q8E9mkxGtZ5X2z3bYmg2KQ":{"text":"Despite being a very established and famous (aka concern about being touristy ) and large ","useful":0,"cool":0},"AAgSToximu8uNZj2OTSYhw":{"text":"During my trip we wanted one night of fancy-ness. Arnauds is located in the heart of the h","useful":3,"cool":1},"nrSbPjGv2Eqsxg3ccOIJMw":{"text":"This restaurants would have been better had we had Johnnie as our waiter. We had a blonde ","useful":1,"cool":0},"piuzFk-vwuXNN5ZKHw_aNg":{"text":"Omg is all I can really say. Had the wait a little whole but the bar area was like an old ","useful":0,"cool":0},"g19ZZm0QKGlCtA4QDHPMrw":{"text":"Had an amazing night with my lady here! \n\nService was amazing, dang near bordering on over","useful":1,"cool":0},"HHoEN1WuhunG6-a5uCBNug":{"text":"We recently had dinner in the jazz bar. From the hostess stand to the jazz trio we could n","useful":0,"cool":0},"OJPj8IoqynI72dyvtqDKkw":{"text":"Upscale historic restaurant that is heaven on earth. Staff is very professional and never ","useful":0,"cool":0},"UBTHoTxiiGlrR0pQT2WoYw":{"text":"This is definitely in my top 5 places in town for any meal, certainly for special occasion","useful":1,"cool":0},"TJJ0mQRmymk6LaI9S_4xgg":{"text":"Classic Louisiana fare.\n\nBottom line: Good food, noisy atmosphere, okay service, and old w","useful":0,"cool":0},"EIulJFb9NY_mLXX5AnYb6w":{"text":"I love New Orleans, I can't get enough of it. I love the French Quarter, the drinks, the m","useful":0,"cool":0},"2nheuxYe1OIdVJiiCStUNA":{"text":"Everything from appetizer to dessert was fantastic! Highly recommend. I had the smoked pom","useful":0,"cool":0},"UchlOn0xw_UvIVCScPvkPQ":{"text":"I was here for DDW and a pharmaceutical group was sponsoring the dinner so I got to eat he","useful":1,"cool":0},"ossbooctbG1za7NtP8xu-A":{"text":"On the recommendation of a friend my friend and I had dinner at Arnaud's Jazz Bistro.  Thi","useful":0,"cool":0},"rugwVGVUGW32Er-aAeHO5w":{"text":"The best meal of our anniversary visit to New Orleans. \n\nYes, people married 42 years stil","useful":3,"cool":3},"9ribJyEpDhXib6vLB6XjzA":{"text":"Due to COVID they are spacing the place out so we were seated at the bar. It was perfect s","useful":1,"cool":0},"O6oYXJB6vWqfimT82JSJYA":{"text":"This restaurant has a pretty big double standard to be a high end locality. We made the mi","useful":1,"cool":0},"i7RSNlenx_C1waC8s629Ww":{"text":"I live here. Have for a long time but Arnaud's is one of those New Orleans institutions I ","useful":3,"cool":0},"rCzfaXig57ZyJ6PUHIzg0Q":{"text":"Went over the Christmas holidays for brunch with about 12 girlfriends. We had a great time","useful":1,"cool":1},"sOKmDLsbSnY42UYw1EGpdA":{"text":"The very first time that I visited NOLA was when I was in college. My professor's husband ","useful":0,"cool":0},"mKc2kkYfV4ac4jt39WEnbQ":{"text":"1st wedding anniversary dinner with my wife. Arnaud's treats you like family and royalty a","useful":0,"cool":0},"_rDaA679ZmIEG4akifYETw":{"text":"Delicious food, wonderful ambiance and wonderful staff. Arnaud's has been around for years","useful":0,"cool":0},"a3CrKJdEsVlBeK8W3HxkGA":{"text":"This place is a historic landmark and has fantastic food and service. How does this not ha","useful":11,"cool":7},"zVeH22MaV5MIo7hEqKvSCQ":{"text":"An okay spot. We were really excited upon seeing the menu, but the food was just okay. \n\nF","useful":2,"cool":1},"lrVzUswFqlov3m5cQcrsug":{"text":"How can I start ? We went to Arnaud's a week before Mardi Gras  in 2020in order to celebra","useful":1,"cool":0},"lGBvB0eXjeuQrQKAa7aSdg":{"text":"This restaurant convinced us that old legendary French Quarter restaurants are just restin","useful":5,"cool":1},"iI0md6h5-gQbhqu91dYGzA":{"text":"WE'RE HERE AT WORLD FAMOUS ARNAUD'S: the old TV ad opened; it still charms;\nDIXIELAND JAZZ","useful":8,"cool":3},"C1Qq8G6Ca52Qx_fDq5Ze6A":{"text":"I wish I could give Arnaud's 6 stars, 10 even! I can't begin explain the wonderful experie","useful":1,"cool":0},"a4x592t0SRQOIK9J3-r3wQ":{"text":"Such a classic, classy restaurant with so much history. You will feel transported back in ","useful":0,"cool":0},"IsVd9YcHrvurTOdmYD07wA":{"text":"Superb! I went for jazz brunch and the food was amazing, of course. I had the 4 course pri","useful":1,"cool":0},"A_mKAAiOLFPVs-ImoyrnIA":{"text":"I had the privilege to dine at one of Arnaud's luncheon's for Valentine's Day. Normally, A","useful":0,"cool":3},"BzpACpY542VqDjsUDPq-oA":{"text":"I enjoyed brunch at Arnaud's for their annual Valentine Gras. What a classic New Orleans r","useful":4,"cool":2},"aLjsB3OqpRvqJlIPfGwSTw":{"text":"2/15/2020 Arnaud's JAZZ BISTRO: nothing more than the back room corner section of the rest","useful":0,"cool":0},"SJ8HdNFPjXAFQdYJlDyYLg":{"text":"They refused to serve my husband, a Nigerian man wearing Nigerian formal dress. He was dre","useful":0,"cool":0},"dehPbd83fBIlMtNZsiyRiA":{"text":"I would give this place 3.5 stars. \nThis is a traditional, old time atmosphere restaurant ","useful":0,"cool":0},"igvVdEAbI-UCWg5BW6Zs5Q":{"text":"Tourist trap.\nMimosa cocktail so acidic that you can use it as paint stripper.\nDining room","useful":0,"cool":0},"dMQVXu7KcWfexjyh2NjuOg":{"text":"Stopped in for our 40th Anniversary and had a great meal, as noted in every other review. ","useful":0,"cool":0},"DQlz8UCt2lqAs_pk1JlPQQ":{"text":"Arnuad's restaurant was actually our second choice, but our first choice (the oldest resta","useful":0,"cool":1},"J8HLgvvvJE6rs_CxQc6NHQ":{"text":"We were visiting New Orleans and decided to come to Arnaud's for Jazz Brunch. The restaura","useful":1,"cool":0},"l3TaAcLibRGAVwCm04zvOA":{"text":"I'd like to give Arnaud's a 2.5.  \nIf you want to feel like you're in a special place, for","useful":0,"cool":0},"DJhv1GTmHCPOftshWQfUQg":{"text":"Absolute perfection. I ate there with friends on 5/12;the food was amazing. I had the Craw","useful":1,"cool":0},"IqyFeVnPITJ5DX2zDnuBdQ":{"text":"I had a wonderfully luxe lunch here for Valentine's Gras with some fellow Yelpers!\n\nValent","useful":4,"cool":2},"CW__xFVUTIEBY1ybFuvpFw":{"text":"The restaurant is historic! I enjoyed the atmosphere and had dinner with clients and colle","useful":1,"cool":2},"tvCsS9euDn-nqiDGjI38Vw":{"text":"Ok, we didn't have reservations, in fact, we didn't even know where we planned to eat that","useful":0,"cool":0},"7rTYEfryCFhrerF6PkUBVQ":{"text":"Went there for brunch, and the food was very delicious along with top notch service.  The ","useful":1,"cool":0},"vrpUGgo25CgHI9kqPl6kCw":{"text":"Atmosphere in main dining room is loud and far from intimate.  Steaks are tender and can b","useful":0,"cool":0},"v2W2KT2txEON_zzrGVlCGQ":{"text":"This was the best meal I had in NOLA. The shrimp remoulade was delightful. The filet was d","useful":1,"cool":0},"UdgX1ahrMjAn66RNnDWiyw":{"text":"Go for the experience, not really the food. \n\nJazz Brunch on Sunday is everything!  It is ","useful":0,"cool":0},"bScJMphAGnfC5wzEtVMnGA":{"text":"Arnaud's is definitely an awesome experience!   Dress nice because the place deserves it -","useful":0,"cool":0},"yyON2zzEzmBbisLD0b9hEA":{"text":"New Orleans has plenty of fine cuisine along with colorful personalities, but not everyone","useful":6,"cool":2},"2B_3UAp7ODLyK60qP47khA":{"text":"We love New Orleans and have been many times; there is a plethora of good food but Arnaud'","useful":1,"cool":1},"AyQjZmwH4uA9tDPD7L_IKw":{"text":"Attentive service, lovely ambiance. The food was fine but I absolutely loved the Bananas F","useful":1,"cool":0},"hrwml1ZthxpW6kNeGrxbEg":{"text":"We did not have a good experience here. We got there for an 8:30 reservation and they brou","useful":0,"cool":0},"8gZ5DtWOpywOyhOmGcDUmQ":{"text":"Just average last night-very disappointing. Cold turtle soup. Cold dried out pompano Duart","useful":0,"cool":0},"oO1em5O6svk07vX-hjEF9g":{"text":"Sad to say, this was a bit of a disappointment. I don't mean service-wise or atmosphere, t","useful":2,"cool":1},"5fjkgrBut2noL6sul6bEDQ":{"text":"We wanted to love this place, but unfortunately it feel super short. We ate here on a Thur","useful":1,"cool":0},"ZdclcqKtrwq393e2nUHkOw":{"text":"Finally made it to Arnaud's on this latest trip to NOLA. It was a work venture so I never ","useful":2,"cool":0},"U25A6HolvRaHwKbe5aN3EQ":{"text":"Ahhhhhhhhh what a joyous time we had at Arnaud's for VALENTINE GRAS!!!! \n\nAnd all we neede","useful":6,"cool":5},"twzPl4uOT91eXAG-FIHdWQ":{"text":"My parents treated me to my 21st birthday brunch here a couple of years ago.  It was great","useful":1,"cool":1},"YHF4v_8FvGrQaCjRW6Mznw":{"text":"Arnaud's is a New Orleans classic. It is located in the heart of the French Quarter, and t","useful":5,"cool":4},"ynB-iwyQMAjOG36qQjus2A":{"text":"Arnuad's has several rooms connected together along one block.    We made a reservation at","useful":0,"cool":0},"sa-4sxRcs8cSvuWh2k-PZQ":{"text":"Tried the tasting menu tonight. Everything was excellent!  \n\nhttps://blainerestaurantrepor","useful":0,"cool":0},"VX9Gmg4CbIZ5ZSBAsIogkg":{"text":"I wish we had read the more recent reviews before coming here tonight.  We are in town for","useful":3,"cool":2},"VBdPeCDH_-cvtT_-hpSOxw":{"text":"I live in New Orleans and for the first time last night went to Arnaud's because a good fr","useful":0,"cool":0},"H-yWM0KlyDnMtt4dwQYnzQ":{"text":"Out of all the food places we went to, this place was the least satisfactory. Everything a","useful":0,"cool":0},"Ln9GiRNKrlGw9hfQG2zBzA":{"text":"I had an excellent meal at Arnaud's. It is an old school New Orleans institution, and it c","useful":0,"cool":0},"Iqqpta__oWcFSH9Rb78JBA":{"text":"I went for a jazz brunch which has a 4 course meal. I loved the entertainment with the jaz","useful":0,"cool":0},"tSc3Q0ihOylkxxifRR2x5g":{"text":"We did the tasting menu! Everything was excellent from the food to the service! It was a l","useful":0,"cool":0},"MJYdyRrMpbj6GjK9lVk64A":{"text":"A Classic Creole New Orleans establishment!!!  I love Arnaud's food and atmosphere and I A","useful":6,"cool":2},"SbKA0JMZ4jEhEMD3Dv_yrw":{"text":"Absolutely fantastic restaurant. Wonderfully intimate with a nice atmosphere, live music a","useful":2,"cool":2},"5a2D0cUXtW55G4U1ElYeRA":{"text":"This was our first time ever at Arnaud's for dinner and I have very mixed feelings about i","useful":1,"cool":0},"Gf2-2uA0jFhUgJ3eEFW8xQ":{"text":"Just average last night-very disappointing. Cold turtle soup. Cold dried out pompano Duart","useful":0,"cool":0},"urVZXWHipC7F0hC0ghgw3w":{"text":"This place sucks, don't bother.  So many better options in Nola.  Mediocre food and servic","useful":1,"cool":0},"j2UVi4VSJZKYkV2jyuSZVg":{"text":"Went to Arnaud's on my last night in New Orleans, so we wanted to go out with a bang!  Exp","useful":0,"cool":1},"E1RfSAxiUY3DGyyH-4HT3A":{"text":"Having dinner at Arnaud's has been on my bucket list. I've had a drink the adjacent French","useful":14,"cool":12},"47jrMvvmCYcdaR4iyCzJZw":{"text":"Wow. Amazing food. \n\nWe went to Arnaud's for their Sunday Jazz Brunch. The menu is unique ","useful":5,"cool":5},"8Rpp22AsJuA1AZKhgumNyw":{"text":"Five stars for Sunday jazz brunch. The service is so nice and smooth. The brunch includes ","useful":1,"cool":0},"ySRf01UULvXnJCDZ4NsJHw":{"text":"This was a good taste of classic New Orleans cooking. I had the Shrimp Arnaud's and the Fi","useful":3,"cool":0},"OG2L13BfbgciFzn6AOKkyg":{"text":"Nope. \n\nThe short story: the main dining room is incredibly loud, no hope of conversation.","useful":1,"cool":0},"WoFcSxQg1qA0cgIKrZ_GJQ":{"text":"hands down the best turtle soup in the french quarter. 3 days every day , cant get enough ","useful":0,"cool":0},"bAxlB68ibxl_1ftpxO_laQ":{"text":"Food was delicious, service abominable.  Granted, once I told the maitre d I never saw the","useful":0,"cool":0},"VQD6arWKrY4LhlB4IHvhHA":{"text":"Stopped by for drinks and a light Friday evening dinner while at a business conference on ","useful":1,"cool":0},"6a-gCRvIotqvTtiu9inMdA":{"text":"large restaurant, another restored institution with great service and another ok meal.  ha","useful":1,"cool":3},"bOLpsPr12BkYkyokM4dX2g":{"text":"Made a reservation for July 28, to celebrate my wife's birthday and our first trip to NewO","useful":0,"cool":0},"qDV0USYt0jye2qDj_tTLBg":{"text":"Top end French Quarter dining, as good as it gets.\n\nIf you're going to drink and party awa","useful":2,"cool":0},"cEapLEtrI-R_J3bzabSfug":{"text":"Recently had dinner at Arnaud's. We loved this beautiful, traditional New Orleans gem. The","useful":1,"cool":2},"74nCf-0_yQErDF0tEXXaUg":{"text":"So good & beautiful.  Everything was wonderful.  Great location.  Beautiful atmosphere","useful":1,"cool":0},"aBStI4zTDAc5ns2JFkIT4w":{"text":"We were so looking forward to dining in this town but were immensely disappointed by the f","useful":0,"cool":0},"szV2Z3s0yNHfX2bINjul2A":{"text":"I place to visit over and over. The essence of elegant New Orleans. Jazz brunch is great. ","useful":0,"cool":0},"Am0ZwObNB40bZN1dq4-Uwg":{"text":"Was a little concerned initially with the location being on the corner of Bourbon Street b","useful":0,"cool":0},"8UiWVkYCg-RtiDfrKNLetw":{"text":"This will be the most memorable meal during my last visit to NOLA. Every part of my meal w","useful":1,"cool":1},"8U2jI8QXvPUbLiQId2kcVA":{"text":"Terrible! I felt like I fell into a tourist trap. Don't go here unless you enjoy ordinary,","useful":0,"cool":0},"Ce96yiSeR5vKgWIgaunn-Q":{"text":"DO NOT GO HERE YOU WILL BE HIGHLY DISAPPOINTED. Over priced, under portioned, as well as l","useful":3,"cool":0},"jEvtKpztRPeBOu8Ccuw4Dw":{"text":"We came to New Orleans for our honey moon and made a point of coming to Arnaud's \n\nThe sta","useful":0,"cool":0},"Se6P3YhdWhfrmCHDcjEqQQ":{"text":"This review is for the Jazz Bistro. Hands down best experience in New Orleans.  Our server","useful":0,"cool":0},"qFYpuuWOzjD_091CeQixPA":{"text":"Well, what can I say?  Yelp let me down.  I steered my group here based on the excellent r","useful":4,"cool":2},"_rSIWVh3fl_cxHP1YOSOLw":{"text":"So this was my first time doing Jazz Brunch at Arnaud's.  I did the 3 course with Shrimp A","useful":3,"cool":1},"GnwNcXwvlZ8a2guonud9LQ":{"text":"Eeek! I'm really behind on reviews. It's February & I'm still writing about NYE. It's time","useful":3,"cool":2},"gGUQe3pAyWHvuHwl3h5VRQ":{"text":"During my anniversary weeklong visit and not being able to get into brassards or Brennan's","useful":0,"cool":0},"O5m5uA2jLyd2VP9Co_FWNA":{"text":"New Orleans is known for its rich culture and historic lineage of family restaurants. Arna","useful":0,"cool":0},"tGhDHl_KavSlGkUk_EuT0A":{"text":"On our last visit to NOLA, we were forced into Arnaud's on a double date! Ok, fine! Being ","useful":9,"cool":5},"epeEfcYBF84kb2bu0ahrfA":{"text":"Love this restaurant!  Eaten there many times and is constantly excellent.  A NOLA must!","useful":0,"cool":0},"9jJsByLHG4ty4atzKm3JWw":{"text":"My group had a small sit-down celebration here recently.  We had a large room and the roun","useful":0,"cool":0},"Mj09x3zZnJtp-Rw6JDpuYA":{"text":"We had a lovely jazz brunch.  My only comment would be that I might request being seated a","useful":0,"cool":0},"AdLJxy2Av501K4csZl-W6A":{"text":"A Sunday brunch is a must on any trip to New Orleans.  The music was perfect, the service ","useful":0,"cool":0},"5DXeSclsCqCb-XaeDtqtrw":{"text":"Waiter?  Excusez-moi, s'il vous plait?  Anyone?  \n\nOK, maybe since it was Ash Wednesday, I","useful":3,"cool":2},"mXFOTeTHw0Ep4s-1xIOp9Q":{"text":"This restaurant is definitely over priced for the food they serve.  I don't mind paying fo","useful":0,"cool":0},"8UppPc0I8FDn4-pH9fdQBQ":{"text":"I visited this restaurant with a couple of friends because it came highly recommended. Unf","useful":1,"cool":0},"HNt2_1PFlaViGjO37t6sNA":{"text":"In a word, we were underwhelmed.  We had high hopes for this French Quarter institution.  ","useful":1,"cool":1},"0jkiHVjcVAOi1BhX8qrvzA":{"text":"We really enjoyed Arnaud's. The menu is a la carte. We got the shrimp for an appetizer. Be","useful":0,"cool":0},"hJ5Xzv_fEZn3KohbzYgnCw":{"text":"Wow! What a memorable evening. The dining room was decorated festively for the holidays. T","useful":0,"cool":0},"2DDQu-6OOrhLZexzb1A4oQ":{"text":"First time in NOLA - we had to try a traditional French, Creole restaurant. To start, we h","useful":0,"cool":0},"Nn6qmdwADMbHLg6g1JHawQ":{"text":"On a 90 degree day I had the gall to walk into this restaurant (mere feet from bourbon st.","useful":0,"cool":0},"NcBM9mJxaEjryN8STJi4Wg":{"text":"The service, food, EVERYTHING is always perfect! You're guaranteed to be treated right her","useful":2,"cool":0},"mGJrzDipz9bkCQx7POs1Jg":{"text":"Had a very enjoyable Reveillon dinner with friends at Arnaud's last night.  Love the histo","useful":1,"cool":1},"KpXfT0T15A3Xaph57zRexw":{"text":"Was a meal for two worth $170? Hard to say - but we definitely enjoyed our experience here","useful":4,"cool":5},"Q3nRK_J7dP-zTUDr1I4v6g":{"text":"I have eaten here two times and both experiences were incredible. \n\nThe first visit was a ","useful":2,"cool":2},"yV1hF7iLcOEYWri2SDJfFQ":{"text":"AMAZING!!!!! Went here for our anniversary and Mo was an absolute gem of a waitress. Very ","useful":1,"cool":0},"D7f6MbCAIKy8n_JaOeAUjA":{"text":"Excellent and gracious wait staff, jazz group, ambiance, white tablecloths, oil lamp candl","useful":0,"cool":0},"HNVI6fPEagtOwdCQrwMtww":{"text":"First stop in New Orleans right off the plane to partake in Arnaud's famed Sunday Jazz Bru","useful":0,"cool":0},"6uwBktRigaIzA_9OTP6EiA":{"text":"Came in town on business and wanted to sample authentic creole cuisine. Put in my reservat","useful":0,"cool":0},"sMvAsmB1yQsQFY8LDzexCQ":{"text":"There were a couple places in New Orleans that we were like..oh yeah..THAT place! And then","useful":0,"cool":1},"CWRf5_QYWvufJFNAKgO-VA":{"text":"So much tradition and the food is lovely.  I had the frog legs and turtle soup. We always ","useful":1,"cool":0},"475miYKO57UbEdV6GDk2jA":{"text":"Arnaud's is all about history and Southern gentility and servers flaming Bananas Foster ta","useful":0,"cool":0},"Pd0_MjukC8_kzjzfPm0JGw":{"text":"JAZZ BRUNCH! 4 dishes (appetizer, salad, entree and a dessert) for the price of your entre","useful":1,"cool":1},"iRIthDjNEPWfEZhblV6Ckw":{"text":"I came here with 4 friends on a Friday night in September, we made a reservation but it wa","useful":1,"cool":2},"uMCDsH7PjPDPclBQZT-lHw":{"text":"Excellent Creole food in historic restaurant.\n\nI was in New Orleans for a work conference ","useful":2,"cool":0},"U6dG_AZy1CvghCjQo9dQJw":{"text":"We arrived at the restaurant to find that they had only wooden cane back chairs in the din","useful":1,"cool":0},"LYIQfVcfGKWj_tEXCUht4Q":{"text":"Good food, beautiful atmosphere! \n\nI came here for the jazz brunch, and their four course ","useful":1,"cool":2},"QyK4v7cfSM6P5XHhVa0w8Q":{"text":"Dear Arnaud's,\n\nI apologize for giving my other reviews 5 stars. After eating here, you ar","useful":0,"cool":0},"bzpLKkHaHNs9Qvr-rFFYoQ":{"text":"Each year my CEO brings the management team to Arnaud's for a special Christmas dinner. We","useful":21,"cool":16},"c2ijmCV-2XzLKo5MwbXckA":{"text":"What an awful place to work. Augee the GM passed everyone up for job promotions. Lied to u","useful":3,"cool":0},"Zb1t6f1KbYD6RS0DIzpksg":{"text":"Arnaud's was more than a restaurant. It was an expirience. I had the frog legs as well as ","useful":1,"cool":0},"lb72MkK_PDWFXbsW5vY1OQ":{"text":"I cannot honestly vouch for the food because I have not eaten there. I can however vouch f","useful":2,"cool":0},"j8VLkuYkKAk4X-l5cIvoUA":{"text":"Went to the Jazz Bistro for dinner last night, and I usually don't rate restaurants. Last ","useful":1,"cool":0},"wXn9hkRIBkrtL7ORbRRWjQ":{"text":"I am mostly reviewing this as a place to hold an event as when I was there I was there for","useful":4,"cool":2},"NjQtpHTqQ_jdKUz4iWF1pA":{"text":"I'm a tour guide in New Orleans and so I don't make enough money to enjoy the really fine ","useful":0,"cool":1},"ZCPd3yQ8CSoFjcAbOi7h_A":{"text":"Arnaud's gets the dubious honor of being the first restaurant I've given one star in my 5 ","useful":1,"cool":0},"H5G67uNbRB0GHqxqRBbw4g":{"text":"Had such a good time listening to the Gumbo Trio and eating the wonderful food at the Jazz","useful":2,"cool":0},"dbGJixorBJT91-5ZiatQEA":{"text":"dined at the Jazz Bistro on a Friday night. First of all, the only difference between the ","useful":1,"cool":0},"qjRb3_QtXIFhsr5iwsY8Gw":{"text":"Came here for a wedding rehearsal dinner. It's a large, maze-like venue that is a combinat","useful":3,"cool":3},"ocw7Q9CcCd5_4985k7cGxw":{"text":"The first thing you need to know is that anything you order for your meal is going to be g","useful":2,"cool":0},"hQVxbQEUEanyD6ZrZv7TXQ":{"text":"This is a historic, upscale Cajun restaurant in New Orleans that's been appreciated by loc","useful":4,"cool":3},"bj6o9O54qfEtnu3X_oabYw":{"text":"Well one thing for sure is yelpers are usually pretty accurate in a big city.   This place","useful":1,"cool":0},"0132TAk7sojHC74A_s4Few":{"text":"listen up new orleans...\nif this is what fine dining is in your city...well, i just don't ","useful":3,"cool":3},"TamcquKbZF0cs2_DwV1Rcw":{"text":"Very special place to spend an evening with someone special! \nOysters, fresh bread, puffed","useful":0,"cool":1},"ArxXnftiGtIa6wNtlj5j8g":{"text":"A classic.  We did Sunday Jazz brunch and it was great.  \n\nAmbiance: 5/5 fun lively\nFlavor","useful":0,"cool":0},"3XKj44K6r_YYPpnPNMzEsg":{"text":"For the record, I never do negative reviews like this. But, our experience was *so bad* th","useful":13,"cool":2},"gZ7yDO3PafbpNUL6DheNLg":{"text":"A staple in our beautiful city. Arnaud's is unique that they not only host a mardi gras mu","useful":18,"cool":14}}