{"oNk3_PEhC7PtiUso4JJ3NQ":{"text":"So it's a place that I've always wanted to try and I got a chance to try during for Mardi ","useful":0,"cool":0},"gZOH4NLhBZo9-H_S5MFRaQ":{"text":"I LOVE Dogs and these are terrific, in all their permutations. I had a Dat Chick that was ","useful":0,"cool":0},"R94siYBugg8u3jV9FbPl8Q":{"text":"I'm a sucker for a hot dog joint and this place did not disappoint.  We went the Saturday ","useful":0,"cool":0},"8o1Dh3PGnDYAWJt0998n2A":{"text":"It was the only place available to eat in New Orleans for a group of 6 during prime time o","useful":0,"cool":0},"XAt7aGT7_OZzEomNHSNOeQ":{"text":"I got the Spicy Chipotle Veggie Dog, I asked the girl at the register what she thought abo","useful":0,"cool":0},"YeSqvxsIsIkmkmtMWDvUeg":{"text":"Best hot dog ever!! I had the crawfish dog dressed with chipotle mayo, mustard, ketchup, a","useful":0,"cool":0},"wcGmJ3dohWvSlYjfu-KXiQ":{"text":"Cheap food in one of the most emblematic street in New Orleans (while mostly jazz clubs ar","useful":0,"cool":0},"HbFPQ3mkEXe014S_JEx7UQ":{"text":"Came to this place due to rave reviews. The table was filthy and full of sticky dirt. The ","useful":0,"cool":0},"dedj_bXvABtNTqUdmidltg":{"text":"Zach was such an awesome bartender! He def made sure we had a great time--it was my friend","useful":0,"cool":0},"uiHUZb9kBj_nBBMOq9ivmg":{"text":"We came by on recommendation from friends who recently visited. The hot dogs weren't bad, ","useful":0,"cool":0},"9a8SM6Kgu5GMXWIkNB_jcQ":{"text":"I enjoyed the service and food here. While we were waiting for the jazz band to play at th","useful":0,"cool":0},"i6O6RFo7Wjz4gkmkLq3CIQ":{"text":"There are three locations for Dat Dog and this was my first visit to the Frenchman street ","useful":1,"cool":1},"igBtln9ZxFnOtUeTPSuuzA":{"text":"I've been to one on Feret and the hot dog was huge. I was disappointed when I opened my co","useful":1,"cool":2},"9lb1vKg9v-JcUbDb3q40KA":{"text":"I don't even know where to begin with this place. I've been going to Dat Dog since it was ","useful":0,"cool":0},"Fit8XUfcRI_AycnSyroR6g":{"text":"We went here three times during our visit Wednesday-Sunday. \n\nOur first visit gets a five ","useful":0,"cool":0},"quY42nK56bMkdr0DhZX5hg":{"text":"The best fries I've EVER had! I got the seasoned fries and drizzled the with ketchup and L","useful":0,"cool":0},"RvsMcefXBNG-BmWKJv-yEw":{"text":"OOOOMYYYY, what amazing hot dogs\n\nI didnt care to get one (only bc on vaca) bc im a New Yo","useful":0,"cool":0},"914fltXqKE07l4b2TwwEKA":{"text":"Duck dog is awsome... our bartender hans was even better great recommendations and quite h","useful":0,"cool":0},"leIkfIodOe-G17i3XbNozA":{"text":"Ask for Hans, he makes the experience! Get the DUCK dog!!! Absolutely to die for! The craw","useful":0,"cool":0},"aPzkxK_ep9osi0TGhJ9M_Q":{"text":"This place was a dump. Basically a bar that serves hot dogs. Music was blaring and the pla","useful":0,"cool":0},"eJ993tWcDJWgtbAsreIonA":{"text":"You got to build your own Hotdog!! The selection for toppings were vast and their \"off the","useful":0,"cool":0},"ae4ddNzG5D22kRc4UdUBIg":{"text":"Great location on Frenchmen street. There were for of us we ordered three duck special, ga","useful":0,"cool":0},"AiVzH9gAxkNXBrJCg9WvVA":{"text":"Had the chef's special Alligator dog and regular fries...AMAZING! Everything was fresh, th","useful":0,"cool":0},"ONOVE1Otr5oJsW0jwvxH-g":{"text":"Came here with J and K before heading out to 3090 to watch some bands and Blue Nile to see","useful":0,"cool":0},"6xzMaqw5GLzff44eKQcWGA":{"text":"Super disappointed in this place. Easily the worst $60 dinner for my family I've spent in ","useful":0,"cool":0},"4nr284cip3HRlr8OtS-W5w":{"text":"Delicious! This place is one of a kind. When you're tired of eating the same old thing, he","useful":0,"cool":0},"e9Af8d6T2WuF3IRz2d08Bg":{"text":"Well I have been to Dat Dog on magazine multiple times and have loved it. Dat dog also has","useful":0,"cool":0},"MkBH4X2t6MsjZ3lryIUciA":{"text":"This is truly an amazing place.  Food was good, drinks were good but above it all, my grou","useful":0,"cool":1},"RPTfDr2qSFUYM7JQmmhgoA":{"text":"I'm not a big fan of hot dogs but I like this place because it's unique, local, artsy and ","useful":1,"cool":1},"6w-YhwdSr01Sw0ycjwQCTw":{"text":"Lunch here was ok as we got the crawfish etouffee dogs. They were pretty good and surely r","useful":0,"cool":0},"XSfP6affSdOC9yPjyZjRWg":{"text":"Got the étouffée dog. There wasn't very much étouffée and the crawfish dog was a bit dry. ","useful":0,"cool":0},"fe-bA7zAyKDv_xhzfp5OoQ":{"text":"Great location and pretty good food after a night on Frenchmen Street.  They have some ver","useful":1,"cool":1},"I9WOh78_VY6e8pFTRAz1cQ":{"text":"I can't believe we ate a hotdog on vacation, but we were starving and needing food. We got","useful":0,"cool":0},"zt8zFMCyN3i1RSbPn_73zA":{"text":"Cold food, rude bartender, customers shooting drugs right outside the Window  on the stree","useful":0,"cool":0},"v6oIcRnLknEYiyVfCKxICw":{"text":"Super cool little place in the back cuts of the French quarter. Easy to walk to. Service w","useful":0,"cool":0},"37wi7ECGGsuBeYKKh_0qiA":{"text":"This meal was a blurry one, as it was pretty late into the festivities, but it says  a lot","useful":0,"cool":0},"ajSYSfZldzsd9UESXYIgKw":{"text":"I'm from out of town and this place was great. Our order was messed up and it never got st","useful":0,"cool":0},"p4QWHxaNM8QboyotcV6yzQ":{"text":"If you like hot dogs, this is hot dog heaven! Every kind of sausage you can imagine (and e","useful":0,"cool":1},"HIbVXSXaP4lPXvJzluhQSw":{"text":"Great location, balcony was a perfect view. The food was kind of bleh. Waitress was sweet ","useful":0,"cool":0},"cRSGN0UrCDDcbJLgtMS82g":{"text":"Random walk in here for us but surprisingly this place had some of the most amazing hot do","useful":0,"cool":0},"npUkhPZlu5fO1zK4zIyp7Q":{"text":"White Trash fries are everything one could want either before, mid way through, or after a","useful":2,"cool":0},"NpSpKulyrR7U1MWi-1VhpA":{"text":"I really enjoyed my first meal in New Orleans here at Dat Dog! The space was lively and fu","useful":0,"cool":0},"TBhS9ugtnF2XxEVW_y4abg":{"text":"This place was pretty good. I had the spicy chipotle veggie dog with cheddar cheese and sa","useful":0,"cool":0},"l0Vm3IkOIl7pSGQvAjZJaA":{"text":"Great place for a late night meal with friends. it was a little weird that I had to place ","useful":0,"cool":0},"U5MT2_vpi5DdOoyG96dAAw":{"text":"I was overcharged 83$ on my credit card for 1 hot dog & 2 drinks.  Upon returning home fro","useful":0,"cool":0},"hWzvsJ8fnBG5QXUrRepmdQ":{"text":"Honestly, the food is awesome. But I had the most fun with the bartenders, Alexander and N","useful":0,"cool":0},"pJcgpje_s9bceIv32CSHBw":{"text":"Really good food!  Nothing super fancy but definitely hit the spot.  You choose your sausa","useful":0,"cool":0},"4ToaYHo-woNweqGLyTCQpg":{"text":"Fun hipster place on Frenchmen Street! We had nice local beers, local \"Louisiana hot sausa","useful":0,"cool":0},"I0rXcrjE09Dt0wc3RfABPw":{"text":"the server's knowledge of what was actually in the sausage was really good. Be mindful tha","useful":0,"cool":0},"RU9FuvjmQbZcBBAXji_5PA":{"text":"Highly disappointed in this place and it's sad because I love the one on magazine st!\n\nFir","useful":0,"cool":0},"9DK5Emh-gtlNdwGgeehkQQ":{"text":"Frenchmen street - Amazing live music and Dat Dog will now go together hand in hand for me","useful":0,"cool":0},"Nm9J6AJ1JSE_bCQyo1BHig":{"text":"Delicious food, absolutely delicious!! Get the duck special and the loaded fries. Friendly","useful":0,"cool":0},"aocm7xbowyOybXTE_Z0Cxg":{"text":"I found it to be horrible.  The bun was double size of the dog.  Just didn't care for the ","useful":2,"cool":0},"4ajPf8Ig5H54-u1NRQUbHg":{"text":"Just ok. Nothing to rave about. Staff was very nice. Table was sticky and it too too long ","useful":0,"cool":0},"XypbJRzkYlMfg1WUwnvFzw":{"text":"I have been to other locations of Dat Dog and was happy to find one on Frenchman.  Loved t","useful":1,"cool":0},"755ZzHCu9vhHNF8-wzUjnw":{"text":"Don't let the casual atmosphere fool you. It was a quiet Sunday afternoon and Dillon made ","useful":0,"cool":0},"LG-HQY3HOVdi_M_vamNMhA":{"text":"Come here for a specialty dog, duck or rhe turducken. I personally loved the duck special!","useful":0,"cool":0},"S6lI_u_Xa8885z4B_06dEw":{"text":"My SO got Dat Dog during a recent trip to New Orleans.  We were there on a Thursday at 9pm","useful":2,"cool":2},"Lne0xdAe_fqN27Qdl8lijg":{"text":"If you want a hot dog, this is where you should go. Of course, they are still just hot dog","useful":0,"cool":0},"ESZHqS5-_5821J5EZbazSQ":{"text":"I had a bite of a couple of the different dogs and they were all kinds of awesome.  (I had","useful":0,"cool":0},"jWjM_8oUXQbWpGgpiLsnIg":{"text":"Very eclectic place to enjoy your hot dog. They have many different hot dogs to choose fro","useful":0,"cool":0},"Mxryvq_DW6c8ytixQLuwsw":{"text":"Delicious! Great view and super quick order! Get a spot on the balcony. You won't be disap","useful":0,"cool":0},"Oj2UfLZDSfZ4obdo8GeDeg":{"text":"My Vegan Review: Stopped by one night and had their Vegan Sausage  Its was really good. Th","useful":1,"cool":0},"MB3mDJJympD6qtgtLQR5ng":{"text":"I wish a Dat Dog could be in Los Angeles! This place is awesome and the food is absolutely","useful":0,"cool":0},"W1PbZk0XycnmcCv98pe6mQ":{"text":"Awesome great fun place with amazing dogs and beer! Loved this place. The atmosphere is su","useful":0,"cool":0},"dok6WSbP4LsFs5XwtnXo0Q":{"text":"Yessss... they serve Field Roast vegan dogs--my favorite brand! You get to pick your dog, ","useful":3,"cool":3},"ydtliXz9w6c0BuTM56mCuA":{"text":"We had more fun here than the stuffy fancy jazz club down the street. Stopped for a quick ","useful":0,"cool":0},"xoh3Roe6arQwt21tQyZRng":{"text":"Perfect hood coffee shop ...lovely staff ...wonderful baked goods & yum breakfast. Coffee ","useful":0,"cool":0},"2KE9q3bSKLIvMNkw1c_38Q":{"text":"The bacon werewolf and wtf fries were ok. Nothing special and actually way too salty. Plus","useful":1,"cool":1},"QA7xicKJV7ZG8-XW3sFMnQ":{"text":"Great spot to cap off a night out on Frenchman Street! These are some hearty dogs, too!! A","useful":1,"cool":0},"GZP9Xbczia3Nmk-nvw_7yQ":{"text":"Oh what a wonderful place to stop after a few drinks.  Music was playing right outside. Th","useful":1,"cool":1},"uNtZeBR-mII_hcJRiVAefg":{"text":"Everything was bomb!\n\nDuck sausage / blackberry sauce / cole slaw / onions / mustard - to ","useful":0,"cool":0},"jXfaymnMklMEbfx-nBS-xQ":{"text":"This place is awesome! Stayed next door for a few days and ate her several time- Upstairs ","useful":0,"cool":0},"990ucx92OeIfmrg20eRhRg":{"text":"Great food, quick and friendly service, fun balcony! I'm kinda obsessed with the GBLT I or","useful":0,"cool":0},"w7khzIQ_tby1GmFWKJ9reQ":{"text":"Dat Dog was not amazing, it was good but not amazing. I got the crawfish sausage with craw","useful":0,"cool":0},"FbB00dhl2CP1VzRE6UHeBQ":{"text":"We were in the area a few weeks back and decided to stop here for dinner. We had spent a g","useful":4,"cool":2},"MH77BHSz7z6piQJ2MyaUXw":{"text":"Food was awesome. Service was so-so. (Waiter kept forgetting drinks!) Fun balcony looking ","useful":0,"cool":0},"Md_1Kcw89mQW76uoP1IPlw":{"text":"So besides the staff leaving something to be desired...the food was really good. They have","useful":0,"cool":0},"me8UQayhv3Eou8p1t_y50Q":{"text":"The Louisiana Sausage with andule sauce was delicious!  The chilli cheese fries have a cer","useful":1,"cool":1},"vAa0ieB4ch5ZuuMuSvwV5w":{"text":"You can build your own dog or burger or cod fish!! they even have vegetarian options! :) t","useful":0,"cool":0},"Q3jMRzN4fJvfExy8ahFYJA":{"text":"Dat Dog is dat place to be when you're on Frenchman street. Our group of 10 came here befo","useful":1,"cool":2},"m7dQmlIrbyPNTCKUbBnplw":{"text":"So good! Went their twice on our New Orleans trip. Great location on Frenchmen street righ","useful":0,"cool":0},"DJa0V9iSvc2qTedvjm-WHQ":{"text":"Two friends and I ate there Monday. The two of us who ordered the same spicy jalapeño chic","useful":0,"cool":0},"KdYwtNwopa8NpqH5JAfwYw":{"text":"Went here after a fun night of drinking and listening to music on Frenchmens Street. Nothi","useful":0,"cool":0},"Jj9kvJu181-1l20BC3w0lA":{"text":"Omg. This place is ridiculous. I also appreciate of the knowledge of the staff, as I wante","useful":1,"cool":0},"uh2acMiWiI1V7KnLlo697g":{"text":"Finally got a chance to try this  place out... And I will say, this place had the best hot","useful":1,"cool":0},"5WZ05vkOIix9faNTeE7h5Q":{"text":"Oh Goodness!  We had the spicy dog with tomato, onion and cheddar cheese.  The husband and","useful":0,"cool":0},"IwlCMoP_BITU_ss-u70ecA":{"text":"Late night eats! Came here on a Saturday past midnight and it was cracking. Music blasting","useful":2,"cool":1},"vXOnm34OAYW7Jl1P47Re6Q":{"text":"I have to start by saying that I really regret giving Dat Dog four stars, but it must be d","useful":0,"cool":0},"Sxu8oS_GYinurrfyNpA8Tw":{"text":"I and my wife got the featured crawfish hotdog and alligator sausage hotdog. I choose chef","useful":0,"cool":0},"MRU_1VlYK_LvpT6Hw1WFpw":{"text":"This is an amazing place on Frenchmen St. to grab a quick meal when you're amidst crazines","useful":0,"cool":0},"ebmoC_8ZsE6mqXDNqSV1pQ":{"text":"What a funky spot right on Frenchman street. If you get there around 7 there is a jazz ban","useful":1,"cool":2},"WKDhnm3HT2H4-Ua6COLYhg":{"text":"The alligator dog is \"awesomeness\"! The \"Datburger\" is nothing special, but still good. Se","useful":0,"cool":1},"h3duxzkHLHeJOIjvWQmsCg":{"text":"Awesome place! It has a balcony in Frenchmen St, incredible music going on in the corner..","useful":0,"cool":0},"JQtIidB2jrx4KY6KawOpMQ":{"text":"Wonderful dogs, I had never experienced a hot dog like this before. Staff not very welcomi","useful":0,"cool":0},"swsh2FZgoAM7F18ROyL9fg":{"text":"Went here for happy hour between listening to jazz clubs. Bartender was awesome, great bee","useful":1,"cool":0},"7hPoC7MR6uR9dQCc1tYKNQ":{"text":"Eat with the locals!  I have a friend in NOLA and she brought me here for the best darn do","useful":0,"cool":0},"nZZ-SszLTIMLIdZyP8pQSw":{"text":"Fun place. The crawfish etouffee fries had no crawfish to be found. Only a massage chunk o","useful":0,"cool":0},"mZXT9j1XzUPfwacLJgBfdw":{"text":"Another delicious NOLA culinary meat purveyor, specializing in processed meat in tube form","useful":0,"cool":0},"PDqTAcyhvOPAyZ8q3fWvTA":{"text":"Fun atmosphere with unique toppings for your hotdog. Quality hotdog with real skin snap an","useful":0,"cool":0},"C8VTUM9VOMbgWX15qbx09g":{"text":"Duck dog \"the right way\" = Amazing. Hans will hook you up with recommendations for everyth","useful":0,"cool":0},"6oPSa4O9zFnxeF7fOWvfkA":{"text":"Pretty good hotdogs! I quirky little restaurant in a neat area of NOLA.  The hotdogs were ","useful":0,"cool":0},"llF9sZiAId7ZShlI8P5beQ":{"text":"But that bacon werewolf!! Didn't have a taste for a hot dog but this bacon werewolf is tre","useful":0,"cool":0},"qtGHvdXuVmX3SxM9KRFsXQ":{"text":"I hate they just opened a location on Frenchmen.  Frenchmen is such a local feel so it pai","useful":0,"cool":0},"nwh3IrokmyXYTyeaPgOShg":{"text":"I regret not exploring Frenchman Street earlier in our trip, but alas. My husband loves ho","useful":0,"cool":0},"DoAEyHT_Cps0h9u5st0m6Q":{"text":"Great veggie Dog with tons of fixins' to add to it. Eat upstairs and people watch from the","useful":0,"cool":0},"gVLHBOQwJrbIEztJUQSddw":{"text":"Umm YES!!!  This place is a must when in the Quarter.  Some many amazing options for your ","useful":0,"cool":0},"FKX9TC-us8R_vhVacSGWsQ":{"text":"Sick hot dog joint and bar in Freeman Street are of New Orleans.  2 story place out of the","useful":0,"cool":0},"8LTksSuuWriOOKa1NzIiVA":{"text":"Went in there with my friend to grab a beer. My friend has epilepsy and has a service dog ","useful":3,"cool":0},"12tRMsunYAFLib3_ADvU6Q":{"text":"Expect to have to defend your humanity if you're not white. A racist customer trying to cu","useful":5,"cool":0},"u_yJ9MBsnd_7abih2uwGuQ":{"text":"It's hard to label this place, on one hand it's a great place to get a hot dog! Many diffe","useful":1,"cool":1},"O4HOdt-9cHx1eVq5Z8bKPw":{"text":"We had a fun time at Dat Dog! Great location- we stopped by before going out on Frenchman ","useful":0,"cool":0},"KWHBfY4dZZi9ivQh-5QDJA":{"text":"Wow! Order the alligator dog - was amazing! Jake the GM went out of his way to make sure o","useful":0,"cool":0},"QGXWXrxEoZevHIEqODAEMg":{"text":"Best hot dog I've have ever had. Gamble and get the Chefs choice. Chances are you'll have ","useful":1,"cool":0},"oBhNLcBso8rZcCDgIbCi7Q":{"text":"Came here after a night of drinking to get something to eat. The hot dog wasn't that great","useful":0,"cool":0},"9XNxM2VEEQlSIw2OmumxTg":{"text":"We had a bad experience at another local establishment and just happened upon Dat Dog.  OM","useful":0,"cool":0},"zgxhE83xiaRoZG1MFY78gw":{"text":"Incredible food, great service. George was our server and he hooked it up to the nines. Be","useful":0,"cool":0},"3x79U-5Yuo_fhGGk68zgKw":{"text":"A week later and I am STILL dreaming about the dog I had here!\n\nMy friends and I were just","useful":0,"cool":0},"bT1VSaJ5GTQ-QrwdzTIPRg":{"text":"Very cool scene! Most unique and delicious hotdog I have ever had. We had the Chicago Dog ","useful":0,"cool":0},"GmxEWC3wd3VOm3p4gV0mIQ":{"text":"Nice art work. Great service. Food was great and must visit. Had the duck dog with off men","useful":0,"cool":0},"lF5b0UCty2TJYbB8S2plQQ":{"text":"My second time coming here. I came here 2 years ago for the first time after seeing them o","useful":0,"cool":0},"ilb_1AcH7axzzuMgUWLAhg":{"text":"We went there before midnight and we were pretty happy with our choice. There was a line b","useful":0,"cool":0},"Xp4L1SX284ZH0zlg0YPHeA":{"text":"Great quick stop, had the Guinness dog, great flavor and cooked perfect. Awesome casual at","useful":0,"cool":0},"4_8e-fJXadmfOpaOr1wL6w":{"text":"This place is super cheap and very tasty. We were at the end of our trip and were about ou","useful":0,"cool":0},"pWNvMGQmy7WwBGWAMGRm_w":{"text":"Great place!! Fun funky decorations! Great happy hour specials! Watched the St Patrick's D","useful":0,"cool":0},"_wr0Lh8aNQo-XJQOGsBt5A":{"text":"I love hot dogs!!!! Love them more than ever thanks to dat dog. The waiter / bartender Nat","useful":0,"cool":0},"u4y0VFSPxexA4D1hVN6_dQ":{"text":"I really wanted to like this place, but I think we came on an off day.  It took 40 mins to","useful":0,"cool":0},"5IPyvT978Urqzd64QFYkmA":{"text":"Ate here multiple times. Disappointed my stomach could only hold one dog.\n\nA go to stop af","useful":0,"cool":0},"6-dx7-q6bfKY53NQha2rwA":{"text":"Fire! That is all.pure utter fire. Pretty much tried everything and had zero complaints. G","useful":0,"cool":0},"fcL-3PNZEG6Purmqpb17Mg":{"text":"Great place, quick friendly service, awesome location and luckily they are open late","useful":0,"cool":0},"Dvxs5Ir3YF8nwYcg2n1euA":{"text":"After a long day of walking about New Orleans, we decide to stop here for some good hot do","useful":0,"cool":0},"rnOj64p3e04IbsxrcFej1w":{"text":"I drove 30 minutes out of the way to come here, it did not disappoint!! Not only was the f","useful":0,"cool":0},"ckSfIyMs2aR1pptRtdaYCg":{"text":"Fantastic alligator dog and crawfish fries. Nice staff and clean resturant. Will be back a","useful":0,"cool":0},"D-ZWVRsSAh7CiXxGvmONXA":{"text":"Ok so we're from NY and enjoy a good hot dog. This place was sooo good. I got the chef spe","useful":0,"cool":0},"IsxyivlYUAtq5SCE7jCYsA":{"text":"Love it. One of the best brauts I've had in a while and the bun was delicious. The chili c","useful":1,"cool":0},"sADJRna1L0j7PkjOt491rA":{"text":"I'm a huge fan of dat dog and it's hard to visit Nola without stopping by for a hot dog. C","useful":0,"cool":0},"uOfWY84R8DPBoxrr4jb2pA":{"text":"Dillon made us the best Bloody Marys to go ... Was a yummy meal on wheels ... Highly recom","useful":0,"cool":0},"UXRiLLw1wNNa39OISnNl1g":{"text":"Get the Alligator Sausage and the Crawfish Étouffée dogs when you come! \n\nMy friends and I","useful":0,"cool":0},"NVMD_ZH4sEdQ3tVuPYlf0A":{"text":"I LOVE DAT DOG! Any kind of dog, any kind of topping! Awesome deck & location as well!","useful":0,"cool":1},"GbDjJO5R3CoQw1aeVAOBSg":{"text":"Dat Dog is fun! I really enjoyed the grilled dog I got, great grill flavor great toppings ","useful":0,"cool":0},"0kDSkQQMoy18dN-Qd-unFQ":{"text":"Want to pay $8 for a mediocre sausage?  How about $7 for an Abita?  If so, then this is th","useful":6,"cool":2},"1Rsq8Ne0QzXbIBr4fjeTHA":{"text":"We (wife and I) decided to try this place on Halloween night with all the craziness and cr","useful":0,"cool":0},"f7NgluoSLZBeZ5SVb2fdlA":{"text":"Amazing hot dogs and great people. The duck dog is off menu but incredibly good. Service p","useful":0,"cool":0},"jMuehlKYhTqAfTcdPAqscA":{"text":"I don't get it! Was super excited to try the crawfish dog with crawfish étouffée. I did no","useful":0,"cool":0},"Ps44t4LlhGm4ebFNvUmMqA":{"text":"I am up here at Dat dog on Frenchmen an my wife just had the crawfish dog and I had the Al","useful":0,"cool":0},"zDJyzo6GHy8cjT_zF33Y_A":{"text":"Fun, unique, and quick place to grab a good bite to eat. Came here with a group of friends","useful":1,"cool":1},"W1Fsw-pI3aXMjAAmITuwLA":{"text":"All I can say is yes. Yes yes yes.\nCheese fries da bomb .\nAlligator hot dog, amaze balls. ","useful":2,"cool":0},"NZjAtWEuBzWRLg2qEKv5SA":{"text":"Tasty dogs! Our phenomenal bartender Hans recommended the duck dog and crawfish etouffee f","useful":0,"cool":0},"xwXh4mk3rp18JrArVvcItA":{"text":"Pleasantly surprised that they have chicken sausage that is awesome and vegetarian fare.  ","useful":0,"cool":0},"MbZyo1t-DQu3o7OepsIdaA":{"text":"Not sure why this place is only 3 stars, we had a fantastic meal here. The dogs were delic","useful":0,"cool":0},"advjSx1k99YEIBPFlZnUvw":{"text":"Really enjoyed it! Werewolf dog and the special duck sausage dog were amazing (split both)","useful":1,"cool":0},"_xT0xaEb4iFUCqSJaIbu4A":{"text":"From one to vegan to another, Dat Dog has great tasting hot dogs! I was skeptical and I ac","useful":0,"cool":0},"wHWg-P36EIfkxbXCurFNvg":{"text":"Love love love it!!!!! Love the location, love the decor inside, love the staff, love the ","useful":0,"cool":0},"v3FbwnXw3vO6neIJX2f71g":{"text":"One of our tour guides recommended this place. It looked quirky from the outside and a lit","useful":0,"cool":0},"ceU-vpJOc9gUx1e3UHMtjg":{"text":"This establishment was freaking awesome! I stumbled upon it to meet Collin the bartender w","useful":0,"cool":0},"dI5g93dhgiYmVtiLhKQ2xg":{"text":"Have no idea what the food tastes like because the bartender looked at me 3 tines without ","useful":1,"cool":0},"349pN4g3X_TiDyqgGH6O8Q":{"text":"I heard all the amazing buzz for Dat Dog on Yelp and from people in the area so I had to g","useful":0,"cool":0},"LkWbGG4Q5Mlx00Y1nGbcuA":{"text":"This is the spot to get a drink, get some food for a decent price and sit on the balcony a","useful":0,"cool":0},"F592LSq7jpOw-CVXkJo9tA":{"text":"Excellent option for a vegetarian/vegan person. Delicious food and beer! \nIt could be clea","useful":0,"cool":0},"cO03DLrOFMtNkdeQgg6PjA":{"text":"Had the hamburger dog and chili cheese fries... I don't know if they are amazing or I'm dr","useful":0,"cool":0},"gtD1XXp6k6BzngR4mQHwEg":{"text":"Ordered to go. My friend ordered a GBLT. After awhile, the cashier noticed I was still wai","useful":2,"cool":1},"9c3_hZCZ4jEtBmrVEPpRkw":{"text":"Classic delicious with so many options! I nearly got the alligator sausage but went for th","useful":1,"cool":0},"EIsKzziyuUBOctpSIociXA":{"text":"Finally checked this place out..it's been on my list for months now. It did not disappoint","useful":0,"cool":0},"Yj8LFBqCYtWeHjOmxauJcg":{"text":"Dat Dog is a local-themed hot dog joint that offers a variety of different meats and toppi","useful":2,"cool":0},"IiClSG59ymMrf8TR-WA-cA":{"text":"Excellent pricing for a fully loaded meal! If you have been out drinking all day, dat dog ","useful":0,"cool":0},"x7Ej4nbiaOMlAnO610W95w":{"text":"Watch out. They will double charge you for drinks if you're not paying attention. Double c","useful":0,"cool":0},"Y8s_HySH8ICjqhj43Bz1Qg":{"text":"Great quality dogs and late nights eats. Had the beef dog with chili, cheese, onions, and ","useful":0,"cool":0},"J5dk4WuW0xPQNkBfUr6nOA":{"text":"These dawgs are fantastic! Who knew that a hot dog can taste so goood!!!! \n\nI got the alli","useful":0,"cool":0},"UMuLurDs8Uwzzc9l32paBw":{"text":"What else can be said? Amazing variety of dogs to choose from that are delicious. I had th","useful":0,"cool":0},"0lbJTSASMfZ427UQazO3UQ":{"text":"Amazing late night food. Not your typical dog, fancy fixins and YAY to veggie dogs (3 vegg","useful":0,"cool":0},"yFonD3ySM8sQ3X_XSOQP2w":{"text":"Love this place! So many options, there's something for everyone. They're open late and ha","useful":1,"cool":1},"12hokWdQZD3LkQPt150L6Q":{"text":"Ask for the off menu duck dog with blackberry reduction and bacon, with other condiments c","useful":0,"cool":0},"ORvE4WeXolMuta_bmY9dIg":{"text":"They have three different kinds of veggie dogs and a gazillion toppings. That is all you n","useful":0,"cool":0},"DNoLYB2Bs8SXmChuKSXN0Q":{"text":"Had a great experiences here. I ordered a beef dog, my friend ordered the duck dog. Both w","useful":0,"cool":0},"fOgRAQYBr9npUJvHj764tQ":{"text":"This place is the Bomb!!! Highly recommended by locals - we went there last night and foun","useful":0,"cool":0},"2aV-UzFRJjTBIvUvliAK7Q":{"text":"Did you ever just crave a hot dog?  Well this is going to beat just about every place I ha","useful":1,"cool":1},"CeJ1tHwOwIPpba_Qfxzkmw":{"text":"Unfortunately I did not get to try one of their \"infamous\" hot dogs. Didn't feel very welc","useful":0,"cool":0},"bOs78z0ZkwNkrbXxGI7h-Q":{"text":"The best thing I can say about Dat Dog is that I had the best hotdog of my life there. The","useful":0,"cool":0},"GqLBs3TKxRqDbmZ2Wl--qA":{"text":".... I hate doing this because the food was good, but the service sucked for me! We rolled","useful":0,"cool":0},"_J3S_8464uxhYnLxGcx8Xg":{"text":"I had the crawfish etouffe dog.  It tasted just okay. I was disappointed because the toppi","useful":2,"cool":0},"lK9okNAijIRbu0cHav1kUA":{"text":"Hands-down, I had the best hotdog of my life here!  I'm not seeing it on the menu, but it ","useful":0,"cool":0},"yGpzeNXroRn-8Lny8Ok-kA":{"text":"Food was really great - hotdog itself was super tasty and the bun was great. Fries were al","useful":0,"cool":0},"o8dobgHNfEmZzMC2qEVG6g":{"text":"Just had the best sausage sandwich ever, I took the recommendation of my server Hans, sugg","useful":1,"cool":0},"owOImhzXAwuweOqr4FEGxg":{"text":"The location with the balcony is nice and the service was good. The cocktail with ginger w","useful":0,"cool":0},"R2kgfe4ha7LGJ9lL7Qq1yw":{"text":"Dat dog was on the list to try and thank goodness we made it! We tried the Crawfish Etouff","useful":0,"cool":0},"DtF-C3e4tXKC0j9EUBp-Dw":{"text":"As great as I expected it to be, given all the hype I heard about it. Crawfish dog is a MU","useful":0,"cool":0},"lXnz2r0VHW_1l7NdnnRUSg":{"text":"Not to ruin the secret, but y'all need to experience the Duck Dog. Talk to Hans and you'll","useful":0,"cool":0},"zUDuU9e3iBgf5bNcbYqO5w":{"text":"Enjoyed their food, but when I got home I couldn't find my wallet. I'm looking all over fo","useful":0,"cool":0},"B0MbQYlMtBlsuGmDz5REvg":{"text":"Damn, best dog I ever had hands down!  Crawfish was it, perfect location on the balcony.  ","useful":0,"cool":0},"cW2z0sn_maLf3tXvX9TQLg":{"text":"This place is NOM. And affordable, and tons of interesting unique toppings, and veggie fri","useful":0,"cool":0},"7-kBkF08os4RfyAuFCpBmA":{"text":"All dogs are good! Fun, laid-back atmosphere, nice staff and good beer and prices... what ","useful":0,"cool":0},"PB8BfXIJSbU9Zx0mWyXt2w":{"text":"Service is excellent. Dogs are authentic and delicious... Please visit this establishment!","useful":0,"cool":0},"VK4bzXYoPHevrB1j93UrYQ":{"text":"Fantastic!!! So much flavor in every bite! We had the gator sausage with etoufee and it's ","useful":0,"cool":0},"xgclAYL2Ko3vFvbCnPpSuQ":{"text":"Ordered the jalapeño chicken dog and it was no Bueno. Needed something more. Come early be","useful":0,"cool":0},"33PVynMPGybvEO8JnHs61Q":{"text":"This is the best hot dog place in Louisiana! The menu takes a funky yet delectable twist o","useful":2,"cool":0},"Q87HxpNECwgb97kZnwh2Dw":{"text":"Bomb food , super sweet waitress ! \nTry the Crawfish Dog with chef's choice for toppings i","useful":0,"cool":0},"_GgIJ2Yik2Su0u18MQhq5g":{"text":"Oh my!  Best kept secret in New Orleans. The bartender JASMIN is absolutely amazing. We we","useful":1,"cool":1},"6RTlfBLy5qan68H32d5oDA":{"text":"Amazing dogs! Forget Chicago style hot dog. Try these gourmet dogs with fantastic fixings.","useful":1,"cool":2},"QXBRqY_VBv1fH273cio54A":{"text":"I mean, holy sh*t. Yum. I had been told by a few Uber drivers to try this place. I walked ","useful":0,"cool":0},"_z9aNgQrw3VUYaymXmS09A":{"text":"I had the Fieldroast vegan smoked Apple sausage dog with mustard,ketchup, and pickle relis","useful":0,"cool":0},"e4LT3DpP1n8KH3wb1-20zA":{"text":"This palace is dank af. I don't know whether to start with how rad the Star Wars art was, ","useful":0,"cool":0},"dZtrV8ldIF5XVzE2ekBnOQ":{"text":"On iconic Frenchman St in NOLa, some of the best fries & the hamburger is freakin awesome!","useful":0,"cool":0},"yyyeUusO6beb5yXxKIBYAg":{"text":"Had a spicy sausage chef dressed and bacon cheese ranch fries.  We ate on the balcony and ","useful":0,"cool":0},"IKDo-UFy61vkqnwcD5lcvw":{"text":"The hot dogs are very tasty and the employees are extremely nice and welcoming from the mi","useful":0,"cool":0},"nw6CDgloR7FTxkxJpKJIJQ":{"text":"As always it was fantastic!! Love their apple smoked vegan dog. Jacob the bartender was aw","useful":1,"cool":0},"3_Y7nmEcaNIubc5oOlJd4A":{"text":"Late night quick dinner--did the trick. We both enjoyed our dogs and the balcony seating o","useful":1,"cool":0},"9al9g8x68aP0pOaMZyPu7Q":{"text":"Good food, great service, with a laid back atmosphere. Fantastic way to laze away the afte","useful":0,"cool":0},"EMXfZkBBESkodXy63fvfqQ":{"text":"Hans the bartender was absolutely amazing!! The place is cute, the drinks are strong and t","useful":0,"cool":0},"He5__cZPfJ0eTESdJtI1dQ":{"text":"All the different types of dogs and toppings are amazing!! The fries are to die for! Servi","useful":0,"cool":0},"nqSZf9FoOn_LL_0beDas3Q":{"text":"The SeaDog was on-point! Fun atmosphere and quick service. My friend also enjoyed her duck","useful":0,"cool":0},"Tp_hYfTTQkDvvPA5tGUwpg":{"text":"great fare, a new take on the all american hot dog.\nGreat for lunch or a late night on Fre","useful":0,"cool":0},"zZpgIjUFc9BpladYF5rCAA":{"text":"The gator dog was so good! \nThe duck dog chefs choice was amazing \nThe sour beer on tap ..","useful":0,"cool":0},"Yx0_bKGvYgZo8VkZcE9Wmw":{"text":"Two very conflicting feelings about this place. It was our first night in New Orleans and ","useful":0,"cool":0},"EyLk006LFsfd7ZMh_KMkZQ":{"text":"Amazing fries! We tried the regular seasoned fries, etoufee fries, and cheese fries; all o","useful":0,"cool":0},"96Z474qYnaLI1FJvtZIgQQ":{"text":"An employee's child is running around in people's face while they eat. The food was good t","useful":0,"cool":0},"zWqTUozvODP2sL3GWmEuqA":{"text":"This is not only a great place to eat a hot dog in NOLA, this is the best location for Dat","useful":0,"cool":0},"mPxlFbusk9Q4DPz0K_MdRQ":{"text":"We came on a Thursday evening and were served very quickly and got a table. I ordered the ","useful":0,"cool":0},"jXnouvkOB90HYe6ssDoA-A":{"text":"The dogs were good but the douche bartender with the tattoos spilled a whole pitcher of wa","useful":0,"cool":0},"AgyxkMnKOjfSAAEKJv7LpA":{"text":"Great place to grab a late night bite. Ordered at the bar with Peaches aka \"Zack\" (great g","useful":0,"cool":0},"LWGRlTOos_wHuos12zEXqQ":{"text":"We found this place as we were aimlessly walking around New Orleans.  There was no transie","useful":1,"cool":0},"_RfRbxW6SmCdLxqjirr_2A":{"text":"Cool spot in Frenchman st! We had heard the food was good so went to check it out. I had t","useful":1,"cool":1},"QDpNffcymZapGy7emFSVng":{"text":"Want a balcony view with local music and a tasty hot dog? Stop by Dat Dog! Featured in the","useful":0,"cool":0},"NkCIKTE1Wul-Q5qtkpsh_Q":{"text":"First I'll say I'm not really a Hot Dog person, but we were starving and came in before my","useful":0,"cool":0},"_YKtDIA_QqSqa1fxd5qaQw":{"text":"5 drinks in and still tasted bad. Old cold cheese fries. Nice balcony view of brass band t","useful":0,"cool":0},"wS1vK1ddvIbCMoRyKhA-Lg":{"text":"Where do I even begin?! 1. The restaurant is open until 3 am and is located in an entertai","useful":0,"cool":0},"gpK1igR-2sdishjU5uMTLw":{"text":"It's a hot dog joint!  But not the typical hot dog joint.... They grill the dogs here.... ","useful":0,"cool":0},"mxDe2wF7wfYF4WcybIkigA":{"text":"So SO SOOOOOOO good!  I had the Coney Island and created my own for happy hour. The hot do","useful":0,"cool":0},"lKZM1FkbKFy-eD01ePOACg":{"text":"My wife and I visited Frenchmen St. while on vacation from Chicago. We didn\"t plan to dine","useful":0,"cool":0},"TIUUKWkmQ-9HSftZpll8Dg":{"text":"We came here for a late night snack after listening to some live jazz music. The food was ","useful":0,"cool":0},"Tnfk4CUorxnEXotmFYXJtQ":{"text":"The yummiest, most creative dogs in the funkiest, hippest atmosphere! Also, very friendly ","useful":0,"cool":0},"pQZgCPXYjC0I0IHKcq_vvA":{"text":"Gator dog was delicious and so were the fries! Will definitely want to come back when I ge","useful":0,"cool":0},"w7z_-G54TGUiYOotMcaeXQ":{"text":"Creative and delicious pre-made hot dog combos and the ability to make your own! We went h","useful":0,"cool":0},"TTpKaHmxcbmIiY4IiOhFow":{"text":"We stayed at an Airbnb on Frenchman a block south of this location and it was a pleasant s","useful":0,"cool":0},"cBBPXX2VGVHIAUr175IN7w":{"text":"Another location of this popular local hot dog stand. Except this one is a full fledged re","useful":3,"cool":3},"b_uP_D7Z-mAROZxcB3P5bQ":{"text":"As a vegetarian there are vegetarian options this is somewhat important. Our adorable semi","useful":0,"cool":0},"jlkO7zjwltvB4_eDBXTjAg":{"text":"The Bacon Cheddar Ranch French Fries were were to die for! Shared with a friend. Everyone ","useful":0,"cool":0},"EP_Dq63CFXKp23anoO0L0g":{"text":"Why all the hating on the dat dog? I ended up here last weekend and enjoyed every part of ","useful":1,"cool":1},"VX_UF-MHZKIOnOrENV7X4g":{"text":"First off, dat dog is the best drunk food. Actually best food normally. \n\nWe had a little ","useful":0,"cool":0},"p5-h5_JQxOHC2kaQorpvsw":{"text":"They have a really innovative menu with a wide assortment of hot dogs and sausages. I trie","useful":0,"cool":0},"MwH1K_W7TGEwwneWScMY-g":{"text":"I had major reservations about having one of my meals on this trip to Nola be a hot dog bu","useful":0,"cool":0},"juvh7IwuDJaxgvwAkkBvZA":{"text":"Ample and delicious vegetarian options in a meat heavy town. Great location on Frenchman s","useful":0,"cool":0},"xxgRyYH5FqSRrd7gzmwAYQ":{"text":"Good music, the staff was friendly and vibrant and the food was delicious.  \nI had the fri","useful":0,"cool":0},"b-QV_JVLsm-uB26mMelwFg":{"text":"It's a sausage place.. Beer on the balcony, friendly service, reasonably priced beer, watc","useful":0,"cool":0},"7PxRBRvTF0IqQHnVG4_Nng":{"text":"This place is bomb! I love that they have vegetarian/vegan options, the field roast sausag","useful":0,"cool":0},"YuKX0nbZuAst4eQ3w8Spsw":{"text":"Two very conflicting feelings about this place. It was our first night in New Orleans and ","useful":1,"cool":0},"L09ZfOz2Gat0ULSy3KkeUw":{"text":"I highly recommend this place if you want an amazing American staple.... the hot dog. I we","useful":1,"cool":0},"cqafeFMJ3UE56leNFHGgqg":{"text":"Dat Dog has a reputation that doesn't really need explaining.  If you're into gourmet hot ","useful":0,"cool":0},"cgHxRAEIsDP4gpBq1-TH5A":{"text":"Woooooooowwww!!! WTF?!?! That's the BEST hotdog I've had in my life!! I live in L.A. and I","useful":0,"cool":0},"fwSTSt07Zk4PhpN4_blV6g":{"text":"I ordered a Veggie Dog to go, I was excited as a vegetarian and looking forward to a Veggi","useful":6,"cool":1},"lPpzD0CDdGjPy4g2CX1lpg":{"text":"Good food when you want something quick and low key.","useful":0,"cool":0},"HhRipU0biAcyH7flac_j7w":{"text":"Love this place - we walked in on a busy Saturday night and the host helped us by leading ","useful":0,"cool":0},"W7Nz256hpJVwXqm3r8gFsw":{"text":"It's always a party in my mouth when I go to Dat Dog! The variety in hot dogs is amazing a","useful":2,"cool":1},"-9OLNThIVuvfKYDtaFTxfA":{"text":"Worst service ever. Waited for more than 30 mins. Apparently they missed our order but hav","useful":0,"cool":0},"R7eUreNQH_pxAsPbiIycfQ":{"text":"Read about this place on YELP, I was excited to try it!   They had a full bar, Étouffée fr","useful":1,"cool":2},"KJzqSwzRAxQxZUS3f222WQ":{"text":"OMG what could be better, than Frenchmans Street, on a balcony, eating great dogs at midni","useful":0,"cool":0},"lID_m6TWHZatMbpFhgQAyg":{"text":"I got the fried chicken dog and it was incredible. My two other friends got two others and","useful":0,"cool":0},"YPsthrqAspfuDTCtVKu4Yg":{"text":"Good food.   I only had a bite and I liked the flavors.  Everyone I was with that got to e","useful":0,"cool":0},"w3XPYzAB0I0-39KCWYr-Dg":{"text":"A friend of mine wanted to come here and I was like alright whatever. Ah this was an exper","useful":0,"cool":0},"nKLI31cR0C-N5PJ9UpdorQ":{"text":"Dat Dog is probably some of the best drunk food you'll stumble upon. With a few key locati","useful":0,"cool":0},"WmJgbEtzrK-kWvlZPT3VZA":{"text":"Wow! Had no idea what to expect here. We really thought it was a simple hot dog place- it ","useful":0,"cool":0},"MMDf1x2hhIiEd1lSPq4Ozw":{"text":"what a fun place. totally dig it. tasty food, good beer on tap. what a cast of characters ","useful":0,"cool":0},"uIMDCISWiYWGh0h0FapIbA":{"text":"Finally stopped in here on a slow night and ordered the Duck Dog. I have never been a fan ","useful":1,"cool":0},"K8SZvJR0Vw5CQUeuKaurwQ":{"text":"Recommendations: crawfish, duck and vegan.\nA bit of a wait but the soft bun and a side of ","useful":0,"cool":0},"Bk1sOmVOeugYZ-UkI7R6YQ":{"text":"Dogs were outstanding -- and as a Chicagoan that's high praise. Loved the crawfish dog and","useful":0,"cool":0},"n5t5fwCVJle9rOuCPM5BXQ":{"text":"OMMMMMGGGGGG This place is so good! We took an UBER to Frenchmen street and the Uber drive","useful":0,"cool":0},"9i0IkQUDv0fhVNlwROYDwA":{"text":"Finally made it to Dat Dog and kicking myself I haven't done so sooner!!\n\nJeez, nothing li","useful":0,"cool":0},"DkTpYf7DRELCU0esBODCEQ":{"text":"Always is good... I go to that dog every week because they know what you really want if yo","useful":0,"cool":0},"MGI9gtWM5ixEKLt258BUZQ":{"text":"This place is in a GREAT LOCATION right in the middle of all the good music venues.\n\nIt ha","useful":1,"cool":0},"Kn-teFWPgdCIFFtKwmb9vA":{"text":"Really nice staff. Balcony seating on Frenchman Street. And hamburgers in a hot dog form. ","useful":0,"cool":0},"Fr0k8xMRi3i_gbl5IZLWOQ":{"text":"Hans Eric Leonard is awesome! Best bartender on Frenchman St!!! Must visit. Dogs are amazi","useful":0,"cool":0},"8kP2kNMuAcJFELjv6Q7gCA":{"text":"Stopped in for a quick snack, and ended up coming back the next night for dinner as well. ","useful":0,"cool":0},"ZW2VqLMpwNPUNXYS_00Ovw":{"text":"So good. So yourself a favor and get the duck special the right way, add grilled onions an","useful":0,"cool":0},"vLO0DyfqOyOLfmUe6Y0GYg":{"text":"Thee best hot dogs I ever had in my life...\nI took one bite, just one bite and I was in da","useful":2,"cool":0},"gShp6neTMnObvJqzoGL0Gg":{"text":"Late nights on Frenchman street means a lack of food options, however Dat Dog came through","useful":0,"cool":0},"Fhi1a33tlSMC3Xj3Hzog9Q":{"text":"Everything was delicious. The duck was amazing! Everyone was very friendly. Will definitel","useful":0,"cool":0},"J_NsULUNJtcFbpwIzedRXA":{"text":"Best Hot Dog ever had! WTF fries were delicious. I am not a étouffée fan but others in my ","useful":0,"cool":0},"wACnGpiIv103aRbNPzBofw":{"text":"Got a late night snack here: fries with cheese, ranch and bacon for ~$5.50 with tax. They ","useful":1,"cool":1},"JPGcdfY4RnRD02IhQRCE_A":{"text":"Very busy place. Great for late night snack! Crawfish dog!! Very noisy but friendly. It's ","useful":0,"cool":0},"X7ESNhuAip8I1iPnp30qpw":{"text":"Went there twice during a trip to NOLA this past weekend--once Friday afternoon, then agai","useful":1,"cool":0},"dW1KjNiDiPQmWdgizgO5Dg":{"text":"Fantastic. Super tasty and it hits the spot. You can tell the dog and the amazing bread ar","useful":0,"cool":0},"AmPOaGjRb5802BRgJC6Kbw":{"text":"Fabulous food and great balcony seating for people watching!!  Great selection!  Someone l","useful":0,"cool":0},"gZuNrFM_M89sQWmzHA2dFw":{"text":"The Chicago dog was amazing!!  The sweet relish looks like it is homemade and went fantast","useful":0,"cool":0},"D9RzPyx3zxwddPP1GriUmQ":{"text":"Food: had the crawfish dog with etoufee sauce, cheese fries and an Abita Amber. Very solid","useful":0,"cool":0},"sUWsy85VCvMxojgM_ZHFHQ":{"text":"Omg. So good!!! So many options for a hot dog and we loved them all. The place was perfect","useful":0,"cool":0},"uL-l9mxD5nWdCX4NWH7gIA":{"text":"Loved this place.  Our food and beer was amazing! The bartender Hans was absolutely wonder","useful":0,"cool":0},"ai-DRz6i_C1nqNzyXgO6AA":{"text":"The sausages here are very good and they're served on slightly sweet rolls. That spicy mus","useful":0,"cool":0},"IwC--WwXRp7bNpMlOcegPg":{"text":"I live for the bacon, cheddar, ranch fries here. And the chef's special (duck sausage, bla","useful":0,"cool":0},"LkNxFuDf559brfqKsn2sXw":{"text":"Omg! I absolutely love this place.  I'm not fan of hot dogs but I would come here everyday","useful":0,"cool":0},"exRYuWIyYxlDv2FpqHyHoA":{"text":"Great place to have  a Dat Dogburger, watch a football game and drink a beer. Go upstairs ","useful":0,"cool":0},"dpmeOqX6tW_px3QkYlmvEw":{"text":"Best food I've had since visiting New Orleans.  I seen Smokey at the Rusty Nail.  Made me ","useful":0,"cool":0},"ujp0U-v22VEgSghGOjsvYw":{"text":"All I can say is that I left NOLA with regret. Why did I only stop by this place once? One","useful":7,"cool":5},"sxwHI2RlnETifdmbyiFM1Q":{"text":"What can I say, this place does hot dogs and it does it well! I must admit, I haven't had ","useful":0,"cool":0},"A1kV0wnz9-QHIUvFqY1Z8w":{"text":"Menu was a bit confusing but the employees explained everything.  I can't rave enough abou","useful":0,"cool":0},"Wrc5YkKZ1N8shKVv4ThYzg":{"text":"Disgusting food and incredibly bitchy staff. We arrived at 830 tonight. My husband ordered","useful":1,"cool":0},"6ie9QYjpUj2UrO040bX68g":{"text":"Amazing dogs for a variety of diets! Fish, beef, alligator, beef, pork! Really great \"anim","useful":1,"cool":0},"GgPenCmH6hP7fYM2K9kC7Q":{"text":"Rude staff. Extremely rude staff. It was 3am and there were very few customers in the plac","useful":3,"cool":0},"KsEMPqeLh3YExgykD4WghQ":{"text":"We loved our lunch here. Great vegetarian options. We let our server choose/recommend topp","useful":0,"cool":0},"DMQ01U5Ro9IRB_Ci1CiCOQ":{"text":"Delicious food, friendly staff, and an extensive beer selection! You can't go wrong with t","useful":0,"cool":0},"I44ayvppa87NCA3KJLeeCw":{"text":"The most amazing sausages I have ever had.  If you visit NOLA, this is for sure a place to","useful":0,"cool":0},"ae60pJHdon8COF_r3uYuGA":{"text":"There are not enough stars available to describe how awesome this place is! Get the Hans s","useful":0,"cool":0},"jmqIMj9_2etTVofiAgHnQw":{"text":"HANS IS THE MAN!!! We didn't know which sausage we wanted, and he recommended a duck sausa","useful":2,"cool":0},"hfpCdZfckXQINLfxwFjcsg":{"text":"The HOMEMADE Saurkraut!!!  Had the Bacon Werewolf and my son had the Buffalo Chicken Speci","useful":0,"cool":0},"tzz6AV3HibzJ0Qax8B0xhw":{"text":"The best thing I can say about Dat Dog is that I had the best hotdog of my life there. The","useful":1,"cool":0},"uCpyAgLTO-7pszvNM-7L2w":{"text":"Food is delicious! No need for specifics. Just go and I promise you will be one happy cust","useful":0,"cool":0},"23my7v_lfoleDLs346nsTg":{"text":"Awesome Hot dogs, Service is always great! Crawfish etouffee fries and crawfish sausage ar","useful":1,"cool":1},"0Xvz-feIxYCBRVQ3X8IrzQ":{"text":"Great place to grab lunch on Frenchman. The Crawfish Etoufee dog is the stuff of legends. ","useful":0,"cool":0},"If-qVkn6ikUwyNDHQ6RynA":{"text":"This place is definitely the place to go after, (or during) a drunken night. In my case, i","useful":0,"cool":0},"mbYRENFaZchc4WsInTa0fw":{"text":"yum! Love the variety of toppings they have here. The hot sausage (topped with chili chees","useful":0,"cool":0},"Z2t7nxDoOR1KIfEyQpuWHg":{"text":"NOLA first timer here for my friend's 30th birthday party. 100% coming back to Dat Dog nex","useful":1,"cool":1},"t5hLzSA-ZG2lhNIVDCLexg":{"text":"Dat Dog was great! The food was amazing and the service was even better. Hans wished my gi","useful":0,"cool":0},"l_wA4FANVIonGtUMWXxzgQ":{"text":"We stopped here for a quick bite to eat while exploring Frenchmen Street, and I was please","useful":0,"cool":0},"caZSvrXx6dNXuvjf4vMNZg":{"text":"Best hot dog ever, great toppings, good bar, fast service, open late, Frenchmen at is also","useful":0,"cool":0},"0ugw041CyPtlocLK2ocdcw":{"text":"Cheddar.bacon.ranch.fries! A drunk girls dream. Well in my case anyways. Best fry concocti","useful":1,"cool":0},"gygbyMV9MGOwX_TP0cj-EA":{"text":"Got super sick after eating here just before close, that being said, WORTH IT. The Crawfis","useful":0,"cool":0},"bf_rvlGntAGt6dgkhto_dA":{"text":"My friends and I came here on our last night in New Orleans. We loved the atmosphere; the ","useful":3,"cool":2},"XNI68NZB7w5ainoyEPzFXA":{"text":"Heart place. I had beef Chicago style dog and it was good. I also had the etoufe fries and","useful":0,"cool":0},"29Z6J6LT_SBu-W5eGqW0bw":{"text":"We waited for fifteen minutes before finally ordering at the bar. The self serve soda mach","useful":1,"cool":0},"wvWImL_scTXz0ChVAjOUCQ":{"text":"Very good hotdog to go and enjoy. Great view of New Orleans streets as you enjoy your meal","useful":0,"cool":0},"R8fY4M_vCe-KrILJFtvWXA":{"text":"Corner of Frenchman and Chartres, live local band in the background playing. Their crawfis","useful":0,"cool":0},"k7Y_pNagKpOfxZWfi5gycg":{"text":"Really delicious gourmet hot dogs in a variety of flavors, and fun atmosphere...highly rec","useful":0,"cool":0},"dPGUARLxzntg9DVFhQnlJQ":{"text":"I've only been to this location a few times, but every time I have been here was during Sa","useful":1,"cool":0},"2f-as2opa1B9kc2uJ0o5ag":{"text":"I was looking forward to my trip to New Orleans because I knew I would be in for a treat w","useful":0,"cool":0},"I_WfP7iZQzwuX3-86C6hYQ":{"text":"Please note that this review is only for this location and the 'service'. The other two lo","useful":4,"cool":1},"mIOhJ0kZgfxfoA9MG8xzkw":{"text":"Best food (for the money) in NOLA.  Great late night spot.  Crawfish sausage was gooood!","useful":1,"cool":0},"TtBjMyY04v7hCnOkk8MN6g":{"text":"Quick, delicious, THERE FOR IT! Not just your average hot dog, really like big fun sausage","useful":0,"cool":1},"7t9cApjIpT4U1VdUrDABdg":{"text":"Food was amazing !!! I highly recommend the Dat burger dog with some chili cheese fries","useful":0,"cool":0},"TpT4pVoT_SVADrDUYwaQaQ":{"text":"Best dog I've had! Get it with chefs recommended toppings, you will not be disappointed!","useful":0,"cool":0},"yn31RUHuB8_vPIah-eL1GA":{"text":"The worse, I got ignored because I wasn't pretty enough! Tried really hard to be served bu","useful":0,"cool":0},"AxvmLO_Si7STGuun5dIExQ":{"text":"Some novelty hot dogs, a chicken dog, a cod dog, and even some vegan options. It's nice in","useful":1,"cool":0},"aNbBYKC1NIeX8dTeGlwtgg":{"text":"After enjoying the art market and then some live music and partaking in some libations, on","useful":0,"cool":0},"h9dB7efR5Ci-fkH9IGQNwA":{"text":"We were looking for something with good sized portions, and not a ton in money. \n\nWe order","useful":1,"cool":0},"UHhJG-tg6rGSUjlHIu0XOA":{"text":"Good dogs, heaps of flavour and simple service, not one for date night but great for a qui","useful":0,"cool":0},"mRkdie9L981d9IZOlZBAfA":{"text":"Was visiting New Orleans and passed this place a couple of times and finally went in. Glad","useful":1,"cool":0},"UBcDjyIgt5MMEgdXEmx73g":{"text":"The duck special is the BOMB!!!!!! I'm from Chicago and the Chicago dog is not even close ","useful":0,"cool":0},"ANW5Xr-Qhjhb1Udifph1GA":{"text":"Had the crawfish sausage done the house way and added bacon...because when bacon is free, ","useful":0,"cool":0},"A219w-gsoBHCKmvU4lnDaw":{"text":"Visiting New Orleans from San Francisco, I had a long list of restaurants I wanted to atta","useful":0,"cool":0},"CvSw7-PlqseLtQecOFD-hw":{"text":"The hot dog was good and the number of topping options was crazy, but waiting half an hour","useful":1,"cool":0},"17ZYgJMc9nC6Kg6W7P-6MA":{"text":"Bar tender Nancy was very helpful. Nancy deserved the tips and ran the bar with love and r","useful":0,"cool":0},"S3GCgVtNu0jj2FUXOdjnfA":{"text":"Very disappointing. I was really looking forward to getting some of the vegan options here","useful":1,"cool":0},"qU0QKGfDapP6lE0P2oSqzA":{"text":"So yummy!!! I already miss these dogs so much! And definitely try those bacon and ranch fr","useful":0,"cool":0},"korWKLqONKHPh0PKGWuRcQ":{"text":"We are all in New Orleans this weekend to celebrate my fiancé's birthday and we stopped in","useful":0,"cool":0},"PU_PB60_h8oLIX9o9yGyjw":{"text":"THIS IS THE BEST HOT DOG PLACE IN THE WORLD. We came here back in 2014 on a visit from Los","useful":0,"cool":0},"1LQsqo868cSEpMwd9JMjZA":{"text":"Came in on a Sunday and met bartender Dillon. He was able to recommend beers for both me a","useful":0,"cool":0},"Mx9CdyIXmW3IC_FMaxIqgA":{"text":"Wow.  What a great idea for a restaurant.  \n\nFully customizable hot dogs and related food,","useful":1,"cool":0},"zUnjZzTq7PXRjNyIsi4r3w":{"text":"YES! Yes! yesss! I don't even like hotdogs, and now I'm looking for \"curated\" hot dogs by ","useful":0,"cool":0},"GTrosmNXScbasZLjslfW3Q":{"text":"Went here last Thurs. It's  a rip off. $7.95 for a \"dog\", nothing extra. Oversized  roll.\n","useful":1,"cool":0},"iw0Z5PMB4fC33MUYp6mwzw":{"text":"I can't believe I'm saying this. \n\nThis was one of the better meals we had while in NOLA f","useful":0,"cool":0},"_3yhsyUJtPEmi9V7Yt_rXA":{"text":"One of the many places we stopped at on our NOLA trip. The best part was when we were leav","useful":0,"cool":0},"FlmcZKYYWExqw4nSDWypdw":{"text":"Ahhhhhh Dat Dog is so delicious!!!!\n\nI ordered the Chicago dog and some chili cheese fries","useful":0,"cool":0},"iPrTuA3z9WulRrj5PPSRJw":{"text":"Awesome gourmet hot dogs with lots of New Orleans specialties - crawfish sausage, alligato","useful":0,"cool":1},"7LRFCTFvJy22hWgt7ewfdA":{"text":"Dangerously good. Made the incredibly fortunate choice to go for the chef's choice the fir","useful":0,"cool":0},"P0wZbwEnlopcjK89df3_Tg":{"text":"Best yummy sober/drunk food ever, plus they have it good for vegetarians.","useful":0,"cool":0},"Xqtm4X41Yo7l4dbl-6Ykdg":{"text":"Do not get the \"Bacon Werewolf\" I was horribly disappointed... And the cheese fries aren't","useful":0,"cool":0},"d1QukxLeMTFM51PI7G49Lg":{"text":"The food was sooo good here. I had the Guinness hotdog with fries. One, the bread is pheno","useful":0,"cool":0},"utGxKldCFWnY8jmONE66Gw":{"text":"Fantastic place to eat in the French Quarter, especially if you're out and about for Jazz ","useful":0,"cool":0},"RUHYwkf2xWQj-0ZjrCD7BA":{"text":"Ordered a custom hot dog: bratwurst with dill relish, grilled onion, sauerkraut, crawfish ","useful":0,"cool":0},"xoJvWCYUAfAnpGUV6_AM8Q":{"text":"We ate here a couple times on our trip. The dogs were good, the staff was disorganized. Th","useful":0,"cool":0},"FxJwneX3eavnyvRbPebrtg":{"text":"Finally tried Dat Dog out last night with some friends.  Gotta say.. I am not a big giant ","useful":6,"cool":2},"eEI51oFSOo6-ed8AScy9Jw":{"text":"Was recommended here by a buddy of mine because we have a dope hot dog spot back home in J","useful":1,"cool":0},"moPrCf_4AxQPv8DSsfDklg":{"text":"Amazing place to grab interesting combination of hot dogs and and fries. Highly recommend!","useful":0,"cool":0},"MGv1NEiEtre5TD_hhmNssQ":{"text":"I want to give dat dog 5 stars but..... they got my order wrong, it was still tasty but I ","useful":0,"cool":0},"VmXDmmO8qfT9vabD8yOFmQ":{"text":"This place is a must try if you're walking along Frenchmen Street. The hot dogs are reason","useful":0,"cool":0},"8apSg4PywV1MGyHLRCMohg":{"text":"Perfect fourth meal/ super late night stop! Stopped in after a night of live music on Fren","useful":2,"cool":1},"PA64Qmh6rdsZVyAxJJ55fw":{"text":"Great location in the heart of French Quarter.  Lots of specialty hot dog choices.  Food g","useful":0,"cool":0},"gvDmZqM4T4Rh6Iy5Kk2hCQ":{"text":"If you order a veggie sausage, the description is of what the dog is made of not what come","useful":0,"cool":0},"Xfurwauk8mZeaupkeR4ZYA":{"text":"Was going to reserve this rating for after I ate but screw it... Here it is: came her just","useful":2,"cool":0},"_oMAItnPRT_MbvKSvAEQKA":{"text":"el mejor lugar para comer hot dogs en NOLA y ubicado entre todos los bares y lugares de ja","useful":0,"cool":0},"ogjYrGdLKS9x5NG6P3Td4w":{"text":"I am up here at Dat dog on Frenchmen an my wife just had the crawfish dog and I had the Al","useful":1,"cool":0},"4jsCLEUOX3xZHx3i7BxrHQ":{"text":"Had so much fun here during my vacation in Nola!! Best hot dogs ever, a great place for la","useful":0,"cool":1},"LEoSLymfQR6eORLnaHMwig":{"text":"This place is a staple in New Orleans.  These hotdogs are outstanding.  Variety of topping","useful":0,"cool":0},"KSbdCNv_voRV0OaCwNgl5g":{"text":"ruined frenchmen street.\n\nmight as well be a wal-mart.\n\nthanks mitch landrieu.","useful":0,"cool":0},"GSZfta8SA8B3KWbBwrqT6Q":{"text":"I created a Yelp account just so I could review Dat Dog. This was one of the best restaura","useful":0,"cool":0},"uCTCbVzv1p72em9qMMsAQA":{"text":"Extremely good home made food here and the staff are helpful. The duck sausage with the bl","useful":0,"cool":0},"YXM23QjIJ_ljfQz4jMmc4w":{"text":"I have been to every Dat Dog in the city and was excited to try this one since it is bigge","useful":0,"cool":0},"lrlj3UiMl53yqZXxIrdmxw":{"text":"So stoked we came across this place!\n\nI would nearly come back to NOLA just for these hot ","useful":0,"cool":0},"YY0hw0SDpRQVlDgBSeEKHg":{"text":"What a surprise!  My sister and I paid the cover the see a show at a club down the street ","useful":0,"cool":0},"zqIIOy6Juhl08Dj7xU9huA":{"text":"This is a review on drinks only!\n\nWent upstairs! Great drinks for the middle of the day th","useful":0,"cool":0},"1O9IyHS8w8EYAiyya2O_7w":{"text":"The chipotle veggie dog really hit the spot. One of my favorite places in New Orleans. Bet","useful":0,"cool":0},"vQHvhJDvI0vUC_oigDMWGw":{"text":"I've been to Dat Dog a few times, usually after a few drinks. Everyone is always really ex","useful":0,"cool":0},"C6E6RMEEB4X3kucN7BL3aw":{"text":"Had some friends that wanted a hot dog so we ended up here. \n\nI had a side of fries that w","useful":1,"cool":0},"arALf5bswXGrSYMx-Eay3w":{"text":"Straight five stars. 7 of us came, saw, and conquered. I had a Chicago dog with Duck sausa","useful":0,"cool":0},"tM17ORjU8HXls4raWuyiQQ":{"text":"Amazing food at a reasonable price ! Especially great when you are hungover ! Tried the cr","useful":0,"cool":0},"kJcY5kmp7BbDv4j0mAla9A":{"text":"Must try!!!!! Everything I ate was delicious. The chili cheese fries were dank but my abso","useful":0,"cool":0},"Te4Exv2qytxg1-cwv6eS_g":{"text":"Dat chick is something!  Loved it!!!  The Crawfish Effouttee dawg is also one to order. Th","useful":0,"cool":0},"s1HWsy3oGGtSisVDvCzdZQ":{"text":"Stood in line for 10 minutes at food register ignored by the staff, went to the bar to ord","useful":0,"cool":0},"j236edn6FLqfgBHuAd8qFQ":{"text":"Sooo good. My friends and I went to both locations. If you can imagine an amazing combinat","useful":0,"cool":0},"4nEsBxWQdUb55ZS-hMMGRw":{"text":"I always get the Crawfish Etouffe Dogs and Fries, and every time it's like I'm tasting it ","useful":0,"cool":1},"6_5JTS8pZ9mFwk_dAkhWHA":{"text":"A lot of charm. I didn't find the crawfish etouffee fries or the chipotle veggie dog very ","useful":0,"cool":0},"Pe17iEsmMP3y-M1Fp8v3ow":{"text":"Probably the most tasty dog I've eaten. I ordered the Guinness Special being that I was so","useful":0,"cool":0},"V2sLzY_4qUpu9QCZbDwJ0w":{"text":"A friend had checked in here a week before a planned visit to New Orleans. It looked inter","useful":0,"cool":0},"WwTXkZ9oHiSaL9LtyAiDMA":{"text":"Their dogs weren't too bad, they do got different style hot dogs but I've had better. This","useful":0,"cool":0},"EtXzhz4gSWA_5TE5poaTPA":{"text":"One doesn't usually think hot dog when your looking for a New Orleans dining experience, b","useful":0,"cool":0},"pTAhJDJzfWOEwSChGGUEpw":{"text":"Lemme tell you, DAT DOG DID DAT. Got a duck sausage and did chef's choice for the toppings","useful":0,"cool":0},"4tdtXAgoav-x5Kv5JzSfng":{"text":"Coming from Chicago I'm a snob about hot dogs. We got the crawfish dog and it was decent. ","useful":0,"cool":0},"zBWM62SAZ1DtwfN42vOmKg":{"text":"This place is tremendous if you need something in your stomach before or after drinking. B","useful":0,"cool":0},"_tXFsFxhVyA08-H0o8IKbw":{"text":"Dirty, okay food, overpriced. That's the short and sweet of this place. I have no idea how","useful":0,"cool":0},"pzlUviQ--jMt7W-DLOET9g":{"text":"My husband and I both ordered the Chefs Choice and requested different dogs. We also got t","useful":0,"cool":0},"PYDhMILzs4KE98tzsWwtow":{"text":"The sausage is big and juicy! I order the crawfish special thinking the sausage would be m","useful":0,"cool":0},"PV0REXCTrRDH_SvJZ3ZFmA":{"text":"Tasty late night dogs anyway you want!! Great people mostly because at 1:00 in the morning","useful":0,"cool":0},"YLCcnW9j5qaqWFTj1Z6JDw":{"text":"Delicious late night food! The chili cheese fries are goooood and perfect when you uh had ","useful":0,"cool":0},"CxUv6riMn8mvUtAwf3nwQQ":{"text":"We had a blast at that Dat Dog and especially enjoyed the upstairs decor!!! Loved the gian","useful":0,"cool":0},"DNypdo-qM2QkGAUBRb0gpw":{"text":"Great sausages, truly! Had the gator and some WTF fries. Well above any other bar food.","useful":0,"cool":0},"CnfX6FCD77bAhk24AitQRQ":{"text":"Duck dog was fantastic!  Hans set us up!  Stumbled upon this gem!  Bloody Mary's were grea","useful":0,"cool":0},"tUMu2Zspzl1eorSMvDqjHA":{"text":"This joint is one of my favorite traditions to visit when I'm down in New Orleans. Dat Dog","useful":0,"cool":0},"ZrlmbnKXbqVtzCSHJTs9Pw":{"text":"Was told by NOLA locals to come here if I was going to be in the frenchmens street area. I","useful":0,"cool":0},"5LwXKDUjtaiudar-QcXbXA":{"text":"Funky, fun place - although they are all hot-dog shaped, these are not like hot dogs you h","useful":0,"cool":0},"_4v6fPouj0aQMzicoNIgjg":{"text":"This is a cool new addition to the Marigny since our last visit whose liveliness matches t","useful":0,"cool":0},"FCpG35yy09z57tp0mUBteA":{"text":"I have not one bad thing to say about Dat Dog! My husband and I sat at the bar for lunch. ","useful":0,"cool":0},"sxjrJGRwgK41ed-t87Clpg":{"text":"Cool place to check out for unique hot dogs. The restaurant also has a lot of character wi","useful":0,"cool":2},"wmRaKRVcxV9GpLAWukYK6A":{"text":"We ducked in here because we were hungry and were really happy we did. We had a bit of a d","useful":0,"cool":0},"4C0GuTFLVglpAWALg-SfKg":{"text":"Sit on the balcony above and watch the non -stop street action on Frenchmen Street. I had ","useful":0,"cool":0},"I5vhzl3TZgpWHh4GGSiECg":{"text":"Great menu and great food.  You have gotta try the crawfish sausage and have it dressed wi","useful":0,"cool":0},"ecPkkuLoGBsOOuVbQx3PPw":{"text":"Nathan killed it, we had a great time and he helped us with beer selection and orders.","useful":0,"cool":0},"KuM7DZcqCqin5u0aN7_R9Q":{"text":"Amazing! Wtf fries are bomb, chicken sandwich n crawfish sausage are the motha f'n sh!#","useful":0,"cool":0},"qirC5zD198E_hU4LsxAc6Q":{"text":"This place is really excellent. Food is five stars, ambiance is five stars, service is fiv","useful":0,"cool":0},"48imXnfJjqglvZeaxDkpHA":{"text":"OMG pure amazing VEGETARIAN dining - with a view!! Who dat? Dat dog! (Which, oddly, is als","useful":0,"cool":0},"cMmjHa3IwhcU8mmbAFNskw":{"text":"I am such a sucker for a good hot dog and especially after a night of drinking. They reall","useful":0,"cool":0},"hHA9pzwuxhmUkpJktELmWQ":{"text":"I stopped here for a novelty hot dog while strolling around NOLA.    I was shocked at how ","useful":0,"cool":0},"nmy4cgsAtt3d78jb0XxALA":{"text":"We had the bacon Bloody Mary and it was delicious! The crawfish etouffee fries were yummy,","useful":0,"cool":0},"sHm1TXGOMSo72jK3fTTDcA":{"text":"For a cheaper, casual, fun place to eat and hangout you CANNOT go wrong with this place. I","useful":0,"cool":0},"xV0jkuT7Ia1Cejgdnbx7HA":{"text":"A friend recommended us to visit here. Excellent experiences! Good vibes, cooks we're havi","useful":0,"cool":0},"f97l3_Yanam14Vz5xgPUzw":{"text":"Good hotdogs. The Dat burger was over cooked but it's not Dat Burger it's Dat Dog so you c","useful":0,"cool":0},"ZZ-OsPSAQqDKYtSeMC3Wzw":{"text":"First time I came to new orleans, so I had to come to his restaurant and try out alligator","useful":0,"cool":0},"dnSS86pycnP6FeAzcZyblg":{"text":"I rarely give five stars but this place deserves it. All the sausages taste heavily like w","useful":1,"cool":0},"A_LySIbUa2UMln4vwS5poQ":{"text":"Had a hot sausage dog with onions, cheese, and mayo. It was beautifully plated and taste m","useful":0,"cool":0},"vLwhiXRHNtijBs1n5To9Lw":{"text":"Stopped in here for a quick bite to eat after walking on Magazine one afternoon. There's a","useful":0,"cool":0},"X1qjK1MVx8IWf2AQ-uZCSg":{"text":"Great spot after a long day of drinking.   I tried the all beef wiener with spicy mustard ","useful":0,"cool":0},"NMjBsVSgdsCyn1wZasokqw":{"text":"We visited this location on a Monday afternoon. It was something we saw on the Food Networ","useful":1,"cool":0},"DhReoEr5nL6cXXjNRR8i8w":{"text":"Simply great grubbing food. Cannot go wrong with anything on item. Would recommend the cra","useful":0,"cool":0},"2yUJPAROLET4X_0XA5r5aQ":{"text":"So dang good!!!! Do yourself a favor and eat here. You can create your own with your choic","useful":0,"cool":0},"bk5avieUickqSEhiqH4doA":{"text":"The Guinness Special was By far the best hot dog I've ever had and probably also my favori","useful":0,"cool":0},"VYOH3lnX_9VHcuuMORSXZQ":{"text":"This is in the \"locals\" section of New Orleans.  I was not impressed.  We just had a coupl","useful":2,"cool":0},"73ZBtg5G7SKIaMQ2HAuomw":{"text":"Not a bad dog.\n\nLook if your bouncing around the Quarter doing some shopping, maybe some q","useful":0,"cool":0},"hEh3aKZ-qF3abkoZncviHg":{"text":"Very average.  A hot dog is a hot dog kind of place.  The service at the bar upstairs was ","useful":0,"cool":0},"PdojxpJoUHNmxTEWrMJMaQ":{"text":"We ate around 2 pm on a weekday and there were more staff than customers.  It was a bit co","useful":0,"cool":0},"wEBXkrhSua2xql4kW1SlCQ":{"text":"Great neighborhood spot on Frenchman Street. When I went there were jazz musicians on the ","useful":0,"cool":0},"68-10AALaYjyk0tj9RJdGA":{"text":"First time to New Orleans and were excited to try the alligator and duck meats! A couple o","useful":0,"cool":0},"g4dEFBxzZyPYUQDs3en94Q":{"text":"We stumbled into this place fairly early in the night looking for a drink and maybe a bite","useful":0,"cool":0},"hXHhjkdxQL9ede16ZokO_w":{"text":"Let me preface this by saying, I spent the better half of the day drinking around NOLA bec","useful":1,"cool":0},"Zso2OsFiaMyFur0faQ4wpQ":{"text":"Walked in here because I was starving and it was close by, but it greatly exceeded my expe","useful":0,"cool":0},"2IbGHW2UbXiQmCrFUze9lA":{"text":"I read a Buzz feed article saying this place was a must visit. The menu was very unique an","useful":0,"cool":0},"VKWU7A-S__Z_ws9SVbs_Zw":{"text":"Heard the food was good. Sign was on and the street was lively. But me dressed in vintage ","useful":0,"cool":0},"P2bjC4AMdvfc6b3nqjIXFA":{"text":"I went here last night, which was my last night in NOLA, and the entire experience was fan","useful":0,"cool":0},"NcQj9dqY1lkDo3grsyvWyg":{"text":"Loved the food and service. The balcony above gives a nice view of the Fun going at the in","useful":0,"cool":0},"KU1cDFpuyxzjkGQRZn4BVA":{"text":"I have heard good reviews for Dat Dog and was pleased when they opened the location on Fre","useful":2,"cool":1},"vIp1nzzfknBURi3SJCbAfQ":{"text":"Great dogs.  Large menu with lots of options.  Upstairs balcony seeing provides a nice vie","useful":0,"cool":0},"kLMIdOT9QMup40nBzNaUjw":{"text":"Catchup is sour and the dogs are overpriced and the fries have too much artificial seasoni","useful":0,"cool":0},"Uk8mFZ2DlDBR_CurZdqWTg":{"text":"Waiter at Acme Oyster House recommended this place & recommended the special Duck Dog whic","useful":0,"cool":0},"m_G5nLJGSsz8YGin42SgBg":{"text":"First time at Dat Dog Frenchmen location! We came all the way from Austin with 50 students","useful":1,"cool":0},"u24peXHcUtHvG1PBNFBqFw":{"text":"If you go to NOLA, you need to be on Frenchmen Street. This is the place to eat while you ","useful":1,"cool":0},"N--iUVaXUJlol_Hmb5N_rA":{"text":"Nice location, phenomenal hot dogs but I have to say that out experience was ruined by the","useful":0,"cool":0},"61cxpCzt1GTlekrvV_Ba5Q":{"text":"What a great find! This place is amazing. I got the Chicago dog and my boyfriend got the b","useful":0,"cool":0},"3pepArsdPVWPE85j30WsQw":{"text":"Our bartender suggested this place and it was deff worth the walk! Crawdad dog, fire. Chee","useful":0,"cool":0},"BvLJ7ZEYgGO-pEC-BDdqhw":{"text":"Absolutely loooove the food here would give it a 5 stars for that... but the tables are di","useful":0,"cool":0},"5nXciKlnnfoMTeigjR_7kQ":{"text":"Screw these people! The takeout station said to order upstairs. The waiters said to order ","useful":0,"cool":0},"1fnjowI621x-pGtEPs88Yw":{"text":"I love hot dogs like no ones business and Omg the crawfish etoufee dog! It was to die for.","useful":1,"cool":1},"gX2JF2ghTG15uTmBBEtKGw":{"text":"every time I come back to New Orleans, dat dog is the first stop I make for food. the qual","useful":0,"cool":0},"WRaJll_86LHtgcs_wqCJwQ":{"text":"I never thought I'd enjoy a hot dog so much! Dat Dog is so much more than your backyard fr","useful":2,"cool":0},"h_P-mvda_5uBwdLO3wcCPA":{"text":"This place has a nice location on Frenchman Street near a bunch of bars with live music.  ","useful":2,"cool":1},"ldcu02GKycb7LccxEdCGGQ":{"text":"Okay - after eating here I went into a food coma. It was probably a bad idea to go to Dat ","useful":1,"cool":1},"p8FhGGx1yRqkYIW8Rew7Qw":{"text":"You either like hot dogs or you don't. if you do, this place should have something for you","useful":0,"cool":0},"zTIT5WjP1K9R8lSwb_kQ_w":{"text":"Not edible. Taste like they forgot about them. Used to like this place but has gone downhi","useful":1,"cool":0},"ek9QLD5AmL5JPA3zwOvIpg":{"text":"Delicious!!! If you want something off the beaten path, a location that will give your tas","useful":1,"cool":1},"ldsqME0KQm625-xTXaN6KQ":{"text":"We came here hungry but in the end couldn't finish all we ordered. Got 2 dogs (I had the G","useful":0,"cool":0},"OQ4p88CyemQfM1WfFJMCwA":{"text":"Came here on recommendations of a family member. Our server was Lindsey who was wonderful.","useful":0,"cool":0},"D_BtHw1VbFmTZOF7GCBWeg":{"text":"Tried the turduken dog and it was awesome.....definitely go out on the wild sideand you wi","useful":0,"cool":0},"ZGNsO6qeckv-_CUgQqcb_w":{"text":"I love places that cater to vegan/vegetarian needs and places that are accepting of all pe","useful":1,"cool":0},"G6M0a2FoSthAp7YN6HHZwA":{"text":"I got the bacon werewolf. It was definitely one of the best hot dogs I've ever eaten. The ","useful":0,"cool":0},"A83dng3Oov5Ikz47eoeIDg":{"text":"Honestly best hotdog I've ever had. If you ever come to New Orleans you need to stop here ","useful":0,"cool":0},"1esfD9STA0DADUI-Yn6gPg":{"text":"For all your New Yorkers and New Jersyians, Dat Dog is a fancier Gray's Papaya, only in te","useful":0,"cool":0},"lkpcFyUeXNkF1yYv7K-5Fw":{"text":"I had a very supportive and absorbent experience here at Dat Dog. David and Tack were both","useful":0,"cool":0},"bQNCyzWaVexvZZRPfNaVig":{"text":"It's a dog joint but stellar dog joint. I want to review the bartender, Nancy. Top notch. ","useful":0,"cool":0},"-LyLgaruaR67Yhx-4izKGQ":{"text":"If you're looking for some late night drunk food, this is the spot. It's high energy, loud","useful":0,"cool":0},"zRx44SBeEx3iLyHCqgwwrw":{"text":"Unfortunately I can't contribute too much to this review as I've recently had to eliminate","useful":0,"cool":0},"N6nfMw__mLlkk7cndV4BKg":{"text":"Great start to your Frenchman St experience! Love the hipster style, accompanied by the st","useful":0,"cool":0},"vodlK7jKNHUMLKph7xMRQg":{"text":"Great place to grab a hot dog after leaving the jazz bars on Frenchman St.  They have quit","useful":0,"cool":1},"f0hdsf2Md-TJU_HfRaJt4w":{"text":"I went to this place trying to find a good veggie hot dog but I ended up getting their Dat","useful":0,"cool":0},"UMXrm1zaBOBfTmCym9WkxA":{"text":"Whether you're visiting nola or live here, you gotta try this great change of pace from No","useful":0,"cool":0},"rDRY1RX20u7SeXjPuhcg6Q":{"text":"Dat dog did not disappoint. Friendly staff and awesome wtf fries. Definitely ask for the d","useful":0,"cool":0},"QRqrkVMi1eFgu267-xHFWw":{"text":"I have to say that the hot dogs and fries are amazing. We came with another couple and alm","useful":0,"cool":0},"-JKMeSirxPv83zlPhmPqeQ":{"text":"Not as good as I remembered. The crawfish ettoufee fries barely had any crawfish. The hotd","useful":0,"cool":0},"YD9oNIwmCqoOyMNKeijg4A":{"text":"Pros:  balcony seating, interesting hot dog menu, cheap good food\n\nCons:  A tad on the dir","useful":2,"cool":2},"UI-4yBFkuNpcmE336cbWLA":{"text":"I just need to give a shout out to eat dog for having a super tasty vegetarian option! I g","useful":0,"cool":0},"AUZUnv6LPxI3ige9RZtOAw":{"text":"I love Dat Dog, but I don't love this location. Way too crowed, and the food seems skimped","useful":0,"cool":0},"E4tWR2YcrMHVXgyibWPBxg":{"text":"They are really trying to expand their menu. I'm impressed with the new items and always i","useful":1,"cool":0},"C8f6alew1Ak5Tlck5GifVg":{"text":"Took like an hour to get two dogs. Bummed our buzz completely out. Should of known better ","useful":0,"cool":0},"MM-u0QTJ34StfNcPugjrSw":{"text":"Amazing flavorful creative dogs. So delicious and awesome waitress behind bar who suggeste","useful":0,"cool":0},"dBnm87_iy9U9nQec3-ONvA":{"text":"Lots of expensive places in the quarter, this is inexpensive location to get a bite and he","useful":0,"cool":0},"VNQWfvjuKkx9ir_EsTx-oA":{"text":"I had the alligator hot dog! I took the chef selection as I didnt know which toppings to p","useful":2,"cool":0},"BW6RheeDYkWlBZgRuYpEYQ":{"text":"Food has always been great to soak up the booze on a weekend out, but its been downhill la","useful":1,"cool":1},"9DeoR9buwC44O1LieaFrOA":{"text":"Tried Dat Dog for the first time today, and boy oh boy will I be back for more! My girlfri","useful":0,"cool":0},"ZgcbKp2Ym6kKus8px2Bq1A":{"text":"I dream of dat dog. \n\nBest vegetarian dogs ever!!!\n\nIf you don't get the chef special did ","useful":0,"cool":0},"j1J2YsgNNZIby62bRffYDA":{"text":"Hearty late night food on Frenchmen. The sort of salty, messy, hand-held food you need aft","useful":0,"cool":0},"9o9V2BNZ_7ymCP6MOqTlZQ":{"text":"I visited Dat Dog on the recommendation of a few people on visiting New Orleans, being adv","useful":0,"cool":0},"xvoqrzfU3Fo3JcgCCkc8ng":{"text":"So I've got two trips to Nola under my belt and only on the second was I introduced to Dat","useful":3,"cool":3},"gaQsg3FWrEhF--yZi55BtA":{"text":"Yay for so many vegan options!!! Such yummy dogs and fries and drinks. Place is a little s","useful":0,"cool":0},"FMVl77HQcRUfKDQ1nFCuqA":{"text":"I absolutely loved this place.  I was in New Orleans with friends and we had planned on go","useful":1,"cool":0},"feeN8HLOBbAeVi5MKR2Crg":{"text":"Great hot dog spot. I had a turducken sausage and left it to the chef to choose the toppin","useful":2,"cool":0},"Y0CdLdJPoVnW1dohHEgdMQ":{"text":"Didn't realize the veggie dog was a veggie patty, even thought says it on the menu so I di","useful":0,"cool":1},"l1UxHZ2iXc6zUAbTCl4AQw":{"text":"Loved this place was in town for a week and had 2 go twice!  They have a lot of different ","useful":0,"cool":0},"_HVIeMyta0bnxJy3XDonVQ":{"text":"My guinness dog was a tasty loaded morsel that really hit the 10:30pm late lunch spot. It ","useful":1,"cool":0},"rxtcO7p6YKZJ5KEq-rRhxQ":{"text":"- If someone didn't tell me I was eating alligator sausage (pause) I wouldn't know I was e","useful":1,"cool":0},"2k-17jn0nfDKOm0BVXFUhQ":{"text":"This place is a total blast! We went here a few times just to hang around and have some dr","useful":0,"cool":0},"ty1GV5oHrIYlJg1q8ZxWRg":{"text":"Nice little place on Frenchmen st. I ordered a duck hot dog as they were out of alligator ","useful":0,"cool":0},"F4HU0HnBYYjyQJfdS430rw":{"text":"Wonderful and great place to eat dogs.. The duck sausage and etoufee crawfish dawgs were t","useful":0,"cool":0},"6U2RMIEMr1W8xquUVN9oTA":{"text":"Fantastic food!! The crawfish sausage with etouffee sauce was phenomenal!! Great bartender","useful":0,"cool":0},"X0h7mGcrnmp623y0ABfYaw":{"text":"If you're in Nola, go here. Then go here again. And again. This place was amazing and quir","useful":1,"cool":0},"wiYRqYKhNf5qcaq60wdXRA":{"text":"I really should've been going home (the hotel), but time in NOLA was limited and I really ","useful":10,"cool":11},"blSBCxZe7wDHJv7NlQEU9A":{"text":"This place came highly recommended on Yelp. Unfortunately they had extremely poor service.","useful":0,"cool":0},"KeGDSiQgzabL1lUR_WkcoQ":{"text":"Last night, Maddy at Dat Dog on Frenchmen gave us the best customer service of any restaur","useful":1,"cool":1},"pji8Qox6W3mLjj33qmMzwA":{"text":"Great spot for friendly service, good beer selection and great selection of dogs ( gator, ","useful":0,"cool":0},"6Da64lrnMcgBp3R3AaEzMw":{"text":"This place really hit the spot after a long evening of drinking. First you get to choose w","useful":0,"cool":0},"JWwJUmh78XbH-w5f5YBAMA":{"text":"This is a truly decadent and awesome location. On awesome Frenchmen Street central to Fren","useful":0,"cool":0},"pW_FAq2Y_HaF9wBQPWbN2g":{"text":"I'm sitting at my desk back home in crusty ol' Jersey craving their cheddar bacon ranch fr","useful":1,"cool":1},"6xcqWzyD-l9mYPVjkLlfvA":{"text":"I tried 4 of their dogs. The meat itself was good, but all of the toppings on the dogs wer","useful":0,"cool":0},"mctJGHDCpUS1T5Qoijgk7g":{"text":"Great, kinda divy, little place. Art on all walls and the food is awesome!!! Good beer sel","useful":0,"cool":0},"6SNJG4lq4m4-UNLrvUhK1w":{"text":"The food is decent and fairly priced, but the service was unprofessional and slow. For thr","useful":0,"cool":0},"3a_qh-S7R-oZepaTpMvuow":{"text":"We have been wanting to try this place since it first opened. So, today is THAT day. It's ","useful":0,"cool":0},"U3Kq3ix37iFmKGm5OwiJkA":{"text":"Found this place by accident and was hungry from evening of drinking. Man what a great fin","useful":0,"cool":0},"NtInWbuq0WR6I1YdtCOSFg":{"text":"This place rules!  After having a horrible meal at a restaurant in the area we were still ","useful":0,"cool":0},"29pvbO8KTjeAYgcp0IbUdw":{"text":"This was by far one of the least expensive and most delicious meals we had in New Orleans.","useful":0,"cool":0},"QqBGfZaA2RUS0S82xWoOkA":{"text":"Really good hotdogs and right in the middle of Frenchman street, so it's  perfect after he","useful":0,"cool":0},"Y21oh0M_BdmnsEUjCHdmsw":{"text":"I dont get The appeal. It felt like a chaotic McDonald's. Granted, we went late at night b","useful":2,"cool":2},"pg-oKSHGNPO493RU4G_aFA":{"text":"I stumbled upon this establishment while walking down Frenchmen street. I ordered the vege","useful":0,"cool":0},"-atJ-bYz_smPV51muwfbGQ":{"text":"Great vegetarian options in a hot dog bar?! Yes! Be prepared to have your belly full at a ","useful":0,"cool":0},"DPUlxX7_xk3COE-i2tfk3A":{"text":"We got the Duck Special, blackberry sauce, bbq sauce, and bacon on a toasted bun. We split","useful":1,"cool":1},"CqvJiiuSjzyjSjSMXCgpYA":{"text":"This place is awesome!\n\nMy best friends and I planned a trip to New Orleans for a few days","useful":0,"cool":0},"DEjGr_gwmX8mtAz9BxgFeQ":{"text":"For 7.95 you get a build-your-own hot dog with unlimited choice of toppings. It was an aff","useful":0,"cool":0},"reJvDven8Boiur3cK0d3Tw":{"text":"I'm not an adventurous person with food so when I got to Dat Dog, everything on the menu l","useful":0,"cool":0},"mme2GLpUku6NiDfADoecfA":{"text":"Pretty Damn good drunk food. White trash fries were amazing and so was the aggregator saus","useful":0,"cool":0},"Iid0MLaFNbJLTJ_kB9gjDQ":{"text":"DAT DOG!!! With a name like that, don't you just want to scream it out in drunken joy? I t","useful":1,"cool":2},"1um7kx_1eQ7bJo8GT1mExw":{"text":"Perfect late night snack. I got the alligator dog with crawfish, etouffe and creole mustar","useful":0,"cool":0},"ndOHG8YVonuqQbzf61oemg":{"text":"Ordered our two hot dogs and waited for around 45 minutes. Food never came. We never got a","useful":0,"cool":0},"lLnGW8OBkQWo6YPdH7cXtw":{"text":"This was actually our second visit to this location but my husband and I enjoyed it just a","useful":0,"cool":0},"SXp2JNBItOL5YeJZV6S1og":{"text":"has the \"son of a saint\" hot dog. the gator meat was unexpectedly delicious, but i'm not s","useful":0,"cool":0},"_OrotWm2M6oqkoBhIodkcg":{"text":"Awesome people watching spot from the balcony down on to Frenchmen Street. Very good food ","useful":0,"cool":1},"g9c3zEgGKNpcbueQbMi2Qw":{"text":"Came here during our night out and this one was of our favorite food places. You order a s","useful":0,"cool":0},"k3g9tusNnV8Pc95wRNVTJg":{"text":"Those cravings you have...for the most amazing *fresh* french fries of your life...found a","useful":0,"cool":1},"Mm6LcY4V7yBcfaduteb1kw":{"text":"So my friend and I are visiting New Orleans and we wanted to grab a quick bite. We hopped ","useful":0,"cool":1},"4xQGcLbC__hQldWeHm9vaw":{"text":"I'm right in the middle on our visit to this restaurant.   We tried Dat Dog as a quick bit","useful":1,"cool":1},"SUqmTAWCjBdANkcER4Ck1Q":{"text":"So good and so unique. Loved the crawfish etouffe dog. Beer was cold, service was relaxed ","useful":0,"cool":0},"K6sLAIcd-rBHRSrOycXVEA":{"text":"So good!!  You must stop here if in Nola!!! The food is adventurous and delicious. Everyth","useful":0,"cool":1},"H3ubI3p53-TXauTqDWljfw":{"text":"Tried to get a bite and a drink here, and it wasn't busy - but it appears that if you are ","useful":0,"cool":0},"1eS7Qf2hTf3Udth3JOhVjg":{"text":"I have a deep love for hot dogs and Dat Dog did not disappoint. Well made, consistent, del","useful":0,"cool":0},"0ekwm8Hr33ds_P_SyzXmSQ":{"text":"What dog? DAT DOG!!!\nHoly balls this place was awesome.\n\nTotally worth the 20 minute walk-","useful":2,"cool":0},"sXxurLsUALjjChcQPmTpBg":{"text":"Great hotdogs! The only reason I didn't give 5 stars is because the chili is from a can (a","useful":0,"cool":0},"Ejea8DQQS5c-h5fUIlNq1g":{"text":"20 minutes later... \"we lost your ticket, it'll be out in 3 minutes\". I wanted a hotdog fo","useful":0,"cool":0},"RzLq0alIzXktfas7GcB7bQ":{"text":"This was the first real food I ever ate in NOLA. Great dogs and friendly and helpful servi","useful":0,"cool":0},"4xsedm69eUNVwDCzDktbuQ":{"text":"Had my very first Turducken hot dog and loved it. Highly recommend this place, prices are ","useful":0,"cool":0},"wfxecTIO8gmjfvLazOYCaw":{"text":"They put blueberries on a duck hotdog! I don't know what genius came up with this idea but","useful":0,"cool":0},"YD0_5Dly0Dnu7Fl9wTVMxg":{"text":"No one loves a good Hot Dog more than me; well maybe Drunk me does ;-) \n\nBeen feeding my d","useful":11,"cool":10},"3fS5sY-Ub_k-9eOM74yq_A":{"text":"Good sausage. EVERYTHING ELSE WAS TERRIBLE. The whole experience was perturbing. Why would","useful":0,"cool":0},"owhKprTeauMsrm60wboulQ":{"text":"I eat here three or four times a week. The dogs are incredible, and with so many options t","useful":0,"cool":0},"LiDn7wAbTRZBsdi_LZtnow":{"text":"If I could give more than 5 stars, I would! My friends and I each got something different ","useful":5,"cool":4},"2I1YkN7U0_AG1-e68bHegA":{"text":"Had the best hot dogs of my life here. During my short trip to NOLA, we ate here more than","useful":0,"cool":0},"gPaIT7Fgx-sN0qg9sj95NQ":{"text":"Went in with a large group, and we had a little bit of everything.  My order, he Guinness ","useful":0,"cool":0},"IR6uRnS-aWG0ELLsBIdYSw":{"text":"Some of the best hot dogs I've had! Great variety and the tot specials are so good. Servic","useful":0,"cool":0},"XPbkPobZcA2OHWL-KqS31Q":{"text":"Rude service. I asked the bar person about a drink and he told me rudely I don't know and ","useful":0,"cool":0},"sxIFWI_Yy1Yfs4gmR8G8oA":{"text":"Excellent spot for a quick meal. Loved the fact that they had vegetarian options (that tas","useful":0,"cool":0},"VHsrUA-MIDbADdfVLsIsCg":{"text":"Dat Dog was a blessing at 1am.\n\nStaff, pretty cool.\nFood, pretty good.\nFast service. \n\nI'm","useful":0,"cool":0},"rMoBiiM4hxZh4n5gNas5gQ":{"text":"So happy we found this place! Random location, off the beaten path of the typical Bourbon ","useful":2,"cool":3},"2zxFZovm2Y2pmIwkx-6zEg":{"text":"So I am an avid Dat Dog fan! I just got married and y'all were on the list of \"must eat\" p","useful":0,"cool":0},"QprXfK8SIjHQtyp9j_i6Ig":{"text":"Managed to get here during happy hour, so our beer was 1/2 off. Husband had a dog not on t","useful":1,"cool":0},"uRMFdGB5zV0gEL0Dkx1upw":{"text":"My meal was really good! I got some sort of burger dog and seasoned fries. Menu seemed to ","useful":0,"cool":0},"qAqJscfqif_-NRMiLLm5Yw":{"text":"This could be the best hot dog ever.  I come from Detroit - Home of the coney, so I have j","useful":0,"cool":0},"8xLUNWPsw8_eXbjBijbp3Q":{"text":"I wish I could give a negative rating. I waited over 30 minutes to order and then everythi","useful":0,"cool":0},"_YlK_EfQT1i5Kt2zkx9msg":{"text":"Excellent! Excellent! Excellent! Just walk up to the bar and order.  If you sit and wait, ","useful":0,"cool":0},"QHmEjvc2kSm4VXPOTBnVfw":{"text":"My friends and I came to New Orleans to eat, drink, and be merry. Dat Dog really checked o","useful":0,"cool":0},"lXFW0il6PaKsCvCdKCn27g":{"text":"SO sad they ran out of alligator :/ but we had the veggie dogs and it was good! Fries are ","useful":0,"cool":0},"3CuH6pphyuVetEBpil9S1A":{"text":"Food, beer, and staff make this a New Orleans favorite for me!!! Crawfish sausage and Dat ","useful":0,"cool":0},"DoqmUMd45070rUGU8S560Q":{"text":"We came for fried chickens and frites. We ordered a hot dog with two pieces of chicken thi","useful":0,"cool":0},"D0u2K5swd74YuXlG3tfTIQ":{"text":"Our group had a particularly terrible experience on Saturday, January 26. We were a large ","useful":1,"cool":0},"i9EBQBw27yMlS-ollpZk1A":{"text":"First time in a Dat Dog. We had the Chicago Dog without tomatoes, an Alligator Sausage wit","useful":0,"cool":0},"VDGaVVqbPIlWJKsqr8cE6Q":{"text":"Went on a Wednesday night for dinner; was a slow part of the night. Good local beer select","useful":0,"cool":0},"MR7Y_LYquLO114zREafDng":{"text":"The most incredible dressed up dog I have ever eaten. You walk in the door and just know t","useful":0,"cool":0},"sHE4506AJ70bDWBmIOlrSw":{"text":"My boyfriend and I stumbled across this place on a recent trip and absolutely loved it. It","useful":0,"cool":1},"KfEFtuiM5wdAE8C8K2Y7jA":{"text":"Fantastic. The service, the food, the location is all great. Sitting upstairs on the balco","useful":1,"cool":0},"5WqwGe9_7Rh0BfyKYeBc2Q":{"text":"Decisions decisions!!  It would be so hard but luckily they have some great combinations a","useful":1,"cool":0},"3Boe_0eiQ9QWi1TLSBvVSw":{"text":"I'm not really a hot dog person but they have some good dogs. I had the crawfish dog and c","useful":0,"cool":0},"PulDZL09FDqOhfZMPi7SaQ":{"text":"OBSESSSEED WITH DAT DOG, DAWG. I have only been to New Orleans twice but have made it a pr","useful":0,"cool":0},"m9lYwxXBQbVa6gKcmGz2Uw":{"text":"Delicious dogs and fun atmosphere. Didn't notice the balcony seating until after we left, ","useful":0,"cool":0},"KLyKHZB4PnFaB3EX7QjUhQ":{"text":"This is a great place! The employees are very hospitable and the food is amazing! I tried ","useful":0,"cool":0},"ow4EU8z89oLbZmFmF833Rw":{"text":"Dat Dog never disappoints. I've been to this location a few times and I've always had grea","useful":0,"cool":0},"xb_FTYMNBpryA1w3x8p9RQ":{"text":"Everything was mediocre (service, quality, taste), prices for dogs were very high.  Was re","useful":0,"cool":0},"wdP9VcutmYIbHp4EmAfBYQ":{"text":"This was delicious. My friends and I all got different kinds of dogs and there were all so","useful":0,"cool":0},"hTEJm4-FDSW6huA62Vmjjw":{"text":"Simple menu, but some great food. Be forewarned that most of the \"dogs\" have pork products","useful":0,"cool":0},"pApV_5bCyfJubJ6NqN41vw":{"text":"Came here on Sunday February 15 on Mardi Gras weekend.  They should have closed the restau","useful":3,"cool":0},"1Psn41RNF9WRFKAvo7zNuA":{"text":"Good hot dogs, cool vibes. The place itself is a good stop to make after drinking or liste","useful":0,"cool":0},"26fv2upX85FkqWuOQ4Hg1Q":{"text":"Fabulous! Ate my Guinness dog before I could take a pic, it was amazing. Bacon, onion, che","useful":1,"cool":1},"s57DuPG-QGDiq_BYRMVCFw":{"text":"Hands down, the best hotdog spot i have been to outside of cooking them at home. Located a","useful":2,"cool":3},"HblfG_a1TfJBBShBLQ9idg":{"text":"For an everyday hot dog joint... Dat Dog is one of the best I've been to. As someone from ","useful":0,"cool":0},"wlYDi0I6Oz4S4QPwA7Gu6w":{"text":"I've come here on consecutive weekend nights at about 8:30. Yesterday I ordered to-go and ","useful":1,"cool":0},"wbjEPOQtI5mGZJiaTUqcfw":{"text":"This was our late night / fourth meal choice while bar hopping in the area during a recent","useful":0,"cool":0},"hHU3pPiM6Rw2Tlg1TSpB6Q":{"text":"It's always fun here. The staff is amazing, and the food comes out quick! I love their veg","useful":0,"cool":0},"tIcR7cLcVv4ndcVCqd_dHQ":{"text":"THIS PLACE IS AMAAAZZIIINNGGG!! If you are in New Orleans, you MUST stop here!!! The envir","useful":0,"cool":0},"zOTAyqMjhqB8Phw7Rbxsog":{"text":"Should have walked out when I walked in!!! As I'm walking in,there's one of the gutter pun","useful":1,"cool":0},"CIv9sFZBae_Mc_NxJrYvkQ":{"text":"It's crowded, loud and noisy, but you are in New Orleans so enjoy it!   Staff is so knowle","useful":0,"cool":0},"dWrZQN6scNWiK7pXv_O2Mg":{"text":"Delicious dogs! \n\nThe bread is soft, but not soggy, the sausages are filled with flavor an","useful":0,"cool":1},"PzQ2UG6xonQnCqo4B4RPBw":{"text":"Great hot dogs, below average service. Not sure if they are going for the I don't care att","useful":0,"cool":0},"AW3yffu0OwJNJd0a2GOu0g":{"text":"I noticed that Dat Dog had vegan dogs,  so we scanned the menu, decided on a dog, the fiel","useful":0,"cool":1},"yFtuENEv9nbuwM7VNZQ6NQ":{"text":"This is one of those legendary places in New Orleans near all the fun activities. Definite","useful":2,"cool":2},"jCLjgzzotdEleWIj0jNV6g":{"text":"I think Dat Dog was one of my favorite food joints we went to while on our first trip to N","useful":1,"cool":0},"zkoSE0_BwZ2A6lG_1OmUqw":{"text":"It's hard to get excited about a hot dog.  I mean..it's a hot dog... but THIS PLACE? I hav","useful":1,"cool":1},"8nCKsQQsQoWS8djj48CLWA":{"text":"This unique spot gives a yummy twist to hot dogs. My fries were a bit cold, but the season","useful":0,"cool":0},"zSlz_-RGPE58_Nto6c-5CQ":{"text":"Y'all I love this place so much. You cannot have a bad time at Dat Dog. The food is great,","useful":0,"cool":0},"TGrQZGoG5RBJFdQ6eImTiw":{"text":"Was in Nola for 6 days in April and me and my crew of 7 went here every single day. \n\nEver","useful":1,"cool":1},"sCvW8COb2oGQkz0Ukrmozg":{"text":"We had the bacon werewolf dog, crawfish étouffée dog, crawfish fries, and WTF fries. Every","useful":0,"cool":0},"DClIGC0f1GiQhbjOeAHPzw":{"text":"Delicious!  Though,  I have no dietary restrictions  (other than, must be yummy), I did ap","useful":0,"cool":1},"8dLQUVFwZmxcD8_biGuA4A":{"text":"Food is excellent. Not so much a fan of the ordering process. You pick what you want and t","useful":0,"cool":0},"rfZ7GyHpGh6AI38-F8z7nA":{"text":"This place is a stable of NOLA and a must see! The place was packed - it was a Saturday. T","useful":0,"cool":0},"Ymecup1e-G4i6kZhwTXObg":{"text":"This place rocks! High-end hotdogs and fries, y'all!! We had Jimmy's Chicago dog (not supe","useful":0,"cool":0},"6o8yueKedUxyVKC52_HuHw":{"text":"These guys have such a delicious take on Nola food in the form of a hotdog. Trust them to ","useful":0,"cool":0},"-FgEuV6RC2mJgeHufe67Vw":{"text":"This place was just okay. We came in to try some food and nothing taste over the top. And ","useful":1,"cool":0},"P5JOfckiRHr4Q6PJN0APNQ":{"text":"Another solid location of Dat Dog in New Orleans. The Frenchmen location is great for eati","useful":3,"cool":0},"Vtoi6a_862Qtbe5w3hLxVQ":{"text":"Loved this quriky and casual hot dog spot! There are so many hot dogs to choose from, even","useful":3,"cool":2},"9FFn_oolvAdqRbDMni87_A":{"text":"Great place for late night meal.  The GBLT was great as was my grandson's bratwurst dog. G","useful":0,"cool":0},"LxwxyG2ACYdlRojo8X0cvQ":{"text":"Fries were awesome but they ran out of buns.... but then after we got our fries we saw peo","useful":0,"cool":0},"wAU5EhWWgynQ_WfWdY0RyQ":{"text":"Always busy! Dat dog maybe compared to dirt dog of Los Angeles. Same great taste but the s","useful":0,"cool":0},"OOdSlxYs5kRy1JPKoijW_g":{"text":"Out of this world hot dogs! Amazing flavors & unique combinations! My hot dog eating exper","useful":0,"cool":0},"EFxXiCw1KUbPkd6kQIcArw":{"text":"Not the best...way too much condiment on the dog. I literally had 3 bites of straight must","useful":1,"cool":0},"k3TBjTMzIsRgHM1k-85xow":{"text":"Almost not fair to compare to other hot dog places. The hot dog/sausages are the best I've","useful":0,"cool":0},"yOi0EytB7cvBDhSNJxsHUQ":{"text":"My bf and I came here after buying some art from the vendors across the street. I had the ","useful":0,"cool":0},"eVGIIcHJeu5WlS2BWrGyNA":{"text":"Everything on the menu is delicious! They offer vegan dogs also!! Each location is bright ","useful":0,"cool":0},"MwYgfEUc9I-enTG5kHF6NQ":{"text":"Always an OK experience when I visit any location. Maybe I'm not a hot dog enthusiasts so ","useful":3,"cool":2},"ma32iclqF2XLtl3NXa9sxw":{"text":"My lady, & I were recommended Dat Dog while in NOLA for vacation last week. \n\nGreat Hot Do","useful":0,"cool":0},"iGscNTVL41xXZNqMQ7Hv-g":{"text":"Jacob S Is a racist bartender. Do not visit this bar! You will get judged and treated like","useful":0,"cool":0},"Z3MPH6WA6OFdQRrOKOYO9A":{"text":"Staff was excellent, food was so good. Will definitely come back to this location when in ","useful":0,"cool":0},"HpRv8RaTfLobrSfe61v7IQ":{"text":"Food was great.  I had the alligator sausage dog which was spicy and flavorful. \nOn the ne","useful":0,"cool":0},"yCyW14a1LBIetOpMfmrmhg":{"text":"Never have a single negative thing about this place the food is awesome the vibe is great ","useful":1,"cool":1},"BzM7NhdO5KdVTdO2kJFYEw":{"text":"I read the reviews, I scrolled through articles and articles of recommendations - but stil","useful":4,"cool":5},"1tECQiHTaGu1v6OhYEQghw":{"text":"A hot dog Haven! This place has my favorite fries in the city and great veggie dogs. Delic","useful":0,"cool":0},"xyRdsqujjbVazob5JCj5MA":{"text":"Awesome experience. Loved the paintings and drawings all over the place. Great for photo o","useful":0,"cool":0},"xKzlhah5JJgCVVZA0JguSg":{"text":"Being a fan of unique, tube-shaped meat, this was bookmarked for my trip to NOLA ever sinc","useful":3,"cool":0},"G7YST7xxAGIry_06OJO7aQ":{"text":"Ok so I'm a local here in nola I love Dat Dog the food is awesome & inexpensive! I visited","useful":0,"cool":0},"JwP9CVltlkavO0SFD5bSrQ":{"text":"Excellent! Visiting New Orleans and wanted a taste of home. The kielbasa was great! Also e","useful":0,"cool":0},"xNXf7l2ULHZyPhn215BKgg":{"text":"Hot dog place located Near French market, New Orleans\n\nI had the son of a saint dog- allig","useful":1,"cool":0},"8CJMcxEmTL5LeV5QPHeR5g":{"text":"My kids normally love hot dogs but didn't care for these. My beef dog with customized topp","useful":0,"cool":0},"Yn5X9Qb71pwnve6DJ8wQ3w":{"text":"We were a party of four on 4/17/19. My vegan hotdog was outstanding (sauerkraut was perfec","useful":0,"cool":0},"2Id5pWVuRXPB9pL5CzBh1A":{"text":"Who would've thought blackberry jam on a hotdog would be amazing?  I ordered the vegan Smo","useful":0,"cool":0},"BnGp9R2hXC5jNpN4Culosg":{"text":"I loved it here! From the amazing service, delicious drinks, and infinite options for hot ","useful":2,"cool":2},"YYE5mdL0RplVG3McSldn8A":{"text":"Hits the spot, when you're drunk off booze and have had your fill of some awesome jazz mus","useful":5,"cool":5},"07sKBamRt-tnMjgXVsataA":{"text":"Food was excellent and extremely welcome after a long day of bouncing around the city. Dar","useful":0,"cool":0},"C8O8omCh1GWHvPtNacwy8g":{"text":"Loved this little hotdog shop!! I had a crawfish ettouffe (sp??) dog because i really want","useful":1,"cool":1},"tosSOLgIMpqsrDiVBBf5JQ":{"text":"I have never seen so many options for hot dogs as I did at this place and so many options ","useful":0,"cool":0},"3Y5vlK87nN-C-YuSX9Ubwg":{"text":"1/20 My friends and I are in town visiting NOLA for the first time! We were recommended to","useful":0,"cool":0},"p035Pxxisxp0rv6AFTK-4w":{"text":"Maybe if you're hammered and you need something then this is really good. Not being in tha","useful":1,"cool":0},"sJgj1wNCvfrzFNI2HGWrQg":{"text":"I've read about this place on a few travel pages, and I was glad to finally come here. The","useful":0,"cool":0},"uud1Ffpv93pHUxefY09E9g":{"text":"Super solid spot for drunk food. The dogs are all good quality, really flavorful, and dece","useful":0,"cool":0},"1f77eoXu3bxSGHJsgr-HuA":{"text":"I wish they would hurry up & open one up in Baton Rouge because this place is amazing! I o","useful":5,"cool":1},"14WdYMTfX4032qddeG5O5w":{"text":"The environment is laid back and welcoming. We took our kids, but probably not a good idea","useful":0,"cool":0},"otn5SxmNtFbtdMxyoIlKZA":{"text":"Hands down one of the best hotdogs I've ever eaten. The hot dogs are unique and very tasty","useful":1,"cool":5},"WGZa0WGoTZpYGQiHBEtsUg":{"text":"Service: 10/10\nFood: 10/10\nCleanliness: 10/10\nPrices: 8/10\n\nWould I come back?: Yes! \nLove","useful":0,"cool":0},"8zx6khRX6d0MY5peBjA_Vg":{"text":"Good quality hot dogs but the sausage is on the smaller side. Staff could be nicer. Bathro","useful":0,"cool":0},"_aTgL03C8y2oxW4emCDHtQ":{"text":"Just fkn amazing. Great staff.  Great bartenders and constantly amazing dogs.    The gator","useful":0,"cool":1},"mmgGhCrqOCmTko162CTiHg":{"text":"Definitely come here. Casual dive bar meets gourmet hot dogs. Happy hour daily with good s","useful":1,"cool":0},"uzC85s8_6jVWh6QihHXUqg":{"text":"Who doesn't like An All American Hot Dog,but only the brave of heart or incredibly intoxic","useful":0,"cool":0},"8BJgdlp4awTcTHbRp4nwjQ":{"text":"Passed by Dat Dog on Frenchmen Street on a Saturday night and saw that it was packed. Neve","useful":0,"cool":0},"i6L_6TFYJKkP5qgR8-YEKA":{"text":"Wasn't wowed by the dog. It was a little dry. Still pretty good flavor. Had the duck somet","useful":1,"cool":0},"KWk4P0nCdjKjiaRAa_PPqw":{"text":"Came here after a day of day drinking and had the beat dawg ever! So many different option","useful":0,"cool":0},"TfUWsfSFIID2VJCRgNKzlA":{"text":"LOVED THE ATMOSPHERE!!!!!!!! Was not impressed with the food.  Ordered a Kielbasa...it cam","useful":0,"cool":0},"8W8JCC7ekg7Iw-4zKzlbpg":{"text":"Trash, garbage, dirty. Classless bartender. You know, like a cool, smart guy, that's fill ","useful":0,"cool":0},"BYOMsRWusCD1c2QEXRqsqg":{"text":"Nancy gave us a 5 star experience last night. Thanks for letting our buddy sleep on your b","useful":0,"cool":0},"7-PiBm-K67VZaeWJCa86kA":{"text":"So this is the ultimate place for drunk munchies. Located conveniently on Frenchman among ","useful":0,"cool":0},"6QpOX4UpsAowNdc5eBAoRA":{"text":"Where to start?  Dat Dog on Frenchmen's Street is, first of all, wonderfully funky place. ","useful":1,"cool":0},"hT6jRSiyXvJptu7Wcrt6Hw":{"text":"Their buns are delicious!!!! I think they're homemade & they grill them up perfectly!!! Th","useful":0,"cool":0},"GvNx_980vhAj1lfdYGzzxQ":{"text":"So many dog options! Loved this place and quick service! Really enjoyed the menu and varie","useful":0,"cool":0},"i6S4oMs1NfJJ4VpljTFALA":{"text":"Made a quick stop in here & it was a great choice! Loved the environment & the food was am","useful":0,"cool":0},"ow8q-S4Olbr6oARl1eE99Q":{"text":"By far the worst food I had in all of New Orleans.  How the hell do you screw up a hotdog?","useful":0,"cool":0},"llkCXiZqKK_S0TXHXvaGTg":{"text":"We got here around 10pm, the first floor gets busy, so head up to second floor, it's less ","useful":0,"cool":0},"Vfen5KLPNwdYSUrS7hljqw":{"text":"Perfectly imperfect very late night joint. We were a table of 5 great menu with a huge sel","useful":0,"cool":0},"rQ65iNgJruBLcdWdWZlPog":{"text":"The worst thing about Dat Dog is having to choose WHICH dog to get! But the bartender was ","useful":0,"cool":0},"jhTMVyW1HNhxBh6z35aDpw":{"text":"Oh my god this is great hangover food! Ok I didn't actually go here when I was hungover bu","useful":1,"cool":0},"Haqt18jpWIutsJ6b8D-lOQ":{"text":"We arrived to NOLA and first thing went to Frenchmen Street to walk around and stumbled up","useful":0,"cool":0},"odfOdeaZKWilW6BUPKFW6A":{"text":"Went Saturday Night Marti Gras weekend, understand it was super busy. Ordered 2 hot sausag","useful":0,"cool":0},"jzcHBLueSQ6qFzxUDas8sw":{"text":"Great dogs. I had the Alligator Sausage and chose the Chefs Choice. They put grilled onion","useful":0,"cool":0},"yak296m2BDNdtd0W0Rhsug":{"text":"Decided on taking a few blocks outside of the French Quarter to have lunch at dat dog. We ","useful":1,"cool":1},"_E9IzlxIHtbHQ3oSfHEN4w":{"text":"The first night, I ordered a polska kielbasa. It was the opposite of what I expected. The ","useful":1,"cool":0},"8566sBD-agBP7hneopYWdQ":{"text":"Hoping Dat Dog checks Yelp quicker than Waitr since I've been waiting for them to acknowle","useful":1,"cool":1},"8SB8RXmTw783jNknaBXGdg":{"text":"VEGAN FIND!!! It was national hot dog day and I was walking down the Jazz area of New Orle","useful":0,"cool":0},"s2Xz3ARl0v2w-gbx6s1uug":{"text":"Please, for everything that is important and sacred, order the 'andre' - a secret dog, not","useful":1,"cool":1},"g-HbijTnQOI0A1QT34cFbQ":{"text":"Moseyed in on a Friday night, sober and just enjoying the vibe in Frenchmen St, and decide","useful":0,"cool":0},"xPAREwZ_ZoQY1fLYtz5wnw":{"text":"This particular Dat Dog location is my favorite because I love Frenchmen Street. This loca","useful":4,"cool":2},"sjZzPql7tqUfrKAU-RchnA":{"text":"You may think a hot dog is just a hot dog if you hadn't been to Dat dog, but these are not","useful":2,"cool":3},"tF7bdCd01wnW4wG5XmoxGw":{"text":"Best hot dogs I've ever had, hands down. First of all, the hot dogs are thoroughly cooked.","useful":0,"cool":0},"d7gxRuS68nRtAqu9teFoRg":{"text":"Located in a great place with lots of bars & free music. I ordered the alligator sausage &","useful":0,"cool":0},"5zO276coaic3lPT2ZyxV0A":{"text":"*Came here over Labor Day weekend\n\nWe had multiple recommendations to come and check out F","useful":1,"cool":3},"kEfE5JGxJJoIzVDuKGwG2w":{"text":"Yum!! I'm not a seafood fan, so I was searching for something my girlfriend and I could bo","useful":1,"cool":0},"exSpwJW4LZysjdku2gJJcg":{"text":"You really can't beat a good hot dog and fries to soak up the booze...while alcohol typica","useful":0,"cool":0},"dGTXdJJUjOwSxA2HSufsaA":{"text":"Came here to try the Chili Cheese Fries that other reviewers said were great. \n\nI. Was. No","useful":0,"cool":0},"JDvPDfaqlieyp4I09iXmYw":{"text":"Hands down most delicious dog around!!!! Amazing toppings. Dog done to perfection! Fries a","useful":0,"cool":0},"foPMqHf0jfBuD-PIBklOKA":{"text":"This was our first destination of 2019.\n\nWe got here right when they opened on New Year's ","useful":0,"cool":0},"n8Xpi6jQTLIoBhg2do0eqw":{"text":"I wanted to like this place..I love hot dogs. But maybe it's just this particular location","useful":1,"cool":0},"6KpMJ1zxpOetBxqQIgSsAQ":{"text":"I am not a fan of hot dogs, but I love Dat Dog. I was absolutely surprised at the selectio","useful":2,"cool":2},"s0og5l_pPIhrb-FpqKpF6g":{"text":"Great dogs you will never have anywhere else and great dogs you enjoy anywhere, anytime! W","useful":0,"cool":0},"kIAe3eMgcNaQnzxo-jukUA":{"text":"Great late night food! You order, pay, sit down then wait for your delicious dogs! I try t","useful":0,"cool":0},"c9RTOUiA-OQlPUsnOcb9Gg":{"text":"The crawfish dog was sooooooo good and so was the alligator sausage. Such an unexpected hi","useful":0,"cool":0},"-T9owAm_j8ZblUAABVHtvQ":{"text":"bartender was incompetent, serving people out of order, and the place is mismanaged. only ","useful":0,"cool":0},"V_745Y4EaVQ14mOD8O9lfQ":{"text":"Hot dogs are so good. Staff is friendly and fast. The drinks are great too. We make an eff","useful":0,"cool":0},"AgBkHM3JjA3lZbE-VFptvw":{"text":"Perfect spot to go after a few beers on Frenchmen street. My Bf doesn't eat pork so it's t","useful":0,"cool":0},"MfBtOKGV1hKPDLPfdfAiJQ":{"text":"Worth the hype! Who knew that a hot dog restaurant could be sooooo good! The food takes a ","useful":0,"cool":1},"y2erfIrmCya5W8ji6y0Snw":{"text":"We visited this place solely because everywhere else on Frenchman St had a two hour plus w","useful":2,"cool":1},"QXhIbhvPejP_4HWy8116yg":{"text":"The hot dogs I tried were delicious. I wanted to try everything! Pretty hip and cool. Happ","useful":0,"cool":0},"S_VGXWAkVa6SwSxjI40lIg":{"text":"Dat Dog Haikus Part III\n\nPart II is here - http://www.yelp.com/biz/dat-dog-new-orleans-6?h","useful":7,"cool":7},"oC80IZ9Oc01a5qIcDBkSQw":{"text":"I love Dat Dog! One of my friends put me on this place the first time I ever visited NOLA ","useful":0,"cool":0},"o9bO5Jq3En6qUPrGYE_L7g":{"text":"This was the perfect lunch stop on our trip in New Orleans. We opted to sit at the bar ups","useful":2,"cool":1},"avdNBfbMphqjdjjWhGgbrQ":{"text":"One of the best hot dogs we've ever had. We will never come to NOLA and skip coming to thi","useful":0,"cool":0},"lMBsc5log3oQnP_FjsIHjw":{"text":"I was really looking forward to coming to eat here at Dat Dog until I actually got here. T","useful":0,"cool":0},"5R6pfFGp79co0SV0j3EFFQ":{"text":"Everything about Dat dog was perfect from the atmosphere to the food. The hot dogs are phe","useful":0,"cool":0},"BfwjPsKPcwt-T8flPTSRZQ":{"text":"As a patron, I truly don't expect much. All I ask is that I receive what I order, whether ","useful":0,"cool":0},"WWmR61YkU-zGVniJ66fNYw":{"text":"Dat Dog was dat delicious.  Highly recommend for their funky take on hotdogs. The variety ","useful":0,"cool":0},"kPSUtlIpcnwWAPoO1oZCyw":{"text":"Well, I must say the service we received from our very large \"request specific \"order was ","useful":0,"cool":0},"43Z4D3dplffQm5NICgQF9Q":{"text":"Perfect dive to eat food to absorb drinks. Went on a crowded night had to flag down our wa","useful":0,"cool":0},"PJ0s2_8J38XbbkPNkbi0Vg":{"text":"Just don't understand the hype of this place. After seeing it on Food Network and recommen","useful":1,"cool":0},"8veydyNHm9H64pHALxeUfg":{"text":"I went here for the first time! Hotdogs were average and the service was ok!  The fries an","useful":1,"cool":0},"87Uz1wSQYSacYzbnhegBvQ":{"text":"One freaking word...YUM!!!!!!  I'm personally not a big hot dog eater but the Bacon Werewo","useful":1,"cool":0},"7U1qhORHvHhxV8u58w_aww":{"text":"Dat dog has by far the best vegan hot dog you'll ever have! And they have multiple options","useful":0,"cool":0},"pn3_CN3rm7YnELO0n9tUHg":{"text":"This place gets only one star because of the artwork on the walls.  The lady at the bar ta","useful":1,"cool":0},"VU5xvpjyujRMniTut75sNQ":{"text":"Wow, what a dog. Food was amazing and perfectly cooked. Happy hour menu had 5 dollars dogs","useful":0,"cool":0},"gJZH9wJA3hR_hU5poa9pTQ":{"text":"Best drunk bacon ranch fries ever! Really appreciated the speediness of the people working","useful":0,"cool":0},"omdJDi1N21meHo5DaYGTQA":{"text":"Delicious hotdogs with unlimited toppings. - can't go wrong. Also has a great balcony view","useful":0,"cool":0},"crKndF5EPxDAEPoVOVF62w":{"text":"The atmosphere of this place is good and food is great. I got the Dat Chick and my husband","useful":5,"cool":5},"lKUbDg2HYpKLJyXyZSBN3w":{"text":"We needed a break from all the New Orleans cuisine that was seafood. We had stuffed oursel","useful":0,"cool":0},"SpjyuDFgIQhppKB3wqfKPg":{"text":"Came here for some eats after visiting a few of the music venues in the area. It was karao","useful":0,"cool":0},"5L6roNR-74hHGwpwtBdvgg":{"text":"I got the alligator dog with Creole sauce, grilled onion, bacon, and blue cheese, as well ","useful":0,"cool":0},"40ETZwLyjcHKXFmecpqwEQ":{"text":"Great hotdogs in Nola! You can choose from one other specialty menu items or customize one","useful":0,"cool":0},"Y4WNXXodFHzGkSWSFlTUbA":{"text":"Had the duck sausages and I thought I died and went to food heaven. Great flavor, good sna","useful":0,"cool":0},"rfb9d1eg1BHQvDAzEcIW4w":{"text":"So this place is my everything. It has hot dogs and the upstairs is full of Star Wars stuf","useful":2,"cool":3},"lYOqKvqScsiJadZV_t-B5A":{"text":"A super customizable Hot Dog/ Sausage. Any way you want it, that's the way you need it. Pr","useful":1,"cool":0},"iszEBESy-U1erofugtLUrA":{"text":"We came here with high hopes for their veggie dogs.  They were out of vegan werewolf, all ","useful":2,"cool":0},"Ag6COZxKjlRGrnhF_SwpwQ":{"text":"Good af!!!  Perfect drunken meal. We weren't planning on going here for dinner but ran out","useful":0,"cool":0},"136AcKJBNyMEWiMz-YbetA":{"text":"Wide selection of different hot dogs and definitely a must stop while on Frenchmen's Stree","useful":4,"cool":3},"0SJPTf0Spl_eYPx3RX5oKA":{"text":"Best hotdog place in New Orleans! I loved it so much that I went twice in my 3 days stay. ","useful":0,"cool":0},"ymeyxB2oVafqsAzhotA54A":{"text":"MyGirlfriend and I love to visit this place every single time we go to New Orleans the Hot","useful":0,"cool":0},"j15GN53RcSgsHqVa2xUlPA":{"text":"So tasty! Perfect dog, awesome service! I got the crawfish dog special and would have it a","useful":0,"cool":0},"lFAUS_Nnr3whSqJULVQvRA":{"text":"This place is a joke....way to busy to have any customer service. And if I am perfectly ho","useful":1,"cool":0},"bEyoGIoGrxNSRsrSfq_o9Q":{"text":"Had the rougarue dog, duck dog, and crawfish etoufee tots and I thoroughly enjoyed everyth","useful":0,"cool":0},"bj5g6_ihu8Tf0A9vHRP3EA":{"text":"Four of us dropped into Dat Dog after we had finished a few rounds and a hand grenade. So ","useful":2,"cool":1},"pRJuKD6zySVC-2x8eHcFUg":{"text":"Y'all HAVE to come here. I had the hot sausage with blue cheese, bacon with that blueberry","useful":0,"cool":0},"LTOLrzBkfFrRjCvDyY-QnA":{"text":"The BEST hotdog hands down that I have ever had! I have eaten at the Dat Dog in the French","useful":1,"cool":1},"4lraQcMtNREbMjcFMJb4BA":{"text":"I'd heard horrible things about the Frenchman location, and on my first trip there they se","useful":0,"cool":0},"kt1p9S_x6T6XG-4FO--szg":{"text":"I am writing this review few years delayed so feel free to ignore my opinion considering i","useful":0,"cool":0},"IYrRjs1tYwgyxlBrVENjPQ":{"text":"Great food , great service ! Party of 4 and we all loved our food. From the chipotle veggi","useful":0,"cool":0},"t7rOeoRgfCGGsxmL_vpceg":{"text":"Our order was messed up as well as that of the table next to us. It wasn't busy at all so ","useful":0,"cool":0},"_cjqgS17B_rBndqPWbPZaA":{"text":"I hope your name is not Michael. I ordered my food from the bar as instructed and watched ","useful":1,"cool":0},"QG1dCVywDWqBAU4LJ7L-Dg":{"text":"Had Classic Dat Dog and it was good but very less for the price. Need atleast 2 to fill yo","useful":0,"cool":0},"bLMYuZXezD9V8ATHi2N_-A":{"text":"Love this place. Make sure you see Joel and Ryan. They will make your experience. The food","useful":1,"cool":0},"Flgaly_4UWOm257Chu0SRg":{"text":"tldr: The food is delicious but overpriced. \n\nI love duck, so when I heard that there was ","useful":3,"cool":0},"H1Gu_9E4WIzkz2G7ucBVxQ":{"text":"My wife just had to eat here when we went to NOLA.  I'm glad she did, best darn dog I've e","useful":0,"cool":0},"8tQ7n2GcHBwKBTp2wNVueQ":{"text":"No frills yummy hotdogs. Exactly what you need to soak up a bit of booze before continuing","useful":0,"cool":0},"2w4tgvPqMzjvDWQQitNFwg":{"text":"I've been to the different locations that I've moved away from the sausage menu and onto t","useful":1,"cool":1},"vyrMSErGCFKDXszmuO4O_Q":{"text":"This is one of my favorite places now, If you can think of it they'll come up with it, all","useful":0,"cool":0},"LA0pNWo1TPa5mmtOdp4bYA":{"text":"My absolute favorite hot dog place in this city! The buns are to die for! They even cater ","useful":2,"cool":2},"JatPWriSzSpFhR7MXuoR8g":{"text":"Good vibes, loud music, energetic, and an eclectic decor, this two-level (with balcony) mo","useful":0,"cool":0},"i0h9URag5zgh3lerlw-fmw":{"text":"We ordered fries and taters. Messed up my cheese fry order twice. Apparently our order was","useful":0,"cool":0},"beXJUVB2XCbKqEytjMybog":{"text":"While on vacation my wife and I stopped in after a night of cocktails. We were very impres","useful":0,"cool":0},"SSWTbN0e5d7Xs6TpE5xfwA":{"text":"Staff members are super friendly. Alligator dogs and duck dogs were absolutely amazing.\n\nM","useful":0,"cool":0},"f2337EIC9a2h6PO-x6XU3g":{"text":"The BEST hotdog hands down that I have ever had! I have eaten at the Dat Dog in the French","useful":2,"cool":1},"KsOKMdWs3XUOFsRHrL4jVg":{"text":"Wanted to give this place 5 stars because the food, drinks and music in the place were gre","useful":3,"cool":0},"FPcCYUcUtEnkLNNi-aQqjw":{"text":"This seems to be the local spot for a classic or unique Dog and beer. I didn't see the app","useful":0,"cool":0},"pLMo0trtOi5WF4JgbxvEIA":{"text":"Best dogs in town. Great service, great flavor. A place with a heart. Respect to the men a","useful":0,"cool":0},"fS0K2TG4GrYeKUcGjYbW0A":{"text":"This was one of my favorite places while visiting NOLA!\n\nIt's great for carnivores, pescat","useful":0,"cool":0},"st0y68h7erryestnKguPkA":{"text":"We just stopped in for drinks before listening to some music on Frenchman street. Staff wa","useful":1,"cool":1},"9fsar34mrJ89R9apgNKapw":{"text":"It's crowded, loud and noisy, but you are in New Orleans so enjoy it!   Staff is so knowle","useful":1,"cool":1},"9oPjO0k6tgLUW58UtIsOlQ":{"text":"Best damn hot dog you'll ever have. Menu is completely customizable, although I recommend ","useful":0,"cool":0},"GnKYR3mVSiFcff53-9OKyw":{"text":"There was an item called the \"Bacon Werewolf\" on the menu. This was enough to gain my busi","useful":1,"cool":1},"5By86RHsmF9DLCE-7yzwbQ":{"text":"Dat Dog is what's up!! This place is cool oozing  retro vib-ish, funky eclectic, cool, vib","useful":1,"cool":1},"8BjqhJiqXXNtIloyyexyCw":{"text":"IMO, Best Bloody Mary in NOLA.\n\nPairs well with the Vegan Smoked Apple Sage Sausage, toppe","useful":0,"cool":0},"JQtNGFZzxDkbygDQfQCPBg":{"text":"Amazing ! I was thrilled to find vegetarian hotdog that too with field roast mexican chipo","useful":1,"cool":1},"D2--aJPX_DNl-gJHQ6MqQA":{"text":"Had dinner closer close to the French Q but that wasn't that good, so was still a little h","useful":0,"cool":0},"aFcU_H4iUZV5UpCWIDxXZw":{"text":"Somebody told me this was better than Ted's (a Buffalo, NY classic). I couldn't believe th","useful":0,"cool":2},"BN5MH9FRy2bcekotom_K8g":{"text":"Ehh pretty expensive for what you get. We ordered two hot dogs and two orders of loaded fr","useful":1,"cool":0},"FzuoSBkK7LLvpxlctcun8Q":{"text":"Dat Dog is located on Frenchmen Street. We stopped in to get some time on their second flo","useful":2,"cool":2},"NGB8Ge-59DLzxA02KoI_7Q":{"text":"Amazing veggie dogs with lots of toppings to choose from.  And their seasoned fries are th","useful":1,"cool":1},"d7IBCNwffH1JgGLhD7un6g":{"text":"The sausage was good and I thought it was pretty neat to have so many different kinds, but","useful":0,"cool":0},"7QtG9OyF_iZo1CODUeSViA":{"text":"One of our last days in town and we decided to hit Frenchmen street.  It was early so we h","useful":6,"cool":9},"IE_4Nd_Y2ow3-GPDoQDDPA":{"text":"Great food... cool drink menu. Doug and Hanz are fun and responsive. \n\nHappy hour starts a","useful":0,"cool":0},"-cTj-sP0Iea2xO0F-brG9g":{"text":"So I got the Vegan Werwolf. It was tasty! The dog itself was a tad dry and obviously their","useful":2,"cool":0},"aKRJVAhEim5_omIWsf0SkQ":{"text":"Y'know, I liked Dat Dog so much that I ordered three items in one go and downed all of the","useful":1,"cool":0},"6efhbHmZAdjfdOWcFl5rJg":{"text":"Looks like hot dogs are a big thing in this town, and Dat Dog was a surprisingly awesome s","useful":6,"cool":4},"p4C2xr29AD7rsd9WjhjSyg":{"text":"Great location on Frenchmen Street. It seems that the best way to order is at the bar, and","useful":1,"cool":0},"XbAfBgvJdvCd98yicpeRcg":{"text":"This place was hopping on a Friday night, so we had a small wait. But it was worth it! My ","useful":2,"cool":1},"8NqOfY1SMNT8YuGvMRMJaA":{"text":"There is nothing better than running a \"hotdog tab\".  Fun place and great dog options.  St","useful":0,"cool":0},"9WzO9ik5F3nbQF2F0aUvqg":{"text":"Stopped here for the first time during the Intergalactic Krewe of Chewbacchus parade.  The","useful":0,"cool":0},"VPh70ReayUOqkHYzhxKVPw":{"text":"I had a grilled chicken sandwich and did not try one of their hot dogs. I would say the fo","useful":1,"cool":0},"OfJErXLzCM3YFxJdQDB4nA":{"text":"Anything you've heard about dat dog is absolutely true. This place is 100%. It's amazing a","useful":0,"cool":0},"iGb2JNzeMQ9l-yIwKYrJ9A":{"text":"I stopped by with a friend to get food and drinks and we had a waitress who was extremely ","useful":0,"cool":0},"RvGCIhcHLl_ZSYrzI96utQ":{"text":"A great late night stop after bar crawling along Frenchmen street. Huge dogs and great fry","useful":0,"cool":0},"PjJXAkcRqQjOUsxioHWTcQ":{"text":"Located on Frenchmen Street. Service is almost non existant. The food is primarily hot dog","useful":0,"cool":0},"dqwRvi1aMEVUpqNl6pN8Ig":{"text":"Dat Dog is one of those places that you can have at literally any time of day. That's not ","useful":1,"cool":0},"EwRN5tXANroPrWtnH_c95w":{"text":"BEST HOT DOGS EVER. I loved the entire atmosphere of the place (if you're a Star Wars fan ","useful":0,"cool":0},"qK_k2G6fXWKVvlZKoWLgdA":{"text":"We stumbled across this place while exploring the Marigny District of New Orleans. It was ","useful":30,"cool":33},"kHEFU1bTNp_uU0460-BZdg":{"text":"Between music venues on Frenchmens Street, this location made it the perfect spot for \"din","useful":2,"cool":0},"k3G5yuOxr7OiYyAXBadRpw":{"text":"4 stars for the eats. Minus 3 of the 4 stars because of all the grit, grime, dust & muck. ","useful":0,"cool":0},"zZ2IYI15qDZUlAPVV6GHaQ":{"text":"We ordered at 11pm...it is now 11:50pm and we still have not got our food.  11:52- said so","useful":1,"cool":0},"JERADzBDeWoEbRw9lfH5SQ":{"text":"Surprisingly good! I had the fried fish dog (can't remember exact name) and shared a side ","useful":2,"cool":0},"j6yjQqfKj2cjP3fLD7RuGw":{"text":"Well, if you want to try the sophisticated version of the famous \"lucky-dog\" - this is you","useful":4,"cool":4},"bce1GknQQvlt2gsYv4NxUw":{"text":"So good. Such a great vibe and experience and food was amazing. Would highly recommend. We","useful":0,"cool":0},"4BfpWNrRqdBr1t3S7BbniQ":{"text":"SOOOOO SEXY. I could eat here every day.  Thursday night & Frenchman was popping, tried 3 ","useful":2,"cool":0},"WOEiBxIrH3mRrgZtQgLvFw":{"text":"Only the best dogs ever! I don't eat meat so I was super excited about the vegan/vegetaria","useful":0,"cool":0},"WvdUm7DonUEY6owHo4jeHQ":{"text":"I was reallly excited about coming here. However I was underwhelmed. Super cool vibe and n","useful":2,"cool":0},"O3NJecIEOeqeM-OXrBzyQA":{"text":"After 30 90 my husband was hungry. We came here on A Saturday we went upstairs to the balc","useful":1,"cool":1},"dgDDo5wdDSffOwK3pBr2zw":{"text":"Really enjoyed the Chicago hot dog! Staff and bartender service is a little different in t","useful":2,"cool":0},"xm0Iig6WODZwG3iWpPa7bQ":{"text":"The buns are sweet! The Guinness dog is incredible! You can still order the Duck Special a","useful":1,"cool":0},"JVO1tR0R68XJIHMBMmzTkQ":{"text":"Dat dog hamburger was awesome great experience .The sandwich was rolled like a hot dog.The","useful":0,"cool":0},"lOFnD8JWKeIO0zPrv4M36w":{"text":"I'm giving 5 stars because any place and anyone working right now deserves it. We're all g","useful":0,"cool":0},"qecmGYtYqsff3QAyxU7O2g":{"text":"Thank goodness there is a location of Dat Dog on Frenchman Street, because after an amazin","useful":2,"cool":0},"1m2uOxmZ2E6KVCcrZiei2A":{"text":"Firstly, the dogs are flavorful, unique, and cover a wide spectrum of nationalities. They ","useful":0,"cool":0},"avAm6RDPHXY1GRI_WzX5Xg":{"text":"This place was the best place to start the night in the heart of jazz. The service is phen","useful":0,"cool":0},"6l2dFNR8JSQcBtF0keKuTg":{"text":"Amazing. So much flavor and so many options. Food is good quality cheap and a perfect post","useful":0,"cool":0},"mr1U6MAZoaKBQrO0QuuWjg":{"text":"Yum! This place reminds me of my favorite place in Baltimore, Snakehill Tavern! I don't th","useful":0,"cool":0},"7pUbFc4OvM4bz5QmJhbtFg":{"text":"Loveeeeee dat dog best spot on frenchmen , Bartender Ant always makes me the best drinks a","useful":0,"cool":0},"8i4YNSZhIVnEo4PkNXdedA":{"text":"Yummy! Saw this place on food network and bookmarked it instantly. A little pricey for a h","useful":1,"cool":1},"xy3hqu2WnNAEyA294SAj-g":{"text":"This is a must to try, little out of they way, a little funky but food was good.   Loved a","useful":0,"cool":0},"YLH_U6QEJ5v9w6WvxBrCKg":{"text":"Definitely the busiest location of Dat Dog in Nola since the restaurant resides in the Fre","useful":0,"cool":1},"vTAL1i37soganjIg9oQApQ":{"text":"Excellent hot dog and fries when you are in town. This is in a great location if you are o","useful":0,"cool":0},"uytx-KAIjKXTXKLNwvy6KA":{"text":"Fun creations that make for a tasty snack. Nothing gourmet or earth shattering, but tasty ","useful":0,"cool":0},"8lOLK3vg9iEBq7Pa93uwdA":{"text":"Top notch Nola food! Best brunch place in New Orleans! Amazing. Wonderful! Must try totall","useful":0,"cool":0},"9QVlVQv2AWkSJmPUI4KEnQ":{"text":"Awesome food, service, and overall atmosphere. Great menu selection. A little pricey but w","useful":0,"cool":0},"e1v8_dcFgdwDmfYMoxh7bQ":{"text":"Wish I had Dat Dog back home. Highly recommend CRAWFISH ETOUFFEE DOG*\nCrawfish sausage, ho","useful":0,"cool":0},"ughBWkatQ9TfgzJo-ukJug":{"text":"We stopped in late hoping it would be good and checked Yelp AFTER we ordered lol.  Great l","useful":1,"cool":1},"AQ6JfoEIdUQDik5DOQlaaw":{"text":"This is the best place I've ate at New Orleans so far. Can't believe I didn't try it my fi","useful":1,"cool":0},"boCcBwZmpn4XT7bwKCgxtw":{"text":"Came here late on a Thursday night and they were popping! There was an intimidating line, ","useful":0,"cool":1},"yNoYOqwBj7e5ozQdRPhBPQ":{"text":"The place is so nice and the cocktails looked very delicious but I can't take alchool so i","useful":0,"cool":0},"6M4i9L5aEdsBBfCL4CXN3Q":{"text":"We came out of curiosity for alligator sausage. Honestly it tasted just like a regular sau","useful":1,"cool":0},"1vBr86r4ibC-u8rfpqVRow":{"text":"VERY over priced. Cannot stress how over priced this place is. Also, you can get a better ","useful":0,"cool":0},"D-sg7I7fSweT-6w4Yg9TLA":{"text":"Oooooooo mmmmmmmm ggggggg. When I say \"DAT DOG\" was good  I really mean excellente (got me","useful":0,"cool":0},"z9bFJv5m6UVXaOTduvxOJg":{"text":"Second time coming to this spot and they never disappoint! This time around I had my wife ","useful":0,"cool":0},"cuVlR9yn-7p8gkmDURY5Ng":{"text":"Came here to try the duck sausage and crawfish ettoufee sausage. I got the duck and my hus","useful":0,"cool":0},"iEt2RTwlAoK4pTwPNFR2ww":{"text":"1/20/19:Very rude upstairs bartender (bearded gentleman, wore a cap). I paid for my meal i","useful":0,"cool":0},"ZHac_Y3zTWt4x04vTxiG9g":{"text":"Went here on a Saturday night out on Frenchmen street with my boyfriend during our stay in","useful":0,"cool":0},"vf2AKkQ7lMyzddON_b-hAw":{"text":"Literally the best restaurant and bar ever. Dave is absolutely amazing as well as the whol","useful":0,"cool":0},"Ya-7QErFQyUUxb3bQUUYeA":{"text":"Seven people, fourteen different dogs and three orders of fries.  It was awesome!  Everyon","useful":0,"cool":0},"oZjyEi40pLYu7LRhKEcW5g":{"text":"This place is amazing!!! I don't think ive ever given out a 5 star for a hot dog joint.. b","useful":0,"cool":0},"LiTt3CGMc-TWfYCBDVBcWw":{"text":"I enjoyed the atmosphere and the wait staff, everything was relaxed and comfortable. Every","useful":1,"cool":0},"o6qpxy1_2zYoXUFt1oli2A":{"text":"One of our favorite spots we visited while in the big easy! I had the alligator sausage wi","useful":0,"cool":0},"2QLW8mBOrD-8V8JYQN6BVg":{"text":"The cheese fries here are really good, good quantity very cheesy and the fries are very cr","useful":3,"cool":2},"hNpUpp8znvtzLgMM77O9gA":{"text":"Located on Frenchmen, this place was amazing, it was a hot dog joint in the middle of jazz","useful":9,"cool":8},"sBIdFvGSXCkkiQGVvzmTeQ":{"text":"I had the best vegan brat of my life- I didn't think it was possible to make one that good","useful":0,"cool":0},"WdWQnylmn7afLC4G_Xz0gw":{"text":"Never would I imagine that I'd enjoy a hot dog so much! Actually it was a polish kielbasa,","useful":1,"cool":1},"PCNwlXZ41LBNwLEvVOUxkw":{"text":"Great service! Sean was great although he wasn't a he was a server he answered any questio","useful":0,"cool":0},"zEQTSJTUSVoykCmOcANu0A":{"text":"A stop on our New Orleans Secrets food tour. This critically acclaimed restaurant has been","useful":1,"cool":0},"3-emCrL_f0W9q4nIwTRh1Q":{"text":"This is my second or third experience with the Dat Dog franchise. Great people friendly st","useful":1,"cool":1},"HPxKfdzmfDsRc8_uV9VsFw":{"text":"I loooove Dat Dog! I haven't been in a long time, but it will always be one of my favorite","useful":0,"cool":0},"S5VKiUUohVJdCSjGmv05rQ":{"text":"Thanks for pounding the final nail in Frenchmen St.'s coffin.#iswearfrenchmenusedtobecool","useful":0,"cool":0},"21vl7crAVq0nBs9XBwOFOw":{"text":"Wow to their buns! Vegan buns never tasted so good. I got a pre-made hot dog off the menu ","useful":0,"cool":1},"ViUYPhWvvHOVVpIAoq18kw":{"text":"I've been to Dat Dog too many times to count over the last 4 years and every single time I","useful":1,"cool":1},"qVwlwMm9bn4Ha2sxnHNZag":{"text":"Five stars for Dat Dog!!!  We made it back, determined to actually try a dog this time, in","useful":1,"cool":0},"z00blk-VS4iezovpomSVAw":{"text":"Went back to this spot after almost choking last time I came here, but I'm good now. Went ","useful":0,"cool":0},"oRC0NFCORefnb_1txtGrYw":{"text":"Despite how touristy this spot is, it actually does have great dogs! It was hard for me to","useful":2,"cool":2},"z4sX_6jLk1XtSxwqW-IlrA":{"text":"Came in for an early-ish lunch a couple weeks ago and were really happy we stopped in. \n\nT","useful":2,"cool":1},"QtE2VMIWa3YQDWaFvq6b9Q":{"text":"Food is very good but service is quite frankly  to turn a phrase is terrible. Does not mat","useful":0,"cool":0},"bj1poNneQRLGD3egT6BciA":{"text":"Hot dogs were delicious. 10 out of 10. Chilli cheese fries were terrible and should be ref","useful":0,"cool":0},"Y2JcUuoW5MV_t5yuBckxoA":{"text":"Walking around on Frenchmen Street trying to find a place to get a drink, I realize everyw","useful":1,"cool":0},"YVNAu5jwuLJT-CxO__xrTw":{"text":"We came for Trivia night on my first day in New Orleans and it was a lot of fun! The staff","useful":0,"cool":0},"feLprs5CLjyYxOMS6WJYAg":{"text":"Came here for lunch on a weekday, so it was pretty empty; but we didn't mind b/c we could ","useful":3,"cool":3},"YTvSzMxLdfkccRG9ITystg":{"text":"I'm not a big fan of hot dogs, they had me at gator sausage. My friends and I got to NOLA ","useful":3,"cool":4},"k4qRXYWYE-_Z5-FsNeXRhQ":{"text":"If you're looking for drunk food, this is the place to go. But I've honestly made much bet","useful":1,"cool":1},"SIa7rvS6cHPtN6H5BdsvhA":{"text":"Dogs are dat good! Friendly service great toppings! Only the food took a fairly long time ","useful":0,"cool":0},"K_TTvqhRmFR_kbAqA4ghGw":{"text":"The best dog on the city - they have a great selection of specialty dogs, or you can creat","useful":3,"cool":1},"ThsQYqlEkFPlgxCoFplsSg":{"text":"I was intrigued by the unusual collection of hot dog artwork on the windows of this place ","useful":0,"cool":0},"9rSBe8vvEOxgmohDy5oMUg":{"text":"Came here on the recommendation of our airboat captain from airboat adventures. I had the ","useful":0,"cool":0},"PQgfFEqjx64y_qvlZL_2tw":{"text":"We came here looking for a place that wasn't too crowded, where we could sit for a drink a","useful":0,"cool":0},"1y3mvyjpIRoPUdoFTgti9w":{"text":"In case you were wondering... YES! YES you must visit! \n\nThis place is such a gem in the c","useful":1,"cool":1},"2F_Y4YxcYxoCGJfWmW2G1Q":{"text":"Without question, the best sausage on a bun anywhere.  I come to NOLA at least once a year","useful":1,"cool":1},"OHFW_mqLyJNeYQouFCyeYA":{"text":"As much fun to talk about as it is to eat at.\n\nDat Dog in addition to having a wonderful n","useful":0,"cool":0},"96kBLs8olekU6T5dbLVsyg":{"text":"I was hungry on Frenchmen Street & the wait at Adolfo's was grating on my nerves.  I found","useful":3,"cool":2},"fEkObUc_7Cb-SmVUqeVxlg":{"text":"Quirky, delicious, several awesome locations, and a great value - what more can you ask fo","useful":0,"cool":0},"0zvuZbJbNuJt8R3euV5waw":{"text":"So these hot dogs are nothing like what I was ready for! They were really good and a lot o","useful":0,"cool":0},"n7kq67b0vM71QcKlvQ8iIg":{"text":"Amazing home made duck hot dog - perfectly dressed with the toppings of my choice ! I want","useful":0,"cool":0},"4oAuH17vUH5c2htJtOTy0g":{"text":"Check it, so we're in NOLA, picking up my in-laws unfortunately.... Anyway, my wife's frie","useful":0,"cool":0},"I9UcOXwjXTo3XCUZ-o6IMw":{"text":"*pre-COVID-19 review* \n\nHoly moly, we loved Dat Dog! I remembered reading Anna K's review ","useful":8,"cool":6},"TOFvoDeaDN63oxmg1Pb2OA":{"text":"The bartenders own creation the 5 S's Duck Special was amazing. Out of this world deliciou","useful":1,"cool":1},"OT72nl0m7UmHUc99raJ2vw":{"text":"We were looking for something to eat that was near the flea market and this came up as a s","useful":0,"cool":0},"8dgt_nTk6wG1L47IzhuuSA":{"text":"An hour away from one of the parades in NoLa, we needed something to eat before we kept go","useful":14,"cool":8},"uFAqP8KS70TmQjB4c8x_wg":{"text":"My first visit to Dat dog was the location on magazine St and the food was amazing but thi","useful":0,"cool":0},"EXROZWHHbnufv7mN4kjj-g":{"text":"We had the Bacon Werewolf and Cod. Both delicious but Bacon Werewolf stole the show. BEST ","useful":0,"cool":0},"a9YxlHZH6or5Y0snqmPvpw":{"text":"The chic who works in here (young African American woman) acts like she's being bothered a","useful":0,"cool":0},"PfU_ZqyIbQkiOn6bs4JMaA":{"text":"We were excited to come to Dat Dog because it's cute and the menu was simple. The good new","useful":2,"cool":0},"zWrkp38r-0IRGwiM7-zNfQ":{"text":"Dat dog is open late so we stopped in for a late dinner after a ghost tour. I decided to g","useful":1,"cool":1},"b3mMinHk9jk6i9ugDQEViQ":{"text":"I am vegetarian and am always too skeptical of trying anything vegan because most vegan it","useful":2,"cool":0},"KVf1eEEETbO4gncfl9arTA":{"text":"OK... I love Datdog. This time just wasn't like I remembered it... Or it could be the evil","useful":0,"cool":0},"SSugDUMNnwzW8G4f21iTpQ":{"text":"This place is bomb. It's got a fun and funky vibe and something for everyone. I go with th","useful":0,"cool":0},"epc0LfZ_0KKyM2hnbfmA-A":{"text":"Must do for one meal in New Orleans. Large selection of hot dogs for everyone. Plenty of s","useful":0,"cool":0},"FsdLC-UB-FjNHTo-U08q9g":{"text":"Small place with unique 'dogs'. Would come again. Reminds me of a ice cream shop from my c","useful":0,"cool":0},"U8qnnMUsq7dIzuyXzeJ7ow":{"text":"Probably my favorite restaurant in New Orleans, La! It's great because it has awesome meat","useful":0,"cool":0},"QFAPa6QFdKtJn4V2z_7H-Q":{"text":"So me and my wife stopped into Dat Dog twice while we were visiting the big easy. We enjoy","useful":0,"cool":0},"3Qc497U4DIbVkWuxIlgdXw":{"text":"*post covid review!! Really good food, we went around 2/3 and there weren't many people. N","useful":0,"cool":0},"8k4TJhNK9leLg_ozdbkrnQ":{"text":"Dat Dog is like a refined version of a hot dog stand with a lot more options. \n\nIf you don","useful":1,"cool":0},"Ium8S7_33FfhUiW2YZIZmw":{"text":"THIS PLACE. so mf good. we got the vegan dogs. i got the chipotle one and it was extremely","useful":1,"cool":0},"UF9UcvLwiz8dJEI4hq-9AA":{"text":"Alligator sausage with Crawfish Etoufee - can you say several tastes of NOLA in one bite? ","useful":2,"cool":2},"Er14XtuhF9UUuJfR_91zBQ":{"text":"Truly awful experience. I waited one hour for a hot dog with ketchup and mustard. I repeat","useful":0,"cool":0},"VhCnDodcVkDEElEkW7fZiw":{"text":"Definitely will come here again next time I'm in NOLA. Its my New Orleans version of Pinks","useful":1,"cool":1},"Cj94Hv4EGltg4Xkbc60KsA":{"text":"Something for everyone! Vegan food isn't exactly easy to find in New Orleans, and Dat Dog ","useful":0,"cool":1},"cSkN6WmstdL9wyqtQJHYCg":{"text":"Late summer 2014. Dad had fallen asleep way too early, so my then 25 year old daughter and","useful":9,"cool":6},"lqeSZuuoQ8AaKRQLBkOaJg":{"text":"We waited over an hour for food. Everyone that ordered after us got their food, had eaten ","useful":0,"cool":0},"sjNxMKy5CkJqVSrarxlIsw":{"text":"Dat dog has been bookmarked on my NOLA list since before I last visited. I will blame part","useful":1,"cool":0},"FcXTzigziTFzh-dXv9Ozjw":{"text":"I stopped by here on my lunch break last week to grab a to-go order, but tried to multitas","useful":1,"cool":1},"XIARcUoupSI1raNmm_ykPQ":{"text":"5 stars partially for being, from what we could tell, the *only* reasonably inexpensive pl","useful":3,"cool":3},"m2-6QCNey06_4ApNMAzokA":{"text":"Dat Dog was so delicious- I went here twice during my trip to NOLA. The Chicago Dog was my","useful":1,"cool":0},"xgPoV3U4HcSd9XpUOuTE8Q":{"text":"Good eating here boss I love it. Son of a saint was nice real nice... need more nothing mo","useful":0,"cool":0},"mn74lmRgqokfzf8rc3bXCw":{"text":"Loved this stop on magazine street for a quick lunch! They have a really unique menu of in","useful":1,"cool":1},"3nboELC1jZkeWUcVbQXfBQ":{"text":"It's a hotdog, folks. You can eat these anywhere in the country, why would you choose to e","useful":0,"cool":0},"maANcBzlwxQxIQT2tWvBOA":{"text":"I looove dat dog! Their fries are amazing and I love the casual atmosphere. I must say, I ","useful":3,"cool":1},"eMN1RwMbHFzjmWFuZZHEwg":{"text":"I just read another reviewer who discovered the same thing I did last night. The veggie do","useful":3,"cool":0},"mnLHlnS5JZFD0HxWuBT1eQ":{"text":"This place slaps. I had the fish hot dog with spicy mustard instead of regular mustard. Al","useful":0,"cool":0},"b7R0QoF58hKnpYx5NkwMcg":{"text":"We had Hot dog with Crawfish Etouffee. It was excellent. The hot dog is a sausage. we had ","useful":0,"cool":0},"obXTngVS2LLbxbdnLbfwKQ":{"text":"Dat Dog, Dat Dog, Dat diggity dog. If I could afford to franchise this business oh man, oh","useful":2,"cool":1},"PFIwd5Vf80uHmABWaiC9mw":{"text":"They are good in food. It's a typical Nola French quarter place. Very busy but worth the p","useful":1,"cool":1},"kdZpgsINn6D3SpqKs7K4jw":{"text":"I just tried to order TOGO and they told me I couldn't order food without having a vaccine","useful":0,"cool":0},"eWv0v5640qr26389XP-ajg":{"text":"My friends and I stumbled upon Dat Dog on the way to our car after eating at another nearb","useful":2,"cool":1},"pFu9qer46cPQBjwKKFcECg":{"text":"We heard this was a go to place, especially on a hangover day...  We stumbled upon this lo","useful":1,"cool":1},"x_Olx6gCAYikzc91h3-WBw":{"text":"I don't even like hot dogs.\n\nWhen we visit New Orleans we inevitably end up on Frenchman S","useful":1,"cool":1},"45PmUkjY_D_GZgMoHP8V9A":{"text":"Amazing hot dogs! \nI made a custom hot dog with alligator sausage and I was not disappoint","useful":1,"cool":2},"FE2mW-Bzq8Jrkc1G9wQRvg":{"text":"So freaking good! Surpassed expectations. I had the vegan Italian sausage and had the chef","useful":1,"cool":0},"j2RnDkFZhJxl9YLZZN0zRg":{"text":"Since I live in the French Quarter, I was looking for something quick around the Quarter, ","useful":1,"cool":1},"XRfHtidm2paAo96HOEQ_NA":{"text":"I came here expecting amazing modernized hot dog twists to Creole dishes, but I was left d","useful":2,"cool":0},"8j3jDpHntyIeF1FepE-MTQ":{"text":"Take some pride in the bathroom you have available for customers. Leaking toilet with a br","useful":0,"cool":0},"Tc49QuFQLiXgbIBoPiAvKw":{"text":"Really stopped here for an excuse to go out on their second floor balcony over Frenchman S","useful":1,"cool":1},"CkeSqvLyCC5moMQJ6wD9eA":{"text":"When in New Orleans we decided to go over to Frenchmen Street. I have been to New Orleans ","useful":8,"cool":11},"xX10D91FIombjMnsA-jvNA":{"text":"This place was recommended by my friend. You can either sit downstairs where you order or ","useful":2,"cool":0},"UiCCh0HPFCD3_cpmDXhl0Q":{"text":"Delicious dogs - they had a variety of fun hot dogs! Keep in mind this place truly only se","useful":0,"cool":0},"7bxLPw5hNYsalnus-3--gg":{"text":"It was a pretty good , so much to choose from ! The only problem was it was a bit expensiv","useful":0,"cool":0},"pryxp0K1K8-Npmm9AiBaUQ":{"text":"Amazing price and yummy sausage. There's indoor and outdoor seatings. Their hurricane  is ","useful":0,"cool":0},"apxvQkdLFgiER-P1VW0TGQ":{"text":"The atmosphere is so kickback. Happy hour was awesome! $1 drafts! The hot dogs were delish","useful":3,"cool":1},"uVNwpijaub4AEFLK_kHnjg":{"text":"Great place for yummy hot dogs and late night eats! I had a crawfish étouffée sausage and ","useful":1,"cool":1},"4NYdd_NX1Unr5hA2zlmCVg":{"text":"THE BUNS! I can't get over how amazing and soft and delicious they were. Dat Dog has speci","useful":1,"cool":0},"LQgk9i3HSYrUFFlY9B71bg":{"text":"Thank God this place was 30 feet from our hotel because we were hungover! \nSo, first of al","useful":2,"cool":2},"2pOgMXjIQSlHQVtF-XE-iQ":{"text":"It's a good place to grab a gourmet hotdog! The one on Frenchmen has a little more flare, ","useful":0,"cool":0},"3A5ETZM5k7dF5Bq103x-mQ":{"text":"Surprisingly great hot dogs and sausages on a bun. I had the Chicago Dog, which was true t","useful":11,"cool":9},"usg5-0GGdBEVCqGXM4NKdw":{"text":"This place wouldn't let me use their restroom because I wasn't ordering food. I guess that","useful":0,"cool":0},"TmL-zLfU9GmB8TjB3W4Xuw":{"text":"Dat Dog is a great late night eatery when you're out at Frenchmen's street and finishing u","useful":3,"cool":1},"Z50bE2LjzXI-CwSWhAjXBg":{"text":"Delicious cheese fries w ranch dipping sauce wow\nAlso yummy dogs! All kinds of toppings de","useful":0,"cool":0},"zLToIEyGm1Oryfre0eMHBA":{"text":"Hungry while walking around Frenchman street, and this place was recommended from a couple","useful":0,"cool":0},"q_2VxSAitHojEFWWikfIUA":{"text":"Who doesn't love a hot dog? Dat Dog is a fully customizable hot dog eatery with a fun saus","useful":0,"cool":0},"yXtAUruZsVQXq7x6puXthQ":{"text":"Tried to go on a weekday just before sunset. It was so packed and the line was disorderly ","useful":0,"cool":0},"Tt1GalfslOIZzlD6bqd3sQ":{"text":"Great food, one of the only things open on a Monday past 7 around here. Reasonably priced,","useful":0,"cool":0},"DwvBcTXjaKKVr7CrLghMvg":{"text":"In a drunken haze, my friends & I stumbled in here and stuffed our poor, huddled masses wi","useful":2,"cool":0},"0YDsSU-eVMQehfukMCDCsA":{"text":"Everything was awesome, service was kind and attentive, and they were super accommodating ","useful":2,"cool":1},"8-up3WbdSq_vZSSisiFpww":{"text":"Oh. My. Gooooooodness. \nA friend on our trip to Nola was raving about Dat Dog, and was ins","useful":0,"cool":0},"74JpIyVD5WBbomAuHkGfLw":{"text":"A lively, casual place to nosh in between taking in some jazz on Frenchman! It's one of th","useful":25,"cool":22},"0Kf9-EmxHGlEexSigYyrnQ":{"text":"Late night drinking, check, late night eats, Dat Dog check! Now land to Frenchman Street, ","useful":7,"cool":9},"cpPV6stkX035sRGQpremgA":{"text":"Yummy yummy for the yummy they have a big menu. Good location and man I am going to miss t","useful":0,"cool":0},"tu0zRi8PFO_kzdaC236EvQ":{"text":"remember location? This is it. The best possible for a quick hotdog of your choice, along ","useful":1,"cool":0},"Xl7MNIpT0ZMnnptFA2-KhQ":{"text":"Things have defiantly changed for the worse since COVID. This was a weekly spot for my fam","useful":1,"cool":0},"ZuKFCFZr1uZpl7BmEqNcTw":{"text":"Both hot dogs were SO tasty and the chili cheese fries were INCREDIBLE. Definitely a must ","useful":3,"cool":2},"0UqwdKx6Lers6WCocsgCRg":{"text":"Crawfish étouffée fries, you complete me   And these are not your dads backyard BBQ dogs. ","useful":0,"cool":0},"FGUujB0kaHdZNS-LmJpRrg":{"text":"This place is really special! I got delivery last week and was so delighted. The dogs are ","useful":0,"cool":0},"gYHjSAhoPTYqZj2twk7Kbw":{"text":"We came here after a long day and evening of hanging out in the French Quarter. Dat Dog is","useful":1,"cool":2},"VrfHsUJEA3Cfeg8NUKePaw":{"text":"Yes, yes, and more yes! \n\nDelicious veggie sausages in a perfectly toasted bun with all th","useful":2,"cool":2},"YQJrNGVQ1yE3XDFe4CHRaQ":{"text":"* Vegetarian / Veggie review *\nI'm a vegetarian foodie that has a lot of meat eating frien","useful":2,"cool":1},"l8qi5jebLDWsIicqAv4Sog":{"text":"Spent months looking forward to coming here but the service was terrible and the food was ","useful":0,"cool":0},"Vr4YzxJRs_y3s6-jajpSOA":{"text":"The upstairs balcony is awesome. Late at night they have live jazz music playing on the st","useful":2,"cool":0},"c8_cEhPXxi8vGsMFqFetdw":{"text":"We ordered the alligator meat hot dog. It was layered with homemade mustard and bacon, and","useful":2,"cool":0},"Jzumu13JRZDrDjw7aTC5VA":{"text":"First thing ya need to know is that the location is in an amazing location, surrounded by ","useful":2,"cool":0},"drgKy6E2OR4iHnkRQ_gUtw":{"text":"We stopped by Dat Dog while walking along Frenchmen Street. We weren't even hungry, but ju","useful":28,"cool":28},"0oFUwdJc-NR3cetIG7ZGoA":{"text":"I'm a forever fan of Dat Dog, even if my preferred location is the one on Magazine. This l","useful":19,"cool":19},"X0-d-g_ZOWy9iPbcgS08Ng":{"text":"WOW. Coming from Chicago, I draw a harsh line when it comes to hot dogs. But Dat Dog was h","useful":0,"cool":0},"zqHj_GPzirjTOyxFjelcSw":{"text":"\"I'm not dead yet!\" croaked old Frenchman, the dear\nFrom inside his coffin we faintly coul","useful":0,"cool":0},"Ug7Iyc2z54BI63n-wEtJMw":{"text":"Some of the best hot dogs I've ever had... I love how unique this place is they have rare ","useful":0,"cool":0},"C8BHF2ImHrPtAkDCbqKMWQ":{"text":"We went to this location on Sunday for lunch while walking around in the quarter. The plac","useful":1,"cool":0},"LiieWRFj34zuveUL7fWh-A":{"text":"Great stop for a hotdog ! Just outside of the French quarter. It's a bit of a walk we deci","useful":1,"cool":1},"wAu_N9RzNA9hNZLBJkbWSw":{"text":"The ultimate customizable hotdog joint!!! This place was so good. A little on the pricey s","useful":0,"cool":1},"UbHs1mn7fHy64rwBFdozPg":{"text":"My friends & I ate here on a Friday night after many drinks on Frenchman St and DAMN I did","useful":5,"cool":3},"oC_Fl7odarBTRomeytlimw":{"text":"I've been to a couple of their local eateries, where the food and service is solid.  The F","useful":9,"cool":9},"IDOU0gnNYq_QJlv6YP81tw":{"text":"My hot dog was really good I was craving a good street made hot dog and this place gave me","useful":0,"cool":0},"59RMvAOGyNRjxLzSRqf24w":{"text":"Wow! This place is DE-LI-CIOUS!! Honestly, I can't even remember what I got, but I remembe","useful":3,"cool":3},"nCU1apdwwb2mIT-nukcHkA":{"text":"We stayed in New Orleans for a week, and this was one of the places I wanted to try since ","useful":2,"cool":1},"D0_l_fk1TkR_j5JwYC60hA":{"text":"**POST COVID REVIEW**\n\nVisited around 8pm on a Saturday night and there was a bit of a lin","useful":1,"cool":1},"GavzQaypRww_3kaZnSWfHg":{"text":"Had the bacon werewolf and the crawfish ettoufflé dogs and I am dying, in a good way.\n\nThe","useful":2,"cool":1},"6LT8sZJyruYaP2IFP9OUYw":{"text":"Holy Crow the last time I saw that many fine specimens of dogs was at The Westminster Dog ","useful":11,"cool":9},"KDnrqlzmFZA11J5PheFsdw":{"text":"Thrilling to have such delicious vegan options at a hot dog stand!! Sit outside and listen","useful":0,"cool":0},"Cgiayi7Ni9FrmDrGMVWXRQ":{"text":"I actually ate here because my sister had visited months prior when she was in town, and s","useful":21,"cool":16},"kh6jHSeo9U8Xe45ysWFf-Q":{"text":"My NOLA colleague recommended we grab a New Orleans tradition so we made our way over to D","useful":1,"cool":2},"D_tvCr3ZnxyTebsK8APhIg":{"text":"This a cool late night, no frills spot when you want to fuel up before or after a night of","useful":1,"cool":0},"sg1zBRUphZLT-TTA3XfQKg":{"text":"We have tried the Rougarou( Alligator) and crawfish dog. While they were both very good th","useful":0,"cool":0},"Z6a3fzzgUDZPHbQX5d96iw":{"text":"Ill keep this short, vegan and vegtarian options are here! yes you read that right, drunk ","useful":6,"cool":6},"7Vzkg_Xs5WTvNZIPSclxyA":{"text":"Such a neat place! Service was very quick and the upstairs room was air conditioned to the","useful":3,"cool":3},"bkteGeSs9C_nI_tmBax81Q":{"text":"Hot dogs are good and so are the fries. There's a vegetarian hot dog option; I haven't had","useful":1,"cool":0},"U3IN9rF1Il9JX-eSKXO0_A":{"text":"Ok don't just think about eating here, get in the car now and go eat at Dat Dog! My wife h","useful":0,"cool":0},"Omw3hl4epX_SdmMV5ua4vg":{"text":"This is a busy place on a Friday night but we started and ended our night on Frenchmen her","useful":1,"cool":0},"7Ee6wbjiKGcblq0x2N4kXQ":{"text":"Ate here twice during our stay in New Orleans. So many choices can't go wrong. It does get","useful":0,"cool":0},"r7nXfhVyQfEvWUaQlq_Kpw":{"text":"I love a good hot dog! My husband and I had a full agenda for the day and were looking for","useful":2,"cool":0},"mk6bK1HcADX_7NfXpIgiyw":{"text":"Service sucked. Registers were closed so we had to order at the bar and it took FOREVER. I","useful":0,"cool":1},"i0Ijos7Ph0kn9BriVXrOog":{"text":"We read a lot of good reviews on this place. It wasn't even super busy. All of our friends","useful":1,"cool":1},"9ll1GRzfZWsvlQ0sMUFs7g":{"text":"Great vibe! Great place! And amazing prices. Very welcoming. I'd recommend a chili cheese ","useful":0,"cool":0},"IQTRTtAGz7qjXx4g01g3FQ":{"text":"I am not a hotdog person. My bestfriend is I decided to try it cause she was craving one o","useful":1,"cool":1},"5tqyxEjbaVd98QkzY4vi-A":{"text":"If you're visiting NOLA this is a must stop! I'm pescatarian so I got the crawfish dog. If","useful":3,"cool":4},"eBf3buZcbYPT8MAg4zJBhw":{"text":"After a long, long day of traveling (and I mean LONG), it was time for late night sustenan","useful":5,"cool":4},"TDLcHf-i211DNzKWmBCd9g":{"text":"Great spot to eat and listen to the music of Frenchmen St.  they have a great selection of","useful":1,"cool":0},"q6xUo_gV8N_ZxPz7YjRAqg":{"text":"Man where do I start. The crawfish dog with ettoufee sauce! It is a must try. The Dijon mu","useful":0,"cool":0},"ujsWSJYk_0j1KaOPPv1PjA":{"text":"I had several people tell me to make sure go to Dat Dog while I'm in New Orleans and my fi","useful":1,"cool":2},"w6cOWKOfgJ-__viwgkdx4g":{"text":"OMG!  This is the place for you If you are to come to New Orleans!! Hands down! I'm picky ","useful":0,"cool":0},"EDo7keGC3g07EYZmxAVYfg":{"text":"Awesome dogs and awesome drinks. The restaurant gives you a 60 or 70's vibe. Friendly staf","useful":1,"cool":0},"FooUA0ve53LwFkuR_SlDng":{"text":"Walked quite a ways to get here and it was totally worth it. First timer and the owner/man","useful":0,"cool":0},"c-hoT-e1CFdReeA0NyZDuA":{"text":"Hans is the best server/bar tender in New Orleans. Great recommendations. The dogs here ar","useful":0,"cool":0},"785_DCHNeXHeAnEGU1R65g":{"text":"I hate leaving a bad review as much as the next guy, but I have to be honest. I was initia","useful":2,"cool":2},"vHTGzpFGCo5OBPDJApMBhg":{"text":"Had lunch there, no problem with service. Ordered gator dog, crawfish dog, and etouffee fr","useful":0,"cool":0},"VQgeq1FsSAMi5qTBMxMd3g":{"text":"Always been against eating here (I don't care for hot dogs) but I searched yelp for loaded","useful":1,"cool":0},"Qe8LFerinE1oARTBHj7lfA":{"text":"Holy moly! Who knew hot dogs could be so interesting? I love the hamburger dog and the gat","useful":0,"cool":2},"lU3aE82PVkneOtd9EKmyPQ":{"text":"Enjoyed this place.  Very cool menu.  They know what they're doing and definitely know how","useful":2,"cool":1},"flX51g861sICREEBm9QnTQ":{"text":"Was excited done in seating was open this go around. Come here every time I visit NOLA, ne","useful":1,"cool":0},"HCTX7XrHRt6vPuSeyo0ASA":{"text":"Sooo yep, I love this spot in Nola. Every time I'm in town i have to go by to get a Bacon ","useful":1,"cool":1},"L3gGfsSPt7MzVlwybdLenw":{"text":"This place came highly recommended as they have several vegan options. We were super excit","useful":0,"cool":0},"4VjhbbuGLrb9H4wxy3cT5w":{"text":"Great selection, tasty hotdogs and toppings.\n\nGreat view of Frenchmen Street from upstairs","useful":0,"cool":0},"JIX7kAaqgztQR1ozxUc6-Q":{"text":"As a vegetarian, I was SHOCKED this place had not one but FOUR vegan options! It's tough f","useful":1,"cool":0},"DLsednIdgaSdMupEnfqU_w":{"text":"I finally tried Dat Dog and I was very impressed even though I'm not crazy about hotdogs a","useful":1,"cool":1},"n6hW4ewp8unf7HkF7NVuoQ":{"text":"I recommend the crawfish sausage (topped with seafood etouffee and dijon mustard) - really","useful":1,"cool":2},"2rSN451puyOW9j-ixg9Cjg":{"text":"I ate here 3 times in one week while staying in NOLA. As I sit here drunk in a booth at th","useful":0,"cool":0},"dQ_gG09JBnx6nJtzgvihig":{"text":"Chains and restaurants placed in the middle of a party street normally send me running but","useful":1,"cool":1},"q33NLzoMpIXcWAXc71sR-g":{"text":"Great cheese tots. There's a balcony upstairs where we got to sit and enjoy the street jaz","useful":1,"cool":0},"o3i541iuLjRsL0bZvMIhSg":{"text":"Had a Chicago Dog, Etouffee fries and tried the Guinness Dog! Awesome dogs!  Cocktails wer","useful":1,"cool":0},"XDDAm3bAQszBWbivDJg5RQ":{"text":"I'm a dog lover, been one for as long as I can remember. Rarely can I pass a hot dog cart ","useful":4,"cool":3},"nKR6jNHlK-mMufdvI-QhvA":{"text":"Nice selection of different kinds of hot dogs and great location. The decor and upstairs i","useful":0,"cool":0},"tFrChhii1aAci-Nz7WZQag":{"text":"I've been to New Orleans a handful of times and don't know why this last visit was my 1st ","useful":1,"cool":0},"H4ykHNHNZjuR6CjAFuTuEA":{"text":"Very first night in NOLA and we ate at Hot Dog. When you first walk in you are expected to","useful":0,"cool":0},"SaD0vk5mdXKh8Bk6kDyipg":{"text":"I think the best hot dog EVER!! We went to the Frenchman St location twice.....just to mak","useful":1,"cool":0},"Srd8myjzkuOeaW4wLmqjqw":{"text":"\"Dat Dog, Dat Dog, dat diggity dog!\" \n\nBelieve it or not, one of my favorite restaurants i","useful":0,"cool":0},"385wFuB1Xu7WY6-NyZVDlQ":{"text":"Fun spot to grab a bite after listening to some live tunes next door at the spotted cat...","useful":0,"cool":0},"NO995xz7xxYZS7qY5F09Dg":{"text":"While walking around NOLA we came across Dat Dog. Great service and amazing food. I had th","useful":0,"cool":0},"MVqXTjQyHqM-ZwSd4so3hQ":{"text":"Pretty solid place to grab a quick bite before a night out on the town! They have several ","useful":1,"cool":0},"hTk0O2mHQ4jXpFFXkv-_qw":{"text":"This large new presence on Frenchman Street is an affordable option for a fast meal, usefu","useful":3,"cool":1},"fdDE8O66S0__tvpxqbNV4g":{"text":"Definitely a must ! The alligator hot dog was out of this world ! I had that and some fire","useful":0,"cool":0},"AP3vytB-YmDfqbm2Hr4X8g":{"text":"Ordered Son of a Saint, substituting the hot sausage with a beef one. This is so freaking ","useful":0,"cool":0},"zxlGLL45RW0PhQIjwNPKTQ":{"text":"Food shmacked. On a scale of 1-10, 10 being the most shmack. Dat Dog was a 10. \n\nNothing b","useful":3,"cool":1},"PHyTVljlnj0QUKKqE7P3PA":{"text":"Dat Dog is a fixture on Frenchman Street, and I can't believe that last night was my first","useful":11,"cool":12},"K2Gjy_eXzrFgKqZeqDfvHQ":{"text":"I was super excited to see they had vegan/vegetarian options so I tried the spicy chipotle","useful":0,"cool":0},"QTE6zgemdsMRVPwqojnOVA":{"text":"This place looks like it should be on the beach with it's bright colors and benches. But s","useful":1,"cool":1},"DLJg-RZrjyty13yteNfNXg":{"text":"The GATOR DOG! Amazing, plus you get to choose as many toppings to your hearts desire!","useful":0,"cool":0},"GnAuhkvl-486LZ3XTz4_AQ":{"text":"The hotdogs were delicious and the staff were really nice and accommodating. They helped u","useful":0,"cool":0},"LxLBsNnFVQfLv30kcvamLw":{"text":"Amazing.  For a \"hot dog\" joint, the food was great.  I ordered the Bleu dat burger and to","useful":1,"cool":1},"Wka-MZ38bVzKKJzc2qJOOg":{"text":"My favorite meal during our weeklong visit in New Orleans! Staff was very friendly, food w","useful":0,"cool":0},"JH8ETY1G--0iIe79x_QCFw":{"text":"Late nights in New Orleans? Can't find a quick spot to eat? Dat Dog is your spot! We came ","useful":1,"cool":0},"9Ufjr4fJoXv3Irdbry4kiQ":{"text":"I came here for what I thought would be a quick lunch. I'm trying to avoid red meat, so I ","useful":4,"cool":1},"2qWafZoBO3mGwzlDAafdxA":{"text":"Omg, I've been wanting to come the Dat Dog for some time. I'm always in my hometown for a ","useful":2,"cool":1},"IjDLgRN_jMKZv7c9ar_26A":{"text":"Heard about this spot by someone on the plane! \n\nAfter drinking, this place hits the spot!","useful":6,"cool":5},"w_PPiq5Q0g4OlnCYn6u2Ew":{"text":"Great local chain of bar/grills that focus on hot dogs. Some very creative topping to choo","useful":3,"cool":1},"xjuiOSsFxr3urCOVksKJUA":{"text":"Damn, this place was absolute fire. (Pre-Covid review. SORRY I'M SO DELAYED!) \n\nFirst off,","useful":4,"cool":5},"mTlk88mBtrgFFDnXBcKUKg":{"text":"Delicious hot dogs, with your choice of toppings. They'll also cut them in half for you if","useful":3,"cool":2},"TC5ALarKRMW-rkgle9hj8Q":{"text":"Dat Dog was suggested by a local while I was on vacation. IMO, if a local makes a suggesti","useful":2,"cool":3},"k90xO1H3syyDO7MnSZ4EKw":{"text":"Love this place.  Chef choice is always right.  Great vegan options.  Good beer selection.","useful":1,"cool":0},"Ylhc5VPGX6C2zo_lx76onw":{"text":"We wandered into the Quarter on Frenchman, after a few hours with a few little ones in the","useful":2,"cool":2},"2a03qno0vqdE1uIfYxFIhg":{"text":"meat- gator dog was good but the fish dog was a dog of cod which was not good. \nVegetarian","useful":0,"cool":0},"BgAueuVe9DuEDGiNMFkGig":{"text":"Best hot dogs in town, bar none!  Everything about them is top-notch from the meat (or mea","useful":1,"cool":1},"OOcZ2VmsBF5WG4BD6NxvjQ":{"text":"This place rocks, dawg. The alligator sausage is the way to go. Cod fish sea dog isn't bad","useful":2,"cool":2},"qNNRzFAuxgwuHIY0jjU7nA":{"text":"It's like the mellow mushroom of hot dogs. Super colorful and an awesome vibe inside. Thei","useful":1,"cool":1}}